{"id": "http://arxiv.org/abs/1108.5483v1", "guidislink": true, "updated": "2011-08-28T00:22:50Z", "updated_parsed": [2011, 8, 28, 0, 22, 50, 6, 240, 0], "published": "2011-08-28T00:22:50Z", "published_parsed": [2011, 8, 28, 0, 22, 50, 6, 240, 0], "title": "Groundwater age, life expectancy and transit time distributions in\n  advective-dispersive systems: 1. Generalized reservoir theory", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.4303%2C1108.1108%2C1108.3992%2C1108.0603%2C1108.1916%2C1108.4530%2C1108.4511%2C1108.2715%2C1108.1844%2C1108.2551%2C1108.0558%2C1108.2847%2C1108.0378%2C1108.0634%2C1108.5052%2C1108.2801%2C1108.2792%2C1108.2585%2C1108.0456%2C1108.0089%2C1108.3452%2C1108.5741%2C1108.4448%2C1108.3722%2C1108.5449%2C1108.0569%2C1108.4572%2C1108.5973%2C1108.5618%2C1108.2039%2C1108.2110%2C1108.3330%2C1108.2158%2C1108.5512%2C1108.4563%2C1108.5407%2C1108.1038%2C1108.2615%2C1108.3565%2C1108.3136%2C1108.1638%2C1108.2693%2C1108.2448%2C1108.3816%2C1108.1780%2C1108.2705%2C1108.5307%2C1108.5779%2C1108.2930%2C1108.4675%2C1108.2281%2C1108.4858%2C1108.5483%2C1108.3580%2C1108.4327%2C1108.5359%2C1108.5425%2C1108.3306%2C1108.0387%2C1108.0693%2C1108.3835%2C1108.1353%2C1108.4156%2C1108.6045%2C1108.6148%2C1108.0425%2C1108.4371%2C1108.2807%2C1108.0820%2C1108.1163%2C1108.3167%2C1108.5118%2C1108.2563%2C1108.3483%2C1108.4131%2C1108.3045%2C1108.3637%2C1108.3331%2C1108.6087%2C1108.0562%2C1108.0412%2C1108.4959%2C1108.0756%2C1108.5421%2C1108.5245%2C1108.1815%2C1108.4958%2C1108.5342%2C1108.2562%2C1108.4440%2C1108.1732%2C1108.0568%2C1108.1110%2C1108.4205%2C1108.6170%2C1108.4790%2C1108.2570%2C1108.2833%2C1108.3012%2C1108.4427%2C1108.1223&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Groundwater age, life expectancy and transit time distributions in\n  advective-dispersive systems: 1. Generalized reservoir theory"}, "summary": "We present a methodology for determining reservoir groundwater age and\ntransit time probability distributions in a deterministic manner, considering\nadvective-dispersive transport in steady velocity fields. In a first step, we\npropose to model the statistical distribution of groundwater age at aquifer\nscale by means of the classical advection-dispersion equation for a\nconservative and nonreactive tracer, associated to proper boundary conditions.\nThe evaluated function corresponds to the density of probability of the random\nvariable age, age being defined as the time elapsed since the water particles\nentered the aquifer. An adjoint backward model is introduced to characterize\nthe life expectancy distribution, life expectancy being the time remaining\nbefore leaving the aquifer. By convolution of these two distributions,\ngroundwater transit time distributions, from inlet to outlet, are fully defined\nfor the entire aquifer domain. In a second step, an accurate and efficient\nmethod is introduced to simulate the transit time distribution at discharge\nzones. By applying the reservoir theory to advective-dispersive aquifer\nsystems, we demonstrate that the discharge zone transit time distribution can\nbe evaluated if the internal age probability distribution is known. The\nreservoir theory also applies to internal life expectancy probabilities\nyielding the recharge zone life expectancy distribution. Internal groundwater\nvolumes are finally identified with respect to age and transit time. One- and\ntwo-dimensional theoretical examples are presented to illustrate the proposed\nmathematical models, and make inferences on the effect of aquifer structure and\nmacro-dispersion on the distributions of age, life expectancy and transit time.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.4303%2C1108.1108%2C1108.3992%2C1108.0603%2C1108.1916%2C1108.4530%2C1108.4511%2C1108.2715%2C1108.1844%2C1108.2551%2C1108.0558%2C1108.2847%2C1108.0378%2C1108.0634%2C1108.5052%2C1108.2801%2C1108.2792%2C1108.2585%2C1108.0456%2C1108.0089%2C1108.3452%2C1108.5741%2C1108.4448%2C1108.3722%2C1108.5449%2C1108.0569%2C1108.4572%2C1108.5973%2C1108.5618%2C1108.2039%2C1108.2110%2C1108.3330%2C1108.2158%2C1108.5512%2C1108.4563%2C1108.5407%2C1108.1038%2C1108.2615%2C1108.3565%2C1108.3136%2C1108.1638%2C1108.2693%2C1108.2448%2C1108.3816%2C1108.1780%2C1108.2705%2C1108.5307%2C1108.5779%2C1108.2930%2C1108.4675%2C1108.2281%2C1108.4858%2C1108.5483%2C1108.3580%2C1108.4327%2C1108.5359%2C1108.5425%2C1108.3306%2C1108.0387%2C1108.0693%2C1108.3835%2C1108.1353%2C1108.4156%2C1108.6045%2C1108.6148%2C1108.0425%2C1108.4371%2C1108.2807%2C1108.0820%2C1108.1163%2C1108.3167%2C1108.5118%2C1108.2563%2C1108.3483%2C1108.4131%2C1108.3045%2C1108.3637%2C1108.3331%2C1108.6087%2C1108.0562%2C1108.0412%2C1108.4959%2C1108.0756%2C1108.5421%2C1108.5245%2C1108.1815%2C1108.4958%2C1108.5342%2C1108.2562%2C1108.4440%2C1108.1732%2C1108.0568%2C1108.1110%2C1108.4205%2C1108.6170%2C1108.4790%2C1108.2570%2C1108.2833%2C1108.3012%2C1108.4427%2C1108.1223&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present a methodology for determining reservoir groundwater age and\ntransit time probability distributions in a deterministic manner, considering\nadvective-dispersive transport in steady velocity fields. In a first step, we\npropose to model the statistical distribution of groundwater age at aquifer\nscale by means of the classical advection-dispersion equation for a\nconservative and nonreactive tracer, associated to proper boundary conditions.\nThe evaluated function corresponds to the density of probability of the random\nvariable age, age being defined as the time elapsed since the water particles\nentered the aquifer. An adjoint backward model is introduced to characterize\nthe life expectancy distribution, life expectancy being the time remaining\nbefore leaving the aquifer. By convolution of these two distributions,\ngroundwater transit time distributions, from inlet to outlet, are fully defined\nfor the entire aquifer domain. In a second step, an accurate and efficient\nmethod is introduced to simulate the transit time distribution at discharge\nzones. By applying the reservoir theory to advective-dispersive aquifer\nsystems, we demonstrate that the discharge zone transit time distribution can\nbe evaluated if the internal age probability distribution is known. The\nreservoir theory also applies to internal life expectancy probabilities\nyielding the recharge zone life expectancy distribution. Internal groundwater\nvolumes are finally identified with respect to age and transit time. One- and\ntwo-dimensional theoretical examples are presented to illustrate the proposed\nmathematical models, and make inferences on the effect of aquifer structure and\nmacro-dispersion on the distributions of age, life expectancy and transit time."}, "authors": ["F. Cornaton", "P. Perrochet"], "author_detail": {"name": "P. Perrochet"}, "author": "P. Perrochet", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.advwatres.2005.10.009", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1108.5483v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1108.5483v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "25 pages, 11 figures", "arxiv_primary_category": {"term": "physics.flu-dyn", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.flu-dyn", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.ao-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "A.0", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1108.5483v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1108.5483v1", "journal_reference": "Advances in Water Resources 29 (2006) 1267-1291", "doi": "10.1016/j.advwatres.2005.10.009", "fulltext": "arXiv:1108.5483v1 [physics.flu-dyn] 28 Aug 2011\n\nGroundwater age, life expectancy and transit\ntime distributions in advective–dispersive\nsystems:1. Generalized Reservoir Theory.\nF. Cornaton ∗ , P. Perrochet\nCHYN, Institute of Geology, University of Neuchâtel, Emile-Argand 11, CH-2007,\nNeuchâtel, Switzerland\n\nAbstract\nWe present a methodology for determining reservoir groundwater age and transit time probability distributions in a deterministic manner, considering advectivedispersive transport in steady velocity fields. In a first step, we propose to model\nthe statistical distribution of groundwater age at aquifer scale by means of the\nclassical advection-dispersion equation for a conservative and non-reactive tracer,\nassociated to proper boundary conditions. The evaluated function corresponds to\nthe density of probability of the random variable age, age being defined as the time\nelapsed since the water particles entered the aquifer. An adjoint backward model\nis introduced to characterize the life expectancy distribution, life expectancy being\nthe time remaining before leaving the aquifer. By convolution of these two distributions, groundwater transit time distributions, from inlet to outlet, are fully defined\nfor the entire aquifer domain. In a second step, an accurate and efficient method\nis introduced to simulate the transit time distribution at discharge zones. By applying the reservoir theory to advective–dispersive aquifer systems, we demonstrate\nthat the discharge zone transit time distribution can be evaluated if the internal\nage probability distribution is known. The reservoir theory also applies to internal\nlife expectancy probabilities yielding the recharge zone life expectancy distribution.\nInternal groundwater volumes are finally identified with respect to age and transit\ntime. One- and two-dimensional theoretical examples are presented to illustrate the\nproposed mathematical models, and make inferences on the effect of aquifer structure and macro–dispersion on the distributions of age, life expectancy and transit\ntime.\nKey words: age; life expectancy; transit time; reservoir theory; dispersion; Laplace\ntransforms; finite elements\n\n∗ Corresponding author.\nEmail addresses: fabien.cornaton@unine.ch (F. Cornaton),\npierre.perrochet@unine.ch (P. Perrochet).\n\nPreprint submitted to Advances in Water Resources\n\n5 November 2018\n\n\f1\n\nIntroduction.\n\nThe knowledge of groundwater age distributions is of prime interest in many\nenvironmental issues since they depend on the intrinsic characteristics of the\noverall transport properties of an aquifer and its sub-systems. For instance, an\nimportant fraction of young water within a water sample can often be taken\nas the signature of a reservoir with good turnover property. On the opposite,\na considerable component of old water may reflect a poorly recharged aquifer,\nand/or significant internal mixing processes. The impact of a contamination\nhazard on groundwater quality can be investigated using groundwater age,\nsince the age distribution provides direct information on the time required for\na water particle, or a conservative tracer, to reach any critical zone that is\nto be protected. The fate of a solute being transported in groundwater partially depends on the time spent by the water molecules during their migration\nthroughout the aquifer system. Reactive transport of a specific substance is\nalso linked to groundwater age; the time spent flowing through any kind of\nmineral heterogeneity being a conditional factor for the development of any\npotential reactions. With the age information, inferences can be made on the\naquifer physical characteristics, as well as on the chemical transformations\nthat contaminants may undergo. The age can also be of importance for estimating historical aspects related e.g. to the agricultural practices, or the land\nuse of a particular region, which are expected to have lead to groundwater\ncontamination. As it is the case throughout this work, groundwater age can\nbe considered as a fully conservative tracer. Consequently, the worst scenario\nwith regard to a contamination case is thus chosen by solving the age transport\nproblem.\nGenerally, a water sample shows a mixture of ages, which may range between\nseveral orders of magnitude, as a consequence of the reservoir geometrical\nand hydro-dispersive characteristics (spatial repartition of the hydraulic and\ntransport parameters). Groundwater age must, therefore, be regarded as a\nstatistical, or probabilistic distribution, rather than considering it as a single\nabsolute or average value. The dating methods commonly provide an average\nvalue over the water sample for the age of groundwater after recharge, which\nin theory does not represent hard data. In fact, the mean of an unknown distribution, here the distribution of ages, is not necessarily a reliable value for\nthe most likely of this distribution. By far the most frequently used dating\nmethods are based on the measurements of natural tracers, such as the isotopes of radon, carbon or oxygen, and on the measurements of man-induced\natmospheric concentrations of elements such as tritium (3 H), helium (3 He),\nchloride (36 Cl), krypton (85 Kr), or chlorofluorocarbons (CFC), which have increased steadily between the 1940s and the early 1990s. The most efficient\nmethods for dating recent waters are the ones based on 3 H/3 He, 85 Kr, and\nCFC-measurements [63,55,25], which are known to provide age dates over a\n2\n\n\fperiod of 40 years with an accuracy of 20% or less [11]. CFC-based ages provide a good resolution for groundwater with relatively young components [8,6],\nbut they do not account for the time spent by water molecules within the unsaturated zone, such that in the case of deep water table aquifers the travel\ntime duration within the unsaturated zone must, therefore, be estimated. Absolute dating techniques involve decay of radionuclides in groundwater, for\nwhich 14 C or 36 Cl are classical elements that are used for dating old groundwater, e.g. in deep and large sedimentary basins. Groundwater age is very\noften used to make inferences on aquifer parameters, groundwater recharge,\nflow paths and flow velocities. However, with many of these dating methods,\nthe interpretation of ages is achieved by means of simple conceptual models\nand fitting the data. This involves significant simplifications of the flow and\ntransport processes, which may lead to erroneous interpretations about e.g.\nthe past release of contaminants in aquifers. As will be discussed in this paper,\nmixing and dispersion are major factors, which can lead to unrepresentative\nmean age measurements. Dating methods remain however very useful for calibrating numerical models [56,58], which attempt to simulate the flow patterns,\nthe flow rates, and the distribution of ages in groundwater.\nTo quantify the distribution of ages in aquifers, several types of mathematical\nmodels have been developed during the past decades of research in this field.\nNevertheless, in many cases age distributions are more or less arbitrarily chosen and not deterministically calculated. Analytical lumped-parameter type\nmodels have been however extensively used in the simulation of environmental\ntracer data [45,47,74,9,57,1], such as isotopic data, which are commonly interpreted with advective transit time models, although isotope transport does not\nnecessarily undergo advective processes only. Specified transit time distributions describing piston-flow, exponential mixing, combined piston-exponential\nmixing, or dispersive mixing, are chosen to solve the inverse problem by fitting\nthe model on measured tracer output data. This procedure calls for significant\nsimplifications, which can often not be justified, such as for instance neglecting\nthe reservoir structure, as well as the spatial variability of infiltration rates [10]\nand aquifer flow and transport parameters. Amin and Campana [1] proposed\nto model the groundwater age mixing process by means of a three-parameter\ngamma function which accounts for various states of mixing ranging between\nno mixing (piston flow model) and perfect mixing (exponential model). Robust verifications of the applicability of lumped parameter models can hardly\nbe found [36,44,28]. Transit time distributions are often obtained with numerical solutions by making the assumption of pure advective motion of the\ngroundwater particles, the particle-tracking technique being the most popular\none. Purely kinematic ages ignore the effect of dispersion and mixing on age\ntransport [22,12], and often reveal to be ill posed in complex heterogeneous\nsystems [71], for which the 3-D implementation is subject to severe technical\nproblems. The importance of including age dilution processes such as dispersion and matrix diffusion, when comparison is made between modeled and\n3\n\n\fmeasured ages, has been pointed out by many authors [66,45,46]. Moreover,\nparticle-tracking does not allow calculation of transit time distributions since\ngroundwater volumes are not associated to simulated ages.\nMore elaborated quantitative approaches consider age as a mass that is transported by groundwater through volume-averaged temporal moment equations\n[64,37,35,71], in which the product of groundwater age with its mass (age\nmass ρA) is the conserved quantity. Harvey and Gorelick [37], and Varni and\nCarrera [71] derived a set of recursive temporal moment equations, which are\nsequentially solved in order to simulate the transit time distributions from the\nn calculated moments. According to Harvey and Gorelick [37], the first five\nmoments that characterize the accumulated mass, the mean, the variance, the\nskewness and the kurtosis of a breakthrough curve, respectively, may provide\nsufficient information to summarize the entire distribution. Since many natural systems reveal a multi-modality of the age distribution within the reservoir\nand at the discharge zones, and since the shape of this distribution is a priori\nunknown, an infinity of moments would therefore theoretically be required to\nconstruct the entire distribution.\nIn the literature one can find many terms, which relate to a specific time\nspent by water molecules within the aquifer. Use will be made throughout\nthis work of the notion of transit time as the total residence time of water\nmolecules within the aquifer, i.e. the age of these molecules when they exit\nthe aquifer. The notion of travel time is rather used to characterize the time\nspent to travel between two arbitrary locations in the aquifer. Travel time\nprobabilities have been a subject of high interest in many studies characterizing solute transport in sub-surface hydrology [16,18,19,38,39]. The travel time\nprobability is commonly defined as the response function to an instantaneous\nunit flux impulse [21,39]. In their transfer function approach of contaminant\ntransport through unsaturated soil units, Jury and Roth [39] model tracer\nbreakthrough curves with one-dimensional travel time probability functions.\nShapiro and Cvetkovic [60], Dagan [19], and Dagan and Nguyen [20] derived\nthe forward travel time probability for a mass of solute by using the Lagrangian concept of particle displacement in porous media. The derivation\nof forward and backward models for location and travel time probability has\nbecome a classical mathematical approach for contaminant transport characterization and prediction [69,43,50,51]. The spreading of a contaminant mass\nis analyzed by following the random motion of solute particles, and to do so,\nthe advection–dispersion equation (ADE) is assimilated to the Fokker-Planck\n(or forward Kolmogorov) equation. The expected resident concentration of a\nconservative tracer is taken as the probability density function for the location\nof a particle, at any time after having entered the system.\nThe aim of the present work is to provide a general theoretical framework to\nmodel complete groundwater age distributions at aquifer scale in a determin4\n\n\fistic way. The concept of age variability is associated to the concept of random\nvariables and their distributions by using classical elements of probability, allowing the introduction of mathematical definitions for age, life expectancy\nand transit time statistical distributions. Forward and backward ADEs for\nconservative tracers are used to simulate the above-mentioned distributions at\naquifer scale. By manipulating the ADEs, the reservoir theory [27] is expressed\nin order to characterize recharge and discharge zones transit time distributions\nwith refined accuracy. The proposed models are illustrated and discussed by\nmeans of analytical and numerical analysis of one- and two-dimensional theoretical flow configurations.\n\n2\n\nThe 'ages' of groundwater as space-dependent random variables.\n\nIn this section we present the models allowing the calculation of the statistical\ndistribution of groundwater age, life expectancy and transit time in arbitrary\naquifers.\n\n2.1\n\nDefinitions.\n\nThe characterization of groundwater molecules with respect to a travel time\nwithin an aquifer system is fully dependent on the spatial reference from which\nthis time is \"measured\". Usually the groundwater age is defined as a relative\nquantity with respect to a starting location where age is assumed to be zero.\nUse will be made throughout this work of three variations of terminology. For\na given spatial position in the reservoir, the age (A) relates to the time elapsed\nsince the water molecules entered the system at the recharge limits, where age\nis zero. For the same spatial position, the life expectancy (E ) is defined as the\ntime required for the water molecules to reach an outlet limit of the system.\nLife expectancy is therefore zero at an outlet. The transit time (T ) finally\nrefers to the total time required by the same water molecules to migrate from\nan inlet zone (T = E) to an outlet zone (T = A). In a REV, the three variables A, E and T are random variables, characterized by probability density\nfunctions (pdf) that can be regarded as the statistical occurrence of water\nmolecules with respect to time, which could be observed in a groundwater\nsample if any analytical procedure would allow such measurements.\n5\n\n\f2.2\n\nAge probability.\n\nThe typical heterogeneity of aquifer systems involves strongly varying flow velocity fields, with multi-scale coherence lengths. The spatial variability of velocity and transport parameters induces a spreading of the contaminant mass.\nThe tensor of macro-dispersion in the classical ADE accounts for the uncertainty in the transport prediction induced by mixing. Various studies relate to\nhow the ADE is limited by the impact of physical and chemical heterogeneities\non solute transport, such that up-scaling is not always satisfying [17,67,34].\nIf such heterogeneities are present at aquifer scale the transport parameters\nshould be time-dependent, but this time dependency may be relaxed when the\ncorrelation scales of the transport parameter random fields are finite [34,49].\nThe ADE with time-independent parameters holds only when the solute particles have enough time to be distributed by dispersion between the flow lines.\nSince we are interested in solving the age transport problem at aquifer scale,\nwe make the assumption that the ADE with time-independent transport parameters (the parameters have reached their asymptotic values) can model the\nevolutional transport of the groundwater age and life expectancy distributions\nunder steady-flow conditions. The modelled process applies to conservative\nand non-reactive tracers.\nLet us consider an aquifer domain Ω in the three-dimensional space, with\nhydraulic recharge boundary Γ− , discharge boundary Γ+ , and impermeable\nboundary Γ0 , as illustrated in Fig. 1. The boundary Γ+ corresponds to the\nopen boundary of the system, through which a free exit of age mass is expected. With respect to the above-mentioned considerations on contaminant\nspreading, it is convenient to describe the groundwater sample age distribution\nas a random variable associated to a probabilistic model. The age probability\ndistribution at a position x in Ω can be evaluated by solving the ADE when a\nunit pulse of conservative tracer is uniformly applied on the recharge area Γ− .\nThe resulting breakthrough curve is the probabilistic age distribution [21,39].\nMaking use of this property, we propose to model groundwater age and life\nexpectancy pdfs by forward and backward transient-state transport equations,\nunder steady-state hydraulic conditions. The pre-solution of the velocity field\nis performed by the following steady-state groundwater flow equation:\n∇ * q = qI − q O ,\n\nq = −K∇H\n\nin\n\nΩ,\n\n(1)\n\nwhere q is the Darcy flux vector [LT−1 ], which is valid for ideal tracers, H\nis the hydraulic head [L], qI and qO are fluid source and sink terms [T−1 ],\nrespectively, and K is the tensor of hydraulic conductivity [LT−1 ]. The age\npdf is then obtained by solving the following forward boundary value problem:\n∂φgA\n= −∇ * qgA + ∇ * D∇gA + qI δ(t) − qO gA\n∂t\n6\n\nin\n\nΩ\n\n(2a)\n\n\fgA (x, 0) = gA (x, ∞) = 0\nJA (x, t) * n = (q * n)δ(t)\nJA (x, t) * n = 0\n\non\n\nin\n\nΩ\n\n(2b)\n\non\n\nΓ−\n\n(2c)\n\nΓ0\n\n(2d)\n\nwhere gA (x, t) is the transported age pdf [T−1 ], JA (x, t) is the total age mass\nflux vector [LT−2 ], D is the tensor of macro-dispersion [L2 T−1 ], x = (x, y, z)\nis the vector of cartesian coordinates [L], t is time [T], φ = φ(x) is porosity\nor mobile water content [−], n is a normal outward unit vector, and δ(t) is\nthe time-Dirac delta function [T−1 ], which ensures a pure flux impulse on Γ− .\nThe source term qI δ(t) is meant for simulating a potential internal production\nof water (3-D) or 2-D horizontal aquifer configurations with an areal recharge\nintensity qI . The sink term qO gA may result from any internal extraction of\ngroundwater. The tensor of macro-dispersion D = φD∗ = D(x) in Eq. (2a) is\ndefined by Bear [3]:\nD = (αL − αT )\n\nq⊗q\n+ αT kqkI + φDm I\nkqk\n\n(3)\n\nwhere αL and αT are the longitudinal and transversal coefficients of dispersivity [L], respectively, Dm is the coefficient of molecular diffusion [L2 T−1 ], and\nI is the identity matrix. The total age mass flux vector JA (x, t) is classically\ndefined by the sum of the convective and dispersive fluxes:\nJA (x, t) = qgA (x, t) − D∇gA (x, t)\n\n2.3\n\n(4)\n\nLife expectancy probability.\n\nThe life expectancy probability distribution satisfies the adjoint backward\nmodel of Eq. (2a):\n∂φgE\n= ∇ * qgE + ∇ * D∇gE − qI gE\n∂t\n\nin\n\nΩ\n\n(5a)\n\ngE (x, 0) = gE (x, ∞) = 0\n\nin\n\nΩ\n\n(5b)\n\nJE (x, t) * n = −(q * n)δ(t)\n\non\n\nΓ+\n\n(5c)\n\n− D∇gE (x, t) * n = 0\n\non\n\nΓ0\n\n(5d)\n\nwhere gE (x, t) is the transported life expectancy pdf, and where the total life\nexpectancy mass flux vector JE (x, t) is\nJE (x, t) = −qgE (x, t) − D∇gE (x, t)\n7\n\n(6)\n\n\fEq. (5a) is the formal adjoint of Eq. (2a) [32,2], the so-called \"backward-intime\" equation [69,73,72], also backward Kolmogorov equation [40]. Given the\nforward equation, the backward equation is technically obtained by reversing\nthe sign of the flow field, and by adapting the boundary conditions [50,51,72].\nOn the impermeable boundary Γ0 , a third-kind condition (Cauchy) in the forward equation becomes a second-kind condition (Neumann) in the backward\nequation, and vice-versa. A second-kind condition in the forward model will\nalso become a third-kind condition in the backward model [33, p. 146]. The\nadvection term is known to be not self-adjoint (it should be written in the\nform q * ∇gE in Eq. (5a)) unless flow is divergence free [72]. However, the\nbackward equation can still handle non-divergence free flow fields by means\nof the important sink term −qI gE appearing in Eq. (5a). This sink term has\nbeen derived in Cornaton [13] from the vertical averaging process of the general 3-D backward ADE, and is consistent with the analysis of Neupauer and\nWilson [51,52]. Recharge by internal sources (3-D or 2-D vertical) or by areal\nfluxes (fluid source for 2-D horizontal) is introduced by the first-order decay\ntype term −qI gE , which is a consequence of the reversed flow field. Internal\nsources produce a sink of life expectancy probability, while internal sinks (term\nqO gA in Eq. (2a)) do not appear in the backward model since a fluid sink may\nnot influence the life expectancy pdf. The boundary Γ− corresponds to the\nopen boundary of the system (since flow is reversed) through which a free exit\nof life expectancy mass is expected.\nThe simulation of life expectancy with (5) is valid in the case of steady-state\nvelocity fields only. Transient-state velocity fields would require another appropriate formulation of (5). For a steady-state hydraulic situation, if q approaches zero in some regions of the reservoir, e.g. like in aquitards in which\ntransport is diffusion-dominant, then (5) still holds because of the irreversible\nnature of dispersion. The amount of age mass diffused between an aquifer\nand an aquitard is proportional to concentration differences between the two\nmedia, and is the same in both the forward and backward problems. In the\nboundary value problems (2) and (5) the classical homogeneous Neumann\nboundary condition (−D∇g * n = 0) at the outlet limit for the age problem\n(at the inlet limit for the life expectancy problem) is not used in order to\nallow a natural age/life expectancy gradient through the open boundaries.\nInstead, the normal projection of the dispersive flux is evaluated implicitly\nat the boundaries. The evaluation procedure in the framework of the finite\nelement method is described in Cornaton et al. [14]. This kind of boundary\ncondition, which is referred to as Implicit Neumann condition, enables continuity of the total mass flux at outlet. The Implicit Neumann condition is a\ngeneralized version of the Free Exit condition for parabolic equations proposed\nby Frind [31]. As discussed by Nauman and Buffham [48], Parker and van\nGenuchten [53], Kreft and Zuber [42], and Bear and Verruitj [4], total mass\nflux continuity at outlet permits upgradient solute movement by dispersion.\n\n8\n\n\fΓ0\n\nΓ+\nT=A\n\nE\n\nΓ0\n\nΓ+\nT=A+E\n\nΓ0\nA\n\nΓ−\nT=E\n\nE\n\nΓ−\n\nT=A+E\n\nT=E\nΓ0\n\nΓ0\n\nA\n\nΓ−\n\nΓ0\n\nΓ−\n\nΓ−\nΓ0\n\nΓ−\n\nT=E\n\nΓ0\n(b)\n\n(a)\n\nFig. 1. Schematic illustration of a groundwater reservoir Ω, with indicated no-flow\n(Γ0 ), inlet (Γ− ) and outlet (Γ+ ) boundaries: (a) Age problem with normal flow\nfield; (b) Life expectancy problem with reversed flow field. The arrow heads on the\nsymbolized flowlines (dashed lines) stand for the position and direction of water\nmolecules at a given time after their release. The black dot stands for a small water\nsample, to illustrate the random variable transit time (T ) as the sum of the two\nrandom variables age (A) and life expectancy (E ).\n\nEqs. (2) and (5) simulate the forward and backward transport resulting from a\nunit pulse input. The space-time evolution of the water molecules is described\nby the distributions gA (x, t) and gE (x, t). Both differential equations deal with\nconditional probabilities that characterize the statistical occurrence of water\nmolecules as a function of age and life expectancy. Location probability is\nrelated to resident concentration [41,18,39], and describes the position x of\nwater molecules at a given time after their release in the system. On the other\nhand, travel time probability is related to flux concentration [41,18,39], and\ncharacterizes for a position x the amount of time spent within Ω since the\nwater molecules entered the system (in the right-hand side of Eq. (5c), age\nis at the flux concentration gAf = δ(t)). Resident concentration relates to the\nmass of solute per unit porous volume while flux concentration is defined as\nthe solute mass flux per unit water flux. A flux concentration is the physical\nrepresentation of the mean of the microscopic fluid concentrations weighted\nby the associated microscopic fluid velocities [53]. The multi-dimensional relation between flux and resident concentrations can be found in Sposito and\nBarry [65], and is formally the projection of the total mass flux on the flow\nvelocity direction. Accordingly, the flux concentration form of the random\nvariable age is:\ngAf =\n\nJdA * q\nD∇gA * q\nJA * q\n=\ng\n+\n= gA −\nA\n2\n2\nkqk\nkqk\nk q k2\n\n(7)\n\nwith Jd = −D∇g denoting the dispersive part of J. By analogy, the flux\n9\n\n\fconcentration form of the variable E can be defined as\ngEf = −\n\nJE * q\nJdE * q\nD∇gE * q\n=\ng\n−\n= gE +\nE\n2\n2\nkqk\nkqk\nk q k2\n\n(8)\n\nThe age pdf at a position x in Ω characterizes the probability per unit time for\nthe time spent since recharge, and is a flux concentration, evaluated enforcing\nEq. (7). The resident concentration of age characterizes a volume-averaged age\ndensity function, which describes the density of probability of finding water\nmolecules at the position x in Ω, at time t.\n\n2.4\n\nTransit time probability.\n\nIn Eqs. (2a) and (5a), the dependent variables are probability density functions\nof continuous time random variables. The behavior of these random variables\ncan also be described by cumulative distribution functions (cdf). Let U be\none of these two variables (U = A or U = E ), with u the associated values\nthe variable U may take at a given position x of space. The cdf GU (x, u) and\nthe pdf gU (x, u) of the variable U are commonly defined as\nGU (x, u) = P [−∞ ≤ U ≤ u] =\n\nZ u\n−∞\n\ngU (x, τ )dτ\n\n(9)\n\nwith\ngU (x, u) =\n\n∂GU (x, u)\n∂u\n\n,\n\nGU (x, −∞) = 0 ,\n\nGU (x, ∞) = 1\n\n(10)\n\nwhere P denotes the probability event on U, or number of occurrences with\nU ≤ u ratioed to the total number of occurrences, and τ is a dummy variable for integration. The probability functions property (10) together with the\nboundary conditions in Eqs. (2) and (5) ensure that age and life expectancy\ngA and gE are directly related to probabilities, and since concentration can be\nmodelled by the ADE, then probability too can be modelled by the ADE. For\na given position x in Ω, the ages of groundwater molecules are described by\nthe pdf gA , which measures the density of probability of having an age t. The\nsame molecules are also characterized by the pdf gE , which measures the density of probability of having a life expectancy t. Introducing now the random\nvariable transit time T, with density of probability gT , the water molecules\ncan be described by their intensity of probability of flowing throughout the\nsystem at a time t. The variable T is a random variable corresponding to the\nsum of the two random variables A and E (see Fig. 1). Hence the statistical\ndistribution of T is the pdf of the sum of A and E, gT = gA+E . This problem\n10\n\n\fcan be solved if the joint pdf gA,E of A and E, which characterizes the joint\nbehavior of A and E, is known [5]:\ngT (x, t) = gA+E (x, t) =\n\nZ +∞\n−∞\n\ngA,E (x, τ, t − τ )dτ\n\n(11)\n\nThe joint quantity gA,E (x, a, e)dade relates to the probability that A lies in\nthe small interval a to a + da, and that E lies in the small interval e to e + de.\nAssuming that A and E are stochastically independent variables (for the same\nspatial position, A depends on the initial point while E depends on the end\npoint, and under a steady-state flow regime E may not be influenced by the\nmemory of the past evolution), and since gA and gE are zero for negative values\nof their arguments, the joint pdf gA,E simplifies in gA gE [5]. The probability\ndensity function gT in Eq. (11) can then be obtained using the convolution\nintegral:\nZ\nt\n\ngT (x, t) =\n\n0\n\ngA (x, τ )gE (x, t − τ )dτ\n\n(12)\n\nfrom which the cdf of T can be calculated enforcing Eq. (9). The fact that\ngA and gE are zero for negative values of their arguments allows applying\nthe convolution integral from 0 to t. Since the pdfs gA and gE give the age\nand life expectancy probability of occurrence at each position x in Ω, both\nthe maximum age as well as the maximum life expectancy correspond to the\nmaximum transit time. Consequently, the time variable t can equivalently refer\nto all specific values of age, life expectancy, and transit time. The convolution\nintegral (12) states that the probability that the variable T lies in a small\ninterval around t is proportional to the product of the probability that the\nvariable A lies in the interval t to t + dt and a factor proportional to the\nprobability that the variable E lies in a small interval around t − τ , the value\nof E ensuring that A and E sum to T. This product is then summed over\nall possible values of time t (from the minimum age to the maximum age) to\nyield the transit time pdf at a position x in space. The derived distribution of\nT = A + E in Eq. (12) can also be viewed as a transfer function convolution\nprocess, the input distribution being the age pdf gA , and the signal transferring\nfunction being the life expectancy gE .\nTo our point of view, Eq. (12) is an important result of the present work. The\nfield of gT characterizes the evolution of groundwater molecules throughout the\naquifer domain by specifying the amount of time from recharge to discharge.\nAt a given position in the reservoir, the temporal evolution of the groundwater\nmolecules can be characterized by the three pdfs gA , gE and gT . Each function\ncontains specific information on a time of residence, the nature of which is a\nfunction of the spatial references that are chosen for evaluation. For instance,\ngA is conditioned by the inlet limit Γ− , where the variable A is nil, while gE is\nconditioned by the outlet limit Γ+ , where the variable E is nil. For the variable\n11\n\n\f(a)\n\nDimensionless flux pdf\n\n4\n\n4\n\nX = 1/4\n\n2\n\n2\n\n2\n\n1\n\n1\n\n1\n\n0\n\n0\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\nDimensionless time Τ\n\n2.5\n\n3\n\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\nDimensionless time Τ\n\n2.5\n\nΤ = 1/2\n\n0\n\n3\n2.5\n\nΤ=1\nAge\nLife expectancy\nTotal transit time\n\n2\n\n1.5\n\n1.5\n\n1\n\n1\n\n1\n\n0.5\n\n0.5\n\n0.5\n\n0.5\n\n1\n\nDimensionless space X\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\nΤ = 3/2\n\n1.5\n\n0\n\n0\n0\n\n0.5\n\nDimensionless time Τ\n\n2\n\n2\n\n0\n\nX = 3/4\n\n3\n\n3\n\n0\n\nDimensionless resident pdf\n\nAge\nLife expectancy\nTotal transit time\n\n3\n\n0\n\n(b)\n\n4\n\nX = 1/2\n\n0\n\n0.5\n\nDimensionless space X\n\n1\n\n0\n\n0.5\n\n1\n\nDimensionless space X\n\nFig. 2. Age, life expectancy and transit time dimensionless pdfs in a 1-D domain\nfor a Péclet number Pe = 20: (a) Flux pdfs; (b) Resident pdfs. Time is normalized\nby the average turnover time τ0 = L/v, x by L, and Pe = Lv/D. The average age\nand the average life expectancy sum to the average transit time.\n\nT, the pdf gT is conditioned by the fact that T = A at outlet, and that T = E\nat inlet.\nIf gA and gE are resident concentrations, so is gT . If gA and gE are flux concentrations, so is gT . Applying a Laplace transform to Eqs. (7) and (8) and\nconvoluting, the transit time resident and flux concentrations are found to be\nlinked by the following relation:\nĝTf\n\n=\n\nĝAf ĝEf\n\n1\n(ĴdA ⊗ ĴdE )q\nd\nd\n[ĝA ĴE − ĝE ĴA +\n]*q\n= ĝT −\nkqk2\nkqk2\n\n(13)\n\nwhere ĝU (x, s) denotes the s-transform state of the function gU (x, u), U = A,\nE or T. Eq. (13) shows that transit time flux concentration is dependent on the\ntransit time resident concentration, but also on the tensor product between\nthe age and life expectancy dispersive fluxes, and on the convolution product\nof the age and life expectancy flux and resident concentrations. For a zero\ndispersion case, g f = g for the random variables A, E and T. Consider the\nsemi-infinite 1-D domain of characteristic length L (the outlet is supposed at\nthe position x = L) and uniform velocity v along the x -axis, as illustrated in\nFig. 2. The age flux pdf at the position x is obtained as the solution of Eq. (2a)\nusing the boundary condition gA = gAf = δ(t) at x = 0, and the age resident\n12\n\n\fpdf is obtained as the solution of Eq. (2a) using the boundary condition (2c)\nat x = 0. These solutions are given in dimensionless form in Appendix A.\nThey show the trivial fact that for a one-dimensional flow configuration, the\ntransit time flux pdf is unique and independent on the spatial coordinate, as\nillustrated in Fig. 2a. For example, the age flux pdf at X = 1/4 in Fig. 2a is\nequal to the life expectancy flux pdf at X = 3/4, and the convolution of both\ndistributions gives the transit time flux pdf, which equals both the age flux\npdf at outlet (X = 1) and the life expectancy flux pdf at inlet (X = 0). The\naverage age x/v and the average life expectancy (L − x)/v sum to the average\ntransit time L/v, which is independent on x in a rectilinear flow line. In a\nsimilar way, the age resident pdf at the position X equals the life expectancy\nresident pdf at the position 1 − X, as shown in Fig. 2b. For a fixed value\nof time, the transit time resident pdf is constant. This shows that, in 1-D,\nthe intensity of probability of finding water molecules at any position in the\ndomain that transit at time t or less, given that t is fixed, is always identical.\nThe transit time resident pdf gives the intensity of probability for the spatial\nposition of water molecules, for a given value of transit time. In 1-D, this\nintensity of probability is uniform since the trajectory is unique. The resident\nage and life expectancy curves show the typical apparent discontinuity in\nconcentration at inlet (resident pdf of A) and at outlet (resident pdf of E ).\nThese discontinuities have a drawback on the transit time resident pdf, which\nis not necessarily equal to the age resident pdf at outlet, and equivalently\nnot necessarily equal to the life expectancy resident pdf at inlet. This can be\nattributed to dispersion effects at the boundaries. Since the Cauchy condition\nis homogeneous for T = 0+ at inlet for the age pdf problem, and at outlet\nfor the life expectancy pdf problem, backward movement of water molecules\nby dispersion (i.e. in the reserved direction of velocity) is put down by nonzero age and life expectancy resident concentrations at the boundaries, the\nmagnitude of which is higher the higher the dispersivity. If we consider e.g.\nthe inlet boundary, the age and life expectancy concentrations are both not\nnil. The convolution of both pdfs is, therefore, not equal to any of them (age\npdf at outlet, life expectancy pdf at inlet) since both concentrations can have\na significant value at inlet and outlet at the same time.\nThe spatial distribution of the transit time pdf is also ruled by a differential equation. Combining Eqs. (2a) and (5a) after a Laplace transform, the\nfollowing equation can also be obtained:\nn\n\n∇ * qgT = L−1 Ŝd\n\no\n\nŜd = ĝE ∇ * ĴdA − ĝA ∇ * ĴdE\n\n(14a)\n(14b)\n\nwhere L−1 denotes the inverse Laplace transform. Eq. (14a) is the transit time\npdf differential equation. It is of steady-state kind, with a source term that\naccounts for the divergence of the age and life expectancy dispersive fluxes. For\n13\n\n\fthe pure advective case in divergence-free flow fields, Eq. (14a) simplifies in\nq*∇gT (x, t) = 0. This local condition states that the flux vector and the transit\ntime gradient have to be always perpendicular, as a requirement for keeping\ntransit times constant along the flow paths. The resolution of Eq. (14a), which\nis of hyperbolic kind, is linked to technical difficulties, e.g. for the evaluation\nof the source term (14b) over the domain, and is not beneficial since the pdfs\ngA (x, t) and gE (x, t) must be evaluated in a preliminary step.\n2.5\n\nMean age, mean life expectancy and mean transit time.\n\nThe average values of the probability density functions gA , gE and gT are\ndefined by their first order temporal moment, the nth moment being\nμn [gU ] =\n\nZ +∞\n−∞\n\nun gU (x, u)du = (−1)n\n\n∂ n ĝU (x, s = 0)\n∂sn\n\n(15)\n\nwith U = A, E, or T. Applying the convolution theorem in the Laplace domain\nresults in the transformed Eq. (12), ĝT (x, s) = ĝA (x, s)ĝE (x, s). Accounting for\nthe pdf property ĝU (x, s = 0) = 1 and enforcing Eq. (15) for n = 1 and 2 yields\nthe average transit time and its variance:\nhT i = hAi + hEi\n\n(16)\n\nμ2 [gT ] = μ2 [gA ] + μ2 [gE ]+2hAihEi\n\n(17)\n\n2\n\n2\n\n2\n\nσ [gT ] = σ [gA ] + σ [gE ]\n\n(18)\n\nwith hAi = hAi(x) = μ1 [gA ], hEi = hEi(x) = μ1 [gE ] and hT i = hT i(x) =\nμ1 [gT ]. The average age and average life expectancy of a water sample sum\nup to the average transit time. Since the variables A and E are supposed to\nbe stochastically independent, the variances σ 2 of the age and life expectancy\npdfs also sum up to the variance of the transit time pdf. Using the operator\nin Eq. (15), Eqs. (2a) and (5a) can be transformed into their nth normalized\nmoment μn form. The recursive application of the operator (15) to Eqs. (2a)\nand (5a) yields\n− ∇ * qμn [gA ] + ∇ * D∇μn [gA ] − qO μn [gA ] + φnμn−1 [gA ] = 0\n\n(19)\n\nfor the forward nth moment ADE, and\n∇ * qμn [gE ] + ∇ * D∇μn [gE ] − qI μn [gE ] + φnμn−1 [gE ] = 0\n\n(20)\n\nfor the backward nth moment ADE. The nth moment forms of the ADEs (2a)\nand (5a) are only dependent on the (n − 1)th moment μn−1 . For instance, since\n14\n\n\fμ0 [gA ] = 1 and gA (x, 0) = 0, the first moment form of Eq. (2a) (for n = 1)\ncorresponds to the mean age equation as defined by Goode [35], in which the\nmean age is the average over a sample of water molecules of the time elapsed\nsince recharge:\n− ∇ * qhAi + ∇ * D∇hAi − qO hAi + φ = 0\n\nin\n\nΩ\n\n(21)\n\nThe first moment form of Eq. (5a) gives the backward adjoint mean life expectancy equation:\n∇ * qhEi + ∇ * D∇hEi − qI hEi + φ = 0\n\nin\n\nΩ\n\n(22)\n\nFinally, the mean transit time equation is deduced by subtracting Eq. (21)\nand Eq. (22):\nq * ∇hT i = hSd i\n(23a)\nhSd i = ∇ * D∇hAi − ∇ * D∇hEi\n(23b)\nwhere the divergence of the advection term has been developed in order to\nannihilate the fluid source and sink terms. The boundary value problems (2)\nand (5) involve that the finite moments of the age and life expectancy pdfs exist\nfor homogeneous boundary conditions. By definition, the mean groundwater\nage in a steady-flow reservoir, or mean residence time, can be determined from\nthe average of the normalized flux concentration response to a narrow flux input uniformly applied on the recharge limits, since this breakthrough curve\ncorresponds to the water molecules residence time distribution [21,41,39]. The\nmean groundwater age can then be calculated by prescribing at all inflow\nboundaries a solute mass that is proportional to the water flux [37]. Consequently, Eqs. (21) and (22) can be solved by assigning hAi = 0 on the inlet\nlimits Γ− , and hEi = 0 on the outlet limits Γ+ , respectively. Mean age and\nmean life expectancy are continuously generated during groundwater flow,\nsince porosity acts as a source term in Eqs. (21) and (22). This source term\nindicates that groundwater is aging one unit per unit time, in average. The\nmean age and mean life expectancy equations can be easily handled by numerical codes that solve ADEs, by distributing a source term equal to porosity,\nand by reversing the velocity field for the case of Eq. (22). Eq. (23a) would\nrequire the boundary conditions hT i = hEi on Γ− , and hT i = hAi on Γ+ .\nHowever, mean transit time can rather be obtained by solving the Eqs. (21)\nand (22), and by post-processing Eq. (16). If dispersion is nil Eq. (23a) is\nsimply q * ∇hT i = 0, the solution of which is comparable to the stream lines\nin a flow model, and associates to each line the advective transit time from\ninlet to outlet.\nAccording to Parker and van Genuchten [53,54], Kreft and Zuber [41,42], and\nSposito and Barry [65], temporal moments have a real physical meaning if\n15\n\n\fthey are related to flux concentration functions, while spatial moments must\ncharacterize resident concentration functions. Flux and resident concentration\ndepend themselves on the measurement technique [65,59]. An age date as\ndeduced from isotopic measurements corresponds to an age average over the\nnumber of molecules in the water sample, and may often be close to a resident\nconcentration. Mean age computations using Eq. (21) are, therefore, wellsuited for fitting isotopic age dates.\n\n2.6\n\nTheoretical illustration example.\n\nThe numerical solutions presented in this work have been performed using the\nLaplace Transform Galerkin (LTG) finite element technique [68], which allows\neliminating the time-derivative in Eqs. (2a) and (5a). The Cauchy type boundary conditions (2c) and (5c) imply that Eqs. (2a) and (5a) must be formulated\naccording to their divergence form [23], such that a total mass flux continuity\nat the boundaries must be properly handled. The assembled linear system of\nequations is solved by the accurate ILUT-based sparse iterative solver [62]\nwith complex arguments and GMRES [61] or BiCGSTAB [70] acceleration.\nThe numerical inversion of the Laplace transformed functions is performed by\nthe algorithm of Crump [15]. The quotient-difference algorithm is used to accelerate the convergence of the Fourier series [24]. This algorithm proved to be\nvery efficient to treat inversion at the neighborhood of discontinuities or sharp\nfronts, and the required computational effort, which is linearly proportional\nto the 2n + 1 number of discrete Laplace variables, is highly diminished with\nrespect to other acceleration methods.\nWe use here the simple example of a theoretical vertical aquifer section (see\nFig. 3) to illustrate age, life expectancy and transit time computations. The\nconfiguration of the flow problem corresponds to the typical case known as\n'well-mixed reservoirs', that generate an exponential-like transit time distribution at outlet. This aspect will be discussed in more details in Section 4.2.\nThe aquifer is homogeneous, and is uniformly recharged on top by a constant\ninfiltration rate. The outlet, which could represent a trench, is simulated by\nmeans of a prescribed constant hydraulic head from the top to the bottom\nof the section. We solve the boundary value problems (2) and (5), as well as\nEqs. (21) and (22). The model is discretized into 100'000 bilinear quadrangles\nof size ∆x = 0.5 m and ∆z = 0.25 m. Fig. 3a shows the flow field by means of a\nforward particle-tracking representation. Fig. 3b gives the backward particletracking solution, which represents the purely advective life expectancy spatial distribution. In Fig. 3c, we have plotted the solutions of Eqs. (21), (22)\nand (16). Mean age and mean life expectancy are in very good agreement with\nparticle-tracking solutions. Isolines of mean age are horizontally distributed in\nrelation to the flow configuration: velocity increases upstream to downstream\n16\n\n\f(increase of hydraulic gradient towards outlet), but also becomes more and\nmore horizontally distributed. Travel paths to reach a same depth are longer\ndownstream than upstream, but since velocity increases downstream, it creates a compensating effect and the corresponding travel times finally become\nsimilar, in average. Mean life expectancy gradients are mainly horizontal, and\ngradually increasing upstream. Mean transit time provides a good representation of the flow field; its distribution is very close to the flow lines shown\nin Fig. 3a. However, the mean transit time solution owns the additional information on the total time required by water molecules to travel from inlet\nto outlet. Finally, in Fig. 3d are given some observed pdfs (see Fig. 3a for\nthe location of the observation points). Successive age pdfs along a horizontal\nprofile confirm the vertical gradient of mean age shown in Fig. 3c, each age pdf\nat a same depth being very comparable to one other. Along a vertical profile,\nsuccessive age pdfs are more and more spread in relation to the effect of longitudinal dispersion, which is bigger the longer the travel path. The behavior of\nthe life expectancy pdfs is similar to that of age, but in the reversed direction\nof velocity. The transit time pdfs along a horizontal profile are very similar\nto each other; they are simply shifted along the axis of time. This reveals a\nsame amount of dispersion affecting transport of water molecules along each\ntravel path from inlet to outlet. Vertically, the functions gT (x, t) show more\nand more dispersion with increasing depth, in relation to the vertical mixing\nof water molecules.\n\n3\n\nGeneralized Reservoir Theory.\n\nRecent studies [28,29] proposed a direct approach to calculate outlet transit\ntime distributions by applying the reservoir theory (RT) [27,7] to the average\ngroundwater age field, resulting from a pure advective transport solution. In\nthe following, we show how the RT can be generalized to advective-dispersive\nsystems by manipulating the forward and backward transport equations. We\nfirst introduce some characteristic reservoir time probability distributions.\nTwo equivalent mathematical formulations are then proposed, in order to\nevaluate the discharge zone transit time pdf as a function of the reservoir\ninternal physical properties.\n\n3.1\n\nCharacteristic reservoir distributions.\n\nWhen a specific age distribution is assigned to each elementary water volume\nin the reservoir, the volume of mobile water can be classified in a cumulative\nmanner with respect to the age occurrence in the reservoir. Let MA (t) be the\ncumulated amount of water molecules in the reservoir with an age inferior\n17\n\n\f(a)\n\nInlet: q I = 0.5 m/y\n\n0\n\nv1\nv2\nv3\nv4\n\nh2\n\nh1\n\n100\n\nh3\n\n200\n\nOutlet: H = 5 m\n\n5\n4\n3\n2\n1\n0\n\nh4\n\n300\n\n400\n\n500\n\n(b)\n\n4\n2\n\nAge\nLife expectancy\nTotal transit time\n\nh2\nh1\nh4\n\n0\n\n2\n\nh3\n\n4\n\nh1\nh2\n6\n\nTime [years]\n\npdfs [1/year]\n\n6\n\n0\n\n8\n\nh4 h3\nh1, h2, h3, h4\n\npdfs [1/year]\n\n8\n\n2\n\nv1\n\n6\n4\n\nv1, v2, v3, v4\n\n(c)\n\n(d)\n\n2\n\n1\n2\n\nv2\n\n1\n\n1\n\nAge\nLife expectancy\nTotal transit time\nv1\nv2\n\n2\n\nv3\n\nv3\n8\n\n10\n\n0\n\n0\n\n2\n\nv4\n4\n\n6\n\nTime [years]\n\nv4\n8\n\n10\n\nFig. 3. Age, life expectancy and transit time computations in a 2-D vertical theoretical aquifer. (a) Geometry, boundary conditions and flow field representation by\nforward particle-tracking with marker-isochrones each 1 year; (b) Backward particle-tracking with marker-isochrones each 1 year; (c) Spatial distribution of mean\nage (solid lines), mean life expectancy (dashed lines) and mean transit time (dotted\nlines) with 1 year of time-increment; (d) Age, life expectancy and transit time pdfs\nat some observations points. Parameters: K = 10−4 m/s, φ = 0.35, αL = 0.1 m,\nαT = 0.001 m, Dm = 0.\n\nor equal to a particular value t, and mA (t) be the corresponding probability\nfunction, or reservoir internal age cdf. The function mA (t) is the porous volume normalized function MA (t), which is evaluated by integrating over Ω the\nprobability of finding water molecules with an age t or less, assuming that\neach molecule has entered the system on Γ− :\n\u0012Z t\n\u0013\nMA (t)\n1 Z\n1 Z\nmA (t) =\n=\nφGA (x, t)dΩ =\nφ\ngA (x, τ )dτ dΩ\nM0\nM0 Ω\nM0 Ω\n0\n\n(24)\n\nwith M0 being the total amount of mobile water (aquifer porous volume). The\nfunction mA (t) cumulates the probability of finding water molecules which\nhave travelled until a position x before time t. The function MA (t) is zero at\norigin and tends towards the total porous volume M0 at infinity. The internal\nage frequency distribution function ψA (t) is the pdf associated to mA (t), and\n18\n\n\ffrom Eq. (10) it follows\n1 Z\n∂mA (t)\n=\nφgA (x, t)dΩ\nψA (t) =\n∂t\nM0 Ω\n\n(25)\n\nNote that Eq. (25) corresponds to the zeroth spatial moment of the age pdf,\nwhich is equivalent to the age mass [59]. The function ψA (t) gives the probability density of finding elements in Ω that have reached the age t, and ψA (t)dt is\nthe probability that A lies in the interval [t, t+dt]. Thus, the quantity M0 ψA (t)\nrepresents the number of elements per unit time (or flow rate fraction) that\nare in the interval [t, t + dt], and is equivalent to the zeroth spatial moment of\nthe age pdf gA (x, t). We similarly define the internal life expectancy cdf mE (t)\nand pdf ψE (t):\n\u0013\n\u0012Z t\nME (t)\n1 Z\n1 Z\ngE (x, τ )dτ dΩ (26)\n=\nφGE (x, t)dΩ =\nφ\nmE (t) =\nM0\nM0 Ω\nM0 Ω\n0\n\nψE (t) =\n\n∂mE (t)\n1 Z\nφgE (x, t)dΩ\n=\n∂t\nM0 Ω\n\n(27)\n\nThe function mE (t) cumulates the probability that a water molecule in the\nreservoir will reach the outlet before time t.\nWe finally consider the internal distribution of the groundwater molecules\ntransit time pdf gT as deduced from the convolution integral in Eq. (12), to\nintroduce the functions mT (t) and Ψ(t) as the internal transit time cdf and\npdf, respectively:\n\u0013\n\u0012Z t\n1 Z\n1 Z\nMT (t)\ngT (x, τ )dτ dΩ (28)\n=\nφGT (x, t)dΩ =\nφ\nmT (t) =\nM0\nM0 Ω\nM0 Ω\n0\n\nΨ(t) =\n\n∂mT (t)\n1 Z\n=\nφgT (x, t)dΩ\n∂t\nM0 Ω\n\n(29)\n\nThe function MT (t) corresponds to the mass of mobile water in the reservoir\nhaving a transit time inferior or equal to t. The function Ψ(t) characterizes\nthe probability density of finding water molecules within the reservoir that\nhave a transit time inferior or equal to t, and the quantity M0 Ψ(t)dt gives\nthe amount of water molecules that travel through Ω within the time interval\n[t, t + dt].\n3.2\n\nThe transit time pdf of discharge and recharge zones.\n\nA reservoir discharge zone is a particular portion of finite size, which intercepts the groundwater molecules that contribute to the outflow rate. These\n19\n\n\fwater molecules have contrasted arrival times that converging water fluxes\nmix together before flowing out. At a given position on a discharge boundary,\nthe transit time pdf is the age pdf. To characterize the contribution of each\nage flux event on an outflow boundary in terms of transit time probability,\nit is convenient to average the age probability fluxes on Γ+ . Under steadyflow regime, the representative transit time distribution φA (t) of the reservoir\noutlet zone can be defined as a flux averaged concentration [59], i.e. φA (t) is\nevaluated as the flow rate-normalized sum on Γ+ of the total age mass flux\nresponse function JA resulting from a unit flux impulse on Γ− :\n1 Z\n1 Z\nJA * n dΓ =\n[qgA − D∇gA ] * n dΓ\nφA (t) =\nF 0 Γ+\nF0 Γ+\n\n(30)\n\nwhere n is a normal unit vector pointing outward the boundary, and where\nF0 represents the total discharge flow rate throughout the bounded domain,\nwhich at steady-state is evaluated by:\nF0 =\n\nZ\n\nq(x) * n dΓ =\n\nΓ+\n\nZ\n\nq(x) * n dΓ\n\n(31)\n\nΓ−\n\nNote that for the sake of simplicity, internal sources and sinks are neglected,\nqI = qO = 0. While flux concentrations are defined with respect to a control\nplane orthogonal to the velocity vector direction, the outlet transit time probability function in Eq. (30) is defined by the projection of the total age flux on\nthe arbitrary-shaped boundary Γ+ . Inserting Eq. (7) into Eq. (30) produces\nthe equivalent relation:\n\"\n!\n#\nq⊗q\n1 Z\nf\nqgA − I −\nD∇gA * n dΓ\nφA (t) =\nF 0 Γ+\nkqk2\n\n(32)\n\nWith Eq. (32), one can see that, if the velocity vector q points in the direction\nof the outward normal unit vector n, then the dispersive term inside the\nbrackets vanishes, and the pdf φA (t) is equal to the total steady flow ratenormalized sum of the flux-weighted age flux concentration pdfs on the outlet\nlimit. This is always the case in one-dimension. The cross product term in\nEq. (32) reveals also that since the outflow limit is of arbitrary shape, then\nwhen velocity does not point in the direction of n a dispersive correction term\nis required. This is related to the fact that flux concentrations are defined with\nrespect to a control plane which is orthogonal to the velocity direction.\nThe discharge flow rate can also be described as a cumulative function of the\ntransit time values. We introduce the function fA (t) as the transit time cdf\nof the reservoir outlet, i.e. fA (t) is the probability that the molecules flow\nout with a transit time t or less, such that it corresponds to the normalized\n20\n\n\fcumulated outflow function FA (t):\nfA (t) =\n\nFA (t) Z t\n=\nφA (τ )dτ\nF0\n0\n\n(33)\n\nNote that the function fA (t) can also be viewed as the integral on Γ+ of\nthe total mass flux deduced from the resident concentration solutions of the\nADE (2a) for a unit step-input of mass flux on Γ− . By analogy, the life expectancy pdf and cdf of the reservoir inlet Γ− can similarly be defined by\n1 Z\n1 Z\nJE * n dΓ = −\n[qgE + D∇gE ] * n dΓ\nF0 Γ− \"\nF 0 Γ− !\n#\n1 Z\nq⊗q\nf\nD∇gE * n dΓ\n=−\nqgE + I −\nF 0 Γ−\nkqk2\n\nφE (t) =\n\nFE (t) Z t\nfE (t) =\n=\nφE (τ )dτ\nF0\n0\n\n(34)\n\n(35)\n\nEq. (13) indicates that the transit time flux pdf equals both the life expectancy flux pdf at inlet, and the age flux pdf at outlet. As a matter of\nfact, assuming neither addition nor subtraction of mass during transport,\nsteady-flow conditions and stationary state, then, theoretically, every probability flux JA on Γ+ has an identical counterpart JE on Γ− and vice-versa.\nTherefore, Eqs. (30), (32) and (34) relate to the same and unique function,\nφ(t) = φA (t) = φE (t), and thus f (t) = fA (t) = fE (t). In fact, each element\nadded in the reservoir at the inlet must exit at some position xo of the outlet\nsooner or later. Each element added at the position xo at the outlet must\ntravel the same distance upstream, and thus spend the same time-span within\nthe reservoir, backward in time, before reaching a position somewhere at the\ninlet limit.\nAt the reservoir outlet, the arrival times gA are distributed along the discharge\nboundary, implying mixing and superposition of the information carried by\neach breakthrough curve. Moreover, within the reservoir mixing processes can\nalso be important, and the true minimum and maximum ages can be diluted.\nTo characterize an outlet representative transit time distribution, we must\nensure that the minimum and the maximum ages are captured. Technical\nproblems can often occur when solving Eq. (30) or Eq. (34), because mass\nflux line/surface integration is required. If the outlet is of small size, then the\ncapture of calculated breakthrough curves, or the identification of particle arrivals, reveals to be ill-posed, mainly because of the loss of information due to\nthe mixing of converging fluxes. Hence, numerical methods will generally require a high level of refinement in the neighborhood of these integration limits,\nwhich rapidly becomes a computational limiting factor. Because the transit\ntime pdf φ(t) on the inlet limit is identical on the outlet limit, discretization\n21\n\n\fmethods imply that the number of observation nodes should be the same at\nthe inlet and at the outlet, in order to be able to recover the same breakthrough curves. In other words, the temporal resolution of the curve, when a\ncounting of the individual arrival times is performed, is a direct function of\nthe spatial refinement in the vicinity of exit zones. The same restriction affects\nother simulation methods, such as the random-walk procedure.\nIn the following, we propose an alternative approach that is relaxed from\nthe above-mentioned practical problems. Eqs. (2) and (5) are considered to\nsimulate the age and life expectancy probability distributions in the reservoir\nΩ.\nIntegrating REq. (2a) over Ω, and making use of the divergence theorem\nR\n( Ω ∇ * FdΩ = Γ F * n dΓ) results in\nZ\n∂ Z\nφgA dΩ = −\n[qgA − D∇gA ] * n dΓ (36)\n[qgA − D∇gA ] * n dΓ +\n∂t Ω\nΓ−\nΓ+\n\nZ\n\nNormalizing Eq. (36) by the steady flow rate F0 and accounting for Eq. (25)\nand (30), Eq. (36) can be turned into the following form:\n1 Z\n∂ψA (t)\nφA (t) + τ0\n=−\n[qgA − D∇gA ] * n dΓ\n∂t\nF 0 Γ−\n\n(37)\n\nwith the quantity τ0 being the turnover time commonly defined at steady-state\nas the ratio of porous volume to flow rate:\nτ0 =\n\nM0\nF0\n\n(38)\n\nSimilarly, the integration of the ADE (5a) has the form\nZ\n∂ Z\n−\n[qgE + D∇gE ] * n dΓ +\nφgE dΩ =\n[qgE − D∇gE ] * n dΓ (39)\n∂t Ω\nΓ+\nΓ−\nZ\n\nNormalizing Eq. (39) by F0 and accounting for Eq. (27) and (34) yields\nφE (t) + τ0\n\n∂ψE (t)\n1 Z\n=\n[qgE − D∇gE ] * n dΓ\n∂t\nF0 Γ−\n\n(40)\n\nThe boundary integrals in the right-hand sides of Eqs. (37) and (40) can\nbe simplified by accounting for the boundary conditions (2c) and (5c). For\ninstance, inserting the boundary condition (2c) into Eq. (37) reduces the\nboundary integral to −F0 δ(t), and inserting the boundary condition (5c) into\n22\n\n\fEq. (40) reduces the boundary integral to F0 δ(t), and Eqs. (37) and (40) become:\n∂ψA (t)\nφA (t) + τ0\n= δ(t)\n(41a)\n∂t\n∂ψE (t)\nφE (t) + τ0\n= δ(t)\n(41b)\n∂t\nWith Eq. (41a) we have recovered the RT formulation of Eriksson [27], in which\nthe outlet zone transit time pdf φA (t) is proportional to the first derivative of\nthe internal age pdf ψA (t), thus characterizing the probability for the water\nmolecules of being removed from Ω per unit time. Eq. (41b) is an equivalent\nformulation which relates the recharge boundary life expectancy distribution\nto the internal life expectancy distribution. Since the functions φA (t) and\nφE (t) are equal, it follows from Eqs. (41a) and (41b) that ψA (t) = ψE (t),\nwhich allows writing the following general RT formulation:\nφ(t) + τ0\n\n∂ψ(t)\n= δ(t)\n∂t\n\n(42)\n\nEq. (42) generalizes the RT to advective-dispersive solute transport processes,\nand is valid for both age and life expectancy. If dispersion is set to zero,\nthe function ψ(t) can be evaluated by integration of the field gA (x, t) =\nδ(t − hAi(x)) as proposed by Etcheverry and Perrochet [28,29]. Similarly,\nthe function ψ(t) can be evaluated by integration of the field gE (x, t) =\nδ(t − hEi(x)). Since ψ(t) = ψA (t) = ψE (t), it follows from Eq. (9) that\nM (t) = MA (t) = ME (t). This points out the importance in allowing age\nand life expectancy dispersive fluxes crossing naturally the outlet and inlet\nboundary portions, because the use of the homogeneous Neumann condition\non Γ+ and may lead to different results for φ(t) if contrasted boundary configurations and flow conditions exist. The third-kind boundary conditions (2c)\nand (5c) are the most meaningful conditions for solving the age and life expectancy problems. They ensure a pure total flux pulse input entering the\nsystem at inlet for the age problem, and at outlet for the life expectancy\nproblem. These conditions become homogeneous for t > 0 (zero flux), and\ndo not allow backward mass losses by dispersion. This would not be the case\nwhen using a Dirichlet type condition, which may lead to incorrect solute mass\nbalances. For the one-dimensional case, the use of the Dirichlet condition permits the simulation of the age and life expectancy pdfs, but directly for flux\nconcentration pdfs (see Appendix A).\nThe fundamental relation between the outlet transit time cdf f (t) and the\ninternal age pdf ψ(t) given by the RT is obtained after integration of Eq. (42):\nF0 − F (t) = M0 ψ(t) =\n\n23\n\n∂M (t)\n∂t\n\n(43)\n\n\for\nf (t) + τ0 ψ(t) = 1\n\n(44)\n\nEq. (43) indicates that the outflow of water molecules that leave the system\nthrough Γ+ with an age older than t is balanced by the number of elements\nper unit time within Ω that reach the age t, i.e. in the interval [t, t + dt]. The\ncorresponding volume of groundwater reaching the age t in Ω is M0 ψ(t)dt.\nIn other words, the flow rate fraction of age t or less at the outlet is a function of the spatial occurrence in the reservoir of water molecules of age t or\nless. Since the function f (t) is zero at the origin, it follows that the value of\nψ(t) at origin is the turnover rate σ0 (ψ(0) = σ0 = 1/τ0 ), independently of\nthe level of dispersion. Since f (t) is a cumulative function, then ψ(t) must\nbe monotonically decreasing and M (t) must be an increasing function with\nmonotonically decreasing increments [27]. The pdf ψ(t) is constant from zero\nto the minimum age tmin at outlet, with ψ(0, . . . , tmin ) = σ0 , which throws\nlight on the fact that the probability per unit time of finding elements in Ω\nthat have reached the age t ≤ tmin is certain. From Eq. (43) it follows that\nM (t) has a constant derivative equal to M0 ψ(0) = F0 until the minimum age\ntmin is reached at outlet. Note that the same considerations can be made for\nf (t) = fE (t), ψ(t) = ψE (t) and M (t) = ME (t).\nFig. 4 illustrates in 1-D the outlet (or inlet) transit time pdf, the internal\nage (or life expectancy) pdf, and the internal transit time pdf resulting from\nthe analytical resolution of Eqs. (25), (29) and (42) (see Appendix A). Under\npure convective transport conditions (dashed lines in Fig. 4), the function φ(t)\nequals the piston-flow transit time pdf δ(t − τ0 ), and the function ψ(t) is the\nHeaviside function H(τ0 − t)/τ0 , such that ψ(t) = ψ(0) = 1/τ0 until tmin = τ0 ,\nand ψ(t) = 0 after tmin . The first temporal moment of the pdf φ(t) (average\ntransit time at outlet τt ) is dispersion-independent, and equals the turnover\ntime τ0 . The average internal transit time τit and the average internal age\nτi (first temporal moments of Ψ(t) and ψ(t)) are dispersion dependent. Increasing longitudinal dispersion (low Péclet numbers) generates short arrival\ntimes and tailing effects (see the variances of the pdfs in Appendix A), and\nthus old arrival times at the outlet as well as old ages within the domain,\nwhich are visible on the three functions φ(t), ψ(t) and Ψ(t) for a range of\nPéclet numbers. The function ψ(t) is constant from 0 until the minimum age\nat outlet. Since the Cauchy type condition prevents backward losses by dispersion at x = 0, the value of ψ(t) at the origin is always 1/τ0 for any Péclet\nnumber (Fig. 4b). From the spatial organization of age or life expectancy occurrence it is possible to predict the transit time distribution of a reservoir\noutlet (or equivalently the life expectancy distribution of a reservoir inlet),\nwithout the need of 'counting' the arrivals of the water molecules at a boundary of finite size. Thus, the pdf φ(t) defined in Eqs. (30) or (34) as a pure\nboundary property becomes a property of the reservoir internal structure and\nhydro-dispersive characteristics. The information that can be lost when φ(t)\n24\n\n\f(a)\n\nPe =∞\nPe = 500\n\n5\n\nPe = 50\n\n2\n1\n0\n\n0\n\n1\n\n2\n\nDimensionless time\n\n3\n\n0\n\n6\n\n(c)\n\nPe = ∞\nPe = 500\n\n5\n4\n\nPe = 50 Pe = ∞\n\n2\n\nPe = 5\n0\n\n1\n\n1\n\nPe = 50\n\n3\n\nPe = 500\n\n1\n\nPe = 5\n\n7\n\n(b)\n\n2\n\n4\n3\n\n3\n\nDimensionless Ψ\n\n6\n\nDimensionless ψ\n\nDimensionless φ\n\n7\n\n2\n\nDimensionless time\n\n3\n\n0\n\nPe = 5\n0\n\n1\n\n2\n\n3\n\nDimensionless time\n\nFig. 4. Reservoir theory pdfs for a 1-D semi-infinite flow domain, as a function of\nthe Péclet number for Pe = 5, 10, 25, 50, 100, 250 and 500. (a) Outlet transit time\npdf; (b) Internal age (or life expectancy) pdf; (c) Internal transit time pdf. Time is\nnormalized by the average turnover time τ0 = L/v, x by a characteristic length L,\nand Pe = Lv/D.\n\nis directly evaluated at the reservoir exit zone (or inlet zone) is recovered with\nEq. (42). A far more accurate evaluation of φ(t) is thus achieved, for which\nthe main operation (domain integrals (25) and (27)) is not time-consuming\nand can easily be implemented for one-, two- and three-dimensional systems.\nA convenient way to compute Eq. (42) is to work in the Laplace space, since\nit allows handling all time-dependent quantities in a quasi-analytical way.\n\n3.3\n\nTemporal moments of the reservoir theory probability density functions.\n\nA direct consequence of the RT is that the expected value of the mean residence\ntime, i.e. the average transit time τt at outlet or inlet, equals the reservoir mean\nturnover time τ0 . This property can be found by calculating the first temporal\nmoment of the transit time pdf φ(t), and by making use of Eq. (44):\nτt =\n\nZ +∞\n0\n\ntφ(t)dt =\n\nZ +∞\n0\n\n[1 − f (t)]dt = τ0\n\nZ +∞\n0\n\nψ(t)dt = τ0 =\n\nM0\nF0\n\n(45)\n\nwhere use has been made of the pdf property in Eq. (10). Since the reservoir is\nconsidered under steady flow conditions, internal average time characteristics\ncan be defined. The temporal moments of the global functions ψ(t) and Ψ(t)\nhave physical significance since resident concentration has been integrated in\nspace. The mean internal age τia and the mean internal life expectancy τie are\ndeduced from the first temporal moment of the function ψ(t). Integrating by\nparts and making use of the relation (42) results in:\n+∞\n\nt2 ψ(t)\nτi =\ntψ(t)dt =\n2 0\n0\n2\nμ2 [φ]\nτ0\nσ [φ]\n=\n= (1 + 2 )\n2τ0\n2\nτ0\nZ +∞\n\n1 Z +∞ 2 ∂ψ(t)\n1 Z +∞ 2\n−\nt\ndt =\nt φ(t)dt\n2 0\n∂t\n2τ0 0\n(46)\n\n25\n\n\fSince ψA (t) = ψE (t) = ψ(t), we have set τia = τie = τi . Using Eq. (16), the\naverage internal transit time τit is deduced from the first temporal moment of\nthe function Ψ(t), and is found to be equal to twice the value of τi :\n\n1 Z\n1 Z Z +∞\nφ\ntgT (x, t)dtdΩ =\nφhT idΩ\nM0 Ω 0\nM0 Ω\n0\n1 Z\n1 Z\n=\nφhAidΩ +\nφhEidΩ = 2τi\nM0 Ω\nM0 Ω\n\nτit =\n\nZ +∞\n\ntΨ(t)dt =\n\n(47)\n\nUsing Eq. (42), integrating by parts and inserting Eq. (46), the second temporal moment and the variance of the distribution φ(t) reveal themselves as\nbeing functions of τ0 and τi (or τit ) only:\nμ2 [φ] =\n\nZ +∞\n0\n\nt2 φ(t)dt = 2τ0 τi = τ0 τit\n\nσ 2 [φ] = τ0 (2τi − τ0 ) = τ0 (τit − τ0 )\n\n(48a)\n\n(48b)\n\nFinally note that by using the same technique than in Eq. (46), one can show\nthan the second moment of ψ(t) is a function of the third moment of φ(t),\nμ3 [φ] = 3τ0 μ2 [ψ].\n\n3.4\n\nAccuracy of the RT approach.\n\nThe accuracy of the RT method compared to a classical evaluation of the transit time pdf φ(t) at the outlet limit is illustrated in Fig. 5, using a four-layered\nvertical aquifer. The outlet zone is of very small size (Fig. 5a), which forces the\ninformation on age to be highly mixed. As attested by Fig. 5b, the individual\nage pdfs at outlet can be of very different shape. The differences between the\ntwo evaluation methods are very important. The flux-weighted sum of the age\nmass fluxes monitored at the outlet nodes suffers from a loss of information\ninduced by the mixing of converging fluxes at the outlet surroundings. With\nthe RT, this information is recovered, since we ensure that each contribution\nto the outflow rate is accounted for. According to Eq. (45), the average residence time τt must equal the turnover time τ0 ; it is clear with this example\nthat this property is not satisfied by straight application of Eq. (30), while\nthe RT provides a very accurate solution (Fig. 5c).\n26\n\n\fFig. 5. Theoretical four-layered aquifer illustrating the accuracy of the RT compared to the classical direct evaluation at the outlet of the function φ(t). (a) Model\ngeometry, boundary conditions and head solution in meters; (b) Age pdfs monitored at outlet, from which a flux-weighted average evaluation of the transit time\npdf is performed; (c) Outlet transit time pdf evaluated at outlet and using the RT.\nTransport parameters: αL = 2.5 m, αT = 0.01αL , Dm = 0.\n\n27\n\n\f4\n\nDirect evaluation of aquifer water volumes versus age, life expectancy and transit time.\n\nThe specific groundwater volumes related to a given range of ages or residence\ntimes are important quantities to consider when addressing aquifer management strategies. Assessing the long-term evolution of groundwater chemistry,\nor defining corrective measures aiming at restoring groundwater quality after\na contamination event, indeed requires appropriate age and volume-related\ninformation. In this section, we complete the framework of the RT by analyzing the transit time cdf f (t) to show how complex aquifer porous volumes can\ndirectly be quantified as a function of age, life expectancy, and transit time.\n\n4.1\n\nCharacteristic groundwater volume functions.\n\nProvided the residence time distribution φ(t) and the total discharge F0 are\nknown, the characterization of internal groundwater volumes can be done in a\nrelatively straightforward manner\nby a simple analysis of the function F (t) as\nRt\ndefined in Eq. (33), F (t) = F0 0 φ(u)du. In Fig. 6, the theoretical shape of the\ncumulated outflow function F (t) (or cumulated inflow function) is represented.\nThe areas υA , υT , and υ0 in Fig. 6a characterize different groundwater volumes\nthat can be defined as functions of time t (Fig. 6b). The area υA (t) represents\nthe total groundwater volume V in Ω of age inferior or equal to t but that\nwill experience a transit time superior to t:\nυA (t) = VΩ {A ≤ t and T > t} = t[F0 − F (t)] = M0 tψ(t)\n\n(49)\n\nIn Eq. (49), the pdf ψ(t) is expressed given the relationship (43) between ψ(t)\nand F (t). When the minimum transit time tmin is not nil, the function υA (t)\ncontains the volume of age inferior or equal to time tmin , which is the area\nυA1 (t) = tmin (F0 − F (t)), and the volume of age inferior or equal to t and\nsuperior to time tmin , which is the area υA2 (t) = (t − tmin )(F0 − F (t)). The\narea υT = υT (t) is the volume of groundwater that flows through Ω with a\ntransit time t or less:\nυT (t) = VΩ {T ≤ t} = tF (t) − υ0 (t)\n\n(50)\n\nwith the area υ0 (t) being the amount of exfiltrated water having travelled from\ninlet to outlet during an observation time period t,\nυ0 (t) = VΓ+ {A ≤ t} =\n\nZ t\n0\n\n28\n\nF (u)du = tF0 − M (t) ,\n\n(51)\n\n\fand where use has been made of Eqs. (25) and (43) to express the function\nM (t). The quantity tF (t) in Eq. (50) is the total amount of groundwater water\nin Ω that reaches the age t or less on Γ+ , plus the volume flowing out with an\nage t or less. The amount of groundwater water υT (t) is nil until the minimum\ntransit time tmin , and reaches the total porous volume at the maximum transit\ntime tmax . The function υT (t) contains the volume of age inferior or equal to\ntime tmin , which is the area υT 1 (t) = tmin F (t) in Fig. 6a, and the volume of\nage superior to time tmin , which is the area υT 2 (t) = (t − tmin )F (t) − υ0 (t) in\nFig. 6a. Note also that the total amount of groundwater of age tmin or less is\ngiven by the sum υA1 + υT 1 = tmin F0 .\nSince the amount of groundwater υT (t) is the internal volume that will leave\nthe reservoir up to time t, it equals the internal transit time cumulative distribution function, υT (t) = MT (t), and it represents a part of the function\nM (t). The complementary part is the amount of groundwater water of age t\nor less and of transit time superior to t, namely the function υA (t) defined in\nEq. (49):\nM (t) = VΩ {A ≤ t} = υA (t) + υT (t)\n(52)\nWith Eq. (52), one can express υA (t) as the difference between two increasing\nfunctions that both tend to the porous volume M0 at infinity. The function\nυA (t) is thus zero at the origin and at infinity. Since υT (t) is zero until the\nminimum transit time tmin , υA (t) must equal M (t) between 0 and tmin . During this time-span, which can be taken as the signature of badly recharged\nand/or advection-dominated systems for significant values of tmin , these two\nfunctions have a constant derivative (see Fig. 6b) equal to the steady flow\nrate F0 = M0 ψ(0). The behavior of this function (number of peaks, compared\ndurations of increasing and decreasing parts) is instructive as to the volumetric proportions of groundwater remaining a long time in the system, or\nflowing quickly to the outlet. The time after which the function υA (t) starts\nto decrease gives information on the importance of the water volumes in the\naquifer with long or short transit times. If this time is relatively young, then\nthe aquifer may present a good turn-over property, and vice-versa.\nDifferentiating Eq. (52) with respect to time, and accounting for Eqs. (25), (29)\nand (42), yields\nτ0\n(53)\nφ(t) = Ψ(t)\nt\nThis fundamental relation includes all the features of the RT in the most\ncompact form. Compared to the standard rule (42), Eq. (53) is a great improvement. It is simpler and may provide the transit time distribution φ(t)\nwith much higher resolution and accuracy, in relation with the fact that no\ndifferentiation between φ(t) and Ψ(t) is required.\nNote that if F (t) characterizes the inlet cumulated inflow rate, i.e. F (t) =\nF0 fE (t), then each aquifer porous volume defined above as a function of age\n29\n\n\f(a)\n\nυ0\ntmin\n\n0\n\nt)\n\nTransit time [T]\n\ntmax\n\n0)\nψ(\n\nυA(t)\n\n0\n\nψ(\n\nM\n\nM\n\nυ T (t)\n\n0\n\nυT2\n\nM(t)\n\nF\n\nυT1\n\nt)\nF(\n\nυA2\n\nυA1\n\n(b)\n\nM0\n\nGroundwater volumes [L3]\n\nF(t) and ψ(t) [L3/T]\n\nF0\n\ntmin\n\nTime [T]\n\ntmax\n\nFig. 6. Theoretical cumulated outflow function, internal age pdf (scaled by the\nporous volume) and internal groundwater volume functions: (a) Cumulated outflow\nfunction F (t), with the indicated areas υA , υT and υ0 representing characteristic\ninternal groundwater volumes relative to a value of time; (b) Aquifer porous volumes\nM (t), υA (t) and υT (t) as a function of age and transit time.\n\nbecomes a function of life expectancy. By analyzing the system outlet transit\ntime cdf, the quantification of complex groundwater volumes with respect to\nage, life expectancy, and transit time, is straightforward, and provides important practical system insights. An obvious application is the groundwater\nresources protection and vulnerability assessments. The underground storage\nof toxic wastes also requires the knowledge of groundwater volumes that are\npotentially subject to contamination, and assumptions on the time spent by\nthese volumes within the reservoir until they reach an outlet area.\n\n4.2\n\nCharacteristic times versus aquifer particularities.\n\nFollowing Bolin and Rhode [7], some aquifer configuration particular cases can\nbe drawn from the first moments of φ(t) and ψ(t).\nThe first considerations correspond to the case for which the average transit time and the average internal age are identical,\nτ = τi . Using Eqs. (45)\nR t\nand (46), the condition for having τt = τ0 = τi is 0∞ \u0010t[φ(t)\u0011 − ψ(t)]dt = 0, for\nwhich a sufficient condition is φ(t) = ψ(t) = τ10 exp − τt0 . The exponential\nform of the transit time pdf is a direct consequence of the first-order linear\ndifferential equation (42): if one of the two pdfs φ(t) and ψ(t) has an exponential form, then the other must be identical. This is the exponential model,\noften termed the well-mixed model, which is mathematically equivalent to the\nunit response function of a well-mixed reservoir. In chemical engineering, this\nmodel is used for reactors inside which the age distribution of the elements\nis uniform, i.e. there is a perfect mixing of the elements. Although the exponential model is widely used by hydrogeologists to simulate isotopic data,\nits application in aquifer systems must be handled carefully, since it involves\n30\n\n\fa large number of poorly realistic assumptions on the aquifer structure and\nrecharge conditions. Eriksson [26] interpreted the exponential distribution of\nages in groundwater as a consequence of an exponential decrease of porosity and permeability with depth. Luther and Haitjema [44] argued that the\nconditions on the validity of the exponential residence time distribution in\nporous media (horizontal, un-stratified and homogeneous aquifer with respect\nto porosity φ, recharge rate I, and saturated thickness H ), can be relaxed if\nthe parameters φ, I, and H vary in a piecewise constant way, such that the\nratio φH/I remains constant throughout the domain. This ratio characterizes\nthe system turnover time, which means that each water sample taken from\nthe reservoir must lead to a mean age that equals the aquifer mean turnover\ntime. In nature however, such system configurations and conditions on mean\nage may hardly be found. Etcheverry [30] showed that a simple linear variation of the thickness H significantly influences the shape of the theoretical\nexponential residence time distribution.\nWe now consider the case where τt > τi . This case corresponds to the situation\nfor which only few water molecules leave the aquifer rapidly after having entered. Confined aquifer conditions and/or very distant recharge and discharge\nzones are typical settings leading to these features. For such a configuration,\nthe outlet transit time pdf φ(t) is generally small or nil for young ages, attesting the existence of a minimum duration for travelling from inlet to outlet.\nThe functions υA (t) and M (t) tend to remain identical until the minimum\ntransit time is reached. After this date, the function υA (t) should decrease\nrapidly, reflecting the fact that after the shortest travel distance from source\nto sink has been covered, the outflow of older water molecules is concentrated\nover a short time-span, in relation to the relative uniformity of the travel distances within the system. A narrow triangle-shaped function υA (t) is typical\nof aquifers with significant minimum transit times and bad turnover property.\nNote also that from Eq. (46) one can see that for systems with large turnover\ntime, or relatively low hydro-dispersive properties (i.e. when σ[φ] is small),\nthe average age in the reservoir may also be smaller than the turnover time,\nwith the lowest possible value τi = τ20 for the piston-flow configuration only\n(σ[φ] = 0).\nFinally, the case τt < τi corresponds to the situation for which important\namounts of water molecules enter the aquifer and flow out relatively rapidly,\nwhile sufficient amounts of water stay long enough to increase the value of τi .\nFor such a configuration, φ(0) must be bigger than ψ(0), and the two curves\nmust both decrease and cross each other at a certain date, after which ψ(t)\nis higher than φ(t). This situation may be encountered when the source and\nsink zones are close to each other, or when superficial recharge is uniformly\ndistributed, such that the fraction of young water is important at outlet, but\nwhen the heterogeneity of the velocity distribution is such that long travel\npaths might lead to old ages within the domain. Karstic systems are typical\nmedia where the case τt < τi is encountered, in relation to the effect of the\n\n31\n\n\fhigh velocities in the karstic network, which can carry water molecules more\nor less independently of the surrounding low permeability matrix. Considering\nEq. (46), the case τt < τi can occur in systems with small turnover time, or\nrelatively high hydro-dispersive properties (large σ[φ]).\n\n5\n\nAnalysis of dispersion and aquifer geometry effects on age distributions.\n\nIn the following, 2-D theoretical examples are presented to illustrate the proposed methods. Analytical and numerical solutions are provided in order to\ntest the sensitivity of the probability and density functions to the advective\nand dispersive parameters, as well as to the aquifer structure.\n\n5.1\n\nTwo-dimensional single flow system aquifer.\n\nA 2-D half-circular crown-shaped reservoir is used to simulate a single-flow\nsystem aquifer, homogeneous with respect to porosity φ and hydraulic conductivity K. A positive head difference is applied between the recharge and\ndischarge areas (Fig. 7a). This geometry is well suited for the derivation of\nanalytical solutions [29]. Due to homogeneity and symmetry, the flow lines\nremain parallel to each other, flow being one-dimensional along the flow line\ncoordinate. The spatial distributions of mean age and mean life expectancy\ncan thus be solved analytically (see Appendix B), and reveal to be symmetric\n(Fig. 7a), yielding a co-centrical distribution of mean transit time. The porous\nvolumes υA (= υA1 + υA2 ) and υT (= υT 1 + υT 2 ), quantified using the cumulative outflow function F (t), can easily be identified in Fig. 7 by using the mean\nage and the mean transit time isochrones. Note that the special case of this\ntheoretical aquifer allows a good representation of the groundwater internal\nvolumes with the mean values of the global distributions. However, the mean\nof the age, life expectancy, and transit time distributions would generally give\na rough representation only, when e.g. significant dispersive processes take\nplace. Etcheverry and Perrochet [29] analyzed the pure advective case and\nfound that φ(t) is proportional to 1/t, and that ψ(t) is proportional to ln(1/t)\nbetween the minimum and the maximum transit time (see Fig. 8a). The function Ψ(t) is a constant from the minimum to the maximum transit time, which\nindicates that the aquifer volumes ranging between a unit increase of transit\ntime remain constant (the aquifer volumes between two iso-contours in Fig. 7b\nare all the same). The case αT = 0 in Fig. 8a was analyzed by means of analytical solutions (Appendix B). For this system, the pdfs φ(t), ψ(t) and Ψ(t)\nshow generally moderate fluctuations with respect to longitudinal dispersion.\nThe main effect of the αL coefficient can be seen in the increase of the spread32\n\n\fInlet: H\nυA1\n\nOutlet: H\n\nH2\nυT1\n\nθ\n\nr0\n\nH1\n\ntmin\n\nFlow line\n\nυT2\n\nυA1\n\nυA2\n\nτt\n\ntmax\n\nυT2\n\nυT1\nυA2\n\nR\n(a)\n\n(b)\n\nFig. 7. Analytical solutions for mean age, mean life expectancy and mean transit time for the 2-D vertical half-circular aquifer (Appendix B): (a) Mean age\n(solid lines) and mean life expectancy (dashed lines) isochrones with 50 days increment; (b) Mean transit time isochrones with 50 days increment. Parameters:\n∆H = H2 − H1 = 100 m, K = 10−4 m/s, φ = 0.2, inner radius r0 = 250 m, outer\nradius R = 1000 m, minimum transit time tmin = 143 days, maximum transit time\ntmax = 2285 days, turnover time τ0 = τt = 772.5 days.\n\ning of the probability distributions. The outlet transit time pdf shows younger\narrival times when αL increases, but also a longer tail. The functions ψ(t) and\nΨ(t) are affected the same way by longitudinal dispersion. The average internal\nage τi and the average internal transit time τit are dispersion dependent; they\nincrease linearly with αL , indicating that dispersion leads to a higher average\nage of the system. Note that the second temporal moments of the internal\nage and transit time distributions increase proportionally with the square of\nαL , while the variance of φ(t) increases linearly with αL . Contrasted behavior appears when the coupled effect of longitudinal and lateral dispersivity is\ntaken into account (Fig. 8b). The case αT 6= 0 was analyzed using numerical solutions, by increasing the ratio α = αL /αT . The tailing effect decreases\nfrom a starting situation (α = ∞ in Fig. 8b) with increasing values of lateral\ndispersivity (decrease of α ratio in Fig. 8b). Lateral dispersivity induces the\nmixing of ages, old water molecules moving laterally between the flow lines\nand replacing younger molecules, and vice-versa. The internal groundwater\nvolume functions also attest of the above-mentioned dispersion effects. For\nexample, the function υA (t) shows long tails for large values of αL , reinforcing the observed behavior at outlet of the transit time pdf for old ages. The\ninternal increase of water volumes that require long transit times to exit the\naquifer due to an increase of αL has of course its consequence at outlet with\nolder arrival times. As with the pdfs φ(t), ψ(t) and Ψ(t), this tailing effect\ndecreases when lateral dispersion is added.\n33\n\n\f0.0010\n\nΨ\n\n0.0005\n\n0.0005\n0.0000\n\n0\n\n1000\n\n0.0015\n\n2000\n\nα =∞\nα = 10\nα = 5\n\n0.0010\n\n0.0000\n\n0\n\n0.0005\n\n1000\n\n1000\n\n2000\n\n3000\n\n0.0000\n\nTime [days]\n\n90\n70\n\nυT\n\n60\n50\n40\n\nυA\n\n30\n20\n10\n0\n\n3000\n\nM\n\n80\n\n0\n\n1000\n\n2000\n\n3000\n\n2000\n\n3000\n\n100\n\nψ\nΨ\n\n0.0005\n\n0\n\n2000\n\n0.0015\n\n0.0010\n\n(b)\n\n0.0000\n\n3000\n\nGroundwater volumes\n\n(a)\n\nφ [1/day]\n\nψ\n\n0.0010\n\n0.0015\n\nψ and Ψ [1/day]\n\nφ [1/day]\n\n0.0020\n\n100\n\n0.0015\n\nGroundwater volumes\n\nαL = 0 m\nαL = 10 m\nαL = 50 m\n\nψ and Ψ [1/day]\n\n0.0025\n\n0\n\n1000\n\n2000\n\nTime [days]\n\n3000\n\n90\n\nM\n\n80\n70\n\nυT\n\n60\n50\n40\n\nυA\n\n30\n20\n10\n0\n\n0\n\n1000\n\nTime [days]\n\nFig. 8. RT solutions for the 2-D vertical half-circular aquifer: (a) Analytical solutions\n(see Appendix B) for the pdfs φ(t), ψ(t) and Ψ(t), and for the internal groundwater\nvolume functions (in % of M0 ) M (t), υA (t) and υT (t), as a function of the αL\ncoefficient (αT = Dm = 0); (b) Numerical solutions as a function of the ratio\nα = αL /αT , with αL = 50 m.\n\n5.2\n\nVertical multi-layer aquifer.\n\nIn this second theoretical example, we consider a four-layered vertical aquifer\nsystem, as illustrated in Fig. 9a. From the top to the bottom of the model,\nthe layers have decreasing thicknesses and increasing pore velocities. The domain is discretized into 30'000 homogeneous bilinear quadrangles. The total\nporous volume M0 is 65312.5 m3 . A constant input flow rate enters the system along the left limit, using imposed fluxes of varying intensity proportional\nto the different layers hydraulic conductivities. The system turnover time is\nτ0 = 162.267 days. The outlet is simulated at the top of the right side by a\nconstant hydraulic head along a relative small zone of 15 m. The permeabilityporosity couples have been set in a way that the pore velocity contrasts involve\nspecific ages within each layer (velocities vi in Fig. 9a), creating specific ages\nwithin each layer, as illustrated in Fig. 9b. The fact that the layers thickness diminishes with depth, while the influx intensity increases, is meant to\ncreate arrival time peaks at outlet of comparable orders of magnitude. The\ntemporal moments τi and τit are good indicators of the dynamics of the global\nsystem. Because they are volume-averaged quantities, their magnitude will\ndepend on the water quantities of contrasted age and transit time, which are\ndirectly related to the flow and transport dynamics. For this example, τi and\nτit show only small variations with respect to dispersion (Table 1), because\neven if velocities between layers are contrasted, flow in the system is generally\n34\n\n\f(a)\n\nF0 = 402.5 m3/d\n\nH = 150 m\n161\n\n160\n\n159\n\n158\n\nv1\n\n157\n\n156\n\n155\n\n154\n\n153\n\nv2\nv3\nv4\n1250 m\n50\n\n100\n\n150\n\n200\n\n250\n\n150 m\n\n10\n\n(b)\n\nFig. 9. 2-D vertical multi-layered aquifer: (a) Boundary conditions and Laplacian\nflow field in meters; (b) Mean age isochrones in days, illustrating the pore velocity\ncontrast effect on age transport (αL = ∆x = ∆z = 2.5 m, αT = 0, Dm = 0).\nAverage pore velocities (in m/day): v1 = 4.0, v2 = 6.5, v3 = 10.5, v4 = 23.5.\n\nrapid. Longitudinal dispersion has the effect of making the system older, by\ncreating long tails that can be observed at the reservoir outlet, but also on\nthe internal age and internal transit time distributions (Figs. 10a and 10b).\nSpreading in the direction of velocity is of course the main cause for this.\nLateral dispersion presents the property of homogenizing the ages by mixing\nwater molecules of different ages. For a given level of longitudinal dispersion,\nincreasing the ratio α = αL /αT (Fig. 11) makes the system younger (tailing\nis lowered), with diminishing values of the mean internal age τi and the mean\ninternal transit time τit (Table 1). Longitudinal dispersion induces spreading\nof solute particles, and thus variability around the plume center of gravity.\nWhen lateral dispersion is added, the mixing of water molecules between flow\nlines homogenizes the ages. When longitudinal spreading is important, the\nexchange surface along the plume body is extended, and mixing can then be\nexpected to be of high magnitude. The internal transit time pdf Ψ(t) is of\nparticular interest for the characterization of the internal organization of the\nflow dynamics. Its shape and particularly the number of modes it shows has a\ndirect consequence on the shape of the outlet transit time pdf. If we take the\nexample of the case α = ∞ (αT = 0) in Fig. 11, the function Ψ(t) exhibits\nas many peaks as the outlet transit time pdf φ(t). However, the magnitude of\nthese peaks are different for the two functions, and discern the transit time\nfrequencies at outlet from those of the system pore volume. The peak of maximum intensity is the first one for φ(t), and the third one for Ψ(t). If one\nlooks at the time value corresponding to the first peak of φ(t), say t1 , then\ninside the domain the density of probability that the water molecules have a\ntransit time equal to t1 is smaller than the same density of probability at the\nreservoir outlet. This is due to the fact that Ψ(t) deals with volume-average\nprobabilities while φ(t) deals with flux-average probabilities. The four consecutive peaks of the outlet transit time pdf correspond to the four families\nof water molecules, which transit within the four layers of the system, even\nthough some parts of the curve attest to some mixing effects (the density of\n35\n\n\f0.006\n\n0\n\n400\n\n100\n\n200\n\n300\n\n400\n\n500\n\n0.000\n\n0\n\n100\n\n(c)\n\nGroundwater volumes\n\nF(t) [m3/day]\n\nΨ\n\n0.002\n\n0.002\n\n300\n\n200\n\n100\n\n0\n\nψ\n\n0.006\n0.004\n\n0.004\n\n0.000\n\n(b)\n\n0.008\n\nψ and Ψ\n\n[1/day]\n\n0.008\n\nφ\n\n0.010\n\nαL=5m\nαL=10m\nαL=20m\n\n(a)\n\n[1/day]\n\n0.010\n\n100\n\n200\n\n300\n\n400\n\n(d)\n\n90\n\n200\n\nM\n\n80\n\n300\n\n400\n\n500\n\n400\n\n500\n\nυT\n\n70\n60\n50\n\nυA\n\n40\n30\n20\n10\n0\n\n0\n\n100\n\n500\n\n0\n\n100\n\n200\n\n300\n\nTime [days]\n\nTime [days]\n\nFig. 10. Calculated pdfs, cdfs and groundwater volumes for the 2-D vertical multi-layered aquifer as a function of dispersion, for the ratio α = αL /αT = 10: (a)\nOutlet transit time pdf; (b) Internal age pdf and internal transit time pdf; (c)\nOutlet cumulated outflow function; (d) Groundwater volumes versus time (in % of\nM0 ).\nTable 1\nDispersive parameters related to Figs. 10 and 11, and calculated pdf statistics (units\nin meters and days).\nParameters\n\nFig. 10\n\nFig. 11\n\nα = αL /αT\n\n10\n\n10\n\n10\n\n∞\n\n50\n\n10\n\nαL\n\n5.0\n\n10.0\n\n20.0\n\n5.0\n\n5.0\n\n5.0\n\nαT\n\n0.5\n\n1.0\n\n2.0\n\n0.0\n\n0.1\n\n0.5\n\nσ[φ]\n\n75.710\n\n75.955\n\n79.871\n\n81.766\n\n79.786\n\n75.940\n\nτi\n\n98.902\n\n98.915\n\n101.010\n\n102.156\n\n100.905\n\n98.916\n\nStatistics\n\nprobability is not necessarily zero between two peaks). This simple theoretical\nexample shows the complexity that is to be expected for the nature of the age\nand transit time distributions. It underlines how the significance of average\nage can lead to erroneous interpretations, regarding the system dynamics (e.g.\ninferences on average velocity) or hydrogeological problems related to risk and\nvulnerability assessment. Whenever the outlet transit time pdf is multi-modal,\n36\n\n\f0.012\n\n(b)\n\n0.008\n\nΨ\n\nψ\n\n0.006\n\nψ and Ψ\n\n0.008\n\n0.004\n\nφ\n\n[1/day]\n\n0.010\n\nα=∞\nα = 50\nα = 10\n\n(a)\n\n[1/day]\n\n0.016\n\n0.004\n\n0\n\n200\n\n300\n\n400\n\n500\n\n(c)\n\n300\n\n200\n\n100\n\n0\n\n0.000\n\n0\n\n100\n\n400\n\nF(t) [m3/day]\n\n100\n\nGroundwater volumes\n\n0.000\n\n0.002\n\n100\n\n200\n\n300\n\n400\n\n500\n\nTime [days]\n\n(d)\n\n90\n\n200\n\nM\n\n80\n\n300\n\n400\n\n500\n\n400\n\n500\n\nυT\n\n70\n60\n50\n\nυA\n\n40\n30\n20\n10\n0\n\n0\n\n100\n\n0\n\n100\n\n200\n\n300\n\nTime [days]\n\nFig. 11. Calculated pdfs, cdfs and groundwater volumes for the 2-D vertical multi-layered aquifer as a function of the ratio α = αL /αT : (a) Outlet transit time pdf;\n(b) Internal age pdf and internal transit time pdf; (c) Outlet cumulated outflow\nfunction; (d) Groundwater volumes versus time (in % of M0 ).\n\nthen the average transit time can definitely not be used as a reliable quantity representative of the distribution since, as illustrated here, mean ages at\noutlet are mostly related to the lowest densities of probability (see Figs. 10\nand 11, Table 1). Once more this consideration points out to the interpretation\nof average age measurements, but also mean age simulations, which should be\ndone very carefully. Generally, attention is given to hydrodynamic dispersion,\nheterogeneity, and long distance travelling induced mixing [35,71,72], which\nare factors that represent a source of uncertainty for the age dating methods and environmental tracer data interpretations. Here one can see that the\ngeological, the structural and the hydraulic boundary configurations can by\nthemselves be responsible of unrepresentative mean ages, even in advectiondominated transport regimes. Even if the entire groundwater age distribution\ncannot be measured in the field, mean age dates can be of great help for model\ncalibration purposes. However, mean ages should a priori not represent an absolute simulation answer, and the knowledge of the entire age distribution\nshould be of prime interest in most cases.\n37\n\n\f6\n\nSummary and conclusions.\n\n(1) The probability distributional evolution of groundwater age and life expectancy has been simulated by forward and backward transient advectiondispersion type equations, according to proper boundary conditions. For a\ngiven position in space, the age and the life expectancy pdfs are complementary distributions. Straight application of the principle of superposition to\nthese distributions results in an integrated distribution of transit times, which\ncharacterizes the probability of having a given transit time from the recharge\nzone to the discharge zone, together with the quantities associated to that\ntransit time. The transit time pdf is simply the convolution integral of the\nage pdf and the life expectancy pdf, and tells about the entire history of water molecules since recharge until discharge. Age, life expectancy, and transit\ntime pdfs provide different kind of information, and each of them can reveal\nto be more advantageous than the other one depending on the hydrogeological\ninsights to be provided. For instance, life expectancy and transit time distributions are well suited for vulnerability assessment problems (e.g. well-head\nprotection, or underground storage of toxic waste), and they allow the mapping of different regions within a recharge zone, in terms of residence time in\nthe aquifer and associated properties.\n(2) The results of Eriksson [27] have been recovered by manipulating the\nadvection-dispersion equation, extending thus the RT to systems with significant dispersive components. In the classical RT neither advection nor dispersion was considered. We have demonstrated here that the RT is still valid\nin systems with spatially varying velocity fields and non-negligible dispersive/diffusive effects. The RT is a simple one-dimensional formulation, time\nbeing the only dependent variable. The outlet transit time distribution is derived from the internal age distribution, and therefore has a much more refined\nresolution. In so doing, mixing of converging flow patterns near the outlet is ignored, and the maximum transit time is never smaller than the maximum age\nin the reservoir. The RT formulation also applies to the internal distribution\nof life expectancy, and can be used to evaluate recharge zones life expectancy\npdfs. It has also been shown that the RT can be expressed in a more compact form, which relates the outlet transit time distribution to its internal\ncounterpart, the internal distribution of transit times from inlet to outlet.\n(3) From the reservoir characteristic distributions, fundamental additional\ntransient information on water volumes and water fluxes can be gained. From\nthe outlet transit time cdf, specific groundwater porous volumes can directly\nbe identified and quantified with respect to age, life expectancy and transit time. These functions can be very useful for aquifer characterization and\nintrinsic vulnerability assessments. They can be used to easily evaluate the\nmagnitudes of young and old groundwater volumes in the aquifer.\n38\n\n\f(4) Using analytical and numerical solutions for theoretical aquifer configurations, some effects of macro-dispersion on simulated age and transit time\ndistributions could be underlined. For instance, longitudinal dispersion can\nhave a significant aging effect, while lateral dispersion rejuvenates the system\nthrough transverse mixing. Like in previous studies, it has been shown that\nthe average age resulting from dating-methods, or direct simulations, can lead\nto erroneous interpretations. It is a well-known fact that dispersion can induce a high variability of the age distribution around the average. Here we\nhave shown that not only the mixing processes could make the average age\ninsignificant, but also the geological structure and the geometry of the flow\npatterns.\n(5) The proposed methodology can equivalently be implemented in one–, two–\nand three–dimensions, and has considerable technical and numerical advantages, which may be pivotal in handling very large systems. In fact, when the\noutlet transit time pdf is defined by integrating all hydro-dispersive properties\nover the entire flow field, the level of refinement required by a stable transport\nmodel is generally sufficient. The RT ensures that the minimum and the maximum age in the reservoir are captured at the outlet, which is hardly the case\nwith traditional methods, mainly because of the mixing of converging fluxes\nnear the outlet. In the present work, the RT has been combined with ADEs,\nand the equations were solved using the LTG technique. However, no restriction appears for the use of the methodology if age and life expectancy pdfs\nare calculated by other transport models, such as random-walk simulators.\n(6) The presented models have been developed for the global aquifer system,\nregardless the number of individual inlet and outlet zones. At this stage, the\nRT has been rendered applicable to the whole system. In a subsequent article\n(this issue), we generalize the RT to any observation zone, and to systems\nwith several inlets and outlets.\n\nAcknowledgements\n\nThe authors would like to acknowledge the Swiss Research National Fund\nfor financially supporting this research under Grant no. 2100-064927. The\nauthors also thank Professor H.-J. Diersch and one anonymous reviewer for\nconstructive criticism of this manuscript.\n39\n\n\fAppendix A: Reservoir Theory for a 1-D semi-infinite domain.\n\nThe age resident pdf is found by solving the one-dimensional form of the age\npdf ADE (2a) with the Cauchy type condition vgA (0, t) − D∂gA (0, t)/∂x =\nvδ(t), and with a zero concentration gradient at a point at infinity. The corresponding age flux pdf is the flux concentration gAf , which is deduced using\nA\n. These solutions are e.g.\nthe one-dimensional form of Eq. (7), gAf = gA − Dv ∂g\n∂x\ngiven in Jury and Roth [39]. Using the dimensionless variables\nX=\n\nx\nL\n\nT=\n\nv\nt\nL\n\nPe =\n\nvL\nD\n\nwhere L is a characteristic length defining the supposed outlet position, and\nwhere Pe is the Péclet number, the age resident and flux pdfs read\n√\n√\n!\n!\nPe(X − T)2\nPe\nPe\nPe(X + T)\n√\nexp −\n−\nexp(XPe) erfc\ngA (X, T) = √\n4T\n2\nπT\n2 T\n(A.1)\n√\n!\n2\nX Pe\nPe(X − T)\ngAf (X, T) = √ 3 exp −\n(A.2)\n4T\n2 πT 2\nThe life expectancy resident and flux pdfs can be deduced from (A.1) and (A.2)\nby substitution of X by 1 − X and X by 1, respectively:\n√\n!\nPe\nPe(1 − X − T)2\ngE (X, T) = √\nexp −\n4T\nπT\n√\n!\nPe\nPe(1 − X + T)\n√\n−\nexp[(1 − X)Pe] erfc\n2\n2 T\n\n(A.3)\n\n√\n!\n(1 − X) Pe\nPe(1 − X − T)2\n=\n(A.4)\n√ 3 exp −\n4T\n2 πT 2\nThe transit time flux pdf is calculated by straight application in the time\ndomain of the convolution integral in Eq. (12):\ngEf (X, T)\n\ngTf (X, T) =\n\nZ T\n0\n\n√\n\n0\ngAf (X, T )gEf (X, T\n\nPe(1 − T)2\n− T )dT = √ 3 exp −\n4T\n2 πT 2\n0\n\n= gAf (1, T) = gEf (0, T)\n\n0\n\nPe\n\n!\n\n(A.5)\n\nThe transit time flux pdf in Eq. (A.5) could have been deduced by substitution\nof X by 1 in Eq. (A.2), or by substitution of X by 0 in Eq. (A.4). The transit\ntime resident pdf is found by convoluting (A.1) and (A.3) in the Laplace\n40\n\n\fdomain:\n4\nPe\n[1 − γ]\nĝT (X, s) = ĝA (X, s)ĝE (X, s) =\n2 exp\n2\n(1 + γ)\n\n\u0013\n\n\u0012\n\n(A.6)\n\nwhere s isqthe Laplace variable, ĝ is s-transformed state of the function g, and\nwith γ = (1 + 4s/Pe). The inversion of Eq. (A.6) yields\n\ngT (X, T) = gT (T)\n!\n\nPe(1 + T)\nPe(1 + T)\n√\n= Pe 1 +\nexp(Pe) erfc\n2\n2 PeT\n!\nPe2 T\nPe(1 − T)2\n−√\nexp −\n4T\nπPeT\n\n!\n\n(A.7)\n\nwhere use has been made of the shifting theorem\nbt\n\nL\n\n−1\n\nt\ne− a\nf\n{f (as + b)} =\n,\na\na\n\u0012 \u0013\n\nand of the following Laplace transform:\n!\n(\n√ )\n√\nc\n2\n2\n−1 exp(−c s)\n√\n= (1 + bc + 2b t) exp(b t + bc) erfc √ + b t\nL\n(b + s)2\n2 t\n!\n2\n2bt\nc\n− √ exp −\n4t\nπt\nThe internal age, internal life expectancy and internal transit time pdfs are\nobtained from Eqs. (25), (27) and (29):\nZ 1\n\nZ 1\n\ngE (X, T)dX\ngA (X, T)dX =\n0\n0\n√\n√\n!\n!!\n1\nPe(T − 1)\nPe(T + 1)\n√\n√\n=\nerfc\n− exp(Pe) erfc\n2\n2 T\n2 T\n\nψ(T) =\n\nΨ(T) =\n\nZ 1\n0\n\ngT (X, T)dX = gT (T)\n\n(A.8)\n\n(A.9)\n\nIn 1-D, the reservoir theory is equivalent to the mass conservation relation\nbetween flux and resident concentrations given by Jury and Roth [39]:\n√\n!\n∂ψ(T)\n∂ Z1\nPe\nPe(1 − T)2\nφ(T) = −\ng(X, T)dX = √ 3 exp −\n=−\n∂T\n∂T 0\n4T\n2 πT 2\n= gAf (1, T) = gEf (0, T)\n\n(A.10)\n41\n\n\fThe dimensionless outlet transit time pdf is simply the age flux concentration\nat X = 1, or equivalently the life expectancy flux concentration at X = 0. The\nmean of the pdfs φ(T), ψ(T), and Ψ(T) read\nτt = μ1 [φ] = 1\n\nτi = μ1 [ψ] =\n\n1 1\n+\n2 Pe\n\nτit = μ1 [Ψ] = 1+\n\n2\n= 2τi (A.11)\nPe\n\nand the spreading of these pdfs is measured by their variance:\nσ 2 [φ] =\n\n2\nPe\n\nσ 2 [ψ] =\n\n(Pe+6)2\n12Pe2\n\nσ 2 [Ψ] =\n\n2Pe+6\nPe2\n\n(A.12)\n\nAppendix B: Reservoir Theory in a single flow system.\n\nConsider the crown-shaped aquifer geometry in Fig. 7. Since the flow lines\nremain parallel to each other in the entire domain, we assume a 1-D transport\nprocess at each point x = θr on the flow line coordinate. We follow the same\nprocedure than in Appendix A, given that the porous volume is M0 = φπ(R2 −\nr02 )/2, the steady flow rate F0 = K∆H ln(R/r0 )/π, the dispersion coefficient\nD(r) = αL v(r), and the pore velocity v(r) = q(r)/φ = K∆H/φπr. The age\nresident and flux pdfs are deduced from Eqs. (A.1) and (A.2) by substituting x\nby θr, and the life expectancy resident and flux pdfs are deduced by replacing\nx by (π − θ)r. The transit time flux pdf is finally obtained by replacing x by\nπr in Eq. (A.2). The average age, life expectancy and transit time are given\nby the first moment of the corresponding flux pdfs:\nθφπr2\nK∆H\n\n(B.1)\n\n(π − θ)φπr2\nK∆H\n\n(B.2)\n\nhAi(θ, r) =\nhEi(θ, r) =\n\nφπ 2 r2\n(B.3)\nK∆H\nSince on the outlet line (θ = π) velocity points in the direction of the outward\nunit vector, the discharge zone transit time pdf φ(t) can be evaluated by\naveraging the age flux pdfs on the outlet line, or equivalently by averaging the\nlife expectancy flux pdfs on the inlet line (θ = 0). The internal age (or life\nexpectancy) pdf ψ(t), and the internal transit time pdf Ψ(t) are calculated\nfollowing the domain integration in Eqs. (25), (27) and (29), by integrating\nbetween the inner radius r0 and the outer radius R, and by integrating between\n0 and π (see Fig. 7). The average transit time τt equals the turnover time τ0\n(see Eq. (45)):\nM0\nφπ 2 (R2 − r02 )\nτt = τ0 =\n=\n(B.4)\nF0\n2K∆H ln(R/r0 )\nhT i(r) = hAi(θ, r) + hEi(θ, r) =\n\n42\n\n\fThe average internal age (or life expectancy) τi and internal transit time τit =\n2τi vary linearly with αL :\nτi = μ1 [ψ] =\n\nφπ\n[8(R3 − r03 )αL + 3π(R4 − r04 )]\n12K∆H(R2 − r02 )\n\n(B.5)\n\nThe variance of φ(t) can then be deduced from Eqs. (B.4) and (B.5) by enforcing Eq. (46).\n\nReferences\n\n[1] Amin I. E., Campana M. E. A general lumped parameter model for the\ninterpretation of tracer data and transit time calculation in hydrologic systems.\nJ Hydrol 1996;179:1-21.\n[2] Arnold L. Stochastic Differential Equations: Theory and Applications. New\nYork: John Wiley, 1974.\n[3] Bear J. Dynamics of Fluids in Porous Media. New York: Elsevier, 1972.\n[4] Bear J., Verruitj A. Modeling Groundwater Flow and Pollution. Boston: D.\nReidel, 1987.\n[5] Benjamin J. R., Cornell C. A. Probability, Statistics, and Decision for Civil\nEngineers. New York: McGraw–Hill Book Co.; 1970.\n[6] Boehlke J. K., Denver J. M. Combined use of groundwater dating, chemical,\nand isotopic analysis to resolve the history and fate of nitrate contamination in\ntwo agricultural watersheds, Atlantic Coastal Plain, Maryland. Water Resour\nRes 1996;31(9):2319-2339.\n[7] Bolin B., Rodhe H. A note on the concept of age distribution and transit time\nin natural reservoirs. Tellus XXV 1973;1:58-62.\n[8] Busenberg E., Plummer L. N. Use of chlorofluoromethanes (CCL3F and\nCCL2F2) as hydrologic tracers and age-dating tools; The alluvium and terrace\nsystem of central Oklahoma. Water Resour Res 1992;28(9):2257-2283.\n[9] Campana M. E., Simpson E. Groundwater residence times and recharge rates\nusing a discrete-state compartment model and 14 C data. J Hydrol 1984;72:171185.\n[10] Campana M. E. Generation of Ground-Water Age Distributions. Ground Water\n1987;25(1):51-58.\n[11] Cook P. G., Solomon D. K. Recent advances in dating young groundwater:\nchlorofluorocarbons, 3 H/3 He and 85 Kr. J Hydrol 1997;191:245–265.\n[12] Cordes C., Kinzelbach W. Continuous groundwater velocity fields and path lines\nin linear, bilinear, and trilinear finite elements. Water Resour Res 1992;28:29032911.\n\n43\n\n\f[13] Cornaton F. Deterministic models of groundwater age, life expectancy and\ntransit time distributions in advective–dispersive systems. Ph.D. thesis,\nUniversity of Neuchâtel, Switzerland, 2003.\n[14] Cornaton F., Perrochet P., Diersch H.-J. G. A finite element formulation of the\noutlet gradient boundary condition for convective–diffusive transport problems.\nInt J Numer Meth Engng 2004;61:2716-2732.\n[15] Crump K. S. Numerical Inversion of Laplace Transforms Using Fourier Series\nApproximation. J Ass Comp Mech 1976;23(1):89-96.\n[16] Dagan G. Stochastic modelling of groundwater flow by unconditional\nand conditional probabilities, 2, The solute transport. Water Resour Res\n1982;18(4):835-848.\n[17] Dagan G. Solute transport in heterogeneous porous formations. J Fluid Mech\n1984;145:151-177.\n[18] Dagan G. Theory of solute transport by groundwater. Ann Rev Fluid Mech\n1987;19:183-215.\n[19] Dagan G. Flow and Transport in Porous Formations. Berlin, Heidelberg,\nGermany:Springer, 1989.\n[20] Dagan G., Nguyen V. A comparison of travel time and concentration approaches\nto modelling transport by groundwater. J Contam Hydrol 1989;4:79-91.\n[21] Danckwerts P. V. Continuous flow systems: distribution of residence times.\nChemical engineering science 1953;2(1):93-102.\n[22] Davis S. N., Bentley H. W. Dating groundwater, a short review, In Nuclear\nand Chemical Dating Techniques:Lloyd Curie, Am. Chem. Soc. Symp. Ser.\n1982;176:187-222.\n[23] Diersch H.-J. G. About the difference between the convective and the divergence\nform of the transport equation. FEFLOW Software White Papers Vol.I, 1998,\nWASY GmbH Berlin.\n[24] De Hoog F. R., Knight J. H., Stokes A. N. An improved method for numerical\ninversion of Laplace transforms. SIAM J Sci Stat Comput 1982;3:357-366.\n[25] Dunkle S. A., Plummer L. N., Busenberg E., Phillips P. J., Denver J. M.,\nHamilton P. A., Michel R. L., Coplen T. B. Chlorofluorocarbons (CCl3F and\nClCl2F2) as dating tools and hydrologic tracers in shallow groundwater of the\nDelmarva Peninsula, Atlantic Coastal Plain, United States. Water Resour Res\n1993;29:3837–3860.\n[26] Eriksson E. The possible use of Tritium for estimating groundwater storage.\nTellus 1958;10:472–478.\n[27] Eriksson E. Compartment models and reservoir theory. Annual Review of\nEcology and Systematics 1971;2:67-84.\n\n44\n\n\f[28] Etcheverry D., Perrochet P. Reservoir theory, groundwater transit time\ndistributions and lumped parameter models. IAEA–SM–361/44, Vienna, 1999.\n[29] Etcheverry D., Perrochet P. Direct simulation of groundwater transit time\ndistributions using the reservoir theory. Hydrogeology Journal 2000;8:200-208.\n[30] Etcheverry D. Une approche déterministe des distributions des temps de transit\nde l'eau souterraine par la théorie des réservoirs. Ph.D. thesis, University of\nNeuchâtel, Switzerland, 2001.\n[31] Frind E. Solution of the Advection-Dispersion Equation with Free Exit\nBoundary. Numer Meth Partial Diff Eqs 1988;4:301–313.\n[32] Garabedian P. R. Partial Differential Equations. New York: John Wiley, 1964.\n[33] Gardiner C. W. Handbook of Stochastic Methods for Physics, Chemistry and\nNatural Sciences. Berlin: Springer, 1983.\n[34] Gelhar L. W., Axness C. L. Three-dimensional stochastic analysis of macro\ndispersion in aquifers. Water Resour Res 1983;19(1):161-180.\n[35] Goode D. J. Direct simulation of groundwater age. Water Resour Res\n1996;32:289-296.\n[36] Haitjema H. M. On the residence time\ngroundwatersheds. J Hydrol 1995;172:127-146.\n\ndistributions\n\nin\n\nidealized\n\n[37] Harvey C. F., Gorelick S. M. Temporal moment generating equations: Modeling\ntransport and mass transfer in heterogeneous aquifers. Water Resour Res\n1995;31:1895-1912.\n[38] Jury W. A. Simulation of Solute transport Using a Transfer Function Model.\nWater Resour Res 1982;18(2):363-368.\n[39] Jury W. A., Roth K. Transfer Functions and Solute Transport Through Soil:\nTheory and Applications. Basel:Birkhauser Publ., 1990.\n[40] Kolmogorov A. N. Über die analytischen Methoden\nWahrscheilichkeitsrechnung. Math Anal 1931;104:415–458.\n\nin\n\nder\n\n[41] Kreft A., Zuber A. On the physical meaning of the dispersion equation and\nits solutions for different initial and boundary conditions. Chem Eng Sci\n1978;33:1471-1480.\n[42] Kreft A., Zuber A. Comments on \"Flux-Averaged and Volume-Averaged\nConcentrations in Continuum Approaches to Solute Transport\" by J. C. Parker\nand M. Th. van Genuchten. Water Resour Res 1986;22(7):1157-1158.\n[43] LaBolle E. M., Quastel J., Fogg G. E. Diffusion theory for transport in porous\nmedia: Transition-probability densities of diffusion processes corresponding to\nadvection–dispersion equations. Water Resour Res 1998;34(7):1685-1693.\n[44] Luther K. H., Haitjema H. M. Numerical experiments on the residence time\ndistributions of heterogeneous groundwatersheds. J Hydrol 1998;207:1-17.\n\n45\n\n\f[45] Maloszewski P., Zuber A. Determining the turnover time of groundwater\nsystems with the aid of environmental tracers, 1, Models and their applicability.\nJ Hydrol 1982;57:207-231.\n[46] Maloszewski P., Zuber A. Influence of matrix diffusion and exchange reactions\non radiocarbon ages in fissured carbonate aquifers. Water Resour Res\n1991;27:1937-1945.\n[47] Maloszewski P., Zuber A. Principles and practice of calibration and validation\nof mathematical models for the interpretation of environmental tracer data in\naquifers. Adv Water Res 1993;16:173-190.\n[48] Nauman E. B., Buffham B. A. Mixing in Continuous Flow Systems. New\nYork:John Wiley, 1983.\n[49] Neumann S. P., Winter C. L., Newman C. M. Stochastic theory of field-scale\nFickian dispersion in anisotropic porous media. Water Resour Res 1987;23:453466.\n[50] Neupauer R., Wilson J. L. Adjoint method for obtaining backward-intime location and travel time probabilities of a conservative groundwater\ncontaminant. Water Resour Res 1999;35(11):3389-3398.\n[51] Neupauer R., Wilson J. L. Adjoint-derived location and travel time probabilities\nfor a multidimensional groundwater system. Water Resour Res 2001;37(6):16571668.\n[52] Neupauer R., Wilson J. L. Backward probabilistic model of groundwater\ncontamination in non-uniform and transient flow. Adv Water Res 2002;25:733746.\n[53] Parker J. C., van Genuchten M. Th. Flux-averaged and volume-averaged\nconcentrations in continuum approaches to solute transport. Water Resour Res\n1984;20(7):866-872.\n[54] Parker J. C., van Genuchten M. Th. Reply. Water Resour Res 1986;22(7):11591160.\n[55] Plummer L. N., Michel R. L., Thurman E. M., Glynn P. D. Environmental\ntracers for age dating young ground water. In Regional ground-water quality\n1993, New York:Alley W. M., Van Nostrand Reinhold, 255–294.\n[56] Reilly T. E., Plummer L. N., Phillips P. J., Busenberg E. The use of simulation\nand multiple environmental tracers to quantify groundwater flow in a shallow\naquifer. Water Resour Res 1994;30:421-433.\n[57] Richter J., Szymezak P., Abraham T., Jordan H. Use of combination of lumped\nparameter models to interpret groundwater isotopic data. J Contam Hydrol\n1993;14(1):1-13.\n[58] Robertson W. D., Cherry J. A. Tritium as an indicator of recharge and\ndispersion in a groundwater system in Central Ontario. Water Resour Res\n1989;25:1097-1109.\n\n46\n\n\f[59] Rubin Y. Applied Stochastic Hydrology. New York: Oxford University Press;\n2003.\n[60] Shapiro A. M., Cvetkovic V. D. Stochastic analysis of solute arrival time in\nheterogeneous porous media. Water Resour Res 1988;24(10):1711-1718.\n[61] Saad Y., Schultz M. GMRES: A generalized minimal residual algorithm for\nsolving nonsymmetric linear systems. SIAM J Sci Statist Comput 1986;7:856–\n869.\n[62] Saad Y. ILUT: A dual threshold incomplete ILU factorization. Linear Algebra\nAppl 1994;1:387-402.\n[63] Solomon D. K., Poreda R. J., Schiff S. L., Cherry J. A. Tritium and Helium 3 as\ngroundwater-age tracers in the Borden aquifer. Water Resour Res 1992;28:741–\n755.\n[64] Spalding D. B. A note on mean residence-times in steady flows of arbitrary\ncomplexity. Chem Eng Sci 1958;9:74-77.\n[65] Sposito G., Barry D. A. On the Dagan model of solute transport in groundwater:\nFoundational aspects. Water Resour Res 1987;23(10):1867-1875.\n[66] Sudicky E. A., Frind E. Carbon 14 dating of groundwater in confined aquifers:\nImplication of aquitard diffusion. Water Resour Res 1981;17:1060-1064.\n[67] Sudicky E. A. A natural–gradient experiment on solute transport in a sand\naquifer: spatial variability of hydraulic conductivity and its role in the dispersion\nprocess. Water Resour Res 1986;22:2069-2082.\n[68] Sudicky E. A. The Laplace transform Galerkin technique: A time-continuous\nfinite element theory and application to mass transport in groundwater. Water\nResour Res 1989;25(8):1833-1846.\n[69] Uffink G. J. M. Application of the Kolmogorovs backward equation in random\nwalk simulation of groundwater contaminant transport. In Contaminant\nTransport in Groundwater. Balkema, Rotterdam:H. E. Kobus and Kinzelbach,\n1989.\n[70] van der Vorst H. A. Bi-CGSTAB: A fast and smoothly converging variant of\nBi-CG for the solution of non-symmetric linear systems. SIAM J Sci Statist\nComput 1992;12:631–644.\n[71] Varni M., Carrera J. Simulation of groundwater age distributions. Water Resour\nRes 1998;34(12):3271-3281.\n[72] Weissmann G. S., Zhang Y., LaBolle E., Fogg G. E. Dispersion of\ngroundwater age in an alluvial aquifer system. Water Resour Res\n2002;38(10):doi:10.1029/2001WR000907.\n[73] Wilson J. L., Liu J. Field Validation of the Backward-in-Time Advection\nDispersion Theory. In Proceedings of the 1996 HSRC/WERC Joint Conference\non the Environment, Great Plains-Rocky Mountain Hazard. Substance Cent.,\nManhattan, Kansas, 1997.\n\n47\n\n\f[74] Zuber A. Mathematical models for the interpretation of environmental\nradioisotopes in groundwater systems. In Handbook of Environmental Isotope\nGeochemistry 2:Fritz P. and Fontes J. -Ch, 1986.\n\n48\n\n\f"}