{"id": "http://arxiv.org/abs/1010.2226v3", "guidislink": true, "updated": "2012-03-12T21:24:35Z", "updated_parsed": [2012, 3, 12, 21, 24, 35, 0, 72, 0], "published": "2010-10-11T20:33:17Z", "published_parsed": [2010, 10, 11, 20, 33, 17, 0, 284, 0], "title": "ElectroWeak Precision Observables at One-Loop in Higgsless models", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1010.1002%2C1010.0313%2C1010.4903%2C1010.5705%2C1010.3832%2C1010.0203%2C1010.3159%2C1010.3489%2C1010.2044%2C1010.3592%2C1010.3081%2C1010.0791%2C1010.2470%2C1010.4106%2C1010.3079%2C1010.1884%2C1010.0338%2C1010.3487%2C1010.5642%2C1010.5222%2C1010.5981%2C1010.3252%2C1010.1780%2C1010.1736%2C1010.2849%2C1010.1137%2C1010.5929%2C1010.4015%2C1010.1646%2C1010.2672%2C1010.5069%2C1010.5937%2C1010.0354%2C1010.5545%2C1010.4131%2C1010.0974%2C1010.4169%2C1010.2466%2C1010.5463%2C1010.4024%2C1010.4217%2C1010.0123%2C1010.5424%2C1010.3613%2C1010.4508%2C1010.1860%2C1010.1998%2C1010.0837%2C1010.1334%2C1010.3213%2C1010.5073%2C1010.1529%2C1010.2733%2C1010.0379%2C1010.2289%2C1010.2272%2C1010.5695%2C1010.0230%2C1010.5048%2C1010.4801%2C1010.5178%2C1010.3867%2C1010.1664%2C1010.2898%2C1010.0452%2C1010.4400%2C1010.4289%2C1010.2519%2C1010.4845%2C1010.2296%2C1010.2553%2C1010.2674%2C1010.3191%2C1010.1000%2C1010.3341%2C1010.4791%2C1010.0800%2C1010.5930%2C1010.3352%2C1010.1008%2C1010.2226%2C1010.4848%2C1010.3143%2C1010.0851%2C1010.0421%2C1010.0699%2C1010.4778%2C1010.3875%2C1010.3106%2C1010.0246%2C1010.1503%2C1010.3048%2C1010.0001%2C1010.0400%2C1010.1672%2C1010.4658%2C1010.1685%2C1010.4961%2C1010.3234%2C1010.6214%2C1010.4026&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "ElectroWeak Precision Observables at One-Loop in Higgsless models"}, "summary": "We study the viability of generic Higgsless models at low energies when\ncompliance with EWPO and unitarity constraints up to the TeV scale are imposed.\nOur analysis shows that consistency with S and T can be achieved at the\none-loop level even with a single light vector state, m_V <= 500 GeV. However,\nthis scenario turns out to be strongly disfavored when direct resonance\nsearches at the Tevatron are also taken into account. We show that a fully\nconsistent picture can be obtained if an axial state is introduced.\nInterestingly, m_V is still predicted to be light (below 1 TeV) while typical\nvalues of m_A span over the window 1.2 m_V <= m_A <= 1.4 m_V. Our results for\nthe vector channel are rather robust and well within the reach of present-day\ncolliders, while the axial channel is more loosely constrained.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1010.1002%2C1010.0313%2C1010.4903%2C1010.5705%2C1010.3832%2C1010.0203%2C1010.3159%2C1010.3489%2C1010.2044%2C1010.3592%2C1010.3081%2C1010.0791%2C1010.2470%2C1010.4106%2C1010.3079%2C1010.1884%2C1010.0338%2C1010.3487%2C1010.5642%2C1010.5222%2C1010.5981%2C1010.3252%2C1010.1780%2C1010.1736%2C1010.2849%2C1010.1137%2C1010.5929%2C1010.4015%2C1010.1646%2C1010.2672%2C1010.5069%2C1010.5937%2C1010.0354%2C1010.5545%2C1010.4131%2C1010.0974%2C1010.4169%2C1010.2466%2C1010.5463%2C1010.4024%2C1010.4217%2C1010.0123%2C1010.5424%2C1010.3613%2C1010.4508%2C1010.1860%2C1010.1998%2C1010.0837%2C1010.1334%2C1010.3213%2C1010.5073%2C1010.1529%2C1010.2733%2C1010.0379%2C1010.2289%2C1010.2272%2C1010.5695%2C1010.0230%2C1010.5048%2C1010.4801%2C1010.5178%2C1010.3867%2C1010.1664%2C1010.2898%2C1010.0452%2C1010.4400%2C1010.4289%2C1010.2519%2C1010.4845%2C1010.2296%2C1010.2553%2C1010.2674%2C1010.3191%2C1010.1000%2C1010.3341%2C1010.4791%2C1010.0800%2C1010.5930%2C1010.3352%2C1010.1008%2C1010.2226%2C1010.4848%2C1010.3143%2C1010.0851%2C1010.0421%2C1010.0699%2C1010.4778%2C1010.3875%2C1010.3106%2C1010.0246%2C1010.1503%2C1010.3048%2C1010.0001%2C1010.0400%2C1010.1672%2C1010.4658%2C1010.1685%2C1010.4961%2C1010.3234%2C1010.6214%2C1010.4026&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study the viability of generic Higgsless models at low energies when\ncompliance with EWPO and unitarity constraints up to the TeV scale are imposed.\nOur analysis shows that consistency with S and T can be achieved at the\none-loop level even with a single light vector state, m_V <= 500 GeV. However,\nthis scenario turns out to be strongly disfavored when direct resonance\nsearches at the Tevatron are also taken into account. We show that a fully\nconsistent picture can be obtained if an axial state is introduced.\nInterestingly, m_V is still predicted to be light (below 1 TeV) while typical\nvalues of m_A span over the window 1.2 m_V <= m_A <= 1.4 m_V. Our results for\nthe vector channel are rather robust and well within the reach of present-day\ncolliders, while the axial channel is more loosely constrained."}, "authors": ["Oscar Cata", "Jernej F. Kamenik"], "author_detail": {"name": "Jernej F. Kamenik"}, "author": "Jernej F. Kamenik", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.83.053010", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1010.2226v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1010.2226v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "16 pages, 13 figures, error corrected in Eq. (17), conclusions\n  unchanged", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1010.2226v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1010.2226v3", "journal_reference": "Phys.Rev.D83:053010,2011", "doi": "10.1103/PhysRevD.83.053010", "fulltext": "ElectroWeak Precision Observables at One-Loop in\nHiggsless models\nOscar Catàa and Jernej F. Kamenikb\na\n\narXiv:1010.2226v3 [hep-ph] 12 Mar 2012\n\nLudwig-Maximilians-Universität München, Fakultät für Physik,\nArnold Sommerfeld Center for Theoretical Physics, D–80333 München, Germany\nb\nJ. Stefan Institute, Jamova 39, P.O. Box 3000, 1001 Ljubljana, Slovenia\n\nAbstract\nWe study the viability of generic Higgsless models at low energies when compliance\nwith EWPO and unitarity constraints up to the TeV scale are imposed. Our analysis\nshows that consistency with S and T can be achieved at the one-loop level even with\n< 500 GeV. However, this scenario turns out to be\na single light vector state, mV ∼\nstrongly disfavored when direct resonance searches at the Tevatron are also taken into\naccount. We show that a fully consistent picture can be obtained if an axial state is\nintroduced. Interestingly, mV is still predicted to be light (below 1 TeV) while typical\nvalues of mA span over the window 1.2 mV ≤ mA ≤ 1.4 mV . Our results for the vector\nchannel are rather robust and well within the reach of present-day colliders, while the\naxial channel is more loosely constrained.\n\n1\n\nIntroduction\n\nUp to the present date, the physical mechanism underlying electroweak symmetry breaking\n(EWSB) still remains unknown. Its simplest description in terms of a fundamental standard\nmodel (SM) scalar Higgs doublet is certainly appealing but not fully satisfactory from a theoretical standpoint. A single Higgs doublet makes the electroweak interactions renormalizable and,\nif light enough (mH ∼ 100 GeV), all the electroweak precision tests (EWPT) can be successfully\naccounted for [1] (see Fig. 1). However, mH is unstable under quantum corrections: at short distances it diverges quadratically and thus makes the SM description problematic. One is therefore\nled to consider alternative mechanisms of EWSB, either with Higgs bosons (e.g. supersymmetry)\nor without them (Higgsless theories).\nIn Higgsless models the Higgs boson is often replaced by one or more spin-1 bosons. The theory\nis then no longer renormalizable, but perturbative unitarity\ncan still be preserved up to a few TeV,\n√\none order of magnitude above the Fermi scale, v = ( 2GF )−1/2 ' 246 GeV, so that meaningful\ncomparisons with current experiments can be made. The ultraviolet completion of the theory will\ndepend on the underlying Higgsless model, be it technicolor, deconstructed models with hiddengauge symmetry or holographic realizations, but at low energies they all should be described in\n\n1\n\n\fU=0, mt =173GeV\n0.4\n\n99%\n95%\n68%\n\n0.2\n\n120\n\nT\n\n0.0\n\n250\n-0.2\n\n500\n1000\n\n-0.4\n\n-0.6\n-0.3\n\n2000\n\n-0.2\n\n-0.1\n\n0.0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\nS\n\nFigure 1:\n\nIR logarithmic contributions to S and T for a cut-off scale Λ in the range 115 − 3000 GeV. The\nexperimentally allowed region and the SM reference point at which all ST U parameters vanish is chosen as in\nRef. [1] (in particular with mt = 175GeV and mH = 150GeV). The constraint U = 0 is always imposed. The axes\nare scaled to S = 4 sin2 θW Ŝ/α ≈ 119Ŝ and T = T̂ /α ≈ 129T̂ .\n\nterms of a small subset of effective operators with its associated couplings. Obviously, depending\non the specific Higgsless model one considers there will be different relations amongst the couplings.\nIn this paper we will instead pursue a more phenomenological approach, following [4], and consider\na generic Higgsless model whose parameters will be constrained only by unitarity and electroweak\nprecision observables (S and T ) up to the one-loop level. The main advantage of this approach is\nthat one can test the viability of Higgsless models based on spin-1 bosons as model-independently\nas possible (and potentially rule out some of the existing models). Additionally, one can extract\ninformation on the spin-1 bosons which can then be tested at colliders.\nOblique corrections to electroweak precision observables (EWPO) can be conveniently expressed in terms of the SM gauge boson vacuum polarization correlators, defined as\n1\n1\nμν 2\n2\n3\n3 μν 2\n+ μν\n2\n−\nLvac−pol = − Wμ3 Πμν\n33 (q )Wν − Bμ Π00 (q )Bν − Wμ Π30 (q )Bν − Wμ ΠW W (q )Wν ,\n2\n2\nwhere the (transverse) correlators can be decomposed as\n\u0012 μ ν\n\u0013\nq q\nμν 2\nμν\nΠij (q ) =\n−g\nΠij (q 2 ) .\n2\nq\nOne defines the Ŝ ≡ αS/4 sin2 θW parameter as the oblique contribution\n\u0012 \u0013\ng\nŜ =\nΠ030 (0)\ng0\n2\n\n(1)\n\n(2)\n\n(3)\n\n\fand the T̂ ≡ αT parameter as\nT̂ =\n\nΠ33 (0) − ΠW W (0)\n,\nm2W\n\n(4)\n\ni.e., proportional to ρ − 1 and therefore a measure of custodial symmetry breaking.\nIn the Standard Model, S and T receive contributions only at one-loop level (shown in Fig. 1).\nTheir expressions are, in terms of the effective cut-off scale Λ,\ng2\nΛ2\n,\nlog\n192π 2\nm2W\n3α\nΛ2\n= −\nlog\n.\n16πc2W\nm2W\n\n∆ŜIR =\n\n(5a)\n\n∆T̂IR\n\n(5b)\n\nResidual finite terms are fixed by matching ∆Ŝ and ∆T̂ to the SM reference point chosen in\nRef. [1] (with mt = 175GeV and mH = 150GeV), correcting for the most recent top mass value\nmt = 172GeV and identifying the leading mH logarithmic dependence with that of Λ.\nThe starting point of the EWPO analysis in Higgsless models is the correlation between S and\nT . Fixing the cutoff Λ at the TeV scale, the main challenge of Higgsless models is to compensate\nthe large negative infrared effect in T . However, when one includes spin-1 resonances, they also\ninduce a tree level contribution to S, which is often assumed to be positive but is generically\nrather large in magnitude.\nIn [4], an analysis was performed using an effective low energy description of resonance dynamics including the full T at one loop. It was found that quadratically ultraviolet sensitive one-loop\ncontributions of moderately light resonances can compensate the logarithmically divergent infrared\neffect in Eq. (5b) while giving a moderately large S, still within experimental bounds.\nHowever, the analysis of Ref. [4] only considers resonance contributions to S at tree level.\nSince there is no reason to expect small one-loop contributions to S, conclusions on the resonance\nspectrum and cut-off interplay in EWPT based on a correlated treatment of S and T may be\nsignificantly modified once the one-loop corrections to S are included. Especially so because\nloop corrections presumably induce UV sensitivity to S as well, skewing such correlations in a\nsubstantial way. Thus, a consistent correlated treatment of S and T should include quantum\ncorrections on both of them. In the present study we extend the EWPO analysis of Ref. [4] by\nincluding the full one-loop resonance contribution to S.\nThis paper is organized as follows: in Section 2 we present the Lagrangian for the Higgsless\nmodel. The one-loop computation of S is addressed in Section 3. Section 4 is devoted to studying\nthe modification of EWPT constraints on the parameter space of low lying resonances in Higgsless\nmodels and the interplay between UV sensitivity and the low lying resonance spectrum. Finally,\nsome implications for direct resonance searches at colliders are discussed.\n\n2\n\nThe Lagrangian\n\nOur starting point will be a theory symmetric under G = SU (2)L ×SU (2)R , spontaneously broken\ndown to the diagonal group H = SU (2)L+R . The resulting Goldstone boson fields are elements of\n\n3\n\n\fB\n\nB\n\nW\n\nπ\n\nπ\n\nπ\n\nFigure 2: Diagrams contributing to the infra-red contribution to S (first diagram on the left hand side) and T .\nthe coset G/H and transform as\nu → gR uh† = hugL† ,\n\nU → gR U gL† ,\n\n(6)\n\nwhere h = h(u, gL , gR ) is an element of SU (2)L+R . It is customary to choose the following nonlinear realization\n\" 0\n#\nπ\n+\n√\nπ\n1\n1\n2\ni2π̂/v\na a\n2\nU =u =e\n,\nπ̂ = T π = √\n,\nT a = σa .\nπ0\n−\n√\n2\n2 π − 2\nThe lowest-order Lagrangian one can build is the usual chiral Lagrangian\nL(2)\nχ (U ) =\n\nv2\nhDμ U (Dμ U )† i ,\n4\n\n(7)\n\nwhere the covariant derivative contains the W and B fields:\nDμ U = ∂μ U − iB̂μ U + iU Ŵμ ,\n\nŴμ = gT a Wμa ,\n\nB̂μ = g 0 T 3 Bμ ,\n\n(8)\n\nand hi denotes the trace of the 2 × 2 matrices. Since we want to avoid tree level contributions to\nT , explicit custodial symmetry breaking terms in Eq. (7) are omitted.\nIt is worth emphasizing that Eq. (7) is universal, i.e., it does not depend on additional (heavy)\ndegrees of freedom. Therefore, it provides by itself a mechanism for EWSB which is perfectly\nconsistent: the Goldstone bosons become the longitudinal components of the W + , W − , Z gauge\nbosons, thereby providing (tree level) masses proportional to v with the exact same expressions\nas in the SM. The difference with the Higgs mechanism arises at the one-loop level – at the NLO\nin the chiral expansion. We have already emphasized that Higgsless models are in general nonrenormalizable: Eq. (7) is only the first term in a chiral expansion in powers of momenta while\nNLO terms in the chiral expansion capture ultraviolet effects (typically heavy resonances) in the\nmost general way.\nIn Higgsless models one often assumes that the new degrees of freedom are spin-1 resonances.\nWe will consider the presence of two vector states with opposite parity, Aμν [1++ ] and V μν [1−− ],\nboth belonging to the adjoint representation of SU (2)L+R :\nRμν → hRμν h† ,\n\nRμν = Aμν , V μν .\n\n4\n\n(9)\n\n\fFor phenomenological purposes we will assume v < mV,A < Λ ' 4πv. In other words, we consider\ntwo relatively light resonances and make the natural cutoff Λ of the theory (signaling the presence\nof new heavy degrees of freedom) to coincide with the loop expansion parameter Λχ = 4πv.\nFollowing Ref. [2], we describe the heavy spin-1 states in the antisymmetric tensor representation. Unlike in the vector representation, this way one avoids an unwanted mixing between the\naxial resonance and the pion. The kinetic term in the Lagrangian has the form:\n1\n1\nLkin (Rμν ) = − h∇μ Rμν ∇σ Rσν i + m2R hRμν Rμν i ,\n2\n4\nwith the covariant derivative defined as\ni\n1h †\n∇μ R = ∂μ R + [Γμ , R],\nΓμ =\nu (∂μ − iB̂μ )u + u(∂μ − iŴμ )u† ,\n2\n\n(10)\n\nΓ†μ = −Γμ .\n\n(11)\n\nIn order to couple the heavy states to the Goldstone bosons it is convenient to define uμ =\niu† Dμ U u† = u†μ , such that uμ → huμ h† .\nThe leading order, O(p2 ), couplings of the heavy fields to Goldstone bosons and SM gauge\nfields are then parametrised in terms of 3 effective operators, defined by\n(2)\n\nL1V\n\ni\n1\n√ GV hV μν [uμ , uν ]i + √ FV hV μν (uŴ μν u† + u† B̂ μν u)i\n2 2\n2 2\n1\n+ √ FA hAμν (uŴ μν u† − u† B̂ μν u)i .\n2 2\n=\n\n(12)\n\nThe effective couplings FV,A and GV have dimensions of mass and, by naive dimensional\nanalysis, are expected to be of O(v). More quantitative constraints can be found by requiring the resonance contribution to smoothen the ultraviolet divergences generated by the leading\norder term, Eq. (7), in a set of chosen correlators, in the spirit of [3]. For instance, perturbative unitarity in WL WL → WL WL scattering √\nup to the natural cut-off scale of the model\nΛ ' 4πv ≈ 3 TeV imposes the constraint GV ' v/ 3(1 ± 0.2), mostly independent of the vector\nmass below mV < 1 TeV [4]. Furthermore, the pion vector form factor, in combination with\npositivity of√FV , GV requires FV . v 2 /GV . Combined with the unitarity constraint on GV it\ngives FV . 3v [4]. Additionally, imposing the right ultraviolet behavior of Π30 (and neglecting\nheavier resonance contributions) suggests that mA > mV and also FV2 /m2V > FA2 /m2A , which are\nalso known as the Weinberg sum rules.\nAnother constraint which is typically discussed in Higgsless models is the \"hidden-gauge relation\" FV = 2GV . This relation holds in 3- and 4-site Higgsless models [4], and more generally\nin all five-dimensional deconstructed models as long as non-renormalizable terms in the bulk are\nneglected [7]. In more general Higgsless frameworks, however, it is typically not satisfied. In the\nfollowing sections we will check whether it is consistent with EWPO.\nFinally, let us stress that the interaction Lagrangian of Eq. (12) is only the most general O(p2 )\nchiral Lagrangian linear in resonance fields. Note that since there is no power counting that\nsupresses Vμν and Aμν , operators with an arbitrary number of resonance fields have the same\nchiral counting and appear already at O(p2 ). The predictability of the approach therefore rests\non the assumption that those extra operators do not contribute significantly. We will return to\nthis issue later on.\n\n5\n\n\fV, A\n\nFigure 3: Tree level resonance contribution to S.\n\n3\n\nS and T at one loop\n\nThe tree level exchange of the heavy vectors (Fig. 3) leads to well known contribution to S (and\nalso W, Y [5]) whereas it leaves T untouched because of the protecting SU (2)L+R symmetry:\n\u0012\n\u0013\ng 2 FV2\nFA2\n∆ŜT ree =\n− 2 ,\n(13a)\n4 m2V\nmA\n∆T̂T ree = 0 .\n\n(13b)\n\nThe contribution to S can in principle be positive or negative, although as discussed in the previous\nsection, positive values are preferred to comply with the right ultraviolet behavior of Π30 . This\nleads to the well-known problem of Higgsless models with EWPT, since tree level resonance\ncontributions actually worsen the predictions due to the pure infrared effects of Eqs. (5a, 5b).\nAt one loop one has to distinguish between the long distance and the short distance contributions. The former are depicted in Fig. 2 and, since they come entirely from Eq. (7), they coincide\nwith the SM result (with the Higgs mass instead of Λ) and are given entirely by Eqs. (5a, 5b).\nOne-loop short distance contributions to T involve the diagrams with resonance exchange\nshown in Fig. 4. The calculation of loop contributions to T can be significantly simplified by\nnoticing that, up to corrections of relative order m2W /m2R\nT̂ =\n\nZ (+)\n− 1,\nZ (0)\n\n(14)\n\nwhere Z (+) , Z (0) are the wave-function renormalization constants of the charged and neutral\nGoldstone bosons for the SM gauge bosons (in the Landau gauge) [6].1\nS receives one-loop short distance contributions from the diagrams depicted in Fig. 5. In\naddition, renormalization of the resonance masses and couplings entering the tree level contribution\nto S needs to be taken into account. It is easy to verify that the masses do not get renormalized\nat this order while the corrections to the FV,A couplings, depicted in Fig. 6, amount to the shifts\n\u0012\n\u0013\nFV − GV Λ2\nFV → FV 1 +\n,\nFV\n(4πv)2\n\u0012\n\u0013\nΛ2\nFA → FA 1 +\n.\n(15)\n(4πv)2\nNotice that the corrections are purely quadratic in Λ and that no logarithmic terms are induced.\nThe presence of quadratically (ultraviolet) divergent pieces in the one-loop contributions to S and\n1\n\nContributions to U can be computed analogously. However, since resonance contributions to U are suppressed\nby v 2 /m2R with respect to T , we do not consider them in our numerical analysis. The same applies to the\ncontributions to W, X, Y with respect to S.\n\n6\n\n\fB\n\nB\nV\n\nV, A\nV\n\nV\n\nπ\nB\n\nB\n\nπ\n\nV\n\nπ\n\nFigure 4:\n\nShort distance contributions to T . The first diagram contains quadratic divergences, while the rest\nonly diverge logarithmically.\n\nπ\n\nV, A\n\nV, A\n\nV, A\n\nFigure 5: Diagrams yielding resonance contributions to S at one-loop order.\nT will play a paramount role in our results and will be discussed in short. For T they come only\nfrom the top left hand side diagram in Fig. 4, while for S in addition to the coupling corrections\nin (15), they are also contained in both diagrams in Fig. 5.\n\nπ\nπ\nV, A\n\nV, A\n\nV\n\nFigure 6: Diagrams contributing to the renormalization of FV and FA .\n\n7\n\n\fB\nV, A\n\nB\n\nA, V\n\nA, V\n\nA, V\n\nV, A\nV, A\n\nB\n\nA, V\nFigure 7: Contributions cutting off quadratic divergences to T̂ .\nThe final expressions for the short distance contributions to both S and T read\n\"\n\u0012\n\u00132 \u0012\n\u00132\n\u0012\n\u0013#\ng 2 Λ2\nFV\n2GV (FV − 2GV )\nFA\nv2\n2 v2\n∆ŜU V =\n+\n+ 2\n−\n−\n4 (4πv)2\nm2V\nmV\nmA\n3 m2V\nmA\n\u0014\u0012\n\u0013\n\u0015\ng2 1\nΛ2\n10 2\nΛ2\n2\n2\n2\n2\n+\nG\n−\nF\n−\nv\n+\n(F\n−\nv\n)\nlog\nlog\n,\nV\nA\n4 (4πv)2\n3 V\nm2V\nm2A\n\"\u0012\n\u00132 \u0012\n\u00132 #\nFA\n3πα Λ2\nFV − 2GV\n+\n∆T̂U V =\n4c2W (4πv)2\nmV\nmA\n\u0014\u0012\n\u0013\n\u0015\n2\n2\n3πα\nΛ2\nΛ2\n2\n2\n2 2GV + v\n+\n2GV + 4FV GV − FV\nlog 2 − FA log 2 ,\n2c2W (4πv)2\nv2\nmV\nmA\n\n(16)\n\n(17)\nwhere we have included the quadratic and the leading logarithmic contributions, and the expression\nfor S already contains the shift due to FV,A renormalization. We checked that our results for the\nlogarithmic contribution to Ŝ agree with those found for L10 in ChPT with explicit resonance\nfields [8].2 Regarding T̂ , we have checked that in the hidden gauge limit our result agrees with [4].3\nThe first thing to note is that the quadratic contribution to T̂ is strictly positive, while the\nnew contribution to Ŝ can in principle have either sign. In addition, the quadratic pieces are\nparametrically large, of the same order of magnitude as the tree level contributions. In principle\nit would then be desirable to find a way to cancel (or at least ameliorate) their size.\nOne possible mechanism is to impose the \"hidden gauge\" limit relations, FV → 2GV , FA → 0\nand mA → ∞, which as we noted earlier arise naturally in a wide class of Higgsless models. The\nquadratic dependence in T̂ then identically cancels and we are left only with the logarithmic piece,\n2\n\nNote that one has to correct for the fact that the result in Ref. [8] is done in SU (3)L × SU (3)R ChPT.\nWe are thankful to Axel Orgogozo and Slava Rychkov for pointing out an error in Eq. (17) in the first version\nof the paper [12].\n3\n\n8\n\n\fA, V\n\nA, V\n\nA, V\n\nV, A\n\nV, A\n\nV, A\n\nA, V\n\nA, V\n\nA, V\n\nFigure 8: Some contributions expected to regulate the quadratic divergences in Ŝ.\nwhose sign is in principle not fixed. While this feature of the hidden-gauge limit for T̂ is very\nappealing, it was already noticed in [4] that the hidden-gauge relation conflicts with EWPO. Our\ncalculation here shows that it also fails to protect Ŝ, which still scales quadratically due to the\nresonance loop in the right hand side diagram of Fig. 5. In particular, this implies that for the\nunitarity preferred values of GV and the natural cut-off scale, the one-loop contribution to Ŝ is half\nthe tree level value. From Eq. (15) it also follows that the hidden gauge limit is not necessarily\nrespected by the renormalization of model parameters.\nThe alternative is to take the quadratic divergences as a physical effect. In Ref. [4] it was\nshown that the introduction of the following new operators bilinear in the resonance fields\nhAμν [∇ρ V ρν , uμ ]i ;\n\nhV μν [∇ρ Aρν , uμ ]i ,\n\n(18)\n\ncan cancel the quadratic divergences and tame the logarithmic ones. This contribution is shown\nin Fig. 7. Therefore, if the renormalization scale happens to be due to masses lying close to Λ,\nthen the expression for T in Eqs. (16) should be a reasonable estimate.\nThe same mechanism in principle could apply for Ŝ, but the situation becomes more involved.\nFirst, we have explicitly checked that the contribution of the operators of Eq. (18) not only does\nnot cancel the quadratic divergences in Ŝ but introduces quartic ones. More operators are therefore\nneeded. For instance, we expect operators with 3 and 4 resonance fields of the form\nh[∇μ Vμν , ∇λ Vλρ ]V νρ i ;\n\nh∇μ Vμν (V ην ∇λ V λρ Vηρ + Vηρ ∇λ V λρ V ην )i ,\n\n(19)\n\nto play a significant role. In particular, their contribution to the diagrams in Fig. 8 is expected\nto compensate the divergences coming from the right-hand side diagram in Fig. 5. The list of\noperators in Eq. (19) is however far from being exhaustive. For instance, one should also include\nterms mixing axial and vector fields to compensate for the divergences generated by the operators\nin Eq. (18). In general, such additional operators will also affect T̂ .\nWhile the full renormalization analysis is clearly beyond the scope of the present paper, we want\nto point out that it is in principle feasible. Even though there is no well-defined power counting\nfor the resonance fields, if one assumes the presence of a single vector and axial resonance field,\nthe one-loop renormalization of Ŝ and T̂ and in general every EWPO can be accounted for with\noperators with up to 4 resonance fields. A reasonable strategy is then to assume that indeed there\nis a combination of operators able to regulate the quadratic (and quartic) divergences to both Ŝ\n\n9\n\n\f1.6\n\nGV\n\n3 \u0090v\n\n1.4\n\narity\nUnit\n\n1.2\n\n1.0\n\nFV 12GV , FA =0\n\n0.8\n\nFV =2GV , FA 10\nFV 12GV , FA 10\n\n0.6\n\n500\n\n1000\n\n1500\n\n2000\n\nmV @GeVD\n\nFigure 9: Combination of unitarity (precise range taken as in Ref. [4]) and EWPT constraints (at 95% C.L.)\nin the (mV , GV ) plane. See text for details.\n\nand T̂ and that the scale at which this happens is close to Λ. However, there is a potential problem\nwith such an assumption. If the renormalization scale for all diagrams is around Λ the corrections\nto FV and FA are not necessarily well behaved perturbatively. Consequently, the values for FV\nand FA coming from the fit to EWPO may be unreliable. An alternative approach would be to\nrequire that FV,A renormalization in Fig. 6 is governed by the resonance scale, while the diagrams\nof Figs. 4 and 5 still get renormalized at the cutoff scale (in order to be consistent with EWPO).\nWhile such a scenario cannot be excluded, it would make the model unnaturally baroque. In the\nfollowing section we will show that fortunately even for a single renormalization scale close to Λ,\nthe correlations between S and T tend to stabilize the values of FV and FA .\n\n4\n\nConfronting EWPT and Unitarity Constraints\n\nWe are now in the position to reconsider the interplay between the WL WL scattering unitarity\nconstraint and EWPT on the parameter space of Higgsless models at the one-loop level. We will\nstudy the impact of new contributions to Ŝ by reexamining the scenarios and conclusions reached\nin the original analysis of Ref. [4], where the resonance contributions to Ŝ were evaluated at the\ntree-level. The results are summarized in Fig. 9, where we plot the allowed regions in the GV\nversus mV plane by marginalizing over the remaining free parameters. In order to assess the\npotential consistency of more specific classes of Higgsless models with EWPO we will consider the\nfollowing scenarios (also marked in Fig. 9):\n\n10\n\n\f0.4\n\nFV ®\n\n¬\n\nm\n\nV\n\n0.2\n\nT\n\n0.0\n\n-0.2\n\n-0.4\n\n-0.6\n-0.3\n\n-0.2\n\n-0.1\n\n0.0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\nS\n\nFigure 10: Contributions to Ŝ and T̂ in scenarios with a single vector resonance below the cut-off Λ = 3 TeV.\n\n√\nThe exact unitarity constraint GV = v/ 3 is imposed. The parameters are varied over the ranges 250 GeV ≤\nmV ≤ 500 TeV and 0.64 ≤ FV /2GV ≤ 0.65.\n> Λ, i.e., a single vector resonance, not (necessarily)\n• FV 6= 2GV , FA = 0, mV < Λ, mA ∼\nfulfilling the hidden gauge relation. In addition to the IR logarithmic contributions and\nthe positive tree level contribution to Ŝ, there are also quadratically UV sensitive one-loop\ncontributions to both Ŝ and T̂ . They are strictly positive in T̂ but can be negative in Ŝ,\nthus allowing for potential cancellations between the tree level and one loop contribution.\nInterestingly, a consistent fit to both Ŝ and T̂ can be achieved for light vector masses,\nmV . 500 GeV, and reasonable values of the parameter FV . 2GV , as illustrated in Fig. 10.\nComparing with Ref. [4], one observes that the main impact of the one-loop contribution to\nŜ is to lower the allowed vector resonance mass while raising the value of FV . If one assumes\nthat the value for FV is stable under quantum corrections, then this scenario is already in\nconflict with bounds from direct resonance searches at the Tevatron [10]. This might well be\nthe case: even though the operators we are considering induce a naive O(1) loop correction\nto FV , their values extracted from the electroweak fit (with and without considering vertex\ncorrections) only differ by roughly 15%. In other words, the EWPO fit seems to point to a\nstable region of parameters.\n\n• FV = 2GV , FA 6= 0, (mV , mA ) < Λ, i.e., a vector resonance fulfilling the hidden gauge\nrelation plus an axial-vector resonance, both below the cut-off scale. An axial resonance is\ncommonly considered in Higgsless models since its contribution reduces the size of ∆Ŝ at\ntree level. At one loop it contributes with a quadratic UV sensitivity to both Ŝ and T̂ . We\nnote that while the contribution to the latter is always positive, it can be either sign for\nthe former, again opening the door for fine-tuned cancellations between FA , mA and mV .\nFigure 11 shows that a consistent fit to both Ŝ and T̂ can only be achieved for relatively\n\n11\n\n\f0.4\n\nmA \u0090mV ®\nmV ®\n\n0.2\n\nT\n\n0.0\n\n-0.2\n\n-0.4\n\n-0.6\n-0.3\n\n-0.2\n\n-0.1\n\n0.0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\nS\n\nFigure 11: Contributions to Ŝ and T̂ in the scenario with a vector resonance fulfilling FV = 2GV and an axial\n\n√\nresonance below Λ = 3 TeV. The exact unitarity constraint GV = v/ 3 is imposed together with FA = FV . The\nmasses are varied in the ranges 400 GeV ≤ mV ≤ 1 TeV, 1.25 ≤ mA /mV ≤ 1.35.\n\ndegenerate vector and axial masses below 700 GeV. We note that mA can be made heavier at\nthe expense of increasing FA . In other words, even though the one loop expression introduces\nthe new ratio v/mA , apparently it does not break the correlation between FA and mA that\none has at tree level.\n• FV 6= 2GV , FA 6= 0, (mV , mA ) < Λ, i.e., the most generic Higgsless model, containing a\nsingle light vector and axial-vector resonance below the cut-off. Due to the large parameter\nspace available, various cancellations can occur (as the ones outlined in the previous two\ncases), leading to an agreement with EWPT as well as satisfying the unitarity constraint.\nThe various parameter dependences are studied in Fig. 12. We first observe that EWPO\nand the unitarity constraint can only be reconciled for vector masses below 900 GeV, as\nshown in the upper-left plot of Fig. 12 and confirmed in Fig. 9. Secondly, the upper-right\nplot in Fig. 12 confirms that the axial and vector states should be fairly degenerate, at least\nfor natural values of FA . In the lower plot in Fig. 12 we show that for light vector and axial\nvector states, the model can accomodate the EWPO constraints with reasonable values for\nthe two coupling constants, namely FA . FV . 2GV , leading to a quite constrained and\npredictive scenario even in this more general case.\nIn summary, Fig. 9 confirms the general conclusion of Ref. [4], namely that accounting for both\nEWPT and unitarity constraints can be satisfied with at least one light (vector) resonance. However, after including the one-loop resonance contributions to Ŝ the allowed parameter ranges are\nshifted and get significantly more constrained. In particular, two important modifications appear:\n(1) the generic bound on the lightest vector resonance mass is strengthened to below 1 TeV and\n\n12\n\n\f0.4\n\n0.4\n\nmA \u0090mV =1.4\nFV,A ®\n\n0.4\n\nFV,A ®\n\n0.2\n\nmA ®\n\n0.2\n\nmV =400GeV\nmA =500GeV\nFV ®\n\n¬ FA\n\n¬m\n\nV ,A\n\n0.2\n\nmV =400GeV\n\nT\n\n0.0\n\nT\n\n0.0\n\nT\n\n0.0\n\n-0.2\n\n-0.2\n\n-0.2\n\n-0.4\n\n-0.4\n\n-0.4\n\n-0.6\n-0.3\n\n-0.2\n\n-0.1\n\n0.0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n-0.6\n-0.3\n\n-0.2\n\n-0.1\n\n0.0\n\nS\n\n0.1\n\n0.2\n\n0.3\n\nS\n\n0.4\n\n-0.6\n-0.3\n\n-0.2\n\n-0.1\n\n0.0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\nS\n\nFigure 12:\n\nContributions to Ŝ and T̂ in the scenario with a vector and an axial resonance below the cut-off\n√\nof Λ = 3 TeV. The exact unitarity constraint GV = v/ 3 is imposed. On the upper-left plot, FA = FV and\nmA /mV = 1.4 while mV and FV are varied in the ranges 500 GeV ≤ mV ≤ 1 TeV, 0.9 ≤ FV /2GV ≤ 1. On the\nupper-right plot, again FA = FV and vector mass is fixed at mV = 400 GeV. The remainig parameters are varied\nin the ranges 540 GeV ≤ mA ≤ 700 GeV, 0.8 ≤ FV /2GV ≤ 0.95 . On the lower plot, the vector and axial masses\nare fixed at mV = 400 GeV and mA = 500 GeV, while the couplings are varied in the ranges 0.9 ≤ FV /2GV ≤ 0.95\nand 0.8 ≤ FA /2GV ≤ 0.9.\n\n(2) a single vector resonance below the cut-off now requires a sizable FV coupling, something that\nis possibly in conflict with bounds from direct searches at the Tevatron.\nGenerically, in all the studied scenarios the one-loop contributions required to bring S back into\nthe experimental bounds are large and the loop expansion poorly convergent. This is especially\ntroublesome for the stability of the parameters of the model under quantum corrections. However,\nthese potentially large corrections turn out to have a very mild effect for the parameter ranges\nfitted from S and T . The reason can be found in the structure of the corrections to both S and\nT . Let us concentrate on the quadratic pieces, which are the dominant ones. Note that the sum\nof vector and axial contributions is fixed by the moderate size of ∆T̂U V . Since they are small and\nmoreover they enter ∆ŜU V roughly as a difference, the correction to S is actually driven by the\nv/mV,A pieces coming from the resonance kinetic terms. In other words, the soft breaking of the\ncustodial symmetry is constraining the couplings near the EW scale and thus indirectly protecting\nthe model parameters, in particular FV , from overly large quantum corrections.\nThe increased sensitivity to cancellations among individual contributions to EWPO, as reflected in the very constrained parameter ranges in Figs. 10, 11 and 12 warrants a brief discussion\non fine-tuning of the studied scenarios. We evaluate the naturalness of solutions in the parameter\nspace, which satisfy both unitarity and EWPO constraints in the most generic scenario outlined\nabove. We adopt the measure for fine-tuning of ref. [11] where for each parameter ai contributing\nto an observable Oj we compute\n∆i,j =\n\nai ∂Oj ({ai })\n,\nOj\n∂ai\n\n13\n\n(20)\n\n\f0.4\n\n99%\n\n>50\n\n95%\n68%\n0.2\n\nT\n\n0.0\n\n-0.2\n\n-0.4\n0\n-0.6\n-0.3\n\n-0.2\n\n-0.1\n\n0.0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\nS\n\nFigure 13: Ŝ and T̂ constraints in the generic Higgsless model with a vector and an axial resonance triplet below\nthe cut-off scale Λ = 3 TeV. The reference SM parameters are chosen as in Fig. 1. The parameter space of the\nmodel is sampled as discussed in the text. The coloring corresponds to the fine-tuning measure ∆ as defined in the\nmain text.\n\nand then define the maximum fine-tuning of a particular parameter space point as ∆ = max{∆i,j }.\nNote that ∆ = 10, 50 corresponds to a 10% , 2% fine-tuning respectively.\nWe apply ∆i,j above to\n√\nŜ and T̂ and define the relevant parameters as mV , mA /mV , GV 3/v, FV /2GV and FA /FV . We\nscan over this parameter space subject to the UV consistency constraints discussed in Section 2\nand to the unitarity constraint on GV below the cut-off Λ ∼ 3 TeV [4]. The results are shown in\nFig. 13. We observe that the fine-tuning required to be consistent with EWPO at the 68 − 95%\nconfidence level is at the order or 5 − 2%, respectively. It is also interesting to note that at\nthis level of fine-tuning the 95% confidence level region with negative Ŝ (and T̂ ) can be reached.\nHowever, this region corresponds to the one-loop contributions to Ŝ actually overcompensating\nthe tree-level contributions, signaling the breakdown of the loop expansion.\n\n5\n\nConclusions\n\nIn this paper we have computed the one-loop corrections to the S parameter in the generic Higgsless\nmodel considered in Ref. [4]. Likewise, we have assume the existence of light resonances (a vector\nand possibly an axial vector state) in the window v < mV,A < Λ ' 4πv whose dynamics are\ndescribed by a minimal set of operators. This has allowed us to consistently study the predictions\nof the model for EWPO at next-to-leading order, subject to the unitarity constraint in WL WL\nscattering.\nOur results show that the S and T parameters can be made compatible with the experimental\nvalues, but most likely a single vector resonance is not enough. While a light vector is in principle\n\n14\n\n\fallowed by EWPT and unitarity, direct searches by CDF and D0 require very small values of\nthe coupling FV , something that the fits do not favor. The addition of an axial resonance thus\nseems to be needed. The picture that eventually emerges turns out to be highly predictive, with\nthe vector mass constrained to the window 500 GeV. mV . 1000 GeV, and the axial one only\nslightly heavier, 1.2 m√\nV ≤ mA ≤ 1.4 mV . The values for the remaining parameters satisfy\nFA . FV . 2GV ∼ 2v/ 3.\nWhile this is the order of magnitude one would naturally expect for the parameters, one cannot\navoid a considerable amount of fine-tuning. The reason, which lies at the heart of Higgsless models,\nis that the tree level contribution to the S parameter is positive and rather large, and therefore a\nlarge and negative one-loop contribution is needed to pull it back to the experimentally allowed\nregion. In addition, the tree-level contributions proportional to FV,A /mV,A develop quadratic (but\nnot logarithmic) dependences on the cutoff Λ at the one-loop order. In our case, the one-loop\ncontributions scale parametrically as Λ2 /(4πm)2 , m < 1 TeV being a typical resonance mass and\nΛ ∼ 3 TeV being the cut-off. We assume the cutoff scale to be close to a physical scale (typically\nthe mass of a heavier vector), such that the estimate of the quadratic corrections is reasonable.\nIn Ref. [4] the simple addition of two extra operators was shown to do the job quite naturally, at\nleast for T . In this paper we have seen that the dynamical mechanism has to be more complicated\nto also account for S: the operators proposed in [4] not only do not cure the UV sensitivity, but\nthey introduce additional quartic divergences. While they can in general be tamed, the dynamical\nmechanism loses its main appeal, simplicity: a potentially large number of additional operators\nmight be required. We have however assumed that such mechanism is at work and that the scale\nΛ is representative for higher mass states, not explicitly included as dynamical fields in the model.\nIt turns out that the soft breaking of custodial symmetry and the moderate corrections to T ,\nas preferred by the EWPO fit, actually help to stabilize the parameters of the model against\npotentially large quantum corrections, leading to a well defined and predictive scenario.\n\nAcknowledgments\nWe thank Gino Isidori for invaluable discussions and initial involvement in this project. This work\nis supported in part by the EU under contract MTRN-CT-2006-035482 (FLAVIAnet). O. C. is supported by MICINN, Spain under grants FPA2007-60323 and Consolider-Ingenio 2010 CSD200700042 CPAN. J. F. K. is supported in part by the Slovenian Research Agency.\n\nReferences\n[1] [ALEPH Collaboration and DELPHI Collaboration and L3 Collaboration and], Phys. Rept. 427 (2006) 257\n[arXiv:hep-ex/0509008].\n[2] G. Ecker, J. Gasser, A. Pich and E. de Rafael, Nucl. Phys. B 321 (1989) 311.\n[3] J. Gasser, H. Leutwyler, A. Pich and E. de Rafael, Phys. Lett. B 223 (1989) 425;\n[4] R. Barbieri, G. Isidori, V. S. Rychkov and E. Trincherini, Phys. Rev. D 78 (2008) 036012 [arXiv:0806.1624\n[hep-ph]].\n\n15\n\n\f[5] R. Barbieri, A. Pomarol, R. Rattazzi and A. Strumia, Nucl. Phys. B 703 (2004) 127 [arXiv:hep-ph/0405040].\n[6] R. Barbieri, arXiv:0706.0684 [hep-ph].\n[7] J. Hirn, A. Martin and V. Sanz, JHEP 0805 (2008) 084 [arXiv:0712.3783 [hep-ph]]; Phys. Rev. D 78 (2008)\n075026 [arXiv:0807.2465 [hep-ph]].\n[8] O. Cata and S. Peris, Phys. Rev. D 65, 056014 (2002) [arXiv:hep-ph/0107062].\n[9] T. Aaltonen et al. [The CDF Collaboration], arXiv:1004.4946 [hep-ex]; V. M. Abazov et al. [D0 Collaboration],\narXiv:1006.0761 [hep-ex].\n[10] O. Cata, G. Isidori and J. F. Kamenik, Nucl. Phys. B 822, 230 (2009) [arXiv:0905.0490 [hep-ph]].\n[11] R. Barbieri and G. F. Giudice, Nucl. Phys. B 306 (1988) 63.\n[12] A. Orgogozo and S. Rychkov, arXiv:1111.3534 [hep-ph].\n\n16\n\n\f"}