{"id": "http://arxiv.org/abs/0812.1313v1", "guidislink": true, "updated": "2008-12-06T20:53:14Z", "updated_parsed": [2008, 12, 6, 20, 53, 14, 5, 341, 0], "published": "2008-12-06T20:53:14Z", "published_parsed": [2008, 12, 6, 20, 53, 14, 5, 341, 0], "title": "Radial Velocity Studies of Close Binary Stars. XV", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0812.2471%2C0812.3926%2C0812.3329%2C0812.5013%2C0812.3171%2C0812.2132%2C0812.0525%2C0812.0202%2C0812.2580%2C0812.1858%2C0812.4018%2C0812.2184%2C0812.1653%2C0812.2875%2C0812.4761%2C0812.2900%2C0812.1167%2C0812.2837%2C0812.5007%2C0812.4866%2C0812.3163%2C0812.0999%2C0812.2549%2C0812.2273%2C0812.4205%2C0812.2571%2C0812.2711%2C0812.3846%2C0812.3338%2C0812.3551%2C0812.1621%2C0812.2873%2C0812.4521%2C0812.2381%2C0812.3348%2C0812.4899%2C0812.0462%2C0812.3319%2C0812.3863%2C0812.5005%2C0812.4875%2C0812.3731%2C0812.3416%2C0812.2212%2C0812.4708%2C0812.5091%2C0812.0620%2C0812.0220%2C0812.3668%2C0812.1141%2C0812.3708%2C0812.1411%2C0812.2227%2C0812.4536%2C0812.2092%2C0812.0096%2C0812.0040%2C0812.0200%2C0812.1036%2C0812.2896%2C0812.3080%2C0812.3447%2C0812.4390%2C0812.1150%2C0812.1789%2C0812.2723%2C0812.1900%2C0812.4312%2C0812.0707%2C0812.4397%2C0812.0223%2C0812.3489%2C0812.1589%2C0812.2860%2C0812.1580%2C0812.1960%2C0812.1273%2C0812.3764%2C0812.0832%2C0812.2556%2C0812.3330%2C0812.2032%2C0812.2553%2C0812.4662%2C0812.1735%2C0812.1730%2C0812.3818%2C0812.4652%2C0812.3030%2C0812.0072%2C0812.2768%2C0812.4813%2C0812.5079%2C0812.1718%2C0812.2579%2C0812.4562%2C0812.1313%2C0812.4957%2C0812.5108%2C0812.4835%2C0812.1875&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Radial Velocity Studies of Close Binary Stars. XV"}, "summary": "Radial-velocity measurements and sine-curve fits to the orbital radial\nvelocity variations are presented for the last eight close binary systems\nanalyzed the same way as in the previous papers of this series: QX And, DY Cet,\nMR Del, HI Dra, DD Mon, V868 Mon, ER Ori, and Y Sex. For another seven systems\n(TT Cet, AA Cet, CW Lyn, V563 Lyr, CW Sge, LV Vir and MW Vir) phase coverage is\ninsufficient to provide reliable orbits but radial velocities of individual\ncomponents were measured. Observations of a few complicated systems observed\nthroughout the DDO close-binary program are also presented; among them an\nespecially interesting is the multiple system V857 Her which - in addition to\nthe contact binary - very probably contains one or more sub-dwarf components of\nmuch earlier spectral type. All suspected binaries which were found to be most\nprobably pulsating stars are briefly discussed in terms of mean radial\nvelocities and projected rotation velocities (v sin i) as well as spectral type\nestimates. In two of them, CU CVn and V752 Mon, the broadening functions show a\nclear presence of non-radial pulsations. The previously missing spectral types\nfor the DDO I paper are given here in addition to such estimates for most of\nthe program stars of this paper.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0812.2471%2C0812.3926%2C0812.3329%2C0812.5013%2C0812.3171%2C0812.2132%2C0812.0525%2C0812.0202%2C0812.2580%2C0812.1858%2C0812.4018%2C0812.2184%2C0812.1653%2C0812.2875%2C0812.4761%2C0812.2900%2C0812.1167%2C0812.2837%2C0812.5007%2C0812.4866%2C0812.3163%2C0812.0999%2C0812.2549%2C0812.2273%2C0812.4205%2C0812.2571%2C0812.2711%2C0812.3846%2C0812.3338%2C0812.3551%2C0812.1621%2C0812.2873%2C0812.4521%2C0812.2381%2C0812.3348%2C0812.4899%2C0812.0462%2C0812.3319%2C0812.3863%2C0812.5005%2C0812.4875%2C0812.3731%2C0812.3416%2C0812.2212%2C0812.4708%2C0812.5091%2C0812.0620%2C0812.0220%2C0812.3668%2C0812.1141%2C0812.3708%2C0812.1411%2C0812.2227%2C0812.4536%2C0812.2092%2C0812.0096%2C0812.0040%2C0812.0200%2C0812.1036%2C0812.2896%2C0812.3080%2C0812.3447%2C0812.4390%2C0812.1150%2C0812.1789%2C0812.2723%2C0812.1900%2C0812.4312%2C0812.0707%2C0812.4397%2C0812.0223%2C0812.3489%2C0812.1589%2C0812.2860%2C0812.1580%2C0812.1960%2C0812.1273%2C0812.3764%2C0812.0832%2C0812.2556%2C0812.3330%2C0812.2032%2C0812.2553%2C0812.4662%2C0812.1735%2C0812.1730%2C0812.3818%2C0812.4652%2C0812.3030%2C0812.0072%2C0812.2768%2C0812.4813%2C0812.5079%2C0812.1718%2C0812.2579%2C0812.4562%2C0812.1313%2C0812.4957%2C0812.5108%2C0812.4835%2C0812.1875&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Radial-velocity measurements and sine-curve fits to the orbital radial\nvelocity variations are presented for the last eight close binary systems\nanalyzed the same way as in the previous papers of this series: QX And, DY Cet,\nMR Del, HI Dra, DD Mon, V868 Mon, ER Ori, and Y Sex. For another seven systems\n(TT Cet, AA Cet, CW Lyn, V563 Lyr, CW Sge, LV Vir and MW Vir) phase coverage is\ninsufficient to provide reliable orbits but radial velocities of individual\ncomponents were measured. Observations of a few complicated systems observed\nthroughout the DDO close-binary program are also presented; among them an\nespecially interesting is the multiple system V857 Her which - in addition to\nthe contact binary - very probably contains one or more sub-dwarf components of\nmuch earlier spectral type. All suspected binaries which were found to be most\nprobably pulsating stars are briefly discussed in terms of mean radial\nvelocities and projected rotation velocities (v sin i) as well as spectral type\nestimates. In two of them, CU CVn and V752 Mon, the broadening functions show a\nclear presence of non-radial pulsations. The previously missing spectral types\nfor the DDO I paper are given here in addition to such estimates for most of\nthe program stars of this paper."}, "authors": ["T. Pribulla", "S. M. Rucinski", "R. M. Blake", "W. Lu", "J. R. Thomson", "H. DeBond", "T. Karmo", "A. de Ridder", "W. Ogloza", "G. Stachowski", "M. Siwak"], "author_detail": {"name": "M. Siwak"}, "author": "M. Siwak", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0004-6256/137/3/3655", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0812.1313v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0812.1313v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "submitted to AJ", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0812.1313v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0812.1313v1", "journal_reference": null, "doi": "10.1088/0004-6256/137/3/3655", "fulltext": "Radial Velocity Studies of Close Binary Stars. XV1\nTheodor Pribulla1 , Slavek M. Rucinski, R.M. Blake2 , Wenxian Lu3 , J.R. Thomson, Heide\nDeBond, Toomas Karmo, Archie de Ridder\n\narXiv:0812.1313v1 [astro-ph] 6 Dec 2008\n\nDepartment of Astronomy & Astrophysics, University of Toronto\n50 St. George Street, Toronto, ON M5S 3H4\npribulla@ta3.sk,(rucinski,debond,karmo,ridder)@astro.utoronto.ca\nWaldemar Ogloza, Greg Stachowski\nMt. Suhora Observatory of the Pedagogical University\nul. Podchorażych 2, 30–084 Cracow, Poland\n(ogloza,greg)@ap.krakow.pl\nMichal Siwak\nAstronomical Observatory, Jagiellonian University, ul. Orla 171, 30–244 Cracow, Poland\nsiwak@oa.uj.edu.pl\nABSTRACT\nRadial-velocity measurements and sine-curve fits to the orbital radial velocity variations are presented for the last eight close binary systems analyzed the same way as\nin the previous papers of this series: QX And, DY Cet, MR Del, HI Dra, DD Mon,\nV868 Mon, ER Ori, and Y Sex. For another seven systems (TT Cet, AA Cet, CW Lyn,\nV563 Lyr, CW Sge, LV Vir and MW Vir) phase coverage is insufficient to provide reliable orbits but radial velocities of individual components were measured. Observations\nof a few complicated systems observed throughout the DDO close-binary program are\nalso presented; among them an especially interesting is the multiple system V857 Her\nwhich – in addition to the contact binary – very probably contains one or more subdwarf components of much earlier spectral type. All suspected binaries which were\nfound to be most probably pulsating stars are briefly discussed in terms of mean radial\nvelocities and projected rotation velocities (v sin i) as well as spectral type estimates. In\n1\n\nAstronomical Institute, Slovak Academy of Sciences, 059 60 Tatranská Lomnica, Slovakia\n\n2\n\nCurrent address: Dept. of Physics and Earth Science, University of North Alabama, Florence, 35632 AL, U.S.A.,\nemail: rmblake@una.edu\n3\n\nCurrent address: Department of Geography and Meteorology and Department of Physics and Astronomy, Valparaiso University, Valparaiso, IN 46383, U.S.A., e-mail: Wen.Lu@valpo.edu\n\n\f–2–\ntwo of them, CU CVn and V752 Mon, the broadening functions show a clear presence\nof non-radial pulsations. The previously missing spectral types for the DDO I paper\nare given here in addition to such estimates for most of the program stars of this paper.\nSubject headings: stars: close binaries - stars: eclipsing binaries – stars: variable stars\n\n1.\n\nINTRODUCTION\n\nThis is the last in a series of papers presenting results of spectroscopic observations taken\nwithin the program of radial velocity (hereafter RV) orbits of close binary stars at the David\nDunlap Observatory (DDO); it contains a discussion of the all remaining targets of this program.\nFor full references to the previous papers, see the last paper by Pribulla et al. (2009, Paper XIV); for\ntechnical details and conventions, for preliminary estimates of uncertainties, and for a description\nof the broadening functions (BFs) technique, see the interim summary paper Rucinski (2002, Paper\nVII).\nMost of data used in the present paper were obtained – as in most of the previous fourteen\npapers – using the broadening function approach applied to the spectral region of the Mg I triplet\n(always centered at 5184 Å). Up to August 2005 we used a diffraction grating with 1800 lines/mm,\nafter which a new one with 2160 lines/mm was used. A small number of observations were taken\nin the red region centered at 6290Å which includes a telluric band to resolve our concerns on the\nstability of the RV system (see Pribulla et al. (2006, Paper XI)). The RV observations reported in\nthis paper have been collected between October 1996 and July 2, 2008, the day when the David\nDunlap Observatory ceased to operate. The ranges of dates for individual systems can be found in\nTable 1. We note that this program utilized the efficient code of Pych (2004) for removal of cosmic\nrays from 2-D images.\nThroughout our program, selection of the targets was quasi-random: At a given time, we\nobserved a few dozen close binary systems with periods usually shorter than one day, brighter\nthan 10 – 11 magnitude and with declinations > −20◦ ; we published the results in groups of ten\nsystems as soon as reasonable orbital elements were obtained from measurements evenly distributed\nin orbital phases. This paper is an exception as we have not been able to collect ten orbits before\nthe observatory closure and we were left with material for a few stars already started. For that\nreason, in this last paper of the series, we present all remaining spectroscopic observations. Thus,\nthey include: (i) radial velocity orbits for eight close binaries observed and fully analyzed in the\nsame way as in previous publications of this series (QX And, DY Cet, MR Del, HI Dra, DD Mon,\nV868 Mon, ER Ori, and Y Sex); (ii) close binaries with just one quadrature covered or with a\nfew spectra available but not sufficient in number to define a reasonable orbit (TT Cet, AA Cet,\n1\n\nBased on the data obtained at the David Dunlap Observatory, University of Toronto.\n\n\f–3–\nCW Lyn, V563 Lyr, CW Sge, LV Vir, and MW Vir); (iii) complicated or faint binaries/triples not\nproviding reliable RVs (GO Cyg, V857 Her, V752 Mon, V353 Peg, and MS Vir), (iv) additional\ndata and improved orbits for a few multiple systems already presented within this series (ET Boo,\nXY Leo, and TV UMi); (v) radial velocities and projected rotational velocities, v sin i, for several\nstars found to be pulsating rather than being close binaries, and (vi) the previously missing spectraltype estimates for close binaries in Lu & Rucinski (1999, Paper I). All the RVs are given in Table 1.\nAmong the present targets, only QX And, ER Ori, and Y Sex, have had spectroscopic orbits\npreviously published while preliminary orbits of AA Cet and TT Cet, based on limited data, were\ngiven by Duerbeck & Rucinski (2007).\nThe RVs for the eight short period binaries reported in this paper were determined by fitting\nthe double rotational profiles to extracted BFs, as explained in Pribulla et al. (2006). Similarly\nas in our previous papers dealing with multiple systems (here the cases of MR Del, V563 Lyr,\nDD Mon, ER Ori, Y Sex, and LV Vir), the RVs for the eclipsing pair were obtained after removal\nof the slowly rotating component, as was described most recently in Pribulla et al. (2009).\nAs in other papers of this series, whenever possible, we estimated spectral types of the program stars using new classification spectra centered at 4200 Å or 4400 Å. Additional classification\nspectra were obtained for part of the systems published in Lu & Rucinski (1999, Paper I) where\nno classifications were given. The estimated spectral types were compared with the mean (B − V )\ncolor indices usually taken from the Tycho-2 catalog (Høg et al. 2000) and the photometric estimates of the spectral types using the relations of Bessell (1979). In this paper we also made use\nof infrared colors determined from the 2μ All Sky Survey (2MASS, Skrut et al. (2006)). Especially\nuseful is the J − K color index, which is monotonically rising from the early spectral types to about\nM0V (Cox 2000); this index is relatively less affected by the interstellar absorption than B − V .\nParallaxes cited throughout the paper were adopted from the new reduction of the Hipparcos raw\ndata (van Leeuwen 2007) which supersedes the original reductions (ESA 1997).\nThe RV data for the binaries are given in Table 1. The preliminary sine-curve solutions for\nthe eight binaries are in Table 2 while the phase diagrams are shown in Figures 1 and 2. Section 2\nof the paper contains summaries of previous studies for individual systems with reliable orbits\nand comments on the new data. Systems with the insufficient orbit coverage are discussed in\nSection 3, while problematic systems for which RVs could not be determined are discussed in\nSection 4. Targets which were found to be pulsating are presented in Section 5. Examples of BFs\nof individual systems are shown in Figures 3 – 5.\nThe data for the eight close binaries in Table 2 are organized in the same manner as in the previous papers of this series. In addition to the parameters of spectroscopic orbits, the table provides\ninformation about the relation between the spectroscopically observed upper conjunction of the\nmore massive component, T0 (not necessarily the primary eclipse) and the recent photometric determinations of the primary minimum in the form of the O −C deviations for the number of elapsed\nperiods E. The reference ephemeris of HI Dra was taken from Gomez-Forellad & Garcia-Melendo\n\n\f–4–\n(1996) and for V868 Mon from Otero et al. (2004). For the rest of systems the ephemerides were\nadopted from the on-line version of \"An Atlas of O-C diagrams of eclipsing binary stars\"2 (Kreiner\n2004). Because the on-line ephemerides are frequently updated, we give those used for the computation of the O − C residuals below Table 2 (the status as of October 2008). The deeper eclipse in\nW-type contact binary systems corresponds to the lower conjunction of the more massive component; in such cases the epoch in Table 2 is a half-integer number.\n\n2.\n\nEIGHT STARS WITH RELIABLE ORBITS\n2.1.\n\nQX And\n\nQX And (GSC 2816 1950, H235 in NGC 752) is a contact binary star in the intermediate\nage open cluster NGC 752. Its variability was first noted by Johnson (1953) on the basis of two\ndiscordant photometric observations. Platais (1991) gave 99% probability of the cluster membership for QX And based on the proper motion. The first thorough photometric and spectroscopic\nobservations of QX And were presented by Milone et al. (1995). The authors found that QX And\nis a contact binary, estimated its spectral type as F3-5, determined absolute parameters of the\ncomponents (masses M1 = 1.18 M⊙ and M2 = 0.24 M⊙ ) by simultaneous fits to the observed light\nand RV variations and found the distance to the binary and the cluster as 381 ± 17 pc. The\ncenter-of-mass velocity V0 = +11.7 ± 2.7 km s−1 (given in their Table 16), was larger than the\ncluster mean velocity, RV = +5.5 km s−1 (Daniel et al. 1994). Unfortunately, the RV observations\nof Milone et al. (1995) were of a rather poor quality (see their Fig. 5) resulting in only marginally\nuseful orbital parameters.\nPreliminary results of the DDO spectroscopy of QX And were published as a part of the PhD\nthesis of Blake (2002). Here we present an independent determination using the rotational-profile\nfitting to the extracted BFs. Our spectroscopic orbit (Table 2) is not fully consistent with the\nprevious result of Milone et al. (1995). In particular, the systemic velocity, V0 = +4.1 ± 1.2 km s−1\nis now close to that of the cluster, while both, the mass ratio q = 0.306 ± 0.009 and the projected\ntotal mass, (M1 + M2 ) sin3 i = 1.038 ± 0.022 M⊙ are larger.\nAlthough QX And was not observed by the Hipparcos satellite due to its low brightness, an\nindependent estimate of its distance can be obtained using the absolute magnitude calibration of\nRucinski & Duerbeck (1997). Using the photometry of Milone et al. (1995) giving Vmax = 11.49\nand the de-reddened color (B − V )0 = 0.43 (corresponding to the F5 spectral type), we obtain\nMV = 3.13 and the distance modulus, (V − MV ) = 8.36 (470 pc), which is close to the range\nconsidered for NGC 752 by Schiller & Milone (1988): (V − MV ) = 8.17 ± 0.15 from a full binary\nsolution for DS And and 7.9 ± 0.2 from isochrone fitting to un-evolved Main Sequence stars.\n2\n\nhttp://www.as.wsp.krakow.pl/ephem/\n\n\f–5–\n2.2.\n\nDY Cet\n\nVariability of DY Cet (HIP 12311, HD 16515) was detected during the Hipparcos mission where\nit was classified as a W UMa binary. The system has been neglected by observers in spite of its\nlarge photometric amplitude, ∆Hp = 0.56, possibly because of the negative declination (−14◦ 18′ ).\nA preliminary analysis of the Hipparcos light curve (hereafter LC) was performed by Selam (2004),\nwho – using the Fourier-coefficient method – determined the following geometric elements: mass\nratio qph = 0.45, fill-out f = 0.2, and inclination angle i = 77.5◦ . Except for a few times of minima,\n(Krajci 2006; Dworak 2006; Krajci 2007), no systematic, ground-based observations of the system\nhave been performed.\nBecause of the low sky elevation as seen from DDO, our spectroscopic observations of DY Cet\nwere obtained over a long period of time. The orbital solution (Table 2, Fig. 1) is based on two\ncombined datasets, one using the 1800 lines/mm grating and a THX chip and the second, more\nrecent, obtained with the 2160 lines/mm grating and a JY2 chip. Because of the long time interval\nover which the spectra were taken, it was necessary to optimize the period length, in addition to the\ninitial phase. The RVs show that the deeper minimum is an upper conjunction of the less massive\ncomponent so that the system is of the A subtype.\nThe Hipparcos parallax of DY Cet, π = 5.11 ± 1.99 mas, is of limited value for a luminosity\nestimate. The Tycho-2 color index, (B − V ) = 0.39, corresponds to a F3/4V spectral type, which\nwould be expected for a contact binary with an orbital period of 0.44 days. The 2MASS infrared\ncolor, (J − K) = 0.258, is also consistent with a spectral type of F4/5V. Unfortunately, we have\nnot obtained any classification spectra for the star.\n\n2.3.\n\nMR Del\n\nMR Del (HIP 101236, HD195434) is a part of a visual binary composed of V = 9.49 and\nV = 9.77 components, currently separated by 1.8′′ at a position angle of 71◦ (Mason et al. 2001a).\nCutispoto (1997) found that the brighter visual component is an active eclipsing binary with P =\n0.52175(22) days and inferred spectral type of K for all three components. The out-of-eclipse\nphotometric wave with an amplitude of about 0.04 mag was interpreted by the authors as due\nto photospheric spots. The large proper motion of the whole triple system, 0.416′′ /year, when\ncombined with its low metallicity, log [m/H] = −0.99 (relative to the Sun) indicates that it is a\nhalo or old disk object. Photometric observations of MR Del were later obtained by Clausen et al.\n(2001) (in the uvby system) and by Soydugan et al. (2001). No spectroscopy of the system has yet\nbeen available.\nOur spectra included all components of the visual pair. The third component with L3 /(L1 +\nL2 ) = 0.51 ± 0.06 (at the maximum light of the eclipsing binary) showed a stable radial velocity,\nV3 = −51.95 ± 0.35 km s−1 , close to the systemic velocity of the close binary V0 = −49.8 ± 0.8\n\n\f–6–\nkm s−1 . The broadening functions suggest that the eclipsing binary is a close, detached system,\nbut without any indications of photospheric spots previously implied by the LC asymmetry and\nrelated to the strong X-ray emission (Cutispoto 1997). With the new, reliably determined mass\nratio and the projected total mass (M1 + M2 ) sin3 i, the system requires a new photometric analysis\nto determine the inclination angle and thus its absolute parameters.\nThe Hipparcos parallax, 20.72 ± 2.49 mas, although of low accuracy, can be combined with the\nproper motion to give the space velocity of the system, V = 107 ± 10 km s−1 . Unfortunately, we\nhave no classification spectra for the components of the system.\n\n2.4.\n\nHI Dra\n\nThe variability of HI Dra (HIP 90972, HD 171848) was detected during the Hipparcos mission\nwhere it was classified as a RR Lyr pulsating star. HI Dra was later photometrically observed\nby Gomez-Forellad et al. (1999), who suggested that it is a β Lyrae or an ellipsoidal binary system. When folding their new data and the Hipparcos photometric observations with the period\nof 0.597417 days, the authors noticed an O'Connell effect of 0.02 mag which supported the binary\ninterpretation. The Hipparcos photometry was re-analyzed by Selam (2004) using the Fouriercoefficient method. The author found that the system is very probably a contact binary and\nobtained the first set of parameters: the mass ratio q = 0.15, inclination angle i = 52.5◦ and fill-out\nf = 0.7.\nOur spectroscopy and the appearance of the BFs (Fig. 3) confirm that HI Dra is a contact\nbinary star. The resulting mass ratio, q = 0.25, is substantially larger than that found by Selam\n(2004) documenting the unreliability of photometric mass ratios for partially eclipsing binaries and\nespecially systems with low photometric amplitudes. It is rather surprising, however, that the time\nof the lower conjunction of the more massive component occurs in photometric phase zero which\nindicates a W-subtype; for a low mass ratio, one would expect the A-subtype. But it is possible\nthat the orbital period is changing or that the initial epoch was not reliably determined from the\nHipparcos photometry\nThe catalog spectral type of HI Dra, F8, does not correspond to the observed J − K = 0.123\n(Skrut et al. 2006) nor to B − V = 0.272 (Høg et al. 2000). The relatively long orbital period of\nHI Dra also suggests an earlier spectral type. Although we do not have any classification spectra,\nwe found that the best BF template for the observations around the 5184Å triplet was for the\nspectral type F0-F2V. The Hipparcos parallax of the system is rather small, 3.93 ± 0.68 mas.\n\n\f–7–\n2.5.\n\nDD Mon\n\nThe variability of DD Mon (HD 292319, GSC 4800 372) was first noticed by Hoffmeister (1934).\nThe system was studied thoroughly by Yamasaki et al. (1990), who obtained BV photometric\ndata and medium dispersion (37Å/mm) photographic spectra. Analysis of their LCs showed that\nDD Mon is a near-contact or a semi-detached binary with its primary component almost filling its\nRoche lobe. Due to the low brightness of the system only the primary component was identified\nin the spectra resulting in: V0 = 8.1 ± 1.5 km s−1 , K1 = 89.1 ± 2.2 km s−1 . The spectral type\nwas estimated as F5IV/V. A LC analysis led to the mass ratio q = 0.70 ± 0.15 and the inclination\ni = 80 ± 0.4◦ . Later, Qian et al. (1997) obtained new BV photometry of the system and contrary\nto Yamasaki et al. (1990) found that the secondary component fills its Roche lobe.\nThe system is rather faint, mpg = 11.10 at the light maximum, and we were able to take only\na few spectra of it. They show three components: In addition to the rapidly rotating components\nof the eclipsing pair, the BFs clearly show a slowly-rotating third component at V3 = 19.5 ± 2.6\nkm s−1 , with L3 /(L1 + L2 ) ≃ 0.22. Our orbit is based on only 9 RV measurements for the primary\nand 8 RVs of the secondary component. Therefore we regard the resulting parameters as very\npreliminary. The binary system mean velocity, V0 = 20.2 ± 1.9 km s−1 , is equal within its error to\nthat of the third component indicating a physical bond. DD Mon was not known to be a multiple\nsystem before and it is not listed in the WDS Catalogue (Mason et al. 2001a). The profiles of the\nclose-binary components have the same projected rotation velocity v sin i ≃ 130 km s−1 , with the\nsecondary significantly fainter (Fig. 3), indicating detached or semi-detached configuration.\nWe have no spectral classification spectra for DD Mon. The spectral type of the system is\nprobably rather late in spite of the original classification in the HD Catalogue of B5. The Tycho-2\ncolor B − V = 0.510 indicates the spectral type F8 while the 2MASS infrared color J − K = 0.388\nsuggests a spectral type as late as G4. The best fitting template for the DD Mon spectra was\nHD 187691 which has a spectral type F8V.\n\n2.6.\n\nV868 Mon\n\nV868 Mon (BD−2 2221, GSC 4835 1947) is a relatively bright (V = 8.9) W UMa-type eclipsing\nbinary with photometric amplitude of about 0.50 mag. It was discovered on Stardial images by\nWils & Dworak (2003). The authors noted that the eclipses are probably total and determined the\nfollowing ephemeris for the primary minimum HJD 2452681.731 + 0.63772 × E. Later Otero et al.\n(2004) identified this variable star in the NSVS photometry3 and improved its orbital period to P =\n0.637705 days. The authors classified this binary as EB. No further observations or investigation\nof the system have been published since then.\n3\n\nhttp://www.skydot.lanl.gov/nsvs/nsvs.php\n\n\f–8–\nOur spectroscopy shows that V868 Mon is indeed a very close or contact binary; the profiles of\nthe components are never completely separated. The RVs of the secondary component are rather\nuncertain especially around the second orbital quadrature, where the profiles usually appear to\nbe deformed or asymmetric, indicating an intrinsic variability. An orbital period of Otero et al.\n(2004) was adopted in our RV orbit solution; our attempts to adjust the period did not lead to any\nsignificant improvement of the solution.\nV868 Mon has a rather high systemic velocity, V0 = 78.1 km s−1 . Unfortunately, the system\nwas not included in the Hipparcos mission so that its distance is not known and the proper motion\ncomponents are not precise enough to determine its space velocity. The 2MASS infrared color\nindex of V868 Mon, (J − K) = 0.16, corresponds to a F0 spectral type while the Tycho-2 (B − V )\n= 0.20 to about A8V. The best template to the spectra, HD 128167, has a spectral type of F2V,\nsuggesting a slightly later spectral type.\n\n2.7.\n\nER Ori\n\nThe variability of ER Ori (HIP 24156, WDS 05112–0833) was first noticed by Hoffmeister\n(1929) while the variability type was properly assigned by Florja (1931). Later, Struve (1944)\nobtained a preliminary spectroscopic orbit of the system which is, however, of marginal use because\nof the inadequate spectral resolution and a small number of observations. Because of its large\nphotometric amplitude (∆V ∼ 0.6) and short period (0.4234 days), the system was subject to\nmany photometric studies. The photometric analyzes lead to a rather inconsistent set of geometric\nparameters; for references and discussion see Kim et al. (2003). A wave-like pattern in the timeof-minima (O-C) diagram was interpreted in terms of an invisible body on a 35-years orbit by\nAbhyankar & Panchatsaram (1982).\nThe breakthrough investigation in the study of ER Ori was that of Goecking et al. (1994). The\nauthors found that (i) the system is totally eclipsing with a totality lasting 12.6 minutes, (ii) a third\ncomponent appears in the cross-correlation functions of the spectra at a place established using\nspeckle interferometry data (separation ρ = 0.187(7)′′ , position angle θ = 354.1(15)◦ , intensity\nratio L3 /(L1 + L2 ) = 0.16(3) in the Hα filter, as of March 1993), (iii) the orbital period of the\nthird body, as estimated from the binary period variations, is about 63 years and the orbit is\nseen almost pole-on, (iv) the first, reliable spectroscopic orbit based on photographic spectra with\nparameters: K1 = 130.1 ± 6.8 km s−1 , K2 = 235.5 ± 6.9 km s−1 , V0 = 37.9 ± 3.3 km s−1 ; with the\nphotometrically determined inclination angle i = 87.5◦ , the masses are: M1 = 1.39 ± 0.10 M⊙ and\nM2 = 0.76 ± 0.08 M⊙ ; (vi) the third component RV is constant, V3 = 41 ± 1.5 km s−1 , and within\nthe error of the systemic velocity of the close binary.\nAdaptive optics and infrared observations of Rucinski et al. (2007) confirmed the presence\nof the third component. In January 1998, it was practically at the same position (ρ = 0.183′′ ,\nθ = 354.4◦ , ∆K = 2.14) as found by Goecking et al. (1994), while in October 2005 it was not\n\n\f–9–\ndetectable, indicating it was closer than the detection limit of about 0.09′′ (for the observed\n∆K). The disappearance of the companion almost coincides with its predicted periastron passage (July/August 2004) (Kim et al. 2003), as based on the observed light-time effect (hereafter\nLITE). The periastron passage in 2004, however, is not fully supported by the large acceleration\nterms observed during the Hipparcos program4 , gα = −19.26±6.57 mas yr−2 and gδ = −17.34±4.71\nmas yr−2 .\nOur spectroscopic elements are different from those of Goecking et al. (1994): K1 = 148.0±2.3\nkm s−1 , K2 = 225.5 ± 2.3 km s−1 , V0 = 49.4 ± 1.7 km s−1 ; the mass ratio is slightly larger,\nq = 0.656(12). The velocity of the third component was found to vary significantly between +38\nkm s−1 (HJD 2 454 180) and +20 km s−1 (HJD 2 454 530). This means that the third component\nitself is very probably also a binary. Another possibility, that the third component is a single star\nand revolves around the contact pair, cannot be ruled out completely as our present, good quality\ndata still do not permit to detect the motion of the third component reflected in the contactbinary RVs. The light contribution of the third component, as found from the integrated BF's, is\nβ = L3 /(L1 + L2 ) = 0.16 ± 0.02, which is fairly consistent with the result of Goecking et al. (1994).\nAlthough ER Ori was observed by the Hipparcos satellite, its parallax, π = 4.47 ± 3.50 mas\n(van Leeuwen 2007), is basically useless (we note that it was strongly negative in the original\nHipparcos results). The parallax problems are – very probably – due to the presence of the visual\ncompanion 13.6′′ to the north and to the orbital motion in the tight visual pair. The Hipparcos\nastrometry could possibly be re-analyzed utilizing observed LITE and a distance estimate from the\nabsolute-magnitude calibration of Rucinski & Duerbeck (1997). Our own spectral type estimate is\nF7/8. Assuming F8 on the basis of (B − V )0 = 0.54, we obtain MV = 3.41. Taking Vmax = 9.325\n12 = 9.49 and then d ≃ 164 pc or π ≃ 6 mas.\n(Goecking et al. 1994) and β = 0.16, we have Vmax\n\n2.8.\n\nY Sex\n\nY Sex (HIP 49217) is a contact binary within a tight visual double (WDS 10028+0106,\nHDS 1451, ρ = 0.49′′ , θ = 154◦ , V = 10.08 + 12.70). The variability of Y Sex was first noted\nby Hoffmeister (1934) and the first photoelectric photometry of the system was obtained by\nTanabe & Nakamura (1957). Later Hill (1979) analyzed its LC assuming the Roche model. He\nfound it to be of the W-subtype and showing total eclipses; his determination of the geometric\nelements gave: 1/q = 5.72 ± 0.07, i = 76.8◦ and a marginal contact f = 0. McLean & Hilditch\n(1983) obtained the first spectroscopic observations of the system. By measuring the metal line\ncentroids those authors obtained the following orbital elements: V0 = 9.8 ± 6 km s−1 , K1 = 40.0 ± 8\nkm s−1 and K2 = 218 ± 31 km s−1 resulting in the mass ratio, q = 0.18 ± 0.03, i.e. compatible with\nthe photometric determination of Hill (1979), which is not surprising since the system is totally\n4\n\nIn the new reductions of van Leeuwen (2007), the astrometric solution did not require any acceleration terms.\n\n\f– 10 –\neclipsing.\nLater studies of Y Sex (Herczeg 1993; Qian & Liu 2000; Wolf 2000; He & Qian 2007) concentrated on the variable orbital period of the system. Wolf (2000) found that the sinusoidal variation\nof the orbital period can be interpreted by the presence of an invisible third body on a 58-years orbit\nand estimated its spectral type as M4/5 and M3 ≃ 0.3 M⊙ . Finally, Yang & Liu (2003) detected\na tiny third light L3 = 0.0064 ± 0.0008 in their LC solution. It is surprising that all investigators\nsomehow overlooked the fact that Y Sex is part of a tight visual binary detected by the Hipparcos\nsatellite (ESA 1997).\nY Sex was somewhat faint for the DDO instrumentation which together with its relatively\nearly spectral type led to noisy broadening functions. The very close companion separated by 0.49′′\nwas always within the seeing disk at DDO. Its light contribution L3 /(L1 + L2 ) = 0.11 ± 0.03, as\ndetermined from the BFs close to the orbital quadratures of the eclipsing pair, is slightly larger\nthan that inferred from the magnitude difference as cataloged in the WDS.\nThe 2MASS J −K = 0.278 index is consistent with the F5 classification while Tycho-2 B −V =\n0.39 corresponds to a slightly earlier spectral type F3/4V. The Hipparcos parallax, π = 8.75 ± 2.09\nmas is rather imprecise to be of any use. Our classification spectra indicate the spectral type F5/6.\n\n3.\n\nBINARY STARS WITH INSUFFICIENT ORBITAL COVERAGE\n\nSeveral targets were observed at DDO but a sufficient phase coverage was not achieved either\ndue to low brightness (resulting in poor spectra), low sky elevation or the DDO closure before the\nconclusion of this program. Below, we describe systems for which RV data were collected, but\nusually only one orbital quadrature was adequately covered. Such data do not define the mass\nratio reliably but can be used to estimate the total projected semi-amplitude (K1 + K2 ) and thus\nthe total projected mass, or can be combined with future observations.\n\n3.1.\n\nTT Cet\n\nProperties of TT Cet (HIP 8294) are discussed and a preliminary orbit given in Duerbeck & Rucinski\n(2007). It is a close, but very probably a detached or semi-detached binary. The system was found\nto be too faint and too low over the southern, city-illuminated sky for DDO (δ = −9◦ 45′ , Vmax =\n10.9). The quality of the extracted BFs was further deteriorated by the fairly early spectral type\nand thus a correspondingly weak Mg I triplet.\nMost of BFs extracted from the DDO spectra show only the primary component; the secondary\nis visible in only one BF, see Fig. 3. Our RVs (Table 1) are given only for the primary component.\nThe 2MASS color index J −K = 0.25 indicates the F4/5V spectral type while the Tycho-2 B −V =\n0.404 corresponds to a F3/4 spectral type. Our own spectral classification confirms a spectral type\n\n\f– 11 –\nof F4V.\n\n3.2.\n\nAA Cet\n\nFor a fuller discussion of this system, see Duerbeck & Rucinski (2007). Because AA Cet\n(HIP 9258, HD 12180) was visible very low from DDO, we were able to take only 11 spectra of this\nsystem; unfortunately, most of them happened to be close to the conjunctions. Therefore, we are\ngiving only a few RV determinations for AA Cet in Table 1. The extracted BFs show a systematic\ndifference between the quadratures: While around the phase 0.25, the profile of the secondary is\nclose to the expected rotational profile, the profiles for the phases around 0.75 appear narrower and\ntriangular or irregular shape. Our classification spectra indicate the spectral type F4V.\n\n3.3.\n\nCW Lyn\n\nVariability of CW Lyn (HIP 42554) was discovered by the Hipparcos mission, where it was\nclassified as a β Lyrae variable with 0.812389 days orbital period. Later Selam (2004) analyzed the\nHipparcos LC using the Fourier-coefficient method and found that the system is a genuine contact\nbinary. The author determined the following preliminary parameters: a fill-out f = 0.0, mass ratio\nq = 0.10, inclination angle i = 77.5◦ . The Hipparcos LC with the amplitude of about ∆V = 0.25\nindicates a possibility of total eclipses for a low mass ratio system. No ground-based observations\nof the system have been published so far.\nOur spectroscopy covers the second orbital quadrature only. The Hipparcos ephemeris does not\nsatisfactorily predict phases of our spectroscopy indicating either a significant period change or a\nproblem with the ephemeris. The BFs (see Fig. 3) support the low mass ratio of the system but show\nsome peculiarities similar to those seen in AW UMa (Pribulla & Rucinski 2008): (i) the secondary\nhas a triangular shape, (ii) the primary component has a wide base underneath a relatively narrow\nprofile, in a clear disagreement with the Roche model.\nThe system was included in the Hipparcos mission, but its parallax, π = 3.93 ± 1.37 mas, is of\nlimited use. The BFs strengths indicate the F3/4 spectral type which is fairly consistent with the\n2MASS color J − K = 0.263. Our classification spectrum corresponds to the same spectral type,\nF4V.\n\n3.4.\n\nV563 Lyr\n\nVariability of V563 Lyr (NSV 11321) was noted by Hoffmeister (1966) and the system was\nlater photometrically observed by Belt et al. (1999), who found it to be a contact binary with\nP = 0.577639 days, and estimated its spectral type as F5. The LC minima seemed to be of similar\n\n\f– 12 –\ndepth. The authors also noted that the components are very probably evolved because of the rather\nlate spectral type for the orbital period. Except for a few minima observations, the system has\nnever been studied in detail.\nWith a visual magnitude ranging between 10.96 and 11.47 (Belt et al. 1999), the system was\ndifficult for the DDO spectral observations. Most of the spectra were noisy so that only 8 observations during two nights of excellent seeing were useful for RV determinations (see Table 1). The BFs\nimmediately show that the system is accompanied by a third component with a light contribution\nof about L3 /(L1 + L2 ) = 0.15. Unfortunately, only one orbital quadrature was covered with good\nobservations preventing a reliable determination of the orbit. Assuming that the third component\nis physically bound, and that its velocity, V3 ∼= 14 km s−1 , is identical to the center-of-mass\nvelocity of the contact binary, we can roughly estimate the mass ratio at q = 0.37 and the total\nprojected mass at a relatively high value of (M1 + M2 ) sin3 i = 3.0 M⊙ .\nThe trigonometric parallax of V563 Lyr is unknown since it was not included in the Hipparcos\nmission. Its 2MASS infrared color J − K = 0.216 corresponds to the F2/3 spectral type while the\nTycho-2 color is B − V = 0.456, implying F5V is probably affected by the interstellar extinction.\n\n3.5.\n\nCW Sge\n\nCW Sge (HIP 98430) is a rather faint (Vmax = 11.0) contact binary. Its variability was noticed\nby Hoffmeister (1935) who classified the system as a RR Lyr variable with P = 0.330223 days. Later\nLange (1960) found it to be a W UMa variable with a two times longer period. In the catalogue\nof Brancewicz & Dworak (1980), CW Sge is a close but detached binary with components filling\nrespectively 86% and 85% of their Roche radii. No other photometric or spectroscopic study of the\nsystem has yet been published . The adaptive optics observations of Rucinski et al. (2007) showed\nthat the binary is accompanied by a late-type companion separated by 1.84′′ . This companion most\nprobably entered the slit of the DDO spectrograph during periods of bad seeing. CW Sge may in\nfact host an even closer companion as indicated by a large, 7.64 mas, \"cosmic error\" in the original\nHipparcos astrometric solution (ESA 1997), leading to a negative parallax, π = −0.23 ± 2.41 mas.\nCW Sge was found to be too faint for DDO and was abandoned. Only one orbital quadrature\n(phase 0.75) was observed making a reliable orbit determination impossible. The best template for\nthe observed spectra is that of a F8 spectral type, which appears to be too late for a contact binary\nwith orbital period as long as P = 0.66 days. The RVs show that the more massive component is\nthe cooler one. Our own spectral classification spectrum suggests a spectral type of F6, which is\nmoderately consistent with J − K = 0.23 which suggests type F3.\n\n\f– 13 –\n3.6.\n\nLV Vir\n\nVariability of LV Vir (HIP 66078, HD 117780) was detected by the Hipparcos mission, where it\nwas classified as a β Lyrae variable with orbital period P = 0.409439 days. LV Vir is member of the\nrelatively close visual binary WDS 13328–1746 consisting of V = 9.09 and V = 9.43 components,\ncurrently at the position angle θ = 27◦ and the separation ρ = 1.2′′ . This resulted in the inclusion\nof both components into the DDO spectrograph slit. The Fourier analysis of the Hipparcos LC by\nSelam (2004) showed that LV Vir is a genuine contact binary. Except for speckle interferometry\nobservations of the visual pair, no ground-based photometry or spectroscopy of the system has been\npublished yet, in spite of the fairly large photometric amplitude of the variable (∆V = 0.20).\nBecause of the southern declination of the star, we were able to take only 3 spectra of the\nsystem. The resulting BFs (see Fig. 3) show all three components (the binary and the visual\ncompanion) and support the contact configuration for the close binary system. Although we do\nnot have a classification spectrum for the system, the best match to the observed spectra of LV Vir\nindicates the F6/7 spectral type. The 2MASS infrared color J − K = 0.282 corresponds to the F5\nspectral type while the Tycho-2 B − V = 0.521 corresponds to the F7/8 spectral type.\n\n3.7.\n\nMW Vir\n\nMW Vir (HIP 69828, HD 125048) was found to be variable during the Hipparcos mission. The\nwavelike variation with ∆Hp = 0.03 and P = 0.246539 days could either result from pulsations\nof a single star or from ellipsoidal variations in a close binary. Although the system is a very\nbright one, V ≃ 7.0, no ground-based observations of the star have been published yet. MW Vir\nwas identified with an X-ray source both in the EINSTEIN and ROSAT observations indicating a\nlate-type companion to the moderately early-type star (Chisholm et al. 1999).\nNine spectra taken close to the conjunction show that MW Vir is definitely a binary star.\nUnfortunately, only one component is spectrally visible with determinable RV so that the secondary\nis probably a low mass, late-type star. The rotational velocity of the primary is about v sin i ≃ 75\nkm s−1 ; its orbital RV's were observed to decrease by 33 km s−1 over the phase interval of 0.123\n(see Table 1).\nThe system is relatively nearby, with the Hipparcos parallax of 12.40 ± 1.10 mas. The Tycho-2\nB − V = 0.229 corresponds to a spectral type of A7-8V, while the 2MASS J − K = 0.186 gives a\nsubstantially later type, F1V. Assuming that the system is a contact binary and using the absolute\nmagnitude calibration of Rucinski & Duerbeck (1997) we find MVcal = 2.18 (for B − V = 0.23)\nwhich is consistent with the absolute magnitude given by the Hipparcos parallax, MV = 2.42.\n\n\f– 14 –\n4.\n\nDIFFICULT BINARY STARS\n\nIn this section we present fragmentary results for binary systems where – although attempted\n– no reliable measurements of RVs could be obtained. Although only indicative, these results may\nlead to further research as some of the objects appear to be very interesting.\nThe problems that we encountered were as follows: (i) the target was observed too low on the\nDDO sky resulting in poor spectra; (ii) the spectral type was found to be rather early making the\nlines of the Mg I triplet too weak; (iii) the target was too faint for our telescope – spectrograph\ncombination; (iv) the close binary was found to be accompanied by a third, bright and dominant, rapidly-rotating companion spectrally obscuring the binary; (v) the third component had a\nsignificantly different spectral type from the binary and suppressed the binary signature in the BFs.\n\n4.1.\n\nGO Cyg\n\nGO Cyg (HIP 101748, HD 196628) is a close but very probably detached eclipsing binary\nsystem; for references and details see Sezer et al. (1993); Oh et al. (2000). Its spectroscopic orbit\nbased on RVs obtained by the CCF method was presented in Sezer et al. (1993).\nThe system consists of components of different temperatures (T1 = 10,700 K and T2 = 6,200 K)\nand thus it is not ideal for the BF approach; moreover, the primary is too early to have sufficiently\nstrong lines in the Mg I region. Only 4 spectra of the system were taken, all close to the secondary\nminimum. In addition to the primary component of the binary, one can clearly see an additional\ncomponent rotating with v sin i ∼= 35 km s−1 (see Fig. 4). It is interesting to note that the\nthird component was not noted in the CCFs analysis presented by Sezer et al. (1993). A reliable\nanalysis of the system would require a high-dispersion spectroscopy over the whole optical range\nfor a spectral disentanglement of all components.\n\n4.2.\n\nV857 Her\n\nThe variability of V857 Her (GSC 3070 345, Vmax = 10, sp. type A6) was noticed by Geyer et al.\n(1955), who proposed it to be a Cepheid pulsating star. No systematic observations of the system were performed until 1996, when Gomez-Forellad & Garcia-Melendo (1996) obtained extensive\nCCD photometry of the system and found it to be a totally eclipsing W UMa binary with P = 0.3825\ndays. A preliminary solution of the LCs – mostly driven by the small photometric amplitude and\nthe presence of total eclipses – led to a very low mass ratio, qph = 0.0725 ± 0.050, and a high fill-out\nfactor f = 0.80 ± 0.10. The authors also noticed cyclic LC changes. Later, Qian et al. (2005)\ndetermined an even smaller (in fact, a record small) mass ratio, qph = 0.0653. No spectroscopic\nstudy of the system has been published so far.\n\n\f– 15 –\nTwo sets of spectra of V857 Her were obtained at DDO, the older set using the 1800 lines/mm\ngrating and THX chip and the more recent set using the 2160 lines/mm grating and the JY2\nchip. The spectral lines in Mg I region are surprisingly shallow resulting in poor BFs for either of\nthe DDO datasets; basically, no trustworthy RVs could be determined. Averaging of all available\nspectra for either of the datasets has resulted in reasonable mean BF when analyzed with a F2\ntemplate (Fig. 4); the BFs corresponded to a single, relatively rapidly-rotating star with a presumed\npresence of another component in the system. The secondary component was not visible due to\na (possibly) low mass ratio and – obviously – to the averaging of the spectra. Subtracting the\ncorresponding binary contribution (obtained by a convolution of the template spectrum with the\nBF) results in a residual spectrum resembling that of a late B-type or an early A-type star rotating\nat v sin i ≃ 50 km s−1 . Because this approach involves an average spectrum, we cannot say if the\nearly-type component detected that way is a binary or a single star. If this component is physically\nconnected with the close binary, it must be a hot subdwarf, either a single or binary star. V857 Her\ndid not appear to be a visual double on the spectrograph slit and is not listed in the WDS catalogue\n(Mason et al. 2001a).\nThe peculiarity of the system was noticed before by Pribulla & Rucinski (2006) in that it\nappeared too blue for its orbital period of 0.3825 d. The Tycho-2 color index (B − V ) = 0.164,\ncorresponds to the A6 spectral type while our classification spectrum indicates an A7 spectral\ntype. The presence of an early-type component would explain the period – color discrepancy and\nthe shallowness of the eclipses but would also put in doubt the very low mass ratio previously\nindicated by the LC modeling. V857 Her is a very interesting system and certainly deserves a\ndedicated study based on high S/N, wide wavelength coverage (echelle) spectra.\n\n4.3.\n\nV752 Mon\n\nV752 Mon (HIP 34401, HD 54250) is member of the visual binary WDS 07079–0441 (V =\n7.47 + 7.95, θ = 24◦ , ρ = 1.7′′ ). During the Hipparcos mission it was found that the object is\na low-amplitude variable and was tentatively classified as a δ Scuti pulsator. The rather early\nspectral type, A9V – F0V, supported this classification. However, knowing how many Hipparcos\nshort-period pulsating stars turned out to be close binaries, we included V752 Mon in our binary\nstar program.\nUnfortunately, the orientation of the visual pair was not convenient so that on most nights\nboth components were simultaneously included in the spectrograph slit. The brighter component\ndominated in the spectra, but the extracted BFs do not show any changes when arranged versus\nthe presumed pulsation period or versus a period two times longer. In fact, the BFs show only one\nrapidly rotating component with v sin i ∼ 155 − 160 km s−1 , with no traces of the visual companion\nwhich would be expected for two almost identical components with only a 0.5 magnitude difference\n(Mason et al. 2001a).\n\n\f– 16 –\nThe dominating star in the spectra appears to be a δ Scuti star. The BFs clearly show wavelike\nstructures propagating on the surface of the rapidly rotating star which can be explained by nonradial modes with m ≃ 8 − 10. We describe a similar case with very clear signatures of non-radial\npulsations, CU CVn, in Section 5 (see Fig. 5) where we comment on the applicability of the BF\ntechnique to pulsating stars.\nAt this point, we cannot exclude a possibility that the photometric (binary star) variability\ncomes from the secondary component of the visual pair and that pulsations of the dominating star\nsimply mask the spectral signatures of a close binary in that star. It is puzzling that the visual\nsecondary is not present in our spectra at all. Its absence may be explained in two ways: (1) it is\nalso a rapidly rotating star at the (almost) same RV as the primary so that the two broad profiles\noverlap, or (2) it is in fact a close binary, but because our spectra – in the mediocre seeing conditions\n– were guided on the brighter component of the pair, the light contribution of the secondary to the\nspectra was lesser than expected. Obviously, only spectra of individual components of the visual\npair will establish which component is variable and what is its type.\nWe note that if we were sure that a close binary is not hiding as the secondary of the visual pair,\nwe would have included V752 Mon in Section 5, among pulsating stars serendipitously observed by\nus during our program.\n\n4.4.\n\nV353 Peg\n\nV353 Peg (HIP 116108) is a bright (Vmax = 7.42) low-amplitude (∆Hp = 0.07) variable\ndiscovered by the Hipparcos satellite and classified as a β Lyrae-type eclipsing binary with a period\nof 0.584557 days. The eclipsing pair is very probably accompanied by a third component because\nthe system shows a non-linear sky motion as indicated by its astrometric solution requiring an\nacceleration term (the \"G\" flag in H59)5 . Unfortunately, speckle interferometry of Mason et al.\n(2001b) could not resolve the visual pair. V353 Peg was observed spectroscopically as part of the\nground-based spectroscopic support of the Hipparcos mission (Fehrenbach et al. 1997): the four\nRV observations showed a spread of 40 km s−1 . Otherwise, this bright variable has been rather\nneglected.\nThe BFs show a strong, dominating, slowly-rotating component accompanied by very faint\nfeatures of a close binary. The BFs extracted around the binary quadratures conclusively show the\nphase variations expected for a close binary. However, the binary is just barely distinguishable at\nthe base of the strong peak of the companion (Fig. 4) so its RV's could not be well determined. The\nBF analysis was further complicated by a significant difference in the spectral types of the binary\nand its bright companion resulting in a depression around the dominant component which affects\n5\n\nIn the new reduction of Hipparcos raw data (van Leeuwen 2007), there is \"stochastic\" solution for V353 Peg\ninstead\n\n\f– 17 –\nthe residual profile of the binary. The third component is significantly brighter than the eclipsing\nbinary with L3 /(L1 + L2 ) ≃ 2.5 preventing a sound analysis of the system. The RV of the third\ncomponent was found to be practically constant at V3 ≃ −5 km s−1 (see Table 3).\nThe 2MASS infrared color J − K = 0.158 corresponds to the F0V spectral type which is\nfairly consistent with the Tycho-2 B − V = 0.21 implying an A8 type. Our own, rather uncertain\nclassification indicates a combination of spectral types, A7 and F2, possibly corresponding to the\ndominant third component and the eclipsing binary.\n\n4.5.\n\nMS Vir\n\nMS Vir (HIP 68881) is another Hipparcos discovery. The system was originally classified as\na β Lyrae eclipsing binary with the variability period of P = 0.31244 days. According to Selam\n(2004), who modeled the Hipparcos photometry using the Fourier-coefficient method, MS Vir is\nnot a β Lyr system but a contact binary with the geometric parameters: q = 0.25, f = 1.00, and\ni = 52.5◦ .\nBecause the system was visible very low at DDO (δ = −17◦ 41′ ), we obtained only 7 spectra\nof the system. Although we attempted to obtain well exposed spectra using 900 sec exposures,\nthe spectra and resulting BFs are too poor to enable reliable RV measurements. The BFs indicate\nthat MS Vir is indeed a close binary composed of similar components. New spectroscopy from\nthe Southern hemisphere is needed to derive reliable parameters of the system. We note that the\nHipparcos parallax of the star is rather large, π = 13.36 ± 1.65 mas, so that the system is nearby.\n\n5.\n\nLOW AMPLITUDE AND PULSATING VARIABLES\n5.1.\n\nLow amplitude variables\n\nThe Hipparcos mission have detected many low amplitude variables with variability periods\nbetween 0.1 – 0.5 days. As the original analyzes and subsequent studies have shown, the variables\nturned out to be mostly pulsating stars of δ Sct, RR Lyr, SX Phe and γ Dor types with an\nadmixture of contact binaries seen at low inclination angles. As was demonstrated by Rucinski\n(2001), the probability of very small amplitudes for contact binaries does not go to zero with\ni → 0 but rather stabilizes at a finite value. Additionally, low amplitudes of some among the\nclose binaries could be caused by the presence of a third component. In such cases, companions\nmay force bluer colors of the combined systems making them more similar to pulsating stars; this\nwould invalidate the period-color diagram approach of Duerbeck (1997) of finding contact binaries\namong small amplitude variables. Our series and its companion investigations on triplicity of close\nbinaries (Pribulla & Rucinski 2006; D'Angelo et al. 2006; Rucinski et al. 2007) have shown that\nthe frequency of companions to close binaries is exceptionally high and may be approaching 100%.\n\n\f– 18 –\nFor that reason, we felt that many stars classified as pulsating by the Hipparcos project required\nchecking for the possibility of being in fact binaries. In most cases, we stopped further observing\nafter establishing that a star is a sharp-lined one and thus not a close binary. But, sometimes,\nwhen the presence of a dominating third component was suspected, we continued our observations.\nThus, in this somewhat erratic way, we collected several RV observations which may be of use in\nthe future.\nThroughout the DDO close binary program we stumbled upon 17 low-amplitude variables\nwhich were hard to classify and where only one spectral component seen at a constant RV was\ndetected. For these systems we give mean RV, the projected rotational velocity, v sin i and estimated\nspectral type in Table 5. The individual RVs and rotational velocities are given in Table 6. Of\ncourse, we do not exclude a possibility that some of the constant velocity stars are in fact close\nbinaries, possibly with companions. Here, we simply report our findings for any future use.\n\n5.2.\n\nV752 Mon and CU CVn\n\nThe most obvious radially pulsating stars observed in this program are V752 Mon (this system\nmay contain a close binary, Section 4.3) and CU CVn. Both show rapid rotation and in both, both\n\"bumps\" or \"ripples\" are clearly present in their BFs when these are arranged in phase into twodimensional displays (Fig. 5). In both cases, the ripples move in the direction of the stellar rotation\nand are uniformly distributed along the stellar longitudes clearly indicating non-radial pulsations.\nSuch ripples have been observed before in individual lines or in cross-correlation analysis studies\nof δ Sct stars (Mantegazza 1997, 2004). Here, we see them very well defined in the broadening\nfunctions which attests the usefulness of this technique even for pulsating stars: Apparently, all\nlines in our spectral window of some 240 Å behaved and traced the pulsations the same way.\nWe have more data for V752 Mon than for CU CVn (Fig. 5), but the quality is poorer, possibly\nbecause of a more complex nature of the multiple system and the possible presence of the close\nbinary (Section 4.3). It is very interesting that we can distinguish the very stable, practically totally\nunmodified ripple pattern after one year (exactly 342 days) separating the first and the last nights\nof the V752 Mon observations. The non-radial modes appear to be prograde ones with m ≃ 8 − 10.\nIn the case of CU CVn the ripples are even better defined and can be easily measured for the\ntemporal period of return of P ∼ 0.4 − 0.5 days. Vidal-Sáinz et al. (2002) rejected the original\nHipparcos classification of the star as a W UMa binary (which was the reason for us to observe the\nstar) and gave the dominant pulsation period as 0.0678 days, i.e. one half of the Hipparcos period.\nThe appearance of the ripples, compared with theoretical simulations (Kochukhov 2004), indicate\nsectoral mode with l = m = 6 − 8 and an axial inclination angle i ∼ 90◦ .\nBoth, V752 Mon and CU CVn, definitely deserve new high-resolution spectroscopy. We suspect\na similar picture to emerge for IN Dra (see below) but – with only a few spectra for this star – we\ncannot state anything definitely.\n\n\f– 19 –\n5.3.\n\nOther single or pulsating stars\n\nThe main spectroscopic results for low amplitude variables observed during the DDO binary\nprogram are given in Table 5. Unambiguous variability classification have been possible only for a\nfew of them because of the small number of spectra or short, one-night durations of some of our\nobservations. These limitations apply especially to HV Eri, V1359 Ori and GG UMa, for which\nwe cannot reject a possibility that they are eclipsing variables seen at low inclination angle; these\nsystems could either be SB1 or observed close to either of the conjunctions.\nIn the pulsating star CC Lyn, the DDO data probably relate only to the brighter component\nof the visual pair. The RV of CC Lyn was found to vary between +15 km s−1 and +23 km s−1 .\n\n6.\n\nSPECTRAL CLASSIFICATIONS\n\nDuring our program we realized the value of independently acquired spectral classifications.\nFor that reason, we planned to classify all binaries without available spectral types. Unfortunately,\nwe have not been able to achieve this for all binaries of this series before the observatory closure.\nIn addition to the data for the eight binaries which form the main results of this paper, as given\nin Table 2, we obtained classification spectra only for systems originally studied in the first paper\nof the series Lu & Rucinski (1999, Paper I). The spectral types were determined for: V417 Aql\n(F7V), LS Del (F5-8V), EF Dra (F8/9V), V829 Her (F6-9V), UV Lyn (G0V), BB Peg (F7V), and\nAQ Psc (F5-8V). Also, we determined the spectral types for three stars which were later found to\nbe pulsating: FH Cam (A8V), CU CVn (A7V), and CC Lyn (F0-2V).\n\n7.\n\nQUADRUPLE SYSTEMS\n\nFour quadruple systems were previously observed and analyzed at DDO: ET Boo, XY Leo,\nVW LMi, and TV UMi (Pribulla et al. 2006, 2007). Because of the high significance of these results\nfor our understanding of the stability of those tight quadruple systems and to improve the orbits of\nthe companion (not close) binaries, we continued acquisition of the spectra for these systems until\nthe closure of the observatory.\nNew RV observations of VW LMi were published in a subsequent dedicated paper (Pribulla et al.\n2008), while the data for the remaining systems are listed in Table 3. The corresponding orbital\nelements for ET Boo, XY Leo, and TV UMi are given in Table 4. For TV UMi, the new observations enabled us to determine the orbital period and the spectroscopic elements; we note that\nboth were indeterminable in the original paper (Pribulla et al. 2006) of the DDO series. The RVs\nof TV UMi and their best fits are shown in Fig. 6.\n\n\f– 20 –\n8.\n\nSUMMARY\n\nWith RV orbits for the last eight short-period binaries, this last paper of the DDO series\nbrings the number of the systems studied at the David Dunlap Observatory to 141. There have\nbeen 138 orbits contained in 14 of 15 papers of this series (the seventh paper (Rucinski 2002) did not\ncontain any new data) plus the separate investigations of W Crv (Rucinski & Lu 2000), AW UMa\n(Pribulla & Rucinski 2008) and GSC 1387 475 (Rucinski & Pribulla 2008).\nThis paper – in addition to the eight systems with the reliable orbits – summarizes all remaining, unpublished spectroscopic material obtained within the close-binary project. The included\nmaterial consists of systems with insufficient phase coverage, problematic systems (too faint, too\nsouthern for DDO or too complex multiples), and systems found or suspected to be pulsating variables. For most of the binaries of this paper, we are presenting the first spectroscopic observations.\nThe highlights of the current study are: (1) the discovery of four triple systems GO Cyg, V563 Lyr,\nDD Mon, V353 Peg; (2) the discovery of an under-luminous, early-type component in V857 Her;\n(3) detection of prograde-rotating ripples in BFs of CU CVn and V752 Mon indicating non-radial\npulsations.\nNumerous discoveries and reliable solutions of triple and quadruple systems show that the\nBF de-convolution approach utilizing the SVD method is a powerful and reliable technique which\ncan be applied not only to close binaries but also to other types of spectral line broadening due\nto geometrical effects. A good example of the power of this technique is our detection of nonradial oscillations in two pulsating variables, CU CVn and V752 Mon. As far as we know, the\nnon-radial pulsations have been detected only in the variability of line profiles of selected spectral\nlines (Zima et al. 2006) or in cross-correlation (CCF) studies; the latter obviously with a loss of\ninformation because the CCF technique reduces the effective spectral resolution. The only time the\nBF technique has been applied to a δ Sct star (EE Cam: Breger et al. (2007)) indicated a potential\nfor discovery of fine structure in line profiles, probably akin to the ripples seen in CU CVn and\nV752 Mon.\nWith the closure of the DDO observatory, this series has come to an end; only a dozen or so\nknown W UMa-type eclipsing binaries brighter than about V = 10 and potentially accessible from\nDDO remain unobserved. Our analysis for several stars presented here may feel incomplete and\nunsatisfactory. We still hope that the material presented will still lead to or will supplement future\nfollow-up observations of several binary stars described here.\nWe express our thanks to Christopher Capobianco, George Conidis, Yazya Ektiren, Kosmas\nGazeas, Tomasz Kwiatkowski, Piotr Ligeza, Stefan Mochnacki, Bogumil Pilecki, Wojtek Pych,\nMatt Rock, and Piotr Rogoziecki for spectroscopic observations at DDO.\nThis study has been funded by the Canadian Space Agency Space Enhancement Program\n(SSEP) with TP holding a Post-Doctoral Fellowship position at the University of Toronto. Support\n\n\f– 21 –\nfrom the Natural Sciences and Engineering Council of Canada to SMR and from the Polish Science\nCommittee (KBN grants PO3D 006 22 and PO3D 003 24) to WO is acknowledged with gratitude.\nThe travel of TP to Canada has been supported by a Slovak Academy of Sciences VEGA grant\n2/7010/7.\nThe research made use of the SIMBAD database, operated at the CDS, Strasbourg, France\nand accessible through the Canadian Astronomy Data Centre, which is operated by the Herzberg\nInstitute of Astrophysics, National Research Council of Canada. This research made also use of\nthe Washington Double Star (WDS) Catalog maintained at the U.S. Naval Observatory.\n\nREFERENCES\nAbhyankar, K.D., Panchatsaram, T. 1982, Bull. Astr. Soc. India, 10, 315\nBeltraminelli, N., Dalmazio, D., Remis, J., Manna, A. 1999, Inf. Bull. Var. Stars, No. 4696\nBessell, M. S. 1979, PASP, 91, 589\nBlake, R. M. 2002, PhD thesis, University of Toronto\nBrancewicz, H. K., Dworak, T.Z. 1980, Acta Astron., 30, 501\nBreger, M., Rucinski, S. M., Reegen, P. 2007, AJ, 134, 1994\nChisholm, J. R., Harnden, F. R., Schachter, J. F., Micela, G., Sciortino, S., Favata, F. 1999, AJ,\n117, 1845\nClausen, J.V., Helt, B.E., Olsen, E.H. 2001, A&A, 374, 980\nCox, A. 2000, Allen's Astrophysical Quantities, Springer Verlag\nCutispoto, G., Kürster, M., Messina, S., Rodono, M., Tagliaferri, G. 1997, A&A, 320, 586\nDaniel, S. A., Latham, D. W., Mathieu, R. D., Twarog, B. A. 1994, PASP, 106, 281\nD'Angelo, C., van Kerkwijk, M. H., Rucinski, S. M. 2006, AJ, 132, 650\nDuerbeck, H. W. 1997, Inf. Bull. Var. Stars, No. 4513\nDuerbeck, H. W., Rucinski, S. M. 2007, AJ, 133, 169\nDworak, S. W. 2006, Inf. Bull. Var. Stars, No. 5677\nEuropean Space Agency. 1997. The Hipparcos and Tycho Catalogues (ESA SP-1200)(Noordwijk:\nESA) (HIP)\nFehrenbach, C., Duflot, M., Mannone, C., Burnage, R., Genty, V. 1997, A&AS, 124, 255\n\n\f– 22 –\nFlorja, N. 1931, Perem. Zvezdy, 3, 86\nGeyer, E., Kippenhahn, R., Strohmeier, W. 1955, Kleine Veröff. Bamberg, No. 11\nGoecking, K. D., Duerbeck, H. W., Plewa, T., Kaluzny, J., Schertl, D., Weigelt, G., Flin, P. 1994,\nA&A, 289, 827\nGomez-Forrellad, J. M., Garcia-Melendo, E. 1996, Inf. Bull. Var. Stars, No. 4364\nGomez-Forrellad, J. M., Garcia-Melendo, E., Guarro-Flo, J., Nomen-Torres, J., Vidal-Sáinz, J.,\n1999, Inf. Bull. Var. Stars, No. 4702\nHe, J. J., Qian, S. B. 2007, Publ. Astr. Soc. Japan, 59, 1115\nHerczeg, T. J., 1993, PASP, 105, 911\nHill, G. 1979, Publ. DAO, 15, 297\nHoffmeister, C. 1929, Astron. Nachr., 236, 233\nHoffmeister, C. 1934, Astron. Nachr., 253, 195\nHoffmeister, C. 1935, Astron. Nachr., 255, 401\nHoffmeister, C. 1966, Astron. Nachr., 289, 139\nHøg, E., Fabricius, C., Makarov, V.V., Urban, S., Corbin, T., Wycoff, G., Bastian, U.,\nSchwekendiek, P., Wicenec, A. 2000, A&A, 355L, 27\nJohson, H.L. 1953, ApJ, 117, 356\nKazarovets, A. V., Samus, N. N., Durlevich, O. V., Frolov, M. S., Antipin, S. V., Kireeva, N. N.,\nPastukhova, E. N. 1999, Inf. Bull. Var. Stars, No. 4659\nKim, C.H., Lee, J.W., Kim, H.I., Kyung, J.M., Koch, R.H. 2003, AJ, 126, 1555\nKochukhov, O. 2004, A&A, 438, 219\nKrajci, T. 2006, Inf. Bull. Var. Stars, No. 5690\nKrajci, T. 2007, Inf. Bull. Var. Stars, No. 5806\nKreiner, J. M. 2004, Acta Astron., 54, 207\nLange, G. A. 1960, Astron. Tsir., No. 217\nMcLean, B. J., Hilditch, R. W. 1983, MNRAS, 203, 1\nvan Leeuwen, F. 2007, Hipparcos, the New Reduction of the Raw Data, Springer, 2007\n\n\f– 23 –\nLu, W., Rucinski, S. M. 1999, AJ, 118, 515 (PAPER I)\nMason, B. D., Wycoff, G. L., Hartkopf, W. I., Douglass, G. G., Worley, C. E. 2001a, AJ, 122, 3466\n(WDS)\nMason, B. D., Hartkopf W. I., Holdenried E. R., Rafferty T. J. 2001b, AJ, 121, 3224\nMilone, E. F., Stagg, C. R., Sugars, B. A., McVean, J. R., Schiller, S. J., Kallrath, J., Bradstreet,\nD. H. 1995, AJ, 109, 359\nMantegazza, L. 1997, A&A, 323, 845\nMantegazza, L. 2004, A&A, 415, 299\nOh, K.-D., Kang, Y. W., Ra, K. S., Park, H. S. 2000, Ap&SS, 271, 303\nOtero, S.A., Wils, P., Dubovský, P. A. 2004, Inf. Bull. Var. Stars, No. 5570\nPlatais, I. 1991, A&AS, 87, 69\nPribulla, T., Rucinski, S. M. 2006, AJ, 131, 2986\nPribulla, T., Rucinski, S. M. 2008, MNRAS, 386, 377\nPribulla, T., Rucinski, S.M., Lu, Wenxian, Mochnacki, S.W., Conidis, G., Blake, R.M., DeBond,\nH., Thomson, J.R., Pych, W., Ogloza, W., Siwak, M. 2006, AJ, 132, 769 (Paper XI)\nPribulla, T., Rucinski, S.M., Conidis, G., DeBond, H., Thomson, J.R., Gazeas, K., Ogloza, W.\n2007, AJ, 133, 1977 (Paper XII)\nPribulla, T., Baluďanský, D., Dubovský, P., Kudzej, I., Parimucha, Š., Siwak, M., Vaňko, M. 2008,\nMNRAS, 390, 798\nPribulla, T., Rucinski, S.M., DeBond, H., de Ridder, A., Karmo, T., Thomson, J.R., Croll, B.,\nOgloza, W., Pilecki, B., Siwak, M. 2009, AJ, in press (Paper XIV)\nPych, W. 2004, PASP, 116, 148\nQian, S.B., Liu, Q., Yang, Y., Gu, S., Huag, Z. 1997, A&AS, 125, 475\nQian, S.B., Liu, Q. 2000, A&A, 355, 171\nQian, S.B., Zhu, L.Y., Soonthornthum, B., Yuan, J.Z., Yang, Y.G., He, J.J. 2005, AJ, 130, 1206\nRucinski, S.M. 2001, AJ, 122, 1007\nRucinski, S.M. 2002, AJ, 124, 1746 (Paper VII)\nRucinski, S.M., Duerbeck, H.W. 1997, PASP, 109, 1340\n\n\f– 24 –\nRucinski, S. M., Lu, W. 2000, MNRAS, 315, 587\nRucinski, S.M., Pribulla, T. 2008, MNRAS, 388, 1831\nRucinski, S.M., Pribulla, T., van Kerkwijk, M.H. 2007, AJ, 134, 2353\nSchiller, S.J., Milone, E.F. 1988, AJ, 95, 1466\nSelam, S.O. 2004, A&A, 416, 1097\nSezer, C., Gülmen, O., Güdür, N. 1993, Ap&SS, 203, 121\nSkrutskie, M.F., Cutri, R.M., Stiening, R. et al. 2006, AJ, 131, 1163\nStruve, O. 1944, PASP, 56, 34\nSoydugan, F., Budding, E., Demircan, O., Erdem, A., Cicek, C., Özdemir, S., Bulut, I., Soydugan,\nE., Degirmenci, Ö.L., Bozkurt, Z., Yakut, K., Esenoglu, H., Hegedüs, T., Borkovits, T.,\nBı́ró, I.B. 2001, Inf. Bull. Var. Stars, No. 5153\nTanabe, H., Nakamura, T. 1957, Ann. Tokyo Astrophys. Obs., 15\nVidal-Sáinz, J., Gomez-Forrellad, J. M., Garcı́a, E., Wils, P., Lampens, P. 2002, Inf. Bull. Var.\nStars, No. 5331\nWils, P., Dworak, S.W. 2003, Inf. Bull. Var. Stars, No. 5425\nWolf, M., Molı́k, P., Hornoch, K., Šarounová, L. 2000, A&AS, 147, 243\nYamasaki, A., Okazaki, A., Nakamura, Y., Liu, Q., Yang, Y., Zhang, Z., Zhang, Y. 1990, AJ, 99,\n1218\nYang, Y.L., Liu, Q.Y. 2003, New A, 8, 465\nZima, W., Wright, D., Bentley, J., Cottrell, P.L., Heiter, U., Mathias, P., Poretti, E., Lehmann,\nH., Montemayor, T.J., Breger, M. 2006, A&A, 455, 235\n\nThis preprint was prepared with the AAS LATEX macros v5.2.\n\n\f– 25 –\nCaptions to figures:\nFig. 1.- Radial velocities of four systems with spectroscopic orbits, QX And, DY Cet, MR Del,\nHI Dra, are plotted in individual panels versus the orbital phases. The lines give the respective\ncircular-orbit (sine-curve) fits to the RVs. MR Del is triple system consisting of a close binary and\na slowly rotating single star. All systems, except MR Del, are contact binaries. The circles and\ntriangles correspond to components with velocities V1 and V2 , as listed in Table 1, respectively.\nThe component eclipsed at the minimum corresponding to T0 (as given in Table 2) is the one which\nshows negative velocities for the phase interval 0.0 − 0.5 and which is the more massive one. Short\nmarks in the lower parts of the panels show phases of available observations which were not used\nin the solutions because of the spectral line blending or poor quality of data.\nFig. 2.- Radial velocities for the second group of systems with spectroscopic orbits, DD Mon,\nV868 Mon, ER Ori, and Y Sex. While V868 Mon is a contact binary, the remaining systems are\ntriple ones containing a contact or a close binary.\nFig. 3.- The broadening functions (BFs) for all systems where RV could be measured, as discussed\nin Sections 2 and 3, in the constellation order. The BFs were selected for orbital phases close to\n0.25 or 0.75. The phases are marked by numbers in the individual panels. Additional components\nto the close binaries, MR Del, V563 Lyr, DD Mon, ER Ori, Y Sex, and LV Vir are strong and\nclearly visible. All panels have the same horizontal range, −500 to +500 km s−1 .\nFig. 4.- The broadening functions (BFs) for problematic systems GO Cyg, V857 Her, and\nV353 Peg. For V857 Her broadening functions determined from average spectrum obtained either using the 2160 lines/mm grating and the JY2 chip or the 1800 lines/mm grating and the THX\nchip are shown. In the case of V353 Peg, the presence of the binary is demonstrated by the phase\nchanges of its faint signature between the two orbital quadratures.\nFig. 5.- Grayscale plots for two stars, CU CVn and V752 Mon, very apparently containing\npulsating components. The diagonally oriented \"ripples\" in both cases move in the direction of\nthe rotational motion. The BFs are sorted in time; for V752 Mon, this applies to individual nights\nwhich are separated by thin horizontal lines. One bin in the case of CU CVn corresponds to about\n7 minutes, while for V752 Mon we used longer exposures and one bin corresponds to 17-18 minutes.\nFig. 6.- Radial velocities of the 3rd and 4th components of the quadruple system TV UMi. The\ncorresponding spectroscopic orbital solutions are shown by continuous lines.\n\n\f– 26 –\n\nVr (km/s)\n\n300\n200\n\nQX And\n\nDY Cet\n\nMR Del\n\nHI Dra\n\n100\n0\n\n-100\n-200\n-300\n\nVr (km/s)\n\n300\n200\n100\n0\n\n-100\n-200\n-300\n\n0.0\n\n0.2\n\n0.4\n\n0.6\n\nPhase\n\n0.8\n\n1.0\n\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\nPhase\n\nFig. 1.- Radial velocities of four systems with spectroscopic orbits, QX And, DY Cet, MR Del,\nHI Dra, are plotted in individual panels versus the orbital phases. The lines give the respective\ncircular-orbit (sine-curve) fits to the RVs. MR Del is triple system consisting of a close binary and\na slowly rotating single star. All systems, except MR Del, are contact binaries. The circles and\ntriangles correspond to components with velocities V1 and V2 , as listed in Table 1, respectively.\nThe component eclipsed at the minimum corresponding to T0 (as given in Table 2) is the one which\nshows negative velocities for the phase interval 0.0 − 0.5 and which is the more massive one. Short\nmarks in the lower parts of the panels show phases of available observations which were not used\nin the solutions because of the spectral line blending or poor quality of data.\n\n\f– 27 –\n\n300\n\nVr (km/s)\n\nV868 Mon\n\nDD Mon\n\n200\n100\n0\n\n-100\n-200\n-300\n300\n\nVr (km/s)\n\nY Sex\n\nER Ori\n\n200\n100\n0\n\n-100\n-200\n-300\n\n0.0\n\n0.2\n\n0.4\n\n0.6\n\nPhase\n\n0.8\n\n1.0\n\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\nPhase\n\nFig. 2.- Radial velocities for the second group of systems with spectroscopic orbits, DD Mon,\nV868 Mon, ER Ori, and Y Sex. While V868 Mon is a contact binary, the remaining systems are\ntriple ones containing a contact or a close binary.\n\n\f– 28 –\n\n1.0\n0.8\n\nQX And\n0.239\n\nTT Cet\n0.703\n\nHI Dra\n0.266\n\nCW Lyn\n\nAA Cet\n0.314\n\nDY Cet\n0.732\n\nMR Del\n0.250\n\n0.6\n0.4\n0.2\n0.0\n1.0\n0.8\n\nV563 Lyr\n0.383\n\nDD Mon\n0.720\n\nY Sex\n0.257\n\nLV Vir\n0.816\n\nV868 Mon\n0.766\n\n0.6\n0.4\n0.2\n0.0\n1.0\n0.8\n\nCW Sge\n0.287\n\nER Ori\n0.267\n\nMW Vir\n0.471\n\n0.6\n0.4\n0.2\n0.0\n-400 -200\n\n0\n\n200 400\n\nVr (km/s)\n\n-400 -200\n\n0\n\n200 400\n\nVr (km/s)\n\n-400 -200\n\n0\n\n200 400\n\nVr (km/s)\n\n-400 -200\n\n0\n\n200 400\n\nVr (km/s)\n\n-400 -200\n\n0\n\n200 400\n\nVr (km/s)\n\nFig. 3.- The broadening functions (BFs) for all systems where RV could be measured, as discussed\nin Sections 2 and 3, in the constellation order. The BFs were selected for orbital phases close to\n0.25 or 0.75. The phases are marked by numbers in the individual panels. Additional components\nto the close binaries, MR Del, V563 Lyr, DD Mon, ER Ori, Y Sex, and LV Vir are strong and\nclearly visible. All panels have the same horizontal range, −500 to +500 km s−1 .\n\n\f– 29 –\n\n1.2\n1.0\n\nV857 Her\n\nGO Cyg\n0.514\n\n0.8\n0.6\nTHX\n\n0.4\n0.2\n\nJY2\n\n0.0\n1.2\n1.0\n\nV353 Peg\n0.734\n\nV353 Peg\n0.218\n\n0.8\n0.6\n0.4\n0.2\n0.0\n-400 -200 0\n\n200 400 -400 -200 0\n\nVr (km/s)\n\n200 400\n\nVr (km/s)\n\nFig. 4.- The broadening functions (BFs) for problematic systems GO Cyg, V857 Her, and\nV353 Peg. For V857 Her broadening functions determined from average spectrum obtained either using the 2160 lines/mm grating and the JY2 chip or the 1800 lines/mm grating and the THX\nchip are shown. In the case of V353 Peg, the presence of the binary is demonstrated by the phase\nchanges of its faint signature between the two orbital quadratures.\n\n\f– 30 –\n\nFig. 5.- Grayscale plots for two stars, CU CVn and V752 Mon, very apparently containing\npulsating components. The diagonally oriented \"ripples\" in both cases move in the direction of\nthe rotational motion. The BFs are sorted in time; for V752 Mon, this applies to individual nights\nwhich are separated by thin horizontal lines. One bin in the case of CU CVn corresponds to about\n7 minutes, while for V752 Mon we used longer exposures and one bin corresponds to 17-18 minutes.\n\n\f– 31 –\n\nVr (km/s)\n\n120\n100\n80\n60\n40\n20\n0\n-20\n-40\n-60\n-80\n-100\n-120\n-140\n-0.1 0.0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1.0 1.1\n\nPhase\nFig. 6.- Radial velocities of the 3rd and 4th components of the quadruple system TV UMi. The\ncorresponding spectroscopic orbital solutions are shown by continuous lines.\n\n\f– 32 –\n\nTable 1.\n\nRadial velocity observations of close binary stars (the full table is available only in the\nelectronic form)\nTarget\n\nHJD–2,400,000\n\nQX\nQX\nQX\nQX\nQX\nQX\nQX\nQX\nQX\nQX\n\n51433.6619\n51433.6788\n51433.7116\n51433.7274\n51433.7453\n51433.7620\n51433.7788\n51433.7958\n51433.8121\n51433.8294\n\nAnd\nAnd\nAnd\nAnd\nAnd\nAnd\nAnd\nAnd\nAnd\nAnd\n\nV1\n[km s−1 ]\n\n−49.23\n−54.06\n0.00\n0.00\n0.00\n0.00\n0.00\n45.05\n66.23\n70.40\n\nW1\n\n1.00\n1.00\n0.00\n0.00\n0.00\n0.00\n0.00\n1.00\n1.00\n1.00\n\nV2\n[km s−1 ]\n\n225.82\n202.40\n0.00\n0.00\n0.00\n0.00\n0.00\n−135.18\n−168.90\n−187.34\n\nW2\n\nPhase\n\n1.00\n1.00\n0.00\n0.00\n0.00\n0.00\n0.00\n1.00\n1.00\n1.00\n\n0.2814\n0.3224\n0.4020\n0.4403\n0.4837\n0.5242\n0.5650\n0.6062\n0.6458\n0.6878\n\nNote. - The table gives the RVs Vi for observations of close binary stars described in Sections 2 and 3 of the paper, in the order of constellation. The first 10\nrows of the table for a typical program star, QX And, are shown. Observations\nleading to entirely inseparable broadening function peaks are given zero weight;\nthese observations may be eventually used in more extensive modeling of broadening functions. Zero weights were assigned to observations of marginally visible\npeaks of the secondary (sometimes even primary) component. The RVs designated\nas V1 correspond to the more massive component; it was always the component\neclipsed during the minimum at the epoch T0 (this does not always correspond\nto the deeper minimum and photometric phase 0.0). The phases correspond to\nspectroscopic T0 given in Table 2 with the exception of the following cases taken\neither from the Hipparcos or (Kreiner 2004) databases:\nTT Cet: 52500.1309 + 0.4859541 × E\nAA Cet: 52500.3652 + 0.5361685 × E\nCW Lyn: 48500.457 + 0.812389 × E\nV563 Lyr: 52500.273 + 0.5776407 × E,\nCW Sge: 52500.567 + 0.6603633 × E,\nLV Vir: 52500.0315 + 0.4094453 × E,\nMW Vir: 48500.3032 + 0.493078 × E (Hipparcos T0 + P/2 and 2 × P ).\n\n\f– 33 –\n\nTable 2.\n\nSpectroscopic orbital elements for eight binaries described in Sec. 2\n\nName\n\nType\nSp. type\n\nQX And\n\nEW(W?)\n(F8)\n\nDY Cet\n\nEW(A)\n(F5V)\n\nMR Del\nHI Dra\n\nOther names\n\nV0\n\nK1\nK2\n\nǫ1\nǫ2\n\nT0 – 2,400,000\n(O − C)(d) [E]\n\nP (days)\n(M1 + M2 ) sin3 i\n\nq\n\n+4.07(1.17)\n\n67.92(1.82)\n221.73(1.84)\n\n8.18\n11.39\n\n51442.2015(11)\n+0.0045 [−2,566.5]\n\n0.4121701\n1.038(22)\n\n0.306(9)\n\nHD16515\nBD−14 495\n\n+15.55(1.49)\n\n90.84(2.11)\n255.40(2.28)\n\n6.04\n12.06\n\n52594.3317(12)\n−0.0005 [+214.0]\n\n0.440790(6)\n1.896(40)\n\n0.356(9)\n\nEB\n(K2V+K6V?)\n\nHD195434\nBD+04 4470\n\n−49.76(0.79)\n\n135.74(1.27)\n148.32(1.27)\n\n3.74\n4.35\n\n54469.1682(8)\n+0.0015 [+3,774.0]\n\n0.5216899\n1.239(18)\n\n0.915(12)\n\nEW(A)\n(F0-2)\n\nHD171848\nBD+58 1824\n\n−12.73(0.69)\n\n52.83(1.08)\n211.49(1.08)\n\n2.30\n7.43\n\n54622.3721(10)\n+0.0228 [+10,247.5]\n\n0.597418\n1.143(16)\n\n0.250(5)\n\nDD Mon\n\nEB\n(G0)\n\nHD292319\n\n+20.21(1.87)\n\n133.32(3.06)\n198.85(3.18)\n\n7.97\n8.87\n\n52642.7453(21)\n−0.0022 [+251.0]\n\n0.568020\n2.157(65)\n\n0.670(19)\n\nV868 Mon\n\nEW\n(A5)\n\nBD−02 2221\n\n+78.08(1.30)\n\n91.21(1.83)\n244.67(2.22)\n\n6.46\n14.81\n\n54157.0662(18)\n−0.0012 [+1,724.0]\n\n0.637705\n2.504(52)\n\n0.373(8)\n\nER Ori\n\nEW(W)\nF7/8\n\nBD−08 1050\nHIP24156\n\n+49.45(1.65)\n\n147.98(2.30)\n225.48(2.35)\n\n5.50\n6.93\n\n54393.4271(7)\n+0.0099 [+4,471.5]\n\n0.4234034\n2.285(45)\n\n0.656(12)\n\nY Sex\n\nEW(A)\nF5/6\n\nHD87079\nBD+01 2394\n\n+6.78(1.64)\n\n54.96(2.30)\n281.94(2.86)\n\n7.69\n18.63\n\n54315.4217(13)\n+0.0013 [+4,324.0]\n\n0.4198199\n1.663(45)\n\n0.195(8)\n\nNote. - The spectral types given in column 2 relate to the combined spectral type of all components in a system; they are given in parentheses\nif taken from the literature, otherwise they are new. The convention of naming the binary components in the table is that the more massive\nstar is marked by the subscript \"1\", so that the mass ratio is defined to be always q ≤ 1. The standard errors of the circular solutions in the\ntable are expressed in units of last decimal places quoted; they are given in parentheses after each value. The center-of-mass velocities (V0 ), the\nvelocity amplitudes (Ki ) and the standard unit-weight errors of the solutions (ǫ) are all expressed in km s−1 . The spectroscopically determined\nmoments of primary or secondary minima are given by T0 (correspond approximately to the average Julian date of the run); the corresponding\n(O − C) deviations (in days) have been calculated from the available prediction on primary minimum, as given in the text, using the assumed\nperiods and the number of epochs given by [E]. The values of (M1 + M2 ) sin3 i are in the solar mass units.\nEphemerides (HJDmin – 2,400,000 + period in days) used for the computation of the (O − C) residuals:\nQX And: 52500.0316 + 0.4121701\nDY Cet: 52500.0031 + 0.4407903\nMR Del: 52500.309 + 0.5216899\nHI Dra: 48500.3186 + 0.597417\nDD Mon: 52500.1745 + 0.568020\nV868 Mon: 53057.664 + 0.637705\nER Ori: 52500.1689 + 0.4234034\nY Sex: 52500.1192 + 0.4198199\n\n\f– 34 –\n\nTable 3. Radial velocity observations of the third and fourth components of multiple systems\n(the full table is available only in electronic form)\nTarget\n\nET Boo\nET Boo\nET Boo\nMR Del\nMR Del\nMR Del\nMR Del\nMR Del\nMR Del\nMR Del\n\nHJD–2,400,000\n\n53812.95453\n53842.77197\n53843.74628\n54630.82080\n54638.68821\n54638.69974\n54638.71214\n54638.72308\n54638.73503\n54638.74573\n\nV3\n[km s−1 ]\n\nV4\n[km s−1 ]\n\n−77.29\n\n48.18\n\n−45.12\n−49.87\n−50.06\n−50.28\n−50.20\n−52.02\n−49.74\n−52.78\n\n17.01\n\nNote. - The table gives the RVs Vi for the third\nand fourth components. The 10 rows of the table for\nthe quadruple system, ET Boo, and the triple system\nMR Del are shown. Observations of quadruple systems leading to entirely inseparable broadening function peaks of components of the second binary have\nbeen omitted from the table and not used in computation of the orbits (the heliocentric Julian dates are,\nhowever, given). The first three RV observations of\nTV UMi (at HJD 2 452 694) were found to be incorrect in the original publication (Pribulla et al. 2006).\nCorrect values for RV of 3rd and 4th components are\ngiven here.\n\n\f– 35 –\n\nTable 4.\n\nUpdated spectroscopic orbital elements of the second (non-eclipsing) binaries in the\nquadruple systems ET Boo, XY Leo, and TV UMi .\nParameter\n\nerror\n\nXY Leo\nP34 [days]\nT0 [HJD]\nV0 [km s−1 ]\nK3 [km s−1 ]\nf (m) [M⊙ ]\n\n0.8047497\n2 453 882.1270\n−39.97\n46.44\n0.00839\n\n0.0000042\n0.0008\n0.22\n0.34\n0.00018\n\n31.52135\n0.738\n2.952\n2 452 930.737\n−24.09\n40.17\n57.31\n0.928\n\n0.00045\n0.011\n0.026\n0.027\n0.43\n0.66\n0.67\n0.052\n\n31.18836\n0.757\n3.499\n2 453 192.994\n−21.12\n59.84\n72.46\n2.084\n\n0.00037\n0.006\n0.013\n0.016\n0.26\n0.52\n0.53\n0.063\n\nET Boo\nP34 [days]\ne34\nω [rad]\nT0 [HJD]\nV0 [km s−1 ]\nK3 [km s−1 ]\nK4 [km s−1 ]\n(M3 + M4 ) sin3 i [M⊙ ]\nTV UMi\nP34 [days]\ne34\nω [rad]\nT0 [HJD]\nV0 [km s−1 ]\nK3 [km s−1 ]\nK4 [km s−1 ]\n(M3 + M4 ) sin3 i [M⊙ ]\n\nNote. - The table gives spectroscopic elements of\nthe second binaries in the quadruple systems: orbital\nperiod (P34 ), eccentricity (e34 ), longitude of the periastron passage (ω), time of the periastron passage\n(T0 ), systemic velocity (V0 ), semi-amplitudes of the RV\nchanges (K3 , K4 ). The corresponding mass ratio q, and\ntotal mass ((M3 + M4 ) sin3 i) are given for ET Boo, and\nTV UMi where both components of the second binary\ncould be measured. For the single-lined non-eclipsing\nbinary in XY Leo, only f (m) is given. The orbit of the\nsecond binary in XY Leo is circular, thus e34 = 0.00\nand ω34 = π/2.\n\n\f– 36 –\n\nTable 5. Low-amplitude variable stars found to be pulsating or of unknown type.\nTarget\n\nFH Cam\nCU CVn\nV364 Cep\nV459 Cep\nV2129 Cyg\nGW Dra\nIN Dra\nHV Eri\nPV Gem\nV927 Her\nUX LMi\nCC Lyn\nV752 Mon\nV1359 Ori\nV579 Per\nGG UMa\nGS UMa\n\nRV\n[km s−1 ]\n\n3.0\n−4.1\n+8.9\n+1.2\n−22\nvar?\nvar?\n−8.1\nvar?\n−21\nvar\nvar\n23\n−20.8\n−3.5\n−16.5\n−3.4\n\nv sin i\n[km s−1 ]\n\n45\n155\n153\n97\n54\n<15\n147\n83\n135:\n<15\n60:\n<15\n159\n60\n228\n60\n38\n\nSp. type\n\nA8\nA7\n(A0)\n(F7)\n(F8)\n(F2)\n(F0)\n(F4)\nF5-7\n(F4)\n(F7)\nF0-2\n(F0)\n(F7)\nA4/5\n(F6)\n(F5)\n\n# Obs.\n\n36/1\n18/1\n10/1\n3/1\n1/1\n4/2\n5/3\n1/1\n10/2\n1/1\n3/3\n62/4\n75/7\n2/1\n65/6\n2/1\n4/1\n\n∆Hp\n\n0.07\n0.08\n0.05\n0.11\n0.10\n0.06\n0.14\n0.07\n0.17\n0.12\n0.10\n0.05\n0.08\n0.10\n0.11\n0.07\n\nPeriod\n[days]\n\n0.272478\n0.135667\n0.178805\n0.154876\n0.126184\n0.137171\n0.210948\n0.188065\n0.130528\n0.150638\n0.354622\n0.231451\n0.182158\n0.232812\n0.134841\n0.164007\n\nClass 1\n\nEW or puls.\npuls.\npuls.\npuls.\nEW or puls.\nEW or puls.\npuls.\nEW\nEW\nEW or puls.\nEW\npuls.\npuls.\n\nClass 2\n\npuls.\npuls.\npuls.\npuls.\nEW or puls.\npuls.\npuls.\nEW or puls.\npuls.\npuls.\npuls. ?\npuls + EW ?\npuls + EW ?\npuls. ?\npuls.\npuls.\npuls.\n\nNote. - The table gives the mean RVs for stars which are very probably pulsating variables or for multiple\nsystems with one dominant variable component. Projected rotational velocities are given when v sin i > 30 km s−1 .\nSpectral types in parentheses have been taken from the literature, otherwise they are from our classification spectra.\nThe extent of our observations can be judged from the column \"#Obs\" where the number of observations is given\nas: No. of spectra/No. of nights. The Hipparcos amplitude, ∆Hp (95th percentile – 5th percentile) and the\nvariability period are taken from the Hipparcos photometry Annex. For three systems, FH Cam, CU CVn, and\nCC Lyn, originally classified as β Lyrae variables, this period corresponds to the double wave; for those stars, if\ndefinitely shown to be pulsating variables, one half of the Hipparcos period should be taken. The last two columns\n\"Class 1\" and \"Class 2\", give the variability classification following Duerbeck (1997) and our \"best effort\" estimate,\nrespectively. Stars known to be members of visual pairs in Mason et al. (2001a) are: HV Eri (the components about\n30′′ apart), PV Gem (the brighter component of a very wide visual pair, about 2′ apart), CC Lyn (V = 6.62 + 8.26,\nθ = 88◦ , ρ = 2.2′′ ), and V752 Mon (V = 7.47 + 7.95, θ = 24◦ , ρ = 1.7′′ ). The pulsating star V364 Cep was\nobserved by us by mistake; it is the only variable listed in this table which was not discovered by the Hipparcos\nsatellite mission.\n\n\f– 37 –\n\nTable 6.\n\nRadial velocity observations of single and pulsating stars (the full table is available only\nin electronic form).\nTarget\n\nFH\nFH\nFH\nFH\nFH\nFH\nFH\nFH\nFH\nFH\n\nCam\nCam\nCam\nCam\nCam\nCam\nCam\nCam\nCam\nCam\n\nHJD–2,400,000\n\nRV\n[km s−1 ]\n\nv sin i\n[km s−1 ]\n\n51658.65601\n51658.71993\n51658.72485\n51658.72974\n51658.73760\n51658.74251\n51658.74740\n51658.75230\n51658.76016\n51658.76505\n\n1.32\n3.12\n3.43\n5.44\n2.52\n2.73\n1.98\n2.88\n1.55\n2.46\n\n44.75\n42.96\n44.44\n45.62\n44.71\n43.88\n43.47\n44.33\n43.53\n44.58\n\nNote. - Projected rotational velocity, v sin i is\ngiven only for rapidly rotating stars with v sin i > 30\nkm s−1 . For V752 Mon BFs determined from observations around 6290Å lead to very scattered RVs - those\nare not given in the table\n\n\f"}