{"id": "http://arxiv.org/abs/0710.2564v1", "guidislink": true, "updated": "2007-10-12T23:23:23Z", "updated_parsed": [2007, 10, 12, 23, 23, 23, 4, 285, 0], "published": "2007-10-12T23:23:23Z", "published_parsed": [2007, 10, 12, 23, 23, 23, 4, 285, 0], "title": "Slonczewski windmill with dissipation and asymmetry", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.4735%2C0710.2094%2C0710.5620%2C0710.0827%2C0710.2373%2C0710.2265%2C0710.0674%2C0710.5150%2C0710.3052%2C0710.5039%2C0710.1526%2C0710.0300%2C0710.1106%2C0710.2430%2C0710.5900%2C0710.1930%2C0710.4804%2C0710.5327%2C0710.1407%2C0710.5533%2C0710.1543%2C0710.4961%2C0710.3989%2C0710.0051%2C0710.4978%2C0710.3879%2C0710.5324%2C0710.0752%2C0710.1444%2C0710.2559%2C0710.3276%2C0710.3452%2C0710.2545%2C0710.2171%2C0710.4312%2C0710.1627%2C0710.1849%2C0710.0557%2C0710.3110%2C0710.3894%2C0710.1774%2C0710.5908%2C0710.5204%2C0710.3312%2C0710.1312%2C0710.2885%2C0710.4651%2C0710.1493%2C0710.2020%2C0710.0842%2C0710.5732%2C0710.0398%2C0710.1626%2C0710.2970%2C0710.5420%2C0710.0571%2C0710.1776%2C0710.0498%2C0710.2874%2C0710.2911%2C0710.5847%2C0710.5175%2C0710.2564%2C0710.1672%2C0710.2106%2C0710.4930%2C0710.1621%2C0710.4269%2C0710.1368%2C0710.1902%2C0710.2342%2C0710.3071%2C0710.3487%2C0710.1874%2C0710.1510%2C0710.4986%2C0710.5137%2C0710.4466%2C0710.4339%2C0710.0565%2C0710.3111%2C0710.3667%2C0710.2039%2C0710.3347%2C0710.5136%2C0710.0666%2C0710.2126%2C0710.3598%2C0710.2165%2C0710.0473%2C0710.1599%2C0710.2100%2C0710.2513%2C0710.2431%2C0710.1187%2C0710.1575%2C0710.5005%2C0710.0688%2C0710.5125%2C0710.3354%2C0710.4109&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Slonczewski windmill with dissipation and asymmetry"}, "summary": "J. Slonczewski invented spin-transfer effect in layered systems in 1996.\nAmong his first predictions was the regime of ``windmill motion'' of a\nperfectly symmetric spin valve where the magnetizations of the layers rotate in\na fixed plane keeping the angle between them constant. Since ``windmill'' was\npredicted to happen in the case of zero magnetic anisotropy, while in most\nexperimental setups the anisotropy is significant, the phenomenon was not a\nsubject of much research. However, the behavior of the magnetically isotropic\ndevice is related to the interesting question of current induced ferromagnetism\nand is worth more attention. Here we study the windmill regime in the presence\nof dissipation, exchange interaction, and layer asymmetry. It is shown that the\nwindmill rotation is almost always destroyed by those effects, except for a\nsingle special value of electric current, determined by the parameters of the\ndevice.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.4735%2C0710.2094%2C0710.5620%2C0710.0827%2C0710.2373%2C0710.2265%2C0710.0674%2C0710.5150%2C0710.3052%2C0710.5039%2C0710.1526%2C0710.0300%2C0710.1106%2C0710.2430%2C0710.5900%2C0710.1930%2C0710.4804%2C0710.5327%2C0710.1407%2C0710.5533%2C0710.1543%2C0710.4961%2C0710.3989%2C0710.0051%2C0710.4978%2C0710.3879%2C0710.5324%2C0710.0752%2C0710.1444%2C0710.2559%2C0710.3276%2C0710.3452%2C0710.2545%2C0710.2171%2C0710.4312%2C0710.1627%2C0710.1849%2C0710.0557%2C0710.3110%2C0710.3894%2C0710.1774%2C0710.5908%2C0710.5204%2C0710.3312%2C0710.1312%2C0710.2885%2C0710.4651%2C0710.1493%2C0710.2020%2C0710.0842%2C0710.5732%2C0710.0398%2C0710.1626%2C0710.2970%2C0710.5420%2C0710.0571%2C0710.1776%2C0710.0498%2C0710.2874%2C0710.2911%2C0710.5847%2C0710.5175%2C0710.2564%2C0710.1672%2C0710.2106%2C0710.4930%2C0710.1621%2C0710.4269%2C0710.1368%2C0710.1902%2C0710.2342%2C0710.3071%2C0710.3487%2C0710.1874%2C0710.1510%2C0710.4986%2C0710.5137%2C0710.4466%2C0710.4339%2C0710.0565%2C0710.3111%2C0710.3667%2C0710.2039%2C0710.3347%2C0710.5136%2C0710.0666%2C0710.2126%2C0710.3598%2C0710.2165%2C0710.0473%2C0710.1599%2C0710.2100%2C0710.2513%2C0710.2431%2C0710.1187%2C0710.1575%2C0710.5005%2C0710.0688%2C0710.5125%2C0710.3354%2C0710.4109&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "J. Slonczewski invented spin-transfer effect in layered systems in 1996.\nAmong his first predictions was the regime of ``windmill motion'' of a\nperfectly symmetric spin valve where the magnetizations of the layers rotate in\na fixed plane keeping the angle between them constant. Since ``windmill'' was\npredicted to happen in the case of zero magnetic anisotropy, while in most\nexperimental setups the anisotropy is significant, the phenomenon was not a\nsubject of much research. However, the behavior of the magnetically isotropic\ndevice is related to the interesting question of current induced ferromagnetism\nand is worth more attention. Here we study the windmill regime in the presence\nof dissipation, exchange interaction, and layer asymmetry. It is shown that the\nwindmill rotation is almost always destroyed by those effects, except for a\nsingle special value of electric current, determined by the parameters of the\ndevice."}, "authors": ["Ya. B. Bazaliy"], "author_detail": {"name": "Ya. B. Bazaliy"}, "author": "Ya. B. Bazaliy", "arxiv_comment": "3 pages, 1 figure", "links": [{"href": "http://arxiv.org/abs/0710.2564v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0710.2564v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0710.2564v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0710.2564v1", "journal_reference": null, "doi": null, "fulltext": "Slonczewski windmill with dissipation and asymmetry\nYa. B. Bazaliy1, 2\n\narXiv:0710.2564v1 [cond-mat.mtrl-sci] 12 Oct 2007\n\n1\n\nDepartment of Physics and Astronomy, University of South Carolina, Columbia, South Carolina 29208, USA\n2\nInstitute of Magnetism, National Academy of Science of Ukraine,\n36-b Vernadsky Boulevard, Kyiv 03142, Ukraine.\n(Dated: October, 2007)\nJ. Slonczewski invented spin-transfer effect in layered systems in 1996. Among his first predictions\nwas the regime of \"windmill motion\" of a perfectly symmetric spin valve where the magnetizations\nof the layers rotate in a fixed plane keeping the angle between them constant. Since \"windmill\"\nwas predicted to happen in the case of zero magnetic anisotropy, while in most experimental setups\nthe anisotropy is significant, the phenomenon was not a subject of much research. However, the\nbehavior of the magnetically isotropic device is related to the interesting question of current induced\nferromagnetism and is worth more attention. Here we study the windmill regime in the presence\nof dissipation, exchange interaction, and layer asymmetry. It is shown that the windmill rotation\nis almost always destroyed by those effects, except for a single special value of electric current,\ndetermined by the parameters of the device.\nPACS numbers: 72.25.-b, 85.75.-d\n\nSpin-transfer effect as a method of controlling magnetic dynamics by electric current was suggested by\nBerger1 for domain wall motion and by Slonczewski2 for\nspin-valves and multilayer structures. The unusual property of spin-transfer interaction found in Ref. 2 was the\ntendency of current induced torques to rotate magnetic\nmoments of both spin valve layers in the same direction,\nmuch like the oncoming wind rotates the wings of a windmill (Fig. 1). If one assumes that layers have no magnetic\nanisotropy (crystalline or shape), are identical, and there\nis no RKKY exchange or dipole-dipole interaction between them, the resulting motion is a perpetual rotation\nof magnetic moments m1 and m2 in clockwise or counterclockwise direction, depending on the direction of electric\ncurrent I passing through the spin valve. We will call this\ntype of motion a Slonczewski \"windmill regime\".\nSince actual spin-transfer devices have significant magnetic shape anisotropy, normally the windmill regime is\nnot realized. Instead, switching between different preferred magnetic configurations was predicted2 and is intensively studied since then both experimentally and theoretically. However, the windmill regime still constitutes\nan interesting problem due to the following. Spin-transfer\neffect can be viewed as reciprocal to the giant magne-\n\nm2\n\nm1\n\nI\nA\n\nB\n\nFIG. 1: (A) spin-transfer torques acting on two magnetizations tend to rotate them in the same direction. Magnetic\nlayers are shaded. (B) \"windmill\" mechanical analogy.\n\ntoresistance effect.3 The resistance of a spin valve is minimal in the parallel configuration m1 ↑↑ m2 . Thus one\ncan hypothesize, that in response to a current pumped\nthrough the valve the magnetizations will tend to assume this minimal resistance configuration in order to\nmake electron flow easier. More generally, an idea arises\nthat a current passing through a metal with paramagnetic impurities will tend to orient them parallel and create some sort of current-induced ferromagnetism.4,5 The\ntwo-magnet device is the minimal model where the validity of this idea can be tested. We study the behavior of\nsuch a device with arbitrary parameters, except for the\nrestriction of zero magnetic anisotropy. The results give\na generalized picture of the Slonczewski windmill regime,\nand shed some light on the possibility of current-induced\nferromagnetism.\nWe use the single domain approximation. The magnetic moments mi (i = 1, 2) of the layers have timeindependent absolute values mi and variable directions\ndefined by a unit vector ni (t). The LLG equations in\nterms of mi read2,6\nα1\n[m1 × ṁ1 ] ,\nm1\nα2\n[m2 × ṁ2 ] ,\n= γ (−Tex + τ 2 ) +\nm2\n\nṁ1 = γ (Tex + τ 1 ) +\n\n(1)\n\nṁ2\n\n(2)\n\nwhere Tex is the exchange torque, τ 1,2 are spin-transfer\ntorques, γ is the gyromagnetic ratio, and α1,2 are Gilbert\ndamping constants of the magnets. Note that in conventional experiments m2 is fixed by magnetic anisotropy,\nwhile m1 can rotate under the influence of spin-transfer\ntorque. Magnet number one is then called a \"free layer\"\nand magnet number two is called a \"fixed layer\", or spin\npolarizer. In the present investigation no restrictions are\nimposed on m2 and both magnetic moments are treated\non equal footing.\nThe exchange torque acting on m1 is given by Tex =\nJ[m2 ×m1 ] (J > 0 corresponds to ferromagnetic coupling\n\n\f2\nbetween the moments). The exchange torque acting on\nm2 is −Tex since we are dealing with an internal interaction between two moments.\nThe spin-transfer torques τ 1,2 are given by\nτ̇ 1 = u1 * [n1 × [n2 × n1 ]] ,\nτ̇ 2 = −u2 * [n2 × [n1 × n2 ]] ,\n\n(3)\n(4)\n\nwith torque strengths\nui =\n\nh̄ I\ngi [(n1 * n2 )] .\n2e\n\n(5)\n\nHere I is the electric current flowing form magnet\n2 to magnet 1, e is the (negative) electron charge,\nand gi [(n1 * n2 )] are material and device specific spinpolarization factors. For negligible spin-relaxation in\nthe non-magnetic spacer between the magnets one has\ng1 = g2 (see Ref. 2). Note that both u1,2 are positive\nwhen electrons flow from magnet 2 to magnet 1. The minus sign in front of the right hand side of Eq. (4) reflects\nthe symmetry of spin-transfer torque.2\nFirst, we rewrite Eqs. (1) and (2) so that time derivatives are on the left hand side only. Defining T1 =\nTex + τ 1 , T2 = −Tex + τ 2 , we get for i = 1, 2\n\u0012\n\u0013\nαi\n(1 + α2i )ṁi = γ Ti +\n[mi × Ti ] .\n(6)\nmi\nIt is convenient to introduce vectors ν = [m2 × m1 ], l1 =\n[m1 × [m2 × m1 ]], l2 = [m2 × [m1 × m2 ]] . Then\nṁ1 = A1 ν + B1 l1 ,\nṁ2 = −A2 ν + B2 l2 ,\n\n(7)\n\nwith\n\u0012\n\u0013\nα1 u1\nγ\nJ\n−\n,\n1 + α21\nm1 m2\n\u0012\n\u0013\nγ\nα2 u2\n=\nJ\n+\n,\n1 + α22\nm1 m2\n\u0012\n\u0013\nu1\nγ\nα\nJ\n+\n,\n=\n1\n(1 + α21 )m1\nm1 m2\n\u0012\n\u0013\nγ\nu2\n=\nα\nJ\n−\n.\n2\n(1 + α22 )m2\nm1 m2\n\nA1 =\nA2\nB1\nB2\n\nṁi = [ω × mi ]\n\n(8)\n\nConsider now the total magnetic moment of the system\nM = m1 + m2 and calculate the derivative dM2 /dt. Using Eq. (6) and the properties (mi * li ) = 0, ((m1 + m2 ) *\nli ) = ν 2 , we find\ndM2\n= 2C[m1 × m2 ]2\ndt\n\nSince [m1 × m2 ]2 is always positive, except in parallel\nor antiparallel configurations, we can conclude that after\na transient period the magnetic configuration will reach\neither the state of maximal M (i.e., parallel state) for\nC > 0, or the state of minimal M (i.e, antiparallel state)\nfor C < 0. Since in both collinear states Tex = 0 and\nτ 1,2 = 0, the system will come to rest and no \"windmill\"\nmotion will happen. For small spin transfer torques u1,2\nthe final state will be determined by the sign of J and,\nas expected, the device will end up in a configuration\ncorresponding to the minimum of exchange energy.\nThe marginal case C = 0 is the only situation when\nthe \"windmill\" is possible. According to Eq. (9), the\nvalue of C linearly depends on electric current I through\nu1,2 . The only exception is the singular case when device\nparameters satisfy g1 /[(1 + α21 )m1 ] = g2 /[(1 + α22 )m2 ],\nand C is current-independent. Thus in general one can\nachieve the windmill regime by tuning the current exactly\nto the \"marginal\" value Iw , such that C(Iw ) = 0. Note\nthat this value corresponds to a spin transfer strength\nof uw ∼ αJm1 m2 , and since α ≪ 1 the required spin\ntorque is much smaller than the exchange torque. The\nsituation is similar to the switching regime, where spin\ntransfer effect works against the magnetic anisotropy. In\nboth cases critical values of spin torque are proportional\nto the small Gilbert damping coefficient.\nThe original discussion of the windmill regime in Ref. 2\nassumed J = 0, α1,2 = 0, and m1 = m2 . It was found\nthat magnetic moments rotate in the plane spanned by\nvectors m1 and m2 at the initial moment, and the angle\nθ between them remains constant. How will the windmill\nmotion look in the general situation? At C = 0 the total\nmagnetic moment is conserved, M2 = m21 + m22 + 2(m1 *\nm2 ) = const, thus θ is constant in general case as well.\nSince magnitudes of m1 and m2 are also fixed, constant\nθ implies that both vectors will rotate with the same\nangular velocity,\n\n(9)\n\nwith constant coefficient C that depends on material parameters and spin-transfer strengths\n\u0013\n\u0012\nα2\nα1\nJ\n+\nC = B1 + B2 = γ\n(1 + α21 )m1\n(1 + α22 )m2\n\u0012\n\u0013\nγ\nu2\nu1\n+\n.\n(10)\n−\nm1 m2 (1 + α21 )m1\n(1 + α22 )m2\n\n(11)\n\n(cf. the theorem on the motion of a rigid body with a\nfixed point). To find ω we expand it in the basis of vectors\n(ν, m1 , m2 ) as ω = aν + b1 m1 + b2 m2 with unknown\ncoefficients a and b1,2 . Substituting this form of ω into\nEqs. (11), using expressions (7) for ṁi , the fact that for\nthe marginal value of current one has B1 = −B2 ≡ Bw ,\nand properties [ν × m1 ] = −l1 , [ν × m2 ] = l2 , we find\na = −Bw , b1 = A2 , and b2 = A1\nω = Bw [m1 × m2 ] + A2 m1 + A1 m2 .\n\n(12)\n\nSince ω̇ = [ω × ω] = 0, ω is an invariant of motion,\ndetermined by the initial conditions.\nSince α1,2 ≪ 1 and uw ∼ αJ at the marginal point,\nwe can make approximations in expressions (8) and use\nA1 ≈ A2 ≈ γJ, B1 ≈ γ(α1 Jm1 m2 + u1 )/m21 m2 , B2 ≈\nγ(α2 Jm1 m2 − u2 )/m22 m1 . Equation C = B1 + B2 = 0\n\n\f3\nthen gives the following values at the marginal point\n\u0012\n\u0013\n2e m1 α2 + m2 α1\nIw ≈\nJm1 m2 ,\n(13)\nh̄\nm1 g 2 − m2 g 1\nα1 g2 + α2 g1\nJ .\nBw ≈ γ\nm1 g 2 − m2 g 1\nNote that approximation uw ∼ αJ is violated when parameters are close to the degenerate situation m1 g2 −\nm2 g1 = 0. This is the situation when C is independent of\nthe current and the windmill regime cannot be achieved.\nFar away from the degenerate situation one has\n\u0012\n\u0013\nα1 g2 + α2 g1\nω ≈ γJ\n[m1 × m2 ] + (m1 + m2 ) .\nm1 g 2 − m2 g 1\n(14)\nThe first term in parentheses is smaller than the second one by a factor of α ≪ 1. Thus vectors mi precess approximately around the total magnetic moment\nM = m1 + m2 . In the presence of damping and spintransfer M is not conserved and performs a small angle\nrotation around the constant vector ω. In this respect\nthe motion is very different from Slonczewski's situation\nat J = 0, where M was performing 360o rotations around\n[m1 ×m2 ]. The J = 0 rotations, however, require the fulfillment of a condition g1 /[(1+α21 )m1 ] = g2 /[(1+α22 )m2 ],\nwhich is, in particular, satisfied in a completely symmetric valve considered in Ref. 2.\nFinally, we return to Eq. (9) and investigate the C 6= 0\ncase. It is convenient to rewrite (9) in terms of x = cos θ\nẋ = Cm1 m2 (1 − x2 ) .\nThe solution reads\nx(t) = cos θ(t) = tanh\n\n1\n\n2\n3\n\n4\n\n5\n\n\u0012\n\nt + t0\nsgn[C] T∗\n\n\u0013\n\n,\n\nL. Berger, J. Appl. Phys., 49, 2160 (1978); Phys. Rev. B\n33, 1572 (1986); J.Appl.Phys. 63, 1663 (1988).\nJ. Slonczewski, J. Magn. Magn. Mater. 159, L1 (1996).\nM. N. Baibich, J. M. Broto, A. Fert, F. Nguyen Van Dau,\nF. Petroff, P. Etienne, G. Creuzet, A. Friederich, and J.\nChazelas, Phys. Rev. Lett. 61, 2472 (1988).\nA. Asamitsu, Y. Tomioka, H. Kuwahara, Y. Tokura, Nature\n388, 50 (1997).\nA. Masuno, T. Terashima, Y. Shimakawa, and M. Takano,\n\nwith\nT∗ =\n\n1\n,\n|C(I)|m1 m2\n\n(15)\n\nand parameter t0 determined by the initial angle, cos θ0 =\ntanh(t0 /T∗ ). We conclude that as t → ∞ the system approaches a collinear configuration with a current dependent characteristic time T∗ (I). The latter diverges in the\nvicinity of the marginal current Iw .\nIn conclusion, we studied the motion of a two layer\nspin-transfer device with zero magnetic anisotropy. We\nshow that in the presence of damping, layer asymmetry,\nand exchange interaction between the layers the windmill\nrotation decays with characteristic time constant T∗ . The\ndecay time depends on the current pumped through the\ndevice and diverges at a \"marginal\" current Iw . For I 6=\nIw the system reaches either a parallel or an antiparallel\nstate after a transient period. Exactly at the marginal\npoint I = Iw the system performs a perpetual generalized\nwindmill motion.\nInterestingly, precession motion analogous to the windmill regime was also found in multilayers and bilayers\nwith magnetic anisotropy.7,8 In those systems it exists\nnot at a singular point, but in the whole range of current values. Thus, rather unexpectedly, anisotropy can\nbe advantageous for the windmill regime.\nFinally, coming to the discussion of the current induced ferromagnetism, we see that in a two magnet device current can induce both ferromagnetic and antiferromagnetic order. However, the situation with only two\nmagnets can be special, and it is necessary to consider\ndevices with three and more magnets to predict what\nhappens in the system of many isotropic paramagnetic\nimpurities under the influence of spin-transfer torques.\n\n6\n\n7\n\n8\n\nAppl. Phys. Lett. 85, 6194 (2004).\nYa. B. Bazaliy, B. A. Jones, and Shou-Cheng Zhang, Phys.\nRev. B, 69, 094421 (2004).\nJ. Grollier, V. Cros, and A. Fert, Phys. Rev. B 73,\n060409(R) (2006).\nYa. B. Bazaliy, D. Olaosebikan, and B. A. Jones,\narXiv:0705.0406v1 (2007), to be published in J. Nanoscience\nand Nanotechnology.\n\n\f"}