{"id": "http://arxiv.org/abs/0811.1046v1", "guidislink": true, "updated": "2008-11-06T21:21:30Z", "updated_parsed": [2008, 11, 6, 21, 21, 30, 3, 311, 0], "published": "2008-11-06T21:21:30Z", "published_parsed": [2008, 11, 6, 21, 21, 30, 3, 311, 0], "title": "A Free Boundary Isoperimetric Problem in the Hyperbolic Space between\n  parallel horospheres", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0811.4378%2C0811.4359%2C0811.3283%2C0811.4210%2C0811.3346%2C0811.4733%2C0811.4760%2C0811.1179%2C0811.3954%2C0811.4182%2C0811.1785%2C0811.3820%2C0811.1046%2C0811.2863%2C0811.1635%2C0811.1130%2C0811.2234%2C0811.1490%2C0811.1721%2C0811.2058%2C0811.1769%2C0811.1508%2C0811.3172%2C0811.0636%2C0811.2433%2C0811.3823%2C0811.1352%2C0811.0799%2C0811.1810%2C0811.4032%2C0811.0030%2C0811.0741%2C0811.3060%2C0811.0896%2C0811.3568%2C0811.4661%2C0811.0063%2C0811.3539%2C0811.3329%2C0811.3250%2C0811.1763%2C0811.2398%2C0811.2923%2C0811.0823%2C0811.1418%2C0811.2012%2C0811.1049%2C0811.4008%2C0811.2719%2C0811.0673%2C0811.2392%2C0811.3618%2C0811.4159%2C0811.1625%2C0811.4320%2C0811.4188%2C0811.2530%2C0811.2336%2C0811.2260%2C0811.2067%2C0811.2263%2C0811.3067%2C0811.1969%2C0811.2187%2C0811.3342%2C0811.3424%2C0811.4577%2C0811.4058%2C0811.2286%2C0811.1701%2C0811.0062%2C0811.3214%2C0811.3799%2C0811.2464%2C0811.0311%2C0811.4035%2C0811.1600%2C0811.2149%2C0811.4134%2C0811.3562%2C0811.1300%2C0811.2291%2C0811.4205%2C0811.1295%2C0811.0314%2C0811.1637%2C0811.2886%2C0811.2140%2C0811.3766%2C0811.0360%2C0811.0320%2C0811.2119%2C0811.4440%2C0811.0266%2C0811.1450%2C0811.3456%2C0811.0134%2C0811.1314%2C0811.3128%2C0811.4196%2C0811.3157&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A Free Boundary Isoperimetric Problem in the Hyperbolic Space between\n  parallel horospheres"}, "summary": "In this work we investigate the following isoperimetric problem: to find the\nregions of prescribed volume with minimal boundary area between two parallel\nhorospheres in hyperbolic 3-space (the area of the part of the boundary\ncontained in the horospheres is not included). We reduce the problem to the\nstudy of rotationally invariant regions and obtain the possible isoperimetric\nsolutions by studying the behaviour of the profile curves of the rotational\nsurfaces with constant mean curvature in the hyperbolic space.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0811.4378%2C0811.4359%2C0811.3283%2C0811.4210%2C0811.3346%2C0811.4733%2C0811.4760%2C0811.1179%2C0811.3954%2C0811.4182%2C0811.1785%2C0811.3820%2C0811.1046%2C0811.2863%2C0811.1635%2C0811.1130%2C0811.2234%2C0811.1490%2C0811.1721%2C0811.2058%2C0811.1769%2C0811.1508%2C0811.3172%2C0811.0636%2C0811.2433%2C0811.3823%2C0811.1352%2C0811.0799%2C0811.1810%2C0811.4032%2C0811.0030%2C0811.0741%2C0811.3060%2C0811.0896%2C0811.3568%2C0811.4661%2C0811.0063%2C0811.3539%2C0811.3329%2C0811.3250%2C0811.1763%2C0811.2398%2C0811.2923%2C0811.0823%2C0811.1418%2C0811.2012%2C0811.1049%2C0811.4008%2C0811.2719%2C0811.0673%2C0811.2392%2C0811.3618%2C0811.4159%2C0811.1625%2C0811.4320%2C0811.4188%2C0811.2530%2C0811.2336%2C0811.2260%2C0811.2067%2C0811.2263%2C0811.3067%2C0811.1969%2C0811.2187%2C0811.3342%2C0811.3424%2C0811.4577%2C0811.4058%2C0811.2286%2C0811.1701%2C0811.0062%2C0811.3214%2C0811.3799%2C0811.2464%2C0811.0311%2C0811.4035%2C0811.1600%2C0811.2149%2C0811.4134%2C0811.3562%2C0811.1300%2C0811.2291%2C0811.4205%2C0811.1295%2C0811.0314%2C0811.1637%2C0811.2886%2C0811.2140%2C0811.3766%2C0811.0360%2C0811.0320%2C0811.2119%2C0811.4440%2C0811.0266%2C0811.1450%2C0811.3456%2C0811.0134%2C0811.1314%2C0811.3128%2C0811.4196%2C0811.3157&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this work we investigate the following isoperimetric problem: to find the\nregions of prescribed volume with minimal boundary area between two parallel\nhorospheres in hyperbolic 3-space (the area of the part of the boundary\ncontained in the horospheres is not included). We reduce the problem to the\nstudy of rotationally invariant regions and obtain the possible isoperimetric\nsolutions by studying the behaviour of the profile curves of the rotational\nsurfaces with constant mean curvature in the hyperbolic space."}, "authors": ["Rosa Chaves", "Renato Pedrosa", "Marcio Silva"], "author_detail": {"name": "Marcio Silva"}, "author": "Marcio Silva", "links": [{"href": "http://arxiv.org/abs/0811.1046v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0811.1046v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.DG", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.DG", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "53A10", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0811.1046v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0811.1046v1", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "arXiv:0811.1046v1 [math.DG] 6 Nov 2008\n\nA FREE BOUNDARY ISOPERIMETRIC PROBLEM IN\nTHE HYPERBOLIC SPACE BETWEEN PARALLEL\nHOROSPHERES\nROSA M.B. CHAVES, RENATO H.L. PEDROSA, AND MÁRCIO F. DA SILVA\nAbstract. In this work we investigate the following isoperimetric problem: to find the regions of prescribed volume with minimal boundary\narea between two parallel horospheres in hyperbolic 3-space (the area of\nthe part of the boundary contained in the horospheres is not included).\nWe reduce the problem to the study of rotationally invariant regions and\nobtain the possible isoperimetric solutions by studying the behaviour of\nthe profile curves of the rotational surfaces with constant mean curvature in the hyperbolic space.\n\n1. Introduction\nGeometric isoperimetric problems, (upper) estimates for the volume of\nregions of a given fixed boundary volume, or the dual problems, play an\nimportant role in Analysis and Geometry. There are both isoperimetric inequalities , common in Analysis, and actual classification of optimal geometric objects, like the round ball in Euclidean Geometry. We will be interested\nin the study of a relative free-boundary isoperimetric problem in Hyperbolic\n3-space between two parallel horospheres. A survey of recent results about\nthe geometric isoperimetric problems is [13].\nFor a Riemannian manifold M n , the classical isoperimetric problem assumes the following formulation: to classify, up to congruency by the isometry group of M, the (compact) regions Ω ⊆ M enclosing a fixed volume that\nhave minimal boundary volume. The relevant concepts of volume involved\nare those of Geometric Measure Theory: regions and their boundaries are\nn-rectifiable (resp. (n − 1)-rectifiable) subsets of M (cf. [11]).\nIf M has boundary, the part of ∂Ω included in the interior of M will\nbe called the free boundary of Ω, the other part will be called the fixed\nboundary. One may specify how the fixed boundary of Ω is included in\nthe computation of the boundary volume functional. In this paper, we will\nassume that the volume of the fixed boundary of Ω is not considered in the\nboundary volume functional. We will see in Section 3 that this implies that\nthe angle of contact between the interior boundary of Ω and ∂M is π/2 (when\n2000 Mathematics Subject Classification. Primary 53A10, 49Q10.\nKey words and phrases. Constant mean curvature surfaces, Hyperbolic space, Isoperimetric problem.\n1\n\n\f2\n\nROSA M.B. CHAVES, RENATO H.L. PEDROSA, AND MÁRCIO F. DA SILVA\n\nsuch contact occurs). Such relative problems are related to the geometry\nof stable drops in capillarity problems (the angle of contact depends, as\nmentioned, on how one considers the volume of the fixed boundary in the\ncomputation of the boundary volume functional). For a discussion about\nthat, we refer to [7].\nThe motivation for our work is the well-known result of Athanassenas\n[2] and Vogel [14] which implies that between two parallel planes in the\nEuclidean space R3 , a (stable) soap-bubble touching both walls perpendicularly is a straight cylinder perpendicular to the planes (enclosing a tube),\nand may only exist down to a certain minimal enclosing volume depending\non the distance between the planes. Below that value, only half-spheres\ntouching one of the planes or whole spheres not touching either plane occur,\nthe cylinders becoming unstable. A newer proof can be found in [12], where\nthe authors study the analogous problem in higher-dimensional Euclidean\nspaces.\nIn this paper we study the analogous relative isoperimetric problem between two parallel horospheres in hyperbolic space H3 (−1). We will use the\nupper halfspace model R3+ . The parallel horospheres are then represented\nby the horizontal Euclidean 2-planes of R3+ . We will present in this paper a\ndetailed classification of the possible isoperimetric solutions.\nThe existence of isoperimetric regions in the manifold with boundary\n(B, g), the slab composed by the two horospheres and the region between\nthem, may be obtained by adapting a result due to Morgan [11] (B/G is a\ncompact space, where G is the subgroup of the isometry group of H3 (−1)\nleaving B invariant, so that Morgan's result applies). Regarding the regularity of the free boundary, well-known results about the lower codimension\nbounds of the singular subset imply that it must be regular, in fact analytic.\nIn Section 2 we give some basic definitions in the model R3+ like geodesics,\ntotally geodesic surfaces, umbilical surfaces and rotational surfaces. We also\ngive a more precise formulation for the isoperimetric problem considered\nusing area and volume functionals.\nIn Section 3 we discuss briefly the rotationally invariance of isoperimetric\nregions and some of their basic geometric properties, since their (free) boundaries must have constant mean curvature and, when touching the bounding\nhorospheres, the contact angle must be π/2. We will also discuss in more\ndetail the existence of isoperimetric regions and the regularity of the free\nboundary part.\nIn Section 4 we investigate the tangency of profile curves for the rotational\nsurfaces with constant mean curvature to determine the possible isoperimetric regions between the two parallel horospheres in R3+ . We define what we\nmean by catenoid, equidistant and onduloid type surfaces and prove the\nfollowing result.\nLet c1 , c2 be positive real constants, c1 < c2 , and Fc1 ,c2 = {(x, y, z) ∈\nR3+ : c1 ≤ z ≤ c2 }. Let V > 0 and Cc1 ,c2 ,V be the set of Ω ⊂ Fc1 ,c2 with\n\n\fA FREE BOUNDARY ISOPERIMETRIC PROBLEM IN H3\n\n3\n\nT o\nvolume |Ω| = V and boundary volume (area) A(Ω Fc1 ,c2 ) < ∞, where\nwe suppose Ω to be connected, compact, 3-rectifiable in Fc1 ,c2 , having as\nboundary (between the horospheres) an embedded, orientable, 2-rectifiable\nsurface.\nT o\nTheorem 1.1. Let Ac1 ,c2 ,V = inf{A(Ω Fc1 ,c2 ) : Ω ∈ Cc1 ,c2 ,V }. Then\no\nT\n(1) there exists Ω ∈ Cc1 ,c2 ,V such that A(Ω\nFc1 ,c2 ) = Ac1 ,c2 ,V . As\nalready mentioned, the free boundaries are actually analytic surfaces;\n(2) if Ω has minimal boundary volume, between the horospheres, the free\nboundary of Ω, is either\n(a) of catenoid type or umbilical with H = 1, or\n(b) of equidistant type or umbilical with 0 < H < 1, or\n(c) of onduloid type or umbilical with H > 1.\nThe details of the description above are included in Section 4. We observe\nhere that this result shows how the situation in hyperbolic geometry is different from the one in the Euclidean 3-space, where we also have rotationally\ninvariant surfaces of catenoid and of onduloid type, but they cannot appear as boundaries of optimizing tubes (even though, in higher dimensions,\nhypersurfaces generated by onduloids in Euclidean spaces are known to occur as boundaries of optimal tubes connecting two parallel hyperplanes (cf.\n[12])).\nAcknowledgements. The author Márcio Silva would like to thank CAPES\nand CNPq for support during his PhD studies, which included part of the\nwork presented in this paper.\n2. Preliminaries\nIn this section we will introduce some basic facts and notations that will\nappear along the paper.\nLet L4 = (R4 , g) the 4-dimensional Lorentz space endowed with the metric\ng(x, y) = x1 y1 + x2 y2 + x3 y3 − x4 y4 and the 3-dimensional hyperbolic space\nH3 (−1) := {p = (x1 , x2 , x3 , x4 ) ∈ L4 : g(p, p) = −1, x4 > 0}.\n\nWe use the upper halfspace model R3+ := {(x, y, z) ∈ R3 ; z > 0} for H3 (−1),\ndx2 + dy 2 + dz 2\n.\nendowed with the metric <, >= ds2 =\nz2\nLet φ : Σ → R3+ be an isometric immersion of a compact manifold Σ\nwith boundary ∂Σ 6= ∅ and Γ be a curve in R3+ . If φ is a diffeomorphism of\n∂Σ onto Γ, we say that Γ is the boundary of φ and if φ has constant mean\ncurvature H, we say that Σ is an H-surface with boundary Γ. We identify\nΣ with its image by φ and ∂Σ with the curve Γ.\nThe plane z = 0 is called the infinity boundary of R3+ and we denote it\nby ∂∞ R3+ . The geodesics of R3+ are represented by vertical Euclidean lines\nand half-circles orthogonal to ∂∞ R3+ , contained in R3+ . The totally geodesic\n\n\f4\n\nROSA M.B. CHAVES, RENATO H.L. PEDROSA, AND MÁRCIO F. DA SILVA\n\nsurfaces have constant mean curvature H = 0 and are represented by vertical\nEuclidean planes and hemispheres orthogonal to ∂∞ R3+ , contained in R3+ .\nThe horizontal Euclidean translations and the rotations around a vertical\ngeodesic are isometries of R3+ . We have two family of isometries associated to\none point p0 ∈ ∂∞ R3+ : the Euclidean homotheties centered in p0 with factor\nk > 0, called hyperbolic translations through a geodesic α perpendicular to\n∂∞ R3+ in p0 , and the hyperbolic reflections with respect to a totally geodesic\nsurface P .\nWhen P is a hemisphere orthogonal to ∂∞ R3+ centered in p0 and radius\nr > 0, the hyperbolic reflections are Euclidean inversions centered in p0\nthat fix P and, when P is a vertical Euclidean plane, they are Euclidean\nreflections with respect to P .\nThe umbilical surfaces of R3+ are described as follows (see for example\n[8]):\n(1) Totally geodesics: These surfaces were already described (H = 0).\n(2) Geodesic spheres: represented by Euclidean spheres entirely contained in R3+ , they have H > 1 (mean curvature vector points to\nthe interior). If ρ is the hyperbolic radius of a geodesic sphere then\nH = coth ρ.\n(3) Horospheres: represented by horizontal Euclidean planes of R3+ and\nEuclidean spheres of R3+ which are tangent to ∂∞ R3+ , they have\nH = 1 and the mean curvature vector points upward in the case of\nhorizontal planes and to the interior in the case of spheres.\n(4) Equidistant surfaces: represented by the intersection of R3+ with the\nplanes of R3 that are neither parallel nor perpendicular to the plane\nz = 0 and by (pieces of) Euclidean spheres that are not entirely\ncontained in R3+ and are neither parallel tangent nor perpendicular\nto the plane z = 0. They have 0 < H < 1 and the mean curvature\nvector points to the totally geodesic surface they are equidistant to.\nIn our study, the (spherical) rotational surfaces of R3+ play an important\nrole since the solutions of the isoperimetric problem must be rotationally\ninvariant regions. They are defined as surfaces invariant by a subgroup of\nisometries whose principal orbits are (Euclidean) circles.\nLet Π1 and Π2 be horospheres represented by distinct parallel horizontal\nEuclidean planes, Π = Π1 ∪ Π2 , F = F(Π1 , Π2 ) the closed slab between\nthem and φ : Σ → F an immersion of a compact, connected, embedded\nand orientable C 2 - surface with boundary Γ = ∂Σ and such that φ(Γ) ⊂ Π\n(we will see later that the image by φ of the interior of the surface Σ will\nnot be allowed to touch Π if Σ is the boundary of an optimal domain in\nour variational problem, but this is not part of the general situation at this\npoint).\nWe fix, now, the notation for some well-known geometric invariants related to isometric immersions. We identify (locally) Σ with φ(Σ) and X(p) ∈\nTp Σ with dφp (X(p)) ⊂ R3+ . We have, as usual, the decomposition Tp (R3+ ) =\n\n\fA FREE BOUNDARY ISOPERIMETRIC PROBLEM IN H3\n\n5\n\nTp (Σ) ⊕ Np (Σ) into the tangent and normal spaces to Σ in p, respectively.\nChoose an orientation for Σ and let N be the (positive) unitary normal\nfield along the immersion φ. If X(p) ∈ Tp (R3+ ), we may write X(p) =\nX(p)T + X(p)N = X(p)T + αN (p), where α ∈ R.\nLet < *, * > be the metric induced on Σ by the immersion φ, making it\nisometric, ∇ be the Riemannian connection of the ambient space R3+ and ∇\nthe induced Riemannian connection of Σ. Let X, Y ∈ X(Σ) be C ∞ -vector\nfields, then ∇X Y = (∇X Y )T and B(X, Y ) = (∇X Y )N are, as usual, the\ninduced connection on Σ and the second fundamental form of the immersion\ngiven by B. We also have the Weingarten operator AN (Y ) = −(∇Y N )T so\nthat < AN (X), Y >=< B(X, Y ), N > . Finally, the mean curvature of the\nimmersion φ is H = 1/2 trace(AN ).\nDefinition 1. A variation of φ is a smooth map F : (−ǫ, ǫ) × Σ → R3+ , such\nthat for all t ∈ (−ǫ, ǫ), φt : Σ → R3+ , defined by φt (p) = F (t, p),\n(a) is an immersion;\n(b) φ0 = φ.\nFor p ∈ Σ, X(p) = ∂φt (p)/∂t|t=0 is the variation vector field of F and\nthe normal variation function of F is given by f (p) =< X(p), N (p) >. We\nsay that the variation F is normal if X is normal to φ at each point and\nthat F has compact support if X has compact support. For a variation with\ncompact support and small values of t we have that φt is an immersion of Σ\nin R3+ . In this case we define the (variation) area function A : (−ǫ, ǫ) → R\nby\nZ p\nZ\ndet[(dφt )∗ (dφt )] dA,\ndAt =\nA(t) =\nΣ\n\nΣ\n\nwhere dA is the element of area of Σ. A(t) is the area of Σ with the metric\ninduced by φt . We also define the (variation) volume function V : (−ǫ, ǫ) →\nR by\nZ\nV (t) = −\n\n[0,t]×Σ\n\nF ∗ d(R3+ ),\n\nwhere d(R3+ ) is the element of volume of R3+ and F ∗ d(R3+ ) is the pull-back\nof d(R3+ ) by F . V (t) is not, actually, the volume of some region with φt (Σ)\nas boundary, but of a \"tubular neighborhood\" along φ(Σ) between φ(Σ) and\nφt (Σ). The sign is related to the net change with respect to the normal field\ndefining the orientation (for example, contracting a sphere in R3 , which\nmeans moving it in the direction of the mean curvature vector, gives a\nnegative sign for V (t), as expected).\nDefinition 2. Let F : (−ǫ, ǫ) × Σ → R3+ a variation of φ.\n(i) F preserves volume if V (t) = V (0)(= 0), ∀t ∈ (−ǫ, ǫ);\n(ii) F is admissible if F (∂Σ) ⊂ Π, ∀t ∈ (−ǫ, ǫ).\n\nDefinition 3. We say that the immersion φ is stationary when A′ (0) = 0,\nfor all admissible variations that preserve volume.\n\n\f6\n\nROSA M.B. CHAVES, RENATO H.L. PEDROSA, AND MÁRCIO F. DA SILVA\n\nRemark 2.1. If Ω is a (compact) regular region in the slab F between\nthe horospheres Π, taking Σ in Definition 2 as the (embedded regular) free\nboundary of Ω, we may extend the above variational approach to produce\na variation Ω(t) of Ω by embedded domains (for small t), such that the\ncondition V (t) = 0 in Definition 2 is equivalent to holding the measure\n(volume) |Ω(t)| of Ω(t) constant (the same as that of Ω = Ω(0)) along the\nvariation. This justifies saying that the variation \"preserves volume\" in the\nabove definition.\nWe end this section by stating again our problem. Let Π1 and Π2 be two\nparallel horospheres in R3 and F = F(Π2 , Π2 ) the (closed) slab between\nthem.\nIsoperimetric problem for F(Π1 , Π2 ): fix a volume value and study the\ndomains Ω ⊂ F with the prescribed volume which have minimal free boundary area.\nDefinition 4. A (compact) minimizing region Ω for this problem will be\ncalled an isoperimetric domain or region in F.\nIn more detail, one is looking for the classification and geometric description of isoperimetric regions (as a function of the volume value), in as much\ndetail as possible, aiming at the determination of the isoperimetric profile\n(minimal free boundary area as a function of prescribed volume) for F.\n\n3. First results about the isoperimetric solutions\nOur main goal in this section is to characterize the stationary immersions\naccording to Definition 3. The following formulae for the first variations of\nthe area and volume functions are well known. For an immersed surface\nwith boundary, the exterior conormal is the vector field along the boundary\ngiven as follows: in the tangent plane of Σ in p ∈ Γ, take the perpendicular\nvector to the tangent vector to Γ in p along the boundary Γ.\nProposition 3.1. Let F be a variation of φ with variational field X and\ncompact support in Σ. Then\nZ\nZ\n< X, ν > dΓ, where ν is the unitary\n(1) A′ (0) = −2 Hf dA +\nΣ\n\nΓ\n\nexterior conormal, dA is the element of area of Σ and dΓ is the\nelement of Zlength of Γ induced by φ.\nf dA, where f (p) = < X(p), N (p) >, as before.\n(2) V ′ (0) = −\nΣ\n\nProof : Although the formula of the variation of the area functional is\nwell known (see [4]), we show here a different proof to get it. From the\n\n\fA FREE BOUNDARY ISOPERIMETRIC PROBLEM IN H3\n\n7\n\ndefinition of A(t) we obtain\nZ \u0014\n\u0010\n\u0011\n1\n∗ dφ ] .\n√\ndet[(dφ\n)\nA′ (t) =\nt\nt\n∗\nΣ 2\u0010 det[(dφt ) dφt ]\n\u0011i\nd\ntrace [(dφt )∗ dφt ]−1 ◦ dt\n((dφt )∗ dφt )\ndA.\n\nAs φ0 is the inclusion of Σ in R3+ , dφ0 is the inclusion of the respective\ntangent spaces and dφ∗0 is the orthogonal projection on T Σ.\nEvaluating A′ (t) for t = 0 we get\nZ\n\u0010d\n\u0011\n1\n′\ntrace\n[(dφt )∗ dφt ] dA.\nA (0) =\ndt t=0\nΣ 2\nUsing the Symmetry Lemma for the connection ∇φ along the immersion\nwe have\nd\n∂φt\n(dφt ) = ∇φ\n= ∇φ X.\ndt t=0\n∂t t=0\nThen\nZ\nZ\n\u0010\n\u0011\n\u0010\n\u0011\n1\nφ\n∗\nφ\n′\ntrace projT Σ ∇φ X dA,\ntrace (∇ X)\n+projT Σ ∇ X dA =\nA (0) =\nTΣ\nΣ\nΣ 2\nwhere projT Σ denotes the projection on T Σ.\nDecomposing the variational field as X = X T + X N , we have that the\nprojections of the tangent and normal components of ∇φ (X) on T Σ are\nprojT Σ ∇φ (X T ) = ∇(X T )\n\nprojT Σ ∇φ (X N ) = −AX N .\n\nSo\nA′ (0) =\n\nZ \u0010\n\u0011\ndivX T − 2 < X N , H N > dA.\nΣ\n\nUsing the Stokes theorem we get\nZ\nZ\nT\n′\n< X N , H N > dA =\n< X , ν > dΓ − 2\nA (0) =\nΣ\n\nΓ\n\n= −2\n\nZ\n\nΣ\n\nHf dA +\n\nZ\n\n< X, ν > dΓ.\n\nΓ\n\nThe first variation of volume given in (2) is the standard one and will be\nomitted (cf.[4]).\nFrom the next result we deduce that the boundary of the isoperimetric\nregion we are studying must be an H-surface that makes a contact angle\nπ/2 with the horospheres Π1 and Π2 .\nTheorem 3.1. An immersion φ : Σ → R3+ is stationary if and only if φ\nhas constant mean curvature and meets the horospheres Π = Π1 ∪ Π2 that\ncontains its boundary Γ = ∂Σ, perpendicularly along the boundary (if the\nintersection is non-empty).\n\n\f8\n\nROSA M.B. CHAVES, RENATO H.L. PEDROSA, AND MÁRCIO F. DA SILVA\n\nProof : Adapting the proof of Proposition 2.7 of [3] we show that if\nφ has constant mean curvature and meets the horospheres Π = Π1 ∪ Π2\nthat contains its boundary Γ = ∂Σ, perpendicularly along the boundary\nthen φ is stationary; and that if φ is stationary then φ has constant mean\ncurvature. To show that if φ is stationary then φ meets Π perpendicularly\nalong its boundary Γ = ∂Σ, we take an admissible variation Φ that preserves\nvolume with variational field X and p0 ∈ ∂Σ. Suppose, by contradiction,\nT\n< X(p0 ), ν(p0 ) >6= 0. By continuity there is a neighbourhood U = W1 ∂Σ\nof p0 such that < X(p), ν(p) > > 0, ∀p ∈ U , where W1 is a neighbourhood\no\n\nof p0 in Σ. We take q ∈ Σ \\W1S, W2 a neighbourhood of q disjoint to W1\nand a partition of unity on W1 W2 . There exists a differentiable function\nξ1 : W1 → R such that ξ1 (W1 ) ⊂ [0, 1] with support supp ξ1 ⊂ W1 . We\nmay consider also a differentiable map ξ2 : W2 → R such that ξ2 (W2 ) ⊂\n[0, 1], supp ξ2 ⊂ W2 and\nZ\nZ\nξ2 f dW2 = 0.\nξ1 f dW1 +\nW2\n\nW1\n\nWe S\nconsider the variation Φξ : (−ǫ, ǫ) × Σ → R with compact support on\nW1 W2 such that\n\u001a\nΦ(ξ1 t, p), p ∈ W1 ,\nt\nΦξ (p) = Φξ (t, p) =\nΦ(ξ2 t, p), p ∈ W2 .\nNotice that Φξ is admissible because Φ is admissible.\nIf fξ (p) denotes the normal component of the variation vector we have\nZ\nZ\nZ\nξ2 (p)f (p) dW2 = 0,\nξ1 (p)f (p) dW1 +\nfξ dA =\nW2\n\nW1\n\nΣ\n\nand Φξ preserves volume.\nFor this variation we have\nZ\nZ\nfξ dA +\n0 = A′ (0) = −2H\nΣ\n\nξ1 < X, ν > dΓ =\nW1\n\nZ\n\nξ1 < X, ν > dΓ > 0,\n\nW1\n\nwhich is a contradiction. Then ∀p ∈ ∂Σ it follows that < X, ν > (p) = 0.\nNext we show that the boundary of the isoperimetric solutions are rotationally invariant regions.\nWe need some symmetrization principle for H-surfaces. Taking the version of Alexandrov's Principle of Reflection for the hyperbolic space (for\nfurther references and details see [1]) and using [6] as reference to take the\nsuitable objects in our case as the reflection planes, we get the next result\n(a detailed proof may be found in [9]).\nTheorem 3.2. Let Σ be a compact connected orientable and embedded Hsurface of class C 2 ,Sbetween two parallel horospheres Π1 , Π2 in R3+ and with\nboundary ∂Σ ⊂ Π1 Π2 (possibly empty). Then Σ is rotationally symmetric\naround an axis perpendicular to Π1 and Π2 .\n\n\fA FREE BOUNDARY ISOPERIMETRIC PROBLEM IN H3\n\n9\n\nWe observe that the intersection of Σ with a horosphere H (represented\nby a horizontal Euclidean plane) is just an Euclidean circle. In fact, if they\nwere two concentric circles and the isoperimetric region was delimited by\nthese circles we would get a totally geodesic symmetry plane P that would\nnot contain the axis of symmetry.\n4. Isoperimetric regions between horospheres in R3+\nIn this section we classify the rotational H-surfaces of R3+ between two\nparallel horospheres with boundary contained in the horospheres and that\nintersects the horospheres perpendicularly. Therefore we get the possible\nsolutions for the isoperimetric problem in the hyperbolic space since they\nmust be regions delimited by those surfaces. We start with some important\nresults obtained by Barrientos [5] in his PhD thesis which will be useful for\nour task.\nIf (ρ, θ, z) are the cylindrical coordinates of a point p in R3+ then the\ncartesian coordinates are given by\n(4.1)\n\n(x, y, z) = ez (tanh ρ cos θ, tanh ρ sin θ, sechρ).\n\nFor a spherical rotational surface Σ of R3+ we can provide the so called\nnatural parametrization, whose metric is\ndσ 2 = ds2 + U 2 (s) dt2 ,\nwhere U = U (s) is a positive function. Supposing that its profile curve is\nlocally a graphic z = λ = λ(ρ) in the plane θ = 0, the natural parameters\nare given by\nq\nds = 1 + λ̇2 (ρ) cosh2 ρ dρ e dt = dφ,\nand the following relations hold\n(4.2)\n\nU 2 (s) = sinh2 ρ(s) and λ̇2 (s) =\n\n1 + U 2 (s) − U̇ 2 (s)\n.\n(1 + U 2 (s))2\n\nThen the natural parametrization for a rotational surface in cylindrical\ncoordinates is\n\nsinh2 ρ(s) = U 2 (s),\n\n\n\n\n\n\nq\n\n\nZ s 1 + U 2 (t) − U̇ 2 (t)\nλ(s) =\ndt,\n\n\n1 + U 2 (t)\n\n0\n\n\n\n\n\nφ(t) = t.\n\nIn [5], the rotational were studied H-surfaces of R3+ . By replacing z(s) =\nhe got the differential equation for a rotational H-surface in R3+\n\nU 2 (s),\n\nż 2\n= (1 − H 2 )z 2 + (1 + 2aH)z − a2 ,\n4\n\n\f10\n\nROSA M.B. CHAVES, RENATO H.L. PEDROSA, AND MÁRCIO F. DA SILVA\n\nwhere a is a constant of integration, and showed that the behaviour of their\nprofile curves is determined by the constant a. Choosing the orientation\nfor the surfaces in order to H ≥ 0, there are three cases to study: H = 1,\n0 ≤ H < 1 and H > 1.\nThe natural parametrization for a rotational H-surface in R3+ , H = 1,\ngenerated by a curve c(s) = (ρ(s), λ(s)) is given by\n\na2 + (1 + 2a)2 s2\n\n2\n\n,\n\nsinh\nρ(s)\n=\n\n\n1 + 2a\n\n\n\n\np\nZ s√\n1 + 2a(−a(1 + a) + (1 + 2a)2 t2 ) a2 + (1 + 2a)2 t2\n(4.3)\ndt,\nλ(s)=\n\n\n(−a(1 + a) + (1 + 2a)2 t2 )2 + (1 + 2a)4 t2\n0\n\n\n\n\n\n\nφ(t) = t\n\nThe natural parametrization for a rotational H-surface in R3+ , 0 ≤ H < 1,\ngenerated by a curve c(s) = (ρ(s), λ(s)) is given by\n\n−A + B cosh(2αs)\n\n2\n\n,\n\nsinh ρ(s) =\n\n2α2\n\n\n\n\np\nZ s√\n2α(−2a+H(−1+B cosh(2αt))) −A+B cosh(2αt)\n(4.4)\nλ(s) =\ndt,\n\n\n\n(−2a+H(−1+B cosh(2αt)))2+α2 B 2 sinh2 (2αt)\n0\n\n\n\n\n\n\nφ(t) = t,\n√\n√\nwhere A = 1 + 2aH, B = 1 + 4aH + 4a2 and α = 1 − H 2 .\nThe natural parametrization for a rotational H-surface in R3+ , H > 1,\ngenerated by a curve c(s) = (ρ(s), λ(s)) is given by\n\nA + B sin(2αs)\n2\n\n,\n\nsinh ρ(s) =\n\n2α2\n\n\n\n\np\nZ s√\n2α(2a + H(1 + B sin(2αt))) A + B sin(2αt)\n(4.5)\nλ(s) =\ndt,\n\n\n2\n2 2\n2\n\n0 (2a + H(1 + B sin(2αt))) + α B cos (2αt)\n\n\n\n\n\nφ(t) = t,\n√\n√\nwhere A = 1 + 2aH, B = 1 + 4aH + 4a2 and α = H 2 − 1.\nNext we present some notations and definitions we will use throughout\nthis section. From (4.1) the profile curve of a rotational H-surface in R3+ is\ngiven by\n(4.6)\n\nc+ (s) = eλ(s) (tanh ρ(s), sechρ(s)).\n\n1\n1\nIf H = 1, ρ(s) and λ(s) are given by (4.3) and a > − . When − < a < 0\n2\n2\nwe call the family of such of rotational as catenoid's cousin type surfaces and\nwhen a = 0 we have the umbilical surfaces with H = 1.\n\n\fA FREE BOUNDARY ISOPERIMETRIC PROBLEM IN H3\n\n11\n\nIf 0 ≤ H < 1, ρ(s) and λ(s) are given by (4.4) and a ∈ R. When a < 0\nsuch rotational surfaces are called equidistant type surfaces and when a = 0\nwe get umbilical surfaces, with 0 ≤ H < 1.\n√\n−H + H 2 − 1\n.\nIf H > 1, ρ(s) and λ(s) are given by (4.5) and a ≥\n2\n−1\nWhen\n< a < 0 we obtain the so called onduloid type surfaces and if\n4H\na = 0 we get the umbilical surfaces with H > 1.\nWe observe that the profile curve c+ (s) depends on the parameters H,\na and r, where r is the geodesic radius, that is, the radius of a geodesic\nperpendicular to the z-axis. Then for H and r fixed we get a family of\nrotational H-surfaces. From the Euclidean homothety Hr , with factor r,\nHr (c+ (s)) = eλ(s) (r tanh ρ(s), rsechρ(s)),\n\nwe get also other families of profile curves of rotational H-surfaces, so that\nr = 1.\nAccording to Theorem 3.1 and Theorem 3.2 the boundary of the isoperimetric solutions must be rotational H-surfaces that meet the horospheres\n{z = c1 } and {z = c2 } perpendicularly. Our goal is to determine the vertical\ntangency points of the profile curves of the rotational surfaces.\nDefinition 5. Let c+ (s) be a curve parametrized by (4.6). We say that a\npoint c+ (s) is a vertical tangency point if the tangent vector in c+ (s) satisfies\nċ+ (s) = (0, b), where b ∈ R∗ , that is,\n(4.7)\n\neλ(s) (tanh ρ(s)λ̇(s) + sech2 ρ(s)ρ̇(s)) = 0,\n\n(4.8)\n\neλ(s) (sechρ(s)λ̇(s) − sechρ(s) tanh ρ(s)ρ̇(s)) = b.\n\nAs eλ(s) > 0, (4.7) implies that\n(4.9)\n\ntanh ρ(s)λ̇(s) + sech2 ρ(s)ρ̇(s) = 0.\n\nBy (4.9) we obtain the points where the vertical tangency occurs and by\n(4.8) we get the direction of the vertical tangency (upward or downward).\nReplacing (4.2) in (4.9) we see that if p is a vertical tangency point for\nwhich U (s) 6= 0 then\n(4.10)\n\nU 2 (s) = U̇ 2 (s),\n\nand the roots of (4.10) give us the vertical tangency points.\nNext we study the behaviour of the profile curve of rotational H-surfaces\ndetermining the possible vertical tangency points.\nFirst Case: H = 1.\nThe geodesic radius is given by {λ = 0} in cylindrical coordinates. By\n(4.6) we get the curve cg (s) = (tanh ρ(s), sechρ(s)).\n\n\f12\n\nROSA M.B. CHAVES, RENATO H.L. PEDROSA, AND MÁRCIO F. DA SILVA\n\nTheorem 4.1. If c+ (s) = eλ(s) (tanh ρ(s), sechρ(s)) with ρ(s), λ(s) given by\n(4.3) is the parametrization of the profile curve of a rotational H-surface in\nR3+ , with H = 1, then c+ (s) is symmetric to the geodesic radius cg .\nProof : By (4.3) we have that λ(0) = 0. So c+ (0) ∈ cg . If I denotes the\nEuclidean inversion through cg , we have that I(c+ (s)) = c+ (−s), since ρ(s)\nis an even function and λ(s) is odd.\nBy (4.3) we have that\n(4.11)\n\nsinh ρ(s) = 0 ⇐⇒ a = 0 e s = 0.\n\nSo tanh ρ(s) > 0 if a and s were not both equal to zero. Furthermore\ns = 0 is the unique minimum point of ρ(s).\nIf H = 1 we have from (4.3) that\n(4.12)\n\nU 2 (s) =\n\n(1 + 2a)3 s2\na2 + (1 + 2a)2 s2\n, U̇ 2 (s) = 2\n.\n1 + 2a\na + (1 + 2a)2 s2\n\nReplacing (4.12) in (4.10) we get\n\u0011\n\u0010\n(4.13)\n(1 + 2a)4 s4 + 2a2 (1 + 2a)2 − (1 + 2a)4 s2 + a4 = 0.\n\nMaking t = s2 in (4.13) we get a second degree equation whose discriminant is\n(4.14)\n\n∆ = (1 + 2a)6 (4a + 1).\n\nSince 1 + 2a > 0 in case H = 1 we have that\n1\n1\n• if − < a < − , (4.13) has no real roots. Then there are no vertical\n2\n4\ntangency points in this case;\n1\n• if a = − , there are at most two vertical tangency points\n4\n1\n(4.15)\ns=± ;\n2\n1\n• if a > − , there are at most four vertical tangency points given by\n4\n√\n1 + 2a + 1 + 4a\n, s2 = −s1 ,\ns1 =\n2(1 + 2a)\n(4.16)\n√\n1 + 2a − 1 + 4a\ns3 =\n, s4 = −s3 .\n2(1 + 2a)\nBesides these informations we study the vertical tangencies according to\nthe variation of the parameter a.\n1\n(1) If − ≤ a < 0 we have λ̇(s) > 0. If s ≥ 0 then\n4\ntanh ρ(s)λ̇(s) + sech2 ρ(s)ρ̇(s) > 0\nand (4.9) is not possible. As 1 + 2a > 0 the roots s1 and s3 of (4.10)\ngiven by (4.16) are strictly positives. So they do not give vertical\n\n\fA FREE BOUNDARY ISOPERIMETRIC PROBLEM IN H3\n\n13\n\ntangency points. The other roots s2 , s4 < 0 give us the vertical\ntangency points that point out upward for b > 0 in (4.8). In Figure 1 we have the profile curve for H = 1 and a = −0.2 and the\nhorocycles that pass through the vertical tangency. In Figure 2 we\nsee two parallel horospheres and the rotational surface, between the\nhorospheres, that meets them perpendicularly.\n\nFigure\n1. Profile\ncurve for H = 1 and\na = −0.2.\n\nFigure 2. Rotational\nsurface with H = 1\nand a = −0.2.\n\n1\n1\nIn particular if a = − , the positive root s = of (4.10) given\n4\n2\nby (4.15) does not give a vertical tangency point. There exists only\n1\none vertical tangency point corresponding to s = − . From the\n2\ninformations about ρ(s) and λ(s) we get\nlim eλ(s) tanh ρ(s) = 0,\n\ns→−∞\n\nlim eλ(s) sechρ(s) = 0,\n\ns→−∞\n\n(4.17)\nlim eλ(s) tanh ρ(s) = ∞,\n\ns→∞\n\nlim eλ(s) sechρ(s) = ∞.\n\ns→−∞\n\nTherefore this case is not suitable for the isoperimetric problem.\n\n(2) If a = 0 we have two pieces of horocycles tangent at (0, 1) that\ngenerate the umbilical surfaces with H = 1. They are represented\nby the Euclidean plane {z = 1} or the Euclidean sphere with radius\n1\n, tangent to ∂R3+ at (0, 0, 0). In the last case it occurs only one\n2\nvertical tangency point and in this case the surface meets only one\nof the horospheres (boundary) perpendicularly. In fact, taking the\nupper Euclidean half sphere that represents the horosphere we get\nthe possible isoperimetric solution for the umbilical case with H = 1.\nIn Figure 3 we see the pair of profile curves for umbilical surfaces with\nH = 1 and the horocycle that pass through the vertical tangency\npoint. Figure 4 illustrates the possible isoperimetric solution for the\numbilical case with H = 1.\n\n\f14\n\nROSA M.B. CHAVES, RENATO H.L. PEDROSA, AND MÁRCIO F. DA SILVA\n\nFigure\n3. Profile\ncurve for H = 1 and\na = 0.\n\nFigure 4. Rotational\nsurface with H = 1\nand a = 0.\n\n(3) If a > 0 the profile curves have only one self-intersection. From\n(4.6), if c+ (si ) = c+ (sj ) is a self-intersection then si = ±sj and since\nthe curves are symmetric with respect to cg , the self-intersections\nmust occur on cg . So λ(si ) = λ(s\npj ) = 0. From (4.3) we deduce that\na(1 + a)\nand a minimum point in\nλ(s) has a maximum point in −\n1 + 2a\np\na(1 + a)\n. Furthermore lim λ(s) = ∞ (see [5]), λ(0) = 0 and λ(s)\ns→∞\n1 + 2a\nis an odd function.\nWe p\nalso have that ρ(s) has only one minimum point in s = 0. So\na(1 + a)\n> 0 then ρ̇(s), λ̇(s) > 0 and\nif s >\n1 + 2a\ntanh ρ(s)λ̇(s) + sech2 ρ(s)ρ̇(s) > 0;\np\na(1 + a)\nif −\n< s < 0 we have ρ̇(s), λ̇(s) < 0, which implies that\n1 + 2a\ntanh ρ(s)λ̇(s) + sech2 ρ(s)ρ̇(s) < 0.\nIn both cases (4.9) is not verified. As a > 0 the roots s1 , s2 , s3 , s4\nof (4.10) given by (4.16) satisfy\np\np\na(1 + a)\na(1 + a)\ns1 >\n, s2 < −\n,\n1 + 2a\n1 + 2a\np\np\na(1 + a)\na(1 + a)\n0 < s3 <\n, −\n< s4 < 0.\n1 + 2a\n1 + 2a\nTherefore the vertical tangency is possible only for the positive roots\ns2 and s3 . As ρ̇(s2 ) < 0 and λ̇(s2 ) > 0, the vertical tangency in s2\npoints out upward. However ρ̇(s3 ) > 0 and λ̇(s3 ) < 0, which implies that the vertical tangency in s3 points out downward. The\nisoperimetric solution is not possible in this case because if the vertical tangencies have not occurred in the same height, then a piece\nof the rotational surface would be out of the region between the\nhorospheres (see Figure 5 and 6).\n\n\fA FREE BOUNDARY ISOPERIMETRIC PROBLEM IN H3\n\nFigure\n5. Profile\ncurve for H = 1 and\na = 1.\n\n15\n\nFigure 6. Rotational\nsurface with H = 1\nand a = 1 (excluded).\n\nEven if the vertical tangency occurred in the same height, the\nintersection of the rotational H-surface with the parallel horospheres\nwould be two concentric circles which is not possible due to Theorem\n3.2.\nThen for H = 1 the boundary of the region Ω may be a catenoid's cousin\ntype surface (see Figure 2) or umbilical with H = 1 (see Figure 4).\nWe proceed in the analogous way to study the other cases. We give here\nonly the main equations and results for them.\nSecond Case: 0 ≤ H < 1.\nTheorem 4.2. If c+ (s) = eλ(s) (tanh ρ(s), sechρ(s)), with ρ(s), λ(s) given by\n(4.4), is the parametrization of the profile curve of a rotational H-surface in\nR3+ with 0 ≤ H < 1 then\n(1) c+ (s) is symmetric with respect to the geodesic radius cg ;\n(2) the assintotic boundary of the profile curves consists of one or two\npoints.\n\nProof : The proof of (a) is similar Theorem 4.1. In [5] it is shown that\nρ(s) is ilimited but λ(s) is limited and has finite limit. Then\nlim eλ(s) sechρ(s) = 0,\n\n|s|→∞\n\nand the assintotic boundary of the profile curves consists of one or two\npoints.\nAs sinh ρ(s) ≥ 0, we have from (4.4) that\nsinh ρ(s) = 0 ⇐⇒ a = 0 e s = 0.\nIf 0 ≤ H < 1, from (4.4) it follows that\n(4.18)\n\nU 2 (s) =\n\n−A + B cosh(2αs)\nB 2 sinh2 (2αs)\n2\n.\n,\nU̇\n(s)\n=\n2α2\n2(−A + B cosh(2αs))\n\nReplacing (4.18) in (4.10) we get\n(4.19)\n\nB 2 H 2 cosh2 (2αs) − 2AB cosh(2αs) + A2 + α2 B 2 = 0.\n\n\f16\n\nROSA M.B. CHAVES, RENATO H.L. PEDROSA, AND MÁRCIO F. DA SILVA\n\nMaking t = cosh(2αs) in (4.19) we get a second degree equation whose\ndiscriminant is\n∆ = 4B 2 (1 − H 2 )2 (1 + 4aH).\nAs B > 0 in case 0 < H < 1 and a is definided for any real, we have that\n1\n, there are no vertical tangency points;\n• if a < −\n4H\n1\n• if a = −\n, there are at most two vertical tangency points in\n4H\n\u00101\u0011\n1\n(4.20)\ns = ± arccosh\n;\n2α\nH\n1\n, there are at most four vertical tangency points\n4H\n\u0010 A + (1 − H 2 )√1 + 4aH \u0011\n1\narccosh\n, s2 = −s1 ,\ns1 =\n2α\nBH 2\n\u0010 A − (1 − H 2 )√1 + 4aH \u0011\n1\ns3 =\narccosh\n, s4 = −s3 .\n2α\nBH 2\n\n• if a > −\n\n(4.21)\n\nIn particular if H = 0 equation (4.19) is written as\n2B cosh(2s) − 1 − B 2 = 0,\nwhose solutions are\n\u0010 B2 + 1 \u0011\n1\n.\ns = ± arccosh\n2\n2B\nFirst, let us suppose 0 < H < 1.\n1\n(1) If −\n≤ a < 0, we see that only the roots s2 , s4 < 0 give us\n4H\nthe vertical tangency points pointing out upward. In Figure 7 we\nsee the profile curve for H = 0.5 and a = −0.25 and the horocycles\nthat pass through the vertical tangencies. We observe that the mean\ncurvature vector for the part of the rotational surface in the interior\nof the totally geodesic (symmetry plane of the surface) points out to\nthe rotation axis so determining the isoperimetric region illustrated\nin Figure 8.\n\nFigure\n7. Profile\ncurve for H = 0.5 and\na = −0.25.\n\nFigure 8. Rotational\nsurface with H = 0.5\nand a = −0.25.\n\n\fA FREE BOUNDARY ISOPERIMETRIC PROBLEM IN H3\n\n17\n\n1\nthere is only one vertical tangency point\nIn particular if a = −\n4H\n\u0011\n\u0010\n1\n1\n< 0. Although the profile curve intersects the\ns = − arccosh\n2α\nH\nhorocycle in another point, it is not a vertical tangency point.\n(2) If a = 0 we have two pieces of equidistant curves tangent at (0, 1)\nthat generate the umbilical surfaces with 0 < H < 1. They are\nrepresented by pieces of Euclidean spheres tangent at (0, 0, 1). We\nobserve that the vertical tangency occurs only for the equidistant\nprofile curve nearest the rotation axis. As the mean curvature vector\nof this umbilical surface points out to the rotation axis it determines\na isoperimetric region.\n(3) If a > 0 only the roots s2 and s3 correspond to vertical tangencies\npointing out upward in s2 and downward in s3 , which implies that\nthis possibility is not suitable for the isoperimetric problem.\nIf H = 0 then for a < 0 or a > 0 we get only one vertical tangency point\nwhich it is not suitable for the isoperimetric problem (due to the behaviour\nof the surface). If a = 0, the rotational surface is a totally geodesic plane\nwhich is not suitable for the problem.\nFinally we conclude that for 0 ≤ H < 1 the boundary of the region Ω\nmay be a equidistant type surface (see Figure 8) or an umbilical surface with\n0 < H < 1.\n\nThird Case: H > 1.\nTheorem 4.3. If c+ (s) = eλ(s) (tanh ρ(s), sechρ(s)) with ρ(s), λ(s) given by\n(4.5) is the parametrization of the profile cuve of a rotational H-surface in\nR3+ , with H > 1, then c+ (s) is a periodic curve with period π/α.\nProof : We show that the hyperbolic length of the segment between the\npoints c+ (s) and c+ (s + π/α) keeps constant for any s. In [5] it was shown\nthat\n(4.22)\n\nρ(s + π/α) = ρ(s), λ(s + π/α) = λ(s) + λ(π/α),\n\nwhich implies from (4.6) that\nc+ (s + π/α) = eλ(π/α c+ (s).\nWe fix s0 and parametrize the segment between the points c+ (s0 ) and\nc+ (s0 + π/α) by\nβ(t) = (t,\n\nπ\n1\nt), com eλ(s0 ) tanh ρ(s0 ) ≤ t ≤ eλ(s0 ) eλ( α ) tanh ρ(s0 ).\nsinh ρ(s0 )\n\nSo its hyperbolic length is\nπ\nL(β(t)) = λ( ) cosh ρ(s0 ).\nα\n\n\f18\n\nROSA M.B. CHAVES, RENATO H.L. PEDROSA, AND MÁRCIO F. DA SILVA\n\nThe length of the segment depends only on the function ρ(s) with period\nπ/α, given in (4.22). So L(β(t)) is constant for any s0 .\nIf H > 1 we have from (4.5) that\nU 2 (s) =\n\n(4.23)\n\nB 2 cos2 (2αs)\nA + B sin(2αs)\n2\n,\nU̇\n(s)\n=\n.\n2α2\n2(A + B sin(2αs))\n\nReplacing (4.23) in (4.10) we get\n(4.24)\n\nB 2 H 2 sin2 (2αs) + 2AB sin(2αs) + A2 − α2 B 2 = 0.\n\nMaking t = sin(2αs) in (4.24), the discriminant of equation (4.24) is\n∆ = 4B 2 (H 2 − 1)2 (1 + 4aH).\n\n(4.25)\n\nFrom (4.25) we have the following analysis.\nAs H > 1 and B > 0,\n1\n• if a < −\nthere are no vertical tangency points;\n4H\n1\n• if a = −\nthe possible vertical tangency points are\n4H\nsk = s0 +\n\nkπ\n, k ∈ Z,\nα\n\ns̃k = s̃0 +\n\nkπ\n, k ∈ Z,\nα\n\n(4.26)\n\nwhere\n\u0010 1 \u0011 −π\nπ\n1\n,\narcsin\n< 2αs0 < ,\n2α\nH\n2\n2\n\u00101\u0011 π\n1\n3π\n,\ns̃0 =\narcsin\n< 2αs̃0 <\n.\n2α\nH\n2\n2\n\ns0 =\n\n• if a > −\n\n1\nthe possibilities are\n4H\nSk = S0 +\n\nkπ\n, k ∈ Z,\nα\n\nS̃k = S̃0 +\n\nkπ\n, k ∈ Z,\nα\n\nsk = s0 +\n\nkπ\n, k ∈ Z,\nα\n\ns̃k = s̃0 +\n\nkπ\n, k ∈ Z,\nα\n\n\fA FREE BOUNDARY ISOPERIMETRIC PROBLEM IN H3\n\n19\n\nwhere\n\n\u0010 −A + (H 2 − 1)√1 + 4aH \u0011 −π\nπ\n1\narcsin\n< 2αS0 < ,\n,\nS0 =\n2\n2α\nBH\n2\n2\n√\n\u0010 −A + (H 2 − 1) 1 + 4aH \u0011 π\n1\n3π\nS̃0 =\narcsin\n< 2αS̃0 <\n,\n,\n2α\nBH 2\n2\n2\n\u0010 −A − (H 2 − 1)√1 + 4aH \u0011 −π\n1\nπ\ns0 =\narcsin\n< 2αs0 < ,\n,\n2\n2α\nBH\n2\n2\n√\n\u0010 −A − (H 2 − 1) 1 + 4aH \u0011 π\n3π\n1\narcsin\n.\n, < 2αs̃0 <\ns̃0 =\n2\n2α\nBH\n2\n2\nNow we determine when the vertical tangency really occurs, depending\non the geometry of the profile curve.\n1\n≤ a < 0 only the roots S̃k , s̃k furnish the vertical tan(1) If −\n4H\ngency points pointing out upward. In Figure 9 we see a hyperbolic\nonduloid.\n\nFigure 9. Hyperbolic onduloid with H = 3 and a = −0.05.\n(2) If a = 0 we have tangent geodesic half circles along de rotation axis.\nEach geodesic half circle generates a geodesic sphere in R3+ which\nare umbilical surfaces with H > 1 and isoperimetric regions.\n(3) If\ni a > 0 we analyse\nh the behaviour of the profile curve in the interval\n− π/4α, 3π/4α since according to Theorem 4.3 the profile curves\nare periodic with period π/α. It is easy to see that only the roots\ns0 and S̃0 furnish the vertical tangency pointing out downward in s0\nand upward in S̃0 . This case corresponds to the so called hyperbolic\nnodoids, which are not embedded surfaces.\n\n\f20\n\nROSA M.B. CHAVES, RENATO H.L. PEDROSA, AND MÁRCIO F. DA SILVA\n\nWe conclude that for H > 1 the boundary of the region Ω can be an\nonduloid's type surface (see Figure 9) or an umbilical surface with H > 1.\nNext we prove Theorem 1.1. We start with the existence an then we\nobtain the possible minimizing regions.\nProof of Theorem 1.1: By Theorem 3.2 , the solutions to the isoperimetric problem have as boundaries rotationally invariant surfaces which have\nconstant mean curvature where they are regular. But they must be regular (actually analytic), since the singularities along such boundaries must\nhave, by well-known results, (Hausdorff) codimension at least 7, which is\nnot possible for (2-dimensional) surfaces. Now, from [10] the existence of\nthe isoperimetric solutions follows from the fact that Fc1 ,c2 /G is compact,\nwhere G is the group of isometries of R3+ whose elements let invariant the\nregion Fc1 ,c2 between the horospheres, that is, the rotations around a vertical geodesic and the horizontal translations. The second part of Theorem\n1.1 follows from the analysis of vertical tangencies done in the First, Second\nand Third Cases above.\n\nReferences\n[1] Alexandrov, A.D., Uniqueness theorems for surfaces in the large, AMS Transl. 21\n(1962).\n[2] Athanassenas, M., A variational problem for constant mean curvature surfaces with\nfree boundary, J. Reine Angew. Math. 377 (1986), 97-107.\n[3] Barbosa, J.L., Carmo, M. do, Stability of hypersurfaces with constant mean curvature,\nMath. Z. 185 (1984), 339-353.\n[4] Barbosa, J.L., Carmo, M. do, Eschenburg, J., Stability of hypersurfaces of constant\nmean curvature in Riemannian Manifolds, Math. Z. 197 (1988), 123-138.\n[5] Barrientos, J.O., Superfı́cies helicoidais com curvatura média constante em espaços\nforma tridimensionais, Tese de Doutorado, PUC-RJ, 1995.\n[6] Earp, R.S., Barbosa, J.L., Geometric Methods and nonlinear analysis in hyperbolic\nspace, Escola de Geometria Diferencial (10: 1998: Belo Horizonte, BR).\n[7] Finn, R., Equilibrium Capillary Surfaces, New York, Springer, 1986.\n[8] López, R., Constant Mean Curvature Surfaces with boundary in hyperbolic space,\nMonath. Math 127 (1999), 155-169.\n[9] López, R., Symmetry of stationary hypersurfaces in the hyperbolic space, Geometriae\nDedicata 119 (2006), 35-47.\n[10] Morgan, F., Clusters minimizing area plus length of singular curves, Math. Ann. 299\n(1994), 697-714.\n[11] Morgan, F., Geometric Measure Theory (A begginer's guide), Academic Press, 2nd\nedition, San Diego, 1995.\n[12] Pedrosa, R.H.L., Ritoré, M., Isoperimetric Domains in the Riemannian product of a\ncircle with a simply connected space form and applications to free boundary problems,\nIndiana Univ. Math. J. (4)48 (1999), 1357-1394.\n[13] Ritoré, M., Ros, A., Some updates on isoperimetric problems, Springer-Verlag, (4)24,\nNew York, 2002.\n[14] Vogel, T., Stability of a drop trapped between two parallel planes, SIAM Journal Applied Mathemathics (3)47 (1987), 1357-1394.\n\n\fA FREE BOUNDARY ISOPERIMETRIC PROBLEM IN H3\n\nInstituto de Matemática e Estatı́stica\nUniversidade de São Paulo\nRua do Matão, 1010, São Paulo - SP, Brazil\nCEP 05508-090\nE-mail address: rosab@ime.usp.br\nInstituto de Matemática, Estatı́stica e Computação Cientı́fica\nUniversidade Estadual de Campinas\nRua Sérgio Buarque de Holanda, 651, Campinas - SP, Brazil\nCEP: 13083-859\nE-mail address: pedrosa@ime.unicamp.br\nCentro de Matemática, Computação e Cognição\nUniversidade Federal do ABC\nRua Catequese, 242, Santo André - SP, Brazil\nCEP 09090-400\nE-mail address: marcio.silva@ufabc.edu.br\n\n21\n\n\f"}