{"id": "http://arxiv.org/abs/1103.3999v2", "guidislink": true, "updated": "2013-03-20T12:52:02Z", "updated_parsed": [2013, 3, 20, 12, 52, 2, 2, 79, 0], "published": "2011-03-21T13:16:28Z", "published_parsed": [2011, 3, 21, 13, 16, 28, 0, 80, 0], "title": "Graphene Nanoribbon in Sharply Localized Magnetic Fields", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1103.3411%2C1103.1686%2C1103.6261%2C1103.1697%2C1103.4428%2C1103.3222%2C1103.3373%2C1103.5437%2C1103.5255%2C1103.4697%2C1103.3999%2C1103.1610%2C1103.3688%2C1103.2912%2C1103.5843%2C1103.4342%2C1103.2901%2C1103.1352%2C1103.2094%2C1103.2324%2C1103.1908%2C1103.5532%2C1103.5555%2C1103.4173%2C1103.4930%2C1103.1926%2C1103.4602%2C1103.0777%2C1103.5172%2C1103.0447%2C1103.1566%2C1103.3528%2C1103.0961%2C1103.2096%2C1103.2421%2C1103.0848%2C1103.1892%2C1103.3375%2C1103.3538%2C1103.0301%2C1103.0374%2C1103.5659%2C1103.4521%2C1103.2277%2C1103.3295%2C1103.3636%2C1103.4338%2C1103.2701%2C1103.1942%2C1103.3515%2C1103.5770%2C1103.5928%2C1103.0662%2C1103.4690%2C1103.3533%2C1103.3716%2C1103.2214%2C1103.0453%2C1103.3807%2C1103.2909%2C1103.1954%2C1103.1710%2C1103.3887%2C1103.0796%2C1103.4401%2C1103.1433%2C1103.2576%2C1103.2265%2C1103.4792%2C1103.1803%2C1103.4069%2C1103.5453%2C1103.3597%2C1103.6158%2C1103.3495%2C1103.5932%2C1103.3742%2C1103.1559%2C1103.5828%2C1103.3207%2C1103.4033%2C1103.3867%2C1103.5526%2C1103.0504%2C1103.6146%2C1103.4749%2C1103.5259%2C1103.3769%2C1103.0213%2C1103.1283%2C1103.5747%2C1103.3280%2C1103.4862%2C1103.3219%2C1103.0446%2C1103.0074%2C1103.3703%2C1103.0865%2C1103.2458%2C1103.0859%2C1103.1391&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Graphene Nanoribbon in Sharply Localized Magnetic Fields"}, "summary": "We study the effect of a sharply localized magnetic field on the electron\ntransport in a strip (ribbon) of graphene sheet, which allows to give results\nfor the transmission and reflection probability through magnetic barriers. The\nmagnetic field is taken as a single and double delta type localized functions,\nwhich are treated later as the zero width limit of gaussian fields. For both\nfield configurations, we evaluate analytically and numerically their\ntransmission and reflection coefficients. The possibility of spacial\nconfinement due to the inhomogeneous field configuration is also investigated.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1103.3411%2C1103.1686%2C1103.6261%2C1103.1697%2C1103.4428%2C1103.3222%2C1103.3373%2C1103.5437%2C1103.5255%2C1103.4697%2C1103.3999%2C1103.1610%2C1103.3688%2C1103.2912%2C1103.5843%2C1103.4342%2C1103.2901%2C1103.1352%2C1103.2094%2C1103.2324%2C1103.1908%2C1103.5532%2C1103.5555%2C1103.4173%2C1103.4930%2C1103.1926%2C1103.4602%2C1103.0777%2C1103.5172%2C1103.0447%2C1103.1566%2C1103.3528%2C1103.0961%2C1103.2096%2C1103.2421%2C1103.0848%2C1103.1892%2C1103.3375%2C1103.3538%2C1103.0301%2C1103.0374%2C1103.5659%2C1103.4521%2C1103.2277%2C1103.3295%2C1103.3636%2C1103.4338%2C1103.2701%2C1103.1942%2C1103.3515%2C1103.5770%2C1103.5928%2C1103.0662%2C1103.4690%2C1103.3533%2C1103.3716%2C1103.2214%2C1103.0453%2C1103.3807%2C1103.2909%2C1103.1954%2C1103.1710%2C1103.3887%2C1103.0796%2C1103.4401%2C1103.1433%2C1103.2576%2C1103.2265%2C1103.4792%2C1103.1803%2C1103.4069%2C1103.5453%2C1103.3597%2C1103.6158%2C1103.3495%2C1103.5932%2C1103.3742%2C1103.1559%2C1103.5828%2C1103.3207%2C1103.4033%2C1103.3867%2C1103.5526%2C1103.0504%2C1103.6146%2C1103.4749%2C1103.5259%2C1103.3769%2C1103.0213%2C1103.1283%2C1103.5747%2C1103.3280%2C1103.4862%2C1103.3219%2C1103.0446%2C1103.0074%2C1103.3703%2C1103.0865%2C1103.2458%2C1103.0859%2C1103.1391&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study the effect of a sharply localized magnetic field on the electron\ntransport in a strip (ribbon) of graphene sheet, which allows to give results\nfor the transmission and reflection probability through magnetic barriers. The\nmagnetic field is taken as a single and double delta type localized functions,\nwhich are treated later as the zero width limit of gaussian fields. For both\nfield configurations, we evaluate analytically and numerically their\ntransmission and reflection coefficients. The possibility of spacial\nconfinement due to the inhomogeneous field configuration is also investigated."}, "authors": ["Abdulaziz D. Alhaidari", "Hocine Bahlouli", "Abderrahim El Mouhafid", "Ahmed Jellal"], "author_detail": {"name": "Ahmed Jellal"}, "author": "Ahmed Jellal", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1140/epjb/e2012-30701-2", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1103.3999v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1103.3999v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "20 pages, 14 figures, clarification and reference added, misprints\n  corrected. Version published in EPJB", "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.MP", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1103.3999v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1103.3999v2", "journal_reference": "Eur.Phys.J.B86:73,2013", "doi": "10.1140/epjb/e2012-30701-2", "fulltext": "ucd-tpg:1103.02\n\nGraphene Nanoribbon in Sharply Localized Magnetic Fields\n\narXiv:1103.3999v2 [cond-mat.mes-hall] 20 Mar 2013\n\nA.D. Alhaidaria , H. Bahloulia,b , A. El Mouhafida,c and A. Jellala,c,d∗\na Saudi\n\nCenter for Theoretical Physics, Dhahran, Saudi Arabia\nDepartment, King Fahd University of Petroleum & Minerals,\nDhahran 31261, Saudi Arabia\nc Theoretical Physics Group, Faculty of Sciences, Chouaı̈b Doukkali University,\n24000 El Jadida, Morocco\nd Physics Department, College of Sciences, King Faisal University,\nAlahssa 31982, Saudi Arabia\nb Physics\n\nAbstract\nWe study the effect of a sharply localized magnetic field on the electron transport in a strip (ribbon) of graphene sheet, which allows to give results for the transmission and reflection probability\nthrough magnetic barriers. The magnetic field is taken as a single and double delta type localized\nfunctions, which are treated later as the zero width limit of gaussian fields. For both field configurations, we evaluate analytically and numerically their transmission and reflection coefficients. The\npossibility of spacial confinement due to the inhomogeneous field configuration is also investigated.\n\nPACS numbers: 72.80.Vp, 73.21.-b, 71.10.Pm, 03.65.Pm\nKeywords: graphene, scattering, pseudo-scalar potential, bound states.\n\n∗\n\najellal@ictp.it - a.jellal@ucd.ac.ma\n\n\f1\n\nIntroduction\n\nGraphene, a single sheet of pure carbon atoms, has been the subject of intense focus and research for\nthe last few years due to its unique and amazing properties that could make it more suitable for future\nelectronic devices and possibly replace silicon-based semiconductors in electronics [1, 2]. Graphene\nnanoribbons, in particular, are of interest because they exhibit a conduction bandgap that arises due\nto size confinement and edge effects [3]-[11]. From the electronic applications point of view, graphenebased materials with gap are very desirable. This lead to substantial theoretical and experimental\nefforts to generate and control the energy gap in graphene based devices. One approach is based on\nquantum confinement as in quantum dots and nanoribbons, where it was shown that the energy gap\nvalue increases with decreasing nanoribbon width [12].\nTheoretical studies have suggested that graphene nanoribbons could have interesting magnetoelectronic properties, with predicted very large magnetoresistance [4, 13]. Experimental observation\nof a significant enhancement in the conductance of a graphene nanoribbon field-effect transistor by a\nperpendicular magnetic field has been reported recently [14]. They have observed an extraordinarily\nlarge tunable magnetoresistance in graphene nanoribbon–FET devices and an increase in conductance\nby a factor of over 10,000 was demonstrated at 1.6K. This magnetoresistance can be readily tuned\nby the gate voltage and source-drain bias, with enhancement reaching maxima near the edges of the\nconduction bandgap. These experimental findings clearly demonstrate that the graphene nanoribbons\nexhibit interesting magneto-transport properties, with the possibility of opening up exciting opportunities in magnetic sensing and a new generation of magneto-electronic devices.\nOn the other hand, more efforts have been made to understand the scattering behavior of fermions\nin graphene. In particular we cite [15] where the transmission through magnetic barriers in graphenebased nanostructures were studied. Several particular cases were considered: a magnetic step, single\nand double barriers, and δ-function barriers. A separate class of magnetic-barrier structures are those\nwith inhomogeneous magnetic-field profiles, such that the average magnetic field vanishes, which can be\nrealized by nanostructured ferromagnetic stripes placed on top of the graphene layer. Quantum bound\nstates that are localized near or in the barrier are predicted for a magnetic step and some structures\nwith finite-width barriers but none for δ-function barriers. When a bound state is localized close to\nthe barrier edge, it has a nonzero velocity parallel to this edge. The transmission depends strongly\non the direction of the incident electron or hole wave vector and gives the possibility to construct\na direction dependent wave vector filter. In general, the resonant structure of the transmission is\nsignificantly more pronounced for (Dirac) electrons with linear spectrum than for the usual electrons\nwith a parabolic spectrum.\nMotivated by different results on the scattering behavior, we study fermions in graphene nanoribbon subject to a sharply localized magnetic field. We show that the solution space of the present\nsystem is the union of two solution subspaces governed by two different kinetic balance equations.\nThese two solution subspaces are not identical and their union constitutes the whole space of solution\nof the problem. To know which energy domain is selected by each kinetic balance relation, we perform\na unitary transformation on the fundamental Dirac equation. Such a transformation does not affect\nthe energy spectrum or the physics of the problem. After matching the eigenspinors at the boundary\nconditions, we evaluate the reflection and transmission amplitudes in terms of the energy and magnetic\n1\n\n\ffield. A detailed study of their coefficients is presented as well.\nSubsequently, we consider a magnetic field of a bell shape normal to the graphene strip, which\n~\nis stretched along the x-axis, i.e. B(x)\n= ẑB0 sech2 (μx) where B0 is the strength of the field and\nμ−1 represents its range. We show that the solution space of the corresponding Hamiltonian splits\ninto three regions depending on the sign of kB0 and the energy range, with k being the wave vector\nalong the y-axis. Using the corresponding current density, we evaluate the reflection and transmission\ncoefficients, which reduce to those obtained in section 3 for very large μ. Finally, we treat the case of\na double step pseudoscalar potential and also double Gaussian type magnetic field.\nThe manuscript is organized as follows. We present our theoretical model by setting up the general\nform of potential in section 2. As a first illustration, we consider δ-type magnetic field in section 3.\nAfter obtaining the solutions of the energy spectrum, we study the scattering problem by evaluating\nexplicitly the reflection and transmission coefficients and investigate their physical properties. Because\nthe δ-type magnetic field is a limiting case of a sharply peaked field, we study Dirac fermions in a\nGaussian magnetic field, in section 4. These results motivated us to deal with an integrating case of a\ndouble δ-type magnetic field in section 5 and the corresponding double Gaussian type magnetic field\nis considered in the appendix. We conclude our work in the final section.\n\n2\n\nTheoretical model\n\nIn graphene, the low energy linear electronic band dispersion near the Dirac points gave rise to charge\ncarriers (electrons or holes) that propagate as if they were massless fermions with speeds of the order\nof 106 m/s rather than the speed of light 3 × 108 m/s. Hence, charge carriers in this system should be\ndescribed by the massless Dirac equation rather than the usual Schrodinger equation. However, we\nshould stress that such a continuum approximation remains valid up to wave vectors of the order of\nthe inverse lattice spacing. Under this approximation we can describe our charge carriers by a gauge\ninvariant Dirac Hamiltonian in 2 + 1 space-time dimensions with minimal coupling to the three-vector\n~ = (V, Ax , Ay ) as follows\npotential Aμ = (A0 , A)\n~ + A)\n~\nH = mγ0 + V + γ0~γ * (i∇\n\n(1)\n\nwhere γ0 = σ3 , ~γ = (γx , γy ) = i(σ1 , σ2 ) and {σi }3i=1 are the 2×2 Pauli matrices. Adopting the\nconventional relativistic units ~ = c = e = 1, we obtain [16]\n!\n∂\n∂\nm+V\n− ∂x\n+ i ∂y\n+ iAx + Ay\nH=\n.\n(2)\n∂\n∂\n−m + V\n∂x + i ∂y − iAx + Ay\nAs we claimed before, for a system made of graphene the charge carriers are massless m = 0 and\nmoving with the Fermi velocity vF (about 106 m/s). Moreover, we specialize to a physical configuration\n~ = ŷW (x). Thus,\ncorresponding to a single graphene sheet in a magnetic field with vector potential A\nthe associated stationary Dirac equation becomes\n! + \n∂\n∂\nψ\n−ε\n− ∂x\n+ i ∂y\n+W\n −  = 0.\n(3)\n∂\n∂\nψ\n+i +W\n−ε\n∂x\n\n∂y\n\n2\n\n\fWe can separate variables and write\nψ ± (x, y) = φ± (x)χ(y)\n\n(4)\n\nwhere χ(y) = e−i ky and k is a real parameter that stands for the wave number of the excitations along\nthe y-axis. The resulting reduced equation is given by\n!\n!\nd\nφ+\n+W +k\n−ε\n− dx\n= 0.\n(5)\nd\nφ−\n−ε\ndx + W + k\nIn the present representation W plays the role of a pseudoscalar potential coupling. The above\nequation is equivalent to the following set of equations\n\u0013\n\u0012\n1\nd\n∓\nφ =\n+ W + k φ±\n(6)\n±\nε\ndx\n\u0014\n\u0015\nd2\ndW\n2\n2\n2\n− 2 +W ∓\n+ 2kW + k − ε φ± = 0.\n(7)\ndx\ndx\nThe structure of the Schrödinger-like equation (7) has the features associated with supersymmetric\nquantum mechanics (SSQM) [17]. The two potential partners in SSQM are V 2 ± V ′ , where V is the\nsuperpotential and in our case we have V = W + k. The relativistic extension of SSQM exhibited\nin some models that are governed by the Dirac theory is due to the fact that the associated Dirac\nHamiltonian is an element of the 4-dimensional superalgebra U (1/1), which is a Z2 graded extension\nof SO(2, 1) Lie algebra [18]. It is interesting to note that the corresponding massive (1+1) Dirac\nequation\n!\n!\nd\n+W\nφ+\nm − ε − dx\n=0\n(8)\nd\n−m − ε\nφ−\ndx + W\nresults in the following Schrödinger-like equation\n\u0015\n\u0014\ndW\nd2\n2\n2\n2\n+ m − ε φ± = 0\n− 2 +W ∓\ndx\ndx\n\n(9)\n\nwhich has the same structure associated with SSQM as in (7) with the mapping W → W +k. Therefore,\nthe solution of the two problems are similar with k playing the role of the mass m. We have encountered\nthis phenomenon before, where space reduction (due to compactification or symmetry) transforms the\n2D massless problem into an effective 1D massive problem [19]. Note that the complete solution space\nof the Dirac equation (5) is the union of the two solution subspaces of equations (6) and (7) with\nthe top and bottom signs, respectively. Below, we identify the energy regions associated with each\nsubspace.\n\n3\n\nDirac Fermions in a δ-type magnetic field\n\nHere we consider the zero range and infinite strength limit where the magnetic field takes the form\n~\nB(x)\n= ẑB0 δ(x/a), with a is a length scale parameter. The main advantage of this configuration is\nthat it is amenable to analytical treatment and interesting results. Thus, the single-step pseudoscalar\npotential is given by\nW (x) = aB0 Θ(x/a)\n(10)\n3\n\n\fwhere Θ(x) being the Heaviside step function, such as\n(\n1,\nΘ(x) =\n0,\n\nx>0\nx<0\n\n(11)\n\nFigure 1 shows the schematics of a laboratory set-up where a coil of a rectangular cross section with\nvery narrow width will result in the necessary current sheet that should produce a magnetic field\napproximating that of our problem. The graphene ribbon is the strip that penetrates the coil along\nthe x -axis in the figure:\n\nFig. 1: Schematic of a set-up where a coil of a rectangular cross section with very narrow width produces\na magnetic field approximating that of our problem.\nTo study the scattering behavior in the present problem, we first determine the plane wave solutions\nassociated with both regions, ±x > 0. The two components of the wavefunction satisfying equations\n(6) and (7) with the top sign are given by\n\u0012\n\u0013\n1\nd\n−\nφ =\n+ ω± φ+\n+\n(12)\nε\ndx\n\u0015\n\u0014\nd2\n2\n2\n(13)\n− 2 + ω± − ε φ+ = 0\ndx\nwith ω+ = aB0 + k and ω− = k. It is easy to show that the solution of these equations reads\n!\n!\n1\n1\nφ(x) = A\neκ± x + B\ne−κ± x\nα±\nβ±\nwhere the parameters read as\nq\n2 − ε2 ,\nκ± = ω±\n\nα± = (ω± +κ± ) /ε,\n\nβ± = (ω± −κ± ) /ε.\n\nOn the other hand, considering the lower sign in equations (6) and (7) for ±x > 0 we obtain\n\u0012\n\u0013\n1\nd\n+\nφ =\n+ ω± φ−\n−\nε\ndx\n\u0015\n\u0014\nd2\n2\n2\n− 2 + ω± − ε φ− = 0\ndx\n4\n\n(14)\n\n(15)\n\n(16)\n(17)\n\n\fwhich can be solved to give\nφ(x) = A\n\nβ±\n1\n\n!\n\neκ± x + B\n\nα±\n1\n\n!\n\ne−κ± x .\n\n(18)\n\nIn summary, the oscillatory solutions (for both cases and for ±x > 0) are obtained for all |ε| > |ω± |\nwhile evanescent wave solutions will result if |ε| < |ω± |. Thus the quantity |ω± | plays the role of an\neffective mass with different asymptotic values at ±x > 0. That is, our massless problem is equivalent\nto a space dependent massive problem whose effective mass depends on the strength of the localized\nmagnetic field and the value of component of the wave number along the y-direction.\nWe need to reassert that the total solution space of the problem is the union of the two solution\nsubspaces (6) and (7). These two solution subspaces are, in general, not identical and their union\nconstitutes the whole space of solution of our problem. To resolve the issue of which energy domain\nis selected by which kinetic balance relation (12) or (16), we perform a unitary transformation on the\nfundamental Dirac equation (5). Such a transformation does not affect the physics of the problem.\nπ\nWe choose a rotation by π/4 about the y-axis, U = ei 4 σ2 . Thus, the transformed Hamiltonian and\nwavefunction read\nH̃ = U HU † = −iσ2\n\nd\n+ (W + k)σ3\ndx\n\n(19)\n\nφ̃ = U φ\nthen (5) becomes\n\u0010\n\n\u0014\n\u0015\n\u0011\nd\nH̃ − εI φ̃ = −iσ2\n+ (W + k)σ3 − εI φ̃\ndx\n\n(20)\n\nleading to the following new kinetic balance relation\n\nd ±\n∓1\nφ̃\nε ± (W + k) dx\n\n(21)\n\nε = ∓ (aB0 + k) = ∓ω+ .\n\n(22)\n\nφ̃∓ =\nwhich is not valid for\n\nThus, for k > −aB0 , this relation with the top/bottom sign corresponds to the positive/negative energy subspace2 . Now, since equation (20) results from a unitary transformations of (12) and (16), then\nthe same applies to those equations as well. That is, equations (12) and (16) are valid for positive and\nnegative energy, respectively. Figure 2 shows the potential configuration of the problem. Dark/light\ngrey areas correspond to negative/positive energy continuum where the solution is oscillatory of the\nform e±iκx . The white areas correspond to bound states where the solutions are exponentials, e±κx .\nIn the subsequent developments, we will only be considering scattering solutions with a normalized\nincident beam from left. Thus, the relativistic energy must be ε > |k| and the solution space is built\nonly from the positive energy solutions (14).\n2\n\nHowever, if k < −aB0 then the top/bottom sign corresponds to negative/positive energy subspace.\n\n5\n\n\fe±ikx\n\n+ Ω+\n\n1Þ\nRÞ\n\naB0\nT\n\nÞ\n\n+k\ne±kx\n ́\n\n0\n\nx\n\n-k\n\n- Ω+\n\ne±ikx\n\nFig. 2: The potential configuration of the problem. Dark/light grey areas correspond to negative/positive\nenergy continuum. The white areas correspond to bound states where the solutions are exponentials.\nThe total solution space splits into two regions depending on the energy range as follows. For\n|k| < ε < |ω+ |, scattering with total reflection will take place. It should be noted that there is no\nKlein tunneling in this problem due to the absence of vector interaction. With a normalized incident\nflux from left, the solution of equation (5) is obtained from (14) as\nφ(x) =\n\n(\n\n1\nα\n\nwhere we have set\n\n\u0001\n\n−iκx ,\n1\nα∗ e\ne−κ+ x ,\n\neiκx\u0010 + \u0011\nR\nA\n\nκ = |κ− | =\n\n1\nβ+\n\np\n\n\u0001\n\nε2 − k2 ,\n\nx<0\nx>0\n\nα = (k − iκ)/ε.\n\n(23)\n\n(24)\n\nContinuity of the wavefunction at x = 0 gives the reflection amplitude\nR=−\n\naB0 + κ+ + iκ\nβ+ − α\n=−\nβ+ − α∗\naB0 + κ+ − iκ\n\n(25)\n\nand the normalization parameter A = 1 + R. It is clear that we have complete reflection in this case\nsince |R| = 1. It is also worth mentioning that the probability density in the positive x-direction is\ngiven by\nρ(x) = |A|2 e−2|κ+ |x (1 + |β+ |2 )\n(26)\nwhich shows that the penetration depth, λ, of the Fermion into the barrier region defined by\nλ=\n\n1\n1\n= p\n2\n2|κ+ |\n2 (aB0 + k)2 − ǫ2\n\n(27)\n\ndecreases very rapidly with increase in the magnetic field strength. This result indicates the possibility\nto confine the fermions in any region between two δ-like magnetic fields generated by a symmetric\ndouble step pseudoscalar potential, this situation will be treated in section 5.\n\n6\n\n\fNow, let us move on to analyze the scattering situation when ε > |ω+ | so that partial reflection\nwill take place. Again, with a normalized incident wave from left, the solution of (5) is obtained from\n(14) as\n( 1 \u0001 iκx\n\u0001 −iκx\n1\n,\nx<0\n+R\nα e\nα∗ e\n\u0011\n\u0010\n(28)\nφ(x) =\niγx\n1\nx>0\nT β e ,\n\nwith the quantities\n\nγ = |κ+ | =\n\nq\n\n2,\nε2 − ω+\n\nβ = (ω+ − iγ) /ε.\n\n(29)\n\nAgain matching the spinor wavefunctions at x = 0 gives the reflection and transmission amplitudes\nR=−\n\nα−β\n,\nα∗ − β\n\nT =\n\n2iκ/ε\n.\nα∗ − β\n\n(30)\n\nOne can verify the flux conservation relation\n|R|2 + |γ/κ| |T |2 = 1.\n\n(31)\n\nFigure 3 is a plot of the reflection and transmission coefficients as a function of the energy for several\nvalues of the magnetic field strength B0 .\nT,R\n\nT,R\n\n1.0\n\n1.0\n\n(a)\n\n(b)\n0.8\n\n0.8\n0.5\n\n1\n\nT\nR\n\n0.6\n\n0.6\n\n0.4\n\n0.4\n\n0.2\n\n0.2\n\nT\nR\n\nΕ\n2\n\n4\n\n6\n\n8\n\nΕ\n\n10\n\n2\n\n4\n\n6\n\n8\n\n10\n\nFig. 3: Reflection and transmission amplitudes as a function of energy for B0 = 0.5, 1.0, 2.0, 3.0, 5.0 in\np\nunits of a−2 (left to right curves) where (a) for k = 0.5 and (b) for k = 1. We defined T(ε) = T (ε) γ/κ.\nIt is also worthwhile to study the transmission coefficient as a function of the magnetic field strength\nB0 . For this purpose we can write explicitly |T |, in this regime, as follows\nv\nu\nε2 − k2\n(32)\n|T | = 2u\n\u00112\n\u0010√\nt\np\n(aB0 )2 +\nε2 − k2 + ε2 − (aB0 + k)2\n\nwhich shows clearly that the transmission is unity at B0 = 0 and reduces to zero for strong field.\nFigure 4 shows the behavior of the transmission and reflection coefficients as a function of the applied\nmagnetic field. We would like to note that the transmission vanishes for energies below the critical\nenergy value of ε∗ = |ω+ | = B0 + k, as shown in figure 3. A similar remark can be made regarding\nfigure 4.\n7\n\n\fT,R\n1.0\n\n0.8\n\nT\nR\n\n0.6\n\n0.4\n\n0.2\n\n2\n\n4\n\n6\n\n8\n\nB0\n\nFig. 4: Reflection and transmission amplitudes as a function of strength of the field for ε = 3, 4, 8 in units\nof a−2 (left to right curves) and k = 2.\n\n4\n\nDirac fermions in a Gaussian magnetic field\n\nWe consider a magnetic field normal to the graphene sheet of a bell shape. Specifically, we take\n~\nB(x)\n= ẑB0 sech2 (μx) (Fig. 5) [20, 21], where B0 is the strength of the field and μ−1 stands for its\nrange. The corresponding vector potential (Fig. 5) is\n~\nA(x)\n= ŷW (x) = ŷ (B0 /μ) tanh(μx)\nwhich turns equation (7) into\n#\n\"\n\u0012\n\u00132\n\u0001\nB0\nd2\n2\n2\ntanh μx + k − ε φ± = 0.\n− 2 ∓ B0 1 − tanh μx +\ndx\nμ\n\nNote that as x → ±∞, this equation reduces to a simple form\n\u0012\n\u0013\nd2\n2\n− 2 + ω±\n− ε2 φ± = 0\ndx\n\n(33)\n\n(34)\n\n(35)\n\nwhere ω± = k ± B0 /μ. This equation is similar to that of a massive 1D problem with asymptotic\nmasses m = |ω± | at x → ±∞. The solution space of (34) splits into three regions depending on the\nsign of kB0 and the energy range. If kB0 > 0, then |ω− | < |ω+ | and these energy regions can be\ndefined as follows\n• |ε| < |ω− |: Bound states with the boundary condition lim φ(x) = 0.\nx→±∞\n\n• |ω− | < |ε| < |ω+ |: Scattering with total reflection to the negative x -axis (note that there is\nno Klein tunneling in this problem due to the absence of vector\u0010interaction).\nThe\n\u0011\n\u0010 boundary\n\u0011\ni\nκ\nx\n1\n−i\nκ\nx\n1 , where\n−\n−\nconditions in this case are: lim φ(x) = 0, lim φ(x) = e\n+\nRe\n∗\nρ−\nρ−\nx→+∞\nx→−∞\nq\n2 , ρ = 1 (ω − iκ ) and the reflection amplitude is such that |R| = 1.\nκ± = ε2 − ω±\n±\n±\n±\nε\n\u0010 \u0011\n• |ε| > |ω+ |: Scattering solutions occur with the boundary conditions: lim φ(x) = T ei κ+ x ρ1+ ,\nx→+∞\n\u0010 \u0011\n\u0010 \u0011\ni\nκ\nx\n1\n−i\nκ\nx\n1\nlim φ(x) = e − ρ− + Re − ρ∗ , where is T the transmission amplitude such that\nx→−∞\n\n−\n\n8\n\n\f|R|2 + |ρ+ /ρ− | |T |2 = 1. However, if kB0 < 0, then |ω− | > |ω+ | and the above subspaces should\nbe interchanged with ω+ ↔ ω− and x → −x.\nBHxL\n\nWHxL\n\nWHxL\n\n2\n\nΜ=2\nΜ=1\n\n2.0\n\n0.002\n\nΜ=1000\n\n1\n\n1.5\n\n0.001\n\nΜ=2\nΜ=1\n1.0\n\nx\n-4\n\n2\n\n-2\n\n4\n\n-4\n\n2\n\n-2\n\n4\n\nx\n\n0.5\n-1\n\n-0.001\n\n-2\n\n-0.002\n\n-4\n\n2\n\n-2\n\n4\n\nx\n\nFig. 5: Hyperbolic tangent pseudoscalar potential profile along with the associated magnetic field for the\nstrength B0 = 2.\nTo be more specific, let us consider the scattering problem in the negative x regions, x < 0. Making\nthe change of variable z = −e2μx , equation (34) becomes\n#\n\"\n\u0012\n\u00132\n\u0012\n\u0013\nd\n1\n+\nz\nB\nd\n4z\n0\n(36)\n4μ2 z\n− −\n+ k + ε2 φ± = 0.\nz\n∓ B0\ndz\ndz\n(1 − z)2\nμ 1−z\nNow, we solve (36) for φ+ and then deduce φ− using (6). In doing so, we multiply (36) by 1−z\nz\n′\nλ\n±\nh\nand make the change φ = z (1 − z) F (z) to end up with\n\"\n\u00132 !#\n\u0012\n\u0001\nd2\nB\nd\n1\n0\nz(1 − z) 2 + 2h′ + 1 − z(2h′ + 2λ + 1)\nF = 0.\n− (h′ + λ)2 + 2 −ε2 +\n+k\ndz\ndz\n4μ\nμ\n(37)\nThis is nothing but the hypergeometric second order differential equation. Therefore, the general\nsolution for φ+ can be expressed in terms of the hypergeometric functions [22]\n′\n\nφ+ = Az h (1 − z)λ 2 F1 h′ − ν + λ, h′ + ν + λ, 1 + 2h; z\n\n\u0001\n\n\u0001\n′\n(38)\n+ Bz −h (1 − z)λ 2 F1 −h′ − ν + λ, −h′ + ν + λ, 1 − 2h′ ; z\n√ 2 2\n√ 2 2\n√ 2\nω− −ε\nω+ −ε\nk +4B0 +4(B0 /μ)2\n1\n′\nwhere we have set h =\n,\nν\n=\nand\nλ\n=\n−\n. To study the scattering\n2μ\n2μ\n2\n2μ\nproblem we need to investigate the asymptotic behavior of (38) when x → −∞, which corresponds to\nz → 0. Using the asymptotic behavior of the hypergeometric functions we obtain for φ+\nlim φ+ = Aeik− x + Be−ik− x\n\nx→−∞\n\nwith k− =\n\nq\n\n(39)\n\n2 . From (6) the other component, φ− , is given by\nε2 − ω−\n\n1\nφ =\nε\n−\n\n\u0012\n\n\u0013\nd\nB0\n+\n+ k φ+ .\ndx\nμ\n\n(40)\n\nSubstituting equation (39) in (40) gives the asymptotic behavior of φ−\nlim φ− = Aη+ eik− x + Bη− e−ik− x\n\nx→−∞\n\n9\n\n(41)\n\n\f−\nwhere η± = ω+ ±ik\n.\nε\nNext, we consider the solution of equation (34) for x > 0. The analysis of the solution can be\nsimplified by making the substitution z = −e−2μx . Equation (34) becomes\n#\n\"\n\u00132\n\u0012\n\u0012\n\u0013\nB\n1\n+\nz\nd\n4z\nd\n0\n(42)\n+ k + ε2 φ± = 0.\n−\nz\n∓ B0\n4μ2 z\ndz\ndz\n(1 − z)2\nμ 1−z\n\nThe general solution to the above is\nφ+ = Cz h (1 − z)λ 2 F1 (h − ν + λ, h + ν + λ, 1 + 2h; z)\n\n(43)\n+ Dz −h (1 − z)λ 2 F1 (−h − ν + λ, −h + ν + λ, 1 − 2h; z)\n√ 2 2\n√ 2 2\n√ 2\nω+ −ε\nω− −ε\nk +4B0 +4(B0 /μ)2\nwhere h =\n,ν=\nand λ = 12 −\n.\n2μ\n2μ\n2μ\nAlso as x → −∞, z → 0. Therefore in order to have a plane wave travelling to the right as x → ∞,\nwe require that |ε| > |ω+ | and C = 0 so that as x → ∞ we have\nφ+ = Dz −h (1 − z)λ 2 F1 (−h − ν + λ, −h + ν + λ, 1 − 2h; z)\n\n(44)\n\nand the limit\nlim φ+ = Deik+ x\n\n(45)\n\nx→+∞\n\nwith k+ =\n\nq\n\n2 . The other component is\nε2 − ω+\n\nlim φ− = Dβeik+ x\n\n(46)\n\nx→+∞\n\n+\n.\nwhere β = ω+ +ik\nε\nFor one-dimensional scattering problems, the particles in the beam are in plane wave states with\ndefinite momentum. Given the wave functions relevant to incident, reflected and transmitted beams,\none may calculate the corresponding current densities [23]. The reflection and transmission coefficients\nare defined to be the ratio of the reflected current density j re to the incident current density j in and\ntransmitted current density j tr to the incident!current density, respectively, where the current density\nφ+\n. This is leading to the coefficients\nfor our system is J = φ† σx φ with φ =\nφ−\n\nR=\nwhere\n\n∗\nη− − η−\n|j re |\n|r|2 ,\n=\n∗\n|j in |\nη+ − η+\n\nT =\n\nη+ − β\n,\nβ − η−\nwhich giving the conservation law R + T = 1.\nr=\n\nt=\n\nT,R\n\n|j tr |\n|β − β ∗ |\n|t|2\n=\n∗\nin\n|j |\nη+ − η+\n\n(47)\n\nη+ − η−\nβ − η−\n\n(48)\n\nT,R\n\n1.0\n\n1.0\n\n(b)\n\n(a)\n0.8\n\n0.8\n\nT\nR\n\n0.6\n\nT\nR\n\n0.6\n\n0.4\n\n0.4\n\n0.2\n\n0.2\n\nΕ\n2\n\n4\n\n6\n\n8\n\n10\n\nΕ\n2\n\n10\n\n4\n\n6\n\n8\n\n10\n\n\fFig. 6: Transmission as a function of energy with k = 1, B0 = 2 and (a) μ = 3, (b) μ = 1000.\nWe notice that for the Hyperbolic tangent magnetic field (figure 5), figure 6 show clearly that for the\nvalue of μ = 1000 we obtain the same result for the transmission and reflection coefficients as those\ngenerated in section 3 for a single step pseudoscalar potential.\nWe can also characterize the transmission amplitude by giving the corresponding phase shifts δ.\nIndeed, in the case of |ω− | < |ε| < |ω+ | one obtains\n\nwhere |t| =\n\n√\n\nt = |t| eiδ\nT given in (47). The calculations lead to the scattering phase shift in the form\nq\n\u0012 \u0013\n2\nε2 − ω−\nh\n′′\n.\n,\nh =\nδ = arctan\nh′′\n2k\n\n(49)\n\n(50)\n\nA complementary information about the phase shift can be obtained by studying the trajectories in the\ncomplex transmission amplitude plane where full reflections will appear whenever these trajectories\npass through the origin.\n\n5\n\nDirac fermions in a double δ-type magnetic field\n\nMotivated by the above analysis, let us investigate the scattering of Dirac fermions in a double δ-type\nmagnetic field. This can be described by the double-step pseudoscalar potential\nW (x) = B1 [1 − Θ(x + a)] + B2 Θ(x − a)\n\n(51)\n\npresented in figure 7 with a defined to be positive real number. This pseudoscalar double step potential generates a magnetic field B = B1 δ(x + a) + B2 δ(x − a), B1 and B2 are the strengths of the δ-type\nmagnetic fields at x = −a and x = +a, respectively.\n\nFig. 7: Double-step pseudoscalar potential.\nUsing (51), we show that the general solutions of the Dirac equation (7) for the case of |ε| > |ω+ |\ncan be written as\n\n\u0010 \u0011\n\u0010 \u0011\n A− ei κ− x 1α + B− e−i κ− x 1 ∗ ,\nε < ω+\nα−\n\u0010α−∗ \u0011\nφ(x < −a) =\n\u0001\n A+ ei κ− x − + B+ e−i κ− x α− ,\nε > −ω+\n\n\u0010 1\u0011\n\u0010 1\u0011\n C− ei k2 x 1γ + D− e−i k2 x 1 ∗ ,\nε < ω+\nγ+\n\u0010γ+∗ \u0011\nφ(|x| < a) =\n(52)\n\u0001\nγ\n C+ ei k2 x + + D+ e−i k2 x + ,\nε\n>\n−ω\n+\n\n\u00101 \u0011\n\u00101 \u0011\n E− ei κ+ x 1 + F− e−i κ+ x 1 ∗ ,\nε < ω+\n\u0010ββ+∗ \u0011\n\u0010β+ \u0011\nφ(x > a) =\nβ\n E+ ei κ+ x + + F+ e−i κ+ x + ,\nε > −ω+\n1\n1\n11\n\n\fwhere we define\nγ+ = (ik2 − k)/ε,\n\nκ± =\n\nq\n\n2,\nε2 − ω±\n\nk2 =\n\np\n\nε2 − k2 ,\n\nω+ = B2 + k,\n\nω− = B1 + k. (53)\n\nThese wavefunctions will be used to study the scattering and the bound states for the present case.\nThe continuity of the wavefunction at x = ±a gives the reflection amplitudes r∓ = B∓ /A∓ and the\ntransmission amplitudes t∓ = E∓ /A∓ for the negative (top sign) and positive (bottom sign) energy\nsolutions. More precisely, we find\nt∓ =\nr∓ =\n\n4e−ia(−2k2 +κ− +κ+ ) κ− k2\n(54)\ne4iak2 (κ− − k2 ∓ iB1 )(k2 − κ+ ∓ iB2 ) + (κ− + k2 ∓ iB1 )(k2 + κ+ ± iB2 )\n\u0002\n\u0003\ne−2iaκ− e4iak2 (κ− + k2 ∓ iB1 )(k2 − κ+ ∓ iB2 ) + (κ− − k2 ± iB1 )(k2 + κ+ ± iB2 )\n. (55)\ne4iak2 (κ− − k2 ∓ iB1 )(k2 − κ+ ∓ iB2 ) + (κ− + k2 ∓ iB1 )(k2 + κ+ ± iB2 )\n\nThe result of the passage to the limits, B1 → 0 (k2 → κ− ) and a → 0, in (54) and (55) coincides with\nthe transmission and reflection amplitudes in (30) of the Dirac particle scattered by a pseudoscalar\nsingle step potential. If we take the limit a → 0 in the above equations we get, by replacing ω+ and\nω− by ω+ = B2 − k and ω− = B1 − k, respectively, and B0 by B1 − B2 , the transmission and reflection\namplitude for the Dirac particle scattered by a double-step pseudoscalar potential W (x) (51). For\nthe special case B2 = −B1 = 0.002 the transmission and reflection coefficients coincide with those\nobtained in the case of scattering of Dirac fermions by a single step pseudoscalar potential plotted in\nfigure 6 (b).\nGiven the wavefunctions associated with the incident, reflected and transmitted beams, one may\ncalculate the corresponding current densities according to [23]. Figure 8 illustrate the configuration\nof the solution space of our problem. Dark/light grey areas correspond to negative/positive energy\ncontinuum where we have evanescent or transmitted waves (EWs/TWs). The white areas correspond\nto the bound states (BS). The reflection and transmission coefficients for the positive and negative\nenergy solutions are\nR(κ+ )\nR∓ = |r∓ |2 ,\nT∓ =\n|t∓ |2 .\n(56)\nR(κ− )\nwhich obey the conservation relation\n\n|r∓ |2 +\n\nR(κ+ )\n|t∓ |2 = 1.\nR(κ− )\n\n(57)\n\nFigures 9 and 10 show more clearly that, for the confinement by a double-step pseudoscalar potential,\nthe EWs, TWs and BS always appear for the energy that |ω− | < |ε| < |ω+ | , |ε| > |ω+ | and |ε| < |ω− |,\nrespectively. In figures 9 (a), (b) and 10 (b) the transmission resonances appear for B1 and B2 6= 0.\nFrom figure 10 (a) one readily notice that, for the value of B2 = 0, the double-step pseudoscalar\npotential reduces to a one step with W (x) = B1 (1 − Θ(x)). We can easily find the EWs, TWs and BS\nfor this later representation by replacement the ω+ and ω− by ω+ = k and ω− = B1 − k respectively.\n\n12\n\n\fe±ikx\n\n+\n\n1 Þ\nRÞ\n+\n\nT\n\nΩ-\n\nΩ+\n\nB2\n\nÞ\n\nekx\n\n+k\n ́\n\nx\n\n0\n\n-k\n\nB1\n- Ω-\n\ne±ikx\n\n- Ω+\n\nFig. 8: The potential configuration associated with the double step pseudoscalar potential. Dark/light\ngrey areas correspond to negative/positive energy continuum. The white areas correspond to bound states\nwhere the solutions are exponentials.\n\nT\n\nT\n\n1.0\n\n1.0\n\n0.8\n\n0.8\n\n(a)\n\n0.6\n\n0.6\n\n0.4\n\n0.4\n\n0.2\n\n0.2\n\n(b)\n\nΕ\n2\n\n4\n\n6\n\n8\n\n10\n\nΕ\n\n12\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\nFig. 9: The transmission coefficient as a function of energy for B2 = −B1 = 0.5, 2.0, 3.0, 5.0 (left to right\ncurves) with k = 1. (a) for a = 1 and (b) for a = 2.\n\nT\n\nT\n\n1.0\n\n1.0\n\n0.8\n\n0.8\n\n0.6\n\n0.6\n\n(a)\n\n0.4\n\n0.4\n\n0.2\n\n0.2\n\n(b)\n\nΕ\n2\n\n4\n\n6\n\n8\n\n10\n\nΕ\n\n12\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\nFig. 10: The transmission coefficient as a function of energy for a = 2 and k = 1. (a) for the Dirac particle\nscattered by a pseudo-scalar one step potential when B2 = 0 and B1 = −0.5, −2.0, −3.0, −5.0 (left to\n13\n\n\fright curves). (b) for our the case of B2 = B1 = −0.5, −2.0, −3.0, −5.0.\nWe wish to study the bound states of a double-step pseudoscalar potential for the case |ε| < |ω− |\nand for B1 = B2 . From equation (52) we must have A− = F− = 0 in order to obtain normalizable\nwavefunction in the region |x| > a/2. We now have the full solution, given our assumption of particles\nincident from the left\n\n\u0010 \u0011\nκ− x 1\n\n,\nx < −a,\nB\ne\n\n\n −\n\u0010 α−\u0011\n\u0010 \u0011\n|x| < a,\nC− ei k2 x 1γ+ + D− e−i k2 x 1γ ∗ ,\n(58)\nφ=\n+\n\n\u0010 \u0011\n\n\n\nE− e− κ+ x 1α− ,\nx > a.\n\nThis means that the solutions separate into even parity and odd parity states. We could have guessed\nthis from the potential. The even states (C− = D− , B− = E− ) have the (quantization) constraint on\nthe energy that\nr\nak\nak\n1 − υ2 −\nυ+υ+\n= tan(ε)\n(59)\nε\nε\nand the odd states (C− = −D− , B− = −E− ) have the constraint\nr\nak\nak\n1 − υ2 −\nυ+υ+\n= − cot(ε)\nε\nε\n\n(60)\n\nwhere we have used υ = Ba\n2ε . These are transcendental equations, so we will solve them graphically.\nThe plot in figure 11 shows the left hand side of the transcendental equation along with the tangent\nfor even parity states and minus cotangent for odd parity states, respectively. The intersection of\nthese curves gives the bound states. From this figure we see that there are two bound states for even\nparity solution and two for odd parity solutions. The wider and deeper the step, the more bound\nstates become available.\n\n20\n15\n\nΥ=4\n10\n\nΥ=5\n\n5\n\nΕ\n0.5\n\n1.0\n\n1.5\n\n2.0\n\n2.5\n\n3.0\n\n-5\n\nTanHΕL\n-CotHΕL\n\n-10\n-15\n\nFig. 11: The double-step pseudoscalar potential bound states for k = 1 and a = 1. The solid line represents\ntan(ε) and the dashed line represents − cot(ε). The dotted lines represent the left-hand side of equations\n(59) and (60).\nOn the other hand, it will be interesting to underline the energy system behavior. In this end, we\nplot the dispersion curves ǫk to show its structure in Fig 12\n\n14\n\n\fΕ\n\nkx = 6\n\n10\n8\n\nΕ\n\nΕ\n\nB = -2\n\nkx = 6\n\n10\n\n10\n\nkx = 6\n\nB=0\n\n8\n\n6\n\nkx = 3\nkx = 0\n\nkx = 3\nkx = 0\n\n4\n2\n\nkx = 3\nkx = 0\n\n5\n\nky\n-6\n\n-4\n\n-2\n\n-2\n\nB=2\n\n6\n\n2\n\n4\n\n-4\n\n6\n\n8\n\n10\n\n2\nky\n\nky\n-10\n\n5\n\n-5\n\n10\n\n-10\n\n-8\n\n-6\n\n-4\n\n-2\n\n-2\n\n2\n\n4\n\n6\n\n-4\n\n-5\n\n-6\n-8\n\n4\n\n-6\n-8\n\n-10\n\n-10\n\n-10\n\nFig. 12: Dispersion curves for the oscillatory states for different values of kx and magnetic field B, with\nkx is the wave vector along the x direction (kx = k− or k+ ).\n\n6\n\nConclusion\n\nWe considered Dirac fermions in graphene nanoribbon subject to a sharply localized magnetic field.\nAfter setting the theoretical model we obtained the eigenvalues as well as the eigenspinors. for a\nsharply localized δ-type magnetic field. After matching the wavefunction at the point x = 0, the\nreflection and transmission amplitudes were derived in standard way. A study of the transmission\ncoefficient as a function of the strength of field B0 was done, the transmission is unity for B0 = 0 and\nreduces sharply for strong field.\n~\nThe general case of a bell shape magnetic field normal to the graphene sheet, namely B(x)\n=\n2\n−1\nẑB0 sech (μx) was studied, B0 being the strength of the field and μ stands for its range. It was\nshown that the solution space of the corresponding Hamiltonian splits into three regions depending on\nthe sign of kB0 and the energy range, k is the wave vector along the y-axis. To obtain the reflection\nand transmission coefficients we used the current density, our results reduce to those obtained for\nδ-type magnetic field for large values of μ, here we took μ = 1000. Moreover, the phase shift that\ncharacterizes the transmission amplitude is given in terms of the energy and magnetic field.\nSubsequently, we considered the case of an asymmetric double step pseudoscalar potential of the\nform W (x) = B1 [1 − Θ(x + a)] + B2 Θ(x − a). After obtaining the general solution of the Dirac\nequation, we matched the wavefunction at the points ±a to obtain the reflection and transmissions\namplitudes for the negative and positive energy solutions. Different field configuration were considered\nbut the interesting situation obtains when B2 = −B1 = 0.002 which enables us to recover the reflection\nand transmission coefficients for scattering of Dirac fermions by a double step pseudoscalar potential.\nMoreover, for the present potential we studied the corresponding bound states using graphical solution\nof the transcendental equations. We reached the conclusion that there are at most two bound states\nfor even parity and two for old parity solutions.\nFinally a double Gaussian type magnetic field was considered in appendix A where a second\norder differential equation for spinor components was solved analytically. The corresponding general\nsolution was given in terms of the HeunG functions. The asymptotic behavior as x → ±∞ of these\nwavefunctions were obtained and enabled us to extract the corresponding reflection and transmission\ncoefficients.\n\n15\n\n\fAcknowledgments\nThe generous support provided by the Saudi Center for Theoretical Physics (SCTP) is highly appreciated by all Authors. AJ and AE acknowledge partial support by King Faisal University and KACST,\nrespectively. We also acknowledge the support of KFUPM under the theoretical physics research\ngroup project RG1108-1-2.\n\nAppendix A: Dirac fermions in a double Gaussian type magnetic field\nWe consider a magnetic field normal to the graphene sheet and of a Gaussian shape. Specifically, we\n\u0002\n\u0003\n~\ntake B(x)\n= ẑ B1 sech2 [μ(x + a)] + B2 sech2 [μ(x − a)] (Fig. 13), with B1 and B2 are the strengths\nof the field. The corresponding vector potential (Fig. 13) is\n\u0015\n\u0014\nB1\nB2\n~\n[tanh [μ(x + a)] − 1] +\n[tanh [μ(x − a)] + 1] .\n(A1)\nA(x) = ŷ\nμ\nμ\nWe note that the double delta magnetic field considered in section 5 is obtained in the limit μ ≫ 1 in\nthe present more general model.\nBy using the same change of variable as in section 4 for ±x > 0, equation (7) can be written in\nthe following form\n\"\n#\n\u00132\n\u0012\n\u0013 \u0012\n\u0013 \u0012\nd\n2B\nz\n4B\nqz\nd\n4B\nqz\n2B\n2\n1\n2\n1\n4μ2 z\n+\n+ k + ε2 φ± = 0. (A2)\nz\n∓\n+\n−\ndz\ndz\nμ (qz − 1) μ (z − q)\n(qz − 1)2 (z − q)2\nfor x < 0 with q = e2a .\nWHxL\nWHxL\n1.2\n\n-6\n\n-4\n\n1.0\n0.8\n\nWHxL\n2\n\n-2\n\n4\n\n6\n\n1.0\n\n-0.4\n\n0.5\n\n-6\n\n2\n\n-2\n\n4\n\n6\n\nx\n-6\n\n-4\n\n2\n\n-2\n\n-0.5\n\n-0.5\n\n4\n\n6\n\n-1.0\n\n-1.0\n\n-1.0\n-1.2\n\nx\n2\n\n4\n\n6\n\nBHxL\n\nBHxL\n\nBHxL\n\n1.0\n\n0.5\n\n-4\n\nB1 = B2 = 1\n\nB1 = 1\n0.5\n\nBHxL\n\n1.0\n\n1.0\n\nB1 = -1\nB2 = 1\n\n-4\n\n-0.8\n\n0.2\n\n-2\n\n0.5\n\nx\n\n0.4\n\n-4\n\n1.0\n\n-0.6\n\n0.6\n\n-6\n\nWHxL\n\nx\n\n-0.2\n\n2\n\n-2\n\n4\n\nx\n\n0.8\n-0.2\n\nB2 = -1\n0.6\n-0.4\n\nx\n-4\n\n2\n\n-2\n\n4\n\nx\n-4\n\n2\n\n-2\n\n4\n\n0.4\n-0.6\n\n-0.5\n\n0.2\n\n-0.5\n\n-0.8\n\nB1 = B2 = -1\n\nx\n-1.0\n\n-1.0\n\n-4\n\n-2\n\n2\n\n4\n\n-1.0\n\nFig. 13: The pseudoscalar potential W (x) and the associated double Gaussian type magnetic field B(x)\n(A1) for μ = 1.5 and a = 3.\nThe general solution of (A2) can be expressed in terms of the HeunG function [22] as follows\n\u0012\n\u0013\nz\n+\nl+\nn+\nm+\nφ = Az (q − z) (−1 + qz) HeunG p, b+ , α+ , β+ , γ+ , δ+ ;\n(A3)\nq\n\u0013\n\u0012\nz\n−l+\nn+\nm+\n.\n+ Bz (q − z) (−1 + qz) HeunG p, b1+ , α1+ , β+ , 2 − γ+ , δ+ ;\nq\n16\n\n\fwhere we have set\nl± = (γ± − 1)/2,\n\nn± = −δ± /2,\n\n\u0012\n\nS4±\n1+\nS3±\n\n\u0013\n\np = q −2\n\u0001\n= −4B2(1) + 2μ2 − S2± + S3± μ−2 /2,\nm± =\n\nα± = (S2± + S3± ) μ−2 /2,\nα1±\nq\nγ± = 1 + μ−2 μ2 k2 − μ2 ǫ2 ∓ 4 B1(2) kμ + 4B1(2) 2 ,\n\n/2,\n\nδ± = −2μ−2 B2(1)\n\n\u0002\n\u0001\n\u0003 μ−2\nβ± = S2± S3± + μ4 + −ǫ2 + k2 − 4 B1(2) μ2 ± 4 B2(1) kμ ± 4B2 2 ∓ 4B1 2\n2S3±\n\"\nh\n\u0001\n\u0001\nb± = ∓1/2\n∓μ2 q 2 ± 2B2(1) (1 − γ± )μ2 ∓ μ4 q 2 ∓ 2B1(2) q 2 μ2 + k 2B1(2) q 2 + 2B2(1) μ\n\n#\n\u0010\n−5 −2\n\u0001 \u0011 2\n2 2\n2 μ q\n∓2B1(2) q ∓ 4B1 B2 μ S3± ∓ S1± + 2B1(2) + μ μ μ γ± q\nS3±\n\"\ni\n\u0001\n\u0001\nb1± = ∓1/2 μ ±μ2 q 2 ∓ 2B2(1) (1 − γ± )μ2 ∓ μ4 q 2 ∓ 2B1(2) q 2 μ2 + k 2B1(2) q 2 + 2B2(1) μ\n2 2\n\ni\n\n2 2\n\ni\n\n\u0010\n\n∓2B1(2) q ∓ 4B1 B2 S3± − (2 − γ± ) S1± + 2B1(2) + μ\n\n\u0001\n2 2\n\n\u0011\n\n2 2\n\nμ μ q\n\n#\n\nμ−5 q −2\nS3±\n\nwith\nS1± =\n\nq\n\n2B1(2) + μ2\n\n\u00012 \u0002\n\u0003 \u0002\n\u0003\n(k + ǫ) μ ± 2B2(1) μ2 (k − ǫ) μ ± 2B2(1)\n\nS2± = −2B2(1) + μ2 γ+(−)\nq\n\u0001\n2\n2 S1± + μ4 + −ǫ2 + 4 B1(2) + k2 μ2 ± 4 kμB2(1) + 4B2(1)\n+ 4B12\nS3± =\n\u0001\n\u0001\nS4± = 2B1 + μ2 μ2 γ± + 2B1 .\n\nThe asymptotic behavior of (A3) when x → −∞ corresponds to z → 0 and gives for φ+ and φ−\nlim φ+ = Aeik− x + Be−ik− x\n\nx→−∞\n\nlim φ− = Aρ+ eik− x + Bρ− e−ik− x\n\n(A4)\n\nx→−∞\n\nwith\nk− = iμ\n\nq\n\n2 − ε2 ,\nω−\n\nρ± =\n\nω+ ± ik−\n,\nε\n\nω+ = k +\n\n2B2\n,\nμ\n\nω− = k −\n\n2B1\n.\nμ\n\nIn the region when x > 0 the analogous equation to (7) reads\n#\n\"\n\u00132\n\u0012\n\u0013 \u0012\n\u0013 \u0012\n2B2\n4B1 qz\nd\n4B2 qz\n2B1 z\n2\n2 d\n+\n+ k + ε φ± = 0. (A5)\nz\n∓\n+\n4μ z\n−\ndz\ndz\nμ (q − z) μ (1 − qz)\n(q − z)2 (1 − qz)2\nThe solution of (A5) can be expressed in terms of the HeunG function as follows\n\u0012\n\u0013\nz\n+\nl−\nn−\nm−\nφ = Cz (q − z) (−1 + qz) HeunG p, b− , α− , β− , γ− , δ− ;\nq\n\u0012\n\u0013\nz\n−l−\nn−\nm−\n+ Dz (q − z) (−1 + qz) HeunG p, b1− , α1− , β− , 2 − γ− , δ− ;\nq\n\n17\n\n(A6)\n\n\fwhere the wavefunction parameters have been defined previously. The asymptotic behavior of (A6)\nwhen x → +∞, which corresponds to z → 0, gives for φ+ and φ− while the asymptotic behavior of\n(A3) when x → −∞ corresponds to z → 0 and gives for φ+ and φ−\nlim φ+ = Ce−ik+ x + Deik+ x\n\nx→+∞\n\nlim φ− = Cρe−ik+ x + Dρeik+ x\n\n(A7)\n\nx→+∞\n\nq\n2 − ε2 and ρ = ω+ +ik+ . The reflection and transmission coefficients for the positive\nwith k+ = iμ ω+\nε\nand negative energy solutions are given by equation (56), with the reflection and the transmission\nρ2 −ρ\n2 −ρ1\namplitudes given by r = ρ−ρ\nand t = ρρ−ρ\n. Figure 14 show transmission for the Dirac particle\n1\n1\nscattered by the pseudo-scalar potential (A1), we can see from figures 13 (a) and (d) that, the EWs,\nTWs and BS appear in the energy ranges |ω− | < |ε| < |ω+ |, |ε| > |ω+ | and |ε| < |ω− |, respectively.\nIn this later case the pseudo-scalar potential (A1) behaves like a potential well. In figures 14 (b) and\n(c) the pseudo-scalar potential (A1) behaves like a potential barrier. We also notice the vanishing of\nthe energy range for the EWs but the TWs and BS appear for the energy |ε| > |ω− | and |ε| < |ω− |,\nrespectively. The energy ranges for EWs, TWs and BS are affected by the value of the parameter μ.\n\nT\n\nT\n\nT\n\nT\n\n1.0\n\n1.0\n\n1.0\n\n1.0\n\n0.8\n\n0.8\n\n0.8\n\n0.8\n\n0.6\n\n0.6\n\n(a)\n\n0.4\n\n0.6\n\n(b)\n\n0.2\n\n4\n\n6\n\n8\n\n10\n\n0.2\n\nΕ\n2\n\n4\n\n6\n\n8\n\n10\n\n(d)\n\n0.4\n\n0.2\n\n0.2\n\nΕ\n2\n\n0.6\n\n(c)\n\n0.4\n\n0.4\n\nΕ\n2\n\n4\n\n6\n\n8\n\n10\n\nΕ\n2\n\n4\n\n6\n\n8\n\n10\n\nFig. 14: The transmission coefficient as a function of energy. (a) 2B1 = 2B2 = 0.5, 2.0, 3.0, 5.0 (left\nto right curves). (b) 2B1 = 2B2 = −0.5, −2.0, −3.0, −5.0. (c) 2B1 = −2.0 and 2B2 = −3.0, −6.0.\n(d) 2B1 = −0.5 and 2B2 = 1.0, 2.0, 3.0, 5.0. With a = 1, k = 1 and μ = 1. Note that, for the case\nB1 = −B2 , we have total transmission.\n\nReferences\n[1] A.K. Geim and K.S. Novoselov, Nature Mater. 6, 183 (2007).\n[2] A.H. Castro Neto, F. Guinea, N.M.R. Peres, K.S. Novoselov and A. K. Geim, Rev. Mod. Phys.\n81, 109 (2009)\n[3] K. Nakada, M. Fujita, G. Dresselhaus and M.S. Dresselhaus, Phys. Rev. B 54, 17954 (1996).\n[4] Y.W. Son, M.L. Cohen and S.G. Louie, Phys. Rev. Lett. 97, 216803 (2006).\n[5] F. Sols, F. Guinea and A.H.C. Neto, Phys. Rev. Lett. 99, 166803 (2007).\n[6] D. Gunlycke, D.A. Areshkin and C.T. White, Appl. Phys. Lett. 90, 142104 (2007).\n[7] S. Adam, S. Cho, M.S. Fuhrer and S. Das Sarma, Phys. Rev. Lett. 101, 046404 (2008).\n18\n\n\f[8] C. Stampfer, J. Güttinger, S. Hellmüller, F. Molitor, K. Ensslin, and T. Ihn, Phys. Rev. Lett. 102,\n056403 (2009).\n[9] M.Y. Han, B. Ozyilmaz, Y.B. Zhang and P. Kim, Phys. Rev. Lett. 98, 206805 (2007).\n[10] X.L. Li, X.R. Wang, L. Zhang, S.W. Lee and H.J. Dai, Science 319, 1229 (2008).\n[11] J.W. Bai, X.F. Duan and Y. Huang, Nano. Lett. 9, 2083 (2009).\n[12] Y.W. Son, M.L. Cohen and S.G. Louise, Phys. Rev. Lett. 97, 216803 (2006); Y.W. Son, M.L.\nCohen and S.G. Louise, Nature 444, 347 (2006).\n[13] Y.W. Son, M.L. Cohen and S.G. Louie, Nature 444, 347 (2006); W.Y. Kim and K.S. Kim, Nature\nNanotechnology 3, 408 (2008); F. Munoz-Rojas, J. Fernandez-Rossier and J.J. Palacios, Phys.\nRev. Lett. 102, 136810 (2009); N.M.R. Peres, A.H. Castro Neto and F. Guinea, Phys. Rev. B 73,\n241403 (2006); Y. Huang, C.P. Chang and M.F. Lin, Nanotechnology 18, 495401 (2007); J. Liu,\nA.R. Wright, C. Zhang and Z. Ma, Appl. Phys. Lett. 93, 041106 (2008); C. Ritter, S.S. Makler\nand A. Latge, Phys. Rev. B 77, 195443 (2008); T.S. Li, Y.C. Huang, S.C. Chang, C.P. Chang and\nM.F. Lin, Phil. Mag. 89, 697 (2009).\n[14] A. Shailos, K. Wang, Y. Huang and X. Duan, Nature Nanotechnology 5, 655 (2010).\n[15] M. Ramezani Masir, P. Vasilopoulos, A. Matulis and F.M. Peeters, Phys. Rev. B 77, 235443\n(2008).\n[16] The non-physical fields (i.e., gauge fields) could be eliminated by gauge transformation.\n[17] F. Cooper, A. Khare and U. Sukhatme, \"Supersymmetry in Quantum Mechanics\", (World Scientific Publishing Co., 2001).\n[18] A.D. Alhaidari, Phys. Rev. A 65, 042109 (2002).\n[19] A.D. Alhaidari, A. Jellal, E.B. Choubabi and H. Bahlouli, Dynamical Mass Generation via Space\nCompactification in Graphene, arXiv:1010.3437. To appear in Quantum Matter 2012.\n[20] S. Kuru, J. Negro and L.M. Nieto, J. Phys: Cond. Matter 21, 455305 (2009).\n[21] E. Milpas, M. Torres and G. Murguia, \"Magnetic field barriers in graphene: an analytically\nsolvable model\", arXiv:1102.5298.\n[22] \"Handbook of Heun's Differential Equations\", edited by A. Ronveaux (Oxford University Press,\n1995).\n[23] A.D. Alhaidari and E. El Aaoud, AIP Conf. Proc. 1370, 21 (2011).\n\n19\n\n\f"}