{"id": "http://arxiv.org/abs/1006.5476v1", "guidislink": true, "updated": "2010-06-28T22:00:51Z", "updated_parsed": [2010, 6, 28, 22, 0, 51, 0, 179, 0], "published": "2010-06-28T22:00:51Z", "published_parsed": [2010, 6, 28, 22, 0, 51, 0, 179, 0], "title": "An Investigation into the Radial Velocity Variations of CoRoT-7", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1006.1918%2C1006.0792%2C1006.3420%2C1006.5476%2C1006.4547%2C1006.5527%2C1006.4936%2C1006.1855%2C1006.1729%2C1006.2520%2C1006.0813%2C1006.0624%2C1006.4004%2C1006.0195%2C1006.5484%2C1006.2646%2C1006.2527%2C1006.0154%2C1006.5492%2C1006.3030%2C1006.4130%2C1006.0974%2C1006.3230%2C1006.3383%2C1006.5446%2C1006.1594%2C1006.0161%2C1006.1902%2C1006.5375%2C1006.0081%2C1006.5308%2C1006.4555%2C1006.4398%2C1006.3442%2C1006.4199%2C1006.1738%2C1006.5104%2C1006.1212%2C1006.0464%2C1006.4118%2C1006.0716%2C1006.2661%2C1006.2296%2C1006.3573%2C1006.5588%2C1006.0677%2C1006.3618%2C1006.0700%2C1006.1128%2C1006.0912%2C1006.2836%2C1006.2708%2C1006.5737%2C1006.2869%2C1006.5548%2C1006.0826%2C1006.1187%2C1006.3951%2C1006.0722%2C1006.3089%2C1006.1104%2C1006.5042%2C1006.0366%2C1006.3228%2C1006.2598%2C1006.1114%2C1006.2008%2C1006.0092%2C1006.1223%2C1006.2386%2C1006.2131%2C1006.3116%2C1006.0746%2C1006.4804%2C1006.3329%2C1006.2051%2C1006.3958%2C1006.0688%2C1006.4261%2C1006.1044%2C1006.5251%2C1006.3689%2C1006.3059%2C1006.3244%2C1006.4479%2C1006.4047%2C1006.2829%2C1006.5176%2C1006.3496%2C1006.4409%2C1006.4217%2C1006.1315%2C1006.5783%2C1006.0637%2C1006.3330%2C1006.3365%2C1006.3953%2C1006.5096%2C1006.1593%2C1006.1971%2C1006.4050&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "An Investigation into the Radial Velocity Variations of CoRoT-7"}, "summary": "CoRoT-7b, the first transiting ``superearth'' exoplanet, has a radius of 1.7\nR_Earth and a mass of 4.8 M_Earth. Ground-based radial velocity measurements\nalso detected an additional companion with a period of 3.7 days (CoRoT-7c) and\na mass of 8.4 M_Earth. The mass of CoRoT-7b is a crucial parameter for planet\nstructure models, but is difficult to determine because CoRoT-7 is a modestly\nactive star and there is at least one additional companion. A Fourier analysis\nwas performed on spectral data for CoRoT-7 taken with the HARPS spectrograph.\nThese data include RV measurements, spectral line bisectors, the full width at\nhalf maximum of the cross-correlation function, and Ca II emission. The latter\n3 quantities vary due to stellar activity and were used to assess the nature of\nthe observed RV variations. An analysis of a sub-set of the RV measurements\nwhere multiple observations were made per night was also used to estimate the\nRV amplitude from CoRoT-7b that was less sensitive to activity variations. Our\nanalysis indicates that the 0.85-d and 3.7-d RV signals of CoRoT-7b and\nCoRoT-7c are present in the spectral data with a high degree of statistical\nsignificance. We also find evidence for another significant RV signal at 9\ndays. An analysis of the activity indicator data reveals that this 9-d signal\nmost likely does not arise from activity, but possibly from an additional\ncompanion. If due to a planetary companion the mass is m = 19.5 M_Earth,\nassuming co-planarity with CoRoT-7b. A dynamical study of the three planet\nsystem shows that it is stable over several hundred millions of years. Our\nanalysis yields a RV amplitude of 5.04 +/- 1.09 m/s for CoRoT-7b which\ncorresponds to a planet mass of m = 6.9 +/- 1.4 M_Earth. This increased mass\nwould make the planet CoRoT-7b more Earth-like in its internal structure.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1006.1918%2C1006.0792%2C1006.3420%2C1006.5476%2C1006.4547%2C1006.5527%2C1006.4936%2C1006.1855%2C1006.1729%2C1006.2520%2C1006.0813%2C1006.0624%2C1006.4004%2C1006.0195%2C1006.5484%2C1006.2646%2C1006.2527%2C1006.0154%2C1006.5492%2C1006.3030%2C1006.4130%2C1006.0974%2C1006.3230%2C1006.3383%2C1006.5446%2C1006.1594%2C1006.0161%2C1006.1902%2C1006.5375%2C1006.0081%2C1006.5308%2C1006.4555%2C1006.4398%2C1006.3442%2C1006.4199%2C1006.1738%2C1006.5104%2C1006.1212%2C1006.0464%2C1006.4118%2C1006.0716%2C1006.2661%2C1006.2296%2C1006.3573%2C1006.5588%2C1006.0677%2C1006.3618%2C1006.0700%2C1006.1128%2C1006.0912%2C1006.2836%2C1006.2708%2C1006.5737%2C1006.2869%2C1006.5548%2C1006.0826%2C1006.1187%2C1006.3951%2C1006.0722%2C1006.3089%2C1006.1104%2C1006.5042%2C1006.0366%2C1006.3228%2C1006.2598%2C1006.1114%2C1006.2008%2C1006.0092%2C1006.1223%2C1006.2386%2C1006.2131%2C1006.3116%2C1006.0746%2C1006.4804%2C1006.3329%2C1006.2051%2C1006.3958%2C1006.0688%2C1006.4261%2C1006.1044%2C1006.5251%2C1006.3689%2C1006.3059%2C1006.3244%2C1006.4479%2C1006.4047%2C1006.2829%2C1006.5176%2C1006.3496%2C1006.4409%2C1006.4217%2C1006.1315%2C1006.5783%2C1006.0637%2C1006.3330%2C1006.3365%2C1006.3953%2C1006.5096%2C1006.1593%2C1006.1971%2C1006.4050&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "CoRoT-7b, the first transiting ``superearth'' exoplanet, has a radius of 1.7\nR_Earth and a mass of 4.8 M_Earth. Ground-based radial velocity measurements\nalso detected an additional companion with a period of 3.7 days (CoRoT-7c) and\na mass of 8.4 M_Earth. The mass of CoRoT-7b is a crucial parameter for planet\nstructure models, but is difficult to determine because CoRoT-7 is a modestly\nactive star and there is at least one additional companion. A Fourier analysis\nwas performed on spectral data for CoRoT-7 taken with the HARPS spectrograph.\nThese data include RV measurements, spectral line bisectors, the full width at\nhalf maximum of the cross-correlation function, and Ca II emission. The latter\n3 quantities vary due to stellar activity and were used to assess the nature of\nthe observed RV variations. An analysis of a sub-set of the RV measurements\nwhere multiple observations were made per night was also used to estimate the\nRV amplitude from CoRoT-7b that was less sensitive to activity variations. Our\nanalysis indicates that the 0.85-d and 3.7-d RV signals of CoRoT-7b and\nCoRoT-7c are present in the spectral data with a high degree of statistical\nsignificance. We also find evidence for another significant RV signal at 9\ndays. An analysis of the activity indicator data reveals that this 9-d signal\nmost likely does not arise from activity, but possibly from an additional\ncompanion. If due to a planetary companion the mass is m = 19.5 M_Earth,\nassuming co-planarity with CoRoT-7b. A dynamical study of the three planet\nsystem shows that it is stable over several hundred millions of years. Our\nanalysis yields a RV amplitude of 5.04 +/- 1.09 m/s for CoRoT-7b which\ncorresponds to a planet mass of m = 6.9 +/- 1.4 M_Earth. This increased mass\nwould make the planet CoRoT-7b more Earth-like in its internal structure."}, "authors": ["A. P. Hatzes", "R. Dvorak", "G. Wuchterl", "P. Guterman", "M. Hartmann", "M. Fridlund", "D. Gandolfi", "E. Guenther", "M. Paetzold"], "author_detail": {"name": "M. Paetzold"}, "author": "M. Paetzold", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361/201014795", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1006.5476v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1006.5476v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "20 pages, 20 figures", "arxiv_primary_category": {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1006.5476v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1006.5476v1", "journal_reference": null, "doi": "10.1051/0004-6361/201014795", "fulltext": "c ESO 2018\n\nAstronomy & Astrophysics manuscript no. hatzes ̇corot\nNovember 2, 2018\n\nAn investigation into the radial velocity variations of CoRoT-7\n\n⋆\n\nA.P. Hatzes1 , R. Dvorak2 , G. Wuchterl1 , P. Guterman3 , M. Hartmann1 , M. Fridlund4 , D. Gandolfi1,4 ,\nE. Guenther1 , and M. Pätzold5\n1\n2\n3\n\narXiv:1006.5476v1 [astro-ph.SR] 28 Jun 2010\n\n4\n5\n\nThüringer Landessternwarte Tautenburg, Sternwarte 5, 07778 Tautenburg, Germany\nInstitute for Astronomy, University of Vienna, Türkenschanzstrasse 17, 1180 Vienna, Austria\nLaboratoire d'Astrophysique de Marseille, UMR 6110, Technopole de Marseille-Etoile, F-13388 Marseille cedex 13,\nFrance\nResearch and Scientific Support Department, European Space Agency, ESTEC, 2200 Noordwijk, The Netherlands\nRheinisches Institut für Umweltforschung, Universität zu Köln, Abt. Planetenforschung, Aachener Str. 209, 50931\nKöln, Germany\n\nReceived; accepted\nABSTRACT\nContext. CoRoT-7b, the first transiting \"superearth\" exoplanet, has a radius of 1.7 R⊕ and a mass of 4.8 M⊕ . The\nHARPS radial velocity (RV) measurements used for deriving this mass also detected an additional companion with a\nperiod of 3.7 days and a mass of 8.4 M⊕ . The mass of CoRoT-7b is a crucial parameter for planet structure models,\nbut is difficult to determine because CoRoT-7 is a modestly active star and there is at least one additional companion.\nAims. The aims of this paper are to assess the statistical significance of the RV variations of CoRoT-7b and CoRoT-7c,\nto obtain a better measurement of the planet mass for CoRoT-7b, and to search for additional companions in the RV\ndata.\nMethods. A Fourier analysis is performed on the HARPS spectral data of CoRoT-7. These data include RV measurements, spectral line bisectors, the full width at half maximum of the cross-correlation function, and Ca II emission.\nThe latter 3 quantities vary due to stellar activity and were used to assess the nature of the observed RV variations.\nAn analysis of a sub-set of the RV measurements where multiple observations were made per night was also used to\nestimate the RV amplitude from CoRoT-7b that was less sensitive to activity variations.\nResults. Our analysis indicates that the 0.85-d and 3.7-d RV signals of CoRoT-7b and CoRoT-7c are present in the\nspectral data with a high degree of statistical significance. We also find evidence for another significant RV signal at\n9 days. An analysis of the activity indicator data reveals that this 9-d signal most likely does not arise from activity,\nbut possibly from an additional companion. If due to a planetary companion the mass is m = 19.5 M⊕ , assuming\nco-planarity with CoRoT-7b. A dynamical study of the three planet system shows that it is stable over several hundred\nmillions of years. Our analysis yields a RV amplitude of 5.04 ± 1.09 m s−1 for CoRoT-7b which corresponds to a planet\nmass of m = 6.9 ± 1.4 M⊕ . This increased mass would make the planet CoRoT-7b more Earth-like in its internal\nstructure.\nConclusions. CoRoT-7 is confirmed to be a planet system with at least 2 and possibly 3 exoplanets having masses in\nthe range 7–20 M⊕ . If the third companion can be confirmed then CoRoT-7 may represent a case of an ultra-compact\nplanetary system.\nKey words. star: individual: CoRoT-7 - techniques: radial velocities - stars: planetary systems - stars: activity - stars:\nstarspots\n\n1. Introduction\nThe 27-cm space telescope CoRoT is devoted to obtaining ultra-high precision light curves over a wide field for\nthe dual purpose of asteroseismology and the detection of\ntransiting exoplanets (Baglin 2006; Auvergne et al. 2009).\nThis mission resulted in the milestone discovery of CoRoT7b, the first transiting superearth whose radius and mass\nhave been accurately characterized. Photometric measurements of CoRoT-7 made with the CoRoT Space Telescope\nSend\noffprint\nrequests\nartie@tls-tautenburg.de\n⋆\n\nto:\n\nArtie\n\nHatzes,\n\ne-mail:\n\nBased on observations made with HARPS spectrograph on\nthe 3.6-m ESO telescope under programs 082.C-0120, 082.C0308(A), and DDT program 282.C-5036(A)\n\nfrom October 2007 to March 2008 revealed a transit like\nevent with a period of 0.85 days and a depth of a mere\n0.03%. A detailed analysis of the CoRoT light curve and\nancillary measurements provided by ground based observations excluded all sources of false positives and established\nwith high probability that the transit event was due to a\nplanet with a radius of 1.7 R⊕ (Leger et al. 2009).\nCoRoT-7 is a G9 main sequence star with an estimated\nage of 1.2–2.3 Gyr. From the analysis of the three best\nspectra obtained with HARPS, and using several methods,\nBruntt et al. (2010) find Teff = 5250 ± 60 K, log g = 4.47\n± 0.05, [M/H] = +0.12 ± 0.06, and v sin i = 1.1 ± 1.0\nkm s−1 . They also find slightly different values for the mass\nand radius of CoRoT-7: 0.91 ± 0.03 M⊙ and 0.82 ± 0.04\nR⊙ . The revised stellar radius results in a slightly smaller\nradius for the planet of 1.58 ± 0.10 R⊕ .\n\n\f2\n\nA.P. Hatzes et al.: An Investigation of CoRoT-7\n\nfrot\n\n2frot\n\nf3\n\n3frot\n\n4frot\n\nf2\n\n20\n\nf1\n\nRV\n\nRV\n\nScargle Power\n\n10\n0\n10\n8\n6\n4\n2\n0\n\nBisector\n\n10\n\nBisector\n\nCa II\n\nCa II\n\nFWHM\n\nFWHM\n\n5\n0\n30\n20\n10\n0\n0\n\n.1\n\n.2\n\n1\nFrequency (c/d)\n\n1.1\n\n1.2\n\nFig. 1. Scargle periodograms of the RV (top), bisector (upper middle), Ca II S-index (lower middle), and FWHM (bottom)\nmeasurements for the frequency range 0–0.3 c d−1 (left panels) and 1.0–1.3 c d−1 (right panels). The vertical blue lines\nmark frequencies seen only in the RV (the one in the right panel is the transit frequency). Vertical red lines mark the\nrotational frequency and its first 3 harmonics.\nQueloz et al. (2009; hereafter Q09) presented over\n100 precise stellar radial velocity (RV) measurements of\nCoRoT-7 taken between November 2008 and February 2009\nwith the High Accuracy Radial velocity Planet Searcher\n(HARPS) spectrograph mounted on ESO's 3.6m telescope\nat La Silla. The RV analysis presented in Q09 was complicated by the relatively high activity of the host star. The\nCoRoT-7 light curve shows photometric variations of up\nto 2% with a rotation period of 23 days. The implied spot\n\nfilling factor suggests an RV \"jitter\" due to stellar activity\nof more than 10 m s−1 (Saar & Donahue 1997) which was\nconfirmed by the RV measurements.\nTwo approaches were used in Q09 for the analysis of\nthe RV data. Fourier pre-whitening resulted in an RV amplitude of 4.16 ± 0.27 m s−1 for CoRoT-7b, while filtering\nusing rotational harmonics resulted in an amplitude of 1.90\n± 0.4 m s−1 . By applying correction terms to these amplitudes due to the effects of the filtering process a consistent\n\n\fA.P. Hatzes et al.: An Investigation of CoRoT-7\n\namplitude of 3.5 ± 0.6 m s−1 was obtained. This corresponded to a planet mass of 4.8 ± 0.8 M⊕ . Their analysis\nalso revealed the presence of a 3.7-d period with an amplitude of 4.0 ± 0.5 m s−1 that was not associated with the\nstellar activity. This signal is most likely due to a second\ncompanion with a mass of 8.4 ± 0.9 M⊕ .\nOne of the most important parameters we can determine for an exoplanet is its mass. For transiting exoplanets\nwe also know the radius and the average density of the\nplanet and this is a unique parameter that will allow us to\nestimate the planet's composition, e.g. the fraction of metals and/or water. For transiting exoplanets we also know\nthe radius and average density of the planet, ρavg . A high\nvalue of ρavg , as seem to be the case for CoRoT-7b (Q09,\nthis work), indicates a high metal content and a low water abundance. Interestingly, another low-mass planet with\na similar radius (2.7 R⊕ ) has recently been found by the\nMEarth project (Charbonneau et al. 2010), but with a\nmuch lower ρavg than CoRoT-7b. Valencia et al. (2010) using the mass of CoRoT-7b from Q09 concluded that the internal structure was consistent with a significantly depleted\niron core. However, a mere increase of only 1-σ in the mass\nand a slightly smaller radius would make the planet more\nEarth-like. Clearly, a careful determination of the mass, to\ngo with the radius provided by the exquisite CoRoT photometric data is absolutely imperative. This mass must rely\non how accurately we can determine the RV amplitude of\nCoRoT-7b and unfortunately the activity signal makes this\ndifficult. The details in which the activity signal is removed\nmay affect the final RV amplitude of CoRoT-7b.\nThe HARPS RV data for CoRoT-7 show complex variations due to multi-periodic signals. Disentangling RV signals due to companions from that due to activity is challenging. This is particularly true because activity in the\nform of spot evolution, migration, etc. coupled with our\npoor temporal sampling can introduce Fourier frequencies\nother than rotation frequency. In this paper we focus on\na more extensive frequency analysis of the RV data that\ncould only partially be presented in Q09. We also include\nin our analysis ancillary data on the activity indicators for\nthis star. The main goals of this follow-up paper are:\n– To assess the statistical significance of CoRoT-7b seen\nin the RV data\n– To look for possible additional planet signals in the\nHARPS data\n– To understand the nature of all detected signals in the\nHARPS RV data\n– To obtain the best possible determination of the mass,\nand thus density of CoRoT-7b.\n\n3\n\nshows the RV measurements for CoRoT-7 as well as the\nactivity indicators.\n\n3. Scargle periodograms of measured quantities\nA periodogram analysis can give us a quick overview as to\npossible periods that may be present in the data. Scargle\nperiodograms were calculated for the four quantities measured from the HARPS spectra: RV, bisector span, Ca II\nS-index, and the FWHM of the CCF. These are shown in\nFigure 1. The RV measurements contain information about\npossible planetary companions and activity while the other\nquantities should only contain information on stellar activity. A comparison of the periodograms gives a first indication as to which peaks in the RV periodogram arise from\nactivity and those which may be due to companions. Two\nfrequency ranges are shown. The left panels are for 0 <\nν < 0.3 c d−1 and the right panels are for 1.0 < ν < 1.3\nc d−1 . The vertical blue lines indicate RV frequencies not\nseen in the activity indicators. The one in the right panel is\nthe CoRoT-7b transit frequency. Because of 1-day aliases\nall frequencies in the left panel also appear as peaks at ν +\n1 in the right panel. (Note: we have not marked the 1-day\nalias of the CoRoT transit frequency at 0.17 c d−1 , although\none can see a peak at this frequency location). The vertical\nred lines mark the rotational frequency, frot , and its first 3\nharmonics (2frot , 3frot , and 4frot ).\nThere are several important features to note in these\nperiodograms. First, the dominant peak in all 3 quantities occurs at ν = 0.044 c d−1 , the rotational frequency\nas determined from the CoRoT light curve. Clearly, RV\nvariations are dominated by the activity RV jitter from rotational modulation which will complicate the extraction\nof RV variations due to bona fide companions. Second,\nthe periodograms of the bisectors and Ca II look remarkably similar with the same peaks identifiable in both periodograms. Third, although the FWHM periodogram shows\nsimilar peaks near the rotational frequency, its shape looks\nmore like the RV periodogram but without the peaks shown\nby the vertical dashed lines. The strong peaks at ν = 0.09\nand 0.13 c d−1 , which are the first and second harmonics\nof frot , are not as strong in the FWHM as in the bisector\nand Ca II periodogram. The most important point is that\nthe 3 peaks seen in the RV data at ν = 0.11, 0.27, and 1.17\nc d−1 (and their 1-day aliases) are not found in any of the\nother quantities. This is our first hint for the presence of\nRV variability not associated with stellar activity.\nFigure 2 shows the spectral window for the data. As expected it is rather complex with strong sidelobes at +0.013\nand 0.04 c d−1 . Note that the same spectral window applies\nfor all data (RV, bisectors, Ca II, and FWHM).\n\n2. Observations\nThe HARPS spectrograph obtained 106 RV measurements\nfor CoRoT-7 over a time span of 4 months. We refer the\nreader to Q09 for a detailed description of the RV measurements. Besides RV information, the HARPS data also\nprovided information on the activity of the star via the bisector span of the cross correlation function (CCF), the Ca\nII S-index, and the full-width at half maximum (FWHM) of\nthe CCF. In particular, the line bisector has become a common tool for confirming exoplanet discoveries (e.g. Hatzes,\nCochran, & Bakker 1988; Queloz et al. 2001). Fig. 1 of Q09\n\n4. Frequency analysis of the data sets\nIt is evident from the periodograms that all spectral quantities have multi-periodic variations. As such they are well\nsuited to the classic technique of pre-whitening often employed in the study of stellar oscillations. In this process a\nFourier transform (FT) finds the highest peak in the power\nspectrum. A least squares fit to the frequency, amplitude,\nand phase to the found signal is made and then subtracted\nfrom the time series. Note that by subtracting this signal\nwe also remove all aliases of the dominant frequency. A\n\n\f4\n\nA.P. Hatzes et al.: An Investigation of CoRoT-7\nFrequency\n(c d−1 )\n0.0448 ± 0.00016\n0.1108 ± 0.00021\n0.0959 ± 0.00025\n1.1702 ± 0.00026\n0.2707 ± 0.00029\n0.0353 ± 0.00028\n0.1815 ± 0.00046\n0.2516 ± 0.00080\n0.0868 ± 0.00080\n\n1\n\nComment\nfrot\nf3\nf4\nf1\nf2\nf5\nf6\nf7\nf8\n\nTable 1. Frequencies and amplitudes found by a prewhitening procedure on the HARPS RV data. Frequencies\nabove the horizontal line have false alarm probabilities less\nthan 0.01. Those below the horizontal line are additional\nfrequencies found by continuing the pre-whitening procedure that resulted in an rms scatter close to the mean measurement error of the HARPS RV data.\n\n.8\n\nAmplitude\n\nAmplitude\n(m s−1 )\n8.68 ± 0.46\n6.94 ± 0.45\n5.92 ± 0.43\n5.75 ± 0.44\n5.10 ± 0.40\n4.34 ± 0.49\n3.57 ± 0.44\n2.23 ± 0.40\n2.03 ± 0.40\n\n.6\n\n.4\n\n.2\n\n0\n0\n\n.1\n\n.2\n.3\nFrequency (c/d)\n\n.4\n\n.5\n\nFig. 2. Spectral window function for the HARPS measurements.\nsubsequent FT on the residuals yields the next dominant\nfrequency in the time series. This sequential subtraction\nof dominant components is continued until the level of the\nnoise is obtained using the criterion that peaks more than 4\ntimes the Fourier noise level are regarded as real (Kuschnig\net al. 1997). This frequency analysis was performed on the\nHARPS data using the program Period04 (Lenz & Breger\n2004).\n4.1. Radial velocity data\nA pre-whitening analysis of the RV measurements was already presented in Q09. In that analysis a 12-component\nsine fit was made to the data which resulted in an rms to\nthe fit of 1.81 m s−1 . Table 1 lists frequencies using a more\nconservative solution. In this case the stopping criterion\nfor the pre-whitening (last significant peak) was assessed\nusing a bootstrap randomization procedure (e.g. Kürster\net al. 1997). Frequencies above the horizontal line have a\nfalse alarm probability less than or equal to about 1%. The\nrms scatter of the fit to the RV is 2.96 m s− 1 which is significantly higher than the mean RV error of 1.89 m s−1 .\nIncluding the two frequencies below the horizontal line results in an rms scatter of 2.18 m s−1 , only slightly worse\nthan the 12-component fit from Q09. Fig. 5 in Q09 shows\nthe fit to the RV data provided by the 12-component fit.\nThe 9-component fit listed in Table 1 is of comparable quality so is not shown here.\nMost of the frequencies from the FT analysis arise from\nstellar activity with the most dominant one being the rotational frequency, frot = 0.0448 c d−1 and its harmonics.\nThis is noted in the comment column. The rotational period derived from the RV data is 22.32 ± 0.08 days, hence\nlarger than the value of 21.65 ± 0.03 days obtained from the\nCoRoT light curve. It is not known whether this difference\nmerely reflects the difficulty in measuring the rotational pe-\n\nriod from such complex RV and light curves, or if this is a\nreal difference due to possibly differential rotation. There\nare 3 frequencies denoted f1 , f2 , and f3 that are not readily associated with stellar activity. The frequency f1 is the\nCoRoT-7b transit frequency of 1.17165 c d−1 , f2 is the 3.7day planet reported by Q09, and f3 corresponds to a period\nof 9.02 days and will discussed at length below. In Table\n1 there are three additional frequencies above the horizontal line and two below that could not be readily associated\nwith rotational harmonics, but as we show below these are\nmost likely related to the activity signal. For convenience in\nreferencing we denote sequentially the additional frequencies f4 - f8 , although for the following discussion f1 , f2 ,\nand f3 are the most important.\nThe CoRoT light curve for CoRoT-7 is complex and\nshows evidence for spot evolution on time scales of less\nthan 150 days, or comparable to the time span of our RV\nmeasurements. Although the fit to the data using the full\nRV data set is excellent, the Fourier sine components may\nnot accurately represent the activity variations over such a\nlong time span. An analysis of the data in subsets of shorter\ntime interval may minimize the uncertainties in the activity\nsignal due to spot evolution.\nTo minimize possible effects of spot evolution, a frequency analysis was also performed on sub-sections of the\nHARPS data. The RV data were divided into 3 sets each\nroughly spanning one rotation period. The time span of\nthese data sets are listed in the first 3 lines of Table 2.\nWhen analyzing data containing periods comparable to the\ntime span of the data string there can be risks to using the\npre-whitening procedure. This is certainly true for the rotational period and to some extent to the 9-d period since it\nonly undergoes 2 cycles over the time span of the subset observations. Likewise the 0.85-d suffers from being severely\nunder-sampled for some of the data subsets. In short, alias\neffects and spectral leakage may result in a spurious period being identified and removed from the data and thus\nresulting in an erroneous solution.\nIndeed, when performing a straight pre-whitening procedure to Subset 1 the dominant frequency is f = 0.13\nc d−1 and the rotational frequency appears at 0.05 c d−1 .\nOnly f2 is recovered. However, when one first fits the data\nusing the CoRoT-7b frequency first, the procedure recovers\nboth f2 and f3 . A pre-whitening analysis on Subset 2 recov-\n\n\fA.P. Hatzes et al.: An Investigation of CoRoT-7\nData\nSetset 1\nSetset 2\nSetset 3\nSetset 4\n\nRange\n2454775.8 2454825.7 2454861.7 2454847.6 -\n\n(JD)\n2454807.8\n2454860.7\n2454884.7\n2454884.7\n\nTable 2. The data subsets.\n\ners frot , f1 , and f2 , but the nearest frequency to f3 was at\n0.08 c d−1 . Subset 3 also yields different results. The dominant frequency occurs at 0.03 c d−1 , significantly different\nfrom frot . Both f2 and f3 are recovered, but the nearest\nfrequency to f1 , the transit frequency, is at 1.18 c d−1 .\nTherefore, in fitting the subset data we assumed that\nf1 , f2 , and f3 were present in the data asked the question\n\"Can the subset data be fit using these frequencies?\" To\nanswer this we first fit and removed the frequencies that\nwere found in the full data set, namely frot , f1 , f2 , and\nf3 . In this fitting only the frequencies were held fixed, but\nthe amplitudes and phases were allowed to vary. The prewhitening procedure was continued until the rms fit to the\ndata was comparable to the HARPS measurement error\n(better than 2 m s−1 ).\nTable 3–5 lists the frequencies and amplitudes from the\nFourier analysis. In all cases the rms fit of the data is comparable to the mean error of the HARPS measurements.\nThe amplitude of the ν = 0.11, 0.27, and 1.17 c d−1 signals remain relatively constant. The largest amplitude variations are found for the frequency associated with rotation,\nbut it is not clear how significant these are given the data\nsub-interval spans only one rotation period. The amplitude\nis thus probably not well determined. In summary, this has\nestablished that the RV variations in the subset data are\nconsistent with the presence of f1 , f2 , and f3 , and with amplitudes comparable to those found in the full data set. Note\nthat the additional frequencies found in the pre-whitening\nprocedure can be identified with frequencies found in the\nfull data set analysis.\nThe referee suggested an analysis of the longest data\nstring between JD = 2454847.6 - 2454884.7 as this has few\ngaps (Subset 4). A Fourier pre-whitening procedure found\nf1 and f2 , but was unable to find f3 . This was also the case\nwhen we generated a fake data set using the periods listed\nin Table 1, sampled in the same manner as Subset 4, and\nwith random noise with σ = 2 m s−1 . The pre-whitening\nprocedure was also unable to detect f3 even though it was\npresent in the data. Table 6 lists the results of the Fourier\nanalysis by first fitting frot , f1 , f2 , and f3 - similar to the\nprocedure used for generating Tables 3-5. Note that the\namplitude of f3 is considerably lower than was found for\nSubsets 1-3. This may be an indication that it is an artifact of the activity signal. However, when performing the\nsame analysis on the fake data generated using the frequencies and amplitudes in Table 1 (again with the appropriate\nsampling and noise), the fitted amplitude for f3 is a factor of 3 less. The fitted amplitudes for the fake data are\nlisted in the third column of Table 6. So, any evidence for\namplitude variations for f3 is inconclusive.\n4.2. Frequency analysis of activity indicators\nA Fourier analysis with pre-whitening was performed on the\nbisector, Ca II S-index, and FWHM measurements. These\n\n5\n\nFrequency\n(c d−1 )\n0.0447\n0.1108\n0.2707\n1.1716\n0.0218\n0.2203\nσ = 1.98 m s−1\n\nAmplitude\n(m s−1 )\n9.23 ± 0.55\n4.97 ± 0.52\n5.41 ± 0.48\n4.74 ± 0.52\n8.97 ± 0.57\n1.92 ± 0.58\n\nComment\nfrot\nf3\nf2\nf1\n\nTable 3. Frequencies found in data Subset 1\nFrequency\n(c d−1 )\n0.0447\n0.1108\n0.2707\n1.1716\n0.0227\n0.1342\nσ = 1.89 m s−1\n\nAmplitude\n(m s−1 )\n5.23 ± 0.41\n7.75 ± 0.40\n5.60 ± 0.34\n5.25 ± 0.38\n6.42 ± 0.38\n7.94 ± 1.35\n\nComment\nfrot\nf3\nf2\nf1\n\nTable 4. Frequencies found in data Subset 2\nFrequency\n(c d−1 )\n0.0447\n0.1108\n0.2707\n1.1716\n0.080\nσ = 1.99 m s−1\n\nAmplitude\n(m s−1 )\n12.80 ± 0.61\n5.08 ± 0.57\n5.87 ± 0.44\n6.10 ± 0.41\n4.02 ± 0.70\n\nfrot\nf3\nf2\nf1\n\nTable 5. Frequencies found in data Subset 3\nFrequency\n(c d−1 )\n0.0447\n0.1108\n0.2707\n1.1716\n0.085\nσ = 2.34 m s−1\n\nAmplitude\n(m s−1 )\n13.79 ± 0.45\n2.09 ± 0.47\n5.90 ± 0.35\n4.54 ± 0.40\n4.75 ± 0.52\n\nAmplitude (fake)\n(m s−1 )\n13.30 ± 0.43\n2.75 ± 0.46\n6.33 ± 0.42\n4.29 ± 0.35\n5.21 ± 0.42\n\nTable 6. Frequencies found in data Subset 4 using the same\nanalysis as Tables 3-5, i.e. first removing the contribution\nof fr ot, f1 , f2 , f3 . Column 3 shows the amplitude derived\nusing fake data (see text).\n\nare listed in Tables 7–9. The pre-whitening procedure was\ncontinued beyond the last frequency we considered significant to see if at any point a frequency was detected that\ncoincided with either f1 , f2 , and f3 . Both the bisector and\nFWHM measurements show frequencies near f2 : ν = 0.28\nc d−1 (P = 3.6 d), but only after pre-whitening the data\nwell past our stopping criterion (7th frequency found in\nthe bisector and the 6th frequency in the FWHM). These\namplitude frequencies are essentially at or below the noise\nlevel. Furthermore, when we phase the bisector and FWHM\ndata after removing all components except those near the\n3.7-d period, no obvious sinusoidal variations are present.\nWe therefore do not consider these frequencies to be significant.\n\n\f6\n\nA.P. Hatzes et al.: An Investigation of CoRoT-7\nFrequency\n(c d−1 )\n0.0432\n0.0905\n0.0667\n\nAmplitude\n(m s−1 )\n4.21\n2.81\n3.00\n\nComment\n\nData\nRV\nBisector\nCa II\n\nfrot\nf4\n\nTable 7. Frequencies found in the bisector data using a\npre-whitening procedure.\nFrequency\n(c d−1 )\n0.0447\n0.0128\n0.1369\n\nAmplitude\n\nComment\n\n0.0159\n0.0088\n0.0089\n\nfrot\n\nTable 8. Frequencies found in the Ca II data using a prewhitening procedure.\nFrequency\n(c d−1 )\n0.044\n0.033\n0.093\n\nAmplitude\n(km s−1 )\n0.0222\n0.0079\n0.0052\n\nComment\nfrot\nf5\nf4\n\nScargle Power\n5.32\n2.09\n2.08\n\nFAP\n0.0049\n0.12\n0.12\n\nTable 10. Scargle power and False Alarm Probability for\nthe Peak at 1.17 c d−1 , for RV, bisector, and Ca II data.\nNo peak could be found near 1.17 c d−1 in the Scargle periodogram of the FWHM data.\n\nfalse alarm probability (FAP, probability that it is due to\nnoise) can be calculated under two cases. The first is if one\nis searching for an unknown signal over a wide frequency\nrange, and the second is for a period known to be present\nin the data. In the former, the FAP is given by FAP = 1 −\n(1 − e−z )N ≈ N e−z , where N is the number of independent frequencies. For the latter, the FAP is given by FAP\n= e−z , where now there is only one independent frequency\n(N = 1).\n5.1. Statistical significance of 0.85-d RV period\n\nFig. 3. Scargle periodograms resulting from sequential\nadding of data subsets. Red line: subset 1, green line: subset\n1 plus subset 2, blue: all data sets.\n\nBecause we know that a 1.1716 c d−1 signal is present in\nthe CoRoT light curves we should ask: What is the FAP\nfor a signal at the known frequency of the CoRoT transit?\nTable 10 lists the Scargle power, z, and the false alarm\nprobability, FAP = e−z for the peak at 1.17 c d−1 in each\nof the data sets. Clearly, the 0.85-d period in the RV data\nis significant, whereas the false alarm probability of the\ncorresponding peak at the same frequency in any of the\nactivity indicators is over a factor of 20 higher.\nOf course, the Scargle prescription uses the rms scatter\nof the full data set to set the noise level in assessing the\nFAP. If there is real variablity in the data this increases\nthe rms scatter and results in an over-estimate of the FAP.\nFor weaker signals in time series that are dominated by a\nstronger one, you should subtract the contribution of the\ndominant signal to get a better estimate of the FAP for the\nweaker signal.\nFigure 3 shows the Scargle periodogram of the RV residuals after subtracting all sine components except that due\nto the CoRoT planet at 0.85 days. The red line shows\nthe Scargle periodogram using Subset 1, the green is after adding Subset 2, and the blue is the periodogram of the\nfull data set. The fact that the Scargle power increases with\nthe addition of each new data set (i.e. increasing statistical\nsignificance) gives us some reassurance that the signal is indeed present in all data sets. The final Scargle power of the\n1.171 c d−1 signal is z = 39, which results in an FAP of ≈\n10−17 for a known signal in the data. The FAP that noise\nwould create a peak with power higher anywhere in the\nfull spectral range (first equation from above) is ≈ 10−15 .\nThus this signal would be highly significant even if we were\nunaware of the CoRoT transit period.\n\n5. Statistical significance of the RV frequencies\n\n5.2. Statistical significance of 3.7-d RV period\n\nA common way of assessing the statistical significance of\na period found in time series data is via the Scargle periodogram (Scargle 1982). In this formulation of the Fourier\ntransform the power of a peak is related to a statistical significance rather than the amplitude of the periodic signal.\nIf a peak in the Scargle periodogram has power, z, then the\n\nThe 3.7-d period (f2 = 0.11 c d−1 ) has Scargle power of\n5.67. Based on this power level we would normally not be\nconsidered the signal to be significant. An FAP was assessed\nby using a bootstrap randomization method. The RV values\nof the data (with all signals present) were shuffled randomly\nkeeping the observation times fixed and a periodogram cal-\n\nTable 9. Frequencies found in the FWHM data using a\npre-whitening procedure.\n\n40\n\nScargle Power\n\n30\n\n20\n\n10\n\n0\n1.1\n\n1.12\n\n1.14\n\n1.16\n1.18\nFrequency (c/d)\n\n1.2\n\n1.22\n\n1.24\n\n\fA.P. Hatzes et al.: An Investigation of CoRoT-7\n\n7\n\n40\n30\n\nScargle Power\n\nScargle Power\n\n30\n\n20\n\n20\n\n10\n10\n\n0\n.15\n\n0\n.2\n\n.25\n\n.3\nFrequency\n\n.35\n\n.4\n\n.45\n\n0\n\n.05\n\n.1\n\n.15\n\n.2\n\n.25\n\nFrequency\n\nFig. 4. Scargle periodograms resulting from sequential\nadding of residual RV data for the 3.7-day period. Red line:\nsubset 1, green line: subset 1 plus subset 2, blue: all data\nsets. All sine components except the that associated with\nthe 9.02-day period.\n\nFig. 5. Scargle periodograms resulting from sequential\nadding of residual RV subsets for the 9-day period. Red\nline: subset 1, green line: subset 1 plus subset 2, blue: all\ndata sets.\n\n6. Is the 0.85-d period an alias of a rotation\nharmonic?\n5\n\nculated for this random data. After 10 such \"shuffles\" the\nnumber of random periodograms having power greater than\n5.67 over the frequency range 0–0.5 d−1 ) gave an estimate\nof the FAP. This value was 0.3.\nHowever, as stated earlier, this FAP may be overestimated due to the presence of the other signals in the RV\ndata. To get a more realistic assessment of the false alarm\nprobability the contributions from all sine components except that due to the 3.7-day period were subtracted from\nthe three subsets (the 3.7-d residuals). Fig. 4 shows the\nScargle periodogram after sequentially adding the residual\nRVs from each of the data subsets. The Scargle power increases with the addition of each subset and the final value\nis 40 which corresponds to an FAP ≈ 10−16\n5.3. Statistical significance of 9.0-d RV period\nThe peak at 9 days in the RV periodogram has Scargle\npower of 12.13. A bootstrap randomization with 105 shuffles\nyields an FAP =3.4 ×10−4 . We can be confident that this\nsignal is statistically significant even without subtraction\nof the other signals. Fig. 5 shows the Scargle periodograms\nfor the 9-d RV residuals, i.e. the RV measurements with all\nsignals except the 9-d period subtracted, and as each subset\nis added. The increase in the statistical significance with\nthe addition of more RV measurements is an indication of\na long-lived and coherent signal. The FAP of the final peak\nafter including all RV measurements is ≈ 10−16\n\nThe Scargle periodograms in Fig. 1 are dominated by the\nrotational frequency, frot . However, there is also power at\nthe first two harmonics of the rotational frequency, namely\n2frot and 3frot . Indeed, Q09 applied harmonic filtering using the rotational frequency and its first two harmonics to\nremove the signature of activity. Because of this there is\nsome concern that the 1.1715 transit frequency is close to\nthe one-day alias of the 3rd harmonic of the rotational frequency (i.e. 4frot +1 = 1.1715 c d−1 ). In the best case, the\nactivity signal can thus contribute some power at the orbital frequency of CoRoT-7b. In the worse case all the RV\nsignal at this frequency could arise from activity.\nQ09 argued that because repeated measurements were\ntaken on the same nights, that this alias effect was minimized and that the 0.85-d RV period was the one actually\npresent in the data. To investigate whether alias effects of\na rotational harmonic can account for the observed 0.85-d\nperiod in the RV data we performed an analysis on a subset of the RV consisting only of those nights for which at\nleast 3 RV measurements were made during the night. In\nthe following analysis it is assumed that the activity signal contributes a constant value to the measured RV on a\ngiven night. This is a reasonable assumption. The maximum\ntime separation between the first and last measurement on\na given night is less than 4 hours. This corresponds to a\nchange in rotation phase of only 0.007. The contribution of\nstellar activity to the measured RV should thus be a constant over that time. This also assumes that spot evolution\nover 4 hours is negligible. Meanwhile, the change in orbital\nphase of CoRoT-7b is 0.2 and should cause the dominant\nvariations observed in the RV during the course of the night.\n\n\f1.5\n1\n\nFrequency (c/d)\n\n.5\n0\n0\n\n5\n\n10\n\n15\n\n0\n\n20\n\n2\n\n4\n\n6\n\n8\n\nFig. 6. (Top) Scargle periodogram of the data set consisting of 7 nights where at least 3 RV measurements were\nmade. The measurements from each night were considered\nan independent data set and a fit was made using the period of CoRoT-7b and allowing zero point offset from each\nnight to vary. The periodogram is of the data with the offset to each night subtracted. (Bottom) Same as in the top\npanel but with the addition of 16 nights for which two RV\nmeasurements were made per night.\n\n20\n10\n0\n\nRadial Velocity (m/s)\n\nIt is not strictly true that the non-CoRoT-7b RV variations are constant during the night. The orbital motion due\nto the CoRoT-7c should produce an appreciable variation\nover 4 hours. However, this contribution is also relatively\nsmall. Over 4 hour time span the orbital phase of CoRoT7c only changes by 0.05 which corresponds to a maximum\nRV variation of only 1.5 m s−1 well below the measurement\nerror.\nThere were 7 nights where at least 3 RV measurements\nof CoRoT-7 were made resulting in a total of 21 measurements. The data from these nights were treated as 7 independent data sets with each one have a different a zeropoint velocity which could vary from night to night. A least\nsquares sine-fit the 7 data sets was made keeping the period fixed to the transit period of 0.8535 days, but allowing\nphase and the zero-point value for each night to vary. The\nadvantage of such an approach is that it is a \"minimal impact\", low pass filter that makes no assumptions about the\nunderlying time variability due to stellar activity, only that\nit is constant on a given night.\nThe top panel of Figure 6 shows the Scargle periodogram of these 21 RV measurements after subtracting\nthe individual zero-point offsets determined by the least\nsquares fitting. The strongest peak is at the transit frequency of 1.1715 c d−1 and with a smaller peak at the alias\nfrequency of 0.1715 c d−1 . Figure 7 shows the RV measurements phased to the period of CoRoT-7b and the alias period (5.7 days). The \"cleaner\" phase diagram of the 0.85\nd period supports that this is the true period in the data,\nand not the alias of 4frot .\nThe false alarm probablity of the peak at 1.1715 c d−1\nwas assessed using a bootstrap randomization procedure.\nThe RV values were shuffled 2 × 105 times keeping the\nobserved times fixed and periodograms calculated for this\nrandom data. Over the frequency range 0 < ν < 2 c d−1\nthere was only four instances where the periodogram of the\nrandom exceeded the power of the real data. The FAP for\nthis signal is thus ≈ 2 × 10−5 . We should note that this\nbootstrap was evaluated over the full frequency range 0–2\nc d−1 . Since we are interested in the known frequency of\nCoRoT-7c it is more appropriate to evaluate the bootstrap\nover a much narrower range centered on ν = 1.1715 c d−1 .\nThe FAP of this signal is almost certainly much less.\nThere were an additional 16 nights where 2 RV measurements were taken of CoRoT-7. The time separation of\nthese points are large enough to provide some good sampling of the 0.85-d sine wave presumed to be in the data.\nThese nights were added to the data subset of 3 points per\nnight to give a total of 53 data points spread over 23 nights.\nA new fit was performed, again allowing the nightly zeropoint values to vary, but keeping the period fixed to the\ntransit period. The lower panel of Fig 6 shows the periodogram of these data with the zero point offsets applied.\nNote that the Scargle power has significantly increased indicating a more signficant detection (FAP ≈ 10−16 ). Also,\nthe frequency at 1.1716 c d−1 is still higher than the alias\nfrequency. A phase diagram of these data will be shown\nbelow when we present orbital solutions.\nWe also investigated whether the period of CoRoT-7b\ncould be extracted from the data without a priori knowledge of the transit period. To do this a range of periods\nwere fit to the 53 RV measurements of the data set with\nmultiple observations per night. At each trial fit the period\nwas fixed, but the phase and zero-point offset were allowed\n\n2\n\nA.P. Hatzes et al.: An Investigation of CoRoT-7\n\nScargle Power\n\n8\n\n−10\n−20\n\n20\n10\n0\n−10\n−20\n0\n\n.5\n\n1\nPhase\n\n1.5\n\n2\n\nFig. 7. (Top) RV measurments of the 7-night data set (zeropoint offsets applied) phased to the period of CoRoT-7b.\n(Bottom) same measurements phased to the alias period of\n5.82 days.\n\n\fA.P. Hatzes et al.: An Investigation of CoRoT-7\n\nto vary. Figure 8 shows the reduced χ2 fit to the data as\na function of the fitting period. Good fits occur at periods\nwhere χ2 is minimized. This procedure could be considered\nas a variant of the phase dispersion minimization technique\nof Stellingwerf (1978), but which allows the mean value of\nindividual data sets to float (i.e. a \"floating mean\" phase\ndispersion minimization). The deepest χ2 minimum is near\nthe period of CoRoT-7b (vertical line). Other minima are\nclearly alias periods and phasing of the data to these periods does not produce as clean a phase diagram as for the\nCoRoT-7b period.\n\n9\n\n3\n\nAs a sanity check we performed a Fourier analysis on the\nnightly offsets produced by our least squares fitting. If these\nderived nightly offsets have some relationship to the activity we should see evidence of the rotational period. The top\npanel of Fig. 9 shows the Fourier transform of the nighty\noffsets (23 values). The highest peak corresponds to the\nrotational frequency of CoRoT-7 (indicated by the vertical dashed line). This indicates that the nightly zero-point\noffset indeed follows the RV rotational modulation due to\nactivity.\nOf interest is when we pre-whiten the nightly offsets to\nsearch for additional periods. The second panel shows the\noffset data after removing the contribution of the rotational\nfrequency. The highest peak corresponds to a frequency of\n0.27 c d−1 (indicated by the vertical line). The bottom panel\nshows the amplitude spectrum of the residuals after removing the contribution of the 0.27 c d−1 frequency. The highest peak corresponds to 0.112 c d−1 , close to the 0.11 c d−1\nfrequency found in the RV (indicated by the vertical line).\nIt is reassuring that the nightly offsets show evidence for\nthe rotation period of the star, but also the 3.7-d and 9-d\nperiod found in the RV analysis.\n\nReduced χ\n\n6.1. Fourier analysis of nightly offsets\n\n2\n\n2.5\n\n1.5\n\n1\n.6\n\n.8\n\n1\n\n1.2\n1.4\nPeriod (days)\n\n1.6\n\n1.8\n\n2\n\nFig. 8. The reduced χ2 as a function of period for the data\nset consisiting of nights with multiple RV measurements.\nThe zero-point offset from each night was allowed to vary.\nThe vertical line indicates the period of CoRoT-7b.\n\nAmplitude (m/s)\n\n7. On the nature of the 9-d period\nIn Q09 the two approaches to the RV data analysis (harmonic filtering and Fourier pre-whitening) agree on the\npresence of a 0.85-d and 3.7-d period in the data. The main\ndifference to the two approaches was that the pre-whitening\nprocedure yielded a significant period at 9-d, whereas this\nsignal was absent in the harmonic filtering of activity signal.\nThe obvious interpretation is that the 9-d period arises from\nthe activity signal. However, the harmonic filtering worked\non sub-sets of the data that were roughly the length of the\nrotation period, whereas the pre-whitening procedure was\nperformed on the full dataset. The 9-d period is very close\nto Prot /2, i.e. the first harmonic of the rotation period.\nThere is a danger that when applying harmonic filtering\none may remove real signals not associated with a rotational harmonic.\nTo test this hypothesis the frequency solution of the\nSubset 1 (Table 3) was used to generate a fake data set.\nThis fake data included the signals f1 , f2 , and f3 . The fits\nwere sampled in exactly the same way as the real data and\nnoise at a level of σ = 2 m s−1 was also added. The Scargle\nperiodogram of the fake data (top panel) is compared to the\nperiodograms of the real data (lower panel) in Figure 10.\nThe frequency of the input 3.7-d and 9-d period signals are\nshown as vertical lines.\n\n2\n\n10\n8\n6\n4\n2\n0\n6\n4\n2\n0\n4\n2\n0\n0\n\n.1\n\n.2\n.3\nFrequency (c/d)\n\n.4\n\n.5\n\nFig. 9. A pre-whitening on the zero-point offsets of the\nmulti-measurement nights found by the least squares fitting. (Top) Amplitude spectrum of the zero-point values.\nThe dashed line indicates the rotation period of CoRoT7b. (Middle) The amplitude spectrum after removing the\nrotational frequency. The vertical line corresponds the frequency of the 3.7-d period of CoRoT-7c. (Bottom) The amplitude spectrum after also removing 3.7-d period signal.\nThe vertical line corresponds to the frequency f3 .\n\n\f10\n\nA.P. Hatzes et al.: An Investigation of CoRoT-7\nFrequency\n(c d−1 )\n0.0450\n0.0841\n0.1384\n0.1093\n0.2701\n0.0945\n1.1706\n0.0357\n0.0728\n\n8\nModel\n6\n\nComment\nfrot\n\nf2\nf3\nf1\n\nTable 12. Pre-whitened frequencies found in the RV data\nafter first fitting the rotational frequency and its first 2\nharmonics. The final rms about the fit is 2.35 m s−1\n\n4\nScargle Power\n\nAmplitude\n(m s−1 )\n10.46\n4.27\n2.43\n6.01\n5.51\n6.86\n4.50\n4.64\n2.33\n\n2\n0\n8\nData\n6\n4\n2\n0\n0\n\n.05\n\n.1\n\n.15\n.2\nFrequency (c/d)\n\n.25\n\n.3\n\n.35\n\nFig. 10. (Top) Scargle periodogram for the fit to RV first\ndata subset (JD=4775-4807) sampled in the same manner\nas the data and with noise at a level of σ = 2 m/s. (bottom)\nThe Scargle periodogram of the real data. The vertical lines\nmark the frequencies of the 9-d and 3.7-d signals that are\nin the fake data.\nFrequency\n(c d−1 )\n0.044\n0.088\n0.132\n0.022\n0.270\n1.1716\nσ = 1.99 m s−1\n\nAmplitude\n(m s−1 )\n11.9\n5.8\n4.5\n4.6\n6.02\n4.4\n\nTable 11. Frequencies found in the simulated data set of\nSubset 1 (Fig. 10) using a pre-whitening procedure and harmonic analysis. The data was first fit using the rotational\nharmonics above the horizontal line at fixed frequency, but\nvarying amplitudes. The frequencies below the horizontal\nline are additional frequencies found by the pre-whitening\nprocedure.\n\nThere are two things to note about this figure. The periodogram of the fake data looks exactly like the real data,\nas it should. After all, the rms scatter about the fit is under 2 m s−1 . If you fit the data you fit the periodogram.\nNote, however, because of the short data window the true\nfrequency in the data, f3 , appears at a slightly different\nfrequency of 0.12 c d−1 .\nThis fake Subset 1 data set was analyzed using harmonic\nanalysis and pre-whitening. The data was first fit using the\nrotational frequency and its first two harmonics (frot , 2frot ,\nand 3frot ) as well as 0.5frot (there was evidence for the\npresence of this frequency, see Table 1.). The frequencies\nwere kept fixed, but the amplitude and phase were made to\nvary. The pre-whitening procedure was then carried out to\n\nfind additional frequencies. The results are listed in Table\n11. The pre-whitening procedure found only 2 additional\nfrequencies, f1 and f2 , but not f3 even though it was present\nin this fake data. The same result was found when applying\nthis procedure to the other data sets.\nHarmonic filtering was also performed on the full RV\n(real) data set by first fitting frot , 2frot , and 3frot to the\ndata and then continuing the pre-whitening procedure to\nfind additional frequencies. After all frequencies were found\nthe solution optimized by fitting all components simultaneously. The results are shown in Table 12. The frequencies\nf1 , f2 , and f3 were recovered in spite of the harmonic prefiltering.\nThis investigation has demonstrated that one should be\ncareful in filtering the time series data using harmonics of\nthe rotational frequency of CoRoT-7 on a limited time span\ndata set. In this case, using rotational harmonics essentially\nfiltered out the real period that was in the simulated data.\nWhen applying rotational harmonic filtering to the full real\ndata set the 9-d period was still recovered. The reason for\nthis is that over a 23-d time span there is little difference\nbetween ν = 0.11 c d−1 and the first harmonic of the rotational frequency, ν = 0.09 c d−1 . Harmonic filtering will\nessentially remove this signal. However, over the 100 days\nthat the RV data were acquired the subtle frequency difference between f3 and 2frot can be resolved and harmonic\nfiltering cannot fully remove the signal due to f3 . When\nperforming an analysis on data subsets it is instructive to\nlook also at the full data covering the longest time span.\n7.1. Bisector − RV correlations\nThe HARPS data also contain three indicators of activity:\nthe FWHM of the CCF, the bisector of the CCF, and the\nCa II emission measure. Of these 3 activity indicators only\nthe line bisectors have a direct relationship to the RV variations due to activity. Ca II emission originates in plage\nand these regions do not necessarily have the same surface\ndistribution as spots. For cool spots the FWHM mimics the\nphotometric variations. The FWHM is a minimum (like the\nphotometry) when the spot distortions are in the wings of\nthe spectral line (i.e. limb of star) and a maximum when\nthe spots are at disk center. Thus there is a phase shift of\n≈ Prot /4 between the maximum of the RV and FWHM.\nDuring this time spot evolution may be significant. On the\nother hand, surface spots produce a distortion in the spectral line which results in a shift in the line centroid. Thus\nany RV variations due to activity must be correlated di-\n\n\fA.P. Hatzes et al.: An Investigation of CoRoT-7\n\nBisector Span (m/s)\n\n50\n40\n30\n20\n10\nr = −0.28\n\nr = −0.42\n\n0\n−20\n\n0\n\n20\n\n−20\n\n0\n\n20\n\nRadial Velocity (m/s)\n\nFig. 11. (Left) Bisctor span of the CCF versus the RV measurements. The correlation coefficient is −0.28. (Right) The\nBisector-RV correlation after f1 , f2 , f3 (planet signals) have\nbeen removed from the data. The correlation coefficient is\n−0.42.\n\n.05\n0.0\n−.05\n−.10\n−.15\n−.20\nr\n\nrectly with variations in the spectral line bisector without\nthe need to apply any phase shift. For this reason we will\nfocus on the RV - bisector variations in CoRoT-7 to assess\nthe nature of the 9-d period.\nRV variations caused by cool spots should show an anticorrelation (negative slope) with the bisector variations (see\nQueloz et al. 2001). The RV variations of CoRoT-7 do show\na slight anti-correlation with the bisectors (left panel of\nFig. 11). If an RV signal is not due to activity, then removing this from the observed RV measurements should\nresult in a stronger correlation between the bisectors and\nRV variations. Indeed, when one removes that signal of the\n0.85-d, 3.7-d, and 9-d period from the RV data the bisector\nspan - RV variations become more correlated (r = −0.42,\nright panel). This suggests that the 0.85-d, 3.7-d, and 9-d\nperiods (i.e. f1 , f2 , and f3 ) found in the RV data are not\nassociated with activity.\nFig. 12 shows the correlation coefficient between the bisector and RV measurements as a function of data sets with\nthe contributions of various frequencies removed (denoted\n\"Model Number\") Model 1 is to the original RV data set.\nModel 2 is this data set with the 0.85-d period removed.\nModel 3 is the previous model, but with the 3.7 d period\nalso removed. Model 4 is the data set with the 0.85-d, 3.7-d,\nand 9-d periods removed. Note that the correlation coefficient becomes more negative with the removal of each data\nset suggesting that these 3 periods are not associated with\nstellar activity.\nModel 5 represents Model 4 − frot . Each subsequent\nmodel is the previous model with successive frequencies\nlisted in Table 1 removed (and skipping of course f1 , f2 ,\nand f3 already subtracted in Model 4). The fact that the\nRV-Bisector variations become more uncorrelated with the\nremoval of additional frequencies suggests that all frequencies in Table 1 except f1 , f2 , and f3 are most likely due to\nactivity.\nBecause the RV variations are directly related to the\nbisector variability we can use the temporal variations of\nthe RV to produce a predicted bisector variability. Saar &\nDonahue (1997) gave relationships relating both the bisector span and RV amplitude as a function of spot filling factor and rotational velocity of the star. The RV-to-Bisector\namplitudes ratio from their expressions is predicted to be\nabout a factor of 10. However, the exact ratio depends on\nseveral factors, primarily how one measures the bisector\nspan and which spectral lines are used. Their result cannot be directly compared to the bisector measurements of\nthe CCF from the HARPS data. A better way is to use the\nRV-to-Bisector amplitude ratio estimated by comparing the\namplitudes of frequencies found in both the RV and bisector amplitude spectra and using data where these quantities\n(bisector and RV) were measured in a consistent way. The\nRV frequencies ν = 0.043 c d−1 and 0.094 c d−1 in Table\n1 have amplitudes of 7.5 m s−1 and 5.69 m s−1 . The corresponding frequencies in the bisector amplitude spectrum\nhave amplitudes of 4.21 m s−1 and 2.81 m s−1 , respectively.\nThis implies that the RV-to-Bisector amplitude is ≈ 2.\nWe created a model of the bisector variations based on\nthe amplitude spectrum of the RV measurements. Two fake\ndata sets of bisector variations were generated. The first\nused all the frequencies in Table 1, excluding f1 , f2 , and\nf3 . All amplitudes in Table 1 were reduced by a factor 0.5\ncorresponding to the bisector-to-RV amplitude ratio. The\nsampling of this time series was the same as the actual\n\n11\n\n−.25\n−.30\n−.35\n−.40\n−.45\n−.50\n1\n\n2\n\n3\n\n4\n\n5\n6\nModel Number\n\n7\n\n8\n\n9\n\n10\n\nFig. 12. The correlation coefficient of the CCF bisector\nspan with RV as a function of different versions of the RV\ndata with the frequencies in Table 1 removed. Model 1: raw\ndata, Model 2: f1 removed, Model 3: f1 and f2 removed,\nModel 4: f1 , f2 , and f3 removed. Model 5: Model 4 and frot\nremoved. Others: subsequent removal of all other frequencies in Table 1.\n\n\fA.P. Hatzes et al.: An Investigation of CoRoT-7\n\ndata. The bisector variations have an rms scatter of 4.5\nm s−1 after removal of the dominant frequencies. This was\ntaken as the mean bisector error and random noise at this\nlevel was added to the fake bisector data. The second data\nset was similar to the first one, but the frequency f3 was\npresent with the appropriately scaled amplitude (i.e. only\nf1 and f2 were removed).\nThe top panel of Fig. 13 shows the Scargle periodogram\nof the actual bisector measurements. The middle panel\nshows the periodogram of the fake data, but without the\npresence of the 9-d period. The bottom panel shows the\nperiodogram of the fake bisector data with the 9-d period\npresent. Vertical red lines show the rotation frequency and\nits first 3 harmonics. The vertical blue line shows the frequency corresponding to the 9-d period.\nThere are two interesting features about this figure.\nFirst, the periodogram of the fake bisector data without\nthe 9-d period looks qualitatively like the real data. Many\nof the same peaks are seen in both periodograms. The ratio of the amplitudes are not quite correct probably due\nto the bisector data having more complicated noise characteristics than the Gaussian noise in our simple model.\nFurthermore, for high frequency components that the RVto-Bisector amplitude ratio may be different. The second\nimportant feature to note is that in the periodogram of the\nfake data with the 9-d period present there is a signficant\npeak at ν = 0.11 c d−1 that is not seen in the data periodogram. If the 9-d period was due to activity we should\nhave seen a corresponding peak in the periodogram of the\nbisectors and most likely in the Ca II and FWHM. This\nalso argues in favor of the 9-d period not being related to\nactivity.\n\n8. A search for transits from CoRoT-7d\nThe CoRoT-7 light curve was analyzed to see if a 9-d transit\nsignal could be found in the data. A similar investigation\nwas already performed to search for transits from CoRoT7c, but none was found (Q09). If the orbits of all planets are\nco-planar we do not expect to see transits from CoRoT-7d.\nHowever, if substantial differences of the orbital inclination\nbetween the planets exist, CoRoT-7d may well transit in\nspite of having a larger orbital radius than CoRoT-7c.\nThe CoRoT-7 light curve first had to be filtered for the\nlarge variations due to the stellar activity. This was done\nby: 1) normalizing the light curve by the maximum value,\n2) performing outlier rejection, 3) reducing residual orbital\neffects by using a running median of length one orbit, and\n4) tracking slow variations using a sliding polynomial of 12\nhours and subtracting these. Finally, we fit the transit curve\nof CoRoT-7b and subtracted that from the light curve.\nThis processed light curve was then phase-folded to the\n9.02 d period. No transit signal above the noise was detected. We derive an upper limit of 1.5 × 10−4 for the\ndepth of any transit at a period of 9.02 d.\n\n9. Orbital solutions\n9.1. The 0.85-d period\nModels of the internal structure of CoRoT-7b rely on the\nmass determination which in turn hinges on the amplitude\nof the RV variations. In Q09 the amplitude of CoRoT7b was estimated to be 3.5 m s−1 using two different ap-\n\n10\n\nData\n\n5\n0\nScargle Power\n\n12\n\nModel w/o 9−d Period\n\n10\n5\n0\n\nModel w/ 9−d Period\n\n10\n5\n0\n0\n\n.05\n\n.1\n.15\nFrequency (c/d)\n\n.2\n\n.25\n\nFig. 13. (Top) Scargle periodogram of the CCF bisector\nvariations. (Middle) Scargle periodogram of a fit generated\nusing the RV frequencies of Table 1, but without f1 , f2 , and\nf3 present. Amplitudes were adjusted according to the measured RV-to-Bisector amplitudes. Random noise at the level\nobserved for the bisector measurements were also added.\n(Bottom) Same as for the middle panel but with f3 (9-d\nperiod) present.\nproaches and this corresponds to a planet mass of 4.8\nM⊕ . However, this value was obtained after applying a\ncorrection term for the effects of the filtering process to\nboth techniques using simulated data. The uncorrected prewhitening procedure amplitude was slightly higher at 4.2\nm s−1 and the harmonic filtering amplitude lower at 1.9\nm s−1 . Clearly, the amplitude of CoRoT-7b depends on how\none removes the activity signal.\nAs an alternative approach to determining the RV amplitude of CoRoT-7b we took the results from Section §6.\nIn this analysis we used only the RV data for which multiple measurements were made each night. A least squares\nsine fit to this data was made keeping the period fixed and\nallowing the nightly offset to vary. The final offsets were\nthen applied to the individual nights and the data combined. This may be the best way to account for the RV\nvariations of activity without any assumptions about its\ntemporal behavior. An orbital solution was performed on\nall the residual RVs keeping the ephemeris, T0 , fixed to the\nCoRoT transit time of 2454446.7311.\nTable 13 lists the orbital elements. At first the nightly\ndata were fit keeping the CoRoT transit period of 0.8535\ndays. If we allow this parameter to vary we get a best fit\nto the data with a period of 0.85359 days which is listed in\nthe table. Allowing the To to vary, but keeping the period\nfixed results in To = 2454446.7330 a value very close to the\nCoRoT ephemeris. Allowing the eccentricity to vary results\nin a best fit value of 0.08, but with large error, σ = 0.13.\nWe cannot exclude a slight eccentricity in the orbit, but\ngiven the large variations due to activity and the additional\n\n\fA.P. Hatzes et al.: An Investigation of CoRoT-7\n\n13\n\nParameter\nPeriod [days]\nTperiastron [JD]\nK [m s−1 ]\ne (fixed)\nm [M⊕ ]\na [AU]\nreduced χ2\n\nValue\n9.021 ± 0.019\n2454446.16 ± 0.09\n5.90 ± 0.83\n0.0 ± 0.05\n16.7 ± 0.42\n0.08\n1.24\n\nTable 15. Orbital parameters for the 9.02-d period.\n\nRadial Velocity (m/s)\n\n10\n\n0\n\n20\n−10\n\n.2\n\n.4\n.6\nOrbital Phase\n\n.8\n\n1\n\nFig. 14. (Top) Orbital solution for the 0.85-d period using the data with repeated nightly measurements and the\nappropriate zero-point offset applied.\nParameter\nPeriod [days]\nT0 [JD] (fixed)\nK [m s−1 ]\ne (fixed)\nm [M⊕ ]\na [AU]\n\nValue\n0.85359 ± 0.00059\n2454446.7311\n5.04 ± 1.09\n0.00\n6.9 ± 1.4\n0.017\n\nTable 13. Orbital parameters for the 0.85-d period.\nParameter\nPeriod [days]\nTperiastron [JD]\nK [m s−1 ]\ne\nω [deg]\nm [M⊕ ]\na [AU]\nreduced χ2\n\nValue\n3.691 ± 0.0036\n2454450.38 ± 0.03\n5.10 ± 0.33\n0.08 ± 0.05\n166 ± 36\n12.4 ± 0.42\n0.045\n1.07\n\nTable 14. Orbital parameters for the 3.7-d period.\n\ncompanions, this may be difficult to extract reliably from\nthe RV data. Figure 14 shows the zero-point corrected data\nphased to the CoRoT transit ephemeris and a period of\n0.85359. The solid line represents the orbital solution.\nThe derived K-amplitude is 5.04 ± 1.09 m s−1 which\nresults in a companion mass of 6.9 ± 1.4 M⊕ . This is slightly\nlarger than the K-amplitude of 4.16 ± 0.27 m s−1 (m = 5.75\n± 0.37 M⊕ ) by pre-whitening the full data set (Q09). The\nK-amplitude from pre-whitening of the full data set and the\nanalysis of the subset RV data with multiple measurements\neach night both suggest a slightly higher planet mass than\nthe 4.8 ± 0.8 M⊕ of Q09, although all determinations are\nconsistent to within the errors.\n\n10\nRadial Velocity (m/s)\n\n0\n\n0\n\n−10\n\n−20\n0\n\n.2\n\n.4\n.6\nOrbital Phase\n\n.8\n\n1\n\nFig. 15. The RV residuals of CoRoT-7 after removing all\ncomponents in Table 1 except for f2 and phased to the 3.7\nd period (points). The orbital fit is shown as a line\n\n9.2. The 3.7-d period\nRV residuals were produced by subtracting all sine components except for f2 from the full RV data set and an\norbital solution calculated. In removing the contribution\nof f1 the amplitude in Table 13 was used rather than the\nslightly higher amplitude found in Table 1. The derived amplitude is slightly lower than the one presented in Q09 (5.5\nm s−1 ) that removed f1 using the amplitude found in the\npre-whitening procedure. In order to estimate the range of\nvelocity amplitudes for f2 a least squares fit to the original RV data was first made using this frequency and the\nsubsequent frequencies found in the pre-whitening process\nsequentially subtracted. The range of amplitudes for f2 during this process ranged from 4.75 to 5.4 m s−1 . An error of\nσ = 0.33 m s−1 was adopted which is slightly more than the\nformal error of σ = 0.39 m s−1 from the orbit fitting. Note\nthat this formal error is much lower than for the amplitude\nCoRoT-7b which was calculated using only a subset of the\ndata.\nFig. 15 shows the orbital solution the 3.7-day period.\nThe orbital elements are listed in Table 14. A slight eccentricity is found, but this may well be an artifact due to the\nfiltering process.\n\n\f14\n\nA.P. Hatzes et al.: An Investigation of CoRoT-7\n\n9.3. The 9-d period\nThe RV residuals were calculated subtracting all sine components in Table 1 except for f3 and again using the amplitude for f1 from Table 13. The range of possible amplitudes for f3 during the pre-whitening procedure was 5.5 –\n7.15 m s−1 . We thus adopted an error in the ampitude of\nσ = 0.83 m s−1 , larger than the formal error of σ = 0.26\nm s−1 , but probably a more realistic estimate. A best fit\norbit allowing the eccentricity to vary resulted in a slightly\nnegative value. We therefore took a solution with the eccentricity fixed to zero with an error of σ = 0.05.\nFig. 16 shows the orbital solution to the RV residuals\nusing the 9-day period. The orbital elements are listed in\nTable 15. Note the gap-like structures in the phase curve.\nThis is undoubtedly due to the period being nearly an integer value of one day, i.e. our typical sampling rate.\n\n10. On the dynamical stablity of the 3-planet\nsystem.\nWe also investigated whether the 3-planet system would be\ndynamically stable. Although a stable system is no proof\nthat all 3 planets exist, an unstable system would indicate\nthat the additional planetary signals found in the HARPS\ndata may arise from activity.\n20\n\n10.1. An ultra-compact planet system?\n\n10\nRadial Velocity (m/s)\n\nThe stability of planetary systems involves multiple interactions of planets by mutual perturbations often involving\ninteractions of resonances between more than two planets\nand various components of their motions. It is a stability for some time. As Lecar et al. 2001 summarize it: The\nsolar system is not stable, it is just old!. Given the snapshot provided by discovery orbital elements we first briefly\noverview the gross/overall properties of the CoRoT-7 system by a simple stability indicator based on Hill-exclusion\nvolumes. It requires non-overlapping cylindrical volumes of\nhalf-width kRHill , around each planet orbit. The Hill-radius\nto lowest order is RHill,i = kai (mi /3M⊙ )1/3 , with mi , ai\ndenoting the mass and semi-major-axis of the i -th planet,\nrespectively, and k is a factor of 4–15 depending on the\nnumber of planets, the dynamical structure of the system\n(masses, orbital elements), and the time-scale for stability\nunder consideration, c.f. e.g. Chambers et al. (1996) including a discussion on system stability with long-term orbital\ncalculations. Funk et al. (2010) show that for close-in systems, there are surprisingly large volumes of phase space\nfor stable and planet-rich systems at periods of less than\n10 days around solar mass stars. These ultra compact systems can easily harbor 8 Super Neptunes for 500 Ga and up\nto 30 M⊕ . Funk et al. (2010) determine a factor of k >\n∼ 6.4\nthat is necessary for stability in the present context - 3\nplanets, masses below Neptune's and few Ga timescales -\nand give examples for it being sufficient including close-in\nsystems with an additional Jupiter-mass planet at 0.26AU\n(i.e. ∼ 50 days).\nAn application of this Hill-stability estimator to the\nCoRoT-7 system is shown in Fig. 17. The Hill-exclusion regions are outlined in a mass versus semi-major axis diagram\nfor the system parameters determined here. Forbidden regions for other planets in a stable system are shown by\nshaded areas around every orbit. The dark reddish shaded\n\n0\n\n−10\n\n−20\n0\n\n.2\n\n.4\n.6\nOrbital Phase\n\n.8\n\n1\n\nFig. 16. The RV residuals of CoRoT-7 after removing all\ncomponents in Table 1 except for f3 and phased to the 9.02\nd period (points). The orbital fit is shown as a line\n\narea is for k = 7, a secure upper bound to the Funk et al.\n(2010) results. The larger, light-blueish areas are for k = 10\nin order to approximately account for and securely bound\nuncertainties in the mass and semi-major axis determinations (6 and 3% resp. at 5σ) and 15% for a possible orbital\ninclination1 , idyn = 30◦ of c and d. The width of the stability exclusion regions is emphasized by two horizontal bars\nin the resp. color at the top. The stellar radius (yellow) and\nthe Roche-limit (green) are plotted as vertical bars on the\nleft.\nFor comparison the mass-estimates of the discovery paper, Q09 are shown with their 1 and 5σ error-ellipses to\n1\nThat corresponds to an inclination of the orbital plane with\nrespect to the sky, iobserver = 60◦ .\n\n\fA.P. Hatzes et al.: An Investigation of CoRoT-7\n\ndemonstrate that they clearly provide less stringent stability constraints due to smaller mass values.\nThe CoRoT-7 system as presented here, is clearly found\nstable as demonstrated by the non-overlap of the appropriate Hill-exclusion zones. Not much space for stable planet\norbits is left between components c and d. Thus the system\nis dynamically full - as the solar system, cf. Lecar et al.\n(2001). However, according to this simple approach a small\nplanet might fit in between b and c if orbits are and remain\ncircular.\nThis merits a detailed dynamical analysis that fully accounts for orbital inclinations (with only loose observational\nconstraints for c,d), the eccentricities and the interactions\nof all components on the various timescales.\n10.2. A short dynamical study of the CoRoT-7 system\nWe performed a more detailed dynamical study of the stability of CoRoT-7 using different initial parameters that\ntook into account the errors in the orbital elements:\n– The orbital periods of all three planets have only errors\nin the order of 0.1 % and consequently for our numerical\nstudy these were not varied.\n– Because of the large errors in the perihelia we just set\nthem to 0;\n– For the planet masses we have taken the nominal values\n+1σ (8.3, 12.8 and 17.1 M⊕ for CoRoT-7b, CoRoT-7c\nand CoRoT-7d, respectively).\n– The eccentricities of all planets are relatively small and\nespecially the innermost one may suffer from tides which\nmay keep its eccentricity very small2 .\n– There is no information available about the mutual inclination; therefore in a first attempt we just set their\norbital inclination to small values (1, 2 and 3◦ ).\nWith these initial conditions the orbits turned out to\nbe very stable so in the next step we changed their mutual\ninclinations. In fact it is quite improbable that all three\nplanets are moving in the same plane and the two outer\nplanets can move in different orbital planes with respect to\nCoRoT-7b. Two runs were tested3\n1. R1: The inclination of CoRoT-7c was initially set to\n1, 16 and 31◦ , whereas the other two planets initially\nmoved in the same plane.\n2. R2: The inclination of CoRoT-7d was initially set to\n1, 16 and 31◦ , whereas the other two planets initially\nmoved in the same plane\nThe results of R1 are shown in Fig. 18, where it is well\nvisible that a different inclination of one of the planet's\norbit may change the other orbits drastically. For a 1◦ inclination the three planets system is in a very stable state,\nwhich is visible from the quasiperiodicity state of all three\n2\nThe computations have been undertaken in the Newtonian\nframework with assumed point masses of the planets. Internal\ntests have shown that the tides may not significantly change all\norbits even when the parameter Q0 was varied within orders of\nmagnitudes\n3\nNote that an assumed inclination in the signal of the RV\nmeans that the masses of CoRoT-7c and 7d are minimum\nmasses; we therefore in our test computations took care of this\nfact.\n\n15\n\norbits (Fig 18, upper panel). An additional check of the\nother orbital elements show that the perihelions are moving smoothly, the nodes are in a state of libration. For a 16◦\ninclination the signal is already very different but still has\nthe sign of being quasiperiodic (regular and stable!). This\nis also true for the secular motion of the nodes and perihelia. Even with an inclination of 31◦ for CoRoT-7c the\ntime evolution of the eccentricities of all three planets is\nperiodic and shows a signal typical for a stable dynamical\nsystem (Fig. 18 lower panel).\nThe results of R2 are shown in Fig. 19, where it is again\nseen that a different inclination for one of the planets' orbits\n(in this case of CoRoT-7d) may change the other orbits significantly. This is not the case when the inclination of the\noutermost planet is set to only 1◦ ; we do not show this\ngraph since it is quite similar to the one with CoRoT-7c set\nto an inclined orbit of 1◦ . In the two upper panels we depict the results of the time evolution of the eccentricities of\nall three planets using an inclination for CoRoT-7d of 16◦\n(upper panel) and 31◦ (middle panel). In the upper panel\nit is visible that the innermost planet has a quite different period in its eccentricity behavior compared to Fig. 18\n(middle panel). For i = 31◦ the picture is very different from\nthe lower panel in Fig. 18. It is evident that the CoRoT-7b\n(eccentricity 0 < e < 0.45) is not on a regular orbit but\nshows signs of chaoticity in eccentricity and in inclination\n(Fig. 19 lower panel). This can be understood in terms of\nthe larger mass of CoRoT-7d strongly perturbing CoRoT7c and thus indirectly perturbing CoRot-7b and making the\norbit of this innermost planet chaotic, but not yet unstable.\nA larger inclination of either CoRoT-7c or CoRoT-7d may\nput CoRoT-7b into a Kozai resonance (Kozai 1962) which\nis known to enlarge the eccentricity significantly and can\nlead to unstability of the whole system.\n10.2.1. Consequences of different inclinations for the transit\nWith the quite reasonable assumption that the three planets move on mutually inclined orbits we now test how\nthat would influence the transit of the innermost planet\nCoRoT-7b. We cannot expect a large influence in its orbit\non the short time scales CoRoT-7 was observed by CoRoT\nor HARPS. However, the big advantage of the planetary\nsystem which we are studying is that CoRoT-7b has an\norbital period of less than one day and the other two presumed planets are also in very close-in orbits around the\nstar. This accelerates the dynamics of the system, which\nmeans that any mutual gravitational influence (perturbations on the Keplerian orbits) is visible on short time scales.\nWe checked the change in the inclination of the orbit of\nCoRoT-7b depending on the mutual inclinations with the\naim of possibly measuring the influence on the inclination of\nCoRoT-7b which could be larger than the given errors bars\nderived from the light curve analysis (i = 80.1◦ ± 0.3◦ ).\nIn fact, Fig. 20 (upper panel) shows how the dynamics\nof the system could influence the inclination of CoRoT-7b.\nThe lower line shows the difference in inclination with respect to the actual assumed orbit after 1 year, the middle\nline after 3 years, and the upper line after 10 years when\nthe inclination of CoRoT-7c has different inclinations between 1 and 30◦ . Fig. 20 (lower panel) shows the same for\na change in the inclination of CoRoT-7d.\nAfter these results we can conclude the following: after\none year of observation (lowest line with '+') in none of\n\n\f16\n\nA.P. Hatzes et al.: An Investigation of CoRoT-7\n\nArchitecture and Stability of the CoRoT-7 System\n\n20\n\nMass / [Earth masses]\n\n15\n\n10\n\n5\n\n0\n0.00\n\nexclusion, 7 R_Hill\nexclusion, 10 R_Hill\nCoRoT-7b,c,d - 1 and 5 sigma\nStellar Radius: 0.93 R_Sun\nRoche-limit\nCoRoT-7b,c 1 & 5 sigma, Queloz et al.\n0.02\n\n0.04\n\nSemi-major axis / [AU]\n\n0.06\n\n0.08\n\n0.10\n\nFig. 17. Synopsis and simple stability for the CoRoT-7 system. Planetary mass in Earth-units is plotted against the\ndistance from the star in AU. Mass and semi-major axis determinations of this work (blue dots) and the discovery paper\n(green dots) are shown for the CoRoT-7-system, together with their 1 and 5σ error ellipses (reddish and greenish, resp).\nErrors are due to the measurements and analysis of the RV signals for CoRoT-7 and the high resolution spectroscopic\nanalysis of its photosphere. Semi-major axis ranges excluded by the Hill-exclusion stability criteria are shaded. Dark,\nreddish and light, blueish areas corresponding to k-values of 7 and 10 respectively. Uncertainties in stability analysis,\norbital inclinations and measurement errors are included approximately by the latter value, see text. The stellar radius\n(yellow) and the Roche-limit (green) are indicated on the left for orientation. The non-overlap of the shaded areas\nrequired by Hill-exclusion-stability indicates the stability of the CoRoT-7-system as outlined here. Note: 1 σ error ellipses\nare partially covered by the dot-symbols for CoRoT-7b,c.\nthe cases is the effect larger than the errors on i. This is\nshown by the thick horizontal line which indicates the error\nin the determined inclination of CoRoT-7b. The change in\ni is well within the measurement error. After three years δi\ncould be in the order 0.3◦ when CoRoT-7c would be on an\ninclined orbit of (i > 10◦ with respect to CoRoT-7b). This\nis visible from the crossing of the line (with stars) and the\nthick line; it would be undetectable when CoRoT-7d would\nmove on an inclined orbit. Only after ten years of observation a significant effect (δi > 0.3◦ ) would be detectable\nfor inclinations i > 3◦ and i > 13◦ for runs R1 and R2,\nrespectively.\nWe can conclude that\n\n1. the system of three planets of the star CoRoT-7 with the\nparameters determined via RV and the transits observed\nby CoRoT is in a very stable state even for hundreds\nmillions of years when their orbital planes are almost the\nsame. They would even be stable for mutually inclined\norbits i < 25◦ .\n2. mutually inclined orbits show quite interesting effects\non the duration of the transit of CoRoT-7b. If CoRoT7c were inclined by i > 10◦ with respect to CoRoT-7b, a\ndetectable effect could be observed in the change in the\ninclination of CoRoT-7b via the duration of the transit\nwithin the lifetime of the satellite CoRoT.\n\n\feccentricity\n\neccentricity\n\neccentricity)\n\nA.P. Hatzes et al.: An Investigation of CoRoT-7\n\n17\n\n0.12\n0.1\n0.08\n0.06\n0.04\n0.02\n0\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n0\n\n10\n\n40\n\n50\n\n0.14\n0.12\n0.1\n0.08\n0.06\n0.04\n0.02\n0\n0.18\n0.16\n0.14\n0.12\n0.1\n0.08\n0.06\n0.04\n0.02\n0\n20\n30\nTime in thousand years\n\nFig. 18. Time evolution of the three planets' eccentricities for different inclinations of CoRoT-7c: 1 (top),16 (middle)\nand 31◦ (lower).\n\n2\n\ndelta i of Exo-7b\n\nA paper concerning a detailed analysis of the influence\nof the inclination shift on the duration of the transit is in\npreparation (Dvorak and Schneider, in preparation).\n\n1.5\n\n1\n\n0.5\n\n11. Discussion\n0\n5\n\n10\n\n15\ninclination of Exo-7c\n\n20\n\n25\n\n5\n\n10\n\n15\ninclination of Exo-7d\n\n20\n\n25\n\n1\n\ndelta i of Exo-7b\n\nOur Fourier analysis of the HARPS time series of RV measurements for CoRoT-7 reveals up to 9 frequencies. Most of\nthese are associated with the activity signal. However, this\nanalysis also found 3 frequencies not associated with activity: f1 = 1.1715 c d−1 (P = 0.8535 d), f2 = 0.270 c d−1 ,\nand f3 = 0.1101 c d−1 ). The first coincides with the transit\nfrequency found in the CoRoT-7 light curve and f2 coincides with the second planet, CoRoT-7c, also reported by\nQ09 using the same data set. The final frequency f3 may\nbe due to an additional companion.\nThe analysis of the RV data presented in Sections §5 and\n§6 reveals that the CoRoT transit period is present in the\nRV data with a very high degree of statistical significance.\nThere can be no doubt the transit-like events seen in the\nCoRoT-7 light curves are caused by a ∼ 2 R⊕ radius planet\nin a 0.85-d orbit.\nThe mass of CoRoT-7b which is important for planet\nstructure models depends on the amplitude of the 0.85-d\nperiod in the RV data. Unfortunately, due to the relatively\nhigh activity of CoRoT-7 this amplitude depends on the\ndetails of how the stellar signal is removed. In Q09 the\nmass of CoRoT-7b can thus be as low as 2.6 M⊕ and as\nhigh as 5.5 M⊕ .\n\n0.8\n0.6\n0.4\n0.2\n0\n\nFig. 20. The difference in inclination δi of CoRoT-7b (yaxis) compared to an initial plane orbit of CoRoT-7b (xaxis) versus the inclination of CoRoT-7c (upper graph) after 1 (lower line), 3 and 10 years (upper line). The same\nplot for different inclinations of CoRoT-7d; the thick line is\nthe assumed error ( δi = 0.30◦ in the determination of the\norbit of (lower graph).\n\nThe analysis of the RV measurements from individual nights where at least 2 measurements were made may\nyield the best estimate of the RV amplitude of CoRoT-7b.\nBy fitting the CoRoT-7b period to the data and allowing\n\n\fA.P. Hatzes et al.: An Investigation of CoRoT-7\n\neccentricity+inclination\n\neccentricity\n\neccentricity)\n\n18\n\n0.14\n0.12\n0.1\n0.08\n0.06\n0.04\n0.02\n0\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\n40\n\n50\n\n0.5\n0.45\n0.4\n0.35\n0.3\n0.25\n0.2\n0.15\n0.1\n0.05\n0\n60\n50\n40\n30\n20\n10\n0\n0\n\n10\n\n20\n30\nTime in thousand years\n\nFig. 19. Time evolution of the three planets' eccentricities for different inclinations of CoRoT-7d: i = 16◦ (upper graph)\nand i = 31◦ (middle graph). On the lower panel we plot the inclination and the eccentricity (times 100) of CoRoT-7b,\nwhere the nonregular behaviour is clearly visible.\n\nthe zero-point velocity offset to vary each night in a least\nsquares sense we can account for the influence of stellar\nactivity in a simple and model independent way. The fact\nthat the calculated zero-point offsets from each night recovers both the rotational period of the star and the signal due\nto CoRoT-7c suggests that this approach is valid. This approach yields an RV amplitude of 5.04 ± 1.09 m s−1 which\nresults in a mass of 6.9 ± 1.4 M⊕ .\nRecently, Bruntt et al. (2010) performed a detailed spectral analysis of CoRoT-7 and determined a stellar radius of\nR∗ = 0.82 ± 0.04 R⊙ . This results in a revised planet radius of Rp = 1.58 ± 0.1 R⊕ . This along with our slightly\nhigher planet mass results in a density of 9.6 ± 2.7 gm cm−3\nwhich puts it squarely on the Valencia et al. (2009) curve for\nEarth-like planets (33% iron and 67% silicates). In terms of\nstructure CoRoT-7c may indeed be an Earth-like planet.\nAlthough this work and Q09 conclude that the 3.7-d period in the RV is due to an additional companion, the nature of the 9-day period is still not fully resolved. Other approaches to the analysis of the RV time series attributes this\nsignal to the activity signal (Melo, in preparation). Lanza\net al. (2010) investigated the effects of photospheric spots\non the RV variations of CoRoT-7, but could not confirm\nwhether a 9-d period was in fact due to activity. However,\nour analysis presented here gives strong evidence in support\nof a third companion:\n\n– When the data is divided into subsets the Scargle power\nin the periodogram at 0.11 c d−1 increases with the addition of each data set (Section §5). In other words the\nsignal becomes more significant with additional data a behavior consistent with a periodic signal that is coherent and long-lived.\n– This signal is not found in the periodograms of any\nof the three activity indicators: bisector span, Ca II Sindex, and the FWHM of the CCF in spite of all three\nhaving the exact same sampling as the RV data. Any\nactivity signal found in the RV should be seen in at least\none of these indicators.\n– We have demonstrated that an analysis of subsets of\nthe data using filtering with rotational harmonics may\nremove a 9-d period to the data even if one is known\nto be present. Just because harmonic filtering removes\na 9-d signal from the Fourier power spectrum is not an\nindication that this signal is due to rotation modulation.\n– The highest degree of correlation between the RV and\nbisector data occurs after removing the RV signal of\nthe 0.85-d, 3.7-d, and 9.02-d periods. This suggests that\nthese 3 periods do not arise from stellar activity.\n– A model of the bisector variations using scaled version\nof the RV variations, but without the presence of f1 ,\nf2 , and f3 and with the appropriate level of noise produces a periodogram that is in good agreement with\nthe periodogram of the observed bisector variations. It\nis difficult to understand why the 9-d period appears so\n\n\fA.P. Hatzes et al.: An Investigation of CoRoT-7\n\nstrongly in the RV power spectrum, but not at all in\nthe bisector power spectrum if it is due to activity.\nOur dynamical study indicates that the 3 planet system for CoRoT-7 should be stable. More interestingly, if\nthere are significant differences in the relative inclinations\nof the 3 planets, the inclination of CoRoT-7b should change\nsuch that this could be measured during the mission life of\nCoRoT.\nThe hypothesis that CoRoT-7 has a third planetary\ncompanion is one that is easily verified. All that is required\nare additional RV measurements of quality and quantity\nthat are comparable to the HARPS measurements used in\nthis study. If the RV signal for CoRoT-7d remains constant\nin phase and amplitude it would be difficult to attribute it\nto activity. (This also holds for CoRoT-7c). However, given\nthat the 9-d period is close to the first harmonic of the rotational frequency, data with a rather long time base, like the\nones used in this study, may be required. Verification of the\nthird planet is important as this would make the CoRoT-7\nsystem an excellent example of an ultra-packed planetary\nsystem.\nAdditional RV measurements are also important for reducing the errors on the planet mass needed for comparing\nto planetary structure models. The complexity of the RV\nvariations for CoRoT-7 and the high level of activity also\nmeans that it would be difficult to obtain a value of the\nplanet mass of CoRoT-7b to better than about 20% without signficantly more RV measurements. However, CoRoT7 is such an interesting system further measurements may\nbe worthwhile. Given that 80 hours of HARPS time have\nalready been devoted to CoRoT-7 only stresses the need\nfor considerable telescope resources for precise RV studies\nof exoplanets.\nAcknowledgements. The authors thank DLR and the German BMBF\nfor support under grants 50 OW 0205, 50 OW 0501, 50 OW 0603.\nGünther Wuchterl thanks the MPE for computation-resources on\nDEC/VMS machines. APH would like to thank the CoRoT Exoplanet\nScience Team for useful discussions, helpful comments, and critical remarks which resulted in a much improved analysis of the RV data.\nWe also thank the referee, Gordon Walker, for useful comments which\nresulted in an improved paper. We also thank him for his rapid refereeing of the paper.\n\nReferences\nAuvergne, M., Bodin, L., Boisnard, L. et al. 2009, A&A, 506, 411\nBaglin, A., Auvergne, M., Boisnard, L. et al. 2006, in COSPAR,\nPlenary Meeting 36, 36th COSPAR Scientic Assembly, 3749\nBruntt H., Deleuil, M., Fridlund, M., Alonso, R., Bouchy, F., Hatzes,\nA., Mayor, M., Moutou, C., & Queloz, D. 2010, A&A, in press.\n(arXiv1005.3208v1)\nChambers, J. E., Wetherill, G. W., & Boss, A. P. 1996, Icarus, 119,\n261\nCharbonneau, D., et al. 2010, Nature, 462, 891\nFunk, B., Wuchterl, G., Schwarz, R., Pilat-Lohinger, E., & Eggl, S.\n2010, A&A subm.\nHatzes, A.P., Cochran, W.J., & Bakker, E.J. 1998, ApJ, 508, 380.\nKozai, Y. 1962, AJ, 67. 591\nKürster, M., Schmitt, J.H.M.M., Cutispoto, G. & Dennerl, K. 1997,\nA&A, 320, 831\nKuschnig, R., Weiss, W. W., Gruber, R., Bely, P. Y., & Jenkner, H.\n1997, A&A, 328, 544\nLanza, A.F., Bonomo, A.S., Moutou, C., et al. A&A, in press\n(arXiv:1005.3602v1).\nLecar, M., Franklin, F. A., Holman, M. J., & Murray, N. J. 2001,\nARAA, 39, 581\nLeger, A., Rouan, D., Schneider, J. et al. A&A, 506, 287.\n\n19\n\nLenz, P. & Breger, M. 2004, The A-Star Puzzle, IAU Symposium No.\n224, Cambridge, UJ, Cambridge University Press, p786.\nQueloz, D., Henry, G., Sivan, J.P., et al. 2001, A&A, 379, 279.\nQueloz, D., Bouchy, F., Moutou, C. et al. 2009, A&A, 506, 303\nSaar, S.H. & Donahue, R.A. 1997, ApJ, 485, 319\nScargle, J.D. 1982, ApJ, 263, 835\nStellingwerf, R.F. 1978, ApJ, 224, 953.\nValencia, D., Ikoma, M, Guillot, T., & Nettelmann, N. 2010, A&A,\nin press (arXiv:0907.3077v1)\n\n\f"}