{"id": "http://arxiv.org/abs/1205.1548v2", "guidislink": true, "updated": "2012-08-01T16:51:58Z", "updated_parsed": [2012, 8, 1, 16, 51, 58, 2, 214, 0], "published": "2012-05-07T21:49:53Z", "published_parsed": [2012, 5, 7, 21, 49, 53, 0, 128, 0], "title": "Thermalization with a chemical potential from AdS spaces", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1205.1099%2C1205.0434%2C1205.4257%2C1205.0296%2C1205.3681%2C1205.0653%2C1205.4033%2C1205.0298%2C1205.3758%2C1205.2679%2C1205.0416%2C1205.2855%2C1205.3033%2C1205.4185%2C1205.1911%2C1205.1970%2C1205.1257%2C1205.3715%2C1205.0888%2C1205.0309%2C1205.3859%2C1205.3427%2C1205.1913%2C1205.1289%2C1205.2201%2C1205.0114%2C1205.0788%2C1205.3789%2C1205.2962%2C1205.1830%2C1205.2009%2C1205.4057%2C1205.4053%2C1205.3081%2C1205.1096%2C1205.3198%2C1205.0451%2C1205.3127%2C1205.1628%2C1205.1828%2C1205.1738%2C1205.2647%2C1205.0718%2C1205.1763%2C1205.0706%2C1205.3534%2C1205.2970%2C1205.0466%2C1205.2321%2C1205.1004%2C1205.0072%2C1205.4139%2C1205.0908%2C1205.2745%2C1205.0633%2C1205.1044%2C1205.4030%2C1205.1509%2C1205.4022%2C1205.1350%2C1205.0886%2C1205.2200%2C1205.3586%2C1205.1706%2C1205.1718%2C1205.3340%2C1205.2852%2C1205.2583%2C1205.3236%2C1205.1281%2C1205.3013%2C1205.4067%2C1205.1380%2C1205.0574%2C1205.3346%2C1205.3490%2C1205.2096%2C1205.1662%2C1205.0723%2C1205.2118%2C1205.2273%2C1205.3915%2C1205.3971%2C1205.3961%2C1205.1849%2C1205.3341%2C1205.2274%2C1205.1713%2C1205.2199%2C1205.2332%2C1205.1244%2C1205.2944%2C1205.1787%2C1205.2964%2C1205.3509%2C1205.1548%2C1205.1491%2C1205.1561%2C1205.1147%2C1205.1770%2C1205.4050&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Thermalization with a chemical potential from AdS spaces"}, "summary": "The time-scale of thermalization in holographic dual models with a chemical\npotential in diverse number of dimensions is systematically investigated using\nthe gauge/gravity duality. We consider a model with a thin-shell of charged\ndust collapsing from the boundary toward the bulk interior of asymptotically\nanti-de Sitter (AdS) spaces. In the outer region there is a\nReissner-Nordstr\\\"om-AdS black hole (RNAdS-BH), while in the inner region there\nis an anti-de Sitter space. We consider renormalized geodesic lengths and\nminimal area surfaces as probes of thermalization, which in the dual quantum\nfield theory (QFT) correspond to two-point functions and expectation values of\nWilson loops, respectively. We show how the behavior of these extensive probes\nchanges for charged black holes in comparison with Schwarzschild-AdS black\nholes (AdS-BH), for different values of the black hole mass and charge. The\nfull range of values of the chemical potential over temperature ratio in the\ndual QFT is investigated. In all cases, the structure of the thermalization\ncurves shares similar features with those obtained from the AdS-BH. On the\nother hand, there is an important difference in comparison with the AdS-BH: the\nthermalization times obtained from the renormalized geodesic lengths and the\nminimal area surfaces are larger for the RNAdS-BH, and they increase as the\nblack hole charge increases.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1205.1099%2C1205.0434%2C1205.4257%2C1205.0296%2C1205.3681%2C1205.0653%2C1205.4033%2C1205.0298%2C1205.3758%2C1205.2679%2C1205.0416%2C1205.2855%2C1205.3033%2C1205.4185%2C1205.1911%2C1205.1970%2C1205.1257%2C1205.3715%2C1205.0888%2C1205.0309%2C1205.3859%2C1205.3427%2C1205.1913%2C1205.1289%2C1205.2201%2C1205.0114%2C1205.0788%2C1205.3789%2C1205.2962%2C1205.1830%2C1205.2009%2C1205.4057%2C1205.4053%2C1205.3081%2C1205.1096%2C1205.3198%2C1205.0451%2C1205.3127%2C1205.1628%2C1205.1828%2C1205.1738%2C1205.2647%2C1205.0718%2C1205.1763%2C1205.0706%2C1205.3534%2C1205.2970%2C1205.0466%2C1205.2321%2C1205.1004%2C1205.0072%2C1205.4139%2C1205.0908%2C1205.2745%2C1205.0633%2C1205.1044%2C1205.4030%2C1205.1509%2C1205.4022%2C1205.1350%2C1205.0886%2C1205.2200%2C1205.3586%2C1205.1706%2C1205.1718%2C1205.3340%2C1205.2852%2C1205.2583%2C1205.3236%2C1205.1281%2C1205.3013%2C1205.4067%2C1205.1380%2C1205.0574%2C1205.3346%2C1205.3490%2C1205.2096%2C1205.1662%2C1205.0723%2C1205.2118%2C1205.2273%2C1205.3915%2C1205.3971%2C1205.3961%2C1205.1849%2C1205.3341%2C1205.2274%2C1205.1713%2C1205.2199%2C1205.2332%2C1205.1244%2C1205.2944%2C1205.1787%2C1205.2964%2C1205.3509%2C1205.1548%2C1205.1491%2C1205.1561%2C1205.1147%2C1205.1770%2C1205.4050&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The time-scale of thermalization in holographic dual models with a chemical\npotential in diverse number of dimensions is systematically investigated using\nthe gauge/gravity duality. We consider a model with a thin-shell of charged\ndust collapsing from the boundary toward the bulk interior of asymptotically\nanti-de Sitter (AdS) spaces. In the outer region there is a\nReissner-Nordstr\\\"om-AdS black hole (RNAdS-BH), while in the inner region there\nis an anti-de Sitter space. We consider renormalized geodesic lengths and\nminimal area surfaces as probes of thermalization, which in the dual quantum\nfield theory (QFT) correspond to two-point functions and expectation values of\nWilson loops, respectively. We show how the behavior of these extensive probes\nchanges for charged black holes in comparison with Schwarzschild-AdS black\nholes (AdS-BH), for different values of the black hole mass and charge. The\nfull range of values of the chemical potential over temperature ratio in the\ndual QFT is investigated. In all cases, the structure of the thermalization\ncurves shares similar features with those obtained from the AdS-BH. On the\nother hand, there is an important difference in comparison with the AdS-BH: the\nthermalization times obtained from the renormalized geodesic lengths and the\nminimal area surfaces are larger for the RNAdS-BH, and they increase as the\nblack hole charge increases."}, "authors": ["Damian Galante", "Martin Schvellinger"], "author_detail": {"name": "Martin Schvellinger"}, "author": "Martin Schvellinger", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/JHEP07(2012)096", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1205.1548v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1205.1548v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "32 pages, 4 figures, references added, appendix added, typos\n  corrected", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1205.1548v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1205.1548v2", "journal_reference": "JHEP 1207 (2012) 096", "doi": "10.1007/JHEP07(2012)096", "fulltext": "Thermalization with a chemical potential from AdS\nspaces\n\narXiv:1205.1548v2 [hep-th] 1 Aug 2012\n\nDamián Galante1 and Martin Schvellinger2\nIFLP-CCT-La Plata, CONICET and\nDepartamento de Fı́sica, Universidad Nacional de La Plata.\nCalle 49 y 115, C.C. 67, (1900) La Plata,\nBuenos Aires, Argentina.\n\nAbstract\nThe time-scale of thermalization in holographic dual models with a chemical potential in\ndiverse number of dimensions is systematically investigated using the gauge/gravity duality.\nWe consider a model with a thin-shell of charged dust collapsing from the boundary toward\nthe bulk interior of asymptotically anti-de Sitter (AdS) spaces. In the outer region there\nis a Reissner-Nordström-AdS black hole (RNAdS-BH), while in the inner region there is an\nanti-de Sitter space. We consider renormalized geodesic lengths and minimal area surfaces\nas probes of thermalization, which in the dual quantum field theory (QFT) correspond to\ntwo-point functions and expectation values of Wilson loops, respectively. We show how\nthe behavior of these extensive probes changes for charged black holes in comparison with\nSchwarzschild-AdS black holes (AdS-BH), for different values of the black hole mass and\ncharge. The full range of values of the chemical potential over temperature ratio in the\ndual QFT is investigated. In all cases, the structure of the thermalization curves shares\nsimilar features with those obtained from the AdS-BH. On the other hand, there is an\nimportant difference in comparison with the AdS-BH: the thermalization times obtained\nfrom the renormalized geodesic lengths and the minimal area surfaces are larger for the\nRNAdS-BH, and they increase as the black hole charge increases.\n\n1\n2\n\ndagalante@gmail.com\nmartin@fisica.unlp.edu.ar\n\n\fContents\n1 Introduction\n\n2\n\n2 A model of holographic thermalization at strong coupling\n\n5\n\n3 The Reissner-Nordström-AdS black hole\n\n9\n\n4 Holographic thermalization with a chemical\n4.1 Renormalized geodesic lengths . . . . . . . .\n4.2 Minimal area surfaces . . . . . . . . . . . . .\n4.3 Evolution of thermalization probes . . . . .\n5 Discussion\n\npotential\n. . . . . . . . . . . . . . . . . .\n. . . . . . . . . . . . . . . . . .\n. . . . . . . . . . . . . . . . . .\n\n12\n13\n15\n18\n19\n\nA On null vectors and energy conditions of the RN-AdS-Vaidya type metric 26\n\n1\n\n\f1\n\nIntroduction\n\nQuark gluon plasma (QGP) has become a subject of considerable interest after the results\nfrom RHIC and LHC experiments of heavy ion collisions, from where it is possible to draw\nthe conclusion that the system behaves like an ideal fluid with a small shear viscosity over\nentropy density ratio (η/s) [1, 2, 3]. The crucial outcome is that the QGP is a strongly\ncoupled system. Theoretical calculations assume that the system is in thermal equilibrium,\nand it is probed at momentum scales below the equilibrium temperature T , i.e. in the\nhydrodynamical regime of the plasma. A suitable approach to the dynamical description\nof strongly coupled systems is based on the AdS/CFT correspondence [4, 5, 6]. In this\ncontext, many investigations have been carried out after the seminal paper by Policastro,\nSon and Starinets, where they proposed a relation between the shear viscosity of the finitetemperature N = 4 supersymmetric SU(N) Yang-Mills (SYM) theory plasma, in the large\nN limit, at strong-coupling regime, and the absorption cross section of low-energy gravitons\nby a near-extremal black three-brane [7]. The N = 4 SYM theory at finite temperature\n(just above the deconfinement transition temperature Tc ) in the large N limit, qualitatively\nbehaves like the strongly coupled QGP. This statement is based on a number of lattice\nQFT computations (for a recent review see [8]). The results of [7] were obtained within the\nsupergravity limit. The first leading order string theory corrections to η/s of strongly coupled\nSYM plasmas have been computed in [9]. On the other hand, electrical charge transport\nproperties of strongly coupled SYM plasmas have been thoroughly studied as well. These\ninclude the electrical conductivity, which was firstly computed in [10] within the supergravity\nlimit, while its string theory corrections were obtained in [11, 12]. The first computation of\nphotoemission rates in this context was done in [13] and their corresponding leading order\nstring theory corrections were obtained in [14].\nThe way in which the actual heavy ion collision process is understood involves four basic\nstages. It begins with the approach regime, where two heavy ions move toward each other\nat relativistic velocities, with kinetic energies typically about 100 GeV/nucleon. Soon after,\nonce the heavy ions collide, a part of their kinetic energies transforms into intense heat and\nthe plasma of quarks and gluons starts forming. This is the thermalization process. After\nthat, the strongly coupled QGP is formed, and here is where the hydrodynamical description\nholds. Elliptic flow has been observed in this regime, and it has been concluded that the\nsystem behaves like an ideal fluid, i.e. with very low η/s. At the end, the system expands\nand cools down, leading to the hadronization process. Since QGP in thermal equilibrium\nis strongly coupled, in principle, it is possible that the thermalization described above also\noccurs within a strongly coupled regime of QCD. Regardless of whether or not this hypothesis\nholds, it is very interesting to think about the thermalization of a strongly coupled system.\nIn fact, in a series of papers the issue has been studied considering the collapse of a thin shell\nof matter, by using an AdS-Vaidya type metric [15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26,\n\n2\n\n\f27]. Earlier studies of holographic thermalization described as a dual process of black hole\nformation have been presented in references [28, 29, 30, 31, 32, 33, 34, 35].\nIn a more realistic physical situation one should also consider the chemical potential, μ.\nThus, it is very interesting to study the effect of the chemical potential on the thermalization\ntime scale. This can be qualitatively modeled by a collapsing thin shell of charged matter,\nleading to a thermal equilibrium configuration given by a Reissner-Nordström-AdS black\nhole. In this paper we carry out a detailed systematic investigation, exploring the full range of\nthe chemical potential/equilibrium temperature ratio, μ/T , in diverse number of dimensions,\nfor both renormalized geodesic lengths and minimal area surfaces. In a real QGP the ratio\nμ/T is about 0.15 or less, thus the chemical potential effects will be limited [36, 37, 38, 39, 40].\nFor instance, at supergravity level, η/s remains the same with finite chemical potential.\nHowever, it is interesting to consider the effect of the chemical potential on the thermalization\ntime scale for different holographic probes, mainly to be able to investigate the behavior of\na collapsing shell of charged matter in AdS spaces. This may have applications to other\nphysical systems beyond the context of SYM plasmas, such as certain condensed matter\nsystems in two and three dimensions. We would like to emphasize that although the main\nmotivation for the present work has been to consider thermalization of QGPs, which concerns\nRNAdS5 black holes, the systematic exploration extended to lower and higher dimensions\npresented here would perhaps motivate further studies from the AdS/CMT perspective (for 3\nand 4 dimensional backgrounds) as well as higher dimensional dual QFTs (corresponding to\n6 and 7 dimensional backgrounds). It certainly will be of interest to investigate whether these\neffective backgrounds can be lifted to ten-dimensional string theory or eleven-dimensional\nM-theory descriptions, or at least to understand the difficulties to do it.\nIn section 2 we describe a model of holographic thermalization at strong coupling using\ntwo types of extensive geometric probes which are dual to two-point functions of QFT gauge\ninvariant local operators and expectation values of rectangular Wilson loops. In section 3\nwe will describe the Reissner-Nordström-AdS black hole in arbitrary number of dimensions.\nThere is an important reason to carry out a systematic study in different dimensions, which\nis the fact that the probes of thermalization such as renormalized geodesic lengths and\nminimal area surfaces are one- and two-dimensional geometric objects, respectively. Thus,\nby increasing the number of background spacetime dimensions, it allows to explore the\nability of these extended objects to probe additional bulk degrees of freedom. This effect\nis significant as we will show from the figures introduced in the last section of the paper.\nWe will introduce a time-dependent AdS-Vaidya type metric, including charged matter in\nthe collapsing shell. This is essential for the present study of thermalization, and with it\nwe will study thermalization of two-point functions of gauge invariant local operators in\nthe dual conformal field theory (CFT), as well as rectangular Wilson loops, in the whole\nrange 0 ≤ μ/T ≤ ∞. This is done for QFTs in 3, 4, 5 and 6 dimensions. In the case\nof AdS3 /CFT2 duality there are charged extensions of the BTZ black hole [41], however\n3\n\n\fthese are special cases that we shall not discuss here. Our results show that the effect\nof introducing chemical potential produces a delay in the thermalization time of the dual\nstrongly coupled system. This effect indeed becomes more evident as the size of geometric\nprobe increases. Our results are consistent with a top-down thermalization process, which\nwas already observed in previous computations with no chemical potential [19, 18, 20], and is\ninherent to a strongly coupled computation. Thus, as it happens for the AdS-BH case, in the\nRNAdS-BH geometry UV modes thermalize first. This is a natural consequence of the setup\nof a collapsing thin shell, since smaller geodesics and smaller minimal area surfaces dual to\nWilson loops thermalize before the corresponding larger probes do. It would be interesting to\nconsider fat collapsing shells and see whether the top-down thermalization persists. Another\nobservation from this systematic analysis is that, for sufficiently large probes, a swallow-tail\nlike pattern appears in the thermalization curves, both for renormalized geodesic lengths\nand minimal area surfaces. This is a known effect in systems with two different relevant\nscales. We shall discuss about the relevance of these scales. On the other hand, this pattern\ncould possibly be a consequence of a numerical artifact due to the fact that numerically\nwe never have a shell with zero thickness. In addition, the swallow tails could appear from\nthe breakdown to the probe approximation near the horizon, as it happens in top-down\nmodels when considering extremal probes instead of fundamental string probes including\nthe thermalization of the string degrees of freedom [42]. After a detailed numerical analysis\nour conclusion is that the swallow tails are due to the emergence of certain solutions, from\nwhich only one is relevant for thermalization.\nIt is interesting to note the relation between two-point functions and expectation values\nof Wilson loops with the entanglement entropy in AdS3 and AdS4 , respectively. Ryu and\nTakayanagi [43, 44, 45] proposed a way to calculate entanglement entropy holographically by\nconsidering minimal area surfaces in AdS spaces. Thus, by computing geodesics in AdS3 and\nminimal area surfaces in AdS4 , we will also be computing the evolution of the entanglement\nentropy during the thermalization of CFTs in 2 and 3 dimensions, respectively, at finite\ntemperature and finite chemical potential.\nFinally, it is also interesting to note the differences in comparison with previous recent\nworks. For a more complete description of investigations related to scenarios of thermalization of an initial field configuration far from equilibrium see [20] and references therein. In\n[19, 20] it is considered the thermalization from a collapsing shell of pressureless dust leading\nto Schwarzschild-AdS black holes in 3, 4 and 5 dimensions. The thermalization probes in\nthese references are renormalized geodesic lengths, minimal area surfaces and minimal volumes. Then in [17] it is studied the evolution and scaling of the entanglement entropy for a 3\ndimensional field theory using a thermal quench, leading to an asymptotically anti-de Sitter\nSchwarzschild black hole in four dimensions. In addition, they consider an electromagnetic\nquench, which after complete thermalization, renders an extremal dyonic black hole in four\ndimensions. In this reference the entanglement entropy is studied. More recently, in ref4\n\n\ference [24] thermalization following a non-relativistic quench near a quantum critical point\nwith non-trivial dynamical critical exponent has been studied. They consider a collapsing\nshell leading to asymptotically Lifshitz spaces. In our present work we consider all cases for\nAdSd+1 spaces with d =3, 4, 5, and 6, exploring the full range of μ/T , considering different\nvalues of the boundary separation l. We also study the swallow tails emerging from the\nthermalization curves, for renormalized geodesic lengths and minimal area surfaces. We also\nshow explicitly the shape of geodesics corresponding to zero and finite chemical potential,\nfor a given boundary separation l, considering a set of different times. This allows to show\ngraphically the actual shape evolution of the geodesics as the thin shell moves toward the\nbulk interior.\n\n2\n\nA model of holographic thermalization at strong coupling\n\nIn this section we describe a model of holographic thermalization of a strongly coupled CFT\nbased on [19, 20]. We present a Vaidya-type metric where a thin shell of charged pressureless\ndust collapses to form a charged, asymptotically anti-de Sitter black hole. Then, we analyze\ntwo types of QFT operators: two-point functions of local gauge invariant operators and\nexpectation values of rectangular Wilson loops, that will be used in the next sections as\nprobes of holographic thermalization.\nWe will generalize the Vaidya metric, which was originally introduced by P.C. Vaidya in\n1943 in order to study how the geometry of spacetime evolves in the presence of a massive\nstar, which varies its mass due to the effect of radiation [46, 47]. In the present case, we\nconsider d + 1-dimensional metrics that are asymptotically AdSd+1 . Thus\n\u0003\n1 \u0002\n(1)\nds2 = 2 −f (v, z)dv 2 − 2dz dv + dx2 ,\nz\nwhere f (v, z) can be an arbitrary function of v and z which approaches 1 as z goes to zero.\nThe AdS radius, R, has been set to 1. The z-coordinate is the inverse of the radial coordinate,\nz = R2 /r, so the AdS boundary is at z = 0. In addition, x stands for coordinates at the\nboundary except the time, x = (x1 , * * * , xd−1 ). In particular, if we choose f (v, z) = 1−m(v)z d\nwe will be considering a shell (with no charge) that collapses to form a Schwarzschild-AdS\nblack hole. Moreover, we can extend this geometry to include charge by defining\nfRN (z, v) = 1 − m(v)z d + q(v)2 z 2d−2 ,\n\n(2)\n\nwhere the subindex stands for Reissner-Nordström black hole and the expression holds for\nd ≥ 3.\nThis type of metric is a solution of the equations of motion of the action\nSRN −V aidya = SEM AdS + Sext ,\n5\n\n(3)\n\n\fwhere SEM AdS is the Einstein-Maxwell anti-de Sitter action\nZ\n\u0002\n\u0003\n1\nd+1 √\n2\nd\nx\nSEM AdS = −\n−g\nR\n−\nF\n+\nd(d\n−\n1)\n,\n16πG(d+1)\n\n(4)\n\nand Sext is an external\nwhere the negative cosmological constant is defined as Λ = − d(d−1)\n2\naction, whose energy-momentum tensor and current will be specified below.\nFrom this action the resulting equations of motion are\n1\n(ext)\nRμν − gμν (R − 2Λ − F 2 ) − 2Fμλ Fνλ = 8πG(d+1) Tμν\n,\n2\n\u0001\n√\n1\nσ\n√ ∂ρ\n−gF ρσ = 8πG(d+1) J(ext)\n.\n−g\n\n(5)\n(6)\n\nThe AdS-Vaidya type metric presented in Eqs.(1) and (2), together with an electromagnetic potential defined as\n1\nAμ = − q(v)z d−2 δμv ,\nc\nwith c =\nare\n\nq\n\n2(d−2)\n,\nd−1\n\n8πG\n\n(7)\n\nsatisfy the above equations of motion provided that the external currents\n\n(d+1)\n\n(ext)\nTμν\n\nd−1\n\n= z\nr\n\nσ\n8πG(d+1) J(ext)\n=\n\n\u0012\n\n\u0013\n(d − 1)\nd−2\nṁ(v) − (d − 1)z q(v)q̇(v) δμv δνv ,\n2\n\n(d − 1)(d − 2) d+1\nz q̇(v)δ σz ,\n2\n\n(8)\n(9)\n\nwhere the dot stands for derivative with respect to coordinate v. Note that in the chargeless\ncase, the energy-momentum tensor only depends on ṁ(v) so it is immediate to check that\nthe null energy conditions are satisfied provided that m(v) is non-decreasing function of v.\nThe charged case is more subtle since it depends on the specific choice of both m(v) and\nq(v).\nThe functions m(v) and q(v) model the change in the mass and charge of the black hole.\nIn particular, if both m(v) = M and q(v) = Q are constants, then v is the usual EddingtonFinkelstein coordinate,\ndv = dt −\n\ndz\n,\n1 − M z d + Q2 z 2d−2\n\n(10)\n\nwhere t is the time. If we rewrite the metric in terms of t and z, then the AdS-Vaidya type\nmetric corresponds to a charged black-brane type geometry,\n\u0015\n\u0014\ndz 2\n1\nd\n2 2d−2\n2\n2\n2\n(11)\n)dt +\n+ dx .\nds = 2 −(1 − Mz + Q z\nz\n1 − M z d + Q2 z 2d−2\n6\n\n\fAgain, for Q = 0, we obtain a black-brane solution with an event horizon at rh = 1/zh =\nM 1/d .\nOn the other hand, if m(v) = q(v) = 0 the change of variables becomes dv = dt−dz, being\nthe metric the usual AdSd+1 one. Thus, if we choose m(v) = M θ(v) and q(v) = Q θ(v), with\nθ being the step function, we obtain a spacetime separated into two regions by a shell: for\nv < 0 it is an AdSd+1 spacetime, otherwise it will be a Reissner-Nordström-AdS black hole.\nAt v = 0 we have a shell of zero thickness. Since we will carry out a numerical study it is\nconvenient to consider smooth functions like\n\u0012\n\u0013\nM\nv\nm(v) =\n1 + tanh\n,\n(12)\n2\nv0\n\u0012\n\u0013\nv\nQ\n1 + tanh\n,\n(13)\nq(v) =\n2\nv0\nwhere v0 represents a finite shell thickness. In the limit v0 → 0 we recover the step function\nthat represents a shock wave. In this limit case the null energy conditions are also satisfied,\nwhile in the finite thickness case the analysis has to be done with some care (see Appendix\nfor a complete discussion on this).\nOnce we have a metric to model the rapid injection of energy that initiates the thermalization process on the dual QFT, we have to choose a set of extended observables in the bulk\nwhich allow to evaluate the evolution of the system. The initial condition is that the spacetime is AdSd+1 . Then, after certain time elapses, the system reaches the thermodynamical\nequilibrium, and the bulk becomes a Reissner-Nordström-AdS black hole. A RNAdS-Vaidya\ntype metric interpolates between these two spaces, describing the time evolution of the system. In order to follow this evolution we have to probe the bulk by using extended geometric\nobjects, which should be computed before and after the system reaches the thermodynamical\nequilibrium. However, it is easy to imagine that not any observable can be used as a probe\nof thermalization. One may ask what happens with the expectation values of one-point\nfunctions of gauge invariant operators, such as the energy-momentum tensor for instance.\nThe problem is that these are local operators and, therefore, cannot give information on the\nthermalization process. So, clearly one needs to consider extended probes. A possibility is\nto study correlation functions of two local gauge invariant operators on the field theory side.\nThe AdS/CFT correspondence allows to understand intuitively why the expectation values of local quantum field theory operators are insensible to the details of the thermalization.\nThese observables can only account for effects due to bulk properties close to the AdS boundary, thus they do not allow to probe details from distances of the order of the thermal scale of\nthe system. On the other hand, two-point functions of local gauge invariant QFT operators\nprobe the bulk interior. Indeed, the AdS/CFT correspondence provides an elegant geometric\nway to compute two-point functions: under certain approximations the two-point functions\ncorrespond to geodesics which connect the two points where the local QFT operators are\n7\n\n\finserted at the AdS boundary. These geodesics extend toward the bulk, thus allowing to\nprobe a larger range of energies from the boundary field theory perspective. There are also\nother operators which are useful for the present problem: expectation values of Wilson loops\nwhich correspond to minimal area surfaces in the AdS bulk, as well as the entanglement\nentropy which is related to minimal volumes.\nFollowing [20] we first consider two-point functions of local gauge invariant QFT operators\nat constant time as probes of thermalization. In general Wightman functions are defined as\n[19, 20]\n′\n′\n′\n′\nG>\n(14)\nO (t, x; t , x ) =< O(t, x)O(t , x ) > ,\nwhere O is a local gauge invariant QFT operator of conformal dimension ∆. In order to\nfollow the evolution of these functions we are interested in the equal time (t = t′ ) correlators.\nThen, we want to see how these functions vary at different times. When we consider strongly\ncoupled QFTs these functions can only be computed analytically for dimension two. For\nhigher dimensions the analytical treatment is unknown.\nFortunately, the AdS/CFT correspondence allows to evaluate these functions when the\noperators are heavy by using geodesics in AdS spaces. As it is well-known from the AdS/CFT\ndictionary a scalar field φ(z, t, x) with mass\n√ m in d + 1 dimensions is dual to an operator O\n1\nwhose conformal dimension is ∆ = 2 (d + d2 + m2 ). In general, the two-point function (14)\nin the strongly coupled regime is computed using the classical supergravity action in terms\nof φ. However, for our purpose it will be more convenient to compute it from a path integral\nas in reference [48, 20]\nZ\nX\n′\n< O(t, x)O(t, x ) >= DPei∆L(P) ≈\ne−∆L ,\n(15)\ngeodesics\nwhere the path integral includes all possible paths connecting the points at the AdS boundary,\ni.e. (t, x) and (t, x′ ). In addition, L(P) is the proper length corresponding to this path.\nFor space-like trajectories L(P) is imaginary. Thus, it is possible to make a saddle-point\napproximation for ∆ ≫ 1. Therefore, only trajectories with extreme geodesic lengths will\ncontribute. Notice that in the last term L indicates actual length of the geodesic between\nthe points at the AdS boundary. In this way, there is a direct relation between the logarithm\nof the equal-time two-point function and the geodesic length between these two points. It is\nimportant to be careful while considering these approximations because the geodesic length\ndiverges due to the AdS boundary contributions. Then, one can define a renormalized\ndistance δL ≡ L − 2 ln(2/z0 ), in terms of the cut-off z0 . This suppresses the divergent part\nin the pure AdS.\nThe other type of non-local operators that we will be using are spatial Wilson loops, which\nare non-local gauge invariant operators in the field theory defined as the integral in a closed\n\n8\n\n\fpath C of the gauge field\n\u0010 H \u0011\n1\nW (C) = T r Pe C A ,\n(16)\nN\nwhere P means ordered product, N is the number of colors of the gauge theory, and Aμ is\nthe non-Abelian gauge field. Wilson loops provide information about the non-perturbative\nbehavior of gauge theories, however, in general it is difficult to compute them. Using the\nAdS/CFT correspondence its computation can be done in an elegant way. The expectation\nvalue of a Wilson loop is related to the string theory partition function with a world sheet Σ\nextended on the interior of the bulk, and ending on the closed contour C on the boundary,\nZ\n< W (C) >= DΣe−Λ(Σ) ,\n(17)\nwhere one has to integrate over all the non-equivalent surfaces whose boundary is ∂Σ = C,\nat the AdS boundary. Λ(Σ) is the string action. In the strong coupling regime we can carry\nout a saddle-point approximation of the string theory partition function. In this way we can\nreduce the computation of the expectation value of a Wilson loop to determine the surface\nof minimal area of the classical world-sheet whose boundary is C. Thus, can write\n1\n\n< W (C) >≃ e− α′ A(Σ0 ) ,\n\n(18)\n\nwhere A(Σ0 ) represents the area of the minimal surface. This will be a solution to the\nequations of motion of the bosonic part of the string action [52, 53].\nThese models based on the AdS/CFT correspondence allow to understand intuitively how\nthe thermalization process takes place. Let us consider the sudden injection of energy in the\ndual QFT. The bulk geometry associated with this process is proposed to be described by a\ncollapsing shell from the boundary toward the bulk interior. As long as the shell collapses,\nthe outer region is described by a Reissner-Nordström-AdS black hole, while the inner region\nis still an AdS space. Now, let us use the geodesic approximation to compute the equal-time\ntwo-point functions. If the separation of the boundary points is small enough, then the\ngeodesic cannot reach the shell at v = 0 and, therefore, the geodesic is seen as a purely\nRNAdS-BH geodesic, i.e. for short distances in the field theory the system seems to be in\nthermal equilibrium. If we increase the separation between the insertion of the boundary\noperators, at some point, the geodesic will cross the shell, and there will be a geodesic\nrefraction which will deviate the geodesic in comparison with the thermal one. Thus, we\ncan understand why the thermalization proceeds from short to long distances, i.e. QFT\nultraviolet degrees of freedom thermalize first [20].\n\n3\n\nThe Reissner-Nordström-AdS black hole\n\nLet us now consider the pure Einstein-Maxwell anti-de Sitter action (with no external fields)\nwhich describes a d + 1-dimensional space-time, with negative cosmological constant Λ =\n9\n\n\f, coupled to an Abelian gauge field AM , with M = 0, * * *, d [49, 50]\n− d(d−1)\n2R2\n\u0015\n\u0014\nZ\n1\nd(d − 1)\nd+1 √\n2\nSEM AdS = −\nd x −g R − F +\n.\n16πGd+1\nR2\n\n(19)\n\nThis action has been introduced in Section 2, however here we recover the AdS radius R.\nThe solution to the equations of motion derived from the above action leads to the ReissnerNordström-AdS black hole metric, which can be written in static coordinates as\nds2 = −V (r)dt2 +\n\ndr 2\n+ r 2 dΩ2d−1 ,\nV (r)\n\n(20)\n\nwhere dΩ2d−1 is the metric on the sphere S d−1 , and\nV (r) = 1 +\n\nr2\nM\nQ2\n−\n+\n.\nR2 r d−2 r 2d−4\n\n(21)\n\nIn this metric M and Q are related to the ADM black hole mass M̄ and the Q̄ charge [51]\nas follows\n(d − 1)ωd−1\nM,\n16πG\n\u0010ω \u0011\np\nd−1\nQ̄ =\nQ,\n2(d − 1)(d − 2)\n8πG\n\nM̄ =\n\n(22)\n(23)\n\nwhere ωd−1 is the volume of the unit radius sphere S d−1 . Also, there is a pure electrical\ngauge potential given by\n\u0013\n\u0012\n1 Q\n(24)\nA = − d−2 + Φ dt ,\ncr\nq\n, while Φ is a constant which plays the role of the electrostatic potential in\nwhere c = 2(d−2)\nd−1\nthe region between the event horizon and the boundary of the asymptotic AdS. It is defined\nsuch that At (rh ) = 0. Thus,\nΦ=\n\n1 Q\n.\nc rhd−2\n\n(25)\n\nFollowing [49] we can consider the limit where the boundary of AdSd+1 is Rd instead of\nR ×S d−1 , the so-called infinite volume limit, which is important for the dual field theory\ndiscussion. This relays upon the presence of a negative cosmological constant. This limit can\nbe obtained by introducing a dimensionless parameter λ, and set for the radial coordinate\nr → λ1/d r, for time coordinate t → λ−1/d t, for the mass and charge m → λm and q →\n10\n\n\fλ(d−1)/d q, respectively, and for S d−1 we set R2 dΩ2d−1 → λ−2/d\nthe limit λ → ∞, the metric becomes\n\nPd−1\n\nd−1\nr2 X 2\ndr 2\n+\ndx ,\nds = −U(r)dt +\nU(r) R2 i=1 i\n2\n\n2\n\ni=1\n\ndx2i . Then, if we consider\n\n(26)\n\nwhere\nU(r) =\n\nr2\nM\nQ2\n−\n+\n.\nR2 r d−2 r 2d−4\n\n(27)\n\nNotice that replacing r by 1/z (setting R = 1) in Eqs.(26) and (27) we obtain Eq.(11).\nUsing the gauge/gravity duality dictionary the Hawking temperature corresponding to a\nblack hole is assumed to be the equilibrium temperature of the dual QFT. For the RNAdSBH metric the temperature is given by\nβRN =\n\n1\nTRN\n\n=\n\n4πR2\ndrh −\n\n(d−2)Q2 R2\n2d−3\nrh\n\n,\n\n(28)\n\nin terms of the black hole event horizon rh and its charge parameter Q. This expression\nresults from the usual procedure of demanding regularity at the event horizon of the Eu2\n, being the\nclidean continuation of the metric. When Q = 0 this equation leads to β = 4πR\ndrh\nwell-known Hawking temperature in the AdS-BH case. Then, for instance, setting d = 4 it\nreduces to the Hawking temperature of the Reissner-Nordström AdS5 black hole [40],\nβRN =\n\n1\nTRN\n\n=\n\nπR2\nrh (1 −\n\nQ2 R2\n6 )\n2rh\n\n.\n\n(29)\n\nWe can also consider the black hole mass parameter in terms of the radius of the event\nhorizon\nM=\n\nQ2\nrhd\n.\n+\nR2 rhd−2\n\n(30)\n\nWe should notice that the RNAdS black hole has an extremal solution corresponding to\nT = 0. However, it nevertheless has an event horizon. This can be seen from Eq.(28), leading\nto\n\u0013 1\n\u0012\n(d − 2) 2 2 2d−2\nQR\nrh |ext =\n.\n(31)\nd\nThis is a remarkable difference with respect to the Schwarzschild-AdS case, where the extremal solution corresponds to an anti-de Sitter spacetime. Another important difference\n11\n\n\fis that from the AdS/CFT correspondence it is possible to understand the electromagnetic\nfield in this geometry as a source of the chemical potential in the dual quantum field theory. However, the precise relation is somehow subtle since the chemical potential has energy\nunits in the dual field theory ([μ] = 1/[L]) [40]. On the other hand, Aμ as defined in the\naction (19) is dimensionless, thus one has to redefine this field as Āμ = Aμ /R∗ , where R∗\nis a scale with length units. Therefore, Ā and μ have the same units. The only effect of\nthis field redefinition is to change the Maxwell term in the action, changing the coupling as\ngY2 M = 4πG/R∗2. This is useful now because in this way we can obtain the chemical potential\nin the QFT as the boundary value of the time component of the bulk gauge field. Thus, we\nobtain\nμ = lim Āt =\nr→∞\n\n1 Q\nΦ\n=\n.\nR∗\nc rhd−2 R∗\n\n(32)\n\nTherefore, the black hole charge is related to the chemical potential in the gauge theory. R∗\ndepends on the particular compactification, whenever the solution could be obtained from\nstring theory or M-theory. Besides the specific value of R∗ , it is possible to study the whole\nrange of values of μ/T given by\n4π R2 Q\nμ\n\u0010\n\u0011.\n=\n(d−2)Q2 R2\nd−1\nT\nc R∗ d rh − rd−1\n\n(33)\n\nh\n\nThus, if the radius of the event horizon rh is kept fixed, then Eqs.(31) and (32) show that it\nis possible to go from μ/T = 0, for Q = 0, to the extremal case, where μ/T → ∞, provided\nthat Q satisfies Eq.(31). Recall that the mass is given by Eq.(30).\n\n4\n\nHolographic thermalization with a chemical potential\n\nIn this section we consider how the thermalization process occurs within the model described\nhere. For this purpose we will study two-point functions of local gauge invariant operators\nand expectation values of rectangular Wilson loops in the dual conformal field theory. The\nformer ones correspond to geodesic lengths in the bulk theory, while the second ones correspond to minimal area surfaces in the bulk. The idea is that we start from an anti-de\nSitter spacetime of dimension d + 1. This is the holographic dual of the strongly coupled\nregime of a conformal field theory at zero temperature and zero chemical potential. Then,\nwe consider a thin shell of charged dust propagating from the boundary toward the bulk interior, and collapsing, leading to a RNAdS black hole. From the dual QFT point of view this\ncorresponds to a sudden injection of energy and matter, both modeled through holographic\nquenches, such that whenever the thermodynamical equilibrium is reached, the system will\n12\n\n\fbe described within the grand canonical ensemble. As the thin shell of charged matter collapses in the bulk, it separates two regions. The outer one is a Reissner-Nordström black\nhole which is asymptotically AdS. The inner region is just an AdS spacetime.\nThis situation is described by a dynamical metric, which is the RNAdS Vaidya type metric\ngiven in Eqs.(1) and (2), using the functional forms of the mass and charge of Eqs.(12) and\n(13). The conjecture is that from the holographic dual field theory this dynamical situation\ncorresponds to the thermalization process of a strongly coupled system. We will see that the\nholographic thermalization is a top-down process in the sense that UV degrees of freedom\nequilibrate first.\nNow, we can actually calculate the geodesic length and the minimal area surface of the\nstring attached to the boundary, as probes of thermalization for this geometry.\n\n4.1\n\nRenormalized geodesic lengths\n\nWe will be evaluating geodesic distances as function of both time and boundary separation\nlength, in arbitrary number of spacetime dimensions. We will consider space-like geodesics\nbetween points (t, x1 ) = (t0 , −l/2) and (t′ , x′1 ) = (t0 , l/2) in the case of AdS3 /CFT2 , where l\nis the separation of the AdS boundary points. For d = 3, 4, 5, 6, the orthogonal coordinates\nare fixed. For instance, for d = 4 we have (x2 , x3 ) = (x′2 , x′3 ). Thus, we take as the geodesic\nparameter the first coordinate x1 , which, in order to make simpler the notation, we rename\nas x. The solutions to the geodesic equations are given by the functions v(x) and z(x).\nInserting a cut-off z0 close to the AdS boundary, the boundary conditions become\nz(−l/2) = z0 ,\n\nz(l/2) = z0 ,\n\nv(−l/2) = t0 ,\n\nv(l/2) = t0 .\n\n(34)\n\nAlso, v(x) and z(x) are symmetric under reflection x → −x. The geodesic length is defined\nas\nZ l/2 p\nZ √\n1 − 2z ′ (x)v ′ (x) − fRN (v, z)v ′ (x)2\n,\n(35)\n−ds2 =\ndx\nL=\nz(x)\n−l/2\nwhere fRN (v, z) was defined in Eq.(2). The prime indicates derivative with respect to x. The\nfunctions v(x) and z(x) minimize the geodesic length of Eq.(35), thus the problem is similar\nto the one in classical mechanics with the same Lagrangian. Since the Lagrangian does not\ndepend explicitly on x, there is one conserved quantity, equivalent to the Hamiltonian of the\nsystem. In terms of fRN (v, z) it becomes\nH=\n\n1\nz(x)\n\np\n\n1 − 2z ′ (x)v ′ (x) − fRN (v, z)v ′ (x)2\n\n.\n\n(36)\n\nIntroducing the initial conditions on the tip of the geodesic as\nz(0) = z∗ ,\n\nv(0) = v∗ ,\n13\n\nv ′ (0) = z ′ (0) = 0 ,\n\n(37)\n\n\fthe conservation equation simplifies to\n1 − 2z ′ v ′ − fRN (z, v)v ′2 =\n\n\u0010 z \u00112\n∗\n\nz\n\n.\n\n(38)\n\nThe next step is to compute the equations of motion for v(x) and z(x). Though in principle\nthey have a complex form, it is possible to simplify them by making use of the conservation\nequation. In particular, we can differentiate Eq.(38) with respect to x and obtain a relation\nfor v ′′ (x) and z ′′ (x). Inserting these relations in the equations of motion, we obtain a set of\nsimplified, second order differential equations for v(x) and z(x) as follows\n0 = 2 − 2v ′ (x)2 fRN (v, z) − 4v ′(x)z ′ (x) − 2z(x)v ′′ (x) + z(x)v ′ (x)2 ∂z fRN (v, z) , (39)\nwhich is obtained from the equation of motion for z(x), while\n0 = z(x)v ′′ (x)fRN (v, z) + z(x)z ′′ (x) + z(x)z ′ (x)v ′ (x)∂z fRN (v, z)\n1\n+ z(x)v ′ (x)2 ∂v fRN (v, z) ,\n2\n\n(40)\n\nis obtained from the equation of motion of v(x). From this set of equations (plus the initial\nvalues) we can numerically obtain z(x) and v(x) for each pair of v∗ and z∗ . We can also\nobtain the equations of motion in terms of m and q, just by replacing fRN and its derivatives\ninto Eqs.(39) and (40), leading to\n1\nd z(x)d v ′ (x)2 m(v) − z(x)d v ′ (x)2 m(v) − d z(x)2d−2 v ′ (x)2 q(v)2\n2\n+2z(x)2d−2 v ′ (x)2 q(v)2 + z(x)v ′′ (x) + 2v ′ (x)z ′ (x) + v ′ (x)2 − 1 ,\n(41)\n1\n0 = − z(x)d v ′ (x)2 m′ (v) − z(x)d v ′′ (x)m(v) − d z(x)d−1 v ′ (x)z ′ (x)m(v)\n2\n+z(x)2d−2 v ′ (x)2 q(v)q ′ (v) + z(x)2d−2 v ′′ (x)q(v)2 + 2d z(x)2d−3 v ′ (x)z ′ (x)q(v)2\n0 =\n\n−2z(x)2d−3 v ′ (x)z ′ (x)q(v)2 + v ′′ (x) + z ′′ (x) ,\n\n(42)\n\nwhere the dot stands for partial derivative with respect to v.\nThe advantage of calculating the equations of motion in terms of fRN (v, z) is that they can\nbe easily generalized to any other metric with that form. We can also obtain the equations of\nmotion for the Schwarzschild-AdS case simply by changing fRN (v, z) for f (v, z) = 1−m(v)z d ,\ni.e. setting q(v) = 0. It leads to the equations for geodesic lengths presented in [20], which is\na consistency check for our calculations and it also allows to compare the RNAdS-BH with\nthe Schwarzschild-AdS one.\nAt the end we are interested in evaluating the geodesic length in terms of time t0 and the\nboundary separation l. This information is given by\nz(l/2) = z0 ,\n\nv(l/2) = t0 .\n14\n\n(43)\n\n\fBy using the conservation equation and reflection symmetry we can easily calculate the\non-shell geodesic length as\nL(l, t0 ) = 2\n\nZ\n\nl/2\n\ndx\n\n0\n\nz∗\n,\nz(x)2\n\n(44)\n\nand subtract the divergent part defining δL(l, t0 ) = L(l, t0 ) − 2 ln(2/z0 ).\nThus, we can calculate how the thermalization process occurs by considering a collapsing\nthin shell of charged dust. It is interesting to compare these results with those obtained in\nthe case of a collapsing thin shell of dust with no charge, such as those described in [20].\nIn order to study the thermalization we first have to see the evolution of the geodesics as\nshown in Fig. 1. Thus, we solve the problem for a metric with an event horizon located at\nrh = 1/zh = 1. The difference in comparison with the AdS-BH case is that now we have to\nset a non-vanishing charge/mass ratio. Let us consider Q/M = 1/2. This choice satisfies\nthe restrictions from Eqs.(30) and (31). From Fig. 1 we can see and compare the evolution\nof geodesics with both a thin shell of charged and uncharged matter for d = 4. In both\nsystems there is a similar behavior. For short times the geodesics do not change with respect\nto the pure AdS space. On the other hand, starting from t0 ∼ 0.8, in this configuration\nwith operator boundary separation l = 2.6, differences between the charged and uncharged\nsystems become apparent. Notice that within the range 0.8 < t0 ≤ 1 geodesics in both\nsystems change abruptly before both systems reach the thermodynamical equilibrium. Although this process is the same for the RNAdS-BH case, the actual evolution of the probes\nis different. Indeed, we notice differences which render the charged system to have a slightly\nlarger thermalization time in comparison with the system at zero chemical potential.\n\n4.2\n\nMinimal area surfaces\n\nWe now focus on the thermalization of expectation values of rectangular Wilson loops. Proceeding in a similar way as for the geodesic lengths, now we consider the computation of the\nminimal area surfaces as described before. Using the AdS-Vaidya type metric, the NambuGoto action becomes,\np\nZ\n1 − fRN (v, z)v ′2 − 2z ′ v ′\nR l/2\ndx\n.\n(45)\nAN G (t0 , l, R) =\n2π −l/2\nz2\nWe are considering boundary rectangles parametrized by the coordinates (x1 , x2 ). The\nrest of the coordinates (if there is any) at the AdS boundary are kept fixed. One assumes\nthe translational invariance along x2 , thus, we will use x1 to parametrize the functions v(x1 )\n15\n\n\f1.4\n\n1.2\n\n1.2\n\n1.0\n\n1.0\n\n0.8\n\n0.8\n\nz\n\nz\n\n1.4\n\n0.6\n\n0.6\n\n0.4\n\n0.4\n\n0.2\n\n0.2\n\n0.0\n-1.5\n\n-1.0\n\n-0.5\n\n0.0\n\n0.5\n\n1.0\n\n0.0\n-1.5\n\n1.5\n\n-1.0\n\n-0.5\n\nx\n\n1.2\n\n1.0\n\n1.0\n\n0.8\n\n0.8\n\nz\n\nz\n\n1.4\n\n1.2\n\n0.6\n\n0.6\n\n0.4\n\n0.4\n\n0.2\n\n0.2\n-0.5\n\n0.0\n\n0.5\n\n1.0\n\n0.0\n-1.5\n\n1.5\n\n-1.0\n\n-0.5\n\nx\n\n1.2\n\n1.0\n\n1.0\n\n0.8\n\n0.8\n\nz\n\nz\n\n1.4\n\n1.2\n\n0.6\n\n0.6\n\n0.4\n\n0.4\n\n0.2\n\n0.2\n-0.5\n\n0.0\n\n0.5\n\n1.0\n\n0.0\n-1.5\n\n1.5\n\n-1.0\n\n-0.5\n\nx\n\n1.2\n\n1.0\n\n1.0\n\n0.8\n\n0.8\n\nz\n\nz\n\n1.4\n\n1.2\n\n0.6\n\n0.6\n\n0.4\n\n0.4\n\n0.2\n\n0.2\n-0.5\n\n0.0\n\n1.0\n\n1.5\n\n0.0\n\n0.5\n\n1.0\n\n1.5\n\n(f) t0 = 1.011 - RNAdS Vaidya\n\n1.4\n\n-1.0\n\n0.5\n\nx\n\n(e) t0 = 1.010 - AdS-Vaidya\n\n0.0\n-1.5\n\n0.0\n\n(d) t0 = 0.771 - RNAdS Vaidya\n\n1.4\n\n-1.0\n\n1.5\n\nx\n\n(c) t0 = 0.778 - AdS-Vaidya\n\n0.0\n-1.5\n\n1.0\n\n(b) t0 = 0.498 - RNAdS Vaidya\n\n1.4\n\n-1.0\n\n0.5\n\nx\n\n(a) t0 = 0.498 - AdS-Vaidya\n\n0.0\n-1.5\n\n0.0\n\n0.5\n\n1.0\n\n0.0\n-1.5\n\n1.5\n\nx\n\n-1.0\n\n-0.5\n\n0.0\n\n0.5\n\n1.0\n\n1.5\n\nx\n\n(g) t0 = 2.004 - AdS-Vaidya\n\n(h) t0 = 2.022 - RNAdS Vaidya\n\nFigure 1: Evolution of the shell of dust described by the AdS-Vaidya metric with rh = 1, compared\nwith a shell of charged dust described by the RNAdS Vaidya type metric also with rh = 1 and\nQ/M = 1/2. In both cases the separation of the boundary field theory operator pair is l = 2.6.\nThe black hole horizon is indicated by a dashed horizontal red line. The horizonal dashed blue lines\nindicate the position of the shell in each case. The time differences in each pair of figures is due to\nthe fact that they have been obtained numerically, and therefore, there are minor differences.\n\n16\n\n\fand z(x1 ) in the AdSd+1 , and we call it x. Along the x2 direction the rectangular path on\nthe boundary has length RW L .\nAs in the previous case, there is no explicit dependence on x and therefore, there is a\nconserved quantity corresponding to the Hamiltonian. The tip of the rectangular Wilson\nloop is z∗ , with z ′ (0) = v ′ (0) = 0. Then, the conservation equation becomes\n\u0010 z \u00114\n∗\n′ ′\n′2\n1 − 2z v − fRN (v, z)v =\n.\n(46)\nz\nThe boundary conditions continue to be the same as in the geodesics case,\nz(−l/2) = z0 ,\n\nz(l/2) = z0 ,\n\nv(−l/2) = t0 ,\n\nv(l/2) = t0 .\n\n(47)\n\nNext, we have to minimize the Nambu-Goto action for this geometry. Since the calculations are similar to those for the two-point functions we will just focus on the final resulting\nexpressions. The simplified equations of motion of z(x) and v(x) are respectively\n0 = z(x)v ′ (x)2 ∂z fRN (v, z) − 4v ′ (x)2 fRN (v, z) − 2z(x)v ′′ (x) − 8v ′(x)z ′ (x) + 4 ,\n1\n0 = v ′ (x)z ′ (x)∂z fRN (v, z) + v ′ (x)2 ∂v fRN (v, z) + v ′′ (x)fRN (v, z) + z ′′ (x) .\n2\n\n(48)\n(49)\n\nUsing the explicit form of fRN (v, z) we obtain the following set of differential equations\n0 = 4z(x)d m(v)v ′(x)2 − 4z(x)2d−2 q(v)2 v ′ (x)2 − 2z(x)v ′′ (x)\n\n−8v ′ (x)z ′ (x) − 4v ′ (x)2 + 4 ,\n(50)\n1\nz(x)d v ′ (x)2 m′ (v) + z(x)d m(v)v ′′ (x) + dz(x)d−1 m(v)v ′ (x)z ′ (x)\n0 =\n2\n−z(x)2d−2 q(v)v ′(x)2 q ′ (v) − z(x)2d−2 q(v)2 v ′′ (x) − 2dz(x)2d−3 q(v)2 v ′ (x)z ′ (x)\n+2z(x)2d−3 q(v)2 v ′ (x)z ′ (x) − v ′′ (x) − z ′′ (x) ,\n\n(51)\n\nfor z(x) and v(x), respectively, which we will solved numerically. These equations reduce to\nthe corresponding ones presented in [20] when the charge is set to zero.\nWe can again extract the information of time and boundary separation length from\nz(l/2) = z0 ,\n\nv(l/2) = t0 ,\n\n(52)\n\nand rewrite the on-shell Nambu-Goto action by making use of the conservation equation,\nobtaining\nZ\nRW L l/2\nz2\nA(t0 , l, RW L ) =\ndx ∗4 .\n(53)\nπ\nz\n0\nFinally, we subtract the divergent part from pure AdS space by defining\nδA(t0 , l, RW L ) = A(t0 , l, RW L ) −\n17\n\n1 RW L\n.\nz0 π\n\n(54)\n\n\f4.3\n\nEvolution of thermalization probes\n\nHaving the information about the geodesic lengths and minimal area surfaces as a function\nof time, we can describe the thermalization process. In order to do it we compare δL and\nδA at each time with the final values δLRN and δARN , obtained in the pure ReissnerNordström-AdS black hole geometry, i.e. by setting both m(v) = M and q(v) = Q constant.\nThis procedure is repeated for different AdS-boundary separations l and different spacetime\n ̄ ≡ δL/l and δ Ā ≡ δA/(RW L l/π), such that\ndimensions. We prefer to plot the quantities δL\nthe thermalization effect can be better observed, independently of l.\nLet us consider a systematic study on how the thermalization time changes within these\ngeometries. If we want to have a clear comparison with thermalization in the SchwarzschildAdS case without charge, it is natural to keep fixed the radius of the event horizon, say\nrh = 1. The mass of the black hole is given by Eq.(30), so we obtain\nM = 1 + Q2 .\n\n(55)\n\nThis relation between M and Q holds from Q = 0 up to the extremal case. From Eq.(31),\nwe find\nr\nd\n.\n(56)\nQext =\nd−2\nEq.(55) still holds for Q values larger than its extremal value. However, in that case rh = 1\nbecomes a hidden singularity. The black hole horizon is the larger squared root of the\nfunction U(r) as given by Eq.(27). With this choice we can explore the whole parameter\nrange of the problem. The idea is to keep fixed the event horizon radius, and consider the\ncharge in the range 0 ≤ Q ≤ Qext . Then, we will study all the range 0 ≤ μ/T ≤ ∞ in the\ndual field theory.\nThis is shown for the two-point functions for different spacetime dimensions d = 3, 4, 5, 6\nwith l = 2, 3, 4 in Fig. 2 and for the expectation value of rectangular Wilson loops for l =\n1, 2, 3 in Fig. 3. Firstly, we notice certain similarities in comparison with the corresponding\nSchwarzschild-AdS cases (Q = 0). In principle, the thermalization time increases as the\nseparation of the CFT operators at the boundary is increased. Moreover, at a fixed value of\nthe charge, the thermalization time increases as the boundary separation does. For instance,\nfor l = 2, the renormalized geodesic length practically has no significant differences for\nthe thermalization time for any charge and dimension. However, interestingly, for l = 3,\nthe differences become more evident, while for l = 4 RNAdS-BH and AdS-BH cases are\nnotoriously distinct.\nOne of the most interesting effects we have found is the presence of a swallow-tail pattern\nnear the end of the thermalization process. This phenomenon has been reported earlier in\n[19] for thermalization of rectangular Wilson loops in AdS4 having μ = 0, as well as for those\n18\n\n\fcases when the shell is quasi-stationary. The reason for the emergence of the swallow-tail\nstructure is that, at certain time, there are more than just only one single geodesic minimizing\nthe action. This means that the saddle-point approximation should be taken cautiously. In\nreference [19], on the other hand, it has been argued that the swallow-tail structure depends\non the dimension of the system. However, according to our results displayed in Figs. 2\nand 3, this seems to be a universal phenomenon which depends on the penetration of the\nprobes in the bulk interior. In fact, we show how for sufficiently large probes swallow tails\nare independent on the kind of probe and on the dimension of the asymptotic AdS space.\nAgain, larger dimensions induce smaller variations. This effect is understood by considering\nthat the fraction of the perturbed modes by the shell is smaller as the dimensionality of the\nsystem increases.\n\n5\n\nDiscussion\n\nIn this section we discuss the numerical results obtained by using the formalism developed\nin the previous sections. We first analyze the results of renormalized geodesic lengths, then\nminimal area surfaces which are dual to expectation values of rectangular Wilson loops and\nfinally we discuss about the meaning of the swallow tails in the figures. In all the figures\ncorresponding to the geodesic lengths and minimal\narea surfaces the curves correspond to\nq\nd\n, with increments of 0.25. Recall that the\nvalues of the charge from Q = 0 to Qext = d−2\n\nmass is given by the relation M = 1 + Q2 . The UV cut-off has been taken as z0 = 0.01, we\nhave set rh = 1 and the shell thickness is v0 = 0.01.\nFigure 2 shows the results of thermalization with a chemical potential for different spacetime dimensions indicated as AdSd+1 , with d + 1 = 4, 5, 6 and 7. In all these cases we\nconsider two-point functions as extensive probes. As an example we show three different\nvalues of the boundary separation l =2, 3 and 4. The pictures are displayed in such a way\nthat l varies horizontally, while the spacetime dimension changes in the vertical direction.\nIn every picture the vertical axis indicates the renormalized geodesic length as a function\nof t0 . The fluor-green curve closer to the horizontal axis shows that faster thermalization\ncorresponds to the Schwarzschild-AdS black hole. The rest of curves in all pictures indicates\nincreasing values of the μ/T ratio. Thus, they correspond to thermalization with increasing chemical potential described in terms of Reissner-Nordström AdSd+1 black holes. The\nrange of μ/T ratio goes from zero to infinity, and we show several curves where always the\nfluor-green ones correspond to μ/T = 0 which coincide with the evolution of thermalization\nreported in reference [20]. As the chemical potential over temperature ratio increases the\ncurves depart from the fluor-green ones, and the larger differences occur for curves corresponding to μ/T → ∞. Looking at the first column of pictures we observe that for small\nseparation distances of local quantum field theory operators at the boundary, i.e. l = 2, the\n\n19\n\n\f(a) AdS4 & l = 2\n\n(b) AdS4 & l = 3\n\n(c) AdS4 & l = 4\n\n(d) AdS5 & l = 2\n\n(e) AdS5 & l = 3\n\n(f) AdS5 & l = 4\n\n(g) AdS6 & l = 2\n\n(h) AdS6 & l = 3\n\n(i) AdS6 & l = 4\n\n(j) AdS7 & l = 2\n\n(k) AdS7 & l = 3\n\n(l) AdS7 & l = 4\n\nFigure 2: Thermalization of the renormalized geodesic lengths for a RNAdS Vaidya type metric\nwith d + 1 = 4, 5, 6, 7 and the boundary separation l = 2, 3, 4. The first curve in each picture\n(fluor green) indicates the case Q = 0, i.e. the Schwarzschild-AdS case. The last curve in each\ncase corresponds to the extremal case where μ/T → ∞. For l = 4 swallow tails appear before the\nthermalization takes place. They are shown with more detail in the corresponding insets.\n\n20\n\n\f(a) AdS4 & l = 1\n\n(b) AdS4 & l = 1.5\n\n(c) AdS4 & l = 2\n\n(d) AdS5 & l = 1\n\n(e) AdS5 & l = 1.5\n\n(f) AdS5 & l = 2\n\n(g) AdS6 & l = 1\n\n(h) AdS6 & l = 1.5\n\n(i) AdS6 & l = 2\n\n(j) AdS7 & l = 1\n\n(k) AdS7 & l = 1.5\n\n(l) AdS7 & l = 2\n\nFigure 3: Thermalizacion of the renormalized minimal area surfaces for RNAdS Vaidya type metric\nwith d + 1 = 4, 5, 6, 7, while the boundary separation is l = 1, 1.5, 2. In each picture the first curve\n(fluor green) indicates the case Q = 0, i.e. the\nq Schwarzschild-AdS case. The rest of the curves in\n\nd\n. The last case is the extremal where μ/T → ∞.\neach figure correspond to Q = 0.50, 0.75, * * * , d−2\nInsets allow to show the swallow tails in detail. Note that in order to make easier the comparison\namong different figures the vertical and horizontal scales are kept fixed in all figures.\n\n21\n\n\frenormalized geodesic length becomes zero at the same t0 . For l = 3 (in the second column\nof pictures) it is already possible to notice a slight enhancement of the thermalization time\nas μ/T increases. This effect is much more noticeable for l = 4, in the third column of the\npictures. Thus, the conclusion is an enhancement of the thermalization time as the chemical\npotential over temperature ratio increases, which is more evident as the boundary separation\nincreases.\nFigure 3 shows the results of thermalization with a chemical potential for different spacetime dimensions indicated as AdSd+1 , with d + 1 =4, 5, 6 and 7, for minimal area surfaces\nwhich turn out to be dual to expectation values of rectangular Wilson loops. Notice that we\ndisplay values of the boundary separation, l = 1, 1.5 and 2, which are different from the ones\nshown in Fig. 2. From the pictures we can see that l varies horizontally, while the spacetime\ndimension changes in the vertical direction as for the geodesic lengths. In the present case\nvertical axis indicates the renormalized minimal area surfaces as functions of t0 . The fluorgreen curve closer to the horizontal axis shows that faster thermalization corresponds to\nthe Schwarzschild-AdS black hole as before. The curves correspond to thermalization with\nincreasing chemical potential described in terms of Reissner-Nordström AdSd+1 black holes.\nThe range of μ/T ratio goes from zero to infinity, and we show several curves where always\nthe fluor-green ones correspond to μ/T = 0. As the chemical potential increases the curves\ndepart from the fluor-green one, and the larger differences occur for curves corresponding to\nμ/T → ∞. Thermalization time is obtained when the curves reach zero. For l = 1.5 (in\nthe second column of pictures) it is already possible to notice a slight enhancement of the\nthermalization time as μ/T increases. This effect is more noticeable for l = 2. Therefore,\nwe arrive to the same conclusion as in the geodesic lengths case: there is an enhancement of\nthe thermalization time as the chemical potential over temperature ratio increases, which is\nmore evident as the boundary separation increases.\nEach figure 2(a-l) as well as 3(a-l) shows that the thermalization time for renormalized\ngeodesic lengths and minimal area surfaces increases as μ/T increases, while the dimension of the bulk spacetime d + 1 and the boundary separation l of two local field theory\noperators are kept fixed. When considering the three figures for a fixed dimension in each\nhorizontal sequence, there are two effects: one is that the thermalization time increases as\nthe boundary separation does; the second effect is that for small l there are no apparent\ndifferences in the thermalization time for any value of μ/T and, moreover, it coincides with\nthe Schwarzschild-AdS black hole case. As long as one increases l (see figures 2 and 3 (c, f, i,\nl)), the thermalization is significantly delayed as μ/T increases. This effect is understood as\na consequence of the fact that the term proportional to the charge in fRN (v, z) has opposite\nrelative sign with respect to the term proportional to the mass, so the chemical potential\nsomehow produces an effect similar to the one obtained from the reduction of the black hole\nmass. In addition, it turns out that the thermalization time is slightly larger for expectation values of rectangular Wilson loops compared with two-point functions. For the same\n22\n\n\fseparation length in the boundary, the minimal area surface dual to the expectation values\nof Wilson loops penetrate more into the bulk, thus resulting in a more extensive probe of\nthermalization, which takes more time to measure thermal equilibrium. From the dual quantum field theory side, we expect that the system after receiving a sudden injection of energy\nand particles will be far from thermal equilibrium. We assume that its dynamics should be\ncontrolled by a strongly coupled Yang Mills theory. The study of the thermalization process\ncannot be done in terms of the hydrodynamic approximation, and therefore, the description\nof the process is a very hard problem. On the other hand, we can think of a rather intuitive\nargument, which although has obviously not the value of any rigorous proof, it may help to\nunderstand whether our results obtained using a holographic dual model of thermalization\nare qualitatively consistent with the gauge theory expectations. First notice that in order for\nthe system to reach thermal equilibrium it requires both kinetic and chemical equilibration.\nThe former is expected to be faster than the second one. The reason is that chemical equilibration involves additional interactions. This, in principle, might delay the thermalization\nprocess in comparison with the situation where no chemical potential is considered.\nAlso from these figures a swallow-tail pattern emerges. In the insets of the figures we\nzoom in the corresponding regions of the figures in order to see the swallow-tail structure in\nmore detail. Now, let us consider the figures for a fixed l. So, increasing the AdS dimension\nwe observe that the effects of chemical potential become less relevant in all cases. This is\ndue to the fact that a geodesic is a one-dimensional line which is not able to account for the\neffect of other orthogonal space dimensions. Thus, if we increase d + 1, in order to observe\nthe effect on the thermalization time, we have to use an extended probe having more space\ndimensions. This effect can be seen by comparison with the thermalization curves using the\ndual of expectation values of Wilson loops as extended probes. In all the figures we can\nobserve that UV degrees of freedom thermalize first.\nIt is interesting to analyze the cause of the swallow-tail emergence in thermalization curves\nwith large boundary separation distance. In general this kind of effect is found in systems\nwhere there are two different scales. In the present case, there are different length scales that\ncould, in principle, induce the swallow-tail pattern. For instance, the AdS radius, the inverse\nof confinement temperature Tc , the UV cut-off z0 and the shell thickness, can all introduce\na second scale to the problem. However, we do not find that any of these scales are relevant\nfor the appearance of a swallow tail. In fact, we will show that different solutions given in\nthe swallow tails are actually non-physical solutions of our problem, in the sense that they\nhave not to be taken into account. This can be shown by looking at how the solutions that\nappear in the swallow tail are. As an example, we show in Fig. 4 these solutions for the\nswallow tail that appear when evaluating expectation values of rectangular Wilson loops in\nthe extremal RNAdS4 Vaidya metric. What we can appreciate is that from the three different\nsolutions that generate the swallow tail at a certain time, two of them have z(x) functions\nthat propagate inside the event horizon. One could nevertheless think that the appearance\n23\n\n\f1.2\n1.0\n\nz\n\n0.8\n0.6\n0.4\n0.2\n0.0\n-1.0\n\n-0.5\n\n0.0\n\n0.5\n\n1.0\n\nx\n\n(a) z∗ = 1.207 & v∗ = −0.194\n\n(b) z∗ = 1.201 & v∗ = −0.189\n\n(c) z∗ = 0.839 & v∗ = 0.173\n\nFigure 4: Three different solutions that appear as part of the swallow tail in thermalization of\nexpectation values of Wilson loops in the extremal RNAdS Vaidya geometry with d = 3. Time\ncorresponds to t0 = 1.778 in all three cases and separation length is l = 2. The red dashed line\ncorresponds to the event horizon (zh = 1), while the blue dashed one is the position of the shell.\nIn the first two cases, the shell is located inside the event horizon but still have solutions inside.\nIn the insets we take a closer look at the region near the horizon and consider the shell thickness\n(−0.02 ≤ v ≤ 0.02) in blue.\nof those solutions is due to the shell thickness that can emulate a black hole solution with a\ndeeper event horizon. However, as it is shown in the insets of Figs. 4(a) and 4(b) even by\nconsidering the shell thickness we obtain that these solutions propagate beyond the event\nhorizon. So, only the third one, that appears in Fig. 4(c), is the physical and thermalized\nsolution.\nThe effective model presented above is based on a double quench (for the mass and charge)\nand it has a metric which evolves in time. These features make, in principle, difficult to think\nof finding a top-down description from string theory and M-theory. However, it is certainly\ninteresting to study this kind of models based on a collapsing shell of charged dust since it\nallows to study the thermalization process in a dual strongly coupled quantum field theory.\nOne of the important results is that by using this geometric extended probes one finds a\ntop-down thermalization regardless of the dimension of the AdS space and of whether the\nshell is charged or not. This is a consequence of the geometric setup, where for smaller\nboundary separations the dual geometric structures probe a region closer to the boundary.\nAlso, as it is the case for Schwarzschild-AdS black holes there is a delay in the beginning\nof the thermalization process due to the fact that the system only feels the sudden energy\ninjection at the boundary at distances of its thermal wavelength. We have carried out a\nsystematic investigation by exploring the whole range of μ/T , the boundary separation and\nthe dimension of the AdS spaces. Except for the case of the BTZ black hole the expressions\nrequire to solve them numerically. The reason to include chemical potential, using the\ngrand canonical ensemble, is because realistic systems such as QGPs and condensed matter\nsystems have that. In order to do so, the formalism presented in this work, studying a general\nReissner-Nordström-AdS black hole Vaidya-type metric in arbitrary number of dimensions,\n\n24\n\n\fis very interesting and we hope it will motivate further studies and extensions. In all the\ncases studied the effect produced by the chemical potential is the delay of the thermalization\nprocess, being it more evident as the boundary separation increases. This also agrees with\nthe conclusion that the thermalization of more energetic modes proceeds first in strongly\ncoupled systems.\n\nAcknowledgments\nWe thank Esteban Calzetta, Nicolás Grandi, Carlos Núñez and Guillermo Silva for useful\ndiscussions and Carlos Núñez for a careful reading of the manuscript. This work has been\npartially supported by the CONICET, the ANPCyT-FONCyT Grant PICT-2007-00849, and\nthe PIP-2010-0396 Grant.\n\n25\n\n\fA\n\nOn null vectors and energy conditions of the RNAdS-Vaidya type metric\n\nIn this Appendix we show how the energy conditions are satisfied for a RN-AdS-Vaidya\ntype metric like the one that has been analyzed in this work as a gravitational dual to\nthermalization of field theories at finite temperature with a finite chemical potential.\nThe energy-momentum tensor Tμν at each point of a manifold satisfies the so-called weakenergy condition [54], Tμν W μ W ν ≥ 0 for any time-like vector W μ . In particular, for any null\nvector N μ , this becomes the condition Tμν N μ N ν ≥ 0. In the case of the Vaidya metric we will\nfollow [16] and consider normal null vectors to surfaces that preserve translation invariance\nin the boundary coordinates xi ; that is, surfaces of constant v and z. The resulting null\nvectors are\n\u0013\n\u0012\nz2\nμ\n(57)\nN1 =\n0, 4 , 0 ,\nR\n\u0012\n\u0013\nfRN (v, z)\nμ\n2\nR ,−\nN2 =\n,0 ,\n(58)\n2\nwhere we have restored units of AdS radius R. With this choice the metric and fRN becomes\n\u0003\n1 \u0002\n(59)\nds2 = 2 −fRN (v, z)dv 2 − 2R2 dzdv + R2 dx2\nz\nzd\nz 2d−2\nfRN (v, z) = R2 − m(v) 2d−4 + q(v)2 4d−8 .\n(60)\nR\nR\nThe normalization has been chosen such that N1 * N2 = −1. As the only non-vanishing\ncomponent of the energy-momentum tensor is\n\u0012\n\u0013\n(d − 1)z d−1 1 2d−4\nd+1\nd−2\n8πG Tvv =\nR\nṁ(v) − z q(v)q̇(v) ,\n(61)\nR4d−6\n2\nthe null energy condition for N1 is satisfied trivially. For N2 the energy condition depends\non the relation between m(v) and q(v). As mentioned before, for q(v) = 0 the condition is\nalways satisfied provided that ṁ(v) is non-negative. In the charged case, the expression can\nbe analyzed in a simpler way by making use of the relation between mass, charge and event\nhorizon radius given in Eq.(30). The chosen quenches satisfy\nM\ng(v) ,\n(62)\n2\nQ\nq(v) =\ng(v) ,\n(63)\n2\nwhere g(v) = 2θ(v) in the zero shell thickness case and g(v) = 1 + tanh( vv0 ) in the general\ncase. The null energy condition becomes\n\u0012 4d−6\n\u0013\n\u0001\nd − 1 z d−1\nR\n2\nd−2\nd−2\nġ(v)\n+ Q zh − z g(v) ≥ 0 .\n(64)\n4 R4d−10\nzhd\nm(v) =\n\n26\n\n\fThe overall function ġ(v) makes that the condition is satisfied if\nz≤\n\n1\n1\n\ng(v) d−2\n\n\u0012\n\nzh−d R4d−6\n+ zhd−2\nQ2\n\n1\n\u0013 d−2\n\n.\n\n(65)\n\nFor the zero shell thickness, i.e. for the step function, the null energy condition is satisfied\nfor any value of v. In the case of a smoother function, there can be a small region for large\nQ around v = 0, where the condition is not satisfied. On the other hand, we can always\nconsider R and zh to be within a parametric region where R4d−6 /zh2d−2 ≥ Q2 , where the null\nenergy condition is satisfied for any value of v. In addition, as the limit case of zero shell\nthickness is indeed physical, we consider that it is interesting to study the whole range of\nparameters from zero charge to the extremal case.\n\n27\n\n\fReferences\n[1] E. Shuryak, \"Why does the quark gluon plasma at RHIC behave as a nearly ideal\nfluid?,\" Prog. Part. Nucl. Phys. 53 (2004) 273 [arXiv:hep-ph/0312227].\n[2] J. Schukraft and f. t. A. Collaboration, \"First Results from the ALICE experiment at\nthe LHC,\" arXiv:1103.3474 [hep-ex].\n[3] N. Armesto et al., \"Heavy Ion Collisions at the LHC - Last Call for Predictions,\" J.\nPhys. G 35 (2008) 054001 [arXiv:0711.0974 [hep-ph]].\n[4] J. M. Maldacena, \"The large N limit of superconformal field theories and supergravity,\"\nAdv. Theor. Math. Phys. 2 (1998) 231 [Int. J. Theor. Phys. 38 (1999) 1113] [arXiv:hepth/9711200].\n[5] S. S. Gubser, I. R. Klebanov and A. M. Polyakov, \"Gauge theory correlators from\nnon-critical string theory,\" Phys. Lett. B 428 (1998) 105 [arXiv:hep-th/9802109].\n[6] E. Witten, \"Anti-de Sitter space and holography,\" Adv. Theor. Math. Phys. 2 (1998)\n253 [arXiv:hep-th/9802150].\n[7] G. Policastro, D. T. Son and A. O. Starinets, \"The Shear viscosity of strongly coupled\nN=4 supersymmetric Yang-Mills plasma,\" Phys. Rev. Lett. 87 (2001) 081601 [hepth/0104066].\n[8] J. Casalderrey-Solana, H. Liu, D. Mateos, K. Rajagopal and U. A. Wiedemann,\n\"Gauge/String Duality, Hot QCD and Heavy Ion Collisions,\" arXiv:1101.0618 [hep-th].\n[9] A. Buchel, J. T. Liu and A. O. Starinets, \"Coupling constant dependence of the shear\nviscosity in N=4 supersymmetric Yang-Mills theory,\" Nucl. Phys. B 707 (2005) 56\n[hep-th/0406264].\n[10] G. Policastro, D. T. Son and A. O. Starinets, \"From AdS / CFT correspondence to\nhydrodynamics,\" JHEP 0209 (2002) 043 [hep-th/0205052].\n[11] B. Hassanain and M. Schvellinger, \"Towards 't Hooft parameter corrections to charge\ntransport in strongly-coupled plasma,\" JHEP 1010 (2010) 068 [arXiv:1006.5480 [hepth]].\n[12] B. Hassanain and M. Schvellinger, \"Plasma conductivity at finite coupling,\" JHEP 1201\n(2012) 114 [arXiv:1108.6306 [hep-th]].\n[13] S. Caron-Huot, P. Kovtun, G. D. Moore, A. Starinets and L. G. Yaffe, \"Photon and\ndilepton production in supersymmetric Yang-Mills plasma,\" JHEP 0612 (2006) 015\n[hep-th/0607237].\n28\n\n\f[14] B. Hassanain and M. Schvellinger, \"Diagnostics of plasma photoemission at strong coupling,\" arXiv:1110.0526 [hep-th].\n[15] S. R. Das, T. Nishioka and T. Takayanagi, \"Probe Branes, Time-dependent Couplings\nand Thermalization in AdS/CFT,\" JHEP 1007 (2010) 071 [arXiv:1005.3348 [hep-th]].\n[16] J. Abajo-Arrastia, J. Aparicio and E. Lopez, \"Holographic Evolution of Entanglement\nEntropy,\" JHEP 1011 (2010) 149 [arXiv:1006.4090 [hep-th]].\n[17] T. Albash and C. V. Johnson, \"Evolution of Holographic Entanglement Entropy\nafter Thermal and Electromagnetic Quenches,\" New J. Phys. 13 (2011) 045017\n[arXiv:1008.3027 [hep-th]].\n[18] H. Ebrahim and M. Headrick, \"Instantaneous Thermalization in Holographic Plasmas,\"\narXiv:1010.5443 [hep-th].\n[19] V. Balasubramanian, A. Bernamonti, J. de Boer, N. Copland, B. Craps, E. KeskiVakkuri, B. Muller and A. Schafer et al., \"Thermalization of Strongly Coupled Field\nTheories,\" Phys. Rev. Lett. 106 (2011) 191601 [arXiv:1012.4753 [hep-th]].\n[20] V. Balasubramanian, A. Bernamonti, J. de Boer, N. Copland, B. Craps, E. KeskiVakkuri, B. Muller and A. Schafer et al., \"Holographic Thermalization,\" Phys. Rev. D\n84 (2011) 026010 [arXiv:1103.2683 [hep-th]].\n[21] D. Garfinkle and L. A. Pando Zayas, \"Rapid Thermalization in Field Theory from\nGravitational Collapse,\" Phys. Rev. D 84 (2011) 066006 [arXiv:1106.2339 [hep-th]].\n[22] J. Aparicio and E. Lopez, \"Evolution of Two-Point Functions from Holography,\" JHEP\n1112 (2011) 082 [arXiv:1109.3571 [hep-th]].\n[23] A. Allais and E. Tonni, \"Holographic evolution of the mutual information,\" JHEP 1201\n(2012) 102 [arXiv:1110.1607 [hep-th]].\n[24] V. Keranen, E. Keski-Vakkuri and L. Thorlacius, \"Thermalization and entanglement\nfollowing a non-relativistic holographic quench,\" Phys. Rev. D 85 (2012) 026005\n[arXiv:1110.5035 [hep-th]].\n[25] D. Garfinkle, L. A. Pando Zayas and D. Reichmann, \"On Field Theory Thermalization\nfrom Gravitational Collapse,\" JHEP 1202 (2012) 119 [arXiv:1110.5823 [hep-th]].\n[26] S. R. Das, \"Holographic Quantum Quench,\" J. Phys. Conf. Ser. 343 (2012) 012027\n[arXiv:1111.7275 [hep-th]].\n[27] V. E. Hubeny, \"Extremal surfaces as bulk probes in AdS/CFT,\" arXiv:1203.1044 [hepth].\n29\n\n\f[28] U. H. Danielsson, E. Keski-Vakkuri and M. Kruczenski, \"Black hole formation in AdS\nand thermalization on the boundary,\" JHEP 0002 (2000) 039 [hep-th/9912209].\n[29] S. B. Giddings and S. F. Ross, \"D3-brane shells to black branes on the Coulomb branch,\"\nPhys. Rev. D 61 (2000) 024036 [hep-th/9907204].\n[30] R. A. Janik and R. B. Peschanski, \"Gauge/gravity duality and thermalization of a\nboost-invariant perfect fluid,\" Phys. Rev. D 74 (2006) 046007 [hep-th/0606149].\n[31] R. A. Janik, \"Viscous plasma evolution from gravity using AdS/CFT,\" Phys. Rev. Lett.\n98 (2007) 022302 [hep-th/0610144].\n[32] P. M. Chesler and L. G. Yaffe, \"Horizon formation and far-from-equilibrium isotropization in supersymmetric Yang-Mills plasma,\" Phys. Rev. Lett. 102 (2009) 211601\n[arXiv:0812.2053 [hep-th]].\n[33] P. M. Chesler and L. G. Yaffe, \"Boost invariant flow, black hole formation, and farfrom-equilibrium dynamics in N = 4 supersymmetric Yang-Mills theory,\" Phys. Rev. D\n82 (2010) 026006 [arXiv:0906.4426 [hep-th]].\n[34] S. Bhattacharyya and S. Minwalla, \"Weak Field Black Hole Formation in Asymptotically AdS Spacetimes,\" JHEP 0909 (2009) 034 [arXiv:0904.0464 [hep-th]].\n[35] S. Lin and E. Shuryak, \"Toward the AdS/CFT Gravity Dual for High Energy Collisions.\n3. Gravitationally Collapsing Shell and Quasiequilibrium,\" Phys. Rev. D 78 (2008)\n125018 [arXiv:0808.0910 [hep-th]].\n[36] J. Adams et al. [STAR Collaboration], \"Experimental and theoretical challenges in the\nsearch for the quark gluon plasma: The STAR Collaboration's critical assessment of the\nevidence from RHIC collisions,\" Nucl. Phys. A 757 (2005) 102 [nucl-ex/0501009].\n[37] B. B. Back, M. D. Baker, M. Ballintijn, D. S. Barton, B. Becker, R. R. Betts, A. A. Bickley and R. Bindel et al., \"The PHOBOS perspective on discoveries at RHIC,\" Nucl.\nPhys. A 757 (2005) 28 [nucl-ex/0410022].\n[38] K. Adcox et al. [PHENIX Collaboration], \"Formation of dense partonic matter in relativistic nucleus-nucleus collisions at RHIC: Experimental evaluation by the PHENIX\ncollaboration,\" Nucl. Phys. A 757 (2005) 184 [nucl-ex/0410003].\n[39] I. Arsene et al. [BRAHMS Collaboration], \"Quark gluon plasma and color glass condensate at RHIC? The Perspective from the BRAHMS experiment,\" Nucl. Phys. A 757\n(2005) 1 [nucl-ex/0410020].\n\n30\n\n\f[40] R. C. Myers, M. F. Paulos and A. Sinha, \"Holographic Hydrodynamics with a Chemical\nPotential,\" JHEP 0906 (2009) 006 [arXiv:0903.2834 [hep-th]].\n[41] C. Martinez, C. Teitelboim and J. Zanelli, \"Charged rotating black hole in three spacetime dimensions,\" Phys. Rev. D 61 (2000) 104013 [hep-th/9912259].\n[42] G. Grignani, T. Harmark, A. Marini, N. A. Obers and M. Orselli, \"Thermal string\nprobes in AdS and finite temperature Wilson loops,\" arXiv:1201.4862 [hep-th].\n[43] S. Ryu and T. Takayanagi, \"Holographic derivation of entanglement entropy from\nAdS/CFT,\" Phys. Rev. Lett. 96 (2006) 181602 [hep-th/0603001].\n[44] S. Ryu and T. Takayanagi, \"Aspects of Holographic Entanglement Entropy,\" JHEP\n0608 (2006) 045 [hep-th/0605073].\n[45] T. Nishioka, S. Ryu and T. Takayanagi, \"Holographic Entanglement Entropy: An\nOverview,\" J. Phys. A A 42 (2009) 504008 [arXiv:0905.0932 [hep-th]].\n[46] P. C. Vaidya, \"The external field of a radiating star in general relativity\", Curr. Sci. 12\n(1943) 183.\n[47] P. C. Vaidya, \"The gravitational field of a radiating star\", Proc. Indian. Acad. Sci. A.\n33 (1951) 264\n[48] V. Balasubramanian and S. F. Ross, \"Holographic particle detection,\" Phys. Rev. D 61\n(2000) 044007 [hep-th/9906226].\n[49] A. Chamblin, R. Emparan, C. V. Johnson and R. C. Myers, \"Charged AdS black holes\nand catastrophic holography,\" Phys. Rev. D 60 (1999) 064018 [hep-th/9902170].\n[50] A. Chamblin, R. Emparan, C. V. Johnson and R. C. Myers, \"Holography, thermodynamics and fluctuations of charged AdS black holes,\" Phys. Rev. D 60 (1999) 104026\n[hep-th/9904197].\n[51] R. Emparan, \"AdS membranes wrapped on surfaces of arbitrary genus,\" Phys. Lett. B\n432 (1998) 74 [hep-th/9804031].\n[52] J. M. Maldacena, \"Wilson loops in large N field theories,\" Phys. Rev. Lett. 80 (1998)\n4859 [hep-th/9803002].\n[53] S. -J. Rey and J. -T. Yee, \"Macroscopic strings as heavy quarks in large N gauge theory\nand anti-de Sitter supergravity,\" Eur. Phys. J. C 22 (2001) 379 [hep-th/9803001].\n[54] S. W. Hawking and G. F. R. Ellis, \"The Large scale structure of space-time,\" Cambridge\nUniversity Press, Cambridge, 1973.\n31\n\n\f"}