{"id": "http://arxiv.org/abs/0801.2161v1", "guidislink": true, "updated": "2008-01-14T21:09:18Z", "updated_parsed": [2008, 1, 14, 21, 9, 18, 0, 14, 0], "published": "2008-01-14T21:09:18Z", "published_parsed": [2008, 1, 14, 21, 9, 18, 0, 14, 0], "title": "Observations Outside the Light-Cone: Algorithms for Non-Equilibrium and\n  Thermal States", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0801.0351%2C0801.3111%2C0801.0614%2C0801.2451%2C0801.1794%2C0801.4627%2C0801.1605%2C0801.0182%2C0801.1744%2C0801.3312%2C0801.2676%2C0801.2435%2C0801.3671%2C0801.2498%2C0801.4939%2C0801.1788%2C0801.0286%2C0801.4155%2C0801.3077%2C0801.3517%2C0801.0674%2C0801.4353%2C0801.1137%2C0801.3055%2C0801.2136%2C0801.1963%2C0801.4232%2C0801.3956%2C0801.2894%2C0801.4369%2C0801.4125%2C0801.2071%2C0801.2522%2C0801.1505%2C0801.0735%2C0801.2661%2C0801.1368%2C0801.3074%2C0801.4084%2C0801.2701%2C0801.3536%2C0801.3653%2C0801.4661%2C0801.1793%2C0801.0190%2C0801.1475%2C0801.3533%2C0801.0380%2C0801.1396%2C0801.2600%2C0801.1287%2C0801.2733%2C0801.0244%2C0801.0342%2C0801.1162%2C0801.0340%2C0801.1947%2C0801.4277%2C0801.2164%2C0801.3518%2C0801.0277%2C0801.1204%2C0801.2820%2C0801.2144%2C0801.4442%2C0801.3615%2C0801.3351%2C0801.4168%2C0801.2239%2C0801.3104%2C0801.0645%2C0801.2161%2C0801.2776%2C0801.4867%2C0801.2246%2C0801.3932%2C0801.1256%2C0801.1147%2C0801.2364%2C0801.2632%2C0801.0754%2C0801.3744%2C0801.1849%2C0801.3059%2C0801.1164%2C0801.3086%2C0801.2519%2C0801.2628%2C0801.2317%2C0801.0915%2C0801.3381%2C0801.1696%2C0801.4887%2C0801.1796%2C0801.1470%2C0801.4549%2C0801.2971%2C0801.2497%2C0801.4223%2C0801.3866%2C0801.2790&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Observations Outside the Light-Cone: Algorithms for Non-Equilibrium and\n  Thermal States"}, "summary": "We apply algorithms based on Lieb-Robinson bounds to simulate time-dependent\nand thermal quantities in quantum systems. For time-dependent systems, we\nmodify a previous mapping to quantum circuits to significantly reduce the\ncomputer resources required. This modification is based on a principle of\n\"observing\" the system outside the light-cone. We apply this method to study\nspin relaxation in systems started out of equilibrium with initial conditions\nthat give rise to very rapid entanglement growth. We also show that it is\npossible to approximate time evolution under a local Hamiltonian by a quantum\ncircuit whose light-cone naturally matches the Lieb-Robinson velocity.\nAsymptotically, these modified methods allow a doubling of the system size that\none can obtain compared to direct simulation. We then consider a different\nproblem of thermal properties of disordered spin chains and use quantum belief\npropagation to average over different configurations. We test this algorithm on\none dimensional systems with mixed ferromagnetic and anti-ferromagnetic bonds,\nwhere we can compare to quantum Monte Carlo, and then we apply it to the study\nof disordered, frustrated spin systems.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0801.0351%2C0801.3111%2C0801.0614%2C0801.2451%2C0801.1794%2C0801.4627%2C0801.1605%2C0801.0182%2C0801.1744%2C0801.3312%2C0801.2676%2C0801.2435%2C0801.3671%2C0801.2498%2C0801.4939%2C0801.1788%2C0801.0286%2C0801.4155%2C0801.3077%2C0801.3517%2C0801.0674%2C0801.4353%2C0801.1137%2C0801.3055%2C0801.2136%2C0801.1963%2C0801.4232%2C0801.3956%2C0801.2894%2C0801.4369%2C0801.4125%2C0801.2071%2C0801.2522%2C0801.1505%2C0801.0735%2C0801.2661%2C0801.1368%2C0801.3074%2C0801.4084%2C0801.2701%2C0801.3536%2C0801.3653%2C0801.4661%2C0801.1793%2C0801.0190%2C0801.1475%2C0801.3533%2C0801.0380%2C0801.1396%2C0801.2600%2C0801.1287%2C0801.2733%2C0801.0244%2C0801.0342%2C0801.1162%2C0801.0340%2C0801.1947%2C0801.4277%2C0801.2164%2C0801.3518%2C0801.0277%2C0801.1204%2C0801.2820%2C0801.2144%2C0801.4442%2C0801.3615%2C0801.3351%2C0801.4168%2C0801.2239%2C0801.3104%2C0801.0645%2C0801.2161%2C0801.2776%2C0801.4867%2C0801.2246%2C0801.3932%2C0801.1256%2C0801.1147%2C0801.2364%2C0801.2632%2C0801.0754%2C0801.3744%2C0801.1849%2C0801.3059%2C0801.1164%2C0801.3086%2C0801.2519%2C0801.2628%2C0801.2317%2C0801.0915%2C0801.3381%2C0801.1696%2C0801.4887%2C0801.1796%2C0801.1470%2C0801.4549%2C0801.2971%2C0801.2497%2C0801.4223%2C0801.3866%2C0801.2790&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We apply algorithms based on Lieb-Robinson bounds to simulate time-dependent\nand thermal quantities in quantum systems. For time-dependent systems, we\nmodify a previous mapping to quantum circuits to significantly reduce the\ncomputer resources required. This modification is based on a principle of\n\"observing\" the system outside the light-cone. We apply this method to study\nspin relaxation in systems started out of equilibrium with initial conditions\nthat give rise to very rapid entanglement growth. We also show that it is\npossible to approximate time evolution under a local Hamiltonian by a quantum\ncircuit whose light-cone naturally matches the Lieb-Robinson velocity.\nAsymptotically, these modified methods allow a doubling of the system size that\none can obtain compared to direct simulation. We then consider a different\nproblem of thermal properties of disordered spin chains and use quantum belief\npropagation to average over different configurations. We test this algorithm on\none dimensional systems with mixed ferromagnetic and anti-ferromagnetic bonds,\nwhere we can compare to quantum Monte Carlo, and then we apply it to the study\nof disordered, frustrated spin systems."}, "authors": ["M. B. Hastings"], "author_detail": {"name": "M. B. Hastings"}, "author": "M. B. Hastings", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.77.144302", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0801.2161v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0801.2161v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "19 pages, 12 figures", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0801.2161v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0801.2161v1", "journal_reference": "Phys. Rev. B 77, 144302 (2008).", "doi": "10.1103/PhysRevB.77.144302", "fulltext": "Observations Outside the Light-Cone: Algorithms for Non-Equilibrium and Thermal\nStates\nM. B. Hastings1,2\n1\n\narXiv:0801.2161v1 [quant-ph] 14 Jan 2008\n\n2\n\nCenter for Nonlinear Studies and Theoretical Division,\nLos Alamos National Laboratory, Los Alamos, NM, 87545\nKavli Institute of Theoretical Physics, University of California, Santa Barbara, CA, 93106\n\nWe apply algorithms based on Lieb-Robinson bounds to simulate time-dependent and thermal\nquantities in quantum systems. For time-dependent systems, we modify a previous mapping to\nquantum circuits to significantly reduce the computer resources required. This modification is based\non a principle of \"observing\" the system outside the light-cone. We apply this method to study\nspin relaxation in systems started out of equilibrium with initial conditions that give rise to very\nrapid entanglement growth. We also show that it is possible to approximate time evolution under\na local Hamiltonian by a quantum circuit whose light-cone naturally matches the Lieb-Robinson\nvelocity. Asymptotically, these modified methods allow a doubling of the system size that one can\nobtain compared to direct simulation. We then consider a different problem of thermal properties of\ndisordered spin chains and use quantum belief propagation to average over different configurations.\nWe test this algorithm on one dimensional systems with mixed ferromagnetic and anti-ferromagnetic\nbonds, where we can compare to quantum Monte Carlo, and then we apply it to the study of\ndisordered, frustrated spin systems.\n\nI.\n\nINTRODUCTION\n\nMatrix product and density-matrix renormalization group methods provide one of the most powerful ways of\nsimulating one-dimensional quantum systems. In addition to ground state properties[1], they have been extended\nto thermal and open systems[2] and dynamical problems[3]. The reason for the success of these algorithms is that\nin many cases the appropriate quantum state can be well-approximated by a matrix product state, giving a very\ncompact representation of the state of the system.\nIn some cases, we even have theorems that quantify the accuracy of matrix product states. For ground states of\nlocal quantum systems with a gap, the ability to represent ground states as matrix product states follows from bounds\non the entanglement entropies[4]. Related results are available for thermal systems[5, 6] and for non-equilibrium states\nobtained by starting with a factorized state and evolving under a local Hamiltonian for a time t; in the first case\nthe bond dimension needed to get a good matrix product approximation to the desired state scales exponentially\nin β, while in the second case it scales exponentially in t[7]. The two results [5, 7] are constructive proofs, which\ngive an algorithm to find the matrix product state. All of these constructive proofs rely heavily on Lieb-Robinson\nbounds[8, 9, 10, 11].\nIn contrast to these constructive proofs, the matrix product algorithms used in practice are variational: they involve\noptimizing over different matrix product states to find the best one. This works well because in many practical cases\nthe entanglement grows much more slowly than the upper bounds set by theory. For example, systems described by\nconformal field theory have an entanglement entropy growing only logarithmically with system size[12], while the area\nlaw bound[4] gives no useful result for these systems due to the absence of a gap. Similarly, for many initial conditions,\nevolution under a local Hamiltonian gives an entanglement entropy growing only logarithmically in time[13, 14, 15]\nwhile the theoretical upper bound gives an entanglement entropy growing linearly in time[16].\nIn this paper, we argue that there are many situations in which algorithms based on Lieb-Robinson bounds are\nthe best technique. We first look at the case of time evolution in systems out of equilibrium. Here, there are initial\nconditions for which the entanglement entropy is known to grow linearly in time[17], in accordance with conformal\nfield theory predictions[18]. Roughly speaking, logarithmic entropy growth tends to occur in cases where we can\ndivide the chain into a small number of subchains such that the initial state is an eigenstate of the Hamiltonian on\neach subchain; for example, starting an XXZ spin chain in a state in which all the spins on the left half of the chain\nare up and all the spins on the right half of the chain are down leads to a logarithmic entropy growth[15]. On the\nother hand, the linear entropy growth tends to occur in cases where the initial state differs from an eigenstate of\nthe Hamiltonian on every subsystem of the full spin chain. For example, starting an XXZ spin chain in an initial\ncondition in which the spins alternate between up and down (a Neel state, the ground state when the Ising term is\nthe only term in the Hamiltonian) leads to a linear entropy growth[17].\nFor system with linear entropy growth, matrix product methods will require a bond dimension growing exponentially\nin time to obtain accurate results. At this point, both variational matrix product and constructive, Lieb-Robinsonbased methods require resources growing exponentially in time. The question, then, is how to obtain the smallest\n\n\f2\nexponential. To some extent, the Lieb-Robinson based methods (such as [7] and the methods below) are \"worst-case\":\nthe bond dimension depends on theoretical upper bounds for arbitrary local Hamiltonians, while the matrix product\nmethods can adaptively find better representations. On the other hand, there are some disadvantages to matrix\nproduct methods. To get a rough idea of the resources required, let us consider a system of N spins, each of spin-1/2,\nwith a local Hamiltonian. The simplest algorithm to simulate this system for a time t involves writing the initial\ncondition down in some basis and then directly simulating it (we discuss below different methods for doing this),\nrequiring resources scaling as 2N t using sparse matrix methods. A matrix product algorithm can avoid truncation\nerror for this system by using matrices with bond dimension 2N/2 [19, 20]. However, the algorithm must then perform\nsingular value decompositions and eigenvalue calculations, taking a time which scales as the cube of these matrices,\nand hence of order 23N/2 , which is slower. Of course, the matrix product methods are really only useful if they are\nable to represent the system with a smaller bond dimension. In this case, though, even if such a representation exists,\nthe algorithm must find it, and this can pose a problem. The algorithm for simulation of non-equilibrium systems\ndepends on breaking the time evolution into a series of small Trotter steps; if the Trotter steps are too long this can\nlead to Trotter error, while if they are too short, the truncation error can grow rapidly: even if there is a good state\nthe algorithm may not find it[15].\nWe can use this scaling of the difficulty with N to get an idea of the scaling of computation effort with time, using\na Lieb-Robinson bound on the group velocity, vLR . Suppose we wish to compute the expectation value of a local\nobservable, such as a spin on a site, at a time tf , starting from a factorized state at time t = 0. The number of spins\nin the past light-cone of this spin is 2vLR t, and the Lieb-Robinson bounds imply that the effect of spins outside the\nlight-cone is exponetially small. Thus, it suffices to simulate only the dynamics of the N = 2vLR tf + O(log(ǫ)) spins\nclosest to the given spin in order to compute the expectation value to an accuracy ǫ. This requires an effort scaling\nexponentially in time as t2 22vLR t . Similarly, if the entanglement entropy grows linearly in time, the matrix product\nmethods also require an effort scaling exponentially in time.\nOur main result in this paper is the light-cone quantum circuit algorithm, an application of the Lieb-Robinson\nbound that allows us to simulate the evolution of local observables with resources growing asymptotically as only\nN t2vLR , by some statistical sampling. This allows twice as large systems as the direct method. We analyze the entropy\ngrowth in these systems and argue that matrix product methods are also less efficient for long time simulation. We\napply the light-cone quantum circuit algorithm then to the problem of spin relaxation in spin chains started in the\nNeel state. The physical idea behind the light-cone quantum circuit algorithm is as follows: to find the state of a\ngiven spin at a time tf , we only have to track the dynamics within the past light-cone of the spin. For times t close\nto zero, the past light-cone includes roughly 2vLR tf spins, but at these early times the entanglement is small and\nhence the computational effort should be less. For times t close to tf , the past light-cone includes few spins and hence\nshould be easier to simulate.\nThe paper is organized as follows. We first derive the light-cone quantum circuit algorithm. We then apply it to\nspin relaxation, and study oscillations of the central spin, decay of the envelope of the oscillations, and also seemingly\nrandom oscillations of the central spin in chains where boundary effects become important. We then derive a related\nquantum circuit method, the corner transfer quantum circuit which may be useful for studying the evolution of global\nobservables in highly entangled non-equilibrium states.\nWe then turn to a different problem, presenting one other application of Lieb-Robinson methods, using the quantum\nbelief propagation algorithm[22] to study thermal states in disordered systems. The quantum belief propagation\nalgorithm explicitly constructs a matrix product state for a thermal quantum system. While it manipulates operators,\nrather than states, and thus can be computationally expensive, it has other advantages. It has no Trotter error, making\nit fast and accurate at high temperatures: it can obtain quantities such as the susceptibility peak to higher accuracy\nusing fewer resources than methods such as transfer matrix DMRG[23], although at low temperatures it breaks down,\nwith the resources required scaling exponentially with the temperature. In this case, the exponential scaling with\nthe temperature is again related to a linear relationship between a time scale, in this case β = 1/T , and a length\nscale. It can be applied to random systems, where transfer matrix DMRG cannot be used because of a lack of\ntranslation invariance. A good test of variational matrix product[2] methods on this kind of system is lacking, so\nwe cannot compare here. We apply the quantum belief propagation algorithm to two random systems, one without\nfrustration where we can compare to quantum Monte Carlo and one with frustration where Monte Carlo methods are\nnot applicable.\nII.\n\nQUANTUM CIRCUIT METHODS\n\nIn this section we present the various quantum circuit methods. We begin by reviewing previous work, and then\nderive the light-cone quantum circuit algorithm, and apply it to a problem of spin relaxation. We then use previous\nresults on the entanglement entropy growth to estimate the computational resources required for different approaches\n\n\f3\nto this problem, and finally we present the corner transfer quantum circuit method, an extension which allows access\nto global quantities.\nA.\n\nBackground\n\nTo understand our algorithm, we first review the ideas in [7] which gives a construction of a matrix product\noperator approximation to the time evolution operator, exp(−iHt), using resources exponential in t. We consider a\nlocal Hamiltonian\nX\nhi ,\n(1)\nH=\ni\n\nwhere each i acts on sites i, i + 1. This Hamiltonian obeys a Lieb-Robinson bound: given any operator O which has\nsupport on set of sites X, the operator exp(iHt)O exp(−iHt) can be written, with exponentially small error, as an\noperator acting on the set of sites i within distance vLR t of X, where vLR is the Lieb-Robinson group velocity.\nTo simulate the system for a time t, we divide the system into blocks of length l, where l is slightly larger than\n2vLR t (the error in the approximation will be exponentially small in l − 2vLR t). We then let H = H0 + H ′ where H0\nis the sum of the Hamiltonians on each block and H ′ is the Hamiltonian connecting the blocks:\nH0 =\n\nX i≤(k+1)l−1\nX\nk\n\nH′ =\n\nhi ,\n\n(2)\n\ni=kl+1\n\nX\n\nhkl ,\n\n(3)\n\nk\n\nwhere the sum ranges over integers k.\nWe then write\nZ t\n\u0010\n\u0011\nexp(−iHt) = T exp[−i\nexp(−iH0 t′ )H ′ exp(iH0 t′ )] exp(−iH0 t),\n\n(4)\n\n0\n\nwhere T denotes that the exponential is time-ordered. The operator exp(−iH0 t) is equal to the product\nUk is a unitary operator acting on sites kl + 1, kl + 2, ..., kl:\n\nQ\n\nk\n\nUk , where\n\ni≤(k+1)l−1\n\nX\n\nUk = exp(−i\n\nhi t).\n\n(5)\n\ni=kl+1\n\nUsing the Lieb-Robinson bounds, we can approximate exp(−iH0 t′ )hkl exp(iH0 t′ ) by an operator hkl (t′ )loc which\nhas support on sites kl − l/2 + 1, ..., kl + l/2 − 1 for |t′ | ≤ t and for l > vLR t. Then the operator\nRt\nQ\nT exp[−i 0 exp(−iH0 t′ )H ′ exp(iH0 t′ )] can then be approximated by a product k Vk where\nVk = T exp[−i\n\nZ\n\nt\n\nhkl (t′ )loc ].\n\n(6)\n\n0\n\nThe key in this construction is that the intervals kl − l/2 + 1, ..., kl + l/2 − 1 do not overlap for different k. This\nconstruction expresses the time evolution as a quantum circuit:\nY Y\nexp(−iHt) ≈\nVk\nUk .\n(7)\nk\n\nk\n\nThe support of the operators Uk , Vk and the circuit is shown in Fig. 1.\nPrecise error bounds can be given using Lieb-Robinson bounds for the error in Eq. (7). To get an error of order ǫ\nin the propagator (7), we only need to take l = 2vLR t + O(log(N/ǫ)). In what follows, we will not make detailed error\nestimates, since Lieb-Robinson error estimates are fairly simple and are by now standard in the literature; when we say\nthat it suffices to take a length scale \"of order\" vLR t to obtain an approximation to a given local quantity, we mean that\nby taking the length scale vLR t + O(log(N/ǫ)) we can obtain an error of order ǫ in the state; when we are computing\n\n\f4\n\nV1\n4\n\n16\n\nV2\n4\n\n4\n\nU1\n4\n\n1\n\n16\n\n2\n\n4\n\nU2\n4\n\n3\n\n16\n\n4\n\n4\n\n5\n\n16\n\n6\n\nU3\n4\n\n7\n\n4\n\n8\n\n9\n\n16\n\n10\n\n4\n\n11\n\n12\n\nFIG. 1: Support of the operators Uk , Vk and the quantum circuit for N = 12, l = 4. The small numbers at the bottom\nof operators Uk , Vk represent the bond dimensions required to represent these operators as matrix product operators; the\nmaximum product of these across any bond is 16 = 4l/2 .\n\nexpectation values of local quantities, to obtain an error of order ǫ we need a length scale vLR t + O(log(vLR t/ǫ)), so\nthat the error bound does not depend on N in this case.\nSuppose we want to apply the quantum circuit procedure to compute the time evolution of some state Ψ0 . For\nsimplicity, let Ψ0 be a factorized state (later we discuss the case where Ψ0 is a matrix product state both in this\nprocedure and using our algorithm, and we find that using the idea of \"observation\" discussed below the case of\nmatrix product state initial conditions presents no additional difficulty). The operator Uk is an operator acting on 2l\nsites. Any such operator can be written as a matrix product operator with a bond dimension equal to 42l/2 = 22l [19].\nThis maximum bond dimension is achieved halfway across the interval of length 2l, while at any point a distance d\nfrom one of the ends of the interval the bond dimension is only 2d , as shown in Fig. 1.\nThe same holds for Vk , and so the maximum product of bond dimensions across any bond is 22l (a slightly worse\nestimate of 24l was found for this construction in [7] since the fact that the bond dimension may vary with position\nwas not taken into account).\nThere are several problems, however, with implementing the above method in practice, and it is these problems\nwhich we overcome with our methods, the light-cone quantum circuit method and the corner transfer quantum circuit\nmethod. The first method is most appropriate for computing local quantities (such as a spin or energy expectation\nvalue) while the second method is most appropriate for finding a good global approximation to the ground state.\nThe first problem is that operator equations of motion are computationally expensive in practice. To this end, we\nwill modify the procedure to deal only with state vectors, rather than operators. The second problem is that the\nvelocity of the quantum circuit does not obviously match the Lieb-Robinson\nvelocity,\nin the following sense: given\nQ\nQ\narbitrary operators Uk , Vk , supported as described above, the product k Vk k Uk can propagate information by\na distance of 2l in each time step. Since l is roughly vLR t, this means that such a quantum circuit could have an\neffective velocity roughly 2vLR . Of course, the operators Uk , Vk are not arbitrary operators, but still we would like to\nfix this problem; we will show how to do this with the corner transfer quantum circuit method below which also leads\nto improved estimates on the maximum matrix product state dimension needed.\nHowever, the real problem with this method is that it doesn't lead to any improvement over naive simulation when\nit comes to computing local observables. The main problem we consider in this section is the following: we start\na spin chain at time t = 0 in a factorized state Ψ0 , and then evolve under a local Hamiltonian for to a final time\ntf , at which point we wish to compute some local observable, such as Siz , the z-expectation value of spin i. By the\nLieb-Robinson bounds, we can approximate Siz (t) by considering only a subchain of the full chain: we consider only\nsites i − l, ..., i + l, where l is slightly larger than vLR tf . We then define Ψ′ to be the appropriate factorized state\non this subchain and evolve Ψ′ for a time tf using the Hamiltonian H ′ acting on the subchain. We then compute\nhΨ′ | exp(iH ′ tf )Siz exp(−iH ′ tf )|Ψ′ i. Using sparse matrix methods to compute the time evolution of Ψ′ , this requires\na computational effort of order l22l , which scales as 22vLR tf . The quantum circuit method discussed above would also\nrequire simulations on intervals of length 2l, and hence leads to no improvement when computing this local quantity.\n\n\f5\n\nHM\nH'L\n\nH'R\n\nHL\n−l\n\nHR\n\n−l/2\n\n−1 0 1\n\nl/2\n\nl\n\n′\nFIG. 2: Support of the operators HL , HR , HM , HL′ , HR\n.\n\nB.\n\nLight-Cone Quantum Circuit Algorithm\n\nWe now show how to reduce the computational effort to an amount of order 2vLR tf , allowing the time scale to\nbe twice as large, by combining Lieb-Robinson bounds with statistical sampling. While we focus on this section on\nstarting in a factorized state, we later discuss the case of starting in a matrix product state.\nWe now derive our algorithm, which we call the light-cone quantum circuit method as it avoids keeping track of\ncertain degrees of freedom outside the light-cone by making certain \"observations\" to reduce the computational effort.\nWe first define a subchain of length 2l + 1 and an initial state Ψ′ on that subchain as above. We label the sites in the\nsubchain by −l, ..., 0, ..., +l. We let H ′ be the Hamiltonian on the subchain and we write\nH ′ = HL + HR + HB ,\n\n(8)\n\nwhere HL acts on the left half of the chain (sites −l, ..., −1), HR acts on the right half of the chain, and the boundary\nHamiltonian HB acts on sites −1, 0, 1. Thus, [HL , HR ] = 0. We define HM to act on the middle half of the chain: it\nis supported on sites −l/2, ..., +l/2 (we pick l even for simplicity). See Fig. 2.\nUsing the Lieb-Robinson bounds in the same way as in the quantum circuit method above we can approximate the\ntime evolution for a time ti = tf /2 by:\nΨ′ (tf /2) = exp(−iH ′ tf /2)Ψ′ ≈ exp(−iHM tf /2) exp[−i(HM − HB )tf /2] exp[iHL tf /2] exp[iHR tf /2]Ψ′ .\n\n(9)\n\nNote that the decomposition (9) is only good for times of order tf /2. We wish to compute the expectation value of\nS0z , or any other observable on site 0, at time tf . Again using the Lieb-Robinson bounds, the expectation value of\nthis is approximately equal to\nhΨ′ (tf /2)| exp(iHM tf /2)O exp(−iHM tf /2)|Ψ′ (tf /2)i.\n\n(10)\n\nCombining Eqs. (9,10) and our use of the Lieb-Robinson bounds to approximate the expectation value of O on the\nfull chain by its expectation value on the subchain, we have\nhΨ0 |O(t)|Ψ0 i ≈ hΨ̃|O|Ψ̃i,\n\n(11)\n\nΨ̃ = exp(−iHM tf /2)Ψ′ ≈ exp(−iHM tf ) exp[−i(HM − HB )tf /2] exp[iHL tf /2] exp[iHR tf /2]Ψ′ .\n\n(12)\n\nwhere\n\n′\n′\nThe operator HM − HB is a sum of two operators, HL′ and HR\n, where HL′ acts on sites −l/2, ..., −1 and HR\nacts on\nsites +1, ..., +l/2. Therefore,\n\u0010\n\u0011\u0010\n\u0011\n′\nΨ̃ = exp(−iHM tf /2)Ψ′ ≈ exp(−iHM tf ) exp[iHL′ tf /2] exp[−iHL tf /2] exp[iHR\ntf /2] exp[−iHR tf /2] Ψ′ .\n(13)\n\nEq. (13) is not yet useful computationally, since it will require an effort of order ltf 22l to compute the evolution of\nthe state Ψ′ . We now describe the light-cone quantum circuit method to compute the expectation value: first, write\nΨ′ = ΨL ⊗ ΨC ⊗ ΨR ,\n\n(14)\n\n\f6\nwhere ΨL , ΨR are states on the left and right half of the chain, and ΨC is a state on the center site. We compute the\nstates\n\u0011\nΨ′L = (exp[iHL′ tf /2] exp[−iHL tf /2] ΨL ,\n(15)\nand\n\u0011\n′\nΨ′R = (exp[iHR\ntf /2] exp[−iHR tf /2] ΨR ,\n\n(16)\n\nwhich requires an effort of order ltf 2l . Next, we introduce a complete orthonormal basis of states on the sites\n−l, ..., −l/2 − 1, which we label φL (α), and another a complete basis of states on sites l/2 + 1, ..., +l labelled φR (α).\nThen we decompose Ψ′L and Ψ′R as:\nX\nΨ′L =\nA(α)φL (α) ⊗ ξL (α),\n(17)\nα\n\nΨ′R\n\n=\n\nX\nα\n\nA(α)φR (α) ⊗ ξR (α),\n\nwhere ξL (α) is some normalized state on sites −l/2, ..., −1 and ξR (α) is some normalized state on sites +1, ..., +l/2.\nThe states φL (α) need not be eigenvectors of any reduced density matrix and the states ξL (α) need not be orthogonal\nto each other, as Eq. (17) is not a Schmidt decomposition. Thus, from Eqs. (13,15,16,17),\nXX\n|A(αL )|2 |A(αR )|2 E(O, αL , αR ),\n(18)\nhΨ̃|O|Ψ̃i =\nαL αR\n\nwhere\nE(O, αL , αR ) = hξL (αL ) ⊗ ΨC ⊗ ξR (αR )| exp(iHM tf )O exp(−iHM tf )|ξL (αL ) ⊗ ΨC ⊗ ξR (αR )i.\n\n(19)\n\nEq. (18) is at the heart of the light-cone quantum circuit approach. Numerically we proceed as follows: first, we\ncompute |A(αL )|2 and |A(αR )|2 for all αL , αR . This requires an effort of order 2l . We then do a statistical sampling:\nwe randomly pick an αL and an αR according to the probability distributions |A(αL )|2 and |A(αR )|2 , and compute\nthe average E(O, αL , αR ). We repeat this procedure many times, to average over different choices of αL , αR .\nThe computational effort required then scales as only l2l , or roughly t2vLR t as claimed. Asymptotically this allows\ndouble the time. The time scales linearly in the number of iterations of statistical sampling, which we denote Nit .\nHowever, if O has bounded operator norm, then E(O, αL , αR ) has bounded moments, and so by the central limit\ntheorem, the number of iterations required still scales only polynomially in the error.\nC.\n\nResults on Non-Equilibrium Dynamics\n\nWe now discuss results from this method, as well as some implementation details. We consider evolution under the\nXXZ Hamiltonian\nX\ny\nx\nz\n(Six Si+1\n+ Siy Si+1\n+ ∆Siz Si+1\n).\n(20)\nH=\ni\n\nFor ∆ = 0, this problem can be mapped to free fermions by a Jordan-Wigner transformation and solved exactly. We\nuse this as a check on our results later.\nWe used as a starting point the Neel state, with spins alternating up and down, and we computed the time\ndependence of S z (t) for the central spin. The main numerical effort is to compute the evolution of a state under\na Hamiltonianm, which we did using a combination of short steps with a series method. For example, to compute\nexp(−iHL t)ΨL we divide the time t into shorter intervals of time t0 , and compute exp(−iHL t0 )ΨL = ΨL − it0 HL ΨL −\n(t20 HL2 /2!)ΨL + ..., keeping a fixed number of terms in this series. We then repeat this procedure (t/t0 ) times. To\nobtain negligible error for a chain of 20 sites with t0 = 1 required going to roughly 40-th order for |∆| ≤ 1, while for\n∆ = 2 slightly longer series were required. A more sophisticated way of doing the time evolution would be to build\na tridiagonal Hamiltonian in the Krylov space spanned by ΨL , HL ΨL , ..., HLk ΨL for some k, and then evolve exactly\nwith this Hamiltonian[25].\nAnother important point of numerical simulation is the use of symmetries. We can choose the states φL (α) and\nφR (α) to be eigenstates of total S z . Then, since the state Ψ′ is an eigenstate of total S z , the state ξL (αL )⊗ΨC ⊗ξR (αR )\n\n\f7\nis also an eigenstate of total S z , which allows us to use symmetries when computing the evolution of the state. Since\nmost of the numerical time is consumed statistically sampling E(O, αL , αR ), we build the sparse matrix for the\nHamiltonian HM in each spin sector once, before doing the sampling, and then run the sampling.\nIt is also possible, although we did not implement it, to take into account reflection symmetry. Since αL and αR\nare chosen independently, the state ξL (αL ) ⊗ ΨC ⊗ ξR (αR ) does not have reflection symmetry. However, if both the\nHamiltonian HM and the operator O = Siz have reflection symmetry, then it is useful to write\nξL (αL ) ⊗ ΨC ⊗ ξR (αR ) = ΨS (αL , αR ) + ΨA (αL , αR ),\n\n(21)\n\nwhere ΨS , ΨA are symmetric and anti-symmetric states. Then,\nE(O, αL , αR ) =\n\nhΨS (αL , αR | exp(iHM t)O exp(−iHM t)|iΨS (αL , αR )i\n+ hΨA (αL , αR | exp(iHM t)O exp(−iHM t)|iΨA (αL , αR )i,\n\n(22)\n\nand so we can statistically sample one of the two terms on the right-hand side of Eq. (22). Note that on each iteration\nwe randomly choose an αL and an αR and then randomly choose a term in Eq. (22), rather than repeatedly sampling\nEq. (22).\nAs the algorithm is described above, the initial computation of the states ΨL (α) and ΨR (α) depends on the final\ntime. For each final time t, we have to compute a new set of states ΨL (α) and ΨR (α) and then do the statistical\nsampling. However, in fact, we can speed the algorithm up at a slight cost in accuracy: we fix a given tf and on each\nstatistical sample we compute the state\nexp(−iHM tf )|ξL (αL ) ⊗ ΨC ⊗ ξR (αR )i,\n\n(23)\n\nto evaluate the expectation value in Eq. (19). We then act on this state with the operator exp(iHM δt) for some small\nδt. We then use this new state to compute an approximation to the expectation value at time tf − δt. We then act\non that state with exp(−iHM δt) to compute an approximation to the expectation value at time tf − 2δt, and so on.\nSince the computational cost of performing the time evolution of a state under a Hamiltonian is proportional to the\ntime evolved, these additional steps are relatively cheap, for δt << tf . There is a small cost in accuracy: in general,\nto compute expectation values at a time t, we can do the initial evolution for a time ti , and then evolve further for\ntime t − ti . To make the effect of boundary conditions as small as possible, we would like to have both ti and t − ti\nas small as possible, which is why above we chose to evolve for a time ti = tf /2. However, if δt << tf , then we are\nnot far away from the ideal choice of ti by initially evolving for time tf /2 and then evolving for time tf /2 − δt. We\nfollowed this procedure in the numerical work below, with δt = 0.25 and taking tf to be spaced with integer steps\nusing t0 = 1. This accounts for some of the slight kinks in the curves after every integer value of t.\nThe spin-wave velocity of Hamiltonian (20) for ∆ ≤ 1 is given by\nvsw = (π/2) sin(θ)/θ,\n\n(24)\n\nwhere cos(θ) = ∆[24]. On the other hand, in the development above, we used a Lieb-Robinson velocity vLR , where\nvLR ≥ vsw .\n\n(25)\n\nUsing the Lieb-Robinson bounds, we showed that we could accurately simulate for a time t using length scales l = vLR t.\nAs mentioned above, we do not give precise error estimates, but it is not hard to give rigorous estimates of the error.\nHowever, the Lieb-Robinson bound is actually fairly conservative because of Eq. (25), and thus in practice length\nscales vsw t suffice to get good results.\nWe begin by illustrating results for the XY chain, with ∆ = 0. In Fig. 3, we illustrate results from exact simulations\nof the XY chain for various sizes. We consider chains with open boundary conditions with N = 35, 51, 101 and a\nchain with periodic boundary conditions with N = 36. For the chains with open boundary conditions, we plot the\naverage of the central spin as a function of time, while for the periodic boundary conditions we plot the average of\nan arbitrarily chosen spin as a function of time. The large exact simulations are possible because this chain can be\nmapped to free fermions by a Jordan-Wigner transformation. Later we will present comparison of these results to\nlight-cone quantum circuit results. For now, we discuss aspects of Fig. 3 which show the influence of boundary effects.\nIn the range of times, the chain with N = 101 shows no √\neffect of the boundary. There are oscillations of the spin with\nfrequency ω roughly 2, with an envelope decaying as 1/ t so as\n1\nhSiz i ∼ √ cos(ωt + θ0 ),\nt\n\n(26)\n\n\f8\n\nN=101\nN=51\nN=35\nN=36\n\n0.2\n\n0\n\nz\n\n<S > for central spin\n\n0.4\n\n-0.2\n\n-0.4\n0\n\n5\n\n10\n\n15\n\n20\n\n25\n\n30\n\nTime\nFIG. 3: Time dependence of hS z i for the central spin as a function of time. Curves are N = 101 (black), N = 51 (red), N = 35\n(green), and N = 36 (blue).\n\nfor θ0 ≈ (3/4)π. Simulations on longer chains show that as long as N is less than t/2, the decaying oscillations of\nEq. (26) continue to hold. In regard to the 1/t1/2 decay of oscillations found here numerically, it is interesting to note\na similar power-law decay found for a different system of free bosons, where fluctuations about a maximal entropy\nstate were proven to decay at least as fast as 1/t1/3 [21].\nFor N larger than t/2, the boundary conditions become important, as one can see in the curves for N = 35 and\nN = 51, which start to show deviations from the N = 101 curve for times roughly 16 and 22 respectively. This is no\nsurprise, since the distance between the central spin and the boundary is N/2, and vsw = 1 for ∆ = 0. We will see\nlater for ∆ 6= 0 that in general boundary effects become important for N/2 = tvsw . Interestingly, periodic boundary\nconditions offer no improvement, since the N = 36 periodic curve deviates at the same time as the N = 35 open\ncurve.\nAnother interesting effect is that once the boundary conditions become important, the expectation value shows\nwild oscillations, which no longer decrease in magnitude. This may be a consequence of the fact that the chain is\nintegrable. It would be interesting to see for a non-integrable system whether such oscillations occur or not; the\nsimplest statistical assumption for a non-integrable system is that the state at long times would be a random pure\nstate satisfying the conservation laws of total S z and total energy, and thus the expectation value of hSiz i for any i\nwould show only exponentially small fluctuations about the average spin.\nWe now consider the application of the light-cone quantum circuit method to this chain. We considered l = 18 and\n20, and did Nit = 1000 iterations of statistical sampling, as shown in Fig. 4. The results for exact simulations with\nN = 35 and N = 101 are also shown for comparison. We see that the light-cone quantum circuit method with l = 18\nis accurate over the same range of times as the exact simulation with N = 35, while the light-cone quantum circuit\nmethod with l = 20 improves on this result. By increasing l from 18 to 20, we increase the range of times by roughly\n2, while increasing N by 2 would increase the range of times by only 1.\nThere are statistical fluctuations in the light-cone quantum circuit results in Fig. 4, due to random fluctuations in\nE(O, αL , αR ) for different choices of αL , αR . In Fig. 5 we plot the rms fluctuation in E(O, αL , αR ) as a function of\ntime, sampling this expectation value with the probability distribution |A(αL )|2 |A(αR )|2 . √The results in Fig. 4 are an\naverage over Nit = 1000 samples, so the spread on each data point in Fig. 4 is equal to 1/ 1000 times the fluctuation\nshown in Fig. 5, or roughly 0.005 in the worst case. A very interesting point is that for t ≤ 5, the rms fluctuation is\nnegligible, while for times t ≥ 9, the rms fluctuations are up to their full value, with a sharp bend in the curve (plotted\non a log scale) around t = 8 or t = 9. This is a consequence of the maximum spin-wave velocity: the influence of the\nregions on sites −l, ..., −l/2 and +l/2, ..., +l takes a time of order l/2vsw to reach the central region. There are sill\nsome fluctuations for t ≤ l/2vsw = 9, but they decay rapidly until they are negligible at very short time.\n\n\f9\n\nN=101\nl=18\nN=35\nl=20\n\n0.2\n\n0\n\nz\n\n<S > for central spin\n\n0.4\n\n-0.2\n\n-0.4\n0\n\n5\n\n10\n\n15\n\n20\n\nTime\nFIG. 4: Time dependence of hS z i for the central spin as a function of time for ∆ = 0. Exact curves are N = 101 (black) and\nN = 35 (green). Light-cone quantum circuit curves are l = 18 (red) and l = 20 (blue).\n\n1\n\nRMS fluctuations in E\n\n0.1\n0.01\n0.001\n0.0001\n1e-05\n1e-06\n1e-07\n0\n\n5\n\n10\n\n15\n\n20\n\nTime\nFIG. 5: RMS fluctuations in E(O, αL , αR ) as described in text as a function of time for l = 18.\n\nWe then applied the light-cone quantum circuit method to chains with ∆ = 0.5, 1, 2 as shown in Figs. 6,7,8. For\ncomparison, we show an exact simulation of a chain with N = 20. For larger ∆ = 0.5, 1 we still see decaying\noscillations, but the decay is much more rapid than for ∆ = 0. The decay of the envelope is, very roughly, t−1.25\nfor ∆ = 0.5. For ∆ = 2, no oscillations are seen. The effects of statistical noise are much more noticeable, since\nthe magnitude of the spin is much less. All simulations were done with Nit = 1000 statistical samples, except the\nsimulation with ∆ = 0.5, l = 22 has only Nit = 250 samples, and the simulations with ∆ = 1, l = 16 and ∆ = 1, l = 18\n\n\f10\n\nexact, N=20\nl=18\nl=20\nl=22\n\n0\n0.05\n\n-0.2\n\nz\n\n<S > for central spin\n\n0.2\n\n0\n\n-0.4\n-0.05\n10\n\n0\n\n20\n\n15\n\n10\n\n5\n\n15\n\n20\n\nTime\nFIG. 6: Time dependence of hS z i for the central spin as a function of time for ∆ = 0.5. Exact curve is N = 20 (black).\nLight-cone quantum circuit curves are l = 18 (red), l = 20 (blue), and l = 22 (green).\n\nhad Nit = 10000 and Nit = 3000 samples respectively. The spin-wave velocity is larger for these chains, so the\nsimulation breaks down at an earlier time than for ∆ = 0; we again see that the simulations work for\nt<\n∼ N/(2vsw ),\n\n(27)\n\nt<\n∼ l/vsw ,\n\n(28)\n\nor\n\nin the exact and light-cone methods respectively.\nD.\n\nEntanglement Entropy\n\nFrom the predictions in [18] and the numerical work in [17], we can compare the difficulty of doing a similar\ncalculation doing time-dependent DMRG or time evolving bond decimation. The entanglement entropy is predicted\nto grow linearly in time. In [17], the prefactor of the numerical growth was determined in a quench of an XXZ chain\nfrom an Ising coupling with ∆ = ∆0 to an Ising coupling with strength ∆1 . The prefactor depended on ∆0 and was\nlargest in the case of ∆0 = ∞, the case we have considered here where the initial condition is a Neel state. There,\nin a quench to ∆0 = 0, the entanglement entropy (with logs taken to base 2) was observed to grow a little faster\nthan 0.6vsw t. This implies that the minimum size of the bond dimension needed in a matrix product state is at least\n20.6vsw t , which requires an effort going as 21.8vsw t . In contrast, the numerical effort required to directly simulate a\nchain of length N scales as 2N . To get accurate results for a time of order t, requires N = 2vsw t, or an effort 22vsw t .\nUsing the techniques in the present paper, the effort can be reduced to of order 2vsw t .\nWhen comparing to [17], note that there is a difference in normalization of the Hamiltonian by a a factor of 4,\nbut since the results in [17] are expressed in terms of the spin-wave velocity multiplied by time, the time axis is the\nsame for ∆ = 0. For ∆ > 0, the time axis in [17] differs from the time axis here, since [17] multiplies the time by the\nrelevant spin-wave velocity which is greater than unity. For ∆ = 1, the\n√ spin-wave velocity using our normalization is\nequal to π/2 > 1, and for ∆ = 0.5 the spin-wave velocity is equal to 3 3/4, so the times in the present paper should\nbe multiplied by such a factor greater than unity when comparing to [17].\nIn [17], other initial conditions were considered, other than just the Neel state. These initial conditions were chosen\nto be the ground state of various other XXZ Hamiltonians. As the initial ∆ was reduced, the entropy growth was\n\n\f11\n\n0.5\n0.02\n\nexact, N=20\nl=16\nl=18\nl=20\n\n0.4\n\nz\n\n<S > for central spin\n\n0.01\n\n0.3\n0\n\n0.2\n-0.01\n\n0.1\n-0.02\n\n10\n\n5\n\n0\n-0.1\n0\n\n10\n\n5\n\n15\n\nTime\nFIG. 7: Time dependence of hS z i for the central spin as a function of time for ∆ = 1. Exact curve is N = 20 (black). Light-cone\nquantum circuit curves are l = 16 (red), l = 18 (green), and l = 20 (blue).\n\nfound to still be linear in time, but with a smaller prefactor. Such simulations could still be carried out with our\nmethod as follows: first, use DMRG as done in [17] to find the ground state on a long chain. Then, suppose we are\ninterested in local observable on a region of length l0 . To find how these evolve a time t after a quench, locate some\nregion of length l0 + 2vt in the chain.\nWe then \"observe\" the state of the system outside this region to statistically sample different pure states within\nthe region, and then evolve the pure states within the region. This is done as follows. The DMRG ground state can\nbe written in the form\nX\nβ\nαβ\nΨ0 =\n(29)\nAαβ |Ψα\nL i ⊗ |ΨM i ⊗ |ΨR i,\nαβ\n\nβ\nwhere |Ψα\nL i are a set of orthonormal states on the chain to the left of the region, |ΨR i are a set of orthonormal states\nαβ\nto the right of the region, ΨM are a set of states (normalized to unity but not necessarily orthogonal) on the given\nregion of length l0 + 2vt, and Aαβ are a set of amplitudes. We choose an α and a β according to the probability\n\nP = |Aαβ |2 ,\n\n(30)\n\nand then evolve the state Ψαβ\nM using our present algorithm. This corresponds to observing the matrix product state\nβ\nα\nin the basis |ΨL i ⊗ |ΨR i. Repeating this statistical sampling many times we obtain the desired quantities on the local\nregion. Note that on each iteration we statistically sample α, β as well as doing the sampling above. The statistical\nsampling of the state outside the region may be justified using Lieb-Robinson bounds as before. Further, when a\nmatrix product state is written in the canonical form, the bond variables naturally have the orthonormality property\nused above to do the statistical sampling, giving a state in the form (29).\nIn some cases, if the entanglement entropy grows linearly in time but with a sufficiently small prefactor, it may be\nworth using the light-cone ideas above, but doing the initial evolution for a time ti using matrix product methods\ninstead of quantum circuit methods, as follows. Suppose the matrix product methods require an effort t2 2f t , for some\nnumber f , to simulate for a time t. Then, to compute an observable at time tf , we simulate a subchain of length\n2vsw tf for a time ti using matrix product methods. We then statistically sample states on a smaller subchain of\nlength 2vsw (tf − ti ) and perform the simulation of that subchain for time tf − ti exactly. The total effort is then\nt2 O(2f ti + 22vsw (tf −ti )).\n\n(31)\n\n\f12\n\n0.5\n0.1\n\nexact, N=20\nl=18\nl=20\n\n0.3\n\n0.2\n\nz\n\n<S > for central spin\n\n0.4\n\n0\n\n0.1\n\n0\n\n0\n\n0\n\n10\n\n5\n\n10\n\n5\n\n15\n\nTime\nFIG. 8: Time dependence of hS z i for the central spin as a function of time for ∆ = 2. Exact curve is N = 20 (black). Light-cone\nquantum circuit curves are l = 18 (red) and l = 20 (green).\n\nChoosing ti = tf /(1 + f ) to minimize the computational cost, we find that the cost scales as\nt2 O(2f\n\n′\n\ntf\n\n),\n\n(32)\n\n1\n.\n+ (2vsw )−1 )\n\n(33)\n\nwith\nf′ =\n\nE.\n\nf −1\n\nThe Corner Transfer Quantum Circuit Method\n\nIn this subsection we introduce the corner transfer quantum circuit method. It is primarily of theoretical, rather\nthan practical interest. For calculation of local quantities (such as the expectation value of the spin on a single site)\nthe light-cone method above is less work. However, the corner transfer method does give an approximation to the\nfull wavefunction, and may be less work than variational matrix product methods in cases where the entanglement\nentropy grows rapidly.\nWe now define the quantum circuit that approximates exp(−iHt). We define a length scale l′ << vLR t: the error\nin our quantum circuit approximation to exp(−iHt/2) will be exponentially small in l′ , while the maximal velocity\nof information propagation for our quantum circuit will be\nvmax = vLR + O(l′ /vLR t).\n\n(34)\n\nWe construct the quantum circuit in two steps, first presenting a quantum circuit that approximates exp(−iHt/2).\nWe introduce operators Uk that describe the time evolution under a time dependent Hamiltonian: each Uk contains at\na time t only the interaction terms which are contained within one of the triangles with a flattened top and jagged sides\nsurrounded by a dashed line shown in in Fig. 9(a). That is, we break the time t/2 into n0 = ⌈vLR (t/2)⌉ subintervals\nof time at most 1/vLR . We place the center of the triangles on sites kl, for k integer, where\nl = 2l′ + vLR t.\n\n(35)\n\n\f13\n\nA)\nU\n\nU\n\n1,0\n\n1,1\n\nU 1,2\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\nB)\n\nC)\n\nU\n\nV\n\nU\n\nV\n\nU\n\nV\n\nFIG. 9: (a) The dashed lines show the region of space-time used in defining operators Uk , with space on the horizontal axis\nand time on the vertical axis. Only three such regions are shown, but the pattern repeats over the entire system. We also show\nthis as a quantum circuit writing U1 = U1,0 , U1,1 , U1,2 where each operator U1,n computes the exponential of the Hamiltonian\nin a given time slice. Construction is shown for l′ = 2, n = 3. (b) Action of operators Vk as discussed in text. (c) Iterating\nmany rounds of the corner transfer quantum circuit. On the bottom row we label U and V ; on the row above, a Ũ sits above\neach V and a Ṽ above each U .\n\nThen we define Uk,n for 0 ≤ n ≤ n0 − 1 by\ni≤kl+l′ /2+n\n\nUk,n = exp[−i\n\nX\n\nhi (t/2n0 )],\n\n(36)\n\ni=kl−l′ /2−n\n\nand define\nUk = Uk,0 Uk,1 Uk,2 ...Uk,n0 −1 .\n\n(37)\n\n\f14\nWe then define the operators Vk as follows. We define\nkl\nX\n\nL\nUk,n\n= exp[−i\n\nhi (t/2n0 )],\n\n(38)\n\ni=kl−l′ /2−n\nkl+l′ /2+n\nR\nUk,n\n\n= exp[−i\n\nX\n\nhi (t/2n0 )].\n\ni=kl\nL,R\nThat is, Uk,n\nrepresent evolution under the left or right half of the triangles in in Fig. (9(a). Then, we define\n(k+1)l+l/2−1\n\nVk = exp(−i\n\nX\n\ni=(k+1/2)l−l/2+1\n\n\u0010\n\u0011† \u0010\n\u0011†\nR\nR\nR\nL\nL\nL\nhi t/2) Uk,0\nUk,1\n...Uk,n\nUk+1,0\nUk+1,1\n...Uk+1,n\n.\n0 −1\n0 −1\n\n(39)\n\nThat is, each Vk \"undoes\" the evolution in the shaded triangles as shown in Fig. 9(b), and then performs the full\nevolution in the rectangle bordered by the solid line.\nWe now approximate\nY Y\nexp(−iHt/2) ≈\nVk\nUk .\n(40)\nk\n\nk\n\nUsing Lieb-Robinson bounds, one can show that the error in this approximation is\nY Y\nX\nk exp(−iHt/2) −\nkhi k exp(−O(l′ )).\nVk\nUk k ≤ O(t\nk\n\n(41)\n\ni\n\nk\n\nIn the second step of construction the corner transfer quantum circuit, we define another approximation to\nexp(−iHt/2). We set\ni≤(k+1/2)l+l′ /2+n\n\nŨk,n = exp[−i\n\nX\n\nhi (t/2n0 )],\n\n(42)\n\ni=(k+1/2)l−l′ /2−n\n\nand define\nŨk = Ũk,0 Ũk,1 Ũk,2 ...Ũk,n0 −1 .\n\n(43)\n\nHere, the centers of the upward facing triangles in Fig. 9(a) are shifted by l/2, compared to (37). We then define Ṽk\nin analogy to Eq. (39) with the centers again shifted by l/2 and approximate\nY Y\nexp(−iHt/2) ≈\nṼk\nŨk .\n(44)\nk\n\nk\n\nIn Fig. 9(c) we show multiple rounds of the quantum circuit. Except for the row of triangles on the top and bottom\nboundaries, the quantum circuit looks like diamond-shaped patches in space time. They are rotated 45-degrees from\nthe patches in [7], justifying the name \"corner transfer\"; the 45-degree rotation is the key improvement over [7] leading\nto the bound on information propagation (34).\nIII.\n\nQUANTUM BELIEF PROPAGATION\n\nIn this section we apply quantum belief propagation to disordered systems. We begin with a brief review of quantum belief propagation, focusing on the computational effort required, and then discuss modifications for disordered\nsystems. We applied this procedure to two different disordered systems: one a chain with no frustration where Monte\nCarlo is available for comparison[29], and the other a frustrated spin system with disorder[30].\nQuantum belief propagation[22] is a method for constructing a matrix product density operator for a thermal\nstate of a quantum system on a line or other loopless lattice. The algorithm depends on a parameter l0 and the\napproximation to the thermal state has the form in one dimension of:\n\u0011\n\u0011 \u0010\n\u0010\n†\n† †\n(45)\nO\nO\n...O\nρ\nρ = ON\n...O\nO\n1 2\nN −l0 +1 ,\n0\n2 1\n−l0 +1\n\n\f15\nwhere the operators Oi act on sites i, ..., i + l0 − 1 and the density matrix ρ0 has the form ρ0 = ρ01...l0 ⊗ 11 ⊗ ... ⊗ 11,\nwith ρ01...l0 being a density matrix on sites 1...l0 . The implementation of the algorithm depends on tracing out sites,\na process analogous to the observations discussed above. Suppose we wish to compute the partition function. If all\nof the Oi are the same, as they would be in a system without disorder, then we can consider the completely positive\nmap\nρ → tr1 (Oi† ρOi ) ⊗ 11),\n\n(46)\n\nwhere tr1 (...) denotes a trace over the first site, and ρ is a density operator on an interval of length l0 . We start with\nthis map at ρ = ρ0 , and iterate it until we reach the end of the chain. We then compute the trace of the final ρ and\nthis is the of the partition function. A similar procedure can be applied to compute expectation values.\nThe cost of the procedure scales exponentially in l0 , as it requires diagonalizing matrices of dimension 2l0 [26]. The\nprocedure is effective down to inverse temperatures\nβ ∼ l0 /vLR .\n\n(47)\n\nThe physical intuition is that the algorithm keeps quantum effects only up to a length scaling l0 . However, as we will\nsee, the algorithm is capable of keeping track of classical correlations on much longer length scales; this should be no\nsurprise\nP sincez for classical Hamiltonians which are the sum of commuting operators, such as the Ising Hamiltonian\nH = i Siz Si+1\n, quantum belief propagation exactly reproduces classical transfer matrix methods which can exhibit\ncorrelation lengths exponentially large in β.\nFor a disordered system, the operators Oi may vary as a function of i, but they depend only on the bonds on sites\ni...i + l0 − 1. Below, we consider a system in which the bonds can assume only discrete values; in the first system\nthere are 2 * 2(l0 −1)/2 different possible choices for the set of bonds on sites i...i + l0 − 1 while in the second there are\n2l0 −1 possible choices. We then use the following algorithm: first, we pre-compute the operator O for each possible\nchoice of bonds. We then randomly generate a configuration of bonds, and iterate the map (46) above, choosing the\nappropriate O at each step. This requires an effort which scales linearly in system size.\nInterestingly, the algorithm seems to work better at low temperatures on disordered systems than on ordered\nsystems. The reason is probably the following: when deriving the algorithm in [22], we used Lieb-Robinson bounds\nwith velocity vLR . However, just as in the non-equilibrium case above where the actual velocity vsw is less than vLR ,\nin these thermal systems the actual velocity may again be less than vLR . For systems with disorder, localization\neffects may further reduce the velocity, and even change the ballistic spreading of the wavepacket to a slower growth.\nInterestingly, this phenomenon is known by different names in condensed matter, where it is called many-body\nlocalization[27], and quantum information theory, where it is called a Lieb-Robinson bound for a disordered system[28].\nA.\n\nResults on Disordered Systems\n\nThe first disordered system we considered has the Hamiltonian\nN/2\n\nN/2\n\nH=\n\nX\ni=1\n\n~2i−1 * S\n~2i +\nJS\n\nX\ni=1\n\nJi S2i * S2i+1 ,\n\n(48)\n\nwhere each spin is spin-1/2, J > 0 and Ji = JF < 0 with probability p and Ji = JA > 0 with probability 1 − p.\nThis model has both ferromagnetic and anti-ferromagnetic couplings, and was proposed to model the compound\n(CH3 )2 CHN H3 Cu(Clx Br1−x )3 , where the probability p = x2 [33, 34, 35, 36, 37]. The case considered is J = 1 and\n|Ji | = 2. We performed simulations on this chain with l0 = 5, 7, 9 for p = 0.2, 0.4, 0.6, 0.8 and for l0 = 5, 7, 9, 11 for\np = 0, 1. For the random cases (p = 0.2, 0.4, 0.6, 0.8) we considered chains of 100000 sites and computed the uniform\nsusceptibility by the change in partition function in response to a weak applied field. In this way, the susceptibility\nwas self-averaging. For the pure cases, we considered shorter chains, and computed the applied susceptibility by\nmeasuring partition functions as in [22]. The results are shown in Figs. 10,11. For small l0 , qualitatively wrong results\nare seen at low temperature, with the susceptibility diverging at low enough temperature. However, as l0 is increased,\nthe accuracy extends to lower temperature. The difference between the curves for l0 = 7 and l9 =9 is small for T\ngreater than roughly 1/7. In this region also, we agree well with Monte Carlo data.\nData was taken over several different β, with a step of 0.25 in β. As in [22], we set the perturbation A (following\nnotation of [22]) to equal (1/2)(hl0 −2,l0 −1 + hl0 −1,l0 ) rather than A = hl0 −1,l0 .\nThe second model we considered is [30] a model with frustration and disorder, where quantum Monte Carlo results\nare not available. The study in [30] was motivated by experimental studies on CuGeO3 [31] and Cu6 Ge6 O18 −xH2 0[32],\n\n\f16\n\nχu, p=0\n\n0.08\n0.06\n0.04\n\nχu, p=.8\n\nχu, p=1\n\n0.02\n0\n0\n0.3\n0.25\n0.2\n0.15\n0.1\n0.05\n0\n0\n0.4\n0.35\n0.3\n0.25\n0.2\n0.15\n0.1\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nT=1/β\n\nFIG. 10: Uniform susceptibility as a function of temperature for different p, l0 . Top: l0 = 5 (black), l0 = 7 (red), l0 = 9 (green).\nMiddle: l0 = 5 (black), l0 = 7 (red), l0 = 9 (green), l0 = 11 (blue). Bottom: l0 = 5 (black), l0 = 7 (red), l0 = 9 (green), l0 = 11\n(blue).\n\nwhere second neighbor interactions may be important. We were interested in a case where second neighbor interactions\nwould be very important, so we considered the Hamiltonian\nH=\n\nN\n−1\nX\ni=1\n\n~i * S\n~i+1 +\nJi S\n\nN\n−2\nX\ni=1\n\n~i * Si+2 ,\nKi S\n\n(49)\n\nand in the pure case we considered Ji = 1, K1 = 1/2. This is a Majumdar-Ghosh chain with a dimerized ground\nstate. In the disordered case we chose Ji = 0.9 or Ji = 1.1, with probability 1/2 of either choice (similar results were\nfound for choosing J = 0.75 or J = 1.25). We choose\nKi = (1/2)Ji Ji+1 ,\n\n(50)\n\nwhich correlates the second neighbor interaction with the nearest neighbor interaction as described in [29].\nWe studied l0 = 5, 7, 9 with chains of length 19999. It is necessary to take such long chains in the pure case to\navoid boundary condition effects because at low temperatures in the pure system there is an exponentially increasing\ncorrelation length for dimer-dimer correlations. In Fig. 12) we first show the results of the specific heat as a function\nof β for the pure case, computed from the second derivative of the partition function (probably a very slightly more\naccurate method is to take the first derivative of the energy as in [22]). A strong difference is seen between l0 = 5 and\nl0 = 7 above β ∼ 3.25, but the l0 = 7 and l0 = 9 curves are almost identical. This indicates that by going to l0 = 9\nwe have succeeded in converging the specific heat in l0 for β ≤ 10.\nThe uniform susceptibility shows a similar effect. The pure curves show a large difference between l0 = 5 and\nl0 = 7, 9, but only slight difference can be seen between l0 = 7, 9 and only above β = 8. Again, the results seem to be\nconverged in l0 by going to l0 = 9 in the range of temperatures we consider. The disordered curves show again that\nl0 = 5 is too small, but for l0 = 7, 9 little difference is seen (except for some small random fluctuations) up to β = 10.\nA very slightly higher susceptibility is seen in the random case compared to the pure case. Finally, we consider the\ndimer susceptibility, defined by\n\u00112\n\u0010N/2−1\nX\n~2i * S\n~2i+1 − S\n~2i+1 * S\n~2i+2 i.\nS\nχdimer = βh\ni=1\n\n(51)\n\n\fχu, p=.2\n\n17\n\n0.4\n0.2\n0\n\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nχu, p=.4\n\n0.6\n0.4\n0.2\n\nχu, p=.6\n\n0\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\nT=1/β\n\nFIG. 11: Uniform susceptibility as a function of temperature for p = 0.2, 0.4, 0.6 from top to bottom and for l0 = 5 (black),\nl0 = 7 (red), l0 = 9 (green).\n\nThis shows a large difference between the pure and disordered cases. The pure cases again show agreement between\nl0 = 7, 9 and show an an increase that gives χdimer /β growing exponentially in β. The disordered cases show χdimer /β\nsaturating as a function of β.\nThe saturation of the dimer-dimer correlation function in the disordered case is no surprise. The disorder locally\nbreaks the Z2 symmetry between different ordering patterns of the dimers, and is relevant for this one dimensional\nsystem. The fact that the uniform susceptibility shows only very slight difference between pure and disordered systems\nis more surprising; asymptotically, the uniform susceptibility should decay exponentially in β in the pure system and\nshould increase as β/ log2 (β) in the random singlet phase[30].\nIV.\n\nDISCUSSION\n\nThe main result in this paper is the light-cone quantum circuit method. We have tested this method numerically\non a free system, with ∆ = 0, and on interacting systems with ∆ 6= 0. We have found decaying oscillations in the\nexpectation value of the spin. In future, this technique will be useful for studying non-integrable systems, to see if\nthey relax to a thermal state[38].\nWe can study two-dimensional systems by considering them\n√ as wide one-dimensional systems; this allows us to\ndouble the number of spins, but only leads to a factor of 2 increase in the time compared to direct simulation.\nOther similar quantum circuit methods may be more effective in two dimensions.\nThe results using the light-cone quantum circuit method are indeed comparable to those one would find by exactly\nsolving a system of twice the size, at least for ∆ = 0 where we can compute exactly. Thus, we l = 18, we find results\ncomparable to a system of N = 35 or N = 37 sites. The computational cost to exactly evolve a given system is roughly\ncomparable to that required to do exact diagonalization using Lanczos methods on that system: Lanczos methods and\nexact evolution both require sparse matrix-vector multiplication, but the number of multiplications needed to reach\nconvergence for the time evolution may be larger than that needed to reach convergence for ground state properties.\nThus, we expect that sizes around 35 sites, especially given the low symmetry of the present system, are around the\nupper limit for exact methods now, while we carried the light-cone quantum circuit method up to l = 22. Further, the\nasymptotic analysis of time requirements applies also to memory requirements: the memory requirements of an exact\nsolution on N sites scale as N 2N , while while the memory requirement of the light-cone quantum circuit method scale\nas l2l , so, regardless of what N can be obtained using an exact solution, it should be possible to obtain the same l, up\nto a difference of a couple sites, in the light-cone quantum circuit method. The main additional cost in the light-cone\n\n\f0.25\n0.2\n0.15\n0.1\n0.05\n0\n0\n0.2\n\nl0=5\nl0=7\nl0=9\n2\n\n4\n\n6\n\n8\n\n10\n\n4\n\n6\n\n8\n\n10\n\n6\n\n8\n\n10\n\nl0=5, pure\nl0=5, random\n\nχu\n\nC\n\n18\n\n0.1\n\n0\n\n2\n\nχdimer\n\n20\nl0=5, pure\n10\n0\n\n0\n\n2\n\n4\n\nβ\n\nFIG. 12: Top: specific heat for the pure system. Middle: uniform susceptibility for the pure system (l0 = 5, 7, 9 are black, red,\ngreen respectively) and the disordered system (l0 = 5, 7, 9 are blue, yellow, brown respectively). Bottom: dimer susceptibility\nfor the pure system (l0 = 5, 7, 9 are black, red, green respectively) and the disordered system (l0 = 5, 7, 9 are blue, yellow,\nbrown respectively).\n\nquantum circuit method is the need to run many times to obtain statistical samples, but this is a problem which can\nbe parallelized.\nAcknowledgments- I thank R. Melko for useful comments on implementing sparse matrix-vector multiplication.\nI thank the KITP for hospitality while this research was conducted. This research was supported in part by the\nNational Science Foundation under Grant No. PHY05-51164. This work supported by U. S. DOE Contract No.\nDE-AC52-06NA25396.\n\n[1] U. Schollwoeck, Rev. Mod. Phys. 77, 259 (2005).\n[2] F. Verstraete, J. J. Garcı́a-Ripoll, J. I. Cirac, Phys. Rev. Lett. 93, 207204 (2004); M. Zwolak and G. Vidal, Phys. Rev.\nLett. 93, 207205 (2004).\n[3] G. Vidal, Phys. Rev. Lett. 91, 147902 (2003); G. Vidal, Phys. Rev. Lett. 93, 040502 (2004).\n[4] M. B. Hastings, J. Stat. Mech., P08024 (2007).\n[5] M. B. Hastings, Phys. Rev. B 73, 085115 (2006).\n[6] M.M. Wolf, F. Verstraete, M.B. Hastings, and J.I. Cirac, arXiv:0704.3906.\n[7] T. J. Osborne, Phys. Rev. Lett. 97, 157202 (2006).\n[8] E. H. Lieb and D. W. Robinson, Commun. Math. Phys. 28, 251 (1972).\n[9] M. B. Hastings and T. Koma, Commun. Math. Phys. 265, 781 (2006).\n[10] B. Nachtergaele and R. Sims, Commun. Math. Phys. 265, 119 (2006).\n[11] M. B. Hastings, Phys. Rev. B 69, 104431 (2004).\n[12] G. Vidal, J. I. Latorre, E. Rico, and A. Kitaev, Phys. Rev. Lett. 90, 227902 (2003).\n[13] V. Eisler and I. Peschel, J. Stat. Mech. P06005 (2007).\n[14] P. Calabrese and J. Cardy, J. Stat. Mech, P10004 (2007).\n[15] D. Gobert, C. Kollath, U. Schollwoeck, G. Schuetz, Phys. Rev. E 71, 036102 (2005).\n[16] S. Bravyi, M. B. Hastings, and F. Verstraete, Phys. Rev. Lett. 97, 050401 (2006); J. Eisert and T. J. Osborne, Phys. Rev.\nLett. 97, 150404 (2006).\n[17] G. De Chiara, S. Montangero, P. Calabrese, R. Fazio, J. Stat. Mech.P03001 (2006).\n[18] P. Calabrese and J. Cardy, J. Stat. Mech. P04010 (2005).\n[19] S. Ostlund and S. Rommer, Phys. Rev. Lett 75, 3537 (1995); M. Fannes, B. Nachtergaele, and R. F. Werner, Comm.\nMath. Phys. 144, 443 (1992); F. Verstraete, D. Porras, and J. I. Cirac, Phys. Rev. Lett. 93, 227205 (2004).\n\n\f19\n[20] To understand why 2N/2 states suffice, consider how much entanglement is possible across each bond. If we divide the\nchain of N sites into a subchain of n sites and another subchain of N − n sites, with n ≤ N − n, then there are only 2n\nstates available on the subchain and so it is possible to perform a Schmidt decomposition and find a matrix product state\nrepresentation with 2n states across that bond. The worst case is midway across the chain, when n = N/2. If we wish to\nwrite matrix product operators instead of states, then these estimates are increased to 4N/2 .\n[21] M. Cramer, C.M. Dawson, J. Eisert, T.J. Osborne, arXiv:0703314.\n[22] M. B. Hastings, Phys. Rev. B Rapids 76, 201102 (2007).\n[23] X. Wang and T. Xiang, Phys. Rev B 56, 5061 (1997).\n[24] V. E. Korepin, N. M. Boloiubov, and A. G. Izergin, Quantum Inverse Scattering Method and Correlation Functions,\nCambridge University Press (1993).\n[25] The Krylov space methods may lead to some improvement in the time required compared to the series methods. However,\nsince we are considering a situation in which the entropy increases rapidly, and hence the state exp(iHL t)ΨL has very little\noverlap with ΨL , it seems likely that it would be necessary to take a fairly large k to obtain accurate results for large t.\nTherefore, we are not sure how much advantage would actually be obtained by using Krylov methods here.\n[26] The quantum belief propagation method, as currently implemented, requires manipulating operators, rather than pure\nstates, which increases the computational effort.\n[27] D. M. Basko, I. L. Aleiner, and B. L. Altshuler, Ann. Phys. 321, 1126 (2006); D. M. Basko, I. L. Aleiner, and B. L.\nAltshuler, cond-mat/0602510.\n[28] C. K. Burrell, T. J. Osborne, Phys. Rev. Lett. 99, 167201 (2007).\n[29] P. Zhang, Zh. Xu, H. Ying, J. Dai, cond-mat/0502543, conference on \"Non-Perturbative Quantum Field Theory: Lattice\nand Beyond\", Guangzhou, P.R. China, Nov. 2004.\n[30] E. Yusuf and Kun Yang, Phys. Rev. B 68, 024425 (2003).\n[31] J. E. Lorenzo et. al. Phys. Rev. B 50, 1278 (1994).\n[32] M. Hase, K. Ozawa, and N. Shinya, Phys. Rev. B 68, 214421 (2003).\n[33] H. Manaka, I. Yamada, and H. A. Katori, Phys. Rev. B 63, 104408 (2001).\n[34] H. Manaka, I. Yamada, and K. Yamaguchi, J. Phys. Soc. Jpn. 66, 564 (1997).\n[35] H. Manaka and I. Yamada, J. Phys. Soc. Jpn. 66, 1908 (1997).\n[36] H. Hida, J. Phys. Soc. Jpn. 72, 688.\n[37] T. Nakamura, J. Phys. Soc. Jpn. 72, 789 (2003).\n[38] T. Barthel and U. Schollwöck, arXiv:0711.4896.\n\n\f"}