{"id": "http://arxiv.org/abs/0805.1731v1", "guidislink": true, "updated": "2008-05-13T11:40:19Z", "updated_parsed": [2008, 5, 13, 11, 40, 19, 1, 134, 0], "published": "2008-05-13T11:40:19Z", "published_parsed": [2008, 5, 13, 11, 40, 19, 1, 134, 0], "title": "MOND and the Universal Rotation Curve: similar phenomenologies", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0805.3074%2C0805.4386%2C0805.4598%2C0805.4349%2C0805.1611%2C0805.3708%2C0805.4163%2C0805.0179%2C0805.2184%2C0805.2110%2C0805.3275%2C0805.0546%2C0805.3017%2C0805.2871%2C0805.4379%2C0805.0293%2C0805.1086%2C0805.3460%2C0805.1661%2C0805.3191%2C0805.3554%2C0805.2942%2C0805.3614%2C0805.3359%2C0805.3223%2C0805.3426%2C0805.1852%2C0805.0835%2C0805.1668%2C0805.0192%2C0805.2329%2C0805.0690%2C0805.2661%2C0805.1784%2C0805.3154%2C0805.3056%2C0805.3531%2C0805.3282%2C0805.3214%2C0805.1985%2C0805.4230%2C0805.0840%2C0805.0222%2C0805.0025%2C0805.0229%2C0805.0316%2C0805.3918%2C0805.4136%2C0805.1270%2C0805.1477%2C0805.0876%2C0805.2721%2C0805.0365%2C0805.1411%2C0805.3722%2C0805.2911%2C0805.1427%2C0805.1820%2C0805.2781%2C0805.0199%2C0805.1553%2C0805.1163%2C0805.4107%2C0805.4612%2C0805.2248%2C0805.2251%2C0805.1227%2C0805.2444%2C0805.1446%2C0805.1256%2C0805.0337%2C0805.2910%2C0805.0576%2C0805.4718%2C0805.2891%2C0805.1731%2C0805.1143%2C0805.2267%2C0805.1193%2C0805.3611%2C0805.1055%2C0805.0859%2C0805.1705%2C0805.4178%2C0805.1996%2C0805.0103%2C0805.0700%2C0805.4451%2C0805.3881%2C0805.3209%2C0805.1401%2C0805.0752%2C0805.3961%2C0805.4544%2C0805.3124%2C0805.3160%2C0805.0520%2C0805.4794%2C0805.2407%2C0805.1392%2C0805.2114&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "MOND and the Universal Rotation Curve: similar phenomenologies"}, "summary": "The Modified Newtonian Dynamics (MOND) and the Universal Rotation Curve (URC)\nare two ways to describe the general properties of rotation curves, with very\ndifferent approaches concerning dark matter and gravity. Phenomenological\nsimilarities between the two approaches are studied by looking for properties\npredicted in one framework that are also reproducible in the other one. First,\nwe looked for the analogous of the URC within the MOND framework. Modifying in\nan observationally-based way the baryonic contribution Vbar to the rotation\ncurve predicted by the URC, and applying the MOND formulas to this Vbar, leads\nto a \"MOND URC\" whose properties are remarkably similar to the URC. Second, it\nis shown that the URC predicts a tight mass discrepancy - acceleration\nrelation, which is a natural outcome of MOND. With the choice of Vbar that\nminimises the differences between the URC and the \"MOND URC\" the relation is\nalmost identical to the observational one. This similarity between the\nobservational properties of MOND and the URC has no implications about the\nvalidity of MOND as a theory of gravity, but it shows that it can reproduce in\ndetail the phenomenology of disk galaxies' rotation curves, as described by the\nURC. MOND and the URC, even though they are based on totally different\nassumptions, are found to have very similar behaviours and to be able to\nreproduce each other's properties fairly well, even with the simple assumptions\nmade on the luminosity dependence of the baryonic contribution to the rotation\ncurve.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0805.3074%2C0805.4386%2C0805.4598%2C0805.4349%2C0805.1611%2C0805.3708%2C0805.4163%2C0805.0179%2C0805.2184%2C0805.2110%2C0805.3275%2C0805.0546%2C0805.3017%2C0805.2871%2C0805.4379%2C0805.0293%2C0805.1086%2C0805.3460%2C0805.1661%2C0805.3191%2C0805.3554%2C0805.2942%2C0805.3614%2C0805.3359%2C0805.3223%2C0805.3426%2C0805.1852%2C0805.0835%2C0805.1668%2C0805.0192%2C0805.2329%2C0805.0690%2C0805.2661%2C0805.1784%2C0805.3154%2C0805.3056%2C0805.3531%2C0805.3282%2C0805.3214%2C0805.1985%2C0805.4230%2C0805.0840%2C0805.0222%2C0805.0025%2C0805.0229%2C0805.0316%2C0805.3918%2C0805.4136%2C0805.1270%2C0805.1477%2C0805.0876%2C0805.2721%2C0805.0365%2C0805.1411%2C0805.3722%2C0805.2911%2C0805.1427%2C0805.1820%2C0805.2781%2C0805.0199%2C0805.1553%2C0805.1163%2C0805.4107%2C0805.4612%2C0805.2248%2C0805.2251%2C0805.1227%2C0805.2444%2C0805.1446%2C0805.1256%2C0805.0337%2C0805.2910%2C0805.0576%2C0805.4718%2C0805.2891%2C0805.1731%2C0805.1143%2C0805.2267%2C0805.1193%2C0805.3611%2C0805.1055%2C0805.0859%2C0805.1705%2C0805.4178%2C0805.1996%2C0805.0103%2C0805.0700%2C0805.4451%2C0805.3881%2C0805.3209%2C0805.1401%2C0805.0752%2C0805.3961%2C0805.4544%2C0805.3124%2C0805.3160%2C0805.0520%2C0805.4794%2C0805.2407%2C0805.1392%2C0805.2114&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Modified Newtonian Dynamics (MOND) and the Universal Rotation Curve (URC)\nare two ways to describe the general properties of rotation curves, with very\ndifferent approaches concerning dark matter and gravity. Phenomenological\nsimilarities between the two approaches are studied by looking for properties\npredicted in one framework that are also reproducible in the other one. First,\nwe looked for the analogous of the URC within the MOND framework. Modifying in\nan observationally-based way the baryonic contribution Vbar to the rotation\ncurve predicted by the URC, and applying the MOND formulas to this Vbar, leads\nto a \"MOND URC\" whose properties are remarkably similar to the URC. Second, it\nis shown that the URC predicts a tight mass discrepancy - acceleration\nrelation, which is a natural outcome of MOND. With the choice of Vbar that\nminimises the differences between the URC and the \"MOND URC\" the relation is\nalmost identical to the observational one. This similarity between the\nobservational properties of MOND and the URC has no implications about the\nvalidity of MOND as a theory of gravity, but it shows that it can reproduce in\ndetail the phenomenology of disk galaxies' rotation curves, as described by the\nURC. MOND and the URC, even though they are based on totally different\nassumptions, are found to have very similar behaviours and to be able to\nreproduce each other's properties fairly well, even with the simple assumptions\nmade on the luminosity dependence of the baryonic contribution to the rotation\ncurve."}, "authors": ["Gianfranco Gentile"], "author_detail": {"name": "Gianfranco Gentile"}, "author": "Gianfranco Gentile", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1086/590048", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0805.1731v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0805.1731v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Accepted for publication in ApJ. 8 pages, 5 figures", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0805.1731v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0805.1731v1", "journal_reference": null, "doi": "10.1086/590048", "fulltext": "Draft version November 11, 2018\nPreprint typeset using LATEX style emulateapj v. 08/13/06\n\nMOND AND THE UNIVERSAL ROTATION CURVE: SIMILAR PHENOMENOLOGIES\nGianfranco Gentile\n\n1,2\n\narXiv:0805.1731v1 [astro-ph] 13 May 2008\n\nDraft version November 11, 2018\n\nABSTRACT\nThe Modified Newtonian Dynamics (MOND) and the Universal Rotation Curve (URC) are two\nways to describe the general properties of rotation curves, with very different approaches concerning\ndark matter and gravity. Phenomenological similarities between the two approaches are studied by\nlooking for properties predicted in one framework that are also reproducible in the other one.\nFirst, we looked for the analogous of the URC within the MOND framework. Modifying in an\nobservationally-based way the baryonic contribution Vbar to the rotation curve predicted by the URC,\nand applying the MOND formulas to this Vbar , leads to a \"MOND URC\" whose properties are remarkably similar to the URC.\nSecond, it is shown that the URC predicts a tight mass discrepancy - acceleration relation, which\nis a natural outcome of MOND. With the choice of Vbar that minimises the differences between the\nURC and the \"MOND URC\" the relation is almost identical to the observational one.\nThis similarity between the observational properties of MOND and the URC has no implications\nabout the validity of MOND as a theory of gravity, but it shows that it can reproduce in detail the\nphenomenology of disk galaxies' rotation curves, as described by the URC. MOND and the URC, even\nthough they are based on totally different assumptions, are found to have very similar behaviours and\nto be able to reproduce each other's properties fairly well, even with the simple assumptions made on\nthe luminosity dependence of the baryonic contribution to the rotation curve.\nSubject headings: galaxies: spiral – galaxies: kinematics and dynamics – galaxies: fundamental\nparameters – dark matter\n1. INTRODUCTION\n\nRotation curves of spiral galaxies have been studied for\nseveral decades now, and they are a useful tool to show\nthe mass discrepancy in galaxies: the observed kinematics and that predicted from the observed baryonic distribution do not match. Either an additional mass component or a modification of gravity are needed. In the\nrecent past, rotation curves have been exploited to test\nthe predictions of cosmological models of structure formation in the Universe, such as the currently favoured\nΛ Cold Dark Matter (ΛCDM). Most observations show\nthat the baryons are the main kinematic component in\nthe inner parts and that the so-called \"cuspy\" halos predicted by ΛCDM (Navarro, Frenk & White 1996, Moore\net al. 1999, Navarro et al. 2004) fail to reproduce observed rotation curves (see e.g. de Blok et al. 2001; de\nBlok & Bosma 2002; Gentile et al. 2004, 2005, 2007a,b;\nMcGaugh et al. 2007).\nRotation curves have been shown to have some general properties that can be described by a stellar disk +\ndark matter halo model (the Universal Rotation Curve,\nURC; Persic, Salucci & Stel 1996, hereafter PSS). In this\nframework, the circular velocity of a spiral galaxy at a\ncertain radius depends only on one parameter, e.g. the\ntotal luminosity of the stellar disk.\nMOND, the Modified Newtonian Dynamics (Milgrom\n1983) is another successful prescription to predict the rotation curve of a spiral galaxy. According to MOND, the\nmass discrepancy is not due to an unseen mass compo1 Sterrenkundig Observatorium, Ghent University, Krijgslaan\n281, S9, B-9000 Ghent, Belgium\n2 University of New Mexico, Department of Physics and Astronomy, 800 Yale Blvd NE, Albuquerque, NM 87131, USA\n\nnent (the dark matter halo), but it is instead the signature of the failure of Newtonian gravity to describe\nthe observed kinematics at the low accelerations found\nin the outer parts of galaxies. In MOND, below a certain critical acceleration a0 the Newtonian gravity is no\nlonger valid. Earlier concerns about the inconsistency of\nMOND with General Relativity are now overcome with\nthe TeVeS theory (Bekenstein 2004). MOND has a remarkable predictive power for the kinematics of galaxies:\nit fits the kinematics of small dwarf galaxies (Gentile\net al. 2007a,c), of the Milky Way (Famaey & Binney\n2005), of early-type spiral galaxies (Sanders & Noordermeer 2007), of massive ellipticals (Milgrom & Sanders\n2003), and it naturally explains observed tight scaling\nrelations in spiral galaxies (McGaugh 2004, 2005).\n2. MOND\n\nThe Modified Newtonian Dynamics (Milgrom 1983, see\nSanders & McGaugh 2002 for a review) can be invoked\nas an alternative to dark matter to explain the observed\nkinematics of disk galaxies. Within the MOND framework, the true gravitational acceleration g is linked to\nthe Newtonian one gN through the following relation:\ng=\n\ngN\nμ(g/a0 )\n\n(1)\n\nwhere μ(x) is an interpolation function whose asymptotic values are μ(x) = 1 when g ≫ a0 and μ(x) = g/a0\nwhen g ≪ a0 . a0 is the critical acceleration below\nwhich the Newtonian gravity is no longer valid; previous studies (Begeman, Broeils & Sanders 1991) found\nthat a0 ∼ 1.21 × 10−8 cm s−2 . Even though in a general\ncase a modified version of the Poisson equation should be\n\n\f2\nsolved, eq. 2 can be shown to be a good approximation\nfor axisymmetric disks (Brada & Milgrom 1995). The interpolation function has been given usually the following\nfunctional form:\nx\nμorig (x) = √\n1 + x2\n\n(2)\n\nHowever, it is obvious that a whole family of functions\nare compatible with the required asymptotic behaviours.\nFor instance, Famaey & Binney (2005) proposed that the\nform:\nμFB (x) =\n\nx\n1+x\n\n(3)\n\ncould be a better choice, since, contrary to eq. 2,\nit is compatible with the relativistic theory of MOND\n(TeVeS) put forward by Bekenstein (2004). Famaey et\nal. (2007) showed that using eq. 3 leads to a slightly\ndifferent value of a0 : a0 = 1.35 × 10−8 cm s−2 .\nIf eq. 2 is used as the interpolation function, then\nwithin the MOND framework the circular velocity velocity Vobs (r) can be expressed as a function of a0 and the\nNewtonian baryonic contribution to the rotation curve\nVbar (r) at radius r:\n\nv\nr\nu\n\u0010\n\u00112\nu\n0\n\nu 1 + 1 + 2ra\n2 (r)\n\nt\nVbar\n2\n2\n2\n\n−\n1\nVobs (r) = Vbar (r)+Vbar (r) \n\n\n2\n\n\n(4)\n\nq\n2\n2 (r) (ignoring the\nVstars\nwhere Vbar (r) =\n(r) + Vgas\ncontribution of the bulge), Vstars (r) and Vgas (r) are the\nNewtonian contributions to the rotation curve of the stellar and gaseous disks, respectively (see Milgrom 1983).\nThe amplitude of Vstars (r) (whose shape is fixed by\nphotometric observations), can be scaled according to\nthe chosen, or fitted, stellar mass-to-light (M/L) ratio.\nVgas (r) is derived from HI observations, when they are\navailable. Note that the second term of the right-hand\nside of eq. 4 acts as a \"pseudo-dark matter halo\" term\nand that it is completely determined by the baryonic\nterms.\nIf eq. 3 is chosen as the interpolation function instead\nof eq. 2, the equivalent of eq. 4 becomes:\nq\n1+\n2\n2\n2\nVobs\n(r) = Vbar\n(r) + Vbar\n(r) \n\n4a0 r\n2 (r)\nVbar\n\n2\n\n−1\n\n\n\n\n(5)\n\n(see e.g. Richtler et al. 2008). As expected, in both\neqs. 4 and 5 the \"pseudo-dark matter halo\" term vanishes in the limit a0 → 0. We note MOND has a remarkable predictive power for the general properties of\nrotation curves, and in many cases it is able to fit observed individual rotation curves (Kent 1987; Milgrom\n1988; Begeman, Broeils & Sanders 1991; Sanders 1996;\nde Blok & McGaugh 1998) . MOND correctly predicts\ngeneral scaling relations linked to rotation curves, such\nas the baryonic Tully-Fisher relation (see McGaugh 2005,\neven though we note that other authors find different\n\nFig. 1.- Gas scaling factor versus (log of) B-band luminosity.\nThe data are taken from Swaters (1999) and Hoekstra et al. (2001),\nand the solid line is the result of a linear fit to the points.\n\nslopes, mainly due to different choices of the stellar M/L\nratio) or the mass discrepancy-acceleration relation (McGaugh 2004).\n3. THE UNIVERSAL ROTATION CURVE (URC)\n\nPSS, from the analysis of a sample of more than 1000\nrotation curves, showed that the circular velocity of a\ndisk galaxies at a given radius (note that they considered\nrotation curves extended up to 2 optical radii ropt ) can\nbe described as a function of only one parameter, e.g. the\ntotal luminosity. The function which describes the rotation velocity depending only on radius and luminosity\nis given the name Universal Rotation Curve (URC). We\nnote that the kinematics of real galaxies depend on other\nfactors too (such as the surface brightness), but the general phenomenological properties of rotation curves can\nbe described well with the luminosity as only parameter.\nIn detail, the circular velocity VURC (r) at radius r can\nbe expressed as a function of Vopt (the circular velocity at ropt ), and of the stellar and dark contributions\nVdisk,N and Vhalo,N normalised at Vopt (i.e., Vdisk,N (ropt )+\nVhalo,N (ropt ) = 1):\nq\n2\n2\n(r) + Vhalo,N\n(r)\n(6)\nVURC (r) = Vopt Vdisk,N\nVopt , Vdisk,N , and Vhalo,N can be in turn expressed as\nfunctions of r, λ = L/L∗ (L is the total blue luminosity\nof the galaxy in question and log L∗ =10.4 in solar units),\nand ropt ≃ 13λ0.5 kpc:\n200 λ0.41\n−1\nVopt = h\ni1/2 km s\n0.75 exp(−0.4λ)\n0.80 + 0.49 logλ + 0.47+2.25λ0.4\n\n(7)\n\n2\nVdisk,N\n= (0.72 + 0.44 logλ)\n\n1.97(r/ropt )1.22\n[(r/ropt )2 + 0.61]1.43\n\n(8)\n\n\f3\n\n100\n50\n0\n150\n100\n50\n0\n200\n150\n100\n50\n0\n300\n200\n100\n0\n500\n400\n300\n200\n100\n0\n0 0.5\n\n1 1.5\n\n2 0 0.5\n\n1 1.5\n\n2 0 0.5\n\n1 1.5\n\n2 0 0.5\n\n1 1.5\n\n2\n\nFig. 2.- Comparison between the Universal Rotation Curve (thick black curves), at various luminosities, and the equivalent for MOND\n(thin red curves, using μorig (x)), with the stars and gas contributions defined in the text. Dotted curves indicate the uncertainties.\n\n2\nVhalo,N\n= 1.6 exp(−0.4λ)\n\n2\n\n(r/ropt )\n(r/ropt )2 + 2.25λ0.4\n\n(9)\n\nAccording to PSS, eqs. 6 to 9 predict the circular velocity of a spiral galaxy at radius r with an uncertainty\nof 4%. Choosing ropt ≃ 13λ0.5 kpc hides any variation of\nsurface brightness for a given luminosity, which results in\ndifferent rotation curve shapes for galaxies with different\nsurface brightnesses (see e.g. McGaugh & de Blok 1998).\nHowever, we note that the original formulation of the\nURC (with the radius r in units of the stellar exponential scale length rD ) takes this effect into account, since\nthe rotation curves of low- and high-surface brightness\ngalaxies are virtually indistinguishable once the radius is\nexpressed in units of rD (e.g., Verheijen & de Blok 1999).\nAlso, in the URC the contribution of the gaseous disk is\n\nignored. This is acceptable in the range of luminosities\nconsidered by PSS because a) the gasous disk never dominates the kinematics and b) because of its scaling with\nthe dark matter contribution, its contribution can be implicitely accounted by Vhalo .\nAn important feature of the URC is the strong dependence of the logarithmic slope of the rotation curve ∇\non the luminosity. They define ∇ in the range 0.5ropt <\nr < ropt : ∇ = dlogV /dlogr|0.5ropt <r<ropt . Fainter galaxies have an increasing rotation curve around ropt , while\nin the most massive galaxies V (r) is already decreasing\naround ropt .\n4. THE MOND UNIVERSAL ROTATION CURVE\n\nThe question that this paper is addressing is: since\nboth MOND and the URC are successful ways to predict the general kinematical properties of disk galaxies,\n\n\f4\n\n100\n50\n0\n150\n100\n50\n0\n200\n150\n100\n50\n0\n300\n200\n100\n0\n500\n400\n300\n200\n100\n0\n0 0.5\n\n1 1.5\n\n2 0 0.5\n\n1 1.5\n\n2 0 0.5\n\n1 1.5\n\n2 0 0.5\n\n1 1.5\n\n2\n\nFig. 3.- Comparison between the Universal Rotation Curve (thick black curves), at various luminosities, and the equivalent for MOND\n(thin red curves, using μFB (x)), with the stars and gas contributions defined in the text. Dotted curves indicate the uncertainties.\n\nto what extent do they have similar properties? One way\nto compare their properties is to try to derive something\nlike the URC within the framework of MOND. In order\nto achieve this, both Vstars (r) and Vgas (r) are needed.\nFor the former term, the URC provides us with a recipe\nto estimate it, while the latter is ignored in the URC. A\nrough estimate of Vgas (r) can be made through the scaling property of Vhalo (r) compared to Vgas (r) noticed by\ne.g. Bosma (1981) and Hoekstra, van Albada & Sancisi\n2\n2\n(2001): Vhalo\n(r) ≈ n × Vgas\n(r). The factor n was calculated by performing a linear fit to the observational data\nin the scaling factor versus luminosity plot (see Fig. 1).\nThe data were taken from the samples of Swaters (1999)\nand Hoekstra et al. (2001). The former work gives Rband luminosities, whereas the URC uses B-band. The\nB-band luminosities of the Swaters (1999) sample were\ncalculated from the LEDA database, when available, and\n\nfrom NED. The linear fit gives n = 1.3logλ − 6.4. Therefore, we estimated Vgas (r) through\nthe following rela√\ntion: Vgas (r) ∼ Vhalo,URC (r)/ 1.3logλ − 6.4. This turns\nout to be in line with the findings of Swaters (1999),\nwho finds n to be correlated with surface brightness, and\nhence with luminosity. Such a scaling of the actual surface density with the gas surface density would happen\nin the case of a conspicuous amount of disk dark matter, e.g. H2 in the form of clumps (Pfenniger, Combes &\nMartinet 1994) or in a cold neutral medium phase (Papadopoulos, Thi & Viti 2002).\nThe MOND formulas (eqs. 4 and 5) were then applied\nto the Vstars (r) and Vgas (r) derived above. However, using the face value Vstars (r) coming from the URC formulas leads to a MOND Universal Rotation Curve that\nis quite different from the original URC, especially for\ngalaxies where the stellar disk dominates the kinematics.\n\n\f5\nIn the lower panels of Figs. 2 and 3 the MOND curves\nwould lie significantly above the URC curves. Thus, a\n2\n2\nparameter η such that Vstars,MOND\n(r) = ηVstars,URC\n(r)\nwas fitted in order to have the best possible agreement\nbetween the URC and the \"MOND URC\", assuming that\nthe scaling of the stellar mass-to-light ratio with luminosity predicted by the URC is correct.\nThis parameter η corresponds to the ratio of the stellar\nM/L ratios required in MOND and the URC frameworks,\nrespectively. A best-fit value of η = 0.77 was found for\nthe standard interpolation function (eq. 2) and a value of\nη = 0.57 for the simple one (eq. 3). This is in agreement\nwith Famaey et al. (2007), who compare rotation curve\nfits made with the two μ functions considered here are\nconclude that the simple μ function gives stellar M/L\nratios that are on average ∼30% lower than with the\nstandard μ.\nThe stellar mass-to-light ratios are generally not well\nknown in spiral galaxies. Here we considered a conservative estimate of the uncertainties to be 50% (see de Jong\n& Bell 2006). The uncertainty on the gas scaling factor\nn was taken to be 3.4, from the scatter in the distribution of n shown in Fig. 1. This scatter is large, but it is\nnot possible to find more a accurate way to estimate the\nscaling factor within the context of the URC, because\none would need to consider other parameters (e.g. the\nHubble type) than the luminosity, which are much more\ndifficult to take into account: for instance, in early-type\ndisk galaxies usually there is a central depression in the\nHI distribution, but its size and magnitude are variable.\nMoreover, the URC, by construction, has the luminosity\nas the only parameter varying from galaxy to galaxy. The\nuncertainties on the baryonic contribution to the rotation\ncurve result in uncertainties on the calculated rotation\ncurves. They are only rough estimates, since other (less\neasily quantifiable) sources of errors were ignored, such\nas the presence of the bulge. These uncertainties on the\nstellar M/L ratios mean that the disagreement between\nthe MOND and URC stellar M/L ratios (i.e., η being\n6= 1) does not necessarily imply that the approach of the\npresent paper is incorrect. Moreover, this is in qualitative agreement with the fact that 1) in McGaugh (2005)\nthe ratio of the \"maximum\" M/L ratio and the MOND\nM/L ratio has a median value of 1.8, where \"maximum\"\nin McGaugh (2005) is admittedly loosely defined but it\nis generally taken as a fit where the peak of the rotation\ncurve can be entirely explained by the stellar disk; and\n2) the URC has disks close to \"maximum\" (following the\nabove definition) for most galaxies apart from the least\nmassive ones.\nThe URC and the \"MOND URC\" (using μorig (x)) are\ncompared in Fig. 2: for the whole range of circular velocities and radii usually sampled by rotation curves, the\ntwo datasets display almost identical properties. Not\nsurprisingly, the best agreement is found for the range\n100 km s−1 . Vopt . 250 km s−1 , where most observed\nrotation curves lie. The worst disagreement is found for\nthe largest distances, in particular in the most massive\ngalaxies. This has to be expected, though, as the number of data points in this region of the parameter space\nis quite small: the sample of PSS has very few data for\nlarge radii of massive galaxies. Indeed, only a minority\nof the curves come from HI observations (which trace the\n\nFig. 4.- Logarithmic slope of the rotation curve versus\nlog(Vopt ). The thick black lines represents the URC, the (less\nthick) red and (thin) blue lines represent the MOND curves, with\nthe standard and simple μ functions, respectively.\n\nkinematics typically out to 2-3 ropt ), and few galaxies are\nearly-type large spirals (only two galaxies in their sample\nhave type Sab or earlier). However, using the uncertainties on the baryonic contribution discussed above, the\nURC and the MOND URC are always in agreement with\neach other within the errorbars. Also, note that in this\npaper we ignored the contribution of the bulge, since it\nwas ignored in the URC. This is likely to have a strong\neffect on the rotation curves of the largest galaxies.\nThe same considerations can be made if one uses\nμBF (x) instead of μorig (x). Fig. 3 shows that the URC\nand the \"MOND URC\" using μBF (x) agree with each\nother as well as if one uses μorig (x).\nUsing either interpolation function, the trend in logarithmic slope (see Section 3) is also reproduced: in the\nouter parts of the galaxy, the faintest galaxies have a rising rotation curve while the brightest galaxies have a declining rotation curve. This is illustrated in Fig. 4, where\nthe logarithmic slope as a function of Vopt is displayed.\nAgain, within the uncertainties the two formalisms agree\nwith each other. MOND does not reproduce particularly\nwell the slopes of the most massive galaxies, mainly because of the fact that the bulge is not taken into account.\nFor consistency with PSS we first performed a linear fit of\nthe rotation curves between 0.5 and 1 ropt , then we took\nthe slope at 1 ropt . The uncertainties on the slopes were\ncomputed as the maximum between the propagation of\nthe uncertainties on the rotation curves and a minimum\nvalue of 0.1 (see PSS).\n5. THE MASS DISCREPANCY-ACCELERATION RELATION\nFOR THE URC\n\nNow that it has been shown that MOND can reproduce something which is quite close to the URC, in order to further compare the two phenomena let us have a\nlook if the URC can reproduce one of the main properties linked to MOND: the mass discrepancy-acceleration\nrelation. McGaugh (2004) showed that rotation curve\ndata seem to organise themselves along a relation linking\n\n\f6\n2\nthe mass discrepancy (defined as D(r) = V 2 (r)/Vbar\n(r),\nwhere V (r) is the rotation velocity at radius r) to the\ngravitational acceleration (here the Newtonian acceler2\nation is used, gN = Vbar\n/r). In the same paper, it is\nalso shown that the stellar M/L ratios arising from the\nMOND fits minimise the scatter in the mass discrepancyacceleration relation.\nFig. 5 shows that using the URC formulas one finds\nsuch a relation, whatever choice of baryonic mass is\nmade. Since we are looking for such a relation in the\nURC context, the mass discrepancy is always computed\nwith respect to the URC rotation curve (i.e., in the above\n2\ndefinition of D(r), V 2 (r) = VURC\n(r)). Obviously, using\n2\n2\nV (r) = VMOND (r) (whichever μ is used) leads to a zeroscatter relation, by construction. A priori the tightness\nof the relations shown in Fig. 5 comes a bit as a surprise: while in MOND a critical acceleration is inbuilt in\nthe theory, in the URC framework there is no such thing,\nat least in an explicit way. Semi-analytical dark matter\nmodels (e.g., van den Bosch & Dalcanton 2000) can also\nreproduce a mass discrepancy-acceleration relation using\nthe right choice of parameters. However, the main thing\nto note is that in the present paper the URC gives a mass\ndiscrepancy-acceleration relation without any parameter\nto adjust.\nFrom the lower four panels Fig. 5 one can see that the\nmass discrepancy-acceleration relation from the URC formulas is consistent with that found by McGaugh (2004)\nwith observational data if the baryonic contribution to\nthe rotation curve is chosen to be the same as in Section 4, with η = 0.57 or 0.77. The former value of η\nslightly overestimates the mass discrepancy (compared\nto McGaugh's points) for a given Newtonian acceleration gN : this is to be expected because η = 0.57 corresponds to the \"simple\" interpolation function, where\nthe full MOND regime is reached faster than with the\n\"standard\" function. Using η = 0.77 gives an excellent\nagreement: it corresponds to the \"standard\" interpolation function, which is what McGaugh used. Taking the\nface-value Vbar (r) predicted by the URC yields a remarkably tight relation; the scaling is obviously different, since\nthe stellar M/L ratio is different and the gaseous contribution is ignored. We also considered different ranges\nof luminosities: since the URC is defined for Vopt & 80\nkm s−1 (see PSS), the predicted scaling relations are not\nexpected to hold with high accuracy. Indeed, the left\npanels Fig. 5 show that for Vopt . 80 km s−1 the innermost few points of the rotation curves start to become\ndiscrepant.\n\n6. DISCUSSION\n\nOne of the main differences between the URC and the\nMOND fits is the stellar M/L ratio: while in the former\ndisks are mostly close to maximum (following the definition in Section 4), the latter yields slightly submaximal\ndisks (see McGaugh 2005), which results in a very different scaling in the mass discrepancy - acceleration plane.\nAgain, we note that a limitation of the present approach\nis that these statements ignore any surface brightness\nvariation at equal luminosity. A robust, precise and incontrovertible method to determine stellar M/L ratios is\nyet to be found. A number of methods have been suggested (see e.g. de Jong & Bell 2006), which suggest M/L\nratios ranging roughly between half-maximum to maxi-\n\nmum disks. Therefore, a distinction between the URC\nand MOND based on the predicted stellar M/L ratios is\nnot viable at the moment. The fact that the simple μ\nfunction gives lower stellar M/L than the standard one\nhas already been shown by Famaey et al. (2007).\nIn the present paper the discussion is focussed only on\nthe general properties of spiral galaxies' rotation curves.\nBoth MOND and the URC are successful ways of describing the overall behaviour of rotation curves, but inevitably there are cases where they fail to reproduce the\ndetails in the rotation curves. Also, only a rough estimate of Vbar (r) was made in the context of MOND,\nin particular for Vgas (r). The observed Vhalo (r)/Vgas (r)\nscaling\n√ shows considerable variations around the value\nof 1.3logλ − 6.4 that was assumed here. Despite these\nlarge approximations, the URC and MOND exhibit remarkable phenomenological similarities.\nA major feature of MOND and the URC is that in both\nframeworks one is able to infer in a reasonably accurate\nway the general properties of rotation curves based on the\namount and distribution of baryonic matter only. This\nis closely linked to another property of rotation curves\n(Sancisi 2003), whereby for any feature in a rotation\ncurve there is a corresponding feature in the baryonic\ndistribution. The literature is full of such examples, one\nof the most spectacular being NGC 1560 (Broeils 1992).\nThis empirical fact is unexpected in a Cold Dark Matter (CDM) framework since CDM fits to the rotation\ncurves require strongly submaximal disks, which would\ncancel this baryon-kinematics coupling that is observed\n(see e.g. de Blok et al. 2001, McGaugh 2004, Gentile\net al. 2004). Yet another evidence of the close coupling\nof baryonic and general properties of spiral galaxies is\nthe observed correlation between stellar exponential scale\nlengths and halo core radii (Donato, Gentile & Salucci\n2004). A similar effect can be inferred also within MOND\n(Milgrom & Sanders 2005). The interpretation of the\nbaryon-kinematics coupling is not obvious: possible solutions are that baryons and dark matter are interacting\nin some unknown way other than gravity in the central\nparts of galaxies or that a MOND-like theory such as\nTeVeS is the correct theory of gravity.\nA possible concern about the approach presented in\nthis paper might have been that the similarity between\nMOND and the URC might actually be an identity. This\nis not the case, since even if one assumes the same baryonic contribution in both frameworks (e.g. the ones considered in Section 4, with either η = 0.57 or 0.77), the\nfunctional form of the halo contribution in the URC context (eq. 9) is completely different from the functional\nform of the \"pseudo-halo\" contribution in MOND (second term of the right-hand side of eq. 4).\nAs pointed out by Salucci & Gentile (2006), any alternative theory of gravity (such as MOND or MOG, see\nMoffat 2006) should be able to account for the observed\nphenomenology of rotation curves. In the present paper\nwe have demonstrated that MOND does fairly well, despite the naive expectation of having only flat rotation\ncurves because of the asymptotically flat behaviour of the\nMOND rotation curves. Hence, the MOND framework\nnot only usually gives good fits to rotation curves, but\nit also predicts the correct scaling of the rotation curves\nproperties with luminosity, as shown by the URC.\n\n\f7\nLog L/L*: 9.0\n\n10.9\n\nLog L/L*: 9.3\n\n10.9\n\nFig. 5.- Full circles: mass discrepancy-acceleration (MDA) relation using the URC formulas. Open circles: the MDA data from\nMcGaugh (2004), using the stellar M/L ratios arising from the MOND rotation curve fits. The horizontal axis is the log of the Newtonian\nacceleration (in units of km2 s−2 kpc−1 ) and the mass discrepancy is defined with respect to the URC rotation curve. The ranges of\nB-band luminosities are indicated at the top (in solar units) and the radii range from 0.05ropt to 2ropt , in steps of 0.05ropt . In the upper\npanel the face-value URC prescription for the baryons was considered, while for the middle and bottom panel the values for Vdisk and Vgas\nwere taken as in Section 4.\n\n7. CONCLUSIONS\n\nStarting from the consideration that both MOND and\nthe Universal Rotation Curve (URC) are valid ways to\ndescribe the general properties of rotation curves, the two\napproaches were compared by trying to reproduce one's\npredictions using the prescriptions of the other one.\nThe first comparison was made by attempting to reproduce something like the URC in the MOND framework. Some (observationally-based) assumptions on the\nstellar and gaseous contributions to the rotation curve\nwere made. It turns out that it is possible to build a\n\"MOND URC\" with very similar properties to the URC.\nThe MOND URC also exhibits the trend in logarithmic\nslope versus luminosity seen in the URC. Both the \"standard\" MOND interpolation function and the simple one\nproposed by Famaey & Binney (2005) were tested, with\nalmost identical results.\n\nThe second comparison was made by looking for a mass\ndiscrepancy - acceleration relation using the URC formulas. With all three choices of baryonic contributions\n(Vbar ) considered in this paper a tight (unexpected a priori) relation arises. Using the Vbar values that match\nbest the \"MOND URC\" to the URC one finds a mass\ndiscrepancy - acceleration relation like the observed one.\nWhile these results have no implications as to whether\nMOND is a valid theory of gravity, MOND and the URC,\neven though they are based on totally different assumptions, are found to display similar properties and to reproduce each other's predictions well.\nI wish to thank the referee for constructive comments\nthat improved the quality of the paper, and Stacy McGaugh for providing his data on the mass discrepancy acceleration relation. GG is a postdoctoral fellow with\n\n\f8\nthe National Science Fund (FWO-Vlaanderen).\nREFERENCES\nBegeman, K. G., Broeils, A. H., Sanders, R. H., 1991, MNRAS,\n249, 523\nBekenstein, J. D., 2004, Phys. Rev. D., 70, 083509\nBosma, A., 1981, AJ, 86, 1791\nBrada, R., & Milgrom, M., 1995, MNRAS, 276, 453\nBroeils, A. H., 1992, A&A, 256, 19\nde Blok, W. J. G., McGaugh, S. S. 1998, ApJ, 508, 132\nde Blok, W. J. G., McGaugh, S. S., Rubin, V. C., 2001, AJ, 122,\n2396\nde Blok, W. J. G., Bosma, A., 2002, A&A, 385, 816\nde Jong, R. S., Bell, E. F., 2006, preprint, astro-ph/0604391\nDonato, F., Gentile, G., Salucci, P. 2004, MNRAS, 353, L17\nFamaey, B., Binney, J., 2005, MNRAS, 363, 603\nFamaey, B., Gentile, G. , Bruneton, J.-P., Zhao, H. S., 2007, Phys.\nRev. D, 75, 063002\nGentile, G., Salucci, P., Klein, U., Vergani, D., Kalberla, P., 2004,\nMNRAS, 351, 903\nGentile, G., Burkert, A., Salucci, P., Klein, U., Walter, F., 2005,\nApJ, 634, L145\nGentile, G., Salucci, P., Klein, U., Granato, G. L. 2007a, MNRAS,\n375, 199\nGentile, G., Tonini, C., Salucci, P., 2007b, A&A, 467, 925\nGentile, G., Famaey, B., Combes, F., Kroupa, P., Zhao, H. S., Tiret,\nO. 2007c, A&A, 472, L25\nHoekstra, H., van Albada, T. S., Sancisi, R., 2001, MNRAS, 323,\n453\nKent, S. M. 1987, AJ, 93, 816\nMcGaugh, S. S., de Blok, W. J. G. 1998, ApJ, 499, 41\nMcGaugh, S. S., 2004, ApJ, 609, 652\nMcGaugh, S. S., 2005, ApJ, 632, 859\n\nMcGaugh, S. S., de Blok, W. J. G., Schombert, J. M., Kuzio de\nNaray, R., Kim, J. H. 2007, ApJ, 659, 149\nMilgrom, M., 1983, ApJ, 270, 365\nMilgrom, M. 1988, ApJ, 333, 689\nMilgrom, M., Sanders, R. H. 2003, ApJ, 599, L25\nMilgrom, M., Sanders, R. H. , 2005, MNRAS, 357, 45\nMoffat, J. W. 2006, Journal of Cosmology and Astro-Particle\nPhysics, 3, 4\nMoore, B., Quinn, T., Governato, F., Stadel, J., Lake, G., 1999,\nMNRAS, 310, 1147\nNavarro, J. F., Frenk, C. S., White, S. D. M., 1996, ApJ, 462, 563\nNavarro, J. F., Hayashi, E., Power, C., Jenkins, A. R., Frenk, C.\nS., White, S. D. M., Springel, V., Stadel, J., Quinn, T. R., 2004,\nMNRAS, 349, 1039\nPapadopoulos, P. P., Thi, W.-F., & Viti, S. 2002, ApJ, 579, 270\nPersic, M., Salucci, P., Stel, F., 1996, MNRAS, 281, 27\nPfenniger, D., Combes, F., & Martinet, L. 1994, A&A, 285, 79\nRichtler, T., Schuberth, Y., Hilker, M., Dirsch, B., Bassino, L., &\nRomanowsky, A. J. 2008, A&A, 478, L23\nSalucci, P., Gentile, G. 2006, Phys. Rev. D, 73, 128501\nSancisi, R. 2003, in IAU Symp. 220, Dark Matter in Galaxies\n(Dordrecht: Kluwer), 192\nSanders, R. H. 1996, ApJ, 473, 117\nSanders, R. H., McGaugh, S. S., 2002, ARA&A, 40, 263\nSanders, R. H., Noordermeer, E. 2007, MNRAS, 379, 702\nSwaters, R. A. 1999, Ph.D. Thesis, University of Groningen\nVerheijen, M., de Blok, E. 1999, Ap&SS, 269, 673\n\n\f"}