{"id": "http://arxiv.org/abs/1205.4305v1", "guidislink": true, "updated": "2012-05-19T08:35:36Z", "updated_parsed": [2012, 5, 19, 8, 35, 36, 5, 140, 0], "published": "2012-05-19T08:35:36Z", "published_parsed": [2012, 5, 19, 8, 35, 36, 5, 140, 0], "title": "Surface acoustic wave mediated carrier injection into individual quantum\n  post nano emitters", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1205.2251%2C1205.3007%2C1205.2099%2C1205.3644%2C1205.4208%2C1205.2351%2C1205.2999%2C1205.3176%2C1205.1021%2C1205.3688%2C1205.0936%2C1205.2783%2C1205.2728%2C1205.2331%2C1205.2643%2C1205.1156%2C1205.4187%2C1205.0906%2C1205.1525%2C1205.3097%2C1205.3043%2C1205.2477%2C1205.1146%2C1205.2930%2C1205.3202%2C1205.1658%2C1205.2341%2C1205.3782%2C1205.3083%2C1205.0388%2C1205.3902%2C1205.1266%2C1205.0792%2C1205.1902%2C1205.4103%2C1205.1543%2C1205.4005%2C1205.3888%2C1205.3063%2C1205.0273%2C1205.3764%2C1205.2423%2C1205.3195%2C1205.2432%2C1205.1009%2C1205.0809%2C1205.2506%2C1205.2380%2C1205.2871%2C1205.3208%2C1205.3125%2C1205.2275%2C1205.3251%2C1205.4305%2C1205.2102%2C1205.1050%2C1205.3535%2C1205.1349%2C1205.0269%2C1205.3515%2C1205.1097%2C1205.1000%2C1205.1087%2C1205.0725%2C1205.1544%2C1205.1342%2C1205.3735%2C1205.1711%2C1205.2832%2C1205.0991%2C1205.2392%2C1205.1675%2C1205.3314%2C1205.1651%2C1205.2133%2C1205.1241%2C1205.3607%2C1205.2721%2C1205.2437%2C1205.3788%2C1205.0172%2C1205.0626%2C1205.2314%2C1205.2233%2C1205.1730%2C1205.2675%2C1205.0987%2C1205.3230%2C1205.0339%2C1205.2619%2C1205.0352%2C1205.2329%2C1205.1618%2C1205.2815%2C1205.1321%2C1205.0157%2C1205.1867%2C1205.3522%2C1205.1938%2C1205.1700%2C1205.2077&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Surface acoustic wave mediated carrier injection into individual quantum\n  post nano emitters"}, "summary": "Acousto-electric charge conveyance induced by a surface acoustic wave is\nemployed to dissociate photogenerated excitons. Over macroscopic distances,\nboth electrons and holes are injected \\emph{sequentially} into a remotely\npositioned, isolated and high-quality quantum emitter, a self-assembled quantum\npost. This process is found to be highly efficient and to exhibit improved\nstability at high acoustic powers when compared to direct optical pumping at\nthe position of the quantum post. These characteristics are attributed to the\nwide matrix quantum well in which charge conveyance occurs and to the larger\nnumber of carriers available for injection in the remote configuration,\nrespectively. The emission of such pumped quantum posts is dominated by\nrecombination of neutral excitons and fully directional when the propagation\ndirection of the SAW and the position of the quantum post are reversed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1205.2251%2C1205.3007%2C1205.2099%2C1205.3644%2C1205.4208%2C1205.2351%2C1205.2999%2C1205.3176%2C1205.1021%2C1205.3688%2C1205.0936%2C1205.2783%2C1205.2728%2C1205.2331%2C1205.2643%2C1205.1156%2C1205.4187%2C1205.0906%2C1205.1525%2C1205.3097%2C1205.3043%2C1205.2477%2C1205.1146%2C1205.2930%2C1205.3202%2C1205.1658%2C1205.2341%2C1205.3782%2C1205.3083%2C1205.0388%2C1205.3902%2C1205.1266%2C1205.0792%2C1205.1902%2C1205.4103%2C1205.1543%2C1205.4005%2C1205.3888%2C1205.3063%2C1205.0273%2C1205.3764%2C1205.2423%2C1205.3195%2C1205.2432%2C1205.1009%2C1205.0809%2C1205.2506%2C1205.2380%2C1205.2871%2C1205.3208%2C1205.3125%2C1205.2275%2C1205.3251%2C1205.4305%2C1205.2102%2C1205.1050%2C1205.3535%2C1205.1349%2C1205.0269%2C1205.3515%2C1205.1097%2C1205.1000%2C1205.1087%2C1205.0725%2C1205.1544%2C1205.1342%2C1205.3735%2C1205.1711%2C1205.2832%2C1205.0991%2C1205.2392%2C1205.1675%2C1205.3314%2C1205.1651%2C1205.2133%2C1205.1241%2C1205.3607%2C1205.2721%2C1205.2437%2C1205.3788%2C1205.0172%2C1205.0626%2C1205.2314%2C1205.2233%2C1205.1730%2C1205.2675%2C1205.0987%2C1205.3230%2C1205.0339%2C1205.2619%2C1205.0352%2C1205.2329%2C1205.1618%2C1205.2815%2C1205.1321%2C1205.0157%2C1205.1867%2C1205.3522%2C1205.1938%2C1205.1700%2C1205.2077&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Acousto-electric charge conveyance induced by a surface acoustic wave is\nemployed to dissociate photogenerated excitons. Over macroscopic distances,\nboth electrons and holes are injected \\emph{sequentially} into a remotely\npositioned, isolated and high-quality quantum emitter, a self-assembled quantum\npost. This process is found to be highly efficient and to exhibit improved\nstability at high acoustic powers when compared to direct optical pumping at\nthe position of the quantum post. These characteristics are attributed to the\nwide matrix quantum well in which charge conveyance occurs and to the larger\nnumber of carriers available for injection in the remote configuration,\nrespectively. The emission of such pumped quantum posts is dominated by\nrecombination of neutral excitons and fully directional when the propagation\ndirection of the SAW and the position of the quantum post are reversed."}, "authors": ["Stefan Völk", "Florian Knall", "Florian J. R. Schülein", "Tuan A. Truong", "Hyochul Kim", "Pierre M. Petroff", "Achim Wixforth", "Hubert J. Krenner"], "author_detail": {"name": "Hubert J. Krenner"}, "author": "Hubert J. Krenner", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0957-4484/23/28/285201", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1205.4305v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1205.4305v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "11 pages, 4 figures", "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1205.4305v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1205.4305v1", "journal_reference": "Nanotechnology 23, 285201 (2012)", "doi": "10.1088/0957-4484/23/28/285201", "fulltext": "arXiv:1205.4305v1 [cond-mat.mes-hall] 19 May 2012\n\nSurface acoustic wave mediated carrier injection\ninto individual quantum post nano emitters\nStefan Völk1,2,† , Florian Knall1,2,† , Florian J. R. Schülein1,2 ,\nTuan A. Truong3 , Hyochul Kim3,4 , Pierre M. Petroff3 , Achim\nWixforth1,2 , Hubert J. Krenner1,2,∗\n1\n\nLehrstuhl für Experimentalphysik 1 and Augsburg Centre for Innovative\nTechnologies ACIT, Universität Augsburg, 86159 Augsburg\n2\nCenter for NanoScience CeNS, Geschwister-Scholl-Platz 1, 80539 München,\nGermany\n3\nMaterials Department, University of California, Santa Barbara CA, 93106, United\nStates\n4\nDepartment of Electrical and Computer Engineering, IREAP, University of\nMaryland, College Park, MD 20742, United States\n†\nThese authors contributed equally to this work.\nE-mail:\n\n∗\n\nhubert.krenner@physik.uni-augsburg.de\n\nAbstract. Acousto-electric charge conveyance induced by a surface acoustic wave is\nemployed to dissociate photogenerated excitons. Over macroscopic distances, both\nelectrons and holes are injected sequentially into a remotely positioned, isolated\nand high-quality quantum emitter, a self-assembled quantum post. This process\nis found to be highly efficient and to exhibit improved stability at high acoustic\npowers when compared to direct optical pumping at the position of the quantum\npost. These characteristics are attributed to the wide matrix quantum well in which\ncharge conveyance occurs and to the larger number of carriers available for injection\nin the remote configuration, respectively. The emission of such pumped quantum\nposts is dominated by recombination of neutral excitons and fully directional when the\npropagation direction of the SAW and the position of the quantum post are reversed.\n\nPACS numbers: 71.35.-y, 77.65.Dq, 78.55.Cr, 78.67.Hc\n\n\fSAW mediated carrier injection into remote self-assembled QPs\n\n2\n\nAmbipolar acousto-electric charge conveyance of dissociated electrons and holes in\nthe plane of a quantum well (QW) based on piezoelectric surface acoustic waves (SAWs)\n[1] has been proposed to realize a precisely triggered single photon source operating at\nradio frequencies in the range from a few tens of megahertz up to several gigahertz.\nIn this scheme, electrons and holes are transported in the type-II potential modulation induced by the SAW and sequentially injected into a quantum dot (QD) which\nemits a single photon per SAW cycle [2]. Until now, this remote injection scheme has\nbeen investigated using QD systems of moderate optical quality or weak confinement\npotential such as QDs induced in surface-near QWs by stressor islands on the sample\nsurface[3, 4, 5], interface fluctuation QDs in disordered quantum wires (QWRs) [6, 7] or\nIndium-rich segments in GaAs nanowires (NWs) [8]. Photon correlation spectroscopy\nperformed on sharp emission lines of localized QD-like emission centers in acoustically\npumped QWRs and NWs revealed signatures of multiple emission centers contributing\nto the detected signals. These limitations arise from the weak confinement potential\nof these disorder based approaches [9]. Thus, alternative routes based on established\nself-assembled quantum dot nanostructures are required for which clear photon antibunching has been routinely observed [10, 11]. Moreover, these QDs can be embedded\nin high quality factor optical nanocavities to fully exploit the high gigahertz repetition\nfrequencies provided by SAWs using the Purcell enhancement of the spontaneous emission rate [12]. In conventional self-assembled QDs, the confined electronic states and\nthe resulting emission energies of excitonic complexes can be efficiently manipulated\nby a SAW [13, 14]. For the implementation of the envisioned remote acousto-electric\ninjection scheme, a high quality two-dimensional QW is crucially required to prevent\ncarrier losses in the vertical direction. The typical two-dimensional wetting layer on\nwhich these islands nucleate indeed provides a QW-like confinement potential, however,\ndue to its small thickness of < 1 nm, acousto-electric charge conveyance is inhibited by\nthe resulting low carrier mobilities [15]. One alternative system are height controlled,\nself-assembled quantum posts (QPs) [16], the height of which, in contrast to their QD\ncounterparts, can be controlled from ∼ 3 nm up to > 50 nm while preserving high quality\nsingle photon emission [17, 18]. Here, we report the direct observation of SAW-mediated\nelectron-hole injection into isolated, individual self-assembled QPs. Since these QPs are\nembedded in a wide lateral QW, the acousto-electric charge conveyance by the SAW is\nhighly efficient and remote carrier injection is demonstrated over macroscopic distances\nonly limited by the optically accessible area. After optical generation, electron-hole pairs\nare dissociated by the SAW and transported to the QP. The two carrier species arrive\nwith a fixed time delay of ∆t = 2.6 ns. This unique approach guarantees an inherently\nsequential injection of electrons and holes, a property which is challenging to achieve\ne.g. using Coulomb blockade. This mechanism is found to be highly directional with\nimproved stability even at highest SAW amplitudes in contrast to a configuration where\ncarriers are generated at the position of the emitter. Our results represent a major\nstep towards a precisely-triggered SAW-driven single photon source using high quality\nquantum emitters.\n\n\fSAW mediated carrier injection into remote self-assembled QPs\n\n3\n\nThe sample studied was grown by solid-source molecular beam epitaxy (MBE) on a\nsemi-insulating (001)-GaAs substrate. A single layer of ∼ 23 nm high QPs was realized\nusing eight repetitions of a growth cycle consisting of depositions of 1 monolayer of InAs\nand 7 monolayers of GaAs, each followed by 1 minute growth interruptions [16]. The\nsample was finalized by a 100 nm GaAs capping layer. During QP growth, the substrate\nrotation was interrupted giving rise to a coverage gradient and a variation of the QP\nsurface density on the substrate [19]. In the region where island nucleation breaks down,\nultra-low QP surface densities of < 0.005 QPs per μm2 are realized. Such ultra-low surface densities allow for optical investigation of individual QPs under both direct optical\nexcitation and under remote SAW-driven carrier injection since the average QP separation of & 15 μm is comparable to or larger than typical SAW wavelengths. On these\nsamples we fabricated interdigital transducer (IDT) electrodes for excitation of SAWs of\nwavelength λSAW = 15 μm, corresponding to SAW frequencies fSAW = 193 MHz at low\ntemperatures (T = 6 K). We studied these samples by conventional low-temperature\nmicro-photoluminescence spectroscopy. For optical excitation we used a diode laser\nemitting . 100 ps pulses (flaser = 80 MHz) with a photon energy of Elaser = 1.875 eV\nfocused by a 50× microscope objective to a ∼ 2 μm spot to photogenerate electron-hole\npairs in the GaAs continuum. The emitted luminescence of the sample was collected\nover the full field of view of the objective and sent to a 0.5 m imaging monochromator equipped with a liquid nitrogen cooled two-dimensional CCD detector for spectral\nand spatial analysis. Due to the time-integrated detection and the unlocked excitation\nscheme (fSAW ∼ 2.4flaser ), the recorded data provides an averaged picture of the SAWcontrolled carrier injection and recombination. For all experiments we employed low\noptical pump powers for which screening of the SAW-induced potential by the photogenerated carriers can be neglected.\nThe acousto-electric charge injection scheme is depicted schematically in Fig. 1. In\nthe center of the field of view (gray-shaded area), a focused laser (red circle) generates\nelectron-hole pairs. These are dissociated in the type-II modulation of the effective\nband edges of the QW by the SAW [1] as depicted schematically on the lefthand side\nof Fig. 1. The SAW itself is electrically generated by applying an rf voltage to an\nIDT and transports electrons and holes along its propagation direction. A single QP\nacts as a deep confinement potential in the conduction and valence bands into which\nelectrons and holes are sequentially injected [2, 5, 7]. An exciton is formed after each\nfull cycle of the SAW which radiatively recombines by emission of a single photon. On\nthe righthand side of Fig. 1 we present direct (spatial) images of the sample emission\nwithout and with a SAW applied. The excitation laser (Plaser = 72 nW) was focused\nat the center of the two images at x = y = 0 as marked by a red circle. The detected\nintensity is encoded in false color with yellow (black) corresponding to low (high) signal\nlevels. Here we used a 900 nm long pass to ensure detection only of emission originating\nfrom exciton recombination inside QPs. Clearly, with the SAW turned off, no signal\n\n\fSAW mediated carrier injection into remote self-assembled QPs\n\n4\n\nFigure 1. – Remote acousto-electric carrier injection – Center: An IDT\ngenerates a SAW which propagates through the field of view of the objective lens\n(gray-shaded area) with the pump laser focused in its center and a single QP shifted\nalong the SAW propagation direction. Left: Type-II band edge modulation induced by\nthe SAW leads to a spatial separation of electrons and holes and after acousto-electric\ncharge conveyance to sequential injection into the QP. Right: PL images of the QP\nemission without and with a SAW generated. The pump laser spot is located in the\ncenter. The QP emission isolated by a 900 nm longpass interference filter. A diffraction\nlimited emission spot is observed with the SAW applied due to acousto-electric charge\ntransport over a distance of 30 μm and subsequent injection into a single QP.\n\nis detected over the entire area. When a SAW is excited at Prf = +18 dBm on the\nlefthand side as indicated schematically by the IDT (not to scale), we observe a bright,\ndiffraction limited, point-like emission spot arising from emission of a single, isolated QP\nlocated at (x = 30 μm, y = 2 μm). This experiment directly confirms directional SAWmediated acousto-electric charge conveyance over a distance of two acoustic wavelengths\nand subsequent injection into an isolated zero-dimensional quantum emitter.\nIn the following, we investigate SAW-controlled carrier injection in detail. We distinguish between two different configurations, direct injection for which the excitation\nlaser is focused at the position of the QPs and remote, time delayed and sequential injection for which the point of carrier generation and the QP are spatially separated. In Fig.\n2 (a) and (b) we present emission spectra under weak optical pumping (Plaser = 22 nW) of\nthe same, single QP under direct and remote carrier injection, respectively, as indicated\nby the associated schematics. The distance under remote injection was d = −20 μm,\ncorresponding to more than 1.3 acoustic wavelengths, ensuring carrier injection occurs\nonly due to acousto-electric charge conveyance. The lower panels show the detected\nQP emission encoded in grayscale (white low, black high signal) as a function of the rf\npower applied to the IDT. For the directly excited QP [cf. Fig. 2 (a)] we observe the\ncharacteristic intensity change-over or switching behavior of dominant emission from\nthe negatively charged exciton (1X − = 2e + 1h) to charge neutral single excitons\n\n\fSAW mediated carrier injection into remote self-assembled QPs\n\n5\n\nFigure 2. – SAW power dependent emission under direct and remote charier\ninjection – Gray-scale plots of PL intensity (lower panels) as a function of SAW power\nunder direct (a) and remote injection (b) as indicated by the schematics with the\ncorresponding exciton configuration labeled. The normalized intensities of 1Xl0 (green\ntriangles/line), 1Xh0 (red squares/line) and 1X − (blue pentagons/lines) are plotted in\nthe upper panels. The quenching of QW emission (black bullets/line) is accompanied\nby a change-over to neutral exciton emission under direct excitation (a) and remote\ncarrier injection (b).\n\n0\n(1Xl,h\n= 1e + 1h) [15, 20]. For QPs, we mostly observe doublets with indices l and\nh denoting the lower and higher energy line. These arise from localized hole states at\nthe two ends of the QP which is confirmed by the observation of avoided crossing in electric field tunable structures [21] and selective injection under SAW pumping [20]. The\nabsolute energy spacing of this doublet depends on the actual morphology of the QPs\nand is comparably large for the example presented here. The switching occurs in the rf\npower range between 0 dBm and +5 dBm as illustrated by the extracted integrated and\nnormalized intensities in the upper panel. The 1X − emission (blue pentagons/lines) is\nlargely suppressed at Prf = 0 dBm and is replaced by emission of the two 1X 0 emission\nlines (red squares/line and green triangles/line). The onset of acousto-electric charge\nconveyance is further confirmed by the quenching of the QW PL in the same power\nrange which is plotted as a reference (black bullets/line) in the upper panel of Fig. 2 (a)\nand (b). For high rf power levels, Prf > +12 dBm, we observe a pronounced quenching\ndue to increasingly more efficient acousto-electric transport of the photo-excited carriers\naway from the QP position. This is depicted schematically in the upper panel of Fig. 3\n(a), where at low acoustic powers carriers being photogenerated within the 2 μm laser\nspot can be captured into the QP as indicated by the black arrows. In contrast, at the\nhighest acoustic power levels applied, a significant fraction photogenerated charges are\ntransported out of the generation area by the SAW indicated by the red arrows. Under\nthese conditions approximately half the photogenerated carriers created, predominantly\nfrom the hatched area in the lower panel Fig. 3 (a), are transported away from the po-\n\n\fSAW mediated carrier injection into remote self-assembled QPs\n\n6\n\nFigure 3. – Fractions of carriers available for injection into QP – (a) For direct\nexcitation the number of carriers available for injection (black arrows) into the QP is\nreduced compared to no SAW applied due to acousto-electric charge conveyance (red\narrows) of carriers generated in the hatched area. (b) For remote excitation electrons\nand holes generated in the entire area of the pump laser can be transported (red arrows)\nand can be injected (black arrows) into the QP leading to a reduced quenching of the\nemission at high acoustic powers.\n\nsition of the QP and cannot be captured. This net decrease of the number of available\ncarriers gives rise to the observed pronounced reduction of the observed total emission\nintensity.\nFor the case of remote acoustic carrier injection [cf. Fig. 2 (b)] into a QP located\n20 μm away from the position of the laser focus we observe no emission from the QP\nup to Prf = 0 dBm. As acoustic charge conveyance sets in and carriers are transported\nby the SAW to the QP, we detect emission arising from recombination of only 1Xl0 and\n1Xh0 states which gradually increases up the Prf = +12 dBm. Since 1X − generation is\nefficiently suppressed under sequential electron-hole injection, the corresponding emission is absent in the data of the remotely pumped QP. At high acoustic power levels,\nwe find two pronounced differences compared to the directly excited QP shown in Fig.\n2 (a): (i) The lower energetic branch of 1Xl0 becomes the dominant emission line under\nremote carrier excitation and (ii) the overall decrease of intensity is significantly reduced\ncompared to the directly excited QP. The first observation can be readily understood\nby taking into account that holes are transported in a maximum of the type-II band\nedge modulation [cf. Fig. 1]. At this phase of a Rayleigh type SAW, the lateral electric\nfield component is zero while the vertical component is maximum and oriented upwards\nalong the growth direction. Thus, holes are conveyed preferentially on the surface-near\nside of the matrix QW and preferentially injected in the upper end of the QP [20].\n\n\fSAW mediated carrier injection into remote self-assembled QPs\n\n7\n\nThis effect is expected to become more pronounced at high SAW amplitudes and under\nstrict sequential injection. Therefore, this vertical electric field effect is best resolved\nunder remote injection even at the relatively small separation between the pump laser\nspot and the QP of 1.2 lambdaSAW . The dissimilar quenching behavior cannot be explained by tunnel escape of electrons which is expected to be weak for typical SAW fields\nof < 10 kV/cm [22, 23] and should be the same under both pumping conditions. The\nweaker quenching behavior can be understood qualitatively by taking into account, that\nunder remote injection the QP is located outside the generation area as shown in Fig.\n3 (b). Thus, net a larger number of photogenerated carriers is transported to the QP\nposition and can be captured in its quantized energy levels in strong contrast to the case\nof direct excitation. In this simple picture, lateral spreading of carriers perpendicular to\nthe SAW propagation direction is not taken into account. This process, which so far has\nnot been included in numerical simulations of acousto-electric charge conveyance [24],\nwas found to be fast for electrons [25] and could be in parts responsible for the suppression of the 1X − emission [15]. However, since this effect decreases the electron density\nat the position of the QP, we can exclude it as a dominant mechanism for the geometry\nstudied. To fully understand the underlying microscopic processes, detailed studies of\nthe remote carrier injection with time-resolved detection schemes would be required.\nSuch experiments performed as a function of the pump laser-QP separation and the\napplied rf power could then be compared to numerical simulations in a two-dimensional\nextension of the semi-classical transport model introduced by Garcı́a-Cristóbal et al.\n[24].\n\nFigure 4. – Directional SAW driven carrier injection – Spatially resolved PL\nspectra of the same QP under direct optical excitation with no SAW applied (a) and\nremote injection with SAW propagating downwards (b) or upwards (c) and the QP\nspatially translated into the respective direction as indicated by the schematics.\n\nFinally, we address the directionality of the remote acousto-electric charge con-\n\n\fSAW mediated carrier injection into remote self-assembled QPs\n\n8\n\nveyance. In order to obtain spatial and spectral information, we do not integrate over\nthe entire CCD array but read out the spatial information encoded in the rows of the array while the spectral information is contained in the columns of the array. We mounted\nthe sample such that the SAW propagation direction (Prf = +10 dBm) was aligned with\nthe CCD columns. In Fig. 4 (a), we show a false color PL image recorded from the same\nQP studied previously under direct optical excitation (Plaser = 22 nW) and without a\nSAW applied. Clearly, emission is only found in the center row of the array marking the\nreference position of the laser focus. In a first step, we keep the optical pumping power\nconstant and moved the QP downwards. With a SAW propagating from top to bottom\n[Fig. 4 (b)], acoustic charge conveyance transports the photogenerated electrons and\nholes towards the remotely positioned QP. Due to remote sequential carrier injection\nwe detect the QP emission d = −20 μm below the point of optical charge generation in\nthe corresponding PL image. All data shown in Fig. 2 (b) was recorded in this configuration. Moreover, the switching from 1X − to 1Xl0 and 1Xh0 discussed in the previous\nsection is clearly resolved in the energy-domain. In a second step, moving the QP upwards and exciting the SAW propagating from bottom to top using the same acoustic\npower, the spatial configuration is reversed [cf. schematic with Fig. 4 (c)]. In the experimental data shown in Fig. 4 (c), we observe the same emission pattern, characteristic\nfor sequential electron/hole injection, but translated in space to d = +15 μm. Close\nexamination of the relative intensities reveal a slight modification of the relative intensities of 1Xl0 and 1Xh0 which could arise from the smaller separation of ∼ 1λSAW between\nthe QP and the pump laser spot in this configuration [8]. This confirms acousto-electric\ncharge conveyance from the center of the image upwards to the position of the QP. Thus,\nour SAW-based injection scheme allows for selective addressing of individual QPs using\ndifferent SAW propagation directions. In addition, multiple QPs with distinct and characteristic emission energies can be pumped by a single SAW beam when located along\nthe same propagation direction. To further exploit the directionality of this mechanism,\nNW-based approaches [8] could be extended to single crystal phase structures [26] with\nembedded axial QDs [27, 28].\nIn conclusion, we demonstrated directional, remote carrier injection into isolated\nself-assembled QPs employing acousto-electric charge conveyance induced by a SAW.\nOur findings demonstrate that QP with their surrounding wide matrix QW are an\nideal system for the realization of a precisely triggered SAW-controlled single photon\nsource [2]. In order to fully exploit the potential of this unique approach, further\nsteps have to be taken, namely the combination with high quality optical nanocavities\nto achieve Purcell-enhancement of the radiative emission rate and improved photon\nextraction. The latter is currently the limiting factor in order to directly observe\nacoustically pumped single photon emission which has been clearly observed before\nfor direct injection [17]. QPs have been readily coupled to DBR-microcavity lasers [29]\nwhich are fully compatible with SAW techniques [30] and also more advanced approaches\nbased on oxide aperture [12] or photonic crystal based structures [31] are now within\n\n\fSAW mediated carrier injection into remote self-assembled QPs\n\n9\n\nreach. For all-electrical operation of this type of single photon source lateral p-i-njunctions [32] will be used to inject electrons and holes from opposite sides into the\npropagation path of the SAW. An even more tantalizing direction is the extension to\nhigh-fidelity entangled photon pair generation using the biexciton-exciton cascade. Since\ncharged exciton formation is largely suppressed under direct [15] and remote sequential\nelectron-hole injection, our SAW-based approach could circumvent challenges arising in\nthe originally envisioned Coulomb-blockade controlled carrier injection [33] scheme. For\nthis approach self-assembled GaAs/AlGaAs QDs grown inside etched nanoholes [34, 35]\nmight be superior. For such QDs, the thickness of the wetting layer can be arbitrarily\nincreased for optimal acousto-electric charge transport, no emission doublets due to\nhole localization are observed. Moreover, the emission wavelengths of such QDs are\nblue-shifted to regions of higher sensitivity of Si-based detectors.\nAcknowledgements\nThis work was supported by the cluster of excellence \"Nanosystems Initiative\nMunich\" (NIM), by DFG via the Emmy Noether Program (KR 3790/2-1) and\nSonderforschungsbereich 631 and by the Alexander-von-Humboldt Foundation.\nReferences\n[1] Rocke C, Zimmermann S, Wixforth A, Kotthaus J P, Böhm G and Weimann G 1997 Physical\nReview Letters 78 4099–4102\n[2] Wiele C, Haake F, Rocke C and Wixforth A 1998 Physical Review A 58 R2680–R2683\n[3] Sopanen M, Lipsanen H and Ahopelto J 1995 Applied Physics Letters 66 2364–2366 URL\nhttp://link.aip.org/link/?APL/66/2364/1\n[4] Schülein F J R, Laucht A, Riikonen J, Mattila M, Sopanen M, Lipsanen H, Finley J J, Wixforth\nA and Krenner H J 2009 Applied Physics Letters 95 83122 URL http://link.aip.org/link/\n?APL/95/083122/1\n[5] Bödefeld C, Ebbecke J, Toivonen J, Sopanen M, Lipsanen H and Wixforth A 2006 Physical Review\nB 74 35407\n[6] Nötzel R, Niu Z, Ramsteiner M, Schönherr H P, Tranpert A, Däweritz L and Ploog K H 1998\nNature 392 56–59 URL http://adsabs.harvard.edu/abs/1998Natur.392...56N\n[7] Couto O D D, Lazić S, Iikawa F, Stotz J A H, Jahn U, Hey R and Santos P V 2009 Nature\nPhotonics 3 645–648\n[8] Hernández-Mı́nguez A, Möller M, Breuer S, Pfüller C, Somaschini C, Lazić S, Brandt O, Garcı́aCristóbal A, de Lima M M, Cantarero A, Geelhaar L, Riechert H and Santos P V 2012 Nano\nletters 12 252–8 ISSN 1530-6992 URL http://dx.doi.org/10.1021/nl203461m\n[9] Lazić S, Hey R and Santos P V 2012 New Journal of Physics 14 013005 ISSN 1367-2630 URL\nhttp://stacks.iop.org/1367-2630/14/i=1/a=013005\n[10] Michler P, Kiraz A, Becher C, Schoenfeld W V, Petroff P M, Zhang L, Hu E and Imamo\\u glu A\n2000 Science 290 2282–2285\n[11] Shields A J 2007 Nature Photonics 1 215–223\n[12] Strauf S, Stoltz N G, Rakher M T, Coldren L A, Petroff P M and Bouwmeester D 2007 Nature\nPhotonics 1 704–708\n[13] Gell J R, Ward M B, Young R J, Stevenson R M, Atkinson P, Anderson D, Jones G A C, Ritchie\n\n\fSAW mediated carrier injection into remote self-assembled QPs\n\n[14]\n[15]\n\n[16]\n\n[17]\n[18]\n[19]\n[20]\n[21]\n\n[22]\n\n[23]\n[24]\n[25]\n\n[26]\n\n[27]\n[28]\n\n[29]\n[30]\n[31]\n\n[32]\n\n[33]\n[34]\n\n10\n\nD A and Shields A J 2008 Applied Physics Letters 93 81115 URL http://link.aip.org/link/\n?APL/93/081115/1\nMetcalfe M, Carr S M, Muller A, Solomon G S and Lawall J 2010 Physical Review Letters 105\n37401\nVölk S, Schülein F J R, Knall F, Reuter D, Wieck A D, Truong T A, Kim H, Petroff P M,\nWixforth A and Krenner H J 2010 Nano Letters 10 3399–3407 ISSN 1530-6992 URL http:\n//www.ncbi.nlm.nih.gov/pubmed/20722408\nHe J, Krenner H J, Pryor C, Zhang J P, Wu Y, Allen D G, Morris C M, Sherwin M S and Petroff\nP M 2007 Nano letters 7 802–6 ISSN 1530-6984 URL http://www.ncbi.nlm.nih.gov/pubmed/\n17326694\nKrenner H J, Pryor C E, He J and Petroff P M 2008 Nano letters 8 1750–5 ISSN 1530-6984 URL\nhttp://www.ncbi.nlm.nih.gov/pubmed/18500845\nKrenner H J and Petroff P M 2009 Solid State Communications 149 1386–1394 ISSN 00381098\nURL http://linkinghub.elsevier.com/retrieve/pii/S0038109809002531\nKrenner H J, Stufler S, Sabathil M, Clark E C, Ester P, Bichler M, Abstreiter G, Finley J J and\nZrenner A 2005 New Journal of Physics 7 184 URL http://stacks.iop.org/1367-2630/7/184\nVölk S, Knall F, Schülein F J R, Truong T A, Kim H, Petroff P M, Wixforth A and Krenner H J\n2011 Applied Physics Letters 98 23109 URL http://link.aip.org/link/?APL/98/023109/1\nKrenner H J, Pryor C, He J, Zhang J P, Wu Y, Morris C M, Sherwin M S and\nPetroff P M 2008 Physica E: Low-dimensional Systems and Nanostructures 40 1785–1789\nISSN 13869477 (Preprint 0709.2392) URL http://linkinghub.elsevier.com/retrieve/\npii/S1386947707005188\nFry P W, Finley J J, Wilson L R, Lemaitre A, Mowbray D J, Skolnick M S, Hopkinson M, Hill G\nand Clark J C 2000 Applied Physics Letters 77 4344–4346 URL http://link.aip.org/link/\n?APL/77/4344/1\nKaniber M, Huck M F, Müller K, Clark E C, Troiani F, Bichler M, Krenner H J and Finley J J 2011\nNanotechnology 22 325202 URL http://stacks.iop.org/0957-4484/22/i=32/a=325202\nGarcı́a-Cristóbal A, Cantarero A, Alsina F and Santos P V 2004 Phys. Rev. B 69 205301 URL\nhttp://link.aps.org/doi/10.1103/PhysRevB.69.205301\nKraussJ, Wixforth A, Kalameitsev A, Govorov A, Wegscheider W and Kotthaus J 2002\nPhysical Review Letters 88 36803 ISSN 0031-9007 URL http://link.aps.org/doi/10.1103/\nPhysRevLett.88.036803\nKinzel J B, Rudolph D, Bichler M, Abstreiter G, Finley J J, Koblmüller G, Wixforth A and\nKrenner H J 2011 Nano letters 11 1512–1517 ISSN 1530-6992 URL http://www.ncbi.nlm.\nnih.gov/pubmed/21355606\nTribu A, Sallen G, Aichele T, André R, Poizat J P, Bougerol C, Tatarenko S and Kheng K 2008\nNano Letters 8 4326–4329\nvan Kouwen M P, Reimer M E, Hidma A W, van Weert M H M, Algra R E, Bakkers E P A M,\nKouwenhoven L P and Zwiller V 2010 Nano letters 10 1817–22 ISSN 1530-6992 URL http:\n//www.ncbi.nlm.nih.gov/pubmed/20387798\nKim H, Rakher M T, Bouwmeester D and Petroff P M 2009 Applied Physics Letters 94 131104\nISSN 00036951 URL http://link.aip.org/link/?APPLAB/94/131104/1\nde Lima Jr M M and Santos P V 2005 Reports on Progress in Physics 68 1639–1701\nFuhrmann D A, Thon S M, Kim H, Bouwmeester D, Petroff P M, Wixforth A and Krenner H J\n2011 Nature Photonics 5 605–609 ISSN 1749-4885 URL http://www.nature.com/doifinder/\n10.1038/nphoton.2011.208\nStavarache V, Reuter D, Wieck A D, Schwab M, Yakovlev D R, Oulton R and Bayer M 2006\nApplied Physics Letters 89 123105 ISSN 00036951 URL http://link.aip.org/link/?APPLAB/\n89/123105/1\nBenson O, Santori C, Pelton M and Yamamoto Y 2000 Physical Review Letters 84 2513–2516\nRastelli A, Stufler S, Schliwa A, Songmuang R, Manzano C, Costantini G, Kern K, Zrenner\n\n\fSAW mediated carrier injection into remote self-assembled QPs\n\n11\n\nA, Bimberg D and Schmidt O 2004 Physical Review Letters 92 ISSN 0031-9007 URL http:\n//prl.aps.org/abstract/PRL/v92/i16/e166104\n[35] Wang L, Kápek V, Ding F, Horton F, Schliwa A, Bimberg D, Rastelli A and Schmidt O 2009\nPhysical Review B 80 ISSN 1098-0121 URL http://prb.aps.org/abstract/PRB/v80/i8/\ne085309\n\n\f"}