{"id": "http://arxiv.org/abs/1108.1937v1", "guidislink": true, "updated": "2011-08-09T14:29:18Z", "updated_parsed": [2011, 8, 9, 14, 29, 18, 1, 221, 0], "published": "2011-08-09T14:29:18Z", "published_parsed": [2011, 8, 9, 14, 29, 18, 1, 221, 0], "title": "Universality in Bacterial Colonies", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.2036%2C1108.4638%2C1108.0005%2C1108.0288%2C1108.4382%2C1108.6166%2C1108.3319%2C1108.5238%2C1108.5908%2C1108.2227%2C1108.2924%2C1108.5066%2C1108.1935%2C1108.0069%2C1108.1870%2C1108.5322%2C1108.4008%2C1108.1775%2C1108.2462%2C1108.1814%2C1108.0528%2C1108.6154%2C1108.0656%2C1108.5710%2C1108.3653%2C1108.4190%2C1108.4067%2C1108.1301%2C1108.3984%2C1108.6258%2C1108.2902%2C1108.0160%2C1108.5814%2C1108.3386%2C1108.0982%2C1108.6111%2C1108.4036%2C1108.4085%2C1108.1600%2C1108.4677%2C1108.0915%2C1108.6074%2C1108.3968%2C1108.4557%2C1108.3290%2C1108.4250%2C1108.0566%2C1108.2278%2C1108.2417%2C1108.5776%2C1108.1937%2C1108.2467%2C1108.0684%2C1108.1511%2C1108.5365%2C1108.5000%2C1108.0887%2C1108.0565%2C1108.0700%2C1108.0823%2C1108.3458%2C1108.2545%2C1108.5539%2C1108.5856%2C1108.3186%2C1108.1522%2C1108.5795%2C1108.1199%2C1108.1571%2C1108.0652%2C1108.0769%2C1108.0334%2C1108.6016%2C1108.6179%2C1108.1436%2C1108.1964%2C1108.1195%2C1108.4864%2C1108.3704%2C1108.0159%2C1108.3515%2C1108.2640%2C1108.2071%2C1108.2429%2C1108.2074%2C1108.5261%2C1108.5177%2C1108.0322%2C1108.0518%2C1108.3132%2C1108.4778%2C1108.2584%2C1108.3095%2C1108.6305%2C1108.2972%2C1108.0980%2C1108.4018%2C1108.5848%2C1108.4344%2C1108.0257%2C1108.1053&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Universality in Bacterial Colonies"}, "summary": "The emergent spatial patterns generated by growing bacterial colonies have\nbeen the focus of intense study in physics during the last twenty years. Both\nexperimental and theoretical investigations have made possible a clear\nqualitative picture of the different structures that such colonies can exhibit,\ndepending on the medium on which they are growing. However, there are\nrelatively few quantitative descriptions of these patterns. In this paper, we\nuse a mechanistically detailed simulation framework to measure the scaling\nexponents associated with the advancing fronts of bacterial colonies on hard\nagar substrata, aiming to discern the universality class to which the system\nbelongs. We show that the universal behavior exhibited by the colonies can be\nmuch richer than previously reported, and we propose the possibility of up to\nfour different sub-phases within the medium-to-high nutrient concentration\nregime. We hypothesize that the quenched disorder that characterizes one of\nthese sub-phases is an emergent property of the growth and division of bacteria\ncompeting for limited space and nutrients.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.2036%2C1108.4638%2C1108.0005%2C1108.0288%2C1108.4382%2C1108.6166%2C1108.3319%2C1108.5238%2C1108.5908%2C1108.2227%2C1108.2924%2C1108.5066%2C1108.1935%2C1108.0069%2C1108.1870%2C1108.5322%2C1108.4008%2C1108.1775%2C1108.2462%2C1108.1814%2C1108.0528%2C1108.6154%2C1108.0656%2C1108.5710%2C1108.3653%2C1108.4190%2C1108.4067%2C1108.1301%2C1108.3984%2C1108.6258%2C1108.2902%2C1108.0160%2C1108.5814%2C1108.3386%2C1108.0982%2C1108.6111%2C1108.4036%2C1108.4085%2C1108.1600%2C1108.4677%2C1108.0915%2C1108.6074%2C1108.3968%2C1108.4557%2C1108.3290%2C1108.4250%2C1108.0566%2C1108.2278%2C1108.2417%2C1108.5776%2C1108.1937%2C1108.2467%2C1108.0684%2C1108.1511%2C1108.5365%2C1108.5000%2C1108.0887%2C1108.0565%2C1108.0700%2C1108.0823%2C1108.3458%2C1108.2545%2C1108.5539%2C1108.5856%2C1108.3186%2C1108.1522%2C1108.5795%2C1108.1199%2C1108.1571%2C1108.0652%2C1108.0769%2C1108.0334%2C1108.6016%2C1108.6179%2C1108.1436%2C1108.1964%2C1108.1195%2C1108.4864%2C1108.3704%2C1108.0159%2C1108.3515%2C1108.2640%2C1108.2071%2C1108.2429%2C1108.2074%2C1108.5261%2C1108.5177%2C1108.0322%2C1108.0518%2C1108.3132%2C1108.4778%2C1108.2584%2C1108.3095%2C1108.6305%2C1108.2972%2C1108.0980%2C1108.4018%2C1108.5848%2C1108.4344%2C1108.0257%2C1108.1053&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The emergent spatial patterns generated by growing bacterial colonies have\nbeen the focus of intense study in physics during the last twenty years. Both\nexperimental and theoretical investigations have made possible a clear\nqualitative picture of the different structures that such colonies can exhibit,\ndepending on the medium on which they are growing. However, there are\nrelatively few quantitative descriptions of these patterns. In this paper, we\nuse a mechanistically detailed simulation framework to measure the scaling\nexponents associated with the advancing fronts of bacterial colonies on hard\nagar substrata, aiming to discern the universality class to which the system\nbelongs. We show that the universal behavior exhibited by the colonies can be\nmuch richer than previously reported, and we propose the possibility of up to\nfour different sub-phases within the medium-to-high nutrient concentration\nregime. We hypothesize that the quenched disorder that characterizes one of\nthese sub-phases is an emergent property of the growth and division of bacteria\ncompeting for limited space and nutrients."}, "authors": ["Juan A. Bonachela", "Carey D. Nadell", "Joao B. Xavier", "Simon A. Levin"], "author_detail": {"name": "Simon A. Levin"}, "author": "Simon A. Levin", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/s10955-011-0179-x", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1108.1937v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1108.1937v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "12 pages, 5 figures", "arxiv_primary_category": {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nlin.AO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.bio-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "q-bio.CB", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1108.1937v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1108.1937v1", "journal_reference": "Journal of Statistical Physics: Volume 144, Issue 2 (2011), Page\n  303-315", "doi": "10.1007/s10955-011-0179-x", "fulltext": "Universality in Bacterial Colonies\nJuan A. Bonachela∗1 , Carey D. Nadell1,2 , João B. Xavier3 , and Simon A. Levin1\n\narXiv:1108.1937v1 [cond-mat.stat-mech] 9 Aug 2011\n\n1\n\nDepartment of Ecology and Evolutionary Biology, Princeton University, Princeton, NJ,\n08544-1003, USA\n2\nDepartment of Molecular Biology, Princeton University, Princeton, NJ, 08544-1033,\nUSA\n3\nProgram in Computational Biology, Memorial Sloan-Kettering Cancer Center, 1275\nYork Avenue, Box 460, New York, NY, 10065, USA\n\nAbstract\nThe emergent spatial patterns generated by growing bacterial colonies have been the focus of intense study in\nphysics during the last twenty years. Both experimental and theoretical investigations have made possible a clear\nqualitative picture of the different structures that such colonies can exhibit, depending on the medium on which\nthey are growing. However, there are relatively few quantitative descriptions of these patterns. In this paper,\nwe use a mechanistically detailed simulation framework to measure the scaling exponents associated with the\nadvancing fronts of bacterial colonies on hard agar substrata, aiming to discern the universality class to which the\nsystem belongs. We show that the universal behavior exhibited by the colonies can be much richer than previously\nreported, and we propose the possibility of up to four different sub-phases within the medium-to-high nutrient\nconcentration regime. We hypothesize that the quenched disorder that characterizes one of these sub-phases is\nan emergent property of the growth and division of bacteria competing for limited space and nutrients.\n\nIntroduction\nThe use of statistical physics to unravel biological problems has yielded many novel insights into the living\nworld. Numerous examples can be cited, including the application of statistical mechanics to ecological or\nmetabolic networks [1, 2], or the use of phase transition theory and correlation functions to understand\nthe behavior of animal collectives [3, 4]. One of the most remarkable instances of marriage between\nphysics and biology concerns the emergent spatial patterns produced by growing bacterial colonies.\nBeginning with a strip or drop of bacterial culture inoculated on an agar plate, the growth and division\nof cells over time results in an emergent colony pattern that varies with nutrient and agar concentration\nin the underlying medium. This system presents many different biological and physical questions whose\nanswers require the application of different conceptual approaches. For instance, we can analyze the\ninfluence of cell group structure on the evolution of cooperative or competitive secretion phenotypes,\nmeasuring the reproductive fitness of idealized strains [5, 6]. On the other hand, if we are interested in\na morphological characterization of the colony's propagating front, different physical properties of the\nsystem must be analyzed.\nThe Morphological Phase Diagram of Bacterial Colonies\nMore than two decades ago, Matsuyama et al. [7] and Fujikawa and Matsushita [8] showed that bacterial\ncolony patterns obtained in the laboratory can be fractal objects [9]. The properties of the emergent\nfractal depend mainly on two factors: i) nutrient concentration, C, strongly influences cell growth rate,\nand ii) agar concentration, CA , controls cell mobility by altering the hardness of the substratum on which\nthe colony is expanding. In the absence of special forms of collective cell motility [10], bacterial colony\n∗ Corresponding\n\nauthor: jabo@princeton.edu\n\n1\n\n\fFigure 1: Sketch of the morphological phase diagram shown by bacterial spatial patterns (adapted with permission from\n[15]; copyrighted by the Physical Society of Japan). Our work will be focused on the shaded zone, called here the rough\nregime.\n\npatterns may be classified with a two-dimensional phase diagram. Using Bacillus subtilis, Fujikawa,\nMatsushita and collaborators [8, 11, 12] defined a phase diagram that comprises five regions with different\nqualitative behaviors resulting from the interaction between biological and physical factors (see Fig.1):\n\u0015 At low agar concentration, cells can exhibit active flagellar motility. At low nutrient concentration\n(zone I), individuals tend to deplete local nutrient supplies rapidly and disperse in search of zones\nwith better growth conditions. The resulting colonies consist of many long, thin branches (the\nso-called dense branched morphology, DBM) [13]. When nutrient concentration is increased, cells\ngrow to higher densities with increased resource availability along the advancing front; the resulting\npattern is compact and smoothly circular (zone II).\n\u0015 At medium agar concentration and relatively high nutrient availability, colonies consist of concentric\nrings that result from periodic alternation between static and motile stages with positive growth\nrates (zone III) [14, 15].\n\u0015 At high agar concentration, the substratum becomes hard and dry enough that cells cannot move\nby active means. Thus, low nutrient concentration results in patterns similar to the DBM, but\nwith fewer, thicker branches due to limited cell movement [11, 12, 13]. These patterns (zone IV)\nresemble those created by diffusion-limited aggregation (DLA) processes [16], with a very similar\nfractal dimension [7, 8]. For medium-to-high nutrient levels, the colony patterns are compact again,\nbut with more irregular fronts than those obtained with low agar concentration (zone V) [12, 17].\nMany different models have managed to reproduce parts or all of the morphological phase diagram\nby adding new biological ingredients, such as cooperativity by means of chemotactic signaling [13], or\nnew physical ingredients, such as instabilities induced by fluctuations during cell diffusion [18]. Matsushita et al. [19] introduced a three-equation reaction-diffusion model capable of reproducing, at least\nphenomenologically, all regions of the phase diagram described above.\nThanks to this considerable amount of both experimental and theoretical work, the qualitative picture\nof the bacterial colony pattern phase diagram is well understood.\nQuantitative Description\nBacterial colony patterns are excellent candidates for analysis via propagating-front theory, due to a\ncorrespondence between the biology of bacterial growth and the physical aspects of nonliving fronts\nstudied in statistical physics. Let us consider high agar concentrations (that is, increased surface hardness\nand minimized bacterial mobility) and an initially flat inoculum. As bacteria grow and divide, they\npassively shove each other, which causes the colony front to advance in space. Let h(x, t) be the distance,\nat time t, between the top of the cell group and the basal substratum at its linear coordinate x (see\nFig.2). Importantly, not all the cells can grow and divide. Only those that can access nutrients, namely\n2\n\n\fthose forming an active layer at the advancing front, can do so (see inset in Fig.2). The depth of this\nactive layer depends on nutrient penetration into the group. The identification of growth and shoving\nas the main driving forces allows us to draw an analogy with non-living propagating fronts or driving\ninterfaces from statistical physics, like those formed by fire on a burning sheet of paper or water absorbed\ninto a porous medium [9].\nThe main observable measured in the study of these fronts is the variance in surface height, also\ntermed the interface width or roughness (a measurement of the lateral correlations at the interface). It\nis defined as:\nW (L, t) =\n\n\u001c\n\n\u0002\n\u00032\nh(x, t) − h\n\n\u001d1/2\n\n,\n\n(1)\n\nwhere the overline represents spatial averages, < . > the average over runs of the experiment, and L is\nthe inoculation strip length (system size, hereafter). A family of different 2-dimensional colony patterns\nmay arise, depending on the environmental conditions. If the colony pattern is fractal or compact, the\nfront can be treated a priori as a self affine object, and the so-called Family-Vicsek scaling may be\nassumed [20]:\n β\nfor t < tx\n t\n.\n(2)\nW (L, t) ∼\n α\nL\nfor t > tx\n\nThat is, for short times the colony roughness follows a power law behavior defined by the growth exponent,\nβ; at time t = tx , it saturates to a size-dependent value W = Wst (L) whose finite-size scaling defines the\nroughness exponent, α. From Eq.(2) we can deduce a power-law dependence of the saturation time on\nsize:\ntx ∼ Lα/β ,\n\n(3)\n\nwhere z = α/β is the so-called dynamic exponent. Thus, two independent exponents determine the\nbehavior of the interface.\nVicsek et al. [17] performed the first experimental measurement of one of these scaling exponents.\nThey obtained a non-trivial value for the experimental roughness exponent, αexp , associated with the\ngrowth of Escherichia coli and B. subtilis. Some time later, similar values were independently obtained\nusing B. subtilis in the rough regime [12].\nIn the experimental measurements reported in the literature described above, the αexp exponent was\nmeasured by choosing different parts of a growing colony as replicates at successive time points of\ntheir saturation regimes. At each of these time points, several boxes of lateral size l were used for the\nmeasurement of finite size effects over the roughness of the interface [12, 17]. Let us briefly analyze this\nobservable, which we designate wexp . If we define the \"local roughness\" of the front as [21]:\nE1/2\nD\n2\n,\nw(l, t) = h[h(x, t) − hhil ] il\n\n(4)\n\nwhere < . >l represents a spatial average over boxes of size l, the behavior of this local observable\nresembles that of the global variable, but with different exponents:\n β\nfor t < t′x\n t\nw(l, t) ∼\n.\n(5)\n αloc\nl\nfor t > t′x\n\nSystems in which α 6= αloc show what is called anomalous roughening, while regular self-affine interfaces\nfulfill the standard scaling for the roughness α = αloc [22]. For l ∼ a, where a is the grid spacing (or,\nin this case, the cell diameter), w(l ∼ a, t) exhibits power-law behavior with positive exponent for cases\nof anomalous roughening, while it is constant or decreases with time for standard self-affine interfaces\n[21]. For these standard self-affine interfaces, the finite-size scaling of this local roughness provides a\ngood measurement of the global, universal exponent α. For interfaces showing anomalous roughening,\nhowever, the values of local exponents are not necessarily universal [23], and we therefore cannot infer\n3\n\n\fKPZ [26]\nqKPZ[27]\nqKPZ (F > Fc )\nExperiments [12, 17]\nTheoretical Model\nPresent Work\n\nβ\n1/3\n3/5\n0.62(3)\n−\n0.65 [25]\n0.61(5)\n\nα\n1/2\n3/4\n0.75(5)\n−\n0.80 [25]\n0.68(5)∗\n\nz\n3/2\n5/4\n1.19(5)\n−\n1.15 [25]\n1.11(17)∗\n\nαloc\n1/2\n3/4\n0.68(5)∗\n−\n−\n0.68(5)\n\nαexp\n−\n−\n0.72(5); 0.68(5)\n0.74 − 0.78(7)\n0.74 [24]\n0.67(5)\n\nSTANDARD SELF-AFF.\n\nX\nX\nX\n−\n−\nX\n\nTable 1: Value of the exponents for the different universality classes, experiments and numerical simulations mentioned in the text. The values with an asterisk have been calculated using Eq.(3) or by using\nthe standard self-affinity feature of w(l, t). The two values for αexp for the moving qKPZ correspond to\nmeasurements using large L (left) and a system size equivalent to those used in our simulation framework\n(right).\nthe universal behavior of the system only by measuring them. In both cases, as l → L, w(l, t) converges\nto W (L, t).\nThe observable measured in experiments, wexp , is the result of performing this local finite-size scaling\nby averaging over multiple time points of the same run, using different parts of the same system as\nindependent replicates. Given enough separation between time and spatial sampling points, wexp =\nw(l, t) and, thus, αexp = αloc . In the experimental work mentioned above, measurements of this wexp\nperformed in zone V yielded a scale-free behavior of the observable, with an exponent in the range\nαexp = 0.74 − 0.78 with a standard error of up to 0.07 [12, 17]. This result is supported by several\ntheoretical models [24, 25] (see table 1).\nThus, with simple concepts and observables commonly used in statistical physics, one may characterize the non-trivial morphology of bacterial colony fronts and quantitatively compare the colony patterns\nproduced by different strains of bacteria. Similar values for the exponents measured in different bacterial\nstrains indicate that, despite the varying microscopic details and interactions specific to each strain, they\nshare the same basic biological and physical ingredients at a larger scale of observation. That is, they\nshow the same universal behavior.\nMuch less attention has been paid to the universal behavior exhibited by bacterial colony patterns.\nAttending to the expected symmetries in the colony patterns (i.e. the different terms of the equations in\nthe theoretical models), the current consensus is that the branches of the low nutrient regimes are the\nresult of a DLA process (zone IV) or DBM (zone I). The concentric-ring pattern (zone III) is treated\nas a special case, and the flat circular pattern (zone II) as a trivial one [28]. However, the behavior of\nthe compact pattern observed in phase V (the rough regime, from now on) remains contentious. This is\nmainly because the exponent associated with the only measured observable, the roughness exponent, is\ninsufficient to be conclusive in its classification. With no other observable measured, we cannot be sure\nif, for instance, the interface shows anomalous roughening, in which case αexp would not represent the\nglobal roughness of the front. In that case, the measurement of the local exponent would not provide\nany information about the universal behavior of the surface (see above).\nHere, we will attempt to fill this gap by studying bacterial colony fronts from the point of view of\nuniversality. By focusing on the rough regime (zone V), we will show that the behavior of the propagating\nsurfaces can be much richer than that described in the cited experimental work, prompting a modification\nof the phase diagram portrayed above. Also, we will provide the whole set of exponents defined in Eqs.(2)(3) supporting our classification, and determine which are the relevant biological and physical ingredients\ngiving rise to such values for the exponents.\n\nA Proxy for the Experiments\nTo measure experimentally the proposed set of exponents, we must be able to reproduce the environmental conditions belonging to the regime under consideration, namely the rough regime, for each replicate.\n4\n\n\fFigure 2: Patterns resulting from the growth of the colony starting from an initial inoculum of L = 500 μm with periodic\nboundary conditions. Nutrient concentrations are C = 0.05 g/l (left) and C = 3 g/l (right). Inset: Illustration of the\nactive layer (green circles) and how it distorts the bulk liquid nutrient field, creating a boundary layer; inactive cells are\nrepresented in black; reproduced from [5].\n\nHere, cells are not actively motile, so growth and passive shoving are the sole mechanisms that induce\ncolony front propagation.\nTo characterize the behavior of the bacterial colony fronts, an ideal experiment should use independent\nreplicates to measure the exponents presented in Eq.(2)-Eq.(5). An exhaustive sweep of the nutrient\nconcentration values with sufficient replication to obtain good statistics is highly time-consuming, and\nthough we are performing such experimental work (to be reported elsewhere [29]), here we will use a\nmechanistically detailed simulation framework. Our framework is derived from the latest generation of\nagent-based models developed by chemical engineers to predict the structure and metabolic activity of\nbacterial communities [30]. The model has already been used to study colony structure patterns in the\nhigh agar concentration regime (zones IV and V), with excellent experimental support [30, 31, 32]. With\nthis simulation framework, we can monitor the state of every cell and its interaction with the nutrient\nfield and the rest of the group. Also, we have total control over environmental conditions and individual\ntraits, including maximum growth rate and the ability to absorb nutrients [33]. The tractability offered\nby these individual-based simulations allows us to perform a finer exploration of the space of parameters\nthat contribute to colony pattern formation. This will be useful not only for the goals of this paper, but\nalso for guiding our ongoing and future work with laboratory experiments.\nBriefly, our framework comprises two overlapping layers, one of which is divided into a grid that tracks\nlocal nutrient concentration, and the other of which monitors bacterial cells that are implemented offlattice, i.e. as rigid circles in a continuous space. We consider the growth of a generic bacterial strain\nwhose physiological traits are parametrized to those of E. coli. Cells grow according to local nutrient\nconcentration, and once they reach a maximum radius of 0.75 μm, they divide into two daughter cells.\nA shoving algorithm is used to prevent overlapping between cells as they grow and divide. The model\nassumes a bulk fluid in which nutrient concentration is held constant, and implements a boundary layer\nin which nutrient concentration profiles are calculated by solving the following reaction-diffusion equation\nto equilibrium at each time step:\n1\n∂Cloc\n= D∇2 Cloc − μ,\n(6)\n∂t\nY\nwhere Cloc is the local nutrient concentration, D is the nutrient diffusivity, Y is a metabolic yield coefficient, and μ is a Monod-type bacterial growth rate expression [33]. In calculating nutrient concentration\nprofiles this way, we follow the common assumption that reaction-diffusion is much faster than bacterial\ngrowth and metabolism. More details on the simulation framework can be found in [30].\nFixing all other parameters, we will vary the bulk nutrient concentration, C, and system size, L, to\nmeasure the value of the exponents defined in Eqs.(2)-(5). The system size will range from L = 300 μm\nto L = 600 μm, covering the maximum window sizes used in experimental measurements (up to 400 μm\nin [12]). In addition, we will monitor w(l ∼ a, t), to discern whether the system shows anomalous\n5\n\n\f0.7\n\nw(l << L,t)\n\n6\n\n4\n\n0.6\n\n1\n\n10\n\nt (h)\n2\n\nW(t) (μm)\n1\n\n10\n\nt (h)\n\nFigure 3: Left: Plot of the wexp (l) function for two different system sizes; after an initial transient, they both converge\nto a power law with exponent αexp = 0.67(5). The colony pattern is compact and rough (inset). Right: Dynamic behavior\nof the W (t) function, showing a power law with an exponent β = 0.61(5) for more than 10h of colony growth. Right, inset:\nBehavior of w(t); the zero slope of the curve indicates that α = αloc = αexp .\n\nroughening (see above). Due to technical reasons, the duration of the experiment is limited to the time\nneeded by the colony to reach hmax = L, which depends mainly on nutrient concentration.\nWe begin by checking that our model generates a qualitatively similar behavior to that found in the\nhigh-agar concentration experiments. Figure 2 shows that low (left) and medium (right) bulk nutrient\nconcentration result in colony patterns similar to those of zones IV and V, respectively, with thick sparse\nDLA-like branches in the former case and a compact rough pattern in the latter [12, 17].\nNow, we focus our attention on a quantitative characterization of the rough regime. For one selected\nnutrient concentration, C, belonging to this regime, we first measured the exponent αexp . One example\nof the wexp curve can be seen in the left panel of Fig.3 (red points), where an initial strip of L = 400 μm\nwide was grown with nutrient concentration C = 3.8 g/l (the resulting colony pattern is shown in the\ninset of the figure). Choosing this size, a saturating regime was found for the duration of the simulation,\nat which we measured αexp = 0.67(5). For the larger l, as can be expected, wexp saturates due to the\napproach of w(l, t) to W (L, t). This result is very robust, for it is shared by the whole range of compact,\nrough patterns tested (αexp = 0.62(5) − 0.75(5)). The values of the exponents measured fall into or close\nto the interval reported in experiments, within error bars (see table ).\nWe also measured, for L = 400 μm, the local roughening exponent, obtaining αlocal = 0.68(5). The\ntemporal evolution of w(l ≪ L, t) (see right inset, Fig.3) shows a constant behavior, indicating that\nα = αloc = αexp for the colony. The growth exponent was measured for the largest system size (L =\n600 μm), giving a value of β = 0.61(5). Using Eq.(3), the derived dynamic exponent is z = 1.11(17).\nBy collapsing the curves for different system sizes ranging from L = 300 μm to L = 600 μm [34], we\nindependently confirmed these measurements. These exponents are in accordance with those found in\n[25] with a reaction-diffusion model similar to that introduced in [19] (see above). We now turn our\nattention to determining the universality class to which the system belongs.\nA Universality Class for the Compact, Rough Patterns\nThe Eden model is the paradigm of toy models representing growing cell colonies [35, 36, 37]. In one of its\nversions, a site along the colony front is randomly chosen each time step and one new cell is placed at any\nof its free surrounding locations [36]. The basic ingredients of this model are i) a source of stochasticity\nworking each time step, i.e. an annealed noise, due to the random choice of the site at which to deposit\na new cell, and ii) lateral growth, generated by the possibility of choosing a neighboring site for the\nnew cell. These two main ingredients are described by the mesoscopic Langevin equation known as the\nKardar-Parisi-Zhang equation [26]:\n∂t h(x, t) = λ(∇h)2 + D∇2 h + F + ση(x, t),\n\n6\n\n(7)\n\n\fwhere D, λ, F and σ are constants, and η, an uncorrelated (white) noise. The first term in the r.h.s.\nrepresents lateral growth and the second term represents an effective diffusion generated by it. The\nexponents characterizing this universality class have been calculated not only numerically, but also\nanalytically; in 1 + 1 (x and h) dimensions, they are: α = αloc = 1/2, β = 1/3, z = 3/2 [9].\nDue to the similarities between the Eden model patterns and bacterial colonies, KPZ has been suggested\nas the universality class that describes colony growth. Most of the theoretical models for bacterial growth\nrequire a non-linear diffusivity function for the active cells to generate compact patterns similar to those\nof phase V. The simplest of these functions, in which diffusion is proportional to the local density of\nactive cells, develops eventually the lateral growth and effective diffusion associated with the growth of\nthe front in the KPZ equation, Eq.(7) [38].\nHowever, the large α exponent found in experiments does not match that of the KPZ class (see table\n1). It represents stronger lateral correlations, and has been argued to be the result of nonlocal interaction\nbetween the moving cells, or a consequence of the rod shape of the bacteria used in experiments (E. coli\nand B. subtilis). In the rough regime, these particular strains form folding chains lying very close together,\ncausing lateral correlations to develop more quickly [12]. Such a large α exponent value is also found in\nsystems with different stochastic terms, like non-Gaussian thermal noises, or quenched noises [9, 39].\nIf we replace the thermal noise of Eq.(7) by a quenched noise, η(x, h), the interface changes its universal\nbehavior. For F < Fc , the advance of the surface is hindered and eventually prevented by pinning\nsites, represented by the quenched noise. For F > Fc , the interface is able to overcome the pinning\nplaces and grows indefinitely. At F = Fc , the interface undergoes a second order phase transition\nbetween the pinned (non-moving) phase and the depinned (moving) phase, characterized by the exponents\nα = αloc = 0.63(3), β = 0.67(5), z = 1.01(1) [40] (or α = 3/4 β = 3/5, z = 5/4, analytically deduced\nin [27]), which define the so-called quenched KPZ class (qKPZ). This scaling is retained in the moving\nphase (α = αloc = 0.75(5), β = 0.62(3), z = 1.18(5), own measurements). Note the large value for α,\nclose to those observed in the experiments and numerical simulations of the theoretical models (see table\n). Although different sources of quenchedness such as heterogeneities of the agar substratum [9, 24]\nhave been proposed to influence expanding bacterial colonies, the exact origin for the large α exponent\nis still controversial.\nInterestingly, our mechanistic model produces a roughness exponent similar to those reported in real\nexperiments, but none of the proposed explanations for this exponent are present: the cells are circular,\nshoving events move them randomly very short distances, and there is no possibility for substratum\nheterogeneity in our framework. Moreover, our measurements agree with the set of theoretical exponents\nfor the qKPZ class. Cell-cell shoving events generate the short-range lateral growth and diffusion terms\nand the thermal noise but, what is the source of quenchedness?\nIn our case, quenchedness is an emergent feature of the colony. It is the result of a non-trivial interaction\nbetween cells and the nutrient field gradient. The growth of each individual is entirely dependent on\nthe amount of nutrient that it can access (see above), which is conditional on the interaction between\nthe nutrient field and the focal cell and its neighbors. Individuals residing at the peak of a region in the\ncolony with larger height than its immediate surroundings have better access to nutrients and grow more\nquickly. On the other hand, growth rate is reduced among individuals at the bottom of regions with\nsmaller height than the surroundings, where nutrient concentration is reduced due to consumption by\nneighboring cells; the propagation of the colony front is therefore reduced in these \"valleys\" (see Fig.4).\nCompetition between cells for the available resource can thus generate points at the interface with\nsubstantially reduced propagation velocity [41]. Moreover, this inequality of propagation is subject to\npositive feedback: the slower the propagation of the front at a site in comparison with the neighbors,\nthe deeper the valley becomes and the more severely nutrient access decreases. This feedback effect can\ncause individuals in the valley to stop growing entirely, creating effective pinning sites along the front.\nSuch pinning sites can only be overcome by the interface by means of an increased external pulling force\n(nutrient concentration, C, in this case) or by lateral growth, which are the same mechanisms exhibited\nby qKPZ interfaces.\nFor the values of bulk nutrient concentration used for our measurements (see above), the pinning sites\n\n7\n\n\fFigure 4: Generation of effective pinning sites by means of the feedback mechanism described in the text. The nutrient\nconcentration at the bottom of the valleys is so low that cells stop growing. Cells at the top, however, can access the bulk\nconcentration, growing at a much larger rate (see [33]). Left: State of the colony at time t = 41h. Right: state of the\ncolony 8 hours later.\n\nare always eventually overcome, behavior that corresponds to the moving phase of a propagating front\nadvancing through a random environment (quenched disorder). In this way, we can see that the bacterial\nprofiles of our agent-based model have the same basic ingredients and quantitative behavior of a qKPZ\ninterface in its supercritical phase. For system sizes similar to those of our framework, the theoretical\nfinite-size exponents of that class agree with our measurements (see Table 1).\nA Richer Rough Phase\nIn addition to the quenched noise, we must consider the stochasticity inherent in the shoving events\namong growing and dividing cells for a full description of cell colony patterns. We will aim to explain\nhow the competition between these two noises could act as the nutrient concentration is varied in the\nrough regime, by using the general equation:\n∂t h(x, t) = λ(∇h)2 + D∇2 h + F + σ1 η1 (x, t) + σ2 η2 (x, h),\n\n(8)\n\nwith F and the ratio σ1 /σ2 changing with C:\n\u0015 For a medium nutrient concentration, the resource is quickly depleted in valleys, while the rest of\nthe front can grow at different velocities. Pinning sites therefore emerge easily, while the number\nof shoving events is low because the growth rate and, thus, the number of birth events, depend on\nnutrient concentration [33]. In Eq.(8), this is translated into a small σ1 /σ2 . Therefore, this source\nof annealed noise remains asymptotically irrelevant for the macroscopic behavior of the front as\ncompared with the self-generated quenched noise. It is the reported moving-qKPZ regime.\n\u0015 As nutrient concentration is increased, the growth rate of the cells also increases and so does\nthe mean velocity of the interface. Birth events and the subsequent shoving are more frequent.\nThis hinders the formation of deep valleys, eventually overcome by the advancing colony front.\nThis corresponds to both a larger F and a larger amount of annealed noise (larger σ1 ), leading\nto a behavior that would be governed by the KPZ equation due to the irrelevance of the present\nquenchedness.\n\u0015 If the bulk nutrient concentration is further increased, most or all cells in the colony layer have\naccess to inexhaustible resources and grow at the maximum rate at all times (F ≫ 1), leading to a\ncompletely flat colony surface. A summary sketch can be found in Fig.5.\nThese observations motivate further exploration of the parameter space, varying the value of the\nnutrient concentration in search for the different regimes described above. While we could find a range\n8\n\n\fFigure 5:\n\nSketch of the rough part (zone V) of the phase diagram, showing the different sub-phases discussed in the text.\n\nof concentrations with exponents in agreement with those of qKPZ universality class (see Table 1), we\nwere not able to measure, for any C, a set of exponents fully compatible with those of the KPZ class. This\nmight be due to the time limitation of the framework: the higher the value of bulk nutrient concentration,\nthe shorter the time required by the growing colony to reach hmax (see above), making it more difficult\nto look for crossovers in high C regimes. We may, thus, attribute the missed KPZ regime to a lack of\nobservation of the asymptotic behavior of the observables. We are currently developing a new version of\nthe simulation framework in order to overcome this technical limitation [29].\nAt very high nutrient concentrations, a completely flat interface is easily recovered. The transition from\na flat behavior of W (L, t) to a non-trivial value for its associated exponents indicates that the bacterial\ncolony undergoes a roughening phase transition. However, such flat examples will be hardy seen under\nreal experimental conditions (see below).\nAt very low bulk nutrient concentration the interface cannot overcome pinning sites, while the rest\nof the active layer continues growing. This behavior is shown in Fig.4: it does not correspond to the\nsupercritical phase of a qKPZ system, nor its subcritical phase, because the interface never becomes\ncompletely inactive. For such low nutrient concentrations, the equivalence with surfaces propagating in\nrandom environments is not valid anymore. In this regime, the large differences in velocity between the\ngrowing parts of the front and the pinned sites make the β exponent take unusually large values around\nβ = 1 (with patterns similar to those reported for the \"groovy\" phase in [42]). At even smaller bulk\nnutrient concentrations, we enter a phase in which wide pinning regions are developed, but the colony\ncontinues to grow at a slow pace. Here, branches arise and the colony can grow not only upwards and\nlaterally, but also downwards due to the presence of more ample free space. This description corresponds\nto patterns that belong to zone IV in Fig.1.\n\nConclusions\nBacterial colonies are among the best examples of biological systems whose complexity can be informatively reduced by using concepts from physics. Here, we have shown that the essential biological and\nphysical ingredients shaping colony propagating fronts may be distinguished by quantifying the scaling\nbehavior of a colony.\nBy using a detailed individual-based model in lieu of real experiments, we have shown that cell shape\nand substratum heterogeneities \u0015 in contrast to the existing literature \u0015 are not necessary to explain\nthe form and behavior of colony fronts in the rough regime. We have also hypothesized that this regime\ncontains a much richer morphological variety than expected. Based on the biological and physical\ningredients present in our simulation framework, we have given biological justifications for the emergence\nof quenched disorder as the result of competition for space and resources among cells. We have further\ndescribed how higher nutrient concentration allows colonies to overcome pinning sites due to higher cell\ngrowth rates, giving rise to different universal behaviors. Overcoming the technical limitations of the\nsimulation framework will grant better access to the asymptotic behavior of the front in each of these\nsub-phases.\nClassifying the universal behavior of a generic bacterial colony is more than a mere academic exercise.\nIt allows us to describe the behavior of the front by means of one single equation, such as Eq.(8), instead\nof using explicit agent-based or reaction-diffusion theoretical models. We have observed that irregular\n\n9\n\n\fcell shape, long-range cell motility, and extracellular compounds are not necessary for our idealized cell\ngroups to exhibit the same universal behavior as real bacterial colonies. This result suggests that such\nfactors may not be responsible for the behavior of the colony patterns observed in experiments, and that\nthe same universal behavior may be expected for the morphology of any bacterial colony under similar\nconditions.\nHowever, for the moment, we do not have enough information to prove this claim. Only experimental\nwork with different strains will allow us to check if the richer universal behavior described here can\nbe observed even in the presence of other ingredients that can be potentially important for the real\nasymptotic behavior of colony fronts [29]. For instance, due to the average mutation rate of many\ncommonly studied bacteria, mutations that affect growth rate often arise on the time scale reported for\ncolony growth experiments that we have discussed. A rare minority of these mutants exhibits higher\ngrowth rates than the rest of the population, resulting in bursting sectors that emerge from growing\ncolonies. These sectors obviously influence the shape of colony fronts in a way that is not considered by\nany theoretical models in the literature so far. These mutations will prevent also the observation of the\nroughening transition in real experiments: the larger the value of C, the larger the number of replication\nevents and the higher the likelihood of obtaining mutants with a larger growth rate. This could generate,\nby different means, large lateral correlations leading to a large αexp such as that measured in the cited\nexperimental studies.\nAll of the open questions discussed here highlight the necessity of a complete quantitative characterization of the propagating of real bacterial colonies in the rough regime. With it, the biology of the\ninteraction between individuals and the physics of the environment, studied from a multidisciplinary\npoint of view, will allow us to discern the relevant mechanisms responsible for the asymptotic behavior\nof real bacterial colony profiles.\n\nAcknowledgments\nWe would like to thank M.A. Muñoz, for helpful discussions and suggestions. We gratefully acknowledge\nsupport from the Defense Advanced Research Projects Agency (DARPA) under grants HR0011-05-10057 and HR0011-09-1-055. CDN is supported by a Princeton University Centennial Fellowship and an\nNSF graduate research fellowship.\n\nReferences\n[1] U. Bastolla, M.A. Fortuna, A. Pascual-Garcı́a, A. Ferrera, B. Luque, and J. Bascompte. The Architecture\nof Mutualistic Networks Minimizes Competition and Increases Biodiversity. Nature, 458:1018–1020, 2009.\n[2] R. Guimerà and L.A.N. Amaral. Functional Cartography of Complex-Metabolic Networks. Nature, 433:895–\n900, 2005.\n[3] A. Cavagna, A. Cimarelli, I. Giardina, G. Parisi, R. Santagati, F. Stefanini, and M. Viale. Scale-Free\nCorrelations in Starling Flocks. Proc. Natl. Acad. Sci. USA, 107:11865–11870, 2010.\n[4] T. Vicsek, A. Czirók, E. Ben-Jacob, I. Cohen, and O. Shochet. Novel Type of Phase Transition in a System\nof Self-Driven Particles. Phys. Rev. Lett., 75:1226–1229, 1995.\n[5] C.D. Nadell, K.R. Foster, and J.B. Xavier. Emergence of Spatial Structure in Cell Groups and the Evolution\nof Cooperation. PLoS Comp. Biol., 6:e1000716, 2010.\n[6] C.D. Nadell, J.B. Xavier, S.A. Levin, and K.R. Foster. The Evolution of Quorum Sensing in Bacterial\nBiofilms. PLoS Biol., 6:e14, 2008.\n[7] T. Matsuyama, M. Sogawa, and Y. Nakagawa. Fractal Spreading Growth of Serratia Marcescens which\nProduces Surface Active Exolipids. FEMS Microbiol. Lett., 61:243–246, 1989.\n[8] H. Fujikawa and M. Matsushita. Fractal Growth of Bacillus Subtilis on Agar Plates. J. Phys. Soc. Jpn.,\n58:3875–3878, 1989.\n[9] A.-L. Barabási and H.E. Stanley. Fractal Concepts in Surface Growth. Cambridge University Press, Cambridge, 1995.\n[10] J.B. Xavier, W. Kim, and K.R. Foster. A Molecular Mechanism that Stabilizes Cooperative Secretions in\npseudomonas aeruginosa. Mol. Microbiol., 79:166–179, 2011.\n\n10\n\n\f[11] H. Fujikawa. Diversity of the Growth Patterns of Bacillus Subtilis Colonies on Agar Plates. FEMS ¡icrobiol.\nEcol., 13:159–168, 1994.\n[12] J. Wakita, H. Itoh, T. Matsuyama, and M. Matsushita. Self-Affinity for the Growing Interface of Bacterial\nColonies. J. Phys. Soc. Jpn., 66:67–72, 1997.\n[13] E. Ben-Jacob and P. Garik. The Formation of Patterns in Non-Equilibrium Growth. Nature, 434:523–530,\n1990.\n[14] H. Fujikawa. Periodic Growth of Bacillus Subtilis Colonies on Agar Plates. Physica A, 189:15–21, 1992.\n[15] H. Shimada, T. Ikeda, J.-I. Wakita, H. Itoh, S. Kurosu, F. Hiramatsu, M. Nakatsuchi, Y. Yamazaki, T. Matsuyama, and M. Matsushita. Dependence of Local Cell Density on Concentric Ring Colony Formation by\nBacterial Species Bacillus Subtilis. J. Phys. Soc. Jpn., 189:1082–1089, 2004.\n[16] T.A. Witten Jr. and L.M. Snader. Diffusion-Limited Aggregation, a Kinetic Critical Phenomenon. Phys.\nRev. Lett., 47:1400–1403, 1981.\n[17] Cserzö M. Horváth V. K. Vicsek, T. Self-Affine Growth of Bacterial Colonies. Physica A, 167:315–321, 1990.\n[18] D.A. Kessler and H. Levine. Fluctuation-Induced Diffusive Instabilities. Nature, 394:556–558, 1998.\n[19] M Matsushita, J. Wakita, H. Itoh, I. Ràfols, T. Matsuyama, H. Sakaguchi, and M. Mimura. Interface Growth\nand Pattern Formation in Bacterial Colonies. Physica A, 249:517–524, 1998.\n[20] F. Family and T. Vicsek. Scaling of the Active Zone in the Eden Process on Percolation Networks and the\nBallistic Deposition Model. J. Phys. A, 18:L75, 1985.\n[21] J.M. López. Scaling Approach to Calculate Critical Exponents in Anomalous Surface Roughening. Phys.\nRev. Lett., 83:4594–4597, 1999.\n[22] J.M. López, M.A. Rofrı́guez, and R. Cuerno. Superroughening versus Intrinsic Anomalous Scaling of Surfaces. Phys. Rev. E, 56:3993–3998, 1997.\n[23] J.A. Bonachela, I. Dornic, H. Chaté, and M.A. Muñoz. Absorbing States and Elastic Interfaces in Random\nMedia: Two Equivalent Descriptions of Self-Organized Criticality. Phys. Rev. Lett., 98:155702, 2007.\n[24] A.M. Lacasta, C.E. Cantalapiedra, C.E. Auguet, A. Peñaranda, and L. Ramı́rez-Piscina. Modelling of\nSpatio-Temporal Patterns in Bacterial Colonies. Phys. Rev. E, 59:7036–7041, 1999.\n[25] N. Kobayashi, O. Moriyama, S. Kitsunezaki, and M. Yamazaki, Y. Matsushita. Dynamic Scaling of the\nGrowing Rough Surfaces. J. Phys. Soc. Jpn., 73:2112–2116, 2004.\n[26] M. Kardar, G. Parisi, and Y.-C. Zhang. Dynamic Scaling of Growing Interfaces. Phys. Rev. Lett., 56:889892,\n1986.\n[27] Z. Csahók, K. Honda, and T. Vicsek. Dynamics of Surface Roughening in Disordered Media. J. Phys. A.:\nMath. Gen., 26:L171–L178, 1993.\n[28] Some measurements in this region, though, indicate the existence of non-trivial scaling exponents for these\npatterns [12].\n[29] J.A. Bonachela, C.D. Nadell, J.B. Xavier, and S.A. Levin. to be published, 2011.\n[30] J.B. Xavier, C. Picioreanu, and M.C.M. van Loosdrecht. A Framework for Multidimensional Modelling of\nActivity and Structure of Multispecies Biofilms. Environ. Microbiol., 7:1085–1103, 2005.\n[31] J.B. Xavier, C. Picioreanu, and M.C.M. Van Loosdrecht. Assesment of Three-Dimensional Biofilm Models\nThrough Direct Comparison with Confocal Microscopy Imaging. Wat. Sci. Technol., 49:177–185, 2004.\n[32] J.B. Xavier, M. K. De Kreuk, C. Picioreanu, and M.C.M. Van Loosdrecht. Multi-Scale Individual-Based\nModel of Microbial and Bioconversion Dynamics in Aerobic Granular Sludge. Environ. Sci. Technol., 41:6410,\n2007.\n[33] In our simulations it is assumed a Monod-like relation between the growth rate and the nutrient concentration\nCloc\n[43]: μ = μmax Cloc\n, where μmax is the maximum growth rate and K stands for the half-saturation\n+K\nconstant, that measures the ability of the cell for nutrient uptake.\n[34] It is \u0010possible\u0011to rewrite the Family-Vicsek scaling equations, Eq.(2), by using universal functions: W (L, t) =\ntβ F L/t1/z , with F(x) ∼ constant for x ≫ 1 and F(x) ∼ xα for x ≪ 1; or W (L, t) = Lα G (t/Lz ), with\nG(x) ∼ constant for x ≫ 1 and G(x) ∼ xβ for x ≪ 1.\n[35] M. Eden. Proc. 4th Berkeley Symp. Mathematical Statistics and Probability, Ed. J. Neyman (University of\nCalifornia Press, Berkeley, CA, page 223, 1961.\n[36] R. Jullien and R. Botet. Scaling Properties of the Surface of the Eden Model in d=2, 3, 4. J. Phys. A.:\nMath. Gen., 18:2279–2287, 1985.\n\n11\n\n\f[37] L.R. Paiva and S.C. Ferreira Jr. Universality Class of Isotropic On-Lattice Eden Clusters. J. Phys. A: Math.\nTheor., 40:F43–F49, 2007.\n[38] One illustrative example of it is the reaction-diffusion model introduced in [44]. If A(x, y; t) is the field\nrepresenting the active cells, I(x, y; t) the inactive ones, and n(x, y; t) the nutrient field, the dynamics is\ngiven by ∂t A = ∇ (D(A, n)∇A) + nA − g(n)A, ∂t I = g(n)A, and ∂t n = ∇2 n − nA. The rough patterns are\nrecovered by choosing D(A, n) = D1 A, with D1 constant. This changes the first term in the r.h.s. of the\ndynamic equation for A to ∇2 A + (∇A)2 . The height of the interface at (x, t) corresponds to the highest\nposition y for which A(x, y; t) 6= 0 [45].\n[39] P. Meakin. Fractals, Scaling and Growth Far From Equilibrium.\n[40] L.A.N. Amaral, A.-L. Barabási, H.A. Makse, and E.H. Stanley. Scaling Properties of Driven Interfaces in\nDisordered Media. Phys. Rev. E., 52:4087–4104, 1995.\n[41] I. Klapper and J. Dockery. Finger Formation in Biofilm Layers. SIAM J. Appl. Math., 62:853–869, 2001.\n[42] J.M. López and H.J. Jensen. Generic Model of Morphological Changes in Growing Colonies of Fungi. Phys.\nRev. E, 65:021903, 2002.\n[43] J. Monod. Technique de Culture Continue. Theory et Applications. Ann. Inst. Pasteur, 79:390–410, 1950.\n[44] M. Mimura, H. Sakaguchi, and M. Matsushita. Reaction-Diffusion Modelling of Bacterial Colony Patterns.\nPhysica A, 282:283–303, 2000.\n[45] N. Kobayashi, T. Sato, Y. Yamazaki, and M. Matsushita. Modelling and Numerical Analysis of the Colony\nFormation of Bacteria. J. Phys. Soc. Jpn., 72:970–971, 2003.\n\n12\n\n\f"}