{"id": "http://arxiv.org/abs/1003.2457v1", "guidislink": true, "updated": "2010-03-12T01:22:38Z", "updated_parsed": [2010, 3, 12, 1, 22, 38, 4, 71, 0], "published": "2010-03-12T01:22:38Z", "published_parsed": [2010, 3, 12, 1, 22, 38, 4, 71, 0], "title": "Flavor asymmetry of the polarized sea-quark distributions in the proton", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.0878%2C1003.0523%2C1003.0182%2C1003.5222%2C1003.1119%2C1003.0451%2C1003.5990%2C1003.5527%2C1003.4821%2C1003.6049%2C1003.0477%2C1003.3279%2C1003.1373%2C1003.5595%2C1003.3314%2C1003.0433%2C1003.3858%2C1003.4768%2C1003.3449%2C1003.1131%2C1003.5211%2C1003.0725%2C1003.3081%2C1003.4630%2C1003.2848%2C1003.2302%2C1003.0890%2C1003.5026%2C1003.5298%2C1003.3256%2C1003.2242%2C1003.3990%2C1003.2510%2C1003.0557%2C1003.3368%2C1003.5884%2C1003.3866%2C1003.5124%2C1003.5457%2C1003.2276%2C1003.4142%2C1003.4559%2C1003.4306%2C1003.0919%2C1003.0505%2C1003.5055%2C1003.3205%2C1003.4831%2C1003.5315%2C1003.3828%2C1003.2240%2C1003.2639%2C1003.0271%2C1003.1414%2C1003.0328%2C1003.2437%2C1003.1407%2C1003.1427%2C1003.4959%2C1003.1586%2C1003.5390%2C1003.4403%2C1003.2655%2C1003.3744%2C1003.3260%2C1003.5091%2C1003.2112%2C1003.0999%2C1003.0788%2C1003.5028%2C1003.5817%2C1003.0102%2C1003.1264%2C1003.0331%2C1003.4813%2C1003.5558%2C1003.3494%2C1003.2059%2C1003.5493%2C1003.2833%2C1003.2076%2C1003.0211%2C1003.5451%2C1003.1991%2C1003.2562%2C1003.1673%2C1003.5863%2C1003.0236%2C1003.2211%2C1003.0467%2C1003.5535%2C1003.2457%2C1003.1696%2C1003.0158%2C1003.2332%2C1003.2351%2C1003.1957%2C1003.0262%2C1003.3372%2C1003.3705%2C1003.6070&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Flavor asymmetry of the polarized sea-quark distributions in the proton"}, "summary": "The recent global analysis of helicity parton distributions, which takes into\naccount available data from inclusive and semi-inclusive polarized deep\ninelastic scattering, as well as from polarized proton-proton scattering at\nRHIC, appears to offer the first strong evidence that polarized sea-quark\ndistributions are flavor asymmetric, i.e. $\\Delta \\bar{u}(x) \\ne \\Delta\n\\bar{d}(x)$. We point out that the flavor symmetry breaking pattern indicated\nby their analysis, i.e. $\\Delta \\bar{u}(x) > 0$ and $\\Delta \\bar{d}(x) < 0$\nwith the magnitude correlation $|\\Delta \\bar{u}(x)| < |\\Delta \\bar{d}(x)|$, is\njust consistent with our theoretical predictions given several years ago on the\nbasis of the chiral quark soliton model. We also address ourselves to\nunderstanding the physics behind this observation.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.0878%2C1003.0523%2C1003.0182%2C1003.5222%2C1003.1119%2C1003.0451%2C1003.5990%2C1003.5527%2C1003.4821%2C1003.6049%2C1003.0477%2C1003.3279%2C1003.1373%2C1003.5595%2C1003.3314%2C1003.0433%2C1003.3858%2C1003.4768%2C1003.3449%2C1003.1131%2C1003.5211%2C1003.0725%2C1003.3081%2C1003.4630%2C1003.2848%2C1003.2302%2C1003.0890%2C1003.5026%2C1003.5298%2C1003.3256%2C1003.2242%2C1003.3990%2C1003.2510%2C1003.0557%2C1003.3368%2C1003.5884%2C1003.3866%2C1003.5124%2C1003.5457%2C1003.2276%2C1003.4142%2C1003.4559%2C1003.4306%2C1003.0919%2C1003.0505%2C1003.5055%2C1003.3205%2C1003.4831%2C1003.5315%2C1003.3828%2C1003.2240%2C1003.2639%2C1003.0271%2C1003.1414%2C1003.0328%2C1003.2437%2C1003.1407%2C1003.1427%2C1003.4959%2C1003.1586%2C1003.5390%2C1003.4403%2C1003.2655%2C1003.3744%2C1003.3260%2C1003.5091%2C1003.2112%2C1003.0999%2C1003.0788%2C1003.5028%2C1003.5817%2C1003.0102%2C1003.1264%2C1003.0331%2C1003.4813%2C1003.5558%2C1003.3494%2C1003.2059%2C1003.5493%2C1003.2833%2C1003.2076%2C1003.0211%2C1003.5451%2C1003.1991%2C1003.2562%2C1003.1673%2C1003.5863%2C1003.0236%2C1003.2211%2C1003.0467%2C1003.5535%2C1003.2457%2C1003.1696%2C1003.0158%2C1003.2332%2C1003.2351%2C1003.1957%2C1003.0262%2C1003.3372%2C1003.3705%2C1003.6070&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The recent global analysis of helicity parton distributions, which takes into\naccount available data from inclusive and semi-inclusive polarized deep\ninelastic scattering, as well as from polarized proton-proton scattering at\nRHIC, appears to offer the first strong evidence that polarized sea-quark\ndistributions are flavor asymmetric, i.e. $\\Delta \\bar{u}(x) \\ne \\Delta\n\\bar{d}(x)$. We point out that the flavor symmetry breaking pattern indicated\nby their analysis, i.e. $\\Delta \\bar{u}(x) > 0$ and $\\Delta \\bar{d}(x) < 0$\nwith the magnitude correlation $|\\Delta \\bar{u}(x)| < |\\Delta \\bar{d}(x)|$, is\njust consistent with our theoretical predictions given several years ago on the\nbasis of the chiral quark soliton model. We also address ourselves to\nunderstanding the physics behind this observation."}, "authors": ["M. Wakamatsu"], "author_detail": {"name": "M. Wakamatsu"}, "author": "M. Wakamatsu", "arxiv_comment": "11 pages, 5 figures", "links": [{"href": "http://arxiv.org/abs/1003.2457v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1003.2457v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nucl-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1003.2457v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1003.2457v1", "journal_reference": null, "doi": null, "fulltext": "OU-HET-657, March, 2010\n\narXiv:1003.2457v1 [hep-ph] 12 Mar 2010\n\nFlavor asymmetry of the polarized sea-quark distributions in the proton\nM. Wakamatsu1\nDepartment of Physics, Faculty of Science,\nOsaka University,\nToyonaka, Osaka 560-0043, JAPAN\n\nAbstract\nThe recent global analysis of helicity parton distributions, which takes into account available\ndata from inclusive and semi-inclusive polarized deep inelastic scattering, as well as from\npolarized proton-proton scattering at RHIC, appears to offer the first strong evidence that\n ̄\npolarized sea-quark distributions are flavor asymmetric, i.e. ∆ū(x) 6= ∆d(x).\nWe point out\nthat the flavor symmetry breaking pattern indicated by their analysis, i.e. ∆ū(x) > 0 and\n ̄\n ̄\n∆d(x)\n< 0 with the magnitude correlation |∆ū(x)| < |∆d(x)|,\nis just consistent with our\ntheoretical predictions given several years ago on the basis of the chiral quark soliton model.\nWe also address ourselves to understanding the physics behind this observation.\n\nUndoubtedly, the famous NMC measurement [1], which has established the flavor asymmetry of unpolarized sea-quark distributions, is thought to be one of the most noticeable\nachievements in the recent studies of nucleon structure functions. The reason is that it gave\nthe first clear evidence for manifestation of nonperturbative chiral dynamics of QCD in highenergy deep-inelastic scattering observables, which was not taken very seriously before this\n ̄\nmilestone discovery. The NMC observation, i.e. the excess of d-sea\nover the ū-sea in the\nproton, is known to be explained by a variety of models at least qualitatively. (See [2],[3], for\nreview.) They are the meson cloud convolution model including its variants [4] -[9], the chiral\nquark soliton model (CQSM) [10] -[13], as well as several other models with more phenomenological nature like the statistical parton model [14],[15] and the explanation based on the Pauli\nexclusion principle [16].\nA natural next question is then whether the polarized antiquark sea in the nucleon is\nalso flavor asymmetric or not. Somewhat embarrassingly, existing theoretical answers for this\nquestion is fairly dispersed, in remarkable contrast to the unpolarized case. Among others.\nworthy of special mention is a big difference between the prediction of the meson cloud model\n1\n\nEmail : wakamatu@phys.sci.osaka-u.ac.jp\n\n1\n\n\f[17] -[22] and that of the CQSM [23] -[28]. The CQSM predicts large flavor asymmetry also\n ̄\nfor the longitudinally polarized sea-quark distributions, i.e. ∆ū(x) − ∆d(x)\n> 0, whereas\nthe prediction of the meson cloud model for the same quantity is fairly small or slightly\npositive. (Actually, the meson cloud model contains a lot of parameters and its theoretical\npredictions are fairly dispersed depending on how many meson-baryon intermediate channels\nare included in the calculation [21]. Here, we are supposing the prediction of the most elaborate\nrecent calculation by Cao and Signal within the framework of the meson cloud model [22].)\nAlthough it is usually believed that the CQSM yield similar results to those obtained in\nthe meson cloud model or the cloudy bag model as one of such models constructed so as\nto effectively incorporate the chiral dynamics of Nambu-Goldstone excitations surrounding\nthe nucleon core, it is not necessarily true. Significant differences, if they exist, appears to\noriginate from a unique dynamical ansatz of the CQSM, i.e. the rotating hedgehog. It has\nbeen long claimed that this unique feature of the CQSM enables us to explain the celebrated\nEMC observation, i.e. very small quark spin fraction of the nucleon, quite naturally without\nintroducing any fine tuning [29],[30]. The recently found big difference between the prediction\nof the CQSM and that of the refined cloudy bag model for the isovector combination of the\nquark orbital angular momenta Lu −Ld [31],[32] also appears to be connected with the nontrivial\nspin-isospin correlation between quark fields embedded in the hedgehog ansatz [31],[33],[34].\nFurthermore, the same correlation between spin and isospin is likely to be the cause of the\nstrong correlation existing between the flavor asymmetries of the unpolarized and polarized\n ̄\nsea-quark distributions predicted by the CQSM, which dictates that both of ū(x) − d(x)\nand\n ̄\n∆ū(x) − ∆d(x) are sizably large in magnitude [26],[27].\nIn view of the interesting sensitivity of the flavor asymmetry of the polarized sea-quark\ndistributions to theoretical models, it is of great interest to get direct experimental information\non it. Since the separation of the quark and antiquark distributions cannot be done solely\nfrom the inclusive measurements, additional information from semi-inclusive measurements\nis crucial for this separation. The first systematic challenge for aiming at extracting the\npolarized sea-quark distributions were carried out by the HERMES Collaboration [35]. From\nsemi-inclusive scattering measurements where the final pions and kaons are measured, they\nextracted the polarized antiquark distributions, thereby concluding that the polarization of\n ̄\neach flavor, i.e. ∆ū(x), ∆d(x),\n∆s̄(x), is very small, and compatible with zero, which seems\nto be consistent with the prediction of the meson cloud model [22]. However, in view of the\nfact that the mechanism of semi-inclusive scatterings is understood less reliably than that of\nthe inclusive scatterings, and that we have much more precise inclusive data than the semiinclusive data, it is desirable to perform systematic global analysis, which takes account of all\nthe available information. Such an analysis has recently been done by de Florian et al. [36]\nTheir analysis was performed fully at the next-to-leading order of perturbative QCD, by taking\n2\n\n\faccount of available data from inclusive and semi-inclusive scatterings, as well as from polarized\nproton-proton scatterings at RHIC. Very interestingly, the result of their analysis appears to\noffer the first strong evidence in favor of the flavor asymmetry of the polarized sea-quark\n ̄\ndistributions, i.e. ∆ū(x) − ∆d(x)\n> 0. Particularly noteworthy here is the observed pattern\nof flavor symmetry violation in the polarized sea. Their results indicates that ∆ū(x) > 0 and\n ̄ < 0 with the interesting magnitude correlation |∆ū(x)| < |∆d(x)|.\n ̄\n∆d(x)\nNow, the purpose of the present paper is to point out that the observed pattern of flavor symmetry violation in the polarized sea-quark distribution is just consistent with the\nparameter-free predictions of the CQSM, which we gave several years ago. We also try to clarify the background physics leading to the observed symmetry breaking pattern of the polarized\nsea-quark distributions. We shall also make a short remark on their results for the polarized\nstrange-quark distributions in the nucleon from our own viewpoint.\nBefore showing a comparison of the predictions of the CQSM with the results of the new\nDSSV analysis, several comments on the model are in order. We have two versions of the\nCQSM. One is the flavor SU(2) version [37],[29], and the other is the flavor SU(3) version\n[38],[39]. The basic parameter common in both models is the dynamically generated quark\nmass M, which is already fixed to be M ≃ 375 MeV from low energy phenomenology or from\nthe instanton picture of the QCD vacuum, which affords a theoretical foundation of the model\n[37]. The predictions of the SU(2) CQSM for various parton distributions at the model scale is\ntherefore parameter free. The flavor SU(3) version of the CQSM model contains an additional\nparameter, i.e. the effective mass difference ∆ms between the strange and up-down quarks. We\nfixed this parameter to be 100 MeV such that the model reproduces the general behavior of the\nunpolarized strange quark distributions at the high energy scale, Q2 = 4 GeV2 . (See [28], for\nmore detail.) To make a comparison with high energy deep-inelastic-scattering observables,\nwe take the predictions of the CQSM as initial scale distributions at the low energy model\nscale. The scale dependencies of the distribution functions are taken into account by using the\nstandard evolution equation at the next-to-leading order. The starting energy of this evolution\nis taken to be Q2 = 0.30 GeV2 , basically following the strategy of the PDF fits by Glück, Reya\nand Vogt [40],[41].\nNow in Fig.1, we show the results of the new DSSV global fit for the isovector distribution\n ̄\nx (∆ū(x) − ∆d(x))\nin comparison with the theoretical predictions of the CQSM. Here, the\nsolid and dash-dotted curves are respectively the predictions of the flavor SU(2) and SU(3)\nversions of the CQSM. As pointed out in [28], the flavor asymmetry of the polarized sea-quark\ndistributions is fairly sensitive to the difference of the two versions of the model. (This is\nnot the case for the unpolarized sea-quark distributions. That is, the difference between the\n ̄\npredictions of the two models for the distribution x (ū(x) − d(x))\nis fairly small [28].) One sees\nthat, with high confidence level, the new DSSV fit shows a strong evidence in favor of the flavor\n3\n\n\fx (\u0001\u0016\nu(x)\n\n0.1\n\n\u0001d\u0016(x)) at 10 GeV2\n\n\u0001\u001f2 = 1\n\u0001\u001f2=\u001f2 = 2 %\n\n0.08\n0.06\n0.04\n0.02\n0.0\n-0.02\n-0.04\n-3\n\n10\n\n2\n\n5\n\n-2\n\n10\n\n2\n\nx\n\n5\n\n-1\n\n10\n\n2\n\n5\n\n1\n\nFigure 1: The predictions of the SU(2) and SU(3) CQSM for the distribution difference\n ̄\nx (∆ū(x) − ∆d(x))\nat Q2 = 10 GeV2 , in comparison with the new DSSV global fit with the\nuncertainty bands for ∆χ2 = 1 and ∆χ2 /χ2 = 2 %.\n\nsymmetry violation for the polarized sea-quark distributions. Interestingly, the magnitude of\nthis flavor symmetry violation is fairly close to the prediction of the flavor SU(3) CQSM. It\n ̄\nwas advocated that sizably large CQSM prediction for ∆ū(x) − ∆d(x)\nis consistent with the\nlarge-Nc counting argument [27], which dictates that\n ̄\n ̄\n|∆ū(x) − ∆d(x)|\n≫ |ū(x) − d(x)|,\n\n(1)\n\n ̄\n ̄\nsince |ū(x) − d(x)|\n/ |∆ū(x) − ∆d(x)|\nis a 1/Nc quantity. In our realistic world, however, Nc is\njust three, anyway, and the actual numerical predictions might not necessarily obey this general\n ̄\nexpectation. In fact, in the SU(3) CQSM, we find that the magnitude of ∆ū(x) − ∆d(x)\nis\n ̄\nslightly smaller than that of ū(x)− d(x),\nas shown in Fig.18 of [28]. (Incidentally, our prediction\n ̄\nfor x (∆ū(x) − ∆d(x)) within the SU(2) CQSM is a little smaller than the corresponding\nprediction of the Bochum group shown in Fig.7 of [36]. The reason of this small discrepancy is\nnot clear, but it may be traced back to the difference of the used soliton profile or the difference\nof the details of the evolution procedure.)\nAlso very interesting is the flavor separation of the polarized sea-quark distributions. Shown\nin Fig.2 are the results of the DSSV analysis in comparison with the predictions of the CQSM.\nAgain, the predictions of the SU(3) CQSM appears to be closer to the results of the DSSV\n4\n\n\f\u0001 \u0016( )\n\n\u0001\u0016( )\n\nx ux\n0.04\n\nx dx\n0.02\n\n0.02\n0.0\n0.0\n-0.02\n\n-0.02\n\n-0.04\n\n-0.04\n-3\n\n10\n\n2\n\n-2\n\n5 10\n\n2\n\n-1\n\nx\n\n5 10\n\n2\n\n5\n\n-3\n\n1\n\n10\n\n2\n\n-2\n\n5 10\n\n2\n\n-1\n\nx\n\n5 10\n\n2\n\n5\n\n1\n\nFigure 2: The predictions of the SU(2) and SU(3) CQSM for the longitudinally polarized\n ̄\nsea-quark distribution functions, x ∆ū(x) and x ∆d(x)\nat Q2 = 10 GeV2 , in comparison with\nthe DSSV global fit.\n\nfit. A noteworthy feature of the new global fit is the observed pattern of the flavor symmetry\n ̄ < 0 with the magnitude correlation |∆ū(x)| <\nbreaking. It indicates that ∆ū(x) > 0 and ∆d(x)\n ̄\n|∆d(x)|.\nWe emphasize that this characteristic of the flavor symmetry breaking pattern of the\npolarized sea-quark distribution is just what the CQSM predicts [28]. An interesting question is\ntherefore how this unique pattern of symmetry violation arises in the CQSM. Since the physics\nis basically common in two versions of the CQSM, we explain it in simpler SU(2) CQSM. To\nthis end, we first recall the fact that, within the theoretical framework of the CQSM, the\nisoscalar and isovector distributions have different theoretical structure due to their different\nNc -dependence [23],[25],[28], so that the longitudinally polarized distribution functions with\neach flavor is evaluated as linear combinations of the isoscalar and isovector parts as\n1\n2\n1\n ̄\n∆d(x)\n=\n2\n\n∆ū(x) =\n\nh\n\n ̄\n ̄\n(∆ū(x) + ∆d(x))\n+ (∆ū(x) − ∆d(x))\n,\n\n(2)\n\nh\n\n ̄\n ̄\n(∆ū(x) + ∆d(x))\n− (∆ū(x) − ∆d(x))\n.\n\n(3)\n\ni\n\ni\n\nShown in Fig.3 are the predictions of the SU(2) CQSM for the isoscalar and isovector combinations of the longitudinally polarized quark distribution functions [25]. In this figure, the\ndistribution functions with negative value of x should be interpreted as antiquark distribution\n5\n\n\f\u0001u(x) + \u0001d(x)\n\n\u0001u(x) \u0001d(x)\n\nx\n\nx\n\nFigure 3: The predictions of the SU(2) CQSM for the isoscalar and isovector longitudinally\npolarized distribution functions of the nucleon at the scale of the model. The long-dashed and\nthe dash-dotted curves respectively stand for the contribution of Nc valence quarks and that\nof the Dirac-sea quarks, while the solid curve represents their sum. The distribution functions\n∆q(x) in the negative x region should be interpreted as antiquark distributions according to\nthe rule : ∆q̄(x) = ∆q(−x) with 0 < x < 1.\n\naccording to the rule :\n ̄\n∆ū(x) ± ∆d(x)\n= ∆u(−x) ± ∆d(−x)\n\n(0 < x < 1).\n\n(4)\n\nThe right panel of Fig.3 shows that the vacuum polarization of the Dirac-sea quarks in the\nhedgehog mean-field plays an important role in generating large flavor asymmetry of the polarized sea-quark distribution. This fact was already emphasized in several previous papers\n[26],[27]. The physics we are now discussing is connected with another unique feature of the\nCQSM predictions. As shown in the left panel of Fig.3, it predicts that the isoscalar longitudinally polarized distribution is negative in the small x region including the negative x domain\n ̄\n[25],[28], which means that ∆ū(x) + ∆d(x)\nis negative for the physical value of x, i.e. for\n ̄ is sizably large and\n0 < x < 1. This observation, combined with the fact that ∆ū(x) − ∆d(x)\npositive for small and negative x, leads to an interesting symmetry breaking pattern of the\n ̄ < 0 with the\nlongitudinally polarized sea-quark distributions such that ∆ū(x) > 0 and ∆d(x)\n ̄\nmagnitude correlation |∆ū(x)| < |∆d(x)|.\nWe emphasize that this feature comes about as a\nparameter-free prediction of the CQSM. Some years ago, we have pointed out [42] that the\nnegativity of the isoscalar longitudinally polarized quark distribution in the small x region is\n6\n\n\fjust what is required for reproducing the sign change of the deuteron spin structure function\nat low x as dictated by the SMC and COMPASS data [43],[44]. (Remember that the deuteron\nspin structure function is roughly proportional to the isoscalar longitudinally polarized distribution function of the nucleon.) This observation then indicates that the flavor symmetry\n ̄\nbreaking pattern |∆ū(x)| < |∆d(x)|\nobtained in the DSSV fit must be strongly influenced by\nthe deuteron structure function data included in their global fit.\n\n0.8\n\n\u0001u(x) \u0002 \u0001\u0016u(x) vs. \u0001d(x) \u0002 \u0001d\u0016(x) at the model s ale\n\n\u0001u(x) \u0002 \u0001\u0016u(x)\n\u0001d(x) \u0002 \u0001d\u0016(x)\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n0.0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\nx\n\n0.5\n\n0.6\n\n0.7\n\n0.8\n\nFigure 4: The predictions of the SU(2) CQSM for the product of the polarized quark and\n ̄\nantiquark distributions, i.e. ∆u(x) × ∆ū(x) and ∆d(x) × ∆d(x)\nat the model scale. The\nexpectation from the Pauli exclusion principle argument is an approximate equality of these\n ̄\ntwo quantities, i.e. ∆u(x) × ∆ū(x) ≃ ∆d(x) × ∆d(x).\n\nWe recall that the flavor asymmetry of the polarized sea-quark distributions is predicted\nalso by some models with more phenomenological nature like the statistical parton model\n[14],[15] as well as the model based on the Pauli exclusion principle [16]. For instance, the\n ̄ < 0 with the\nanalysis by Bhalerao within the statistical model predicts ∆ū(x) > 0 and ∆d(x)\n ̄\nmagnitude of |∆d(x)|\nbeing larger than that of |∆ū(x)| although slightly [14]. Note, however,\n ̄\nthat this model uses the known empirical information for the magnitudes of ∆u+∆ū, ∆d+∆d,\nand ∆s+∆s̄, so that its predictions are not of purely theoretical nature. Also interesting is the\nprediction of the semi-phenomenological model of Gück and Reya based on the Pauli exclusion\nprinciple [16]. Their model also predicts large flavor asymmetry for both of the unpolarized and\npolarized sea-quark distributions. Furthermore, this model predicts fairly large asymmetry for\n7\n\n\f ̄ such that |∆ū(x)| < |∆d(x)|\n ̄\nthe magnitudes of ∆ū(x) and ∆d(x)\nin conformity with the new\nDSSV global fit. We point out that the above-mentioned feature comes from the basic ansatz\nof this semi-phenomenological treatment, which demands that the product\n∆q(x, μ2 ) ∆q̄(x, μ2 ) ≡ P (x),\n\n(5)\n\nis universal flavor-independent function P (x) with μ being an low energy input scale of their\nevolution program, since the effect of Pauli blocking is only related to the spin of quarks and\nantiquarks irrespective of their flavor degrees of freedom. Since it is empirically known that\n ̄\n|∆u(x)| > |∆d(x)|, it naturally follows that |∆ū(x)| < |∆d(x)|.\nIt may be of some interest\nto check to what extent the above ansatz holds in our explicit dynamical model predictions.\nShown in Fig.4 are the predictions of the SU(2) CQSM for the product of ∆u(x) and ∆ū(x) and\n ̄\nthat of ∆d(x) and ∆d(x)\nat the model energy scale, which we identify with μ2 = 0.30 GeV2 .\n ̄\nOne clearly sees that the ansatz ∆u(x) ∆ū(x) = ∆d(x) ∆d(x)\ndoes not hold good at least in\nthe CQSM. This seems to be an indication that the nontrivial chiral dynamics of QCD besides\nthe Pauli blocking effect plays some important roles in the physics of the flavor asymmetry of\nsea-quark distributions in the nucleon.\n\nx \u0001s(x) and x \u0001\u0016s(x) at Q2 = 10 GeV2\n\n0.02\n\n0.01\n\n0.0\n\n-0.01\n\n-0.02\nx\nx\nx\n\n-0.03\n\n-0.04\n-3\n10\n\n2\n\n5\n\n10\n\n-2\n\n\u0001s(x)\n\u0001\u0016s(x)\n\u0001s(x) = x \u0001\u0016s(x)\n\nx\n\n2\n\n5\n\n-1\n\n10\n\n2\n\n5\n\n1\n\nFigure 5: The prediction of the SU(3) CQSM for the polarized strange quark distribution\nx ∆s(x) in comparison with the DSSV global fit. Here, the solid curve is the prediction of the\nSU(3) CQSM for the polarized s-quark distribution, whereas the long-dashed curve is that for\nthe polarized s̄-quark distribution.\n\n8\n\n\fFinally, we make a brief comment on the polarized strange quark distributions obtained in\nthe DSSV global analysis. As shown in Fig.5, a remarkable feature of the new DSSV analysis\nis that a polarized strange quark distribution ∆s(x) is positive at large or medium x, but\nnegative at small x, at variance with most of the past PDF fits which use only inclusive DIS\n(deep-inelastic-scattering) data. This peculiar behavior of ∆s(x) arises since the (kaon) semiinclusive DIS data prefer a small and likely positive ∆s(x) at medium x, while inclusive DIS\nand the constraints from beta-decay demand a negative 1st moment of ∆s(x) [45], thereby\nforcing ∆s(x) to be negative at small x. To our knowledge, there is no theoretical model,\nwhich predicts such nodal behavior of ∆s(x). Shown in Fig.5 together with the DSSV fit are\nthe predictions of the SU(3) CQSM for the polarized strange quark distributions. The SU(3)\nCQSM predicts that both of ∆s(x) and ∆s̄(x) are negative in the whole region of x, while\nthe magnitude of ∆s̄(x) is much smaller than ∆s(x), i.e. |∆s̄(x)| ≪ |∆s(x)|. In the DSSV\nanalysis, the equality of the polarized strange quark and antiquark distributions is assumed,\nbecause of the reason that the fit is unable to discriminate strange quarks from antiquarks\nat the present stage. As pointed out by the authors of [36] themselves, however, unlike the\nspin-averaged case where the distributions of s(x) and s̄(x) are constrained by the conservation\nR\nlaw, i.e. 01 [s(x) − s̄(x)] dx = 0, there is no absolute need for ∆s(x) and ∆s̄(x) to have the\nsame magnitude or even the same sign. Although may not be feasible at the present stage, a\npossible large asymmetry of the polarized strange sea as suggested by the CQSM should be\nkept in mind and such possibility is highly desirable to be taken into account in more elaborate\nglobal analyses in the future.\nTo sum up, the recent global analysis of spin-dependent parton distributions appears to\noffer the first strong evidence in favor of the flavor symmetry violation of the longitudinally\npolarized sea-quark distributions in the nucleon. We have pointed out that the indicated flavor\n ̄\nsymmetry breaking pattern, i.e. ∆ū(x) > 0 and ∆d(x)\n< 0 with the magnitude correlation\n ̄\n|∆ū(x)| < |∆d(x)|, is remarkably consistent with the nearly-parameter-free prediction of the\nCQSM. An apparent discrepancy remains, however, between their fit for the polarized strange\nquark distributions in the nucleon and the corresponding prediction of the SU(3) CQSM. To\nget more definite conclusion on the implication of this discrepancy, we certainly need more\nand more effort to understand the precise mechanism of semi-inclusive reactions, especially\nthe mechanism of semi-inclusive kaon productions.\n\nAcknowledgment\nThis work is supported in part by a Grant-in-Aid for Scientific Research for Ministry of\nEducation, Culture, Sports, Science and Technology, Japan (No. c-a215402680)\n9\n\n\fReferences\n[1] NMC Collaboration, P. Amaudruz et al., Phys. Rev. Lett. 66 (1991) 2712.\n[2] S. Kumano, Phys. Rep. 303 (1998) 183.\n[3] G.T. Garvey and J.C. Peng, Prog. Part. Nucl. Phys. 47 (2001) 203.\n[4] J.D. Sullivan, Phys. Rev. D5 (1972) 1732.\n[5] A. W. Thomas, Phys. Lett. B126 (1983) 97.\n[6] E.M. Henley and G.A. Miller, Phys. Lett. B251 (1990) 453.\n[7] S. Kumano, Phys. Rev. D43 (1991) 3067.\n[8] W. Melnitchouk and A.W. Thomas, Phys. Rev. D47 (1993) 3794.\n[9] H. Holtman, A. Szczurek, and J. Speth, Nucl. Phys. A596 (1996) 631.\n[10] M. Wakamatsu, Phys. Rev. D44 (1991) R2631.\n[11] M. Wakamatsu, Phys. Rev. D46 (1992) 3762.\n[12] M. Wakamatsu and T. Kubota, Phys. Rev. D57 (1998) 5755.\n[13] P.V. Pobylitsa, M.V. Polyakov, K. Goeke, T. Watabe, and C. Weiss,\nPhys. Rev. D59 (1999) 034024.\n[14] R.S. Bhalerao, Phys. Rev. C63 (2001) 025208.\n[15] C. Bourrely, J. Soffer, and F. Buccella, Eur. Phys. J. C23 (2002) 487.\n[16] M. Glück and E. Reya, Mod. Phys. Lett. A15 (2000) 883.\n[17] R.J. Fries and A. Schäfer, Phys. Lett. B443 (1998) 40.\n[18] K.G. Boreskov, A.B. Kaidalov, Eur. Phys. J. C10 (1999) 143.\n[19] F.G. Cao and A.I. Signal, Eur. Phys. J. C21 (2001) 105.\n[20] S. Kumano and M. Miyama, Phys. Rev. D65 (2002) 034012.\n[21] R.J. Fries, A. Schäfer, and C. Weiss, Eur. Phys. J. A17 (2003) 509.\n[22] F.G. Cao and A.I. Signal, Phys. Rev. D68 (2003) 074002.\n[23] D.I. Diakonov, V.Yu. Petrov, P.V. Pobylitsa, M.V. Polyakov, and C. Weiss,\nNucl. Phys. B480 (1996) 341 ; Phys. Rev. D56 (1997) 4069.\n[24] H. Weigel, L. Gamberg, and H. Reinhardt, Mod. Phys. Lett. A11 (1996) 3021 ;\nPhys. Lett. B399 (1997) 287.\n10\n\n\f[25] M. Wakamatsu and T. Kubota, Phys. Rev. D60 (1999) 034020.\n[26] M. Wakamatsu and T. Watabe, Phys. Rev. D62 (2000) 017506.\n[27] B. Dressler, K. Goeke, M.V. Polyakov, and C. Weiss, Eur. Phys. J. C14 (2000) 147.\n[28] M. Wakamatsu, Phys. Rev. D67 (2003) 034005 ; Phys. Rev. D67 (2003) 034006.\n[29] M. Wakamatsu and H. Yoshiki, Nucl. Phys. A524 (1991) 561.\n[30] M. Wakamatsu and T. Watabe, Phys. Rev. D62 (2000) 054009.\n[31] M. Wakamatsu, arXiv:0908.0972 [hep-ph].\n[32] A.W. Thomas, Phys. Rev. Lett. 101 (2009) 102003.\n[33] M. Wakamatsu and H. Tsujimoto, Phys. Rev. D71 (2005) 074001.\n[34] M. Wakamatsu and Y. Nakakoji, Phys. Rev. D74 (2006) 054006 ;\nPhys. Rev. D77 (2008) 074011.\n[35] HERMES Collaboration : A. Airapetian et al., Phys. Rev. D71 (2005) 012003 ;\nPhys. Rev. Lett. 92 (2004) 012005.\n[36] D. de Florian, R. Sassot, M. Stratmann, and W. Vogelsang, Phys. Rev. D80 (2009) 034030.\n[37] D.I. Diakonov, V.Yu. Petrov, and. P.V. Pobylitsa, Nucl. Phys. B306 (1988) 809.\n[38] H. Weigel, R.Alkofer, and H. Reinhardt, Nucl. Phys. B387 (1992) 638.\n[39] A. Blotz, D.I. Diakonov, K.Goeke, N.W. Park, V.Yu. Petrov, and P.V. Pobylitsa,\nNucl. Phys. A555 (1993) 765.\n[40] M. Glück, E. Reya, and A. Vogt, Z. Phys. C67 (1995) 433.\n[41] M. Glück, E. Reya, M. Stratmann, and A. Vogt, Phys. Rev. D53 (1996) 4775.\n[42] M. Wakamatsu, Phys. Lett. B646 (2007) 24.\n[43] COMPASS Collaboration, E.S. Ageev et al., Phys. Lett. B612 (2005) 154.\n[44] SMC Collaboration, B. Adeva et al., Phys. Rev. D58 (1998) 112001.\n[45] E. Leader and D.B. Stamenov, Phys. Rev. D67 (2003) 037503.\n\n11\n\n\f"}