{"id": "http://arxiv.org/abs/0906.3251v1", "guidislink": true, "updated": "2009-06-17T17:06:51Z", "updated_parsed": [2009, 6, 17, 17, 6, 51, 2, 168, 0], "published": "2009-06-17T17:06:51Z", "published_parsed": [2009, 6, 17, 17, 6, 51, 2, 168, 0], "title": "Limitations of Self-Assembly at Temperature One (extended abstract)", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0906.2527%2C0906.0648%2C0906.2675%2C0906.4094%2C0906.4030%2C0906.4449%2C0906.3039%2C0906.1465%2C0906.2514%2C0906.1652%2C0906.1899%2C0906.5292%2C0906.4433%2C0906.3120%2C0906.4284%2C0906.1214%2C0906.2807%2C0906.0063%2C0906.1118%2C0906.3553%2C0906.0807%2C0906.0754%2C0906.1821%2C0906.4219%2C0906.2053%2C0906.0856%2C0906.0960%2C0906.1130%2C0906.0992%2C0906.2898%2C0906.2538%2C0906.4562%2C0906.4947%2C0906.0682%2C0906.2773%2C0906.0497%2C0906.0125%2C0906.2212%2C0906.1059%2C0906.0232%2C0906.1603%2C0906.2530%2C0906.0056%2C0906.0771%2C0906.1731%2C0906.3771%2C0906.3090%2C0906.3042%2C0906.2148%2C0906.1428%2C0906.3717%2C0906.2026%2C0906.3973%2C0906.5574%2C0906.3417%2C0906.0396%2C0906.1476%2C0906.2964%2C0906.4323%2C0906.5521%2C0906.5390%2C0906.0502%2C0906.3146%2C0906.3067%2C0906.1486%2C0906.5185%2C0906.3929%2C0906.4584%2C0906.2814%2C0906.1838%2C0906.0058%2C0906.3663%2C0906.3045%2C0906.1950%2C0906.4732%2C0906.5281%2C0906.1894%2C0906.2993%2C0906.0452%2C0906.1137%2C0906.3251%2C0906.2446%2C0906.0144%2C0906.1165%2C0906.0267%2C0906.4877%2C0906.5384%2C0906.4315%2C0906.4587%2C0906.4009%2C0906.0616%2C0906.0699%2C0906.4995%2C0906.0598%2C0906.5144%2C0906.5442%2C0906.2810%2C0906.0512%2C0906.4558%2C0906.1111%2C0906.0158&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Limitations of Self-Assembly at Temperature One (extended abstract)"}, "summary": "We prove that if a subset X of the integer Cartesian plane weakly\nself-assembles at temperature 1 in a deterministic (Winfree) tile assembly\nsystem satisfying a natural condition known as *pumpability*, then X is a\nfinite union of doubly periodic sets. This shows that only the most simple of\ninfinite shapes and patterns can be constructed using pumpable temperature 1\ntile assembly systems, and gives strong evidence for the thesis that\ntemperature 2 or higher is required to carry out general-purpose computation in\na tile assembly system. Finally, we show that general-purpose computation is\npossible at temperature 1 if negative glue strengths are allowed in the tile\nassembly model.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0906.2527%2C0906.0648%2C0906.2675%2C0906.4094%2C0906.4030%2C0906.4449%2C0906.3039%2C0906.1465%2C0906.2514%2C0906.1652%2C0906.1899%2C0906.5292%2C0906.4433%2C0906.3120%2C0906.4284%2C0906.1214%2C0906.2807%2C0906.0063%2C0906.1118%2C0906.3553%2C0906.0807%2C0906.0754%2C0906.1821%2C0906.4219%2C0906.2053%2C0906.0856%2C0906.0960%2C0906.1130%2C0906.0992%2C0906.2898%2C0906.2538%2C0906.4562%2C0906.4947%2C0906.0682%2C0906.2773%2C0906.0497%2C0906.0125%2C0906.2212%2C0906.1059%2C0906.0232%2C0906.1603%2C0906.2530%2C0906.0056%2C0906.0771%2C0906.1731%2C0906.3771%2C0906.3090%2C0906.3042%2C0906.2148%2C0906.1428%2C0906.3717%2C0906.2026%2C0906.3973%2C0906.5574%2C0906.3417%2C0906.0396%2C0906.1476%2C0906.2964%2C0906.4323%2C0906.5521%2C0906.5390%2C0906.0502%2C0906.3146%2C0906.3067%2C0906.1486%2C0906.5185%2C0906.3929%2C0906.4584%2C0906.2814%2C0906.1838%2C0906.0058%2C0906.3663%2C0906.3045%2C0906.1950%2C0906.4732%2C0906.5281%2C0906.1894%2C0906.2993%2C0906.0452%2C0906.1137%2C0906.3251%2C0906.2446%2C0906.0144%2C0906.1165%2C0906.0267%2C0906.4877%2C0906.5384%2C0906.4315%2C0906.4587%2C0906.4009%2C0906.0616%2C0906.0699%2C0906.4995%2C0906.0598%2C0906.5144%2C0906.5442%2C0906.2810%2C0906.0512%2C0906.4558%2C0906.1111%2C0906.0158&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We prove that if a subset X of the integer Cartesian plane weakly\nself-assembles at temperature 1 in a deterministic (Winfree) tile assembly\nsystem satisfying a natural condition known as *pumpability*, then X is a\nfinite union of doubly periodic sets. This shows that only the most simple of\ninfinite shapes and patterns can be constructed using pumpable temperature 1\ntile assembly systems, and gives strong evidence for the thesis that\ntemperature 2 or higher is required to carry out general-purpose computation in\na tile assembly system. Finally, we show that general-purpose computation is\npossible at temperature 1 if negative glue strengths are allowed in the tile\nassembly model."}, "authors": ["David Doty", "Matthew J. Patitz", "Scott M. Summers"], "author_detail": {"name": "Scott M. Summers"}, "author": "Scott M. Summers", "links": [{"title": "doi", "href": "http://dx.doi.org/10.4204/EPTCS.1.6", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0906.3251v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0906.3251v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cs.CC", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cs.CC", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0906.3251v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0906.3251v1", "arxiv_comment": null, "journal_reference": "EPTCS 1, 2009, pp. 67-69", "doi": "10.4204/EPTCS.1.6", "fulltext": "arXiv:0906.3251v1 [cs.CC] 17 Jun 2009\n\nLimitations of Self-Assembly at Temperature One (extended\nabstract)\nDavid Doty\n\nMatthew J. Patitz\n\nScott M. Summers\n\nDepartment of Computer Science\n\nDepartment of Computer Science\n\nDepartment of Computer Science\n\nIowa State University\n\nIowa State University\n\nIowa State University\n\nAmes, IA 50011, USA\n\nAmes, IA 50011, USA\n\nAmes, IA 50011, USA\n\nddoty@cs.iastate.edu\n\nmpatitz@cs.iastate.edu\n\nsummers@cs.iastate.edu\n\nWe prove that if a set X ⊆ Z2 weakly self-assembles at temperature 1 in a deterministic (Winfree)\ntile assembly system satisfying a natural condition known as pumpability, then X is a finite union of\nsemi-doubly periodic sets. This shows that only the most simple of infinite shapes and patterns can\nbe constructed using pumpable temperature 1 tile assembly systems, and gives evidence for the thesis\nthat temperature 2 or higher is required to carry out general-purpose computation in a tile assembly\nsystem. Finally, we show that general-purpose computation is possible at temperature 1 if negative\nglue strengths are allowed in the tile assembly model.\n\n1\n\nIntroduction\n\nSelf-assembly is a bottom-up process by which a small number of fundamental components automatically coalesce to form a target structure. In 1998, Winfree [7] introduced the (abstract) Tile Assembly\nModel (TAM) – an \"effectivization\" of Wang tiling [5, 6] – as an over-simplified mathematical model\nof the DNA self-assembly pioneered by Seeman [4]. In the TAM, the fundamental components are unrotatable, but translatable square \"tile types\" whose sides are labeled with glue \"colors\" and \"strengths.\"\nTwo tiles that are placed next to each other interact if the glue colors on their abutting sides match, and\nthey bind if the strength on their abutting sides matches with total strength at least a certain ambient\n\"temperature,\" usually taken to be 1 or 2.\nDespite its deliberate over-simplification, the TAM is a computationally and geometrically expressive\nmodel at temperature 2. The reason is that, at temperature 2, certain tiles are not permitted to bond until\ntwo tiles are already present to match the glues on the bonding sides, which enables cooperation between\ndifferent tile types to control the placement of new tiles. Winfree [7] proved that at temperature 2 the\nTAM is computationally universal and thus can be directed algorithmically.\nIn contrast, we aim to prove that the lack of cooperation at temperature 1 inhibits the sort of complex\nbehavior possible at temperature 2. Our main theorem concerns the weak self-assembly of subsets of\nZ2 using temperature 1 tile assembly systems. Informally, a set X ⊆ Z2 weakly self-assembles in a tile\nassembly system T if some of the tile types of T are painted black, and T is guaranteed to self-assemble\ninto an assembly α of tiles such that X is precisely the set of integer lattice points at which α contains\nblack tile types. As an example, Winfree [7] exhibited a temperature 2 tile assembly system, directed by a\nclever XOR-like algorithm, that weakly self-assembles a well-known set, the discrete Sierpinski triangle,\nonto the first quadrant. Note that the underlying shape (set of all points containing a tile, whether black\nor not) of Winfree's construction is an infinite canvas that covers the entire first quadrant, onto which a\nmore sophisticated set, the discrete Sierpinski triangle, is painted.\nWe show that under a plausible assumption, temperature 1 tile systems weakly self-assemble only a\nlimited class of sets. To prove our main result, we require the hypothesis that the tile system is pumpable.\nT. Neary, D. Woods, A.K. Seda and N. Murphy (Eds.):\nThe Complexity of Simple Programs 2008.\nEPTCS 1, 2009, pp. 67–69, doi:10.4204/EPTCS.1.6\n\nc D. Doty, M. Patitz and S. Summers\nThis work is licensed under the\nCreative Commons Attribution License.\n\n\fLimitations of Self-Assembly at Temperature One\n\n68\n\nInformally, this means that every sufficiently long path of tiles in an assembly of this system contains a\nsegment in which the same tile type repeats (a condition clearly implied by the pigeonhole principle), and\nthat furthermore, the subpath between these two occurrences can be repeated indefinitely (\"pumped\")\nalong the same direction as the first occurrence of the segment, without \"colliding\" with a previous\nportion of the path. We give a counterexample of a path in which the same tile type appears twice, yet\nthe segment between the appearances cannot be pumped without eventually resulting in a collision that\nprevents additional pumping. The hypothesis of pumpability states (roughly) that in every sufficiently\nlong path, despite the presence of some repeating tiles that cannot be pumped, there exists a segment in\nwhich the same tile type repeats that can be pumped. In the above-mentioned counterexample, the paths\nconstructed to create a blocked segment always contain some previous segment that is pumpable. We\nconjecture that this phenomenon, pumpability, occurs in every temperature 1 tile assembly system that\nproduces a unique infinite structure.\nA semi-doubly periodic set X ⊆ Z2 is a set of integer lattice points with the property that there\n~\nare\no point\" of the set), ~u, and ~v (the two periods of the set), such that X =\nn three vectors b (the \"base\n~b + n *~u + m *~v n, m ∈ N . That is, a semi-doubly periodic set is a set that repeats infinitely along\ntwo vectors (linearly independent vectors in the non-degenerate case), starting at some base point ~b.\nWe show that any directed, pumpable, temperature 1 tile assembly system weakly self-assembles a set\nX ⊆ Z2 that is a finite union of semi-doubly periodic sets.\nIt is our contention that weak self-assembly captures the intuitive notion of what it means to \"compute\" with a tile assembly system. For example, the use of tile assembly systems to build shapes is\ncaptured by requiring all tile types to be black, in order to ask what set of integer lattice points contain\nany tile at all (so-called strict self-assembly). However, weak self-assembly is a more general notion.\nFor example, Winfree's above mentioned result shows that the discrete Sierpinski triangle weakly selfassembles at temperature 2 [3], yet this shape does not strictly self-assemble at any temperature [1].\nHence weak self-assembly allows for a more relaxed notion of set building, in which intermediate space\ncan be used for computation, without requiring that the space filled to carry out the computation also\nrepresent the final result of the computation.\nAs another example, there is a standard construction [7] by which a single-tape Turing machine\nmay be simulated by a temperature 2 tile assembly system. Regardless of the semantics of the Turing\nmachine (whether it decides a language, enumerates a language, computes a function, etc.), it is routine to represent the result of the computation by the weak self-assembly of some set. For example,\nPatitz and\n\b Summers2[2] showed\u0001 that for any decidable language A ⊆ N, A's projection along the X -axis\nthe set (x, 0) ∈ N x ∈ A\nweakly self-assembles in a temperature 2 tile assembly system. As another example, if a Turing machine computes a function f : N → N, it is routine to design a tile assembly\nsystem based on Winfree's construction such that, if the seed assembly is used to encode the binary\nrepresentation of a number n ∈ N, then the tile assembly system weakly self-assembles the set\n(\n\n(k, 0) ∈ N2\n\nthe kth least significant bit of the\nbinary representation of f (n) is 1\n\n)\n\n.\n\nOur result is motivated by the thesis that if a tile assembly system can reasonably be said to \"compute\", then the result of this computation can be represented in a straightforward manner as a set X ⊆ Z2\nthat weak self-assembles in the tile assembly system, or a closely related tile assembly system. Our examples above provide evidence for this thesis, although it is as informal and unprovable as the ChurchTuring thesis. On the basis of this claim, and the triviality of semi-doubly periodic sets, we conclude\n\n\fD. Doty, M. Patitz and S. Summers\n\n69\n\nthat our main result implies that directed, pumpable, temperature 1 tile assembly systems are incapable\nof general-purpose deterministic computation, without further relaxing the model.\nAcknowledgments\nWe wish to thank Maria Axenovich, Matt Cook, and Jack Lutz for useful discussions, and anonymous\nreferees for corrections. We would especially like to thank Niall Murphy, Turlough Neary, Anthony K.\nSeda and Damien Woods for inviting us to present a preliminary version of this research at the International Workshop on The Complexity of Simple Programs, University College Cork, Ireland on December\n6th and 7th, 2008.\n\nReferences\n[1] James I. Lathrop, Jack H. Lutz & Scott M. Summers (2009): Strict Self-Assembly of Discrete Sierpinski\nTriangles. Theoretical Computer Science 410, pp. 384–405.\n[2] Matthew J. Patitz & Scott M. Summers (2008): Self-Assembly of Decidable Sets. In: Proceedings of The\nSeventh International Conference on Unconventional Computation (Vienna, Austria, August 25-28, 2008).\n[3] Paul W.K. Rothemund, Nick Papadakis & Erik Winfree (2004): Algorithmic Self-Assembly of DNA Sierpinski\nTriangles. PLoS Biology 2(12).\n[4] Nadrian C. Seeman (1982): Nucleic-acid junctions and lattices. Journal of Theoretical Biology 99, pp. 237–\n247.\n[5] Hao Wang (1961): Proving Theorems by Pattern Recognition – II. The Bell System Technical Journal XL(1),\npp. 1–41.\n[6] Hao Wang (1963): Dominoes and the AEA case of the decision problem. In: Proceedings of the Symposium\non Mathematical Theory of Automata (New York, 1962). Polytechnic Press of Polytechnic Inst. of Brooklyn,\nBrooklyn, N.Y., pp. 23–55.\n[7] Erik Winfree (1998): Algorithmic Self-Assembly of DNA. Ph.D. thesis, California Institute of Technology.\n\n\f"}