{"id": "http://arxiv.org/abs/1004.2609v2", "guidislink": true, "updated": "2010-07-05T12:27:56Z", "updated_parsed": [2010, 7, 5, 12, 27, 56, 0, 186, 0], "published": "2010-04-15T11:36:04Z", "published_parsed": [2010, 4, 15, 11, 36, 4, 3, 105, 0], "title": "Colliding AdS gravitational shock waves in various dimensions and\n  holography", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.3951%2C1004.0550%2C1004.5195%2C1004.2755%2C1004.3482%2C1004.3059%2C1004.3162%2C1004.1847%2C1004.4993%2C1004.3089%2C1004.4224%2C1004.1072%2C1004.1020%2C1004.5495%2C1004.2805%2C1004.1536%2C1004.2609%2C1004.2450%2C1004.4426%2C1004.3578%2C1004.2165%2C1004.1060%2C1004.1597%2C1004.5256%2C1004.3233%2C1004.4081%2C1004.4444%2C1004.4158%2C1004.5440%2C1004.4472%2C1004.3198%2C1004.4788%2C1004.5310%2C1004.2736%2C1004.4843%2C1004.0507%2C1004.4681%2C1004.2199%2C1004.0732%2C1004.2945%2C1004.2670%2C1004.4562%2C1004.3835%2C1004.0809%2C1004.0612%2C1004.2499%2C1004.3264%2C1004.4973%2C1004.5209%2C1004.0512%2C1004.5219%2C1004.1955%2C1004.3056%2C1004.1136%2C1004.2485%2C1004.2912%2C1004.4749%2C1004.0052%2C1004.0838%2C1004.3929%2C1004.0105%2C1004.0599%2C1004.0263%2C1004.4274%2C1004.0186%2C1004.0284%2C1004.0481%2C1004.3791%2C1004.2297%2C1004.3418%2C1004.5239%2C1004.3475%2C1004.0104%2C1004.3261%2C1004.0401%2C1004.1349%2C1004.2305%2C1004.3737%2C1004.0994%2C1004.1802%2C1004.0959%2C1004.4094%2C1004.1215%2C1004.1480%2C1004.1902%2C1004.2688%2C1004.3765%2C1004.4773%2C1004.5303%2C1004.2664%2C1004.0513%2C1004.3780%2C1004.5498%2C1004.2911%2C1004.3620%2C1004.4719%2C1004.2976%2C1004.3865%2C1004.0921%2C1004.3881%2C1004.1766&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Colliding AdS gravitational shock waves in various dimensions and\n  holography"}, "summary": "The formation of marginally trapped surfaces in the off-center collision of\ntwo shock waves on AdS_D (with D=4,5,6,7 and 8) is studied numerically. We\nfocus on the case when the two waves collide with nonvanishing impact parameter\nwhile the sources are located at the same value of the holographic coordinate.\nIn all cases a critical value of the impact parameter is found above which no\ntrapped surface is formed. The numerical results show the existence of a simple\nscaling relation between the critical impact parameter and the energy of the\ncolliding waves. Using the isometries of AdS_D we relate the solutions obtained\nto the ones describing the collision of two waves with a purely holographic\nimpact parameter. This provides a gravitational dual for the head-on collision\nof two lumps of energy of unequal size.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.3951%2C1004.0550%2C1004.5195%2C1004.2755%2C1004.3482%2C1004.3059%2C1004.3162%2C1004.1847%2C1004.4993%2C1004.3089%2C1004.4224%2C1004.1072%2C1004.1020%2C1004.5495%2C1004.2805%2C1004.1536%2C1004.2609%2C1004.2450%2C1004.4426%2C1004.3578%2C1004.2165%2C1004.1060%2C1004.1597%2C1004.5256%2C1004.3233%2C1004.4081%2C1004.4444%2C1004.4158%2C1004.5440%2C1004.4472%2C1004.3198%2C1004.4788%2C1004.5310%2C1004.2736%2C1004.4843%2C1004.0507%2C1004.4681%2C1004.2199%2C1004.0732%2C1004.2945%2C1004.2670%2C1004.4562%2C1004.3835%2C1004.0809%2C1004.0612%2C1004.2499%2C1004.3264%2C1004.4973%2C1004.5209%2C1004.0512%2C1004.5219%2C1004.1955%2C1004.3056%2C1004.1136%2C1004.2485%2C1004.2912%2C1004.4749%2C1004.0052%2C1004.0838%2C1004.3929%2C1004.0105%2C1004.0599%2C1004.0263%2C1004.4274%2C1004.0186%2C1004.0284%2C1004.0481%2C1004.3791%2C1004.2297%2C1004.3418%2C1004.5239%2C1004.3475%2C1004.0104%2C1004.3261%2C1004.0401%2C1004.1349%2C1004.2305%2C1004.3737%2C1004.0994%2C1004.1802%2C1004.0959%2C1004.4094%2C1004.1215%2C1004.1480%2C1004.1902%2C1004.2688%2C1004.3765%2C1004.4773%2C1004.5303%2C1004.2664%2C1004.0513%2C1004.3780%2C1004.5498%2C1004.2911%2C1004.3620%2C1004.4719%2C1004.2976%2C1004.3865%2C1004.0921%2C1004.3881%2C1004.1766&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The formation of marginally trapped surfaces in the off-center collision of\ntwo shock waves on AdS_D (with D=4,5,6,7 and 8) is studied numerically. We\nfocus on the case when the two waves collide with nonvanishing impact parameter\nwhile the sources are located at the same value of the holographic coordinate.\nIn all cases a critical value of the impact parameter is found above which no\ntrapped surface is formed. The numerical results show the existence of a simple\nscaling relation between the critical impact parameter and the energy of the\ncolliding waves. Using the isometries of AdS_D we relate the solutions obtained\nto the ones describing the collision of two waves with a purely holographic\nimpact parameter. This provides a gravitational dual for the head-on collision\nof two lumps of energy of unequal size."}, "authors": ["Alvaro Duenas-Vidal", "Miguel A. Vazquez-Mozo"], "author_detail": {"name": "Miguel A. Vazquez-Mozo"}, "author": "Miguel A. Vazquez-Mozo", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/JHEP07(2010)021", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1004.2609v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1004.2609v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "25 pages, 11 figures. v2: minor changes, typos corrected. To appear\n  in JHEP", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1004.2609v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1004.2609v2", "journal_reference": "JHEP 1007:021,2010", "doi": "10.1007/JHEP07(2010)021", "fulltext": "Colliding AdS gravitational shock waves in various\n\narXiv:1004.2609v2 [hep-th] 5 Jul 2010\n\ndimensions and holography\n\nÁlvaro Dueñas-Vidal1 and Miguel A. Vázquez-Mozo2\n\nDepartamento de Fı́sica Fundamental, Universidad de Salamanca\nPlaza de la Merced s/n, E-37008 Salamanca, Spain\nand\nInstituto Universitario de Fı́sica Fundamental y Matemáticas (IUFFyM)\nUniversidad de Salamanca, Salamanca, Spain\n\nAbstract\nThe formation of marginally trapped surfaces in the off-center collision of two shock waves on\nAdSD (with D = 4, 5, 6, 7 and 8) is studied numerically. We focus on the case when the two\nwaves collide with nonvanishing impact parameter while the sources are located at the same\nvalue of the holographic coordinate. In all cases a critical value of the impact parameter is\nfound above which no trapped surface is formed. The numerical results show the existence of\na simple scaling relation between the critical impact parameter and the energy of the colliding\nwaves. Using the isometries of AdSD we relate the solutions obtained to the ones describing the\ncollision of two waves with a purely holographic impact parameter. This provides a gravitational\ndual for the head-on collision of two lumps of energy of unequal size.\n\n1\n2\n\nadv@usal.es\nMiguel.Vazquez-Mozo@cern.ch\n\n\f1\n\nIntroduction\n\nThe applications of AdS/CFT duality to the description of heavy ion collisions has attracted\nquite a lot of attention in recent years, in the hope of describing the phenomenology observed in\nRHIC and expected in the LHC (see [1] for reviews). The detection in RHIC of a large elliptic\nflow and jet quenching are interpreted as indications that the quark-gluon plasma produced in\nthe collision is strongly coupled, thus making AdS/CFT a very useful tool to capture some of\nthe relevant physics involved. In spite of the difference between real QCD and N = 4 SYM,\nthe calculations of some relevant observables using gravitational duals [2] show a reasonable\ngood agreement with the experimental results.\nA possible way to model the collision of two heavy ions in a strongly coupled gauge theory is\nto consider the scattering of two energy lumps in a N = 4 SYM theory at strong coupling [3, 4].\nThe gravitational dual of such a system is a space-time representing the collision of two shock\ngravitational waves propagating in AdS5 . Nonetheless, the picture of the heavy ions proposed\nin [4] is not free of problems [5]. For example, it produces an energy density profile for the lumps\nin the gauge theory that falls off as a power of the transverse distance from its center, quite\nunlike the exponential fall off expected from phenomenological nuclear potentials. However, in\nspite of these caveats, these systems are a good test bench to analyze collective properties of\nstrongly coupled plasmas that might be of relevance in understanding the phenomenology of\nheavy ion collisions [6].\nIn this paper we study various aspects of the collision of shock gravitational waves in AdS\nspace-time in various dimensions. The metric in the region before the collision takes place (i.e.,\nwhere at least one of the two null coordinates u or v is negative as shown in Fig. 1) is given by\ni\nL2 h 2\nz\nz\n2\n2\n2\nds = 2 dz − dudv + d~x + Φ+ (z, ~x)δ(u)du + Φ− (z, ~x)δ(v)dv ,\nz\nL\nL\n2\n\n(1.1)\n\nwhere Φ± (z, ~x) are the wave profiles and L is the AdSD radius. A full description of the final\nfate of the wave collision (and its holographic interpretation) would require knowing in detail\nthe solution to the Einstein equations in the interaction region u > 0, v > 0, something that up\nto date has not been fully achieved (for some important progress in this direction see [7]). Based\non the intuition in flat space, however, one expects that the collision of two shock waves would\nproduce some kind of dressed singularity. The holographic interpretation of such a process\nwould be the thermalization of the N = 4 SYM plasma produced as the result of the collision\n1\n\n\fof the two incoming lumps whose energy distribution is given by a CFT energy momentum\ntensor with components [8]\nhTuu iCFT =\n\nD−1\nz+\n2D−2 μ+\nδ(u),\n2 D−2\nVol(S D−3 ) [(~x − ~b+ )2 + z+\n]\n\nhTvv iCFT =\n\nD−1\nz−\n2D−2 μ−\nδ(v),\n2 D−2\nVol(S D−3 ) [(~x − ~b− )2 + z−\n]\n\n(1.2)\n\nwith (z± , ~b± ) the holographic and transverse coordinates of the sources of the waves (1.1).\nA way to avoid solving for the geometry in the u > 0, v > 0 wedge is to look for the\nformation of an apparent horizon before actually getting into the region of space-time where\nthe interaction takes place [11]. In AdS for the case of zero impact parameter it was found in\n[4] that such a trapped surface is always formed for any energy of the incoming waves. The case\nof collisions with a nonvanishing impact parameter along the field theory coordinates has been\nstudied in AdS5 [10], where there is an energy-dependent critical value of the impact parameter\nabove which no marginally trapped surface of the type sought is formed. The results found in\n[4] and [10] are qualitatively similar to the corresponding situations in flat spacetime [12, 13].\nIn the dual N = 4 SYM theory the interpretation of the results of [10] would be the existence\nof a critical impact parameter for the thermalization of the plasma following the collision of two\nenergy lumps of the same size. This can be understood if we think that for large enough impact\nparameter the two energy distributions do not have enough overlap to induce a thermalization\nof the whole plasma once the collision takes places. Once again, to see what happens as the\nresult of the collision would require solving the field equations into the interaction region1 .\nAnother interesting physical situation is that of the collision of two shock waves whose\nsources have different values of the holographic coordinates. A look at Eq. (1.2) shows that in\nthe holographic theory this describes the collision of two energy lumps of different size, with or\nwithout impact parameter. This problem has been addressed in [8], where the trapped surface\nequation is solved analytically in the limit in which the impact parameter is much smaller than\nthe critical value. It would be interesting, nevertheless, to study the collision of waves with\n\"large\" holographic impact parameter in various dimensions.\nIn Ref. [14] the formation of trapped surfaces in the head-on collision of two shock waves\nwas studied for incoming waves characterized by a finite size in transverse space, in contrast\n1\n\nWe should not forget that the non-existence of the trapped surface of Penrose's type [11] does not exclude\nthat other trapped surfaces are formed in the interaction region.\n\n2\n\n\fwith the case studied in [4] where the energy density along the wave-front follows a deltafunction distribution in transverse coordinates. For D = 4 and D = 5 it was found that the\nmarginally closed trapped surface only forms if the transverse size of the wave is smaller than\ncertain critical value. If we interpret the formation of the trapped surface as a signal of eventual\nblack hole formation as a result of the collision, this could imply at face value the existence of\na threshold for thermalization in the holographic gauge theory as a function of the spread of\nthe wave in the gravitational dual. It is not clear, however, what meaning the spread of the\ngravitational sources introduced in [14] might have in the holographic conformal field theory.\nFor example, a calculation of the holographic energy-momentum tensor shows that the size of\nthe energy distribution in the boundary theory is independent of the value of the deformation\nparameter. Indeed, applying the holographic prescription [9] to the solution found in [14] for\nthe wave profile Φ(z, ~x), the associated holographic energy-momentum tensor is\nhTuu iCFT =\n\n2D−2 μ\nLD−1\nδ(u),\nVol (S D−3 ) (~x 2 + L2 )D−2\n\n(1.3)\n\nand similarly for hTvv iCFT by replacing u → v. Thus no trace of the smearing of the gravitational source is left in the energy distribution in the boundary theory, its transverse size being\ndetermined solely by the value of the holographic coordinate of the source, z = L.\nIn this note our aim is twofold: first to study numerically the formation of marginally closed\ntrapped surfaces in the collision of two shock waves in AdSD space-time with a nonvanishing\nimpact parameter in the field theory coordinates, thus extending the analysis of [10] to D 6= 5.\nSecond, to apply the results obtained to the analysis of collisions of two AdSD shock waves with\n\"purely holographic\" impact parameter, i.e. when the sources of the two incoming waves are\nlocated at points in transverse space that only differ in the value of the holographic coordinate.\nThe strategy used consists in exploiting the underlying O(2,D − 1) isometries of AdSD to map\nthis problem to a problem of the scattering of two waves with \"spatial\" impact parameter (cf.\n[8, 10]). As explained above, in the spirit of the AdS/CFT correspondence, collisions with\npure holographic impact parameter provide the gravitational dual of the high-energy head-on\ncollision of two energy distributions of unequal size in the strongly coupled CFT.\nIn Section 2 we review the series of isometries of AdSD that allow to rotate a general\ncollision with purely holographic impact parameter into a symmetric collision with an impact\nparameter along the field theory coordinates. The numerical analysis of the trapped surface\nequations is done in Section 3. Finally, our results together with their holographic interpretation\n3\n\n\fu\n\nv\n\nInteraction\nregion\n\nAdS\n\nAdS\n\nAdS\n\nFigure 1: The four regions in the space-time describing the interaction of two shock waves in\nAdSD . The blue (right) and red (left) thick lines represent the location of the incoming waves,\nsupported respectively at u = 0, v < 0 and u < 0, v = 0.\nare discussed in Section 4. To make the presentation self-contained some technical details have\nbeen deferred to the Appendix.\n\n2\n\nGravitational shock wave collisions with holographic\nimpact parameter\n\nWe study the collision of two shock waves propagating on AdSD whose delta-function sources\nare located in the hyperbolic transverse space HD−2 at the points (z± , ~b± ). This space can be\nseen as a two-sheeted hyperboloid\n(Y 0 )2 − Y (D−2) −\n\nD−3\nX\n\n(Y i )2 = L2\n\n(2.1)\n\ni=1\n\nin (D − 1)-dimensional Minkowski space. Poincaré coordinates (z, ~x) can be introduced\n\u0012\n\u0013\nL2 + ~x 2\nz\n0\n,\nY =\n1+\n2\nz2\nL a\nYa =\nx ,\na = 1, . . . , D − 3,\n(2.2)\nz\u0012\n\u0013\nz\nL2 − ~x 2\nY D−2 =\n−1 +\n,\n2\nz2\n4\n\n\fin which the metric reads\nds2HD−2 =\n\n\u0011\nL2 \u0010 2\n2\ndz\n+\nd~\nx\n.\nz2\n\n(2.3)\n\nThe metric of the full space-time previous to the collision is of the form shown in Eq. (1.1)\nand is characterized by the profile functions Φ± (z, ~x). The Einstein equations reduce, outside\nthe interaction region in Fig. 1, to the Poisson-like equation in transverse space\n\u0013\n\u0012\n\u0010 z \u0011D−1\nD−2\n±\nΦ\n(z,\n~\nx\n)\n=\n−16πG\nμ\n\u0003HD−2 −\nδ(z − z± )δ (D−3) (~x − ~b± ).\n±\nN\n±\n2\nL\nL\n\n(2.4)\n\nHere \u0003HD−2 is the Laplacian in HD−2\n\u0003HD−2\n\n\u0011 z2\nz D−2 \u0010 4−D\n~2\n=\n∂z z\n∂z\n+ 2∇\n2\nL\nL\n\n(2.5)\n\nand μ± is the energy of the incoming waves, as read from the energy-momentum tensor\nTuu = μ+\nTvv = μ−\n\n\u0010 z \u0011D−2\n+\n\nL\n\u0010 z \u0011D−2\n−\n\nL\n\nδ(u)δ(z − z+ )δ (D−3) (~x − ~b+ ),\nδ(v)δ(z − z− )δ (D−3) (~x − ~b− ).\n\n(2.6)\n\nIn what follows we focus on the family of incoming trajectories considered in [4] where the\nsources are located at the points (z± , b± , 0, . . . , 0) with\nL\nz± (a) = p\n,\n1 + β 2 ± β cos a\nLβ sin a\n,\nb± (a) = ± p\n1 + β 2 ± β cos a\n\n(2.7)\n\nwith 0 ≤ a < 2π.\nThe space HD−2 has an O(1,D − 2) group of isometries. This can be seen as the part of the\nfull O(2,D −1) isometry of AdSD that preserves the null coordinates u, v. The group O(1,D −2)\nis generated by the O(D − 2) rotations of the ambient space coordinates (Y 1 , . . . , Y D−2 ) among\nthemselves, plus boost along each of these \"spatial\" coordinates. In the following we describe\na series of isometries of AdSD (and therefore of HD−2 ) that connect a general collision of two\nwaves with sources at ( √\n\nL\n, 0, 0, . . .)\n1+β 2 ±β\n\nto a symmetric collision where the sources are located\n\nat (L, ±Lβ, 0, . . .).\n\n5\n\n\fO(2) rotations. To begin with we are going to focus on the O(2) subgroup of O(D − 2) that\nrotates the embedding coordinates Y 1 , Y D−2\nY 01 = Y 1 cos θ + Y D−2 sin θ,\nY 0D−2 = −Y 1 sin θ + Y D−2 cos θ.\n\n(2.8)\n\nIn terms of the Poincaré coordinates (z, ~x) = (z, x, ~xT ) the O(2) rotations take the form\nz0 =\n\n2L2 z\n,\nL2 + z 2 + x2 + ~xT2 + (L2 − z 2 − x2 − ~xT2 ) cos θ − 2Lx sin θ\n\nx0 =\n\n2L2 x cos θ + L(L2 − z 2 − ~x⊥2 ) sin θ\n,\nL2 + z 2 + x2 + ~xT2 + (L2 − z 2 − x2 − ~xT2 ) cos θ − 2Lx sin θ\n\n~xT0 =\n\n2L2~xT\n.\nL2 + z 2 + x2 + ~xT2 + (L2 − z 2 − x2 − ~xT2 ) cos θ − 2Lx sin θ\n\n(2.9)\n\nIn spite of the nonlinear action on the coordinates it can be checked without much effort that the\nprevious transformations form an abelian group. Actually, the O(2) rotations of the coordinates\nof HD−2 can be written as the one-parameter group of transformations\n\u0014 \u0012\n\u0013\u0015\nθ 1\nU(θ) = exp i\nKx + LPx ,\n2 L\n\n(2.10)\n\nwhere\nPj = −i∂j\n\u0010\n\u0011\n\u0010\n\u0011\n~T\nKj = i z 2 + x2 + ~xT2 ∂j − 2ixj z∂z + x∂x + ~xT * ∇\n\n(2.11)\n\nare respectively the generators of translations and \"special conformal transformations\" on the\nfield theory coordinates (x, ~xT ). This transformation can be lifted to the corresponding isometry\nof the full AdSD space-time.\nActing on the family of points shown in Eq. (2.7) the O(2) rotations amount to a translation\nin the parameter a\n0\nz±\n(θ) = z± (a + θ),\n\nb0± (θ) = b± (a + θ).\n\n(2.12)\n\nHence, by performing an isometry of the background HD−2 we can transform the points\nL\n,\nz± = p\n1 + β2 ± β\n6\n\nb± = 0,\n\n(2.13)\n\n\fseparated in the holographic direction z, into\nL\n0\n,\nz±\n(θ) = p\n2\n1 + β ± β cos θ\nLβ sin θ\nb0± (θ) = ± p\n.\n1 + β 2 ± β cos θ\n\n(2.14)\n\nThis O(2) transformation maps a collision of two shock waves with holographic impact parameter into a problem in which the two waves collide generically with both spatial and holographic\nimpact parameter.\nIn our original problem (2.4) the group of isommetries O(1,D − 2), and therefore its O(2)\nsubgroup (2.9), is broken only by the presence of the sources. Because of this one can use this\nunderlying symmetry as a solution generating technique, since the transformation of a solution\nto the Einstein equations by an isometry is again a solution where the position of the sources\nis also tranformed. To see this we first compute the Jacobian associated with (2.9)\n\u0014\n\u0015D−2\n∂(z 0 , x0 , ~xT 0 )\n2L2\n=\n∂(z, x, ~xT )\nL2 + z 2 + x2 + ~xT2 + (L2 − z 2 − ~x⊥2 ) cos θ − 2Lx1 sin θ\n\u0012 0 \u0013D−2\nz\n=\n.\nz\n\n(2.15)\n\nNow we apply (2.9) to the equations (2.4) with sources located at (2.13). The Laplacian is\ninvariant, \u0003HD−2 = \u00030HD−2 , since we are dealing with an isometry of HD−2 . On the other hand,\nthe transformation of the delta functions can be computed using the expression of the Jacobian,\nleading to the result\n\u0013\n\u0012\nD−2\n0\nΦ± (z 0 , ~x 0 ) =\n\u0003HD−2 −\nL2\n\u0014 0\n\u0015\n\u0011 \u0010\n\u0011\nz± (θ) D−1 \u0010 0\n0\n0\n−16πGN μ± (θ)\nδ z − z±\n(θ) δ x0 − b0± (θ) δ (D−4) (~xT0 ).\nL\nThis describes the collision of two AdSD waves with sources at (2.14) and energies\n!\np\n2 ± β cos θ\n1\n+\nβ\np\nμ0± (θ) = μ±\n.\n1 + β2 ± β\n\n(2.16)\n\n(2.17)\n\nThis transformation of the energies μ± as the result of this rotation can be understood on\nphysical grounds remembering that they correspond to the energy of the incoming field theory\nenergy lumps at the boundary. The O(2) transformation on the transverse hyperbolic space\n7\n\n\fHD−2 brings one of the sources closer to the AdS boundary whereas the other \"moves\" deeper\ninto the bulk (see Fig. 2). From the point of view of the CFT on the boundary this means that\nthe energy of the configuration associated with the first source increases whereas the energy of\nthe lump associated with the second source gets smaller. This is a simple consequence of the\nIR/UV connection in AdS/CFT.\nWe now particularize Eq. (2.16) to the case θ = π2 , where the z coordinate of the two sources\nare equal. We find that the Einstein equations read in this case\n\u0013\n\u0012\nD−2\n0\n\u0003HD−2 −\nΦ± (z 0 , ~x 0 ) =\nL2\n\u0012 0 \u0013D−1 \u0010\n\u0011 \u0010\n\u0011\nz±\n0\n0\n0\n0\n0\n−16πGN μ±\nδ z − z± δ x − b± δ (D−4) (~xT0 )\nL\nand describes now the problem of the collision of two waves with energies\np\n1 + β2\n0\n,\nμ± = μ± p\n1 + β2 ± β\n\n(2.18)\n\n(2.19)\n\nwhose sources are located at\nL\n0\nz±\n=p\n,\n1 + β2\n\nLβ\nb0± = ± p\n.\n1 + β2\n\n(2.20)\n\nThis means that we have transformed our problem into the collision of two waves with spatial\nimpact parameter.\nLongitudinal boosts. This is however not the whole story. We have started with a collision\nwhere the two waves had different energy and, in general, this is also the case after the O(2)\nrotation has been performed. For practical purposes, however, it is simpler to study symmetric\ncollisions where the two waves approach each other at the same energy. To achieve this we can\nuse another isometry of AdSD consisting in longitudinal boosts on the u, v coordinates. To see\nhow this affects the shock wave we apply the boost\nu = λu,\n\nv = λ−1 v,\n\nλ>0\n\n(2.21)\n\nto the shock wave metric (1.1). The metric preserves the same form now with the profile\nΦ± (z 0 , ~x 0 ) = λ∓1 Φ± (z 0 , ~x 0 ).\n8\n\n(2.22)\n\n\fR1,D−1\nz+\n\nb−\n\nb+\n\nHD−2\n\nz−\n\nAdSD\n\nθ=\n\nπ\n2\n\nHD−2\n\nFigure 2: Schematic representation of the action of the O(2) rotation on the sources of the two\ncolliding waves.\nApplying now the boost to the components of the energy-momentum tensor (2.6) we find that\nthe energy μ± associated with the transformed wave is\nμ0± = λ∓1 μ0± .\nThus, by applying to Eq. (2.18) a longitudinal boost with parameter\n!\np\n1 + β2 − β\nμ+\np\nλ=\nμ−\n1 + β2 + β\n√\nwe end up with a symmetric collision with energy μ+ μ−\n\u0012\n\u0013\nD−2\n0\n\u0003HD−2 −\nΦ± (z 0 , ~x 0 ) =\nL2\n\u0012 0 \u0013D−1 \u0010\n\u0011 \u0010\n\u0011\nz\n√\n0\n−16πGN μ+ μ− ±\nδ z 0 − z±\nδ x0 − b0± δ (D−4) (~xT0 ).\nL\n\n(2.23)\n\n(2.24)\n\n(2.25)\n\n0\nCoordinate rescalings. There is however something unpleasant about the expressions of z±\n\nand b0± shown in Eq. (2.20). Since our only free parameter is β, we notice that it is not possible\nto change the spatial impact parameter b0± without at the same time moving the sources in\nthe holographic direction z± . To consider collisions where the spatial impact parameter is\n\n9\n\n\fdecoupled from the value of the holographic coordinate of the sources we apply the following\nrescaling to the coordinates\nz 00 =\n\np\n1 + β 2z0,\n\nx00 =\n\np\n1 + β 2 x0 ,\n\n~xT00 =\n\np\n1 + β 2~xT0 .\n\n(2.26)\n\nIn the full AdSD space this coordinate transformation is accompanied by similar rescaling of\nthe two null coordinates. In the new coordinates the sources (2.20) are located in the points\n00\nz±\n= L,\n\nb00± = ∓Lβ,\n\n(2.27)\n\nthus decoupling the value of the holographic coordinate from that of the impact parameter.\nWe have to keep in mind that this rescaling is an isometry of HD−2 . Implementing it in Eq.\n(2.25) we arrive at\n\u0012\n\u0013\nD−2\n00\n\u0003HD−2 −\nΦ± (z 00 , ~x 00 ) =\n2\nL\nr\n−16πGN\n\n\u0011 \u0010\n\u0011\nμ+ μ− \u0010 00\n00\nδ\nz\n−\nL\nδ\nx\n±\nLβ\nδ (D−4) (~xT00 ).\n1 + β2\n\n(2.28)\n\nNow the two shock waves have spatial impact parameter b ≡ |b00+ −b00− | = 2Lβ while both sources\nlie at z 00 = L.\nTo summarize, we started with the collision of two shock waves with energies μ± whose\nsources were located at the points (z± , x± ) given in Eq. (2.20). Taking advantage of the\nisometries of AdSD (and of its transverse section HD−2 ) this problem has been mapped into the\ncollision described by Eq. (2.28) where the two sources are located at z = L with an impact\nparameter b given by\nb ≡ |b00+ − b00− | = 2Lβ = |z+ − z− | ≡ ∆z,\n\n(2.29)\n\nwith ∆z the holographic impact parameter of the original collision. The change of coordinates\nconnecting Eqs. (2.18) and (2.28) is given by\nz 00\n\nx00\n\n~xT00\n\np\n2L2 1 + β 2 z\n=\n,\nL2 + z 2 + x2 + ~xT2 + (L2 − z 2 − x2 − ~xT2 ) cos θ − 2Lx sin θ\np\np\n2L2 1 + β 2 x cos θ + L 1 + β 2 (L2 − z 2 − ~x⊥2 ) sin θ\n,\n=\nL2 + z 2 + x2 + ~xT2 + (L2 − z 2 − x2 − ~xT2 ) cos θ − 2Lx sin θ\np\n2L2 1 + β 2~xT\n=\n.\nL2 + z 2 + x2 + ~xT2 + (L2 − z 2 − x2 − ~xT2 ) cos θ − 2Lx sin θ\n10\n\n(2.30)\n\n\fTo find the relation between the wave profiles we recall that these functions are only transformed\nby the longitudinal boost2 . Using the value (2.24) for the parameter of this boost we find that\nthe solution Φ± (z, ~x) for the collision with holographic impact parameter can be written in\nterms of the solution Φ± (z 00 , ~x 00 ) to Eq. (2.28) as\nμ−\nΦ± (z, ~x) =\nμ+\n\n!±1\np\n\u0010\n\u0011\n1 + β2 + β\n00\n00\np\nΦ± z (z, ~x), ~x (z, ~x) ,\n1 + β2 − β\n\n(2.31)\n\nwhere the coordinate transformations z 00 (z, ~x) and ~x 00 (z, ~x) are given by (2.30).\nThe bottom line of this whole discussion is that the solution to the problem of finding a closed\ntrapped surface in the collision of two shock waves with an impact parameter aligned along\nthe holographic direction is reduced to the one of finding this trapped surface in the collision\nof two shock waves with an impact parameter that is purely spatial. This latter problem is\neasier to tackle numerically. Once the trapped surface is found in this case the original one is\nobtained by applying the transformation (2.30). Because of the family of incoming trajectories\n(2.7) used our discussion applies to any collision problem where the position of the sources in\nthe holographic coordinate z± satisfies z+ z− = L2 . Notice, however, that for any other value\nof the product z+ z− a rescaling of all the coordinates in AdS can be performed to map it into\nthe problem at hand.\n\n3\n\nNumerical analysis of the formation of marginally closed\ntrapped surfaces\n\nWe have seen how the isometries of AdSD can be exploited to rotate a collision of two shock\nwaves with holographic impact parameter into a collision of two waves sourced at z = L and\nwith spatial impact parameter. In D = 5 this latter problem has been solved numerically in\n[10]. In this section we extend the numerical solution to other values of the dimension and\nstudy the emergence of thresholds for the formation of the closed trapped surface as a function\nof the impact parameter.\nBefore embarking on the search for closed trapped surfaces we have to switch to a new\n~ in which the null geodesics are continuous across the location\nsystem of coordinates (U, V, Z, X)\nof the waves [4, 10] (see the Appendix for the technical details). Once this is done, we look for\n2\n\nWe have to keep in mind that in AdSD the rescaling (2.26) also affects the null coordinates.\n\n11\n\n\fmarginally closed trapped surfaces S that lie along the position of the colliding shock waves\n{U = 0, V ≤ 0} ∪ {U ≤ 0, V = 0} [11, 4]. This surface can be written as the union of two\nbranches S = S+ ∪ S− parametrized as\n(\n~)\nU = −ψ+ (Z, X\nS+ =\n,\nV =0\n\n(\nS− =\n\nU =0\n~)\nV = −ψ− (Z, X\n\n.\n\n(3.1)\n\nAlthough most of this surface lies outside of the region U > 0, V > 0 where the two waves\ninteract, it \"feels\" the interaction taking place through the matching conditions at the (D −\n3)-dimensional intersection of the two branches C = S+ ∩ S− ⊂ HD−2 . Imposing that the\ncongruence of outer null geodesics normal to S has zero divergence leads to the equation (see\n[4] for the details)\n\u0012\n\u0003HD−2\n\nD−2\n−\nL2\n\n\u0013\u0010\n\n\u0011\nΦ± − Ψ± = 0,\n\n(3.2)\n\n~ ⊥ ) are the profiles of the incoming waves and\nwhere Φ± (Z, X\n~\n~ = z ψ± (Z, X).\nΨ± (Z, X)\nL\n\n(3.3)\n\nIn addition, from the very form (3.1) of the sought marginally closed trapped surface and the\nrequirement that the congruence of null geodesics is continuous across the intersection C we\nfind the conditions\n~)\nΨ± (Z, X\n\n= 0,\n\n~ )∂b Ψ± (Z, X\n~)\ng ab ∂a Ψ± (Z, X\n\nC\n\n= 4,\n\n(3.4)\n\nC\n\nwith gab the metric of HD−2 .\nIn order to solve the problem (3.2), (3.4) we solve the differential equation numerically\nusing the technique employed in Ref. [12] for the collision of shock waves in flat space-time.\nTo implement the procedure we switch to radial coordinates in HD−2 defined in terms of the\nhyperboloid coordinates by\nY 0 = r2 + L2 ,\n\nY 1 = rθ1 ,\n\n...\n\nY D−2 = rθD−2\n\n(3.5)\n\nwhere (θ1 , . . . , θD−2 ) parametrize the unit sphere SD−3 , i.e., (θ1 ) + . . . + (θD−2 )2 = 1. Now the\nmetric takes the form\nds2HD−2 =\n\ndr2\n+ r2 dθ2 + r2 sin2 θdΩ2D−4 .\nr2\n1 + L2\n12\n\n(3.6)\n\n\fHere we have singled out a polar angle θ ∈ [0, π] on the sphere SD−3 of constant r. In these\nnew coordinates3 (r, θ, θi ), with i = 1, . . . , D − 3, the sources of the incoming waves are located\nrespectively at the points ( 2b , 0, 0, . . . , 0) and ( 2b , π, 0, . . . , 0). Hence, the residual O(D − 3)\nsymmetry is generated by the isometries of the sphere SD−4 at constant r and constant θ.\nAs a consequence of this symmetry, both the profiles of the incoming waves Φ± (r, θ) and the\nfunctions defining the two branches of the trapped surface Ψ± (r, θ) only depend on r and θ. In\naddition, the surface C is generated by the action of O(D −3) on a curve that we parametrize as\nr = LG(θ) for 0 ≤ θ ≤ π. We have introduced the AdS radius L in order to make the function\nG(θ) dimensionless.\nIntroducing the function H± (r, θ) ≡ Φ± (r, θ)−Ψ± (r, θ), Eq. (3.2) reads in these coordinates\n\u0014\u0012\n\u0013\n\u0015\nr2\n1 2\nD−4\nD−2\n(D − 3)L2 + (D − 2)r2\n2\n1 + 2 ∂r +\n∂r + 2 ∂θ + 2\n∂θ −\nH± = 0\n(3.7)\nL\nrL2\nr\nr tan θ\nL2\nwith the boundary condition\n\u0010\n\nH± (r, θ)\n\n\u0011\n\n= Φ± LG(θ), θ .\n\n(3.8)\n\nr=LG(θ)\n\nThis problem has to be solved in the region 0 ≤ r ≤ LG(θ), 0 ≤ θ ≤ π, i.e. those points in the\nupper half-plane limited by the curve r = LG(θ). Because the sources of the waves are located\nsymmetrically around r = 0 the function G(θ) has the symmetry\nG(θ) = G(π − θ),\n\n(3.9)\n\nwhereas Ψ± (r, θ) and Φ± (r, θ) satisfy\nΨ± (r, θ) = Ψ± (r, π − θ),\n\nΦ± (r, θ) = Φ∓ (r, π − θ).\n\n(3.10)\n\nThe boundary G(θ) is determined by imposing that the solution to the boundary problem\nsatisfies the addition constraint\n\u0013\n\u0015\n\u0014\u0012\n1\nr2\n1 + 2 (∂r Ψ+ )(∂r Ψ− ) + 2 (∂θ Ψ+ )(∂θ Ψ− )\nL\nr\n\n= 4.\n\n(3.11)\n\nr=LG(θ)\n\nIn the symmetric collision that we are going to consider in the following Φ+ (z, ~x) = Φ− (z, ~x)\nand as a consequence the trapped surface has to be symmetric under a parity transformation\nWe have to keep in mind that only D − 4 of the D − 3 coordinates θi parametrizing the sphere SD−4 are\nindependent, since (θ1 ) + . . . + (θD−3 )2 = 1.\n3\n\n13\n\n\fin the longitudinal coordinate. This means that H+ (r, θ) = H− (r, θ) ≡ H(r, θ), and we have\nthat the symmetry conditions (3.10) imply that\n∂θ H(r, 0) = ∂θ H(r, π) = 0.\n\n(3.12)\n\nThe numerical solution of the problem at hand is complicated by the fact that the function\nG(θ) to be determined appears in the boundary conditions of the differential equation. Because of this we would like to make a change of coordinates that transforms the complicated\nintegration region into a simpler one. Following [12], we define the new dimensionless radial\ncoordinate ρ by\nr = LG(θ)ρ.\n\n(3.13)\n\nNow, in terms of this new variable Eq. (3.7) reads\n(\"\n\" \u0012 \u0013\n\u0012 0 \u00132 #\n\u0012 \u0013\n2\n0\n1\nG\n2\nG\nG0\nG00 D − 4 G0\n1\n2\n2 2\n2\n∂ρ ∂θ +\n−\n1+G ρ +\n∂ρ + 2 ∂θ −\n2\n−\nG\nρ\nρG\nρ\nG\nG\ntan θ G\n\u001b\n(3.14)\nD−4\n2\n∂θ − (D − 2)G H(ρ, θ) = 0.\n+ (D − 3) + (D − 2)G ρ ∂ρ + 2\nρ tan θ\n2 2\n\n\u0003\n\nWith this we are left with a boundary problem in the half-circle ρ = 1 with 0 ≤ θ ≤ π, whereas\nthe function G(θ) defining the boundary in the original coordinates (r, θ) appears now in the\nequation. The boundary conditions on the lower and upper boundaries of the upper half-circle\nare respectively\n∂θ H(ρ, 0) = ∂θ H(ρ, π) = 0,\n\n\u0011\nd \u0010\n∂θ H(ρ = 1, θ) = Φ r = LG(θ), θ .\ndθ\n\n(3.15)\n\nThis means that we have von Neumann boundary conditions on the lower boundary and Dirichlet condition on the upper one. To derive the last equation in (3.15) we have used that the\nfunction defining the trapped surface vanishes on C, Ψ(ρ = 1, θ) = 0, and as a consequence\n∂θ Ψ(ρ = 1, θ) = 0. This equation actually simplifies the additional condition (3.11)\n\u0014\n\u0015h\ni2\nG0 (θ)2\n2\ne θ) = 4G(θ)2 .\n1+\n+\nG(θ)\n∂\nΨ(1,\nρ\nG(θ)2\n\n(3.16)\n\nIn order to implement the numerical algorithm it is convenient to introduce the dimensionless\ne θ) ≡ 1 Ψ(ρ, θ), Φ(ρ,\ne θ) ≡ 1 Φ(ρ, θ) and H(ρ,\ne θ) ≡ 1 H(ρ, θ).\nfunctions Ψ(ρ,\nL\nL\nL\n14\n\n\fY D-2 \u0090 L\n\nY D-2 \u0090 L\n\nY D-2 \u0090 L\n1.0\n\n1.0\n1.5\n\n0.5\n\n1.0\n\n0.5\n\n0.5\n\nô\n\n0.0\n\nòì à ae à ìò\n\nô\n\nôò ì\n\n0.0\n\nY 1\u0090 L\n\nà\n\nae\n\nà\n\nì òô\n\nY 1\u0090 L\n\nôò ì\n\n0.0\n\nà\n\nae\n\nà\n\nì òô\n\nY 1\u0090 L\n\n-0.5\n\n-0.5\n-0.5\n\n-1.0\n\n-1.5\n\n-1.0\n-1.5\n\n-1.0\n\n-0.5\n\n0.0\n\n0.5\n\n1.0\n\n-1.0\n\n1.5\n\n0.0\n\n-0.5\n\n0.5\n\n-1.0\n-1.0\n\n1.0\n\nY D-2 \u0090 L\n\n0.5\n\n0.0\n\n0.0\n\n-0.5\n\n0.5\n\n1.0\n\nY D-2 \u0090 L\n\n0.5\n\nôò ì\n\nà\n\nae\n\nà\n\nì òô\n\nY 1\u0090 L\n\n0.0\n\n-0.5\n\nôò ì\n\nà\n\nae\n\nà\n\nì òô\n\nY 1\u0090 L\n\n-0.5\n\n-0.5\n\n0.0\n\n-0.5\n\n0.5\n\n0.0\n\n0.5\n\nFigure 3: Numerical solutions for the shape of the section of the surface C on the plane Y 1 -Y D−2\nin hyperbolic coordinates for D = 4, 5, 6, 7 and 8 for various values of the impact parameter\nD−3\nb and μ = LGN . From the outer inwards the curves correspond to Lb = 0 (•), Lb = 0.2 (\u0004),\nb\n= 0.4 (\u0007), Lb = 0.5 (N) and the critical value bLc (H). The symbols indicate the position of the\nL\nincoming sources.\nWe can now attack the numerical solution of the boundary problem (3.14), (3.15) subjected\nto the additional condition (3.16). We follow the procedure used by the authors of [12] and\nchoose a trial function G1 (θ) to solve the boundary problem (3.14), (3.15) using a method\ne 1 (ρ, θ) in terms of which we compute Ψ\ne 1 (ρ, θ) =\nof finite differences. This gives a solution H\ne θ) − H\ne 1 (ρ, θ). In the extremely unlikely case in which G1 (θ) were the solution of the\nΦ(ρ,\nproblem the function\n\"\n\n\u0012\n\nT1 (θ) ≡ 1 +\n\nG0\nG\n\n\u00132\n\n#\n+ G2\n\nh\ni2\ne 1 (1, θ) − 4G2\n∂ρ Ψ\n\n(3.17)\n\nwould vanish. However, since this is not going to be the case we introduce a new trial function\nG2 (θ) = G1 (θ) + \u000f T1 (θ),\n\n(3.18)\n\nwith \u000f > 0 a small number, and solve again the boundary problem (3.14), (3.15) obtaining a\ne 2 (ρ, θ) and Ψ\ne 2 (ρ, θ). Computing now T2 (θ) as in Eq. (3.17) and iterating the\nsecond function H\n15\n\n\falgorithm a sufficient number of times a numerical solution to the problem can be found with\nthe required precision.\nWe have used the procedure described above to find the solutions to the trapped surface\nequation in AdSD with D = 4, 5, 6, 7 and 8. We have solved the boundary problem using a\nfinite difference method with a grid of 50 points in the angular coordinate and 100 points in\nthe radial one. With \u000f = 10−4 we find good convergence to the solution. In order to handle\nthe coordinate singularity at r = 0 we have imposed the von Neumann boundary condition\n∂n H = 0 at this point.\nOur numerical analysis shows the existence in all cases of a critical value of the impact\nparameter above which no solution to the marginally closed trapped surface equation is found.\nThis is qualitatively similar to the corresponding situation in flat space [12] as well as in AdS5\n[10]. In Fig. 3 we plot the section of the trapped surface on the Y 1 -Y D−2 plane for a symmetric\nD−3\ncollision in D = 4, 5, 6, 7 and 8 with energy μ = G−1\n. For AdS5 our numerical solutions\nN L\n\nare in perfect agreement with the results found by the authors of [10] using a different numerical\nmethod.\nOn the left panel of Fig. 4, on the other hand, the values of the critical impact parameter\nas a function of the energy are shown for different dimensions. As can be seen in the right\npanel of Fig. 4, the results are very well fitted by the following scaling of the critical impact\nparameter with the energy of the incoming waves\nbc\n∼\nL\n\n\u0012\n\nGN μ\nLD−3\n\n1\n\u0013 D−2\n\n,\n\n(3.19)\n\nwhere the proportionality constant is of order one. One consequence of this scaling is that the\ndependence of the critical impact parameter with the energy, measured in units of the AdSD\nD−3 −1\nenergy LD−3 G−1\nGN\nN , flattens as the dimension increases. In the limit D → ∞ (with L\n\nfixed) this seems to implicate that the critical impact parameter is constant with the energy.\nIn all our previous analysis we have focused our attention on physical situations where the\nenergy of the incoming waves are larger or of the order of the AdS energy scale. This means\nthat the physics is sensitive to the large-scale geometry of AdS. Flat space is retrieved by taking\nL → ∞ with the energy and impact parameter of the collision fixed. Since in this limit the\nenergy is very small compared with the AdS natural energy scale, the flat space behavior of\nthe critical impact parameter with the energy has to be recovered in the plots of Fig. 4 in\n16\n\n\fbc\n\nbc\n\nL\n\nL\n\n5\n\n5\n\n4\n\n4\n\n3\n\n3\n\n2\n\n2\n\n1\n\n1\nGN Μ\n0\n\n2\n\n4\n\n6\n\n8\n\nGN Μ\n0\n\nLD-3\n\n2\n\n4\n\n6\n\n8\n\n10\n\nLD-3\n\n−\nNμ\n≡ b+ −b\nas a function of LGD−3\nfor the\nL\nsymmetric collision of two shock waves with sources located at z = L. The curves correspond, from top to\nbottom, to D = 4, 5, 6, 7 and 8. On the right panel the same points are shown together with a fit to a function\nwith the scaling of Eq. (3.19).\n\nFigure 4: In the left panel we plot the critical impact parameter\n\nbc\nL\n\nthe region around the origin. On dimensional grounds, the scaling between the critical impact\nparameter and the energy for gravitational shock waves collision in flat space has to be of the\n1\n\nform bc ∼ (GN μ) D−3 . A crossover between (3.19) and this scaling should take place as the\nenergy of the collision is much smaller than the AdS energy scale.\nTo compare our results with the analytical study of the formation of trapped surfaces in\nthe collision of shock waves in AdS5 with nonvanishing impact parameter carried out in [8],\nwe notice that the authors of this reference work in the limit where the energy of the collision\nsatisfies\n\u0012\n\nGN μ\nLD−3\n\n1\n\u0013 D−2\n\n\u001d 1,\n\n(3.20)\n\nwhile keeping fixed the size of the impact parameter. Because of the scaling (3.19) the results\nof [8] are in the regime where the impact parameter is always much smaller than the critical\nvalue and, as a consequence, a marginally closed trapped surface always forms.\n\n4\n\nDiscussion\n\nHaving obtained the numerical solution for the collision of two shock waves with \"spatial\"\nimpact parameter we can apply the transformations described in the previous section to get\nsolutions of the closed trapped surface equation for the collision of two waves with \"holographic\"\nimpact parameter. On the left panel of Fig. 5 we have plotted, for various values of the spatial\n17\n\n\fz' \u0090 L\n\nz\u0090L\n\n2.5\n\n2.5\n\n2.0\n\n2.0\n\n1.5\n\n1.5\n\nô\nò\nì\n\nô\n\nò\n\nì\n\nà\n\n1.0ae\n\nà\n\nì\n\nà\n1.0ae\n\nò\n\nà\nì\nò\nô\n\nô\n\n0.5\n\n-1.0\n\n-0.5\n\n0.5\n\n0.5\n\n1.0\n\nx'\u0090 L\n\n-1.0\n\n-0.5\n\n0.5\n\n1.0\n\nx\u0090L\n\nFigure 5: In the left panel we plot the section of the closed trapped surfaces in Poincaré coordinates (x0 , z 0 )\nshown in Eqs. (2.9) and (2.26). The curves, from outer inwards, correspond to the following values of the\nimpact parameter: Lb = 0 (•), Lb = 0.3 (\u0004), Lb = 0.6 (\u0007), Lb = 0.8 (N) and the critical value bLc (H). On the\nright panel we see the sections of the closed trapped surfaces after inverting the rotations (2.9) back to the\ncoordinates (x, z). In both plots the horizontal axis representes the boundary of H3 .\n\nimpact parameter, the section of the marginally trapped surface for a symmetric collision in\nAdS5 of two waves with energies μ± = GN L−2 . Unlike the plots shown in Fig. 3 here we have\nused the Poincaré coordinates (x0 , z 0 ) defined in Eq. (2.20). Hence, in this plot the boundary\nof AdS5 is located along the horizontal axis. On the right panel of Fig. 5, on the other hand,\nwe see the section of the trapped surfaces previous to the O(2) rotation of angle\n\nπ\n2\n\ndescribed\n\nin Section 2. Now the sources lie in the z axis and therefore the contours show the section\nof the trapped surface formed as a result of a collision of two waves with holographic impact\nparameter. The innermost curve represents the surface corresponding to the critical value of\nthe impact parameter, above which no marginally closed trapped surface of the type studied\nhere exits.\nThe conclusion is the existence of a maximum value of the holographic impact parameter\nfor the formation of this class of trapped surfaces. Taking this fact at face value, one could be\ntempted to interpret it holographically as signaling a threshold for the formation of a thermal\nCFT plasma. Thus, thermalization would not take place when the size difference between the\ntwo colliding energy lumps is larger than the critical value. This would actually make sense\non physical grounds: if one of the colliding lumps is much smaller than the other it might not\n\n18\n\n\fhave enough degrees of freedom to induce a thermal state in the whole system as a result of the\ncollision. One should be reminded, however, that the non existence of a closed trapped surface\nof the type studied above does not rule out the possibility of other trapped surfaces being\nformed in the process. Therefore, in order to decide whether a threshold for thermalization\nexists as a function of the difference in size of the colliding objects one would need to solve for\nthe geometry of the interaction region of Fig. 1. This problem, together with other issues such\nas the thermalization time for subcritical collisions, will be addressed elsewhere.\nIn the dual conformal field theory, the O(2) transformation that maps a collision of two\nequal objects with impact parameter into the head-on collision of two lumps of different size is\na combination of a translation and a special conformal transformation in one of the transverse\ncoordinates, inherited from the AdSD bulk transformation (2.10). Interestingly, this relates\na physical process with nonvanishing angular momentum to another one where the angular\nmomentum is zero. In the gravitational dual, on the other hand, the combination [see Eqs.\n(2.14) and (2.17)]\nQ± =\n\nμ0± (θ)L\n\n\u0014\n\nz 0 (θ)2 + b0± (θ) 2\n1+ ±\nL2\n\n\u0015\n(4.1)\n\nis independent of the angle θ and therefore invariant under the O(2) rotation. Holographically,\nthis relates the impact parameter, the size of the lumps and their energies. A second invariant\ncan be also constructed as\n0\n0\nQ(θ) = μ0+ (θ)μ0− (θ)z+\n(θ)z−\n(θ)\n\n(4.2)\n\nthat mixes the energies of the colliding objects with their sizes.\nIn D = 5 the collision of two gauge theory energy lumps with large size difference could be\nused as a model for hadron-nucleus collisions at strong coupling. Here we have considered the\ncase of head-on scattering. Collisions of unequal objects with a nonvanishing impact parameters\ncan be studied as well by performing O(2) rotations on the numerical solutions obtained in the\nprevious section with an angle |θ| < π2 . It would be interesting to see if the invariants (4.1) and\n(4.2) have any relevance in the phenomenological description of this type of collisions.\n\nAcknowledgments\nWe thank Luis Álvarez-Gaumé, Roberto Emparan, Kerstin E. Kunze and Agustı́n Sabio Vera for\ndiscussions. A.D.-V. acknowledges support from a Castilla y León Regional Government predoc19\n\n\ftoral fellowship and Spanish Government Grant FIS2009-07238. M.A.V.-M. has been partially\nsupported by Spanish Government Grants FPA2009-10612 and FIS2009-07238, Basque Government Grant IT-357-07 and Spanish Consolider-Ingenio 2010 Programme CPAN (CSD200700042).\n\nAppendix\nIn this Appendix we give some details on the change of coordinates that have to be used to\neliminate the delta-function terms in the metric of the shock wave and therefore to make the\ncongruence of null geodesics continuous across the wave fronts u = 0, v = 0. Let us begin with\nthe metric (1.1) now written in the form\ni\nL2 h\nds2+ = 2 dz 2 − dudv + d~x 2 + φ+ (z, ~x)δ(u)du2 .\nz\n~ defined by\nand introduce the new coordinates (U, V, Z, X)\n\n(A.3)\n\nu = U,\nh\ni2 1\nh\ni2\n1\n~ + (Z, X)\n~\n~\n~\nv = V + φ+ (Z, X)θ(U\n) + U θ(U ) ∇φ\n+ U θ(U ) ∂Z φ+ (Z, X)\n,\n4\n4\n1\n~\nz = Z + U θ(U )∂Z φ+ (Z, X),\n2\n~ + 1 U θ(U )∇φ\n~ + (Z, X).\n~\n~x = X\n2\n\n(A.4)\n\nThe presence of the step function θ(U ) in the change of coordinates is necessary in order\nto eliminate the delta-function terms in the metric, responsible for the discontinuity of the\ngeodesics. After a long but simple calculation we find that the metric (A.3) for the first wave\ntakes the form\n(+)\n\nds2+\n\n(+)\n\n−dU dV + Hab Hbc dX a dX c\n=\n,\nh\ni2\nZ + 12 U θ(U )∂Z φ+\n\n(A.5)\n\nwith\n1\n(+)\n~\nHab = δab + U θ(U )∂a ∂b φ+ (Z, X).\n(A.6)\n2\n~\nThe indices a, b, c run over all the spatial coordinates (Z, X).\nThe line element (A.5) is the\nAdS analog of the so-called Rosen form of a plane wave in flat space-time, whereas the metric\n(A.3) we started with is the Brinkmann form of the wave.\n20\n\n\fThe analysis can be repeated for the second wave, whose metric can be obtained from\nEq. (A.3) by changing u → v and φ+ (z, ~x) → φ− (z, ~x). Implementing then the change of\n~ → φ− (Z, X)\n~ we arrive\ncoordinates (A.4) with the replacements U → V , u → v and φ+ (Z, X)\nat the metric\n(−)\n\nds2− =\n\n(−)\n\n−dU dV + Hab Hbc dX a dX c\n,\nh\ni2\n1\nZ + 2 V θ(V )∂Z φ2\n\n(A.7)\n\n(−)\n\nwhere now the metric function Hab is given by\n1\n(−)\n~\nHab = δab + V θ(V )∂a ∂b φ2 (Z, X).\n2\n\n(A.8)\n\nIt is important to notice that the metric elements (A.5) and (A.7) coincide in the lower wedge\nU < 0, V < 0 where the line element of AdSD is recovered. Hence, the metric in the whole\nregion outside the interaction wedge U > 0, V > 0 can be written as\ni\nh\n(+) (+)\n(−) (−)\n−dU dV + Hab Hbc + Hab Hbc − δab dX a dX c\nds2 =\n.\ni2\nh\n1\n1\nZ + 2 U θ(U )∂Z φ+ + 2 V θ(V )∂Z φ−\n\n(A.9)\n\nThe next step is to write the Einstein equations in the new coordinates. This task, however,\nis simplified by noticing that for the line element of the first wave (A.3) the only nonvanishing\ncomponent of both Gμν + Λgμν and Tμν is the u-u component. Since U = u we find again that\n~ is given by GU U + ΛgU U = 8πGN TU U and after a bit of algebra Eq.\nthe equation for φ+ (Z, X)\n(2.4) is recovered in the new coordinates (the same argument applies to the second wave with\nthe replacement U → V )\n\u0012\n\u0013\n\u0012 \u0013D−1\nD−2\n~ = −16πGN μ± Z±\n~ − ~b± ), (A.10)\n\u0003HD−2 −\nΦ± (Z, X)\nδ(Z − z± )δ (D−3) (X\n2\nL\nL\n~ =\nwhere Φ± (Z, X)\n\nL\n~\nφ (Z, X).\nZ ±\n\nIn fact, the reason behind obtaining the same equations in\n~ is trivial in the transverse space\nboth coordinate systems is that the change (z, ~x) → (Z, X)\nHD−2 . This can seen inmediately by setting U = 0 in (A.4), and respectively V = 0 in the\ncorresponding change of coordinates for the second wave.\n\nReferences\n[1] D. Mateos, String Theory and Quantum Chromodynamics, Class. Quant. Grav. 24 (2007)\nS713 [arXiv:0709.1523 [hep-th]].\n21\n\n\fU. A. Wiedemann, What can be the role of AdS/CFT in the phenomenology of heavy ion\ncollisions?, Nucl. Phys. A805 (2008) 274.\nE. Shuryak, Physics of Strongly coupled Quark-Gluon Plasma, Prog. Part. Nucl. Phys. 62\n(2009) 48 [arXiv:0807.3033 [hep-ph]]; Four lectures on strongly coupled Quark Gluon\nPlasma, Nucl. Phys. Proc. Suppl. 195 (2009) 111.\nR. A. Janik, The dynamics of quark-gluon plasma and AdS/CFT, arXiv:1003.3291\n[hep-th].\n[2] G. Policastro, D. T. Son and A. O. Starinets, The shear viscosity of strongly coupled N = 4 supersymmetric Yang-Mills plasma, Phys. Rev. Lett. 87 (2001) 081601\n[arXiv:hep-th/0104066].\nH. Liu, K. Rajagopal and U. A. Wiedemann, Calculating the jet quenching parameter from\nAdS/CFT, Phys. Rev. Lett. 97 (2006) 182301 [arXiv:hep-ph/0605178].\nH. Liu, K. Rajagopal and U. A. Wiedemann, An AdS/CFT calculation of screening in a\nhot wind, Phys. Rev. Lett. 98 (2007) 182301 [arXiv:hep-ph/0607062].\nJ. Casalderrey-Solana and D. Teaney, Heavy quark diffusion in strongly coupled N = 4\nYang Mills, Phys. Rev. D74 (2006) 085012 [arXiv:hep-ph/0605199].\nS. S. Gubser, D. R. Gulotta, S. S. Pufu and F. D. Rocha, Gluon energy loss in the gaugestring duality, J. High Energy Phys. 10 (2008) 052 [arXiv:0803.1470 [hep-th]].\nY. Hatta, E. Iancu and A. H. Mueller, Jet evolution in the N = 4 SYM plasma at strong\ncoupling, J. High Energy Phys. 05 (2008) 037 [arXiv:0803.2481 [hep-th]].\n[3] R. A. Janik and R. B. Peschanski, Asymptotic perfect fluid dynamics as a consequence of\nAdS/CFT, Phys. Rev. D73 (2006) 045013 [arXiv:hep-th/0512162].\n[4] S. S. Gubser, S. S. Pufu and A. Yarom, Entropy production in collisions of gravitational shock waves and of heavy ions, Phys. Rev. D78 (2008) 066014 [arXiv:0805.1551\n[hep-th]].\n[5] S. S. Gubser, Using string theory to study the quark-gluon plasma: progress and perils,\nNucl. Phys. A830 (2009) 657C [arXiv:0907.4808 [hep-th]].\n[6] G. Beuf, Gravity dual of N = 4 SYM theory with fast moving sources, Phys. Lett. B686\n(2010) 55 [arXiv:0903.1047 [hep-th]].\n22\n\n\fJ. L. Albacete, Y. V. Kovchegov and A. Taliotis, Asymmetric Collision of Two Shock\nWaves in AdS5 , J. High Energy Phys. 05 (2009) 060 [arXiv:0902.3046 [hep-th]].\nH. U. Yee, Parity asymmetric boost invariant plasma in AdS/CFT correspondence, Phys.\nLett. B680 (2009) 286 [arXiv:0906.2192 [hep-th]].\nP. M. Chesler and L. G. Yaffe, Boost invariant flow, black hole formation, and far-fromequilibrium dynamics in N = 4 supersymmetric Yang-Mills theory, arXiv:0906.4426\n[hep-th].\nE. Avsar, E. Iancu, L. McLerran and D. N. Triantafyllopoulos, Shockwaves and deep inelastic scattering within the gauge/gravity duality, J. High Energy Phys. 11 (2009) 105\n[arXiv:0907.4604 [hep-th]].\nI. Y. Aref'eva, A. A. Bagrov and L. V. Joukovskaya, Critical Trapped Surfaces Formation\nin the Collision of Ultrarelativistic Charges in (A)dS, J. High Energy Phys. 03 (2010) 002\n[arXiv:0909.1294 [hep-th]].\nY. V. Kovchegov and S. Lin, Toward Thermalization in Heavy Ion Collisions at Strong\nCoupling, J. High Energy Phys. 03 (2010) 057 [arXiv:0911.4707 [hep-th]].\n[7] D. Grumiller and P. Romatschke, On the collision of two shock waves in AdS5 , J. High\nEnergy Phys. 08 (2008) 027 [arXiv:0803.3226 [hep-th]].\n[8] S. S. Gubser, S. S. Pufu and A. Yarom, Off-center collisions in AdS5 with applications\nto multiplicity estimates in heavy-ion collisions, J. High Energy Phys. 11 (2009) 050\n[arXiv:0902.4062 [hep-th]].\n[9] V. Balasubramanian and P. Kraus, A stress tensor for anti-de Sitter gravity, Commun.\nMath. Phys. 208 (1999) 413 [arXiv:hep-th/9902121].\nS. de Haro, S. N. Solodukhin and K. Skenderis, Holographic reconstruction of spacetime\nand renormalization in the AdS/CFT correspondence, Commun. Math. Phys. 217 (2001)\n595 [arXiv:hep-th/0002230].\n[10] S. Lin and E. Shuryak, Grazing Collisions of Gravitational Shock Waves and Entropy\nProduction in Heavy Ion Collision, Phys. Rev. D79 (2009) 124015 [arXiv:0902.1508\n[hep-th]].\n\n23\n\n\f[11] R. Penrose, seminar at Cambridge University, 1974 (unpublished).\nP. D. D'Eath and P. N. Payne, Gravitational radiation in high speed black hole collisions. 1.\nPerturbation treatment of the axisymmetric speed of light collision, Phys. Rev. D46 (1992)\n658.\nP. D. D'Eath and P. N. Payne, Gravitational radiation in high speed black hole collisions. 2.\nReduction to two independent variables and calculation of the second order news function,\nPhys. Rev. D46 (1992) 675.\nP. D. D'Eath and P. N. Payne, Gravitational radiation in high speed black hole collisions.\n3. Results and conclusions, Phys. Rev. D46 (1992) 694.\nD. M. Eardley and S. B. Giddings, Classical black hole production in high-energy collisions,\nPhys. Rev. D66 (2002) 044011 [arXiv:gr-qc/0201034].\nE. Kohlprath and G. Veneziano, Black holes from high-energy beam-beam collisions, J.\nHigh Energy Phys 06 (2002) 057 [arXiv:gr-qc/0203093].\n[12] H. Yoshino and Y. Nambu, High-energy head-on collisions of particles and hoop conjecture,\nPhys. Rev. D66 (2002) 065004 [arXiv:gr-qc/0204060].\n[13] H. Yoshino and V. S. Rychkov, Improved analysis of black hole formation in high-energy\nparticle collisions, Phys. Rev. D71 (2005) 104028 [arXiv:hep-th/0503171].\n[14] L. Álvarez-Gaumé, C. Gómez, A. Sabio Vera, A. Tavanfar and M. A. Vázquez-Mozo,\nCritical formation of trapped surfaces in the collision of gravitational shock waves, J. High\nEnergy Phys. 02 (2009) 009 [arXiv:0811.3969 [hep-th]].\n\n24\n\n\f"}