{"id": "http://arxiv.org/abs/1202.5898v3", "guidislink": true, "updated": "2013-04-01T08:03:26Z", "updated_parsed": [2013, 4, 1, 8, 3, 26, 0, 91, 0], "published": "2012-02-27T11:40:31Z", "published_parsed": [2012, 2, 27, 11, 40, 31, 0, 58, 0], "title": "Superspin Glass Mediated Giant Spontaneous Exchange Bias in a\n  Nanocomposite of BiFeO$_3$-Bi$_2$Fe$_4$O$_9$", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1202.3330%2C1202.6673%2C1202.2310%2C1202.4001%2C1202.5114%2C1202.5178%2C1202.5950%2C1202.4584%2C1202.2764%2C1202.3145%2C1202.2866%2C1202.5898%2C1202.4662%2C1202.2836%2C1202.4867%2C1202.3992%2C1202.5515%2C1202.5451%2C1202.4735%2C1202.6589%2C1202.6080%2C1202.2814%2C1202.4632%2C1202.6177%2C1202.0857%2C1202.4114%2C1202.2044%2C1202.6060%2C1202.2923%2C1202.4944%2C1202.0066%2C1202.1009%2C1202.2075%2C1202.1244%2C1202.5789%2C1202.1277%2C1202.2919%2C1202.4687%2C1202.3173%2C1202.5060%2C1202.4963%2C1202.1075%2C1202.4920%2C1202.6669%2C1202.5909%2C1202.6406%2C1202.3382%2C1202.0432%2C1202.2454%2C1202.4767%2C1202.6329%2C1202.6305%2C1202.3911%2C1202.2613%2C1202.2970%2C1202.2944%2C1202.0727%2C1202.3439%2C1202.0304%2C1202.5499%2C1202.2355%2C1202.5915%2C1202.3855%2C1202.5067%2C1202.1430%2C1202.4863%2C1202.1089%2C1202.3054%2C1202.6182%2C1202.2515%2C1202.6384%2C1202.2365%2C1202.3301%2C1202.4845%2C1202.1833%2C1202.6188%2C1202.2612%2C1202.4897%2C1202.5812%2C1202.4885%2C1202.1116%2C1202.6098%2C1202.1389%2C1202.5569%2C1202.0708%2C1202.1835%2C1202.6033%2C1202.5547%2C1202.5474%2C1202.3675%2C1202.1334%2C1202.3219%2C1202.2981%2C1202.0797%2C1202.3825%2C1202.3518%2C1202.1039%2C1202.2371%2C1202.0728%2C1202.6664%2C1202.5175&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Superspin Glass Mediated Giant Spontaneous Exchange Bias in a\n  Nanocomposite of BiFeO$_3$-Bi$_2$Fe$_4$O$_9$"}, "summary": "We observe an enormous $\\textit{spontaneous}$ exchange bias ($\\sim$300-600\nOe) - measured in an unmagnetized state following zero-field cooling - in a\nnanocomposite of BiFeO$_3$ ($\\sim$94%)-Bi$_2$Fe$_4$O$_9$ ($\\sim$6%) over a\ntemperature range 5-300 K. Depending on the path followed in tracing the\nhysteresis loop - positive (p) or negative (n) - as well as the maximum field\napplied, the exchange bias ($H_E$) varies significantly with $\\mid-H_{Ep}\\mid$\n$>$ $\\mid H_{En}\\mid$. The temperature dependence of $H_E$ is nonmonotonic. It\nincreases, initially, till $\\sim$150 K and then decreases as the blocking\ntemperature $T_B$ is approched. All these rich features appear to be\noriginating from the spontaneous symmetry breaking and consequent onset of\nunidirectional anisotropy driven by \"superinteraction bias coupling\" between\nferromagnetic core of Bi$_2$Fe$_4$O$_9$ (of average size $\\sim$19 nm) and\ncanted antiferromagnetic structure of BiFeO$_3$ (of average size $\\sim$112 nm)\nvia superspin glass moments at the shell.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1202.3330%2C1202.6673%2C1202.2310%2C1202.4001%2C1202.5114%2C1202.5178%2C1202.5950%2C1202.4584%2C1202.2764%2C1202.3145%2C1202.2866%2C1202.5898%2C1202.4662%2C1202.2836%2C1202.4867%2C1202.3992%2C1202.5515%2C1202.5451%2C1202.4735%2C1202.6589%2C1202.6080%2C1202.2814%2C1202.4632%2C1202.6177%2C1202.0857%2C1202.4114%2C1202.2044%2C1202.6060%2C1202.2923%2C1202.4944%2C1202.0066%2C1202.1009%2C1202.2075%2C1202.1244%2C1202.5789%2C1202.1277%2C1202.2919%2C1202.4687%2C1202.3173%2C1202.5060%2C1202.4963%2C1202.1075%2C1202.4920%2C1202.6669%2C1202.5909%2C1202.6406%2C1202.3382%2C1202.0432%2C1202.2454%2C1202.4767%2C1202.6329%2C1202.6305%2C1202.3911%2C1202.2613%2C1202.2970%2C1202.2944%2C1202.0727%2C1202.3439%2C1202.0304%2C1202.5499%2C1202.2355%2C1202.5915%2C1202.3855%2C1202.5067%2C1202.1430%2C1202.4863%2C1202.1089%2C1202.3054%2C1202.6182%2C1202.2515%2C1202.6384%2C1202.2365%2C1202.3301%2C1202.4845%2C1202.1833%2C1202.6188%2C1202.2612%2C1202.4897%2C1202.5812%2C1202.4885%2C1202.1116%2C1202.6098%2C1202.1389%2C1202.5569%2C1202.0708%2C1202.1835%2C1202.6033%2C1202.5547%2C1202.5474%2C1202.3675%2C1202.1334%2C1202.3219%2C1202.2981%2C1202.0797%2C1202.3825%2C1202.3518%2C1202.1039%2C1202.2371%2C1202.0728%2C1202.6664%2C1202.5175&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We observe an enormous $\\textit{spontaneous}$ exchange bias ($\\sim$300-600\nOe) - measured in an unmagnetized state following zero-field cooling - in a\nnanocomposite of BiFeO$_3$ ($\\sim$94%)-Bi$_2$Fe$_4$O$_9$ ($\\sim$6%) over a\ntemperature range 5-300 K. Depending on the path followed in tracing the\nhysteresis loop - positive (p) or negative (n) - as well as the maximum field\napplied, the exchange bias ($H_E$) varies significantly with $\\mid-H_{Ep}\\mid$\n$>$ $\\mid H_{En}\\mid$. The temperature dependence of $H_E$ is nonmonotonic. It\nincreases, initially, till $\\sim$150 K and then decreases as the blocking\ntemperature $T_B$ is approched. All these rich features appear to be\noriginating from the spontaneous symmetry breaking and consequent onset of\nunidirectional anisotropy driven by \"superinteraction bias coupling\" between\nferromagnetic core of Bi$_2$Fe$_4$O$_9$ (of average size $\\sim$19 nm) and\ncanted antiferromagnetic structure of BiFeO$_3$ (of average size $\\sim$112 nm)\nvia superspin glass moments at the shell."}, "authors": ["Tuhin Maity", "Sudipta Goswami", "Dipten Bhattacharya", "Saibal Roy"], "author_detail": {"name": "Saibal Roy"}, "author": "Saibal Roy", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.110.107201", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1202.5898v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1202.5898v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "5 pages with 4 figures; published in Phys. Rev. Lett", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1202.5898v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1202.5898v3", "journal_reference": "Phys. Rev. Lett. 110, 107201 (2013)", "doi": "10.1103/PhysRevLett.110.107201", "fulltext": "Superspin Glass Mediated Giant Spontaneous Exchange Bias in a Nanocomposite of\nBiFeO3 -Bi2 Fe4 O9\nTuhin Maity,1 Sudipta Goswami,2 Dipten Bhattacharya,2, ∗ and Saibal Roy1, †\n1\n\narXiv:1202.5898v3 [cond-mat.mtrl-sci] 1 Apr 2013\n\nMicropower-Nanomagnetics Group, Microsystems Center, Tyndall National Institute,\nUniversity College Cork, Lee Maltings, Dyke Parade, Cork, Ireland\n2\nNanostructured Materials Division, CSIR-Central Glass and Ceramic Research Institute, Kolkata 700032, India\n(Dated: October 30, 2018)\nWe observe an enormous spontaneous exchange bias (∼300-600 Oe) - measured in an unmagnetized\nstate following zero-field cooling - in a nanocomposite of BiFeO3 (∼94%)-Bi2 Fe4 O9 (∼6%) over a\ntemperature range 5-300 K. Depending on the path followed in tracing the hysteresis loop - positive\n(p) or negative (n) - as well as the maximum field applied, the exchange bias (HE ) varies significantly\nwith | −HEp | > | HEn |. The temperature dependence of HE is nonmonotonic. It increases,\ninitially, till ∼150 K and then decreases as the blocking temperature TB is approched. All these rich\nfeatures appear to be originating from the spontaneous symmetry breaking and consequent onset of\nunidirectional anisotropy driven by \"superinteraction bias coupling\" between ferromagnetic core of\nBi2 Fe4 O9 (of average size ∼19 nm) and canted antiferromagnetic structure of BiFeO3 (of average\nsize ∼112 nm) via superspin glass moments at the shell.\nPACS numbers: 75.70.Cn, 75.75.-c\n\nThe spontaneous exchange bias (SEB), where the unidirectional anisotropy (UA) sets in spontaneously under the application of the first field of a hysteresis loop\neven in an unmagnetized state, is a consequence, primarily, of biaxial symmetry in the antiferromagnetic (AFM)\nstructure of ferromagnetic (FM)/AFM interface [1–3].\nIn a spin glass (SG)/FM structure, on the other hand,\nthe anisotropy sets in under field cooling via oscillatory\nRKKY interaction [4]. However, we show in this Letter\nthat glassy moments at the interface, in fact, introduce\nan additional magnetic degree of freedom in between the\nexchange-coupled FM and AFM grains and breaks the\nsymmetry truly spontaneously even before the application of the first field of a loop to set the UA in an unmagnetized state. As discussed later, the consequence of this\nis an asymmetry in the SEB depending on the path followed in tracing the hysteresis loop - positive or negative.\nWe report that in a nanocomposite of BiFeO3 (∼94%)Bi2 Fe4 O9 (∼6%), we observe (i) a large SEB (∼300-600\nOe) across 5-300 K, (ii) asymmetry in SEB depending\non the path followed in tracing the hysteresis loop - positive or negative, and (iii) a nonmonotonic variation of\nSEB with temperature. The magnitude of the SEB itself is far higher than what has so far been observed in\nall the bulk or thin film based composites of BiFeO3\n[5–10] even under magnetic annealing. We have also\nobserved the conventional magnetic-annealing-dependent\nexchange bias (CEB) with all its regular features such as\ndependence on annealing field, rate, and training. The\nrandom field generated by the glassy moments at the shell\nappears to be influencing the indirect exchange bias coupling called \"superinteraction bias coupling\" between FM\ncore [11] of finer (∼19 nm) Bi2 Fe4 O9 and local moments\nof AFM order in coarser BiFeO3 (∼112 nm) and inducing\nthe SEB, its path dependence, and its nonmonotonicity\n\nin variation with temperature.\nThe nanocomposite of BiFeO3 -Bi2 Fe4 O9 has been synthesized by the sonochemical route [12]. By varying\nthe processing conditions such as temperature, time,\natmosphere, etc., the volume fraction of the Bi2 Fe4 O9\nphase has been varied from ≤3% to ∼10%. The volume\nfraction of the phases, crystallographic details of each\nphase, particle morphology, average misalignment angle\nbetween two single crystalline nanoparticles of the component phases, etc., have been determined from rigorous\nx-ray diffraction, transmission electron microscopy, selected area and convergent beam electron diffraction experiments [13]. The magnetic measurements have been\ncarried out in a SQUID magnetometer (MPMS, Quantum Design) across 5-300 K under a maximum field Hm\nof 50 kOe. In order to ensure that there is no trapped\nflux both in the superconducting coil of MPMS and in\nthe sample we followed a well-designed protocol to demagnetize them. The superconducting coils of MPMS\nare normally discharged from high field (50 kOe) in oscillation mode; the amount of trapped flux is typically ∼10\nOe. Before starting a new batch of experiment, the magnet was warmed to room temperature which is above the\ncritical point. In addition, prior to each measurement,\nthe sample itself was demagnetized with oscillating field\nusing an appropriate protocol (given in the Supplemental\nMaterial[13]) in order to ensure that there is no trapped\nflux in the sample. The details of the protocol as well as\nthe results of measurement on diamagnetic sample (sapphire) have been given in the Supplemental Material [13].\nWe have also measured the SEB at 300 K for a maximum field of 18 kOe following zero-field cooling (ZFC)\nfrom a high temperature (∼700 K) - which is even above\nthe magnetic transition point TN (∼590 K) of the AFM\ncomponent - in a vibrating sample magnetometer for a\n\n\f2\n\nFIG. 2: (color online) (a) The characteristic dip at ∼21 K in\nthe differential between two ZFC magnetization versus temperature patterns recorded under two different protocols - a\nsimple ZFC and a ZFC with \"stop-and-wait\" approach; inset shows a similar dip even at 50 K. It appears to become\nsharper and more prominent with the increase in wait time.\n(b) The impact of training effect on CEB for sample A. The\nCEB and HC decrease with the increase in number of hysteresis cycles (n); inset shows a portion of the loop at first\nand twelfth cycle.\nFIG. 1: (color online) (a) The hysteresis loop shift, signifying SEB at different temperatures across 5-300 K, measured\nunder 50 kOe following zero-field cooling; the region near origin of the loop is blown up to show the extent of exchange\nbias clearly. (b) The CEB at different temperatures across\n5-300 K measured under a field cooling with +10 kOe. (c)\nThe switch in sign and change in magnitude of the loop shift\nat 5 K signaling asymmetry and tunability of the SEB depending on the sign of the starting field (+50 kOe/-50 kOe)\nof hysteresis loop measurement. (d) The switch in sign and\nchange in magnitude of the CEB at 5 K measured following\nfield cooling under +50 kOe/-50 kOe. (e) The variation of\nSEB and corresponding HC with temperature. (f) The variation of CEB - measured following field cooling under +10 kOe\n- and corresponding HC with temperature (lines are guide to\nthe eyes).\n\ntest case [13]. We obtain an SEB of ∼81 Oe at 300 K\nwhich is consistent with the SEB [14] for different Hm\nacross 10-50 kOe measured in SQUID. This shows that\nthe demagnetization protocol used in SQUID was appropriate in ensuring unmagnetized state of the sample prior\nto the measurement.\nWe report here mainly the results obtained in a\nnanocomposite of ∼6% Bi2 Fe4 O9 and ∼94% BiFeO3\n(sample A) which exhibits maximum SEB and CEB. In\nFig. 1, the results from the magnetic measurements are\nshown. In Fig. 1(a), we show the hysteresis loops which\nyield the SEB at several temperatures across 5-300 K.\nThe region near the origin is blown up to show the extent\nof EB clearly (full loops are given in the Supplemental\nMaterial [13]). We used a field step size of 100 Oe near\nthe origin of the hysteresis loop in order to measure the\nexchange bias accurately. The field span of 10 kOe under\nsuch a protocol is covered typically within ∼3 h (∼104 s)\nwhich gives the time scale of the measurement. In each\ncase, the presence of a large shift in the loop along the\n\nfield axis is conspicuous. This shift cannot result from\nrelaxation of coercivity of the FM component as the tensorial nature of the magnetocrystalline anisotropy cannot\ncontribute to the unidirectional anisotropy. The EB HE\nis given by (Hc1 + Hc2 )/2 while the coercivity HC is\ngiven by (Hc1 - Hc2 )/2; Hc1 and Hc2 are the fields (signs\nare included) corresponding to the points in forward and\nreverse branches of the hysteresis loop at which the magnetization reaches zero. The extent of SEB observed here\nright across 5-300 K is quite large and comparable to\nwhat has been reported by Wang et al. [2] in Ni-MnIn bulk alloys at 10 K. While ramping the temperature\nfrom one point to another, a constant ramp rate of 2.5\nK/min has been used. The observation of SEB iteslf in\nBiFeO3 based bilayer or composite system has not been\nreported so far, and, for the first time, we are reporting it in the nanocomposite of BiFeO3 -Bi2 Fe4 O9 . In Fig.\n1(c), the asymmetry and hence the tunability of the SEB\nat 5 K has been demonstrated. Depending on the sign\nof the starting field +50 kOe(-50 kOe), the sign of the\nSEB is negative (positive) as well as |-HEp | > |+HEn |.\nThis is also remarkable and has not yet been observed in\nany other system exhibiting SEB [2]. Figure 1(b) shows\nthe CEB measured after a magnetic annealing treatment\nwith 10 kOe. In this case a field of 10 kOe has been\napplied at room temperature and then the temperature\nwas ramped down to the given point at a cooling rate of\n2.5 K/min. Like SEB, the CEB too turns out to be negative i.e., annealing under positive (negative) field yields\nhysteresis loop shift in negative (positive) direction along\nthe field axis. Even more interesting is that, in this case\ntoo, the exchange bias HE for positive (negative) annealing field is asymmetric with |-HEp | > |+HEn |. This has\nbeen demonstrated clearly in Fig. 1(d) which shows the\nasymmetry in the shift of the loop along the field axis\n\n\f3\n\nFIG. 3: (color online) (a) The SEB for all the three samples with different volume fractions of Bi2 Fe4 O9 phase. (b) The CEB\nand HC versus temperature plot for sample-B. Large CEB (measured following field cooling under 50 kOe) could be observed\nat only below TB . The zero-field cooled (ZFC), field cooled (FC), and remanent magnetization versus temperature plots for\n(c) sample A and (d) sample B. The solid lines show the ZFC and FC magnetizations after subtraction of the contribution of\nthe paramagnetic C/T component in both the cases; TB turns out to be >350 K for sample A and ∼60 K for sample B.\n\nFIG. 4: Schematic of the ferromagnetic and antiferromagnetic\nspin interaction via superspin glass moments at the interface; left part shows the ferromagnetic core of finer Bi2 Fe4 O9\nparticle and superspin glass moments at the shell interacting with the local moments of spiral spin spin structure of\nbigger BiFeO3 ; right part shows the spin configuration and\ninteraction energies.\n\nat 5 K depending on whether the sample has been fieldcooled under +50 kOe or -50 kOe. In Figs. 1(e) and\n1(f), respectively, we show the HE and HC as a function\nof temperature (T) for SEB (ZFC) and CEB (measured\nfollowing FC with 10 kOe). The HE and HC in both of\nthese cases are nearly identical in magnitude and nonmonotonic. While HE -T plots exhibit valleys at ∼150 K\nfor both SEB and CEB, the HC -T plots exhibit valleys at\n∼50 K. In addition, the HE -T plot exhibits a peak at ∼50\nK for CEB [Fig. 1(f)]. The nearly identical magnitude\nof HE and HC signifies nearly identical UA and domain\npinning under ZFC and FC with 10 kOe. HE , however,\nis large at 5 K, possibly, because of large magnetization\nat low temperature which could increase further under\nfield cooling.\nIn order to trace the origin of all these features, we\ninvestigated the spin structure both in the bulk of the\nBiFeO3 and Bi2 Fe4 O9 particles as well as at their interfaces from well designed protocol dependent magnetic\nmemory and training effect measurements. We obtained\na profound signature of the presence of superspin glass\n(SSG) moments in the memory effect measurement for\n\nsample A. We used a 'stop-and-wait' protocol to measure\nthe memory effect which is an unequivocal signature of\nthe presence of SSG [15]. The sample was first cooled\ndown to 2 K from room temperature under zero field\nand an M(T) pattern (which acts as reference line) was\nmeasured under 200 Oe. After the sample temperature\nreaches 300 K, it was again brought back to 2 K under\nzero field. The M(T) measurement was then repeated\nbut with a 'stop-and-wait' protocol. As the temperature\nreaches at Tw ∼21 K, the measurement was stopped for\n∼104 s and the restarted to reach back to 300 K. The\ndifference between the two patterns δM(T) is shown in\nFig. 2(a), the main frame. The memory effect is shown\nas a dip at ∼21 K which confirms the presence of SSG\nphase in the nanocomposite. The entire measurement\nhas been repeated for Tw ∼50 K [Fig. 2(a) inset]. The\nmemory effect could be observed even at ∼50 K as well.\nWe further measured the wait-time dependence of the\nmemory effect [Fig. 2(a) inset]. It appears that the effect becomes sharper and more prominent with the increase in wait time across 103 -104s. The SSG moments\ndevelop due to interaction among the frozen superparamagnetic domains - possibly present at the shell of the\nfiner Bi2 Fe4 O9 particles of core-shell structure with FM\ncore - at finite interparticle distance below the blocking temperature (TB > 350 K for sample A) [16]. With\nthe rise in exchange coupling strength, the superparamagnetic particles form a SSG, initially, and then even a\nsuperferromagnetic phase.\nThe dynamics of the spin structure at the interface has\nbeen probed for sample A by studying the training effect\non CEB at 5 K for 12 repeating cycles. The dependence\nof HE and HC on the number of repeating cycles (n) is\nshown in Fig. 2(b). The CEB obtained under a Hm of\n50 kOe following FC with 50 kOe is shown here. Both\nthe parameters are found to be decreasing monotonically\nwith the increase in n indicating spin rearrangement at\nthe interface. It appears that the empirical law [17] for\nn\npurely AFM spin rearrangement at the interface HE\n=\n\n\f4\n1\n\n∞\n∞\nHE\n+ k.n− 2 with k = 505 Oe and HE\n= 813 Oe cannot describe our data well [green line in Fig. 2(b)]. Instead, a model [18] which considers a mixed scenario of\ntwo different relaxation rates for frozen and rotate-able\nuncompensated spin components at the interface\nn\n∞\nHE\n= HE\n+ Af exp(−n/Pf ) + Ar exp(−n/Pr )\n\n(1)\n\n(where f and r denote the frozen and rotate-able spin\ncomponents) fits the data perfectly well [brown line in\n∞\nFig. 2(b)] and yields the fitting parameters as HE\n=\n761 Oe, Af = 1394 Oe, Pf = 0.61, Ar = 451 Oe, and\nPr = 3. The ratio Pr /Pf ∼ 5 indicates that the rotateable spins rearrange nearly 5 times faster than the frozen\nspins. Thus while the 'memory effect' signifies the presence SSG moments in the nanocomposite, the 'training\neffect' on CEB shows that the SSG moments reside at\nthe interfaces between FM Bi2 Fe4 O9 and AFM BiFeO3\nparticles and influence the SEB and CEB significantly.\nIt is important to mention here that the SEB exhibits\nnegligible training effect within the laboratory time scale\n(∼104 s). This could be because it originates from a stable state under zero field and zero magnetization through\nspontaneous symmetry breaking.\nWe further examined the SEB in two other samples\nwith higher (∼10%) and lower (<3%) volume fraction\nof Bi2 Fe4 O9 (sample B and C, respectively). The corresponding full hysteresis loops have been given in the\nSupplemental Material [13]. The TN of the AFM component for sample B and C are ∼490 K and ∼450 K,\nrespectively (given in the Supplemental Material [13]).\nIn Fig. 3(a), comparison of the SEB among all the three\nsamples (A,B, and C) is shown. The SEB is found to\nfollow a rather nonmonotonic pattern with the variation\nin the volume fraction of Bi2 Fe4 O9 phase. It decreases\nboth with the increase and decrease in the volume fraction of the Bi2 Fe4 O9 phase. The SEB in all these cases\ncould be observed at only below the respective TB 's. The\nTB decreases down to ∼60 K in sample-B because of finer\nBi2 Fe4 O9 particles (∼8 nm). The TB , however, could not\nbe located within the range 5-300 K for sample C and,\ntherefore, no exchange bias could be observed in this sample within the same temperature range. The CEB and\nHC for sample B are also found to be finite [Fig. 3(b)]\nonly at below the TB (∼60 K). And as expected, the\nmemory effect too has been observed in sample B at below TB [13]. The memory effect, observed both in sample\nA and B, implies presence of SSG phase and its influence\non the exchange bias. Since superparamagnetic and SSG\nphases coexist at below TB in both the samples, one can\nestimate the relative volume fraction of the SSG phase\nby calculating the ZFC and FC magnetic moment versus\ntemperature pattern after subtracting the contribution\nof the Curie paramagnetic component C/T (C = Curie\nconstant) from the experimental result [Figs. 3(c) and\n3(d)] and noting the flatness of the FC moment versus\ntemperature pattern [16] at below TB . The calculated\n\npatterns (solid lines) for both the samples A and B are\nshown in Figs. 3(c) and 3(d), respectively. It appears\nthat the volume fraction of SSG phase is higher in sample A than in sample B. The SEB too is higher in sample\nA than in sample B. Clear correlation between the volume fraction of the SSG phase and the extent of SEB\nshows that the SSG phase plays a major role in inducing\nSEB.\nWe show that all these results could be qualitatively\nunderstood by considering a model of \"superinteraction\nbias coupling\" between the FM core of finer Bi2 Fe4 O9\nand local uncompensated moments of the AFM order in\ncoarser BiFeO3 particles via the SSG shell at the interface. The model is shown schematically in Fig. 4 and\ndraws essentially from the model proposed in Ref. [3].\nThe dotted line marks the direction of the applied field.\nThe shell SSG moments s1 and s2 are coupled to the\nFM moment SF by a coupling parameter JF and to the\nAFM moment SAF by JAF while the coupling between\ns1 and s2 is J. The net coupling parameter b will depend on JAF , JF , and J and, finally, HE ∝ b [4]. It\nhas been shown [4] that the random fields generated by\nspin glass moments at the core can act on the saturated\nFM moment and set the UA via RKKY interaction. The\nmodel that we are proposing in the present case is the\nfollowing. The random field from frozen SSG moments\nappears to be inducing a variation in the anisotropy of\nthe AFM moments including biaxiality with respect to\nthe direction of the applied field. Thus depending on the\norientation of the principal easy axes of AFM grains with\nrespect to the direction of the applied field, the AFM\ngrains can experience either no torque or large torque\nand become (i) fully hysteretic, (ii) non-hysteretic, or\n(iii) partially hysteretic. While the fully hysteretic and\nnon-hysteretic grains do not contribute to the bias in\nthe loop, the partially hysteretic grains do. The partially hysteretic grains set the UA, primarily, in a direction opposite to that of the applied field. The SEB,\nthen, becomes negative - i.e., depending on the sign of\nthe starting field for loop tracing, positive (negative), the\nSEB turns out to be negative (positive). Application of\nthe first field for tracing the loop breaks the symmetry\namong the AFM grains and sets the UA. The FM moments are assumed to be saturated under the applied\nfield. However, the most interesting aspect is that there\nis a spontaneous symmetry breaking as well, driven by the\nrandom field of the SSG moments at the interface which\nyields a global minima in the energy landscape and sets\nthe UA universally along the negative field direction even\nin absence of first field of loop tracing. These grains are\nthus always partially hysteretic along the negative direction of the applied field. The grains which set the UA in\na direction opposite to that of applied field are partially\nhysteretic for both the directions of applied field. But the\nones mentioned above are partially hysteretic only with\nrespect to the negative field direction. This aspect, in\n\n\f5\nfact, gives rise to the observed asymmetry in both SEB\nand CEB with |-HEp | > |+HEn | and has not been reported by others so far in the context of either SEB or\nCEB. The role of SSG moments, therefore, appears to\nbe crucial in inducing this spontaneous symmetry breaking and setting the UA universally along the negative\nfield direction. Alternatively, a similar effect could be observed due to an even finer fraction of Bi2 Fe4 O9 particles,\nbecause of a distribution in the size, which form superferromagnetic (SFM) domains via stronger interparticle\nexchange interaction [16]. The SSG mediated SFM-AFM\nexchange interaction within an ensemble of grains with\na finer fraction of Bi2 Fe4 O9 particles, in that case, could\nactually give rise to the spontaneous symmetry breaking\nand set the UA universally along the negative field direction even in absence of first field of loop tracing. Only\nthose grains, then, are responsible for giving rise to the\nobserved asymmetry in SEB and CEB.\nThe temperature dependence of SEB is nonmonotonic\nas at well below TB , the increase in temperature increases\nthe interaction between SSG and AFM moments which,\nin turn, induces the energy landscape necessary to set\nthe UA in the system. The bias as well as the asymmetry, therefore, increase. However, as the TB is approached, the number of grains turning superparamagnetic increases which, in turn, reduces the bias. The\nnonmonotonic variation in SEB with the volume fraction\nof Bi2 Fe4 O9 phase, likewise, can be explained by considering nonmonotonic variation in the volume fraction of\nthe SSG phase.\nIn summary, we report a giant as well as tunable spontaneous exchange bias of ∼300-600 Oe across 5-300 K in\na nanocomposite of BiFeO3 (∼94%) - Bi2 Fe4 O9 (∼6%).\nIt originates from a superinteraction bias coupling between ferromagnetic core of finer Bi2 Fe4 O9 (∼19 nm)\nparticles and antiferromagnetic moment in coarser (∼112\nnm) BiFeO3 particles via superspin glass moments at the\ninterface. Since it induces a variety of coupling across the\ninterfaces and thus develop a complicated interaction energy landscape among the FM/AFM grains by breaking\nthe symmetry spontaneously even before the application\nof the first field of the loop tracing, the presence of superspin glass moments turns out to be crucial. This giant\nand tunable (i.e., path dependent) exchange bias can be\nutilized for an enormous improvement in the efficiency\nof switching the magnetic anisotropy in a ferromagnetic\n\nsystem electrically via \"exchange coupling mediated multiferroicity\" in such a nanocomposite and/or a multilayer\nthin film systems.\nThis work has been supported by Indo-Ireland joint\nprogram (DST/INT/IRE/P-15/11), Science Foundation\nof Ireland (SFI) Principal Investigator (PI) Project No.\n11/PI/1201 and FORME SRC project (07/SRC/I1172)\nof SFI. One of the authors (S.G.) acknowledges support\nfrom a Research Associateship of CSIR.\n\n∗\n†\n\n[1]\n[2]\n[3]\n\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n\n[12]\n[13]\n\n[14]\n[15]\n[16]\n\n[17]\n[18]\n\nElectronic address: dipten@cgcri.res.in\nElectronic address: saibal.roy@tyndall.ie\nJ. Saha and R.H. Victora, Phys. Rev. B 76, 100405\n(2007).\nB.M. Wang, Y. Liu, P. Ren, B. Xia, K.B. Ruan, J.B. Yi,\nJ. Ding, X.G. Li, and L. Wang, Phys. Rev. Lett. 106,\n077203 (2011).\nH. Ahmadvand, H. Salamati, P. Kameli, A. Poddar, M.\nAcet, and K. Zakeri, J. Phys. D : Appl. Phys. 43, 245002\n(2010).\nM. Ali, P. Adie, C.H. Marrows, D. Greig, B.J. Hickey,\nand R.L. Stamps, Nature Mater. 6, 70 (2007).\nL.W. Martin et al., Appl. Phys. Lett. 91, 172513 (2007).\nL.W. Martin et al., Nano Lett. 8, 2050 (2008).\nY-H. Chu et al., Nature Mater. 7, 478 (2008).\nJ.T. Heron et al., Phys. Rev. Lett. 107, 217202 (2011).\nD. Lebeugle, A. Mougin, M. Viret, D. Colson, and L.\nRanno, Phys. Rev. Lett. 103, 257601 (2009).\nS. Sahoo, T. Mukherjee, K.D. Belashchenko, and Ch.\nBinek, Appl. Phys. Lett. 91, 172506 (2007).\nZ.M. Tian, S.L. Yuan, X.L. Wang, X.F. Zheng, S.Y.\nYin, C.H. Wang, and L. Liu, J. Appl. Phys. 106, 103912\n(2009).\nS. Goswami, D. Bhattacharya, and P. Choudhury, J.\nAppl. Phys. 109, 07D737 (2011).\nThe supplementary data are available on request or from\nthe website mentioned in the version published in the\njournal.\nT. Maity, S. Goswami, D. Bhattacharya, G.C. Das, and\nS. Roy, J. Appl. Phys. (in press).\nM. Sasaki, P.E. Jonsson, H. Takayama, and H. Mamiya,\nPhys. Rev. B 71, 104405 (2005).\nXi Chen, S. Bedanta, O. Petracic, W. Kleemann, S. Sahoo, S. Cardoso, and P.P. Freitas, Phys. Rev. B 72,\n214436 (2005).\nD. Paccard, C. Schlenker, O. Massenet, R. Montmory,\nand A. Yelon, Phys. Stat. Solid. 16, 301 (1966).\nS.K. Mishra, F. Radu, H.A. Durr, and W. Eberhardt,\nPhys. Rev. Lett. 102, 177208 (2009).\n\n\f"}