{"id": "http://arxiv.org/abs/0811.3243v1", "guidislink": true, "updated": "2008-11-20T00:03:49Z", "updated_parsed": [2008, 11, 20, 0, 3, 49, 3, 325, 0], "published": "2008-11-20T00:03:49Z", "published_parsed": [2008, 11, 20, 0, 3, 49, 3, 325, 0], "title": "Statistical mechanics of Floquet systems: the pervasive problem of near\n  degeneracies", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0811.2045%2C0811.2540%2C0811.2711%2C0811.2443%2C0811.2175%2C0811.0864%2C0811.3238%2C0811.3495%2C0811.2723%2C0811.0056%2C0811.2753%2C0811.2585%2C0811.3257%2C0811.3169%2C0811.1783%2C0811.1924%2C0811.4307%2C0811.3804%2C0811.0526%2C0811.3524%2C0811.4321%2C0811.1068%2C0811.1978%2C0811.2589%2C0811.0724%2C0811.4077%2C0811.3243%2C0811.0572%2C0811.1674%2C0811.3170%2C0811.3751%2C0811.2693%2C0811.3702%2C0811.1857%2C0811.3331%2C0811.3412%2C0811.0608%2C0811.4266%2C0811.2480%2C0811.1542%2C0811.4162%2C0811.3661%2C0811.3734%2C0811.1431%2C0811.2388%2C0811.0644%2C0811.2138%2C0811.0615%2C0811.4652%2C0811.2915%2C0811.1471%2C0811.2420%2C0811.3803%2C0811.1257%2C0811.3975%2C0811.0065%2C0811.3875%2C0811.1357%2C0811.1115%2C0811.3537%2C0811.1232%2C0811.1652%2C0811.2276%2C0811.0456%2C0811.0128%2C0811.2962%2C0811.2878%2C0811.0733%2C0811.3244%2C0811.1882%2C0811.4543%2C0811.0626%2C0811.0978%2C0811.2247%2C0811.3647%2C0811.0309%2C0811.2520%2C0811.1420%2C0811.2415%2C0811.1033%2C0811.0774%2C0811.2550%2C0811.3895%2C0811.0805%2C0811.4003%2C0811.0197%2C0811.4241%2C0811.3904%2C0811.2950%2C0811.2301%2C0811.4197%2C0811.2712%2C0811.2454%2C0811.2942%2C0811.2370%2C0811.2396%2C0811.3993%2C0811.0182%2C0811.4131%2C0811.0595%2C0811.0992&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Statistical mechanics of Floquet systems: the pervasive problem of near\n  degeneracies"}, "summary": "The statistical mechanics of periodically driven (\"Floquet\") systems in\ncontact with a heat bath exhibits some radical differences from the traditional\nstatistical mechanics of undriven systems. In Floquet systems all quasienergies\ncan be placed in a finite frequency interval, and the number of near\ndegeneracies in this interval grows without limit as the dimension N of the\nHilbert space increases. This leads to pathologies, including drastic changes\nin the Floquet states, as N increases. In earlier work these difficulties were\nput aside by fixing N, while taking the coupling to the bath to be smaller than\nany quasienergy difference. This led to a simple explicit theory for the\nreduced density matrix, but with some major differences from the usual time\nindependent statistical mechanics. We show that, for weak but finite coupling\nbetween system and heat bath, the accuracy of a calculation within the\ntruncated Hilbert space spanned by the N lowest energy eigenstates of the\nundriven system is limited, as N increases indefinitely, only by the usual\nneglect of bath memory effects within the Born and Markov approximations. As we\nseek higher accuracy by increasing N, we inevitably encounter quasienergy\ndifferences smaller than the system-bath coupling. We therefore derive the\nsteady state reduced density matrix without restriction on the size of\nquasienergy splittings. In general, it is no longer diagonal in the Floquet\nstates. We analyze, in particular, the behavior near a weakly avoided crossing,\nwhere quasienergy near degeneracies routinely appear. The explicit form of our\nresults for the denisty matrix gives a consistent prescription for the\nstatistical mechanics for many periodically driven systems with N infinite, in\nspite of the Floquet state pathologies.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0811.2045%2C0811.2540%2C0811.2711%2C0811.2443%2C0811.2175%2C0811.0864%2C0811.3238%2C0811.3495%2C0811.2723%2C0811.0056%2C0811.2753%2C0811.2585%2C0811.3257%2C0811.3169%2C0811.1783%2C0811.1924%2C0811.4307%2C0811.3804%2C0811.0526%2C0811.3524%2C0811.4321%2C0811.1068%2C0811.1978%2C0811.2589%2C0811.0724%2C0811.4077%2C0811.3243%2C0811.0572%2C0811.1674%2C0811.3170%2C0811.3751%2C0811.2693%2C0811.3702%2C0811.1857%2C0811.3331%2C0811.3412%2C0811.0608%2C0811.4266%2C0811.2480%2C0811.1542%2C0811.4162%2C0811.3661%2C0811.3734%2C0811.1431%2C0811.2388%2C0811.0644%2C0811.2138%2C0811.0615%2C0811.4652%2C0811.2915%2C0811.1471%2C0811.2420%2C0811.3803%2C0811.1257%2C0811.3975%2C0811.0065%2C0811.3875%2C0811.1357%2C0811.1115%2C0811.3537%2C0811.1232%2C0811.1652%2C0811.2276%2C0811.0456%2C0811.0128%2C0811.2962%2C0811.2878%2C0811.0733%2C0811.3244%2C0811.1882%2C0811.4543%2C0811.0626%2C0811.0978%2C0811.2247%2C0811.3647%2C0811.0309%2C0811.2520%2C0811.1420%2C0811.2415%2C0811.1033%2C0811.0774%2C0811.2550%2C0811.3895%2C0811.0805%2C0811.4003%2C0811.0197%2C0811.4241%2C0811.3904%2C0811.2950%2C0811.2301%2C0811.4197%2C0811.2712%2C0811.2454%2C0811.2942%2C0811.2370%2C0811.2396%2C0811.3993%2C0811.0182%2C0811.4131%2C0811.0595%2C0811.0992&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The statistical mechanics of periodically driven (\"Floquet\") systems in\ncontact with a heat bath exhibits some radical differences from the traditional\nstatistical mechanics of undriven systems. In Floquet systems all quasienergies\ncan be placed in a finite frequency interval, and the number of near\ndegeneracies in this interval grows without limit as the dimension N of the\nHilbert space increases. This leads to pathologies, including drastic changes\nin the Floquet states, as N increases. In earlier work these difficulties were\nput aside by fixing N, while taking the coupling to the bath to be smaller than\nany quasienergy difference. This led to a simple explicit theory for the\nreduced density matrix, but with some major differences from the usual time\nindependent statistical mechanics. We show that, for weak but finite coupling\nbetween system and heat bath, the accuracy of a calculation within the\ntruncated Hilbert space spanned by the N lowest energy eigenstates of the\nundriven system is limited, as N increases indefinitely, only by the usual\nneglect of bath memory effects within the Born and Markov approximations. As we\nseek higher accuracy by increasing N, we inevitably encounter quasienergy\ndifferences smaller than the system-bath coupling. We therefore derive the\nsteady state reduced density matrix without restriction on the size of\nquasienergy splittings. In general, it is no longer diagonal in the Floquet\nstates. We analyze, in particular, the behavior near a weakly avoided crossing,\nwhere quasienergy near degeneracies routinely appear. The explicit form of our\nresults for the denisty matrix gives a consistent prescription for the\nstatistical mechanics for many periodically driven systems with N infinite, in\nspite of the Floquet state pathologies."}, "authors": ["Daniel W. Hone", "Roland Ketzmerick", "Walter Kohn"], "author_detail": {"name": "Walter Kohn"}, "author": "Walter Kohn", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevE.79.051129", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0811.3243v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0811.3243v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "31 pages, 3 figures", "arxiv_primary_category": {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0811.3243v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0811.3243v1", "journal_reference": null, "doi": "10.1103/PhysRevE.79.051129", "fulltext": "Statistical mechanics of Floquet systems: the pervasive problem\n\narXiv:0811.3243v1 [cond-mat.stat-mech] 20 Nov 2008\n\nof near degeneracies\nDaniel W. Hone,1, 2, ∗ Roland Ketzmerick,3 and Walter Kohn1, †\n1\n2\n3\n\nPhysics Department, UCSB, Santa Barbara, CA 93106\n\nKavli Institute for Theoretical Physics, UCSB, Santa Barbara, CA 93106\n\nInstitut für Theoretische Physik, Technische Universität Dresden, 01062 Dresden, Germany\n(Dated: June 4, 2018)\n\n1\n\n\fAbstract\nAlthough the statistical mechanics of periodically driven (\"Floquet\") systems in contact with a\nheat bath has some formal analogy with the traditional statistical mechanics of undriven systems,\ncloser examination reveals radical differences. In Floquet systems all quasienergies εj can be placed\nin a finite frequency interval 0 ≤ εj < ω (with ω the driving frequency and h̄ = 1), and the number\nof near degeneracies (|εj − εk | ≤ δ for arbitrarily small δ) in this interval grows without limit as\nthe dimension N of the Hilbert space increases. As we noted in a previous paper, this leads to\npathologies, including drastic changes in the Floquet states, as N increases. In earlier work on\nFloquet systems in contact with a heat bath these difficulties were put aside by fixing N , while\ntaking the coupling to the bath to be smaller than any quasienergy difference. This led to a simple\nexplicit theory for the reduced density matrix, but with some major differences from the usual time\nindependent statistical mechanics. We show that, for weak but finite coupling between system and\nheat bath, the accuracy of a calculation within the truncated Hilbert space spanned by the N\nlowest energy eigenstates of the undriven system is limited, as N increases indefinitely, only by the\nusual neglect of bath memory effects within the Born and Markov approximations. As we seek\nhigher accuracy by increasing N , we inevitably encounter quasienergy differences smaller than\nthe system-bath coupling. We therefore derive the steady state reduced density matrix without\nrestriction on the size of quasienergy splittings. In general, it is no longer diagonal in the Floquet\nstates. We analyze, in particular, the behavior near a weakly avoided crossing, where quasienergy\nnear degeneracies routinely appear. The explicit form of our results for the denisty matrix gives a\nconsistent prescription for the statistical mechanics for many periodically driven systems with N\ninfinite, in spite of the Floquet state pathologies.\n\n∗\n\nElectronic address: hone@kitp.ucsb.edu\n\n†\n\nElectronic address: kohn@physics.ucsb.edu\n\n2\n\n\fI.\n\nINTRODUCTION\n\nTime-periodic quantum systems are of great importance in several fields of science:\natomic and solid-state systems driven by monochromatic electromagnetic fields [1]; quantum ratchets [2]; quantum chaos [3]. The Floquet theorem gives the solutions of the timedependent Schrödinger equation with a time-periodic Hamiltonian (period 2π/ω) in the\nform exp(−iεt)u(t), with u(t) exhibiting the same periodicity as the Hamiltonian. The\n\"quasienergy\" ε plays a role analogous to the energy in static systems, determining in this\ncase the behavior of the wave function under finite one-period, rather than infinitesimal,\ntime translations. The quasienergy ε is defined only mod ω, and we follow the convention\nof taking 0 ≤ ε < ω.\nReal Floquet systems will ordinarily be in thermal contact with a bath. Energy is being\ncontinuously supplied by the periodic driving field, with relaxation provided by the bath.\nThis leads to a fundamental question of statistical physics: Is there an asymptotic, time\nperiodic, ensemble characterizing the quantum system and, if so, how does it depend on the\ncoupling to and the temperature of the bath? For a time independent system with Hamiltonian H0 the answer is given by the canonical reduced density operator ρ = exp(−βH0 )/Z,\nwhere β is the inverse temperature, and Z is the partition function. This density operator is\nindependent of the form and magnitude of the coupling to the environment, to lowest nontrivial order in that coupling, and the operator is diagonal in the energy eigenstates of the\nsystem Hamiltonian. Thus, even if two states are separated by an energy small compared\nto their coupling with the bath (\"near degeneracy\"), or even if they are degenerate, their\nstatistical weights are given by their energy, and there is no anomaly associated with their\nnear or strict degeneracy. That simplicity does not carry over to the case of near degeneracy\nin quasienergy .\nFor time-periodic systems in thermal contact with a bath the general long time behavior\nhas not yet been fully clarified. In particular, the inevitable appearance of near degeneracies\nof quasienergies has not been addressed. Earlier work includes a number of papers [4, 5, 6,\n7, 8, 9] which have discussed specific physical systems, treating either those whose quantum\nstates span only a finite space, or others whose Hilbert space has been truncated to a finite\nset and then studied numerically, but always with coupling to the bath small with respect to\nany quasienergy spacing. Within such a finite state space, and in the limit of weak coupling\n3\n\n\fto the bath, a description of driven dissipative systems, as applied to driven Rydberg atoms\nin thermal contact with discrete wave guide modes, was introduced by Blümel et al. [4],\nand extended by Kohler et al. [7] to driven one-dimensional harmonic and anharmonic\noscillators. An extension to strong coupling to the bath was presented by Thorwart et\nal. [10] for tunneling and relaxation of a particle in a bistable one-dimensional well, but\nusing methods and approximations suitable only when a (small) finite number of system\nenergy eigenstates is significantly accessible. A discussion of the statistical mechanics of a\nmore general class of periodically driven systems was given by one of us [11], restricted to\na finite Hilbert space with a non-degenerate quasienergy spectrum, in the limit of coupling\nto the bath much weaker than the smallest quasienergy spacing. In this limit, where the\ndensity operator is assumed diagonal in the representation of the Floquet states, the matrix\nelements can be obtained by solving a set of linear rate equations. In sharp contrast to\nthe time independent case, they do depend on the explicit form (but not the magnitude)\nof the coupling between system and bath, and they are not simple smooth functions of the\nquasienergy.\nIn the general case of time-periodic quantum systems with a Hilbert space whose number of dimensions N increases without limit, the situation is more complex. Since the\nquasienergies are restricted to a finite range of width ω, the mean spacing between neighboring quasienergy levels approaches zero as their number increases. Therefore, any fixed\ncoupling to the thermal environment is never small relative to all level spacings for a sufficiently large basis size. It becomes essential to deal with degenerate and near degenerate\nquasienergies, a situation which has been explicitly excluded in previous analyses. Indeed,\nin the limit N → ∞ an infinite number of quasienergy degeneracies avoided by arbitrarily weak level repulsions may occur, and many anomalies of the spectrum and the Floquet\nstates appear, as was pointed out in [12]. So it is of special importance to determine the\neffect of the bath when the coupling becomes comparable to or even large with respect to\none or more of the relevant quasienergy splittings.\nIn this paper we address the critical question of the appropriate description of the steady\nstate of time-periodic quantum systems with small but finite coupling to the bath. We\nreview in Sec. II the derivation from the master equation of the set of linear equations that\ndetermine the reduced density matrix. This matrix is in general no longer diagonal in the\nbasis of the Floquet states of the system, but it does approach a limiting time periodic form.\n4\n\n\fWe obtain a set of linear homogeneous equations which determine all of the density matrix\nelements in the long time, stationary time-periodic state, Eq. (2.20). This result is no longer\nlimited to the regime of bath coupling weak compared to all quasienergy spacings. For a\nfinite Hilbert space and in the limit of infinitesimal coupling we discuss the differences from\nthe conventional statistical mechanics of time-independent systems.\nWe next study in detail the influence of a single weakly avoided crossing of Floquet\nquasienergies (as a function of driving field strength) on a finite density matrix, since it is\nthere that the near degeneracies of interest develop. In Sec. III we find that the important\nconsequences of such an avoided crossing can be incorporated by introducing an additional\neffective coupling (3.4) between the two states involved, mediated by the bath. This coupling\ndecreases with distance from the avoided crossing (which conveniently parameterizes the\nquasienergy separation of the two states), and it depends on the ratio of the coupling strength\nΓ of the two states to the bath, and their minimum quasienergy splitting, ∆. Remarkably,\nall of the diagonal elements of the density matrix in the representation of the \"diabatic\"\nstates defined well away from the center of the avoided crossing, a basis which is fixed\nthroughout the crossing, are determined by a set of linear rate equations (3.3) of exactly\nthe structure familiar from ordinary time-independent statistical mechanics, but with this\nsingle added effective coupling rate. For Γ ≪ ∆ the additional coupling influences not\nonly the (diagonal and off-diagonal) reduced density matrix elements for the two states\nthemselves, but may completely change the whole steady state reduced density matrix, so\nthat average system observables will in general change radically with driving field strength\nin the range of the avoided crossing. Physically, high order near resonances of the driving\nfield between eigenstates of the undriven system can populate high energy levels, which\nthen affect populations of lower energy levels in the relaxation cascade. In the opposite\nlimit, Γ ≫ ∆, the coherence necessary for the high order resonance is disrupted by the\ninteractions with the bath, and the avoided crossing has negligible influence on the reduced\ndensity matrix which, in this limit, is approximately diagonal in the diabatic basis. We\npresent a simple, albeit somewhat artificial, example which can be solved in some detail,\nspecifically exhibiting these effects.\nWe then use this insight to discuss time-periodic quantum systems with a Hilbert space\nof increasingly large dimension in Sec. IV. We find that weakly enough avoided crossings,\nwhile having great impact on the Floquet states, have no significant consequences for the\n5\n\n\fdensity matrix (in a λ-independent basis). It is this central result which justifies the neglect\nin many cases of all but a finite basis set in the calculation of the statistical mechanics of\na Floquet system, as is essential for any numerical study. Specifically, for the calculation\nof statistical properties, we establish the validity of using the conventional approximation\nof eliminating from the undriven system spectrum all states of sufficiently high energy (the\ncutoff to be determined by the accuracy desired), and allowing the periodic driving field to\nmix only the remaining states. Within that finite basis set we have derived a prescription\nfor calculating the full reduced density matrix, in general no longer diagonal in the Floquet\nrepresentation. A brief summary is given in the conclusion, Sec. V.\n\nII.\n\nREDUCED DENSITY MATRIX\nA.\n\nEquations of motion and time periodic solutions\n\nWe review and extend the derivation of the steady state solution for the reduced density\nmatrix in the weak-coupling limit (\"Born-Markov approximation\") for Floquet systems,\npreviously discussed [4, 7] only for situations where all quasienergy spacings were large\ncompared with the coupling to the bath (and therefore only for systems restricted to a finite\nnumber of states). In contrast, we stress that the validity of the more general equations is\nnot limited to that regime, and we give a detailed justification for an approximation using\ntime-averaged rates.\nWe write the Hamiltonian generally as the sum of Hs (t), describing the dynamics of the\nsystem driven by a time-periodic external field with period 2π/ω, the Hamiltonian Hb of the\nbath, and the interaction between system and bath Hsb ,\nH(t) = Hs (t) + Hb + Hsb .\n\n(2.1)\n\nThe total density operator of this closed coupled system, ρT (t), is the solution of the equation\nof motion,\niρ̇T (t) = [H(t), ρT (t)].\n\n(2.2)\n\nWe trace over bath variables to obtain the reduced density operator for the system,\nρ = Trb ρT ,\n\n6\n\n(2.3)\n\n\fand do the standard recasting of the master equation into an integro-differential equation\n(see, e.g., [14, 15]), whose iteration gives directly the expansion in powers of the system-bath\ninteraction:\nd\nρ̃(t) = −\ndt\n\nZ\n\nt\n0\n\nh\n\nh\n\nii\n\ndt′ Trb H̃sb (t), H̃sb (t′ ), ρ̃T (t′ ) .\n\n(2.4)\n\nHere the tilde labels operators in the interaction picture. We have omitted the linear term\ninvolving Trb Hsb , which ordinarily vanishes. This is the case, e.g., for an interaction between\nsystem and bath characterized by creation or destruction of single bath bosons, such as\nphonons or photons, or of free electrons or other fermions. Otherwise, this equation is still\ngeneral and exact.\nIn order to make further progress, which depends on being able to trace over the bath\nvariables under the integral, we make two essential simplifications: (i) second order perturbation theory [16] in Hsb and (ii) the Markov approximation. Their validity relies ultimately\non being able to neglect any memory effects within the bath. The correlation times associated with the bath must be small compared with the times characterizing the evolution of\nthe reduced density operator (see the condition (2.10) below). First, to lowest non-vanishing\norder in Hsb we take the total density operator ρT (t′ ) under the integral as a simple product\nof system and bath factors,\nρ̃T (t′ ) ≈ ρ̃(t′ )ρb .\n\n(2.5)\n\nThe physical meaning of this approximation is that we neglect more than a single interaction\nof the system with the bath during the bath correlation time. The effect of higher order\ncorrelations, where subsequent interactions depend on the state of the bath modified by\nearlier ones, is negligible, as we show in more detail in Appendix A.\nWe make the specific, but inessential, choice of coupling Hamiltonian:\nHsb = γAB,\n\n(2.6)\n\nwhere the Hermitian operator A acts only on the Floquet system, and the Hermitian operator\nB acts only on the heat bath. A sum of such factorized operator products, γ\n\nP\n\nα\n\nAα Bα , is\n\nalso readily treated. But if the various bath operators Bα are dynamically uncorrelated\nwith each other, then the results below are modified only by an extra index on each matrix\nelement of A and each spectral function g(E) (to be defined below), and a sum over that\nindex. We take the single product to avoid the consequent algebraic clutter, since no essential\n7\n\n\fdifference results in the ultimate equations (the extra sums being merely incorporated into\nthe definition of the complex \"rates\" below (2.14)). Then the trace over bath variables\ninvolves only the single combination\nG(τ ) = Trb ρb B̃(t)B̃(t − τ ),\n\n(2.7)\n\nThis bath correlation function is characterized by a decay time τc , which we assume to be\nmuch shorter than the times characterizing the evolution of the reduced density operator\nρ̃(t) (see Eq. (2.10) below). Then the main contribution to the integral in (2.4) is from values\nof t′ within a range of order τc below the upper limit t. Thus to a good approximation we can\nextend the lower limit to −∞ and also make the Markov approximation: replace t′ by t in\nthe argument of ρ̃T under the integral. Returning to the Schrödinger picture and changing\nthe integration variable to τ = t − t′ , we then have\ndρ\n+ i[Hs (t), ρ(t)] = −γ 2\ndt\n\nZ\n\n0\n\n∞\n\nn\n\nh\n\ni\n\no\n\ndτ G(τ ) AÃ(t − τ, t)ρ(t) − Ã(t − τ, t)ρ(t)A + H.c. . (2.8)\n\nThe rate of change of the reduced density operator due to the coupling to the bath is of\norder\nΓ2 = γ 2 τc hA2 ihB 2 i,\n\n(2.9)\n\nsuggesting that the condition for validity of the \"Born\" and Markov approximations is\nτc Γ2 ≪ 1.\n\n(2.10)\n\nAppendix A demonstrates that this same inequality assures that higher order corrections\nare negligible. The validity of the above approximations is discussed in the literature on\nundriven systems; a particularly clear discussion is given in Ref. [15] . As the approximations\nhave been made within the interaction picture, they are equally valid for a time-periodic\nsystem Hamiltonian Hs (t). We emphasize that we do not require infinitesimal coupling to\nthe bath. That coupling need only be small enough to satisfy the condition (2.10).\nWe recall that the solutions of the isolated system Schrödinger equation i∂t |φi = Hs (t)|φi\nare of the Floquet form |φj (t)i = exp(−iεj t)|uj (t)i with the quasienergies εj chosen to lie\nin the strip 0 ≤ ε < ω and with the time-periodic parts |uj (t)i = |uj (t + 2π/ω)i forming\na complete orthonormal basis for the system at any given time t. We introduce the matrix\nelements of the reduced density operator in this time-periodic basis,\nρij (t) = hui (t)|ρ(t)|uj (t)i,\n8\n\n(2.11)\n\n\fwhich will turn out to be very convenient in the following calculations and which, as we will\nshow later, leads to time-independent density matrix elements in steady state. In this basis\nthe equation of motion of the reduced density matrix elements takes the form\n(\n\nZ ∞\nh\nX\n∂\n+ iεij )ρij (t) = −γ 2\ndτ G(τ )ei(εlk −mω)τ\n(2.12)\nei(M +m)ωt + Aik (M)Akl (m)ρlj (t)\n∂t\n0\nk,l,M,m\n\n− Aik (m)ρkl (t)Alj (M)\n+ ρik (t)Akl (m)Alj (M)\n− Aik (M)ρkl (t)Alj (m)\n\n∞\n\nZ\n\nZ0 ∞\n0\n\nZ\n\n0\n\n∞\n\ndτ G(τ )ei(εki −mω)τ\ndτ G∗ (τ )ei(εlk −mω)τ\ni\n\ndτ G∗ (τ )ei(εjl −mω)τ ,\n\nwhere we defined the Fourier components of the matrix elements of the system operator A,\nhui (t)|A|uj (t)i ≡\n\nX\n\nAij (m)eimωt ,\n\n(2.13)\n\nm\n\nwith the property Akl (m) = A∗lk (−m), and where we have introduced the notation εij ≡\nεi − εj .\nWe simplify the notation by introducing complex time-periodic \"rates\"\nRij;kl (t) =\n\neiKωt Rij;kl (K),\n\nX\n\n(2.14)\n\nK\n\nwith Fourier coefficients\nRij;kl(K) =\n\nX\n\nm\nRij;kl\n(K) = 2πγ 2\n\nm\n\nX\nm\n\nAij (m + K)A∗kl (m)g(εlk − mω),\n\n(2.15)\n\nwhere g(E) is the Fourier transform of G(τ ). We will approximate\nZ\n\n∞\n\n0\n\ndτ G(τ )e−iEτ ≈ πg(E),\n\n(2.16)\n\nneglecting a principal value contribution. From the definition of G(τ ), Eq. (2.7), one finds\ng(E) =\n\nX\nν,ν ′\n\nPν |hν|B|ν ′ i|2δ(E + Eν ′ − Eν ),\n\n(2.17)\n\nwhere ν labels bath states of energy Eν which are in thermal equilibrium and have occupation\nPν ∝ exp(−βEν ).\nThen we have as the fundamental equation of motion of the reduced density matrix\nelements in the Floquet representation, the following set of linear differential equations:\n(\n\ni\n1 Xh\n∂\n∗\n∗\nρlj (t)Rik;lk (t) + ρil (t)Rjk;lk\n(t) − ρkl (t)(Rlj;ki (t) + Rki;lj\n(t)) . (2.18)\n+ iεij )ρij (t) = −\n∂t\n2 k,l\n\n9\n\n\fThis is the generalized Master equation for all density matrix elements. We next replace\nthe time periodic rates Rlj;ki (t) by their average over one driving period,\nRlj;ki =\n\nX\n\nm\nRlj;ki\n= Rlj;ki (K = 0).\n\n(2.19)\n\nm\n\nThis approximation [7] implicitly assumes that the density matrix elements do not vary\nsubstantially over a period of the driving, and it is further discussed in Appendix B. We\nthen find a steady state solution of (2.18) for which the matrix elements ρij are independent\nof time:\niεij ρij = −\nB.\n\ni\n1 Xh\n∗\n∗\nρlj Rik;lk + ρil Rjk;lk\n− ρkl (Rlj;ki + Rki;lj\n).\n2 k,l\n\n(2.20)\n\nLarge quasienergy splittings\n\nThe states of some systems of interest span only a finite dimensional space (e.g., spin\nsystems). Because of the finite number of states, at a given driving strength λ there will\nbe a smallest quasienergy separation. In this subsection we take that smallest separation\nto be large compared to the coupling to the heat bath (an assumption made, in fact, in all\nearlier work on driven dissipative systems in the weak-coupling limit), and we will point to\nboth the similarities to and the differences from the conventional statistical mechanics of\ntime-independent systems.\nIn the limit where the absolute values of all \"rates\" |Rij;kl| are sufficiently small compared\nwith all splittings |εij |, it is clear from (2.20) that all off-diagonal density matrix elements\ncan be neglected, and we arrive at the familiar form,\n0 = ρii\n\nX\nk\n\nRik −\n\nX\n\nρkk Rki ,\n\n(2.21)\n\nk\n\nrelating the state occupation probabilities pi ≡ ρii . Here the diagonal time-independent\nrates,\nRki = Rki;ki = 2πγ 2\n\nX\nm\n\n|Aki (m)|2 g(εik − mω),\n\n(2.22)\n\nare of the form of the usual transition rates of perturbation theory, the square of coupling\nmatrix elements times the density of states (at the energy transfered from bath to system),\nsummed over initial states of the bath with appropriate thermal equilibrium weighting. Of\ncourse, in the static case the equation also holds without the summation over k (detailed\nbalance). That is not the case here.\n10\n\n\fAs was pointed out earlier [9, 11], there are some important differences in this result\nfrom that familiar in static problems. Because of the possibility of absorption and emission\nof multiple quanta of the time-dependent driving field, the occupation probabilities are not\nsimple Boltzmann factors, and indeed they depend on the detailed form of the Hamiltonian\ncoupling the system to the heat bath. From the definition (2.17) of the spectrum of the bath\ncorrelation function we have\ng(E) = g(−E)e−βE ,\n\n(2.23)\n\nwhich is used in the time-independent case to derive the detailed balance equation. In a\nFloquet system it leads, using (2.17) and (2.22), to the relation\n−m β(εj −εj ′ +mω)\nm\n,\nRjj\n′ = Rj ′ j e\n\n(2.24)\n\nrelating only the pieces of the transition rates between system states j and j ′ which involve\nthe transfer of exactly m quanta from the field. After summation over m we find for the\nratio of the full transition rates between these states,\nm\nRjj ′\nmR ′\n= −β(εj −ε ′ ) P jj m −βmω .\nj\nRj ′ j\ne\nm Rjj ′ e\n\nP\n\n(2.25)\n\n′\nm\nThere are situations where the Rjj\n′ have for some pairs (j, j ) just one value of m, say m0 ,\n\nwith a non-negligible value. This is the case for a very small driving amplitude (λ ≪ 1) or\nfor high-lying states of the undriven system that are weakly affected by the periodic driving,\nif the levels j and j ′ are far enough from any avoided crossing. Then in the above ratio the\nm0\nterms Rjj\n′ cancel and the form of the coupling Hamiltonian Hsb is no longer relevant. One\n\ngets Rjj ′ /Rj ′ j ≈ exp[β(εj − εj ′ + m0 ω)], much as in the time independent case, but reflecting\nthe need for m0 quanta of the driving field.\nIn general, the states are mixed by the driving field, giving rates\n\nP\n\nm\n\nm\nRjj\n′ where more\n\nthan one value of m contributes significantly. Consequently the above ratio Rjj ′ /Rj ′j will\nno longer depend just on a single quasienergy difference. In order to find the stationary\nweights pj ≡ ρjj one always has to solve Eq. (2.21). This solution will in general not fulfill\nthe detailed balance equations. Even for the simple situation above, where the direct and\ninverse rates for states j and j ′ have a simple Boltzmann factor ratio, we can not then\nconclude that the corresponding probabilities pj and pj ′ have the same ratio. As in the case\nof a time independent Hamiltonian, the stationary solution of Eq. (2.21) will not depend\non the overall amplitude γ of the coupling Hamiltonian (if γ is sufficiently small for lowest\n11\n\n\forder perturbation theory to be valid). In contrast to the time-independent case, however,\nm\nthe solution will depend on the rates Rjj\n′ and thus on the precise form of the coupling\n\nHamiltonian Hsb , as noted in [11].\n\nIII.\n\nISOLATED WEAKLY AVOIDED CROSSING\n\nAs a function of the strength of the driving field λ the quasienergy spectrum of Floquet systems is generally pervaded by weakly avoided crossings, near which quasienergy\nseparations are small and the Floquet states are rapidly varying. These features can have\nimportant consequences for the density matrix. We consider a finite set of Floquet states\nfor which, in the neighborhood of the driving field strength λ being studied, there is a single\nweakly avoided crossing, with small quasienergy splitting ∆ at the center of the crossing\nat λ0 near λ. At the same time all other quasienergy separations at λ are assumed to be\nlarge compared to the appropriate measure of the coupling strength to the bath. Then only\nthe two Floquet states involved in the weakly avoided crossing are sensitive functions of λ\nover the small crossing region. For very weak coupling to the bath compared with ∆ we\nknow from the results of Sec. IIB that ρ is diagonal in the basis of those Floquet states. In\ncontrast to the time independent case, where the density matrix elements depend only on\nthe state energies, here it will change rapidly as the Floquet states do, not only within the\nsubspace of the states of the avoided crossing but, as we will show, in general throughout\nthe rest of the density matrix, as well. In the opposite limit, when the system-bath interaction effectively broadens those two states by much more than ∆, we will show that there\nis little influence from the crossing on the density matrix (in a λ-independent basis) or on\nthe statistical properties of the system determined therefrom. This will allow us in the next\nsection to extend our analysis to many driven systems for which the quasienergy spectrum\nis dense, as is often the case in practice.\nWe review briefly the description of the states and quasienergies in the neighborhood\nof such a weakly avoided crossing, introducing the notation which will be used later. We\nassume that within a suitably small neighborhood of driving strengths around λ0 the timeperiodic parts |u1 (t)i and |u2 (t)i of the unperturbed \"diabatic\" states (i.e., if there were no\navoided crossing) do not depend significantly on λ, and that the unperturbed quasienergies\nare locally linear in λ with slopes σ1 and σ2 , respectively. Then, the quasienergies and the\n12\n\n\ftime-periodic part of the Floquet states can be well described by the results of diagonalizing\na 2 × 2 Hamiltonian matrix (the Floquet analog of nearly degenerate perturbation theory,\nusing the extension of Rayleigh-Schrödinger perturbation theory developed by Sambé [17]).\nThe quasienergies are given by\nεa,b = ε0 +\n\n1q\n(σ1 + σ2 )\n(λ − λ0 ) ±\n(σ1 − σ2 )2 (λ − λ0 )2 + ∆2 ,\n2\n2\n\n(3.1)\n\nwhere the indices a, b refer to the two \"adiabatic\" Floquet states continuous in λ, and ∆\nis the minimum quasienergy splitting, at the center of the crossing, where λ = λ0 . This is\nshown schematically in Fig. 1. The adiabatic states a and b exchange their character when\nλ is varied, while by assumption the diabatic states 1 and 2 remain unchanged.\nWe define the dimensionless distance d from the avoided crossing at λ = λ0 as\nd ≡ (λ − λ0 )(σ1 − σ2 )/∆,\n\n(3.2)\n\nthe ratio of the quasienergy separation of the unperturbed states at λ to the gap ∆. The\ncentral region of the avoided crossing is thus given by |d| < 1.\n\ne\n\na\ne0\n\nD\n\n1\n2\n\nb\n\nl0\n\nl\n\nFIG. 1: Behavior of quasienergies around an avoided crossing of size ∆. The dashed lines show\ndiabatic (unmixed) states 1, 2 and the solid curves the adiabatic Floquet states a, b.\n\nA.\n\nDiabatic basis and effective rate Rac\n\nOver the narrow range of the weakly avoided crossing the diabatic states |u1 (t)i and\n|u2 (t)i, as well as the time periodic parts of all other Floquet states, are approximately\n13\n\n\findependent of λ, so they constitute a natural fixed basis of time periodic functions to\nuse in studying this region. In Appendix C we derive the set of rate equations for the\nreduced density matrix elements ρij in this diabatic basis. Quite strikingly, under a number\nof plausible assumptions, they allow for a separate determination of the diagonal and offdiagonal elements. The former are simply given by\n0 = ρii\n\nX\nj\n\nR̄ij −\n\nX\n\nρjj R̄ji ,\n\n(3.3)\n\nj\n\nwhere the rates designated with a bar, R̄ij , are defined in the diabatic basis in analogy to\nEq. (2.22), except for\nΓ\n,\n(3.4)\n+ (Γ/∆)2\nwith the superscript on Rac a reminder that this is an effective rate associated with the small\nR̄12 = R̄21 = Rac ≡\n\n4d2\n\nquasienergy separation near the avoided crossing (ac). Here we have introduced the symbol\nΓ≡\n\nX′\nk\n\n(R̄1k + R̄2k ) + R̄11 + R̄22 − 2R̄11;22 ,\n\n(3.5)\n\nwhere the prime on the summation denotes the restriction k 6= 1, 2. (Note that the sum\nof the last 3 terms is positive, in spite of the minus sign; by definition they can be written\n2πγ 2\n\nm [A11 (m)\n\nP\n\n− A22 (m)]2 g(−mω).) The rate Γ will turn out to be the relevant coupling\n\nto the heat bath, specific to the crossing of states 1 and 2, that will be the measure of\nwhether that coupling can be considered weak or strong relative to the quasienergy splitting\nof those states.\nThese equations (3.3) for the diagonal density matrix elements ρij in the diabatic basis\nhave exactly the formal structure of the corresponding equations in the limit of bath coupling\nsmall compared to all quasienergy splittings, Eq. (2.21). The results differ from that simpler\nsituation in three essential ways:\n(i) The effective rates Rac between the two special states 1 and 2 are not simply the\nsecond order rates imposed directly by the bath. They reflect the mixing in a more complex\nway, effectively including the driving induced coupling to all orders, and they can be simply\ndetermined from the rate Γ defined in Eq. (3.5) and the properties of the avoided crossing,\nnamely the distance d and the minimal quasienergy splitting ∆.\n(ii) The dependence on the parameter λ, which in the original adiabatic basis strongly\naffects a great number of rates, appears in the diabatic basis only in the single rate Rac (see\nEq. (3.4), where the distance from the avoided crossing, d, is linearly related to λ).\n14\n\n\f(iii) These are not the only density matrix elements; there exist also two non-vanishing\noff-diagonal elements ρ12 and ρ21 = ρ∗12 in this diabatic basis, given by\nρ12 =\n\nρ11 − ρ22\n.\n2d − iΓ/∆\n\n(3.6)\n\nTheir importance can be assessed by a comparison of the absolute value of ρ12 to the sum\nof the positive and real values ρ11 and ρ22 :\n|ρ12 |\n|ρ11 − ρ22 |\n∆\n1\nq\n=\n≤ ,\nρ11 + ρ22\nρ11 + ρ22 4d2 + (Γ/∆)2\nΓ\n\n(3.7)\n\nwhich is negligible in the limit Γ ≫ ∆, (that is, where the coupling to the heat bath is\nstronger than the minimum quasienergy separation of the Floquet states). This demonstrates\nthat in this limit the density matrix in this two-dimensional subspace is approximately\ndiagonal in the diabatic basis. In the opposite limit, the density matrix in the subspace is\nnearly diagonal in the adiabatic Floquet basis. The appropriate basis to diagonalize ρ is\ngiven in general in Appendix D.\nAlthough we have no general analytic solution of the equations (3.3) for the diagonal\ndensity matrix elements, we can say a good deal about the consequences of a weakly avoided\ncrossing, as the relevance of the effective rate Rac depends crucially on the ratio of the bathinduced rate Γ to the size of the avoided crossing ∆.\n\n1.\n\nΓ≪∆\n\nIn this limit (which is just the case discussed in Sec. IIB above) the rate Γ characterizing\nthe coupling to the heat bath is even smaller than the quasienergy splitting at the weakly\navoided crossing. Consequently, the effective rate Rac , Eq. (3.5), is much larger than Γ in\nthe center of that crossing,\nRac (d = 0) ≫ Γ.\n\n(3.8)\n\nThe immediate consequence of this large effective rate is that the diagonal density matrix\nelements ρ11 ≈ ρ22 become equal there, which may drastically change all other weights ρjj ,\ncoupled directly or indirectly via Eq. (3.3) to ρ11 or ρ22 , relative to the corresponding values\njust outside the avoided crossing. An explicit example demonstrating such a drastic change\nfor the entire density matrix is studied in Sec. III B.\n15\n\n\fThe off-diagonal matrix element ρ12 is not necessarily small, though, since it is given\nby the product of one large and one small factor; see Eq. (3.6). In fact, as discussed in\nAppendix D, the off-diagonal element is negligible in the adiabatic basis only.\n\n2.\n\nΓ≫∆\n\nIn this limit the rate Γ induced by the coupling to the heat bath is stronger than the\nsize of the weakly avoided crossing. Consequently, the effective rate Rac , Eq. (3.5), is much\nsmaller than Γ throughout the whole range of the avoided crossing,\nRac ≪ Γ.\n\n(3.9)\n\nThis suggests that the effective rate Rac due to the avoided crossing has negligible influence\ncompared to the other rates affecting states 1 and 2. Therefore the entire density matrix\nis not affected by the existence of the weakly avoided crossing. The off-diagonal matrix\nelement ρ12 is negligible in this limit.\nThere is an exception to the above conclusion if the two sums\n\nP′\n\nk\n\nR̄1k and\n\nP′\n\nk\n\nR̄2k con-\n\ntributing to Γ have vastly different magnitudes. This is possible, as we are explicitly looking\nat a very weakly avoided crossing, and this typically arises from such dissimilar pairs of\nstates, such as those arising from undriven states one of which is of low and the other of\nvery high energy. In what follows we will take state 2 to be the one with higher average\nenergy hHs i. There are two cases:\n•\n\nP′\n\nk\n\nR̄2k ≪ Rac ≪\n\nP′\n\nk\n\nR̄1k : This case may occur if the heat bath is dominated by\n\nphonons (or by other bosons) with an upper energy limit ωD , small compared to the\n\nseparation in average energy of the diabatic state 2 and its neighbors, so that state 2\nwill decay primarily to state 1, with flux ρ22 Rac . Similarly, state 2 is fed primarily by\nthe direct process from state 1 with flux ρ11 Rac (in the extreme limit of all R̄j2 = 0,\nonly by this process). Since stationarity demands that the incoming and the outgoing\nflow for state 2 are equal, one finds ρ11 ≈ ρ22 , with corresponding large changes in\nother state occupations ρjj . This modification of the density matrix occurs for all\nvalues of d and Γ/∆ for which the presumed rate inequalities hold. Values of those\nparameters can be significantly larger than unity, but eventually large enough values\nwill reduce Rac to the point where the lower inequality is violated.\n16\n\n\f•\n\nP′\n\nk\n\nR̄1k ≪ Rac ≪\n\nP′\n\nk\n\nR̄2k : This case may occur when the heat bath is dominated by\n\nthe electromagnetic radiation field, with photons of arbitrarily high energy and large\ndensity of states. Then state 2, essentially a high energy undriven state, will decay\nrapidly. By precisely the same argument used in the previous case, ρ11 ≈ ρ22 , and\n\nstates now strongly connected to 2 acquire substantial occupancy. Again, the ranges\nof d and Γ/∆ over which this situation holds can be large.\n\nB.\n\nA simple example\n\nIt is instructive to obtain specific results for a simple, albeit somewhat artificial, example\nof a system. We assume first that for Floquet states labeled by some index, n = 1, 2, . . . N,\nthe thermal bath leads to coupling only of neighboring states - i.e., the only non-zero rates\nare of the form Rn,n±1 , as shown in Fig. 2, and that we are in the limit of coupling to the bath\nweak with respect to all quasienergy differences. In this special situation the lowest state 1\nhas to be in detailed balance with state 2 and from this it follows that all states are in detailed\nbalance. If we make the specific choice Rn,n−1 = Rd and Rn,n+1 = Ru , each independent of n,\nand denote the ratio Ru /Rd ≡ γ < 1, then the occupations pn ≡ ρnn = (1 − γ)γ n−1 /(1 − γ N )\nfall off exponentially with the index n. We assume N to be sufficiently large that we can\nneglect (for algebraic simplicity) the factor γ N below.\nNow we want to study how these occupations change if there is a single weakly avoided\ncrossing of states n1 and n2 (in the previous section these were the states called 1 and 2).\nThis introduces the additional rate Rac . It simplifies the algebra to define the fluxes between\nstates n and n − 1,\nFn,n−1 ≡ pn Rn,n−1 − pn−1 Rn−1,n ,\n\n(3.10)\n\nin terms of which we can rewrite the basic equations derived above for the diagonal density\nmatrix elements, (3.3), as\n(pn1 − pn2 )Rac = Fn2 ,n2 −1 − Fn2 +1,n2\n\n(3.11)\n\n(pn1 − pn2 )Rac = Fn1 +1,n1 − Fn1 ,n1 −1\n\n(3.12)\n\n0 = Fn+1,n − Fn,n−1\n0 = F2,1 .\n\nfor\n\nn 6= n1 , n2\n\nand n 6= 1\n\n(3.13)\n(3.14)\n\n17\n\n\fTheir solution is\nFn,n−1 =\n\n\n\n\n\n\n\n\n\n\n\n\n\nwith\n\n0 ; n ≤ n1\n\nF ; n1 < n ≤ n2 ,\n\n(3.15)\n\n0 ; n > n2\n\nF = (pn1 − pn2 )Rac ,\n\n(3.16)\n\nbeing the flux from n1 to n2 due to the avoided crossing. This result is illustrated in Fig. 2.\nThe states above n2 and the states below n1 are still in detailed balance - i.e. Fn,n−1 = 0,\nas without the avoided crossing. The states from n1 to n2 , however, are no longer in detailed\nbalance and there is a stationary flux F connecting them, due to the avoided crossing.\nn2+1\nn2\n\nF\n\nF\nn2-1\nF\nn1+1\nF\n\nn1\nn1-1\n2\n1\n\nFIG. 2: Simple example with a thermal bath coupling neighboring states only (double headed\narrows) and flux F introduced by the effective rate Rac due to an avoided crossing of states n1 and\nn2 .\n\nFor the occupations pn we find\n\npn =\n\n\n\n\np1 γ n−1\n\n\n\n\n\n\n\n\n\n\n\n; n ≤ n1\n\nr+γ n−n1\n\npn1 r+1\n\n\n\n\n\n\n\n\n\n\n\n p γ n−n2\nn2\n\n18\n\n; n1 < n ≤ n2 ,\n; n > n2\n\n(3.17)\n\n\fwith\n\nRac 1 − γ n2 −n1\n,\nRd 1 − γ\nP\nand p1 determined by the normalization n pn = 1.\nr≡\n\n(3.18)\n\npn\n\n1\n\nn2\n\nn1\n\nn\n\nFIG. 3: Dramatic change in occupations pn with (solid curve) and without (dashed curve) avoided\ncrossing.\n\nThe parameter r measures the ratio of the effective rate Rac describing the direct connection of the state n2 to the state with which it is crossing, namely n1 , relative to its rate\nof loss Rd to the state directly below it, times a factor of order one. There are three distinct\ninteresting ranges of r in terms of the behavior of the density matrix elements:\n(i) When r ≫ 1 we have pn2 ≈ pn1 and almost constant weights between n1 and n2 . The\nweights of states above n2 are much larger than they would be without the avoided crossing,\ndue to the drastically increased weight pn2 , which is being fed directly by n1 .\n(ii) For γ n2 −n1 ≪ r ≪ 1 we have pn2 ≈ pn1 r, still a much higher occupancy than in the\nabsence of the avoided crossing. Again the weights of states above n2 are much larger than\nthey would be without the avoided crossing. This case, with r only slightly less than 1, is\nsketched in Fig. 3.\n(iii) If r decreases still further, r ≪ γ n2 −n1 , then pn ≈ p1 γ n−1 , which is the result without\nthe avoided crossing. Equilibration with the bath will be completely dominated by the\ntransition processes along the ladder of states.\nThis model admittedly has some special features which make it soluble. For instance,\nthere is detailed balance in the absence of an avoided crossing. But it illustrates the dramatic\nchange in all occupations due to a single avoided crossing.\n19\n\n\fIV.\n\nLIMIT OF INFINITE DIMENSIONAL HILBERT SPACE\n\nAs we have already noted, there are some interesting Floquet systems, such as finite spin\nsystems, which are limited to a space spanned by a finite number of basis states. Their\nstatistical mechanics can then be calculated (numerically) from the equations and analysis\nof the previous sections of this paper (and we will not be concerned with them further here).\nHowever, many others, like a particle confined by a potential well, have eigenstates spanning\ninfinite Hilbert spaces, with a quasienergy spectrum which becomes dense and Floquet states\nwhich change rapidly as the basis size N increases, so that the above results do not readily\napply. In fact, our results also permit the calculation to any desired accuracy of many of\nthese, as well, by appropriate truncation of the basis set, as we now show.\nWe limit ourselves to systems with an unbounded discrete spectrum of undriven energy\neigenstates. We take the truncated Hilbert space spanned by the N lowest energy eigenstates,\nthe usual choice made in numerical calculations. Within this approximation the Floquet\nstates of the isolated system (at any fixed time) are confined to that finite dimensional space.\nFor the undriven system the statistical (Boltzmann) weights of the states neglected by the\ntruncation can be made arbitrarily small by a suitably large choice of the energy cutoff. We\nnow increase the Hilbert space accessible to the driven system by the addition of the (N +1)st\nundriven energy eigenstate. With increasing λ, as its quasienergy nears that of one of the\noriginal N Floquet states, it will mix significantly with that state. But we have shown above\n(section III A 2) that, if the corresponding avoided crossing is sufficiently weak, ∆ ≪ Γ, then\nthe reduced density matrix is approximately diagonal in the unmixed diabatic states, and the\naddition of the new state to the basis set remains of little statistical significance. Therefore,\nif we can demonstrate that all of the states neglected by the truncation of high energy\nundriven eigenstates mix with those retained only through such weakly avoided crossings,\nthen we can choose the energy cutoff of the basis to obtain statistical properties to any\ndesired accuracy.\nIndeed, this desired behavior of the quasienergy of a Floquet state arising from a high\nenergy undriven eigenstate has been seen in numerical calculations [1]. Such a state is\nfound to mix with the Floquet states that arise from low energy undriven eigenstates, as\nλ increases, only near weakly avoided crossings. In the appendix of Ref. [12] we have\nanalytically demonstrated the effect explicitly, with an exponential decrease with basis size\n20\n\n\fN of newly introduced quasienergy gaps, for systems whose undriven energy eigenvalues\nabove some level exhibit increasing spacings between successive levels (such as a particle\nconfined by a one-dimensional potential which increases faster than harmonically). This\ncan be rationalized in terms of a perturbation expansion: an increasingly large number of\ndriving field quanta is needed to connect to higher lying states, which are modified only in\nincreasingly higher order perturbation theory. More generally, numerical studies [13] suggest\nthat once the first N undriven states have been included in the basis, the Floquet states\narising from the first N ′ of these, for suitably large N − N ′ , are affected by further extension\nof the basis set only by weakly avoided crossings. Again, perturbation theory suggests that\nthis is a reflection of the very different spatial behavior of these states.\nFor a class of periodically driven systems in an infinite Hilbert space we earlier found [12]\nmany anomalies due to the infinite number of ever more weakly avoided crossings. The\npresent results show that these anomalies, and the non-convergence of the Floquet states\nwith increasing basis size, lead to negligible consequences for the reduced density operator,\nor for the statistical properties calculated therefrom, when the system is in fixed weak contact\nwith a thermal bath.\nIn practice, one has to determine the quasienergy spectrum for increasing basis size N\nuntil (i) newly appearing avoided crossings are small enough, ∆ ≪ Γ, and (ii) the statistical\n(Boltzmann) weight of the newly introduced states, plus that of all neglected states, is small\nenough to achieve the desired accuracy. Once the basis size N is appropriately chosen,\none can use Eq. (2.20) to determine the density matrix elements and calculate statistical\nproperties.\nIt is important to recognize that, because of the requirement ∆ ≪ Γ for avoided crossings\nwith all neglected basis states, the minimum truncation size N depends in general on the\nmagnitude, as well as the form, of the system-bath coupling, since both enter the determination of Γ. Indeed, the full statistical properties of the Floquet system will depend on\nthat magnitude (we have already emphasized in Sec. IIB the general dependence on the\nform of the coupling), even if the coupling is very weak: For a given magnitude we choose\nN to achieve a desired accuracy. We now reduce the magnitude (keeping the form fixed)\nsufficiently that Γ becomes less than one of the gaps ∆ associated with an avoided crossing of a state neglected by the truncation with a state that has been retained. Then that\navoided crossing becomes no longer irrelevant. It leads to a large rate Rac , Eq. (3.4), that\n21\n\n\fmay cause quite different statistical weights, as was explicitly shown for the simple example\nin Sec. III B. We can understand this as the appearance of a new, high order, near resonance\nwhich is no longer disrupted by the bath interaction, resulting in the appreciable occupation\nof the upper (higher average energy) level of that pair, and modifying the statistical weight\nof the states to which it is connected.\nThis is emphatically not to suggest the lack of a well-defined statistical behavior of a\nFloquet system with given coupling to a bath. Indeed, the above procedure describes how\nthat is to be calculated to any desired accuracy. However, the behavior does depend on\nthe specific magnitude and form of that coupling, in sharp contrast to the situation for\nconventional time-independent statistical mechanics.\n\nV.\n\nCONCLUSION\n\nWe have derived the general equations (2.20) for the reduced density matrix, in the\nstationary state, of Floquet systems with weak but finite coupling to a heat bath, previously\ndiscussed [4, 7, 9, 11] only for situations where all quasienergy spacings were large compared\nwith the coupling to the bath (and therefore only for systems restricted to a finite number\nof states). New and interesting results give a prescription for practical calculation of the\nsteady state statistical properties of many realistic Floquet systems, including ones with\ndense quasienergy spectra.\nIf the coupling to the bath Γ is restricted only to be small compared to the driving\nfrequency ω and the inverse bath relaxation time 1/τc , the diagonal and off-diagonal matrix\nelements are approximately time-independent in the basis of the time-periodic parts of the\nFloquet states. In the special case of a Hilbert space truncated to finite dimensions and\nthe coupling weak compared to all quasienergy separations, then the equations simplify and\nare equivalent to those discussed in [11] and [9]. The density matrix is diagonal, but the\nvalues of the diagonal elements (occupation probabilities of the Floquet states) depend on\nthe detailed form (though not on the magnitude, as long as it is sufficiently weak) of the\ncoupling of the system to the bath.\nWeakly avoided crossings, where quasienergies become nearly degenerate, are a pervasive\nfeature of Floquet systems. Therefore, we have analyzed in detail the general density matrix\nequations in such regions. The rate equations for diagonal density matrix elements in the\n22\n\n\fdiabatic basis, Eq. (3.3), are shown to be identical to those well away from the crossing and\nwith arbitrarily weak coupling to the heat bath, except that the avoided crossing introduces\na new effective rate Rac , defined in Eq. (3.4), between the diabatic states 1 and 2 of the\ncrossing. This rate depends on the effective coupling Γ of the states 1 and 2 to the heat\nbath, the distance d from the avoided crossing, and the relative strength of the coupling to\nthe heat bath, Γ/∆. In addition, significant off-diagonal density matrix elements ρ12 and\nρ21 may appear (see Eq. (3.6)).\nThe density operator changes drastically with λ in the neighborhood of an avoided cross< 1, if also the bath coupling is weak enough, Γ < ∆. Quite importantly, significant\ning, d ∼\n∼\nchanges occur in the weights not only of the states mixed in the crossing, but in those of\nmany other states, as well. At the center of the crossing the two states of the crossing pair\nacquire equal weight, in general a very different relative occupation from that outside the\ncrossing region, and this consequently modifies significantly the weights of the network of\nstates with which they interact, directly and indirectly, as described by the rate equations.\nThis is exhibited explicitly for the simple example worked out in Sec. IIIB, where the occupations of all states between those labeled n1 and n2 are strongly modified in this regime.\nOn the other hand, if the coupling to the bath is relatively large, Γ ≫ ∆, then physical\nintuition suggests that the interaction with the bath effectively broadens the quasienergy\ndispersion curves by more than the gap itself, such that the avoided crossing should have\nno consequences on the statistical properties of the system. We have shown that this is indeed the case, namely that the density matrix (in a λ-independent basis) remains virtually\nunaffected.\nHaving studied in detail Floquet systems spanned by a finite basis, we have looked at the\nconsequences when the size of the basis set increases without limit, as for a particle confined\nby an unbounded potential and driven periodically. We have concluded that, in many cases,\nthe important anomalies of such systems, including the appearance of an infinite number of\nweakly avoided crossings and the non-convergence of the Floquet states with increasing basis\nsize, play no important role for the physical properties of the system in contact with a heat\nbath, confirming our physical intuition. One can safely employ, in numerical calculations,\na finite suitably truncated basis set for such a system. However, a special feature of such\na Floquet system, which has a dense quasienergy spectrum, is that its statistical properties\ndepend in general on both the magnitude and the overall strength of the coupling between\n23\n\n\fthe system and the bath.\nThese calculations have been based on a perfectly periodic driving field. We recognize\nthat effects that we have neglected, notably fluctuations in amplitude and frequency of the\ndriving field, are similarly expected to wash out the effects of sufficiently weakly avoided\ncrossings. Those effects will be examined in a future publication.\n\nAcknowledgement\n\nWe thank S. Kohler and W. Wustmann for helpful discussions. RK thanks the Kavli\nInstitute for Theoretical Physics, Santa Barbara for hospitality. DH is grateful for the partial\nsupport of the Edward A. Dickson Emeriti Professorship and NSF Grant PHY05-51164.\n\nAPPENDIX A: VALIDITY OF LOWEST ORDER BORN APPROXIMATION\n\nIn the still exact Eq. (2.4) we have made the lowest order Born approximation by using\nthe factorization Eq. (2.5) of the total density matrix directly on the right hand side of that\nequation. In order to check the validity of this approximation, we analyze in this appendix\nthe fourth order correction arising from the factorization of the total density matrix only in\nthe first iterate of Eq. (2.4), namely\n+\n−\n\nZ\n\nt\n\ndt\n\n0\n\nZ\n\n0\n\n′\n\nt\n\ndt′\n\nZ\n\nt′\n\ndt\n\n0\n\nZ\n\n0\n\n′′\n\nt′\n\ndt′′\n\nt′′\n\nZ\n\n0\n\nZ\n\n0\n\nt′′\n\nh\n\nh\n\nh\n\nh\n\ndt′′′ Trb H̃sb(t), H̃sb (t′ ), H̃sb (t′′ ), H̃sb(t′′′ ), ρ̃(t′′′ ) ⊗ ρb\nh\n\nh\n\ndt′′′ Trb H̃sb (t), H̃sb (t′ ), Trb\n\n\u0010h\n\nh\n\niiii\n\nH̃sb (t′′ ), H̃sb (t′′′ ), ρ̃(t′′′ ) ⊗ ρb\n\n(A1)\nii\u0011\n\n⊗ ρb\n\nii\n\nEach of these two terms has the structure of three nested time integrals, with a sum of\nintegrands from the nested commutators (the terms differing only by the order of the factors),\neach of which is a product of 4 system operators and a fourth order correlation function of\nthe bath. A representative such bath correlation function is\nhB̃(t)B̃(t′ )B̃(t′′ )B̃(t′′′ )i − hB̃(t)B̃(t′ )ihB̃(t′′ )B̃(t′′′ )i\n\n(A2)\n\n= hB̃(t)B̃(t′′ )ihB̃(t′ )B̃(t′′′ )i + hB̃(t)B̃(t′′′ )ihB̃(t′ )B̃(t′′ )i\n\n(A3)\n\n= G(t − t′′ )G(t′ − t′′′ ) + G(t − t′′′ )G(t′ − t′′ ),\n\n(A4)\n\nwhere the equality of (A3) to (A2) makes use of the generalized Wick theorem [18]. The\nfinal pair of correlation function products (A4) has the important property that in each of\n24\n\n\fthe two terms the time intervals overlap. (The only combination where this is not the case\nis explicitly subtracted in (A2).) Thus all three times appearing in the integrals, t′ , t′′ , and\nt′′′ , must be close to t in order to give an important contribution, since G(τ ) is significant\nonly for τ < τc . This same condition holds for all contributions to the fourth order term.\nEach such term has an upper limit given by\nΓ4 ≡ γ 4 τc3 hA4 ihB 2 i2 ,\n\n(A5)\n\nwhich compared to the magnitude of the second order rate Γ2 is small if the weak coupling\ncondition, τc Γ2 ≪ 1, Eq. (2.10), is fulfilled, namely that during the bath correlation time\nτc the impact of the second order terms is small; Eq. (2.10) is itself sufficient to ensure the\nsmallness of higher order corrections.\nA more restrictive condition, Γ2 < εij for all i, j, was imposed in Ref. [7], namely that the\nsystem-bath coupling must be smaller than the smallest quasienergy splitting. In contrast,\nthe above estimate of the fourth order term shows that larger system-bath couplings with\nΓ2 > εij can equally well be treated with the present approach, as long as the weak coupling\ncondition, Eq. (2.10), is fulfilled.\n\nAPPENDIX B: VALIDITY OF TIME AVERAGING OF THE RATES\n\nThe replacement of rates by their averages over a driving period (see Eq. (2.19) and\nthe sentence preceding it) relies on the assumption that the density matrix elements do\nnot vary substantially over that period, T = 2π/ω. At first glance this seems to be wrong\nas, e.g., an off-diagonal density matrix ρij (t) with an associated quasienergy difference εij ,\nthat can be as large as ω, would have in the absence of the coupling to the heat bath a\nsubstantial variation over the time T . But it will turn out that such off-diagonal matrix\nelements (corresponding to large quasienergy differences) are in fact small at large times.\nWe use the observation that the set of differential equations (2.18) is linearly coupled\nand has time-periodic coefficients Rlj;ki (t) with period T . Thus one can apply the Floquet\ntheorem, which requires the general solution to be of the form\nρij (t) =\n\nX\n\nan eλn t rij;n (t),\n\n(B1)\n\nn\n\nwith time-periodic functions rij;n (t + T ) = rij;n (t), and eλn T an eigenvalue of the timeevolution operator for all density matrix elements over one period. (The λn are assumed\n25\n\n\fhere to be non-degenerate.) This solution is in general not periodic in time.\nIn the following we are interested in the solution for large times. All solutions with\nRe(λn ) < 0 decay to zero in this limit and are of no further interest. From the general\nproperties of a density matrix, 0 ≤ ρii ≤ 1 and |ρij |2 ≤ ρii ρjj ≤ 1, it follows that solutions\nwith Re(λn ) > 0 are impossible. So we are left with discussing solutions with Re(λn ) = 0.\nFor the trace of the density matrix to be 1, i.e. time-independent and nonzero, there must\nbe a solution λ0 = 0. Thus we have a stationary solution for the density matrix elements\nρij (t) = rij;0 (t),\n\n(B2)\n\nwhich is time-periodic, with at least some diagonal components which have non-zero time\naverages. (We cannot exclude that in addition to this, there is a traceless quasiperiodic\nsolution from pairs of purely imaginary λn . As its time average would be zero, we ignore it\nin the following.)\nWe now expand this stationary time-periodic solution in Fourier coefficients\nρij (t) =\n\nX\n\nρij (K)eiKωt ,\n\n(B3)\n\nK\n\nso that the above differential equations (2.18) reduce, for each of the Fourier components,\nto\n− i(εij + Kω)ρij (K) =\n\n1 Xh\n∗\nρlj (K − M)Rik;lk (M) + ρil (K − M)Rjk;lk\n(−M) (B4)\n2 k,l,M\n\n∗\n− ρkl (K − M)(Rlj;ki (M) + Rki;lj\n(−M))\n\ni\n\nThe right hand side is second order in the small system-bath coupling constant γ, because\neach rate factor (2.15) is. Although we are explicitly concerned with couplings which are\nnot arbitrarily weak with respect to the smallest quasienergy differences in the problem, we\ndo want to consider, as in the conventional static case, coupling which is weak on higher\nenergy scales, such as the driving frequency ω. Then for non-zero values of K the necessary\nsmallness of the left hand side of (B4) must be achieved by the smallness of ρij (K), and it is\nconsistent to neglect all such components of the density matrix in the solution; we will set\nρij (K 6= 0) = 0,\n\n(B5)\n\nand we will simply write ρij for ρij (K = 0), which is by definition time independent. (We\npoint out that this implies a time-periodic density operator for large times, as one would\n26\n\n\fexpect physically.) This time independence of ρij at large times then implies in (B4) that\nonly M = 0 terms appear - i.e., that the complex rates R can be replaced by their time\naverages R(M = 0). (Note that for a quasienergy difference εij ≈ ±ω between a Floquet\nstate close to the lower boundary and a state close to the upper boundary of the chosen\nstrip 0 ≤ ε < ω, one would need to choose K = ∓1 in Eq. (B4) or choose a conveniently\ndisplaced strip.)\n\nAPPENDIX C: DERIVATION OF THE EFFECTIVE RATE Rac\n\nIn this appendix we derive the rate equations for the reduced density matrix elements\nin the diabatic basis of an isolated weakly avoided crossing in the stationary limit. This\nleads to an effective rate Rac , which expresses the entire λ-dependence related to an avoided\ncrossing.\nStarting from the operator equation (2.8) one follows the steps leading to Eq. (2.20), but\nnow in the diabatic basis of the avoided crossing, which is related to the adiabatic basis by\n\nwith α =\n\n|ua(t)i = α|u1(t)i + β|u2(t)i\n\n(C1)\n\n|ub(t)i = β|u1(t)i − α|u2(t)i\n\n(C2)\n\nq\n√\n√\n2\n(1 + d/ 1 + d )/2, β = (1 − d/ 1 + d2 )/2 and d, the dimensionless distance\n\nq\n\nfrom the center of the avoided crossing, is defined in Eq. (3.2). This basis change alters the\nleft hand side of Eq. (2.20), as the coherent dynamics is less conveniently described in the\ndiabatic basis. The right hand side is left invariant, but now with rates in the diabatic basis,\nand can be simplified with the following assumptions:\n1. We assume that the avoided crossing is sufficiently weak and isolated within the\nquasienergy spectrum, such that we can neglect any dependence of diabatic states\n1 and 2 on the driving amplitude λ, valid over a sufficiently limited range of λ near\nλ0 . We assume the same for all other Floquet states, such that the diabatic basis is\nindependent of λ within that range.\n2. All other quasienergy separations near λ = λ0 are assumed to be much larger than\nthe splitting ∆ as well as larger than the effective coupling to the bath, such that all\noff-diagonal density matrix elements can be neglected, except for ρ12 and ρ21 .\n27\n\n\f3. We define rates Rij;kl in the diabatic basis in analogy to Eqs. (2.19) and (2.15), where\nthe λ dependence appearing in the quasienergies ε1 and ε2 is neglected in the neighborhood of the avoided crossing. That is, the Fourier transformed bath correlation\nfunction g(ε − mω) is taken to be constant over this very small range of ε. This is a\ngood approximation as long as ∆τc ≪ 1 holds, which is the case for the weakly avoided\ncrossings we are interested in. Together with assumption 1 this makes the rates Rij;kl\nindependent of λ.\n4. We set A12 (m) = A21 (m) = 0 (see Eq. (2.13)), as we assume that the spatial structures\nof states 1 and 2 are very different. We are explicitly looking at a very weakly avoided\ncrossing, and this typically arises from such dissimilar pairs of states, such as those\narising from undriven states one of which is of low and the other of very high energy.\nSimilarly, any other state j cannot be spatially similar to 1 and 2 simultaneously,\nleading to A1j (m)A2j (m) = 0.\n5. For simplicity we restrict the discussion to periodic drivings that are symmetric, i.e.\nHs (t) = Hs (−t). This makes the rate R22;11 , which appears in the definition of Γ in\nEq. (3.5), real.\nFor the density matrix in the subspace of states 1 and 2 we find\n∆ Im(ρ12 ) = −ρ11\n−∆ Im(ρ12 ) = −ρ22\nh\n\ni\n\nX\n\nR1k +\n\nk\n\nX\n\nX\n\nρkk Rk1\n\n(C3)\n\nρkk Rk2\n\n(C4)\n\nk\n\nR2k +\n\nk\n\ni∆ (ρ11 − ρ22 ) − 2dρ12 = ρ12 Γ\n\nX\nk\n\n(C5)\n\nwith the symbol Γ introduced in Eq. (3.5).\nThe third equation expresses the off-diagonal element ρ12 in terms of the diagonal elements, as explicitly written in Eq. (3.6). Consequently, the left hand side of the first two\nequations can be written in terms of the diagonal elements,\n∆ Im(ρ12 ) = Rac (ρ11 − ρ22 )\n\n(C6)\n\nwhere we use the notation Rac introduced in Eq. (3.4). We now redefine the effective rates\nR̄ij in the diabatic basis, equal to the original rates Rij except for R̄12 = Rac and similarly\nR̄21 = Rac (note R12 = 0 by assumption 4 above). This allows us to rewrite the first two\n28\n\n\fequations in the standard rate equation form, as if there were just diagonal density matrix\nelements: Eq. (3.3).\n\nAPPENDIX D: DIAGONALIZING THE DENSITY MATRIX\n\nIt is instructive to ask in which basis the reduced density matrix is diagonal near a weakly\navoided crossing, and whether this is close to the diabatic 1, 2 basis above, or close to the\na, b basis of the Floquet states. The relevant sector of the density matrix in the 1, 2 basis is\ngiven by\n\n\nwith\n\nρ=\n\n\nρ11\nA∗ (ρ11 − ρ22 )\n\n\n\nA(ρ11 − ρ22 ) \nρ22\n\n,\n\n(D1)\n\n1\n.\n2d − iΓ/∆\n\nA=\n\n(D2)\n\nIt is diagonal in the basis of the two states\n\n\ns\n\nA\n1\n1+\n|ud1 i = \n|A|\nz\n\n\n|u1 i +\n\ns\n\n1\nA\n1−\n|ud2 i = −\n|A|\nz\n\ns\n\n|u1 i +\n\n1\n1−\nz\n\ns\n\n1\n1+\nz\n\n\n\n√\n|u2i / 2\n\n(D3)\n\n\n\n√\n|u2 i / 2,\n\nwith\nz=\n\nq\n\n1 + 4|A|2 ,\n\n(D4)\n\nleading to diagonal elements\nρd1,d1 = [ρ11 (1 + z) + ρ22 (1 − z)]/2\n\n(D5)\n\nρd2,d2 = [ρ11 (1 − z) + ρ22 (1 + z)]/2.\n\n(D6)\n\nOne can check that this gives the expected result in two limiting situations:\n• Far from the avoided crossing, d ≫ 1, or for Γ ≫ ∆ , the effective rate Rac between\nstates 1 and 2 becomes small, we have A → 0 and z → 1, and we regain the 1,2 basis\nas that in which the reduced density matrix is diagonal.\n• For weak coupling, Γ ≪ ∆ and near the avoided crossing, d ≪ 1, we have z ≫ 1. It is\nimmediately clear that at the center, where d → 0, the appropriate basis states for a\n29\n\n\fdiagonal density matrix become nearly the equal admixtures of states 1 and 2, which\nare the Floquet states a and b. In fact, this is the case for all d in this limit of weak\ncoupling to the bath; for infinitesimal Γ these states which diagonalize ρ are exactly\nthe Floquet states.\nWe can readily understand these two limits in terms of the balance between energy\npumping of the system by the periodic field and relaxation by the bath. For Γ ≪ ∆ the\nnear resonant periodic driving dominates, and the Floquet states in the absence of the bath\nare approximate solutions, only weakly relaxed. In the opposite limit, Γ ≫ ∆, those Floquet\nlevels are effectively broadened more by the bath interaction than their separation, and the\nmixing of the diabatic states is a perturbation on their relaxation by the bath.\n\n[1] H.P. Breuer, K. Dietz, and M. Holthaus, Z. Phys. D 10, 13 (1988); M. Holthaus and D. Hone,\nPhys. Rev B 47,6499 (1993).\n[2] H. Linke et al., Science 286, 2314 (1999); H. Schanz, M.-F. Otto, R. Ketzmerick, and T.\nDittrich, Phys. Rev. Lett. 87, 070601 (2001); S. Kohler, J. Lehmann, and P. Hänggi, Phys.\nRep. 406, 379 (2005).\n[3] F. Haake, Quantum Signatures of Chaos (Springer, New York, 2001).\n[4] R. Blümel, et al., Phys. Rev. A 44, 4521 (1991).\n[5] T. Dittrich, B. Oelschlägel, and P. Hänggi, Europhys. Lett. 22, 5 (1993); Acta Phys. Pol.\nB24, 845 (1993).\n[6] R. Graham and R. Hübner, Ann. Physics 234, 300 (1994).\n[7] S. Kohler, T. Dittrich, and P. Hänggi, Phys. Rev. E 55, 300 (1997); S. Kohler, R. Utermann,\nP. Hänggi, and T. Dittrich, Phys. Rev. E 58, 7219 (1998).\n[8] M. Grifoni and P. Hänggi, Phys. Rep. 304, 229 (1998).\n[9] H.P. Breuer, W. Huber, and F. Petruccione, Phys, Rev. E 61, 4883 (2000).\n[10] M. Thorwart, M. Grifoni, and P. Hänggi, Ann. Phys. (New York) 293, 15 (2001).\n[11] W. Kohn, J. Stat. Phys. 103, 417 (2001).\n[12] D.W. Hone, R. Ketzmerick and W. Kohn, Phys. Rev. A 56, 4045 (1997).\n[13] H.P. Breuer and M. Holthaus, Z. Phys. D 11, 1 (1989).\n[14] K. Blum, Density Matrix Theory and Applications (Plenum, New York, 1981).\n\n30\n\n\f[15] C. Cohen-Tannoudji, in Frontiers in Laser Spectroscopy, Les Houches Session XXVII, edited\nby R. Balian, S. Haroche, and S. Liberman (North Holland, Amsterdam, 1977), p. 1.\n[16] This is conventionally denoted the \"Born Approximaton\" in the literature, though it is not\nquite the same as the original approximation of that name in scattering theory .\n[17] H. Sambé, Phys. Rev. A 7, 2203 (1973).\n[18] A.L. Fetter and J.D. Walecka, Quantum Theory of Many-Particle Systems (McGraw-Hill, New\nYork, 1971) p. 237.\n\n31\n\n\f"}