{"id": "http://arxiv.org/abs/0806.0908v2", "guidislink": true, "updated": "2008-07-24T19:40:11Z", "updated_parsed": [2008, 7, 24, 19, 40, 11, 3, 206, 0], "published": "2008-06-05T06:03:34Z", "published_parsed": [2008, 6, 5, 6, 3, 34, 3, 157, 0], "title": "High frequency sound in superfluid 3He-B", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0806.3428%2C0806.1462%2C0806.2011%2C0806.2287%2C0806.1461%2C0806.1903%2C0806.2023%2C0806.1778%2C0806.2321%2C0806.2027%2C0806.2042%2C0806.1116%2C0806.4639%2C0806.0489%2C0806.3523%2C0806.3415%2C0806.3765%2C0806.3118%2C0806.3404%2C0806.3875%2C0806.1129%2C0806.3820%2C0806.0493%2C0806.1006%2C0806.3537%2C0806.3464%2C0806.2901%2C0806.0363%2C0806.3371%2C0806.0150%2C0806.4028%2C0806.2607%2C0806.1428%2C0806.3335%2C0806.3000%2C0806.2221%2C0806.1029%2C0806.3642%2C0806.0908%2C0806.2727%2C0806.3184%2C0806.2373%2C0806.3614%2C0806.4608%2C0806.1763%2C0806.4181%2C0806.3301%2C0806.2262%2C0806.1629%2C0806.3492%2C0806.2935%2C0806.1622%2C0806.0494%2C0806.4962%2C0806.1155%2C0806.3127%2C0806.0378%2C0806.0248%2C0806.4669%2C0806.4078%2C0806.4473%2C0806.1797%2C0806.0271%2C0806.4631%2C0806.2383%2C0806.3658%2C0806.0137%2C0806.0653%2C0806.3648%2C0806.4657%2C0806.0954%2C0806.2116%2C0806.3663%2C0806.2256%2C0806.4278%2C0806.2810%2C0806.3071%2C0806.2804%2C0806.2203%2C0806.4140%2C0806.3689%2C0806.0424%2C0806.0766%2C0806.3947%2C0806.1348%2C0806.0262%2C0806.4329%2C0806.1611%2C0806.4767%2C0806.0163%2C0806.4626%2C0806.3999%2C0806.0863%2C0806.0278%2C0806.2356%2C0806.0935%2C0806.1520%2C0806.4864%2C0806.1016%2C0806.2634%2C0806.1127&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "High frequency sound in superfluid 3He-B"}, "summary": "We present measurements of the absolute phase velocity of transverse and\nlongitudinal sound in superfluid 3He-B at low temperature, extending from the\nimaginary squashing mode to near pair-breaking. Changes in the transverse phase\nvelocity near pair-breaking have been explained in terms of an order parameter\ncollective mode that arises from f-wave pairing interactions, the so-called\nJ=4- mode. Using these measurements, we establish lower bounds on the energy\ngap in the B-phase. Measurement of attenuation of longitudinal sound at low\ntemperature and energies far above the pair-breaking threshold, are in\nagreement with the lower bounds set on pair-breaking. Finally, we discuss our\nestimations for the strength of the f-wave pairing interactions and the Fermi\nliquid parameter, F4s.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0806.3428%2C0806.1462%2C0806.2011%2C0806.2287%2C0806.1461%2C0806.1903%2C0806.2023%2C0806.1778%2C0806.2321%2C0806.2027%2C0806.2042%2C0806.1116%2C0806.4639%2C0806.0489%2C0806.3523%2C0806.3415%2C0806.3765%2C0806.3118%2C0806.3404%2C0806.3875%2C0806.1129%2C0806.3820%2C0806.0493%2C0806.1006%2C0806.3537%2C0806.3464%2C0806.2901%2C0806.0363%2C0806.3371%2C0806.0150%2C0806.4028%2C0806.2607%2C0806.1428%2C0806.3335%2C0806.3000%2C0806.2221%2C0806.1029%2C0806.3642%2C0806.0908%2C0806.2727%2C0806.3184%2C0806.2373%2C0806.3614%2C0806.4608%2C0806.1763%2C0806.4181%2C0806.3301%2C0806.2262%2C0806.1629%2C0806.3492%2C0806.2935%2C0806.1622%2C0806.0494%2C0806.4962%2C0806.1155%2C0806.3127%2C0806.0378%2C0806.0248%2C0806.4669%2C0806.4078%2C0806.4473%2C0806.1797%2C0806.0271%2C0806.4631%2C0806.2383%2C0806.3658%2C0806.0137%2C0806.0653%2C0806.3648%2C0806.4657%2C0806.0954%2C0806.2116%2C0806.3663%2C0806.2256%2C0806.4278%2C0806.2810%2C0806.3071%2C0806.2804%2C0806.2203%2C0806.4140%2C0806.3689%2C0806.0424%2C0806.0766%2C0806.3947%2C0806.1348%2C0806.0262%2C0806.4329%2C0806.1611%2C0806.4767%2C0806.0163%2C0806.4626%2C0806.3999%2C0806.0863%2C0806.0278%2C0806.2356%2C0806.0935%2C0806.1520%2C0806.4864%2C0806.1016%2C0806.2634%2C0806.1127&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present measurements of the absolute phase velocity of transverse and\nlongitudinal sound in superfluid 3He-B at low temperature, extending from the\nimaginary squashing mode to near pair-breaking. Changes in the transverse phase\nvelocity near pair-breaking have been explained in terms of an order parameter\ncollective mode that arises from f-wave pairing interactions, the so-called\nJ=4- mode. Using these measurements, we establish lower bounds on the energy\ngap in the B-phase. Measurement of attenuation of longitudinal sound at low\ntemperature and energies far above the pair-breaking threshold, are in\nagreement with the lower bounds set on pair-breaking. Finally, we discuss our\nestimations for the strength of the f-wave pairing interactions and the Fermi\nliquid parameter, F4s."}, "authors": ["J. P. Davis", "H. Choi", "J. Pollanen", "W. P. Halperin"], "author_detail": {"name": "W. P. Halperin"}, "author": "W. P. Halperin", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/s10909-008-9819-1", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0806.0908v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0806.0908v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "15 pages, 8 figures, accepted to J. Low Temp. Phys", "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0806.0908v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0806.0908v2", "journal_reference": "Journal of Low Temperature Physics, Volume 153, Numbers 1-2 /\n  October, 2008", "doi": "10.1007/s10909-008-9819-1", "fulltext": "Journal of Low Temperature Physics manuscript No.\n(will be inserted by the editor)\n\nJ.P. Davis * H. Choi * J. Pollanen *\nW.P. Halperin\n\narXiv:0806.0908v2 [cond-mat.supr-con] 24 Jul 2008\n\nHigh frequency sound in superfluid\n3\nHe-B\n\nVersion November 17, 2018\n\nAbstract We present measurements of the absolute phase velocity of transverse and longitudinal sound in superfluid 3 He-B at low temperature, extending from the imaginary squashing mode to near pair-breaking. Changes\nin the transverse phase velocity near pair-breaking have been explained in\nterms of an order parameter collective mode that arises from f -wave pairing interactions, the so-called J = 4− mode. Using these measurements, we\nestablish lower bounds on the energy gap in the B-phase. Measurement of\nattenuation of longitudinal sound at low temperature and energies far above\nthe pair-breaking threshold, are in agreement with the lower bounds set on\npair-breaking. Finally, we discuss our estimations for the strength of the f wave pairing interactions and the Fermi liquid parameter, F4s .\nKeywords superfluid * helium * collective mode * pair-breaking * transverse\nsound * longitudinal sound\nPACS 67.30.H- * 74.20.Rp * 74.25.Ld * 43.35.Lq\nJ.P. Davis\nDepartment of Physics and Astronomy, Northwestern University, Evanston, IL\n60208, USA\nTel.: 780-248-1410\nE-mail: jdavis@ualberta.ca\nPresent address: J.P. Davis, Department of Physics, University of Alberta, Edmonton, Alberta T6G 2G7, Canada\nW.P. Halperin\nDepartment of Physics and Astronomy, Northwestern University, Evanston, IL\n60208, USA\nTel.: 847-491-3686\nE-mail: w-halperin@northwestern.edu\n\n\f2\n\n1 Introduction\nIn 1957 Landau [1] predicted the existence of new collective modes of a degenerate Fermi liquid in the high frequency and low temperature limits where\nlocal thermal equilibrium cannot be established. One of these so-called zero\nsound modes, the longitudinal mode, was observed by Abel et al. [2] in 1966.\nThe second predicted zero sound mode was transverse sound. It is intriguing that the conditions on shear stiffness that are required for propagation\nof a transverse wave might be satisfied in a liquid, and in particular in the\nFermi liquid 3 He. Nonetheless, the second mode predicted by Landau has\nnever been observed [3]. Moores and Sauls [4] pointed out that transverse\nsound might propagate at low temperatures in the B-phase of superfluid 3 He\nas a consequence of its coupling to the imaginary squashing mode (ISQ), a\nwell-established collective mode of the order parameter. They predicted a\nsignificant increase in the velocity owing to an off-resonant coupling with the\nISQ which would significantly enhance the observability of transverse sound.\nThe phenomenon was observed by Lee et al. [5] exploiting an acoustic Faraday effect to unambiguously demonstrate that the propagating mode they\ndiscovered had transverse polarization. According to the theory and subsequent experimental work [4, 5, 6, 7, 8], we know that this coupled transverse\nmode propagates only at frequencies between that of the ISQ-mode, shown\nas the blue curve in Fig. 1, and pair breaking, the black curve. In the present\nwork we investigate the region near the pair breaking threshold in superfluid\n3\nHe exploiting both transverse and longitudinal sound modes using acoustic\ncavity inerference methods.\nWe recently reported observation of a new collective mode near the pairbreaking energy, 2∆, based on anomalies in phase velocity, attenuation and\nacoustic birefringence of transverse sound [8]. The additional measurements\nwe present here are made possible by improvements in acoustic techniques,\nnotably acoustic cavity interferometry and pressure sweeps at low temperature. Our measurements of this mode establish a lower bound for the energy\ngap, ∆, since the energy, ~ω, of the 2∆-mode is close to, but below, the\npair-breaking threshold, 2∆. Previous reports of the pair-breaking threshold\nbased on longitudinal sound attenuation [9, 10] are difficult to reconcile with\ntheory since they give values (at low pressure) less than BCS weak-coupling.\nIn the pressure range from 1 to 20 bar, we find that the gap always lies above\nweak-coupling values. Additionally, we compare measurements of longitudinal sound with transverse sound. We find that longitudinal sound continues\nto propagate at energies far above 2∆, albeit with significantly high attenuation. From longitudinal sound attenuation we extract the threshold energy\nfor pair-breaking at 3.7 bar, consistent with the lower bounds established by\nthe 2∆-mode.\nSelection rules for the coupling between transverse sound and order parameter collective modes provide the basis for our identification of the 2∆mode as having total angular momentum J ≥ 4. A J = 4 mode has been\npredicted to exist if there is an attractive, sub-dominant f -wave pairing interaction [11]. There have been predictions for sub-dominant pairing interactions\nin high Tc superconductors [12] and in superfluid 3 He [11, 13]. Superfluid 3 He\n\n\f3\n\nis a spin triplet, p-wave pairing condensate where the possible role of f -wave\ninteractions has been the subject of considerable interest both experimentally\nand theoretically. Several experiments, including magnetic susceptibility [14,\n15] and spectroscopy of the ISQ and real squashing (RSQ) collective modes\n[3, 6, 7, 16, 17, 18], have been analyzed to try and determine the f -wave pairing interaction, as well as Fermi liquid interactions, in an effort to predict\nthe J = 4 mode frequency. However, the results of these different analyses\nare ambiguous owing to imprecision of the Fermi liquid parameters, F2a,s , as\nwell as non-trivial strong coupling contributions to the ISQ-mode frequencies [7]. The strength of the f -wave pairing interactions can be estimated\nfrom the 2∆-mode energies in terms of the theory [13] if assumptions are\nmade about the high order Fermi liquid parameter, F4s . Conversely, we can\nestimate F4s using independent values for the f -wave pairing strength, taken\nfrom measurements of another order parameter collective mode, the RSQ. It\nis traditional to refer to these modes by their total angular momentum, J,\nand to indicate explicitly their parity under particle-hole conversion. Then\nthe ISQ is called the J = 2− mode, the RSQ is the J = 2+ mode and the new\nmode, as predicted, would be J = 4− . Particle-hole symmetry is relevant to\nthe strength of the coupling of order parameter collective modes to sound\n[3, 19]. For example, for perfect particle-hole symmetry, which is the case of\neven parity, there can be no coupling to the RSQ-mode.\n\n2 Longitudinal and Transverse Acoustic Response\nThe experimental arrangement is described in Refs. [7, 8]. We form an acoustic cavity with a spacing of D = 31.6±0.1 μm between an AC -cut transducer\n(6 MHz fundamental frequency) and an optically polished quartz reflector.\nThe temperature is held fixed near ≈ 0.5 mK and the pressure is swept while\nkeeping the acoustic frequency, ω, constant. The energy gap, ∆, is dependent\non the pressure and therefore a decreasing pressure sweep changes the relative energy of the acoustic waves to the energy gap, as well as to the order\nparameter collective modes, shown schematically by the red arrow in Fig. 1.\nSpecifically, we use the weak-coupling-plus energy gap of Rainer and Serene\n[20], referenced to the Greywall temperature scale [21]. The low temperature\npressure sweep method results in crossing the 2∆-mode at T /Tc = 0.29 at a\npressure of 19.4 bar (170 MHz), up to T /Tc = 0.53 for 1.2 bar (76 MHz).\nThe acoustic response, VZ , was detected using a cw-impedance bridge\n[22], which is sensitive to changes in the standing wave condition of the\nsound wave in the cavity through changes in the electrical impedance of the\ntransducer. The transverse acoustic response is given by\n\u0012\n\u0013\n2Dω\n+φ .\n(1)\nVZ = a + b cos θ sin\nc\nThe angle θ is the direction of polarization of the sound wave at the surface\nof the transducer relative to the polarization of the shear transducer; c is the\nsound velocity and φ is a fixed phase that depends on experimental conditions. This is superposed on a slowly varying background, a, not shown in\n\n\f4\n\nFig. 1 (Color on-line). Schematic of the threshold energy for pair-breaking (black\ncurve) and the ISQ-mode (blue curve) as a function of temperature normalized\nto the transition temperature. The shaded blue region is the only region in which\ntransverse sound propagates. Decreasing the pressure at low temperature (pressure\nsweep technique) sweeps the acoustic wave energy relative to the gap energy, represented by the red arrow. The shaded black region is the particle-hole continuum\nidentified schematically by independent quasiparticles. Below the black curve, they\nare shown as a bound Cooper pair.\n\nFig. 2. Hence, the acoustic response is sensitive to: the phase velocity, proportional to the period between the acoustic response oscillations; attenuation,\nincreasing with decreasing amplitude of the acoustic response oscillations\nand proportional to b; and the polarization of the transverse sound wave. We\nwork from 76 to 170 MHz, the 13th to 29th harmonics of the transducer. The\n17th harmonic of our AC -cut transducer, generates primarily longitudinal\nsound, likely from a slightly miscut transducer. This allows us to perform\nlongitudinal sound measurements with the high resolution in frequency and\nthe sensitivity of a shear transducer and directly compare longitudinal and\ntransverse acoustic response traces. The acoustic response for longitudinal\nsound is similar to that of Eq. 1, but without the polarization (cos θ) factor\nand with c corresponding to the velocity of longitudinal sound.\nWe show in Fig. 2 representative energy (pressure) sweeps using both\ntransverse and longitudinal acoustic response as a function of energy normalized to the weak-coupling-plus gap [3, 20]. The green arrow indicates the\nenergy of the 2∆-mode, ~Ω2∆ , in the transverse sound trace. The 2∆-mode\nwas identified by changes in the transverse phase velocity, attenuation and\n\n\f5\n\nFig. 2 (Color on-line). Transverse acoustic response oscillations (lower red trace)\nat ≈ 550 μK and longitudinal acoustic response oscillations (upper blue trace) at\n≈ 600 μK as a function of energy normalized to the weak-coupling-plus gap. The\nbackground has been subtracted from the transverse trace to facilitate comparison.\nThe frequency of transverse sound in the lower trace is 88 MHz and is 99.8 MHz for\nthe longitudinal sound in the upper trace. The green arrow indicates the position\nof the 2∆-mode, which is below 2∆+ (0) at the pressure corresponding to this trace.\nFor the upper trace a modulation of approximately 10% corresponds to transverse\nsound. Conversely, longitudinal sound is weakly generated in the lower trace.\n\nacoustic birefringence [8]. Further analysis of the attenuation of transverse\nsound is discussed elsewhere [23]. We do not see a dramatic change in the\nphase velocity of the longitudinal trace near pair-breaking in Fig. 2 that\nwould indicate coupling to this, or any other, collective mode. The small oscillations in the longitudinal trace are from transverse acoustic response that\nis generated in addition to longitudinal sound.\nFor each full oscillation in the acoustic response, as in the lower trace\nin Fig. 2, one half wavelength of the transverse standing wave has entered\nor left the cavity as described by Eq. 1. Therefore the velocity difference\nbetween each maximum (minimum) corresponds to a half wavelength and\nwe convert the period of the acoustic response oscillations into the change in\nthe phase velocity as a function of pressure, ∆c, where (∆c/c)−1 = Dω\nπc − 1.\nAbsolute values for the transverse sound phase velocity, ct = c, can then be\nobtained by fixing the velocity at one particular frequency, which we take to\nbe the phase velocity approaching the ISQ-mode, through comparison with\ncalculations based on the theoretical dispersion relation for transverse sound\n\n\f6\n\n[4]. This dispersion relation in the long wavelength limit and zero magnetic\nfield [4, 24] is given by:\nω2\nω2\n−\n=\nΛ\n+\nΛ\n,\n0\n2\nq 2 vF2\nω 2 − Ω22− − 52 q 2 vF2\n\n(2)\n\nwhere vF is the Fermi velocity and q is the complex wavevector,\nq = k + iα,\n\n(3)\n\nk is the real wavevector, α is the attenuation, and the phase velocity is ct =\nω/k. The ISQ-mode frequency closely follows the temperature and pressure\ndependence of the energy gap, ∆(T, P ):\nΩ2− (T, P ) = a2− (T, P )∆(T, P ),\n\n(4)\n\np\n\nwhere a2− ≈ 12/5. For the precise values of a2− we use those determined\nexperimentally in Refs. [6, 7]. The first term on the right hand side of Eq. 2\nis the quasiparticle background, the contribution to the dispersion in the\nabsence of off-resonant coupling to the ISQ-mode,\n\u0010\nFs\nFs\u0011 \u0010\nFs\u0011\nΛ0 = 1 (1 − λ) 1 + 2 / 1 + λ 2 .\n(5)\n15\n5\n5\nThe second term on the right hand side of Eq. 2 gives the off-resonant coupling of transverse sound to the ISQ with strength:\nFs\u0011\nF s \u00112 \u0010\n2F1s \u0010\nλ 1+ 2 / 1+λ 2 .\n(6)\nΛ2− =\n75\n5\n5\nHere we have included all Fermi liquid terms, Fls , for l ≤ 2. The Tsuneto\nfunction, λ(ω, T ), can be thought of as a frequency dependent superfluid\nstiffness [4] and is numerically calculated using the weak-coupling-plus gap\n[20], ∆+ (T, P ), tabulated by Halperin and Varoquaux [3].\nThe agreement between the above theoretical dispersion relation and the\ndata is excellent for energies below ∼ 1.8∆+ . To fit the sound velocity above\nthis energy we add a term to the dispersion, Eq. 2, which corresponds to\ncoupling of the 2∆-mode to transverse sound, with coupling strength, Λ2∆ :\nω2\nq 2 vF2\n\n= Λ0 + Λ2−\n\nω2\n\n−\n\nω2\n1\n+ Λ2∆ 2\n2 .\nω − Ω2∆\n− 25 q 2 vF2\n\nΩ22−\n\n(7)\n\nThis form neglects the width of the collective modes, as well as dispersion\ncorrections to the 2∆-mode energy, since it has not yet been calculated. The\ncalculated velocity from this phenomenological dispersion relation fits the\ndata precisely, shown in Fig. 3, with coupling strength, Λ2∆ = 0.18 for the\n88 MHz data (red curve) and Λ2∆ = 0.15 for the 111.5 MHz data (green\ncurve). At the higher frequency (which corresponds to higher pressures) the\ntransverse sound velocity is slightly lower over most of the energy range. This\nis in contrast with the longitudinal sound velocity, cl , which increases with\nincreasing pressure [3]. Near pair-breaking ct = 66.1 m/s at 2.4 bar and 88\nMHz, and ct = 62 m/s at 5.6 bar and 111.5 MHz. These values scale with\n\n\f7\n\nFig. 3 (Color on-line). Phase velocity of transverse sound as a function of energy\nnormalized to the weak-coupling-plus gap at low temperature (≈ 550 μK). The\nblue circles are at 88 MHz and the orange squares are at 111.5 MHz. The red curve\nis the theoretical phase velocity for 88 MHz with the new dispersion term and the\ngreen curve is for 111.5 MHz.\n\nthe Fermi velocities of 54.8 m/s and 50.3 m/s at 2.4 and 5.6 bar respectively,\nbeing ≈ 22% larger than the Fermi velocity near the frequency ω ≈ 2∆/~ in\nboth cases.\nIn addition to coupling between transverse sound and the ISQ, there is\nalso a coupling between longitudinal sound and the ISQ. Similar to the transverse case, this gives an increased longitudinal sound velocity and increased\nattenuation near the ISQ. The dispersion relation for longitudinal sound in\nsuperfluid 3 He is given by [4]\n\u0015\n\u0014\nω2\n4 \u0010 qvF \u00112\n8 \u0010 qvF \u00112\nω2\n(8)\n=1+\n(1 − λ) +\nλ 2\n7 2 2 ,\nq 2 c21\n15 ω\n75 ω\nω − Ω22− − 15\nq vF\nwhere c1 is the hydrodynamic sound velocity, cl = ω/k is the phase velocity\nand q = k +iα. Note that there are a few significant differences between Eq. 8\nand Eq. 2. One very important difference is the first term on the right side\nof Eq. 8 that results in real valued solutions at frequencies below the ISQ\nwhere longitudinal sound is allowed to propagate. Additionally we find that\nthere continues to be acoustic response oscillations in the longitudinal trace\nover all energies that we could measure even above pair-breaking, shown in\nFig. 4.\nThe longitudinal acoustic response oscillations can be converted to velocity and attenuation as was done for transverse sound [8, 23]. This is shown\nin Fig. 5. The sound velocity, Fig. 5a, calculated from the theoretical dispersion relation, Eq. 8, is given by the blue curve. The data is then fixed to the\n\n\f8\n\nFig. 4 (Color on-line). Longitudinal acoustic response oscillations as a function of\nenergy normalized to the weak-coupling-plus gap at low temperature (≈ 600 μK)\nat 99.8 MHz. The amplitude of the oscillations decreases above ≈ 2∆+ , but they\ncontinue to the highest energies, indicating that longitudinal sound propagates well\ninto the particle-hole continuum.\n\ntheoretical velocity near the ISQ-mode, thus determining the longitudinal\nsound velocity at all other energies (gold circles). The theory and data are\nin good agreement over the entire energy range. The pressure dependence\nof the longitudinal sound velocity in the normal state, c1 as tabulated in\nRef. [3], is given as the dashed black curve in Fig. 5a. It is interesting to note\nthat the dominant contribution to the energy dependence of the longitudinal\nsound velocity, at all energies other than near the ISQ-mode, comes from its\ndependence on pressure during the pressure sweep. Moreover, there seems to\nbe no strong effect on the longitudinal sound velocity near the pair-breaking\nenergy where we have evidence for a new mode from transverse sound, possibly because of the low resolution in energy in this measurement. This is the\nfirst measurement of the phase velocity of longitudinal sound for such high\nattenuation, which has been facilitated in our case by using a narrow cavity\nand acoustic interference techniques.\nFurthermore, we can determine the relative attenuation of longitudinal\nsound from the amplitude of the acoustic response oscillations, shown in\nFig. 5b. It is reasonable to expect that the attenuation of longitudinal sound\nis nearly zero away from the ISQ-mode and pair-breaking [25], which would\nmean that the relative attenuation in Fig. 5b is nearly the absolute attenuation. The energy resolution of this attenuation data is rather poor owing\nto the short acoustic path length, but extends to ≈ 10× the attenuation\n\n\f9\n\nFig. 5 (Color on-line). Longitudinal sound velocity (a) and attenuation (b) as a\nfunction of energy normalized to the weak-coupling-plus gap at low temperature\n(≈ 600 μK) at 99.8 MHz. In the upper panel the theoretical sound velocity is\ngiven by the blue curve and the data by the gold circles. The pressure dependence\nof the longitudinal sound velocity in the absence of coupling to the ISQ-mode is\ngiven by the dashed black curve. In the lower panel the relative attenuation of\nlongitudinal sound is given as the blue squares. The green curve is a fit to Eq. 9,\ngiving 2∆pair−breaking = (1.994 ± 0.006)∆+ .\n\nof previous measurements, which allows us to determine the attenuation at\nenergies far above pair-breaking. Unlike the longitudinal sound velocity, the\nattenuation shows a dramatic effect near the threshold energy. It is expected\n[19] that the attenuation from pair breaking behaves as\np\n(9)\nα ∼ ~ω − 2∆pair−breaking .\nFitting our data to this relation, the green curve in Fig. 5b, yields\n2∆pair−breaking = (1.994 ± 0.006)∆+ . At even higher energies, the attenuation deviates from this relation, which is not understood. The nature of sound\npropagation deep into the particle-hole continuum and at low temperatures\nis not well-established, perhaps in part since there have been no experimental\n\n\f10\n\nresults until this work. In this spirit we note that the experimental conditions exceed the quantum limit described by Landau [1] in his discussion\nof zero sound propagation in the normal Fermi liquid. In our case we have\n~ω/2πkB T ∼ 1.3. It is in this low temperature limit, so far unexplored theoretically at high frequency in superfluid 3 He, that the quantum mechanical\nform of the quasiparticle distribution function should be used. In the normal\nFermi liquid it results in sound attenuation, even at zero temperature.\n3 Lower Limits on the Pair-Breaking Energy\nThe single most fundamental quantity in the thermodynamic description of\nboth superconductors and superfluid 3 He is the gap energy, ∆(T ). Understanding the gap energy of superfluid 3 He is vital for correct interpretation\nof collective mode frequencies, which scale with the gap, as well as virtually all static properties of the superfluid. The energy gap is the energy per\nquasiparticle required to dissociate a Cooper pair into its constituent quasiparticles. Anisotropy in the gap as well as strong coupling corrections to the\nfree energy can in principle increase the gap energy above ∆(0) = 1.764kb Tc .\nAcoustic measurements of the energy gap are based on the principle that its\nsignature is a sharp onset of attenuation associated with pair-breaking. Previous measurements of the pair breaking energies using longitudinal sound have\nindicated anomalously low values for the energy gap, below the 1.764kB Tc of\nBCS theory [9, 10]. In order to investigate this surprising result, we use the\n2∆-mode as a lower bound on the pair-breaking energy of superfluid 3 He. By\ndoing this, we establish lower limits on the energy of the gap, which we find\nto be above the weak-coupling BCS theory at all pressures.\nIn this light, the results of Movshovich et al. [9] and Masuhara et al.\n[10] from longitudinal sound measurements, are particularly unsettling since\nboth of these experiments yield gap energies below ∆BCS , at low pressures.\nTo date, these two experiments are the only ones to have measured the\ngap at low temperatures, below T /Tc < 0.5. Other experiments [25, 26, 27]\nmeasured the pair breaking edge using attenuation of longitudinal sound near\nTc . Adenwalla et al. [28] used longitudinal acoustics to identify a feature\nwith 2∆ down to T /Tc ≈ 0.6. These experiments were consistent with the\nweak-coupling-plus model [20] when combined with the temperature scale of\nGreywall [21] but are not sensitive tests of the low temperature limit of the\nweak-coupling-plus theory [20].\nOur measurement of ~Ω2∆ , using transverse acoustic response is the first\nexperiment using transverse sound to shed light on the gap. The off-resonant\ncoupling of transverse sound to the ISQ-mode is extinguished above pairbreaking and transverse sound no longer propagates by this mechanism [4].\nThis is expected to behave like a step-function, sharply increasing the attenuation and making transverse sound well-suited for measuring pair-breaking.\nThe only problem with this scenario is the appearance of the 2∆-mode [8].\nNonetheless, using the 2∆-mode as a lower bound, we can draw conclusions\nabout the pair-breaking energy. Comparing the transverse and longitudinal\ntraces, Fig. 2, it is clear that transverse sound does not propagate above pairbreaking in our acoustic cavity. It is widely believed that transverse sound\n\n\f11\n\nFig. 6 (Color on-line). Measurements of ~Ω2∆ , green circles, normalized to the\ngap at zero temperature in the weak-coupling-plus model as a function of pressure.\nThe green line is a fit to the data, Eq. 13. The grey bow-tie is from the attenuation\nof longitudinal sound. The black dashed line is the weak-coupling-plus gap [20].\nThe red line is the BCS weak-coupling gap [3]. The blue downward triangles are\nthe data of Movshovich et al. and the gold squares are the data of Masuhara et al.\nWe find an upturn at low pressures for the minimum value for 2∆, as opposed to\nthe precipitous drop to lower values for the data of Movshovich et al. and Masuhara\net al.\n\nshould propagate in the normal state [1], but we have found that the attenuation is too high for us to observe standing waves with the acoustic path\nlength used here, 2D = 63.1 μm.\nFig. 6 shows the results of our ~Ω2∆ measurements, normalized to the\nweak-coupling-plus gap, as a function of pressure. We find ~Ω2∆ is within\n≈ 1% of the expected value of the weak-coupling-plus gap for . 20 bar and\nour interpretation is that the gap energy never falls below ∆BCS . Our measurement of the pair-breaking threshold energy extracted from longitudinal\nsound attenuation is shown as the grey bow-tie in Fig. 6 and is consistent,\nin that it lies at an energy above the measurements of ~Ω2∆ . There is good\nagreement at pressures ≥ 10 bar between our measurements and those of\nMovshovich et al. [9], but in our results there is a clear upturn at the lowest\npressures in stark contrast to the experiments of both Movshovich et al. [9]\nand Masuhara et al. [10]. It is possible that Movshovich et al. are detecting\nan increased attenuation coming from the feature observed by Ling et al. [25]\nthat couples to longitudinal sound and resides near 2∆ in a magnetic field,\nalthough its exact origin is unknown [29, 30], since their experiment involved\nsweeping the magnetic field to move the gap energy through their acoustic\nspectrum. The results of Masuhara et al. are not subject to this source of\nambiguity and it is difficult for us to reconcile their experiment with ours.\n\n\f12\n\nFig. 7 (Color on-line). f -wave pairing interaction strength from 2∆-mode energies\nusing Eq. 11. The red curve uses F4s = 0, the blue curve F4s = −1 and the green\ncurve F4s = +1. The purple dashed curve results from F4s = 0 and increasing Tc\n(and therefore ∆+ ) by 1%, and the orange dotted curve results from F4s = 0 and\ndecreasing Tc by 1%. Whenever Ω4− ≥ 2∆+ the Tsuneto function is imaginary and\nthere are no solutions to Eq. 11. The black line represents the the values of x−1\n3\nfrom Fraenkel et al. [17].\n\n4 Extraction of f -Wave Pairing and Fermi Liquid Interactions\nPredictions for the J = 4− mode frequency, Ω4− , depend on the existence of\nan attractive f -wave pairing interaction [11], as well as the unknown Fermi\nliquid parameter, F4s . Parameterization of the f -wave pairing strength is\ngiven by\n1\n,\n(10)\nx−1\n3 = −1\nv1 − v3−1\nwhere v1 and v3 are the pairing potentials due to p-wave and f -wave interactions respectively. Attractive f -wave pairing interactions correspond to\n−1\nnegative values for x−1\n3 , and x3 is zero if the f -wave pairing interaction is\n−\nzero. Repulsive interactions give a positive x−1\n3 . The predicted J = 4 mode\n−1\ns\nfrequency in terms of x3 and F4 is given by [13]:\n\u0010\n\n\u0014 2\n\u0011 \u0015\nΩ4−\n5 s \u0010 Ω42−\n1 s \u0011\n5\n−1\n1 + F4 λ + x 3 λ\n− + F4\n− 1 λ = 0,\n9\n4∆2\n9 81\n4∆2\n\n(11)\n\nfor the case when x−1\n5 = 0 (zero h-wave pairing interactions).\nEvaluation of the strength of f -wave pairing interactions from the measured values for the energy of the 2∆-mode is complicated by the fact that\nthere is no experimental information on F4s . Nonetheless, we can evaluate\nEq. 11, for various constant values of F4s . Specifically in the case where F4s = 0\n\n\f13\n\nFig. 8 (Color on-line). F4s calculated from Eq. 11 using Ω2∆ -mode energies and\na\nx−1\n3 from RSQ-mode energies [17, 18] (red curve). F2 is not particularly well known\n−1\na\n[3] and alteration of F2 by ±0.2 yields x3 , which give the black and grey curves,\nrespectively. The purple dashed curve results from increasing Tc by 1%, and the\norange dotted curve results from decreasing Tc by 1%.\n\nwe can rewrite Eq. 11 as\nx−1\n3\n\n\u0014 \u0010 2\n\u0015−1\nΩ4−\n5\u0011\n= λ\n−\n.\n4∆2\n9\n\n(12)\n\nFor Ω4− in Eq. 12, we use our values from the 2∆-mode [8] given up to 20\nbar by:\n~Ω2∆ (T, P ) = 2∆+ (T, P )(1.006 − 6.7 × 10−3 P + 8.7 × 10−4 P 2\n− 3.94 × 10−5 P 3 + 6 × 10−7 P 4 ). (13)\nThe values of x−1\n3 extracted from this analysis are presented in Fig. 7. When\nΩ4− ≥ 2∆+ the Tsuneto function is imaginary and there are no solutions to\nEq. 11. The values of x−1\n3 are sensitive to the energy of the collective mode\nnormalized to the pair-breaking energy, Ω4− /2∆+ . Since the energy gap is\nproportional to Tc , uncertainty in the absolute temperature will affect these\nvalues. The uncertainty in Tc was estimated by Greywall to be ±1% [21] and\nwe show the result of adjusting Tc by ±1% as the purple dashed and orange\ndotted curves respectively. The effect of Tc on λ was taken into account.\nThese values for x−1\n3 in Fig. 7 are inconsistent with the values we extracted\nfrom measurements of the frequency and Zeeman splitting of the ISQ-mode\n[6, 7]. However, as was noted previously, the effect of interactions on the ISQ\nmode frequency, and possibly the Zeeman splitting of this mode, are likely\naffected by strong coupling corrections which are of comparable magnitude\n\n\f14\n\n[6, 7]. On the other hand, the effect of x−1\non the RSQ-mode energies as\n3\nreported by Fraenkel et al. [17, 18] is an order of magnitude larger than for\nthe ISQ-mode energies and as a consequence, they are possibly less affected\nby strong-coupling corrections. Therefore, using the RSQ-mode values of x−1\n3\nand using the Ω2∆ -mode energies, it is possible to give possible values for\nF4s from Eq. 11. These values are given as the red curve in Fig. 8. Unfortunately, the relevant Fermi liquid parameter, F2a , for calculation of x−1\n3 from\nthe RSQ-mode energies is not well known [3]. Increasing and decreasing F2a\nby 0.2 yields x−1\n3 given by the black and grey curves respectively in Fig. 8.\nThe purple dashed curve results from increasing Tc by 1%, and the orange\ndotted curve results from decreasing Tc by 1%. Landau's formulation of interactions in 3 He in terms of a strongly converging expansion in Legendre\npolynomials with coefficients, Fl , would lead us to expect that the Fermi liquid parameters, Fl , should decrease rapidly as l increases. According to the\nanalysis above the absolute values of F4s might be comparable to, or larger\nthan, those of F2s [3].\n\n5 Conclusions\nWe have shown that low temperature pressure sweeps are a high resolution technique to study the energy dependence of longitudinal and transverse sound in superfluid 3 He-B, without the complicating effects of thermal\ndamping that occur in temperature sweeps. This allows measurement of the\nabsolute values for the phase velocity of both longitudinal and transverse\nsound as a function of energy. These measurements reveal the coupling of\ntransverse sound to a collective mode near the pair-breaking edge, the 2∆mode, which is likely the J = 4− mode. We use the 2∆-mode energies, in\ncombination with the attenuation of longitudinal sound, to set lower limits\non the energy of pair-breaking. We conclude that pair-breaking never falls\nbelow the value given by weak-coupling BCS theory. Additionally, we use\nthe energies of this mode to estimate the strength of sub-dominant f -wave\npairing interactions.\nFuture experiments with magnetic fields should bring the energy of pairbreaking below that of the 2∆-mode, because of the large difference in their\nZeeman splittings [8, 31]. This would allow direct measurement of the pairbreaking energy using transverse sound, which could then be extrapolated\nto zero magnetic field. Direct measurement of the energy of pair-breaking,\nwith the precision of high frequency transverse acoustics, can provide narrow\nconstraints on the absolute temperature scale.\n\nAcknowledgments\nWe acknowledge support from the National Science Foundation, DMR-0703656\nand thank J.A. Sauls, C.A. Collett, W.J. Gannon and S. Sasaki for useful\ndiscussions.\n\n\f15\n\nReferences\n1. L.D. Landau, Sov. Phys. JETP 32, 59 (1957).\n2. W.R. Abel, A.C. Anderson and J.C. Wheatley, Phys. Rev. Lett. 17, 74 (1966).\n3. W.P. Halperin, E. Varoquaux, in Helium Three, ed. by W.P. Halperin and\nL.P. Pitaevskii (Elsevier, Amsterdam 1990).\n4. G.F. Moores, J.A. Sauls, J. Low Temp. Phys. 91, 13 (1993).\n5. Y. Lee, T.M. Haard, W.P. Halperin and J.A. Sauls, Nature 400, 431 (1999).\n6. J.P. Davis, H. Choi, J. Pollanen and W.P. Halperin, Phys. Rev. Lett. 97,\n115301 (2006).\n7. J.P. Davis, H. Choi, J. Pollanen and W.P. Halperin, Phys. Rev. Lett. 100,\n015301 (2008).\n8. J.P. Davis, J. Pollanen, H. Choi, J.A. Sauls, W.P. Halperin, Nature Physics\n4, 571-575 (2008).\n9. R. Movshovich, N. Kim, D.M. Lee, Phys. Rev. Lett. 64, 431 (1990).\n10. N. Masuhara, B.C. Watson, M.W. Meisel, Phys. Rev. Lett. 85, 2537 (2000).\n11. J.A. Sauls, Phys. Rev. B 34, 4861 (1986).\n12. M. Fogelström, D. Rainer, J.A. Sauls, Phys. Rev. Lett. 79, 281-284 (1997).\n13. J.A. Sauls, J.W. Serene, Phys. Rev. B 23, 4798 (1981).\n14. R.S. Fishman, Phys. Rev. B 36, 79 (1987).\n15. R.S. Fishman, J.A. Sauls, Phys. Rev. B 38, 2526 (1988).\n16. J.A. Sauls, J.W. Serene, Phys. Rev. Lett. 49, 1183 (1982).\n17. P.N. Fraenkel, R. Keolian, J.D. Reppy, Phys. Rev. Lett. 62, 1126 (1989).\n18. P.N. Fraenkel, Thesis (Cornell University) unpublished (1990).\n19. R.H. McKenzie, J.A. Sauls, in Helium Three, ed. by W.P. Halperin and L.P.\nPitaevskii (Elsevier, Amsterdam 1990).\n20. D. Rainer, J.W. Serene, Phys Rev. B 13, 4745 (1976).\n21. D.S. Greywall, Phys. Rev. B 33, 7520 (1986).\n22. P.J. Hamot, Thesis (Northwestern University) unpublished (1994).\n23. J.P. Davis, H. Choi, J. Pollanen, W.P. Halperin, submitted to Phys. Rev.\nLett. (2008). [arXive: 0807.2221]\n24. J.A. Sauls, in Topological Defects and the Non-Equilibrium Dynamics of Symmetry Breaking Phase Transitions, ed. by Y.M. Bunkov and H. Godfrin\n(Kluwer Academic, Dordrecht 2000). (cond-mat/9910260)\n25. R. Ling, J. Saunders, E.R. Dobbs, Phys. Rev. Lett. 59, 461 (1987).\n26. R.W. Gianetta, A. Ahonen, E. Polturak, J. Saunders, E.K. Zeise, R.C.\nRichardson, D.M. Lee, Phys. Rev. Lett. 45, 262 (1980).\n27. M.W. Meisel, B.S. Shivaram, B.K. Sarma, J.B. Ketterson, W.P. Halperin,\nPhys. Lett. A 98, 437 (1983).\n28. S. Adenwalla, Z. Zhao, J.B. Ketterson, B.K. Sarma, Phys. Rev. Lett. 63, 1811\n(1989).\n29. R.H. McKenzie, J.A. Sauls, J. Low Temp. Phys. 90, 337 (1993).\n30. M. Ashida, J. Hara, K. Nagai, J. Low Temp. Phys. 105, 221 (1996).\n31. N. Schopohl, L. Tewordt. J. Low Temp. Phys. 45, 67 (1981).\n\n\f"}