{"id": "http://arxiv.org/abs/1001.4246v1", "guidislink": true, "updated": "2010-01-24T15:26:19Z", "updated_parsed": [2010, 1, 24, 15, 26, 19, 6, 24, 0], "published": "2010-01-24T15:26:19Z", "published_parsed": [2010, 1, 24, 15, 26, 19, 6, 24, 0], "title": "Topological interactions between ring polymers: Implications for\n  chromatin loops", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1001.5143%2C1001.3434%2C1001.2677%2C1001.3978%2C1001.2848%2C1001.1835%2C1001.2814%2C1001.0235%2C1001.2252%2C1001.2208%2C1001.4913%2C1001.4736%2C1001.4929%2C1001.3546%2C1001.4421%2C1001.3473%2C1001.3072%2C1001.2130%2C1001.3840%2C1001.4347%2C1001.1033%2C1001.3150%2C1001.5228%2C1001.4558%2C1001.5007%2C1001.3351%2C1001.5003%2C1001.5459%2C1001.0947%2C1001.0655%2C1001.3261%2C1001.4360%2C1001.2006%2C1001.2025%2C1001.3488%2C1001.2283%2C1001.3831%2C1001.1716%2C1001.0834%2C1001.3132%2C1001.0234%2C1001.1507%2C1001.2236%2C1001.0057%2C1001.2321%2C1001.3277%2C1001.1891%2C1001.3549%2C1001.1658%2C1001.0675%2C1001.5351%2C1001.2229%2C1001.5258%2C1001.4246%2C1001.3052%2C1001.1608%2C1001.1190%2C1001.2482%2C1001.2510%2C1001.4656%2C1001.2454%2C1001.3522%2C1001.2963%2C1001.0389%2C1001.3265%2C1001.4620%2C1001.1532%2C1001.1537%2C1001.4804%2C1001.0076%2C1001.2446%2C1001.1832%2C1001.3563%2C1001.2085%2C1001.1225%2C1001.1612%2C1001.0082%2C1001.4906%2C1001.1717%2C1001.1011%2C1001.2287%2C1001.2747%2C1001.5109%2C1001.1238%2C1001.4102%2C1001.3193%2C1001.1320%2C1001.3836%2C1001.1703%2C1001.1582%2C1001.1567%2C1001.3738%2C1001.5031%2C1001.4674%2C1001.0586%2C1001.0986%2C1001.0157%2C1001.5069%2C1001.4145%2C1001.2002%2C1001.3024&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Topological interactions between ring polymers: Implications for\n  chromatin loops"}, "summary": "Chromatin looping is a major epigenetic regulatory mechanism in higher\neukaryotes. Besides its role in transcriptional regulation, chromatin loops\nhave been proposed to play a pivotal role in the segregation of entire\nchromosomes. The detailed topological and entropic forces between loops still\nremain elusive. Here, we quantitatively determine the potential of mean force\nbetween the centers of mass of two ring polymers, i.e. loops. We find that the\ntransition from a linear to a ring polymer induces a strong increase in the\nentropic repulsion between these two polymers. On top, topological interactions\nsuch as the non-catenation constraint further reduce the number of accessible\nconformations of close-by ring polymers by about 50%, resulting in an\nadditional effective repulsion. Furthermore, the transition from linear to ring\npolymers displays changes in the conformational and structural properties of\nthe system. In fact, ring polymers adopt a markedly more ordered and aligned\nstate than linear ones. The forces and accompanying changes in shape and\nalignment between ring polymers suggest an important regulatory function of\nsuch a topology in biopolymers. We conjecture that dynamic loop formation in\nchromatin might act as a versatile control mechanism regulating and maintaining\ndifferent local states of compaction and order.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1001.5143%2C1001.3434%2C1001.2677%2C1001.3978%2C1001.2848%2C1001.1835%2C1001.2814%2C1001.0235%2C1001.2252%2C1001.2208%2C1001.4913%2C1001.4736%2C1001.4929%2C1001.3546%2C1001.4421%2C1001.3473%2C1001.3072%2C1001.2130%2C1001.3840%2C1001.4347%2C1001.1033%2C1001.3150%2C1001.5228%2C1001.4558%2C1001.5007%2C1001.3351%2C1001.5003%2C1001.5459%2C1001.0947%2C1001.0655%2C1001.3261%2C1001.4360%2C1001.2006%2C1001.2025%2C1001.3488%2C1001.2283%2C1001.3831%2C1001.1716%2C1001.0834%2C1001.3132%2C1001.0234%2C1001.1507%2C1001.2236%2C1001.0057%2C1001.2321%2C1001.3277%2C1001.1891%2C1001.3549%2C1001.1658%2C1001.0675%2C1001.5351%2C1001.2229%2C1001.5258%2C1001.4246%2C1001.3052%2C1001.1608%2C1001.1190%2C1001.2482%2C1001.2510%2C1001.4656%2C1001.2454%2C1001.3522%2C1001.2963%2C1001.0389%2C1001.3265%2C1001.4620%2C1001.1532%2C1001.1537%2C1001.4804%2C1001.0076%2C1001.2446%2C1001.1832%2C1001.3563%2C1001.2085%2C1001.1225%2C1001.1612%2C1001.0082%2C1001.4906%2C1001.1717%2C1001.1011%2C1001.2287%2C1001.2747%2C1001.5109%2C1001.1238%2C1001.4102%2C1001.3193%2C1001.1320%2C1001.3836%2C1001.1703%2C1001.1582%2C1001.1567%2C1001.3738%2C1001.5031%2C1001.4674%2C1001.0586%2C1001.0986%2C1001.0157%2C1001.5069%2C1001.4145%2C1001.2002%2C1001.3024&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Chromatin looping is a major epigenetic regulatory mechanism in higher\neukaryotes. Besides its role in transcriptional regulation, chromatin loops\nhave been proposed to play a pivotal role in the segregation of entire\nchromosomes. The detailed topological and entropic forces between loops still\nremain elusive. Here, we quantitatively determine the potential of mean force\nbetween the centers of mass of two ring polymers, i.e. loops. We find that the\ntransition from a linear to a ring polymer induces a strong increase in the\nentropic repulsion between these two polymers. On top, topological interactions\nsuch as the non-catenation constraint further reduce the number of accessible\nconformations of close-by ring polymers by about 50%, resulting in an\nadditional effective repulsion. Furthermore, the transition from linear to ring\npolymers displays changes in the conformational and structural properties of\nthe system. In fact, ring polymers adopt a markedly more ordered and aligned\nstate than linear ones. The forces and accompanying changes in shape and\nalignment between ring polymers suggest an important regulatory function of\nsuch a topology in biopolymers. We conjecture that dynamic loop formation in\nchromatin might act as a versatile control mechanism regulating and maintaining\ndifferent local states of compaction and order."}, "authors": ["Manfred Bohn", "Dieter W. Heermann"], "author_detail": {"name": "Dieter W. Heermann"}, "author": "Dieter W. Heermann", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.3302812", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1001.4246v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1001.4246v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "12 pages, 11 figures. The article has been accepted by The Journal Of\n  Chemical Physics. After it is published, it will be found at\n  http://jcp.aip.org", "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.chem-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "q-bio.BM", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1001.4246v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1001.4246v1", "journal_reference": null, "doi": "10.1063/1.3302812", "fulltext": "Topological interactions between ring polymers: Implications for chromatin\nloops\nManfred Bohn1, a) and Dieter W. Heermann1, b)\nInstitute for Theoretical Physics, University of Heidelberg, Philosophenweg 19, D-69120 Heidelberg,\nGermany\n\narXiv:1001.4246v1 [cond-mat.soft] 24 Jan 2010\n\n(Dated: 4 November 2018)\n\nChromatin looping is a major epigenetic regulatory mechanism in higher eukaryotes. Besides its role in\ntranscriptional regulation, chromatin loops have been proposed to play a pivotal role in the segregation of\nentire chromosomes. The detailed topological and entropic forces between loops still remain elusive. Here, we\nquantitatively determine the potential of mean force between the centers of mass of two ring polymers, i.e.\nloops. We find that the transition from a linear to a ring polymer induces a strong increase in the entropic\nrepulsion between these two polymers. On top, topological interactions such as the non-catenation constraint\nfurther reduce the number of accessible conformations of close-by ring polymers by about 50%, resulting in\nan additional effective repulsion. Furthermore, the transition from linear to ring polymers displays changes\nin the conformational and structural properties of the system. In fact, ring polymers adopt a markedly more\nordered and aligned state than linear ones. The forces and accompanying changes in shape and alignment\nbetween ring polymers suggest an important regulatory function of such a topology in biopolymers. We\nconjecture that dynamic loop formation in chromatin might act as a versatile control mechanism regulating\nand maintaining different local states of compaction and order.\nI.\n\nINTRODUCTION\n\nRing polymers are abundantly found in nature, common examples range from the DNA of bacteria to certain\nvirus types1 , mitochondrial DNA in higher eukaryotes\nand proteins2 . These findings suggest a structural advantage of ring polymers over linear ones. The genomic content of higher eukaryotes inside the interphase nucleus,\nhowever, has a much more complex organization. Compaction is accomplished on several scales, the detailed\nfolding pathways being closely related to genome function3,4 . Nowadays, abundant experimental and theoretical evidence suggests that chromatin looping acts as an\nimportant link between chromatin organization and function. The existence of chromatin loops on scales from a\nfew kilo basepairs (kb) up to several mega basepairs (Mb)\nhas been evaluated by 3C/4C/5C experiments5,6 . Several\nmechanisms for looping have been proposed: Amongst\nothers, it was suggested that these loops arise when different genes and regulatory elements co-localize in transcription hubs or factories7 , where a high concentration\nof polymerases engages transcription.\nInconsistent with theoretical predictions for solutions\nof linear polymers, chromosomes arrange such that they\noccupy distinct territories9 , the overlap volume being\nquite small. A similar effect has been found even for\nsmall parts of single chromosomes spanning several mega\n\na) The\n\nfollowing article has been accepted by The Journal of Chemical Physics. After it is published, it will be found at http:\n//jcp.aip.org.; Electronic mail: bohn@tphys.uni-heidelberg.de\nb) Institute for Molecular Biophysics, The Jackson Laboratory,\nBar Harbor, ME; Interdisciplinary Center for Scientic Computing (IWR), University of Heidelberg, Im Neuenheimer Feld 368,\nD-69120 Heidelberg, Germany\n\nbasepairs (Mb)3 . In principle, active ATP-consuming\nmechanisms might be responsible for maintaining segregation. Rosa and Everaers10 proposed that chromosomes\nare aggregating into distinct compartments because of\ntheir large relaxation time, making it impossible for them\nto intermingle during the time of one cell cycle. However, this study does not explain segregation of smaller\nregions within chromosomes. Vettorel and co-workers11\nsuggested that the collapsed state might be responsible\nfor segregation: Polymer gels, where single polymers are\nin a collapsed state, show no reptation, therefore intermingling between different polymers becomes practically\nimpossible. Recently, evidence from polymer models has\nindicated that chromatin loops force such a compartmentalization already by virtue of purely entropic forces12,13 .\nWhile the mean squared radius of gyration Rg2 of isolated ring polymers and a system of two catenated rings14\ndisplays a scaling similar to that of a self-avoiding walk,\nwhere Rg2 ∼ N 2ν with ν ≈ 0.58815 , non-catenated rings\nin a melt become compact adopting a scaling exponent\nof ν = 1/311,17 . In fact, chromatin organization is not\nconsistent with a simple melt of ring polymers. Scaling\nexponents found in experiments differ a lot, ranging from\nν ≈ 0.1 − 0.218 to ν = 0.519 , the level of compaction depending on gene activity20 . Dynamic chromatin loops,\nhowever, have been shown recently to provide a consistent framework of chromatin organization12 .\nThe purpose of this study is to deepen the understanding of the topological interactions ring polymers exert\non each other as well as the changes in their conformational properties induced by such forces. While topological effects of rings have been considered in several\nstudies16,21,22 , the induced forces have not been quantitatively assessed. A system of two ring polymers can be\nviewed as a toy system for the influence of loop formation on chromatin folding. While the biological system is\n\n\f2\nbeyond doubt much more complicated – multiple loops\nand the dense system of polymers playing a dominant\nrole – the effect of topological forces and the advantage\nof the ring shape for biopolymers can be highlighted best\nby studying it apart from other influences. We evaluate\nthe potential of mean force between two ring polymers\ndependent on their mutual topological state to derive a\nquantitative measure for the entropic repulsion two rings\nor loops exert on each other. Therefore, Monte Carlo simulations of ring polymers with lengths of up to N = 2048\nmonomers are conducted. We separate the entropic effects due to excluded volume interactions from the topological interactions arising from the non-catenation constraint. The ring polymers' conformational properties\nand their mutual alignment subjected to the topological\nand entropic forces are investigated. In fact, we find that\nring polymers display a markedly stronger repulsion and\nadopt a more ordered state compared to linear polymers.\nThe findings indicate a natural benefit of rings over linear ones, leading to the conjecture that chromatin loops\nnot only facilitate entropy-driven segregation of chromosomes or intra-chromosomal regions, but act as a versatile\ncontrol mechanism regulating and maintaining different\nstates of compaction and order.\nThe paper is organized as follows: In section II we\nrevisit the theory behind the effective potential, present\ndetails of the simulational method and the numerical calculations of the effective potential. In section III A we\ncalculate the potential of mean force for linear polymers\nand review scaling theories. We turn to ring polymers\nin section III B and study the effect of topological interactions in section III C. The following two sections are\ndedicated to the investigation of how the dimensions and\nshape of a ring changes when bringing two rings into\ncontact. Finally, in section III F, we study the mutual\nalignment of rings considering the effect of topological\nconstraints.\nII.\n\nSIMULATIONS AND METHODS\n\nA.\n\nEffective potentials\n\nTo investigate the potential of mean force exerted between the centers of mass of ring polymers, we use the\nconcept of the effective potential. The method has been\nused for a variety of polymer systems, and for some even\nanalytical approximations have been found 23,24 . A recommendable review is given in Ref.25 .\nLet the monomer positions and momenta of the two\nα\npolymers be denoted by rα\ni and pi (i = 1, . . . , N, α =\n1, 2), respectively. α denotes the polymer chain index\nand i indexes subsequently the monomers of the polymer.\nThe properties of the system are given by the complete\nHamiltonian\nα\nH({pα\ni }, {ri }) =\n\nN\n2\nX X\npα\ni\n+ V ({rα\ni })\n2m\nα=1,2 i=1\n\nFor the problem of ring polymers investigated here, the\ninteraction potential V ({rα\ni }) is given by an excluded volume term and eventually by a term describing the topological constraints.\nThe potential of mean force can be gained via the partition sum of the system constrained to a fixed center-ofmass,\n\"\n!#\nN\nN\n1 X (1)\n1 X (2)\nZc (R) = Tr exp(−βH) δ\nr −\nr −R\nN i=1 i\nN i=1 i\nThe trace denotes the integral over all momenta and\nmonomer coordinates.\nThe effective potential is now defined by the relation\nexp (−βUeff (R)) = Zc (R)\nFor purposes of calculation, however, the following representation24,25 of the effective potential is more useful\nUeff (R) = −kB T ln\n\nZc (R)\nZ12\n\n(1)\n\nwhere Z1 is the partition sum of a single polymer. Equivalently, Z12 may be imagined as the partiton sum of a\ntwo-chain system whose centers of mass are infinitely far\napart.\nB.\n\nMonte-Carlo algorithm\n\nThe generation of ring polymers is accomplished using\na well-tested lattice Monte Carlo algorithm, the bond\nfluctuation model26,27 . Simulations are set up on a cubic lattice, where each monomer of the ring resides in\nthe center of a unit cube and occupies all its eight vertices. Each monomer is connected by a bond to its two\nneighbors along the contour of the polymer, ensuring the\nconnectivity of the chain. The lattice constant is taken\nto be unity and all measures of length in the following\nare given in multiples of the lattice constant. The length\nof the bonds between two neighboring monomers are allowed to fluctuate, but constrained to a set B of 108\nvectors27 . One Monte Carlo trial move encompasses randomly selecting one monomer and proposing a move to\none of its nearest neighbors on the cubic lattice. Using\nthese local moves combined with the constrained set of\nbond vectors B, it has been shown that no bond-crossings\ncan occur during the simulation run27 , thus the topological state of the rings is preserved while propagating the\nsystem. Excluded volume interactions are taken into account by preventing a lattice site to be occupied by more\nthan one monomer.\nIsolated ring polymers with chain lengths between\nN = 32 and N = 2048 are simulated. As only local moves\nare applied, consecutive conformations are highly correlated. To determine the relaxation time of a ring polymer, we evaluated the autocorrelation function C(t)28 of\nthe squared radius of gyration A(t) = Rg2 (t) and from\n\n\f3\na center-of-mass distance r is then given by\nUeff (r) = −kB T ln\n\nFIG. 1. Illustration of different topological states of two ring\npolymers. The left figure shows a non-catenated conformation\nwith Gauss linking number Φ = 0. On the right, a catenated\nconformation is displayed having a linking number of Φ = 1.\n\nC(t) we estimated the integrated autocorrelation time τ\nusing Sokal's windowing procedure14,29 . Two subsequent\nconformations are considered independent after 5τ Monte\nCarlo steps (MCS). In the following we define one MCS\nas N trial moves, where N is the chain length and therefore the total number of monomers in the system. Thus,\nin one MCS each monomer is proposed on average one\nmove. For each chain length at least 10 000 independent\nconformations were produced.\nSimulations are performed on a lattice with periodic\nboundary conditions, but the algorithm keeps track of\nunfolded coordinates, such that the entire configuration\nspace can be explored. The linear lattice size L is cho1/2\n, so that monomers\nsen large enough, i.e. L \u001d Rg2\ndo not come into contact in the lattice space by periodic backfolding of coordinates, otherwise biased conformations would result. Lattice sizes used vary between\nL = 256 up to L = 800, depending on chain length N .\n\nC.\n\nCalculation of the effective potential\n\nSingle ring conformations are used to calculate the average interaction energy between two polymers by means\nof equation (1). This procedure is well-established and\nhas been applied in several studies23,24 . At first, the set of\nsampled conformations C is split into two parts of equal\nsize. Then, we randomly pick two conformations, one\nfrom each subset. These two ring conformations are then\npositioned such that their centers of mass have a certain\ndistance r, the angular positioning in doing so is chosen randomly. In order to ensure all monomers residing\non lattice sites after shifting, a maximum distance inaccuracy of δr ≈ 0.87 lattice units is accepted. In the\nnext step, the interaction energy Ei (r) of the two-ring\nconformation and the corresponding statistical weight\nWi (r) = exp(−Ei /kB T ) are calculated.\nRepeating this operation for a number K of randomly\nselected pairs of conformations, the effective potential at\n\nPK\n\nWi (r)\nK\n\ni=1\n\nThe standard error of the effective potential is determined by randomly subdividing the K two-chain conformations into M = 50 smaller subsets and calculating\nthe effective potential Um (r) for these subsets23 . The\nstandard error is then calculated by\nv\nu\nM\nu 1 X\n∆Ueff (r) = t\n(Um (r) − Ueff (r))2\nM m=1\n\nIn a first step, only taking into account excluded volume interactions, the statistical weight Wi (r) of a twochain conformation is set to Wi = 0 in case the excluded\nvolume condition is violated, i.e. two monomers occupy\nthe same lattice site, and Wi = 1 in case it is not.\nHowever, care has to be taken using the bond fluctuation model. During the simulation run it is ensured\nthat no bond crossings can occur; this, however, is not\nguaranteed if we just shift two conformations inside each\nother. There are two possible combinations of bond vectors, where the excluded volume condition is not violated, but where the bonds come into contact. Consider\nthe two bonds spanned by the following four monomers\n{(0, 0, 0) → (3, 1, 0), (1, 2, 0) → (2, −1, 0)}. Both bond\nvectors (3, 1, 0) ∈ B and (1, −3, 0) ∈ B are valid and the\nexcluded volume condition is satisfied. The second problematic case is {(0, 0, 1) → (2, 2, 0), (0, 2, 0) → (2, 0, 1)}.\nAs can be easily seen, the participating beads are stuck\nin these positions, there is no valid move for any of the\nbeads using the restrictions of bond vectors the algorithm\nis subjected to. Therefore, during a simulation run such\na situation can never happen, assuming the start configuration is chosen properly. Here, we test each two-chain\nconformation, after positioning them with their centers\nof mass a given distance r apart, on such a situation. If\na bond crossing occurs, a weight of Wi = 0 is assigned to\nthis conformation.\nIn this study, we are furthermore interested in the\ntopological state of a two-ring conformation. We calculate the weight factor differently whether we consider\na preserved topological state or not. In the case that we\nforce a certain topological state, we have to add another\ncriterion for accepting a two-chain conformation (i.e. assigning a weight Wi 6= 0). Two rings that are positioned\nat a center-of-mass distance r might be non-catenated or\ncatenated. Furthermore, the degree of catenation might\nvary (see illustrations in Fig. 1). We determine the topological state by a topological invariant: the \"Gauss linking number\"30 . This invariant has been used in analytical studies on interlinked rings to keep track of a certain\ntopology30,31 . It is defined by\nI I\n1\nhdr1 × dr2 , r1 − r2 i\nΦ(C1 , C2 ) =\n(2)\n4π C1 C2\n|r1 − r2 |3\n\n\f4\nThe closed line integrals are evaluated along the contours\nof the two rings, denoted by Ck (k = 1, 2). The vector\nfunction rk = rk (s) denotes the three-dimensional coordinates of the ring polymers, parameterized e.g. by the\ncontour length s.\nThe Gauss link invariant has the advantage that it is\neasy to evaluate, although it has the disadvantage that it\nis not one-to-one. The \"Whitehead link\"30 is one example for a two-ring conformation having the same linking\nnumber as non-catenated rings. However, for this link,\nself-intersections of one ring are necessary, which do not\narise during the simulation runs. Therefore we consider\nthe Gauss linking number as an excellent quantity to determine the topological state. The result of the integral\nis an integer for non-overlapping chains, especially Φ = 0\nfor non-catenated chains and Φ = 1 for simple catenated\nchains (Fig. 1). We numerically evaluate this integral to\nclassify the topological state of a two-ring conformation\nand assign a weight Wi = 0 for all two-ring conformation\nnot in the topological state we are interested in. Thereby\nwe are able to calculate the effective potential separately\nfor any given topological state.\nIII.\nA.\n\nRESULTS\nThe effective potential of self-avoiding walks\n\nWe first recapitulate the results for the effective potential between the centers of mass of two self-avoiding\nwalks both to validate the algorithm used and to relate\nthe strength and form of the potential for linear polymers\nto their ring counterparts.\nA simple mean field argument can be devised for the\nentropic repulsion of two polymer coils with excluded volume at full overlap, i.e. with zero center-of-mass separation. It has been first proposed by Flory and Krigbaum32 and later been corrected in other studies33,34 .\nThe overlap volume is given by V ∼ Rg3 where Rg is\nthe radius of gyration of one polymer coil. A mean-field\nargument yields the effective potential at full overlap34 :\nScaling arguments33 , which take into account the correlation hole effect35 , show that the probability p1 of one\nmonomer of chain A being in contact with any monomer\n1\nof B is given by p1 = (na3 ) 3ν−1 . Thus the probability\nthat none of the monomers are overlapping is given by\nb0 N\np = (1 − p1 )N = (1 − N\n) . The effective potential can\nthen be calculated as the logarithm of this probability,\n\u0012\n\u0013\nb0\nU (r = 0) = −N ln 1 −\n(3)\nN\nIn the limit of infinite chain length N → ∞, the effective\npotential at full overlap approaches a constant value in\nthe order of kB T . Consequently, linear polymer coils with\nexcluded volume have a rather soft potential, allowing for\na high level of mutual penetration.\nResults for the self-avoiding walk are displayed in\nFig. 2. The effective potential USAW (r) in Fig. 2A reveals\n\na decrease with growing chain length, inconsistent with\nthe mean-field argument by Flory32 but consistent with\neq. (3). The effective potential at full overlap is shown\nin a scaling plot (cf. Ref.36 ) in Fig. 2B. Data points are\non a straight line as expected, deviations are most likely\ndue to lattice effects: When the two polymer coils are\nbrought to a certain distance, the nearest lattice site is\nchosen, such that the distance can deviate from the target\ndistance r = 0. These deviations are more pronounced\nthe smaller N .\n\nB.\n\nRings have a stronger repulsion than linear polymers\n\nTo study the effective potential between ring polymers,\nwe first neglect topological constraints between the two\nrings when bringing them in proximity. However, each\nsingle ring obeys the topological constraint of unknottedness by virtue of the simulational method. Thus the\neffective potential is given by the logarithm of the probability that the ring conformations do not occupy at least\none lattice site in common.\nFigure 3A shows the effective potential Uring (r) for ring\npolymers where mutual topological constraints are neglected, i.e. the linking number between the two ring\npolymers is arbitrary. The effective potential again is\ndependent on chain length N , however, differences become smaller for large chain lengths. The mean field\nargument for the effective potential at full overlap established in eq. (3) does not depend on the connectivity of\nthe chain. Indeed, it is not only valid for linear polymers, but also for rings. Figure 3B shows the effective\npotential at full overlap Uring (0) such that a linear extrapolation to N → ∞ becomes possible. Clearly, the\neffective potential adopts a constant value in this limit.\nInterestingly, the repulsive interactions between two\nring polymers are much stronger than for their linear counterparts of equal chain length N . The ratio\nUring (r)/USAW (r) is displayed in Fig. 4 and has a value of\nabout 3 for center of mass (CM) separations below 2Rg .\n\nC.\n\nTopological constraints induce additional repulsion\n\nIn the last section we have shown that the repulsive\nforces acting between two ring polymers whose centers of\nmass are brought in close proximity are much stronger\nthan for linear self-avoiding walks, the potential being\nabout 3 times larger. This rise in strength results from\nthe increased density of monomers induced by the ring\nstructure. Here we focus on the additional effect topological constraints induce on the potential of mean force\nbetween the polymers. Much attention has been paid to\nthe influence of topological constraints on ring polymers.\nThe interaction between non-linked ring polymers without excluded volume has been investigated for chains of\nlength up to N = 8021 . In a recent study14 we have\nanalyzed the behavior of two catenated rings. It turned\n\n\f5\n2.5\n\nB\n\nN=64\nN=128\nN=256\nN=384\nN=512\nN=1024\n\n2\n\n1.02\n1.01\n1\n0.99\n\nexp(−U(0)/N)\n\neffective potential USAW (r )\n\nA\n\n1.5\n1\n\n0.98\n0.97\n0.96\n0.95\n0.94\n\n0.5\n\n0.93\n0.92\n\n0\n\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n0.91\n\n3\n\n0\n\n0.005 0.01 0.015 0.02 0.025 0.03 0.035\n1/N\n\nr /Rg\n\nFIG. 2. Effective potential acting between the centers of mass of two self-avoiding walks. A. This panel displays the effective\npotential USAW (r) for different chain lengths. The x-axis is scaled by the root mean squared radius of gyration Rg of isolated\nchains. Errors are smaller than the point size and therefore not shown. The effective potential is dependent on chain length.\nB. Scaling plot of the effective potential at full overlap. The effective potential USAW (0) reaches a finite value for large chain\nlength as expected from scaling theory (cf. equation (3)).\n\n6\n\nB\n\nN=64\nN=128\nN=256\nN=384\nN=512\nN=1024\nN=1536\nN=2048\n\n5\n4\n3\n2\n\n0.95\n0.9\n0.85\n\n1\n0\n\n1.05\n1\n\nexp(−U(0)/N)\n\neffective potential Uring (r )\n\nA\n\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\nr /Rg\n\n0.8\n\n0\n\n0.005 0.01 0.015 0.02 0.025 0.03 0.035\n1/N\n\nFIG. 3. Effective potential Uring (r) of ring polymers disregarding their mutual topological state. A. This panel displays the\neffective potential in units of kB T for several chain lengths. Errorbars are not shown as they are smaller than the point size.\nFor reasons of comparison, the x-axis is scaled with the radius of gyration of the corresponding isolated ring polymer. B. The\nscaling law for the effective potential at full overlap follows the theory from eq. (3) allowing for a linear extrapolation to the\ninfinite chain limit when plotting e−U (0)/N vs 1/N . For the extrapolation, only chain lengths larger than N = 256 are used.\n\nout that while the dimensions of catenated rings show\nthe same scaling behavior than their linear counterparts,\nthe shape changes significantly. The topological states\nof circular DNA have been analyzed in various publications37,38 . The studies on non-catenated and unknotted ring polymers in the melt revealed that their dimensions change dramatically11,16,17 : They behave like\ncompact polymers with a radius of gyration scaling with\n\nN 1/3 . The dominant entropic force driving this compaction stems from the topological constraint of noncatenation. To our knowledge, a quantitative study of\nthis topological potential has not been considered yet.\nIn the framework of effective interactions, the topological non-catenation constraint can be included easily. As\nexplained in the section II C, we determine the topological state of a two-ring conformation by means of its Gauss\n\n\f6\n\nA\n0\neffective potential Uring\n(r )\n\n3.5\n\n2.5\n2\n\nN=64\nN=128\nN=256\nN=384\nN=512\nN=1024\n\n1.5\n1\n0.5\n\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\ndistance r /Rg\nFIG. 4. Comparison of the effective potentials for ring polymers and self-avoiding walks. The ratio Uring (r)/USAW (r) is\nplotted against the center-of-mass distance r. The x-axis is\nscaled by the root mean squared radius of gyration Rg of isolated chains for reasons of comparison.\n\nlinking number Φ (eq. (2)). A Gauss linking number of\nzero indicates the non-catenation of the two ring polymers. To obtain the potential of mean force under the\nnon-catenation constraint, we calculate the fraction p of\ntwo-ring conformations with both zero linking number\nand fulfilled excluded volume constraint. The effective\n0\npotential is then given by Uring\n(r) = − ln p (the index\n0 indicates the Gauss linking number Φ = 0). The re0\nsulting potential Uring\n(r) is shown in Fig. 5A. We find\npronounced deviations from a Gaussian shape for small\nCM separations r . 1Rg .\n0\nFrom the effective potential Uring\n(r) of non-catenated\nrings and Uring (r) of rings without topological constraints, the topological potential Utop (r), i.e. the part of\n0\nUring\n(r) stemming purely from the non-catenation constraint, can be obtained,\n0\nUtop (r) = Uring\n(r) − Uring (r)\n\nThe topological potential is shown in Fig. 5B. It has a\nmaximum at about r/Rg ≈ 0.55, a value which basically does not change with chain length N . For larger\nCM separations Utop (r) drops to zero, as less and less\ntwo-ring conformations will be catenated when increasing r. There is also a decrease in the topological potential when going to small CM separations r < 0.5Rg .\nThis decrease becomes smaller for larger chain length\nN . The reason for this behavior is that for small r\n(and small N ), two-ring conformations not satisfying the\nnon-catenation constraint, often do not satisfy the excluded volume constraint either, such that the conformations are not counted for the purely topological interaction Utop . However, more interesting is the maximum repulsion exerted by the non-catenation constraint.\nWe find that the topological potential is asymptotically\nmax\nUtop\n≈ 0.6 − 0.7 kB T for (N → ∞) at r/Rg ≈ 0.55\n\nB\n\nN=64\nN=128\nN=256\nN=384\nN=512\nN=1024\nN=2048\n\n5\n4\n3\n2\n1\n0\n\n3\n\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\ndistance r /Rg\n0.9\n0.8\n0.65\n\n0.7\n0.6\nUtop (r )\n\nUring (r )/USAW (r )\n\n3\n\n6\n\n0.64\n\n0.5\n0.63\n\n0.4\n\nN=1536\n\n0.3\n\nN=256\n\n0.2\n0.1\n0\n\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\ndistance r /Rg\n0\nFIG. 5.\nA. The effective potential Uring\n(r) for noncatenated rings. B. The topological potential Utop (r) for\nnon-catenated rings is obtained as the difference between\n0\n(r) and Uring (r). It displays the potential arising purely\nUring\nfrom the topological non-catenation constraint. The inset\nshows the maximum of the topological potential depending\non the chain length N . The maxima are obtained by a fit of\nUring (r) to a third-order polynomial in the interval [0.3 : 0.7].\n\n(see inset of Fig. 5B). In numbers, this means that only\nabout 48% (exp(−0.65) ≈ 0.52) of all two-ring conformations with fixed center-of-mass distance which would\nbe allowed with respect to excluded volume are actually\nallowed with respect to topological constraints. In other\nwords, only half of the two-ring conformations satisfying\nthe excluded volume constraint are actually accessible\nwhen the non-catenation constraint is considered. Thus,\nthe non-catenation constraint decreases the number of\naccessible conformations at small CM separations considerably.\nInterestingly, the topological interaction is on the order\nof magnitude of 1 kB T . This value was used for a crude\nestimate of the free energy of rings in a melt by Cates and\nDeutsch39 , where they assumed that the free energy cost\nfor a contact between two rings is about 1 kB T , hence\nin a three-dimensional melt the topological contribution\nto the free energy is F ≈ kB T R3 /N . Although highly\n\n\f7\n1.12\n\nA\n\nnon-catenated\nall rings\nSAW\n\n1.1\n\nnc\n\nA\n\n/ Rg2\n\n1.01\n1\n\nnt\n\n1.06\n1.04\n\nRg2\n\nRg (r )/Rg\n\n1.08\n\n1.02\n\n0.99\n\n1.02\n0.98\n\n1\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\n3.5\n\n4\n\n1\n0.9\n0.8\n0.7\n\nnt\n\nCM separation r /Rg\n\nB\nnc\n\n0.5\n\nRg2\n\nRg2 /N 2ν\n\nB\n\n0\n\n/ Rg2\n\n0.98\n\n100\n\n1000\n\n0\n\n0.5\n\n2.5\n\n3\n\n1.02\n\ns=1\ns=0\n\n1.01\n1\n0.99\n0.98\n\n0\n\n0.01\n\nFIG. 7. A. Ratio between the mean squared radii of gyration\nof rings without mutual topological interactions (NT) and\nnon-catenated rings (NC) vs. scaled distance r/Rg between\nthe centers of mass. Results are shown for a chain of length\nN = 1024. B. The ratio is plotted against the inverse chain\nlength allowing for an extrapolation to the infinite chain limit\nN → ∞. Data is shown for two CM separations: s = 0 and\ns = 1 to analyze whether deviations remain in the limit of\nlarge chain length.\n\nRg2 / d 2\n\nDimensions of two-ring conformations\n\nWhen two polymers are brought closer and closer together, lowering the distance between the centers of mass,\nnot only the repulsive interaction increases dramatically.\nAlso the conformational properties of the polymers are\naffected23 in an effort of minimizing the free energy. Here\nwe investigate how the dimensions of a two-ring conformation change compared to a self-avoiding walk when\napproaching isolated polymers.\nThere are two measures of the dimensions of the chain,\nwhich, however, exhibit the same scaling: the mean\nsquared radius of gyration Rg2 and the mean squared\nring diameter d2 (see Ref.14 ). Figure 6A shows the root\np\nmean squared radius of gyration Rg (r) = hRg (r)2 i for\nself-avoiding walks (SAW), ring polymers without mutual\ntopological interactions (arbitrary linking number Φ) and\nnon-catenated rings (linking number Φ = 0) in dependence of the scaled center-of-mass separation s = r/Rg .\n\n2\n\ninverse chain length 1/N\n\nsimplistic, this scaling exponent ν = 2/5 was later reproduced by simulational results16 ; more recent results,\nhowever, suggest that this behavior is only a cross-over\nto the behavior of compact lattice animals17 .\n\nD.\n\n1.5\n\nCM separation s = r /Rg\n\nchain length N\nFIG. 6. A. Mean squared radius of gyration for self-avoiding\nwalks (SAW), ring polymers without mutual topological interactions and non-catenated rings vs. distance between the\ncenters of mass. Radii of gyration are scaled by the corresponding values Rg of the isolated chains. B. Scaling of\nthe radius of gyration with chain length. The leading term\nN 2ν of a self-avoiding walk (ν = 0.588) is divided out to see\ndeviations from the linear chain behavior.\n\n1\n\n0.306\n0.304\n0.302\n0.3\n0.298\n0.296\n0.294\n0.292\n0.29\n0.288\n0.286\n\nnon-catenated rings\nall rings\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\n3.5\n\n4\n\nCM separation r /Rg\nFIG. 8. Ratio between the mean squared radius of gyration\nand mean squared ring diameter vs center-of-mass separation\nr. Data is shown for a chain length of N = 1024. Results are\nshown for two-ring conformations without mutual topological\ninteractions (open circles) and non-catenated ring conformations (solid red circles).\n\n\f8\nThe data are scaled with the radius of gyration for isolated polymers Rg = Rg (r = ∞) (i.e. the radius of gyration of a polymer at infinite distance away from the\nsecond one) for reasons of comparison. For small CM\nseparations (r < Rg ) the radius of gyration strongly\nincreases and its dimensions are more than 10% larger\nthan in the isolated case. This is consistent with the results for self-avoiding walks by Dautenhahn and Hall23 .\nThe increase in dimension at separations r \u001c Rg originates from the need of the chains to create space for the\nmonomers of the second chain. At intermediate separations of about r/Rg ≈ 1.5 − 2, the radius of gyration attains a smaller value, thus the polymer effectively undergoes compaction. Both the compaction at intermediate\nseparations as well as the swelling at high overlap remain\nin the limit of infinite chain length. An extrapolation of\nthe radius of gyration at full overlap (s = 0) to N → ∞\nshows that Rg (r = 0)/Rg → 1.109(1) for rings without\ntopological interactions and Rg (r = 0)/Rg → 1.111(1)\nfor non-catenated rings (see Supplementary Figure 140 ).\nOne might ask, whether this change in dimensionality\nis accompanied by a change in the scaling law. We know\nfrom several studies that isolated ring polymers follow a\nsimilar scaling law as linear polymers Rg2 ∼ N 2ν where\nν ≈ 0.5914,22,41 . However, non-catenated rings in a melt\nbehave like compact polymers with a scaling exponent\nν = 1/311,17 . Figure 6B shows the scaling of the radius of\ngyration with chain length in a log-log plot for two centerof-mass separations: r = 0 (full overlap, region where the\nchain is swollen) and r = 1.7Rg (region where the chain\nis compacted). The leading order term N 2ν of the selfavoiding walk behavior (ν = 0.58815 ) is divided out. The\ndata adopt a constant value in the limit of large chain\nlength N independent of CM separation, indicating that\nthe scaling behavior is independent of separation. As this\nalso applies to rings with the non-catenation constraint,\nthe compaction found in a polymer melt of non-catenated\nrings seems to require several chains, exerting forces from\nall sides on the polymer coil.\nOur results show that differences between the radius of\ngyration Rg2 nt of rings without topological constraints\nand Rg2 nc of rings obeying non-catenation are rather\nsubtle. The ratio of the radii of gyration Rg2 nt / Rg2 nc\nwith respect to the CM separation is shown in Fig. 7A\nfor a chain length of N = 1024. For small separations\nr < 0.5Rg non-catenated rings are smaller, while for intermediate separations (r ∼ 1Rg ) they are larger. The\ndependence of these results on the chain length N is given\nin Fig. 7B for two different CM separations. The differences are asymptotically stable both in the regime of\nsmall as well as intermediate separations. At full overlap\n(s = 0), non-catenated rings are larger in size by about\n0.8% in the asymptotic limit N → ∞, for intermediate\nseparations (s = 1), rings without topological constraints\nare larger by about 1.5%. Similar results are found for\nthe mean square ring diameter (data not shown).\nAs isolated ring polymers as well as self-avoiding walks\nonly have one length scale, different measures of dimen-\n\nsion should yield a constant ratio. For a random walk,\nthe ratio between the mean squared radius of gyration\nand the end-to-end distances is 1/6. For isolated ring\npolymers, the ratio Rg2 / d2 extrapolates to 0.3053(2)\nin the asymptotic limit, while catenated rings display a\nratio of 0.2995(3)14,22 . For the case studied here, the\nratio between the radius of gyration and ring diameter\nRg2 / d2 changes significantly for different CM separations (see Fig. 8). From its isolated chain value the\nratio decreases when bringing the centers of mass closer\ntogether. Extrapolation to infinite chain length N → ∞\nshows that the differences remain even in this limit (Supplementary Figure 242 ). At full overlap (s = 0) the\nratio extrapolates to Rg2 / d2 = 0.2874(3) for noncatenated rings and Rg2 / d2 = 0.2891(3) for rings\nwithout topological interactions.\nE.\n\nShape of two-ring conformations\n\nA typical measure of the shape of a polymer coil is its\ngyration tensor43,44 . It is defined by\nSmn =\n\nN\n1 X (i) (i)\nr r\nN i=1 m n\n\n(4)\n\nHere r(i) is the coordinate vector of the ith monomer\nand the subindex denotes its cartesian components. The\nmatrix S is symmetric and positive semi-definite, thus it\ncan be transformed to a diagonal matrix where the three\neigenvalues λ1 ≤ λ2 ≤ λ3 give the squared lengths of\nthe principal axes of gyration of the associated gyration\nellipsoid. In fact, the sum of the eigenvalues gives the\nsquared radius of gyration Rg2 = λ1 + λ2 + λ3 .\nIn a recent study14 on catenated rings we have found\nthat the shape of catenated rings differs significantly from\nthe shape of isolated ring polymers. This shows up in the\nratios of the averaged eigenvalues hλ3 i : hλ2 i : hλ1 i, which\nare obtained from extrapolation to the asymptotic limit\nas 8.23(2) : 3.22(2) : 1 for isolated rings and 8.87(3) :\n3.56(2) : 1 for catenated rings.\nWe investigate how the shape of rings changes when\napproaching the centers of mass, both for rings without topological interactions as well as for conformations,\nwhich obey the non-catenation constraint. Figure 9A\ndisplays the results for a chain of length N = 1024. The\npolymers get strongly elongated for small center-of-mass\nseparations s = r/Rg . This elongation at full overlap\ns = 0 remains in the limit of large chain length N → ∞\nas is displayed in Fig. 9B. For non-catenated rings, the\neffect of elongation is slightly more pronounced than for\nrings, where topological effects are neglected. At full\noverlap we find for non-catenated rings that the ratios\nhλ3 i : hλ2 i : hλ1 i are asymptotically 11.05(8) : 4.32(3) : 1,\nwhile for rings without mutual topological interactions\nwe have 10.84(6) : 4.17(2) : 1.\nWhile the analysis of the radius of gyration indicated\nthat the spatial extend of rings becomes larger, we have\n\n\f9\n\nB\n\nnon-catenated rings\nall rings\n\n10\n8\n\n13\n12\n11\n10\n\n0\n\n0.005\n\n0.01\n\n0.015\n\n0.02\n\ninverse chain length 1/N\n\n6\nhλ2 i / hλ1 i\n\nhλ2 i / hλ1 i\n\nhλ3 i / hλ1 i\n\n12\n\nhλ3 i / hλ1 i\n\nA\n\n4\n2\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\n3.5\n\nCM separation r /Rgy r\n\n6\n5\n4\n\n0\n\n0.005\n\n0.01\n\n0.015\n\n0.02\n\ninverse chain length 1/N\n\nFIG. 9. A. Ratios between the gyration tensor's eigenvalues λ1 ≤ λ2 ≤ λ3 in relation to the center of mass distance s = r/Rg .\nData is shown for a system with chain length N = 1024 for two-ring conformations without mutual topological interactions\n(open circles) and non-catenated ring conformations (solid red circles). B. Finite-size behavior of the ratios hλ3 i / hλ1 i and\nhλ2 i / hλ1 i for a center-of-mass separation of s = 0.\n\nfound here that this opening up does not lead to a complete mixing of the two rings, which would result in a\nmore spherical structure; rather rings elongate strongly\nin one direction.\n\nF.\n\nOrientation and Alignment of rings\n\nTo investigate the interactions between the two rings at\nfull overlap in more detail, we look at the mutual alignment and orientation. The alignment of the gyration\nellipsoids of both rings with respect to each other can\nbe investigated via two measures: Firstly, the average\nangle hcos θ1 i between the largest main axes of the ellipsoids, secondly the average angle hcos θ2 i between the\nvector connecting the centers of mass of both rings and\nthe largest main axis of one ellipsoid. Its behavior has\nbeen observed for catenated rings14 . It was found that\nthe main axes of the ellipsoids tend to align perpendicular\nfor short CM separations, while for large CM separations,\nthe alignment becomes more and more parallel.\nThe results for two-ring conformations without mutual\ntopological constraints and non-catenated ring conformations as well as SAWs are shown in Fig. 10. The black line\nat hcos θi i = 0.5 corresponds to the average angle for a\nrandom orientation of the vectors (Note that the angle θi\ncan adopt only values between zero and 90 degrees). The\naverage angle hcos θ1 i between the gyration tensors main\naxes (cf. Fig. 10A) displays a pronounced perpendicular orientation for small CM separations r < Rg . This\neffect is markedly stronger for ring polymers than for\nlinear ones. At intermediate separations of r ≈ 1 − 2Rg ,\nhowever, a regime is found where a slightly parallel alignment of the rings is preferred compared to a random orientation. For large center of mass separations, a random orientation is approached; in this regime, the rings\nare nearly independent and therefore do not influence\n\neach other. An extrapolation to the infinite chain length\nregime at full overlap (s = 0) yields an average angle\nhcos θ1 i of 0.3543(7) for rings without topological interactions, 0.3492(6) for non-catenated rings and 0.3897(2)\nfor self-avoiding walks. Details of the extrapolation are\nshown in the Supplementary Figure 347 .\nThe angle hcos θ2 i (see Fig. 10B) shows a nearly random alignment for CM separations of r ≈ 0. For intermediate r ≈ 1 − 2Rg , the alignment becomes pronouncedly\nmore perpendicular compared to a random alignment.\nThis effect is much stronger for non-catenated rings than\nfor rings without mutual topological constraints. Clearly,\nring polymers display a much stronger tendency to align\nnon-randomly than self-avoiding walks. In the regime of\nperpendicular alignment at s = 1.2 the asymptotic values of 0.3836(5) (rings without topological interactions),\n0.3661(4) (non-catenated rings) and 0.4327(3) (SAWs)\nare found for the average angle hcos θ2 i47 .\nA recurrent motif in the analysis of shape, dimensions\nand orientation is a change in structure from polymers\nat full overlap to polymers at intermediate separations\n(r ≈ 1 − 2Rg ). While they are strongly elongated and\naligned perpendicular at short separations, at intermediate separations compaction and parallel alignment is observed. Clearly, this results from a tendency to minimize\nthe overlap area between both rings. At full overlap, this\nis accomplished best by a strong elongation and perpendicular alignment (Fig. 11A). When rings are separated\nfurther apart, the gyration ellipsoids can avoid intermingling by aligning in parallel (Fig. 11B). The restricted\nconformational space due to the presence of the other\nring results in the observed compaction of the radius of\ngyration compared to isolated chains.\nBoth the topological constraints and the ring connectivity of the chain have a strong influence on how the\npolymers are aligning when brought close together. In\ngeneral, the view emerges that rings have a more aligned\n\n\f10\n\nhcos θ1 i\n\nA\n\nB\n\n0.54\n0.52\n0.5\n0.48\n0.46\n0.44\n0.42\n0.4\n0.38\n0.36\n0.34\n\ncenter−of−mass distance s=0.3\n\nnon-catenated rings\nall rings\nlinear chain (SAW)\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\ncenter−of−mass\ndistance s=1.5\n\n2.5\n\n3\n\nCM separation r /Rgy r\n0.52\n0.5\n0.48\n\nhcos θ2 i\n\n0.46\n0.44\n0.42\n0.4\n0.38\n0.36\n0.34\n\n0\n\n0.5\n\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\nCM separation r /Rgy r\nFIG. 10. A. Average angle hcos θ1 i between the largest principal axes of the gyration ellipsoids of a two-chain conformation in relation to its center of mass separations. The black\nline corresponds to a random orientation of the two axes. Results are shown for self-avoiding walks (grey triangles), noncatenated rings (solid red circles) and rings without mutual\ninteractions (open black circles). B. Average angle hcos θ2 i\nbetween the vector connecting the centers of mass and the\nlargest principal axis of one polymer coil in relation of the\nCM separation.\n\nand ordered state than linear chains, an effect which is\neven amplified by the non-catenation constraint.\n\nIV.\n\nFIG. 11. Sample conformations of non-catenated rings forced\nto a certain center-of-mass distance. The left-hand figure displays a conformation of two non-catenated rings at nearly full\noverlap (s = r/Rg = 0.3). The two rings markedly align perpendicularly. The right-hand figure shows a two-ring conformation of non-catenated rings at separation s = r/Rg = 1.5\ndisplaying a tendency for parallel alignment.\n\nCONCLUSIONS\n\nIn this study we investigated the effect of the noncatenation constraint on a system with two ring polymers. Our main focus was on the quantitative analysis\nof the strength of the interactions between ring polymers,\nincluding their topological interactions. For this purpose, we sampled conformations of isolated rings using\na well-established Monte Carlo method. We evaluated\nthe potential of mean force using the idea of effective\ninteractions25 following the method introduced by Dautenhahn and Hall23 . The topological state of a two-ring\n\nconformation is analyzed by means of the Gauss linking\nnumber.\nWe found that the effective potential at full overlap\nadopts a constant value both for linear chains and ring\npolymers (Figs. 2 and 3). However, the repulsive interaction between the centers of mass is about 3 times larger\nfor ring polymers than the effective potential for corresponding linear chains (Fig. 4) at small center-of-mass\nseparations r.\nIf the ring polymers have to stay in the fixed mutual\ntopological state of non-catenation, the space of accessible conformations is further reduced, thus the effective\npotential increases. We have evaluated the strength of\nthese interactions – the topological potential Utop (r) –\nresulting purely from topological constraints. We find\nthat the non-catenation constraint further increases the\ntotal repulsive interaction by about 10%. The strength\nof the potential is of the order of 1 kB T at small separations r. The number of rejected conformations increases\nby over 50% compared to only taking into account excluded volume interactions.\nThe analysis of conformational properties of polymers\nbrought close together reveals effects of the ring structure both on size and shape. Ring polymers in proximity\nbecome swollen (Fig. 6) and strongly elongated (Fig. 9)\ncompared to the situation of isolated or far apart ones.\nWhile both effects are found for linear polymers, too,\nthe effects are more pronounced for their ring counterparts. Additional effects from the non-catenation constraint concerning size and shape are visible, but small,\nindicating that the changes are mainly induced by the\npresence of additional material due to the rings being\nmore compact than linear polymers.\nRemarkable effects of the ring structure are found concerning the alignment of ring polymers in proximity.\nThere is a strong tendency to align perpendicular for\n\n\f11\nshort center-of-mass separations, an effect which is much\nmore pronounced than for linear chains. At intermediate\nseparations (r ∼ 1 − 2Rg ) a slightly parallel alignment is\nencountered.\nThe transition from a linear to a ring polymer thus\ninduces strong changes in the conformational and structural properties of a system. In fact, ring polymers adopt\na much more ordered and regular state, showing less intermingling due to the increased repulsive interactions.\nThe mutual alignment of ring polymers becomes much\nmore different from a random state than found for linear\npolymers.\nOur findings suggest, that the ring topology of certain\nbiopolymers like DNA and proteins, displays a benefit\ncompared to the linear organization form. The formation of chromatin loops in higher eukaryotes therefore\nmight play a dominant role concerning overall nuclear organizational principles. We have shown that loop structures lead to a strong effective repulsion and for a first\ntime quantitatively analyzed the strength of the resulting interactions. Surely, the formation of multiple loops\nin the system of chromatin which has been proposed in\nseveral models6,20,45,46 induces even stronger effects and\ntherefore might be responsible for maintaining the segregated state of chromosomes found in several experiments9 . Indeed, studies of looping polymers have revealed an effect on the abundance of inter-chromosomal\ncontacts12,13 . Whereas it has already been proposed\nthat the ring structure prevents chromosomes from entangling10,11 , such a topology also induces a much more\nordered and aligned state than linear polymers. It remains to be shown, to which extend similar results are\nfound for chromatin models with loops20,46 . We expect\nthat both the local behaviour (e.g. inside of transcription\nfactories or heterochromatic regions) and the global behavior (segregation of chromosomes) might well be dominated by entropic and topological forces of chromatin\nloops. Contrary to a melt of ring polymers, which adopts\na compact state, the dynamic formation of loops12 might\nprovide a versatile mechanism for the cell to switch between and maintain different local levels of compaction\nby facilitating or repressing loop formation.\n1 W.\n\nFiers and R. L. Sinsheimer, Journal of Molecular Biology 5, 424 (Oct. 1962), ISSN 0022-2836, http://www.\nsciencedirect.com/science/article/B6WK7-4W7BXV2-6/2/\n0eef070d64a3cb34be9eb66084a3965e.\n2 H.-X. Zhou, Journal of the American Chemical Society 125,\n9280 (Aug. 2003), ISSN 0002-7863, http://dx.doi.org/10.\n1021/ja0355978.\n3 S. Goetze, J. Mateos-Langerak, H. J. Gierman, W. de Leeuw,\nO. Giromus, M. H. G. Indemans, J. Koster, V. Ondrej, R. Versteeg, and R. van Driel, Molecular and Cellular Biology 27,\n4475 (2007), http://mcb.asm.org/cgi/content/abstract/27/\n12/4475.\n4 L. Luo, K. L. Gassman, L. M. Petell, C. L. Wilson, J. Bewersdorf, and L. S. Shopland, J Cell Sci 122, 3729 (2009),\nhttp://jcs.biologists.org/cgi/reprint/122/20/3729.pdf, http://\njcs.biologists.org/cgi/content/abstract/122/20/3729.\n5 M. Simonis, P. Klous, E. Splinter, Y. Moshkin, R. Willemsen,\nE. de Wit, B. van Steensel, and W. de Laat, Nature Genetics 38,\n1348 (Nov 2006), http://dx.doi.org/10.1038/ng1896.\n\n6 E.\n\nLieberman-Aiden, N. L. van Berkum, L. Williams,\nM. Imakaev, T. Ragoczy, A. Telling, I. Amit, B. R. Lajoie,\nP. J. Sabo, M. O. Dorschner, R. Sandstrom, B. Bernstein, M. A.\nBender, M. Groudine, A. Gnirke, J. Stamatoyannopoulos, L. A.\nMirny, E. S. Lander, and J. Dekker, Science 326, 289 (2009),\nwww.sciencemag.org/cgi/content/abstract/326/5950/289.\n7 P. Fraser, Current Opinion in Genetics & Development 16, 490\n(Oct 2006), http://dx.doi.org/10.1016/j.gde.2006.08.002.\n8 J. Bode, S. Goetze, H. Heng, S. Krawetz, and C. Benham, Chromosome Research 11, 435 (Jul. 2003), http://dx.doi.org/10.\n1023/A:1024918525818.\n9 T. Cremer and C. Cremer, Nature Reviews Genetics 2, 292 (Apr.\n2001), ISSN 1471-0056, http://dx.doi.org/10.1038/35066075.\n10 A. Rosa and R. Everaers, PLoS Computational Biology 4,\ne1000153 (2008), http://dx.doi.org/10.1371/journal.pcbi.\n1000153.\n11 T. Vettorel, A. Y. Grosberg, and K. Kremer, Physical Biology\n6, 025013 (10pp) (2009), http://stacks.iop.org/1478-3975/6/\n025013.\n12 M. Bohn and D. W. Heermann, submitted to PLoS Computational Biology -, (2009).\n13 P. R. Cook and D. Marenduzzo, J. Cell Biol. 186, 825 (2009),\nhttp://jcb.rupress.org/cgi/content/abstract/186/6/825.\n14 M. Bohn, D. W. Heermann, O. Lourenco, and C. Cordeiro, submitted to Macromolecules -, (2009).\n15 J. C. Le Guillou and J. Zinn-Justin, Physical Review B 21, 3976\n(May 1980).\n16 M. Müller, J. P. Wittmer, and M. E. Cates, Physical Review E\n53, 5063 (May 1996).\n17 M. Müller, J. P. Wittmer, and M. E. Cates, Physical Review E\n61, 4078 (Apr 2000).\n18 S. Jhunjhunwala, M. C. van Zelm, M. M. Peak, S. Cutchin,\nR. Riblet, J. J. M. van Dongen, F. G. Grosveld, T. A. Knoch,\nand C. Murre, Cell 133, 265 (Apr 2008), http://dx.doi.org/\n10.1016/j.cell.2008.03.024.\n19 G. van den Engh, R. Sachs, and B. J. Trask, Science 257, 1410\n(Sep 1992).\n20 J. Mateos-Langerak, M. Bohn, W. de Leeuw, O. Giromus,\nE. M. M. Manders, P. J. Verschure, M. H. G. Indemans, H. J.\nGierman, D. W. Heermann, R. van Driel, and S. Goetze, Proceedings of the National Academy of Sciences 106, 3812 (2009),\nhttp://www.pnas.org/content/106/10/3812.full.pdf+html,\nhttp://www.pnas.org/content/106/10/3812.abstract.\n21 M. D. Frank-Kamenetskii, A. V. Lukashin, and A. V. Vologodskii, Nature 258, 398 (Dec 1975).\n22 A. Sikorski, Polymer 35, 3792 (Aug. 1994), ISSN 00323861,\nhttp://www.sciencedirect.com/science/article/\nB6TXW-48DYKT6-XY/2/035a3cbff0911939ba9045678559b5ad.\n23 J. Dautenhahn and C. K. Hall, Macromolecules 27, 5399\n(1994),\nhttp://pubs.acs.org/doi/pdf/10.1021/ma00097a021,\nhttp://pubs.acs.org/doi/abs/10.1021/ma00097a021.\n24 H.-P. Hsu and P. Grassberger, Europhysics Letters 66, 874\n(2004), http://stacks.iop.org/0295-5075/66/874.\n25 C. N. Likos, Physics Reports 348, 267\n(2001), ISSN\n0370-1573, http://www.sciencedirect.com/science/article/\nB6TVP-439VDH7-1/2/ed3321c90371f73a30bf2ad5f8c24528.\n26 I. Carmesin and K. Kremer, Macromolecules 21, 2819\n(1988), ISSN 0024-9297, http://pubs3.acs.org/acs/journals/\ndoilookup?in_doi=10.1021/ma00187a030.\n27 H. P. Deutsch and K. Binder, The Journal of Chemical Physics\n94, 2294 (1991), http://link.aip.org/link/?JCP/94/2294/1.\n28 K. Binder and D. W. Heermann, Monte Carlo Simulations in\nStatistical Physics. An Introduction., 4th ed. (Springer, 2002).\n29 A. Sokal, in Functional integration (1996).\n30 M. Otto, Journal of Physics A: Mathematical and General 37,\n2881 (2004), http://stacks.iop.org/0305-4470/37/2881.\n31 M. Otto and T. A. Vilgis, Physical Review Letters 80, 881 (Jan.\n1998), http://link.aps.org/abstract/PRL/v80/p881.\n32 P. J. Flory and W. R. Krigbaum, The Journal of Chemical\nPhysics 18, 1086 (1950), http://link.aip.org/link/?JCP/18/\n\n\f12\n1086/1.\nDaoud, J. P. Cotton, B. Farnoux, G. Jannink, G. Sarma,\nH. Benoit, C. Duplessix, C. Picot, and P. G. de Gennes, Macromolecules 8, 804 (Nov. 1975), ISSN 0024-9297, http://dx.doi.\norg/10.1021/ma60048a024.\n34 A. Y. Grosberg, P. G. Khalatur, and A. R. Khokhlov, Die\nMakromolekulare Chemie, Rapid Communications 3, 709 (1982),\nhttp://dx.doi.org/10.1002/marc.1982.030031011.\n35 P.-G. de Gennes, Scaling concepts in polymer physics (Ithaca,\nN.Y., Cornell University Press, 1979).\n36 P. G. Bolhuis, A. A. Louis, J. P. Hansen, and E. J. Meijer, The\nJournal of Chemical Physics 114, 4296 (2001), http://link.aip.\norg/link/?JCP/114/4296/1.\n37 A. A. Podtelezhnikov, N. R. Cozzarelli, and A. V. Vologodskii, Proceedings of the National Academy of Sciences of the\nUnited States of America 96, 12974 (1999), http://www.pnas.\norg/content/96/23/12974.abstract.\n38 V. V. Rybenkov, C. Ullsperger, A. V. Vologodskii, and N. R. Cozzarelli, Science 277, 690 (1997), http://www.sciencemag.org/\ncgi/content/abstract/277/5326/690.\n39 M.\nCates and J. Deutsch, Journal de Physique 47,\n2121\n(December\n1986),\nhttp://scitation.aip.org/\ngetabs/insref_abs.jsp?key=PROLA&prog=getinsref&id=\nJOPQAG00004700001200212100000C&idtype=cvipa.\n33 M.\n\n40 See\n\nEPAPS supplementary material at [URL will be inserted by\nAIP] for the extrapolation of the radius of gyration for different\ncenter-of-mass separations..\n41 S. Brown, T. Lenczycki, and G. Szamel, Physical Review E 63,\n052801 (Apr 2001).\n42 See EPAPS supplementary material at [URL will be inserted by\nAIP] for the extrapolation of the ratio Rg2 / d2 to infinite\nchain length N → ∞.\n43 W. Bruns, Makromolekulare Chemie-Theory And Simulations 1,\n287 (Sep. 1992).\n44 E. J. Rawdon, J. C. Kern, M. Piatek, P. Plunkett, A. Stasiak,\nand K. C. Millett, Macromolecules 41, 8281 (Nov. 2008), ISSN\n0024-9297, http://dx.doi.org/10.1021/ma801389c.\n45 M. Bohn, D. W. Heermann, and R. van Driel, Physical Review\nE 76, 051805 (2007), http://link.aps.org/abstract/PRE/v76/\ne051805.\n46 A. Grosberg, Y. Rabin, S. Havlin, and A. Neer, EPL (Europhysics Letters) 23, 373 (1993), http://stacks.iop.org/\n0295-5075/23/373.\n47 See EPAPS supplementary material at [URL will be inserted\nby AIP] for the extrapolation of the angle hcos θ1 i between the\nlargest principal axis of the gyration tensor..\n\n\f"}