{"id": "http://arxiv.org/abs/0708.3010v1", "guidislink": true, "updated": "2007-08-22T13:02:15Z", "updated_parsed": [2007, 8, 22, 13, 2, 15, 2, 234, 0], "published": "2007-08-22T13:02:15Z", "published_parsed": [2007, 8, 22, 13, 2, 15, 2, 234, 0], "title": "Prospects of Open Charm Production at GSI-FAIR and J-PARC", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0708.1180%2C0708.2562%2C0708.3907%2C0708.2088%2C0708.4146%2C0708.1517%2C0708.3479%2C0708.3100%2C0708.1969%2C0708.1171%2C0708.1833%2C0708.2916%2C0708.3510%2C0708.0790%2C0708.4246%2C0708.1688%2C0708.2855%2C0708.2486%2C0708.4313%2C0708.1829%2C0708.3806%2C0708.1709%2C0708.0263%2C0708.3863%2C0708.2840%2C0708.2906%2C0708.4076%2C0708.3313%2C0708.1028%2C0708.0338%2C0708.3359%2C0708.1133%2C0708.1983%2C0708.2112%2C0708.2546%2C0708.1378%2C0708.1612%2C0708.1781%2C0708.1059%2C0708.3155%2C0708.3932%2C0708.4149%2C0708.3299%2C0708.0556%2C0708.0037%2C0708.0184%2C0708.3670%2C0708.0446%2C0708.2541%2C0708.4068%2C0708.0680%2C0708.1145%2C0708.3232%2C0708.0519%2C0708.2389%2C0708.3260%2C0708.2405%2C0708.1405%2C0708.1997%2C0708.2638%2C0708.2076%2C0708.1051%2C0708.0237%2C0708.2346%2C0708.3633%2C0708.1885%2C0708.0493%2C0708.0969%2C0708.1802%2C0708.1300%2C0708.2800%2C0708.3010%2C0708.1968%2C0708.0257%2C0708.3398%2C0708.4300%2C0708.1837%2C0708.2256%2C0708.3693%2C0708.3326%2C0708.1371%2C0708.2009%2C0708.1850%2C0708.0949%2C0708.0571%2C0708.1748%2C0708.1431%2C0708.1876%2C0708.2468%2C0708.1115%2C0708.3303%2C0708.2118%2C0708.1101%2C0708.2819%2C0708.1729%2C0708.0602%2C0708.3520%2C0708.3223%2C0708.0757%2C0708.1843%2C0708.0484&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Prospects of Open Charm Production at GSI-FAIR and J-PARC"}, "summary": "We present a detailed phenomenological study of the prospects of open charm\nphysics at the future $\\bar{p}p$ and $pp$ facilities GSI-FAIR and J-PARC,\nrespectively. In particular, we concentrate on differential cross sections and\nthe charge and longitudinal double-spin asymmetries at next-to-leading order\naccuracy. Theoretical uncertainties for the proposed observables are estimated\nby varying the charm quark mass and the renormalization and factorization\nscales.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0708.1180%2C0708.2562%2C0708.3907%2C0708.2088%2C0708.4146%2C0708.1517%2C0708.3479%2C0708.3100%2C0708.1969%2C0708.1171%2C0708.1833%2C0708.2916%2C0708.3510%2C0708.0790%2C0708.4246%2C0708.1688%2C0708.2855%2C0708.2486%2C0708.4313%2C0708.1829%2C0708.3806%2C0708.1709%2C0708.0263%2C0708.3863%2C0708.2840%2C0708.2906%2C0708.4076%2C0708.3313%2C0708.1028%2C0708.0338%2C0708.3359%2C0708.1133%2C0708.1983%2C0708.2112%2C0708.2546%2C0708.1378%2C0708.1612%2C0708.1781%2C0708.1059%2C0708.3155%2C0708.3932%2C0708.4149%2C0708.3299%2C0708.0556%2C0708.0037%2C0708.0184%2C0708.3670%2C0708.0446%2C0708.2541%2C0708.4068%2C0708.0680%2C0708.1145%2C0708.3232%2C0708.0519%2C0708.2389%2C0708.3260%2C0708.2405%2C0708.1405%2C0708.1997%2C0708.2638%2C0708.2076%2C0708.1051%2C0708.0237%2C0708.2346%2C0708.3633%2C0708.1885%2C0708.0493%2C0708.0969%2C0708.1802%2C0708.1300%2C0708.2800%2C0708.3010%2C0708.1968%2C0708.0257%2C0708.3398%2C0708.4300%2C0708.1837%2C0708.2256%2C0708.3693%2C0708.3326%2C0708.1371%2C0708.2009%2C0708.1850%2C0708.0949%2C0708.0571%2C0708.1748%2C0708.1431%2C0708.1876%2C0708.2468%2C0708.1115%2C0708.3303%2C0708.2118%2C0708.1101%2C0708.2819%2C0708.1729%2C0708.0602%2C0708.3520%2C0708.3223%2C0708.0757%2C0708.1843%2C0708.0484&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present a detailed phenomenological study of the prospects of open charm\nphysics at the future $\\bar{p}p$ and $pp$ facilities GSI-FAIR and J-PARC,\nrespectively. In particular, we concentrate on differential cross sections and\nthe charge and longitudinal double-spin asymmetries at next-to-leading order\naccuracy. Theoretical uncertainties for the proposed observables are estimated\nby varying the charm quark mass and the renormalization and factorization\nscales."}, "authors": ["J. Riedl", "A. Schafer", "M. Stratmann"], "author_detail": {"name": "M. Stratmann"}, "author": "M. Stratmann", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1140/epjc/s10052-007-0416-2", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0708.3010v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0708.3010v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "11 pages, 13 figures", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0708.3010v1", "affiliation": "Wako, RIKEN", "arxiv_url": "http://arxiv.org/abs/0708.3010v1", "journal_reference": "Eur.Phys.J.C52:987-997,2007", "doi": "10.1140/epjc/s10052-007-0416-2", "fulltext": "EPJ manuscript No.\n(will be inserted by the editor)\n\narXiv:0708.3010v1 [hep-ph] 22 Aug 2007\n\nProspects of Open Charm Production\nat GSI-FAIR and J-PARC\nJ. Riedl1 , A. Schäfer1 and M. Stratmann2\n1\n2\n\nInstitut für Theoretische Physik, Universität Regensburg, D-93040 Regensburg, Germany\nRadiation Laboratory, RIKEN, 2-1 Hirosawa, Wako, Saitama 351-0198, Japan\n\nAbstract. We present a detailed phenomenological study of the prospects of open charm physics at the\nfuture p̄p and pp facilities GSI-FAIR and J-PARC, respectively. In particular, we concentrate on differential\ncross sections and the charge and longitudinal double-spin asymmetries at next-to-leading order accuracy.\nTheoretical uncertainties for the proposed observables are estimated by varying the charm quark mass and\nthe renormalization and factorization scales.\nPACS. 12.38.Bx – 13.88.+e\n\n1 Motivation and Introduction\nIn recent years, the study of heavy flavors at colliders has\nbecome a versatile tool to probe different aspects of Quantum Chromodynamics (QCD), ranging from heavy flavor\nparton densities and the hadronization of heavy quarks\ninto heavy mesons or baryons to the dynamics of QCD\nhard-scattering [1]. Technological advances, like the introduction of micro-vertex detectors, allow for much better\ntagging of the produced heavy quarks and hence more\nprecise measurements. An equally significant improvement\nof the theoretical foundations for heavy flavor production\nhas been achieved, in particular, novel proposals to overcome limitations of fixed-order calculations and to model\nthe hadronization of heavy quarks more reliably [1]. As a\nconsequence, a discrepancy between data and theory for\nbottom production, suggested by various experiments, has\nbeen reduced to the point that it no longer appears significant [2].\nA solid understanding of the theoretical framework\nfor heavy quark production and its phenomenological inputs is of utmost importance for several key measurements\nboth ongoing or taking place in the very near future [1]. At\nthe LHC, heavy flavor production by genuine QCD processes is an important background to searches for Higgs\nbosons within the Standard Model and beyond, e.g., to the\ndecay H → bb̄, as well as for new physics. At the Relativistic Heavy Ion Collider (RHIC) one wants to establish\nthe existence and to investigate the properties of a new\nstate of matter, the quark-gluon plasma (QGP). Several\nsignatures related to heavy flavors have been proposed, in\nparticular, how their production and decays are modified\nby the presence of a QGP [3]. Here, heavy flavor production in proton-proton collisions will act as a benchmark for\npossible modification in nucleus-nucleus collisions at the\nsame energy [3,4]. In addition, RHIC is also capable to\ncollide longitudinally polarized protons at center-of-mass\n\n√\nsystem (c.m.s.) energies of up to S = 500 GeV. Besides\nits intrinsic interest as an important test of the dynamics\nof spin-dependent hard-scattering in QCD, these measurements are likely to further our understanding of how gluons contribute to the proton spin, a major goal of hadron\nphysics [5].\nIn terms of perturbative QCD (pQCD), relevant fixedorder calculations have been in place for quite some time\nnow, and next-to-leading order (NLO) accuracy is the\nstate-of-the-art throughout. NLO results, which keep the\nfull dependence on the heavy quark mass mQ , for unpolarized hadron-hadron (\"hadroproduction\"), photon-hadron\n(\"photoproduction\"), and electron-hadron (\"electroproduction\") collisions can be found in [6], [7], and [8], respectively. Calculations for longitudinally polarized hadro- [9]\nand photoproduction [10] are more recent achievements.\nIn each case one exploits the fact that mQ acts as an effective infrared cut-off for collinear singularities, which allows\nto compute total heavy quark yields as a perturbative series in the strong coupling αs evaluated at a hard scale\nof O(mQ ). For inclusive transverse-momentum pT distributions, complications arise once pT /mQ ≫ 1, and large\nlogarithms in this ratio have to be resummed to all orders\nin αs to improve the convergence of the perturbative series\n[11].\nIn this paper, we will focus on a detailed phenomenological study of the prospects of open charm production\nin p̄p and pp collisions at the future GSI-FAIR [12] and\nJ-PARC [13] facilities, respectively. For GSI-FAIR we consider the so-called \"collider option\" as proposed by the\nPAX collaboration [14], using a 15 GeV anti-proton and\na 3.5 GeV proton beam, with the plan of having both\nbeams also longitudinally or transversely polarized. The\nmain goal of the PAX experiment would be a determination of the so far unknown \"transversity\" parton densities through the transversely polarized Drell-Yan process.\n\n\f2\n\nJ. Riedl, A. Schäfer, M. Stratmann: Prospects of Open Charm Production at GSI-FAIR and J-PARC\n\nThis measurement would gain substantially from a polarized anti-proton beam due to the dominance of the lowest order (LO) quark-antiquark annihilation channel. The\nJ-PARC facility in Japan is currently being completed.\nHere we consider the collision of a 50 GeV proton beam\nwith a fixed, solid-state target. The possibility of having\nboth beam and target polarized is a conceivable option\nfor future upgrades currently being scrutinized. At GSIFAIR\n√ (J-PARC) the available p̄p (pp) c.m.s. energy will\nbe S ≃ 14.5 (10) GeV. For both experiments the details\nof the detector and the acceptance are not yet finalized.\nWe will make some reasonable assumptions as stated below in Sec. 3.1. We will demonstrate that measurements\nof open charm at these facilities have the potential to further our understanding of the underlying QCD dynamics\nat moderate c.m.s. energies so far little explored.\nFirst, one has to determine, of course, to what extent\nperturbative QCD is applicable at c.m.s. energies of about\n10 to 15 GeV. NLO calculations for single-inclusive pT spectra of pions or photons are known to seriously undershoot data even at somewhat higher c.m.s. energies [15].\nThe mass of the charm quark already sets a hard scale\nof O(1 GeV), which may facilitate the use of perturbative\nQCD even for small or vanishing transverse momenta pT\nof the observed charm quark. Also, since pT ≈ O(mQ ),\nwe do not have to worry about potentially large logarithms ln pT /mQ present at large c.m.s. energies [11], however, partonic threshold effects may become important\nand perhaps need to be resummed to all orders. In case\nof pT -differential pion spectra, it was shown that threshold resummations can lead to a much improved agreement between theory and experiment at low c.m.s. energies [15]. To study the possible relevance of resummations\nat GSI-FAIR and J-PARC, we provide total and differential charm yields for both p̄p and pp collisions at NLO\naccuracy of QCD, including detailed discussions of theoretical uncertainties due to variations of the charm quark\nmass or the renormalization and factorization scales. We\nnote that the computation of threshold resummations for\ncharm production at GSI-FAIR and J-PARC is far beyond\nthe scope of this paper, which aims at a first exploratory\nstudy of charm physics at comparatively low c.m.s. energies.\nOther interesting, though experimentally more challenging observables related to open charm production can\nbe considered at GSI-FAIR and J-PARC. One is the so\ncalled \"charge asymmetry\" which describes the difference\nof cross sections for producing a heavy quark Q or a heavy\nanti-quark Q̄ at a certain point in phase-space:\nAC ≡\n\ndσ Q − dσ Q̄\ndσ Q + dσ Q̄\n\n.\n\n(1)\n\nThis asymmetry probes a subset of NLO radiative corrections and vanishes at the LO approximation. This feature\nmakes it an important test of QCD hard scattering dynamics. The Abelian (QED) part of AC is also known as\nforward-backward asymmetry [16] and is caused by the\ninterference of states with different C-parity. It should be\nmentioned that routinely used event generators based on\n\nLO matrix elements cannot predict this interesting effect.\nIn the unpolarized case the charge asymmetry was first\nmentioned in [17,6] and later studied qualitatively in [18,\n19], mainly for top production at the TeVatron and the\nLHC. A first measurement of AC for top production has\nbeen recently reported by the CDF collaboration [20]. We\nestimate the size of this effect for GSI-FAIR and J-PARC\nand, for the first time, compute the corresponding charge\nasymmetry also for polarized hadroproduction. We will\ngive more details in Sec. 2.2.\nProvided that longitudinally polarized beams and targets will be available at GSI-FAIR and/or J-PARC, studies of the double-spin asymmetry\nALL ≡\n\nd∆σ\n.\ndσ\n\n(2)\n\ncould provide unique insight in the distributions describing the polarization of quarks and gluons in the nucleon\nat medium-to-large momentum fractions x. In (2), d∆σ\ndenotes the spin-dependent cross section, which can be\nobtained by taking the difference of measurements with\nthe (anti-)proton spins aligned and anti-aligned. The unpolarized cross section dσ is determined by the sum of\nboth measurements. We will explore the sensitivity of ALL\nto different assumptions about polarized parton densities,\nin particular, the elusive gluon polarization. As for the\nunpolarized cross sections, we discuss theoretical uncertainties related to variations of the charm quark mass and\nthe renormalization and factorization scales.\nThe paper is organized as follows: in Sec. 2 we briefly\nreview the technical framework for hadroproduction of\nheavy flavors, set our notation, and introduce in some\ndetail the charge asymmetry. Section 3 is devoted to numerical studies. First we define the phenomenological inputs and experimental cuts we assume for GSI-FAIR and\nJ-PARC. Next, we give results for total and differential\nunpolarized charm cross sections and discuss their theoretical uncertainties. These results serve as a future benchmark to study\n√ the applicability of pQCD for charm production at S ≃ 10 GeV. Then we present expectations\nfor the polarized cross sections and charge and double spin\nasymmetries. We briefly summarize the main results in\nSec. 4.\n\n2 Technical Framework\nThe pQCD framework for single-inclusive heavy flavor\nproduction at NLO accuracy in both unpolarized and longitudinally polarized hadron-hadron collisions has been\ndiscussed in detail in Refs. [6] and [9], respectively. We\ncan restrict ourselves to a brief summary of the aspects\nwith particular relevance to our analysis.\n2.1 The single-inclusive cross section\nWe are interested in the hadroproduction of a heavy quark\nQ [anti-quark Q̄] with mass mQ and four-momentum PQ\n\n\fJ. Riedl, A. Schäfer, M. Stratmann: Prospects of Open Charm Production at GSI-FAIR and J-PARC\n\n[PQ̄ ]:\nH1 (P1 )H2 (P2 ) → Q(PQ )[Q̄(PQ̄ )] + X.\n\n(3)\n\nX includes all other final-state particles such that (3) is\ninclusive with respect to the detected heavy quark. P1,2\ndenote the momenta of the colliding hadrons H1,2 and\nS = (P1 + P2 )2 the c.m.s. energy squared.\nMore specifically, PQ can be parameterized in terms\nof the transverse momentum pT , the rapidity y, and the\nazimuthal angle φ of the observed heavy quark Q,\nPQ = (mT cosh y, pT sin φ, pT cos φ, mT sinh y),\n(4)\nq\nwhere the transverse mass is defined as mT = p2T + m2Q\n\nwhere X = Q̄. The O(αs ) radiative corrections to (6) comprise additional real gluon emission, X = Q̄g, as well as\none-loop (virtual) contributions. In addition, a new type\nof subprocess, gluon-[anti]quark-scattering, gq[q̄] → QX\nhas to be considered at NLO. A detailed account of the\ncalculation of the relevant matrix elements, the required\nloop and phase-space integrations, and the cancellation of\nsingularities is given in Refs. [6] and [9].\nSince mQ acts as an effective cut-off for collinear singularities, also total heavy quark yields are amenable to\npQCD. They are obtained by integrating (5) over the entire phase-space using\nZ\n\nand y = 21 ln[(E + Pz )/(E − Pz )]. Applying the factorization theorem, the unpolarized differential cross section for\n(3) can be written schematically as\n\nZ\n\n2 Q\n\nX\nd σ\n=\nfaH1 (x1 , μf ) ⊗ fbH2 (x2 , μf )\n2\ndmT dy\nab\n\n⊗\n\nd2 σ̂ab→QX (x1 , x2 , P1 , P2 , PQ , μf , μr )\n(5)\ndm2T dy\n\nwith the symbol ⊗ indicating a convolution. x1 and x2 are\nthe fractions of P1 and P2 taken by the partons faH1 and\nfbH2 with flavor a and b, respectively. The sum in Eq. (5)\nis to be performed over all contributing partonic channels\nab → QX with dσ̂ab→QX the associated partonic cross\nsections.\nThe factorization of the cross section (5) into nonperturbative parton densities fa,b and short-distance cross\nsections requires the introduction of factorization and renormalization scales μf and μr , respectively. These scales\nare essentially arbitrary and usually chosen to be of the\norder of a hard momentum transfer characterizing the process under consideration. Any residual dependence of the\nright-hand-side (r.h.s.) of Eq. (5) on the actual choice for\nμf,r represents an important part of the uncertainties in\nthe theoretical description of (3).\nThe basic framework outlined above carries over to\nthe case of polarized hadron-hadron collisions as well. To\nobtain the spin-dependent cross section d2 ∆σ/dm2T dy entering the experimentally relevant spin asymmetry ALL\ndefined in Eq. (2), the parton densities and hard scattering\ncross sections on the r.h.s. of Eq. (5) have to be replaced\nby their polarized counterparts ∆fa,b and d∆σ̂ab→QX , respectively.\nKnowledge of higher-order corrections in the perturbative expansion of the partonic cross sections dσ̂ab→QX and\nd∆σ̂ab→QX is generally indispensable. On the one hand,\nin hadronic scattering they are often sizable, and, on the\nother hand, they are expected to reduce the artificial dependence on the choice of μf,r . Also, higher-order corrections affect unpolarized and polarized cross sections differently and hence do not cancel in the ratio ALL .\nAt O(α2s ), the LO approximation, the hadroproduction of heavy quarks proceeds through only two partonic\nchannels\ngg → QX and q q̄ → QX\n(6)\n\n3\n\nwhere β ≡\n\nS/4\nm2Q\n1\n2\n\ndm2T\n\nln\n\nZ\n\n1+β\n1−β\n1+β\n1−β\n\n√\n\nS/(2mT )\n\n√\n− cosh−1 S/(2mT )\n\ndy\n− 21 ln\n\ncosh−1\n\nZ\n\ndy =\n\nS/(4 cosh2 y)\n\nm2Q\n\ndm2T ,\n\n(7)\n\nq\n1 − 4m2Q /S. Alternatively, one can first de-\n\nrive the so-called \"scaling functions\", [∆]σ̂ab (s, m2Q ), as a\nfunction of the partonic c.m.s. energy s by integrating the\npartonic cross sections d[∆]σ̂ab→QX [6,9], which then in\nturn have to be combined with the appropriate combination of parton densities. We note that the experimental\ndetermination of the total cross section always involves\nsome extrapolation beyond the accessible ranges in pT and\ny and is therefore less reliable and useful than differential\nrates in testing pQCD predictions. In our numerical studies for J-PARC and GSI-FAIR we will therefore mainly\nfocus on differential cross sections, which are also relevant\nfor the charge asymmetry.\n\n2.2 The charge asymmetry\nAt the LO approximation the processes (6) relevant for\nheavy flavor production do not discriminate between a\nproduced heavy quark Q and a heavy anti-quark Q̄. Hence,\nat any given point (pT , y) in phase-space the yields (5) for\nQ and Q̄ are identical.\nRadiative corrections change this picture and give rise\nto the charge asymmetry AC , defined in Eq. (1). Any measurement of AC will directly probe and perhaps improve\nour understanding of QCD dynamics beyond the LO. So\nfar this higher-order effect has received relatively little attention [17,18,19] but was recently measured for the first\ntime in case of top production at CDF [20], the asymmetry exceeding the few percent predicted in [18] with\nlarge experimental uncertainties though. We will explore\nthe prospects of accessing AC in pp and p̄p collisions at JPARC and GSI-FAIR, respectively. Due to the relatively\nlow c.m.s. energies available, we have to limit ourselves\nto charm quark production. Given that longitudinally polarized beams and targets are a viable option, we also\nexplore the polarized charge asymmetry, which we define\nas in Eq. (1) with the cross sections dσ Q[Q̄] replaced by\ntheir polarized counterparts d∆σ Q[Q̄] .\n\n\f4\n\nJ. Riedl, A. Schäfer, M. Stratmann: Prospects of Open Charm Production at GSI-FAIR and J-PARC\n\nfor all i, j. By interchanging Q and Q̄, the Dirac structure relevant for Mi M∗j changes sign for an odd number\nof propagators in the heavy quark trace and otherwise\nremains the same. The color structure is invariant, except for Tr[Tk Tl Tm ] = (dklm + ifklm )/4 which contains a\nsymmetric and an anti-symmetric piece, dklm = dmlk and\nfklm = −fmlk , respectively.\nCombining everything, only those cut diagrams with\nthree vertices on both the heavy and the light quark line,\ncf. Figs. 1 and 2, contribute to AC , and one finds [18]\n\nFig. 1. Sample q q̄ cut diagram contributing to AC .\n\n∆ij =\n\nFig. 2. Sample gq cut diagram contributing to AC .\n\nAt NLO the charge asymmetry receives only a very\nlimited number of contributions. Instead of making use of\nthe results available in the literature [6,9], we chose to recalculate the numerator of AC from scratch in both the unpolarized and polarized case1 . The origin of AC resides in\nthe Abelian (QED) part of the higher order processes and\nrelates to the interference between amplitudes which are\nrelatively odd under the exchange of Q and Q̄. The gluongluon fusion process in (6) is evidently charge symmetric\nalso beyond the LO and does not contribute to AC . Also\nnon-Abelian amplitudes involving the triple-gluon vertex\ndepend only on Q + Q̄ and lead to contributions which are\nsymmetric under exchanging Q and Q̄. Upon close examination of the remaining amplitudes for the q q̄ and gq [g q̄]\ninitiated subprocesses at NLO, one finds that only such\n\"cut diagrams\" contribute which have three vertices on\nboth the heavy and light quark line. In case of the virtual\nloop corrections to the LO q q̄ process, only the interference\nof the box diagrams with the Born amplitude contributes.\nExamples of cut diagrams relevant for the computation of\nAC and ∆AC are depicted in Figs. 1 and 2.\nThis observation can be readily understood. To this\nend, let us write the partonic subprocess cross section\ndσ̂ab→QX as the sum of the interference contributions of\nall contributing amplitudes labeled by the indices i, j\ndσ̂ab→QX = Kab\n\nX\nij\n\nMi M∗j\n\nab→QX\n\n.\n\n(8)\n\nFor simplicity, pre-factors such as the spin and color averages are mapped into Kab . Phase-space integration for\nall unobserved partons is implicitly understood in (8). Expressions similar to (8) hold for polarized partonic cross\nsections d∆σ̂ab→QX as well as for ab → Q̄X. For the numerator of AC we have to examine the difference\n∆ij =\n1\n\nMi M∗j\n\nab→QX\n\n−\n\nMi M∗j\n\nab→Q̄X\n\n(9)\n\nThe lengthy expressions are available upon request from\nthe authors.\n\n1\n∗\n^\n(dklm )2 M\ni Mj\n8\n\nab→QX\n\n,\n\n(10)\n\n∗\n^\nwith (dklm )2 = 40/3. M\ni Mj denotes the interference of\nthe two amplitudes with the QCD color structure taken\naside, and is the same (up to pre-factors) as for corresponding QED processes [16], e.g, e+ e− → μ+ μ− γ. Let\nus mention that there is a similar effect in the QCD scale\nevolution of parton densities at next-to-next-to-leading order (NNLO) also proportional to (dklm )2 and leading to a\nstrange quark asymmetry s(x) 6= s̄(x) [21].\nAll contributions to the numerator of AC at O(α3s ) are\nfree of ultraviolet as well as collinear singularities as a consequence of the symmetry of the LO processes (6) under\nexchanging Q and Q̄. Infrared (IR) singularities appear\nin both real gluon emission and virtual loop corrections\nto the LO q q̄ process and cancel in the sum. Effectively\nthis implies that the NLO matrix elements only contain\nthe charge asymmetry at LO approximation. As in [6,9]\nwe use dimensional regularization to deal with IR poles in\nintermediate steps of the calculation. In [18] a small gluon\ng\nenergy Ecut\nwas used to cut off IR singularities. While\nthe charge asymmetry also appears in the limit mQ → 0,\nit vanishes for the total heavy quark cross section as a\nconsequence of charge conjugation invariance.\nIn Sec. 3.3 we give some quantitative predictions for\nAC and ∆AC at J-PARC and GSI-FAIR. Due to the low\nc.m.s. energies, gluons are much less abundant than at\nhigh-energy colliders. Since gluon-gluon fusion only contributes to the denominator of AC , the prospects for studying AC can be in fact more favorable at GSI-FAIR or JPARC than at colliders like the TeVatron or the LHC.\nHere, gluon-gluon fusion is by far the dominant mechanism for heavy quark production, and one has to find\nsuitable corners of phase-space to make AC experimentally accessible. One important possibility is top quark\nproduction [18,19,20], which receives important contributions from q q̄ annihilation also at large S thanks to the\nsizable mQ .\n\n3 Phenomenological Applications\nBefore turning to the prospects of heavy flavor physics at\nGSI-FAIR and J-PARC, we quickly review the information on charm\n√ production in pp collisions at c.m.s. energies below S = 50 GeV gathered so far. Figure 3 shows\nthe available data [22] compared to our calculations at\nNLO accuracy using different values of the charm quark\n\n\fJ. Riedl, A. Schäfer, M. Stratmann: Prospects of Open Charm Production at GSI-FAIR and J-PARC\n\n10 2\n\nE653\n\nσ [μb]\ncc\n\n1.25\n1.35\n1.45\n\nE743\nNA27\n\nmc\n\nE769\n\n[GeV]\nHERA-B\n\n10\nNA16\n\nNA32\n\n1\n\n10\n\n-1\n\n8 9 10\n\n20\n\n30\n\n40\n\n50\n\n60 70 80 90\n\n√S [GeV]\nFig. 3. Experimental results [22] for the total charm production cross section at fixed-target energies compared to NLO\npQCD calculations for three different values of the charm quark\nmass mc . In each case, the shaded band indicates the theoretical uncertainties from varying μ = μr = μf in the range\nmc ≤ μ ≤ 2mc .\n\nmass and scales μ = μf = μr in Eq. (5). As can be seen,\nuncertainties from small variations of mc are as important as scale ambiguities, and both combined can lead to\nalmost an\n√ order of magnitude change in the total charm\nyield at S ≃ 10 ÷ 20 GeV. From Fig. 3 one can also infer\nthat the theoretical uncertainties become somewhat less\npronounced with increasing c.m.s. energy.\nAlthough most experimental results can be described\nwith the same choice of mc and scale μ, there is a clear\nneed for further precise measurements, in particular closer\nto threshold, below the result of NA32, which does not\nline up so well with other experiments. GSI-FAIR and JPARC, to which we shall turn now, can explore this energy\nrange in the future.\n\n5\n\nboth beam and target being unpolarized. We also consider\nlongitudinally polarized collisions, which are a conceivable\nupgrade of the J-PARC facility in the future [13]. Since\nnot very much is known about the experimental set-up at\nthis stage, we assume a forward spectrometer geometry\nwith a 200 mrad acceptance, similar to the one used by\nthe COMPASS experiment at CERN.\nSince the details of charm detection in experiment are\nnot yet available, we will perform all our calculations on\nthe charm quark level, i.e., we do not attempt to model\nthe hadronization of charm quarks into charmed mesons\nand their subsequent decays. For the PAX experiment,\nhowever, identification of open charm events most likely\nproceeds through the detection of decay muons for which\na lower limit on their momentum of pμ = 1 GeV is required [14,23]. Therefore we impose a similar cut on the\nlaboratory momentum of the primary charm quark in all\nour calculations for GSI-FAIR.\nIn all unpolarized calculations at LO and NLO accuracy we use the CTEQ6L1 and CTEQ6M parton distribution functions [24] and the corresponding LO and NLO\nvalues for the strong coupling, respectively. Unless stated\notherwise, the GRSV \"standard\" set of helicity-dependent\nparton densities [25] is used in the computation of polarized cross sections and the charge and spin asymmetries.\nSince mc = 1.35 GeV provides a good description of most\nof the data shown in Fig. 3, we make this our default\nchoice for the charm quark mass.\n3.2 Expectations for charm production cross sections\n\nFigure 4 shows our expectations for the unpolarized charm\nproduction cross section (5) at GSI-FAIR at LO and NLO\naccuracy, integrated over transverse momentum pT > pmin\nT\nand the angular acceptance of 5◦ ≤ θc ≤ 130◦ for PAX.\nThe shaded bands indicate the theoretical uncertainties\nwhen the factorization and renormalization scales are varied simultaneously in the range mmin\n≤ μf = μr ≤ 2mmin\nT\nT .\nAlso shown in Fig. 4 are the \"K-factors\", the ratio of\nthe NLO and LO cross sections, for two choices of scales\nμf = μr and the fractional contributions of the different\nc\npartonic channels σij\nto the NLO cross section.\nBesides the sizable dependence on the scales μf,r , there\n3.1 Phenomenological inputs and experimental cuts\nis also a similar uncertainty due to the choice of mc in the\nregion pmin\n. 1 GeV, in line with the observations for the\nT\nThe part of the future GSI-FAIR accelerator complex ame- total charm yields in Fig. 3. For pmin\n& 2 GeV, however,\nT\nnable to pQCD studies is an asymmetric proton-antiproton varying mc in the range 1.25 GeV ≤ mc ≤ 1.45 GeV has a\ncollider option proposed by the PAX collaboration [14] negligible impact on the cross section shown in the upper\nwith maximum beam energies for protons and antiprotons panel of Fig. 4. It is worth to notice that there is only\nof 3.5 GeV and 15√GeV, respectively, resulting in a c.m.s. a rather marginal reduction in the scale ambiguity when\nenergy of about S = 14.5 GeV. Studies of methods to going from the LO to the NLO approximation. This is\npolarize both beams either longitudinally or transversely not unexpected for experiments with limited c.m.s. enerare currently pursued [14]. The PAX detector will have gies, and similar observations have been made for singlenearly full azimuthal acceptance and a polar angle cover- inclusive hadron production [26]. From the lower panel of\nage from 5 to 130 degrees is envisioned [14,23].\nFig. 4 one can infer that the quark-antiquark annihilation\nThe proton accelerator at J-PARC, which will reach up subprocess is the most important contribution to the cross\nto 50 GeV beam energy, is currently under construction, section. This can be readily understood since quarks and\nand the hadron physics programme will\n√commence in the antiquarks are both \"valence\" partons in the proton and\nnear future at a c.m.s. energy of about S = 10 GeV with antiproton, respectively, and from the fact that one probes\n\n\f6\n\nJ. Riedl, A. Schäfer, M. Stratmann: Prospects of Open Charm Production at GSI-FAIR and J-PARC\n\n10 7\n\nσ (pT >\nc\n\n6\n\n10\n\nmin\npT )\n\n10 6\n\n[pb]\n\n10 5\n\n10 4\n\n10 4\n\n10 3\n\n3\n\n10 2\n\n10\n\nNLO\n\n10 2\n\nμ=\n\n1\n10\n\n-1\n\nc\n\nJ-PARC\n\n1\n\nmin\nmT\nmin\n2mT\n\nLO (× 0.1)\n\n10\n10\n\n-1\n\nμ=\n\n-2\n\nmin\n\nmT\nmin\n2mT\n\nLO (× 0.1)\n\nσ (NLO) / σ (LO)\nc\n\n2\n\nc\n\nμ=\n\nμ = mTmin\n\n10\n\n2mmin\nT\n\nμ = mTmin\n\n1\n\n0.5\n\nqq\n\n1\n\nσij / σ\n\nc\n\ngg\nqq\ngq\n\n0\n1\n\n2\n\n3\n\n4 min\n\nμ = 2mmin\nT\n\nc\n\n0.5\n\ngq\n0\n\nσ (NLO) / σ (LO)\nc\n\ngg\n\n0\n\n1\n\nc\n\nσcij / σc\n\n1\n\nmin\n\nNLO\n\n10\n\nGSI-FAIR\n\n10\n\nσ (pT > pT ) [pb]\n\n10 5\n\n5\n\npT [GeV]\n\nFig. 4. upper panel: LO and NLO unpolarized charm cross\nsection at GSI-FAIR, integrated over pT > pmin\nand the anT\ngular acceptance 5◦ ≤ θc ≤ 130◦ , using mc = 1.35 GeV.\nThe shaded bands indicate the uncertainties from varying\nμ = μr = μf in the range mmin\n≤ μ ≤ 2mmin\nT\nT ; middle panel: ratio of the NLO and LO cross sections (\"K-factor\"); lower panel:\nc\nfractional contribution of the different partonic channels σij\nto\n√ min\nc\nthe NLO cross section σ for μ = 2mT .\n\nfairly large momentum fractions x1,2 & 0.1. The genuine\nNLO quark-gluon subprocess is negligible in the entire pT\nrange shown.\nThe corresponding results for J-PARC are summarized\nin Fig. 5. There are striking differences compared to the\nresult for GSI-FAIR shown in the previous figure. The dependence of the charm cross section on unphysical scales\nμf,r is even larger here and does not improve when NLO\ncorrections are included. This can be taken as a strong indication that higher order terms in the perturbative series\nare very important. Hopefully, a resummation of the leading terms to all orders in αs will tame the scale ambiguities. Secondly, the size of the NLO corrections compared to\nthe LO term, displayed in the middle panel of Fig. 5, seems\nto be beyond control. Most of the pathological behavior\nof the K-factor at large pmin\ncan be attributed to the difT\nferences in the LO and NLO gluon distributions at large\nx1,2 , where they are basically unconstrained by data [24].\nIf one uses NLO parton densities in the calculation of the\nLO cross section, the K-factor does not show such a sharp\nrise, though it remains large (dotted curve in Fig. 5). Despite the rather large x1,2 values probed at J-PARC, and\ncontrary to what happens in p̄p collisions at GSI-FAIR,\n\n0\n\n1\n\n2\n\nmin\n\npT [GeV]\n\n3\n\nFig. 5. Same as in Figure 4, but now for J-PARC kinematics.\n\nthe gluon-gluon fusion subprocess is by far the dominant\nmechanism to produce the charm quark. We also note that\nvarying mc in the range 1.25 GeV ≤ mc ≤ 1.45 GeV has\na somewhat bigger impact on the cross sections displayed\nin the upper panel of Fig. 5 than in case of GSI-FAIR due\nto the smaller c.m.s. energy.\nFigures 4 and 5 already demonstrate the potential of\nfuture low energy p̄p and pp experiments in further constraining quark and gluon distributions, respectively, in\nthe medium-to-large x region, difficult to access at high\nenergy colliders. They also show, however, that the pQCD\nframework can not be taken for granted in this energy\nregime, and its applicability has to be carefully scrutinized first by comparing the theoretical expectations with\ndata.\nFigure 6 shows the corresponding longitudinally polarized cross sections at NLO accuracy for GSI-FAIR and JPARC, respectively. Instead of giving also the LO results\n[the K-factors are smaller than in the unpolarized case,\nbetween 1.5 and 2 (2 and 4) for GSI-FAIR (J-PARC)],\nwe chose to display the dependence of the polarized cross\nsections on mc . Since J-PARC can cover only a√smaller\nrange in pT than GSI-FAIR due to the smaller S, the\nmass effects are more important here. The fractional contributions of the different subprocesses are very similar to\nthose shown in Fig. 4 for GSI-FAIR and strongly dependent on the size of the polarized gluon distribution in case\nof J-PARC, as can be expected already from the lower\npanel of Fig. 5. We note that at J-PARC kinematics, the\n\n\fJ. Riedl, A. Schäfer, M. Stratmann: Prospects of Open Charm Production at GSI-FAIR and J-PARC\n\n7\n\n70000\n10\n\n-∆σc (pT > pTmin) [pb]\n\n5\n\n∆σ (pT > pT ) [pb]\nc\n\nmin\n\n60000\n\n10 4\n\n50000\n\n10 3\n\n40000\n\n10 2\n\n30000\n\nGSI-FAIR\n10\n\nJ-PARC\n\n20000\n\nmc = 1.45 GeV\n\n10000\n\nmc = 1.35 GeV\n\n1\n\nmc = 1.25 GeV\n\n0\n\n1\n\n2\n\n3\n\n0\n4\n\npmin\nT\n\n5 0\n[GeV]\n\n1\n\n2\n3\npmin\n[GeV]\nT\n\nFig. 6. Expectations for the longitudinally polarized cross section for charm production at GSI-FAIR (left panel) and J-PARC\n(right panel), using the GRSV \"standard\" set [25]. Note that the results on the left hand side are for −∆σ. The scale uncertainty\nis shown for three different choices of mc , varying μ = μr = μf in the range mmin\n≤ μ ≤ 2mmin\nT\nT .\n\npolarized cross section exhibits a node at pmin\n≃ 1 GeV\nT\nif the GRSV \"standard\" parton densities are used in the\ncalculation.\n\n0.3\n0.2\n\nAC\n\n3.3 The unpolarized and polarized charge asymmetry\n\n0.1\n\nGSI-FAIR\n\nWe now turn to a detailed discussion of the charge asymmetry AC defined in Eq. (1) and Sec. 2.2. We show expectations for the size of the effect and discuss the theoretical\nuncertainties due to variations of μf,r and mc . All results\nare presented as a function of the c.m.s. rapidity y of the\nheavy (anti-)quark, which is related to the rapidity in the\nlaboratory frame ylab by a simple additive boost. Positive\nrapidities refer to the direction of the anti-proton and proton beam at GSI-FAIR and J-PARC, respectively. Recall\nthat rapidity y and pseudo-rapidity η are not the same for\nmassive particles. The relation between y and the scattering angle θc of the heavy quark depends both on pT and\nmc\ns\n! s\nm2T\nm2T\ncos θc =\ntanh\ny\n/\n− m2c\n1 − tanh2 y\n1 − tanh2 y\n(11)\nwhile cos θc = tanh η. Therefore, angular cuts imposed\nupon the heavy quarks by the experiments do not translate in simple, pT independent cuts for rapidity-dependent\ndifferential cross sections.\nThe upper panels of Figs. 7 and 8 show our expectations for the unpolarized charge asymmetry AC at O(α3s )\n\n0\nmc = 1.45 GeV\n\n-0.1\n\nmc = 1.35 GeV\nmc = 1.25 GeV\n\ndσc/dy + dσc/dy [pb]\n\n15\n10\n\n5\n\n0\n-2\n\n-1\n\n0\n\n1\n\ny\n\n2\n\nFig. 7. The unpolarized charge asymmetry AC (upper panel)\nand the NLO c.m.s. rapidity-dependent differential charm plus\nanti-charm cross section dσ c /dy+dσ c̄/dy (lower panel) for GSIFAIR. The scale uncertainty is shown for three different choices\nof mc , varying μ = μr = μf in the range mc ≤ μ ≤ 2mc .\n\n\f8\n\nJ. Riedl, A. Schäfer, M. Stratmann: Prospects of Open Charm Production at GSI-FAIR and J-PARC\n\n1\n0.04\n\nAC\n\n∆AC\n\nmc = 1.45 GeV\n\n0.5\n\nmc = 1.35 GeV\n\n0.02\n\nGSI-FAIR\n\nmc = 1.25 GeV\n\n0\nmc = 1.45 GeV\n\n0\n\nmc = 1.35 GeV\n\n-0.5\n\nJ-PARC\n\n-0.02\n\nmc = 1.25 GeV\n\n0.02\n\ndσc/dy + dσc/dy [pb]\n\n0.01\n\n2\n\n0\n1\n\n-0.01\n\nJ-PARC\n-0.02\n\n0\n-2\n\n-1\n\n0\n\n1\n\ny\n\n2\n\nFig. 8. Same as in Fig. 7 but for J-PARC kinematics.\n\nfor charm quarks at GSI-FAIR and J-PARC, respectively,\nusing the phenomenological inputs and experimental acceptance cuts specified in Sec. 3.1. The results for AC are\nlargely independent of the choice for the charm quark mass\nmc , in contrast to the sizable mass dependence observed\nfor the NLO c.m.s. rapidity-dependent differential cross\nsections for the sum of charm and anti-charm production\n(lower panels), which enters in the denominator of AC in\nEq. (1).\nNote that the c.m.s. rapidity y and the experimentally relevant rapidity ylab in the laboratory frame are\nsimply related by ylab = y − 0.737 and ylab = y + 2.334\nfor GSI-FAIR and J-PARC, respectively. The scale μf,r\ndependence partially cancels out in AC , as can be seen by\ncomparing the upper and lower panels of Figs. 7 and 8. A\nresidual dependence on μf,r is not surprising since the numerator of AC at O(α3s ) is effectively a LO approximation.\nIt vanishes at O(α2s ) and is free of collinear singularities.\nAlso note that the sharp drop of dσ c /dy + dσ c̄ /dy in the\nlower panel of Fig. 7 is due to the cut imposed on the\nmomentum of the heavy (anti-)quark, plab > 1 GeV.\nFigure 9 shows our results for the longitudinally polarized charge asymmetry ∆AC defined as in Eq. (1), but\nwith all cross sections dσ replaced by their helicity dependent counterparts d∆σ. Again, the scale uncertainty is\nshown for three different choices of mc , varying μ = μr =\nμf in the range mc ≤ μ ≤ 2mc . All results are obtained\nwith the GRSV \"standard\" set [25] of spin-dependent parton densities. As in the unpolarized case, the mass dependence largely drops out in ∆AC , in particular for GSIFAIR, but a residual scale μf,r ambiguity remains.\nSince the mass and scale dependence of d∆σ c /dy +\nd∆σ c̄ /dy is qualitatively very similar to the corresponding\nunpolarized cases shown in the lower panels of Figs. 7 and\n\n-2\n\n-1\n\n0\n\n1\n\ny\n\n2\n\nFig. 9. Same as in the upper panels of Figs. 7 and 8 but now\nfor the polarized charge asymmetry ∆AC .\n\nc\n\nc\n\nd∆σ /dy - d∆σ /dy [μb]\n\n0.001\n\n0\nGRSV std.\nAAC\nDNS (KRE)\nDNS (KKP)\n\n-0.001\n\nc\n\nc\n\nd∆σ /dy + d∆σ /dy [μb]\n\n0.1\n\nJ-PARC\n0.05\n\n0\n\n-2\n\n-1\n\n0\n\n1\n\ny\n\n2\n\nFig. 10. Numerator (upper panel) and denominator (lower\npanel) of the polarized charge asymmetry ∆AC at J-PARC,\ncalculated with different sets of polarized parton densities.\n\n8, we refrain from giving these results here. Instead, we\nshall discuss the significant dependence of both numerator\nand denominator of ∆Ac on the choice of a particular set\nof polarized parton densities.\nFigure 10 shows the numerator and the denominator\nof the polarized charge asymmetry ∆AC at J-PARC, ob-\n\n\fJ. Riedl, A. Schäfer, M. Stratmann: Prospects of Open Charm Production at GSI-FAIR and J-PARC\n\n9\n\n0\n0.06\n\nALL\n\n-0.1\n\nALL\n0.04\n\n-0.2\n\n0.02\n\n-0.3\n\n0\n\nGSI-FAIR\n-0.02\n\nmc = 1.45 GeV\n\n-0.4\n\nmc = 1.35 GeV\n\nJ-PARC\n\nmc = 1.25 GeV\n\n-0.04\n\n-0.5\n0\n\n1\n\n2\n\n3\n\n4\n5 0\nmin\npT [GeV]\n\n1\n\n2\n3\npmin\n[GeV]\nT\n\nFig. 11. The integrated double-spin asymmetry ALL as function of pmin\nat NLO accuracy for GSI-FAIR (left panel) and JT\nPARC (right panel) using the GRSV \"standard\" distributions and the same experimental cuts as before. The scale uncertainty\nis shown for three different choices of mc , varying μ = μr = μf in the range mmin\n≤ μ ≤ 2mmin\nT\nT .\n\ntained with different sets of polarized parton densities.\nApart from our default set, GRSV \"standard\", we also use\nthe sets of AAC [27] and DNS [28]. The latter is based on\nan analysis using also data from polarized semi-inclusive\ndeep-inelastic scattering. Two different choices of partonto-hadron fragmentation functions have been made in the\nDNS analysis, and the two resulting sets, labeled as DNS\n(KRE) and DNS (KKP) in Fig. 10, differ mainly in the\nsea quark content, in particular, ∆ū, which has opposite sign in both sets. The positive polarization of ∆ū in\nDNS (KKP), unlike in all others sets of spin-dependent\nparton densities, is responsible for the opposite sign of\nd∆σ c /dy±d∆σ c̄ /dy obtained with DNS (KKP). In the denominator of ∆AC , gluon-gluon fusion does not drop out\nand can make a significant contribution depending on the\namount of gluon polarization ∆g. The set with the largest\n∆g, AAC, gives the largest cross section. The other three\nsets have relatively small gluon distributions and quarkantiquark annihilation is equally important. On the other\nhand, different sets of polarized parton densities have only\nvery limited impact on the results for d∆σ c /dy ±d∆σ c̄ /dy\nand ∆AC for GSI-FAIR.\nThis can be expected, since in p̄p\n√\ncollisions at small S one predominantly probes the fairly\nwell constrained valence quark distributions, and uncertainties in the polarized sea-quark and gluon densities do\nnot matter much.\nFinally, we note that without taking into account any\nexperimental cuts, AC and ∆AC are anti-symmetric functions in the c.m.s. rapidity for p̄p collisions, as can be anticipated from Figs. 7 - 9 (which, however, do include certain\n\nacceptance cuts). Similarly, AC and ∆AC are symmetric\nin c.m.s. rapidity for pp experiments. This is a consequence\nof the anti-symmetric and symmetric initial states p̄p and\npp, respectively. The charge asymmetry on the partonic\nlevel for the dominant q q̄ subprocess implies that Q is\npreferentially emitted into the direction of q and Q̄ into\nthe direction of q̄. As was explained in [18], in pp collisions\none then finds an excess of centrally produced Q̄, while Q\ndominates at large absolute rapidities. This is also what we\nobserve for J-PARC in Figs. 8 and 9. The size of AC and\n∆AC for pp collisions at J-PARC is significantly smaller\nthan for p̄p collisions at GSI-FAIR, simply because of the\nfact that for the relevant q q̄ subprocess both partons are\nvalence quarks in p̄p, greatly enhancing its relative contribution. When integrated over rapidity and without any\nkinematical restrictions, AC and ∆AC vanish, and the total yields of charm and anti-charm quarks are the same.\n3.4 Expectation for longitudinal spin asymmetries\nExperiments usually present their spin-dependent measurements in terms of spin-asymmetries rather than polarized cross sections. The double-spin asymmetry ALL ,\ndefined in Eq. (2), has the advantage that many experimental uncertainties cancel in the ratio, in particular, it\nis not required to determine the absolute normalization\nof the helicity dependent cross sections. Also, theoretical\nuncertainties may cancel to some extent in ALL . However,\nbefore exploiting this, one has to make sure that pQCD is\n\n\f10\n\nJ. Riedl, A. Schäfer, M. Stratmann: Prospects of Open Charm Production at GSI-FAIR and J-PARC\n\n0\n\nALL\n\n-0.1\n\nALL\n\n0.2\n0.15\n\n-0.2\n0.1\n-0.3\n\n0.05\n\nGSI-FAIR\n-0.4\n\n0\n\nGRSV std.\nAAC\nDNS (KRE)\n\n-0.5\n\nJ-PARC\n\nDNS (KKP)\n\n0\n\n1\n\n2\n\n3\n\n4\n5 0\nmin\npT [GeV]\n\n1\n\n-0.05\n2\n3\npmin\n[GeV]\nT\n\nFig. 12. As in Fig. 11 but\n√ now comparing the results obtained with different sets of polarized parton densities using mc =\n1.35 GeV and μf = μr = 2mmin\nT .\n\nFigure 11 shows the integrated double-spin asymmetry\nALL as function of pmin\nat NLO accuracy for GSI-FAIR\nT\n(left panel) and J-PARC (right panel), using the GRSV\n\"standard\" distributions and the same experimental cuts\nas for the underlying cross sections shown in Figs. 4 - 6.\nAs usual, the scale uncertainty is shown for three different choices of mc , varying μ = μr = μf in the range\nmmin\n≤ μ ≤ 2mmin\nT\nT . As can be seen, there is still a significant scale ambiguity and, in case of J-PARC, also a dependence on mc . We refrain from showing LO results, but\nwe note that because NLO corrections tend to be larger in\nthe unpolarized case, as discussed above, ALL is typically\nreduced by a factor of about two when NLO corrections\nare included.\n\n0\n-0.05\n-0.1\n\nALL\n\n-0.15\n\nGSI-FAIR\n0.1\n\nJ-PARC\n0.05\nmc = 1.45 GeV\nmc = 1.35 GeV\nmc = 1.25 GeV\n\n0\n-2\n\n-1\n\n0\n\n1\n\ny\n\n2\n\nFig. 13. As in Fig. 11 but now as function of the c.m.s. rapidity\ny. The scales μf,r are varied in the range mc ≤ μf = μr ≤ 2mc .\n\napplicable in the relevant kinematical regime by comparing, for instance, the unpolarized cross section with data.\n\nThe sensitivity of ALL to different sets of polarized\nparton distributions is studied in Fig. 12. As expected, the\ndifferences are small for GSI-FAIR which mainly probes\nthe fairly well known valence distributions. Only at large\npmin\nT , which corresponds to currently unexplored momentum fractions x1,2 → 1, some differences are noticeable. At\nJ-PARC, expectations for ALL depend much more on the\nchoice of spin-dependent parton densities, in line with the\nobservations already made in the lower panel of Fig. 10.\nFinally, in Fig. 13 we present the spin asymmetry as\na function of the c.m.s. rapidity y and integrated over\ntransverse momentum. The behavior of ALL for GSI-FAIR\nin the upper panel for positive y is driven by the cut on\nthe charm momentum plab > 1 GeV. Both mass and scale\nuncertainties do not cancel and remain significant.\n\n\fJ. Riedl, A. Schäfer, M. Stratmann: Prospects of Open Charm Production at GSI-FAIR and J-PARC\n\n4 Conclusions\nWe have performed a detailed study of the physics opportunities with open charm production at low c.m.s. energy p̄p and pp collisions at GSI-FAIR and J-PARC, respectively, including unpolarized and polarized cross sections and charge and spin asymmetries. All calculations\nare done at O(α3s ) accuracy, and theoretical uncertainties\ndue to the choice of scales μf,r and the charm mass mc\nare discussed in detail. In general, they turn out to be significant with the exception of the mass dependence of the\ncharge asymmetries AC and ∆AC .\nMeasurements of all these quantities would further our\nunderstanding of the perturbative QCD framework and\nthe nucleon structure expressed in terms of unpolarized\nand polarized parton densities. The latter are probed at\nlarge momentum fractions x1,2 , which are difficult to access at high-energy colliders. The charge asymmetry vanishes at O(α2s ) and hence is a clear probe of non-trivial\nQCD dynamics beyond the LO. Detailed comparisons between our theoretical expectations for unpolarized charm\nyields and future data will reveal to what extent perturbative\n√ methods are applicable in hadron-hadron collisions at\nS ≈ 10 ÷ 15 GeV and will open up a window to perturbative resummations and/or the transition into the nonperturbative regime so far only little explored.\n\nAcknowledgements\nWe are grateful to Marco Contalbrigo providing information about the GSI-FAIR PAX project. J.R. was supported by a grant of the \"Cusanuswerk\", Bonn, Germany.\nThis work was supported in part by the BMBF, Germany.\n\nReferences\n1. For a recent review, see, e.g., J. Baines et al., Heavy Quark\n- Summary Report for the HERA-LHC Workshop Proceedings, hep-ph/0601164, and references therein.\n2. See, e.g., M. Cacciari, in proceedings of the 7th DESY\nWorkshop on Elementary Particle Theory: Loops and Legs\nin Quantum Field Theory, Zinnowitz, Germany, 2004,\nNucl. Phys. B Proc. Suppl. 135 (2004) 61 and references\ntherein.\n3. See, e.g., A.D. Frawley et al., Heavy Flavor Working Group Report of RHIC II Science Workshop,\nhttp://www.bnl.gov/physics/rhicIIscience, and references therein.\n4. M. Cacciari, P. Nason, and R. Vogt, Phys. Rev. Lett. 95\n(2005) 122001.\n5. See, e.g., C. Aidala et al., Research Plan for Spin Physics\nat RHIC, 2005, BNL report BNL-73798-2005.\n6. W. Beenakker, H. Kuijf, W.L. van Neerven, and J. Smith,\nPhys. Rev. D40 (1989) 54; P. Nason, S. Dawson, and R.K.\nEllis, Nucl. Phys. B303 (1988) 607; Nucl. Phys. B327\n(1989) 49; ibid. B335 (1989) 260; W. Beenakker, W.L.\nvan Neerven, R. Meng, G.A. Schuler, and J. Smith, Nucl.\nPhys. B351 (1991) 507; M.L. Mangano, P. Nason, and G.\nRidolfi, Nucl. Phys. B373 (1992) 295.\n\n11\n\n7. R.K. Ellis and P. Nason, Nucl. Phys. B312 (1989) 551; J.\nSmith and W.L. van Neerven, Nucl. Phys. B374 (1992)\n36; S. Frixione, M.L. Mangano, P. Nason, and G. Ridolfi,\nNucl. Phys. B412 (1994) 225.\n8. E. Laenen, S. Riemersma, J. Smith, and W.L. van Neerven,\nNucl. Phys. B392 (1993) 162; ibid. B392 (1993) 229; S.\nRiemersma, J. Smith, and W.L. van Neerven, Phys. Lett.\nB347 (1995) 143; B.W. Harris and J. Smith, Nucl. Phys.\nB452 (1995) 109.\n9. I. Bojak and M. Stratmann, Phys. Rev. D67, 034010\n(2003).\n10. I. Bojak and M. Stratmann, Phys. Lett. B433 (1998) 411;\nNucl. Phys. B540 (1999) 345; ibid. B569 (2000) 694(E);\nA.P. Contogouris, G. Grispos, Z. Merebashvili, Phys. Rev.\nD62 (2000) 114509; ibid. D69 (2004) 019901(E).\n11. M. Cacciari and M. Greco, Nucl. Phys. B421 (1994) 530;\nM. Cacciari, M. Greco, and P. Nason, JHEP 9805 (1998)\n007; M. Cacciari, S. Frixione, and P. Nason, JHEP 0103\n(2001) 006.\n12. For information on the planned GSI-FAIR facility, see:\nhttp://www.gsi.de/fair.\n13. For information on the J-PARC facility, see:\nhttp://j-parc.jp/index-e.html.\n14. GSI-PAX Collaboration, P. Lenisa and F. Rathmann (spokespersons), Technical Proposal, 2005,\nhep-ex/0505054; update of the Technical Proposal,\n2006, http://www.fz-juelich.de/ikp/pax.\n15. D. de Florian and W. Vogelsang, Phys. Rev. D71 (2005)\n114004; ibid. D72 (2005) 014014.\n16. F.A. Berends et al., Nucl. Phys. B63 (1973) 381; ibid.\nB68 (1974) 541; Acta Phys. Polon. B14 (1983) 413; R.W.\nBrown et al., Phys. Lett. B43 (1973) 403; S.J. Brodsky,\nC.E. Carlson, and R. Suaya, Phys. Rev. D14 (1976) 2264.\n17. R.W. Brown, D. Sahdev, and K.O. Mikaelian, Phys. Rev.\nLett. 43 (1979) 1069; F. Halzen, P. Hoyer, and C.S. Kim,\nPhys. Lett. B195 (1987) 74.\n18. J.H. Kühn and G. Rodrigo, Phys. Rev. Lett. 81 (1998) 49;\nPhys. Rev. D59 (1999) 054017.\n19. M.T. Bowen, S.D. Ellis, and D. Rainwater, Phys. Rev. D73\n(2006) 014008; S. Dittmaier, P. Uwer, and S. Weinzierl,\nPhys. Rev. Lett. 98 (2007) 262002.\n20. J. Weinelt, Masters Thesis, FERMILAB-MASTERS-200605, 2006.\n21. S. Catani et al., Phys. Rev. Lett. 93 (2004) 152003.\n22. C. Lourenco and H.K. Wöhri, Phys. Rept. 433 (2006) 127.\n23. Marco Contalbrigo, private communication.\n24. J. Pumplin et al., CTEQ Collaboration, JHEP 07 (2002)\n012\n25. M. Glück, E. Reya, M. Stratmann, and W. Vogelsang,\nPhys. Rev. D63, 094005 (2001).\n26. B. Jäger, M. Stratmann, and W. Vogelsang, Eur. Phys. J.\nC44 (2005) 533.\n27. M. Hirai et al., Asymmetry Analysis Collaboration, Phys.\nRev. D69 (2004) 054021.\n28. D. de Florian, G.A. Navarro, and R. Sassot, Phys. Rev.\nD71 (2005) 094018.\n\n\f"}