{"id": "http://arxiv.org/abs/0903.2143v1", "guidislink": true, "updated": "2009-03-12T10:47:28Z", "updated_parsed": [2009, 3, 12, 10, 47, 28, 3, 71, 0], "published": "2009-03-12T10:47:28Z", "published_parsed": [2009, 3, 12, 10, 47, 28, 3, 71, 0], "title": "Superconductivity at 36 K in beta-Fe1.01Se with the compression of the\n  interlayer separation under pressure", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0903.0984%2C0903.5002%2C0903.1363%2C0903.1069%2C0903.0943%2C0903.3641%2C0903.1925%2C0903.3782%2C0903.4799%2C0903.2059%2C0903.3524%2C0903.5319%2C0903.2722%2C0903.1409%2C0903.2584%2C0903.1484%2C0903.3787%2C0903.4807%2C0903.1968%2C0903.5224%2C0903.1271%2C0903.4479%2C0903.0058%2C0903.3446%2C0903.4152%2C0903.0556%2C0903.1820%2C0903.4642%2C0903.3701%2C0903.2192%2C0903.3192%2C0903.5491%2C0903.3526%2C0903.2143%2C0903.0242%2C0903.2161%2C0903.4264%2C0903.1018%2C0903.0724%2C0903.5485%2C0903.4827%2C0903.4490%2C0903.0902%2C0903.2783%2C0903.4486%2C0903.2917%2C0903.1457%2C0903.1973%2C0903.4437%2C0903.3691%2C0903.2302%2C0903.3681%2C0903.0831%2C0903.1662%2C0903.0031%2C0903.3751%2C0903.0587%2C0903.3255%2C0903.0275%2C0903.5379%2C0903.0867%2C0903.3203%2C0903.3842%2C0903.1473%2C0903.2582%2C0903.3306%2C0903.0464%2C0903.2807%2C0903.1208%2C0903.0977%2C0903.1970%2C0903.4530%2C0903.1338%2C0903.2460%2C0903.4706%2C0903.4788%2C0903.3185%2C0903.2894%2C0903.1665%2C0903.1533%2C0903.0149%2C0903.2199%2C0903.0538%2C0903.3403%2C0903.2432%2C0903.2079%2C0903.4518%2C0903.5404%2C0903.0518%2C0903.5037%2C0903.1751%2C0903.2155%2C0903.1835%2C0903.5121%2C0903.0443%2C0903.4742%2C0903.3536%2C0903.2215%2C0903.3394%2C0903.2900%2C0903.5367&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Superconductivity at 36 K in beta-Fe1.01Se with the compression of the\n  interlayer separation under pressure"}, "summary": "In this letter, we report that the superconductivity transition temperature\nin beta-Fe1.01Se increases from 8.5 to 36.7 K under applied pressure of 8.9\nGPa. It then decreases at higher pressure. A dramatic change in volume is\nobserved at the same time Tc rises, due to a collapse of the separation between\nthe Fe2Se2 layers. A clear transition to a linear resistivity normal state is\nseen on cooling at all pressures. No static magnetic ordering is observed for\nthe whole p-T phase diagram. We also report that at higher pressure (starting\naround 7 GPa and completed at 38 GPa), Fe1.01Se transforms to a hexagonal\nNiAs-type structure and displays non-magnetic, insulating behavior. The\ninclusion of electron correlation in band structure caculations is necessary to\ndescribe this behavior, signifying that such correlations are important in this\nchemical system. Our results strongly support unconventional superconductivity\nin beta-Fe1.01Se.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0903.0984%2C0903.5002%2C0903.1363%2C0903.1069%2C0903.0943%2C0903.3641%2C0903.1925%2C0903.3782%2C0903.4799%2C0903.2059%2C0903.3524%2C0903.5319%2C0903.2722%2C0903.1409%2C0903.2584%2C0903.1484%2C0903.3787%2C0903.4807%2C0903.1968%2C0903.5224%2C0903.1271%2C0903.4479%2C0903.0058%2C0903.3446%2C0903.4152%2C0903.0556%2C0903.1820%2C0903.4642%2C0903.3701%2C0903.2192%2C0903.3192%2C0903.5491%2C0903.3526%2C0903.2143%2C0903.0242%2C0903.2161%2C0903.4264%2C0903.1018%2C0903.0724%2C0903.5485%2C0903.4827%2C0903.4490%2C0903.0902%2C0903.2783%2C0903.4486%2C0903.2917%2C0903.1457%2C0903.1973%2C0903.4437%2C0903.3691%2C0903.2302%2C0903.3681%2C0903.0831%2C0903.1662%2C0903.0031%2C0903.3751%2C0903.0587%2C0903.3255%2C0903.0275%2C0903.5379%2C0903.0867%2C0903.3203%2C0903.3842%2C0903.1473%2C0903.2582%2C0903.3306%2C0903.0464%2C0903.2807%2C0903.1208%2C0903.0977%2C0903.1970%2C0903.4530%2C0903.1338%2C0903.2460%2C0903.4706%2C0903.4788%2C0903.3185%2C0903.2894%2C0903.1665%2C0903.1533%2C0903.0149%2C0903.2199%2C0903.0538%2C0903.3403%2C0903.2432%2C0903.2079%2C0903.4518%2C0903.5404%2C0903.0518%2C0903.5037%2C0903.1751%2C0903.2155%2C0903.1835%2C0903.5121%2C0903.0443%2C0903.4742%2C0903.3536%2C0903.2215%2C0903.3394%2C0903.2900%2C0903.5367&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this letter, we report that the superconductivity transition temperature\nin beta-Fe1.01Se increases from 8.5 to 36.7 K under applied pressure of 8.9\nGPa. It then decreases at higher pressure. A dramatic change in volume is\nobserved at the same time Tc rises, due to a collapse of the separation between\nthe Fe2Se2 layers. A clear transition to a linear resistivity normal state is\nseen on cooling at all pressures. No static magnetic ordering is observed for\nthe whole p-T phase diagram. We also report that at higher pressure (starting\naround 7 GPa and completed at 38 GPa), Fe1.01Se transforms to a hexagonal\nNiAs-type structure and displays non-magnetic, insulating behavior. The\ninclusion of electron correlation in band structure caculations is necessary to\ndescribe this behavior, signifying that such correlations are important in this\nchemical system. Our results strongly support unconventional superconductivity\nin beta-Fe1.01Se."}, "authors": ["S. Medvedev", "T. M. McQueen", "I. Trojan", "T. Palasyuk", "M. I. Eremets", "R. J. Cava", "S. Naghavi", "F. Casper", "V. Ksenofontov", "G. Wortmann", "C. Felser"], "author_detail": {"name": "C. Felser"}, "author": "C. Felser", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1038/nmat2491", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0903.2143v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0903.2143v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "17 pages, 4 figures", "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0903.2143v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0903.2143v1", "journal_reference": "Nature Materials 8, 630 - 633 (2009)", "doi": "10.1038/nmat2491", "fulltext": "Superconductivity at 36 K in β-Fe1.01Se with the Compression of the\nInterlayer Separation Under Pressure\nS. Medvedev1,2, T. M. McQueen3, I. Trojan2,4, T. Palasyuk2,5, M. I. Eremets2, R. J. Cava3, S.\nNaghavi1, F. Casper1, V. Ksenofontov1, G. Wortmann6 and C. Felser1\n1\n\nInstitut für Anorganische und Analytische Chemie, 55099 Mainz, Germany\n2\nMax-Planck-Institute for Chemistry, 55128 Mainz, Germany, Germany\n3\nDepartment of Chemistry, Princeton University, Princeton NJ 08544, USA\n4\nI A.V. Shubnikov Institute of Crystallography, 119333 Moscow, Russia\n5\nInstitute of Physical Chemistry PAS, Warsaw 01-224, Poland\n6\nDepartment Physik, Universität Paderborn, 33095 Paderborn, Germany\n\nIn this letter, we report that the superconducting transition temperature in β-Fe1.01Se\nincreases from 8.5 to 36.7 K under an applied pressure of 8.9 GPa. It then decreases at\nhigher pressures. A dramatic change in volume is observed at the same time Tc rises, due to\na collapse of the separation between the Fe2Se2 layers. A clear transition to a linear\nresistivity normal state is seen on cooling at all pressures. No static magnetic ordering is\nobserved for the whole p-T phase diagram. We also report that at higher pressures\n(starting around 7 GPa and completed at 38 GPa), Fe1.01Se transforms to a hexagonal\nNiAs-type structure and displays non-magnetic, insulating behavior. The inclusion of\nelectron correlations in band structure calculations is necessary to describe this behavior,\nsignifying that such correlations are important in this chemical system. Our results\nstrongly support unconventional superconductivity in β-Fe1.01Se.\n\n\fIntroduction\nSuperconductivity has recently been discovered in iron arsenides [1-6], with\nsuperconducting transition temperatures (Tc's) as high as 55 K [6]. The superconductivity in this\nclass of materials is unexpected because most Fe-based compounds display strong magnetic\nbehavior. The iron arsenides share a number of general features with the high-temperature\nsuperconducting cuprates, including high Tc's, proximity to a magnetically ordered state, and a\nlinear temperature dependence of the resistivity [7,8]. These properties suggest that the\nsuperconductivity in the iron arsenides is unconventional, with electron pairing possibly\nmediated by magnetic interactions. More recently, superconductivity has been reported at 8.5 K\n[9], increasing up to 27 K under pressure [10], in the structurally related material iron selenide\n[11,12]. Iron selenide and the iron arsenides share a common structural motif, containing Fe2X2\n(X=As, Se) layers of edge-shared FeX4 tetrahedra, suggesting that the mechanism of\nsuperconductivity may be the same in both families in spite of the low Tc for the selenide.\nHere we show that superconducting β-Fe1.01Se [11] exhibits a transition to an anomalous\nlinear temperature dependence of the resistivity in the normal state at temperatures above Tc,\nstable over a wide range of applied pressures. This linear dependence in the resistivity in βFe1.01Se is preserved as the superconducting temperature rises to 36 K at 8.9 GPa. Taken in the\ncontext of recent pressure dependent NMR measurements [13], this suggests that the anomalous\nnormal state resistivity is related to both the spin fluctuations and superconductivity in βFe1.01Se. We also show that unlike the iron arsenides, no static magnetic ordering is observed in\nβ-Fe1.01Se at pressures up to 31 GPa. This observation is consistent with the electronic structure\ncalculations of Lee et al., which conclude that a non magnetic ground state is most stable for iron\nselenide [14]. This suggests that if there is a magnetically ordered state to be found for this\n\n\fmaterial, making it strictly analogous to the iron arsenide superconductors, such an ordered state\nis far away in temperature, pressure, and composition from what is presently known. At the\nhighest pressures studied, Fe1.01Se transforms to a hexagonal close packed NiAs-type structure\nthat exhibits semiconducting behavior when local density approximation band structure\ncalculations indicate that metallic behavior should be observed. These results suggest that strong\nelectron correlations (such as the short-lived spin correlations recently observed in β-Fe1.01Se\n[13]) are necessary for the observation of high transition temperatures in iron-based\nsuperconductors.\nResults\nIn Fig. 1 (a), the room temperature X-ray diffraction patterns are shown for β-Fe1.01Se for various\npressures. The corresponding structures are displayed in Fig 1 (b,c). At low pressures, the room\ntemperature structure of β-Fe1.01Se is tetragonal (Fig. 1 (c)). At 1.5 GPa there is a ~10%\nreduction in the unit cell volume and a drop in the c/a ratio of the tetragonal cell parameters from\n1.464 to 1.414 (3.4%) (see data points in Fig. 1 (d)). This correlates with a strong increase in Tc\n(more than 10 K at 0.8 GPa). These two structural effects result from a collapse of the van-derWaals-bonded region that separates the Fe2Se2 planes under pressure (blue arrows, Fig. 1(c)),\nand implies, in conjunction with the Mössbauer measurements (see below), a dramatically\nreduced interlayer separation as Tc rises. By 12 GPa a part of the sample has transformed into the\nhexagonal NiAs-type structure (Fig. 1 (b)). This is expected as the volume of the hexagonal\nphase is smaller than the volume of the tetragonal phase. The very wide two-phase hexagonal +\ntetragonal phase region, which extends from pressures of about 7 GPa (see below) to 35 GPa on\nincreasing pressure, is characteristic of a first order transition. By 38 GPa, only the hexagonal\nphase is present. Releasing the pressure back to ambient results in the full recovery of the\n\n\fsuperconducting β-Fe1.01Se tetragonal phase, indicating, given the extreme sensitivity of the\nsuperconductivity of β-Fe1.01Se to stoichiometry [11], that the hexagonal high pressure phase is\nalso very close to stoichiometric. An analogous reversible transition from the tetragonal phase\ninto the hexagonal phase was observed in thin FeSe-films [15].\nThe transport and magnetic properties of FeSe are very sensitive to applied pressure. To\nillustrate this, representative temperature-dependent resistivity curves and the Mössbauer spectra\nobtained at different pressures are shown in Figs. 2 (a) and (b).\n\nThe transition into the\n\nsuperconducting state is observed to increase from 8 K to 36.7 K on applied pressure, before\ndecreasing again (see Fig. 2 (c)). At 0.8 GPa, the onset of the superconducting transition Tc is\n18.6 K, with a sharp drop to zero resistance. With increasing pressure the superconducting\ntransition becomes broader, which is also found for the superconducting transition of the iron\narsenides under pressure [16]. The initial pressure coefficient of Tc between ambient pressure\nand 0.8 GPa is around 12.6(2) K/GPa and decreases for increasing pressures (between ambient\npressure and 8.9 GPa, the pressure coefficient is 3.2(1) K/GPa). Passing the superconducting\ndome at pressures higher than 8.9 GPa (see Fig. 2 (c)) the resistivity curves become more\ncomplicated. The decrease of the superconducting Tc once past the maximum is more moderate,\napproximately -1.7(2) K/GPa. At 15 GPa (Fig. 2 (c)) the superconducting transition temperature\nhas decreased to 25 K, but the resistance does not drop to zero below the superconducting\ntransition temperature. The residual resistance below Tc is due to the occurrence of larger\namounts of the semiconducting hexagonal phase at this pressure.\nA change in the slope in the temperature dependence of the resistivity is observed at all\npressures in the stability region of the superconducting phase. This transition occurs at\ntemperatures between ~90 K and 60 K, depending on the pressure, and decreases in temperature\n\n\fwith increasing pressure (Fig. 2 (c)). The transition to linear resistivity is very sharp in much of\nthe pressure range, but undergoes a change in concavity making precise assignment of the\ntransition temperature at 0.8 GPa difficult. At ambient pressure this change in the resistance,\nfrom linear behavior below to normal conductivity above the transition, is accompanied by the\nchange of the structure from tetragonal to orthorhombic symmetry [11,12,17]. Although this may\nbe the case under pressure as well, we currently have no information on this aspect of the\npressure dependent behavior of this system. The resistance shows T-linear behavior R =\nA + BTn, with n = 1.0 ± 0.03 in this temperature regime between the onset of this phase and the\nsuperconducting transition temperature, e.g. 90 K at atmospheric pressure. The change in the\nslope of the temperature dependent resistivity is largest and sharpest at intermediate pressures\n(e.g. near 5.1 GPa, Fig 2(c)). A T-linear resistivity is frequently taken as a fingerprint of a \"noncanonical Fermi liquid system\", as known for high Tc cuprates [18] or in heavy Fermion metals\n[19,20]. This unusual linear temperature dependency of ρ(T) was also recently observed in the\niron arsenides [21]. The temperature regime where we observe the linear resistivity is correlated\nto the region where NMR has detected the presence of increasing spin fluctuations in β-Fe1.01Se\n[13]. In contrast to our findings for β-Fe1.01Se, for LaO1-xFxFeAs and Ba1-xKxFe2As2 the linear\nresistivity behavior and the orthorhombic structural distortion are intimately correlated to the\npresence of a long range ordered spin density wave which sets in at or slightly below the\ntemperature of the structural phase transition [3,22,23].\nTo characterize the magnetic properties of the different phases of FeSe appearing in the\npressure experiments,\n\n57\n\nFe-Mössbauer spectroscopy was applied as a sensitive local probe.\n\nRepresentative 57Fe-spectra are shown in Fig. 2 (b). For the pressures up to 5.8 GPa, the spectra\nare well described by a single quadrupole doublet with hyperfine parameters similar to those\n\n\ffound for the same sample at ambient pressure [11]. The quadrupole splitting, ΔEQ = 0.28(2)\nmms-1, and isomer shift, δ = 0.44(1) mms-1 at 0.2 GPa can be attributed to formally divalent Fe\nions in a distorted tetrahedral surrounding of Se neighbors with strong covalency in the Fe-Se\nbonds. At 7.2 GPa a new phase appears in the spectrum with a relative intensity of ca. 20%, a\ndistinct different isomer shift, δ = 0.84 mms-1, and a quadrupole splitting of ΔEQ = 0.21(2)\nmms-1. These values of hyperfine parameters are characteristic of formally divalent Fe in more\nsymmetric surrounding with less covalency and can be unambiguously attributed to the\nhexagonal phase of FeSe [24], present in the XRD pattern (Fig. 1). The relatively small variation\nthe Mössbauer parameter with pressure indicates only a modest variation of the local\nsurroundings of the Fe ions especially in the tetragonal phase, reflected in the almost constant\nvalues of the quadrupole splittings in the whole pressure range. The local volume around the Fe\nions in both the tetragonal and hexagonal phases, as defined by the Fe-Se and Fe-Fe distances, is\nchanged much less under pressure than the molar volumes, especially at pressures up to 12 GPa.\n(see Fig. 1(c,d) and ref. 12). This supports the conclusion that the strong drop in volume and c/a\nratio with pressure in the tetragonal phase is due to the collapse of the Se-Se van-der-Waals layer\nbetween the Fe2Se2 planes. A detailed report on the Mössbauer characterization of these phases,\nincluding an anomalous decrease of the Mössbauer-Lamb factor (i.e. the Debye-Waller factor) at\npressures up to 7.2 GPa, will be presented in a forthcoming publication [25]. The spectra taken at\n4.2 K at all pressures provide important information about the presence or absence of static\nmagnetic ordering in these phases. Inspection of the inset in Fig. 2 (b) at 14.4 GPa indicates no\nmagnetic hyperfine splitting in either subspectrum. This proves that the ground states in both the\ntetragonal and hexagonal phases of FeSe are nonmagnetic.\n\n\fAt pressures higher than 29 GPa, the bulk FeSe sample is semiconducting (Fig. 3(a)),\nindicating that hexagonal FeSe is non-metallic. Mössbauer spectra measured at 19.7 GPa (the\nsample contains 40% hexagonal phase), show that this form is also non-magnetic (Fig. 3(b)). The\nanomalous resistivity behavior vanishes with the transformation of the sample into the hexagonal\nphase, and our measurements indicate that this phase is not superconducting down to 0.6 K. To\nbetter understand the semiconducting, nonmagnetic character of the hexagonal phase, we have\nalso performed electronic structure calculations. The hexagonal phase adopts the NiAs structure,\nand a full geometry optimization was performed for the calculations. The calculations, based\nonly on DFT (density functional theory) within the LSDA (local spin density approximation),\nlead to the prediction of a metallic ground state (Fig. 3 (c) upper panel), which our observations\nshow is incorrect. The hexagonal phase with the NiAs-structure type becomes semiconducting in\nthe calculations only by the inclusion of correlations, using either Coulomb correlations via the\ninclusion of an on-site repulsion, U ~ 4 eV (Fig. 3(c), middle panel), or an exact exchange\nformalism via a hybrid functional (Fig. 3(c), lower panel). The experimentally observed\nnonmagnetic semiconducting character for high pressure hexagonal FeSe is therefore seen to be\nonly consistent with an electronic system that displays substantial electronic correlations. For the\ntetragonal phase, our electronic structure calculations based on DFT using the LSDA are in\nagreement with the results of other groups [14], and inclusion of a hybrid functional does not\nchange the calculated electronic structure of the metallic phase significantly. However,\nDFT+LSDA correctly reproduces the gross behavioral features of many metallic systems, even\nthose in which electron correlations are important, such as the cuprates [26, 27]. Thus the fact\nthat the inclusion of correlations is necessary to describe the hexagonal phase indirectly suggests\n\n\fthat correlations play a role in tetragonal iron selenide. This is consistent with recent NMR\nresults, which show the presence of short-lived spin correlations in tetragonal FeSe [13].\nConclusion\nThe electronic pressure-temperature (p-T) phase diagram for FeSe is shown in Fig. 4. At\na first view the p-T phase diagram looks very similar to that of the iron arsenides. The high\ntemperature superconductivity in β-Fe1.01Se is intimately correlated with the observation of\nanomalous transport properties in the normal state, which we tentatively attribute to the presence\nof the spin fluctuations seen in NMR experiments [13]. High temperature superconductivity is\nfound only in the region of the phase diagram where the resistivity shows the pronounced\nanomalous resistivity above Tc. Unlike the case of the arsenides however [3,22,23,28,29], the\nphase diagram does not have any region where a spin density wave or static magnetism is\nobserved, and the increasing Tc under pressure cannot in any way be attributed to the concurrent\nsuppression of a magnetically ordered phase. The increase in Tc, is, however, associated with a\ndramatic decrease in volume due to the collapse of the space between the Fe2Se2 planes.\nFollowing the collapse of the interlayer spacing in the tetragonal β-FeSe phase, a first order\ntransition into close-packed, semiconducting non-magnetic hexagonal phase is observed. This\nsemiconducting phase cannot be described within the LSDA; correlations have to be taken into\naccount. Whether these correlations are present in the electronically more complex tetragonal βFeSe phase remains to be determined, but the data presented here strongly suggest that the\nsuperconductivity in tetragonal iron selenide is unconventional.\n\n\fAcknowledgements\nThe work at Mainz was funded by the DFG in the Collaborative Research Center\nCondensed Matter Systems with Variable Many-Body Interactions (TRR 49). The work at\nPrinceton was supported primarily by the U.S. Department of Energy, Division of Basic Energy\nSciences, Grant No. DE-FG02-98ER45706. T.M.M. gratefully acknowledges support of the\nNational Science Foundation Graduate Research Foundation program. I.T. was partly supported\nby the Russian Research Foundation under the grant No. 08-02-00897a and by the Presidium of\nRAS under the grant No.27-4.1.10. We are grateful to V. Prakapenka for X-ray diffraction\nmeasurements at GeoSoilEnviroCARS (sector 13, APS) at Argonne National Laboratory.\n\n\fReferences:\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n\n12\n13\n14\n15\n16\n17\n18\n19\n\nKamihara, Y. J., Watanabe, T., Hirano, M. & Hosono, H. Iron-based layered\nsuperconductor La[O1-xFx]FeAs with TC = 26 K. J. Am. Chem. Soc. 130, 3296-3297\n(2008).\nChen, X. H., et al. Superconductivity at 43 K in SmFeAsO1-xFx. Nature 453, 761-762\n(2008).\nZhao J. et al. Structural and magnetic phase diagram of CeFeAsO1- xFx and its relation to\nhigh-temperature superconductivity. Nature Materials 7, 953 - 959 (2008).\nRotter, M., Tegel, M. & Johrendt, D. Superconductivity at 38 K in the iron arsenide Ba1xKxFe2As2. Phys. Rev. Lett. 101, 107006 (2008).\nPitcher M. J., Parker D. R., Adamson P., Herkelrath S. J. C., Boothroyd A. T., Ibberson\nR. M., Brunellid M. and Clarke S. J., Structure and superconductivity of LiFeAs, Chem.\nCommun., 5918-5920 (2008).\nRen, Z. A. et al. Superconductivity at 55 K in iron-based F-doped layered quaternary\ncompound Sm[O1-xFx]FeAs. Chin. Phys. Lett. 25, 2215-2216 (2008).\nH. Takagi et al., Systematic evolution of temperature-dependent resistivity in\nLa2-xSrxCuO4. Phys. Rev. Lett. 69, 2975 (1992).\nAndo Y. et al., Electronic Phase Diagram of High-Tc Cuprate Superconductors from a\nMapping of the In-Plane Resistivity Curvature. Phys. Rev. Lett. 93, 267001 (2004).\nHsu F. C., et al., Superconductivity in the PbO-type Structure alpha-FeSe. Proceedings of\nthe National Academy of Sciences 105, 14262 (2008).\nMizuguchi Y., Tomioka F., Tsuda S., Yamaguchi T. and Takano Y., Superconductivity at\n27 K in tetragonal FeSe under high pressure. Appl. Phys. Lett. 93, 152505 (2008).\nMcQueen T. M., Huang Q., Ksenofontov V., Felser C., Xu Q., Zandbergen H., Hor Y. S.,\nAllred J., Williams A. J., Qu D., Checkelsky J., Ong N. P. and Cava R. J., Extreme\nSensitivity of Superconductivity to Stoichiometry in FeSe (Fe1+δSe), Phys. Rev. B 79,\n014522 (2009).\nMillican J. N., Phelan D., Thomas E. L., Leao J. B. and Carpenter E., Pressure-Induced\nEffects on the Structure of the FeSe Superconductor, arXiv:0902.0971 (unpublished)\nImai T., Ahilan K., Ning F. L., McQueen T. M., and Cava R. J., Why Does Undoped\nFeSe Become A High Tc Superconductor Under Pressure? arXiv:0902.3832\n(unpublished)\nLee K.-W., Pardo V. and Pickett W. E., Magnetism Driven by Anion Vacancies in\nSuperconducting αFeSe1-x Phys. Rev. B 78, 174502 (2008).\nSrivastava M. M. and Srivastava O. N., Studies of structural transformations and\nelectrical behaviour of FeSe films, Thin Solid Films 29, 275 (1975).\nTakahashi, H. et al. Superconductivity at 43 K in an iron-based layered compound LaO1xFxFeAs. Nature 453, 376-378 (2008).\nMcQueen T. M., Williams A. J., Klimczuk T., Casper F., Ksenofontov V., Felser C., P.\nStephens W., and Cava R. J.. Unpublished.\nOrenstein J. and Millis A. J., Advances in the physics of high-temperature\nsuperconductivity, Science 288, 468 (2000).\nGegenwart P., Si Q., and Steglich F., Quantum criticality in heavy-fermion metals, Nat.\nPhys. 4, 186 (2008).\n\n\f20 Mathur N.D., Grosche F. M., Julian S. R., Walker I. R., Freye D. M., Haselwimmer R. K.\nW. & Lonzarich G. G., Magnetically mediated superconductivity in heavy fermion\ncompounds Nature 394, 39-43 (1998).\n21 Hess C., et al., The intrinsic electronic phase diagram of iron-pnictide superconductors.\narXiv:0811.1601 (unpublished)\n22 Luetkens H. et al., The electronic phase diagram of the LaO1-xFxFeAs superconductor.\nNature Materials published online 2009 DOI: 10.1038/NMAT2396\n23 Cruz C., et al., Magnetic order close to superconductivity in the iron-based layered LaO1xFxFeAs systems. Nature 453, 899-902 (2008)\n24 Reddy K. V. and Chetty S. C., Phys. Stat. Solidi (a) 32 (1975) 585.\n25 Ksenofontov V., McQueen T. M., Medvedev S., Trojan I., Palasyuk T., Eremets M.,\nCava R. J., Felser C. and Wortmann G.. Unpublished.\n26 Czyzyk M. T., Sawatzky G.A., Local-density functional and on-site correlations: The\nelectronic structure of La2CuO4 and LaCuO3, Phys. Rev. B 49, 14211 (1994)\n27 Gyorffy B. L., Szotek Z., Temmerman W. M., Andersen O. K., and Jepsen O.,\nQuasiparticle spectra of high-temperature superconductors, Phys. Rev. B 58, 1025\n(1998).\n28 Drew A.J. et al. Coexistence of static magnetism and superconductivity in SmFeAsO1xFx as revealed by muon spin rotation. Nature Materials (2009) online\nDOI:10.1038/NMAT2397.\n29 Lynn J. W. and Dai P., Neutron Studies of the Iron-based Family of High TC Magnetic\nSuperconductors, arXiv:0902.0091 (unpublished).\n30 Eremets, M. I., V. V. Struzhkin, et al., Superconductivity in boron, Science 293 272-274\n(2001).\n31 Blaha P., Schwarz K., Madsen G. K. H., Kvasnicka D., and Luitz J., WIEN2K,\n(Karlheinz Schwarz, Technische Universität Wien, Wien Austria, 2001).\n32 Dovesi R. et al., CRYSTAL 2006 User's Manual (University of Torino, Torino, 2006).\n\n\fMethods\nHigh quality samples of a single phase were formed from a composition close to Fe1.01Se.\nDetails of the sample preparation were published elsewhere [11]. The samples were\ncharacterized by laboratory XRD [11]; no impurity phases were detected in all samples\ninvestigated here. To study the phase diagram, external pressure as a well defined tuning\nparameter was applied up to 40 GPa. The unique combination of different methods enabled us to\ninvestigate the structure by XRD, the electronic properties by resistivity measurements [30] and\nthe magnetic properties by Mössbauer spectroscopy under pressure for the same well defined\nsample between room temperature and 4.2 K.\n57\n\nFe Mössbauer spectra were recorded using a constant-acceleration spectrometer, a\n\nhelium bath cryostat and a 57Co(Rh) Mössbauer point source with an active spot diameter of 0.5\nmm. Powder FeSe samples enriched with 57Fe (20%) were measured in a diamond-anvil pressure\ncell (DAC) with silicon oil as the pressure transmitting medium, enabling quasihydrostatic\npressure measurements up to 40 GPa in the temperature range 4.2-300 K. Isomer shift values are\nquoted relative to α-Fe at 293 K.\nA diamond anvil cell (DAC) was used for electrical resistance measurements under high\npressures up to 29 GPa. We used a cBN/epoxy mixture for insulating gaskets and platinum foil\nfor electrical leadsi. The diameter of flat working surface of diamond anvil was 0.5 mm and the\ndiameter of the hole in the gasket was 0.07 mm. The hole was filled with powder sample. We\nmeasured resistance with DC current source in van der Pauw geometry of electrodes. Pressure\nwas measured at low and room temperatures by the Ruby scale from a small chips scattered\nacross the sampleii. The pressure distribution was ≤0.05 GPa across the sample. Temperature was\n\n\fmeasured with a calibrated Si-diode attached to the DAC with accuracy within 0.1 K. The\ndiffraction patterns were accumulated with a fast MAR345 image plate detector with acquisition\ntimes between 0.5 and 15 min (typically 2-5 min). Electronic structure calculations were\nperformed using the Wien2k code [31]; on basis of the density functional theory (DFT) and the\nlocal spin density approximation (LSDA) plus the multiorbital mean-field Hubbard model\n(LSDA + U, U > 2.5 eV) and the quantum chemical CRYSTAL code the exact exchange Becke\nthree parameter Lee-Yang-Parr (B3LYP) hybrid functional [32]. For all phases a geometry\noptimization was performed and the phase stabilities were determined]. For all phases a\ngeometry optimization was performed and the phase stabilities were determined. The LSDA + U\napproach allows the most important on-site correlations. To account for on-site correlation, the\nLDA + U method with U from 1 to 10 eV was used in the self-interaction correction scheme with\nJ = 0. The number of k points were 12 * 12 *12, and the muffin tin radii were chosen for Fe =\n2.5 Å and for Se = 2.24 Å. The structural data of the hexagonal phase are a = 3.66 Å c = 5.565 Å.\n\n\fFig. 1. (a) X-ray diffraction patterns of Fe1.01Se at various pressures. At 1.5 GPa, only the\ntetragonal form is present [shown in panel (c)]. At 12 GPa, the sample contains a mixture of\ntetragonal and hexagonal [NiAs-type, shown in panel (b)] forms. By 38 GPa the sample is solely\nhexagonal. The tick marks below the patterns show the calculated reflection positions for\ntetragonal (black), and hexagonal (red) phases. Reflections denoted with asterisks on the 1.5 GPa\npattern originate from the Re-gasket. (d) Tetragonal Fe1.01Se undergoes a nearly 20% volume\nreduction under pressure, accompanied by a large decrease in the c/a ratio (inset), indicative of a\ncollapse of the van-der-Waals-bonded interlayer region (blue arrows, panel (c)).\n\n\fFig. 2 (a) Temperature dependent resistance curves of Fe1.01Se measured at different pressures. There is a\nsystematic change in Tc, as well as the onset temperature of the low temperature linear resistivity regime\n57\n(indicated by arrows). (b) Fe Mössbauer spectra at 295K under various pressures (data for 4.2 K\nshown in insets). Under no conditions is a sextet, indicative of static magnetic order, observed. The dark\ngray shading indicates the signal arising from the appearance of the high pressure hexagonal phase. (c)\nDetailed views of the superconducting transition at various pressures. Arrows indicate the onset\ntemperatures of the linear temperature dependence of the resistivity. There is a change in concavity in the\ntransition to linear behavior as the applied pressure is increased. Some curves have been offset for clarity\nand dotted lines equal zero in those cases.\n\n\fFig. 3 (a) An increasing phase fraction of the hexagonal form of iron selenide results in the onset\nsemiconducting behavior by 30 GPa. (b) The Mössbauer spectrum of the sample at 19.7 GPa and\n4.2 K shows two paramagnetic lines corresponding to the tetragonal (light gray) and hexagonal\n(dark gray) forms (spectrum at 295 K and 31.0 GPa shown in the inset). These data imply that\nthe NiAs-type hexagonal phase is semiconducting without long range magnetic order. (c) This\nbehavior cannot be explained under the local density approximation (LDA), which predicts\nmetallic behavior due to the non-zero density of states at the Fermi level. The inclusion of\nelectron correlations, either by LDA+U (U ~ 4 eV) or exact exchange (B3LYP functional), is\nnecessary to reproduce the observed phenomenology.\n\n\fFig. 4 Electronic phase diagram of Fe1.01Se as a function of pressure. At low temperatures there\nis an anomalous metal regime where the resistivity is linear in temperature (see Fig. 2) prior to\nthe onset of superconductivity. The maximum Tc observed is 36 K at 8.9 GPa. At high pressures\nthe sample is solely hexagonal, and shows semiconducting behavior. The inset shows the strong\ndependence of Tc on the crystallographic c/a ratio.\n\n\f"}