{"id": "http://arxiv.org/abs/0901.3437v1", "guidislink": true, "updated": "2009-01-22T09:40:43Z", "updated_parsed": [2009, 1, 22, 9, 40, 43, 3, 22, 0], "published": "2009-01-22T09:40:43Z", "published_parsed": [2009, 1, 22, 9, 40, 43, 3, 22, 0], "title": "Golden fraction in the theory of nucleation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0901.1363%2C0901.1507%2C0901.2598%2C0901.0426%2C0901.4166%2C0901.0647%2C0901.1935%2C0901.2072%2C0901.3161%2C0901.1504%2C0901.3383%2C0901.0012%2C0901.4453%2C0901.3269%2C0901.4847%2C0901.2199%2C0901.3197%2C0901.3955%2C0901.1383%2C0901.0875%2C0901.3911%2C0901.1275%2C0901.2762%2C0901.4313%2C0901.3411%2C0901.3004%2C0901.3105%2C0901.4303%2C0901.4479%2C0901.4126%2C0901.3013%2C0901.1509%2C0901.0877%2C0901.4913%2C0901.1440%2C0901.3849%2C0901.1431%2C0901.4890%2C0901.4571%2C0901.2351%2C0901.4747%2C0901.0297%2C0901.4828%2C0901.3174%2C0901.0979%2C0901.0252%2C0901.3592%2C0901.0589%2C0901.2948%2C0901.4028%2C0901.2751%2C0901.3180%2C0901.0132%2C0901.1817%2C0901.2587%2C0901.2934%2C0901.2570%2C0901.4276%2C0901.0289%2C0901.2862%2C0901.3131%2C0901.3900%2C0901.2684%2C0901.0317%2C0901.3226%2C0901.3500%2C0901.0430%2C0901.3565%2C0901.2181%2C0901.1491%2C0901.1350%2C0901.2312%2C0901.0699%2C0901.4812%2C0901.2809%2C0901.3477%2C0901.0222%2C0901.3437%2C0901.3857%2C0901.2100%2C0901.2786%2C0901.2534%2C0901.1174%2C0901.2315%2C0901.3283%2C0901.4132%2C0901.2639%2C0901.1617%2C0901.3471%2C0901.1702%2C0901.2877%2C0901.3780%2C0901.1767%2C0901.4732%2C0901.4865%2C0901.0364%2C0901.2089%2C0901.2088%2C0901.2149%2C0901.4123%2C0901.3160&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Golden fraction in the theory of nucleation"}, "summary": "The problem of the universal form of the size spectrum is analyzed. The\nhalf-widths of two wings of spectrum is introduced and it is shown that their\nratio is very close to the golden fraction. In appendix it is shown that behind\nthe golden fraction of an image one can find the information basis, i.e. the\nproportion of the golden fraction corresponds to some method to find extremum.\nThe method to find extrema associated with Fibonacci numbers also leads to\nproportions which can be seen in nature or can be introduced artificially. The\ninformation origin of proportions is proved theoretically and confirmed by\nexamples in nature and human life.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0901.1363%2C0901.1507%2C0901.2598%2C0901.0426%2C0901.4166%2C0901.0647%2C0901.1935%2C0901.2072%2C0901.3161%2C0901.1504%2C0901.3383%2C0901.0012%2C0901.4453%2C0901.3269%2C0901.4847%2C0901.2199%2C0901.3197%2C0901.3955%2C0901.1383%2C0901.0875%2C0901.3911%2C0901.1275%2C0901.2762%2C0901.4313%2C0901.3411%2C0901.3004%2C0901.3105%2C0901.4303%2C0901.4479%2C0901.4126%2C0901.3013%2C0901.1509%2C0901.0877%2C0901.4913%2C0901.1440%2C0901.3849%2C0901.1431%2C0901.4890%2C0901.4571%2C0901.2351%2C0901.4747%2C0901.0297%2C0901.4828%2C0901.3174%2C0901.0979%2C0901.0252%2C0901.3592%2C0901.0589%2C0901.2948%2C0901.4028%2C0901.2751%2C0901.3180%2C0901.0132%2C0901.1817%2C0901.2587%2C0901.2934%2C0901.2570%2C0901.4276%2C0901.0289%2C0901.2862%2C0901.3131%2C0901.3900%2C0901.2684%2C0901.0317%2C0901.3226%2C0901.3500%2C0901.0430%2C0901.3565%2C0901.2181%2C0901.1491%2C0901.1350%2C0901.2312%2C0901.0699%2C0901.4812%2C0901.2809%2C0901.3477%2C0901.0222%2C0901.3437%2C0901.3857%2C0901.2100%2C0901.2786%2C0901.2534%2C0901.1174%2C0901.2315%2C0901.3283%2C0901.4132%2C0901.2639%2C0901.1617%2C0901.3471%2C0901.1702%2C0901.2877%2C0901.3780%2C0901.1767%2C0901.4732%2C0901.4865%2C0901.0364%2C0901.2089%2C0901.2088%2C0901.2149%2C0901.4123%2C0901.3160&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The problem of the universal form of the size spectrum is analyzed. The\nhalf-widths of two wings of spectrum is introduced and it is shown that their\nratio is very close to the golden fraction. In appendix it is shown that behind\nthe golden fraction of an image one can find the information basis, i.e. the\nproportion of the golden fraction corresponds to some method to find extremum.\nThe method to find extrema associated with Fibonacci numbers also leads to\nproportions which can be seen in nature or can be introduced artificially. The\ninformation origin of proportions is proved theoretically and confirmed by\nexamples in nature and human life."}, "authors": ["V. Kurasov"], "author_detail": {"name": "V. Kurasov"}, "author": "V. Kurasov", "arxiv_comment": "10 pages", "links": [{"href": "http://arxiv.org/abs/0901.3437v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0901.3437v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.gen-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.gen-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0901.3437v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0901.3437v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:0901.3437v1 [physics.gen-ph] 22 Jan 2009\n\nGolden fraction in the theory of nucleation\nVictor Kurasov\nSt.Petersburg State University\nAbstract\nThe problem of the universal form of the size spectrum is analyzed. The half-widths of two wings of spectrum is introduced and it\nis shown that their ratio is very close to the golden fraction. In appendix it is shown that behind the golden fraction of an image one can\nfind the information basis, i.e. the proportion of the golden fraction\ncorresponds to some method to find extremum. The method to find\nextrema associated with Fibonacci numbers also leads to proportions\nwhich can be seen in nature or can be introduced artificially. The information origin of proportions is proved theoretically and confirmed\nby examples in nature and human life.\n\n1\n\nUniversal proportion in the form of the size\nspectrum\n\nIt is well known that the phenomenon of a golden fraction is widely spread\nin nature. This fact is proven by numerous measurements during hundreds\nof years. The most striking feature is that some fundamental proportions in\nnature satisfy the golden fraction.\nIt is worth seeking the golden fraction in the process of nucleation. The\nmost natural conditions are the dynamic ones. Under these conditions there\nis a universal form of size spectrum derived in [1]. The form of the universal\nspectrum is given by the following formula\nf = exp(x − exp(x))\nin the special coordinates (see [1]) after the special renormalization.\n1\n\n\fThe spectrum has the amplitude\nfam = exp(−1)\nwhich is attained at x = 0.\nThe relaxation length is ordinary defined as the length where the function is diminished in exp(1) times. So, here appeared two lengths - one\ncorresponding to the right wing and that corresponding to the left wing.\nWe shall denote them as −x1 and x2 . They can be expressed through the\nW-Lambert function and have the following values\nx1 = 1.84\nx2 = 1.14\nThe ratio x2 /x1 is very close to the golden fraction\nx2 /x1 = 0.622\nThis value is very close to the precise value of the golden fraction 0.618. The\nrelative error is less than one percent.\nThe situation is clarified by fig.1.\nThere is no yet any clear interpretation of such good coincidence of this\nresult with the golden fraction. It is quite possible that this is explained by\nthe information origin of the golden fraction which is derived in Appendix.\n\n2\n\nAppendix:The role of the information interaction in the golden fraction\n\nThe proportions of a human body satisfy the golden fraction rule as it was\nstated many times, for example, by Pythagoras, Leonardo da Vinci, etc.\nBut investigations of Adolf Zeising [2] showed that only the main proportion\nof a male body satisfies in the global proportions the rule of the golden\nfraction. The global proportion of a female body slightly differs from the\ngolden fraction 1.618 and it is 1.60. Why this slight deviation takes place?\nBelow the answer on this question will be given. This answer is based on\nthe information origin of the golden fraction which will be analyzed below\ntogether with incomplete fractions appeared as ratios of Fibonacci numbers.\n2\n\n\f0.35\n\n0.3\n\n0.25\n\n0.2\n\n0.15\n\n0.1\n\n0.05\n\n–4\n\n–3\n\n–2\n\n–1\n\n0\n\n1\n\n2\n\n3\n\n4\n\nx\n\nFig. 1. The form of the universal spectrum and the golden fraction. The\nhorizontal line is e times smaller than the amplitude and cuts the spectrum\nat the half-widths.\n\n2.1\n\nInformation origin of the golden fraction\n\nWe admit that there is some natural process behind the phenomena of the\ngolden fraction. What process can it be? At least this is the process of\nobservation. Certainly, the process of observation is the information interaction between the observer and the environment. What purposes are attained\nin this interaction? We suppose that the observer wants to reconstruct the\nshape and the content of the image. The points which produces the maximal\ninformation are certainly the bifurcation points. The second important class\nof points are the points of extrema. Bifurcation points compose the shape of\nthe object and form the information background to find all other characteristics of the object. At this shape the points of extrema have to be found.\nSo, the primary task is to find extrema.\nIt is known that practically all methods to find exremum different from the\nsimple comparison of function in different points contain the one dimensional\nprocedure as a elementary step in the global procedure [3]. So, it is worth to\nconsider namely the one dimensional procedure of the extremum seeking.\n\n3\n\n\fConsider an elementary interval [0, 1]. This interval will be the initial\ninterval where the extremum (maximum) of the known function exists. Our\ntask is to determine the position of this maximum.\nTo state that there is a maximum inside the given interval it is necessary\nto have at least three points at the interval. Two points will be at the ends of\ninterval. This is clear because during the sequential procedure we diminish\nthe initial interval and automatically the boundary points of a new interval\nwill be already measured. When we have three points we can only state that\nthere is a maximum in the inner point when the function in the inner point\nis greater than at the boundary points. But we can not diminish the interval\nwithout the forth point. Let the inner points be x1 and x2 . We have to\ndetermine the positions of these points. Let x1 be less than x2 .\nWhen f (x1 ) > f (x2 ) then we can reduce [0, 1] to [0, x2 ]. When f (x1 ) <\nf (x2 ) then [0, 1] can be reduced to [x1 , 1].\nThe symmetry requires that\nx1 = 1 − x2\nThen to determine the position of x1 one can note that at interval [0, x2 ]\nit will be necessary to put two points and it would be very profitable when\none of these points coincides with x1 . This point will be the left point in the\ninterval [0, x2 ]. Then\nx1 = x2 ∗ x2\nor\n\nwith a root\n\nx1 = (1 − x1 ) ∗ (1 − x1 )\n\n√\n3− 5\nx1 =\n2\nwhich belongs to [0, 1]. The value\n√\n−1 + 5\n1 − x1 =\n= 0.618\n2\nis called the golden fraction.\nThis value is namely the golden fraction mentioned at the beginning.\nSo, there appeared a hypothesis that the golden fraction in nature is associated with a process of observation and with the procedure of seeking the\nextremum. This is the main idea of this publication. But it is necessary to\nconfirm this observation. This will be done below.\n4\n\n\f2.2\n\nExample of inapplicability of the pure golden fraction\n\nWe shall check the method of the golden fraction on example of the seeking\nfor the approximate extremum by two measurements in the inner points of\ninterval. After only two measurements it is necessary to take the final decision. This is the minimal number of measurements because one measurement\ncan not specify the interval smaller than the initial one.\nThe simple analysis shows that the smallest interval will be when two\npoints are x1 = 1/3, x2 = 2/3. It does not correspond to the golden fraction,\nbut x2 = 0.6666 is rather close to 0.618. Here\nx1 = 1 − x2 = x2 − x1\n\n(1)\n\nThe reason of the discrepancy is the finite number of measurements. So, it\nis necessary to analyze the optimal procedures to find extremum with finite\nnumber of points.\n\n2.3\n\nThe method to find extremum in the finite number\nof measurements\n\nOne of the oldest methods to find extrema is the Fibonacci method described\nalready by Euclid [3].\nLet the process be the one dimensional searching of an extremum restricted by N measurements. The process is supposed to be a sequential\none, i.e. the observer makes conclusions about the interval for the possible\nvalues of an argument at every step of the measurements. We shall call this\ninterval as the uncertainty interval IN .\nNow we consider the last measurement XN . It has to be made in interval\nIN −1 . This interval contains the point of extremum and also the point EN −1\nat which the extremum between all taken measurements is attained.\nIf we take the new point of measurement XN equal or very close to EN −1\nthen we get no new information about the behavior of the function and such\nmeasurement is useless. So, it is necessary to have a distance between XN\nand EN −1 . Certainly, we do not know this distance and and speak only about\nthe lowest boundary for this distance δ.\nThe best estimate for the |IN | will be when we put XN symmetrically to\nEN −1 with respect to the middle of interval IN −1 . Then\nIN −1 = 2IN − δ\n5\n\n\fThis completes the step in the recurrent procedure.\nNow we come to the previous pair of experiments. The interval IN −1\ncontains EN −2 . In this interval two experiments will be made. The best\nexperiment in this pair will be EN −1 . Another experiment will be denoted\nas DN −1 . This point will be the boundary between two parts of IN −2 : one\npart will be included in the further investigations and the other part will be\nthrown out.\nBut at the beginning of experiment it is not known what value from the\npair will be the best and what will be thrown out. So, these values have to\nbe symmetric with respect to the ends of interval. So, the distances from\nthese points to the ends of interval have to be equal.\nSince both points are symmetric with respect to the middle of interval\nand one of the points will be the optimal EN −1 then every point has to be\nat the distance LN −1 from the end of interval. Then\nLN −2 = LN −1 + LN\nThese recurrent relations are typical for the Fibonacci numbers. It is necessary to check the initial numbers with N = 1 and N = 2 but according to\n(1) these numbers are equal and after the renormalization of L1 and L2 we\ncome to\nF1 = 1, F2 = 1\nThen LN = FN are the Fibonacci numbers.\nThe sequential necessary proportions will be\nF2 /F3 = 2/3, F3 /F4 = 3/5, F4 /F5 = 5/8\nAlready F4 /F5 is very close to the golden fraction and later all sequential\nfractions will approach to the golden fraction. So, it is worth to consider\nonly the first fractions.\nOne can see that this method is optimal in the case of N measurements.\n\n2.4\n\nExamples of proportions\n\nWhen human bodies or some other objects in nature have the mentioned\nproportions it allows to grasp their image rather fast. So, one can speak\nabout the increase of the interaction speed. The time necessary to get the\napproximate image is smaller when the main extreme points of an image\n6\n\n\fcoincide with proportions prescribed by the golden fraction or Fibonacci\nfractions.\nIf our hypothesis is true then there will be numerous examples of the\nFibonacci fractions F2 /F3 and especially F3 /F4 . The higher fractions can not\nbe observed because they are too close to the golden fraction. Really, in many\ncases it is necessary to get the extremum after two or three measurements.\nAs an example one can consider professions of drivers, hunters, etc., where\nit is very important to take decisions immediately.\nSo, one can come to conclusion that there exist some observers who have\nthe habits to estimate the extrema in several first steps. The object under\nsuch observation will correspond to their habits.\nAs it is known from statistical mechanics the additional time spending for\na fixed job corresponds to some surplus energy (because the small time corresponds to the nonequilibrium process which requires the surplus energy).\nSo, the construction of the image with ideal proportions is energetically profitable.\nNow it is clear that the proportion of a female body 0, 60 corresponds\nto F3 /F4 and it is explained by historical role of a hunter in a pre-historical\nperiod. Since it was necessary to take decisions immediately the hunters\nused to estimate the image in two or three basic points, Contrary to men\nthe women have enough time for observations in their silent life and, thus,\nthe male body have a proportion of a golden fraction corresponding to the\ninfinite number of observations.\nCertainly, women can not immediately transform their body to the golden\nfraction proportion in our society where professions of men are now rather\ncalm. But later the evolution choice will inevitably bring this proportion\nto a golden fraction. The women with long feet are sexually attractive now\nand have more chances to get children, So, earlier or later this proportion\nwill come to the golden fraction. But it takes thousands of years and now\nwe have the proportion F3 /F4 which is the trace of men's professions in the\npre-historical times.\nOne can see the following interesting example confirming this theory. The\nKuroi in Greece created before the classic period have proportions (see fig.2)\ncorresponding to the female fraction 0.60.\nAn explanation is very simple since the sculptor and spectators were\nmainly the men who found the sexually attractive proportions as the female\nones. Only in classic period these proportions were reconsidered and brought\nto the real proportions of a male body.\n7\n\n\fFig. 2. Example of Kuros. The ratio b/(a + b) is close to 0.60\nIs it possible to view the first proportion F2 /F3 in a human body? In\nnature it does not exist. But it can be seen in artificial images of women\nclothes in a fashion industry images (see fig.3).\nThe mentioned main ratio here is close to F2 /F3 . One can continue this\ntype of examples. The different heights of heels help women to modify the\nmain ratio of a body. One and a half or two centimeters of a heel give\napproximately one percent in ratio. So, the heels in three-four centimeters\ntransforms the ratio 0.60 to the golden fraction. This corresponds to the\nEnglish heel. The high heels in 10 centimeters transforms the ratio into the\nfraction F3 /F4 . This is a French heel. Two types of heels give a clear answer\non applicability of the Fibonacci ratios. Women evidently vote by their heels\nfor the information basis of the harmonic proportions in nature.\nAs the result of the given considerations one can state that now the information origin of appearance of the golden fraction is clarified. If we start\nfrom the principle of the minimal energy we can derive the golden fraction\nanalytically since every observation requires some time and, thus, some additional energy. The facts appeared from the incomplete golden fractions, i.e.\nfrom the Fibonacci numbers, show experimentally that behind the golden\n8\n\n\fFig. 3. Example of a fashion design. The ratio b/(a + b) is close to 0.66\nproportions there is the Fibonacci method of the extrema determination.\nOne can also mention that now it is clear why ordinary in the women\nfashion the waist line is outlined. Really, the waist line goes approximately\nthree centimeters higher the umbilicus point which brings the ratio 0.60 =\nF3 /F4 to the golden fraction.\nOne can also see that the spatial sequence of different Fibonacci proportions introduces the sequence of different times for observation of these\nproportions. So, there appeared the connection between the space image and\nthe sequence of times (or the melody) of observation. This allows to speak\nabout the space-time connection and about the melody of paintings.\n\nReferences\n[1] Kurasov V.B. Theoretical and mathematical physics, 2002, 131:3,\n503528\n[2] Adolf Zeising, Neue Lehre von den Proportionen des menschlichen\nKo\"rpers aus einem bisher unerkannt gebliebenen, die ganze Natur\n9\n\n\fund Kunst durchdringenden morphologischen Grundgesetze entwickelt,\nLeipzig, 1854\n[3] Kusin L.T. Foundations of cybernetics, vol.1, Moscow, Energy, 1973,\n504 p.\n\n10\n\n\f"}