{"id": "http://arxiv.org/abs/1003.0889v2", "guidislink": true, "updated": "2010-03-20T00:16:46Z", "updated_parsed": [2010, 3, 20, 0, 16, 46, 5, 79, 0], "published": "2010-03-03T20:33:00Z", "published_parsed": [2010, 3, 3, 20, 33, 0, 2, 62, 0], "title": "Credit Default Swaps Liquidity modeling: A survey", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.5038%2C1003.3909%2C1003.1227%2C1003.1352%2C1003.0945%2C1003.3735%2C1003.1337%2C1003.2608%2C1003.5796%2C1003.1718%2C1003.0649%2C1003.4606%2C1003.5945%2C1003.1475%2C1003.3001%2C1003.2225%2C1003.3082%2C1003.0110%2C1003.3107%2C1003.0453%2C1003.0865%2C1003.2104%2C1003.3832%2C1003.4100%2C1003.1565%2C1003.1701%2C1003.0899%2C1003.2486%2C1003.5131%2C1003.4940%2C1003.0060%2C1003.4314%2C1003.4002%2C1003.5198%2C1003.4946%2C1003.2871%2C1003.0420%2C1003.3028%2C1003.2943%2C1003.4429%2C1003.5279%2C1003.3289%2C1003.4060%2C1003.0841%2C1003.5148%2C1003.3000%2C1003.0824%2C1003.4749%2C1003.1525%2C1003.1843%2C1003.0020%2C1003.3259%2C1003.5774%2C1003.3297%2C1003.2517%2C1003.1618%2C1003.1908%2C1003.1127%2C1003.4153%2C1003.1738%2C1003.1065%2C1003.2521%2C1003.3958%2C1003.3249%2C1003.1764%2C1003.3220%2C1003.4991%2C1003.5857%2C1003.1877%2C1003.0476%2C1003.3935%2C1003.0889%2C1003.0957%2C1003.3652%2C1003.3521%2C1003.3424%2C1003.0657%2C1003.2876%2C1003.0831%2C1003.3898%2C1003.4557%2C1003.3519%2C1003.1489%2C1003.5860%2C1003.2181%2C1003.2408%2C1003.0980%2C1003.5025%2C1003.5116%2C1003.2526%2C1003.4857%2C1003.4838%2C1003.4733%2C1003.0609%2C1003.1564%2C1003.2417%2C1003.5454%2C1003.1781%2C1003.3359%2C1003.0816%2C1003.0119&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Credit Default Swaps Liquidity modeling: A survey"}, "summary": "We review different approaches for measuring the impact of liquidity on CDS\nprices. We start with reduced form models incorporating liquidity as an\nadditional discount rate. We review Chen, Fabozzi and Sverdlove (2008) and\nBuhler and Trapp (2006, 2008), adopting different assumptions on how liquidity\nrates enter the CDS premium rate formula, about the dynamics of liquidity rate\nprocesses and about the credit-liquidity correlation. Buhler and Trapp (2008)\nprovides the most general and realistic framework, incorporating correlation\nbetween liquidity and credit, liquidity spillover effects between bonds and CDS\ncontracts and asymmetric liquidity effects on the Bid and Ask CDS premium\nrates. We then discuss the Bongaerts, De Jong and Driessen (2009) study which\nderives an equilibrium asset pricing model incorporating liquidity effects.\nFindings include that both expected illiquidity and liquidity risk have a\nstatistically significant impact on expected CDS returns. We finalize our\nreview with a discussion of Predescu et al (2009), which analyzes also data\nin-crisis. This is a statistical model that associates an ordinal liquidity\nscore with each CDS reference entity and allows one to compare liquidity of\nover 2400 reference entities. This study points out that credit and illiquidity\nare correlated, with a smile pattern. All these studies highlight that CDS\npremium rates are not pure measures of credit risk. Further research is needed\nto measure liquidity premium at CDS contract level and to disentangle liquidity\nfrom credit effectively.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.5038%2C1003.3909%2C1003.1227%2C1003.1352%2C1003.0945%2C1003.3735%2C1003.1337%2C1003.2608%2C1003.5796%2C1003.1718%2C1003.0649%2C1003.4606%2C1003.5945%2C1003.1475%2C1003.3001%2C1003.2225%2C1003.3082%2C1003.0110%2C1003.3107%2C1003.0453%2C1003.0865%2C1003.2104%2C1003.3832%2C1003.4100%2C1003.1565%2C1003.1701%2C1003.0899%2C1003.2486%2C1003.5131%2C1003.4940%2C1003.0060%2C1003.4314%2C1003.4002%2C1003.5198%2C1003.4946%2C1003.2871%2C1003.0420%2C1003.3028%2C1003.2943%2C1003.4429%2C1003.5279%2C1003.3289%2C1003.4060%2C1003.0841%2C1003.5148%2C1003.3000%2C1003.0824%2C1003.4749%2C1003.1525%2C1003.1843%2C1003.0020%2C1003.3259%2C1003.5774%2C1003.3297%2C1003.2517%2C1003.1618%2C1003.1908%2C1003.1127%2C1003.4153%2C1003.1738%2C1003.1065%2C1003.2521%2C1003.3958%2C1003.3249%2C1003.1764%2C1003.3220%2C1003.4991%2C1003.5857%2C1003.1877%2C1003.0476%2C1003.3935%2C1003.0889%2C1003.0957%2C1003.3652%2C1003.3521%2C1003.3424%2C1003.0657%2C1003.2876%2C1003.0831%2C1003.3898%2C1003.4557%2C1003.3519%2C1003.1489%2C1003.5860%2C1003.2181%2C1003.2408%2C1003.0980%2C1003.5025%2C1003.5116%2C1003.2526%2C1003.4857%2C1003.4838%2C1003.4733%2C1003.0609%2C1003.1564%2C1003.2417%2C1003.5454%2C1003.1781%2C1003.3359%2C1003.0816%2C1003.0119&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We review different approaches for measuring the impact of liquidity on CDS\nprices. We start with reduced form models incorporating liquidity as an\nadditional discount rate. We review Chen, Fabozzi and Sverdlove (2008) and\nBuhler and Trapp (2006, 2008), adopting different assumptions on how liquidity\nrates enter the CDS premium rate formula, about the dynamics of liquidity rate\nprocesses and about the credit-liquidity correlation. Buhler and Trapp (2008)\nprovides the most general and realistic framework, incorporating correlation\nbetween liquidity and credit, liquidity spillover effects between bonds and CDS\ncontracts and asymmetric liquidity effects on the Bid and Ask CDS premium\nrates. We then discuss the Bongaerts, De Jong and Driessen (2009) study which\nderives an equilibrium asset pricing model incorporating liquidity effects.\nFindings include that both expected illiquidity and liquidity risk have a\nstatistically significant impact on expected CDS returns. We finalize our\nreview with a discussion of Predescu et al (2009), which analyzes also data\nin-crisis. This is a statistical model that associates an ordinal liquidity\nscore with each CDS reference entity and allows one to compare liquidity of\nover 2400 reference entities. This study points out that credit and illiquidity\nare correlated, with a smile pattern. All these studies highlight that CDS\npremium rates are not pure measures of credit risk. Further research is needed\nto measure liquidity premium at CDS contract level and to disentangle liquidity\nfrom credit effectively."}, "authors": ["Damiano Brigo", "Mirela Predescu", "Agostino Capponi"], "author_detail": {"name": "Agostino Capponi"}, "author": "Agostino Capponi", "arxiv_comment": "36 pages, 2 figures", "links": [{"href": "http://arxiv.org/abs/1003.0889v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1003.0889v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "q-fin.RM", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "q-fin.RM", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "q-fin.CP", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1003.0889v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1003.0889v2", "journal_reference": null, "doi": null, "fulltext": "An extended and updated version of this paper with the title\nLiquidity modeling for Credit Default Swaps: an overview\n\narXiv:1003.0889v2 [q-fin.RM] 20 Mar 2010\n\nwill appear in: Bielecki, T., Brigo, D., and Patras, F. (Editors)\n\"Credit Risk Frontiers. The subprime crisis, Pricing and Hedging, CVA, MBS,\nRatings and Liquidity\", Bloomberg Press.\n\n-\nCredit Default Swaps Liquidity modeling:\nA survey∗\nDamiano Brigo Mirela Predescu Agostino Capponi†\n\n∗\n\nWe are grateful to Rutang Thanawalla, Greg Gupton, Wei Liu, Ahmet Kocagil and Alexander Reyngold, who worked with us on the methodology of the Fitch Solutions liquidity project,\ncontributing to our insight in this challenging field. This work expresses the opinion of its authors\nand is in no way representing the opinion of the institutions the authors work for\n†\n\nBrigo is with the Dept of Mathematics, Imperial College, London, d.brigo@imperial.ac.uk;\nPredescu is with Lloyds TSB, Portfolio Policy,\nAnalytics and Optimization\nGroup, mirela.predescu@lloydsbanking.com; Capponi holds a PhD from Caltech,\nacapponi@caltech.edu . First Version: February 22, 2010.\n\n\fAbstract\nWe review different theoretical and empirical approaches for measuring the\nimpact of liquidity on CDS prices. We start by reduced form models incorporating liquidity as an additional discount rate. We review Chen, Fabozzi\nand Sverdlove (2008) and Buhler and Trapp (2006, 2008), adopting different assumptions on how liquidity rates enter the CDS premium rate formula,\nabout the dynamics of liquidity rate processes and about the credit-liquidity\ncorrelation. Buhler and Trapp (2008) provides the most general and realistic\nframework, incorporating correlation between liquidity and credit, liquidity\nspillover effects between bonds and CDS contracts and asymmetric liquidity\neffects on the Bid and Ask CDS premium rates. We then discuss the Bongaerts, De Jong and Driessen (2009) study which derives an equilibrium asset pricing model incorporating liquidity effects. Findings include that both\nexpected illiquidity and liquidity risk have a statistically significant impact\non expected CDS returns, but only compensation for expected illiquidity is\neconomically significant with higher expected liquidity being associated with\nhigher expected returns for the protection sellers. This finding is contrary\nto Chen, Fabozzi and Sverdlove (2008) that found protection buyers to earn\nthe liquidity premium instead. We finalize our review with a discussion of\nPredescu et al (2009), which analyzes also data in-crisis. This is a statistical model that associates an ordinal liquidity score with each CDS reference\nentity and allows one to compare liquidity of over 2400 reference entities.\nThis study points out that credit and illiquidity are correlated, with a smile\npattern. All these studies highlight that CDS premium rates are not pure\nmeasures of credit risk. CDS liquidity varies cross-sectionally and over time.\nCDS expected liquidity and liquidity risk premia are priced in CDS expected\nreturns and spreads. Further research is needed to measure liquidity premium\nat CDS contract level and to disentangle liquidity from credit effectively.\n\nAMS Classification Codes: 60H10, 60J60, 91B70;\nJEL Classification Codes: C51, G12, G13\nKeywords: Credit Default Swaps, Liquidity spread, Liquidity Premium, Credit\nLiquidity correlation, Liquidity pricing, Intensity models, Reduced Form Models,\nCapital Asset Pricing Model, Credit Crisis, Liquidity Crisis.\n\n2\n\n\fContents\n1 Introduction\n1.1 Funding, Trading and Systemic Liquidity\n1.2 Liquidity as a pricing component . . . .\n1.3 Liquidity in Risk Measurement . . . . .\n1.4 This survey: Liquidity in CDS pricing . .\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n2 Liquidity as a spread in Reduced Form Models\n2.1 Credit Default Swaps . . . . . . . . . . . . . . .\n2.2 Intensity models for CDS . . . . . . . . . . . . .\n2.3 Intensity models for liquidity . . . . . . . . . . .\n2.4 Chen, Fabozzi and Sverdlove (2008) [CFS] . . .\n2.5 Buhler and Trapp (2006, 2008) [BT06, BT08] .\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n4\n4\n5\n6\n7\n\n.\n.\n.\n.\n.\n\n8\n8\n11\n13\n17\n21\n\n3 Liquidity through the CAPM framework\n26\n3.1 Acharya and Pedersen (2005) [AP] . . . . . . . . . . . . . . . . . . . 26\n3.2 Bongaerts, De Jong and Driessen (2009) [BDD] . . . . . . . . . . . . 28\n4 Predescu et al (2009) [PTGLKR] and Tang and Yan (2007)\n\n29\n\n5 Discussion, Conclusions and Further Research\n\n30\n\n3\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n1\n\n4\n\nIntroduction\n\nLiquidity is a notion that has gained increasing attention following the credit crisis\nthat started in 2007 (\"the crisis\" in the following). As a matter of fact, this has\nbeen a liquidity crisis besides a credit crisis. For many market players, problems\nhave been aggravated by the lack of reserves when in need to maintain positions\nin order to avoid closing deals with large negative mark to markets. This lack of\nreserves forced fire sales at the worst possible moments and started a domino effect\nleading to the collapse of financial institutions.\n\n1.1\n\nFunding, Trading and Systemic Liquidity\n\nSzego (2009) illustrates, among other factors, a negative loop involving illiquidity as\nfueling the crisis development. We can consider for example the following schematization:\n1. (Further) liquidity reduction on asset trade;\n2. (Further) price contraction due to liquidity decline;\n3. (Further) decline of value of bank assets portfolio;\n4. Difficulty in refinancing, difficulty in borrowing, forced to (further) sale of\nassets;\n5. Assets left? If so, go back to 1. If not:\n6. Impossibility of refinancing;\n7. Bankruptcy.\nThis sketchy and admittedly simplified representation highlights the three types\nof liquidity that generally market participants care about. One is the market/trading\nliquidity generally defined as the ability to trade quickly at a low cost (O'Hara\n(1995)). This generally means low transaction costs coming from bid-ask spreads,\nlow price impact of trading large volumes and considerable market depth. This\nnotion of market liquidity can be applied to different asset classes (equities, bonds,\ninterest rate products, FX products, credit derivatives etc.) and to the overall\nfinancial markets. In addition to trading liquidity, banks and financial institutions\nalso closely monitor the funding liquidity, which is the ease with which liabilities\ncan be funded through different financing sources.\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n5\n\nMarket and funding liquidity are related since timely funding of liabilities relies\non the market liquidity risk of its assets, given that a bank may need to sell some\nof its assets to match its liability-side obligations at certain points in time. The\nrecent crisis prompted regulators and central banks to look very closely at both\ntypes of liquidity and to propose new guidelines for liquidity risk management (see\nBIS(2008), FSA(2009)).\nA third kind of liquidity that is however implicit in the above schematization, is\nthe systemic liquidity risk associated to a global financial crisis, characterized by a\ngeneralized difficulty in borrowing.\nAs with other types of risks, liquidity needs to be analyzed from both a pricing\nperspective and a risk management one.\n\n1.2\n\nLiquidity as a pricing component\n\nIn the pricing space, Amihud, Mendelson, and Pedersen (2005) provide a thorough\nsurvey of theoretical and empirical papers that analyze the impact of liquidity on\nasset prices for traditional securities such as stocks and bonds. Other papers (Cetin,\nJarrow, Protter, and Warachka (2005), Garleanu, Pedersen and Poteshman (2006))\ninvestigated the impact of liquidity on option prices. More generally Cetin, Jarrow\nand Protter (2004) extends the classical arbitrage pricing theory to include liquidity\nrisk by considering an economy with a stochastic supply curve where the price of\na security is a function of the trade size. This leads to a new definition of selffinancing trading strategies and to additional restrictions on hedging strategies, all\nof which have important consequences in valuation. Their paper also reports a good\nsummary of earlier literature on transaction costs and trade restrictions, to which\nwe refer the interested reader.\nMorini (2009) analyzes the liquidity and credit impact on interest rate modeling,\nbuilding a framework that consistently accounts for the divergence between market\nforward rate agreements (FRA) rates and the LIBOR replicated FRA rates. He\nalso accounts for the divergence between overnight indexed swap rates (EONIA)\nand LIBOR rates. The difference between the two rates can only be attributed to\nliquidity or counterparty risk, the latter being almost zero in EONIA due to the\nvery short (practically daily) times between payments. For illustration purposes, we\nreport in Fig. 1 the differences between EONIA and LIBOR rates for Europe and\nthe analogous difference for the United States. It is clear from the graphs in Fig. 1\nthat starting from the end of 2007 and till mid 2008, there is a noticeable increase\nof the difference between 1 month Libor and overnight index swap rate, which is\ninstead very small in the beginning of the observation period. This is not surprising\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n6\n\n0.8\n0.6\n0.4\n0.2\n0.0\n\nEULibor1M − EUSOA\n\nEULibor1M − EUSOA index difference\n\n2007\n\n2008\nIndex\n\n0.8\n0.6\n0.4\n0.2\n0.0\n\nUSLibor1M − USSOA\n\n1.0\n\nUSLibor1M − USSOA index difference\n\n2007\n\n2008\nIndex\n\nFigure 1: Difference between 1 month EU (US) Libor and EU (US) overnight index\nswap\n\nas the end of 2007 corresponds to the start of the subprime mortgage crisis, which\nthen exacerbated and became the credit crunch crisis for the all period of 2008.\nThe analysis done by Morini (2009) makes use of Basis Swaps between LIBOR\nwith different tenors, and takes into account collateralization. Morini is able to\nreconcile the divergence in rates even under simplifying assumptions. His analysis\nhowever implicitly views liquidity as a consequence of credit rather than as an independent variable, although he does not exclude the possibility that liquidity may\nhave a more independent component.\n\n1.3\n\nLiquidity in Risk Measurement\n\nSeveral studies (Jarrow and Subramanian(1997), Bangia et al. (1999), Angelidis and\nBenos (2005), Jarrow and Protter(2005), Stange and Kaserer(2008), Earnst, Stange\nand Kaserer(2009) among few others) propose different methods of accounting for\nliquidity risk in computing risk measures. Bangia et al. (1999) classify market liquidity risk in two categories: (a) the exogenous illiquidity which depends on general\nmarket conditions, is common to all market players and is unaffacted by the actions\nof any one participant and (b) the endogenous illiquidity that is specific to one's\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n7\n\nposition in the market, varies across different market players and is mainly related\nto the impact of the trade size on the bid-ask spread. Bangia et al. (1999) and\nEarnst et al. (2009) only consider the exogenous illiquidity risk and propose a liquidity adjusted VaR measure built using the distribution of the bid-ask spreads. The\nother mentioned studies model and account for endogenous risk in the calculation\nof liquidity adjusted risk measures.\nIn the context of the coherent risk measures literature, the general axioms a\nliquidity measure should satisfy are discussed in Acerbi and Scandolo (2008). They\npropose a formalism for Liquidity Risk which is compatible with the axioms of\ncoherency of the earlier risk measures literature. They emphasize the important\nbut easily overlooked difference between coherent risk measures defined on portfolio\nvalues and coherent risk measures defined on the vector space of portfolios. The key\nobservation is that in presence of liquidity risk the value function on the space of\nportfolios is not necessarily linear. From this starting point a theory is developed,\nintroducing a nonlinear value function depending on a notion of liquidity policy\nbased on a general description of the microstructure of illiquid markets and the\nimpact that this microstructure has when marking to market a portfolio.\n\n1.4\n\nThis survey: Liquidity in CDS pricing\n\nIn this paper we focus on liquidity modeling in the valuation space, to which we go\nfully back now, and more specifically, in the context of credit derivatives instruments,\non the impact of liquidity on credit default swaps (CDS) premium rates. CDS\nrepresent the most liquid credit instruments and are highly standardized. The basic\nidea to include liquidity as a spread, leading to a liquidity stochastic discount factor,\nfollows the approach adopted for example by Chen, Cheng and Wu (2005)1 , Buhler\nand Trapp (2006) and (2008) (BT06 and BT08) and Chen, Fabozzi and Sverdlove\n(2008) (CFS), among others. All approaches but BT08 are unrealistic in that they\nassume the liquidity rate to be independent of the hazard rate associated to defaults\nof the relevant CDS entities. BT08 and Predescu et al (2009) show, although in\ndifferent contexts, that liquidity and credit are correlated. We discuss their results.\nWe will then analyze a different approach, by Bongaerts, De Jong and Driessen\n(2009) (BDD) who use Capital Asset Pricing Model (CAPM) like arguments to\ndeduce liquidity from CDS data. None of these works uses data in-crisis, i.e. after\nJune 2007. One exception is Predescu et al (2009) (PTGLKR), where liquidity\n1\n\nthis is reviewed in Brigo, Predescu and Capponi (2010) but not here\n\n\f8\n\nD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\nscores for CDS data are produced starting from contributors BID ASK or MID\nCDS quotes across time. This is an ordinal liquidity measure, as opposed to a more\nattractive cardinal one, but it represents - to the best of our knowledge - the only\nwork dealing with CDS liquidity using also crisis data. After the ordinal model by\nPredescu et al (2009), we go back to cardinal models and briefly hint at Tang and\nYan (2007), that also includes bid ask information among other variables chosen as\nliquidity measures: volatility to volume, number of contracts outstanding, trade to\nquote ratio and volume. Tang and Yan is reviewed more in detail in Brigo, Predescu\nand Capponi (2010).\nWe then conclude the paper by comparing the often contradictory findings of the\nabove works, pointing out remaining problems in liquidity estimation and pricing in\nthe credit market.\n\n2\n\nLiquidity as a spread in Reduced Form Models\n\nThe basic idea in this approach is to include liquidity as a (possibly stochastic)\nspread, leading to a liquidity (possibly stochastic) discount factor.\nIn order to be able to work on liquidity for CDS we need to introduce the CDS\ncontract and its mechanics. To this end we follow Brigo and Mercurio (2006),\nChapter 21.\n\n2.1\n\nCredit Default Swaps\n\nThe running CDS contract is defined as follows. A CDS contract ensures protection\nagainst default. Two parties \"A\" (Protection buyer) and \"B\" (Protection seller)\nagree on the following.\nIf a third party \"C\" (Reference Credit) defaults at time τ = τC , with Ta < τ < Tb ,\n\"B\" pays to \"A\" a certain amount LGD (Loss Given Default of the reference credit\n\"C\"). In turn, \"A\" pays to \"B\" a premium rate S at times Ta+1 , . . . , Tb or until\ndefault. Set αi = Ti − Ti−1 and T0 = 0. We can summarize the above structure as\n\nProtection\nSeller B\n\n→\n←\n\nprotection LGD at default τC if Ta < τC ≤ Tb →\nrate S at Ta+1 , . . . , Tb or until default τC\n←\n\nProtection\nBuyer A\n\n(protection leg and premium leg respectively). The amount LGD is a protection\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n9\n\nfor \"A\" in case \"C\" defaults. Typically LGD = notional, or \"notional - recovery\"\n= 1 − REC.\nFormally, we may write the CDS discounted value at time t as seen from \"B\" as\nΠRCDSa,b (t) := D(t, τ )(τ − Tβ(τ )−1 )S1{Ta <τ <Tb }\n+\n\nb\nX\n\n(2.1)\n\nD(t, Ti )αi S1{τ ≥Ti } − 1{Ta <τ ≤Tb } D(t, τ ) LGD\n\ni=a+1\n\nwhere t ∈ [Tβ(t)−1 , Tβ(t) ), i.e. Tβ(t) is the first date among the Ti 's that follows t and\nD(t, T ) is the risk free discount factor at time t for maturity T .\nA note on terminology: In the market S is usually called \"CDS spread\". However, we will use \"spread\" both to denote the difference between the Ask and Bid\nquotes of a security and to indicate instantaneous rates on top of the default-free\ninstantaneous rate r. To avoid confusion we will refer to S as to the CDS premium\nrate rather than CDS spread.\nUsually, at inception time (say 0) the amount S is set at a value Sa,b (0) that\nmakes the contract fair, i.e. such that the present value of the two exchanged flows\nis zero. This is how the market quotes running CDS's: CDS are quoted via their\nfair S's (Bid and Ask).\nRecently, there has been some interest in \"upfront CDS\" contracts with a fixed\npremium rate in the premium leg.2 In these contracts the premium rate S is fixed\nto some pre-assigned canonical value S̄, typically 100 or 500 basis points (bps, 1bp=\n10−4 ), and the remaining part of the protection is paid upfront by the party that\nis buying protection. In other terms, instead of exchanging a possible protection\npayment for some coupons that put the contract in equilibrium at inception, one\nexchanges it with a fixed coupon and compensates for the difference with an upfront\npayment.\nWe denote by CDS(t, [Ta+1 , . . . , Tb ], Ta , Tb , S, LGD) the price at time t of the above\nstandard running CDS (2.1). At times some terms are omitted, such as for example\nthe list of payment dates [Ta+1 , . . . , Tb ], and to shorten notation further we may\nwrite CDSa,b (t, S, LGD).\nThe pricing formulas for these payoffs depend on the assumptions on interest-rate\ndynamics and on the default time τ . If τ is assumed to be independent of interest rates, then model independent valuation formulas for CDS's involving directly\ndefault (or survival) probabilities and default free zero coupon bonds are available.\n2\n\nSee for example Beumee et al (2009) for a discussion on the upfront features and on the\nrunning-upfront conversion.\n\n\f10\n\nD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\nProper valuation of CDS should also take into account counterparty risk, see for\nexample Brigo and Chourdakis (2009, unilateral case) and Brigo and Capponi (2008,\nbilateral case). Here however we focus on works that did not consider counterparty\nrisk in the CDS valuation.\nIn general, whichever the model, we can compute the CDS price according to\nrisk-neutral valuation:\nCDSa,b (t, S, LGD) = Et {ΠRCDSa,b (t)}.\n\n(2.2)\n\nwhere Et is the risk neutral expectation conditional on the market information at\ntime t.\nIf we define the fair premium of the CDS at a given time t as the value of the\npremium rate S = Sa,b (t) such that CDSa,b (t, Sa,b (t), LGD) = 0, i.e. such that the\ntwo legs of the CDS have the same value, we can write, on {τ > t},\n\nSa,b (t) =\n\nEt [LGD 1{Ta <τ ≤Tb } D(t, τ )]\nP\nEt [D(t, τ )(τ − Tβ(τ )−1 )1{Ta <τ <Tb } + bi=a+1 D(t, Ti )αi 1{τ ≥Ti } ]\n\n(2.3)\n\nIf we assume independence between rates and the default time, or more in particular deterministic interest rates, then the default time τ and interest rate quantities\nr, D(s, t), ... are independent. It follows that the (receiver) CDS valuation, for a\nCDS selling protection at time 0 for defaults between times Ta and Tb in exchange\nof a periodic premium rate S becomes (PL = Premium Leg, DL = Default Leg or\nProtection Leg)\nCDSa,b (0, S, LGD; Q(τ > *)) = PLa,b (0, S; Q(τ > *)) − DLa,b (0, LGD; Q(τ > *))\n(2.4)\n#\n\" Z\nb\nTb\nX\nP (0, t)(t − Tβ(t)−1 )dt Q(τ ≥ t) +\nP (0, Ti )αi Q(τ ≥ Ti ) (2.5)\nPLa,b (0, S) = S −\nTa\n\ni=a+1\n\u0014Z Tb\n\nDLa,b (0, LGD) = −LGD\n\n\u0015\nP (0, t) dt Q(τ ≥ t) (, 2.6)\n\nTa\n\nwhere P (t, u) = Et [D(t, u)] is the price of a default risk free zero coupon bond. In\ncase rates are deterministic we have D(t, u) = P (t, u) for all t, u. The above CDS\nformula is model independent. In particular, for a spot CDS with Ta = 0 at t = 0\nwe have that the fair premium rate formula (2.3) becomes\nRT\n−LGD 0 b P (0, t) dt Q(τ ≥ t)\nS0,b (0) = R Tb\n(2.7)\nP\n− 0 P (0, t)(t − Tβ(t)−1 )dt Q(τ ≥ t) + bi=1 P (0, Ti )αi Q(τ ≥ Ti )\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n11\n\nThis means that if we strip survival probabilities from CDS in a model independent way at time 0, to calibrate a chosen model for τ to the market CDS quotes\nwe just need to make sure that the survival probabilities we strip from CDS are\ncorrectly reproduced by the chosen τ model, whichever it is.\nEquations (2.5, 2.6) are no longer valid in general if we remove the independence between τ and interest rates. This complicates matters considerably and this\nis the reason why most of the works on liquidity risk with CDS tend to assume\nindependence between default-free interest rates and default.\nMost of the approaches to liquidity we discuss in this paper are based on the\nintensity approach (or reduced form approach) to modeling τ . In this approach,\ndefault is not induced by basic market observables and/or economic fundamentals,\nbut has an exogenous component that is independent of all the default free market\ninformation. Monitoring the default free market (interest rates, exchange rates, etc)\ndoes not give complete information on the default process, and there is no economic\nrationale behind default. This family of models is particularly suited to model\ncredit spreads and in its basic formulation is easy to calibrate to Credit Default\nSwap (CDS) or corporate bond data.\n\n2.2\n\nIntensity models for CDS\n\nWe need now to introduce intensity models. First we need a few definitions from\nprobability theory. We place ourselves in a probability space (Ω, G, Gt , Q). The\nfiltration (Gt )t models the flow of information of the whole market, including credit\nand defaults. Q is the risk neutral measure. This space is endowed also with a rightcontinuous and complete sub-filtration Ft representing all the observable market\nquantities but the default events (hence Ft ⊆ Gt := Ft ∨ Ht where Ht = σ({τ ≤ u} :\nu ≤ t) is the right-continuous filtration generated by the default event).\nWe set Et (*) := E(*|Gt ), the risk neutral expectation leading to prices.\nIntensity models are based on the assumption that the default time τ is the first\njump of a Cox process with intensity ht (see for example Bielecki and Rutkowski\n(2001) for more details, or Brigo and Mercurio (2006)). This in particular implies\nQ{τ ∈ [t, t + dt)|τ ≥ t, Ft } = ht dt,\nwhere the stochastic process h is the intensity. This reads, if \"t=now\":\n\"probability that reference entity defaults in (small) \"dt\" years given that it has not\ndefaulted so far and given the default-free-market information so far is ht dt.\"\nIntensity is usually assumed to be at least a Ft -adapted and right continuous\n(and thus progressive) process and is denoted by ht , and the cumulated intensity\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n12\n\nRT\nor hazard process is the stochastic process T 7→ H(T ) = 0 ht dt. We assume\nht > 0. We recall that the requirement to be \"Ft -adapted\" means that given Ft ,\ni.e. the default-free market information up to time t, we know h from 0 to t. This\nintuitively says that the randomness we allow into the intensity is induced by the\ndefault free market. In a Cox process with stochastic intensity h, conditional on Ft\n(or just on Fth = σ({hs : s ≤ t}), i.e. just on the paths of h), we have a Poisson\nprocess structure with intensity ht . In particular, we have that the first jump time of\nthe process, transformed through its cumulated intensity, is an exponential random\nvariable independent of Ft :\nH(τ ) = ξ\nwith ξ standard (unit-mean) exponential random variable independent of Ft . Then\nwe have that default can be defined as\nτ := H −1 (ξ),\nthat provides us with suggestions on how to simulate the default time in this setting.\nNotice that in this setting not only ξ is random, but h itself is stochastic. This\nis why Cox processes are at times called \"doubly stochastic Poisson processes\".\nFor the survival probability in intensity models we have\n\u001b\n\u001a\nZ t\nh(u)du\nQ{τ ≥ t} = Q{H(τ ) ≥ H(t)} = Q ξ ≥\n0\n\n\u001b\u0015\n\u0014 R\n\u0015\n\u0014 \u001a\nZ t\nh\n− 0t h(u)du\n=E Q ξ≥\nh(u)du Ft\n=E e\n0\n\nwhich is completely analogous to the bond price formula in a short interest-rate\nmodel with interest rate h. This is the reason why the intensity can be seen also as\nan instantaneous credit spread. This is further illustrated by computing the price\nof a zero coupon defaultable bond in the intensity setting. The price at time t of a\nzero coupon defaultable bond with maturity T and zero recovery turns out to be\n\u0014 R\n\u0015\n− tT (ru +hu ) du\nE{D(t, T )1{τ >T } |Gt } = 1{τ >t} E e\n|Ft\n(2.8)\nwhere rt is the instantaneous\nR u (possibly stochastic) default-free interest rate at time\nt, so that D(t, u) = exp(− t rs ds).\nCox processes allow to borrow the stochastic interest-rates technology and paradigms\ninto default modeling, although ξ remains independent of all default free market\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n13\n\nquantities (of F, of h, of r...) and represents an external source of randomness that\nmakes reduced form models incomplete.\nIn this setting, the time varying nature of h may account for the term structure\nof credit spreads, while the stochasticity of h can be used to introduce credit spread\nvolatility. For example, in a diffusion setting, one has\ndht = b(t, ht )dt + σ(t, ht ) dWt\nfor suitable choices of the drift b and diffusion coefficient σ functions. b and σ\ncan be chosen so as to reproduce desired levels of credit spreads and credit spreads\nvolatilities.\nIntensity models have been introduced for example in the seminal work of Duffie\nand Singleton (1999). For tractable models and their calibration to the CDS term\nstructure also in relation with CDS option pricing see for example Brigo and Alfonsi\n(2005) and Brigo and El-Bachir (2008).\n\n2.3\n\nIntensity models for liquidity\n\nIn most of the models we will review in this paper liquidity enters the picture as\na further spread, or intensity. The idea is starting from a formula like (2.8) and\nadding a new rate term `t to discounting.\nIn other terms, the price of a Zero Coupon Bond changes from (2.8), where no\nliquidity component is included, to\n\u0014 R\n\u0015\n− tT (ru +hu +`u ) du\nE{D(t, T )L(t, T )1{τ >T } |Gt } = 1{τ >t} E e\n|Ft\n(2.9)\nRu\nwhere L(t, u) = exp(− t `s ds) is a stochastic discount factor component due to\nilliquidity, and ` is the instantaneous rate associated to this discount.\nWe can get a feeling for this use of the spread with the following example. As\nwe have seen before, for running CDS's, the market quotes at a point in time the\nvalue of S = S0,b such that\nCDS0,b (0, S0,b , LGD) = 0\nThis quote may come with a Bid and an Ask quote. Let us call them S Bid\nand S ask . The (positive) difference S ask − S Bid is called CDS BID-ASK spread, or\nsometimes more colloquially just \"CDS BID-ASK\".\nIt is known that if we assume ht to be deterministic and constant in time, and\nwe take the premium leg of the CDS paying continuously instead of quarterly, the\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n14\n\nequilibrium premium rate S balancing the two legs at a given time is linked to h by\nthe formula\nS0,b\nh=\n⇒ S0,b = hLGD\n(2.10)\nLGD\n(see for example Brigo and Mercurio (2006)). Now, since S has a bid and an ask\nquote, we can apply this formula to both. We obtain\nask\nbid\nhask = S0,b\n/LGD, hbid = S0,b\n/LGD.\n\nOne possible very rough first approach is to define the liquidity spread ` (in this\nframework deterministic and constant) as\n` :=\n\nhask − hbid\n.\n2\n\nIf we do that, and we define\nhmid :=\n\nbid\nask\nS0,b\n+ S0,b\nhbid + hask\n=\n2\n2LGD\n\nwe notice that by definition then\nhbid = hmid − `,\n\nhask = hmid + `,\n\nand using again formula (2.10),\nmid\nS0,b\n\nmid\n\n=h\n\nbid\nask\nS0,b\n+ S0,b\nLGD =\n2\n\nso that we have consistency with a meaningful definition of quoted MID S.\nAccording to this simple calculation, the true credit spread of a name is the MID,\nwhereas the range between BID and ASK is due to illiquidity. For a perfectly liquid\nname ` = 0 because the BID ASK spread is zero. For a very illiquid name, with a\nlarge bid ask spread, ` will be large. So strictly speaking ` would be an illiquidity\nspread, although it is called by abuse of language \"liquidity spread\". In this paper\nwhenever we mention \"liquidity spread\" we mean an illiquidity spread. This means\nthat if the spread increases liquidity decreases (illiquidity increases).\nThe above framework sees the MID CDS premium rate to be centered in the\nmiddle of the bid-ask range. However, it does not follow that also the NPV's of the\nCDS position has the MID centered between BID and ASK. This is illustrated in\nthe above simplified framework with continuous payments in the premium leg, flat\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n15\n\nhazard rates ht = h and constant deterministic interest rates r. In that case, the\nCDS default leg NPV corresponding to bid and ask becomes\nbid\nDLbid\n0,b = LGD h\n\nask\n(1 − exp(−(r + hbid )Tb ))\n)Tb ))\nask (1 − exp(−(r + h\nask\n=\nL\nGD h\n,\nDL\n0,b\nbid\nask\nr+h\nr+h\n\nand we can see that\nmid\n\nLGD h\n\nask\nDLbid\n(1 − exp(−(r + hmid )Tb ))\n0,b + DL0,b\n6=\nr + hmid\n2\n\nIf we approximate the exponential at the first order we get back symmetry, but\notherwise we do not observe that the NPV corresponding to the CDS MID quote\nis the mid-point between the NPV based on the CDS bid and ask quotes. More\ngenerally, when fitting also more sophisticated hazard rate processes to CDS bid\nand ask premium quotes we will suffer from the same problem. The MID feature of\nthe premium rates will not translate in MID NPV's. Despite this inconvenience, the\nidea is to use a process for ` in the instantaneous spread space to explain liquidity\nin the CDS prices. As a consequence, a formula similar to (2.9) is used to price the\nCDS under liquidity risk.\nFor example, Chen, Fabozzi and Sverdlove (2008) in the first stage of their\ninvestigation fit a constant hazard rate h to S ask and then calibrate the liquidity\nterm ` (to be subtracted from h when discounting) to reprice the CDS MID quotes.\nIn their view illiquidity always reduces the CDS premium and the CDS premium in\nthe real market is less than a hypothetically perfectly liquid CDS premium. Because\nthe latter is unobservable, they choose as benchmark the ASK CDS premium. The\nliquidity premium will be reflected in the difference between the transaction CDS\npremium (MID) and the ASK. In our example with flat hazard rates and continuous\npayments in the premium leg, this amounts to set\nhask :=\n\nS ask\nS ask\n, hmid + ` =: hask :=\n.\nLGD\nLGD\n\nThis also implicitly suggests that\nhbid :=\n\nS mid\n−`\nLGD\n\nso that again ` = (hask − hbid )/2.\nCFS also argue that the liquidity correction should affect only the default leg of\nthe CDS, since the premium leg is basically an annuity numeraire. This is not clear\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n16\n\nto us, since in a way also the premium leg is part of a traded asset subject to mark\nto market. And indeed, BT[06,08] make a different choice, and assume that the\nCDS liquidity discount appears in the payment/fix leg of the CDS and that there\nis a bond liquidity discount for the recovery part of the default leg. We will discuss\nthis more in detail below.\nHaving clarified the structure of the liquidity term with respect to the usual\nterms in CDS valuation with hazard rate/intensity models, we notice that the above\npicture considers the CDS bid and ask quotes to be perturbed by liquidity, so that\nCDS quotes do not express pure credit risk.\nOne may also think that the CDS expresses pure credit risk (see for example\nLongstaff, Mithal and Neis (2005)), but this is now considered to be unrealistic as\nillustrated in the papers discussed in this survey.\nMore generally, we will see that the model for both hazard rates and liquidity are\nstochastic. Typically, in the literature, under the risk neutral probability measure,\none assumes stochastic differential equations of diffusion type,\ndht = bh (t, ht )dt + σ h (t, ht )dWth , d`t = b` (t, `t )dt + σ ` (t, `t )dWt` ,\n\n(2.11)\n\nwhere the two processes are possibly correlated. In most works in the literature,\nthough, the two processes are unrealistically assumed to be independent. The advantage of assuming independence is that whenever we need to compute a formula\nsimilar to (2.9), its relevant component in credit and liquidity can be factored as\n\u0014 R\n\u0015\n\u0014 R\n\u0015 \u0014 R\n\u0015\n− tT (hu +`u ) du\n− tT hu du\n− tT `u du\nEt e\n= Et e\nEt e\n(2.12)\nand this can be computed in closed form whenever we choose processes for which\nthe bond price formulas are known. Also, in case where no liquidity premium is\npresent, the survival probability Q(τ > T ) appearing for example in Formula (2.7)\nis computed as\n\u0014\n\u0015\nQ(τ > T ) = E0 e−\n\nRT\n0\n\nhu du\n\n(2.13)\n\nand again this is known in closed form, so that CDS fair premium rate can be\ncomputed in closed form with the model.\nThe cases of affine or quadratic models are typical to have the above tractability.\nHowever, when we correlate h and `, the above decomposition no longer occurs and\nthe only case where calculations are still easy in the correlated case is when the\ntwo processes [ht , `t ] are jointly gaussian. This is not a viable assumption for us,\nhowever, since h needs to be positive, being a time-scaled probability.\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n17\n\nIn order to avoid numerical methods, most authors assume independence between\ncredit risk (ht ) and liquidity risk (`t ) in order to be able to apply formula (2.12) and\nthe likes.\nIt is worth highlighting at this point that this assumption is unrealistic, as we\nwill discuss further in Section 4. In particular, see Figure 2 below.\n\n2.4\n\nChen, Fabozzi and Sverdlove (2008) [CFS]\n\nIn this paper, the authors study liquidity and its impact on single name CDS prices\nfor corporations. From a first exam of the data they notice that the bid-ask spreads\nare very wide, especially for the high-yield corporate names in their study. While this\nis pre-crisis data, they noticed that the liquidity in the CDS market has improved\nin time, while still maintaining a larger bid-ask spread than typical bid-ask spreads\nin the equity market.\nAfter the preliminary analysis, the authors employ a two-factor Cox-IngersollRoss model for the liquidity and hazard rates and estimate their dynamics using\nMaximum Likelihood Estimation (MLE).\nIn the above formalism, this means they made two particular choices for the\nprocesses (2.11) to be of the type\np\np\ndht = [k h θh − (k h + mh )ht ]dt + ν h ht dWth , d`t = [k ` θ` − (k ` + m` )`t ]dt + ν ` `t dWt` ,\n(2.14)\nh h\nh\nh\n` `\n`\n`\nfor positive constants k , θ , ν , h0 , m and k , θ , ν , `0 , m . The two processes are\nassumed, somewhat unrealistically (see also the discussion in Section 4), to be independent.\nThe above is the dynamics under the risk neutral or pricing probability measure.\nThis is the dynamics that is used in valuation, to compute risk neutral expectations\nand prices. The dynamics under the physical measure related to historical estimation\nand MLE is\np\np\nfth , d`t = k ` (θ` − `t )dt + ν ` `t dW\nft` ,\n(2.15)\ndht = k h (θh − ht )dt + ν h ht dW\nf are brownian motions under the physical measure. In (2.15) the θ's\nwhere now W\nare mean reversion levels, the k are speed of mean reversion parameters, the ν are\ninstantaneous volatilities parameters. The m parameters are market prices of risk,\nparameterizing the change of measure from the physical probability measure to the\nrisk neutral one. See for example Brigo and Mercurio (2006). Brigo and Hanzon\n(1998) hint at the possible application of filtering algorithms and quasi-maximum\nlikelihood to a similar context for interest rate models.\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n18\n\nThe advantages of the CIR model are that the processes are non-negative, in\nthat ht ≥ 0 and `t ≥ 0 (and one has strict positivity with some restrictions on the\nparameters), and there is a closed form formula in terms of k h , θh , ν h , h0 , mh and\nk ` , θ` , ν ` , `0 , m` for\n\u0015\n\u0015 \u0014 R\n\u0015\n\u0014 R\n\u0014 R\n− 0T `u du\n− 0T hu du\n− 0T (hu +`u ) du\n(2.16)\nE0 e\n= E0 e\nE0 e\nand related quantities that are needed to compute the CDS prices. Indeed, through\nformula (2.7) combined with formula (2.13) that is known in closed form for CIR,\nwe have the CDS premium rate in closed form for our\nmodel.\nR\n− ts `u du\nAdding the liquidity discount term, L(t, s) = e\n, into to the CDS premium\nrate formula (2.3), we obtain\n\n∗\nSa,b\n(t) =\n\nEt [LGD 1{Ta <τ ≤Tb } L(t, τ )D(t, τ )]\nP\nEt [D(t, τ )(τ − Tβ(τ )−1 )1{Ta <τ <Tb } + bi=a+1 D(t, Ti )αi 1{τ ≥Ti } ]\n\n(2.17)\n\nNotice that we added the additional (il)liquidity discount term only in the numerator. This is the strategy followed by CFS, who argue that the annuity should\nnot be adjusted by liquidity. As observed above this is debatable, since even the premium leg of the CDS is part of a traded product, and indeed for example BT[06,08]\nfollow a different strategy.\nFormula (2.17) can be further explicited in terms of the processes r, h, ` via\niterated expectations with respect to the sigma field Ft . For the special case of\nt = Ta = 0 one obtains\nh\ni\nRT\nRu\nE0 LGD 0 b hu exp(− 0 (rs + hs + `s )ds)du\n∗\n(2.18)\nS0,b\n(0) =\nRT\nP\nAccrual0,b + bi=a+1 αi E0 [exp(− 0 i (rs + hs )ds)]\n\u0012 Z u\n\u0013\n\u0015\nZ Tb \u0014\nAccrual0,b =\nE0 hu exp −\n(rs + hs )ds (u − Tβ(u)−1 ) du.\n0\n\n0\n\nThis holds for general dynamics for r, h, `, not necessarily of square root type, and\ndoes not require independence assumptions.\nIn any case, if one sticks to (2.17), the CDS fair premium rate formula with\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n19\n\ndeterministic interest rates and hazard rates independent of liquidity spreads reads\nR Tb\n−L\nGD\nP (0, t) A(0, t) dt Q(τ ≥ t)\n∗\n0\n(2.19)\nS0,b\n(0) = R Tb\nP\n− 0 P (0, t)(t − Tβ(t)−1 )dt Q(τ ≥ t) + bi=1 P (0, Ti )αi Q(τ ≥ Ti )\nwhere\nR\n− 0T `s ds\nCIR\n` `\n`\nA(0, T ) = E0 [e\n]=P\n(0, T ; `0 , k , θ , ν , m` ), (2.20)\nQ(τ ≥ T ) = E0 [e−\n\nRT\n0\n\nhs ds\n\n] = P CIR (0, T ; h0 , k h , θh , ν h , mh ), (2.21)\n\nwhere P CIR is the bond price formula in a CIR model having ` or h respectively as\nshort rate. For example,\nP CIR (0, T ; h0 , k h , θh , ν h , mh ) = φ(T − 0) exp(−ψ(T − 0)h0 ),\n\u0014\n\u00152kh θh /(ν h )2\n√\n√\n2 z exp{(k h + mh + z)T /2}\n√\n√\n√\nφ(T ) =\n,\n2 z + (k h + mh + z)(exp{T z} − 1)\n√\n2(exp{T z} − 1)\n√\n√\n,\nψ(T ) = √\n2 z + (k h + mh + z)(exp{T z} − 1)\nz = (k h + mh )2 + 2(ν h )2 .\nNotice that we have all the terms in closed form to compute Formula (2.19)\nthanks to the CIR bond price formula and the independence assumption.\nThen (2.19) combined with (2.20) and (2.21) provides a formula for CDS premium rates with liquidity as a function of h0 , `0 , and the model parameters k h , θh , ν h , mh\nand k ` , θ` , ν ` , m` . Similarly, formula (2.3) coupled with (2.21) provided a formula for\nCDS premium rates without liquidity as a function of h0 and the model parameters\nk h , θh , ν h , mh .\nThese formulas can also be applied at a time t later than 0. Indeed, while taking\ncare of adjusting year fractions and intervals of integration, one applies the same\nformula at time t.\nLet us denote the at-the-money liquidity adjusted CDS rate, and the at-themoney CDS rate, at time t by\n∗\nSt,T\n(t; ht , `t ; k h , θh , ν h , mh ; k ` , θ` , ν ` , m` ), St,Tb +t (t; ht ; k h , θh , ν h , mh ),\nb +t\n\nrespectively.\nA maximum likelihood estimation would then be used ideally, trying to obtain the\n∗\ntransition density for St+∆t,T\n(t + ∆t; ht+∆t , `t+∆t ; k h , θh , ν h , mh ; k ` , θ` , ν ` , m` )\nb +t+∆t\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n20\n\n∗\ngiven St,T\n(t; ht , `t ; k h , θh , ν h , mh ; k ` , θ` , ν ` , m` ) from the non-central (independent)\nb +t\nchi-squared transition densities for ht+∆t given ht and `t+∆t given `t . One would then\nmaximize the likelihood over the sample period by using such transition densities\nas key tools, to obtain the estimated model parameters. Notice that this would\nbe possible only when h and ` are independent, since the joint distribution of two\ncorrelated CIR processes is not known in closed form.\nSimilarly, the transition density for St+∆t,Tb +t+∆t (t + ∆t; ht+∆t ; k h , θh , ν h , mh )\ngiven St,Tb +t (t; ht ; k h , θh , ν h , mh ) would be obtained from the chi-squared transition\ndensity for ht+∆t given ht .\nCFS adopt a Maximum Likelihood Estimation method based on the earlier work\nby Chen and Scott (1993). This maximum likelihood method allows CFS to compute:\n\n• The credit parameters k h , θh , ν h , h0 , mh from a time series of ask premium\nrates S0,b (0)\n• The liquidity parameters k ` , θ` , ν ` , `0 , m` from a time series of mid CDS pre∗\nmium rates S0,b\n(0).\nCFS find that the parameters of the hazard rate factor h are more sensitive to\ncredit ratings and those for the liquidity component ` are more sensitive to market\ncapitalization and number of quotes, two proxies for liquidity.\nCFS also refer to earlier studies where CDS premiums had been used as a pure\nmeasure of the price of credit risk. CFS argue, through a simulation analysis, that\nsmall errors in the CDS credit premium rate can lead to substantially larger errors\nin the corporate bond credit spread for the same reference entity. Empirically, they\nuse the CDS estimated hazard rate model above to reprice bonds, with (ht and `t )\nand without (just ht ) taking CDS liquidity into account.\nWhen using these hazard rates to calculate bond spreads, CFS find that incorporating the CDS liquidity factor results in improved estimates of the liquidity spreads\nfor the bonds in their sample.\nCFS thus argue that while CDS premiums can be used in the analysis of corporate\nbond spreads, one must be careful to take into account the presence of a liquidity\neffect in the CDS market.\nResults reported in the earlier literature before 2006 stated that bond credit\nspreads were substantially wider than CDS premiums. This has been contradicted\nby many observations during the crisis, but already CFS show that, since a small\nCDS liquidity premium can translate into a large liquidity discount in a bond's\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n21\n\nprice, mostly due to the principal repayment at final maturity, they can successfully\nreconcile CDS premiums and bond credit spreads by incorporating liquidity into\ntheir model. However, the relevance of this analysis for data in-crisis remains to be\nproven. Finally, it is worth noticing that in CFS work the (il)liquidity premium is\nearned by the CDS protection buyer. Indeed, adding a positive (il)liquidity discount\nrate to the model (and to the default leg only) lowers the fair CDS premium rate\nwith respect to the case with no illiquidity. This means that the protection buyer\nwill pay a lower premium for the same protection in a universe where illiquidity is\ntaken into account, i.e. the liquidity premium is earned by the protection buyer.\n\n2.5\n\nBuhler and Trapp (2006, 2008) [BT06, BT08]\n\nBT06 make a different choice, and assume that the CDS liquidity discount appears\nin the premium leg of the CDS and, furthermore, that there is a bond liquidity\ndiscount for the recovery part of the default leg. BT06 see liquidity as manifesting\nitself in the bond component of the default leg, that is involved in the recovery, as\none gets a recovery of the bond value ideally when the bond with face value equal to\nthe CDS notional is meant to be delivered upon default. Their approach may look\ndebatable as well, although it is further motivated as follows:\n\"A common solution to this problem both in empirical studies and theoretical\nmodels [...], is to assume that the CDS mid premium is perfectly liquid and thus identical to the transaction premium. We believe that this assumption, however, is not\nappropriate. From a theoretical point-of-view, the assumption suggests that transaction costs, here the bid-ask-spread, are equally divided between the protection\nbuyer and the protection seller. This fiction neglects the possibility of asymmetric\nmarket frictions which lead to asymmetric transaction costs. The empirical evidence\nthat CDS transaction premia tend to fluctuate around mid premia, see Buhler and\nTrapp (2005), adds weight to these theoretical concerns. In order to reconcile the\ntheoretical arbitrage considerations to a model of CDS illiquidity, we assume that\nthe mid CDS premium contains an illiquidity component.\"\nBT06 assume that all the bonds and the CDS for the same issuer have identical\ndefault intensity (ht ) but different liquidity intensities: `bt for all bonds of one issuer\nand `ct for that issuer CDS. They also assume independence between default free\nrates, default intensity and liquidity intensities. Using a similar notation as in the\nprevious sections for simplicity, although in their actual work BT06 use discrete\n\n\f22\n\nD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\ntime payments in the default leg, the model implied CDS premium rate is equal to\nRT\n− 0 (1 − R Ab (0, t)) P (0, t) dt Q(τ ≥ t)\nS0,b (0) = R T\nP\n− 0 P (0, t)Ac (0, t)(t − Tβ(t)−1 )dt Q(τ ≥ t) + bi=1 Ac (0, Ti )P (0, Ti )αi Q(τ ≥ Ti )\n(2.22)\nwhere\nAb (0, t) = E0 [Lb (0, t)], Lb (0, t) = e−\n\nRt\n0\n\n`bs ds\n\n, Ac (0, t) = E0 [Lc (0, t)], Lc (0, t) = e−\n\nRt\n0\n\n`cs ds\n\nare the liquidity discount factors for the bond and the CDS payment leg respectively.\nThe default intensity ht is assumed to follow a mean reverting square root process\nas in (2.14). Liquidity intensities are assumed to follow arithmetic Brownian motions\nwith constant drift and diffusion coefficients:\nj\n\nd`jt = μj dt + η j dWt` , j ∈ {b, c}.\n\n(2.23)\n\nNotation is self-evident. Notice that the (il)liquidity premium will be negative\nin some scenarios, due to the left tail of the Gaussian distribution for `. This is a\nmajor difference with CFS, where the illiquidity premium is always positive. These\nassumptions allow for analytical solutions for bonds and CDS premium rates and\nfor calibration to observed bond spreads and CDS premium rates.\nBT06 perform an empirical calibration of the model using bonds and CDS for\n10 telecommunications companies over the time period 2001-2005. They find that\nwhile the credit risk components in CDS and bond credit spreads are almost identical, the liquidity premia differ significantly. The illiquidity premium component of\nbond credit spreads is always positive and is positively correlated with the default\nrisk premium. In times of increased default risk bonds become less liquid. The CDS\nilliquidity premium can take positive or negative values, but is generally very small\nin absolute value. Contrary to the bonds case, CDS liquidity improves when default\nrisk increases. Thus their framework can explain both positive and negative values\nfor the CDS bond basis through variations in the CDS and bond liquidity. Given the\nvery small sample size in their study, it is not clear whether these results are representative of the whole market. Also, they too use only pre-crisis data. Finally, this\napproach suffers again from the independence assumption, that is rather unrealistic\n(see once more the discussion in Section 4).\nThe correlation issue is addressed in BT08, which extends the previous model in\nBT06 to a reduced form model incorporating now correlation between bond liquidity\nand CDS liquidity and between default and bond/CDS liquidity. Additionally, they\n\n.\n\n\f23\n\nD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\nassume different liquidity intensities associated with the ask (`c,ask\n) and bid CDS\nt\nc,bid\n(`t ).\nIn the BT08 model the stochastic default intensity (ht ) and the illiquidity intensi, `c,bid\n) are all driven by four independent latent factors Xt , Ytb , Ytc,ask , Ytc,bid\nties (`bt , `c,ask\nt\nt\nas follows\n\n \n\n\ndht\ndXt\n1\ngb\ngask\ngbid\nb\n d`bt   fb\n\n\n1\nωb,ask\nωb,bid \nt\n c,ask  = \n  dYc,ask\n\n(2.24)\n d`t\n  fask ωb,ask\n\n1\nωask,bid   dYt\nfbid ωb,bid ωask,bid\n1\nd`c,bid\ndYtc,bid\nt\nwhere Xt is\nb\nYt , Ytc,ask , Ytc,bid\n\nmodeled as a mean reverting square root process as in (2.14) and\nas arithmetic Brownian motions as in (2.23). Again, notation is\nself-evident. Note that in this model f and g shape the correlations between the\ndefault intensity and the liquidity intensities, while ω shape the liquidity spillover\neffects between bonds and CDS, which are assumed to be symmetric. Notice that\nthe system of equations in (2.24) does not guarantee Lc,ask (0, t) < Lc,bid (0, t), thus\nbid\nask\nnot excluding the case S0,b\n(0) > S0,b\n(0). However, in their empirical study, they\nfind that this never occurs.\nIt is further assumed that risk free interest rates are independent of the default\nand liquidity intensities.\nValuing bonds and CDS in the BT08 framework mainly involves the computation of the expectation of the risk free discount factor and the expectation of the\nproduct of the default and liquidity discount factors. The latter expectation is not\na product of expectations as before given the assumed dependence between default\nand liquidity, so that the analogous of Formula (2.16) cannot be applied.\nThe bid CDS premium rate formula becomes:\nR\nR\nR Tb\n− 0t `bs ds\n− 0t hs ds\nP\n(0,\nt)E\n[(1\n−\nRe\n)h\ne\n]dt\n0\nt\nbid\n,\n(2.25)\nS0,b\n(0) = Pb 0\nR Ti c,bid\nR Ti\n− 0 `s\nds e− 0 hs ds ] + Accrual\nP\n(0,\nT\n)α\nE\n[e\ni\ni 0\ni=1\nZ\nAccrual =\n\nTb\n\nP (0, t)(t − Tβ(t)−1 )E0 [e−\n\nRt\n0\n\nds\n`c,bid\ns\n\nht e−\n\nRt\n0\n\nhs ds\n\n]dt\n\n0\n\nThe ask CDS premium rate formula is similar with `c,ask\ninstead of `c,bid\n. Note\nt\nt\nc,ask\nthat the ask illiquidity discount rate `t\nappears in the payment leg and captures\nthe fact that part of the ask CDS premium rate may not be due to default risk but\nreflects an additional premium for illiquidity demanded by the protection seller. On\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n24\n\nthe other hand `c,bid\nwould capture the illiquidity premium demanded by the protect\ntion buyers. Different illiquidity ask and bid spreads reflect asymmetric transaction\ncosts which are driven by the general observed asymmetric market imbalances.\nThe assumed factor structure of the model and the independence between the\nlatent factors imply an affine term structure model with analytical formulae for both\nbonds and CDS. For example, expectations in (2.25) can be computed in closed form.\nData on bonds yields and CDS premium rates on 155 European firms for the\ntime period covering 2001 to 2007 is then used to estimate the model parameters.\nThe estimation procedure generates firm-level estimates for the parameters of the\nlatent variables processes, sensitivities of the different intensities to the latent factors\n(f 0 s, g 0 s, w0 s) and the values for the credit and liquidity intensities at each point in\ntime (ht , `bt , `c,ask\n, `c,bid\n).\nt\nt\nThe empirical estimation in BT08 implies several interesting findings. First,\ntheir results suggest that credit risk has an impact on both bond and CDS liquidity.\nAs credit risk increases, liquidity dries up for bonds and for the CDS ask premium\nrates (fb , fask are positive and significant). However the impact of increased credit\nrisk on CDS bid liquidity spreads is mixed across different companies, but on average higher credit risk results in lower CDS bid liquidity intensity (fbid is on average\nnegative and significant). Second, their results suggest that while the impact of\nbond or CDS liquidity on credit risk is negligible (gb , gask , gbid are not statistically\nsignificant), the spill-over effects between bond and CDS market liquidities are significant (wb,ask ,wask,bid are negative and significant, wb,bid is positive and significant).\nThey explain the signs of wb,ask ,wb,bid as a substitution effect between bonds and\nCDS: as bond liquidity dries up (bond illiquidity intensity `bt goes up), bond prices\ngo down and thus taking on credit risk using bonds becomes more attractive. If\na trader intends to be long credit risk by selling protection through CDS, she will\nneed to drop the ask price (CDS ask liquidity intensity `ask\ngoes down) compared to\nt\nthe case of high bond liquidity. At the same time lower bond prices in case of lower\nbond liquidity (higher `bt ) makes shorting credit risk via bonds more costly which\nthen drives bid quotes in the CDS market higher (higher `bid\nt ).\nAdditionally BT use the empirical parameter and intensity estimates to decompose the bond spreads and CDS premium rates into three separate components: the\npure credit risk premium, the pure liquidity risk premium and the rest, the creditliquidity correlation premium. In particular they estimate the pure CDS credit risk\npremium (sd) as the theoretical CDS premium rate implied by the model when\nask\nthe liquidity intensities `bid\nare switched off to zero. The pure CDS liquidity\nt , `t\npremium (sl) is subsequently computed as the difference between the average theoretical MID CDS premium rate for uncorrelated credit and liquidity intensities (f 0 s\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n25\n\nand g 0 s are zero) and the pure CDS credit risk premium sd. Finally the correlation\npremium is calculated as the difference between the observed market CDS premium\nrate and the sum of the pure credit and pure liquidity premiums.\nOn average BT08 find that, for CDS, the credit risk component accounts for 95%\nof the observed mid premium, liquidity accounts for 4% and correlation accounts\nfor 1%. They proceed in similar fashion for the bond spread decomposition and find\nthat overall 60% of the bond spread is due to credit risk, 35% is due to liquidity and\n5% to correlation between credit risk and liquidity.\nCross-sectionally all credit, illiquidity and correlation premia for bonds and CDS\nincrease monotonically as the credit rating worsens from AAA to B and then drop\nfor the CCC category. These findings are in contrast to the PTGLKR findings\ndiscussed in Section 4 and in Figure 2 in particular.\nBT08 also examine the time series dynamics of the different components. They\nfind that, while generally similar behavior can be observed for the credit risk premium for both investment grade (IG) and high yield (HY) firms, the same is not\ntrue for the liquidity premium. During a period with high credit spreads (20012002, around Enron and Worldcom defaults) the bond liquidity premium for IG is\nvery volatile and then flattens out at a higher level about mid 2003. On the other\nhand bond liquidity premium for HY firms reaches the highest level after Worldcom\ndefault and decreases to a lower level for the rest of the time period. In the CDS\nmarket the CDS liquidity premium for the IG firms is close to 0 for most of time,\nwhile for HY it is very volatile and becomes negative when credit risk is high. A\nnegative CDS liquidity premium is consistent with more bid-initiated transactions\nin the market.\nThe bond premium dynamics tend to comove over time with the credit risk\npremium dynamics. Interestingly the correlation premium is larger/smaller than\nthe liquidity premium when credit spreads are high/low. BT interpret this finding\nas being consistent with the flight to quality/liquidity hypothesis. In other words,\nin times of stress, investors will try to move away from assets whose liquidity would\ndecrease as credit risk increases and instead acquire liquid assets that can be easily\ntraded. High correlation between illiquidity and credit will thus command a high\nspread premium component.\nAll the empirical results with respect to the difference between IG and HY should,\nin our view, be considered carefully since their sample is highly biased towards\ninvestment grade firms. Also, as before, no data in-crisis has been used.\n\n\f26\n\nD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n3\n3.1\n\nLiquidity through the CAPM framework\nAcharya and Pedersen (2005) [AP]\n\nThere is a fourth work by Bongaerts, De Jong and Driessen (2009) [BDD] who use\nCAPM like arguments to quantify the impact of liquidity on CDS returns. They\nconstruct an asset-pricing model for CDS contracts inspired by the work of Acharya\nand Pedersen (2005) (AP) that allows for expected liquidity and liquidity risk. Since\ntheir approach is heavily based on AP, it is worth recalling AP's general result.\nAP start from the fundamental question: \"How does liquidity risk affect asset\nprices in equilibrium?\". This question is answered by proposing an equilibrium asset\npricing model with liquidity risk. Their model assumes a dynamic overlapping generations economy where risk averse agents trade securities (equities) whose liquidity\nchanges randomly over time. Agents are assumed to have constant absolute risk\naversion utility functions and live for just one period. They trade securities at times\nt and t+1 and derive utility from consumption at time t+1. They can buy a security\nat a price Pt but must sell at Pt − Ct thus incurring a liquidity cost. Liquidity risk\nin this model is born from the uncertainty about illiquidity costs Ct . Under further\nassumptions such as no short selling, AR(1) processes with i.i.d. normal innovations\nfor the dividends and illiquidity costs, AP derive the liquidity-adjusted conditional\nCAPM:\nEP [R ]\n| t {z t+1}\n\nRf\n|{z}\n\n=\n\nExpected Asset Gross Return\n\n+\n\nRisk F ree Rate\n\nEPt [ct+1 ]\n| {z }\n\nExpected Illiquidity Cost\n\n\u0001\n\u0001\nM\nCovt Rt+1 , Rt+1\nCovt ct+1 , cM\nt+1\n\u0001 +πt\n\u0001\n+\nπt\nM\nM\n|{z}\nV art Rt+1\nV art Rt+1\n− cM\n− cM\nt+1\nt+1\nRisk P remium |\n{z\n}\n|\n{z\n}\nβM kt,t\n\nβ2,t\n\n\u0001\n\n\u0001\nM\nCovt ct+1 , Rt+1\n\u0001\n−πt\nM\nV art Rt+1\n− cM\nt+1\n}\n|\n{z\n}\n\nCovt Rt+1 , cM\nt+1\n\u0001\n−πt\nM\nV art Rt+1 − cM\nt+1\n|\n\n{z\n\nβ3,t\n\nβ4,t\n\n\u0001\nM\nf\nwhere πt = EPt Rt+1\n− cM\nis the conditional market risk premium, with\nt+1 − R\nthe expectation taken under the physical measure. The remaining notation is selfevident.\nThe liquidity-adjusted conditional CAPM thus implies that the asset's required\nconditional excess return depends on its conditional expected illiquidity cost and\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n27\n\non the conditional covariance of the asset return and asset illiquidity cost with the\nmarket return and the market illiquidity cost. The systematic market and liquidity\nrisks are captured by four conditional betas. The first beta (βM kt,t ) is the traditional\nCAPM β that measures the co-variation of individual security's return with the\nmarket return. The second beta (β2,t ) measures the covariance between asset's\nilliquidity and the market illiquidity. The third beta (β3,t ) measures the covariance\nbetween asset's return and the market illiquidity. This term affects negatively the\nrequired return. Investors will accept a lower return on securities that have high\nreturn in times of high market illiquidity. The fourth beta (β4,t ) measures the\ncovariance between asset's illiquidity and the market return. The effect of this is\nalso negative. Investors will accept a lower return on securities that are liquid in\ntimes of market downturns.\nIn order to estimate the model empirically, the unconditional version of the\nmodel is derived under the assumption of constant conditional covariances between\nilliquidity and returns innovations. The unconditional liquidity adjusted CAPM can\nbe written as:\n\u0002\n\u0003\nEP Rt − Rf = EP [ct ] + πβM kt + πβ2 − πβ3 − πβ4\n(3.1)\nwhere π = EP [πt ] is the unconditional market risk premium.\nAP perform the empirical estimation of the model using daily return and volume\ndata on NYSE and AMEX stocks over the period 1962-1999. The illiquidity measure\nfor a stock is the monthly average of the daily absolute return to volume ratio\nproposed by Amihud (2002). Illiquid stocks will have higher ratios as a small volume\nwill have a high impact on price. The Amihud illiquidity measure ratio addresses\nonly one component of liquidity costs, namely the market impact of traded volume.\nOther components include broker fees, bid-ask spreads and search costs.\nUsing portfolios sorted along different dimensions, AP find that the liquidity\nadjusted CAPM performs better than the traditional CAPM in explaining crosssectional variations in returns, especially for the liquidity sorted portfolios. Liquidity risk and expected liquidity premiums are found to be economically significant.\nOn average the premium for expected liquidity, i.e. the empirical estimate for the\nunconditional expected illiquidity cost E(ct ), is equal to 3.5%. The liquidity risk\npremium, calculated as πβ2 − πβ3 − πβ4 , is estimated to be 1.1%. About 80% of\nthe liquidity risk premium is due to the third component πβ4 which is driven by the\ncovariation of individual illiquidity cost with the market return.\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n3.2\n\n28\n\nBongaerts, De Jong and Driessen (2009) [BDD]\n\nBDD extend the model proposed by AP to an asset pricing model for both assets\nin positive net supply (like equities) and derivatives in zero net supply. Differently\nfrom the AP framework where short selling is not allowed, in the BDD model some\nof the agents are exposed to non-traded risk factors and in equilibrium they hold\nshort positions in some assets to hedge these risk factors. Specifically there are two\ntypes of assets in the model: basic or non-hedge assets (e.g. equities) which agents\nhold long positions on in equilibrium and hedge assets which can be held long or\nshort by different agents in equilibrium. Hedge assets are sold short by some agents\nto hedge their exposures to non-traded risks. Examples of such risks are non-traded\nbank loans or illiquid corporate bonds held by some financial institutions such as\ncommercial banks. These institutions can hedge the risks with CDS contracts. Other\nagents such as hedge funds or insurance companies may not have such exposures\nand may sell CDS to commercial banks to earn the spread.\nThe BDD model implies that the equilibrium expected returns on the hedge assets can be decomposed in several components: priced exposure to the non-hedge\nasset returns, hedging demand effects, an expected illiquidity component, liquidity\nrisk premia and hedge transaction costs. Unlike the AP model where higher illiquidity leads to lower prices and higher expected returns, the impact of the liquidity\non expected returns in BDD model is more complex. The liquidity risk impact\ndepends on several factors such as heterogeneity in investors' non-traded risk exposure, risk aversion, horizon and agents wealth. Additionally BDD model implies\nthat, for assets in zero net supply like CDSs, sensitivity of individual liquidity to\nmarket liquidity (β2 ) is not priced.\nBDD perform an empirical test of the model on CDS portfolio returns over the\n2004-2008 period. The CDS sample captures 46% of the corporate bond market in\nterms of amount issued. The estimation procedure is a two-step procedure. In the\nfirst step, expected CDS returns, liquidity measures (proxied by the bid-ask spread),\nnon traded risk factor returns, non-hedge asset returns and different betas with respect to market returns and market liquidity are estimated. The non-hedge asset\nreturns are proxied by the S&P 500 Equity Index Returns. Such estimates represent\nthe explanatory variables of the asset pricing model, where the response variable is\nthe expected excess return on the hedge asset. In the second step, the generalized\nmethod of moments is used to estimate the coefficients of the different explanatory\nvariables in the model. Their results imply a statistically and economically significant expected liquidity premium priced in the expected CDS returns. On average\nthis is 0.175% per quarter and it is earned by the protection seller, contrary to CCW\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n29\n\nand CFS above. They also find that the liquidity risk premium is statistically significant, but economically very small, -0.005%. Somewhat questionably, the equity\nand credit risk premia together account for only 0.060% per quarter.\n\n4\n\nPredescu et al (2009) [PTGLKR] and Tang and\nYan (2007)\n\nPredescu et al (2009) have built a statistical model that associates an ordinal liquidity score with each CDS reference entity.3 This provides a comparison of relative\nliquidity of over 2,400 reference entities in the CDS market globally, mainly concentrated in North America, Europe, and Asia. The model estimation and the\nmodel generated liquidity scores are based upon the Fitch CDS Pricing Service\ndatabase, which includes single-name CDS quotes on over 3000 entities, corporates\nand sovereigns, across about two dozen broker-dealers back to 2000.\nThe liquidity score is built using well-known liquidity indicators like the bidask spread as well as other less accessible predictors of market liquidity such as\nnumber of active dealers quoting a reference entity, staleness of quotes of individual\ndealers and dispersion in mid-quotes across market dealers. The bid-ask spread is\nessentially an indicator of market breadth; the existence of orders on both sides of\nthe trading book typically corresponds to tighter bid-asks. The other measures are\nnovel measures of liquidity which appear to be significant model predictors for the\nOTC CDS market. Dispersion of mid quotes across dealers is a measure of price\nuncertainty about the actual CDS price. Less liquid names are generally associated\nwith more price uncertainty and thus large dispersion. The third liquidity measure\naggregates the number of active dealers and the individual dealers' quote staleness\ninto an (in)activity measure, which is meant to be a proxy for CDS market depth.\nIlliquidity increases if any of the liquidity predictors increases, keeping everything\nelse constant. Therefore liquid (less liquid) names are associated with smaller(larger)\nliquidity scores.\nThe liquidity scores add insight into the liquidity risk of the credit default swap\n(CDS) market including: understanding the difference between liquidity and credit\nrisk, how market liquidity changes over time, what happens to liquidity in times\nof stress, and what impact certain credit events have on the liquidity of individual\n3\nRegular commentaries on liquidity scores are available from www.fitchsolutions.com under\nPricing & Valuation Services.\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n30\n\nassets. For example it reveals a U-shape relation between liquidity and credit with\nnames in BB and B categories being the most liquid and names at the two ends of\ncredit quality (AAA and CCC/C) being less liquid. (See Figure 2.) The U-shape\nrelation between Liquidity and Credit is quite intuitive as one would expect a larger\norder imbalance between buy and sell orders for names with a very high or a very\nlow credit rating than for names with ratings in the middle range. In particular, it is\nreasonable to expect more buying pressure for CCC names and more selling pressure\nfor AAA names. Most of the trading will take place in the middle categories (BBB,\nBB, and B). The extent of the illiquidity at the two extremes also changes over time.\nThis is particularly more pronounced for C-rated entities, which were relatively less\nliquid in 2007.\nAdditionally Predescu et al (2009) find that the liquidity score distribution shifts\nsignificantly over the credit/liquidity crisis, having fatter tails (i.e. more names in\nthe very liquid and very illiquid groups) than before the crisis. The score allows for\nthe construction of liquidity indices at the aggregate market, region or sector levels\nand, therefore, is very useful for studying market trends in liquidity.\nThis study produces an operational measure of liquidity for each CDS reference\nentity name on a daily basis, and has been extensively validated against external\nindicators of liquidity.\nAfter the ordinal model by Predescu et al (2009), we go back to works that decompose CDS premium rates levels or changes into liquidity and credit components,\nand briefly hint at one such study: Tang and Yan (2007). They also include bid\nask information among other variables chosen as liquidity measures: volatility to\nvolume, number of contracts outstanding, trade to quote ratio and volume.\nThey separate liquidity from credit by including other credit control variables in\nthe regression. The liquidity variables are generally statistically significant, however\ntheir impact on premium rates differs.\nA more detailed review of Tan and Yang is available in Brigo, Predescu and\nCapponi (2010).\n\n5\n\nDiscussion, Conclusions and Further Research\n\nThis paper reviews different theoretical and empirical approaches for measuring the\nimpact of liquidity on CDS prices. We start by investigating a reduced form approach that incorporates liquidity as an additional discount yield. The different\nstudies (Chen, Fabozzi and Sverdlove (2008), Buhler and Trapp (2006, 2008)) that\nuse a reduced form model make different assumptions about how liquidity intensity\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n31\n\nFigure 2: Liquidity smile illustrating the correlation between credit quality and\nliquidity. The vertical axis displays the aggregated values of liquidity scores per\nrating class. The higher the score the less liquid the name is.\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n32\n\nenters the CDS premium rate formula, about the dynamics of liquidity intensity process and about the credit-liquidity correlation. Among these studies BT08 provides\nthe most general and a more realistic reduced form framework by incorporating correlation between liquidity and credit, liquidity spillover effects between bonds and\nCDS contracts and asymmetric liquidity effects on the Bid and Ask CDS premium\nrates. However the empirical testing of their model can be significantly improved by\nusing a larger, more representative sample over a longer time period including the\ncrisis.\nWe then discuss the Bongaerts, De Jong and Driessen (2009) study which derives\nan equilibrium asset pricing model with liquidity effects. They test the model using\nCDS data and find that both expected liquidity and liquidity risk have a statistically significant impact on expected CDS returns. However only compensation for\nexpected liquidity is economically significant with higher expected liquidity being\nassociated with higher expected returns for the protection sellers. This finding is\ncontrary to Chen, Cheng and Wu (2005, reviewed in Brigo, Predescu and Capponi,\n2010) and Chen, Fabozzi and Sverdlove (2008) that found protection buyers to earn\nthe liquidity premium.\nWe approach the end of our review with a discussion of Predescu et al (2009)\nwhich provides the only operational measure of CDS liquidity that is currently available in the market. They propose a statistical model that associates an ordinal\nliquidity score with each CDS reference entity and allows one to compare liquidity\nof over 2400 reference entities. After the ordinal model by Predescu et al (2009),\nwe briefly hint at the work by Tang and Yan (2007), that decomposes again CDS\npremiums into liquidity and credit components, also including bid ask information\namong other variables chosen as liquidity measures. This is reviewed more in detail\nin Brigo, Predescu and Capponi (2010).\nDespite their methodological differences, all these studies point to one common\nconclusion and that is that CDS premium rates should not be assumed to be only\npure measures of credit risk. CDS liquidity varies cross-sectionally and over time.\nMore importantly, CDS expected liquidity and liquidity risk premia are priced in\nCDS expected returns and premium rates. Nevertheless further research is needed\nto test and validate the CDS liquidity premiums and the separation between credit\nand liquidity premia at CDS contract level.\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n33\n\nReferences\n[1] Acerbi, C., and Scandolo, G. (2008). Liquidity risk theory and coherent measures of risk. Quantitative Finance 8(7), pp. 681–692.\n[2] Acharya, V.V., and Pedersen, L.H. (2005). Asset Pricing with Liquidity Risk.\nJournal of Financial Economics 77(2), pp. 375–410.\n[3] Amihud, Y. (2002). Illiquidity and Stock Returns: Cross-Section and TimeSeries Effects. Journal of Financial Markets 5, pp. 31–56.\n[4] Amihud, Y., Mendelson, H., and Pedersen, L.H. (2005). Illiquidity and Stock\nReturns: Liquidity and asset pricing. Foundation and Trends in Finance 1, pp.\n269–364.\n[5] Angelidis, T. and Benos, A. (2005). Liquidity adjusted Value-at-Risk based\non the components of the bid-ask spread. Working Paper, available at http:\n//ssrn.com/abstract=661281.\n[6] Bangia, A., Diebold, F.X., Schuermann, T. and Stroughair, J.D. (1999). Modeling Liquidity Risk With Implications for Traditional Market Risk Measurement\nand Management. Working paper, Financial Institutions Center at The Wharton School.\n[7] Beumee, J., Brigo, D., Schiemert, D., and Stoyle, G. (2009). Charting a Course\nthrough the CDS Big Bang. Fitch Solutions research report, available at http:\n//www.defaultrisk.com/pp_crdrv176.htm.\n[8] Bielecki, T., and Rutkowski, M. (2001). Credit Risk: Modelling, Valuation and\nHedging, Springer, New York, NY.\n[9] BIS (2008). Principles for Sound Liquidity Risk Management and Supervision.\nAvailable at http://www.bis.org/publ/bcbs144.htm.\n[10] Bongaerts, D., De Jong, F., and Driessen, J. (2009). Derivative Pricing with\nLiquidity Risk: Theory and Evidence from the Credit Default Swap market.\nForthcoming in Journal of Finance.\n[11] Brigo, D., and Alfonsi, A. (2005). Credit Default Swaps Calibration and Derivatives Pricing with the SSRD Stochastic Intensity Model. Finance and Stochastics 9(1), pp. 29–42.\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n34\n\n[12] Brigo, D., and Capponi, A. (2008). Bilateral counterparty risk valuation with\nstochastic dynamical models and application to Credit Default Swaps. Available\nat papers.ssrn.com/sol3/papers.cfm?abstract_id=1318024.\n[13] Brigo, D., and Chourdakis, K. (2009). Counterparty Risk for Credit Default\nSwaps: Impact of spread volatility and default correlation. International Journal of Theoretical and Applied Finance 12(7), pp. 1007–1026.\n[14] Brigo, D., and El-Bachir, N. (2008). An exact formula for default swaptions'\npricing in the SSRJD stochastic intensity model. Accepted for publication in\nMathematical Finance.\n[15] Brigo, D., and Hanzon, B. (1998). On some filtering problems arising in mathematical finance. Insurance: Mathematics and Economics 22(1), pp. 53–64.\n[16] Brigo, D., and Mercurio, F. (2001). A deterministic-shift extension of analytically tractable and time-homogeneous short rate models. Finance and Stochastics 5(3), pp. 369–388.\n[17] Brigo, D., and Mercurio, F. (2001). Interest Rate Models: Theory and Practice\n– with Smile, Inflation and Credit, Second Edition 2006, Springer Verlag.\n[18] Brigo, D., Presescu, M., and Capponi, A. (2010). Liquidity modeling for Credit\nDefault Swaps: an overview. To appear in: Bielecki, T., Brigo, D., and Patras,\nF. (Editors), Credit Risk Frontiers: The subprime crisis, Pricing and Hedging,\nCVA, MBS, Ratings and Liquidity, Bloomberg Press.\n[19] Brunnermeier, M., and Pedersen, L.H. (2007). Market Liquidity and Funding\nLiquidity. Review of Financial Studies 22(6), pp. 2201–2238.\n[20] Buhler, W., and Trapp, M. (2005). A Comparative Analysis of Liquidity in\nBonds and CDS markets. Working paper.\n[21] Buhler, W., and Trapp, M. (2006). Credit and liquidity risk in bond and CDS\nmarket. Working paper.\n[22] Buhler, W., and Trapp, M. (2008). Time-Varying Credit Risk and Liquidity\nPremia in Bond and CDS Markets. Working paper.\n[23] Cetin, U., Jarrow, R., and Protter, P. (2004). Liquidity risk and arbitrage pricing theory. Finance and Stochastics 8(3), pp. 311–341.\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n35\n\n[24] Cetin, U., Jarrow, R., Protter, P., and Warachka, M. (2005). Pricing Options\nin an extended Black-Scholes Economy with Illiquidity: Theory and Empirical\nEvidence. Review of Financial Studies 19(2), pp. 439–529.\n[25] Chen, R.R., Cheng, X., Fabozzi, F.J. , and Liu, B. (2008). An Explicit Multi\nFactor CDS pricing model with correlated factors. Journal of Financial and\nQuantitative Analysis 43(1), pp. 123–60.\n[26] Chen, R.R., Cheng, X., and Wu, L. (2005). Dynamic Interactions Between\nInterest Rate, Credit, and Liquidity Risks: Theory and Evidence from the\nTerm Structure of Credit Default Swaps. Working Paper, available at http:\n//papers.ssrn.com/sol3/papers.cfm?abstract_id=779445.\n[27] Chen, R.R, Fabozzi, F., and Sverdlove, R. (2008). Corporate CDS liquidity\nand its implications for corporate bond spreads. Working paper, available at\nhttp://business.rutgers.edu/files/cfs20080907.pdf.\n[28] Chen, R.R., and Scott, L. (1993). Maximum Likelihood Estimation of a MultiFactor Equilibrium Model of the Term Structure of Interest Rates. Journal of\nFixed Income 3(3), pp. 14–32.\n[29] Duffie, D., and Singleton, K. (1999). Modeling Term Structures of Defaultable\nBonds. Review of Financial Studies 12(4), pp. 197–226.\n[30] Earnst, C., Stange, S., and Kaserer, C. (2009). Accounting for Non-normality\nin Liquidity Risk. Available at http://ssrn.com/abstract=1316769.\n[31] FSA (2009). Strengthening liquidity standards. Available at http://www.fsa.\ngov.uk/pubs/policy/ps09_16.pdf.\n[32] Garleanu, N., Pedersen, L.H., and Poteshman, A.M. (2009). Demand-based\noption pricing. Review of Financial Studies 22(10), pp. 4259–4299.\n[33] Jarrow, R., and Protter, P. (2005). Liquidity Risk and Risk Measure Computation. Working Paper, Cornell University.\n[34] Jarrow, R., and Subramanian, A. (1997). Mopping up Liquidity. RISK 10(10),\npp. 170–173.\n[35] Johnson, T.C. (2008). Volume, liquidity, and liquidity risk. Journal of Finacial\nEconomics 87(2), pp. 388–417.\n\n\fD. Brigo, M. Predescu, A. Capponi. CDS Liquidity Modeling survey\n\n36\n\n[36] Leippold, M., and Wu, L. (2000). Quadratic term structure models. Working\npaper, available at http://papers.ssrn.com/sol3/papers.cfm?abstract_id=206329.\n[37] Longstaff, F.A., Mithal, S. and Neis, E. (2005). Corporate yield spreads: default\nrisk or liquidity? New evidence from the credit default swap market. Journal\nof Finance 60(5), pp. 2213–2253.\n[38] Morini, M. (2009). Solving the puzzle in the interest rate market. Working\npaper, available at http://papers.ssrn.com/sol3/papers.cfm?abstract_id=1506046.\n[39] O'Hara, M. (1995). Market Microstructure Theory, Blackwell Publishers, Cambridge.\n[40] Predescu, M., Thanawalla, R., Gupton, G., Liu, W., Kocagil, A., and\nReyngold, A. (2009). Measuring CDS Liquidity. Fitch Solutions presentation at the Bowles Symposium, Georgia State University, February 12 2009,\navailable at http://www.pfp.gsu.edu/bowles/Bowles2009/Liu-LiquidityMeasure_\nMethodlogyResults.pdf.\n[41] Stange, S., and Kaserer, C. (2008). Why and How to Integrate Liquidity Risk\ninto a VaR-Framework. CEFS working paper 2008 No. 10, available at http:\n//ssrn.com/abstract=1292289.\n[42] Szegö, G. (2009). The Crash Sonata in D Major. Journal of Risk Management\nin Financial Institutions, 3(1), pp. 31–45.\n[43] Tang, D.Y., and Yan, H. (2007). Liquidity and Credit Default Swap Spreads.\nWorking Paper, available at http://papers.ssrn.com/sol3/papers.cfm?abstract_\nid=891263&rec=1&srcabs=676420.\n\n\f"}