{"id": "http://arxiv.org/abs/0908.3963v1", "guidislink": true, "updated": "2009-08-27T09:41:08Z", "updated_parsed": [2009, 8, 27, 9, 41, 8, 3, 239, 0], "published": "2009-08-27T09:41:08Z", "published_parsed": [2009, 8, 27, 9, 41, 8, 3, 239, 0], "title": "Reciprocal and real space maps for EMCD experiments", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0908.4109%2C0908.1127%2C0908.1931%2C0908.1223%2C0908.2264%2C0908.1646%2C0908.4118%2C0908.0137%2C0908.4278%2C0908.2726%2C0908.4343%2C0908.4319%2C0908.1938%2C0908.3574%2C0908.1332%2C0908.1622%2C0908.2806%2C0908.0177%2C0908.4049%2C0908.2035%2C0908.1305%2C0908.0241%2C0908.4362%2C0908.0476%2C0908.2814%2C0908.0320%2C0908.2069%2C0908.4417%2C0908.2667%2C0908.0412%2C0908.0099%2C0908.3006%2C0908.3345%2C0908.2884%2C0908.2181%2C0908.0564%2C0908.1658%2C0908.3692%2C0908.3988%2C0908.2006%2C0908.1472%2C0908.2589%2C0908.3963%2C0908.0614%2C0908.1015%2C0908.3026%2C0908.1218%2C0908.3996%2C0908.1603%2C0908.1182%2C0908.2259%2C0908.3531%2C0908.4507%2C0908.0285%2C0908.0662%2C0908.2888%2C0908.2990%2C0908.0910%2C0908.2881%2C0908.4038%2C0908.0193%2C0908.1155%2C0908.2097%2C0908.2360%2C0908.0466%2C0908.1255%2C0908.0677%2C0908.3514%2C0908.1539%2C0908.3208%2C0908.1078%2C0908.3475%2C0908.3206%2C0908.2849%2C0908.2572%2C0908.1610%2C0908.0827%2C0908.1220%2C0908.4025%2C0908.1497%2C0908.1354%2C0908.1122%2C0908.3838%2C0908.1293%2C0908.3467%2C0908.1952%2C0908.2162%2C0908.0747%2C0908.2479%2C0908.3648%2C0908.3400%2C0908.0063%2C0908.0023%2C0908.2556%2C0908.3297%2C0908.3602%2C0908.3003%2C0908.2537%2C0908.1323%2C0908.1437%2C0908.2713&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Reciprocal and real space maps for EMCD experiments"}, "summary": "Electron magnetic chiral dichroism (EMCD) is an emerging tool for\nquantitative measurements of magnetic properties using the transmission\nelectron microscope (TEM), with the possibility of nanometer resolution. The\ngeometrical conditions, data treatment and electron gun settings are found to\ninfluence the EMCD signal. In this article, particular care is taken to obtain\na reliable quantitative measurement of the ratio of orbital to spin magnetic\nmoment using energy filtered diffraction patterns. For this purpose, we\ndescribe a method for data treatment, normalization and selection of mirror\naxis. The experimental results are supported by theoretical simulations based\non dynamical diffraction and density functional theory. Special settings of the\nelectron gun, so called telefocus mode, enable a higher intensity of the\nelectron beam, as well as a reduction of the influence from artifacts on the\nsignal. Using these settings, we demonstrate the principle of acquiring real\nspace maps of the EMCD signal. This enables advanced characterization of\nmagnetic materials with superior spatial resolution.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0908.4109%2C0908.1127%2C0908.1931%2C0908.1223%2C0908.2264%2C0908.1646%2C0908.4118%2C0908.0137%2C0908.4278%2C0908.2726%2C0908.4343%2C0908.4319%2C0908.1938%2C0908.3574%2C0908.1332%2C0908.1622%2C0908.2806%2C0908.0177%2C0908.4049%2C0908.2035%2C0908.1305%2C0908.0241%2C0908.4362%2C0908.0476%2C0908.2814%2C0908.0320%2C0908.2069%2C0908.4417%2C0908.2667%2C0908.0412%2C0908.0099%2C0908.3006%2C0908.3345%2C0908.2884%2C0908.2181%2C0908.0564%2C0908.1658%2C0908.3692%2C0908.3988%2C0908.2006%2C0908.1472%2C0908.2589%2C0908.3963%2C0908.0614%2C0908.1015%2C0908.3026%2C0908.1218%2C0908.3996%2C0908.1603%2C0908.1182%2C0908.2259%2C0908.3531%2C0908.4507%2C0908.0285%2C0908.0662%2C0908.2888%2C0908.2990%2C0908.0910%2C0908.2881%2C0908.4038%2C0908.0193%2C0908.1155%2C0908.2097%2C0908.2360%2C0908.0466%2C0908.1255%2C0908.0677%2C0908.3514%2C0908.1539%2C0908.3208%2C0908.1078%2C0908.3475%2C0908.3206%2C0908.2849%2C0908.2572%2C0908.1610%2C0908.0827%2C0908.1220%2C0908.4025%2C0908.1497%2C0908.1354%2C0908.1122%2C0908.3838%2C0908.1293%2C0908.3467%2C0908.1952%2C0908.2162%2C0908.0747%2C0908.2479%2C0908.3648%2C0908.3400%2C0908.0063%2C0908.0023%2C0908.2556%2C0908.3297%2C0908.3602%2C0908.3003%2C0908.2537%2C0908.1323%2C0908.1437%2C0908.2713&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Electron magnetic chiral dichroism (EMCD) is an emerging tool for\nquantitative measurements of magnetic properties using the transmission\nelectron microscope (TEM), with the possibility of nanometer resolution. The\ngeometrical conditions, data treatment and electron gun settings are found to\ninfluence the EMCD signal. In this article, particular care is taken to obtain\na reliable quantitative measurement of the ratio of orbital to spin magnetic\nmoment using energy filtered diffraction patterns. For this purpose, we\ndescribe a method for data treatment, normalization and selection of mirror\naxis. The experimental results are supported by theoretical simulations based\non dynamical diffraction and density functional theory. Special settings of the\nelectron gun, so called telefocus mode, enable a higher intensity of the\nelectron beam, as well as a reduction of the influence from artifacts on the\nsignal. Using these settings, we demonstrate the principle of acquiring real\nspace maps of the EMCD signal. This enables advanced characterization of\nmagnetic materials with superior spatial resolution."}, "authors": ["Hans Lidbaum", "Jan Rusz", "Stefano Rubino", "Andreas Liebig", "Bjorgvin Hjorvarsson", "Peter M. Oppeneer", "Olle Eriksson", "Klaus Leifer"], "author_detail": {"name": "Klaus Leifer"}, "author": "Klaus Leifer", "arxiv_comment": "26 pages, 8 figures", "links": [{"href": "http://arxiv.org/abs/0908.3963v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0908.3963v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0908.3963v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0908.3963v1", "journal_reference": null, "doi": null, "fulltext": "Reciprocal and real space maps for EMCD experiments\nHans Lidbauma , Ján Ruszb,c , Stefano Rubinoa , Andreas Liebigb,d , Björgvin Hjörvarssonb , Peter\nM. Oppeneerb , Olle Erikssonb , Klaus Leifera\na Department\n\nof Engineering Sciences, Uppsala University, Box 534, S-751 21 Uppsala, Sweden\nof Physics and Materials Science, Uppsala University, Box 530, S-751 21 Uppsala, Sweden\nc Institute of Physics, Academy of Sciences of the Czech Republic, Na Slovance 2, CZ-182 21 Prague, Czech Republic\nd Present address: Institute of Physics, Chemnitz University of Technology, D-09107 Chemnitz, Germany\n\narXiv:0908.3963v1 [cond-mat.mtrl-sci] 27 Aug 2009\n\nb Department\n\nAbstract\nElectron magnetic chiral dichroism (EMCD) is an emerging tool for quantitative measurements\nof magnetic properties using the transmission electron microscope (TEM), with the possibility of\nnanometer resolution. The geometrical conditions, data treatment and electron gun settings are\nfound to influence the EMCD signal. In this article, particular care is taken to obtain a reliable\nquantitative measurement of the ratio of orbital to spin magnetic moment using energy filtered\ndiffraction patterns. For this purpose, we describe a method for data treatment, normalization and\nselection of mirror axis. The experimental results are supported by theoretical simulations based\non dynamical diffraction and density functional theory. Special settings of the electron gun, so\ncalled telefocus mode, enable a higher intensity of the electron beam, as well as a reduction of\nthe influence from artifacts on the signal. Using these settings, we demonstrate the principle\nof acquiring real space maps of the EMCD signal. This enables advanced characterization of\nmagnetic materials with superior spatial resolution.\nKey words: EMCD, magnetic circular dichroism, electron energy-loss spectra, transmission\nelectron microscopy\n\n1. Introduction\nThe discovery of the electron magnetic chiral dichroism (EMCD) in the electron energy-loss\nspectra (EELS) [1, 2] demonstrated the feasibility of atom specific magnetic measurements with\nthe transmission electron microscope (TEM). EMCD probes the same electronic transitions as\n\nEmail address: klaus.leifer@angstrom.uu.se (Klaus Leifer)\nPreprint submitted to Elsevier\n\nNovember 23, 2018\n\n\fits older x-ray counterpart, x-ray magnetic circular dichroism (XMCD) [3] but with a theoretical spatial resolution one or two orders of magnitude better than XMCD. The dependence of\nthe EMCD signal on the specific scattering geometry means that, at best, only qualitative information could be obtained by experiments alone, such as relative changes of local atom specific\nmagnetization [4]. The development of a density functional theory (DFT) based simulation software [5] and the recent derivations of the sum rule expressions for EMCD [6, 7] provide a basis\nfor using the EMCD technique for quantitative measurements. The experimental geometry and\ncrystalline quality of the sample play a crucial role since the sample is used as a beam splitter\nto obtain the dichroic signal. Therefore, understanding the effect of even small deviations on the\nsignal is essential for the practical use of the EMCD technique.\nTo obtain a dichroic signal, two angle-resolved electron energy-loss spectra are acquired and\nsubtracted from each other, which is referred to as the EMCD signal. The two scattering angles,\ndescribed by scattering vectors k, are chosen to be symmetric around a mirror axis [1]. The\nsample is often oriented with respect to the incoming electron beam so that mainly two or three\nspots are visible in the diffraction plane, conventionally named two-beam case (2BC) and threebeam case (3BC) geometries, respectively. Theoretical considerations show that the 3BC is fully\nsymmetric and, according to the sum rules, preferable over the 2BC geometry for quantitative\nmeasurements [8]. However, very small deviations from the perfect 3BC geometry are found to\ninfluence the extracted dichroic signal [8].\nIn our recent publication, Ref. [9], we presented quantitative measurement of the orbital\nto spin magnetic moment ratio for a bcc Fe sample. Energy-resolved reciprocal space maps\nwere acquired in 3BC geometry, where we extracted the ratio of the orbital to spin magnetic\nmoment (mL /mS ) and compared with theoretical calculations. Here we build on the findings in\nRef. [9] and systematically evaluate the influence of the properties of the sample (Sec. 2), the\nexperimental set-up (Sec. 3), data treatment (Sec. 4) and considerations on the symmetry for the\n3BC geometry (Sec. 6.1). We also describe the special setting of the microscope which allow\nus to acquire real space maps of the EMCD signal (Sec. 3). Sec. 5 describes the theoretical\napproach applied in our ab initio simulations of the EMCD effect. Sec. 6.1 summarizes our\nfindings, comparing in detail the results from experiment and theory of the reciprocal space\nmaps. We analyze in particular the systematic errors of the observed mL /mS ratios caused by\ndeviation from the symmetric geometries, as required by the sum rules. The results of the real\n2\n\n\fspace maps are described in Sec. 6.2 and finally followed by the main conclusions in Sec. 7.\n2. Sample preparation\nAn 25 nm thick bcc Fe (001) layer was grown by UHV magnetron sputtering on a MgO (001)\nsubstrate, using a Fe/V superlattice as a buffer layer. After the substrate was outgassed at 780◦ C\nin UHV, the temperature was lowered to the deposition temperature of approximately 330◦ C.\nThe seed layer employed was a two step superlattice (4 x [0.91 nm V / 0.29 nm Fe] followed by\n4 x [0.45 nm V + 0.29 nm Fe]). As process gas Ar with a purity of 99.9999% at a pressure of\n0.8 Pa was used. Deposition rates for Fe and V were 0.052 nm/s and 0.032 nm/s, respectively.\nThe final Fe layer was protected with a 2 nm thick Al capping layer to prevent oxidation. To\nstudy the quality of the grown Fe layer, x-ray diffraction and reflectivity measurements were\nperformed using a Siemens D5000 diffractometer in Bragg-Brentano focusing geometry with Cu\nKα radiation (λ = 0.154 nm) and a secondary monochromator. Rocking curve measurements\non the Fe (002) peak revealed a texture angle, full width at half maximum (FWHM) of ∼ 0.67◦ ,\nreflecting the high quality of the sputtered thin layer. In the thin film community such high\nquality Fe sample is often referred to as monocrystalline. Though, for the EMCD measurements\nthis texture angle must be taken into account. The difference in electron diffraction of crystalline\nregions is seen as contrast changes in the Fe layer in Fig. 1, where a bright field TEM image of\nthe sample in cross section is shown.\nConventional sample preparation including dimple grinding and Ar-ion bombardment [10]\nfrom the substrate side in a Gatan Precision Ion Polishing System (PIPS) was used (4 kV, 2.5\nkV and finally at 1.3 kV) for the preparation of the top view TEM sample used in the EMCD\nmeasurements. Propylene glycol (water content < 0.1%) was used during the grinding processes\nas water based solvents often lead to cracks in MgO substrates (probably because of formation\nof magnesium hydroxide). The ion milling process was stopped when the size of the hole in the\nsample was slightly below 5 μm in diameter. At these conditions, we obtain a region of interest\nseveral micrometers wide, where the sample thickness and orientation change little as function of\nposition. A schematic of the sample is shown Fig. 1, together with its total thickness at different\npositions. A total handling time of about 10 minutes in air was required to transfer the sample\nfrom the vacuum chamber of the PIPS into the microscope.\n\n3\n\n\fFigure 1: A bright field TEM micrograph of the studied Fe sample shown in cross section. MgO substrate, Fe/V superlattice (to reduce misfit), the Fe layer studied by EMCD (approximately 25 nm) and Al capping as indicated (epoxy glue\nfrom TEM sample preparation at top). To enhance the contrast in the image, a gamma intensity transformation function\nwas used. A schematic picture of the sample in cross section is shown in the bottom part of the figure, indicating its total\nthickness. The EMCD experiments were here performed on a TEM sample prepared in top view geometry.\n\n4\n\n\f3. Choice of microscope settings for signal optimization\nThe microscope used in this article, and many of today's modern microscopes, use a Schottky\nemitter as electron source. These emitters typically show a feature called side-lobe emission [11]\nthat must be considered when measuring the weak signals related to EMCD. Its influence on the\nEMCD measurements is discussed in this section.\n3.1. Removal of side lobes using telefocus mode\nThe TEM experiments were performed using a FEI Tecnai F-30ST FEG (Schottky emitter)\noperated at 300 kV, equipped with a post-column spectrometer, Gatan image filter GIF2002.\nSide-lobe emission occurs when electrons are emitted from not only the tip of the Tungsten filament but also from the relatively large faces of the emitter crystal. The electrons are emitted\nfrom the faces with different angles and can therefore also hit other parts of the gun system, for\nexample the extractor anode plate. Thereafter they can be backscattered or cause emission of\nsecondary electrons [11, 12]. These electrons will be focused differently than electrons of the\nprimary beam and result in a non uniform intensity distribution, observable in the diffraction\nplane. Energy filtered diffraction (EFDIF) patterns without a sample in the electron beam reveals\nthe distribution of the electrons in reciprocal space as function of the energy-loss. The appearance of the pattern will depend on the settings of the electron gun, the shape of the filament and\nits position inside the microscope column, and also on the energy of the electrons. An EFDIF\npattern from the microscope used here is shown in Fig. 2a, acquired at 700 eV energy-loss with\na 20 eV wide energy selecting slit and no sample in the path of the electron beam. Typical standard gun lens settings were used, 4500 V extraction voltage and electrostatic gun lens value of\n2 which corresponds to 1000 V in gun lens voltage [12]. A non-symmetrical pattern is observed\nin Fig. 2a, which has an intensity of 40-50% of the transmitted beam intensity in regions where\nwe typically would measure the EMCD signal. This intensity should therefore be considered in\nEMCD measurements when using Schottky emitters, since it would superimpose onto the magnetic signal, and thereby distorting it. The effect of the side lobes has previously been considered\nwhen acquiring diffraction patterns from samples with a very large spacing (such as in biological\nspecimens [12]), resulting in a hampered visibility of the diffraction spots that are close to the\ntransmitted beam. It should be noted that the use of a small selected area diffraction aperture has\nbeen found to remove a significant part of the side lobe emission, although not completely [11].\n5\n\n\fFigure 2: (color online) a) Energy filtered diffraction pattern recorded at 700 eV energy-loss and 20 eV slit using standard\ngun settings, showing typical side lobe emission. Positions for the Fe G = (±200) diffraction spots, used in the EMCD\nexperiment of Fig. 5, are indicated with crossed circles. In b) the gun settings were changed to enter the so-called\ntelefocus mode where the side-lobe emission can be strongly reduced by using the condenser apertures. Both diffraction\npatterns were normalized by averaging the intensity at the position of the transmitted beam.\n\nThere are two ways of addressing this problem [12]: i) one can record reference EFDIF\npatterns (without sample, such as the one in Fig. 2a) with exactly the same energy range as used in\nthe EMCD experiment; the reference patterns are then subtracted from the EMCD data to remove\nthe side-lobe emission. Preferably ii) one can operate the microscope in the so-called telefocus\nmode where the side-lobe emission is strongly reduced. In telefocus mode the gun settings are\nchanged so that both condenser apertures can be used for removing the side lobes. For the Tecnai\nmicroscope used here the extraction voltage was increased to 4550 V in combination with setting\nthe electrostatic gun lens to 5 (corresponding to 500 V in gun lens voltage [12]), which changes\nthe position of the first cross over after the gun. At these settings the beam will go through\na cross over point which is close to the plane of the first condenser aperture. The side lobes\ncan successfully be removed by inserting a small first condenser aperture, while a small second\ncondenser aperture is used for probe forming. The corresponding reference EFDIF pattern is\nshown in Fig. 2b, revealing the efficient removal of the side lobes. Another consequence of using\nthe telefocus mode is that the intensity of the electron beam is strongly increased, which is useful\nfor the EMCD measurements as it can improve the signal to noise ratio (S/N). Unfortunately, this\nalso makes the alignment procedure more difficult; the intensity of the primary beam can not be\nchanged as normally 'on the fly' by changing spot size (strength of first condenser lens), because\nthe gun tilt settings have to be tuned for each spot size. The high intensity of the electron beam\nmakes it impossible to obtain a spectrum (not in EELS or EFDIF mode) of the zero-loss peak\nunless the sample is used to attenuate the electron beam (too high beam intensity can saturate\n6\n\n\fand possibly damage this type of CCD camera). This complicates the alignment procedure of the\nspectrometer. Here the GIF was aligned when in normal gun operation using its built-in software\nroutine, having an image at the viewing screen and no sample in the path of the beam. Thereafter\nthe gun settings were changed to enter telefocus mode and the automatic GIF alignment was\nrepeated, but now with a thick part of the sample introduced in the path of the beam to reduce\nthe intensity on the CCD camera. Typically during the second iteration of the alignment routine\nonly small changes were applied to the settings and the non-isochromatic surface of the GIF was\nrecorded separately (although still with the sample in the electron beam) to make sure that the\nalignment procedure was successful. Another side effect of using the telefocus mode is that the\nenergy spread of the primary electrons will be slightly increased due to the Coulomb interaction\nbetween the electrons in the beam (Boersch effect). This also causes an increase of the minimum\nprobe size due to the position of the cross-over [12].\n3.2. Real space maps of the EMCD signal in telefocus mode\nOne of the novelties promised by the EMCD technique is to obtain information about the\nmagnetic properties of a sample with excellent spatial resolution. An impressive start for high\nresolution mapping of the magnetic properties was already obtained by using Scanning TEM\n(STEM) techniques for EMCD [13]. The electron beam is focused to a nanometer-sized spot\nand is scanned over the sample; the electrons scattered at high angles are recorded by a dark\nfield detector to form an image, whereas the electrons scattered at low angles can be collected\nby the GIF to record the EMCD signal. In theory it is therefore possible to create a real space\nimage of the dichroic signal pixel by pixel. In practice, a much longer acquisition time (10-30\nseconds) is needed to collect a single EELS spectrum with reasonable S/N ratio, compared to the\nfew milliseconds usually needed for each pixel in a STEM image. This makes it very difficult\nto obtain real space maps with a scanning technique because of specimen drift. It is however\nfeasible to first acquire a normal STEM image and use it to select where to record two sets of\nEELS line scans; from those the EMCD signal can be obtained with high spatial resolution. This\nmethod has been used for obtaining an EMCD line scan with a spatial resolution of 2 nm [13].\nAn alternative approach is to use the energy filter with its energy selecting slit to record energy\nfiltered TEM images (EFTEM) from a large part of the sample at once. It has previously been\nsuggested and tested for EMCD but without success [2]; the intensity of the electron beam had\nbeen too low even for long acquisition times (several minutes). The variations of the dark count\n7\n\n\fof the CCD camera were greater than the eventual dichroic signal, so no meaningful data could\nbe obtained. However, real space maps now become possible due to the increased intensity of\nthe telefocus mode, as will be shown in Sec. 6.2.\n4. Acquisition conditions and data treatment of reciprocal and real space maps\nIn this section the experimental set-up and data treatment used for reciprocal and real space\nmaps is described in detail. The same procedure was used in Ref. [9] for analysing reciprocal\nspace maps.\n4.1. Reciprocal space maps\nThe top view sample preparation approach allowed us to choose a region on the sample with\nappropriate thickness, see Fig. 1. By collecting an electron energy-loss spectrum where a V\nsignal starts to appear (Fe layer thickness 25 nm), it is possible to experimentally calibrate the\ntotal mean free path of the inelastically scattered electrons [14]. The calibration is used to obtain\nthe absolute thickness of the probed area using thickness maps. The sample was analyzed at\nplaces where the electrons transit only through the pure Fe layer (with Al-capping), at a thickness\nof tT EM = 19 ± 2 nm. Images of the illumination spot on the sample were acquired before and\nafter the series to verify that the sample did not drift during acquisition and to determine the\nsize of the illuminated region. A relatively large beam size was chosen (approximately 600 nm),\naveraging over many slightly misoriented grains. Series of EFDIF patterns were acquired over\nthe Fe L2,3 edges from 750 eV to 670 eV using a slit width of 2 eV and a step size of 1 eV.\nAn exposure time of 5 seconds per diffraction pattern (hardware binning of 2) with a 3.0 mm\nspectrometer entrance aperture was used. A total acquisition time of approximately 20 minutes\nwas required. The sample was tilted approximately 10◦ from the high symmetry [001] orientation\nin order to reach the 3BC geometry.\nThree-dimensional data sets, so called data cubes [15], are constructed from the acquired\nEFDIF patterns and represent the fast electron beam intensity as function of energy-loss and scattering vector: I(k x , ky , E). The experimental data cubes consist of the (k x , ky ) diffraction planes\nstacked according to the energy-loss of the fast electrons, which represents the third dimension.\nEELS spectra can easily be extracted from a data cube by selecting the same pixel or group of\npixels in each EFDIF plane and plotting the beam intensity for those pixels as function of the\n8\n\n\fenergy-loss. The resulting spectrum is analogous to what would have been recorded in spectroscopy mode by placing a properly shaped aperture at that particular scattering vector (k x , ky )\nand using an energy dispersion of 1 eV/channel. The advantage is that the (virtual) aperture size,\nshape and positions can be optimized a posteriori.\nTo analyze the EMCD signal, the data cube was treated in the following way: a point blemish\nfunction removes bright spots arising from spurious radiation; small shifts between the patterns\nare corrected with sub-pixel precision by cross-correlation [16]; the diffraction patterns are rebinned to 256 x 256 pixels; then, the background under the Fe edge is subtracted by extrapolating\nfrom a fit by a power-law model [14] to the intensity in the pre-edge region. The point blemish\nremoval was performed by calculating the mean value and standard deviation of the surroundings\nof every pixel. If the value of a pixel differed from the mean more than a pre-defined multiple\nof the standard deviation (typical values were from 50 to 100; decided by inspection of the raw\ndata), the pixel was replaced by the mean value. In normal EFTEM series, cross-correlation is\nneeded to compensate for the sample drift during acquisition. In the case of EFDIF series, sample\ndrift does not cause a drift of the diffraction pattern. However, as the primary electron energy is\nslowly changed to perform the EFDIF series, the software automatically changes the microscope\nsettings to keep the illumination stable by adjusting to the change in accelerating voltage. Small\nfluctuation in the beam, lenses or software compensation may lead to a drift of the diffraction\npattern. The cross-correlation routine is therefore applied by selecting only the transmitted beam\nto align all EFDIF patterns (typically shifts of less than three pixels within a cube).\nDue to the tilt of the sample from a high symmetry orientation and by uneven scattering\nfrom, e.g., the cap layer, the background intensity may vary throughout the (k x , ky ) plane. It is\ntherefore also important to normalize the data cube post-edge to obtain a correct EMCD signal\nand consequently a correct mL /mS ratio. Here, the data cube was normalized by extracting three\ndiffraction patterns in the smooth post-edge region. An average normalization image was calculated and thereafter all diffraction patterns in this data cube were divided by it. The spectra in\neach pixel of the (k x , ky ) plane were then fitted using the Fe L edge model described in Ref. [17].\nTo model the L2,3 peaks a sum of Gaussian/ Lorentzian functions, equal for both peaks and with\nan asymmetry factor [18] was used. For the continuum transition background two arctangent\nstep functions were used, having their respective inflection point at the same position in energy\nas the L2,3 peak and with an intensity ratio of 1:2 [17]. The steepness of the arctangent function\n9\n\n\fwas assumed to be the same at both edges and treated as a fit parameter. The intensity of the\nresulting peak fitted curve is therefore given by\nI f it (E) =\n\nX\n2,3\n\n\n\n−1\n\"\n\"\n#2 \n#2 \n\n\n\n\n\n\n\n\nE − E2,3\nE − E2,3\n\n\n\n\n−\nln(2)\n+\nh\n(1\n−\nA)exp\n1\n+\n\u0001\n\u0001\n(h2,3 A \n\n\n\n2,3\n\n\n\n\n\n\nβ + α E − E2,3 \nβ + α E − E2,3 \n|\n{z\n} |\n{z\n}\nLorenzian\n\nGaussian\n\n(\n+ B2,3\n|\n\n\"\n#)\nE − E2,3\n1 1\n+ arctan\n)\n2 π\nγ/2\n{z\n}\n\ncore−to−continuum background\n\nwhere h2,3 and E2,3 are the amplitude and position in energy of the L2,3 peaks, respectively.\nThe Lorentzian-Gaussian mixing ratio (A), asymmetry (α) and the width (2β FWHM) are assumed to be the same for the L2,3 peaks. For the background, B2,3 describes its amplitude while\nγ the steepness of the arctan function. Thus, a total of nine fitting parameters were used here.\nSince the spectra are fitted independently, each fitting parameter is a function of (k x , ky ) that can\nbe illustrated by a reciprocal space map.\nThe experimental dichroic maps are obtained by using the integrated intensity under the fitted\nL2,3 edges and an appropriate mirror axis. This approach considers the entire signal strength in\nthe L2,3 edges, it removes the arbitrariness of the energy interval selection [7] for separating the L2\nand L3 components and also reduces the influence of peak shifts (due to the non-isochromaticity\nof the energy filter) on the EMCD signal. The resulting diffraction patterns from the peak fitting\nof the L2,3 areas were rotated in order to apply a mirror axis for the extraction of the EMCD signal.\nThe angle of rotation was obtained by first adding all diffraction patterns in the cross correlated\ndata cube (typically 80), finding the center of the diffracted spots in this resulting pattern and\nfrom there determine the rotation angle. It should be noted that the EMCD signal itself might\nslightly move the Bragg spots perpendicularly to the systematic row. Our calculations have\nshown that in this experimental set-up, the positions of the diffracted spots are found to move\nless than 0.01G200 for sample thicknesses above 20 nm. Only for specimen thicknesses below 10\nnm the spots move at most 0.02G200 , therefore neglected here.\nIt should be noted that the mL /mS ratio for a sample is a material property, independent of\ndiffraction geometry. Nevertheless, in experimental setups the assumptions of sum rules about\nsymmetrical detector positions [6, 7] are often not exactly fulfilled, either due to inherent asymmetry of 2BC [19] or due to misalignments in orienting the sample to 3BC geometry. Therefore\nthe value of the mL /mS ratio extracted by direct application of the sum rules can deviate from the\n10\n\n(1)\n\n\fvalue of the material property, and can also vary throughout the diffraction plane. To keep this\ndistinction - material property vs. value obtained by sum rules - in the further text we refer to\nthe latter as apparent mL /mS ratio. First principles simulations provide information, how much\nthe apparent mL /mS ratio differs from the material property (see Sec. 5.3). By using reciprocal\nspace maps we are able to evaluate how the apparent mL /mS ratio varies due to asymmetry and\nnoise with (k x , ky ). The mL /mS ratio can, according to the sum rules [6, 7], be calculated from:\nR\nR\nmL\n2 L3 ∆I(E)dE + L2 ∆I(E)dE\nR\n= R\n(2)\nmS\n3\n∆I(E)dE − 2 ∆I(E)dE\nL3\n\nL2\n\nwhere ∆I(E) is the difference between the EELS-spectra extracted at the two specific detector\npositions with opposite magnetic contribution as defined by the selected mirror axis. A map of\nthe apparent mL /mS ratio is thus obtained by applying Eq. 2 to the peak fitted data cube. The\nreciprocal space maps allow for optimization of the position, shape and size of the extraction\nregion in reciprocal space for obtaining reliable mL /mS ratio values, since every pixel of the\nmap acts as an individual measurement. Therefore, the S/N ratio can be optimized by selecting\nregions in the apparent mL /mS ratio maps where the EMCD signal is found to be strongest.\nThe histogram of these mL /mS ratios for a specific size of the window in reciprocal space was\nfitted using a Gaussian function. The size of the bins used in the histogram was optimized to\nbest reflect the distribution of mL /mS data according to Ref. [20]; revealing a typical bin size\nof approximately 0.1. Although, if the bin size is slightly changed, the resulting mL /mS ratio\ndoes not show a significant change (less than the given uncertainty ±0.01). The method of peak\nfitting the histogram was chosen in order to reduce the influence of outliers and thereby get a\nmore reliable quantification of the maps, compared to, e.g., the mean value. The center of the\nGaussian has a fit error of only ±0.001 in mL /mS .\nIt should be noted that this error estimation considers the extraction of values from the obtained mL /mS map. However, additional errors are present in the peak fitting process, which\nis more difficult to assess. More fit parameters do not necessary lead to a more accurate fit,\nwherefore assumptions and simplifications were applied as described above. When having poor\nenergy resolution (here 1-2 eV) there is a tangible risk of introducing fitting artefacts as a result of too few data points. Particularly, the mL /mS ratio appears to be most sensitive to the\ndescription of the double-step background. Various types of functions for the continuum transition background are used in XMCD such as arctangent, error function, Voigt or even linear.\n11\n\n\fThe origin of the double step background is however questioned, since it does not show with\nthe same strength in calculations, but it is often described to originate from 2p to 4s transitions.\nThus, currently no model exists, neither for EMCD nor XMCD, to accurately predict it. Further\nstudies are therefore needed in order to understand its influence on both techniques. However, as\ndichroic measurements rely on the difference between spectra, the influence of the background\nis therefore reduced.\n4.2. Real space maps\nAs indicated in Sec. 3, the strongly increased intensity of the electron beam in telefocus mode\nallows for real space maps of the EMCD signal. A region of the sample was oriented in a 3BC\ngeometry, exciting G = (±200) reflections in Fe. To have good control over the orientation of\nthe sample, single EFDIF patterns and dark field (DF) images were acquired both before and\nafter the experiment using a 5 eV slit at 710 eV. A 5.5 mrad (semi-angle) objective aperture was\ninserted and placed in one of the two Thales circle positions, to obtain a chiral DF illumination\n[2]. EFTEM images over the Fe L2,3 edges were acquired using a slit of 2 eV and step size of 1\neV (hardware binning of 4, 25 s exposure time per image), producing a first data cube consisting\nof the image plane and the energy-loss of the fast electrons: I(x, y, E). The objective aperture\nwas then shifted to the second Thales circle position to obtain the spectra with opposite magnetic\ncontribution, by acquiring a second data cube of EFTEM images. A total acquisition time of\napproximately 40 minutes were required per data cube.\nThe two data cubes were treated in a similar way as for the EFDIF patterns, for details see\nSec. 4.1. First a point blemish function was used to remove noisy spots from spurious radiation.\nThe images were cross correlated [16] by selecting a characteristic feature on the sample that was\nvisible throughout both cubes. Since the EMCD signal will be obtained by taking the difference\nbetween the two data cubes, any drift between them must also be removed. To do this, all\nimages in each individually cross correlated data cube were added together (typically 80 images\neach) and the two resulting images were cross correlated; the resulting drift correction was then\napplied to the data cubes. Then, the pre-edge background was fitted and subtracted under the Fe\nL2,3 edges, followed by normalized in the post-edge region and finally peak fitted in the same\nway as for the EFDIF patterns. The EMCD signal was as for the reciprocal space data obtained\nby subtracting the areas of the peak fitted Fe L2,3 peaks.\n12\n\n\f5. Theory and simulations\nThe dynamical diffraction effects influence the reciprocal space distribution of the magnetic\nsignal in a non-trivial way. Since the S/N ratio in EMCD experiments is generally relatively\nlow, theoretical input about optimizing the experimental geometry is essential. In this section\nwe describe the method of calculations of the reciprocal space maps of the dichroic signal and\ninfluence of deviations from symmetrical scattering conditions on the apparent mL /mS ratio.\n5.1. Propagation of fast electrons through the crystalline sample\nThe propagation of the incoming fast electrons is solved by dynamical diffraction theory\napplying the Bloch waves approach. Sample thickness, relative orientation of the incoming beam\nand detector positions are taken into account. Our simulations also include Debye-Waller factors\nat room temperature [21]. For the solution of the incoming/outgoing beam eigenvalue problems\nwe use a basis consisting of approximately 700 plane wave components. From the obtained sets\nof Bloch waves, products of Bloch coefficients are calculated and sorted in descending order.\nTaking the largest product as unit U0 , a cut-off parameter P is chosen so that products P times\nsmaller than U0 are neglected [8]. In these calculations P was set to 10−4 , which guarantees the\naccuracy of calculations at the level of about 0.1%.\nDynamical diffraction effects determine the distribution of the dichroic signal throughout the\ndiffraction plane and its thickness dependence. The energy dependence is then determined by\nthe matrix elements of inelastic transitions (described in Sec. 5.2). The strength of the measured\ndichroic signal depends on all those parameters: sample thickness, composition and orientation\nas well as the energy of the fast electrons [8]. In Fig. 3 the strength of the dichroic signal,\nextracted in the vicinity of the Thales circle as a function of sample thickness, is shown. Exciting\nthe bcc Fe G = ±(200) reflections instead of the G = ±(110) reflections leads to a more uniform\ndichroic signal (for 300 keV primary beam energy) up to a sample thickness of approximately\n30 nm instead of 15 nm, respectively. That was the main motivation for the choice of the (200)\nsystematic row in our experiments.\nIn order to reproduce the experimental conditions a sample thickness of 19 nm was chosen\nand to simulate the texture of the sample (the slight misorientations of the crystalline grains),\nthe following procedure was applied (see Fig. 4). Small crystallites denoted L (left), M (middle)\nand R (right) are slightly misoriented, as shown in left part of Fig. 4. The parallel illumination\n13\n\n\fFigure 3: (color online) Upper panels: distribution of the relative dichroic signal (divided by their sum) in the diffraction\nplane for a perfect 3BC in both G = (110) and (200) sample orientations (thicknesses as indicated) for the Fe L3 edge,\nusing a vertical mirror axis. Lower panels: thickness dependence at selected points (note the symbol shapes) of the\nrelative dichroic signal, defined as the difference of the integrated L3 edges divided by their sum.\n\nthen leads to a 3BC for M, but the diffraction conditions for L and R are tilted towards 2BC's\nof opposite sense, reflected by the size of the arrow-heads of diffracted beams. The lens in the\nmicroscope would focus all these contributions into sharp spots, thereby combining all diffraction\npatterns of individual crystallites (L/M/R). This situation can be equivalently described by a nonparallel electron beam diffracting on an ideal monocrystal (right side of Fig. 4). To align all\ncrystallites we need to rotate them, but that needs to be done together with rotation of the partial\nbeams illuminating them. Thus the illumination of the monocrystal is not anymore parallel. We\ncalculate individual diffraction patterns for all incoming beam directions and those lead to the\nsame individual diffraction patterns as before. However, they are now shifted with respect to each\nother - that is, what normally leads to diffraction disks in convergent electron beam diffraction.\nTo complete the analogy of the crystal with texture, we need to eliminate those shifts, i.e., to\nmake diffraction spots from L, M and R grains overlap again.\nTo summarize, we describe diffraction of a parallel beam on a sample with a texture angle as\ndiffraction of a non-parallel beam (with the same convergence angle) on a monocrystal, together\nwith a shift of the spots to keep a sharp diffraction pattern. Here we average over 48 incoming\nbeam directions evenly distributed within the illumination cone. Finally, theoretical maps were\nsmeared by convolution with a Gaussian with FWHM of 0.2G200 (estimated from the width of\n14\n\n\fFigure 4: (color online) Scheme of the diffraction on a sample with a texture under parallel illumination conditions (left)\nand its analogy with a non-parallel beam diffraction on a monocrystal (right). The size of the arrow-heads reflect the\nstrengths of the diffracted beams. See text for details.\n\nthe transmitted beam in experiment vs. simulation) in order to take into account e.g. aberrations\nof the spectrometer and point spread of the CCD camera.\n5.2. Description of the inelastic events\nTo describe the inelastic events, knowledge of the initial and final electronic state of an excited atom embedded in a crystalline environment is necessary. This knowledge is obtained\nhere from density functional theory within the local spin density approximation. Relativistic\neffects are taken into account within the second variational step method setting the magnetization direction to [016] in order to simulate the 10◦ tilt from the high symmetry orientation.\nThe WIEN2k full- potential linearized augmented plane-waves method for the solution of the\nKohn-Sham equations was used [22]. More than 100 basis functions per atom and integration\nover 40000 k-points in the full Brillouin zone ensure a well converged electronic structure. The\nexperimental lattice constant of bulk bcc Fe, a = 0.2861 nm, was adopted. To reduce the computational demands we limited the energy integration range to 1 eV, covering the range where\nthe magnetic signal is found to be strongest. Within this energy range the obtained mL /mS ratio\nequals to 0.045, while the ground state value from DFT calculation is 0.021. Details about the\nformalism and implementation of both dynamical diffraction theory and inelastic event matrix\n15\n\n\felements can be found in Ref. [5].\n5.3. The sum rules and evaluation of mL /mS ratio\nIn XMCD the well-known sum rules [23, 24] are used to extract spin and orbital moments\nfrom observed spectra. These expressions are fundamental for the quantitative analysis of XMCD\nmeasurements. For EMCD the sum rules were derived only recently [6, 7], assuming a set of\napproximations similar to x-ray absorption sum rules, such as taking into account only dipole\ntransitions. In the case of L2,3 edges of Fe the sum rules consider transitions from 2p to 3d states\nonly. In a manner different from XMCD sum rules, the dipole approximation is replaced by the\nso-called λ = 1 approximation, which is more accurate for large momentum transfer vectors.\nThis approximation is based on the Rayleigh expansion of the Coulomb interaction term (rather\nthan Taylor expansion) and λ = 1 denotes the cut-off of this expansion, see Ref. [5]. In sum rules,\nradial wave functions of 2p1/2 and 2p3/2 core states are assumed to be the same. Comparing full\ncalculations to calculations with equal core radial wave functions shows that the actual difference\nbetween these wave functions reduces the simulated mL /mS ratio approximately by 0.01. There\nis a set of other approximations in the sum rules, detailed in Ref. [25]. The effect of a fully\nrelativistic evaluation of inelastic transition matrix elements is expected to be small for Fe. The\nexchange splitting of core states in the first order leads to only small shifts of | j jz i core levels\nand as such it does not influence energy integrated quantities. The energy dependence of final\n3d states is taken into account in our simulations but it is neglected in the derivation of the sum\nrules.\nThe derivation of the EMCD sum rules is based on the assumption that we take a difference of\ntwo spectra measured at symmetrical conditions, which lead to the same set of Bloch waves and\nBloch coefficients [6]. Under this assumption, the observed spectral differences arise only from\nthe component of the magnetic moment parallel to the beam. As discussed in detail elsewhere\n[8, 19], if this is not accurately fulfilled (for example, if the compared spectra have slightly\ndifferent dynamical diffraction conditions), the value obtained by application of the sum rules\nexpression contains a systematic error. The apparent mL /mS ratio calculated from experimental\nspectra may substantially differ from the real one if the acquisition geometry is not perfectly\nsymmetric. The studies mentioned above indicate that the 2BC provides good accuracy when\nmeasuring inside or close to the Thales circle. The 3BC provides the advantage of two mirror\naxes, which can be used to form double-difference maps [9]. This procedure can efficiently\n16\n\n\fminimize the error due to deviation from exact 3BC orientation.\n6. Results and discussion\n6.1. Reciprocal space maps\nThe 2BC and 3BC geometries both enable quantitative analysis in EMCD experiments. As\npreviously mentioned, a perfect 3BC is more advantageous than the 2BC geometry as it allows\nfully symmetric detector positions, which is required by the sum rules for a quantitative analysis\n[8]. Having reciprocal space maps of the dichroic signal allows for detailed analyses of data,\ncomparing experiment and theory. In this section the quantitative use of the 3BC geometry is\ndescribed in detail, using the same data set as in Ref. [9]. Details on the asymmetry of the 2BC\ngeometry can be found in Refs. [8] and [19].\nTo orient our specimen with a texture angle of ∼ 0.67◦ in a perfect 3BC geometry is obviously\nnot possible. Since this is a typical texture angle of heteroepitaxial high-quality sputtered thin\nfilms and super-lattice structures, it is important to understand how the dichroic signal is affected.\nThis is discussed in detail in Ref. [9]. Here we focus on how a small deviation from the perfect\n3BC geometry in the experimental set up will affect the selection of mirror axis and consequently\nthe apparent mL /mS ratio. Our simulations have shown that deviations from the perfect 3BC\ngeometry strongly influence the measured dichroic signal. A deviation as small as 0.05G200 ,\nwhich is equivalent to a tilt of the sample of 0.02◦ , is sufficient to introduce substantial variations\nof the apparent mL /mS ratio (see Sec. 5.3) throughout the diffraction plane, particularly in the\nmaps with vertical mirror axis. Therefore, the precision and stability of the sample stage in the\nTEM is also crucial for orienting the specimen.\nIn the inset of Fig. 5a the experimental diffraction pattern averaged over an energy interval\nfrom 695 eV to 740 eV is shown. From the measured experimental intensities of G and −G\ndiffracted spots it can be seen that the Laue circle center has a slight negative k x -value, i.e. the\nintensity of −G is higher than G. Here, the deviation from perfect 3BC geometry is found to\nbe approximately −0.05G200 . Experimental and calculated maps of the relative dichroic signal\n(difference divided by its sum) for the L2,3 edges are shown in Fig. 5, applying vertical and\nhorizontal mirror axes. The dichroic maps were obtained as described in Sec. 4.1 and 5.\nAs expected, the distribution of the dichroic signal when using the two different mirror axes\nshows similar qualitative behavior. Generally, the maps can be split into four quadrants, each\n17\n\n\fFigure 5: (color online) Reciprocal space maps of the EMCD signal for the Fe L2,3 edges with the sample oriented in a\n3BC geometry, using a vertical (left column) or horizontal (right column) mirror axis. In a), b) and e), f) experimental\nmaps of relative EMCD signal (difference divided by its sum) at L2 , 3 edges are shown. The corresponding simulations\nare shown in c), d) and g), h) considering the texture angle of the sample and the deviation from perfect 3BC geometry\nas explained in the text. The black line indicates the applied mirror axis and blue spots the positions of the transmitted\nand Bragg scattered G = (200) and −G = (2̄00) beams. The insets show the corresponding experimental and simulated\ndiffraction patterns averaged over an energy interval from 695 eV to 740 eV.\n\n18\n\n\fwith a particular sign of the difference signal. Some differences are visible in the surrounding\nof the ±G diffraction spots when using a vertical mirror axis, see maps in Fig. 5a to d, where\nthe difference signal does not change sign between L2 and L3 edges. This feature is visible\nin both experiment and calculation and it is caused by the asymmetry introduced when having\na slightly misoriented 3BC geometry. Because of that reason, the mL /mS ratios extracted at\nthese positions can have a large error. In general, there is a very good correspondence between\nthe theoretical and experimental maps, regarding both position and strength of the maxima and\nminima of the dichroic signal. In maps with vertical mirror axis the asymmetry is substantial, as\nis best demonstrated by the simulated maps of the apparent mL /mS ratio, Fig. 6a (note the large\nrange of the scale). Only for a few pixels (grey color) the value of the apparent mL /mS ratio is\nclose to the one obtained directly from DFT calculations. Therefore maps using vertical mirror\naxis are not suitable for measurements of the mL /mS ratio, unless a highly precise and accurate\n3BC orientation (sub-0.01◦ ) is reached.\nWhen the horizontal mirror axis is used, the effect of the misorientation on the dichroic\nsignal is much smaller. Since the higher symmetry of the 3BC geometry is now not used, this\ncase is very similar to the 2BC geometry and it is affected by the same asymmetry problem [19].\nNonetheless, these maps show a much smaller variation of the apparent mL /mS ratio throughout\nthe diffraction plane, see Fig. 6c. The major features in this map are visible at {110} positions\n(Thales circle positions). Since the Ewald sphere for incoming beam is closer to spots with\npositive ky coordinates, the (110) and (1̄10) spots are excited slightly stronger than their (11̄0)\nand (1̄1̄0) counterparts. We note, that here we are working with differences of small numbers. So\ndespite the fact that these excitations are not visible in the diffraction patterns, there are actually\nslight enhancements of the scattering cross-sections present, and they can become important in\ndifference maps. This effect is well visible in the maps of the apparent mL /mS ratio (Fig. 6c\nand d) and it is responsible for decreasing the extracted mL /mS ratio in the left half-plane, while\nincreasing it in the right half-plane, respectively (see also Table 1).\nWhen using the horizontal mirror axis the correct mL /mS ratio can be extracted at detector\npositions where; i) the EMCD signal is strong and ii) the Ewald sphere of the incoming beam\nis sufficiently far from excitations outside the systematic row around both \"symmetry-related\"\ndetector positions. In the 2BC geometry these conditions are best fulfilled inside or close to\nthe Thales circle, optimally avoiding the {110} positions [19]. Also the region closest to the\n19\n\n\fFigure 6: (color online) Calculated (left column) and experimental (right column) reciprocal space maps of the apparent\nmL /mS ratio, using the dichroic maps shown in Fig. 5. The maps are obtained utilizing different mirror axes; a) and\nb) vertical, c) and d) horizontal and e) and f) double difference (using both). The black lines indicate the mirror axes\nand blue spots the positions of the transmitted and Bragg scattered G = (200) and −G = (2̄00) beams. Note the nearly\nconstant value of the apparent mL /mS ratio in the double-difference maps in a large portion of the diffraction plane,\ndespite the texture angle of the sample and the deviation from perfect 3BC geometry. Contrary to that, the use of only\none vertical or horizontal mirror axis leads to different values throughout reciprocal space. The color bar of panel f)\napplies also to b) and d). Values outside the color bar are shown as white.\n\n20\n\n\fTable 1: Extracted mL /mS ratios in the 3BC geometry using different mirror axes. The values were extracted from\nexperimental and calculated apparent mL /mS ratio maps, while optimizing the position of the extracted region of 0.5G200\nx 0.5G200 . The error for the experimental values show the standard error from the histogram of the individual mL /mS\nvalues in the box [9], while for calculated the standard error obtained from mean value is shown.\n\nAxis\nVert.\nHoriz.\nDouble\n\nExp. mL /mS\n0.22±0.01(Up)\n0.02±0.01(Dn)\n0.10±0.01(L)\n0.12±0.01(R)\n0.08±0.01\n\nCalc. mL /mS\n0.19 ± 0.21(Up)\n−0.11 ± 0.19(Dn)\n0.003 ± 0.04(L),\n0.071 ± 0.04(R)\n0.036 ± 0.002\n\nsystematic row of reflections and to the vertical line passing through the transmitted beam should\nbe excluded since the EMCD signal is there close to zero.\nAs we have demonstrated, for a sample that is not oriented in a perfect 3BC geometry the\napparent mL /mS ratio will vary over the reciprocal plane when using only one (horizontal or\nvertical) mirror axis. To correct for this we introduced in Ref. [9] the procedure of double difference maps, where the dichroic signal is extracted as a difference with respect to both horizontal\nand vertical mirror axes applied successively. This operation effectively cancels out the nonmagnetic part of the signal (originating from real parts of mixed dynamic form factors), which\nremains after using a vertical mirror axis in a measurement when the sample deviates from perfect 3BC orientation. It is assumed that the contribution is close to symmetric with respect to\nthe horizontal mirror axis and is therefore canceled out using the subsequent horizontal mirror\naxis. This assumption is verified both by simulations and experiments, as demonstrated by the\nweakly varying apparent mL /mS ratio extracted from double difference maps, see Fig. 6e and\nf. Therefore, the double difference allows to extract the mL /mS ratio from a larger part of the\ndiffraction plane, compared to single mirror axis approach. The apparent mL /mS ratios, extracted\nusing a box of 0.5G200 x 0.5G200 as described in Ref. [9], are summarized in Table 1 for the 3BC\ngeometry while using different mirror axes.\n6.2. Real space maps\nReal space maps of the EMCD signal were obtained from the same Fe sample as used for\nthe reciprocal space maps. The sample was oriented in a 3BC geometry to strongly excite the\nG = ±(200) reflections, tilting approximately 20◦ from the [001] zone axis. We do not expect\nnotable differences of the EMCD signal with respect to the 10◦ tilt used for reciprocal space\nmaps. An EFDIF pattern at 710 eV using a 5 eV slit was acquired in order to position the\n21\n\n\fobjective aperture (diameter of approximately 0.8G200 ) where we expect a strong EMCD signal,\nsee Fig. 7a. Although the Fe sample is of high crystalline quality it is (as described in Sec. 2)\nnot a perfect single crystal. Even though the angular deviation measured by XRD is found to be\nsmall (±0.3◦ ), it is sufficient to show up in a DF TEM image as shown in Fig. 7b, here selecting\nthe left Fe G = (200) reflection (Fig. 7a). Only regions with a bright contrast in this DF image\nwill be relevant for extracting an EMCD signal, here extending over several hundred nanometers.\nThe DF image shows regions with increasing thickness (compare with Fig. 1), starting from a\nhole in the upper right corner, going through the region of interest with only the Fe layer and Al\ncap. As the thickness is increased a region with also the Fe/V superlattice occur, where after the\nMgO substrate is included (lower left corner of Fig. 7b).\nTwo real space data cubes were acquired, one for each of the positions of the objective aperture as indicated in Fig. 7a. Unfortunately, during acquisition the orientation of the sample relative to the beam changed slightly and thereby further reducing the useful region for the EMCD\nreal space maps. This change could be related to buckling of the sample during electron beam\nillumination. Suitable regions were found by observing all EFTEM images (in this case 160)\nthroughout both cubes and DF images both before and after the EFTEM series. The data cubes\nwere processed, as described in Sec. 4.2, to obtain real space maps of the EMCD signal. These\nmaps are shown for the Fe L3 and L2 edges in Fig. 7c and d, respectively. A region where the sign\nof the EMCD signal changes when comparing the L2 to the L3 edge is indicated by the arrow,\nextending as an approximately 100 nm wide region along the vicinity of the Fe/V superlattice.\nIt should be noted that the EMCD signal outside this region does not change sign between the\nedges, which becomes evident when studying the EFTEM images of the data cubes. The sample\nis there found to change its orientation, resulting in strong intensity changes and thus preventing\nEMCD measurements.\nAlthough the maps of the EMCD signal in Fig. 7 are somewhat noisy, they clearly show the\npossibilities of EFTEM imaging for EMCD. To support the observation, experimental spectra\nwere extracted from the two data cubes at the position of the arrow in Fig. 7c and d. These\nare shown in Fig. 8 when selecting different number of pixels by a square box, resulting in a\nspatial resolution of 2 nm, 6 nm, 14 nm, 30 nm and 46 nm (each pixel corresponds to 2 nm). The\nspectra were extracted from data cubes that were only processed using point blemish removal and\ncross correlation. After extraction, the spectra were individually pre-edge background subtracted,\n22\n\n\fFigure 7: (color online) a) Energy filtered diffraction pattern of the Fe sample at 710 eV using a 5 eV slit, in 3BC geometry\nwith G = ±(200). The dashed circles indicate the positions of the objective aperture that were used for acquiring the two\ndata cubes. b) Dark field image before the two EFTEM data cubes were acquired, revealing possible regions with correct\norientation for the real space maps (bright areas where only Fe). In c) and d) real space maps of the relative EMCD signal\n(difference divided by its sum) for the L3 and L2 edges are shown, respectively. The arrows indicate the same positions in\nc) and d), from where spectra were extracted and is shown in Fig. 8. The corresponding regions of c) and d) are indicated\nin b) with a white box.\n\n23\n\n\fFigure 8: (color online) EELS spectra extracted from the real space data cubes at the position indicated by the arrows in\nFig. 7c) and d). Square boxes with different sizes were used, averaging over 2 nm, 6 nm, 14 nm, 30 nm and 46 nm as\nindicated. An EMCD signal is observed at both L2,3 edges even for the smallest (2 nm) spatial resolution. The spectra\nwere offset in intensity for clarity.\n\naligned in energy-loss and normalized at the post edge region. The results are consistent with\nthe EMCD maps of Fig. 7, revealing an EMCD signal with a strength of a few percent at the\nL2,3 edges. Thus, this experiment clearly shows the feasibility of EMCD real space maps with\nnanometer resolution.\nCalculating the mL /mS ratio is unfortunately not possible with this data set. This could have\nvarious sources, such as orientational changes of the sample as discussed above. Other sources\nof error include the S/N ratio in combination with the poor energy resolution for the peak fitting\nprocedure. It would also be preferable to use four data cubes in order to perform the double\ndifference procedure as described in Sec. 6.1, which was not possible here because of sample\ninstability.\n7. Conclusions\nIn this article we describe a method for obtaining quantitative measurements of the atomspecific mL /mS ratio in the transmission electron microscope using reciprocal space maps. Ex24\n\n\fperiments were performed on a sputtered thin layer of bcc Fe with a small texture angle while\ndeviating from the perfect 3BC geometry, in order to demonstrate the importance of proper mirror axis selection. Even small deviations from a perfect 3BC geometry were found to influence\nthe obtained mL /mS ratio when using only horizontal or only vertical mirror axis for extraction\nof the signal. These deviations can be successfully compensated utilizing both mirror axes, constructing the double difference maps. This is an important step in the development of EMCD for\nquantitative measurements of technologically interesting samples, such as sputtered thin films\nand super-lattice structures.\nWe demonstrate also the importance of removing the so called side-lobe emission, which\nis observable as a non uniform background in reciprocal space, typically observed for Schottky\nemitters. It led us to operate the microscope in telefocus mode where, additionally, the intensity\nof the electron beam is strongly enhanced. The high intensity allowed acquisition of the EMCD\nsignal from EFTEM images, down to the nanometer range. This is therefore an important step\nforward for the development of the EMCD technique in order to become a quantitative tool for\nmagnetic measurements in the TEM with superior spatial resolution.\nThe work was supported through the Swedish Research Council (VR), Knut and Alice Wallenberg foundation (KAW), STINT and computer cluster DORJE of IOP ASCR.\nReferences\n[1] P. Schattschneider, S. Rubino, C. Hébert, J. Rusz, J. Kuneš, P. Novák, E. Carlino, M. Fabrizioli, G. Panaccione and\nG. Rossi, Nature 441, 486 (2006).\n[2] S. Rubino, Ph.D. thesis entitled Magnetic Circular Dichroism in the Transmission Electron Microscope, Vienna\nUniversity of Technology, (2007).\n[3] J. Stöhr et al., Science 259, 658 (1993).\n[4] S. Rubino, P. Schattschneider, M. Stöger-Pollach, C. Hébert, J. Rusz, L. Calmels, B. Warot-Fonrose, F. Houdellier,\nV. Serin, P. Novák, J. Mater. Res. 23, 2582 (2008).\n[5] J. Rusz, S. Rubino, P. Schattschneider, Phys. Rev. B 75, 214425 (2007).\n[6] J. Rusz, O. Eriksson, P. Novák, P. M. Oppeneer, Phys. Rev. B 76, 060408(R) (2007).\n[7] L. Calmels, F. Houdellier, B. Warot-Fonrose, C. Gatel, M. J. Hÿtch, V. Serin, E. Snoeck, P. Schattschneider, Phys.\nRev. B 76, 060409(R) (2007).\n[8] J. Rusz, submitted.\n[9] H. Lidbaum, J. Rusz, A. Liebig, B. Hjörvarsson, P. M. Oppeneer, E. Coronell, O. Eriksson, K. Leifer, Phys. Rev.\nLett. 102, 037201 (2009).\n[10] R. Alani. P. R. Swann in Specimen preparation for Transmission Electron Microscopy of materials III, R. Anderson,\nB. Tracy, J. Bravman, Eds. (MRS, Pittsburgh, 1992), vol. 254, pp. 43-63.\n[11] A. J. Scott, A. P. Brown, A. Nichells, R. Brydson, Inst. Phys. Conf. Ser., No 168:Section 4, 171 (2001).\n[12] Help files of the Tecnai microscope, FEI Company, updated 09/01/05. Also available through e.g.\nhttp://cryoem.ucsd.edu/microscopes/polara docs/FEG.PDF on 2009-05-05.\n[13] P. Schattschneider, M. Stöger-Pollach, S. Rubino, M. Sperl, Ch. Hurm, J. Zweck, J. Rusz, Phys. Rev. B 78, 104413\n(2008).\n[14] R. F. Egerton, Electron Energy-Loss Spectroscopy in the Electron Microscope (Plenum Press, New York, ed. 2,\n1996).\n\n25\n\n\fC. Jeanguillaume, P. Trebbia, C. Colliex, Ultramic. 3, 237 (1978).\nB. Schaffer, W. Grogger, G. Kothleitner, Ultramicroscopy 102, 27 (2004).\nF. Wang, M. Malac, R. F. Egerton, Micron 37, 316 (2006).\nR. Hesse, P. Streubel, R. Szargan, Surf. Interface Anal. 39, 381 (2007).\nJ. Rusz, P.M. Oppeneer, H. Lidbaum, S. Rubino, K. Leifer, accepted in J. Microscopy (2009).\nH. Shimazaki, S. Shinomoto, Neural Computation 19, 1503 (2007).\nS. K. Mohanlal, J. Phys. C 12, L651 (1979).\nP. Blaha, K. Schwarz, G. K. H. Madsen, D. Kvasnicka, J. Luitz, WIEN2k, Vienna University of Technology, ISBN\n3-9501031-1-2 (2001).\n[23] B. T. Thole, P. Carra, F. Sette, and G. van der Laan, Phys. Rev. Lett. 68, 1943 (1992).\n[24] P. Carra, B. T. Thole, M. Altarelli, and X. Wang, Phys. Rev. Lett. 70, 694 (1993).\n[25] H. Ebert, Rep. Prog. Phys. 59, 1665 (1996).\n\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n\n26\n\n\f"}