{"id": "http://arxiv.org/abs/1001.0333v1", "guidislink": true, "updated": "2010-01-02T20:49:54Z", "updated_parsed": [2010, 1, 2, 20, 49, 54, 5, 2, 0], "published": "2010-01-02T20:49:54Z", "published_parsed": [2010, 1, 2, 20, 49, 54, 5, 2, 0], "title": "A Transiting Hot Jupiter Orbiting a Metal-Rich Star", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1001.5217%2C1001.5425%2C1001.4053%2C1001.1760%2C1001.3164%2C1001.4504%2C1001.4370%2C1001.2044%2C1001.0284%2C1001.4038%2C1001.3079%2C1001.4086%2C1001.3925%2C1001.1735%2C1001.0101%2C1001.2860%2C1001.5022%2C1001.4306%2C1001.4821%2C1001.4121%2C1001.2004%2C1001.1197%2C1001.1324%2C1001.4977%2C1001.3576%2C1001.1561%2C1001.4305%2C1001.1044%2C1001.4836%2C1001.5040%2C1001.5066%2C1001.0563%2C1001.3026%2C1001.0333%2C1001.1094%2C1001.4233%2C1001.1710%2C1001.3231%2C1001.2726%2C1001.2022%2C1001.1098%2C1001.2934%2C1001.2915%2C1001.2398%2C1001.3009%2C1001.4842%2C1001.3553%2C1001.1485%2C1001.2784%2C1001.3457%2C1001.2742%2C1001.5107%2C1001.5450%2C1001.1718%2C1001.4084%2C1001.4942%2C1001.3839%2C1001.1904%2C1001.0339%2C1001.2805%2C1001.4914%2C1001.2368%2C1001.2626%2C1001.1196%2C1001.0030%2C1001.1237%2C1001.3906%2C1001.0462%2C1001.4331%2C1001.0155%2C1001.3214%2C1001.0564%2C1001.3918%2C1001.2675%2C1001.4858%2C1001.3755%2C1001.0256%2C1001.4021%2C1001.2416%2C1001.4094%2C1001.3877%2C1001.0323%2C1001.0541%2C1001.0509%2C1001.0940%2C1001.1162%2C1001.2564%2C1001.4221%2C1001.1572%2C1001.1208%2C1001.0355%2C1001.3795%2C1001.3614%2C1001.2150%2C1001.0087%2C1001.4229%2C1001.4130%2C1001.2596%2C1001.3824%2C1001.2866%2C1001.2007&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A Transiting Hot Jupiter Orbiting a Metal-Rich Star"}, "summary": "We announce the discovery of Kepler-6b, a transiting hot Jupiter orbiting a\nstar with unusually high metallicity, [Fe/H] = +0.34 +/- 0.04. The planet's\nmass is about 2/3 that of Jupiter, Mp = 0.67 Mj, and the radius is thirty\npercent larger than that of Jupiter, Rp = 1.32 Rj, resulting in a density of\n0.35 g/cc, a fairly typical value for such a planet. The orbital period is P =\n3.235 days. The host star is both more massive than the Sun, Mstar = 1.21 Msun,\nand larger than the Sun, Rstar = 1.39 Rsun.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1001.5217%2C1001.5425%2C1001.4053%2C1001.1760%2C1001.3164%2C1001.4504%2C1001.4370%2C1001.2044%2C1001.0284%2C1001.4038%2C1001.3079%2C1001.4086%2C1001.3925%2C1001.1735%2C1001.0101%2C1001.2860%2C1001.5022%2C1001.4306%2C1001.4821%2C1001.4121%2C1001.2004%2C1001.1197%2C1001.1324%2C1001.4977%2C1001.3576%2C1001.1561%2C1001.4305%2C1001.1044%2C1001.4836%2C1001.5040%2C1001.5066%2C1001.0563%2C1001.3026%2C1001.0333%2C1001.1094%2C1001.4233%2C1001.1710%2C1001.3231%2C1001.2726%2C1001.2022%2C1001.1098%2C1001.2934%2C1001.2915%2C1001.2398%2C1001.3009%2C1001.4842%2C1001.3553%2C1001.1485%2C1001.2784%2C1001.3457%2C1001.2742%2C1001.5107%2C1001.5450%2C1001.1718%2C1001.4084%2C1001.4942%2C1001.3839%2C1001.1904%2C1001.0339%2C1001.2805%2C1001.4914%2C1001.2368%2C1001.2626%2C1001.1196%2C1001.0030%2C1001.1237%2C1001.3906%2C1001.0462%2C1001.4331%2C1001.0155%2C1001.3214%2C1001.0564%2C1001.3918%2C1001.2675%2C1001.4858%2C1001.3755%2C1001.0256%2C1001.4021%2C1001.2416%2C1001.4094%2C1001.3877%2C1001.0323%2C1001.0541%2C1001.0509%2C1001.0940%2C1001.1162%2C1001.2564%2C1001.4221%2C1001.1572%2C1001.1208%2C1001.0355%2C1001.3795%2C1001.3614%2C1001.2150%2C1001.0087%2C1001.4229%2C1001.4130%2C1001.2596%2C1001.3824%2C1001.2866%2C1001.2007&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We announce the discovery of Kepler-6b, a transiting hot Jupiter orbiting a\nstar with unusually high metallicity, [Fe/H] = +0.34 +/- 0.04. The planet's\nmass is about 2/3 that of Jupiter, Mp = 0.67 Mj, and the radius is thirty\npercent larger than that of Jupiter, Rp = 1.32 Rj, resulting in a density of\n0.35 g/cc, a fairly typical value for such a planet. The orbital period is P =\n3.235 days. The host star is both more massive than the Sun, Mstar = 1.21 Msun,\nand larger than the Sun, Rstar = 1.39 Rsun."}, "authors": ["Edward W. Dunham", "William J. Borucki", "David G. Koch", "Natalie M. Batalha", "Lars A. Buchhave", "Timothy M. Brown", "Douglas A. Caldwell", "William D. Cochran", "Michael Endl", "Debra Fischer", "Gabor Furesz", "Thomas N. Gautier III", "John C. Geary", "Ronald L. Gilliland", "Alan Gould", "Steve B. Howell", "Jon M. Jenkins", "Hans Kjeldsen", "David W. Latham", "Jack J. Lissauer", "Geoffrey W. Marcy", "Soren Meibom", "David G. Monet", "Jason F. Rowe", "Dimitar D. Sasselov"], "author_detail": {"name": "Dimitar D. Sasselov"}, "author": "Dimitar D. Sasselov", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/2041-8205/713/2/L136", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1001.0333v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1001.0333v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "12 pages, 2 figures, submitted to the Astrophysical Journal Letters", "arxiv_primary_category": {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1001.0333v1", "affiliation": "Harvard-Smithsonian Center for Astrophysics", "arxiv_url": "http://arxiv.org/abs/1001.0333v1", "journal_reference": null, "doi": "10.1088/2041-8205/713/2/L136", "fulltext": "Version 5.2 - 28 December 2009\n\narXiv:1001.0333v1 [astro-ph.SR] 2 Jan 2010\n\nKepler-6b: A Transiting Hot Jupiter Orbiting a Metal-Rich Star†\nEdward W. Dunham1 , William J. Borucki2 , David G. Koch2 , Natalie M. Batalha3 ,\nLars A. Buchhave4,5 , Timothy M. Brown6 , Douglas A. Caldwell7 , William D. Cochran8 ,\nMichael Endl8 , Debra Fischer17 , Gabor Fűrész4 , Thomas N. Gautier III9 , John C. Geary4 ,\nRonald L. Gilliland10 , Alan Gould16 , Steve B. Howell11 , Jon M. Jenkins7 , Hans Kjeldsen15 ,\nDavid W. Latham4 , Jack J. Lissauer2 , Geoffrey W. Marcy12 , Soren Meibom4 ,\nDavid G. Monet13 , Jason F. Rowe14,7 , Dimitar D. Sasselov4\nABSTRACT\n†\n\nBased in part on observations obtained at the W. M. Keck Observatory, which is operated by the\nUniversity of California and the California Institute of Technology.\n1\n\nLowell Observatory, Flagstaff, AZ 86001\n\n2\n\nNASA Ames Research Center, Moffett Field, CA 94035\n\n3\n\nSan Jose State University, San Jose, CA 95192\n\n4\n\nHarvard-Smithsonian Center for Astrophysics, Cambridge, MA 02138\n\n5\n\nNiels Bohr Institute, Copenhagen University, DK-2100 Copenhagen, Denmark\n\n6\n\nLas Cumbres Observatory Global Telescope, Goleta, CA 93117\n\n7\n\nSETI Institute, Mountain View, CA 94043\n\n8\n\nUniversity of Texas, Austin, TX 78712\n\n9\n\nJet Propulsion Laboratory/California Institute of Technology, Pasadena, CA 91109\n\n10\n\nSpace Telescope Science Institute, Baltimore, MD 21218\n\n11\n\nNational Optical Astronomy Observatory, Tucson, AZ 85719\n\n12\n\nUniversity of California, Berkeley, Berkeley, CA 94720\n\n13\n\nUS Naval Observatory, Flagstaff Station, Flagstaff, AZ 86001\n\n14\n\nNASA Postdoctoral Program Fellow\n\n15\n\nUniversity of Aarhus, Aarhus, Denmark\n\n16\n\nLawrence Hall of Science, Berkeley, CA 94720\n\n17\n\nYale University, New Haven, CT 06510\n\n\f–2–\nWe announce the discovery of Kepler-6b, a transiting hot Jupiter orbiting a\nstar with unusually high metallicity, [Fe/H] = +0.34 ± 0.04. The planet's mass is\nabout 2/3 that of Jupiter, MP = 0.67 MJ , and the radius is thirty percent larger\nthan that of Jupiter, RP = 1.32 RJ, resulting in a density of ρP = 0.35 g cm−3 , a\nfairly typical value for such a planet. The orbital period is P = 3.235 days. The\nhost star is both more massive than the Sun, M⋆ = 1.21 M⊙ , and larger than the\nSun, R⋆ = 1.39 R⊙ .\nSubject headings: planetary systems - stars: individual (Kepler-6, KIC 10874614,\n2MASS 19472094+4814238) - techniques: spectroscopic\n\n1.\n\nINTRODUCTION\n\nThe Kepler mission was launched on March 6, 2009 to undertake a search for Earth-size\nplanets orbiting in the habitable zones of stars similar to the Sun. Kepler uses the transit\nphotometry approach for this task (Borucki et al. 2010a). Kepler's commissioning process\nwent very well and the system is providing data of exceptional photometric quality (Koch\net al. 2010a). Indeed, the final commissioning data, 9.7 days of science-like observations of\n50000 stars selected from the Kepler Input Catalog (KIC) (Koch et al. 2010a), were of such\nhigh quality that they are now commonly, if incorrectly, referred to as the \"quarter 0\" data.\nA number of Kepler Objects of Interest (KOIs) simply fell out of this dataset, including\nthe present object, known as KOI-17. Its transit signal is huge by Kepler standards, and\nexcellent light curve results were obtained quickly. The follow-up spectroscopic observations\ntook somewhat longer since observations were not planned to be undertaken so soon after\ncommissioning. As a result the first data intended for science, 33.5 days of observations of\n150000 KIC stars, became available in the meantime and were folded in with the original\ntest data for the analysis presented here. The 1.3 day gap between these two sets of data\ncontained one transit of Kepler-6b. Haas et al. (2010) provide additional details regarding\nthe Kepler data used in this analysis.\nBecause the pace of early Kepler extrasolar planet discoveries is limited by the radialvelocity follow-up observations, the first objects to be announced tend to be those most\neasily confirmed spectroscopically. Kepler-6b (= KIC 10874614, α = 19h 47m 20s .94, δ =\n+48◦ 14′ 23′′ .8, J2000, KIC r = 13.253 mag) is one of these objects.\n\n\f–3–\n2.\n\nKEPLER PHOTOMETRY\n\nThe Kepler science data for the primary transit search mission are the long cadence\ndata (Jenkins et al. 2010a). These consist of sums very nearly 30 minutes in length (with\nrigorously the same integration time) of each pixel in the aperture containing the target star\nin question. These data proceed through an analysis pipeline to produce corrected pixel data,\nthen simple unweighted aperture photometry sums are formed to produce a photometric time\nseries for each object (Jenkins et al. 2010b). The many thousands of photometric time series\nare then processed by the transiting planet search (TPS) pipeline element (Jenkins et al.\n2010b). The candidate transit events identified by TPS were then vetted by visual inspection.\nThe light curves produced by the photometry pipeline tend to show drifts due to an\nextremely small, slow focus change (Jenkins et al. 2010a), and there are also sometimes low\nfrequency variations in the stellar signal that can make analysis of the transit somewhat\nproblematic. These low frequency effects can be removed by modest filters that have only an\ninsignificant effect on the transit signal (Koch et al. 2010b). The unfolded and folded light\ncurves for Kepler-6b produced in this manner are shown in Figure 1. 1\nFigure 1 illustrates two of the ways we reject false positives based on the Kepler light\ncurves alone. The lower part of the figure shows the planetary transit (referred to the left\nordinate). The points marked with + and × symbols refer to alternating even and odd transit\nevents. This aids in detecting eclipsing binary stars with nearly, but not quite equal primary\nand secondary minima. No such deviation is observed for Kepler-6. The upper curve shows\nthe time of secondary minimum, assuming zero eccentricity. The vertical scale, on the right,\nis magnified and measured in parts per million to help search for a small secondary minimum\nthat might be due to occultation of an M dwarf companion. Again, no such signature is\nvisible.\n\n3.\n\nFOLLOW-UP OBSERVATIONS\n\nThe crucial importance of ground-based follow-up observations was recognized long ago\n(Latham 2003) and a well-established plan was in place by the time of launch. This has\nevolved somewhat and our current approach is described by Gautier et al. (2010). The\nkey features are: 1) carry out high resolution reconnaissance spectroscopy to determine the\nstellar properties and the star's suitability for radial-velocity work, and to search for signs of\n1\n\nThe time series photometry and radial velocity data, including bisector spans, may be retrieved from\nthe MAST/HLSP data archive at http://archive.stsci.edu/prepds/kepler hlsp.\n\n\f–4–\nstellar companions; 2) search for faint blended eclipsing binaries through the centroid shift\napproach (Batalha et al. 2010) and by means of high resolution imaging; and 3) detect the\nstellar reflex motion with precise radial-velocity measurements. In the future we hope to\nimprove our constraints on stellar properties by including both asteroseismology results for\nat least the brighter host stars (Gilliland et al. 2010a) and parallaxes (Monet et al. 2010) for\nevery target. These results are not available for Kepler-6 at this time.\n\n3.1.\n\nReconnaissance Spectroscopy\n\nThe reconnaissance spectra for Kepler-6 were carried out very early in the follow-up program, so observations were obtained with several of our resources for comparison purposes:\nthe TRES spectrograph on the Tillinghast telescope (by L. Buchhave and D. Latham), the\nMcDonald 2.7-m Coude spectrograph (by M. Endl and W. Cochran), and the FIES spectrograph on the Nordic Optical Telescope (by L. Buchhave and G. Fűrész). The spectra\nindicated that Kepler-6 was well suited for precise radial-velocity work and no evidence\nof double lines or a stellar companion was seen. The best data on stellar properties were\ndetermined later and are discussed below.\nThe mean radial velocity of Kepler-6 was determined by C. Chubak with two HIRES\nspectra using telluric lines to set their zero point. Observations of the radial velocity standard\nHD182488 using the same approach produced a mean value of −21.50 ± 0.18 km s−1 , in good\nagreement with the adopted value of -21.508 km s−1 . Observations with FIES and TRES\nusing the same standard star to determine their zero points were in good agreement with\nthe HIRES velocity. The average of these values is shown in Table 2.\n\n3.2.\n\nHigh-Resolution Imaging and Centroid Motion\n\nKepler-6 has a companion 4.1′′ distant and 3.8 magnitudes fainter as seen in both a\nHIRES guide camera image and a PHARO J band AO image obtained with the Palomar\nHale telescope (Gautier and Ciardi). A WIYN speckle image (Howell) shows only a single\nstar within its 2′′ square box. There are apparently two additional components both approximately 5.4 magnitudes fainter and 11.5′′ distant that appear in the KIC as KIC IDs\n10874615 and 10874616. These two objects refer to a single star and erroneously appear as\ntwo objects in the KIC. This star is very close to the edge of the aperture containing Kepler6. The observed shift in the Kepler intensity weighted mean image centroid during transit,\n(−0.1, +0.3) millipixels in the (column, row) directions is consistent with the expected shift\n\n\f–5–\nif the faint companions are not the source of the transit signature. If the fainter, more distant\nstar is fully in the aperture the expected shift is (0.0, +0.3) millipixels and if it is completely\nout of the aperture the expected shift is (−0.1, +0.4) millipixels, both being consistent with\nthe observed centroid shift. On the other hand if the closer, brighter background star is the\ntransit source the expected shift is 30 times larger, ruling out this possibility. The fainter\nobject is too faint to produce the observed transit depth even if it disappears entirely during\nthe transit, and if it could the resulting centroid shift would be nearly a factor of 100 larger\nthan the observed shift. The typical sensitivity level for detection of centroid shifts is on the\norder of 0.1 millipixel or somewhat less. See Batalha et al. (2010) for a detailed discussion\nof this approach for candidate vetting.\n\n3.3.\n\nPRECISE RADIAL VELOCITIES\n\nPrecise velocities were obtained by using HIRES on the Keck 1 telescope with iodine cell\nradial-velocity reference. A modified version of the standard HIRES iodine cell reduction\npipeline that includes improved cosmic ray rejection and sky brightness suppression was\napplied to these spectra by J. Johnson. The reduction pipeline modification was necessary\nbecause of the faintness of this star compared to the bright stars normally observed for radial\nvelocity planet search work. The nearby companion mentioned earlier is sufficiently far away\non the sky that it does not interfere with the HIRES work. The phased velocities are shown\nin Figure 2 with a fit to a circular orbit whose phase and period are fixed by the observed\ntransit times.\nThe Monte Carlo analysis described below shows no evidence of orbital eccentricity. In\nthis analysis the eccentricity and longitude of periastron were parameterized as e sin ω and\ne cos ω. The probability distribution for these parameters is symmetrical with zero mean\nand a standard deviation of 0.029.\nThe rms of the velocity residuals is 5.7 m s−1 with the point nearest transit omitted from\nthe fit. This point is potentially affected by the Rossiter-McLaughlin effect. Its residual of\n12 m s−1 is larger than all the other velocity points and is in the sense of a prograde orbit. The\nrotational velocity given in Table 2 would result in an R-M amplitude of 20 m s−1 , certainly\ndetectable with further careful spectroscopy. An analysis of the line bisectors (Figure 2)\nshows an rms of 6.8 m s−1 with no organized structure that might result from a triple system\n(Mandushev et al. 2005).\n\n\f–6–\n4.\n\nDISCUSSION\n\nA Monte Carlo bootstrap procedure developed by Rowe and Brown, outlined in Koch\net al. (2010b) and Borucki et al. (2010b), that simultaneously fits the light curve and the\nradial velocities, and that is consistent with stellar evolution models, was carried out to\nproduce most of the stellar and planetary properties presented in Table 2. The model light\ncurve (Mandel & Agol 2002) was integrated over the long cadence integration period prior\nto fitting to the Kepler data. We note that the nearby companion star alluded to earlier\nis only about one Kepler pixel away from Kepler-6, so its light is included in the Kepler\naperture. The fainter, more distant star is partially included in the aperture as well. This\nhas the effect of diluting the depth of the transit by 3.3 ± 0.4%. This effect has been taken\ninto account in the modeling process including the dilution uncertainty due to the partial\n−3\ninclusion of the more distant star. The derived planetary density, 0.352+0.018\n−0.022 g cm , places\nit in a well-populated area of the mass-radius relationship for currently known extrasolar\nplanets.\nSeveral spectra obtained with HIRES without the iodine cell were subjected to an SME\nanalysis (Valenti & Piskunov 1996) by D. Fischer to provide the remaining stellar properties\nreported in Table 2. In this analysis log g was frozen at the transit-derived value since it\nis more reliable than the SME value, which was 4.59 if allowed to float. The discrepancy\nbetween the transit value of log g and the SME value is significant. Gilliland et al. (2010b)\nand Nutzman et al. (2010) find a similar effect in their comparison of log g derived from\ntransit fits, asteroseismology constraints, and SME spectral analysis in the case of HD17156\n([Fe/H] = +0.24). In that case the discrepancy in log g is smaller, 0.12, but is in the same\nsense. Bakos et al. (2009) find a similar situation for HAT-P-13 ([Fe/H] = +0.41) with\na log g discrepancy of +0.14. This suggests that there is a systematic error in the log g\nvalues derived from SME analysis for high metallicity stars. However, Burke et al. (2007)\nfind only a small log g discrepancy of +0.02 in the case of XO-2 ([Fe/H] = +0.45) and the\ndiscrepancy for HD80606 ([Fe/H] = +0.4) is only +.01 (Naef et al. 2001; Winn et al. 2009).\nFurther comparisons of spectroscopic log g values with precise values derived from transits\nand asteroseismology are likely to be fruitful.\nFunding for this Discovery mission is provided by NASA's Science Mission Directorate.\nIt is with pleasure that we acknowledge the outstanding work done by the entire Kepler\nteam during development, launch, commissioning, and the ongoing operations of the Kepler\nmission. It is an honor and a privilege to work with such a talented and dedicated group of\npeople.\n\n\f–7–\nWe thank the anonymous referee for several excellent suggestions that improved the\npaper.\nFacilities: The Kepler Mission, Tillinghast (TRES), NOT (FIES), McDonald 2.7-m\n(Coude Spectrograph), Keck:I (HIRES), WIYN (Speckle), Palomar Hale (PHARO/NGS)\n\nREFERENCES\nBakos, G. Á., et al. 2009, ApJ, in press (arXiv0907.3525B)\nBatalha, N., et al. 2010, ApJ, this issue\nBorucki, W. J., et al. 2010a, Science, Submitted\nBorucki, W. J., et al. 2010b, ApJ, this issue\nBurke, C. J., et al. 2007, ApJ, 671, 2115\nGautier, T. N., et al. 2010, ApJ, this issue\nGilliland, R. L., et al. 2010a, PASP, in press\nGilliland, R. L., et al., 2010b, ApJ, Submitted\nHaas, M. R., et al. 2010, ApJ, this issue\nJenkins, J. M., et al. 2010a, ApJ, this issue\nJenkins, J. M., et al. 2010b, ApJ, this issue\nKoch, D. G., et al. 2010a, ApJ, this issue\nKoch, D. G., et al. 2010b, ApJ, this issue\nLatham, D. W. 2003. In Scientific Frontiers in Research on Extrasolar Planets, ASP Conf.\nSer. 294, eds. D. Deming & S. Seager (San Francisco: ASP), 409\nMandel, K., & Agol, E. 2002, ApJ, 580, L171\nMandushev, G., et al. 2005, ApJ, 621, 1061\nMonet, D., et al. 2010, ApJ, this issue\nNaef, D., et al. 2001, A&A, 375, L27\n\n\f–8–\nNutzman, P., et al. 2010, ApJ, Submitted\nValenti, J. A., & Piskunov, N. 1996, A&AS, 118, 595\nWinn, J. N., et al. 2009, ApJ, 703, 2091\n\nThis preprint was prepared with the AAS LATEX macros v5.2.\n\n\f–9–\n\nFig. 1.- The detrended light curve for Kepler-6. The time series for the entire data set is\nplotted in the upper panel. The lower panel shows the photometry folded by the 3.234723day period. The model fit to the primary transit is overplotted in red (vertical axis on the\nleft), and our attempt to fit a corresponding secondary eclipse is shown in green with the\nexpanded and offset scale on the right.\n\n\f– 10 –\n100\n\nRadial velocity (m s-1)\n\n50\n\n0\n\nBisector\nvar. (m s-1) Residual (m s-1)\n\n-50\n\n15\n0\n-15\n15\n0\n-15\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\nPhase\n\nFig. 2.- The orbital solution for Kepler-6. The observed radial velocities obtained with\nHIRES on the Keck 1 Telescope are plotted in the top panel together with the velocity curve\nfor a circular orbit with the period and time of transit fixed by the photometric ephemeris.\nThe middle panel shows the residuals to the fit. The point potentially affected by the\nRossiter-McLaughlin effect is the one at the smallest phase. With this point omitted from\nthe fit the rms of the residuals is 5.7 m s−1 . The lower panel shows the line bisector variation.\nNo structure connected to the radial velocity curve is evident.\n\n\f– 11 –\n\nTable 1. Relative Radial-Velocity Measurements of Kepler-6\nBJD\n\n2454986.087289\n2454987.087348\n2454988.077695\n2454989.019649\n2454995.112273\n2455014.881155\n2455015.984052\n2455017.067098\n2455044.019956\n\nPhase\n\n0.769\n0.078\n0.384\n0.676\n0.559\n0.671\n0.012\n0.346\n0.679\n\nRV\n(m s−1 )\n+68.42\n−59.94\n−67.64\n+48.64\n+18.56\n+51.75\n−34.79\n−75.84\n+50.59\n\nσRV\n(m s−1 )\n4.48\n4.59\n4.75\n4.64\n4.79\n4.54\n4.65\n4.94\n5.42\n\n\f– 12 –\n\nTable 2. System Parameters for Kepler-6\nParameter\n\nValue\n\nNotes\n\n3.234723 ± 0.000017\n2454954.48636 ± 0.00014\n7.05+0.11\n−0.06\n0.09829+0.00014\n−0.00050\n0.398+0.020\n−0.039\n86.◦ 8 ± 0.3\n80.9 ± 2.6\n0 (adopted)\n−18.3 ± 3.5\n\nA\nA\nA\nA\nA\nA\nA,B\nA,B\nA,B\n\n5647 ± 44\nFixed at transit value\n+0.34 ± 0.04\n3.0 ± 1.0\n−49.14 ± 0.10\n\nC\nC\nC\nC\nB\n\n1.209+0.044\n−0.038\n1.391+0.017\n−0.034\n4.236 ± 0.011\n1.99+0.24\n−0.21\n3.8 ± 1.0\n\nC,D\nC,D\nC,D\nC,D\nC,D\n\n0.669+0.025\n−0.030\n1.323+0.026\n−0.029\n0.352+0.018\n−0.022\n2.974+0.016\n−0.022\n0.04567+0.00055\n−0.00046\n1500 ± 200\n\nA,B,C,D\nA,B,C,D\nA,B,C,D\nA,B,C\nE\nF\n\nTransit and orbital parameters\nOrbital period P (d)\nMidtransit time E (HJD)\nScaled semimajor axis a/R⋆\nScaled planet radius RP /R⋆\nImpact parameter b ≡ a cos i/R⋆\nOrbital inclination i\nOrbital semi-amplitude K (m s−1 )\nOrbital eccentricity e\nCenter-of-mass velocity γ (m s−1 )\nObserved stellar parameters\nEffective temperature Teff (K)\nSpectroscopic gravity log g (cgs)\nMetallicity [Fe/H]\nProjected rotation v sin i (km s−1 )\nMean radial velocity (km s−1 )\nDerived stellar parameters\nMass M⋆ (M⊙ )\nRadius R⋆ (R⊙ )\nSurface gravity log g⋆ (cgs)\nLuminosity L⋆ (L⊙ )\nAge (Gyr)\nPlanetary parameters\nMass MP (MJ )\nRadius RP (RJ , equatorial)\nDensity ρP (g cm−3 )\nSurface gravity log gP (cgs)\nOrbital semimajor axis a (AU)\nEquilibrium temperature Teq (K)\n\nNote. -\nA: Based on the photometry.\nB: Based on the radial velocities assuming an elliptical orbit.\nC: Based on an SME analysis of the HIRES spectra.\nD: Based on the Yale-Yonsei stellar evolution tracks.\nE: Based on Newton's version of Kepler's Third Law and total mass.\nF: Assumes Bond albedo = 0.1 and complete redistribution. The uncertainty\nreflects the uncertainties in these assumptions.\n\n\f"}