{"id": "http://arxiv.org/abs/1111.6313v1", "guidislink": true, "updated": "2011-11-27T22:54:11Z", "updated_parsed": [2011, 11, 27, 22, 54, 11, 6, 331, 0], "published": "2011-11-27T22:54:11Z", "published_parsed": [2011, 11, 27, 22, 54, 11, 6, 331, 0], "title": "Multiwavelength Characteristics of Period-Luminosity Relations", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.5381%2C1111.3327%2C1111.6756%2C1111.6310%2C1111.3491%2C1111.2908%2C1111.2959%2C1111.4131%2C1111.6296%2C1111.3836%2C1111.3972%2C1111.5547%2C1111.5731%2C1111.2796%2C1111.6313%2C1111.6644%2C1111.4629%2C1111.6925%2C1111.4424%2C1111.3564%2C1111.6830%2C1111.7078%2C1111.4099%2C1111.4792%2C1111.5039%2C1111.5423%2C1111.0682%2C1111.3438%2C1111.3043%2C1111.1722%2C1111.2896%2C1111.1002%2C1111.5352%2C1111.3931%2C1111.6670%2C1111.5719%2C1111.3854%2C1111.5600%2C1111.1543%2C1111.4780%2C1111.4380%2C1111.4524%2C1111.4233%2C1111.1851%2C1111.5582%2C1111.3966%2C1111.5225%2C1111.1928%2C1111.4521%2C1111.5195%2C1111.3907%2C1111.6364%2C1111.3331%2C1111.1653%2C1111.5850%2C1111.0823%2C1111.2688%2C1111.1148%2C1111.5116%2C1111.5827%2C1111.3755%2C1111.2984%2C1111.0529%2C1111.0946%2C1111.5032%2C1111.1120%2C1111.1366%2C1111.0400%2C1111.6268%2C1111.2210%2C1111.6538%2C1111.5150%2C1111.2217%2C1111.3635%2C1111.7192%2C1111.6540%2C1111.1841%2C1111.0299%2C1111.6575%2C1111.1896%2C1111.1513%2C1111.0340%2C1111.5190%2C1111.6659%2C1111.1864%2C1111.5074%2C1111.2503%2C1111.6836%2C1111.4994%2C1111.6168%2C1111.6247%2C1111.4366%2C1111.1448%2C1111.2892%2C1111.3445%2C1111.7246%2C1111.0586%2C1111.5953%2C1111.0900%2C1111.2905%2C1111.4053&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Multiwavelength Characteristics of Period-Luminosity Relations"}, "summary": "We present a physically motivated explanation for the observed, monotonic\nincrease in slope, and the simultaneous (and also monotonic) decrease in the\nwidth/scatter of the Leavitt Law (the Cepheid Period-Luminosity (PL) relation)\nas one systematically moves from the blue and visual into the near and\nmid-infared. We calibrate the wavelength-dependent, surface-brightness\nsensitivities to temperature using the observed slopes of PL relations from the\noptical through the mid-infrared, and test the calibration by comparing the\ntheoretical predictions with direct observations of the wavelength dependence\nof the scatter in the Large Magellanic Cloud Cepheid PL relation. In doing so\nwe find the slope of the Period-Radius (PR) relation is c = 0.724 +/- 0.006.\nInvestigating the effect of differential reddening suggests that this value may\nbe overestimated by as much as 10%; however the same slope of the PR relation\nfits the (very much unreddened) Cepheids in IC1613, albeit with lower\nprecision. The discussion given is general, and also applies to RR Lyrae stars,\nwhich also show similarly increasing PL slopes and decreasing scatter with\nincreasing wavelength.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.5381%2C1111.3327%2C1111.6756%2C1111.6310%2C1111.3491%2C1111.2908%2C1111.2959%2C1111.4131%2C1111.6296%2C1111.3836%2C1111.3972%2C1111.5547%2C1111.5731%2C1111.2796%2C1111.6313%2C1111.6644%2C1111.4629%2C1111.6925%2C1111.4424%2C1111.3564%2C1111.6830%2C1111.7078%2C1111.4099%2C1111.4792%2C1111.5039%2C1111.5423%2C1111.0682%2C1111.3438%2C1111.3043%2C1111.1722%2C1111.2896%2C1111.1002%2C1111.5352%2C1111.3931%2C1111.6670%2C1111.5719%2C1111.3854%2C1111.5600%2C1111.1543%2C1111.4780%2C1111.4380%2C1111.4524%2C1111.4233%2C1111.1851%2C1111.5582%2C1111.3966%2C1111.5225%2C1111.1928%2C1111.4521%2C1111.5195%2C1111.3907%2C1111.6364%2C1111.3331%2C1111.1653%2C1111.5850%2C1111.0823%2C1111.2688%2C1111.1148%2C1111.5116%2C1111.5827%2C1111.3755%2C1111.2984%2C1111.0529%2C1111.0946%2C1111.5032%2C1111.1120%2C1111.1366%2C1111.0400%2C1111.6268%2C1111.2210%2C1111.6538%2C1111.5150%2C1111.2217%2C1111.3635%2C1111.7192%2C1111.6540%2C1111.1841%2C1111.0299%2C1111.6575%2C1111.1896%2C1111.1513%2C1111.0340%2C1111.5190%2C1111.6659%2C1111.1864%2C1111.5074%2C1111.2503%2C1111.6836%2C1111.4994%2C1111.6168%2C1111.6247%2C1111.4366%2C1111.1448%2C1111.2892%2C1111.3445%2C1111.7246%2C1111.0586%2C1111.5953%2C1111.0900%2C1111.2905%2C1111.4053&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present a physically motivated explanation for the observed, monotonic\nincrease in slope, and the simultaneous (and also monotonic) decrease in the\nwidth/scatter of the Leavitt Law (the Cepheid Period-Luminosity (PL) relation)\nas one systematically moves from the blue and visual into the near and\nmid-infared. We calibrate the wavelength-dependent, surface-brightness\nsensitivities to temperature using the observed slopes of PL relations from the\noptical through the mid-infrared, and test the calibration by comparing the\ntheoretical predictions with direct observations of the wavelength dependence\nof the scatter in the Large Magellanic Cloud Cepheid PL relation. In doing so\nwe find the slope of the Period-Radius (PR) relation is c = 0.724 +/- 0.006.\nInvestigating the effect of differential reddening suggests that this value may\nbe overestimated by as much as 10%; however the same slope of the PR relation\nfits the (very much unreddened) Cepheids in IC1613, albeit with lower\nprecision. The discussion given is general, and also applies to RR Lyrae stars,\nwhich also show similarly increasing PL slopes and decreasing scatter with\nincreasing wavelength."}, "authors": ["Barry F. Madore", "Wendy L. Freedman"], "author_detail": {"name": "Wendy L. Freedman"}, "author": "Wendy L. Freedman", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0004-637X/744/2/132", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1111.6313v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1111.6313v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "16 pages including 3 Figures", "arxiv_primary_category": {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1111.6313v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1111.6313v1", "journal_reference": null, "doi": "10.1088/0004-637X/744/2/132", "fulltext": "Accepted: ApJ, November 2011\n\nMultiwavelength Characteristics of Period-Luminosity Relations\n\narXiv:1111.6313v1 [astro-ph.SR] 27 Nov 2011\n\nBarry F. Madore & Wendy L. Freedman\nObservatories of the Carnegie Institution of Washington\n813 Santa Barbara St., Pasadena, CA 91101\nbarry@obs.carnegiescience.edu, wendy@obs.carnegiescience.edu\nABSTRACT\nWe present a physically motivated explanation for the observed, monotonic\nincrease in slope, and the simultaneous (and also monotonic) decrease in the\nwidth/scatter of the Leavitt Law (the Cepheid Period-Luminosity (PL) relation)\nas one systematically moves from the blue and visual into the near and midinfared. We calibrate the wavelength-dependent, surface-brightness sensitivities\nto temperature using the observed slopes of PL relations from the optical through\nthe mid-infrared, and test the calibration by comparing the theoretical predictions with direct observations of the wavelength dependence of the scatter in the\nLarge Magellanic Cloud Cepheid PL relation. In doing so we find the slope of\nthe Period-Radius (PR) relation is c = 0.724 ± 0.006. Investigating the effect of\ndifferential reddening suggests that this value may be overestimated by as much\nas 10%; however the same slope of the PR relation fits the (very much unreddened) Cepheids in IC 1613, albeit with lower precision. The discussion given is\ngeneral, and also applies to RR Lyrae stars, which also show similarly increasing\nPL slopes and decreasing scatter with increasing wavelength.\nSubject headings: Stars: variable: Cepheids – Stars: fundamental parameters –\nStars: variable: RR Lyrae\n.\n\n\f–2–\n1.\n\nIntroduction\n\nThe Period-Luminosity (PL) relation for Classical Cepheids is a 2-dimensional projection\nof the higher-order Period-Luminosity-Color (PLC) relation. The PLC relation, in turn, is\na finite portion of a plane, a so-called strip, embedded in the 3-dimensional space of period,\nluminosity and color. This strip is defined and delimited by physical limits (on temperature\nand luminosity) within which the atmospheres of these stars are found to be pulsationally\nunstable. A graphical representation of how these various projections arise and are interrelated was first given in Figure 3 of Madore & Freedman (1991). From this perspective it\nis clear that the width and orientation of the PLC strip in 3-dimensional space will have\ndirect and profound influence on the measured properties of the 2D relations, projected\nand multiply transformed to observable (wavelength-dependent) quantities (magnitudes and\ncolors).\nIt has long been known that the intrinsic width of the Cepheid Period-Luminosity (PL)\nrelation (as commonly parameterized by its formal dispersion) decreases as a function of increasing wavelength (see, for example, Madore & Freedman 1991 for the optical, McGonegal\net al. 1982 for the near-infrared; and more recently Madore et al. 2009 for applications in\nthe mid-infared). What is less commonly noted, although just as obvious, is the fact that\nthe slope of the Cepheid PL relation does the opposite, and increases systematically with\nincreased wavelength. This anti-correlation of slope and dispersion is shown in Figure 1,\nwhich is an updated and expanded version of a plot first presented as Figure 6 in Madore &\nFreedman (1991). Scatter is the quantity of most interest when any such relation is being\nused for distance determinations. The slope, on the other hand, is of little or no consequence\nin most practical applications. In the following, however, we show that the behavior of these\ntwo quantities, slope and scatter, share a common physical explanation, and that they can\nbe readily understood (i.e., predicted) from first principles. Moreover, there may indeed be\nsome practical implications arising from this realization.\n\n2.\n\nAn Analytic Approach\n\nThe total luminosity of a radiating object is the product of its total (radiating) area\ntimes the mean surface brightness of that area. Generalizing the Stefan-Boltzmann Law to\na monochromatic (rather than bolometric) observation can be done by parameterizing the\nsurface brightness by some power, aλ , of the effective temperature, Te . Thus, the entire (i.e.,\ninfinite) planar extent of the color-magnitude diagram is mapped by\n\n\f–3–\n\nMλ = −2.5 logR2 − 2.5 × aλ logTe + bλ ... (1)\nwhere R is the radius of the star and λ is the wavelength of the observational bandpass.\nBy imposing the following linear \"constraints\" on the above equation one can then define\nthe (red/cool and blue/hot) boundaries of the instability strip: log R = c log P + d and\nlog Te = −e log P + f , where P is the period, and where it is to be noted that aλ , c and\ne are all numerically positive quantities. Applying these external constraints to the master\nequation (1) above (where fred and fblue are respectively the red and blue intercepts of the\nblue and red boundaries of the instability strip) gives\nMλred = [−5 c + 2.5 e aλ ] logP − 2.5 × [aλ × fred ] + bλ − 5 d ... (2a)\n\nMλblue = [−5 c + 2.5 e aλ ] logP − 2.5 × [aλ × fblue ] + bλ − 5 d ... (2b)\nThe full (wavelength-dependent) magnitude widths of the respective PL relations, |Mλ |\n(which are directly related and proportional to their intrinsic dispersions) are then found to\nbe\n|Mλ | = 2.5 × aλ |fblue − fred | ... (3)\nMoreover, the (central) ridge-line equation of the mean PL relation becomes (Mλred +Mλblue )/2\nor\nMλmean = [−5 c + 2.5 e aλ ] logP − 2.5 [aλ × fmean ] + bλ − 5 d] ... (4)\nwhere Fmean = (fred + fblue )/2.\nThe slopes of the corresponding (wavelength-dependent) PL relations are then\n∆Mλ /∆log P = Aλ = −5 c + 2.5 e aλ ... (5)\nThe explicit dependence1 of both the slope (through Equation 5) and the width/scatter\n(through Equation 3) on the same wavelength-dependent term, aλ , now becomes clear.\n1\n\nFor mathematical simplicity the above derivation implicitly assumes that the red and blue boundaries\nof the instability strip are parallel. The referee has pointed out that this may in fact not be the case, citing\nboth theoretical (Bono et al. 2000) and observational evidence (Tammann et al. 2003) to the contrary.\nHowever the main point of this exercise is to show that aλ is common to both Equations 3 and 5. Whether\n\n\f–4–\nAt fixed period, the total width of the PL relation at any given wavelength is simply the\ndifference of Equations 2a and 2b, with the formal dispersion being a fixed multiplicative\nfraction of that width. A quick check shows that for a temperature width of the Cepheid\ninstability strip of 700K (or ∆ log Te = 0.05) this corresponds to a color width of ∆(B −V ) =\n0.5 mag and a corresponding magnitude width of ∆MV = 0.8 mag. If the stars are uniformly\ndistributed within and across the strip this would correspond to a formal dispersion of\n√\nσV = 0.8/ 12 = ±0.23 mag, which compares well with the observed dispersion of ±0.27 mag\nfor the LMC V-band PL relation as given in Madore & Freedman (1991).\n\nthe multiplicative factor \"e\" in Equation 5 is the average of two different numbers (non-parallel boundaries)\nor identical numbers (parallel boundaries) does not change the main conclusion.\n\n\f–5–\n2.1.\n\nA Graphical Approach\n\nFigure 2 graphically captures the substance of the above cascade of equations, and\nvisually illustrates just how the slopes of the PL relations and their widths/dispersions are\ncoupled. Three PL relations are shown. The lower relation (labeled 3.6 at its terminal\npoint to the right of the diagram) represents a long-wavelength PL relation having the\ncharacteristic low scatter and a steep slope. The thick parallel lines (flanking each of the\nmean PL relations) represent the upper and lower boundaries of the instability strip as\nprojected into the period-luminosity plane. The light, dotted lines trace the mean relations.\nThe thick dashed lines running diagonally across each of the PL relations represent lines of\nconstant color/temperature.\nIt is important to note that the mapping of the PL relation at one wavelength into a PL\nrelation as observed at another wavelength is solely dependent on the differential response\nof surface brightness to temperature across the respective wavelengths (as parameterized bf\naλ in Equation 1). Hereafter color is taken to be synonymous with temperature. Given that\nthe influence of temperature on surface brightness is known to be an increasingly sensitive\nfunction of decreasing wavelength, and given that temperature is itself a generally decreasing\nfunction of increasing period (longer-period Cepheids are generally cooler than their shortperiod counterparts), the mapping of the 3.6μm PL relation into the B band is shown by the\ntwo thick arrows of decreasing amplitude in going from hot temperatures (the arrow above\nthe circled A) to cooler temperatures (the shorter arrow above the circled letter B). This\nsystematic decrease in the vector's magnitude with period (i.e., with mean temperature) is\nreadily seen to be responsible for the systematic decrease in the slope of the PL relation in\ngoing from longer to shorter wavelengths (as explicitly given in Equation 5).\nThe vectors originating from points in the long-wavelength PL relation having the same\ntemperature (as tracked by the dashed lines) have (by definition) exactly the same magnitude/length. Those vectors are shown terminating in the B-band PL relation just below\nthe circled letters C and D. In other words, the slope of the lines of constant temperature,\n∆mag/∆ logP, are independent of the wavelength of the PL relation.\nThere is a fixed temperature difference in crossing the instability strip at a given period.\nThis manifests itself as an increasingly larger magnitude width of the PL relation when\nobserved at progressively shorter and shorter wavelengths (as can be seen in Equation 3).\nThere is also, as noted above, a general decrease in temperature (increase in color)\nalong the PL relation as one increases the period. This results in the decreased magnitude\nof the correction for temperature as a function of period, which in turn manifests itself\nas a reduction of the overall slope of the PL relation as one goes to shorter and shorter\n\n\f–6–\nwavelengths.\nThe significant point here is that both of the above effects are controlled by a single\nphysical parameter, the temperature. Accordingly, an increased slope of the Cepheid PL\nrelation must be accompanied by a causally connected decrease in the intrinsic dispersion\nof the PL relation. The longer-wavelength PL relations will be steeper and their intrinsic\nscatter must be smaller than their shorter-wavelength counterparts.\n\n3.\n\nA Calibration and Tests\n\nLooking at Equation 4 more closely it is clear that the slope of the PL relation is\nmade up of two linearly additive, but physically independent parts: (1) a constant term\n\"5c\", which is essentially the slope of the Period-Radius (PR) relation converted into a\nPeriod-Area (PA) relation, and then cast into a magnitude (i.e., by multiplying log R by\n2 × -2.5), and (2) the slope of the Period-Color relation (i.e., −2.5 × e × (aλ1 − aλ2 )).\nIt is this last term that contains the wavelength-dependent index, aλ , characterizing the\nsensitivity of surface brightness to temperature variations for any given bandpass. If the\n(wavelength-independent) slope of the Period-Area relation is simply subtracted from the\n(wavelength-dependent) PL slopes one would be left with the purely wavelength-dependent,\nPeriod-Surface-Brightness relation (PSB) slope (for instance, transforming Equation 1 gives\nMλ + 2.5 logR2 = −2.5 × aλ logTe + bλ ). Given that the constant of proportionality between\nslopes of the PSB relations and their respective dispersions must be the same number,\nindependent of bandpass, we have then a means of determining the slope of the PA relation\nby demanding that the ratio of the PSB slope to PL dispersion must be constant and\nindependent of wavelength.\nPublished values of the slope of the PR relation have been recently tabulated by Molinaro\net al. (2010). Their own work suggests values of c ranging from 0.71 to 0.75, with historical\nvalues, drawn both from theory and observations, ranging more widely from 0.67 to 0.77.\nWe now explore the run of the aforementioned proportionality constant with bandpass,\nparameterized by the input slope of the PR relation. The abcissa in Figure 3 which is the\nratio of slope of the PL relation (Equation 5) to the dispersion in the PL relation (effectively\nEquation 3), will become independent of wavelength when the correct value of the scaled\nslope of the period-radius relation (i.e., -5c) is subtracted from the numerator, as given in\nColumn 3 of Table 1. The intent is to find a slope of the PR relation that minimizes any\nresidual trend of the proportionality constant with bandpass/wavelength. The circled dots\nin Figure 3 show that solution: no trend with bandpass (a formal slope of 0.000 ± 0.015)\nfor an input value of c = 0.721, and a resulting scatter (± 0.009) that is exceedingly small.\n\n\f–7–\nIn changing the slope of the PR relation to correspond to the Molinaro et al. limits, as\ngiven above, the two flanking solutions are realized. In both cases the dispersion is much\nenhanced, and there is a strong (and unphysical) trend seen with wavelength. This already\nsmall range in the PR slope (of only ±3% peak-to-peak) is now much more narrowly defined\nby the present study. Our final solution for the slope of the Cepheid Period-Radius relation\nand its error is c = 0.724 ± 0.006.\nThe results of the above fitting, now adopting a PR slope of 0.724, are given in Table\n1. The first column gives the bandpass, ranging from the blue to the mid-infrared, at which\neach fit was made. In the second column we list, in order of increasing wavelength, the\npublished slopes, Aλ (equal to −5c + 2.5eaλ ; see equations (4) and (5)) of PL relations taken\nfrom a merger of Madore & Freedman (1991) for the optical, Persson et al. (2009) for the\nnear-infrared, and Madore et al. (2009) for the mid-infrared. Column 3 gives the slope of\nthe PSB relation obtained by subtracting the constant and wavelength-independent slope of\nthe Period-Area relation (i.e., -5 × 0.724 = -3.62) from the respective PL slopes (as given\nin Column 2) leaving Aλ + 3.62 = 2.5eaλ . As already derived above, the multi-wavelength\nslopes of the PSB relations and the dispersion/widths of the PL relations must each be\nproportional to the same factor, aλ . As can be seen in Figure 3 the incorrect choice of the\nslope of the PR relation very quickly leads to a divergence with wavelength in the prediction\nof the scale factor (that must be independent of wavelength) required to convert the slope to\na scatter. This diagnostic diagram can therefore be used to find the wavelength-independent\nslope of the PR relation that best predicts the wavelength-dependent scatter in the observed\nPL relations from the optical BVRI to the near-infrared JHK bands.\nAs can be seen in Figure 3 for a value of c = 0.72 the Dispersion-to-Slope Ratio is\nindependent of wavelength and has a value of 0.316. Using this proportionality factor we\nconvert each of the wavelength-dependent PSB slopes to their corresponding wavelengthdependent PL-relation dispersions. These predicted dispersions are given in Column 4 of\nTable 1 (e.g., for a B-band Surface-Brightness slope of 1.19 the predicted dispersion in the\nB-band PL relation is 1.19 × 0.316 = 0.376 mag). Column 5 of Table 1 contains the observed\nPL relation dispersions, self-consistently taken from the same references cited above for the\nslopes of the PL relations. The correspondence of the predicted and observed dispersions is\nimpressive. A slight divergence occurs in the mid-infrared where the observed dispersions\nare upper limits, due to the fact that these magnitudes were derived from only two randomphase observations and that they contain additional scatter imposed by the back-to-front\ndepth and tilt of the LMC, whose Cepheids were used for these demonstrations.\nAn independent test using Cepheids in the Small Magellanic Cloud is compromised by\nthe extremely large geometric, extrinsically correlated scatter due to the extension of the\n\n\f–8–\nSMC along our line of sight; however, the somewhat more distant galaxy IC 1613 can be\nused for this purpose. In the paper by Antonello et al. (2006) there are 48 Cepheids with\ncomplete BVRI photometry having periods ranging from 3 to 42 days. We have used these\nobservations to derive the slopes and dispersions (the latter not having been published by\nthese authors) for the four PL relations. The results are shown graphically in the lower\nleft portion of Figure 2. The IC 1613 data are shown as filled dots enclosed by squares,\neach of which has an error bar derived from our calculated uncertainty on the slope at each\nwavelength. The points are plotted for an input value of the PR relation taken from the\nLMC solution. To within the uncertainties there is no obvious trend of the dispersion-toslope ratio for the IC 1613 Cepheids using the LMC PR relation. There is, however, a\nsystematic offset in the ratio which can be directly attributed to a narrower sampling of the\nCepheid instability strip by the IC 1613 Cepheids. The conclusion remains that the slope of\nthe PR relation is identical for these two galaxies. Extending the test to other systems with\na wider range of metallicities will be of interest. However, until GAIA produces pallalaxes\nfor a sufficiently large sample of Milky Way Cepheids calibrating this relation in the galaxy\nwill have to be postponed until secure reddenings and accurate distances are availbe for more\nthan a handful of galactic Cepheids.\n\n3.1.\n\nThe Effects of Differential Reddening\n\nDifferential reddening with the sample of (LMC) Cepheids used in this study will contribute to the observed scatter in the respective PL relations. This extrinsic contribution\nwill also decrease in its magnitude as a function of increasing wavelength, in parallel with the\ndecreased intrinsic width with wavelength driven temperature sensitivity. Here we explore\nthe systematics of differential reddening on this study.\nIndependent estimates of the total line-of-sight dispersion in the reddening to the LMC\n(e.g., Grieve & Madore 1986) suggests that σAV is on the order of ±0.10 mag. We have\nprogressively removed (in quadrature) increasing amounts of possible differential reddening\nbracketting this value, and iteratively re-solved for the input slope of the PR relation using\nthe minimum variance condition on the derived value the scaling factor \"c\". This was\nfollowed by visually confirming with the wavelength plots (individually corresponding to\nFigure 3) that there was no residual correlation with wavelength. For a one-sigma dispersion\nin the putative differential reddening of σAV = 0.10 mag the minimum dispersion on \"c\"\nwas found to be ±0.0040 for c = 0.754. Recall that the minimum dispersion for the solution\nwith no differential reddening correction was marginally smaller (at a value of 0.0036 for c\n= 0.724). The σAV correction of 0.10 mag results in a 4% change in the derived value of the\n\n\f–9–\nslope of the PR relation. Increasing the differential reddening correction to σAV = 0.20 mag\nmore than doubles the error on the fit taking it to 0.0074 for a minimization value of c\n= 0.792, which is now a 10% systematic shift in the derived value of the slope of the PR\nrelation.\nWe conclude that correcting for a reasonable amount of differential reddening (i.e.,\nσAV = 0.10 mag.) acts to systematically increase the slope of the derived PR relation (but\nby only 4% in this instance) at the expense of decreased precision in the final fit. However,\nthere is an alternative approach to dealing with differential reddening.\nThe Wesenheit function, W = V −R×(B−V ) (Madore 1976) is designed to eliminate the\neffects of dust (total and differential) by a judicious choice of scaled colors and magnitudes,\nadjusted to have reddening (in the color) exactly cancel extinction (in the magnitude), where\nR = AV /E(B − V ). But, that same formalsm of combining colors and magnitudes can\nalternatively be used to target and scale out the temperature variation across the PL relation\n(at fixed period), such that W ′ = V − β × (B − V ) where β is the slope of lines of constant\nperiod crossing the Cepheid instability strip within the color-magnitude diagram. In the\nabsence of differential reddening W ′ would have minimum dispersion when its slope is equal\nto the slope of the PA relation, namely \"5c\".\nFor the LMC Cepheids with B and V photometry we have examined the run of dispersion\nin W ′ as a function of β. It reaches a minimum dispersion of σW ′ = ±0.13 mag for β = 2.15,\nwhere the slope of the W ′ -Period relation is determined to be -3.48 ± 0.04. This would then\ncorrespond to a PR relation slope of c = 0.70 ± 0.01. Noting that the minimized scatter\nin W ′ is still larger than the scatter expected for the PA relation alone, and larger than\nthe scatter seen at longer wavelengths (± 0.08 mag), it is probable that photometric errors,\ncombined with residual reddening effects, are limiting this determination. Nevertheless, the\nvalue of the slope of the PR relation inferred from this one application is also gratifyingly\nclose to recent direct determinations.\n\n4.\n\nDiscussion and Conclusions\n\nWhile it could have been predicted, it is only now that we know that the decreased width\nand the increased slope of the Cepheid PL relation, as a function of increased observing\nwavelength, is inevitable. Both effects are driven by the wavelength-dependent temperature\nsensitivity of stellar surface brightness. At the longest wavelengths the PL relation asymptotically parallels the (wavelength-independent) PR relation; at shorter wavelengths the PL\nrelation is increasingly dominated by the (highly wavelength dependent) surface-brightness\n\n\f– 10 –\nsensitivity to temperature.\nIt is of interest to use aspects of this formalism to put constraints on the slope of the PR\nrelation. Since the dispersion must be non-negative the slope of the PA relation cannot be\nbe shallower than the steepest (longest-wavelength) slope of the PL relation. The steepest\nslope in Table 1 is -3.49 seen at 8.0μm. This would require that the slope of the PR relation\nbe steeper than c = -0.70, since there must still be at least one power of Te flattening the\nslope of the PL relation, even at the longest-wavelength limit. Examination of the minimum\ndispersion solution of the generalized Wesenheit function gives a value of c = −0.70. And,\nmore comprehensively, by requiring that the run of dispersion-to-slope be independent of\nwavelength gives for LMC Cepheids c = −0.724 ± 0.006, a value that also fits the Cepheids\nin IC 1613.\nThe implications of this discussion are not confined to Classical Cepheids. For example,\nthe somewhat surprising (at the time) discovery by Longmore, Fernley & Jameson (1986)\nthat RR Lyrae stars obey a fairly steep and tightly-defined PL relation in the near infrared,\nas compared to the same stars whose optical magnitudes show almost no dependence on\nperiod, is directly explained by the same argument given here in the main text. Inspection\nof the plots given by Longmore, Fernley & Jameson (1986) would suggest that the scatter\nin the derived absolute magnitudes for RR Lyrae stars decreases by at least a factor of two\nin going from V to K as the slope of the PL relation rises from being essentially flat at\nV to having a value of about -2.5 at K. This observed trend is re-enforced and confirmed\nby multi-wavelength modelling of RR Lyrae stars by Catelan, Pritzl & Smith (2004) whose\nFigure 2 dramatically tracks the systematic change of increasing slope and decreasing scatter\noccurring progressively from the ultraviolet to the near infrared.\nOne note of caution is necessary. As the referee of this paper has suggested additional\n(magnitude) scatter may compromise these correlations in the case of RR Lyrae stars \"caused\nby off-ZAHB evolution (which depends in turn on HB type) rather than intrinsic effects.\"\nThe same caveat may apply to the Cepheids themselves given that stars of a given mass may\nmake several crossings of the instability strip giving rise to first-, second- and third-crossing\nscatter in period at a given luminosity and temperature.\nFinally, we note that changes in the mapping of temperature to surface brightness\nmight be modulated by additional physics, such as line blanketing changes in response to\natmospheric metallicity variations, or surface gravity, effects especially in the near ultraviolet,\netc. As such, both the intrinsic width and the slope of the Cepheid PL relation will each be\nphysically (and mathematically) forced to respond in a well determined fashion. If the slope\nis thought to be increased, say, at a given wavelength because of a metallicity difference, then\nthe prediction is that the intrinsic dispersion will be decreased, and vice versa. However,\n\n\f– 11 –\nuncertainties in differential reddening within any given Cepheid sample will always make\nthese higher-order tests challenging.\nAcknowledgements\nWe thank Eric Persson, Vicky Scowcroft and Mark Seibert for providing much valued\ncomments on early drafts of this paper.\n\n\f– 12 –\nReferences\nAntonello, E., Fossati, L., Fugazza, D, Mantegazza, L., & Gieren, W. 2006, å, 445, 901\nBono, G., Castellani, V., & Marconi, M. 2000, ApJ, 529, 293\nCatelan, M., Pritzl, B.J., & Smith, H.A. 2004, ApJS, 154, 633\nGrieve, G.R., & Madore, B.F. 1986, ApJS, 62, 427\nLongmore, A.J., Fernley, J.A. & Jameson, R.F. 1986, MNRAS, 220, 279\nMadore, B.F. 1976, Royal Greenwich Observatory Bulletins, 182, 153\nMadore, B.F. 2009, ApJ, 298, 304\nMadore, B.F., & Freedman, W.L. 1991, PASP, 103, 933\nMadore, B.F., Freedman, W.L., Rigby, J., Persson, S.E., Sturch, L., & Mager, V. 2009, ApJ,\n695, 988\nMcGonegal, R., McAlary, C.W., Madore, B.F. & McLaren, R.A. 1982, ApJ, 257, L33\nMolinaro, R., Ripepi, V., Marconi, M., Bono, G., Lub, J., Pedicelli, S., & Pel, J. W. 2010,\nastro-ph:1012.4376\nPersson, S.E., et al. 2009, AJ, 128, 2239\nTammann, G.A., Sandage, A.R., & Reindl, B. 2003, å, 404, 423\n\n\f– 13 –\n\nFig. 1.- Correlated trends in the observed slopes and widths of multi-wavelength PeriodLuminosity relations as a function of wavelength. The upper portion of the panel shows the\nmonotonic increase in the slope of the Cepheid PL relation with increasing wavelength of the\nbandpass. The lower portion of the figure shows the systematic decrease of the dispersion in\nthe PL relation as a function of increasing wavelength.\n\n\f– 14 –\n\nFig. 2.- Multi-Wavelength Period-Luminosity Relations. The three sets of upward-sloping solid parallel\nlines represent the boundaries of the Cepheid instability strip as projected into the period-luminosity plane\nat three different wavelengths (B, R and 3.6 μm). A line of constant period is vertical; a line of constant\nluminosity is horizontal. Not so obvious is the fact that a line of constant color/temperature is an upward\nsloping diagonal line, shown by dashed broken lines in each of the three PL relations illustrated here..\nThe heavy vertical line above the circled letter 'A', to the left (i.e. toward shorter periods) in the diagram,\nrepresents the large effect (at higher temperatures) of transforming the temperature sensitivity of the surface\nbrightness from the mid-infrared (3.6 μm) to the B band. The shorter, heavy vertical line above the circled\nletter 'B', shows the decreased effect of transforming the surface brightness at lower temperatures from\nthe mid-IR to the B band. This differential effect causes the B-band PL relation to have a systematically\nshallower slope than that of the mid-IR PL relation. The heightened sensitivity of the B band to fixed\ntemperature differences across the instability strip at any given period results in the significantly increased\nwidth of the B-band PL relation in comparison to the much smaller temperature-induced magnitude width\nat mid-IR wavelengths. The width increase and the slope decrease are both controlled by the same physics\n(the temperature sensitivity of the monochromatic surface brightness); they are deterministically coupled in\nthe sign and magnitude of their variations.\n\n\f– 15 –\n\nFig. 3.- The ratio of the dispersion in the Period-Luminosity relation to the corresponding\nslope of the Period Surface-Brightness relation, parameterized by the slope of the PeriodRadius relation, \"c\", and plotted as a function of bandpass (running from B through K as\nindicated across the top of the plot). For the LMC data (top) a value of c = 0.724 gives\nthe wavelength-independent (flat) correlation shown by the circled dots. The two flanking\nsolutions (open circles) illustrate solutions resulting from adopting the recently published\nextreme values of the slope of the PR relation (c = 0.71 and 0.75) as given by Molinaro et\nal. (2010). In the bottom left corner of the plot are shown BVRI data (dot-filled squares)\nfor Cepheids in IC 1613. They too have a flat correlation with wavelength for the same\ninput value of the LMC PR relation slope; however, the offset indicates that the width of\nthe IC 1613 instability strip appears to be about 30% narrower than the LMC.\n\n\f– 16 –\n\nTable 1. Predicted and Observed Wavelength-Dependent PL Dispersions\nBand\n(1)\n\nPL Slope\nAλ (obs)\n(2)\n\nSB Slope\nAλ (obs) + 3.62\n(3)\n\nσpredicted\n(mag)\n(4)\n\nσobs.\n(mag)\n(5)\n\nB\nV\nR\nI\nJ\nH\nK\n[3.6]\n[4.5]\n[5.8]\n[8.0]\n\n-2.43\n-2.76\n-2.94\n-3.06\n-3.15\n-3.23\n-3.26\n-3.40\n-3.35\n-3.44\n-3.49\n\n1.19\n0.86\n0.68\n0.56\n0.47\n0.39\n0.35\n0.22\n0.27\n0.18\n0.13\n\n0.376\n0.272\n0.215\n0.177\n0.149\n0.123\n0.111\n0.070\n0.085\n0.057\n0.041\n\n0.36\n0.27\n0.22\n0.18\n0.14\n0.12\n0.11\n<0.08\n<0.08\n<0.08\n<0.08\n\n\f"}