{"id": "http://arxiv.org/abs/1012.3050v1", "guidislink": true, "updated": "2010-12-14T15:00:00Z", "updated_parsed": [2010, 12, 14, 15, 0, 0, 1, 348, 0], "published": "2010-12-14T15:00:00Z", "published_parsed": [2010, 12, 14, 15, 0, 0, 1, 348, 0], "title": "A detailed spectroscopic analysis of the open cluster NGC 5460", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.3390%2C1012.3813%2C1012.3617%2C1012.0445%2C1012.0196%2C1012.3124%2C1012.4520%2C1012.4595%2C1012.5501%2C1012.5186%2C1012.5053%2C1012.3138%2C1012.2680%2C1012.0409%2C1012.0064%2C1012.2896%2C1012.1898%2C1012.0163%2C1012.1296%2C1012.5817%2C1012.0568%2C1012.0251%2C1012.1964%2C1012.2891%2C1012.1993%2C1012.4327%2C1012.2957%2C1012.2458%2C1012.0607%2C1012.0053%2C1012.5026%2C1012.2030%2C1012.2333%2C1012.1947%2C1012.4305%2C1012.0547%2C1012.3011%2C1012.4557%2C1012.2316%2C1012.1372%2C1012.5131%2C1012.5005%2C1012.4715%2C1012.2882%2C1012.0073%2C1012.5106%2C1012.3947%2C1012.4847%2C1012.3529%2C1012.5653%2C1012.3887%2C1012.5324%2C1012.3366%2C1012.4356%2C1012.5807%2C1012.3196%2C1012.5528%2C1012.1734%2C1012.1514%2C1012.2980%2C1012.4599%2C1012.3050%2C1012.1356%2C1012.1353%2C1012.2480%2C1012.3018%2C1012.0614%2C1012.5758%2C1012.4798%2C1012.5855%2C1012.1891%2C1012.0593%2C1012.2243%2C1012.4790%2C1012.1645%2C1012.3182%2C1012.3264%2C1012.4112%2C1012.1168%2C1012.2430%2C1012.2080%2C1012.0394%2C1012.3933%2C1012.3252%2C1012.2703%2C1012.3377%2C1012.4319%2C1012.3130%2C1012.5022%2C1012.3594%2C1012.6002%2C1012.4694%2C1012.5031%2C1012.3012%2C1012.4990%2C1012.1867%2C1012.1542%2C1012.5359%2C1012.0316%2C1012.0454%2C1012.1903&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A detailed spectroscopic analysis of the open cluster NGC 5460"}, "summary": "Within the context of a large project aimed at studying early F-, A- and late\nB-type stars we present the abundance analysis of the photospheres of 21\nmembers of the open cluster NGC 5460, an intermediate age cluster (logt ~ 8.2)\npreviously unstudied with spectroscopy. Our study is based on medium and high\nresolution spectra obtained with the FLAMES instrument of the ESO/VLT. We show\nthat cluster members have a nearly solar metallicity, and that there is\nevidence that the abundances of magnesium and iron are correlated with the\neffective temperature, exhibiting a maximum around Teff=10500 K. No\ncorrelations are found between abundances and projected equatorial velocity,\nexcept for marginal evidence of barium being more abundant in slower than in\nfaster rotating stars. We discovered two He-weak stars, and a binary system\nwhere the hotter component is a HgMn star. We provide new estimates for the\ncluster distance (720 +/- 50 pc), age (logt = 8.2 +/- 0.1), and mean radial\nvelocity (-17.9 +/- 5.2 km/s).", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.3390%2C1012.3813%2C1012.3617%2C1012.0445%2C1012.0196%2C1012.3124%2C1012.4520%2C1012.4595%2C1012.5501%2C1012.5186%2C1012.5053%2C1012.3138%2C1012.2680%2C1012.0409%2C1012.0064%2C1012.2896%2C1012.1898%2C1012.0163%2C1012.1296%2C1012.5817%2C1012.0568%2C1012.0251%2C1012.1964%2C1012.2891%2C1012.1993%2C1012.4327%2C1012.2957%2C1012.2458%2C1012.0607%2C1012.0053%2C1012.5026%2C1012.2030%2C1012.2333%2C1012.1947%2C1012.4305%2C1012.0547%2C1012.3011%2C1012.4557%2C1012.2316%2C1012.1372%2C1012.5131%2C1012.5005%2C1012.4715%2C1012.2882%2C1012.0073%2C1012.5106%2C1012.3947%2C1012.4847%2C1012.3529%2C1012.5653%2C1012.3887%2C1012.5324%2C1012.3366%2C1012.4356%2C1012.5807%2C1012.3196%2C1012.5528%2C1012.1734%2C1012.1514%2C1012.2980%2C1012.4599%2C1012.3050%2C1012.1356%2C1012.1353%2C1012.2480%2C1012.3018%2C1012.0614%2C1012.5758%2C1012.4798%2C1012.5855%2C1012.1891%2C1012.0593%2C1012.2243%2C1012.4790%2C1012.1645%2C1012.3182%2C1012.3264%2C1012.4112%2C1012.1168%2C1012.2430%2C1012.2080%2C1012.0394%2C1012.3933%2C1012.3252%2C1012.2703%2C1012.3377%2C1012.4319%2C1012.3130%2C1012.5022%2C1012.3594%2C1012.6002%2C1012.4694%2C1012.5031%2C1012.3012%2C1012.4990%2C1012.1867%2C1012.1542%2C1012.5359%2C1012.0316%2C1012.0454%2C1012.1903&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Within the context of a large project aimed at studying early F-, A- and late\nB-type stars we present the abundance analysis of the photospheres of 21\nmembers of the open cluster NGC 5460, an intermediate age cluster (logt ~ 8.2)\npreviously unstudied with spectroscopy. Our study is based on medium and high\nresolution spectra obtained with the FLAMES instrument of the ESO/VLT. We show\nthat cluster members have a nearly solar metallicity, and that there is\nevidence that the abundances of magnesium and iron are correlated with the\neffective temperature, exhibiting a maximum around Teff=10500 K. No\ncorrelations are found between abundances and projected equatorial velocity,\nexcept for marginal evidence of barium being more abundant in slower than in\nfaster rotating stars. We discovered two He-weak stars, and a binary system\nwhere the hotter component is a HgMn star. We provide new estimates for the\ncluster distance (720 +/- 50 pc), age (logt = 8.2 +/- 0.1), and mean radial\nvelocity (-17.9 +/- 5.2 km/s)."}, "authors": ["L. Fossati", "C. P. Folsom", "S. Bagnulo", "J. H. Grunhut", "O. Kochukhov", "J. D. Landstreet", "C. Paladini", "G. A. Wade"], "author_detail": {"name": "G. A. Wade"}, "author": "G. A. Wade", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1111/j.1365-2966.2011.18199.x", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1012.3050v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1012.3050v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Accepted for publication in MNRAS", "arxiv_primary_category": {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1012.3050v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1012.3050v1", "journal_reference": null, "doi": "10.1111/j.1365-2966.2011.18199.x", "fulltext": "Mon. Not. R. Astron. Soc. 000, 1–13 (2010)\n\nPrinted 9 November 2018\n\n(MN LATEX style file v2.2)\n\narXiv:1012.3050v1 [astro-ph.SR] 14 Dec 2010\n\nA detailed spectroscopic analysis of the open cluster NGC 5460⋆\nL. Fossati,1,2† C.P. Folsom,3 S. Bagnulo,3 J.H. Grunhut,4 O. Kochukhov,5\nJ.D.\nLandstreet,3,6 C. Paladini,1 G.A. Wade,4\n1\nInstitut für Astronomie, Universität Wien, Türkenschanzstrasse 17, 1180 Wien, Austria\nof Physics and Astronomy, Open University, Walton Hall, Milton Keynes MK7 6AA, UK\n3 Armagh Observatory, College Hill, Armagh BT61 9DG, Northern Ireland, UK\n4 Physics Dept., Royal Military College of Canada, PO Box 17000, Station Forces, K7K 4B4, Kingston, Canada\n5 Department of Physics and Astronomy, Uppsala University, 751 20, Uppsala, Sweden\n6 Department of Physics & Astronomy, University of Western Ontario, London, N6A 3K7, Ontario, Canada\n2 Department\n\nABSTRACT\n\nWithin the context of a large project aimed at studying early F-, A- and late B-type stars\nwe present the abundance analysis of the photospheres of 21 members of the open cluster\nNGC 5460, an intermediate age cluster (log t∼ 8.2) previously unstudied with spectroscopy.\nOur study is based on medium and high resolution spectra obtained with the FLAMES instrument of the ESO/VLT. We show that cluster members have a nearly solar metallicity, and\nthat there is evidence that the abundances of magnesium and iron are correlated with the effective temperature, exhibiting a maximum around T eff =10500 K. No correlations are found\nbetween abundances and projected equatorial velocity, except for marginal evidence of barium being more abundant in slower than in faster rotating stars. We discovered two He-weak\nstars, and a binary system where the hotter component is a HgMn star. We provide new estimates for the cluster distance (720 ± 50 pc), age (log t=8.2 ± 0.1), and mean radial velocity\n(−17.9 ± 5.2 km s−1 ).\nKey words: open clusters and associations: individual: NGC 5460 – stars: abundances\n\n1 INTRODUCTION\nThe photospheres of main sequence early F-, A- and late B-type\nstars display the signatures of different physical effects of comparable magnitudes, including large and relatively simple magnetic\nfields, strong surface convection, the presence of emission lines,\npulsation, diffusion of chemical elements under the competing influences of gravity and radiative acceleration, and various kinds of\nmixing processes, from small-scale turbulence to global circulation\ncurrents. Detailed studies of these stars are useful to explore and\nunderstand the physics of these various phenomena, most of which\ncertainly play a role in the atmosphere of all the other kinds of stars\nacross the Hertzsprung-Russell diagram, but are often more difficult to observe.\nThis work is a part of a large project aimed at setting constraints to the diffusion theory, by means of a systematic study of\nthe abundances of the chemical elements of early F-, A- and late Btype star that are cluster members. Cluster members are specially\ninteresting mainly for two reasons: 1) stars belonging to the same\ncluster were born from the same initial composition, and the comparison of the abundances of the chemical elements that compose\n\n⋆ Based on observations made with ESO Telescopes at the Paranal Observatory under programme ID 079.D-0178A\n† l.fossati@open.ac.uk\n\ntheir atmosphere may help to characterise how diffusion works for\ndifferent stellar masses and effective temperatures; 2) the age of\ncluster members can be determined with much higher accuracy\nthan for field stars, hence a systematic study of the abundances of\nthe chemical elements of F-, A- and B-type stars belonging to different clusters may help to identify the characteristic time-scales of\ndiffusion.\nUsing several instruments (FLAMES at ESO/VLT, FIES at the\nNordic Optical Telescope, ELODIE and SOPHIE at the Observatorie de Haute Provence, and ESPaDOnS at the CHFT), we have\nobtained low, medium, and high resolution spectra for about one\nthousand stars in the fields of view of a dozen of open clusters\nwith age ranging from log t=6.8 to 8.9, and with distance modulus between 6.4 and 14.2 (see Fossati et al. 2008a, for the full list\nof observed open clusters). One of our ongoing projects based on\nthese data is to perform accurate abundance analysis of early G,\nF, A, and late B-type cluster members, searching for a correlation\nbetween age and chemical composition of the stellar photospheres.\nAnalysis of individual clusters will be used to search for correlations between chemical composition, stellar temperature and stellar rotation. This project was started with a detailed study of the\nPraesepe cluster (Fossati et al. 2007, 2008b, 2010). Similar works\nperformed by other groups include the analysis of Coma Berenices\n(Gebran & Monier 2008), the Pleiades (Gebran et al. 2008), the\nHyades (Gebran et al. 2010) and NGC 6475 (Villanova et al. 2009).\n\n\f2\n\nL. Fossati et al.\n\nThe analysis of the open cluster NGC 5460 is the subject of this paper.\n\n2 OBSERVATIONS\nNGC 5460 is an intermediate age open cluster (log t=8.20±0.20,\nAhumada & Lapasset 2007)) that includes a large number of earlytype stars, covering a large range in stellar mass (up to about 4 M⊙ ).\nNGC 5460 is spectroscopically almost completely unstudied, except for a few polarimetric observations (Bagnulo et al. 2006).\nNGC 5460 was observed in service mode with FLAMES, the multiobject spectrograph attached to the Unit 2 Kueyen of the ESO/VLT,\non May 22 2007. The FLAMES instrument (Pasquini et al. 2002)\nis able to access targets over a field of view of 25 arcmin in diameter. With its MEDUSA fibers linked to the GIRAFFE spectrograph, FLAMES can acquire low or medium resolution spectra\n(R = 7 500 − 30 000) of up to 130 stars. GIRAFFE low resolution spectra cover wavelength ranges of 500 up to 1200 Å, while\nmid resolution spectra cover wavelength intervals of 170 – 500 Å,\nall within the visible range 3700–9000 Å. With the UVES fibers\nlinked to the red arm of the UVES spectrograph, FLAMES can simultaneously obtain high resolution spectra (R = 47 000) for up to\n8 stars, covering an interval range of about 2000 Å, centred about\n5200, or 5800, or 8600 Å.\n2.1 Instrument setups\nTaking into account that for the stellar parameter determination it\nis valuable to have observations of the hydrogen lines, and that the\nnumber of spectral lines (and the number of chemical elements\nthat may be analysed) increases towards shorter wavelengths, for\nFLAMES/UVES we adopted the 520 nm setting, which covers the\nwavelength region 4140–6210 Å. The telescope was guided at the\ncentral wavelength of this setting (5200 Å).\nTo minimise light losses due to the atmosphere differential refraction, for GIRAFFE we were forced to choose a setting with\ncentral wavelength not too far from 5200 Å. We selected the HR09\nsetting, which, with a resolving power of 25 900, covers the wavelength region 5139–5355 Å. Spectra obtained with this setting\ncover lines of a number of Fe-peak elements, such as iron, titanium and chromium, in addition to the Mg triplet at λλ ∼ 5167,\n5172 and 5183. UVES and GIRAFFE spectra were being taken\nsimultaneously. However, due to its lower spectral resolution, the\nGIRAFFE setting required a substantially shorter exposure time\nthan the UVES setting (for a given signal to noise ratio per spectral\nbin). While UVES shutter was still open, the extra-time that was\nleft available for observations with GIRAFFE was used to acquire\nan additional mid resolution spectrum, using setting HR11, and a\nlow resolution spectrum, adopting setting LR03. The setting HR11\ncovers the wavelength range 5592–5838 Å with a resolving power\nof 24 200. Spectra obtained with this setting cover iron, sodium\nand scandium lines, where the latter are important to classify Atype stars as Am chemically peculiar stars. Setting LR03 covers\nthe spectral range 4500–5077 Å with a resolving power of 7 500.\nThis setting was selected mainly to cover the Hβ line, used as primary indicator for the atmospheric parameters. As to make sure to\navoid saturation of the brightest targets, UVES observations were\ndivided into four sub-exposures, while for each of the GIRAFFE\nsettings we obtained two sub-exposures.\nOur data were obtained in service mode, and the package released to us included the products reduced by ESO with the instru-\n\nment dedicated pipelines. In this work we used the low and midresolution GIRAFFE data as reduced by ESO1 . Due to the high precision required for our investigation, we decided to repeat the data\nreduction of the UVES data. For this purpose we used the UVES\nstandard ESO-pipeline vers. 2.9.7 developed on the MIDAS platform vers. 08SEP patch level pl1.1. The pipeline included all the\nmain steps of calibration: bias subtraction, flat field correction and\nwavelength calibration.\n\n2.2 Target selection\nOur target list is the result of three selection processes. The first\nselection was performed when the FLAMES observing blocks\nwere prepared. The position of the Medusa fibers was determined\nby the Fiber Positioning System Software (FPOSS), which was\nfed with an input catalogue extracted from the UCAC2 catalogue (Zacharias et al. 2004) centred about (RA DEC) = (14:07:20\n−48:20:36). FPOSS maximises the number of observed stars, offering to the user the possibility to set different priorities to the targets. To the input catalogue we attached a priority list based on\ninformation obtained from the literature. We tried to give highest priority to stars of spectral type earlier than late G5, and\nthey were deemed as probable cluster members. Cluster membership was originally assessed using the works by Hog et al. (2000)\nKharchenko et al. (2004), Kharchenko et al. (2005), and Dias et al.\n(2006), all based mainly on the star's apparent proper motions.\nUVES fibers were positioned on four stars that, from previous literature (e.g. Landstreet et al. 2007), we suspected to be chemically\npeculiar with low υ sin i values. The remaining four UVES fibers\nwere placed to obtain sky spectra, as requested by FPOSS. We note\nthat the number of MEDUSA fibers was larger than the number\nof targets in our list of probable members, therefore we decided to\nplace all remaining free fibers on targets more or less randomly selected in the instrument field of view. For this reason the final number of observed targets was larger than our list of probable members\nAfter the observations were obtained, we performed a preliminary spectral analysis of all observed targets, and derived an\nestimate of the effective temperature, υ sin i, and radial velocities\n(see Sect. 3) from a quick analysis of the Hβ line observed with\nthe GIRAFFE LR03 setting. We then considered all targets with\nT eff >5400 K and radial velocity between −35 and 5 km s−1 , and\nwhich were included in our original higher priority list because,\nbased on proper motion criteria, were deemed probable cluster\nmembers. The radial velocity range [−35,−5] km s−1 was chosen\nbased on the previously published value of the mean cluster radial\nvelocity (−12.70 ± 2.18 km s−1 Kharchenko et al. 2005) and on our\npreliminary υr measurements of the observed brightest stars (considered fiducial cluster members). Out of 104 observed targets, we\nwere left with a list of 38 stars.\nFinally, we cross-checked our target list with the list of probable cluster members compiled by Claria et al. (1993) on the basis of\nphotometric measurements, and we removed another 14 stars from\nour list. In this process we considered as non cluster members also\nthe stars not listed in Claria's work. Table 1 lists the targets that\nhave survived our selection criteria.\nIn this paper we report the spectral analysis performed on the\n24 targets of Table 1, which are cluster members according to considerations based on proper motion, radial velocity, and photom-\n\n1\n\nsee the FLAMES web site (http://www.eso.org/sci/facilities/paranal/instrumen\nfor more details on the reduction of GIRAFFE data.\n\n\fA detailed spectroscopic analysis of the open cluster NGC 5460\n\n3\n\nTable 1. List of programme stars. The last three entries refer to SB2 stars for which no abundance analysis could be performed. The V magnitude is taken\nfrom Claria et al. (1993). The symbol * in the spectral type column (No. 4) means that this was inferred from our determined effective temperature. SNR (col.\n10) is the signal-to-noise ratio per spectral bin obtained with the GIRAFFE HR09/HR11/LR03 or the UVES 520 nm settings.\n\nSTAR\nHD 122983\nHD 123097\nHD 123182\nHD 123183\nHD 123184\nHD 123201B\nHD 123202\nHD 123226\nHD 123269\nCD-47 8868\nCD-47 8869\nCD-47 8889\nCD-47 8905\nCPD-47 6379\nCPD-47 6385\nUCAC 11104969\nUCAC 11105038\nUCAC 11105106\nUCAC 11105176\nUCAC 11105213\nUCAC 11105379\nHD 123225\nCl NGC 5460 BB 338\nUCAC 11105152\n\nClaria et\nal. (1993)\nident. #\n\nV\n\nSp.\nType\n\nProper motion\nDias et al.\n(2006) [mas/yr]\n\nMembership\nDias et al.\n(2006) [%]\n\nProper motion\nHog et al. (2000)\n[mas/yr]\n\nPkin/Pph/Psp\nKharchenko\net al. (2004)\n\nυr\n[km s−1 ]\n\nSNR\n\n142\n131\n87\n86\n81\n85\n79\n61\n31\n141\n136\n97\n58\n54\n59\n133\n125\n89\n91\n94\n36\n\n9.87\n9.30\n9.88\n10.11\n9.54\n9.55\n9.04\n9.15\n9.55\n10.66\n10.94\n10.76\n10.78\n10.17\n10.46\n12.01\n11.59\n11.69\n11.33\n11.83\n11.75\n\nB9\nB9\nB9\nA0\nA0\nB8\nB9\nB8\nB8\nA0\nA5*\nA0\nA0\nA0\nA0\nF1*\nA8*\nA8*\nA6*\nA8*\nA8*\n\n−5.6 ± 0.9; −0.8 ± 1.0\n−4.9 ± 1.1; −3.1 ± 1.2\n−5.8 ± 1.1; −3.2 ± 1.2\n−6.6 ± 1.3; 0.8 ± 1.3\n−4.9 ± 0.9; 2.4 ± 0.9\n−3.6 ± 1.3; −5.4 ± 1.3\n−4.0 ± 1.0; −1.9 ± 0.9\n−6.3 ± 1.2; −4.4 ± 1.1\n−7.1 ± 1.0; −2.8 ± 1.2\n−6.4 ± 1.4; 2.8 ± 2.4\n−4.9 ± 1.7; −0.6 ± 1.4\n−6.7 ± 1.4; −3.0 ± 2.2\n−5.4 ± 1.4; −3.2 ± 1.4\n−\n−5.3 ± 1.6; −2.5 ± 1.4\n−6.6 ± 2.1; −1.4 ± 1.7\n−5.3 ± 1.9; −0.2 ± 1.4\n−7.2 ± 1.4; 0.4 ± 1.4\n−7.4 ± 1.4; −1.0 ± 2.7\n−3.8 ± 2.9; −4.9 ± 1.4\n−6.8 ± 2.1; 2.4 ± 1.4\n\n60\n43\n44\n58\n51\n20\n57\n31\n44\n56\n60\n42\n44\n52\n57\n60\n52\n50\n30\n56\n\n−5.3 ± 1.1; −0.3 ± 1.1\n−4.6 ± 1.2; −2.4 ± 1.1\n−5.7 ± 1.2; −3.8 ± 1.4\n−6.7 ± 1.8; −0.4 ± 1.8\n−4.8 ± 1.2; −3.7 ± 1.1\n−5.0 ± 1.7; −5.6 ± 1.7\n−4.2 ± 1.1; −2.7 ± 1.1\n−5.9 ± 1.6; −6.3 ± 1.5\n−7.0 ± 1.2; −2.0 ± 1.2\n−6.3 ± 1.7; 2.4 ± 1.6\n−4.6 ± 1.7; 0.4 ± 1.7\n−7.9 ± 1.7; −5.1 ± 1.7\n−5.2 ± 2.1; −3.1 ± 2.0\n−\n−5.3 ± 2.0; −0.2 ± 1.9\n−7.9 ± 2.0; −0.6 ± 2.0\n−4.8 ± 1.9; 1.3 ± 1.9\n11.1 ± 2.2; 0.6 ± 2.2\n−6.6 ± 2.3; 1.1 ± 2.2\n−\n−5.4 ± 2.3; 2.1 ± 2.1\n\n0.69/0.66/1\n0.90/1.00/1\n0.98/1.00/1\n0.56/0.93/1\n0.63/1.00/1\n0.79/1.00/1\n0.68/1.00/1\n0.66/1.00/1\n0.56/1.00/1\n0.66/1.00/1\n0.89/1.00/1\n0.64/0.67/1\n0.97/0.64/1\n- / - /0.91/0.95/1\n- / - /- / - /- / - /- / - /- / - /- / - /-\n\n−24 ± 2\n−20 ± 2\n0±4\n−19 ± 7\n−15 ± 3\n−20 ± 5\n−19 ± 11\n−12 ± 1\n−20 ± 2\n−10 ± 9\n−16 ± 5\n−19 ± 4\n−18 ± 5\n−24 ± 7\n−19 ± 2\n−17 ± 3\n−20 ± 4\n−16 ± 3\n−17 ± 5\n−21 ± 3\n−21 ± 2\n\n159/178/213\n209/233/275\n148/165/195\n144 [UVES]\n195 [UVES]\n199 [UVES]\n247/275/323\n231/258/306\n185/211/243\n104/116/137\n96/106/125\n99/110/128\n100/111/131\n120/134/158\n123/135/162\n58/63/76\n69/78/94\n66/73/82\n78/87/104\n62/69/79\n65/72/87\n\n55\n60\n96\n\n9.01\n11.80\n11.55\n\nB9\nF*\nA*\n\n−4.9 ± 1.2; −2.9 ± 1.0\n−2.2 ± 1.4; −0.1 ± 1.4\n\n52\n48\n\n−6.0 ± 1.2; −2.4 ± 1.3\n-\n\n0.99/1.00/1\n- / - /-\n\n−2 ± 11 / − 53 ± 2\n−23 ± 6 / − 23 ± 1\n−23 ± 4 / − 15 ± 1\n\n207 [UVES]\n49/55/69\n70/79/93\n\netry, and have T eff >5400 K. We note that some early-type cluster\nmembers may have been missed while preparing the observations\n(either by accident, or because outside of the instrument field of\nview), and our selection based on radial velocity has left out some\nbinaries that are potentially cluster members. Therefore, Table 1\ncannot be considered a complete list of cluster members with spectral type earlier than G5.\n\n3 ABUNDANCE ANALYSIS\nModel atmosphere calculations were performed with the LLmodels stellar model atmosphere code (Shulyak et al. 2004), assuming Local Thermodynamical Equilibrium (LTE), plane-parallel\ngeometry, and modeling convection theory according to the\nCanuto & Mazzitelli (1991, 1992) model of convection (see\nHeiter et al. 2002, for more details). We used the VALD database\n(Piskunov et al. 1995; Kupka et al. 1999; Ryabchikova et al. 1999)\nas a source of atomic line parameters for opacity calculations.\nWe derived the fundamental parameters for each analysed star\nmainly by fitting synthetic line profiles, calculated with SYNTH3\n(Kochukhov 2007), to the observed hydrogen lines: Hβ and Hγ for\nthe stars observed with FLAMES/UVES, and Hβ for the stars observed with FLAMES/GIRAFFE. FLAMES/UVES spectra cover\neach the two hydrogen lines on more than one order, therefore we\nmerged the unnormalised orders before the normalisation, which\nwas performed with a low degree polynomial function. The Hβ\nlines, observed with FLAMES/GIRAFFE, were normalised with\na low degree polynomial function (usually of degree 4) to carefully\nselected continuum points. Our hydrogen line normalisation was\nperformed on the basis of continuum points which extend for several Angstroms both blueward and redward of the hydrogen line\nwings. This ensures a high quality continuum normalisation of the\n\nhydrogen lines, thanks also to the absence of instrumental artifacts,\nsuch as scattered light, which would strongly reduce the precision\nof the normalisation.\nFigure 1 shows a comparison between observed and synthetic Hβ line profiles for seven stars of various T eff observed with\nFLAMES/GIRAFFE.\nDue to the very broad temperature range covered by the analysed stars, the hydrogen lines were used as both temperature and\ngravity indicators, because at lower temperatures hydrogen lines\nare more sensitive to temperature variations, while at higher temperatures gravity has the larger influence. This is also reflected on\nour error bars on the fundamental parameters.\nSince with the fitting of the hydrogen line wings it was not\nalways possible to derive simultaneously both T eff and log g, we\nadopted also two other spectroscopic indicators based on the analysis of metallic lines. In particular, T eff was determined eliminating\nthe correlation between line abundance and the line excitation potential (χexcit ) for a given ion/element and the surface gravity was\ndetermined with the ionisation balance of several elements. In particular we adopted mainly Fe lines to derive both T eff and log g\nfrom metallic lines, adopting then Ti, Ca and Si lines (the latter for\nthe hotter stars of the sample) as secondary indicators. Given the\nfact that the number of measurable lines decreases with increasing\nυ sin i, for stars with a high projected rotational velocity we ended\nup adopting only Fe lines.\nNon-LTE effects might play an important role when measuring log g by imposing ionisation equilibrium. Fossati et al. (2009)\nconcluded that for solar metallicity early-type stars non-LTE effects for Fe are most likely to be negligible. Mashonkina (2011)\nperformed non-LTE calculations for Fe adopting the most complete\niron model atom currently existing, and concluding that for A-type\nmain-sequence stars non-LTE effects for FeI are less than 0.1 dex\nand negligible for FeII. Both Ti, Ca and Si are subject to non-LTE\n\n\f4\n\nL. Fossati et al.\nTable 2. Atmospheric parameters for the programme stars. The last six entries refer to SB2 stars for which only very few parameters could be estimated, and no abundance analysis was performed. The log g values given\nfor the two components of HD 123225 are assumed and not measured,\ntherefore it is not possible to give a realistic uncertainty to T eff as well. Due\nto the very few measurable spectral lines, υmic for HD 123202 is assumed.\n\nUCAC 11104969\n\n1.8\nUCAC 11105106\n\n1.6\n\nUCAC 11105176\n\nCPD-47 6385\n\nStar\nname\n\nCD-47 8868\n\nnormalised flux\n\n1.4\n\n1.2\nHD 123202\n\n1\n\nHD 123226\n\n0.8\n\n0.6\n\n0.4\n\nobserved spectrum\nsynthesised spectrum\n\n4800\n\n4850\n\no\n\n4900\n\nwavelength [A]\nFigure 1. Comparison between the observed Hβ line profile (thick lines)\nand synthetic line profile (thin lines) for seven stars observed with\nFLAMES/GIRAFFE. From top to bottom the stars here displayed are:\nUCAC 11104969 (T eff = 7050 K), UCAC 11105106 (T eff = 7500 K),\nUCAC 11105176 (T eff = 8100 K), CPD-47 6385 (T eff = 9350 K), CD47 8868 (T eff = 10400 K), HD 123202 (T eff = 11400 K) and HD 123226\n(T eff = 12400 K). Profiles are vertically offset for display purpose.\n\neffects, but we considered these elements only as secondary parameter indicator, giving most of the weight to what derived from Fe\nlines.\nFor the cooler stars we were not able to apply the method\nbased on line profile fitting of gravity-sensitive metal lines with\ndeveloped wings, usually adopted to derive log g for late-type stars\n(see e.g. Fuhrmann et al. 1997), because the low resolution of the\nFLAMES/GIRAFFE spectra caused too heavy blending of those\nlines.\nFor stars with a low υ sin i (υ sin i< 30 km s−1 ) LTE abundance\nanalysis was based on equivalent widths, analysed with a modified\nversion (Tsymbal 1996) of the WIDTH9 code (Kurucz 1993), while\nfor fast rotating stars we derived the LTE abundances by line profile\nfitting of carefully selected lines (see Fossati et al. 2007, for more\ndetails).\nThe microturbulence velocity (υmic ) was determined by minimising the correlation between equivalent width and abundance\nfor several ions, for the slowly rotating stars for which it was possible to measure the line equivalent widths, or following the procedure described in Fossati et al. (2008b) for fast rotators, except for\nHD 123202, for which we were not able to measure υmic , which we\nthen assumed to be 0.0 km s−1 , with an uncertainty of 1.0 km s−1 .\nBoth the projected rotational velocity (υ sin i) and υr were de-\n\nT eff\n[K]\n\nlog g\n[cgs]\n\nυmic\n[km s−1 ]\n\nυ sin i\n[km s−1 ]\n\nHD 122983\nHD 123097\nHD 123182\nHD 123183\nHD 123184\nHD 123201B\nHD 123202\nHD 123226\nHD 123269\nCD-47 8868\nCD-47 8869\nCD-47 8889\nCD-47 8905\nCPD-47 6379\nCPD-47 6385\nUCAC 11104969\nUCAC 11105038\nUCAC 11105106\nUCAC 11105176\nUCAC 11105213\nUCAC 11105379\n\n10700 ± 200\n12000 ± 300\n10800 ± 200\n10900 ± 250\n10900 ± 250\n11700 ± 250\n11400 ± 250\n12400 ± 300\n11600 ± 250\n10400 ± 200\n8400 ± 200\n10300 ± 200\n9700 ± 200\n11000 ± 250\n9350 ± 200\n7050 ± 150\n7650 ± 200\n7500 ± 200\n8100 ± 200\n7600 ± 200\n7700 ± 200\n\n4.00 ± 0.15\n3.96 ± 0.10\n4.25 ± 0.15\n4.05 ± 0.15\n4.25 ± 0.15\n3.95 ± 0.15\n3.70 ± 0.15\n4.04 ± 0.10\n3.94 ± 0.15\n4.20 ± 0.15\n3.60 ± 0.20\n4.15 ± 0.15\n4.10 ± 0.20\n4.30 ± 0.15\n4.12 ± 0.20\n4.00 ± 0.20\n4.00 ± 0.20\n4.00 ± 0.20\n4.00 ± 0.20\n4.00 ± 0.20\n4.00 ± 0.20\n\n1.0 ± 0.2\n1.5 ± 0.6\n0.0 ± 0.4\n0.6 ± 0.8\n0.0 ± 0.4\n0.0 ± 0.8\n0.0 ± 1.0\n0.0 ± 0.2\n0.0 ± 0.2\n0.9 ± 0.7\n1.2 ± 0.7\n0.5 ± 0.6\n1.6 ± 0.4\n1.7 ± 0.6\n1.6 ± 0.3\n1.4 ± 0.9\n3.4 ± 0.4\n2.5 ± 0.6\n1.8 ± 0.4\n1.9 ± 0.3\n2.1 ± 0.2\n\n35 ± 3\n133 ± 5\n81 ± 6\n275 ± 14\n60 ± 6\n202 ± 11\n301 ± 17\n17 ± 1\n25 ± 2\n250 ± 10\n230 ± 10\n113 ± 3\n160 ± 6\n136 ± 7\n55 ± 5\n260 ± 15\n85 ± 5\n195 ± 10\n125 ± 7\n57 ± 3\n44 ± 2\n\nHD 123225A\nHD 123225B\nNGC 5460 BB 338A\nNGC 5460 BB 338B\nUCAC 11105152A\nUCAC 11105152B\n\n13100 ± 8000 ± -\n\n±\n±\n\n12 ± 1\n20 ± 2\n140 ± 7\n<11 ± 1\n190 ± 10\n< 11 ± 1\n\n3.8 ± 4.0 ± -\n\ntermined by fitting synthetic spectra of several carefully selected\nlines on the observed spectrum.\nTable 2 lists the fundamental parameters derived for each analysed star in NGC 5460. For some stars a preliminary spectral classification is given here for the first time on the basis of the derived\nT eff . The uncertainties of T eff and log g, listed in Table 2, were determined from the hydrogen line fitting, our main source for the\nparameter determination, therefore the given error bars take into account the quality of the observed spectra and the sensitivity of the\nhydrogen line wings to both T eff and log g at different temperatures.\nTable 2 also shows that the uncertainties on T eff and log g depend on\nthe stellar υ sin i. This is due to the fact that we also adopted metallic lines to determine the atmospheric parameters and the precision\nwith which we determined the element/ion abundances decreases\nwith increasing υ sin i, for example because of the decreasing number of measurable lines for each ion.\nThe abundances obtained for each analysed star are shown in\nTable 3. The error bars are the standard deviations of the mean\nabundance derived from the individual line abundances, which include also the error bars in oscillator strengths determination given\nfor the laboratory data (Fossati et al. 2009).\nThe standard deviation of the mean underestimates the actual\nabundance error bars, since uncertainties on the atmospheric parameters should also be taken into account. In particular for the\nfast rotating stars, the uncertainty on υmic has a large impact on\n\n\fA detailed spectroscopic analysis of the open cluster NGC 5460\nthe total abundance uncertainty. For two stars with very similar\natmospheric parameters, but different υ sin i values (CPD-47 6385\nand CD-47 8905) we determined the element abundances adopting\nmodel atmospheres for which we increased each atmospheric parameter one at a time, by an amount representative of the whole\nsample of stars: 250 K for T eff , 0.2 for log g and 0.7 km s−1 for υmic .\nTable 4 shows the results of this test. For the slow rotator, the abundance error bar is highly dominated by the uncertainty on T eff , while\nfor the fast rotator, the uncertainty on υmic plays a crucial role. In\nboth cases the uncertainty on log g is almost negligible. This test\nalso shows the dependency of the abundance error bars on the lines\nselected to perform the abundance analysis: for the slow rotator the\nabundance error bars of Mg, Ti and Ba, due to the uncertainty on\nυmic , are rather large. This is due to the fact that most of the lines selected to measure the abundance of these three elements are strong\n(e.g. the Mg triplet at λλ ∼ 5167, 5172 and 5183), being therefore\nvery sensitive to υmic variations. Anyway, this effect is mitigated\nby the fact that for the slow rotators the uncertainty on υmic is not\nas large as 0.7 km s−1 , value chosen here to perform this test. Using\nthe propagation theory in Table 4 we considered the situation where\nthe determination of each fundamental parameter is an independent\nprocess, which in reality is not true, since there is a level of correlation between the various parameters. This makes the global uncertainties, given in columns five and nine of Table 4, upper limits.\nIn conclusion, following the results of this test and of the ones performed by Fossati et al. (2008b) and Fossati et al. (2009), we can\nsafely set a mean abundance uncertainty of 0.2 dex, for the slow\nrotators, which increases linearly with υ sin i, due to the increasing\nimportance of the υmic uncertainty in the total abundance error bar\nbudget. The mean abundance error bars, adopted for each star, are\nshown in the last column of Table 3.\nThe impact of systematic uncertainties is different for different\nelements, but it is out of the scope of this work to go in such details, since here we are mainly interested in general trends and only\nmarginally in the detailed abundance characteristics of each single star, which should require spectra with much higher resolution\nand signal-to-noise ratio (SNR), as demonstrated by Fossati et al.\n(2009).\n\n4 THE IMPACT OF SYSTEMATIC ERRORS\nThe scattering of the element abundance obtained from different\nlines provides only a lower limit for the actual error in the abundance determination. Systematic effects introduced by the normalisation to the continuum, and inaccurate T eff and log g estimates\nmay have a large impact. To explore the reliability of the error estimates of Table 3 we re-analysed a number of stars in a completely\nindependent way, using the Zeeman (Landstreet 1988; Wade et al.\n2001) spectrum synthesis code. This 'secondary' analysis helps to\nensure our results and estimated uncertainties are robust.\nThe Zeeman code performs polarised radiative transfer, under the assumption of LTE, using plane-parallel model atmospheres. Input LTE model atmospheres were calculated using atlas9 (Kurucz 1993), assuming solar abundances, which are a reasonable starting point as none of the stars in NGC 5460 show extreme chemical peculiarities. Input atomic data was drawn from\nthe VALD database, using an 'extract stellar' request, with effective temperature and surface gravity tailored to the specific star,\nand solar abundances.\nInitial values for temperatures and surface gravities were\nfound by fitting synthetic Balmer lines to the observations. These\n\n5\n\nFigure 2. Histogram of the difference of the abundances obtained with the\nsecondary and the standard analysis, divided by the error bar of the standard\nanalysis, listed in the last column of Table 3. The dashed lines correspond\nto a 3-σ difference.\n\nvalues were confirmed, and when possible refined, by fitting metallic lines with a range of ionisation states and excitation potentials.\nThe Balmer line fitting was performed by eye, though the metallic\nline fitting was done using χ2 minimisation.\nAbundances, υ sin i and υmic were determined by fitting a synthetic spectrum to the observation, using a Levenberg-Marquardt\nχ2 minimisation procedure. This was performed for 3 segments of\nspectrum between 100 Å and 500 Å long in the 4500–6000 Å region. The final best fit values reported here are averages over the\nindividual segments. Uncertainties are generally taken to be the\nstandard deviation. For elements with less then ∼ 3 useful lines,\nan uncertainty was estimated by eye, taking into account the scatter\nbetween lines, blending, and potential normalisation errors.\nBest fit results for the stars analysed with this method are presented in Table 5. Figure 2 shows the histogram of the difference\nof the abundances obtained with the secondary and the standard\nanalysis, divided by the error bar of the standard analysis (last column of Table 3). Generally the results are very consistent, with the\nabundances being within uncertainty of each other, at least within\na 1.5σ limit.\nThis secondary analysis supports also the conclusion that\nHD 123182 is chemically peculiar. A large Mn overabundance is\nconfirmed, though no Sc or Hg abundances could be derived. Our\nsecondary analysis confirms also that HD 123183 is a chemically\nnormal star, with a very high υ sin i, despite one published marginal\nmagnetic field detection. In both HD 123201B and HD 123184\ndiscrepancies in υ sin i were again detectable for lines with high\nexcitation potentials, particularly He lines. The secondary analysis\nconfirms both these stars are chemically normal.\n\n5 RESULTS\nOur υr measurements allowed us to derive the mean cluster radial velocity: −17.9 ± 5.2 km s−1 , obtained without taking into\n\n\f6\n\nL. Fossati et al.\n\nTable 3. Element abundances, in log(NX /Ntot ), of the analysed cluster member stars. The estimated internal errors in units of 0.01 dex and the number of lines\nselected for each element are given in parenthesis. For comparison, the last row shows the solar abundances by Asplund et al. (2005). Abundances obtained\nfrom just one line have no error (-;1). The column labelled as 'Uncertainty' shows the abundance uncertainty for each star, calculated following Fossati et al.\n(2008b), and which is taken into account in the discussion of the results.\nStar\nHD 122983\nHD 123097\nHD 123182\nHD 123183\nHD 123184\nHD 123201B\nHD 123202\nHD 123226\nHD 123269\nCD-47 8868\nCD-47 8869\nCD-47 8889\nCD-47 8905\nCPD-47 6379\nCPD-47 6385\nUCAC 11104969\nUCAC 11105038\nUCAC 11105106\nUCAC 11105176\nUCAC 11105213\nUCAC 11105379\nsun\nStar\nHD 122983\nHD 123097\nHD 123182\nHD 123183\nHD 123184\nHD 123201B\nHD 123202\nHD 123226\nHD 123269\nCD-47 8868\nCD-47 8869\nCD-47 8889\nCD-47 8905\nCPD-47 6379\nCPD-47 6385\nUCAC 11104969\nUCAC 11105038\nUCAC 11105106\nUCAC 11105176\nUCAC 11105213\nUCAC 11105379\nsun\nStar\nHD 122983\nHD 123097\nHD 123182\nHD 123183\nHD 123184\nHD 123201B\nHD 123202\nHD 123226\nHD 123269\nCD-47 8868\nCD-47 8869\nCD-47 8889\nCD-47 8905\nCPD-47 6379\nCPD-47 6385\nUCAC 11104969\nUCAC 11105038\nUCAC 11105106\nUCAC 11105176\nUCAC 11105213\nUCAC 11105379\nsun\n\nHe\n\nC\n\n-2.00(-;1)\n-0.90(-;1)\n-1.48(-;1)\n-0.90(05;3)\n-1.00(03;6)\n\nO\n\nNa\n\n-3.41(-;1)\n\n-3.47(-;1)\n-3.60(-;1)\n\n-1.02(05;2)\n-0.98(-;1)\n\n-3.41(-;1)\n-3.40(11;4)\n-3.28(01;3)\n-3.28(-;1)\n-3.41(01;2)\n\n-3.50(-;1)\n\n-3.27(13;5)\n-3.47(-;1)\n-3.38(14;3)\n\n-1.11\nCa\n\n-3.24(04;2)\n-3.49(12;3)\n-3.42(05;3)\n-3.65\n\nAl\n\nSi\n\n-6.19(-;1)\n-5.85(-;1)\n-5.43(-;1)\n\n-4.64(08;3)\n-4.58(16;3)\n-3.80(-;1)\n-5.27(16;2)\n-4.20(06;3)\n-4.03(11;3)\n-4.10(28;3)\n-4.28(02;3)\n-5.11(32;2)\n-4.86(07;3)\n-4.62(21;4)\n-4.45(03;3)\n-4.87(06;3)\n-4.69(03;3)\n-4.51\n\n-5.77(17;2)\n-5.76(-;1)\n\n-4.41(-;1)\n-4.54(01;2)\n-4.58(09;2)\n-4.37(19;2)\n-4.39(10;4)\n-4.52(01;2)\n-4.62(-;1)\n-4.63(-;1)\n-4.42(-;1)\n-4.52(-;1)\n-4.34(-;1)\n-4.52(17;2)\n-4.26(09;2)\n-4.77(45;2)\n-4.71(24;2)\n-3.58(-;1)\n-4.37(15;3)\n-4.09(21;2)\n-4.21(-;1)\n-4.27(13;3)\n-4.37(09;3)\n-4.53\n\nMn\n\n-3.38\n\n-5.69(04;2)\n-5.84(05;2)\n-5.87\n\nSc\n\nTi\n\nV\n\nCr\n\n-7.48(20;4)\n\n-7.37(13;3)\n-7.31(10;2)\n-6.87(08;5)\n-6.51(-;1)\n-6.88(14;8)\n-6.54(18;5)\n\n-7.76(-;1)\n-8.04\n\n-5.27(14;19)\n-6.78(12;2)\n-5.90(23;9)\n-5.81(01;2)\n-6.15(13;10)\n-5.99(14;4)\n-5.94(10;2)\n-6.63(12;6)\n-6.48(13;9)\n-6.40(25;4)\n-6.58(11;4)\n-6.16(09;5)\n-6.39(10;4)\n-5.15(15;4)\n-6.04(09;17)\n-6.76(15;6)\n-6.50(15;16)\n-6.81(09;10)\n-6.33(08;10)\n-6.27(15;24)\n-6.39(12;22)\n-6.40\n\nY\n\n-5.29(-;1)\n-5.77(-;1)\n\n-5.78(03;2)\n-6.13(06;2)\n\nMg\n-5.22(-;1)\n-4.55(36;3)\n-4.56(01;2)\n-4.30(16;3)\n-4.35(16;5)\n-4.29(10;5)\n\n-9.21(-;1)\n\n-5.35(-;1)\n\n-9.68(-;1)\n\n-5.30(09;4)\n-5.69(17;4)\n-6.23(09;8)\n-5.67(07;8)\n-5.86(06;4)\n-6.03(25;19)\n-5.89(14;15)\n-5.73\n\n-8.81(04;3)\n-9.43(-;1)\n-9.17(19;3)\n-8.56(22;2)\n-8.82(11;2)\n-9.23(09;4)\n-9.11(11;4)\n-8.99\n\n-7.27(-;1)\n-7.26(25;2)\n-7.04(15;2)\n-6.67(08;2)\n-7.07(13;3)\n-7.00(28;4)\n-7.12(22;4)\n-6.85(13;12)\n-7.48(32;5)\n-7.64(17;19)\n-7.44(14;10)\n-6.97(19;7)\n-7.16(04;13)\n-7.22(05;15)\n-7.14\n\nCu\n\nZn\n\nSr\n\n-9.81(-;1)\n\n-5.56(-;1)\n-5.70(-;1)\n\n-5.52(-;1)\n\n-5.35(-;1)\n\n-5.67\n\n-5.19(23;9)\n-6.10(-;1)\n\n-6.82(-;1)\n\n-5.99(03;2)\n-6.34(08;3)\n-6.83(14;3)\n-6.83(08;3)\n-6.35(17;3)\n-6.75(22;5)\n-6.78(12;4)\n-6.65\n\nFe\n\n-7.83\n\n-7.15(-;1)\n-7.75(-;1)\n-7.44\n\n-9.12\n\n-9.64(16;3)\n-9.87(13;2)\n-9.83\n\n-4.37(-;1)\n-4.58(-;1)\n-4.90\nNi\n\n-5.55(30;2)\n-5.65(65;5)\n-6.09(18;9)\n-6.04(04;3)\n-5.74(16;5)\n-5.67(16;15)\n-6.11(18;14)\n-5.81\n\n-5.86(-;1)\n-5.76(-;1)\n\nBa\n\nPr\n\nNd\n\nUncertainty\n\n-8.64(-;1)\n\n-7.57(20;3)\n\n-7.43(10;8)\n\n0.20\n0.26\n0.23\n0.34\n0.22\n0.30\n0.36\n0.20\n0.20\n0.33\n0.32\n0.25\n0.28\n0.26\n0.21\n0.34\n0.23\n0.30\n0.26\n0.22\n0.21\n\n-11.33\n\n-10.59\n\n-9.09(-;1)\n\n-9.70(-;1)\n\n-6.79(-;1)\n\n-4.77(17;6)\n-4.45(-;1)\n\n-3.81(12;100)\n-4.60(05;12)\n-4.20(14;60)\n-4.37(22;11)\n-4.29(14;57)\n-4.47(14;20)\n-4.50(07;5)\n-4.75(15;54)\n-4.57(16;60)\n-4.25(21;13)\n-4.50(10;15)\n-4.27(17;22)\n-4.43(15;21)\n-4.20(23;27)\n-4.38(09;59)\n-4.62(05;12)\n-5.08(13;91)\n-5.03(15;54)\n-4.80(12;61)\n-4.61(16;133)\n-4.74(16;129)\n-4.59\n\n-9.34(-;1)\n\n-8.64(03;2)\n\nS\n\n-8.17(11;2)\n-8.55(-;1)\n-9.18(16;2)\n-9.63(-;1)\n-10.10(-;1)\n-8.51(16;2)\n-9.35(16;2)\n-9.87\n\n\fA detailed spectroscopic analysis of the open cluster NGC 5460\n\n7\n\nTable 4. Error sources for the abundances of the chemical elements of CPD-47 6385 and CD-47 8905. Both stars have very similar atmospheric parameters\n(T eff ∼9500 K, log g∼4.1 and υmic ∼1.6 km s−1 ), but rather different υ sin i values, as shown in the second table line. Columns 2−4 and 6−8 give the variation\nin abundance estimated by increasing T eff by 250 K, log g by 0.1 dex, and υmic by 0.7 km s−1 , respectively. Columns 5 and 9 give the mean error calculated\napplying the standard error propagation theory on the systematic uncertainties given in Col. 2−4 and 6−8, i.e., σ2abn (syst.) = σ2abn (T eff ) + σ2abn (log g) +\nσ2abn (υmic ).\nCPD-47 6385\nυ sin i=55 km s−1\n\nCD-47 8905\nυ sin i=160 km s−1\n\nEl.\n\nσabn (T eff )\n(dex)\n\nσabn (log g)\n(dex)\n\nσabn (υmic )\n(dex)\n\nσabn (syst.)\n(dex)\n\nC\nMg\nAl\nSi\nCa\nSc\nTi\nCr\nMn\nFe\nNi\nBa\n\n0.15\n0.21\n0.00\n0.09\n0.25\n0.14\n0.08\n0.13\n0.23\n0.13\n0.10\n0.26\n\n−0.04\n−0.07\n0.06\n−0.03\n−0.04\n0.04\n0.01\n0.03\n−0.01\n0.00\n−0.03\n−0.07\n\n−0.01\n−0.15\n−0.03\n−0.04\n−0.09\n−0.03\n−0.17\n−0.08\n−0.03\n−0.08\n0.00\n−0.48\n\n0.15\n0.27\n0.07\n0.10\n0.27\n0.15\n0.19\n0.16\n0.23\n0.15\n0.10\n0.55\n\nσabn (T eff )\n(dex)\n\nσabn (log g)\n(dex)\n\nσabn (υmic )\n(dex)\n\nσabn (syst.)\n(dex)\n\n0.31\n\n−0.07\n\n−0.28\n\n0.42\n\n0.05\n\n−0.01\n\n−0.06\n\n0.08\n\n0.17\n0.17\n\n0.05\n0.06\n\n−0.31\n−0.19\n\n0.36\n0.26\n\n0.09\n\n0.04\n\n−0.16\n\n0.19\n\nTable 5. Best fit parameters from the comparison analysis with Zeeman. Chemical abundances are in units of log(NX /Ntot ). Elements marked with an asterisk\nare based on less than ∼ 3 useful lines and have uncertainties estimated by eye.\nHD 123182\n\nHD 123183\n\nHD 123184\n\nHD 123201B\n\nHD 123226\n\nCPD-476379\n\nCPD-476385\n\nT eff [K]\nlog g [cgs]\nυ sin i [km s−1 ]\nυmic [km s−1 ]\nVr [km s−1 ]\n\n10800 ± 300\n4.25 ± 0.2\n81 ± 4\n∼0\n−1 ± 6\n\n10500 ± 700\n4.3 ± 0.3\n270 ± 15\n∼0\n−18 ± 20\n\n10900 ± 120\n4.35 ± 0.2\n63.1 ± 1.5\n0.4 ± 0.22\n−14 ± 1\n\n12000 ± 450\n4.2 ± 0.3\n203 ± 6\n∼0\n−25 ± 13\n\n12140 ± 160\n4.27 ± 0.1\n18.1 ± 1.0\n0.5 ± 0.5\n−12 ± 1\n\n10100 ± 300\n4.15 ± 0.2\n140 ± 8\n1.02 ± 0.45\n−30 ± 3\n\n9360 ± 150\n4.12 ± 0.2\n56.1 ± 2.5\n1.8 ± 0.2\n−21 ± 1\n\nHe\nC\nO\nNa\nMg\nAl\nSi\nS\nCa\nSc\nTi\nV\nCr\nMn\nFe\nNi\nCu\nZn\nY\nBa\n\n−1.48 ± 0.4 *\n\n−1.05 ± 0.2 *\n\n−0.9 ± 0.2 *\n\n−3.54 ± 0.1\n\n−3.5 ± 0.2 *\n\n−0.9 ± 0.2 *\n−3.4 ± 0.2 *\n−3.3 ± 0.12\n\n−3.45 ± 0.2 *\n\n−3.57 ± 0.2 *\n\n−3.4 ± 0.21\n\n−4.5 ± 0.2\n−6.1 ± 0.5 *\n−4.7 ± 0.2\n\n−4.9 ± 0.4 *\n\n−4.49 ± 0.24\n−5.85 ± 0.4 *\n−4.71 ± 0.27\n\n−4.87 ± 0.06\n−5.65 ± 0.15\n−4.57 ± 0.08\n−4.92 ± 0.3 *\n\n−4.47 ± 0.17\n−5.68 ± 0.3 *\n−4.85 ± 0.15 *\n\n−3.3 ± 0.15 *\n−5.48 ± 0.2 *\n−4.40 ± 0.05\n−4.59 ± 0.1 *\n\n−5.67 ± 0.3 *\n−8.48 ± 0.2 *\n−6.87 ± 0.08\n\n−5.45 ± 0.15\n−8.81 ± 0.09\n−6.88 ± 0.06\n\n−5.53 ± 0.11\n\n−6.21 ± 0.14\n\n−4.16 ± 0.05\n\n−4.35 ± 0.15\n\n−4.5 ± 0.2 *\n\n−5.68 ± 0.4 *\n−6.88 ± 0.1\n\n−7.3 ± 0.4 *\n\n−6.24 ± 0.1\n−5.52 ± 0.1\n−4.31 ± 0.1\n\n−6.9 ± 0.4 *\n−4.4 ± 0.2\n\n−4.56 ± 0.14\n−5.6 ± 0.2 *\n−4.4 ± 0.11\n−4.4 ± 0.3 *\n−5.52 ± 0.27\n−8.8 ± 0.1\n−7.16 ± 0.12\n−8.4 ± 0.4 *\n−5.99 ± 0.11\n−6.4 ± 0.3 *\n−4.41 ± 0.14\n\n−7.26 ± 0.15\n\n−7.4 ± 0.1\n\n−6.67 ± 0.2\n\n−6.53 ± 0.05\n−6.72 ± 0.3 *\n−4.73 ± 0.05\n\n−4.66 ± 0.19\n\n−9.6 ± 0.4 *\n−9.6 ± 0.4 *\n\naccount the double line spectroscopic binaries (SB2) stars. This\nvalue agrees rather well with −12.70 ± 2.18 km s−1 , published by\nKharchenko et al. (2005), in particular taking into account that the\nlatter value is the average of the υr of only three stars.\nWe cannot exclude that some of the analysed stars are single\nline spectroscopic binaries (SB1), but this was impossible to establish with the available spectra.\n\n−9.19 ± 0.4 *\n−8.85 ± 0.4 *\n\nIn the following we describe more in detail the results obtained\nfor the most interesting objects.\n\n5.1 HD 122983\nThe star HD 122983 was observed by Bagnulo et al. (2006) to measure the longitudinal magnetic field, but no field was detected. The\n\n\fL. Fossati et al.\n\nabundance pattern shows that HD 122983 is a He-weak star, but it\nwas not possible to determine the kind of chemical peculiarity (e.g.\nHgMn star). Manganese lines are too shallow to be measured and\nnone of the covered mercury line is visible. A spectrum covering\nthe spectral region around 3900 Å would be extremely valuable to\ndetect the presence of Hg overabundance (Hubrig & Mathys 1996).\nWe looked also for the overabundance of elements characteristic of\nHgMn stars, such as P and Xe, but without results.\n\n1\n\n0.9\n\n0.8\n\nnormalised flux\n\n8\n\n0.7\n\n0.6\n\n0.5\n\nobserved spectrum\nTeff: 13100 K; logg: 3.8\nTeff: 8000 K; logg: 4.0\nsum\n\n5.2 HD 123182\n0.4\n\nThe abundance pattern of HD 123182 reveals that the star is most\nlikely a mild He-weak star, in particular it could be a hot Am star\nor a cool HgMn star. Sc lines are too weak to be measurable, so\nit is not possible to say whether it is underabundant or not. The\nnot extreme overabundance of Cr and Fe (as expected for the rather\nhigh υ sin i), and the fact that Hg, P and Xe are not visible (although\nlines would be covered) are in agreement with an Am classification.\nOn the other hand the clear Mn overabundance would tend more\nto a HgMn classification. On the basis of the available data we can\nonly conclude that HD 123182 is a He-weak star of an unclear type.\nThis star could also be a single line spectroscopic binary, due to the\nhigh radial velocity, compared to the one of the other cluster stars.\n\n5.3 HD 123183\nThe star HD 123183 was observed with FORS1 by Bagnulo et al.\n(2006) who published a marginal magnetic field detection of hBzi =\n−440 ± 146 G. The abundance pattern does not reveal any chemical\npeculiarity that could strengthen this detection. The very high υ sin i\nof 275 ± 14 km s−1 also goes against a classification of this object as\nchemically peculiar. For this reason we conclude that HD 123183\nis a chemically 'normal' early-type star. Given the very high υ sin i,\nit would be very valuable to perform new magnetic field measurements.\n\n0.3\n4850\n\n4855\n\n4860\n\n4865\n\no\n\n4870\n\n4875\n\nwavelength (A)\nFigure 3. Fit of the observed Hβ line profile for HD 123225. The red line\nshows the observed spectrum, while the dashed and dotted lines are the\nsynthetic spectra of the two components assuming T eff and log g of 13100 K\nand 3.8 for the hotter star and 8000 K ad 4.0 for the cooler star. The black\nsolid line shows the sum of the two synthetic spectra.\n\naddition to evidences of Hg lines, allowing to conclude that the primary component is a HgMn star. This conclusion is strengthened\nby the fact that we found several strong lines of both Ne, P and Xe,\ntypical of HgMn stars. For the secondary star it was not possible to\ndetermine whether it shows Am chemical peculiarities since the Sc\nlines are too shallow to be visible. In any case, the fact that the star\nseems to have Fe lines compatible with a solar iron abundance, let\nus believe that the secondary component is not an Am star.\nHD 123225 was observed with FORS1 by Bagnulo et al.\n(2006) and no magnetic field was detected.\n\n5.4 HD 123225\nThe FLAMES/UVES observations of HD 123225 revealed that this\nis a SB2 system, where both components appear to have a rather\nlow υ sin i. The spectral lines of the two components are well separated: υr of the first component is ∼ −2 km s−1 , while υr of the\nsecond component is ∼ −53 km s−1 . With only one available spectrum it was not possible to perform a precise abundance analysis,\nbut the large separation of the two components allowed to roughly\nestimate their T eff : 13100 K for the primary and 8000 K for the secondary star. These values were obtained from a fit of synthetic spectra on the observed Hβ profile (see Fig. 3), taking into account the\nexpected relative difference in flux due to the different stellar radii\nof the two components and assuming that both are main sequence\nstars (log g was set to 3.8 for the hotter star and to 4.0 for the cooler\nstar).\nThe υ sin i value of the primary star is ∼11 km s−1 , while for\nthe secondary star we derived a υ sin i value of ∼20 km s−1 . Given\nthe roughly determined T eff of the two components and their υ sin i,\nit is possible that both stars developed chemical peculiarities and in\nparticular HgMn peculiarities for the primary star and Am peculiarities for the secondary star. To reveal whether HgMn peculiarities\nare present in the primary star, we looked for typical signatures\npresent in HgMn stars. The spectrum reveals strong Mn lines in\n\n5.5 HD 123201B and HD 123184\nThe stars HD 123201B and HD 123184 are both chemically 'normal' early-type stars and share the common property of showing\na different υ sin i for the high χexcit lines, compared to the other\nspectral lines. The υ sin i of HD 123201B, measured on low χexcit\nlines, is ∼202 km s−1 , while He lines are best fit with a υ sin i of\n∼150 km s−1 . The same occurs for HD 123184, for which υ sin i is\n∼60 km s−1 , but He lines are best fit with a υ sin i of ∼50 km s−1 .\nFigure 4 shows the comparison between the observed spectrum and two synthetic line profiles with υ sin i = 60 and 50 km s−1\nin the region of the FeII line at ∼5018 Å and of the HeI multiplet at\n∼ 5875 Å for HD 123184. The plot shows that for the HeI multiplet\nthe adopted stellar υ sin i of 60 km s−1 is far too high, while a υ sin i\nof 50 km s−1 is necessary to fit the observed line profile. In contrast,\nthe region around the FeII line shows that a υ sin i of 60 km s−1 is\nrequired to fit this line. For both stars the He abundance was measured with the υ sin i determined for the He lines.\nThis effect is most likely a consequence of the fact that both\nstars are fast rotators with a rather small inclination of the rotation\naxis relative to the line of sight, leading to a temperature difference between the poles (hotter) and the equator (cooler) (von Zeipel\n1924).\n\n\fA detailed spectroscopic analysis of the open cluster NGC 5460\nHe I\n\nabundance relative to the Sun\n\nFe II\n\nnormalised flux\n\n1\n\n0.98\n\n0.96\n\n0.94\nobservation\nVsini = 50 km/s\nVsini = 65 km/s\n\n0.92\n5017\n\n5018\n\n5019\n\n5020\no\n\nwavelength [A]\n\n5874\n\n5875\n\n5876\n\no\n\n5877\n\n1.2\n\nA-type stars\nB-type stars\nF-type stars\n\n1\n0.8\n0.6\n0.4\n0.2\n0\n-0.2\n-0.4\n-0.6\n-0.8\nHe C\n\nO Na Mg Al Si\n\nS Ca Sc Ti V Cr Mn Fe Ni Zn Sr Y Ba\n\nelement\n\nwavelength [A]\n\nFigure 4. Comparison between the observed spectrum (thin line) and synthetic spectra calculated with υ sin i = 60 km s−1 (thick line) and υ sin i =\n50 km s−1 (thick dashed line) in the region of the FeII line at ∼5018 Å (left\nplot) and of the HeI multiplet at ∼5875 Å (right plot), for HD 123184.\n\n9\n\nFigure 5. Comparison between the mean abundances obtained for B-, Aand F-type stars indicated by an open square, circle and triangle respectively. The error bars are the standard deviations from the calculated mean\nabundances. The abundance patter of the mean F-type stars is corresponds\nto the abundance pattern of UCAC 11104969, since it is the only F-type\nstars of the sample with measured abundances.\n\n5.6 UCAC 11105038\nThis is an A-type star with a υ sin i of 85±5 km s−1 and a relatively\nhigh υmic of about 3.4 km s−1 . Both υ sin i and υmic could indicate a\npossible Am chemical peculiarity of this star, in particular υ sin i is\nbelow 90 km s−1 (Charbonneau & Michaud 1991), and υmic is typical of Am stars (Landstreet 1998; Fossati et al. 2008b). Both Ca\nand Sc abundances are below the solar values, as well as the Ba\noverabundance is indicative of Am chemical peculiarities, but the\nunderabundance of the Fe-peak elements goes against an Am classification.\n\n6 DISCUSSION\n6.1 Abundance patterns in NGC 5460: from F- to B-type\nstars\nFigure 5 shows the comparison among the mean abundance pattern\nobtained for B-, A- and F-type stars here analysed and considered\nmembers of the cluster. The error bars are the standard deviation\nfrom the mean abundance. In the whole sample, after the assignment of the cluster membership and binarity, only one F-type single\nstar, UCAC 11104969, was left in the sample, therefore the mean\nabundance of the F-type stars corresponds to the abundance pattern\nof UCAC 11104969.\nFigure 5 shows that the three abundance patterns are quite\nsimilar and concentrated around solar values except for a sulfur overabundance, which cannot be ascribed to non-LTE effects\n(Fossati et al. 2007), and for an apparent Am peculiarity of some\nelements in UCAC 11104969, excluded by the high υ sin i value\n(260±15 km s−1 ).\nAn important result of this work is the estimation of the cluster\nmetallicity (Z), spectroscopically never measured before. For the\nelements that most affect Z, such as C, O, Si, and Fe, we registered\na rather good agreement among the three stellar types, with the\nexception of the Si abundance of UCAC 111049692 , which was\nnot taken into account in the determination of Z. Since the cluster\n2\n\nthe star has a high υ sin i and the Si abundance was derived only from one\nline, making the Si abundance value rather uncertain\n\nmetallicity should be calculated on the basis of the abundances of\nthe cool stars (more mixed) and that only one F-type star is present\nin our sample, we decided to derive Z from the mean abundance of\nUCAC 11104969 and of the A-type stars with T eff 6 8500 K.\nThe cluster metallicity (Z) is defined as follows:\nP\nlog(Na /Ntot )\na>3 ma 10\n,\n(1)\nZcluster = P\nlog(Na /Ntot )\na>1 ma 10\nwhere a is the atomic number of an element with atomic mass\nma . Making use of the mean abundances, we derived a metallicity of Z = 0.014 ± 0.003, consistent with the solar Z (Z=0.012,\nAsplund et al. 2005), adopting solar abundances by Asplund et al.\n(2005) for all elements that were not analysed.\nThe Z value adopted by several other authors and used to characterise isochrones is calculated with the following approximation:\nZcluster ≃ 10([Fe/H]Fstars −[Fe/H]⊙ ) * Z⊙ ,\n\n(2)\n\nassuming Z⊙ =0.019, which is favored by the theoretical stellar\nstructure models based on (Anders & Grevesse 1989) solar abundances. We recalculated the Z value of NGC 5460, according to\n+0.008\nthis approximation, obtaining Z = 0.013−0.005\n, only about consistent with a solar metallicity. This value was derived from the\nmean Fe abundance of the seven stars taken into account ([Fe/H]\n= −0.18±0.22 dex). We believe that a solar metallicity would be\nanyway more appropriate for NGC 5460. The Fe underabundance\nof −0.18 dex is biased by two stars (out of a sample of seven)\nwhich show a considerable underabundance ([Fe/H]∼ −0.46 dex).\nOn the other hand, for the other five stars the iron abundance is\n+0.005\n[Fe/H]=−0.06±0.12 dex, which leads to Z = 0.017−0.004\n, that, given\nthe uncertainties, is perfectly consistent with a solar metallicity. In\naddition, Fig. 5 shows that the mean Fe abundance of the analysed\ncluster stars is well centered around the solar value.\n6.2 HR diagram\nWith the obtained effective temperatures and the magnitudes provided by Claria et al. (1993), we built the Hertzsprung-Russell\n(HR) diagram of the cluster (Fig. 6), adopting a distance modulus of 9.44 mag, a reddening of 0.092 mag (both values given by\n\n\fL. Fossati et al.\n\nAl abundance\n\nlog(L/Lsun)\n\n2\n\n1.5\n\n\"normal\" stars\nHe-weak stars\nZ=0.019; log(t)=8.20\nZ=0.013; log(t)=8.20\nZ=0.019; log(t)=8.10\nZ=0.019; log(t)=8.25\nZ=0.019; log(t)=8.30\n\n1\n\n4.1\n\n8000\n\n3.95\n\n3.9\n\nFigure 6. Hertzsprung-Russell diagram of NGC 5460. The crosses and\nfilled circles show the position on the HR diagram for the chemically peculiar and chemically normal stars, respectively. The error bar in luminosity\nis 0.10 dex. The full and dotted lines show isochrones from Marigo et al.\n(2008) for an age of log t = 8.20 with solar metallicity (Z = 0.019) and Z =\n0.013, respectively. The short dashed, thin dot-dashed line and long dashed\nline show solar metallicity isochrones of three different ages: log t = 8.10,\n8.25 and 8.30, respectively.\n\nTable 6. log L/L⊙ , logT eff , M/M⊙ and fractional age (τ) with associated\nerror bars for the stars of the NGC 5460 open cluster.\n\nHD 122983\nHD 123097\nHD 123182\nHD 123183\nHD 123184\nHD 123201B\nHD 123202\nHD 123226\nHD 123269\nCD-47 8868\nCD-47 8869\nCD-47 8889\nCD-47 8905\nCPD-47 6379\nCPD-47 6385\nUCAC 11104969\nUCAC 11105038\nUCAC 11105106\nUCAC 11105176\nUCAC 11105213\nUCAC 11105379\n\n12000\n\n8000\n\n10000\n\n12000\n\nTeff [K]\n\n3.85\n\nlog(Teff)\n\nStar\n\n10000\n\nTeff [K]\n4\n\n4.05\n\n2.4\n2\n1.6\n1.2\n0.8\n0.4\n0\n-0.4\n-0.8\n-1.2\n2.4\n2\n1.6\n1.2\n0.8\n0.4\n0\n-0.4\n-0.8\n-1.2\n\nMg abundance\n\nC abundance\n\n2.5\n\nSi abundance\n\n10\n\nlog L/L⊙\n\nlogT eff\n\nM/M⊙\n\nτ\n\n1.88\n2.25\n1.89\n1.80\n2.06\n2.10\n2.33\n2.35\n2.11\n1.50\n1.25\n1.47\n1.41\n1.76\n1.52\n0.72\n0.92\n0.88\n1.06\n0.80\n0.88\n\n4.029\n4.079\n4.033\n4.037\n4.037\n4.068\n4.057\n4.093\n4.064\n4.017\n3.924\n4.013\n3.987\n4.041\n3.971\n3.848\n3.884\n3.875\n3.908\n3.881\n3.886\n\n2.76 ± 0.14\n3.40 ± 0.17\n2.80 ± 0.14\n2.73 ± 0.14\n3.02 ± 0.21\n3.17 ± 0.16\n3.45 ± 0.24\n3.60 ± 0.18\n3.15 ± 0.16\n2.30 ± 0.16\n1.94 ± 0.14\n2.35 ± 0.16\n2.20 ± 0.11\n2.71 ± 0.14\n2.27 ± 0.16\n1.48 ± 0.07\n1.66 ± 0.08\n1.60 ± 0.08\n1.78 ± 0.09\n1.59 ± 0.08\n1.64 ± 0.08\n\n0.37 ± 0.15\n0.67 ± 0.27\n0.38 ± 0.16\n0.36 ± 0.15\n0.48 ± 0.19\n0.55 ± 0.22\n0.70 ± 0.28\n0.79 ± 0.32\n0.54 ± 0.22\n0.22 ± 0.09\n0.14 ± 0.05\n0.23 ± 0.09\n0.19 ± 0.08\n0.35 ± 0.14\n0.21 ± 0.09\n0.06 ± 0.03\n0.09 ± 0.04\n0.08 ± 0.03\n0.11 ± 0.04\n0.08 ± 0.03\n0.08 ± 0.03\n\nWEBDA, Mermillod & Paunzen 2003), and the bolometric correction from Balona (1994).\nLuminosities are listed in Table 6. With a distance modulus\nuncertainty of 0.20 mag, an uncertainty in the bolometric correction of about 0.07 mag, and a reddening uncertainty of 0.01 mag,\nwe estimate the typical uncertainty in Mbol being about 0.28 mag,\ncorresponding to an uncertainty in log L/L⊙ of about 0.10 dex.\nTwo stars of our sample, HD 122983 and HD 123183, are included in the work by Landstreet et al. (2007) and there is a good\nagreement between the obtained log L/L⊙ and M/M⊙ values, where\n\nFigure 7. Abundances relative to the Sun (Asplund et al. 2005) of C, Mg,\nAl and Si as a function of T eff for B-type stars (open squares), A-type stars\n(open circles), F-type stars (open triangles) and He-weak stars (crosses).\n\nthe small differences are due to the adoption of a different source\nfor the stellar magnitudes. We adopted the magnitudes given by\nClaria et al. (1993), while Landstreet et al. (2007) adopted the magnitudes published by Claria (1971).\nFigure 6 shows that assuming a metallicity of 0.013 would\nhave little impact on the estimate of the cluster age, but just of\nthe cluster distance, decreasing it by about 100 pc. Therefore, we\ncan safely conclude that the distance of the cluster is within the\nrange 670–770 pc. Out HR diagram allows also to better constrain\nthe cluster age. The age of the solar metallicity isochrone fitting\nthe cluster main sequence is log t=8.10, which we can then consider as the minimum cluster age. The maximum age instead depends strongly on which stars of the upper main sequence are blue\nstrugglers. If none of our analysed cluster stars is a blue struggler,\nthe maximum cluster age is most likely to be log t=8.25, while\nif HD 123226 (the hottest star in our sample) is a blue struggler\nthe maximum cluster age is more likely to be log t=8.30. On the\nbasis of these considerations, our best estimate of the cluster age\nis log t=8.20±0.10, in comparison to log t=8.20±0.20 previously\ngiven by Ahumada & Lapasset (2007)).\n6.3 Abundances vs. T eff and υ sin i\nFrom Fig. 7 to Fig. 9 we display the abundances of chemical elements versus T eff .\nFor some elements, such as Mg and Fe, it is possible to notice a correlation of the abundances with T eff , with an abundance\nincrease with T eff up to T eff ∼10500 K and an abundance decrease\nfor higher temperatures. A linear fit shows that these correlations\nare significant for both Mg and Fe (see Table 7).\nThese correlations could in principle not be real, but due to\nother factors, such as υmic , log g and υ sin i. We excluded that both\nυmic and log g produced such trends, since the abundance uncertainties take into account the υmic uncertainty, and the effect of\nlog g variations on the abundances is much smaller than the deviations obtained here. In addition, we did not find any clear correlation between the abundances and υ sin i, as shown in Fig. 10,\nexcept for a decreasing Ba abundance with increasing υ sin i up to\nυ sin i values of about 125 km s−1 , in agreement with predictions\nby Turcotte & Charbonneau (1993). We find also unlikely that our\nLTE approximation could be the source of the abundance correlations with T eff , since for both Mg and Fe the expected non-LTE\n\n\f12000\n\n8000\n\n10000\n\nFe abundance\n\nMn abundance\nNi abundance\n\nBa abundance\n10000\n\n12000\n\n8000\n\n10000\n\nSc abundance Si abundance Mg abundance\n\n0.8\n0\n-0.8\n2.4\n1.6\n0.8\n0\n-0.8\n2.4\n1.6\n0.8\n0\n-0.8\n100\n\n150\n\n200\n\n250\n\n300\n\n50\n\nVsini [km/s]\n\n2.4\n2\n1.6\n1.2\n0.8\n0.4\n0\n-0.4\n-0.8\n-1.2\n2.4\n2\n1.6\n1.2\n0.8\n0.4\n0\n-0.4\n-0.8\n-1.2\n\nTeff [K]\n\n1.6\n\n50\n\nFigure 8. Same as Fig. 7, but for Ca, Sc, Ti and Cr.\n\n8000\n\n2.4\n\n12000\n\nTeff [K]\n\n12000\n\nTeff [K]\n\n11\n\n100\n\n150\n\n200\n\n250\n\n300\n\nVsini [km/s]\n\n2.4\n\nBa abundance Fe abundance Cr abundance\n\n10000\n\nTeff [K]\n\nNi abundance Mn abundance Ti abundance\n\n8000\n\nCa abundance Al abundance C abundance\n\nSc abundance\n\n2.4\n2\n1.6\n1.2\n0.8\n0.4\n0\n-0.4\n-0.8\n-1.2\n2.4\n2\n1.6\n1.2\n0.8\n0.4\n0\n-0.4\n-0.8\n-1.2\n\nCr abundance\n\nTi abudnance\n\nCa abundance\n\nA detailed spectroscopic analysis of the open cluster NGC 5460\n\n1.6\n0.8\n0\n-0.8\n2.4\n1.6\n0.8\n0\n-0.8\n2.4\n1.6\n0.8\n0\n-0.8\n50\n\n100\n\n150\n\n200\n\n250\n\nVsini [km/s]\n\n300\n\n50\n\n100\n\n150\n\n200\n\n250\n\n300\n\nVsini [km/s]\n\nFigure 10. Abundances relative to the Sun (Asplund et al. 2005) as a function of υ sin i for B-type stars (open squares), A-type stars (open circles),\nF-type stars (open triangles) and He-weak stars (crosses).\n\nFigure 9. Same as Fig. 7, but for Mn, Fe, Ni and Ba.\n\ncorrections are small (Przybilla et al. 2001; Fossati et al. 2009) and\ntheir dependence on T eff is not expected to be as pronounced as\nshown by our results.\nAs further check for the obtained abundance correlations\nwith T eff , we looked for similar trends in other consistently\nanalysed sample of stars covering a large temperature range.\nErspamer & North (2003) analysed the spectra of 140 A- and Ftype stars, present in the ELODIE archive3 , obtaining for each star\n3\n\nhttp://atlas.obs-hp.fr/elodie/\n\nTable 7. Correlations and relative uncertainties of the Mg and Fe element\nabundance as a function of T eff , in two temperature ranges: T eff <10500 K\nand T eff >10500 K. The last two rows show the correlations obtained for Mg\nand Fe from the Erspamer & North (2003) data.\nElement\n\nT eff\n\nslope\n\nσslope\n\n3.04×10−4\n\nMg\nMg\nFe\nFe\n\n<10500 K\n>10500 K\n<10500 K\n>10500 K\n\n1.88×10−4\n−4.03×10−4\n\n0.42×10−4\n1.08×10−4\n0.47×10−4\n0.82×10−4\n\nMg\nFe\n\n<10500 K\n<10500 K\n\n7.23×10−5\n1.21×10−4\n\n1.80×10−5\n0.21×10−4\n\n−1.71×10−4\n\nfundamental parameters and abundances of several elements. Figure 11 shows a comparison between the results we obtained in\nNGC 5460 and what published by Erspamer & North (2003) for\nMg and Fe.\nWe register an agreement for both elements, in particular for\nFe (see Table 7), although the trends appear less pronounced in\nthe results published by Erspamer & North (2003). Unfortunately\nthe sample of stars analysed by Erspamer & North (2003) did not\ncover stars with temperatures higher than 10500 K, so that it was\nnot possible to check the presence of the abundance drop, present\nin our results.\nDiffusion processes could be responsible for the obtained\nabundance correlations with T eff . With the increase of the effective temperature the hydrogen and helium ionisation zones shift\nmore and more towards the stellar surface, and as a consequence\nthey become thinner and less turbulent. In this way diffusion processes become more and more effective. For example, it is well\nknown that Ba is overabundant in early-type stars, which is a\nclear signature of an influence of diffusion even in chemically\nnormal stars (Fossati et al. 2009). Another example is the presence of a correlation between strontium and oxygen or strontium\nand magnesium, obtained for chemically normal B-type stars by\nHempel & Holweger (2003) (strontium is radiatively driven outwards, Mg and O sink down).\nThe efficiency of diffusion processes is reduced by rotation.\nIn particular, simulations carried out by Turcotte & Charbonneau\n(1993) show that for rotational velocities higher than 125 km s−1\n\n\fL. Fossati et al.\nFe abundance\n\n2.4\n2\n1.6\n1.2\n0.8\n0.4\n0\n-0.4\n-0.8\n-1.2\n2.4\n2\n1.6\n1.2\n0.8\n0.4\n0\n-0.4\n-0.8\n-1.2\n\nFe abundance\n\nMg abundance\n\nMg abundance\n\n12\n\n8000\n\n10000\n\nTeff [K]\n\n12000\n\n8000\n\n10000\n\n12000\n\nTeff [K]\n\nFigure 11. Comparison between the results obtained in this work (upper\npanels) and by Erspamer & North (2003) (lower panels), for Mg (on the\nleft side) and Fe (on the right side). B-type stars are denoted with open\nsquares, A-type stars with open circles, F-type stars with open triangles and\nHe-weak stars with crosses.\n\nthe envelope is completely mixed. This would suggest that correlations between abundances of diffusion indicator elements (such as\nSr, O, Mg, and Ba) and υ sin i should be obtained even for chemically normal star. But correlations between abundance and υ sin i\nare not found here, except for Ba, one of the diffusion indicators, for which the abundance decreases mildly with υ sin i, up to\nυ sin i values of ∼125 km s−1 , in agreement with what predicted by\nTurcotte & Charbonneau (1993). Probably a much larger sample\nof stars, which includes chemically normal low υ sin i stars could\nshow the presence or not of these correlations.\n\n7 CONCLUSIONS\nWe obtained low and mid-resolution spectra of several stars in the\nfield of the NGC 5460 open cluster with the FLAMES spectrograph\nat the ESO/VLT, and we selected 24 probable cluster members with\nT eff > 7000. This cluster was never previously spectroscopically\nstudied.\nWe calculated the fundamental parameters and performed a\ndetailed abundance analysis for all the stars of the sample, except for three objects (HD 123225, Cl NGC 5460 BB 338, and\nUCAC 11105152), which turned out to be double line spectroscopic binaries. Two stars, HD122983 and HD 123182, are Heweak stars, and we suspect that the hotter component of the\nHD 123225 SB2 system is a HgMn chemically peculiar star.\nBagnulo et al. (2006) obtained a marginal magnetic field detection\nfor HD 123183, but the star has remarkably high υ sin i for an Ap\nstar, and no clear chemical peculiarities.\nThe mean abundance pattern obtained for B-, A- and F-type\nstars considered members of the cluster concentrate around solar values. We determined the cluster metallicity from the cooler\nstars of our sample (T eff <8500 K). The resultant metallicity is Z =\n0.014 ± 0.003. We rederived Z also from the mean iron abundance\n([Fe/H]= −0.18 ± 0.22 dex), adopting the approximation given in\n+0.008\n. We believe anyway that this metalEq. 2, obtaining Z = 0.013−0.005\nlicity is underestimated, due to two stars of the sample which show\na particularly low iron abundance, and, without taking into account\nthese two objects, the metallicity turned out to be almost solar (Z =\n+0.005\n0.017−0.004\n).\n\nFor each star of the sample we derived photometrically\nlog L/L⊙ and, adopting the spectroscopic temperatures derived for\nthe abundance analysis, we built the HR diagram of the cluster.\nFrom a comparison between the cluster HR diagram and isochrones\nby Marigo et al. (2008) we obtained that the cluster distance lies in\nthe range 670–770 pc and that the cluster age is log t=8.20 ± 0.10,\nwhere the maximum age depends anyway on which stars of the\nupper main sequence are blue strugglers.\nWe plotted the abundances of the elements analysed in most\nof the stars of our sample as a function of υ sin i and T eff . We did\nnot find any clear abundance trend with respect to υ sin i, except\nfor barium, for which we register a decrease of the abundance with\nincreasing υ sin i, up to a υ sin i of about 125 km s−1 . For some elements, particularly Mg and Fe, we found trends between abundance and T eff ; their abundances increase up to a T eff value of\nabout 10500 K, then decrease with increasing T eff . This abundance\ntrend is marginally present also in the sample of stars analysed by\nErspamer & North (2003), but their results do not cover the hotter region, where we found the abundance decline. We suggest that\nthese trends might be signatures of diffusion in early-type stars.\n\nACKNOWLEDGMENTS\nBased on observations made with ESO Telescopes at the Paranal\nObservatory under programme ID 079.D-0178. Astronomy research at the Open University is supported by an STFC rolling\ngrant (L.F.). C.P. acknowledges the support of the project P19503N16 of the Austrian Science Fund (FWF). O.K. is a Royal Swedish\nAcademy of Sciences Research Fellow supported by grants from\nthe Knut and Alice Wallenberg Foundation and the Swedish Research Council. LF is deeply in debt with Denis Shulyak for the\ncalculation of the LLmodels stellar model atmospheres. We also\nacknowledge the use of cluster facilities at the Institute for Astronomy of the University of Vienna. We thank the anonymous referee for the many useful comments which improved the original\nmanuscript.\n\nREFERENCES\nAhumada, J. A., & Lapasset, E. 2007, A&A, 463, 789\nAnders, E. & Grevesse, N. 1989, Geochimica et Cosmochimica\nActa, 53, 197\nAsplund, M., Grevesse, N., & Sauval, A. J. 2005, in ASP\nConf. Ser. 336: Cosmic Abundances as Records of Stellar Evolution and Nucleosynthesis, ed. Thomas G. Barnes III & Frank\nN. Bash, 25\nBagnulo, S., Landstreet, J.D., Mason, E., et al. 2006, A&A, 450,\n777\nBalona, L. A. 1994, MNRAS, 268, 119\nCanuto, V. M., & Mazzitelli, I. 1991, ApJ, 370, 295\nCanuto, V. M., & Mazzitelli, I. 1992, ApJ, 389, 724\nCharbonneau, P., & Michaud, G. 1991, ApJ, 370, 693\nClaria, J. J. 1971, AJ, 76, 639\nClaria, J. J., Lapasset, E., & Bosio, M. A. 1993, A&AS, 99, 1\nDias, W. S., Assafin, M., Flório, V., Alessi, B. S., & Lı́bero, V.\n2006, A&A, 446, 949\nErspamer, D., & North, P. 2003, A&A, 398, 1121\nFossati, L., Bagnulo, S., Monier, R., et al. 2007, A&A, 476, 911\nFossati, L., Bagnulo, S., Monier, R., et al. 2008a, Contributions of\nthe Astronomical Observatory Skalnate Pleso, 38, 123\n\n\fA detailed spectroscopic analysis of the open cluster NGC 5460\nFossati, L., Bagnulo, S., Landstreet, J, et al. 2008b, A&A, 483,\n891\nFossati, L., Ryabchikova, T., Bagnulo, S., et al. 2009, A&A, 503,\n945\nFossati, L., Mochnacki, S., Landstreet, J., & Weiss, W. 2010,\nA&A, 510, A8\nFuhrmann, K., Pfeiffer, M., Frank, C., Reetz, J., & Gehren, T.\n1997, A&A, 323, 909\nGebran, M., & Monier, R. 2005, Memorie della Societa Astronomica Italiana Supplement, 8, 200\nGebran, M., & Monier, R. 2008, A&A, 483, 567\nGebran, M., Monier, R., & Richard, O. 2008, A&A, 479, 189\nGebran, M., Vick, M., Monier, R., & Fossati, L. 2010, A&A, in\npress, arXiv: 1006.5284\nHeiter, U., Kupka, F., van't Veer–Menneret, C., Barban, C., et al.\n2002, A&A, 392, 619\nHempel, M., & Holweger, H. 2003, A&A, 408, 1065\nHog, E., Fabricius, C., Makarov, V. V. et al. 2000, A&A, 355, L27\nHubrig, S., & Mathys, G. 1996, A&AS, 120, 457\nIliev, I. K., & Budaj, J. 2008, Contributions of the Astronomical\nObservatory Skalnate Pleso, 38, 129\nKharchenko, N. V., Piskunov, A. E., Röser, S., Schilbach, E., &\nScholz, R.-D. 2004, AJ, 325, 740\nKharchenko, N. V., Piskunov, A. E., Röser, S., Schilbach, E., &\nScholz, R.–D. 2005, A&A, 438, 1163\nKochukhov, O. 2007, Spectrum synthesis for magnetic, chemically stratified stellar atmospheres, Physics of Magnetic Stars,\n109, 118\nKupka, F., Piskunov, N., Ryabchikova, T. A., Stempels, H. C., &\nWeiss, W. W. 1999, A&AS, 138, 119\nKurucz, R. 1993, ATLAS9: Stellar Atmosphere Programs and 2\nkm/s grid. Kurucz CD-ROM No. 13 (Cambridge: Smithsonian\nAstrophysical Observatory)\nLandstreet, J. D. 1998, A&A, 338, 1041\nLandstreet, J. D. 1988, ApJ, 326, 967\nLandstreet, J. D., Bagnulo, S., Andretta, V., et al. 2007, A&A,\n470, 685\nMarigo, P., Girardi, L., Bressan, A., et al. 2008, A&A, 482, 883\nMashonkina, L. 2011, Magnetic Stars-2010, Proceedings of an international conference held in N. Archyz, Russia, 27-30 August\n2010 (in press)\nMermilliod, J.-C., & Paunzen, E. 2003, A&A, 410, 511\nPasquini, L., et al. 2002, The Messenger, 110, 1\nPiskunov, N. E., Kupka, F., Ryabchikova, T. A., Weiss, W. W., &\nJeffery, C. S. 1995, A&AS, 112, 525\nPrzybilla, N., Butler, K., Becker, S. R., & Kudritzki, R. P. 2001,\nA&A, 369, 1009\nRentzsch-Holm, I. 1996, A&A, 312, 966\nRobichon, N., Arenou, F., Mermilliod, J.-C., & Turon, C. 1999,\nA&A, 345, 471\nRyabchikova, T. A., Piskunov, N. E., Stempels, H. C., Kupka, F.,\n& Weiss, W. W. 1999, Phis. Scr., T83, 162\nRyabchikova, T., Fossati, L., & Shulyak, D. 2009, A&A, 506, 203\nShulyak, D., Tsymbal, V., Ryabchikova, T., Stütz Ch., & Weiss,\nW. W. 2004, A&A, 428, 993\nTsymbal, V. V. 1996, in ASP Conf. Ser. 108, Model Atmospheres\nand Spectral Synthesis, ed. S. J., Adelman, F., Kupka, & W. W.,\nWeiss, 198\nTurcotte, S., & Charbonneau, P. 1993, ApJ, 413, 376\nVillanova, S., Carraro, G., & Saviane, I. 2009, A&A, 504, 845\nvon Zeipel, H. 1924, MNRAS, 84, 684\nWade, G. A., Bagnulo, S., Kochukhov, O., Landstreet, J. D.,\n\n13\n\nPiskunov, N., & Stift, M. J. 2001, A&A, 374, 265\nZacharias, N., Urban, S. E., Zacharias, M. I. et al. 2004, AJ, 127,\n3043\nThis paper has been typeset from a TEX/ LATEX file prepared by the\nauthor.\n\n\f"}