{"id": "http://arxiv.org/abs/0906.2337v1", "guidislink": true, "updated": "2009-06-12T13:43:57Z", "updated_parsed": [2009, 6, 12, 13, 43, 57, 4, 163, 0], "published": "2009-06-12T13:43:57Z", "published_parsed": [2009, 6, 12, 13, 43, 57, 4, 163, 0], "title": "Dipole diffusion in a random electrical potential", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0906.4564%2C0906.5008%2C0906.1915%2C0906.4539%2C0906.2521%2C0906.4453%2C0906.5483%2C0906.3654%2C0906.1491%2C0906.5182%2C0906.3235%2C0906.0466%2C0906.5595%2C0906.0826%2C0906.3822%2C0906.4302%2C0906.4124%2C0906.4347%2C0906.2337%2C0906.2293%2C0906.0526%2C0906.3615%2C0906.5423%2C0906.4402%2C0906.3169%2C0906.4863%2C0906.1498%2C0906.3694%2C0906.1792%2C0906.2765%2C0906.0070%2C0906.2652%2C0906.2980%2C0906.3355%2C0906.1685%2C0906.5566%2C0906.2601%2C0906.3238%2C0906.1649%2C0906.5042%2C0906.0445%2C0906.2305%2C0906.5610%2C0906.1056%2C0906.2668%2C0906.4712%2C0906.2044%2C0906.3262%2C0906.4146%2C0906.5339%2C0906.4189%2C0906.4853%2C0906.4363%2C0906.1905%2C0906.1069%2C0906.2047%2C0906.4703%2C0906.0376%2C0906.1916%2C0906.5552%2C0906.0862%2C0906.1895%2C0906.3539%2C0906.0708%2C0906.1573%2C0906.3476%2C0906.2095%2C0906.1131%2C0906.1057%2C0906.2045%2C0906.0182%2C0906.4625%2C0906.1454%2C0906.5273%2C0906.1316%2C0906.1252%2C0906.0742%2C0906.1323%2C0906.3622%2C0906.4492%2C0906.3673%2C0906.3044%2C0906.2862%2C0906.2518%2C0906.0975%2C0906.0251%2C0906.5200%2C0906.1591%2C0906.5434%2C0906.4464%2C0906.4725%2C0906.4054%2C0906.2953%2C0906.1176%2C0906.0033%2C0906.4637%2C0906.2309%2C0906.0750%2C0912.2502%2C0912.3688%2C0912.1352&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Dipole diffusion in a random electrical potential"}, "summary": "We study the Langevin dynamics of a dipole diffusing in a random electrical\nfield E derived from a quenched Gaussian potential. We show that in a suitable\nadiabatic limit (where the dynamics of the dipole moment is much faster than\nthe dynamics of its position), one can reduce the coupled stochastic equations\nto an effective Langevin equation for a particle diffusing in an effective\npotential with a spatially varying and anisotropic local diffusivity\n$\\kappa_{ij}$. Analytic results, close to the adiabatic limit, for the\ndiffusion constant $\\kappa_e$ are found in one dimension and a finite\ntemperature dynamical transition is found. The system is also studied\nnumerically. In particular, we study the anomalous diffusion exponent in the\nlow temperature regime. Our findings strongly support the conclusion that the\nlocation of the dynamical transition and the anomalous diffusion exponents are\ndetermined by purely static considerations, i.e. they are independent of the\nrelative values of the diffusion constants of the particle position and its\ndipole moment.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0906.4564%2C0906.5008%2C0906.1915%2C0906.4539%2C0906.2521%2C0906.4453%2C0906.5483%2C0906.3654%2C0906.1491%2C0906.5182%2C0906.3235%2C0906.0466%2C0906.5595%2C0906.0826%2C0906.3822%2C0906.4302%2C0906.4124%2C0906.4347%2C0906.2337%2C0906.2293%2C0906.0526%2C0906.3615%2C0906.5423%2C0906.4402%2C0906.3169%2C0906.4863%2C0906.1498%2C0906.3694%2C0906.1792%2C0906.2765%2C0906.0070%2C0906.2652%2C0906.2980%2C0906.3355%2C0906.1685%2C0906.5566%2C0906.2601%2C0906.3238%2C0906.1649%2C0906.5042%2C0906.0445%2C0906.2305%2C0906.5610%2C0906.1056%2C0906.2668%2C0906.4712%2C0906.2044%2C0906.3262%2C0906.4146%2C0906.5339%2C0906.4189%2C0906.4853%2C0906.4363%2C0906.1905%2C0906.1069%2C0906.2047%2C0906.4703%2C0906.0376%2C0906.1916%2C0906.5552%2C0906.0862%2C0906.1895%2C0906.3539%2C0906.0708%2C0906.1573%2C0906.3476%2C0906.2095%2C0906.1131%2C0906.1057%2C0906.2045%2C0906.0182%2C0906.4625%2C0906.1454%2C0906.5273%2C0906.1316%2C0906.1252%2C0906.0742%2C0906.1323%2C0906.3622%2C0906.4492%2C0906.3673%2C0906.3044%2C0906.2862%2C0906.2518%2C0906.0975%2C0906.0251%2C0906.5200%2C0906.1591%2C0906.5434%2C0906.4464%2C0906.4725%2C0906.4054%2C0906.2953%2C0906.1176%2C0906.0033%2C0906.4637%2C0906.2309%2C0906.0750%2C0912.2502%2C0912.3688%2C0912.1352&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study the Langevin dynamics of a dipole diffusing in a random electrical\nfield E derived from a quenched Gaussian potential. We show that in a suitable\nadiabatic limit (where the dynamics of the dipole moment is much faster than\nthe dynamics of its position), one can reduce the coupled stochastic equations\nto an effective Langevin equation for a particle diffusing in an effective\npotential with a spatially varying and anisotropic local diffusivity\n$\\kappa_{ij}$. Analytic results, close to the adiabatic limit, for the\ndiffusion constant $\\kappa_e$ are found in one dimension and a finite\ntemperature dynamical transition is found. The system is also studied\nnumerically. In particular, we study the anomalous diffusion exponent in the\nlow temperature regime. Our findings strongly support the conclusion that the\nlocation of the dynamical transition and the anomalous diffusion exponents are\ndetermined by purely static considerations, i.e. they are independent of the\nrelative values of the diffusion constants of the particle position and its\ndipole moment."}, "authors": ["Clement Touya", "David S. Dean", "Clement Sire"], "author_detail": {"name": "Clement Sire"}, "author": "Clement Sire", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1751-8113/42/37/375001", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0906.2337v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0906.2337v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "17 pages, 4 figures", "arxiv_primary_category": {"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0906.2337v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0906.2337v1", "journal_reference": "J. Phys. A. 42, 375001,(2009)", "doi": "10.1088/1751-8113/42/37/375001", "fulltext": "arXiv:0906.2337v1 [cond-mat.dis-nn] 12 Jun 2009\n\nDipole diffusion in a random electrical potential\nClément Touya, David S. Dean, and Clément Sire\nLaboratoire de Physique Théorique – IRSAMC, Université de Toulouse, CNRS, 31062 Toulouse,\nFrance\n\nAbstract. We study the Langevin dynamics of a dipole diffusing in a random electrical field E\nderived from a quenched Gaussian potential. We show that in a suitable adiabatic limit (where the\ndynamics of the dipole moment is much faster than the dynamics of its position), one can reduce\nthe coupled stochastic equations to an effective Langevin equation for a particle diffusing in an\neffective potential with a spatially varying and anisotropic local diffusivity κij . Analytic results,\nclose to the adiabatic limit, for the diffusion constant κe are found in one dimension and a finite\ntemperature dynamical transition is found. The system is also studied numerically. In particular,\nwe study the anomalous diffusion exponent in the low temperature regime. Our findings strongly\nsupport the conclusion that the location of the dynamical transition and the anomalous diffusion\nexponents are determined by purely static considerations, i.e. they are independent of the relative\nvalues of the diffusion constants of the particle position and its dipole moment.\n\n\fDipole diffusion in a random electrical potential\n\n2\n\n1. Introduction\nComputing bulk transport properties in random media is an important physical problem [1, 2,\n3, 4, 5, 6, 7, 8] having many applications. Two important models of random media have been\nwidely studied (i) where the randomness is due to a random potential and (ii) where the local\ndiffusions constant is random. There are mathematical relations between the problems (i) and\n(ii) and problems of type (ii) are also related to a wide variety of physical problems such as the\neffective conductivity and dielectric constants of random conductors and dielectrics and the effective\npermeability of porous media [1]. An important quantity to understand those properties is the late\ntime diffusion constant of a Brownian tracer particle in interaction with the medium. In the system\nwe will study, the local transport properties are modified by the interaction of the dipole moment\nof the tracer particle with a random electric field drawn from an appropriate statistical ensemble.\nIf the electric field disorder is statistically invariant under translation and short range correlated in\nspace, we expect that the diffusion constant and mobility due to an applied force are self-averaging\nin the regime where the diffusion is normal. If the transport is normal, then in the long time limit\n(t → ∞), the mean squared displacement of the particle position behaves as\nh(x(t) − x(0))2 i ∼ 2Dκe t,\n\n(1)\n\nwhere D is the dimension of space and κe is the late time diffusion or effective diffusion\nconstant. In general there are subdominant corrections to the above, which depend strongly on the\ndimensionality of the problem [9, 10].\nIf the random field is frozen or evolves over very long time scales with respect to those of the tracer\nparticle, then one is in the situation of quenched disorder, where the potential does not depend on\ntime. The motivation for studying models of particles diffusing in a random potential comes from\nthe fact that such systems arise very naturally in nature; for instance in zeolites where random\nelectric fields are generated by the presence of frozen charged impurities [11]. If the particle has a\nnet charge, then the particle interacts with the electric field and the case of diffusion in a quenched\nscalar field has been extensively studied in the literature [1, 2, 3, 10, 12]. However, if the particle\nis polarizable but without charge, it also interacts with the field. In this case, the problem is quite\ndifferent and much less well studied [12, 13]. We also note that systems with quenched disorder,\nspin glasses for example, are often good paradigms for systems having structural glass transition\n(where no random field is present). It is often argued heuristically, that for sufficiently complex\nand frustrated systems, a single particle in the system sees an effectively random potential due\nto the other particles. At a mean field level, there exist models, where this analogy has been\nused successfully to analyze the statistical mechanics of frustrated but non-disordered models. In\npractice one can have two models, one with quenched disorder and the other without but highly\nfrustrated, which exhibit the same thermodynamics in the high temperature phase and the same\nglass transition at low temperatures [14, 15, 16]. Even if the frustrated non-random system possesses\na crystalline ground state, not shared by the disordered system, this fact is practically irrelevant as\nthis state is dynamically never attained. Therefore, these models are often adopted as toy models\nfor structural glass transition. In the liquid phase, we expect the tracer particle to have a non-zero\ndiffusion constant κl . Now consider the situation in which the same particle diffuses in a quenched\nbackground, where all the other particles have been frozen in a particular configuration. A realistic\nchoice would be to select a configuration from a Gibbs-Boltzmann equilibrium ensemble. If κe is\nthe diffusion constant, it has been shown [17, 18] that κe < κl which makes physical sense, as if the\n\n\fDipole diffusion in a random electrical potential\n\n3\n\nbackground particles can move about, the cages, which trap the tracer , will break up on some time\nscale and free it to disperse more quickly than in the quenched case. Moreover, in some special\ncases, κe can vanish at a critical temperature or disorder strength [10, 12]. If the system has a\nfinite correlation length l0 (which will be the case, as our field will be short range correlated), the\ndiffusion constant can be used to give an effective relaxation time τ\nτ∼\n\nl02\n.\nκe\n\n(2)\n\nIf κe → 0, it means, that we have a diverging timescale in the same way in which a structural\nglass has a diverging timescale which, experimentally, can be extracted from the divergence of the\nliquid's viscosity.\nIn this paper we study the physical case of dipoles diffusing in a random electric field E(x) which\nis spatially varying though time independent (or quenched). It is generated by a random potential\nφ(x) which gives E(x) = −∇φ(x), with correlation function\nhφ(x)φ(x′ )i = ∆(|x − x′ |).\n\n(3)\n\nThe potential φ(x) is thus statistically isotropic and invariant by translation in space. The most\nconvenient choice is to take φ to be Gaussian. If the dipole moment, denoted by p, is modelled\nas two opposite charges connected to a Harmonic spring and x denotes the position of the dipole\ncentre, then the total energy of a particle at the point (p, x) is given by\nH(x, p) =\n\n1 2\np − p * E(x).\n2χ\n\n(4)\n\nThe first term is the Harmonic energy of the spring, and χ is simply the dipole polarisability. The\nsecond term is the energy of the dipole's interaction with the field E. The partition function for\nthe system, where x is confined to a volume denoted by V of a D dimensional space, is given, up\nto an overall factor, by\n\u0013\n\u0012\nZ\nZ\np2\n+ βp * E(x) ,\n(5)\nZ=\ndx\ndp exp −β\n2χ\nV\nRD\nwhere β = 1/kB T is the inverse temperature. If we trace over the dependence on p, we find an\neffective partition function for the variable x given, again up to a constant, by\nZ\nZef f =\ndx exp (−βV (x)) ,\n(6)\nV\n\nwhere V is the effective potential for x and is given by\n\nχE2 (x)\n.\n(7)\n2\nThis represents the case where the dipole moment adapt instantaneously to the external field and\nmotivated the study in [10, 12] of diffusion in non-Gaussian potentials. In [10] the diffusion constant\nfor a particle diffusing in non Gaussian potentials such as given by equation (7) was computed\nexactly in one dimension, and in [12] a self renormalization group scheme was developed to study\nthe problem in higher dimensions.\nV (x) = −\n\nIn [10, 12] a critical temperature at which the diffusion constant vanishes, signalling a dynamical\ntransition from a normal diffusive regime to a subdiffusive regime was identified. We thus expect\n\n\f4\n\nDipole diffusion in a random electrical potential\n\nthat, in a suitable adiabatic limit where the dynamics of the dipole degree of freedom p is much\nmore rapid than that of the spatial variable x, that the effective potential seen by the variable x is\nV as defined by equation (7).\nIf we take an overdamped Langevin dynamics for both the dipole and positional degrees of freedom,\nthe equations of motion are given by\n∂Ej √\ndxi\n+ 2κx ηxi\n= βκx pj\ndt\n∂xi\n\u0013\n\u0012\np\ndpi\npi\n= − κp β\n− Ei + 2κp ηpi .\ndt\nχ\n\n(8)\n(9)\n\nIn the above equations κx is the bare diffusion constant for the spatial variable and the other\ndiffusion constant κp sets the time scale for the relaxation of the dipole and the adiabatic limit\nis where κp → ∞. In the dynamical equations (8) and (9), terms of the form Ai represent the\ncomponent of the vector A in the direction i ; we have also used the Einstein summation convention\nand will stick with this convention throughout the paper. The noise terms are white noise and their\ncorrelation functions are given by\nhηpi (t)ηpj (s)i = hηxi (t)ηxj (s)i = δij δ(t − s) and hηpi (t)ηxj (s)i = 0.\n\n(10)\n\nIf we rewrite (9) and substitute it into equation (8) we find\n√\ndxi\n∂ χEj2\nκx ∂Ej\nχ\n= 2κx ηxi + κx β\n−\ndt\n∂xi 2\nκp ∂xi\n\n\u0012\n\ndpj p\n− 2κp ηpj\ndt\n\n\u0013\n\n,\n\n(11)\n\nIf we now take the adiabatic limit (κp ≫ κx ), equation (11) reduces to the Langevin equation for a\nparticle in the potential V (x) defined by equation (7). In appendix A, we will rederive this result in\na more rigorous way and also see, at first order, the effect of a finite value of κp . We thus expect, that\nfor very large values of κp , we find the same dynamics for x studied in [10, 12, 13]. Consequently\nthere should also be a dynamical transition in this problem when the field φ is Gaussian. We can\nnow ask the question, what happens if the time scale for the relaxation of the dipole moment is\nnon zero? Will the dynamical transition remain or is it a pathology of the limit κp → ∞?\nIn the appendix A we derive the effective dynamics for the marginal distribution of x to order κx /κp .\nTo this order the effective dynamics of x still can be described by a Langevin equation, with the\nsame potential as equation (7) but with a spatially varying non-isotropic diffusion constant. This\nis a rather remarkable fact and can be shown using operator projection techniques [19]. However\nwe will present a derivation based on a direct manipulation of the Langevin equations similar to\nthat of [20]. We chose this route as it gives a physical feeling for why the effective process for x\nis to this order Markovian and also because the computation in spaces of dimension greater than\none are more straightforward within this formalism. We also compute the first order corrections to\nthe effective diffusion constant in the high temperature limit via a Kubo formula for the effective\ndiffusion constant.\nIn section (3) we will present exact result for the diffusion constant in one dimension. In section\n(4) we will confront our results with numerical simulation (stochastic second order Runge-Kutta)\nof the coupled Langevin equations (8) and (9) in the diffusive and sub-diffusive regime. Finally in\nsection 5 we will conclude and discuss our results.\n\n\f5\n\nDipole diffusion in a random electrical potential\n2. Large κp and small β approximations\n\nThe time scale for the relaxation of the dipoles should be proportional to κ−1\np and thus, the adiabatic\nlimit (where the dipoles adapt very quickly to the local field) will correspond to the limit where κp\nbecomes large. Interestingly, in this limit, one can simplify the coupled equations (8) and (9) to an\neffective Langevin equation for x up to the order O(κx /κp ) by direct manipulation of the Langevin\nequations [20]. The exact derivation is a little long and technical and for clarity's sake it is thus\ngiven in appendix A. As a result, we can write down the following Fokker-Planck equation which\ndescribe the effective process for x\n\u0012\n\u0014\n\u0013\u0015\n∂ρ\n∂V\n∂\n∂ρ\nκki\n.\n(12)\n+ βρ\n= Hρ =\n∂t\n∂xk\n∂xi\n∂xi\nWhere V is the effective potential given by equation (7) and κij is a spatially varying and anisotropic\ndiffusivity tensor given by\n\u0015\n\u0014\nκx 2 ∂Ek ∂Ek\n.\n(13)\nχ\nκij = κx δij −\nκp\n∂xi ∂xj\nThe Fokker-Planck equation (12) has the correct Gibbs Boltzmann equilibrium distribution with\nthe effective potential V and from this one can write down a Langevin equation which corresponds\nto the process\np\ndxi\n∂ χEj2\n∂\nκij + 2κij ηi .\n= −β\n+\ndt\n∂xi 2\n∂xi\n\n(14)\n\nWe note that if we take the limit where κp → ∞ in (14), the diffusivity reduce to κij = κx δij\nand we recover the Langevin equation for a particle in the potential V (x) rigorously. In equation\n(A.21) of appendix A we performed an expansion in α−1 (with α = κp β/χ) and assumed α to\nbe large. However if κp is large but finite we see that as β becomes small (the high temperature\nlimit) the expansion will fail. To predict the behavior of κe at high temperature we will thus use\na Kubo formula for the effective diffusion constant. Integrating the stochastic differential equation\n(8) between 0 and t we have\nZ t\n√\nxi (t) − xi (0) = 2κx Bi (t) + βκx\ndspj (s).∇i Ej (x(s))\n(15)\n0\n\nWhere Bt is a standard D-dimensional Brownian motion with hB2t i = 2Dt and xi (0) is the initial\nposition in the direction i. Thus squaring the above equation and taking the average yields\nZ t\n2\n2κx t = h(xi (t) − xi (0)) i + 2κx βh(xi (t) − xi (0)) .\ndspj (s).∇i Ej (x(s))i\n0\nZ t Z s\n+(κx β)2\nds\nds′ hpj (s).∇i Ej (x(s))pk (s′ ).∇i Ek (x(s′ )i.\n0\n\n(16)\n\n0\n\nUsing the property of detail balance, which ensures time translation invariance at equilibrium, we\nhave for any two functions A and B that\nhA(x(t))B(x(s))i = hA(x(t − s))B(x(0))i,\n\n(17)\n\n\fDipole diffusion in a random electrical potential\n\n6\n\nand the Onsager symmetry relation\nhA(x(t))B(x(s))i = hB(x(t))A(x(s))i.\n\n(18)\n\nAssuming that the system starts in equilibrium [21] one can thus apply (17) and (18) to the second\nterm of (16) and show that it should vanish\nZ t\nh(xi (t) − xi (0)) .\ndspj (s).∇i Ej (x(s))i\n0\nZ t\n=\nds [hxi (t)pj (s).∇i Ej (x(s))i − hxi (0)pj (s).∇i Ej (x(s))i]\n0\nZ t\n=\nds [hxi (t − s)pj (0).∇i Ej (x(0))i − hxi (0)pj (s).∇i Ej (x(s))i]\n0\nZ t\n=\nds [hpj (s).∇i Ej (x(s))xi (0)i − hxi (0)pj (s).∇i Ej (x(s))i]\n0\n\n= 0.\n\n(19)\n\nThus, (16) reduces to\nh(xi (t) − xi (0))2 i = 2κx t\nZ t Z s\n−(κx β)2\nds\nds′ hpj (s − s′ )pk (0)∇i Ej (x(s − s′ ))∇i Ek (x(0))i .\n0\n\n(20)\n\n0\n\nThis equation is however exact and can be evaluated to order E2 by calculating the integral on\nits right hand side using the statistics for x and p in the absence of E, i.e. in the weak disorder\nlimit which should become exact at high temperatures. Here p and x are purely Gaussian with\ncorrelation functions\n\u0012\n\u0013\nκp β\nχ\ns δjk ,\n(21)\nhpj (s)pk (0)i = exp −\nβ\nχ\nand\nh(xi (t) − xj (0))2 i = 2δij κx t.\n\n(22)\n\nThis approximation yields\nhpj (s − s′ )pk (0)∇i Ej (x(s − s′ ))∇i Ek (x(0))i\n\u0012\n\u0013\nχ\nκp β\n= exp −\n(s − s′ ) h∇i Ej (x(s − s′ ))∇i Ek (x(0))iδjk .\nβ\nχ\n\n(23)\n\nSumming over the spatial indices then gives\n\u0013\n\u0012\nZ\nZ s\nκp β\nκ2 βχ t\n(s − s′ ) h∇i Ej (x(s−s′ ))∇i Ej (x(0))i.(24)\nds\nds′ exp −\nκe = κx − x\nDt 0\nχ\n0\nThe correlation function of the random field component in the above can be computed in terms of\nthe correlation function ∆(x) of the random electrostatic field φ.\n\n\f7\n\nDipole diffusion in a random electrical potential\ndk  ̃\n∆(k)k4 hexp(ik.x(s − s′ ))i\n(2π)D\nZ\ndk  ̃\n=\n∆(k)k4 exp(−k2 κx (s − s′ ))\n(2π)D\n\nh(∇i Ej x(s − s′ ))∇i Ej (x(0))i =\n\nZ\n\n(25)\n\n ̃\nwhere ∆(k)\nis the Fourier transform of ∆(x). Finally, we are left with a simple double integration\nover s and s′ , and from the large time behaviour we can extract κe as\nZ\n4\n ̃\nκ2x βχ\ndk\n∆(k)k\nκe = κx −\n.\n(26)\nD\n(2π)D k2 κx + κp β\nχ\n3. Analytic results in one dimension\nIn the previous section, all the results we derived were for an arbitrary dimension D. To analyze our\nresults to first order beyond the adiabatic limit, we will restrict our study to the one dimensional\ncase where one can compute exactly the diffusion constant κe for the effective Fokker-Planck\nequation (12). We apply the general results of [1] to compute the effective diffusivity via a static\nproblem:\n\u0013\n\u0012\ndV\ndρ\n= j,\n(27)\n+ βρ\nκ(x)\ndx\ndx\nwhere j is the current and κ(x) is the spatially varying diffusivity in one dimension\n\"\n\u00132 #\n\u0012\nκx 2 dE(x)\n.\nχ\nκ(x) = κx 1 −\nκp\ndx\n\n(28)\n\nWe can solve (27) and find\nx\n\neβV (y)\ndy\n(29)\nκ(y)\n0\nD E\ndρ\nThe diffusion constant κe is then given as κe dx\n= j. Where h.i is the average over the disorder\nin the random electrical field. This gives\n*\n\u001c \u001d\nZ L βV (y) +\nκe j\ne\ndρ\n−βV (L)\n= lim\ne\ndy = j,\n(30)\nκe\nL→∞\ndx\nL\nκ(y)\n0\nρ(x) = je\n\n−βV (x)\n\nZ\n\nand finally\nκe =\n\n1\nE.\nD\nβV\nhe−βV i e κ\n\n(31)\n\nThis result can also be obtained via a first passage time argument [22, 23]. The electrical potential\nφ(x) is Gaussian and if we choose a correlator of the form ∆(x) = f (x2 ), where f is analytic at\n\n\fDipole diffusion in a random electrical potential\n\n8\n\nx = 0, then we find that E 2 (0) = −2f ′ (0), and hE ′ (0)E(0)i = 0. Therefore, E ′ and E are\nuncorrelated and we can write\n−1\n\nκe =\n\nκ−1\n.\nhe−βV i heβV i\n\n(32)\n\nIn [10] (corresponding to the adiabatic case here) it was shown that the dynamical transition could\nbe identified, via an Arrhenius type argument, with the divergence of one or the other of the first\ntwo terms on the denominator of the equation above. We thus see that to first order beyond\nthe adiabatic approximation the location of the transition temperature should be the same in the\nadiabatic limit and close to this limit.\nIn the numerical simulations we will carry out we take the choice of correlation function f (u) =\nexp(− 21 u) for which we find\nκe = κx (1 − χ2 β 2 )1/2 (1 −\n\nκ x χ2\n).\nκp\n\n(33)\n\n4. Numerical simulations\nIn this section we test our analytical predictions against numerical simulations of the Langevin\nequations (8) and (9) in one dimension. In our simulation, we set the diffusion constant without\n√\n√\ndisorder κx to 1 for convenience and we used rescaled variables pi = p̃i κp and Ei = Ẽi κp , so\nthat both equations have the same time scale,\ndxi\n∂ Ẽj √\n+ 2ηxi\n= βκp p̃j\ndt\n∂xi\n\u0013\n\u0012\n√\ndp̃i\np̃i\n= − κp β\n− Ẽi + 2ηpi\ndt\nχ\n\n(34)\n(35)\n\nThe coupled stochastic differential equations were integrated using second order Runge-Kutta\nintegration schemes developed in [24, 25] and reviewed in [1] with a time step ∆t = 0.001. In\nall simulations the effective diffusion constant for a given realization of the disorder was obtained\nby fitting the mean squared displacement averaged over 2000 particles at late times. The time of\nthe simulation was chosen so that particles had typically diffused ten or so correlation lengths of\nthe field. The fit of the average mean square displacement was done over the last half of the time\nof the simulation (to ensure that the mean squared displacement is well within the linear regime)\nby a non linear form: at + btθ , with θ < 1. The correction to the linear term has to be taken into\naccount as it becomes more and more relevant close to the transition due to the slowing down of\nthe dynamics [10].\nTo generate the Gaussian field characterized by a correlator (3), we used the technique presented\nin [26, 27]. The process can be written in a general form\nZ +∞\nK(x − x′ )η(x′ ) dx′ ,\n(36)\nφ(x) =\n−∞\n\n\f9\n\nDipole diffusion in a random electrical potential\n\nwhere K is a kernel function and η(x) is a Gaussian white noise. The linear form of (36), ensures\nthat φ(x) is a Gaussian process and the translationary invariance of the kernel K(x − x′ ) ensures\nR +∞\nits stationarity. Now taking the Fourier transform defined by φ̃(ω) = −∞ φ(x) exp(−iωx), dx of\n(36), we find\nφ̃(ω) = K̃(ω)η̃(ω).\n\n(37)\n′\n\nIf we now take the Fourier transform of the correlator (3) and the correlator hφ(ω)φ(ω )i from (37),\n ̃\nthen by identification, we have ∆(ω)\n= |K̃(ω)|2 and thus from (37)\nq\n ̃\n(38)\nφ̃(ω) = ∆(ω)η̃(ω)\n\nWe can now create φ(x) by sampling φ̃(ω) on a frequency mesh and taking the inverse fast Fourier\ntransform (FFT). In [10, 12], the authors used a method due to Kraichnan [1, 28] which gives\nsome finite size corrections for the diffusion constant close to the transition. However as we\nwish to precisely locate the transition and tests its dependence on κp (and as we do not have\nanalytical results for all parameter ranges) we use this FFT based method. Again we take a\ncorrelator of the form ∆(x) = exp(− 21 x2 ) and we average our sample over 2000 realizations of\nthe field. In all our simulation we set χ = 1. We measured the average value of κe over the\nfield with an error bar estimated from the standard deviation from sample to sample. The result\nin one dimension is compared in figure (1) for κp = 10 with the analytical result (33) and the\nKubo formula (26). As expected, we are well in the adiabatic regime and (33) is in a very good\nagreement with the numerical simulations. Moreover, we find a dynamical transition at βc = 1\nwhere the diffusion constant becomes zero and below the critical temperature Tc , the diffusion\nturns out to be anomalous (see later). Finally, the agreement between (33) and the numerical\nresults breaks down at high temperature, but fortunately in this regime the results agree with the\nweak disorder/high temperature analytical expression (26). We have thus a crossover between two\nanalytical approximation which allows us to predict the behavior of κe in the whole normal diffusion\nregime.\n\nBeyond the adiabatic approximation, that is to say when κp is of the same order of κx or smaller,\nwe lack analytical results (except for weak disorder), thus we must calculate κe numerically. The\nresults are plotted in figure (2) for κp = 1 and figure (3) for κp = 0.1 and compared with the weak\ndisorder result of equation (26). In both cases, the transition still appears to occur at, or very\nclose to, the same critical temperature Tc = 1. Moreover, the diffusion constant clearly decreases\nmonotonically with the value of κp at fixed temperature. The low temperature phase, below Tc , is\ncharacterized by an anomalous sub-diffusive behavior\nh(x(t) − x(0))2 i ∼ Ct2ν ,\n\n(39)\n\nwhere the exponent associated with the anomalous diffusion ν < 1/2. The subject of anomalous\ndiffusion in disordered media has been extensively studied and a good review of it can be found in\n[9]. In the case of κp → ∞ the authors in [10] were able to evaluate ν by means of first passage\ncalculation and replica trick and they found\nν=\n\n1\n.\n1+β\n\n(40)\n\n\f10\n\nDipole diffusion in a random electrical potential\n1\n0.8\n\nκe\n\n0.6\n0.4\n0.2\n\nPSfrag replacements\n0\n0\n\n0.2\n\n0.4\n\nβ\n\n0.6\n\n0.8\n\n1\n\nFigure 1. Numerical value of κe (stars) for κp = 10, compared with analytical results (26)\n(dashed line) and (33) (solid line).\n\n1\n0.8\n\nκe\n\n0.6\n0.4\n0.2\n\nPSfrag replacements\n0\n0\n\n0.2\n\n0.4\n\nβ\n\n0.6\n\n0.8\n\n1\n\nFigure 2. Numerical value of κe (plus) for κp = 1, compared with analytical results (26) (solid\nline).\n\nWe plot in figure 4 the value of the exponent ν fitted from simulations with (39) for different values\nof κp . The results agree relatively well with equation (40) for temperatures below but close to the\ntransition temperature. However for very low temperature, the exponent is significantly larger than\nthat predicted by equation (40). However we have verified that as the time of the simulation is\nincreased that the measured exponent appears to decrease (indeed this was the case in [10] where\nanalytical results and an effective trap model were available to identify the correct exponent).\n\n\f11\n\nDipole diffusion in a random electrical potential\n1\n0.8\n\nκe\n\n0.6\n0.4\n0.2\n\nPSfrag replacements\n0\n0\n\n0.2\n\n0.4\n\nβ\n\n0.6\n\n1\n\n0.8\n\nFigure 3. Numerical value of κe (plus) for κp = 0.1, compared with analytical results (26) (solid\nline).\n\n0.5\n\n0.4\n\nν\n\n0.3\n\n0.2\n\nPSfrag replacements\n0.1\n1\n\n2\n\n3\n\nβ\n\n4\n\n5\n\nFigure 4. Numerical value of ν (cross) for κp = 10, (stars) for κp = 1 and (plus) for κp = 0.1\ncompared with analytical results (40) (solid line) in the low temperature phase.\n\n5. Conclusions and discussion\nWe have studied the dynamics of a dipole diffusing in a random electrical field E derived from\na quenched Gaussian potential. In the adiabatic limit (where the dipoles adapt very quickly to\nthe local field), we showed that the coupled stochastic equation can be reduced, up to the order\nO(κx /κp ), to an effective Langevin equation for a particle diffusing in an effective potential with a\nspatially varying and anisotropic local diffusivity κij . In one dimension, we could compute exactly\nthe diffusion constant of this process and we found a dynamical transition at finite temperature\nβc = 1 with a crossover between a diffusive and a sub-diffusive regime. The validity of the effective\nLangevin equation (14) breaks down for small β, but a high temperature treatment allowed us to\n\n\fDipole diffusion in a random electrical potential\n\n12\n\ncompute a Kubo formula of κe for a given value of κp . We numerically checked our analytical\npredictions in one dimension finding good agreement and confirming the presence of the transition.\nWe also ran simulations far from the adiabatic regime and we found strong indications that the\ntransition remains at, or close to, the same βc as for the adiabatic limit. Finally, we performed\nextensive numerical simulations in the low temperature phase to compute the anomalous exponent\nν. We found that it does not depend on the relative values of diffusion constants of the particle's\nposition and dipole moment and agrees rather well with a calculation made for the adiabatic case\n[10].\nIn [12], the authors showed that in higher dimensions, for the adiabatic case case κp → ∞, that the\nsame type of dynamical transition is also present. It would be interesting to investigate the dipole\nproblem in higher dimensions to see if the conclusions of our current study remain valid. It would\nalso be interesting to see if renormalization group type treatments or other approximation schemes\ncould be developed in order to obtain analytical results in higher dimensions.\nAppendix A. Derivation of the effective long-time Langevin equation for x\nThis appendix gives the detail of the calculation of the effective long-time Langevin equation for x.\nThe first step is to formally integrate the equation (9) for the variable p to obtain\ns\n\u0012\n\u0013\nZ t\n2 χ\nβκp\nβκp\nt)+\nds exp −\n(t − s) κp βEi (x(s))+\nζi (t), (A.1)\npi (t) = pi (0) exp(−\nχ\nχ\nκp β\n0\nwhere\nζi (t) =\n\nκp β\nχ\n\nZ\n\nt\n\n0\n\n\u0013\n\u0012\nβκp\n(t − s) ηpi (s)\nds exp −\nχ\n\n(A.2)\n\nis a colored noise. At late times the first term of equation (A.1) is exponentially suppressed and\ncan thus be dropped giving\ns\n\u0013\n\u0012\nZ t\n2 χ\nβκp\n(t − s) κp βEi (x(s)) +\nζi (t).\n(A.3)\npi (t) =\nds exp −\nχ\nκp β\n0\nSubstituting this into equation (8) yields\ns\n\"Z\n#\n\u0013\n\u0012\nt\n√\ndxi\n∂Ej\nβκp\n2 χ\n= βκx\n(t − s) κp βEj (x(s)) +\nζj (t) + 2κx ηxi .(A.4)\nds exp −\ndt\n∂xi\nχ\nκ\nβ\np\n0\nTo proceed further we will find an effective Fokker-Planck equation corresponding to the stochastic\nequation (A.4). We follow the standard procedure of evaluating the change of an arbitrary function\nof x(t):\nh\n\ndf (x(t))\ni=\ndt\n=\n\nZ\n\nZ\n\ndx\n\n∂ρ(x, t)\nf (x)\n∂t\n\ndxHρ(x, t)f (x)\n\n\fDipole diffusion in a random electrical potential\nZ\n=\ndxρ(x, t)H † f (x) = hH † f (x(t))i\n\n13\n(A.5)\n\nwhere ρ(x, t) is the probability density for the process x at time t. The operator H is the\nforward Fokker-Planck operator and H † is its adjoint commonly called the backward Fokker-Planck\noperator. We now write using the Stratonovich prescription for white noise in stochastic calculus\n(where normal differentiation applies) to give\nh\n\ndxi (t)\n∂\ndf (x(t))\nf (x(t))\ni=h\ni\ndt\n∂xi\ndt\n= T1 + T2 + T3 .\n\nThe first term is\n\n(A.6)\n\n√\n2κx h∇i f (x(t))ηxi i,\n\n(A.7)\n\nwhich can be evaluated via Novikov's theorem as\nZ t\n√\n∂2f\nδxj (t)\nT1 = 2κx h\nhηx (s)ηxi (t)ii\nds\n∂xi ∂xj 0\nδηxl (s) l\n\n(A.8)\n\nT1 =\n\nwhich is true for any Gaussian noise. Now for a white noise correlation, if we work with a\nsymmetrised Dirac delta function corresponding to the Stratonovich prescription, the above integral\npicks up half the weight of the delta function. And we obtain\nr\nκx ∂ 2 f δxj (t)\n|s=t i.\n(A.9)\nh\nT1 =\n2 ∂xi ∂xj δηxi (s)\nThe functional derivatives required in the above calculations can be evaluated using a path integral\nformalism as in [20]. However they can also be obtained directly from the stochastic equation as\nfollows. Consider a general differential equation of the form\ndxi\n= Wi + Bij ξj .\ndt\nIn order to compute\n\nδxi (t)\nδξj (s)\n\n(A.10)\n\none can define the process\n\ndxǫi\n= Wi + Bij (ξj + ǫj δ(t − s)).\ndt\nNow from one of the standard definitions of the functional integral we have\nδxi (t)\n∂xǫi (t)\n|ǫ=0 .\n=\nδξj (s)\n∂ǫj\n\n(A.11)\n\n(A.12)\n\nIntegration of equation (A.11) in an infinitesimal interval about t = s yields\nxǫ (t+ ) = x(t− ) + Bij ǫj ,\n\n(A.13)\n\nas long as the Wi do not depend on the derivative of x. We see that in the case considered here\nthe Wi will be continuous at s = t and thus give no contribution to the functional derivative. This\nthus yields\nδxi (t)\n|s=t = Bij .\nδξj (s)\n\n(A.14)\n\n\fDipole diffusion in a random electrical potential\n\n14\n\nUsing this result we obtain\n√\nδxj (t)\n|s=t = 2κx δij ,\nδηxi (s)\n\n(A.15)\n\nwhich upon substitution in equation (A.9) gives\nT 1 = κx h\n\n∂2\nf (xt )i.\n∂xi ∂xi\n\n(A.16)\n\nThis is the familiar Laplacian form arising for standard white noise. The second term T2 is given\nby\nr\n√\nκx ∂Ej ∂f\nT2 = 2κx χ\nh\nζj (t)i.\n(A.17)\nκp ∂xi ∂xi\nOnce again using Novikov's theorem we find\n\u0012\n\u0013Z t\nr\n√\n∂Ej ∂f\nδxk (t)\nκx ∂\nT2 = 2κx χ\nh\nhζj (t)ζl (s)i.\nds\nκp ∂xk ∂xi ∂xi\nδζl (s)\n0\n\n(A.18)\n\nThe correlation function of the Gaussian field ζ is easily computed and is given for t > s by,\nZ s\n2\nhζi (t)ζj (s)i = α\ndu exp (−α(t + s − 2u)) ,\n(A.19)\n0\n\nwhere α = κp β/χ. At large t and s this becomes\nαδij\nexp(−α(t − s)).\n(A.20)\n2\nWe now consider the action of this correlation function as an operator on an arbitrary function g(s)\nvia the following operator expansion\n\u0014\n\u0015\nZ t\n1 d\n1\n1\ng(t) −\n(A.21)\ng(t) + O( 2 )\nds exp (−αs)) g(t − s) =\nα\nα dt\nα\n0\nhζi (t)ζj (s)i =\n\nand to leading order in 1/α we thus obtain\n\u0012\n\u0013\nr\n√\n∂Ej ∂f δxk (t)\nκx ∂\nh\n|t=s i.\nT2 = 2κx χ\nκp ∂xk ∂xi ∂xi δζj (s)\nNow repeating the argument leading to equation (A.15) we find that\ns\n∂Ej\nδxk (t)\n2\nχκx\n|t=s =\nδζj (s)\nκp\n∂xk\n\n(A.22)\n\n(A.23)\n\nand thus\nT 2 = κx χ\n\n2\n\n\u0012\n\nκx\nκp\n\n\u0013\n\n∂Ej ∂\nh\n∂xk ∂xk\n\n\u0012\n\n\u0013\n∂Ej ∂f\ni.\n∂xi ∂xi\n\n(A.24)\n\nOne thus sees that the noise ζ is to leading order white noise interpreted via the Stratonovich\nprescription. The final term to evaluate is\nZ\n∂f (x(t)) ∂Ej (x(t)) t\n2\nT 3 = β κx κp h\nds exp(−α(t − s))Ej (x(s))i\n(A.25)\n∂xi\n∂xi\n0\n\n\fDipole diffusion in a random electrical potential\nand so one needs to compute terms of the form\nZ t\nI = hA(x(t))\nds exp(−α(t − s))B(x(s))i,\n\n15\n\n(A.26)\n\n0\n\nbearing in mind that α is large. Now if ρ(x, t) is the probability density for the position x and H\nthe effective forward Fokker Planck operator, we may write the above as\nZ\nI = dxB(x)ρ(x, s) exp(−(t − s)(α − H † ))A(x).\n(A.27)\nThe density ρ obeys the Fokker Planck equation\n\n∂ρ\n= Hρ.\n∂t\nThe integration over s can be evaluated by integrating by parts, we have\nZ\n−\n\nt\n\n\u0002\n\u0003\nds ρ(x, s) exp(−(t − s)(α − H † )) = ρ(x, t) 1 − exp(−t(α − H † )) (α − H † )−1\n\nZ0 ∞\n0\n\n(A.28)\n\nds\n\n∂ρ(x, s)\nexp(−(t − s)(α − H † ))(α − H † )−1 .\n∂s\n\n(A.29)\n\nNow because the eigenvalues of H must be negative or zero, we may neglect the second term in the\nsquare brackets on the right hand side above. Another integration by parts yields\nZ t\nds ρ(x, s) exp(−(t−s)(α−H † )) = ρ(x, t)(α−H † )−1 −[Hρ(x, t)] (α−H † )−2 , (A.30)\n0\n\nwhere we have used equation (A.28) in the second term of the right hand side and the operator H\nin this term only acts on ρ inside the square bracket. All other operators act on the right and we\ncan now expand in powers of 1/α to obtain\nZ\n\nt\n\nds B(x)ρ(x, s) exp(−(t − s)(α − H † ))A(x) =\n0\n\u0015\n\u0014\nH†\nH†\nA(x)B(x)\n+ B(x) 2 A(x) − 2 A(x)B(x) .\nρ(x, t)\nα\nα\nα\n\n(A.31)\n\nNow putting all this together yields\n∂2\nhH † f (x)i = κx h\nf (xt )i\n∂x ∂x\n\u0012 i \u0013i\n\u0012\n\u0013\nκx\n∂Ej ∂\n∂Ej ∂f\n+ κx\nχ2 h\ni\nκp\n∂xk ∂xk ∂xi ∂xi\nχ\nχ\n∂f ∂Ej\n∂f ∂Ej\n∂f ∂Ej\nEj +\n−\nEj i. (A.32)\nEj H †\nH†\n+ κx βχh\n∂xi ∂xi\nκp β\n∂xi ∂xi\nκp β\n∂xi ∂xi\nThis can be written in the form\nhH † f (x)i = hH0† f (x)i\n\n\fDipole diffusion in a random electrical potential\n16\n\u0014\n\u0012\n\u0013\n\u0015\n∂Ej ∂\n∂f ∂Ej\n∂f ∂Ej\nκx\n∂Ej ∂f\nκx\nhκx\n+ Ej H †\n− H†\nEj i + O(( )2 ),\n+ χ2\nκp\n∂xk ∂xk ∂xi ∂xi\n∂xi ∂xi\n∂xi ∂xi\nκp\n(A.33)\nwhere\nH0† f = κx [\n\n∂2f\n∂f ∂Ej\n+ βχ\nEj ].\n∂xi ∂xi\n∂xi ∂xi\n\n(A.34)\n\nThis is the only term remaining strictly in the limit κp → ∞ and corresponds exactly to a Langevin\nparticle in an effective potential V given by equation (11). Now keeping the first term of O(κx /κp )\nwe may write equation (A.33) as\nhH † f (x)i = hH0† f (x)i\n\u0014\n\u0012\n\u0013\n\u0015\n∂Ej ∂\n∂f ∂Ej\n∂f ∂Ej\n∂Ej ∂f\nκx\nhκx\n+ Ej H0†\n− H0†\nEj i\n+ χ2\nκp\n∂xk ∂xk ∂xi ∂xi\n∂xi ∂xi\n∂xi ∂xi\n\u0012\n\u0013\n2\n∂Ej ∂Ej ∂f\n∂El\n∂\n∂Ej ∂Ej ∂f\nκx χ\n+ βχ\nh\nEl\ni.\n= hH0† f (x)i − κx\nκp ∂xk ∂xk ∂xi ∂xi\n∂xk ∂xi ∂xi ∂xk\nFinally the above may be written as\n\u0012\n\u0013\n∂\n∂f\n∂V ∂f\nhH † f (x)i = h\nκki\n− βκki\ni,\n∂xk\n∂xi\n∂xk ∂xi\n\n(A.35)\n\n(A.36)\n\nwith κij the spatially varying and anisotropic diffusivity tensor given by (13) and V the potential\ndefined by (7).\nReferences\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n\nDean DS, Drummond IT and Horgan RR, 2007 J. Stat. Mech. P07013.\nDean D S, Drummond I T and Horgan R R, 1994 J. Phys:A: Math Gen 27, 5135.\nDeem M W and Chandler D, 1994 J. Stat. Phys 76, 911.\nMatheron G, 1967 Eléments pour une Théorie des Milieux Poreux (Paris: Masson)\nKing P R, 1987 J. Phys. A 20, 3935\nKing P R, 1989 Transport in Porous Media 4, 37\nDe Wit A, 1995 Phys. Fluids 7 2553\nSposito G, 2001 Transport Porous Media 42 181\nBouchaud J-P and Georges A, 1990 Phys. Rep. 195 127.\nTouya C and Dean D S, 2007 J. Phys. A: Math. Theor. 40, 919.\nChen L G, Falcioni M and Deem M W, 2000 J. Phys. Chem. B 104, 6033.\nDean D S and Touya C, 2008 J. Phys. A : Math. Theor. 41, 335002.\nDrummond I T, Horgan R R, and da Silva Santos C A, 1998 J. Phys A: Math. Gen 31, 1341.\nMarinari E, Parisi G and Ritort F, 1994 J. Phys. A: Math. Gen. 27 7615.\nMarinari E, Parisi G and Ritort F, 1994 J. Phys. A: Math. Gen. 27 7647.\nBouchaud J-P and Mézard M, 1994 J. Physique I 4 1109.\nDe Masi A, Ferrari P A, Goldstein S and Wick W D, 1989 J. Stat. Phys. 55 787.\nOsada H, 1998 Probab. Theory Relat. Fields 112 53.\nRisken H, 1996 The Fokker-Planck equation: 3rd edition, Springer-Verlag; Berlin, Heidelberg, New York.\nSan Miguel M and Sancho J M, 1980 J. Stat. Phys. 22, 605.\nWe assume that the system is in equilibrium in a finite volume and the subsequent late time diffusion constant is\ncomputed at times such that the particle has diffused over a distance much larger than the system's correlation\nlength but much small than the system's size.\n[22] Zwansig R, 1988 Proc. Nat. Acad. Sci. 85, 2029.\n\n\fDipole diffusion in a random electrical potential\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n\nDe Gennes P G, 1975 J. Stat. Phys. 12, 463.\nDrummond I T, Hoch A and Horgan R R, 1986 J. Phys:A: Math Gen 19, 387.\nHoneycutt R L, 1992 Phys Rev A 45, 600.\nMajumdar S N and Sire C, 1996 Phys. Rev. Lett. 77, 1420.\nSire C, 2008 Phys. Rev. E 78, 011121.\nKraichnan R H, 1976 J. Fluid Mech. 77, 753.\n\n17\n\n\f"}