{"id": "http://arxiv.org/abs/1003.5647v1", "guidislink": true, "updated": "2010-03-29T19:37:58Z", "updated_parsed": [2010, 3, 29, 19, 37, 58, 0, 88, 0], "published": "2010-03-29T19:37:58Z", "published_parsed": [2010, 3, 29, 19, 37, 58, 0, 88, 0], "title": "From (pi, 0) magnetic order to superconductivity with (pi, pi) magnetic\n  resonance in Fe1.02(Te1-xSex)", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.3065%2C1003.2715%2C1003.1578%2C1003.4706%2C1003.2311%2C1003.5545%2C1003.4425%2C1003.1938%2C1003.3742%2C1003.0154%2C1003.5647%2C1003.5897%2C1003.0578%2C1003.1753%2C1003.3886%2C1003.1727%2C1003.0218%2C1003.4802%2C1003.5582%2C1003.0630%2C1003.3774%2C1003.5731%2C1003.2680%2C1003.0640%2C1003.2722%2C1003.1217%2C1003.1122%2C1003.5223%2C1003.3393%2C1003.5782%2C1003.3509%2C1003.2310%2C1003.0564%2C1003.4762%2C1003.1454%2C1003.1874%2C1003.5195%2C1003.2168%2C1003.4886%2C1003.5141%2C1003.4235%2C1003.1847%2C1003.3163%2C1003.5847%2C1003.4937%2C1003.4624%2C1003.5625%2C1003.2702%2C1003.3573%2C1003.4282%2C1003.3061%2C1003.6109%2C1003.0708%2C1003.5302%2C1003.5821%2C1003.0320%2C1003.3037%2C1003.0101%2C1003.1990%2C1003.0367%2C1003.3127%2C1003.5668%2C1003.4744%2C1003.5042%2C1003.2978%2C1003.3162%2C1003.0330%2C1003.0566%2C1003.2025%2C1003.4539%2C1003.4995%2C1003.1551%2C1003.5623%2C1003.2740%2C1003.5880%2C1003.4069%2C1003.4703%2C1003.4470%2C1003.5546%2C1003.1498%2C1003.0794%2C1003.0202%2C1003.2499%2C1003.1188%2C1003.2769%2C1003.3149%2C1003.1881%2C1003.3682%2C1003.4406%2C1003.4104%2C1003.2236%2C1003.5446%2C1003.0297%2C1003.3158%2C1003.2988%2C1003.5573%2C1003.0141%2C1003.3702%2C1003.3693%2C1003.1045%2C1003.5750&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "From (pi, 0) magnetic order to superconductivity with (pi, pi) magnetic\n  resonance in Fe1.02(Te1-xSex)"}, "summary": "The iron chalcogenide Fe1+y(Te1-xSex) is structurally the simplest of the\nFe-based superconductors. Although the Fermi surface is similar to iron\npnictides, the parent compound Fe1+yTe exhibits antiferromagnetic order with\nin-plane magnetic wave-vector (pi, 0). This contrasts the pnictide parent\ncompounds where the magnetic order has an in-plane magnetic wave-vector (pi,\npi) that connects hole and electron parts of the Fermi surface. Despite these\ndifferences, both the pnictide and chalcogenide Fe-superconductors exhibit\nsuperconducting spin resonances around (pi, pi), suggesting a common symmetry\nfor their superconducting order parameter. A central question in this\nburgeoning field is therefore how (pi, pi) superconductivity can emerge from a\n(pi, 0) magnetic instability. Here, we report that the magnetic soft mode\nevolving from the (pi, 0)-type magnetic long-range order is associated with\nweak charge carrier localization. Bulk superconductivity occurs only as the\nmagnetic mode at (pi, pi) becomes dominant upon doping. Our results suggest a\ncommon magnetic origin for superconductivity in iron chalcogenide and pnictide\nsuperconductors.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.3065%2C1003.2715%2C1003.1578%2C1003.4706%2C1003.2311%2C1003.5545%2C1003.4425%2C1003.1938%2C1003.3742%2C1003.0154%2C1003.5647%2C1003.5897%2C1003.0578%2C1003.1753%2C1003.3886%2C1003.1727%2C1003.0218%2C1003.4802%2C1003.5582%2C1003.0630%2C1003.3774%2C1003.5731%2C1003.2680%2C1003.0640%2C1003.2722%2C1003.1217%2C1003.1122%2C1003.5223%2C1003.3393%2C1003.5782%2C1003.3509%2C1003.2310%2C1003.0564%2C1003.4762%2C1003.1454%2C1003.1874%2C1003.5195%2C1003.2168%2C1003.4886%2C1003.5141%2C1003.4235%2C1003.1847%2C1003.3163%2C1003.5847%2C1003.4937%2C1003.4624%2C1003.5625%2C1003.2702%2C1003.3573%2C1003.4282%2C1003.3061%2C1003.6109%2C1003.0708%2C1003.5302%2C1003.5821%2C1003.0320%2C1003.3037%2C1003.0101%2C1003.1990%2C1003.0367%2C1003.3127%2C1003.5668%2C1003.4744%2C1003.5042%2C1003.2978%2C1003.3162%2C1003.0330%2C1003.0566%2C1003.2025%2C1003.4539%2C1003.4995%2C1003.1551%2C1003.5623%2C1003.2740%2C1003.5880%2C1003.4069%2C1003.4703%2C1003.4470%2C1003.5546%2C1003.1498%2C1003.0794%2C1003.0202%2C1003.2499%2C1003.1188%2C1003.2769%2C1003.3149%2C1003.1881%2C1003.3682%2C1003.4406%2C1003.4104%2C1003.2236%2C1003.5446%2C1003.0297%2C1003.3158%2C1003.2988%2C1003.5573%2C1003.0141%2C1003.3702%2C1003.3693%2C1003.1045%2C1003.5750&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The iron chalcogenide Fe1+y(Te1-xSex) is structurally the simplest of the\nFe-based superconductors. Although the Fermi surface is similar to iron\npnictides, the parent compound Fe1+yTe exhibits antiferromagnetic order with\nin-plane magnetic wave-vector (pi, 0). This contrasts the pnictide parent\ncompounds where the magnetic order has an in-plane magnetic wave-vector (pi,\npi) that connects hole and electron parts of the Fermi surface. Despite these\ndifferences, both the pnictide and chalcogenide Fe-superconductors exhibit\nsuperconducting spin resonances around (pi, pi), suggesting a common symmetry\nfor their superconducting order parameter. A central question in this\nburgeoning field is therefore how (pi, pi) superconductivity can emerge from a\n(pi, 0) magnetic instability. Here, we report that the magnetic soft mode\nevolving from the (pi, 0)-type magnetic long-range order is associated with\nweak charge carrier localization. Bulk superconductivity occurs only as the\nmagnetic mode at (pi, pi) becomes dominant upon doping. Our results suggest a\ncommon magnetic origin for superconductivity in iron chalcogenide and pnictide\nsuperconductors."}, "authors": ["T. J. Liu", "J. Hu", "B. Qian", "D. Fobes", "Z. Q. Mao", "W. Bao", "M. Reehuis", "S. A. J. Kimber", "K. Prokes", "S. Matas", "D. N. Argyriou", "A. Hiess", "A. Rotaru", "H. Pham", "L. Spinu", "Y. Qiu", "V. Thampy", "A. T. Savici", "J. A. Rodriguez", "C. Broholm"], "author_detail": {"name": "C. Broholm"}, "author": "C. Broholm", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1038/nmat2800", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1003.5647v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1003.5647v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "17 pages, 4 figures", "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1003.5647v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1003.5647v1", "journal_reference": "Nature Materials 9,718-720 (2010)", "doi": "10.1038/nmat2800", "fulltext": "From (0) magnetic order to superconductivity with () magnetic\nresonance in Fe1.02(Te1-xSex)\nT.J. Liu1, J. Hu1, B. Qian1, D. Fobes1, Z.Q. Mao1*, W. Bao2, M. Reehuis3, S.A.J. Kimber3, K.\nProkes3, S. Matas3, D.N. Argyriou3, A. Hiess4, A. Rotaru5, H. Pham5, L. Spinu5, Y. Qiu6,7, V.\nThampy8, A.T. Savici8, J. A. Rodriguez8, and C. Broholm6,8\n1\n\nDepartment of Physics and Engineering Physics, Tulane University, New Orleans, Louisiana\n\n70118, USA\n2\n\nDepartment of Physics, Renmin University of China, Beijing 100872, China\n\n3\n\nHelmholtz-Zentrum Berlin für Materialen und Energie, Hahn-Meitner Platz 1, D-14109\n\nBerlin, Germany\n4\n\nInstitut Max von Laue-Paul Langevin, 6 rue Jules Horowitz, BP 156, F-38042, Grenoble\n\nCedex 9, France\n5\n\nAdvanced Materials Research Institute and Department of Physics, University of New\n\nOrleans, New Orleans, Louisiana 70148, USA\n6\n\nNIST Center for Neutron Research, National Institute of Standards and Technology,\n\nGaithersburg, Maryland 20899, USA\n7\n\nDepartment of Materials Science and Engineering, University of Maryland, College Park,\n\nMaryland 20899, USA\n8\n\nInstitute for Quantum Matter and Department of Physics and Astronomy, The Johns\n\nHopkins University, Baltimore, Maryland 21218 USA\n\nThe iron chalcogenide Fe1+y(Te1-xSex) is structurally the simplest of the Fe-based\nsuperconductors1-3. Although the Fermi surface is similar to iron pnictides4-5, the parent\ncompound Fe1+yTe exhibits antiferromagnetic order with in-plane magnetic wave-vector\n(0)6. This contrasts the pnictide parent compounds where the magnetic order has an\n1\n\n\fin-plane magnetic wave-vector () that connects hole and electron parts of the Fermi\nsurface7-8. Despite these differences, both the pnictide and chalcogenide Fesuperconductors exhibit superconducting spin resonances around (π, π)9-11, suggesting a\ncommon symmetry for their superconducting order parameter. A central question in\nthis burgeoning field is therefore how (π, π) superconductivity can emerge from a (π, 0)\nmagnetic instability 12. Here, we report that the magnetic soft mode evolving from the (π,\n0)-type magnetic long-range order is associated with weak charge carrier localization.\nBulk superconductivity occurs only as the magnetic mode at (π, π) becomes dominant\nupon doping. Our results suggest a common magnetic origin for superconductivity in\niron chalcogenide and pnictide superconductors.\n\nUnconventional superconductivity in cuprates, heavy fermion intermetallics, and\nstrontium ruthenate all appear in close proximity to magnetic instabilities and appears to be\nmediated by spin fluctuations. The newly discovered iron pnictide superconductors13-16\nfollow the paradigm of superconductivity achieved by suppressing a long-range magnetic\norder through charge carrier doping or pressure. The long-range antiferromagnetic (AFM)\norder in the parent compounds of iron pnictide superconductors is characterized by the inplane Fermi surface nesting wave-vector Qn = (π, π)7-8. (Here and throughout the paper we\nrefer to wave vectors in units of the inverse tetragonal lattice parameters.) Iron chalcogenide\nFe1+y(Te1-xSex) superconductors, discovered more recently1-3 , have a similar Fermi surface as\nthat of iron pnictides, according to both density functional calculations4 and photoemission\nmeasurements 5. However, the undoped parent compound of this system, Fe1.02Te, exhibits an\nAFM order characterized by an in-plane wave vector Qm = (π, 0)6, which distinguishes this\ncompound from the iron pnictide parent materials. Yet both doped iron chacolgenide 11 and\niron pnictide 9-10 superconductors exhibit a magnetic resonance in the spin excitation spectra\n\n2\n\n\fbelow Tc around the wave vector (π, π), consistent with s pairing symmetry 17-19.\nResolution of the dichotomy between (π, 0) magnetic order in undoped FeTe and\nsuperconductivity with (π, π) magnetic resonance in Se doped samples is a key challenge to\nour emerging understanding of iron based superconductivity 12.\n\nIn this work, we address the challenge through systematic investigation of transport,\nmagnetic, and superconducting properties in various regions of the phase diagram of\nFe1.02(Te1-xSex) via resistivity, Hall coefficient, magnetic susceptibility, specific heat, and\nneutron scattering measurements. We find that magnetic correlation of the (π, 0) variety\nsurvive as short-range magnetic fluctuations after the long-range ordered AFM phase has\nbeen suppressed by partial Se substitution for Te. These correlations appear to suppress bulk\nsuperconductivity and lead to weak charge carrier localization in under-doped sample. Bulk\nsuperconductivity occurs only when magnetic correlations near (π, 0), though still present,\nare strongly suppressed and spin fluctuations near (π, π) become dominant for x > 0.29, with\nthe latter spin fluctuations exhibiting a spin gap and a spin resonance in the superconducting\nstate 11,20. These results indicate that short-range magnetic fluctuations near (π, 0) are\nincompatible with superconductivity and that the superconducting mechanisms of iron\nchalcogenides and iron pnictides have similar origins associated with (π, π) spin-fluctuations.\n\nUsing a variety of techniques we have constructed a detailed electronic and magnetic\nphase diagram of Fe1.02(Te1-xSex) with 0 ≤ x < 0.5, which is shown in Figure 1a . In summary,\nwe find three composition regions with distinct physical properties. Region I (0 ≤ x < 0.09)\nexhibits long range AFM order with wave vector (π, 0), while Region II (0.09 < x < 0.29)\ndisplays short range magnetic correlations at the same wave vector. Samples from both these\nregions exhibit non-bulk superconductivity. Only in Region III (x  0.29) do we find evidence\n3\n\n\fof bulk superconductivity. More specifically in Fig. 1a, symbols ▓, ▼, ▲, +, represent the\nNéel temperatures TN determined by neutron diffraction, dc susceptibility, Hall coefficient,\nand resistivity measurements respectively. Importantly, these disparate measurements are\nentirely consistent with each other. TN gradually decreases with increasing Se content,\napproaching zero as x is increased to ~ 0.09. A trace of superconductivity is observed for 0.04\n≤ x < 0.09, which will be examined in greater detail later in Fig. 3. The symbol ◊ represents\nthe onset of superconducting transition Tc probed by resistivity. In Region II (0.09 < x <\n0.29), though long-range AFM order is fully suppressed, superconductivity remains non-bulk\nand the superconducting volume fraction, VSC, is less than 3% for all samples with x < 0.29.\nIn Region III (x ≥ 0.29), however, bulk superconductivity is found. Symbol ♦ represents the\nbulk superconducting transition temperature Tc probed by susceptibility. VSC rises to above\n75 % for x  0.29, as shown in Fig. 1b. In Region II, the transport properties above Tc\nindicate weak charge localization which contrasts with the metallic behavior seen in the\nnormal state of Region III and the AFM phase of Region I. The cross over is clearly indicated\nby the sign change in the derivative of resistivity with respect to temperature d/dT (see Fig.\n1b). The absence of bulk superconductivity in Region II makes the phase diagram of\nFe1.02(Te1-xSex) distinct from those of iron pnictide superconductors where bulk\nsuperconductivity either appears immediately following suppression of long-range AFM\norder 21-22, or putatively coexist with () AFM order in a certain composition range 23-25.\n\nWe shall now address properties of each region of the phase diagram (Fig. 1a) in greater\ndetail. Throughout the AFM phase (Region I), neutron scattering measurements reveal the\nsame commensurate (π, 0) magnetic structure as reported for the parent compound 6. The\nordered magnetic moment of iron MFe depends strongly on Se content as shown in Fig. 2a.\nMFe is approximately 2.09(3) μB/Fe for the x = 0.04 sample, but decreases to 0.33(2) μB/Fe for\n4\n\n\fthe x = 0.08 sample. The saturated staggered magnetic moment for Fe1.02Te is much larger\nthan that of iron pnictide parent compounds (for example, 0.36 B/Fe for LaOFeAs7 and 0.87\n\nB/Fe for BaFe2As28 ). This implies that the mechanism for magnetism in Fe1+yTe is different\nfrom that of pnictide parent materials 26-27. Hall effect measurements shown in Fig. 2b\nindicate that the AFM transition in Region I is accompanied by a remarkable change of the\nFermi surface. For x < 0.08 the Hall coefficient RH exhibits a sharp drop from a positive to a\nnegative value across the transition. This indicates that the Fermi surface is dominated by\nholes above TN and by electrons below TN.\n\nFigure 3a presents the in-plane resistivity ab(T) as a function of temperature for typical\nsamples in Region I. ab(T) exhibits an anomaly at TN, which is marked by a downward arrow\nin the figure. Each sample in this region also shows a trace of superconductivity below the\nAFM transition. This can be seen from the second drop of ab(T) at low temperatures\n(denoted by upward arrows in Fig. 3a). While Tc shows a systematic increase with increasing\nSe content in this region, the superconducting volume fraction is nearly zero (Fig. 1b and 3d)\nsince we did not observe any diamagnetism below Tc for these samples (see Fig. 3d). The\nabsence of bulk superconductivity in Region I is also demonstrated by the neutron scattering\ndata shown in Fig. 2a. We do not observe any drop in the ordered magnetic moment below\nTc . This is opposite to the behavior seen in Co-doped BaFe2As2 where the magnetic order\nparameter exhibits a sharp decrease below Tc in the region of coexistence between magnetism\nand superconductivity 25.\nDespite the complete suppression of long range AFM order, superconductivity remains a\nnon-bulk phenomenon throughout Region II. Although all samples in this region exhibit zero\nresistance below Tc, their susceptibility fails to display significant diamagnetism when the\n\n5\n\n\fresistivity vanishes (Fig. 1b and 3d). The superconducting volume fraction of these samples\nestimated from -4 is thus below 3%. Further, the specific heat of samples in both Regions I\nand II are free of anomalies near the resistive superconducting transition. They can\napproximately be described by C = T+T3 at low temperatures, where T and T3 represent\nthe electron and phonon specific heat respectively. Figure 3e shows data for typical samples.\nThe electronic specific coefficient  derived from linear fitting for various samples is given in\nthe left inset to Fig. 3e. The right inset to Fig. 3e displays an example of the fit for the x =\n0.19 sample where we observe a slight deviation from linearity below 4.5 K which may be\ndue to non-bulk superconductivity. The significant increase of  for x  0.09 is associated\nwith enhanced magnetic fluctuations as shown below.\n\nIn contrast, samples in Region III exhibit characteristics of bulk superconductivity. Their\nsusceptibility exhibits significant diamagnetism below Tc and anomalous peaks near Tc in\nspecific heat data also indicates a bulk phase transitions (see Fig. 3d and 3e). The inferred\nsuperconducting volume fraction rises to above 75% for x  0.29 (Fig. 1b). In addition,\nsamples with bulk superconductivity in Region III differ from samples with non-bulk\nsuperconductivity in Region II in their normal state properties as noted above. As shown in\nFig. 3b and 3c, the normal state in Region III exhibits metallic behavior in ab(T). However,\nsamples in Region II display a noticeable non-metallic upturn prior to the superconducting\ntransitions in ab(T). When Tc < T < 20 K, ab(T) is characterized by a logarithmic\ntemperature dependence ( see supplemental information), indicating weak charge carrier\nlocalized in Region II.\n\nWhy is bulk superconductivity suppressed and charge carriers weakly localized in\nRegion II? It is a critical question to understand the difference between iron chalcogenide and\n6\n\n\firon pnictide superconductors, so we examine several possible explanations in the following.\nOne possibility is that the quenched disorder induced charge localization suppresses\nsuperconductivity. Less disorder in Region III than Region II would however be most\nsurprising in this alloy system. We do however have evidence that the magnetic correlations\nare changing profoundly from region II to region III. Our early neutron scattering\nmeasurements revealed that when the long-range AFM order is suppressed, strong shortrange fluctuating remain near (π, 0) 6, a behavior subsequently confirmed elsewhere28-29.\n\nTo\n\nclarify the role of such short-range magnetic fluctuations, we performed neutron scattering\nmeasurements on two typical single crystal samples with x = 0.19 and 0.38. The x = 0.19\nsample resides in Region II and has a superconducting volume fraction of ~ 2%, whereas the\nx = 0.38 sample is in Region III and has a superconducting volume fraction of ~90%. As\nshown in Fig. 4a and 4b, both samples exhibit quasi-elastic scattering centered near (π, 0).\nWith the data normalized to phonon intensity, (0) magnetism in the x = 0.19 sample is\nsignificantly stronger than in the x = 0.38 sample, indicating that quasi-static short-range\nmagnetic order of the (π, 0) variety is associated with region II and is suppressed in Region\nIII. This short range order co-exists with (π, π) spin fluctuations for which a spin-gap and a\nmagnetic resonance forms for the x = 0.38 sample in the bulk superconducting state. For a\nsample with x = 0.27, well into Region II Lumsden et al. also find spin excitations at the\nsame wave vector 30, suggesting that magnetic scattering at (π, π) and (π, 0) co-exist over a\nwide range in composition.\n\nTo explore this co-existence, we performed inelastic neutron scattering measurements on\nan x = 0.05 single crystal. This sample exhibits long range (π, 0) magnetic order with an\nordered moment of 1.68(6) μB/Fe. In Fig. 4(c) we illustrate typical transverse inelastic\nneutron scattering scans centered at (π, π) which were measured up to 8 meV, and show the\n\n7\n\n\fpresence of well defined magnetic excitations similar to those we reported earlier for an x =\n0.4 sample 20.\n\nFor the lower energy excitation at 2 meV we find a peak with a width\n\nbroader than the Q-resolution of the instrument. The flat-top structure suggests that it consist\nof two components that separate through dispersion at higher energies. As found previously\nfor an x = 0.4 sample, the corresponding dispersion relation extrapolates to incommensurate\npoints (1/2+ε, 1/2-ε) with ε = 0.10(1), however, with a softer dispersion velocity of 62(5)\nmeV Å as compared to 345(2) meV Å for the x = 0.4 bulk superconducting sample 20.\n\nThese results indicate that magnetic correlations characterized by Qm = (π, 0) are not\nfavorable to superconducting pairing on the contrary these quasi-static and low energy\nfluctuations may instead be pair breaking. This scenario is corroborated by our neutron\nscattering measurements performed on a sample Fe1.11(Te0.62Se0.38), with excess Fe. Though\nthe 38% Se content would place the sample in Region III, we found similar properties as for\nsamples in Region II: Both susceptibility and specific heat measurements indicate that bulk\nsuperconductivity is suppressed; the resistivity follows a logarithmic temperature dependence\nindicating weakly localized charge carriers (see supplemental information), consistent with\nour previous report31. Our neutron scattering measurements (shown in the supplemental\ninformation) show an absence of low energy magnetic scattering at (π, π) but clearly defined\nmagnetic short range ordering at (π, 0). This result indicates that magnetic fluctuations near\n(π, 0) are incompatible with superconductivity and instead are associated with weak charge\ncarrier localization.\n\nWe have explored the dichotomy between (π, 0) and (π, π) magnetism in the Fe1.02(Te1xSex)\n\nsystem. For low Se content long range magnetic order is formed with a magnetic wave\n\nvector (π, 0). Dynamic magnetic correlations with a (π, π) wave vector however, do co-exist\n\n8\n\n\fin the material. Increasing Se doping tunes the relative strength of these distinct correlations.\nHowever, as long range magnetic order at (π, 0) is replaced by short range quasi-static\ncorrelations, long range magnetic order at (π, π) is never observed in the system. It may be\nsuppressed by increasing Se content as for the charge doped iron pnictides. For bulk\nsuperconducting samples it is at the (π, π) magnetic wave vector that a spin gap and a\nmagnetic resonance is formed, a result that can be taken as confirmation of s± type\nsuperconductivity 17-19. This indicates that both iron chalcogenide and iron pnictide\nsuperconductors have a similar magnetic mechanism for superconducting pairing. Our early\nwork shows that the superconductivity of the Fe1+y(Te1-xSex) system also depends on excess\nFe content; increasing excess Fe content suppresses superconductivity 31, and therefore the\nphase boundary between non-bulk and bulk superconductivity in Fig. 1a depends on the\nexcess Fe content y. The current boundary of x = 0.29 is valid for y = 0.02. If y is larger than\n0.1, the bulk superconductivity is suppressed even for x > 0.29 31. Overall, our phase diagram\nin Fig. 1a is consistent with previous reports of bulk superconductivity in Fe1+y(Te1-xSex)\nsingle crystals 29,31-32.\n\nIn conclusion magnetic correlations near (π, 0) are not favorable to superconductivity but\nare associated with weak charge carrier localization in an intermediate region between longrange AFM and superconductivity. Bulk superconductivity occurs only in a composition\nregion where (π, 0) magnetic correlation are strongly suppressed and (π, π) spin fluctuations\nassociated with the nearly nesting Fermi surface dominate. This indicates that iron\nchalcogenide and iron pnictide superconductors, despite a competing magnetic instability in\nthe former, have a similar mechanism for superconductivity.\n\n*e-mail: zmao@tulane.edu\n\n9\n\n\fAcknowledgements\nThe work at Tulane is supported by the NSF under grant DMR-0645305 for materials and\nequipment, the DOE under DE-FG02-07ER46358 for personnel. Work at AMRI was\nsupported by DARPA through Grant HR 0011-09-1-0047. Work at NIST is in part supported\nby the NSF under Grant DMR-0454672. Work at the Johns Hopkins University Institute for\nQuantum Matter is supported by the DOE under DE-FG02-08ER46544. DNA and KP, thanks\nthe Deutsche Forschungsgemeinschaft for support under SPP 1458.\n\nMethods\nFe1.02(Te1-xSex) single crystals used in this study were synthesized using a flux method 31\nand were shown to be tetragonal phase with the space group P4/nmm at room temperature by\nx-ray and neutron diffraction measurements 6. The compositions of crystals were determined\nusing energy dispersive x-ray spectrometer (EDXS). Since our early studies revealed that\nproperties of this system are sensitive to Fe nonstoichiometry 6,31, we have chosen samples\nwith the excess Fe less than 3% for all compositions to avoid complications caused by excess\nFe. We measured resistivity with a four-probe method, Hall effect with a five-probe method,\nand specific heat with an adiabatic relaxation technique using commercial Physical Property\nMeasurement System. DC magnetic susceptibility was measured using commercial SQUID.\nNeutron diffraction experiments were carried out on the 4-circle diffractometer E5 and the 2axis diffractometer E4 at the BER II reactor at the Helmholtz-Zentrum, and neutron scattering\nmeasurements probing magnetic short-range order and excitations were performed using\nMACS and DCS instruments at NIST. Inelastic neutron scattering measurements were carried\nout on the x = 0.05 sample using the triple axis spectrometer IN8 operated by the Institut\nLaue-Langevin (ILL), with the sample mounted with the c-axis vertical giving us access to\nspin excitations within the basal ab-plane.\n\n10\n\n\fReferences:\n1\n\nHsu, F. C. et al. Superconductivity in the PbO-type structure -FeSe. Proc. Natl.\nAcad. Sci. USA. 105, 14262-14264 (2008).\n\n2\n\nFang, M. H. et al. Superconductivity close to magnetic instability in Fe(Se1-xTex)0.82.\nPhys. Rev. B 78, 224503 (2008).\n\n3\n\nMedvedev, S. et al. Electronic and magnetic phase diagram of -Fe1.01Se with\nsuperconductivity at 36.7 K under pressure. Nature Mater. 8, 630-633 (2009).\n\n4\n\nSubedi, A., Zhang, L. J., Singh, D. J. & Du, M. H. Density functional study of FeS,\nFeSe, and FeTe: Electronic structure, magnetism, phonons, and superconductivity.\nPhys. Rev. B 78, 134514 (2008).\n\n5\n\nXia, Y. et al. Fermi Surface Topology and Low-Lying Quasiparticle Dynamics of\nParent Fe1+xTe/Se Superconductor. Phys. Rev. Lett. 103, 037002 (2009).\n\n6\n\nBao, W. et al. Tunable ()-Type Antiferromagnetic Order in -Fe(Te,Se)\nSuperconductors. Phys. Rev. Lett. 102, 247001-247004 (2009).\n\n7\n\nde la Cruz, C. et al. Magnetic order close to superconductivity in the iron-based\nlayered LaO1-xFxFeAs systems. Nature 453, 899-902 (2008).\n\n8\n\nHuang, Q. et al. Neutron-Diffraction Measurements of Magnetic Order and a\nStructural Transition in the Parent BaFe2As2 Compound of FeAs-Based HighTemperature Superconductors. Phys. Rev. Lett. 101, 257003-257004 (2008).\n\n9\n\nChristianson, A. D. et al. Unconventional superconductivity in Ba0.6K0.4Fe2As2 from\ninelastic neutron scattering. Nature 456, 930-932 (2008).\n\n10\n\nLumsden, M. D. et al. Two-dimensional resonant magnetic excitation in\nBaFe1.84Co0.16As2. Phys. Rev. Lett. 102, 107005 (2009).\n\n11\n\nQiu, Y. M. et al. Spin Gap and Resonance at the Nesting Wave Vector in\nSuperconducting FeSe0.4Te0.6. Phys. Rev. Lett. 103, 067008 (2009).\n11\n\n\f12\n\nBalatsky, A. V. & Parker, D. Not all iron superconductors are the same. Physics 2, 59\n(2009).\n\n13\n\nKamihara, Y., Watanabe, T., Hirano, M. & Hosono, H. Iron-based layered\nsuperconductor La[O1-xFx]FeAs (x=0.05-0.12) with TC = 26 K. J. Am. Chem. Soc. 130,\n3296 (2008).\n\n14\n\nTakahashi, H. et al. Superconductivity at 43K in an iron-based layered compound\nLaO1-xFxFeAs. Nature 453, 376-378 (2008).\n\n15\n\nChen, X. H., Wu, T., Wu, G., Liu, R. H. & Fang, D. F. Superconductivity at 43 K in\nSmFeAsO1-xFx. Nature 453, 761-762 (2008).\n\n16\n\nRotter, M., Tegel, M. & Johrendt, D. Superconductivity at 38 K in the iron arsenide\n(Ba1-xKx)Fe2As2. Phys. Rev. Lett. 101, 107006 (2008).\n\n17\n\nMazin, I. I., Singh, D. J., Johannes, M. D. & Du, M. H. Unconventional\nSuperconductivity with a Sign Reversal in the Order Parameter of LaFeAsO1-xFx.\nPhys. Rev. Lett. 101, 057003 (2008).\n\n18\n\nChubukov, A. V., Efremov, D. V. & Eremin, I. Magnetism, superconductivity, and\npairing symmetry in iron-based superconductors. Phys. Rev. B 78, 134512 (2008).\n\n19\n\nMaier, T. A., Graser, S., Scalapino, D. J. & Hirschfeld, P. Neutron scattering\nresonance and the iron-pnictide superconducting gap. Phys. Rev. B 79, 134520 (2009).\n\n20\n\nArgyriou, D. et al. Incommensurate itinerant antiferromagnetic excitations and spin\nresonance in the FeTe0. 6Se0. 4 superconductor. Preprint at\n<http://arxiv.org/abs/0911.4713> (2009).\n\n21\n\nZhao, J. et al. Structural and magnetic phase diagram of CeFeAsO1- xFx and its\nrelation to high-temperature superconductivity. Nature Mater. 7, 953-959 (2008).\n\n22\n\nLuetkens, H. et al. The electronic phase diagram of the LaO1-xFxFeAs superconductor.\nNature Mater. 8, 305-309 (2009).\n\n12\n\n\f23\n\nDrew, A. J. et al. Coexistence of static magnetism and superconductivity in\nSmFeAsO1-xFx as revealed by muon spin rotation. Nature Mater. 8, 310-314 (2009).\n\n24\n\nChen, H. et al. Coexistence of the spin-density wave and superconductivity in Ba1−x\nKxFe2As2. Europhys. Lett. 85, 17006 (2009).\n\n25\n\nPratt, D. K. et al. Coexistence of Competing Antiferromagnetic and Superconducting\nPhases in the Underdoped Ba(Fe0.953Co0.047)2As2 Compound Using X-ray and Neutron\nScattering Techniques. Phys. Rev. Lett. 103, 087001 (2009).\n\n26\n\nFang, C., Bernevig, B. A. & Hu, J. P. Theory of magnetic order in Fe1+ yTe1- xSex.\nEurophys. Lett. 86, 67005 (2009).\n\n27\n\nTurner, A. M., Wang, F. & Vishwanath, A. Kinetic magnetism and orbital order in\niron telluride. Phys. Rev. B 80, 224504 (2009).\n\n28\n\nWen, J. et al. Short-range incommensurate magnetic order near the superconducting\nphase boundary in Fe1+Te1-xSex. Phys. Rev. B 80, 104506-104504 (2009).\n\n29\n\nKhasanov, R. et al. Coexistence of incommensurate magnetism and superconductivity\nin Fe1+ySexTe1-x. Phys. Rev. B 80, 140511 (2009).\n\n30\n\nLumsden, M. D. et al. Evolution of spin excitations into the superconducting state in\nFeTe1-xSex. Nature Phys. 6, 182 - 186 (2010).\n\n31\n\nLiu, T. J. et al. Charge-carrier localization induced by excess Fe in the superconductor\nFe1 + yTe1 - xSex. Phys. Rev. B 80, 174509-174506 (2009).\n\n32\n\nSales, B. C. et al. Bulk superconductivity at 14 K in single crystals of Fe1+yTexSe1-x.\nPhys. Rev. B 79, 094521 (2009).\n\n13\n\n\fFigure 1:\n\nMagnetic and superconducting properties of Fe1.02(Te1-xSex) (0 ≤ x < 0.5).\n\na. The phase diagram. The Néel temperature, TN, of antiferromagnetic phase (AFM),\ndetermined by neutron scattering (green squares), susceptibility (orange triangles), Hall\ncoefficient (blue triangle), and resistivity (black crosses) measurements. Tc, onset of\nsuperconducting transition probed by resistivity (◊); Tc, bulk superconducting transition\ntemperature (♦) probed by susceptibility. Bulk superconductivity (SC) exists when sufficient\nTe is replaced by Se, with the superconducting volume fraction > 75% for x  0.29. For\nx<0.29, only non-bulk-SC exists with the superconducting volume fraction < 3 %. The bulk\nSC and non-bulk SC concentration regions also differ in their normal state transport property:\nmetallic in the former, non-metallic in the latter. b. The superconducting volume fraction\n(-4) and the derivative of normalized resistivity ((T)/(300K)) with respect to\ntemperature as a function of Se content.\n14\n\n\fFigure 2: Evolution of the long-range AFM order and FS variation across the AFM\ntransition in Fe1.02(Te1-xSex). a, Temperature dependence of the ordered magnetic moment\nMFe. Inset, the saturated moment MFe as a function of Se content. The magnetic order is\nsuppressed when x > 0.09. b, Hall coefficients as a function of temperature . The FS changes\nsignificantly across the AFM transition.\n\n15\n\n\fFigure 3: Evolution of superconductivity as a function of Se content for Fe1.02(Te1-xSex).\na, In-plane resistivity ab(T) as a function of temperature for samples in the AFM region (0 \nx <0.09). The downward arrows mark the AFM transition and the upward arrows mark the\nonset of a trace of superconductivity. b, ab(T) for samples with 0.09 < x  0.29. c, ab(T) for\nsamples with x > 0.29. d, Magnetic susceptibility data measured with a zero-field-cooling\nhistory and a field of 30 Oe for typical samples. e, Specific heat divided by temperature C/T\nas a function of temperature for various samples. The left inset is the electronic specific heat\ncoefficient  as a function of Se content x. Right inset is C/T as a function of T2 for the x\n=0.19 sample. Both magnetic susceptibility and specific heat data show that bulk\nsuperconductivity occurs only in samples with x ≥ 0.29. The samples with bulk\nsuperconductivity exhibit metallic temperature dependence in ab, while those samples\nwithout bulk superconductivity display the non-metallic temperature dependence in ab.\n\n16\n\n\fFigure 4: Difference of microscopic magnetic properties between samples with and\nwithout bulk superconductivity. a, Neutron scattering intensity map on the (HK0) plane for\nthe x =0.19 sample without bulk superconductivity (ħ= 0 meV). b, Neutron scattering\nintensity map on the (HK0) plane for the x =0.38 sample with bulk superconductivity (ħ = 0\nmeV). Both samples exhibit quasi-elastic scattering near (1/2, 0), but the scattering in the x\n=0.19 sample is much stronger than that in the x = 0.38 sample. The data shown in a and b\nwere measured using MACS spectrometer at the NIST. c. Typical INS transverse scans\nthrough (1/2, 1/2) (or (π, π)) at fixed energy measured from a single crystal of\nFe1.02Te0.95Se0.05 at 2K. The solid lines through the data are Gaussian fits to the magnetic\nexcitations. For clarity, data and fits are shifted along the y-axis by an arbitrary amounts. The\nposition of the background for each scan is indicated by a horizontal line. The black\nhorizontal bar in panel represents the expected Q-resolution.\n\n17\n\n\f"}