{"id": "http://arxiv.org/abs/1011.4992v1", "guidislink": true, "updated": "2010-11-23T02:48:10Z", "updated_parsed": [2010, 11, 23, 2, 48, 10, 1, 327, 0], "published": "2010-11-23T02:48:10Z", "published_parsed": [2010, 11, 23, 2, 48, 10, 1, 327, 0], "title": "Random stress and Omori's law", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1011.2587%2C1011.5476%2C1011.6496%2C1011.0940%2C1011.5555%2C1011.4624%2C1011.5472%2C1011.2511%2C1011.2669%2C1011.2361%2C1011.5901%2C1011.0822%2C1011.0262%2C1011.6641%2C1011.1761%2C1011.6092%2C1011.0114%2C1011.3752%2C1011.0550%2C1011.4128%2C1011.5372%2C1011.1459%2C1011.3207%2C1011.4006%2C1011.3255%2C1011.2605%2C1011.2317%2C1011.4898%2C1011.3822%2C1011.0268%2C1011.2937%2C1011.4172%2C1011.3765%2C1011.3078%2C1011.5663%2C1011.2198%2C1011.5891%2C1011.5311%2C1011.6651%2C1011.6356%2C1011.6188%2C1011.0109%2C1011.1163%2C1011.3615%2C1011.6469%2C1011.1834%2C1011.0452%2C1011.6562%2C1011.0256%2C1011.5946%2C1011.0515%2C1011.3834%2C1011.0299%2C1011.6533%2C1011.0571%2C1011.5676%2C1011.6262%2C1011.2112%2C1011.4336%2C1011.4945%2C1011.4257%2C1011.0422%2C1011.4992%2C1011.5047%2C1011.1148%2C1011.5772%2C1011.0176%2C1011.0418%2C1011.0020%2C1011.0877%2C1011.2380%2C1011.4799%2C1011.4110%2C1011.3840%2C1011.1863%2C1011.5054%2C1011.5274%2C1011.1216%2C1011.4282%2C1011.4674%2C1011.2400%2C1011.6160%2C1011.6649%2C1011.4023%2C1011.2583%2C1011.1735%2C1011.1481%2C1011.3030%2C1011.2435%2C1011.1426%2C1011.0046%2C1011.0062%2C1011.5093%2C1011.5112%2C1011.2452%2C1011.4883%2C1011.5899%2C1011.3814%2C1011.3552%2C1011.1577%2C1011.1057&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Random stress and Omori's law"}, "summary": "We consider two statistical regularities that were used to explain Omori's\nlaw of the aftershock rate decay: the Levy and Inverse Gaussian (IGD)\ndistributions. These distributions are thought to describe stress behavior\ninfluenced by various random factors: post-earthquake stress time history is\ndescribed by a Brownian motion. Both distributions decay to zero for time\nintervals close to zero. But this feature contradicts the high immediate\naftershock level according to Omori's law. We propose that these statistical\ndistributions are influenced by the power-law stress distribution near the\nearthquake focal zone and we derive new distributions as a mixture of power-law\nstress with the exponent psi and Levy as well as IGD distributions. Such new\ndistributions describe the resulting inter-earthquake time intervals and\nclosely resemble Omori's law. The new Levy distribution has a pure power-law\nform with the exponent -(1+psi/2) and the mixed IGD has two exponents: the same\nas Levy for small time intervals and -(1+psi) for longer times. For even longer\ntime intervals this power-law behavior should be replaced by a uniform\nseismicity rate corresponding to the long-term tectonic deformation. We compute\nthese background rates using our former analysis of earthquake size\ndistribution and its connection to plate tectonics. We analyze several\nearthquake catalogs to confirm and illustrate our theoretical results. Finally,\nwe discuss how the parameters of random stress dynamics can be determined\nthrough a more detailed statistical analysis of earthquake occurrence or by new\nlaboratory experiments.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1011.2587%2C1011.5476%2C1011.6496%2C1011.0940%2C1011.5555%2C1011.4624%2C1011.5472%2C1011.2511%2C1011.2669%2C1011.2361%2C1011.5901%2C1011.0822%2C1011.0262%2C1011.6641%2C1011.1761%2C1011.6092%2C1011.0114%2C1011.3752%2C1011.0550%2C1011.4128%2C1011.5372%2C1011.1459%2C1011.3207%2C1011.4006%2C1011.3255%2C1011.2605%2C1011.2317%2C1011.4898%2C1011.3822%2C1011.0268%2C1011.2937%2C1011.4172%2C1011.3765%2C1011.3078%2C1011.5663%2C1011.2198%2C1011.5891%2C1011.5311%2C1011.6651%2C1011.6356%2C1011.6188%2C1011.0109%2C1011.1163%2C1011.3615%2C1011.6469%2C1011.1834%2C1011.0452%2C1011.6562%2C1011.0256%2C1011.5946%2C1011.0515%2C1011.3834%2C1011.0299%2C1011.6533%2C1011.0571%2C1011.5676%2C1011.6262%2C1011.2112%2C1011.4336%2C1011.4945%2C1011.4257%2C1011.0422%2C1011.4992%2C1011.5047%2C1011.1148%2C1011.5772%2C1011.0176%2C1011.0418%2C1011.0020%2C1011.0877%2C1011.2380%2C1011.4799%2C1011.4110%2C1011.3840%2C1011.1863%2C1011.5054%2C1011.5274%2C1011.1216%2C1011.4282%2C1011.4674%2C1011.2400%2C1011.6160%2C1011.6649%2C1011.4023%2C1011.2583%2C1011.1735%2C1011.1481%2C1011.3030%2C1011.2435%2C1011.1426%2C1011.0046%2C1011.0062%2C1011.5093%2C1011.5112%2C1011.2452%2C1011.4883%2C1011.5899%2C1011.3814%2C1011.3552%2C1011.1577%2C1011.1057&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We consider two statistical regularities that were used to explain Omori's\nlaw of the aftershock rate decay: the Levy and Inverse Gaussian (IGD)\ndistributions. These distributions are thought to describe stress behavior\ninfluenced by various random factors: post-earthquake stress time history is\ndescribed by a Brownian motion. Both distributions decay to zero for time\nintervals close to zero. But this feature contradicts the high immediate\naftershock level according to Omori's law. We propose that these statistical\ndistributions are influenced by the power-law stress distribution near the\nearthquake focal zone and we derive new distributions as a mixture of power-law\nstress with the exponent psi and Levy as well as IGD distributions. Such new\ndistributions describe the resulting inter-earthquake time intervals and\nclosely resemble Omori's law. The new Levy distribution has a pure power-law\nform with the exponent -(1+psi/2) and the mixed IGD has two exponents: the same\nas Levy for small time intervals and -(1+psi) for longer times. For even longer\ntime intervals this power-law behavior should be replaced by a uniform\nseismicity rate corresponding to the long-term tectonic deformation. We compute\nthese background rates using our former analysis of earthquake size\ndistribution and its connection to plate tectonics. We analyze several\nearthquake catalogs to confirm and illustrate our theoretical results. Finally,\nwe discuss how the parameters of random stress dynamics can be determined\nthrough a more detailed statistical analysis of earthquake occurrence or by new\nlaboratory experiments."}, "authors": ["Yan Y. Kagan"], "author_detail": {"name": "Yan Y. Kagan"}, "author": "Yan Y. Kagan", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1111/j.1365-246X.2011.05114.x", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1011.4992v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1011.4992v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "stat.AP", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "stat.AP", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.geo-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1011.4992v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1011.4992v1", "arxiv_comment": null, "journal_reference": "Geophys. J. Int., 186(3), 1347-1364, 2011", "doi": "10.1111/j.1365-246X.2011.05114.x", "fulltext": "PostScript file created: September 20, 2018; time 7 minutes\nRANDOM STRESS AND OMORI'S LAW\n\narXiv:1011.4992v1 [stat.AP] 23 Nov 2010\n\nYan Y. Kagan\nDepartment of Earth and Space Sciences, University of California,\nLos Angeles, California 90095-1567, USA;\nEmails: ykagan@ucla.edu, kagan@moho.ess.ucla.edu\nAbstract. We consider two statistical regularities that were used to explain Omori's law\nof the aftershock rate decay: the Lévy and Inverse Gaussian (IGD) distributions. These\ndistributions are thought to describe stress behavior influenced by various random factors:\npost-earthquake stress time history is described by a Brownian motion. Both distributions\ndecay to zero for time intervals close to zero. But this feature contradicts the high immediate\naftershock level according to Omori's law. We propose that these statistical distributions are\ninfluenced by the power-law stress distribution near the earthquake focal zone and we derive\nnew distributions as a mixture of power-law stress with the exponent ψ and Lévy as well\nas IGD distributions. Such new distributions describe the resulting inter-earthquake time\nintervals and closely resemble Omori's law. The new Lévy distribution has a pure power-law\nform with the exponent −(1 + ψ/2) and the mixed IGD has two exponents: the same as\nLévy for small time intervals and −(1 + ψ) for longer times. For even longer time intervals\nthis power-law behavior should be replaced by a uniform seismicity rate corresponding to\nthe long-term tectonic deformation. We compute these background rates using our former\nanalysis of earthquake size distribution and its connection to plate tectonics. We analyze\nseveral earthquake catalogs to confirm and illustrate our theoretical results. Finally, we\ndiscuss how the parameters of random stress dynamics can be determined through a more\n1\n\n\fdetailed statistical analysis of earthquake occurrence or by new laboratory experiments.\nShort running title: Random stress and Omori's law\nKey words: Omori's law; Random stress; Aftershocks; Lévy distribution; Inverse Gaussian\ndistribution; Seismicity as result of plate-tectonic deformation; Selection bias.\n\n1\n\nIntroduction\n\nOur aim is to investigate the connection between random stress and the Omori law of aftershock occurrence. Several attempts to explain Omori's law have been published. Since\nstress in the Earth's interiors cannot be easily measured or calculated, these studies usually\nconsider stress as a scalar stochastic variable, ignoring for a while its tensorial nature. In\nthis work we consider the stress as a scalar.\nHere we use the scalar seismic moment M directly, but for easy comparison we convert\nit into an approximate moment magnitude using the relationship\nmW =\n\n2\n(log10 M − 9.0) ,\n3\n\n(1)\n\n(Hanks, 1992), where M is measured in Newton m (Nm). Since we are using almost exclusively the moment magnitude, later we omit the subscript in mW .\nKagan (1982) considered stress time history as a Brownian motion, i.e., randomly fluctuating stress acting on the stressed environment of an earthquake focal zone. Here the\nprobability density for the time intervals between earthquake events has a Lévy distribution with a power-law tail having the exponent −3/2. Kagan and Knopoff (1987) added\na tectonic drift component to the Brownian motion. For such a case, the distribution of\ninter-event times is the Inverse Gaussian distribution (IGD) which, depending on the value\nof the initial stress drop and velocity of tectonic motion, can exhibit occurrence patterns\n2\n\n\franging from the Lévy distribution to a quasi-periodic occurrence.\nMatthews et al. (2002) also proposed the IGD as a law for inter-earthquake intervals;\nhowever, they considered only a limiting, quasi-periodic long-term distribution. The authors\nsuggest that \"... [the Inverse Gaussian] distribution has the following noteworthy properties:\n(1) the probability of immediate [large earthquake] rerupture is zero; (2) the hazard rate\nincreases steadily from zero at t = 0 to a finite maximum near the mean recurrence time ...\"\nand real earthquake occurrence follows the same pattern. Ellsworth (1995), Ellsworth et al.\n(1999), Nadeau et al. (1995), and Nadeau and Johnson (1998) present several sequences of\nrecurrent quasi-periodic earthquakes which, in their opinion, confirm a smaller coefficient of\nvariation than the Poisson process for earthquake recurrence intervals.\nThere is ample evidence that after almost any earthquake subsequent events follow\nOmori's law. This has been observed for smaller earthquakes (aftershocks) as well as large\nevents comparable in size to the original shock or even exceeding it (Kagan and Jackson,\n1999). Omori's law pattern of power-law rate decaying seismicity is observed at decadal and\ncenturies long scales (Utsu et al., 1995; Stein and Liu, 2009; Ebel, 2009).\nMoreover, the presumed pattern of earthquake quasi-periodicity depends on the argument\nthat stress drops to zero or close to zero in the focal zone of an earthquake. Thus, it would be\nnecessary to wait for some time before a critical stress level is reached. Kagan and Jackson\n(1999) presented several examples of large earthquakes which followed after a short time\ninterval (often just a few days) within a focal zone of similar large events. Such an interearthquake interval is clearly insufficient for stress to be replenished by tectonic motion. We\npresent additional evidence for this pattern later in this paper.\nThus, for relatively short time intervals, earthquakes are clustered in time with the coefficient of variation significantly greater than that for the Poisson process (Kagan and Jackson,\n1991). Why is it widely believed that large earthquakes are quasi-periodic in time? Evidence\n3\n\n\fmostly comes from specifically selected sequences (Bakun and Lindh, 1985; Ellsworth, 1995)\nor from paleo-seismic investigations (Ellsworth et al., 1999). However, paleo-seismic investigations have poor time resolution: two or more events occurring closely in time are likely\nto be identified as one event. Hence, their coefficient of variation estimates should be biased\ntowards smaller values: a more periodic pattern. Some paleo-seismic investigations (Marco\net al., 1996. Rockwell et al., 2000; Ken-Tor et al., 2001; Dawson et al., 2003) also suggest\nthat earthquakes follow a long-term clustering pattern at least in regions of slow tectonic\ndeformation.\nAdditionally, paleo-seismicity studies the Earth's displacement only at the surface. But\ntemporal and spatial distributions of earthquakes rupturing the surface at one site substantially differ from general earthquake statistics (Kagan, 2005). The earthquake size distribution is also significantly different for site- and area-based statistics. Rigorously reliable\nstatistical properties that are relevant for theoretical studies as well as for seismic hazard\nestimates can only be obtained by analyzing instrumental earthquake catalogs.\nMeasurements from instrumental earthquake catalogs indicate that short time intervals\nbetween large earthquakes are much more frequent than even the Poisson model would\nsuggest (Kagan and Jackson, 1991; 1999). Moreover, the problem of biased selection is\nalso hard to avoid in historical and paleo-seismic data: sequences not displaying suggested\npatterns or with a small number of events are less likely to be considered.\nRecently, repeating microquakes have been studied in the Parkfield area (Nadeau et al.,\n1995; Nadeau and Johnson, 1998, and references therein). These event sequences exhibit\ncertain properties of characteristic quasi-periodic earthquakes: regularity of occurrence and\nnearly identical waveforms. They show many other interesting features of earthquake occurrence. However, these micro-events are not characteristic earthquakes in a strict sense: they\ndo not release almost all the tectonic deformation on a fault segment while real characteristic\n4\n\n\fearthquakes are assumed to do so.\nAs with large characteristic earthquakes, attempts using micro-earthquake quasiperiodicity for their prediction have not yet succeeded. Zechar, J. D. (private communication,\n2010) attempted to forecast repeating small earthquakes on the San Andreas fault near Parkfield, based on event regularity. While retrospective tests indicated that the forecasts based\non recurrence times were better than random, the forward tests were unsuccessful.\nMoreover, these micro-events apparently occur on isolated asperities surrounded by creeping zones. Therefore, such an asperity exists as a secluded entity and may produce characteristic quasi-periodic rupture events, similar to fracture in many laboratory experiments.\nBut tectonic earthquakes occur in an environment that is never isolated. This may explain\ntheir ubiquitous clustering in time and space.\nThe quasi-periodic model for characteristic earthquakes (see for example, McCann et al.,\n1979; Bakun and Lindh, 1985; Nishenko, 1991) has been put to a prospective test using\nnew data. Testing the validity of this hypothesis ended in failure (Rong et al., 2003 and\nreferences therein; Bakun et al., 2005; Jackson and Kagan, 2006).\nHow can we investigate earthquake occurrence patterns in various tectonic zones? Our\nstatistical studies of seismicity (see for example, Kagan, 1991, 2007; Kagan and Jackson,\n1991; Kagan et al., 2010) are biased because earthquake rate is dominated by places with a\nhigh tectonic rate. Thus, the likelihood function maximum is mainly determined by these\nearthquakes. However, we should study earthquake patterns in continental areas (active and\nnon-active) where the earthquake rate is low, but the vulnerable human population is large\n(see Stein and Liu, 2009; Parsons, 2009). A naive extrapolation of aftershock sequence rates\nwould exaggerate seismic hazard. Instead, we need a convincing tool to produce a truer\nestimate.\nOur recent results suggest that earthquake occurrence can be modeled by the Poisson\n5\n\n\fcluster process: the combination of the long-term rate caused by tectonic strain with shortterm clustering. For large and medium strain rates, the model appears to work well (see\nagain Kagan et al., 2010). The model is producing reasonable long- and short-term forecasts\nof earthquake occurrence both for local (Helmstetter et al., 2006) and global (Kagan and\nJackson, 2010) seismicity. But to extrapolate such a model to small tectonic rates we would\nneed additional arguments; we must extract the rates by comparing seismicity patterns with\ntectonic strain maps. Bird et al. (2010) discuss the dependence of the long-term interearthquake rate on strain. We need to show how the short-term properties of earthquakes\nbehave in the regions of varying strain. As shown below, the transition time from Omori's\nlaw decay to a quasi-stationary rate clearly increases with a decrease in the strain rate. As\nthe result of these studies, we propose that the same statistical model can be applied for\nregions of both high and low tectonic strain.\n\n2\n\nAftershock temporal distribution, theoretical analysis\n\n2.1\n\nLévy distribution\n\nKagan (1982) proposed a heuristical model for an earthquake fracture as follows. At the\nmoment that any given earthquake rupture stops, the stress near the edge of the rupture is\nlower than the critical breaking stress for extension of the fracture. The subsequent stress\nhistory near the earthquake rupture tip depends on other fractures in the neighborhood and\nadditional random factors. In this case, the time history of the stress might resemble a\nBrownian random walk. The stress-time function is thus given as a solution to the diffusion\nequation. When the stress reaches a critical threshold level, a new earthquake begins. The\n6\n\n\fdistribution density of the time intervals of the 'first passage' (Feller, 1966) is the Lévy\ndistribution\nσ\nσ2\nf (t) = √\nexp −\n2D t\n2 πD t3\n\n!\n\n,\n\n(2)\n\nwhere D is the diffusion coefficient, t is the time, and σ is the threshold or barrier stress: the\ndifference between initial breaking stress and that when rupture ceases. This distribution\nas a function of stress is the Rayleigh law; as a function of time it is the Lévy distribution\n(cf. Zolotarev, 1986). In this model, the stress is taken to be a scalar, which corresponds to\nthe addition of perfectly aligned stress tensors; the interaction of misaligned tensors will be\ndiscussed in a later work. The Lévy distribution (1) was used by Kagan (1982, see Eqs. 8\nand 9) to model the time dependent part of the space-time sequence of micro-earthquakes.\nHere we are address only the time sequence of events.\nFig. 1 displays several Lévy curves for various values of stress drop, σ. The curve's\ntail is a power-law similar to that exhibited by Omori's law. However, for small values\nof time the curves decay to zero: depending on the stress drop, Brownian motion takes\ntime to reach a critical stress level. This latter feature, though observed in aftershock\nsequences, is most likely caused by effects from coda waves of both the mainshock and\nstronger aftershocks that prevent identifying smaller aftershocks (Kagan, 2004). This opinion\nis supported by aftershock registration in the high-frequency domain (Enescu et al., 2009)\nwhere their time delay is substantially reduced. Measurements of total seismic moment rate\ndecay in aftershock sequences (Kagan and Houston, 2005) suggest that aftershocks start\nright after the end (within one minute for a M6.7 earthquake) of a mainshock rupture.\nTherefore, the left-hand decay of the curves in Fig. 1 is not realistic.\nThere is another problem in comparison of theoretical distribution with aftershock observations. The Lévy curves may explain the inter-event time statistics only for the first\ngeneration (parent-child) of clustered earthquakes. Most observed aftershocks or clustered\n7\n\n\fevents are generally separated from their 'parents' by multiple generations. For example,\nthe present aftershocks of the 1811-12 New Madrid earthquakes or the 1952 Kern County,\nCalifornia, earthquake are mostly distant relatives of their progenitors (mainshocks). In the\nOmori law we count all aftershocks, disregarding their parentage, whereas the Lévy law describes the time distribution for the next event: when the stress level reaches a critical value\nto trigger a new rupture. When we count all events, we decrease the exponent from 1.5 to\n1.0 (Kagan and Knopoff, 1987).\nWe assume that the next earthquake may occur in any place in the focal zone of a previous\nevent. Attempts to localize the initiation of strong earthquakes have not been successful; for\nexample, the 2004 Parkfield earthquake occurred well outside the previously specified area\n(Jackson and Kagan, 2006).\nWe also assume that the stress drop after an earthquake has a power-law distribution: it\nis proportional to σ −1−ψ , for 0 ≤ ψ < 1.0. Kagan (1994), Marsan (2005), Helmstetter et al.\n(2005), Lavallée (2008), Powers and Jordan (2010) support this statement.\nThen for the Lévy distribution we obtain\nφ (t) ∝\n\nZ∞\n\nf (t) σ\n\n0\n\n−1−ψ\n\n1\n1−ψ\n√\ndσ =\nΓ\n2 t π (2 t D)ψ/2\n2\n\n!\n\n,\n\n(3)\n\nwhere Γ is a gamma function. The new modified Lévy distribution density function is a\npower-law with the exponent −(1 + ψ/2). The density should be truncated at the left side,\nbecause aftershocks cannot be observed at short-time intervals close to a mainshock (Kagan,\n2004). Normalizing the distribution would depend on this truncation. Kagan (1991, Eq. 8)\nintroduced a minimum time (tM ), where M is a seismic moment of a preceding event (see\nalso Eq. 17 below). Before that time, the aftershock rate is measured with a substantial\nundercount bias (Kagan, 2004).\n\n8\n\n\f2.2\n\nInverse Gaussian distribution\n\nAs Matthews et al. (2002) indicate, the Inverse Gaussian Distribution (IGD) has been known\nsince 1915. However, this distribution only acquired its name in 1945. This is the name\nfound in recent statistical encyclopedias and books (for example, Kotz et al., 2006; Seshadri,\n1999; Chhikara and Folks, 1989), on the Wolfram website, and in Wikipedia, while the\n\"Brownian passage-time\" (BPT) is little known. Kagan and Knopoff (1987) proposed to use\nthis distribution (without calling it IGD) to describe the inter-earthquake time distribution.\nTheir major impetus was to explain aftershock statistics (Omori's law) by stress dynamics.\nHere we discuss the appropriate pairwise interval law for a model in which a steadily increasing source of stress, which we take to be due to plate tectonics, is added to or subtracted\nfrom a random or diffusion component, where the distribution (2) describes the density of\nearthquake recurrence times in the absence of tectonic loading. If the rate of tectonic loading\nis a constant V, the distribution density f (t) is modified to (Feller, 1966, p. 368) become the\nInverse Gaussian distribution\nσ\n(σ − V t)2\n.\nf (t) = √\nexp −\n2D t\n2 πD t3\n#\n\n\"\n\n(4)\n\nFor tectonic loading velocity V = 0, this equation transforms to (2). Fig. 2 displays several\nIGD curves for various values of stress drop. For small values of σ and t, the curves are\nsimilar to the values of Lévy distribution (2): if the stress drop is insignificant, or the\ntectonic loading influence is small in initial stages of stress behavior.\nAssuming again that the stress in a fault neighborhood is distributed according to a\npower-law, we obtain a new modified distribution of inter-earthquake time, based on the\nIGD (4)\nφ (t) ∝\n\nZ∞\n0\n\nf (t) σ\n\n−1−ψ\n\nexp [−V 2 t/(2D)]\n√\ndσ =\n2 t π (2 t D)ψ/2\n9\n\n\"\n\n1−ψ\nΓ\n2\n\n!\n\n1 F1\n\n1−ψ 1 V2t\n, ,\n2\n2 2D\n\n!\n\n\f+ V\n\ns\n\nψ\n2t\nΓ 1−\nD\n2\n\n!\n\n1 F1\n\nψ 3 V2t\n1− , ,\n2 2 2D\n\n!#\n\n,\n\n(5)\n\nwhere 1 F1 is a Kummer confluent hypergeometric function (Wolfram, 1999; Abramowitz\nand Stegun, 1972, p. 504). Another expression for the density is\nexp [−V 2 t/(2D)]\n1−ψ\n√\nφ (t) ∝\nΓ\n2 t π (2 t D)ψ/2\n2\n\n!\n\nψ\nΓ 1−\n2\n\n!\n\nU\n\n1−ψ 1 V2t\n, ,\n2\n2 2D\n\n!\n\n,\n\n(6)\n\nwhere U a confluent hypergeometric function (ibid.). As in Eq. 3, both of the above distributions should be truncated as t → 0 and can be normalized after it.\nFor certain values of ψ the expressions (5 and 6) can be simplified. For example for ψ = 0\n\n\n s\n\n1 \nφ (t) ∝\n1 + erf V\n2t\n\n\n\nt \n.\n2D\n\n(7)\n\nFor ψ = 0.5 we obtain two equations. For a positive V , using Eq. 13.6.3 by Abramowitz and\nStegun (1972), we transform (5) into\n1\nφ (t) ∝\n2t\n\ns\n\nπV\nV2t\nexp −\n4D\n4D\n\n!\"\n\nI−1/4\n\nV2t\nV2t\n+ I1/4\n4D\n4D\n!\n\n!#\n\n,\n\n(8)\n\nwhere I−1/4 and I1/4 are modified Bessel functions (Wolfram, 1999; Abramowitz and Stegun,\n1972, p. 374).\nFor a negative V using Eq. 13.6.21 by Abramowitz and Stegun (1972), we transform (6)\ninto\n1\nφ (t) ∝\n2t\n\ns\n\nV\nV2t\nV2t\n−\nK1/4\nexp −\nπD\n4D\n4D\n!\n\n!\n\n,\n\n(9)\n\nwhere K1/4 is a modified Bessel function (Wolfram, 1999; Abramowitz and Stegun, 1972).\nIn Fig. 3 we display the new IGD curves for various values of the ψ parameter. Although\nthe general behavior of the curves remains power-law, the curves change their slope at the\n√\ntime value of about 1.0. The curves with V = ± D show the distribution difference for\ntectonic loading sign; in the positive case tectonic movement is opposite to the fault displacement during an earthquake, whereas the negative sign corresponds to motion consistent with\n10\n\n\fthe earthquake mechanism. In the latter case, random fluctuations can bring the fault to\nrupture only during the early period of development.\nTo show the curves' behavior more clearly in Fig. 4, the PDF values are multiplied by\nt1+ψ/2 . For small time intervals curves are horizontal, suggesting that the modified IGD is\nsimilar to the Lévy distribution in Eq. 3.\nFor small time values, the power-law exponents in Fig. 3 are essentially the same as for\ncompounded Lévy law (3). This can be seen from modified Bessel function approximations\nfor small values of the argument (Abramowitz and Stegun, 1972, Eqs. 9.6.7 and 9.6.9),\nI−1/4 (t) ∝\n\n\u0012 \u00131/4\n\n2\nt\n\nand K1/4 (t) ∝\n\n\u0012 \u00131/4\n\n2\nt\n\n.\n\n(10)\n\nIn the general case the same result can be obtained with Eq. 13.5.5 by Abramowitz and\nStegun (1972). Then for t → 0 Eq. 5 transforms into\nφ (t) ∝ t − 1 − ψ/2 .\n\n(11)\n\nIt is obvious from Figs. 3 and 4 that, except for the ψ = 0 curve, the slope of curves for\nlarge values of the time increases when compared with t close to zero. Using Eq. 13.1.27 of\nAbramowitz and Stegun (1972) we add an exponential term in (5) within the hypergeometric\nfunction 1 F1 . Then for t → ∞ we obtain\nφ (t) ∝ t − 1 − ψ ,\n\n(12)\n\n(Abramowitz and Stegun, 1972, Eq. 13.5.1). Therefore, in Eq. 8 the exponent would be −1.5\n(Abramowitz and Stegun, 1972, Eq. 9.7.1), whereas in Eq. 9 the power-law term (Abramowitz\nand Stegun, 1972, Eq. 9.7.2) is multiplied by an exponential decay term\nφ (t) ∝ t\n\n−1.5\n\nV2t\nexp −\n4D\n\nSee Figs. 3 and 4.\n11\n\n!\n\n.\n\n(13)\n\n\f3\n\nTemporal distribution of aftershocks: Observations\n\nMany observations of Omori's law behavior have been published (see Utsu et al., 1995 and\nreferences therein). There are some problems with these measurements. The standard interpretation of the Omori law is that all aftershocks are caused by a single mainshock. However,\nthe mainshock is often followed by strong aftershocks and those are clearly accompanied by\ntheir own sequence of events, and so on. The second problem is that some earthquakes\nhave very few or no aftershocks; such sequences cannot be included in the naive study of\nearthquake sequences, but can be analyzed as stochastic processes.\nThus, three techniques can be applied to study the temporal distribution of real earthquakes: 1) traditional, phenomenological techniques based on observing individual aftershock\nsequences; 2) using statistical moments of earthquake occurrence, considered as a point process; 3) applying stochastic process modeling to infer the parameter values of earthquake\ntemporal interaction.\n\n3.1\n\nAftershock sequences\n\nBeginning with Omori (1894), the temporal distribution of aftershock numbers has been\nstudied for more than one hundred years (Utsu et al., 1995). Aftershock rate decay is\napproximated as t−p with parameter p value close to 1.0 (Kagan, 2004).\nBut the simple, superficial study of aftershock rate decay often encounters serious problems. First, only relatively rich aftershock sequences can be investigated by direct measurements; if there are too few aftershocks, their properties can be studied only by combining\n(stacking) many sequences. Second, to isolate individual sequences one should exclude any\ncases when one sequence is influenced by another, an arbitrary procedure which may introduce a selection bias. Third, an aftershock sequence often contains one or several large events\n\n12\n\n\fwhich are clearly accompanied by a secondary aftershock sequence. Taking the influence of\nsecondary earthquakes into account is not simple (see Section 3.3 for more detail). Fourth,\nsome sequences start with a strong foreshock which is sometimes only slightly weaker than\na mainshock. Again, handling this occurrence presents serious problem.\nTherefore, strong bias may result from directly measuring Omori's law exponents. Two\nother statistical methods considered below enable analysis of the whole earthquake occurrence as a point process, to minimize the problem of data and interpretation technique\nselection bias.\n\n3.2\n\nTemporal distribution for earthquake pairs\n\nKagan and Jackson (1991) investigated space-time pairwise earthquake correlation patterns\nin several earthquake catalogs. They showed that earthquake pairs follow a power-law distribution for small time and distance intervals. Kagan and Jackson (1999) showed that\ncontrary to the seismic gap model the clustering pattern continues for strong (m ≥ 7.5)\nearthquakes. Large shallow earthquakes can re-occur after a small time interval.\nTable 1 shows the location and focal mechanism difference for m ≥ 7.5 global shallow\nearthquakes in the GCMT catalog (Ekström et al., 2005; Ekström, 2007) from 1976-2010.\nThe table format is similar to Table 1 in Kagan and Jackson (1999). However, here we kept\nonly those pairs in the table for which their focal zone overlap (the η-parameter) is greater\nthan 1.0:\nη=\n\nL1 + L2\n,\n2R\n\n(14)\n\nwhere L1 and L2 are the respective rupture lengths for the first and second earthquakes\nin the pair (see Eq. 3 in Kagan and Jackson, 1999) and R is the distance between the\ncentroids. Therefore, if η ≥ 1.0 the earthquake focal zones would intersect. For several\n13\n\n\fdoublets η ≥ 2, implying that the smaller event should be largely within the focal zone of\nthe larger earthquake. Inspecting the time difference and the 3-D rotation angle between\nfocal mechanisms suggests that these high η pairs may occur after very short time intervals\nand have very similar double-couple mechanisms.\nAll earthquakes in the table occur in subduction zones as defined in Kagan et al. (2010).\nHowever, even with relatively high deformation velocity at these plate boundaries, the interearthquake time is in most cases substantially lower than the time necessary for tectonic\nmotion to restore the critical stress conditions by the occurrence time of the second earthquake (see the last column in Table 1 by Kagan and Jackson, 1999).\nFig. 5 shows how the normalized number of m ≥ 6.5 shallow earthquake pairs depends\non the tectonic deformation rate as defined by Bird et al. (2010). Three curves are shown:\nall earthquakes from the GCMT catalog, earthquakes from subduction zones (Kagan et al.,\n2010), and events from active continental zones.\nFig. 6 shows the integration domain for calculating earthquake pair rates. The diagram\nis a square with a side length equal to a catalog duration, T ; since the plot is symmetric,\nonly the lower-right portion of the square is shown. The first event shown as a filled circle,\nis supposed to be at the square diagonal, the second one at the end of a hatched area. We\nassume that the time difference between earthquakes cannot be less than t0 (similar to tM\nin Eq. 17).\nFor the Poisson process, the interval pair density is uniform (see Kagan and Jackson,\n1991, Eq. 1). Thus, the rate is proportional to the hatched area. For the normalized survival\nrate\nnp =\n\n\u0012\n\nT −t\nT − t0\n\n\u00132\n\n,\n\n(15)\n\nwhere t0 is the minimum time interval, T is the catalog duration and t is the inter-earthquake\ntime interval.\n14\n\n\fFor the power-law time distribution with distribution density φ(t) ∝ t−1−θ , we obtain\nthe normalized survival rate by integrating over the domain shown in Fig. 6:\nnp =\n\n!\n\nt−θ − T −θ\n.\n−θ\nt−θ\n0 −T\n\n(16)\n\nIn Figs. 7-10 the temporal distribution of inter-earthquake times for m ≥ 6.5 event\npairs is shown as it depends on earthquake rate determined by Bird et al. (2010). Several\napproximations for pair intervals are also given: the Poisson distribution of earthquakes (15)\nin the time span 1976-2010 and a few power-law interval (16) dependencies.\nObviously distribution curves consist of two parts: for small time intervals, they follow\na power-law and for larger intervals the distribution is parallel to the Poisson rate. The\ntransition from one behavior to another occurs sooner for zones with a higher tectonic deformation rate: in Fig. 7 the transition is observed for the time of about 6,000 days; in Fig. 8\nit is about 4,000-5,000 days, and in Fig. 9 it is less than 3,000 days.\nFig. 10 shows the time interval distribution for active continental areas. In this case a\nvisual inspection suggests that the best approximation is the power-law; no transition to\nthe Poisson rate is observable. This absence can be explained by a low deformation rate in\nthese zones (see Fig. 5). As was observed for many aftershock sequences in continental and\nslowly deforming areas, aftershock sequences continue according to Omori's law for decades\nand even centuries (Utsu et al., 1995; Stein and Liu, 2009; Ebel, 2009). Here the span of 34\nyears covered by the GCMT catalog is likely insufficient to demonstrate the transition from\nan aftershock sequence to a background, Poisson rate.\nWe compute an average recurrence time (t̄) for earthquakes in Figs. 7-10. The smallest\nvalue for t̄ is observed for distributions with a significant component of the power-law: Figs. 7\nand 10. We also calculate the coefficient of variation (Cv ) of earthquake inter-occurrence\ntime as a ratio of the standard deviation (σt ) to the average time t̄ (Kagan and Jackson,\n15\n\n\f1991). A completely random Poisson occurrence has the coefficient of variation equal to one,\nwhereas quasi-periodicity yields a coefficient of less than one. It yields the coefficient larger\nthan one for clustered earthquakes. Although the Cv estimates are biased when determined\nat a relatively short catalog time span, their mutual relations are indicative of occurrence\npatterns. For Figs. 7-10, the Cv -values are 1.10, 0.925, 0.841, and 1.977, respectively. These\nevaluations again suggest that earthquakes in areas with a smaller tectonic rate become more\nclustered, and their Poisson component is diminished.\n\n3.3\n\nStochastic branching processes\n\nAs we mentioned above, the mainshock is often followed by strong aftershocks and those are\nclearly accompanied by their own sequence of events, and so on. The patterns of multiple\nclustering have been described by stochastic branching processes (Hawkes and Adamopoulos,\n1973; Kagan, 1991; Ogata, 1998). In this model, seismicity is approximated by a Poisson\ncluster process, in which clusters or sequences of earthquakes are statistically independent,\nalthough individual events in the cluster are triggered. However, Brémaud and Massoulié\n(2001) proposed a model in which all events belong to one branching cluster.\nKagan et al. (2010) applied the Critical Branching Models (CBM) to analyze earthquake\noccurrences statistically in several global and regional earthquake catalogs. Time intervals\nbetween earthquakes within a cluster are assumed to be distributed according to a power-law\nψ∆t (∆t) = θ tθM (∆t)−1−θ ,\n\n∆t ≥ tM .\n\n(17)\n\nThis is similar to Omori's law. The parameter θ is an 'earthquake memory' factor, tM is\nthe coda duration time of an earthquake with seismic moment Mi , and μ is the branching\n(productivity) coefficient (Kagan et al., 2010, Eq. 9).\nDuring a likelihood search the θ-values have been restricted within the interval 0.1 ≤ θ ≤\n16\n\n\f1.0; smaller or larger estimates are inadmissible because of physical considerations (Kagan,\n1991; Kagan et al., 2010). Fig. 11 shows a correlation between two parameters θ and μ of\nthe CBM. Most θ-values are within the interval 0.1 ≤ θ ≤ 0.5 and are negatively correlated\nwith the μ coefficient.\nSeveral determinations of the time decay exponent are carried out for the ETAS (Epidemic Type Aftershock Sequence) model. Ogata (1998, Tables 2-3) obtained the p-values\n(equivalent to our 1 + θ coefficient), of the order 1.03–1.14. Ogata et al. (2003, Tables 1-2)\nestimates the p-values to vary within 1.05–1.18. Ogata and Zhuang's (2006, Tables 2-3)\nvalues are 1.02–1.05. Zhuang et al. (2005) obtained p-values of 1.14–1.15. Helmstetter et al.\n(2006, Table 1) used a branching model similar to the ETAS and calculated p = 1.18 − 1.20.\nTo illustrate our fit of the temporal distribution of dependent earthquakes, average numbers of aftershocks following 15 m ≥ 8.0 GCMT earthquakes are displayed in Fig. 12 (similar\nto Fig. 13 in Kagan, 2004). We use the time period 1977-2003, so that all large earthquakes\nare approximately the same size (8.45 ≥ m ≥ 8.0, i.e., excluding the 2004 Sumatra and\nits aftershocks). Since the GCMT catalog has relatively few dependent events, we selected\naftershocks from the the U.S. Geological Survey (2010) PDE (Preliminary Determinations\nof Epicenters) catalog. The aftershock rate in the diagram is approximately constant above\nour estimate of the coda duration tM . For the logarithmic intervals, this corresponds to\nthe standard form of the Omori law: the aftershock number na is proportional to 1/t. For\nthe smaller time intervals, the aftershock numbers decline when compared to the Omori law\nprediction (1/t). This decline is caused by several factors, the interference of mainshock\ncoda waves being the most influential (Kagan, 2004). The decline is faster for weaker events\n(ibid.).\nFor theoretical estimates, we used the values of parameters obtained during the likelihood\nfunction search (Kagan et al., 2010, Table 4) obtained for the full PDE catalog, mt = 5.0: the\n17\n\n\fbranching coefficient μ = 0.141, the parent productivity exponent a0 = 0.63 (a0 = κ × 1.5),\nand the time decay exponent θ = 0.28. Theoretical estimates in Fig. 12 seem to be reasonably\ngood at forecasting time intervals on the order of one day. For larger intervals, the expected\nnumbers decrease as na ∼ (∆t)−1.15 : this is stronger than the regular Omori law would\npredict. As we suggested in Section 2.1 the Omori law assumes that all aftershocks are\ndirect consequences of a mainshock, whereas a branching model regards any earthquake as\na possible progenitor of later events. Thus, later aftershocks are the combined offspring of\na mainshock and all consequent earthquakes. With increase in time, the difference between\nOmori's law and the CBM predictions would increase as well. Marsan and Lengliné (2008)\nshow that in California catalogs due to cascading aftershock rates for direct and secondary\ntriggering differ by a factor of 10 to about 50%. By numerical simulations of the ETAS\nmodel, Felzer et al., (2002) and Helmstetter and Sornette (2003) estimated that a substantial\nmajority of aftershocks are indirectly triggered by the mainshock.\nThe p-parameter in Omori's law is often assumed to be 1.0. This p-value implies that\nthe total aftershock number approaches infinity as the duration of the aftershock sequence\nincreases. Figs. 3 and 4, however, suggest that in the presence of tectonic loading, the\ntime exponent value should increase at longer time periods. Statistical determination of\nthe exponent can usually be made for only short periods; thus, we do not yet have a good\nestimate of the p-value for the tail of an aftershock sequence.\n\n18\n\n\f4\n\nEarthquake statistics and plate-tectonic deformation\n\n4.1\n\nStationary earthquake rate due to tectonic deformation\n\nThe tapered Gutenberg-Richter (TGR) relation (Kagan, 2002b) has an exponential taper\napplied to the number of events with a large seismic moment. Its survivor function (1 −\ncumulative distribution) for the scalar seismic moment M is\nMt − M\nF (M) = (Mt /M) exp\nMc\nβ\n\n\u0012\n\n\u0013\n\nfor Mt ≤ M < ∞ .\n\n(18)\n\nHere Mc is the parameter controlling the distribution in the upper ranges of M ('the corner\nmoment'), Mt is the moment threshold: the smallest moment above which the catalog can\nbe considered to be complete; β is the index parameter of the distribution; β = 32 b , b is a\nfamiliar b-value of the Gutenberg-Richter distribution (G-R, Gutenberg and Richter, 1944).\nBy evaluating the first moment of the distribution (18), we can obtain a theoretical\nestimate of the seismic moment flux (Kagan, 2002b)\nα0 M0β 1−β\nṀs =\nM\nΓ(2 − β) exp (M0 /Mc ) ,\n1−β c\n\n(19)\n\nwhere Γ is a gamma function and α0 is the seismic activity level (occurrence rate) for\nearthquakes with moment M0 and greater.\nWe compare the seismic moment rate with the tectonic moment rate (ṀT ):\nṀT = μ W\n\nZ Z\nA\n\n|ǫ̇| dA = Ṁs / χ ,\n\n(20)\n\nwhere χ is the seismic coupling (or seismic efficiency) coefficient, μ is the elastic shear\nmodulus, W is the seismogenic width of the lithosphere, ǫ̇ is the average horizontal strain\nrate, and A is the area under consideration. At present, some variables in the equation cannot\nbe evaluated with great accuracy; to overcome this difficulty we calculate a product of these\n19\n\n\fvariables: the 'effective width' of seismogenic zone We or coupled seismogenic thickness (Bird\nand Kagan, 2004):\nWe = W χ .\n\n(21)\n\nBird and Kagan (2004, Eq. 11) propose another, more exact formula for calculating the\ntectonic moment rate appropriate to a plate boundary zone.\nIn regions of high seismicity, instead of Eqs. 19–21 we can use measured long-term seismic\nactivity to infer the earthquake rate by extrapolating (18) to any moment level (see Bird and\nLiu, 2007, Eqs. 4 and 5). Bird et al. (2010) presented an algorithm and tables for a long-term\nworld-wide forecast of shallow seismicity based on the Global Strain Rate Map (GSRM) by\nKreemer et al. (2003). Because GSRM does not estimate tectonic strain-rates of stable plate\ninteriors, a simple empirical-averaging method has been used. Thus, the seismicity in plate\ninteriors is represented by a uniform rate.\nSince the seismicity level in plate interiors may vary by orders of magnitude, the uniform\nrate may strongly under- or over-estimate the seismicity rate. Therefore, we apply Eqs. 19–21\nto evaluate first the tectonic moment rate and then a long-term forecast for these regions\nα0 =\n\nṀT χ (1 − β) exp (−M0 /Mc )\n.\nM0β Mc1−β Γ(2 − β)\n\n(22)\n\nBy calculating α0 for a particular choice of M0 , we may re-normalize Eq. 18 and obtain\nearthquake size distribution for any region with a known strain rate and corner moment.\n\n4.2\n\nLength of aftershock zone\n\nEq. 22 above can be used to evaluate the background seismicity level for an aftershock\nzone. Such a calculation would use the area of an earthquake focal zone. This area can be\nestimated by a dimension of aftershock zone for each event. Kagan (2002a) evaluated how the\naftershock zone size for mainshocks m ≥ 7.0 depends upon on the earthquake magnitude by\n20\n\n\fapproximating aftershock epicenter maps through a two-dimensional Gaussian distribution.\nThe major ellipse axis is taken as a quantitative measure of the mainshock focal zone size.\nIn Fig. 13 we display the regression curves for GCMT/PDE earthquakes: all earthquakes\nfor three choices of focal mechanisms (updated Fig. 6a by Kagan, 2002a). In regression\ncurves we use m = 8.25 as a reference point. For example, for the quadratic regression\nL = log10 l = a0 + a1 (m − 8.25) + a2 (m − 8.25)2 ,\n\n(23)\n\nwhere l is the length of the aftershock zone in km. For the linear regression we set a2 = 0.\nFig. 14 displays the regression in a similar format for active continental tectonic zones (Kagan\net al., 2010).\nTable 2 summarizes the results of regression analysis for all global earthquakes, as well\nas for events in subduction zones (trenches) and on active continental zones. Earthquakes\nare also subdivided by their focal mechanism. Other tectonic zones lack a sufficient number\nof m ≥ 7.0 mainshocks to carry out this statistical analysis.\nThe following conclusions can be made from Table 2: (a) aftershock zones exhibit similar\nscaling; (b) zone length (l) on average is proportional to moment M 1/3 ; and (c) the value of\na0 parameter (zone length for the m8.25 earthquake) is close to 102.5 (316) km for all cases.\nNormal earthquakes (rows 5-6) exhibit slightly different scaling; zone length (l) for the linear\nregression is proportional to moment M 1/2.8 . Scaling for strike-slip earthquakes (rows 7-8)\nalso differs a little from average: zone length (l) is proportional to moment M 1/3.5 . However,\nthe earthquake numbers in these subsets are small, thus it is possible that these variations\nare due to random fluctuations.\nOnly three subsets show a substantial nonlinearity: (a) trenches with strike-slip focal\nmechanisms (rows 15-16); (b) continents with all focal mechanisms (rows 17-18); and (c)\ncontinents with strike-slip focal mechanisms (rows 21-22). However, the earthquake numbers\n21\n\n\fare small in all these plots, and although (b) and (c) aftershocks display zone lengths which\nincrease strongly for the largest earthquakes (the feature often quoted in other studies of\nlength scaling – see, for instance, Wells, and Coppersmith, 1994, and subsequent publications\nciting that paper), (a) earthquakes exhibit an opposite behavior.\nIn all diagrams the standard errors (σ) are almost the same for the linear and quadratic\nregression. The maximum errors (ǫmax ) follow the same pattern. This pattern suggest that\nlinear regression is sufficient to approximate the data. Although the quadratic regression\nfit yields no statistically significant improvement in almost any diagram, the sign of the\nquadratic correction term is negative for most cases. The negative value of the a2 regression coefficient means that increase in the aftershock zone length is weaker for the largest\nearthquakes. This feature contradicts those often quoted in other studies of length scaling\n(see Kagan, 2002a for details). Thus, the slope of the regression curve is either stable or\ndecreases at the high magnitude end. No saturation effect for large earthquakes occurs in\nthe data. Results in Table 2 imply that the major ellipse axis a (length) of an earthquake\nfocal zone can be approximated by\na = 316 × 10(m−8.25)/2 km .\n\n(24)\n\nWe conclude that earthquake rupture length is proportional to the cube root of moment,\nwhich implies that width and slip should scale the same way. Otherwise, one of them\nincreases less strongly with moment and the other more strongly. For either that would pose\nthe problem of \"inverse saturation.\"\nWe assume that the majority of aftershocks are concentrated within an ellipse having 2-a\nmajor axis. The probability that a point lies inside a 2-a ellipse is shown in Eq. 5 by Kagan\n(2002a). If we know the length of an earthquake focal zone, we can calculate its area. We\nassume, for example, that the ratio of the major ellipse axis to the minor axis is 1/4; then\n22\n\n\farea S of the focal zone is\nS = πa2 .\n\n4.3\n\n(25)\n\nExample: New Madrid earthquake sequence of 1811-12\n\nTo illustrate the arguments and results of the previous sections, we calculate seismicity\nparameters of the New Madrid earthquake sequence (1811-12) and its consequences. There\nis substantial literature on this sequence (Stein and Liu, 2009; Calais et al., 2010, and\nreferences therein).\nThree or four large earthquakes with magnitudes on the order of 7.5–8.0 occurred over a\nfew months of 1811-12 in the New Madrid area; aftershocks of these events are still registered.\nAs an illustration, we would assume that only one m8 event occurred at that time. If in\nreality earthquakes were smaller than such an event, their total focal zone and combined\naftershock sequence at the present time would be equivalent to about one m8 mainshock.\nThe size of the focal zone can be evaluated by using regression equations in Figs. 13 and\n14. The first plot contains many earthquakes but most of these events are in subduction\nzones. The second diagram uses earthquakes in active continental zones; a focal size of\nthese earthquakes is likely to resemble the New Madrid area which can be classified as plateinterior (Kagan et al., 2010). Too few large earthquakes are available within plate-interior\nto obtain their features. The difference between regression parameters in Figs. 13 and 14 is\nsmall; therefore the size of earthquake focal zones either does not change in various tectonic\nzones or changes slightly.\nFor an m8 earthquake, calculations yield 227 km and 259 km as the length of the focal\nzone, defined as the 4σ major axis of an ellipse comprising a majority of aftershocks (Kagan,\n2002a). The linear regression is used in both cases: the former value corresponds to Fig. 13\nand the latter to Fig. 14. The two estimates are similar and roughly correspond to the size\n23\n\n\fof the present aftershock zone, as shown, for example, in Calais et al. (2010).\nTo calculate the surface area of an aftershock zone, we assume that the minor axis of\nthe ellipse is 1/4 of the major axis, taken as 240 km. Then we obtain the m8 earthquake\nfocal area as 11300 km2 . Taking the average strain rate as ǫ̇ = 10−9 (Calais et al., 2006),\nwe compute the tectonic moment rate (20): 3.4 × 1015 Nm/year. Assuming that 50% of the\ntectonic rate is released seismically (Bird and Kagan, 2004), we obtain the background rate\nα0 = 1.27 × 10−3 m ≥ 5 earthquakes per year [we take in (22) Mc = 1021 Nm, W = 20 km,\nβ = 2/3; then Γ(4/3) = 0.893]. We use (18) to calculate the recurrence time for an m ≥ 8\nearthquake in the focal zone of the New Madrid events: more than two million years. In\nthis computation any m8 earthquake with an epicenter or centroid in the focal zone counts:\nin Eq. (22) we do not request that the entire rupture of such an earthquake be contained in\nthe zone. The recurrence time is an average value; even for events as large as m ≥ 8 the\nearthquake occurrence is clustered (see Section 3.2). Thus, a new large earthquake can follow\nafter a relatively short time period, as exemplified by the 1811-12 New Madrid sequence.\nWe would like to calculate the duration of an aftershock sequence up until the aftershock\nrate decays to the background level. The results in Fig. 12 can be applied to this purpose.\nHowever, we need to make a correction for the mainshock and aftershock magnitudes (m8\ninstead of m8.15 and m ≥ 5.0 instead of mb ≥ 4.9 in the plot, respectively). In the diagram\nthe aftershock rate per one interval (the intervals increase consequently by a factor of two)\nis 7 events. This translates into 4.55 m ≥ 5 events per interval for our choice of magnitudes\n(Kagan at al., 2010). After comparing the background and aftershock rates (we take 4.55\nm ≥ 5 aftershocks per the first day, decaying according to Omori's law, with 1/t rate with\ntime), we discover that the aftershock sequence would reach the background rate in about\n3,600 years. This duration estimate agree roughly with Stein and Liu's (2009) value. In\nthese calculations, we presume that no independent large earthquake clusters would occur\n24\n\n\fduring the aftershock sequence. The possible occurrence of spontaneous events makes any\nevaluation of aftershock sequence duration largely approximate.\nStein and Liu (2009) obtained aftershock duration values for several sequences using\nEq. 14 from Dieterich (1994). This equation employs parameters whose values for actual\nearthquake focal zones are not known. Generally, the parameters have been back adjusted\nbased on the statistics of earthquake occurrence. This may explain apparently reasonable\nfit of Dieterich's formula to aftershock sequences.\nIn contrast, we obtain the aftershock sequence duration by extending the tapered\nGutenberg-Richter and Omori's laws and using their well-known properties and measured\ngeometrical features of tectonic deformation. Moreover, according to Stein and Liu (2009,\nFig. 1c) the New Madrid aftershock rate for the last 50 years was about 0.5 m ≥ 4 events\nper year. Computations based on Omori's law similar to those shown above, yield the rate\n175 years after the mainshock occurrence of about 0.26 m ≥ 4 events per year. This number\nis close to that shown above.\n\n5\n\nDiscussion\n\nTwo classical statistical earthquake distributions largely governed our approach to analyzing seismicity: Omori's law and the Gutenberg-Richter relation. As explained above, recent\ndevelopments in earthquake size statistics considerably improved our understanding of earthquake occurrence and could lead to significantly better estimates of seismic hazard. For the\nG-R law the earthquake temporal distribution is mostly irrelevant, since size distribution\nof clustered events is largely independent of their history. Similar progress in understanding earthquake time statistics is much more difficult to achieve. We cannot ignore spatial\nvariables and the available data are not as extensive, so the task is more complex. Only by\n\n25\n\n\fapplying rigorous methods, by analyzing carefully systematic and random effects, and by\ncritical testing of models and hypotheses we will be able to advance in solving this problem.\nIn previous sections we derived the time distribution for earthquake occurrence; the\ndistribution is shown to be controlled by power-laws. How can the parameters of these\ndistributions be determined? If one excludes the interiors of plates, the tectonic deformation\nrate V is reasonably well known for plate boundaries and for active continents (Kagan et\nal., 2010; Bird et al., 2010). The diffusion rate D is presently unknown. If we could obtain\nthe earthquake temporal distribution as shown in Figs. 1 and 2, the D evaluation would\nbe easy. These distributions are derived for a particular area within an earthquake fault\nzone. However, if the stress in the focal zone of an earthquake is distributed according to\nthe power-law with an exponent ψ (see Eqs. 3 and 5), the problem becomes more acute.\n√\nFigs. 3 and 4 suggest that the distribution temporal behavior changes when V = D.\nThis change relates to the first generation of offspring. Thus, we should not be able to see\nit in regular Omori plots which combine many generations of aftershocks. The inversion\nof earthquake occurrence parameters based on stochastic branching processes yields needed\nfirst generation effects. However, in present models (both CBM and ETAS) as discussed\nin Section 3.3, temporal dependence is parameterized by just one exponent. These models\nshould in principle demonstrate changes in the temporal pattern, if more complicated temporal function is applied. However, results from statistical analysis are very uncertain even\nfor one-parameter time decay. Given the contemporary quantity and quality of earthquake\ncatalogs, it is unlikely more complicated models would be effective in resolving this issue.\nPerhaps new laboratory experiments (Zaiser, 2006) may help solve the problem of diffusion rate evaluation, but it is not clear whether such measurements are possible. The acoustic\nemission event rate exhibits fore- and aftershock sequences associated with dynamic failure\nof the test specimen (see, for example, Ojala et al., 2004). These and similar tests can be\n26\n\n\fused to infer the dependence of the Omori law parameters on spatial scale and stress diffusion\nrate.\nResults from statistical analysis of earthquake occurrence in our previous publications\n(Kagan, 2002b; Bird and Kagan, 2004; Kagan et al., 2010), as well as the results reported\nabove, suggest that the earthquake process in all tectonic provinces can be described by the\nsame model. We advocate the Poisson cluster process with clusters controlled by a critical\nbranching process and a power-law time dependence. Combined with the earthquake size\ndistribution approximation by the TGR, such a model allows mathematically forecast of a\nspatially variable, time-independent (long-term) earthquake rate. It will optimally smooth\nthe seismicity record (Kagan and Jackson, 2010) or translate the plate-tectonic and geodetic\nrate into a seismic hazard estimate (Bird and Liu, 2007; Bird et al., 2010).\nA short-term forecast can be performed by using the temporal properties of earthquake\nclusters, an extrapolation which uses a variant of Omori's law to estimate future earthquake\nrate (Kagan and Jackson, 2010). In Section 4.3 we presented an example of such calculations.\nIn conclusion, this paper suggests a method for calculating long- and short-term seismicity\nestimates, based on theoretical inference about classical, statistical earthquake distributions:\nthe Omori law and the G-R relation. Statistical analysis of earthquake occurrence carried out\nin our previous papers and in this work make such seismic hazard evaluation more reliable\nand accurate.\n\nAcknowledgments\nI am grateful to Dave Jackson, Paul Davis, and Peter Bird for useful discussion and suggestions. Per Jögi helped with the mathematica computations. I thank Kathleen Jackson\nfor significant improvements in the text. The author appreciates support from the National\nScience Foundation through grant EAR-0711515, as well as from the Southern California\n27\n\n\fEarthquake Center (SCEC). SCEC is funded by NSF Cooperative Agreement EAR-0529922\nand USGS Cooperative Agreement 07HQAG0008. Publication 0000, SCEC.\n\n28\n\n\fReferences\nAbramowitz, M. and Stegun, I. A., (Eds.), 1972. Handbook of Mathematical Functions,\nDover, NY, pp. 1046.\nBakun, W. H., and A. G. Lindh, 1985. The Parkfield, California, earthquake prediction\nexperiment, Science, 229, 619-624.\nBakun, W. H., B. Aagaard, B. Dost, W. L. Ellsworth, J. L. Hardebeck, R. A. Harris, C. Ji,\nM. J. S. Johnston, J. Langbein, J. J. Lienkaemper, A. J. Michael, J. R. Murray, R. M.\nNadeau, P. A. Reasenberg, M. S. Reichle, E. A. Roeloffs, A. Shakal, R. W. Simpson,\nand F. Waldhauser, 2005. Implications for prediction and hazard assessment from the\n2004 Parkfield earthquake, Nature, 437, 969-974.\nBird, P., and Y. Y. Kagan, 2004. Plate-tectonic analysis of shallow seismicity: apparent\nboundary width, beta, corner magnitude, coupled lithosphere thickness, and coupling\nin seven tectonic settings, Bull. Seismol. Soc. Amer., 94(6), 2380-2399 (plus electronic\nsupplement).\nBird, P., C. Kreemer, and W. E. Holt, 2010. A long-term forecast of shallow seismicity based\non the Global Strain Rate Map, Seismol. Res. Lett., 81(2), 184-194 (plus electronic\nsupplement).\nBird, P., and Z. Liu, 2007. Seismic hazard inferred from tectonics: California, Seism. Res.\nLett., 78(1), 37-48.\nBrémaud, P., and L. Massoulié, 2001. Hawkes branching point processes without ancestors,\nJ. Applied Probability, 38(1), 122-135.\nCalais, E., Han, J. Y., DeMets, C., Nocquet, J. M., 2006. Deformation of the North\nAmerican plate interior from a decade of continuous GPS measurements, J. Geophys.\nRes., 111(B6), B06402, doi:10.1029/2005JB004253.\n\n29\n\n\fCalais, E., Freed, A. M., Van Arsdale, R. & Stein, S. (2010). Triggering of New Madrid\nseismicity by late-Pleistocene erosion, Nature, 466, 608-611\nChhikara, R., and J. L. Folks, 1989. The Inverse Gaussian Distribution, New York, M.\nDekker, 213 pp.\nDawson, T. E., S. F. McGill, and T. K. Rockwell (2003), Irregular recurrence of paleoearthquakes along the central Garlock fault near El Paso Peaks, California, J. Geophys.\nRes., 108(B7), 2356, doi:10.1029/2001JB001744.\nDieterich, J., 1994. A constitutive law for rate of earthquake production and its application\nto earthquake clustering, J. Geophys. Res., 99, 2601-2618.\nEbel, J. E., 2009. Analysis of aftershock and foreshock activity in stable continental regions: implications for aftershock forecasting and the hazard of strong earthquakes,\nSeismological Research Letters, 80(6), 1062-1068.\nEkström, G., 2007. Global seismicity: results from systematic waveform analyses, 19762005, in Treatise on Geophysics, 4(4.16), ed. H. Kanamori, pp. 473-481.\nEkström, G., A. M. Dziewonski, N. N. Maternovskaya and M. Nettles, 2005. Global seismicity of 2003: Centroid-moment-tensor solutions for 1087 earthquakes, Phys. Earth\nplanet. Inter., 148(2-4), 327-351.\nEllsworth, W. L. (1995). Characteristic earthquakes and long-term earthquake forecasts:\nimplications of central California seismicity, in F. Y. Cheng and M. S. Sheu (Editors),\nUrban Disaster Mitigation: The Role of Science and Technology, Elsevier Science Ltd.,\nOxford.\nEllsworth, W. L., M. V. Matthews, R. M. Nadeau, S. P. Nishenko, P. A. Reasenberg, and\nR. W. Simpson (1999). A physically based earthquake recurrence model for estimation\nof long-term earthquake probabilities, U.S. Geol. Surv. Open-File Rept. 99-522.\n\n30\n\n\fEnescu, B., J. Mori, M. Miyazawa, and Y. Kano, 2009. Omori-Utsu law c-values associated\nwith recent moderate earthquakes in Japan, Bull. Seismol. Soc. Amer., 99(2A), 884-891.\nFeller, W., 1966. An Introduction to Probability Theory and its Applications, 2, J. Wiley,\nNew York, 626 pp.\nFelzer, K. R., T. W. Becker, R. E. Abercrombie, G. Ekström and J. R. Rice, 2002. Triggering\nof the 1999 Mw 7.1 Hector Mine earthquake by aftershocks of the 1992 Mw 7.3 Landers\nearthquake, J. Geophys. Res., 107(B9), 2190, doi:10.1029/2001JB000911.\nGutenberg, B. and Richter, C.F., 1944. Frequency of earthquakes in California, Bull. seism.\nSoc. Am., 34, 185-188.\nHanks, T.C., 1992. Small earthquakes, tectonic forces, Science, 256, 1430-1432.\nHawkes, A. G., and L. Adamopoulos, 1973. Cluster models for earthquakes - Regional\ncomparisons, Bull. Int. Statist. Inst., 45(3), 454-461.\nHelmstetter, A., and D. Sornette, 2003.\n\nImportance of direct and indirect triggered\n\nseismicity in the ETAS model of seismicity, Geophys. Res. Lett., 30(11), 1576,\ndoi:10.1029/2003GL017670.\nHelmstetter, A., Y. Y. Kagan, and D. D. Jackson, 2005. Importance of small earthquakes\nfor stress transfers and earthquake triggering, J. Geophys. Res., 110(B5), B05S08,\ndoi:10.1029/2004JB003286, pp. 1-13.\nHelmstetter, A., Y. Y. Kagan, and D. D. Jackson, 2006. Comparison of short-term and\ntime-independent earthquake forecast models for southern California, Bull. Seismol. Soc.\nAmer., 96(1), 90-106.\nJackson, D. D., and Y. Y. Kagan, 2006. The 2004 Parkfield earthquake, the 1985 prediction,\nand characteristic earthquakes: lessons for the future, Bull. Seismol. Soc. Amer., 96(4B),\nS397-S409, doi: 10.1785/0120050821.\n\n31\n\n\fKagan, Y. Y., 1982. Stochastic model of earthquake fault geometry, Geophys. J. Roy. astr.\nSoc., 71(3), 659-691.\nKagan, Y. Y., 1991. Likelihood analysis of earthquake catalogues, Geophys. J. Int., 106(1),\n135-148.\nKagan, Y. Y., 1994. Distribution of incremental static stress caused by earthquakes, Nonlinear Processes Geophys., 1(2/3), 172-181.\nKagan, Y. Y., 2002a. Aftershock zone scaling, Bull. Seismol. Soc. Amer., 92(2), 641-655.\nKagan, Y. Y., 2002b. Seismic moment distribution revisited: II. Moment conservation\nprinciple, Geophys. J. Int., 149(3), 731-754.\nKagan, Y. Y., 2004. Short-term properties of earthquake catalogs and models of earthquake\nsource, Bull. Seismol. Soc. Amer., 94(4), 1207-1228.\nKagan, Y. Y., 2005. Earthquake slip distribution: A statistical model, J. Geophys. Res.,\n110(B5), B05S11, doi:10.1029/2004JB003280, pp. 1-15.\nKagan, Y. Y., 2007. Earthquake spatial distribution: the correlation dimension, Geophys.\nJ. Int., 168(3), 1175-1194.\nKagan, Y. Y., P. Bird, and D. D. Jackson, 2010. Earthquake patterns in diverse tectonic\nzones of the Globe, Pure Appl. Geoph. (The Frank Evison Volume), 167(6/7), 721-741,\nDOI: 10.1007/s00024-010-0075-3.\nKagan, Y. Y., and H. Houston, 2005. Relation between mainshock rupture process and\nOmori's law for aftershock moment release rate, Geophys. J. Int., 163(3), 1039-1048,\ndoi:10.1111/j.1365-246X.2005.02772.x\nKagan, Y. Y., and D. D. Jackson, 1991. Long-term earthquake clustering, Geophys. J. Int.,\n104(1), 117-133.\nKagan, Y. Y. and D. D. Jackson, 1999. Worldwide doublets of large shallow earthquakes,\n\n32\n\n\fBull. Seismol. Soc. Amer., 89(5), 1147-1155.\nKagan, Y. Y. and Jackson, D. D., 2010. Global earthquake forecasts, Geophys. J. Int.,\naccepted.\nKagan, Y. Y., and L. Knopoff, 1987. Random stress and earthquake statistics: Time\ndependence, Geophys. J. Roy. astr. Soc., 88(3), 723-731, DOI: 10.1111/j.1365246X.1987.tb01653.x.\nKen-Tor R, Agnon A, Enzel Y, Stein M, Marco S, Negendank JFW, 2001. High-resolution\ngeological record of historic earthquakes in the Dead Sea basin, J. Geophys. Res.,\n106(B2), 2221-2234.\nKreemer, C., Holt, W. E., and Haines, A. J., 2003.\n\nAn integrated global model of\n\npresent-day plate motions and plate boundary deformation, Geophys. J. Int., 154, 8-34,\ndoi:10.1046/j.1365-246X.2003.01917.x\nLavallée, D., 2008. On the random nature of earthquake sources and ground motions: a\nunified theory, Advances in Geophysics, 50, 427-461.\nMarsan, D., 2005. The role of small earthquakes in redistributing crustal elastic stress,\nGeophys. J. Int., 163(1), 141-151, doi:10.1111/j.1365-246X.2005.02700.x\nMarsan, D., and Lengliné, O., 2008. Extending earthquakes' reach through cascading,\nScience, 319, 1076-1079.\nMatthews, M. V., W. L. Ellsworth, and P. A. Reasenberg, 2002. A Brownian model for\nrecurrent earthquakes, Bull. Seismol. Soc. Amer., 92, 2233-2250.\nMcCann, W. R., S. P. Nishenko, L. R. Sykes, and J. Krause, 1979. Seismic gaps and plate\ntectonics: seismic potential for major boundaries, Pure Appl. Geophys., 117, 1082-1147.\nNadeau, R. M., W. Foxall, and T. V. McEvilly (1995). Clustering and periodic recurrence\nof microearthquakes on the San Andreas fault at Parkfield, California, Science, 267,\n\n33\n\n\f503-507.\nNadeau, R. M., and Johnson, L. R., 1998. Seismological studies at Parkfield VI: Moment\nrelease rates and estimates of source parameters for small repeating earthquakes, Bull.\nSeismol. Soc. Amer., 88, 790-814.\nNishenko, S. P., 1991. Circum-Pacific seismic potential – 1989-1999, Pure Appl. Geophys.,\n135, 169-259.\nOgata, Y., 1998. Space-time point-process models for earthquake occurrences, Ann. Inst.\nStatist. Math., 50(2), 379-402.\nOgata, Y., Jones, L.M., Toda S., 2003. When and where the aftershock activity was depressed: Contrasting decay patterns of the proximate large earthquakes in southern\nCalifornia, J. Geophys. Res., 108(B6), 2318.\nOgata, Y., and J. C. Zhuang, 2006. Space-time ETAS models and an improved extension,\nTectonophysics, 413(1-2), 13-23.\nOjala, I. O., I. G. Main, and B. T. Ngwenya (2004). Strain rate and temperature dependence\nof Omori law scaling constants of AE data: Implications for earthquake foreshockaftershock sequences, Geophys. Res. Lett., 31, L24617, doi:10.1029/2004GL020781\nOmori, F., 1894. On the after-shocks of earthquakes, J. College Sci., Imp. Univ. Tokyo, 7,\n111-200 (with Plates IV-XIX).\nParsons, T., 2009. Lasting earthquake legacy, Nature, 462(7269), 42-43.\nPowers, P. M., and Jordan, T. H., 2010. Distribution of seismicity across strike-slip faults\nin California, J. Geophys. Res., 115(B05), Article Number: B05305.\nRong, Y.-F., D. D. Jackson and Y. Y. Kagan, 2003. Seismic gaps and earthquakes, J.\nGeophys. Res., 108(B10), 2471, ESE-6, pp. 1-14, doi:10.1029/2002JB002334.\nRockwell, T. K., Lindvall, S., Herzberg, M., Murbach, D., Dawson, T., and G. Berger,\n\n34\n\n\f2000. Paleoseismology of the Johnson Valley, Kickapoo, and Homestead Valley faults:\nclustering of earthquakes in the eastern California shear zone, Bull. Seismol. Soc. Amer.,\n90, 1200-1236.\nSeshadri, V., 1999. Inverse Gaussian Distribution: Statistical Theory and Applications,\nLecture Notes in Statistics, 137, New York, Springer, 347 pp.\nStein, S., and M. Liu, 2009. Long aftershock sequences within continents and implications\nfor earthquake hazard assessment, Nature, 462(7269), 87-89.\nU.S. Geological Survey, 2010. Preliminary determinations of epicenters (PDE), (last ac-\n\ncessed November 2010), http://neic.usgs.gov/neis/epic/epic.html and http://neic.usgs.gov/neis/epic/co\nUtsu, T., Y. Ogata, and R. S. Matsu'ura, 1995. The centenary of the Omori formula for a\ndecay law of aftershock activity, J. Phys. Earth, 43, 1-33.\nWells, D. L., and K. J. Coppersmith, 1994. New empirical relationships among magnitude,\nrupture length, rupture width, rupture area, and surface displacement, Bull. Seismol.\nSoc. Amer., 84, 974-1002.\nWolfram, S., 1999. The Mathematica Book, 4th ed., Champaign, IL, Wolfram Media,\nCambridge, New York, Cambridge University Press, pp. 1470.\nZaiser, M., 2006. Scale invariance in plastic flow of crystalline solids, Advances Physics,\n55(1-2), 185-245.\nZhuang, J.C., Chang, C.-P., Ogata, Y., and Chen, Y.-I., 2005. A study on the background\nand clustering seismicity in the Taiwan region by using point process models J. Geophys.\nRes., 110, B05S18, doi:10.1029/2004JB003157.\nZolotarev, V. M., 1986. One-Dimensional Stable Distributions, Amer. Math. Soc., Providence, R.I., pp. 284; Russian original 1983.\n\n35\n\n\fTable 1: Pairs of shallow earthquakes m ≥ 7.5\nFirst Event\nNo\n\nDate\n\nSecond Event\n\nCoord.\nLat.\n\nm\n\nDate\n\nLong.\n\nDifference\n\nCoord.\nLat.\n\nm\n\nLong.\n\nR\n\nΦ\n\n∆t\n\nkm\n\n◦\n\nday\n\n1 1977/06/22 -22.9 -174.9 8.1 2009/03/19 -23.1 -174.2 7.7\n\n75 55\n\n2 1978/03/23\n\n149.3 7.6 1978/03/24\n\n11593.26 1.4\n\n44.2\n\n149.0 7.6\n\n25\n\n7\n\n1.69 2.3\n\n3 1980/07/08 -12.9\n\n166.2 7.5 1980/07/17 -12.4\n\n165.9 7.8\n\n62 18\n\n8.85 1.1\n\n4 1980/07/08 -12.9\n\n166.2 7.5 1997/04/21 -13.2\n\n166.2 7.8\n\n33 42\n\n6130.53 2.0\n\n5 1980/07/08 -12.9\n\n166.2 7.5 2009/10/07 -12.6\n\n166.3 7.7\n\n37 13\n\n10682.95 1.6\n\n6 1980/07/17 -12.4\n\n165.9 7.8 2009/10/07 -12.6\n\n166.3 7.7\n\n41 14\n\n10674.10 1.8\n\n7 1980/07/17 -12.4\n\n165.9 7.8 2009/10/07 -11.9\n\n166.0 7.9\n\n65 12\n\n10674.11 1.3\n\n8 1983/03/18\n\n-4.9\n\n153.3 7.8 2000/11/16\n\n-4.6\n\n152.8 8.1\n\n83 72\n\n6452.83 1.3\n\n9 1983/03/18\n\n-4.9\n\n153.3 7.8 2000/11/16\n\n-5.0\n\n153.2 7.9\n\n47 91\n\n6452.94 1.8\n\n17.6 -101.4 7.6\n\n71 14\n\n1.51 1.3\n\n10 1985/09/19\n\n44.1\n\nη\n\n17.9 -102.0 8.0 1985/09/21\n\n11 1987/03/05 -24.4\n\n-70.9 7.6 1995/07/30 -24.2\n\n-70.7 8.1\n\n33\n\n7\n\n3068.83 2.8\n\n12 1990/04/18\n\n1.3\n\n123.3 7.7 1991/06/20\n\n1.0\n\n123.2 7.6\n\n37 29\n\n427.65 1.6\n\n13 1995/08/16\n\n-5.5\n\n153.6 7.8 2000/11/16\n\n-5.0\n\n153.2 7.9\n\n76 74\n\n1918.89 1.1\n\n14 1997/04/21 -13.2\n\n166.2 7.8 2009/10/07 -12.6\n\n166.3 7.7\n\n70 30\n\n4552.42 1.0\n\n15 2000/06/04\n\n-4.7\n\n101.9 7.9 2007/09/12\n\n-3.8\n\n101.0 8.6 150 85\n\n2655.78 1.3\n\n16 2000/11/16\n\n-4.6\n\n152.8 8.1 2000/11/16\n\n-5.0\n\n153.2 7.9\n\n67 89\n\n0.12 1.7\n\n17 2000/11/16\n\n-4.6\n\n152.8 8.1 2000/11/17\n\n-5.3\n\n152.3 7.8\n\n93 88\n\n1.67 1.2\n\n-72.7 8.5 2001/07/07 -17.5\n\n-72.4 7.7\n\n34\n\n8\n\n13.54 4.7\n\n58\n\n7\n\n1835.25 4.0\n\n18 2001/06/23 -17.3\n19 2005/03/28\n\n1.7\n\n97.1 8.7 2010/04/06\n\n2.0\n\n96.7 7.8\n\n20 2006/11/15\n\n46.7\n\n154.3 8.4 2007/01/13\n\n46.2\n\n154.8 8.2\n\n70 82\n\n58.71 2.7\n\n21 2007/09/12\n\n-3.8\n\n101.0 8.6 2007/09/12\n\n-2.5\n\n100.1 7.9 176 11\n\n0.53 1.2\n\n22 2007/09/12\n\n-3.8\n\n101.0 8.6 2010/10/25\n\n-3.7\n\n99.3 7.9 189\n\n8\n\n1139.15 1.1\n\nR – centroid distance, Φ – 3-D rotation angle between focal mechanisms, ∆t – time interval\nbetween events, η – degree of zone overlap, the ratio of earthquake focal zone sizes to twice\ntheir distance, see Equations (2,3) in Kagan and Jackson (1999). The total earthquake\nnumber with magnitude m ≥ 7.50 for the period 1976/1/1–2010/10/25 is 121. The maximum\nepicentroid distance is 250.00 km.\n\n36\n\n\fTable 2: Aftershock zone log length vs mainshock moment magnitude m\n#\n\nTectonic zone\n\nFocal mech.\n\na0\n\na1\n\na2\n\nσ\n\nǫmax\n\nn\n\n1\n\nAll\n\nAll\n\n2.48 0.492\n\n– 0.134 0.468 160\n\n2\n\nAll\n\nAll\n\n2.48 0.493\n\n0.0013 0.134 0.468 160\n\n3\n\nAll\n\nThrust\n\n2.48 0.501\n\n– 0.132 0.457 115\n\n4\n\nAll\n\nThrust\n\n2.48 0.499\n\n0.0022 0.132 0.458 115\n\n5\n\nAll\n\nNormal\n\n2.47 0.532\n\n– 0.076 0.132\n\n15\n\n6\n\nAll\n\nNormal\n\n2.46 0.427 −0.0884 0.075 0.137\n\n15\n\n7\n\nAll\n\nStr.-Slip\n\n2.47 0.437\n\n– 0.153 0.276\n\n30\n\n8\n\nAll\n\nStr.-Slip\n\n2.49 0.490\n\n0.0038 0.153 0.278\n\n30\n\n9\n\nTrench\n\nAll\n\n2.47 0.499\n\n10\n\nTrench\n\nAll\n\n2.47 0.482 −0.0177 0.131 0.449 129\n\n11\n\nTrench\n\nThrust\n\n2.48 0.500\n\n12\n\nTrench\n\nThrust\n\n2.48 0.488 −0.0142 0.135 0.455 104\n\n13\n\nTrench\n\nNormal\n\n2.47 0.543\n\n– 0.067 0.120\n\n12\n\n14\n\nTrench\n\nNormal\n\n2.46 0.440 −0.0915 0.065 0.114\n\n12\n\n15\n\nTrench\n\nStr.-Slip\n\n2.38 0.409\n\n– 0.146 0.302\n\n13\n\n16\n\nTrench\n\nStr.-Slip\n\n2.29 0.034 −0.2790 0.142 0.268\n\n13\n\n17\n\nActive Cont.\n\nAll\n\n2.52 0.504\n\n– 0.138 0.256\n\n27\n\n18\n\nActive Cont.\n\nAll\n\n2.74 1.180\n\n0.4250 0.135 0.220\n\n27\n\n19\n\nActive Cont.\n\nThrust\n\n2.44 0.480\n\n– 0.112 0.176\n\n10\n\n20\n\nActive Cont.\n\nThrust\n\n3.00 2.210\n\n1.0800 0.064 0.130\n\n10\n\n21\n\nActive Cont.\n\nStr.-Slip\n\n2.50 0.419\n\n– 0.145 0.314\n\n14\n\n22\n\nActive Cont.\n\nStr.-Slip\n\n2.65 0.889\n\n0.2990 0.143 0.295\n\n14\n\n– 0.131 0.454 129\n\n– 0.135 0.460 104\n\na0 , a1 , a2 are regression coefficients in Eq. 23; σ is the standard uncertainty; ǫmax is the\nmaximum error; n is the number of aftershock sequences. The catalogs time interval is\n1977/1/1–2010/09/21.\n\n37\n\n\fFig. 1\n\n2\n\n10\n\nσ = 1 (red)\n\n1\n\n10\n\n0\n\nLevy distribution density\n\n10\n\n−1\n\n10\n\n−2\n\n10\n\n−3\n\n10\n\n−4\n\n10\n\n−5\n\n10\n\n−6\n\n10\n\n−7\n\n10\n\n−8\n\n10\n\n−3\n\n10\n\n−2\n\n10\n\n−1\n\n10\n\n0\n\n10\n\n1\n\n10\n\n2\n\n10\n\n3\n\n10\n\nTime\n\nFigure 1:\nPlot of PDFs for the Lévy distribution (2), D = 1.0; σ = 0.001, 0.01, 0.1, 1.0, 10.0, 100.0.\n\n38\n\n\fFig. 2\n\n2\n\n10\n\nσ = 1 (red)\n\n1\n\n10\n\n0\n\nIGD distribution density\n\n10\n\n−1\n\n10\n\n−2\n\n10\n\n−3\n\n10\n\n−4\n\n10\n\n−5\n\n10\n\n−6\n\n10\n\n−7\n\n10\n\n−8\n\n10\n\n−3\n\n10\n\n−2\n\n10\n\n−1\n\n10\n\n0\n\n1\n\n10\n\n2\n\n10\n\n3\n\n10\n\n10\n\nTime\n\nFigure 2:\nPlot of PDFs for the IGD distribution (4),\n0.001, 0.01, 0.1, 1.0, 10.0, 100.0, 1000.0.\n\n39\n\nV\n\n=\n\n√\n\nD;\n\nD\n\n=\n\nV 2;\n\nσ\n\n=\n\n\fFig. 3\n\n6\n\n10\n\n4\n\n10\n\nDistribution density\n\n2\n\n10\n\n0\n\n10\n\n−2\n\n10\n\n−4\n\n10\n\n−6\n\n10\n\n−3\n\n10\n\n−2\n\n10\n\n−1\n\n10\n\n0\n\n10\n\nTime\n\nFigure 3:\nPlot of PDFs for the IGD distribution (Eqs. 5 – 9).\n√\nCurve with squares (7): V = D, ψ = 0.0;\n√\ncurve with diamonds (8): V = D, ψ = 0.5;\n√\ncurve with crosses (9): V = − D, ψ = 0.5;\n√\ncurve with circles (5): V = D, ψ = 0.9.\n\n40\n\n1\n\n10\n\n2\n\n10\n\n3\n\n10\n\n\fFig. 4\n\n1\n\nRenormalized distribution density\n\n10\n\n0\n\n10\n\n−1\n\n10\n\n−2\n\n10\n\n−3\n\n10\n\n−3\n\n10\n\n−2\n\n10\n\n−1\n\n10\n\n0\n\n10\n\n1\n\n10\n\n2\n\n10\n\n3\n\n10\n\nTime\n\nFigure 4:\nPlot of PDFs for the IGD distribution (Eqs. 5 – 9), multiplied by t1+ψ/2 , D = 1.0.\n√\nCurve with squares (7): V = D, ψ = 0.0;\n√\ncurve with diamonds (8): V = D, ψ = 0.5;\n√\ncurve with crosses (9): V = − D, ψ = 0.5;\n√\ncurve with circles (5): V = D, ψ = 0.9.\n\n41\n\n\fFig. 5\n1\n\n0.9\n\nCumulative Number of pairs\n\n0.8\n\n0.7\n\n0.6\n\n0.5\n\n0.4\n\n0.3\n\n0.2\n\nAll, red (−), pair N = 833, <λ> = 39.2, σλ = 21.9\nTrench, green (−−), pair N = 752, <λ> = 41.9, σ = 20.9\nλ\nAct. cont., blue (−.), pair N = 37, <λ> = 12.2, σλ = 11.7\n\n0.1\n\n0\n\n0\n\n20\n\n40\n\n60\n\n−20\n\nEarthquake rate, 10\n\n80\n\n2\n\n100\n\n120\n\nevents/m /s\n\nFigure 5:\nNormalized cumulative distribution of earthquake rate for m ≥ 6.5 shallow earthquake pairs\nin all zones, trench (subduction) zones, and active continental zones. The pair numbers N,\naverage rate < λ > and its standard deviation σλ are also shown. Earthquake rate is taken\nfrom a table by Bird et al. (2010) for a magnitude threshold mt = 5.66.\n\n42\n\n\f0 t0\n\nt\n\nT\n\nFigure 6:\nIntegration domain for calculating inter-earthquake rates in a catalog of duration T . The\nminimum time interval, t0 , corresponds to the coda duration time of the first event.\n\n43\n\n\fCumulative number of pairs\n\nFig. 7\n\n2\n\n10\n\n1000\n\n2000\n\n3000\n\n4000\n\n5000\n\n6000\n\n7000\n\n8000\n\n9000\n\nTime interval, days\n\nFigure 7:\nEarthquake pair numbers in all zones with rates 0−26×10−20 events/m2 /s. Earthquake rate\nis taken from a table by Bird et al. (2010) for a magnitude threshold mt = 5.66. Pair number\nis 240. Solid curve is earthquake pair numbers; dashed curve is Poisson approximation (15),\ndash-dotted curves are for power-law approximations (16), the θ-value is 0.5, 0.65, 0.75, 0.85,\n0.925, and 0.99 from top to bottom. The catalogs time interval is 1976/1/1–2010/11/14.\nAverage recurrence time (t̄) for earthquakes is t̄ = 3272 ± 3596 days.\n\n44\n\n\fCumulative number of pairs\n\nFig. 8\n\n2\n\n10\n\n1000\n\n2000\n\n3000\n\n4000\n\n5000\n\n6000\n\n7000\n\n8000\n\n9000\n\nTime interval, days\n\nFigure 8:\nEarthquake pair numbers in all zones with rates 26 − 45 × 10−20 events/m2 /s. Pair number\nis 333. Average recurrence time (t̄) for earthquakes is t̄ = 3507 ± 3242 days. For notation\nsee Fig. 7.\n\n45\n\n\fCumulative number of pairs\n\nFig. 9\n\n2\n\n10\n\n1000\n\n2000\n\n3000\n\n4000\n\n5000\n\n6000\n\n7000\n\n8000\n\n9000\n\nTime interval, days\n\nFigure 9:\nEarthquake pair numbers in all zones with rates ≥ 45 × 10−20 events/m2 /s. Pair number is\n264. Average recurrence time (t̄) for earthquakes is t̄ = 3947 ± 3319 days. For notation see\nFig. 7.\n\n46\n\n\fCumulative number of pairs\n\nFig. 10\n\n1\n\n10\n\n1000\n\n2000\n\n3000\n\n4000\n\n5000\n\n6000\n\n7000\n\n8000\n\n9000\n\nTime interval, days\n\nFigure 10:\nEarthquake pair numbers in active continental zones. Pair number is 37. Average recurrence\ntime (t̄) for earthquakes is t̄ = 1304 ± 2578 days. For notation see Fig. 7.\n\n47\n\n\fFig. 11\n1\n\nρ2 = −0.714, red (o)\n\n0.9\n\nRegression: θ = 0.662−2.58 μ\n\nρ3 = −0.912, bl (x)\nρ4 = −0.661, gr (+)\n\n0.8\n\nρ5 = −0.209, mg (*)\n\n0.7\n\nρ6 = −0.483, cy (sq)\nρ7 = −0.794, y (di)\n\nθ\n\n0.6\n\nρ = −0.606, all\n\n0.5\n\n0.4\n\n0.3\n\n0.2\n\n0.1\n\n0\n\n0\n\n0.05\n\n0.1\n\n0.15\n\nμ\n\n0.2\n\n0.25\n\nFigure 11:\nCorrelation between maximum likelihood estimates of μ and θ parameters in several earthquake catalogs (Kagan et al., 2010). The subscripts i at correlation coefficients (ρi ) point to\nthe table number in Kagan et al. (2010).\n\n48\n\n\fFig. 12\n2\n\n10\n\n1\n\nEarthquake numbers\n\n10\n\n0\n\n10\n\n−1\n\n10\n\n−2\n\n10\n\n−8\n\n−6\n\n−4\n\n−2\n\nLog\n\n0\n\n∆ t (days)\n2\n\n2\n\n4\n\n6\n\nFigure 12:\nThe average aftershock numbers from the PDE catalog in logarithmic time intervals following m ≥ 8.0 GCMT earthquakes during 1977-2003. Line with plus signs shows mb ≥ 4.9\naftershocks; dashed lines are theoretical estimates for the first generation aftershocks. Two\ncurves display results of earthquake catalog simulation: line with circles shows first generation aftershocks, line with squares indicates total aftershock numbers.\n\n49\n\n\fFig. 13\n\nLog10 length of aftershock zone, 4σj (km)\n\n3.2\n3\n\n2.8\n\nρ = 0.83, L = 2.48 + 0.492 (mW−8.25)\nσ = 0.134, εmax = 0.468, n = 160\nL = 2.48 + 0.493 (mW−8.25) + 0.00133 (mW−8.25)2\nσ = 0.134, εmax = 0.468\n\n2.6\n2.4\n2.2\n2\n\n1.8\n1.6\n1.4\n7\n\n7.5\n\n8\n\n8.5\n\n9\n\nMoment Magnitude (mw)\n\nFigure 13:\nPlot of log aftershock zone length (L) against moment magnitude (m). Rupture length\nis determined using a 1-day aftershock pattern. Values of the correlation coefficient (ρ),\ncoefficients for linear (dashed line) and quadratic (solid line) regression, standard (σ) and\nmaximum (ǫmax ) errors, and the total number (n) of aftershock sequences are shown in the\ndiagram.\nCircles – thrust mainshocks;\nStars – normal mainshocks;\nPluses – strike-slip mainshocks.\n\n50\n\n\fAftershocks vs moment, active cont. quakes (mw > 7.0, 1977−2010)\n\nLog10 length of aftershock zone, 4σj (km)\n\n2.6\n2.5\n2.4\n\nρ = 0.75, L = 2.52 + 0.504 (mW−8.25)\nσ = 0.138, εmax = 0.256, n = 27\nL = 2.74 + 1.18 (mW−8.25) + 0.425 (mW−8.25)2\nσ = 0.135, ε\n\nmax\n\n= 0.22\n\n2.3\n2.2\n2.1\n2\n\n1.9\n1.8\n1.7\n7\n\n7.2\n\n7.4\n\n7.6\n\n7.8\n\n8\n\nMoment Magnitude (m )\nw\n\nFigure 14:\nPlot of log aftershock zone length (L) against moment magnitude (m) for earthquakes in\nactive continental zones (Kagan et al., 2010). For notation see Fig. 13.\n\n51\n\n\f"}