{"id": "http://arxiv.org/abs/0911.5475v1", "guidislink": true, "updated": "2009-11-29T10:34:49Z", "updated_parsed": [2009, 11, 29, 10, 34, 49, 6, 333, 0], "published": "2009-11-29T10:34:49Z", "published_parsed": [2009, 11, 29, 10, 34, 49, 6, 333, 0], "title": "The chain relation in sofic subshifts", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0911.1005%2C0911.3496%2C0911.4603%2C0911.0523%2C0911.1583%2C0911.2139%2C0911.3001%2C0911.3770%2C0911.1218%2C0911.5475%2C0911.2751%2C0911.0960%2C0911.1519%2C0911.1294%2C0911.5388%2C0911.4876%2C0911.4574%2C0911.4010%2C0911.4832%2C0911.0059%2C0911.0482%2C0911.1620%2C0911.3455%2C0911.1008%2C0911.3909%2C0911.5523%2C0911.2551%2C0911.0603%2C0911.3673%2C0911.3803%2C0911.4196%2C0911.0369%2C0911.2539%2C0911.3070%2C0911.5268%2C0911.1072%2C0911.0831%2C0911.3624%2C0911.3448%2C0911.1643%2C0911.2599%2C0911.1369%2C0911.1279%2C0911.1817%2C0911.0745%2C0911.0649%2C0911.2531%2C0911.1430%2C0911.4006%2C0911.0480%2C0911.2368%2C0911.4166%2C0911.0581%2C0911.2122%2C0911.2757%2C0911.4983%2C0911.4724%2C0911.3573%2C0911.1141%2C0911.1361%2C0911.3936%2C0911.3200%2C0911.1213%2C0911.4143%2C0911.1930%2C0911.2118%2C0911.4639%2C0911.1339%2C0911.0266%2C0911.4024%2C0911.3231%2C0911.0690%2C0911.3399%2C0911.1868%2C0911.0685%2C0911.3118%2C0911.3945%2C0911.4467%2C0911.4241%2C0911.0452%2C0911.5569%2C0911.3865%2C0911.1762%2C0911.5259%2C0911.0359%2C0911.4900%2C0911.5248%2C0911.5056%2C0911.3764%2C0911.5448%2C0911.3300%2C0911.3492%2C0911.4678%2C0911.2111%2C0911.1417%2C0911.0958%2C0911.0062%2C0911.2339%2C0911.1206%2C0911.4458%2C0911.2606&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The chain relation in sofic subshifts"}, "summary": "The paper gives a characterisation of the chain relation of a sofic subshift.\nEvery sofic subshift $\\Sigma$ can be described by a labelled graph $G$.\nFactorising $G$ in a suitable way we obtain the graph $G/_\\approx$ that offers\ninsight into some properties of the original subshift. Using $G/_\\approx$ we\ndescribe first the chain relation in $\\Sigma$, then characterise\nchain-transitive sofic subshifts, chain-mixing sofic subshifts and finally the\nattractors of the subshift dynamic system. At the end we present\n(straightforward) algorithms deciding chain-transitivity and chain-mixing\nproperties of a sofic subshift and listing all the attractors of the subshift\nsystem.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0911.1005%2C0911.3496%2C0911.4603%2C0911.0523%2C0911.1583%2C0911.2139%2C0911.3001%2C0911.3770%2C0911.1218%2C0911.5475%2C0911.2751%2C0911.0960%2C0911.1519%2C0911.1294%2C0911.5388%2C0911.4876%2C0911.4574%2C0911.4010%2C0911.4832%2C0911.0059%2C0911.0482%2C0911.1620%2C0911.3455%2C0911.1008%2C0911.3909%2C0911.5523%2C0911.2551%2C0911.0603%2C0911.3673%2C0911.3803%2C0911.4196%2C0911.0369%2C0911.2539%2C0911.3070%2C0911.5268%2C0911.1072%2C0911.0831%2C0911.3624%2C0911.3448%2C0911.1643%2C0911.2599%2C0911.1369%2C0911.1279%2C0911.1817%2C0911.0745%2C0911.0649%2C0911.2531%2C0911.1430%2C0911.4006%2C0911.0480%2C0911.2368%2C0911.4166%2C0911.0581%2C0911.2122%2C0911.2757%2C0911.4983%2C0911.4724%2C0911.3573%2C0911.1141%2C0911.1361%2C0911.3936%2C0911.3200%2C0911.1213%2C0911.4143%2C0911.1930%2C0911.2118%2C0911.4639%2C0911.1339%2C0911.0266%2C0911.4024%2C0911.3231%2C0911.0690%2C0911.3399%2C0911.1868%2C0911.0685%2C0911.3118%2C0911.3945%2C0911.4467%2C0911.4241%2C0911.0452%2C0911.5569%2C0911.3865%2C0911.1762%2C0911.5259%2C0911.0359%2C0911.4900%2C0911.5248%2C0911.5056%2C0911.3764%2C0911.5448%2C0911.3300%2C0911.3492%2C0911.4678%2C0911.2111%2C0911.1417%2C0911.0958%2C0911.0062%2C0911.2339%2C0911.1206%2C0911.4458%2C0911.2606&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The paper gives a characterisation of the chain relation of a sofic subshift.\nEvery sofic subshift $\\Sigma$ can be described by a labelled graph $G$.\nFactorising $G$ in a suitable way we obtain the graph $G/_\\approx$ that offers\ninsight into some properties of the original subshift. Using $G/_\\approx$ we\ndescribe first the chain relation in $\\Sigma$, then characterise\nchain-transitive sofic subshifts, chain-mixing sofic subshifts and finally the\nattractors of the subshift dynamic system. At the end we present\n(straightforward) algorithms deciding chain-transitivity and chain-mixing\nproperties of a sofic subshift and listing all the attractors of the subshift\nsystem."}, "authors": ["Alexandr Kazda"], "author_detail": {"name": "Alexandr Kazda"}, "author": "Alexandr Kazda", "arxiv_comment": "14 pages, 9 figures, preprint (final version published in Fundamenta\n  Informaticae)", "links": [{"href": "http://arxiv.org/abs/0911.5475v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0911.5475v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.DS", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.DS", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "37B10; 68R15", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0911.5475v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0911.5475v1", "journal_reference": "Fundamenta Informaticae. volume 84. number 3-4. pages 375-390.\n  2008", "doi": null, "fulltext": "The chain relation in sofic subshifts\n\narXiv:0911.5475v1 [math.DS] 29 Nov 2009\n\nAlexandr Kazda∗\n\nAbstract\nThe paper gives a characterisation of the chain relation of a sofic subshift. Every sofic\nsubshift Σ can be described by a labelled graph G. Factorising G in a suitable way we obtain\nthe graph G/≈ that offers insight into some properties of the original subshift. Using G/≈ we\ndescribe first the chain relation in Σ, then characterise chain-transitive sofic subshifts, chainmixing sofic subshifts and finally the attractors of the subshift dynamic system. At the end we\npresent (straightforward) algorithms deciding chain-transitivity and chain-mixing properties\nof a sofic subshift and listing all the attractors of the subshift system.\nKeywords: Sofic subshift, chain relation, chain-transitivity, chain-mixing, attractor.\n\n1\n\nIntroduction\n\nThe properties of subshifts play a key role in symbolic dynamics and in the study of various dynamical systems (for example, cellular automata). The chain relation is an important characteristic of\nsubshifts as well as of dynamical systems in general.\nThis paper addresses the question how, given a sofic subshift Σ (described by a labelled graph),\none can deduce certain properties of this subshift: what does its chain relation look like, whether\nthe subshift is chain-transitive or chain-mixing and what are the attractors of the system (Σ, σ).\nWhile the answer to this question was previously known in the special case of subshifts of finite\ntype (a subshift Σ is of finite type when x ∈ Σ iff x does not contain any factor from a given finite\nset F of forbidden words.), it could not be directly applied to the more general sofic subshifts.\nThe core idea of this paper is to factorise the graph G describing the sofic subshift Σ. By\nidentifying the pairs of vertices whose restricted follower sets have infinite intersections, we obtain\nthe linking graph of G. We can then deduce certain properties of Σ from this linking graph. We shall\nformulate an explicit description of the chain relation (Theorem 14), obtaining the characterisation\nof chain-transitive sofic subshifts as a corollary (Corollary 15). Then we focus on the attractors of\n(Σ, σ), characterising them (Theorem 19), and use the description of the chain-transitive property\nfor the explicit description of the chain-mixing property (Theorem 16). Finally, we show that we\ncan check all these properties algorithmically.\nThe properties discussed have several applications. The chain relation tells us whether we can\nget from x ∈ Σ to y ∈ Σ in a certain way. Several theorems connect this relation and the attractors\nof (Σ, σ).\nThe chain-mixing property can be used in the study of cellular automata. In [2], it is shown\nthat each subshift attractor (an attractor that is also a subshift) of a one-dimensional cellular\nautomaton must be chain-mixing. Using the algorithms from this paper, it is now possible to\nconclude that many sofic subshifts can never be attractors of cellular automata because they are\nnot chain-mixing. Unfortunately, being chain-mixing is not a sufficient condition to be an attractor\n(see examples in [2]).\n\n2\n\nPreliminaries\n\nIn this section we shall define several key terms from symbolic dynamics.\n∗ The\n\nauthor would like to thank his mentor prof. Petr Kůrka for support and valuable advice.\n\n1\n\n\fLet A be a finite alphabet. Then A∗ resp. AZ is the set of all finite resp. (two-sided) infinite\nwords consisting of letters from A. Given a (finite or infinite) word x denote by xi ∈ A the i-th\nletter of x. Note that the set A∗ contains the empty word λ.\nWe can write nonempty finite words as u = u1 u2 * * * un . Denote the length of u as |u| and define\nthe concatenation operation as uv = u1 * * * un v1 * * * vk where n is the length of u and k the length\nof v. We adopt the notation u[k,l] for the word uk uk+1 * * * ul .\nLet u, v be words (v may be finite or (one- or two-sided) infinite, u is finite) in alphabet A. We\nsay that u is a factor of v and write u ⊑ v iff there exist k, l ∈ Z such that u = v[k,l] or if u = λ.\nThe shift map is the mapping σ : AZ → AZ given by σ(x)i = xi+1 .\nThe set AZ can be understood as a metric space: For x 6= y ∈ AZ let ρ(x, y) = 2−n , where n\nis the minimal nonnegative integer such that xn 6= yn or x−n 6= y−n . If x = y, set ρ(x, y) = 0.\nThen ρ is a metric on AZ . The space AZ equipped with the topology induced by ρ is sometimes\ncalled the Cantor space. Topologically, AZ is a product of compact discrete spaces A and it is thus\ncompact.\nThe set Σ ⊆ AZ is called a subshift iff it is topologically closed and strongly invariant under σ,\nthat is, σ(Σ) = Σ.\nNotice that a subshift is a closed subspace of the compact space AZ and is thus itself compact.\nA dynamical system (X, F ) is a pair consisting of a compact metric space X and a continuous\nmap F : X → X. An example of a dynamical system is the pair (Σ, σ) where Σ ⊆ AZ is a subshift\nand σ is the shift map.\nLet Σ be a subshift. The language of Σ, denoted by L(Σ), is the set of all factors of words from\nΣ: L(Σ) = {v|∃x ∈ Σ, v ⊑ x}.\nRemark. The language L(Σ) is central (some authors use the term extendable), that is:\n• For every w ⊑ v ∈ L(Σ) we have w ∈ L(Σ).\n• For every v ∈ L(Σ) there exist nonempty words u, w such that uvw ∈ L(Σ).\nWe say that a language is regular if it can be recognised by some finite automaton (a machine\nwith finite memory). A subshift whose language is regular is called sofic.\nA labelled graph G over alphabet A is an oriented multidigraph (a graph where we allow multiple\nparallel edges and loops) whose edges are labelled with the letters from alphabet A. More precisely,\nthe labelled graph is a quintuple (V (G), E(G), s, t, l) where V (G) is the set of vertices, E(G) the\nset of edges and the mappings s, t : E(G) → V (G) and l : E(G) → A assign to each edge e its\nstarting and ending vertex and its label, respectively. Both V (G) and E(G) must be finite.\nA subgraph H of a labelled graph G = (V (G), E(G), s, t, l) (over alphabet A) is a labelled\ngraph (V (H), E(H), sH , tH , lH ) such that V (H) ⊆ V (G), E(H) ⊆ E(G) and the mappings sH , tH\nand lH are restrictions of s, t and l, respectively. The subgraph of G induced by the set U is the\nsubgraph H of G such that V (H) = U and the set E(H) contains all the edges e ∈ E(G) such\nthat s(e), t(e) ∈ V (H).\nWe call a subgraph H of G terminal if there is no edge e ∈ E(G) starting in v ∈ V (H) and\nending in u ∈ V (G) \\ V (H). Similarly, we define initial subgraph H of G as a subgraph such that\nno edge e ∈ E(G) starts in v ∈ V (G) \\ V (H) and ends in u ∈ V (H).\nA walk of length l in a graph G is any sequence v0 e1 v1 . . . el vl where vi ∈ V (G), ei ∈ E(G) are\nvertices and edges of G and the edge ei+1 leads from vi to vi+1 in G for each i = 0, 1 . . . , l − 1.\nWe allow walks of length zero (a single vertex). We also define biinfinite walks as sequences\n. . . v−2 e−1 v−1 e0 v0 e1 v1 e2 v2 . . . such that the edge ei+1 leads from vi to vi+1 in G for each i ∈ Z.\nA walk of length 0 < l < ∞ is closed if v0 = vl .\nAs any walk of nonzero length is uniquely determined by its sequence of edges, we shall often\nuse a shorthand description of walks, writing down just the edges.\nA labelled graph G is called connected iff for all u, v ∈ V (G) there exists a walk from u to v.\n(To be precise, this is the definition of a strongly connected graph. However, we do not consider\nweak connectivity in the article and so we can safely omit this adjective.) We allow walks of length\nzero, so a single vertex graph is considered connected in this paper.\n2\n\n\fA labelled graph G is periodic iff V (G) can be partitioned into n > 1 disjoint sets of vertices\nV0 , V1 , . . . , Vn−1 such that every edge e ∈ E(G) leads from some v ∈ Vk to some u ∈ Vk+1 (here\nVn = V0 ) for a suitable k. A graph is aperiodic iff it is not periodic.\nGiven a graph G, we can partition G into its maximal connected subgraphs K1 , K2 , . . . , Kn .\nThese graphs are obviously disjoint and for every vertex v ∈ G there exists i such that v ∈ V (Ki )\n(we allow single-vertex components). Call K1 , . . . , Kn the components of G.\nThe subshift of a labelled graph G is the set Σ(G) of all x ∈ AZ such that in G there exists a\nbiinfinite walk {ei }i∈Z such that l(ei ) = xi . It is easy to verify that Σ(G) is indeed a subshift of\nAZ . Call the language of Σ(G) the language of the graph G and denote it by L(G).\nA vertex v of a graph G is called stranded iff it does not have at least one outgoing and at least\none ingoing edge (a loop counts as both).\nA graph G is called essential iff it does not contain stranded vertices.\nIt is easy to see that for an essential G a (finite) word u = u1 u2 . . . uk belongs to the language\nL(G) of G iff there exists a walk e1 e2 . . . ek in G such that the edge ei is labelled by the letter ui .\nCall such a walk a presentation of v in G. Because we allow empty walks, every L(G) also contains\nthe empty word λ. It can be shown that forgetting all stranded vertices of G does not change the\nlanguage L(G), so we can safely limit ourselves to essential graphs. See [5, p. 37] for details.\nProposition 1. [4, p. 133] The central language L is a language of a sofic subshift iff it can be\nobtained as the language of some labelled graph.\nFor the sake of providing context we shall now briefly discuss transitivity and the mixing\nproperty.\nWe say that the subshift Σ is transitive, iff for every ε > 0 and every u, v ∈ Σ there exists k and\nw ∈ Σ such that ρ(u, w) < ε and ρ(v, σ k (w)) < ε. We say that Σ is mixing if for every u, v ∈ Σ\nand every ε > 0 there exists n such that for every k > n there exists w such that ρ(u, w) < ε and\nρ(v, σ k (w)) < ε.\nIt can be shown (see [5, p. 80–82, 127–129], note that the authors of [5] use the term \"irreducible\" for what we call \"transitive\") that a sofic subshift Σ is transitive iff there exists a\nconnected labelled graph whose subshift is Σ and it is mixing iff there exists a connected aperiodic\nlabelled graph whose subshift is Σ.\nThe chain-transitivity and chain-mixing properties are weaker properties than transitivity and\nmixing, respectively.\nAn ε-chain (in Σ) of length n > 0 from x0 to xn is a sequence of words x0 , x1 , . . . , xn ∈ Σ such\nthat ρ(σ(xi ), xi+1 ) < ε for all i = 1, 2, . . . , n − 1.\nLet Σ be a subshift. We say that Σ is chain-transitive iff for every words x, y ∈ Σ and every\nε > 0 there exists an ε-chain in Σ from x to y. We say that Σ is chain-mixing if for every x, y ∈ Σ\nand ε > 0 there exists k ∈ N such that for every n > k there exists an ε-chain in Σ of length n\nfrom x to y.\nLet Σ be a subshift, x, y ∈ Σ. We say that x and y (in this order) are in the chain relation,\nwriting (x, y) ∈ C if for every ε > 0 there exists an ε-chain from x to y.\nObviously, Σ is chain-transitive iff C = Σ × Σ.\nAs we have a one-to-one correspondence between subshifts and central languages, we may\ncall a language chain-transitive or chain-mixing meaning that its subshift has this property. We\ncharacterise these properties in terms of the language L(Σ).\nDefinition 2. Let L be a language, u, v ∈ L, |u| = |v| = m. The chain of length n from u\nto v in L is a word w, |w| = n + m with prefix u and suffix v (more precisely, w[1,m] = u and\nw[|w|−m+1,|w|] = v) such that if z ⊑ w, |z| ≤ m then z ∈ L.\nNote that while ε-chains can not have zero length, we do allow chains of length zero.\nProposition 3. The pair (x, y) is in C iff for every l ∈ N there exists a chain of nonzero length\nfrom x[−l,l] to y[−l,l] .\n\n3\n\n\f−l − 1\n\nl+1\n\n0\n\na0\n\nz0\n\nu\na0 a1\na0 a1 a2\n\nz1\n\n..\n.\n\nz n−1\nzn\nv\n\nFigure 1: The correspondence between ε-chains and chains.\n\nProof. Let first (x, y) lie in C, and let l ∈ N. Consider u = x[−l,l] , v = y[−l,l] , ε = 2−l−1 . There exists\ni\nan ε-chain x = z 0 , z 1 , . . . , z n = y. Now consider the letters ai = zl+1\n. As ρ(σ(z i ), z i+1 ) < 2−l−1 ,\ni+1\ni\nit must be z[−l−1,l+1] = z[−l,l+2] .\ni\nLet w = ua0 a1 . . . an−1 . Then the word w[i+1,i+2l+1] is equal to z[−l,l]\n(see Figure 1) for every\nn\ni = 0, 1, . . . , n and so all the factors of w of length 2l + 1 belong to L. Because v = z[−l,l]\n, the word\nua0 a1 . . . an−1 is a chain from u to v. Notice that the length n > 0 of the original ε-chain from x\nto y is equal to the length of the constructed chain from u to v.\nOn the other hand, let without loss of generality ε = 2−l+1 for some l and assume that there\nexists a chain of nonzero length from u = x[−l,l] to v = y[−l,l] . We shall prove that there exists an\nε-chain from x to y.\nLet w be the chain from u to v of length n > 0. Set z 0 = x, z n = y. Denote by z i , i =\n1, 2, . . . , n − 1, an arbitrary infinite extension of the word w[i+1,i+2l+1] in Σ (such an extension\ni\nexists because w[i,i+2l] ∈ L, L is central and Σ is compact) with w[i+1,i+2l+1] = z[−l,l]\n. Note that\n0 1\nx and y are extensions of u and v respectively. We want to check that x = z , z , . . . , z n = y is\ni+1\ni\nan 2−l+1 -chain: z[−l+2,l]\n= w[i+3,i+2l+1] = z[−l+1,l−1]\nand thus ρ(σ(z i ), z i+1 ) < 2−l+1 . Again note\nthat the length of the produced ε-chain is equal to the length of the chain w.\nCorollary 4. Let L = L(Σ).\n1. The subshift Σ is chain-transitive iff for every u, v ∈ L, |u| = |v| = m there exists a chain of\nnonzero length from u to v\n2. The subshift Σ is chain-mixing iff for every u, v ∈ L, |u| = |v| = m exists k ∈ N such that for\nall n > k there exists a chain of length n from u to v.\nProof. The first claim directly follows from Proposition 3. To prove the second claim it is sufficient\nto notice that the length of ε-chain and of the corresponding chain construed in the proof of\nProposition 3 is the same.\n\n3\n\nThe Linking Graph\n\nThe purpose of this section is to define the linking graph which provides useful tool for the study\nof the chain relation.\nDefinition 5. Let G be a labelled graph and v be a vertex in G. The follower set of v in G is the\nlanguage FG (v) of all finite words that have presentations in G that start at vertex v.\n4\n\n\fc\n\na\n\na\n\nd\n\ne\n\nd\n\nc\n\nb\n\na\nb\n\nd\nG\n\ne\n\nb\nb\n\nG/≈\n\nFigure 2: An example of a linking graph.\n\nIf v is a vertex of G belonging to a component K, we shall call the set FK (v) the restricted\nfollower set and denote it by F (v).\nDefinition 6. Let G be a graph and v, w ∈ V (G). We say that the vertices v, w are linked iff\n|F (v) ∩ F (w)| = ∞ (note that we consider restricted follower sets here) and write v ∼ w. Denote\nby ≈ the transitive and reflexive closure of ∼.\nLemma 7. The vertices v and w are linked iff for any positive integer n there exists a word\nz ∈ F (v) ∩ F (w), |z| = n.\nProof. First observe that if yz ∈ F (v) then y ∈ F (v) as we can simply forget the ending of the\npresentation of yz to obtain a presentation of y.\nIf now |F (v) ∩ F (w)| = ∞ then F (v) ∩ F (w) must contain arbitrarily large words as A is finite.\nFor a given n, consider y ∈ F (v)∩F (w), |y| > n. There exist z1 , z2 such that |z1 | = n and z1 z2 = y.\nThanks to the above remark we have that z1 ∈ F (v) ∩ F (w) and we are done.\nOn the other hand, if F (v) ∩ F (w) contains word z1 of length 1, z2 of length 2 and so on, then\nthere is an infinite subset {z1 , z2 , . . . } of F (v) ∩ F (w) and thus |F (v) ∩ F (w)| = ∞.\nDefinition 8. Let G be a labelled graph. The graph G/≈ , called the linking graph of G, is a\ngraph obtained from G by joining all pairs of linked vertices. More precisely: The set V (G/≈ ) is\nthe set of all equivalence classes of ≈ on V (G). An edge e (labelled by the letter a) goes from a\nvertex x to a vertex y in G/≈ iff there exist vertices u ∈ x, v ∈ y such that an edge f labelled by\na goes from u to v in G.\nIn a labelled graph, a word might have multiple presentations. Define the projection π : V (G) →\nV (G/≈ ) that assigns to every v ∈ V (G) the equivalence class of v in ≈. We want to show that, for\nv long enough, the images under π of every pair of presentations of v intersect in a nice way.\nIn the following, let c be the number of components of G.\nLemma 9. Let t be a positive integer. Let the (nonempty) graph G consist of c components and let\nk ≥ (t + 1)c2 + c. Let e1 , . . . , ek and f1 , . . . , fk be two walks in G. Then there exist two components\nMe , Mf of G and a positive integer r ≤ k − t + 1 such that ei+r ∈ Me and fi+r ∈ Mf for every\ni ∈ {0, 1, 2, . . . , t − 1}.\nProof. To prove the lemma, we shall use the pigeonhole principle. Without loss of generality,\nassume k = (t + 1)c2 + c. Since there are c components, at most c − 1 edges are spent traversing\nbetween components. Thus there exists an interval es , es+1 , . . . , es+c(t+1)−1 of the walk e1 , . . . , ek\nof length c(t + 1) that passes through only one component Me .\n\n5\n\n\ff\n\nMf\n\ne\nMe\n\nFigure 3: The two walks from Lemma 9. The thick arrows represent the interval r, r+1, . . . , r+t−1.\n\nConsider the walk fs , fs+1 , . . . , fs+c(t+1)−1 . This is a walk of length tc + c and thus, using\nthe above argument again, there exists an interval fr , fr+1 , . . . , fr+t−1 going through only one\ncomponent Mf . But then er+i ∈ E(Me ) and fr+i ∈ E(Mf ) for i = 0, 1, . . . , t − 1.\nCorollary 10. For every (nonempty) labelled graph G there exists a length l such that if w ∈ L(G)\n′\nis of length at least l and v1 e1 v2 e2 . . . e|w| v|w|+1 and v1′ e′1 v2′ e′2 . . . e′|w|v|w|+1\nare two presentations\n′\nof w in G, then there exists r such that π(vr ) = π(vr ) (recall that π is the projection from G to\nG/≈ ).\nProof. If w1 , w2 ∈ V (G) are not linked then there exists a finite mw1 ,w2 such that |FK (w1 ) ∩\nFL (w2 )| = mw1 ,w2 . Take m = 1 + max{mw1 ,w2 : w1 , w2 ∈ V (G) not linked}. It is then easy to\nsee that any two vertices u, v ∈ V (G) are linked iff the intersection of their restricted follower sets\ncontains a word of length m.\nTake l = (m + 1)c2 + c, and use Lemma 9 for the two presentations of w. We obtain that there\nexists r such that vr and vr′ both contain the word w[r,r+m−1] in their restricted follower sets. Thus\nvr and vr′ must be linked and so π(vr ) = π(vr′ ).\nThe components of G/≈ are partially ordered by the relation \"the component K can be reached\nfrom the component L\". Denote this relation by K ≥ L.\nDefinition 11. We call a sequence z0 , . . . , zn of vertices of G a generalised walk if there exist edges\n′\ne1 , e2 , . . . , en−1 ∈ E(G) such that every ei leads from zi to some zi+1\n≈ zi+1 .\nNotice that every walk in G/≈ corresponds to a generalised walk in G. Informally, a generalised\nwalk is a sequence of ordinary walks interleaved by occasional \"jumps\" to equivalent (under ≈)\nvertices. Crucial to our proof will be the following lemma describing a way to perform these\n\"jumps\".\nLemma 12. Let u ≈ u′ be vertices of a labelled graph G. Let w be a word whose presentation ends\nin u. Then there exists a word w′ whose presentation ends in u′ such that |w| = |w′ | and there\nexists a chain from w to w′ .\nProof. As u ≈ u′ , there exists a sequence of linked vertices u = v0 ∼ v1 ∼ * * * ∼ vk = u′ . Let us\nproceed by induction on k:\n1. If k = 0 then we are done, as it suffices to take w = w′ .\n6\n\n\fz\ns\nw′′\nr\n\nw′\nz\n\nt\n\nu′\n\nFigure 4: Getting from w′′ to w′ .\n\n2. Assume that the claim is true when k < n for some n. Let us have u = v0 ∼ * * * ∼ vn−1 ∼\nvn = u′ . By the induction hypothesis, there exists a chain q from w to some w′′ such that\none presentation of w′′ ends in the vertex s = vn−1 .\nIt is s ∼ u′ , so there exists z ∈ F (s) ∩ F (u′ ), |z| = |w′′ |. Because z ∈ F (u′ ), there exists a\npresentation of z beginning in u′ that does not leave the component of u′ . Call t the ending\nvertex of this presentation. There exists a walk from t back to u′ which presents some word\nr (see Figure 4). Consider now the sequence w′′ zr. It is easy to verify that this is a chain\nfrom w′′ to w′ = (w′′ zr)[|w′′ zr|−|w′′ |+1,|w′′ zr|] and that w′ has a presentation ending in u′ .\nBut then qzr is a chain from w to w′ , ending the proof.\n\nRemark. If x is an infinite word and p, q two presentations of x then the images π(p) and π(q)\nof p and q under the projection π both begin in the same component α(x) and end in the same\ncomponent ω(x) of G/≈ .\nProof. Let K, L be the components of G/≈ where π(p), π(q), respectively, end. These components\nare guaranteed to exist because G/≈ is finite; they are the maximal (under the ordering ≤) components visited by π(p) resp. π(q). There exists n such that the intervals [n, ∞) of π(p), π(q) both\nstay in K, L. But due to Corollary 10 there must exist some v ∈ p[n,∞) and v ′ ∈ q[n,∞) such that\nπ(v) = π(v ′ ) and so K = L. Similar argument holds for the beginnings of p, q.\nRemark. Let G be a nonempty labelled graph. Let H be a subgraph of G/≈ and let K = π −1 (H).\nDenote by L the subgraph of G induced by the vertices not in K (see Figure 5). Then there exists\nm such that no word of length at least m may simultaneously have a presentation in K and in L.\n\nProof. Let m be equal to the constant from Corollary 10. This Corollary tells us that if some u\nof length m had a presentation in both K and L then there would exist two vertices u ∈ K, v ∈ L\nsuch that π(u) = π(v). But the whole set π −1 (u) must lie either in K or in L, a contradiction.\nLemma 13. Let H be a terminal subgraph of G/≈ , let K, L and m be as in Remark 3. Let u be\na word of length l ≥ 2m + 1 with a presentation in K and let there lead a chain from u to some v.\nThen v[m+1,l] has a presentation in K.\nProof. Take the chain w of length n from u to v. We prove this lemma by mathematical induction\non n.\n1. For n = 0 the claim is trivial.\n7\n\n\fK\n\nL\nG\n\nFigure 5: Example of the situation in Remark 3 and Lemma 13.\nt = w[n+m+1−l,n+m]\nv[1,m]\n\nv[m+1,l]\n\nw\nu\n\nv\n\nFigure 6: Factors of w and v in detail.\n\n2. Let all lengths smaller than n satisfy the condition. Observe that w[1,n+m] is a chain from u\nto t = w[n+m+1−l,n+m] of length n + m − l < n (because l > m). Thanks to the induction\nhypothesis we know that t[m+1,l] has a presentation in K. It is v = w[n+1,n+l] and so\nv[1,m] = w[n+1,n+m] = t[l−m+1,l] has a presentation in K (here we use that l − m + 1 > m + 1).\nDenote v[1,m] by z. Because |z| = m and z has a presentation in K then z must not have a\npresentation in L. But then all presentations of z must end in some vertex of K: Any walk\nin G which enters the terminal subgraph K is not be able to leave K. (Had z a presentation\nbeginning and ending in L then the whole presentation would lie in L.)\nBecause it is v = zv[m+1,l] we see that any presentation of v must enter K after at most m\nedges. Taking any presentation of v in G then gives us a presentation of v[m+1,l] in K.\n\nNow comes the core theorem of this section that uses all the above results to describe the\nrelation C.\nTheorem 14. Let Σ be a sofic subshift, G a labelled graph, Σ = Σ(G). Let x, y ∈ Σ. Then\n(x, y) ∈ C iff ω(x) ≤ α(y) or y = σ n (x) for some n > 0.\nProof. Obviously, if y = σ n (x) for n > 0 then (x, y) ∈ C. Assume now that ω(x) ≤ α(y). Using\nProposition 3, it suffices to prove that there exists a chain from w = x[−l,l] to w′ = y[−l,l] for any\nl ∈ N.\nLet u be the ending vertex of some presentation of w and u′ be the starting vertex of some\npresentation of w′ . As ω(x) ≤ α(y), there exists a generalised walk u = z0 , z1 , . . . , zn−1 , zn = u′ in\nG. We want to take this walk and turn it into a chain. More precisely, we want to find a chain\nfrom w to some w′′ such that one presentation of w′′ ends in u′ . As w′′ w′ is a chain from w′′ to\nw′ , by composing both chains we get a chain from w to w′ of nonzero length (see Figure 7).\n8\n\n\fv\n\nu\n\nzn−1\na\n\nz′\n\nw\n\nw′\nw′′\n\nzn = u ′\n\nFigure 7: Turning a generalised walk to a chain.\ny[−l,l]\nn\n\ny[−l+n,l−n] = σ n (x)[−l+n,l−n]\n\nx[−l,l]\n\nFigure 8: Proving that ρ(σ n (x), y) < 2n−l .\n\nTo produce the chain from w to w′′ , use mathematical induction on n:\n1. If n = 0 then the existence of the chain follows directly from Lemma 12.\n2. Let the theorem hold for n − 1. An edge (labelled by some letter a) leads from zn−1 to a\nvertex z ′ ≈ zn . Using the induction hypothesis, there exists a chain from w to some word v\nwhose presentation ends in zn−1 . But then we also have the chain va from v to v ′ = v[2,|v|] a.\nThe word v ′ has a presentation that ends in z ′ and, using Lemma 12 again, we get that there\nexists a chain from v ′ to some w′′ whose presentation ends in zn = u′ .\nIn the other direction, let (x, y) ∈ C. Using Proposition 3 we get that for every l > 0 there\nexists a chain of nonzero length from x[−l,l] to y[−l,l] . Denote by nl the minimum (nonzero) length\nof such a chain. Since a chain for l can be easily obtained from a chain for k > l by forgetting the\nprefix and suffix, {nl }∞\nl=1 is a nondecreasing sequence. We shall distinguish two cases:\n1. Let the sequence be bounded and let n = max{nl |l ∈ N}. We claim that then y = σ n (x).\nIndeed, for all but finitely many values of l we have nl = n and if a chain of length n leads\nfrom x[−l,l] to y[−l,l] then ρ(σ n (x), y) < 2n−l (see Figure 8). Thus ρ(σ n (x), y) = 0 and\ny = σ n (x).\n2. Let the sequence be unbounded. We want to prove that then α(y) ≥ ω(x).\nLet p be a presentation of x in G and let h be an index such that the walk p[h,∞] belongs to\nonly one component M of G. Without loss of generality assume that h > 0.\nTake an arbitrary l > 0. As the sequence {nk }∞\nk=1 is not bounded, there exists k ≥ h+2l such\nthat nk > l + h. The chain from x[−k,k] to y[−k,k] contains as a factor the chain from x[h,h+2l]\nto y[−l,l] . Here we use that k ≥ h + 2l to ensure that x[h,h+2l] ⊑ x[−k,k] and nk > l + h to\nensure that the length of the chain is positive. See Figure 9.\nFor l sufficiently large, we can use Lemma 13 with u = x[h,h+2l] , v = y[−l,l] and H equal\nto the minimal terminal subgraph of G/≈ containing ω(x), obtaining that y[m−l,l] has a\npresentation in the graph K = π −1 (H). Because m is a constant and Σ(K) is compact we\nget that the whole word y belongs to Σ(K).\n\n9\n\n\f−k\n\nx[−k,k]\n\ny[−k,k]\n\nk\nnk\n\nx[h,h+2l]\n\nnk − h − l\n\ny[−l,l]\n\nFigure 9: The chain from x[−k,k] to y[−k,k] and the chain from x[h,h+2l] to y[−l,l] .\n\nNow it remains to observe that the graph π(K) = H is precisely the graph of all vertices\nreachable from ω(x). That means that α(y) ≥ ω(x) as one presentation of y begins in K.\n\nCorollary 15. Let L = L(G) be a central regular language, G an essential labelled graph. Then,\nL is chain-transitive iff G/≈ is connected.\nProof. Using Theorem 14, we see that if G/≈ is connected then L must be chain-transitive.\nIn the other direction, assume by contradiction that K is a terminal component of G/≈ , L is\nan initial component of G/≈ and K 6= L. The preimages π −1 (K) resp. π −1 (L) must contain at\nleast one terminal resp. initial component of G. As G is essential, there must exist x ∈ Σ(π −1 (K))\nand y ∈ Σ(π −1 (L)). Were y = σ n (x) we would get a contradiction with Remark 3 and so, using\nTheorem 14, we get K ≤ L, a contradiction. Thus K = L and G is connected.\n\n4\n\nChain-Mixing Sofic Subshifts\n\nWe have seen that (for G essential) we can translate the question of chain-transitivity to a question\nabout the structure of G/≈ . In this section we characterise the chain-mixing property using the\nstructure of G/≈ .\nTheorem 16. Let L = L(G) be a central regular language, G essential. Then, L is the language\nof a chain-mixing subshift iff G/≈ is connected and aperiodic.\nProof. First let us prove the necessity of the conditions. Let L be chain-mixing. Then L is also\nchain-transitive and, as follows from Corollary 15, G/≈ must be connected.\nLet us now assume that G/≈ is periodic with a period n > 1. Let w ∈ L(G) be a word that\nis long enough to satisfy the conditions of Corollary 10. We claim that then all ending vertices\nof all presentations of w must be projected to the same partition Vi of G/≈ . Let v1 v2 . . . v|w|\n′\nand v1′ v2′ . . . v|w|\nbe two walks presenting w. Then Corollary 10 tells us that there exists r such\n′\n′\nthat vr ≈ vr . But then π(vr ) = π(vr′ ) ∈ Vj for some j and thus π(vr+1 ), π(vr+1\n) ∈ Vj+1 and\n′\n′\nπ(vr+2 ), π(vr+2 ) ∈ Vj+2 and so on, ending with π(v|w| ), π(v|w| ) ∈ V(j+|w|−r) mod n .\nTake some w such that |w| = l + 1 where l is the constant from Corollary 10. Let z be a\nchain from w to w of length m. We claim that then n|m. This will be a contradiction to the\nchain-mixing property (via Corollary 4). Without loss of generality, let V0 contain all the end\nvertices of all presentations of w. Then z[i,i+l] and z[i+1,i+l+1] share a factor of length l and so,\ndue to the above remark, if presentations of z[i,i+l] all end in Vi then presentations of z[i+1,i+l+1]\nall end in V(i+1) mod n . But then Vm mod n = V0 and so n|m.\nIn the opposite direction, assume we have a labelled graph G such that G/≈ is connected and\naperiodic and L = L(G). We want to show that L is chain-mixing. We begin by showing that for\nany word w there exists a k such that we can find chains of any length n > k from w to w.\nTake the least common divisor d of the lengths of all chains from w to w. Notice that all closed\nwalks in G must have lengths divisible by d, otherwise we could easily produce chains from w to\nw of lengths not divisible by d (L is chain-transitive).\n10\n\n\fAssume that d > 1. Let v be the ending vertex of one presentation of w. As G/≈ is aperiodic\nand connected, there exists a generalised walk in G of some length l not divisible by d from v back\nto v. Using the same algorithm as in the first part of proof of Theorem 14, we obtain a chain from\nw to w. Each closed walk in G has length divisible by d and in the proof of Theorem 14, we have\nproduced the chain from the generalised walk by adding only words presented by closed walks.\nThis means that the length of our chain gives the same remainder when divided by d as the length\nl of the corresponding generalised walk. Thus we get a chain from w to w of length not divisible\nby d, a contradiction.\nIf d = 1 then there must exist chains from w to w of lengths l1 , l2 , . . . , lp such that the least\ncommon divisor of l1 , . . . , lp is 1.\nLemma 17. Let {l1 , . . . lp } be a set of positive integers whose greatest common divisor is 1. Then\nthere exists k such that every n > k can be written as n = r1 l1 + r2 l2 + * * * + rp lp where ri are\npositive integers or zeroes.\nProof. First notice that for some integers si it is 1 = s1 l1 + s2 l2 + * * * + sp lp because Z is a principal\nideal domain. Set m = |s1 |l1 + |s2 |l2 + * * * + |sp |lp .\nLet k = ml1 . If now n = q * l1 + t where t ∈ {0, 1, 2, . . . , l1 − 1} and q ≥ m then it is\nn\n\n=\n\nn\n\n=\n\n(q − m)l1 + ml1 + t(s1 l1 + s2 l2 + * * * + sp lp )\np\nX\n(tsi + |si |l1 )li\n(q − m)l1 +\ni=1\n\nLetting\nPp r1 = q − m + ts1 + l1 |s1 | and ri = tsi + li |si | for i = 2, 3, . . . , p we obtain ri ≥ 0 such that\nn = i=1 ri li .\nUsing Lemma 17, we see that for any n > k we can compose the chains from w to w to obtain\na chain of length n.\nHaving found chains from w to w of any length n > k we want to find chains from w to some\narbitrary z. As L is chain-transitive, there exists a chain from w to z of length k ′ . By composing\nthis chain with a suitable chain from w to w of length n > k we can obtain a chain from w to z of\nany length n′ = n + k ′ > k + k ′ . As we can do this (with different k, k ′ ) for all w, z, the language\nL must be chain-mixing.\n\n5\n\nAttractors of Sofic Subshifts\n\nIn this section we use the linking graph to characterise all the attractors of the dynamical system\n(Σ, σ) when Σ is a sofic subshift. There are several slightly different definitions of attractor. We\nshall use the following one (from [4]):\nDefinition 18. Denote by d(x, Y ) the distance of the point x ∈ X from the set Y ⊂ X in X.\nAn attractor Y of a dynamical system (X, F ) is a nonempty closed subset of X that satisfies the\nfollowing:\n1. F (Y ) = Y\n2. ∀ε > 0, ∃δ > 0, ∀x ∈ X, d(x, Y ) < δ ⇒ ∀n > 0, d(F n (x), Y ) < ε\n3. ∃δ > 0, ∀x ∈ X, d(x, Y ) < δ ⇒ lim d(F n (x), Y ) = 0.\nn→∞\n\nThere are several theorems that show the correspondence between attractors and the chain\nrelation. We use the following theorem.\nTheorem 19. [4, p. 82] Let Ω be an attractor. Then Ω is chain-invariant, i.e. ∀z ∈ Ω, (z, y) ∈\nC ⇒ y ∈ Ω.\n11\n\n\fTheorem 20. Let G be an essential labelled graph. Let H be a nonempty terminal subgraph of\nG/≈ . Then the set Ω = Σ(π −1 (H)) is an attractor of (Σ(G), σ). Moreover, all attractors of\n(Σ(G), σ) are of this type.\nProof. We shall first prove that Ω is indeed an attractor. Obviously, it is a subshift and so it is\nshift-invariant and closed. As π −1 (H) is nonempty and essential, Ω is also nonempty.\nBecause H is a terminal subgraph of G/≈ , we can utilise Remark 3 and obtain m such that if\n|v| ≥ m then v may not lie both in the language of π −1 (H) and the language of G \\ π −1 (H).\nWithout loss of generality, let ε = 2−k , k ≥ 0. Let δ = 2−m−k . If d(x, Ω) < δ then x[−m−k,−k−1]\ndoes not belong to the language of G \\ π −1 (H). Thus all presentations of x[−m−k,−k−1] end in\na vertex of π −1 (H) and x[−k,∞) has a presentation in π −1 (H). Then σ n (x)[−k,k] = x[−k+n,k+n]\nbelongs to the language L(π −1 (H)) and so d(σ n (x), Ω) < ε for all n > 0.\nSimilarly, letting δ = 2−m yields that if d(x, Ω) < δ then σ n (x)[−n,n] = x[0,2n] belongs to\nL(π −1 (H)) and so d(σ n (x), Ω) < 2−n for all n. As n tends to infinity then d(σ n (x), Ω) tends to\nzero, concluding the proof that Ω is an attractor.\nLet now Ω be an attractor of the subshift system. Let x ∈ Ω and take a presentation p of x\nin G. Let K be the component of G where p starts. Let H be the terminal subgraph of G/≈\ngenerated by π(K) (subgraph induced by all vertices that can be reached from π(K)). We claim\nthat Σ(π −1 (H)) ⊆ Ω.\nTo prove this claim, we just have to prove that there exists z ∈ Σ(K) ∩ Ω and use Theorem\n14 and the chain-invariance of attractors (Theorem 19). Then Σ(π −1 (H)) is precisely the set of\nwords of Σ that z is in the chain relation with and so Σ(π −1 (H)) ⊆ Ω.\nAs AZ is a compact space and Ω is a closed subspace of AZ , Ω is a compact set. Thus any\nsequence in Ω has an accumulation point. Because Ω is σ-invariant it contains all the words\nxn = σ −n (x), n ∈ N. This sequence has an accumulation point z ∈ Ω. For any m > 0 there exists\nk > 0 such that x(−∞,−k+m] has a presentation in K and z[−m,m] = x[−k−m,−k+m] , thus z[−m,m]\nhas a presentation in K for any m. This means that z ∈ Σ(K). But then Ω is a union of subshifts\nof the form Σ(π −1 (Hx )) where Hx are terminal subgraphs of G/≈ and x ∈ Ω. While it is not in\ngeneral true that Σ(G) ∪ Σ(H) = Σ(G ∪ H), in this special case we can use to our advantage the\nfact that allSHx are terminal and so all walks in H are contained in at least one Hx . Thus by\ntaking H = Hx we get Ω = Σ(π −1 (H)) where H is a terminal subgraph of G/≈ .\n\n6\n\nAlgorithmic checking of properties\n\nIn this section we describe the algorithms that, given an essential labelled graph G, construct the\ngraph G/≈ and check whether Σ(G) is chain-transitive or chain-mixing. As there is presently little\nneed for practical implementations of such algorithms, we provide only very broad descriptions.\nThe construction of G/≈ The proposed algorithm is quite straightforward: It first finds all\npairs of linked vertices and then joins such pairs of vertices together. We shall use the double\ndepth-first search algorithm from [1, p. 489] that finds all components of a given graph in time\nO(|V | + |E|).\nDefinition 21. Given two labelled graphs G, H we can construct their label product G ∗ H: a\ngraph with the vertex set V (G) × V (H) and edge set {(e, f ) : e ∈ E(G), f ∈ E(H), l(e) = l(f )}.\nThat is, an edge leads from (u, v) to (u′ , v ′ ) iff the edges from u to u′ and from v to v ′ exist and\nhave the same labels.\nAlgorithm 6.1. Given G construct G/≈ .\n1. Find all components C1 , . . . , Ck of G.\n2. Construct the label products Ci ∗ Cj of all pairs of components.\n\n12\n\n\f3. For each i ≤ j find all components of Ci ∗ Cj that contain an oriented cycle. Paint these\ncomponents red. Let Gij be the subgraph of Ci ∗ Cj induced by the set of vertices\nV (Gij ) = {v ∈ V (Ci ∗ Cj )|there exists a walk from v to some red component}.\n4. It is u ∼ v iff (u, v) ∈ V (Gij ) for a suitable i, j.\n5. Join together all pairs of linked vertices in G to obtain G/≈ .\nTo prove the correctness of the algorithm, it suffices to show that (u, v) ∈ V (Gij ) iff u ∼ v for\nu ∈ V (Ci ), v ∈ V (Cj ).\nProof. If u ∼ v then there exists a word w of length n = |V (G)|2 + 1 with a presentation e1 . . . en in\nCi starting in u and a presentation e′1 . . . e′n in Cj starting in v. Then (e1 , e′1 )(e2 , e′2 ) . . . (en , e′n ) is a\nwalk in Ci ∗ Cj . Because Ci ∗ Cj has at most |V (G)|2 vertices, this walk must return to an already\nvisited vertex at least once and that is only possible in a red component. Thus (u, v) ∈ V (Gij ).\nOn the other hand, if (u, v) ∈ V (Gij ) then we can find arbitrarily long walks that start at\n(u, v). Let (e1 , e′1 ) . . . (en , e′n ) be such a walk of length n. Then it is l(ei ) = l(e′i ) for all i and so\ne1 . . . en and e′1 . . . e′n are two presentations of the same word starting in u and v. We can do this\nfor any n and so u ∼ v.\nChecking for chain transitivity\ncheck whether G/≈ is connected.\n\nUsing the algorithm from [1, p. 489] again we can easily\n\nChecking the chain-mixing property We need to check that G/≈ is connected and find the\nperiod of G/≈ . This can be done in linear time using breadth-first search as described in [3].\nAttractors It suffices to write down all nonempty terminal subgraphs of G/≈ . Since the number\nof such subgraphs may in general be exponential in the number of components of G/≈ , there can\nbe no fast algorithm. A backtracking algorithm can be used here.\nComplexity of the algorithms The first three algorithms run in polynomial time. The creation\nof G/≈ demands the most time while the checks of connectivity and aperiodicity both run in time\nO(|V | + |E|).\nUnfortunately, the number of terminal subgraphs may be exponential to the size of the input\ngraph so outputting all the attractors of the shift dynamic system is in general not very practical\nfor graphs with many components.\n\n7\n\nConclusions\n\nIn this paper, we have introduced and used the notion of linking graph to better understand sofic\nsubshifts of AZ . It turns out that we can characterise the relation C and all attractors of Σ using\nthe properties of G/≈ .\nWe have proposed straightforward algorithms to decide in polynomial time (to the size of graph\nG describing Σ) whether a sofic subshift Σ is chain-mixing or chain-transitive and an algorithm\nthat, given an essential graph G, lists (generally not in polynomial time) all the attractors of\n(Σ(G), σ).\nIt is interesting that while chain-transitivity can be decided in polynomial time, deciding transitivity is co-NP hard, as was recently shown in [6]. The cause of this contrast seems to be that\nwhen deciding transitivity, we have (explicitely or implicitely) to decide wheteher for H, H ′ graphs\nit is Σ(H) ⊆ Σ(H ′ ), a hard question, while deciding chain-transitivity requies mereley that we\ndecide if Σ(H) ∩ Σ(H ′ ) 6= ∅, an easy question.\nLinking graphs have proven useful in describing the properties of Σ that depend mainly on C.\nOther properties of linking graphs might be a nice subject for further research.\n13\n\n\fReferences\n[1] H. T[homas] Cormen, E. C[harles] Leiserson, and L. R[onald] Rivest. Introduction to Algorithms. The MIT Press, Cambridge, 1999.\n[2] E[nrico] Formenti and P[etr] Kůrka. Subshift attractors of cellular automata. Nonlinearity,\n20(1):105–117, 2007.\n[3] J. P. Jarvis and D. R. Shier. Applied Mathematical Modeling: A Multidisciplinary Approach,\nchapter Graph Theoretic Analysis of Finite Markov Chains. CRC Press, Boca Raton, 1999.\n[4] P[etr] Kůrka. Topological and symbolic dynamics. Société Mathématique de France, Paris,\n2003.\n[5] D. Lind and B. Marcus. An Introduction to Symbolic Dynamics and Coding. Cambridge\nUniversity Press, Cambridge, 1995.\n[6] Piotr Oprocha. Algorithmic approach to devaney chaos in shift spaces. Fundamenta Informaticae.\n\n14\n\n\f"}