{"id": "http://arxiv.org/abs/0905.3694v1", "guidislink": true, "updated": "2009-05-22T19:02:59Z", "updated_parsed": [2009, 5, 22, 19, 2, 59, 4, 142, 0], "published": "2009-05-22T19:02:59Z", "published_parsed": [2009, 5, 22, 19, 2, 59, 4, 142, 0], "title": "Subfields of nondegenerate tame semiramified division algebras", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0905.0077%2C0905.3635%2C0905.4473%2C0905.1032%2C0905.4804%2C0905.4139%2C0905.1509%2C0905.4935%2C0905.1656%2C0905.0466%2C0905.0567%2C0905.4500%2C0905.1130%2C0905.2505%2C0905.2974%2C0905.0631%2C0905.4779%2C0905.0315%2C0905.2085%2C0905.2354%2C0905.0875%2C0905.2658%2C0905.4390%2C0905.3119%2C0905.1071%2C0905.3954%2C0905.3087%2C0905.2058%2C0905.4068%2C0905.1123%2C0905.2349%2C0905.1494%2C0905.2331%2C0905.1937%2C0905.4677%2C0905.4231%2C0905.4049%2C0905.3694%2C0905.4455%2C0905.1069%2C0905.1370%2C0905.3334%2C0905.2296%2C0905.2584%2C0905.4103%2C0905.0444%2C0905.0439%2C0905.0695%2C0905.4307%2C0905.3979%2C0905.1988%2C0905.2423%2C0905.2313%2C0905.3224%2C0905.3902%2C0905.2673%2C0905.3219%2C0905.3975%2C0905.1689%2C0905.4394%2C0905.2761%2C0905.0427%2C0905.0803%2C0905.4565%2C0905.2394%2C0905.4496%2C0905.4812%2C0905.1332%2C0905.0494%2C0905.0326%2C0905.2153%2C0905.1880%2C0905.0671%2C0905.2449%2C0905.1760%2C0905.0366%2C0905.2149%2C0905.2716%2C0905.2715%2C0905.0978%2C0905.2125%2C0905.1316%2C0905.1961%2C0905.0940%2C0905.0021%2C0905.0662%2C0905.2680%2C0905.2676%2C0905.2826%2C0905.4754%2C0905.3039%2C0905.2260%2C0905.2871%2C0905.3276%2C0905.4429%2C0905.3944%2C0905.2857%2C0905.4409%2C0905.3045%2C0905.1671%2C0905.2178&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Subfields of nondegenerate tame semiramified division algebras"}, "summary": "We show in this article that in many cases the subfields of a nondegenerate\ntame semiramified division algebra of prime power degree over a Henselian\nvalued field are inertial field extensions of the center.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0905.0077%2C0905.3635%2C0905.4473%2C0905.1032%2C0905.4804%2C0905.4139%2C0905.1509%2C0905.4935%2C0905.1656%2C0905.0466%2C0905.0567%2C0905.4500%2C0905.1130%2C0905.2505%2C0905.2974%2C0905.0631%2C0905.4779%2C0905.0315%2C0905.2085%2C0905.2354%2C0905.0875%2C0905.2658%2C0905.4390%2C0905.3119%2C0905.1071%2C0905.3954%2C0905.3087%2C0905.2058%2C0905.4068%2C0905.1123%2C0905.2349%2C0905.1494%2C0905.2331%2C0905.1937%2C0905.4677%2C0905.4231%2C0905.4049%2C0905.3694%2C0905.4455%2C0905.1069%2C0905.1370%2C0905.3334%2C0905.2296%2C0905.2584%2C0905.4103%2C0905.0444%2C0905.0439%2C0905.0695%2C0905.4307%2C0905.3979%2C0905.1988%2C0905.2423%2C0905.2313%2C0905.3224%2C0905.3902%2C0905.2673%2C0905.3219%2C0905.3975%2C0905.1689%2C0905.4394%2C0905.2761%2C0905.0427%2C0905.0803%2C0905.4565%2C0905.2394%2C0905.4496%2C0905.4812%2C0905.1332%2C0905.0494%2C0905.0326%2C0905.2153%2C0905.1880%2C0905.0671%2C0905.2449%2C0905.1760%2C0905.0366%2C0905.2149%2C0905.2716%2C0905.2715%2C0905.0978%2C0905.2125%2C0905.1316%2C0905.1961%2C0905.0940%2C0905.0021%2C0905.0662%2C0905.2680%2C0905.2676%2C0905.2826%2C0905.4754%2C0905.3039%2C0905.2260%2C0905.2871%2C0905.3276%2C0905.4429%2C0905.3944%2C0905.2857%2C0905.4409%2C0905.3045%2C0905.1671%2C0905.2178&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We show in this article that in many cases the subfields of a nondegenerate\ntame semiramified division algebra of prime power degree over a Henselian\nvalued field are inertial field extensions of the center."}, "authors": ["Karim Mounirh", "A. R. Wadsworth"], "author_detail": {"name": "A. R. Wadsworth"}, "author": "A. R. Wadsworth", "links": [{"href": "http://arxiv.org/abs/0905.3694v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0905.3694v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.RA", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.RA", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "16W60; 16K50; 16W50", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0905.3694v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0905.3694v1", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "SUBFIELDS OF NONDEGENERATE TAME SEMIRAMIFIED\nDIVISION ALGEBRAS\n\narXiv:0905.3694v1 [math.RA] 22 May 2009\n\nKARIM MOUNIRH AND A. R. WADSWORTH\n\nAbstract. We show in this article that in many cases the subfields of a nondegenerate tame semiramified division\nalgebra of prime power degree over a Henselian valued field are inertial field extensions of the center [Th. 2.3,\nTh. 2.10 and Prop. 2.13 ].\n\nIntroduction\nIn their work on abelian crossed product algebras [AS], Amitsur and Saltman defined a condition they\ncalled nondegeneracy for matrices encoding the multiplicative structure of such algebras. They used\nnondegenerate generic abelian crossed product algebras to prove the existence of noncyclic p-algebras,\nthereby settling a question that had been open since Albert's work on p-algebras in the 1930's. Saltman\nat that time also showed in [S1 ] that nondegenerate generic abelian crossed product p-algebras had\nonly one Galois group occurring for maximal subgroups Galois over the center, and he used this to\nprove the existence of noncrossed product p-algebras. Later, in [S2 , Th. 7.17] he used nondegenerate\ngeneric abelian crossed products to give examples of indecomposable division algebras of exponent p\nand degree p2 , for any odd prime p, over a field containing a primitive p-th root of unity. More recently,\nMcKinnie in [Mc1 , Def. 2.4] defined nondegeneracy for inertially split semiramified divsion algebras over\nHenselian valued fields in terms of nondegeneracy of certain matrices over the residue field; she used\nthis to study prime-to-p extensions of generic crossed product p-algebras. In [Mc2 ] she further proved\nthe indecomposability of nondegenerate inertially split semiramified p-algebras over Henselian fields of\ncharacteristic p. Independently of McKinnie's work, the first author defined in [M2 ] nondegeneracy\nin the somewhat more general context of inertially split division algebras over Henselian fields; in\nthe semiramified case considered in [Mc2 ] this definition agrees with McKinnie's definition, and also\nthat of Amitsur and Saltman. He proved in particular in [M2 , Th. 3.5] that in all characteristics a\nnondegenerate inertially split semiramified division algebra of prime power degree over a Henselian\nvalued field is indecomposable.\nThe various formulations of nondegeneracy will be reviewed at the beginning of §2 below.\nIn all the work just described, the nondegeneracy condition for the algebras was crucial in obtaining\nconstraints on the possible subfields of the algebras which are normal over the center. Thus, it seems\nworthwhile to investigate more closely the possible subfields of a nondegenerate division algebra, particularly the normal subfields. We do this here in the Henselian setting, i.e., where E is a field with a\nHenselian valuation v, and D is a division algebra of prime power degree over E; v extends uniquely to a\nvaluation w on D, and it is assumed that D is inertially split and semiramified over E with respect to w.\n(The valuation-theoretic terminology used here will be recalled later in this Introduction.) There is then\na unique up to isomorphism maximal subfield N of D which is inertial ( = unramified) over E, and N is\nabelian Galois over E. The inertial field extensions of E in D are fully classified up to isomorphism as\n2000 Mathematics Subject Classification. 16W60, 16K50, 16W50.\nKey words and phrases. (Graded) Brauer group, Valued division algebras, Henselization, Graded division algebras.\n1\n\n\f2\n\nKARIM MOUNIRH AND A. R. WADSWORTH\n\nthe subfields of N , and they are all abelian Galois over E. The question is thus what other subfields\nof D may exist. This will be studied in §2 below.\nWhenever there is a valuation v on a division algebra D, the filtration of D induced by v yields\nan associated graded ring GD in which every nonzero homogeneous element is a unit-this is called a\ngraded division ring. When the valuation on the center Z(D) is Henselian, the structure of the graded\nring closely mimics that of D. Likewise, algebraic field extensions of a Henselian valued field correspond\nto graded field extensions of the associated graded field. In §1 we will prove some properties for algebraic\nextensions of valued and graded fields, which have some interest in their own right and are needed for §2.\nWe show in Th. 1.5 that if (E, v) is a valued field and (M, w) is a normal finite-dimensional valued field\nextension of (E, v), then the associated graded field GM is a normal graded field extension of GE. We\ngive in Th. 1.9 an extension of Hensel's Lemma for polynomials over a valued field all of whose roots\nhave the same value. We prove also in Prop. 1.12 that if E is a Henselian valued field with residue\ncharacteristic p > 0 and L is a purely wild (resp., simple purely wild) finite-dimensional graded field\nextension of GE, then there is a defectless field extension (resp., a defectless simple field extension) K\nof E such that GK = L. Moreover, if char(E) = p, then K can be a purely inseparable field extension\nof E. We give in Cor. 1.13 a new (and more explicit) proof of [HW1 , Th. 5.2] which for an arbitrary\nHenselian valued field E establishes a one-to-one correspondence between the set of isomorphism classes\nof finite-dimensional tame field extensions of E and the set of isomorphism classes of finite-dimensional\ntame graded field extensions of GE. We prove also in the last part of §1 some results concerning cyclic\ngraded field extensions.\nIn §2 we consider subfields of nondegenerate algebras. Let E be a field with a Henselian valuation v,\nwith residue field E and value group ΓE . Let D be a nondegenerate inertially split semiramified division\nalgebra with center E, of degree pn for some prime p. We show in Th. 2.3 that if char(E) = p and\nΓD /ΓE is not cyclic, then any subfield of D normal over E is an abelian Galois inertial extension of E,\nand that all maximal subfields of D Galois over E have the same Galois group. We prove also in\nProp. 2.6 that for E of any residue characteristic and ΓD /ΓE noncyclic, D is an elementary abelian\ncrossed product if and only if Gal(D/E) is elementary abelian. Further, we prove in Prop. 2.8 that\nif rk(ΓD /ΓE ) ≥ 3, then all subfields of D abelian Galois over E are inertial over E. We show also\nthat if rk(ΓD /ΓE ) is arbitrary but exp(ΓD /ΓE ) = p, then any non-maximal subfield of D is inertial\nover E. In this case, we show in Th. 2.10 that if ΓD /ΓE is noncyclic and K is a maximal subfield of D\nwhich is normal over E with Galois group not the quaternion group, then either K is cyclic Galois\nover E with [K : E] = p2 or K is inertial over E. More results concerning subfields in the case where\nchar(E) ∤ deg(D) are proved at the end of §2.\nWe now recall some basic terminology from the theory of valued and graded division algebras which\nwill be used throughout the paper.\nLet E be a field, D a finite-dimensional division algebra over E, and Γ a totally ordered abelian group.\nLet ∞ be an element of a set strictly containing Γ with ∞ ∈\n/ Γ; extend the order on Γ to Γ ∪ {∞} by\nsetting γ < ∞ for all γ ∈ Γ, and define γ + ∞ = ∞ + ∞ = ∞. A map v : D → Γ ∪ {∞} is called a\nvaluation on D if it satisfies the following conditions (for all c, d ∈ D):\n(1) v(c) = ∞ if and only if c = 0;\n(2) v(cd) = v(c) + v(d);\n(3) v(c + d) ≥ min{v(c), v(d)}.\nWe will say that (D, v) is a valued division algebra over E. The value group of v on D is ΓD = v(D ∗ ),\nwhere D ∗ = D \\ {0}, the group of multiplicative units of D. The residue division algebra is\n\u000e\n\u000e\nD = VD MD = {d ∈ D | v(d) ≥ 0} {d ∈ D | v(d) > 0}.\n\n\fSUBFIELDS OF NONDEGENERATE TAME SEMIRAMIFIED DIVISION ALGEBRAS\n\n3\n\nOf course, v restricts to a valuation on E; we write |ΓD : ΓE | for the ramification index of D over E,\nwhich is the index in ΓD of its subgroup ΓE . Also, we identify the residue field E with its canonical\nimage in D, and write [D : E] for the residue degree of D over E, which is the dimension of D as an\nE-vector space. For background on valued division algebras, the reader can consult [JW] or [W].\nRecall the Fundamental Inequality:\n[D : E] |ΓD : ΓE | ≤ [D : E] < ∞.\nD is said to be defectless over E if [D : E] = [D : E] |ΓD : ΓE |. We say D inertial (or unramified) over E\nif [D : E] = [D : E] and the center Z(D) is separable over E. At the other extreme, D is totally ramified\nover E if [D : E] = |ΓD : ΓE |. Now assume E = Z(D). Then, D is inertially split if it has a maximal\nsubfield which is inertial over E. Also, D is said to be semiramified if it is defectless over E, D is a\nfield, and [D : E] = |ΓD : ΓE |. It is called nicely semiramified if it is inertially split and it has a totally\nramified of radical type maximal subfield, i.e., a maximal subfield K totally ramified over E such that\nL\n1/n\n1/n\n1/n\n1/n\nK = E[t1 1 , ..., tr r ], where t1 , ..., tr ∈ E ∗ , ΓK /ΓE = ri=1 hv(ti i ) + ΓE i and ord(v(ti i ) + ΓE ) = ni .\nFor a ∈ VD , we write a for the image of a in D = VD /MD . There is a well-defined canonical group\nhomomorphism θD mapping ΓD /ΓE to the Galois group Gal(Z(D)/E), given by θD (γ +ΓE ) : a 7→ dad−1\nfor all a ∈ VD with a ∈ Z(D), where d is an arbitrary element of D ∗ with v(d) = γ. By [JW, Prop. 1.7,\nLemma 5.1], Z(D) is normal over E and θD is surjective; moreover, if D is inertially split, then Z(D)\nis Galois over E and θD is an isomorphism. If the valuation on E is Henselian, we say that D is tame\nif D is defectless over E, Z(D) is separable over E, and char(E) ∤ | ker(θD )|. Equivalently (see [HW2 ,\nProp. 4.3]), D is tame iff it is split by the maximal tamely ramified field extension of E.\nWe will be working with graded division rings and fields as well as valued ones. We recall some of\nthe terminology and basic facts in the graded setting, and the connections between the valued setting\nand the graded setting.\nLet F be an associative ring (with 1) and let Γ be a totally ordered abelian group. We say that F is\nL\na graded ring of type Γ if there are additive subgroups Fγ (γ ∈ Γ) of F such that F = γ∈Γ Fγ and\nFγ Fδ ⊆ Fγ+δ , for all γ, δ ∈ Γ. In this case, the set ΓF = {γ ∈ Γ | Fγ 6= 0} is called the support of F .\nIf F is a graded ring of type Γ and x ∈ Fγ for some γ ∈ ΓF , we say that x is a homogeneous element\nof F ; if x 6= 0, we say that x has grade γ and we write gr(x) = γ.\nA graded ring F (of type Γ) which is commutative and for which all nonzero homogeneous elements\nare invertible is called a graded field. Note that, because of the total ordering on Γ, in a graded field\nF every element of the group F ∗ of multiplicative units must be homogeneous; so F ∗ coincides with\nthe set of nonzero homogeneous elements of F . Furthermore, the total ordering on Γ implies that F is\nL\nan integral domain. It is easy to see also that if M is a graded F -module (i.e., M = γ∈Γ Mγ with\nFγ Mδ ⊆ Mγ+δ for all γ, δ ∈ Γ) then M is a free F -module with a homogeneous base, and any two such\nbases have the same cardinality. We therefore write dimF (M ) for the rank of M as free F -module.\nLet F be a commutative graded ring of type Γ. An algebra A over F is called a graded algebra (of\ntype Γ) over F if A is a graded ring of type Γ and Fγ ⊆ Aγ , for all γ ∈ Γ. If F and A are graded\nfields, we call A a graded field extension of F . If F is a graded field, then a graded algebra over F in\nwhich every nonzero homogeneous elementis a unit is called a graded division algebra over F . If F is\nthe center of a graded division algebra A, then A is called a graded central division algebra over F . We\nwrite [A : F ] for dimF (A). For a graded division algebras A, the support set ΓA is a subgroup of Γ,\nand A0 is a division ring which is an algebra over F0 . Furthermore, it is easy to prove the Fundamental\nEquality:\n[A : F ] = [A0 : F0 ] |ΓA : ΓF |.\n\n\f4\n\nKARIM MOUNIRH AND A. R. WADSWORTH\n\nLet F be a graded field, let q(F ) be its quotient field, and let q(F )alg an algebraic closure of q(F ).\nClearly, for any element λ of the divisible hull ∆F of ΓF (i.e., ∆F = ΓF ⊗Z Q ), there is a unique grading\nof type ∆F on the polynomial ring F [X] extending the grading of F and for which X is a homogeneous\nelement with gr(X) = λ. We denote F [X] with this grading by F [X](λ) . A polynomial f ∈ F [X] is\ncalled λ-homogenizable if f is homogeneous in F [X](λ) . Let x ∈ q(F )alg and let fx,q(F ) denote its minimal\npolynomial over q(F ). We say that x is gr-algebraic over F if fx,q(F ) is a homogenizable polynomial of\nF [X]. It is shown in [HW1 , Prop. 2.2] that x is gr-algebraic over F if and only if the ring F [x] is a graded\nfield extension of F and x is homogeneous in F [x]. If K is a graded field extension of F , we say that K is\ngr-algebraic over F if every homogeneous element of K is gr-algebraic over F . This holds, in particular,\nwhenever [K : F ] < ∞, by [HW1 , Prop. 2.2]. Let Fgr-alg = F [{x ∈ q(F )alg | x is gr-algebraic over F }],\nthen as proved in [HW1 , Cor. 2.7(c)], Fgr-alg is a gr-algebraic graded field extension of F which contains\nevery other gr-algebraic graded field extension of F in q(F )alg . We call Fgr-alg 'the' graded algebraic\nclosure of F .\nLet K be a graded field extension of a graded field F with [K : F ] < ∞. In analogy with the valuation\nterminology, K is said to be totally ramified over F if [K : F ] = |ΓK : ΓF |. We say K is inertial over F\nif [K : F ] = [K0 : F0 ] and K0 is separable over F0 . Also, K is tame over F if K0 is separable over F0\nand ΓK /ΓF has no p-torsion if char(F ) = p 6= 0. Further, K is purely wild over F if char(F ) = p 6= 0,\nK0 is purely inseparable over F0 , and ΓK /ΓF is a p-group. By [HW1 , Lemma 3.6] K/F is purely wild\nif and only if q(K)/q(F ) is purely inseparable. If A is a graded central division algebra over F , we say\nthat A is semiramified if A0 is a field and [A0 : F0 ] = |ΓA : ΓF |; A is nicely semiramified if A has a\nmaximal subfield inertial over F and another which is totally ramified over F .\nIf F is a graded field and A is a graded division algebra of type Γ finite-dimensional over F , we denote\nby q(A) the algebra of central quotients of A. So, q(A) ∼\n= A ⊗F q(F ), which is a division ring over q(F )\nwith [q(A) : q(F )] = [A : F ] < ∞. The graded structure on A and the total ordering on Γ induce a\nP\ncanonical valuation v on q(A) as follows (see [B3 , §4] or [HW2 , §4]): For nonzero a = γ∈Γ aγ ∈ A\n(with each aγ ∈ Aγ ) set v(a) to be the least γ for which aγ 6= 0. Then for nonzero a ∈ A, b ∈ F ,\ndefine v(ab−1 ) = v(a) − v(b). It is easy to check that v is well-defined and is a valuation on q(A) with\nΓq(A) = ΓA and q(A) ∼\n= A0 . Note that this canonical valuation depends not only on Γ as a group,\nbut also on the choice of ordering on Γ. Let Hq(F ) denote the Henselization of q(F ) with respect to\nits canonical valuation (see [EP, §5.2] or [E, §16]), and set Hq(A) = q(A) ⊗q(F ) Hq(F ). If F = Z(A)\n(so q(F ) = Z(q(A)), it is known by Morandi's Henselization theorem [Mor, Th. 2] that Hq(A) is a\ndivision algebra over Hq(F ). The Henselian valuation on Hq(F ) has a unique extension to a valuation\non Hq(A), and it is known that Hq(D) is a tame central division algebra over Hq(F ) (see [B2 , Cor. 4.4]\nor [HW2 , Th. 5.1]).\nGoing in the other direction, suppose we start with a field E with a valuation v. Then, the filtration\nof E induced by v yields a canonical graded field GE. Namely, for γ ∈ Γ let E γ = {x ∈ E | v(x) ≥ γ}\nand E >γ = {x ∈ E | v(x) > γ}. Obviously, E >γ is a subgroup of the additive group E γ . So, we can\ndefine the factor group GEγ = E γ /E >γ . For x ∈ E\\{0}, we denote by x\ne the element x + E >v(x) of\nL\nGEv(x) ; for 0 ∈ E, set e\n0 = 0 in GE. One can easily see that the additive group GE = γ∈Γ GEγ with\nthe multiplication law defined for homogeneous elements by x\neye = x\nfy, is a graded field. Similarly, if D\nis a valued division algebra finite dimensional over a field E, then the analogous filtration of D yields\nL\na graded division algebra GD = γ∈Γ GDγ where GDγ = D γ /D >γ (see [B3 , §4] or [HW2 , §4]). Note\nthat GD0 = D and ΓGD = ΓD . It is easy to see that if F is a graded field and D is a graded central\ndivision algebra over F , then D is canonically isomorphic as a graded ring to Gq(D), the associated\nP\nP\ngraded ring of the valued division algebra q(D), via the mapping x = γ∈Γ xγ 7→ γ∈Γ x\nfγ . Likewise,\nD∼\n= GHq(D), the associated graded ring of Hq(D).\n\n\fSec. 1: Graded and valued field extensions\n\n5\n\nIt is known that graded central division algebras over a graded field F play an analogous role to\ncentral division algebras over a Henselian valued field. Indeed, their equivalence classes form a graded\nBrauer group GBr(F ), and there is a group isomorphism GBr(F ) → TBr(Hq(F )), where TBr(Hq(F ))\nis the tame part of the Brauer group Br(Hq(F )) [HW2 , Th. 5.1]. Conversely, for any Henselian valued\nfield E, there is a canonical group isomorphism TBr(E) → GBr(GE) [HW2 , Th. 5.3].\n\n1. Graded and valued field extensions\nLemma 1.1. Let F be a graded field, take any λ in the divisible hull of ΓF , and let f be a nonzero\nλ-homogenizable polynomial in F [X]. Then,\n(1) If h ∈ F [X] and h | f , then h is λ-homogenizable.\n(2) For g ∈ F [X], f | g in F [X] if and only if f | g in q(F )[X].\n(3) f is irreducible in F [X] if and only if f is irreducible in q(F )[X]. When this occurs, f is a prime\nelement of F [X].\nThus, unique factorization holds for λ-homogenizable polynomials in F [X].\nProof. (1) This holds because ΓF [X](λ) is totally ordered. Therefore, for nonzero h, k in F [X], the lowest\n[resp. highest] grade homogeneous component of hk is the product of the lowest [resp. highest] grade\ncomponents of h and k. So, if hk is homogeneous, then h and k must also be homogeneous.\nP\n(2) Write f = ni=0 ai X i . Since f is λ-homogenizable, each nonzero ai is homogeneous in F , so lies\nin F ∗ . (2) thus follows by the division algorithm for polynomials, since the leading coefficient of f is a\nunit.\n(3) Since the leading coefficient of f lies in F ∗ , we may assume that f is monic. Because the integral\ndomain F is integrally closed by [HW1 , Cor. 1.3], if f is irreducible in F [X], then f is irreducible in\nq(F )[X]. Conversely, if f is irreducible in q(F )[X], then f F [X] is a prime ideal of F [X], since (2) shows\nthat f F [X] = (f q(F )[X]) ∩ F [X]. Hence f is a prime element of F [X], so it is irreducible in F [X].\nSince nonzero constant λ-homogenizable polynomials are units of F [X], it follows by induction on\ndegree and by (1) and (3) above that every λ-homogenizable polynomial of positive degree is a product\nof prime λ-homogenizable polynomials. The usual argument gives the uniqueness of such a factorization.\n\u0003\nLet F be a graded field and let L be an algebraic graded field extension of F . Then, we say that L is\nnormal over F if every homogenizable irreducible polynomial g of F [X] which has a root in L factors\ninto polynomials of degree one in L[X]. When this occurs, each root x of such a g is homogeneous in L,\nsince X − x is homogenizable in L[X] by Lemma 1.1(1). Moreover, the minimal polynomial fx,q(F ) of x\nover q(F ) lies in F [X] (as L is integral over F , which is integrally closed), and fx,q(F ) is λ-homogenizable,\nwhere λ = gr(x). So by Lemma 1.1, g = afx,q(F ) for some a ∈ F ∗ . Thus, L is normal over F if and only\nif for any x ∈ L∗ , fx,q(F ) factors into polynomials of degree one in L[X].\nLemma 1.2. Let L/F be an algebraic graded field extension. Then, L is normal over F if and only if\nq(L) is a normal field extension of q(F ).\nProof. Suppose that L is normal over F and consider a q(F )-monomorphism σ from q(L) into q(L)alg , the\nalgebraic closure of q(L). Let x ∈ L∗ and let fx,q(F ) be its minimal polynomial over q(F ). Obviously,\nwe have fx,q(F )(σ(x)) = 0. It follows by the normality of L/F that σ(x) ∈ L. Note that we have\nq(L) = L * q(F ), so σ(q(L)) = q(L). Therefore, q(L) is a normal field extension of q(F ).\n\n\f6\n\nKARIM MOUNIRH AND A. R. WADSWORTH\n\nConversely, suppose that q(L) is a normal field extension of q(F ) and let g be a homogenizable\nirreducible polynomial of F [X] with a root in L. By Lemma 1.1(3) g remains irreducible over q(F ), so\nby the normality g splits over q(L). Clearly, the roots of g are integral over F , so they all lie in L as\nL is integrally closed.\n\u0003\nProposition 1.3. Let L/F be a finite-dimensional graded field extension. Then, the following are\nequivalent:\n(1) L/F is tame and normal.\n(2) L is a Galois graded field extension of F .\nProof. This follows by [HW1 , Th. 3.11(a),(b), Lemma 1.2].\n\n\u0003\n\nLet L/F be a normal finite-dimensional graded field extension. The Galois group of L over F is the\ngroup Gal(L/F ) consisting of graded (i.e., grade-preserving) F -isomorphisms of L. Let G = Gal(L/F )\nand let LG denote the set of elments of L invariant under the action of G; so, LG is a graded subfield\nof L. It was proved in [B5 , p. 26] that L is tame over LG . The following proposition gives a more general\nresult.\nProposition 1.4. Let L/F be a finite-dimensional normal graded field extension with Galois group G.\nThen, LG is purely wild over F and L is Galois over LG . Moreover, if T is the tame closure of F in L,\nthen L = T * LG ∼\n=g T ⊗F LG .\nProof. Since L/F is normal , by Lemma 1.2 q(L)/q(F ) is a normal field extension. By [HW1 , Cor. 2.5(d)],\nevery σ ∈ Gal(q(L)/q(F )) restricts to a graded GF -automorphism of GL. Furthermore, the map\nGal(q(L)/q(F )) → Gal(L/F ) = G by restriction is an isomorphism as q(L) = L ⊗F q(F ). Therefore, we\nidentify Gal(q(L)/q(F )) with G. Recall from field theory (see, e.g., [K, Prop. 3.2, p. 316]) that the normality of q(L) over q(F ), implies q(L) is Galois over q(L)G , which is purely inseparable over q(F ). Moreover, if S is the separable closure of q(F ) in q(L), then q(L) = S * q(L)G ∼\n= S ⊗q(F ) q(L)G . Now, since\n−1\nevery x in q(L) is expressible as ab with a ∈ L and b ∈ F \\ {0}, we have q(L)G = LG * q(F ) = q(LG ).\nHence, L is Galois over LG by [HW1 , Th. 3.11(b)] as q(L) is Galois over q(LG ), and LG is purely wild\nover F by [HW1 , Lemma 3.6] as q(LG ) is purely inseparable over q(F ). By [HW1 , (3.8)], q(T ) = S. Because T ⊗F LG is a torsion-free F -module, it injects into (T ⊗F LG ) ⊗F q(F ) ∼\n= q(T ) ⊗q(F ) q(LG ) ∼\n= q(L).\n′\nG\nG\nLet L = T *L , which is the image of T ⊗F L under its injective mapping to q(L). Then, L′ is a graded\nsubfield of L, and the isomorphism T ⊗F LG → L′ respects the gradings. Also, [L : L′ ] = [q(L) : q(L′ )] = 1,\nas q(L′ ) = q(T ) * q(LG ) = q(L). Thus, L = L′ = T * LG ∼\n\u0003\n=g T ⊗F LG .\nTheorem 1.5. Let (E, v) be a valued field and (M, w) a finite-dimensional valued field extension of\n(E, v). If M is normal over E, then GM is normal over GE.\nProof. Assume first that w is the unique valuation of M extending v on E. Let x ∈ M and let fx,E be\nQ\nits minimal polynomial over E. Since M is normal over E, we can write fx,E = ni=1 (X − xi ), where\nxi = σi (x) for some σi ∈ Gal(M/E). Moreover, since w is the unique extension of v to M , w(xi ) = w(x)\nQ\nfor 1 ≤ i ≤ n. Therefore, the polynomial ni=1 (X − xei ) lies in GE[X], by [B4 , Lemma 2.1, Lemma 2.4]\n(or by Lemma 1.8 below, which shows that h = f (λ) ∈ GE[X]). Hence, the minimal polynomial fxe,q(GE)\nof x\ne over q(GE) splits into polynomials of degree one in GM [X], showing that GM is normal over GE.\n\nNow, without assuming that w is the unique extension of v to M , let I = M Gal(M/E) and let K be\nthe decomposition field of w over I. Since M is normal over K and w is the unique extension of\nits restriction w|K to M , by the first part of the proof GM is normal over GK. So by Lemma 1.2,\nq(GM ) is normal over q(GK). Moreover, since (K, w|K ) is an immediate field extension of (I, w|I ) by\n\n\fSec. 1: Graded and valued field extensions\n\n7\n\n[EP, Cor. 5.3.8(0), pp. 134–135], we have GK = GI. Note that because I is purely inseparable over E,\nwe have GI is purely wild over GE, so q(GI) is purely inseparable over q(GE). Therefore, q(GM ) is\nnormal over q(GE), so again by Lemma 1.2, GM is normal over GE.\n\u0003\nIn what follows we will consider polynomials over a valued field (E, v) for which all the roots in an\nalgebraic closure Ealg of E have the same value for any valuation that extends v to Ealg . The following\nproposition generalizes [B4 , Lemma 2.1], which gives (1) ⇔ (3) under the additional assumptions that\nv is Henselian and f is monic.\nP\nProposition 1.6. Let (E, v) be a valued\u0001field, Ealg an algebraic closure of E, and let f = ni=0 ai X i ∈ E[X]\nwith a0 an 6= 0. Let λ = n1 v(a0 ) − v(an ) in the divisible hull of ΓE . Then, the following statements are\nequivalent:\n(1)\n(2)\n(3)\n(4)\n\nFor some extension of v to Ealg , all the roots of f in Ealg have the same value.\nFor every extension of v to Ealg , all the roots of f in Ealg have value λ.\nv(ai ) ≥ (n − i)λ + v(an ) for every i, 0 ≤ i ≤ n.\nLet w be an extension of v to Ealg , c ∈ Ealg with w(c) = λ, and let h = an1cn f (cX). Then h is a\nmonic polynomial of Valg [X], where Valg is the valuation ring of w.\n\nProof. (2) ⇒ (1) is clear.\n(1) ⇒ (3) Let f = an (X − x1 ) . . . (X − xn ) in Ealg [X], and let sj be the j-th symmetric polynomial in\nx1 , . . . , xn for 1 ≤ j ≤ n. Suppose the xi all have the same value for some extension w of v to Ealg . Then\nw(xi ) = λ for all i, as a0 = (−1)n an x1 . . . xn . Since sj is a sum of products of j of the xi , w(sj ) ≥ jλ.\nFor 0 ≤ i ≤ n − 1 we have ai = (−1)n−i sn−i an ; hence, v(ai ) = w(sn−i ) + v(an ) ≥ (n − i)λ + v(an ).\nP\n(3) ⇒ (2) Let w be an extension of v to Ealg , and let x be any root of f in Ealg . Since ni=0 ai xi = 0,\nin the list of values w(a0 ), w(a1 x), . . . , w(an xn ) the least value must occur at least twice. If w(x) > λ,\nthen (3) yields for i > 0,\nw(ai xi ) > v(ai ) + iλ ≥ (n − i)λ + v(an ) + iλ = nλ + v(an ) = v(a0 ).\nThis is not possible, since then the least value on the list would be w(a0 ), occurring only once. Similarly,\nif w(x) < λ, then for i < n,\nw(an xn ) = v(an ) + i w(x) + (n − i)w(x)\n< v(an ) + i w(x) + (n − i)λ ≤ v(ai ) + i w(x) = w(ai xi ).\nThis is also ruled out, since the least value on the list would be then w(an xn ), occurring only once.\nTherefore, w(x) = λ for any root x of f .\nP\ni−n . Then,\n(3) ⇔ (4) Clearly, h is a monic polynomial. Write h = ni=0 bi X i , where bi = ai a−1\nn c\nw(bi ) = v(ai ) − v(an ) + (i − n)λ. Hence, w(bi ) ≥ 0 if and only if v(ai ) ≥ (n − i)λ + v(an ).\n\u0003\nPn\nDefinition 1.7. If f = i=0 ai xi ∈ E[X] satisfies\nthe equivalent conditions of Prop. 1.6, then we call\n\u0001\n1\nf a λ-polynomial, where λ = n v(a0 ) − v(an ) is the common value of all the roots of f . We then write\nP\n(λ)\n(λ)\n(λ)\nfe(λ) := n a X i ∈ GE[X], where a is the class of ai in GE(n−i)λ+v(a ) . Observe that a = e\nai\ni=0\n\ni\n\ni\n\nn\n\ni\n\n(λ)\nif v(ai ) = (n − i)λ + v(an ) and ai = 0 if v(ai ) > (n − i)λ + v(an ). Thus, fe(λ) is a λ-homogenizable\npolynomial in GE[X] with gr(fe(λ) ) = v(a0 ) and deg(fe(λ) ) = deg(f ).\nP\nLemma 1.8. Let (E, v) be a valued field, and let f = ni=0 ai X i be a λ-polynomial in E[X]. Let K be\nan algebraic field extension of E over which f splits, say f = an (X − x1 ) . . . (X − xn ) in K[X], and let\nw be any extension of v to K. Then, fe(λ) = e\nan (X − x\ne1 ) . . . (X − x\nen ) in GK[X].\n\n\f8\n\nKARIM MOUNIRH AND A. R. WADSWORTH\n\nP\nQ\nProof. We have f = ni=0 ai X i = an ni=1 (X − xi ). Let s0 = 1 and for 1 ≤ k ≤ n let sk be the k-th\nQ\nsymmetric polynomial in x1 , . . . , xn . So, ai = an (−1)n−i sn−i for 0 ≤ i ≤ n. Let g = e\nan ni=0 (X − x\nei ) =\nPn\ni in GK[X]. Let t = e\nb\nX\n1\nand\nlet\nt\nbe\nthe\nk-th\nsymmetric\npolynomial\nin\nx\ne\n,\n.\n.\n.\n,\nx\ne\nfor\n1\n≤\nk\n≤ n.\n0\n1\nn\nk\ni=0 i\nn−i\nf\nSo, each bi = e\nan (−1) tn−i . Now, each sk is a sum of monomials of degree k in the xi (so of value kλ).\nHence, w(sk ) ≥ kλ. We have (xj1 . . . xjk )e = x\nej1 . . . x\nejk for all indices j1 , . . . , jk . When w(sk ) = kλ,\nsek is the sum of the images of its monomials in GK, i.e, sek = tk 6= 0 in GKkλ . When w(sk ) > kλ,\nP\n(λ)\n(λ)\nthe sum of its images in GKkλ is 0, i.e., tk = 0. Now consider fe(λ) = ni=0 ai X i . If ai 6= 0, then\nv(ai ) = (n − i)λ + v(an ), so v(sn−i ) = (n − i)λ, and hence,\n\u0001\n(λ)\nf n−i sen−i = e\nf n−i tn−i = bi .\nan (−1)\nan (−1)\nai = e\nai = an (−1)n−i sn−i e = e\n(λ)\n\nOn the other hand, if ai = 0, then v(ai ) > (n − i)λ + v(an ), yielding v(sn−i ) > (n − i)λ, so tn−i = 0;\nf n−i tn−i = 0 = a(λ) . Thus, fe(λ) = g.\n\u0003\nhence, bi = e\nan (−1)\ni\nLet (E, v) be a Henselian valued field. The next theorem generalizes to arbitrary λ-polynomials\nP\nover E well-known basic properties for 0-polynomials, which are those f = ni=1 ai X i in VE [X] with\nv(an ) = v(a0 ) = 0 (cf. [EP, Th. 4.1.3, pp. 87–88]).\nPn\ni\nTheorem 1.9. Let (E, v) be a Henselian valued field, f =\ni=0 ai X a polynomial of E[X] with\nP\nn\n′\ni\na0 an 6= 0 and let f = i=0 e\nai X ∈ GE[X]. Then,\n\n(1) If f is a λ-polynomial and f = gh in E[X], then g and h are λ-polynomials and fe(λ) = ge(λ) e\nh(λ)\nin GE[X]. So, if fe(λ) is irreducible in GE[X], then f is irreducible in E[X].\n(2) If f is irreducible in E[X], then f is a λ-polynomial for λ = n1 (v(a0 ) − v(an )). Furthermore,\nfe(λ) = e\nan ks for some irreducible monic homogeneous polynomial k of GE[X](λ) and some positive\ninteger s.\n(3) If f is a λ-polynomial in E[X] and if fe(λ) = lm in GE[X] with gcd(l, m) = 1, then there exist\nλ-polynomials g, h in E[X] such that f = gh, e\ng (λ) = l, and e\nh(λ) = m.\n(4) If f is a λ-polynomial and fe(λ) has a simple root b in GE, then f has a simple root a in E with\ne\na = b.\n(5) Suppose f ′ is a λ-homogenizable polynomial of GE[X]. Then, f is a λ-polynomial and fe(λ) = f ′ .\n\nProof. (1) If x is any root of g or of h in Ealg , then x is also a root of f , so x has value λ. Thus, g and h\nare λ-polynomials. Let K be any algebraic extension of E over which f splits (so g and h split), and\nQ\nQ\nlet w be any extension of v to K. In K[X] write g = b ri=1 (X − xi ) and h = c ni=r+1 (X − xi ). Then\ne = ebe\nthe leading coefficient of f is bc, and bc\nc in GE. By applying Lemma 1.8 to f , g, and h, we obtain\n(λ)\n(λ)\n(λ)\ne\ne\nf = ge h .\n\n(2) Let N be a normal field extension of E that contains the roots (xi )ni=1 of f and denote the\nunique extension of the Henselian v to N by w. Since f is irreducible in E[X], for any 1 ≤ i ≤ n,\nthere is an E-automorphism σi of N such that σi (x1 ) = xi . Because v is Henselian, w ◦ σi = w. So,\nw(xi ) = w(x1 ). This shows that f is a λ-polynomial for λ = w(x1 ). Moreover, as σi preserves w, it\ninduces a graded GE-automorphism σ\nei on GN for which σ\nei (e\nx1 ) = x\nei . This automorphism of course\nextends to a q(GE)-automorphism of q(GN ). So, the minimal polynomial k of x\ne1 over q(GE) is also\n(λ)\ne\nthe minimal polynomial of x\nei . Since the monic irreducible factors of f\nin q(GE)[X] are the minimal\npolynomials of its roots and Lemma 1.8 shows that the roots of fe(λ) are the x\nei , we must have fe(λ) = e\nan k s\nin q(GE)[X]. This k lies in GE[X] as noted above (because the graded field GE is integrally closed),\nand k is λ-homogenizable by Lemma 1.1(1) above.\n(3) Note that l and m are λ-homogenizable by Lemma 1.1(1). Without loss of generality, we may\nQ\nassume that f , l, and m are monic polynomials. Write f = ri=1 ptii , where pi are distinct monic\n\n\fSec. 1: Graded and valued field extensions\n\n9\n\n(λ)\n\nirreducible polynomials in E[X]. By (1) above the pi are also λ-polynomials and by (2) each pei equals\nQ\nqisi for some monic irreducible λ-homogenizable polynomial qi in GE[X], so fe(λ) = ri=1 qisi ti . Since\neach qi is a prime element of GE[X] by Lemma 1.1(3), qi divides l or m but not both. Let g be the\nproduct of those ptii with qi dividing l, and h the product of the ptii with qi dividing m. Then, f = gh.\nFurthermore, e\ng (λ) = l, and e\nh(λ) = m by the unique factorization for λ-homogenizable polynomials (see\nLemma 1.1).\n(4) Write fe(λ) = (X − b)m in GE[X] with (X − b) ∤ m. By Lemma 1.1, X − b and m are λ-\n\nhomogenizable, and since X − b is prime in GE[X], gcd(X − b, m) = 1. So by (3) above, f = gh for\nλ-polynomials g and h in E[x] with e\ng (λ) = X − b and e\nh(λ) = m. Write g = c1 X + c0 ; so, e\nc1 = e\n1 and\n−1\n−1\n(λ)\ne\nc0 = b. Then, a = c0 c1 is a root of g, so of f , and e\na=e\nc0 e\nc1 = b. Since e\na is not a root of h , a cannot\nbe a root of h by Lemma 1.8. So, a is a simple root of f .\n\n(5) Since f ′ is λ-homogenizable in GE[X], for any i with ai 6= 0, v(ai ) + iλ = v(an ) + nλ, hence\nv(ai ) = (n − i)λ + v(an ). In particular, we have v(a0 ) = nλ + v(an ), hence λ = n1 (v(a0 ) − v(an )). So,\n(λ)\nai for any i, so fe(λ) = f ′ .\n\u0003\nby Prop. 1.6(3) f is a λ-polynomial. Moreover, we have a = e\ni\n\nFor monic λ-polynomials over a Henselian valued field, Lemma 1.8 and Th. 1.9(2) and (4) were\nessentially proved by Boulagouaz in [B4 , Lemme 2.4, Th. 2.5, Cor. 2.6].\nPn\ni\nCorollary 1.10. Let E be a Henselian valued field, and let g =\ni=0 bi X be a λ-homogenizable\nirreducible polynomial of GE[X], with b0 6= 0. Choose any ai ∈ E with e\nai = bi , 0 ≤ i ≤ n, and let\nP\nf = ni=0 ai X i . Then, for any root a of f in an algebraic extension K of E such that e\na is a root of g\nin GK, we have G(E[a]) = GE[e\na] and [E[a] : E] = [G(E[a]) : GE].\nProof. By Th. 1.9(5) f is a λ-polynomial in E[X], with fe(λ) = g. So by Th. 1.9(1), f is irreducible\nin E[X]. Now, clearly GE[e\na] ⊆ G(E[a]). But, as f and g are irreducible,\n[GE[e\na] : GE] = deg(g) = deg(f ) = [E[a] : E] ≥ [G(E[a]) : GE] ≥ [GE[e\na]) : GE].\nHence, equality holds throughout, which implies that G(E[a]) = GE[e\na].\n\n\u0003\n\nRemark 1.11. Note that (1) and (5) of Th. 1.9 are true without assuming that v is Henselian. So, the\nHenselian assumption can be omitted from Cor. 1.10, as well.\nProposition 1.12. Let E be a Henselian valued field with residue characteristic p > 0 and L a purely\nwild finite-dimensional graded field extension of GE, then there is a defectless field extension K of E\nsuch that GK = L. If char(E) = p, then K can be chosen to be purely inseparable field extension of E.\nProof. Let N be a field extension of E such that L ⊆ GN . Assume first that L = GE[e\na] for some a ∈ N ,\nn\nand let p = [L : GE] = [q(L) : q(GE)]. Since q(L) is purely inseparable over q(GE), the minimal\nn\nn\nn\nap ∈ L∗ ∩ q(GE) ⊆ GN ∗ ∩ q(GE) = GE ∗ . So,\nap , where e\npolynomial of e\na over q(GE) is g := X p − e\nn\nn\nthere is b ∈ E such that e\nb=e\nap . Let f = X p − b and let x be a root of f in some finite-dimensional\nn\nn\nap in GN ′ . Note\nfield extension N ′ of N . Clearly, x\ne is a root of g; so, x\ne = e\na because x\nep = eb = e\nthat g is gr(e\na)-homogenizable, so it is irreducible in GE[X] by Lemma 1.1(3). By Cor. 1.10, we have\nG(E[x]) = GE[e\nx] = GE[e\na] = L.\nNow, let L be an arbitrary finite-dimensional purely wild graded field extension of GE. Then, we\ncan write L = GE[ae1 , ..., aer ], and the result follows by induction on r.\n\u0003\nAs a consequence of Th. 1.9, we have the following Corollary which gives explicitly the correspondence\nbetween (finite-dimensional) tame valued field extensions over a Henselian valued field and tame graded\nfield extensions. Recall that if L is a finite-dimensional extension of a Henselian valued field E, then\n\n\f10\n\nKARIM MOUNIRH AND A. R. WADSWORTH\n\nL is tame (or tamely ramified) over E if char(E) = 0 or char(E) = p > 0, L is separable over E,\np ∤ |ΓL : ΓE |, and [L : E] |ΓL : ΓE | = [L : E].\nCorollary 1.13. [HW1 , Th. 5.2] Let (E, v) be a Henselian valued field. Then, the map K 7→ GK\ngives a one-to-one correspondence between the set of E-isomorphism classes of finite-dimensional tame\nfield extensions of E and the set of graded GE-isomorphism classes of finite-dimensional tame graded\nfield extensions of GE. Moreover, K is a Galois tame (finite-dimensional) field extension of E if and\nonly if GK is a Galois (finite-dimensional) graded field extension of GE, in which case Gal(K/E) ∼\n=\nGal(GK/GE).\nProof. If K is a tame field extension of E, then obviously GK is a tame graded field extension of GE.\nLet K ′ be a tame field extension of E such that K ′ ∼\n= K. Since E is Henselian, the isomorphism respects\n′\nthe valuations on K and K extending v on E; so, GK ∼\n=g GK ′ .\nConversely, if L is a tame finite-dimensional graded field extension of GE, then q(GL) is separable\nover q(GE) by [HW1 , Prop. 3.5]; so, we can write L = GE[e\nx1 , ..., x\ner ], where xi ∈ Ealg with xei separable\nover q(GE). Let g be the minimal polynomial of x\ne1 over q(GE). Then g is λ-homogenizable in GE[X]\nwhere λ = gr(e\nx1 ), g is irreducible in GE[X] by Lemma 1.1(3), and x\ne1 is a simple root of g. Take any\nPn\nPn\ni\ni\nf = i=1 ci X ∈ E[X] such that i=1 e\nci X = g. By Th. 1.9(5), f is a λ-polynomial with fe(λ) = g. So,\nf is irreducible in E[X] by Th. 1.9(1), and Th. 1.9(4) applied over E[x1 ] shows that f has a simple root\na1 ∈ E[x1 ] with e\na1 = x\ne1 . By Cor. 1.10, G(E[a1 ]) = GE[e\na1 ]. Moreover, E[a1 ] is tame over E, as G(E[a1 ])\nis tame over GE and [E[a\n]\n:\nE]\n=\n[G(E[a\n])\n:\nGE]\nby\nCor.\n1.10. Since L = G(E[a1 ])[e\nx2 , . . . , x\ner ], which\n1\n\u0001 1\nis tame over G E[a1 ] , by induction on r there exist a2 , . . . , ar ∈ E[a1 ][x2 , . . . , xr ] such that each\ne\nai = x\nei and E[a1 ][a2 , . . . , ar ] is tame over E[a1 ] with G(E[a1 ][a2 , . . . , ar ]) = G(E[a1 ])[e\na2 , . . . , e\nar ] = L.\nLet K = E[a1 , . . . , ar ]. Then GK = L and K is tame over E, as K is tame over E[a1 ] and E[a1 ] is\ntame over E. For the uniqueness of K up to isomorphism, suppose K ′′ is another tame field extension\nof E such with a graded GE-isomorphism η : L → GK ′′ . Let b = η(e\na1 ), which is a root of the g above\n′′\n′′\na′′1 = b.\nin GK . With the f above, Th. 1.9(4) applied over K shows that f has a root a′′1 in K ′′ with e\n′′\nSince f is irreducible in E[X] with roots a1 and a1 , we have an E-isomorphism ψ : E[a1 ] → E[a′′1 ]\na1 ). So,\na1 to e\na′′1 = η(e\nwith ψ(a1 ) = a′′1 . The induced GE-isomorphism ψe : G(E[a1 ]) → G(E[a′′1 ]) maps e\ne\nψ = η|G(E[a1 ]) , as G(E[a1 ]) = GE[e\na1 ]. Since K = E[a1 ][a2 , . . . , ar ], it follows by induction on r that\nthere is an E-isomorphism K → K ′′ inducing η on the graded fields.\nNow, let K be a Galois tame finite-dimensional field extension of E, let G = Gal(K/E), and let w\nbe the unique extension of v to K. By Prop. 1.3 and Th. 1.5, GK is a Galois graded field extension\nof GE. Take any σ ∈ G. Since w ◦ σ = w, σ induces a graded GE-automorphism σ\ne : GK → GK\ng for all x ∈ E. Let φ : G → Gal(GK/GE) be the group homomorphism defined\nsatisfying σ\ne(e\nx) = σ(x)\nby φ(σ) = σ\ne, and let Gv = ker(φ). So,\ng =x\nGv = {σ ∈ G | σ(x)\ne for all x ∈ K} = {σ ∈ G | w(σ(x) − x) > w(x) for all x ∈ K \\ {0}},\n\nwhich shows that Gv is the ramification group for w over E (cf. [E, Th. (20.5)(c)]). But, since K is tame\nover E the ramification group is trivial, e.g., by the table in [E, p. 171] as K/E is defectless; hence, φ is\ninjective. Since |Gal(GK/GE)| = [GK : GE] = [K : E] = |G|, φ is a group isomorphism.\nLet M be a tame finite-dimensional field extension of E such that GM is a Galois graded field extension of GE and consider a Galois tame finite-dimensional field extension N of E containing M . By the\nabove GN is a Galois graded field extension of GE [resp., of GM ] and Gal(N/E) ∼\n= Gal(GN/GE) [resp.,\nGal(N/M ) ∼\n= Gal(GN/GM )]. Since GM is a Galois graded field extension of GE, then Gal(GN/GM )\nis a normal subgroup of Gal(GN/GE), therefore Gal(N/M ) is a normal subgroup of Gal(N/E). Hence,\nM is a Galois field extension of E.\n\u0003\n\n\fSec. 2: Subfields of nondegenerate tame semiramified division algebras\n\n11\n\nLet L/F be a finite-dimensional Galois graded field extension. In the same way as for ungraded fields,\nQ\none may define the norm NL/F of L over F by NL/F = σ∈Gal(L/F ) σ(x) for all x ∈ L. The following\nlemma is the graded version of Hilbert's Th. 90.\nLemma 1.14. Let L/F be a finite-dimensional Galois graded field extension with cyclic Galois group\ngenerated by σ. Then, for any x ∈ L∗ , NL/F (x) = 1 if and only if there exists y ∈ L∗ such that\nx = yσ(y)−1\nProof. Since L is Galois over F , q(L) is Galois over q(F ) with Gal(q(L)/q(F )) ∼\n= Gal(L/F ). Hence,\nfor any x ∈ L, NL/F (x) = Nq(L)/q(F ) (x). Assume that NL/F (x) = 1. Then, as Nq(L)/q(F ) (x) = 1,\nby Hilbert's Th. 90 there is z ∈ q(L)∗ such that x = zσ(z)−1 . We may assume z ∈ L \\ {0}. Write\nz = z1 + ... + zr , where all the zi are nonzero homogeneous elements of L and gr(zi ) < gr(zi+1 ) for all i,\n1 ≤ i < r. Since σ(z)x = z and x is homogeneous, for every i, σ(zi )x = zi . We can take for y any zi .\nThe converse is clear.\n\u0003\nProposition 1.15. Let F be a graded field and n a positive integer with char(F ) ∤ n. Suppose F0 contains a primitive n-th root of unity ζ. Then,\n(1) If L is a cyclic Galois graded field extension of F with [L : F ] = n, then there is x ∈ L∗ such\nthat L = F [x], xn ∈ F ∗ and Gal(L/F ) is generated by the graded F -automorphism σ defined by\nσ(x) = ζx.\n(2) Conversely, if a ∈ F ∗ and x is a root of the polynomial X n − a in q(F )alg , then F [x] is a cyclic\nGalois graded field extension of F with [F [x] : F ] = m, where m | n and xm ∈ F ∗ .\nProof. (1) Let σ be a generator of Gal(L/F ). We have NL/F (ζ −1 ) = 1, so by Lemma 1.14 there is\nx ∈ L∗ such that σ(x) = ζx. Accordingly, σ(xn ) = σ(x)n = (ζx)n = xn . Hence, xn ∈ F ∗ . Since\nσ i (x) = ζ i x, the σ i (x) are pairwise distinct for 1 ≤ i ≤ n, which implies that the minimal polynomial\nof x over q(F ) is X n − xn . So, [F [x] : F ] = n = [L : F ], showing that F [x] = L.\n(2) By [L, Th. 6.2, p. 324], q(F )(x) is cyclic Galois over q(F ) and [q(F )(x) : q(F )] = m where m | n\nand xm ∈ q(F )∗ . Hence, by [HW1 , Th. 3.11] F [x]/F is cyclic Galois of dimension m, and by [HW1 ,\nCor. 2.5(b)], xm ∈ F [x]∗ ∩ q(F ) = F ∗ .\n\u0003\nLet F be a graded field with char(F ) = p > 0. Then, Galois graded p-extensions of F are inertial\nover F , so they are exactly graded fields of the form KF , where K is any Galois p-extensions of F0 .\nThus, a graded field extension L/F of dimension a power of p is cyclic if L = F (x1 , ..., xn ), where\nx = (x1 , ..., xn ) ∈ Wn (L0 ) and (xp1 , ..., xpn ) − (x1 , ..., xn ) ∈ Wn (F0 ) (here Wn (L0 ) is the ring of Witt\nvectors associated to the field L0 ). In particular, cyclic extensions of degree p of F are F [x], where x is\na root of a polynomial X p − X − a for some a ∈ F0 with x ∈\n/ F0 .\n2. Subfields of nondegenerate tame semiramified division algebras\np\nFor a central simple algebra A over a field E, as usual we set deg(A) = [A : E] and exp(A) = the\norder of [A] in the Brauer group Br(E).\nBefore reviewing the notion of nondegeneracy, we recall Tignol's Dec groups. Let N be a finitedimensional Galois field extension of a field E with abelian Galois group G = Gal(N/E). Since G is\nabelian, there is a base (σ1 , . . . , σm ) of G, i.e., G = hσ1 i ⊕ . . . ⊕ hσm i. Let ri be the order of σi in G. For\neach j, let Kj be the fixed field of the subgroup of G generated by all the σi for i 6= j. So, Kj is a cyclic\nGalois extension of E with [Kj : E] = rj and Gal(Kj /E) = hσj |Kj i; also, N = K1 ⊗E . . . ⊗E Km . The\ngroup Dec(N/E), introduced by Tignol in [T], is the subgroup of the relative Brauer group Br(N/E)\n\n\f12\n\nKARIM MOUNIRH AND A. R. WADSWORTH\n\n( = ker(Br(E) → Br(N ) ) generated by all the subgroups Br(L/E) as L ranges over the fields with\nE ⊆ L ⊆ N and Gal(L/E) cyclic. Equivalently, Dec(N/E) is the subgroup of Br(E) generated by the\nBr(Ki /E) for 1 ≤ i ≤ m. Tignol showed in [T, Cor. 1.4] that Dec(N/E) consists of the Brauer classes\nof central simple E algebras T containing N such that deg(T ) = [N : E] and T is a tensor product\nof cyclic algebras with respect to the Ki , i.e., T ∼\n= (K1 /E, σ1 , c1 ) ⊗E . . . ⊗E (Km /E, σm , cm ). Such\nalgebras T were said by Tignol to decompose according to N , whence the name Dec(N/E). As the\ndefinition makes clear, Dec(N/E) is intrinsic to N and E, and is independent of the choice of cyclic\ndecomposition of Gal(N/E).\nNow, with E, N, G, and the σi as above, let A be a central simple E-algebra containing N as a\nmaximal subfield with deg(A) = [N : E]. For 1 ≤ i ≤ m, choose (by Skolem-Noether) zi ∈ A∗ with\nzi czi−1 = σi (c) for all c ∈ N . Let ui,j = zi zj zi−1 zj−1 ∈ CA (N )∗ = N ∗ , and let bi = ziri , which also\nL\nL\njm\nlies in N , as σiri = idN . Then, A =\n...\nN z1j1 . . . zm\n, and the multiplication in\n0≤j1 ≤r1 −1\n\n0≤jm ≤rm −1\n\nA is completely determined by N , G, the uij , and the bi , so we write A = (N/E, G, S, U, b), where\nU = (ui,j )1≤i,j≤m , b = (bi )1≤i≤m , and S = (σi )1≤i≤m is the chosen base of G. Amitsur and Saltman\ndefined in [AS, p. 81] a condition that they called degeneracy for the matrix (ui,j ), which by [BM,\nProp. 0.13] is equivalent to: there is a field L, E ⊆ L ⊆ N such that Gal(N/L) is noncyclic and\n[CA (L)] ∈ Dec(N/L). When there is such an L, we say that N is degenerate in A, or (when N is\nunderstood) A is degenerate. When there is no such L, we say that N is nondegenerate in A. Note\nthat the characterization in [BM] makes it clear that degeneracy is intrinsic to N and A, independent\nof the presentation of G and of the choice of the zi . (However, degeneracy is not intrinsic to A. Indeed,\nK. McKinnie has recently given in [Mc3 ] an example of a central division algebra A over a field E with\nmaximal subfields N and N ′ each abelian Galois over A such that N is degenerate in A but N ′ is\nnot.) Clearly, if Gal(N/E) is cyclic, then N is nondegenerate in A. Also, it is easy to see that if\n[N : E] has more than one distinct prime factor, then N is nondegenerate in A if and only if each\nprimary component of N is nondegenerate in the corresponding primary component of A. Therefore,\nour focus will be on nondegenerate algebras of prime power degree with Gal(N/E) noncyclic. The first\nexamples of nondegenerate algebras (with Gal(N/E) noncyclic) given in [AS, Remark, p. 82] satisfied\nexp(A) = deg(A), (for which the nondegeneracy holds trivially, see [AS, Lemma 1.7]). Subsequently,\nSaltman gave in [S2 , Cor. 12.15] an example of a nondegenerate algebra A with deg(A) = p2 and\nexp(A) = p for any odd prime p over a field E containing a primitive p-th root of unity. Recently,\nMcKinnie has given in [Mc2 ] more examples of nondegenerate division algebras of odd prime exponent,\nfrom which further examples can be built as well. See Remarks 2.1 below.\nNow let F be a graded field, and let B be an inertially split graded F -central division algebra. Then,\nas defined in [M2 , Remark 2.13], B is said to be degenerate if it has a graded subfield L inertial over F\nsuch that CB (L) is nicely semiramified with ΓCB (L) /ΓL noncyclic. Assume now that B is semiramified\nas well as inertially split. Then, B0 is a field abelian Galois over F0 with Gal(B0 /F0 ) ∼\n= ΓB /ΓF . The\ngraded subfields L of B inertial over F are the graded subfields of B0 F containing F , and are in oneto-one correspondence with the subfields of B0 containing F0 . ( L ↔ L0 ; note that L = L0 F .) In\nparticular, B0 F is a maximal graded subfield of B; it is inertial over F , and it contains all other graded\nsubfields of B inertial over F . Furthermore, B0 F is Galois over F with Gal(B0 F/F ) ∼\n= Gal(B0 /F0 ),\nwhich is abelian. In this context, the degeneracy of B is equivalent to what can be called the degeneracy\nof B0 F in B; that is, B is degenerate iff there is an inertial graded field extension L of F in B such that\nΓCB (L) /ΓL ( ∼\n= Gal(B0 F/L) ∼\n= Gal(B0 /L0 ) ) is noncyclic and CB (L) is isomorphic to a tensor product of\ncyclic graded algebras over L with respect to cyclic Galois graded field extensions of L within B0 F . (This\nequivalence holds because CL (B) is inertially split and semiramified by [M2 , Prop. 1.3], so every cyclic\n\n\fSec. 2: Subfields of nondegenerate tame semiramified division algebras\n\n13\n\nsubalgebra of CL (B) determined by an inertial cyclic graded field extension of L is nicely semiramified,\nby [M2 , Prop. 1.3].) By [M2 , Prop. 2.15], B is degenerate if and only if the maximal subfield q(B0 F ) is\ndegenerate in the q(F )-central division algebra q(B). Also, let σ1 , . . . , σm be any base of Gal(B0 /F0 ),\nand choose any yi ∈ B ∗ with yi cyi−1 = σi (c) for all c ∈ B0 . Let ui,j = yi yj yi−1 yj−1 ∈ B0∗ . Then, by\n[M2 , Prop. 2.17] B is degenerate if and only if the collection (ui,j )1≤i,j≤m satisfies the Amitsur-Saltman\ndegeneracy condition as elements of the abelian Galois field extension B0 of F0 .\nThe generic abelian crossed products of Amitsur and Saltman are associated to such graded division\nalgebras. Specifically, let A = (N/E, G, S, U, b) be an abelian crossed product over a field E, as described\nabove. From the data associated to A, Amitsur and Saltman defined in [AS, p. 83] a generic abelian\ncrossed product A′ = K(N/E, G, S, U ) which is a division algebra of the same degree as A whose center\nZ is purely transcendental over E; A′ has a maximal subfield M = N ⊗E Z which is abelian Galois over\nZ with Gal(M/Z) ∼\n= Gal(N/E) = G, and A′∗ contains elements y1 , . . . , ym such that yi induces σi on\nM by conjugation, and yi yj yi−1 yj−1 = ui,j for all i, j. This A′ depends up to isomophism on the choice\nof base S = (σ1 , . . . σm ) of G and on U = (ui,j ), but not on b = (b1 , . . . , bm ). Also, it follows from [T,\nProp. 2.3] that M is degenerate in A′ iff N is degenerate in A. A′ is definable as the ring of quotients\nof an iterated twisted polynomial ring, and it was shown in [BM, Th. 1.1] that A′ is therefore also q(B)\nfor a graded division ring B, which is an iterated twisted Laurent polynomial ring. Let F = Z(B), a\ngraded field. It was shown further in [BM, Th. 1.1] that q(F ) = Z, F0 = E, and B is inertially split and\nsemiramified over F with B0 = N and ΓB = Zm . Moreover, by [M2 , Prop. 2.15], M is degenerate in A′\niff B is degenerate. We will see in Cor. 2.5 below how results on subfields of nondegenerate algebras\nover Henselian fields yield another proof of one of Saltman's key results about maximal subfields generic\nabelian crossed products.\nRemarks 2.1. (i) Let p be an odd prime number, and let G be a noncyclic finite abelian p-group\nof order pn , n ≥ 2. McKinnie gave in [Mc2 , Cor. 3.2.11] an example of a central division algebras\nA over any suitable field E of any characteristic with maximal subfield N nondegenerate in A with\nGal(N/E) ∼\n= G and exp(A) = p. This yields nondegenerate algebras of higher exponent, as follows:\nSay A = (N/E, G, S, U, b), as above. Let A′ = K(N/E, G, S, U ) be the associated generic abelian\ncrossed product. Let E ′ = Z(A′ ), which is purely transcendental over E, and let N ′ = N ⊗E E ′ ,\nwhich is a maximal subfield which\nis nondegenerate in A′ with Gal(N ′ /E ′ ) ∼\n= Gal(N/E) ∼\n= G. But,\n\u0001\n′\nexp(A ) = lcm exp(A), exp(G) by [T, Prop 2.3]. Thus, simply by choosing G to have exponent pr\nfor 1 ≤ r ≤ n − 1, we obtain nondegenerate abelian crossed products of exponent pr and degree pn\n(cf. [Mc2 , Ex. 3.3.1]).\n(ii) From any nondegenerate generic abelian crosed product A′ = K(N/E, G, S, U ) of degree pn and\nexponent pr , one can obtain a nondegenerate inertially split semiramified division algebra A′′ over a\nHenselian valued field with deg(A′′ ) = pn and exp(A′′ ) = pr . For A′′ , nondegeneracy is defined to\nmean nondegeneracy in A′′ of the (unique up to isomorphism) maximal subfield of A′′ which is inertial\nover Z(A′′ ). One can obtain such an A′′ as what McKinnie calls the \"power series generic abelian\ncrossed product [Mc1 , Def. 3.6], in which the iterated twisted polynomials in A′ are replaced by iterated\ntwisted Laurent series. Another way to produce such an A′′ is to view A′ as q(B) for B an inertially\nsplit graded division algebra, and let A′′ = A′ ⊗Z(A′ ) HZ(A′ ), where HZ(A′ ) is the Henselization of\nZ(A′ ) with respect to a valuation on Z(A′ ) induced by the grading on Z(B). (See the proof of Cor. 2.5\nbelow.)\n(iii) If one wants nondegenerate abelian crossed product algebras with specified exponent exceeding exp(G), these are obtainable by a slight adaptation of McKinnie's examples as follows: Her A is\nobtained as A ⊗E E, where A is a division algebra with nondegenerate maximal subfield N with\nGal(N /E) ∼\n= G but exp(A) = deg(A) = |G|, while E is the function field E = E(Y ), where Y is\n\n\f14\n\nKARIM MOUNIRH AND A. R. WADSWORTH\n\nthe Brauer-Severi variety of A⊗p . Passage from E to E generically splits A⊗p , so generically reduces\nthe exponent of A to p (while assuring that A ⊗E E is a division ring.) For any r with 1 ≤ r < n, let\nr\nE ′ = E(Z), where Z is the Brauer-Severi variety of A⊗p , and let A′ =\u0001 A ⊗E E ′ and N ′ = N ⊗E E ′ .\nThen,\nby \u0003Amitsur's theorem [GS, Th. 5.4.1, p. 125], ker Br(E) → Br(E ′ ) is the cyclic group generated\n\u0002 ⊗p\nr\nby A\n; so, exp(A′ ) = pr . Also, A′ is a division algebra (of degree pn ) by the Schofield-van den\nBergh index reduction formula [SB, Th. 1.3] for function fields of Brauer-Severi varieties. Clearly, N ′ is\na maximal subfield of A′ which is Galois over E ′ with Gal(N ′ /E ′ ) ∼\n= Gal(N /E) ∼\n= G. Furthermore, N ′ is\n′\n′′\n′\n′\nnondegenerate in A . To see this, let E = E * E, the free composite of E and E over E; so, E ′′ is the\nr\nr\nfunction field over E of the Brauer-Severi variety of A⊗p . Since A⊗p is split, E ′′ is purely transcendental over E, by [GS, Th. 5.1.3, p. 115]. Therefore, since N is nondegenerate in A (as McKinnie proved),\nN ⊗E E ′′ is nondegenerate in A⊗E E ′′ , which follows from by [T, Prop. 2.3]. Then, as A′ ⊗E ′ E ′′ ∼\n= A⊗E E ′′\n′′\n′\n′\n′′\n′\nand N ⊗E ′ E ∼\n= N ⊗E E , N must be nondegenerate in A .\nThroughout the rest of this section, let E be a field with Henselian valuation v, and let D be a\ndivision algebra with center E and [D : E] = pn for some prime number p and some n ∈ N. We assume\nfurther that D is inertially split semiramified with respect to the unique extension of v to a valuaton\nof D.\nThere is a distinguished maximal subfield N of D, namely, an inertial maximal subfield. This N is\nunique up to isomorphism in D, and, since N = D is abelian Galois over E (see Prop. 2.2(1) below), N is\nabelian Galois over E, with Gal(N/E) ∼\n= Gal(D/E). We assume further that D is nondegenerate, by\nwhich is meant that N is nondegenerate in D. Such D and N exist, as we noted in Remark 2.1(ii). The\ngoal of this section is to obtain information about subfields of D (containing E). Of course, the inertial\nsubfields are known: their isomorphism classes are in one-to-one correspondence with the subfields of D\ncontaining E. The interest, therefore, is with the noninertial subfields. We first recall some known\nproperties of D and its subfields which will be used repeatedly below.\nProposition 2.2.\n(1) D is abelian Galois over E with Gal(D/E) ∼\n= ΓD /ΓE .\n(2) If ΓD /ΓE is noncyclic, then D has no (non-trivial) subfield totally ramified over E.\n(3) If K is a subfield of D containing E such that Gal(D/K) is noncyclic, then K is inertial over E.\n(4) Let M be a subfield of D with M inertial over E, and let C = CD (M ). Then C is inertially\nsplit, semiramified, and nondegenerate, with C = D.\nProof. (1) This holds by [JW, Lemma 5.1], as D is inertially split with D a field. (2) holds by [M2 ,\nProp. 3.2], and (3) by [M2 , Prop. 3.3]. (4) C is inertially split since D is, and by [JW, Th. 3.1(b)] (or\nby embedding M in an inertial lift of D over E in D), C = D. Since C is inertially split with C a field,\nby [M2 , Prop. 1.3(1)] C is semiramified; the nondegeneracy of C is immediate from the nondegeneracy\nof D.\n\u0003\nTheorem 2.3. With the hypotheses above, assume further that char(E) = p and ΓD /ΓE is noncyclic.\nLet K be a subfield of D with K normal over E. Then, K is Galois and inertial over E. So, there\nis a subgroup H of Gal(D/E) such that Gal(K/E) ∼\n= Gal(D/E)/H. In particular, if K is a maximal\nsubfield of D which is Galois over E, then Gal(K/E) ∼\n= Gal(D/E).\nProof. Let K be a subfield of D which is normal over E. Then by Th. 1.5, GK is a normal graded\nfield extension of GE. Let L = GK Gal(GK/GE) . By Prop. 1.4, L is a purely wild graded field extension\nof GE. Therefore, by [M2 , Lemma 3.1], L = GE. Hence, by Prop. 1.4 again, GK is a Galois graded\nfield extension of GE. In particular, by [HW1 , Th. 3.11] GK is a tame graded field extension of GE;\n\n\fSec. 2: Subfields of nondegenerate tame semiramified division algebras\n\n15\n\nsince also [GK : GE] is a power of p, we must have ΓGK = ΓGE . Hence, GK is inertial over GE.\nTherefore, K is an inertial valued field extension of E, and by Cor. 1.13, K is a Galois field extension of\nE. So, Gal(K/E) ∼\n= Gal(K/E), which is a homomorphic image of Gal(D/E). The rest is obvious. \u0003\nRemark. Independently, McKinnie has proved in [Mc2 , Th. 1.2.1] that if D is a semiramified division\np-algebra over a Henselian valued field E with D separable over E (which is equivalent to saying D\nis an inertially split semiramified division algebra over E) and with D/E not strongly degenerate (See\n[Mc1 , Def. 1.5]), and if K is a Galois subfield of D, then Gal(K/E) is of the form Gal(D/E)/H, where\nH is a subgroup of Gal(D/E).\nCorollary 2.4. Suppose char(E) = p. Then D is a cyclic algebra if and only if ΓD /ΓE is cyclic.\nProof. Recall from Prop. 2.2(1) that ΓD /ΓE ∼\n= Gal(D/E). Thus, if D is a cyclic algebra, then Th. 2.3\nshows that Gal(D/E) is a cyclic group, so ΓD /ΓE is also cyclic. Conversely, if ΓD /ΓE is cyclic, then\n\u0003\n'the' inertial lift of D over E in D (see [JW, Th. 2.9]) is a cyclic maximal subfield of D.\nCorollary 2.5. [S1 , Th. 3.2] Let E be a field with char(E) = p 6= 0, let N be a noncylic abelian Galois\nfield extension of E with [N : E] = pn , n ≥ 2, and let G = Gal(N /E). Let A = K(N /E, G, S, U ) be\nany associated generic abelian crossed product with U = (ui,j ) nondegenerate; let Z = Z(A). For any\nsubfield L of A with L Galois over Z, there is a subgroup H of G such that Gal(L/Z) ∼\n= G/H. In\n∼\nparticular, if L is a Galois maximal subfield of A, then Gal(L/Z) = G.\nProof. As recalled preceding Remark 2.1 above, by [BM, Th. 1.1], A = q(B) for some semiramified\ngraded division algebra B with B0 = N , Z(B)0 = E, and q(Z(B)) = Z. Let HZ be the Henselization\nof Z with respect to the canonical valuation on Z determined by the grading on Z(B) with some chosen\ntotal ordering of ΓZ(B) ; let HA = A ⊗Z HZ. Because the valuation on Z extends to A = q(B),\nby Morandi's Henselization Theorem [Mor, Th. 2] HA is a division ring with valuation extending the\nvaluation on HZ, and HA ∼\n=A∼\n= B0 ∼\n=Z ∼\n= Z(B)0 ∼\n= N and ΓHA = ΓA ; also, HZ ∼\n= E. So, HA is\n∼\n∼\ninertially split with Gal(HA/HZ) = Gal(N /E) = G and associated graded ring GHA = GA ∼\n= B. Since\nU = (ui,j ) is nondegenerate in N for G with base S, by [M2 , Prop. 2.17] B is a nondegenerate graded\ndivision algebra, so by [M2 , Lemma 2.14] HA is nondegenerate. Let L be a subfield of A with L Galois\nover Z. Then L ⊗Z HZ is a subfield of HA Galois over HZ with Gal((L ⊗Z HZ)/HZ) ∼\n= Gal(L/Z).\nSo, by Th. 2.3, there is a subgroup H of G such that Gal(L/Z) ∼\n= G/H. In particular, if L is a Galois\nmaximal subfield of A, then Gal(L/Z) ∼\n\u0003\n= G.\nProposition 2.6. Assume ΓD /ΓE is noncylic, and let K be a subfield of D which is elementary abelian\nGalois over E. Then, K is inertial over E. Therefore, D is an elementary abelian crossed product if\nand only if Gal(D/E) is elementary abelian.\nProof. Since K is an elementary abelian field extension of E, we can write K = K1 ⊗E K2 ⊗E ... ⊗E Kr ,\nwhere each Ki is a cyclic field extension of E with [Ki : E] = p. By Prop. 2.2(2), D contains no proper\ntotally ramified field extensions of E. Hence, each Ki is inertial over E; so, K is also inertial over E.\nIf K is in addition a maximal subfield of D, then D (= K) is elementary abelian over E. Conversely,\nsuppose that Gal(D/E) is elementary abelian and let M be the inertial lift of D over E in D. Then,\n\u0003\nM is a maximal subfield of D which is Galois over E with Gal(M/E) ∼\n= Gal(M /E).\nRemark 2.7. Prop. 2.6 is not true if ΓD /ΓE is cyclic. Indeed, let k be a field containing a primitive p-th\nroot of unity, with a cyclic Galois extension L with [L : k] = p2 . Let N be the field with\u0001k $ N $ L.\nLet E be the Laurent series field k((X)), and let D be the cyclic algebra L((X))/E, σ, X , where σ is\nany generator of Gal(L((X))/E). Then, D is a division algebra of degree p2 with center E. Moreover,\n\n\f16\n\nKARIM MOUNIRH AND A. R. WADSWORTH\n\nwith respect to the Henselian X-adic valuation on E, D is tame and semiramified, with D\u000e= L. This\nD is trivially nondegenerate since Gal(D/E) is cyclic. We have ΓD /ΓE ∼\n= Gal(D/E) ∼\n= Z p2 Z. But,\n2\ntake t in D with tat−1 = σ(a) for all a ∈ L((X)) and tp = X. Then, D also contains the maximal\nsubfield N ((X))[tp ] which is elementary abelian Galois over E.\nFor a finite abelian p-group P , rk(P ) denotes the number of summands in a cyclic decomposition\nof P ; so rk(P ) = dimZ/pZ (P/pP ).\nProposition 2.8. Suppose rk(ΓD /ΓE ) ≥ 3, and let K be a subfield of D which is abelian Galois over E.\nThen, K is inertial over E.\nProof. Write K = K1 ⊗E K2 ⊗E . . .⊗E Kr , where each Ki is a cyclic Galois field extension of E. So, Ki is\ncyclic over E. Therefore, D cannot be cyclic over Ki (since rk(Gal(D/E)) ≥ 3). So, by Prop. 2.2(3)\neach Ki is inertial over E. Hence, K is inertial over E.\n\u0003\nLemma 2.9. Let K be any subfield of D containing E with K not inertial over E. Then, Gal(D/K) is\ncyclic and ΓK /ΓE is isomorphic to a subgroup of Gal(D/K). In particular, if exp(ΓD /ΓE ) = p, then\nK is a maximal subfield of D.\nProof. Let M be the maximal unramified extension of E in K, and let C = CD (M ). By Prop. 2.2(4)\nabove, C is a nondegenerate inertially split semiramified division algebra with C = D. Moreover K is a\nsubfield of C which is a non-trivial totally ramified extension of the center M of C. So, by Prop. 2.2(1)\nand (2) applied to C as an M -algebra, Gal(C/M ) is cyclic. Then, Gal(D/K) is cyclic, as D = C and\nK = M . The canonical isomorphism ΓD /ΓE ∼\n= Gal(D/E) of Prop. 2.2(1) is induced by conjugation,\nso it injects ΓK /ΓE into Gal(D/K). If p = exp(ΓD /ΓE ) = exp(Gal(D/E)), then the cyclic group\nGal(C/M ) has exponent and hence order p. Then, p = |Gal(C/M )| = deg(C), as C is semiramified.\nSo the proper extension K of M is a maximal subfield of C, and hence K is also a maximal subfield\nof D.\n\u0003\nLet H be a finite nonabelian group. We say that H is a quaternion group if H has order 8 and is\ngenerated by two elements a and b satisfying the conditions a4 = b4 = 1, a2 = b2 and ba = a−1 b. If\nK/E is a normal [resp., Galois] field extension with a quaternion Galois group, we say that K is a\nquaternion normal [resp., Galois] field extension of E. We say that a finite group H is Hamiltonian\nif H is nonabelian and every subgroup of H is normal. Recall that a Hamiltonian group is the direct\nproduct of a quaternion group with an abelian group of odd order and an abelian group of exponent\ntwo [H, Th. 12.5.4].\nTheorem 2.10. Suppose exp(ΓD /ΓE ) = p, and let K be a subfield of D containing E. Then,\n(1) If K is not inertial over E, then K is a maximal subfield D.\n(2) If ΓD /ΓE is noncyclic and K is a non-quaternion normal maximal subfield of D, then either\nK is cyclic Galois over E with [K : E] = p2 or K is inertial and elementary abelian Galois\nover E.\nProof. (1) This follows by Lemma 2.9.\n(2) Let G = Gal(K/E) and let I = K G . Then, I is purely inseparable over E, so I is purely\ninseparable over E. Since D is separable over E, we have I = E; hence I is totally ramified over E.\nSince D is nondegenerate, Prop. 2.2(2) shows that I = E. Therefore, K is Galois over E. If L is any\nproper subfield of K, then by part (1) of this proof L is inertial over E, hence L is an abelian Galois field\nextension of E. Therefore, any subgroup of G is a normal subgroup. So, G is Hamiltonian or abelian.\n\n\fSec. 2: Subfields of nondegenerate tame semiramified division algebras\n\n17\n\nIf K is inertial over E, then K is Galois over E since K is Galois over E, and Gal(K/E) ∼\n= Gal(K/E);\n∼\nthis group is elementary abelian since Gal(D/E) = ΓD /ΓE , which is elementary abelian. Suppose now\nK is not inertial over E, and let M be the maximal unramified extension of E in K. We have seen\nthat every proper subfield of K is inertial over E, so lies in M . Therefore, Gal(K/M ) is the unique\nminimal proper subgroup of G. So, G admits no nontrivial direct product decompositions, and since\nG is assumed non-quaternion, it cannot be Hamiltonian. Hence, G is abelian, and since it has a unique\nminimal proper subgroup it must be cyclic. The exponent assumption then implies that the cyclic\ngroups ΓK /ΓE and Gal(K/E) have order at most p. So [K : E] is at most p2 . The fact that K is a\nmaximal subfield of D and ΓD /ΓE is noncyclic imply that [K : E] = p2 .\n\u0003\nLemma 2.11. Let K be a tame finite-dimensional Galois extension of the Henselian field E, and let\nL be a field with E ⊆ L ⊆ K, such that L = K. Then, L is Galois over E.\nProof. Let M be the maximal unramified extension of E in L. Because L = K, M is the maximal\nunramified extension of E in K. Since K is Galois, totally ramified, and tame over M , we have the\ncanonical isormorphism Gal(K/M ) ∼\n= Hom(ΓK /ΓM , Ω), where Ω is the group of roots of unity in K, by\n[E, (20.11)]. For any field N with M ⊆ N ⊆ K, this isomorphism maps Gal(K/N ) to Hom(ΓK /ΓN , Ω).\nThis yields a one-to-one correspondence between subgroups of Gal(K/M ) and subgroups of ΓK /ΓM .\nTherefore, for any σ ∈ Gal(K/E), since σ(L) ⊇ σ(M ) = M and Γσ(L) = ΓL , we must have σ(L) = L.\nAs K is Galois over E, it follows that L is normal, hence also Galois, over E.\n\u0003\nDefinition 2.12. Let G be an abelian group and H a non-trivial cyclic subgroup of G. We say that\nH is maximally cyclic in G if there is no cyclic subgroup H ′ of G such that H $ H ′ .\nSuppose ΓD /ΓE is noncyclic. We have previously seen in the proof of Th. 2.3 and also in the proof of\nTh. 2.10 that if K is a normal field extension of E in D, then K is a Galois field extension of E. From\nthe nondegeneracy of D over F we have seen in Prop. 2.2(3) that if Gal(D/K) is noncyclic, then K is\ninertial over E. In the next proposition we will study the case where Gal(D/K) is maximally cyclic\nin Gal(D/E).\nProposition 2.13. Let K be a subfield of D which is normal and tame over E such that Gal(D/K) is\ncyclic. Suppose Gal(D/K) is maximally cyclic in Gal(D/E). Then, K is Galois over E. Furthermore,\n(1) If deg(D) is odd, then K is an abelian field extension of E.\n(2) If ΓD /ΓE is noncyclic and deg(D) is a power of 2, then K is either a quaternion or an abelian\nfield extension of E.\nTherefore, if rk(ΓD /ΓE ) ≥ 3 and K is not a quaternion field extension of E, then K is inertial over E.\nProof. Let G = Gal(K/E). By the same argument as in the proof of Th. 2.10(2), K is Galois over\nE. Let L be a field with E ⊆ L ⊆ K. If L = K, then by Lemma 2.11 L is Galois over E. On the\nother hand, if L $ K then Gal(D/L) is not cyclic by the maximal cyclicity assumption. Therefore,\nby Prop. 2.2(3), L is inertial, and hence Galois, over E. Since Gal(L/E) is Galois in all cases, G is\nHamiltonian or abelian. In case (1), since |G| is odd, G must be abelian.\n(2) Suppose G is Hamiltonian. Since G is nonabelian, K is not inertial over E. Suppose we have a\ntensor decomposition K = L1 ⊗E L2 with fields Li containing E. Since K is not inertial over E, one\nof the Li , say L1 , is not inertial over E. Then, L1 = K, as we saw above. Let Mi be the maximal\nunramified extension of E in Li . Then, M2 = L2 ⊆ K = L1 = M1 . Therefore, M2 is a subfield of M1 .\nSince M1 ⊗E M2 is a field (a subfield of L1 ⊗E L2 ), we must have M2 = E. Therefore, L2 is totally\nramified over E. Hence, L2 = E, by Prop. 2.2(2). This shows that K admits no nontrivial tensor\n\n\f18\n\nKARIM MOUNIRH AND A. R. WADSWORTH\n\nproduct decompositions over E, and hence that G admits no nontrivial direct product decompositions.\nTherefore, the Hamiltonian group G must be quaternionic, so K is quaternionic over E.\nThe rest of the proposition follows by Prop. 2.8.\n\n\u0003\n\nCorollary 2.14. Assume deg(D) is odd and char(E) ∤ deg(D). Let K be a maximal subfield of D such\nthat K is Galois over E. If |ΓK : ΓE | = exp(ΓD /ΓE ), then Gal(K/E) is abelian and rk(ΓD /ΓE ) ≤ 2.\nProof. Assuming D 6= E, the assumption on ΓK assures that K is not inertial over E. Therefore,\nby Lemma 2.9, Gal(D/K) is cyclic. Let M be the maximal unramified extension of E in K, and let\nC = CD (M ). By Prop. 2.2(4), C is inertially split and semiramified with C = D. Now, K is a maximal\nsubfield of C, since it is maximal in D, and K is totally ramified over M . Since\n|ΓK : ΓM | = [K : M ] = ind(C) = |ΓC : ΓM |,\nwe have ΓK = ΓC . As M = K and ΓM = ΓE , Prop. 2.2(1) applied to C shows that\nGal(D/K) = Gal(C/M ) ∼\n= ΓC /ΓM = ΓK /ΓE .\nTherefore,\n\n\u0001\nGal(D/K) = |ΓK : ΓE | = exp(ΓD /ΓE ) = exp Gal(D/E) ;\n\nso, Gal(D/K) is maximally cyclic in Gal(D/E). Hence, by (1) and the last assertion of Prop. 2.13, K is\nabelian Galois over E and rk(ΓD /ΓE ) ≤ 2 (as K is not inertial over E).\n\u0003\nRemark 2.15. Suppose char(E) 6= p. Let x be an element of D ∗ such that ord(v(x) + ΓE ) = exp(ΓD /ΓE ),\nand let L be a maximal subfield of D containing x. Then by Cor. 2.14, L cannot be Galois over E if\nrk(ΓD /ΓE ) ≥ 3.\nProposition 2.16. Suppose char(E) 6= p and rk(ΓD /ΓF ) ≥ 3. Suppose K is a subfield of D which is\nGalois but not inertial over E. Then, [K : E] ≥ p deg(D) exp(ΓD /ΓE )−1 .\nProof. We may assume that K is minimal in D with the property that K is Galois but not inertial\nover E. Let M be the maximal unramified extension of E in K. Then, K is Galois, totally ramified,\nand tame over M (as char(E) 6= p). Let L be a field with M ⊆ L $ K. Then, L = K since M = K, so\nL is Galois over E by Lemma 2.11. Hence, L is inertial over E by the minimality of K, i.e., L = M .\nThus, M is a maximal proper subfield of K. Since K is Galois over M , this implies that [K : M ] = p.\nSo, |ΓK : ΓE | = |ΓK : ΓM | = [K : M ] = p. Now, by Prop. 2.2(3), Gal(D/K) is a cyclic group. Hence,\n[D : K] ≤ exp(Gal(D/E)) = exp(ΓD /ΓE ) (see Prop. 2.2(1)). Therefore,\n[K : E] = [K : E] |ΓK : ΓE | = [D : E] [D : K]−1 p ≥ p deg(D) exp(ΓD /ΓE )−1 .\n\u0003\nReferences\n[AS]\n\nS. A. Amitsur and D. Saltman, Generic abelian crossed products and p-algebras, J. Algebra, 51 (1978), 76–87.\n\n[B1 ]\n\nM. Boulagouaz, The graded and tame extensions, pp. 27–40 in: Commutative Ring Theory (Fez, 1992), Eds. P.- J. Cahen et\nal., Lecture Notes in Pure and Applied Mathematics, Vol. 153, Dekker, New York, 1994.\n\n[B2 ]\n\nM. Boulagouaz, Le gradué d'une algèbre à division valuée, Comm. Algebra, 23 (1995), 4275–4300.\n\n[B3 ]\n\nM. Boulagouaz, Algèbre à division graduée centrale, Comm. Algebra, 26 (1998), 2933–2947.\n\n[B4 ]\n\nM. Boulagouaz, Une généralisation du lemme de Hensel, Bull. Belg. Math. Soc., 5 (1998), 665–673.\n\n[B5 ]\n\nM. Boulagouaz, An introduction to the Galois theory for graded fields, pp. 21–31 in: Algebra and Number Theory (Fez),\nEds. M. Boulagouaz and J.-P. Tignol, Lecture Notes in Pure and Applied Mathematics, Vol. 208, Dekker, New York, 2000.\n\n[BM]\n\nM. Boulagouaz and K. Mounirh, Generic abelian crossed products and graded division algebras, pp. 33–47 in: Algebra and\nNumber Theory (Fez), Eds. M. Boulagouaz and J.-P. Tignol, Lecture Notes in Pure and Applied Mathematics, Vol. 208,\nDekker, New York, 2000.\n\n\fSec. 2: Subfields of nondegenerate tame semiramified division algebras\n\n[E]\n\nO. Endler, Valuation Theory, Springer, New York (1972).\n\n[EP]\n\nA. Engler and A. Prestel, Valued Fields, Springer, Berlin, 2005.\n\n19\n\n[GS]\n\nP. Gille and T. Szamuely, Central Simple Algebras and Galois Cohomology, Cambridge Univ. Press, Cambridge, UK, 2006.\n\n[JW]\n\nB. Jacob and A. R. Wadsworth, Division algebras over Henselian fields, J. Algebra, 128 (1990), 126–179.\n\n[H]\n\nM. Hall, Jr., The Theory of Groups, Macmillan, New York, 1959.\n\n[HW1 ] Y.-S. Hwang and A. R. Wadsworth, Algebraic extensions of graded and valued fields, Comm. Algebra, 27 (1999), 821–840.\n[HW2 ] Y.-S. Hwang and A. R. Wadsworth, Correspondences between valued division algebras and graded division algebras, J. Algebra, 220 (1999), 73–114.\n[K]\n\nG. Karpilovsky, Topics in Field Theory, North-Holland Mathematics Studies 155, North-Holland, Amsterdam, 1989.\n\n[L]\n\nS. Lang, Algebra, 2nd Ed., Addision-Wesley, Reading, Mass., 1984.\n\n[Mor]\n\nP. J. Morandi, The Henselization of a valued division algebra, J. Algebra, 122 (1989), 232–243.\n\n[M1 ]\n\nK. Mounirh, Nicely semiramified division algebras over Henselian fields, Int. J. Math. Math. Sci., 2005, No. 4, 571–577.\n\n[M2 ]\n\nK. Mounirh, Nondegenerate semiramified valued and graded division algebras, Comm. Algebra, 36 (2008), 4386–4406.\n\n[Mc1 ]\n\nK. Mckinnie, Prime to p extensions of the generic abelian crossed product, J. Algebra, 317 (2007), 813–832.\n\n[Mc2 ]\n\nK. Mckinnie, Indecomposable p-algebras and Galois subfields in generic abelian crossed products, J. Algebra, 320 (2008),\n1887–1907.\n\n[Mc3 ]\n\nK. Mckinnie, Degeneracy and decomposability in abelian crossed products, preprint, arXiv:0809.1395.\n\n[S1 ]\n\nD. Saltman, Noncrossed product p-algebras and Galois p-extensions, J. Algebra, 52 (1978), 302–314.\n\n[S2 ]\n\nD. Saltman, Lectures on Division Algebras, CBMS Regional Conference Series in Math., Vol. 94, Amer. Math. Soc., Providence, RI, 1999.\n\n[SB]\n\nA. Schofield and M. van den Bergh, The index of a Brauer class on a Brauer-Severi variety, Trans. Amer. Math. Soc., 333\n(1992), 729–739.\n\n[T]\n\nJ.-P. Tignol, Produits croisés abéliens, J. Algebra, 70 (1981), 420–436.\n\n[W]\n\nA. R. Wadsworth, Valuation theory on finite dimensional division algebras, pp. 385–449 in Valuation Theory and Its Applications, Vol. I, eds. F.-V. Kuhlmann et al., Fields Institute Commucations, Vol. 32, Amer. Math. Soc., Providence, RI,\n2002.\n\nE-mail address: akamounirh@hotmail.com\n(for A. R. Wadsworth) Department of Mathematics, University of California, San Diego, La Jolla, CA 92093-0112,\nUSA\nE-mail address: arwadsworth@ucsd.edu\n\n\f"}