{"id": "http://arxiv.org/abs/0804.4346v2", "guidislink": true, "updated": "2008-05-01T07:39:02Z", "updated_parsed": [2008, 5, 1, 7, 39, 2, 3, 122, 0], "published": "2008-04-28T19:33:43Z", "published_parsed": [2008, 4, 28, 19, 33, 43, 0, 119, 0], "title": "On the Kerr Quantum Area Spectrum", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0804.4376%2C0804.3092%2C0804.0790%2C0804.4518%2C0804.1174%2C0804.3390%2C0804.2253%2C0804.4466%2C0804.4346%2C0804.3923%2C0804.1191%2C0804.3869%2C0804.4639%2C0804.1453%2C0804.1980%2C0804.0694%2C0804.4350%2C0804.0870%2C0804.0430%2C0804.2880%2C0804.4710%2C0804.0322%2C0804.2320%2C0804.3363%2C0804.1442%2C0804.2776%2C0804.4104%2C0804.0285%2C0804.1189%2C0804.4787%2C0804.2570%2C0804.0965%2C0804.4443%2C0804.0021%2C0804.0622%2C0804.4827%2C0804.2246%2C0804.0464%2C0804.4534%2C0804.2049%2C0804.1966%2C0804.2737%2C0804.4532%2C0804.4703%2C0804.0632%2C0804.0023%2C0804.3847%2C0804.0629%2C0804.2809%2C0804.0443%2C0804.0825%2C0804.4186%2C0804.3543%2C0804.2632%2C0804.3772%2C0804.0765%2C0804.1730%2C0804.0606%2C0804.0794%2C0804.4256%2C0804.3521%2C0804.1479%2C0804.3675%2C0804.0378%2C0804.4288%2C0804.2218%2C0804.2588%2C0804.1554%2C0804.3552%2C0804.4521%2C0804.0554%2C0804.1974%2C0804.1184%2C0804.3114%2C0804.1321%2C0804.2749%2C0804.1029%2C0804.4364%2C0804.3525%2C0804.2126%2C0804.4140%2C0804.0548%2C0804.3162%2C0804.2963%2C0804.0894%2C0804.3748%2C0804.4487%2C0804.3395%2C0804.3749%2C0804.3669%2C0804.2383%2C0804.4214%2C0804.2902%2C0804.1470%2C0804.4483%2C0804.4593%2C0804.0627%2C0804.3177%2C0804.0025%2C0804.4384%2C0804.2719&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "On the Kerr Quantum Area Spectrum"}, "summary": "Suppose that there is a quantum operator that describes the horizon area of a\nblack hole. Then what would be the form of the ensuing quantum spectrum? In\nthis regard, it has been conjectured that the characteristic frequencies of the\nblack hole oscillations can be used to calibrate the spacing between the\nspectral levels. The current article begins with a brief review of this\nconjecture and some of its subsequent developments. We then suggest a simple\nbut vital modification to a recent treatment on the Kerr (or rotating black\nhole) spectrum. As a consequence of this refinement, we are able to rectify a\nprior inconsistency (as was found between two distinct calculations) and to\nestablish, unambiguously, a universal form for the Kerr and Schwarzschild\nspectra.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0804.4376%2C0804.3092%2C0804.0790%2C0804.4518%2C0804.1174%2C0804.3390%2C0804.2253%2C0804.4466%2C0804.4346%2C0804.3923%2C0804.1191%2C0804.3869%2C0804.4639%2C0804.1453%2C0804.1980%2C0804.0694%2C0804.4350%2C0804.0870%2C0804.0430%2C0804.2880%2C0804.4710%2C0804.0322%2C0804.2320%2C0804.3363%2C0804.1442%2C0804.2776%2C0804.4104%2C0804.0285%2C0804.1189%2C0804.4787%2C0804.2570%2C0804.0965%2C0804.4443%2C0804.0021%2C0804.0622%2C0804.4827%2C0804.2246%2C0804.0464%2C0804.4534%2C0804.2049%2C0804.1966%2C0804.2737%2C0804.4532%2C0804.4703%2C0804.0632%2C0804.0023%2C0804.3847%2C0804.0629%2C0804.2809%2C0804.0443%2C0804.0825%2C0804.4186%2C0804.3543%2C0804.2632%2C0804.3772%2C0804.0765%2C0804.1730%2C0804.0606%2C0804.0794%2C0804.4256%2C0804.3521%2C0804.1479%2C0804.3675%2C0804.0378%2C0804.4288%2C0804.2218%2C0804.2588%2C0804.1554%2C0804.3552%2C0804.4521%2C0804.0554%2C0804.1974%2C0804.1184%2C0804.3114%2C0804.1321%2C0804.2749%2C0804.1029%2C0804.4364%2C0804.3525%2C0804.2126%2C0804.4140%2C0804.0548%2C0804.3162%2C0804.2963%2C0804.0894%2C0804.3748%2C0804.4487%2C0804.3395%2C0804.3749%2C0804.3669%2C0804.2383%2C0804.4214%2C0804.2902%2C0804.1470%2C0804.4483%2C0804.4593%2C0804.0627%2C0804.3177%2C0804.0025%2C0804.4384%2C0804.2719&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Suppose that there is a quantum operator that describes the horizon area of a\nblack hole. Then what would be the form of the ensuing quantum spectrum? In\nthis regard, it has been conjectured that the characteristic frequencies of the\nblack hole oscillations can be used to calibrate the spacing between the\nspectral levels. The current article begins with a brief review of this\nconjecture and some of its subsequent developments. We then suggest a simple\nbut vital modification to a recent treatment on the Kerr (or rotating black\nhole) spectrum. As a consequence of this refinement, we are able to rectify a\nprior inconsistency (as was found between two distinct calculations) and to\nestablish, unambiguously, a universal form for the Kerr and Schwarzschild\nspectra."}, "authors": ["A. J. M. Medved"], "author_detail": {"name": "A. J. M. Medved"}, "author": "A. J. M. Medved", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0264-9381/25/20/205014", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0804.4346v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0804.4346v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Roughly 8 pages; (v2) added references and very minor changes", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0804.4346v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0804.4346v2", "journal_reference": "Class.Quant.Grav.25:205014,2008", "doi": "10.1088/0264-9381/25/20/205014", "fulltext": "On the Kerr Quantum Area Spectrum\n\narXiv:0804.4346v2 [gr-qc] 1 May 2008\n\nA.J.M. Medved\nPhysics Department\nUniversity of Seoul\nSeoul 130-743\nKorea\nE-Mail(1): allan@physics.uos.ac.kr\nE-Mail(2): joey medved@yahoo.com\nOctober 25, 2018\nAbstract\nSuppose that there is a quantum operator that describes the horizon area of a\nblack hole. Then what would be the form of the ensuing quantum spectrum? In\nthis regard, it has been conjectured that the characteristic frequencies of the black\nhole oscillations can be used to calibrate the spacing between the spectral levels.\nThe current article begins with a brief review of this conjecture and some of its\nsubsequent developments. We then suggest a simple but vital modification to a\nrecent treatment on the Kerr (or rotating black hole) spectrum. As a consequence\nof this refinement, we are able to rectify a prior inconsistency (as was found between\ntwo distinct calculations) and to establish, unambiguously, a universal form for the\nKerr and Schwarzschild spectra.\n\n1\n\n\fThere is a long-standing belief that a black hole horizon should be endowed with a quantum area spectrum. This notion can have its origins traced back to the profound revelations of Bekenstein in the early seventies [1]. Most significantly, the horizon area (A) of a\nblack hole was shown to be an adiabatic invariant [2] and, as such, should logically obtain\na discrete spectrum upon a suitable process of quantization. With a few other pertinent\ninputs, Bekenstein went on to propose his now-famous evenly spaced spectrum:\nAn = ǫ~n where n = 0, 1, 2, ... .\n\n(1)\n\nHere, n is the associated quantum number, all fundamental constants besides Planck's\nconstant have been set to one and ǫ should be regarded as a numerical coefficient of the\norder of unity.\n[Various schools of thought have questioned the viability of an evenly spaced area\nspectrum; most notably, many proponents of loop quantum gravity [3]. It should, however,\nbe pointed out that the rest of the discussion focuses on the semi-classical or large n limit.\nHence, one may - if so preferred - regard Eq.(1) as an asymptotic form of a possibly\nmore convoluted spectrum.]\nAlong with the form of the spectrum itself, the value of ǫ has been somewhat controversial. On this point, Hod made an interesting suggestion; namely, ǫ can be fixed by\nutilizing the quasi-normal mode frequencies of an oscillating black hole [4]. The premise\nof this so-called Hod Conjecture goes as follows: A perturbed black hole will tend to equilibrate by radiating away energy in the form of gravitational waves. This radiation will,\npredominantly, consist of damped oscillations that can be characterized by a discrete set\nof complex frequencies. Then, \"in the spirit of the Bohr Correspondence Principle\", it\nbecomes natural to associate the classical limit of these frequencies (say ωc ) with the large\nn limit of the aforementioned (quantum) area spectrum. Inasmuch as a given frequency\nrepresents a transition between spectral levels, this association can be made rather precise:\nAn+1 − An =\n\n∂A(M)\n~ωc = 32πM~ωc as n → ∞ ,\n∂M\n\n(2)\n\nwhere M is the black hole mass and the well-known Schwarzschild relation A = 16πM 2\nhas been invoked. [We limit considerations, for the time being, to the Schwarzschild\ncase of a non-rotating (and uncharged) black hole. The rotating or Kerr scenario will\nbe addressed in due course.] Note that this difference in levels is, in Planck units, quite\nsimply the numerical coefficient ǫ.\nHod went on to propose that, from the quasi-normal-mode side of things, the relevant\nclassical limit should be that of infinite damping (or vanishing decay time); with the\nlogic being that a truly classical black hole can not conceivably emit any radiation. More\nspecifically, he suggested that ωc should be regarded as the real part of the quasi-normal\nfrequency after the imaginary part (which determines the damping rate) has been sent\noff to infinity. Using the numerical evidence of the time [5] (which was later verified by\nanalytic means [6]), Hod identified the asymptotic form for the mode frequencies as\n~ω(k) ≈ i2πT k + T ln 3 as k → ∞ ,\nwhere k is the quasi-normal \"discreteness index\" and T = ~/8πM\n2\n\n(3)\nis the Hawking\n\n\f(Schwarzschild) temperature [7]. Then, by way of the above line of reasoning,\n~ωc = T ln 3 =\n\n~ ln 3\n.\n8πM\n\n(4)\n\nFinally, combining Eqs.(2) and (4), one can reproduce Hod's important realization:\nǫ = 32πM*\n\nln 3\n= 4 ln 3 .\n8πM\n\n(5)\n\nKunstatter furthered this tapestry of ideas with the following insightful observations [8]:\nA natural adiabatic invariant for a system with energy E and vibrational frequency ω(E)\nis the ratio E/ω(E). So, by way of the Bohr–Sommerfeld quantization condition (which\nessentially relates an adiabatic invariant to a quantum number n in the semi-classical or\nlarge n limit), it follows that\nZ\ndE\n≈ n~ as n → ∞ .\n(6)\nω(E)\nCasting a Schwarzschild black hole into this framework, Kunstatter replaced E with M\nand identified ωc as the most appropriate choice for the frequency. Making the recommended substitutions and then integrating, one readily obtains\n4πM 2\n≈ n~ .\nln 3\n\n(7)\n\nThis obviously implies the spectral form\nAn = 4n~ ln 3\n\n(8)\n\nor ǫ = 4 ln 3 in agreement with Hod.\nRecently, Maggiore refined the Hod treatment by arguing that - insofar as a black\nhole is to be viewed as a damped harmonic oscillator - the physically relevant frequency\nwould actually be [9]\nq\nωp =\n\nωR2 + |ωI2 | ,\n\n(9)\n\nwhere ωR and ωI are, respectively, the real and imaginary part of the quasi-normal mode\nfrequency. In the large-damping limit, this \"physical frequency\" necessarily translates\ninto [cf, Eq.(3)]\n~k\nas k → ∞ .\n(10)\n~ωp ≈ ~ |ωI | ≈ 2πT k =\n4M\nTo effectively regulate this large k divergence, Maggiore sensibly proposed that the characteristic classical frequency (our ωc ) should now be identified with a transition between\n(adjacent) quasi-normal frequency levels. That is,\nωc\n\n=\n≈\n\nωp (k + 1) − ωp (k) as k → ∞\n1\n.\n4M\n\n(11)\n\nIt should not be difficult to convince oneself that - given this revised state of affairs -\nthe spectral-spacing coefficient now becomes\nǫ = 8π .\n3\n\n(12)\n\n\fThis outcome can easily be verified by either Hod or Kunstatter's choice of methodology.\n[It may be of interest that this particular value of ǫ occurs frequently in the literature\nfor a variety of analytic techniques (see [10] and references therein). Many other \"selling\npoints\" for Maggiore's revision are discussed in his already-cited work. Conversely, the\nmain attribute of the original Hod calculation is that it complies with ǫ = 4 ln m (for some\npositive integer m > 1). This being the unique form that complies with a strict statistical\ninterpretation for black hole thermodynamics [11]; as dictated by the area–entropy law\n(S = A/4~ [7, 12]) along with Boltzmann–Einstein statistics. On the other hand, there\nare still viable reasons [9, 10] why this last point might reasonably be overlooked.]\nEven more recently, Vagenas applied the above machinery to the Kerr or rotating\n(but still uncharged) black hole case [13]. 1 It is worthwhile to first recall the relevant\nthermodynamic quantities for this scenario:\n\u0010\n\u0011\n√\nA = 8π M 2 + M 4 − J 2 ,\n(13)\nT = ~\nΩ =\n\n√\n\nM4 − J2\n√\n\u0001,\n4πM M 2 + M 4 − J 2\nJ\n√\n\u0001.\n2M M 2 + M 4 − J 2\n\n(14)\n(15)\n\nHere, J is the angular momentum of the black hole and Ω is the rotational velocity at its\nhorizon. (Both of which will be regarded as positive, without any loss of generality.)\nAlso of relevance to the current discussion, there has been some recent progress in\nunderstanding the highly damped quasi-normal frequencies for the Kerr solution. In\nfact, an analytic result has now been obtained [17] and, reassuringly, this computation\ncomplies with some older numerical work [18]. Most pertinently, the imaginary part of\nthe frequency ascends asymptotically as\n~ |ωI | ≈ 2πT0 k as k → ∞ ,\n\n(16)\n\nwhereas the real part remains finite. The parameter T0 can be viewed as an effective\n\"temperature\" and is defined by T0 ≡ T (J = 0) = ~/8πM.\nBecause of the simplicity of Eq.(16), it is quite evident that the Kerr analogue of\nMaggiore's revised (Hod) calculation goes through unfettered; so that, once again,\nǫ = 8π .\n\n(17)\n\nIndeed, it is this very universality that was the main observation made by Vagenas.\nUnfortunately, the same type of consistency failed to transpire for the Kerr analogue of\nthe Kunstatter calculation.\nGiven the serious nature of the last claim, let us elaborate much further on this issue.\nWith cognizance of the first law of black hole thermodynamics [19], Vagenas perceptively\ndeduced the Kerr analogue of Kunstatter's adiabatic-invariant integral as being\nZ\ndM − ΩdJ\n.\n(18)\nωc\n1\n\nOther (not necessarily related) derivations of the Kerr quantum area spectrum include [14–16].\n\n4\n\n\fUtilizing Eqs.(15,16) and the Bohr–Sommerfeld quantization condition, one promptly\nobtains\n\u0015\nZ \u0014\nJdJ\n√\n2\n2MdM −\n≈ n~ as n → ∞ .\n(19)\nM2 + M4 − J2\nSome straightforward integration then reveals that 2\n\u0015\n\u0014 2 √ 4\n√\nM + M − J2\n2\n2\n4\n2\n≈ n~ ;\n2M + 2 M − J − 2M ln\n~\n\n(20)\n\nwhich - by way of Eq.(13) - can be reinterpreted as the following quantum spectrum\nfor the area:\n\u0014\n\u0015\nAn\n2\nAn − 8πM ln\n= 4π~n .\n(21)\n8π~\nThe reader has most probably noticed the conspicuous presence of a logarithmic term\nin the spectrum. Certainly, it is true that logarithmic corrections to the horizon area\nhave had a long and storied tradition in the literature [20]. But the key word here is\n\"correction\". In Eq.(21), the logarithmic term becomes the dominant one for any black\nhole larger than (at most) a few hundred Planck areas. Meanwhile, by invoking a semiclassical quantization condition, we are - by implication - talking about black holes\nwith A >> ~. Hence, for the obligatory regime of validity, the spectrum is far from\nevenly spaced (although still discrete). To further complicate matters, A >> ~ ensures\nus that the logarithm is positive, and so the (typically dominant) logarithmic term is\nnegative. Meanwhile, the left-hand side of the equation is, in reality, inherently positive!\n[This follows directly from the first and second laws of thermodynamics; inasmuch as the\nintegrand of Eq.(18) is essentially the (differential) change in entropy of a rotating black\nhole, albeit with an unorthodox choice for the temperature.] Finally, even if there could be\nsome conceivable means of dismissing away the logarithmic term, one would then deduce\na spacing coefficient of ǫ = 4π - disturbingly off by a factor of two from the previous\nKerr result [cf, Eq.(17)].\nSo what exactly went wrong? The problem, as we see it, can be traced to the evaluation\nof Eq.(19), where the integration variables (M and J) have been placed on an equal\nfooting. But such a democracy of variables can not actually be justified. To see this, let\nus first reconsider the application of the Bohr–Sommerfeld quantization condition. This\nimmediately implies a semi-classical regime, which requires n to be a very large number,\nas the area (in Planck units) must be as well. Although not so immediately obvious, the\ndomain of semi-classicality indicates yet another constraint that must inevitably be dealt\nwith. In short, the black hole must be far away from extremality. (Keep in mind that\nthe Kerr extremal limit is J = M 2 . For J > M 2 , the black hole is replaced by a naked\nsingularity, in a grievous violation of cosmic censorship.)\nTo elucidate, it has been demonstrated that, at least in the context of Bekensteininspired spectroscopy, a near-extremal black hole (whether charged [21] and/or rotating\n[22] / [15]) is a highly quantum object. This is because, as clarified in the cited articles, the\nquantum number n is actually a measure of the areal deviation from extremality, rather\nthan the area itself. Meaning that a near-extremal black hole is necessarily associated\n2\n\nWe obtain an ~ in the denominator of the logarithm by cutting the integration off at the Planck\nscale; this being a very natural choice given our ignorance of sub-Planckian physics. Nothing that is said\nbelow will, however, depend on the precise value of this ultraviolet regulator.\n\n5\n\n\fwith a small quantum number, irrespective of its overall size or mass. Hence, for the\nprevious calculation to make sense, it is necessary to restrict ourselves to small values of\nJ; that is, J << M 2 . It should be clear that no such restriction has yet been imposed. 3\nA simple but reasonable way to constrain the angular momentum is to treat the integrand of Eq.(19) as a perturbative expansion in J/M 2 . On this basis, one would be\ninclined to recast the expression as follows:\n\u0015\nZ \u0014\nJ + O(J 3 )\ndJ ≈ n~ .\n(22)\n4MdM −\nM2\nThe integration now leads to\n1 J2\n+ O(J 4 ) ≈ n~\n2\n2M\n\n(23)\n\nM 4 − J 2 + O(J 4 ) ≈ n~ .\n\n(24)\n\n2M 2 −\nor, equivalently,\nM2 +\n\n√\n\nComparing with Eq.(13), we can now extrapolate an area spectral form of\nAn + O(Jn4 ) = 8π~n .\n\n(25)\n\nSo that (for the semi-classical domain of both large n and small J 4 ) the Kerr spectralspacing coefficient is reconfirmed as taking on the universal value of ǫ = 8π. Moreover, the\nonce-dominant logarithmic term has safely been eradicated and both sides of the equation\nare now manifestly positive.\nTo summarize, we have found that - after fully accounting for the semi-classical regime\nof validity - the Kerr area spectrum is asymptotically identical for the two distinct\nmethods of interest. (These being Hod's [4] and Kunstatter's [8], along with the essential\nmodifications suggested by Maggiore [9] and Vagenas [13].) In this way, we have also\nconfirmed - now unambiguously - a universal form [13] for the Schwarzschild and Kerr\nspectra.\n\n3\n\nThe reader may be concerned about n sometimes measuring the area and other times, the areal\nseparation from extremality. However, in the true semi-classical regime - where M 2 >> J and so\nA ≈ 16πM 2 - this distinction is inconsequential.\n4\nIt should be noted that, because J and its corresponding quantum number are now being treated as\nparametrically small quantities, Eq.(25) in no way contradicts any of the spectra documented in [15, 22].\n\n6\n\n\fAcknowledgments\nResearch is financially supported by the University of Seoul. The author thanks Elias\nVagenas for useful discussions.\n\nReferences\n[1] J.D. Bekenstein, Lett. Nuovo Cimento 11, 467 (1974);\nSee, also, \"Quantum Black Holes as Atoms\", arXiv:gr-qc/9710076 (1997).\n[2] J.D. Bekenstein, Phys. Rev. D 7, 2333 (1973).\n[3] See, for instance, M. Domagala and J. Lewandowski, Class. Quant. Grav. 21, 5233\n(2004) [arXiv:gr-qc/0407051].\n[4] S. Hod, Phys. Rev. Lett. 81, 4293 (1998) [arXiv:gr-qc/9812002].\n[5] H.-P. Nollert, Phys. Rev. D 47, 5253 (1993);\nN. Andersson, Class. Quant. Grav. 10, L61 (1993).\n[6] L. Motl, Adv. Theor. Math. Phys. 6, 1135 (2003) [arXiv:gr-qc/0212096];\nL. Motl and A. Neitzke, Adv. Theor. Math. Phys. 7, 307\n[arXiv:hep-th/0301173].\n\n(2003)\n\n[7] S.W. Hawking, Nature 248, 30 (1974); Commun. Math. Phys. 43, 199 (1975).\n[8] G. Kunstatter, Phys. Rev. Lett. 90, 161301 (2003) [arXiv:gr-qc/0212014].\n[9] M. Maggiore, Phys. Rev. Lett. 100, 141301 (2008) [arXiv:0711.3145 (gr-qc)].\n[10] A.J.M. Medved, \"A brief commentary on black hole entropy\", arXiv:gr-qc/0410086\n(2004).\n[11] J.D. Bekenstein and V. Mukhanov, Phys. Lett. B 360, 7 (1995) [gr-qc/9505012].\n[12] J.D. Bekenstein, Lett. Nuovo. Cim. 4, 737 (1972);\nPhys. Rev. D 7, 2333 (1973).\n[13] E.C. Vagenas, \"Area spectrum of rotating black holes via the new interpretation of\nquasinormal modes\", arXiv:0804.3264 [gr-qc] (2008).\n[14] J. Makela, P. Repo, M. Luomajoki and J. Piilonen, Phys. Rev. D 64, 024018 (2001)\n[arXiv:gr-qc/0012005].\n[15] G. Gour and A.J.M.\n[arXiv:gr-qc/0211089].\n\nMedved,\n\nClass.\n\nQuant.\n\nGrav.\n\n20,\n\n2261\n\n(2003)\n\n[16] V.V. Kiselev, \"Quantum spectrum of black holes\", arXiv:gr-qc/0509038 (2005).\n[17] U. Keshet and S. Hod, Phys. Rev. D 76, 061501 (2007) [arXiv:0705.1179 (gr-qc)];\nU. Keshet and A. Neitzke, \"Asymptotic Spectroscopy of Rotating Black Holes\",\narXiv:0709.1532 [hep-th] (2007).\n7\n\n\f[18] E. Berti, V. Cardoso and S. Yoshida, Phys. Rev. D 69, 124018 (2004)\n[arXiv:gr-qc/0401052].\n[19] J.M. Bardeen, B. Carter and S.W. Hawking, Comm. Math. Phys. 31, 161 (1973).\n[20] See, for an overview and references, D.N. Page, New J. Phys. 7, 203 (2005)\n[arXiv:hep-th/0409024].\n[21] A. Barvinsky, S. Das and G. Kunstatter, Class. Quant. Grav. 18, 4845 (2001)\n[arXiv:gr-qc/0012066].\n[22] G. Gour and A.J.M.\n[arXiv:gr-qc/0212021].\n\nMedved,\n\nClass.\n\n8\n\nQuant.\n\nGrav.\n\n20,\n\n1661\n\n(2003)\n\n\f"}