{"id": "http://arxiv.org/abs/1112.1041v1", "guidislink": true, "updated": "2011-12-05T19:57:44Z", "updated_parsed": [2011, 12, 5, 19, 57, 44, 0, 339, 0], "published": "2011-12-05T19:57:44Z", "published_parsed": [2011, 12, 5, 19, 57, 44, 0, 339, 0], "title": "Stabilization of Branching Queueing Networks", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1112.4239%2C1112.0141%2C1112.0258%2C1112.2729%2C1112.2023%2C1112.5847%2C1112.3748%2C1112.0160%2C1112.4891%2C1112.5157%2C1112.3901%2C1112.5510%2C1112.0044%2C1112.5838%2C1112.0719%2C1112.1897%2C1112.1366%2C1112.4878%2C1112.1696%2C1112.5836%2C1112.6187%2C1112.3531%2C1112.4192%2C1112.2883%2C1112.0937%2C1112.1074%2C1112.6129%2C1112.0754%2C1112.5256%2C1112.0069%2C1112.5046%2C1112.0189%2C1112.0553%2C1112.5268%2C1112.4524%2C1112.4533%2C1112.3994%2C1112.4169%2C1112.1544%2C1112.5514%2C1112.6083%2C1112.0428%2C1112.3334%2C1112.5628%2C1112.4907%2C1112.2847%2C1112.3268%2C1112.1419%2C1112.4176%2C1112.0711%2C1112.1076%2C1112.5426%2C1112.6307%2C1112.1396%2C1112.3455%2C1112.2788%2C1112.3060%2C1112.6279%2C1112.4391%2C1112.4103%2C1112.5971%2C1112.4017%2C1112.2641%2C1112.2546%2C1112.4874%2C1112.1378%2C1112.4153%2C1112.0345%2C1112.4658%2C1112.3573%2C1112.2564%2C1112.2425%2C1112.3946%2C1112.6365%2C1112.3956%2C1112.4873%2C1112.0017%2C1112.1131%2C1112.0558%2C1112.0477%2C1112.1333%2C1112.3732%2C1112.3613%2C1112.4138%2C1112.0099%2C1112.4974%2C1112.6025%2C1112.4304%2C1112.0537%2C1112.0735%2C1112.4062%2C1112.3841%2C1112.1041%2C1112.4267%2C1112.1324%2C1112.1026%2C1112.5613%2C1112.2714%2C1112.0029%2C1112.5485%2C1112.5217&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Stabilization of Branching Queueing Networks"}, "summary": "Queueing networks are gaining attraction for the performance analysis of\nparallel computer systems. A Jackson network is a set of interconnected\nservers, where the completion of a job at server i may result in the creation\nof a new job for server j. We propose to extend Jackson networks by \"branching\"\nand by \"control\" features. Both extensions are new and substantially expand the\nmodelling power of Jackson networks. On the other hand, the extensions raise\ncomputational questions, particularly concerning the stability of the networks,\ni.e, the ergodicity of the underlying Markov chain. We show for our extended\nmodel that it is decidable in polynomial time if there exists a controller that\nachieves stability. Moreover, if such a controller exists, one can efficiently\ncompute a static randomized controller which stabilizes the network in a very\nstrong sense; in particular, all moments of the queue sizes are finite.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1112.4239%2C1112.0141%2C1112.0258%2C1112.2729%2C1112.2023%2C1112.5847%2C1112.3748%2C1112.0160%2C1112.4891%2C1112.5157%2C1112.3901%2C1112.5510%2C1112.0044%2C1112.5838%2C1112.0719%2C1112.1897%2C1112.1366%2C1112.4878%2C1112.1696%2C1112.5836%2C1112.6187%2C1112.3531%2C1112.4192%2C1112.2883%2C1112.0937%2C1112.1074%2C1112.6129%2C1112.0754%2C1112.5256%2C1112.0069%2C1112.5046%2C1112.0189%2C1112.0553%2C1112.5268%2C1112.4524%2C1112.4533%2C1112.3994%2C1112.4169%2C1112.1544%2C1112.5514%2C1112.6083%2C1112.0428%2C1112.3334%2C1112.5628%2C1112.4907%2C1112.2847%2C1112.3268%2C1112.1419%2C1112.4176%2C1112.0711%2C1112.1076%2C1112.5426%2C1112.6307%2C1112.1396%2C1112.3455%2C1112.2788%2C1112.3060%2C1112.6279%2C1112.4391%2C1112.4103%2C1112.5971%2C1112.4017%2C1112.2641%2C1112.2546%2C1112.4874%2C1112.1378%2C1112.4153%2C1112.0345%2C1112.4658%2C1112.3573%2C1112.2564%2C1112.2425%2C1112.3946%2C1112.6365%2C1112.3956%2C1112.4873%2C1112.0017%2C1112.1131%2C1112.0558%2C1112.0477%2C1112.1333%2C1112.3732%2C1112.3613%2C1112.4138%2C1112.0099%2C1112.4974%2C1112.6025%2C1112.4304%2C1112.0537%2C1112.0735%2C1112.4062%2C1112.3841%2C1112.1041%2C1112.4267%2C1112.1324%2C1112.1026%2C1112.5613%2C1112.2714%2C1112.0029%2C1112.5485%2C1112.5217&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Queueing networks are gaining attraction for the performance analysis of\nparallel computer systems. A Jackson network is a set of interconnected\nservers, where the completion of a job at server i may result in the creation\nof a new job for server j. We propose to extend Jackson networks by \"branching\"\nand by \"control\" features. Both extensions are new and substantially expand the\nmodelling power of Jackson networks. On the other hand, the extensions raise\ncomputational questions, particularly concerning the stability of the networks,\ni.e, the ergodicity of the underlying Markov chain. We show for our extended\nmodel that it is decidable in polynomial time if there exists a controller that\nachieves stability. Moreover, if such a controller exists, one can efficiently\ncompute a static randomized controller which stabilizes the network in a very\nstrong sense; in particular, all moments of the queue sizes are finite."}, "authors": ["Tomáš Brázdil", "Stefan Kiefer"], "author_detail": {"name": "Stefan Kiefer"}, "author": "Stefan Kiefer", "arxiv_comment": "technical report for a STACS'12 paper", "links": [{"href": "http://arxiv.org/abs/1112.1041v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1112.1041v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cs.PF", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cs.PF", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1112.1041v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1112.1041v1", "journal_reference": null, "doi": null, "fulltext": "Stabilization of Branching Queueing Networks∗\nTomáš Brázdil1 and Stefan Kiefer2\n1\n\nFaculty of Informatics, Masaryk University, Czech Republic\nbrazdil@fi.muni.cz\nDepartment of Computer Science, University of Oxford, United Kingdom\nstefan.kiefer@cs.ox.ac.uk\n\n2\n\narXiv:1112.1041v1 [cs.PF] 5 Dec 2011\n\nAbstract\nQueueing networks are gaining attraction for the performance analysis of parallel computer systems. A Jackson network is a set of interconnected servers, where the completion of a job at\nserver i may result in the creation of a new job for server j. We propose to extend Jackson\nnetworks by \"branching\" and by \"control\" features. Both extensions are new and substantially\nexpand the modelling power of Jackson networks. On the other hand, the extensions raise computational questions, particularly concerning the stability of the networks, i.e, the ergodicity of\nthe underlying Markov chain. We show for our extended model that it is decidable in polynomial time if there exists a controller that achieves stability. Moreover, if such a controller exists,\none can efficiently compute a static randomized controller which stabilizes the network in a very\nstrong sense; in particular, all moments of the queue sizes are finite.\n1998 ACM Subject Classification G.3 Probability and Statistics\nKeywords and phrases continuous-time Markov decision processes, infinite-state systems, performance analysis\n\n1\n\nIntroduction\n\nQueueing theory plays a central role in the performance analysis of computer systems. In\nparticular, queueing networks are gaining attraction as models of parallel systems. A queueing\nnetwork is a set of processing units (called servers), each of which performs tasks (called\njobs) of a certain type. Each server has its own queue of jobs waiting to be processed. The\nsuccessful completion of a job may trigger one (or more) new jobs (of possibly different type)\nthat need to be processed as well. In addition to this \"internal\" job creation, so-called open\nqueueing networks allow for new jobs to arrive \"externally\", i.e., from outside.\nQueueing networks are a popular model for both hardware and software systems because\nof their simplicity and generality. On the hardware side, queueing networks can, e.g., be used\nfor modeling multi-core processors, see e.g. [30] and the references in [9]. One advantage of\nqueueing-based analyses is their scalability with growing parallelism; e.g., it is said in [21]:\n\"Cycle-accurate full-system performance simulators do not scale well beyond a few tens of\nprocessor cores at best. As such, analytical models based on the theory of queueing systems,\nare a logical choice for developing a basic understanding of the fundamental tradeoffs in\nfuture, large-scale multi-core systems.\" On the software side, queueing networks are used for\nmodeling message passing. It is said in [29]: \"Two natural classes of systems can be modeled\nusing such a framework: asynchronous programs on a multi-core computer and distributed\nprograms communicating on a network.\" Of course, the realm of queueing networks stretches\nfar beyond computer science, see [5, 8].\n\n∗\n\nS. Kiefer is supported by a DAAD postdoctoral fellowship.\n© Tomáš Brázdil and Stefan Kiefer;\nlicensed under Creative Commons License NC-ND\nLeibniz International Proceedings in Informatics\nSchloss Dagstuhl – Leibniz-Zentrum für Informatik, Dagstuhl Publishing, Germany\n\n\f2\n\nStabilization of Branching Queueing Networks\n\nThe simplest queueing networks are so-called Jackson networks [16]: Given two servers\npij\n\ni, j ∈ {1, . . . , n}, there is a \"rule\" of the form i ,−−→ j which specifies the probability pij that\npi0\nthe completion of an i-job results in the creation of a j-job. There are also rules i ,−−→ ε\nP\nwhere pi0 = 1 − j pij specifies the probability that no new job is created. Each server i has\na rate μi with which an i-job is processed if there is one. In addition, there is a rate αi with\nwhich i-jobs arrive from outside the network. The processing times and the external arrivals\nare exponentially distributed, so that a Jackson network describes a continuous-time Markov\nchain (CTMC). It was shown in Jackson's paper [16] that if the rate λi of internal and\nexternal arrivals at server i is less than μi for all i, then the network is stable, i.e., the average\nqueue length is finite and almost surely all queues are empty infinitely often. Moreover,\nJackson networks allow a product form, i.e., the steady-state distribution of the queue lengths\ncan be expressed as a product of functions πi (k), where πi (k) is the steady-state probability\nthat queue i has length k.\nI Example 1 (network processor). In [1], Jackson networks are used to model network\nprocessors, i.e., chips that are specifically targeted at networking applications-think of a\nrouter. We describe the model from [1] (sections 4.1 and 4.2, slightly adapted). Before\npackets are processed in the \"master processor\" M , they pass through the \"data plane\" D,\nfrom which a fraction q of packets needs to be processed first in the \"control plane\" C:\n1−q\n\nD ,−−→ M\n\nq\n\nD ,−\n→C\n\n1\n\nC ,−\n→M\n\n1\n\nM ,−\n→ε\n\nAn \"arrival manager\" A sends some packets (fraction d0 ) directly to D, but others (fractions d1 , . . . , dn with d0 + d1 + * * * + dn = 1) are sent to \"slave processors\" S1 , . . . , Sn to assist\nthe master. Some packets (fraction b) still need the attention of the master after having been\nprocessed by a slave:\nd0\n\nA ,−→ D\n\ndi\n\nA ,−\n→ Si\n\nb\n\nSi ,−\n→D\n\n1−b\n\nSi ,−−→ ε\n\n,\n\ni ∈ {1, . . . , n}.\n\nJackson networks and their extensions have been thoroughly studied, but they are\nrestricted in their modelling capabilities, as (i) the completion of a job may trigger at\nmost one job, and (ii) there is no nondeterminism that would allow to control the output\nprobabilities of a server. Considering (i), it seems unnatural to assume that a distributed\nprogram communicating on a network produces at most one message at the end of its\ncomputation. Considering (ii), the \"arrival manager\" A in Example 1 may want to flexibly\npass incoming packets to the master or one of the slaves, possibly depending on the current\nload. These restrictions have not been fully addressed, not even in isolation. In this paper we\nintroduce controlled branching queueing networks, which are Jackson-like networks but allow\nfor both nondeterminism (\"controlled\") and the creation of more than one job (\"branching\").\nBoth extensions directly raise computational issues. We show in Example 2 on page 5\nthat even purely stochastic branching networks do not allow a product form, which illustrates\nthe mathematical challenge1 of this extension and poses the question for an effective criterion\nthat allows to determine whether the network is stable, i.e., returns to the empty state\ninfinitely often. Moreover, due to the nondeterminism, we now deal with continuous-time\nMarkov decision processes (CTMDPs). Our main theorem (Theorem 3) states that if there\nexists any scheduler resolving the nondeterminism in such a way that the controlled branching\n\n1\n\nIt is noted in [15] that \"[. . . ] virtually all of the models that have been successfully analyzed in classical\nqueueing network theory are models having a so-called product form stationary distribution.\"\n\n\fT. Brázdil and S. Kiefer\n\nnetwork is stable, then there exists a randomized static scheduler that achieves stability as\nwell, where by \"randomized static\" we mean that the decisions may be randomized but not\ndependent on the current state (such as the load) of the system. Moreover, the existence of\nsuch a stabilizing scheduler and the scheduler itself can be determined in polynomial time,\nand, finally, the randomized static scheduler is stabilizing in a very strong sense, in particular,\nall moments of the queue sizes are finite.\nRelated work. We use nondeterminism to describe systems whose behaviour is not\ncompletely specified. A system designer can then resolve the nondeterminism to achieve\ncertain goals, in our case stability. Although nondeterminism is a very well established\nmodelling feature of probabilistic systems (see e.g. [20]), the literature on automatic design\nof stabilizing controllers for queueing networks is sparse. Flow-controlled networks [28, 22]\nallow to control only the external arrival stream or the service rates (see also [2] and the\nreferences therein). The authors of [19, 14] consider queueing networks with fewer servers\nthan job types, so that the controller needs to assign servers to queues. As in [19, 14], we\nalso use linear programming to design a controller, but our aim is different: we allow the\ncontroller to influence the production of the individual queues, and we study the complexity\nof designing stabilizing controllers and the nature of such controllers. There has been a\nsubstantial amount of work in the last years analyzing probabilistic systems with \"branching\nfeatures\", most prominently on recursive Markov chains [13, 12] and probabilistic pushdown\nsystems [11, 6]. While these models allow for a probabilistic splitting of tasks by pushing\nnew procedures on a stack, the produced tasks are processed in a strictly sequential manner,\nwhereas the queues in a queueing network process jobs in parallel and in continuous time.\nRecently, probabilistic split-join systems were introduced [17], which allow for branching but\nnot for external arrivals, and assume unlimited parallelism. In [18, chapter 8] a queueing\nmodel with multiple classes of tasks and \"feedback\" is discussed, which is similar to our\nbranching except that there is only one server, hence there is no parallelism. Algorithmic\ntheory of queueing systems has also attracted some attention in the past. In particular, for\nclosed (i.e., without external arrivals) queueing systems, [26] shows EXP-completeness of\nminimizing a weighted throughput of the queues.\n\n2\n\nPreliminaries\n\nNumbers. We use Z, Q, R for the sets of integer, rational, real numbers, respectively, and\nN, Q≥0 , R≥0 for their respective subsets of nonnegative numbers.\nVectors and Matrices. Let n ≥ 1. We use boldface letters for denoting vectors x =\n(x1 , . . . , xn ) ∈ Rn . Vectors are row vectors per default, and we use superscript T for\ntranspose, so that xT denotes a column vector. If the dimension n is clear from the context,\nwe write 0 := (0, . . . , 0), 1 := (1, . . . , 1), and e(i) = (0, . . . , 0, 1, 0, . . . , 0) for the vector with\nthe 1 at the ith component (1 ≤ i ≤ n). It is convenient to define e(0) := 0. For two\nvectors x, y ∈ Rn we write x ∼ y with ∼ ∈ {=, <, ≤, >, ≥} if the respective relation holds\nPn\ncomponentwise. For a vector x ∈ Rn we denote its 1-norm by kxk := i=1 |xi |. When\nx ∈ Nn is a vector of queue sizes, we refer to kxk as the total queue size. For a matrix\nA ∈ Rn×n , we write Ai for its ith row, i.e., Ai = (Ai1 , . . . , Ain ).\nCTMDP. A continuous-time Markov decision process (CTMDP) consists of an at most\ncountable set S of states, an initial state s1 ∈ S, a set of actions Σ 2 , and a transition rate\n2\n\nUsually, each state has its own set of available actions. As this feature is not needed for queueing\nnetworks, we stick to the simpler version in which all actions are always available.\n\n3\n\n\f4\n\nStabilization of Branching Queueing Networks\n\nq(s, σ, s0 ) ≥ 0 for each pair of states s, s0 ∈ S and each action σ ∈ Σ (here q(s, σ, s0 ) = 0\nmeans that the transition from s to s0 never occurs). We define a continuous-time Markov\nchain (CTMC) to be a CTMDP whose set of actions Σ is a singleton (we usually do not\nwrite the only action explicitly, so the transition rates of a CTMC are denoted by q(s, s0 ),\netc.).\nIntuitively, a run of a CTMDP starts in s1 and then evolves in so-called epochs. Assume\nthat (after the previous epoch) the system is in a state s. The next epoch consists of the\nfollowing phases: First, a scheduler chooses an action σ ∈ Σ to be executed. Second, a waiting\ntime for transition to each state s0 ∈ S is chosen according to the exponential distribution\nwith the rate q(s, σ, s0 ) (here we assume that if q(s, σ, s0 ) = 0, then the waiting time is ∞).\nThe transitions compete in a way such that the one with the least waiting time is executed\nand the state of the CTMDP is chosen accordingly (the other transitions are subsequently\ndiscarded).\nFormally, a run is an infinite sequence s1 , σ1 , t1 , s2 , σ2 , t2 , . . . ∈ (S × Σ × R≥0 )ω . We\ndenote by Run the set of all runs. A scheduler is a function Θ which assigns to every finite\npath s1 , σ1 , t1 , s2 , σ2 , t2 , . . . sn ∈ (S × Σ × R≥0 )∗ × S a probability distribution Θ(w) on\nP\nactions (i.e. Θ(w) : Σ → [0, 1] satisfies σ∈Σ Θ(w)(σ) = 1). For technical reasons, we have\nto restrict ourselves to measurable schedulers (for details see e.g. [24]).\nWe work with a measurable space of runs (Run, F) where F is the smallest σ-algebra\ngenerated by basic cylinders (i.e. sets of runs with common finite prefix) in a standard\nway. Every scheduler Θ induces a unique probability measure PrΘ on F determined by the\nprobabilities of the basic cylinders. For detailed definitions see [24]. Then each scheduler Θ\ninduces a stochastic process (x(t) | t ∈ R≥0 ) on the probability space (Run, F, PrΘ ) where\nx(t) is the current state of the run in time t, i.e., each x(t) is a random variable defined by\nx(t)(s1 , σ1 , t1 , s2 , σ2 , t2 , . . .) = si\n\n,\n\ni−1\nX\nj=1\n\nti ≤ t and\n\ni\nX\n\nti ≥ t .\n\nj=1\n\nA scheduler Θ is memoryless if for every path w = s1 , σ1 , t1 , s2 , σ2 , t2 , . . . sn+1 ∈ (S × Σ ×\nR≥0 )∗ × S we have that Θ(w) = Θ(sn+1 ).\nNetworks. Define R(n,K) := {r ∈ Nn | r 1 + * * * + r n ≤ K}. A production function for\nP\n(n, K) is a function Prob : R → Q ∩ (0, 1] with R ⊆ R(n,K) such that r∈R Prob(r) = 1. A\ncontrolled branching network with n queues and branching factor K consists of an arrival\nrate μ0 ∈ Q ∩ (0, ∞), queue rates μi ∈ Q ∩ (0, ∞) for i ∈ {1, . . . , n}, an arrival production\nfunction Prob0 : R0 → Q ∩ (0, 1] for (n, K), and finite action sets Σ1 , . . . , Σn as follows. An\naction σi ∈ Σi assigns to queue i a production function Probi (σi ) : Ri (σi ) → Q ∩ (0, 1] for\n(n, K). Define Σ := Σ1 × * * * × Σn . If σ = (σ1 , . . . , σn ) ∈ Σ, we write Ri (σ), Probi (σ) and\nR0 (σ), Prob0 (σ) to mean Ri (σi ), Probi (σi ) and R0 , Prob0 . Observe that the rates μi do not\ndepend on actions. This simplification is without loss of generality.3 We assume a nonzero\narrival stream, i.e., there is r ∈ R0 with r 6= 0. We define the size of a controlled network\nPn\nPn P\nby n + K + ( i=0 |μi |) + |R0 | + |Prob0 | + i=1 σi ∈Σi |Ri (σi )| + |Probi (σi )|, where |μi | etc.\nmeans the description size assuming the rationals are represented as fractions of integers in\n\n3\n\nTo show that this assumption is w.l.o.g. one can employ the standard \"uniformization\" trick. More\nprecisely, assume that the actions of a queue i have different rates. Define μi to be the maximum of\nall rates of Σi and compensate by \"adding self-loops\", i.e., make the actions of Σi generate a new job\nfor queue i with a suitable probability. This effectively substitutes a transition with longer delay by\npossibly several transitions with delay μi . As static schedulers can be easily translated between the\noriginal and the transformed system, our results remain valid.\n\n\fT. Brázdil and S. Kiefer\n\n5\n\nbinary. A controlled branching network induces a CTMDP with state space Nn (the queue\nsizes), initial state 0, action set Σ, and transition rates\nX\nX\nq(x, σ, y) =\nμi Probi (σ)(r)\nfor x, y ∈ Nn , σ ∈ Σ.\ni∈{0,1,...,n}:i=0∨xi 6=0 r∈Ri (σ):y=x−e(i) +r\n\nInterpreting this definition, there is a \"race\" between external arrivals (rate μ0 ) and the\nnonempty queues (rates μi ); if the external arrivals win, new jobs are added according\nto Prob0 (σ); if queue i wins, one i-job is removed and new jobs are added according\nto Probi (σ).\nAn purely stochastic branching network is a controlled branching network with Σ = {σ},\ni.e., with a unique action for each queue. Hence, the induced CTMDP is a CTMC. In the\npurely stochastic case we write only Ri for Ri (σ) etc. If Probi (r) = p in the purely stochastic\np\ncase, we use in examples the notation i ,−\n→ r, where we often write r ∈ R(n,K) as a multiset\np\np\np\nwithout curly brackets. For instance, if n = 2, we write 1 ,−\n→ 1, 2 and 1 ,−\n→ 2, 2 and 1 ,−\n→ ε to\nmean Prob1 (r) = p with r = (1, 1) and r = (0, 2) and r = (0, 0), respectively.\nFixing a controlled network N and a scheduler Θ for the CTMDP induced by N , we\nobtain a stochastic process NΘ = (x(t) | t ∈ R≥0 ), where x(0) = 0 ∈ Nn , which evolves\naccording to the dynamics of N and the scheduler Θ. In the purely stochastic case we drop\nthe subscript Θ, and so we identify a network N with its induced stochastic process.\nI Example 2 (no product form). Consider the purely stochastic branching network with\n1\n\n1\n\n1\n\n0 ,−\n→ 1, 2 and 1 ,−\n→ ε and 2 ,−\n→ ε. If its stationary distribution π (for a definition of stationary\ndistribution see before Theorem 3) had product from, the queues would be \"independent in\nsteady-state\", i.e., π(x2 ≥ 1 | x1 ≥ 1) = π(x2 ≥ 1), where by x we mean x(t) in steady state.\nHowever, if μ0 is much smaller than μ1 = μ2 , then we have π(x2 ≥ 1 | x1 ≥ 1) > π(x2 ≥ 1),\nintuitively because x1 ≥ 1 probably means that there was an arrival recently, so that x2 ≥ 1\nis more likely than usual. More concretely, let μ0 = 1 and μ1 = μ2 = 3 and consider the\n2-state Markov chain obtained by assuming that each arrival leads to the state (1, 1) and each\ncompletion of any job leads to the state (0, 0). By computing the stationary distribution π 0 of\nthis 2-state Markov chain in the standard way, we obtain π 0 ((0, 0)) = 6/7 and π 0 ((1, 1)) = 1/7.\nSince this 2-state Markov chain \"underapproximates\" the CTMC induced by the network,\nwe have π(x1 ≥ 1 ∧ x2 ≥ 1) ≥ 1/7. On the other hand, by considering the two queues\nseparately, the standard formula for the M/M/1 queue gives π(x1 ≥ 1) = π(x2 ≥ 1) = 1/3.\nProduct form would imply π(x1 ≥ 1 ∧ x2 ≥ 1) = π(x1 ≥ 1) * π(x2 ≥ 1) = 1/9, contradicting\nthe inequality above.\n\n3\n\nResults\n\nWe focus on the stability of purely stochastic and controlled branching networks. Our notion\nof stability requires that the network is completely empty infinitely many times. Given a\nstochastic process (x(t) | t ∈ R≥0 ), we say that the process is ergodic if the expected return\ntime to 0 is finite. More formally, define a random variable R by\nR\n\n:=\n\ninf {t | x(t) = 0, ∃t0 < t : x(t0 ) 6= 0} .\n\nt>0\n\nThen the process is ergodic iff E [R] < ∞. In the controlled case, we say that a scheduler Θ\nfor N is ergodic for N if NΘ is ergodic. In the following we use stability and ergodicity\ninterchangeably. A scheduler Θ is static if it always chooses the same fixed distribution on\nactions. Note that static schedulers are memoryless. If in a stochastic process (x(t) | t ∈ R≥0 )\n\n\f6\n\nStabilization of Branching Queueing Networks\n\nthe limit π(x) := limt→∞ Pr(x(t) = x) exists for all x ∈ Nn and\nπ : R≥0 → [0, 1] is called the stationary distribution.\n\nP\n\nx∈Nn\n\nπ(x) = 1, then\n\nI Theorem 3. Let N be a controlled branching network. It is decidable in polynomial time\nwhether there exists an (arbitrary) ergodic scheduler for N . If it exists, one can compute, in\npolynomial time, a static randomized ergodic scheduler for N with stationary distribution π\nsuch that there exists an exponential moment of the total number of waiting jobs, i.e., there\nP\nis δ > 0 such that x∈Nn exp(δ kxk)π(x) exists.\nTo prove Theorem 3 we generalize the concept of traffic equations (see e.g. [7]) from the\ntheory of Jackson networks. Intuitively, the traffic equations express the fact that the inflow\nof jobs to a given queue must be equal to the outflow. Remarkably, the traffic equations\ncharacterize the stability of the Jackson network. More precisely, a Jackson network is stable\nif and only if there is a solution of the traffic equations whose components are strictly smaller\nthan the rates of the corresponding queues (we call such a solution deficient).\nWe show how to extend the traffic equations so that they characterize the stability of\ncontrolled branching networks. For a smooth presentation, we start with purely stochastic\nbranching networks and add control later on. Hence, the overall plan of the proof of Theorem 3\nis as follows: Set up traffic equations for purely stochastic branching networks and show\nthat if there is a deficient solution of these equations, then the network is stable. This\nresult, presented in Section 3.1 (Proposition 4), is of independent interest and requires the\nconstruction of a suitable Lyapunov function. Then, in Section 3.2, we generalize the traffic\nequations to controlled branching networks and show that any ergodic scheduler determines\na deficient solution (Proposition 10). This solution naturally induces a static scheduler,\nwhich, when fixed, determines an purely stochastic network with deficiently solvable traffic\nequations. Propositions 4 and 10 imply Theorem 3 and provide some additional results.\n\n3.1\n\nPurely stochastic branching networks\n\nAssume that N is purely stochastic, i.e., there is a single action for each queue. In such a case\nthe CTMDP induced by the network is in fact a CTMC. We associate the following quantities\nto a network, which will turn out to be crucial for its performance. Let μ := (μ1 , . . . , μn ).\nP\nLet α ∈ Rn≥0 be the vector with αi := μ0 r∈R0 Prob0 (r)r i ; i.e., αi indicates the expected\nnumber of external arrivals at queue i per time unit. Note that α 6= 0, as we assume a\nP\nnonzero arrival stream. Let A ∈ Rn×n\n≥0 be the matrix with Aij :=\nr∈Ri Prob i (r)r j ; i.e., Aij\nindicates the expected production of j-jobs when queue i fires. W.l.o.g. we assume that all\nqueues are \"reachable\", i.e., for all queues i there is j ∈ N with (αAj )i =\n6 0. We define a set\nof traffic equations\nλj\n\n=\n\nαj +\n\nn\nX\n\nλi * Aij\n\n,\n\nj ∈ {1, . . . , n},\n\n(1)\n\ni=1\n\nin matrix form:\nλ = α + λA .\n\n(2)\n\nWe prove the following proposition.\nI Proposition 4. Assume that λ ∈ Rn≥0 solves the traffic equations (2) and satisfies λ < μ.\nThen the following conclusions hold:\n1. The process N is ergodic, i.e., the expected return time to 0 is finite.\n\n\fT. Brázdil and S. Kiefer\n\n7\n\n2. There exists a stationary distribution π such that there exists an exponential moment of\nP\nthe total queue size, i.e., there is δ > 0 such that x∈Nn exp(δ kxk)π(x) exists.\nThe key step to the proof of Proposition 4 is to construct a so-called Lyapunov function with\nrespect to which the process N exhibits a \"negative drift\". This is in fact a classical technique\nfor showing the stability of queueing systems [23]; the difficulty lies in finding a suitable\nLyapunov function. The \"drift\" of N is given by the mean velocity vector ∆(x) ∈ Rn≥0\nof N , defined by ∆(x) := limh→0+ E [x(t + h) − x(t) | x(t) = x] /h. The limit exists, is\nindependent of t, and we have\nX\n∆(x) = α +\nμi (−e(i) + Ai ) .\n(3)\ni:xi 6=0\n\nThe following lemma is implicitly proved in [10, theorem 1].\nI Lemma 5. Suppose that a function Ve : Rn≥0 → R≥0 is two times continuously differentiable,\nVe (x) = 0 implies x = 0, and that there is γ > 0 such that we have\n∆(x) Ve 0 (x)\n\n\u0001T\n\n≤ −γ\n\nfor all x 6= 0,\n\nwhere Ve 0 (x) denotes the gradient of Ve at x. Then the conclusions of Proposition 4 holds.\nFollowing [10], we construct the Lyapunov function Ve in two stages: we first define a suitable\npiecewise linear function V : Nn → R≥0 ; then V is smoothed to obtain Ve . For the definition\nof V we need the following lemma.\nP∞\nI Lemma 6. The matrix series A∗ := i=0 Ai converges (\"exists\") in Rn×n\n≥0 and is equal to\n(I − A)−1 .\nDefine vectors q (1) , . . . , q (n) ∈ Rn≥0 by setting q (i)T := a(i)T / a(i) , where a(i)T is the ith\ncolumn of A∗ . Observe that we have 1q (i)T = 1 for all i. Define the function V : Rn≥0 → R≥0\nby V (x) := maxi {xq (i)T }. We will use the following property of V :\nI Lemma 7. If 0 6= x ∈ Rn≥0 and xi = 0, then xq (i)T < V (x).\nLemma 7 is not obvious; in the appendix we use Farkas' lemma for the proof. The following\nlemma describes the crucial \"negative drift\" property of V :\nI Lemma 8. There is γ > 0 such that we have\n\u0001T\n∆(x) V 0 (x) ≤ −γ\nfor all x 6= 0\nand all subgradient vectors V 0 (x) of V at x. More precisely, one can choose\nγ := min(μi − λi )/ a(i) ,\ni\n\nwhere a(i)T is the ith column of A∗ .\nI Example 9. Consider the network with\n1/5\n\n1\n\n0 ,−\n→1\n\n1 ,−−→ 2, 2\n4/5\n\n1 ,−−→ ε\n\n1/6\n\n2 ,−−→ 1, 2\n5/6\n\n,\n\n2 ,−−→ ε\n\narrival rate μ0 = 7/30, and μ = (5/12, 7/20), so that μ0 + μ1 + μ2 = 1. Let us write\n[0] := α = μ0 (1, 0), [1] := μ1 (−e(1) + A1 ), [2] := μ2 (−e(2) + A2 ), [01] := [0] + [1],\n\n\f8\n\nStabilization of Branching Queueing Networks\n\nx2\n3\nx2\n0.2\n2\n\n[1]\n[2]\n\n[01]\n[0]\n\nx1\n\n0.2\n\n1\n\n[012]\n[02]\n\n[012]\n[02]\n\n[2]\n\n[0]\n\n[1]\n\n[01]\n1\n\n(a)\n\n2\n\n3\n\nx1\n\n(b)\n\nFigure 1 Illustration of negative drift.\n\n[02] := [0] + [2], [012] := [0] + [1] + [2]. These vectors are shown in Figure 1 (a). The\nmean velocity vector ∆(x) is one of the vectors [0], [01], [02], [012], depending on which\ncomponents of x are nonzero. The vector field in Figure 1 (b) shows the corresponding\nvectors for several x ∈ N2 . The connected line segments indicate points x with the same\nvalue of V (x) = max{xq (1)T , xq (2)T } = max{ 56 x1 + 16 x2 , 27 x1 + 57 x2 } (values 0.5, 1, 1.5, . . .).\nIt can be seen from the figure that the drift is negative with respect to the gradient of V , if\nx 6= 0.\nProof of Lemma 8. Let x 6= 0. We need to show ∆(x)q (i)T ≤ −γ for all i with xq (i)T =\nV (x). W.l.o.g. we assume that xq (1)T = V (x) and show only ∆(x)q (1)T ≤ −γ. By Lemma 7\nwe have x1 6= 0. It follows from the property (I − A)A∗ = I and the definition of q (1) that\nwe have\n(−e(1) + A1 )q (1)T = −1/ a(1)\n\nand\n\n(−e(i) + Ai )q (1)T = 0\n\nfor 2 ≤ i ≤ n. (4)\n\nHence we have:\n\n∆(x)q (1)T = α +\n\n\nX\n\nμi (−e(i) + Ai ) q (1)T\n\nby (3)\n\ni:xi 6=0\n\n= αq (1)T − μ1 / a(1)\n\nby (4) and x1 6= 0\n\n≤ −γ + αq (1)T − λ1 / a(1)\n= −γ +\n\nα+\n\nn\nX\n\nby the definition of γ\n!\n\nλi (−e(i) + Ai ) q (1)T\n\nby (4)\n\ni=1\n\n= −γ + (α + λ(−I + A)) q (1)T\n= −γ + 0q (1)T = −γ\n\nby the traffic equation.\nJ\n\n\fT. Brázdil and S. Kiefer\n\n9\n\nUsing integration, one can obtain a two times continuously differentiable function Ve satisfying\nthe conditions in Lemma 5: the function V is smoothed by defining Ve (x), for all x, as an\n\"average\" of the values V (y) where y belongs to a small ball around x; see the appendix\nof [10] for the formal details. This concludes the proof of Proposition 4.\n\n3.2\n\nControlled branching networks\n\nIn this subsection we generalize the traffic equations (2) to deal with an arbitrary controlled\nbranching network N . To obtain a distribution on actions for a static randomized ergodic\nscheduler, we assign variables to actions instead of queues, i.e., for every action ξ of the\nnetwork we introduce a variable λξ capturing the rate of firing the action ξ. Denote by Σ̄\nSn\nthe set i=1 Σi . Given ζ ∈ Σ̄ and j ∈ {1, . . . , n}, we denote by Aζj the average number of\njobs added to the queue j when the action ζ fires, i.e., for ζ ∈ Σi we set\nX\nAζj :=\nProbi (ζ)(r) * r j .\nr∈Ri (ζ)\n\nWe generalize (2) to the traffic LP presented in Figure 2, where the variable δ is intended to\nbound, for all j, the probability that queue j is busy.\n\nmin δ subject to\n\nX\n\nλξ\n\n=\n\nαj +\n\nn X\nX\n\nλζ * Aζj\n\nj ∈ {1, . . . , n}\n\ni=1 ζ∈Σi\n\nξ∈Σj\n\nP\nδ\n\n≥\n\nλξ\n\n≥\n\nξ∈Σj\n\nλξ\n\nμj\n0\n\nj ∈ {1, . . . , n}\nξ ∈ Σ̄\n\nFigure 2 The traffic LP.\n\nWe prove the following\nI Proposition 10.\n1. If there exists an arbitrary ergodic scheduler for N , then the traffic LP can be solved with\nmin δ < 1.\n2. If the traffic LP is solved with min δ < 1, one can compute in polynomial time a\nstatic randomized ergodic scheduler Θs for N . Moreover, denoting by ρi the utilization limt→∞ Pr(xi (t) 6= 0) of the queue i, the scheduler Θs minimizes maxi ρi among all\nmemoryless ergodic schedulers.\nHence one can decide in polynomial time whether an arbitrary ergodic scheduler exists; if\nyes, one can compute in polynomial time a static randomized ergodic scheduler.\nLet us first concentrate on part 1. Let Θ be an ergodic scheduler. Roughly speaking, we\nprove that a feasible solution of the traffic LP can be constructed using (limit) frequencies of\nfiring individual actions in NΘ . Formally, given a run ω of NΘ , t ∈ R≥0 and ξ ∈ Σ̄, we denote\nby Oξ≤t (ω) the number of times the action ξ is fired up to time t on ω. For memoryless Θ we\nhave the following result.\n\n\f10\n\nStabilization of Branching Queueing Networks\n\nI Lemma 11. Assume that Θ is a memoryless ergodic scheduler. For every ξ ∈ Σ̄ there is a\nconstant Oξ such that for almost all runs ω of NΘ the limit\nlim\n\nOξ≤t (ω)\nt\n\nt→∞\n\n\u0001\nexists and is equal to Oξ . There is δ̄ < 1 such that δ̄, Oξ | ξ ∈ Σ̄ solves the traffic\nLP.\nP\nMoreover, for every i ∈ {1, . . . , n} the utilization ρi of the queue i in NΘ is equal to\n\nξ∈Σi\n\nOξ\n\nμi\n\n.\n\nWe prove Lemma 11 in Appendix A.3. If there exists an arbitrary (i.e. possibly historydependent) ergodic scheduler, then by Theorem 7.3.8 of [27] there exists also a memoryless\n(and deterministic) ergodic scheduler.4 This fact, combined with Lemma 11, implies part 1.\nof Proposition 10.\nNow let us concentrate on part 2. of Proposition 10.\n\u0001\nI Lemma 12. Any feasible solution δ̄, λ̄ξ | ξ ∈ Σ̄ of the traffic LP with δ̄ < 1Pinduces a\nstatic randomized ergodic scheduler whose utilization of any queue i is equal to\n\nξ∈Σi\n\nμi\n\nλ̄ξ\n\n.\n\nProof. We construct a static randomized scheduler Θ which chooses an action ξ ∈ Σi for\nthe queue i with probability\nPξ = P\n\nλ̄ξ\n\nζ∈Σi\n\n,\n\nλ̄ζ\n\nX\n\nλ̄ζ > 0 .\n\n(5)\n\nζ∈Σi\n\nP\nOtherwise, if ζ∈Σi λ̄ζ = 0, we may control the queue i arbitrarily because no jobs ever\ncome to the queue. We further assume (w.l.o.g.) that such queues have been removed from\nP\nthe network, i.e., that Pξ is defined using (5) for all ξ ∈ Σ̄. Note that ξ∈Σi Pξ = 1 for every\ni ∈ {1, . . . , n}.\nFixing the scheduler Θ we obtain a purely stochastic branching network whose traffic\nequations are deficiently solvable. Formally, we define a new purely stochastic branching\nnetwork N 0 with n queues with the same arrival rate, the same arrival production function\nS\nand the same queue rates as N . Further, N 0 has Ri0 = ξ∈Σi Ri (ξ) and the following\nproduction functions Prob0i associated to queues:\nX\nProb0i (r) =\nPξ * Probi (ξ)(r) , r ∈ Ri0\nξ∈Σi\n\n(Here we formally assume Probi (ξ)(r) = 0 for r 6∈ Rξ .) The traffic equations (1) for N 0 have\nthe following form:\nλj\n\n=\n\nαj +\n\nn\nX\n\nλi * A0ij\n\nj ∈ {1, . . . , n}\n\n,\n\n(6)\n\ni=1\n\nwith\nA0ij :=\n\nX\n\nProb0i (r) * r j =\n\nr∈Ri0\n\nPξ\n\nξ∈Σi\n\n=\n\nλ̄ξ\n\nX\nP\nξ∈Σi\n\n4\n\nX\n\nζ∈Σi\n\nX\nλ̄ζ\n\nr∈Ri0\n\nX\n\nProbi (ξ)(r) * r j =\n\nr∈Ri0\n\nProbi (ξ)(r) * r j =\n\nλ̄ξ\n\nX\nP\nξ∈Σi\n\nζ∈Σi\n\nλ̄ζ\n\n* Aξj .\n\nTo be formally correct, we apply Theorem 7.3.8 of [27] to the embedded discrete time MDP and obtain\na scheduler which returns to the state 0 in finitely many steps (on average). As there are only finitely\nmany rates in our system, this means that also the expected return time to 0 is finite.\n\n\fT. Brázdil and S. Kiefer\n\n11\n\nP\nP\nSetting λi := ξ∈Σi λ̄ξ for every i ∈ {1, . . . , n}, we obtain λi A0ij = ξ∈Σi λ̄ξ Aξj . If we put\nthis equality into the first equation of the traffic LP, we see that (λ1 , . . . , λn ) solves (6). Also,\nλj < μj for all j ∈ {1, . . . , n}. Proposition 4 then implies that the scheduler Θ is ergodic.\nFinally, let us concentrate on the utilization. Note that the utilization of any queue i is\nthe same in N 0 as in NΘ , so it suffices to concentrate on N 0 . Observe that the matrix I − A0\nis invertible by Lemma 6. This means that (λ1 , . . . , λn ) is, in fact, the unique solution of (6).\nThen however,P\nby Lemma 11, the utilization ρi of queue i in N 0 (and thus also in NΘ ) is\nequal to\n\nλi\nμi\n\n=\n\nξ∈Σi\n\nλ̄ξ\n\nμi\n\n.\n\nJ\n\nTo complete the proof of Proposition 10, we consider the problem of minimizing the maximal\nutilization maxi ρi . Let Θs be a static randomized ergodic scheduler induced by a solution\nof the traffic LP in the sense of Lemma 12 (here we consider a solution which minimizes δ).\nObserve that the scheduler Θs minimizes maxi ρi among all schedulers induced by solutions\nof the traffic LP. However, by Lemmas 11 and 12, for every memoryless scheduler Θ there\nexists a static randomized scheduler induced by a solution of the traffic LP which has the\nsame utilization of each queue as Θ. Thus Θs minimizes maxi ρi among all memoryless\nergodic schedulers.\n\n4\n\nConclusions\n\nWe have suggested and studied controlled branching networks, a queueing model which\nextends Jackson networks by nondeterministic and branching features as required to model\nparallel systems. Although much of the classical theory (such as product-form stationary\ndistributions) no longer holds for controlled branching networks, we have shown that the\ntraffic equations can be generalized. This enabled us to construct a suitable Lyapunov\nfunction which we have used to establish strong stability properties. We have shown for\nthe controlled model that static randomized schedulers are sufficient to achieve those strong\nstability properties. Linear programming can be used to efficiently compute such a scheduler,\nwhich at the same time minimizes the maximal queue utilization.\nFuture work should include the investigation of more performance measures, e.g., the\nlong-time average queue size. Can non-static schedulers help to minimize it?\nReferences\n1\n\n2\n3\n4\n5\n6\n\n7\n\nM. Ahmadi and S. Wong. A performance model for network processor architectures in\npacket processing system. In Proceedings of the 19th IASTED International Conference on\nParallel and Distributed Computing and Systems, pages 176–181. ACTA Press, 2007.\nA. Azaron and S.M.T. Fatemi Ghomi. Optimal control of service rates and arrivals in\nJackson networks. European Journal of Operational Research, 147(1):17–31, 2003.\nA. Berman and R.J. Plemmons. Nonnegative matrices in the mathematical sciences. Academic Press, 1979.\nP. Billingsley. Probability and Measure. Wiley, 1995.\nG. Bolch, S. Greiner, H. de Meer, and K.S. Trivedi. Queueing Networks and Markov Chains.\nJohn Wiley and Sons, 2006.\nT. Brázdil, S. Kiefer, A. Kučera, and I. Hutařová Vařeková. Runtime analysis of probabilistic programs with unbounded recursion. In Proceedings of ICALP, volume 6756 of LNCS,\npages 319–331, 2011.\nH. Chen and D. Yao. Fundamentals of Queueing Networks. Springer, 2001.\n\n\f12\n\nStabilization of Branching Queueing Networks\n\n8\n9\n\n10\n11\n12\n13\n14\n\n15\n\n16\n17\n\n18\n19\n\n20\n21\n\n22\n23\n24\n\n25\n26\n27\n28\n29\n30\n\nJ. Daigle. Queueing Theory with Applications to Packet Telecommunication. Springer,\n2010.\nJ.D. Deng and M.K. Purvis. Multi-core application performance optimization using a\nconstrained tandem queueing model. Journal of Network and Computer Applications, In\nPress, Corrected Proof, 2011. DOI: 10.1016/j.jnca.2011.07.004.\nD. Down and S.P. Meyn. Piecewise linear test functions for stability and instability of\nqueueing networks. Queueing Systems, 27:205–226, 1997.\nJ. Esparza, A. Kučera, and R. Mayr. Model checking probabilistic pushdown automata. In\nLICS 2004, pages 12–21. IEEE, 2004.\nK. Etessami, D. Wojtczak, and M. Yannakakis. Recursive stochastic games with positive\nrewards. In Proceedings of ICALP 2008, pages 711–723, 2008.\nK. Etessami and M. Yannakakis. Recursive Markov chains, stochastic grammars, and\nmonotone systems of nonlinear equations. Journal of the ACM, 56(1):1–66, 2009.\nK.D. Glazebrook and J. Niño-Mora. A linear programming approach to stability, optimisation and performance analysis for Markovian multiclass queueing networks. Annals of\nOperations Research, 92:1–18, 1999.\nJ.M. Harrison and R.J. Williams. Brownian models of feedforward queueing networks:\nQuasireversibility and product form solutions. Annals of Applied Probability, 2(2):263–293,\n1992.\nJ.R. Jackson. Networks of waiting lines. Operations Research, 5(4):518–521, 1957.\nS. Kiefer and D. Wojtczak. On probabilistic parallel programs with process creation and\nsynchronisation. In Proceedings of TACAS, volume 6605 of LNCS, pages 296–310. Springer,\n2011.\nM.Y. Kitaev and V.V.Rykov. Controlled queueing systems. CRC Press, 1995.\nP.R. Kumar and S.P. Meyn. Duality and linear programs for stability and performance\nanalysis of queueing networks and scheduling policies. IEEE Transactions on Automatic\nControl, 42(1):4–17, 1996.\nM. Kwiatkowska, G. Norman, and D. Parker. Prism 4.0: Verification of probabilistic realtime systems. In Proceedings of CAV, volume 6806 of LNCS, pages 585–591, 2011.\nN. Madan, A. Buyuktosunoglu, P. Bose, and M. Annavaram. A case for guarded power\ngating for multi-core processors. In High Performance Computer Architecture (HPCA),\npages 291–300, 2011.\nW.A. Massey and R. Srinivasan. A heavy traffic analysis for semi-open networks. Performance Evaluation, 13(1):59–66, 1991.\nS.P. Meyn and R.L. Tweedie. Markov Chains and Stochastic Stability. Springer, 1993.\nM. Neuhäusser, M. Stoelinga, and J.-P. Katoen. Delayed nondeterminism in continuoustime Markov decision processes. In Proceedings of FoSSaCS 2009, volume 5504 of LNCS,\npages 364–379. Springer, 2009.\nJ.R. Norris. Markov Chains. Oxford University Press, first edition, 1998.\nC.H. Papadimitriou and J.N. Tsitsiklis. The complexity of optimal queueing network control. Mathematics of Operations Research, 24:293–305, 1994.\nM. L. Puterman. Markov Decision Processes: Discrete Stochastic Dynamic Programming.\nJohn Wiley and Sons, 2008.\nS. Stidham, Jr. Optimal control of admission to a queueing system. IEEE Transactions on\nAutomatic Control, 30(8):705–713, 1985.\nS. La Torre, P. Madhusudan, and G. Parlato. Context-bounded analysis of concurrent\nqueue systems. In Proceedings of TACAS, volume 4963 of LNCS, pages 299–314, 2008.\nH. Zisgen, I. Meents, B.R. Wheeler, and T. Hanschke. A queueing network based system\nto model capacity and cycle time for semiconductor fabrication. In Proceedings of the 40th\nConference on Winter Simulation, pages 2067–2074, 2008.\n\n\fT. Brázdil and S. Kiefer\n\nA\n\n13\n\nProofs\n\nA.1\n\nProof of Lemma 6\n\nLemma 6. The matrix series A∗ :=\n(I − A)−1 .\n\nP∞\n\ni=0\n\nn×n\nAi converges (\"exists\") in R≥0\nand is equal to\n\nProof. By the traffic equation λ = α + λA we have λA ≤ λ, with λ > 0. By [3, Theorem 2.1.11] this implies that the spectral radius of A is at most 1 (where the spectral radius\nis the largest absolute value of the eigenvalues of A).\nTo show the statement of the lemma, it now suffices to show that I − A is invertible.\nConsider the (monotone) function f : Rn≥0 → Rn≥0 with f (x) := α + xA. By the traffic\nequation, λ is a fixed point of f . Assume for a contradiction that I − A is singular, i.e., there\nis y ∈ Rn with y 6= 0 and yA = y. Then λ + ry is a fixed point for all r ∈ R. Choose r\nso that z := λ + ry ∈ Rn≥0 , but z i = 0 for some i ∈ {1, . . . , n}. By the monotonicity of f ,\nall points u ∈ {0, f (0), f (f (0)), . . .} satisfy 0 ≤ u ≤ z = f (z). It follows that ui = 0 for\nall u. This contradicts the fact that queue i is \"reachable\" (recall that \"queue i is reachable\"\nmeans there is j ∈ N with (αAj )i 6= 0).\nJ\n\nA.2\n\nProof of Proposition 4\n\nIn this section we complete the proof of\nProposition 4. Assume that λ ∈ Rn≥0 solves the traffic equations (2) and satisfies λ < μ.\nThen the following conclusions hold:\n1. The process N is ergodic, i.e., the expected return time to 0 is finite.\n2. There exists a stationary distribution π such that there exists an exponential moment of\nP\nthe total queue size, i.e., there is δ > 0 such that x∈Nn exp(δ kxk)π(x) exists.\nP∞\nRecall from Lemma 6 that the matrix series A∗ := i=0 Ai converges (\"exists\") in Rn×n\n≥0\nand equals (I − A)−1 . Observe that for any vector v T = A∗ wT with w ∈ Rn , we have\nv T = Av T + wT . We prove Lemma 7:\nLemma 7. If 0 6= x ∈ Rn≥0 and xi = 0, then xq (i)T < V (x).\nProof. For the proof we use the following notation: For a matrix M we denote by Mi..j the\nmatrix obtained by restricting M to its rows indexed by i, . . . , j. Similarly, we denote by\nMi..j,k..` the matrix M restricted to the corresponding rows and columns.\nn×n\nLet Q ∈ R≥0\ndenote the matrix whose columns are q (1)T , . . . , q (n)T . Note that 1Q = 1.\n∗\n∗\nWe have Q = A D where D ∈ Rn×n\n≥0 is the diagonal matrix with 1/Dii = (1A )i . Further,\nn×(n−1)\nwe define the matrix P ∈ {−1, 0, 1}\nwith\n−1\n1\n\n\nP :=  0\n\n\n\n\n0\n\n−1\n0\n1\n\n−1\n0\n0\n\n***\n***\n***\n..\n.\n\n−1\n0\n0\n\n\n−1\n0 \n\n0 \n .\n\n\n\n0\n\n0\n\n***\n\n0\n\n1\n\n\f14\n\nStabilization of Branching Queueing Networks\n\nW.l.o.g. let x1 = 0. With the notation above and writing x̄ := (x2 , . . . , xn ) ∈ Rn−1\n≥0 , the\nlemma states that\nthere is no x̄ ∈ Rn−1\n≥0 with x̄ 6= 0 and x̄Q2..n P ≤ 0 .\n\n(7)\n\nWe use Farkas' lemma for the proof:\nI Lemma 13 (Farkas' lemma). Let M ∈ Rm×n and b ∈ Rm . Then exactly one of the\nfollowing is true:\n1. There exists x ∈ Rm with xM ≤ 0 and xbT > 0.\n2. There exists y ∈ Rn with M y T = bT and y ≥ 0.\nUsing Farkas' lemma we prove (7) by exhibiting b > 0 and y ≥ 0 such that Q2..n P y T = bT .\nWe choose\nbT := (A2..n,2..n )∗ 1T ≥ 1T > 0T .\nWe have 1Q = 1, which implies 1Q−1 = 1QQ−1 = 1, hence P (Q−1 )2..n = Q−1 − E where\nE ∈ {0, 1}n×n denotes the matrix with 1 in the first row and 0 in the other rows. It follows\nP (Q−1 )2..n P = Q−1 P .\n\n(8)\n\nSetting\ny T := (Q−1 )2..n P bT\nwe therefore have\n(8)\n\nQ2..n P y T = Q2..n P (Q−1 )2..n P bT = Q2..n Q−1 P bT = P2..n bT = bT ,\nas desired. It remains to prove y ≥ 0. As Q = A∗ D, we have Q−1 = D−1 (I − A) with D−1\nnonnegative, so it suffices to prove that (I − A)2..n P bT ≥ 0T . Indeed we have\n(I − A)2..n P bT = (I − A2..n P )bT = bT − A2..n P bT ≥ bT − A2..n,2..n bT = 1T ,\nwhere the inequality holds as bT and the first column of A2..n are nonnegative and the first\nrow of P is negative.\nJ\nRecall the following lemma:\nLemma 8. There is γ > 0 such that we have\n∆(x) V 0 (x)\n\n\u0001T\n\n≤ −γ\n\nfor all x 6= 0\n\nand all subgradient vectors V 0 (x) of V at x. More precisely, one can choose\nγ := min(μi − λi )/ a(i) ,\ni\n\nwhere a(i)T is the ith column of A∗ .\nProposition 4 follows from Lemma 8 using exactly the reasoning from theorem 1 and\nlemma 5 of [10].\n\n\fT. Brázdil and S. Kiefer\n\nA.3\n\n15\n\nProof of Lemma 11\n\nLemma 11. Assume that Θ is a memoryless ergodic scheduler. For every ξ ∈ Σ̄ there is a\nconstant Oξ such that for almost all runs ω of NΘ the limit\nlim\n\nOξ≤t (ω)\nt\n\nt→∞\n\n\u0001\nexists and is equal to Oξ . There is δ̄ < 1 such that δ̄, Oξ | ξ ∈ Σ̄ solves the traffic\nLP.\nP\nMoreover, for every i ∈ {1, . . . , n} the utilization ρi of the queue i in NΘ is equal to\n\nξ∈Σi\n\nμi\n\nOξ\n\n.\n\nWe divide our proof of Lemma 11 into four claims.\nI Claim 1. For every ξ ∈ Σ̄ there is a constant Oξ such that for almost all runs ω of NΘ the\nlimit\nlim\n\nOξ≤t (ω)\n\nt→∞\n\nt\n\nexists and is equal to Oξ .\nProof. Given an action ξ ∈ Σ̄ and i ≥ 1, denote by Miξ a random variable giving the number\nof times the action ξ is fired between the i-th and i + 1-st visit to 0 (note that the network\nstarts with all empty queues so the first visit happens at time 0). Observe that all Miξ are\nidentically distributed. Also, as the expected return time to 0 is finite and there are only\nfinitely many distinct rates (i.e. the expected time between\nh two\ni state transitions is bounded\n\nfrom below by a positive constant), the expectation E M1ξ is finite. By the strong law\nξ\nof large numbers\nPn (seeξ e.g. [4]), there is a constant M such that for almost all runs ω the\nM (ω)\nlimit limn→∞ i=1n i\nexists and is equal to M ξ . For i ≥ 1 we define Ri to be a random\nvariable giving the total time between the i-th and i + 1-st visits to 0. Note that R1 is\nprecisely the variable R giving the return\nP time to 0. By the strong law of large numbers, for\nn\n\nRi (ω)\n\nalmost all runs ω the limit limn→∞ i=1n\nexists and is equal to E [R1 ] = E [R] < ∞.\nPn−1\nPn\nNow note that for t ≥ 0 and n ≥ 1 satisfying i=1 Ri (ω) ≤ t ≤ i=1 Ri (ω) (here for\nPn−1\nn = 1 we assume i=1 Ri (ω) = 0) we have\nPn−1 ξ\nMi (ω)\nPi=1\nn\ni=1 Ri (ω)\n\n≤\n\nOξ≤t (ω)\nt\n\n≤\n\nPn\nMiξ (ω)\nPi=1\nn\ni=1 Ri (ω)\n\n(9)\n\nThe limit of the rightmost term of (9) exists:\nMξ\nE [R]\n\nPn\n=\n\nlim\n\nn→∞\n\ni=1\n\nMiξ (ω)\nn\n* lim Pn\nn→∞\nn\ni=1 Ri (ω)\n\n=\n\nPn\nMiξ (ω)\nlim Pi=1\nn\nn→∞\ni=1 Ri (ω)\n\nSimilarly, the limit of the left most term of (9) exists:\n!\nPn−1 ξ\nMξ\nn−1\nn\ni=1 Mi (ω)\n=\nlim\n* lim\n* lim Pn\nn→∞\nn→∞\nn→∞\nE [R]\nn−1\nn\ni=1 Ri (ω)\n\n=\n\nPn\nMiξ (ω)\nlim Pi=1\nn\nn→∞\ni=1 Ri (ω)\n\n≤t\n\nThus by basic properties of limits, the limit limt→∞\n\nOξ (ω)\nt\n\nexists and is equal to\n\nMξ\nE[R] .\n\nJ\n\n\f16\n\nStabilization of Branching Queueing Networks\n\nThe following two claims show that the frequencies indeed solve the traffic LP with δ < 1.\nI Claim 2. For every j ∈ {1, . . . , n} we have\nX\n\nOξ =\n\nn X\nX\n\nOζ * Aζj\n\n(10)\n\ni=0 ζ∈Σi\n\nξ∈Σj\n\nHere we assume (in order to simplify notation) that the external source is a (symbolic)\nqueue 0, with action set Σ = {ι} where ι has rate μ0 and a production function Prob0 (thus\nOι * Aιj = αj ).\n≤t\nProof. Denote by Oζ→j\n(ω) the number of jobs produced for queue j by firing the action ζ.\nThe crucial observation is that for almost all runs ω we have\nP\nPn P\n≤t\n≤t\nξ∈Σj Oξ (ω)\ni=0\nζ∈Σi Oζ→j (ω)\nlim\n=\nlim\nt→∞\nt→∞\nt\nt\nP\nPn P\nPn P\n≤t\n≤t\n≤t\nIndeed, ξ∈Σj Oξ (ω) ≤ i=0 ζ∈Σi Oζ→j (ω) for all t and ω because i=0 ζ∈Σi Oζ→j\n(ω)\nis precisely the number of jobs that enter the queue j up to time t. On the other hand,\nP\nPn P\n≤t\n≤t\nξ∈Σj Oξ (ω) for infinitely many t and almost all ω because (almost\ni=0\nζ∈Σi Oζ→j (ω) ≤\nsurely) queue j becomes empty infinitely many times.\nWe obtain that\n\nX\n\nOξ\n\n=\n\nξ∈Σj\n\nX\nξ∈Σj\n\nlim\n\nOξ≤t (ω)\nt\n\nt→∞\n\nP\n=\n\nlim\n\nξ∈Σj\n\nt→∞\n\nPn\n=\n=\n\nlim\n\ni=0\n\nt→∞\nn X\nX\ni=0 ζ∈Σi\n\n=\n\n=\n\nn X\nX\ni=0 ζ∈Σi\nn X\nX\n\nOξ≤t (ω)\n\nt\nP\n\nlim\n\nζ∈Σi\n\nt\n≤t\nOζ→j\n(ω)\nt\n\nt→∞\n\nlim\n\n≤t\nOζ→j\n(ω)\n\nOζ≤t (ω)\n\nt→∞\n\nt\n\n* lim\n\nt→∞\n\n≤t\nOζ→j\n(ω)\n\nOζ≤t (ω)\n\nOζ * Aζj\n\ni=0 ζ∈Σi\n≤t\n\nHere the last equality follows from Claim 1 and the fact that limt→∞\nnumber of jobs for queue j produced by firing ζ, i.e., Aζj .\nI Claim 3. For every i ∈ {1, . . . , n} we have\nP\nξ∈Σi Oξ\n<1\nμi\nP\nOξ\n\nOζ→j (ω)\n≤t\n\nOζ (ω)\n\nis the average\nJ\n\n(11)\n\ni\nProof. Intuitively, we show that ξ∈Σ\n+ π(0) is equal to the proportion of time in which\nμi\neither the queue i operates a job or all queues are empty. As this proportion is at most 1\nand π(0) > 0, we obtain the desired result.\nFormally, denote by Tn the total amount of time in which the first n jobs are processed\nby queue i (by this we mean the total time from the beginning of the computation needed to\n\n\fT. Brázdil and S. Kiefer\n\n17\n\nfinish n jobs using the \"machine\" operating queue i). Denote by Nj the total time it takes to\nprocess the j-th job from queue i (by this we mean the time the \"machine\" actively spends\nby processing the job).\nP\nn\n\nNj (ω)\n\nObserve that for almost all runs ω we have that limn→∞ j=1n\nprocessing time of the queue i which is μ1i , and that Tnn(ω) is equal to\n\nis the average\n\n≤Tn (ω)\n\nP\n\nξ∈Σi\n\nOξ\n\nTn (ω)\nwhich means that by Claim 1,\n≤Tn (ω)\n\nP\n\nn\nlim\nn→∞ Tn (ω)\n\n=\n\nOξ\n\nξ∈Σi\n\nlim\n\nTn (ω)\n\nn→∞\n\nX\n\n=\n\nOξ\n\nξ∈Σi\n\nThus\nPn\n\nj=1\n\nlim\n\nn→∞\n\nNj (ω)\n\nTn (ω)\n\nPn\n=\n\nj=1\n\nlim\n\nNj (ω)\n\nn\n\nn→∞\n\nn\n* lim\nn→∞ Tn (ω)\n\nP\n\nξ∈Σi\n\n=\n\nOξ\n\n(12)\n\nμi\n\nDenote by En the total amount of time the network spends in state 0 before queue i finishes\nn jobs (by this we mean the sum of all time intervals up to time Tn in which all queues are\nsimultaneously idle before n jobs are finished by the \"machine\" operating queue i). Intuitively,\nn (ω)\nlimn→∞ E\nTn (ω) is equal to the proportion of time spent in 0 which is equal to π(0) > 0. More\nprecisely, by the Ergodic Theorem, see Theorem 3.8.1 of [25], for almost all runs ω we have\n0\n\n<\n\nπ(0)\n\n=\n\nt\n\nZ\n\n1\nt→∞ t\n\nI[x(ω) = 0](s)ds\n\nlim\n\n=\n\n0\n\nEn (ω)\nn→∞ Tn (ω)\n\n(13)\n\nlim\n\nFinally, by (12) and (13),\nP\nP\nξ∈Σi Oξ\nξ∈Σi Oξ\n<\n+ π(0) =\nμi\nμi\nPn\nPn\nn\nEn (ω)\nj=1 Nj (ω) + En (ω)\nj=1 Nj (ω)\n* lim\n+ lim\n= lim\n≤ 1\nn→∞ Tn (ω)\nn→∞ Tn (ω)\nn→∞\nn\nTn (ω)\nJ\nP\nI Claim 4. For every i ∈ {1, . . . , n}, ρi =\n\nξ∈Σi\n\nOξ\n\nμi\n\n.\n\nProof. By the Ergodic Theorem, see Theorem 3.8.1 of [25], and by (12), for almost all runs\nω we have\nX\nρi =\nlim Pr(xi (t) 6= 0) =\nπ(x)\nt→∞\n\nx∈Nn :xi 6=0\n\n=\n\n1\nlim\nt→∞ t\n\nZ\n\nPn\n\nt\n\nI[xi (ω) 6= 0](s)ds\n0\n\n=\n\nlim\n\nn→∞\n\nj=1\n\nNj (ω)\n\nTn (ω)\n\nP\n=\n\nξ∈Σi\n\nOξ\n\nμi\nJ\n\nThis finishes a proof of Lemma 11.\n\n\f"}