{"id": "http://arxiv.org/abs/1202.1535v1", "guidislink": true, "updated": "2012-02-07T21:07:33Z", "updated_parsed": [2012, 2, 7, 21, 7, 33, 1, 38, 0], "published": "2012-02-07T21:07:33Z", "published_parsed": [2012, 2, 7, 21, 7, 33, 1, 38, 0], "title": "Spectroscopic Coronal Observations during the Total Solar Eclipse of 11\n  July 2010", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1202.2115%2C1202.5023%2C1202.6581%2C1202.2248%2C1202.3947%2C1202.3277%2C1202.4457%2C1202.2401%2C1202.2739%2C1202.1670%2C1202.2227%2C1202.0681%2C1202.4288%2C1202.0597%2C1202.3880%2C1202.5258%2C1202.6055%2C1202.0867%2C1202.6674%2C1202.1693%2C1202.5064%2C1202.4903%2C1202.3852%2C1202.2196%2C1202.5228%2C1202.1401%2C1202.1743%2C1202.5384%2C1202.1932%2C1202.1621%2C1202.5102%2C1202.0324%2C1202.4013%2C1202.1978%2C1202.5319%2C1202.0485%2C1202.0192%2C1202.5361%2C1202.2963%2C1202.3186%2C1202.2897%2C1202.5284%2C1202.0412%2C1202.2412%2C1202.3432%2C1202.3450%2C1202.5772%2C1202.5521%2C1202.4954%2C1202.4307%2C1202.1273%2C1202.2032%2C1202.5403%2C1202.3339%2C1202.0205%2C1202.3888%2C1202.3475%2C1202.4173%2C1202.4228%2C1202.5635%2C1202.1507%2C1202.5980%2C1202.0266%2C1202.5341%2C1202.3854%2C1202.5450%2C1202.2568%2C1202.2659%2C1202.4394%2C1202.0087%2C1202.1388%2C1202.5249%2C1202.3028%2C1202.4843%2C1202.6605%2C1202.5088%2C1202.4361%2C1202.1233%2C1202.0429%2C1202.6612%2C1202.4186%2C1202.4560%2C1202.1429%2C1202.0297%2C1202.4976%2C1202.6439%2C1202.3375%2C1202.4958%2C1202.5529%2C1202.5345%2C1202.2577%2C1202.3922%2C1202.1535%2C1202.1716%2C1202.0373%2C1202.0074%2C1202.5906%2C1202.2741%2C1202.0481%2C1202.1644%2C1202.1403&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Spectroscopic Coronal Observations during the Total Solar Eclipse of 11\n  July 2010"}, "summary": "The flash spectrum of the solar chromosphere and corona was measured with a\nslitless spectrograph before, after, and during the totality of the solar\neclipse, of 11 July 2010, at Easter Island, Chile. This eclipse took place at\nthe beginning of the Solar Cycle 24, after an extended minimum of solar\nactivity. The spectra taken during the eclipse show a different intensity ratio\nof the red and green coronal lines compared with those taken during the total\nsolar eclipse of 1 August 2008, which took place towards the end of the Solar\nCycle 23. The characteristic coronal forbidden emission line of forbidden Fe\nXIV (5303 {\\AA}) was observed on the east and west solar limbs in four areas\nrelatively symmetrically located with respect to the solar rotation axis.\nSubtraction of the continuum flash-spectrum background led to the\nidentification of several extremely weak emission lines, including forbidden Ca\nXV (5694 {\\AA}), which is normally detected only in regions of very high\nexcitation, e.g., during flares or above large sunspots. The height of the\nchromosphere was measured spectrophotometrically, using spectral lines from\nlight elements and compared with the equivalent height of the lower\nchromosphere measured using spectral lines from heavy elements.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1202.2115%2C1202.5023%2C1202.6581%2C1202.2248%2C1202.3947%2C1202.3277%2C1202.4457%2C1202.2401%2C1202.2739%2C1202.1670%2C1202.2227%2C1202.0681%2C1202.4288%2C1202.0597%2C1202.3880%2C1202.5258%2C1202.6055%2C1202.0867%2C1202.6674%2C1202.1693%2C1202.5064%2C1202.4903%2C1202.3852%2C1202.2196%2C1202.5228%2C1202.1401%2C1202.1743%2C1202.5384%2C1202.1932%2C1202.1621%2C1202.5102%2C1202.0324%2C1202.4013%2C1202.1978%2C1202.5319%2C1202.0485%2C1202.0192%2C1202.5361%2C1202.2963%2C1202.3186%2C1202.2897%2C1202.5284%2C1202.0412%2C1202.2412%2C1202.3432%2C1202.3450%2C1202.5772%2C1202.5521%2C1202.4954%2C1202.4307%2C1202.1273%2C1202.2032%2C1202.5403%2C1202.3339%2C1202.0205%2C1202.3888%2C1202.3475%2C1202.4173%2C1202.4228%2C1202.5635%2C1202.1507%2C1202.5980%2C1202.0266%2C1202.5341%2C1202.3854%2C1202.5450%2C1202.2568%2C1202.2659%2C1202.4394%2C1202.0087%2C1202.1388%2C1202.5249%2C1202.3028%2C1202.4843%2C1202.6605%2C1202.5088%2C1202.4361%2C1202.1233%2C1202.0429%2C1202.6612%2C1202.4186%2C1202.4560%2C1202.1429%2C1202.0297%2C1202.4976%2C1202.6439%2C1202.3375%2C1202.4958%2C1202.5529%2C1202.5345%2C1202.2577%2C1202.3922%2C1202.1535%2C1202.1716%2C1202.0373%2C1202.0074%2C1202.5906%2C1202.2741%2C1202.0481%2C1202.1644%2C1202.1403&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The flash spectrum of the solar chromosphere and corona was measured with a\nslitless spectrograph before, after, and during the totality of the solar\neclipse, of 11 July 2010, at Easter Island, Chile. This eclipse took place at\nthe beginning of the Solar Cycle 24, after an extended minimum of solar\nactivity. The spectra taken during the eclipse show a different intensity ratio\nof the red and green coronal lines compared with those taken during the total\nsolar eclipse of 1 August 2008, which took place towards the end of the Solar\nCycle 23. The characteristic coronal forbidden emission line of forbidden Fe\nXIV (5303 {\\AA}) was observed on the east and west solar limbs in four areas\nrelatively symmetrically located with respect to the solar rotation axis.\nSubtraction of the continuum flash-spectrum background led to the\nidentification of several extremely weak emission lines, including forbidden Ca\nXV (5694 {\\AA}), which is normally detected only in regions of very high\nexcitation, e.g., during flares or above large sunspots. The height of the\nchromosphere was measured spectrophotometrically, using spectral lines from\nlight elements and compared with the equivalent height of the lower\nchromosphere measured using spectral lines from heavy elements."}, "authors": ["A. G. Voulgaris", "P. S. Gaintatzis", "J. H. Seiradakis", "J. M. Pasachoff", "T. E. Economou"], "author_detail": {"name": "T. E. Economou"}, "author": "T. E. Economou", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/s11207-012-9929-4", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1202.1535v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1202.1535v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "14 pages, 8 figures, 1 table; Solar Physics, 2012, February", "arxiv_primary_category": {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1202.1535v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1202.1535v1", "journal_reference": null, "doi": "10.1007/s11207-012-9929-4", "fulltext": "Spectroscopic Coronal Observations during the\nTotal Solar Eclipse of 11 July 2010\nA.G. Voulgaris • P.S. Gaintatzis • J.H. Seiradakis • J.M. Pasachoff • T.E. Economou\nA.G. Voulgaris\nEvrivias 5c, GR-542 50 Thessaloniki, Greece\nP.S. Gaintatzis, J.H. Seiradakis ()\nDepartment of Physics, Section of Astrophysics, Astronomy and Mechanics, Aristotle University\nof Thessaloniki, GR-541 24 Thessaloniki, Greece\ne-mail: jhs@astro.auth.gr\n\nJ.M. Pasachoff ()\nWilliams College-Hopkins Observatory, Williamstown, Massachusetts 01267, USA\ne-mail: eclipse@williams.edu\n\nT.E. Economou\nLaboratory for Astrophysics and Space Research, Enrico Fermi Institute, University of Chicago,\nChicago, IL 60637, USA\nAbstract The flash spectra of the solar chromosphere and corona were measured with a slitless\nspectrograph before, after, and during the totality of the solar eclipse of 11 July 2010, at Easter Island,\nChile. This eclipse took place at the beginning of the Solar Cycle 24, after an extended minimum of solar\nactivity. The spectra taken during the eclipse show a different intensity ratio of the red and green coronal\nlines compared with those taken during the total solar eclipse of 1 August 2008, which took place toward\nthe end of Solar Cycle 23. The characteristic coronal emission line of forbidden Fe XIV (5303 Å) was\nobserved on the east and west solar limbs in four areas relatively symmetrically located with respect to\nthe solar rotation axis. Subtraction of the continuum flash-spectrum background led to the identification\nof several extremely weak emission lines, including forbidden Ca XV (5694 Å), which is normally\ndetected only in regions of very high excitation, e.g., during flares or above large sunspots. The height of\nthe chromosphere was measured spectrophotometrically, using spectral lines from light elements and\ncompared with the equivalent height of the lower chromosphere measured using spectral lines from heavy\nelements.\nKeywords Eclipses • Corona • Chromosphere's Height • Continuum Background • Ionized Iron • Lower\nChromosphere • Continuum Subtraction\n\n1\n\nIntroduction\n\nWe continue our joint work on the solar chromosphere and corona, which started with the\ntotal solar eclipse of 29 March 2006 (Voulgaris et al., 2010). On 11 July 2010, we observed the\ntotal solar eclipse at Easter Island in the South Pacific. The flash spectrum of the solar corona\n\n\fA. G. Voulgaris et al.\n\nwas measured with a slitless solar spectrograph made by one of us (AV). Although Solar Cycle\n24 had just begun, the emission lines from forbidden both Fe X and Fe XIV were clearly visible in\nthe coronal spectra, whereas only the cooler of the two lines were detectable during solar\nminimum. This change in ratio indicates an increase in the temperature of the corona as solar\nactivity is on its way to the next solar maximum, perhaps the last solar-activity cycle for some\ndecades (Pasachoff, 2011; Pasachoff and MacRobert, 2011).\nThroughout the recent solar minimum, the total absence of energetic flares as well as the\ngeneral low solar activity resulted in a drop of the corona temperature. During that time,\nsignificant changes were observed in the intensities of the forbidden Fe X and Fe XIV emission\nlines, corresponding to ionization temperatures of 1.2×106 K and 1.8×106 Κ, respectively. Other\nstrong lines are available in the infrared, as discussed by Pasachoff, Sandford, and Keller (1978)\nand, with improved techniques, by Habbal et al. (2011). During the solar minimum, many known\nmultiply ionized coronal emission lines are not detectable, since they require a much higher\ntemperature. An example of such elements is forbidden Ca XV (5694 Å), with an ionization\ntemperature of 2.3×106 K, whose emission lines have never been reported during solar minimum.\nSee also Wagner and House (1968).\nStudies of the total solar eclipses from the ground are part of an effort to understand the\nprocesses that are going on in the solar corona with ever improving ground equipment (Singh et\nal., 2011) and supplementing the results obtained from space missions (Pasachoff, 2009a,\n2009b).\nFrom the work of Mazzotta et al. (1998), it can be concluded that the multiply ionized\nelements with high ionization potential continue to emit even at lower temperatures, albeit with\nextremely low signal, near or at the limits of the continuum. This extremely faint signal from the\nabove-mentioned elements explains why such lines are not directly observed during the solar\nminimum. Faint emission lines are barely detected in the spectra.\nIn this article, we concentrate on the analysis of flash spectra that were obtained during\nthe 2010 total solar eclipse and the possibility of detecting extremely low intensity emission lines\nfrom multiply ionized elements in the solar corona. These extremely faint emission lines are\neasily recognized, since they follow the circular solar limb pattern, similar to the stronger\nemission lines.\n\n2. Observations and Data Recording\n2.1. The Total Solar Eclipse of 11 July 2010, at Easter Island\nWe observed the total solar eclipse from Easter Island, Chile, South Pacific (longitude\n–109 25 ́ 29.2 ́ ́ and latitude –27o 08 ́ 36.3 ́ ́) under exceptionally clear weather conditions, in\nspite of the general weather variability of the previous days and rain until the very last morning\nof the day of the eclipse. The observations took place at the premises of the Vai Moana Hotel, 2\nο\n\n2\n\n\fSpectroscopic Coronal Observations during the Total Solar Eclipse\n\nKm from Hangaroa, the capital of\nthe island. The observing site was\n26.6 km away from the central\nline of the eclipse. The duration of\nthe total eclipse at our site,\nuncorrected by the limb profile,\nwas 4 minutes and 41.5 seconds;\nthe Kaguya-LRO derived profile\ngave a duration of 4 minutes and\n35.4 seconds. The middle of\ntotality occurred at 20:10:49.8 UT\n(Espenak and Anderson, 2008;\nJubier, 2010) with local time = UT\n–6 h, or 14:10. As is typical near\nsolar minimum, the corona was\nextended equatorially without\nhigh-latitude streamers and with\nonly plumes showing near the\npoles (Figure 1). The corona's\nstructure in Figure 1 was\nFigure 1 The inner and middle corona of the total solar eclipse of 11\nenhanced\nusing\npreviously\nJuly 2010. Twenty-five images, of several exposure times, have been\ncomposed using a phase-correlation method. In the composed image,\npublished digital techniques of\nlocal adaptive filters have been applied for the enhancement of\nDruckmüller\n(2006,\n2009).\ncorona's structure. North is up.\nPasachoff et al. (2011a) provide\nextensive coverage of coronal\nimaging of this eclipse from the same site on Easter Island, from Tatakoto in French Polynesia,\nand from several solar spacecraft. The solar-activity cycle had risen considerably since the\nChina/Marshall-Islands observations of the 22 July 2009 total solar eclipse, for which the\nsunspot number was essentially zero (Pasachoff et al., 2011b).\n2.2. The Slitless Spectrograph and\nData Recording\nA Canon 40D digital camera\nand a slitless spectrograph that have\nbeen described by Voulgaris et al.\n(2010) were used to record the flash\nspectrum. We used ISO 400 with\nexposure time 1/8000 second during\nthe partial eclipse, between 1/5000\nsecond and 1/1000 second, a few\nseconds before the second and after\nthe third contact and between 1/50\nsecond and 1/25 second during the\ntotal phase. The flash spectrum was\ncaptured before, during, and after the\n\nFigure 2 The dispersion of the spectrograph as a function of\nwavelength.\n3\n\n\fA. G. Voulgaris et al.\n\ntotal eclipse in 179 images. In each image, the entire solar disk corresponded to 275 pixels or\n5065 km pixel–1. We show the dispersion of the spectrograph as a function of wavelength in\nFigure 2.\n\n3. Data Analysis and Image Processing\nDuring totality, the Moon completely covers the photosphere and light comes only from\nthe chromosphere and the solar corona. Light from the corona derives mainly from three sources:\nThe continuum (Κ), the emission (Ε), and the Fraunhofer (F) coronas (i.e., Golub and Pasachoff,\n2010) and references in Pasachoff (2010). A number of telluric absorption lines are generated in\nEarth's atmosphere (mainly from O2 and H2O), whose intensities depend on the thickness of the\natmosphere and on the terrestrial water vapor content. These lines are detectable in bands at the\nyellow (H2O absorption, 5875.6 Å – 5990.9 Å), orange (O2 absorption, 6276.6 Å – 6310.6 Å,\nband-a), red (H2O absorption, 6472.4 Å – 6586.6 Å), and near infrared (O2 absorption, 6867.1 Å\n– 6924.1 Å, band-B) part of the spectrum (Buil, 2011).\nDuring totality, the flash spectrum is dominated by light from the K- and the E-corona.\nThe E-corona in visible light is dominated by strong emission lines of forbidden Fe XIV (green),\nforbidden Fe X (red), and several other weak lines, which are difficult to detect as they are\noverwhelmed by strong continuum (K). The continuum background (K-corona) originates from\nscattered photospheric light and does not give any significant information of the energy content\nof the solar corona. So, we applied a set of techniques that resulted in significant reduction of the\nbackground continuum. Firstly, we combined a large number of images in order to increase the\nsignal-to-noise ratio. Then the continuum was subtracted from this composite image, resulting in\na clear view of the E-corona and the chromospheric emission lines. Finally, the emission lines\nwere enhanced with a linear transfer function. In Figures 3 and 5 we assume that the flash\nspectrum extends along the horizontal axis (x). The range of pixel values in all gray images is\nnormalized to double precision real numbers (64-bit) between 0 (black) and 1 (white).\nBefore proceeding with the analysis, we applied two corrections to the data.\n(i) Because the dispersion of the spectrograph (Å pixel–1) is not a linear function of the\nwavelength (Figure 2), the spectra were linearized with respect to wavelength.\n(ii) Because we used a slitless spectrograph, all spectral lines follow the circular shape of the\nchromosphere. Furthermore, this circular shape is distorted to elliptical shapes of varying\nsemimajor x-axes, as we move away from the optical axis of the spectrograph.\nThe relevant corrections were made using Wolfram's Mathematica v.8.0 by one of us (P.G.). The\nprocedure used to make the above corrections is described in Section 3.3.\n3.1. Alignment\nIn order to produce a final composed spectrum at third contact (Figure 3a) the available\nimages (15 in total) had to be (i) aligned and (ii) added taking into account the exposure time of\neach image (Equation (2)). The alignment was achieved using the phase-correlation method (De\nCastro and C. Morandi, 1987; Reddy and Chatterji, 1996; Druckmüller, 2009). In particular, for\n\n4\n\n\fSpectroscopic Coronal Observations during the Total Solar Eclipse\n\nthe calculation of the translation (Δx, Δy) of an image A(x,y) to an image B(x,y) the following\nexpression was used:\n\n\n \n\n2\n2\n 1  \nF  Axy  F  Bxy \n\n\nu v  \n\n,\nexp\n\nF  \n(1)\n x, y   arg max\n\n2  \n\n x, y  \n2\n\n\n\n\n  F  Axy    F  Bxy    \n\nuv\n\n xy \n\nwhere F is the Fourier transform, F-1 is the inverse Fourier transform, ε is a sufficiently small\nnon-zero real number, and σ is the standard deviation of a Gaussian function. The quantities (x,y)\nare the spatial coordinates and (u, v) are the corresponding frequency coordinates. For the\nparameters ε and σ we used the values ε = 0.0005 and σ = 2. Using the above transformation, the\n15 images of the flash spectrum that had been captured in the time interval (t3rd – 45sec, t3rd)\n(where t3rd is the instant of third contact) were aligned, with respect to the solar corona. Then, the\naligned images were averaged:\nn\nPi  x, y \n1\nI  x, y  \n,\n(2)\nn i 1\nti\n\n\n\nwhere ti is the exposure time of image Pi(x,y) and n = 15 is the total number of images to be\ncombined. The composed image I(x,y) is presented in Figure 3a, while a cut across the y-axis\n(white line on either side of Figure 3a) is presented in Figure 4a.\n3.2. Continuum Estimation and Subtraction\nThe continuum background intensity is not smooth along the y-axis; however, it extends\nsmoothly along the x-axis, a fact that allows us to estimate it. Then, we can subtract it from the\ncomposed image I(x,y). The continuum background can be estimated by applying a sequence of\ndigital filters as presented below.\nFirstly, we calculate the image Ar(x,y):\nAr  x, y   min I  z, y  : z   x  r , x  r  ,\n\n(3)\n\nwhere r is twice the maximum base width (in pixels) of the strongest emission lines in Figure 3a.\nThis was found to be r = 50 pixels. Then, by using the convolution operator, we smooth the\nimage Ar(x,y) along the x-axis and we estimate the continuum background Ic(x,y):\nI c  x, y   Ar  x, y   G  x  \n\n\n\nxmax\n\nAr  t , y  G  x  t  dt ,\n\n(4)\n\n0\n\nwhere G(x) is the Gaussian function with σ = 50 pixels. The image Ic(x,y) is a very good\napproximation of the continuum background spectrum (Figure 3b and 4b). Finally, the difference\nI E  x, y   I  x, y   I c  x, y \n\n5\n\n(5)\n\n\fA. G. Voulgaris et al.\n\n6\nFigure 3 From top to bottom: a) Composed image I(x,y). b) Continuum background Ic(x,y). The North -- South axis in all images is rotated by 29.5o clockwise\nwith respect to the vertical axis.c) E-corona IE(x,y). d) E-corona IE(x,y) linearly enhanced. e) Linearization of the enhanced image with respect to wavelength T1\nIc(x,y). In this spectrum the resolution (Å pixel–1) along the x-axis is constant.\n\n\fSpectroscopic Coronal Observations during the Total Solar Eclipse\n\nis the spectrum of the E-corona (Figure 3c, Figure 4c). In order to enhance the details of the\ndisplayed spectrum of the E-corona, a suitable linear transfer function was applied to the image\nIΕ(x,y) (Figures 3d and 4d).\n\nFigure 4 a) Top left: the cut across the y-axis of Figure 3a. b) Top right: the cut across the y-axis of Figure 3b\nat the same y-location as the white line either side of Figure 3a. c) Bottom left: the cut across the y-axis of image\nIE(x,y) at the same y-location as the white line either side of Figure 3a. d) Bottom right: the cut across the y-axis\nof Figure 3d at the same y-location as the white line either side of Figure 3a.\n\n3.3. Linearization of the Spectrum\nIt is obvious from Figure 2 that the dispersion (Å pixel–1) of the spectrograph depends on\nthe wavelength. This means that in order to proceed with the identification of emission lines we\nhave to linearize our spectra. Let w be the width of IΕ(x,y) and λmin (λmax) the smallest (largest)\nrecorded wavelength in the right (left) limit of IΕ(x,y). Let us define a cut (x,y0) at an arbitrary\nheight y0 across the spectrum and let λ(x) be the corresponding wavelength along the cut. Figure\n2 shows exactly the absolute derivative of λ(x) as a function of wavelength. The function\nλ: [0,w] → [λmin,λmax] of IΕ(x,y) is strictly monotonic and can be estimated by fitting a smooth\ncurve on the points (xi, λi) of emission lines of the flash spectrum that are easily recognized (e.g.\nH, He, Na, Mg, Ca II) of the flash spectrum. For our purpose, we used a fourth-order polynomial.\nThe linearization of the spectra was achieved via the transformation\n\n   x   max \nT1  x, y    w\n, y,\n min  max\n\n7\n\n(6)\n\n\fA. G. Voulgaris et al.\n\n8\nFigure 5 From top to bottom: a) Image T2T1IE(x,y) linearly enhanced. b) Linearization with respect to circumference of the solar disk T3T2T1IE(x,y) linearly enhanced.\nc) f(λ) with υ1 = 270ο and υ2 = 280ο .\n\n\fSpectroscopic Coronal Observations during the Total Solar Eclipse\n\nwhere each pixel at position (x,y) of the spectrum IΕ(x,y) is mapped to the position T1(x,y) of the\nnew spectral domain T1IE(x,y) (Figure 3e).\nWe notice that each circumference of the solar disk in the linearized domain (Figure 3e),\nas a function of wavelength, in the flash spectrum T1IE(x,y), is approached by an ellipse, with\nminor axis [2b] parallel to the y-axis and major axis [2a] passing through the centers (x ́, y0) of\nthe solar images in the spectra. This means that the linear transformation T2(x,y) = (x, ay/b),\nwhere each pixel at the position (x,y) of the spectrum T1IE(x,y) is mapped to the position T2(x,y)\nof the new spectral domain T2T1IE(x,y), transforms the ellipses to circles of radius a (Figure 5a).\nEach pixel at position (x,y) of the spectral image T2T1IE(x,y) lies on a western semicircle\nof radius a centered at a point (x ́, y0). If θ is the polar angle of this pixel, then x = a cosθ + x ́ and\ny = a sinθ + y0. For the linearization of the western semicircumference we used the\ntransformation\nT3  x, y    x  a  a cos  , y0  a  a \n\n(7)\n\nwhere each pixel at position (x,y) of the image T2T1IE(x,y) is mapped to the position T3(x,y) of the\nnew image T3T2T1IE(x,y) (Figure 5b). In image T3T2T1IE(x,y) the horizontal x-axis is proportional\nto the wavelength and the vertical y-axis is proportional to the polar angle. Finally, the function\nf   \n\n1\n\n\n\n\n2\n\n1\n\nT3T2T1I E   ,   d\n\n(8)\n\nis the integrated intensity of the emission lines along the circumference of the solar images in the\ninterval of polar angles [υ1, υ2]=[270ο, 280ο] (Figure 5d).\n\n4. The Emission Spectrum of the Solar Chromosphere and Corona\n4.1. Emission Lines of the Solar Chromosphere\nThe chromospheric emission lines Ηα, Ηβ, Ηγ, Ηδ, He I (D3), Ca II H and K (Pasachoff\nand Suer, 2009; Voulgaris et al., 2010) as well as the emission lines of the heavier elements of\nthe lower chromosphere of Mg I, Fe I / ΙΙ, Na I (D1, 2) were visible just a few seconds after second\ncontact and a few seconds before third contact (namely, after the photosphere was completely\ncovered by the Moon) (Figure 5a). At the same time, on the eastern and western limbs,\nprominences in the emission lines from Η Ι (Balmer series), He I, and from Mg I were also\ndetected.\n4.2. Emission Lines of the Solar Corona\nBesides the chromospheric emission lines, the two basic coronal forbidden lines Fe X\n(6374 Å – ionization potential 235 eV) and Fe XIV (5303 Å – 355 eV) (Jefferies et al., 1970;\nGibson, 1973) were readily seen. In order to investigate the spatial distribution of the above lines\nwe have magnified and rearranged part of Figure 5b (see Figure 6). It is obvious that Fe XIV\nemits at two separate medium heliographic latitudes (6o – 36o N and 24o – 66o S from the solar\n9\n\n\fA. G. Voulgaris et al.\n\nEquator) and at extended heights above the chromosphere, where the temperature is higher,\nwhile there is no emission in the equatorial area (24o S – 6o N). On the contrary, Fe X emission is\nrelatively homogeneous and covers an extended area along the chromosphere and its distribution\noccurs at low heights, where the temperature is lower. The regions covered by the two emission\nlines do not coincide. At this point, it should be mentioned that during the 29 March 2006\neclipse, which occurred well past the\nsolar maximum, the distribution of\nforbidden Fe XIV was much closer to\nthe solar Equator (– 20o to +15o)\n(Voulgaris et al., 2010).\nAt the beginning of a new\nsolar cycle, the butterfly diagram\nrecords the appearance and the\nevolution of sunspots in medium\nheliographic latitudes (≈15o to ≈40o)\nabove (or below) the solar Equator.\nOn the other hand, during the end of\nthe solar cycle sunspots appear close\nFigure 6 Comparison of the two principal coronal emission lines,\nto the solar Equator [≤ |10 o|]. Thus it\nforbidden Fe X and forbidden Fe XIV, in the western limb area.\nseems\nthat\nthe\nheliographic\ndistribution of Fe XIV probably follows a similar butterfly diagram. This correlation is expected\nas the region immediately above sunspots exhibits high activity (eruptive prominences, flares,\netc.), associated with higher temperatures.\nAfter a thorough mathematical analysis, the weak forbidden coronal lines Ni XIII (5115.8\nÅ – 350 eV – Tionization = (1.2 – 2.8)×106 K), Ar X (5539.1 Å – 423 eV – Tionization = (0.35–\n3.0)×106 K)) and the extremely weak line Ca XV (5694 Å – 820 eV – Tionization = (2.2 – 7.0)×106\nK)) (Jefferies et al., 1970; Gibson 1973; Mazzotta et al., 1998) became visible (Figure 5a).\nForbidden Ca XV emission needs the exceptionally high coronal temperatures that\noften occur during solar maximum and, in particular, in energetic regions, such as coronal\nregions above solar flares. However, according to the work of Mazzotta et al. (1998), emission\nfrom multiple ionized elements (such as forbidden Ca XV) can happen even at lower\ntemperatures, albeit with an extremely low intensity, which makes the detection of the emission\nline very difficult.\nDuring the analysis and after the subtraction of the continuum background from the\ncomposite flash spectrum, a faint forbidden emission line of Ca XV (5694 Å) was observed\n(Figure 5a). Despite the fact that this line is extremely weak (200 times fainter than the Fe XIV\nline, Figure 5c), it follows the circular solar limb pattern, similar to the stronger emission lines.\nAs can be readily seen from the width of the line, the spatial distribution of [Ca XV] (5694 Å) is\nextended, signifying that the contribution originates from a wide coronal area covering a large\nrange of heights on the solar corona.\nAs mentioned in the previous paragraph, the forbidden Ca XV (5694 Å) emission line\nhas been detected previously. However, the forbidden Ca XV (5446 Å) line was not detected in\nour data. This line is known to be very weak. Its ratio (Ι5694Å /Ι5446Å) is not constant, varying\nbetween 1.67 and 3.13 (Chevalier and Lambert, 1970). During the total solar eclipse of 30 May\n10\n\n\fSpectroscopic Coronal Observations during the Total Solar Eclipse\n\n1965, the 5694 Å line was detected, but the 5446 Å line was undetectable (Curtis, Dunn, and\nOrrall, 1965). Furthermore, according to BASS2000 (see also Kubát et al., 2010) any telluric\nabsorption lines that could exist in the spectral band around the forbidden Ca XV emission line\nshould be extremely weak, well below the sensitivity of our instrument.\n4.3. The Height of the Chromosphere Deduced from the Mg I, Fe I / II, Na Ι, Ηα and He I (D3)\nEmission Lines\nThe emission lines of the light\nelements H and He were visible many\nseconds after the second contact and\nbefore the third contact (see also\nVoulgaris et al., 2010). This persistence\nreflects the fact that these elements are\ndistributed over large heights above the\nphotosphere. This is corroborated by the\nvisibility of prominences at large heights\nduring the middle of totality. On the\ncontrary, the emission lines of the\nelements heavier than He, such as Fe,\nMg and Na, became visible very briefly\n(a few seconds only) after the second\ncontact (and before the third contact),\nbecause these elements are distributed\nonly in lower heights. It should be noted\nthat during the middle of the eclipse of\n11 July 2010, no emission lines of these\nelements were observed, because the\nregion where they are formed was\nentirely covered by the lunar disk. The\nratio of the angular diameter of the\nMoon to the angular diameter of the Sun\nwas 1.05646 (Espenak and Anderson,\n2008; Jubier, 2010). This relatively large\ndiameter means that during totality, the Figure 7 a) Top: Second (C2) and third (C3) contacts with\nMoon was covering a large portion of respect to the plane of the Moon's orbit. The orientation of the\nthe Sun's atmosphere well above the system agrees with Figures 3 and 5. b) Bottom: Calculation of\nphotosphere. During the middle of height h of the chromosphere as a function of length r. The\ntotality, the Moon was covering an extra segment r is parallel to the moon's orbit.\n39290 km above the eastern and western limbs. This extra coverage during the totality is\nsufficient to completely cover the chromosphere.\nAt our observing location at Easter Island, we were 26.6 km off the center line of the total\nsolar eclipse, so the eclipse was not central from our observing place. During totality, the\nprojected movement of the center of the Moon (M1M0M2), with respect to the center of the Sun\n(S), was in a straight line at constant speed. According to Jubier (2010), the angle M1SC3 is φ =\n13.25ο (Figure 7a) and the point of the third contact took place at the polar angle 275°. (With a\n11\n\n\fA. G. Voulgaris et al.\n\nsmooth lunar limb profile, C3 would be at 282°, but because of a lunar valley located roughly\nbetween 270° and 280°, the real C3 is shifted).\nDuring totality the integrated intensity [ĨE(λ, t)] of the distinct emission lines of each\nchromospheric element, in a suitable region [λ – Δλ/2, λ + Δλ/2] × [υ1, υ2] was measured as a\nfunction of time, t. Δλ was chosen to be twice the width of the Hα line (50 Å). The calculation of\nthe integrated intensity was performed by the relation\nI E  , t  \n\n\n\n  /2\n\n  /2\n\nft    d\n\n(9)\n\nwhere ft(λ) is the function of the integrated intensity of emission lines along the circumference of\nthe images of the solar disk, (eq. 8), from polar angle υ1 = 270ο to υ2 = 280ο, as a function of\ntime t. In this interval of polar angles, no prominences were present. The integrated intensity\n[ĨE(λ, t)] is directly proportional (for suitably small Δυ) to the customary integrated intensity\n[Ε(λ, t)] that was introduced by Cillié and Menzel (1935) and used by Dunn (1968):\n\nE  , t  \n\n\n\n\n\n1/2\n\n\n\nh t \n\n1/2\n\n  \n\n   x, y, z  e  dx dy dz\n\n(10)\n\nwhere ελ(x, y, z) is the volume emission coefficient at a point in the chromosphere and τλ is the\noptical depth measured along the line of sight from that point to the observer. The rectangular\ncoordinate system is shown in Figure 7a (the z-axis is normal to the xy-plane toward the\nobserver) and h(t) is the height of the Moon's limb above the photosphere (transit). When h = 0,\nthe intensity of the emission lines of all elements reaches its maximum value. This maximum\noccurs at second and third contacts (Voulgaris et al., 2010). We define the maximum height that\neach element [i] reaches, as the height [hi,max] above the photosphere where the emission falls\nbelow our detection limit (Figure 8). If the eclipse is central, the two contacts points [C2 and C3]\nare diametrically opposite and the Moon's motion is perpendicular to the tangent of the solar\ndisk at the contact points along the height h of the chromosphere. Since our observing site was\nnot directly on the central line, the direction of the motion of the Moon [r] was at an angle υ =\n13.25ο with respect to the height [h] above the contact points (Figure 7b). We can easily calculate\nthe length r for any element, through the relation r = vΔt, where Δt is the length of time during\nwhich the emission line of the element was detectable, and v is the velocity of projected cover of\nthe solar disk by the Moon. In our case, v was 285 km s–1 (Jubier, 2010). The height [h] is\ncalculated from h ≈ r cosυ = 0.97 r (Figure 7b).\nThe graphs of the integrated intensity [ĨE(λ, t)] of various elements as a function of time\nand height are presented in Figure 8. It is obvious from this figure and from Table 1 that the\nheight of the chromosphere measured by the integrated intensity of the emission lines of the light\nelements H and He is greater than or equal to h1 = 9400 km (equivalent duration 34 seconds). In\naddition, the height of the lower chromosphere from the emission lines of the heavier elements\nNa, Mg, and Fe is greater than or equal to h2 = 3300 km (equivalent duration 12 seconds), i.e.,\nh1/h2 = 2.85. We note that the equivalent duration of the Mg line during the 2008 eclipse was\n8.65 seconds, which corresponds to 3290 km (Voulgaris et al., 2010, Section 2.3.2).\nFor central-line total eclipses and assuming that the height of the chromosphere is 9400\nkm (Table 1) and if the ratio of the angular diameter of the Moon (θ) to the angular diameter of\n12\n\n\fSpectroscopic Coronal Observations during the Total Solar Eclipse\n\nFigure 8 The intensity of the emission lines of Hα (6563 Å), He I (5876 Å), Na I (5896, 5890 Å), Mg I / Fe I /II (5184,\n5173, 5167 Å), and He II (4686 Å) as function of time (bottom) and height above the photosphere (top). The maximum\nintensity of each emission line occurs at third contact.\n\nthe chromosphere is ≥ 1 (i.e. when the ratio θ/θ ≥ 1.0134), then, during the middle of totality,\nno chromospheric emission lines of H and He are detected in the flash spectrum (with the\nexception of large prominences). For 1.0 ≤ θ/θ ≤ 1.0047 the emission lines of heavier elements\nof the lower chromosphere (Table 1) are visible in the middle of totality (this mainly concerns\nhybrid eclipses). We note that the ratio θ/θ of the 11 July 2010 eclipse was 1.05646; therefore,\nit is not surprising that we have not detected emission lines from Hα and He during the middle of\ntotality (Figure 8).\nTable 1 The duration of emission and the minimum height above the photosphere where the basic\nchromospheric elements can be detected\nEmission line\n\nDuration of emission (s)\n\nMinimum height (km)\n\nHα\n\n34\n\n9400\n\nHe I\n\n34\n\n9400\n\nNa I\n\n12\n\n3300\n\nMg I/ Fe I / II\n\n12\n\n3300\n\nHe II\n\n8\n\n2200\n\n13\n\n\fA. G. Voulgaris et al.\n\n4.4. The Emission Line of He II (4686 Å) in the Transition Zone\nIn our flash spectra, an exceptionally weak forbidden emission line of ionized helium at\n4686 Å – 4685.7 Å and 4685.4 Å blended lines (NIST) – was visible during third contact. This\nline is exceptionally strong in some variable stars, e.g., in the irregular type-1 variable star V617\n\nFigure 9 (Left) An enlargement of part of Figure 3d. The emission lines of elements Hβ, He I, and He II\nare visible in the flash spectrum. (Right) The integrated photometric profile along the white line on either\nside of Figure 3a.\n\nSgr (Cieslinski, Diaz, and Steiner, 1999; Steiner et al., 1999). In these stars, the detected\nforbidden He II emission line is two–three times stronger than the Ηβ line. In the data presented\nin Figure 9, the intensity of the forbidden He II line is 150 times weaker than the Ηβ line (4861\nÅ) and four times weaker than the He I 4713 Å line.\nThe ionization energy of He II is 54 eV, and the ionization temperature is about 50000 K\n(Mariska, 1992). The He II layer is distributed in the transition zone (Bazin et al., 2011) between\nthe chromosphere and the corona, where there is a rapid increase of the temperature. In this zone\nseveral low ionization elements, like C IV, Si IV, O IV, N IV, have been detected in UV, from\nspace telescopes (Sandlin et al., 1977; Dere et al., 1984). The detection of these lines is difficult\nin visible light, since the majority of these elements radiate mainly in the UV part of the\nspectrum. From our He II data the transition zone extends up to 2200 ± 280 km, indicating that\nthis layer is very thin. The FWHM of this line has been measured to be 0.25 Å (Hirayama and\nMakoto, 1984).\nNon-detections include the forbidden emission line of He II at 5411.5 Å, as well as\nforbidden emission lines of several other transition-zone elements, such as C IV (4658.3 Å,\n5801.33 Å, 5811.98 Å) and Si IV (4088.85 Å, 4116.1 Å, 4631.24 Å, 4654.32 Å) (NIST). Of\ncourse, the permitted He II Lyman alpha line at 304 Å is well mapped from space.\n\n5. Conclusions\nIn this work, we have described the analysis of the spectral data obtained during the total\nsolar eclipse of 11 July 2011, at Easter Island, Chile. This method can be used in the analysis of\n14\n\n\fSpectroscopic Coronal Observations during the Total Solar Eclipse\n\nany flash-spectrum data. The Easter Island eclipse coincided with the start of the new cycle,\nSolar Cycle 24, which commenced with relatively increased activity. The process of the\nsubtraction of the continuum background from all spectra\n(i)\n(ii)\n\nrevealed the extended distribution of the basic lines emitted by the solar corona, and\nenhanced the exceptional weak forbidden emission coronal lines Ni XIII, Ar X, and\nCa XV.\n\nIn spite of the fact that forbidden Ca XV is usually emitted in regions with very high temperature,\nwe detected it in regions of relatively low temperature. Besides the background subtraction, we\ntransformed our spectra to a linear scale of wavelengths and converted the heliographic circular\nsolar emission lines into linear topographic projections, which helped us recognize several\npreviously unknown emission lines and integrate their intensity.\nBy comparing the distribution of the forbidden Fe X and Fe XIV emission lines, it is\nobvious that the regions from which they are emitted do not coincide, as has been shown by\nTakeda et al. (2000) from eclipse observations, by Singh et al. (2002, 2003) from coronagraph\nobservations, and by others. Forbidden Fe XIV is detected at large coronal heights whereas\nforbidden Fe X is detected closer to the chromosphere. The heliographic distribution of forbidden\nFe XIV probably follows a pattern similar to the well-known butterfly diagram. The height of the\nchromosphere was measured using the method of lunar disk transit on the solar disk using the\nlight elements H and He, whereas the height of the lower chromosphere was measured using\nheavier elements such as Na, Mg and Fe. The height of the transition zone was determined by the\nsame method using the high-temperature ion He II that is so well mapped with the Extremeultraviolet Imaging Telescope on the Solar and Heliospheric Observatory and with the\nAtmospheric Imaging Array on the Solar Dynamics Observatory. It will be interesting to\ncompare our current results from the Easter Island total solar eclipse at the beginning of the solar\nmaximum with the results we expect to obtain during the next total solar eclipse, in Australia on\n14 November 2012 (13 November 2012 UT), which will happen much closer to the solar\nmaximum.\n\nAcknowledgements\nWe thank the Research Committee of the Aristotle University of Thessaloniki for financial\nsupport, E. Vanidhis for valuable help with optical laboratory measurements, Dimitrios Tsampouras of\nthe Planetarium of Thessaloniki and George Pistikoudis and Spyros Kanouras for their assistance. We\nthank Robert Lucas, Muzhou Lu, and Craig Malamut for assistance on site. JMP's current eclipse\nresearch is supported in part by the Solar Terrestrial Research program of the Astrophysics and Geospace\nSciences Division of the National Science Foundation through grant AGS-1047726. The 2010 expedition\nreceived support from the Brandi Fund and Science Center funds from Williams College. JMP's solar\nresearch during the period of this eclipse and analysis has also been supported in part by grant\nNNX10AK47A from NASA's Marshall Space Flight Center. At the University of Chicago, partial\nfinancial support was provided by the Enrico Fermi Institute's Research Fund EFI 2-60190 to TEE.\n\n15\n\n\fA. G. Voulgaris et al.\n\nReferences\nBASS2000: http://bass2000.obspm.fr/download/solar_spect.pdf.\nBazin, C., Koutchmy, S., Tavabi, E., 2010, The He I and He II chromospheric shells and the\nTransition Region Solar and Stellar Astrophysics, arXiv:1008.0404 (Submitted on 2 Aug\n2010).\nBuil, C.: 1999, http://astrosurf.com/buil/us/spectro11/specalib.htm.\nChevalier, R., Lambert, D.: 1970, The excitation of the forbidden coronal lines II: [CaXV] λλ\n5694 and 5446, Solar Phys. 11, 243-257.\nCieslinski, D., Diaz, M.P., Steiner, J.E.: 1999, A Spectroscopic Study of V617 Sagittarii, Astron.\nJ. 117, 534-540.\nCillié, G.G., Menzel, D.H.: 1935, Physical State of the Solar Corona, Harvard Circ., No. 410.\nCurtis, G.W., Dunn, R.B., Orrall, F.Q.: The Coronal Emission Spectrum during the Solar Eclipse\nof May 30 1965. 1965 Solar Eclipse Symposium, Proceedings of the Symposium held at NASA\nAmes Research Center, Moffett Field, CA, 137\nDe Castro, E., Morandi, C.: 1987, Registration of Translated and Rotated Images Using Finite\nFourier Transform. IEEE Trans. Pattern Analysis Machine Intell., 9(5), 700-703.\nDere, K., Bartoe D., Brueckner G.: 1984, High-resolution telescope and spectrograph\nobservations of the quiet solar chromosphere and transition zone, Astrophys J. 281, 870-883.\nDruckmüller, M., 2009, Phase Correlation Method for the Alignment of Total Solar Eclipse\nImages, Astrophys. J. 706, 1605-1608.\nDruckmüller, M., Rušin, V., Minarovjech, M.: 2006, A new numerical method of total solar\neclipse photography processing, Contrib. Astron. Obs. Skalnaté Pleso 36, 131-148.\nDunn, R.B., Evans, J.W., Jefferies, J.T., Orrall, F.Q., White, O.R., Zirker, J.B.: 1968, The\nChromospheric Spectrum at the 1962 Eclipse, Astrophys. J. Suppl., 15, 275-421.\nEspenak F., Anderson, J.: 2008, Annular and Total Solar Eclipses of 2010, NASA/TP-2008214171.\nGibson, E.G.: 1973, The Quiet Sun, NASA SP-303, Washington, DC.\nGolub, L., Pasachoff, J.M.: 2010, The Solar Corona, 2nd ed., Cambridge University Press, New\nYork.\nHabbal, S.R., Druckmüller, M., Morgan, H., Daw, A., Johnson, J., Ding, A., Arndt, M., Esser,\nR., Rušin, V., Scholl, I.: 2010, Mapping the Distribution of Electron Temperature and Fe\nCharge States in the Corona with Total Solar Eclipse Observations, Astrophys. J. 708, 16501662.\nHirayama, T., Makoto, I.: 1984, Line width observation of He I 4713 Å and He II 4686 Å in the\nchromosphere, Solar Phys. 90, 291-302.\nJefferies J.J., Orrall F.W., Zirker J.B.: 1970, The spectrum of the inner corona during the total\nsolar eclipse of 30 May 1965, Solar Phys, 16(1), 103-110.\nJubier, X.: 2010: http://xjubier.free.fr/en/site_pages/Solar_Eclipses.html\nKubát, J., Saad, S.M., Kawka, A., Nouh, M.I., Iliev, L., Uytterhoeven, K., Korčáková D.,\nHadrava, P., Škoda, P., Votruba, V., Dovčiak, M., Šlechta, M.: 2010, Spectroscopic analysis of\nthe B/Be visual binary HR 1847, Astron. Astrophys., 520, A103, 1-17.\nMariska, J.T.: 1992, The Solar Transition Region, Cambridge University Press, Cambridge.\nMazzotta, G., Mazzitelli, G., Colafrancesco, S. and Vittorio N.: 1998,\nIonization balance for\noptically thin plasmas: rate coefficients for all atoms\nand ions of the elements H to Ni,\nAstron. Astrophys., 133, 403 - 409.\n16\n\n\fSpectroscopic Coronal Observations during the Total Solar Eclipse\n\nNational Institute of Standards and Technology (NIST):\nhttp://physics.nist.gov/PhysRefData/ASD/levels_form.html\n\nPasachoff, J.M., Rušin, V., Druckmüllerová, H., Saniga, M., Lu, M., Malamut, C., Seaton, D.B.,\nGolub, L., Engell, A.J., Hill, S.W., Lucas, R.: 2011, Structure and Dynamics of the 11 July\n2010 Eclipse White-Light Corona, Astrophys. J. 734, 114-123.\nPasachoff, J.M.: 2009a, Solar Eclipses as an Astrophysical Laboratory, Nature 459, 789-795,\nDOI 10.1038/nature07987.\nPasachoff, J.M.: 2009b, Scientific Observations at Total Solar Eclipses, Res. in Astron.\nAstrophys. 9, 613-634.\nPasachoff, J.M.: 2010, Resource Letter SP-1 on Solar Physics, Am. J. Phys. 78, 890-901.\nPasachoff, J.M.: 2011, Is the Sunspot Cycle About to Stop?,\nhttp://www.skyandtelescope.com/community/skyblog/newsblog/123844859.html\n\nPasachoff, J.M., MacRobert, A.: 2011a, Is the Sunspot Cycle About to Stop?, Sky Tel. 22(3), 1213.\nPasachoff, J.M., Rušin, V., Saniga, M., Druckmüllerová, H., and Babcock, B.A.: 2011b,\nStructure and Dynamics of the 22 July 2009 Eclipse White-Light Corona, Astrophys. J. 742,\n29-42.\nPasachoff, J.M., Sandford, M.T., II, Keller, C.F., Jr.: 1978, Infrared Observations of the 1977\nTotal Solar Eclipse, Bull. Am. Astron. Soc. 10, 431 (1978).\nPasachoff, J.M., Suer, T.-A., 2010, The Origin and Diffusion of the H and K Notation, J. Astron.\nHistory Heritage 13(2), 121-127.\nReddy, B.S., Chatterji, B.N.: 1996, An FFT-based technique for translation, rotation, and scaleinvariant image registration, IEEE Trans. Image Proc. 5, 1266–1271.\nSandlin, G., Brueckner, G., Tousey, R.: 1977, Forbidden lines of the solar corona and transition\nzone 975-3000 Å, Astrophys. J. 214, 898-904.\nSingh, J., Sakurai, T., Ichimoto, K., Suematsu, Y., Takeda, A.: 2002, Spectroscopic Studies of\nthe Solar Corona. II. Properties of Green and Red Emission Lines in Open and Closed Coronal\nStructures, Publ. Ast. Soc. Japan 54, 793-806.\nSingh, J., Ichimoto, K., Sakurai, T., Muneer, S.: 2003, Spectroscopic Studies of the Solar\nCorona. IV. Physical Properties of Coronal Structure, Astrophys. J. 585, 516-523.\nSingh, J., Hasan, S., Gupta G., Nagaraju K., Banerjee D.: 2011, Spectroscopic Observation of\nOscillations in the Corona during the Total Solar Eclipse of 22 July 2009, Solar Phys. 270,\n213-233.\nSteiner, J. E., Cieslinski, D., Jablonski, F.J., Williams, R.E.: 1999, The photometric and\nspectroscopic characterization of the V Sagittae star V617 Sagittarii, Astron. Astrophys. 351,\n1021-1027.\nTakeda, A., Kurokawa, H., Kitai, R., Ishiura, K.: 2000, Contribution and Properties of the Greenand Red-Line Coronal Loops in the K-Corona, Publ. Astron. Soc. Japan 52, 375-391 and\nPlates 29-39.\nVoulgaris, A., Athanasiadis, T., Seiradakis, J.H., Pasachoff, J.M.: 2010, A Comparison of the\nRed and Green Coronal Line Intensities at the 29 March 2006 and the 1 August 2008 Total\nSolar Eclipses: Considerations of the Temperature of the Solar Corona, Solar Phys. 264(1), 4555.\nWagner, W., House, L.: 1968, A survey of current coronal visible line identifications, Solar\nPhys. 5, 55-60, D. Reidel Publishing Company, Dordrecht-Holland.\n\n17\n\n\f"}