{"id": "http://arxiv.org/abs/0707.1296v4", "guidislink": true, "updated": "2007-10-22T13:34:30Z", "updated_parsed": [2007, 10, 22, 13, 34, 30, 0, 295, 0], "published": "2007-07-09T16:30:30Z", "published_parsed": [2007, 7, 9, 16, 30, 30, 0, 190, 0], "title": "No light shining through a wall : new results from a photoregeneration\n  experiment", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0707.2413%2C0707.4041%2C0707.2133%2C0707.3768%2C0707.0221%2C0707.2879%2C0707.2019%2C0707.2200%2C0707.3540%2C0707.1935%2C0707.0986%2C0707.0178%2C0707.4339%2C0707.3431%2C0707.4225%2C0707.1428%2C0707.1096%2C0707.0933%2C0707.2431%2C0707.0648%2C0707.3062%2C0707.4416%2C0707.3849%2C0707.2585%2C0707.2890%2C0707.1253%2C0707.0008%2C0707.1660%2C0707.4323%2C0707.0118%2C0707.2204%2C0707.0765%2C0707.2655%2C0707.3408%2C0707.3779%2C0707.1952%2C0707.3085%2C0707.0182%2C0707.0217%2C0707.2898%2C0707.4536%2C0707.0594%2C0707.2477%2C0707.3050%2C0707.3797%2C0707.1091%2C0707.2968%2C0707.4282%2C0707.3554%2C0707.4115%2C0707.2378%2C0707.3595%2C0707.2417%2C0707.3271%2C0707.4183%2C0707.1609%2C0707.4266%2C0707.4399%2C0707.0455%2C0707.3015%2C0707.3960%2C0707.2678%2C0707.0094%2C0707.3330%2C0707.0613%2C0707.4676%2C0707.2565%2C0707.1065%2C0707.0111%2C0707.3470%2C0707.3397%2C0707.0588%2C0707.2230%2C0707.2570%2C0707.2243%2C0707.4565%2C0707.4397%2C0707.0438%2C0707.0961%2C0707.0353%2C0707.1236%2C0707.1348%2C0707.2680%2C0707.4514%2C0707.1506%2C0707.0404%2C0707.1562%2C0707.1424%2C0707.1341%2C0707.1354%2C0707.1296%2C0707.2238%2C0707.2128%2C0707.3018%2C0707.4475%2C0707.1681%2C0707.4002%2C0707.1337%2C0707.0255%2C0707.4085%2C0707.2761&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "No light shining through a wall : new results from a photoregeneration\n  experiment"}, "summary": "Recently, axion-like particle search has received renewed interest. In\nparticular, several groups have started ``light shining through a wall''\nexperiments based on magnetic field and laser both continuous, which is very\ndemanding in terms of detector background. We present here the 2$\\sigma$ limits\nobtained so far with our novel set-up consisting of a pulsed magnetic field and\na pulsed laser. In particular, we have found that the axion-like particle two\nphotons inverse coupling constant $M$ is $> 8\\times 10^5$ GeV provided that the\nparticle mass $m_\\mathrm{a} \\sim$ 1 meV. Our results definitively invalidate\nthe axion interpretation of the original PVLAS optical measurements with a\nconfidence level greater than 99.9%.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0707.2413%2C0707.4041%2C0707.2133%2C0707.3768%2C0707.0221%2C0707.2879%2C0707.2019%2C0707.2200%2C0707.3540%2C0707.1935%2C0707.0986%2C0707.0178%2C0707.4339%2C0707.3431%2C0707.4225%2C0707.1428%2C0707.1096%2C0707.0933%2C0707.2431%2C0707.0648%2C0707.3062%2C0707.4416%2C0707.3849%2C0707.2585%2C0707.2890%2C0707.1253%2C0707.0008%2C0707.1660%2C0707.4323%2C0707.0118%2C0707.2204%2C0707.0765%2C0707.2655%2C0707.3408%2C0707.3779%2C0707.1952%2C0707.3085%2C0707.0182%2C0707.0217%2C0707.2898%2C0707.4536%2C0707.0594%2C0707.2477%2C0707.3050%2C0707.3797%2C0707.1091%2C0707.2968%2C0707.4282%2C0707.3554%2C0707.4115%2C0707.2378%2C0707.3595%2C0707.2417%2C0707.3271%2C0707.4183%2C0707.1609%2C0707.4266%2C0707.4399%2C0707.0455%2C0707.3015%2C0707.3960%2C0707.2678%2C0707.0094%2C0707.3330%2C0707.0613%2C0707.4676%2C0707.2565%2C0707.1065%2C0707.0111%2C0707.3470%2C0707.3397%2C0707.0588%2C0707.2230%2C0707.2570%2C0707.2243%2C0707.4565%2C0707.4397%2C0707.0438%2C0707.0961%2C0707.0353%2C0707.1236%2C0707.1348%2C0707.2680%2C0707.4514%2C0707.1506%2C0707.0404%2C0707.1562%2C0707.1424%2C0707.1341%2C0707.1354%2C0707.1296%2C0707.2238%2C0707.2128%2C0707.3018%2C0707.4475%2C0707.1681%2C0707.4002%2C0707.1337%2C0707.0255%2C0707.4085%2C0707.2761&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Recently, axion-like particle search has received renewed interest. In\nparticular, several groups have started ``light shining through a wall''\nexperiments based on magnetic field and laser both continuous, which is very\ndemanding in terms of detector background. We present here the 2$\\sigma$ limits\nobtained so far with our novel set-up consisting of a pulsed magnetic field and\na pulsed laser. In particular, we have found that the axion-like particle two\nphotons inverse coupling constant $M$ is $> 8\\times 10^5$ GeV provided that the\nparticle mass $m_\\mathrm{a} \\sim$ 1 meV. Our results definitively invalidate\nthe axion interpretation of the original PVLAS optical measurements with a\nconfidence level greater than 99.9%."}, "authors": ["Cecile Robilliard", "Remy Battesti", "Mathilde Fouche", "Julien Mauchain", "Anne-Marie Sautivet", "Francois Amiranoff", "Carlo Rizzo"], "author_detail": {"name": "Carlo Rizzo"}, "author": "Carlo Rizzo", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.99.190403", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0707.1296v4", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0707.1296v4", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Version that will appear in Physical Review Letters, Vol. 99, n. 18,\n  (2 Nov 2007)", "arxiv_primary_category": {"term": "hep-ex", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0707.1296v4", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0707.1296v4", "journal_reference": "Phys.Rev.Lett.99:190403,2007", "doi": "10.1103/PhysRevLett.99.190403", "fulltext": "No light shining through a wall : new results from a photoregeneration experiment\nC. Robilliard1 , R. Battesti2 , M. Fouché1 , J. Mauchain2 , A.-M. Sautivet3 , F. Amiranoff3 , and C. Rizzo1\n1\n\narXiv:0707.1296v4 [hep-ex] 22 Oct 2007\n\nLaboratoire Collisions Agrégats Réactivité, UMR 5589 CNRS - Université\nPaul Sabatier Toulouse 3, IRSAMC, 31062 Toulouse cedex 9, France.\n2\nLaboratoire National des Champs Magnétiques Pulsés, UMR5147 CNRS-INSA-UPS,\n143 Avenue de Rangueil, 31400 Toulouse cedex, France.\n3\nLaboratoire pour l'Utilisation des Lasers Intenses,\nÉcole Polytechnique, CNRS, CEA, UPMC, 91128 Palaiseau, France.\n(Dated: February 15, 2013)\nRecently, axion-like particle search has received renewed interest. In particular, several groups\nhave started \"light shining through a wall\" experiments based on magnetic field and laser both\ncontinuous, which is very demanding in terms of detector background. We present here the 2σ\nlimits obtained so far with our novel set-up consisting of a pulsed magnetic field and a pulsed laser.\nIn particular, we have found that the axion-like particle two photons inverse coupling constant M is\n> 8 × 105 GeV provided that the particle mass ma ∼ 1 meV. Our results definitively invalidate the\naxion interpretation of the original PVLAS optical measurements with a confidence level greater\nthan 99.9%.\nPACS numbers:\n\nThe axion was first proposed 30 years ago to solve the\nstrong CP problem [1], but other models also support the\nexistence of such light, neutral, spin-zero bosons [2, 3]\ncalled axion-like particles. Although no axion has been\ndefinitely detected yet, several experiments and astronomical observations have limited the range of possible\naxion-like particle mass ma and inverse axion-like particle two photons inverse coupling M [4].\nLast year, an italian collaboration (PVLAS) announced an unexpected observation of a magnetic dichroism in vacuum which they suggested might be due to photoregeneration of axion-like particles [5]. However, their\nmass and two photon inverse coupling constant inferred\nfrom these PVLAS measurements were seriously inconsistent with the CAST limits [6], albeit the latter are\nmodel dependent. There was an urgent need for a direct\nindependent experimental test of the observed dichroism\n[7].\nAll that has raised a renewed interest in axion-like particle search, in particular for model independent purely\nlaboratory-based experiments [8]. The most popular setup, commonly called \"light shining through a wall\", is\na photoregeneration experiment based on the Primakoff\neffect coupling an axion-like particle with two photons\n(a real one from the laser field and a virtual one from\nan external magnetic field) [9]. The experiment consists\nof converting photons into axion-like particles of identical energy in a transverse magnetic field, then blocking the photon beam with a wall. The axion-like particles hardly interact with the wall and are converted\nback to photons in a second magnet. Finally, the regenerated photons are counted with an appropriate detector. Such an experiment was conducted in the 90's\nby the BFRT collaboration without detecting any regenerated photon signal, which led to limits on the axion\nparameters [10]. Mainly motivated by the PVLAS as-\n\ntonishing results, several \"light shining through a wall\"\nexperiments have been proposed and are currently under construction [11] ; at DESY the Axion-Like Particle\nSearch project (ALPS) ; at CERN, the Optical Search for\nQED vacuum magnetic birefringence, Axions and photon Regeneration project (OSQAR) ; at Jefferson Laboratory, the LIght PseudoScalar Search project (LIPSS)\n; at Fermilab, the GammeV Particle Search Experiment\nproject. Eventually, the PVLAS collaboration disclaimed\ntheir previous observations [12].\nExperimentally, the main difficulty lies in detection.\nThe expected regeneration rate is indeed very weak – less\nthan 10−20 – so that optical shielding has to be perfect\nand the detector background very low.\nIn this letter, we detail our project, and we present the\nlimits on the axion-like particle mass and two photons inverse coupling constant we have obtained so far. We have\nfound an original and efficient way to solve the detection problem as both the laser and the magnetic field are\npulsed, as well as our detector. Contrary to other similar\nexperiments requiring long integration times, we are not\nlimited by the background of the detector as the photons\nare concentrated in very intense and short laser pulses.\nWe are the first to present here the results of a pulsed\n\"light shining through a wall\" experiment, specially designed to test the PVLAS claims. In particular, we have\nfound that the axion-like particle two photons inverse\ncoupling constant M is > 8 × 105 GeV provided that the\nparticle mass ma ∼ 1 meV. Our results definitively invalidate the axion interpretation of the original PVLAS optical measurements with a confidence level greater than\n99.9%.\nOur experimental setup shown in Fig. 1 is based on\nthree synchronized pulsed elements: a very energetic\nlaser, two pulsed magnets which are placed on each side\nof the wall and a time-gated single photon detector. We\n\n\f2\n\"Wall\"\nGeneration\nmagnet\n\nFocalisation lens\n\nRegeneration\nmagnet\n\nB\n\n1.5 kJ\nin 5 ns,\nλ=1.053 μm\n\nCryostat\nVacuum\n\nBellow\n\nB\n\nBlind\nflanges\n\nFibre coupler\n\n30 m multimode\nfibre to the single\nphoton detector\n\nFIG. 1: Scheme of our experimental setup.\n\nhave chosen this pulsed approach as it allows us to measure very small conversion rates free from the inevitable\nbackground counts of photon detectors.\nThe conversion and reconversion transition rate (in\nnatural units h̄ = c = 1, with 1 T ≡ 195 eV2 and 1\nm ≡ 5 × 106 eV−1 ) after propagating over a distance z\nin the inhomogeneous magnetic field B writes [13]:\n\nP (z) =\n\n2\n\nz\n\nZ\n\ndz ′ ∆M (z ′ ) × exp(i∆a z ′ ) ,\n\n(1)\n\n0\nm2\n\nB\nand ∆a = − 2ωa with the photon\nwhere ∆M = 2M\nenergy ω. Note that this equation is valid both for\npseudoscalar and scalar particles, but pseudoscalar (resp.\nscalar) particles couple to photons with a polarization\nparallel (resp. orthogonal) to the magnetic field. We\nhave two identical magnets, the detection rate of regenerated photons is given by\n\nR = P2\n\nP\nη,\nω\n\n(2)\n\nwith P the power laser and η the global detection efficiency.\nStudying Eqs. (1) and (2), we can easily see that the\nnumber of incident photons, the integral of the transverse\nmagnetic field over the magnet length L:\nZ\n\n+L/2\n\nBdz = B0 Leq ,\n\n(3)\n\n−L/2\n\nand the detection efficiency have to be maximized. We\ndefine B0 as the maximum field and Leq as the equivalent\nlength of a magnet producing a uniform magnetic field\nB0 . On the other hand, P (z) oscillates for too long magnets. The length leading to the highest conversion rate\nfor a homogeneous magnetic field is Lopt = 2πω/m2a . For\noptical frequencies and an axion-like particle mass on the\norder of 1 meV, this length is on the order of 1 m.\nIn order to have the maximum number of incident photons for the laser source at a wavelength that can be efficiently detected, we have chosen to set up the experiment\nat LULI, Palaiseau, France, on the Nano 2000 chain. It\ncan deliver up to 1.5 kJ over 4.8 ns (FWHM) –as shown in\nthe inset of Fig. 2 – with ω = 1.17 eV. This corresponds\n\nto Ninc = 8 × 1021 photons per pulse. The repetition\nrate is 1 pulse every 2 hours. The vertically linearly polarized incident beam has a 186 mm diameter and is almost perfectly collimated. A deformable mirror included\nin the middle of the amplification chain corrects the spatial phase of the beam to obtain at focus a spot better\nthan two diffraction limits. It is then focused just behind the wall using a lens which focal length is 20.4 m.\nThe beam is apodized to prevent the incoming light from\ngenerating a disturbing plasma on the sides of the vacuum tubes. Before the wall where the laser beam propagates, a vacuum better than 10−3 mbar is necessary in\norder to avoid air ionization. Two turbo pumps along\nthe vacuum line give 10−3 mbar near the lens and better\nthan 10−4 mbar close to the wall. The wall is made of a\n15 mm width aluminum plate to stop every incident photon while axion-like particles continue. It is tilted by 45 ◦\ncompared to the axis of the laser propagation in order to\nincrease the area of the laser impact and to avoid back\nreflected photons. In the second magnetic field region, a\nvacuum better than 10−3 mbar is also maintained.\nFor the magnets, we use a pulsed technology. The\npulsed magnetic field is produced by a transportable generator developed at LNCMP, Toulouse, France, which\nconsists of a capacitor bank releasing its energy in the\ncoils in a few milliseconds [14]. A typical time dependence of the magnetic field in our coils is shown in Fig. 2.\nBesides, a special coil geometry has been developed in\norder to reach the highest and longest transverse magnetic field [15]. A 12 mm diameter aperture has been\nmade inside the magnets for the laser beam. As for usual\npulsed magnets, the coils are immersed in a liquid nitrogen cryostat to limit the consequences of heating. When\nthe magnetic field is maximum, the repetition rate is set\nto 5 pulses per hour. A delay between two pulses is necessary to get back to the temperature of equilibrium which\nis monitored via the coil resistance. During data acquisition, our coils provide B0 ≥ 12.3 T over an equivalent\nlength Leq = 365 mm. The magnetic field B0 remains\nconstant (±0.3%) during τB = 150 μs, a very long time\ncompared to the 5 ns laser pulse. During operation the\nmagnetic pulse is triggered by a signal from the laser\nchain which has a stability ensuring that the laser pulse\nhappens within these 150 μs. In order to detect pseudoscalar particles, the transverse magnetic field is parallel to the laser polarization.\nThe last principal element is the single photon detector that has to meet several criteria. In order to have\na sensitivity as good as possible, the regenerated photon detection has to be at the single photon level. The\nintegration time is limited by the 5 ns laser pulse. This\nimposes a detector with a dark count far lower than 1\nover this integration time so that a non zero regenerated\nphoton counting would be significant.\nOur detector is a commercially available single photon\nreceiver from Princeton Lightwave which has a high de-\n\n\f3\n\nIntensity\n\n12\n10\n\nB0 (T)\n\n8\n6\n\n-4\n\n4\n\n-2 0 2\nTime (ns)\n\n4\n\n6\n\n2\n0\n-2\n\n0\n\n2\n\n4\n6\nTime (ms)\n\n8\n\n10\n\n12\n\nFIG. 2: Magnetic field B0 at the center of the magnet as a\nfunction of time. The maximum is reached within 1.75 ms and\ncan be considered as constant (±0.3%) during τB = 150 μs.\nThe 5 ns laser pulse is applied during this interval. Inset:\nTemporal profile of the laser pulse.\n\ntection efficiency at 1.05 μm. It integrates a 80 × 80 μm2\nInGaAs Avalanche Photodiode (APD) thermoelectrically\ncooled, with all the necessary bias, control and counting\nelectronics. Light is coupled to the photodiode through a\nFC/PC connector and a multimode fiber. When the detector is triggered, the APD bias voltage is raised above\nits reverse breakdown voltage Vbr to operate in \"Geiger\nmode\". For our experiment, the bias pulse width is 5 ns\nto correspond with the laser pulse.\nThe APD bias voltage is then adjusted to obtain the\nbest compromise between the detection efficiency and the\ndark count rate per pulse. The detection efficiency η is\nmeasured by illuminating the detector with a calibrated\nlaser intensity, η = 0.50(0.02). The dark count rate is\nabout 5 × 10−4 counts per pulse.\nAfter the second magnet, regenerated photons are injected into the detector through a coupling lens plus a\ngraded index multimode fiber with a 62.5 μm core diameter, a 0.27 numerical aperture and an attenuation lower\nthan 1 dB/km. These parameters ensure we can easily\ninject light into the fiber with a high coupling ratio, even\nwhen one takes into account the pulse by pulse instability\nof the propagation axis that can be up to 9 μrad. During data acquisition, a typical coupling efficiency through\nthe fibre was found to be about ηc = 0.85. This efficiency\nis measured by removing the wall and the blind flanges\n(see Fig. 1), and by using the laser beam from the pilot oscillator without chopping nor amplifying it. This\nprocedure ensures that the pulsed kJ beam is perfectly\nsuperimposed to the alignment beam.\nThe only remaining source of misalignment lies in thermal effects during the high energy laser pulse, which\ncould slightly deviate the laser beam, hence generating\nsupplementary losses in fibre coupling. This misalign-\n\nFIG. 3: Coincidence rate between the arrival of photons on\nthe detector and its 5 ns detection gate as a function of an\narbitrary delay time. The arrow indicates our working point,\nchosen in order to maximize the coincidence rate.\n\nment is reproducible. This means that it can be corrected\nby properly changing the initial laser pointing. By monitoring the optical path followed by the high energy beam\nfor each pulse, we were able to take such misalignment\nlosses into account, and we have observed a maximum\nvalue of 20% of coupling reduction.\nThe detector gate is triggered with the same fast signal\nas the laser, using delay lines. We have measured the\ncoincidence rate between the arrival of photons on the\ndetector and the opening of the 5 ns detector gate as\na function of an adjustable delay. We have chosen our\nworking point in order to maximize the coincidence rate\n(see fig. 3). To perform such a measurement we used the\nlaser pilot beam which was maximally attenuated and\nchopped with a pulsed duration of 5 ns, exactly as the\nkJ beam.\nThe fiber to inject the detector is 30 m long so that\nit can be placed far from the magnets to avoid potential\nelectronic noise during magnetic shots. In addition the\ndetector is placed in a shielding bay to prevent electromagnetic noise during laser pulses.\nSo far, during data acquisition, a total amount of about\n17.4 kJ has reached the wall in 14 different pulses. This\ncorresponds to about 9.3×1022 photons. To evaluate the\nactual number of incident photons that could yield a regenerated photon observable by the detector, we took\ninto account for each pulse the fibre coupling ηc , the misalignment due to thermal effects during the pulse. We\nhave also evaluated the percentage of the whole laser energy (see inset of Fig. 2) actually contained in the 5 ns\ndetection gate, which is 93 %. All these experimental\nparameters are known with a few percent errors. The effective number of photons is about 6.7 × 1022, which corresponds to about 12.5 kJ. No regenerated photon has\nbeen detected. In this case, the measurement error is\ngiven by the number of photons that could have been\nmissed due to the non perfect detection. The probability Pn that n incident photons have been missed by the\ndetector is Pn = (1 − η)n . Dark count is negligible. A\n\n\f4\nexcl. by this work\nexcl. by BFRT\nCL 95%\nCL 99.9%\n\n6\n\nM (GeV)\n\n10\n\nWe plan to improve our apparatus so that with about\n100 laser pulses we will be able to give more stringent\nlimits on M than the one given by the BFRT experiment\nfor all the values of ma .\n\n5\n\n10\n\n4\n\n10\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n2\n\n1\nma (meV)\n\nFIG. 4: 95% confidence level limits on the axion-like particle\ntwo photons inverse coupling constant M as a function of the\naxion-like particle mass ma obtained thanks to our null result\n(dotted line). The area below our curve is excluded. Our\nlimits are compared to the 95 % confidence level exclusion\nregion obtained by the BFRT photon regeneration experiment\n[10].\n\nstandard deviation σ means that a result outside the window ±2σ corresponds to Pn < 0.05, which yields about\n4 missed photons for our value of η.\nThe limits at 95 % and 99.9 % confidence level that we\nhave reached so far are plotted on Fig. 4. These have been\ncalculated by numerically solving Eq. (1). The area below\nour curve is excluded by our null result. In particular the\naxion-like particle two photons inverse coupling constant\nM is > 8×105 GeV provided that the particle mass ma ∼\n1 meV. This improves the exclusion region obtained on\nBFRT photon regeneration experiment [10]. In this mass\nregion their results were limited by the axion-like particle\nphoton oscillation due to the length of their magnets.\nUsing shorter magnets we are able to enlarge the mass\nrange exclusion area.\nIn ref. [5], the PVLAS collaboration suggested that\ntheir claimed observation of a vacuum magnetic dichroism could be explained by the existence of an axion-like\nparticle with a two photons inverse coupling constant\n1 × 105 ≤ M ≤ 6 × 105 GeV and a mass around 1 meV.\nThis is excluded by us with a confidence level greater\nthan 99.9 %.\n\nWe thank the technical staff from LCAR, LNCMP and\nLULI, especially S. Batut, E. Baynard, J.-M. Boudenne,\nJ.-L. Bruneau, D. Castex, J.-F. Devaud, S. Faure, P.\nFrings, M. Gianesin, P. Guéhennec, B. Hirardin, J.P. Laurent, L. Martin, M. Nardone, J.-L. Paillard, L.\nPolizzi, W. Volondat, and A. Zitouni. We also thank\nB. Girard, G. Rikken and J. Vigué for strongly supporting this project. This work has been possible thanks to\nthe ANR-Programme non thématique (Contract ANR BLAN06-3-139634).\n\n[1] R. D. Peccei and H. R. Quinn, Phys. Rev. Lett. 38, 1440\n(1977); R. D. Peccei and H. R. Quinn, Phys. Rev. D 16,\n1791 (1977).\n[2] P. Svrcek and E. Witten, JHEP 0606, 051 (2006).\n[3] J. Preskill, M.B. Wise, F. Wilczek, Phys. Lett. B 120,\n127 (1983); L.F. Abbott, P. Sikivie, Phys. Lett. B 120,\n133 (1983); M. Dine, W. Fischler, Phys. Lett. B 120, 137\n(1983); M.S. Turner, Phys. Rev. D 33, 889 (1986).\n[4] G. G. Raffelt, J. Phys. A 40, 6607 (2007).\n[5] E. Zavattini et al., Phys. Rev. Lett. 96, 110406 (2006).\n[6] S. Andriamonje et al. (CAST collaboration), J. Cosmol.\nAstropart. Phys. 4, 010 (2007).\n[7] S. Lamoreaux, Nature 441, 31 (2006).\n[8] J. Jaeckel et al., Phys. Rev. D 75, 013004 (2007), and\nreferences therein.\n[9] K. Van Bibber et al., Phys. Rev. Lett. 59, 759 (1987).\n[10] R. Cameron et al., Phys. Rev. D 47, 3707 (1993).\n[11] See e.g. http://axion-wimp.desy.de/index eng.html.\n[12] E. Zavattini et al., arXiv:0706.3419 [hep-ex].\n[13] P. Sikivie, Phys. Rev. Lett. 51 (1983) 1415; P. Sikivie,\nPhys. Rev. D 32 (1985) 2988,\n[14] P. Frings et al, Rev. of Sc. Inst. 77, 063903 (2006).\n[15] S. Batut et al., submitted to IEEE Trans. Applied Superconductivity; The coils used in this work have been\noriginally developed by O. Portugall and S. Batut in the\nframework of the BMV experiment at the LNCMP (R.\nBattesti et al., submitted to Eur. Phys. J. D.).\n\n\f"}