{"id": "http://arxiv.org/abs/0805.0999v1", "guidislink": true, "updated": "2008-05-07T15:22:18Z", "updated_parsed": [2008, 5, 7, 15, 22, 18, 2, 128, 0], "published": "2008-05-07T15:22:18Z", "published_parsed": [2008, 5, 7, 15, 22, 18, 2, 128, 0], "title": "Dark Matter in the MSSM Golden Region", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0805.0422%2C0805.0702%2C0805.0194%2C0805.1440%2C0805.4705%2C0805.2949%2C0805.3783%2C0805.0271%2C0805.0668%2C0805.1151%2C0805.2431%2C0805.4046%2C0805.3827%2C0805.1088%2C0805.4221%2C0805.0173%2C0805.0999%2C0805.4465%2C0805.2538%2C0805.3237%2C0805.0775%2C0805.3686%2C0805.1299%2C0805.1616%2C0805.2510%2C0805.4341%2C0805.3963%2C0805.1219%2C0805.1370%2C0805.3545%2C0805.1056%2C0805.4446%2C0805.1753%2C0805.1125%2C0805.0654%2C0805.0674%2C0805.1398%2C0805.3190%2C0805.4392%2C0805.2142%2C0805.2534%2C0805.3444%2C0805.0401%2C0805.3030%2C0805.1341%2C0805.3301%2C0805.0136%2C0805.0997%2C0805.4096%2C0805.0559%2C0805.3795%2C0805.0295%2C0805.1823%2C0805.3840%2C0805.0517%2C0805.3826%2C0805.1508%2C0805.2318%2C0805.0936%2C0805.1228%2C0805.4733%2C0805.1310%2C0805.2589%2C0805.4097%2C0805.3849%2C0805.0438%2C0805.1349%2C0805.3062%2C0805.1244%2C0805.1436%2C0805.0477%2C0805.1563%2C0805.3760%2C0805.0197%2C0805.3228%2C0805.0815%2C0805.1581%2C0805.3860%2C0805.4300%2C0805.0764%2C0805.3838%2C0805.2880%2C0805.4303%2C0805.3599%2C0805.2495%2C0805.0978%2C0805.1463%2C0805.0956%2C0805.1901%2C0805.4279%2C0805.0415%2C0805.4377%2C0805.0757%2C0805.3340%2C0805.3391%2C0805.0712%2C0805.1760%2C0805.3145%2C0805.1669%2C0805.1449%2C0805.2844&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Dark Matter in the MSSM Golden Region"}, "summary": "Dark matter is examined within the ``golden region'' of the Minimal\nSupersymmetric Standard Model. This region satisfies experimental constraints,\nincluding a lower bound on the Higgs mass of 114 GeV, and minimizes fine-tuning\nof the Z boson mass. Here we impose additional constraints (particularly due to\nexperimental bounds on $b\\to s \\gamma$). Then we find the properties of the\nDark Matter in this region. Neutralinos with a relic density that provides the\namount of dark matter required by cosmological data are shown to consist of a\npredominant gaugino (rather than higgsino) fraction. In addition, the U(1)$_Y$\ngaugino mass parameter must satisfy $M_1 < 300$ GeV.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0805.0422%2C0805.0702%2C0805.0194%2C0805.1440%2C0805.4705%2C0805.2949%2C0805.3783%2C0805.0271%2C0805.0668%2C0805.1151%2C0805.2431%2C0805.4046%2C0805.3827%2C0805.1088%2C0805.4221%2C0805.0173%2C0805.0999%2C0805.4465%2C0805.2538%2C0805.3237%2C0805.0775%2C0805.3686%2C0805.1299%2C0805.1616%2C0805.2510%2C0805.4341%2C0805.3963%2C0805.1219%2C0805.1370%2C0805.3545%2C0805.1056%2C0805.4446%2C0805.1753%2C0805.1125%2C0805.0654%2C0805.0674%2C0805.1398%2C0805.3190%2C0805.4392%2C0805.2142%2C0805.2534%2C0805.3444%2C0805.0401%2C0805.3030%2C0805.1341%2C0805.3301%2C0805.0136%2C0805.0997%2C0805.4096%2C0805.0559%2C0805.3795%2C0805.0295%2C0805.1823%2C0805.3840%2C0805.0517%2C0805.3826%2C0805.1508%2C0805.2318%2C0805.0936%2C0805.1228%2C0805.4733%2C0805.1310%2C0805.2589%2C0805.4097%2C0805.3849%2C0805.0438%2C0805.1349%2C0805.3062%2C0805.1244%2C0805.1436%2C0805.0477%2C0805.1563%2C0805.3760%2C0805.0197%2C0805.3228%2C0805.0815%2C0805.1581%2C0805.3860%2C0805.4300%2C0805.0764%2C0805.3838%2C0805.2880%2C0805.4303%2C0805.3599%2C0805.2495%2C0805.0978%2C0805.1463%2C0805.0956%2C0805.1901%2C0805.4279%2C0805.0415%2C0805.4377%2C0805.0757%2C0805.3340%2C0805.3391%2C0805.0712%2C0805.1760%2C0805.3145%2C0805.1669%2C0805.1449%2C0805.2844&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Dark matter is examined within the ``golden region'' of the Minimal\nSupersymmetric Standard Model. This region satisfies experimental constraints,\nincluding a lower bound on the Higgs mass of 114 GeV, and minimizes fine-tuning\nof the Z boson mass. Here we impose additional constraints (particularly due to\nexperimental bounds on $b\\to s \\gamma$). Then we find the properties of the\nDark Matter in this region. Neutralinos with a relic density that provides the\namount of dark matter required by cosmological data are shown to consist of a\npredominant gaugino (rather than higgsino) fraction. In addition, the U(1)$_Y$\ngaugino mass parameter must satisfy $M_1 < 300$ GeV."}, "authors": ["Junya Kasahara", "Katherine Freese", "Paolo Gondolo"], "author_detail": {"name": "Paolo Gondolo"}, "author": "Paolo Gondolo", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.79.045020", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0805.0999v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0805.0999v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "12 pages, 5 figures", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0805.0999v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0805.0999v1", "journal_reference": "Phys.Rev.D79:045020,2009", "doi": "10.1103/PhysRevD.79.045020", "fulltext": "Dark Matter in the MSSM Golden Region\nJunya Kasahara,1, ∗ Katherine Freese,2, † and Paolo Gondolo1, ‡\n1\n\nDepartment of Physics, University of Utah,\n\n115 S 1400 E #201, Salt Lake City, UT 84102\n\narXiv:0805.0999v1 [hep-ph] 7 May 2008\n\n2\n\nMichigan Center for Theoretical Physics, Physics Dept.,\nUniv. of Michigan, Ann Arbor, MI 48109\n\nAbstract\nDark matter is examined within the \"golden region\" of the Minimal Supersymmetric Standard\nModel. This region satisfies experimental constraints, including a lower bound on the Higgs mass\nof 114 GeV, and minimizes fine-tuning of the Z boson mass. Here we impose additional constraints\n(particularly due to experimental bounds on b → sγ). Then we find the properties of the Dark\nMatter in this region. Neutralinos with a relic density that provides the amount of dark matter\nrequired by cosmological data are shown to consist of a predominant gaugino (rather than higgsino)\nfraction. In addition, the U(1)Y gaugino mass parameter must satisfy M1 <\n∼ 300 GeV.\n\n∗\n†\n‡\n\nElectronic address: kasahara@physics.utah.edu\nElectronic address: ktfreese@umich.edu\nElectronic address: paolo@physics.utah.edu\n\n1\n\n\fI.\n\nINTRODUCTION\n\nThe Minimal Standard Supersymmetric Model (MSSM) is the simplest supersymmetric\nextension beyond the standard model of particle physics, and stands to be tested in the\nupcoming Large Hadronic Collider experiments at CERN. The MSSM not only addresses\nfundamental questions in particle physics, but also naturally provides a compelling dark\nmatter candidate, the lightest supersymmetric particle (LSP). In particular, the neutralino,\nwhich is a linear combination of the supersymmetric partners of the photon, the Z boson,\nand the neutral scalar Higgs particles, has the right cross section and mass to automatically\nprovide the observed density of cold dark matter in the universe. According to the analysis\nin [1], the latter has the value\nΩχ h2 = 0.1143 ± 0.0034.\n\n(1)\n\nHere subscript χ refers to neutralinos, h is the Hubble constant H0 in units of 100 km/s/Mpc,\nand Ωχ = ρχ /ρc is the fraction of the neutralino density ρχ in units of the critical density\nρc = 3H02 /(8πG) ∼ 10−29 h2 g/cm3 (alternatively, Ωχ h2 is the neutralino mass density in\nunits of 18.79 yg/m3 ).\nPerelstein and Spethmann [2] examined a particularly interesting region of MSSM parameter space which they dubbed the \"golden region.\" They argued that data and naturalness\n(i.e. a low degree of fine-tuning) point to a region within the Higgs and top sectors where\nthe experimental bounds from non-observation of superpartners and the Higgs boson are\nsatisfied and fine-tuning is close to the minimum possible value. They found that, in this\nregion, (i) the two stop eigenstates have masses below 1 TeV, (ii) there is a significant mass\nsplitting between the two stop mass eigenstates, typically δm ≥ 200GeV, and (iii) the stop\nmixing angle must be nonzero. They then suggested collider signatures of the golden region\nthat may be found at the LHC.\nIn this paper, we further examine this golden region, with a particular focus on discovering\nthe properties of the dark matter within it. We use the numerical package DarkSUSY [3]\nto find the same golden region as [2], and apply additional constraints due to experimental\nbounds on b → sγ as well. Then we look for the parameter regime inside the remaining\ngolden region that also gives the right relic density of neutralino dark matter.\nBelow we begin by reviewing the boundaries of the golden region, and then turn to the\nproperties of the dark matter within it.\n2\n\n\fII.\n\nTHE MSSM GOLDEN REGION\n\nWe work in the framework of the Minimal Supersymmetric Standard Model (MSSM). For\npractical reasons, and to match the choices in [2], we impose the following restrictions on the\nMSSM parameters: (1) we assume that all soft parameters are flavor-diagonal, (2) we assume\na common soft mass for the first and second generation squarks, mq̃ = mQ1,2 = mU 1,2 =\nmD1,2 , and for all sleptons, ml̃ = mL1,2,3 = mE 1,2,3 , (3) we set all tridiagonal terms A to zero\nexcept for At , (4) we further assume that the third generation soft mass mD3 = mq̃ , but\nlet mQ3 and mU 3 vary independently. We remain with 11 free parameters: the Higgs mass\nparameter μ, the mass mA of the CP-odd Higgs boson, the ratio tan β of the Higgs vacuum\nexpectation values, the gaugino mass parameters M1 , M2 , M3 , the soft parameters mq̃ and\nml̃ , and the third-generation soft parameters mQ3 , mU 3 and At . Furthermore, following [2],\nwe replace the last three parameters (mQ3 , mU 3 and At ) with the mass of the lightest stop\nm̃1 , the mass difference between the stop masses δm = m̃2 − m̃1 , and the stop mixing angle\nθt . Finally, we use mt = 174.3 GeV for the top-quark mass, and define all parameters at the\nweak scale.\nWe scan the 11-dimensional parameter space by generating random values of the parameters. In most of our results, we use the parameters within the following ranges (all\ndimensionful parameters are in GeV):\n80 < μ < 500,\n100 < M1 < 400,\n\n100 < mA < 2000,\n100 < M2 < 2000,\n\n100 < mq̃ < 2000,\n100 < m̃1 < 1000,\n\ntan β = 10,\n100 < M3 < 2000,\n\n100 < ml̃ < 2000,\n\n100 < δm < 600,\n\nθt = π/4.\n\n(2)\n(3)\n(4)\n(5)\n\nNotice that we fixed the value of θt and tanβ to reproduce one of the panels in Fig. 2 of\n[2]. We define our \"default scan\" to be the case where these values are fixed at tanβ = 10\nand θt = π/4. We also produced other special scans: we randomized tan β in the range 0.5\nto 30; we implemented the GUT relation between M1 , M2 , and M3 ; we separately extended\nM1 up to 2000 GeV.\nThe points in Fig. 1 illustrate the golden region we obtain in our default scan. We have\nplotted the mass difference between the stop masses δm = m̃2 − m̃1 as a function of the\n3\n\n\fFIG. 1: The Improved Golden Region: Mass difference between the stop masses δm = m̃2 − m̃1\nas a function of the mass of the lightest stop m̃1 . We have scanned SUSY parameter space\nwith constraints imposed from the bound on the Higgs mass, fine tuning, and other experimental\nconstraints including b → sγ to find an \"improved\" golden region; here we have fixed θt =\n\nπ\n4\n\nand\n\ntanβ = 10 as our \"default scan\" in parameter space. For comparison, the area enclosed by the\nsolid line shows the corresponding golden region previously found in Fig. 2 of [2]. Note that our\nlowest value of δm = 150GeV is lower than that in the previous work as discussed in the text.\n\nmass of the lightest stop m̃1 . This plot can be directly compared with Fig. 2 of [2], from\nwhich the solid triangular region is drawn. Using DarkSUSY, we have improved upon the\nprevious work by applying more accurate calculations of the Higgs boson mass and of the\nb → sγ branching ratio, as described below. A variety of other experimental constraints are\napplied as well, using their implementation in DarkSUSY. In particular, LEP2 searches for\ndirect production of charginos and stops constrain the chargino and stop masses, resulting\n> 80 GeV and m̃1 > 90 GeV. The b → sγ decay rate [7] also constrains the golden\nin μ ∼\n∼\nregion. Whereas [2] noted that including this constraint was mostly beyond the scope of\ntheir paper, we have implemented this constraint throughout. Hence our results in Fig. 1\n\n4\n\n\fillustrate the \"improved\" golden region in the presence of this additional constraint (and of\na more accurate calculation of the Higgs boson masses).\nWe note that [2] defined a benchmark point in their Table 1, with particular choices of the\nother parameters, and did include b → sγ ratio when they checked this point using SuSpect.\nSuSpect gave them an acceptable b → sγ ratio for their benchmark model, but DarkSUSY\n(which includes better expressions for the branching ratio with NLO corrections) gives an\nunacceptable value.\nThe golden region in Fig. 1 contains 7000 points satisfying all relevant bounds. The\nregion is a triangle, with the lower boundary due to the constraint on the Higgs mass, the\nleftmost boundary due to the bounds on the ρ parameter, and the upper boundary due to\nfine-tuning. We now discuss each of these bounds in turn.\n\nA.\n\nLower boundary of golden triangle: Higgs mass\n\nThe lower boundary of the golden region triangle is set by bounds on the Higgs mass.\nThe LEP2 lower bound on the standard model Higgs mass is [5]\nm(h0 ) ≥ 114GeV.\n\n(6)\n\nFor generic MSSM parameter choices, the limit on the lightest Higgs is very close to this value\nas well and we may use this bound. At tree level, the MSSM predicts m(h0 ) ≤ mZ |cos2β|,\nso that large loop corrections are required to satisfy this bound. The dominant one-loop\ncorrections are from top and stop loops. The numerical package FeynHiggs [6] is incorporated\ninto DarkSUSY to properly compute the Higgs mass and to apply the experimental bound.\nWe note that the resulting boundary to the golden region that we find is slightly different\nfrom that of [2]: e.g. at m̃1 = 440GeV, our lowest value of δm = 150GeV is quite a bit\nlower than their lowest value of δm ∼ 280. The reason for this discrepancy is that their\nanalytic approximations for the Higgs masses are less accurate than the values we find using\nthe numerical package.\n\n5\n\n\fB.\n\nUpper boundary of golden triangle: Fine-Tuning Constraint\n\nFine-tuning of the Z mass also constrains the Higgs sector. At tree level, the Z mass in\nthe MSSM is given by\nm2Z\n\n=\n\n−m2u\n\n1\n1−\ncos 2β\n\n!\n\n−\n\nm2d\n\n1\n1+\ncos 2β\n\n!\n\n− 2|μ|2 ,\n\n(7)\n\nwhere\nsin 2β =\n\nm2u\n\n2b\n.\n+ m2d + 2|μ|2\n\n(8)\n\nSince one of the two CP-even Higgs masses must satisfy m2u,d < 0 for electroweak symmetry\nbreaking, and since experimentally it is found that at least one of mu,d , |μ| ≫ mZ , cancellation of the terms on the right hand side is required in order to get the right value of mZ .\nFollowing Barbieri and Giudice [4], one may quantify this fine-tuning by computing\n∂ log m2Z\n∂ log ξ\n\nA(ξ) =\n\n(9)\n\nwhere ξ = m2u , m2d , b, μ are the relevant Lagrangian parameters. Then\n!\n\n4μ2\nA(μ) = 2\nmZ\n\nm2 + m2\n1 + A 2 Z tan2 2β ,\nmA\n!\n2\nm\ntan2 2β,\nA(b) = 1 + A\nm2Z\n!\n2\n2\n2\n2\n1\nm\nm\n+\nm\nμ\n1\nA(m2u ) =\ncos 2β + A\n+ A 2 Z tan2 2β ,\ncos2 β − 2 × 1 −\n2\nm2Z\nmZ\ncos 2β\nmA\n2\n2\n2\n1\nμ\n1\nm\nm + m2\nA(m2d ) = − cos 2β + 2A sin2 β − 2 × 1 +\n+ A 2 Z tan2 2β ,\n2\nmZ\nmZ\ncos 2β\nmA\n(10)\nwhere it is assumed that tan β > 1. The overall fine-tuning ∆ is defined by adding the\nfour A's in quadrature; values of ∆ far above one indicate fine-tuning. Following [2], we\nrequire ∆ ≤ 100, corresponding to fine tuning of 1% or better; this bound is implemented\n< 440 GeV for tanβ ≥ 0.5. This matches the\nin our work and produces an upper bound μ ∼\nupper bound on μ found in [2]. We impose the constraints on the chargino mass from LEP2\n> 80 GeV.\nchargino searches, which select μ ∼\nThe upper boundary of the golden region triangle is determined by further restrictions on\nthe fine-tuning. Quantum corrections to naturalness also constrain the size of the quantum\ncorrections to the parameters in Eq. (7). Following [2], here we consider the largest correction\n6\n\n\fin the MSSM, namely the one-loop contribution to the m2u parameter from top and stop\nloops:\nδm2u\n\n\u0010\n\u0011\n3\n(m̃22 − m̃21 )2\n2\n2\n2\n2\n≈\ny\nm̃\n+\nm̃\n−\n2m\n+\nsin2 2θt\nt\n1\n2\nt\n2\n2\n16π\n4v\n\n!\n\nlog\n\n2Λ2\n.\nm̃21 + m̃22\n\n(11)\n\nHere mt is the top mass, Λ is the scale at which the logarithmic divergence is cut off, and\nfinite (matching) corrections have been ignored. The correction to the Z mass induced by\nthis effect is\nδt m2Z\n\n≈\n\n−δm2Hu\n\n!\n\n1\n1−\n.\ncos 2β\n\n(12)\n\nTo measure the fine-tuning between the bare (tree-level) and one-loop contributions, [2]\nintroduced\nδt m2Z\n.\nm2Z\n\n∆t =\n\n(13)\n\nChoosing the maximum allowed value of ∆t selects a region in the stop sector parameter\nspace, (m̃1 , m̃2 , θt ), whose shape is approximately independent of the other parameters. This\nconstraint is outlined by the upper edge in Fig. 1, which corresponds to ∆t ≤ 33.3 (3% fine\ntuning). Note that the particular value of ∆t depends on the scale Λ; we choose Λ = 100\nTeV in this figure. As pointed out in [2], the shape of the ∆t contours and the obvious trend\nfor fine tuning to increase with the two stop masses is independent of Λ.\n\nC.\n\nLeft Boundary of Golden Triangle: ρ parameter\n\nThe left boundary of the golden region triangle is set by measurements of the ρ parameter,\nwhich obtains corrections from stop and sbottom loops. We compute the ρ parameter using\nDarkSUSY and require\n(2 − 8) × 10−4 ≤ ρ − 1 ≤ (2 + 8) × 10−4,\n\n(14)\n\nwhich represents the 2σ range from [8].\n\nIII.\n\nDARK MATTER\n\nNow that we have found the improved golden region with the b → sγ bound implemented,\nwe can investigate the properties of the dark matter in this region. Using DarkSUSY, we\n\n7\n\n\ffind the neutralino relic density for each set of MSSM parameter values in the improved\ngolden region.\nFig. 2 shows the relic density as a function of neutralino mass for all our default points in\nthe golden region. As discussed previously, our default scan is defined by fixing tanβ = 10\nand θt = π/4 and scanning over other parameters. The lines illustrate the band that\nsatisfies the cosmological requirement of Ωχ h2 in Eq.(1). Notice that there are points with\nthe correct density for practically all neutralino masses in the golden region (with perhaps a\ntiny exception at the largest masses). Although most of the points in the figure have small\nΩχ h2 , we remind the reader that the density of points, in this and all the other plots is\narbitrary. The simulation uses a random number generator in the parameter domain. The\ndots are used for a plot as long as they satisfy the criteria for the golden region. Thus,\nthe dot density doesn't necessarily have a physical meaning. It simply represents how the\nrandom number generator creates the dots.\nIn our default scan, we allowed the gaugino mass parameters M1,2,3 to vary independently.\nIf we instead impose the GUT relations\n5\ntan2 θW M2 ,\n3\nαs (mZ ) 2\nM3 =\nsin θW M2 ,\nα\n\nM1 =\n\n(15)\n(16)\n\nwe still find points satisfying the cosmological constraint on Ωχ h2 . This is shown in Fig. 3,\nobtained by using the parameter ranges in Eqs. 2-5 but with the additional GUT conditions\non M1 , M2 , and M3 imposed.\nTo understand the properties of the points with the cosmologically interesting values of\nΩχ h2 , we have analyzed the dependence of Ωχ h2 in our default sample on all of the 11\nindependent parameters in the Lagrangian. Most of the parameters showed no interesting\nconnection with Ωχ h2 , except for M1 , and the gaugino fraction Zg .\nFig. 4 shows the relic density as a function of Zg /(1 − Zg ) where Zg is the gaugino\nfraction of the neutralino. The denominator 1 − Zg is the higgsino fraction. Points in the\ncosmologically interesting band typically have Zg /(1 − Zg ) > 1. Thus, the dark matter in\nthe golden region that satisfies Eq.(1) is predominantly gaugino rather than higgsino.\nFigs. 5(a) and (b) plot the relic density as a function of M1 , the mass of the U(1)Y\ngaugino. Fig. 5(a) is for our default scan, while Fig. 5(b) is for an extended scan of 1,700\npoints in which tanβ varies in the range 0.5 to 30 and M1 is allowed to be as large as 2000\n8\n\n\fFIG. 2: Neutralino relic density Ωχ h2 as a function of neutralino mass mχ for our default scan in\nparameter space (tanβ = 10, θt = π/4). Each dot represents a point in supersymmetric parameter\nspace that lies within the golden region. The horizontal band shows the 2σ range in the measured\nvalue of the cosmological density of cold dark matter [1]. Notice that there are points falling into\nthe cosmological band for mχ ≤ 300 GeV.\n\nGeV. One can see that points with the right relic density to explain WMAP have M1 < 300\nGeV.\n\nIV.\n\nCONCLUSION\n\nIn conclusion we have imposed further experimental bounds (b → sγ) on the golden\nregion found by [2] and have searched for subsets of this region which provide today's dark\nmatter density in the form of neutralinos. We found that M1 < 300GeV is required, and\nthat the neutralino that is the dark matter is predominantly gaugino. In the future, we\nplan to examine direct and indirect detection rates in concert with LHC tests of the golden\nregion.\n\n9\n\n\fFIG. 3: Same as Fig. 2 except that M1 , M2 , and M3 are related through the GUT relations,\nEqs. 15-16. Notice that there are points falling into the cosmologically-interesting band.\nV.\n\nACKNOWLEDEMENT\n\nK.F. acknowledges support from the DOE and MCTP via the Univ. of Michigan. P.G.\nand J.K. acknowledge NSF grant PHY-0456825. K.F. thanks the Physics Dept. at the Univ.\nof Utah for hospitality.\n\n[1] G. Hinshaw et al., arxiv:0803.0732 [astro-ph] (2008), submitted to ApJ.\n[2] M. Perelstein and C. Spethmann, JHEP 0704, 070 (2007).\n[3] P. Gondolo, J. Edsjo, P. Ullio, L. Bergstrom, M. Schelke and E. A. Baltz, JCAP 0407, 008\n(2004).\n[4] R. Barbieri and G. F. Giudice, Nucl. Phys. B 306, 63 (1988).\n[5] S. Schael et al. [ALEPH Collaboration], Eur. Phys. J. C 47, 547 (2006) [arXiv:hep-ex/0602042].\n[6] The FeynHiggs package can be downloaded from\n\n10\n\n\fFIG. 4: Neutralino relic density Ωχ h2 as a function of\n\nZg\n1−Zg\n\nfor our default scan in parameter\n\nspace. Each dot represents a point in supersymmetric parameter space that lies within the golden\nregion. The horizontal band shows the 2σ range in the measured value of the density of cold dark\nZg\nmatter [1]. Notice that there are points only above log 1−Z\n=0. One can see that the neutralino is\ng\n\ntypically predominantly gaugino rather than higgsino.\nhttp://wwwth.mppmu.mpg.de/members/heinemey/feynhiggs/index.html\n[7] S. Chen et al. [CLEO Collaboration], Phys. Rev. Lett. 87, 251807 (2001) [arXiv:hepex/0108032]; B. Aubert et al. [BaBar Collaboration], arXiv:hep-ex/0507001; P. Koppenburg\net al. [Belle Collaboration], Phys. Rev. Lett. 93, 061803 (2004) [arXiv:hep-ex/0403004]; E.\nBarberio et al. [Heavy Flavor Averaging Group (HFAG)], arXiv:hep-ex/0603003.\n[8] W. M. Yao et al [Particle Data Group], J. Phys. G 33, 1 (2006).\n\n11\n\n\fFIG. 5: Neutralino relic density Ωχ h2 as a function of M1 for (a) our default scan in parameter\nspace, and (b) an extended scan with 0.5 < tan β < 30 and 100 GeV< M1 < 2000 GeV. Each\ndot represents a point in supersymmetric parameter space that lies within the golden region. The\nhorizontal band shows the 2σ range in the measured value of the density of cold dark matter [1].\n\n12 with the right cosmological neutralino density\nNotice that there are points in the golden region\nprovided M1 < 300 GeV.\n\n\f"}