{"id": "http://arxiv.org/abs/1006.0025v1", "guidislink": true, "updated": "2010-05-31T21:46:49Z", "updated_parsed": [2010, 5, 31, 21, 46, 49, 0, 151, 0], "published": "2010-05-31T21:46:49Z", "published_parsed": [2010, 5, 31, 21, 46, 49, 0, 151, 0], "title": "The WIMP capture process for dark stars in the early universe", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1006.1021%2C1006.0693%2C1006.4022%2C1006.1644%2C1006.5610%2C1006.0966%2C1006.0758%2C1006.4874%2C1006.2295%2C1006.4606%2C1006.4381%2C1006.0516%2C1006.0444%2C1006.3928%2C1006.2926%2C1006.0995%2C1006.1546%2C1006.5189%2C1006.0056%2C1006.1116%2C1006.3360%2C1006.2694%2C1006.2835%2C1006.0511%2C1006.0399%2C1006.2248%2C1006.5022%2C1006.5154%2C1006.3957%2C1006.0947%2C1006.1093%2C1006.1002%2C1006.3177%2C1006.0189%2C1006.0466%2C1006.0470%2C1006.1201%2C1006.3982%2C1006.0028%2C1006.0242%2C1006.5597%2C1006.3426%2C1006.2487%2C1006.5092%2C1006.2210%2C1006.0697%2C1006.2992%2C1006.3295%2C1006.1406%2C1006.3551%2C1006.1844%2C1006.4981%2C1006.2122%2C1006.4934%2C1006.0025%2C1006.4316%2C1006.4549%2C1006.3222%2C1006.4164%2C1006.2015%2C1006.1257%2C1006.5259%2C1006.3243%2C1006.3495%2C1006.2779%2C1006.4798%2C1006.1579%2C1006.0847%2C1006.4494%2C1006.1262%2C1006.3081%2C1006.3826%2C1006.0823%2C1006.5048%2C1006.2474%2C1006.0862%2C1006.0280%2C1006.4758%2C1006.4617%2C1006.3149%2C1006.1084%2C1006.5184%2C1006.1924%2C1006.0490%2C1006.4816%2C1006.0724%2C1006.2567%2C1006.0467%2C1006.4087%2C1006.1849%2C1006.3381%2C1006.3988%2C1006.0320%2C1006.3783%2C1006.2587%2C1006.4002%2C1006.5508%2C1006.2354%2C1006.4587%2C1006.5498%2C1006.2880&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The WIMP capture process for dark stars in the early universe"}, "summary": "The first stars to form in the universe may have been dark stars, powered by\ndark matter annihilation instead of nuclear fusion. The initial amount of dark\nmatter gathered by the star gravitationally can sustain it only for a limited\nperiod of time. It has been suggested that capture of additional dark matter\nfrom the environment can prolong the dark star phase even to the present day.\nHere we show that this capture process is ineffective to prolong the life of\nthe first generation of dark stars. We construct a Monte-Carlo simulation that\nfollows each Weakly Interacting Massive Particle (WIMP) in the dark matter halo\nas its orbit responds to the formation and evolution of the dark star, as it\nscatters off the star's nuclei, and as it annihilates inside the star. A rapid\ndepletion of the WIMPs on orbits that cross the star causes the demise of the\nfirst generation of dark stars. We suggest that a second generation of dark\nstars may in principle survive much longer through capture. We comment on the\neffect of relaxing our assumptions.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1006.1021%2C1006.0693%2C1006.4022%2C1006.1644%2C1006.5610%2C1006.0966%2C1006.0758%2C1006.4874%2C1006.2295%2C1006.4606%2C1006.4381%2C1006.0516%2C1006.0444%2C1006.3928%2C1006.2926%2C1006.0995%2C1006.1546%2C1006.5189%2C1006.0056%2C1006.1116%2C1006.3360%2C1006.2694%2C1006.2835%2C1006.0511%2C1006.0399%2C1006.2248%2C1006.5022%2C1006.5154%2C1006.3957%2C1006.0947%2C1006.1093%2C1006.1002%2C1006.3177%2C1006.0189%2C1006.0466%2C1006.0470%2C1006.1201%2C1006.3982%2C1006.0028%2C1006.0242%2C1006.5597%2C1006.3426%2C1006.2487%2C1006.5092%2C1006.2210%2C1006.0697%2C1006.2992%2C1006.3295%2C1006.1406%2C1006.3551%2C1006.1844%2C1006.4981%2C1006.2122%2C1006.4934%2C1006.0025%2C1006.4316%2C1006.4549%2C1006.3222%2C1006.4164%2C1006.2015%2C1006.1257%2C1006.5259%2C1006.3243%2C1006.3495%2C1006.2779%2C1006.4798%2C1006.1579%2C1006.0847%2C1006.4494%2C1006.1262%2C1006.3081%2C1006.3826%2C1006.0823%2C1006.5048%2C1006.2474%2C1006.0862%2C1006.0280%2C1006.4758%2C1006.4617%2C1006.3149%2C1006.1084%2C1006.5184%2C1006.1924%2C1006.0490%2C1006.4816%2C1006.0724%2C1006.2567%2C1006.0467%2C1006.4087%2C1006.1849%2C1006.3381%2C1006.3988%2C1006.0320%2C1006.3783%2C1006.2587%2C1006.4002%2C1006.5508%2C1006.2354%2C1006.4587%2C1006.5498%2C1006.2880&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The first stars to form in the universe may have been dark stars, powered by\ndark matter annihilation instead of nuclear fusion. The initial amount of dark\nmatter gathered by the star gravitationally can sustain it only for a limited\nperiod of time. It has been suggested that capture of additional dark matter\nfrom the environment can prolong the dark star phase even to the present day.\nHere we show that this capture process is ineffective to prolong the life of\nthe first generation of dark stars. We construct a Monte-Carlo simulation that\nfollows each Weakly Interacting Massive Particle (WIMP) in the dark matter halo\nas its orbit responds to the formation and evolution of the dark star, as it\nscatters off the star's nuclei, and as it annihilates inside the star. A rapid\ndepletion of the WIMPs on orbits that cross the star causes the demise of the\nfirst generation of dark stars. We suggest that a second generation of dark\nstars may in principle survive much longer through capture. We comment on the\neffect of relaxing our assumptions."}, "authors": ["Sofia Sivertsson", "Paolo Gondolo"], "author_detail": {"name": "Paolo Gondolo"}, "author": "Paolo Gondolo", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0004-637X/729/1/51", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1006.0025v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1006.0025v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "13 pages, 6 figures", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1006.0025v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1006.0025v1", "journal_reference": "Astrophys.J.729:51,2011", "doi": "10.1088/0004-637X/729/1/51", "fulltext": "The WIMP capture process for dark stars in the early universe\nSofia Sivertsson∗\nDepartment of Theoretical Physics, Royal Institute of Technology (KTH),\nAlbaNova University Center, 106 91 Stockholm, Sweden and\nThe Oskar Klein Centre for Cosmoparticle Physics, Stockholm University,\nAlbaNova University Center, 106 91 Stockholm, Sweden\n\narXiv:1006.0025v1 [astro-ph.CO] 31 May 2010\n\nPaolo Gondolo†\nDepartment of Physics and Astronomy, University of Utah,\n115 South 1400 East #201, Salt Lake City, Utah 84112-0830, USA\n(Dated: May 31, 2010)\nThe first stars to form in the universe may have been dark stars, powered by dark matter annihilation\ninstead of nuclear fusion. The initial amount of dark matter gathered by the star gravitationally can\nsustain it only for a limited period of time. It has been suggested that capture of additional dark\nmatter from the environment can prolong the dark star phase even to the present day. Here we show\nthat this capture process is ineffective to prolong the life of the first generation of dark stars. We\nconstruct a Monte-Carlo simulation that follows each Weakly Interacting Massive Particle (WIMP)\nin the dark matter halo as its orbit responds to the formation and evolution of the dark star, as it\nscatters off the star's nuclei, and as it annihilates inside the star. A rapid depletion of the WIMPs\non orbits that cross the star causes the demise of the first generation of dark stars. We suggest\nthat a second generation of dark stars may in principle survive much longer through capture. We\ncomment on the effect of relaxing our assumptions.\n\nThe first stars to form in the universe (Population III\nstars) provide the light that ends the dark ages, contribute to reionization, inject metals into the interstellar medium for later stellar generations, and might give\nthe seeds for the massive early black holes observed in\nquasars. All these effects depend on the properties of the\nfirst stars, which in turn depend strongly on their masses.\nDark matter can play a crucial role in the formation\nof the first stars [1], and in particular can change their\nmasses and astrophysical implications dramatically [2].\nThe first stars form at the centers of early dark matter halos, when the universe was young and much more\ndense than today. Not only were the first stars formed\nin regions of very high dark matter densities, but they\nalso dragged in more dark matter gravitationally while\nthey were forming (a process often called \"adiabatic contraction\" although it may not occur adiabatically). If\ndark matter consists of Weakly Interacting Massive Particles (WIMPs) that annihilate among themselves, their\nannihilation could provide enough energy to stop or delay the formation of Pop III stars, giving rise to a new\nstellar phase called a Dark Star. This annihilation is the\nsame physical process that creates WIMPs thermally in\nthe early universe and naturally gives the correct cosmic density for WIMPs to account for the observed dark\nmatter.\nOnce the initial amount of dark matter accumulated\nvia adiabatic contraction runs out, the dark star phase\nends and the star contracts onto the zero-age zero-\n\n∗ Electronic\n† Electronic\n\naddress: sofiasi@kth.se\naddress: paolo.gondolo@utah.edu\n\nmetallicity main sequence [2]. It has been suggested [3–5]\nthat capture of additional dark matter from the environment around the star can prolong the dark star phase\neven to the present day.\nHere we show that this capture process is ineffective to\nprolong the life of the first generation of dark stars. For\nthese stars, the great majority of the dark matter around\nthem is accumulated by adiabatic contraction at the time\nof formation and ends up in orbits that are bound to\nthe dark star. Part of this dark matter is captured by\nthe dark star once the gas density in the star is high\nenough. Essentially all of the dark matter in the dark\nstar annihilates away during its contraction towards the\nmain sequence at the end of the dark star phase. The\nrest of the dark matter remains close but outside the\nstar and orbits around it without crossing it. We call\nthis dark matter population the dark matter envelope.\nOnce the dark matter crossing the star has been depleted,\nthere is no additional dark matter population that can\nbe efficiently captured. This ends the first generation of\ndark stars.\nNotice that in this paper we have extended the meaning of the word capture in the following sense. By capture, we mean the concept of bringing WIMPs from \"outside\" to \"inside\" the star through energy loss in WIMPnucleon scattering, which increases the fraction of time\na WIMP spends inside the star. Originally capture was\ndefined as the scattering of dark matter particles in the\nGalactic population off individual nucleons in the Sun\nand into bound orbits [6, 7]. In the case of Pop III dark\nstars, most of the WIMPs accumulated around the star\nby adiabatic contraction are bound to the star, and there\nis no relevant unbound population. Hence the original\nformalism for capture, as used in [3–5], does not apply.\n\n\f2\nWe instead define capture as the scattering of dark matter particles off nucleons in the star without regard to the\nbound or unbound nature of their orbits. This definition\nallows for a clear separation of scattering and annihilation processes.\n\nI.\n\nINTRODUCTION\n\nWIMPs constitute a negligible fraction of the mass of\nthe dark star (less than a few percent), but the WIMP\ndensity is high enough for WIMP annihilation to become the dominant power source. This was proposed\nin Ref. [1], which introduced the term Dark Stars to refer to Pop III stars in a stellar evolution phase powered\nby dark matter. Later the term was extended in Ref. [8]\nto any star powered by dark matter annihilation, previously called a dark matter burner [9–12]. Work on Pop\nIII dark stars include Refs. [1–5, 13–21]; work on other\nkinds of dark stars include Refs. [8–12, 22–25]. In this\npaper, we consider Pop III dark stars exclusively.\nIn dark stars, the dark matter becomes the dominant\nheat source despite its comparably low density because\nWIMP annihilation converts mass into energy much more\nefficiently than nuclear fusion. As in Ref. [1], we assume\nthat 2/3 of the WIMP annihilation energy is deposited as\nheat in the star and the other 1/3 is lost, predominantly\nto neutrinos.\nAs the dark star forms, the deepening of the gravitational potential boosts the halo's central WIMP density\nin the proximity of the star (adiabatic contraction). Annihilation within the WIMP population heats up the dark\nstar, but also decreases the dark matter density. However, as long as the dark star keeps gaining mass and\nincreases its density, the central dark matter population\ninside the star is replenished by the increased gravitational pull. The energy injected by WIMP annihilation\nhalts the contraction of the star, keeping the outer regions cool for a time longer than a normal Pop III star\nwithout dark matter. The dark star is then supported by\nthe energy from the annihilation of WIMPs. Initially, it\nis a low-density giant star with low surface temperature\n[1]. Later, by accreting mass from the surrounding gas, it\ngrows to a mass of several hundreds of solar masses, still\nremaining a low-density giant star (radius of thousands\nof solar radii). The dark matter has given the star more\ntime to accrete mass, making the first stars more massive\nthan without the help from dark matter annihilation.\nAs the dark star becomes bigger and more massive,\nmore energy is needed to support it. To sustain the star,\ndark matter needs to be supplied at a higher rate. Eventually the adiabatic contraction can no longer keep up\nwith the dark star's increasing demand of dark matter.\nAt this point, the dark star starts to contract since the\ndark matter supply rate is no longer enough to support\nit. When the volume of the dark star decreases, the total\namount of energy supplied by dark matter annihilation\ndecreases with the volume. After the contraction, the\n\nstar approaches the main sequence. When nuclear fusion starts, the radiation feedback halts the accretion of\nbaryons, putting an end to the star's growth in mass.\nThen the dark matter can no longer be gravitationally\nreplenished by adiabatic contraction, putting an end to\nthe initial dark star phase. The end product is a normal,\nalthough very massive, main sequence star in the sense\nthat it produces energy through nuclear fusion and no\nlonger through WIMP annihilation.\nIt was suggested in Refs. [3–5] that the WIMP population at the end of the dark star phase may be replenished\nby capture of WIMPs from the surrounding dark matter\nhalo. WIMPs passing through the star can loose energy\nin scattering off nucleons in the star. If a WIMP scatters\nmany times it will eventually loose enough energy to sink\nto the center and contribute to the WIMP density inside\nthe star. If enough energy is injected through the annihilation of the captured dark matter, the nuclear burning\nin the star is slowed down, possibly to essentially a full\nstop. This object would then be powered by dark matter\nand, as long as the dark matter fuel is constantly refilled,\nthe lifetime of the star is substantially prolonged, possibly to time scales comparable to the age of the universe\n(\"eternal dark stars\" [3–5]).\nFor WIMP capture to prolong the life of a dark star, it\nis essential that the dark matter is efficiently captured via\nWIMP-nucleon scattering. Refs. [3–5] estimated the rate\nof WIMP capture using a formula by Gould [7]. However, Gould's formula assumes a constant flow of WIMPs\ncoming onto the star from far away. It also assumes that\nthe WIMP population is Maxwellian and is not bound\nto the star. However, a Pop III dark star forms thanks\nto the adiabatic contraction of its own dark matter halo,\nand the WIMPs responsible for the high concentration\nof dark matter in and around the star are gravitationally bound to the star. Thus also the WIMPs accessible\nfor capture are gravitationally bound to the star, and\nGould's formula does not apply.\nIn this work, we investigate in detail the star's ability to access dark matter from the halo it formed in.\nFor this purpose, we construct a Monte-Carlo simulation\nthat follows the halo WIMPs as their orbits respond to\nthe formation of the star, as they scatter off the star's\nnuclei, and as they annihilate inside the star. Since the\nWIMPs are fully traced, not only can we analyze their\nannihilation and scattering behavior, but also their phase\nspace distribution around the formed star.\nWe find that WIMP capture is not important until the\ndark star contracts on its way to the main sequence and\nbecomes dense enough to be a viable dark matter target.\nWe also find that WIMP capture lasts a relatively short\namount of time as the WIMPs available for capture are\nquickly depleted and their orbits are not replenished.\nThroughout this paper we use as fiducial values a\nWIMP mass mχ = 100 GeV and an annihilation cross\nsection times relative velocity σann v = 3 × 10−26 cm3 /s.\nFor scattering off nuclei, since the spin dependent scattering cross section is far less constrained than the spin inde-\n\n\f3\npendent cross section, we look at the case of a large spindependent scattering cross section σscatt = 10−39 cm2 ,\nas well as at a zero scattering cross section (absence of\nscattering).\nSection II describes our Monte-Carlo (initial phase\nspace distribution, adiabatic contraction, capture and annihilation). There we also present a new quadrature formula for the phase-space distribution of a Navarro-FrenkWhite [26] halo. Section III presents our results, which\nare then discussed in Section IV.\n\nII.\n\nMETHOD\n\nThe motivation for this work is to find out how the\ndark matter in the NFW halo responds to the change in\ngravitational potential as the star forms, and what then\nhappens to the dark matter with time. Following the\nchoices of Ref. [1] we investigate the case of a single star\nforming at redshift z = 20 in the center of a primordial\nhalo of mass 106 M⊙ with a Navarro, Frenk and White\n(NFW) profile [26] consisting of 15% baryons and 85%\ndark matter.\nThe Monte-Carlo simulation picks individual WIMPs\nfrom the original NFW halo and follows these WIMPs\nand how they respond to the changing gravitational potential as the star forms. Through picking and studying\nWIMPs in phase space the full orbit of the WIMP investigated is known. With this information the adiabatic\ninvariants of the orbit can be determined and with that,\nas long as the star formation process is slow enough to\nbe adiabatic, the new orbits of the WIMPs can be found\nthrough all stages of the stellar evolution. The phase\nspace distribution of the dark matter as the star evolves\nis thus followed.\nWIMPs spending time inside the dark star can annihilate with other WIMPs or they can scatter off nuclei\nin the star. If the WIMPs annihilate, their energy (minus the energy lost to neutrinos) is released to heat the\ngas. If the WIMPs scatter before having time to annihilate, the energy loss and then the new WIMP orbit\nis calculated. The new orbit of the scattered WIMP is\nthen followed and the WIMP is again given the chance\nto scatter or annihilate. As the star evolves, the future\norbits of the WIMPs which have not annihilated are calculated, so that the WIMPs are given new chances to\nscatter and/or annihilate at the later stages of the stellar\nevolution. Simulating many WIMPs gives the injected\nheat from dark matter into the dark star as a function of\ntime, including the effect of WIMP-nucleon scattering.\nThe evolution used for the dark star is taken from\nRef. [2]. More precisely, it is their canonical case of a\n100 GeV WIMP with Tan-McKee mass accretion [27]\nand without WIMP capture (i.e. without WIMP-nucleon\nscattering). To follow the WIMPs through the formation\nof the star, the stellar evolution is divided into 116 steps\n(taken from [2]) and the WIMP orbits are found for each\nof these stages. Our work only considers how the dark\n\nmatter halo evolves given the stellar evolution. How the\ndark star responds to the change of the dark matter heating from WIMP capture will be taken into account in an\nupcoming publication [28].\n\nA.\n\nInitial dark matter distribution\n\nThe first step of the Monte-Carlo is to pick WIMPs\nfrom the original NFW halo, i.e. to find the phase space\ndistribution of the original halo. Spherical symmetry is\nassumed to hold throughout, for the star forming in the\ncenter of the NFW halo and at later times.\nThe density profile of an NFW halo is given by\nρ(r)\nδc\n=\n,\nρc\n(r/rs )(1 + r/rs )2\n\n(1)\n\nwhere rs = r200 /c is a characteristic radius and ρc =\n3H 2 /8πG is the critical density. δc is a dimensionless\nconcentration parameter given by the requirement that\nthe mean density within r200 is given by 200ρc , as in\nRef. [26]. We take the total halo mass to be 106 M⊙ and\nthe concentration parameter c = 2. Then δc = 1235, rs =\n2.28 × 1020 cm = 74.5 pc, and ρc = 2.5 × 10−26 g/cm3 =\n0.014 GeV/cm3.\nFor a spherically symmetric density distribution and an\neverywhere isotropic velocity dispersion, the phase-space\ndistribution function can be found using Eddington's formula [29]:\n\"Z\n#\n\u0012\n\u0013\nE\ndρ\ndΨ d2 ρ\n1\n1\n√\nf (E) = √\n.\n+√\nE − Ψ dΨ2\n8π 2 0\nE dΨ Ψ=0\n(2)\nHere f (E) has units of mass per unit phase space volume\n(g cm−3 (cm/s)−3 ), E = −E/mχ is the negative of the\ntotal energy E per unit WIMP mass mχ , and Ψ(r) =\n−φ(r) is the negative of the gravitational potential φ(r).\nThe condition that the WIMPs are gravitationally bound\nto the NFW halo implies 0 < E ≤ Ψ(0). For an NFW\nhalo, Ψ(r) is given by:\nZ ∞\nln(r/rs + 1)\nM (r′ ) ′\ndr = 4πGδc ρc rs2\n.\nΨNFW (r) = G\n′2\nr\nr/rs\nr\n(3)\nWe have written M (r) for the halo mass enclosed within\nradius r.\nAfter a very lengthy but straightforward calculation\nstarting from Eddington's formula, the distribution function for an NFW profile can be written as:\nZ ∞\n1\n1\nfNFW (ENFW ) = √\ng(r) p\ndr,\n8π 2 rE NFW\nENFW − ΨNFW (r)\n(4)\nwhere\ng(r) =\n\nr(rs − 3r + 6ξ)\n4Gπ(rs + r)3 (r − ξ)2\n\n(5)\n\n\f4\nSivertsson & Gondolo, 2010\n\nDistribution function [g cm-3 (cm/s)-3]\n\n10-36\n\nsharp peak near ENFW = ΨNFW (r), as seen in Fig. 1.\nIn the Monte-Carlo, the peak is typically even sharper\nthan in Fig. 1, as r is typically smaller for the interesting WIMPs, making the distribution numerically challenging to use in the Monte-Carlo. The latter issue can\nbe treated by going back to Eq. (4); Taylor expanding\naround the critical point ENFW = ΨNFW (r), and integrating in r, one finds that the peak can be tamed by\nrewriting the velocity distribution in the new variable\nz = 1/(ΨNFW (0) − ENFW ).\n\n10-38\n10-40\n10-42\n10-44\n10-46\n10-48\n10-50\n\nB.\n0\n\n2⋅10\n\n11\n\n11\n\n11\n\n11\n\n12\n\n4⋅10\n6⋅10\n8⋅10\n10\nEnergy per unit mass [(cm/s)2]\n\n1.2⋅10\n\nFIG. 1:\nThe phase-space distribution function\nfNFW (ENFW )p(red solid line) and the ENFW -distribution\nfNFW (ENFW ) 1 − ENFW /ΨNFW (r) at r = 10−2 rs (blue\ndotted line) for our 106 M⊙ , c = 2 NFW halo.\n\nwith\n\u0012\n\u0013\nr\nξ = (rs + r) ln 1 +\n.\nrs\n\nAdiabatic contraction\n\n12\n\n(6)\n\nMoreover, the lower limit of integration in Eq. (4), rENFW ,\nis the solution of ΨNFW (rENFW ) = ENFW . This solution\ncannot be written in compact form. The NFW phasespace distribution fNFW (ENFW ) is plotted in Fig. 1.\nKnowing fNFW (ENFW ), the Monte-Carlo can pick individual WIMPs from the original halo. In practice, we first\npick a spatial location r from the distribution 4πr2 ρ(r)dr,\nthen we select a WIMP\nenergy from the distribup\ntion 4πfNFW (ENFW ) 2[ΨNFW (r) − ENFW ]dENFW , and\nfinally we generate a direction for the WIMP velocity\nfrom a uniform distribution on the sphere. The latter\ntwo distributions use the isotropy in velocity space. The\nWIMP angular momentum per unit mass J is easily determined from ENFW , ΨNFW\np(r) and the velocity direction\nat the point r: J = r sin θ 2[ΨNFW (r) − ENFW ], where\nθ is the angle between the velocity vector and the outward\nradial direction. With this information, the WIMP's orbit is completely determined up to the spherical symmetry.\nThere is a solvable numerical difficulty in generating\nENFW , connected to the divergence of fNFW (ENFW ) as\nENFW → ΨNFW (0). The divergence is in itself not a\nproblem because a finite radius r of the WIMP location\navoids it as ENFW ≤ ΨNFW (r) < ΨNFW (0); thus in practice the divergence point is never reached since M (r) → 0\nas r → 0. The finite value of r guarantees that the distribution from which\np the WIMPs are generated, namely\n4πfNFW (ENFW ) 2[ΨNFW (r) − ENFW ]dENFW , remains\nfinite everywhere. This distribution is shown in Fig. 1\n(blue dotted line), rescaled to fit f (E) for small E.\nEven though the distribution from which the WIMPs are\npicked is finite, the divergence in f (E) still produces a\n\nAs the star forms, the gravitational potential changes\nfrom ΨNFW (r) to Ψ⋆ (r)+Ψhalo (r)+Ψgas (r), where Ψ⋆ (r)\nis the potential generated by the star, Ψhalo (r) is the potential generated by the dark matter halo while it adiabatically contracts, and Ψgas (r) is the potential generated\nby the gas surrounding the star.\nThe star influences the potential out to a radius of\ninfluence rinfl , which can be estimated by equating the\nmass of the star M⋆ to the amount of dark matter in the\nhalo contained within rinfl , i.e. setting Mhalo (rinfl ) = M⋆ .\nTo find Mhalo (rinfl ) one can use adiabatic contraction in\nthe circular orbit approximation, in which WIMP orMFW\n) =\nbits do not cross each other so that MNFW (rinfl\nMFW\nMhalo (rinfl ). Here rinfl is the radius the WIMP orbit\nhad before it adiabatically contracted to rinfl . Using this\nNFW\nrelation with the NFW density\np\np profile we obtain rinfl ≃\nM⋆ /(2πρc δc rs ) ≃ 0.025rs M⋆ /800M⊙. For circular\norbits, rM (r) is an adiabatic invariant. After the formation of the dark star, the mass doubles inside a WIMP\nMFW\norbit originating at rinfl\nand the invariance\np of rM (r)\nNFW\nthen tells us that rinfl = rinfl\n/2 ≃ 0.01rs M⋆ /800M⊙.\nAnother way to estimate the radius of influence is to estimate how far a WIMP would go if it would leave the\nsurface of the p\nstar at a speed equal to the star's escape velocity vesc = 2GM⋆ /R⋆ . WIMPs which travel further\nout in the halo are not gravitationally bound to the star.\nFor the density distribution of the original\nNFW halo,\np\nNFW\none finds in this way that rinfl\n≃\nM⋆ /(2πρc δc rs ),\nwhich is the same expression as in the previous estimate\nof the radius of influence. In conclusion, a good estimate\nof the radius of influence is rinfl ∼ 0.01rs for a final star\nof mass M⋆ = 800M⊙ and radius R⋆ = 4 × 1011 cm.\nWithin the star and its immediate surroundings, the\nstar contribution Ψ⋆ (r) dominates over Ψhalo (r), and\nthus in that region we neglect Ψhalo (r). This approximation is good out to the radius of influence of the star\nrinfl . By neglecting the halo component Ψhalo (r), we have\nimplicitly assumed that all WIMPs close to the star are\nbounded to the star. In Section IV we show that the\ncontribution of unbound WIMPs is negligible.\nSimilarly, the density of the gas surrounding the star\nis so low that the potential Ψgas (r) it generates can\nbe neglected. For example, for a mass accretion rate\nṀ = 10−3 M⊙ /yr, in the middle of the range of the Tan-\n\n\f5\nMcKee [27] and O'Shea-Norman [30] accretion rates, the\nhydrodynamic equation gives a gas density that falls as\nr−3/2 from the surface of the√star, where it is approximately ρgas (R⋆ ) = Ṁ /(4πR⋆ GM⋆ R⋆ ) ∼ 10−10 g/cm3 .\nThis is to be compared with an average stellar density of ∼ 6 g/cm3 for the final stages of the dark star\n(M⋆ = 800M⊙, R⋆ = 4 × 1011 cm). As a consequence,\nthe gas mass Mgas (r) inside a radius r is roughly one half\nof the stellar mass M⋆ for r = rinfl . Hence also Ψgas (r)\ncan be neglected for the region r < rinfl in which we are\ninterested.\nWithin the star and its immediate surroundings, the\nstar contribution Ψ⋆ (r) dominates over both Ψhalo (r) and\nΨgas (r), and thus in that region we neglect Ψhalo (r) and\nΨgas (r). This approximation is good out to the radius of\ninfluence of the star rinfl . By neglecting the halo components Ψhalo (r) and Ψgas (r), we have implicitly assumed\nthat all WIMPs close to the star are bound to the star.\nIn Section IV we show that the contribution of unbound\nWIMPs is negligible. This tells us that we can safely assume that the potential in the region of interest is dominated by the potential of the star Ψ⋆ (r). The potential\ninside the star can be obtained numerically from the tabulated dark star evolution models in Ref. [2]. Outside the\nstar, the potential Ψ⋆ (r) is simply Keplerian.\nThe individual WIMP's response to the adiabatic contraction of the forming star can be followed using the\nadiabatic invariants\nZ rmax p\nJ and Jr = 2\n2[Ψ(r) − E] − J 2 /r2 dr, (7)\n\ntheir orbits are Keplerian. The solution is [31]\nE=\n\n2π 2 G2 M⋆2\n.\n(Jr + 2πJ )2\n\n(10)\n\nFor WIMPs that cross the star the orbit is not Keplerian and E needs to be found numerically as the potential\ninside the star is only known numerically. This is done\nby a binary search in E, as Jr is a decreasing function\nof E at fixed J , using the circular solution for the given\nJ as an upper limit for E. However, also the integration\nlimits rmin and rmax depend on E and have to be computed with every guess of E. For the orbits of interest\nhere, rmin , and sometimes also rmax , are less than R⋆ and\nneed to be found numerically. This is also done by a binary search since the expression inside the square root in\nEq. (9) is positive for rmin < r < rmax and negative for\nr > rmax and r < rmin . The starting point for this search\nis the radius rcirc of the circular orbit for the given J , as\none can show that rmin < rcirc < rmax . The circular ra3\ndius rcirc can be found using J 2 = −rcirc\n[dΨ(rcirc )/dr],\nwhich can be solved efficiently in the Monte-Carlo since\nthe right hand side depends only on the stellar configuration and does not need to be calculated for every WIMP\nanalyzed. To find the orbits of the interesting WIMPs, E\nneeds to be determined for all the different stellar stages\nfor which the WIMP orbit crosses the star.\n\nC.\n\nWhich WIMPs cross the star and when?\n\nrmin\n\nwhere J is the angular momentum per unit WIMP mass\nand Jr is the radial action per unit WIMP mass. These\ninvariants assume the same value before, during, and after the formation of the star, as long as the WIMPs do\nnot scatter. This allows us to generate the distribution\nof WIMPs as they enter the star for the first time.\nThe energy E is not an adiabatic invariant, however,\nand needs to be recomputed as the potential changes. For\nthis, we first compute Jr for the NFW potential using the\nenergy ENFW generated from fNFW (ENFW ) as explained\nabove:\nNFW\nZ rmax\np\nJrNFW = 2\n2[ΨNFW (r) − ENFW ] − J 2 /r2 dr.\nNFW\nrmin\n\n(8)\nAs Jr is an adiabatic invariant Jr = JrNFW . We then\nsolve the following equation for the new energy E:\nZ rmax p\n2[Ψ⋆ (r) − E] − J 2 /r2 dr = JrNFW .\n(9)\n2\nrmin\n\nHere the limits of integration rmin and rmax are the zeros\nof the square root. In writing this equation, we have\nassumed that E > 0, consistent with the fact that WIMPs\nclose to the star are bound to it.\nFor WIMPs on orbits that do not cross the star, the\nradial action equation can be solved analytically since\n\nFor a WIMP to be captured, it has first to cross the\nstar. Thus we need to follow how the WIMPs behave in\nand around the dark star.\nFor a WIMP to be captured, it has first to cross\nthe star. In the central regions of the halo, the star\ncompletely dominates the gravitational potential, as discussed in the previous Subsection. The potential is thus\ngiven by Ψ⋆ (r), which is Keplerian outside the star and\nnon-Keplerian inside.\nOnce the star has formed, WIMP orbits not crossing\nthe star are Keplerian. For these orbits, the minimal\ndistance from the center of the star, rmin , can be written\nin closed form as a function of the adiabatic invariants\nand the mass of the star M⋆ . Using Eq. (10) to find the\nsmallest zero of the square root in Eq. (7) gives for this\nKeplerian case\ns\n!\n(Jr + 2πJ )2\n4π 2 J 2\nK\nrmin =\n. (11)\n1− 1−\n4π 2 GM⋆\n(Jr + 2πJ )2\nThis radius depends on time through the time dependence of the star mass M⋆ .\nK\nIf rmin\nis greater than the radius of the star R⋆ , the\norbit will not cross the star at this stage in the stellar\nK\nevolution. Similarly, if rmin\nis smaller than the radius of\nthe star R⋆ , the orbit will cross the star at this stage in\nthe stellar evolution. One can be sure of these conclusions\n\n\f6\nSivertsson & Gondolo, 2010\n\nMstarRstar [M⊙R⊙]\n\n106\n\n105\n\n104\n\n103\n\n0\n\n0.1\n\n0.2\n\n0.3\nTime [Myr]\n\n0.4\n\n0.5\n\n0.6\n\nFIG. 2: The evolution of M⋆ R⋆ during the star formation.\nFirst M⋆ R⋆ grows as the star grows but then drops fast as\nthe star approaches the main sequence.\n\nbecause the Keplerian solution is unique, given E, J and\nthe point mass potential. Hence, if the Keplerian orbit\nsolution is found to be partly inside the star, no Keplerian\nsolution with the orbit completely outside the star exists\nand so the true orbit must have parts inside the star.\nConversely if the Keplerian orbit solution is found to be\ncompletely outside the star one has found the true orbit\nsince the potential is Keplerian outside the star.\nAs we are only interested in WIMPs on orbits crossK\ning the star only orbits fulfilling rmin\n≤ R⋆ at a given\ntime are interesting. As long as the individual WIMPs\ndo not scatter, the adiabatic invariants in Eq. (11) are\nK\nconserved, implying that M⋆ rmin\nis constant in time (it\nis an adiabatic invariant). Along with the requirement\nthat WIMPs crossing the star have to fulfill the relation\nK\nM⋆ rmin\n≤ M⋆ R⋆ , one finds that the star can potentially\naccess the maximum amount of dark matter when M⋆ R⋆\nis maximized. Fig. 2 shows the behavior of the quantity\nM⋆ R⋆ as a function of time for the Spolyar et al canonical case. At first M⋆ R⋆ increases as the dark star grows,\nmeaning that more and more WIMPs can cross the star.\nAt the time of the Kelvin-Helmholtz (KH) contraction\n(t ∼ 0.3 Myr), the quantity M⋆ R⋆ decreases rapidly, leaving behind WIMPs that were once in stellar contact. For\nK\nexample, WIMPs with M⋆ rmin\n∼ 105 M⊙ R⊙ cross the\nstar for times between 0.02 Myr and 0.3 Myr, but can\nno longer cross the star or be captured after 0.3 Myr.\nThis makes it hard for the star to capture WIMPs in the\nlater stages after the KH contraction. As a consequence,\nthe accessible amount of dark matter that has survived\nthe formation of the star might not be high enough to\nsupport the dark star after its KH contraction.\n\nD.\n\nThe fate of the WIMPs\n\nOnce we know which Monte-Carlo WIMPs cross the\nstar at a given stage of the dark star evolution, the next\nstep is to find their orbits. Some of these orbits are\nonly partially inside the star, some are completely inside the star. Knowing the gravitational potential inside\nand outside the star and the adiabatic invariants J and\nJr , enough information is given to determine E from Eq.\n(7). This is done as explained at the end of Section II.B.\nHaving determined the energy and the angular momentum of the WIMP in orbit, the full orbit is specified up\nto the spherical symmetry (that is up to the specification\nof the plane of the orbit and of the angle of the periilun\n[36]).\nIn the Monte-Carlo, to find the fate of the WIMP\nwe need to calculate the probability per unit time for\nthe WIMP to scatter off nucleons in the star as well as\nthe probability for the WIMP to annihilate with other\nWIMPs in the star. In the following, we derive the scattering and annihilation rates at a given stage of the stellar\nevolution.\nWhen on an orbit crossing the star, the WIMP spends\nsome time\ndt = 2\n\ndr\nvr\n\n(12)\n\nin the shell between r and r + dr. Here the factor of\n2 accounts for the fact that the WIMP can cross the\nshell twice, once on its way in and once on its way out;\nmoreover,\np\n(13)\nvr = v 2 − (J /r)2\nis the (magnitude of the) radial velocity, where\np\nv = 2[Ψ⋆ (r) − E]\n\n(14)\n\nis the speed at position r. The probability that in one\npassage through the star the WIMP annihilates against\nanother WIMP in the dark matter population within the\nstar is then given by\nZ min(rmax ,R⋆ )\ndr\nσann v nDM (r) ,\nPann = 2\n(15)\nvr\nrmin\nwhere for the number density of WIMPs nDM (r) at radius r we take the results from the dark star evolution\nin Ref. [2]. For WIMPs on orbits completely inside the\nstar, the phrase \"one passage though the star\" refers to\none revolution of the WIMP orbit. The number of times\na WIMP passes through the star in the time ∆t is\n∆t\n,\nT\n\n(16)\n\nwhere the orbital time T is determined numerically from\nthe integral\nZ rmax\ndr\n.\n(17)\nT =2\nrmin vr\n\n\f7\nFinally the probability that a WIMP annihilates during\nthe time interval ∆t is\nPann =\n\n∆t\nPann .\nT\n\n(18)\n\nWe annihilate Monte-Carlo WIMPs according to this\nprobability.\nWhen passing the stellar material there is also some\nprobability for the WIMP to scatter off nuclei in the star.\nHere only scattering off hydrogen is considered since we\nassume the scattering cross section is spin-independent,\nand so no scattering occurs off helium. Heavier elements\nare a negligible component of the material forming the\nfirst stars. We assume that at all radii hydrogen contributes 75% of the stellar mass density.\nIn one passage through the star the probability for the\nWIMP to scatter in a shell at radius r is given by\ndPscatt = 2 σscatt v nH (r)\n\ndr\n.\nvr\n\n(19)\n\nHere the factor of 2 accounts for the the fact that the\nWIMP crosses the shell twice, and nH (r) is the number\ndensity of hydrogen atoms in the dark star (taken from\nRef. [2]). The scattering probability per WIMP passage\nthrough the star is then given by\nZ min(rmax ,R⋆ )\ndPscatt .\n(20)\nPscatt =\nrmin\n\nThen the probability that a WIMP scatters in the time\n∆t is\nPscatt =\n\n∆t\nPscatt .\nT\n\n(21)\n\nIn a scattering event, the WIMP loses an amont of\nenergy ∆E subject to the condition\n\u00132\n\u0012\nmχ − mH\n[Ψ(r) − E].\n(22)\n∆E ≤\nmχ + mH\nHere Ψ(r) − E is the WIMP kinetic energy before the\nscattering at the scatterer location, and mH is the mass\nof the target nucleus, which in this paper is always hydrogen since we assume the spin dependent scattering cross\nsection to dominate. All possible values of the energy loss\n∆E are equally probable, making it straightforward for\nus to determine the WIMP energy E ′ after the scattering.\nAt a given evolutionary stage of the star, we use the\nscattering probability per unit time in Eq. (21) to decide\nhow long it takes before the WIMP scatters. Then we\ncompare this time to the time left in the given evolutionary stage to decide if the WIMP scatters before the\ndark star evolves to a new stage. Afterwards, the MonteCarlo uses the annihilation probability per unit time in\nEq. (18) to evaluate if the WIMP annihilates before it\nscatters or before the current evolutionary stage ends. If\nthe WIMP scatters, the Monte-Carlo uses the distribution dPscatt /Pscatt to determine in which shell the WIMP\n\nscatters. In the scattering, the WIMP loses energy and\nends up on a lower energy orbit, specified by new values\nof E ′ and J ′ . The new direction of the scattered WIMP,\nand hence J ′ , are easily determined as the scattering is\nisotropic in the center of mass system. After the WIMP\nis scattered, it is allowed to scatter again in the time left\nbefore the next evolutionary stage of the dark star.\nWhen passing to the next evolutionary stage, the adiabatic invariant Jr′ is needed and can be determined using\nEq. (7) with the E ′ and J ′ of the last orbit of the scattered WIMP. This allows us to follow the WIMP response\nto the stellar evolution whether the WIMP scatters or\nnot. If the WIMP scatters many times it eventually sinks\ntowards the core of the star and annihilates with the central WIMP population, injecting its energy into the dark\nstar.\nRef. [32] contains further details and discussions on\nthe scattering process. There one can also find how to\ndetermine the angular momentum of the WIMP after it\nhas scattered.\n\nIII.\n\nRESULTS\n\nOur Monte-Carlo follows a high number of WIMPs\nfrom the initial NFW halo until they annihilate or the\nstar has formed. It allows us to track how much energy\ndark matter deposits into the star at the different stages\nof stellar evolution. Fig. 3 shows the resulting annihilation luminosities with and without scattering. The top\nsolid (red) line includes WIMP-nucleon scattering, while\nthe bottom dashed (blue) line does not. At the early\nstages of star formation, scattering of WIMPs off star\nnuclei is not important because the baryon density inside\nthe dark star is low. As the dark star becomes denser,\nscattering becomes important, provided the scattering\ncross section is large enough. For the stellar evolution\nin [2], the dark star becomes dense enough for scattering\nto be important just as it starts its rapid KH contraction\nonto the main sequence (see Fig. 2). With the rapidly\nincreasing stellar density at this stag,e capture becomes\nvery efficient and via repeated scattering the captured\nWIMPs rapidly sink toward the center of the star where\nthe dark matter density is high. This makes the captured\nWIMPs annihilate fast and gives the burst in luminosity\nseen in Fig. 3. As long as capture is efficient, the high\ncentral WIMP density is rapidly refilled with more captured WIMPs.\nHowever, the burst lasts a short time because (1) the\nKH contraction is rapid and the volume of dark matter available for annihilation decreases quickly, and (2)\nit takes a short time to use up all the WIMPs that can\nbe efficiently captured by the dark star, and no other\nWIMPs are available for efficient capture. The latter reason (\"death by starvation\") is the most important one, as\ndiscussed in connection with Fig. 6 in Section IV. The\nstar is very fast at eating the WIMPs that it can eat easily. After the contraction, WIMP annihilation continues\n\n\f8\nSivertsson & Gondolo, 2010\n\n1.8⋅107\n1.6⋅107\n\nwith scattering\nwithout scattering\n\n10-8\n\n7\n\n10-9\n\n1.2⋅107\n\nDensity [g/cm3]\n\nLuminosity [L⊙]\n\n1.4⋅10\n\n107\n8⋅106\n6⋅10\n\nSivertsson & Gondolo, 2010\n\n10-7\n\n6\n\n10-10\n10-11\n10-12\n\n4⋅106\n10-13\n\n2⋅106\n0\n\n0\n\n0.1\n\n0.2\n\n0.3\nTime [Myr]\n\n0.4\n\n0.5\n\n0.6\n\nFIG. 3: The time evolution of the dark star luminosity from\nWIMP-WIMP annihilations. The top solid (red) line includes\nWIMP-nucleon scattering in addition to annihilation; the bottom dashed (blue) line does not include scattering.\nSivertsson & Gondolo, 2010\n\nTotal mass of WIMPs crossing the star [M⊙]\n\n1\n\n10-14\n\nt = 0.40 Myr\nt = 0.28 Myr\n0\n\n2⋅1012\n\n4⋅1012\n\n6⋅1012 8⋅1012\nRadius [cm]\n\n1013\n\n1.2⋅1013\n\nFIG. 5: The density profile of dark matter around the star\njust before (dotted blue line) and just after (solid red line)\nthe Kelvin-Helmholtz contraction at the end of the dark star\nphase (scattering is included when generating this graph).\nThe vertical straight line marks the radius of the star after contraction; before contraction, the radius of the star is\n4.2×1013 cm, about four times the length of the horizontal\naxis.\n\n0.1\n\n0.01\n\n0.001\n\nno annihilation\nannihilation only\n+ scattering\n\n0.0001\n0\n\n0.1\n\n0.2\n\n0.3\nTime [Myr]\n\n0.4\n\n0.5\n\n0.6\n\nFIG. 4: The dark matter mass accessible to the star as a\nfunction of time. In other words, the total mass of the WIMPs\non orbits intersecting the star at the different stellar evolution\nstages. The dotted (blue) line includes both WIMP scattering\nand annihilation. The dashed (green) line includes WIMP\nannihilation but no scattering. The solid (red) line includes\nneither scattering nor annihilation.\n\nbut at a much smaller rate; in the case we study, the annihilation after contraction is suppressed by (very roughly)\nabout 15 orders of magnitude (five orders of magnitude\ncoming from the change in stellar volume and two times\nfive orders of magnitude coming from the decrease in density due to annihilation and scattering, extracted from\nFig. 5 below).\nWhen WIMPs scatter, they lose energy, go on smaller\norbits, and spend more time near the center of the star\nwhere the density is higher and the annihilation faster.\nBoth annihilation and scattering remove WIMPs from\norbits that cross the star. This is illustrated in Fig. 4,\nwhere the mass of dark matter accessible to the star (i.e.\n\nthe total mass of WIMPs on orbits crossing the star) is\nplotted as a function of time. The three lines illustrate\nthe effect of the stellar evolution as well as that of scattering and annihilation. The top (solid red) line is similar\nto the curve in Fig. 2, and includes just the gravitational\nresponse of the WIMPs to the star and neither scattering nor annihilation. It shows that the mere contraction of the star already makes it a much smaller target\nfor WIMP capture, by about one order of magnitude in\nthe accessible mass. Annihilation reduces the number of\nWIMPs that cross the star (green dotted line), as annihilation removes WIMPs from the system. The inclusion\nof scattering reduces this number further, which might\nat first not seem obvious. The reason is that WIMPs on\norbits not crossing the star cannot scatter in the star.\nHence the total mass of WIMPs on orbits crossing the\nstar can never increase due to scattering. Furthermore,\nscattering puts WIMPs onto lower energy orbits, making\nthem more vulnerable to annihilation. Thus the number of WIMPs in stellar contact is further reduced (see\nFig. 4). As discussed in Section IV, our Monte-Carlo only\nincludes WIMPs from the inner 1 percent of the NFW\nhalo scale radius rs , but WIMPs from regions further out\ndo not contribute significantly to the annihilation rate inside the dark star.\nFrom the Monte-Carlo one can also extract the dark\nmatter density profile around the formed star. This is\nshown in Fig. 5 for two different times, just before and\njust after the KH contraction (blue dotted line and red\nsolid line, respectively). The solid red line is for the time\n0.4 Myr, which is just after nuclear burning has started.\nThe blue dotted line shows the time 0.28 Myr, which is\njust before the star contracts enough for scattering to\n\n\f9\n\nIV.\n\nDISCUSSION\n\nWe mentioned in Section III that the death of a dark\nstar is due to dark matter exhaustion rather than rapid\nKH contraction. In the first case, the WIMP supply runs\nout first and the lack of luminosity from WIMP annihilation causes the dark star to contract onto the main\nsequence. In the second case, the dark star contracts\nfirst, for example because the WIMPs do not provide\nenough luminosity, and is then unable to continue capturing enough WIMPs to remain a dark star because\nit has become too small. There is a third possibility,\nnamely that the dark star does not contract or might\neven grow, since the extra luminosity provided by the\ncaptured WIMPs make it puffier and it may become more\nmassive by accreting gas for a longer time. If the dark\nstar does not grow, there is a maximum amount of WIMP\nmass that can be captured before going onto the main\nsequence, given by the graph in Fig. 4 at the time just\nbefore contraction ∼ 0.27 Myr.\nHere we argue that even if the dark star does not contract, the supply of dark matter is rapidly exhausted (the\n\nSivertsson & Gondolo, 2010\n\n1.8⋅107\n1.6⋅107\n1.4⋅107\nLuminosity [L⊙]\n\nbe important, as can be seen in Fig. 3. The vertical,\nblack line marks the size of the star at t = 0.4 Myr. At\nt = 0.28 Myr the stellar radius is 4.2 × 1013 cm and hence\noutside the graph. The unevenness of the graph comes\nfrom having simulated a finite number of WIMPs; the\nvery central region has far less simulated WIMPs (as the\nfraction of WIMPs reaching so far in is very low) and\nhence greater inaccuracy.\nThe KH contraction of the dark star increases the dark\nmatter density in the central region through adiabatic\ncontraction. The density peak at ∼ 2 × 1012 cm on the\nsolid line in Fig. 5 is a residual of this density increase.\nMoreover, scattering increases the density at the very\ncenter by moving WIMPs into low energy orbits on which\nthey spend more time near the center. The underdense\n\"hole\" at small radii on the solid line in Fig. 5 is a consequence of the rapid WIMP scattering and annihilation.\nWIMPs with large contributions to the dark matter density inside the dark star are very vulnerable to scattering\nwhich makes them sink to the core and annihilate away\nfast. In the absence of inhomogeneities, this final configuration is stationary: WIMPs in orbits that crossed the\nstar have scattered and annihilated away, and WIMPs\nin orbits that do not cross the star remain in those orbits. Even if the star would move in space, the WIMPs\nsurrounding it would move with it, much like the Moon\nmoves with the Earth while orbiting it. As long as this\nsetting is not disturbed by inhomogeneities, the WIMP\ndensity profile around the star will look essentially the\nsame until the star dies (except that the annihilation\ntimescale near the density peak is short and annihilation will reduce the density). The star will then simply\nbe a normal massive star, living its life undisturbed by\nits envelope of dark matter.\n\n1.2⋅107\n107\n8⋅106\n6⋅106\n4⋅106\n2⋅106\n0\n\n0\n\n0.1\n\n0.2\n\n0.3\nTime [Myr]\n\n0.4\n\n0.5\n\n0.6\n\nFIG. 6: The energy injected into a dark star from WIMP annihilation for a star with modified stellar evolution so that it\nis artificially frozen just before contraction. The WIMP luminosity in the altered stellar evolution is given by the solid\n(red) line; for reference, the WIMP luminosity without altering the stellar evolution is shown by the dashed (blue) line.\nBoth luminosities include scattering. This is to illustrate that\nthe disappearance of dark matter in contact with the star is\ndue to the depletion of star-crossing orbits with low angular\nmomentum and is not an artifact of analyzing a star that\ncontracts too rapidly.\n\nfirst case above). In principle, we should recompute the\nevolution of the dark star in the light of the capture results we find, instead of using the dark star evolution\ntracks without capture in [2] (notice that we cannot use\nthe evolution tracks with capture in [2] because they are\nbased on Gould's capture formula that does not apply to\nour case). A detailed numerical study of the response of\nthe dark star to the extra luminosity produced by captured WIMPs is under way [28]. Here we avoid going\ninto the details of the stellar response; we instead artificially freeze the evolution of the dark star on the verge\nof contraction. We prolong the stage in the stellar evolution when the dark matter capture via scattering is at\na maximum (the peak in Fig. 3) from 6,000 to 60,000 yr.\nThe dark matter luminosity for the star with this slight\nchange in the stellar evolution is shown in Fig. 6, which\nis analogous to Fig. 3 but for the KH contraction which\nis artificially delayed as just explained. We still observe\na drastic reduction of the luminosity due to WIMP annihilation. We find that the extra dark matter supplied via\nWIMP nucleon scattering can only support the star for a\nlimited period of time; it does not result in a long lasting\ndark star phase. In other words, we conclude that the\ndemise of the dark star phase is due to the exhaustion of\nthe dark matter supply.\nIn our code we have not included WIMP annihilations\nthat occur outside the star. We expect these annihilations are not important for the energy production in the\ndark star for the following reason. The dark star cannot absorb the energy released by WIMP annihilations\n\n\f10\noutside of it, but the outside WIMP annihilations would\nsomewhat reduce the number of WIMPs available for annihilation inside the dark star. However, during the dark\nstar phase only a very small fraction of the accessible\nWIMP population would have annihilated away outside\nthe dark star, making this depleting effect unimportant\nfor the dark matter heating of the dark star. Dark matter annihilations can also affect the cooling of the dark\nstar by ionizing the gas (discussed in [21]). We are here\nonly looking at the dark matter component of the dark\nstar process so feedback through gas ionization is beyond\nthe scope of our paper.\nThe conclusion that the main sequence star does not\nsignificantly benefit from its surrounding dark matter\nhalo is based on the assumption that the final dark matter configuration, as shown in Fig. 5, is stable enough\nagainst perturbations to largely sustain its shape over\ntime. For example a close encounter with another star\ncould severely affect the dark matter envelope. However, without long term heating from WIMP annihilations, stars this massive are very short lived, with expected lifetimes of less than 2 Myr [33]. Since we assume\nthere is only one dark star per dark halo, the time scale\nfor the dark star to encounter another star is expected to\nbe much longer than the star's lifetime.\nThe star locally completely dominates the gravitational potential so if the star experiences a small acceleration towards some distant object the dark matter envelope would just follow, keeping its shape and distance to\nthe star. If the star experiences a more violent event, so\nthat it is suddenly kicked out of its position and thrown\ninto its dark matter envelope, the star will once again\nbe able to benefit from the dark matter. However, the\nsystem will fast reconfigure itself around the new gravitational center at the stellar location. The star would\nquickly eat up the WIMPs it can eat easily, and the other\nWIMPs will have too high an angular momentum relative to the new gravitational center to be reachable by\nthe star. Such a drastic event would hence induce a short\ndark matter burst similar to the capture burst in Fig. 3,\nfollowed once again by starvation of the star. For the star\nto have a long-term benefit from the dark matter envelope, continuous perturbations of the star or the dark\nmatter envelope are needed.\nThe initial star-forming gas cloud could also have some\ninitial velocity relative to the dark matter halo. The\nforming star will still create a dark matter envelope\naround it. The star dominates the gravitational potential and carries the WIMPs with it, hence the WIMPs\nin the star's dark matter envelope do not feel that the\nhalo has a net velocity relative to the star. In brief, the\ninitial conditions of the WIMP orbits in the dark matter\nenvelope will be slightly different but the dynamics of the\nsystem will be the same, so the final result for the dark\nmatter in the central region of the halo will essentially be\nthe same. The only WIMPs that will notice the relative\nvelocity between the star and the halo are the WIMPs\ntraveling far enough out in the halo to also probe the\n\nhalo's gravitational potential. However, as these WIMPs\npass the region where the star is, their velocities are very\nhigh, making any reasonable stellar velocity negligible in\ncomparison. We also show below that these WIMPs are\nnot important anyway. Finally, a net velocity of the starforming cloud could have a significant impact only if the\nstar would form far away from the center of the halo and\nthus miss the halo central high dark matter density. As\nlong as the formation is not very far from the center, the\noff-center location would primarily reduce the initial dark\nmatter heating from adiabatic contraction as this contraction starts before the star has taken its dominance\nover the local gravitational potential.\nThe star's host dark matter halo is expected to have\nsubstructure with smaller subhalos of dark matter. The\neffect of these subhalos on the formation of dark stars\nis still to be explored. In any case, subhalos in the central region are likely to be destroyed by the formation\nof the dark star. Since subhalos are only a fraction of\nthe total dark matter population around the star, and\nsince each subhalo would provide WIMPs for a limited\namount of time and there would be gaps in the WIMP\nsupply between subhalo crossings, the subhalos are not\nexpected to sustain a dark star through capture over a\nlong period of time. It could be possible, however, that\nlarge- and small-angle gravitational scattering of WIMPs\noff subhalos around the dark star changes the phase-space\nstructure of the dark matter envelope. A similar effect\nwould arise from inhomogeneities in the gas surrounding\nthe dark star. Many small-angle deflections could over\ntime make some WIMPs in the envelope end up crossing\nthe star.\nThe part of the dark matter envelope closest to the\nstar should be the most vulnerable to perturbations that\nmake the WIMPs cross the star. If the perturbations\nwould be such that the star first accesses the WIMPs in\nits immediate surroundings, it would need to capture all\nof the dark matter out to a radius of 104 R⋆ (after KH\ncontraction) to prolong its lifetime by roughly 1 Myr.\nHence, even if the dark star could efficiently capture\nthe dark matter in this closest reservoir, it is still not\nenough to substantially prolong the life of the star. To\ndo so, the dark star needs to efficiently access dark matter\nfrom outside 104 R⋆ . By a simple geometrical argument,\nWIMPs further away from the star should be less likely\nto be perturbed by inhomogeneities into orbits crossing\nthe star. Orbits stretching further out also have longer\norbital times, giving fewer stellar crossings per unit time.\nAssuming that all WIMPs are constantly subject to perturbations, and using a simple geometrical probability\nfactor (R⋆ /r)2 for the probability per orbital revolution\nthat an orbit extending out to radius r intersects the star,\ngives an estimate of the capture rate and of the luminosity contribution from WIMPs on orbits stretching further\nout than 104 R⋆ . This luminosity is too small to sustain\nthe dark star phase.\nThe overall conclusion of this is that it could in principle be possible for WIMPs from the dark star's WIMP\n\n\f11\nenvelope to temporarily feed the main sequence star with\nenough dark matter to relaunch a short dark star phase,\nfor example through perturbations of or direct interaction with dark matter subhalos in the dark matter halo.\nWhat the above argument shows is however that it is very\nunlikely for the dark matter envelope to be able to continuously supply a dark matter capture rate high enough\nto obtain a dark star phase comparable or longer than\nthe star's main sequence lifetime.\nIn the tradition of previous papers about Pop III dark\nstars, this work assumes that the first stars form individually near the center of a dark matter halo. Some recent\nwork [34] has suggested that some of the first stars might\nhave formed as binary systems. If that would be the case,\nthe analysis of the dark matter response during their formation would be severely more complicated. In general,\none would expect a less important density increase due\nto adiabatic contraction and also, once the nearby star\nhas formed, their motion should accelerate and throw out\nWIMPs bound to the central region, further reducing the\ncentral density. To make this statements more precise, a\nspecific investigation is needed.\nPopulation III stars as massive as discussed here can\nbecome unstable to pulsations [33, 35]. An interesting\nthought is that as the star pulsates it has access to a part\nof its dark matter envelope. This could potentially have\ninteresting consequences, but would require a study in\nitself. In any case, the dark star can only eat up the dark\nmatter in the envelope during the first few pulsations,\nsince in subsequent pulsations the dark matter supply\nwill have been depleted. Moreover, the gas density in\nthe outer layers of the pulsating star may be too small\nfor scattering of WIMPs to occur with any significance.\nTo speed up the Monte-Carlo calculation, when picking WIMPs from the initial NFW halo, we restrict ourselves to the region r < 0.01rs . In principle, one should\nalso consider WIMPs further out, but the probability\nthat they scatter in the dark star decreases rapidly with\ndistance and they soon become irrelevant. In addition,\nthe orbital time for WIMPs with orbits extending out to\n0.02rs is ∼ 1 Myr, meaning that these WIMPs will not\nbe captured by the dark star within the much shorter\nlifetimes we find. We have checked that WIMPs beyond\n0.01rs are indeed irrelevant for our results by running\na Monte-Carlo simulation picking WIMPs from a region\nthat extended tenfold in radius, r < 0.1rs .\nIn our derivation, we have neglected the contribution\nfrom WIMPs that are not bound to the star. Here we\npresent several arguments leading to the conclusion that\nthe maximum rate at which WIMPs can be captured by\na dark star from the unbound WIMP population is indeed small enough to be completely negligible. Unbound\nWIMPs are on orbits that extend beyond the radius of influence of the star rinfl . This radius was estimated in Section II.B to be rinfl ∼ 0.01rs for the capturing stages of a\ndark star, namely the final stages with M⋆ ∼ 103 M⊙ and\nR⋆ = 4×1011 cm. Now, the density of WIMPs at r ∼ rinfl\nis comparable to the original density in the NFW halo,\n\nnamely ∼ 103 GeV/cm3 . This density is much smaller\nthan the density of bound WIMPs near the star, which\nis of order 1011 GeV/cm3 . Therefore unbound WIMPs do\nnot contribute significantly to the WIMP density near the\nstar. One might worry that gravitational focusing would\nbe able to collect more unbound WIMPs than the previous argument would indicate. However, the focusing effect can be included in an estimate of the amount of dark\nmatter mass that could fall in from a distance of rinfl and\ncross the star. One finds for this rate of mass collection\n2\nṀunbound ∼ πR⋆2 F⋆ , where F⋆ = F (rinfl )vesc\n/v(rinfl )2\nis the inward flux of unbound WIMPs at the surface\n2\nof the star, vesc\n/v(rinfl )2 is the gravitational focusing\nfactor, and F (rinfl ) = ρ(rinfl )v(rinfl ) is the inward flux\nat r = rinfl . Estimating the density and speed of\nWIMPs at r = rinfl using ρNFW ∝ r−1 and v(rinfl ) =\n[GMNFW (rinfl )/rinfl ]1/2 ∼ 1 km/s, gives a mass collection rate of ∼ 10−5 M⊙ /Myr from the population of unbound WIMPs. To survive at a luminosity of ∼ 107 L⊙ ,\nthe star would need an inflow of dark matter WIMPs\nto annihilate equal to ∼ 1M⊙ /Myr, much higher than\nwhat unbound WIMPs could provide. Also, only a small\nfraction of the WIMPs passing through the star will actually scatter and be captured by the star, reducing the\nheating from unbound WIMPs further. In addition, the\norbital periods of WIMPs on unbound orbits, i.e. orbits\nthat reach out to r = rinfl or more, is at least 2 Myr (assuming Keplerian orbits in this estimate). This time is\ncomparable to the lifetime of the dark star, including the\nlater main sequence stage. Thus unbound WIMPs cannot reach the star in time to keep it alive through dark\nmatter annihilation.\nIt has recently been argued in [20] that triaxiality of\nthe dark matter halo could efficiently continuously supply WIMPs to the star and maintain the dark star phase\non cosmological time scales. However, as the star dominates the gravitational potential in the central part of\nthe halo, only WIMPs traveling out to radii comparable\nto the star's radius of influence rinfl feel the triaxiality\nof the dark matter halo. Thus the method in the previous paragraph can be used to estimate the contribution\nto the capture rate from WIMPs probing the triaxiality\nof the halo. This estimate gives that the supermassive\ndark star's capture rate from the triaxial halo in [20] is\ntoo low by a factor of ∼ 109 to sustain the luminosity\nof the star. Even though this estimate is based on the\nouter halo being isotropic, accounting for anisotropies or\nchaotic orbits is not expected to increase the capture rate\nby a factor of ∼ 109 . A proper treatment of the triaxiality may slightly increase the capture rate thanks to\nelongated orbits that are bound to the star and almost\nreach rinfl , but again the increase cannot be by 9 orders\nof magnitude. In summary, a triaxial halo could feed the\nstar with dark matter for a very long time but as the capture rate is too low to sustain the dark star, triaxiality\nof the halo is not interesting for the capture rate.\nAn intriguing possibility is that long-lived dark stars\nmay form from the ashes of Pop III dark stars (Phoenix\n\n\f12\nDark Stars). When the main sequence star following\nthe dark star phase explodes, it ejects gas into a region that can still have a considerable density of dark\nmatter WIMPs. This dark matter is the remnant of the\ndark matter envelope that surrounded the dark star. In\nfact, for σann v = 3 × 10−26 cm3 /s, a remnant dark matter\ndensity n0 = 1/(σann vt0 ) ∼ 108 WIMPs/cm3 can be sustained for a time t0 ∼ 10 Gyr (approximately the age of\nthe universe). For a 100 GeV WIMP, this corresponds to\na mass density ρ0 = 1010 GeV/cm3 = 2 × 10−14 g/cm3 .\nSome of the ejected gas may fragment and form Pop II\nand later Pop I stars, which can move relative to the\ndark matter remnant and capture WIMPs from the environment in the way described by previous authors [3–5].\nThese \"daughter\" stars are expected to be less massive\nthan their parent Pop III dark stars, and thus would need\nless dark matter to be a dark star. Given appropriate environmental conditions, some of these second generation\ndark stars might perhaps survive until today.\nV.\n\nCONCLUSIONS\n\nAs found by previous authors, the density of dark matter inside a Pop III protostar can be high enough to lead\nto a dark star phase powered by dark matter annihilation\ninstead of nuclear fusion. A large WIMP-nucleon scattering cross section may further increase the energy injected\ninto the dark star by WIMP annihilations. As discussed\nin the introduction, many authors have claimed that the\nWIMP supply from scattering may last a long time, even\nuntil the present day. Our work does not support those\nfindings.\nWe find that WIMP capture is not important until the\ndark star contracts on its way to the main sequence and\nbecomes dense enough to be a viable dark matter target.\n\n[1] D. Spolyar, K. Freese, and P. Gondolo, Phys. Rev. Lett.\n100, 051101 (2008), 0705.0521.\n[2] D. Spolyar, P. Bodenheimer, K. Freese, and P. Gondolo,\nAstrophys. J. 705, 1031 (2009), 0903.3070.\n[3] S.-C. Yoon, F. Iocco, and S. Akiyama, Astrophys. J. 688,\nL1 (2008), 0806.2662.\n[4] M. Taoso, G. Bertone, G. Meynet, and S. Ekstrom, Phys.\nRev. D78, 123510 (2008), 0806.2681.\n[5] K. Freese, D. Spolyar, and A. Aguirre, JCAP 0811, 014\n(2008), 0802.1724.\n[6] W. H. Press and D. N. Spergel, Astrophys. J. 296, 679\n(1985).\n[7] A. Gould, Astrophys. J. 321, 571 (1987).\n[8] P. Scott, M. Fairbairn, and J. Edsjo, Mon. Not. Roy.\nAstron. Soc. 394, 82 (2008), 0809.1871.\n[9] I. V. Moskalenko and L. Wai (2006), astro-ph/0608535.\n[10] I. V. Moskalenko and L. L. Wai, Astrophys. J. 659, L29\n(2007), astro-ph/0702654.\n[11] G. Bertone and M. Fairbairn, Phys. Rev. D77, 043515\n(2008), 0709.1485.\n\nWe also find that WIMP capture lasts a relatively short\namount of time as the WIMPs available for capture are\nquickly depleted in less than 105 years and their orbits\nare not replenished.\nIt is also very unlikely that perturbations in the star's\ndark matter envelope could keep the inflow of dark matter high enough to support a further prolongation of the\ndark star phase, namely for lifetimes much longer than\nthe 105 years we here calculated. Furthermore the inflow\nof dark matter from the outer regions of the halo is too\nsmall to be of any interest. From this we conclude that\na single Pop III star forming at the center of an NFW\nhalo will have a total lifetime of order a few million years\nand that the dark star phase supported by WIMP capture will not substantially prolong the lifetime of the dark\nstar.\nOur work indicates that WIMP capture in Pop III dark\nstars is not able to make them live forever. However,\nlater generations of less massive stars produced in the\ndark matter environment left behind by Pop III dark\nstars may capture enough dark matter to form a second\ngeneration of dark stars.\nAcknowledgments\n\nWe thank Pat Scott and Joakim Edsjö for very rewarding discussions. In particular, we are grateful to Douglas Spolyar, Peter Bodenheimer, and Katherine Freese\nfor letting us use an unpublished set of dark star evolution models from [2]. This work was partially supported by the National Science Foundation under award\nno. PHY-0456825 (P.G.), and by the Swedish Research\nCouncil (Vetenskapsrådet) under contract no. 315-20046519 (S.S.). We thank the Bakficken Cafe, Visby, where\nthis work was completed.\n\n[12] M. Fairbairn, P. Scott, and J. Edsjo, Phys. Rev. D77,\n047301 (2008), 0710.3396.\n[13] F. Iocco, Astrophys. J. 677, L1 (2008), 0802.0941.\n[14] K. Freese, P. Gondolo, J. A. Sellwood, and D. Spolyar,\nAstrophys. J. 693, 1563 (2009), 0805.3540.\n[15] F. Iocco et al., Mon. Not. Roy. Astron. Soc. 390, 1655\n(2008), 0805.4016.\n[16] K. Freese, P. Bodenheimer, D. Spolyar, and P. Gondolo,\nAstrophys. J. 685, L101 (2008), 0806.0617.\n[17] K. Freese, P. Bodenheimer, P. Gondolo, and D. Spolyar,\nAIP Conf. Proc. 1166, 33 (2009), 0812.4844.\n[18] K. Freese, D. Spolyar, P. Bodenheimer, and P. Gondolo,\nNew J. Phys. 11, 105014 (2009), 0903.0101.\n[19] E. Ripamonti et al. (2009), 0903.0346.\n[20] K. Freese, C. Ilie, D. Spolyar, M. Valluri, and P. Bodenheimer (2010), 1002.2233.\n[21] E. Ripamonti et al. (2010), 1003.0676.\n[22] P. Scott, J. Edsjo, and M. Fairbairn (2007), 0711.0991.\n[23] P. Scott, M. Fairbairn, and J. Edsjo, PoS IDM-2008,\n073 (2008), 0810.5560.\n\n\f13\n[24] P. Scott, J. Edsjo, and M. Fairbairn (2009), 0904.2395.\n[25] J. Casanellas and I. Lopes, Astrophys. J. 705, 135 (2009),\n0909.1971.\n[26] J. F. Navarro, C. S. Frenk, and S. D. M. White, Astrophys. J. 462, 563 (1996), astro-ph/9508025.\n[27] J. C. Tan and C. F. McKee, Astrophys. J. 603, 383\n(2004), astro-ph/0307414.\n[28] S. Sivertsson, D. Spolyar, P. Gondolo, and K. Freese, in\npreparation.\n[29] J. Binney and S. Tremaine, Galactic Dynamics (Springer\nUniversity Press, 2008).\n[30] B. W. O'Shea and M. L. Norman, Astrophys. J. 654, 66\n\n(2006), astro-ph/0607013.\n[31] H. Goldstein, C. Poole, and J. Safko, Classical Mechanics\n(Addison Wesley, 2001).\n[32] S. Sivertsson and J. Edsjo (2009), 0910.0017.\n[33] D. Schaerer, Astron. Astrophys. 382, 28 (2002), astroph/0110697.\n[34] M. J. Turk, T. Abel, and B. W. O'Shea, Science 325,\n601 (2009), 0907.2919.\n[35] I. Baraffe, A. Heger, and S. E. Woosley (2000), astroph/0009410.\n[36] From the Basque word ilun meaning dark.\n\n\f"}