{"id": "http://arxiv.org/abs/0910.1409v3", "guidislink": true, "updated": "2012-10-06T01:08:02Z", "updated_parsed": [2012, 10, 6, 1, 8, 2, 5, 280, 0], "published": "2009-10-08T05:06:48Z", "published_parsed": [2009, 10, 8, 5, 6, 48, 3, 281, 0], "title": "Pathwidth, trees, and random embeddings", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0910.4951%2C0910.5621%2C0910.0542%2C0910.2286%2C0910.1358%2C0910.3338%2C0910.3307%2C0910.1409%2C0910.2904%2C0910.3953%2C0910.4367%2C0910.4467%2C0910.2191%2C0910.5102%2C0910.3282%2C0910.5152%2C0910.0767%2C0910.4128%2C0910.4232%2C0910.1953%2C0910.3757%2C0910.5486%2C0910.2025%2C0910.4228%2C0910.0494%2C0910.0633%2C0910.5940%2C0910.1585%2C0910.0893%2C0910.0484%2C0910.3008%2C0910.0963%2C0910.0822%2C0910.1556%2C0910.5053%2C0910.5323%2C0910.2779%2C0910.2741%2C0910.2972%2C0910.1422%2C0910.3653%2C0910.1216%2C0910.0978%2C0910.4728%2C0910.2055%2C0910.3053%2C0910.1790%2C0910.4546%2C0910.0092%2C0910.3251%2C0910.4164%2C0910.1824%2C0910.5706%2C0910.3366%2C0910.5702%2C0910.5147%2C0910.4389%2C0910.5123%2C0910.1543%2C0910.1945%2C0910.2440%2C0910.0038%2C0910.4598%2C0910.4835%2C0910.2475%2C0910.2774%2C0910.3037%2C0910.5492%2C0910.3327%2C0910.5438%2C0910.4079%2C0910.5259%2C0910.2044%2C0910.0724%2C0910.4957%2C0910.3710%2C0910.0447%2C0910.4407%2C0910.3243%2C0910.2766%2C0910.4000%2C0910.4959%2C0910.1787%2C0910.2676%2C0910.3561%2C0910.4233%2C0910.2166%2C0910.0529%2C0910.0742%2C0910.5374%2C0910.0045%2C0910.1814%2C0910.3304%2C0910.3820%2C0910.2373%2C0910.0703%2C0910.1459%2C0910.5790%2C0910.2518%2C0910.4791%2C0910.3857&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Pathwidth, trees, and random embeddings"}, "summary": "We prove that, for every $k=1,2,...,$ every shortest-path metric on a graph\nof pathwidth $k$ embeds into a distribution over random trees with distortion\nat most $c$ for some $c=c(k)$. A well-known conjecture of Gupta, Newman,\nRabinovich, and Sinclair states that for every minor-closed family of graphs\n$F$, there is a constant $c(F)$ such that the multi-commodity max-flow/min-cut\ngap for every flow instance on a graph from $F$ is at most $c(F)$. The\npreceding embedding theorem is used to prove this conjecture whenever the\nfamily $F$ does not contain all trees.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0910.4951%2C0910.5621%2C0910.0542%2C0910.2286%2C0910.1358%2C0910.3338%2C0910.3307%2C0910.1409%2C0910.2904%2C0910.3953%2C0910.4367%2C0910.4467%2C0910.2191%2C0910.5102%2C0910.3282%2C0910.5152%2C0910.0767%2C0910.4128%2C0910.4232%2C0910.1953%2C0910.3757%2C0910.5486%2C0910.2025%2C0910.4228%2C0910.0494%2C0910.0633%2C0910.5940%2C0910.1585%2C0910.0893%2C0910.0484%2C0910.3008%2C0910.0963%2C0910.0822%2C0910.1556%2C0910.5053%2C0910.5323%2C0910.2779%2C0910.2741%2C0910.2972%2C0910.1422%2C0910.3653%2C0910.1216%2C0910.0978%2C0910.4728%2C0910.2055%2C0910.3053%2C0910.1790%2C0910.4546%2C0910.0092%2C0910.3251%2C0910.4164%2C0910.1824%2C0910.5706%2C0910.3366%2C0910.5702%2C0910.5147%2C0910.4389%2C0910.5123%2C0910.1543%2C0910.1945%2C0910.2440%2C0910.0038%2C0910.4598%2C0910.4835%2C0910.2475%2C0910.2774%2C0910.3037%2C0910.5492%2C0910.3327%2C0910.5438%2C0910.4079%2C0910.5259%2C0910.2044%2C0910.0724%2C0910.4957%2C0910.3710%2C0910.0447%2C0910.4407%2C0910.3243%2C0910.2766%2C0910.4000%2C0910.4959%2C0910.1787%2C0910.2676%2C0910.3561%2C0910.4233%2C0910.2166%2C0910.0529%2C0910.0742%2C0910.5374%2C0910.0045%2C0910.1814%2C0910.3304%2C0910.3820%2C0910.2373%2C0910.0703%2C0910.1459%2C0910.5790%2C0910.2518%2C0910.4791%2C0910.3857&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We prove that, for every $k=1,2,...,$ every shortest-path metric on a graph\nof pathwidth $k$ embeds into a distribution over random trees with distortion\nat most $c$ for some $c=c(k)$. A well-known conjecture of Gupta, Newman,\nRabinovich, and Sinclair states that for every minor-closed family of graphs\n$F$, there is a constant $c(F)$ such that the multi-commodity max-flow/min-cut\ngap for every flow instance on a graph from $F$ is at most $c(F)$. The\npreceding embedding theorem is used to prove this conjecture whenever the\nfamily $F$ does not contain all trees."}, "authors": ["James R. Lee", "Anastasios Sidiropoulos"], "author_detail": {"name": "Anastasios Sidiropoulos"}, "author": "Anastasios Sidiropoulos", "arxiv_comment": "21 pages", "links": [{"href": "http://arxiv.org/abs/0910.1409v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0910.1409v3", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.MG", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.MG", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cs.DS", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0910.1409v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0910.1409v3", "journal_reference": null, "doi": null, "fulltext": "Pathwidth, trees, and random embeddings\n\narXiv:0910.1409v3 [math.MG] 6 Oct 2012\n\nJames R. Lee†\n\nAnastasios Sidiropoulos‡\n\nAbstract\nWe prove that, for every integer k ≥ 1, every shortest-path metric on a graph of pathwidth\nk embeds into a distribution over random trees with distortion at most c = c(k), independent of\nthe graph size. A well-known conjecture of Gupta, Newman, Rabinovich, and Sinclair [GNRS04]\nstates that for every minor-closed family of graphs F, there is a constant c(F) such that the\nmulti-commodity max-flow/min-cut gap for every flow instance on a graph from F is at most\nc(F). The preceding embedding theorem is used to prove this conjecture whenever the family\nF does not contain all trees.\n\n1\n\nIntroduction\n\nWe view an undirected graph G = (V, E) as a topological template that supports a number of\ndifferent geometries. Such a geometry is specified by a non-negative length function len : E → [0, ∞)\non edges, which induces a shortest-path pseudometric dlen on V , with\ndlen (u, v) = length of the shortest path between u and v in G,\nwhere a pseudometric might have dlen (u, v) = 0 for some pairs u, v ∈ V with u 6= v. A pseudometric\nd is supported on G if d = dlen for some such len : E → [0, ∞). From this point of view, we are\ninterested in properties which hold simultaneously for all geometries supported on G, or even for\nall geometries supported on a family of graphs F. In what follows, we will deal exclusively with\nfinite graphs and families of finite graphs unless explicitly stated otherwise.\nIn the seminal works of Linial-London-Rabinovich [LLR95] and Aumann-Rabani [AR98], and\nlater Gupta-Newman-Rabinovich-Sinclair [GNRS04], the geometry of graphs is related to the classical study of the relationship between flows and cuts.\nMulti-commodity flows and L1 embeddings. For a metric space (X, d), we use c1 (X, d) to\ndenote the L1 distortion of (X, d), i.e. the infimum over all numbers D such that X admits an\nembedding f : X → L1 with\nd(x, y) ≤ kf (x) − f (y)k1 ≤ D * d(x, y)\nfor all x, y ∈ X. Here, we have L1 = L1 ([0, 1]), which can be replaced by the sequence space `1\nwhen X is finite.\n∗\n\nA portion of the results in this paper were announced at the 41st Annual Symposium on the Theory of Computing\n[LS09].\n†\nComputer Science & Engineering, University of Washington. Research partially supported by NSF grant CCF0644037 and a Sloan Research Fellowship. E-mail: jrl@cs.washington.edu.\n‡\nToyota Technological Institute at Chicago. E-mail: tasos@ttic.edu.\n\n1\n\n\fCorresponding to the preceding discussion, for a graph G = (V, E) we write c1 (G) = sup c1 (V, d)\nwhere d ranges over all metrics supported on G. For a family F of graphs, we write c1 (F) =\nsupG∈F c1 (G). Thus for a family F of finite graphs, c1 (F) ≤ D if and only if every geometry\nsupported on a graph in F embeds into L1 with distortion at most D.\nA multi-commodity flow instance in G is specified by a pair of non-negative mappings cap : E →\nR and dem : V × V → R. We write maxflow(G; cap, dem) for the value of the maximum concurrent\nflow in this instance, which is the maximal value ε such that a flow of value ε * dem(u, v) can be\nsimultaneously routed between every pair u, v ∈ V while not violating the given edge capacities.\nA natural upper bound on maxflow(G; cap, dem) is given by the sparsity of any cut S ⊆ V :\nP\ncap(u, v)|1S (u) − 1S (v)|\nΦ(S; cap, dem) = P uv∈E\n,\n(1)\nu,v∈V dem(u, v)|1S (u) − 1S (v)|\nwhere 1S : V → {0, 1} is the indicator function for membership in S. In the case where dem(u, v) >\n0 for exactly one pair u, v, also known as single-commodity flow [FF56], minimizing the upper bound\n(1) over all cuts S ⊆ V computes the minimum u-v cut in G, and the max-flow/min-cut theorem\nstates that this upper bound is achieved by the corresponding maximum flow.\nIn general, we write\nminS⊆V Φ(S; cap, dem)\ngap(G) = sup\n.\ncap,dem maxflow(G; cap, dem)\nfor the maximum ratio between the best upper bound given by (1) and the value of the flow, over\nall multi-commodity flow instances on G. This is the multi-commodity max-flow/min-cut gap for\nG. Now we can state the fundamental relationship between the geometry of graphs and the flows\nthey support:\nTheorem 1.1 ([LLR95, GNRS04]). For every graph G, c1 (G) = gap(G).\nIn the general Sparsest Cut problem (also known as Sparsest Cut with general demands), given\nG, cap, and dem, we want to find a cut in G of minimum sparsity. Combined with the techniques\nof [LR99, LLR95], Theorem 1.1 implies that there exists a c1 (G)-approximation for the general\nSparsest Cut problem on a graph G. Motivated by this connection, Gupta, Newman, Rabinovich,\nand Sinclair sought to characterize the graph families F such that c1 (F) < ∞, and they posed the\nfollowing conjecture. We will say that a family of graphs F forbids some minor if there exists a\ngraph G that is not a minor of any graph in F.\nConjecture 1 ([GNRS04]). For every family of finite graphs F, one has c1 (F) < ∞ if and only if\nF forbids some minor.\nWe refer to Section 1.3 for a review of graph minors. Progress on the preceding conjecture has\nbeen limited. Classical work of Okamura and Seymour [OS81] implies that c1 (Outerplanar) = 1,\nwhere Outerplanar denotes the class of outerplanar graphs (planar graphs where all vertices lie on a\nsingle face). Gupta, Newman, Rabinovich, and Sinclair [GNRS04] proved that c1 (Treewidth(2)) =\nO(1), where Treewidth(k) denotes the family of all graphs of treewidth at most k (see, e.g. [Die05]\nfor a discussion of treewidth, or Section 1.3 for the relevant definitions). This was improved to\nc1 (Treewidth(2)) = 2 in [LR10, CJLV08]. Finally, in [CGN+ 06], it is shown that c1 (Outerplanar(k)) <\n2O(k) for all k ∈ N, where Outerplanar(k) denotes the class of k-outerplanar graphs. We remark that\na strengthening of Conjecture 1, regarding integer multi-commodity flows, has been investigated\nby Chekuri, Shepherd, and Weibel [CSW10]. The present paper is devoted to proving the following\nspecial case of Conjecture 1.\n2\n\n\fTheorem 1.2. Every minor-closed family of finite graphs F which does not contain every possible tree satisfies c1 (F) < ∞. Equivalently, the multi-commodity max-flow/min-cut gap for F is\nuniformly bounded, i.e. gap(F) < ∞, whenever F has bounded pathwidth.\nWe remark that Theorem 1.2 implies a polynomial-time O(1)-approximation algorithm for the\ngeneral Sparsest Cut problem on graphs of bounded pathwidth. Recently, an O(1)-approximation\nalgorithm for graphs of bounded treewidth has been obtained by Chlamtac, Krauthgamer, and\nRaghavendra [CKR10]. We also note that [CKR10] uses a different approach, and does not establish an analogous bound on the multi-commodity max-flow/min-cut gap for graphs of bounded\ntreewidth (which remains an important open problem).\n\n1.1\n\nSimplifying the topology with random embeddings\n\nA basic question is whether one can embed a graph metric G into a graph metric H with a simpler\ntopology (for example, perhaps G is planar and H is a tree), where the embedding is required to\nhave small distortion, i.e. such that every pairwise distance changes by only a bounded amount.\nThe viability of this approach as a general method was ruled out by Rabinovich and Raz [RR98].\nFor instance, Ω(n) distortion is required to embed an n-cycle into a tree. In general (see [CG04]),\nif all metrics supported on a subdivision of some graph G can be embedded with distortion O(1)\ninto metrics supported on a family F, then G is a minor of some graph in F, implying that we\nhave not obtained a reduction in topological complexity.\nOn the other hand, a classical example attributed to Karp [Kar89] shows that random reductions\nmight still be effective: If one removes a uniformly random edge from the n-cycle, this gives an\nembedding into a random tree which has distortion at most 2 \"in expectation.\" More formally, if\n(X, d) is any finite metric space, and Y is a family of finite metric spaces, we say that (X, d) admits\na stochastic D-embedding into Y if there exists a randomly chosen metric space (Y, dY ) ∈ Y and a\nrandomly chosen mapping F : X → Y such that the following two properties hold.\nNon-contracting. With probability one, for every x, y ∈ X, we have dY (F (x), F (y)) ≥ d(x, y).\nLow-expansion. For every x, y ∈ X,\nh\ni\nE dY (F (x), F (y)) ≤ D * d(x, y).\nFor two graph families F and G, we write F\nG if there exists a D < ∞ such that every metric\nsupported on F admits a stochastic D-embedding into the family of metrics supported on G. We\nD\nwill write F\nG if we wish to emphasize the particular constant. Finally, we write F 6 G if no\nsuch D exists. The relationship with Conjecture 1 is given by the following simple lemma (see, e.g.\n[GNRS04]).\nLemma 1.3. If F\n\nD\n\nG, then c1 (F) ≤ D * c1 (G).\n\nAt first glance,\nseems like a powerful operation; indeed, in [GNRS04] it is proved that\nOuterPlanar\nTrees, where OuterPlanar and Trees are the families of outerplanar graphs and\nconnected, acylic graphs, respectively. In general, if L is a finite list of graphs, we will write EL\nfor the family of all graphs which do not have a member of L as a minor. The preceding result\ncan be restated as E{K2,3 }\nE{K3 }, where Kn and Km,n denote the complete and complete\n3\n\n\fbipartite graphs, respectively. Unfortunately, [GNRS04] also showed that this cannot be pushed\nmuch further: E{K4 } 6 E{K3 }. Restated, this means that even graphs of treewidth 2 cannot be\nstochastically embedded into trees.\nThese lower bounds were extended in [CG04] to show that Treewidth(k + 3) 6 Treewidth(k)\nfor any k ≥ 1. Finally, in [CJLV08], these results are extended to any family with a weak closure\nproperty, which we describe next.\nSums of graphs. We now introduce a graph operation which will be useful in stating our results.\nSuppose that H and G are two graphs and CH , CG are k-cliques in H and G respectively, for some\nk ≥ 1. One defines the k-sum of H and G as the graph H⊕k G which results from taking the\ndisjoint union of H and G and then identifying the two cliques CH and CG , and possibly removing\na subset of the clique edges. We remark that the notation is somewhat ambiguous, as both the\ncliques and their identifications are implicit. For a family of graphs F, we write ⊕k F for the closure\nof F under i-sums for every i = 1, 2, . . . , k. With this notation in hand, we can state the following\ntheorem.\nTheorem 1.4 ([CJLV08]). If F and G are families of graphs and G is minor-closed, then ⊕2 F\nimplies F ⊆ G.\n\nG\n\nIn fact, one case of this theorem relies on Theorem 1.7 proved in the present paper, which states\nthat for every k = 1, 2, . . . , we have Trees ∩ Pathwidth(k + 1) 6 Pathwidth(k), where Pathwidth(k)\ndenotes the class of pathwidth-k graphs (see Section 1.3 for the relevant definitions).\nTheorem 1.4 implies, for example, that Planar ∩ Treewidth(k + 1) 6 Treewidth(k) for any k ≥ 1,\nwhere Planar is the family of planar graphs, since planar graphs and bounded treewidth graphs\nare both closed under 2-sums. The assumptions of the preceding theorem imply that even random\nembeddings are not particularly useful for reducing the topology when ⊕2 F = F. However, some\nrecent reductions suggest that when ⊕2 F 6= F, the situation is more hopeful.\nIn [CGN+ 06], it is proved that Outerplanar(k)\nTrees. Perhaps more surprisingly, it is shown\nin [IS07] that Genus(g)\nPlanar, where Genus(g) is the family of graphs embedded on an orientable\nsurface of genus g, and Genus(0) = Planar. Note that while trees and planar graphs are closed under\n2-sums, neither Outerplanar(k) nor Genus(g) are for k ≥ 1 and g ≥ 1.\nIt should be noted that an extensive amount of work has been done on embedding finite metric\nspaces into distributions over trees, where the distortion is allowed to depend on n, the number\nof points in the metric space; see, e.g. [Bar96, Bar98, FRT04]. These results are not particularly\nuseful for us since we desire bounds that are independent of n.\n\n1.2\n\nResults and techniques\n\nWe now discuss the main results of the paper, along with the techniques that go into proving them.\nIn [GNRS04], it is proved that c1 (Treewidth(2)) < ∞, and later works [LR10, CJLV08] nailed\ndown the precise dependence c1 (Treewidth(2)) = 2. Resolving whether c1 (Treewidth(3)) is finite\nseems quite difficult, and is a well-known open problem. In fact, perhaps the simplest \"width\n3\" problem (which was open until the present work) involves the family Pathwidth(3) (recall that\nPathwidth(k) ⊆ Treewidth(k) denotes the family of graphs of pathwidth at most k; see Section 1.3).\nThese families are fundamental in the graph minor theory (see e.g. [RS83, Lov06]); see Lemma 1.9\nfor an inductive definition.\n\n4\n\n\fOur main technical theorem shows that graphs of bounded pathwidth can be randomly embedded into trees. In fact, the theorem shows something slightly stronger, that the target trees\nthemselves can be taken to have bounded pathwidth.\nTheorem 1.5. For every k ∈ N, Pathwidth(k)\nPathwidth(k)\nfor some D ≤ (4k)k\n\n3 +1\n\nD\n\nTrees ∩ Pathwidth(k). Quantitatively,\n\nTrees ∩ Pathwidth(k) ,\n\n.\n\nIn particular, this verifies Conjecture 1 for graphs of bounded pathwidth. The quantitative\nbound of Theorem 1.5 is likely far from tight. Naively, one might hope that for D ≤ O(log k),\nD\n\none has Pathwidth(k)\nTrees. But, in fact, known results imply that the distortion must satisfy\nD ≥ Ω(k). The k-th level diamond graph (see [GNRS04]) has pathwidth O(k) but it is shown\nin [GNRS04] that every stochastic embedding of this graph into a distribution over trees incurs\ndistortion Ω(k).\nRobertson and Seymour [RS83] showed that a minor-closed family F excludes a forest if and\nonly if F ⊆ Pathwidth(k) for some k ∈ N.\nCorollary 1.6. If T is any tree, then E{T }\n\nTrees.\n\nAs a consequence of this, together with Lemma 1.3, and the elementary fact that c1 (Trees) = 1,\nwe resolve Conjecture 1 whenever F forbids some tree, yielding Theorem 1.2. We remark that\nTheorem 1.2 was unknown even for F = Pathwidth(3).\nIn Section 4, we complement our upper bound by proving the following theorem.\nTheorem 1.7. For every k ∈ N, Pathwidth(k + 1) ∩ Trees 6\n\nPathwidth(k).\n\nThis result serves two purposes. First, it shows that our proof of Theorem 1.5, which embeds\nPathwidth(k) directly into trees cannot proceed by inductively reducing the pathwidth by one.\nSecondly, it is needed in the proof of Theorem 1.4 in the case when F contains only trees (the\ntechniques of [CJLV08] handle the case when F contains at least one cycle). We remark that,\nperhaps surprisingly, the proof our non-embeddability result (Theorem 1.7) uses our embedding\nresult (Theorem 1.5).\n\n1.3\n\nPreliminaries\n\nWe now review some basic definitions and notions which appear throughout the paper.\nGraphs and metrics. We deal exclusively with finite graphs G = (V, E) which are free of loops\nand parallel edges. We will also write V (G) and E(G) for the vertex and edge sets of G, respectively.\nA metric graph is a graph G equipped with a non-negative length function on edges len : E → R+ .\nWe will denote the pseudometric space associated with a graph G as (V, dG ), where dG is the\nshortest path metric according to the edge lengths. Note that dG (x, y) = 0 may occur even when\nx 6= y, and also if G is disconnected, there will be pairs x, y ∈ V with dG (x, y) = ∞. We allow both\npossibilities throughout the paper. An important point is that all length functions in the paper are\nassumed to be reduced, i.e. they satisfy the property that for every e = (u, v) ∈ E, len(e) = dG (u, v).\nP Given a metric graph G, we extend the length function to paths P ⊆ E by setting len(P ) =\ne∈P len(e). For a pair of vertices a, b ∈ P , we use the notation P [a, b] to denote the sub-path\n5\n\n\fof P from a to b. We recall that for a subset S ⊆ V , G[S] represents the induced graph on S.\nFor a pair of subsets S, T ⊆ V , we use the notations E(S, T ) = {(u, v) ∈ E : u ∈ S, v ∈ T } and\nE(S) = E(S, S). For a vertex u ∈ V , we write N (u) = {v ∈ V : (u, v) ∈ E}.\nGraph minors. If H and G are two graphs, one says that H is a minor of G if H can be obtained\nfrom G by a sequence of zero or more of the three operations: edge deletion, vertex deletion, and\nedge contraction. G is said to be H-minor-free if H is not a minor of G. We refer to [Lov06, Die05]\nfor a more extensive discussion of the vast graph minor theory.\nEquivalently, H is a minor of G if there exists a collection of disjoint sets {Av }v∈V (H) with\nAv ⊆ V (G) for each v ∈ V (H), such that each Av is connected in G, and there is an edge between\nAu and Av whenever (u, v) ∈ E(H). A metric space (X, d) is said to be H-minor-free if it is\nsupported on some H-minor-free graph.\nTreewidth. The notion of treewidth involves a representation of a graph as a tree, called a tree\ndecomposition. More precisely, a tree decomposition of a graph G = (V, E) is a pair (T,Sχ) in which\nT = (I, F ) is a tree and χ = {χi | i ∈ I} is a family of subsets of V (G) such that (1) i∈I χi = V ;\n(2) for each edge e = {u, v} ∈ E, there exists an i ∈ I such that both u and v belong to χi ; and\n(3) for all v ∈ V , the set of nodes {i ∈ I | v ∈ χi } forms a connected subtree of T . To distinguish\nbetween vertices of the original graph G and vertices of T in the tree decomposition, we call vertices\nof T nodes and their corresponding χi 's bags. The maximum size of a bag in χ minus one is called\nthe width of the tree decomposition. The treewidth of a graph G is the minimum width over all\npossible tree decompositions of G.\nPathwidth. A tree decomposition is called a path decomposition if T = (I, F ) is a path. The\npathwidth of a graph G is the minimum width over all possible path decompositions of G. We will\nuse the following alternate characterization.\nDefinition 1.8 (Linear composition sequence). Let k be a positive integer. A sequence of pairs\n(G0 , V0 ), (G1 , V1 ), . . . , (Gt , Vt ) is a linear width-k composition sequence for G if Gt = G, G0 is a kclique with vertex set V0 , and (Gi+1 , Vi+1 ) arises from (Gi , Vi ) as follows: Attach a new vertex vi+1\nto all the vertices of Vi and choose Vi+1 ⊆ Vi ∪ {vi+1 } so that |Vi+1 | = k. Observe that it is possible\nto have Vi+1 = Vi . We further note that for any j ∈ {1, . . . , t}, we have V (Gj ) = V0 ∪ {v1 , . . . , vj }.\nThe following lemma is straightforward to prove.\nLemma 1.9. A graph has pathwidth-k if and only if it is a subgraph of some graph possessing a\nlinear width-k composition sequence.\nProof sketch. A path decomposition of width k can be obtained from a width-k composition sequence (G0 , V0 ), . . . , (Gt , Vt ) by setting for every i ∈ {1, . . . , t}, the i-th bag to be Vi−1 ∪ {vi }. For\nthe other direction, one can always assume that a pathwidth-k graph admits a path depomposition\nof width k such that every bag has size exactly k + 1, and every two bags differ in exactly one\nvertex. This immediately yields a linear width-k composition sequence.\nAsymptotic notation. For two expressions E and F , we sometimes use the notation E . F to\ndenote E = O(F ). We use E ≈ F to denote the conjunction of E . F and E & F .\n\n6\n\n\f2\n\nWarm-up: Embedding pathwidth-2 graphs into trees\n\nIn this section, we prove that Pathwidth(2)\nTrees, as a warmup for the general case in Section\n3. The pathwidth-2 case does not possess many of the difficulties of the general case; in particular,\nit does not require us to bound the stretch in multiple phases (for which we introduce a rank\nparameter in the next section). But it does show the importance of using an inflation factor to\nblowup small edges, in order for a certain geometric sum to converge.\nLet G = (V, E) be a metric graph of pathwidth 2. By Lemma 1.9, it suffices to give a probabilistic embedding for a graph G possessing a linear width-2 composition sequence (G0 , e0 ), . . . , (Gt , et ),\nwhere ei plays the role of Vi in Definition 1.8. We will inductively embed G into a distribution over\nits spanning trees. First, we put T0 = e0 . Now, let Ti be a spanning tree of Gi , with ei ∈ E(Ti ). We\nwill produce a random spanning tree Ti+1 of Gi+1 with ei+1 ∈ E(Ti+1 ) as follows. Let ei = {u, v},\nand let w∗ be the newly attached vertex. We also add the edges {u, w∗ }, and {v, w∗ }, so the\nresulting graph is not a tree. We obtain a tree by randomly deleting either {u, w∗ }, or {v, w∗ } as\nfollows. Let τ = 12; we refer to this constant as an \"inflation factor.\"\nThere are two cases.\n1. If ei = ei+1 , we delete {u, w∗ } with probability\n{w∗ , v}.\n\nlen(u,w∗ )\nlen(u,w∗ )+len(v,w∗ ) ,\n\nand otherwise we delete\n\n2. If ei 6= ei+1 , assume (without loss of generality) that ei+1 = {v, w∗ }. In that case, we delete\n{u, w∗ } with probability\n\u001a\n\u001b\nτ len(u, w∗ )\nmin\n,1 ,\n(2)\nlen(u, w∗ ) + len(u, v)\nand otherwise we delete {u, v}.\nIt is easy to see that if Ti was a spanning tree, then so is Ti+1 . Furthermore, by construction\nei+1 ∈ E(Ti+1 ). Let T = Tt be the final tree, and set Ti = T for i > t. It remains to bound the\nexpected stretch in T .\nFor every edge {x, y} ∈ E(Gi ) and i ≥ 0, define the value,\n\u001a \u0014\n\u0015\n\u001b\ndT (x, y)\nKix,y = max E\nTi = Γ : P(Ti = Γ) > 0 .\ndTi (x, y)\nThis is the maximum expected stretch between x and y incurred over all stages later than i,\nconditioned on the worst possible configuration for Ti .\nFor each x ∈ V , define s(x) = −1 for x ∈ V (G0 ), and otherwise it is the unique value s ≥ 0\nsuch that x ∈ V (Gs+1 ) \\ V (Gs ). Also define s(x, y) = max(s(x), s(y)). The next two lemmas form\nthe core of our analysis.\nLemma 2.1. If {x, y} ∈ E and s(x, y) = i, then\nx,y\nE [dT (x, y)] ≤ 3τ * Ki+1\n* len(x, y) .\n\n(3)\n\nProof. If x, y ∈ V (G0 ), then s(x, y) = −1 and E[dT (x, y)] = K0x,y *len(x, y) by definition. Otherwise,\nassume without loss of generality that s(x) < s(y). In this case, it must be that x ∈ ei = {u, v}\nand y = w∗ . Suppose that x = u.\n7\n\n\fIf ei+1 = ei , an elementary calculation based on case (1) of our algorithm yields,\n\u0015\n\u0014\ndTi+1 (u, w∗ )\n3 len(v, w∗ ) + len(u, w∗ )\n≤\nE\nT\n≤ 3,\ni\nlen(u, w∗ )\nlen(v, w∗ ) + len(u, w∗ )\n∗\n\nu,w\nfrom which E[dT (u, w∗ )] ≤ 3 Ki+1\n* len(u, w∗ ) immediately follows.\nSimilarly, if ei+1 = {v, w∗ }, then the expected stretch is inflated by at most a factor of τ , and\ntherefore (3) again follows by a similar calculation. Finally, if ei+1 = {u, w∗ }, then {u, w∗ } ∈\nu,w∗\nE(Ti+1 ), and therefore E[dT (u, w∗ )] ≤ Ki+1\n* len(u, w∗ ).\na,b\nLemma 2.2. For any {x, y} ∈ E(Gi ), we have Kix,y ≤ max{3, Ki+1\n} for some {a, b} ∈ E(Gi ).\n\nProof. Let Γ be a tree on V (Gi ) which is a maximizer for Kix,y . Let Γu and Γv be the subtrees of\nΓ \\ ei rooted at u and v respectively, where we recall that ei = {u, v}. If x and y are both either\nin Γu , or in Γv , then Kix,y = 1, since Γu and Γv remain intact in the final tree T , conditioned on\nTi = Γ.\nSo, it suffices to consider the case x ∈ Γu and y ∈ Γv . Observe further that since the unique\npath between x and y in Γ passes through {u, v}, and the x-u and y-v paths will both remain in\nT , we have\n\u0014\n\u0015\n\u0014\n\u0015\ndT (x, y)\ndT (u, v)\nTi = Γ ≤ E\nTi = Γ ≤ Kiu,v .\nE\ndTi (x, y)\ndTi (u, v)\nu,v\nThus to prove the lemma, it suffices to show that Kiu,v ≤ max{3, Ki+1\n}. To this end, let Γ be\nu,v\nthe maximizer for Ki , and suppose that Ti = Γ. If ei+1 = ei , then the edge {u, v} remains intact\nu,v\n(i.e. {u, v} ∈ E(Ti+1 )), and therefore Kiu,v ≤ Ki+1\n. Assume now that ei+1 6= ei , which means that\nwe are in case (2) of the algorithm. Assume further, without loss of generality, that ei+1 = {v, w∗ }.\nRecall that either {u, v} or {u, w∗ } is deleted.\nτA\nLet A = len(u, w∗ ), B = len(u, v), C = len(v, w∗ ). With probability p = min{1, A+B\n}, the edge\n∗\n{u, w } is deleted, in which case dT (u, v) = dTi (u, v). With probability 1 − p, the edge {u, v} is\ndeleted, and the new path between u and v in Ti+1 is u-w∗ -v, so the distance between u and v is\nu,v\nstretched to A + C ≤ 2A + B, and is eligible to be stretched by at most a factor Ki+1\nin the future.\nu,v\nThus, if A ≥ B/(τ − 1), we have Ki = 1. We can therefore assume A < B/(τ − 1). Thus we\ncan bound,\n\u0012\n\u0013\nτA\nτA\n2A + B\nu,v\nu,v\nKi\n≤\n+ Ki+1 1 −\nA+B\nA+B\nB\n\u0012\n\u0013\u0012\n\u0013\nA\nτA\nA\nu,v\n≤ τ + Ki+1\n1−\n1+2\nB\n2B\nB\n\u0012\n\u0013\nA\nτA\nu,v\n≤ τ + Ki+1\n1−\n,\nB\n3B\n\nwhere we have used 1 −\n\nτA\n2B\n\nA\n+ 2B\n≤1−\n\nKiu,v\n\nτA\n3B\n\nsince τ = 12. But now one sees that,\n\u0012\n\u0013\nτA\nτA\nu,v\nu,v\n≤3\n+ Ki+1 1 −\n≤ max{3, Ki+1\n}.\n3B\n3B\n\n8\n\n\fFigure 1: The graph Hi with k = 5.\n\nFinally, the next lemma completes our analysis.\nLemma 2.3. For any x, y ∈ V , we have E[dT (x, y)] ≤ 9τ * dG (x, y).\nProof. By the triangle inequality and linearity of expectation, it suffices to prove the lemma for\nedges {x, y} ∈ E. We will prove the following by reverse induction on i: For every {x, y} ∈ E and\ni ≥ s(x, y) + 1, we have Kix,y ≤ 3. Combining this with Lemma 2.1 will complete the proof.\nThe claim is trivial for i = t since Ktx,y = 1 for all {x, y} ∈ E. If t > i ≥ s(x, y) + 1, then\na,b\n{x, y} ∈ E(Gi ), and Lemma 2.2 immediately implies that Kix,y ≤ max{3, Ki+1\n} for some a, b with\na,b\nx,y\ni + 1 ≥ s(a, b) + 1. By induction, Ki+1 ≤ 3, hence Ki ≤ 3 as well.\n\n3\n\nEmbedding pathwidth-k graphs into trees\n\nWe now turn to graphs of pathwidth k for some k ∈ N. Let G be such a graph. By Lemma 1.9, we\nmay assume that G has a linear width-k composition sequence, (G0 , V0 ), . . . (Gt , Vt ). For i ≥ 1, we\ndefine Vbi = Vi−1 ∪ {vi }. Our algorithm for embedding G into a random tree proceeds inductively\nalong the composition sequence. For each i ∈ {1, . . . , t} we compute a subgraph Hi of Gi , whose\nonly non-trivial 2-connected component is a (k + 1)-clique on Vbi (see Figure 1). More specifically,\nH1 is just a clique on V̂1 . Given Hi , we derive Hi+1 by adding all the edges between vi+1 and Vi ,\nand removing all the edges, except for one, between Vi and the unique vertex in Vbi \\ Vi .\nThe main part of the algorithm involves determining which edge in (Vbi \\ Vi ) × Vi we keep in\nHi+1 . The high-level idea behind our approach is as follows. On one hand, we want to keep short\nedges so that the distance between Vbi \\ Vi and Vi is small. On the other hand, keeping always\nthe shortest edge leads to accumulation of the stretch for certain pairs (whose shortest-path keeps\ngetting longer, through a sequence of \"short\" edges). We avoid this obstacle via a randomized\nprocess that assigns a rank to each edge, which intuitively means that edges of lower rank are more\nlikely to be deleted. More specifically, at each step i, we pick a random threshold L and keep the\nhighest ranked edge of length at most L, deleting the rest. We also update the ranks of the edges\nin the new graph appropriately.\nFormally, let ranki : V (G)×V (G) → Z≥0 be an arbitrary symmetric function, with rank1 (u, v) =\nb\u0001\n0, for each u, v ∈ V (G). Let E(Vbi ) = V2i , i.e. the set of edges internal to Vbi . For u, v ∈ V (Hi ), let\nPiu,v be the unique path between u and v in Hi that contains at most one edge in E(Vbi ). Observe\nthat P u,v is well-defined since Vbi forms a clique. For an edge e ∈ E(Vbi ) we set\ni\n\nedge-ranki (e) =\n\nmax\n\nu,v∈V (Hi ):e∈Piu,v\n\n9\n\nranki (u, v)\n\n\fFigure 2: Transitioning from Hi to Hi+1 . Here, w is the unique vertex in Vbi \\ Vi .\n\nThe randomized process for generating Hi+1 and ranki+1 from Hi and ranki is as follows. Let\nτ = 4k be our new \"inflation factor.\"\nLet w be the unique vertex in Vbi \\ Vi , and enumerate E(w, Vi ) = {e1 , e2 , . . . , ek } so that\nlen(e1 ) ≤ len(e2 ) ≤ * * * ≤ len(ek ).\nNow, let {σj }k−1\nj=1 be a family of independent {0, 1} random variables with\n\u001a\n\nlen(ej )\nP[σj = 1] = min 1, τ\nlen(ej+1 )\nand define the set of eligible edges by\n(\nE=\n\nej :\n\nj−1\nY\n\n\u001b\n,\n\n)\nσi = 1\n\n.\n\ni=1\n\nIn particular, e1 ∈ E always. Let e∗ ∈ E be any edge satisfying edge-ranki (e∗ ) =\nmaxe∈E edge-ranki (e).\nFinally, we define Hi+1 as the graph with vertex set V (Gi+1 ) and edge set (see Figure\n2),\nE(Hi+1 ) = {e∗ } ∪ {{vi+1 , u} : u ∈ Vi } ∪ (E(Hi ) \\ E(w, Vi )) .\nWe also define ranki+1 as follows. For any u, v ∈ V (G)\n(\nranki (u, v)\nif E(Piu,v ) ∩ E = ∅\nranki+1 (u, v) =\nranki (u, v) + 1 otherwise .\nIntuitively, ranki (u, v) counts how many times the path between u and v was under risk to be\nsignificantly stretched until step i. If Piu,v does not use an edge of E then the edge {u, v} will be\nstretched, but the alternative path will, on average, be \"short enough\" that we need not increase\nits rank (this is how the set E is defined). It remains to analyze the expected stretch incurred by\nthe above process. First, we observe that the maximum rank of an edge is O(k 2 ).\n\u0001\nLemma 3.1. For every i = 1, 2, . . . , t and every edge e ∈ E(Vbi ), edge-ranki (e) ≤ k+1\n2 .\n\n10\n\n\f\u0001\nProof. For each i = 1, 2, . . . , t, and each j = 1, 2, . . . , k+1\n2 , let Ri,j be the j-th largest edge-rank\nof the edges in E(Vbi ). That is, for each i = 1, 2, . . . , t, Ri,1 ≤ Ri,2 ≤ . . . ≤ Ri,(k+1) .\n2\n\u0001\nWe will prove by induction on i that for each i = 1, 2, . . . , t, for each 1 ≤ j ≤ k+1\n2 , we have\nRi,j ≤ j. For i = 1, all the ranks are equal to 0, and the assertion holds trivially.\nAssume now that the assertion holds for i − 1. It is convenient to analyze the transition from\nstep i − 1 to step i in three phases. We need to remove the edges in E(w, Vi ) \\ {e∗ } and add the\nedges in E(vi+1 , Vi ), while updating the ranks accordingly. For notational simplicity, we assume\nthat the rank of an edge that is removed is set to zero. Let e∗ be the maximum-rank edge in E. In\nthe first phase, we set the rank of e∗ to zero, and we increase the rank of all remaining edges in E\nby one. Clearly, the resulting edge ranks satisfy the inductive invariant.\nIn the second phase, for any edge e ∈ E(w, Vi ) \\ {e∗ }, we update the rank of an edge e0 = e0 (e) ∈\nE(Vbi ) ∩ E(Vbi+1 ) to be edge-rank(e0 ) = max{edge-rank(e0 ), edge-rank(e)}, and we set the rank of e\nto zero. The point here is that for any e ∈ E(w, Vi ), there is a unique edge e0 ∈ E(Vbi ) ∩ E(Vbi+1 )\nu,v\nsuch that, for any u, v ∈ V (Hi ), if e ∈ Piu,v then e0 ∈ Pi+1\n. In other words, the paths that use e\n0\nwill have to be rerouted through a new path that uses e . This explains how the edge-rank of e is\n\"transferred\" to e0 .\nClearly, after the second phase the ranks still satisfy the inductive invariant. Finally, in the\nthird phase we remove the edges in E(w, Vi ), and we add the edges in E(vi+1 , Vi ). All the removed\nedges have at this point rank zero, and all new edges also have rank zero. Thus, the inductive\ninvariant is satisfied.\n\u0001\nFor any i ∈ {1, . . . , t}, r ∈ {0, . . . , k+1\n2 }, and any edge {u, v} ∈ E(Gi ), we put\n\u001a \u0014\n\u0015\n\u001b\ndHt (u, v)\nKiu,v (r) = max E\nHi = Γ, ranki (u, v) = ρ : (Γ, ρ) ∈ Ωi (u, v; r) ,\ndHi (u, v)\n\n(4)\n\nwhere we define\nΩi (u, v; r) = {(Γ, ρ) : P(Hi = Γ, ranki (u, v) = ρ) > 0 and ρ ≥ r} .\nIn other words, Kiu,v (r) is the maximum expected stretch for all stages after i, conditioned on the\nworst possible configuration\nover\n\u0010\n\u0011 subgraphs Hi and rank functions satisfying ranki (u, v) ≥ r. We\n\u0001\nu,v\nk+1\nfurther define Ki\n+ 1 = 1.\n2\nFor the next three lemmas\nand\n\u0001 and the corollary that follows, we fix an edge {u, v} ∈ E(Gi ),\nk+1\n∗\na number r ∈ {0, . . . , 2 }. Let (Γ, ρ) ∈ Ωi (u, v; r) be a maximizer in (4), and write P [*] =\nP[* | Hi = Γ, ranki = ρ] and E∗ [*] = E[* | Hi = Γ, ranki = ρ]. A major point is that the following\ncalculations are oblivious to the conditioning, aside from the assumption that ranki (u, v) ≥ r.\nLemma 3.2. Suppose that ej ∈ E(Piu,v ) for some j ∈ {1, 2, . . . , k}. Then,\n\u0012\n\u0013\nE∗ [len(e∗ ) | ej ∈ E]\nu,v\nu,v\n∗\nKi (r) ≤ P [ej ∈ E] 1 + 2\nKi+1\n(r + 1)\nlen(ej )\n\u0012\n\u0013\nE∗ [len(e∗ ) | ej ∈\n/ E]\nu,v\n+ P∗ [ej ∈\n/ E] 1 + 2\nKi+1\n(r)\nlen(ej )\n\n11\n\n\fdH\n\n(u,v)\n\n2len(e∗ )+len(e )\n\nj\nProof. We have, dHi+1(u,v) ≤\n. There are two possibilities: (1) ej ∈ E occurs, and the\nlen(ej )\ni\nrank of {u, v} is increased by 1, (2) ej ∈\n/ E and the rank of {u, v} remains the same. This verifies\n\u0001\nk+1\nthe claimed inequality for r < 2 .\n\u0001\n\u0001\nk+1\nNote that, by Lemma 3.1, ranki (u, v) ≤ k+1\n2 . Thus the lemma holds true even for r =\n2 , in\nwhich case ej ∈ E =⇒ ej = e∗ (since the rank of the pair u, v cannot increase anymore).\nIf this\u0011hap\u0010\n\u0001\nu,v\nk+1\npens, then dHt (u, v) = dHi (u, v), again verifying the claimed inequality, since Ki+1\n+1 =1\n2\nby definition.\n\u0010\n\u0011\nE∗ [len(e∗ ) | ej ∈E]\n1)\nLemma 3.3. For any j ∈ [k], P∗ [ej ∈ E] 1 + 2\n≤ 3(4k)k−1 len(e\nlen(ej )\nlen(ej ) .\n\nProof. We have\nP∗ [ej ∈ E] E∗ [len(e∗ ) | ej ∈ E] ≤ E∗ [len(e∗ )]\n=\n\n≤\n\n≤\n\nk\nX\nh=1\nk\nX\nh=1\nk\nX\nh=1\n\nlen(eh )P∗ [e∗ = eh ]\nlen(eh )P∗ [eh ∈ E]\n\nlen(eh )\n\nlen(e1 ) h−1\nτ\nlen(eh )\n\n≤ 2 len(e1 )τ k−1 .\n1)\nk−1 len(e1 ) . Combining these estimates yields the claim,\nAlso, we have P∗ [ej ∈ E] ≤ τ j−1 len(e\nlen(ej ) ≤ τ\nlen(ej )\nrecalling that τ = 4k.\n\u0011\n\u0010\nE∗ [len(e∗ ) | ej ∈E]\n/\n1)\n≤ 1 − len(e\nLemma 3.4. For any j ∈ [k], P∗ [ej ∈\n/ E] 1 + 2\nlen(ej )\nlen(ej ) .\n\nProof. Let\nI = {h ∈ {1, 2, . . . , j − 1} : len(eh+1 ) > τ * len(eh )} .\nObserve that if h ∈ {1, 2, . . . , j − 1} \\ I, then whenever eh ∈ E, we have also eh+1 ∈ E. For each\n\n12\n\n\fh ∈ I, let kh = |I ∩ {1, 2, . . . , h}|.\nE∗ [len(e∗ ) | ej ∈\n/ E]\nP [ej ∈\n/ E] 1 + 2\nlen(ej )\n∗\n\n\u0012\n\n\u0013\n≤\n=\n≤\n≤\n=\n\nj−1\nX\n\n\u0012\n\u0013\n2len(eh )\nP [eh ∈ E and eh+1 ∈\n/ E] 1 +\nlen(ej )\nh=1\n\u0012\n\u0013\nX\n2len(eh )\n∗\nP [eh ∈ E and eh+1 ∈\n/ E] 1 +\nlen(ej )\nh∈I\n\u0012\n\u0013\n\u0012\n\u0013\nX\nlen(eh )\n2len(eh )\nkh −1 len(e1 )\n1−τ\n1+\nτ\nlen(eh )\nlen(eh+1 )\nlen(ej )\nh∈I\n\u0012\n\u0013\nX\nlen(eh )\n2len(eh )\nkh −1 len(e1 )\nτ\n1−τ\n+\nlen(eh )\nlen(eh+1 )\nlen(ej )\nh∈I\n\u0012\n\u0013\nX\nlen(eh )\nlen(e1 ) X kh −1\nlen(e1 )\n1−τ\n+\nτ kh −1\n2τ\nlen(eh )\nlen(eh+1 )\nlen(ej )\n∗\n\nh∈I\n\nh∈I\n\nlen(e1 ) len(e1 )\n≤ 1 − τ |I|\n+\n(2kτ |I|−1 )\nlen(ej ) len(ej )\n\u0011\nlen(e1 ) \u0010\n= 1+\n2kτ |I|−1 − τ |I|\nlen(ej )\nlen(e1 )\n≤ 1−\n.\nlen(ej )\n\n\u0001\nCorollary 3.5. For every {u, v} ∈ E(Gi ) and r ∈ {0, . . . , k+1\n2 }, we have\nn\no\nu,v\nu,v\nKiu,v (r) ≤ max 3(4k)k−1 Ki+1\n(r + 1), Ki+1\n(r) .\nProof. Suppose that Hi = Γ and ranki = ρ. If E(Piu,v ) ∩ E(V̂i ) is empty, then Kiu,v (r) = 1 because\nthe current u-v path in Hi will be preserved in Ht . Otherwise, we have E(Piu,v ) ∩ E(V̂i ) = {ej } for\nsome j ∈ [k]. Apply Lemmas 3.2, 3.3, and 3.4 to conclude that\n\u0012\n\u0013\nlen(e1 )\nlen(e1 )\nu,v\nu,v\nk−1 u,v\nKi (r) ≤\n3(4k) Ki+1 (r + 1) + 1 −\nKi+1\n(r)\nlen(ej )\nlen(ej )\nn\no\nu,v\nu,v\n≤ max 3(4k)k−1 Ki+1\n(r + 1), Ki+1\n(r) ,\ncompleting the proof.\nWe can now state and prove our main theorem.\nTheorem 3.6. For every k ≥ 1, every metric graph of pathwidth k admits a stochastic D-embedding\n3\ninto a distribution over trees with D ≤ (4k)k .\nProof. We may assume that k ≥ 2 as the statement is trivial for k = 1. Let Ht be the random\nsubgraph of G. Fix {u, v} ∈ E(G), and suppose that i0 is the smallest number for which u, v ∈\nV (Gi0 ). In this case, since {u, v} is an edge, we have dGi0 (u, v) = dG (u, v), thus\nE [dHt (u, v)] ≤ Kiu,v\n(0) * len(u, v) .\n0\n13\n\n\fNow applying Corollary 3.5 inductively immediately yields the bound,\n\u0010\n\u0011(k+1)+1\n2\nk−1\nKiu,v\n(0)\n≤\n3(4k)\n,\n0\n\u0010\n\u0011\n\u0001\nrecalling that Kiu,v k+1\n+ 1 = 1 for all i, and Ktu,v (r) = 1 for all r.\n2\nFinally, observe that the only non-trivial 2-connected component of Ht is a (k + 1)-clique on\nVbt . Replacing Vbt by a minimum spanning tree yields a tree T with dT (u, v) ≤ (k + 1) * dHt (u, v).\nThis completes the proof.\n\n4\n\nPathwidth(k + 1) 6\n\nPathwidth(k)\n\nWe now show that for any fixed k ≥ 1, and for any n ≥ 1, there exists an n-vertex graph of pathwidth\n−k\nk + 1 for which any stochastic D-embedding into graphs of pathwidth k has D ≥ Ω(n2 ), where\nthe Ω(*) notation hides a multiplicative constant depending on k. In fact, our lower bound holds\neven for trees of pathwidth k + 1. We begin by giving two structural lemmas that allow us to\ndecompose a tree of pathwidth ` into a path and a collection of trees of pathwidth at most ` − 1.\nLemma 4.1. Let G1 , G2 , G3 be connected graphs of pathwidth k with disjoint vertex sets, and for\ni ∈ [3], let vi ∈ V (Gi ). Let G be the graph obtained\nby introducing a new vertex\nv ∗ , and connecting\nS\nS\nit to v1 , v2 , and v3 . Formally, V (G) = {v ∗ } ∪ 3i=1 V (Gi ), and E(G) = 3i=1 E(Gi ) ∪ {{v ∗ , vi }}.\nThen G has pathwidth k + 1.\nProof. It is easy to see that G has pathwidth at most k + 1: For each i ∈ [3] take a path decom0 = C\n∗\nposition of Gi with bags Ci,1 , . . . , Ci,`i . For each i ∈ [3], j ∈ [`i ], let Ci,j\ni,j ∪ {v }. The bags\n0\n0\n0\n0\n0\n0\nC1,1 , . . . , C1,`1 , C2,1 , . . . , C2,`2 , C3,1 , . . . , C3,`3 induce a path decomposition of G with width at most\nk + 1.\nAssume now for the sake of contradiction that the pathwidth of G is at most k. That is, there\nexists a path decomposition of G with bags C1 , . . . , C` , such that: (i) for each i ∈ [`], |Ci | ≤ k + 1,\n(ii) for each {u, v} ∈ E(G) there exists i ∈ [`] with u, v ∈ Ci , and (iii) for each v ∈ V (G) there\nexists a subinterval I ⊆ [`] such that v ∈ Ci iff i ∈ I. For each i ∈ [3], let G0i be the subgraph of G\ninduced by V (Gi ) ∪ {v∗}. Let also\nAi = {j ∈ [`] : Cj ∩ V (G0i ) 6= ∅}.\nNote that since G0i is connected, it follows that Ai is a subinterval of [`]. Pick i1 , i2 ∈ [3], such\nthat 1 ∈ Ai1 , and ` ∈ Ai2 . Note that we might have i1 = i2 . Since V (G0i1 ) ∩ V (G0i2 ) 6= ∅, we have\nthat Ai1 ∩ Ai2 6= ∅. In particular, Ai1 ∪ Ai2 = [`]. Therefore, each bag Ci contains at least one\nvertex either from G0i1 , or G0i2 . Let i3 be an element in [3] \\ {i1 , i2 }. Removing V (G0i1 ) ∪ V (G0i2 )\nfrom all the bags Ci , we get a decomposition of G \\ (G0i1 ∪ G0i2 ) = Gi3 with width at most k − 1, a\ncontradiction since Gi3 has pathwidth k.\nThe following lemma is straightforward.\nLemma 4.2. If H is a minor of G, then the pathwidth of H is at most the pathwidth of G.\nLemma 4.3. Let T be a tree of pathwidth ` ≥ 2. Then, there exists a simple path P in T such that\ndeleting the vertices of P from T leaves a forest with each tree having pathwidth at most ` − 1.\n14\n\n\fProof. For every v ∈ V (T ), let α(v) denote the number of connected components of T \\ {v} of\npathwidth `. We first argue that for any v ∈ V (T ), we have α(v) ≤ 2. To see that, assume for the\nsake of contradiction that there exists v ∈ V (T ), such that T \\ {v} contains connected components\nC1 , C2 , C3 , each of pathwidth at least `. Then, by Lemma 4.1 it follows that T must have pathwidth\n` + 1, a contradiction.\nFirst, observe that if there exists v ∈ V (T ) with α(v) = 0, then the path contaning only v\nsatisfies the assertion. Next, we consider the case where for every v ∈ V (T ), α(v) = 1. We\nconstruct a path Q = x1 , . . . , xs as follows. We set x1 to be an arbitrary leaf of T . Given xi , let\nyi be the unique neighbor of xi in T , such that yi is contained in the unique connected component\nof T \\ {xi } of pathwidth `. If there exists j < i, such that xj = yi , then we terminate the path Q\nat xi , and we set s = i. Otherwise, we set xi+1 = yi , and continue at xi+1 . We now argue that Q\nsatisfies the assertion. For the sake of contradiction suppose that T \\ V (Q) contains a connected\ncomponent C of pathwidth `. The component C must be attached to Q via some edge {y, xr },\nwith y ∈ V (C). This implies however that y is chosen as yr when examining xr , and therefore y\nmust be in Q, a contradiction.\nFinally, it remains to consider the case where there exists at least one v ∈ V (T ), with α(v) = 2.\nLet X = {v ∈ V (T ) : α(v) = 2}. Let H = T [X] be the subgraph of T induced on X. We first argue\nthat H is connected. To see this, let x, y ∈ X, and let L be the unique path between x and y in T .\nSince α(x) = α(y) = 2, it follows that there exist connected components Cx , Cy of T \\ V (L) with Cx\nattached to x, and Cy attached to y, such that both Cx and Cy have pathwidth `. Let z ∈ V (L).\nIt follows that there exist components Cx0 , Cy0 of T \\ {z}, such that Cx ⊆ Cx0 , and Cy ⊆ Cy0 , which\nimplies that α(z) = 2. Thus, z ∈ X. This implies that L ⊆ H, and therefore H must be connected.\nWe next show that H is a path. To see this suppose for the sake of contradiction that there\nexists v ∈ V (H) with distinct neighbors v1 , v2 , v3 ∈ V (H). Since α(v1 ) = α(v2 ) = α(v3 ) = 2, it\nfollows that there exist components C1 , C2 , C3 of T \\ {v, v1 , v2 , v3 }, with each Ci adjacent to vi ,\nand such that each Ci has pathwidth `, for all i ∈ {1, 2, 3}. By Lemma 4.2 we have that for any\ni ∈ {1, 2, 3}, the connected component of T \\ {v} containing vi has pathwidth at least `. Applying\nLemma 4.1, we obtain that T has pathwidth at least ` + 1, a contradiction. Therefore, H is a path.\nLet w1 , w2 be the two endpoints of the path H. We remark that we might have w1 = w2 , if\nthere is only one vertex in H. Since α(w1 ) = 2, it follows that there exists a connected component\nof Cw1 of T \\ V (H) of pathwidth ` which is attached to w1 . Similarly, there exists a connected\ncomponent Cw2 of T \\ V (H) of pathwidth ` which is attached to w2 . Note that even if w1 = w2 ,\nsince α(w1 ) = 2, the components Cw1 , Cw2 can be chosen to be distinct. Let w10 , w20 be the neighbors\nof w1 , and w2 in Cw1 , and Cw2 respectively. Let H 0 be the path obtained by adding w10 , and w20 to\nH.\nWe will show that Q = H 0 satisfies the assertion of the lemma. To that end, it remains to show\nthat any connected component of T \\ V (H 0 ) has pathwidth at most ` − 1. Let C be a component of\nT \\ V (H 0 ), and suppose for the sake of contradiction that it has pathwidth `. Suppose first that C\nis attached to a vertex v ∈ V (H). Since v ∈ V (H), it follows that α(v) = 2. By applying Lemma\n4.1 on the clusters C, Cw1 , and Cw2 , we obtain that T contains a minor of pathwidth at least ` + 1,\nwhich combined with Lemma 4.2 leads to a contradiction.\nFinally, suppose that C is attached to a vertex w ∈ {w10 , w20 }, and assume, without loss of\ngenerality, that w = w10 . Then it follows that T \\{w} contains at least two components of pathwidth\n` (one containing C, and another containing Cw2 ), and thus α(w) = 2, a contradiction since w ∈\n/ X.\nThis concludes the proof.\n\n15\n\n\fFigure 3: The tree Ψ3,m .\n\nWe now state the main result of this Section.\nTheorem 4.4. For any k ≥ 1, and for any n ≥ 1, there exists an n-vertex tree G of pathwidth k+1,\n−k\nsuch that any stochastic D-embedding of G into metric graphs of pathwidth k, has D ≥ Ω(n2 ).\nIn particular, Pathwidth(k + 1) ∩ Trees 6 Pathwidth(k).\nThe remainder of this Section is devoted to proving Theorem 4.4. We first construct a graph\nthat will be used for the lower bound. For each i ≥ 1, let Φi be the unit-weighted graph consisting\nof a vertex v connected to i disjoint paths of length i. Observe that Φi is a tree with i leaves. We\nconsider Φi as being rooted at the vertex v.\nFor each i ≥ 1, and for each m ≥ 1, we define the graph Ψi,m as follows. For i = 1, we set\nΨ1,m = Φd√me . For i ≥ 2, let Ψi,m be the graph obtained by identifying the root of a copy of\n√\nΨi−1,√m , with each leaf of Φd√me . For ` ≤ d me, let Ψi,m,` be the tree obtained from Ψi,m by\n√\ndeleting d me − d`e children of the root of Ψi,m , along with everything underneath those children.\nIn particular, Ψi,m,√m = Ψi,m .\ni\n\nLemma 4.5. For each i ≥ 1 and m ≥ 32 , Ψi,m has pathwidth i + 1.\ni\n\nProof. Note that for m ≥ 32 , Ψi,m contains, as a minor, a full ternary tree T of depth i. Using\nLemma 4.1 inductively shows that the pathwidth of the depth i ternary tree is i + 1, hence Lemma\n4.2 implies that the pathwidth of Ψi,m is at least i + 1. It is also easy to check by hand that the\npathwidth of Ψi,m is at most i + 1, for every m ≥ 1.\nk\n\nFix k ≥ 1, and let G = Ψk,m . By Lemma 4.5, for m ≥ 32 , G has pathwidth k + 1. We will\nshow that for m large enough, any stochastic c-embedding of (V (G), dG ) into a distribution over\n−k\nmetric graphs of pathwidth k, has distortion c ≥ Ω(n2 ), were n = |V (G)|.\nAssume there exists a stochastic c-embedding of (V (G), dG ) into a distribution over metric\ngraphs of pathwidth k. By composing this with the result of Theorem 3.6, we get a stochastic\nc0 -embedding of (V (G), dG ) into the family of metrics supported on Pathwidth(k) ∩ Trees, with\nc0 = O(c) (where the O(*) notation hides a constant depending on the fixed parameter k).\n\n16\n\n\fBy averaging, there exists a metric tree T of pathwidth k and a single non-contractive mapping\nf : V (G) → V (T ) which satisfies,\n1\n|E(G)|\n\nX\n\ndT (f (u), f (v)) ≤ c0 .\n\n{u,v}∈E(G)\n\nThus it suffices to prove a lower bound on this quantity. In fact we will prove a somewhat stronger\nstatement; we will give a lower bound on the average stretch of any non-contractive embedding of\nΨk,m,√m/2 . We first prove an auxiliary lemma.\nLemma 4.6. Let S be an unweighted tree with r ∈ V (S), and let L ≥ 0. Let ` ≥ 0, and let\nS1 , . . . , S` be vertex-disjoint subtrees of S such that for each i ∈ [`], Si is attached to r via a path Qi\nof length at least L, and for each i 6= j ∈ [`], the paths Qi and Qj intersect only at r. We remark that\neach Si might contain only a single vertex. Let g : V (S) → V (T ) be a non-contractive embedding\nof S into a metric tree T , and let P be a simple path in T . If I = {i ∈ [`] : dT (g(Si ), P ) < L/2},\nthen\nX\n|I|2 L\ndT (g(u), g(v)) ≥\n.\n16\n{u,v}∈E(S)\n\nProof. For each i ∈ I, let zi = argminv∈P dT (v, g(Si )), and\nBi = {x ∈ V (P ) : dT (zi , x) ≤ L/2}.\nSince g is non-contractive, we have that for each i, j ∈ I with i 6= j, dT (g(Si ), g(Sj )) ≥ 2L, and\ntherefore\ndT (zi , zj ) ≥ dT (g(Si ), g(Sj )) − dT (g(Si ), zi ) − dT (g(Sj ), zj ) = 2L − dT (Si , P ) − dT (Sj , P ) > L,\nwhich implies Bi ∩ Bj = ∅.\nBy reordering, we assume that I = {1, 2, . . . , |I|}, and that for each i, j ∈ I with i < j, Bi\nappears to the left of Bj in P , after fixing some orientation of P . Furthermore, by choosing the\nproper orientation, we may assume that there is a vertex u0 ∈ P such that u0 is contained in, or\nappears to the left of Bd|I|/2e in P , and g(r) and u0 are in the same subtree of T \\ E(P ).\nFor each i ∈ {1, . . . , |I|}, let wi = argminv∈V (Si ) dS (v, r). It follows that for each i ∈ {d|I|/2e +\n1, . . . , |I|},\ndT (g(r), g(wi )) ≥ (i − d|I|/2e) L.\nFurthermore, for every i ∈ [`], clearly dT (g(r), g(wi )) ≥ L by non-contractiveness. Therefore,\nX\nX\nX\ndT (g(u), g(v)) ≥\ndT (g(u), g(v))\n{u,v}∈E(S)\n\ni∈{d1,...,|I|} {u,v}∈E(Qi )\n\nX\n\n≥\n\ndT (g(r), g(wi ))\n\ni∈{d1,...,|I|}\n\n\u0018\n\n\u0019\n|I|\nL+\n≥\n2\n\nX\ni∈{d|I|/2e+1,...,|I|}\n\n17\n\n\u0012\n\u0018 \u0019\u0013\n|I|\n|I|2 L\ni−\nL>\n.\n2\n16\n\n\fThe proof of the lower bound proceeds by induction on k. We first prove the base case for\nembedding into trees of pathwidth one.\nLemma 4.7. Let g : V (Ψ1,m,√m/2 ) → V (T ) be a non-contracting embedding into a metric tree T\nof pathwidth one. Then,\n√\nX\n1\nm\ndT (g(u), g(v)) ≥ 10 .\n√\n|E(Ψ1,m, m/2 )|\n2\n√\n{u,v}∈E(Ψ1,m,\n\nm/2 )\n\nProof. Since the tree T has pathwidth one, it consists of a path P = {v1 , . . . , vt }, and a collection\nof vertex-disjoint stars T1 , . . . , Tt , with each Ti being rooted at vi . Note that Ti might contain only\nthe vertex vi .\n√\nRecall that Ψ1,m,√m/2 consists of b m/2c disjoint paths Q1 , . . . , Qb√m/2c , with\nQi = {r, qi,1 , . . . , qi,d√me },\n√\nwhere r is the root of Ψ1,m,√m/2 . For each i ∈ [b m/2c] let Q0i be the subpath of Qi of length\nn\no\n√\nb m/2c with Q0i = qi,d√m/2e , . . . , qi,d√me .\n√\n√\n√\nLet I1 = {i ∈ [b m/2c] : dT (g(Q0i ), P ) ≥ m/4}, and let I2 = [b m/2c] \\ I1 . By Lemma 4.6,\n√\nX\n|I2 |2 m\ndT (g(u), g(v)) ≥\n.\n32\n√\n{u,v}∈E(Ψ1,m,\n\nm/2 )\n\n√\nSince |E(Ψ1,m )| ≤ 2m, we are done if |I2 | ≥ m/4.\n√\nIt remains to consider the case |I1 | ≥ b m/4c. Observe that for each i ∈ I1 , all the edges of\nQ0i have their endpoints mapped to distinct leaves of the stars T1 , . . . , Tt , with the edge adjacent to\n√\neach such leaf having length at least m/4, by non-contractiveness of g. Therefore, each edge of\n√\nsuch a Q0i is stretched by a factor of m/2 in T . In other words,\n\u0016√ \u0017 √\nX\n1\n1\nm\nm\ndT (g(u), g(v)) ≥\n* |I1 | *\n|E(Ψ1,m,√m/2 )|\n2m\n2\n2\n{u,v}∈E(Ψ1,m,√m/2 )\n√ \u0016√ \u0017 \u0016√ \u0017 √\nm\nm\nm\nm\n=\n≥\n,\n4\n4\n2\n32\nwith the latter bound holding for m ≥ 4. Observe that the LHS is always at least 1, yielding the\ndesired result for m ≤ 4 as well, and completing the proof.\nWe are now ready to prove the main inductive step.\nk\n\nLemma 4.8. Let k ≥ 1, a ∈ N, m = (2a)2 , and let g : V (Ψk,m,√m/2 ) → V (T ) be a non-contractive\nembedding of Ψk,m,√m/2 into a metric tree T of pathwidth k. Then,\n1\n|E(Ψk,m,√m/2 )|\n\n−k\n\nX\n\ndT (g(u), g(v)) ≥\n\n{u,v}∈E(Ψk,m,√m/2 )\n\n18\n\nm2\n.\n27+3k\n\n\fProof. We proceed by induction on k. The base case k = 1 is given by Lemma 4.7, so we can\nassume that k ≥ 2, and that the assertion is true for k − 1.\nSince the tree T has pathwidth k ≥ 2, by Lemma 4.3 it follows that it consists of a path P ,\nand a collection of trees T1 , . . . , Tt of pathwidth at most k − 1, with each Ti being rooted at some\nvertex vi , and vi being attached to P via an edge. Recall that Ψk,m,√m/2 consists of a root r and\n√\nm/2 subtrees Q1 , . . . , Q√m/2 , with each Qi having a copy Q0i of Ψk−1,√m that is connected to r\n√\nvia a path of length m.\n√\n√\n√\nLet I1 = {i ∈ [ m/2] : dT (g(Q0i ), P ) ≥ m/2}, and let I2 = [ m/2] \\ I1 . By Lemma 4.6,\n√\nX\n|I2 |2 m\ndT (g(u), g(v)) ≥\n.\n16\n√\n{u,v}∈E(Ψk,m,\n\nm/2 )\n\n√\nSince |E(Ψk,m )| ≤ km, this yields the desired result for |I2 | ≥ m/4.\n√\nIt remains to consider the case |I1 | ≥ m/4. Let I1,1 be the subset of I1 containing all indices\ni ∈ I1 such that for some j ∈ [t], Tj contains the image of a copy of Ψk−1,m1/2 ,m1/4 /2 from Q0i . Let\nalso I1,2 = I1 \\ I1,1 .\nBy the induction hypothesis it follows that for any i ∈ I1,1 ,\n1−k\n\nX\n\ndT (g(u), g(v)) ≥ m\n\n{u,v}∈E(Q0i )\n\n1/2\n\n−k\n\n(m1/2 )2\nm2\n* (k − 1) * 7+3(k−1) = m1/2 * (k − 1) * 4+3k .\n2\n2\n\n(5)\n\nConsider now i ∈ I1,2 . Let ri be the root of Q0i and let Wi,1 , . . . , Wi,m1/4 be the copies of Ψk−1,m1/2 ,1\nin Q0i , intersecting only at ri . BySthe definition of I1,2 we have that for any J ⊂ [m1/4 ] with\n|J| = m1/4 /2, and for any i0 ∈ [t], j∈J g(Wi,j ) * Ti0 . Assume that the image of ri is contained in\nTτ , for some τ ∈ [t]. It follows that there exists R ⊆ [m1/4 ], with |R| ≥ m1/4 /2, such that for each\nj ∈ R, the image of Wi,j intersects some tree Tσj , with σj 6= τ . Since ri ∈ V (Wi,j ) it follows that\nthere exists an edge ei,j ∈ E(Wi,j ) ∪ E(Zi,j ) that is stretched by a factor of at least m1/2 . It follows\nthat for any i ∈ I1,2 ,\nX\nm1/4\ndT (g(u), g(v)) ≥\n* m1/2 .\n(6)\n2\n0\n{u,v}∈E(Qi )\n\nBy (5) we get a lower bound for the average stretch of the edges of every Q0i , with i ∈ I1,1 . Similarly,\nby (6) we get a lower bound for the average stretch of the edges of every Q0i , with i ∈ I1,2 . Thus,\ncombining (5) and (6) we get\n1\n|E(Ψk,m,√m/2 )|\n\n−k\n\nX\n\ndT (g(u), g(v)) ≥\n\n{u,v}∈E(Ψk,m,√m/2 )\n\n1\nm2\n* |I1 | * m1/2 * (k − 1) * 4+3k\nk*m\n2\n−k\n\n>\nas desired.\nThis concludes the proof of Theorem 4.4.\n\n19\n\nm2\n,\n27+3k\n\n\fAcknowledgements\nWe thank Andrea Francke and Alexander Jaffe for a careful reading of our arguments, and numerous\nvaluable suggestions. We are also grateful to the anonymous referees for many insightful comments.\n\nReferences\n[AR98]\n\nYonatan Aumann and Yuval Rabani. An O(log k) approximate min-cut max-flow theorem and approximation algorithm. SIAM J. Comput., 27(1):291–301 (electronic), 1998.\n\n[Bar96]\n\nYair Bartal. Probabilistic approximations of metric space and its algorithmic application. In 37th Annual Symposium on Foundations of Computer Science, pages 183–193,\nOctober 1996.\n\n[Bar98]\n\nYair Bartal. On approximating arbitrary metrics by tree metrics. In Proceedings of the\n30th Annual ACM Symposium on Theory of Computing, pages 183–193, 1998.\n\n[CG04]\n\nD. Carroll and A. Goel. Lower bounds for embedding into distributions over excluded\nminor graph families. In Proceedings of the 12th European Symposium on Algorithms,\n2004.\n\n[CGN+ 06] Chandra Chekuri, Anupam Gupta, Ilan Newman, Yuri Rabinovich, and Alistair Sinclair. Embedding k-outerplanar graphs into l1 . SIAM J. Discrete Math., 20(1):119–136\n(electronic), 2006.\n[CJLV08] Amit Chakrabarti, Alexander Jaffe, James R. Lee, and Justin Vincent. Embeddings of\ntopological graphs: Lossy invariants, linearization, and 2-sums. In IEEE Symposium on\nFoundations of Computer Science, 2008.\n[CKR10]\n\nEden Chlamtac, Robert Krauthgamer, and Prasad Raghavendra. Approximating sparsest cut in graphs of bounded treewidth. In APPROX-RANDOM, pages 124–137, 2010.\n\n[CSW10]\n\nChandra Chekuri, F. Bruce Shepherd, and Christophe Weibel. Flow-cut gaps for integer\nand fractional multiflows. In Proceedings of the 21st Annual ACM-SIAM Symposium\non Discrete Algorithms, pages 1198–1208, 2010.\n\n[Die05]\n\nReinhard Diestel. Graph theory, volume 173 of Graduate Texts in Mathematics.\nSpringer-Verlag, Berlin, third edition, 2005.\n\n[FF56]\n\nL. R. Ford and D. R. Fulkerson. Maximal flow through a network. Canadian Journal\nof Mathematics, 8:399–404, 1956.\n\n[FRT04]\n\nJittat Fakcharoenphol, Satish Rao, and Kunal Talwar. A tight bound on approximating\narbitrary metrics by tree metrics. J. Comput. Syst. Sci., 69(3):485–497, 2004.\n\n[GNRS04] Anupam Gupta, Ilan Newman, Yuri Rabinovich, and Alistair Sinclair. Cuts, trees and\nl1 -embeddings of graphs. Combinatorica, 24(2):233–269, 2004.\n[IS07]\n\nPiotr Indyk and Anastasios Sidiropoulos. Probabilistic embeddings of bounded genus\ngraphs into planar graphs. In Proceedings of the 23rd Annual Symposium on Computational Geometry. ACM, 2007.\n20\n\n\f[Kar89]\n\nR. M. Karp. A 2k-competitive algorithm for the circle. Manuscript, 1989.\n\n[LLR95]\n\nN. Linial, E. London, and Y. Rabinovich. The geometry of graphs and some of its\nalgorithmic applications. Combinatorica, 15(2):215–245, 1995.\n\n[Lov06]\n\nLászló Lovász. Graph minor theory. Bull. Amer. Math. Soc. (N.S.), 43(1):75–86 (electronic), 2006.\n\n[LR99]\n\nTom Leighton and Satish Rao. Multicommodity max-flow min-cut theorems and their\nuse in designing approximation algorithms. J. ACM, 46(6):787–832, 1999.\n\n[LR10]\n\nJames R. Lee and Prasad Raghavendra. Coarse differentiation and multi-flows in planar\ngraphs. Discrete Comput. Geom., 43(2):346–362, 2010.\n\n[LS09]\n\nJ. R. Lee and A. Sidiropoulos. On the geometry of graphs with a forbidden minor. In\n41st Annual Symposium on the Theory of Computing, 2009.\n\n[OS81]\n\nHaruko Okamura and P. D. Seymour. Multicommodity flows in planar graphs. J.\nCombin. Theory Ser. B, 31(1):75–81, 1981.\n\n[RR98]\n\nY. Rabinovich and R. Raz. Lower bounds on the distortion of embedding finite metric\nspaces in graphs. Discrete Comput. Geom., 19(1):79–94, 1998.\n\n[RS83]\n\nNeil Robertson and P. D. Seymour. Graph minors. I. Excluding a forest. J. Combin.\nTheory Ser. B, 35(1):39–61, 1983.\n\n21\n\n\f"}