{"id": "http://arxiv.org/abs/1102.0531v1", "guidislink": true, "updated": "2011-02-02T18:51:27Z", "updated_parsed": [2011, 2, 2, 18, 51, 27, 2, 33, 0], "published": "2011-02-02T18:51:27Z", "published_parsed": [2011, 2, 2, 18, 51, 27, 2, 33, 0], "title": "Monte-Carlo sampling of energy-constrained quantum superpositions in\n  high-dimensional Hilbert spaces", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1102.0186%2C1102.4454%2C1102.4809%2C1102.4697%2C1102.0877%2C1102.0690%2C1102.4378%2C1102.2335%2C1102.3640%2C1102.5201%2C1102.5688%2C1102.1943%2C1102.1897%2C1102.3885%2C1102.1237%2C1102.1344%2C1102.3132%2C1102.0165%2C1102.5046%2C1102.3546%2C1102.3929%2C1102.4661%2C1102.2927%2C1102.0531%2C1102.4281%2C1102.3009%2C1102.4083%2C1102.1397%2C1102.0268%2C1102.2887%2C1102.5627%2C1102.4040%2C1102.1780%2C1102.3557%2C1102.2839%2C1102.0512%2C1102.3330%2C1102.0618%2C1102.2950%2C1102.5024%2C1102.2955%2C1102.4134%2C1102.1225%2C1102.5052%2C1102.5173%2C1102.2094%2C1102.3517%2C1102.5048%2C1102.0595%2C1102.2634%2C1102.1600%2C1102.1117%2C1102.2173%2C1102.2824%2C1102.3510%2C1102.1299%2C1102.4240%2C1102.1461%2C1102.4463%2C1102.1337%2C1102.5771%2C1102.4391%2C1102.3888%2C1102.3207%2C1102.1441%2C1102.4097%2C1102.1865%2C1102.3897%2C1102.0456%2C1102.4519%2C1102.0316%2C1102.3718%2C1102.0920%2C1102.0433%2C1102.4319%2C1102.2055%2C1102.5451%2C1102.5034%2C1102.0522%2C1102.0452%2C1102.3154%2C1102.2313%2C1102.4687%2C1102.2436%2C1102.4501%2C1102.5297%2C1102.3059%2C1102.4858%2C1102.2655%2C1102.3224%2C1102.5564%2C1102.2639%2C1102.2224%2C1102.1801%2C1102.4487%2C1102.4278%2C1102.1742%2C1102.4909%2C1102.3421%2C1102.4754%2C1102.0461&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Monte-Carlo sampling of energy-constrained quantum superpositions in\n  high-dimensional Hilbert spaces"}, "summary": "Recent studies into the properties of quantum statistical ensembles in\nhigh-dimensional Hilbert spaces have encountered difficulties associated with\nthe Monte-Carlo sampling of quantum superpositions constrained by the energy\nexpectation value. A straightforward Monte-Carlo routine would enclose the\nenergy constrained manifold within a larger manifold, which is easy to sample,\nfor example, a hypercube. The efficiency of such a sampling routine decreases\nexponentially with the increase of the dimension of the Hilbert space, because\nthe volume of the enclosing manifold becomes exponentially larger than the\nvolume of the manifold of interest. The present paper explores the ways to\noptimise the above routine by varying the shapes of the manifolds enclosing the\nenergy-constrained manifold. The resulting improvement in the sampling\nefficiency is about a factor of five for a 14-dimensional Hilbert space. The\nadvantage of the above algorithm is that it does not compromise on the rigorous\nstatistical nature of the sampling outcome and hence can be used to test other\nmore sophisticated Monte-Carlo routines. The present attempts to optimise the\nenclosing manifolds also bring insights into the geometrical properties of the\nenergy constrained manifold itself.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1102.0186%2C1102.4454%2C1102.4809%2C1102.4697%2C1102.0877%2C1102.0690%2C1102.4378%2C1102.2335%2C1102.3640%2C1102.5201%2C1102.5688%2C1102.1943%2C1102.1897%2C1102.3885%2C1102.1237%2C1102.1344%2C1102.3132%2C1102.0165%2C1102.5046%2C1102.3546%2C1102.3929%2C1102.4661%2C1102.2927%2C1102.0531%2C1102.4281%2C1102.3009%2C1102.4083%2C1102.1397%2C1102.0268%2C1102.2887%2C1102.5627%2C1102.4040%2C1102.1780%2C1102.3557%2C1102.2839%2C1102.0512%2C1102.3330%2C1102.0618%2C1102.2950%2C1102.5024%2C1102.2955%2C1102.4134%2C1102.1225%2C1102.5052%2C1102.5173%2C1102.2094%2C1102.3517%2C1102.5048%2C1102.0595%2C1102.2634%2C1102.1600%2C1102.1117%2C1102.2173%2C1102.2824%2C1102.3510%2C1102.1299%2C1102.4240%2C1102.1461%2C1102.4463%2C1102.1337%2C1102.5771%2C1102.4391%2C1102.3888%2C1102.3207%2C1102.1441%2C1102.4097%2C1102.1865%2C1102.3897%2C1102.0456%2C1102.4519%2C1102.0316%2C1102.3718%2C1102.0920%2C1102.0433%2C1102.4319%2C1102.2055%2C1102.5451%2C1102.5034%2C1102.0522%2C1102.0452%2C1102.3154%2C1102.2313%2C1102.4687%2C1102.2436%2C1102.4501%2C1102.5297%2C1102.3059%2C1102.4858%2C1102.2655%2C1102.3224%2C1102.5564%2C1102.2639%2C1102.2224%2C1102.1801%2C1102.4487%2C1102.4278%2C1102.1742%2C1102.4909%2C1102.3421%2C1102.4754%2C1102.0461&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Recent studies into the properties of quantum statistical ensembles in\nhigh-dimensional Hilbert spaces have encountered difficulties associated with\nthe Monte-Carlo sampling of quantum superpositions constrained by the energy\nexpectation value. A straightforward Monte-Carlo routine would enclose the\nenergy constrained manifold within a larger manifold, which is easy to sample,\nfor example, a hypercube. The efficiency of such a sampling routine decreases\nexponentially with the increase of the dimension of the Hilbert space, because\nthe volume of the enclosing manifold becomes exponentially larger than the\nvolume of the manifold of interest. The present paper explores the ways to\noptimise the above routine by varying the shapes of the manifolds enclosing the\nenergy-constrained manifold. The resulting improvement in the sampling\nefficiency is about a factor of five for a 14-dimensional Hilbert space. The\nadvantage of the above algorithm is that it does not compromise on the rigorous\nstatistical nature of the sampling outcome and hence can be used to test other\nmore sophisticated Monte-Carlo routines. The present attempts to optimise the\nenclosing manifolds also bring insights into the geometrical properties of the\nenergy constrained manifold itself."}, "authors": ["Frank Hantschel", "Boris V. Fine"], "author_detail": {"name": "Boris V. Fine"}, "author": "Boris V. Fine", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1140/epjd/e2011-10673-7", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1102.0531v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1102.0531v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "9 pages, 7 figures, accepted for publication in European Physical\n  Journal D", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1102.0531v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1102.0531v1", "journal_reference": "Eur. Phys. J. D 63, 73 (2011)", "doi": "10.1140/epjd/e2011-10673-7", "fulltext": "EPJ manuscript No.\n(will be inserted by the editor)\n\nMonte-Carlo sampling of energy-constrained quantum\nsuperpositions in high-dimensional Hilbert spaces\nFrank Hantschel\n\na\n\nand Boris V. Fine\n\nb\n\narXiv:1102.0531v1 [quant-ph] 2 Feb 2011\n\nInstitute for Theoretical Physics, University of Heidelberg, Philosophenweg 19, 69120 Heidelberg, Germany\n26 November, 2010\nAbstract. Recent studies into the properties of quantum statistical ensembles in high-dimensional Hilbert\nspaces have encountered difficulties associated with the Monte-Carlo sampling of quantum superpositions\nconstrained by the energy expectation value. A straightforward Monte-Carlo routine would enclose the\nenergy constrained manifold within a larger manifold, which is easy to sample, for example, a hypercube.\nThe efficiency of such a sampling routine decreases exponentially with the increase of the dimension of\nthe Hilbert space, because the volume of the enclosing manifold becomes exponentially larger than the\nvolume of the manifold of interest. The present paper explores the ways to optimise the above routine by\nvarying the shapes of the manifolds enclosing the energy-constrained manifold. The resulting improvement\nin the sampling efficiency is about a factor of five for a 14-dimensional Hilbert space. The advantage of the\nabove algorithm is that it does not compromise on the rigorous statistical nature of the sampling outcome\nand hence can be used to test other more sophisticated Monte-Carlo routines. The present attempts\nto optimise the enclosing manifolds also bring insights into the geometrical properties of the energyconstrained manifold itself.\nPACS. 0 5.30.-d, 03.65.Ta\n\n1 Introduction\nExperimental efforts to create quantum computers come\nincreasingly close to controllable manipulations of completely isolated quantum systems consisting of the number of q-bits of the order of 10. Although not macroscopic,\nsuch q-bit systems have sufficiently large Hilbert spaces,\nwhere it becomes increasingly difficult to generate predetermined quantum superpositions. Instead, the experiments are likely to deal with the ensembles of quantum\nsuperpositions produced either on purpose or because of\nexperimental constraints. On the theoretical side, the statistical properties of the superpositions of quantum states\nin many-dimensional Hilbert spaces with a constraint on\nthe energy value (or the expectation value of some other\nobservable quantity) are also of interest for the foundations of quantum statistical physics. At issue here is the\napplicability of the Boltzmann-Gibbs statistics to completely isolated quantum systems.\nRecently, the authors have investigated[1,2] the properties of the so-called \"quantum micro-canonical\" (QMC)\nensemble[3] of wave functions having fixed energy expectation value (see also Refs.[4,5,6,7,8,9]). For a Hilbert space\nof dimension N with energy spectrum {E1 , E2 , ..., EN },\nthe QMC ensemble is formally defined to include all posa\nb\n\nEmail: F.Hantschel@thphys.uni-heidelberg.de\nEmail: B.Fine@thphys.uni-heidelberg.de\n\nsible wave functions\nψ=\n\nN\nX\n\nci φi ,\n\n(1)\n\ni=1\n\nPN\nsuch that i=1 |ci |2 Ei = Eav . Here φi are the eigenstates\nof the system, ci are the corresponding complex amplitudes, and Eav is the energy expectation value. \"All possible wave functions\" in the above definition means that\nthe joint probability distribution of a set of normalized values {ci } is uniform on the manifold in the Hilbert space\nconstrained by the value of Eav .\nThe primary objective of this paper is to explore and\nimprove the numerical algorithms for sampling the QMC\nensemble in high-dimensional Hilbert spaces.\n\n1.1 Analytical results for the QMC ensemble\nThe QMC ensemble is different from the conventional microcanonical ensemble: the latter limits the participating eigenstates to a small energy window around Eav , while the former does not [see the discussion in Ref.[2]]. According to\nthe available analytical results[1,4,6], the QMC ensemble\ndoes not lead to conventional Boltzmann-Gibbs statistics\nfor either the entire isolated quantum system, or for a\nsmall subsystem of it.\n\n\f2\n\nF. Hantschel and B. V. Fine: Monte-Carlo sampling of energy-constrained quantum superpositions ...\nN=10\n\nhpi i =\n\n1\n,\nN [1 + λ(Ei − Eav )]\n\n800\nΝHEav L\n\nFor the entire quantum system with sufficiently large\nbut finite Hilbert space of dimension N , the QMC ensemble typically leads to the following average occupations of\neigenstates[1,4,6]:\n\n600\n400\n\n(2)\n\nwhere pi ≡ |ci |2 , and λ is a parameter that can be obtained\nnumerically for a given energy spectrum and a given value\nof Eav .\nOne can immediately see that, as Ei grows, the decrease in the average occupations of the eigenstates is\nmuch slower than exponential. (Were it exponential, such\na result would represent the canonical ensemble and lead\nto the conventional Boltzmann-Gibbs statistics for small\nsubsystems of macroscopic systems.)\nAnother remarkable feature of formula (2) is that, as\na function of Ei , it has a pole at Eλ = Eav − 1/λ. As\nshown in Ref.[1], if the QMC ensemble is considered for\na macroscopic system with the energy expectation value\nEav equal to the average energy of the Boltzmann-Gibbs\ndistribution for the same system at any experimentally\nrealisable temperature, then the above pole approaches\nextremely closely to the energy of the ground state. As a\nresult, the ground state acquires a macroscopically large\noccupation, which, if the QMC ensemble were realisable,\nwould signify a new type of condensation phenomenon independent of the statistics of the constitutent particles of\nthe system. For quantum systems that have a large number of states but not too large a number of constitutent\nparticles, the above condensation is not sharp, but rather\nhas a character of smooth crossover as a function of Eav .\nFor a small subsystem of a macroscopic system, the\nQMC-based result also looks unfamiliar[1,8]: all states of\nthe subsystem except for the lowest one have the same\noccupations, while the lowest state has a higher occupation. In other words, the subsystem appears to be in a\nweighed mixture of two conventional thermal states-the\nzero temperature state and the infinite temperature state.\nWe also note that Eq.(2) already gives a good description of the QMC ensemble for the values of N of the order of ten[1,2]. In this case, however, the deviations from\nEq.(2) are still noticeable for the occupations of the lowest\n(or highest) energy levels. However, these deviations can\nbe accounted for with the help of the finite-N corrections\nintroduced in Ref.[2].\nAlthough the QMC-based results appear to contradict\neveryday experience, this does not mean that the QMC\nensemble should be labelled as \"unphysical\". In everyday\nexperimental situations, one does not deal with completely\nisolated large quantum systems. The physical significance\nof the QMC ensemble is that it might be realisable under\nstrong perturbations in isolated quantum systems with\nsmall numbers of particles but large numbers of quantum\nlevels, for example, systems of ten q-bits. It is also not clear\nat present, what are the physical reasons behind the fact\nthat the QMC ensemble is not realised in naturally occurring macroscopic systems. A radical possible explanation\nof this fact is based on the notion of quantum collapse.\n\n200\n0\n0.0\n\n-0.5\n\n0.5\n\nEav =ÚEi pi\n\nFig. 1. Unnormalised distribution of the values of Eav obtained by direct sampling of a 10-dimensional Hilbert space\nwithout the energy constraint. The energy levels Ei of the\nsystem are indicated above the x-axis.\nP The maximum of the\nE = 0.\ndistribution is located at Eav = N1\ni i\n\n1.2 Previous numerical investigations of the QMC\nensemble\nThe above mentioned analytical results for the QMC ensemble are based, in part, on approximations that need to\nbe tested numerically by Monte-Carlo sampling.\nA straightforward Monte-Carlo routine involves a sampling of the entire Hilbert space with the subsequent selection of the superpositions having the energy expectation\nvalues close to Eav . This routine, however, is rather inefficient. It is known from analytical calculations[1,5] that\nthe occurrence of superpositions with a given energy expectation value Eav rapidly decreases as Eav deviates from\nthe arithmetic average of all eigenenergies. As illustrated\nin Fig. 1, even in modestly large Hilbert spaces there is\na range of values of Eav that would never appear in the\ncourse of such a routine implemented with realistic computational resources. The larger is the Hilbert space dimension, the smaller is the fraction of all possible values\nof Eav accessible with such a routine.\nIn our previous work [1,2], in order to examine the\nstatistics for any value of Eav , we proceeded as follows.\nWe note that the phases of ci are not constrained, and\nhence have uniform probability distribution in the interval\n[0, 2π). At the same time, the variables |ci | can be substituted by the eigenstate occupation variables pi = |ci |2 .\nIt can be shown[1] that the uniform joint probability distribution for the normalised set of {ci } translates into a\nuniform distribution on a manifold M defined in the space\nof variables {pi } by the following conditions:\nN\nX\n\nEi pi = Eav\n\n(3)\n\ni=1\nN\nX\n\npi\n\n=1\n\n(4)\n\ni\n\npi ≥ 0, ∀i.\n\n(5)\n\nThe advantage of working in the space of variables {pi }\nis that all constraints (3-5) are hyperplanes, and hence the\nresulting manifold has the character of hyper-polyhedron\nwith flat faces. For comparison, in the space of variables ci\n\n\fF. Hantschel and B. V. Fine: Monte-Carlo sampling of energy-constrained quantum superpositions ...\n\nthe manifold is curved - consequence of the hypersphere\nPN\nnormalisation condition i |ci |2 = 1 .\n\nIn [1,2], in order to examine the statistics corresponding to any given value of Eav , we performed the Monte\nCarlo sampling within a rectangular (N − 2)-dimensional\nbox around the above manifold in the subspace constrained\nby hyperplanes (3, 4). This sort of algorithm, while being\nable to access any value of Eav , is still relatively inefficient. As the dimension of the Hilbert space increases, the\nvolume of the enclosing box becomes exponentially larger\nthan the volume of the manifold of interest, and hence the\nacceptance rate for the Monte-Carlo points becomes very\nsmall. The purpose of the present work was to explore how\nmuch one can improve the acceptance rate by reorienting\nthe above rectangular box with the appropriate resizing\nof its linear dimensions, or by choosing a non-rectangular\nparallelogram-like box.\n\n3\n\n2 Monte-Carlo algorithms\n2.1 Basic algorithm\n\nOur basic algorithm for the Monte-Carlo sampling of manifold M defined by Eqs.(3-5) is based on putting a (N −2)dimensional box referred to as B around manifold M . The\nbox B should lie in the the (N −2)-dimensional hyperplane\nA formed by the intersection of the energy and the normalisation hyperplanes given by Eqs.(3) and (4), respectively.\nDifferent algorithms discussed in subsections 2.3 and 2.4\ndiffer only by the shape and the orientation of box B. In\nthis subsection we describe all the common elements of\nthese algorithms, which we call the \"basic algorithm\". It\nconsists of the following steps:\n1) Define the \"standard\" coordinate system in the space\nof variables {pi } with the origin at point (0, 0, ..., 0) and\nthe set of N basis vectors: e1 = (1, 0, 0, ..., 0), e2 = (0, 1, 0, ..., 0),\nOther algorithms to sample the QMC ensemble have\n..., eN = (0, 0, 0, ..., 1).\nbeen meanwhile proposed[6,9] and, in principle, can sam2) Define the \"modified\" coordinate system, where the\nple the QMC ensemble more efficiently. These algorithms\norigin\nis chosen on one of the vertices of manifold M (that\nguide the sampling on the basis of available analytical reis,\nin\nthe\nhyperplane A), and the basis vectors are selected\nsults. However, since some of these analytical results are\nas\nfollows:\nThe first two vectors are orthogonal to the hythemselves of approximate nature, it remains to be shown,\nperplane\nA\nand denoted as bnrm and bE . Vector bnrm is\nthat such algorithms lead to a fair representative sampling\nchosen\nperpendicular\nto the normalisation\nhyperplane (4),\n√\nof the QMC ensemble. Given that some of the properties\nthat\nis,\nb\n=\n(1,\n1,\n1,\n...,\n1)/\nN\n).\nVector\nbE is obtained\nnrm\nof the QMC ensemble, such as the condensation to the\nby\northonormalising\nvector\n(E\n,\nE\n,\nE\n,\n...,\nEN ) with re1\n2\n3\nground state, are rather non-intuitive and have unclear\nspect\nto\nthe\nb\nwith\nthe\nhelp\nof\nthe\nGram-Schmidt\npronrm\nsensitivity to the numerical uncertainties, it is highly desirable to remove from the numerical investigations any cedure. The remaining N − 2 basis vectors, to be denoted\ndoubts about the fair character of the Monte-Carlo sam- as b1 , b2 , ..., bN −2 , are all orthogonal to bnrm and bE ,\npling routines. The clear advantage of the algorithms con- that is, they lie in the hyperplane A, but they are not\nsidered in the present paper is that, whenever they pro- necessarily orthogonal to each other. Their specific choice\nduce sufficient statistics, this statistics is guaranteed to depends on the particular realization of the algorithm as\nrepresent the true QMC ensemble. Therefore, the rela- described in the following sections.\n3) Find all vertices of manifold M in the standard\ntively slow algorithms described below can be used to test\ncoordinate\nsystem using formulas given in subsection 2.2.\nfaster algorithms.\n4) Transform the coordinates of all vertices to the modWe also note that the present effort to optimise the ified coordinate system.\nchoice of the sampling box around the manifold M reveals\n5) Define the orientation of box B in the modified coorinteresting insights into the geometry of this manifold it- dinate system; choose the linear dimensions of box B that\nself.\nare minimally sufficient to enclose all vertices of manifold\nIn a broader mathematical context, the problem of M within the box.\n6) Randomly sample points within box B in the modcomputing the volume of a generic convex high-dimensional\npolyhedron is known to be NP-hard[10]. This and related ified coordinate system.\noptimisation problems are the subject of active ongoing\n7) Select the points belonging to manifold M . The\nresearch-see, for example, Refs.[11,12,13]. In compari- selection criterion is the following: Each sampled point\nson with the generic polyhedron problem, the case consid- should be transformed to the standard coordinate sysered in the present paper is somewhat simpler, because, tem and then accepted only if all standard coordinates\nas shown below, we can easily identify vertices, edges and are non-negative, meaning that the positivity condition\nfaces of the polyhedron of interest.\n(5) is satisfied.\nIn the rest of the paper, Section 2.1 describes the basic\nidea of the Monte-Carlo sampling algorithm, Section 2.2\ndescribes the vertices of the manifold M , Sections 2.3 and\n2.4 introduce two improved algorithms, Section 3 presents\nthe performance tests for the algorithms considered, and,\nfinally, Section 4 summarises the results presented in this\npaper.\n\nDenoting the number of sampled points as ns , the\nnumber of accepted points as na , the (N − 2)-dimensional\nvolume of manifold M as VM and the volume of the surrounding box as VB , we express the acceptance rate of the\nalgorithm as follows\nr=\n\nVM\nna\n=\n.\nns\nVB\n\n(6)\n\n\f4\n\nF. Hantschel and B. V. Fine: Monte-Carlo sampling of energy-constrained quantum superpositions ...\n\nFrom our experience, a reasonable acceptance rate for\npractical computation should be larger than 10−7 .\nBelow we consider the following choices for the enclosing box B:\n1) In subsection 2.3, we choose the box B to be of rectangular shape and optimise its orientation. Changing the\nbox orientation modifies its dimensions and hence, once\noptimised, can reduce its volume. The smaller the volume\nof the box, the larger the acceptance rate r. We refer to the\nresulting algorithm as \"R-algorithm\" (R for rectangle).\n2) In subsection 2.4 we enclose the manifold M within\na non-rectangular parallelogram-like box and then optimise the choice of this box. We call the resulting algorithm\n\"NR-algorithm\" (NR for non-rectangular).\nBoth R- and NR-algorithms require finding the vertices of manifold M - step 3 of the basic algorithm. This\nstep is described in the next subsection.\n\nB2\nB1\n\nM\nM\n\nFig. 2. (Colour online) Cartoon representing two different\nchoices of boxes B1 and B2 (red rectangles) enclosing the same\nmanifold M (black triangle). Obviously the volume of box B1\nis smaller than the volume of box B2 .\n\n2.2 Vertices of manifold M\n2.3 Rectangular box: R-algorithm\nIn the standard coordinate system, each vertex of the manifold M has only two non-zero coordinates[1]. Moreover,\nthe fact that the i-th and the j-th coordinates of the vertex are not zeroes uniquely identifies the vertex. Hence\nthe vertices can be labelled by the indices of the non-zero\ncoordinates. The coordinates of vertex vi,j are\nvi,j = (0, ..., 0, pi , 0, ..., 0, pj , 0, ..., 0),\n\n(7)\n\nwhere\npi =\n\nEav −Ej\nEi −Ej\n\n(8)\n\npj =\n\nEav −Ei\nEj −Ei .\n\n(9)\n\nWe adopt the convention that the order of indices in vi,j\nis always such that Ei < Ej . Since, according to condition\n(5), both pi and pj should be non-negative, the vertex vi,j\nexists only when Ei ≤ Eav ≤ Ej . Denoting the numbers\nof energy levels below and above Eav by K and L, respectively, we can thus express the total number of vertices of\nmanifold M as\nNv = K * L.\n(10)\nObviously K + L = N . Therefore, dependent on the position of Eav within the energy spectrum, the value of Nv\nchanges between N − 1 and N 2 /4 (for even N ).\nIn order to implement the NR-algorithm, we will also\nneed to know which vertices vk,l are connected to a given\nvertex vi,j by a linear edge of manifold M . The criterion\nhere is that either k = i or l = j. Therefore, the total\nnumber Ne of edges originating from each vertex of M is\nNe = (K − 1) + (L − 1) = N − 2\n\n(11)\n\nThis number is thus exactly equal to the dimension of\nmanifold M for any value of Eav .\n\nFor the R-algorithm, we choose box B to be a high-dimensional\nhyper-rectangle (orthotop) enclosing manifold M . In this\nalgorithm, the modified basis vectors {b1 , b2 , ..., bN −2 }\nspecified at step 2 of the basic algorithm are chosen to be\northonormal, and then the edges of box B are oriented\nalong these vectors. The basis vectors {b1 , b2 , ..., bN −2 }\nare constructed with the help of the Gram-Schmidt procedure, which requires N − 2 non-collinear input vectors\ng1 , g2 , ..., gN −2 defined in the standard basis. Each new input vector gi is orthogonalized first with respect to bnrm\nand bE , and then with respect to all already available\nvectors bj .\nThe orientation of the resulting dimensions of box B\ndepends on the choice of the input vectors gi and on their\nsequence in the above Gram-Schmidt procedure. These\ninput vectors can be chosen randomly, but such a choice\nis a priori unlikely to be optimal: indeed, it is not (see\nSection 3). As illustrated in Fig. 2 by a two-dimensional\ncartoon, different orientations of rectangular boxes around\na polygon can clearly lead to different box volumes, and\nhence, according to formula (6), different acceptance rates.\nSuch a difference might be more dramatic in higher dimensions.\nWe have performed a partial optimisation of the box\norientations on the basis of the following idea: As one can\nsee in Fig. 2, a possibly economical way to put a box\naround the polyhedron M is to pick one face of this polyhedron to coincide with one face of the box.\nTo utilise this idea, we note that, according to Eqs.(35) each (N −3)-dimensional face of M is determined by the\nintersection of the hyperplane A with one of the (N − 1)dimensional hyperplanes given by condition pi = 0, that\nis, each face can be labeled as Fi by the index of the\ncorresponding eigenstate.\nSelecting the first input vector for the Gram-Schmidt\nprocedure as g1 = ei causes g1 to be orthogonal to Fi\n\n\fF. Hantschel and B. V. Fine: Monte-Carlo sampling of energy-constrained quantum superpositions ...\n\nthus guaranteeing that one of the resulting box faces will\ncoincide with Fi .\nSince each face Fi is associated with a different energy\nlevel Ei , different faces Fi are not equivalent. Therefore,\nthe question remains: Which of the N faces Fi should be\nchosen to coincide with a face of box B? Or, equivalently:\nWhich of the N natural basis vectors ei should be selected\nas g1 ? It should be further noted, that different faces Fi\nare, in general, non-orthogonal to each other. Therefore,\nonce one face Fi coincides with a face of the rectangular\nbox, such a coincidence cannot occur for other faces. Nevertheless, the resulting box volume may depend on the\nsequence of the remaining vectors gi used for the GramSchmidt procedure.\nBelow we investigated a limited group of boxes obtained by assigning each Gram-Schmidt input vector gi\nto be equal to one of the standard basis vectors ej . The\ninvestigation was conducted for the following 10-level energy spectrum representing a crudely discretised version\nof the Gaussian density of states symmetric with respect\nto zero energy:\n\ngroup index\ni\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n\nmin. box\nvolume Vi\n0.0992\n0.0848\n0.0848\n0.0848\n0.0848\n0.0848\n0.0848\n0.0848\n0.0848\n0.0848\n\n5\n\ndegeneracy\nfactor\n6\n1872\n6192\n6192\n7056\n7056\n6912\n6480\n4320\n72\n\nTable 1. Table summarising the investigation of rectangular\nbox volumes for energy spectrum (12) with Eav = −0.3. All\nGram-Schmidt input sequences of form (13) have been divided\ninto groups according to the the index of the standard basis\nvector ei used to define the first Gram-Schmidt input vector in\ng1 = ei . The left column labels these box groups. The middle\ncolumn gives the value of the minimum box volume Vi for each\ngroup. The right column contains the number of times the\nminimum volume Vi is encountered within the group.\n\n{Ei }i=1..10 = {−0.929, −0.679, −0.466, −0.273,\n−0.09, 0.09, 0.273, 0.466, 0.679, 0.929}\n(12)\n\nn=10\n3.0\n\naeaeaeaeae\nae\n\ng1 = ei1 ,\ng2 = ei2 ,\n... ,\ngN −2 = eiN −2 ,\n\nVol10 \u0090Vmin\n\nIt is the same spectrum as the one shown in Fig. 1.\nAll possible input sequences of type\n\n(13)\n\nhave been tried, and the resulting box volumes for each\nsequence were obtained. All input sequences were divided\ninto N groups with each group having the same standard\nbasis vector ei used as the first Gram-Schmidt input vector g1 . For each group, the minimum volume of box B was\nfound over all possible combinations of vectors ej used in\nthe rest of the Gram-Schmidt sequence. The results corresponding to Eav = −0.3 are summarised in Table 1. It was\nfound that the global minimum volume was encountered\nin nine out of ten groups, the exception being the group\ncorresponding to g1 = e1 with the minimum volume exceeding the global minimum by about 20 per cent. Within\neach group, there are multiple occurrences of the minimum volume. The number of these occurrences is referred\nto in Table 1 as the \"degeneracy factor\".\nFor other values of Eav , the qualitative character of the\nresults is the same as for Eav = −0.3. Namely, the choice\nof g1 = e1 for Eav < 0 and g1 = e10 for Eav > 0 does not\nallow one to reach the global minimum for the volume of\nbox B. Figure 3 presents the ratio V10 /Vmin as a function\nof Eav , where V10 is the minimum volume for the group\ncharacterised by g1 = e10 and Vmin is the global minimum\nvolume for all groups.\nAnother generic feature apparent from Table 1 is the\ngreater chance of encountering the global minimum (larger\ndegeneracy factor) for groups with g1 = ei , such that the\n\n2.5\nae\n\n2.0\n1.5\n1.0\n\nae\nae\nae\nae\nae\naeaeae\naeaeaeaeaeaeaeaeaeaeaeaeaeaeaeaeaeaeaeaeaeae\n\n-1.0\n\n-0.5\n\n0.0\n\n0.5\n\n1.0\n\nEav\nFig. 3. Plot of V10 /Vmin as a function of Eav , where V10 is the\nminimum volume for the box group characterised by g1 = e10 ,\nand Vmin is the minimum among all boxes considered (degeneracy factor).\n\ncorresponding energy level Ei is located in the middle of\nthe spectrum.\nWithin each group, the influence of the choice of consecutive input vectors g2 , ..., gN −2 on the resulting box\nvolume is complicated to describe for the present 10-level\nspectrum, and we do not attempt it here. We have, however, also conducted similar investigations for smaller spectra with N = 5 and N = 6, where a clear picture emerged.\nIn the both N = 5 and N = 6 cases, we have found that\n(i) the last input vector gN −2 does not confine the volume\nin any way; and (ii) the minimal box volume is realised,\nwhenever neither of the vectors g1 , ..., gN −3 is assigned to\nbe e1 or eN . Therefore, for each input group where the\nglobal minimum volume appears (that is, for g1 = ei1\nwith i1 = 2, ..., N − 1), the degeneracy factor is equal to\n3(N − 3)!. While such a result is valid for N = 5 and\nN = 6, it does not hold for N = 10 (see Table 1).\nOur final prescription for the R-algorithm is the following: At step 2 of the basic algorithm, we construct\northonormal modified basis vectors b1 , ..., bN −2 using the\n\n\f6\n\nF. Hantschel and B. V. Fine: Monte-Carlo sampling of energy-constrained quantum superpositions ...\nB\n\nM\n\n6 7\nj\n8 9\n10\n0.03 VB\n0.02\n0.01\n1\n2\n3\n4\ni\n\nM\n\nFig. 4. (Colour online) Cartoon of parallelogram-like box B\n(red parallelogram) enclosing the manifold M (black triangle).\nThe large dot denotes the \"origin vertex\" of M , while the arrows indicate the basis vectors used to create B.\n\n5\n\nFig. 5. Volumes of parallelogram-like boxes VB for different\nchoices of the origin vertex vi,j for the Gaussian spectrum of\nGram-Schmidt orthogonalization procedure with input vec- N = 10 and Eav = 0. Coordinates i and j are the indices of\ntors g1 = ei1 ,..., gN −2 = eiN −2 , where none of the vectors the chosen vertex vi,j . choice.\n\neik are equal to either e1 or eN , and otherwise vectors eik\nappear in the order of the proximity of the corresponding energies Eik to the arithmetic average of all energies\nin the spectrum. At step 5, we choose a rectangular box\nwith the edges oriented along vectors b1 , ..., bN −2 .\nIn each calculation, the above prescription can be partially controlled by doing random sampling of a large number of Gram-Schmidt input sequences {gk = eik } and\nthen checking that the volumes of the resulting boxes are\nnot smaller than the volume of the \"prescription box\".\nAll such tests performed in the specific cases presented in\nSection 3 have supported the above prescription.\n2.4 Non-rectangular box: NR-algorithm\n\nThe NR-algorithm uses non-rectangular parallelogram-like\nbox for B. In order to define such a box, one needs to specify one of the box vertices, which we refer to as the \"origin\nvertex\", and the N − 2 non-orthogonal edges originating\nfrom this vertex. As indicated by Eq.(10), each vertex of\nmanifold M also has exactly N − 2 edges originating from\nit. Therefore, the origin vertex of box B is chosen to coincide with one of the vertices of manifold M , and then the\ncorresponding N − 2 edges of the manifold M determine\nthe edge directions for box B. A two-dimensional cartoon\nof such an arrangement is shown in Fig. 4. The origin\nvertex also becomes the origin of the modified coordinate\nsystem, and the vectors of the modified basis are oriented\nalong the same N − 2 edge directions of box B.\nSuch a general algorithm still leaves the freedom of\nchoosing a vertex of manifold M as the origin vertex of\nbox B. The number of vertices of manifold M is given\nby Eq.(9). Below we explore the dependence of the box\nvolume on the choice of the origin vertex for the energy\nspectrum (12). A possible algorithm for the calculation\nof the volume of a parallelogram-like box is given in Appendix A\nAs explained in Section 2.2, each vertex is labeled as\nvi,j , where the two indices are such that Ei < Eav and\nEj > Eav . Figure 5 presents the results of box volume\ncalculations for for Eav = 0. In this case, E5 < Eav < E6 .\n\nEav\n0\n-0.04\n-0.08\n-0.10\n-0.46\n-0.5\n\nK\n5\n5\n5\n4\n3\n2\n\nL\n5\n5\n5\n6\n7\n8\n\nVmin\n9.93 10−3\n9.86 10−3\n9.64 10−3\n9.27 10−3\n8.20 10−3\n4.60 10−3\n\nRvol\n3.11\n3.11\n3.11\n2.97\n2.55\n1.88\n\nTable 2. Properties of the volumes of parallelogram-like boxes\nB for the 10-level energy spectrum (12) as a function of Eav .\nThe parameters of the table are defined in the text.\n\nTherefore, there exist 25 vertices vi,j with index i taking one of the values {1, 2, 3, 4, 5}, while index j may take\nvalues {6, 7, 8, 9, 10}. The results are presented as a threedimensional plot, where two horizontal axes represent vertex indices i and j and the vertical coordinate represents\nthe resulting volume. In this figure, the ratio Rvol of the\nmaximum volume Vmax over the minimum volume Vmin is\nRvol ≡\n\nVmax\n= 3.10627\nVmin\n\n(14)\n\nAs one can see from Fig. 5, there exist nine cases realizing\nthe minimum volume. They correspond to vertices of the\nform v1,j with arbitrary j, or vi,10 with arbitrary i. The\nmaximum volume corresponds to only one vertex v5,6 with\ntwo respective levels bracketing Eav from below and above.\nQualitative arguments explaining, why it is expected that\nsuch a situation is special, are given in Appendix B.\nWe have further investigated the characteristics of box\nvolumes, for several values of Eav and collected the results\nfor Vmin and Rvol in Table 2. This table demonstrates that\n(i) the ratio Rvol is the same for different values of Eav but\nagreeing values of K and L; and (ii) Rvol decreases with\ndecreasing number of vertices (equal to KL).\nOur final prescription for the NR-algorithm is to choose\nvertex v1,N as the origin vertex. (Since, from the computational viewpoint, the number of possible choices of the\norigin vertex is not large, one can always check the above\n\n\fF. Hantschel and B. V. Fine: Monte-Carlo sampling of energy-constrained quantum superpositions ...\n\nprescription by computing the box volumes for all possible\nchoices.)\n\n7\n\nN=10\n0.00014\n0.00012\n\n3 Performance of R- and NR-algorithms\nr\n\n0.00010\n\nThis section compares the performance of the algorithms\npresented in section 2.3 and 2.4 by looking at their acceptance rates. The following conditions were chosen:\n1) Number of states N was equal to 10, 12, or 14 ;\n2) Energy spectra represented discretised realisations\nof the Gaussian density of states similar to spectrum (12)\nwith arithmetic average of all energies equal to zero\n√ and\nroot-mean-squared deviation from zero equal to 1/ 2 .\n3) The average energy Eav was chosen between 0 and\n0.8E1 . (E1 is the minimum eigenenergy of the spectrum.)\nTable 3 contains the acceptance rates for three different algorithms: (i) non-optimised R-algorithm with random isotropic selection of Gram-Schmidt input vectors\ng1 , ..., gN −2 ; (ii) optimised R-algorithm with prescription\nfor the input Gram-Schmidt vectors given at the end of\nsubsection 2.3; and (iii) optimised NR-algorithm with prescription for choosing the origin vertex given at the end\nof subsection 2.4. We use non-optimised R-algorithm as a\nbenchmark for inefficient choice of box B, which allows us\nto judge the effect of optimising box B.\nAs one can see from Table 3, the value of acceptance\nrates r for all algorithms decreases rapidly with the increase of N to the extent that the sampling of Hilbert\nspaces with dimensions larger than 14 appears impractical with the present algorithms.\nFor a given spectrum, the acceptance rates also decrease with the increase of the ratio Eav /E1 . This fact is\nfurther illustrated in Fig. 6 for the R-algorithm applied to\nthe spectrum with N = 10. An interesting detail revealed\nby Fig. 6 is that the acceptance rate does not depend on\nEav for E1 < Eav < E2 .\nComparing the relative performance of the three algorithms, it can be observed from Table 3, that the optimisation of R- or NR- algorithm does not result in significant\nincrease of the acceptance rates for the values of Eav close\nto the centre of the spectrum. However, as the average\nenergy deviates from the centre the optimisation leads to\nthe increase of the acceptance rates by about a factor of 5.\nThe acceptance rates for optimised R- and NR-algorithms\nare close to each other for all combinations of parameters\nconsidered.\nThe decrease of the acceptance rates with the departure of Eav from the centre of the spectrum, as well as the\ninsensitivity of the algorithms to the optimisation for Eav\nclose to zero, can probably be attributed to the fact that,\naccording to section 2.2, the number of vertices of manifold M is maximal - equal to N 2 /4 - for Eav = 0, and\nthen it quickly decreases towards N − 1 as Eav deviates\nfrom zero. Larger number of vertices, supposedly indicates\nthat manifold M has more even shape, which fills a larger\nvolume fraction of any box around it irrespective of the\nbox orientation. On the contrary, the smaller number of\n\n0.00008\n0.00006\n0.00004\n0.00002\n0.00000\n-0.8\n\n-0.6\n\n-0.4\n\n-0.2\n\n0.0\n\nEav\n\nFig. 6. Plot of the acceptance rate r of the R-algorithm versus\nthe average energy Eav for the 10-level energy spectrum (12).\n\nvertices may imply more uneven shape of manifold M occupying a smaller fraction of any reasonably-shaped box,\nwith the occupied fraction being strongly dependent on\nthe box orientation.\n\n4 Conclusions\nThis paper described and optimised two algorithms for\nperforming Monte Carlo sampling of quantum superpositions in high-dimensional Hilbert spaces under the constraint on the energy expectation value. The two algorithms are distinguished by the shape of Monte-Carlo sampling boxes: either rectangular or parallelogram-like. The\noptimisation included finding the box orientations allowing smaller box sizes and, therefore, larger Monte-Carlo\nacceptance rates. Both algorithms were found to exhibit\nsimilar performances in the optimised form. The benefit of the optimisation in terms of algorithm's acceptance\nrate was found to be small for the values of Eav close to\nthe centre of the Gaussian-like spectra considered but increased by about factor of 5 as Eav moved to the wings of\nthe spectra. We have found that the largest dimension of\nHilbert space that can realistically be explored with these\nalgorithms is 14.\nOur efforts to optimise the choice of the sampling boxes\nalso indicate that for Eav close to the centres of energy\nspectra, the manifolds of interest are more even-shaped,\nwhile, in the more interesting regime of Eav being on the\nwings of the energy spectra, the resulting manifolds are\nmore uneven and difficult to sample.\n\nA Volume of high-dimensional\nparallelogram-like box\nIn order to determine the volume of an (N −2)-dimensional\nparallelogram-like box, the following algorithm can be applied iteratively. Each iterative step of this procedure is\nillustrated by Fig. 7.\nThe numerical routine begins by selecting one vertex\nas the origin and then determining all edges connecting\n\n\f8\n\nF. Hantschel and B. V. Fine: Monte-Carlo sampling of energy-constrained quantum superpositions ...\n\nN\n\nEav\n\nEav\nE1\n\n10\n12\n14\n10\n12\n14\n10\n12\n14\n\n0\n0\n0\n-0.46\n-0.63\n-0.83\n-0.73\n-1\n-1.31\n\n0\n0\n0\n0.5\n0.5\n0.5\n0.8\n0.8\n0.8\n\nR-algorithm\n(not optimised)\nrandom input\nto the\nGram-Schmidt pr.\n1.3 * 10−4\n2.1 * 10−6\n3 * 10−8\n1.6 * 10−5\n2.2 * 10−7\n2 * 10−9\n3.2 * 10−6\n5.5 * 10−8\n4 * 10−10\n\nR-algorithm\n(optimised)\n\nNR-algorithm\n(optimised)\n\n1.6 * 10−4\n2.8 * 10−6\n3 * 10−8\n5 * 10−5\n6.6 * 10−7\n1.2 * 10−8\n2.5 * 10−5\n2.7 * 10−7\n2 * 10−9\n\n1.6 * 10−4\n2.7 * 10−6\n4 * 10−8\n1.8 * 10−5\n7.2 * 10−7\n7 * 10−9\n2.7 * 10−5\n2.7 * 10−7\n2 * 10−9\n\nTable 3. Acceptance rates r of R- and NR- algorithms for several spectra and several values of Eav as described in the text.\n\nb1\n\ns1\n\nh1\n\nb2\nFig. 7. Cartoon of a two-dimensional parallelogram illustrating the calculation of the volume of high-dimensional\nparallelogram-like box. The volume (area) of this parallelogram is b2 h1 , where h1 is the height and b2 is the base side as\nindicated.\n\nthe origin vertex to the N − 2 neighbouring vertices. The\nvector basis which is defined by the set of all edges is\ndenoted as {b1 , b2 . . . bN −2 }.\nThe first iteration takes the subset of the basis vectors\n{b2 . . . bN −2 } and finds a normalised vector s1 which is\northogonal to each vector of the above subset. This is done\nby solving a system of linear equations for the orthogonalisation conditions. Once s1 is obtained, the following height\nparameter can be defined:\nh1 = (b1 * s1 )\n\n(15)\n\nThe second iteration finds a normalised vector s2 which\nis orthogonal to {b3 . . . bN −2 , s1 } and then finds the corresponding h2 .\nThe iterations are continued until hN −3 is found. The\nresulting volume of the box is then given by\nVB = |bN −2 | *\n\nN\n−3\nY\n\nhi\n\n(16)\n\ni=1\n\nB Maximum volume box in the NR-algorithm\nAccording to the results of Section 2.4, the maximum sampling box volume for the NR-algorithm corresponds to the\nchoice of the origin vertex vi,j such that Ei and Ej bracket\nthe average energy Eav . This choice is special because of\nthe geometrical factors described below .\n\nThe vertices connected by the common edges to vi,j\nform two groups: the first group consists of vertices vi,m\n(the same first index as for the origin vertex), while the\nsecond group consists of vn,j (the same second index as for\nthe origin vertex). As discussed in Section 2.2, each vertex\nvi,m in the first group has only two non-zero coordinates\npi and pm , where:\npi =\npm =\n\nEav −Em\nEi −Em\nEav −Ei\nEm −Ei .\n\n(17)\n(18)\n\nIn this group, the typical situation is that Ei is much closer\nto Eav than Em . Therefore, pi is close to 1, and pm is close\nto zero. In other words, most vertices of the first group\ncluster around the point (0, ..., 0, 1i , 0, ..., 0), where the notation 1i indicates that pi = 1. Likewise the vertices of\nthe second group cluster around (0, ..., 0, 1j , 0, ..., 0). This\nclustering results in relatively small angles between all basis vectors connecting the origin vertex to the vertices of\nthe same group, which presumably leads to a non-optimal\nchoice of box B around M .\n\nReferences\n1. B. V. Fine. Typical state of an isolated quntum system\nwith fixed energy and unrestricted participation of eigenstates. Phys. Rev. E, 80:051130, 2009.\n2. B. V. Fine and F. Hantschel. An alternative to the conventional micro-canonical ensemble. arXiv:1010.4673v1, 2010.\n3. D. C. Brody and L. P. Hughston. The quantum canonical\nensemble. J. Math. Phys., 39:6505–6508, 1998.\n4. W. K. Wooters. Random quantum states. Foundations of\nPhysics, 11:1365–1378, 1990.\n5. C. M. Bender, D. C. Brody, and D. W. Hook. Solvable\nmodel of quantum microcanonical states. J. Phys. A:\nMathematical amd General, 38:L607–L613, 2005.\n6. B. Fresch and G. J. Moro. Typicality in ensembles of quantum states: Monte carlo sampling versus analytical approximations. J. Phys. Chem. A, 113:14502–14513, 2009.\n7. B. Fresch and G. J. Moro. Emergence of equilibrium thermodynamic properties in quantum pure states. i. theory.\nThe Journal of Chemical Physics, 133, 2010.\n\n\fF. Hantschel and B. V. Fine: Monte-Carlo sampling of energy-constrained quantum superpositions ...\n8. B. Fresch and G. J. Moro. Emergence of equilibrium thermodynamic properties in quantum pure states. ii. analysis\nof a spin model system. The Journal of Chemical Physics,\n133, 2010.\n9. M. Mueller, D. Gross, and J. Eisert. Concentration of\nmeasure for quantum states with a fixed expectation value.\narXiv:1003.4982v2, 2010.\n10. M. E. Dyer and A. M. Frieze. On the complexity of computing the volume of a polyhedron. SIAM J. Comput.,\n17:967–974, 1988.\n11. J. Lawrence. Polytope volume computation. Mathematics\nof Computation, 57:259–271, 1991.\n12. T. Burger and P. Gritzmann. Finding optimal shadows of\npolytops. Discrete Comput. Geom., 24:219–239, 2000.\n13. M. Simonovits. How to compute the volume in high dimension? Math. Program., Ser. B, 97:337–374, 2003.\n\n9\n\n\f"}