{"id": "http://arxiv.org/abs/1111.1829v2", "guidislink": true, "updated": "2011-12-12T09:54:46Z", "updated_parsed": [2011, 12, 12, 9, 54, 46, 0, 346, 0], "published": "2011-11-08T08:45:15Z", "published_parsed": [2011, 11, 8, 8, 45, 15, 1, 312, 0], "title": "Fluctuation, Dissipation and the Arrow of Time", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.3397%2C1111.1135%2C1111.3988%2C1111.2139%2C1111.2094%2C1111.6588%2C1111.5792%2C1111.3338%2C1111.6570%2C1111.3350%2C1111.6321%2C1111.1711%2C1111.4931%2C1111.6560%2C1111.4816%2C1111.4425%2C1111.2682%2C1111.1083%2C1111.1685%2C1111.1700%2C1111.3227%2C1111.6160%2C1111.7042%2C1111.5666%2C1111.0190%2C1111.5647%2C1111.7193%2C1111.5859%2C1111.4541%2C1111.1829%2C1111.4965%2C1111.4020%2C1111.4636%2C1111.6573%2C1111.5429%2C1111.4907%2C1111.6215%2C1111.2938%2C1111.5920%2C1111.0383%2C1111.6462%2C1111.0746%2C1111.4172%2C1111.7008%2C1111.3012%2C1111.3275%2C1111.0516%2C1111.5744%2C1111.0039%2C1111.2166%2C1111.5012%2C1111.6295%2C1111.0773%2C1111.4633%2C1111.5822%2C1111.6176%2C1111.1172%2C1111.6334%2C1111.4656%2C1111.0421%2C1111.5359%2C1111.3048%2C1111.2369%2C1111.4435%2C1111.3418%2C1111.5760%2C1111.4761%2C1111.5640%2C1111.4464%2C1111.6867%2C1111.5756%2C1111.0603%2C1111.6150%2C1111.4775%2C1111.5900%2C1111.2365%2C1111.6609%2C1111.0589%2C1111.3856%2C1111.1852%2C1111.5419%2C1111.1268%2C1111.4609%2C1111.3990%2C1111.4940%2C1111.2247%2C1111.6757%2C1111.3761%2C1111.0148%2C1111.6788%2C1111.6526%2C1111.1128%2C1111.1570%2C1111.7130%2C1111.3977%2C1111.3193%2C1111.6555%2C1111.0228%2C1111.2298%2C1111.3008%2C1111.6121&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Fluctuation, Dissipation and the Arrow of Time"}, "summary": "The recent development of the theory of fluctuation relations has led to new\ninsights into the ever-lasting question of how irreversible behavior emerges\nfrom time-reversal symmetric microscopic dynamics. We provide an introduction\nto fluctuation relations, examine their relation to dissipation and discuss\ntheir impact on the arrow of time question.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.3397%2C1111.1135%2C1111.3988%2C1111.2139%2C1111.2094%2C1111.6588%2C1111.5792%2C1111.3338%2C1111.6570%2C1111.3350%2C1111.6321%2C1111.1711%2C1111.4931%2C1111.6560%2C1111.4816%2C1111.4425%2C1111.2682%2C1111.1083%2C1111.1685%2C1111.1700%2C1111.3227%2C1111.6160%2C1111.7042%2C1111.5666%2C1111.0190%2C1111.5647%2C1111.7193%2C1111.5859%2C1111.4541%2C1111.1829%2C1111.4965%2C1111.4020%2C1111.4636%2C1111.6573%2C1111.5429%2C1111.4907%2C1111.6215%2C1111.2938%2C1111.5920%2C1111.0383%2C1111.6462%2C1111.0746%2C1111.4172%2C1111.7008%2C1111.3012%2C1111.3275%2C1111.0516%2C1111.5744%2C1111.0039%2C1111.2166%2C1111.5012%2C1111.6295%2C1111.0773%2C1111.4633%2C1111.5822%2C1111.6176%2C1111.1172%2C1111.6334%2C1111.4656%2C1111.0421%2C1111.5359%2C1111.3048%2C1111.2369%2C1111.4435%2C1111.3418%2C1111.5760%2C1111.4761%2C1111.5640%2C1111.4464%2C1111.6867%2C1111.5756%2C1111.0603%2C1111.6150%2C1111.4775%2C1111.5900%2C1111.2365%2C1111.6609%2C1111.0589%2C1111.3856%2C1111.1852%2C1111.5419%2C1111.1268%2C1111.4609%2C1111.3990%2C1111.4940%2C1111.2247%2C1111.6757%2C1111.3761%2C1111.0148%2C1111.6788%2C1111.6526%2C1111.1128%2C1111.1570%2C1111.7130%2C1111.3977%2C1111.3193%2C1111.6555%2C1111.0228%2C1111.2298%2C1111.3008%2C1111.6121&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The recent development of the theory of fluctuation relations has led to new\ninsights into the ever-lasting question of how irreversible behavior emerges\nfrom time-reversal symmetric microscopic dynamics. We provide an introduction\nto fluctuation relations, examine their relation to dissipation and discuss\ntheir impact on the arrow of time question."}, "authors": ["Michele Campisi", "Peter Hänggi"], "author_detail": {"name": "Peter Hänggi"}, "author": "Peter Hänggi", "links": [{"title": "doi", "href": "http://dx.doi.org/10.3390/e13122024", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1111.1829v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1111.1829v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "12 pages, 3 figures. Minor Revisions. Accepted for publication in\n  Entropy, Special Issue \"Arrow of Time\", edited by C. Callender", "arxiv_primary_category": {"term": "physics.pop-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.pop-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1111.1829v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1111.1829v2", "journal_reference": "Entropy 13 (2011) 2024-2035", "doi": "10.3390/e13122024", "fulltext": "Submitted to Entropy. Pages 1 - 12.\nOPEN ACCESS\n\nentropy\nISSN 1099-4300\nwww.mdpi.com/journal/entropy\n\nArticle\n\narXiv:1111.1829v2 [physics.pop-ph] 12 Dec 2011\n\nFluctuation, Dissipation and the Arrow of Time\nMichele Campisi? and Peter Hänggi\nInstitute of Physics, University of Augsburg, Universitätsstr. 1, D-86135 Augsburg, Germany\n?\n\nAuthor to whom correspondence should be addressed; michele.campisi@physik.uni-augsburg.de\n\nVersion December 13, 2011 submitted to Entropy. Typeset by LATEX using class file mdpi.cls\n\n4\n\nAbstract: The recent development of the theory of fluctuation relations has led to new insights into the ever-lasting question of how irreversible behavior emerges from time-reversal\nsymmetric microscopic dynamics. We provide an introduction to fluctuation relations, examine their relation to dissipation and discuss their impact on the arrow of time question.\n\n5\n\nKeywords: work, entropy, second law, minus first law\n\n6\n\nClassification: PACS 1.70.+w 05.40.-a 05.70.Ln\n\n1\n2\n3\n\n7\n\n8\n\n9\n\n10\n\n11\n12\n\n13\n14\n15\n16\n17\n\n1.\n\nIntroduction\nIrreversibility enters the laws of thermodynamics in two distinct ways:\n\nEquilibrium Principle An isolated, macroscopic system which is placed in an arbitrary initial state\nwithin a finite fixed volume will attain a unique state of equilibrium.\nSecond Law (Clausius) For a non-quasi-static process occurring in a thermally isolated system, the\nentropy change between two equilibrium states is non-negative.\nThe first of these two principles is the Equilibrium Principle [1], whereas the second is the Second Law\nof Thermodynamics in the formulation given by Clausius [2,3]. Very often the Equilibrium Principle is\nloosely referred to as the Second Law of Thermodynamics, thus creating a great confusion in the literature. So much that proposing to raise the Equilibrium Principle to the rank of one of the fundamental\nlaws of thermodynamic became necessary [1]. Indeed it was argued that this Law of Thermodynamics,\n\n\fVersion December 13, 2011 submitted to Entropy\n\n18\n19\n20\n\n2 of 12\n\ndefining the very concept of state of equilibrium, is the most fundamental of all the Laws of Thermodynamics (which in fact are formulated in terms of equilibrium states) and for this reason the nomenclature\nMinus-First Law of Thermodynamics was proposed for it.\nFigure 1. Autonomous vs. nonautonomous dynamics. Top: Autonomous evolution of a gas\nfrom a non-equilibrium state to an equilibrium state (Minus-First Law). Bottom: Nonautonomous evolution of a thermally isolated gas between two equilibrium states. The piston\nmoves according to a pre-determined protocol specifying its position λt in time. The entropy\nchange is non-negative (Second Law).\n\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n\nThe Minus-First Law of Thermodynamics and the Second Law of Thermodynamics consider two very\ndifferent situations, see Fig. 1. The Minus-First Law deals with a completely isolated system that begins\nin non-equilibrium and ends in equilibrium, following its spontaneous and autonomous evolution. In the\nSecond Law one considers a thermally (but not mechanically) isolated system that begins in equilibrium.\nA time-dependent mechanical action perturbs the initial equilibrium, the action is then turned off and a\nfinal equilibrium will be reached, corresponding to higher entropy.1 At variance with the Minus-First\nLaw, here the system does not evolve autonomously, but rather in response to a driving: we speak in this\ncase of nonautonomous evolution.\nThe use of the qualifiers \"autonomous\" and \"nonautonomous\" reflects here the fact that the set of\ndifferential equations describing the microscopic evolution of the system are autonomous (i.e. they do\nnot contain time explicitly) in cases of the type depicted in Fig. 1, top, and are nonautonomous (i.e.\nthey contain time explictely) in cases of the type depicted in Fig. 1, bottom. Accordingly the Hamilton\nfunction is time independent in the former cases and time dependent in the latter ones (see Sec. 2 below).\nIn order to illustrate the necessity of clearly distinguishing between the two prototypical evolutions\ndepicted in Fig. 1, let us analyze one statement which is often referred to as the second law: after the\n1\n\nThat such final equilibrium state exists is dictated by the Minus-First Law. Here we see clearly the reason for assigning\na higher rank to the Equilibrium Principle\n\n\fVersion December 13, 2011 submitted to Entropy\n\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n\n54\n55\n\n56\n57\n58\n59\n60\n61\n62\n63\n64\n65\n66\n67\n68\n69\n\n3 of 12\n\nremoval of a constraint, a system that is initially in equilibrium reaches a new equilibrium at higher\nentropy [4]. While, after the removal of the constraint the system evolves autonomously (hence, in\naccordance to the equilibrium principle will eventually reach a unique equilibrium state), it is often overlooked the fact that the overall process is nevertheless described by a set of nonautonomous differential\nequations (because the removal of the constraint is an instance of a external time-dependent mechanical\nintervention) with the constrained equilibrium as initial state. Then, in accordance with Clausius principle the final state is of higher or same entropy. Thus, this formulation of the second law can be seen as\na special case of Clausius formulation that considers only those external interventions which are called\nconstraint removals.\nBoth the Minus-First Law and the Second Law have to do with irreversibility and the arrow of time.\nWhile since the seminal works of Boltzmann, the main efforts of those working in the foundations of\nstatistical mechanics were directed to reconcile the Minus-First Law with the time-reversal symmetric\nmicroscopic dynamics, recent developments in the theory of fluctuation relations, have brought new and\ndeep insights into the microscopic foundations of the Second Law. As we shall see below, fluctuation\ntheorems highlight in a most clear way the fascinating fact that the Second Law is deeply rooted in the\ntime-reversal symmetric nature of the microscopic laws of microscopic dynamics [5,6].\nThis connection is best seen if one considers the Second Law in the formulation given by Kelvin,\nwhich is equivalent to Clausius formulation [7]:\nSecond Law (Kelvin) No work can be extracted from a closed equilibrium system during a cyclic variation of a parameter by an external source.\nThe field of fluctuation theorems has recently gained much attention. Many fluctuation theorems have\nbeen reported in the literature, referring to different scenarios. Fluctuation theorems exist for classical\ndynamics, stochastic dynamics, and for quantum dynamics; for transiently driven systems, as well as\nfor non equilibrium steady states; for systems prepared in canonical, micro-canonical, grand-canonical\nensembles, and even for systems initially in contact with \"finite heat baths\" [8]; they can refer to different quantities like work (different kinds), entropy production, exchanged heat, exchanged charge,\nand even information, depending on different set-ups. All these developments including discussions of\nthe experimental applications of fluctuation theorems, have been summarized in a number of reviews\n[5,6,9,10].\nIn Sec. 2 we will give a brief introduction to the classical work Fluctuation Theorem of Bochkov\nand Kuzovlev [11], which is the first fluctuation theorem reported in the literature. The discussion of\nthis theorem suffices for our purpose of highlighting the impact of fluctuation theory on dissipation (Sec.\n3) and on the arrow of time issue (Sec. 4). Remarks of the origin of time's arrow in this context are\ncollected in Sec. (5)\n\n\fVersion December 13, 2011 submitted to Entropy\n\n70\n\n2.\n\n71\n\n2.1.\n\n72\n73\n74\n\n75\n76\n77\n78\n79\n80\n\nThe fluctuation theorem\nAutonomous dynamics\n\nConsider a completely isolated mechanical system composed of f degrees of freedom. Its dynamics\nare dictated by some time independent Hamiltonian H(q, p), which we assume to be time reversal\nsymmetric; i.e.,\nH(q, p) = H(q, −p)\n(1)\nHere (q, p) = (q1 . . . qf , p1 . . . pf ) denotes the conjugate pairs of coordinates and momenta describing\nthe microscopic state of the system.\nThe assumption of time-reversal symmetry implies that if [q(t), p(t)] is a solution of Hamilton equations of motion, then, for any τ , [q(τ − t), −p(τ − t)] is also a solution of Hamilton equations of motion.\nThis is the well known principle of microreversibility for autonomous systems [12].\nWe assume that the system is at equilibrium described by the Gibbs ensemble:\n%(q, p) = e−βH(q,p) /Z(β)\n\n81\n82\n83\n84\n85\n86\n87\n88\n89\n90\n\n91\n92\n93\n94\n95\n96\n97\n98\n99\n100\n\n4 of 12\n\n(2)\n\nR\nwhere Z(β) = dpdqe−βH(q,p) is the canonical partition function, and β −1 = kB T , with kB being the\nBoltzmann constant and T denotes the temperature.\nWe next imagine to be able to observe the time evolution of all coordinates and momenta within some\ntime span t ∈ [0, τ ]. Fluctuation theorems are concerned with the probability2 P [Γ] that the trajectory\nΓ is observed. We will reserve the symbol Γ to denote the whole trajectory (that is, mathematically\nspeaking, to denote a map from the interval [0, τ ] to the 2f dimensional phase space), whereas the\nsymbol Γt will be used to denote the specific point in phase space visited by the trajectory Γ at time t.\ne to observe Γ,\ne the\nThe central question is how the probability P [Γ] compares with the probability P [Γ]\net = εΓτ −t where ε(q, p) = (q, −p) denotes the time reversal operator.\ntime-reversal companion of Γ: Γ\nThe answer is given by the microreversibility principle which implies:\ne\nP [Γ] = P [Γ].\n\n(3)\n\nTo see this, consider the Hamiltonian dynamics but for the case that the trajectory Γ is not a solution\ne is also not a solution, and both the probabilities P [Γ] and P [Γ]\ne are trivially\nof Hamilton equations, then Γ\ne is a solution. Since\nzero. Now consider the case when Γ is solution of Hamilton equations, then also Γ\nthe dynamics are Hamiltonian, there is one and only one solution passing through the point Γ0 at time\nt = 0, then the probability P [Γ] is given by the probability to observe the system at Γ0 at t = 0. By\ne is given by %(Γ\ne0 ). Due to timeour equilibrium assumption this is given by %(Γ0 ) 3 . Likewise the P [Γ]\ne0 ) = H(εΓτ ) = H(Γτ ) = H(Γ0 ) implying\nreversal symmetry and energy conservation we have H(Γ\ne0 ) = %(Γ0 ), hence Eq. (3).\n%(Γ\nTo summarize, the micro reversibility principle for autonomous systems in conjunction with the hypothesis of Gibbsian equilibrium implies that the probability to observe a trajectory and its time-reversal\n2\n\nTo be more precise, the probability density functional (PDFL)\nTo be more precise P [Γ]DΓ = %(Γ0 )dΓ0 where DΓ is the measure on the Γ-trajectory space, and dΓ0 is the measure in\nphase space\n3\n\n\fVersion December 13, 2011 submitted to Entropy\n\n5 of 12\n\n103\n\ncompanion are equal. There is no way to distinguish between past and future in an autonomous system\nat equilibrium. Obviously, this is no longer so when the system is prepared out of equilibrium, as in Fig\n1, top.\n\n104\n\n2.2.\n\n101\n102\n\n105\n106\n107\n108\n109\n\nNonautonomous dynamics\n\nImagine now the nonautonomous case of a thermally insulated system driven through the variation\nof a parameter λt . Thermal insulation guarantees that the dynamics are still Hamiltonian. At variance\nwith the autonomous case though, now the Hamiltonian is time dependent. Without loss of generality we\nassume that the varying parameter, denoted by λt couples linearly to some system observable Q(q, p),\nso that the Hamiltonian reads:\nH(q, p; λt ) = H0 (q, p) − λt Q(q, p)\n\n110\n111\n112\n113\n114\n115\n116\n\n117\n118\n\nThis is the traditional form employed in the study of the fluctuation-dissipation theorem [13].4 In the\nfollowing we shall reserve the symbol λ (without subscript) to denote the whole parameter variation\nprotocol, and use the symbol λt , to denote the specific value taken by the parameter at time t. The\nsuccession of parameter values is assumed to be pre-specified (the system evolution does not affect the\nparameter evolution).\nWe assume that λt = 0 for t = 0 and that the system is prepared at t = 0 in the equilibrium Gibbs\nstate\n%0 (q, p) = e−βH0 (q,p) /Z0 (β) ,\n(5)\nR\nwhere Z0 (β) = dqdqe−βH0 (q,p) . We further assume that at any fixed value of the parameter the\nHamiltonian is time reversal symmetric:\nH(q, p; λt ) = H(q, −p; λt )\n\n119\n120\n121\n122\n123\n124\n125\n126\n127\n128\n129\n130\n\n(4)\n\n(6)\n\nNote here the fact that energy is not conserved in the nonautonomous case because the Hamiltonian\nis time-dependent in this case. Microreveresibility, as we have described it above, also does not hold:\ne is not. However\nGiven a protocol λ, if Γ is a solution of the Hamilton equations of motion, in general Γ\ne where λ\net = λτ −t .\ne is a solution of the equations of motion generated by the time-reversed protocol λ,\nΓ\nThis is the microreversibility principle for nonautonmous systems [5]. It is illustrated in Fig. 2. Despite\nits importance we are not aware of any text-books in classical (or quantum) mechanics that discusses it.\nA classical proof appears in [14, Sec. 1.2.3]. Corresponding quantum proofs were given in Refs. [15]\nand [5, See appendix B].\nAs with the autonomous case we can ask how the probability distribution P [Γ, λ] that the trajectory\ne that the reversed\ne λ]\nΓ is realized under the protocol λ, compares with the probability distribution P [Γ,\ne The answer to this was first given by Bochkov and\ne is realized under the reversed protocol λ.\ntrajectory Γ\nKuzovlev [11], who showed that\ne βW0\ne λ]e\nP [Γ, λ] = P [Γ,\n(7)\n4\n\nFor the sake of clarity we remark that the Hamiltonian describing the expansion of a gas, as depicted in Fig. 1, bottom,\nis not of this form. Our arguments however can be generalized to nonlinear couplings [11].\n\n\f6 of 12\n\nVersion December 13, 2011 submitted to Entropy\n\nFigure 2. Microreversibility for nonautonomous classical (Hamiltonian) systems. The initial\ncondition Γ0 evolves to Γτ under the protocol λ, following the path Γ. The time-reversed\ne\nfinal condition εΓτ evolves to the time-reversed initial condition εΓ0 under the protocol λ,\ne\nfollowing the path Γ.\n\np\n\nΓτ\nΓ, λ\n\nΓ0\n\nq\nεΓ0\n\ne\ne λ\nΓ,\n\nwhere\nW0 =\n\nZ\n\nεΓτ\n\nτ\n\ndtλt Q̇t .\n\n(8)\n\n0\n\n131\n132\n133\n134\n135\n136\n137\n138\n139\n140\n141\n142\n143\n144\n145\n146\n\nHere, Qt = Q(Γt ) denotes the evolution of the quantity Q along the trajectory Γ and W0 is the so called\n\"exclusive work\". As discussed in [5,16–18] yet another definition of work is possible, the so called\nR\n\"inclusive work\" W = − dtλ̇t Qt , leading to a different and equally important fluctuation theorem\ninvolving free energy differences [5,19,20]. Without entering the question about the physical meaning of\nthe two quantities W and W0 , it suffices for the present propose to notice that for a cyclic transformation\nW0 = W .5 In the remaining of this section we will restrict our analysis to cyclic transformations\n(λ0 = λτ ) in order to make contact with Kelvin postulate and to avoid any ambiguity regarding the\nusage of the word \"work\".\nJust like Eq. (3) constitutes a direct expression of the principle of microreversibility for autonomous\nsystems, so is Eq. (7) a direct expression of the more general principle of microreversibility for nonautonomous systems. Remarkably it expresses the second law in a most clear and refined way.\nIn order to see this it is important to realize that the work W0 is odd under time-reversal. This is so\nbecause W0 is linear in a quantity Q̇t , which is the time derivative of an even observable Q. The theorem\nsays that the probability to observe a trajectory corresponding to some work W0 > 0 under the driving\nλ is exponentially larger than the probability to observe the reversed trajectory (corresponding to −W0 )\ne This provides a statistical formulation of the second law\nunder the driving λ.\n5\n\nFor a detailed discussion on the differences between the two work expressions we refer the readers to Sect. III. A in the\ncolloquium [5].\n\n\f7 of 12\n\nVersion December 13, 2011 submitted to Entropy\n\n147\n148\n149\n150\n\nSecond Law (Fluctuation Theorem) Injecting some amount of energy W0 into a thermally insulated\nsystem at equilibrium at temperature T by the cyclic variation of a parameter, is exponentially (i.e.\nby a factor eW0 /(kB T ) ) more probable than withdrawing the same amount of energy from it by the\nreversed parameter variation.\nMultiplying Eq. (7) by e−βW0 and integrating over all Γ-trajectories, leads to the relation [11]:\n\n151\n\nhe−βW0 iλ = 1 .\n152\n153\n154\n\n(9)\n\nThe subscript λ in Eq. (9) is there to recall that the average is taken over the trajectories generated by the\nprotocol λ. In particular, the notation h*iλ denotes an nonequilibrium average.6 Combining Eq. (9) with\nJensen's inequality, hexp(x)i ≥ exp(hxi), leads to\nhW0 iλ ≥ 0 ,\n\n(10)\n\n158\n\nwhich now expresses Kelvin's postulate as a nonequilibrium inequality [11]. The quantum version of\nthe fluctuation theorems by Bochkov and Kuzovlev have been given only recently in Ref. [18]. This\nlatter reference in addition reports its microcanonical variant, which applies to the case when the system\nbegins in a state of well defined energy.\n\n159\n\n3.\n\n155\n156\n157\n\n160\n161\n162\n163\n\n164\n165\n166\n\nDissipation: Kubo's formula\n\nBefore we continue with the implications of the fluctuation theorem for the arrow of time question, it\nis instructive to see in which way the fluctuation theorem relates to dissipation.\nGiven the distribution P [Γ, λ], the distribution p[Q, λ] that a trajectory Q of the observable Q(q, p)\noccurs in the time span [0, τ ], can be formally expressed as:\nZ\np[Q, λ] = DΓP [Γ, λ]δ(Q − Q[Γ])\n(11)\nwhere δ denotes Dirac's delta in the Q-trajectory space, the integration is a functional integration over\n.\nall Γ-trajectories, and Q[Γ] is defined as Q[Γ]t = Q[Γt ].\nR\nMultiplying Eq. (3) by e−β λs Q̇s ds δ(Q − Q[Γ]) and integrating over all Γ-trajectories, one finds:\np[Q, λ]e−β\n\n167\n168\n\n170\n\nλs Q̇s ds\n\ne ,\ne λ]\n= p[Q,\n\n(12)\n\ne is the time reversal companion of Q: Q\net = Qτ −t . Now multiplying both sides of Eq. (12) by\nwhere Q\nQτ and integrating over all Q-trajectories, one obtains:\nhQτ e−β\n\n169\n\nR\n\nR\n\nλs Q̇s ds\n\ne τ ie\niλ = hQ\nλ\n\n(13)\n\neτ ie = hQ0 ie and that, due to causality, the value taken by the observable Q(q, p) at time\nNote that hQ\nλ\nλ\ne Therefore, the average presents\nt = 0 cannot be influenced by the subsequent evolution of the protocol λ.\n6\n\nThe nonequilibrium average h*iλ can be understood as an average over the work probability density function p[W0 ; λ],\nthat is the probability that the energy W0 is injected in the system during one realization of the driving protocol. It formally\nR\nRτ\nreads[5]: p[W0 ; λ] = dq0 dp0 ρ0 (q0 , p0 )δ[W0 − 0 λt Q̇(qt , pt )], where δ denotes Dirac's delta function, and (qt , pt ) is\nthe evolved of its initial (q0 , p0 ) under the driving protocol λ.\n\n\f8 of 12\n\nVersion December 13, 2011 submitted to Entropy\n\n171\n172\n\na manifest equilibrium average; that is to say that it is an average over the initial canonical equilibrium\n%0 (q, p). We denote this equilibrium average by the symbol h*i (with no subscript). Thus, Eq. (13) reads\n\n173\n\nhQτ e−β\n174\n\nR\n\nλs Q̇s ds\n\niλ = hQ0 i\n\nBy expanding the exponential in Eq. (14) to first order in λ, one obtains:\n\u001d\n\u001c Z τ\nλs Q̇s ds + O(λ2 ) .\nhQτ iλ − hQ0 i = β Qτ\n0\n\n175\n176\n177\n\n(14)\n\n(15)\n\nλ\n\nSince the bracketed expression on the rhs is already O(λ) we can replace the non-equilibrium average\nh*iλ with the equilibrium average h*i on the rhs. Further, since averaging commutes with time integration\none arrives, up to order O(λ2 ), at:\nZ τ\nhQτ Q̇s iλs ds ,\n(16)\nhQτ iλ − hQ0 i = β\n0\nZ τ\nhQ̇τ −s Q0 iλs ds .\n(17)\n= −β\n0\n\n185\n\nIn the second line we made use of the time-homogeneous nature of the equilibrium correlation function. This is the celebrated Kubo formula [13] relating the non equilibrium linear response of the quantity\nQ to the equilibrium correlation function φ(s, τ ) = hQτ Q̇s i. As Kubo showed it implies the fluctuationdissipation relation [21], linking, for example, the mobility of a Brownian particle to its diffusion coefficient [22], and the resistance of an electrical circuit to its thermal noise [23,24]\nThis classical derivation of Kubo's formula from the fluctuation theorem is a simplified version of the\nderivation given by Bochkov and Kuzovlev [11]. The corresponding quantum derivation was reported\nby Andrieux and Gaspard [15].\n\n186\n\n4.\n\n178\n179\n180\n181\n182\n183\n184\n\n187\n188\n189\n190\n\nImplications for the arrow of time question\n\nJarzynski has analyzed in a transparent way how the fluctuation theorem for the inclusive work, W ,\nmay be employed to make guesses about the direction of time's arrow [6]. Here we adapt his reasoning to\nthe case of the exclusive work, W0 , which appears in the fluctuation relation of Bochkov and Kuzovlev,\nEq. (7).\nJust imagine we are shown a movie of an experiment in which a system starting at temperature T =\n(kB β)−1 is driven by a protocol, and we are asked to guess whether the movie is displayed in the same\ndirection as it was filmed or in the backward direction, knowing that tossing of an unbiased coin decided\nthe direction of the movie. When the outcome is +(−), the movie is shown in the same(opposite)\ndirection as it was filmed. Imagine next that we can infer from the analysis of each single frame t the\ninstantaneous values λt and Qt taken by the parameter and its conjugate observable, respectively. With\nthese we can evaluate the work W0 for the displayed process using Eq. (8). Envision that we find, for\nthe shown movie that βW0 \u001d 1. If the film was shown in the \"correct\" direction it means that a process\ncorresponding to βW0 \u001d 1 occurred. If the film was shown backward then it means that a process\ncorresponding to βW0 \u001c −1 occurred (recall that W0 is odd under time-reversal). The fluctuation\ntheorem tells us that the former case occurs with an overwhelmingly higher probability relative to the\n\n\f9 of 12\n\nVersion December 13, 2011 submitted to Entropy\n\nFigure 3. Degree of belief P (+|W0 ) that a movie showing the nonautonomous evolution of\na system is shown in the same temporal order as it was filmed, given that the work W0 was\nobserved and that the direction of the movie was decided by the tossing of an unbiased coin.\n1\n\nP (+|W0 )\n\n0.75\n0.5\n0.25\n0\n−10\n\n−5\n\n0\n\n5\n\n10\n\nW0 [kB T ]\n\nprobability of the latter case. Then we can be very much confident that the film was running in the\ncorrect direction. Likewise if we observe βW0 \u001c −1, then we can say with very much confidence the\nthe film depicts the process in the opposite direction as it happened. Clearly when intermediate values\nof βW0 are observed we can still make well informed guesses about the direction of the movie, but with\nless confidence. The worst scenario arises when we observe W0 = 0, in which case we cannot make\nany reliable guess. The question then arises of how to quantify the confidence of our guesses. This is\na typical problem of Bayesian inference. Before we are shown the movie our degree of belief of the\noutcome +, is given by the prior, P (+) = 1/2 (likewise, P (−) = 1 − P (+) = 1/2). After we have seen\nthe movie the prior is updated to the posterior, P (+|W0 ), which is the degree of belief that the outcome\n+ occurred, given the observed work W0 . Using Bayes theorem, the posterior is given by\nP (+|W0 ) =\n191\n192\n193\n194\n\nP (W0 |+)\nP (+)\nP (W0 )\n\nwhere P (W0 |+) is the conditional probability to observe W0 given that + occurred, and P (W0 ) is\nthe probability to observe W0 ; i.e., P (W0 ) = P (W0 |+)P (+) + P (W0 |−)P (−). According to the\nfluctuation theorem P (W0 |+)/P (−W0 |+) = eβW0 and since W0 is odd under time reversal, P (W0 |−) =\nP (−W0 |+). Using these relations together with Eq. (18) one obtains:\nP (+|W0 ) =\n\n195\n196\n197\n198\n199\n200\n201\n202\n203\n204\n\n(18)\n\n1\n\n(19)\ne−βW0 + 1\nFigure 3 displays P (+|W0 ) as a function of W0 . As it should be P (+|W0 ) is larger than 1/2 for\npositive W0 , and vice versa, and is an increasing function of W0 . If W0 is large compared to β −1 , then\nP (+|W0 ) ' 1, and we can be almost certain that the movie was shown in the forward direction. Vice\nversa, if βW0 \u001c −1, then we can say with almost certainty that the movie has been shown backward.\nThe transition to certainty of guess occurs quite rapidly (in fact exponentially) around |βW0 | ' 5. Note\nthat that for an autonomous system W0 = 0, implying P (+|W0 ) = P (−|W0 ) = 1/2, meaning that,\nas we have elaborated above, there is no way to discern the direction of time's arrow in an autonomous\nsystem at equilibrium.\nSince the fluctuation theorem (7) holds as a general law regardless of the size of the system, it appears\nthat our ability to discern the direction of time's arrow does not depend on the system size. It is also\n\n\fVersion December 13, 2011 submitted to Entropy\n\n10 of 12\n\n206\n\nworth mentioning the role played by thermal fluctuations in shaping our guesses. Particularly, with a\ngiven observed value W0 , the lower the temperature, the higher is the confidence (and vice-versa).\n\n207\n\n5.\n\n205\n\n208\n209\n210\n211\n212\n213\n214\n215\n216\n217\n218\n219\n220\n221\n222\n223\n224\n225\n226\n227\n228\n229\n230\n231\n232\n233\n234\n235\n236\n237\n238\n239\n240\n241\n242\n\nRemarks\n\nIt emerges from our discussion regarding the arrow of time (Sec. 4), that the statistical character of\nthe Second Law becomes visible when the energies injected in a system, W0 , are of the same order of\nmagnitude as the thermal fluctuations, kB T , regardless of the system size. This means, that, in contrast to\nwhat is sometimes believed, work fluctuations happen and are experimentally observable in microscopic\nand macroscopic systems alike. As a matter of fact, experimental verifications of the fluctuation theorem\nhave been performed involving both microscopic systems, e.g. a single macromolecule [25,26], and\nmacroscopic systems, e.g., a torsional pendulum [27].\nAs we have mentioned in the introduction, traditionally the question of the emergence of the arrow of\ntime from microscopic dynamics have been addressed within the framework of the Minus-First Law. In\nall existing approaches the arrow of time emerges from the introduction of some extra ingredient which\nin turn then dictates the time direction. Typically, one resorts to a coarse-graining procedure of the\nmicroscopic phase space to describe some state variables. For example, this is so in the theory of Gibbs\nand related approaches, see, e.g., in Ref. [28]. The time arrow is then generated via the observation that\nsuch coarse grained quantities no longer obey time-reversal symmetric Hamiltonian dynamics. More\nfrequently, one resorts to additional assumptions which are of a probabilistic nature: Typical scenarios\nthat come to mind are (i) the use of Boltzmann Stossahlansatz in the celebrated Boltzmann kinetic theory,\n(ii) the assumption of initial molecular chaos in more general kinetic theories that are in the spirit of\nBogoliubov, or, likewise, with Fokker-Planck and master equation dynamics that no longer exhibit an\nexplicit time-reversal invariant structure [28,29]. All such additional elements then induce the result of\na direction in time with future not being equivalent with past any longer.\nHaving stressed the too often overlooked fact that the Second Law does not refer to the traditionally considered scenario of autonomously evolving systems, but rather to the case of nonautonomous\ndynamics, here we have focussed on the emergence of time's arrow in a driven system starting at equilibrium. Having based our derivation on the principle of nonautonomous microreversibility, Fig. 2, the\nquestion arises naturally regarding the origin of the time asymmetry in this case. It originates from\nthe combination of the following two elements: i) The introduction of an explicit time dependence of\nthe Hamiltonian, Eq. (4), ii) The particular shape of the initial equilibrium state, Eq. (5). The first\nbreaks time homogeneity thus determining the emergence of an arrow of time, while the second determines its direction. It is in particular the fact that the initial equilibrium is described by a probability\ndensity function which is a decreasing function of energy, that determines the ≥ sign in Eq. (10). An\nincreasing probability density function would result in the opposite sign [7,30,31]. In regard to breaking\ntime homogeneity, it is worth commenting that the assumption of nonautonomous evolution has to be\nregarded itself as a convenient and often extremely good approximation in which the evolution λ of the\nexternal parameter influences the system dynamics without being influenced minimally by the system.7\nThis indeed presupposes the intervention of a sort of Maxwell Demon (i.e., the experimentalist), who\n7\n\nIn principle, one should treat the external parameter itself as a dynamical coordinate, and consider the autonomous\nevolution of the extended system.\n\n\fVersion December 13, 2011 submitted to Entropy\n\n11 of 12\n\n245\n\npredisposes things in such a way that the wanted protocol actually occurs. This in turn evidences the\nphenomenological nature of the Second Law. It is not a law that dictates how things go by themselves,\nbut rather how they go in response to particular experimental investigations.\n\n246\n\nAcknowledgements\n\n243\n244\n\n248\n\nThis work was supported by the cluster of excellence Nanosystems Initiative Munich (NIM) and the\nVolkswagen Foundation (project I/83902).\n\n249\n\nReferences\n\n247\n\n250\n251\n252\n253\n254\n255\n256\n257\n258\n259\n260\n261\n262\n263\n264\n265\n266\n267\n268\n269\n270\n271\n272\n273\n274\n275\n276\n277\n278\n279\n\n1. Brown, H.R.; Uffink, J. The Origins of Time-Asymmetry in Thermodynamics: The Minus First\nLaw. Stud. Hist. Phil. Mod. Phys. 2001, 32, 525 – 538.\n2. Campisi, M. On the mechanical foundations of thermodynamics: the generalized Helmholtz theorem Stud. Hist. Phil. Mod. Phys. 2005, 36, 275 – 290.\n3. Campisi, M.; Kobe, D.H. Derivation of the Boltzmann principle. Am. J. Phys. 2010, 78, 608–\n615.\n4. Callen, H.B., Thermodynamics: an introduction to the physical theories of equilibrium thermostatics and irreversible thermodynamics; Wiley: New York, 1960.\n5. Campisi, M.; Hänggi, P.; Talkner, P. Colloquium: Quantum fluctuation relations: Foundations\nand applications. Rev. Mod. Phys. 2011, 83, 771–791.\n6. Jarzynski, C. Equalities and Inequalities: Irreversibility and the Second Law of Thermodynamics\nat the Nanoscale. Annu. Rev. Condens. Matter. Phys. 2011, 2, 329–351.\n7. Allahverdyan, A.; Nieuwenhuizen, T. A mathematical theorem as the basis for the second law:\nThomson's formulation applied to equilibrium. Physica A 2002, 305, 542 – 552.\n8. Campisi, M.; Talkner, P.; Hänggi, P. Finite bath fluctuation theorem. Phys. Rev. E 2009,\n80, 031145.\n9. Esposito, M.; Harbola, U.; Mukamel, S. Nonequilibrium fluctuations, fluctuation theorems, and\ncounting statistics in quantum systems. Rev. Mod. Phys. 2009, 81, 1665–1702.\n10. Seifert, U. Stochastic thermodynamics: principles and perspectives. Eur. Phys. J. B 2008,\n64, 423–431.\n11. Bochkov, G.N.; Kuzovlev, Y.E. General theory of thermal fluctuations in nonlinear systems. Zh.\nEksp. Teor. Fiz. 1977, 72, 238–247. [Sov. Phys. JETP 45, 125–130 (1977)].\n12. Messiah, A. Quantum Mechanics; North Holland: Amsterdam, 1962.\n13. Kubo, R. Statistical-mechanical theory of irreversible processes. I. J. Phys. Soc. Jpn. 1957,\n12, 570–586.\n14. Stratonovich, R.L. Nonlinear nonequilibrium thermodynamics II : advanced theory; Vol. 59,\nSpringer series in synergetics, Springer-Verlag: Berlin ; Heidelberg; New York, 1994.\n15. Andrieux, D.; Gaspard, P. Quantum Work Relations and Response Theory. Phys. Rev. Lett.\n2008, 100, 230404.\n16. Jarzynski, C. Comparison of far-from-equilibrium work relations. C. R. Phys. 2007, 8, 495–506.\n\n\fVersion December 13, 2011 submitted to Entropy\n\n280\n281\n282\n283\n284\n285\n286\n287\n288\n289\n290\n291\n292\n293\n294\n295\n296\n297\n298\n299\n300\n301\n302\n303\n304\n305\n306\n307\n308\n\n309\n310\n311\n\n12 of 12\n\n17. Horowitz, J.; Jarzynski, C. Comparison of work fluctuation relations. J. Stat. Mech.: Theory\nExp. 2007, p. P11002.\n18. Campisi, M.; Talkner, P.; Hänggi, P. Quantum Bochkov-Kuzovlev work fluctuation theorems.\nPhil. Trans. R. Soc. A 2011, 369, 291–306.\n19. Jarzynski, C. Nonequilibrium equality for free energy differences. Phys. Rev. Lett. 1997,\n78, 2690–2693.\n20. Crooks, G.E. Entropy production fluctuation theorem and the nonequilibrium work relation for\nfree energy differences. Phys. Rev. E 1999, 60, 2721–2726.\n21. Callen, H.B.; Welton, T.A. Irreversibility and Generalized Noise. Phys. Rev. 1951, 83, 34–40.\n22. Einstein, A. Investigations on the Theory of Brownian Movement; Methuen: London, 1926.\nreprinted (Dover, New York), 1956.\n23. Johnson, J.B. Thermal agitation of electricity in conductors. Phys. Rev. 1928, 32, 97–109.\n24. Nyquist, H. Thermal agitation of electric charge in conductors. Phys. Rev. 1928, 32, 110–113.\n25. Collin, D.; Ritort, F.; Jarzynski, C.; Smith S.B.; Tinoco, I.; Bustamante, C. Verification of the\nCrooks fluctuation theorem and recovery of RNA folding free energies Nature 2005, 437, 231–\n234.\n26. Liphardt. J.; Dumont, S.; Smith, S.B.; Tinoco, I.; Bustamante, C. Equilibrium information from\nnonequilibrium measurements in an experimental test of Jarzynski's equality (article) Science\n2002, 296, 1832–1836.\n27. Douarche, F.; Ciliberto, S.; Petrosyan, A.; Rabbiosi, I. An experimental test of the Jarzynski\nequality in a mechanical experiment. Europhys. Lett. 2005, 70, 593–599.\n28. Wu, T.-Y. On the Nature of Theories of Irreversible Processes. Int. J. Theor. Phys. 1969, 2, 325–\n343.\n29. Hänggi, P.; Thomas H. Stochastic Processes: Time-Evolution, Symmetries and Linear Response,\nPhys. Rep. 1982, 88, 207–319.\n30. Campisi, M. Statistical Mechanical Proof of the Second Law of Thermodynamics Based on Volume Entropy. Stud. Hist. Phil. Mod. Phys. 2008, 39, 181–194.\n31. Campisi, M. Increase of Boltzmann entropy in a quantum forced harmonic oscillator. Phys. Rev.\nE 2008, 78, 051123.\n\nc December 13, 2011 by the authors; submitted to Entropy for possible open access publication under\nthe terms and conditions of the Creative Commons Attribution License http://creativecommons.org/licenses/by/3.0/.\n\n\f"}