{"id": "http://arxiv.org/abs/0803.0688v3", "guidislink": true, "updated": "2009-01-16T15:04:30Z", "updated_parsed": [2009, 1, 16, 15, 4, 30, 4, 16, 0], "published": "2008-03-05T15:55:57Z", "published_parsed": [2008, 3, 5, 15, 55, 57, 2, 65, 0], "title": "Energy spectra of gamma-rays, electrons and neutrinos produced at\n  interactions of relativistic protons with low energy radiation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0803.0892%2C0803.1536%2C0803.2953%2C0803.3071%2C0803.1596%2C0803.0842%2C0803.1276%2C0803.0057%2C0803.2147%2C0803.0599%2C0803.2875%2C0803.1377%2C0803.3429%2C0803.2033%2C0803.3221%2C0803.0725%2C0803.1573%2C0803.2675%2C0803.2895%2C0803.3796%2C0803.3523%2C0803.4004%2C0803.2149%2C0803.2143%2C0803.4090%2C0803.1437%2C0803.3643%2C0803.0109%2C0803.3773%2C0803.1291%2C0803.1645%2C0803.0127%2C0803.0682%2C0803.3704%2C0803.3622%2C0803.0320%2C0803.3359%2C0803.1807%2C0803.3603%2C0803.2743%2C0803.2264%2C0803.0868%2C0803.0549%2C0803.1835%2C0803.4387%2C0803.4404%2C0803.0688%2C0803.4330%2C0803.1620%2C0803.1585%2C0803.3099%2C0803.0124%2C0803.3001%2C0803.2034%2C0803.0689%2C0803.0146%2C0803.3673%2C0803.4349%2C0803.0473%2C0803.4221%2C0803.3162%2C0803.3491%2C0803.2462%2C0803.0530%2C0803.2004%2C0803.0328%2C0803.4169%2C0803.3338%2C0803.3971%2C0803.0353%2C0803.0334%2C0803.0024%2C0803.2358%2C0803.2099%2C0803.1200%2C0803.0935%2C0803.0218%2C0803.1408%2C0803.0166%2C0803.3416%2C0803.1079%2C0803.1123%2C0803.3123%2C0803.1584%2C0803.0520%2C0803.0739%2C0803.2549%2C0803.0282%2C0803.3911%2C0803.4465%2C0803.3791%2C0803.0242%2C0803.0645%2C0803.2681%2C0803.3682%2C0803.2444%2C0803.1930%2C0803.0827%2C0803.3803%2C0803.4427%2C0803.1350&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Energy spectra of gamma-rays, electrons and neutrinos produced at\n  interactions of relativistic protons with low energy radiation"}, "summary": "We derived simple analytical parametrizations for energy distributions of\nphotons, electrons, and neutrinos produced in interactions of relativistic\nprotons with an isotropic monochromatic radiation field. The results on\nphotomeson processes are obtained using numerical simulations of proton-photon\ninteractions based on the public available Monte-Carlo code SOPHIA. For\ncalculations of energy spectra of electrons and positrons from the pair\nproduction (Bethe-Heitler) process we suggest a simple formalism based on the\nwell-known differential cross-section of the process in the rest frame of the\nproton. The analytical presentations of energy distributions of photons and\nleptons provide a simple but accurate approach for calculations of broad-band\nenergy spectra of gamma-rays and neutrinos in cosmic proton accelerators\nlocated in radiation dominated environments.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0803.0892%2C0803.1536%2C0803.2953%2C0803.3071%2C0803.1596%2C0803.0842%2C0803.1276%2C0803.0057%2C0803.2147%2C0803.0599%2C0803.2875%2C0803.1377%2C0803.3429%2C0803.2033%2C0803.3221%2C0803.0725%2C0803.1573%2C0803.2675%2C0803.2895%2C0803.3796%2C0803.3523%2C0803.4004%2C0803.2149%2C0803.2143%2C0803.4090%2C0803.1437%2C0803.3643%2C0803.0109%2C0803.3773%2C0803.1291%2C0803.1645%2C0803.0127%2C0803.0682%2C0803.3704%2C0803.3622%2C0803.0320%2C0803.3359%2C0803.1807%2C0803.3603%2C0803.2743%2C0803.2264%2C0803.0868%2C0803.0549%2C0803.1835%2C0803.4387%2C0803.4404%2C0803.0688%2C0803.4330%2C0803.1620%2C0803.1585%2C0803.3099%2C0803.0124%2C0803.3001%2C0803.2034%2C0803.0689%2C0803.0146%2C0803.3673%2C0803.4349%2C0803.0473%2C0803.4221%2C0803.3162%2C0803.3491%2C0803.2462%2C0803.0530%2C0803.2004%2C0803.0328%2C0803.4169%2C0803.3338%2C0803.3971%2C0803.0353%2C0803.0334%2C0803.0024%2C0803.2358%2C0803.2099%2C0803.1200%2C0803.0935%2C0803.0218%2C0803.1408%2C0803.0166%2C0803.3416%2C0803.1079%2C0803.1123%2C0803.3123%2C0803.1584%2C0803.0520%2C0803.0739%2C0803.2549%2C0803.0282%2C0803.3911%2C0803.4465%2C0803.3791%2C0803.0242%2C0803.0645%2C0803.2681%2C0803.3682%2C0803.2444%2C0803.1930%2C0803.0827%2C0803.3803%2C0803.4427%2C0803.1350&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We derived simple analytical parametrizations for energy distributions of\nphotons, electrons, and neutrinos produced in interactions of relativistic\nprotons with an isotropic monochromatic radiation field. The results on\nphotomeson processes are obtained using numerical simulations of proton-photon\ninteractions based on the public available Monte-Carlo code SOPHIA. For\ncalculations of energy spectra of electrons and positrons from the pair\nproduction (Bethe-Heitler) process we suggest a simple formalism based on the\nwell-known differential cross-section of the process in the rest frame of the\nproton. The analytical presentations of energy distributions of photons and\nleptons provide a simple but accurate approach for calculations of broad-band\nenergy spectra of gamma-rays and neutrinos in cosmic proton accelerators\nlocated in radiation dominated environments."}, "authors": ["S. R. Kelner", "F. A. Aharonian"], "author_detail": {"name": "F. A. Aharonian"}, "author": "F. A. Aharonian", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.78.034013", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0803.0688v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0803.0688v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "17 pages, 21 figures, published in Phys.Rev.D. We have corrected two\n  misprints in the text. We note that the correct expressions were used for\n  calculations in the previous versions of the paper, thus the misprints did\n  not have an impact on the figures", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0803.0688v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0803.0688v3", "journal_reference": "Phys.Rev.D78:034013,2008", "doi": "10.1103/PhysRevD.78.034013", "fulltext": "Energy spectra of gamma-rays, electrons and neutrinos produced at interactions of\nrelativistic protons with low energy radiation\n\narXiv:0803.0688v3 [astro-ph] 16 Jan 2009\n\nS.R. Kelner∗ and F.A. Aharonian†\nWe derived simple analytical parametrizations for energy distributions of photons, electrons, and\nneutrinos produced in interactions of relativistic protons with an isotropic monochromatic radiation\nfield. The results on photomeson processes are obtained using numerical simulations of protonphoton interactions based on the public available Monte-Carlo code SOPHIA. For calculations of\nenergy spectra of electrons and positrons from the pair production (Bethe-Heitler) process we suggest\na simple formalism based on the well-known differential cross-section of the process in the rest frame\nof the proton. The analytical presentations of energy distributions of photons and leptons provide\na simple but accurate approach for calculations of broad-band energy spectra of gamma-rays and\nneutrinos in cosmic proton accelerators located in radiation dominated environments.\nPACS numbers: 12.20.Ds, 13.20.Cz, 13.60.-r, 13.85.Qk\n\nI.\n\nINTRODUCTION\n\nIn astrophysical environments the density of lowenergy radiation often exceeds the density of the gas\ncomponent. Under such conditions, the interactions of\nultrarelativistic protons and nuclei with radiation can\ndominate over interactions with the ambient gas. These\ninteractions proceed through three channels: (i) inverse\nCompton scattering, pγ → pγ ′ , (ii) electron-positron pair\nproduction, p + γ → pe+ e− , and (iii) photomeson production, pγ → N + kπ. While the inverse Compton scattering does not have a kinematic threshold, the electronpositron pair production and the photomeson production processes take place when the energy of the photon in the rest frame of the projectile proton exceeds\n2me c2 ≃ 1 MeV and mπ c2 (1 + mπ /2mp ) ≃ 145MeV, respectively.\nThe process of inverse Compton scattering of protons is\nidentical to the inverse Compton scattering of electrons,\nbut the energy loss-rate of protons is suppressed by a factor of (me /mp )4 ≈ 10−13 . At energies above the threshold of production of electron-positron pairs this process\nis four orders of magnitude slower compare to the losses\ncaused by pair-production. Therefore, generally the inverse Compton scattering does not play significant role\neven in extremely dense radiation fields.\nThe cross-section of (e+ , e− ) pair production (often\ncalled as Bethe-Heitler cross-section) is quite large, but\nonly a small (≤ 2me /mp ) fraction of the proton energy is\nconverted to the secondary electrons. The cross-section\nof photomeson production is smaller, but instead a sub-\n\n∗ Moscow Institute of Engineering Physics, Kashirskoe sh.\n31,\nMoscow, 115409 Russia; Max-Planck-Institut für Kernphysik,\nSaupfercheckweg 1, D-6917 Heidelberg, Germany ; Electronic address: skelner@rambler.ru\n† Dublin Institute for Advanced Studies, 31 Fitzwilliam Place,\nDublin 2, Ireland;\nMax-Planck-Institut für Kernphysik,\nSaupfercheckweg 1, D-6917 Heidelberg, Germany; Electronic\naddress: Felix.Aharonian@mpi-hd.mpg.de\n\nstantial (10 percent or more) fraction of the proton energy is transferred to the secondary product. As a result,\nwhen the proton energy exceeds the π-meson production\nthreshold, the hadronic interactions of protons dominate\nover the pair-production.\nThe cross-section of pair-production is calculated with\na very high accuracy using the standard routines of quantum electrodynamics. The cross-sections of photomeson\nprocesses are provided from accelerator experiments and\nphenomenological studies. Generally, for astrophysical\napplications the data obtained in fixed target experiments with gamma-ray beams of energies from 150 MeV\nto 10 GeV are sufficient, especially in the case of broadband spectra of target photons, when the hadron-photon\ninteractions are contributed mainly from the region not\nfar from the energy threshold of the process.\nThe energy losses of protons in the photon fields, in\nparticular in the context of interactions of highest energy\ncosmic rays with 2.7 K cosmic microwave background radiation (CMBR), have been comprehensively studied by\nmany authors (see e.g. Refs. [1, 2, 3, 4, 5]). Less attention\nhas been given to calculations of the products energy distributions. Partly this can be explained by the fact that\nthe cross-sections of secondary electrons and gamma-rays\nwith the ambient photons significantly exceeds the crosssections of interactions of protons with the same target\nphotons. Therefore the electrons and gamma-rays cannot\nleave the active regions of their production, but rather\ntrigger electromagnetic cascades in the surrounding radiation and magnetic fields. The spectra of gamma-rays\nformed during the cascade development are not sensitive\nto the initial energy distributions, and therefore simple\napproximate approaches (see e.g. Refs. [6]) can provide\nadequate accuracies for calculations of the characteristics of optically thick sources. This does not concern,\nhowever, neutrinos which freely escape the source and\nthus have a undistorted imprint of parent protons. Moreover, at some specific conditions, the secondary electrons\nfrom the pair- and photomeson production processes can\ncool mainly through synchrotron radiation for which the\nsource can be optically thin (see e.g. [7, 8, 9, 10]). Thus\n\n\f2\nthe exact calculations of spectra of secondary electrons\nare quite important, since the synchrotron radiation of\nthese electrons carry direct information about the energy\nspectra of accelerated protons.\nThe interactions of hadrons with radiation fields can\nbe effectively modeled by Monte Carlo simulations of\ncharacteristics of secondary products. In particular, the\nSOPHIA code [11] provides an adequate tool for the comprehensive study of high energy properties of hadronic\nsources in which interactions of ultrarelativistic protons\nwith ambient low-energy photons dominate over other\nprocesses. At the same time, it is useful to have a complementary tool for study of radiation characteristics of\nhadronic sources, especially when one deals with simple scenarios, e.g. interactions of protons with a homogeneous and isotropic source of radiation in which the\nhadronic cascades (i.e. the next generation particles) do\nnot play an important role. Motivated by this objective,\nin this paper we develop a simple approach based on the\ndescription of the energy distributions of final products\nfrom the photomeson and electron-positron pair production processes in analytical forms which can be easily integrated in any complex model of hadronic interactions\nin high energy astrophysical sources. To a certain extent,\nthis paper can be considered as a continuation of our first\npaper [12] where we obtained analytical presentations for\nproton-proton interactions.\nII.\n\nPHOTOMESON PROCESSES\n\nThe formation of high energy gamma-rays, electrons and neutrinos in photomeson interactions proceeds\nthrough production and decay of non-stable secondary\nproducts, mainly π 0 and π ± -mesons:\nγ + p → n0 π 0 + n+ π + + n− π − + * * *\n\n(1)\n\nwhere n0 , n+ and n− are the numbers of produced pions.\nHereafter we will assume that the density of the ambient\nmedium is sufficiently low, thus the pions decay before\nthey interact with the surrounding gas, radiation and\nmagnetic fields. We will also assume that (i) both the\nrelativistic protons and the target low-energy photons are\nisotropically distributed, and (ii) the energy of colliding\nparticles\nǫ ≪ mπ c2 ,\n\nEp ≫ mp c2 ,\n\n(2)\n\nwhere ǫ is the energy of the target photon, mπ is the\nmass of π-meson (we will assume that m0π = m+\nπ ), and\nEp and mp are the energy and the mass of proton. Those\nconditions, which are always satisfied in astronomical environments, allows us to obtain simple analytical presentations for energy distributions of the final products of\nπ- decays - photons and leptons.\nThe total cross-section of inelastic γ-p interactions is\na function of the scalar Eγ ≡ (k * p)/mp , where k and p\nare four-momenta of the photon and proton. The scalar\n\nFigure 1: The total cross-section of the inelastic γ-p interactions as a function of energy of gamma-ray in the proton\nrest frame. The calculations have been performed using the\nroutine of the code SOPHIA [11].\n\nEγ is simply the energy of the photon in the proton rest\nframe. The total cross-section σ(Eγ ), calculated using the\nroutines of the code SOPHIA [11], is presented in Fig. 1.\nAlthough the production of pions dominate in the γ-p\ninteractions, some other channels, in particular the ones\nleading to production of K- and η-mesons, contribute\nnoticeably (up to 10 to 20 %) to the overall production\nof photons and leptons. These channels are taken into\naccount in our calculations presented below. They are\nbased on the SOPHIA code which allows simulations of\nall important processes belongs to γ-p interactions.\n\nA.\n\nProduction of gamma-rays\n\nThe inclusive cross-section of production of π 0 -mesons\ndσπ0 = S(k, p, pπ0 ) d3 pπ0\n\n(3)\n\ndepends on the momenta k, p, pπ0 of the photon, proton\nand π 0 -meson, respectively. Let's denote by\ndw = W (pπ0 , pγ ) d3 pγ\n\n(4)\n\nthe probability of decay of a π 0 -meson with momentum\npπ0 into a gamma-ray photon of momentum pγ in the\nvolume d3 pγ of the momentum space. Then\nZ\n3\ndσγ = 2 d pγ S(k, p, pπ0 ) W (pπ0 , pγ ) d3 pπ0\n(5)\ncan be treated as the inclusive cross-section of γ-rays\nproduction through the chain γ + p → n0 π 0 + * * * →\n2 n0 γ + * * * .\nFor isotropic distributions of initial particles, the final\nproducts will be isotropically distributed as well. Therefore for the determination of the energy spectra of γ-rays\nwe can use the inclusive cross-section given by Eq.(5) but\n\n\f3\nintegrated over the gamma-rays emission angles:\ndσγ ≡ Gγ (Ep , ǫ, cos θ, Eγ )\n\ndEγ\nEp\n\n(6)\n\nThe function Gγ depends on Ep , ǫ, Eγ , and the angle\nθ between the momenta of colliding proton and photon.\nThe corresponding differential interaction rate is\ndwγ = c (1 − cos θ) Gγ (Ep , ǫ, cos θ, Eγ )\n\ndEγ\n.\nEp\n\n(7)\n\nLet fp (Ep ) and fph (ǫ) be functions characterizing the\nenergy distributions of initial protons and photons, i.e.\nfp (Ep ) dEp and fph (ǫ) dǫ are the numbers of protons and\nphotons per 1 cm3 in the energy intervals dEp and dǫ.\nrespectively. Since it is assumed that the target photons\nare isotropically distributed, their angular distribution is\ndescribed as dΩ/4π. Then the production rate of γ-rays\n(i.e. number of γ-rays in the energy interval (Eγ , Eγ +\ndEγ ) per sec, per 1 cm3 ) can be obtained after integration\nof Eq. (7) over energies of protons and target photons, as\nwell as over the solid angle dΩ:\ndNγ (Eγ ) = dEγ\n\nZ\n\n(8)\n\nwhere\n4 ǫEp\n,\nm2p c4\n\nx=\n\nEγ\n.\nEp\n\nThen Eq.(8) can be written in the following form\nZ\ndNγ\ndEp\n= fp (Ep ) fph (ǫ) Φγ (η, x)\ndǫ .\ndEγ\nEp\n\n(10)\n\n(11)\n\nNote that Φγ can be treated as a function of two (but not\nthree) variables. This is connected with the fact that, as\nwe assume, at Ep → ∞ and ǫ → 0, Eγ → ∞, and for\nfixed x and η, the function Φγ should have a certain limit.\nIn other words, at the rescaling\nEp → λEp\n\nEγ → λEγ ,\n\nǫ → ǫ/λ ,\n\nNumerical calculations based on the code SOPHIA [11]\nshow that already at\nEp > 103 mp c2\n\nη ≥ η0 ≡ 2\n\nm2\nmπ\n+ π2 ≈ 0.313 ,\nmp\nmp\n\n(16)\n\nAs it follows from kinematics of production of a single\npion, the energy of the latter appears within\nEπ min ≤ Eπ ≤ Eπ max ,\n\n(17)\n\n(14)\n\nEπ min = Ep x−\n\n(18)\n\nare the maximum and minimum energies respectively,\nwith\nh\ni\np\n1\nη + r2 ± (η − r2 − 2r) (η − r2 + 2r) ,\nx± =\n2(1 + η)\n(19)\nwhere r = mπ /mp ≈ 0.146.\nLet's consider now the general case when the total\nmass of particles produced in proton-photon interactions\nis M + mπ . For example, the single-pion production implies M = mp , while in the case of two-pion production\nM = mp + mπ , etc. In this case the maximum and minimum energies of pions are\nẼπ max = Ep x̃+ ,\n\nẼπ min = Ep x̃− .\n\n(20)\n\nwith\nx̃± =\n±\n\n(12)\n\nwhere λ is an arbitrary number (λ > 1), the function\nΦγ is not changed, therefore the following relation takes\nplace.\nR\n(1 − cos θ) Gγ (λEp , ǫ/λ, cos θ, λEγ ) dΩ =\nR\n= (1 − cos θ) Gγ (Ep , ǫ, cos θ, Eγ ) dΩ .\n(13)\nǫ < 10−3 mπ c2 ,\n\n(15)\n\nwhere βp – is the proton speed (in the units of c).\nSince the protons are ultrarelativistic, we will assume\nβp = 1. If the condition of Eq.(15) is not satisfied,\nthen the interaction rate given by Eq.(7) is equal to zero.\nTherefore, for the case of 4ǫEp ≤ (2mπ mp + m2π )c4 , the\nfunction Φγ = 0. The integration of Eq.(11) should be\nperformed over the region1\n\nEπ max = Ep x+ ,\n\nLet's introduce the function Φγ defined as\nZ\ndΩ\n, (9)\nΦγ (η, x) ≡ c (1 − cos θ) Gγ (Ep , ǫ, cos θ, Eγ )\n4π\nη=\n\n2 ǫEp (1 − βp cos θ) > (2 mπ mp + m2π ) c4 ,\n\nwhere\n\ndEp dΩ\ndǫ fp (Ep ) fph (ǫ)×\nEp 4π\n\nc (1 − cos θ) Gγ (Ep , ǫ, cos θ, Eγ ) .\n\nthe relation given by Eq.(13) is readily fulfilled.\nSome features of the energy spectra of γ-rays can be\nunderstood from the analysis of the kinematics of the process. In particular, for production of a single π 0 -meson\nthe following condition should be satisfied\n\nh\n1\nη + r 2 + 1 − R2 ±\n2(1 + η)\n\ni\np\n(η + 1 − (R + r)2 ) (η + 1 − (R − r)2 ) ,\n\n(21)\n\nEπ min < Ẽπ min ,\n\n(22)\n\nwhere R = M/mp . In particular, for R = 1 Eqs. (19)\nand (21) coincide. For R > 1, we have the following\ninequalities\n\n1\n\nEπ max > Ẽπ max .\n\nFor determination of the region allowed by kinematics, we will\nassume mπ± = mπ0 = 0.137 GeV. Since on the boarder of this\nregion the function Φγ = 0, this approximation does not affect\nthe accuracy of numerical calculations.\n\n\f4\nThe decay of ultrarelativistic π 0 -mesons with energy\ndistribution Jπ (Eπ ) within the limits given by Eq.(17),\nresults in the energy spectrum of γ-rays\ndNγ\n=2\ndEγ\n\nEZ\nπ max\nE1\n\ndEπ\nJπ (Eπ ) ,\nEπ\n\nTable I: Numerical values of parameters Bγ , sγ and δγ characterizing the γ-ray spectra given by Eq.(11).\nη/η0\n\nEγ < Eπ max .\n\n(24)\n\nBelow we will be interested in γ-rays with energy Eγ >\nmπ /2. While in the energy range Eγ < Eπ min the differential spectrum of γ-rays is flat,\ndNγ\n=2\ndEγ\n\nEZ\nπ max\n\nEπ min\n\ndEπ\nJπ (Eπ ) ,\nEπ\n\n(25)\n\nwithin the interval Eπ min < Eγ < Eπ max the spectrum\ndecreases with energy,\ndNγ\n=2\ndEγ\n\nEZ\nπ max\nEγ\n\ndEπ\nJπ (Eπ ) .\nEπ\n\n(26)\n\n2\n1 + y2\n\n\u0013\u00152.5+0.4 ln(η/η0 )\n\n,\n\n(27)\n\nwhere\ny=\n\nx − x−\n.\nx+ − x−\n\n(28)\n\nAt low energies, x < x− , the spectrum does not depend\non x,\nΦγ (η, x) = Bγ ln 2\n\nBγ , cm3 /s\n\n1.2\n\n0.106 0.540 2.24 * 10−18\n\n1.3\n\n0.182 0.750 5.61 * 10−18\n\n1.4\n\n0.201 0.791 1.02 * 10−17\n\n1.5\n\n0.219 0.788 1.60 * 10−17\n\n1.6\n\n0.216 0.831 2.23 * 10−17\n\n1.7\n\n0.233 0.839 3.10 * 10−17\n\n1.8\n\n0.233 0.825 4.07 * 10−17\n\n1.9\n\n0.248 0.805 5.30 * 10−17\n\n2.0\n\n0.244 0.779 6.74 * 10−17\n\n3.0\n\n0.188 1.23 1.51 * 10−16\n\n4.0\n\n0.131 1.82 1.24 * 10−16\n\n5.0\n\n0.120 2.05 1.37 * 10−16\n\n6.0\n\n0.107 2.19 1.62 * 10−16\n\n7.0\n\n0.102 2.23 1.71 * 10−16\n\n8.0 0.0932 2.29 1.78 * 10−16\n9.0 0.0838 2.37 1.84 * 10−16\n\nThe above quantitative features of the spectrum of γrays appear quite useful for the choice of approximate\nanalytical presentations. The results of numerical calculations of the function Φγ based on simulations using\nthe code SOPHIA [11] can be approximated, with an accuracy better than 10% by simple analytical formulae.\nNamely, in the range x− < x < x+\n(\n\u0014 \u0012 \u0013\u0015δγ )\nx\n×\nΦγ (η, x) = Bγ exp −sγ ln\nx−\n\u0014 \u0012\n× ln\n\nδγ\n\n1.1 0.0768 0.544 2.86 * 10−19\n\n(23)\n\nwhere\n\u0013\n\u0012\nm2π c4\nE1 = max Eγ ,\n, Eπ min ,\n4Eγ\n\nsγ\n\n\u00012.5+0.4 ln(η/η0 )\n\n.\n\n10.0 0.0761 2.43 1.93 * 10−16\n20.0 0.107 2.27 4.74 * 10−16\n30.0 0.0928 2.33 7.70 * 10−16\n40.0 0.0772 2.42 1.06 * 10−15\n100.0 0.0479 2.59 2.73 * 10−15\n\nSOPHIA (histograms) and the analytical presentations\ngiven by Eqs. (27) and (29) for two values of η.\nEq.(11) provides a simple approach for calculations of\nγ-ray spectra for arbitrary energy distributions of ultrarelativistic protons and ambient photons. The parameters Bγ , sγ and δγ are quite smooth functions of η,\nthus for calculations of these parameters at intermediate values of η one can use linear interpolations of the\nnumerical results presented in Table I. Note that for interactions of protons with 2.7 K CMBR, the results presented in Table I allow calculations of γ-ray spectra up\nto ∼ 1021 eV.\n\n(29)\n\nFinally in the range x > x+ the function Φγ = 0.\nAll three parameters Bγ , sγ and δγ used in this presentation are functions of η. The numerical values of these\nparameters are shown in Table I. At η/η0 = 1, i.e. at\nthe threshold of π 0 -meson production, Bγ = 0. In Fig. 2\nwe show the functions x Φγ (η, x) obtained with the code\n\nB.\n\nProduction of electrons and neutrinos\n\nThe production of leptons in proton-photon interactions is dominated by the decay of secondary charged\npions. In analogy with Eq.(11), the spectrum of each\n\n\f5\n\nFigure 2: Gamma-ray spectra produced in photomeson interactions calculated for two values of η = 4ǫEp /m2p c4 . Solid lines are\ncalculated using the analytical presentations given by Eq.(11), the histograms are from simulations using the SOPHIA code.\n\ntype of leptons can be presented in the form\n\n1.\n\nEnergy spectra of positrons, muon antineutrinos and\nelectrons neutrinos\n\nNl (El ) dEl =\n= dEl\n\nZ\n\nfp (Ep ) fph (ǫ) Φl (η, x)\n\ndEp\ndǫ ,\nEp\n\n(30)\n\nwhere η is determined in Eq.(10), x = El /Ep and l implies one of the following symbols: e+ , e− , νμ , ν̄μ , νe , ν̄e .\nAs in the case of γ-rays, the energy range of leptons,\nfor the fixed values of Ep and ǫ is determined by kinematics. We obtained analytical forms for the energy spectra\nfor all lepton types, Φl , using numerical results of simulations the SOPHIA code. In the range of x′− < x < x′+\n\u0014 \u0012 \u0013\u0015δl )\nx\n×\nΦl (η, x) = Bl exp −sl ln ′\nx−\n(\n\n\u0014 \u0012\nln\n\n2\n1 + y ′2\n\n\u0013\u0015ψ\n\n,\n\n(31)\n\nwhere\ny′ =\n\nx − x′−\n.\nx′+ − x′−\n\n(32)\n\nIn range of x < x′− , the function Φl does not depend on\nx:\nψ\n\nΦl (η, x) = Bl (ln 2) .\n\n(33)\n\nFor x ≥ x′+ the function Φl = 0. The analytical presentation in the form of Eq.(31) contains three parameters\nsl , δl and Bl which themselves are functions of η. The\nnumerical values of these parameters obtained with the\nmethod of least squares are tabulated in Table II (for e+ ,\nν̄μ , νμ and νe ) and Table III (for e− and ν̄e ). The values\nof x′± and ψ are given below for each type of leptons.\n\nFor e+ , ν̄μ and νe , the parameter ψ is presented in the\nform\n\u0012 \u0013\nη\nψ = 2.5 + 1.4 ln\n,\n(34)\nη0\n\nwith\n\nx−\nand x′+ = x+ ,\n(35)\n4\nwhere x+ and x− are determined from Eq.(19); η0 is\ndefined in Eq.(16). Note that here ψ is different than\nthe relevant function in Eq.(27). In Fig. 3 and Fig. 4 the\nanalytical presentations of distributions x Φe+ and x Φν̄μ\nare compared with Monte-Carlo simulations based on the\nSOPHIA code.\n\u0010 \u00112\nmπ\nπ\nIn the range η < 4 m\n= 2.14 η0 , only a sinmp + 4 mp\nx′− =\n\ngle π + -meson can be produced. It decays to π + → μ+ νμ .\nThe positrons and muon antineutrinos are produced from\nthe decay μ+ → e+ ν̄μ νe . Since the spectra of e+ and ν̄μ\nfrom the decay of μ+ coincide (see e.g. [13]), the parameters in the Tables II calculated for e+ and ν̄μ for small\nη should be identical. The slight difference at η < 2η0\nis explained by fluctuations related to the the statistical\ncharacter of simulations.\nAt η > 2.14 η0 , a new channel is opened for production of ν̄μ , because of production of π − -mesons and their\ndecay: π − → μ− ν̄μ . Therefore for large values of η the\nparameters characterizing e+ and ν̄μ differ significantly\n(see Table II). This can be seen from comparison of results presented in right panels of Fig. 3 and 4; for η = 30,\nx Φν̄μ significantly exceeds x Φe+ .\n2.\n\nMuon neutrinos\n\nThe distribution for νμ is described by Eq.(31) with the\nsame function ψ as for e+ , ν̄μ and νe , given by Eq.(34),\n\n\f6\nTable II: Numerical values of parameters sl , δl , and Bl for e+ , ν̄μ , νμ , νe .\nη/η0\n\nse+\n\nδe+ Be+ , cm3 /s\n\nsν̄μ\n\nδν̄μ Bν̄μ , cm3 /s\n\ns νμ\n\nδν μ\n\nBνμ , cm3 /s\n\n0.0\n\n0.0\n\ns νe\n\nδνe Bνe , cm3 /s\n\n1.1\n\n0.367 3.12 8.09 * 10−19\n\n0.365 3.09 8.09 * 10−19\n\n1.08 * 10−18\n\n0.768 2.49 9.43 * 10−19\n\n1.2\n\n0.282 2.96 7.70 * 10−18\n\n0.287 2.96 7.70 * 10−18 0.0778 0.306 9.91 * 10−18\n\n0.569 2.35 9.22 * 10−18\n\n1.3\n\n0.260 2.83 2.05 * 10−17\n\n0.250 2.89 1.99 * 10−17\n\n0.242 0.792 2.47 * 10−17\n\n0.491 2.41 2.35 * 10−17\n\n1.4\n\n0.239 2.76 3.66 * 10−17\n\n0.238 2.76 3.62 * 10−17\n\n0.377 1.09\n\n4.43 * 10−17\n\n0.395 2.45 4.20 * 10−17\n\n1.5\n\n0.224 2.69 5.48 * 10−17\n\n0.220 2.71 5.39 * 10−17\n\n0.440 1.06\n\n6.70 * 10−17\n\n0.31 2.45 6.26 * 10−17\n\n1.6\n\n0.207 2.66 7.39 * 10−17\n\n0.206 2.67 7.39 * 10−17\n\n0.450 0.953 9.04 * 10−17\n\n0.323 2.43 8.57 * 10−17\n\n1.7\n\n0.198 2.62 9.52 * 10−17\n\n0.197 2.62 9.48 * 10−17\n\n0.461 0.956 1.18 * 10−16\n\n0.305 2.40 1.13 * 10−16\n\n1.8\n\n−16\n\n0.193 2.56 1.20 * 10\n\n−16\n\n0.193 2.56 1.20 * 10\n\n−16\n\n0.451 0.922 1.32 * 10\n\n0.285 2.39 1.39 * 10−16\n\n1.9\n\n0.187 2.52 1.47 * 10−16\n\n0.187 2.52 1.47 * 10−16\n\n0.464 0.912 1.77 * 10−16\n\n0.270 2.37 1.70 * 10−16\n\n2.0\n\n0.181 2.49 1.75 * 10−16\n\n0.178 2.51 1.74 * 10−16\n\n0.446 0.940 2.11 * 10−16\n\n0.259 2.35 2.05 * 10−16\n\n3.0\n\n0.122 2.48 3.31 * 10−16\n\n0.123 2.48 3.38 * 10−16\n\n0.366 1.49\n\n3.83 * 10−16\n\n0.158 2.42 3.81 * 10−16\n\n4.0\n\n0.106 2.50 4.16 * 10−16\n\n0.106 2.56 5.17 * 10−16\n\n0.249 2.03\n\n5.09 * 10−16\n\n0.129 2.46 4.74 * 10−16\n\n5.0 0.0983 2.46 5.57 * 10−16 0.0944 2.57 7.61 * 10−16\n\n0.204 2.18\n\n7.26 * 10−16\n\n0.113 2.45 6.30 * 10−16\n\n6.0 0.0875 2.46 6.78 * 10−16 0.0829 2.58 9.57 * 10−16\n\n0.174 2.24\n\n9.26 * 10−16 0.0996 2.46 7.65 * 10−16\n\n7.0 0.0830 2.44 7.65 * 10−16 0.0801 2.54 1.11 * 10−15\n\n0.156 2.28\n\n1.07 * 10−15 0.0921 2.46 8.61 * 10−16\n\n8.0 0.0783 2.44 8.52 * 10−16 0.0752 2.53 1.25 * 10−15\n\n0.140 2.32\n\n1.19 * 10−15 0.0861 2.45 9.61 * 10−16\n\n9.0 0.0735 2.45 9.17 * 10−16 0.0680 2.56 1.36 * 10−15\n\n0.121 2.39\n\n1.29 * 10−15 0.0800 2.47 1.03 * 10−15\n\n10.0 0.0644 2.50 9.57 * 10−16 0.0615 2.60 1.46 * 10−15\n\n0.107 2.46\n\n1.40 * 10−15 0.0723 2.51 1.10 * 10−15\n\n30.0 0.0333 2.77 3.07 * 10−15 0.0361 2.78 5.87 * 10−15 0.0705 2.53\n\n5.65 * 10−15 0.0411 2.70 3.55 * 10−15\n\n100.0 0.0224 2.86 1.58 * 10−14 0.0228 2.88 3.10 * 10−14 0.0463 2.62\n\n3.01 * 10−14 0.0283 2.77 1.86 * 10−14\n\nFigure 3: Energy spectra of positrons produced in photomeson interactions calculated for two values of η = 4ǫEp /m2p c4 . Solid\nlines are calculated using the analytical presentations, the histograms are from Monte-Carlo simulations using the SOPHIA\ncode.\n\nbut with different parameters x′± :\n\n\n0.427 x+ ,\nρ < 2.14 ,\n\n\n′\nx+ = (0.427 + 0.0729 (ρ − 2.14)) x+ , 2.14 < ρ < 10 ,\n\n\n x+ ,\nρ > 10 ,\n(36)\n\nwhere ρ = η/η0 , and\nx′− = 0.427 x− .\n\n(37)\n\nThe difference of values of x± for ν̄μ and νμ appears for\nthe following reason. At the decay π + → μ+ ν̄μ the maximum energy of ν̄μ is equal to (1−m2μ /m2π ) Eπ ≈ 0.427 Eπ ,\n\n\f7\n\nFigure 4: The same as in Fig. 3 but for muon antineutrinos.\n\nFigure 5: The same as in Fig. 3 but for muon neutrinos.\n\nwhere mμ is the mass of muon. On the other hand, the\nmaximum energy of ν̄μ , produced at decay of the muon\nis equal to Eπ . With an increase of the parameter η, π − mesons start to be produced, the decay of which leads\nto νμ with maximum energy comparable to the energy of\nthe pion (a detailed discussion of these questions can be\nfound in [12]).\nIn Fig. 5 the function x Φνμ (η, x) is shown. The\nhistograms are from Monte-Carlo simulations using the\nSOPHIA code, and the solid lines correspond to the analytical approximations.\n\n3.\n\nEπ\n\nmax\n\n= xmax Ep ,\n\nEπ min = xmin Ep , ,\n\n(39)\n\nwhere\nx max\n=\nmin\n\n\u0011\n\u0010\np\n1\nη − 2 r ± η (η − 4 r (1 + r)) . (40)\n2 (1 + η)\n\nThen x′+ = xmax and x′− = xmin /2. Eq.(40) is obtained\nfrom Eq.(21) if one sets R = 1 + r. These functions\ntogether with\n\nElectrons and electron antineutrinos\n\nThe electrons and electron antineutrinos are produced\nthrough the decay μ− , which in its turn is a product\nof the decay of π − -meson. Therefore, for production of\ne− and ν̄e , at least two pions should be produced. The\nproduction of two pions is energetically allowed if\n′′\nη > ηmin\n= 4 r (1 + r) ≈ 2.14η0 .\n\nThe maximum and minimum energies of the pion correspondingly are\n\n(38)\n\n\u0011\n\u0010\nψ = 6 1 − e1.5 (4−ρ) Θ(ρ − 4) ,\n\nρ=\n\nη\n,\nη0\n\n(41)\n\ndetermine the distributions for e− and ν̄e given in a general form by Eqs. (31) - (33); Θ(ρ) is the Heaviside function (Θ(ρ) = 0 if ρ < 0 and Θ(ρ) = 1 if ρ ≥ 0).\n\n\f8\nTable III: Numerical values of parameters sl , δl and Bl for\nelectrons and electron antineutrinos\nη/η0 se− δe− Be− , cm3 /s\nsν̄e\nδν̄e Bν̄e , cm3 /s\n3.0\n\n0.658 3.09 6.43 * 10−19\n\n0.985 2.63 6.61 * 10−19\n\n4.0\n\n−18\n\n0.348 2.81 9.91 * 10\n\n0.378 2.98 9.74 * 10−18\n\n5.0\n\n0.286 2.39 1.24 * 10−16\n\n0.31 2.31 1.34 * 10−16\n\n6.0\n\n0.256 2.27 2.67 * 10−16\n\n0.327 2.11 2.91 * 10−16\n\n7.0\n\n0.258 2.13 3.50 * 10−16\n\n0.308 2.03 3.81 * 10−16\n\n8.0\n\n0.220 2.20 4.03 * 10−16\n\n0.292 1.98 4.48 * 10−16\n\n9.0\n\n0.217 2.13 4.48 * 10−16\n\n0.260 2.02 4.83 * 10−16\n\n10.0 0.192 2.19 4.78 * 10−16\n\n0.233 2.07 5.13 * 10−16\n\n30.0 0.125 2.27 1.64 * 10−15\n\n0.135 2.24 1.75 * 10−15\n\n100.0 0.0507 2.63 4.52 * 10−15 0.0770 2.40 5.48 * 10−15\n\nIII. PHOTONS AND LEPTONS PRODUCED AT\nINTERACTIONS OF PROTONS WITH 2.7K\nCMBR\n\nIn this section we compare the energy spectra of\ngamma-rays, neutrinos, and electrons produced at photomeson interactions. For monoenergetic protons interacting with a radiation field with energy distribution\nfph (ǫ), the energy spectra of photons and leptons can be\nreduced to the calculation of a one-dimensional integral\ndN\n=\ndx\n\nZ∞\nfph (ǫ) Φ(η, x) dǫ ,\n\n(42)\n\n(multiplicity) produced in one inelastic interaction of protons with 2.7 K CMBR as a function of proton energy.\nThe results of numerical calculations are obtained using\nthe energy spectra of secondary photons, electrons and\nneutrinos, and the total cross-section shown in Fig 1.\nNote that below the threshold of production of two pions\none should have the following relations\n1\nhnγ i + hne+ i = 1 ,\n2\n\nwhere ǫ0 =\nand x = E/Ep is the fraction\nof energy of the protons transferred to the given type of\nsecondary particle; Φ is one of the functions described in\nthe previous section.\nIn Fig. 6 and 7 we show the energy spectra of γrays and electrons (left panels) and all neutrino types\n(right panels) produced by protons of energy 1020 eV and\n1021 eV interacting with blackbody radiation of temperature T = 2.7 K. The results depend only on the product Ep × T , therefore they can be easily rescaled to a\nblackbody radiation of an arbitrary temperature. The\nchosen radiation field and proton energies are of great\npractical interest in the context of origin and intergalactic propagation of ultrahigh energy cosmic rays. Because\nof interactions with the intergalactic radiation fields, ultrahigh energy γ-rays achieve the observer from distances\nless than 1 Mpc (see e.g. Ref. [14]). The electrons rapidly\ncool via synchrotron radiation or, in the case of very small\nintergalactic magnetic field, initiate electromagnetic cascades supported by interactions of electrons and gammarays with the 2.7 K CMBR. Only neutrinos freely penetrate through intergalactic radiation and magnetic fields\nand thus carry a clear imprint of parent protons.\nIn Fig. 8 we show the average number of secondaries\n\n(43)\n\nThe results of calculations based on approximate analytical presentations of functions Φl satisfy these relations\nwith an accuracy of better than 5%.\nNote that at very low energies the average number\nof γ-rays hnγ i appears smaller than average number of\npositrons hne+ i. This, at first glance unexpected result\nis actually a direct consequence of the experimental fact\nthat near the threshold the total cross-section σπ+ of π +\nproduction significantly exceeds σπ0 (see Fig. 9).\nIV.\n\nPRODUCTION OF ELECTRON-POSITRON\nPAIRS\n\nAt energies below the photomeson production, the\nmain channel of inelastic interactions for protons with\nambient photons proceeds through the direct production\nof electron-positron pairs. In the rest frame of the proton,\nthis process is described by the so-called Bethe-Heitler\ncross-section. In astrophysical environments, the process\nis more often realized when ultrarelativistic protons collides with low-energy photons,\n\nǫ0\n\nη0 m2p c4 /(4Ep ),\n\nhne+ i = hnν̄μ i = hnνμ i .\n\np + γ → e+ + e− + p\n\n(44)\n\nThe process is energetically allowed when\nγp ǫ > m e c 2 ,\n\n(45)\n\nwhere γp = Ep /mp c2 is the proton Lorentz factor, ǫ is the\nsoft photon energy, and me is the mass of electron. The\nmaximum energy of the electron (positron) is determined\nby the kinematics of the process\nEe max =\n\nγp\n1 + 4γp ǫ/(mp c2 )\n\n\u0012q\n\u00132\nq\nγp ǫ + γp ǫ − m e c 2 .\n\n(46)\nThis equation is valid when γp ≫ 1 and ǫ ≪ mp γp c2 . In\nthe interval\nm e c 2 ≪ γp ǫ ≪ m p c 2\n\n(47)\n\nthe maximum electron energy is\nEe max = 4 γp2 ǫ ,\n\n(48)\n\nThis applies for Ee max ≪ Ep . In the limit of γp ǫ ≫ mp c2\nEe max = mp c2 γp = Ep ,\n\n(49)\n\n\f9\n\nFigure 6: The energy spectra of stable products of photomeson interactions of a proton of energy Ep = 1020 eV with the 2.7 K\nCMBR. Left panel - gamma-rays, electrons, and positrons, right panel - electron and muon neutrinos and antineutrinos.\n\nFigure 7: The same as in Fig. 6, but for a proton of energy Ep = 1021 eV\n\ni.e. the whole energy of the proton is transferred to one\nof the electrons.\nLet's denote by dσ the differential cross-section of the\nprocess. The interaction rate is\ndw = c3\n\n(k * p)\n(k * up )\ndσ = c2\ndσ ,\nǫEp\nǫγp\n\n(50)\n\nwhere k and p are four-momenta of the photon and\nproton, up = p/mp c is the four-velocity of the proton,\n(k *p) = ǫEp /c2 −kp is the scalar product of four-vectors.\nLet assume that in a unit volume we have fph (ǫ) dǫ dΩ/4π\nphotons between the energy interval (ǫ, ǫ + dǫ) and moving within the solid angle dΩ. Then the number of interactions per unit of time is\nZ\nZ\ndΩ\n(k * up )\nN = c2 dǫ\nfph (ǫ)\ndσ ,\n(51)\n4π\nǫγp\nwhere the integration is performed over all variables.\nBelow we perform calculations based on the following\napproach. If we are interested in a distribution of some\nvariable ξ, which is a function φ of particle momenta,\n\nthis distribution can be found introducing an additional\nδ-function under the integral in Eq.(51):\nZ\nZ\n(k * up )\ndΩ\ndN\n= c2 dǫ\nfph (ǫ)\nδ(ξ − φ) dσ . (52)\ndξ\n4π\nǫγp\nIn particular, the energy distribution of electrons in the\nlaboratory frame can be calculated using the following\nformula\nZ\nZ\ndN\n(k * up )\ndΩ\n= c2 dǫ\nfph (ǫ)\nδ(Ee − c(ulf * pe )) dσ ,\ndEe\n4π\nǫγp\n(53)\nwhere ulf is the four-velocity of the laboratory frame,\nand pe is four-momentum of electron since the scalar\nc(ulf * pe ) is equal to the energy of electron in the laboratory system. The proton Lorentz-factor in the laboratory\nsystem also can be considered as a relativistic invariant:\nγp = (ulf * up ).\nNote that the integral\nZ\nS≡\nδ(Ee − c(ulf * pe )) dσ\n(54)\n\n\f10\nθ− , the result can be written in the form\nZ\nS = W (ω, E− , cos θ− )×\nδ(Ee − γp (E− − Vp p− cos θ− )) dE− d(cos θ− ) , (57)\nwhere\nW (ω, E− , cos θ− ) =\n\nFigure 8: The multiplicity of photons and leptons produced\nin one interaction of a relativistic proton with 2.7 CMBR\n\nd2 σ\ndE− d(cos θ− )\n\n(58)\n\nis the double-differential cross-section as a function of energy and emission angle of the electron in the rest frame\nof the proton; ω = (up * k)/(me c) is the energy of the\nphoton the rest frame of proton in units me c2 . The function W has been derived in the Born approximation in\nRefs. [15, 16]. The approach used in these papers describes the production of an electron-positron pair by a\nphoton in the Coulomb field which formally corresponds\nto the limit mp → ∞. However, we warn the reader\nthat there is a misprint in the cross-section published in\nthese papers, therefore we advise to use Eq.(10) of paper\nby Blumenthal [2], where the typo is fixed. Note that\nin Refs. [2, 15, 16] the system of units is used in which\nc = ~ = me = 1. Since here we cite to certain equations of these papers, in this section, in order to avoid a\nconfusion, we use the same system of units.\nThe presence of the δ-function in the integrand allows\nthe integration over the variable d(cos θ− ), which gives\nZ\n1\ndE−\nS=\nW (ω, E− , ξ) ,\n(59)\nγp Vp\np−\nwhere\nξ ≡ cos θ− =\n\n+\n\nFigure 9: The total cross-sections of production of π and\nπ 0 -mesons as a function of energy of incident gamma-ray in\nthe rest frame of proton. The experimental points are taken\nfrom the site http://wwwppds.ihep.su:8001.\n\nγp E− − Ee\n.\nγp Vp p−\n\n(60)\n\nAfter substituting Eq.(59) into Eq.(53), and using the\nrelation\nω = (up * k) = ǫγp (1 − cos θ) ,\n\nis a relativistic invariant, so it can be calculated in any\nframe of coordinates. The differential cross-section dσ\ncan be written in the simplest form in the rest-frame of\nthe proton, therefore for calculations of S we will use this\nsystem of coordinate where\nc(ulf * pe ) = γp (E− − Vp p− cos θ− ) .\n\n(55)\n\nq\n2 /c2 − m2 c2 is the\nHere E− is the energy and p− = E−\ne\nmomentum modulus of electron in the rest frame of the\nproton, θ− is the angle between the momenta of photon\nand electron. Therefore\nZ\nS = dσ δ(Ee − γp (E− − Vp p− cos θ− )) .\n(56)\nAfter integration over all variables, except for E− and\n\n(61)\n\nit is convenient to perform the integration over ω instead\nof integration over the angle. Then, for ultrarelativistic\nprotons (γp ≫ 1), we obtain\ndN\n1\n= 3\ndEe\n2γp\n\nZ∞\n\n(γp +Ee )2\n2 Ee\n4γp\n\nω−1\nZ\n\n2 +E 2\nγp\ne\n\nfph (ǫ)\ndǫ\nǫ2\n\n2γ\nZ pǫ\n\ndω ω×\n\n(γp +Ee )2\n2γp Ee\n\ndE−\nW (ω, E− , ξ) .\np−\n\n(62)\n\n2γp Ee\n\nWhen substituting Eq.(60) into (62) we set Vp = 1, and\ncorrespondingly ξ = (γp E− − Ee )/(γp p− ). The integration limits in Eq.(62) are found from the analysis of kinematics.\n\n\f11\nIn the case of monoenergetic target photon field,\nfph (ǫ′ ) = C δ(ǫ′ − ǫ)\n\n(63)\n\nthe energy distribution of electrons can be written in the\nform of the double-integral\nC\ndN\n= 3 2\ndEe\n2γp ǫ\n\n2γ\nZ pǫ\n\ndω ω ×\n\nω−1\nZ\n\n(γp +Ee )2\n\n2 +E 2\nγp\ne\n\n2γp Ee\n\n2γp Ee\n\ndE−\nW (ω, E− , ξ) ,\np−\n\nwith the following kinematic condition\n4ǫγp2 Ee ≥ (γp + Ee )2 .\n\n(64)\n\nFor the important case of Planckian distribution of target photons,\nfph (ǫ) =\n\nǫ2\n1\n,\nπ 2 eǫ/kT − 1\n\n(65)\n\nFigure 10: Energy distributions of electrons and positrons\n(Ne = N+ + N− ) produced at interactions of protons with 2.7\nK CMBR. Dashed lines and dot-dashed lines correspond to\nthe pair production and photomeson processes, respectively.\nSolid lines show the sums of two contributions. The curves\ncorrespond to three energies of protons: 6.4×1019 eV, 1020 eV\nand 3 × 1020 eV.\n\nthe expression can be simplified. Indeed, rewriting the\nfirst term in the integrand of Eq.(62) in the form\ndǫ\n\n\u0011\n\u0010\nfph (ǫ)\nkT\n−ǫ/kT\n,\n=\nd\nln\n1\n−\ne\nǫ2\nπ2\n\n(66)\n\nwe can perform integration over dǫ by parts, which after\nsimple transformation leads to the energy spectrum of\nelectrons in the form of double-integral\nkT\ndN\n=− 2 3\ndEe\n2π γp\n\nZ∞\n\n(γp +Ee )2\n\n\u0010\n\u0011\ndω ω ln 1 − e−ω/(2γp kT ) ×\n\n2γp Ee\n\nω−1\nZ\n\n2 +E 2\nγp\ne\n\ndE−\nW (ω, E− , ξ) .\np−\n\n(67)\n\n2γp Ee\n\nIn the Born approximation used in [2, 15, 16], the energy and angular distributions of electrons and positrons\nare identical, therefore Eqs. (62) and (67) do not distinguish between electrons and positrons. Let's discus the\ncondition of applicability of Eqs. (62) and (67). In the\nproton rest system, the cross-section of production of an\nelectron-positron pair by the proton and in the Coulomb\npotential coincide for all emission angles of pairs, when\nω ≪ mp . In the laboratory frame this is equivalent to the\ncondition ǫγp ≪ mp , which, taking into account Eq.(48),\ncan be written in the form Ee max ≪ Ep . Thus, the above\nobtained results can be applied to production of electrons\nand positrons when Ee ≪ Ep .\nIn Fig. 10 we show the energy distributions of electrons\nand positrons produced in interactions of protons of three\ndifferent energies with the 2.7 K CMBR: 6.4 × 1019 eV,\n1020 eV and 3 × 1020 eV. Note that the energy of primary proton 6.4 × 1019 eV is interesting in the sense\nthat at this energy the loss-rates of protons, Ep−1 dEp /dt,\n\ndue to pair production and photomeson production are\nequal. The spectral energy distribution of electron and\npositrons from the pair production process, E 2 dN/dE,\nhas a bell-type shape with a broad maximum around\n(me /mp )Rp ∼ 10−3 Ep . This spectrum is quite different\nfrom the dN/dE ∝ E −7/4 type energy dependence as it\nwas hypothesized in [10]. Fig. 10 demonstrates that while\nthe low energy range of electrons (positrons) is dominated\nby the process of pair production, at higher energies\nthe main contribution comes from photomeson processes.\nFortunately, in the energy range where Eqs. (62) and (67)\nare not valid, the contribution of pair-production to the\nspectrum of electrons is negligible compared to the contribution of photomeson processes.\nIt should be noted that the δ-functional approximation, which is often used for qualitative estimates of characteristics of products of high energy interactions, in this\nspecific process does not provide adequate accuracy. The\nreason is that the electrons produced in a single act of interaction have very broad energy distribution. The calculations show that the δ-functional approximation leads to\nsignificant deviation from exact result given by Eq.(62),\neven when one takes into account the energy dependence\nof the average fraction of the proton energy transferred\nto the electron.\n\nA.\n\nEnergy losses\n\nThe analytical presentations of the energy spectra of\nstable products of interactions of protons with ambient\nlow energy photons allows us to calculate the energy\nlosses of protons in a radiation field with arbitrary en-\n\n\f12\n\nFigure 11: The average energy lose rates of protons in the\nCMBR with temperature 2.726 K. The lines are obtained using our method of integration of energy spectra of all final\n(stable) secondaries, the points are from [5]. They are obtained from Monte Carlo simulations of interactions of protons with the CMBR photons using the SOPHIA code. The\ndashed and dash-dotted lines describe the energy losses due\nto pair-production and photomeson interactions, respectively,\nthe solid lines represent the sum of these two contributions.\n\nergy distribution,\n1 dEp\n=\nEp dt\n\nZ1\n0\n\ndx x\n\nZ∞\n\ndǫ fph (ǫ) Φ(η, x) ,\n\n(68)\n\nǫmin\n\nwhere ǫmin = η0 m2p c4 /(4Ep ), and Φ(η, x) is the sum of all\nseven energy distribution (relevant to γ, e+ , e− , νμ , ν ̄μ ,\nνe , ν ̄e ) derived in Sec.2. Eq.(68) describes the average energy losses transferred to gamma-rays and leptons. In order to calculate the energy losses due to pair-production\none should multiply Eq.(67) to 2Ee and integrate over\ndEe .\nCalculations of energy losses of protons can be performed directly, without intermediate calculations of energy distributions of secondary photons and leptons. In\nthis regard, the energy losses of protons in 2.7 K CMBR\nhave been studied in great details by many authors, in\nparticular by Berezinsky and coauthors [3] based on a\nsemi-analytical method of calculations and Stanev et al.\n[5] based on Monte Carlo simulations using the SOPHIA\ncode. Therefore it is interesting to compare our results\nwith direct calculations of energy losses. In Fig. 11 we\nshow the energy lose rate of protons in the blackbody\nradiation field with temperature T = 2.726 K. For comparison, we show the result of calculations performed using the code SOPHIA [5]. The agreement of two calculations is an indirect test of a good accuracy of the obtained above approximate analytical presentations for energy distributions of stable products from proton-photon\ninteraction.\n\nFigure 12: The interaction rates of protons with photons\nof 2.7 K CMBR (left axis) and the coefficient of inelasticity\n(right axis). The curves 1a and 2a are the electron-positron\nand photomeson production rates, respectively. The curves\n1b and 2b are the average energy lost by a proton of given\nenergy due to pair production and photomeson production,\nrespectively.\n\nIn Fig. 12 we show the interaction rate of protons\nwith 2.7 K CMBR, as well as the fraction of energy lost\nby the proton per interaction (the so-called inelasticity\ncoefficient). Close to the threshold of pair production\naround E ≃ 1018 eV, hxie+ e− = 2me /mp ≈ 1.1 * 10−3 ,\nas it expected from the kinematics of the process. However, with an increase of energy, hxiπ gradually decreases\ndown to 10−4 at 1020 eV. This effect has been noticed\nalso in [4, 17]. In the case of photomeson production\nthe inelasticity coefficient has a quite different behavior. At the threshold, hxiπ increases from the value of\nmπ /(mp + mπ ) ≈ 0.13 to approximately 0.4 at energy\n1022 eV. Therefore, despite the fact that the cross-section\nof pair production significantly, by two orders of magnitude, exceeds the cross-section of photomeson production, the energy losses at high energies are dominated by\nphotomeson interactions.\n\nV.\n\nCALCULATIONS FOR POWER-LAW\nDISTRIBUTION OF PROTONS\n\nInstead of integrating Eqs. (11) and (30) over dǫ, it\nis more convenient to perform integration of these equations over dη. This allows the spectra of photons and\nleptons to be presented in the form\ndN\n=\ndE\n\nZ∞\n\nη0\n\nH(η, E) dη .\n\n(69)\n\n\f13\ncutoff:\nfp (Ep ) =\n\nAEp−2\n\n\u0012\n\nEp\nexp −\nEcut\n\n\u0013\n\n.\n\n(72)\n\nwhere the normalization coefficient is determined from\nthe condition\nZ∞\n\nEp Jp (Ep ) dEp = 1\n\nerg\n.\ncm3\n\n(73)\n\n1GeV\n\nFigure 13: Function H(η, Eγ ) at fixed energy of γ-rays,\nEγ = 1/2E⋆ , calculated for a power-law distribution of protons fp (Ep ) ∝ Ep−α with α = 2 and 2.5.\n\nHere\nm2p c4\nH(η, E) =\n4\n\n! \u0012\n\u0013\nZ∞\nηm2p c4\nE\ndEp\nΦ\nη,\n,\nf\n(E\n)\nf\np\np\nph\nEp2\n4Ep\nEp\n\nE\n\n(70)\nwhere E is the energy of γ-rays or leptons, and Φ is the\nenergy distribution of the given type of particle.\nFor photomeson interactions, it is useful to introduce\nthe following characteristic energy of proton\n\u0012\n\u0013\nmp c2\nE∗ = mp c2\nη0 ≈ 3.0 * 1020 eV .\n(71)\n4kT\nAt energy Ep = E∗ , the proton and a photon of energy\nkT can produce a pion through a head-on collision.\nThe function H(η, E) at fixed energy E describes distribution over η. For a power-law distribution of protons,\nfp (Ep ) ∝ Ep−α , the function H(η, E) has a maximum at\nη/η0 ≈ 3 E/E∗ ; the position of the maximum slightly depends on the power-law index α of the proton distribution. The function H(η, E) for γ-rays is shown in Fig. 13\nat Eγ = 0.5 E⋆ and two power-law indices, α = 2 and 2.5.\nAt low energies the function H(η, E) drops very quickly.\nA cutoff in the spectrum of protons results to faster decrease of H(η, E) and to a shift of the point of maximum\ntowards smaller η. For electrons and neutrinos H(η, E)\nhas similar behavior - a maximum at η ≪ 100 η0 and\nstrong decrease with increase of η.\nTo use the analytical parameterizations for distributions of photons and electrons given by Eq.(27) and\nEq.(31) and related Tables I,II,III, which are applicable\nfor η/η0 ≤ 100, the following condition should be fulfilled: 3 E/E∗ ≪ 100. In this case the main contribution\nto the integral (69) comes from the region η ≪ 100 η0 , i.e.\nfrom events close to threshold. Therefore the obtained\napproximate analytical presentations allow calculations\nof distribution of particles in the energy range E . E∗ .\nFinally, let's discuss the production of photons and leptons at interactions of photons with a realistic distribution of protons, namely a power-law with an exponential\n\nIn Figs. 14 – 17 we show the spectra of photons, electrons, and neutrinos produced in photomeson interactions calculated for 4 values of the cutoff energy in the\nproton spectrum Ecut = 0.1 * E∗ , E∗ , 10 * E∗ and 103 * E∗ ,\nrespectively. The case Ecut = 103 * E∗ is almost identical\nto a pure power-law spectrum of protons.\nIn Figs. 18 and 19 we compare the spectra of electrons\n(and positrons) produced through the pair production\nchannel with the spectra of electrons from the decay of\nphoto-produced charged pions.\nFinally, in Fig. 20, we show the steady-state spectra\nof cooled electrons. We assume that electrons are cooled\nvia synchrotron radiation in the intergalactic magnetic\nfield B = 1 μG and inverse Compton (IC) scattering on\nthe 2.7 K CMBR. Since the production spectrum of pairproduced electrons below E ∼ 1015 eV drops sharply (see\nFigs. 18 and 19), the synchrotron and IC cooling (in the\nThomson regime) leads to the formation of a standard\nE −2 type spectrum. This is clearly seen in Fig. 20.\nIn Fig. 21 we show the spectra of synchrotron and\nIC radiation of secondary electrons produced via pairproduction and photomeson production channels for a\nfixed magnetic field of B = 1 μG, the temperature of\nCMBR T = 2.7 K and for 4 different cutoff energies in the\nproton spectrum Ecut . Fig. 21a corresponds to the cutoff\nenergy of protons E = 0.1E∗ . In this case the electrons\nare contributed mainly from pair-production process\nwith a maximum in the energy distribution (E 2 dN/dE)\nat energy E ∼ 1015 eV. While synchrotron radiation of\nthese electrons peaks at Eγ ∝ BE 2 ∼ 106 eV, the maximum of the IC radiation appears, because of the KleinNishina effect, at Eγ ∼ E± ∼ 1014 − 1015 eV. Note that\nalthough energy density of the magnetic field corresponding to B = 1μG is B 2 /8π ≈ 4×10−14 erg/cm3 , i.e. an order of magnitude smaller than the energy density of 2.7 K\nCMBR, emissivity of the synchrotron and IC components\nare comparable. This is also a direct consequence of the\nreduction of the cross-section of IC scattering of 1015 eV\nelectrons in the Klein-Nishina regime. The second component of synchrotron radiation related to the electrons\nfrom photomeson processes peaks at much higher energies, Eγ ∼ 1012 eV, however its contribution is not significant because of suppression of the protons at energies\nabove the threshold of photomeson reactions. The increase of the cutoff energy in the proton spectrum, Ecut ,\nleads to dramatic, orders of magnitude, increase of the\nemissivity of the synchrotron radiation of photomeson\n\n\f14\nelectrons (see Figs. 21b,c,d). At the same time, because\nof the Klein-Nishina cross-section, only pair-produced\nelectrons contribute to the IC radiation. Therefore the\ncutoff energy Ecut does not have any impact on the IC\nspectrum and emissivity, as it is seen in Figs. 21.\nVI.\n\nSUMMARY\n\nWe present simple analytical parametrizations for energy distributions of photons, electrons, and neutrinos\nproduced in interactions of relativistic protons with an\nisotropic monochromatic radiation field. The results on\nphotomeson processes are obtained using numerical simulations of proton-photon interactions based on the public available Monte-Carlo code SOPHIA. We also developed a simple formalism for calculations of energy spectra of electrons and positron from the pair production\n(Bethe-Heitler) process based on the well-known differential cross-section in the rest frame of the proton. The\nenergy loss-rate of protons due to photomeson and pairproduction processes in the 2.7 K CMBR calculated by\nintegrating the energy distributions of the stable products of interactions is in excellent agreement with re-\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n\nF.W. Stecker, Phys. Rev. Lett., 21, 1016 (1968).\nG.R. Blumenthal, Phys. Rev. D1, 1596 (1970).\nV.S. Berezinsky and S.I. Grigorieva, 199, 1 (1988).\nM. Chodorowski, A. Zdziarski, M. Sikora, Astrophys. J.,\n400, 181 (1992)\nT. Stanev, R. Engel, A. Mücke, R.J. Protheroe, J.P.\nRachen, Phys. Rev. D62, 093005 (2000).\nA.M. Atoyan and C.D. Dermer, Astrophys.J, 586, 79\n(2003).\nF.A. Aharonian, MNRAS, 332, 215 (2002).\nS. Inoue, F.A. Aharonian, N. Sugiyama, Astrophys.J,\n628 L9 (2005)\nS. Gabici and F.A. Aharonian, Phys. Rev. Lett., 95,\n251102 (2005).\nE. Armengaud, G. Sigl, F. Miniati, Phys. Rev. D73,\n083008 (2006).\n\nsults of previous works based on direct calculations of\nenergy losses (without intermediate stage of energy distributions of secondaries). The analytical presentations\nof energy distributions of photons and leptons obtained\nin this paper provide a simple but accurate approach\nfor calculations of broad-band energy spectra of gammarays, electrons and neutrinos in different astrophysical\nenvironments.\n\nVII.\n\nACKNOWLEDGMENTS\n\nWe appreciate very much the help of Slava Bugayov\nwho provided us with energy distributions of secondary\nparticles produced at photomeson interactions based on\nMonte Carlo simulations using the public available code\nSOPHIA. We thank Anita Reimer for providing us with\nnumerical results of energy losses of protons in the 2.726K\nCMBR published in [5]. We thank Andrew Taylor and\nMitya Khangulyan for discussion of the results. Finally\nwe thank the referee for the constructive and very useful\ncomments which helped us to improve the paper significantly.\n\n[11] A. Mücke, R. Engel, J.P. Rachen, R.J. Protheroe,\nT. Stanev, Computer Physics Communications, 124, 290\n(2000).\n[12] S.R. Kelner, F.A. Aharonian, and V.V. Bugayov, Phys.\nRev. D 74, 034018 (2006).\n[13] T.K. Gaisser, Cosmic Rays and Particle Physics, Cambridge: Cambridge University Press (1990).\n[14] P.S. Coppi and F.A. Ahronian, Astrophys. J., 487, L9\n(1997)\n[15] R.L. Gluckstern, M.H. Hull, and G.Breit, Phys. Rev.\n90,1026 (1953)\n[16] R.L. Gluckstern, M.H. Hull, Phys. Rev. 90, 1030 (1953)\n[17] A. Mastichiadis, R.J. Protheroe, J.G. Kirk, Astronom.\nAstrophys., 433, 765 (2005).\n\n\f15\n\nFigure 14: The production spectra (EdN/dE) of photons and electrons (left panel) and neutrinos (right panel) produced with\nenergy distribution described by Eq.(72) through the photomeson channel. The cutoff energy in the proton spectrum is assumed\nEcut = 0.1E∗ .\n\nFigure 15: The same as in Fig. 14 but for Ecut = E∗ .\n\nFigure 16: The same as in Fig. 14 but for Ecut = 10 * E∗ .\n\n\f16\n\nFigure 17: The same as in Fig. 14 but for Ecut = 1000 * E∗ .\n\nFigure 18: The production energy spectra of electrons and positrons produced through the channel of pair production (curve\n1) and positrons and electrons produced through the photomeson interactions of protons (curves 2 and 3, respectively). The\nproton spectrum is assumed in the form given by Eq.(72) with cutoff energy at Ecut = 0.1E∗ (left panel) and Ecut = E∗ (right\npanel). Note that the contribution of electrons (curve 3) in left panel appears below the low bound of y axis\n\nFigure 19: The same as in Fig. 18, but for cutoff energies Ecut = 10E∗ (left panel) and Ecut = 1000E∗ (right panel)\n.\n\n\f17\n\nFigure 20: The cooled spectra of electrons and positrons, N = N+ + N− . Dashed lines - electrons produced through the\npair-production channel, dot-dashed lines - electrons produced through photomeson interactions. The sum of two contributions\nis shown by solid curves. The proton spectrum is given in the form of Eq.(72), with Ecut = 0.1 * E∗ (a), E∗ (b), 10 * E∗ (c) and\n1000 * E∗ (d).\n\nFigure 21: The synchrotron and IC spectra of cooled electrons. Dashed line corresponds to synchrotron (S) and IC radiation of\nelectrons and positrons produced in the pair-production process, the dotted line corresponds to radiation of positrons (electrons)\nproduced through photomeson interactions. Curve 1 (solid line) is the sum of these contributions. Curve 2 represents the\nspectrum of gamma-rays produced at decay of photoproduced π 0 -mesons. The proton spectrum is given in the form of Eq.(72),\nwith Ecut = 0.1E∗ (a), Ecut = E∗ (b), Ecut = 10 E∗ (c) and Ecut = 10 E∗ (d). Magnetic field B = 1 μG, temperature T = 2.7 K.\n\n\f"}