{"id": "http://arxiv.org/abs/1110.1401v1", "guidislink": true, "updated": "2011-10-06T21:45:15Z", "updated_parsed": [2011, 10, 6, 21, 45, 15, 3, 279, 0], "published": "2011-10-06T21:45:15Z", "published_parsed": [2011, 10, 6, 21, 45, 15, 3, 279, 0], "title": "Spectroscopy of the Methane ν3 Band with an Accurate Mid-Infrared\n  Coherent Dual- Comb Spectrometer", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.3107%2C1110.4823%2C1110.3661%2C1110.1022%2C1110.4343%2C1110.2222%2C1110.0996%2C1110.4176%2C1110.3993%2C1110.2302%2C1110.6297%2C1110.1156%2C1110.0759%2C1110.6254%2C1110.3936%2C1110.2732%2C1110.1574%2C1110.0792%2C1110.5937%2C1110.1048%2C1110.0132%2C1110.3667%2C1110.5245%2C1110.5346%2C1110.4566%2C1110.5558%2C1110.4495%2C1110.3389%2C1110.6597%2C1110.2325%2C1110.5729%2C1110.4721%2C1110.2987%2C1110.0634%2C1110.6716%2C1110.4042%2C1110.6752%2C1110.5013%2C1110.4420%2C1110.5657%2C1110.4310%2C1110.2015%2C1110.6616%2C1110.3367%2C1110.3253%2C1110.4657%2C1110.3824%2C1110.5361%2C1110.4950%2C1110.5997%2C1110.3958%2C1110.5364%2C1110.3779%2C1110.1075%2C1110.5606%2C1110.4133%2C1110.3078%2C1110.2753%2C1110.6764%2C1110.1929%2C1110.6379%2C1110.2626%2C1110.6734%2C1110.4115%2C1110.3642%2C1110.4437%2C1110.5495%2C1110.5649%2C1110.4073%2C1110.1373%2C1110.4010%2C1110.5103%2C1110.5460%2C1110.5780%2C1110.5042%2C1110.6524%2C1110.0194%2C1110.3749%2C1110.3491%2C1110.4531%2C1110.6367%2C1110.0436%2C1110.0363%2C1110.3994%2C1110.5240%2C1110.4114%2C1110.5218%2C1110.1178%2C1110.2620%2C1110.0850%2C1110.2389%2C1110.6259%2C1110.5076%2C1110.1401%2C1110.4749%2C1110.1226%2C1110.2631%2C1110.4568%2C1110.2630%2C1110.2204%2C1110.1468&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Spectroscopy of the Methane ν3 Band with an Accurate Mid-Infrared\n  Coherent Dual- Comb Spectrometer"}, "summary": "We demonstrate a high-accuracy dual-comb spectrometer centered at 3.4 \\mu m.\nThe amplitude and phase spectra of the P, Q, and partial R-branch of the\nmethane {\\nu}3 band are measured at 25 MHz to 100 MHz point spacing with ~kHz\nresolution and a signal-to-noise ratio of up to 3500. A fit of the absorbance\nand phase spectra yield the center frequency of 132 rovibrational lines. The\nsystematic uncertainty is estimated to be 300 kHz, which is 10-3 of the Doppler\nwidth and a tenfold improvement over Fourier transform spectroscopy. These data\nare the first high- accuracy molecular spectra obtained with a direct comb\nspectrometer.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.3107%2C1110.4823%2C1110.3661%2C1110.1022%2C1110.4343%2C1110.2222%2C1110.0996%2C1110.4176%2C1110.3993%2C1110.2302%2C1110.6297%2C1110.1156%2C1110.0759%2C1110.6254%2C1110.3936%2C1110.2732%2C1110.1574%2C1110.0792%2C1110.5937%2C1110.1048%2C1110.0132%2C1110.3667%2C1110.5245%2C1110.5346%2C1110.4566%2C1110.5558%2C1110.4495%2C1110.3389%2C1110.6597%2C1110.2325%2C1110.5729%2C1110.4721%2C1110.2987%2C1110.0634%2C1110.6716%2C1110.4042%2C1110.6752%2C1110.5013%2C1110.4420%2C1110.5657%2C1110.4310%2C1110.2015%2C1110.6616%2C1110.3367%2C1110.3253%2C1110.4657%2C1110.3824%2C1110.5361%2C1110.4950%2C1110.5997%2C1110.3958%2C1110.5364%2C1110.3779%2C1110.1075%2C1110.5606%2C1110.4133%2C1110.3078%2C1110.2753%2C1110.6764%2C1110.1929%2C1110.6379%2C1110.2626%2C1110.6734%2C1110.4115%2C1110.3642%2C1110.4437%2C1110.5495%2C1110.5649%2C1110.4073%2C1110.1373%2C1110.4010%2C1110.5103%2C1110.5460%2C1110.5780%2C1110.5042%2C1110.6524%2C1110.0194%2C1110.3749%2C1110.3491%2C1110.4531%2C1110.6367%2C1110.0436%2C1110.0363%2C1110.3994%2C1110.5240%2C1110.4114%2C1110.5218%2C1110.1178%2C1110.2620%2C1110.0850%2C1110.2389%2C1110.6259%2C1110.5076%2C1110.1401%2C1110.4749%2C1110.1226%2C1110.2631%2C1110.4568%2C1110.2630%2C1110.2204%2C1110.1468&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We demonstrate a high-accuracy dual-comb spectrometer centered at 3.4 \\mu m.\nThe amplitude and phase spectra of the P, Q, and partial R-branch of the\nmethane {\\nu}3 band are measured at 25 MHz to 100 MHz point spacing with ~kHz\nresolution and a signal-to-noise ratio of up to 3500. A fit of the absorbance\nand phase spectra yield the center frequency of 132 rovibrational lines. The\nsystematic uncertainty is estimated to be 300 kHz, which is 10-3 of the Doppler\nwidth and a tenfold improvement over Fourier transform spectroscopy. These data\nare the first high- accuracy molecular spectra obtained with a direct comb\nspectrometer."}, "authors": ["E. Baumann", "F. R. Giorgetta", "W. C. Swann", "A. M. Zolot", "I. Coddington", "N. R. Newbury"], "author_detail": {"name": "N. R. Newbury"}, "author": "N. R. Newbury", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevA.84.062513", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1110.1401v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1110.1401v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "journal article", "arxiv_primary_category": {"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1110.1401v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1110.1401v1", "journal_reference": null, "doi": "10.1103/PhysRevA.84.062513", "fulltext": "Spectroscopy of the Methane ν3 Band with an Accurate Mid-Infrared Coherent DualComb Spectrometer\nE. Baumann, F. R. Giorgetta, W. C. Swann, A. M. Zolot, I. Coddington, and N. R. Newbury\nNational Institute of Standards and Technology, 325 Broadway, Boulder, Colorado 80305\n(received X July 2011)\nWe demonstrate a high-accuracy dual-comb spectrometer centered at 3.4 μm. The amplitude\nand phase spectra of the P, Q, and partial R-branch of the methane ν3 band are measured at\n25 MHz to 100 MHz point spacing with ~kHz resolution and a signal-to-noise ratio of up to\n3500. A fit of the absorbance and phase spectra yield the center frequency of 132 rovibrational\nlines. The systematic uncertainty is estimated to be 300 kHz, which is 10−3 of the Doppler width\nand a tenfold improvement over Fourier transform spectroscopy. These data are the first highaccuracy molecular spectra obtained with a direct comb spectrometer.\nWork of the U.S. Government and not subject to copyright.\nPACS numbers 33.20.Ea, 42.62.Eh, 07.57.Ty\n\n1\n\n\fI. INTRODUCTION\nFrequency combs are attractive sources for spectroscopy because of their broadband, collimated\noutput, and because the frequency of each discrete comb tooth can be referenced to an\nestablished frequency standard [1, 2]. Frequency combs can support conventional saturated\nabsorption spectroscopy by providing a frequency ruler against which to measure the cw laser\nfrequency [3-5]. They can also directly probe molecules over a broad spectrum [6-20]. Many\ndemonstrations of direct comb spectroscopy have focused on speed, spectral bandwidth or\nsensitivity, with the frequency calibration based on a known spectral line rather than the\nunderlying comb. Our focus here is instead on the high accuracy and resolution possible with a\ndirect comb spectrometer. We require, at a minimum, that the spectrometer resolve individual\nteeth of a comb and that the comb is referenced to an accurate frequency standard.\nDual-comb spectroscopy is one method of direct comb spectroscopy that is particularly wellsuited to this task. In a dual-comb spectrometer, a sensing comb is transmitted through a sample\nand then heterodyned against a local oscillator (LO) comb which has a repetition rate that differs\nby ∆fr from the sensing comb repetition rate [9-20]. The basic concept is illustrated in Fig. 1 for\nthe case of ideal frequency combs. In the frequency domain, the result is a rf comb where each rf\ntooth maps directly to a single tooth of the sensing comb. In the time-domain, the pulse train\nfrom the LO comb walks through the sensing pulse train to create an interferogram every 1/∆fr in\nanalogy with cross-correlation measurements or Fourier transform infrared spectrometers\n(FTIR); the Fourier transform of a long series of such interferograms leads again to the rf comb\nof Fig. 1.\nDual-comb spectroscopy has been implemented across the extremes ranging from free-running\ncombs to phase-coherent, frequency-stabilized combs [9-20]. In the former, the measurement is\nessentially a single cross-correlation measurement between the two pulse trains; there is no\ncoherence from one interferogram to the next so that the rf comb of Fig. 1 (and therefore the\noptical comb) is not resolved, nor is there intrinsic absolute frequency accuracy. It does,\nhowever, avoid the experimental complexity associated with phase-locked, referenced frequency\ncombs. In the latter implementation, the combs are tightly phase-locked together for high mutual\ncoherence and residual linewidths well below ∆fr. The combs are also stabilized to an absolute\nfrequency reference. In this case, the rf comb (and therefore optical comb) is fully resolved and\n2\n\n\fthe stabilized comb accuracy can be applied to the frequency axis of the recorded spectra.\nFurthermore, the signal can be integrated over multiple interferograms for times much longer\nthan 1/∆fr, limited only by the effective mutual coherence time between the dual-combs, with a\ncorresponding increase in signal-to-noise ratio (SNR). We refer to this situation as \"fullyresolved and accurate\" dual-comb spectroscopy. Fully-resolved and accurate dual-comb\nspectrometers have been demonstrated in the near infrared (NIR) [14, 17, 18]. There have also\nbeen important direct comb spectroscopy demonstrations in the mid-infrared (MIR) [9, 10, 13,\n19], but not yet in a fully resolved and accurate implementation. Here we demonstrate a fully\nresolved and accurate MIR dual-comb spectrometer and measure the amplitude and phase\nspectra of the P, Q and R-branch of methane asymmetric stretch ν3 band with 45 000 spectral\nelements spanning 4.5 THz (150 cm−1). We report line center determinations across 132 of the\nstronger ν3 rovibrational lines. These data contribute to the spectroscopic data on the\nscientifically and environmentally important methane molecule [23-30] and can be used to\ncalibrate high-resolution FTIR in this spectral region.\nAs mentioned earlier, while the spectrometer will have a spectral frequency axis with a fractional\naccuracy set by the comb teeth (which in turn are referenced to a hydrogen maser), this\ncalibration alone does not guarantee a similar accuracy in the line center determination of a\nmolecular transition both because of limited SNR and potential systematics. (This statement is\ntrue of not only a dual-comb spectrometer but any direct comb spectrometer.) The most accurate\ncomparison to date for a dual-comb spectrometer was limited to a few MHz by unknown\npressure shifts masking possible systematics [14]. The potential for systematic frequency shifts\narise from the different use of the comb in direct comb spectroscopy compared to frequency\nmetrology. Optical frequency metrology relies on only the frequency of a single comb tooth, but\nthe dual-comb spectrometer in addition relies on the relative amplitude and phase across multiple\ncomb teeth. Nonlinearities that mix the amplitude and phase of different comb teeth distort the\nspectral shape, causing effective frequency shifts in molecular line centers and will ultimately\nlimit accuracy. Indeed, we do find photodetection nonlinearities can cause systematic shifts, but\nwe also show that these shifts can be substantially suppressed by acquiring data with both the\nforward and reverse rf-to-optical mappings shown in Fig. 1. By comparison to saturated\nabsorption spectroscopy of the P(6) and P(7) manifolds [5, 21, 22], we find a systematic\n\n3\n\n\funcertainty of ~300 kHz (10−5 cm−1), or ~1 part per thousand of the Doppler broadened linewidth\nand a tenfold higher accuracy than previous FTIR data.\nII. MIR DFG DUAL-COMB SPECTROMETER\nA. Experimental Setup\nFigure 2 shows the MIR implementation of Fig. 1. Two NIR frequency fiber combs are\ngenerated by fs-fiber lasers centered at 1.56 μm where the repetition rates of the sensing comb,\nfr,S, and of the LO comb, fr,L, are both about 100 MHz and differ by ∆fr =fr,L − fr,S ≈1.5 kHz [17].\nThe output laser pulses are stretched to picosecond pulsewidths in fiber, amplified to ~0.5 W,\ncombined in a fiber coupler with ~0.5 W of amplified 1.064 μm light from a cw fiber laser, and\nfocused onto periodically poled lithium niobate (PPLN) to generate the MIR frequency combs\nthrough difference frequency generation (DFG) [31, 32]. The NIR combs are filtered with an\nadjustable 7 nm wide bandpass filter to match the phase-matching bandwidth of the 10 mm long\nPPLN. The generated MIR combs are centered around 3.4 μm with a ~1 THz width and can be\nscanned over ~4.5 THz (limited by the C-band Er-fiber amplifiers) by adjusting the PPLN\ntemperature and filter position. For frequency measurements from 87 THz to 90 THz, the PPLN\npoling period was 29.9 μm, and from 90 THz to 92 THz it was 30.2 μm. There are a number of\nother approaches that can generate MIR combs [8, 19, 33-36] both broader and brighter than the\napproach taken here, but more development of these sources is needed to establish the very low\nphase noise across the comb required for fully resolved and accurate, high-SNR dual-comb\nspectroscopy. A Ge wedge blocks the residual NIR light, leaving 30 μW of MIR light across\n7500 teeth, or 4 nW per tooth. The sensing MIR comb passes through a 28 cm long, 200 mTorr\nmethane cell, is heterodyned against the LO MIR comb on an InAs photodiode at a heterodyne\nefficiency of 30%, and the output is digitized synchronously with fr,L.\nTo achieve high SNR, we require long integration times, which in turn requires high mutual\ncoherence between the sensing and LO combs. Specifically, for the 13-minute acquisition times\nhere, we require an effective relative linewidth below 1/(13×60 s) ≈ 1 mHz, or equivalently in\nthe time domain, sub-radian carrier phase jitter over 13 minutes. We achieve this high mutual\ncoherence at short times (sub-second) through phase-locked loops, as described next, and at\nlonger times (seconds to minutes) through simple software phase correction, as described later.\nThe short-time coherence is maintained by phase-locking both fiber combs tightly to two cavity4\n\n\fstabilized cw transfer lasers as in Ref. [17] so that the mutual linewidths of the two combs is well\nbelow 1 Hz. (The 1.064 μm laser is common to both paths and therefore imparts no additional\nphase noise.)\nThe mutual coherence allows for long integration times and high SNR, but it does not establish\nabsolute frequency accuracy (as both combs can still move in concert). The frequency accuracy\nis achieved by recording the absolute frequencies of one cw transfer laser and the 1.064 μm cw\nlaser against a self-referenced frequency comb referenced to a hydrogen maser (H-maser).\nKnowledge of these frequencies and any rf offsets allows us to determine the anchor frequency,\nfA or f'A, as defined in Fig. 1. To extend the frequency accuracy across all the teeth, we record the\nrepetition rates of the combs against a frequency counter, also referenced to the H-maser. The\naccuracy of the H-maser is 10-13 [37], which yields a 10 Hz frequency accuracy in the MIR at\naround 100 THz. Taking into account synchronization between the data acquisition and\ncalibration, as well as any temperature fluctuations, a conservative upper limit is 100 Hz, which\nis a negligible contribution to our ultimate line center uncertainties.\nUnlike conventional FTIR, in a dual-comb spectrometer the frequency resolution and point\nspacing are decoupled. The frequency resolution (or instrument lineshape) is limited by the\nabsolute comb tooth linewidth over the measurement time. In our case the combs are phase\nlocked to two cw reference lasers which are phase locked to an optical cavity (Fig. 2a). All locks\nexhibit sub-radian phase noise, and the linewidth is dominated by the drift of the optical cavity to\n1 kHz to 10 kHz over a typical 13 minute measurement period. This drift could be removed by\ncontinuous correction against the self-referenced comb, in which case we would be limited by\nthe ~kHz frequency noise on our 1.064 μm laser (loosely locked to the self-referenced comb) and\na similar level of excess frequency noise added to the two cw transfer lasers during fiber-optic\ntransmission to the dual-comb spectrometer. The spectral point spacing is generally much\ncoarser than the resolution and is set by the comb repetition rate (fr,S ≈ 100 MHz) with finer\nspacing achievable by step scanning the comb.\nB. Data Acquisition and Coherent Averaging\nAn example rf spectrum from a continuous data acquisition is given in Fig. 2b. Note that both\nthe amplitude and phase response of the gas are extracted. We measure a well resolved rf comb\nwith sub-Hertz linewidth, despite the the addition of fiber optics, optical filters, DFG optics, and\n5\n\n\fEr-doped fiber amplifiers compared to Ref. [14]. These data were acquired without any software\nphase correction, relying instead only on the mutual coherence established between the two\ncombs through the phase locked loops. Continuous, uninterrupted data acquisition is limited by\nthe size of the digitizer memory to about 5 seconds.\nHigh SNR requires averaging times longer than this 5 seconds. To obtain long averaging times\nwith zero dead time and without cumbersome file sizes, we implement coherent, real-time coadding of sequential interferograms [17, 18]. This co-adding requires the phase of successive\ninterferograms to be identical, to within any noise, which in turn requires two conditions. First,\nthe combs should be phase locked to coincide at an anchor frequency fA (or f'A) (Fig. 1b) and\nsecond the repetition rates of the LO and sensing comb, fr,L and fr,S must satisfy (1+M)fr,L = Mfr,S,\nwhere M is an integer. The phaselocks have been improved relative to Ref. [18] and can be tuned\nso that these conditions can be met as the MIR comb is scanned across 4.5 THz with M = 216.\nSimultaneously fA (or f'A) is adjusted to remain ~1.2 THz below (or above) the filtered comb\ncarrier frequency so that the rf comb remains centered at (∆fr/fr,L)×(1.2 THz) = 18 MHz. For this\ncase, each interferogram is exactly 216 points long and exactly repeats at ∆fr ≈1.5 kHz. 100\nsequential inteferograms are added in real time over 0.07 s in a field programmable gate array\n(FPGA), limited by slow carrier phase wander. For longer times, these summed interferograms\nare phase-corrected by removing only the linear component of the spectral phase (as opposed to\nthe more extensive phase correction used in conventional FTIR [38]) to generate a final highSNR interferogram. This interferogram is Fourier transformed to yield the complex rf spectrum\nwith points spaced by fr,S, at a resolution of 1 kHz to 10 kHz, and with a frequency accuracy of\nbetter than 100 Hz. This process of summing in time and then Fourier transforming the data\nprovides exactly the same results as Fourier transforming the entire time data record and then\nselecting the amplitude and phase at each distinct rf tooth (e.g. as in Fig. 2c), except that it is\ndramatically faster and less memory intensive.\nIII. RESULTS\nA. Complex (Phase and Amplitude) Spectra and Line Centers\nIn terms of the molecular absorption coefficient, α(f), and phase delay φ(f), the measured\ncomplex spectrum is S ( f ) = S0 ( f ) exp [ − α ( f ) L 2 − iφ ( f )] , where L is the cell length and ܵ଴ ሺ݂ሻ\n\n6\n\n\fis the complex heterodyne signal between the combs in the absence of the sample. Figure 3\nshows complex methane spectra across 4.5 THz, each acquired over 13 minutes as the\ntemperature of the PPLN was stepped to access different spectral regions.\nThe statistical spectral SNR for the amplitude or phase is limited by the InAs detector's ~300 μA\ndark current to ~125/√s, or ~3500 for a full 13 minute acquisition near the center of the\nspectrum, with an average value across the full width at half maximum (FWHM) of around\n100/√s. This SNR for the magnitude and phase of the complex spectrum corresponds as well to\nthe statistical SNR for the measured molecular absorbance divided by two, α ( f ) L 2 , and the\nmolecular-induced phase delay, φ(f), in radians. The product of SNR and number of spectral\nelements is 106/√s, nearly the same dynamic-range limited value as for previous NIR dual-comb\nsystems [14, 18, 39]. Although higher optical power would in principle improve the SNR, it\nwould also increase nonlinear effects and therefore systematic shifts, as discussed in the next\nsection. Variations across the baseline on the frequency scale of the molecular features can\nfurther degrade the SNR beyond this statistical limit.\nTo isolate the molecular response, we compute − ln  S ( f )  = α ( f ) L 2 + iφ ( f ) − ln  S0 ( f )  .\nThe last term includes the more slowly varying baseline wander. The first two terms are the\nabsorbance and phase responses from all rovibrational lines, each of which is proportional to the\ncomplex error function w ( x ) = exp ( − x 2 ) + i 2π −1/2 F ( x ) for pure Doppler broadening with the\nscaled frequency x = ( f − fk ) σ D , line center fk and Doppler width σ D . The real (absorbance)\npart is the usual Gaussian profile and the imaginary (phase) part is the corresponding Dawson\nintegral, F(x). We fit both the real (absorbance) and imaginary (phase) parts of ܵሺ݂ሻ separately\nover a 2 GHz to 20 GHz window around each line, or lines, using a 3rd order polynomial for the\nlocal baseline variations. Examples of fits for the P(6) and P(7) transitions are given in Fig. 3b\nalong with the fit residuals. There is good agreement between the absorbance and phase fits in\nterms of fitted line centers.\nOne concern is the relatively sparse sampling of 100 MHz and its impact on the line center\ndetermination. In principle, since the Gaussian or Dawson fitting function has only three free\nparameters, as few as three measured spectral points with high SNR are sufficient for a line\ncenter determination. For the Gaussian fit, the statistical uncertainty on the fitted line center will\n\n7\n\n\fbe σ fk ~ ∆ν D\n\n( SNR\n\nk\n\nN pnts\n\n) [38], where SNR is the SNR of the k\nk\n\nth\n\npeak, ∆ ν D = 2 2 ln ( 2 )σ D\n\nis its Doppler FWHM and N pnts = ∆ν D / f r ,S is the number of points across the peak. For a ∆ν D of\n300 MHz, a point spacing of fr,S = 100 MHz, and an SNR of 3500, σfk ~ 50 kHz. The fit\nuncertainties to the phase profiles depend similarly on SNR and width. This estimate is\nconsistent with the numerical uncertainties returned by the fit. To establish that the 100 MHz\nsampling does not cause any systematic shifts, we acquired four \"interleaved\" spectra by stepscanning the 1.064 μm laser frequency in 25 MHz steps for the P(7) and P(6) transitions, shown\nin Fig. 4. The fit results for the manifold of lines are statistically identical across the four data\nsets verifying that the 100 MHz sampling, while sparse, is sufficient where the fit function is\nknown and was used for the remainder of the lines. In addition these data indicate the potential of\nthis method for line shape studies.\nWhile\n\nthe SNR is sufficient to observe lines (at 3σ) with line strengths above\n\n3.7×10−23 cm−1/(molecule cm−2) for the 28 cm long cell, we restrict the fits for the line center\ndeterminations to 132 single lines with strength >3.7×10−22 cm-1/(molecule cm−2) over the P, Q\nand R(0)-R(2) branch. The line centers given in Table I are calculated from the average over the\nphase and absorbance fits (and over the two different rf-to-optical mappings as described in the\nnext section.) The averaged fit uncertainties depend on line strength and existence of any\nadjacent lines; they are below 30 kHz for strong lines and below 300 kHz (10-5 cm−1) for 106 of\nthe 132 fitted lines. The relative line strengths match Ref. [28] to within 1% across the P-branch.\nMethane is a well-studied molecule and there has been previous high-accuracy spectroscopy of\nthe ν3 band. Specifically, the P(6) and P(7) lines have been well characterized with a combbased saturated absorption spectrometer [5, 21, 22]. In Fig. 5, we plot the difference between our\nmeasurements and the saturated absorption data, which has an uncertainty of ~10 kHz. The\nmaximum difference across all the lines is 275 kHz, or 10−3 of the Doppler broadened linewidth.\nBased on this comparison and the discussion in the next section, we assign an overall systematic\nuncertainty of 300 kHz to the line centers of Table I. In addition, we can compare the entire\ndata set to previous values in the literature taken with high-resolution FTIR [28, 42], as shown in\nFig. 6. For the most part, the FTIR data is within its specified accuracy of ~ 3 MHz.\nB. Evaluation of Systematic Shifts\n8\n\n\fWhile the frequencies of the sample points are accurate and the fit uncertainties can be below\n30 kHz, systematics can shift the measured line centers and must be considered. The effect of the\nbaseline wander is included in the fitted uncertainty. (Since the signals at all optical frequencies\nare measured simultaneously, there is no time-dependent baseline wander as can arise in swept\nlaser measurements.) The heterodyne signal occurs at well-defined rf frequencies spanning\n15 MHz to 30 MHz, well away from 1/f noise, with an rf bandwidth much narrower than the 50\nMHz Nyquist frequency (Fig. 2b) so there are no extraneous backgrounds or aliasing effects. As\ndiscussed above, the frequency axis is very well defined and contributes negligible error.\nLight shifts will be minimal since the intense NIR light is removed prior to the gas cell and the\nMIR light has a peak pulse intensity <1 W and broad spectrum. Self-pressure shifts can occur at\nour 200 mTorr pressure. They are known and can be corrected for the Q-lines [29] but have not\nbeen measured across the P or R branches. The corresponding shifts from 200 mTorr of N2\nwould be around −50 kHz [40]. Assuming the self-pressure shifts are double the N2-induced\nshifts, as is the case for the Q-branch [29], yields a potential systematic shift of around\n−100 kHz.\nAs mentioned earlier, nonlinearities that mix the amplitude or phase of the sensing comb teeth\nafter transmission through the methane can systematically distort the molecular signature. This\nsystematic does not appear in frequency metrology as the comb tooth frequencies are unaffected;\nit appears here because the comb tooth amplitude and phase, as well as its frequency, carry the\nsignal. Considering the low peak powers and minimal optical path overlap, optical nonlinearities\nare negligible. The same, however, is not true in the rf-domain and particularly in the\nphotodetection. We find a line-center shift of around ±1 MHz for the phase and amplitude that\ndepends on whether fA is positioned 1.2 THz below or above the center of the MIR comb (Fig.\n1b), corresponding to a forward or reverse mapping of the optical to the rf domain (and sign\nreversal of any nonlinear-induced shifts). Any real model of this systematic is quite complicated\nas it depends on the response of the photodetection to both incident pulse trains. This basic effect\nhas been modeled in the context of low phase noise microwave phase generation by\nphotodetection of a comb with some success [41], but the dual-comb system would require an\neven more sophisticated model of the detector response. Nevertheless, we can suppress this\nsystematic by acquiring data in each mapping at roughly the same power levels (to within 15%)\nand calculating the average. It is this average that is reported in Table I.\n9\n\n\fAs discussed in the previous Section, the ultimate evaluation of systematic shifts is based on the\ncomparison of Fig. 5. Based on these data and since the remainder of the data were acquired\nunder almost identical conditions, we assign 300 kHz as the overall systematic uncertainty.\nIV. CONCLUSION\nThese data represent the first accurate line center measurements made with a coherent dual-comb\nspectrometer and demonstrate some of its features relative to conventional spectroscopy.\nCompared to conventional high-resolution FTIR, the dual-comb spectrometer measures both\nphase and absorbance and provides line centers with about ten times better accuracy. Compared\nto Doppler-free saturated absorption spectroscopy, the dual-comb spectrometer has an order of\nmagnitude lower accuracy, but it completely avoids the demanding requirement of a high power\nlaser or build-up cavity to saturate the transition while also covering a broader spectral range.\nAdditionally, the accuracy of this spectrometer will be retained when measuring collisionally\nbroadened spectra. The SNR per root second is low compared to cw laser spectroscopy, but\ncoherent averaging yields high SNRs over many spectral elements (equal to 45 000 here). This\nwork focused on center frequency determination of Doppler-broadened lines at the level of\n3×10−9 fractional accuracy, but the ability to measure both phase and amplitude as well as the\nquality of the fits indicate the potential for line shape or line mixing studies, which remain an\nexperimentally challenging problem with important implications to greenhouse gas monitoring.\nThis work was funded by the National Institute of Standards and Technology (NIST). F.R.G.\nreceived support from the Swiss National Science Foundation (SNF) under grant no. PBNEP2127797. The authors acknowledge helpful discussions with F. Adler, L. Brown and L. NugentGlandorf.\n\nReferences:\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n\nJ. L. Hall. Rev. Mod. Phys. 78, 1279 (2006).\nT. W. Hänsch. Rev. Mod. Phys. 78, 1297 (2006).\nF.-L. Hong et al. Opt. Lett. 28, 2324 (2003).\nA. Czajkowski et al. Opt. Express 17, 9258 (2009).\nK. Takahata et al. Phys. Rev. A 80, 032518 (2009).\nS. A. Diddams, L. Hollberg, and V. Mbele. Nature 445, 627 (2007).\nM. Thorpe and J. Ye. Appl. Phys. B 91, 397 (2008).\nF. Adler et al. Ann. Rev. Anal. Chem. 3, 175 (2010).\n10\n\n\f[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n[29]\n[30]\n[31]\n[32]\n[33]\n[34]\n[35]\n[36]\n[37]\n[38]\n[39]\n[40]\n[41]\n[42]\n\nF. Keilmann, C. Gohle, and R. Holzwarth. Opt. Lett. 29, 1542 (2004).\nA. Schliesser et al. Opt. Express 13, 9029 (2005).\nS. Schiller. Opt. Lett. 27, 766 (2002).\nT. Yasui et al. Appl. Phys. Lett. 88, 241104 (2006).\nM. Brehm, A. Schliesser, and F. Keilmann. Opt. Express 14, 11222 (2006).\nI. Coddington, W. C. Swann, and N. R. Newbury. Phys. Rev. Lett. 100, 013902 (2008).\nP. Giaccari et al. Opt. Express 16, 4347 (2008).\nB. Bernhardt et al. Nature Photon. 4, 55 (2009).\nI. Coddington, W. C. Swann, and N. R. Newbury. Phys. Rev. A 82, 043817 (2010).\nI. Coddington, W. C. Swann, and N. R. Newbury. Opt. Lett. 35, 1395 (2010).\nB. Bernhardt et al. Appl. Phys. B 100, 3 (2010).\nJ. D. Deschenes, P. Giaccari, and J. Genest. Opt. Express 18, 23358 (2010).\nP. S. Ering et al. Opt. Comm. 151, 229 (1998).\nT. J. Quinn. Metrologia 40, 103 (2003).\nV. Boudon, M. Rey, and M. Loëte. J. Quant. Spectrosc. Radiat. Transfer 98, 394 (2006).\nL. Féjard et al. J. Mol. Spectrosc. 201, 83 (2000).\nS. Neshyba et al. J. Chem. Phys 101, 9412 (1994).\nL. Brown et al. J. Quant. Spectrosc. Radiat. Transfer 82, 219 (2003).\nA. Pine and T. Gabard. J. Mol. Spectrosc. 217, 105 (2003).\nS. Albert et al. Chem. Phys. 356, 131 (2009).\nA. Pine. J. Chem. Phys. 97, 773 (1992).\nB. K. Antony et al. J. Mol. Spectrosc. 251, 268 (2008).\nP. Malara et al. Opt. Express 16, 8242 (2008).\nP. Maddaloni, P. Cancio, and P. De Natale. Meas. Sci. Technol. 20, 052001 (2009).\nM. Gubin et al. Appl. Phys. B 95, 661 (2009).\nC. Erny et al. Opt. Lett. 32, 1138 (2007).\nT. A. Johnson and S. A. Diddams. submitted (2011).\nN. Leindecker et al. Opt. Express 19, 6296 (2011).\nM. Weiss and F. Walls. IEEE T. Instrum. Meas. 45, 265 (1996).\nS. P. Davis, M. C. Abrams, and J. W. Brault. Fourier Transform Spectrometry. Academic\nPress (2001).\nN. R. Newbury, I. Coddington, and W. C. Swann. Opt. Express 18, 7929 (2010).\nA. Pine and T. Gabard. J. Quant. Spectrosc. Radiat. Transfer 66, 69 (2000).\nW. Zhang et al. arXiv:1104.4495v1 (2011).\nL. S. Rothman et al. J. Quant. Spectrosc. Radiat. Transfer 110, 533 (2009).\n\n11\n\n\fFIG. 1. (a) Dual-comb spectrometer for amplitude and phase measurements of a gas sample by\nuse of a sensing comb that passes through the gas and a local oscillator (LO) comb with a\nrepetition rate that differs by ∆fr . (b) One-to-one mapping of the sensing comb teeth (red lines)\nto the rf domain achieved by heterodyning against the LO comb (purple lines) over the comb\nspectra (solid lines). The combs are phase-locked such that they overlap at the anchor tooth\nfrequency, fA, just below the optical spectrum for forward mapping (left side) or at f'A just above\nthe spectrum for reverse mapping (right side). Data is acquired with both forward and reverse\nmapping to reduce systematics associated with photodetection nonlinearities. Note that only one\ncomb transverses the sample in this configuration; if both do, the absorbance cannot be ascribed\nto a single tooth at a single frequency and the phase delay from the gas is not measured.\n\n12\n\n\fFIG. 2. (a) Coherent MIR dual-comb spectrometer for measurement of methane around 3.4 μm.\nGF: optical grating filter, FA: fiber amplifier, Ge: Germanium wedge, LP: 50 MHz low pass\nfilter, A/D: Analog-to-Digital converter, CW-lasers: 1.535 μm and 1.560 μm cw fiber lasers,\n1 μm: 1.064 μm cw fiber laser. (b) Measured rf amplitude (green) and phase (blue) versus rf\nfrequency (bottom scale) and calculated optical frequency (top scale) over a ~50 MHz rf\nwindow. The phase data shows the phase profile from the P(5) through P(7) transitions\nsuperimposed on the differential chirp (parabola) between the combs. A few spurious rf lines\nnear 10 MHz are fully rejected since they do not fall on the rf comb grid (i.e. at harmonics of\n∆fr). (c) An expanded 40 kHz rf span that clearly shows the discrete comb structure with a tooth\nseparation of ∆fr = 1.5 kHz in the rf or fr,S= 100 MHz in the optical, as in Fig. 1b. The observed\nfeatures are then P(6) F2(1) and E(1) lines. As in (b) the phase is only sensible, and plotted, at the\ncomb teeth positions. These data correspond to 1.34 s of continuous data acquisition and each rf\ntooth has a time-bandwidth limited linewidth of 0.75 Hz, without any software phase correction.\nFor times much beyond a few seconds, the linewidths are broadened but a simple linear software\nphase correction can maintain the time-bandwidth limited linewidth across the rf comb, for\nexample achieving 0.19 Hz linewidths over 5.3 s.\n\n13\n\n\fFIG. 3. (a) Normalized amplitude and phase spectra (linear scale) across the P, Q, and partial Rbranch. The baseline for the phase spectra was removed by a polynomial fit. The peak SNR is\n~3500 in amplitude or phase. (b) The corresponding absorbance, α(f)L (green), and phase, φ(f)\n(blue) after a 3rd order polynomial baseline fit, for the P(7) F1(2), E(1), F2(2), A2(1), F2(1), F1(1)\nsymmetry lines and the P(6) A1(1), F1(1), F2(2), A2(1),) F2(1), E(1) symmetry lines. The fit residuals\nfor the absorbance (green) and phase (blue) have standard deviations of 1.3×10−3 and 1.1×10−3\nrespectively, including both statistical and residual baseline noise.\n\n14\n\n\fFIG. 4: Example interleaved measurement of the F1(2) line of P(7), comprising four distinct sets\nof absorbance and phase spectra. For each set, the 1.064 μm laser was stepped by 25 MHz (solid\ncircles), so that the combined data have one quarter the normal spectral spacing of fr,S= 100 MHz\n(open circles). The fits demonstrate good agreement (residuals, solid line) with the expected\nDawson and Gaussian functions.\n\n15\n\n\fFIG. 5. Difference, ∆fSA, between our measured P(6) and P(7) line centers and saturatedabsorption data [5, 21, 22] for three data sets taken several weeks apart (green, pink, and black\ncircles). The error bars reflect the fit uncertainties. The mean offset is +58 kHz and the maximum\ndeviation is +275 kHz.\n\n16\n\n\fFIG. 6. Difference, ∆fFTIR, between our measurement and FTIR measurements from Refs. [28]\nand [42] for the P(1) to P(11) lines (87 THz to 90.2 THz), the stronger Q(n) lines (90.2 THz to\n90.5 THz) and the R(0) to R(2) lines (90.8 THz to 91.5 THz). ∆fFTIR is generally below the\n3 MHz quoted uncertainty of the FTIR data. (Four lines of [28] and 11 lines of [42] have\n>10 MHz difference and are off scale.)\n\n17\n\n\f18\n\n\f19\n\n\f"}