{"id": "http://arxiv.org/abs/0909.4440v2", "guidislink": true, "updated": "2010-09-28T07:48:05Z", "updated_parsed": [2010, 9, 28, 7, 48, 5, 1, 271, 0], "published": "2009-09-24T13:48:08Z", "published_parsed": [2009, 9, 24, 13, 48, 8, 3, 267, 0], "title": "An alternative scenario for the formation of specialized protein\n  nano-domains (cluster phases) in biomembranes", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0909.3921%2C0909.5627%2C0909.0857%2C0909.0019%2C0909.2525%2C0909.5153%2C0909.4919%2C0909.2909%2C0909.1411%2C0909.5425%2C0909.4483%2C0909.2162%2C0909.3627%2C0909.0169%2C0909.0777%2C0909.1084%2C0909.2459%2C0909.2416%2C0909.2934%2C0909.4010%2C0909.1124%2C0909.2089%2C0909.1973%2C0909.2020%2C0909.4391%2C0909.1649%2C0909.1418%2C0909.5515%2C0909.3633%2C0909.1883%2C0909.5621%2C0909.4792%2C0909.1388%2C0909.3054%2C0909.0549%2C0909.4462%2C0909.3422%2C0909.3403%2C0909.3349%2C0909.5677%2C0909.5339%2C0909.4702%2C0909.4229%2C0909.0182%2C0909.0070%2C0909.2908%2C0909.2929%2C0909.3105%2C0909.0197%2C0909.3773%2C0909.0895%2C0909.4275%2C0909.4713%2C0909.4848%2C0909.4166%2C0909.5223%2C0909.2601%2C0909.4634%2C0909.2946%2C0909.1894%2C0909.2380%2C0909.2016%2C0909.2224%2C0909.4930%2C0909.2499%2C0909.4210%2C0909.3825%2C0909.0105%2C0909.3129%2C0909.4240%2C0909.4440%2C0909.3122%2C0909.1961%2C0909.1405%2C0909.4265%2C0909.3769%2C0909.2114%2C0909.2110%2C0909.3130%2C0909.2912%2C0909.1378%2C0909.5632%2C0909.4465%2C0909.4046%2C0909.2195%2C0909.3126%2C0909.0980%2C0909.3058%2C0909.5111%2C0909.2792%2C0909.1431%2C0909.3259%2C0909.2846%2C0909.5260%2C0909.4915%2C0909.0919%2C0909.5683%2C0909.1253%2C0909.3704%2C0909.3575%2C0909.2217&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "An alternative scenario for the formation of specialized protein\n  nano-domains (cluster phases) in biomembranes"}, "summary": "We discuss a realistic scenario, accounting for the existence of\nsub-micrometric protein domains in cell membranes. At the biological level,\nsuch membrane domains have been shown to be specialized, in order to perform a\ndetermined biological task, in the sense that they gather one or a few protein\nspecies out of the hundreds of different ones that a cell membrane may contain.\nBy analyzing the balance between mixing entropy and protein affinities, we\npropose that such protein sorting in distinct domains can be explained without\nappealing to pre-existing lipidic micro-phase separations, as in the lipid raft\nscenario. We show that the proposed scenario is compatible with known physical\ninteractions between membrane proteins, even if thousands of different species\ncoexist.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0909.3921%2C0909.5627%2C0909.0857%2C0909.0019%2C0909.2525%2C0909.5153%2C0909.4919%2C0909.2909%2C0909.1411%2C0909.5425%2C0909.4483%2C0909.2162%2C0909.3627%2C0909.0169%2C0909.0777%2C0909.1084%2C0909.2459%2C0909.2416%2C0909.2934%2C0909.4010%2C0909.1124%2C0909.2089%2C0909.1973%2C0909.2020%2C0909.4391%2C0909.1649%2C0909.1418%2C0909.5515%2C0909.3633%2C0909.1883%2C0909.5621%2C0909.4792%2C0909.1388%2C0909.3054%2C0909.0549%2C0909.4462%2C0909.3422%2C0909.3403%2C0909.3349%2C0909.5677%2C0909.5339%2C0909.4702%2C0909.4229%2C0909.0182%2C0909.0070%2C0909.2908%2C0909.2929%2C0909.3105%2C0909.0197%2C0909.3773%2C0909.0895%2C0909.4275%2C0909.4713%2C0909.4848%2C0909.4166%2C0909.5223%2C0909.2601%2C0909.4634%2C0909.2946%2C0909.1894%2C0909.2380%2C0909.2016%2C0909.2224%2C0909.4930%2C0909.2499%2C0909.4210%2C0909.3825%2C0909.0105%2C0909.3129%2C0909.4240%2C0909.4440%2C0909.3122%2C0909.1961%2C0909.1405%2C0909.4265%2C0909.3769%2C0909.2114%2C0909.2110%2C0909.3130%2C0909.2912%2C0909.1378%2C0909.5632%2C0909.4465%2C0909.4046%2C0909.2195%2C0909.3126%2C0909.0980%2C0909.3058%2C0909.5111%2C0909.2792%2C0909.1431%2C0909.3259%2C0909.2846%2C0909.5260%2C0909.4915%2C0909.0919%2C0909.5683%2C0909.1253%2C0909.3704%2C0909.3575%2C0909.2217&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We discuss a realistic scenario, accounting for the existence of\nsub-micrometric protein domains in cell membranes. At the biological level,\nsuch membrane domains have been shown to be specialized, in order to perform a\ndetermined biological task, in the sense that they gather one or a few protein\nspecies out of the hundreds of different ones that a cell membrane may contain.\nBy analyzing the balance between mixing entropy and protein affinities, we\npropose that such protein sorting in distinct domains can be explained without\nappealing to pre-existing lipidic micro-phase separations, as in the lipid raft\nscenario. We show that the proposed scenario is compatible with known physical\ninteractions between membrane proteins, even if thousands of different species\ncoexist."}, "authors": ["Nicolas Destainville"], "author_detail": {"name": "Nicolas Destainville"}, "author": "Nicolas Destainville", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1209/0295-5075/91/58001", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0909.4440v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0909.4440v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "6 pages, 2 figures, published version", "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "q-bio.SC", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0909.4440v2", "affiliation": "LPT", "arxiv_url": "http://arxiv.org/abs/0909.4440v2", "journal_reference": "Europhysics Letters 91, 58001 (2010)", "doi": "10.1209/0295-5075/91/58001", "fulltext": "epl draft\n\nAn alternative scenario for the formation of specialized protein\nnano-domains (cluster phases) in biomembranes\nNicolas Destainville1,2\n1\n\narXiv:0909.4440v2 [cond-mat.soft] 28 Sep 2010\n\n2\n\nUniversité de Toulouse; UPS; Laboratoire de Physique Théorique (IRSAMC) - F-31062 Toulouse, France\nCNRS; LPT (IRSAMC) - F-31062 Toulouse, France\n\nPACS\nPACS\nPACS\n\n87.15.km – Protein-protein interactions\n05.65.+b – Self-organized systems\n87.16.A- – Theory, modeling, and simulations\n\nAbstract. - We discuss a realistic scenario, accounting for the existence of sub-micrometric\nprotein domains in cell membranes. At the biological level, such membrane domains have been\nshown to be specialized, in order to perform a determined biological task, in the sense that they\ngather one or a few protein species out of the hundreds of different ones that a cell membrane\nmay contain. By analyzing the balance between mixing entropy and protein affinities, we propose\nthat such protein sorting in distinct domains can be explained without appealing to pre-existing\nlipidic micro-phase separations, as in the lipid raft scenario. We show that the proposed scenario\nis compatible with known physical interactions between membrane proteins, even if thousands of\ndifferent species coexist.\n\nIntroduction. – Membrane functional organization\nis a ubiquitous issue in cell biophysics [1, 2]. It has become consensual that membrane constituents, predominantly lipids and proteins, adopt a non-random, heterogeneous organization [3]. Lateral segregation is now accepted as a fundamental requirement for membrane biological functions [4–7]. The immense variety of lipids and\nproteins in a single biomembrane (several hundred different species) leads to a large variety of interactions between them. These interactions have been demonstrated\nto favor the formation of membrane domains, whose size\nranges from few nanometers to microns. Domains can be\ninduced by lipid-lipid interactions (from which the concept\nof \"raft\" emerged [2,4,8]), lipid-protein interactions [9–12]\nor protein-protein interactions [13–17]. Understanding the\nrole of these domains and their physico-chemical origin remains a key problem in cell biology.\nThe physical scenario investigated in this work belongs\nto the protein-protein category above (even though lipids\ndo play a role because they indirectly participate in effective inter-protein interactions [10–12, 18, 19]). The proposal that protein-protein interactions can drive the formation of domains independently of a lipidic micro-phase\nseparation has recently been advanced by several research\ngroups [13–17]. Statistical mechanics arguments have\nbeen proposed, relying on the same global mechanism:\n\nwhile short-range attraction favors condensation of membrane proteins in a dense phase, some weaker repulsion at\nlonger-range, the origin of which is still debated, prevents\na complete phase separation. The resulting phase at equilibrium is called a \"cluster phase\" [15], by analogy with\nsimilar phases in soft condensed matter [20].\nHowever, these studies consider the clusterization of a\nsingle species of proteins, without taking into account the\nhundreds of different species in the cell membrane with\nwhich it coexists. In particular, they do not explain why\nthese other species are excluded from the clusters under\nconsideration. A priori, mixing entropy would stabilize\nmultiple-species clusters (Fig. 1). Understanding the specialization of clusters remains a matter in debate of cell\nbiology. Experiments demonstrate the existence of finitesize protein domains gathering a single or few species.\nThey are believed to have a precise biological function,\ne.g. (high-fidelity) signaling [5, 13, 21–24], cell adhesion\nand motility [25], immune response [26], endocytosis [27],\nexocytosis and membrane fusion [14, 28].\nThe present work proposes to solve this issue by coupling the previous cluster-phase model [15, 16] – accounting for a finite domain size – and a Flory-Huggins theory [29] – taking into account the great variety of membrane proteins. Proteins are classified into families so that\nthe same-family proteins, which are not necessarily iden-\n\np-1\n\n\fN. Destainville\nχc is small even if the number q of different families is\nvery large (up to 104 ) because χc ∝ kB T ln q, where kB T\nis the thermal energy. The main result of the present work\nis that a contact energy difference as small as 2 to 3 kB T\nsuffices to favor a demixed cluster phase where clusters are\nspecialized because they gather specific proteins. We show\nthat such contact-energy differences are indeed compatible\nwith known interactions between membrane proteins.\nDescription of the model. – We consider N\nisotropic (or weakly anisotropic) proteins interacting in\na 2D medium that accounts for the lipid \"sea\" in which\nproteins reside. Even though they are not explicitly taken\ninto account, lipids are responsible for effective interactions between proteins, of elastic or entropic nature (see\nbelow). We assume that the total interaction free energy\nof a protein configuration is the sum of pairwise potentials,\nX\nuij (ri − rj ),\n(1)\nUN (r1 , . . . , rN ) =\n1≤i<j≤N\n\nFig. 1: Two schematized views of membrane cluster phases,\nwith q = 4 different protein families (different colors). Top:\nif proteins of different families have a sufficiently high affinity,\nthey mix together in clusters. Bottom: in the opposite case,\nclusters are mono-colored, i.e. they are highly concentrated in\nproteins of one family because the ensuing energy gain is larger\nthan the related entropic cost. This phase-separation leads to\ncluster specialization because proteins that are destined to colocalize in same clusters indeed do so, spontaneously.\n\nwhere ri is the position of protein i. UN does not depend\non the protein orientations because we assume that they\nare isotropic or that anisotropy is sufficiently weak (see\nRefs. [30, 31] for the quantification of anisotropy effects) ;\nuij depends on i and j, because proteins can be of different\nnature 1 . Assuming a pairwise interaction is certainly an\napproximation since many-body effects are known to exist\nin this context [30,32,33,36]. Thus the present calculation\nis only a first step towards the full solution. We shall\nreturn to this point in the Discussion section.\nFollowing previous works (see [14, 15, 17] and references\ntherein), we assume that the potentials u are attractive at short range (R < 1 nm, i.e. roughly speaking\n\"at contact\") and weakly repulsive at intermediate range\n(R > 10 nm). The repulsion has been given several explanations [14, 15, 17, 34] which we do not intend to discuss\nhere (see Discussion). Indeed, in the \"liquid-droplet\" formalism adopted below, the precise shape of the potential\ndoes not qualitatively affect the results, in agreement with\nnumerical work [15]. Note that even a weak (a fraction of\nkB T ) intermediate-range protein-protein repulsion suffices\nto promote clusters [15].\nAs compared to these previous studies, we introduce\na new ingredient in our model: the dependence of the\nshort-range part of uij on protein families i and j.\nOrigins of the energy modulation at contact are manifold: direct electrostatic and polar interactions, even\nthough screened in physiological conditions, play a role at\nshort range; hydrophobic-mismatch interactions depend\non transmembrane-protein hydrophobic thicknesses [35–\n37]; in membrane with different lipid species, proteins\nrecruit lipids in their immediate vicinity for which they\nhave a higher affinity, because of electrostatic and hydrogen-bond interactions between lipids and polar or charged\namino acids of proteins. These lipid annuli, which \"wet\"\n\ntical, are those that tend to co-localize in same domains\nto form functional platforms, e.g. a G-protein-coupled receptor and associated G proteins and effectors [5, 6, 22].\nThe references [13, 14, 17, 21, 23–28] provide other examples. The model assumes that the same-family proteins\nhave a higher \"affinity\" at contact than proteins in distinct families, i.e. contact between proteins in the same\nfamily is energetically favored. This difference of affinity\nis measured by a parameter χ > 0, reminiscent of a Flory\ninteraction parameter.\nWe prove that if χ is smaller than a critical value χc ,\nclusters mix protein families because entropy dominates.\nIf χ > χc , clusters demix and are essentially composed of\n1 Note that in this paper, all energies and thermodynamic potena single family, the different families being segregated between different specialized clusters (Fig. 1). Furthermore, tials are implicitly expressed in units of kB T .\np-2\n\n\fFormation of specialized protein nano-domains in biomembranes\n\nthe proteins, are also responsible for effective attractive\nforces depending on the protein nature [10, 12].\nResults. – We first focus on the case where uij is independent of i and j (identical particles). We recall briefly\nthe formalism and notations introduced in Ref. [16] (see\nalso [38]). The canonical partition function for identical\nindistinguishable particles is\nZ(N ) =\n\nΛ−dN\nN!\n\nZ\n\ndr1 . . . drN e−UN (r1 ,...,rN ) ,\n\nV\n\n(2)\n\nN\n\nwhere the length Λ making Z dimensionless is set to be\nthe particle diameter [16]. V is the d-dimensional volume where particles evolve. Speaking of membrane nanodomains assumes that one is able to define regions Vk\nof V that partition the N particles into disjoint clusters:\nthere P\nare N1 monomers, N2 dimers, and so forth, so that\nN =\nkNk . Each k-particle cluster (or k-mer) dwells in\na distinct region Vk . Then neglecting interactions between\nthe different clusters [34,38], the integral in Eq. (2) can be\nwritten as a product of integrals over the Vk . After simple\nalgebraic manipulations [16],\nZ(N ) =\n\n\u0011Nk\nXY 1 \u0010\nV Λ−d e−F (k)\n,\nNk !\n\n(3)\n\n{Nk } k\n\nwhere we have introduced the free energy of a k-cluster,\nF (k): F (1) ≡ 0 for monomers and for k > 1,\n\u001a\nF (k)\n\n= − ln\n'\n\nΛd(1−k)\nk!\n\n−f k + γk\n\nd−1\nd\n\nZ\n\ndr1 . . . drk−1 e−Uk\n\n\u001b\n(4)\n\nVk\n\n+ σk α .\n\n(5)\n\nThe last approximation, valid when k \u001d 1, is at the core\nof the analytical calculations in Ref. [16] and will also be\nadopted in the present work 2 . Equation (5) is a generalization of the liquid-droplet model, to which a repulsion\nterm is added (see Ref. [16] for further details): (i) the first\nterm accounts for the short-range attraction between proteins and −f < 0 is a bulk free energy per particle; (ii) the\nsecond one represents the free-energy cost of the free interface between the cluster and the surrounding fluid and\nγ >√0 is a line tension. In dimension d = 2, this term scales\nas k, which means that protein domains are assumed to\nhave a disk shape [15]. Other shapes, such as stripes, can\nexist at very high protein concentrations that are not considered in the present work [39]; (iii) the last term, where\nα > 1, takes into account the weak longer-range repulsion, the strength of which is measured by σ > 0. Since it\ndominates at large k, it renders too large clusters unstable and is responsible for their finite size at equilibrium.\n2 Note\n\nthat as compared to this expression, k was replaced by\nk − 1 in Ref. [16] for technical reasons, which has no consequences\nin the large k limit of our interest, because it amounts to corrections\nof the order of 1/k. The present formulation will be more easily\ngeneralized below.\n\nNote that the exact form of F for small multimers is irrelevant because they are virtually nonexistent in the regime\nof parameters at hand [16].\nIn practice, we are interested in cases where cluster\nsizes range from a few dozen to a few thousand particles. This implies that σ < 1 (weak intermediate-range\nrepulsion) and f, γ \u001d 1 (moderate short-range attraction) [16]. For simplicity, we also set α = 3/2, and\nd = 2 because a membrane is two-dimensional. However the present derivations could be extended to any\nd and α. The mean volume fraction of k-clusters, ck ,\nderives from Z(N ) after introducing the chemical potential μ and switching to the grand-canonical ensemble: ck ≡ hNk iΛd /V = exp[μk − F (k)] = exp[−G(k; μ)],\nwhere G(k; μ) = F (k) − μk = −(f + μ)k + γk 1/2 + σk 3/2 is\nthe grand potential of a k-cluster [16]. The expected value\nof the protein volume fraction, φ ≡ hN iΛd /VP\n, sets the\n∞\nchemical potential μ through the condition φ = k=1 kck .\nAt low volume fraction φ, μ = ln c1 < ln φ takes large negative values and G(k) increases monotonously with k: ck\nis maximal at k = 1 and decreases exponentially with k,\nwith typical width |μ|−1 . The system is essentially composed of monomers. Above a critical concentration φc , the\nchemical potential μ > μc is such that G(k) has two local\nminima: one at k = 1 and one at k ∗ \u001d 1. The proteins\nare partitioned between a gas of monomers and clusters\nof typical aggregation number k ∗ . At the critical potential μc , G(k; μc ) has an inflexion point at k = k ∗ = k c .\nc\nc\n2\nc\nc\nThus μc and k c satisfy ∂√\nk G(k ; μ ) = ∂k G(k ; μ ) = 0.\nc\nc\nConsequently μ = −f + 3σγ and k = 1 + γ/(3σ) \u001d 1.\nIn the general case, where the system contains q families\nof proteins, one has to introduce new definitions. P\nMK is\nthe number of proteins of family K and N =\nMK .\nIf two particles of families K and K 0 are adjacent in the\nsame cluster, their binding energy at contact is denoted by\n\u000fK,K 0 . Due to thermal agitation, an entropic contribution\nmust be added to this energy, leading to an average free\nenergy per bond φK,K 0 ≈ \u000fK,K 0 [16]. This free energy can\nbe embodied in the Flory interaction parameter χK,K 0 =\nνφK,K 0 < 0 [29], where ν is the average number of particle\nneighbors in a cluster bulk (ν = 6 in the present case of\n2D dense clusters). If xK ≡ MK /N , the free energy per\nparticle of a homogeneous mixture of q families reads [29]:\nq\nX\n1\nF\n=\nxK ln xK +\nN\n2\nK=1\n\nq\nX\n\nχK,K 0 xK xK 0 .\n\n(6)\n\nK,K 0 =1\n\nBefore tackling the general case with q families of proteins, we first focus on q = 2, where A- and B-families coexist. To simplify the discussion, we assume that χAA =\nχBB and define χ = χAB − χAA > 0. The canonical partition function becomes Z(MA , MB ) and Eq. (3) must be\nadapted to this new situation: if NkA ,kB is the number of\nclusters containing kA A-proteins and kB B-proteins, then\n\u0001\nX\nY V Λ−d e−F (kA ,kB ) NkA ,kB\nZ=\n. (7)\nNkA ,kB !\n\np-3\n\n{NkA ,kB } kA ,kB\n\n\fN. Destainville\n\nHere F (1, 0) = F (0, 1) = 0 for monomers and\n)\n(\nZ k−1\nY\nΛd(1−k)\n−Uk\ndrl e\nF (kA , kB ) = − ln\nkA ! kB ! Vk\n\n(8)\n\nat xχ and 1 − xχ . When χ grows beyond χc , clusters\nare essentially mono-colored. Once xχ is determined, G\nbecomes a function of k:\nG(k; μ) = −[f + μ − h2 (xχ )]k + γk 1/2 + σk 3/2 .\n\nl=1\n\nif k ≡ kA +kB \u001d 1. Simplifying this expression to a liquiddroplet-like form [Eq. (5)] requires to discuss further the\ninternal organization of clusters. Two main scenarios must\nbe envisaged [40]: either A- and B-proteins are demixed in\na same k-cluster, with an interface between both phases,\nor they are homogeneously mixed. In contrast to previous studies where clusters are tackled in a canonical formalism because they cannot exchange material with their\nenvironment [40], the demixed case is always unfavorable\nin the present case for the following\nreason: it implies an\n√\nenergetic cost proportional to k per cluster due to the\ninterface between A- and B-rich phases. Thus replacing\nan assembly of demixed clusters by an assembly of A- and\nB-rich ones, of mixed type, is always favorable, because\nthe √ensuing entropic cost is of order 1 per cluster, thus\n\u001c k . Therefore we only consider mixed clusters below. If one defines the A-protein fraction of a k-cluster,\nx = kA /k, the Stirling formula leads to\nF (kA , kB )\n\n= k[x ln x + (1 − x) ln(1 − x)]\n(9)\n\u001a d(1−k) Z\n\u001b\nΛ\n− ln\ndr1 . . . drk−1 e−Uk\nk!\nVk\n\nTherefore the problem of minimization of G with respect\nto k now amounts to a one-family problem as considered\npreviously, with a renormalized f : fr = f − h2 (xχ ) and\nthus a renormalized μc . Note that if χ = 0, then xχ = 1/2\nand fr = f +ln 2. Indeed in the two-color case, the canonical partition function Z is normalized by MA ! MB ! instead\nof N ! because same-color particles are indistinguishable.\nThus the entropy is increased by ln 2 per particle as compared to the one-color case (when MA = MB ).\nThe generalization to any q is straightforward: F and\nG become functions of k and of the number fractions\nxK = kK /k (K = 1, . . . , q). We focus again on the\nmost symmetric case: χK,K = χ0 is independent of K,\nχK,K 0 = χm if K 6= K 0 and MK = N/q. We define\nχ = χm − χ0 > 0 and\nhq (x1 , x2 , . . . , xq ) = χ\n\nX\nK<K 0\n\nxK xK 0 +\n\nq\nX\n\nxK ln xK , (13)\n\nK=1\n\nthe mean-field free energy of the q-state Potts model [29],\nexact in the large q limit [41]. The transition is first-order\nwhen q ≥ 3. On gets\n\nfor k \u001d 1. The first term is the mixing entropy. The\nsecond one can now be written in a liquid-droplet-like form\nand Eq. (8) becomes\nF (kA , kB ) = −f k + γk 1/2 + σk 3/2 + kh2 (x)\n\n(12)\n\nχc = 2\n\nq−1\nln(q − 1) ' 2 ln q.\nq−2\n\n(14)\n\nAt χc , the majority number fraction is xc = 1 − 1/q,\nother colors have identical fractions x0 = 1/[q(q − 1)], and\nwhere −f = χAA /2 and\nhcq ' −1/q. Again, clusters are essentially mono-colored\nat the transition and beyond, while colors are mixed if\nh2 (x) ≡ χx(1 − x) + x ln x + (1 − x) ln(1 − x).\n(11)\nχ < χc . Figure 2 shows the typical phase diagram derived\nc\nEq. (14),\nThis expression of h2 is only a mean-field approximation from\n√ and from the fact that μ is renormalized:\nc\nbut it will become exact in the large q limit of interest μr = fr + 3σγ, with fr = f − hq . Note that if χ = 0,\nbelow [41]. Furthermore, we have chosen a line tension γ fr = f + ln q for the same reason as above. It must be\nindependent of x and this is also an approximation. We emphasized that in this phase diagram the \"transitions\" as\nshall return to this point below. We now introduce two determined above are not true thermodynamic transitions\nchemical potentials μA and μB and G(kA , kB ; μA , μB ) = because the finiteness of clusters smoothes transitions [42].\nF (kA , kB ) − μA kA − μB kB . Writing kA = xk and kB = More technically, the system grand potential J (still in\n(1−x)k, minimizing G with respect to kA and kB amounts units of kB T ) can be calculated:\nto minimizing it with respect to k and x. Beginning with\nX\nJ\nx, we remark that h2 (x)−μA x−μB (1−x) is the mean-field\n=−\nck1 ,...,kK\n(15)\nV\nfree energy of the Ising model in a magnetic field (μB −\nk1 ,...,kK\nμA )/2. Here we are interested in the situation where no\nprotein family dominates, i.e. where MA ≈ MB or μA ' where ck1 ,...,kK = exp[−G(k1 , . . . , kq ; μ1 , . . . , μq )] is the\n3\nμB . Thus we focus on the symmetric case μA = μB ≡ μ mean volume fraction of (k1 , . . . , kq )-clusters . The fact\nα\n(or MA = MB ). Then the mean-field Ising model in a that G is dominated at large k by σk with σ > 0 envanishing magnetic field presents a second-order transition sures the uniform convergence of the series and of all its\nat χc = 2. For a weak difference in protein affinities (χ < derivatives, and thus prevents any singularity.\nχc ), xχ = 1/2 is the most probable value and clusters\n3 Eq. (15) implies that P V = −J = N k T , where P is the dcl B\ntypically contain an equal number of A- and B-proteins. dimensional pressure and Ncl ≡ V P ck ,...,k is the total number\n1\nK\nBy contrast, if χ > χc , h2 (x) has two non-trivial minima of clusters. Thus the system behaves like an ideal gaz of clusters.\n(10)\n\np-4\n\n\fFormation of specialized protein nano-domains in biomembranes\n\nmonomers\n+ demixed\nclusters\n\n4\n\nmonomers\n3\n\nslope ~ q\n\nc\n\n!\n\n!\n\nmonomers\n+ mixed\nclusters\n\nslope ~ 2\n\n2\n\n1\n\n0\n\n0\n\n0.5\n\nc\n\nμ ! μ (!=0)\n\n1\n\nln q\n\n1.5\n\nFig. 2: Phase diagram in the (μ, χ) plane. It is calculated here\nin the case q = 3 but its qualitative aspect is valid for any q,\nwith χc ' 2 ln q [Eq. (14)]. The lines represent crossovers and\nnot true thermodynamic transitions, as discussed in the text.\n\nNote however that the real critical value differs from\nabove when q > k, because the xK do not take continuous but discrete values, xK = kK /k in a k-cluster (kK\nan integer). Thus no more than k variables xK can be\nsimultaneously non-vanishing and hq is to be minimized\non this subset of Rd , which amounts to a minimization\nof hk . Thus χc ' 2 ln k and xc ' 1 − 1/k. Generally\nspeaking, if k ∗ still denotes the typical cluster size, then\nχc ' 2 ln[min(k ∗ , q)]. In a similar way, in the phase diagram of Fig. 2, q should be replaced by min(k ∗ , q).\nDiscussion. – By appealing only to generic two-body\nprotein-protein interactions, we have shown that protein\nnano-domains may spontaneously form in biomembranes\nat equilibrium. One of the goals of the present approach is\nto account for the finite size of membrane nano-domains.\nOut-of-equilibrium arguments have also been developed to\nexplain this finite size [43,44]. In this respect, our goal here\nhas not been to discuss the relative merits of equilibrium\nor out-of-equilibrium approaches, which are certainly complementary, but to show that the equilibrium approach\nalone can yield finite-size nano-domains. Exploring the\nadditional effects of out-of-equilibrium phenomena in the\ncluster phase scenario could clarify their role. In particular, taking into account membrane recycling [43, 44] or\nproteins interacting differently with their partners when\nin an active state [45] should be tractable in the present\nformalism.\nFurthermore, we have shown that, in spite of the associated entropic cost, it becomes favorable to demix different\nprotein families in distinct domains when χ > χc with\nχc ' 2 ln[min(k ∗ , q)]. Here k ∗ is the typical cluster size.\nEven if min(k ∗ , q) ∼ 103 to 104 , a realistic upper-bound\nfor a real plasma membrane, χc ≈ 14 to 18, which means\n\nthat |\u000fK,K − \u000fK,K 0 | ' |φK,K − φK,K 0 | ≡ χc /ν ≈ 2 to\n3kB T . Is it realistic to expect such differences of contact energy between different protein families? The precise calculation of interaction energies for proteins embedded in a lipidic membrane is a tedious task that can be\nhardly tackled analytically. By contrast, several numerical studies have estimated the variations of the energy\nat contact for transmembrane proteins with variable hydrophobic thicknesses [18, 19, 36, 37]. All these studies are\nconsistent with contact energy differences larger than 3\nkB T . As far as lipid-mediated interactions are concerned,\nwe are not aware of any quantitative results in the literature. However, given the order of magnitude of this interaction [11, 12], its amplitude is likely to be modified by\none kB T or more due to interplay between lipid and protein species. Thus typical modulations of |\u000fK,K − \u000fK,K 0 |\ncan easily exceed 2 or 3 kB T . At the biological level,\nthis result shows that an important concentration of proteins in a biological membrane leads to their gathering and\nsorting in nano-domains. By contrast, below the critical\nconcentration, they would be distributed randomly on the\nmembrane. To this respect, increasing the concentration\nstrongly facilitates the encounter of proteins having a contact energy slightly lower than the average one, and thus\nfavors biological functions.\nThe line tension γ measures the free energy cost for a\nprotein to be at the cluster boundary as compared to the\nbulk. Indeed, a bulk particle has about twice as many\nneighbors as one at the boundary. Thus one would expect\nγ to depend on xχ and thus on χ. But clusters are essentially mono-colored at the transition and beyond, and one\nexpects γ to depend only weakly on χ in this region of the\nphase diagram.\nTo derive the form of the cluster free-energy F (kA , kB )\nin Eq. (10), or its q-color counterpart [see Eq. (13)], we\nhave assumed pairwise interaction potentials in Eq. (1),\nbecause inferring F (kA , kB ) in this particular case is easier [16]. Real potentials contain many-body contributions\nthat have for example been explored in Refs. [30, 33, 36].\nIn another work, long-range repulsion has been proposed\nto arise from steric interactions, of many-body origin by\nnature [14]. Even though it is a complex issue, fully taking\ninto account many-body interactions will be necessary to\nderive properly the effective parameters f , γ, σ or χ from\nfirst principles. Numerical simulations, that are out of\nthe scope of the present work, will certainly be required,\nbecause, e.g., the full calculation of long-range N -body\npotentials mediated by the elastic membrane requires to\ncompute the inverse and the determinant of a N by N matrix [33]. The estimation of many-body effects associated\nwith hydrophobic mismatch also requires intensive simualtions [36]. Note however that our whole argument relies\non the effective free energy F (k1 , . . . , kq ) and not on the\nexact shape of the potential UN from which F (k1 , . . . , kq )\nensues.\nIt would be interesting to investigate the role of strongly\nanisotropic inclusions in the future, because in this case,\n\np-5\n\n\fN. Destainville\n\nthe long-range interaction can become attractive [31]. We\nanticipate that the cluster-phase scenario remains valid if\nonly a minority of proteins are strongly anisotropic, that\nare homogeneously mixed in clusters (we recall that proteins of a same family are not necessarily identical but are\nclassified according to their short-range affinities ; thus\nthey are miscible in each cluster). Indeed, in this case,\nthe repulsive energy still grows faster than the cluster aggregation number k (i.e. α > 1 in Eq. (5)), because the\nmajority of long-range interactions in the cluster remain\nrepulsive. The main ingredient for the existence of stable\nclusters is preserved [15].\nWe have also assumed that χK,K 0 can only take two\npossible values, χ0 if K = K 0 or χm if K 6= K 0 . The reality is more complex because of the great variety of membrane proteins. Future studies would also have to consider more realistic distributions of χ-parameters around\nthese typical values. The asymmetric case where MK (or\nμK ) depends on K should also be explored. The function\nG({kK }; {μK }) will then have to be minimized numerically, providing distributions of the xK and cluster sizes k.\nHowever, we anticipate that our conclusions will be qualitatively unchanged since the present approach captures\nthe essential physical ingredient, namely the competition\nbetween energy and configurational entropy.\nFinally, our predictions ought to be tested experimentally. Förster Resonance Energy Transfer (FRET) is an\nappropriate tool to quantify the distance between tagged\nbio-molecules [46]. After incorporating different proteins species in giant vesicles, tagged with different fluorophores [22], it would be possible to test qualitatively\nthe predictions of the present work by playing on physical\nparameters such as the asymmetry of the proteins or the\nthickness of the lipidic membrane.\n∗∗∗\nI am indebted to Manoel Manghi and Laurence Salomé\nfor helpful discussions and comments, and to Revaz Ramazashvili for his kind reading of the manuscript.\nREFERENCES\n[1] Lenne P.-F. and Nicolas A., Soft Matter, 5 (2009) 2841.\n[2] Jacobson K., Mouritsen O.G. and Anderson R.G.,\nNat. Cell Biol., 9 (2007) 7.\n[3] Engelman D.M., Nature, 438 (2005) 578.\n[4] Simons K. and Ikonen E., Nature, 387 (1997) 569.\n[5] Davare M.A., et al., Science, 293 (2001) 98.\n[6] Laporte S.A., Oakley R.H. and Caron M.G., Science,\n293 (2001) 62.\n[7] Rozenfeld R. and Devi L.A., Trends Pharmacol. Sci.,\n31 (2010) 124.\n[8] Pike L.J., J. Lipid Res., 47 (2006) 1597.\n[9] Sprong H., van der Sluijs P. and van Meer G., Nat.\nRev. Mol. Cell Biol., 2 (2001) 504.\n[10] Poveda J.A., et al., Biochim. Biophys. Acta, 1778\n(2008) 1583.\n\n[11] Gil T., Sabra M.C., Ipsen J.H. and Mouritsen O.G.,\nBiophys. J., 73 (1997) 1728.\n[12] Gil T., et al., Biochim. Biophys. Acta, 1376 (1998) 245.\n[13] Daumas F., et al., Biophys. J., 84 (2003) 356.\n[14] Sieber J.J., et al., Science, 317 (2007) 1072.\n[15] Destainville N., Phys. Rev. E, 77 (2008) 011905.\n[16] Destainville N. and Foret L., Phys. Rev. E, 77 (2008)\n051403.\n[17] Gurry T., Kahramanogullari O. and Endres R.G.,\nPLoS One, 4 (2009) e6148.\n[18] de Meyer F.J.M., Venturoli M. and Smit B, Biophys.\nJ., 95 (2008) 1851.\n[19] West B., Brown F.L.H. and Schmid F., Biophys. J.,\n96 (2009) 101.\n[20] Stradner A., et al., Nature, 432 (2004) 492.\n[21] Park P.S. and Palczewski K., Nat. Chem. Biol., 1\n(2005) 184.\n[22] Abankwa D. and Vogel H., J. Cell Sci., 120 (2007)\n2953.\n[23] Prior I.A., et al., Nat. Cell Biol., 3 (2001) 368.\n[24] Tian T., et al., Nat. Cell Biol., 9 (2007) 905.\n[25] Espenel C., et al., J. Cell Biol., 182 (2008) 765.\n[26] de Bakker B.I., et al., ChemPhysChem, 8 (2007) 1473.\n[27] Frick M., et al., Curr. Biol., 17 (2007) 1151.\n[28] Hess S.T., et al., Proc. Natl. Acad. Sci. USA, 104\n(2008) 17370.\n[29] de Gennes P.-G., Scaling concepts in polymer physics\n(Cornell University Press, Ithaca, 1979).\n[30] Dommersnes P.G. and Fournier J.-B., Eur. Phys. J.\nB, 12 (1999) 9.\n[31] Chou, T., Kim K.S., and Oster G., Biophys. J., 80\n(2001) 1075.\n[32] Kim K.S., Neu J.C., and Oster G.F., Europhys. Lett.,\n48 (1999) 99.\n[33] Fournier J.-B., Dommersnes P.G. and Galatola P.,\nC. R. Biologies, 326 (2003) 467.\n[34] McConnell H.M. and Moy V.T., J. Phys. Chem., 92\n(1988) 4520.\n[35] Dan N., Pincus P. and Safran S.A., Langmuir, 9\n(1993) 2768.\n[36] Brannigan G. and Brown F.L.H., Biophys. J., 92\n(2007) 864.\n[37] Schmidt U., Guigas G., and Weiss M., Phys. Rev.\nLett., 101 (2008) 128104; Phys. Rev. Lett., 102 (2009)\n219802.\n[38] Mitchell D.J. and Ninham B.W., J. Chem. Soc. Trans.\n2, 77 (1981) 601.\n[39] Sear R.P., et al., Phys. Rev. E, 59 (1999) R6255.\n[40] Christensen A., Stoltze P. and Norskov J.K., J.\nPhys.: Condens. Matter, 7 (1995) 1047.\n[41] Mittag L. and Stephen M.J., J. Phys. A: Math. Nucl.\nGen., 7 (1974) L109.\n[42] Ruckenstein E. and Nagarajan R., J. Phys. Chem.,\n79 (1975) 2622.\n[43] Foret L., Europhys. Lett., 71 (2005) 508.\n[44] Turner M.S., Sens P. and Socci N.D., Phys. Rev.\nLett., 95 (2005) 168301.\n[45] Phillips R., Ursell T., Wiggins P. and Sens P., Nature, 459 (2009) 379.\n[46] Lakowicz J.R., Principles of Fluorescence Spectroscopy,\n3rd edition (Springer-Verlag, New York, 2006).\n\np-6\n\n\f"}