{"id": "http://arxiv.org/abs/1102.2885v1", "guidislink": true, "updated": "2011-02-14T20:50:38Z", "updated_parsed": [2011, 2, 14, 20, 50, 38, 0, 45, 0], "published": "2011-02-14T20:50:38Z", "published_parsed": [2011, 2, 14, 20, 50, 38, 0, 45, 0], "title": "On the apparent horizon in fluid-gravity duality", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1102.1428%2C1102.2998%2C1102.3802%2C1102.3543%2C1102.4415%2C1102.4636%2C1102.1400%2C1102.3582%2C1102.5244%2C1102.4360%2C1102.4389%2C1102.0845%2C1102.2900%2C1102.5419%2C1102.2158%2C1102.4277%2C1102.4574%2C1102.3956%2C1102.3677%2C1102.3203%2C1102.0115%2C1102.3242%2C1102.5280%2C1102.0840%2C1102.2717%2C1102.2885%2C1102.4625%2C1102.4743%2C1102.4236%2C1102.0943%2C1102.3586%2C1102.0455%2C1102.1993%2C1102.5460%2C1102.0167%2C1102.0671%2C1102.0047%2C1102.0173%2C1102.1098%2C1102.1329%2C1102.4252%2C1102.1465%2C1102.5489%2C1102.2370%2C1102.0712%2C1102.0562%2C1102.2630%2C1102.3205%2C1102.3360%2C1102.4590%2C1102.1140%2C1102.4120%2C1102.4402%2C1102.1042%2C1102.3509%2C1102.3097%2C1102.5166%2C1102.1006%2C1102.1699%2C1102.4523%2C1102.3846%2C1102.4008%2C1102.3746%2C1102.0442%2C1102.1980%2C1102.0657%2C1102.3235%2C1102.3757%2C1102.4468%2C1102.1404%2C1102.2705%2C1102.5033%2C1102.2472%2C1102.2988%2C1102.0746%2C1102.4616%2C1102.4410%2C1102.2769%2C1102.0254%2C1102.5433%2C1102.3552%2C1102.3875%2C1102.4965%2C1102.5452%2C1102.2949%2C1102.1084%2C1102.1608%2C1102.2118%2C1102.5716%2C1102.4988%2C1102.4613%2C1102.2122%2C1102.1750%2C1102.2492%2C1102.4999%2C1102.0777%2C1102.1545%2C1102.0286%2C1102.2551%2C1102.2549%2C1102.1219&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "On the apparent horizon in fluid-gravity duality"}, "summary": "This article develops a computational framework for determining the location\nof boundary-covariant apparent horizons in the geometry of conformal\nfluid-gravity duality in arbitrary dimensions. In particular, it is shown up to\nsecond order and conjectured to hold to all orders in the gradient expansion\nthat there is a unique apparent horizon which is covariantly expressible in\nterms of fluid velocity, temperature and boundary metric. This leads to the\nfirst explicit example of an entropy current defined by an apparent horizon and\nopens the possibility that in the near-equilibrium regime there is preferred\nfoliation of apparent horizons for black holes in asymptotically-AdS\nspacetimes.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1102.1428%2C1102.2998%2C1102.3802%2C1102.3543%2C1102.4415%2C1102.4636%2C1102.1400%2C1102.3582%2C1102.5244%2C1102.4360%2C1102.4389%2C1102.0845%2C1102.2900%2C1102.5419%2C1102.2158%2C1102.4277%2C1102.4574%2C1102.3956%2C1102.3677%2C1102.3203%2C1102.0115%2C1102.3242%2C1102.5280%2C1102.0840%2C1102.2717%2C1102.2885%2C1102.4625%2C1102.4743%2C1102.4236%2C1102.0943%2C1102.3586%2C1102.0455%2C1102.1993%2C1102.5460%2C1102.0167%2C1102.0671%2C1102.0047%2C1102.0173%2C1102.1098%2C1102.1329%2C1102.4252%2C1102.1465%2C1102.5489%2C1102.2370%2C1102.0712%2C1102.0562%2C1102.2630%2C1102.3205%2C1102.3360%2C1102.4590%2C1102.1140%2C1102.4120%2C1102.4402%2C1102.1042%2C1102.3509%2C1102.3097%2C1102.5166%2C1102.1006%2C1102.1699%2C1102.4523%2C1102.3846%2C1102.4008%2C1102.3746%2C1102.0442%2C1102.1980%2C1102.0657%2C1102.3235%2C1102.3757%2C1102.4468%2C1102.1404%2C1102.2705%2C1102.5033%2C1102.2472%2C1102.2988%2C1102.0746%2C1102.4616%2C1102.4410%2C1102.2769%2C1102.0254%2C1102.5433%2C1102.3552%2C1102.3875%2C1102.4965%2C1102.5452%2C1102.2949%2C1102.1084%2C1102.1608%2C1102.2118%2C1102.5716%2C1102.4988%2C1102.4613%2C1102.2122%2C1102.1750%2C1102.2492%2C1102.4999%2C1102.0777%2C1102.1545%2C1102.0286%2C1102.2551%2C1102.2549%2C1102.1219&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "This article develops a computational framework for determining the location\nof boundary-covariant apparent horizons in the geometry of conformal\nfluid-gravity duality in arbitrary dimensions. In particular, it is shown up to\nsecond order and conjectured to hold to all orders in the gradient expansion\nthat there is a unique apparent horizon which is covariantly expressible in\nterms of fluid velocity, temperature and boundary metric. This leads to the\nfirst explicit example of an entropy current defined by an apparent horizon and\nopens the possibility that in the near-equilibrium regime there is preferred\nfoliation of apparent horizons for black holes in asymptotically-AdS\nspacetimes."}, "authors": ["Ivan Booth", "Michal P. Heller", "Grzegorz Plewa", "Michal Spalinski"], "author_detail": {"name": "Michal Spalinski"}, "author": "Michal Spalinski", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.83.106005", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1102.2885v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1102.2885v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1102.2885v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1102.2885v1", "arxiv_comment": null, "journal_reference": "Phys.Rev.D83:106005,2011", "doi": "10.1103/PhysRevD.83.106005", "fulltext": "On the apparent horizon in fluid-gravity duality\nIvan Booth∗\nDepartment of Mathematics and Statistics\nMemorial University of Newfoundland\nSt. John's, Newfoundland and Labrador, A1C 5S7, Canada\n\nMichal P. Heller†\nInstituut voor Theoretische Fysica, Universiteit van Amsterdam\n\narXiv:1102.2885v1 [hep-th] 14 Feb 2011\n\nScience Park 904, 1090 GL Amsterdam, The Netherlands\n\nGrzegorz Plewa‡\nSoltan Institute for Nuclear Studies, Hoża 69, 00-681 Warsaw, Poland\n\nMichal Spaliński§\nSoltan Institute for Nuclear Studies, Hoża 69, 00-681 Warsaw, Poland\nand Physics Department, University of Bialystok, 15-424 Bialystok, Poland.\nThis article develops a computational framework for determining the location of boundarycovariant apparent horizons in the geometry of conformal fluid-gravity duality in arbitrary dimensions. In particular, it is shown up to second order and conjectured to hold to all orders in the\ngradient expansion that there is a unique apparent horizon which is covariantly expressible in terms\nof fluid velocity, temperature and boundary metric. This leads to the first explicit example of an entropy current defined by an apparent horizon and opens the possibility that in the near-equilibrium\nregime there is preferred foliation of apparent horizons for black holes in asymptotically-AdS spacetimes.\nPACS numbers: 11.25.Tq, 04.50.Gh, 04.20.Gz.\nKeywords: Gauge/gravity duality, Black Holes, Quasilocal horizons.\n\n∗\n†\n‡\n§\n\nibooth@mun.ca\nm.p.heller@uva.nl; On leave from: Soltan Institute for Nuclear Studies, Hoża 69, 00-681 Warsaw, Poland\ng.plewa@ipj.gov.pl\nmichal.spalinski@fuw.edu.pl\n\n\f2\nI.\n\nINTRODUCTION\n\nThe AdS/CFT correspondence [1–3], or more generally gauge-gravity duality, demonstrates a deep and fascinating\nlink between black hole physics and the plasma phase dynamics of certain (holographic) strongly coupled gauge\ntheories. Over the last 10 years the gravitational side of the correspondence has also started to be used as a tractable\ntheoretical model of strongly interacting non-Abelian media with properties similar to quark-gluon plasma studied\nfirst at RHIC and now also at the LHC (see [4] for the most recent review of these developments). Early efforts in the\napplications of gauge-gravity duality methods to hot QCD matter were motivated by hydrodynamic simulations of the\nexpanding fireball created in heavy ion collisions and focused on obtaining transport properties of holographic plasmas\nby analyzing low-lying quasinormal modes and linear response theory. These results provided concrete numerical\npredictions for the simplest transport coefficients of strongly coupled non-Abelian media with N = 4 super Yang-Mills\n\nplasma as the primary example1 and have eventually led to the formulation of fluid-gravity duality [6]. Fluid-gravity\nduality is a correspondence which maps solutions of relativistic Navier-Stokes equations describing holographic liquids\nto long-wavelength distortions of black branes in higher dimensional geometry. The direct connection between the\ndynamics of black objects in higher dimensional spacetimes and solutions of nonlinear hydrodynamics provided an\nopportunity to understand black brane geometries and their features in terms of dual fluids, as well as to gain insights\nabout hydrodynamics from the properties of Einstein's equations. These perspectives, as well as the possibility of\napplications, have generated significant interest in the nonlinear dynamics of black brane spacetimes.\nDynamical black holes and their characterization has also been an important research theme in mathematical relativity\nfor the last couple of decades (see [7–9] for useful reviews of this subject). The exact characterization of a dynamical\nblack hole has proven to be a surprisingly thorny theoretical problem for general relativity. The standard textbook\ndefinition associates black hole interiors with regions of spacetime from which no signal can ever escape [10]. Thus,\nfinding the exact extent of such a region is necessarily a teleological procedure: properly defining \"ever\" and \"escape\"\nmeans that one must examine the ultimate fate of all signals from a point before ruling whether or not that point is\npart of the black hole. Identifying the event horizon boundary of a causal black hole is similarly teleological. Thus,\neven though an event horizon is a congruence of null geodesics obeying the same rules as any other congruence, its\nevolution can appear to be acausal. For example the area increase of an event horizon is not directly driven by\ninfalling matter or energy; instead the actual effect of an influx through the event horizon is a decrease in its rate of\nexpansion.\nThese observations are not just mathematical curiosities. The non-local nature of the event horizon is acceptable as\nlong as one treats it as a causal boundary removing the region containing a curvature singularity from the dynamics\nof the rest of spacetime2 and does not associate any physical characteristics with it. However, this is not the only\nrole of the event horizon – for the last four decades, one of the most celebrated results of black hole physics has\nbeen the link between the area of the event horizon and entropy. Already in the 1960s it was established that event\nhorizons necessarily increase in area [10] and this has usually been interpreted as being equivalent to the second\nlaw of thermodynamics. Thus, the apparently acausal expansion of event horizons would seem to imply a similarly\nacausal evolution of entropy. This leads to problems since the origin of black hole entropy needs to be sought within\nmicroscopic theories underlying gravitational interactions in the sense of the holographic principle [11, 12]. For\n\n1\n2\n\nFor an excellent review of these early developments see [5].\nHence guaranteeing consistency of low energy description of black holes in terms of classical gravity.\n\n\f3\nasymptotically flat or asymptotically de Sitter spacetimes such theories are not known (in principle one could imagine\nany of these being non-local [13]), but in the anti-de Sitter context these are local quantum field theories in a suitably\nunderstood large Nc limit. At the superficial level it is hard to judge whether acausality of the event horizon is a real\nproblem in the first two cases, but in the AdS/CFT context it definitely is.\nThe teleological nature of the event horizon is one of the main motivations for the ongoing research program to\ncharacterize black holes (quasi)locally, identifying their interiors from the presence of strong gravitational fields rather\nthan on the basis of the causal structure of the entire spacetime. Quasilocal horizons go by such names as trapping\n[14], isolated or dynamical horizons (the last two are both reviewed in [7]). In all cases though, these horizons can\nbe thought of as generalizations of the classical apparent horizons [10]. Recall that apparent horizons are associated\nwith foliations of spacetimes. Areas of strong gravitational field are identified with the region on each surface that\nis covered by trapped surfaces. The boundary of that region is an apparent horizon and it is the outermost surface\nfor which the outgoing light front does not expand in area3 . With a slight abuse of terminology the union of such\nsurfaces over all time slices is often also referred to as an apparent horizon and it is in this sense that it will be used\nit here.\nIn the context of gauge-gravity duality characteristics of black holes with planar horizons in higher dimensional\nspacetimes are at the same time the quantities describing dual finite energy density or finite charge density states\nof local quantum field theories. In static situations, where the acausal nature of the event horizon plays no role,\nthe entropy defined by the event horizon was identified with the thermodynamic entropy of a dual holographic field\ntheory. Such entropy satisfies a very strong constraint: the first law of thermodynamics linking IR quantities (i.e.\ntemperature and entropy density) with UV quantities (the energy density). Since the latter are well defined in the dual\nquantum field theories (energy density is the expectation value of one of the components of the energy-momentum\ntensor in thermal equilibrium), there are no controversies with associating thermodynamic entropy with the event\nhorizon in time-independent situations. However in static situations (at least in the context of Kerr-Newman black\nholes/branes) the event horizon and one of apparent horizons coincide, so that by associating the entropy with the\nevent horizon one actually associates it at the same time with an apparent horizon. The latter identification actually\nturns out to be more robust, as the example of conformal soliton flow [15] suggests [16].\nBeyond equilibrium three problems arise. The first follows from the aforementioned nonlocality of the event horizon,\nthe second comes from foliation dependence of apparent horizons, whereas the third one is related to the various\nways in which one can associate points on any of horizons with points on the boundary (this is referred to as the\nbulk-boundary map [17]). The last of these is necessary to localize the entropy production in the dual field theory. To\nillustrate that the first issue is a serious problem quite disconnected from any ambiguities of the bulk-boundary map,\none can consider the example of gravitational dynamics with a sharp distinction between a dual equilibrium regime\nwithout entropy production and a dynamical transition with dissipation. The relevant backgrounds, much in the\nspirit of the Vaidya solution, appeared in the context of the thermalization problem of strongly coupled non-Abelian\nmedia and describe gravitational processes in which the dual quantum field theory undergoes a transition between\ntwo equilibrium states in a finite time interval [18, 19]. In such a situation the event horizon evolves past the bulk\nlightcones spanned by the transition region on the boundary. The latter patch of bulk spacetime is dual to the boundary\nregion where the holographic field theory is in equilibrium, so that its thermodynamic entropy stays constant. This\n3\n\nIt is also required that ingoing light front shrinks in area and that inside this surface there are other surfaces, such that both ingoing\nand outgoing light fronts emitted from them shrink in area. For a more precise definition see Section III or the review articles [7, 8].\n\n\f4\nresult strongly suggests that the causal boundary of a black hole is not the relevant entropy carrier regardless of any\nambiguities of the bulk-boundary map [16]. In contrast with the area of the event horizon, the entropy defined by\nthe unique apparent horizon respecting symmetries of 1-dimensional boundary dynamics considered in [18, 19] was\nconstant before the transition process and eventually in the far future agreed with the one given by the event horizon.\nIn less symmetric situations, apart from the choice of bulk-boundary map, the foliation dependence of apparent\nhorizons becomes a significant issue – different foliations of spacetime lead to different apparent horizons. The\nmost trivial and at the same time pessimistic possibility is that the notion of local entropy does not extend beyond\nequilibrium situations and foliation dependence, as well as the freedom of bulk-boundary mapping, signal exactly\nthis. It might also be that on the dual field theory side there are many relevant local notions of entropy and different\napparent horizons correspond to such different notions. Yet another possibility is that the field theory notion of\nentropy does not suffer from ambiguities of kinds introduced by foliation dependence of apparent horizons, which\nmight be used as a guiding principle for finding preferred apparent horizon.\nResolving these issues in the general case is very difficult if not impossible, so the only hope is to proceed example\nby example. In global equilibrium the foliation dependence essentially vanishes and the event and apparent horizons\ncoincide. In the near-equilibrium regime one expects the horizons to be \"close\" (in a sense of [20] or [21]) so that a\ndynamical apparent horizon behaves almost like an isolated horizon. If one takes the near-equilibrium regime as point\nof departure for further studies, one is immediately led to considering apparent horizons in the geometry of fluidgravity duality. This background captures the hydrodynamic regime on the field theory side starting from a locally\nboosted and dilated black brane supplemented with gradient corrections [6] and from this perspective hydrodynamics\ncan be regarded as the simplest (because of its universality) type of collective dynamics that quantum field theory\ncan undergo.\nThe generalization of entropy to hydrodynamics is provided by the notion of an entropy current. Such a current is\nconstructed phenomenologically in the gradient expansion by requiring that in equilibrium it reproduces thermodynamic entropy and that its divergence evaluated on solutions of the equations of hydrodynamics is non-negative. A\ndetailed analysis of the consequences of this generalized second law of thermodynamics on the form of the entropy\ncurrent in [22] showed that even up to second order in gradients there is an ambiguity inherent in such a definition4 .\nFrom the point of view of fluid-gravity duality it was very natural to ask what is the gravity interpretation of the\ncoefficients appearing in the boundary hydrodynamic entropy current and what might be the bulk counterpart of the\nambiguity in its definition. In the pioneering work [17] a candidate entropy current was obtained by mapping the area\ntheorem on the event horizon onto the boundary along ingoing null geodesics. In general, there are infinitely many\ndirections in which such geodesics can propagate from the boundary, but hydrodynamic covariance requires that such\ngeodesics close to the boundary move in the direction specified (at leading order of the gradient expansion) by the\nlocal fluid velocity [17]. Ambiguities appearing in such procedure appear at third and higher orders in the gradient\nexpansion and were irrelevant in the second order construction of [17, 22]. This causal bulk-boundary map can be\nsupplemented with suitably understood boundary diffeomorphisms and the latter turn out to capture precisely the\nambiguity discussed in [22].\nFurthermore, in a recent paper [23] it was shown that for a fixed bulk-boundary map the same freedom in entropy\ncurrent can be understood as coming from different bulk hypersurfaces with a fixed foliation satisfying a generalized\n\n4\n\nPart of the ambiguity is trivial and comes from a term whose divergence vanishes.\n\n\f5\narea theorem and asymptoting to the event horizon. Such surfaces were dubbed \"generalized horizons\" with the\nevent horizon and the (asymptoting to it) apparent horizon being just two particular instances of the more general\nnotion. From the perspective of the phenomenological definition of the hydrodynamic entropy current none of these\nhypersurfaces and none of the available bulk-boundary maps is favored over any other. However, causality of the\nboundary field theory seems to favor the entropy current dual to the apparent horizon – providing that it is free of the\nambiguities related to foliation dependence and that the bulk-boundary map in use is causal. The task of this paper\nis to elaborate on the proposal [24] by presenting a derivation of the apparent horizon in the geometry of fluid-gravity\nduality, its features, as well as discussing the properties of the dual entropy current.\nThe organization of the paper is the following. Section II presents in a self-contained fashion the geometry dual to\nconformal fluid dynamics in arbitrary dimensions obtained in [25]. Section III is the main part of the paper and\nprovides the detailed calculation of the relevant apparent horizon in the case of conformal fluid-gravity duality up to\nsecond order in gradients. Section IV focuses on the hydrodynamic side of fluid-gravity duality and analyzes the dual\nentropy current using the technology introduced in [24]. The general discussions of the results and possible future\ndirections of research are provided in Section V. Appendix A provides some details on the Weyl-covariant derivative\nand Weyl-covariant hydrodynamic tensors, whereas Appendix B illustrates the methods developed in Section III by\ndescribing the construction of an apparent horizon in the Vaidya spacetime. Readers interested mostly in the generalrelativistic aspects of these considerations can skip Section IV and regard the paper as an example of a perturbative\ncalculation of an apparent horizon in a geometry governed by Einstein's equations with negative cosmological constant.\n\nII.\n\nTHE GEOMETRY OF FLUID-GRAVITY DUALITY\n\nThe geometry of fluid-gravity duality in arbitrary dimensions [25] is a solution to Einstein gravity with negative\ncosmological constant\nId+1\n\n1\n=\n16πGN\n\nZ\n\ndd+1 x\n\n√\n\n−G {R + d (d − 1)} ,\n\n(1)\n\nwhere GN is the (d + 1)-dimensional Newton's constant and the AdS radius is set to 1. The action (1) arises in the\ncontext of string theory (for d = 2, 3, 4 and 6, see [26] for details) and describes a sector of decoupled dynamics of\nthe one-point function of the energy-momentum tensor operator in planar strongly coupled holographic conformal\nfield theories [25]. The equations of motion derived from (1) support a d-parameter family of exact, static black hole\nsolutions with planar horizons obtained by boosting and dilating the AdS-Schwarzschild black brane solution\n2\n\nμ\n\nds = 2uμ dx dr − r\n\n2\n\n1−\n\n1\n(rb)\n\nd\n\n!\n\nuμ uν dxμ dxν + r2 (gμν + uμ uν ) dxμ dxν .\n\n(2)\n\nHere gμν denotes components of the flat Minkowski metric on the conformal boundary of the asymptotically AdS\nspacetime (2). The boost parameter uμ is a d-component velocity in the xμ directions, normalized so that uμ uμ = −1\n\nin the sense of the boundary metric gμν . The lines of constant xμ in (2) are ingoing null geodesic, for large r\n\npropagating in the direction set by uμ , and the radial coordinate r parametrizes them in an affine way [17]. The\ngeometry (2) may be regarded as a stack of constant-r d-dimensional planes, starting from the boundary at r = ∞\n\n(which is d-dimensional Minkowski spacetime) right down to the curvature singularity at r = 0. The latter is shielded\nby the event horizon at r = 1/b, which is at the same time an (isolated) apparent horizon. The dilation parameter b\n\n\f6\nappearing in (2) is related to the Hawking temperature T of the event horizon by\nb=\n\nd\n.\n4πT\n\n(3)\n\nUnlike black holes in asymptotically flat spacetime, the metric (2) supports perturbations varying much slower within\nthe transverse planes than within the radial direction. The parameter controlling the scale of variations in the radial\ndirection is b.\nIf b, uμ and gμν are allowed to vary slowly compared to the scale set by b, the metric (2) should be an approximate\nsolution of nonlinear Einstein's equations with corrections organized in an expansion in the number of gradients in the\nxμ directions. Direct calculations [6] have shown that proceeding in this way is a systematic way of solving Einstein's\nequations, provided that the dual energy-momentum tensor [27, 28] depending on b and uμ is conserved. For the\nmetric (2) the dual energy-momentum tensor is that of a relativistic perfect fluid with a conformal equation of state\nT μν = ǫuμ uν + pP μν ,\n\n(4)\n\nPμν = gμν + uμ uν\n\n(5)\n\nwhere\n\nis the projector operator onto the space transverse to uμ ,\nǫ = (d − 1) p = (d − 1)\n\n1\nb−d\n16πGN\n\n(6)\n\nand gμν is some weakly curved metric in which the fluid lives.\nBoth the metric (2) and the energy-momentum tensor (4) receive gradient corrections. The separation of scales\nmentioned earlier implies that corrections to the metric (2) will be tensorial quantities made of xμ -derivatives of b,\nuμ and gμν with scalar functions of r and b as coefficients. The relevance of these terms is suppressed by the number\nof gradients and for practical reasons the expansion is terminated at the 2-derivative level. The tensorial quantities\nin question are scalars S, transverse (uμ V μ = 0) vectors V μ and transverse (uμ Tμν = 0) traceless symmetric rank 2\ntensors Tμν 5 . A priori one should consider all possible terms, as was done originally in [6]. This task can however be\ngreatly simplified by utilizing the underlying conformal symmetry and seeking Weyl-invariant solutions of Einstein's\nequations, i.e. solutions invariant under simultaneous rescalings of\ngμν → e−2φ gμν ,\n\nu μ → eφ uμ ,\n\nb → e−φ b and r → eφ r\n\n(7)\n\nwhere φ depends on the coordinates xμ [25]. The leading order metric (2) is Weyl-invariant, but due to the presence\nof dr it does not retain its form at higher orders. It can however be written in a manifestly Weyl-invariant form upon\nintroducing a vector field Aν defined by [29]\nAν ≡ uλ ∇λ uν −\n\n∇λ uλ\nuν .\nd−1\n\n(8)\n\nThis quantity is of order one in the gradient expansion and transforms as a connection under Weyl-transformations\nAν → Aν + ∂ν φ .\n5\n\n(9)\n\nIt needs to be borne in mind, that all these quantities are also required to be independent when evaluated on lower order solutions of\nhydrodynamics.\n\n\f7\nThe Weyl-invariant form of the metric (2) reads\n2\n\nμ\n\nν\n\nds = 2uμ dx (dr − Aν dx ) − r\n\n2\n\n1−\n\n1\n(rb)\n\nd\n\n!\n\nuμ uν dxμ dxν + r2 (gμν + uμ uν ) dxμ dxν .\n\n(10)\n\nThis metric is a leading order approximation to a spacetime whose metric is of the form\nds2 = Gab dxa dxb = −2uμ dxμ (dr + Vα dxα ) + Gμν dxμ dxν\n\n(11)\n\nwith the condition uμ Gμν = 0 completely fixing the gauge freedom. The subleading corrections to (10) need to be\n\nWeyl-invariant and the simplest way to construct them is by summing individual Weyl-invariant contributions order\nby order in the gradient expansion. A single Weyl-invariant contribution to (11) can be represented as a scalar\nfunction of the Weyl-invariant combination rb multiplying a Weyl-covariant (i.e. transforming homogeneously under\nWeyl transformations of b, uμ and gμν , see Appendix A) tensor of a given weight w supplemented with a factor of bw .\n\nA powerful tool in generating Weyl-covariant gradient terms is the Weyl-covariant derivative Dμ , which uses the\n\nconnection Aμ (8) to compensate for derivatives of the Weyl factor coming from derivatives of Weyl-covariant tensors.\n\nIt has the property that a Weyl-covariant derivative of a Weyl-covariant expression is itself Weyl-covariant with the\nsame weight (see Appendix A or the original publications [17, 25, 29] for details).\n\nAt first order in gradients there is only a single Weyl-covariant term available, which is the shear tensor of the fluid\nσμν . It reads\nσμν =\n\n1\n(Dμ uν + Dν uμ )\n2\n\n(12)\n\nand transforms with Weyl-weight 3. At second order in gradients, there are in total 10 Weyl-covariant terms: 3\nscalars, 2 transverse vectors and 5 transverse traceless symmetric rank 2 tensors. For convenience these objects can\nbe defined with appropriate powers of b to render them Weyl-invariant. The scalar contributions read\nS1 = b2 σμν σ μν ,\n\nS2 = b2 ωμν ω μν\n\nand S3 = b2 R,\n\n(13)\n\nwhere ω is the vorticity of the flow and R is the Weyl-covariant curvature tensor and curvature scalar (see Appendix\n\nA for details). The Weyl-invariant transverse vectors are\nV1 μ = bPμν Dρ σ νρ\n\nand V2 μ = bPμν Dρ ω νρ\n\n(14)\n\nFinally, the Weyl-invariant tensors read\n\nT4 μν\n\nT1 μν = uρ Dρ σμν , T2 μν = Cμανβ uα uβ , T3 μν = ωμρ σρν + ωνρ σρμ ,\n1\n1\nPμν σαβ σ αβ and T5 μν = ωμρ ωρν +\nPμν ωαβ ω αβ ,\n= σμρ σρν −\nd−1\nd−1\n\n(15)\n\nwhere Cμανβ is a Weyl-covariantized curvature tensor (consult Appendix A for its detailed form).\nThe metric (11) up to second order in gradients can be expressed in terms of (12), (13), (14) and (15) and takes the\n\n\f8\nform\nVμ = r2 Buμ + rAμ\n1\n1\n2r\n+\nLV1μ +\n(−b−1 (V2μ + V1μ ) + b−2 uμ (S2 − S1 +\nS3 )) −\nd−2\n2(d − 1)\n(br)d−1\nr2\n1\n1\nK 2 S1 )\n+ uμ ( b−d−2 r−d S2 +\n4\n2(d − 1) (br)d\n\n(16)\n\nGμν = r2 Pμν + 2br2 F σμν +\n\n1\n2r2\n1\nPμν b−2 S2 ) + 2b2 r2 F 2 (T4μν +\nPμν b−2 S1 ) −\nK1 S1 Pμν +\nd−1\nd−1\nd−1\n− 2b2 r2 H1 (T1μν + T4μν + T2μν ) + 2b2 r2 H2 (T1μν + T3μν )\n− (T5μν −\n\n(17)\n\nwhere\nB=−\n\n1\n(1 − (br)d ).\n2(br)d\n\n(18)\n\nThe quantities F, H1 , H2 , K1 , K2 , L are functions of br introduced in [25] and read\nZ ∞ d−1\ny\n−1\nF (br) ≡\ndy,\nd\nbr y(y − 1)\nH1 (br) ≡\n\nZ\n\n∞\n\nbr\n\ny d−2 − 1\ndy,\ny(y d − 1)\n\n(20)\n\n∞\n\nZ ξ\n\u0002\n\u0003\ndξ\nH2 (br) ≡\ny d−3 dy 1 + (d − 1)yF (y) + 2y 2 F ′ (y)\nd\nbr ξ(ξ − 1) 1\nZ ∞\nZ ξ d−2\ndξ\ny\n−1\n1\ndy,\n= F (br)2 −\nd\nd\n2\nbr ξ(ξ − 1) 1 y(y − 1)\nZ\n\n(19)\n\nK1 (br) ≡\n\nK2 (br) ≡\n\nZ\n\n∞\nbr\n\ndξ\nξ2\n\n∞\n\nZ\n\ndy y 2 F ′ (y)2 ,\n\n(22)\n\nξ\n\n∞\n\ndξ \u0002\n1 − ξ(ξ − 1)F ′ (ξ) − 2(d − 1)ξ d−1\n2\nξ\nbr\n\u0015\nZ\n\u0001 ∞\n+ 2(d − 1)ξ d − (d − 2)\ndy y 2 F ′ (y)2 ,\nZ\n\n(21)\n\n(23)\n\nξ\n\nL(br) ≡\n\nZ\n\n∞\n\nZ\n\nξ d−1 dξ\n\nbr\n\n∞\n\nξ\n\ndy\n\ny−1\n.\n− 1)\n\n(24)\n\ny 3 (y d\n\nThe metric given above is a solution of Einstein equations with negative cosmological constant up to second order\nin gradients, provided that b and uμ satisfy the equations of dual hydrodynamics, i.e. the equations of covariant\nconservation of the energy-momentum tensor obtained from (16) by holographic renormalization\nTμν = p(gμν + duμ uν ) − 2ησμν − 2ητω (T1 μν + T3 μν ) + 2ηb(T1 μν + T2 μν + T4 μν ),\n\n(25)\n\nwhere\ns\n1\nη=\n,\n=\n4π\n16πGN bd−1\n\nτω = b\n\nZ\n\n1\n\n∞\n\ny d−2 − 1\ndy,\ny(y d − 1)\n\np=\n\n1\nbd .\n16πGN\n\n(26)\n\n\f9\nThe geometric picture emerging is that of spacetime locally approximated by tubes of uniform black branes spanned\nalong ingoing null geodesics given by lines of constant xμ . The dilation and boost parameters b and uμ , as well as the\nboundary metric gμν vary from tube to tube, but, as anticipated, the scales of these variations are small compared\nto variations of the bulk metric along the radial null direction [17]. Due to this tubewise approximation, the leading\norder geometry of fluid-gravity duality inherits the causal structure of static black brane, i.e. the event horizon located\nat r = 1/b, now with b depending on xμ [17]. It is to be expected, and is confirmed by direct calculation further in\nthe text, that the event horizon of (2) with slowly varying b, uμ and gμν is at the same time an apparent horizon.\nSuch an apparent horizon is called isolated and does not lead to entropy production. The isolated apparent horizon\nat r = 1/b is expected to become dynamical once corrections to (2) are included and its position will also be modified.\nThe dynamics of this almost isolated apparent horizon can be described in a gradient expansion much in the spirit of\nthe framework of slowly evolving horizons [30–32].\n\nIII.\n\nLOCATING THE APPARENT HORIZON IN THE GEOMETRY OF FLUID-GRAVITY DUALITY\n\nThis section is devoted to identifying an apparent horizon for the spacetimes defined by the metric (11). This search\nwill be based on two criteria: 1) from the isolated horizon contained in the unperturbed geometry (2) it is natural to\nexpect the apparent horizon to be a perturbation of the hypersurface r = 1/b(x) and 2) to ensure compatibility with\nthe dual conformal fluid solution those perturbations are required to be manifestly Weyl-invariant.\n\nA.\n\nPreliminaries\n\nApparent horizons are defined in terms of trapped and marginally trapped surfaces. In both cases the term \"surface\"\nmeans a codimension-two hypersurface Ω embedded in a larger spacetime. The normal space to such a surface is\nspanned at any point by a pair of null vectors l and n. The following considerations apply to spacetimes where it\nmakes sense to specify that both of these are future-oriented and respectively outwards and inwards pointing. It is\nconvenient to cross-normalize them so that l * n = −1 (this leaves a degree of scaling freedom).\nThe induced metric on Ω can be written as\nq̃ab = gab + la nb + lb na ,\n\n(27)\n\nwhile the outward and inward null expansions of Ω are\nθ(l) = q̃ ab ∇a lb = Ll log\n\np\np\nq̃ and θ(n) = q̃ ab ∇a nb = Ln log q̃\n\n(28)\n\nor, more generally, for an arbitrary normal vector X = Al + Bn\n\nθ(X) = Aθ(l) + Bθ(n) .\n\n(29)\n\nNow Ω is said to be outer trapped if θ(l) < 0, trapped if θ(l) < 0 and θ(n) < 0 and untrapped if θ(l) = 0 and θ(n) < 0. It\nis outer marginally trapped if θ(l) = 0 and marginally trapped if θ(l) = 0 and θ(n) < 0. Trapped surfaces are indicative\nof black hole regions, with well-known theorems linking them to both singularities and the existence of event horizons\n[10]. As recalled in the introduction they are also used to define apparent horizons [10]. Given a foliation of spacetime\n\n\f10\ninto spacelike hypersurfaces Σt (\"instants\" of time) one can define the total trapped region on each Σt as the union\nof all the outer trapped surfaces. Then (up to some technicalities which will be ignored here) the boundary of each\nof those regions Ωt is outer marginally trapped and known as the apparent horizon. A common abuse of terminology\n(adopted in the following) also uses the term apparent horizon to refer to the hypersurface defined by the evolving Ωt\n(that is the union of the Ωt ).\nIn practical calculations, this definition of an apparent horizon is not very usable and instead one just searches directly\nfor hypersurfaces foliated by outer marginally trapped surfaces. This is common practice in numerical relativity (see,\nfor example, [9] and references therein). More generally, the teleological nature of classical black holes and their\nevent horizons has lead many to search for a (quasi)local and properly causal replacement. Horizons foliated by\n(outer) marginally trapped surfaces which (hopefully) bound regions of trapped surfaces are the most obvious and\nmathematically tractable candidates.\nFor example, the boundaries of stationary black holes (or branes) are taken to be weakly isolated horizons:\ncodimension-one hypersurfaces that are foliated by outer marginally trapped surfaces or isolated horizons if their\nextrinsic geometry is also invariant (see for example the discussions in [33, 34] or review articles such as [7–9]). These\nare closely related (though more general than) Killing horizons and under many circumstances do a good job of\ncharacterizing a stationary black hole boundary without reference to causal structure or infinities. This is particularly\nso if one adds extra conditions to ensure that there are fully trapped surfaces \"just inside\" the horizon. For Hayward's\n[14] future outer trapping horizons (FOTHs) one assumes that\nθ(n) < 0 and Ln θ(l) < 0 .\n\n(30)\n\nThat is, the inward expansion is negative and under a small inwards deformation the outward expansion also becomes\nnegative. The black branes considered in this paper are examples of FOTHs.\nFor the classical definition, it is clear that time-evolved apparent horizons are foliation dependent: different foliations\nwill sample a different set of trapped surfaces and so give rise to a different \"time-evolved\" horizon. Alternatively,\nfocusing on the time-evolved horizon itself, it can be shown (see, for example [31, 35]) that a hypersurface foliated\nby outer marginally trapped surfaces is not rigid and may be deformed while maintaining its properties. The nonuniqueness of apparent horizons has been explicitly demonstrated in several papers [36, 37].\n\nB.\n\nFinding the horizon: strategy\n\nProblems with uniqueness are somewhat alleviated in the present calculation by the xxrequirement that perturbations\nof the horizon be manifestly Weyl covariant. Then, the time-evolved apparent horizon ∆ should be specified as the\nlevel set of a scalar function\nS(r, x) = b(x)r − g(x) ,\n\n(31)\n\nwhere g(x) is a Weyl-invariant scalar defined by\ng(x) = g1 (x) + g2 (x) + . . .\n\n(32)\n\n\f11\nwhere gk denotes a linear combination of all Weyl-invariant scalars at order k in the gradient expansion. There are\nno Weyl-invariant scalars at order 1, and 3 at order 2, so one expects to find\ng1 (x) = 0\ng2 (x) = h1 S1 (x) + h2 S2 (x) + h3 S3 (x) ,\n\n(33)\n\nwhere the Si are the 3 independent Weyl-invariant scalars (13) and the constants hi will be determined by solving\nθ(l) = 0 and the conditions (30). Once this is done, the expression for the position of the apparent horizon will take\nthe form\nr = rH (x) ≡\n\n1\n(1 + h1 S1 (x) + h2 S2 (x) + h3 S3 (x)) .\nb\n\n(34)\n\nThis is a strong constraint, but a reasonable one to impose in a perturbative regime where physical considerations\nsuggest that the horizon should be given by a Weyl covariant structure. Testing these surfaces as potential horizons\nmeans that one must consider their possible foliations and find out whether any of them satisfy θ(l) = 0 and the\nconditions (30). Again however, one can lean on the Weyl covariance to simplify the calculation. Specifically, the\nouter marginally trapped surfaces of ∆ will have their own (in ∆) normal v. This vector is required to be expressible\nas a sum of Weyl invariant terms and further that it be surface forming\nv ∧ dv = 0 .\n\n(35)\n\nThough this only really needs to apply on the horizon itself, it turns out to be computationally much easier to check\nthis condition for v specified not only on the putative horizon but also in some neighbourhood. Thus, in practice one\nshould look for Weyl-covariant one-form fields that are surface forming in some neighbourhood of ∆.\nThus the search domain will not be arbitrarily large, but rather be restricted to potential horizons and foliations that\nare essentially Weyl-covariant perturbations of the unperturbed boosted black brane solution (2). Marginally outer\ntrapped surfaces are to be sought among intersections of these classes. It will be shown in the following that for\nthe geometry of fluid-gravity duality, up to second order in the gradient expansion the conditions θ(l) = 0 and (35)\ndetermine v (as well as the hi in (34)) uniquely.\n\nC.\n\nFinding the horizon: hypersurfaces and intersections\n\nThe program outlined above can be implemented as follows. The normal covector to a surface of the form (31) is\nm = dS ,\n\n(36)\n\nm = r∂μ b dxμ + b dr .\n\n(37)\n\nwhich up to second order in the gradient expansion is\n\nThe function g does not contribute above, since the leading term involves ∂μ g2 , which is of third order in gradients.\nIt is convenient to write the normal in terms of the Weyl-covariant derivative, which acting on b (Weyl weight −1) is\nDμ b = ∂μ b − Aμ b .\n\n(38)\n\n\f12\nOne then has6\nm = r (Dμ b + bAμ ) dxμ + b dr .\n\n(39)\n\nRaising the index using the metric (11) one gets (using the formula for the inverse given in [25]), up to second order\n\u0012\n\u0013\n2 1\n1\n1\n1\n2\n1\nμ\nμ\nm = bu + b V1 (−\n+\nL) + V2\n+\nd br (d − 2) (br)2\n(br)d\n(d − 2) (br)2\nμ\n\nμ\n\n2\n\nmr = 2 Br2 b − Aμ bruμ +\n\u0012\n\u0013\n1\n1\n1 1\n2\n2\n1\n1\n2\n1\n+\n)S2 + (−\nbr −\n+\nK2 )S1 +\nS3 .\n(\n+\nb\n(d − 2) 2 (br)d\nd(d − 1)\nd − 2 (d − 1) (br)d−2\n(d − 2) (d − 1)\n\n(40)\n\n(41)\n\nNext one must consider potential foliations of ∆. As noted earlier, the foliation of the apparent horizon can be\nspecified by a vector field v which is tangent to ∆ and but otherwise normal to the leaves. Given a parametrization\ny μ of the horizon so that S(r(y), x(y)) ≡ const, this means that\n∂S ∂r\n∂S ∂xβ\n+ β α = 0.\nα\n∂r ∂y\n∂x ∂y\n\n(42)\n\nIn terms of this coordinate system the tangent vectors are, of course, ∂/∂y α which push-forward into the full space\ntime as\n~eμ =\n\n∂xa ∂\n∂y μ ∂xa\n\n(43)\n\nand applying (42) one finds\n∂xβ\n~eμ =\n∂y μ\n\n(\n\n∂\n−\n∂xβ\n\n\u0012\n\n∂S\n∂r\n\n\u0013−1 \u0012\n\n∂S\n∂xβ\n\n\u0013\n\n∂\n∂r\n\n)\n\n.\n\n(44)\n\nBy construction these vectors all satisfy v * m = 0 (as they should).\nIt is very convenient to choose the coordinates on the horizon y μ = xμ . This should be reasonable as long as the\nhorizon does not \"fold over\"; this should be the case in this perturbative, gradient expansion limit. This choice also\nhas the advantage of making the bulk-boundary map trivial (as discussed in Section IV). Then the tangent vectors\nto ∆ can be written as\n~eβ =\n\n∂\n−\n∂xβ\n\n\u0012\n\n∂S\n∂r\n\n\u0013−1 \u0012\n\n∂S\n∂xβ\n\n\u0013\n\n∂\n∂r\n\n(45)\n\nand a general vector field tangent to the horizon is given by\nv = v μ~eμ .\nIn terms of the coordinate basis in the bulk one then has\n(\n\u0013−1 \u0012\n\u0013 )\n\u0012\n∂\n∂S\n∂\n∂S\nβ\nv=v\n.\n−\nβ\nβ\n∂x\n∂r\n∂x\n∂r\n\n6\n\n(46)\n\n(47)\n\nRecall now that the geometry found in [25] satisfies Einstein equations provided that the equations of hydrodynamics are satisfied by\nthe quantities b, uμ (in terms of which also Aμ is expressed). These equations imply [25] that Db is of the second order in gradients.\n\n\f13\nRequiring that the vector v be Weyl covariant fixes (up to second order)\nv μ = buμ + {V1 μ b2 c1 + V2 μ b2 c2 + uμ (S1 be1 + S2 be2 + S3 be3 )}\n2\nv r = −rAμ buμ + S1 r\n,\nd(d − 1)\n\n(48)\n(49)\n\nwhere c1 , c2 , e1 , e2 and e3 are some constants. It is computationally convenient to normalize v so that\nm2 + v 2 = 0 ,\n\n(50)\n\nin which case the coefficients of the longitudinal terms in (48) vanish\ne1 = e2 = e3 = 0 .\n\n(51)\n\nThe remaining coefficients (c1 , c2 ) appearing in v are also not arbitrary. As discussed earlier, to ensure that the vector\nv defines a foliation one has to impose the Frobenius condition (35). There are two types of terms, which turn out to\nbe given by\nv[μ ∂ν vρ] = 0\n\u0013\n\u0012\n\u0013\n\u0012\n1\n1\n1\nV1[ν uμ] + d c2 −\nV2[ν uμ]\nv[r ∂ν vρ] = d c1 + −\nd d−2\nd−2\n\n(52)\n\nup to terms of higher order in the gradient expansion. This determines the coefficients c1 and c2\n2\nd(d − 2)\n1\n.\nc2 =\nd−2\n\nc1 =\n\nThis way one finds that the foliation vector v is completely determined once ∆ is fixed\n\u0013\n\u0012\n1 2 2 μ\nv μ = buμ +\nb\nV1 + V2μ .\nd−2\nd\n\n(53)\n\n(54)\n\nSince the Frobenius condition was imposed for the full spacetime (rather than just on the horizon), this vector v\nactually gives rise to foliation of the full spacetime, at least in a neighborhood of the horizon.\nIt is interesting that one gets a unique result. It seems plausible that this will also be the case at higher orders in the\ngradient expansion. To see this, note that at a given order k, v is entirely specified in terms of its v μ components, and\nits v r component does not depend on the k-th order contribution to v μ . In complete analogy with the second order,\nv μ at order k will be a linear combination of all available transverse and longitudinal vectors. The hypersurface ∆ is\nspecified as the level set of a scalar function S(r, x) (see (31)), which at order k contains all the available hydrodynamic\nscalars of order k. The vector m normal to ∆ is defined by m = dS, so the construction does not introduce any\nfurther coefficients to be determined. Now consider the normalization condition (50) and expand the v 2 contribution\nGμν v μ v ν − 2uμ Vν v μ v ν − 2uμ v μ v r + m2 = 0.\n\n(55)\n\nIn order to evaluate the k-th order contribution to (55) from v μ it is sufficient to take the zeroth order metric. Note\nhowever that since at leading order v μ is proportional to uμ and Gμν is transverse, the first term on the left hand side\n\nof (55) vanishes for all r. Since v r does not receive corrections from the k-th order v μ , the only term which depends\n\n\f14\non this is actually uμ Vν v μ v ν . But since Vμ is also proportional to uμ at leading order, the whole left hand side of (55)\n\nat order k depends only on the longitudinal contributions to v μ at this order. If so, formula (55) fixes them uniquely\n\nand does not constrain the transverse contributions. What is left at order k are scalar contributions to S(r, x) and\ntransverse contributions to v μ . But at a given order, transverse and longitudinal quantities are independent, so the\nscalar condition θl at order k fixes all the contributions to S(r, x). The transverse components of v μ , relevant for the\nfoliation of ∆, are likely to be fixed by the Frobenius condition (35) in analogy with what happens at second order.\nIt can be checked that the contributions in question will appear in the Frobenius conditions, but it seems difficult\nto show that by choosing the transverse parts appropriately one can satisfy Frobenius conditions at any order. One\nargument that this is indeed the case is that such a condition must be satisfied for v μ on the event horizon at arbitrary\norder and in this case v μ is fixed and given by mμ . It would certainly be interesting to make these statements more\nprecise.\n\nD.\n\nHorizons\n\nDynamical quasilocal horizons are spacelike and so m should be timelike and v spacelike. Without loss of generality\none can assume that m is future pointing and v is outward pointing. Then the null normals to the surfaces of constant\nS and v are\nv = l − Cn\nm = l + Cn ,\n\n(56)\n\nwhere the scalar C is called the evolution parameter [30, 31]. In this case\nC=\n\n1 2\nv .\n2\n\n(57)\n\nThe sign of the evolution parameter indicates whether ∆ is spacelike or timelike (or null if C = 0). The signs of the\ncoefficients in (56) have been chosen to ensure that both l and n are future-pointing, and l is outward-pointing while\nn is inward-pointing.\nThe null normals are then\nlμ = buμ +\n\u0012\n\u0013\n1\n1\n1\n1 1\n1\n1\n1\nμ\n(−2\n+\nc\n)\n+\nV\n+\n2L\n+\nc\n)\n+\n+ b2 V2 μ (\n2\n1\n1\n2\n(d − 2) (br)2\nd rb (d − 2) (rb)2\n(rb)d\n\nlr = −Aμ bruμ + Br2 b +\n\u0012\n\u0013\n1\n1\n1\n1\n1\n1 1\n1 1\n+ b−1 S2 (\n)\n+\nS\n(−\nK\n)\n+\n+\n+\nS\n1\n2\n3\nd − 2 4 (br)d\nd − 2 2 (d − 1) (br)d−2\n2(d − 2) (d − 1)\n\n(58)\n\n(59)\n\nand\n1\nn =\n2Br2\n1\nnr = − .\nb\nμ\n\n\u0013\n\u0012\n1\n1\n1\n1\n1\nμ 2 1\nμ\n−2\nL + c1 ) + V2 (−\n+ c2 )\n−\nV1 (\nd rb (d − 2) (rb)2\n(rb)d\n(d − 2) (rb)2\n\n(60)\n(61)\n\n\f15\nAs a check on the results obtained so far one can determine the location of the event horizon and compare with [25].\nUsing the explicit form of the evolution parameter C (obtained from (57))\nC = −Bb2r2 + (\n\n1\n1\n2\n1 1\n1 1\n1\n1\n1\nK2 +\n)S2 −\n−\nbr)S1 − (\n+\nS3 (62)\n(d − 2) 2 (d − 1) (br)d−2\nd(d − 1)\n(d − 2) 4(rb)d\n2 (d − 2) (d − 1)\n\nit is easy to calculate where the event horizon is located. On general grounds one expects a result of the form (34).\nSolving C(rEH ) = 0 one finds (34) with\n(EH)\n\nh1\n\n(EH)\n\nh2\n\n(EH)\n\nh3\n\n1\n2(d2 + d − 4)\n−\nK2 (1)\nd2 (d − 1)(d − 2) d(d − 1)\nd+2\n=−\n2d(d − 2)\n1\n=−\n,\nd(d − 1)(d − 2)\n\n=\n\n(63)\n\nwhich matches the results of [25].\nNote that because the event horizon is null it must be the case that v is proportional to m. Using (63) and the explicit\nform of m and v, it may be checked directly that this is indeed the case.\nTo determine the position of the apparent horizon one needs to calculate the null expansions from the forms (28)\nθ(l) = q̃ ab ∇a lb and θ(n) = q̃ ab ∇a nb ,\n\n(64)\n\nwhere the metric induced on the foliation slices is calculated from (27). Using the results of the previous section one\nfinds (up to second order)7\n\u0012\n\u0012\n1\n1\n1\n1\n1\n+\nK2 −\nBb2 r3 K1′ (1))+\nS1 (−\nθ(l) = (d − 1) Bbr +\nd−2\nbr\n(d − 2) 2(d − 1) (br)\nd−1\n\u0013\u0013\n1\n1\n1\n1\n1 1\n+ S2 (−\n)\n+\nB+\n+\nS\n3\nd−1\n(d − 2) 4 (br)d\n2 (d − 1)(d − 2)\n\u0013\n\u0012\nd−1\n1\n1\nθ(n) = −\nS2 + rK1′ S1 .\n+\nbr\nbr (br)2\n\n(65)\n(66)\n\nNote that the results are manifestly Weyl-invariant. In particular, there is no correction at first order (as required by\nWeyl invariance). With these results in hand, it is straightforward to determine the location of the apparent horizon\nby solving θ(l) (rAH ) = 0. One again finds (34) with\n(AH)\n\nh1\n\n(AH)\n\nh2\n\n(AH)\n\nh3\n\n1\n2\n−\nK2 (1),\n(d − 2)d d(d − 1)\nd+2\n=−\n,\n2d(d − 2)\n1\n=−\n.\nd(d − 1)(d − 2)\n=\n\nOnly h1 differs from the result for the event horizon [25].\n\n7\n\nThis computation is fairly lengthy.\n\n(67)\n\n\f16\nThe expression\nrEH − rAH =\n\n4S1\n≥0\n− 1)\n\nbd2 (d\n\n(68)\n\nexplicitly shows that the apparent horizon lies within (or coincides with) the event horizon in the sense that an ingoing\nradial null geodesic will cross first the event horizon and only then the apparent horizon, since r is an affine parameter\non such geodesics. It is also easy to check that the apparent horizon is spacelike or null\nC(rAH ) =\n\n2S1\n≥ 0,\nd(d − 1)\n\n(69)\n\nas required.\n\nIV.\n\nTHE HYDRODYNAMIC ENTROPY CURRENT DEFINED BY THE APPARENT HORIZON\n\nIn hydrodynamics the entropy current is a phenomenological notion constructed order-by-order in the gradient expansion starting from the term describing the flow of thermodynamic entropy. Subleading contributions are given as a\nsum of all available hydrodynamic vectors (not necessarily transverse) chosen in such a way that the divergence of the\ncurrent is non-negative when evaluated on the solutions of equations of hydrodynamics. In the conformal case, up to\nsecond order in gradients, there are in total 5 available contributions consisting of the 3 hydrodynamic Weyl-invariant\nscalars (13) multiplied by the velocity uμ and 2 Weyl-invariant transverse vectors (14)\nJμ =\n\no\n\u0001\n1 1−d n μ\n||\n||\n||\nu + b j1⊥ V1μ + j2⊥ V2μ + (j1 S1 + j2 S2 + j3 S3 )uμ .\nb\n4GN\n\n(70)\n\nThe overall factor of 1/4GN in (70) comes from the holographic expression for thermodynamic entropy. The on-shell\ndivergence8 of the current (70) was evaluated in reference [25] and reads, up to third order in gradients,\n\"\n!\nk\n2(j2 + j2⊥ )\n2b μν\nk\nμ\nd−1\nσμν − bd(d − 2) j3 −\nωμλ ω λ ν\n4GN b Dμ JS = σ\nd\nd−2\n\u0012\n\u0013\n\u0001\n1\nk\n− bd(d − 2) j3 +\nσμ λ σλν + uλ Dλ σμν + Cμανβ uα uβ\nd(d − 2)\ni\n\u0011\n\u0010\nk\n+ (j1 − j1⊥ )bd + τω uλ Dλ σμν\n\n(71)\n\nk\n\n+ b2 (j1⊥ + 2j3 )Dμ Dν σ μν + . . .\n\nAs understood in [38] for d = 4, this expression makes it possible to constrain some of the coefficients appearing in\n(70). These arguments are based on the observation that local non-negativity should hold both when the shear tensor\nvanishes at a given point, as well as when it is arbitrary small (if it is large enough, then σμν σ μν dominates over other\ncontributions and there are no further constraints). The first condition automatically implies that\nk\n\nj1⊥ = −2j3 ,\n\n(72)\n\nwhereas the second sets to zero all contributions which spoil non-negativity for very small σμν , i.e.\nk\n\nj2 + j2⊥ =\n\n8\n\n1\nk\n(d − 2) j3\n2\n\nk\n\nand j3 = −\n\nIn the sense of conservation of the energy-momentum tensor given by (25)\n\n1\n.\nd(d − 2)\n\n(73)\n\n\f17\nk\n\nk\n\nNote that j2⊥ appears in the divergence only in the combination j2 + j2⊥ , so that shifting j2⊥ and j2 keeping the sum\nconstant does not change the divergence. This ambiguity comes from the freedom of modifying the entropy current by\nadding a multiple of the divergence-free term b3−d Dλ ω λμ = b1−b (−bV2μ + S2 uμ ) [17, 24, 25] and does not affect the\nk\n\nlocal rate of entropy production. At third order there are no further constraints available so that j1 remains the only\nk\n\nunspecified parameter affecting the divergence (71). Results of [17, 25] and [24] make it clear that j1 is not fixed by\nsome higher order argument – dual gravitational constructions, which all guarantee non-negativity of the divergence,\nk\n\nlead to different values of j1 . Thus, if the notion of local entropy production in the near-equilibrium regime makes\nsense, there must be some further constraints on the form of the hydrodynamic entropy current. This paper argues\nthat one such constraint might be causality, which leads to considering the holographic entropy current based on the\napparent horizon in the dual gravity description.\nThe problem of constructing a candidate hydrodynamic entropy current on the gravity side of the correspondence\nwas first solved in [17] and then generalized to weakly curved boundary [39] and to arbitrary dimensions [25]. These\narticles relied on using the bulk-boundary map defined by ingoing null geodesics supplemented with boundary diffeomorphisms9 to map the area form of the black brane event horizon satisfying the area theorem onto a dual current\nof non-negative divergence. The main motivation for mapping bulk data along ingoing null geodesics was causality.\nNote however that such a constraint on the bulk-boundary map is self-consistent only when the bulk entropy carrier is\ncausal10 . Such a notion is provided by an apparent horizon, which along with the event horizon provides an example\nof a \"generalized horizon\" introduced in [24].\nThe geometric setup described in Section III contains a distinguished vector field v tangent to the horizon ∆. As\nanticipated in [24] in the context of \"generalized horizons\" one motivation for introducing v is that the change of the\narea form on the horizon sections can be written in terms of the expansion θ along v\n√\n1\n(74)\nθ(v) = √ Lv h ,\nh\nwhere h is the determinant of the induced metric on the section. The generalized second law of thermodynamics is\nthen the statement that the area of the leaves is non-decreasing under the above flow\nθ(v) ≥ 0 .\n\n(75)\n\nOn the apparent horizon this area law is guaranteed by θ(l) = 0, θ(n) < 0 and C ≥ 0. The boundary entropy current is\n\nobtained from v by means of rewriting the left hand side of (75) within a chosen bulk-boundary map as a divergence\n\nof boundary current. This current is interpreted as a candidate boundary current and is given by [24]\ns\n1 1 G μ\nμ\nJ =\nv .\n4GN b g\n\n(76)\n\nwhere the prefactor involving GN has been introduced to reproduce thermodynamic entropy at leading order and the\nAdS radius has been set to 1, as in (1). The technical assumptions used to derive (76) match those in Section III. In\n9\n\nThe bulk-boundary map along ingoing null geodesics associates points on the apparent horizon, the event horizon or any other \"generalized horizon\" with boundary points lying on the same null geodesics moving close to the boundary in a direction specified by a given\nvector field. This vector field is taken to be proportional to uμ in the leading order with subleading corrections modifying dual entropy\ncurrent at orders higher than 2. As anticipated in section III, in the gauge (11) this bulk-boundary map acts trivially and maps points\nof the same xμ position. Any such bulk-boundary map may be supplemented with boundary diffeomorphisms, which are generated\nby another vector field specified on the boundary. Such a vector field, if non-zero at leading order of the gradient expansion, must be\nalso proportional to uμ , which modifies the dual entropy current at second and higher orders. The only parameter in (70) shifted by\nk\n\n10\n\nboundary diffeomorphisms of such form is j1 . For a detailed discussion of bulk-boundary maps see [17].\nRelaxing the assumption of causality of bulk-boundary maps has so far not been explored. Note at this point that although the mapping\nalong ingoing null geodesics seems (at least superficially) to be causal, boundary diffeomorphisms composed with a given bulk-boundary\nmap might lead to causality violations (see Section V for a discussion of this point).\n\n\f18\nparticular, the formula (76) is valid for a trivial bulk-boundary map, i.e. along null geodesics, which in the vicinity\nof the boundary move in the direction defined by uμ . In the conformal case this direction can be modified only by\nsecond and higher order terms which change the entropy current at third order, and thus are beyond the scope of\nthis article. The bulk-boundary map used here is not supplemented with boundary diffeomorphisms partly due to\ncausality reasons (see Section V for more details). Because of this, the formula (76) leads to the unique causal second\norder entropy current.\nTo apply (76) to the gravitational setup of Section (III) one needs the form of v and a computation of the determinant\nof the bulk metric G. One finds, up to second order in gradients\n\u0013\n\u0012\n1 1\n2(d−1)\nS2 .\nG=r\ng 1 − K 1 S1 +\n2 (br)2\n\n(77)\n\nAs discussed earlier, the vector v is completely fixed by the self-consistency of the bulk construction; the second order\nresult (54) reads\nv μ = buμ + b2 (\n\n1\n2\nVμ+\nV μ) .\nd (d − 2) 1\nd−2 2\n\n(78)\n\nThe right hand side of (76) evaluated on the apparent horizon (67) leads to (70) where j1⊥ and j2⊥ are fixed by\nFrobenius condition and equal\nj1⊥ =\n\n2\n,\nd (d − 2)\n\n1\nd−2\n\nj2⊥ =\n\n(79)\n\n||\n\nwhile the ji 's depend on the radial position of the apparent horizon and read\n2 (d − 1)\n1\n||\n,\nj1 = −K1 (1) − K2 (1) +\nd\nd (d − 2)\n(2 − 3d)\n||\nj2 =\n,\n2d (d − 2)\n1\n||\n.\nj3 = −\nd (d − 2)\n\n(80)\n\nAs a crosscheck one can easily see that the coefficients (80) satisfy conditions (72) and (73). Comparing with the\n||\n\nevent horizon result [24, 25] one can see that the only difference is in the choice of j1\n||\n\n||\n\nj1,EH = j1,AH −\n\n4\n.\nd2\n\n(81)\n\nCalculating the area theorem on the apparent horizon up to the second order in gradients one obtains\nθ(l) − Cθ(n)\n\nr=rAH\n\n=\n\n2S1\n,\nd\n\n(82)\n\nwhich indeed matches the hydrodynamic result up to second order in gradients (71). Calculating the third order\ncontribution in the bulk requires third order geometry, which has so far not been obtained. Nevertheless the match\nis guaranteed by the formula (76) relating divergence of the entropy current to the area theorem on the apparent\nhorizon modulo modifications of bulk-boundary map.\n\nV.\n\nSUMMARY\n\nThis paper discusses the construction of apparent horizons in the geometry of conformal fluid-gravity duality. The\nmotivation for this work are interrelated questions of local definition of entropy beyond equilibrium and foliation\n\n\f19\ndependence of apparent horizons of black holes. The reason for focusing on apparent horizons is that they are causal\nobjects: they evolve in response to a flux of gravitational radiation or infall of matter. This makes them a preferable\ncarrier for the notion of entropy beyond equilibrium in dual holographic field theories. There are however two caveats,\nwhich need to be taken into account: foliation dependence of apparent horizons [16] and locality of entropy production\nbeing directly related to the mapping of horizon information onto the boundary [17]. This paper focuses only on the\nfirst issue since the latter appears most severely at higher orders of the gradient expansion than are available for the\ngeometry under consideration.\nThe key idea behind this paper is that the apparent horizons of interest are only those which are covariant in the sense\nof the dual hydrodynamic description, i.e. can be covariantly specified (in the boundary sense) in terms of b, uμ , gμν\nand their gradients. This requirement chooses only those apparent horizons which have covariant dual hydrodynamic\nentropy currents. Apparent horizons which do not satisfy this condition evade a clear physical interpretation in terms\nof the dual field theory and are not studied in this paper. Because of the requirement of hydrodynamic covariance,\nthis paper adopts the somewhat unusual strategy of first finding suitable null normals and only afterwards confirming\nthat they are foliation-forming, rather than starting with a foliation and then proceeding to normals. The approach\nadopted here relies on the near-equilibrium regime, where one expects that at least one of the apparent horizons\nwill \"closely\" follow the dynamics of the event horizon [16]. In the case of fluid-gravity duality this requirement is\nindeed satisfied – using even the results of [17] alone one can easily check that the leading order event horizon is at\nthe same time an (isolated) apparent horizon. It would certainly be interesting to try to apply similar methods to\nfind apparent horizons in other black hole spacetimes, perhaps making contact with the framework of slowly evolving\nhorizons [30–32].\nThe main result of this paper is that, up to second order in gradients in conformal fluid-gravity duality, there exists a\nunique apparent horizon covariant in the hydrodynamic sense. It is very plausible that the uniqueness of this apparent\nhorizon holds to all orders of the gradient expansion, as arguments in Section III suggest. The apparent horizon in\nthe geometry of fluid-gravity duality is isolated at leading and first subleading orders of the gradient expansion and\nbecomes spatial once second order gradient contributions are included. As expected [17] and confirmed by an explicit\ncalculation in [24], the apparent horizon gives rise to a notion of hydrodynamic entropy current when the area form on\nthe apparent horizon is mapped to the boundary in an appropriate way. Reference [17] introduced the map spanned\nalong ingoing null geodesics, the main motivation for it being the causal structure of bulk spacetime. Such geodesics\nare specified by their tangent vector at the boundary and hydrodynamic covariance forces this to be proportional to\nthe fluid velocity at leading order, but starting at second order additional contributions appear. These terms will\nmodify the form of the entropy current at third and higher orders of the gradient expansion and are beyond the\nscope of this paper. The only freedom, which affects the divergence of an entropy current at second order comes from\ncombining the bulk-boundary map specified by ingoing bulk geodesics with boundary diffeomorphisms [17]. It is not\nclear however, whether or not this leads to causality violations. One argument suggesting that it does was presented\nin [24]. There, using the results from both [17, 25] and the present paper, it was shown that up to the second order\nin gradients the entropy current on the event horizon is equivalent to the entropy current on the apparent horizon\nwhen the bulk-boundary map in the latter case is supplemented with a particular boundary diffeomorphism. It would\nbe very interesting to understand better the constraints on the form of the bulk-boundary map which follow from\ncausality.\nIt seems unlikely that explicit causality violations due to the choice of the bulk-boundary map can be visible at low\norders of the gradient expansion in the same way as in the near-equilibrium regime it is hard to tell whether the\n\n\f20\nevent or one of apparent horizons is a better entropy carrier [16]. Instead, one probably needs to look for some\ngeneral principles or at concrete examples based on numerical solutions in asymptotically AdS spacetimes. One such\na simple example is the gravity dual to boost-invariant flow [19, 23, 40–46]. In the boost-invariant case, the boundary\ndynamics depend on a single variable, the proper time τ , and its large proper time limit is governed by boost-invariant\nhydrodynamics. Consider now the setup introduced in [19], where the initial state given by the vacuum AdS space\nis excited in a boost-invariant way in the vicinity of τ = 0 by a time-dependent boundary metric. Such a quench\nleads to the emission of gravitational waves, and these propagate into the bulk and collapse forming a black hole.\nThe black hole equilibrates and in the end is well-described in terms of fluid-gravity duality. In this example, the\ncausal behavior of the apparent horizon is clearly visible only in the vacuum (before the quench) and in the farfrom-equilibrium regime. However, close to equilibrium the apparent and event horizon follow each other closely as\nexpected, and from that perspective there seems to be no reason to choose one over the other [16]. Consider now a\nslight modification of the setup [19]. As initial state at some late time τi ≫ 0 one can choose a boost-invariant black\n\nbrane solution dual to perfect fluid hydrodynamics. Such a solution might have an arbitrary temperature and does not\n\nproduce any entropy as required by perfect fluid hydrodynamics. Consider now the same kind of quench as considered\nin [19], but now in the vicinity of τi . Such a quench will excite both far-from-equilibrium and hydrodynamics modes.\nThe former equilibrate over a time scale set by the inverse of temperature, so by taking temperature to be large, one\ncan effectively decouple them from analysis. Thus such setup serves as a causally clear example of entropy production,\ngoverned entirely by hydrodynamics. It would be very interesting to see what are the constraints on the part of the\nbulk-boundary map which corresponds to boundary diffeomorphisms following from this and similar examples.\nAs for more obvious further projects, it would be very interesting to calculate the location of apparent horizons in\nthe cases of charged [47, 48], non-conformal [49], and superfluid [50, 51] fluid-gravity dualities. In those examples\nthere are more gradient terms available so that the relevant backgrounds may serve as further testing grounds for\nthe claims of this paper. It would be also interesting to analyze the interplay between the position of the event and\napparent horizons in the context of the AdS/CFT correspondence making use of the technology introduced in [21].\nIn conclusion, the gravity dual to second order hydrodynamics of conformal media in arbitrary dimensions has a\nunique apparent horizon, which is covariant in the hydrodynamic sense. Possible ambiguities, which appear in the\ngravity construction, should not affect the amount of entropy produced between two equilibrium states (represented\non the gravity side by two isolated horizons). Furthermore if the foliation of the apparent horizon is fixed to all orders\nin the gradient expansion and there are very stringent constraints on the bulk-boundary map, then it is plausible that\nthe local rate of entropy production in the near-equilibrium regime is a meaningful observable. This would be a very\ninteresting result from the point of view of non-equilibrium statistical mechanics.\n\nACKNOWLEDGMENTS\n\nThe authors acknowledge the use of Kasper Peeters's excellent package Cadabra [52, 53]. This work was partially\nsupported by Polish Ministry of Science and Higher Education grants N N202 173539 and N N202 105136. MH\nacknowledges support from Foundation for Polish Science. IB was supported by the Natural Sciences and Engineering\nResearch Council of Canada. This work is part of the research programme of the Foundation for Fundamental\n\n\f21\nResearch on Matter, which is part of the Netherlands Organisation for Scientific Research.\n\n[1] J. M. Maldacena, \"The large N limit of superconformal field theories and supergravity,\" Adv. Theor. Math. Phys. 2\n(1998) 231–252, arXiv:hep-th/9711200.\n[2] E. Witten, \"Anti-de Sitter space and holography,\" Adv. Theor. Math. Phys. 2 (1998) 253–291, arXiv:hep-th/9802150.\n[3] S. S. Gubser, I. R. Klebanov, and A. M. Polyakov, \"Gauge theory correlators from non-critical string theory,\"\nPhys. Lett. B428 (1998) 105–114, arXiv:hep-th/9802109.\n[4] J. Casalderrey-Solana, H. Liu, D. Mateos, K. Rajagopal, and U. A. Wiedemann, \"Gauge/String Duality, Hot QCD and\nHeavy Ion Collisions,\" arXiv:1101.0618 [hep-th]. * Temporary entry *.\n[5] D. T. Son and A. O. Starinets, \"Viscosity, Black Holes, and Quantum Field Theory,\"\nAnn. Rev. Nucl. Part. Sci. 57 (2007) 95–118, arXiv:0704.0240 [hep-th].\n[6] S. Bhattacharyya, V. E. Hubeny, S. Minwalla, and M. Rangamani, \"Nonlinear Fluid Dynamics from Gravity,\"\nJHEP 02 (2008) 045, arXiv:0712.2456 [hep-th].\n[7] A. Ashtekar and B. Krishnan, \"Isolated and dynamical horizons and their applications,\" Living Rev. Rel. 7 (2004) 10,\narXiv:gr-qc/0407042.\n[8] I. Booth, \"Black hole boundaries,\" Can. J. Phys. 83 (2005) 1073–1099, arXiv:gr-qc/0508107.\n[9] E. Gourgoulhon and J. L. Jaramillo, \"A 3+1 perspective on null hypersurfaces and isolated horizons,\"\nPhys.Rept. 423 (2006) 159–294, arXiv:gr-qc/0503113 [gr-qc].\n[10] S. W. Hawking and G. F. R. Ellis, \"The Large scale structure of space-time,\". Cambridge University Press, Cambridge,\n1973.\n[11] G. 't Hooft, \"Dimensional reduction in quantum gravity,\" arXiv:gr-qc/9310026.\n[12] L. Susskind, \"The World as a hologram,\" J. Math. Phys. 36 (1995) 6377–6396, arXiv:hep-th/9409089.\n[13] W. Li and T. Takayanagi, \"Holography and Entanglement in Flat Spacetime,\" arXiv:1010.3700 [hep-th].\n[14] S. A. Hayward, \"General laws of black hole dynamics,\" Phys. Rev. D49 (1994) 6467–6474.\n[15] J. J. Friess, S. S. Gubser, G. Michalogiorgakis, and S. S. Pufu, \"Expanding plasmas and quasinormal modes of anti-de\nSitter black holes,\" JHEP 0704 (2007) 080, arXiv:hep-th/0611005 [hep-th].\n[16] P. Figueras, V. E. Hubeny, M. Rangamani, and S. F. Ross, \"Dynamical black holes and expanding plasmas,\"\nJHEP 04 (2009) 137, arXiv:0902.4696 [hep-th].\n[17] S. Bhattacharyya et al., \"Local Fluid Dynamical Entropy from Gravity,\" JHEP 06 (2008) 055,\narXiv:0803.2526 [hep-th].\n[18] P. M. Chesler and L. G. Yaffe, \"Horizon formation and far-from-equilibrium isotropization in supersymmetric Yang-Mills\nplasma,\" Phys. Rev. Lett. 102 (2009) 211601, arXiv:0812.2053 [hep-th].\n[19] P. M. Chesler and L. G. Yaffe, \"Boost invariant flow, black hole formation, and far-from- equilibrium dynamics in N = 4\nsupersymmetric Yang-Mills theory,\" arXiv:0906.4426 [hep-th].\n[20] A. Nielsen, \"The spatial relation between the event horizon and trapping horizon,\" arXiv:1006.2448v1.\n[21] I. Booth and J. Martin, \"On the proximity of black hole horizons: lessons from Vaidya,\" Phys. Rev. D82 (2010) 124046,\narXiv:1007.1642 [gr-qc].\n[22] P. Romatschke, \"New Developments in Relativistic Viscous Hydrodynamics,\" Int. J. Mod. Phys. E19 (2010) 1–53,\narXiv:0902.3663 [hep-ph].\n[23] I. Booth, M. P. Heller, and M. Spalinski, \"Black brane entropy and hydrodynamics: the boost-invariant case,\"\nPhys. Rev. D80 (2009) 126013, arXiv:0910.0748 [hep-th].\n[24] I. Booth, M. Heller, and M. Spalinski, \"Black Brane Entropy and Hydrodynamics,\" arXiv:1010.6301 [hep-th].\n[25] S. Bhattacharyya, R. Loganayagam, I. Mandal, S. Minwalla, and A. Sharma, \"Conformal Nonlinear Fluid Dynamics from\n\n\f22\nGravity in Arbitrary Dimensions,\" JHEP 12 (2008) 116, arXiv:0809.4272 [hep-th].\n[26] M. Haack and A. Yarom, \"Nonlinear viscous hydrodynamics in various dimensions using AdS/CFT,\"\nJHEP 10 (2008) 063, arXiv:0806.4602 [hep-th].\n[27] M. Bianchi, D. Z. Freedman, and K. Skenderis, \"Holographic Renormalization,\" Nucl. Phys. B631 (2002) 159–194,\narXiv:hep-th/0112119.\n[28] S. de Haro, S. N. Solodukhin, and K. Skenderis, \"Holographic reconstruction of spacetime and renormalization in the\nAdS/CFT correspondence,\" Commun. Math. Phys. 217 (2001) 595–622, arXiv:hep-th/0002230.\n[29] R. Loganayagam, \"Entropy Current in Conformal Hydrodynamics,\" JHEP 05 (2008) 087, arXiv:0801.3701 [hep-th].\n[30] I. Booth and S. Fairhurst, \"The first law for slowly evolving horizons,\" Phys. Rev. Lett. 92 (2004) 011102,\narXiv:gr-qc/0307087.\n[31] I. Booth and S. Fairhurst, \"Isolated, slowly evolving, and dynamical trapping horizons: geometry and mechanics from\nsurface deformations,\" Phys. Rev. D75 (2007) 084019, arXiv:gr-qc/0610032.\n[32] W. Kavanagh and I. Booth, \"Spacetimes containing slowly evolving horizons,\" Phys. Rev. D74 (2006) 044027,\narXiv:gr-qc/0603074.\n[33] A. Ashtekar, S. Fairhurst, and B. Krishnan, \"Isolated horizons: Hamiltonian evolution and the first law,\"\nPhys. Rev. D62 (2000) 104025, arXiv:gr-qc/0005083.\n[34] A. Ashtekar, C. Beetle, and J. Lewandowski, \"Geometry of Generic Isolated Horizons,\"\nClass. Quant. Grav. 19 (2002) 1195–1225, arXiv:gr-qc/0111067.\n[35] A. Ashtekar and G. J. Galloway, \"Some uniqueness results for dynamical horizons,\" Adv. Theor. Math. Phys. 9 (2005)\n1–30, arXiv:gr-qc/0503109.\n[36] E. Schnetter and B. Krishnan, \"Non-symmetric trapped surfaces in the schwarzschild and vaidya spacetimes,\" Physical\nReview D 73 (2006) 021502(R), arXiv:gr-qc/0511017v3.\n[37] B. K. E. S. Alex B. Nielsen, Michael Jasiulek, \"The slicing dependence of non-spherically symmetric quasi-local horizons\nin vaidya spacetimes,\" arXiv:1007.2990.\n[38] P. Romatschke, \"Relativistic Viscous Fluid Dynamics and Non-Equilibrium Entropy,\"\nClass. Quant. Grav. 27 (2010) 025006, arXiv:0906.4787 [hep-th].\n[39] S. Bhattacharyya et al., \"Forced Fluid Dynamics from Gravity,\" JHEP 02 (2009) 018, arXiv:0806.0006 [hep-th].\n[40] R. A. Janik and R. B. Peschanski, \"Asymptotic perfect fluid dynamics as a consequence of AdS/CFT,\"\nPhys. Rev. D73 (2006) 045013, arXiv:hep-th/0512162.\n[41] R. A. Janik, \"Viscous plasma evolution from gravity using AdS/CFT,\" Phys. Rev. Lett. 98 (2007) 022302,\narXiv:hep-th/0610144.\n[42] M. P. Heller and R. A. Janik, \"Viscous hydrodynamics relaxation time from AdS/CFT,\" Phys. Rev. D76 (2007) 025027,\narXiv:hep-th/0703243.\n[43] M. P. Heller, P. Surowka, R. Loganayagam, M. Spalinski, and S. E. Vazquez, \"Consistent Holographic Description of\nBoost-Invariant Plasma,\" Phys. Rev. Lett. 102 (2009) 041601, arXiv:0805.3774 [hep-th].\n[44] S. Kinoshita, S. Mukohyama, S. Nakamura, and K.-y. Oda, \"A Holographic Dual of Bjorken Flow,\"\nProg. Theor. Phys. 121 (2009) 121–164, arXiv:0807.3797 [hep-th].\n[45] S. Kinoshita, S. Mukohyama, S. Nakamura, and K.-y. Oda, \"Consistent Anti-de Sitter-Space/Conformal-Field-Theory\nDual for a Time-Dependent Finite Temperature System,\" Phys. Rev. Lett. 102 (2009) 031601,\narXiv:0901.4834 [hep-th].\n[46] G. Beuf, M. P. Heller, R. A. Janik, and R. Peschanski, \"Boost-invariant early time dynamics from AdS/CFT,\"\nJHEP 10 (2009) 043, arXiv:0906.4423 [hep-th].\n[47] N. Banerjee, J. Bhattacharya, S. Bhattacharyya, S. Dutta, R. Loganayagam, et al., \"Hydrodynamics from charged black\nbranes,\" JHEP 1101 (2011) 094, arXiv:0809.2596 [hep-th].\n[48] J. Erdmenger, M. Haack, M. Kaminski, and A. Yarom, \"Fluid dynamics of R-charged black holes,\"\nJHEP 0901 (2009) 055, arXiv:0809.2488 [hep-th].\n\n\f23\n[49] I. Kanitscheider and K. Skenderis, \"Universal hydrodynamics of non-conformal branes,\" JHEP 0904 (2009) 062,\narXiv:0901.1487 [hep-th].\n[50] J. Bhattacharya, S. Bhattacharyya, and S. Minwalla, \"Dissipative Superfluid dynamics from gravity,\"\narXiv:1101.3332 [hep-th]. * Temporary entry *.\n[51] C. P. Herzog, N. Lisker, P. Surowka, and A. Yarom, \"Transport in holographic superfluids,\" arXiv:1101.3330 [hep-th].\n* Temporary entry *.\n[52] K. Peeters, \"A field-theory motivated approach to symbolic computer algebra,\" CoRR abs/cs/0608005 (2006) .\n[53] K. Peeters, \"Introducing Cadabra: A symbolic computer algebra system for field theory problems,\"\narXiv:hep-th/0701238.\n\nAppendix A: Weyl-covariance and available gradient terms\n\nThe Weyl-covariant derivative D is defined so that for an arbitrary tensor Qμ...\nν... of weight w (i.e. one that obeys\n\nwφ μ...\nQμ...\nQν... under Weyl transformations (7)), Dλ Qμ...\nν... → e\nν... transforms homogeneously with weight w\nμ...\nμ...\nDλ Qμ...\nν... ≡ ∇λ Qν... + w Aλ Qν...\n\n+ [gλα Aμ − δλμ Aα − δαμ Aλ ] Qα...\nν... + . . .\n\n(A1)\n\n− [gλν Aα − δλα Aν − δνα Aλ ] Qμ...\nα... − . . .\nThe field Aμ is given by (8) and transforms as a connection under Weyl transformations (8).\nAt first order in gradients there are two available contributions: Dμ uν and Dμ b. The latter quantity vanishes at this\n\norder of the gradient expansion when evaluated on solutions of the equations of perfect fluid hydrodynamics [29] and\nthus at the first order the only nontrivial contribution comes from Dμ uν . Taking its symmetric part one obtains the\nshear tensor σμν\n\nσμν =\n\n1\nD(μ uν) ,\n2\n\n(A2)\n\nwhereas its antisymmetric part is the vorticity of the flow\nωμν =\n\n1\nD[μ uν] .\n2\n\n(A3)\n\nHere X(μν) = Xμν + Xνμ denotes symmetrization, whereas X[μν] = Xμν − Xνμ antisymmetrization. One can show\n\nthat both tensors (A2) and (A3) are transverse, i.e. uμ σμν = uμ ωμν = 0.\n\nFollowing [25] one defines the Weyl-covariant Riemann tensor Rμνλσ\n\u0013\n\u0012\nA2\nβ\nα\ngαβ\nRμνλσ = Rμνλσ + ∇[μ Aν] gλσ − δ[μ gν][λ δσ] ∇α Aβ + Aα Aβ −\n2\n\n(A4)\n\nNote that the Weyl-covariantized curvature tensors do not vanish even if the fluid lives in a flat spacetime. With this,\nthe Weyl-covariant Ricci tensor Rμν and Weyl-covariant Ricci scalar R appearing in (13) can be defined:\nRμν = Rμλν λ\n\nand R = Rλ λ\n\n(A5)\n\nFinally, the Weyl curvature tensor entering (15) is given by\nCμνλσ = Rμνλσ\n\n\u0013\n\u0012\nRgμν\n1 α\nβ\n.\nδ gν][λ δσ] Rμν −\n+\nd − 2 [μ\n2(d − 1)\n\n(A6)\n\n\f24\nAppendix B: Example: the Vaidya metric\n\nTo see how the method for finding apparent horizon introduced in the context of \"generalized horizons\" in [24] and\nreviewed in Section III works, consider the example of the Vaidya metric11\nds2 = 2dwdr − f (r, w)dw2 + r2 (dθ2 + sin2 θrφ2 )\n\n(B1)\n\nwith\nf (r, w) = 1 −\n\n2m(w)\n.\nr\n\n(B2)\n\nIn this case symmetry suggests taking S = r − g(w) (i.e. spherically symmetric apparent horizon). Then the covector\n\nm is\n\nma = (dr − g ′ (w)dw) a\n\n(B3)\n\nand raising the index leads to\na\n\nma = (∂w + (f (r, w) − g ′ (w))∂r ) .\n\n(B4)\n\nHere latin indices are used for (r, w, θ, φ) and greek ones (below) for (w, θ, φ) – this is sort of analogous to the\nconventions used earlier for the AdS case. Choosing slicing on the horizon given by v μ = (∂w )μ leads to\na\n\nv a = (∂w + g ′ (w)∂r )\n\n(B5)\n\nUsing (56) gives to\n1\nl = ∂w + f (r, w) ∂r\n2\n\nand n = λ (f (r, w) − 2g ′ (w)) ∂r .\n\n(B6)\n\nImposing the normalization condition (50) to fix λ gives the expected result [32]\n1\nl = ∂w + f (r, w) ∂r\n2\n\nand n = −∂r .\n\n(B7)\n\nNote that in spherical symmetry vectors l and n are fixed up to an overall scaling by conditions\nla la = nb nb = 0 and la na = −1.\n\n11\n\n(B8)\n\nThe letter w denotes the ingoing Eddington-Finkelstein time coordinate to avoid clashing with the choice of v for the vector which\ndefines the slicing\n\n\f"}