{"id": "http://arxiv.org/abs/0803.4280v2", "guidislink": true, "updated": "2008-04-12T16:18:30Z", "updated_parsed": [2008, 4, 12, 16, 18, 30, 5, 103, 0], "published": "2008-03-29T20:10:36Z", "published_parsed": [2008, 3, 29, 20, 10, 36, 5, 89, 0], "title": "Free evolution on algebras with two states", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0803.0501%2C0803.0806%2C0803.0255%2C0803.3036%2C0803.2679%2C0803.3757%2C0803.3215%2C0803.3458%2C0803.1627%2C0803.3766%2C0803.2785%2C0803.4131%2C0803.3797%2C0803.0148%2C0803.2645%2C0803.2412%2C0803.2815%2C0803.3687%2C0803.0088%2C0803.1962%2C0803.3784%2C0803.3244%2C0803.1648%2C0803.1989%2C0803.4014%2C0803.1854%2C0803.1728%2C0803.1736%2C0803.1900%2C0803.4373%2C0803.2765%2C0803.1529%2C0803.4103%2C0803.4108%2C0803.4431%2C0803.3560%2C0803.2856%2C0803.3856%2C0803.3329%2C0803.0101%2C0803.2971%2C0803.1378%2C0803.2250%2C0803.1853%2C0803.1498%2C0803.0841%2C0803.4153%2C0803.0122%2C0803.4280%2C0803.2850%2C0803.3706%2C0803.3282%2C0803.4271%2C0803.3337%2C0803.0144%2C0803.1494%2C0803.3409%2C0803.1843%2C0803.3369%2C0803.1447%2C0803.3619%2C0803.4501%2C0803.3368%2C0803.0670%2C0803.0333%2C0803.4223%2C0803.1702%2C0803.0800%2C0803.2135%2C0803.4413%2C0803.0523%2C0803.3040%2C0803.4512%2C0803.1070%2C0803.3642%2C0803.0043%2C0803.2012%2C0803.2281%2C0803.3707%2C0803.3170%2C0803.2668%2C0803.1856%2C0803.0002%2C0803.0545%2C0803.0358%2C0803.1372%2C0803.1862%2C0803.0831%2C0803.4343%2C0803.1609%2C0803.2427%2C0803.1302%2C0803.2053%2C0803.0456%2C0803.0897%2C0803.1047%2C0803.3717%2C0803.3940%2C0803.2893%2C0803.0792%2C0803.1861&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Free evolution on algebras with two states"}, "summary": "The key result in the paper concerns two transformations, Phi(rho, psi) and\nB_t(psi) on states on the algebra of non-commutative polynomials, or\nequivalently on joint distributions of d-tuples of non-commuting operators.\nThese transformations are related to free probability: Phi intertwines the\naction of B_t and the free convolution with the semigroup {rho_t}. The maps\n{B_t} were introduced by Belinschi and Nica as a semigroup of transformations\nsuch that B_1 is the bijection between infinitely divisible distributions in\nthe Boolean and free probability theories. They proved the intertwining\nproperty above for a single-variable version of the map Phi and the particular\ncase of the free heat semigroup. The more general two-variable map Phi comes,\nnot from free probability, but from the theory of two-state algebras, also\ncalled the conditionally free probability theory, introduced by Bozejko,\nLeinert, and Speicher. Orthogonality of the c-free versions of the Appell\npolynomials, investigated in arXiv:0803.4279, is closely related to the\nsingle-variable map Phi. On the other hand, more general free Meixner families\nbehave well under all the transformations above, and provide clues to their\ngeneral behavior. Besides the evolution equation, other results include the\npositivity of the map Phi and descriptions of its fixed points and range.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0803.0501%2C0803.0806%2C0803.0255%2C0803.3036%2C0803.2679%2C0803.3757%2C0803.3215%2C0803.3458%2C0803.1627%2C0803.3766%2C0803.2785%2C0803.4131%2C0803.3797%2C0803.0148%2C0803.2645%2C0803.2412%2C0803.2815%2C0803.3687%2C0803.0088%2C0803.1962%2C0803.3784%2C0803.3244%2C0803.1648%2C0803.1989%2C0803.4014%2C0803.1854%2C0803.1728%2C0803.1736%2C0803.1900%2C0803.4373%2C0803.2765%2C0803.1529%2C0803.4103%2C0803.4108%2C0803.4431%2C0803.3560%2C0803.2856%2C0803.3856%2C0803.3329%2C0803.0101%2C0803.2971%2C0803.1378%2C0803.2250%2C0803.1853%2C0803.1498%2C0803.0841%2C0803.4153%2C0803.0122%2C0803.4280%2C0803.2850%2C0803.3706%2C0803.3282%2C0803.4271%2C0803.3337%2C0803.0144%2C0803.1494%2C0803.3409%2C0803.1843%2C0803.3369%2C0803.1447%2C0803.3619%2C0803.4501%2C0803.3368%2C0803.0670%2C0803.0333%2C0803.4223%2C0803.1702%2C0803.0800%2C0803.2135%2C0803.4413%2C0803.0523%2C0803.3040%2C0803.4512%2C0803.1070%2C0803.3642%2C0803.0043%2C0803.2012%2C0803.2281%2C0803.3707%2C0803.3170%2C0803.2668%2C0803.1856%2C0803.0002%2C0803.0545%2C0803.0358%2C0803.1372%2C0803.1862%2C0803.0831%2C0803.4343%2C0803.1609%2C0803.2427%2C0803.1302%2C0803.2053%2C0803.0456%2C0803.0897%2C0803.1047%2C0803.3717%2C0803.3940%2C0803.2893%2C0803.0792%2C0803.1861&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The key result in the paper concerns two transformations, Phi(rho, psi) and\nB_t(psi) on states on the algebra of non-commutative polynomials, or\nequivalently on joint distributions of d-tuples of non-commuting operators.\nThese transformations are related to free probability: Phi intertwines the\naction of B_t and the free convolution with the semigroup {rho_t}. The maps\n{B_t} were introduced by Belinschi and Nica as a semigroup of transformations\nsuch that B_1 is the bijection between infinitely divisible distributions in\nthe Boolean and free probability theories. They proved the intertwining\nproperty above for a single-variable version of the map Phi and the particular\ncase of the free heat semigroup. The more general two-variable map Phi comes,\nnot from free probability, but from the theory of two-state algebras, also\ncalled the conditionally free probability theory, introduced by Bozejko,\nLeinert, and Speicher. Orthogonality of the c-free versions of the Appell\npolynomials, investigated in arXiv:0803.4279, is closely related to the\nsingle-variable map Phi. On the other hand, more general free Meixner families\nbehave well under all the transformations above, and provide clues to their\ngeneral behavior. Besides the evolution equation, other results include the\npositivity of the map Phi and descriptions of its fixed points and range."}, "authors": ["Michael Anshelevich"], "author_detail": {"name": "Michael Anshelevich"}, "author": "Michael Anshelevich", "arxiv_comment": "Remark 10 and comments before Lemma 3 added; statement of Theorem 10\n  modified", "links": [{"href": "http://arxiv.org/abs/0803.4280v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0803.4280v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.OA", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.OA", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "46L53 (Primary); 46L54 (Secondary)", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0803.4280v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0803.4280v2", "journal_reference": "J. Reine Angew. Math. 638 (2010), 75-101", "doi": null, "fulltext": "FREE EVOLUTION ON ALGEBRAS WITH TWO STATES\n\narXiv:0803.4280v2 [math.OA] 12 Apr 2008\n\nMICHAEL ANSHELEVICH\nA BSTRACT. The key result in the paper concerns two transformations, Φ : (ρ, ψ) 7→ φ and Bt :\nψ 7→ φ, where ρ, ψ, φ are states on the algebra of non-commutative polynomials, or equivalently\njoint distributions of d-tuples of non-commuting operators. These transformations are related to free\nprobability: if ⊞ is the free convolution operation, and {ρt } is a free convolution semigroup, we show\nthat\nΦ [ρ, ψ ⊞ ρt ] = Bt [Φ [ρ, ψ]].\nThe maps {Bt } were introduced by Belinschi and Nica as a semigroup of transformations such that\nB1 is the bijection between infinitely divisible distributions in Boolean and free probability theories.\nThey showed that for γt the free heat semigroup and Φ the Boolean version of the Kolmogorov\nrepresentation for infinitely divisible measures,\nΦ [ψ ⊞ γt ] = Bt [Φ [ψ]].\nThe more general map Φ [ρ, ψ] comes, not from free probability, but from the theory of two-state\nalgebras, also called the conditionally free probability theory, introduced by Bożejko, Leinert, and\nSpeicher. Orthogonality of the c-free versions of the Appell polynomials, investigated in [Ans08b],\nis closely related to the map Φ. On the other hand, more general free Meixner families behave well\nunder all the transformations above, and provide clues to their general behavior. Besides the evolution\nequation, other results include the positivity of the map Φ [ρ, ψ] and descriptions of its fixed points\nand range.\n\n1. I NTRODUCTION\nIn a series of papers [BN08, BN07a, BN07b], Belinschi and Nica introduced and investigated a\nfamily of transformations Bt . These transformations operate on measures, or more generally on\n\"non-commutative joint distributions\", i.e. states on non-commutative polynomial algebras. Bt are\ndefined using a mixture of free and Boolean convolutions (see Section 2.6). They showed that these\ntransformations form a semigroup, and for t = 1, B1 is exactly the (Bercovici-Pata) bijection B\nbetween the infinitely divisible distributions in the free and Boolean probability theories. These\ntransformations also have a remarkable relation to the free multiplicative convolution. On the other\nhand, Belinschi and Nica also proved that for a general state ψ,\nΦ [ψ ⊞ γt ] = Bt [Φ [ψ]],\nwhere ⊞ is the free (additive) convolution and γt is the free convolution semigroup of semicircular\ndistributions, the free version of the heat semigroup. The map Φ, which intertwines the actions\nof Bt and the semicircular evolution, can be described in the one-variable case as follows: for a\nmeasure ν, Φ [ν] is the measure whose Boolean cumulant generating function is\n\u0013\nZ \u0012\n1\n1\nΦ[ν]\nη (z) =\n− 1 − xz\ndν(x).\n1 − xz\nx2\nR\nDate: October 19, 2018.\n2000 Mathematics Subject Classification. Primary 46L53; Secondary 46L54.\nThis work was supported in part by NSF grant DMS-0613195.\n1\n\n\f2\n\nM. ANSHELEVICH\n\nThe formula above is the Boolean version of the Kolmogorov representation (see Theorem 8.5 in\n[Dur91]). Φ is also a shift on the Jacobi parameters of the measure, see [Ans08b].\nFree probability [VDN92, NS06] and Boolean probability theories are two of only three natural\nnon-commutative probability theories (in addition to the usual probability theory; the third theory,\nmonotone probability, also appears in the paper as an auxiliary device). Both the free and the\nBoolean setting are in fact particular cases of a more general construction for a space with two\nexpectations, or more precisely an algebra with two states (A, φ, ψ). This theory is usually called\nthe conditionally free or c-free theory. The objects in it are best described using their two-state\ncumulants Rφ,ψ , which restrict to Boolean cumulants η φ for ψ = δ0 and to free cumulants Rφ for\nψ = φ. It is not true that Rφ,ψ are always the free cumulants of some state. However, conversely,\nif ψ is arbitrary and ρ is a freely infinitely divisible state, then Rρ = Rφ,ψ for some φ. So we can\ndefine the map φ = Φ [ρ, ψ]. It is easy to see that Φ [γ, *] = Φ, where γ is the free product of\nstandard semicircular distributions. Moreover, we show that, now for general ρt ,\nΦ [ρ, ψ ⊞ ρt ] = Bt [Φ [ρ, ψ]].\nThis equation remains somewhat mysterious. However, we also exhibit an operator representation\nwhich provides a realization for it. This requires obtaining operator representations for all the\ningredient maps, a result which may be of independent interest.\nOur original motivation for the study of the maps Bt and Φ came from their connection to the free\nMeixner distributions and states. Free Meixner distributions were originally defined as measures\nwhose orthogonal polynomials have a special (free Sheffer) form, and in [Ans07b] we showed\nthat they have exactly the same characterization in terms of Boolean Sheffer families. In fact, as\nexplained in [Ans08b], the natural home of the free Meixner distributions is in the c-free theory:\nthey are those distributions φ which, for some ψ, have orthogonal c-free Appell (rather than the\nmore general Sheffer) polynomials.\nIt was noted by Belinschi and Nica and also in [Ans07b] that the operations Bt take the class of\nfree Meixner states to itself. We introduce a new two-parameter family {Bα,t }, which also form a\nsemigroup. For α = 0, these are exactly the Belinschi-Nica maps, while for t = 0 these maps relate\nthe Boolean convolution with the so-called Fermi convolution. These maps also preserve the free\nMeixner class, and moreover, in one variable using them the class can be generated from a single\ndistribution 12 (δ−1 + δ1 ). In addition,\nΦ [ρ, ψ ⊞ ρt ⊞ δα ] = Bα,t [Φ [ρ, ψ]],\nThe actions on the free Meixner distributions of the operations ⊞, Bα,t , and Φ [ρ, *] can be computed\nexplicitly, and lead to the more general results.\nThe paper is organized as follows. Section 2 introduces the basic notions, in particular the twostate cumulants. Section 3 describes the appearance of the free Meixner distributions in the c-free\ntheory, and defines Φ [ρ, ψ] and Ba,t . Section 4 contains the main results: semigroup property of\nBa,t , positivity, fixed point, and image descriptions for Φ [ρ, ψ], and combinatorial and operator\nproofs of the equation which relates them.\nAcknowledgements. I would like to thank Andu Nica and Serban Belinschi for a number of discussions which contributed to the development of this paper, and for explaining their work to me. I\nalso thank Laura Matusevich for useful comments.\n\n\fFREE EVOLUTION ON ALGEBRAS WITH TWO STATES\n\n3\n\n2. P RELIMINARIES\nWe will freely use the notions and notation from the Preliminaries section of [Ans07b]; here we list\nthe highlights.\n2.1. Polynomials and power series. Let Chxi = Chx1 , x2 , . . . , xd i be all the polynomials with\ncomplex coefficients in d non-commuting variables. They form a unital ∗-algebra.\nFor a non-commutative power series G in\nz = (z1 , z2 , . . . , zd )\ndefine the left non-commutative partial derivative Di G by a linear extension of Di (1) = 0,\nDi z~u = δiu(1) zu(2) . . . zu(n) .\n2.2. Algebras and states. Algebras A in this paper will always be complex ∗-algebras and, unless\nstated otherwise, unital. If the algebra is non-unital, one can always form its unitization C1 ⊕ A; if\nA was a C ∗ -algebra, its unitization can be made into one as well.\nFunctionals A → C will always be linear, unital, and ∗-compatible. A state is a functional which\nin addition is positive definite, that is\nφ [X ∗ X] ≥ 0\n(zero value for non-zero X is allowed). A functional on C1 ⊕ A is conditionally positive definite if\nits restriction to A is positive definite. In particular, a functional on Chxi is conditionally positive\ndefinite if it is positive definite on polynomials without constant term.\nMost of the time we will be working with states on Chxi arising as joint distributions. For\nX1 , X2 , . . . , Xd ∈ Asa,\ntheir joint distribution with respect to ψ is a state on Chxi determined by\nφ [P (x)] = ψ X1 ,X2 ,...,Xd [P (x1 , x2 , . . . , xd )] = ψ [P (X1 , X2 , . . . , Xd )] .\nThe numbers φ [x~u ] are the moments of φ. More generally, for d non-commuting indeterminates\nz = (z1 , . . . , zd ), the series\nX\nM(z) =\nφ [x~u ] z~u\nu\n~\n\nis the moment generating function of φ.\n\nFor a probability measure μ on R all of whose moments are finite, its monic orthogonal polynomials\n{Pn } satisfy three-term recursion relations\n(1)\n\nxPn (x) = Pn+1 (x) + βn Pn (x) + γn Pn−1 (x),\n\nwith initial conditions P−1 = 0, P0 = 1. We will call the parameter sequences\n(β0 , β1 , β2 , . . .), (γ1 , γ2, γ3 , . . .)\nthe Jacobi parameter sequences for μ. Generalizations of such parameters for states with MOPS\nwere found in [Ans08a].\n\n\f4\n\nM. ANSHELEVICH\n\n2.3. Partitions. We will denote the lattice of non-crossing partitions of n elements by NC (n), the\ncorresponding lattice of interval partitions by Int(n). A class B ∈ π of a non-crossing partition is\ninner if for j ∈ B,\nπ\n\nπ\n\n∃ i ∼ k 6∼ j : i < j < k,\notherwise B is outer. The collection of all the inner classes of π will be denoted Inner(π), and\nsimilarly for Outer (π).\nFrom [Ans07a], we take the following notation: for a set V ,\nn\no\nπ\nNC ′ (V ) = π ∈ NC (V ) : min(V ) ∼ max(V ) .\nFor π ∈ NC ′ (V ), we will denote B o (π) the unique outer class of π.\n\nFor comparison, we also recall the notation from [BN08]: for π, σ ∈ NC (n), denote π ≪ σ if\nπ\n\nσ\n\nπ ≤ σ, i.e. i ∼ j ⇒ i ∼ j\nbut\nπ\n\n∀B ∈ σ, min(B) ∼ max(B).\n\b\nIn particular, NC ′ (n) = π ∈ NC (n) : π ≪ 1̂n .\n2.4. Cumulants. For a state φ, its Boolean cumulant generating function is defined by\nη φ (z) = 1 − (1 + M φ (z))−1 ,\nand its coefficients are the Boolean cumulants of φ. They can also be expressed in terms of moments\nof φ using the lattice of interval partitions. Similarly, the free cumulant generating function of a\nstate ψ is defined by the implicit equation\n\u0001\n(2)\nM ψ (w) = Rψ (1 + M ψ (w))w ,\nwhere\n\n\u0010\n\u0011\n(1 + M ψ (w))w = (1 + M ψ (w))w1, (1 + M ψ (w))w2 , . . . , (1 + M ψ (w))wd .\n\nWe will frequently, sometimes without comment, use the change of variables\n(3)\n\nzi = (1 + M ψ (w))wi ,\n\nwi = (1 + Rψ (z))−1 zi .\n\nThe coefficients of Rψ (z) are the free cumulants of ψ, and can also be expressed in terms of the\nmoments of ψ using the lattice of non-crossing partitions:\nX Y\n(4)\nψ[x1 . . . xn ] =\nRψ [xi : i ∈ B] .\nπ∈N C(n) B∈π\n\n\fFREE EVOLUTION ON ALGEBRAS WITH TWO STATES\n\n5\n\n2.5. Two-state cumulants. The typical setting in this paper will be a triple (A, φ, ψ), where A is\nan algebra and φ, ψ are functionals on it. By rotation, we can assume without loss of generality\nthat φ is normalized to have zero means and identity covariance. Then no such assumptions can be\nmade on ψ.\nWe define the conditionally free cumulants of the pair (φ, ψ) via\n\"\n#\nX\nY\nY\nY\nφ [x1 . . . xn ] =\nRφ,ψ\nxi\ni∈B\n\nπ∈NC (n) B∈Outer (π)\n\nRψ\n\nC∈Inner (π)\n\n\"\n\nY\n\n#\n\nxj .\n\nj∈C\n\nTheir generating function is\nRφ,ψ (z) =\n\nX\n\nRφ,ψ [x~u ] z~u .\n\nu\n~\n\nEquivalently (up to changes of variables, this is Theorem 5.1 of [BLS96]), we could have defined\nthe conditionally free cumulant generating function via the condition\n\u0001\n(5)\nη φ (w) = (1 + M ψ (w))−1Rφ,ψ (1 + M ψ (w))w .\n\nFor elements X1 , X2 , . . . , Xn ∈ Asa , we will denote their joint cumulants\nRφ,ψ [X1 , X2 , . . . , Xn ] = Rφ\n\nX1 ,X2 ,...,Xn ,ψ X1 ,X2 ,...,Xn\n\n[x1 , x2 , . . . , xn ]\n\nto be the corresponding joint cumulants with respect to their joint distributions.\nDefinition 1. Let (A, φ, ψ) be an algebra with two states.\n(a) Subalgebras A1 , . . . , Ad ⊂ A are conditionally free, or c-free, with respect to (φ, ψ) if for\nany n ≥ 2,\nai ∈ Au(i) ,\n\ni = 1, 2, . . . , n,\n\nu(1) 6= u(2) 6= . . . 6= u(n),\n\nthe relation\nψ[a1 ] = ψ[a2 ] = . . . = ψ[an ] = 0\nimplies\n(6)\n\nφ [a1 a2 . . . an ] = φ [a1 ] φ [a2 ] . . . φ [an ] .\nS\n(b) The subalgebras are (φ|ψ) free if for a1 , a2 , . . . , an ∈ dj=1 Aj ,\nRφ,ψ [a1 , a2 , . . . , an ] = 0\n\nunless all ai lie in the same subalgebra.\nAs pointed out in [BB08], these properties are not equivalent, however they become equivalent\nunder the extra requirement that the subalgebras are ψ-freely independent. In any case, throughout\nthe paper we will be working with cumulants and will not actually encounter conditional freeness.\nExample 2. If a, c are c-free from b, then (Lemma 2.1 of [BLS96])\nφ [ab] = φ [a] φ [b] ,\nφ [abc] = φ [a] φ [b] φ [c] + (φ [ac] − φ [a] φ [c]) ψ[b].\nExample 3. The following are important particular cases of conditional freeness.\n(a) If φ = ψ, so that (A, φ) is an algebra with a single state, conditional freeness with respect\nto (φ, φ) is the same as free independence with respect to φ. Moreover, Rφ,φ = Rφ .\n\n\f6\n\nM. ANSHELEVICH\n\n(b) If A is a non-unital algebra, define a state δ0 on its unitization C1 ⊕ A by δ0 [1] = 1,\nδ0 [A] = 0. Then conditional freeness of subalgebras (C1 ⊕ A1 ), . . . , (C1 ⊕ Ad ) with respect\nto (φ, δ0 ) is the same as Boolean independence of subalgebras A1 , . . . , Ad with respect to\nφ. Moreover, Rφ,δ0 = η φ .\n(c) Specializing the preceding example, if A = Chxi, it is a unitization of the algebra of polynomials without constant term, and δ0 [P ] is the constant term of a polynomial, so that we\ndenote, even for non-commuting polynomials,\nδ0 [P ] = P (0).\nd\n\n(d) More generally, for any a ∈ R , we can define a state on Chxi by\nδa [P ] = P (a1 , a2 , . . . , ad ).\nThese are exactly the multiplicative ∗-linear functionals on Chxi. Note that δa is the free\nproduct of δai , so it is indeed a state, and here and in all the preceding examples, the two parts\nof Definition 1 coincide. This particular case of the c-free theory is related to the objects in\n[KY04], and also to Fermi independence (see Lemma 5).\nSee the references for other particular cases and generalizations of conditional freeness; the appearance of the free Meixner laws (Section 2.7) in related contexts has been observed even more\nwidely. Note also that the only other natural product, the monotone product of Muraki, can also\nto some degree be handled in the c-free language [Fra05]: the monotone product of φ1 with φ2 is\ntheir conditionally free product for the second state δ0 ∗ φ2 . However, while the monotone product\nis associative, the triple product is apparently not a conditionally free product. See also Remark 11\nand Lemma 9.\n2.6. Convolutions. If φ, ψ are two unital linear functionals on Chxi, then φ ⊞ ψ is their free\nconvolution, that is a unital linear functional on Chxi determined by\n(7)\n\nRφ (z) + Rψ (z) = Rφ⊞ψ (z) .\n\nSimilarly, φ ⊎ ψ, their Boolean convolution, is a unital linear functional on Chxi determined by\nη φ (z) + η ψ (z) = η φ⊎ψ (z).\nSee Lecture 12 of [NS06] for the relation between free convolution and free independence; the\nrelation in the Boolean case is similar.\nThe functionals ρ⊞t form a free convolution semigroup if ρ⊞t ⊞ ρ⊞s = ρ⊞(t+s) . If ρ⊞t are states for\nall t ≥ 0, we say that ρ is freely infinitely divisible, and will denote the corresponding semigroup\nby {ρt }. The functionals φ⊎t form a Boolean convolution semigroup if φ⊎t ⊎ φ⊎s = φ⊎(t+s) . Any\nstate is infinitely divisible in the Boolean sense.\n2.7. Free Meixner distributions and states. The semicircular distribution with mean α and variance β is\n1 p\nd SC (α, β)(x) =\n(4β − (x − α)2 1[−2√β,2√β] (x) dx\n2πβ\nFor every α, β, SC (αt, βt) form a free convolution semigroup with respect to t.\nFor b ∈ R, 1 + c ≥ 0, the free Meixner distributions, normalized to have mean zero and variance\none, are\np\n1 4(1 + c) − (x − b)2\ndx + zero, one, or two atoms.\ndμb,c (x) =\n2π\n1 + bx + cx2\n\n\fFREE EVOLUTION ON ALGEBRAS WITH TWO STATES\n\n7\n\nThey are characterized by their Jacobi parameter sequences having the special form\n(0, b, b, b, . . .), (1, 1 + c, 1 + c, 1 + c, . . .),\nor by the special form of the generating function of their orthogonal polynomials. In particular,\nμ0,0 = SC (0, 1) is the standard semicircular distribution, μb,0 are the centered free Poisson distributions, and μb,−1 are the normalized Bernoulli distributions. Moreover,\nμb,c = SC (b, 1 + c)⊎1/(1+c) ⊎ δ−b .\n⊎t\nUn-normalized free Meixner distributions, of mean α and variance t, are μ⊞t\nb,c ⊞ δα or μβ,γ ⊎ δα , see\nLemma 3.\n\nMore generally, free Meixner states are states on Chxi, characterized by a number of equivalent\nconditions (see [Ans07a]), among them the equations\n(8)\n\nDi Dj Rφ (z) = δij +\n\nd\nX\n\nBijk Dk Rφ (z) + Cij Di Rφ (z) Dj Rφ (z) .\n\nk=1\n\n\b\nfor certain Bijk , Cij . In [Ans07b], these equations were shown to be equivalent to\n(9)\n\nDi Dj η φ (z) = δij +\n\nd\nX\n\nBijk Dk η φ (z) + (1 + Cij )Di η φ (z)Dj η φ (z).\n\nk=1\n\n2.8. Orthogonality of the c-free Appell polynomials. The c-free version of the Appell polynomials were investigated in [Ans08b]. A result which motivated the investigation of the free Meixner\ndistributions below is the following lemma.\nLemma 1 (Lemma 5, Theorem 6 of [Ans08b]). The c-free Appell polynomials in (A, φ, ψ) are\northogonal if and only if ψ is a free product of semicircular distributions SC (bi , 1 + ci ), and φ =\nP\nΦ [ψ]. In this case, Rφ,ψ (z) = di=1 zi2 , and φ is a free Meixner state.\nHere Φ is a map defined by Belinschi and Nica in [BN07b] via\nη\n\nΦ[ψ]\n\n(w) =\n\nd\nX\n\nwi (1 + M ψ (w))wi ,\n\ni=1\n\nsee [Ans08b] for other descriptions of it.\n3. F REE M EIXNER\n\nDISTRIBUTIONS AND CONDITIONAL FREENESS\n\nLemma 2. For two functionals φ, ψ, Rφ,ψ (z) =\n\nPd\n\ni=1\n\nai zi + βRψ (z) if and only if\n\nφ = δa ⊎ ψ ⊎β .\nEquivalently, if ρ is a (not necessarily positive) functional with Rρ (z) = Rφ,ψ (z) and Rψ (z) =\nPd\nρ\ni=1 ai zi + tR (z), then\nψ = δa ⊞ ρ⊞t = δa ⊎ φ⊎t .\n\n\f8\n\nM. ANSHELEVICH\n\nProof. If Rφ,ψ (z) =\n\nPd\n\ni=1\n\nai zi + βRψ (z), then\n\nη φ (w) = (1 + M ψ (w))−1Rφ,ψ (1 + M ψ (w))w\n=\n\nd\nX\n\n\u0001\n\nai wi + β(1 + M ψ (w))−1 Rψ (1 + M ψ (w))w\n\ni=1\n\n=\n\nd\nX\n\nai wi + β(1 + M ψ (w))−1 M ψ (w) =\n\ni=1\n\nso\n\nd\nX\n\n\u0001\n⊎β\n\nai wi + βη ψ (w) = η δa + η ψ ,\n\ni=1\n\nφ = δa ⊎ ψ ⊎β .\nReversing the argument gives the reverse implication. The proof of the second statement is similar.\n\u0003\nDefinition and Remark 4. For ρ, ψ linear functionals, define the map\n(ρ, ψ) 7→ Φ [ρ, ψ]\nvia\nIn other words, for\n\n\u0001\nη Φ[ρ,ψ] (w) = (1 + M ψ (w))−1Rρ (1 + M ψ (w))w .\nφ = Φ [ρ, ψ]\n\nwe have\nRρ (z) = Rφ,ψ (z) .\nNote that RSC (0,1) (z) =\nη\n\nΦ[SC (0,1),ψ]\n\nPd\n\n2\ni=1 zi ,\n\nso that\nψ\n\n(w) = (1 + M (w))\n\n−1\n\nd\nX\n\n(1 + M ψ (w))wi (1 + M ψ (w))wi\n\ni=1\n\nand\n\nΦ [SC (0, 1), ψ] = Φ [ψ] .\nOn the other hand, from R\n= R and Rφ,δ0 = η φ it follows that for any ρ, Φ [ρ, ρ] = ρ and\nB[Φ [ρ, δ0 ]] = ρ, where the map B is defined in the next remark. See also Remark 10.\nφ,φ\n\nφ\n\nWe will discuss in the next section under what conditions Φ [ρ, ψ] is a state.\nDefinition and Remark 5. For a ∈ Rd , define the transformation Ba,t by\n\u0010\n\u0011⊎1/(1+t)\nBa,t [ρ] = (ρ⊞(1+t) ⊞ δa ) ⊎ δ−a\n.\n\nBa,t maps functionals to functionals; for t ≥ 0, it maps states to states. For t > −1, Ba,t maps freely\ninfinitely divisible states to states; for smaller t, the domains of Bt as a map from states to states get\nprogressively smaller. For a = 0,\nB0,t [ρ] = Bt [ρ] = (ρ⊞(1+t) )⊎(1/(1+t))\nis the Belinschi-Nica transformation [BN07a, BN07b]. In particular, B0,1 = B, the Boolean-to-free\nversion of the Bercovici-Pata bijection. On the other hand, we will show below that for each ρ,\nB(ρ[x1 ],...,ρ[xd ]),0 [ρ]\n\n\fFREE EVOLUTION ON ALGEBRAS WITH TWO STATES\n\n9\n\nis the image of ρ under the Boolean-to-Fermi version of the Bercovici-Pata bijection, in the sense\nof [Ora02].\nP\nThe preceding lemma states that if Rρ (z) = Rφ,ψ (z) and Rψ (z) = di=1 ai zi + (1 + t)Rρ (z), then\nφ = Ba,t [ρ]. In other words,\n\u0002\n\u0003\n\u0002\n\u0003\n(10)\nφ = Ba,t [ρ] = Φ ρ, ρ⊞(1+t) ⊞ δa = Φ ρ, ρ ⊞ ρ⊞t ⊞ δa .\n\nWe will generalize this result in the next section. Note also that in this case, ψ = Ut (φ) in the sense\nof [KY04].\nThe following lemma extends Proposition 8 from [Ans07b] and Example 4.5 and Remark 4.6 from\n[BN07a].\nLemma 3.\n(a) For μb,c a free Meixner distribution,\nBα,t [μb,c ] = μb+α,c+t\nis also a free Meixner distribution.\n(b) More generally, for φ{Ti },C a free Meixner state,\nBa,t [φ{Ti },C ] = φ{ai I+Ti },tI+C\nis also a free Meixner state.\n(c) Any free Meixner distribution can be obtained from the Bernoulli distribution\n1\n1\nμ0,−1 = δ−1 + δ1\n2\n2\nby the application of the appropriate Bα,t .\n(d) For ρ = μb,c a free Meixner distribution,\nh\ni\n⊞(1+t)\nΦ μb,c , μb,c\n⊞ δα = Bα,t [μb,c ] = μb+α,c+t .\nA partial converse to this statement is given in Proposition 12.\n\nProof. For part (a), it suffices to show that\n⊞(1+γ−c)\n\nδβ−b ⊞ μb,c\n\n⊎(1+γ−c)\n\n= δβ−b ⊎ μβ,γ\n\n.\n\nμb,c has Jacobi parameter sequences\n{(0, b, b, b, . . . , ), (1, 1 + c, 1 + c, 1 + c, . . .)} ,\n⊞(1+γ−c)\n\nAs a particular case of the results in Section 3.1 of [Ans07a], it follows that δβ−b ⊞ μb,c\nJacobi parameter sequences\n\nhas\n\n{(β − b, β, β, β, . . . , ), (1 + γ − c, 1 + γ, 1 + γ, 1 + γ, . . .)} .\nOn the other hand, as observed in [BW01] or the Appendix of [Ans07b], for any measure μ with\nJacobi parameters\n{(β0 , β1 , β2 , . . .), (γ1 , γ2, γ3 , . . .)} ,\n⊎t\nthe measure δα ⊎ μ has Jacobi parameters\n{(α + tβ0 , β1 , β2 , . . .), (tγ1 , γ2 , γ3 , . . .)} .\n\n\f10\n\nM. ANSHELEVICH\n\nThe result follows. The proof for part (b) is similar. For part (c),\nμb,c = Bb,1+c [μ0,−1 ].\nPart (d) follows by combining part (a) with equation (10).\n\n\u0003\n\nExample 6. In the c-free central limit theorem (Theorem 4.3 of [BLS96]), for the limiting distribution Rρ (z) = Rφ,ψ (z) = z 2 , so that ρ = μ0,0 is the semicircular distribution and\nφ = Φ [ψ]\nIf moreover Rψ (z) = tz 2 , that is ψ = ρ⊞t , then\n\u0002\n\u0003\nφ = Φ μ⊞t\n0,0 = μ0,−1+t\nso that φ can be any symmetric free Meixner distribution.\n\nIn the c-free Poisson limit theorem (centered version of Theorem 4.4 of [BLS96]), for the limiting\nz2\n, so ρ = μb,0 is the centered free Poisson distribution. Using\ndistribution Rρ (z) = Rφ,ψ (z) = 1−bz\nLemma 9, it follows that\nφ = Φ [μb,0 , ψ] = Φ [δb ⊲ ψ] = Φ [δb ⊎ ψ] .\n2\n\nz\nIf moreover Rψ (z) = t 1−az\nfor a = b, then ψ = ρ⊞t and\n\u0002\n\u0003\nφ = Φ [ρ, ψ] = Φ μb,0 , μ⊞t\nb,0 = μb,−1+t ,\n\nso that φ can be any free Meixner distribution. If a 6= b, then\n\u0003\n\u0002\n\u0003\n\u0002\n\u0003\n\u0002\n⊎t\n⊎t\nφ = Φ δb ⊎ μ⊞t\n=\nΦ\nδ\n⊎\nB\n[μ\n]\n=\nΦ\nδ\n⊎\nμ\nb\nt−1\na,0\nb\na,0\na,−1+t = Φ [δb−a ⊎ SC (a, t)] ,\n\nwhich is a distribution whose Jacobi parameter sequences are constant after step three, cf. Theorems\n11 and 12 of [KW05].\nSimilar arguments explain the appearance of the free Meixner distributions in various contexts\nwhich can be derived from the c-free formalism.\nFinally, if φ = μβ,γ and ρ = μb,c are both free Meixner distributions, as long as\n(c ≤ 0, γ ≥ c) or 1 + γ ≥ c > 0,\n⊞(1+γ−c)\n\nRφ,ψ (z) = Rρ (z) for ψ = μb,c\n⊞ δβ−b . Moreover, for arbitrary free Meixner distributions,\nμβ,γ = Bβ−b,γ−c [μb,c ]. In this case 1 + γ − c may be negative, however μb,c is in the range of Bα,1+c\n(its ⊞-divisibility indicator in the sense of equation 1.7 of [BN07a] is 1 + c), and so in the domain\nof Bα,t for t ≥ −(1 + c).\nSimilar results hold in the multivariate case. See also Remark 10.\nProposition 4. If φ is a free Meixner state, then\nX\nDi Dj Rφ,ψ (z) = δij +\nBijk Dk Rφ,ψ (z) + (1 + Cij )Di Rφ,ψ (z) Dj Rφ,ψ (z)\nk\nψ\n\n− Di R (z) Dj Rφ,ψ (z) .\n\nNote that this reduces to equation (8) for ψ = φ, and to equation (9) for ψ = δ0 .\n\n\fFREE EVOLUTION ON ALGEBRAS WITH TWO STATES\n\n11\n\nProof. From relation (5), it follows that\nDj η φ (w) = (Dj Rφ,ψ ) (1 + M ψ (w))w\nand\n\n\u0001\n\n\u0001\n\u0002\n\u0001\u0003\n(Di Dj Rφ,ψ ) (1 + M ψ (w))w = Di (1 + M ψ (w))−1 (Dj Rφ,ψ ) (1 + M ψ (w))w\n\u0002\n\u0003\n= Di (1 + M ψ (w))−1 Dj η φ (w)\n= Di (1 + M ψ (w))−1Dj η φ (w) + Di Dj η φ (w)\n= −Di η ψ (w)Dj η φ (w) + Di Dj η φ (w).\nFrom equation (9) for η φ we get\nDi Dj Rφ,ψ (z) = δij +\n\nX\n\nBijk Dk Rφ,ψ (z) + (1 + Cij )Di Rφ,ψ (z) Dj Rφ,ψ (z)\n\nk\nψ\n\n− Di η (w)Dj Rφ,ψ (z)\nSince\n(11)\n\n\u0002\n\u0003\nDi η ψ (w) = Di (1 + M ψ (w))−1 M ψ (w)\n\u0002\n\u0001\u0003\n\u0001\n= Di (1 + M ψ (w))−1 Rψ (1 + M ψ (w))w = (Di Rψ ) (1 + M ψ (w))w\n\nwe finally get\n\nDi Dj Rφ,ψ (z) = δij +\n\nX\n\nBijk Dk Rφ,ψ (z) + (1 + Cij )Di Rφ,ψ (z) Dj Rφ,ψ (z)\n\nk\nψ\n\n− Di R (z) Dj Rφ,ψ (z) .\n\n\u0003\n\nRemark 7 (Laha-Lukacs relations). In [LL60], Laha and Lukacs proved that the Meixner distributions are characterized by a certain property involving linear conditional expectations and quadratic\nconditional variances. In [BB06], Bożejko and Bryc proved that an identical characterization holds,\nin the free setting, for the free Meixner distributions. In [BB08], they further characterized all distributions having the Laha-Lukacs property in the two-state setting. In our notation, and with some\nextra assumptions, their result states that in this case,\nRφ,ψ (z) =\n\nz2\n,\n1 − bz − cRψ (z)\n\nor equivalently\nD 2 Rφ,ψ (z) = 1 + bDRφ,ψ (z) + cDRψ (z) DRφ,ψ (z) .\nThus for b = c = 0, one gets Rφ,ψ (z) = z 2 and φ = Φ [ψ], while for c = 0, one gets Rφ,ψ (z) =\nz2\nand the appropriate analog of the Poisson law. On the other hand, for general b, c, Rφ,ψ (z)\n1−bz\ndoes not itself satisfy a quadratic equation for general ψ, so the general two-state Laha-Lukacs\ndistributions are not directly related to the free Meixner states. This was already observed in Section\n4.4 of [Ans07b], where the Boolean Laha-Lukacs distributions (a particular case of the result in\n[BB08]) were found to be the Bernoulli distributions, which include the Boolean analogs of the\nnormal and Poisson laws, but do not include all the free Meixner distributions. On the other hand,\nif Rφ,ψ (z) = Rψ (z), in which case also φ = ψ, one recovers a quadratic equation, all free Meixner\ndistributions, and free probability.\n\n\f12\n\nM. ANSHELEVICH\n\n4. T HE\n\nTRANSFORMATIONS\n\nBa,t\n\nAND\n\nΦ[ρ, ψ]\n\n4.1. Properties of Ba,t .\nLemma 5. The maps Ba,t form a semigroup:\nBa,t ◦ Bb,s = Ba+b,t+s .\nIn particular, Bt and Ba,0 commute, and\nBa,t = Bt ◦ Ba,0 .\nMoreover, for each ρ,\nB(ρ[x1 ],...,ρ[xd ]),0 [ρ]\nis the image of ρ under the Boolean-to-Fermi version of the Bercovici-Pata bijection, in the sense\nof [Ora02].\nProof. The representation\nη Ba,t [ρ] [xi ] = η ρ [xi ] = ρ[xi ]\nand for n > 1, |~u| = n,\nη Ba,t [ρ] [xu(1) , xu(2) , . . . , xu(n) ] =\n\nX \u0010Y\n\nX\n\nπ∈NC ′ (n) S⊂Sing(π) i∈S\n\n\u0011 c\nY\nη ρ [xu(i) : i ∈ B]\nau(i) t|S |−1\nB∈S c\n\nis obtained by the same methods as in [BN08]. In particular,\nX\nY\nt|π|−1\nη B0,t [ρ] [xu(1) , xu(2) , . . . , xu(n) ] =\nη ρ [xu(i) : i ∈ B]\nB∈π\n\nπ∈NC ′ (n)\n\nand\n(12)\n\nη Ba,0 [ρ] [xu(1) , xu(2) , . . . , xu(n) ] =\n\n\u0010Y\n\nX\n\n{1,n}⊂Λ⊂{1,2,...,n} i6∈Λ\n\n\u0011\nau(i) η ρ [xu(i) : i ∈ Λ]\n\nwhich are easily seen to commute, and which proves the semigroup property.\n−−→\nMoreover, denoting ρ[x] = (ρ[x1 ], ρ[x2 ], . . . , ρ[xd ]),\n\u0011\n\u0010Y\nX\nB−−→ [ρ]\nρ[xu(i) ] η ρ [xu(i) : i ∈ Λ]\nη ρ[x],0 [xu(1) , xu(2) , . . . , xu(n) ] =\n{1,n}⊂Λ⊂{1,2,...,n} i6∈Λ\n\n=\n\nX\n\n\u0010\n\nY\n\n{i}∈Inner (π)\nπ∈NC ′ (n)\nInner (π)⊂Sing(π)\n\n\u0011\nρ[xu(i) ] η ρ [xu(i) : i ∈ B o (π)].\n\nUsing Definition 2.2 from [Ora02], it now easily follows that the Boolean cumulants of ρ are the\n−→ [ρ]. In other words, for each ρ, B−−→ [ρ] is the image of ρ under the\nFermi cumulants of B−\nρ[x],0\nρ[x],0\nBoolean-to-Fermi version of the Bercovici-Pata bijection.\n\u0003\n\n\fFREE EVOLUTION ON ALGEBRAS WITH TWO STATES\n\n13\n\n4.2. Properties of Φ [*, *].\nTheorem 6. On Chx1 , x2 , . . . , xd i, let ψ be a positive definite functional and μ a conditionally\npositive definite functional. Define a functional η via\nM η (w) = (1 + M ψ (w))−1 M μ ((1 + M ψ (w))w).\nThen η is conditionally positive definite.\nThe proof is delayed until Section 4.3.\nCorollary 7. Let f, g be power series whose coefficient sequences are positive definite. Then the\ncoefficient sequence of\nf (zg(z))g(z)\nis also positive definite.\nProof. In a single variable, a sequence {m0 , m1 , m2 , . . .} is conditionally positive definite if and\nonly if the sequence {m2 , m3 , m4 , . . .} is positive definite. In particular, the coefficient sequence of\nz 2 f (z) is conditionally positive definite. So by Theorem 6, the coefficient sequence of\ng(z)−1 (zg(z))2 f (zg(z)) = z 2 f (zg(z)g(z)\nis conditionally positive definite, and therefore the coefficient sequence of f (zg(z))g(z) is positive\ndefinite.\n\u0003\nThe following corollary was proved in Lemma 6.1 of [Kry07], in the one-variable compactly supported case, by complex-analytic methods.\nCorollary 8. Let ψ be a state. For any conditionally positive functional μ, there exists a state φ\nsuch that Rφ,ψ = M μ . Equivalently, for any freely infinitely divisible state ρ, there exists a state φ\nsuch that Rφ,ψ = Rρ .\nProof. The conditionally positive functional η obtained in Theorem 6 is necessarily a Boolean cumulant functional of a state φ. The second statement follows from the fact that the free cumulant\nfunctional of a freely infinitely divisible state is conditionally positive definite.\n\u0003\nRemark 8 (Schoenberg correspondence). Another interpretation of this result is in terms of the\nSchoenberg correspondence, see Corollary 3.6 of [Fra03] or [Sch91]. Let ψ be any freely infinitely\ndivisible state. A functional μ = Rρ is conditionally positive if and only if it a generator of a c-free\nconvolution semigroup of pairs of states (φ(t), ψ(t)), in the sense that\nμ=\n\nd\ndt\n\nt=0\n\nφ(t),\n\nwith ψ(1) = ψ. Indeed, for ψ(t) = ψ ⊞t , and φ(t) chosen so that\n⊞t\n\n⊞t\n\nRφ(t),ψ = tM μ = tRρ = Rρ ,\n\u0002\n\u0003\nin other words for φ(t) = Φ ρ⊞t , ψ ⊞t , the two properties above hold. The converse is standard.\nNote that we recover the Boolean version of the correspondence for ψ = δ0 , and the free version\nfor ψ = ρ.\n\n\f14\n\nM. ANSHELEVICH\n\nDefinition and Remark 9. For two functionals τ, ψ, the monotone convolution τ ⊲ ψ of Muraki\n[FM05] is determined by\n\u0010\n\u0001\u0011\n(13)\n(1 + M τ ⊲ψ (w)) = 1 + M τ (1 + M ψ (w))w (1 + M ψ (w)).\nSo far, this operation has apparently been considered only in one variable, in which case this equation is equivalent to the condition\nFτ ⊲ψ (w) = Fτ (Fψ (w))\non the reciprocal Cauchy transforms of the corresponding measures. It follows from Remark 11\nthat the monotone convolution of states is a state.\nLemma 9. Let ψ be a state.\n(a) Suppose that Rρ has the special form\nRρ (z) =\n\n(14)\n\nd\nX\n\nzi (1 + M τ (z))zi ,\n\ni=1\n\nwhich we will denote by ρ = Φfree [τ ], where τ is a state. Note that Φfree [τ ] = B[Φ [τ ]]. Then\nΦ [τ ⊲ ψ] = Φ [Φfree [τ ], ψ] .\n\n(15)\n(b) δa ⊲ ψ = δa ⊎ ψ.\n\nProof. Since τ is a state, by Lemmas 12 and 13 of [Ans08a] Rρ is conditionally positive definite\nand so ρ is freely infinitely divisible. Then\nd\n\u0010\n\u0001 X\n\u0001\u0011\nψ\n−1 ρ\nψ\n(1 + M (w)) R (1 + M (w))w =\nwi 1 + M τ (1 + M ψ (w))w (1 + M ψ (w))wi\ni=1\n\nso that for φ = Φ [ρ, ψ],\n\nη φ (w) =\n\nd\nX\n\nwi (1 + M τ ⊲ψ (w))wi .\n\ni=1\n\nEquation (15) follows.\nFor part (b), by definition\n(1 + M\n\nδa ⊲ψ\n\n\u0010\n\u0001\u0011\nψ\nδa\n(w)) = 1 + M (1 + M (w))w (1 + M ψ (w))\n\nd\n\u0010\n\u0011−1\nX\n= 1−\nai (1 + M ψ (w))wi\n(1 + M ψ (w)),\ni=1\n\nso\nη\n\nδa ⊲ψ\n\n\u0010\n\u0011−1\nδa ⊲ψ\n(w) = 1 − 1 + M\n(w)\n\nd\n\u0010\n\u0011\nX\n= 1 − (1 + M (w))\n1−\nai (1 + M ψ (w))wi\nψ\n\n−1\n\ni=1\n\n= 1 − (1 + M ψ (w))−1 +\n\nd\nX\ni=1\n\nai wi = η δa ⊎ψ (w).\n\n\u0003\n\n\fFREE EVOLUTION ON ALGEBRAS WITH TWO STATES\n\n15\n\nTheorem 10.\n(a) For φ = Φ [ρ, ψ], any two of the functionals (φ, ρ, ψ) uniquely determine the third.\n(b) Φ [*, *] is a well-defined map\n(ρ = freely infinitely divisible state, ψ = state) 7→ (φ = state).\nFrom now on, unless stated otherwise, we will consider Φ [*, *] with these domain and range.\nNote that φ has the same mean and covariance as ρ.\n(c) ρ is the unique fixed point of the maps Φ [ρ, *] and Φ [*, ρ]. In particular, a free product of\nstandard semicircular distributions is the unique fixed point of Φ.\n(d) For fixed ρ with mean zero and identity covariance, the image of the single-variable map\nΦ [ρ, *] consists of all states with the same mean and covariance as ρ if and only if ρ = μ0,0\nis semicircular, in which case Φ [μ0,0 , ψ] = Φ [ψ], or more generally if ρ = μb,0 is centered\nfree Poisson, in which case\nΦ [μb,0, ψ] = Φ [ψ ⊎ δb ] .\nIn several variables, Φ [ρ, *] is never onto.\n(e) For fixed ψ, the map Φ [*, ψ] is onto if and only if ψ = δ0 , in which case Φ [ρ, δ0 ] = B−1 [ρ],\nor more generally if ψ = δa , in which case\nΦ [ρ, δa ] = Ba,−1 [ρ] = Ba,0 ◦ B−1 [ρ].\nProof. For part (a), we note that Rρ = Rφ,ψ , φ = Φ [ρ, ψ], and ψ is determined by\n\u0010\n\u0011\n\u0010\n\u0011\n(16)\n(1 + M ψ (w))w1, . . . , (1 + M ψ (w))wd = (DRρ )h−1i Dη φ (w) ,\n\nwhere (DRρ )h−1i (z) is the inverse of the d-tuple of power series\n\u0010\n\u0011\nD1 Rρ (z1 , . . . , zd ) , . . . , Dd Rρ (z1 , . . . , zd )\nwith respect to composition.\n\nPart (b) is a re-formulation of Corollary 8.\nSince Rψ,ψ (z) = Rψ (z), Φ [ψ, ψ] = ψ. So by part (a), Φ [ρ, ψ] = ψ = Φ [ψ, ψ] if and only if\nψ = ρ. Similarly, Φ [ρ, ψ] = ρ = Φ [ρ, ρ] if and only if ρ = ψ.\nP\nIf the map Φ [*, *] is onto, in particular the Bernoulli distribution, with η φ (w) = di=1 wi2 , is in the\nimage. In this case, using equation (11),\n\u0001\n(Di Rρ ) (1 + M ψ (w))w = Di η φ (w) = wi ,\nso that\nand\n\n\u0010\n\u0011−1\nDi Rρ (z) = 1 + Rψ (z)\nzi\n\nRρ (z) =\n\nd\n\u0010\n\u0011−1\nX\nzi 1 + Rψ (z)\nzi .\ni=1\n\nThus in the notation of the preceding Lemma, ρ = Φfree [τ ], where\n\u0010\n\u0011−1\n(17)\n1 + M τ (z) = 1 + Rψ (z)\n\n\f16\n\nM. ANSHELEVICH\n\nSince ρ is freely infinitely divisible, Rρ is conditionally positive definite, and therefore τ is positive\ndefinite. Indeed, for any i\nτ [P (x)∗ P (x)] = Rρ [xi P (x)∗ P (x)xi ] = Rρ [(P (x)xi )∗ (P (x)xi )] ≥ 0.\nOn the other hand, from equation (17)\nX\nX\n1+\nτ [xi ]zi +\nτ [xi xj ]zi zj + . . .\ni\n\ni,j\n\n=1−\n\nX\ni\n\nψ\n\nR [xi ] zi −\n\nX\ni,j\n\nψ\n\nR [xi xj ] zi zj +\n\n\u0010X\n\nψ\n\nR [xi ] zi\n\ni\n\n\u0011\u0010X\nj\n\nψ\n\n\u0011\n\nR [xj ] zj ,\n\nso that τ [xi ] = −ψ[xi ] and\nRτ [xi xj ] = τ [xi xj ] − τ [xi ]τ [xj ] = −Rψ [xi xj ] .\nThus the covariance matrices of ψ, τ differ by a sign. On the other hand, since τ, ψ are positive\ndefinite, so are their covariance matrices. It follows that these matrices are both zero. Therefore\nboth τ and ψ are multiplicative linear functionals, and so delta measures.\nP\nP\nP\nIf τ = δa , then 1 + M τ (z) = (1 − di=1 ai zi )−1 and Rρ (z) = dj=1 zj (1 − di=1 ai zi )−1 zj , so that\nDi Dj Rρ (z) = δij + ai Dj Rρ (z)\n\nand ρ is the free Meixner state φ{ai I},0 , the free product of centered free Poisson distributions. ρ has\nthe special form in the equation (14), so by the preceding Lemma,\nΦ [Φfree [δa ], ψ] = Φ [δa ⊲ ψ] = Φ [δa ⊎ ψ] .\nIn several variables, Φ is not onto all the states with mean zero and identity covariance, for example\nit follows from the proof of Theorem 6 of [Ans08b] that most of the free Meixner states are not in\nits image. Therefore in this case, Φ [ρ, *] is never onto. In one variable, by the arguments used in\nthe proof of Corollary 7, Φ is onto. Finally,\nΦ [*, δa ] = Ba,0 [Φ [*, δ0 ]] = Ba,0 ◦ B−1\nare all bijections from freely infinitely divisible states onto all states.\n\n\u0003\n\nTheorem 11. Let ρ be a freely infinitely divisible state with the free convolution semigroup {ρt }.\n(a)\n\u0002\n\u0003\nΦ ρ⊞t ⊞ δa , ψ = Φ [ρ, ψ]⊎t ⊎ δa .\n(b)\n\nΦ [ρ, ψ ⊞ ρt ] = Bt [Φ [ρ, ψ]].\nEquivalently, if Rφ,ψ = Rρ , then RBt [φ],ψ⊞ρt = Rφ,ψ = Rρ does not depend on t. More\ngenerally,\n\u0002\n\u0003\nΦ ρ, ψ ⊞ ρ⊞t ⊞ δa = Ba,t [Φ [ρ, ψ]] = Bt [Φ [ρ, ψ ⊞ δa ]] = Ba,0 [Φ [ρ, ψ ⊞ ρt ]].\n\nWe will present two proofs of this theorem. The combinatorial proof has all the details and works\nfor general functionals. On the other hand, the operator-representation proof in the next section\nmay be more illuminating.\n\n\fFREE EVOLUTION ON ALGEBRAS WITH TWO STATES\n\n17\n\nCombinatorial proof. Part (a) follows by exactly the same method as Lemma 2.\nFor part (b), on one hand, by expanding the defining relation (5),\nη Φ[ρ,ψ⊞ρt ] [x1 , x2 , . . . , xn ]\nX\n\n=\n\nρ\n\nR [xi : i ∈ Λ]\n\nk\nY\n\n(ψ ⊞ ρt )[xi : u(j − 1) + 1 ≤ i ≤ u(j) − 1].\n\nj=1\n\nΛ⊂{1,...,n}\nΛ={u(0)=1,u(1),u(2),...,u(k)=n}\n\nCombining this with the definition (7) of free convolution and expansion (4), we get\n(18) η Φ[ρ,ψ⊞ρt ] [x1 , x2 , . . . , xn ]\n=\n\nX\n′\n\nπ∈NC (n) V\n\nX\n\nt|V |−1\n\n:B o (π)∈V\n\nY\n\nRρ [xi : i ∈ B]\n\nB∈V\n\n⊂π\n\nY\n\nψ[xi : i ∈ C].\n\nC∈π\\V\n\nOn the other hand,\nη Φ[ρ,ψ] [x1 , x2 , . . . , xn ]\nX\n\n=\n\nρ\n\nR [xi : i ∈ Λ]\n\nX\n\nY\n\nRρ [xi : i ∈ B o (σ)]\n\nσ∈NC ′ (n)\n\nψ[xi : u(j − 1) + 1 ≤ i ≤ u(j) − 1]\n\nj=1\n\nΛ⊂{1,...,n}\nΛ={u(0)=1,u(1),u(2),...,u(k)=n}\n\n=\n\nk\nY\n\nRψ [xi : i ∈ C] .\n\nC∈Inner (π)\n\nAlso, by Remark 4.4 of [BN07b],\nη Bt [φ] [x1 , x2 , . . . , xn ] =\n\nX\n\nt|ω|−1\n\nω∈NC ′ (n)\n\nY\n\nη φ [xi : i ∈ B].\n\nB∈ω\n\nThus\n(19)\n\nη Bt [Φ[ρ,ψ]] [x1 , x2 , . . . , xn ]\nX\nY\n=\nt|ω|−1\nω∈NC ′ (n)\n\nX\n\nRρ [xi : i ∈ B o (σ)]\n\nB∈ω σ∈NC ′ (B)\n\nY\n\nRψ [xi : i ∈ C] .\n\nC∈Inner (π)\n\nClearly every term of the sum (19) appears in the sum (18) for some pair (π, V ). It remains to show\nthe converse, namely that each such pair corresponds to the unique collection\n{ω = (B1 , B2 , . . . , Bk ) ∈ NC ′ (n), {σi ∈ NC ′ (Bi )}}\nwith\n(20)\n\nπ\n\nσ\n\ni ∼ j ⇔ i ∼s j for some s\n\nand\n(21)\n\nV = ∪ki=1 Bo (σi ).\n\nThis correspondence is very closely related to Lemma 3 of [Ans07a] and Remark 6.3 of [BN07b].\nω\nNamely, define ω as follows: for any j, let j ∼ i for i the largest element with the property that\ni, i′ ∈ B ∈ V,\n\ni ≤ j < i′ .\n\n\f18\n\nM. ANSHELEVICH\n\nNote that since B o (π) ∈ V , such an i always exists. Clearly ω ∈ NC ′ (n) and π ≤ ω, so we can\ndefine each σs via equation (20). For each B ∈ ω, min(B) and max(B) lie in the same class of π\nwhich in fact belongs to V . Relation (21) and σi ∈ NC ′ (Bi ) follow.\nFor the second equation in part (b), it suffices to show that\nBa,0 [Φ [ρ, ψ]] = Φ [ρ, ψ ⊞ δa ] ,\n\u0003\n\nwhich follows by very similar methods using representation (12).\n\nProposition 12. Let ρ, ψ be freely infinitely divisible distributions, so that φ = Φ [ρ, ψ], by definition, is a c-freely infinitely divisible distribution. Suppose φ is a free Meixner distribution. Then all\nthe distributions in its semigroup\n\u0002\n\u0003\nφ(t) = Φ ρ⊞t , ψ ⊞t\n\nfrom Remark 8 are (un-normalized) free Meixner if and only if ρ is free Meixner and ψ = ρ⊞(1+s) ⊞\nδα . Thus, while the Boolean (ψ = δ0 ) and free (ψ = ρ) evolutions preserve the Meixner class,\ngeneral c-free evolution does not.\nProof. If ρ = μb,c is freely infinitely divisible, so that c ≥ 0, then\nh\ni\nh\ni⊎t\n⊞(1+s)t\n⊞(1+s)t\nφ(t) = Φ μ⊞t\n,\nμ\n⊞\nδ\n=\nΦ\nμ\n,\nμ\n⊞\nδ\n= μ⊎t\nαt\nb,c\nαt\nb,c\nb+αt,−1+c+(1+s)t\nb,c\nb,c\n\nis a free Meixner distribution, with −1 + c + (1 + s)t ≥ −1. For the converse, suppose that all φ(t)\nare free Meixner. Normalize φ to have mean zero and variance 1. Then\n\u0010\n\u00112\n(22)\nD 2 η φ(t) (z) = t + b(t)Dη φ(t) (z) + c(t) Dη φ(t) (z) .\n\nTo simplify notation, we write xu(1) , . . . , xu(n) , although in the single-variable context all of these\nare equal to x. We know that\nX\nY\nη φ [xu(1) , xu(2) , . . . , xu(n) ] =\nRρ [xi : i ∈ B o (π)]\nRψ [xi : i ∈ C]\nπ∈NC ′ (n)\n\n=R\n\n\u0002\nρ\n\nC∈Inner (π)\n\n\u0003\n\nxu(1) , xu(2) , . . . , xu(n) + products of lower order terms.\n\nTherefore given φ, each Rρ [*] is uniquely determined by the lower order Rψ [*]. Thus\nX\nY\nη φ(t) [xu(1) , xu(2) , . . . , xu(n) ] =\nt|π| Rρ [xi : i ∈ B o (π)]\nRψ [xi : i ∈ C] .\nπ∈NC ′ (n)\n\nC∈Inner (π)\n\ncan be expressed in terms of η φ [*] and Rψ [*] of order n and lower. On the other hand, from equation (22) we get\nη φ(t) [xj , xi , xu(1) , . . . , xu(n) ] = b(t)η φ(t) [xk , xu(1) , . . . , xu(n) ]\nn\nX\nc(t)η φ(t) [xi , xu(1) , . . . , xu(s) ]η φ(t) [xj , xu(s+1) , . . . , xu(n) ].\n+\ns=0\n\nThese equations for n = 1, 2 determine b(t) and c(t) uniquely in terms of η φ [*] and Rψ [*]; in fact,\n\u0001\n1\nb(t) = b(1) + (t − 1)Rψ [x] ,\nc(t) =\nc(1) + (t − 1)Rψ [x, x] .\nt\n\n\fFREE EVOLUTION ON ALGEBRAS WITH TWO STATES\n\n19\n\nTherefore these equations for larger n determine all the ψ-cumulants in terms of η φ [*] and the ψcumulants of order 1 and 2. If the mean of ψ is α and variance 1 + s, then ψ = ρ⊞(1+s) ⊞ δα has the\ncorrect first two cumulants, and therefore is the correct state. Finally,\n\u0002\n\u0003\nφ = Φ ρ, ρ⊞(1+s) ⊞ α = Bα,s [ρ]\nand so ρ = B−α,−s [φ]; since ρ is a state, this expression is well defined. Since φ is free Meixner, it\nfollows that ρ is a free Meixner distribution.\n\u0003\n\nRemark 10. In addition to monotone convolution, another operation related to Φ is the orthogonal\nconvolution ⊢ of Lenczewski. In fact, in the single variable case,\nΦ [B[τ ], ψ] = τ ⊢ ψ.\nSome results in this paper can be reformulated as multivariate versions of the results in [Len07].\nFor example, our equation (15) in Lemma 9 can be extended to\nΦ [τ ⊲ ψ] = Φ [B[Φ [τ ]], ψ] = Φ [τ ] ⊢ ψ,\nclosely related to Corollary 6.4 of [Len07]. In Theorem 10, the positivity of Φ in part (b) corresponds to the positivity of the orthogonal convolution; this also explains why the first argument of\nΦ is naturally taken to be freely infinitely divisible. Parts (d) and (e) of that theorem imply that\nμb,−1 ⊢ ψ = Bb,0 [Φ [ψ]]\nand\nτ ⊢ δa = Ba,0 [τ ],\nwhich are Examples 6.2 and 6.1 of [Len07], respectively. Similarly, Theorem 11 can be re-formulated\nin terms of the orthogonal convolution. In fact, some results in [Len07] are obtained by complexanalytic methods which apply to measures with possibly infinite moments, and can be used to obtain\nextensions of our results in the single-variable context.\n4.3. Operator models.\nLemma 13. For a Hilbert space H, by its Boolean Fock spaceL\nwe mean the Hilbert space CΩ ⊕ H\n⊗n\nand by its full Fock space the Hilbert space F (H) = CΩ ⊕ ∞\n. For ζ ∈ H, its Boolean\nn=1 H\ncreation and annihilation operators on the Boolean Fock space are\nab,+\nζ (ε) = hΩ, εi ζ,\nab,−\nζ (ε) = hζ, εi Ω,\nand its free creation and annihilation operators on the full Fock space are\naf,+\nζ (ε1 ⊗ . . . ⊗ εn ) = ζ ⊗ ε1 ⊗ . . . ⊗ εn ,\naf,−\nζ (ε1 ⊗ . . . ⊗ εn ) = hζ, ε1 i ε2 ⊗ . . . ⊗ εn .\nFor H ∈ L(H), it acts on the Boolean Fock space by HΩ = 0, and its gauge operator on the full\nFock space is\np(H)(ε1 ⊗ . . . ⊗ εn ) = (Hε1 ) ⊗ ε2 ⊗ . . . ⊗ εn .\nFinally, denote by PΩ the projection on Ω.\n\n\f20\n\nM. ANSHELEVICH\n\n(a) A state ψ corresponds to a collection of data\n(K, ξ ∈ K, Ki ∈ L(K)),\nwhere K is a Hilbert space, ξ ∈ K a unit vector, and {K1 , K2 , . . . , Kd } ∈ L(K) a d-tuple of\nsymmetric operators with a common invariant dense domain containing ξ, via\nψ[x~u ] = hξ, K~u ξi .\nConversely, any such collection always gives a state. (We will omit the last comment and the\nconditions on the operators in subsequent constructions.)\n(b) A state φ also corresponds to a collection of data\n(K, εi ∈ K, Si ∈ L(K), αi ∈ R)\nas follows: on the Boolean Fock space CΩ ⊕ K,\nD \u0010\n\u0011 E\nb,+\nb,−\nφ[x~u ] = Ω, aεi + aεi + Si + αi PΩ Ω .\nu\n~\n\nHere hεi , S~u εj i are the Boolean cumulants of φ.\n(c) A conditionally positive definite functional μ corresponds to a collection of data\n(H, ζi ∈ H, Hi ∈ L(H), λi ∈ R)\nvia\nμ [xi x~u xj ] = hζi , H~u ζj i ,\nμ[xi ] = λi .\n(d) A freely infinitely divisible state ρ corresponds to a collection of data\n(H, ζi ∈ H, Hi ∈ L(H), λi ∈ R)\nas follows: on the full Fock space F (H),\nD \u0010\n\u0011 E\nf,−\nρ[x~u ] = Ω, af,+\n+\na\n+\np(H\n)\n+\nλ\nI\nΩ .\ni\ni\nζi\nζi\nu\n~\n\nHere hζi , H~u ζj i are the free cumulants of ρ.\n\nProof. Part (a) is standard; briefly, take K to be the completion of the quotient of Chxi with respect\nto the ψ-norm, ξ to be the vector image of 1, and Ki to be the operator image of xi . Part (b) is\nProposition 15 of [Ans07b]. Part (c) is also standard, see Proposition 3.2 of [Sch91]; briefly, take\nH to be the completion of the quotient of\n{P ∈ Chxi|P (0) = 0}\nwith respect to the μ-norm, ζi to be the vector image of xi , and Ki to be the operator image of xi .\nFinally, since a state ρ is freely infinitely divisible if and only if Rρ is conditionally positive definite,\npart (d) follows from part (c).\n\u0003\nProof of Theorem 6. For ψ, μ represented as in Lemma 13, on the Hilbert space\nK ⊗ H,\nconsider the operators\nKi ⊗ I + P ξ ⊗ H i ,\nwhere Pξ is the projection onto ξ in K. We will show that\n# *\n\" n\n+\nn \u0010\n\u0011\nY\nY\n(23)\nη xi\nxu(s) xj = ξ ⊗ ζi ,\nKu(s) ⊗ I + Pξ ⊗ Hu(s) (ξ ⊗ ζj ) .\ns=1\n\ns=1\n\n\fFREE EVOLUTION ON ALGEBRAS WITH TWO STATES\n\n21\n\nThe operators Ki ⊗I +Pξ ⊗Hi are symmetric, therefore it will follow that η is conditionally positive\ndefinite.\nTo prove (23), we note that\n*\n+\nk \u0010\n\u0011\nY\nξ ⊗ ζi ,\nKu(s) ⊗ I + Pξ ⊗ Hu(s) (ξ ⊗ ζj )\ns=1\n\nX\n\n=\n\nξ, Ku(1) . . . Ku(v(1)−1) Pξ Ku(v(1)+1) . . . Ku(v(2)−1) Pξ . . . Ku(n) ξ\n\nΛ⊂{1,2,...,n}\nΛ={v(1),v(2),...,v(l)}\n\nX\n\n=\n\nΛ⊂{1,2,...,n}\nΛ={v(1),v(2),...,v(l)}\n\nX\n\n=\n\nζi , I . . . IHu(v(1)) I . . . IHu(v(2)) I . . . IHu(v(l)) I . . . Iζj\n+ l * v(r+1)−1\n+\nl\nY\nY\nY\nζi ,\nHu(v(s)) ζj\nξ,\nKu(s) ξ\n\n*\n\n\"\n\ns=1\n\nμ xi\n\nΛ⊂{1,2,...,n}\nΛ={v(1),v(2),...,v(l)}\n\nl\nY\n\nr=0\n\nxu(v(s)) xj\n\ns=1\n\n#\n\nl\nY\nr=0\n\ns=v(r)+1\n\n\n\nψ\n\n\n\nv(r+1)−1\n\nY\n\ns=v(r)+1\n\nxu(s)  .\n\nIt remains to note that\n1+\n\n∞ X\nX\n\nn=1 |~\nu|=n\n\n= 1+\n\nX\n\nΛ⊂{1,2,...,n}\nΛ={1,v(1),v(2),...,v(l),n}\n\n∞ X\nX\n\nn=1 |~\nu|=n\n\n\"\n\nμ xu(1)\n\nl\nY\ns=1\n\nxu(v(s)) xu(n)\n\n#\n\nl\nY\nr=0\n\n\n\nψ\n\nv(r+1)−1\n\nY\n\ns=v(r)+1\n\n\n\nxu(s)  w~u\n\n\u0002\n\u0003\nμ xu(1) xu(2) . . . xu(n) wu(1) (1 + M ψ (w))wu(2) (1 + M ψ (w))wu(3)\n. . . (1 + M ψ (w))wu(n)\n\n= 1 + (1 + M ψ (w))−1M μ ((1 + M ψ (w))w) = 1 + M η (w).\n\n\u0003\n\nRemark 11 (Relation to monotone probability). Lenczewski used a similar construction in Boolean probability, and Franz and Muraki [FM05] in monotone probability: if ψ is a joint distribution\nof the operators {Ki } with respect to the vector state of ξ, and φ is the joint distribution of the\noperators {Hi } with respect to the vector state of ζ, then the joint distribution of the operators\n{Ki ⊗ I + Pξ ⊗ Hi } with respect to the vector state of ξ ⊗ ζ is the monotone convolution φ ⊲ ψ.\nThis provides an operator representation proof of Lemma 9.\nLemma 14. We use the notation of Lemma 13.\n(a) For a freely infinitely divisible state ρ and a state ψ, the state Φ [ρ, ψ] is represented on the\nBoolean Fock space\nCΩ ⊕ (K ⊗ H)\nas\n\u0011 E\nD \u0010\nb,−\nΦ [ρ, ψ] [x~u ] = Ω, ab,+\n+\na\n+\nK\n⊗\nI\n+\nP\n⊗\nH\n+\nλ\nP\nΩ .\ni\nξ\ni\ni\nΩ\nξ⊗ζi\nξ⊗ζi\nu\n~\n\n\f22\n\nM. ANSHELEVICH\n\n(b) For a state φ, the freely infinitely divisible state B[φ] is represented on the full Fock space\nF (K) as\nD \u0010\n\u0011 E\nf,−\nB[φ][x~u ] = Ω, af,+\n+\na\n+\np(S\n)\n+\nα\nI\nΩ .\ni\ni\nεi\nεi\n~\nu\n\n(c) For ρ, ψ as above, the state ψ ⊞ ρ is represented on the space\n∞\n\u0010M\n\u0011\nF (K ⊗ H) ⊗ K ≃ K ⊕\n(K ⊗ H)⊗n ⊗ K\nn=1\n\nas\n\nD \u0010\n\u0011 E\nf,−\n(ψ ⊞ ρ)[x~u ] = ξ, af,+\n⊗\nI\n+\na\n⊗\nI\n+\np(K\n⊗\nI)\n⊗\nI\n+\np(P\n⊗\nH\n)\n⊗\nI\n+\nλ\nI\nξ .\ni\nξ\ni\ni\nξ⊗ζi\nξ⊗ζi\n~\nu\n\nProof. Part (a) follows by combining Theorem 6 with part (b) of Lemma 13. Part (b) follows from\nthe definition that\nRB[φ] (z) = η φ (z)\nand parts (b), (d) of Lemma 13. Part (c) follows from the fact that\nX\n\n(ψ ⊞ ρ)[x1 , x2 , . . . , xn ] =\n\nk\nY\n\nRρ [xj : j ∈ Bi ]\n\nB1 ,B2 ,...,Bk ⊂{1,...,n} i=1\nBi ∩Bj =∅ for i6=j\n\nY\n\nψ[xj : j ∈ C],\n\nC∈(B1 ,B2 ,...,Bk\n\n)c\n\nwhere\n(B1 , B2 , . . . , Bk )c = (C1 , C2 , . . . , Cl )\nis the smallest collection of disjoint subsets of {1, . . . , n} such that\n(B1 , . . . , Bk , C1 , . . . , Cl ) ∈ NC (n).\n\n\u0003\n\nRemark 12 (Operator representation proof of Theorem 11). Combining parts (a), (b) of the preceding Lemma, the freely infinitely divisible state B[Φ [ρ, ψ]] is represented on the full Fock space\n∞\nM\nF (K ⊗ H) = CΩ ⊕\n(K ⊗ H)⊗n\nn=1\n\nas\n\nD\n\n\u0010\n\u0011 E\nf,+\nf,−\nB[Φ [ρ, ψ]][x~u ] = Ω, aξ⊗ζi + aξ⊗ζi + p(Ki ⊗ I + Pξ ⊗ Hi ) + λi I Ω .\nu\n~\n\nOn the other hand, combining parts (a), (c), the state Φ [ρ, ψ ⊞ ρ] is represented on the space\nCΩ ⊕ F (K ⊗ H) ⊗ K ⊗ H ≃ F (K ⊗ H)\nas\nD \u0010\nb,−\nΦ [ρ, ψ ⊞ ρ] [x~u ] = Ω, ab,+\nξ⊗ζi + aξ⊗ζi\n\n\u0001\nf,−\n+ af,+\n⊗\nI\n+\na\n⊗\nI\n+\np(K\n⊗\nI)\n⊗\nI\n+\np(P\n⊗\nH\n)\n⊗\nI\n+\nλ\nI\n⊗I\ni\nξ\ni\ni\nξ⊗ζi\nξ⊗ζi\n\u0011 E\n+ I ⊗ Pξ ⊗ H i + λi PΩ Ω\nu\n~\nD \u0010\n\u0011 E\nf,+\nf,−\n= Ω, aξ⊗ζi + aξ⊗ζi + p(Ki ⊗ I) + p(Pξ ⊗ Hi ) + λi I Ω .\nu\n~\n\nThus B[Φ [ρ, ψ]] = Φ [ρ, ψ ⊞ ρ]. The more general equation involving Bt follows from this by using\nBt [φ] = B[φ⊎t ]⊎(1/t) ,\n\n\fFREE EVOLUTION ON ALGEBRAS WITH TWO STATES\n\n23\n\nwhich in turn can be deduced from the semigroup property of {Bt }.\nThere are proofs by similar methods of other results in the paper, such as the remaining parts of\nTheorem 11 and Lemma 5; they are left to an interested reader.\nR EFERENCES\n[Ans07a] Michael Anshelevich, Free Meixner states, Comm. Math. Phys. 276 (2007), no. 3, 863–899. MR2350440\n, Appell polynomials and their relatives II. Boolean theory, arXiv:0712.4185 [math.OA],\n[Ans07b]\n2007.\n[Ans08a]\n, Orthogonal polynomials with a resolvent-type generating function, arXiv:math/0410482\n[math.CO], To be published by the Transactions of the AMS, 2008.\n[Ans08b]\n, Appell polynomials and their relatives III. Conditionally free theory., arXiv:0803.4279\n[math.OA], 2008.\n[BN07a] Serban T. Belinschi and Alexandru Nica, On a remarkable semigroup of homomorphisms with respect to\nfree multiplicative convolution, arXiv:math/0703295 [math.OA], 2007.\n, Free Brownian motion and evolution towards ⊞-infinite divisibility for k-tuples,\n[BN07b]\narXiv:0711.3787 [math.OA], 2007.\n, η-series and a Boolean Bercovici-Pata bijection for bounded k-tuples, Adv. Math. 217 (2008),\n[BN08]\nno. 1, 1–41. MR2357321\n[BB06] Marek Bożejko and Włodzimierz Bryc, On a class of free Lévy laws related to a regression problem, J.\nFunct. Anal. 236 (2006), no. 1, 59–77. MR2227129 (2007a:46071)\n[BB08]\n, A quadratic regression problem for two-state algebras with application to the central limit theorem,\narXiv:0802.0266 [math.OA], 2008.\n[BLS96] Marek Bożejko, Michael Leinert, and Roland Speicher, Convolution and limit theorems for conditionally\nfree random variables, Pacific J. Math. 175 (1996), no. 2, 357–388. MR1432836 (98j:46069)\n[BW01] Marek Bożejko and Janusz Wysoczański, Remarks on t-transformations of measures and convolutions, Ann.\nInst. H. Poincaré Probab. Statist. 37 (2001), no. 6, 737–761. MR1863276 (2002i:60005)\n[Dur91] Richard Durrett, Probability, The Wadsworth & Brooks/Cole Statistics/Probability Series, Wadsworth &\nBrooks/Cole Advanced Books & Software, Pacific Grove, CA, 1991.\n[Fra03] Uwe Franz, Unification of Boolean, monotone, anti-monotone, and tensor independence and Lévy processes,\nMath. Z. 243 (2003), no. 4, 779–816. MR1974583 (2004f:46077)\n, Multiplicative monotone convolutions, arXiv:math/0503602 [math.PR], 2005.\n[Fra05]\n[FM05] Uwe Franz and Naofumi Muraki, Markov property of monotone Lévy processes, Infinite dimensional harmonic analysis III, World Sci. Publ., Hackensack, NJ, 2005, pp. 37–57. MR2230621 (2007e:60033)\n[Kry07] Anna Dorota Krystek, Infinite divisibility for the conditionally free convolution, Infin. Dimens. Anal. Quantum Probab. Relat. Top. 10 (2007), no. 4, 499–522.\n[KW05] Anna Dorota Krystek and Łukasz Jan Wojakowski, Associative convolutions arising from conditionally free\nconvolution, Infin. Dimens. Anal. Quantum Probab. Relat. Top. 8 (2005), no. 3, 515–545. MR2172313\n(2006g:46103)\n[KY04] Anna Krystek and Hiroaki Yoshida, Generalized t-transformations of probability measures and deformed\nconvolutions, Probab. Math. Statist. 24 (2004), no. 1, Acta Univ. Wratislav. No. 2646, 97–119. MR2108159\n(2006i:46093)\n[LL60] R. G. Laha and E. Lukacs, On a problem connected with quadratic regression, Biometrika 47 (1960), 335–\n343. MR0121922 (22 #12649)\n[Len07] Romuald Lenczewski, Decompositions of the free additive convolution, J. Funct. Anal. 246 (2007), no. 2,\n330–365. MR2321046\n[NS06] Alexandru Nica and Roland Speicher, Lectures on the combinatorics of free probability, London Mathematical Society Lecture Note Series, vol. 335, Cambridge University Press, Cambridge, 2006. MR2266879\n[Ora02] Ferenc Oravecz, Fermi convolution, Infin. Dimens. Anal. Quantum Probab. Relat. Top. 5 (2002), no. 2,\n235–242. MR1914835 (2003e:46112)\n[Sch91] Michael Schürmann, Quantum stochastic processes with independent additive increments, J. Multivariate\nAnal. 38 (1991), no. 1, 15–35. MR1914835 (2003e:46112)\n\n\f24\n\nM. ANSHELEVICH\n\n[VDN92] D. V. Voiculescu, K. J. Dykema, and A. Nica, Free random variables, CRM Monograph Series, vol. 1,\nAmerican Mathematical Society, Providence, RI, 1992. MR1217253 (94c:46133)\nD EPARTMENT OF M ATHEMATICS , T EXAS A&M U NIVERSITY, C OLLEGE S TATION , TX 77843-3368\nE-mail address: manshel@math.tamu.edu\n\n\f"}