{"id": "http://arxiv.org/abs/0907.0506v1", "guidislink": true, "updated": "2009-07-03T00:33:35Z", "updated_parsed": [2009, 7, 3, 0, 33, 35, 4, 184, 0], "published": "2009-07-03T00:33:35Z", "published_parsed": [2009, 7, 3, 0, 33, 35, 4, 184, 0], "title": "Observation of quantum diffractive collisions using shallow atomic traps", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.5560%2C0907.2240%2C0907.1405%2C0907.0506%2C0907.3451%2C0907.5586%2C0907.1856%2C0907.0069%2C0907.0702%2C0907.4722%2C0907.4580%2C0907.0252%2C0907.4958%2C0907.1262%2C0907.2555%2C0907.1119%2C0907.1937%2C0907.1282%2C0907.3900%2C0907.1089%2C0907.4507%2C0907.3712%2C0907.0330%2C0907.2469%2C0907.4956%2C0907.2003%2C0907.4122%2C0907.0369%2C0907.0546%2C0907.2282%2C0907.3794%2C0907.4693%2C0907.5002%2C0907.0471%2C0907.5141%2C0907.3342%2C0907.3039%2C0907.5042%2C0907.4867%2C0907.3708%2C0907.1998%2C0907.4840%2C0907.2443%2C0907.4490%2C0907.3403%2C0907.0960%2C0907.2006%2C0907.0198%2C0907.2034%2C0907.5112%2C0907.3863%2C0907.3905%2C0907.2309%2C0907.0235%2C0907.4756%2C0907.0342%2C0907.2300%2C0907.4244%2C0907.0455%2C0907.3358%2C0907.3203%2C0907.5217%2C0907.0580%2C0907.2373%2C0907.0266%2C0907.0967%2C0907.0094%2C0907.4900%2C0907.0066%2C0907.2095%2C0907.3244%2C0907.5161%2C0907.3100%2C0907.1040%2C0907.0050%2C0907.0584%2C0907.5547%2C0907.4200%2C0907.1779%2C0907.2380%2C0907.2439%2C0907.5504%2C0907.4272%2C0907.1334%2C0907.3029%2C0907.0902%2C0907.2591%2C0907.1552%2C0907.4519%2C0907.1348%2C0907.5153%2C0907.1528%2C0907.4615%2C0907.0715%2C0907.2414%2C0907.3352%2C0907.2050%2C0907.2956%2C0907.4108%2C0907.5302%2C0907.1267&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Observation of quantum diffractive collisions using shallow atomic traps"}, "summary": "We present measurements and calculations of the trap loss rate for laser\ncooled Rb atoms confined in either a magneto-optic or a magnetic quadrupole\ntrap when exposed to a room temperature background gas of Ar. We study the loss\nrate as a function of trap depth and find that copious glancing elastic\ncollisions, which occur in the so-called quantum-diffractive regime and impart\nvery little energy to the trapped atoms, result in significant differences in\nthe loss rate for the MOT compared to a pure magnetic trap due solely to the\ndifference in potential depth. This finding highlights the importance of\nknowing the trap depth when attempting to infer the total collision cross\nsection from measurements of trap loss rates. Moreover, this variation of trap\nloss rate with trap depth can be used to extract information about the\ndifferential cross section.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.5560%2C0907.2240%2C0907.1405%2C0907.0506%2C0907.3451%2C0907.5586%2C0907.1856%2C0907.0069%2C0907.0702%2C0907.4722%2C0907.4580%2C0907.0252%2C0907.4958%2C0907.1262%2C0907.2555%2C0907.1119%2C0907.1937%2C0907.1282%2C0907.3900%2C0907.1089%2C0907.4507%2C0907.3712%2C0907.0330%2C0907.2469%2C0907.4956%2C0907.2003%2C0907.4122%2C0907.0369%2C0907.0546%2C0907.2282%2C0907.3794%2C0907.4693%2C0907.5002%2C0907.0471%2C0907.5141%2C0907.3342%2C0907.3039%2C0907.5042%2C0907.4867%2C0907.3708%2C0907.1998%2C0907.4840%2C0907.2443%2C0907.4490%2C0907.3403%2C0907.0960%2C0907.2006%2C0907.0198%2C0907.2034%2C0907.5112%2C0907.3863%2C0907.3905%2C0907.2309%2C0907.0235%2C0907.4756%2C0907.0342%2C0907.2300%2C0907.4244%2C0907.0455%2C0907.3358%2C0907.3203%2C0907.5217%2C0907.0580%2C0907.2373%2C0907.0266%2C0907.0967%2C0907.0094%2C0907.4900%2C0907.0066%2C0907.2095%2C0907.3244%2C0907.5161%2C0907.3100%2C0907.1040%2C0907.0050%2C0907.0584%2C0907.5547%2C0907.4200%2C0907.1779%2C0907.2380%2C0907.2439%2C0907.5504%2C0907.4272%2C0907.1334%2C0907.3029%2C0907.0902%2C0907.2591%2C0907.1552%2C0907.4519%2C0907.1348%2C0907.5153%2C0907.1528%2C0907.4615%2C0907.0715%2C0907.2414%2C0907.3352%2C0907.2050%2C0907.2956%2C0907.4108%2C0907.5302%2C0907.1267&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present measurements and calculations of the trap loss rate for laser\ncooled Rb atoms confined in either a magneto-optic or a magnetic quadrupole\ntrap when exposed to a room temperature background gas of Ar. We study the loss\nrate as a function of trap depth and find that copious glancing elastic\ncollisions, which occur in the so-called quantum-diffractive regime and impart\nvery little energy to the trapped atoms, result in significant differences in\nthe loss rate for the MOT compared to a pure magnetic trap due solely to the\ndifference in potential depth. This finding highlights the importance of\nknowing the trap depth when attempting to infer the total collision cross\nsection from measurements of trap loss rates. Moreover, this variation of trap\nloss rate with trap depth can be used to extract information about the\ndifferential cross section."}, "authors": ["David E. Fagnan", "Jicheng Wang", "Chenchong Zhu", "Pavle Djuricanin", "Bruce G. Klappauf", "James L. Booth", "Kirk W. Madison"], "author_detail": {"name": "Kirk W. Madison"}, "author": "Kirk W. Madison", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevA.80.022712", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0907.0506v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0907.0506v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "9 pages, 9 figures", "arxiv_primary_category": {"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0907.0506v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0907.0506v1", "journal_reference": "Phys.Rev.A. 80, 022712 (2009)", "doi": "10.1103/PhysRevA.80.022712", "fulltext": "APS/??\n\nObservation of quantum diffractive collisions using shallow atomic traps\nDavid E. Fagnan1 , Jicheng Wang1 , Chenchong Zhu1 , Pavle Djuricanin1 ,\nBruce G. Klappauf 1 , James L. Booth2 , and Kirk W. Madison1,∗\n\narXiv:0907.0506v1 [physics.atom-ph] 3 Jul 2009\n\n1\n\nDepartment of Physics & Astronomy, University of British Columbia,\n6224 Agricultural Road, Vancouver, BC, V6T 1Z1, Canada\n2\nPhysics Department, British Columbia Institute of Technology,\n3700 Willingdon Avenue, Burnaby, B.C. V5G 3H2 and\n∗\nCorresponding author: madison@phas.ubc.ca\n(Dated: October 30, 2018)\n\nWe present measurements and calculations of the trap loss rate for laser cooled 87 Rb atoms confined in either a magneto-optic or a magnetic quadrupole trap when exposed to a room temperature\nbackground gas of Ar. We study the loss rate as a function of trap depth and find that copious\nglancing elastic collisions, which occur in the so-called quantum-diffractive regime and impart very\nlittle energy to the trapped atoms, result in significant differences in the loss rate for the MOT\ncompared to a pure magnetic trap due solely to the difference in potential depth. This finding\nhighlights the importance of knowing the trap depth when attempting to infer the total collision\ncross section from measurements of trap loss rates. Moreover, this variation of trap loss rate with\ntrap depth can be used to extract information about the differential cross section.\nPACS numbers: 34.50.-s, 34.50.Cx, 34.80.Bm, 34.00.00, 30.00.00, 67.85.-d, 37.10.Gh\n\nI.\n\nINTRODUCTION\n\nIt is well known that the lifetime of a trapped ensemble\nof ultracold gas is limited by collisions with atoms and\nmolecules present in the residual background vapor of an\nultra-high vacuum system. The particle loss rates and\ncorresponding collision cross sections of laser cooled alkali metals with various species present in a background\nvapor have been studied since the first demonstrations\nof magneto-optic traps (MOTs) [1, 2, 3]. Small angle\nelastic collisions, which impart a very small amount of\nkinetic energy, can result in ensemble heating without\nimmediate particle loss. This effect has been observed\nexperimentally [4] and analyzed theoretically both in the\nclassical and the purely diffractive limits [5, 6, 7, 8]. Elastic as well as inelastic collisions with a background vapor\npresent an array of decoherence channels which can act\non both the internal and external degrees of freedom of\na trapped particle. Understanding the exact character\nof these collisions is of fundamental importance for the\nproduction of ensembles of cold atoms or molecules and\ntheir use, for example, in quantum information storage\nand processing applications.\nWhile generally considered a nuisance, particle loss\nfrom a MOT induced by collisions with a background gas\nwas recently proposed as a reliable observable to determine the total collision cross section. Matherson et. al reported measurements of the absolute total collision cross\nsection between various room temperature gases (both\natomic and molecular) and laser-cooled metastable neon\natoms by detecting their loss rate from a MOT [9, 10].\nIt was argued that trap loss measurements of this sort\ncan be done with a very high precision and that they\nare superior to measurements of the cross sections using\ncrossed atomic beam experiments where the determination of the absolute collision cross section is complicated\n\nby uncertainties in the absolute number of target atoms\nand the overlap of the beams [10]. This MOT trap loss\ntechnique is similar in spirit to previous work where the\nmeasurement of absolute photoionization cross sections\nof atoms [11, 12] and of absolute electron-impact ionization [13, 14] were made using laser cooled atoms as\na target. In the work of Matherson et. al, it is claimed\nthat their MOT loss measurements were not significantly\naffected by the retention of collisional products and that\nthe cross section for trap loss was therefore equivalent to\nthe total collision cross section [10]. By contrast, Steane\net. al argued that the collision limited trap lifetime of\na Cs MOT was significantly influenced by the recapture\nof collisional products [3]. Similarly, Gensemer et. al reported dramatic variations in background collision loss\nrates from a Rb MOT as the trap parameters and depth\nwere varied [15]. In the work of Schappe et. al a Rb MOT\nwas intentionally operated such that the ions produced\nby electron collisions would escape from the trap while\natoms that were simply excited or elastically scattered\nwere retained [14].\nIn this work we investigate the use of trapped, lasercooled rubidium atoms to measure the cross section for\n87\nRb–40 Ar collisions. Motivated by the known role of\nsmall angle scattering in ensemble heating due to collisions that do not directly result in particle loss, we\nstudied the trap loss rate produced by room-temperature\nbackground collisions as a function of trap depth at\n1 K and below 10 mK using a magneto-optic and a\nquadrupole magnetic trap. We find that for room temperature Ar, the retention of Rb atoms due to a finite\ntrap depth (on the order of or larger than the energy\ntransfer associated with quantum diffractive collisions)\nsignificantly suppresses the trap loss rate in comparison\nwith the total collision rate. Using model interaction potentials for the Rb–Ar complex, we confirm that the ex-\n\n\f2\nperimentally measured loss rates at various trap depths\nare consistent with the known long-range attractive part\nof the potential characterized by the C6 coefficient. These\nexperimental and theoretical results are summarized in\nFig. 9, and it constitutes the central result of this paper.\nThe strong variation of the trap loss rate as a function of\nthe trap depth even at depths far below 1 K illustrates\nthe very low energy-scale and abundance of quantumdiffractive collisions, which account for approximately\nhalf (exactly half for a hard core potential) of the total\ncross section [6]. The conclusion is that by using a very\nshallow magnetic or optical dipole trap, whose depth can\nbe easily characterized and made to approach zero, the\ntotal loss rate can be made to approach the total collision\nrate. In the context of molecular beam measurements of\nthe total collision cross section, a zero trap-depth measurement is equivalent to realizing an ideal apparatus of\nunlimited angular resolution [16].\n\nII.\n\nTHEORY\n\nWhen a room-temperature background vapor particle\nencounters a trapped atom, the collision energy is typically very high. Nevertheless, for glancing (very high impact parameter) elastic collisions, the momentum transferred and resulting scattering angle can be extremely\nsmall. Consequently, for a trap with finite depth, collisions below a certain scattering angle do not result in\ntrap loss. The classical small-angle approximation predicts the cross section for loss inducing collisions increases\nwithout bound as the trap depth is reduced to zero. This\nis because the inter-atomic potential is infinite in range\nand collisions at all ranges of impact parameter impart\nsome, albeit small, momentum to the target atom thus\nproducing trap loss. However, the total cross section for\nloss inducing collisions can never exceed the total collision cross section which is finite and, through the optical theorem, related to the imaginary part of the quantum mechanical scattering amplitude [17]. In the limit\nof vanishingly small scattering angles, the associated de\nBroglie wavelength of the momentum transfer in the collision exceeds the classically determined impact parameter and a classical small-angle approximation is no longer\nvalid [18, 19]. In this limit, the collisions are said to\nbe quantum-diffractive and a full quantum-mechanical\ntreatment of the scattering cross section is needed [20].\nConsider a trapped atom of velocity ~va and mass Ma\nand a background particle of velocity ~vb and mass Mb .\nThe initial relative velocity is ~vr = ~va − ~vb , and momentum conservation requires that the change in these\nvelocities is related by −Ma ∆~va = Mb ∆~vb and ∆~va =\nμ\nMb\nvr , where the reduced mass is μ = MMaa+M\n. In adMa ∆~\nb\ndition, energy conservation requires that for elastic collisions |∆~vr |2 = 2|~vr |2 (1 − cos θ), where θ is the collision angle between the initial (~vr ) and final (~vr 0 ) relative velocities. After the collision, the trapped atom\nkinetic energy will have changed by an amount ∆E =\n\nMa\n2\n\n\u0003\n\u0002\n\u0002\n\u0003\n(~va + ∆~va )2 − ~va2 = M2a 2~va * ∆~va + |∆~va |2 . If this\nchange in kinetic energy exceeds the trap depth U0 , loss\nwill occur. In the limit that the trapped particle has a\nnegligible initial kinetic energy (~va \u001c ∆~va ), we have that\n∆E ' M2a |∆~va |2 and\n∆E '\n\nμ2\n|~vr |2 (1 − cos θ).\nMa\n\n(1)\n\nTherefore, if the collision angle exceeds the minimum angle\n\u0013\n\u0012\nMa U 0\n(2)\nθmin = arccos 1 − 2 2 ,\nμ |~vr |\nthen trap loss will occur. The rate at which background\nparticles are scattered from a single trapped atom into a\nsolid angle dΩ is nb |~vr |(dσ/dΩ)dΩ, where nb is the density of background particles and (dσ/dΩ) is the differential scattering cross section. Given this, we can estimate\nthe loss rate from a trap of depth U0 as\nZ π\nγloss = nb vprob σloss = nb vprob\n(dσ/dΩ)dΩ.\nθmin (vprob )\n\n(3)\nwhere the relative collision velocity is assumed to be determined by the most probable velocity for the background particles, |~vr | = vprob . This loss rate is always smaller than the estimated total collision rate,\nγC = nb vprob σ, since θmin > 0. The differential cross\nsection is related to the quantum mechanical scattering\namplitude, dσ/dΩ = |f (k, θ)|2 , and depends explicitly on\nthe collision wave vector, k = μ|~vr |/~. It is assumed that\nthe interaction potential is central and therefore there is\nno azimuthal angular dependence. For a beam of incident scattering particles with wave vector k, the cross\nsection for loss inducing collisions from a trap of depth\nU0 is\nZ π\nσloss (k) =\n2π sin θ|f (k, θ)|2 dθ.\n(4)\nθmin (~k/μ)\n\nThis expression is equivalent to the total cross section\nmeasured by a molecular beam apparatus with finite angular resolution limited to θmin [16].\nTo compute the loss rate induced by collisions with a\nbackground gas at temperature T , we need to average\nover the Maxwell-Boltzman distribution of incident collision wave vectors. Assuming the trapped atom velocity\nis negligible, we have that ~vr ' ~vb and we can compute\nthe velocity averaged loss rate using k = μ|~vb |/~ and find\nhγloss i = nb hvσi where\n\u0012\nhvσi =\n\nMb\n2πkB T\n\n\u00133/2 Z\n\n∞\n\n2\n\n4π σloss (k) vb3 e−Mb vb /2kB T dvb .\n\n0\n\n(5)\nIn order to evaluate this expression, we need to determine the scattering amplitude, f (k, θ), given the interatomic potential between atom a and b. The asymptotic\n\n\f3\nform of the 2-body scattering wave function is the sum\nof an incident plane\nwave and a scattered\nspherical wave\n\u0011\n\u0010\nikr\nψ(r)|r→∞ = A eikz + f (k, θ) e r . Given a central potential, ψ and f can be expanded in terms of the Legendre\npolynomials,\nψk (r, θ) =\nf (k, θ) =\n\n∞\nX\nl=0\n∞\nX\n\nRl (k, r)Pl (cos θ),\n\n(6)\n\nfl (k)Pl (cos θ).\n\n(7)\n\nl=0\n\nThis is an expansion into partial waves of angular momenta l. For sufficiently large r, the potential is negligible, and the radial functions asymptotically approach\nthe form for a free particle\nRl (k, r)|r→∞ = Bl jl (kr) + Cl nl (kr),\n\n(8)\n\nwhere jl and nl are the spherical Bessel and Neumann\nfunctions. The coefficients Bl and Cl can be written as\nBl = Al cos δl and Cl = −Al sin δl , where Al = (2l +\n1)il eiδl and where δl = arctan(−Cl /Bl ) is the phase shift\nof the lth partial wave [21, 22]. These phase shifts also\ndetermine the scattering amplitude\nf (k, θ) =\n\n∞\n1X\n(2l + 1)eiδl sin δl Pl (cos θ),\nk\n\n(9)\n\nl=0\n\nThe determination of the scattering amplitude and resultant collision cross section therefore requires finding\nthe partial wave phase shifts, and they are found by numerical integration of the radial Schrödinger equation.\nWe write the radial equation for the lth partial wave as\n\u0014 2\n\u0015\nd\n+\nW\n(r)\nψl (r) = 0\n(10)\nl\ndr2\n\nFIG. 1: (Color online) Schematic of the vacuum system. The\nvariable leak valve allows Ar gas to be introduced and the\nresidual gas analyzer (RGA) is used to measure the pressure\nand composition of the background vapor. The laser cooled\nand trapped 87 Rb atoms undergo collisions with the background gas which may or may not result in trap loss.\n\nand inserted into Eq. 4 to compute the total cross section for loss inducing collisions at that collision velocity.\nRepeating this procedure for a set of wave vectors chosen\nfrom a Maxwell-Boltzman distribution, the velocity averaged rate of loss inducing collisions from a background\ngas at temperature T (Eq. 5) is evaluated. In each numerical simulation, the convergence of these results is checked\nboth as a function of the integration range and step size\nand as a function of the number of partial waves included.\nIt is found empirically that the results (for room temperature collisions) have converged to an accuracy of better\nthan 1% when partial waves up to l = 500 are included\n(higher velocities require more partial waves) and given\nthe integration is performed with a step size of 0.005 aB\n(aB = 0.529177 Å) from 1 aB , deep inside the classically\nforbidden region, to 150 aB , well in the the asymptotic\nregime.\n\nwhere\n2μ\nl(l + 1)\nV (r) −\n,\n~2\nr2\nψl (r) = krRl (r),\n\nWl (r) = k 2 −\n\n(11)\n\nIII.\n\nEXPERIMENTAL SETUP\n\n(12)\n\nand V (r) is the inter-atomic potential. The solution to\nthe radial equation for each partial wave l is then independently computed using the log-derivative method\n[23]. The integration of the radial equation starts from a\nposition deep inside the classically forbidden region and\nends at a point in the asymptotic regime, beyond which\nthe contribution becomes insignificant. The phase shift is\nfound by matching this numerical solution in the asymptotic region to the asymptotic form, Eq. 8, and by using\n−Cl\nBl = tan δl .\nThe resultant values for partial wave phase shifts δl depend on the incident wave vector magnitude k = μ|~vr |/~.\nGiven the results for a particular collision wave vector,\nthe scattering amplitude can be constructed using Eq. 9\n\nOur apparatus consists of a magneto-optic trap (MOT)\nwhich collects and cools a few million rubidium atoms\nfrom a room-temperature Rb vapor of below 10−8 torr.\nThe atomic vapor is maintained by periodically heating an Alvatec rubidium source. The laser system used\nfor 87 Rb laser cooling is composed of grating-stabilized\nand injection-seeded diode lasers and has been described\npreviously [24]. After amplification, we have a total of\n20 mW of pump or cooling light (driving transitions from\n|F = 2i → |F 0 = 3i) and 4 mW of repump light (driving transitions from |F = 1i → |F 0 = 2i) both operating on the 52 S1/2 → 52 P3/2 transition. This light\nis combined and then expanded to a 1/e2 diameter of\n7 mm, prepared with the correct polarization and introduced into the MOT cell (a borosilicate glass box) along\n\n\f4\nthe three mutually orthogonal axes in a retro-reflection\nconfiguration. We typically operate with an axial gradient of b0 = 23.1(0.7) G cm−1 and with pump and repump detunings of ∆νp = −2γRb and ∆νr = 0, where\nγRb = 2π × 6.07 MHz is the natural linewidth of the\n52 S1/2 → 52 P3/2 transition. The total pump intensity is\nI = 5.6 Isat (where Isat = 3.58mW cm−2 for an isotropic\npump field with equal components in all three possible\npolarizations [25]). Based on previous measurements of\nthe escape probability as a function of energy for a Rb\nMOT [26] and studies of the dependence of the capture\nvelocity on intensity [15, 27], we estimate the MOT trap\ndepth in this work to be 800 ± 300 mK. The number of\ntrapped atoms in the MOT is determined by measuring\nthe emitted resonance fluorescence.\n\nFIG. 2: (Color online) MOT Fluorescence as a function of\ntime fit to the rate equation given in Eq. 13 with β = 0.\n87\nRb atoms are cooled, optically pumped into either\nthe |F = 1i or |F = 2i hyperfine ground state and\nthen transferred from the MOT into a quadrupole magnetic trap. For this purpose, the MOT anti-helmholtz\ncoil pair is used and provides an axial gradient of up\nto b0 = 670(20) G cm−1 . The intrinsic loss rate in\nthis quadrupole magnetic trap due to Majorana spin\nflips is negligible at the temperatures and densities in\nthis experiment [28]. The atom number remaining in\nthe magnetic trap after some hold time is measured by\nrapidly returning the magnetic field to an axial gradient\nof b0 = 23.1(0.7) G cm−1 , used for the MOT, switching\nthe MOT lasers on and detecting the fluorescence of the\natoms which are recaptured in the MOT. Within a millisecond, the atoms are laser cooled and recollected in\nthe MOT and the resonance fluorescence is monitored\nduring the first 100 ms after recapture. The measured\natom number is determined from this fluorescence and\nis corrected for the number of atoms captured from the\nresidual 87 Rb background vapor during the measurement\ntime. Since the trap loss rates reported here are determined from the ratios of atom numbers remaining in the\ntrap after various hold times, the only requirement for\na precise determination of the loss rate is that the measured fluorescence be linear in the number of trapped\natoms. Since the optical density is well below 0.5 for all\nof the measurements reported here, this is the case.\nAdditional room-temperature Ar gas is introduced into\n\nFIG. 3: (Color online) Fraction of atoms retained in a\nquadrupole magnetic trap as a function of time fit to the rate\nequation given in Eq. 13 with R = 0 and β = 0.\n\nthe vacuum envelope through a variable leak valve. This\ngas is continuously pumped away by a turbo-molecular\npump, and the resulting equilibrium partial pressure is\ncontrolled by the leak rate of the value and measured\nusing a residual gas analyzer (SRS RGA 200) as shown\nin Fig. 1. The additional trap loss rate induced by this\nnew gas as a function of its pressure is measured.\nAlthough an accurate determination of the exact cross\nsection using this trap loss method would require careful calibration of the residual gas pressure, the focus of\nthis work is to illustrate the dependence of the collision\ncross section on trap depth. Therefore this work requires\nonly that the the ratio of cross sections at different trap\ndepths be precise. In order to ensure this, and to mitigate\nthe effect of the uncertainty in the absolute pressure, the\ndata were collected as follows: the Ar pressure was first\nheld fixed and the loss rates for the MOT and magnetic\ntrap at various depths were measured. The pressure was\nthen adjusted and the procedure was repeated. This ensured that although the absolute pressure reading may\nbe in error, the loss rates in traps of varying trap depth\nwere all measured at the same pressures. The ratio of\ncross sections between traps of various depth is therefore\nprecise to within a statistical error of less than 10%.\nIn the MOT, the atom number loading dynamics in\nthe presence of a background vapour is modelled by the\nfollowing rate equation [29],\nZ\ndN\n= R − ΓN − β n2Rb dV\n(13)\ndt\nwhere N is the trapped atom number, R is the loading rate, Γ is the loss rate due to collisions between\nthe trapped rubidium atoms and the room-temperature\nbackground gas, and β is the combined density dependent 2-body loss coefficient due to cold collisions within\nthe MOT. Here 3-body and higher order collisions are\nneglected. The density profile of the cold, trapped atoms\nis given by nRb , and these density dependent losses include light-assisted collisional losses (such as radiative\nescape and fine structure changing collisions) and hyperfine structure changing collisions. For sufficiently small\natom numbers, the last term is negligible compared to the\n\n\f5\n\n−\nΓ\n7\n\n(s 1 )\n\n6\n\nLoss Rate,\n\nsecond [24]. In the case of the pure magnetic quadrupole\ntrap, the trapped number is well described by this model\nwith R = 0. In the magnetic trap, the confinement is\nmuch weaker than the MOT and the trap volume (up\nto 5 mm in radius compared to the MOT cloud radius\nof typically 150 μm) is larger by a factor of more than\n104 , making the density dependent collisional losses even\nsmaller. In addition, light assisted collisions (which dominate the β term for the MOT) are no longer present, and\nonly hyperfine changing collisions and spin relaxation collisions (from magnetic dipole-dipole coupling) remain. In\nany case, the data presented here are taken in the regime\nwhere these 2-body loss processes are completely dominated by the ΓN term.\n\n5\n\n4\n\n3\n\n2\n\n1\n\n0\n0.5\n\n1.0\n\n1.5\n\nnAr\n\n−\n\n2.0\n\n(x109 cm 3 )\n\n2.5\n\n3.0\n\n(14)\n\nFIG. 4: (Color online) Loss rate of trapped 87 Rb versus room\ntemperature argon gas density. The results are fit to a line and\nthe slope provides the value of the velocity averaged collision\nrate hσRb,Ar vAr i. The MOT (circles) exhibits the smallest\ncross section due to a much larger effective trap depth (∼1 K)\nthan the magnetic trap (squares) where the |F = 1, mF = −1i\nstate was confined with b0 = 79 G cm−1 resulting in a trap\ndepth of 0.64 mK. The vertical error bars, most of which are\nsmaller than the symbols, represent the statistical uncertainty\nin the loss rate based on fits similar to those shown in Figs. 2\nand 3.\n\nΓRb is the loss rate due to collisions with roomtemperature Rb atoms, and Γresidual is the loss rate due\nto collisions with unwanted residual gas in the ultra-high\nvacuum. Γb is the loss rate due to collisions with gas\nparticles intentionally introduced into the vacuum system and is given by Γb = nb hσRb,b vb i where hσRb,b vb i\nis the velocity averaged collision cross section of interest\n(Eq. 5).\nAs the controlled background gas density nb is increased, the total loss rate, Γ, increases with slope\nhσRb,b vb i. In general, all three of the loss rates contributing to Γ (ΓRb , Γb and Γresidual ) can be different in\nthe MOT than in a magnetic trap. This is due to the\ndifference in trap depths and to the fact that some of the\natoms in the MOT are in an electronic excited state during a collision (on the order of 12% for our MOT parameters) which will, in general, have a different interaction\npotential and corresponding cross section with the colliding particles than do ground state Rb atoms. The case\nof excited state Rb atoms colliding with identical ground\nstate Rb atoms is an extreme example. The leading order\nin Rb–Rb ground state interactions is C6 /r6 whereas it is\nC3 /r3 for Rb–Rb* collisions. In this way, a measurement\nof magnetic trap loss is less complicated to interpret since\nit only involves elastic collisions of ground state atoms.\nFigure 4 shows the measured loss rate of trapped 87 Rb\nversus argon density in both a MOT and a quadrupole\nmagnetic trap. These data are well fit by a line and\nthe slopes, which provide the value of the velocity averaged collision rate hσRb,Ar vAr i, are listed in table I. The\nMOT exhibits the smallest cross section (i.e. slope) due\nto a much larger trap depth (∼1 K) than the magnetic\n\ntrap (∼1 mK). As the argon density and associated background collision loss rate are increased, the steady state\nMOT number is smaller as are any density dependent\nlosses (our MOT is operating in the small-particle range\nwhere the density increases linearly with atom number\n[24]). If the density dependent losses were significant,\none would therefore expect the loss rate to vary nonlinearly with argon gas density. The MOT loss rate is\nobserved to vary linearly with the argon density confirming that the combined density dependent 2-body losses\ndue to cold collisions within the MOT are negligible under our experimental conditions.\nBefore loading the pure magnetic trap, hyperfine optical pumping is employed to populate and confine either\nthe |F = 2i or the |F = 1i state. For small magnetic\nfields where the electronic and nuclear magnetic moments\nare strongly coupled by the hyperfine interactions, F is\na good quantum number and the |F = 1, mF = −1i\nand |F = 2, mF = 1, 2i states are the magnetically trappable, weak-field seeking states. Also at small magnetic\nfields, the |F = 1, mF = −1i and |F = 2, mF = 1i\nstates have essentially identical magnetic moments (differing by less than 0.0004% at zero magnetic field) while\nthe |F = 2, mF = 2i state has twice the magnetic moment of the others and therefore experiences a larger\ntrap depth for a given magnetic field gradient. The\nquadrupole coils are oriented with the axis of symmetry along the direction of gravity (with an axial gradient\nof up to b0 = 670(20) G cm−1 and a radial gradient of\nb0 /2). For small fields, the magnetic trap potential energy along the axial direction (z) is U0axial = αb0 |z|+mgz,\n\nIV.\n\nRESULTS\n\nFigures 2 and 3 show the loading dynamics of the MOT\nand the atom loss from a magnetic trap fit to Eq. 13.\nFrom these fits, Γ is extracted. The loss rate due to\ncollisions with the room temperature gas includes a contribution from three different terms\nΓ = ΓRb + Γresidual + Γb .\n\n\f6\nTABLE I: Measurements of the trap loss rate slope for 87 Rb\nin the presence of room temperature 40 Ar gas listed in order\nof increasing trap depth. These results are compared with\nthe theoretical computed trap loss rate slope shown in Fig. 9.\nThe minimum and maximum values within the uncertainty in\nthe magnetic trap depth indicate the depth along the radial\nand axial directions while the uncertainty in the MOT trap\ndepth represents the estimated trap depth range based on the\nwork of Hoffmann et. al [26].\nTrapped State\n|F, mF i\n|1, −1i\n|2, +2i\n|1, −1i\n|1, −1i\n|1, −1i\n|1, −1i\n|1, −1i\nMOT\n\nb0\n(G cm−1 )\n39.5\n23.7\n79.0\n111\n334\n501\n668\n23.7\n\nTrap Depth\n(mK)\n0.24 (0.09)\n0.34 (0.06)\n0.73 (0.07)\n1.13 (0.20)\n3.77 (1.04)\n5.64 (1.59)\n7.41 (2.09)\n800 (300)\n\nhσRb,Ar vAr i\n(×10−9 cm3 s−1 )\n2.45 (0.07)\n2.40 (0.11)\n2.20 (0.09)\n2.18 (0.12)\n1.98 (0.09)\n1.86 (0.06)\n1.64 (0.04)\n0.54 (0.02)\n\nwhere α = μB gF mF is the magnetic moment of the\nstate, μB ' h × 1.4 MHz/G is the Bohr magneton, and\ngF = 1/2(−1/2) for the |F = 2i (|F = 1i) state. Along\nthe radial direction, the trap potential energy is, for small\n0\nmagnetic fields, U0radial = α b2 r.\nFor large magnetic fields, the electronic and nuclear\nspin magnetic moments begin to become decoupled and\nthe Zeeman shift is non-linear. The trap depths reported\n(Table I and Fig. 9) were evaluated by diagonalizing the\nfull Hamiltonian including the hyperfine and Zeeman interactions. The magnetic trap depth is limited by collisions with the cell walls which are 5 mm from the magnetic trap center along the radial and axial directions.\nSince particles can escape along either the axial or radial\ndirections, a trap depth error bar is provided in Table I\nand Fig. 9 indicating the depths along these directions.\nTypically, the trap depth is limited by radial trajectories; however, at axial gradients below b0 < 2mg\nα gravity\nlimits the trap depth along the z direction. In addition,\n−1\nbelow a critical gradient of b0 < mg\n, only\nα = 30.5 G cm\nthe |F = 2, mF = 2i is supported against gravity. This\nfeature can be used to \"clean\" the |F = 2i manifold removing all atoms in the other low-field seeking states. As\ndiscussed above, for the lower hyperfine state, only the\n|F = 1, mF = −1i state is magnetically trapped, while\nfor the upper hyperfine state, due to the non-linear Zeeman shift, there are three states (which correlate to the\n|F = 2, mF = 2, 1, 0i states at zero magnetic field) which\ncan be trapped magnetically, and each state has a different trap depth. To simplify the interpretation of the\ndata, we focus on the loss rate of the |F = 1, mF = −1i\nstate. In addition, we study trap loss for the upper hyperfine state at a field gradient of 23.7 G cm−1 . At this\ngradient only the |F = 2, mF = 2i state is trapped and\nthis ensures a single trap depth for the trapped atomic\nensemble.\nIn this analysis, the inter-atomic interaction is modeled\n\nFIG. 5: (Color online) The theoretically computed total cross\nsection for room temperature 87 Rb–40 Ar collisions (averaged\nover a Maxwell-Boltzmann distribution at 295 K) given a\nLennard-Jones inter-atomic potential as a function of the C6\ncoefficient (C12 = 8.6 × 107 Eh a12\nB ). The numerical results are\nfit to a power law, σ = 70Å2 × (C6 )0.40 , in agreement with\nthe approximate dependence of 2/5.\n\nby a Lennard-Jones potential, V (r) = C12 /r12 − C6 /r6 ,\nwhere the value C6 = 280 Eh a6B is used for the Rb-Ar\ninteraction (Eh = 4.35974 × 10−18 J). This coefficient is\nknown from both optical and atomic beam measurements\n[30, 31, 32]. C12 = 8.6 × 107 Eh a12\nB is chosen so that\nthe resulting potential has a minimum of 50 cm−1 below\nzero. This is the order of magnitude expectation for the\nAr-Rb complex [33]. However, this choice is somewhat\narbitrary, since for the collision energies involved in this\nexperiment, the exact value of C12 has a negligible effect\non the total cross section. For a long-range potential of\nthe form V (r) = −Cn /rn , where n > 2, it can be shown\n[17] that the cross section can be expressed as\n\u0012\nσ(k) = A\n\nCn\n~v\n\n\u00132/(n−1)\n,\n\n(15)\n\nwhere A is a constant and v is the collision velocity. This\nexpression is approximate and only valid for sufficiently\nlarge values of the collision wave vector μCn k n−2 /~2 \u001d 1\n(satisfied for all Ar–Rb collision velocities above 1 m/s\nfor C6 = 280 Eh a6B ) and for potentials which have the\nform specified for distances beyond rc ∼ (Cn /~v)1/(n−1) .\nGiven the known value for C6 and our choice for C12 ,\nthe Lennard-Jones potential deviates from a pure C6 /r6\npotential by less than 3% at distances beyond rc , defined\nfor Ar–Rb collision velocities of 1000 m/s. The deviation is even smaller for lower collision velocities since rc\nis larger. The result is that for collisions with a room\ntemperature gas, the cross section is insensitive to the\nexact value of C12 . Of course, for much higher velocities,\nthe exact short range behavior of the inter-atomic potential begins to matter, and at velocities much lower than\n1 m/s, low partial wave collisions are dominant and the\nabove approximate expression is invalid.\nAs a check of the numerical calculations, the computed\ncross section is compared with the predicted power law\ndependence on C6 , and an exponent of 0.40 is found,\nin agreement with the expected 2/5 dependence from\n\n\f7\nEq. 15. The results are shown in Fig. 5.\n\nFIG. 6: (Color online) The theoretically computed total cross\nsection for 87 Rb–40 Ar collisions averaged over a MaxwellBoltzmann distribution at various temperatures given a\nLennard-Jones inter-atomic potential with C6 = 280 Eh a6B\nand C12 = 8.6 × 107 Eh a12\nB . The results are fit to a power\nlaw, σ = 2100Å2 × (T )−0.202 , in agreement with the approximate expected power dependence of -1/5, corresponding to\nthe power dependence of -2/5 on the collision velocity.\n\nThe total cross section for 87 Rb–40 Ar collisions averaged over a Maxwell-Boltzmann distribution, hσRb,Ar i,\nis also computed at various Ar temperatures and shown\nin Fig. 6. These results also agree with the predictions\nof Eq. 15. In addition, they are consistent with previous atomic beam measurements of Ar–Rb collisions. In\nthat work, the attenuation of a 283 K Ar beam traveling through a 590 K Rb vapor was measured and a cross\nsection of 572 Å2 was found [30]. Although the average\nbeam velocity was not specified, we estimate that the\nrelative collision speed in that measurement corresponds\nto a stationary Rb atom exposed to a T > 400 K Ar\ngas. Our calculations predict a cross section of 626 Å2 at\nT = 400 K, within 10% of the value reported in Ref. [30].\n\nFIG. 7: (Color online) The theoretically computed total\ncross section for room temperature 87 Rb–40 Ar collisions (averaged over a Maxwell-Boltzmann distribution at 295 K)\ngiven a Lennard-Jones inter-atomic potential as a function\nof the C12 coefficient with C6 = 280 Eh a6B . A value of\nC12 = 8.6 × 107 Eh a12\nB results in a potential with a minimum\nof 50 cm−1 below threshold. As expected, for the collision\nenergies characteristic of a room temperature gas, the exact\nvalue of the C12 coefficient (at or below 109 Eh a12\nB ) plays little\nrole in the resulting cross section.\n\nFinally, the sensitivity of the exact value of the C12 co-\n\nefficient on the computed cross section was also checked.\nThe results of those calculations are shown in Fig. 7. The\nconclusion is clear, for any values of C12 less than or equal\nto 1010 Eh a12\nB , more than 10 times larger than our chosen value, the cross section remains essentially unchanged\n(varying by less than 3%).\nIn Fig. 8, the theoretically computed total loss cross\nsection of trapped 87 Rb as a function of the trap depth\nfor 87 Rb–40 Ar collisions at different collision velocities is\nshown. As one would expect, the variation in the loss\ninducing cross section with trap depth is the most pronounced at low collision velocities. However, there still\nremains a significant variation in cross section for a room\ntemperature thermal distribution of collision velocities.\n\nFIG. 8: (Color online) The theoretically computed loss cross\nsection as a function of trap depth for 87 Rb–40 Ar collisions\nof different velocities. Loss cross sections for velocities corresponding to the average speed at 4 K (open triangles), 295 K\n(open diamonds), 1000 K (open squares) are shown as well as\nthe average loss cross section for a room temperature thermal\ndistribution (filled circles). The variation of the loss cross\nsection with trap depth is most pronounced for the lowest\nvelocity collisions. However, there still remains significant\nvariation with trap depth for a thermal distribution at room\ntemperature.\n\nFig. 9 shows the theoretically computed and experimentally measured loss rate slope, hσRb,Ar vAr i, for\ntrapped 87 Rb as a function of the trap depth. This is\nthe central result of this paper. It reveals that the trap\nloss rate is a strongly varying function of the depth down\nto values below 1 mK. In fact, the variation with depth\nis observed to become more pronounced at values just\nbelow 10 mK. This behavior can be understood in the\nfollowing way: approximately half of the total collision\ncross section arises from classical scattering (exactly half\nfor a hard core potential) while the other half arises from\nquantum diffractive collisions [21]. The natural energy\nscale for diffractive collisions is\n\u000fd =\n\n4π~2\nMa σ\n\n(16)\n\nwhere Ma is the trapped atom mass and σ is the total collision cross section [6]. For Ar–Rb collisions, this\nenergy scale is 10 mK, and a trap of this depth would\nexhibit roughly half the loss rate of a trap of zero depth.\nThe computed loss rate slope at 10 mK is hσRb,Ar vAr i =\n\n\f8\n1.27 × 10−9 cm3 s−1 , almost exactly half the zero trap\ndepth loss rate slope of 2.43 × 10−9 cm3 s−1 . For trap\ndepths below 0.01 \u000fd , the Rb loss rate differs from the\nzero trap depth rate by less than 1%. The conclusion is\nthat by using a very shallow trap, whose depth can be\neasily characterized and made small compared to \u000fd , the\ntotal loss rate can be made to approach the total collision\nrate. We note that the variation of the loss rates within\nthe range of experimentally accessible trap depths provides a means to map out the differential cross section\nfrom the diffractive regime to the classical small angle\nregime. Measurements of this sort will be the subject of\nfuture work.\n3.0\n\n<vσ >( ×10−9 cm3 s−1 )\n\n2.5\n\n2.0\n1.5\n\n1.0\n\n0.5\n\n0.0 -1\n10\n\n100\n\n101\n\n102\n\nU(mK)\n\n103\n\n104\n\n105\n\nV.\n\nCONCLUSIONS\n\nIn summary, the use of trapped, laser cooled rubidium\natoms to measure the cross section for 87 Rb–40 Ar collisions is investigated. Trap loss rates produced by background collisions as a function of trap depth at 1 K and\nbelow 10 mK using a magneto-optic and a quadrupole\nmagnetic trap are studied. The retention of atoms due to\na finite trap depth (i.e. larger than the quantum diffractive collision energy scale) is found to significantly reduce\nthe measured loss rate in comparison with the total collision rate. Using model interaction potentials, the experimentally measured loss rates at various trap depths\nare found to be consistent with the known long range\nC6 coefficient. These results highlight the importance of\nminimizing the trap depth when attempting to infer the\ntotal collision cross section from measurements of atom\ntrap loss rates. Finally, this analysis could be used to\naccurately compute heating rates in magnetic traps providing a complementary approach to analytic methods\n[5, 6, 7, 8].\n\nFIG. 9:\n(Color online) The experimentally measured\n(squares) and theoretically computed (circles) loss rate slope,\nhσRb,Ar vAr i, as a function of trap depth for 87 Rb–40 Ar collisions. The line is only a guide to the eye. The data point at\n1 K was obtained using a MOT and the data below 10 mK\nwere obtained with a quadrupole magnetic trap. These values\nwere extracted from the data shown in Fig 4. The horizontal\nerror bar for the MOT data point represents an estimated trap\ndepth range based on the work of Hoffmann et. al [26]. The\nerror bars for the data below 10 mK represent the radial and\naxial magnetic trap depths. The horizontal dotted line indicates the zero trap depth limit for hσRb,Ar vAr i, corresponding\nto the total collision cross section.\n\nWe thank Roman Krems for stimulating discussions\nand for his careful reading of this manuscript. We also\nthank Roberto Romano for his help in fabricating the\ndetection photodiode, low-noise amplifier. B.G. Klappauf acknowledges support from the Canadian Institute\nfor Advanced Research. This work was supported by the\nNatural Sciences and Engineering Research Council of\nCanada (NSERC), the Canadian Foundation for Innovation (CFI), UBC, and the BCIT School of Computing\nand Academic Studies Professional Development Fund.\n\n[1] C. Monroe, W. Swann, H. Robinson, and C. Wieman,\nPhys. Rev. Lett. 65, 1571 (1990).\n[2] J. E. Bjorkholm, Phys. Rev. A 38, 1599 (1988).\n[3] A. M. Steane, M. Chowdhury, and C. J. Foot, J. Opt.\nSoc. Am. B 9, 2142 (1992).\n[4] C. R. Monroe, E. A. Cornell, C. A. Sackett, C. J. Myatt,\nand C. E. Wieman, Phys. Rev. Lett. 70, 414 (1993).\n[5] E. A. Cornell, J. R. Ensher, and C. E. Wieman,\narXiv:cond-mat/9903109v1 (1999).\n[6] S. Bali, K. M. O'Hara, M. E. Gehm, S. R. Granade, and\nJ. E. Thomas, Phys. Rev. A 60, R29 (1999).\n[7] H. C. W. Beijerinck, Phys. Rev. A 61, 033606 (2000).\n[8] H. C. W. Beijerinck, Phys. Rev. A 62, 063614 (2000).\n[9] K. J. Matherson, R. D. Glover, D. E. Laban, and R. T.\nSang, Rev. Sci. Instrum. 78, 073102 (2007).\n\n[10] K. J. Matherson, R. D. Glover, D. E. Laban, and R. T.\nSang, Physical Review A (Atomic, Molecular, and Optical Physics) 78, 042712 (pages 5) (2008).\n[11] T. P. Dinneen, C. D. Wallace, K.-Y. N. Tan, and P. L.\nGould, Optics Letters 17, 1706 (1992).\n[12] B. J. Claessens, J. P. Ashmore, R. T. Sang, W. R.\nMacGillivray, H. C. W. Beijerinck, and E. J. D. Vredenbregt, Physical Review A (Atomic, Molecular, and\nOptical Physics) 73, 012706 (pages 6) (2006).\n[13] R. S. Schappe, P. Feng, L. W. Anderson, C. C. Lin, and\nT. Walker, EPL (Europhysics Letters) 29, 439 (1995).\n[14] R. S. Schappe, T. Walker, L. W. Anderson, and C. C.\nLin, Phys. Rev. Lett. 76, 4328 (1996).\n[15] S. D. Gensemer, V. Sanchez-Villicana, K. Y. N. Tan,\nT. T. Grove, and P. L. Gould, Physical Review A 56,\n\n\f9\n4055 (1997).\n[16] I. Kusunoki, Bulletin of the Chemical Society of Japan\n40, 69 (1967).\n[17] L. Landau and L. Lifshitz, Quantum Mechanics, nonrelativistic theory (Pergamon, New York, 1965).\n[18] R. Helbing and H. Pauly, Zeitschrift fuer Physik 179, 16\n(1964).\n[19] R. W. Anderson, The Journal of Chemical Physics 60,\n2680 (1974).\n[20] D. Fagnan, Honour's Thesis, University of British\nColumbia (2009).\n[21] M. Child, Molecular Collision Theory (Academic, New\nYork, 1974).\n[22] N. Marković, unpublished, Chalmers University of Technology, Göteborg, Sweden (2003).\n[23] B. Johnson, Journal of Computational Physics 13, 445\n(1973).\n[24] K. Ladouceur, B. G. Klappauf, J. V. Dongen, N. Rauhut,\nB. Schuster, A. K. Mills, D. J. Jones, and K. W. Madison,\n\nJ. Opt. Soc. Am. B 26, 210 (2009).\n[25] D. A. Steck, rubidium 87 D Line Data, available online at\nhttp://steck.us/alkalidata (revision 2.0.1, 2 May 2008).\n[26] D. Hoffmann, S. Bali, and T. Walker, Phys. Rev. A 54,\nR1030 (1996).\n[27] V. S. Bagnato, L. G. Marcassa, S. G. Miranda, S. R.\nMuniz, and A. L. de Oliveira, Phys. Rev. A 62, 013404\n(2000).\n[28] W. Petrich, M. H. Anderson, J. R. Ensher, and E. A.\nCornell, Phys. Rev. Lett. 74, 3352 (1995).\n[29] J. Weiner, V. S. Bagnato, S. Zilio, and P. S. Julienne,\nRev. Mod. Phys. 71, 1 (1999).\n[30] S. Rosin and I. Rabi, Phys. Rev. 48, 373 (1935).\n[31] A. Dalgarno and W. Davison, Molecular Physics 13, 479\n(1967).\n[32] G. Mahan, The Journal of Chemical Physics 48, 950\n(1968).\n[33] R. Krems (2009), private communication.\n\n\f"}