{"id": "http://arxiv.org/abs/0807.2010v1", "guidislink": true, "updated": "2008-07-13T05:09:22Z", "updated_parsed": [2008, 7, 13, 5, 9, 22, 6, 195, 0], "published": "2008-07-13T05:09:22Z", "published_parsed": [2008, 7, 13, 5, 9, 22, 6, 195, 0], "title": "Tensor-entanglement renormalization group approach to topological phases", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.3370%2C0807.1894%2C0807.4594%2C0807.4186%2C0807.2172%2C0807.0573%2C0807.1877%2C0807.0113%2C0807.2815%2C0807.1847%2C0807.4974%2C0807.0819%2C0807.0305%2C0807.4676%2C0807.2690%2C0807.2791%2C0807.4403%2C0807.0120%2C0807.0281%2C0807.2100%2C0807.4058%2C0807.2279%2C0807.4674%2C0807.2329%2C0807.0576%2C0807.4486%2C0807.3850%2C0807.2847%2C0807.2878%2C0807.1625%2C0807.2010%2C0807.1987%2C0807.0274%2C0807.0224%2C0807.2015%2C0807.1567%2C0807.0039%2C0807.0134%2C0807.2053%2C0807.4408%2C0807.1881%2C0807.3697%2C0807.2275%2C0807.4572%2C0807.2969%2C0807.2941%2C0807.0867%2C0807.0902%2C0807.1668%2C0807.3724%2C0807.2584%2C0807.3330%2C0807.2606%2C0807.5002%2C0807.3322%2C0807.3373%2C0807.0174%2C0807.0566%2C0807.4991%2C0807.2003%2C0807.3155%2C0807.1678%2C0807.1597%2C0807.1699%2C0807.3622%2C0807.1479%2C0807.1637%2C0807.3398%2C0807.0804%2C0807.5045%2C0807.4199%2C0807.2027%2C0807.3603%2C0807.0282%2C0807.2406%2C0807.0654%2C0807.1434%2C0807.0222%2C0807.1527%2C0807.1282%2C0807.3613%2C0807.4210%2C0807.0283%2C0807.2479%2C0807.2861%2C0807.2771%2C0807.0730%2C0807.0891%2C0807.1645%2C0807.1341%2C0807.1235%2C0807.2013%2C0807.1762%2C0807.0964%2C0807.4211%2C0807.0669%2C0807.3666%2C0807.1941%2C0807.0071%2C0807.1123%2C0807.1070&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Tensor-entanglement renormalization group approach to topological phases"}, "summary": "The tensor-entanglement renormalization group approach is applied to\nHamiltonians that realize a class of topologically ordered states -- string-net\ncondensed states. We analyze phase transitions between phases with and without\nstring-net condensation. These phase transitions change topological order\nwithout changing any symmetries. This demonstrates that the tensor-entanglement\nrenormalization group approach can be used to study the phase diagram of a\nquantum system with topologically ordered phases.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.3370%2C0807.1894%2C0807.4594%2C0807.4186%2C0807.2172%2C0807.0573%2C0807.1877%2C0807.0113%2C0807.2815%2C0807.1847%2C0807.4974%2C0807.0819%2C0807.0305%2C0807.4676%2C0807.2690%2C0807.2791%2C0807.4403%2C0807.0120%2C0807.0281%2C0807.2100%2C0807.4058%2C0807.2279%2C0807.4674%2C0807.2329%2C0807.0576%2C0807.4486%2C0807.3850%2C0807.2847%2C0807.2878%2C0807.1625%2C0807.2010%2C0807.1987%2C0807.0274%2C0807.0224%2C0807.2015%2C0807.1567%2C0807.0039%2C0807.0134%2C0807.2053%2C0807.4408%2C0807.1881%2C0807.3697%2C0807.2275%2C0807.4572%2C0807.2969%2C0807.2941%2C0807.0867%2C0807.0902%2C0807.1668%2C0807.3724%2C0807.2584%2C0807.3330%2C0807.2606%2C0807.5002%2C0807.3322%2C0807.3373%2C0807.0174%2C0807.0566%2C0807.4991%2C0807.2003%2C0807.3155%2C0807.1678%2C0807.1597%2C0807.1699%2C0807.3622%2C0807.1479%2C0807.1637%2C0807.3398%2C0807.0804%2C0807.5045%2C0807.4199%2C0807.2027%2C0807.3603%2C0807.0282%2C0807.2406%2C0807.0654%2C0807.1434%2C0807.0222%2C0807.1527%2C0807.1282%2C0807.3613%2C0807.4210%2C0807.0283%2C0807.2479%2C0807.2861%2C0807.2771%2C0807.0730%2C0807.0891%2C0807.1645%2C0807.1341%2C0807.1235%2C0807.2013%2C0807.1762%2C0807.0964%2C0807.4211%2C0807.0669%2C0807.3666%2C0807.1941%2C0807.0071%2C0807.1123%2C0807.1070&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The tensor-entanglement renormalization group approach is applied to\nHamiltonians that realize a class of topologically ordered states -- string-net\ncondensed states. We analyze phase transitions between phases with and without\nstring-net condensation. These phase transitions change topological order\nwithout changing any symmetries. This demonstrates that the tensor-entanglement\nrenormalization group approach can be used to study the phase diagram of a\nquantum system with topologically ordered phases."}, "authors": ["Zheng-Cheng Gu", "Michael Levin", "Xiao-Gang Wen"], "author_detail": {"name": "Xiao-Gang Wen"}, "author": "Xiao-Gang Wen", "arxiv_comment": "5 pages, RevTeX4", "links": [{"href": "http://arxiv.org/abs/0807.2010v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0807.2010v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0807.2010v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0807.2010v1", "journal_reference": "Phys. Rev. B 78, 205116 (2008)", "doi": null, "fulltext": "Tensor-entanglement renormalization group approach to topological phases\nZheng-Cheng Gu† , Michael Levin†† and Xiao-Gang Wen†\n\narXiv:0807.2010v1 [cond-mat.str-el] 13 Jul 2008\n\nDepartment of Physics, Massachusetts Institute of Technology, Cambridge, Massachusetts 02139, USA†\nDepartment of Physics, Harvard University, Cambridge, Massachusetts 02138, USA ††\nThe tensor-entanglement renormalization group approach is applied to Hamiltonians that realize\na class of topologically ordered states – string-net condensed states. We analyze phase transitions\nbetween phases with and without string-net condensation. These phase transitions change topological order without changing any symmetries. This demonstrates that the tensor-entanglement\nrenormalization group approach can be used to study the phase diagram of a quantum system with\ntopologically ordered phases.\n\nIntroduction: A mean field approach could potentially\nbe very useful for understanding and analyzing topological phases[1] and topological phase transitions.[2–8]\nThe main challenges in developing such an approach are\n(a) finding a class of mean field states that can describe\ntopological phases and (b) finding a simple way to calculate the physical properties, such as average energy,\nof these states. The first problem can be solved with\na general class of trial wave functions known as \"tensor product states\" (or alternatively \"projected entangled pair states\"). [9, 10] Indeed, one can show that tensor product states (TPS) can describe all the string-net\ncondensed states constructed in [11], and hence all nonchiral topological phases. [12] The second problem can\nbe solved with the tensor-entanglement renormalization\ngroup (TERG) method[13] which allows one to calculate\ncorrelation functions (including average energy) of a TPS\nvery efficiently. More specifically, the relative error ǫ in\na TERG calculation scales with the computation time T\n2\nlike ǫ ∼ e−const.*(ln T ) for 2D gapped systems. [13] (For\ncomparison, the error in a variational Monte Carlo calcu1\nlation scales like ǫ ∼ e− 2 ln T , if there is no sign problem).\nIn this paper, we apply the TERG approach to a few\nmodels with string-net condensation. We calculate the\nphase diagram of these systems and study phase transitions from string-net condensed states to states without string-net condensation. These transitions are examples of continuous phase transitions between phases with\ndifferent topological orders but the same symmetry.[2–7]\nAs such, they are beyond the Landau symmetry breaking paradigm. Thus the TERG approach is capable of\ndescribing phases and phase transitions that cannot be\ndescribed by Landau's symmetry breaking theory.\nZ2 gauge model: The first system that we study is a\nspin-1/2 system where the spins live on links of a square\nlattice. The Hamiltonian is given by\nX\u0010\nY \u0011\nXY\nX\nH =U\n1−\nσlz − g\nσlx − J\nσlz , (1)\nv\n\nl∈v\n\np\n\nl∈p\n\nl\n\nQ\nHere l∈p σlx P\nis the product of the four σlx Qaround a\nz\nsquare p and p sums over all the squares.\nl∈v σlPis\nthe product of the four σlz P\naround a vertex v and v\nsums over all the vertices.\nl sums over all links. We\n\nwill assume that U = ∞ and study the quantum phases\nof the above system as we change g and J. We will\nassume J > 0 and g > 0.\nWhen J = 0, eqn. (1) is exactly soluble.[14] To understand the exact ground state in the string language,[15]\nwe interpret the σ z = −1 and σ z = 1 states on a single\nlink as the presence or absence of a string. The appropriate low energy Hilbert space in large\nU limit is made\nQ\nof closed string states that satisfy i∈v σiz = 1 at every\nvertex. The ground state is simply an equal P\nweight superposition of all closed string states |ΨZ2 i = Xclosed |Xi,\nwhich is called a string-net condensed state.\nWhen g = 0, the ground state is the spin polarized\nstate with no down spins and no closed strings. The\nabove two states have the same symmetry. But due to the\nnon-trivial topological order in the string-net condensed\nstate, the two states belong to two different quantum\nphases. We would like to use the TERG approach to\nstudy the phase transition between the above two states\nwith different topological orders.\nWe would like to mention that the low energy effective theory of eqn. (1) is Z2 gauge theory.[14, 16, 17] The\ntransition between the string-net condensed and non condensed phases is nothing but the transition between the\ndeconfined and confined phases of Z2 gauge theory.\nOne way to study such a phase transition is to introduce a variational wave function\nX\n|Ψw i =\n(2)\nwLX |Xi ,\nXclosed\n\nwhere LX is the number of links on the string X. When\nw = 1, |Ψw i becomes the string condensed state |ΨZ2 i.\nWhen w = 0, |Ψw i is the state with all spins in up direction which does not contain any strings. We see that w\ndescribes the string tension. |Ψw=1 i is the ground state\nof eqn. (1) when J = 0 and |Ψw=0 i is the ground state\nof eqn. (1) when g = 0.\nSince |Ψw=1 i and |Ψw=0 i have the same symmetry,\none might expect that as we change g/J, |Ψw=1 i would\nchange into |Ψw=0 i smoothly and the ground state energy\nof eqn. (1) would be a smooth function of g/J, implying\nthat there was no quantum phase transition. In fact, we\nwill see below that the ground state energy of eqn. (1)\n\n\f2\n\n-0.8\n\nT gm\n\nT\n\nsingle line\n\n-1.0\n\ngm\n\ndouble line\n\n-1.2\n\nE\n\n-1.4\n-1.6\n-1.8\n\n(a)\n\n(b)\n\n-2.0\n-2.2\n\nFIG. 1: (a) The spin-1/2 model eqn. (1) on links of a square\nlattice. The dots represent the physical spin states which are\nlabeled by m = 0, 1. The above graph can also be viewed as\na tensor-network where each dot represents a rank-3 tensor g\nand each vertex represents a rank-4 tensor T . The two legs of\nm\na dot represent the α and β indices in the rank-3 tensor gαβ\n.\nThe four legs of a vertex represent the four internal indices\nin the rank-4 tensor Tαβγλ . The indices on the connected\nlinks are summed over which define the tensor trace tTr. (b)\nA tensor-network of the double-line tensors, where each dot\nrepresents a double-line tensor g and each vertex represents\na double-line tensor T . The four legs of a dot represent the\nα1,2 and β1,2 indices in the tensor gαm1 α2 ;β1 β2 . The eight legs\nof a vertex represent the internal indices in the rank-4 tensor\nTα1 α2 ;β1 β2 ;γ1 γ2 ;λ1 λ2 . The indices on the connected links are\nsummed over which define the tensor-trace tTr.\n\nis not a smooth function of g/J indicating that there is\nquantum phase transition at a critical value (g/J)c .\nIn order to calculate the energy expectation values in\nthese states (and also to pave the way for generalizations)\nit is convenient to write the trial wave function |Ψw i as\na tensor product state:\nX\n|ΨZ2 i =\ntTr[⊗v T ⊗l g ml ]|m1 , m2 , ...i,\n(3)\nm1 ,m2 ,...\n\nwhere ml = 0, 1 labels the up-spin state and the downspin state on link-l. To define the tensor-trace (tTr), one\ncan introduce a graphical representation of the tensors\n(see Fig. 1a). Then tTr means summing over all indices\non the connected links of tensor-network. The Z2 stringnet condensed ground state that we discussed above is\ngiven by the following choice of tensors:\n\u001a\n1, if α + β + γ + δ even\nTαβγδ =\n(4)\n0, if α + β + γ + δ odd\n\n0\n\n1\n\n2\n\n3\n\n4\n\ng/J\n\nFIG. 2: (Color online) The black squares are average energies\nof the Z2 model eqn. (1) for the single-line tensor network\neqn. (4) and eqn. (5). The red dots are average energies for\nthe double-line tensor network eqn. (8) and eqn. (7).\n\nOnce we have expressed the trial wave function as a\nTPS, we can use the TERG method[13] to calculate the\naverage energy in a very efficient way.[20] The resulting\naverage energy as a function of g/J is plotted in Fig. 2.\nFrom the discontinuity in the slope, we see that there is\na first order phase transition at g/J ≈ 2.3 between the\ntwo states with and without string-net condensation.\nHow good is this result? On a quantitative level, it is\nnot very good: the phase transition is known to occur\nat (g/J)c ≈ 3.044.[18] However, this not surprising since\nwe used the simplest possible variational wave function.\nWe expect the estimate for (g/J)c to improve when we\nincrease the number of variational parameters - for example, by considering more general tensors g, T .\nA more serious problem is that the result is wrong\non a qualitative level: the phase transition is known to\nbe second order, not first order. This problem cannot\nbe overcome by blindly generalizing the tensors g, T .\nInstead, we have to choose these tensors in a special way.\nTo understand the basic issue, let us consider another set\nof variational tensors. In this scheme, the internal indices\nfor the T -tensors and g-tensors still run from 0 to 1, but\neach leg now has two internal indices:[21]\nTαβγλ = Tα1 α2 ;β1 β2 ;γ1 γ2 ;λ1 λ2\n= Tα01 β1 γ1 λ1 δα2 γ1 δγ2 β1 δβ2 λ1 δλ2 α1\n\n(6)\n\nwith α1 , α2 , β1 , β2 , γ1 , γ2 , λ1 , λ2 = 0, 1 and\n0\ng00\n= 1,\n\n1\ng11\n= w,\n\n(5)\n\n0\n0\n1\n1\ng11,11\n= g00,00\n= 1, g10,10\n= g01,01\n= 1, others = 0. (7)\n\nwith internal indices like α running over 0, 1. The rank3 tensor g behaves like a projector which essentially set\nthe internal index equal to the physical index so that\nα = 1 represents a string and α = 0 represents no string.\nThe meaning of the tensor Tαβγδ is also clear, it just\nenforces the closed string constraint, only allowing an\neven number of strings to meet at a vertex.\n\nIn such constructions, our tensors have a double-line\nstructure (see Fig.1b). Again, g m are projectors that\nrelate the internal indices with physical indices. Here, on\neach leg of g-tensor and T -tensor, the double line with\nthe same value is projected to the spin-up state and the\ndouble line with different values is projected to the spindown state.\n\nothers = 0,\n\n\f3\n\n1.0\nsingle line\ndouble line\n0.8\n\np\n\n<B >\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n0\n\n1\n\n2\n\n3\n\n4\n\ng/J\n\nFIG. 3: (Color online) hBp i versus g/J. The single-line variational wave function shows a jump in hBp i, which indicates a\nfirst order phase transition around g/J = 2.3 (black squares).\nThe double-line variational wave functions has no jump in\nhBp i but the discontinuity in the derivative indicates a second order phase transition around g/J = 3.2 (red dots).\n\nTo maintain the 90 degree rotational symmetry, we\n0\nchoose T 0 to have a form (assuming T1111\n= 1):\n0\nx(1) = T0000\n0\n0\n0\n0\n= T1101\n= T1110\n= T1011\nx(2) = T0111\n0\n0\n0\n0\nx(3) = T1000\n= T0100\n= T0010\n= T0001\n0\n0\n0\n0\nx(4) = T1100 = T0011 = T0110 = T1001\n0\n0\nx(5) = T1010\n= T0101\n\n(8)\n\nWe note that for such a choice of T 0 and g m , the trial\nwave function contain only closed string states.\nUsing the TERG approach to minimize the average energy, we find the variational ground state energy which\nis plotted in Fig. 2. We find that there is a phase transition between the two phases with and without string-net\ncondensation. But now the phase transition is a second\norder phase transition at g/J ≈ 3.2 (see Fig. 3). Note\nthat this result is better than our previous result both\nquantitatively and qualitatively.\nThe quantitative improvement is perhaps not surprising since we are using more variational parameters. A\nmore important issue is that the double-line mean field\ntheory correctly predicts a second order phase transition,\nwhile the single line mean field theory did not. Why is\nthis?\nNote that there is a Z2 redundancy in the double-line\ntensors (like the gauge redundancy in gauge theory). As\nwe exchange values of 0 and 1 for all the internal indices of\nthe double-line tensors, we induce a Z2 transformation on\nthose double-line tensors: (T, g m ) → (Te, e\ng m ). However,\nsuch a Z2 transformation does not change the physical\nwave function: tTr[⊗v T ⊗l g ml ] = tTr[⊗v Te ⊗l geml ]. Thus\n(T, g m ) and (Te, e\ng m ) are two labels that label the same\nphysical state.\n\nFIG. 4: The double-semion model on the honeycomb lattice.\nThe ground state wave function (12) has a TPS representation\ngiven by the above tensor-network. Note that T and g has a\ndouble-line structure. The vertices form a honeycomb lattice\nwhich can be divided into A-sublattice and B-sublattice.\n\nThe variational approach used here is similar to calculating an average in a local classical statistical system.\nThe presence of a Z2 symmetry allows a classical system to have a Z2 symmetry breaking transition which\nis a second order phase transition. This is the reason\nwhy the double-line tensors are capable of producing a\nsecond order phase transition. In contrast, for the singleline tensors, the corresponding classical system does not\nhave any symmetries, and as a result, it cannot describe\na second order transition.\nWe would like to mention that there is a duality transformation that relate the 2D Z2 gauge theory to transverse field Ising model.[19] Such a duality mapping allows us to relate the phase transition between the deconfined and confined phases of the Z2 gauge theory to the\nspin ordered and disordered transition in the transverse\nfield Ising model. This is how we know that the transition between the string-net condensed and non condensed\nphases is a second order phase transition and that it occurs at critical coupling g/J ≈ 3.044. In fact, the doubleline tensors exactly realize the duality mapping between\nthe 2D Z2 gauge theory and transverse field Ising model.\nFrom the structure of the double tensors in eqn. (7) and\neqn. (8), we see that each square loops in Fig. 1b carries the same value of internal indices, which correspond\nto the value of a dual spin (located at the center of the\nsquare) in the dual Ising model. The string formed by\nthe down-spins on the links correspond to a domain wall\nin the dual Ising model.\nDouble-semion model: Next we consider a more complicated model where spins are located on the links of a\nhoneycomb lattice (see Fig. 4):\n\u0011\nX\nX\u0010\nY\nσiz\nH =U\n1−\nσiz − J\nlegs of I\n\nI\n\n−g\n\nX\np\n\n(\n\nY\n\nedges of p\n\ni\n\nσjx )(\n\nY\n\nlegs of p\n\ni\n\n1−σjz\n2\n\n),\n\n(9)\n\n\f4\n\nsublattice A :\nsublattice B :\n\nA\nδαβ ′ δβγ ′ δγα′\nTαα′ ;ββ ′ ;γγ ′ = Tαβγ\n\nTαα′ ;ββ ′ ;γγ ′ =\n\nB\nTαβγ\nδα′ β δβ ′ γ δγ ′ α(10)\n\nwhere each internal index represented by one of the double lines runs over 0, 1. The tensor T A and T B is given\nby\nA\nA\nA\nx(1) = T011\n= T101\n= T110\n;\n\nA\nA\nA\nx(2) = T001\n= T100\n= T010\n\nA\nA\nx(3) = T111\n; x(4) = T000\nB\nB\nB\nx(5) = T011\n= T101\n= T110\n;\n\nB\nB\nB\nx(6) = T001\n= T100\n= T010\n\nB\nx(7) = T111\n;\n\nB\nx(8) = T000\n\n(11)\n\nThe g-tensors on the links are given by eqn. (7). The trial\nwave function is obtained by summing over all the internal indices on the connected links in the tensor network\n(see Fig. 4):\nX\ntTr[⊗v T ⊗l g ml ]|m1 , m2 , ...i. (12)\n|Ψdsemioni =\n\n1.0\n\n0.8\n\n0.6\n\np\n\n<B >\n\nwhere i labels the links, I labels the vertices and p labels\nhexagons. Again we consider U = ∞ limit. When J = 0,\nthe above model is exactly soluble\nP\nP and the exact ground\nstate is given by[11] |Ψsem i = X (−)l(X) |Xi, where X\nsums over all the closed string configurations and l(X) is\nnumber of closed loops in X. The ends of string in such a\nstate have the semion statistics. When g = 0, the model\nis also exactly soluble and the spins all point up (ie no\nstrings) in the ground state.\nTo study the phase transition between the above two\nstates, again we choose the double-line tensors to construct the trial wave function (see Fig. 4). The T -tensors\nin the vertices are given schematically by\n\n0.4\n\n0.2\n\n0.0\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\ng/J\n\nFIG. 5: hBp i versus g/J, the discontinuity of the derivative\naround g/J = 5.0 indicates a second order confinement-deconfinement phase transition.\n\nchoose the tensors in more general situations. One hint\nis that all the string-net states constructed in Ref. 11\ncan be expressed naturally in terms of a generalization\nof the double-line tensor network, which involves triple\nline tensors.[12] This triple-line tensor-network may correspond to the dual representation of the string-net states\nand may correspond to a suitable choice for the variational TERG approach. This may lead to a systematic\nvariational approach for topological phases and topological phase transitions.\nAcknowledgements: This research is supported by the\nFoundational Questions Institute (FQXi) and NSF Grant\nDMR-0706078.\n\n{ml }\n\nAgain, the physical indices and the internal indices have\na similar relation as in the Z2 double-line tensors. When\nx(1) = x(5) = − i, x(2) = x(6) = i and x(3) = x(4) =\nx(7) = x(8) = 1, the tensor reproduces the right sign\noscillations (−)l(X) essentially by counting the number\nof left and right turns made by the string.\nWe used the TERG approach to find the variational\nground states for different g/J. Then we used the TERG\napproach to calculate hBp i for those variational ground\nstates. The result is presented in Fig. 5. We see that\nthere is a second order phase transition at g/J ≈ 5.0,\nwhich should correspond to the transition between the\nstring-net condensed and non condensed states. This\nagrees with the Monte Carlo result where a second order phase transition appears at (g/J)c ≈ 4.768.[18] (Note\nthat in the infinite U limit, the above model is equivalent\nto the usual Z2 gauge model on honeycomb lattice, which\nis dual to the transverse Ising model on triangle lattice.)\nConclusion: We have seen that the TERG approach is\nan effective way to study topological phases and topological phase transitions, but one needs to choose the variational tensors carefully. An important question is how to\n\n[1] X.-G. Wen, Advances in Physics 44, 405 (1995).\n[2] X.-G. Wen and Y.-S. Wu, Phys. Rev. Lett. 70, 1501\n(1993).\n[3] W. Chen, M. P. A. Fisher, and Y.-S. Wu, Phys. Rev. B\n48, 13749 (1993).\n[4] T. Senthil, J. B. Marston, and M. P. A. Fisher, Phys.\nRev. B 60, 4245 (1999).\n[5] N. Read and D. Green, Phys. Rev. B 61, 10267 (2000).\n[6] X.-G. Wen, Phys. Rev. Lett. 84, 3950 (2000).\n[7] X.-G. Wen, Phys. Rev. B 65, 165113 (2002).\n[8] M. Levin and X.-G. Wen, Phys. Rev. B 75, 075116\n(2007).\n[9] M. Aguado and G. Vidal, Phys. Rev. Lett. 100, 070404\n(2008).\n[10] F. Verstraete, M. M. Wolf, D. Perez-Garcia, and J. I.\nCirac, Phys. Rev. Lett. 96, 220601 (2006).\n[11] M. Levin and X.-G. Wen, Phys. Rev. B 71, 045110\n(2005).\n[12] Z.-C. Gu, M. Levin, B. Swingle, and X.-G. Wen, to appear.\n[13] Z.-C. Gu, M. Levin, and X.-G. Wen, arXiv:0806.3509\n(2008).\n[14] A. Y. Kitaev, Ann. Phys. (N.Y.) 303, 2 (2003).\n[15] X.-G. Wen, Quantum Field Theory of Many-Body Sys-\n\n\f5\ntems – From the Origin of Sound to an Origin of Light\nand Electrons (Oxford Univ. Press, Oxford, 2004).\n[16] N. Read and S. Sachdev, Phys. Rev. Lett. 66, 1773\n(1991).\n[17] X.-G. Wen, Phys. Rev. B 44, 2664 (1991).\n[18] H. W. J. Blote and Y. Deng, Phys. Rev. E66, 066110\n(2002).\n\n[19] J. B. Kogut, Rev. Mod. Phys. 51, 659 (1979).\n[20] We can absorb the g-tensor into the T -tensor when we\nconstruct the double-tensor in the TERG calculation.\n[21] The expression eqn. (6) is valid only on the sublattice A.\nThe T tensor has a slightly different form on the sublattice B. For details see eqn. (10) and Fig. 4.\n\n\f"}