{"id": "http://arxiv.org/abs/0802.3119v1", "guidislink": true, "updated": "2008-02-21T14:27:51Z", "updated_parsed": [2008, 2, 21, 14, 27, 51, 3, 52, 0], "published": "2008-02-21T14:27:51Z", "published_parsed": [2008, 2, 21, 14, 27, 51, 3, 52, 0], "title": "Primordial black holes and asteroid danger", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.3825%2C0802.0770%2C0802.1230%2C0802.0996%2C0802.0412%2C0802.1790%2C0802.2701%2C0802.4431%2C0802.3106%2C0802.4263%2C0802.0323%2C0802.0678%2C0802.2345%2C0802.2761%2C0802.4084%2C0802.2473%2C0802.0220%2C0802.3492%2C0802.2892%2C0802.2025%2C0802.0779%2C0802.3301%2C0802.1702%2C0802.0628%2C0802.3691%2C0802.0102%2C0802.3263%2C0802.2804%2C0802.4015%2C0802.4105%2C0802.2585%2C0802.3119%2C0802.2239%2C0802.3845%2C0802.2472%2C0802.4132%2C0802.0700%2C0802.4362%2C0802.2905%2C0802.2336%2C0802.0614%2C0802.0696%2C0802.1095%2C0802.3240%2C0802.3877%2C0802.2246%2C0802.0016%2C0802.0237%2C0802.4417%2C0802.3568%2C0802.2831%2C0802.2510%2C0802.3554%2C0802.2300%2C0802.2900%2C0802.4204%2C0802.1278%2C0802.4432%2C0802.0717%2C0802.0080%2C0802.2645%2C0802.3182%2C0802.3831%2C0802.0811%2C0802.2433%2C0802.4412%2C0802.1076%2C0802.3571%2C0802.1121%2C0802.2271%2C0802.0612%2C0802.0930%2C0802.1336%2C0802.1829%2C0802.4396%2C0802.3070%2C0802.2969%2C0802.0136%2C0802.1412%2C0802.1062%2C0802.3080%2C0802.0005%2C0802.3633%2C0802.2925%2C0802.0496%2C0802.2806%2C0802.4429%2C0802.2981%2C0802.2375%2C0802.2785%2C0802.1316%2C0802.4305%2C0802.3274%2C0802.3158%2C0802.3285%2C0802.2310%2C0802.3704%2C0802.3234%2C0802.0572%2C0802.3220%2C0802.1190&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Primordial black holes and asteroid danger"}, "summary": "Probability for a primordial black hole to invade the Kuiper belt was\ncalculated. We showed that primordial black holes of certain masses can\nsignificantly change asteroids' orbits. These events may result in disasters,\nlocal for our solar system and global for the Earth (like the Tunguska\nmeteorite). We also estimated how often such events occur.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.3825%2C0802.0770%2C0802.1230%2C0802.0996%2C0802.0412%2C0802.1790%2C0802.2701%2C0802.4431%2C0802.3106%2C0802.4263%2C0802.0323%2C0802.0678%2C0802.2345%2C0802.2761%2C0802.4084%2C0802.2473%2C0802.0220%2C0802.3492%2C0802.2892%2C0802.2025%2C0802.0779%2C0802.3301%2C0802.1702%2C0802.0628%2C0802.3691%2C0802.0102%2C0802.3263%2C0802.2804%2C0802.4015%2C0802.4105%2C0802.2585%2C0802.3119%2C0802.2239%2C0802.3845%2C0802.2472%2C0802.4132%2C0802.0700%2C0802.4362%2C0802.2905%2C0802.2336%2C0802.0614%2C0802.0696%2C0802.1095%2C0802.3240%2C0802.3877%2C0802.2246%2C0802.0016%2C0802.0237%2C0802.4417%2C0802.3568%2C0802.2831%2C0802.2510%2C0802.3554%2C0802.2300%2C0802.2900%2C0802.4204%2C0802.1278%2C0802.4432%2C0802.0717%2C0802.0080%2C0802.2645%2C0802.3182%2C0802.3831%2C0802.0811%2C0802.2433%2C0802.4412%2C0802.1076%2C0802.3571%2C0802.1121%2C0802.2271%2C0802.0612%2C0802.0930%2C0802.1336%2C0802.1829%2C0802.4396%2C0802.3070%2C0802.2969%2C0802.0136%2C0802.1412%2C0802.1062%2C0802.3080%2C0802.0005%2C0802.3633%2C0802.2925%2C0802.0496%2C0802.2806%2C0802.4429%2C0802.2981%2C0802.2375%2C0802.2785%2C0802.1316%2C0802.4305%2C0802.3274%2C0802.3158%2C0802.3285%2C0802.2310%2C0802.3704%2C0802.3234%2C0802.0572%2C0802.3220%2C0802.1190&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Probability for a primordial black hole to invade the Kuiper belt was\ncalculated. We showed that primordial black holes of certain masses can\nsignificantly change asteroids' orbits. These events may result in disasters,\nlocal for our solar system and global for the Earth (like the Tunguska\nmeteorite). We also estimated how often such events occur."}, "authors": ["Alexander Shatskiy"], "author_detail": {"name": "Alexander Shatskiy"}, "author": "Alexander Shatskiy", "links": [{"title": "doi", "href": "http://dx.doi.org/10.3103/S0027134908040127", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0802.3119v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0802.3119v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "5 pages", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0802.3119v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0802.3119v1", "journal_reference": "Vestnik Moskovskogo Universiteta (in Russian), ser. 3, No4, (2008)", "doi": "10.3103/S0027134908040127", "fulltext": "Primordial black holes and asteroid danger\nAlexander Shatskiy\n∗\n\n∗\n\nAstro Space Center of the P. N. Lebedev Physics Institute, Russian Academy of Sciences\n\narXiv:0802.3119v1 [astro-ph] 21 Feb 2008\n\nul. Profsoyuznaya 84/32, 117997 Moscow, Russian Federation\n\nAbstract\nProbability for a primordial black hole to invade the Kuiper belt was calculated. We\nshowed that primordial black holes of certain masses can significantly change asteroids'\norbits. These events may result in disasters, local for our solar system and global for the\nEarth (like the Tunguska meteorite). We also estimated how often such events occur.\n\n1\n\nIntroduction\n\nNowadays the asteroid danger is one of the most important scientific issues. Geophysical\ndata indicate that in the past the Earth was dangerously attacked by asteroids about\nevery 190 million years rather than continuously. These repeated global events suggest\nthat the probability for asteroids, or meteorites, to shoot is not constant, but depends on\nexternal (with respect to the Solar system) factors (see [1]).\nAt the moment the nature of dark matter is not clear. One of the candidates for dark\nmatter particle is a primordial black hole (PBH). In case the entire dark matter consists of\nPBHs, it is possible to set not only the lower (Hawking) bound for their masses, but also\nthe upper one. The latter comes from the data on gravitational microlensing (for example,\nsee [2]). However, the upper bound is quite uncertain and in different estimations lies in\nthe range 1026 ÷ 1028 g, i.e. close to the Earth and Moon masses.\nIn this paper we obtained the probability for a PBH travelling through the Solar\nsystem to collide (interact) with an asteroid. This process can make collision of the Earth\nand some heavenly body more probable.\nTo date, we are aware of several asteroids whose orbits are threateningly close to the\nEarth. The asteroids that are sufficiently big and massive are most dangerous to our\nplanet. For example, the Tunguska meteorite must have been around 50 m in diameter.\nAs is well-known, there are three prominent asteroid belts in the Solar system:\n1. Mass of the main asteroid belt (the Phaeton belt) is about 1024 g ∼ 10−3 M⊕ .\nAsteroids populating the belt are 2.5-3 astronomical units (AU) away from the Sun.\n2. Mass of the Kuiper belt is around 1027 g ∼ M⊕ . Its asteroids are at the distance of\n40-60 AU from the Sun.\n3. The Oort cloud is located on the Solar system border (more than 100 AU), and its\nmass estimations are rather vague.\nAs is known, probability to collide with a heavenly body is in direct proportion with its\nsurface area. Total mass of the asteroids is comparable with mass of the Earth, but since\n∗\n\ne-mail: shatskiy@asc.rssi.ru\n\n1\n\n\fAlexander Shatskiy\n\n\"Primordial black holes and asteroid danger\"\n\nthere are so many of them, their overall surface area appears to be almost equal to the value\nfor the Sun. Besides, there is one more factor which increases the collision probability. An\nasteroid mass is considerably smaller than that of the Sun. This implies that collision with\na PBH should not be necessarily direct to change the asteroid's trajectory. In order to\naccomplish this, the PBH should only be gravitationally scattered on the asteroid, i.e. it\nshould pass by the asteroid at some distance. This phenomenon increases the probability\nfor a PBH and an asteroid to interact as much as for several orders of magnitude.\nThus, PBHs interact much more probably with asteroids than with the planets or even\nthe Sun.\n\n2\n\nProbability to find a PBH in the Solar system\n\nAccording to our hypothesis we suppose that PBHs are responsible for almost entire\nmass of our Galaxy. Simply put, we set the same mass mpbh for every PBH (in a more\ncomplicated case one can just introduce a distribution function of the PBH mass mpbh ).\nThe PBH concentration in the Galaxy is npbh = ρgal /mpbh , where ρgal ≈ 10−24 g/cm3\nis the average mass density in the Galaxy.\nTherefore, the frequency of the Solar system – PBH collisions is\nν0 = πRa2 v ρgal /mpbh ,\n\n(1)\n\nwhere Ra is the average radius of an asteroid orbit, and v is the average asteroid velocity\nin the Galaxy (at infinity with respect to the Solar system).\n\n3 Probability for a PBH to collide with an asteroid\nLet the total mass of the asteroids be Mast . Density of an asteroid is usually in the\nfollowing range: ρast = 2 ÷ 7 g/cm3 . Asteroid sizes cover a large interval, with most\nof the rocks having less than 1 km in diameter and smaller size asteroids being more\nabundant. Since small asteroids do not result in significant impact, they are not interesting\nto deal with. So it makes sense to consider asteroids bigger than some critical size, e.g.\nDast ∼ 100m. One can estimate their number as\nNast =\n\nγast * Mast\n3 ,\nρast * Dast\n\n(2)\n\nwhere γast is a mass fraction of the asteroids bigger than Dast in diameter.\nThe frequency ν of the PBH – asteroid interaction is obtained by multiplying the\nfrequency ν0 by the probability ν1 for the PBH to interact with a Solar system asteroid,\nwhich is\nν1 = Sast /(πRa2 ) , Sast = Nast * πh2 ,\n(3)\nwhere h is the maximum impact parameter when the PBH changes significantly the asteroid trajectory.\nHence, using eq. (1) we obtain:\nν=\n\nπ γast ρgal Mast v h2\n.\n3\nmpbh ρast Dast\n\nThe quantity h is to be calculated in the next section.\n\n2\n\n(4)\n\n\fAlexander Shatskiy\n\n\"Primordial black holes and asteroid danger\"\n\n4 Abrupt change of asteroid orbits due to scattering on PBHs\nWith the PBH – asteroid interaction being the classical two-body problem, it is more\nconvenient to solve it in the center of mass frame.\nIn this reference frame, it is convenient to introduce the following notation1 :\nm = mast mpbh /(mast + mpbh ) is the reduced mass,\nP = m v is the reduced mass momentum in the center of mass frame,\nL = m vh is the angular momentum of the PBH – asteroid system,\nr0 is the minimal distance between the PBH and the asteroid,\nU0 = G mpbh mast /r0 is an absolute value of the gravitational interaction energy in the\norbit's perihelion,\nE = 12 m v 2 is the total energy of the system,\nA = U0 /(2E) = G (mpbh + mast )/(r0 v 2 ) is a dimensionless scattering parameter,\nB = r0 /h is the ratio of the minimal distance to the impact parameter.\nSubtracting the zeroth order π and taking into account relations between the orbit\nparameters, we obtain the angle of the momentum deflection after the PBH has been\nscattered by the asteroid [3]:\n\u0014\n\n\u0015\n\n−A\n∆φ = 2 arccos [1] − 2 arccos\n−π.\n1+A\n\n(5)\n\nAs for B, the calculation yields:\n\n1\n.\n1 + 2A\nIn the center of mass frame, the change of the momentum is 2 :\nB2 =\n\n(6)\n\n(∆P )2 = 2P 2 * [1 − cos(∆φ)] .\n\n(7)\n\nUsing the simple trigonometry and eqs. (5) and (7), we obtain:\n∆P = P *\n\n2A\n2 G m (mpbh + mast )\n≈ 2P A =\n.\n1+A\nr0 v\n\n(8)\n\nIn the Galaxy the PBH average velocity is comparable to the star velocity dispersion: v ≈ 300 km/s. Therefore, the total energy E of the system is much more than the\ngravitational interaction energy: E >> U0 , hence, A << 1, B ≈ 1.\nThe condition of the crucial alteration of the asteroid orbit is equality between the\ninitial asteroid momentum, Past = mast vast , and the gained momentum ∆P within an\norder of magnitude:\n2P A\n,\n(9)\nαPast = α mast vast = ∆P =\n1+A\np\n\nwhere, according to eq. (7), the parameter α = 2(1 − cos ∆φ) reflects how strongly the\nasteroid is affected.\nTaking\np into consideration that the asteroid velocity on a circular orbit of radius R is\nvast = GM⊙ /R and making use of eq. (9), we obtain the exact expression for h2 , the\nmass of asteroid influence having been taken care of:\n\n\n1\n2\n\n4 G m2pbh R\nh2 = 2 2\n* 1 −\nα v M⊙\n\nα(mpbh + mast )vast\n2mpbh v\n\n!2 \n,\n\nHere, G is the gravitation constant, M⊙ is mass of the Sun, M⊕ is mass of the Earth.\nAn absolute value of the momentum change is the same both for the asteroid and the PBH.\n\n3\n\n(10)\n\n\fAlexander Shatskiy\n\n\"Primordial black holes and asteroid danger\"\n\nor\nh≈\n\n\u0012\n\nmpbh\nα M⊕\n\n\u0013 s\n\n*\n\nR\n* 800 km ,\nRast\n\n(11)\n\nwhere Rast ≈ 1015 cm is the average distance to the Kuiper belt.\nUsing this last but one expression, we obtain for A:\nA≈α\n\ns\n\nG M⊙\n*\n4 v2 R\n\nmpbh + mast\nmpbh\n\n!\n\n<< 1\n\n(at mpbh > mast ) .\n\n(12)\n\nThis last expression validates the above-made assumption on A's being small for most\nasteroids of the Kuiper belt.\nEqs. (3) and (10) yield the probability for an asteroid to be deflected by a PBH\nprovided the latter has gotten into the Solar system:\nν1 ≈\n\n4Gm2pbh γast Mast\n3\nα2 v 2 M⊙ Rast ρast Dast\n\n≈\n\n2 * γast * m2pbh * (100m)3\n\n(13)\n\n3\nα2 * M⊕2 * Dast\n\nSubstituting eq. (10) to eq. (4), we obtain the frequency of significant orbit deviations\nfor big asteroids:\n4 π G γast ρgal Mast R mpbh\nν≈\n.\n(14)\n3 v\nα2 M⊙ ρast Dast\n\n5\n\nConclusion\n\nIt is convenient to rewrite the final expression for the frequency of the events under\nconsideration as follows:\nν≈\n\n10−7 ys−1\nα2\n\n! \u0012\n\n*\n\nmpbh\nM⊕\n\n\u0013 \u0012\n\n*\n\nMast\nM⊕\n\n\u0013\n\n1/3\n\n*\n\nγast 100m\nDast\n\n!3 \u0012\n\n*\n\nR\nRast\n\n\u0013\n\n,\n\n(15)\n\nThe last three factors in formula (15) are of the order of unity, so that the final expression\nonly depends on the distribution and total mass of PBHs in the Galaxy.\nEstimating the fraction of asteroids hitting the Earth itself is quite difficult. This is\ndue to the fact that, even if the asteroid does not hit some planet, very probably it will\nnot leave the Solar system. Its orbit now crosses orbits of planets and other asteroids\nand becomes more dangerous. So sooner or later the asteroid itself or secondary asteroids\n(produced by the very first one) fall onto the planets.\nThus, the probability for the scattered asteroid to hit the Earth can be roughly estimated as the ratio of the Earth surface area to the total surface area of the other planets.\nIt yields approximately ∼ 10−2 . Hence, it does not seem improbable that formula (15)\nmay give hit periods of about 190 million years, which is consistent with observational\ndata.\nIf the hypothesis analyzed in this paper is correct, modern methods aimed at averting\nthe asteroid danger appear to be inefficient. This is related to the fact that their main\nidea is revealing big meteors and asteroids with dangerous orbits and, then, monitoring\nthese bodies. However, if the main danger consists in abrupt changes of asteroidal orbits (because of scattering on a PBH), revealing potentially dangerous bodies is hardly\npossible.\n\n4\n\n\fAlexander Shatskiy\n\n6\n\n\"Primordial black holes and asteroid danger\"\n\nAcknowledgements\n\nThe online materials from the site http://www.ASTROLAB.ru have been used by the\nauthor while working on this paper.\n\nReferences\n[1] Goncharov, G., and Orlov, V., Astron. Rep. 47, No11, p.925, (2003)\n[2] Carr, B.J., E-print arXiv: astro-ph/0511743v1, (2005)\n[3] Landau, L.D., and Lifshitz, E.M., \"Mechanics\", Pergamon, Oxford, (1975)\n\n5\n\n\f"}