{"id": "http://arxiv.org/abs/0912.3889v1", "guidislink": true, "updated": "2009-12-19T11:48:44Z", "updated_parsed": [2009, 12, 19, 11, 48, 44, 5, 353, 0], "published": "2009-12-19T11:48:44Z", "published_parsed": [2009, 12, 19, 11, 48, 44, 5, 353, 0], "title": "The nature of the recent extreme outburst of the Herbig Be/FU Ori binary\n  Z CMa", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0912.2992%2C0912.5241%2C0912.1483%2C0912.2014%2C0912.4480%2C0912.1391%2C0912.1751%2C0912.5324%2C0912.3740%2C0912.3210%2C0912.5349%2C0912.4782%2C0912.2830%2C0912.3439%2C0912.3401%2C0912.1000%2C0912.0008%2C0912.2217%2C0912.4972%2C0912.1480%2C0912.1642%2C0912.3820%2C0912.1152%2C0912.5481%2C0912.0803%2C0912.4777%2C0912.2613%2C0912.1820%2C0912.4042%2C0912.4341%2C0912.5322%2C0912.1917%2C0912.4901%2C0912.1397%2C0912.0057%2C0912.2443%2C0912.1100%2C0912.0764%2C0912.3023%2C0912.2287%2C0912.1858%2C0912.4555%2C0912.3574%2C0912.4338%2C0912.2789%2C0912.0754%2C0912.2692%2C0912.0931%2C0912.2885%2C0912.0510%2C0912.5100%2C0912.4479%2C0912.0408%2C0912.3019%2C0912.0197%2C0912.3246%2C0912.5145%2C0912.3315%2C0912.1208%2C0912.5513%2C0912.0184%2C0912.1503%2C0912.2870%2C0912.0735%2C0912.2028%2C0912.4775%2C0912.0369%2C0912.0494%2C0912.1057%2C0912.1286%2C0912.0654%2C0912.5502%2C0912.3319%2C0912.0943%2C0912.4912%2C0912.0363%2C0912.2806%2C0912.2735%2C0912.2673%2C0912.0271%2C0912.0175%2C0912.2378%2C0912.4751%2C0912.2152%2C0912.2481%2C0912.0112%2C0912.4104%2C0912.2415%2C0912.5035%2C0912.3858%2C0912.4072%2C0912.2587%2C0912.1765%2C0912.3889%2C0912.3884%2C0912.3727%2C0912.4521%2C0912.3296%2C0912.5436%2C0912.1121%2C0912.0290&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The nature of the recent extreme outburst of the Herbig Be/FU Ori binary\n  Z CMa"}, "summary": "Z CMa is a binary system which consists of two young stars: A Herbig AeBe\ncomponent \"Z CMa NW\" embedded in a dust cocoon and a less massive component \"Z\nCMa SE\", which is classified as a FU Orionis type star. Recently, the system\nshowed the largest outburst reported during the almost 90 years of available\nobservations. During the recent outburst we detect that the Z CMa system is\npolarized by 2.6% in the continuum and emission line spectrum, with a position\nangle still perpendicular to the jet. From the high level of polarization we\nconclude that the outburst is associated with the dust embedded Herbig AeBe NW\ncomponent. The main result of our studies is that the bolometric luminosity of\nZ CMa remained surprisingly constant during the recent \"outburst\". We conclude\nthat either the geometry of the cavity through which the light escapes from the\ncocoon has opened a new path, or that the screen of dust, which reflects the\nlight toward the observer became more efficient causing the observed increase\nof the visual brightness by about 2.5 magnitudes.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0912.2992%2C0912.5241%2C0912.1483%2C0912.2014%2C0912.4480%2C0912.1391%2C0912.1751%2C0912.5324%2C0912.3740%2C0912.3210%2C0912.5349%2C0912.4782%2C0912.2830%2C0912.3439%2C0912.3401%2C0912.1000%2C0912.0008%2C0912.2217%2C0912.4972%2C0912.1480%2C0912.1642%2C0912.3820%2C0912.1152%2C0912.5481%2C0912.0803%2C0912.4777%2C0912.2613%2C0912.1820%2C0912.4042%2C0912.4341%2C0912.5322%2C0912.1917%2C0912.4901%2C0912.1397%2C0912.0057%2C0912.2443%2C0912.1100%2C0912.0764%2C0912.3023%2C0912.2287%2C0912.1858%2C0912.4555%2C0912.3574%2C0912.4338%2C0912.2789%2C0912.0754%2C0912.2692%2C0912.0931%2C0912.2885%2C0912.0510%2C0912.5100%2C0912.4479%2C0912.0408%2C0912.3019%2C0912.0197%2C0912.3246%2C0912.5145%2C0912.3315%2C0912.1208%2C0912.5513%2C0912.0184%2C0912.1503%2C0912.2870%2C0912.0735%2C0912.2028%2C0912.4775%2C0912.0369%2C0912.0494%2C0912.1057%2C0912.1286%2C0912.0654%2C0912.5502%2C0912.3319%2C0912.0943%2C0912.4912%2C0912.0363%2C0912.2806%2C0912.2735%2C0912.2673%2C0912.0271%2C0912.0175%2C0912.2378%2C0912.4751%2C0912.2152%2C0912.2481%2C0912.0112%2C0912.4104%2C0912.2415%2C0912.5035%2C0912.3858%2C0912.4072%2C0912.2587%2C0912.1765%2C0912.3889%2C0912.3884%2C0912.3727%2C0912.4521%2C0912.3296%2C0912.5436%2C0912.1121%2C0912.0290&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Z CMa is a binary system which consists of two young stars: A Herbig AeBe\ncomponent \"Z CMa NW\" embedded in a dust cocoon and a less massive component \"Z\nCMa SE\", which is classified as a FU Orionis type star. Recently, the system\nshowed the largest outburst reported during the almost 90 years of available\nobservations. During the recent outburst we detect that the Z CMa system is\npolarized by 2.6% in the continuum and emission line spectrum, with a position\nangle still perpendicular to the jet. From the high level of polarization we\nconclude that the outburst is associated with the dust embedded Herbig AeBe NW\ncomponent. The main result of our studies is that the bolometric luminosity of\nZ CMa remained surprisingly constant during the recent \"outburst\". We conclude\nthat either the geometry of the cavity through which the light escapes from the\ncocoon has opened a new path, or that the screen of dust, which reflects the\nlight toward the observer became more efficient causing the observed increase\nof the visual brightness by about 2.5 magnitudes."}, "authors": ["T. Szeifert", "S. Hubrig", "M. Schöller", "O. Schütz", "B. Stelzer", "Z. Mikulásek"], "author_detail": {"name": "Z. Mikulásek"}, "author": "Z. Mikulásek", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361/200913704", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0912.3889v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0912.3889v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "letter to A&A, accepted 17/12/2009", "arxiv_primary_category": {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0912.3889v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0912.3889v1", "journal_reference": null, "doi": "10.1051/0004-6361/200913704", "fulltext": "c ESO 2018\n\nAstronomy & Astrophysics manuscript no. ZCMaLetter ̇v5\nSeptember 23, 2018\n\nThe nature of the recent extreme outburst of the Herbig Be/FU Ori\nbinary Z CMa⋆\n\narXiv:0912.3889v1 [astro-ph.SR] 19 Dec 2009\n\nT. Szeifert1 , S. Hubrig2 , M. Schöller3 , O. Schütz1 , B. Stelzer4 , Z. Mikulášek5\n1\n2\n3\n4\n5\n\nEuropean Southern Observatory, Alonso de Cordova 3107, Casilla 19001, Santiago 19, Chile\ne-mail: tszeifer@eso.org\nAstronomisches Institut Potsdam, An der Sternwarte 16, 14482 Potsdam, Germany\nEuropean Southern Observatory, Karl-Schwarzschild-Str. 2, 85748 Garching, Germany\nINAF-Osservatorio Astronomico di Palermo, Piazza del Parlamento 1, 90134 Palermo, Italy\nDepartment of Theoretical Physics and Astrophysics, Masaryk University, Brno, Czech Republic\n\nSeptember 23, 2018- the date to be modified later\nABSTRACT\n\nContext. Z CMa is a binary system which consists of two young stars: A Herbig AeBe component \"Z CMa NW\" embedded in a dust\ncocoon and a less massive component \"Z CMa SE\", which is classified as a FU Orionis type star. Associated to the binary system\nis a giant parsec size jet. Past spectropolarimetric observations showed that the position angle of the linear optical polarization is\nperpendicular to the jet axis, indicating that the visual light escapes the cocoon via cavities aligned with the jet axis and is then\nscattered back into the line of sight of the observer. Recently, the system showed the largest outburst reported during the almost 90\nyears of available observations.\nAims. We present new spectrophotometric and spectropolarimetric data obtained in 2008 during the recent outburst phase.\nMethods. The data obtained in the visual spectral range at medium spectral resolution were used to study the geometry of the system\nfrom the linear polarization spectra and its magnetic field from the circular polarization spectra.\nResults. During the recent outburst we detect that the Z CMa system is polarized by 2.6% in the continuum and emission line\nspectrum, with a position angle still perpendicular to the jet. From the high level of polarization we conclude that the outburst is\nassociated with the dust embedded Herbig AeBe NW component. The deep absorption components of the Balmer lines in the velocity\nframe extending from zero velocity reaching a wind velocity of ∼700 km s−1 , together with the absence of a red-shifted broad emission\nat similar velocities, indicate a bi-polar wind. We do not detect a significant mean longitudinal magnetic field during the outburst, but\nthe data obtained in 2004 indicates the possible presence of a rather strong magnetic field of the order of ∼1 kG. However, we\ncritically review the applied method of magnetic field measurements in the presence of a strong stellar wind. The main result\nof our studies is that the bolometric luminosity of Z CMa remained surprisingly constant during the recent \"outburst\". We\nconclude that either the geometry of the cavity through which the light escapes from the cocoon has opened a new path, or\nthat the screen of dust, which reflects the light toward the observer became more efficient causing the observed increase of the\nvisual brightness by about 2.m 5.\nKey words. Stars: individual: Z CMa - Stars: pre-main sequence, winds, outflows, magnetic fields, variable: general, binaries: close\n\n1. Introduction\nZ CMa (HD 51370) is a young visual binary system consisting\nof a 12 M⊙ Herbig AeBe star and a 3 M⊙ FU Ori companion at\nan age of 0.3 Myr (e.g. Alonso-Albi et al. 2009). Both components are surrounded by active accreting disks. Associated\nwith the binary system is a giant parsec size jet (Poetzel et\nal. 1989). First evidence for the binarity was an elongation of\nthe K-band image of this star toward the northwest (Leinert &\nHaas 1987 and Koresko et al. 1989). The binary was resolved\nby Koresko et al. (1991) with near-IR speckle interferometry.\nThe angular separation of the binary was only ∼0.′′ 1 with a position angle of 120◦ . At that time the south-eastern (Z CMa SE)\ncomponent was dominant in the visual spectral range and nearinfrared J and H bands, while the north-western component was\nfound brighter at 2.2 μm and longer wavelengths. Thiébaut et al.\n\n(1995) resolved the binary system with speckle interferometry\nat 730 nm and 656 nm. From the data obtained in the quiescent\nstate in 1989.84 the authors deduced L = 1300 L⊙ , R = 13 R⊙\nand T eff =10000 K for the Z CMa SE FU Ori component and L =\n2400 L⊙ , R = 1690 R⊙ , and T BB = 980 K for the near infrared\nZ CMa NW component. The authors attributed the excess flux\nassociated with Z CMa NW at optical wavelengths to scattered\nlight, arguing that photons originating from the hidden central\nsource are scattered back into the line of sight. Scattering of the\nphotons is assumed to take place along the walls of a cavity (usually ascribed to a strong bipolar outflow) evacuated within the\nenvelope. Radio observations in 2005 and 2006 in the cm and\nmm range suggest that we see Z CMa NW at an inclination of\n30◦ (Alonso-Albi et al. 2009). This means that we do not observe\nthe inner walls of the bipolar cavity within the dusty envelope,\nwhere the photons are scattered.\n\nSend offprint requests to: Thomas Szeifert\n⋆\nBased on observations made with ESO Telescopes at the Paranal\nObservatories under programme IDs: 074.C-0442, 081.C-0410, and\n282.C-5041.\n\nThe scattered light scenario is well consistent with optical\nspectropolarimetric observations of Whitney et al. (1993), who\ndetected in 1991–1992 a significant linear polarization of 1%\nto 2% in the continuum and up to 6% in the strong emission\n\n\f2\n\nSzeifert et al.: The nature of the recent extreme outburst of the Herbig Be/FU Ori binary Z CMa\n\nFig. 1. Light curve of Z CMa over the last decades. Open symbols denote the observations from American Associations of\nVariable Stars Observers (AAVSO). The filled symbols correspond largely to the ASAS data and during the peak of the\nlightcurve to our measurements (blue asterisks). Epochs of\nNACO observations, the high resolution images as summarized\nby Thiébaut et al. (1995) and the epoch of spectropolarimetric\nobservations (arrows) are indicated on the top.\n\nlines. The different polarization of continuum and lines have led\nWhitney et al. (1993) to suggest that the emission lines have their\norigin in the Z CMa NW component. At that time the NW component contributed about 20% of the flux of the whole system\nat visible wavelength. The Z CMa SE component is assumed to\nbe unpolarized, the NW component is assumed to show 6% linear polarization and the composite spectrum of the binary would\nthen depend on the flux ratio at the respective wavelength. The\nposition angle of the polarization of 150◦ in November 1991 and\n154◦ in March 1992 was roughly perpendicular to the 3.6 parsec scale jet of Z CMa at a position angle of 60◦ , discussed by\nPoetzel et al. (1989). The same authors reported several velocity\ncomponents in the jet of which the fastest knots reaches a velocity of about −620km s−1 . This position angle of polarization\nindicates that the light from the Z CMa NW component primarily escapes from the envelope by scattering off the walls of a\njet-blown cavity. A smaller scale jet with a similar position angle was recently discovered in X-rays by Stelzer et al. (2009).\nAccording to photometric and visual observations available\nfrom various archives, Z CMa exhibited recently the largest outburst reported during the almost 90 years of available observations. The light-curves presented in Fig. 1 were extracted from\nthe archives of the \"All Sky Automated Survey\" (ASAS) rejecting the data points with quality flags C and D (Pojmanski\n2002). More data over a larger time span were retrieved from the\nAAVSO data base. For the later visual estimates the data points\ntaken for a given month were averaged after clipping data points\nbeyond a 2σ threshold. Irregular variability was observed in the\nthirties of the last century. Later Z CMa steadily increased its\nbrightness, reaching a phase of constant brightness until about\n1973. Since then the star was fading from almost 9m in 1973\nto 10.m 5 in 2007. Superimposed to the fading lightcurve we can\nidentify in Fig. 1 several more recent outbursts, the most prominent ones were observed in 1987 and 2000 with a duration similar to that of eruptions of EX Lupi-type (EXors) young stars.\nBetween 2002 and 2006 the light-curve appeared very irregular.\nA gradual increase of the visual brightness started at the end of\n2007, reaching the highest brightness between November 2008\nand May 2009. This bright phase has now ended, with the latest\n\nFig. 2. Spectrophotometric flux of Z CMa in 2004 (lower spectrum) and 2008 (upper spectrum).\n\nFig. 3. Spectropolarimetry of Z CMa in Hγ .\nobservations reporting a visual brightness fainter than 10m after\na very rapid decline.\nIn this letter we present new optical spectropolarimetric observations of linear and circular polarization in the Z CMa system, obtained during the recent outburst, and discuss the cause\nfor this outburst.\n\n2. Results and Discussion\n2.1. Spectroscopy and Linear Polarization\n\nThe spectropolarimetric data sets provide very important insights into the nature of the at visual wavelengths unresolved\nbinary star. We found significant changes of the line shapes in\nthe linearly polarized light with respect to the data published\nby Whitney et al. (1993). In our data obtained during the extreme outburst, we see a flat polarization spectrum with an average polarization P=2.6% ±0.1% at 4350Å at a position angle\nof 160◦ ± 1◦ . This polarization angle is roughly perpendicular\nto the parsec scale jet associated with Z CMa, and similar to observations presented by Whitney et al. (1993) who measured in\nNovember 1991 P = 2.0%, P.A = 150◦ ± 1.5◦ and four months\nlater P = 1.4%, P.A = 154◦ ± 1.5◦ . However, in the deep absorption troughs of the Balmer lines and other strong wind absorption lines, we detect depolarization signatures (see Fig. 3). These\nline components caused by the accelerated wind show a composite spectrum: We observe a broad blue trough typically associated with an accelerated wind, visible to about −600 km s−1 ,\nwith less deep absorption up to about −800 km s−1 . As is shown\nin more detail in Fig. 4, this is not mirrored by emission on the\n\n\fSzeifert et al.: The nature of the recent extreme outburst of the Herbig Be/FU Ori binary Z CMa\n\nFig. 4. Logarithmic spectral shape of the Balmer lines Hα to H9 .\nThe variability is most pronounced in the absorption troughs and\nfor Hα in the symmetric electron scattered broad wings.\nred side of the lines as would be expected for spherical symmetric winds. The trough is rather deep, indicating that a large\nfraction of the stellar disk is obscured by the wind acceleration zone. Superimposed to the wind feature is a very narrow\nemission component of 50 to 60 km s−1 half width, which can\nbe seen as well for faint low excitation lines like of Fe ii and\nsimilar species. In contrast to the observations of Whitney et al.\n(1993), we find that the narrow emission lines show the same degree (2.6%) and position angle of polarization as the continuum.\nThese observations can be understood within the above mentioned model that the visible light can only escape via cavities\nfrom the dust cocoon, most likely aligned with the bi-polar jet\nand a changing flux ratio between the two stars: In our recent observations the continuum radiation as well as the emission components are dominated by the NW component, while only in the\ndeep absorption troughs the unpolarized SE component is still\ncontributing. Whitney et al. (1993) observed the binary in a different state, when the unpolarized SE component dominated the\nflux in the near-UV and visual. The strongest emission lines primarily emitted by the NW-component reached up to a polarization of about 6%. This high value must be seen as the degree of\npolarization of the NW-component at all wavelength and accordingly the polarization of the NW-component was higher at that\ntime than what we see now in the visual and near-UV continuum.\nThe change of the degree of polarization of the NW component\nfrom 6% at a low state to 2.6% at the brightest state, together\nwith the brightening of the target indicates that the geometry of\nthe cavity through which the light escapes from the cocoon has\nopened a new path, or that the screen of dust, which reflects the\nlight toward the observer, became more efficient, causing an increase in the visual brightness by about 2.m 5. In the strongest\nBalmer lines the absorption trough presents a double plateau\nwith the deepest depolarization starting at the terminal wind velocity of about −600 km s−1 and ending at about −200 km s−1 .\nAt red-shifted wavelengths the NW component dominates the\ncomposite spectrum. It is possible to explain the double plateau\non the blue-shifted side, if the spectrum of the SE component is\nthat of a fast rotator with hydrogen absorption lines such that the\n\n3\n\nFig. 5. Circular polarization in the Balmer line spectra observed\nin November 2004 (on the bottom) together with the spectral\ngradients dI/dλ. The spectra are plotted in the velocity frame to\ndisplay Balmer lines from 4861 Å to 3734.370 Å. Both curves\nindicate that the s-shaped profiles of the high-n Balmer lines are\nnot centered at the rest frame wavelengths. For the low-n Balmer\nlines, in this figure strongly deviating in dI/dλ from the high-n\nprofiles, the peak of the emission is close to the rest frame wavelength. Accordingly the spectral gradient is zero at the rest frame\nwavelength and doesn't correlate with the Stokes V profile.\ncontribution of the SE component to the composite spectrum is\nsmaller from −200 to 0 km s−1 at wavelengths. Other line species\nwhich show depolarization signals in the blue-shifted parts of\nline profiles are calcium lines in which the depolarization signal\ncan only be seen at v < −200 km s−1 and the Fe ii-lines, which do\nnot present the deep absorption troughs in the flux spectrum, but\nshow a double absorption feature in the linear polarization with\nan absorption at the velocity of the fast wind and another absorption at the system velocity. For the later we can not conclude if\nthe depolarization has an intrinsic origin in the NW component,\nor if the presumed young FU Ori star contributes unpolarized\nline emission to the composite spectrum.\nWe note that the depth and the width of the absorption at\nthe blue-shifted side of the Balmer lines, in absence of a broad\n600 km s−1 red-shifted emission, indicates a bipolar geometry of\nthe wind. If no such broad red emission is observed, then it can\nbe argued that either there is no gas streaming out except out\nof the polar region, or that the recombination radiation in the\nline is not visible through the cavities, but blocked by the disk\nor cocoon. For the Hα line we find however a broad emission\ncomponent beyond the velocity of the wind absorption feature.\nThe Hα absorption trough is not as deep as for other Balmer\nlines. This broad component is caused by electron scattering as\nis often seen in luminous hot stars and therefore not related to\nhigh velocity outflows.\nThe spectral slope as indicated in Fig. 2 appears redder during the recent outburst, which contradicts an increase of temperature as source of the luminosity change as proposed by van den\nAncker et al. (2004). Similarly, the very insignificant change of\nthe depth of the Balmer jump would argue against a dramatic\nchange of stellar parameters.\n2.2. Circular Polarization\n\nThe analysis of circular polarization measurements obtained\nduring the outburst reveals no significant detection. In the data\n\n\f4\n\nSzeifert et al.: The nature of the recent extreme outburst of the Herbig Be/FU Ori binary Z CMa\n\nobtained in May 2008 we detect a weak signal of circular polarization in the trough of all Balmer lines, which however does\nnot match in wavelength the unpolarized line profile. However,\nwhile reviewing the archive data already published by Wade et\nal. (2007) we do detect a clear circular polarization signal in particular at the blue shifted side of the high-n Balmer lines. For the\nlow excitation lines from Hβ to Hǫ we measure −160 ± 84 G,\nwhile from the higher excitation Balmer lines a very significant\nfield of −1231 ± 164 G (see Figs. 5 and 6) was obtained. Still,\nthese results have to be taken with some caution. To properly\ninterpret the circular polarization signal, it is necessary to consider the composite nature of the binary system spectrum, the\nsuperimposed effects of the stellar wind, and the variability of\nthe target. The B-field diagnostics as applied above correlates\nthe s-shaped profile in V/I with the s-shaped profile of the spectral gradient dI/dλ of the Voigt profiles. The B-field diagnostics\nmay, for instance, be disturbed by the light of the companions,\nand, in particular, by the stellar wind features due to the spectral\ngradient dI/dλ along the x-axis of the diagnostic diagram (see\nFigs. 5 and 6). It should as well be considered that the target\nis variable on very short time scales, such that spectra may have\nchanged between the respective exposures at ±45◦ .\nIt is as well unclear if these fields were detected in the dust\nembedded Herbig Ae star or in the SE companion. In the first\ncase the strong field is only seen in the fainter Balmer lines,\nbecause the high opacity of the expanding wind at the blue\nshifted part of the strong lines would not allow light from the\nphotosphere to escape from the NW component. Alternatively,\nwithout any indication of the contribution of the respective two\nstars to the UV and visible spectra, one can as well explain the\ndata if the magnetic field was detected in the SE component.\nThis component may have dominated the spectra of 2004 in the\nwavelength range of the Balmer lines where we measure the\nStokes V features, whereas later in May 2008, the contribution\nof Z CMa SE became insignificant on the blue-shifted side of the\nP Cygni line of Z CMa NW such that we detect a hint of circular\npolarization in the red-shifted part of the hydrogen lines only,\nbut no S-shaped feature, which would lead to a magnetic field\ndetection. Nor would the wind dominated spectral line gradients\ndI/dλ linearly correlate with V/I. With the few available spectra it is not yet possible to reliably conclude on the origin of the\nfeatures in the circular polarization spectrum.\n\nThe apparently insignificant change of the K-band thermal\nemission rather argues against the strongly increased luminosity of 3 × 105 L⊙ during short outbursts, as estimated by van\nden Ancker et al. (2004) from the visual SEDs with respect to\nonly L = 2400 L⊙ estimated by Thiébaut et al. (1995) from the\nSED including the thermal emission. It rather underlines our interpretation that the bolometric luminosity during the outbursts\nremains constant, but the amount of visible light transmitted\nthrough the envelope has changed. The derived high luminosity was primarily a consequence of the early spectral type estimated for the NW source from the He i and O i lines, which\nlead to very high bolometric and extinction corrections. We detect these lines with blue shifted broad absorption profiles and\nwith P Cygni profiles respectively, both indicating an origin of\nthe lines in the accelerated wind rather than in the photosphere\nof the NW component. The wind however, with indication of\nbipolarity and eventually with indications for a magnetic field,\nmay well be excited by other sources rather than by the thermal\nradiation from the star. The short-term outbursts are nevertheless superimposed to long-term FU Ori like changes in the visual brightness, with a slow brightening by one magnitude until\nabout 1970 and a subsequence fading by a similar amount. It is\nwell possible that any of the binary components contributes to\nthese changes.\n\n3. Summary\nWe have shown that the NW component of Z CMa was undergoing a historically bright outburst in 2008/2009. Our polarimetric\ndata supports a variable scattering geometry of the NW envelope as the cause for the optical outburst, rather than FU Ori or\nEXor events from the SE component. From the changes in the\nlinear polarization spectra taken at the outburst phase we conclude that the scattering path in which the light of Z CMa NW\nescapes from the dust cocoon must have changed. The linear\npolarization from the now dominant NW component was found\nsmaller than the 6% estimated at the fainter phase in 1991. We\ndo not find changes in the K-band magnitude in contrast to the\nrecent change of 2.m 5 in the visual. A significant fraction of the\nvariability may be explained by the changed, more direct line of\nsight in which we now see the Z CMa NW: More light from the\ncentral source would reach the observer through a widened cavity, while the central source directly observed in the K-band did\nnot significantly change in luminosity.\n\n2.3. Origin of the Outbursts\n\nDespite of the different origin of the NIR Ks band flux from\nthe surrounding dust cocoon and the optical flux with an origin\nfrom the pole of the star, we presume that a strongly changed\noptical/UV source would heat up the dust and the increase of\nthe luminosity of the stellar core would be re-emitted by thermal\nradiation in the Ks-band and beyond. There is however no significant change of the Ks-band flux as far as we can tell from the\nK-band flux ratios given in Table .2 or from comparing the most\nrecent report of infrared observations by Antoniucci et al. (2009)\nof Ks= 3.56 at the peak of the lightcurve in March 2009, with\nKs= 3.79 reported by Koresko et al. (1991). Similarly there is no\nchange in the X-ray properties reported by Stelzer et al. (2009)\nin respect to earlier measurement at a 'quiescent' phase. If the\nshort-term optical brightening was an EXor-like accretion event,\nX-ray variability would have been expected. Our polarimetric\ndata leads to a new interpretation in which the X-ray emission\nassociated with the binary may be attributed to the lower-mass\nSE component which is not involved in the outburst.\n\nAcknowledgements. We acknowledge with thanks the variable star observations from the AAVSO International Database contributed by observers worldwide and used in this research. This work profited greatly from data extracted from the ASAS data base. Based on observations made with the\nEuropean Southern Observatory telescopes obtained from the ESO/ST-ECF\nScience Archive Facility.\n\nReferences\nAntoniucci, S., Arkharov, A.A., Giannini, T., et al. 2009, ATel #2024\nAppenzeller, I., Fricke, W., Fürtig, W., et al. 1998, Messenger, 94, 1\nAlonso-Albi, T., Fuente, A., Bachiller, R., et al. 2009, A&A, 497, 117\nBagnulo, S., Szeifert, T., Wade, G.A., et al. 2002, A&A, 389, 191\nGarcia, P.J.V., Thiébaut, E., Bacon, R. 1999, A&A, 346, 892\nKoresko, C.D., Beckwith, S.V.W., Sargent, A.I. 1989, AJ, 98, 1394\nKoresko, C.D., Beckwith, S.V.W., Ghez, A.M., et al. 1991, AJ, 102, 2073\nLeinert, C., & Haas, M. 1987, A&A, 182, L47\nLenzen, R., Hartung, M., Brandner, W., et al. 2003, SPIE, 4841, 944\nMillan-Gabet, R., & Monnier, J.D. 2002, ApJ, 580, L167\nPoetzel, R., Mundt, R., Ray, T.P. 1989, A&A, 224, L13\nPojmanski, G. 2002, Acta Astronomica, 52, 397\nStelzer, B., Hubrig, S., Orlando, S., et al. 2009, A&A, 499, 529\n\n\fSzeifert et al.: The nature of the recent extreme outburst of the Herbig Be/FU Ori binary Z CMa\nThiébaut, E., Bouvier, J., Blazit, A., et al. 1995, A&A, 303, 795\nvan den Ancker, M.E., Blondel, P.F.C., Tjin A Djie, H.R.E., et al. 2004, MNRAS,\n349, 1516\nWade, G.A., Bagnulo, S., Drouin, D., et al. 2007, MNRAS, 376, 1145\nWhitney, B.A., Clayton, G.C., Schulte-Ladbeck, R.E. 1993, ApJ, 417, 687\n\n5\n\n\fSzeifert et al.: The nature of the recent extreme outburst of the Herbig Be/FU Ori binary Z CMa , Online Material p 1\n\nTable .1. Journal of spectroscopic observations.\nDate\n2004/11/22\n2008/05/22\n2008/12/26\n2008/12/26\n2009/02/23\n2009/03/13\n2009/03/26\n\nInstrument\nFORS 1\nFORS 1\nFORS 1\nFORS 1\nFEROS\nFEROS\nFEROS\n\nλ range [Å]\n3470 - 5870\n3310 - 6200\n3310 - 6200\n3680 - 5120\n3570 - 9210\n3570 - 9210\n3570 - 9210\n\nDetector, grism\nTEK, 600B\nE2V, 600B\nE2V, 600B\nE2V, 1200B\nEchelle\nEchelle\nEchelle\n\nTable .2. Journal of NACO observations. The position angle is\ngiven with respect to the SE component. For the L-band data the\nangular separation and position angle was set to a fixed value to\nobtain a reliable flux ratio.\nYear\n2002/12/05\n2002/12/05\n2002/12/05\n2005/02/16\n2005/02/16\n2005/02/16\n2006/03/13\n2006/03/13\n\nBand\nL\nJ\nKs\nKs\nH\nNB2.17\nNB2.12\nNB2.17\n\nfNW /fS E\n49.57 ±0.15\n0.94 ±0.01\n3.97 ±0.01\n4.7 ±0.01\n2.79 ±0.01\n4.34 ±0.05\n3.63 ±0.01\n3.42 ±0.01\n\nPA [◦ ]\n\nd [′′ ]\n\n309.90\n311.9\n311.43\n310.98\n314.74\n311.93\n312.43\n\n0.107\n0.102\n0.098\n0.114\n0.104\n0.101\n0.101\n\nAppendix A: Observations and Data Reduction\nThe observational material discussed in this section includes\nFORS 1 spectropolarimetric data (Appenzeller et al. 1998) obtained in the framework of our programs carried out in May\n2008 and in December 2008. Additionally, we used ESO archive\ndata from 2004 obtained in circular spectropolarimetric mode.\nThese data were used by Wade et al. (2007) to search for the\npresence of longitudinal magnetic fields in a larger number of\nHerbig AeBe stars. These older observations (see Table .1) were\ncarried out with a slit width of 0.′′ 8 and grism 600B (R ≈ 1000).\nThe flux spectra in the ordinary and extraordinary ray of the\nWollaston prism were extracted for all position angle settings\nof the retarder waveplate. Since there were no available flux calibrators observed for this setup in the respective night, we used\nflux calibrators taken in normal spectroscopic mode without the\nWollaston prism. The new spectropolarimetric data from 2008\nwere obtained with the same instrument, but now equipped with\na higher UV response detector system with a smaller pixel size.\nDuring the December run we have used the higher dispersion\ngrism 1200B in addition to the data with the 600B grism. In\nall our observations the slit width was set to 0.′′ 4 to optimize\nthe resolution for the polarimetric measurements (R ≈ 4000 and\nR ≈ 2000, respectively). The spectrophotometric calibrators retrieved from the archive were observed without polarization optics on different nights. One source of uncertainty in the flux\ncalibration is therefore the unclear spectral response of the wave\nretarder plates, for which we presume a high throughput over the\nfull spectral range. However, significant slit losses are expected\nwith this setup due to the narrow slit widths and the difficult acquisition of the target on the slit considering the extreme brightness of the target for 8 m-class telescopes. To remedy this difficulty related to the absolute calibration, we re-scaled the flux\nat 5500 Å to the monthly average of the AAVSO visual observations of 9.m 4 in November 2004 and 8.4 in December 2008.\nIn Fig. 2 we present spectrophotometric fluxes for the Z CMa\nsystem in 2004 and 2008, respectively. Further, for the proper\ninterpretation of the measured polarization angle, we corrected\n\nFig. 6. Magnetic field measurements using the data obtained in\nNovember 2004. The longitudinal magnetic field is derived foldI\nlowing the equation V/I = −geff Cz λ2 1I dλ\nhBz i from the slope of\nthe linear fit through the data points (see Bagnulo et al. 2002).\nLarge open and small filled symbols are obtained from the high\nnumber and low number Balmer lines, respectively.\nthe result with the chromatic zero angle of the super-achromatic\nhalf wave retarder plate.1 To perform linear polarization measurements, a Wollaston prism and a half-wave retarder plate rotated in 22.5◦ steps between 0 and 67.5◦ were used. For circular\npolarization measurements the quarter-wave retarder plate was\nused at the positions +45◦ and −45◦. Our FORS 1 data were supplemented by three high-resolution FEROS spectra (R=48 000)\nobtained in February and March 2009 to study the behavior of\nhydrogen lines. The journal of spectroscopic observations is presented in Table .1.\nTo better understand the parameters of the resolved binary\nsystem we retrieved all available NACO adaptive optics nearinfrared data (Lenzen et al. 2003) from the ESO archive. As for\nthe FORS 1 data sets, the target is rather bright for imaging mode\nobservations with 8 m-class telescopes and accordingly the various data sets were taken with a mixed choice of neutral density\nand narrow band filters. As a consequence we cannot provide\nabsolute photometry for NACO data with the required level of\nconfidence, but only the flux ratio of the two components (see\nTable .2) and the astrometric parameters of the binary. In case of\nnormal jittered observation sequences we have used the Eclipse\ndata reduction package provided by ESO to NACO users. In\nother cases we had only two acquisition exposures or a few jitter\npositions.\n\n1\nThe data is available on the instrument web\nhttp://www.eso.org/sci/facilities/paranal/instruments/fors/ .\n\npages:\n\n\f"}