{"id": "http://arxiv.org/abs/1011.2496v1", "guidislink": true, "updated": "2010-11-10T21:00:08Z", "updated_parsed": [2010, 11, 10, 21, 0, 8, 2, 314, 0], "published": "2010-11-10T21:00:08Z", "published_parsed": [2010, 11, 10, 21, 0, 8, 2, 314, 0], "title": "Dissecting the Moth: Discovery of an off-centered ring in the HD 61005\n  debris disk with high-resolution imaging", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1011.0925%2C1011.1838%2C1011.5048%2C1011.2993%2C1011.0581%2C1011.3816%2C1011.3811%2C1011.0203%2C1011.0657%2C1011.2025%2C1011.1020%2C1011.5353%2C1011.5962%2C1011.3374%2C1011.5287%2C1011.5247%2C1011.6153%2C1011.3449%2C1011.3875%2C1011.6097%2C1011.1089%2C1011.4838%2C1011.0127%2C1011.1028%2C1011.2289%2C1011.0892%2C1011.6556%2C1011.4298%2C1011.5760%2C1011.3730%2C1011.5057%2C1011.2501%2C1011.3026%2C1011.3847%2C1011.3116%2C1011.4668%2C1011.2677%2C1011.2280%2C1011.0224%2C1011.3320%2C1011.4510%2C1011.6335%2C1011.5162%2C1011.3772%2C1011.2709%2C1011.4777%2C1011.4342%2C1011.0021%2C1011.3724%2C1011.0384%2C1011.6081%2C1011.6328%2C1011.4719%2C1011.4986%2C1011.0211%2C1011.5822%2C1011.4366%2C1011.2062%2C1011.5362%2C1011.1463%2C1011.2296%2C1011.1694%2C1011.2754%2C1011.2496%2C1011.2134%2C1011.2382%2C1011.0627%2C1011.0151%2C1011.3707%2C1011.0210%2C1011.0638%2C1011.2408%2C1011.2272%2C1011.5187%2C1011.3703%2C1011.6569%2C1011.3524%2C1011.1040%2C1011.5792%2C1011.0759%2C1011.1046%2C1011.3120%2C1011.1220%2C1011.2399%2C1011.0986%2C1011.0748%2C1011.4234%2C1011.2681%2C1011.2946%2C1011.0097%2C1011.6370%2C1011.0039%2C1011.3154%2C1011.6258%2C1011.5390%2C1011.0816%2C1011.4845%2C1011.0874%2C1011.5632%2C1011.1957%2C1011.2808&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Dissecting the Moth: Discovery of an off-centered ring in the HD 61005\n  debris disk with high-resolution imaging"}, "summary": "The debris disk known as \"The Moth\" is named after its unusually asymmetric\nsurface brightness distribution. It is located around the ~90 Myr old G8V star\nHD 61005 at 34.5 pc and has previously been imaged by the HST at 1.1 and 0.6\nmicrons. Polarimetric observations suggested that the circumstellar material\nconsists of two distinct components, a nearly edge-on disk or ring, and a\nswept-back feature, the result of interaction with the interstellar medium. We\nresolve both components at unprecedented resolution with VLT/NACO H-band\nimaging. Using optimized angular differential imaging techniques to remove the\nlight of the star, we reveal the disk component as a distinct narrow ring at\ninclination i=84.3 \\pm 1.0{\\deg}. We determine a semi-major axis of a=61.25 \\pm\n0.85 AU and an eccentricity of e=0.045 \\pm 0.015, assuming that periastron is\nlocated along the apparent disk major axis. Therefore, the ring center is\noffset from the star by at least 2.75 \\pm 0.85 AU. The offset, together with a\nrelatively steep inner rim, could indicate a planetary companion that perturbs\nthe remnant planetesimal belt. From our imaging data we set upper mass limits\nfor companions that exclude any object above the deuterium-burning limit for\nseparations down to 0.3\". The ring shows a strong brightness asymmetry along\nboth the major and minor axis. A brighter front side could indicate\nforward-scattering grains, while the brightness difference between the NE and\nSW components can be only partly explained by the ring center offset,\nsuggesting additional density enhancements on one side of the ring. The\nswept-back component appears as two streamers originating near the NE and SW\nedges of the debris ring.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1011.0925%2C1011.1838%2C1011.5048%2C1011.2993%2C1011.0581%2C1011.3816%2C1011.3811%2C1011.0203%2C1011.0657%2C1011.2025%2C1011.1020%2C1011.5353%2C1011.5962%2C1011.3374%2C1011.5287%2C1011.5247%2C1011.6153%2C1011.3449%2C1011.3875%2C1011.6097%2C1011.1089%2C1011.4838%2C1011.0127%2C1011.1028%2C1011.2289%2C1011.0892%2C1011.6556%2C1011.4298%2C1011.5760%2C1011.3730%2C1011.5057%2C1011.2501%2C1011.3026%2C1011.3847%2C1011.3116%2C1011.4668%2C1011.2677%2C1011.2280%2C1011.0224%2C1011.3320%2C1011.4510%2C1011.6335%2C1011.5162%2C1011.3772%2C1011.2709%2C1011.4777%2C1011.4342%2C1011.0021%2C1011.3724%2C1011.0384%2C1011.6081%2C1011.6328%2C1011.4719%2C1011.4986%2C1011.0211%2C1011.5822%2C1011.4366%2C1011.2062%2C1011.5362%2C1011.1463%2C1011.2296%2C1011.1694%2C1011.2754%2C1011.2496%2C1011.2134%2C1011.2382%2C1011.0627%2C1011.0151%2C1011.3707%2C1011.0210%2C1011.0638%2C1011.2408%2C1011.2272%2C1011.5187%2C1011.3703%2C1011.6569%2C1011.3524%2C1011.1040%2C1011.5792%2C1011.0759%2C1011.1046%2C1011.3120%2C1011.1220%2C1011.2399%2C1011.0986%2C1011.0748%2C1011.4234%2C1011.2681%2C1011.2946%2C1011.0097%2C1011.6370%2C1011.0039%2C1011.3154%2C1011.6258%2C1011.5390%2C1011.0816%2C1011.4845%2C1011.0874%2C1011.5632%2C1011.1957%2C1011.2808&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The debris disk known as \"The Moth\" is named after its unusually asymmetric\nsurface brightness distribution. It is located around the ~90 Myr old G8V star\nHD 61005 at 34.5 pc and has previously been imaged by the HST at 1.1 and 0.6\nmicrons. Polarimetric observations suggested that the circumstellar material\nconsists of two distinct components, a nearly edge-on disk or ring, and a\nswept-back feature, the result of interaction with the interstellar medium. We\nresolve both components at unprecedented resolution with VLT/NACO H-band\nimaging. Using optimized angular differential imaging techniques to remove the\nlight of the star, we reveal the disk component as a distinct narrow ring at\ninclination i=84.3 \\pm 1.0{\\deg}. We determine a semi-major axis of a=61.25 \\pm\n0.85 AU and an eccentricity of e=0.045 \\pm 0.015, assuming that periastron is\nlocated along the apparent disk major axis. Therefore, the ring center is\noffset from the star by at least 2.75 \\pm 0.85 AU. The offset, together with a\nrelatively steep inner rim, could indicate a planetary companion that perturbs\nthe remnant planetesimal belt. From our imaging data we set upper mass limits\nfor companions that exclude any object above the deuterium-burning limit for\nseparations down to 0.3\". The ring shows a strong brightness asymmetry along\nboth the major and minor axis. A brighter front side could indicate\nforward-scattering grains, while the brightness difference between the NE and\nSW components can be only partly explained by the ring center offset,\nsuggesting additional density enhancements on one side of the ring. The\nswept-back component appears as two streamers originating near the NE and SW\nedges of the debris ring."}, "authors": ["Esther Buenzli", "Christian Thalmann", "Arthur Vigan", "Anthony Boccaletti", "Gael Chauvin", "Jean-Charles Augereau", "Michael R. Meyer", "Francois Menard", "Silvano Desidera", "Sergio Messina", "Thomas Henning", "Joe Carson", "Guillaume Montagnier", "Jean-Luc Beuzit", "Mariangela Bonavita", "Anne Eggenberger", "Anne Marie Lagrange", "Dino Mesa", "David Mouillet", "Sascha P. Quanz"], "author_detail": {"name": "Sascha P. Quanz"}, "author": "Sascha P. Quanz", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361/201015799", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1011.2496v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1011.2496v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "6 pages, 6 figures. Accepted to Astronomy and Astrophysics letters", "arxiv_primary_category": {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.EP", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1011.2496v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1011.2496v1", "journal_reference": null, "doi": "10.1051/0004-6361/201015799", "fulltext": "c ESO 2018\n\nAstronomy & Astrophysics manuscript no. moth ̇ebuenzli\nAugust 15, 2018\n\nLetter to the Editor\n\nDissecting the Moth: Discovery of an off-centered ring in the\nHD 61005 debris disk with high-resolution imaging⋆\n\narXiv:1011.2496v1 [astro-ph.SR] 10 Nov 2010\n\nE. Buenzli1 , C. Thalmann2 , A. Vigan3 , A. Boccaletti4 , G. Chauvin5 , J.C. Augereau5 , M.R. Meyer1 , F. Ménard5 , S.\nDesidera6 , S. Messina7 , T. Henning2 , J. Carson8, 2 , G. Montagnier9 , J.L. Beuzit5 , M. Bonavita10 , A. Eggenberger5 ,\nA.M. Lagrange5 , D. Mesa6 , D. Mouillet5 , and S. P. Quanz1\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n\nInstitute for Astronomy, ETH Zurich, 8093 Zurich, Switzerland\ne-mail: ebuenzli@astro.phys.ethz.ch\nMax Planck Institute for Astronomy, Heidelberg, Germany\nLaboratoire d'Astrophysique de Marseille, UMR 6110, CNRS, Université de Provence, 13388 Marseille, France\nLESIA, Observatoire de Paris-Meudon, 92195 Meudon, France\nLaboratoire d'Astrophysique de Grenoble, UMR 5571, CNRS, Université Joseph Fourier, 38041 Grenoble, France\nINAF - Osservatorio Astronomico di Padova, Padova, Italy\nINAF - Osservatorio Astrofisico di Catania, Italy\nCollege of Charleston, Department of Physics & Astronomy, Charleston, South Carolina, USA\nEuropean Southern Observatory: Casilla 19001, Santiago 19, Chile\nUniversity of Toronto, Toronto, Canada\n\nreceived 22 September 2010 / accepted 09 November 2010\nABSTRACT\n\nThe debris disk known as \"The Moth\" is named after its unusually asymmetric surface brightness distribution. It is located around the\n∼90 Myr old G8V star HD 61005 at 34.5 pc and has previously been imaged by the HST at 1.1 and 0.6 μm. Polarimetric observations\nsuggested that the circumstellar material consists of two distinct components, a nearly edge-on disk or ring, and a swept-back feature,\nthe result of interaction with the interstellar medium. We resolve both components at unprecedented resolution with VLT/NACO Hband imaging. Using optimized angular differential imaging techniques to remove the light of the star, we reveal the disk component\nas a distinct narrow ring at inclination i = 84.3 ± 1.0◦ . We determine a semi-major axis of a = 61.25 ± 0.85 AU and an eccentricity\nof e = 0.045 ± 0.015, assuming that periastron is located along the apparent disk major axis. Therefore, the ring center is offset from\nthe star by at least 2.75 ± 0.85 AU. The offset, together with a relatively steep inner rim, could indicate a planetary companion that\nperturbs the remnant planetesimal belt. From our imaging data we set upper mass limits for companions that exclude any object above\nthe deuterium-burning limit for separations down to 0.′′ 3. The ring shows a strong brightness asymmetry along both the major and\nminor axis. A brighter front side could indicate forward-scattering grains, while the brightness difference between the NE and SW\ncomponents can be only partly explained by the ring center offset, suggesting additional density enhancements on one side of the ring.\nThe swept-back component appears as two streamers originating near the NE and SW edges of the debris ring.\nKey words. circumstellar matter - planetary systems: protoplanetary disks - Techniques: high angular resolution - Stars: indi-\n\nvidual: HD 61005\n\n1. Introduction\nDust in planetary systems is most likely produced by collisions of planetesimals that are frequently arranged in a ringlike structure (Wyatt 2008). These debris disks are therefore\nthought to be brighter analogs of our solar system's Kuiper belt\nor asteroid belt. Previous studies found no correlation between\nthe presence of known massive planets and infrared dust emission from debris disks (Moro-Martı́n et al. 2007; Bryden et al.\n2009; Kóspál et al. 2009), but several systems are known to\nhost both (e.g. HR 8799, HD 69830). Scattered light imaging\nof debris disks has revealed numerous structures thought to be\nshaped by planets. Warps in the β Pic debris disks (Mouillet et al.\n1997; Augereau et al. 2001) are caused by a directly confirmed\n9 ± 3 MJ planet (Lagrange et al. 2009, 2010; Quanz et al. 2010).\nFomalhaut hosts a debris ring with a sharp inner edge and an\n⋆\nBased on observations collected at the European Southern\nObservatory, Chile, ESO program 0184.C-0567(E)\n\noffset between ring center and star (Kalas et al. 2005), for which\ndynamical models suggest the presence of a planet (Quillen\n2006). A planetary candidate was indeed imaged (Kalas et al.\n2008). Other larger scale asymmetric structures, e.g. around\nHD 32297 (Kalas 2005), are thought to result from interaction with the ambient interstellar medium (ISM), such as movement through a dense interstellar cloud (Debes et al. 2009).\nAlternatively, they might be perturbed by a nearby star (e.g.\nHD 15115, Kalas et al. 2007).\nThe source HD 61005 (G8V, V = 8.22, H = 6.58, d =\n34.5 ± 1.1 pc) was first discovered to host a debris disk by the\nSpitzer/FEPS program (formation and evolution of planetary\nsystems, Meyer et al. 2006). It has the largest 24 μm infrared\nexcess with regard to the photosphere of any star observed in\nFEPS (∼110%, Meyer et al. 2008). The star's age was estimated\nto be 90±40 Myr (Hines et al. 2007). The disk was resolved with\nHST/NICMOS coronagraphic imaging at 1.1 μm (Hines et al.\n2007) that revealed asymmetric circumstellar material with two\n1\n\n\fE. Buenzli et al.: The off-centered debris ring around HD 61005\n\nFig. 1. High-contrast NACO H-band images of HD 61005, (a)\nreduced with LOCI, (b) reduced with ADI. The slits used for\nphotometry are overlaid. The curved slit traces the maximum\nsurface brightness of the lower ring arc, while the rectangular\nboxes enclose the streamers. In both images the scaling is linear,\nand 1′′ corresponds to a projected separation of 34.5 AU. The arclike structures in the background are artifacts of the observation\nand reduction techniques, and are asymmetric because the field\nrotation center was offset from the star. The region with insufficient field rotation is masked out. The plus marks the position of\nthe star, the cross the ring center.\n\nwing-shaped edges, that is the reason for in the nickname \"the\nMoth\". The disk was also resolved at 0.6 μm with HST/ACS\nimaging and polarimetry (Maness et al. 2009). The polarization\nsuggests two distinct components, a nearly edge-on disk or ring\nand a swept-back component that interacts with the ISM. Both\npapers focused on the properties and origin of the swept-back\ncomponent. In this work, we present high-contrast ground-based\nimaging with unprecedented angular resolution. We discover and\ncharacterize a distinct asymmetric ring in the inner disk component and discuss the probability of a planetary companion.\n\n2. Observations and data reduction\nWe observed HD 61005 on February 17, 2010 with the NACO\ninstrument (Rousset et al. 2003; Lenzen et al. 2003) at the VLT.\nThe observations were obtained in the framework of the NaCo\nLarge Program Collaboration for Giant Planet Imaging (ESO\nprogram 184.C0567). The images were taken in the H-band\n(1.65 μm) in pupil-tracking mode (Kasper et al. 2009) to allow\nfor angular differential imaging (ADI, Marois et al. 2006). The\nfield of view was 14′′ × 14′′ and the plate scale 13.25 mas/pixel.\nWe performed the disk observations without a coronagraph, and\nused the cube-mode of NACO to take 12 data cubes. Each cube\nconsisted of 117 saturated exposures of 1.7927 s, yielding a total\nintegration time of 41.95 min. The saturation radius was ∼0.′′ 15.\nA total of 112◦ of field rotation was captured while the pupil\nremained fixed. Before and after the saturated observations we\ntook unsaturated images with a neutral density filter to measure\nthe photometry for the central star. The adaptive optics system\nprovided a point spread function (PSF) with a full-width at half2\n\nmaximum (FWHM) of 60 mas with ∼0.′′ 8 natural seeing in Hband (22% Strehl ratio).\nThe data were flat-fielded, bad-pixel corrected, and centered on the star by manually determining the center for the\nmiddle frame and aligning the others through cross-correlation.\nWe removed 3 bad-quality frames and averaged the remaining images in groups of three for a total of 467 frames. We\nthen used LOCI (locally optimized combination of images,\nLafrenière et al. 2007) and customized ADI to subtract the stellar PSF to search for point sources and extended non-circular\nstructures.\nIn ADI, each image is divided into annuli of 2 FWHM\nwidth. For each frame and each annulus, a frame where the\nfield object has rotated by 2 FWHM is subtracted to remove\nthe stellar halo. Additionally, the resulting image is subtracted\nby a back-rotated version of itself. Finally, all images are derotated and median combined. In LOCI, each annulus is further divided into segments, and for each segment an optimized\nPSF is constructed from a linear combination of sufficiently\nrotated frames. A minimum rotation of 0.75 FWHM is optimal for point source detection and has led to several detections\naround other targets (Marois et al. 2008; Thalmann et al. 2009;\nLafrenière et al. 2010). To reveal the extended nebulosity around\nLkCa 15, Thalmann et al. (2010) used a much larger minimum\nseparation of 3 FWHM. For the nearly edge-on and therefore\nvery narrow debris disk around HD 61005, we obtain an optimal result for a minimum separation of 1 FWHM, but using\nlarge optimization areas of 10000 PSF footprints to lessen the\nself-subtraction of the disk. We also reduced the data with LOCI\nwith a separation criterion of 0.75 FWHM and small optimization segments of 300 PSF footprints to set hard detection limits\non companions.\nAdditionally we attempted a classical PSF subtraction using\na reference star, which is detailed in Appendix A.\n\n3. Results\nThe NACO H-band images obtained by reduction with LOCI\nand ADI are shown in Fig. 1. The circumstellar material is resolved to an off-centered, nearly edge-on debris ring with a clear\ninner gap and two narrow streamers originating at the NE and\nSW edges of the ring. A strong brightness asymmetry is seen\nbetween the NE and SW side and between the lower and upper\narc of the ring. The inner gap has not been previously resolved by\nHST, where only the direction of the polarization vectors hinted\nat a disk-like component separate from the extended material\nthat interacts with the ISM.\nLOCI provides the cleanest view of the ring geometry with\nrespect to the background because it effectively removes the stellar PSF while bringing out sharp brightness gradients. The negative areas near the ring result from oversubtraction of the rotated disk signal embedded in the subtracted PSF constructed by\nLOCI. In particular, the ring's inner hole is enhanced. However,\ntests with artificial flat disks showed that while self-subtraction\ncan depress the central regions, the resulting spurious gradients\nare shallow and different from the steep gradients obtained from\nthe edge of a ring. Because of significant variable flux loss, photometry is unreliable in the LOCI image. In the ADI reduction,\nthe self-subtraction is deterministic and can be accounted for,\nwhile the stellar PSF is subtracted adequately enough to allow\nphotometric measurements. In the image produced by reference\nPSF subtraction (Fig. A.1) the stellar PSF is not effectively removed. The image is unsuitable for a quantitative analysis, but\n\n\fE. Buenzli et al.: The off-centered debris ring around HD 61005\n\nFig. 2. H-band surface brightness of the brighter ring arc and\nthe streamers measured from the ADI image and corrected for\nself-subtraction. Dotted lines indicate the error. The dotted dark\nline is the 1 σ sky background. Solid dark lines are power-law\nfits with the obtained slope indicated. The transition regions between ring and streamers are not fitted.\nit confirms the streamers and the strong brightness asymmetry,\nand also suggests the presence of a gap on the SW side.\n3.1. Surface brightness of ring and streamers\n\nThe surface brightness of the ring and streamers (Fig. 2) is obtained from the ADI image. We measure the mean intensity of\nthe bright ring arc as a function of angular separation from the\nstar in a curved slit of 5 pixels width (see Fig. 1b) following the\nmaximum brightness determined in Sect. 3.2. For the streamers\nthe slit is rectangular and of the same width. We calculate the\nmean intensity in the intersection of the slit with annuli of 9 pixels width. To estimate the self-subtraction because of ADI, we\napply our ADI method to a model ring (Sect. 3.2). The measured\nflux loss in our slit is 24 ± 5%, where the error includes variations with radius and between the two sides. For the true ring this\nvalue might differ by a few percent. For lack of a good model for\nthe swept material, we apply the same correction factor for the\nstreamers, though the systematic error is likely larger. The dominant source of error are subtraction residuals, which we measure\nas the dispersion in wider slits rotated by ±45◦ . To obtain absolute photometry we use the observations of HD 61005 taken\nin the neutral density filter as reference. The NE arc is about 1\nmag/arcsec2 or a factor of 2–3 brighter than the SW arc, consistent with the factor of 2 brightness asymmetry seen by HST\nat shorter wavelengths. The surface brightness of the inner 1.′′ 1\nof the SW arc is of the same order as the residuals, making a\npower-law fit unreliable.\nThe two streamers are tilted by an angle of ∼23◦ with respect to the ring's semi-major axis. We detect material out to a\nprojected distance of ∼140 AU (4′′ ) from the star. Beyond 2.8′′\nthe S/N ratio is too low to perform a meaningful power-law fit.\nCloser, the power-law slopes agree with those by Maness et al.\n(2009) within errors. We do not detect the fainter, more homogeneously distributed swept material seen by HST because such\nstructures are subtracted by ADI. However, the streamers are\nalso seen in the reference PSF subtracted image and thus are the\nmost visible component of the swept material. They may represent the limb-brightened edges of the total scattering material.\n3.2. Ring geometry and center offset\n\nWe convolve the LOCI image with the PSF and measure the\nring's inclination and position angle by ellipse fitting through\npoints of maximum intensity in selected regions. Assuming that\n\nFig. 3. Comparison of a radial cut averaged over 5 pixels through\nthe midplane for the observation reduced with LOCI and the\nmodel disk implanted into the reference star and reduced in the\nsame way. The intensity of the SW-side of the model is scaled\ndown by a factor 1.3.\nthe ring is intrinsically circular, the fit yields an inclination of\n84.3◦ and position angle 70.3◦ , with systematic errors of ∼1◦ .\nThe position angle agrees well with the position angle of the\ndisk-component determined by HST, while we find the inclination to be ∼4◦ closer to edge-on. To determine the separation of\nthe ring ansae, we create inclined ring annuli and find for each\nside the ring with maximum mean intensity around the ansa.\nThis fit yields a radius of 61.25 ± 0.85 AU, and a ring center\noffset from the star by 2.75 ± 0.85 AU toward SW along the apparent disk major axis. The radial extension of the ring agrees\nwith the location of the power-law break seen by HST at 0.6 μm.\nTo assess the effect of our PSF subtraction method and determine additional ring parameters, we create synthetic scattered light images with the GRaTer code for optically thin disks\n(Augereau et al. 1999). The models are inserted into the data of\nour PSF reference star (cf. Appendix A) and the LOCI algorithm\nis applied to allow direct comparison with the observations. We\nlet the ring be intrinsically elliptical with the periastron located\nalong the apparent disk major axis, because our data cannot constrain an offset along the minor axis. The radial structure is described by a smooth combination of two power laws, rising to the\nring peak density position and fading with distance from the star.\nScattering is represented by a Henyey-Greenstein (HG) phase\nfunction with an asymmetry parameter g.\nWe compare the model constructed from the parameters derived above with the observation. An inclination of i = 84.3 ±\n1.0◦ is also a good match for an intrinsically elliptical ring.\nWhile the center offset leads to a small increase (factor of ∼1.2)\nin surface brightness on the NE side with respect to the SW side,\nmodels that are identical on the two sides except for the offset\nstill underestimate the extent of the enhancement by a factor of\n∼1.3. That the brightness asymmetry is visible after all reduction methods and in the HST 0.6 μm image suggests a physical\nasymmetry in the density or grain properties. Because asymmetric dust models that include the ISM interaction go beyond the\nscope of this Letter, we focus on validating the ring geometry.\nWe compare a radial cut along the midplane averaged over\n5 pixels (Fig. 3), artificially lowering the model intensity on the\nfaint side by a factor of 1.3. Indeed, models with an offset o = a*e\nof 2.75 ± 0.85 AU, where a is the semi-major axis for the peak\ndensity (61.25 ± 0.85 AU) and e the eccentricity (0.045 ± 0.015),\nstill provide a decent match after reduction with LOCI. Models\nwithout offset are worse particularly out to ∼63 AU for each ring\nside because the shift in peak intensity is missing. Therefore the\noffset does not appear to be an artifact of the data reduction.\nModel comparison suggests an inner surface density powerlaw slope of ∼7, but a fit is difficult because reduction artifacts\ndiffer for models and observations. The outer slope (fixed to −4)\nis uncertain because we do not model the ISM interaction. In\n3\n\n\fE. Buenzli et al.: The off-centered debris ring around HD 61005\n\nFig. 4. Contrast for companions around HD 61005 detectable at\nthe 5σ level. The numbers indicate the mass limit at the horizontal lines for an age of 90 Myr, based on the COND models\nby Baraffe et al. (2003). One arcsec corresponds to a projected\nseparation of 34.5 AU.\nany case, the inner rim appears to be significantly steeper than\nthe outer rim. From the brightness asymmetry between the upper\nand lower arc we estimate the asymmetry parameter to |g| ∼0.3.\nThis value is uncertain because the weak arc is strongly contaminated by reduction residuals. Additionally, the HG phase function is a simplistic model for scattering in debris disks. A positive g-value, assuming that the brighter side is the front, would\nindicate forward scattering grains. This may not always be the\ncase (see e.g. Min et al. 2010).\n3.3. Limits on companions to HD 61005\n\nIn our full image (Fig. B.1) we detect six point sources at\nr > 3′′ . These are seen in the Hines et al. (2007) data as well.\nAstrometric tests show that their relative proper motion is consistent with all objects being background sources (cf. App. B).\nIn the LOCI image reduced with the smaller minimum rotation we search for closer companions. After convolving the\nresulting image with an aperture of 5 pixels diameter, we calculate the noise level at a given separation as the standard deviation\nin a concentric annulus. To determine the flux loss from partial\nself-subtraction we implant artifical sources in the raw data. The\nmeasured contrast curve is corrected for this flux loss to yield\nthe final 5σ detectable constrast curve (Fig. 4). We translate the\ncontrast to a mass limit using the COND evolutionary models\nby Baraffe et al. (2003). We assume an age of 90 Myr. We do not\ndetect any companion candidates, but are able to set limits well\nbelow the deuterium burning limit.\n\n4. Discussion\nThe high-resolution image enables us to distinguish the actual\ndebris ring from the material that appears to be streaming away\nfrom the system. The results reveal a ring center offset of ∼3 AU\nand an additional brightness asymmetry suggesting density variations. The eccentricity of the debris ring could be shaped by\ngravitational interaction with a companion on an eccentric orbit. A similar system is Fomalhaut with a belt eccentricity of\n0.11 (Kalas et al. 2005). Mass constraints were discussed for\nFomalhaut b by Chiang et al. (2009). A rough adaptation of their\nresult to HD 61005 shows that a planet below our detection limit\nof ∼3-4 MJ located beyond ∼40 AU at maximum angular separation could perturb the ring. Because of the high inclination a\nplanet of higher mass and lower semi-major axis could also hide\nwithin the residuals at smaller projected separation from the star.\nModels of the spectral energy distribution by\nHillenbrand et al. (2008) suggested that the debris required\nmultiple temperature components. This could be fitted by either\n4\n\nan extended debris model (Rinner < 10 AU and Router >40 AU)\nor more likely an inner warm ring and an outer cool ring, which\ncould coincide with the dust detected in the scattered light\nimages.\nTo explain the structure of the interacting material,\nManess et al. (2009) explored several scenarios, and proposed\nthat a low-density cloud is perturbing grain orbits because of\nram pressure. The streamers would be barely bound, sub-micron\nsized grains on highly eccentric orbits, consistent with the observed blue color and the brightness profile. Their model currently cannot reproduce the sharpness of the streamers, but the\nobserved geometry of the parent body ring might help improve\nthe models to validate this theory. These might then answer\nwhether the ring offset could also be caused by the ISM interaction rather than a planet. Obtaining colors of the ring through\nhigh-resolution imaging at other wavelengths could indicate if a\ngrain size difference exists between parent body ring and swept\nmaterial.\nAs a solar-type star, and with a debris ring at a radius not\nmuch larger than that of the Kuiper belt, the HD 61005 system\nprovides an interesting comparison to models of the young solar system. Booth et al. (2009) calculate the infrared excess of\nthe solar system as a function of time based on strong assumptions consistent with the Nice model. At ∼90 Myr the calculated 70 μm excess ratio F70 /F70⋆ is about four times lower than\nthat observed for HD 61005 (Hillenbrand et al. 2008). Indeed,\nHD 61005 is one of the most luminous debris disks known. Its\nother obvious unusual feature is the morphology of the swept\ncomponent. Perhaps further modeling will provide a causal connection between its high observed dust generation rate and this\napparent interaction with the ISM. It is also an interesting target for future deeper searches for planetary mass companions as\nwell as remnant gas that could be associated with the debris.\n\nReferences\nAugereau, J. C., Lagrange, A. M., Mouillet, D., Papaloizou, J. C. B., & Grorod,\nP. A. 1999, A&A, 348, 557\nAugereau, J. C., Nelson, R. P., Lagrange, A. M., Papaloizou, J. C. B., & Mouillet,\nD. 2001, A&A, 370, 447\nBaraffe, I., Chabrier, G., Barman, T. S., Allard, F., & Hauschildt, P. H. 2003,\nA&A, 402, 701\nBooth, M., Wyatt, M. C., Morbidelli, A., Moro-Martı́n, A., & Levison, H. F.\n2009, MNRAS, 399, 385\nBryden, G., Beichman, C. A., Carpenter, J. M., et al. 2009, ApJ, 705, 1226\nChiang, E., Kite, E., Kalas, P., Graham, J. R., & Clampin, M. 2009, ApJ, 693,\n734\nDebes, J. H., Weinberger, A. J., & Kuchner, M. J. 2009, ApJ, 702, 318\nHillenbrand, L. A., Carpenter, J. M., Kim, J. S., et al. 2008, ApJ, 677, 630\nHines, D. C., Schneider, G., Hollenbach, D., et al. 2007, ApJ, 671, L165\nKalas, P. 2005, ApJ, 635, L169\nKalas, P., Fitzgerald, M. P., & Graham, J. R. 2007, ApJ, 661, L85\nKalas, P., Graham, J. R., Chiang, E., et al. 2008, Science, 322, 1345\nKalas, P., Graham, J. R., & Clampin, M. 2005, Nature, 435, 1067\nKasper, M., Amico, P., Pompei, E., et al. 2009, The Messenger, 137, 8\nKóspál, Á., Ardila, D. R., Moór, A., & Ábrahám, P. 2009, ApJ, 700, L73\nLafrenière, D., Jayawardhana, R., & van Kerkwijk, M. H. 2010, ApJ, 719, 497\nLafrenière, D., Marois, C., Doyon, R., Nadeau, D., & Artigau, É. 2007, ApJ,\n660, 770\nLagrange, A., Bonnefoy, M., Chauvin, G., et al. 2010, Science, 329, 57\nLagrange, A., Gratadour, D., Chauvin, G., et al. 2009, A&A, 493, L21\nLenzen, R., Hartung, M., Brandner, W., et al. 2003, in Proc. SPIE, Vol. 4841,\n944–952\nManess, H. L., Kalas, P., Peek, K. M. G., et al. 2009, ApJ, 707, 1098\nMarois, C., Lafrenière, D., Doyon, R., Macintosh, B., & Nadeau, D. 2006, ApJ,\n641, 556\nMarois, C., Macintosh, B., Barman, T., et al. 2008, Science, 322, 1348\nMeyer, M. R., Carpenter, J. M., Mamajek, E. E., et al. 2008, ApJ, 673, L181\nMeyer, M. R., Hillenbrand, L. A., Backman, D., et al. 2006, PASP, 118, 1690\nMin, M., Kama, M., Dominik, C., & Waters, L. B. F. M. 2010, A&A, 509, L6+\n\n\fE. Buenzli et al.: The off-centered debris ring around HD 61005\nMoro-Martı́n, A., Carpenter, J. M., Meyer, M. R., et al. 2007, ApJ, 658, 1312\nMouillet, D., Larwood, J. D., Papaloizou, J. C. B., & Lagrange, A. M. 1997,\nMNRAS, 292, 896\nQuanz, S. P., Meyer, M. R., Kenworthy, M. A., et al. 2010, ApJ, 722, L49\nQuillen, A. C. 2006, MNRAS, 372, L14\nRousset, G., Lacombe, F., Puget, P., et al. 2003, in Proc. SPIE, Vol. 4839, 140–\n149\nThalmann, C., Carson, J., Janson, M., et al. 2009, ApJ, 707, L123\nThalmann, C., Grady, C. A., Goto, M., et al. 2010, ApJ, 718, L87\nWyatt, M. C. 2008, ARA&A, 46, 339\n\nAcknowledgements. We thank David Lafrenière for providing the source code\nfor his LOCI algorithm. We thank J. Alcala, E. Brugaletta, E. Covino and A.\nLanzafame for discussions on the stellar properties and H.M. Schmid for comments. EB acknowledges funding from the Swiss National Science Foundation\n(SNSF). AE is supported by a fellowship for advanced researchers from the\nSNSF (grant PA00P2 126150/1).\n\n5\n\n\fE. Buenzli et al.: The off-centered debris ring around HD 61005, Online Material p 1\n\nAppendix A: Subtraction of stellar halo with a PSF\nreference star\nTo check that the revealed structures are not artifacts of the ADI\nmethods, a classical PSF subtraction was applied to HD 61005\nusing the unresolved star TYC-7188-571-1, observed 3 hours after HD 61005 in the same observing mode. A total of 400 frames\nmatching the same parallactic angle variation for HD 61005 and\nthe reference star were considered. After shift-and-add, a scaling\nfactor was derived from the ratio of the azimuthal average of the\nHD 61005 median image to the azimuthal average of the recentered median image of the PSF. The median of the PSF sequence\nwas then subtracted from all individual frames of HD 61005.\nThe resulting cube was derotated and collapsed to obtain the final PSF-subtracted image (Fig. A.1). Additional azimuthal and\nlow-pass filtering was applied to improve the disk detection.\n\nTable B.1. Relative positions of the faint sources 1 to 6 (Fig.\nB.1). A conservative astrometric error of 1 pixel has been considered for the relative position measurements obtained with\nHST/NICMOS and VLT/NaCo observations (i.e 75.8 mas and\n13.25 mas).\nName\n\nUT Date\n\n∆RA\n(mas)\n\n∆DEC\n(mas)\n\nfs-1\n\n2006-06-18\n2010-02-17\n2005-11-20\n2010-02-17\n2005-11-20\n2010-02-17\n2005-11-20\n2010-02-17\n2006-06-18\n2010-02-17\n2006-06-18\n2010-02-17\n\n-1929\n-2189\n-4672\n-4449\n-2326\n-2068\n-8487\n-8222\n-1586\n-1358\n-1148\n-1336\n\n2918\n3080\n4669\n4441\n9321\n9034\n-15\n-370\n-6848\n-7123\n-7671\n-8024\n\nfs-2\nfs-3\nfs-4\nfs-5\nfs-6\n\nFig. A.1. Reference PSF subtracted image of HD 61005.\n\nAppendix B: Astrometry of background sources\nIn addition to our VLT data, we used the HST/NICMOS observations of Hines et al. (2007) (program-10527) obtained in\nNovember 20, 2005 and June 18, 2006 to identify the status of\nthe six faint sources detected in our VLT/NaCo field (marked\nas fs-1, 2, 3, 4, 5 and 6 in Fig. A.1). The relative positions\nrecorded at different epochs can be compared to the expected\nevolution of the position measured at the first epoch under the\nassumption that the sources are either stationary background objects or comoving companions. For the range of explored semimajor axes, any orbital motion can be considered to be of lower\norder compared with the primary proper and parallactic motions. Considering a proper motion of (μα , μδ ) = (−56.09 ±\n0.70, 74.53±0.65) mas/yr and a parallax of π = 28.95±0.92 mas\nfor HD 61005 as well as the relative positions of all faint sources\nat each epoch (see Table B.1), a χ2 probability test of 2 × Nepochs\ndegrees of freedom (corresponding to the measurements: separations in the ∆α and ∆δ directions for the number Nepochs\nof epochs) was applied. None of the six sources are comoving\nwith HD 61005 with a probability higher than 99.99%. They\nare found to be background stationary objects with a probability higher than 60%. We can therefore fully exclude the possibility that these sources are physically bound companions of\nHD 61005. Maness et al. (2009) had already determined that\nfour sources visible in their image were background sources.\n\nFig. B.1. Full field of view of our NACO H−band data reduced\nby derotating, adding and spatially filtering. Six background\nsources are identified.\nTwo of these correspond to fs-3 and fs-4, and we here confirm\ntheir result. Their other two sources are outside of our field of\nview. We therefore provide a new result for the four sources fs1, fs-2, fs-5 and fs-6.\n\n\f"}