{"id": "http://arxiv.org/abs/0805.2101v1", "guidislink": true, "updated": "2008-05-14T19:16:37Z", "updated_parsed": [2008, 5, 14, 19, 16, 37, 2, 135, 0], "published": "2008-05-14T19:16:37Z", "published_parsed": [2008, 5, 14, 19, 16, 37, 2, 135, 0], "title": "A Novel Approach to Study Highly Correlated Nanostructures: The\n  Logarithmic Discretization Embedded Cluster Approximation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0805.3566%2C0805.2294%2C0805.4291%2C0805.0429%2C0805.3116%2C0805.0862%2C0805.4345%2C0805.1492%2C0805.2033%2C0805.2004%2C0805.1830%2C0805.0050%2C0805.3478%2C0805.2101%2C0805.3147%2C0805.3890%2C0805.1268%2C0805.0044%2C0805.2360%2C0805.3905%2C0805.3575%2C0805.3367%2C0805.4835%2C0805.4424%2C0805.0537%2C0805.1091%2C0805.0636%2C0805.1331%2C0805.0885%2C0805.3082%2C0805.4820%2C0805.2799%2C0805.3968%2C0805.2370%2C0805.0944%2C0805.3520%2C0805.1382%2C0805.3144%2C0805.2094%2C0805.0516%2C0805.4506%2C0805.0893%2C0805.2241%2C0805.1454%2C0805.3538%2C0805.3376%2C0805.4750%2C0805.4229%2C0805.4422%2C0805.1025%2C0805.3290%2C0805.0828%2C0805.2787%2C0805.1419%2C0805.0533%2C0805.0246%2C0805.2969%2C0805.2463%2C0805.0391%2C0805.4724%2C0805.0767%2C0805.0239%2C0805.4809%2C0805.0016%2C0805.3371%2C0805.2205%2C0805.0268%2C0805.3683%2C0805.3572%2C0805.4787%2C0805.0796%2C0805.2109%2C0805.4313%2C0805.3837%2C0805.0602%2C0805.2631%2C0805.0637%2C0805.1501%2C0805.0591%2C0805.2765%2C0805.1042%2C0805.1796%2C0805.4529%2C0805.2483%2C0805.3047%2C0805.4299%2C0805.2238%2C0805.3630%2C0805.3703%2C0805.3994%2C0805.1642%2C0805.4061%2C0805.0232%2C0805.2665%2C0805.1240%2C0805.3577%2C0805.0486%2C0805.1483%2C0805.1442%2C0805.1715%2C0805.2035&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A Novel Approach to Study Highly Correlated Nanostructures: The\n  Logarithmic Discretization Embedded Cluster Approximation"}, "summary": "This work proposes a new approach to study transport properties of highly\ncorrelated local structures. The method, dubbed the Logarithmic Discretization\nEmbedded Cluster Approximation (LDECA), consists of diagonalizing a finite\ncluster containing the many-body terms of the Hamiltonian and embedding it into\nthe rest of the system, combined with Wilson's idea of a logarithmic\ndiscretization of the representation of the Hamiltonian. The physics associated\nwith both one embedded dot and a double-dot side-coupled to leads is discussed\nin detail. In the former case, the results perfectly agree with Bethe ansatz\ndata, while in the latter, the physics obtained is framed in the conceptual\nbackground of a two-stage Kondo problem. A many-body formalism provides a solid\ntheoretical foundation to the method. We argue that LDECA is well suited to\nstudy complicated problems such as transport through molecules or quantum dot\nstructures with complex ground states.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0805.3566%2C0805.2294%2C0805.4291%2C0805.0429%2C0805.3116%2C0805.0862%2C0805.4345%2C0805.1492%2C0805.2033%2C0805.2004%2C0805.1830%2C0805.0050%2C0805.3478%2C0805.2101%2C0805.3147%2C0805.3890%2C0805.1268%2C0805.0044%2C0805.2360%2C0805.3905%2C0805.3575%2C0805.3367%2C0805.4835%2C0805.4424%2C0805.0537%2C0805.1091%2C0805.0636%2C0805.1331%2C0805.0885%2C0805.3082%2C0805.4820%2C0805.2799%2C0805.3968%2C0805.2370%2C0805.0944%2C0805.3520%2C0805.1382%2C0805.3144%2C0805.2094%2C0805.0516%2C0805.4506%2C0805.0893%2C0805.2241%2C0805.1454%2C0805.3538%2C0805.3376%2C0805.4750%2C0805.4229%2C0805.4422%2C0805.1025%2C0805.3290%2C0805.0828%2C0805.2787%2C0805.1419%2C0805.0533%2C0805.0246%2C0805.2969%2C0805.2463%2C0805.0391%2C0805.4724%2C0805.0767%2C0805.0239%2C0805.4809%2C0805.0016%2C0805.3371%2C0805.2205%2C0805.0268%2C0805.3683%2C0805.3572%2C0805.4787%2C0805.0796%2C0805.2109%2C0805.4313%2C0805.3837%2C0805.0602%2C0805.2631%2C0805.0637%2C0805.1501%2C0805.0591%2C0805.2765%2C0805.1042%2C0805.1796%2C0805.4529%2C0805.2483%2C0805.3047%2C0805.4299%2C0805.2238%2C0805.3630%2C0805.3703%2C0805.3994%2C0805.1642%2C0805.4061%2C0805.0232%2C0805.2665%2C0805.1240%2C0805.3577%2C0805.0486%2C0805.1483%2C0805.1442%2C0805.1715%2C0805.2035&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "This work proposes a new approach to study transport properties of highly\ncorrelated local structures. The method, dubbed the Logarithmic Discretization\nEmbedded Cluster Approximation (LDECA), consists of diagonalizing a finite\ncluster containing the many-body terms of the Hamiltonian and embedding it into\nthe rest of the system, combined with Wilson's idea of a logarithmic\ndiscretization of the representation of the Hamiltonian. The physics associated\nwith both one embedded dot and a double-dot side-coupled to leads is discussed\nin detail. In the former case, the results perfectly agree with Bethe ansatz\ndata, while in the latter, the physics obtained is framed in the conceptual\nbackground of a two-stage Kondo problem. A many-body formalism provides a solid\ntheoretical foundation to the method. We argue that LDECA is well suited to\nstudy complicated problems such as transport through molecules or quantum dot\nstructures with complex ground states."}, "authors": ["E. V. Anda", "G. Chiappe", "C. A. Busser", "M. A. Davidovich", "G. B. Martins", "F. Heidrich-Meisner", "E. Dagotto"], "author_detail": {"name": "E. Dagotto"}, "author": "E. Dagotto", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.78.085308", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0805.2101v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0805.2101v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "17 pages, 13 figures", "arxiv_primary_category": {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0805.2101v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0805.2101v1", "journal_reference": "Phys. Rev. B 78, 085308 (2008)", "doi": "10.1103/PhysRevB.78.085308", "fulltext": "A Novel Approach to Study Highly Correlated Nanostructures:\nThe Logarithmic Discretization Embedded Cluster Approximation\nE. V. Anda,1 G. Chiappe,2, 3 C.A. Büsser,4 M.A. Davidovich,1 G. B. Martins,5, ∗ F. Heidrich-Meisner,6, 7 and E. Dagotto7\n1\n\nDepartamento de Fı́sica, Pontifı́cia Universidade Católica do Rio de Janeiro, 22453-900, Brazil\nDepartamento de Fı́sica Aplicada, Universidad de Alicante, San Vicente del Raspeig, Alicante 03690 Spain\n3\nDepartamento de Fı́sica J. J. Giambiagi, Facultad de Ciencias Exactas,\nUniversidad de Buenos Aires, Ciudad Universitaria, 1428 Buenos Aires, Argentina\n4\nDepartment of Physics and Astronomy, Ohio University, Athens, Ohio 45701, USA\n5\nDepartment of Physics, Oakland University, Rochester, MI 48309, USA\n6\nInstitut für Theoretische Physik C, RWTH Aachen University, 52056 Aachen, Germany\n7\nMaterials Science and Technology Division, Oak Ridge National Laboratory, Oak Ridge, Tennessee 37831, USA and\nDepartment of Physics and Astronomy, University of Tennessee, Knoxville, Tennessee 37996, USA\n\narXiv:0805.2101v1 [cond-mat.str-el] 14 May 2008\n\n2\n\nThis work proposes a new approach to study transport properties of highly correlated local structures. The\nmethod, dubbed the Logarithmic Discretization Embedded Cluster Approximation (LDECA), consists of diagonalizing a finite cluster containing the many-body terms of the Hamiltonian and embedding it into the rest of the\nsystem, combined with Wilson's idea of a logarithmic discretization of the representation of the Hamiltonian.\nThe physics associated with both one embedded dot and a double-dot side-coupled to leads is discussed in detail.\nIn the former case, the results perfectly agree with Bethe ansatz data, while in the latter, the physics obtained is\nframed in the conceptual background of a two-stage Kondo problem. A many-body formalism provides a solid\ntheoretical foundation to the method. We argue that LDECA is well suited to study complicated problems such\nas transport through molecules or quantum dot structures with complex ground states.\nPACS numbers: 73.23.Hk, 72.15.Qm, 73.63.Kv\n\nI.\n\nINTRODUCTION\n\nThe study of nanostructures has been motivated, on the one\nhand, by the potential applications in molecular electronics\ndevices1 or in quantum computing2 and, on the other hand, by\nthe search for a more profound understanding of fundamental\nmany-body physics such as the Kondo effect. Experimentally,\nnot only the existence of the Kondo effect in quantum dots3\nor single-molecule transistors4 has been established, but it has\nalso been demonstrated that nanostructures can be designed\nto produce more exotic phases such as multi-channel physics\nand thus, non-Fermi liquid behavior.5 On the theoretical side,\nwhile the single-impurity case is well understood by means\nof firmly established analytical6 and numerical methods, such\nas the Numerical Renormalization Group technique (NRG),7\nthe search for unconventional effects, non-equilibrium behavior, and the need to model complex real structures, such as\nmolecules or multi-dot geometries, has triggered the development of alternative methods.8,9,10,11,12,13 For instance, the procedure of exactly diagonalizing a finite cluster containing the\nmany-body terms and embedding it into the rest of the system,\nthe Embedded Cluster Approximation (ECA), has satisfactorily been used to study transport in nanoscopic structures in\nthe last few years.10,11,12,13 Ideas similar to the embedded cluster method have been applied to the metal-insulator transition\nof the Hubbard model.14,15,16\nIncorporating ideas from the Density Matrix Renormalization Group method (DMRG)17 into NRG and vice versa has\nalso resulted in substantial improvements in, e.g., the calculation of dynamical properties18 or time-evolution schemes,19\nwhich now allows one to address problems previously out of\nreach for either method. In the same spirit, it is the objective\nof this paper to present the Logarithmic Discretization Em-\n\nbedded Cluster Approximation (LDECA) approach to study\nhighly correlated electrons in nano-scale systems, combining ECA with Wilson's idea of a logarithmic discretization of\nthe conduction band.7 As one of our main results, we utilize\nmany-body arguments to provide a solid theoretical justification of this formalism. Although the ECA method, due to the\nembedding process, is designed to analyze the infinite system,\nit produces results that depend on the cluster's size, which, in\nsome cases, has led to controversial results.20,21 LDECA not\nonly successfully reduces these finite-size effects, but, more\nimportantly, it also optimizes the description of the system in\nthe vicinity of the Fermi level, allowing for the analysis of\nlower energy scales than accessible to ECA.\nTo demonstrate the potential of the method, we focus on\nthe physics of the Kondo effect in a single-dot, where we find\nexcellent agreement with exact Bethe ansatz (BA) results. As\nthere is a timely interest in more involved versions of Kondo\nphysics, such as multi-channel situations,5 SU(4),22,23 as well\nas two-stage Kondo (TSK) effects,24,25,26,27,28,29 we further apply LDECA to study a double-dot structure side-connected to\nleads. This system, with a subtle TSK ground state similar\nto the one studied in Ref. 26, is an important testbed for our\napproach. Our results are encouraging, and we thus envision\nthe successful future application of LDECA to more involved\nsystems such as molecules adsorbed at metallic surfaces4,30 or\ndot structures with subtle ground states.5\nThe plan of the paper is as follows. We first provide a discussion of the theoretical foundation of the method in terms\nof diagrammatic perturbation theory in Sec. II. For the sake\nof a clear presentation, we choose to provide a pedagogical\naccount of the theory, therefore the details will be given in\nan appendix (App. A). Our results for the two systems, one\nembedded dot and a two dot model, are covered in Secs. III\n\n\f2\n\n(a)\n\nCluster size: L = N+1\n\n0\n\n000\n111\n000\n111\n000\n111\n00\n11\n000000000\n111111111\n000\n111\n00\n11\n000\n111\n00\n11\n000\n111\n\ni\n\nj\n\nN\n\n11\n00\n11\n000\n111\n000\n111\n00 00\n11\n00\n11\n000\n000\n111\n00\n11\n00111\n11\n000 111\n111\n000\n\nV N+1\n000 11\n111\n00111\n000\n\n00\n000\n111\n00111\n11\n000 11\n111\n00\n11\n000 11\n111\n00\n000\n00\n11\n\nCLUSTER\nMany body problem\nsolved exactly for T 0\n\n(b)\n\none body problem\n\n= c i ; c+j\n\nTotal Green function\n\nij\n\n= c i ; c+j\n\nCluster uncoupled\n0 Green function\n\nij\n\nbinding lattice (thus, L = N + 1, in the case of a single impurity). In this cluster is where most of the many-body effects\nare expected to be confined. In a second step the cluster's\nGreen function is computed with exact diagonalization, which\nthen, in a last step, is embedded into the rest of the tightbinding lattice.10,11,12,13,20,23,31,32,33,34,35 The precise meaning\nof the embedding step is described below.\nThe theoretical foundation of the method is outlined using the Anderson single-impurity Hamiltonian describing a\ndot connected to a semi-infinite lead.36 The total Hamiltonian\nreads\nX\nHT = Vg\nn0σ + HMB +\nσ\n\nt\n\nDyson Equation:\n\n=\ni,j\n\ni,j\n\n=\nN+1,j\n\nX\n\n(c†0σ c1σ + c†1σ c0σ ) + Hband ,\n\n(1)\n\nσ\n\nV\n\n+\n\n′\n\nwhere\ni,N\n\nN+1,j\n\nHMB = U/2\n\nV\n\nX\n\nn0σ n0σ̄ ,\n\n(2)\n\nσ\n\nN+1,N+1\n\nN,j\n\nFIG. 1: (Color online) (a) Schematic description of the steps needed\nin the implementation of the ECA and LDECA methods for the particular case of one quantum dot coupled to a conduction band. The\nsystem is separated into two parts: the first one contains the manybody terms and the first few neighboring sites in the lead. This forms\nthe cluster to be exactly diagonalized, with L = N + 1 sites. The\nsecond part is the rest of the lead, a semi-infinite tight-binding chain.\nA crucial step, which allows the simulation of Kondo physics, is the\nembedding of the cluster into the remaining part of the system. This\nstep is performed through a Dyson equation, which amounts to a\nsummation of an infinite family of Feynman diagrams arising from\nperturbation theory. (b) Diagrammatic expansion associated to the\nDyson equation. The dressed propagators (in green, darkly shaded),\nwhich reestablish the artificially broken connection between sites N\nand R (through a hopping term V ), are calculated as a function of\nthe bare propagators (gray, lightly shaded). Note that the equation\nfor the dressed propagator N+1,j does not have an independent bare\nterm, since the bare propagator N+1,j is zero.\n\nand Sec. IV, respectively. For both models, we discuss the local density of states and the conductance as a function of gate\npotential. We close with a summary in Sec. V.\n\nII. THE \"LOGARITHMIC DISCRETIZATION\nEMBEDDED CLUSTER APPROXIMATION\" (LDECA)\n\nSimilarly to the ECA method, LDECA is supposed to treat\nlocalized impurity systems that consist of a region with manybody interactions weakly coupled to non-interacting conduction bands. The approach is based on the idea that the manybody effects of the impurities are local in character. With this\nin mind, we proceed in three steps: first, out of the complete\nsystem, one isolates a cluster with L sites that consists of the\nimpurities plus their N nearest neighboring sites in the tight-\n\nand\nHband =\n\n∞\nX\n\nti (c†iσ ci+1σ + c†i+1σ ciσ ) .\n\n(3)\n\ni=1σ\n\nThe first two terms of HT represent the impurity, which has\na diagonal energy, the gate potential Vg , and a Coulomb repulsion U in the Hamiltonian HMB . The third term is the\nhybridization of the impurity with the band and finally, Hband\nrepresents the continuous spectrum, in this case modeled by\na semi-infinite non-interacting chain. c†iσ is a fermion creation operator acting on site i, with a spin index σ =↑↓.\nniσ = c†iσ ciσ is the particle density operator. t′ and ti are\nthe hopping matrix elements between the dot and the leads\nand in the leads, respectively. A tight-binding band with a\nsemi-elliptical density of states is obtained with the choice of\nti = 1.\nThis problem can be treated within the framework of quantum perturbation theory. The standard many-body perturbation theory formulation generally considers the kinetic energy\nas the unperturbed Hamiltonian and the many-body terms as\nthe perturbation. This permits the use of Wick's theorem to\nformulate a diagrammatic expansion for the propagators of\nthe system. In our case, however, we adopt an opposite point\nof view. The unperturbed Hamiltonian consists of two parts,\nthe isolated cluster, which includes the impurity and its neighborhood, and the rest of the system, as represented by the two\ndashed boxes in Fig. 1 (a). The kinetic energy associated to\nthe connection of these two subsystems is now considered to\nbe the perturbation. This seems to be an appropriate starting\npoint to describe a system where the many-body interactions\nare local, so that the cluster may contain most of the relevant\nphysics we wish to describe. However, one faces several difficulties in a theory of this kind. The most important one is\nthe fact that, in this case, Wick's theorem is not valid and, as\na consequence, it cannot be used to develop the diagrammatic\nexpansion. However, perturbation theory provides us with a\n\n\f3\nway of proposing a locator-propagator diagrammatic expansion and establishing a criterion to sum up the most important\nfamilies of diagrams (for details, see Appendix A).\nTherefore, following the strategy outlined above, the unperturbed Hamiltonian H0 is given by:\nH0 = Hcluster + Hrest\n\n(4)\n\nX\n\nn0σ + HMB +\n\n(5)\n\nσ\n\nt′\n\nX\n\nc†0σ c1σ +\n\nσ\n\nN\nX\n\nti c†iσ ci+1σ + h.c., (6)\n\ni=1σ\n\nand\nHrest =\n\n∞\nX\n\nti (c†iσ ci+1σ + h.c.) .\n\ni\n\nwhere i is restricted to be either 0 or N , ω denotes frequency,\nand the self-energy Σσi (ω) is defined as\n\nwhere\nHcluster = Vg\n\nThe Green function of the system at the impurity, as discussed in the appendix, can be written using a general Dyson\nequation, as schematically shown in Fig. 1(b):\nX (0)\n(0)\nG0i,σ (ω)Σσi (ω)Gi0,σ (ω) (10)\nG00,σ (ω) = G00,σ (ω) +\n\n(7)\n\ni=N +1σ\n\nFigure 1(a) schematically represents the two parts of the\nsystem. Note that one of the internal connections of the lead,\nrepresented by a red line, labeled with a V = tN in the figure, is artificially broken by this procedure and the two parts\nof the unperturbed Hamiltonian, Hcluster and Hrest , can be\nsolved exactly. The ground state of Hcluster with N sites of\nthe lead plus the impurity is obtained by using the Lanczos\nmethod.37 In addition, using a continued fraction scheme, the\ncluster Green functions at zero temperature are then evaluated.\nThe Green functions for Hrest are calculated exactly since it\nconstitutes a one-body problem.\nTo restore the artificially broken connection between sites\nN and N + 1, the interaction between the cluster and the rest\nof the lead,\nX †\nHp = V\n(8)\ncN σ cN +1σ + h.c.,\n\nΣσi (ω) = ΣσN (ω)δiN + Σσ0 (ω)δi0 .\n\n(11)\n\nWhile ΣσN (ω) is a simple self-energy, Σσ0 (ω) represents an\ninfinite expansion (see Eq. (A19) in the Appendix). It can\nonly be calculated approximately, although this can be done\nin a systematic way by including terms in the expansion up\nto a certain order in U . Diagrams with a similar topological\nstructure appear in the calculation of the one particle Green\nfunction for the Hubbard or Anderson impurity Hamiltonians\ntreated in the thermodynamic limit.39 In addition, in Ref. 16, a\ndiagrammatic expansion for an interacting lattice in the strong\ncoupling limit was used in order to include effects of longrange interactions beyond the exact diagonalization of a finite\ncluster.\nThe key approximation of LDECA is guided by a comparison of the two contributions to the self-energy given in\nEq. (11). While Σσ0 strongly depends on the size of the cluster\n(0)\nthrough the non-diagonal Green function [G0N,σ (ω)]2 , ΣσN\ndoes not. This fact can be of great help in establishing a hierarchy between these two contributions to the self-energy. In\norder to achieve this, the applicability of this expansion is restricted to the vicinity of the Fermi energy, where we know the\nphysics of the Kondo regime is contained. Following Wilson's\nlogarithmic discretization of the lead's density of states,7 the\nHamiltonian is rewritten by adopting hopping elements that\ndepend on the site index i:\n\nσ\n\nis taken as the perturbation in the many-body diagrammatic\nexpansion for the Green functions. This step represents the\nembedding of the cluster into the rest of the system.\nFor the sake of clarity, we restrict the discussion to the local diagonal Green function at the impurity site, while it is\nstraightforward to calculate a non-diagonal Green function at\ntwo arbitrary sites i and j following the same prescriptions.\nTo obtain the causal Green functions we follow the standard\nframework of an expansion in terms of Feynman diagrams.38\nThe causal Green function for the impurity site can be obtained from\nD\nE\nT {c0σ (t)c†0σ (t′ )S(∞)}\n0\nG00,σ (t − t′ ) =\n,\n(9)\nhS(∞)i0\nwhere, as usual, S(∞) is the evolution operator and T is the\ntime order operator. The mean values are calculated in the\nground state of the unperturbed Hamiltonian H0 .\nThe evolution operator S(∞) is expanded in increasing orders of Hp , which, when replaced in Eq. (9), gives rise to a\nperturbation series for the Green function.\n\nti =\n\n(1 + λ−1 )\nt\n2λ(i−1)/2\n\n(12)\n\nwhere λ > 1 is a constant, i ≥ 1 (i = 0 being the position of the impurity), and we take t = 1 as the unit of energy. Note that in the limit of λ → 1, the above expression\nfor ti describes a semi-elliptical band, rather than the flat band\ncommonly used in standard NRG calculations; however, close\nto the Fermi energy the two bands have the same low-energy\nphysics. It is worth noting here that the above discussion applies to both ECA and LDECA, with the exception that in\nECA λ is taken to be 1, implying that the band is not discretized.\nThe implications of this logarithmic discretization with\nrespect to the contribution of the Hilbert space states are\ntwofold: (i) near the dot, states of all energies are taken into\naccount; (ii) of the states far from the dot, only those near\nthe Fermi level are considered, while high energy ones are\nneglected.40 Although by this procedure high energy scales\nare not well treated, it permits to accurately describe much\nsmaller energy scales than it is possible with λ = 1, for the\nsame cluster size. This procedure is justified if the physics of\n\n\f4\nthe problem depends only on states with energy close to the\nFermi level, as it is the case in the Kondo effect, discussed in\nthis paper.\nAs discussed in the appendix, around Eq. (A26), from\nEqs. (A18) and (A19) one realizes that ΣσN ∼ λ−(N −1) and\nΣσ0 ∼ f (N ) λ−(N −1)N/2 , such that\nΣσ0 (ω)\n∼ f (N ) λ−(N −1)(N/2−1) .\nΣσN (ω)\n\nright\nlead\n\nlead\n1\nt'\n\nt'\n\n(13)\n\nThe function f (N ) is an intricate function of N which goes\nasymptotically to zero as N increases above the Kondo cloud\nlength ξK , wich has a magnitude inversely proportional to the\nKondo temperature41. This is the reason why even for λ = 1\n(ECA), the self energy Σσ0 will eventually become negligible\nin the limit of N ≫ ξK and can be disregarded for sufficiently large N. However, this is a length scale typically much\nlarger than the value for which, according to Eq. (13), the\nσ\nσ\nself energy\n√ Σ0 can be neglected in comparison to ΣN . Taking λ = 2, for example, for a cluster with N = 9, we get\nΣσ0 /ΣσN ∼ 10−5 , reflecting the fact that, for a cluster size\nwhich permits diagonalization with a relatively modest numerical effort, the contribution to the self-energy can be reduced to ΣσN . This is a very favorable situation because Σσ0\nis a very complex object (see Appendix) that can be obtained\nonly approximately, while ΣσN is very simple and can be calculated exactly. Therefore, here lies the key reason to introduce the logarithmic discretization into the procedure.\nWithin this approximation, i.e., neglecting Σσ0 , the embedding is carried out using Eq. (A18) and therefore, Eq. (10) can\nbe simplified to\n(0)\n\n(a) left\n\n(0)\n\nG00σ (ω) = G00σ (ω)+G0N σ V 2 gN +1,σ (ω)GN 0,σ (ω) . (14)\nNote that the Green function of the semi-infinite linear\nchain at the site N+1, gN +1,σ (ω), representing the leads, depends on the value of the parameter λ. For λ = 1, it is the\nGreen function,√\ng sc , of a uniform semi-linear chain, given by\nsc\ng (ω) = (ω ± ω 2 − 4t2 )/(2t2 ).\nBefore presenting results obtained with LDECA in the next\ntwo sections, we want to discuss some general aspects of the\nembedding procedure. If we were to study the low energy\nexcitations by diagonalizing an undressed cluster without performing the embedding, the necessity of incorporating a large\namount of states lying in the Kondo peak region would require the diagonalization of a cluster of N sites such that\nλ−N/2 t . Tk , i.e., the energy scale associated with the broken link V in Fig. 1(a) would have to be less than the Kondo\ntemperature. In order to fulfill this condition, and at the same\ntime choose a value of λ that still adequately describes the\nneighborhood of the Fermi energy, the value of N would have\nto be such that the Lanczos diagonalization would become\nimpractical due to the size of the Hilbert space. The embedding process solves this problem in a simple way by rendering\nthe numerical diagonalization of a small cluster compatible\nwith a correct description of the energy region immediately\naround the Fermi by allowing the contribution Σσ0 (ω) to the\nself-energy to be disregarded. This approximation, even for\nλ = 1, has shown to be surprisingly reliable to reproduce the\n\n1\n\n(b) left\nlead\n\nt''\n2\n\nright\nlead\nt'\n\nc\n\nFIG. 2: (Color online) Sketch of the quantum dot geometries studied\nin this work. (a) Single quantum dot connected to two leads. (b) Two\nside-connected quantum dots studied in Sec. IV.\n\nKondo regime properties of various systems, showing sufficiently fast convergence with cluster size.34,42\n\nIII.\n\nRESULTS: LDECA AND 1QD\n\nIn this section, LDECA is applied to study the conductance\nand the local density of states (LDOS) of a single quantum dot\nconnected to two leads [see Fig.2(a)]. This case allows for a\ncomparison of our results with an exact solution obtained from\nBA.6 Applying a standard basis transformation onto symmetric and anti-symmetric combinations of states (at sites located\nsymmetrically with respect to the dot) the two-leads Hamiltonian can be effectively written as having only one lead, rendering it identical to Eq. (1). This shows that this example\nconstitutes a one-channel Kondo problem.43\n\nA.\n\nThe local density of states\n\nWe start with a discussion of the effect of the λdiscretization on the LDOS. We expect that a larger density\nof poles close to the Fermi energy EF is induced by the discretization, while fewer poles will be present away from EF .\nThe first aspect, the accumulation of poles close to EF is advantageous to properly describe Kondo physics. To still obtain\na reasonable approximation to the LDOS away from the EF , it\nturns out that it is preferable to use a ω-dependent broadening\nscheme, and we first detail this technical aspect.\nThe dressed LDOS at the impurity is a collection of poles\nlocated at ωp , each one with its own weight Wp , given by the\nnon-linear Dyson equation used in LDECA. As a consequence\nP\nof the LDOS normalization, the weights satisfy p Wp =\n2. In order to avoid distorting the LDOS curve through the\nartificially large separation of the poles away from the Fermi\nenergy caused by the logarithmic discretization, and following\n\n\f(a)\n\n1\n\nπΓ LDOS\n\nλ=1\n\n0.5\n\n0.5\n-0.05\n0\n1\n\n0\n\n0.05\n\nω/U\n\n1\n\n(b)\nλ=2\n\nπΓ LDOS\n\n0\n\n0.5\n\n0.5\n-0.05\n\n0\n\n0.05\n\nω/U\n\n0.5\n\n(c)\nλ=4\n\nπΓ LDOS\n\n0\n\nπΓ LDOS\n\n0\n1\n\n0.25\n\n0.5\n-0.04\n0\n\nπΓ LDOS\n\n1\n\nπΓ LDOS\n\n5\n\n-1\n\n0\n\nω /U\n\n1\n\n0\n\n0.04\n\nω/U\n\n0\n\n2\n\nFIG. 3: (Color online) (a)-(c): Local density of states for λ = 1, 2\nand 4, respectively, and a cluster size L = 8. Thin (red) lines represent the LDOS as obtained directly from the LDECA procedure\n(ECA in the case of the top panel), while thick (black) lines are the\nLDOS for the same parameters, but after the broadening of the resonances using (Eq. 15) has been applied, as explained in Sec.III A.\nIn the insets, we show a comparison of the LDOS of the bare cluster (thin (blue) line) and after embedding (thick (red) line) for small\nvalues of ω. All calculations done for U = 1.0 and U/πΓ = 6.3.\n\nvalues of λ (thin red line) calculated with LDECA with a cluster of L = 8 sites. An imaginary part η = 0.001, common to\nall poles, was used for all curves that are obtained with a plain\nLorentzian broadening of delta-functions (thin (red) lines in\nthe main panels). The thick black lines show the LDOS using\nthe logarithmic Gaussian broadening with b = 0.5. In this\ncase, we obtain the characteristic LDOS for the Kondo problem, consisting of a three-peak structure, with two of them\nlocated at ω = Vg and ω = Vg + U and the third one, the\nKondo resonance, located at the Fermi level EF = 0. The\nnotable difference between the LDOS for λ = 1 and λ > 1 is\nthe sizeable narrowing of the Kondo peak, in qualitative agreement with NRG36 (compare panels (a) with panels (b) and (c)\nin Fig. 3). A more quantitative comparison with, e.g., NRG,\nwill be presented elsewhere. We wish to draw the reader's attention to the inset of each panel, showing a comparison of\nthe undressed LDOS [thin (blue) line] with the dressed LDOS\n[thick (red) line]. One can clearly see that the LDOS for the\n'bare' cluster (before embedding) vanishes at the Fermi energy, while the LDOS after embedding is finite at ω = 0,\ncorroborating the notion that the embedding step is crucial to\ncapture Kondo physics.\nFigure 4(a) shows the LDOS for several values of the hybridization parameter Γ at the particle-hole symmetric point,\nand Fig. 4(b) for a fixed ratio of U/πΓ = 3.5 and several\nvalues of the gate potential. We define the hybridization as\nΓ = πρ0 t′2 , where ρ0 is the band density of states at the Fermi\nlevel. The top panel illustrates how the width of the Kondo\nresonance, i.e., TK , decreases when Γ is reduced. In the bottom panel, we see how the LDOS for a fixed U/πΓ = 3.5\nchanges as the gate potential Vg is varied. Note that the Kondo\nresonance is pinned at EF . In contrast, for |Vg | > U [dashed\n(green) curve, for Vg /U = −1.7] the quantum dot is doubly occupied and therefore there is no Kondo effect. In such a\ncase, the LDOS has just one broad peak located at ω = Vg +U .\n\nB.\n\nmethods employed in NRG,36,44 we write the LDOS as a sum\nof logarithmic Gaussians,44\n2\n\nρ(ω) =\n\nX\np\n\ne−b /4\n√ exp\nb Wp π\n\n\u0012\n\n(ln ω − ln Wp )2\nb2\n\n\u0013\n\n(15)\n\nwhere b is an arbitrary number that defines, together with Wp ,\nthe width of a pole located at ωp . We choose logarithmic\nGaussians to represent the delta functions rather than the usual\nGaussians or Lorentzians because this function is asymmetric\nwith respect to ωp . This asymmetry, which effectively shifts\nthe spectral weight of each pole to higher energies, compensates for the accumulation of poles at low energies in relation\nto higher energies, caused by the logarithmic discretization.44\nAs pointed out in Ref. 36, this procedure results in highenergy peaks that are slightly broader and asymmetric than\nin the case of the true LDOS.\nIn Fig. 3, we show the LDOS at the impurity for the\nparticle-hole symmetric situation Vg = −U/2 and different\n\nThe conductance\n\nNext, we demonstrate the effect of the λ-discretization on\nthe conductance. The conductance as a function of the gate\npotential Vg for a single embedded quantum dot is calculated\nby using the Keldysh formalism.43 In Fig. 5 (a), we present\nthe conductance for a fixed cluster size (L = 12) and different\nvalues of λ, together with the exact value obtained by the BA.6\nFor λ = 1 (dot-dashed curve), there is a large discrepancy\nwith the exact results: The conductance peak is too narrow,\nindicating that, in this case, the role played by the self-energy\nΣσ0 cannot be neglected. However, for λ = 2 (dotted curve), a\nvalue typically used in NRG calculations,7 our LDECA results\nsubstantially improve over the ECA ones (i.e., λ = 1), and for\nvalues of λ between 3 (dashed curve) and 4 (large-dots curve),\nthe results accurately agree with BA. We have verified that\nLDECA reproduces BA results for U/Γ as large as U/Γ = 25.\nAs discussed above, the effect of neglecting the self-energy\nΣσ0 depends on both the value of λ and the size of the cluster.\nThe dependence of the conductance on cluster size is shown\nin Fig. 5 (b) for λ = 4 and L = 4, 8, and 12. Beyond a cluster\n\n\f6\n1\n\n(a)\n\nG / G0\n\nU/πΓ = 1.5\nU/πΓ = 3.5\nU/πΓ = 6.3\n\nπΓ LDOS\n\n1\n\n(a)\n\nλ=4\nλ=3\nλ=2\nλ=1\nBA\n\n(b)\n\nBA\nL = 12\nL=8\nL=4\n\n0.5\n\n0.5\n\n0\n-10\n\n0.5\n\n0\n\n5\n\nω / πΓ\n\nVg/U= -0.24\nVg/U= -0.5\nVg/U= -1.7\n\n-1\n\n0\n-1.5\n\n-1\n\n0\n\n-0.5\n\nVg/U\n\n0.5\n\n0.5\n\n-0.04\n\n0\n\n0.5\n\n1\n\n(b)\n\nπΓ LDOS\n\nπΓ LDOS\n\n1\n\n-5\n\nG / G0\n\n0\n1\n\n0\n\nω/U\n\n0\n\nω/U\n\n1\n\n0.04\n\n0\n\n2\n\nFIG. 4: (Color online) (a) Local density of states for the particlehole symmetric gate potential Vg = −U/2 for U = 1.0, λ = 2, and\ndifferent values of U/πΓ, going from the Kondo regime (U/πΓ =\n6.3) to the intermediate valence regime (U/πΓ = 1.5). (b) LDOS\nfor three different values of the gate potential for U/πΓ = 3.5 and\nλ = 2. The inset shows a comparison of results for Vg /U = −0.24\nbetween λ = 2 [solid (black) curve, same as in the main panel] and\nλ = 1 [dashed (blue) curve]. This illustrates the better 'pinning' of\nthe Kondo peak to the Fermi energy, achieved with λ > 1.\n\nFIG. 5: (Color online) Comparison of LDECA and BA. Conductance\nvs. Vg for U = 0.96 and t′ = 0.2. (a) LDECA for L = 12 and the\nvalues of λ indicated. (b) LDECA for L = 4, 8, and 12, with λ = 4.\nThe BA result is the solid black line in both (a) and (b).6\n\nVg /U = −0.24 curve presented in panel (b), which was calculated with λ = 2. The dashed (blue) curve has been calculated\nwith the same parameters, but for λ = 1. The comparison\nclearly shows that the λ = 2 result has more spectral weight\nat the Fermi energy than the λ = 1 result. This increase of the\nspectral weight in the LDOS is at the heart of the improvement\nachieved for the conductance by using the band discretization.\n\nIV. RESULTS: LDECA AND A TWO-STAGE KONDO\nSYSTEM\nA. Overview: Regimes of the model\n\nsize Lc (λ), the conductance is almost independent of L. For\ninstance, for λ = 4, results for L > 8 are indistinguishable.\nThis characteristic length Lc (λ) decreases as λ increases. As\nλ controls the extension of the neighborhood of the Fermi energy that is accurately described, i.e., the larger the value of\nλ, the smaller this region is, a compromise has to be found\nbetween the size of the cluster and the extension of the energy\nregion around the Fermi energy that needs to be accurately described. Obviously, this depends on the model and the property being analyzed. The important point to be emphasized\nis: the results in Fig. 5 show that, with a value of λ similar to\nthe one widely used by the NRG community, it is possible to\nreproduce the exact results using a cluster size accessible to\nthe Lanczos algorithm.\nIt is also interesting to note that the improvement of the\nconductance results for λ > 1 as compared to λ = 1 are\nassociated with a better 'pinning' of the Kondo peak to the\nFermi energy. This can be partially inferred from the LDOS\nresults shown in Fig. 4(b), where the two solid curves have\nthe Kondo peak pinned at the Fermi energy. This statement\ncan be made more quantitative by considering the results in\nthe inset of Fig. 4(b), showing a comparison between λ = 1\nand 2. In that inset, the solid (black) curve is an enlarged\nview of the LDOS at the vicinity of the Fermi energy for the\n\nWe next analyze a system composed of a double-dot sideconnected to a lead. The inter-dot and dot-lead connections\nare given by the matrix elements t′′ and t′ , respectively, as\nsketched in Fig. 2(b). The transformation to symmetric and\nantisymmetric states is applied, since we again deal with a\none-channel Kondo problem. After performing that transformation, the Hamiltonian is given by:\nHT = Vg\n\nX\n\nndσ + U/2\n\nd,σ\n\nX\n\nndσ ndσ̄\n\nd,σ\n\n√ X †\n+t′ 2\n(cd2 σ c1σ + c†1σ cd2 σ ) + Hband (16)\nσ\n\nHband =\n\n∞\nX\n\nti (c†iσ ci+1σ + c†i+1σ ciσ ) ,\n\ni=1σ\n\nwhere we use the ti as given in Eq. (12), and d = d1 , d2 ,\nlabeling dot 1 and dot 2, respectively.\nThe transport properties of this two-dot system can be expected to be controlled by the interplay between the Kondo\neffect and the antiferromagnetic inter-dot correlation, and by\nthe interference arising from the two distinct paths available\nto the electrons: visiting or bypassing the dots.26\n\n\f7\n\nIn the molecular regime, on the one hand, both dots act as\na single entity, in a way that, as a function of the gate potential, whenever an overall finite magnetic moment is located in\nthe structure, the system exhibits a single-stage Kondo effect.\nIn this regime of t′′ ≫ t′ , the system essentially behaves as a\nsingle-dot with the two relevant levels separated by a large energy. On the other hand, in the limit of a small t′′ /t′ , such that\nthe effective antiferromagnetic spin-spin interaction between\nthe dots satisfies J=4(t′′ )2 /U < TK , the system is in the twostage Kondo regime, which is characterized by a new energy\nscale T0 related to dot 1, much lower than the Kondo temperature TK associated to dot 2. For T < T0 , very low energy\nphysics is involved,25,26 difficult to be captured by numerical\nmethods such as standard ECA or DMRG. Yet, as shown below, a correct result for the conductance can be obtained from\nLDECA.\nNote that TSK behavior may manifest itself both as a function of temperature at a fixed gate potential26 and as a function\nof gate potential at a fixed temperature.28 As our method is a\nzero-temperature one, we will here focus on the gate potential\ndependence of the conductance and other quantities. We will\nargue that as one starts from the empty orbital regime, first a\nsingle Kondo effect emerges at Vg & 0, which causes a suppression of the conductance. As the gate potential is further\ntuned towards Vg = −U/2, the magnetic moment of dot 1 is\neventually Kondo-screened as well through the quasi-particles\nof the composite system of dot 2 and the lead. This gives rise\nto the aforementioned singlet between dots 1 and 2, which\nleads to perfect conductance at Vg = −U/2.\nThe plan of this section Sec. IV is thus the following. We\nfirst demonstrate in Sec. IV B that indeed, a singlet is formed\nbetween the two dots, independently of t′′ /t′ . These results\nare obtained with both DMRG and a diagonalization of the\nbare clusters, before the embedding process. Second, we compute the conductance and charge as a function of gate potential\nand discuss these results both in the molecular and the TSK\nregimes in Secs. IV C and IV D, respectively. We further aim\nat illustrating how the properties of the system change as it\ncrosses over from the molecular regime into the TSK regime.\nFinally, at particle hole symmetry (Vg = −U/2), we present\nLDECA results for the LDOS at the dots and the conductance\nas a function of t′′ /t′ . As a key result, we demonstrate that\nusing the discretization of the band, LDECA produces perfect\nconductance down to very low values of t′′ /t′ , a result which\nwas previously out of reach for ECA (λ = 1).\n\n0\n\n< Si Sj >\n\n(a)\n\n<S2Sc> λ=2, L=9\n<S1S2> λ=2, L=9\n\n-0.2\n\n<S2Sc> DMRG\n<S1S2> DMRG\n\n-0.4\n-4\n\n-2\n\n0\n\n2\n\nVg/U\n0\n\n< Si Sj >\n\nAs previously discussed in the literature, systems similar to\nthe one depicted in Fig. 2(b), such as, for instance, the socalled T-configuration,26,28 exhibit two distinct regimes depending on the ratio t′′ /t′ : (i) when t′′ ≫ t′ , one is in the\nmolecular regime and (ii) for t′′ ≪ t′ , the system crosses over\ninto the TSK regime. It is important to realize that independently of t′′ , we expect perfect conductance at Vg = −U/2.\nIndeed, at the particle-hole symmetric point the dots always\nform a singlet, which is of different nature though, depending\non the ratio t′′ /t′ , as explained below.\n\n-0.2\n\n<S2Sc> λ=6, L=11\n\n(b)\n\n<S1S2> λ=6, L=11\n<S2Sc> DMRG\n<S1S2> DMRG\n\n-0.4\n-0.6\n-1.5\n\n-1\n\n-0.5\n\n0\n\n0.5\n\nVg/U\nFIG. 6: (Color online) Spin-spin correlations calculated by Lanczos\nand DMRG as a function of Vg for U = 1.0 and t′ = 0.3. (a) t′′ =\n2.0 (molecular regime) and (b) t′′ = 0.05 (TSK regime). Lanczos\nwith L = 11 and λ = 6, hS1 * S2 i (solid) and hS2 * Sc i (dashed)\nblack lines; DMRG with 196 sites at half filling of the full system\nand λ = 1, hS1 * S2 i (circles) and hS2 * Sc i (squares).\n\nB. Spin-spin correlations\n\nFor the present model, we now establish the presence of a\nstrong antiferromagnetic correlation between the dots by analyzing the spin-spin correlations as a function of Vg , presented\nin Fig. 6 for both t′′ = 2.0 (upper panel) and t′′ = 0.05 (lower\npanel), with t′ = 0.3 in both cases. Results are for large clusters with 196 sites and λ = 1, obtained with DMRG, and\nalso for L = 9 and λ = 2 (upper panel), and for L = 11\nand λ = 6 (lower panel), using a Lanczos diagonalization\nprocedure. Both DMRG and Lanczos calculations were done\nwithout embedding.\nIn the case of the molecular regime [t′′ = 2, Fig. 6(a)], the\ninter-dot correlation hS1 *S2 i is large for −2.5 . Vg /U . 1.5.\nTherefore, we expect a perfect conductance in that window,\nand a Kondo anti-resonance to appear at Vg /U & 1.5 (see\nFig. 9(a), below). For the smaller t′′ = 0.05 [Fig. 6(b)], the\nantiferromagnetic correlation between the dots is dominant in\nthe window −U < Vg < 0, indicating the formation of a singlet. While the inter-dot spin correlation hS1 * S2 i is large at\nthe electron-hole symmetric point Vg = −U/2, the antiferromagnetic correlation hS2 * Sc i, although small, is not zero.\nNote that site c is adjacent to dot 2, see Fig. 2(b). For instance,\n\n\f8\n\n<S1S2>\n\n0\n<S2Sc> λ = 6, 11 sites\n<S2Sc> DMRG 196 sites\n\n-0.2\n\n<S1S2> λ = 6, 11 sites\n<S1S2> DMRG 196 sites\n\n0\n-0.01\n\nMolecular\n\n-0.02\n\nRegime\nt\nt\n\n<S2Sc>\n\n-0.1\n\n-0.3\n\n-0.03\n\n-0.4\n\n-0.04\n\n0\n\n0.5\n\n1\n\n2\n\n1.5\n\nt'' / t'\n\n-0.5\n\n(b)\n\n(a)\n\nBonding\nAnti bonding\nstates\n\n1\nt''\n\nleft\nlead\n\n2\nt'\n\nright\nlead\n\nc\n\nAB\n\n(c)\n\n(d)\nAB\n\nG 0\n-0.6\n\nG G0\nEF\n\nG 0\nEF\n\nB\nB\n\n-0.7\n0\n\nEF\nAB\n\n0.5\n\n1\n\n1.5\n\n2\n\nB\n\nt''/t'\nFIG. 7: (Color online) Spin-spin correlations as a function of t′′ /t′\nfor U = 1.0, t′ = 0.3 and Vg = −U/2. See legend and Fig. 6 for\nthe description of the lines.\n\nhS2 * Sc i takes a maximum at Vg ≈ 0 in the case of t′′ = 0.05,\nindicative of the single-stage Kondo effect that is observed in\nthat gate potential region [see Fig. 11(a)].\nWe now study both correlations as a function of t′′ /t′ at\nVg = −U/2, which is displayed in Fig. 7. An important\nobservation is that hS2 * Sc i increases in magnitude as t′′ is\nreduced, as is shown in the inset of Fig. 7. This fact indicates the subtle existence of a Kondo-like ground state, which\nis strengthened when t′′ is reduced. In addition, the antiferromagnetic inter-dot correlation, presented in the main panel\nof Fig. 7, also increases when t′′ is reduced, taking values\nas large as hS1 * S2 i ≈ −0.7, for t′′ /t′ & 1/10. This is\nsurprising, since the interplay of these two correlations has\na behavior opposite to other known systems, such as heavy\nfermions near a quantum phase transition45 or embedded twodot nanostructures.42 It reflects the existence of an inter-dot\nsinglet for all values of t′′ >0. However, the nature of the singlet for small t′′ /t′ is different from that for the large t′′ /t′\nregime. While in the latter case the singlet, which is caused\nby the direct interaction between the dots, destroys the Kondo\nregime, in the former case it is enhanced by the Kondo spin\ncorrelation with the intervention of the conduction electrons,\nas shown by the fact that the inter-dot and the Kondo spin\ncorrelations increase when t′′ is reduced. These results illustrate the characteristics of a TSK state. The comparison of\ndata from large clusters (196 sites, λ = 1) and short ones\n(L = 11, λ = 6) yields a convincing agreement for the spin\ncorrelations, especially for hS1 * S2 i, governing the inter-dot\nsinglet. This agreement indicates that the spin-spin correlations are, so to speak, localized objects. The embedding process is not as important to calculate static properties as it is\nfor the conductance, which we shall see later. Still, the vanishing of hS1 * S2 i at very small t′′ /t′ on the smaller cluster\nreflects that, in this particular limit, the embedding is crucial\nto overcome this finite-size effect. An important point that we\nwant to emphasize here is that the molecular and TSK results\nsuggest perfect conductance at Vg = −U/2 for any nonzero\nt′′ .\n\nFIG. 8: (Color online) Schematic representation of the molecular\nregime. (a) When t′′ ≫ t′ , the two dots form a single entity, represented by the shaded box. (b) - (d) Different regimes at different\nvalues of gate potential: (b) Kondo effect for the bonding orbital\n(zero conductance, because of the back-scattering density of states\nat the Fermi energy EF ), (c) Perfect conductance at Vg = −U/2\n(no back-scattering density of states at EF ), (d) Kondo effect for the\nanti-bonding orbital (zero conductance).\n\nC. Molecular regime\n\nWe proceed with an analysis of the conductance for the socalled 'molecular' regime. In Fig. 8(a), we schematically illustrate what happens for t′′ /t′ ≫ 1.0, i.e., when the independent dots are 'locked' into 'molecular' bonding and antibonding orbitals, separated by a large energy, proportional to\nt′′ . The two dots now behave as a single structure, represented\nby the dashed square box, side-connected to the leads. The effect of these molecular orbitals over the conductance through\nthe leads, as the gate potential Vg varies, is pictured in panels\n(b) to (d), where now the bonding and anti-bonding orbitals\nare depicted inside a quantum well. In panel (b), the bonding orbital is in the Kondo regime. As the double-dot structure is side-connected to the leads, the conduction electrons\nare back-scattered, resulting in zero conductance.46 Panel (c)\nshows that, at the particle-hole symmetric point Vg = −U/2,\nthe bonding orbital is doubly occupied, lying below the Fermi\nenergy EF , and the anti-bonding orbital, lying above EF , is\nempty. Therefore, in this case, the double-dot structure creates\nno back-scattering density of states at EF [as schematically\nindicated in the panel (c)], resulting in perfect conductance.\nFinally, panel (d) displays the corresponding Kondo effect for\nthe anti-bonding orbital, also resulting in zero conductance.\nFigure 9 shows the conductance and the charge vs. gate\nvoltage in the molecular regime as obtained with LDECA for\nt′′ = 2.0, t′ = 0.3, and U = 1 on a cluster with L = 11 sites\nand λ = 2. In this plot, one observes the two Fano-Kondo\nanti-resonances, with an approximate width of U/2, originating from two 'molecular' levels separated by ≈ 2 × t′′ + U/2.\nIt is important to emphasize that in the molecular regime the\ntwo dots behave as a unique entity, providing an extra lateral\n\n\f9\n\nTwo stage\nKondo regime\n\nAB\nAB\n\nG 1\n\nG 0\n\nG 0\n\nEF\nAB\n\nEF\n\nEF\n\nt\n\nB\n\nB\n\n(a)\n\nB\n\nAB\n\nU/2\n\nB\n\n0.5\n\n0\n-4\n\n-3\n\n-1\n\n-2\n\n1\n\n0\n\n0\n3\n\n2\n\n(b)\n\nVg/U=1.78\n\n(c)\n\nB\nAB\n\nVg = -U/2\n\n0.5\n\n0.04\n\n-0.5\n\n0\n\nω/ U\n\n0.5\n\n1\n\n-6\n\n-3\n\n0\n\nω/U\n\n3\n\n6\n\nc\n\nTSK\nsinglet\n\n2\nt'\n\nr l\n\nG 0\n\nc\n\nl l\n\ne\n\nr l\n\nG G0\n\n0.08\n\nπΓ LDOS\n\nπΓ LDOS - B\n\n1\n\n1\nt''\n\nKondo\nCoupling\nt'\n\nl l\n\ne\n\nVg / U\n\nU 2\n\nVg\n\n2\n\n0.5\n2 t\" + U/2\n\n0\n-1\n\n(b)\n\n0\n1\nt''\n\n1\n\n(a)\n\nn1 , n2\n\nG / G0\n\n1\n\nVg\n\nt\n\n0\n\nFIG. 9: (Color online) (a) Conductance and charge as a function of\nVg for the molecular regime (U = 1.0, t′ = 0.3, and t′′ = 2.0)\nfor the two side-connected quantum dots. Notice that each feature of\nthe conductance is associated to the respective diagram introduced\nin Fig. 8. Panel (b) displays the LDOS for the bonding state (B)\nfor Vg /U = 1.78 (the anti-bonding state (AB) has an identical peak\nfor Vg /U = −2.78). Panel (c) displays the LDOS for the bonding\n(solid (black) line) and anti-bonding (dashed (red) line) states at the\nparticle-hole symmetric point Vg = −U/2. λ = 2 for all calculations.\n\npath for the electrons to traverse when visiting the Kondo peak\nderived from the molecular orbital. This gives rise to the Fano\nantiresonance in the conductance appearing in Fig. 9(a). As\nexpected, both dots are charged almost simultaneously, as one\ncan see in Fig. 9(a), with a dashed line for dot 1 and a solid\nthin line for dot 2. In the top of Fig. 9, the corresponding\npotential wells described in Fig. 8 are displayed.\nTo illustrate the idea of a 'molecular orbital Kondo effect',\nin the lower left panel, we display the LDOS associated with\nthe molecular bonding orbital formed with the two dots. This\nLDOS is calculated at the positive gate potential at which the\nconductance is zero, which turns out to be at Vg ≈ t′′ − U/4,\nas expected. We find the 'molecular' Kondo peak at the Fermi\nenergy, as well as the broadened ǫ and ǫ + Ũ levels, where the\nrenormalized intra-orbital Coulomb repulsion Ũ = U/2 can\nbe obtained by rewriting the dot Coulomb repulsion in the basis of the bonding and anti-bonding orbitals. A similar result\n(not shown) is found for the LDOS of the antibonding orbital\nat the Vg value for which the second Kondo-Fano resonance\noccurs. The LDOS for each quantum dot (not shown) also exhibits a Kondo peak. Indeed, since the two dots equally participate in the molecular Kondo effect, their LDOS are quite similar to each other, and qualitatively similar to what is shown\n\nFIG. 10: (Color online) Schematic representation of the TSK regime,\nobtained when t′′ ≪ t′ . (a) Sketch of the first Kondo stage, when\nthe two dots are occupied by a single electron, which forms a Kondo\nsinglet with the conduction electrons, represented by the vertical antiparallel arrows (one in the dots, the other in the band). The Kondo\ncoupling, which mediates the formation of the many-body singlet, is\nrepresented by the (yellow) lightly shaded oval. The density of states\ncreated by the Kondo effect in dot 2 at the Fermi energy induces\nbackward scattering of the conduction electrons going through the\nleads (horizontal antiparallel arrows). This results in zero conductance. (b) At Vg = −U/2, when the dots have total charge n = 2,\nthe spins in the dots are locked into a singlet (darker shaded oval).\nThis singlet is mediated through two Kondo effects, represented by\nthe underlying lighter (yellow) oval. The combination of these two\nKondo effects, in contrast to the case in panel (a), removes density of\nstates from dot 2 exactly at the Fermi energy, suppressing the backscattering and resulting in perfect conductance. This is represented\nby the rightward arrow 'piercing' the Kondo coupling oval.\n\nin Fig. 9(b). Finally, in Fig. 9(c), we show the LDOS for both\nthe bonding and anti-bonding orbitals for Vg = −U/2, where\nclearly the Kondo peak is absent and the two orbital levels are\nseparated by about 2t′′ .\nD. Two-stage Kondo regime\n\nFigure 10 schematically depicts a much more subtle regime\nthan that of Fig. 8, the TSK regime. One enters into this\nregime when t′′ ≪ t′ , where now the connection of dot 2\nwith the leads is much stronger than the inter-dot connection.\nHere, the concept of bonding and anti-bonding orbitals does\nnot apply, since each dot feels the interaction with the conduction electrons differently, the crucial point being that dot 1\ninteracts with the Fermi sea through dot 2.\nIn this and the next section, we will present evidence that\nour LDECA results are perfectly consistent with the notion of\nTSK behavior. As a guidance to interpreting the numerical\nresults, this behavior can be schematically described as follows. In Fig. 10(a), where the gate potential Vg is such that\nthe charge occupancy of the two dots is 1, i.e., n1 + n2 = 1,\na Kondo effect develops, represented by the oval shape with\n\n\f10\nλ=1\n\nλ=4\n\nλ=6\n\n(a)\nt\"=0.2\nt\"=0.15\nt\"=0.125\n\nsinglet\n\n0.3\n\n0\n-0.5\n\n0.5\n\n0.2\n0.1\n\n(b)\n0.5\n\ntc'' / t'\n\nTSK\n\n0.5\n\n0\n1\n\nn1 , n2\n\nλ=2\n\n1\n\nG / G0\n\nG / G0\n\n1\n\nKondo\nCoupling\n\n0\n\n0\n\n0.09\n\n0.36\n-1\n\n0.81\n\nλ\nn1 - t\"=0.125\nn2 - t\"=0.125\n\n0\n0\n\n0.25\n\n0.5\n\n0.75\n\n1\n\nt'' / t'\n-0.25\n\n0\n\n0.25\n\n0.5\n\n0.75\n\nVg / U\nFIG. 11: (Color online) (a) Conductance and (b) charge in the dots\nas a function of Vg for values of t′′ < t′ (U = 1.0, t′ = 0.3, and\nvalues of t′′ as indicated). See text for discussion. All √\ncalculations\nare for λ = 2.0, except for t′′ = 0.125, where λ = 6. Notice\nthat the conductance and charge features at Vg ≈ 0 and Vg = −U/2\nwere associated to the schematic diagrams introduced in Fig. 10.\n\ndashed borders, resulting in back-scattering and a vanishing conductance, as indicated by the horizontal arrows. The\nKondo effect involves a magnetic moment located in the dots,\nwhich is screened by the conduction electrons, indicated by\nthe arrow on the dot and an antiparallel one in the band.\nIn Fig. 10(b), depicting the situation for Vg = −U/2, the\ntwo dots are each singly occupied and a strong singlet forms\nbetween them, represented by the darker oval shape with a\nsolid border. Although in this regime the LDOS of dot 2 is\nexactly zero at the Fermi energy, therefore suppressing the\nback-scattering and restoring perfect conductance (this is represented by the arrow 'piercing' the lighter shaded oval), it\ndoes not eliminate the Kondo spin-spin correlation between\nthe spin of dot 2 and the conduction spins. On the one hand,\nthe conduction electrons do not see the two dot system as a\nunique entity: Indeed, they recognize dot 2 as a separate object to which their spins correlate. On the other hand, the spin\nof dot 1 sees the rest of the system as a whole, and Kondo correlates with the spin of dot 2, thus creating the two-dot singlet\nstate. In reality, the singlet is a many-body effect involving\nthe conduction electrons and it is composed of two consecutive Kondo effects (represented here by the underlying lightly\nshaded oval).\nIn Fig. 11, we show the LDECA conductance [panel (a)]\nand the charge in each dot [panel (b)] as a function of Vg\nfor much lower values of t′′ than in the previous molecular\nregime, namely t′′ = 0.2, 0.15, and 0.125. Let us first discuss\nthe charge, as an example of a quantity that exhibits a qualitatively different behavior for high and low values of t′′ /t′ , with\nthe two dots behaving more independently as t′′ → 0.\nIn the small t′′ /t′ regime, dot 2 is charged first upon approaching Vg = 0, and only when it has a substantial amount\nof charge dot 1 starts to be charged as well [see Fig. 11(b)]. In\n\nFIG. 12: (Color online) Conductance vs. t′′ /t′ for U = 1.0, t′ =\n0.3, Vg = −U/2. Results are for L = 11 and λ = 1 (black circles),\nλ = 2 (red squares), λ = 4 (green diamonds) and λ = 6 (blue\ntriangles). In the inset, we show t′′c (λ)/t′ for L = 11 (black circles)\nand L = 5 (red squares).\n\naddition, around Vg ≈ 0 where the minimum in the conductance occurs due to the single-stage Kondo effect, the curve\nfor the charge of dot 2 features a much more well defined\nplateau than that for dot 1. This indicates that, in contrast\nto the molecular regime [see charge behavior in Fig. 9(a)],\nthe two dots now start to have a qualitatively different participation in the Kondo effect, suggesting that at this much\nlower value of t′′ /t′ and at Vg ≈ 0, one starts to see the\nemergence of the first stage of the TSK regime. (Notice that\nDMRG results for the charge and the total spin as a function\nof Vg for large clusters (not shown) agree with the LDECA\npicture just described). In addition, the width of the Kondo\nanti-resonance seen in Fig. 11(a) is now substantially smaller\nthan U/2, which is the typical value found in the molecular\nregime, see Fig. 9(a), although much larger than the intrinsic width of the dots' resonance states. Finally, as one approaches Vg = −U/2, and each dot now has one electron, the\nsecond stage of the TSK is reached. In this regime, through\nthe mediation of the conduction electrons, the interdot-singlet\nis formed and, although it shows a two-Kondo peak structure,\nthe LDOS of dot 2 is zero at the Fermi energy [see Fig. 13(b)].\nAs a consequence, the system exhibits perfect conductance\n[see Fig. 11(a)].\n\nE.\n\nConductance and LDOS at Vg = −U/2\n\nNext, we discuss the conductance at the particle-hole symmetric point as a function of t′′ to show that LDECA correctly\ncaptures the low-energy physics down to small values of t′′ .\nFigure 12 displays the conductance vs. t′′ for various values\nof λ and L = 11. We recall that, as exemplified in Figs. 9 and\n11, the conductance at Vg = −U/2 for any t′′ > 0 should be\nG = G0 . We study the electron-hole symmetry situation, as\nit is the most difficult point to be correctly described, having\nthe lowest Kondo temperature for the set of parameters taken.\n\n\f11\n\nFrom the curves for each different λ we can extract a characteristic inter-dot coupling t′′c (λ), satisfying G(t′′c )/G0 =\n1/2, below which the conductance rapidly approaches zero.\nThe dependence of t′′c on λ−1 for two different values of L is\nshown in the inset. t′′c (λ) tends to zero for values of λ that decrease with increasing cluster size. Therefore, at Vg =−U/2,\nG/G0 → 1 when t′′ → 0.\n\n0.03\n\nπΓ LDOS\n\n(a)\n\nt''= 2\n\n0.02 Vg=-U/2\n0.01\n0\n-6\n0.2\n\nπΓ LDOS\n\nThe suppression of the conductance for small values of t′′ /t′\nshown in Fig. 12 is caused by finite-size effects which obscure\nthe second stage Kondo effect. In this specific case, we find\nthe tendency of a strong suppression of spin fluctuations in\ndot 1 as the system approaches half-filling, (Vg = −U/2).\nThis behavior at λ = 1 is similar to other models discussed\nin detail in Ref. 21. Figure 12 suggests that the finite-size\ndependence of the conductance for λ = 1 (circles) is quite\nsevere, as it starts to manifest itself at t′′ /t′ ≈ 0.5. However,\nit is also evident that by increasing λ the situation improves\nmarkedly, which is the main message to be taken from this\nfigure.\n\n-4\n\n-2\n\n0\n\n2\n\nω/U\n\n(b) Vg=-U/2\n\n4\n\n6\n\n0.2\n\nt''= 0\nt''= 5E-2\n\n0.1\n\n0\n-1.5\n\n0\n\n-1\n\n-0.5\n\n0\n\n0.5\n\nω/U\n\n-0.06\n\n1\n\n0\n\n0.06\n\n1.5\n\n2\n\nTo further demonstrate the difference between the molecular and the TSK regimes at Vg = −U/2, Fig. 13 shows a\ncomparison between the LDOS for two widely different values of t′′ /t′ . In Fig. 13(a), we show the LDOS at dot 2 for\nt′′ = 2.0, t′ = 0.3, U = 1.0, and λ = 2. These are the same\nparameters as the ones used in Fig. 9(c), where the bonding\nand anti-bonding orbitals where shown. Figure 13(a) unveils\nwhy the conductance in the molecular regime is G = G0 at\nVg = −U/2 [see Fig. 9(a)], as dot 2 has a vanishing density of states in a wide energy region around the Fermi level.\nOnce there is no back-scattering density of states at the Fermi\nenergy, the conductance is perfect.\n\nFIG. 13: (Color online) (a) LDOS at dot 2 for L = 11, t′′ = 2,\nt′ = 0.3, U = 1, Vg = −U/2, and λ = 2 (same parameters as\nthe ones in Fig. 9(c), but here we show the LDOS of dot 2 only).\nNotice the large region of vanishing LDOS around the Fermi energy\n√\n(ω = 0). (b) Same as in (a), but now for t′′ = 5 × 10−2 and λ = 6\n(solid (black) line). Notice that, as in (a), the LDOS vanishes at the\nFermi energy, but now only in a very narrow interval. A comparison\nof the width of the double-peak structure at low ω with the LDOS\nresults for t′′ = 0 (dashed (red) line), i.e., for a single side-connected\ndot, suggests that the double-peak structure is a split Kondo peak. An\nenlarged view of the double-peak structure is seen in the inset.\n\nOn the other hand, in Fig. 13(b), LDOS\nresults for dot 2\n√\nare depicted for t′′ = 5−2 , and λ = 6, and the same values of t′ and U as in Fig. 13(a). Again, the density of states\nat the Fermi energy vanishes. However, in this case, close to\nthe Fermi energy, we find two sharp features, suggestive of\na Kondo peak split in two. To substantiate this picture, the\ndashed (red) curve in Fig. 13(b) shows the Kondo peak that is\npresent when t′′ = 0, i.e., when dot 1 is effectively removed.\nIt is the presence of dot 1, interacting with the rest of the system through dot 2, that gives rise to the TSK regime, reflected\nin the LDOS of dot 2 as an antiresonance in the middle of its\nKondo peak.\n\nV. SUMMARY\n\nIn summary, the fact that the Kondo regime of dot 1 is mediated by the Kondo state of dot 2 explains the surprising result\nof a perfect conductance at Vg = −U/2 in the TSK regime.\nThis mechanism reduces the LDOS at the Fermi level of dot 2\nto zero as shown in Fig. 13(b), eliminating an alternative path\nfor the circulating electrons and hence any destructive interferences. In this regime, the electrons at the dots form a spin\nsinglet, even at small t′′ /t′ . This subtle effect and its consequences on the conductance are well captured by LDECA.\nIt is then clearly shown in Figs. 12 and 13 that the logarithmic discretization of the band, combined with the embedding\nprocess, provides reliable results in a wide parameter range.\n\nIn this paper, we developed a formalism to study local and\nhighly correlated electrons that combines the numerical simplicity of the ECA method with Wilson's idea of a logarithmic discretization of the non-interacting band. A diagrammatic expansion that provides a solid theoretical basis for\nthe method was also discussed. Applied to a one-impurity\nproblem, LDECA yields an excellent agreement with BA results. In addition, following the same procedure used in NRG\nto broaden the LDOS, a perfect agreement was found with\nthe accepted results for the LDOS of the Anderson impurity model. In the case of a double-dot side-connected to a\nlead, and at small t′′ , the contrast between the λ=1 (ECA) and\nλ > 1 (LDECA) results exemplifies the power of the logarithmic discretization: the low-energy physics associated to\nthe TSK regime is correctly unveiled, as LDECA provides an\naccurate description of the physics close to the Fermi energy.\nThe main advantage of LDECA is its great flexibility, which\nallows the incorporation of other degrees of freedom, such\nas localized phonons or photons.47 The restrictions imposed\nby the Lanczos method can be overcome by using DMRG,17\nallowing one to use larger systems and to study more involved\nproblems. Related efforts are in progress.\nWe conclude that the LDECA method can be applied\n\n\f12\nto complex problems, including molecules adsorbed at a\nmetallic surface30 and sophisticated topologies of quantum\ndots, displaying exotic Kondo regimes, such as, for example,\nnon-Fermi liquid behavior, two-channel Kondo effect and the\nphysics associated to SU(N) systems.\nAcknowledgments - We thank K.A. Al-Hassanieh,\nL.G.G.V. Dias daSilva, E. Louis, V. Meden, N. Sandler, A.\nSchiller, and J. A. Verges for helpful discussions. E.V.A.\nand M.A.D. acknowledge the support of FAPERJ and CNPq\n(Brazil). G.Ch. acknowledges financial support by the Spanish MCYT (grants FIS200402356, MAT2005-07369-C03-01\nand NAN2004-09183-C10-08 and a Ramón y Cajal fellowship), the Universidad de Alicante and the Generalitat Valenciana (grant GRUPOS03/092). E.D. and F.H.-M. were supported by the NSF grant DMR-0706020 and by the Division\nof Materials Science and Engineering, U.S. DOE under contract with UT-Battelle, LLC. G.B.M. acknowledges support\nfrom NSF (DMR-0710529) and from Research Corporation\n(Contract No. CC6542).\n\nS(∞) =\n\n∞\nX\n\n−in\nn! S(∞)\nn=1\n\nZ\n\nt\n\n...\n\nt0\n\nAPPENDIX A: DIAGRAMMATIC EXPANSION\n\nIn this appendix we develop the diagrammatic expansion of\nthe one particle Green function at the impurity site given by\n\nG00,σ (t − t′ ) =\n\nD\n\nT {c0σ (t)c†0σ (t′ )S(∞)}\nhS(∞)i0\n\nE\n\n0\n\n,\n\n(A1)\n\nwhere, as usual, S(∞) is the evolution operator and T is the\ntime order operator. The mean values are calculated in the\nground state of the unperturbed Hamiltonian H0 , given by\nEq. (4), restricting our discussion to zero temperature.\nThe evolution operator S(∞) is expanded in increasing\norders of the perturbing term Hp , which, when inserted in\nEq. (A1), gives rise to a perturbation series for the Green function. It can be written as\n\nZ tD\nE\n\b\nT c0σ (t)Hp (t1 ) . . . Hp (tn ) c†0σ (t′ ) dt . . . dtn .\n\n(A2)\n\n0\n\nt0\n\nSubstituting this expression into Eq. (A1), the local Green function is given by\nXZ\nG00,σ (t − t′ ) = g0,σ (t − t′ ) + V 2\ng0,N,N +1,σ,σ1,σ2 (t, t1 , t2 , t′ )dt1 dt2\nσ1 σ2\n\n+V\n\n4\n\nX\n\ng0,N,N +1,σ,σ1 ,σ2 ,σ3 ,σ4 (t, t1 , t2 , t3 , t4 , t′ )dt1 dt2 dt3 dt4 +\n\nσ1 σ2 σ3 σ4\n\n+*** .\n\n(A3)\n\nIt is important to emphasize, as shown in Eq. (A3), that the\nconservation of charge of the unperturbed subsystem restricts\nthe expansion to even orders in V . The undressed Green function appearing in the equation is defined as\ng0,N,N +1,σ,σ1,σ2 (t, t1 , t2 , t′ ) =\noE\nD n\nT c0σ(t)c†N σ1(t1)cN +1σ1(t1)c†N +1σ2(t2)cN σ2(t2)c†0σ(t′ )\n0\n(A4)\nwith an obvious generalization for the undressed Green function of other orders. Calculating terms of all orders in V in the\nexpansion, Eq. (A3), the local Green function can be written\nas\n(0)\n\n(2)\n\n(4)\n\nG00,σ (t−t′ ) = G00,σ (t−t′ )+G00,σ (t−t′ )+G00,σ (t−t′ )+* * * .\n(A5)\nAs the operators belonging to the two different unperturbed\nparts of the system are, in this ground state, decoupled from\neach other since there is no connection between the cluster\n\nand the rest of the leads, Eq. (A4) results in\ng0,N,N +1,σ,σ1,σ2 (t, t1 , t2 , t′ )\n= g0,N,σ,σ1 (t, t1 , t2 , t′ )gN +1,σ1 (t1 , t2 )δσ1 σ2\n\n(A6)\n\nwhere the spin conservation imposes the condition σ1 = σ2\nand\nE\nD\ng0,N,σ,σ1(t, t1 , t2 , t′ )= T {c0,σ (t)c†N,σ1(t1)cN,σ1(t2 )c†0,σ (t′ )}\n\n0\n\n(A7a)\n\nD\nE\ngN +1,σ1(t1 , t2 )= T {cN +1,σ1(t1)c†N +1,σ1(t2 )} .(A7b)\n0\n\nAccording to Eq. (A6), the expansion Eq. (A3) is formally a\nlocator-propagator expansion48 where the locators correspond\nto the unperturbed sub-systems Green functions and the propagator turns out to be the one connecting them.\nThe Green function g0,N,σ,σ1 can be diagrammatically rep-\n\n\f13\nresented by\ng0,N,σ,σ1 (t, t1 , t2 , t′ ) = ❡\nt\nT\n\n✉t2\nσ1\n\nt1 ✉\nσ1\nσ\nn\n\nand can be diagrammatically represented as\n❡\nt′\n\no\ncoσ (t)c†N σ1 (t1 )cN σ1 (t2 )c†oσ (t′ )\n\n(2)\nG00,σ (t − t′ ) = ❡\nt\n\nand\nt1 σ t2\ngN +1,σ (t1 , t2 ) = ✉o/ o/ /o o/ ✉T {cN +1σ1 (t1 )cN +1σ1 (t2 )}\nThe zeroth-order contribution to the Green function, i.e., the\nsolution of the problem for V = 0, is represented in terms of\ndiagrams as\nD n\noE\n(0)\n❡\n= ❡\nG00,σ (t − t′ ) = T c0σ (t)c†0σ (t′ )\n0\nt\nσ\nt′\n(A8)\nThe Green function is exactly obtained by calculating the\nground state of the cluster using the Lanczos method. Although it includes the many-body interaction and its effects\nwithin the cluster, it is the undressed Green function with respect to the expansion given by Eq. (A5).\nTo second order in perturbation theory, the contribution to\nG00,σ (t − t′ ) is\nV2\n(2)\nG00,σ (t − t′ ) =\nhS(∞)i0\nXZ\ng0,N,σ, σ1 (t, t1 , t2 , t′ )gN +1,σ1 (t1 , t2 )dt1 dt2 (A9)\nσ1\n\nG00,σ (t − t′ ) = ❡\nt\n\nσ\n\n❡= ❡\nt′\nt\n\nσ\n\n❡+ ❡\nt\nt′\n\nt\n\nσ\n\n′\n\nt\n\nmethod, the undressed cluster, n-particle Green function,\n✉1 ✉ ✉2 ✉ ✉n ✉\n***\n❡\n❡ , is unknown for n ≥ 1.\nIt is clear that these functions cannot be calculated directly\nusing the prescription provided by Wick's theorem because\nthey include many-body Coulomb contributions coming from\nthe impurity.\nIn order to sort out this difficulty we propose another perturbation expansion, assuming the cluster without the manybody term at the impurity as the unperturbed Hamiltonian and\nHMB as the perturbation. The enormous advantage of this\nexpansion in contrast with the previous one is that Wick's theorem is applicable because the non-perturbed system is represented by a one-particle Hamiltonian. For an infinite system, this expansion has been extensively used to calculate the\n\nσ\n\n❡ ,\nt′\n\n(A10)\n\nwhere an integration over each internal time t1 and t2 is implied and the sum over σ1 needs to be taken.\nRegarding the calculation of the many-particle Green functions at the lead sites outside the cluster, Wick's theorem can\nbe used since this part of the system is represented by a onebody Hamiltonian. In this case, it is clear that for the fourth\norder we obtain the diagram\n\n(4)\nG00,σ (t − t′ ) = ❡\nt\n\nσ2\nσ1\nt1 ✉o/ o/ /o ✉t2 t3 ✉o/ /o /o ✉t4\nσ1\nσ1 σ2\nσ2\nσ\n\n❡\n,\nt′\n\n(A11)\n\nsuch that the dressed locator G00,σ (t − t′ ) can be cast into\n\nσ\nt1 ✉o/ 1o/ /o ✉t2\nσ1\nσ1\n\nAlthough the cluster's undressed one-particle Green function\n❡\n❡ can be calculated exactly using the Lanczos\n\nσ1\nt1 ✉o/ o/ /o ✉t2\nσ1\nσ1\n\nσ\n\n❡+ ❡\nt′\nt\n\nσ\nσ\nt1 ✉o/ 1o/ /o ✉t2 t3 ✉o/ 2/o /o ✉t4\nσ2\nσ1 σ2\nσ1\nσ\n\n❡+*** .\nt′\n\n(A12)\n\none-particle Green function to study, for instance, the Kondo\neffect. In most cases, these studies have been restricted to expansions in the self-energy up to second order in the Coulomb\ninteraction parameter U .48 However, we are in a different situation here because the system is finite and, more importantly,\nit requires the calculation of the Green function to all orders\nin the number of particles. In our case, the one particle Green\nfunction can be numerically calculated. After these diagrams\nare obtained, they are incorporated into the original diagrammatic expansion, Eq. (A12), in order to obtain the Green function of the complete system G00,σ (t − t′ ). When calculating\nthe self-energy, this procedure in principle permits to sum up,\nto all orders in U , the most important families of diagrams.\nThese are chosen among the ones that are essential to give a\nproper account of the region near the Fermi level.\nWe use Eqs. (A1) and (A2) to obtain this new diagrammatic\nexpansion. It is worth mentioning that now the mean values\n\n\f14\nh* * * i0 are calculated in the ground state of the cluster without the Coulomb interaction and that the evolution operator\nEq. (A2) requires the substitution of Hp by HMB .\nIn order to clarify the procedure and to establish the diagrammatic rules, we calculate the first diagrams corresponding to the locator g0,N,σ,σ1 (t, t1 , t2 , t′ ), Eq. (A7a). We define\nthree undressed Green functions,\nt σ\nt′\n(0)\n❡\ng00,σ (t − t′ ) = hT {c0σ (t), c0σ (t′ )}i0 = ❡\n(A13a)\nD n\noE\nt σ\nt′\n(0)\n✉\n= ❡\ng0N,σ (t − t′ ) = T c0σ (t), c†N σ (t′ )\n0\n(A13b)\nD n\noE\nt σ\nt′\n(0)\n✉\ngN σ (t − t′ ) = T cN σ (t)c†N σ (t′ )\n= ✉\n0\n(A13c)\nthat, together with Eq. (A8), constitute the building blocks of\nthe diagrammatic expansion.\nThe contribution to the Green function to zero order in U ,\ng0,N,σ,σ1 (t, t1 , t2 , t′ ), defined in Eq. (A7a) is given by\n(0)\n\n(0)\n\n(0)\n\ng0N,σ (t, t1 )g0N,σ (t2 , t′ )δσσ′ + g00,σ (t, t′ )gN N,σ′ (t1 , t2 ) =\n(A14)\nt1\nt2\n′\n✉t\n✉ σ\n✉\nt1 ✉\n2\nσ\nt ❡\n\nσ +\n❡t′\n\nt\n❡\n\nσ\n\nt′\n❡.\n\nto be included. These are the vertices that result from the one\nparticle Hamiltonian Hp . The other vertex ❡ comes from the\nHamiltonian HMB . There are two incoming and two outgoing spin σ and σ̄ propagators and a factor of U included at this\nvertex. As usual, the integral over the time variable associated\nto each vertex has to be taken.\nThese rules are schematically represented as\nV /o σ\n✉ o/ o/ o/\nt1\nσ\n\nTo second order in U the topologically different connected\ndiagrams that contribute to G00,σ (t − t′ ) are\nt1 ✉ σ o/ o/ ✉t2\nt1 ✉ σ o/ o/ ✉t2\nt1 ✉ σ o/ o/ ✉t2\no/ o/\no/ o/\no/ o/\n✞\n☎\nσ\nσ\nσ\nσ\n❡\nt\n❡\nt\n☛ 4✟\nσ̄ ✝ ✆t4\n✞☎\nt\n❡\nt✞ ☎\n❡\nσ\nσ\nσ̄\nσ\nσ̄ ✝ ✆\nt3 t4 ✝ ✆σ̄ σ̄ ✡σ\n❡✠\nt✞ ☎σ̄\n❡\nt\n3\n✝\n✆\nσ\nσ\nσ t3\nσ\n❡\n❡\n❡′\n❡′\n❡t′\nt\nt\nt ❡\nt\nt\n\n(2)\n\nσ\nt ❡\n\nσ +\n❡t′\n\nt1 σ ′\nt2\n✉o/ o/ o/ o/ o/ /o ✉\n✡\n✠\nσ′\nt\nt′\n❡ σ\n❡.\n\nThe second diagram is a non-connected one and, as usual,\ndoes not contribute to the Green function.38\nTo first order in U , incorporating all the possible contractions resulting from the application of Wick's theorem and\neliminating the non-connected diagrams, the contributions to\n(2)\nG00,σ (t − t′ ) are\nt1\n\nσ̄\nt\n✉o/ o/ o/ o/ ✉2\n✡ σ̄\nσ̄ ❏\n❏ ❡✡t3\nσ ✡ ❏ σ\n✡ ❏❡ ′\n❡\nt\nt\n\nσ t\n✉o/ o/ /o o/ ✉ 2\nσ\nσ\n✞\nt ☎σ̄\n❡\nt3 ✝\n✆\nσ\n❡\n❡′\nt\nt.\n\nFrom these calculations, we conclude that there are two different types of vertices ✉ and ❡. At each ✉ vertex there is\none incoming and outgoing propagator and a factor of V has\n\nt\n\nσ\n✉o/ o/ o/\n❇\nσ ☛\nt3❇ ❡ σ̄\n✂✡\nσ\n✂❡ σ̄\n\nt2\no/ /o ✉\n✂σ\n✟\n✂\n❡t4\n✠\n❇\nσ\n❇❡\n\nt′ .\n\n(A15)\n\nThe one-particle cluster Green function exactly obtained by\nnumerical means, defined in Eq. (A8), can be thought of to be\nthe result of the sum of the following infinite series of diagrams:\ni\n(0)\nGi0,σ (t − t′ ) = ×❡\nt\n\nt1\n+\n\nt1\n\nt1 ✉σ o/ o/ ✉t2\no/ o/\n❏\n✡σ\nσ\n❏ ❡✡t4\n✞☎\nt❡\n✡tσ❏ σ\nσ̄ ✝ ✆\n✡\nσ\n❡ 3 ❏❡ ′\nt\nt\n\nFrom this result we infer that the contribution to G00,σ (t −\nt′ ) in zero order in U is\nσ\nt1 ✉o/ o/ /o o/ ✉t2\n\nσ❏\n✡σ̄\n❏ ❡✡\nt1\nU.\nσ̄ ✡ ❏❏ σ\n✡\n\ni\n\nσ\n\n❡ = ×i❡\nt\nt′\n\nσ\n\n❡+\nt′\n\nσ̄ ✟\n☛\nσ̄ ✟\n☛\ni❡ ✡\nt❡✠ ❡ + ×i❡t1 ❡\nt ❡\ntt2 ❡ +\n×\nσ\nσ t′\nσ\nσ\n′\nt ✡ ✠\nt\nt1\nt\nσ̄\nσ̄ ✟\n☛\nσ̄ ✟\ni❡ ✡\nt2 ☛\nt✠\n❡\ntσ ❡\n❡\ntt3 ❡\nt\n×\n(A16)\nσ\nσ\nσ t′ + * * *\n✡ ✠\nt\nt1\nσ̄\n\nwhere ⊗ can be any site within the cluster although we are\nparticularly interested in the impurity site ❡ or the site ✉ at\nthe edge of the cluster. We use the dressed one-particle cluster\nGreen function to incorporate all the diagrams of Eq. (A16)\ninto the expansion for the Green function G00,σ (t − t′ ),\nEq. (A5). This results in\n\n\f15\nt2\n❡= ❡\nt′\nt\n\n❡\nt\n\nσ\n\n❡+ ❡\nt\nt′\n\nσ\n\n✉o/ σo/ /o /o ✉\nt1\nt2\n\nσ\n\n✉o/ o/ o/ /o ✉\nt1 σ t2\n\nσ\n\n❡+ ❡\nt\nt\n′\n\nσ\n\nt\n✉o/ o/ σ̄ o/ o/ ✉3\n❏\n✡\nσ̄\nσ̄\n❏ ❡✡\nt1\n\nσ\n\nt\n\n′\n\n❡+\n\nt3 ✉o/ o/ o/ o/ ✉t4\nσ\n❡\nt\n\nσ\n\nσ̄\n✎\nt❡\nσ̄\nt′ ✍\n\nσ\n☞\nt\n❡\n✌ σ\n\n❡+ ❡\nt\nt′\n\nσ\n\n✉o/ o/ /o o/ ✉\nt4\nt3 σ\n\nσ\n\n❡+***\nt′\n\n(A17)\n\nAfter taking a Fourier transformation in time, we define the\nself-energies,\nV σ V\nΣσN (ω) = ✉ o/ o/ /o o/ ✉ = gN +1,σ (ω)V 2\n✉o/ o/ σ̄o/ o/ ✉\n❏\n✡\nσ̄ ❏ ✡ σ̄\nσ\n❡\n+\nΣ0 (ω) =\n\n✉o/ σ̄\no/ /o\nσ̄ ✎σ\nt❡\n✍\nσ\n\n✉ o/ σo/ o/ o/ ✉\n❏\nσ❏ ✡σ\n❏✡\n✓✏\n❡\nt✡\n+***\nσ̄\nσ̄\nt❡\n✒✑\n\n(A18)\n\no/ ✉\n\n✉o/ σo/ /o\nσ̄\nσ ✎σ̄\n☞\nt +\nt❡\n❡\n✌\n✍\nσ̄\n\no/ ✉\n\nσ\n☞\nt +\n❡\n✌\n\n(A19)\n\nwhere we have explicitly drawn the contribution to the selfenergy up to terms proportional to U 2 .\nThe Green function of the system at the impurity can be\nwritten as a general Dyson equation:\nX (0)\n(0)\nG0i,σ (ω)Σσi (ω)Gi0,σ (ω)\nG00,σ (ω) = G00,σ (ω) +\ni\n\n(A20)\nwhere i is restricted to be either 0 or N and the self-energy\nΣσi (ω) is defined as\nΣσi (ω) = ΣσN (ω)δiN + Σσ0 (ω)δi0 .\n\n(A21)\nΣσ0\n\nIn order to compare the relative contribution of\nand ΣσN ,\nwhich crucially depends upon the cluster size N, we proceed\nas follows. Considering that V = tN and using Eqs. (A18)\nand (12) we have that\nΣσN (ω) ∝ V 2 ∼ λ−(N −1) ,\n\n(A22)\n\nwhere we have ignored the Green function gN +1,σ (w) because we have numerically verified that in the neighborhood\nof the Fermi energy this function is independent of N.\nTo evaluate the dependence of Σσ0 upon N, we observe that\nall terms in Eq. (A19) are multiplied by the square of the nondiagonal cluster propagator\n(0)\nG0N +1 = ❡\nt\n\nσ̄\n\n✉.\n\nt′\n\n(A23)\n\nIn addition, the dependence of this propagator on λ is given\nby\n−(N −1)N/4\nM (ω)ΠN\n,\ni=0 ti ∼ λ\n\n(A24)\n\n\f16\nwhere the function M (ω) goes asymptotically to zero when\nN increases above a characteristic length, which in our case\ncorresponds to the size of the Kondo cloud. Defining f (N ) =\nM 2 (ω) we obtain,\nΣσ0 (ω)\n\n∗\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\n13\n\n14\n\n15\n\n16\n\n17\n\n18\n\n19\n20\n\n−(N −1)N/2\n\n∼ f (N ) λ\n\n.\n\nthe self-energy Σσ0 (ω) can be neglected when compared with\nΣσN (ω) when the density of states of the leads is logarithmically discretized, as their ratio is then proportional to:\nΣσ0 (ω)\n∼ f (N ) λ−(N −1)(N/2−1) .\nΣσN (ω)\n\n(A25)\n\n(A26)\n\nAs discussed in the main text in Sec. II, the contribution to\n\nIn this case, the embedding process is extremely simplified.\n\nCorresponding author: martins@oakland.edu\nC. Joachim, J. K. Gimzewski, and A. Aviram, Nature 408, 541\n(2000).\nF. H. L. Koppens, C. Buizert, K. J. Tielrooij, I. T. Vink, K. C.\nNowack, T. Meunier, L. P. Kouwenhoven, and L. M. K. Vandersypen, Nature 442, 766 (2006).\nD. Goldhaber-Gordon, H. Shtrikman, D. Mahalu, D. AbuschMagder, U. Meirav, and M. A. Kastner, Nature 391, 156 (1998).\nJ. Park, A.N. Pasupathy, J.I. Goldsmith, C. Chang, Y. Yaish, J.R.\nPetta, M. Rinkoski, J. P. Sethna, H. D. Abruna, P. L. McEuen and\nD. C. Ralph, Nature 417, 722 (2002).\nR. M. Potok, I. G. Rau, H. Shtrikman, Y. Oreg, and D. GoldhaberGordon, Nature 446, 167 (2006).\nN. Andrei, Phys. Rev. Lett. 45, 379 (1980); J. Bonča, A. Ramšak\nand T. Rejec, cond-mat/0407590v2.\nK. G. Wilson, Rev. Mod. Phys. 47, 773 (1975). For a recent review, see: R. Bulla, T. Costi, and T. Pruschke, Rev. Mod. Phys.\n80, 395 (2008).\nS. R. White and A.E. Feiguin, Phys. Rev. Lett. 93, 076401 (2004);\nA. Daley, C. Kollath, U. Schollwöck, and G. Vidal, J. Stat. Mech.:\nTheory Exp., P04005 (2004); K. Al-Hassanieh, A. E. Feiguin, J.\nA. Riera, C. A. Büsser, and E. Dagotto, Phys. Rev. B 73, 195304\n(2006).\nC. Karrasch, T. Enss, and V. Meden, Phys. Rev. B 73, 235337\n(2006).\nV. Ferrari, G. Chiappe, E. V. Anda, and M. A. Davidovich, Phys.\nRev. Lett. 82, 5088 (1999).\nM. A. Davidovich, E. V. Anda, C. A. Büsser, and G. Chiappe,\nPhys. Rev. B 65, 233310 (2002).\nE. V. Anda, C. A. Büsser, G. Chiappe, and M. A. Davidovich,\nPhys. Rev. B 66, 035307 (2002).\nG. Chiappe and J. A. Verges, J. Phys.: Cond. Matt. 15, 8805\n(2003).\nC. A. Büsser, E. V. Anda, L. Urba, V. Ferrari, G. Chiappe, J.\nMagn. Magn. Mater. 177-181, 311 (1998).\nG. Chiappe, C. A. Büsser, E. V. Anda, V. Ferrari, J. Phys.: Cond.\nMatter 27, 5237 (1999).\nS. Psirsult, D. Sénéchal, and A.-M. S. Tremblay, Eur. Phys. J.\nB 16, 85 (2000); D. Sénéchal, D. Perez, and M. Pioro-Ladrière,\nPhys. Rev. Lett. 84, 522 (2000); D. Sénéchal, D. Perez, and D.\nPlouffe, Phys. Rev. B 66, 075129 (2002).\nS. R. White, Phys. Rev. Lett. 69, 2863 (1992); U. Schollwöck,\nRev. Mod. Phys. 77, 259 (2005); K. Hallberg, Adv. Phys. 55 477\n(2006).\nW. Hofstetter, Phys. Rev. Lett. 85, 1508 (2002); F. Verstraete,\nA. Weichselbaum, U. Schollwöck, J. I. Cirac, and J. von Delft,\ncond-mat/0504305.\nF. Anders and A. Schiller, Phys. Rev. Lett. 95, 196801 (2005).\nC. A. Büsser, A. Moreo, and E. Dagotto, Phys. Rev. B 70, 035402\n(2004).\n\n21\n\n22\n\n23\n24\n\n25\n\n26\n27\n\n28\n29\n30\n\n31\n\n32\n\n33\n34\n\n35\n\n36\n\n37\n38\n\n39\n40\n41\n\n42\n\n43\n\n44\n\nSee: F. Heidrich-Meisner, G. B. Martins, C. A. Büsser, K. A. AlHassanieh, A. E. Feiguin, G. Chiappe, E. V. Anda and E. Dagotto,\narXiv:0705.1801 for an extended discussion.\nP. Jarillo-Herrero, J. Kong Herre, S. J. van der Zant, C. Dekker, L.\nP. Kouwenhoven, and S. De Franceschi, Nature 434, 484 (2005);\nA. Makarovski, J. Liu, and G. Finkelstein, Phys. Rev. Lett. 99,\n066801 (2007).\nC. A. Büsser and G. B. Martins, Phys. Rev. B 75, 045406 (2007).\nW. G. van der Wiel, S. De Franceschi, J. M. Elzerman, S. Tarucha,\nL. P. Kouwenhoven, J. Motohisa, F. Nakajima, and T. Fukui, Phys.\nRev. Lett. 88, 126803 (2002).\nM. Vojta, R. Bulla, and W. Hofstetter, Phys. Rev. B 65, 140405\n(2005).\nP. S. Cornaglia and G. Grempel, Phys. Rev. B 71, 075305 (2005).\nG. A. Lara, P. A. Orellana, J. M. Yanez, and E. V. Anda, Sol. Stat.\nComm. 136, 323 (2005).\nR. Žitko and J. Bonča, Phys. Rev. B 73, 035332 (2006).\nR. Žitko and J. Bonča, Phys. Rev. Lett. 98, 047203 (2007).\nA. Zhao, Qunxiang Li, L. Chen, H. Xiang, W. Wang, Sh. Pan, B.\nWang, X. Xiao, J. Yang, J. G. Hou, and Q. Zhu, Science 309, 1542\n(2005); G. Chiappe, and E. Louis, Phys. Rev. Lett. 97, 076806\n(2006); J. M. Aguiar-Hualde, G. Chiappe, E. Louis, and E. V.\nAnda, Phys. Rev. B 76, 155427 (2007).\nG. B. Martins, C. A. Büsser, K. A. Al-Hassanieh, A. Moreo, and\nE. Dagotto, Phys. Rev. Lett. 94, 026804 (2005).\nC. A. Büsser, G. B. Martins, K. A. Al-Hassanieh, A. Moreo, and\nE. Dagotto, Phys. Rev. B 70, 245303 (2004).\nG. Chiappe and A. A. Aligia, Phys. Rev. B 66, 075421 (2002).\nM. E. Torio, K. Hallberg, A.H. Ceccatto, and C. R. Proetto, Phys.\nRev. B 65, 085302 (2002).\nA. A. Aligia and A. M. Lobos, J. Phys.: Condens. Matter 17,\nS1095 (2005).\nA. C. Hewson, The Kondo Problem to Heavy Fermions (Cambridge University Press, 1997).\nE. Dagotto, Rev. Mod. Phys. 66, 763 (1994).\nA. A. Abrikosov, L. P. Gorkov, and I. E. Dzyaloshinski, Methods of Quantum Field Theory in Statistical Physics (Dover Books,\n1963).\nE. Müller-Hartmann, Z. Phys. B-Cond. Matt. 76, 21 (1989).\nSee discussion on Section 4.3 of reference 36 (pgs. 78 – 81).\nP. Simon and I. Affleck, Phys. Rev. B 68, 115304 (2003);\nL. Borda, Phys. Rev. B 75, 041307 (2007); J. Simonin,\narXiv:0708.3604.\nC.A. Büsser, E. V. Anda, A. L. Lima, M. A. Davidovich, and G.\nChiappe, Phys. Rev. B 62, 9907 (2000).\nY. Meir, N. S. Wingreen, and P. A. Lee, Phys. Rev. Lett. 66, 3048\n(1991); E. V. Anda and F. Flores, J. Phys.: Condens. Matter 3,\n9087 (1991).\nR. Bulla, T. A. Costi, and D. Vollhardt, Phys. Rev. B 64, 045103\n(2001); O. Sakai, Y. Shimizu and T. Kasuya, J. Phys. Soc. Jpn.\n\n\f17\n\n45\n\n46\n\n58, 3666 (1989); T. A. Costi, A. C. Hewson, and Zlatić, J. Phys.:\nCondens. Matter 6, 2519 (1994).\nB. Coqblin, J. Arispe, J. R. Iglesias, C. Lacroix and K. LeHur, J.\nPhys. Soc. Jpn. 65, Suppl. B, 64 (1996).\nThe reader is reminded that an alternate interpretation of the\nconductance suppression involves the destructive interference between the two paths available to the conduction electrons: a path\nthat avoids the dots and a path that visits them. This interpretation\n\n47\n\n48\n\nis completely equivalent to the back-scattering one. These two interpretations will be used interchangeably along the text.\nG. Chiappe, J. Fernández-Rossier, E. Louis, and E. V. Anda, Phys.\nRev. B. 72, 245311 (2005)\nE. V. Anda, J. Phys. C-Solid State Phys. 14 , L1037 (1981); W.\nMetzner, Phys. Rev. B 43, 8549 (1991).\n\n\f"}