{"id": "http://arxiv.org/abs/1009.3159v2", "guidislink": true, "updated": "2010-11-09T12:56:14Z", "updated_parsed": [2010, 11, 9, 12, 56, 14, 1, 313, 0], "published": "2010-09-16T12:39:08Z", "published_parsed": [2010, 9, 16, 12, 39, 8, 3, 259, 0], "title": "Aidnogenesis via Leptogenesis and Dark Sphalerons", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.1264%2C1009.1801%2C1009.3487%2C1009.5984%2C1009.3789%2C1009.2983%2C1009.1720%2C1009.5538%2C1009.2850%2C1009.1983%2C1009.0001%2C1009.3704%2C1009.6178%2C1009.3542%2C1009.4989%2C1009.0518%2C1009.5008%2C1009.0131%2C1009.0002%2C1009.1990%2C1009.1905%2C1009.2564%2C1009.1999%2C1009.4905%2C1009.2651%2C1009.4463%2C1009.4924%2C1009.0657%2C1009.0454%2C1009.0120%2C1009.1721%2C1009.1577%2C1009.1491%2C1009.5493%2C1009.5179%2C1009.5451%2C1009.0250%2C1009.0444%2C1009.0196%2C1009.3159%2C1009.2549%2C1009.5266%2C1009.0608%2C1009.1064%2C1009.2086%2C1009.5962%2C1009.1263%2C1009.0621%2C1009.0411%2C1009.0448%2C1009.3232%2C1009.4102%2C1009.6154%2C1009.5392%2C1009.5532%2C1009.2961%2C1009.2338%2C1009.0843%2C1009.1687%2C1009.3212%2C1009.0988%2C1009.2039%2C1009.2936%2C1009.5820%2C1009.4836%2C1009.5591%2C1009.3560%2C1009.4361%2C1009.4777%2C1009.4997%2C1009.2720%2C1009.5770%2C1009.3615%2C1009.4779%2C1009.2586%2C1009.5775%2C1009.0435%2C1009.1127%2C1009.4297%2C1009.2733%2C1009.0583%2C1009.4983%2C1009.2052%2C1009.3894%2C1009.3622%2C1009.5385%2C1009.5849%2C1009.4645%2C1009.3543%2C1009.6118%2C1009.1597%2C1009.0762%2C1009.1573%2C1009.5251%2C1009.5252%2C1009.1416%2C1009.5296%2C1009.5864%2C1009.3089%2C1009.0013%2C1009.0342&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Aidnogenesis via Leptogenesis and Dark Sphalerons"}, "summary": "We discuss aidnogenesis, the generation of a dark matter asymmetry via new\nsphaleron processes associated to an extra non-abelian gauge symmetry common to\nboth the visible and the dark sectors. Such a theory can naturally produce an\nabundance of asymmetric dark matter which is of the same size as the lepton and\nbaryon asymmetries, as suggested by the similar sizes of the observed baryonic\nand dark matter energy content, and provide a definite prediction for the mass\nof the dark matter particle. We discuss in detail a minimal realization in\nwhich the Standard Model is only extended by dark matter fermions which form\n\"dark baryons\" through an SU(3) interaction, and a (broken) horizontal symmetry\nthat induces the new sphalerons. The dark matter mass is predicted to be\napproximately 6 GeV, close to the region favored by DAMA and CoGeNT.\nFurthermore, a remnant of the horizontal symmetry should be broken at a lower\nscale and can also explain the Tevatron dimuon anomaly.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.1264%2C1009.1801%2C1009.3487%2C1009.5984%2C1009.3789%2C1009.2983%2C1009.1720%2C1009.5538%2C1009.2850%2C1009.1983%2C1009.0001%2C1009.3704%2C1009.6178%2C1009.3542%2C1009.4989%2C1009.0518%2C1009.5008%2C1009.0131%2C1009.0002%2C1009.1990%2C1009.1905%2C1009.2564%2C1009.1999%2C1009.4905%2C1009.2651%2C1009.4463%2C1009.4924%2C1009.0657%2C1009.0454%2C1009.0120%2C1009.1721%2C1009.1577%2C1009.1491%2C1009.5493%2C1009.5179%2C1009.5451%2C1009.0250%2C1009.0444%2C1009.0196%2C1009.3159%2C1009.2549%2C1009.5266%2C1009.0608%2C1009.1064%2C1009.2086%2C1009.5962%2C1009.1263%2C1009.0621%2C1009.0411%2C1009.0448%2C1009.3232%2C1009.4102%2C1009.6154%2C1009.5392%2C1009.5532%2C1009.2961%2C1009.2338%2C1009.0843%2C1009.1687%2C1009.3212%2C1009.0988%2C1009.2039%2C1009.2936%2C1009.5820%2C1009.4836%2C1009.5591%2C1009.3560%2C1009.4361%2C1009.4777%2C1009.4997%2C1009.2720%2C1009.5770%2C1009.3615%2C1009.4779%2C1009.2586%2C1009.5775%2C1009.0435%2C1009.1127%2C1009.4297%2C1009.2733%2C1009.0583%2C1009.4983%2C1009.2052%2C1009.3894%2C1009.3622%2C1009.5385%2C1009.5849%2C1009.4645%2C1009.3543%2C1009.6118%2C1009.1597%2C1009.0762%2C1009.1573%2C1009.5251%2C1009.5252%2C1009.1416%2C1009.5296%2C1009.5864%2C1009.3089%2C1009.0013%2C1009.0342&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We discuss aidnogenesis, the generation of a dark matter asymmetry via new\nsphaleron processes associated to an extra non-abelian gauge symmetry common to\nboth the visible and the dark sectors. Such a theory can naturally produce an\nabundance of asymmetric dark matter which is of the same size as the lepton and\nbaryon asymmetries, as suggested by the similar sizes of the observed baryonic\nand dark matter energy content, and provide a definite prediction for the mass\nof the dark matter particle. We discuss in detail a minimal realization in\nwhich the Standard Model is only extended by dark matter fermions which form\n\"dark baryons\" through an SU(3) interaction, and a (broken) horizontal symmetry\nthat induces the new sphalerons. The dark matter mass is predicted to be\napproximately 6 GeV, close to the region favored by DAMA and CoGeNT.\nFurthermore, a remnant of the horizontal symmetry should be broken at a lower\nscale and can also explain the Tevatron dimuon anomaly."}, "authors": ["Mattias Blennow", "Basudeb Dasgupta", "Enrique Fernandez-Martinez", "Nuria Rius"], "author_detail": {"name": "Nuria Rius"}, "author": "Nuria Rius", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/JHEP03(2011)014", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1009.3159v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1009.3159v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Minor changes, discussion of present constraints expanded. 16 pages,\n  2 eps figures, REVTeX4", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1009.3159v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1009.3159v2", "journal_reference": "JHEP 1103:014,2011", "doi": "10.1007/JHEP03(2011)014", "fulltext": "MPP-2010-125, IFIC/10-32, FTUV-10-0909\n\nAidnogenesis via Leptogenesis and Dark Sphalerons\nMattias Blennow,1, ∗ Basudeb Dasgupta,2, †\nEnrique Fernandez-Martinez,1, ‡ and Nuria Rius3, §\n1\n\nMax-Planck-Institut für Physik (Werner-Heisenberg-Institut),\n\narXiv:1009.3159v2 [hep-ph] 9 Nov 2010\n\nFöhringer Ring 6, 80805 München, Germany\n2\n\nCCAPP, The Ohio State University,\n\n191 W. Woodruff Avenue, Columbus 43210 USA\n3\n\nDepartamento de Fı́sica Teórica, IFIC,\n\nUniversidad de Valencia-CSIC Edificio de Institutos de Paterna,\nApt. 22085, 46071 Valencia, Spain\n\nAbstract\nWe discuss aidnogenesis1 , i.e. the generation of a dark matter asymmetry, via new sphaleron\nprocesses associated to an extra non-abelian gauge symmetry common to both the visible and the\ndark sectors. Such a theory can naturally produce an abundance of asymmetric dark matter which\nis of the same size as the lepton and baryon asymmetries, as suggested by the similar sizes of the\nobserved baryonic and dark matter energy content, and provide a definite prediction for the mass of\nthe dark matter particle. We discuss in detail a minimal realization in which the Standard Model is\nonly extended by dark matter fermions which form \"dark baryons\" through an SU (3) interaction,\nand a (broken) horizontal symmetry that induces the new sphalerons. The dark matter mass is\npredicted to be ∼ 6 GeV, close to the region favored by DAMA and CoGeNT. Furthermore, a\nremnant of the horizontal symmetry should be broken at a lower scale and can also explain the\nTevatron dimuon anomaly.\n\n1\n\nFrom ancient Greek αιδνoς (dark, unseen) and γǫνǫσις (generation, origin).\n\n∗\n\nblennow@mppmu.mpg.de\n\n†\n\ndasgupta.10@osu.edu\nenfmarti@mppmu.mpg.de\n\n‡\n§\n\nnuria@ific.uv.es\n\n1\n\n\fI.\n\nINTRODUCTION\n\nThe building blocks of the Universe are reasonably well-known from a cosmological point\nof view [1]. In particular, we now know that about 73 % of the energy density is in the form\nof dark energy and causes the accelerated expansion of the Universe while the remaining\n27 % is composed of matter. Baryonic matter makes up only 5 %, while about five times as\nmuch is in the form of a non-luminous weakly interacting species, dubbed \"Dark Matter\"\n(DM). While this cosmological book-keeping is well developed, the particle nature of DM\ncontinues to be one of the most important open questions of particle physics [2].\nIn this context, much attention has been devoted to crafting well-motivated and viable\ntheories of DM. The most popular candidates for DM are weakly interacting massive particles (WIMPs). WIMPs arise naturally in theories, such as supersymmetry, which provide a\nsolution to the hierarchy problem and include a \"natural\" DM candidate [3] once a discrete\nsymmetry, e.g., R-parity, is introduced, so that the least massive particle charged under the\nnew symmetry is stable or very long lived [4]. This kind of DM comes with the WIMP\nmiracle, i.e., the correct interaction cross-section to thermally produce the density of DM\nin the early Universe [5]. In hindsight, this becomes the most appealing feature of such\nDM. The same is true for extra-dimensional models where KK parity ensures the stability\nof the DM candidates [6, 7]. In this scenario, the closeness of the dark matter and baryonic\nenergy densities is merely a coincidence, since they are produced by unrelated mechanisms.\nHowever, their similarity suggests that they originated from the same source. This is the\ncase in models of asymmetric dark matter (ADM), a relatively old idea [8–11] which has\nbeen exploited in several models for DM generation [12–26] and has recently received a rising interest [27–42]. In ADM models, the DM is made up of charge-neutral Dirac fermions,\njust like baryonic matter and unlike the SUSY neutralino which is a Majorana fermion.\nThus, the DM we see today is not generated thermally in the early Universe, but through a\nparticle-antiparticle asymmetry in its production mechanism tied to the production of ordinary matter, giving rise to similar number densities for ordinary matter and DM. Therefore,\nmodels of ADM often predict DM masses of O(1) GeV, except in instances where the ADM\nnumber density can be Boltzmann suppressed or tuned to result in a larger mass (see, e.g.,\nRef. [26, 28, 40]). The phenomenology of ADM is therefore quite different from that of a\nthermal DM relic. In particular, the prospects of indirect detection of DM in these mod2\n\n\fels are suppressed, since the DM does not annihilate if only an asymmetric component is\npresent. Nevertheless, there could still be some indirect effects, such as the effect of accreting\nADM in the core of stars [32, 35].\nAs was stressed in Ref. [11], any process that creates a baryon or lepton asymmetry could\nbe intimately tied to the creation of ADM as well. In most ADM models, this production\nof a DM asymmetry is seeded by the observed baryon asymmetry and transferred to the\ndark sector. However, there has been a recent interest in the opposite mechanism, namely,\nthe creation of a DM asymmetry that is subsequently converted partially into the SM [36–\n38, 41]. In this work, we instead assume that the asymmetries in both baryons and DM\nare created simultaneously by the same processes, as suggested by their similar abundances.\nFirst, a lepton asymmetry from the decay of heavy right-handed neutrinos, as in leptogenesis\n[43], is induced and then this lepton number is partially converted into both baryon and\nDM numbers through new sphaleron processes. In order to achieve this, we will assume that\nthere is an additional non-abelian gauge symmetry group G, under which both the DM sector\nand the SM fermions are charged. For definiteness, we will consider an additional SU(2)\nsymmetry, but other symmetry groups could also fulfill our purposes. This extra gauge\nsymmetry could arise from some unified theory at higher scales, although this is not required.\nApart from the right-handed neutrinos and the extra gauge symmetry (spontaneously broken\nby scalar SM singlets), we only need to introduce new fermion fields X, that are singlets\nunder the SM gauge group but couple to the new gauge symmetry, and will provide the DM\ncandidates.\nWe include a QCD-like gauge interaction for the DM fermions that prevents their mixing\nwith neutrinos, ensuring their stability without any ad hoc discrete symmetry. The similarity\nwith the SM QCD interaction is also suggestive, given the similar masses of baryons and\nDM required to fit the observed energy densities. As the DM is essentially composed of dark\nbaryons, it scatters with itself through the QCD-like gauge interaction. This self-interaction\ncan be quite large and leads to almost spherical DM halos in galaxies, in somewhat better\nagreement with data, compared to WIMPs [44]. The current best limit on the interaction\nstrength comes from observed ellipticities of DM halos of galaxies [45]. However, limits from\ncolliding galaxy clusters, though slightly weaker, are thought to be more robust. These\nobservations tell us that the QCD-like gauge interaction cannot be much stronger than that\nbetween baryons.\n3\n\n\fII.\n\nAIDNOGENESIS\n\nAs stated in the introduction, a general feature of ADM models is that the production\nmechanisms for the DM are somehow related to the baryon asymmetry in order to obtain\nsimilar abundances. For example, early proposals [9–11] include charging light DM fermions\nunder SU(2)L in order to fix its abundance together with the baryon and lepton asymmetries\nas a result of the thermal equilibrium in the early Universe [46, 47]. If dark and baryonic\nmatter have similar number densities, present cosmology data favour rather light values\nof the DM fermions mass. Thus, collider constraints rule out the possibility of DM being\npart of a (pure) SU(2)L multiplet. We instead propose that the DM abundance can be\nthe result of sphaleron processes due to a new gauge symmetry that connects the DM and\nSM sectors. In such a setting, we extend the SM gauge group by an additional non-abelian\ngauge symmetry G under which the DM is charged. In order to generate a DM number X,\nrelated to additional fermions introduced in the theory, we also need to charge some of the\nSM fermions under this gauge group, generally leading to the associated sphalerons violating\nthe global charges such that ∆X = ∆B/k1 = ∆L/k2 , where ki are constants. Since the extra\nsphalerons are responsible for the creation of the DM number, we will refer to them as \"dark\nsphalerons\" and to the process of the conversion of lepton or baryon number into DM number\nas \"aidnogenesis\". Together with the SM sphalerons, which satisfy ∆B = ∆L and ∆X = 0,\nthis will result in a single conserved quantity (k2 − k1 )X + B − L, when both sphalerons\nare active. This quantity is what needs to be generated in the early Universe in order to\naccommodate both the baryon and DM numbers and is the equivalent to B − L in models\nof leptogenesis. In the model given below, we will assume that leptogenesis produces an\ninitial L number, which is then partially transformed into B and X by sphaleron processes,\nwe therefore have baryogenesis and aidnogenesis via leptogenesis.\nTo compute the abundance of B and X, we must first write down the equilibrium\nequations for the chemical potentials of different particle species when both SM and dark\nsphalerons are active. These equations will be dependent on the specific extension of the\nSM, but generally lead to a relation of the form\nX\n= r,\nB−L\n\n(1)\n\nwhere r is an O(1) constant. Once the additional sphalerons become inactive, the SM\nsphalerons will continue to act in the standard way, leading to the equilibrium relation\n4\n\n\fB = 28(B − L)/79 (in the case of three fermion generations and one Higgs doublet in the\nstandard sector), while conserving X and B − L. Thus, for the final relation between the\nbaryon and DM numbers, we obtain\nX\n79\n= r.\nB\n28\n\n(2)\n\nThis results in a prediction for the DM mass through\nΩB\nΩX\n\n=\n\n⇒ mDM\n\nρB\nmp B\n≃ 0.2\n=\nρX\nmDM X\nmp\n28\n≃ 1.77 .\n≃ 5mp\n79|r|\n|r|\n\n(3)\n\nThus, with r being O(1), we would expect the DM mass to be close to the proton mass. It\nshould be noted that the DM mass is here the mass of the lightest of the additional fermions\nwhich is stable, since DM number is conserved at the Lagrangian level.\n\nIII.\n\nAN ILLUSTRATIVE MODEL\n\nFrom the previous section, the question of whether or not aidnogenesis can be achieved in\na specific model realization naturally follows. In this section, we will give an example of such\nrealization in a concrete model and compute the corresponding DM density and properties.\nFor this specific realization, we extend the SM gauge group with an additional SU(2)H ×\nSU(3)DC , where the SU(2)H is a horizontal symmetry introduced to provide the dark\nsphalerons. We have chosen an SU(2)H for the simplicity of the discussion but, in principle, other non-abelian gauge symmetries encompassing all three fermion generations could\nbe considered as well to address the flavor puzzle. The additional dark color (DC) group\nSU(3)DC is a color-like gauge interaction in the dark sector. The DM candidate in this\nmodel is a charge neutral SU(3)DC baryon. The fermionic field content in the model is\ngiven in Tab. I with the corresponding charges. Notice that the choice of which fermion\ngenerations form the SU(2)H doublets is arbitrary and only affects the constraints that can\nbe set with present data on flavour changing neutral current (FCNC) processes on the scale\nat which the symmetry is broken, but not the generation of the baryon and DM asymmetry.\nIn Tab. I the SU(2)H doublets are composed from the fermions of the first two generations,\nfor which the present bounds are strongest, but other possibilities will be briefly discussed\nin Sec. IV. Notice that the only fermion singlet is the right-handed neutrino, for which a\n5\n\n\fMajorana mass is allowed and will be assumed in order to have a see-saw mechanism [48–50]\nfor neutrino masses and a lepton number asymmetry in their decay that can seed baryo- and\naidnogenesis. This is also consistent with having an even number of SU(2)H doublets, as\nrequired by the cancellation of the Witten anomaly [51] for the SU(2) groups. For the same\nreason, the left-handed components of the DM fermions should not form SU(2)L doublets.\nMoreover, since the DM fermions are Dirac, we can define a global DM number X, that will\nbe conserved at the Lagrangian level just as the baryon number B.\nWe further assume that the scalar sector is such that it can provide the required mass\nterms for the fermions, either directly or through higher-dimensional operators, after the\nbreaking of both, the electroweak and the SU(2)H symmetries. For instance, a minimal realization consists of an extra SU(2)H doublet, besides the SM Higgs, with Yukawa couplings\ngiven in terms of effective d = 5 operators such as\nOd=5 = cα LH ΦH Φ†L LLα ,\n\n(4)\n\nwhere ΦH,L is the SU(2)H,L Higgs. After breaking of the SU(2)H symmetry, this reproduces\nthe SM Yukawa terms. Just like the d = 5 Weinberg operator for neutrino masses, such\noperators can be generated in several different ways. The relevant phenomenological aspects\nof the model are independent of the scalar sector, so we shall not discuss it in more detail.\nIn this model, which is free of gauge anomalies, dark sphalerons satisfy ∆B/2 = ∆X =\n∆L, while the SM sphalerons satisfy ∆B = ∆L as usual, resulting in an overall conservation\nof B − X − L at scales where both sphalerons are active and conservation of both B − L\nand X separately in the intermediate regime, where only the dark sphalerons are turned\noff. Thus, if an initial L asymmetry is produced in the decay of the heavy Majorana righthanded neutrinos, both kinds of sphalerons will try to erase it. However, since B − X − L\nis exactly conserved by the combination of both sphalerons, net B and X asymmetries will\nbe induced. In order to obtain the precise ratios between the final B, L and X asymmetries\nthe equilibrium equations for the chemical potentials have to be written down. We find that\nr=−\n\n22\n79\n\n(5)\n\nwhen both sphaleron processes are in equilibrium. Incidentally, since the DM fields are not\ncharged under any of the SM groups, the equilibrium equations for these groups are identical\n\n6\n\n\fY\n\nField\n\nL H C DC\n\nLLα (ναL , lαL ) −1/2 2 1 1\n\n1\n\nLH (eR , μR )\n\n−1 1 2 1\n\n1\n\nτR\n\n−1 1 1 1\n\n1\n\nναR\n\n0\n\n1 1 1\n\n1\n\nQαL (uαL , dαL ) 1/6 2 1 3\n\n1\n\nQuH (uR , cR )\n\n2/3 1 2 3\n\n1\n\nQdH (dR , sR )\n\n−1/3 1 2 3\n\n1\n\ntR\n\n2/3 1 1 3\n\n1\n\nbR\n\n−1/3 1 1 3\n\n1\n\nXH (x1R , x2R )\n\n0\n\n1 2 1\n\n3\n\nx3R , xαL\n\n0\n\n1 1 1\n\n3\n\nTABLE I: Fermion field content for our illustrative model and the corresponding charge assignments. Whenever a field has an index α, the model contains three copies of this field. Note that\nthe assignment of putting particular generations in the SU (2)H doublets is arbitrary.\n\nbefore and after the SU(2)H freeze-out. For the final DM to baryon ratio, we obtain\nX\n11\n−→ − .\nB\n14\n\n(6)\n\nTherefore, in order to accommodate the observed values of ΩX and ΩB , we must have\nmDM ≃ mB\n\n14ΩX\n= 5.94 ± 0.42 GeV,\n11ΩB\n\n(7)\n\nincluding the errors of the WMAP7 measurementes [1]. This value is in the low mass regime\nbetween 5 and 10 GeV favored by the claimed DM signals of the DAMA/LIBRA [52] and\nCoGeNT [53] collaborations. In particular it is strikingly close to the ∼ 7 GeV required\nto consistently describe both signals and is within the 99 % confidence level for the mass\nobtained in Ref. [54].\nIn order to obtain the prediction for the DM mass of Eq. (7) we have introduced a\nscalar doublet of the SU(2)H symmetry and considered the necessary operators involving\nthis scalar doublet and the Higgs field in order to obtain Yukawa couplings for all fermions.\nThus, for the first two generations of charged SM fermions, the Yukawa couplings become\n7\n\n\feffective d = 5 operators. However, we find that the prediction of Eq. (7) is fairly independent of the particles that mediate the d = 5 operators as well as the extra SU(2)H scalar\nmultiplets introduced to break the horizontal symmetry and generate Yukawa couplings.\nIndeed, if a heavy mediator to induce the effective d = 5 operator is considered and the\neffective operator is opened into renormalizable ones, solving the equilibrium equations for\nthe chemical potential of the heavy particle, the same equation implied by the original d = 5\noperator is obtained. Thus, if the mediator does not carry baryon or DM number (being for\ninstance a scalar) or if it is heavy enough to be integrated out of the theory at the scale at\nwhich baryogenesis and aidnogenesis take place, Eq. (7) would not be modified. Regarding\nthe details of the scalar sector introduced to break the SU(2)H symmetry, we find that the\nsolution of the equilibrium equations imply that the chemical potentials of both the gauge\nbosons associated to the SU(2)H symmetry and the scalar multiplets introduced to break it\nare zero. Thus, the chemical potentials for the particles of the different generations are the\nsame. If different scalar multiplets were assumed instead, setting their chemical potentials\nto zero would also be a solution to the equilibrium equations and thus Eq. (7) seems to be\nindependent also from the details of the SU(2)H symmetry breaking.\nNote that our model has three generations of DM fermions, in analogy with the observed\nfermions of the SM. However, the third generation of DM fields (i.e., x3 ) does not play\nan active role and can be removed from the model. This would result in the DM number\ndensity being reduced by a factor 2/3 and thus predict mDM ≃ 9 GeV.\nIV.\n\nCONSTRAINTS ON THE MODEL\n\nThe first requisite that has to be met for successful generation of the baryon and dark\nmatter asymmetries via leptogenesis, is that the SU(2)H sphalerons reach thermal equilibrium before the phase transition occurs and suppresses their rate. Thus, the sphaleron rate\nshould be greater than the Hubble rate, leading to a lower bound on the SU(2)H coupling\nconstant as a function of the temperature above which equilibrium should be achieved:\n4\nαH\n\n=\n\n\u0012\n\n2\ngH\n4π\n\n\u00134\n\n& 10\n\nT\n.\nMP l\n\n(8)\n\nOn the other hand, a lower bound on the strength of the SU(2)H interaction at lower\nenergies can be derived from the requirement that the thermally produced symmetric com8\n\n\fponent of dark matter is transfered to the SM fast enough. Indeed, as with any field which\nis kept in thermal equilibrium, the ADM candidate will have a thermal abundance of both\nparticles and anti-particles in the early Universe. In order for the DM to become asymmetric, there must exist interactions through which this symmetric thermal abundance can\nbe effectively annihilated once the ADM falls out of thermal equilibrium. In our example\nmodel, this is achieved by the strong SU(3)DC interactions connecting the symmetric part\nof the DM fields into dark SU(3)DC mesons which can decay to SM particles via SU(2)H\ngauge bosons. Analogously to pion decays in the SM, the dark meson decays will require\na chirality flip of the SM fermions they decay into. To estimate the decay rate of the dark\nmesons we will assume that the dominant decay channel is either to two muons or a tau and\na lighter lepton and thus proportional to the muon or tau mass.\nIn order not to disturb the standard history of the Universe, the SU(3)DC mesons (which\nconstitute a large matter component) must decay sufficiently fast into SM fermions so that\nthey are no longer present during big bang nucleosynthesis (BBN). Thus, the lifetime of the\nmesons must be significantly less than one second. Since the horizontal gauge bosons could\nalso induce FCNC processes in the SM sector, bounds can be derived on the related effective\n√ 2\n2gH /8MH2 . Naturally, such bounds are stronger if the two\nSU(2)H Fermi constant GH\nF =\nSM generations involved contain the lightest fermions of each type (e.g., e and μ rather\nthan μ and τ ), since these FCNC have stronger experimental constraints. In Fig. 1 we show\ncontours for the lower bound on GH\nF such that the lifetime of the dark mesons is smaller\nthan 10−2 s as a function of the dark meson mass mH and decay constant fH . Notice that\nthe values of these two quantities will depend on the strength of the SU(3)DC interaction\nas well as the masses of the dark matter fermions. In any case the \"dark meson\" masses\nshould be heavier than ∼ 100 MeV so that they decay before BBN but lighter than the\n\"dark baryon\" mass so that the symmetric component is stored mainly in mesons and not\nbaryons and antibaryons, this corresponds to the maximum value of mH depicted in Fig. 1.\nIf the dominant decay channel is to a muon pair (left panel), then the bound is typically\nof O(10−10 ) GeV−2 , while the bounds are about an order of magnitude weaker for decays\ninto a tau and a lighter lepton (right panel). In this last case the decay can only happen if\nmH > mτ which corresponds to the horizontal asymptote.\nOn the other hand, the strongest constraint on GH\nF from FCNC stems from the bound on\n−12\nthe decay K → eμ and implies that GH\nGeV−2 , which would cause tension with\nF < 3.6 * 10\n\n9\n\n\f60\n\n50\n\n50\n\n40\n\n40\nmH \u0090mΠ\n\nmH \u0090mΠ\n\n60\n\n30\n\n30\n\n20\n\n20\n\n10\n\n10\n10\n\n20\n\n30 40\nf H \u0090 fΠ\n\n50\n\n60\n\n10\n\n20\n\n30 40\nf H \u0090 fΠ\n\n50\n\n60\n\nFIG. 1: Contours for the lower bound on GH\nF such that the lifetime of the dark mesons is smaller\nthan 10−2 s as a function of the dark meson mass mH and decay constant fH . Left panel for\n−9\n−10 , 10−10 GeV−2 and\na dominant decay into muons depicts the contours for GH\nF > 10 , 5 * 10\n\n5 * 10−11 from the bottom of the plot to the top. Right panel for a dominant decay into a tau and\n−10 , 5 * 10−11 , 10−11 and 5 * 10−12 GeV−2 from\na lighter lepton depicts the contours for GH\nF > 10\n\nthe bottom of the plot to the top.\n\nthe lower bounds derived in Fig. 1. However, this constraint does not apply if the horizontal\nsymmetry is broken in stages. For example, this may be achieved by first breaking the\nSU(2)H to U(1)H by a real scalar triplet acquiring a vacuum expectation value along the\nσ3 direction and giving large masses to the flavor changing gauge bosons while leaving the\nflavor conserving one massless. This procedure is similar to Georgi and Glashow's model of\nelectroweak interactions, which did not include neutral currents [55]. The remaining flavor\ndiagonal U(1)H can be subsequently broken at a scale low enough to obtain interactions\nof the strength required for the dark mesons to decay into two muons. In this case the\ndominant decay channel of the dark mesons could be to two muons and the constraints on\nthe left-handed panel of Fig. 1 would apply. Reconciling this scenario with the lower bound\non gH from Eq. (8) is easy since the scale of the SU(2)H symmetry breaking is unrelated\nto the mass of the flavour-conserving Z ′ , for instance with gH = 0.5 the sphalerons would\nreach thermal equilibrium at T . 1011 GeV and the first stage of symmetry breaking, which\nwould freeze out the sphalerons, should occur above Λ & 105 GeV.\n10\n\n\fAn interesting alternative would be to couple the two heaviest SM fermion generations\nto the SU(2)H and having the scalar triplet acquire its vev along the σ1 direction. In this\ncase the residual U(1)H would still induce FCNC in the t − c, b − s and τ − μ sectors but\nthe constraints are in this case weaker and allow for sufficiently fast dark meson decays.\n−11\nIndeed, such a U(1)H with strength GH\nGeV−2 is allowed by present data and\nF = 7 * 10\n\nwould contribute to CP violation in the Bs system, accommodating the observed dimuon\nanomaly at Tevatron [56]. In this case the dark mesons would decay into a tau and a muon\nand the constraints depicted in the right panel of Fig. 1 would apply. In this scenario, it is\nalso possible to identify the scale of the SU(2)H symmetry breaking with the mass of the\nflavour-changing Z ′ contributing to Bs mixing. In combination with Eq. (8) this would imply\nthat gH & 0.06 and Λ & 2.7 TeV, for the dark sphalerons to enter in thermal equilibrium at\nT & Λ.\n\nV.\n\nPHENOMENOLOGICAL PROSPECTS\n\nThe detection prospects for this kind of DM mainly come from three directions: direct\ndetection through nuclear recoil, production at colliders, and through FCNCs. The most\ninteresting prospects are from direct detection by observing the nuclear recoil of a DM\n2\nparticle hitting a nucleon. Given that the cross-section goes as GH2\nF E , where E is an energy\n\nat the typical scale of the DM mass in our model, we predict a ADM-nucleon cross-section\n−10\nGeV−2 .\nσ & 10−46 cm2 , where we have used the dark meson lifetime constraint GH\nF & 10\n\nIt is worth pointing out that generally the sensitivity of direct detection experiments is\nweaker for the low DM mass regime favored by ADM. In this regime, the present bounds set\non the spin-independent cross section by the XENON100 [57] and CDMS [58] collaborations\nare O(10−40 ) cm2 . However, proposed upgrades to these experiments or future experiments\ncould probe most of the allowed range.\nFrom the collider perspective, the best present bounds come from the non-observation\nof the Z ′ associated to the U(1)H . The results from LEP-II suggest that, if the Z ′ at\nlow energies couples with full strength to electrons and other charged leptons then GH\nF <\n5.14 * 10−8 GeV−2 [59], while the present limits from Tevatron are subdominant. This\nwould be in tension with the interpretation of the DAMA and CoGeNT experiments that\n−7\n−2\nrequire GH\n[54]. These bounds could be evaded if the SU(2)H gauge symmetry\nF ∼ 10 GeV\n\n11\n\n\fcouples mainly to the heavier charged lepton generations. In any case, the bound is about\ntwo or three orders of magnitude above the dark meson lifetime constraint. There is scope\nto improve this at LHC, where the limits can be improved by almost 30 % in some regions\nof the gZ ′ /MZ ′ plane. On the other hand, future LHC constraints could be derived from a\nsomewhat general approach, as shown in Ref. [60], where one could explore cross-sections\nwell-below 10−41 cm2 and almost all the way to 10−46 cm2 , depending on the details of the\ncoupling of DM to quarks.\nFurthermore, FCNC processes are generic features of this type of model. However, the\ninteraction strength for these depends on the specifics of symmetry breaking and can be\neither strong enough to be already making an impact at present experiments (i.e., the\nTevatron dimuon anomaly) or so weak that it is unobservable for all practical purposes (i.e.,\nthe symmetry is broken in such a way that only a flavor diagonal interaction remains at\nlower energies). If FCNCs are discovered at Super-B factories [61], the flavor symmetry\nbreaking structure could be probed.\n\nVI.\n\nSUMMARY AND CONCLUSIONS\n\nIn this work, we have discussed the prospects of generating asymmetric dark matter\n(ADM) from an initial lepton asymmetry through the sphalerons of a new non-abelian gauge\ngroup. The initial lepton asymmetry is taken to be the result of a leptogenesis mechanism.\nAs an example of a model where this occurs, we have discussed an anomaly free model, in\nwhich the Standard Model (SM) is extended by dark matter fermion fields and an additional\nhorizontal SU(2) gauge symmetry. In addition, the model contains a color like SU(3) gauge\ninteraction in the dark sector, preventing the mixing with the right-handed neutrinos and\nrequiring the dark matter to be in the form of charge neutral baryon-like states. The mass of\nthese baryon-like states is predicted by comparing the number densities of baryons and dark\nbaryons with the ratio ΩX /ΩB = 4.98 ± 0.35 and the result is mDM = (5.94 ± 0.42) GeV.\nThe similarity with the SM QCD interaction is also suggestive, given the similar masses of\nbaryons and DM required to fit the observed energy densities. The SU(3) self-interaction\ncan be quite large and leads to almost spherical DM halos in galaxies, in somewhat better\nagreement with data, compared to WIMPs.\nIn order to get rid of the thermally produced symmetric component of the dark matter\n12\n\n\fbefore big bang nucleosynthesis (BBN), it is required that the dark mesons decay into SM\nfields with a coupling constant of & 10−10 GeV−2 . Thus, the predictions of this model\nare suggestively close to the values favoured by a consistent description of the DAMA and\nCoGeNT experiments, which require mDM ∼ 7 GeV and a DM-baryon interaction with\nstrength ∼ GF /100.\nIn the particular realization we discussed, the additional chiral symmetry corresponding\nto the dark sphalerons is a horizontal symmetry inspired by possible solutions to the flavor\npuzzle and the Tevatron dimuon anomaly. It is beyond the scope of this work to build a full\nmodel addressing these two problems in combination with dark matter generation. However,\nthe possibility of a connection between dark matter and the flavor puzzle is intriguing and\nshould be explored further.\n\nVII.\n\nACKNOWLEDGMENTS\n\nThe authors would like to acknowledge useful discussions with S. Antusch, J. Beacom,\nC. Biggio, B. Gavela, G. Raffelt, J. Redondo, C. Rott, F. Steffen and S. Zhou. We are\nespecially indebted to L. Lopez Honorez for her participation in the early stages of the\nproject. B.D. and E.F.M. would like to acknowledge support from MPI for Physics in Munich, where this work began, and for hospitality in the later stages of this work. M.B. ,\nE.F.M. and N.R. would also like to acknowledge the hospitality of CERN, especially during\nthe νTheME workshop, where part of this work was performed. This work was supported\nby the European Union through the European Commission Marie Curie Actions Framework\nProgramme 7 Intra-European Fellowship: Neutrino Evolution [M.B.], by Spanish MICCIN\nunder grants FPA-2007-60323 and Consolider-Ingenio PAU (CSD2007-00060) and by Generalitat Valenciana grant PROMETEO/2009/116 [N.R.].\n\n[1] E. Komatsu et al. (2010), arXiv:1001.4538.\n[2] G. Bertone, D. Hooper, and J. Silk, Phys. Rept. 405, 279 (2005), hep-ph/0404175.\n[3] G. Jungman, M. Kamionkowski, and K. Griest, Phys. Rept. 267, 195 (1996), hep-ph/9506380.\n[4] R. Barbier et al., Phys. Rept. 420, 1 (2005), hep-ph/0406039.\n[5] E. W. Kolb and M. S. Turner, Front.Phys. 69, 1 (1990).\n\n13\n\n\f[6] G. Servant and T. M. P. Tait, Nucl. Phys. B650, 391 (2003), hep-ph/0206071.\n[7] H.-C. Cheng, J. L. Feng, and K. T. Matchev, Phys. Rev. Lett. 89, 211301 (2002), hepph/0207125.\n[8] S. Nussinov, Phys.Lett. B165, 55 (1985).\n[9] S. M. Barr, R. S. Chivukula, and E. Farhi, Phys. Lett. B241, 387 (1990).\n[10] S. M. Barr, Phys. Rev. D44, 3062 (1991).\n[11] D. B. Kaplan, Phys. Rev. Lett. 68, 741 (1992).\n[12] V. A. Kuzmin, Phys. Part. Nucl. 29, 257 (1998), hep-ph/9701269.\n[13] A. Kusenko (1998), hep-ph/9901353.\n[14] G. R. Farrar and G. Zaharijas (2004), hep-ph/0406281.\n[15] D. Hooper, J. March-Russell, and S. M. West, Phys. Lett. B605, 228 (2005), hep-ph/0410114.\n[16] R. Kitano and I. Low, Phys. Rev. D71, 023510 (2005), hep-ph/0411133.\n[17] K. Agashe and G. Servant, JCAP 0502, 002 (2005), hep-ph/0411254.\n[18] R. Kitano and I. Low (2005), hep-ph/0503112.\n[19] N. Cosme, L. Lopez Honorez, and M. H. G. Tytgat, Phys. Rev. D72, 043505 (2005), hepph/0506320.\n[20] G. R. Farrar and G. Zaharijas, Phys. Rev. Lett. 96, 041302 (2006), hep-ph/0510079.\n[21] D. Suematsu, Astropart. Phys. 24, 511 (2006), hep-ph/0510251.\n[22] M. H. G. Tytgat (2006), hep-ph/0606140.\n[23] T. Banks, S. Echols, and J. L. Jones, JHEP 11, 046 (2006), hep-ph/0608104.\n[24] V. Page, JHEP 04, 021 (2007), hep-ph/0701266.\n[25] R. Kitano, H. Murayama, and M. Ratz, Phys. Lett. B669, 145 (2008), arXiv:0807.4313.\n[26] E. Nardi, F. Sannino, and A. Strumia, JCAP 0901, 043 (2009), arXiv:0811.4153.\n[27] D. E. Kaplan, M. A. Luty, and K. M. Zurek, Phys. Rev. D79, 115016 (2009), arXiv:0901.4117.\n[28] G. D. Kribs, T. S. Roy, J. Terning, and K. M. Zurek, Phys. Rev. D81, 095001 (2010),\narXiv:0909.2034.\n[29] T. Cohen and K. M. Zurek, Phys. Rev. Lett. 104, 101301 (2010), arXiv:0909.2035.\n[30] Y. Cai, M. A. Luty, and D. E. Kaplan (2009), arXiv:0909.5499.\n[31] H. An, S.-L. Chen, R. N. Mohapatra, and Y. Zhang, JHEP 03, 124 (2010), arXiv:0911.4463.\n[32] M. T. Frandsen and S. Sarkar, Phys. Rev. Lett. 105, 011301 (2010), arXiv:1003.4505.\n[33] H. An et al., Phys. Rev. D82, 023533 (2010), arXiv:1004.3296.\n\n14\n\n\f[34] T. Cohen, D. J. Phalen, A. Pierce, and K. M. Zurek, Phys. Rev. D82, 056001 (2010),\narXiv:1005.1655.\n[35] M. Taoso et al. (2010), arXiv:1005.5711.\n[36] J. Shelton and K. M. Zurek (2010), arXiv:1008.1997.\n[37] H. Davoudiasl, D. E. Morrissey, K. Sigurdson, and S. Tulin (2010), arXiv:1008.2399.\n[38] N. Haba and S. Matsumoto (2010), arXiv:1008.2487.\n[39] A. Belyaev, M. T. Frandsen, S. Sarkar, and F. Sannino (2010), arXiv:1007.4839.\n[40] E. J. Chun (2010), arXiv:1009.0983.\n[41] M. R. Buckley and L. Randall (2010), arXiv:1009.0270.\n[42] P.-H. Gu, M. Lindner, U. Sarkar, and X. Zhang (2010), arXiv:1009.2690.\n[43] M. Fukugita and T. Yanagida, Phys. Lett. B174, 45 (1986).\n[44] D. N. Spergel and P. J. Steinhardt, Phys. Rev. Lett. 84, 3760 (2000), astro-ph/9909386.\n[45] M. Taoso, G. Bertone, and A. Masiero, JCAP 0803, 022 (2008), arXiv:0711.4996.\n[46] S. Y. Khlebnikov and M. E. Shaposhnikov, Nucl. Phys. B308, 885 (1988).\n[47] J. A. Harvey and M. S. Turner, Phys. Rev. D42, 3344 (1990).\n[48] P. Minkowski, Phys. Lett. B67, 421 (1977).\n[49] M. Gell-Mann, P. Ramond, and R. Slansky, in Complex spinors and unified theories in Supergravity, Proceedings of the Workshop, Stony Brook, New York, 1979, edited by P. van\nNieuwenhuizen and D. Freedman (North-Holland, Amsterdam, 1979).\n[50] R. N. Mohapatra and G. Senjanović, Phys. Rev. Lett. 44, 912 (1980).\n[51] E. Witten, Phys.Lett. B117, 324 (1982).\n[52] R. Bernabei et al., Eur. Phys. J. C67, 39 (2010), arXiv:1002.1028.\n[53] C. E. Aalseth et al. (CoGeNT) (2010), arXiv:1002.4703.\n[54] D. Hooper, J. I. Collar, J. Hall, and D. McKinsey (2010), arXiv:1007.1005.\n[55] H. Georgi and S. L. Glashow, Phys. Rev. Lett. 28, 1494 (1972).\n[56] S. C. Park, J. Shu, K. Wang, and T. T. Yanagida (2010), arXiv:1008.4445.\n[57] E. Aprile et al. (XENON100) (2010), arXiv:1005.0380.\n[58] Z. Ahmed et al. (The CDMS-II), Science 327, 1619 (2010), arXiv:0912.3592.\n[59] The LEP Collaborations (LEP) (2003), hep-ex/0312023.\n[60] J. Goodman et al. (2010), arXiv:1008.1783.\n[61] B. O'Leary et al. (SuperB) (2010), arXiv:1008.1541.\n\n15\n\n\f"}