{"id": "http://arxiv.org/abs/0710.4922v2", "guidislink": true, "updated": "2009-01-03T18:35:02Z", "updated_parsed": [2009, 1, 3, 18, 35, 2, 5, 3, 0], "published": "2007-10-25T18:17:53Z", "published_parsed": [2007, 10, 25, 18, 17, 53, 3, 298, 0], "title": "Constraining DM properties with SPI", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.5064%2C0710.4216%2C0710.2493%2C0710.3542%2C0710.4099%2C0710.4989%2C0710.0655%2C0710.1104%2C0710.3845%2C0710.1945%2C0710.5802%2C0710.3348%2C0710.0218%2C0710.5697%2C0710.0184%2C0710.4096%2C0710.0516%2C0710.0744%2C0710.2797%2C0710.3934%2C0710.4922%2C0710.3512%2C0710.1274%2C0710.4661%2C0710.1375%2C0710.5447%2C0710.3505%2C0710.1178%2C0710.1831%2C0710.4857%2C0710.0698%2C0710.3293%2C0710.5472%2C0710.5441%2C0710.4125%2C0710.3587%2C0710.2357%2C0710.0496%2C0710.5404%2C0710.4302%2C0710.4560%2C0710.4628%2C0710.0682%2C0710.3584%2C0710.4458%2C0710.3891%2C0710.0544%2C0710.5489%2C0710.0781%2C0710.2292%2C0710.4275%2C0710.1144%2C0710.5567%2C0710.5435%2C0710.0390%2C0710.4288%2C0710.2913%2C0710.3243%2C0710.3555%2C0710.5523%2C0710.4220%2C0710.1189%2C0710.5715%2C0710.5640%2C0710.1192%2C0710.2256%2C0710.0424%2C0710.5869%2C0710.0996%2C0710.1839%2C0710.1392%2C0710.2429%2C0710.1637%2C0710.3539%2C0710.5298%2C0710.3937%2C0710.3508%2C0710.3023%2C0710.2255%2C0710.3614%2C0710.1728%2C0710.1320%2C0710.5796%2C0710.5859%2C0710.1167%2C0710.4583%2C0710.0712%2C0710.3734%2C0710.0481%2C0710.5312%2C0710.0940%2C0710.4953%2C0710.5277%2C0710.4376%2C0710.4184%2C0710.4131%2C0710.1387%2C0710.5317%2C0710.2633%2C0710.0134%2C0710.4205&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Constraining DM properties with SPI"}, "summary": "Using the high-resolution spectrometer SPI on board the International\nGamma-Ray Astrophysics Laboratory (INTEGRAL), we search for a spectral line\nproduced by a dark matter(DM) particle with a mass in the range 40keV < M_DM <\n14MeV, decaying in the DM halo of the Milky Way. To distinguish the DM decay\nline from numerous instrumental lines found in the SPI background spectrum, we\nstudy the dependence of the intensity of the line signal on the offset of the\nSPI pointing from the direction toward the Galactic Centre. After a critical\nanalysis of the uncertainties of the DM density profile in the inner Galaxy, we\nfind that the intensity of the DM decay line should decrease by at least a\nfactor of 3 when the offset from the Galactic Centre increases from 0 to 180\ndegrees. We find that such a pronounced variation of the line flux across the\nsky is not observed for any line, detected with a significance higher than 3\nsigma in the SPI background spectrum. Possible DM decay origin is not ruled out\nonly for the unidentified spectral lines, having low (~3 sigma) significance or\ncoinciding in position with the instrumental ones. In the energy interval from\n20 keV to 7 MeV, we derive restrictions on the DM decay line flux, implied by\nthe (non-)detection of the DM decay line. For a particular DM candidate, the\nsterile neutrino of mass MDM, we derive a bound on the mixing angle.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.5064%2C0710.4216%2C0710.2493%2C0710.3542%2C0710.4099%2C0710.4989%2C0710.0655%2C0710.1104%2C0710.3845%2C0710.1945%2C0710.5802%2C0710.3348%2C0710.0218%2C0710.5697%2C0710.0184%2C0710.4096%2C0710.0516%2C0710.0744%2C0710.2797%2C0710.3934%2C0710.4922%2C0710.3512%2C0710.1274%2C0710.4661%2C0710.1375%2C0710.5447%2C0710.3505%2C0710.1178%2C0710.1831%2C0710.4857%2C0710.0698%2C0710.3293%2C0710.5472%2C0710.5441%2C0710.4125%2C0710.3587%2C0710.2357%2C0710.0496%2C0710.5404%2C0710.4302%2C0710.4560%2C0710.4628%2C0710.0682%2C0710.3584%2C0710.4458%2C0710.3891%2C0710.0544%2C0710.5489%2C0710.0781%2C0710.2292%2C0710.4275%2C0710.1144%2C0710.5567%2C0710.5435%2C0710.0390%2C0710.4288%2C0710.2913%2C0710.3243%2C0710.3555%2C0710.5523%2C0710.4220%2C0710.1189%2C0710.5715%2C0710.5640%2C0710.1192%2C0710.2256%2C0710.0424%2C0710.5869%2C0710.0996%2C0710.1839%2C0710.1392%2C0710.2429%2C0710.1637%2C0710.3539%2C0710.5298%2C0710.3937%2C0710.3508%2C0710.3023%2C0710.2255%2C0710.3614%2C0710.1728%2C0710.1320%2C0710.5796%2C0710.5859%2C0710.1167%2C0710.4583%2C0710.0712%2C0710.3734%2C0710.0481%2C0710.5312%2C0710.0940%2C0710.4953%2C0710.5277%2C0710.4376%2C0710.4184%2C0710.4131%2C0710.1387%2C0710.5317%2C0710.2633%2C0710.0134%2C0710.4205&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Using the high-resolution spectrometer SPI on board the International\nGamma-Ray Astrophysics Laboratory (INTEGRAL), we search for a spectral line\nproduced by a dark matter(DM) particle with a mass in the range 40keV < M_DM <\n14MeV, decaying in the DM halo of the Milky Way. To distinguish the DM decay\nline from numerous instrumental lines found in the SPI background spectrum, we\nstudy the dependence of the intensity of the line signal on the offset of the\nSPI pointing from the direction toward the Galactic Centre. After a critical\nanalysis of the uncertainties of the DM density profile in the inner Galaxy, we\nfind that the intensity of the DM decay line should decrease by at least a\nfactor of 3 when the offset from the Galactic Centre increases from 0 to 180\ndegrees. We find that such a pronounced variation of the line flux across the\nsky is not observed for any line, detected with a significance higher than 3\nsigma in the SPI background spectrum. Possible DM decay origin is not ruled out\nonly for the unidentified spectral lines, having low (~3 sigma) significance or\ncoinciding in position with the instrumental ones. In the energy interval from\n20 keV to 7 MeV, we derive restrictions on the DM decay line flux, implied by\nthe (non-)detection of the DM decay line. For a particular DM candidate, the\nsterile neutrino of mass MDM, we derive a bound on the mixing angle."}, "authors": ["Alexey Boyarsky", "Denys Malyshev", "Andrey Neronov", "Oleg Ruchayskiy"], "author_detail": {"name": "Oleg Ruchayskiy"}, "author": "Oleg Ruchayskiy", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1111/j.1365-2966.2008.13003.x", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0710.4922v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0710.4922v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Minor changes; v.2 - Final version appeared in MNRAS", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0710.4922v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0710.4922v2", "journal_reference": "Mon.Not.Roy.Astron.Soc.387:1345,2008", "doi": "10.1111/j.1365-2966.2008.13003.x", "fulltext": "Mon. Not. R. Astron. Soc. 000, 1–15 (2007)\n\nPrinted 30 October 2018\n\n(MN LATEX style file v2.2)\n\nCERN-PH-TH/2007-202\n\narXiv:0710.4922v2 [astro-ph] 3 Jan 2009\n\nConstraining DM properties with SPI\nAlexey Boyarsky1⋆, Denys Malyshev2,3, Andrey Neronov4⋆ , Oleg Ruchayskiy5\n1\n\nCERN, PH/TH, CH-1211 Geneve 23, Switzerland\nBogolyubov Institute for Theoretical Physics, Kiev, 03780, Ukraine\n3 Dublin Institute for Advanced Studies, 31 Fitzwilliam Place, Dublin 2, Ireland\n4 INTEGRAL Science Data Center, Chemin d'Écogia 16, 1290 Versoix, Switzerland\nGeneva Observatory, 51 ch. des Maillettes, CH-1290 Sauverny, Switzerland\n5 École Polytechnique Fédérale de Lausanne, Institute of Theoretical Physics,\nFSB/ITP/LPPC, BSP 720, CH-1015, Lausanne, Switzerland\n2\n\nABSTRACT\n\nUsing the high-resolution spectrometer SPI on board the International Gamma-Ray Astrophysics Laboratory (INTEGRAL), we search for a spectral line produced by a dark matter\n(DM) particle with a mass in the range 40keV < MDM < 14M eV , decaying in the DM halo\nof the Milky Way. To distinguish the DM decay line from numerous instrumental lines found\nin the SPI background spectrum, we study the dependence of the intensity of the line signal\non the offset of the SPI pointing from the direction toward the Galactic Centre. After a critical\nanalysis of the uncertainties of the DM density profile in the inner Galaxy, we find that the\nintensity of the DM decay line should decrease by at least a factor of 3 when the offset from\nthe Galactic Centre increases from 0◦ to 180◦ . We find that such a pronounced variation of\nthe line flux across the sky is not observed for any line, detected with a significance higher\nthan 3σ in the SPI background spectrum. Possible DM decay origin is not ruled out only for\nthe unidentified spectral lines, having low (∼ 3σ) significance or coinciding in position with\nthe instrumental ones. In the energy interval from 20 keV to 7 MeV, we derive restrictions on\nthe DM decay line flux, implied by the (non-)detection of the DM decay line. For a particular\nDM candidate, the sterile neutrino of mass MDM , we derive a bound on the mixing angle.\nKey words: methods: data analysis–techniques: spectroscopic – Galaxy: halo – dark matter;\n\n1 INTRODUCTION\nDark matter in the Universe\nThere is a vast body of evidence, suggesting that the large fraction of matter in the Universe exists in the form of the Dark matter (DM). However, while the total density of the DM is measured\nwith a very high precision (ΩDM h2 = 0.105+0.007\n−0.009 , Spergel et al.\n2007), little is known about its properties apart from this. The possibility that the DM is composed of the Standard Model (SM) particles has been ruled out for a long time already. Indeed, the DM\ncannot be made out of baryons, as producing such an amount of\nbaryonic matter would require drastic modifications of the scenario of the Big Bang nucleosynthesis (BBN), which otherwise\nsuccessfully describes the abundance of light elements (see for\nexample Dar 1995). Recent microlensing experiments rule out\nthe possibility that another type of baryonic DM – massive com-\n\n⋆\n\nOn leave of absence from Bogolyubov Institute for Theoretical Physics,\nKiev, Ukraine\n\npact halo objects (MACHOs) – constitute dominant fraction of\nmass in the halo (Alcock et al. 2000; Lasserre et al. 2000; Alard\n1999). The only non-baryonic DM candidate in the SM candidates – (left-handed) neutrino – is ruled out from the large\nscale structure (LSS) considerations (see e.g. Bond et al. 1980;\nHannestad & Raffelt 2004; Crotty et al. 2004).\nWhat are the properties of a successful DM candidate?\nFirst of all, this particle should be massive. Many extensions\nof the SM present the DM candidates with the masses ranging from ∼ 10−10 eV (massive gravitons, Dubovsky et al. 2005)\nand ∼ 10−6 eV (axions) to hundreds of GeV (WIMPs) and\neven to 1013 GeV (WIMPZILLA, Kuzmin & Tkachev 1998, 1999;\nChung et al. 1999). For a review of particle physics DM candidates\nsee e.g. Bergstrom (2000); Bertone et al. (2005); Carr et al. (2006).\nSecondly, there should exist mechanisms of DM production\nwith the correct abundances. The production mechanism in particular determines the velocity distribution of particles in the early\nUniverse. This velocity distribution can, in principle, be probed experimentally. Namely, if during the structure formation epoch the\nDM particles have velocities, comparable to the speed of sound\n\n\f2\n\nA. Boyarsky et al.\n\nin the baryon-photon plasma, they \"erase\" density fluctuations at\nscales, smaller than the distance, they have traveled (called the\nfree-streaming length). To differentiate various models in accordance with this property, the DM candidates with the negligible velocity dispersion (and, correspondingly, free-streaming) are called\ncold DM (CDM), while those with the free-streaming of the order of ∼ 1 Mpc are considered to be warm (WDM).1 It is possible to constrain the free-streaming length of a particular DM\ncandidate by probing the structure of the Universe at galaxy-size\nscales. This can be done through the analysis of the Lyman-α forest data (Hui et al. 1997). Lyman-α analysis puts an upper bound\non the free-streaming of the DM particles (Hansen et al. 2002;\nViel et al. 2005; Seljak et al. 2006; Viel et al. 2006; Viel et al.\n2007). It should be noted however that currently existing interpretation of the Lyman-α data is model-dependent, as, apart from a number of astrophysical assumptions (see Hui et al. 1997) and complicated hydrodynamic simulations, it relies on a priori assumptions\nabout the velocity distribution of the DM particles.\nA way to differentiate between CDM and WDM models\nwould be to compare the numerical simulations of the DM distribution in the Milky Way-type galaxies with the actual observations. However, the resolution of the N-body simulations is not\nyet sufficient to answer the questions about e.g. the DM density\nprofiles in dwarf satellite galaxies. Moreover, most of the simulations include only collisionless DM particles, and do not model\nthe baryons and their feedback on the galaxy structure formation.\nThese problems are not solved even for the CDM simulations, and\nWDM simulations have additional serious difficulties. From an observational point of view, it has been argued for some time already\nthat there is a discrepancy between CDM simulations and observations (see e.g. Moore 1994; Moore et al. 1999; Klypin et al. 1999;\nBode et al. 2001; Avila-Reese et al. 2001; Goerdt et al. 2006) It has\nbeen claimed recently that a number of recent observations of dwarf\nsatellite galaxies of the Milky way and Andromeda galaxy seem\nto indicate the existence of the smallest scale at which the DM\nexists (Gilmore et al. 2006, 2007; Gilmore 2007; Koposov et al.\n2007). However, this statement and the interpretation of the observations are still subject to debate (Klimentowski et al. 2007;\nPenarrubia et al. 2007; Strigari et al. 2007; Simon & Geha 2007).\nTherefore it is too early to say what kind of DM models is favoured\nby comparing simulations and observations.\nUsually it is also necessary for the DM candidate to be stable.\nFor the most popular DM candidate – weakly interacting massive\nparticles (WIMPs), this is related to the fact that the particles of ∼\nelectroweak mass, having weak strength interaction with SM matter\n(required to produce the correct amount of DM), would decay too\nfast and would not be \"dark\". If, however, the DM particle interacts\nwith the SM more weakly than WIMPs, it could well have a finite\n(although cosmologically long) life time.\nThere exist several unstable (decaying) DM candidates\ne.g. gravitino (Borgani et al. 1996; Baltz & Murayama 2003;\nRoszkowski et al. 2005; Cerdeno et al. 2006; Cembranos et al.\n2006; Lola et al. 2007). In this paper we will concentrate mainly\non one candidate, the sterile neutrino (although our results\nwill be applicable for any type of decaying DM). Constraints\non the decaying DM were analyzed in de Rujula & Glashow\n(1980); Berezhiani et al. (1987); Doroshkevich et al. (1989);\nBerezhiani et al.\n(1990);\nBerezhiani & Khlopov\n(1990);\n\nBertone et al. (2007); Zhang et al. (2007) (see also the book\nby Khlopov 1997).\n\nSterile neutrino DM\nIt was noticed long ago that the right-handed (or as it is often\ncalled sterile) neutrino with the mass in the keV range would represent a viable DM candidate (Dodelson & Widrow 1994). Such\na neutrino would interact with the rest of the matter only via the\nquadratic mixing with left-handed (active) neutrinos and therefore\n(although not stable) could have cosmologically long life-time. At\nthe same time, it could be produced in the early Universe with the\ncorrect abundances (Dodelson & Widrow 1994; Shi & Fuller 1999;\nShaposhnikov & Tkachev 2006). One of the decay channels of the\nunstable sterile neutrinos includes emission of photons of the energy equal to half of the sterile neutrino rest energy. This potentially\nprovides a possibility to observe the decays of DM sterile neutrinos\nvia detection of a characteristic spectral line in the spectra of astrophysical objects with large DM concentration.\nRecently this DM candidate has attracted much attention (see\ne.g. Shaposhnikov (2007) and references therein). It was found that\na very modest and natural extension of the SM by 3 right-handed\nneutrinos (making the SM more symmetric as all SM fermions, including neutrino, would have now their left and right handed counterparts) provided a viable extension of the theory, capable of solving several \"beyond the SM\" problems. First of all, such an extension makes neutrinos massive and thus perhaps provides the simplest and the most natural explanation of the phenomenon of \"neutrino oscillations\" (see e.g. Fogli et al. (2006); Strumia & Vissani\n(2006); Giunti (2007) for reviews). The smallness of neutrino\nmasses in this model (called νMSM in Asaka & Shaposhnikov\n2005) is achieved by the usual see-saw mechanism with Majorana\nmasses of right-handed neutrinos being below electroweak scale.2\nSecondly, if two heavier sterile neutrinos (N2 and N3 )\nare almost degenerate in mass and have their masses between\nO(100)MeV and O(20)GeV, the νMSM provides the mechanism\nof generating the baryon asymmetry of the Universe. Thirdly, the\nlightest sterile neutrino N1 can have arbitrary mass and arbitrarily\nweak coupling with the (active) neutrino sector. At the same time,\nit can be produced in the early Universe in the correct amounts. It\nrepresents therefore the DM particle in the νMSM. Thus, altogether\nthe νMSM represents (arguably) the simplest extension of the SM,\ncapable of explaining three important questions: origin and smallness of neutrino masses, baryon asymmetry in the Universe and the\nexistence of the DM.\n\nExisting restrictions on sterile neutrino DM parameters.\nWhat are the current restrictions on parameters (mass and mixing)\nof sterile neutrino DM? First of all sterile neutrino mass should\n\n2\n1\n\nThe left-handed neutrino would represent hot DM in this terminology,\ni.e. the DM with the free-streaming length ≫ 1 Mpc.\n\nThe fact that the νMSM does not introduce any new scale above the\nelectroweak one, makes this theory especially appealing from the point of\nview of its experimental verification/falsification.\n\n\fConstraining DM properties with SPI\nsatisfy the universal Tremaine-Gunn lower bound:3 MDM & 300 −\n500 eV.4\nNext, as the sterile neutrino possesses the (two-body) radiative\ndecay channel: N1 → ν+γ, the emitted photon would carry the energy Eγ = MDM /2. A large flux of such photons is expected from\nthe large concentrations of the DM sterile neutrinos, like galaxies\nor galaxy clusters.\nRecently an extensive search of the DM decay line in the\nregion of masses MDM . 20 keV was conducted, using the\ndata of Chandra (Riemer-Sørensen et al. 2006; Boyarsky et al.\n2006d; Abazajian et al. 2007) and XMM-Newton (Boyarsky et al.\n2006a,b,c; Watson et al. 2006; Boyarsky et al. 2007). The region of soft X-ray (down to energies 0.2 keV) was explored\nby Boyarsky et al. (2007) with the use of the wide field of view\nspectrometer (McCammon et al. 2002). The non-observation of\nthe DM decay line in X-ray, combined with the first principles\ncalculation of DM production in the early Universe (Asaka et al.\n2007), implies that the Dodelson & Widrow (1994) (DW) scenario can work only if the sterile neutrino mass is below\n4 keV (Boyarsky et al. 2008). If one takes into account recent\nlower bound on the mass of sterile neutrino DM in the DW scenario MDM > 5.6 keV (Viel et al. 2007), it seems that the possibility that all the DM is produced via DW scenario is ruled\nout (Boyarsky et al. 2008). The possibility that only fraction of the\nDM is produced via DW mechanism remains open (Palazzo et al.\n2007).\nThere are other viable mechanisms of DM production, including e.g. resonant oscillation production in the presence of lepton asymmetries (Shi & Fuller 1999). Sterile neutrino DM can be\nproduced by the decay of light inflaton (Shaposhnikov & Tkachev\n2006) or in a similar model with the different choice of parameters (Kusenko 2006; Petraki & Kusenko 2007). These mechanisms\nare currently not constrained and remain valid for DM particles\nwith the masses in the keV range and above.\nThe search for the DM decay line signal produced by sterile neutrinos with masses above ∼ 20 keV is complicated by the\nabsence of the focusing optics telescopes (similar to Chandra or\nXMM-Newton) in the hard X-ray and γ-ray domain of the spectrum. For example, the existing restrictions in the 20 − 100 keV\nmass range (Boyarsky et al. 2006a,c) are derived from the observations of diffuse X-ray background, with the help of non-imaging\ninstruments, HEAO-I (Gruber et al. 1999). The current status of astrophysical observations in summarized in Ruchayskiy (2007).\nIn this paper we use the spectrometer SPI on board of INTEGRAL satellite to place restrictions on parameters of decaying DM in the mass range 40 keV − 14 MeV. This range\nof masses is interesting, for example, the sterile neutrinos, produced in the early Universe in the presence of large lepton\nasymmetries (Shi & Fuller 1999) or through the inflaton decay (Shaposhnikov & Tkachev 2006). It is also relevant for the case\nof gravitino DM (Pagels & Primack 1982; Bond et al. 1982).\n\n3\n\nIn its simplest form the Tremaine-Gunn bound comes from the\nfact that for the fermions there is a maximal density in the phase\nspace (Tremaine & Gunn 1979; Dalcanton & Hogan 2001) and therefore\nthe observed phase-space density in various DM dominated systems should\nbe less that this (mass dependent) bound.\n4 A stronger lower bound from Ly-α (Seljak et al. 2006; Viel et al. 2006;\nViel et al. 2007) can be obtained in the case of the particular production mechanisms – the Dodelson-Widrow scenario (Dodelson & Widrow\n1994). For other possible production mechanisms (e.g. Shi & Fuller 1999;\nShaposhnikov & Tkachev 2006) the Ly-α constraints should be reanalyzed.\n\n3\n\nFigure 1. Comparison of sensitivity towards the search of the narrow DM\ndecay line for different instruments with the wide FoV. Diagonal straight\nlines show the improvement of sensitivity (by a factor, marked on the line)\nas compared with the HEAO-I A4 low energy detector (LED), taken as a\nreference.\n\nWhen the preparation of this paper was at its final\nstage, Yüksel et al. (2008, hereafter Y07) published their work,\nwhich used the results of Teegarden & Watanabe (2006, hereafter\nT06) to place restrictions on the parameters of sterile neutrino DM\nin the range 40 − 700 keV. We discuss it in more details in Section 6.\nSPI spectrometer\nThe absence of the focusing optics significantly reduces the sensitivity of the telescopes operating in the hard X-ray/soft γ-ray energy band. Most of the instruments operating in this energy band\nuse collimators and/or coded masks to distinguish signals from the\nsources on the sky from the instrumental background. Contrary to\nthe focusing optics telescopes, both the source and background signals are collected from the entire detector, which significantly increases the irreducible background.\nThe focusing optics enables to significantly reduce the background only in the studies of point sources. If the source under investigation occupies a large fraction of the sky (e.g. the entire Milky\nWay galaxy), the performance of the focusing and non-focusing instruments with the same detector collection area are, in fact, comparable.\nIn the case of an extended source, emitting a narrow spectral line, an efficient way of reduction of instrumental background\nis via the improvement of the spectral resolution of the instrument (in the case of a broad continuum background spectrum, the\nnumber of background counts at the energy of the line is proportional to the spectral resolution ∆E). The best possible sensitivity\nis achieved when the spectral resolution reaches the intrinsic width\nof the spectral line (see Fig.1 for the case of wide FoV instruments\nand Boyarsky et al. (2007) for the case of narrow FoV instruments).\nIn the case of the line produced by the DM decaying in the\nMilky Way halo, the line width is determined by the Doppler broad-\n\n\f4\n\nA. Boyarsky et al.\n\nR\n\nH\nFigure 3. The effective area of the SPI detector for an on-axis source, as a\nfunction of the photon energy. The plot is produced by collective the on-axis\neffective areas of the 17 SPI detectors from the instrumental characteristics\nfiles.\n\nRdet\n\n2 THE EXPECTED SIGNAL FROM THE DM DECAY IN\nTHE HALO OF THE MILKY WAY.\n\nening by the random motion of the DM particles. The velocity dispersion of the DM motion in the halo is about the rotation velocity\nof the Galactic disk, v ∼ 200 km/s. This means that Doppler broadening of the DM decay line is about\n\nThe expected surface brightness of the DM decay line in a given\ndirection on the sky is a function of the angular distance φ between\nthe given direction on the sky and the direction towards the Galactic\ncenter (GC). It can be calculated by taking the integral of the DM\ndensity profile ρDM (r) along the line of sight (\"column density\")\n«\n„q\nZ∞\n2\n(4)\nr⊙\n− 2zr⊙ cos φ + z 2 ,\nSDM (φ) = dz ρDM\n\n∆E\nv\n∼ ≃ 10−3 .\nE\nc\n\nwhere r⊙ ≃ 8.5 kpc is the distance from the Solar system to the\nGC . Angle φ is related to the galactic coordinates (b, l) via\n\nFigure 2. The geometry of the SPI FoV.\n\n(1)\n\nThus, the optimal spectral resolution of an instrument searching for\nthe DM decay line produced by the Milky Way DM halo should be\n∆E ≃ 10−3 E.\nSuch optimal spectral resolution is almost achieved with the\nspectrometer SPI on board of INTEGRAL satellite, which has the\nmaximal spectral resolving power of E/∆E ≃ 500 and works\nin the energy range 20 keV – 8 MeV (Vedrenne et al. 2003). SPI\nis a \"coded mask\" type instrument with an array of 19 hexagonal\nshaped Ge detectors (of which only 17 are operating at the moment).\nThe SPI telescope consists of a coded mask inscribed into a\ncircle of the radius Rmask = 39 cm, placed at the height H =\n171 cm above the detector plane and of the detector, which has the\nshape of a hexagon inscribed into a circle of the radius Rdet ≃\n15.3 cm (see Fig. 2). The portion of the sky visible from each point\nof the SPI detector (the so-called fully coded field of view, FCFOV)\nhas therefore angular diameter\n»\n–\nRmask − Rdet\nΘFCFOV = 2 arctan\n≈ 16◦ ,\n(2)\nH\nwhile the portion of the sky visible by at least some of the detectors\n(the partially coded field of view, PCFOV) is\n–\n»\nRmask + Rdet\n≈ 35◦ .\n(3)\nΘPCFOV = 2 arctan\nH\nThe solid angle\ncone with this opening angle is\n\" spanned by the \"\nΩPCFOV = 2π 1 − cos(ΘPCFOV /2) ≃ 0.29 (see Fig. 2). Wide field\nof view makes the SPI telescope suitable for the study of the very\nextended sources, like the Milky Way DM halo.\n\n0\n\ncos φ = cos b cos l .\n\n(5)\n◦\n\nThus, the galactic center corresponds to φ = 0 , the anti-center\nφ = 180◦ , and the direction perpendicular to the galactic plane to\nφ = 90◦ . The expected DM flux is given then by\ndFDM (φ)\nΓDM Eγ\nSDM (φ) ,\n(6)\n=\ndΩ\n4πMDM\nwhere ΓDM is the DM decay rate\nIn general, the surface brightness FDM (φ) is variable across\nthe telescope FoV. This is especially true for a wide field of view\n(FoV) instruments (like SPI). In order to calculate the detector\ncount rate, one has to integrate flux (6) over the FoV and over the\n(effective) detector area and then divide by the energy of the photons, Eγ = MDM /2:\nZZ\n ́\nAeff (Eγ |α, β) dFDM `\nR=\ndαdβ\nφ(α, β) ,\n(7)\nEγ\ndΩ\nFoV\n\nwhere (α, β) are the angular coordinates in the FoV, Aeff is the\neffective area at energy Eγ for the photons, coming from the direction (α, β).\nThe effective area of the SPI detector (which is determined by\nthe transparency of the mask and the quantum efficiency of the detector) changes with the photon energy. For an on-axis point source,\ndF/dΩ(α, β) = f0 δ(α)δ(β) ,\nthe integral of Eq. (7) reduces to f0 Aeff,on , where Aeff,on (Eγ ) is\nthe detector effective area for an on-axis source. Its dependence on\nenergy Eγ is shown on Fig. 3.5\n5\n\nThe on-axis effective area is calculated by summing the energy-\n\n\fConstraining DM properties with SPI\n\n5\n\n2.1 Modeling the DM halo of the Galaxy\n2\n\n25\n\nSPI effective area [cm ] at 100 keV\n160\n\nOff-center angle [deg]\n\n20\n\n140\n\n15\n\n120\n\n10\n5\n\n100\n\n0\n\n80\n\n-5\n\n60\n\n-10\n\nρNFW (r) =\n\n20\n\n-20\n-25\n\n0\nρiso (r) =\n\n-25 -20 -15 -10 -5 0 5 10 15 20 25\nOff-center angle [deg]\n\nFigure 4. Dependence of the effective area on the off-axis position of a\n(point) source.\n\nIn the general case of extended sources, evaluation of the detector count rate (7) analytically is not possible because of the\ncomplicated dependence of the effective area on the off-axis angle\n(shown on Fig. 4). In the simplest case of an extended source with\na constant surface brightness dFDM (φ)/dΩ = fext = const, the\nintegral of Eq. (7) reduces to the multiplication by the solid angle\nΩPCFOV ≃ 0.29 and the effective area, averaged over the FoV:\nZZ\n1\nAeff, ext (Eγ ) =\ndαdβ Aeff (Eγ |α, β)\nΩPCFOV\nFoV\n\n≈ κ(Eγ )Aeff, on (Eγ ) .\n\n(8)\n\n(11)\n\nvh2\nρ0\n1\n=\n.\n4πGN r 2 + rc2\n1 + (r/rc )2\n\n(12)\n\nThe following parameters of isothermal profile reproduce the DM\ncontribution to the (outer parts of) Galaxy rotation curve vh =\n170 km/sec and rc = 4 kpc (Boyarsky et al. 2006c, 2007) (i.e.\ni2 h\ni2\nh\nvh\n4 kpc\nkeV\nρ0 = 1.2 × 106 cm\n). These parameters are\n3 170 km/s\nrc\nconsistent with those, from favored NFW models of Klypin et al.\n(2002); Battaglia et al. (2005), i.e. for φ > 90◦ the difference between isothermal model and NFW with preferred parameters was\ncompletely negligible (less than 5%) – c.f. FIG.5. Both types of\nmodels provide the local DM density at the position of the Sun to\nbe ρDM (r⊙ ) ≃ 0.22 GeV/cm3 , which is close to the existing estimates (Kuijken & Gilmore 1989c,a,b, 1991; Gilmore et al. 1989).\nThe DM flux from a given direction φ, measured by an observer on Earth (distance r⊙ ≃ 8.5 kpc from the GC), is given\nby\n8\n\"\n\"\n< π + arctan r⊙ cos φ , cos φ > 0\nρ0 rc2\n2\nR\n\"\n\"\nSiso (φ) =\n×\n,\nR\n: arctan\nR\n,\ncos φ < 0\nr⊙ | cos φ|\n\n(13)\n\nThe numerical factor κ(Eγ ) depends on the energy and has to be\ncalculated via a numerical integration over the energy dependent\noff-axis response map of the SPI detector. A reasonably accurate\nnumerical approximation to κ(Eγ ) is given by\nκ(E) ≈ 0.165(E/ keV)0.11 .\n\nρs rs3\n,\nr(r + rs )2\n\nwith parameters, given in Table 1.The relation between virial parameters and ρs , rs can easily be found (see e.g. the Appendix A\nof Boyarsky et al. 2007).\nTo explore the uncertainty of the DM density profile in the\ninner part of the Galaxy, we also describe the DM distribution in\nthe MW via an isothermal profile (Bahcall & Soneira 1980):\n\n40\n\n-15\n\nThe DM halo of the Galaxy has been extensively studied (see e.g.\nKravtsov et al. 1998; Klypin et al. 2002; Battaglia et al. 2005). Various DM profiles, used to fit observed velocity distributions, differ\nthe most in the GC region.\nIt was shown in Klypin et al. (2002); Battaglia et al. (2005)\nthat the DM halo of the MW can be described by the NavarroFrenk-White (NFW) profile (Navarro et al. 1997)\n\n(9)\n\nOne can see that κ ≪ 1 in all the energy interval. This is explained\nby the fact that the detector area visible from a given direction on\nthe sky strongly decreases with the increase of the off-axis angle\nof this direction, so that the sky-averaged effective area is much\nsmaller than the on-axis effective area of the detector. Substituting\n(9), (8) into (7) one finds that for an extended source of constant\nsurface brightness the detector count rate is\n–\n»\ncts 1 keV\nRext = 2.73 × 10−5\n(10)\ns\nEγ\n»\n–»\n–\nAeff, ext (Eγ )\n(dFDM /dΩ)ext\n×\n150 cm2\n10−15 erg/(cm2 s sr)\n\nq\n\n2\nwhere R = rc2 + r⊙\nsin2 φ and ρ0 rc ≃ 1.5 × 1028 keV/ cm2 .\nThe uncertainty of the DM radial density profile in the inner\nGalaxy stems from the difficulty of separation between visible and\nDM contributions to the inner Galaxy rotation curve.6 In order to\nget the most conservative limit on the column density of the DM in\nthe direction of the GC, one can assume the following \"rigid lower\nbound\": while the DM outside the r⊙ is described by the \"maximal\ndisk\" model (model A2 of Klypin et al. 2002), for r 6 r⊙ DM\ndensity remains constant (so that the total DM mass within r⊙ is\nthe same as in the model A2 of Klypin et al. 2002). This gives\n6\nρmin\nDM ≃ 3.9 × 10\n\n(14)\n\nThe surface brightness profile on the \"constant density\" model\nis shown in black dashed line on the Fig.5. One can see that\nthe difference between the maximal (φ = 0◦ ) and the minimal\nφ = 180◦ ) column densities is ∼ 3.4 (as compared to ∼ 6 for\n6\n\ndependent on-axis effective areas of each of the 17 operating detectors of\nSPI, extracted from the instrument's characteristics files.\n\nM⊙\nkeV\n.\n= 0.146 × 106\ncm3\nkpc3\n\nWhen quoting results of Klypin et al. (2002), we do not take the effects\nof baryon compression on DM into account. While these effects make DM\ndistribution in the core of the MW denser, any such computation is strongly\nmodel dependent.\n\n\f6\n\nA. Boyarsky et al.\n\nTable 1. Best-fit parameters of NFW model of the MW DM halo. Max. disk model maximizes amount of baryonic matter in the inner 3 kpc of the MW halo\n(MDM /(Mdisk + Mbulge ) = 0.4 for the model A2 and MDM /(Mdisk + Mbulge ) = 0.14 in the model B2 ).\nReferences\nKlypin et al. (2002), favored models (A1 or B1 )\nKlypin et al. (2002), Max. disk models A2\nKlypin et al. (2002), Max. disk models B2\nBattaglia et al. (2005)\n\nMvir [M⊙ ]\n1.0 × 1012\n0.71 × 1012\n0.71 × 1012\n12\n0.8+1.2\n−0.2 × 10\n\nrvir [kpc]\n258\n230\n230\n255\n\nConcentration\n12\n5\n10\n18\n\nrs [kpc]\n21.5\n46\n23\n14.2\n\nρs [M⊙ /kpc3 ]\n4.9 × 106\n0.6 × 106\n3.1 × 106\n11.2 × 106\n\nThe lower bound on the DM decay line rate in SPI pointings toward\nthe inner Galaxy is calculated by substituting the column density\nS = 1028 keV/ cm2 (see Fig. 5) into Eqs. (10), (16)\n»\n–4\n–» 2 –»\ncts\nMDM\nSDM (φ)\nsin 2θ\nFmin ≃ 3.0 × 10−6\ncm2 s 1028 keV/cm2\n10−10\n1 keV\n(17)\nThe approximation of the constant surface brightness works well,\nif the extended source has a core of the angular diameter exceeding\nthe size of the SPI partially coded FoV (ΘPCFOV ≈ 17◦ maximal\noff-axis angle). Taking isothermal profile the angular size of the flat\ncore of the extended source is\nφcore = arctan(rc /r⊙ ) ≃ 25◦ ,\n\n(18)\n\nwhich satisfies this constraint.\n\n3 STRATEGY OF SEARCH FOR THE DM DECAY LINE\nWITH SPI\n\nFigure 5. Expected column density for various DM profiles: favored NFW\nprofile (red thick solid line); NFW profile with the maximal disk (model\nA2 , see Table 1) – blue solid line; cored (isothermal) profile – green thick\ndashed line; constant density within r⊙ – black dashed line).\n\nisothermal model). For comparison we show on Fig. 5 expected\nDM flux (6) for various profiles. The minimal column density is\nof course the one in the direction of anti-center: S(φ = 180◦ ) ≃\n0.33 × 1028 keV/ cm2 . We see that even for the minimal profile\nS(φ < 30◦ ) > 1028 keV/ cm2 .\n2.2 DM decay line count rate\nIn the case of the Majorana sterile neutrinos of mass MDM the\nDM decay width is given by (Pal & Wolfenstein 1982; Barger et al.\n1995):7\n» 2 –»\n–5\nsin 2θ\nMDM\nΓDM ≃ 1.3 × 10−32\ns−1 .\n(15)\n10−10\n1 keV\nSubstituting (15) to (6) we find\ndFDM\n(φ)\ndΩ\n\n≃\n\n8.3 × 10−15 erg/(cm2 s sr)\n(16)\n×\n\n»\n\nsin2 2θ\n10−10\n\n–»\n\nMDM\n1 keV\n\n–5 »\n\nSDM (φ)\n1028 keV/cm2\n\n–\n\n7 The quoted value of Γ\nDM is for the Majorana sterile neutrino. In case of\nDirac particle this value is 2 times smaller (c.f. Pal & Wolfenstein 1982;\nBarger et al. 1995).\n\nThe MW halo contribution to the DM decay signal represents the\nall-sky source. Indeed, as the results of Section 2.1 show, the variability of the signal over the sky may be as low as the factor ∼ 3.\nThis makes the strategy of search of the DM decay signal different\nfrom any other types of astrophysical sources: the point sources,\ndiffuse sources (e.g. ∼ 10◦ Gaussian profile for e+ e− annihilation\nregion, Knödlseder et al. (2005)) or even the search for DM annihilation signal (see e.g. Tasitsiomi et al. 2004; Boehm et al. 2004;\nDiemand et al. 2007; Sánchez-Conde et al. 2006; Carr et al. 2006).\nThe problem gets exacerbated by the fact that during its motion, SPI is irradiated by the charged high-energy particles (particles from Earth radiation belt, Solar wind, cosmic TeV photons). As\na result, the materials (even detectors themselves) used for SPI construction start to radiate in different energy regions (see subsection\n3.2). As a result any SPI spectrum consists of a broad continuum,\nwhich is a combination of the sky and instrumental backgrounds,\nand of a set of the instrumental background lines (Attié et al. 2003;\nDiehl et al. 2003; Jean et al. 2003; Weidenspointner et al. 2003). In\norder to detect a spectral line produced by an astrophysical source\none has to be able to (a) separate the continuum and line contributions to the spectrum and (b) separate the instrumental and sky\nsignal contributions to the lines found.\nOne can expect three a priori situations:\n(I) DM decay line is strong (its equivalent width much larger\nthan the spectral resolution) and at its position there are no\nother strong lines (of either instrumental or astrophysical origin). Such a line, due to its presence in any SPI spectrum and\nits low variability over the sky can in principle be confused\nwith some unknown instrumental line.\n(II) DM line is weak (∼ 3 − 4σ detection over the continuum)\nbut its position also does not coincide with any instrumental\nline.\n\n\fConstraining DM properties with SPI\n(III) DM decay line coincides with some instrumental line. To\nbe able find such a line we need to model SPI instrumental\nbackground.\nTo be able to work effectively with all these situations, we need to\nfind the way to separate the source and background contributions.\n\n7\n\ninformation. There exist various \"background tracers\" (Ge detectors saturation rates, anti-coincidence shield rates, rates of certain\nbackground lines, see Jean et al. (2003); Teegarden et al. (2004);\nTeegarden & Watanabe (2006) and refs. therein).\n\n3.3 Searching for the lines\n3.1 Imaging\nTo distinguish source and background contribution to the signal,\none often uses imaging capabilities of an instrument. If the size\nof a point or even an extended source on the sky is smaller than\nthe size of the SPI FoV one can (at least, to some extent) use\nthe imaging capabilities of the SPI instrument. In this case the\ncoded mask, placed above the detector, partially screens the individual detectors from the source, so that the source at a given\nposition on the sky produces different count rates in different detectors. One can find the source flux by comparing the ratios of\nthe actual count rates in different modules of the detector to the\nones predicted by the degree of screening of the modules by the\nmask (see Dubath et al. 2005; Skinner & Connell 2003). It is a\nchallenge, however, to use the imaging capabilities of the SPI to\nseparate the astrophysical signal from the instrumental background\nif the size of the extended source is comparable to the size of the\nSPI FoV (see e.g. Knödlseder et al. 2005; Allain & Roques 2006;\nWeidenspointner et al. 2007, and refs. therein). Therefore for our\nanalysis we did not use any imaging capabilities of SPI, and to produce spectra from some point in the sky we just collected all the\nphotons, arriving in the SPI FoV.\n\n3.2 SPI background modeling\nIn the absence of imaging, the separation of the instrumental and\nastrophysical contributions to the line spectrum requires some sort\nof background modeling (see e.g. Weidenspointner et al. 2003;\nTeegarden et al. 2004; Teegarden & Watanabe 2006). Namely, for\nthe background modeling we can use the fact that for any DM distribution model the intensity of the DM decay line changes by a factor > 3 between the pointings towards the Galactic center (φ ∼ 0◦ )\nand anti-center (φ ∼ 180◦ , see Sec.2.1). On the other hand, if the\nline is of purely instrumental origin, there is no a-priori reason why\nthe strength of the line in the background spectra of the pointings\ntowards e.g. the Galactic Anti-center should be different from the\nstrength of the line in the spectra of the pointings toward e.g the\nGC. Thus, one possible way to distinguish between the DM decay\nand instrumental origin of the line is to study the variations of the\nline's strength depending on its sky position (in the simplest case –\non the \"off-GC\" angle φ, of the pointing, Eq. (5)).\nThe situation becomes more complicated due to the fact that\nthe instrumental background (and thus the intensity of the instrumental lines) experiences great variability in time (depending on the position in orbit, solar flares and the solar activity\nperiod, degradation of the detectors, etc., c.f. Jean et al. 2003;\nTeegarden et al. 2004). As observations of different parts of the\nsky can be significantly separated in time, one needs to use \"background tracers\" to find the correct spatial dependence of the line\nintensity (Jean et al. 2003; Teegarden & Watanabe 2006). Without\nsome sort of \"renormalization\" procedure, which corrects the absolute value of the line flux using a measurement of a specific\ncharacteristics of the SPI instrument as a \"calibrator\" of the flux,\nthe φ dependence for any of the detected lines contains no useful\n\nTo be able to detect strong DM line, which is not close in position\nto any instrumental line (case I above), we used the modification of\nthe method of background subtraction, described in TW06. TW06\nlooked for γ-ray lines, assuming different types of sources, from\nthe point sources to the very diffuse sources (10◦ Gaussian, 30◦\nflat, etc.) TW06 showed that the strong background line at 198 keV\ncan be used as a background tracer, if background observations are\nmatched close in time to the corresponding \"source\" ones. This allowed TW06 to cancel all strong instrumental lines with the precision better than 1%. TW06 detected no emission line in such background subtracted spectrum (apart from the 511 keV and 1809 keV)\nwith the significance above 3.5σ.\nWe adopt the following modification of the TW06 method:\n– As the DM decay signal remains nearly constant within central 30−50◦ , the method of TW06, if applied directly, could cancel\nmost of the DM signal.8 We therefore subtract the data (renormalized by the strength of 198 keV line) in the direction away from the\nGC (off-GC angle φ > 120◦ ) from the ON-GC dataset (the angle\nφ 6 13◦ ).\n– In the resulting \"ON–OFF\" spectrum we perform the search\nfor the line with the significance higher than 3σ.\nThis procedure allows to eliminate strong instrumental lines\nwith the precision better than few percents. At the same time any\nstrong DM line would remain in the \"ON–OFF\" spectrum. Indeed,\neven for the flattest profile (Section 2.1), the strength of the DM\nsignal in the OFF dataset is at least 60% weaker that of the ON\ndataset. Therefore we see, that the modification, described above,\nis indeed well suited for searching of the strong DM decay line\n(case I).\nHowever, this method does not work well for the weak (3−4σ)\nlines, or for the lines, whose position coincides with some instrumental line (cases II-III above). Indeed, in this case it is not possible to tell whether the remaining line is the residual of the instrumental one or has the astrophysical origin. Below we will use\nan alternative method of analysis of the detected lines, suitable for\ncases II and III.\n\n3.4 Analyzing a candidate line\nHaving detected a number of lines with the significance of 3σ and\nabove, we should decide which of them can be considered as \"DM\ndecay line candidates\". To this end we do the following.\na) We compare line flux for each of these lines with the flux\nof the same line in the \"ON\" spectrum. We decide that the line is\na \"DM line candidate\" if the cancellation of the flux between ON\nand OFF datasets was worse than 10%.9\n8 For example for the most conservative DM distribution model, the difference of DM signals at φ = 0◦ and φ = 30◦ is mere 8%.\n9 In principle, the DM line in ON–OFF spectrum should not cancel by\nmore than ∼ 40%, while the background instrumental line should cancel\nbetter than 1%. Thus the choice of the threshold to be around 10% ensures\nthat no DM decay line was thrown away while most of the instrumental\nlines disappeared.\n\n\fA. Boyarsky et al.\n\nb) For any \"DM candidate line\" we construct its \"spatial profile\" (as described in details in the next Section) to check for the\npossibility of it to be a DM decay line (we also construct distribution of the line flux over the sky for all the unidentified lines\nfrom Weidenspointner et al. 2003). Since the column density of the\nDM in the direction toward the GC should be higher than that of in\nthe direction toward the Galactic anti-center, one should see a gradual decrease of the line strength with the increasing angle φ. We do\nnot make any specific assumption about the DM density profile and\ndo not try to fit the candidate line spatial profile to any particular\nmodel, but rather look if there is a general trend of decreasing intensity of the line with the increasing off-GC angle.\n\n0.003\nCount rate [cts/sec/keV]\n\n8\n\nON-OFF\nON spectrum × 0.01\n\n0.002\n\n0.001\n\n0\n\n-0.001\n\n50\n\n4 DATA REDUCTION\n4.1 ON dataset\nDuring its almost 5 years in orbit INTEGRAL has intensively observed the inner part of the Galaxy (Galactic Center, Galactic\nBulge and the inner part of the Galactic Plane) and collected about\nTexp ∼ 10 Ms of exposure time in the GC region. In our analysis\nof the inner Galaxy we used the publicly available data (as of July\n2007) from all INTEGRAL pointings at which the angle off the GC\nwas at most 13◦ and for which the SPI exposure time was larger\nthan 1 ksec. This criteria selects 5355 pointings (or \"Science Windows\", ScW), with total exposure time of 12.2 Ms, spread over the\nperiod from February 2003, till April, 25, 2006. We call this dataset\n\"ON\" dataset.\nFor each of the analyzed ScWs, we have extracted photon\n(event) lists from spi-oper.fits files and applied additional\nenergy correction to convert the channel number into photon energy, using spi gain cor tool from standard Offline Analysis\nSoftware (OSA). We have binned the events into narrow energy\nbins of the size ∆Ebin = 0.5 keV to generate the background\ncounts spectra in each ScW, each revolution and, subsequently, in\nthe entire data set.\nWe then applied the \"sliding spectral window\" method to the\nline search (as described e.g. in TW06 to produce a continuum subtracted spectrum of the \"ON\" dataset. Namely, at each given energy\nE0 , one defines an energy interval E0 − 2∆E < E < E0 + 2∆E,\nwhere ∆E is the SPI spectral resolution at a given energy, as a\n\"line signal\" energy band. For the (energy dependent) ∆E we used\napproximate formula from SPI/INTEGRAL ground calibration of\nFWHM (Attié et al. 2003):\n√\n∆E(E) = F1 + F2 E + F3 E\n(19)\n−3\n\n−4\n\nwhere F1 = 1.54, F2 = 4.6 * 10 , F3 = 6.0 * 10 and energy\nE is in keV. For E = 103 keV FWHM ≈ 2.3 keV.\nFor each energy bin centered at an energy E0 we have defined\nthe two adjacent energy intervals, E0 − 4∆E < E < E0 − 2∆E\nand E0 + 2∆E < E < E0 + 4∆E, and postulated that the sum of\nthe count rates in these two adjacent energy bands gives the measure of the continuum count rate in the energy band around E0 .\nSubtracting the sum of the count rates in the adjacent energy bands\nfrom the count rate in the \"line signal\" energy band, we have calculated the continuum subtracted count rate at a given energy E0 .\nDoing such procedure at all the energies 20 keV < E0 < 8 MeV,\nwe have produced a \"continuum subtracted\" SPI background spectrum.In this spectrum we were able to identify most of the known\ninstrumental lines (Weidenspointner et al. 2003).\n\n100\n\n150\nE [keV]\n\n200\n\n250\n\nFigure 6. Comparison of ON–OFF spectrum (thick solid line) with the\n0.01 × the ON spectrum after the sliding window (thin dashed line). It\ncan be seen that the instrumental lines are subtracted with the precision better than 1%.\n\n4.2 ON–OFF dataset\nMost of the lines found in the continuum subtracted background\nspectrum are of the instrumental origin. To remove them, we\nmatched each ScW in the ON dataset with the pointing away from\nthe GC (galactic coordinate φ > 120◦ ) – OFF pointing. As described by TW06, the 198 keV line can serve as good background\ntracer if the time duration between ON and OFF observations is\n6 20 days. We were able to match 3688 ON-OFF pairs. For\neach ON–OFF pair we introduced normalizing coefficient n for the\nOFF spectrum in such a way that the strong instrumental line at\n198 keV cancels completely after subtraction of the OFF spectrum\nmultiplied by the factor n from the ON spectrum. After that we\nsubtracted (renormalized) OFF ScW from the corresponding ScW\nfrom the ON dataset. This allowed us to remove most prominent\ninstrumental lines with the precision better than 1% (c.f. Fig. 6).\nTo avoid contributions of strong astrophysical sources (such as\ne.g. Crab) we threw out all pairs with negative total flux at 20–\n40 keV range after subtraction. Taking average over 2456 remaining \"good\" pairs we received the spectrum almost free from background at energies above 200 keV. At low (< 200keV) energies we\nfound continuum component, which can be fitted with the simple\npower law:\n»\n–α\nE\nF (E) = F0\n(20)\n100 keV\nParameters of this background were found to be\nF0 = (4.95 ± 0.05) × 10−5 cts/s/cm2\nα = −(2.264 ± 0.003)\n\n(21)\n\nThis continuum represents the residual contribution from all the set\nof the astrophysical sources present in the Galactic Bulge.\n4.3 Systematic error\nTo estimate the systematic error of our \"ON-minus-OFF\" dataset,\nwe computed background around the \"tracer line\" of 198 keV. We\nfound that it does not vanish. Thus, we estimated the systematic\nerror as the error in the normalization coefficient n which would\nmake the background zero within systematic uncertainty. This correction δn can be found as follows. Let n be the coefficient, needed\n\n\fConstraining DM properties with SPI\n\n2\n3\n4\n5\n6\n\nRevolutions (start-stop)\n042–092\n096–140∗\n140-205\n209-215∗\n215-277\n282-326\n330-395\n400-446\n\n180\n160\n140\n120\nφ [deg]\n\nPhase\n1\n\n9\n\nTable 2. Splitting revolutions into phases in correspondence with annealing\nphases and breakage of the detectors (revolutions, marked with the ∗ ).\n\n100\n80\n60\n40\n20\n\nto cancel flux in the 198 keV line in ON and OFF spectra:\n\n0\n\nwhere FON , FOF F – fluxes in 198keV line in ON and OFF ScWs\ncorrespondingly. The remaining non-zero δF flux in the adjacent\nto line position in ON-OFF spectrum, determines the uncertainty\nof the coefficient:\nδn =\n\nδF\nFON\n\n100\n\n200\n\n300\nRevolution\n\n400\n\n500\n\n600\n\nFigure 7. Position on the sky as a function of revolution over 6 years of\nINTEGRAL observations. The periods of annealing phases are shown in\nsolid vertical lines. Two dashed lines indicate the revolution, during which\n2ND and 17th of 19 SPI detectors have failed.\n\n(23)\n\nWe found, that average value of hδni is equal to hδni = 1.1 *\n10−3 , hni ∼ 1. So, our systematic error of final ON–OFF spectra\nat energy E is 1.1 * 10−3 FOF F (E) ≈ 1.1 * 10−3 FON . We add this\nsystematic uncertainty to the flux of ON–OFF spectrum in every\nenergy bin.\n\n4.4 Obtaining 3σ restrictions\nAt the energies at which no lines were detected (i.e. the \"continuum\nsubtracted\" count rate did not deviate by more than 3σ from zero)\nwe obtained the 3σ upper limit on the possible flux from the DM\ndecay. Above ∼ 200 keV the flux in the energy bin is zero within\nstatistical errors, therefore 3σ upper limit flux is given by statistical\nplus systematic errors. Below 200keV we put statistical restrictions\nabove power law continuum flux (20), described in the Section 4.2.\nUsing Eq. (17) one can derive the restriction on the sterile neutrino\nmixing angle, implied by this upper limit. One should also take into\naccount that the subtraction of the OFF observations led to the reduction of the expected DM signal. Taking the most conservative\n\"minimal\" model, described in Section 2.1, we see that the subtraction of the OFF signal leads to about 40% decrease of the expected\nDM signal.10 The resulting 3σ bound is shown on Fig.10.\n\n4.5 Possible DM candidates\nWhen analyzing ON–OFF spectrum, we found that almost all lines,\npresent in ON spectrum cancel with precision better than few percents. We found 21 lines (see Table 3) that did not cancel by at\nleast 90%, (including known lines at 511 keV and 1809 keV). Apart\nfrom these 2 lines all other lines are detected with low significance\n3−4σ.\nAs discussed in Sections 3.3–3.4, we took all these lines as\npossible DM candidates and analyzed the dependence of the line\nfluxes F (φ) on the off-GC angle φ of the pointing. If the DM distribution in the inner part of the Galaxy were known, it would be\n\n10\n\n0\n\n(22)\n\nTo estimate this, we took the maximal column density for OFF observations at φ = 120◦ − 17◦ .\n\n0.009\n\n0.008\nCount rate [cts/sec/keV]\n\nn = FON /FOF F\n\n0.007\n\n0.006\n\n0.005\n\n0.004\n\n0.003\n0\n\n20\n\n40\n\n60\n\n80\n100\nφ [deg]\n\n120\n\n140\n\n160\n\n180\n\nFigure 8. Scatter of the flux data points for the line at E = 1068 keV as a\nfunction of the off-GC angle.\n\npossible to distinguish between the instrumental and DM decay origin of a line by fitting F (φ) with a known profile calculated from\nthe radial DM density profile. However, the details of the radial\nDM density profile in the inner Galaxy are highly uncertain, and\nthis prevents us from directly fitting the model profile to the data.\nWe adopted a simple criterion which selects a DM decay candidate\nline: the ratio of fluxes\nR=\n\nF (0◦ )\n> Rmin ≃ 3.\nF (180◦ )\n\n(24)\n\nwhere Rmin is the ratio of the DM decay line fluxes from the GC\nand the Galactic anti-center in the \"minimal DM content\" model of\nDM distribution.\nSince the observations at different off-GC angles are done during different time periods, to properly study the dependence of the\nline flux on the off-GC angle φ one should take into account the\ntime variability of the response of the SPI detectors. Several factors have to be taken into account. First, the SPI instrument goes\nthrough a so-called \"annealing\" phase – heating of the detectors to\n\n\f10\n\nA. Boyarsky et al.\n6.1×10-2\n\n1021\n\n6.0×10-2\n\nLife-time τ [yr]\n\nLine flux [cts/sec/cm2]\n\n6.0×10-2\n\n5.9×10-2\n5.8×10-2\n\n1020\n\n1019\n\nEXCLUDED\n\n5.8×10-2\n5.8×10-2\n\n0\n\n20\n\n40\n\n60\n80\n100 120\nOff-center angle φ [deg]\n\n140\n\n160\n\n180\n\nFigure 9. Dependence of the intensity of the positron annihilation line at\nE = 511 keV on the off-GC angle. The solid line shows fit to the data in\n2\n2\nthe form const + N e−φ /(2σ ) .\n\n1018\n\n20\n\n100\n\n1000\n\n7000\n\nEγ [keV]\n\nFigure 11. Life-time of the radiatively decaying DM as a function of the\nemitted photon energy. Region below the curve is excluded.\n\n5 RESULTS\nrecover from a radiative damage.11 Next, two of the 19 SPI detector\nhave \"died\".12 The failed detectors also affect the response of their\nneighbors. To marginalize the effects of the changing response of\nthe SPI detector, we split the entire data set into 7 periods, as shown\non Fig. 7. The intervals are summarized in the Table 2. As both detector failures occurred soon after the end of an annealing phase,\nwe chose to ignore revolutions 136 through 140 and 209 through\n215. The period 096–140 does not cover the essential part of the\nsky and therefore we skip it, leaving only 6 periods.\nFor each of the periods, shown in the Table 2, we plot the distribution of the line flux as a function of the off-GC angle φ. The\nresults are summarized on Fig. 13, p. 16. One can see that none of\nthese lines exhibits clear trend of decreasing from φ = 0◦ towards\nφ = 180◦ . For each line (and each phase) we also compute the\naverage flux F̄ , standard deviation σF from the average, minimum\n(Fmin ) and maximum (Fmax ). Our analysis shows that (a) 95−100%\nof all points lie within 3σF from the average (thus, the data is consistent with having flat spatial profile) and (b) the scatter of the\ndata (Fmax − Fmin ) is much less than its mean value hF i. Therefore,\nnone of them cannot originate entirely from a DM decay. The corresponding numbers for each line and each phase are summarized\nin Table 4, page 17.\nThe positron annihilation line at E = 511 keV illustrates a\nsituation, when a line of astrophysical origin is superimposed on\ntop of the strong instrumental line. In this case, the data can be\nfitted by the constant, plus some function, depending on assumed\nshape of the source. Fig. 9 shows the dependence of the flux of the\n511 keV line on the off-GC angle of the SPI pointing. One can see\nthat for the pointings with the off-GC angle less than 20◦ (about\nthe size of the PCFOV of SPI) the 511 keV line flux contains a\ncontribution from a sky source at the position of the GC, while for\nthe pointing at larger off-GC angles the astrophysical source is not\nvisible and the only contribution comes from the instrumental line,\nwhose flux does not depend on the off-GC angle of the pointing.\n\n11\n\nFor details see SPI User Manual:\nhttp://isdc.unige.ch/Instrument/spi/doc/spi um.\n12 Detector # 2 at revolution 140 and detector #17 at revolutions 214-215.\n\nWe analyzed the spectrum of SPI and found that none of the strong\n(i.e. detected with significance above 5σ) lines can be interpreted\nas that of the decaying DM. This conclusion was based on the fact\nthat variability of these lines over the sky is less than 10% (when\nmoving from GC to the anti-center, see Fig.8). At the same time for\nany realistic DM model such a variability would be greater than at\nleast 60%. Thus, we exclude the possibility that one of the spectral\nlines, detected in the SPI background spectrum is a DM decay line.\nThe non-detection of a DM decay line in the entire energy\nrange of the SPI detector has enabled us to put an upper limit on the\nparameters of the DM particles. In particular, the 3σ upper bound\non the mixing angle of the sterile neutrino DM in the mass range\n40 keV – 7 MeV is shown on Fig. 10, p. 12.\nOur results are applicable to any decaying DM. To this end we\nalso present the restrictions on the DM life-time (with respect to the\nradiative decay) as a function of the energy of emitted photon. The\ncorresponding exclusion plot is shown on Fig. 11. For example, the\ngravitino can decay into the neutrino and photon (similarly to the\ncase of sterile neutrino) in supersymmetric theories with broken Rparity. Such an interaction is generated via the loop effects (see e.g.\nBorgani et al. 1996; Lola et al. 2007). The restrictions on Fig. 11\nimprove existing bounds on the life-time of such a gravitino DM\nby several orders of magnitude (c.f. Borgani et al. 1996).\nTo present our results in the form less dependent on a particular model of DM distribution in the MW, we show the 3σ sensitivity\ntowards the line search on Fig. 12. Note, that these results should\nbe used with care, as the sensitivity depends on the assumed spatial\nprofile of the source (because the effective area decreases with the\noff-axis angle, see discussion in Section 2). The results, presented\non Fig. 12 are valid for an extended source with the surface brightness which varies on the angular scales larger than (or comparable\nto) the size of the SPI field of view (black solid line). This plot is\nanalogous to the Fig. 9 of Teegarden & Watanabe (2006) (TW06).\nHowever, a direct comparison of the Fig. 9 of TW06 and Fig. 12 is\nnot possible, since TW06 have assumed a different morphology of\nthe extended source (10◦ Gaussian). Explicitly taking into account\nthe dependence of the effective area of the SPI detector on the offaxis angle (see Section 2), one can find that in order to make a\ndirect comparison between the two figures, one has to \"re-scale\"\nthe results of Fig. 9 of TW06 by an (energy dependent) factor of\n≈ 1.5. This factor converts the sensitivity for the line, produced by\n\n\fConstraining DM properties with SPI\nE [keV]\n68.5\n76.5\n87\n94\n134.5\n143\n177\n186.5\n193\n200\n205.5\n240\n302\n311.5\n330.5\n385.5\n404.5\n431.5\n440.5\n465\n511†\n576\n585.5\n597.5\n754\n803.5\n812\n819.5\n827.5\n836\n845\n874\n884\n913\n937†\n\nSign., σ\n11.4\n58.8\n21.2\n5.2\n15.5\n12.6\n3.9\n7.3\n24.8\n29.3\n5.4\n3.4\n3.9\n7.4\n3.2\n3.2\n5.5\n4.4\n12.4\n4.3\n52.5\n5.2\n7.2\n5.0\n4.7\n3.7\n10.6\n11.6\n7.1\n12.1\n6.5\n8.8\n10.0\n5.2\n3.1\n\n∆E [keV]\n0.65\n1.10\n0.90\n0.55\n0.90\n1.20\n0.95\n1.10\n0.75\n0.60\n0.50\n1.10\n0.70\n1.10\n0.55\n1.45\n0.95\n0.55\n0.80\n0.95\n1.25\n0.95\n1.10\n1.45\n0.85\n0.75\n0.95\n0.85\n0.75\n0.95\n1.30\n1.05\n1.05\n1.05\n0.95\n\nIdentification\n66.7 Ge complex\n75 Bi Kα\n87 Bi Kβ\n91-105 GaZn\n132-140 Ge complex\n140-147 Ge complex\n175 AsGe\n184.6 GaZn\n190-198 Ge complex\n198-215 Ge complex\n198-215 Ge complex\n238 PbBi\n301.5 GaZn\n309.8 GaZn+K\n328=? or 331=PbTl\n383=PbTl or ??\n403 Ga Zn+K\n??\n438 ZnZn\n470-485 NaNa\n511 e+ e−\n574 GeGa\n584.5 GeGa+K\n596-610 Ge complex\n751 BiBi\n803 BiPb\n810 CoFe\n817 CoFe+K\n825 PbPb\n834 MnCr\n843 MgAl\n872 GeGa\n882 GeGa+K\n911 AcTh\n?? or 935=MnCr\n\nE [keV]\n990\n947†\n1014.5\n1068.5\n1079\n1098\n1108.5\n1118.5\n1127\n1234†\n1349.5\n1368.5\n1719.5†\n1753.5\n1767.5\n1781.5\n1809†\n1904\n2212\n2225\n2322\n2583.5\n2616\n2756\n3002.5\n3176.5†\n3331†\n3802\n4307.5\n4454\n4738†\n5186.5†\n5208.5†\n5757†\n6129\n\nSign., σ\n6.0\n3.6\n11.1\n3.3\n3.3\n6.8\n19.9\n23.9\n23.5\n4.5\n3.5\n13.2\n3.3\n4.0\n11.1\n12.4\n15.2\n3.2\n6.7\n5.4\n3.1\n3.5\n5.0\n9.5\n5.1\n3.4\n3.4\n3.6\n3.6\n4.2\n3.5\n3.5\n4.0\n3.4\n20.5\n\n∆E [keV]\n0.85\n1.50\n1.40\n1.40\n1.00\n1.05\n1.05\n1.05\n0.85\n1.40\n0.80\n1.55\n1.55\n1.45\n1.40\n1.45\n1.85\n1.45\n2.20\n1.10\n1.55\n1.65\n1.90\n1.90\n2.45\n1.95\n2.05\n2.10\n3.40\n8.45\n2.30\n2.20\n1.95\n2.95\n3.25\n\n11\n\nIdentification\n987 PbPb\n??\n1014 MgAl\n?? or 1063=PbPb\n1077=GaZn\n1095=?\n1106 GeGa\n1117 GeGa+K\n1124.5 ZnCu+K\n1231 TaW\n1347 GeGa+K\n1368 NaMg\n1719 BiPb\n?? or 1758=?\n1764 BiPb\n1778 AlSi\n1808 Mg\n1901=GeGa+K or ??\n2195-2223 BiPo, Al\n2223 HD\n2319=?\n2599=? or ??\n2614 PbTl\n2754 NaMg\n2993-3013 Al\n??\n??\n3800 GaZn+K\n4304 GaZn+K\n4434 C\n??\n??\n??\n??\n6128.9 O\n\nTable 3. Lines, detected in the ON–OFF spectrum with the significance > 3σ. Lines, marked with † cancel worse than by 90% in the ON-OFF spectrum\n(as compared with their flux in ON spectrum) and thus represent a \"DM candidates\". The \"Identification\" column indicates the probable identification of\nthe line in Weidenspointner et al. (2003). Lines, marked with \"?\" are not identified in Weidenspointner et al. (2003), lines marked with \"??\" are not present\nin Weidenspointner et al. (2003).\n\na source with the Gaussian surface brightness profile, into the one\nproduced by a source of approximately constant surface brightness\n(see red curve in Fig. 12).\n\nWe have found a number of weak (with the significance\n3−4σ) lines in the background-subtracted spectrum of SPI. These\nlines cancel by worse than 90% when subtracting OFF dataset\n(see Section 4). Apart from it we have found in the backgroundsubtracted spectrum two lines with high significance – known lines\nat 511 keV and at 1809 keV. Any of these lines can in principle be\na DM decay line. We analyzed each of them, by considering the\nprofile of their intensity over the sky. Our analysis shows that none\nof these lines could be pure DM line (as their dependence on the\noff-GC angle does not show any clear trend to decrease towards the\nanti-center). The possibility that some of these lines are the superposition of instrumental and DM lines remains open. Quantitative\nanalysis of the amount of DM flux admissible in a given line depends strongly on the model of the DM distribution in the Milky\nWay halo. Therefore it was not conducted here.\n\n6 DISCUSSION\nThe purpose of this work was to understand how to search for the\nDM decay line with the SPI spectrometer and to check that none of\nthe strong lines, present in the SPI background, was confused with\nthe DM decay line. Our analysis shows that all the strong lines\nwere, indeed, of instrumental origin and provides the upper bound\non the flux of \"weak\" (3−4σ above the background) lines, which\nleads to the corresponding restrictions (see Sec. 5). To further improve the results, one needs to work with the weak lines (or lines,\ncoinciding in position with instrumental ones). To do this one needs\nmore sophisticated procedures of subtraction of the instrumental\nbackground (e.g. imaging).\nOne of the most interesting cases of the coinciding instrumental and celestial line is the positronium annihilation line at\n511 keV. An excess of positron annihilation emission on top of\nthe strong instrumental line (related to positrons annihilating inside\nthe detector) was noticed long ago (for an incomplete set of references see e.g. Prantzos 1993; Milne et al. 1999; Cheng et al. 1997;\nPurcell et al. 1997; Knödlseder et al. 2005; Weidenspointner et al.\n2006, 2007). There exist many attempts of explanation of this excess. In particular, it was attributed to the annihilating or decaying\nDM (see e.g. Boehm et al. 2004; Hooper et al. 2004; Boehm et al.\n\n\f12\n\nA. Boyarsky et al.\n\n10-12\n\nOur restrictions\nHEAO-1 exclusions.\nRestrictions on Majorana DM\nbased on Yuksel et al. (2007)\n\n10-14\n\nsin2(2θ)\n\n10-16\n10-18\n10-20\n10-22\n10-24\n10-26\n\n102\n\n103\nmDM [keV]\n\n104\n\nFigure 10. Upper bound on the mixing angle of the DM sterile neutrino as a function of the sterile neutrino mass, obtained from the analysis of the background\nspectrum of the pointings toward the inner 13◦ of the Galaxy. For masses 6 700 keV the restrictions from Yüksel et al. (2008) (divided by the factor 2, due to\nthe Majorana nature of the DM) are also shown in dashed line (see Discussion). For masses < 100 keV previous restrictions from HEAO-1 (Boyarsky et al.\n2006c) are also shown. The region above the curve is excluded.\n\n10-2\n\nsesses decay channel Ns → e+ e− ν, with positrons annihilating\neither in flight or at rest, by forming the positronium atom (see e.g.\nBeacom & Yüksel 2006; Sizun et al. 2006). Thus, it is possible that\nthe decay of sterile neutrino DM contributes to such a line. The detailed analysis of this case will be reported separately.\n\nFlat source\nTW06, rescaled for the flat source\n\nLine flux [cts/cm2/sec]\n\n10-3\n\nIt should be also mentioned, that the region of masses between\n20 keV . mDM . 40 keV remains inaccessible for the existing\nX-ray missions. The strongest restrictions in this region were produced, using the data of HEAO-1 mission (Boyarsky et al. 2006c).\n\n10-4\n\n10-5\n\n10-6\n\n20\n\n100\n\n1000\n\n7000\n\nE [keV]\n\nFigure 12. 3σ sensitivity towards the line search in case of the flat diffuse source (thick black line). The results of Teegarden & Watanabe (2006,\nFig. 9), (rescaled to account for sensitivity towards the flat diffuse source,\nrather than 10◦ Gaussian) are shown in thin red line.\n\n2006; Frère et al. 2007; Picciotto & Pospelov 2005; Rasera et al.\n2006). The sterile neutrino DM with the mass ms > 1 MeV pos-\n\nWhen the work on this paper was at its final stage, the work\nof Y07 was published. Y07 obtained the restrictions on parameters\nof sterile neutrino in the range 40 keV – 700 keV. To facilitate the\ncomparison, we plot the restrictions of Y07 on Fig. 10, (divided by\nthe factor of 2 to translate them into the restrictions for the Majorana, rather than Dirac sterile neutrino DM, see footnote 7, p 6). As\nthe data, used in our work, has about 5 times longer exposure than\nthe INTEGRAL first years data, on which the results of Y07 are\nbased, we could have expected results stronger by a factor ≈ 2 in\nour case. However, the Fig. 10 shows the opposite. The reason for\nthis is as follows. For the SPI, the sensitivity towards the line search\nfrom a particular source depends on the shape of the source. In particular, the results of TW06, on which the work of Y07 was based,\nwere obtained under the assumption of a particular diffuse source\n\n\fConstraining DM properties with SPI\n(10◦ Gaussian). As any realistic DM profile is much flatter than the\n10◦ Gaussian, the results of TW06 cannot be applied directly for\nthe case of the DM line search. They should be rescaled to account\nfor the diffuse nature of the DM source (c.f. Section 5). Apart from\nthis, the estimated DM signal from the inner part of the Galaxy is\nabout 2 times stronger in Y07 than in our work. As the DM signal\nin the direction of the GC is the most uncertain, we have adopted\nthe conservative flat profile everywhere inside the solar radius, to\nminimize this uncertainty.\nAcknowledgments\nWe would like to thank B. Teegarden and K. Watanabe for useful\ndiscussion. D.M. is grateful to the Scientific and Educational Center13 of the Bogolyubov Institute for Theoretical Physics in Kiev,\nUkraine, and especially to V. Shadura, for creating wonderful atmosphere for young Ukrainian scientists, and to Ukrainian Virtual\nRoentgen and Gamma-Ray Observatory VIRGO.UA14 and computing cluster of Bogolyubov Institute for Theoretical Physics15 ,\nfor using their computing resources. The work of D.M. was supported by the Swiss National Science Foundation and the Swiss\nAgency for Development and Cooperation in the framework of the\nprogramme SCOPES - Scientific co-operation between Eastern Europe and Switzerland. The work of A.B. was (partially) supported\nby the EU 6th Framework Marie Curie Research and Training network \"UniverseNet\" (MRTN- CT-2006-035863). O.R. would like\nto acknowledge support of the Swiss Science Foundation.\n\nREFERENCES\nAbazajian, K. N., Markevitch, M., Koushiappas, S. M., &\nHickox, R. C. 2007, Phys. Rev. D, 75, 063511, ADS,\narXiv:astro-ph/0611144\nAlard, C. 1999, A&A, 343, 10, ADS, arXiv:astro-ph/9808092\nAlcock, C., et al. 2000, ApJ, 541, 270, ADS\nAllain, M., & Roques, J.-P. 2006, A&A, 447, 1175, ADS\nAsaka, T., Laine, M., & Shaposhnikov, M. 2007, JHEP, 01, 091,\nhep-ph/0612182\nAsaka, T., & Shaposhnikov, M. 2005, Phys. Lett., B620, 17,\nhep-ph/0505013\nAttié, D. et al. 2003, A&A, 411, L71, ADS,\narXiv:astro-ph/0308504\nAvila-Reese, V., Colı́n, P., Valenzuela, O., D'Onghia, E., & Firmani, C. 2001, ApJ, 559, 516, ADS, arXiv:astro-ph/0010525\nBahcall, J. N., & Soneira, R. M. 1980, ApJS, 44, 73, ADS\nBaltz, E. A., & Murayama, H. 2003, JHEP, 5, 67, ADS,\narXiv:astro-ph/0108172\nBarger, V. D., Phillips, R. J. N., & Sarkar, S. 1995, Phys. Lett.,\nB352, 365, hep-ph/9503295\nBattaglia, G., et al. 2005, Mon. Not. Roy. Astron. Soc., 364, 433,\nastro-ph/0506102\nBeacom, J. F., & Yüksel, H. 2006, Phys. Rev. Lett., 97, 071102,\nADS, arXiv:astro-ph/0512411\nBerezhiani, Z. G., & Khlopov, M. Y. 1990, Sov. J. Nucl. Phys., 52,\n60\nBerezhiani, Z. G., Vysotsky, M. I., & Khlopov, M. Y. 1987, Sov.\nJ. Nucl. Phys., 45, 1065\n13\n14\n15\n\nhttp://sec.bitp.kiev.ua\nhttp://virgo.bitp.kiev.ua\nhttp://grid.bitp.kiev.ua\n\n13\n\nBerezhiani, Z. G., Vysotsky, M. I., Yurov, V. P., Doroshkevich,\nA. G., & Khlopov, M. Y. 1990, Sov. J. Nucl. Phys., 51, 1020\nBergstrom, L. 2000, Rept.Prog.Phys., 63, 793, hep-ph/0002126\nBertone, G., Buchmuller, W., Covi, L., & Ibarra, A. 2007,\narXiv:0709.2299 [astro-ph]\nBertone, G., Hooper, D., & Silk, J. 2005, Phys. Rept., 405, 279,\nhep-ph/0404175\nBode, P., Ostriker, J. P., & Turok, N. 2001, ApJ, 556, 93,\nastro-ph/0010389\nBoehm, C., Hooper, D., Silk, J., Casse, M., & Paul, J. 2004, Phys.\nRev. Lett., 92, 101301, astro-ph/0309686\nBoehm, C., Orloff, J., & Salati, P. 2006, Physics Letters B, 641,\n247, ADS, arXiv:astro-ph/0607437\nBond, J. R., Efstathiou, G., & Silk, J. 1980, Phys. Rev. Lett., 45,\n1980, ADS\nBond, J. R., Szalay, A. S., & Turner, M. S. 1982, Phys. Rev. Lett.,\n48, 1636, ADS\nBorgani, S., Masiero, A., & Yamaguchi, M. 1996, Phys. Lett.,\nB386, 189, hep-ph/9605222\nBoyarsky, A., den Herder, J. W., Neronov, A., & Ruchayskiy, O.\n2007, Astropart. Phys., 28, 303, ADS, astro-ph/0612219\nBoyarsky, A., Iakubovskyi, D., Ruchayskiy, O., & Savchenko, V.\n2008, MNRAS, 387, 1361\nBoyarsky, A., Neronov, A., Ruchayskiy, O., & Shaposhnikov, M.\n2006a, MNRAS, 370, 213, ADS, astro-ph/0512509\n-. 2006b, Phys. Rev. D, 74, 103506, astro-ph/0603368\nBoyarsky, A., Neronov, A., Ruchayskiy, O., Shaposhnikov,\nM., & Tkachev, I. 2006c, Phys. Rev. Lett., 97, 261302,\nastro-ph/0603660\nBoyarsky, A., Nevalainen, J., & Ruchayskiy, O. 2007, A&A, 471,\n51, ADS, astro-ph/0610961\nBoyarsky, A., Ruchayskiy, O., & Markevitch, M. 2006d, Submitted to ApJ., ADS, astro-ph/0611168\nCarr, J., Lamanna, G., & Lavalle, J. 2006, Reports of Progress in\nPhysics, 69, 2475, ADS\nCembranos, J. A. R., Feng, J. L., Rajaraman, A., Smith, B. T., &\nTakayama, F. 2006, ADS, hep-ph/0603067\nCerdeno, D. G., Choi, K.-Y., Jedamzik, K., Roszkowski, L., &\nRuiz de Austri, R. 2006, JCAP, 0606, 005, hep-ph/0509275\nCheng, L. X. et al. 1997, ApJ, 481, L43+, ADS\nChung, D. J. H., Kolb, E. W., & Riotto, A. 1999, Phys.Rev. D, 59,\n023501, hep-ph/9802238\nCrotty, P., Lesgourgues, J., & Pastor, S. 2004, Phys. Rev., D69,\n123007, hep-ph/0402049\nDalcanton, J. J., & Hogan, C. J. 2001, ApJ, 561, 35,\nastro-ph/0004381\nDar, A. 1995, ApJ, 449, 550, ADS, arXiv:astro-ph/9504082\nde Rujula, A., & Glashow, S. L. 1980, Phys. Rev. Lett., 45, 942,\nADS\nDiehl, R. et al. 2003, A&A, 411, L117, ADS\nDiemand, J., Kuhlen, M., & Madau, P. 2007, ApJ, 657, 262, ADS,\nastro-ph/0611370\nDodelson, S., & Widrow, L. M. 1994, Phys. Rev. Lett., 72, 17,\nhep-ph/9303287\nDoroshkevich, A. G., Khlopov, M. I., & Klypin, A. A. 1989, MNRAS, 239, 923, ADS\nDubath, P. et al. 2005, MNRAS, 357, 420, ADS\nDubovsky, S. L., Tinyakov, P. G., & Tkachev, I. I. 2005,\nPhys. Rev. Lett., 94, 181102, ADS, arXiv:hep-th/0411158\nFogli, G. L., Lisi, E., Marrone, A., Palazzo, A., & Rotunno, A. M. 2006, Prog. Part. Nucl. Phys., 57, 71, ADS,\narXiv:hep-ph/0506083\n\n\f14\n\nA. Boyarsky et al.\n\nFrère, J.-M., Ling, F.-S., Honorez, L. L., Nezri, E., Swillens,\nQ., & Vertongen, G. 2007, Phys. Rev. D, 75, 085017, ADS,\narXiv:hep-ph/0610240\nGilmore, G. 2007, ADS, astro-ph/0703370\nGilmore, G., Wilkinson, M., Kleyna, J., Koch, A., Wyn Evans, N.,\nWyse, R. F. G., & Grebel, E. K. 2006, ADS, astro-ph/0608528\nGilmore, G., Wilkinson, M., Kleyna, J., et al. 2007, Nuclear\nPhysics B Proceedings Supplements, 173, 15\nGilmore, G., Wyse, R. F. G., & Kuijken, K. 1989, ARA&A, 27,\n555, ADS\nGiunti, C. 2007, Nucl. Phys. Proc. Suppl., 169, 309,\nhep-ph/0611125\nGoerdt, T., Moore, B., Read, J. I., Stadel, J., & Zemp, M. 2006,\nMNRAS, 368, 1073, ADS, astro-ph/0601404\nGruber, D. E., Matteson, J. L., Peterson, L. E., & Jung, G. V. 1999,\nApJ, 520, 124, astro-ph/9903492\nHannestad, S., & Raffelt, G. 2004, JCAP, 0404, 008,\nhep-ph/0312154\nHansen, S. H., Lesgourgues, J., Pastor, S., & Silk, J. 2002, MNRAS, 333, 544, astro-ph/0106108\nHooper, D., Ferrer, F., Boehm, C., Silk, J., Paul, J., Evans,\nN. W., & Casse, M. 2004, Phys. Rev. Lett., 93, 161302, ADS,\narXiv:astro-ph/0311150\nHui, L., Gnedin, N. Y., & Zhang, Y. 1997, ApJ, 486, 599, ADS,\nastro-ph/9608157\nJean, P. et al. 2003, A&A, 411, L107, ADS\nKhlopov, M. Y. 1997, Cosmoparticle Physics (World Scientific\nPub Co Inc)\nKlimentowski, J., Lokas, E. L., Kazantzidis, S., Prada, F.,\nMayer, L., & Mamon, G. A. 2007, MNRAS, 378, 353, ADS,\narXiv:astro-ph/0611296\nKlypin, A., Kravtsov, A. V., Valenzuela, O., & Prada, F. 1999,\nApJ, 522, 82, ADS, arXiv:astro-ph/9901240\nKlypin, A., Zhao, H., & Somerville, R. S. 2002, ApJ, 573, 597,\nADS, astro-ph/0110390\nKnödlseder, J. et al. 2005, A&A, 441, 513, ADS,\narXiv:astro-ph/0506026\nKoposov, S. et al. 2007, ApJ, 663, 948, ADS, 0706.2687\nKravtsov, A. V., Klypin, A. A., Bullock, J. S., & Primack, J. R.\n1998, ApJ, 502, 48, ADS, arXiv:astro-ph/9708176\nKuijken, K., & Gilmore, G. 1989a, MNRAS, 239, 605, ADS\n-. 1989b, MNRAS, 239, 651, ADS\n-. 1989c, MNRAS, 239, 571, ADS\n-. 1991, ApJ, 367, L9, ADS\nKusenko, A. 2006, Phys. Rev. Lett., 97, 241301, hep-ph/0609081\nKuzmin, V. A., & Tkachev, I. I. 1998, JETP Lett., 68, 271,\nhep-ph/9802304\n-. 1999, Phys.Rept., 320, 199, hep-ph/9903542\nLasserre, T., et al. 2000, A&A, 355, L39, ADS,\narXiv:astro-ph/0002253\nLola, S., Osland, P., & Raklev, A. R. 2007, Phys. Lett., B656, 83,\narXiv:0707.2510 [hep-ph]\nMcCammon, D. et al. 2002, ApJ, 576, 188, ADS,\nastro-ph/0205012\nMilne, A. P. et al. 1999, Astrophysical Letters Communications,\n38, 441, ADS\nMoore, B. 1994, Nature, 370, 629, ADS\nMoore, B., Quinn, T., Governato, F., Stadel, J., & Lake, G. 1999,\nMNRAS, 310, 1147, ADS, astro-ph/9903164\nNavarro, J. F., Frenk, C. S., & White, S. D. M. 1997, ApJ, 490,\n493, astro-ph/9611107\nPagels, H., & Primack, J. R. 1982, Phys. Rev. Lett., 48, 223, ADS\n\nPal, P. B., & Wolfenstein, L. 1982, Phys. Rev., D25, 766\nPalazzo, A., Cumberbatch, D., Slosar, A., & Silk, J. 2007,\narXiv:0707.1495 [astro-ph]\nPenarrubia, J., McConnachie, A., & Navarro, J. F. 2007, ADS,\nastro-ph/0701780\nPetraki, K., & Kusenko, A. 2007, arXiv:0711.4646 [hep-ph]\nPicciotto, C., & Pospelov, M. 2005, Physics Letters B, 605, 15,\nADS, arXiv:hep-ph/0402178\nPrantzos, N. 1993, A&AS, 97, 119, ADS\nPurcell, W. R. et al. 1997, ApJ, 491, 725, ADS\nRasera, Y., Teyssier, R., Sizun, P., Cassé, M., Fayet, P., Cordier,\nB., & Paul, J. 2006, Phys. Rev. D, 73, 103518, ADS,\narXiv:astro-ph/0507707\nRiemer-Sørensen, S., Hansen, S. H., & Pedersen, K. 2006, ApJ,\n644, L33, ADS, astro-ph/0603661\nRoszkowski, L., Ruiz de Austri, R., & Choi, K.-Y. 2005, JHEP,\n08, 080, hep-ph/0408227\nRuchayskiy, O. 2007, in Proceedings of the 11th Marcel Grossmann Meeting on General Relativity, ed. H. Kleinert, R. Jantzen,\n& R. Ruffini (World Scientific), arXiv:0704.3215 [astro-ph]\nSánchez-Conde, M. A., Prada, F., & Łokas, E. L. 2006, in American Institute of Physics Conference Series, 125–131, ADS\nSeljak, U., Makarov, A., McDonald, P., & Trac, H. 2006, Phys.\nRev. Lett., 97, 191303, astro-ph/0602430\nShaposhnikov, M. 2007, in Proceedings of the 11th Marcel Grossmann Meeting on General Relativity, ed. H. Kleinert, R. Jantzen,\n& R. Ruffini (World Scientific), astro-ph/0703673\nShaposhnikov, M., & Tkachev, I. 2006, Phys. Lett., B639, 414,\nhep-ph/0604236\nShi, X.-d., & Fuller, G. M. 1999, Phys. Rev. Lett., 82, 2832,\nastro-ph/9810076\nSimon, J. D., & Geha, M. 2007, 706, ADS, 0706.0516\nSizun, P., Cassé, M., & Schanne, S. 2006, Phys. Rev. D, 74, 06314,\nADS, arXiv:astro-ph/0607374\nSkinner, G., & Connell, P. 2003, A&A, 411, L123, ADS,\narXiv:astro-ph/0308444\nSpergel, D. N., et al. 2007, Astrophys. J. Suppl., 170, 377,\nastro-ph/0603449\nStrigari, L. E., Bullock, J. S., Kaplinghat, M., Diemand, J.,\nKuhlen, M., & Madau, P. 2007, 704, ADS, 0704.1817\nStrumia, A., & Vissani, F. 2006, hep-ph/0606054\nTasitsiomi, A., Gaskins, J., & Olinto, A. V. 2004, Astropart. Phys.,\n21, 637, astro-ph/0307375\nTeegarden, B. J. et al. 2004, in ESA Special Publication, Vol.\n552, 5th INTEGRAL Workshop on the INTEGRAL Universe,\ned. V. Schoenfelder, G. Lichti, & C. Winkler, 819–+, ADS\nTeegarden, B. J., & Watanabe, K. 2006, ApJ, 646, 965, ADS,\narXiv:astro-ph/0604277\nTremaine, S., & Gunn, J. E. 1979, Phys. Rev. Lett., 42, 407\nVedrenne, G. et al. 2003, A&A, 411, L63, ADS\nViel, M., Becker, G. D., Bolton, J. S., Haehnelt, M. G., Rauch, M.,\n& Sargent, W. L. W. 2007, 709, ADS, 0709.0131\nViel, M., Lesgourgues, J., Haehnelt, M. G., Matarrese, S., & Riotto, A. 2005, Phys. Rev., D71, 063534, ADS, astro-ph/0501562\n-. 2006, Phys. Rev. Lett., 97, 071301, astro-ph/0605706\nWatson, C. R., Beacom, J. F., Yuksel, H., & Walker, T. P. 2006,\nPhys. Rev., D74, 033009, astro-ph/0605424\nWeidenspointner, G. et al. 2003, A&A, 411, L113, ADS\n-. 2007, ArXiv Astrophysics e-prints, ADS, astro-ph/0702621\n-. 2006, A&A, 450, 1013, ADS, arXiv:astro-ph/0601673\nYüksel, H., Beacom, J. F., & Watson, C. R. 2008, Physical Review\nLetters, 101, 121301, ADS, 0706.4084\n\n\fConstraining DM properties with SPI\nZhang, L., Chen, X., Kamionkowski, M., Si, Z., & Zheng, Z.\n2007, Phys. Rev. D, 76, 0613013(R), 0704.2444\n\n15\n\n\fA. Boyarsky et al.\n1.2×10-2\n\n2.0×10-2\n\n6.0×10-3\n4.0×10-3\n\n0.0×100\n\nLine flux [cts/sec/cm2]\n\n7.0×10-3\n\n8.0×10-3\n\n6.0×10-3\n5.0×10-3\n-3\n\n4.0×10\n\n3.0×10-3\n2.0×10-3\n\n2.0×10-3\n\n0\n\n20\n\n5.0×10-3\n\n40\n\n60\n\n80\n100\nφ [deg]\n\n120\n\n140\n\n160\n\n0.0×100\n\n180\n\n385 keV\n0\n\n20\n\n40\n\n60\n\n140\n\n160\n\n0.0×100\n\n180\n\n8.0×10-3\n\n7.0×10-3\n\n7.0×10-3\n\n6.0×10-2\n\n6.0×10-3\n\n6.0×10-3\n\n5.0×10-2\n-2\n\n4.0×10\n\n3.0×10-2\n\n5.0×10-3\n-3\n\n4.0×10\n\n3.0×10-3\n\n2.0×10-2\n\n2.0×10-3\n\n1.0×10-2\n\n1.0×10-3\n\n0\n\n20\n\n40\n\n60\n\n80\n100\nφ [deg]\n\n120\n\n140\n\n160\n\n180\n\n-3\n\n20\n\n40\n\n60\n\n80\n100\nφ [deg]\n\n140\n\n160\n\n1068 keV\n0\n\n20\n\n40\n\n60\n\n80\n100\nφ [deg]\n\n120\n\n140\n\n160\n\n180\n\n6.0×10-3\n-3\n\n4.0×10\n\n-3\n\n0\n\n20\n\n40\n\n60\n\n80\n100\nφ [deg]\n\n140\n\n160\n\n1719 keV\n0\n\n20\n\n40\n\n60\n\n80\n100\nφ [deg]\n\n140\n\n160\n\n8.0×10\n\n7.0×10-3\n\n20\n\n40\n\n60\n\n0\n\n20\n\n40\n\n60\n\n0\n\n20\n\n40\n\n60\n\n120\n\n140\n\n160\n\n180\n\n2.5×10-3\n2.0×10-3\n-3\n\n1.5×10\n\n120\n\n140\n\n160\n\n180\n\n120\n\n140\n\n160\n\n180\n\n120\n\n140\n\n160\n\n180\n\n120\n\n140\n\n160\n\n180\n\n5.0×10-3\n4.0×10-3\n3.0×10-3\n2.0×10-3\n1.0×10-3\n\n1753 keV\n0\n\n20\n\n40\n\n60\n\n80\n100\nφ [deg]\n\n120\n\n140\n\n160\n\n0.0×100\n\n180\n\n-3\n\n4.5×10\n\n4.5×10-3\n\n4.0×10\n\n-3\n\n-3\n\nLine flux [cts/sec/cm2]\n\nLine flux [cts/sec/cm2]\n\n-3\n\n3.5×10\n\n3.5×10\n\n-3\n\n3.0×10\n\n2.5×10-3\n2.0×10-3\n-3\n\n1.5×10\n\n40\n\n60\n\n80\n\n100\n\n-4\n\n140\n\n160\n\n0.0×100\n\n180\n\n0\n\n20\n\n40\n\n60\n\nφ [deg]\n3.5×10-3\n\n3.0×10-3\n\n3.0×10-3\n\n2.0×10-3\n-3\n\n1.0×10-3\n\n40\n\n60\n\n80\n100\nφ [deg]\n\n-3\n\n1.5×10\n\n100\n\n-4\n\n120\n\n140\n\n160\n\n0.0×100\n\n180\n\n2583 keV\n\n2.5×10-3\n\n-3\n\n2.0×10-3\n-3\n\n1.5×10\n\n1.0×10-3\n\n140\n\n160\n\n180\n\n0\n\n20\n\n40\n\n60\n\n80\n100\nφ [deg]\n\n-3\n\n2.0×10\n\n-3\n\n1.5×10\n\n1.0×10-3\n5.0×10-4\n\n3331 keV\n\n5.0×10\n\n120\n\n100\n\nφ [deg]\n\n2.5×10\n\n0.0×100\n\n80\n\n3.0×10-3\n\n-4\n\n3176 keV\n\n20\n\n80\n\nLine flux [cts/sec/cm2]\n\nLine flux [cts/sec/cm2]\n\n-3\n\n0\n\n2.0×10-3\n\nφ [deg]\n\n3.5×10-3\n\n-4\n\n-3\n\n2.5×10\n\n5.0×10\n\n2322 keV\n\n5.0×10\n120\n\n3.0×10-3\n\n1.0×10-3\n\n-3\n\n1.0×10\n\n20\n\n80\n100\nφ [deg]\n\n-3\n\n5.0×10\n\n-3\n\n0\n\n80\n100\nφ [deg]\n\n6.0×10-3\n\n3.0×10-3\n\n4.0×10\n\n0.0×100\n\n0\n\n80\n100\nφ [deg]\n\n3.0×10-3\n\n4.0×10-3\n\n0.0×10\n\n180\n\n1904 keV\n\n5.0×10\n\n60\n\n1809 keV\n120\n\n3.0×10-3\n\n1.5×10\n\n40\n\n4.0×10-3\n\n4.5×10\n\n0\n\n4.0×10-3\n\n2.5×10\n\n20\n\n-3\n\n5.0×10-4\n\n0\n\n0.0×100\n\n0\n\n5.0×10-3\n\n0.0×100\n\n180\n\n1.0×10\n\n1.0×10-3\n\n1.0×10\n\n3.0×10-3\n\n1234 keV\n120\n\n-3\n\n-3\n\n4.0×10-3\n\n1.0×10-3\n1098 keV\n\nLine flux [cts/sec/cm2]\n\nLine flux [cts/sec/cm2]\n\n3.0×10-3\n\n-3\n\n180\n\n7.0×10-3\n\n3.5×10-3\n\n4.0×10-3\n\n2.0×10\n\n160\n\n8.0×10\n\n-3\n\n5.0×10-3\n\n5.0×10\n\n140\n\n-3\n\n8.0×10-3\n\n0.0×100\n\n-3\n\n-3\n\n120\n\n5.0×10-3\n\n0.0×100\n\n180\n\n2.0×10-3\n\n1.0×10-3\n\n-3\n\n80\n100\nφ [deg]\n\n2.0×10-3\n\n2.0×10-3\n\n6.0×10\n\n60\n\n947 keV\n120\n\nLine flux [cts/sec/cm2]\n\nLine flux [cts/sec/cm2]\n\n-3\n\n0.0×10\n\n40\n\n6.0×10-3\n\n4.0×10-3\n\n2.0×10\n\n0\n\n1.0×10-2\n\n5.0×10-3\n\n6.0×10\n\n20\n\n1.0×10-3\n\n1.2×10\n\n6.0×10-3\n\n0.0×100\n\n0\n\n2.0×10-3\n\n-2\n\n7.0×10-3\n\n3.0×10\n\n431 keV\n\n937 keV\n0.0×100\n\n8.0×10-3\n\nLine flux [cts/sec/cm2]\n\n120\n\n8.0×10-3\n\n9.0×10\n\nLine flux [cts/sec/cm2]\n\n80\n100\nφ [deg]\n\n7.0×10-2\n\n511 keV\n\nLine flux [cts/sec/cm2]\n\n1.0×10-2\n\n8.0×10-2\n\n0.0×100\n\nLine flux [cts/sec/cm2]\n\n1.5×10-2\n\n1.0×10-3\n330 keV\n\nLine flux [cts/sec/cm2]\n\nLine flux [cts/sec/cm2]\n\n2.5×10-2\n\n8.0×10-3\n\nLine flux [cts/sec/cm2]\n\nLine flux [cts/sec/cm2]\n\n1.0×10\n\n9.0×10-3\n\n-2\n\nLine flux [cts/sec/cm2]\n\n16\n\n120\n\n140\n\n160\n\n180\n\n0.0×100\n\n4738 keV\n\n0\n\n20\n\n40\n\n60\n\n80\n100\nφ [deg]\n\nFigure 13. Line flux as a function of the off-GC angle φ for the \"candidate\" lines from Table 3 (page 11) . For all lines the flux does not depend on the off-GC\nangle (with 95 − 100% of all points lying within 3 standard deviations from the average). Different colors represent different phases (see Table 2, p. 9).\n\n\fConstraining DM properties with SPI\n\n17\n\nE [keV]\n\nhF i\n\nσF\n\nFmin\n\nFmax\n\nFmax −Fmin\nFmin\n\nE [keV]\n\nhF i\n\nσF\n\nFmin\n\nFmax\n\nFmax −Fmin\nFmin\n\n330\n\n9.6e-03\n9.6e-03\n1.0e-02\n1.0e-02\n1.0e-02\n1.0e-02\n6.6e-03\n6.1e-03\n6.3e-03\n6.2e-03\n6.2e-03\n6.7e-03\n1.1e-02\n1.1e-02\n1.2e-02\n1.3e-02\n1.4e-02\n1.8e-02\n4.5e-02\n5.9e-02\n7.0e-02\n7.1e-02\n7.3e-02\n7.5e-02\n6.3e-03\n5.8e-03\n5.7e-03\n5.6e-03\n5.3e-03\n5.5e-03\n6.0e-03\n5.4e-03\n5.3e-03\n5.2e-03\n5.0e-03\n5.3e-03\n6.9e-03\n6.3e-03\n6.1e-03\n6.0e-03\n5.6e-03\n5.5e-03\n3.7e-03\n3.7e-03\n4.5e-03\n4.5e-03\n5.4e-03\n7.6e-03\n6.4e-03\n6.2e-03\n6.0e-03\n6.1e-03\n5.8e-03\n5.8e-03\n4.9e-03\n4.6e-03\n4.7e-03\n4.6e-03\n4.5e-03\n4.7e-03\n\n5.8e-04\n4.0e-04\n3.4e-04\n5.2e-04\n4.7e-04\n6.1e-04\n7.3e-04\n4.8e-04\n3.9e-04\n5.4e-04\n5.0e-04\n5.5e-04\n5.3e-04\n5.7e-04\n1.0e-03\n8.1e-04\n1.4e-03\n1.5e-03\n7.8e-04\n5.8e-04\n8.5e-04\n6.7e-04\n8.7e-04\n7.4e-04\n7.2e-04\n5.4e-04\n4.3e-04\n5.4e-04\n5.5e-04\n5.0e-04\n7.2e-04\n5.8e-04\n4.4e-04\n5.0e-04\n6.0e-04\n5.2e-04\n7.2e-04\n5.5e-04\n4.2e-04\n5.3e-04\n4.5e-04\n4.1e-04\n3.9e-04\n2.5e-04\n6.6e-04\n4.8e-04\n1.0e-03\n1.3e-03\n5.9e-04\n5.4e-04\n3.7e-04\n4.6e-04\n5.5e-04\n4.0e-04\n5.0e-04\n3.8e-04\n3.1e-04\n3.8e-04\n4.0e-04\n4.2e-04\n\n8.7e-03\n8.9e-03\n9.3e-03\n9.7e-03\n9.6e-03\n9.7e-03\n5.4e-03\n5.2e-03\n5.3e-03\n5.2e-03\n5.5e-03\n5.8e-03\n9.2e-03\n9.5e-03\n1.0e-02\n1.1e-02\n1.2e-02\n1.4e-02\n4.4e-02\n5.8e-02\n6.8e-02\n6.9e-02\n7.1e-02\n7.3e-02\n5.2e-03\n4.7e-03\n4.9e-03\n4.6e-03\n4.7e-03\n4.6e-03\n4.9e-03\n4.4e-03\n4.4e-03\n4.3e-03\n4.3e-03\n4.2e-03\n5.8e-03\n5.2e-03\n5.3e-03\n5.1e-03\n4.9e-03\n4.6e-03\n3.1e-03\n3.1e-03\n3.1e-03\n3.6e-03\n3.8e-03\n5.1e-03\n5.4e-03\n5.2e-03\n5.2e-03\n5.4e-03\n5.1e-03\n5.0e-03\n4.0e-03\n3.8e-03\n3.9e-03\n4.1e-03\n3.9e-03\n3.9e-03\n\n1.1e-02\n1.0e-02\n1.1e-02\n1.2e-02\n1.2e-02\n1.3e-02\n8.0e-03\n6.8e-03\n7.1e-03\n7.4e-03\n7.6e-03\n8.4e-03\n1.2e-02\n1.2e-02\n1.5e-02\n1.4e-02\n1.8e-02\n2.0e-02\n4.7e-02\n6.0e-02\n7.2e-02\n7.2e-02\n7.4e-02\n7.6e-02\n7.7e-03\n6.6e-03\n6.5e-03\n6.6e-03\n7.5e-03\n6.6e-03\n7.4e-03\n6.5e-03\n6.1e-03\n6.1e-03\n7.0e-03\n6.5e-03\n8.2e-03\n7.3e-03\n7.0e-03\n7.2e-03\n6.8e-03\n6.6e-03\n4.6e-03\n4.0e-03\n6.1e-03\n5.5e-03\n7.6e-03\n9.9e-03\n7.4e-03\n7.2e-03\n6.6e-03\n6.9e-03\n7.6e-03\n6.8e-03\n5.7e-03\n5.1e-03\n5.2e-03\n5.4e-03\n5.5e-03\n5.7e-03\n\n0.23\n0.15\n0.16\n0.23\n0.24\n0.33\n0.48\n0.31\n0.32\n0.42\n0.40\n0.44\n0.26\n0.26\n0.43\n0.32\n0.45\n0.45\n0.07\n0.04\n0.05\n0.04\n0.05\n0.03\n0.47\n0.40\n0.33\n0.44\n0.60\n0.44\n0.51\n0.49\n0.40\n0.43\n0.61\n0.55\n0.40\n0.41\n0.33\n0.41\n0.38\n0.43\n0.49\n0.30\n0.95\n0.56\n0.99\n0.94\n0.36\n0.38\n0.27\n0.27\n0.50\n0.35\n0.42\n0.35\n0.34\n0.32\n0.40\n0.46\n\n1753\n\n3.2e-03\n3.0e-03\n3.1e-03\n3.1e-03\n3.1e-03\n3.6e-03\n5.5e-03\n5.2e-03\n5.7e-03\n5.7e-03\n5.9e-03\n6.1e-03\n4.8e-03\n4.5e-03\n4.4e-03\n4.3e-03\n4.1e-03\n4.1e-03\n4.2e-03\n3.9e-03\n3.9e-03\n3.8e-03\n3.6e-03\n3.5e-03\n3.2e-03\n2.9e-03\n2.9e-03\n2.8e-03\n2.7e-03\n2.8e-03\n2.5e-03\n2.3e-03\n2.4e-03\n2.4e-03\n2.3e-03\n2.3e-03\n2.5e-03\n2.3e-03\n2.4e-03\n2.3e-03\n2.3e-03\n2.4e-03\n1.7e-03\n1.7e-03\n1.8e-03\n1.8e-03\n1.8e-03\n1.8e-03\n1.5e-03\n1.6e-03\n1.8e-03\n1.8e-03\n1.8e-03\n1.8e-03\n1.5e-03\n1.6e-03\n1.7e-03\n1.7e-03\n1.8e-03\n1.8e-03\n\n4.1e-04\n2.7e-04\n2.7e-04\n3.0e-04\n3.5e-04\n4.5e-04\n5.1e-04\n3.3e-04\n3.3e-04\n3.5e-04\n4.7e-04\n3.9e-04\n5.1e-04\n3.9e-04\n3.2e-04\n4.0e-04\n3.7e-04\n3.3e-04\n4.0e-04\n3.0e-04\n2.9e-04\n3.2e-04\n2.9e-04\n2.8e-04\n4.1e-04\n2.6e-04\n2.2e-04\n2.6e-04\n2.6e-04\n2.6e-04\n2.5e-04\n1.9e-04\n1.6e-04\n1.9e-04\n2.1e-04\n2.2e-04\n2.9e-04\n2.0e-04\n1.5e-04\n1.7e-04\n2.1e-04\n2.3e-04\n6.2e-05\n6.5e-05\n9.9e-05\n1.3e-04\n2.1e-04\n1.7e-04\n6.7e-05\n5.5e-05\n9.4e-05\n6.4e-05\n6.9e-05\n1.2e-04\n8.8e-05\n5.6e-05\n5.8e-05\n5.3e-05\n8.0e-05\n1.3e-04\n\n2.6e-03\n2.4e-03\n2.4e-03\n2.6e-03\n2.6e-03\n2.7e-03\n4.6e-03\n4.6e-03\n5.0e-03\n5.2e-03\n5.0e-03\n5.4e-03\n4.1e-03\n3.8e-03\n3.7e-03\n3.6e-03\n3.6e-03\n3.4e-03\n3.5e-03\n3.2e-03\n3.3e-03\n3.3e-03\n3.1e-03\n3.0e-03\n2.6e-03\n2.4e-03\n2.4e-03\n2.4e-03\n2.1e-03\n2.3e-03\n2.1e-03\n1.9e-03\n1.9e-03\n2.0e-03\n1.9e-03\n1.9e-03\n2.2e-03\n1.7e-03\n2.0e-03\n2.0e-03\n2.1e-03\n2.0e-03\n1.5e-03\n1.5e-03\n1.5e-03\n1.5e-03\n1.5e-03\n1.4e-03\n1.4e-03\n1.5e-03\n1.6e-03\n1.6e-03\n1.6e-03\n1.5e-03\n1.2e-03\n1.5e-03\n1.6e-03\n1.6e-03\n1.6e-03\n1.5e-03\n\n4.0e-03\n3.4e-03\n3.7e-03\n3.7e-03\n3.9e-03\n4.3e-03\n6.6e-03\n5.8e-03\n6.3e-03\n6.5e-03\n7.3e-03\n7.0e-03\n5.6e-03\n5.3e-03\n5.2e-03\n5.2e-03\n5.2e-03\n4.9e-03\n4.9e-03\n4.3e-03\n4.7e-03\n4.7e-03\n4.2e-03\n4.2e-03\n4.0e-03\n3.3e-03\n3.4e-03\n3.4e-03\n3.3e-03\n3.4e-03\n3.0e-03\n2.7e-03\n2.7e-03\n2.7e-03\n2.7e-03\n2.9e-03\n3.2e-03\n2.7e-03\n2.8e-03\n2.7e-03\n3.1e-03\n2.9e-03\n1.8e-03\n1.9e-03\n2.0e-03\n2.0e-03\n2.4e-03\n2.1e-03\n1.7e-03\n1.8e-03\n2.1e-03\n2.0e-03\n1.9e-03\n2.0e-03\n1.8e-03\n1.8e-03\n1.9e-03\n1.9e-03\n2.1e-03\n2.1e-03\n\n0.53\n0.41\n0.59\n0.43\n0.51\n0.61\n0.43\n0.28\n0.27\n0.24\n0.46\n0.30\n0.39\n0.40\n0.39\n0.44\n0.42\n0.43\n0.39\n0.34\n0.42\n0.43\n0.35\n0.42\n0.53\n0.41\n0.42\n0.44\n0.52\n0.48\n0.41\n0.40\n0.41\n0.36\n0.42\n0.54\n0.50\n0.55\n0.35\n0.33\n0.51\n0.44\n0.22\n0.24\n0.31\n0.38\n0.64\n0.46\n0.26\n0.16\n0.35\n0.24\n0.18\n0.32\n0.51\n0.21\n0.16\n0.15\n0.28\n0.39\n\n385\n\n431\n\n511\n\n937\n\n947\n\n1068\n\n1098\n\n1234\n\n1719\n\n1809\n\n1904\n\n2322\n\n2583\n\n3176\n\n3331\n\n4738\n\n5186\n\n5208\n\nTable 4. Characteristics of the spatial profiles of the candidate lines from Table 3. For each line (and for each of 6 phases) we compute the average hF i, the\nstandard deviation (average scatter of the points around its mean value) σF , minimal and maximal values and the ratio of (Fmax − Fmin )/Fmin , which gives\nthe upper bound on the share of DM, present in the given line.\n\n\f"}