{"id": "http://arxiv.org/abs/1110.4144v1", "guidislink": true, "updated": "2011-10-18T23:34:42Z", "updated_parsed": [2011, 10, 18, 23, 34, 42, 1, 291, 0], "published": "2011-10-18T23:34:42Z", "published_parsed": [2011, 10, 18, 23, 34, 42, 1, 291, 0], "title": "Zeroing in on Supersymmetric Radiation Amplitude Zeros", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.5526%2C1110.0014%2C1110.4579%2C1110.5565%2C1110.5156%2C1110.3429%2C1110.4102%2C1110.1584%2C1110.1532%2C1110.4119%2C1110.6124%2C1110.4865%2C1110.4433%2C1110.5447%2C1110.6430%2C1110.5033%2C1110.4111%2C1110.0492%2C1110.6449%2C1110.3894%2C1110.5082%2C1110.6123%2C1110.5141%2C1110.5174%2C1110.3573%2C1110.1206%2C1110.1924%2C1110.5444%2C1110.6155%2C1110.5274%2C1110.0222%2C1110.5571%2C1110.3119%2C1110.0241%2C1110.4036%2C1110.1548%2C1110.4174%2C1110.1578%2C1110.4296%2C1110.4625%2C1110.1796%2C1110.6066%2C1110.3485%2C1110.1418%2C1110.2790%2C1110.1326%2C1110.5227%2C1110.1508%2C1110.5771%2C1110.2324%2C1110.5090%2C1110.6263%2C1110.5836%2C1110.4320%2C1110.0292%2C1110.2946%2C1110.5718%2C1110.3471%2C1110.4552%2C1110.1281%2C1110.0100%2C1110.0003%2C1110.0068%2C1110.2869%2C1110.3872%2C1110.3793%2C1110.4772%2C1110.2929%2C1110.2186%2C1110.2247%2C1110.0748%2C1110.4144%2C1110.1878%2C1110.4139%2C1110.3299%2C1110.6610%2C1110.6500%2C1110.4015%2C1110.3926%2C1110.3562%2C1110.5050%2C1110.3882%2C1110.0891%2C1110.0574%2C1110.3333%2C1110.3697%2C1110.4392%2C1110.0316%2C1110.4926%2C1110.0369%2C1110.1648%2C1110.3327%2C1110.1200%2C1110.1457%2C1110.0463%2C1110.6755%2C1110.1482%2C1110.5939%2C1110.2696%2C1110.2925%2C1110.4982&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Zeroing in on Supersymmetric Radiation Amplitude Zeros"}, "summary": "Radiation amplitude zeros have long been used to test the Standard Model.\nHere, we consider the supersymmetric radiation amplitude zero in\nchargino-neutralino associated production, which can be observed at the\nluminosity upgraded LHC. Such an amplitude zero only occurs if the neutralino\nhas a large wino fraction and hence this observable can be used to determine\nthe neutralino eigenstate content. We find that this observable can be measured\nby comparing the p_T spectrum of the softest lepton in the trilepton\n$\\chi_1^\\pm \\chi_2^0$ decay channel to that of a control process such as\n$\\chi_1^+ \\chi_1^-$ or $\\chi_2^0 \\chi_2^0$. We test this technique on a\npreviously generated model sample of the 19 dimensional parameter space of the\nphenomenological MSSM, and find that it is effective in determining the wino\ncontent of the neutralino.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.5526%2C1110.0014%2C1110.4579%2C1110.5565%2C1110.5156%2C1110.3429%2C1110.4102%2C1110.1584%2C1110.1532%2C1110.4119%2C1110.6124%2C1110.4865%2C1110.4433%2C1110.5447%2C1110.6430%2C1110.5033%2C1110.4111%2C1110.0492%2C1110.6449%2C1110.3894%2C1110.5082%2C1110.6123%2C1110.5141%2C1110.5174%2C1110.3573%2C1110.1206%2C1110.1924%2C1110.5444%2C1110.6155%2C1110.5274%2C1110.0222%2C1110.5571%2C1110.3119%2C1110.0241%2C1110.4036%2C1110.1548%2C1110.4174%2C1110.1578%2C1110.4296%2C1110.4625%2C1110.1796%2C1110.6066%2C1110.3485%2C1110.1418%2C1110.2790%2C1110.1326%2C1110.5227%2C1110.1508%2C1110.5771%2C1110.2324%2C1110.5090%2C1110.6263%2C1110.5836%2C1110.4320%2C1110.0292%2C1110.2946%2C1110.5718%2C1110.3471%2C1110.4552%2C1110.1281%2C1110.0100%2C1110.0003%2C1110.0068%2C1110.2869%2C1110.3872%2C1110.3793%2C1110.4772%2C1110.2929%2C1110.2186%2C1110.2247%2C1110.0748%2C1110.4144%2C1110.1878%2C1110.4139%2C1110.3299%2C1110.6610%2C1110.6500%2C1110.4015%2C1110.3926%2C1110.3562%2C1110.5050%2C1110.3882%2C1110.0891%2C1110.0574%2C1110.3333%2C1110.3697%2C1110.4392%2C1110.0316%2C1110.4926%2C1110.0369%2C1110.1648%2C1110.3327%2C1110.1200%2C1110.1457%2C1110.0463%2C1110.6755%2C1110.1482%2C1110.5939%2C1110.2696%2C1110.2925%2C1110.4982&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Radiation amplitude zeros have long been used to test the Standard Model.\nHere, we consider the supersymmetric radiation amplitude zero in\nchargino-neutralino associated production, which can be observed at the\nluminosity upgraded LHC. Such an amplitude zero only occurs if the neutralino\nhas a large wino fraction and hence this observable can be used to determine\nthe neutralino eigenstate content. We find that this observable can be measured\nby comparing the p_T spectrum of the softest lepton in the trilepton\n$\\chi_1^\\pm \\chi_2^0$ decay channel to that of a control process such as\n$\\chi_1^+ \\chi_1^-$ or $\\chi_2^0 \\chi_2^0$. We test this technique on a\npreviously generated model sample of the 19 dimensional parameter space of the\nphenomenological MSSM, and find that it is effective in determining the wino\ncontent of the neutralino."}, "authors": ["JoAnne L. Hewett", "Ahmed Ismail", "Thomas G. Rizzo"], "author_detail": {"name": "Thomas G. Rizzo"}, "author": "Thomas G. Rizzo", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.84.115015", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1110.4144v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1110.4144v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "19 pages, 7 figures", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1110.4144v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1110.4144v1", "journal_reference": "Phys.Rev.D84:115015,2011", "doi": "10.1103/PhysRevD.84.115015", "fulltext": "arXiv:1110.4144v1 [hep-ph] 18 Oct 2011\n\nSLAC-PUB-14544\n\nZeroing in on Supersymmetric Radiation Amplitude\nZeros ∗\nJoAnne L. Hewett, Ahmed Ismail, and Thomas G. Rizzo\nSLAC National Accelerator Laboratory,\n2575 Sand Hill Rd, Menlo Park, CA 94025, USA\nAbstract\nRadiation amplitude zeros have long been used to test the Standard Model. Here,\nwe consider the supersymmetric radiation amplitude zero in chargino-neutralino associated production, which can be observed at the luminosity upgraded LHC. Such an\namplitude zero only occurs if the neutralino has a large wino fraction and hence this\nobservable can be used to determine the neutralino eigenstate content. We find that\nthis observable can be measured by comparing the pT spectrum of the softest lepton\n+ −\n0\nin the trilepton χ̃±\n1 χ̃2 decay channel to that of a control process such as χ̃1 χ̃1 or\n0\n0\nχ̃2 χ̃2 . We test this technique on a previously generated model sample of the 19 dimensional parameter space of the phenomenological MSSM, and find that it is effective in\ndetermining the wino content of the neutralino.\n\nDedicated to the memory of Ulrich Baur\n\n∗\n\nWork supported by the Department of Energy, Contract DE-AC02-76SF00515\n\n\f1\n\nIntroduction\n\nAs the first data from the Large Hadron Collider (LHC) arrive, supersymmetry remains one\nof the leading candidates for physics beyond the Standard Model (SM), providing a resolution\nfor the hierarchy problem, a mechanism for unification of the forces, as well as a natural dark\nmatter candidate. The Minimal Supersymmetric Standard Model (MSSM) is the simplest\nextension of the SM that incorporates supersymmetry, since it has the minimal number of\nadditional particles, and has been well studied for decades in the literature [1]. Nonetheless,\nthe breaking of supersymmetry, necessitated by the lack of observation of super-partners,\nintroduces ∼ 105 new parameters, even in its minimal form. Models of supersymmetry\nbreaking can reduce the size of this parameter set by assuming theoretical relations at high\nenergy scales.\nIf supersymmetry is found to describe physics at and beyond the electroweak scale,\nmuch work will be needed to extract the various parameters of the theory, particularly if no\nspecific breaking scenario such as minimal supergravity (mSUGRA) [2] is realized in nature.\nIn particular, knowledge of the eigenstate content of the electroweak gaugino sector will\nbe important to test supersymmetry and probe physics at even higher scales, as well as to\nprovide valuable information for the study of dark matter annihilation. Recently, a method\nhas been proposed to determine at the LHC the content of the lightest neutralino in the case\nthat it is the lightest supersymmetric particle (LSP) [3]. However, techniques to decipher the\nrest of the neutralino sector in a hadron collider environment remain relatively unexplored.\nSuch tests of the electroweak gaugino sector are easily performed at a high energy e+ e−\ncollider [4].\nRadiation amplitude zeros (RAZ), the vanishing of amplitudes of certain processes\nwith external photons in specific kinematic regions, have been used to test the structure of\nthe Standard Model gauge sector and search for anomalous couplings of the W boson [5–7].\nAfter the existence of such an amplitude zero was first noticed in the computation of W γ\nproduction [8], a general theory of RAZ was developed [9, 10], explaining the phenomenon\nas a result of gauge and Lorentz invariance. Discoveries of RAZ in other SM processes, as\nwell as various extensions [11], soon followed, with zeros predicted in W Z production [12],\nquark scattering with an associated photon [10], charged Higgs decay [13], leptoquark production [14, 15], and W̃ γ̃ production in exact supersymmetry [16].\nHere, we consider the potential RAZ in associated chargino-neutralino production in\nthe MSSM, and investigate how it can be used to constrain the content of the neutralino.\nWe find that an observable RAZ only occurs for a wino-like neutralino, and so the wino\ncontent of the neutralino may be probed by searching for an amplitude zero in this associated\nproduction channel. This zero is observable in the trilepton decay channel, by examining the\npT distribution of the softest lepton. As we will see below, due to the RAZ, the pT spectrum\nof the softest lepton in the trilepton final state tends to drop off faster with increasing pT\nwhen the neutralino is wino-like. By comparing chargino-neutralino production to other\n1\n\n\fsupersymmetric processes that don't exhibit a RAZ, we can place a limit on the relevant\n0\nneutralino mixing matrix elements. While we consider χ̃±\n1 χ̃2 production, our method is\nlimited only by statistics, and could in principle be used to test the wino content of the\nheavier neutralinos χ̃03 and χ̃04 if they are kinematically accessible. We assume that the χ̃01\nis the LSP throughout, and its lack of a detector signature renders our technique ineffective\nfor determining the χ̃01 wino content. By considering trilepton events at the upgraded LHC\nwith high luminosity, we demonstrate the ability to constrain the neutralino mixing matrix.\nTo evaluate the potential of our technique, we make use of a previous scan [17] over the\nphenomenological MSSM (pMSSM) parameter space and examine the signature of amplitude\nzeros in a sample of supersymmetric models. This scan resulted in ∼ 7*104 visible models, and\nhence provides an excellent testing ground for observing a supersymmetric RAZ. Approaches\nsuch as the pMSSM do not involve theoretical assumptions at the high scale, and while the\nresulting parameter space is significantly larger, results derived from this approach are more\ngeneral in scope. The pMSSM imposes only phenomenologically motivated constraints on\nthe MSSM, and has the advantage of having more predictive power than the full MSSM with\nnegligible loss of generality.\nThis paper is organized as follows. In Sections 2 and 3, we review the pMSSM and\nthe theory of RAZ. Then, we present our application of RAZ to the pMSSM to determine\nthe wino content of the neutralino in Section 4. Section 5 contains our conclusions.\n\n2\n\nThe pMSSM\n\nIn contrast to models which reduce the number of free parameters in the MSSM by making\ntheoretically motivated assumptions, e.g., universal soft supersymmetry breaking terms or\ngauge coupling unification, the pMSSM only imposes constraints that are driven by experiment. While there are more parameters in the pMSSM than in models which assume a\nspecific supersymmetry breaking mechanism, it provides a more general framework in which\nto conduct our analysis. We now briefly summarize the assumptions used in generating the\npMSSM model sample. This sample is limited to the CP conserving MSSM with Minimal\nFlavor Violation. ∆F = 2 flavor changing neutral currents limit the sfermion mass matrices\nto be essentially diagonal, with the first two generations degenerate. Also, strong constraints\non CP violation suggest that the soft breaking terms conserve CP, eliminating many complex phases that are allowed in the full MSSM. Finally, the trilinear A-term couplings for\nthe first two generations do not have significant experimental consequences, since they are\nproportional to the fermion masses, and so they are neglected. Together, these constraints\nleave only 19 free parameters in the pMSSM:\n• M1,2,3 , the gaugino masses\n• μ, the Higgs(ino) mass parameter\n2\n\n\f• tan β, the ratio of the Higgs doublet vacuum expectation values\n• mA , the mass of the CP-odd Higgs boson\n• Five sfermion masses for the first two generations\n• Five sfermion masses for the third generation\n• Ab,t,τ , the third generation trilinear couplings.\nA scan over this parameter space has been previously performed [17], where the\nparameters above were allowed to vary within the following ranges that were chosen in the\ninterest of producing observable signals at the LHC:\n\n50 GeV ≤ |M1,2 , μ| ≤1 TeV,\n100 GeV ≤ M3 ≤1 TeV,\n1 ≤ tan β ≤50,\n43.5 GeV ≤ mA ≤1 TeV,\n100 GeV ≤ mf ̃ ≤1 TeV,\n\n(1)\n\n|Ab,t,τ | ≤1 TeV.\n\nModels with tachyons, unbounded scalar potentials, or scalar potential minima that\nviolate charge or color conservation were rejected. In addition, the lightest supersymmetric\nparticle (LSP) was required to be the lightest neutralino χ̃01 and a thermal relic. After\nsampling 107 points from the parameter region above using flat priors, these models were\nsubjected to numerous experimental constraints, including ∆ρ, b → sγ, Bs → μ+ μ− , B →\nτ ν, (g−2)μ , the WMAP relic density measurement, direct dark matter detection bounds, and\ndirect collider searches for sparticles and Higgs bosons at LEP and the Tevatron. A complete\ndiscussion of the constraints applied may be found in [17]. Of the 107 sample models,\n∼ 6.8 * 104 are consistent with all of the requirements, and form the starting point for this\nstudy. The ability to observe signatures of these models has been examined previously, both\nat colliders [18] and with astrophysical experiments [19]. Here, we turn to RAZ in charginoneutralino production with decays to trileptons. Since a large fraction of this pMSSM model\nset features very small mass splittings between the χ̃±\n1 and LSP, making the lepton from the\nlightest chargino decay difficult to detect, we consider only those models where the mass\ndifference between the lightest chargino and the LSP is at least 50 GeV. In addition, we only\nuse models expected to be observable above background with 1-10 fb−1 at the LHC [18].\nFinally, we show only results for models for which the production processes in our study are\nexpected to have sufficient statistics to be detectable at an upgraded LHC with 1 ab−1 of\ndata at 14 TeV.\n3\n\n\f3\n\nProperties of Radiation Amplitude Zeros\n\nThe existence of RAZ was first discovered in the tree level calculation of ud ̄ → W + γ [8],\nwhere in the center of mass frame, the amplitude was found to vanish when the angle between\nthe incoming d ̄ and the outgoing photon satisfied cos θ∗ = 31 . The theory of amplitude zeros\nwas then developed further [9, 10], and RAZ were found to follow from the factorization of\namplitudes with external gauge bosons, specifically, the ability to factor out parts of the\namplitude that depend only on the gauge charges. The amplitude zero in W γ production\nhas now been observed experimentally, both at the Tevatron [6] and at the LHC [7].\nUsing the factorization property of these amplitudes, it was shown [10] that for a\nprocess involving n initial- and final-state particles, with charges Qi and 4-momenta (pi ),\n1 ≤ i ≤ n, as well as a photon γ with 4-momentum q, the amplitude has a radiation zero at\ntree level when\nQi\nQj\n=\n(2)\npi * q\npj * q\nfor all i, j. For a 2 → 2 scattering process f1 + f2 → X + γ, this condition comprises two\nindependent relations, with one being equivalent to charge and 4-momentum conservation.\nThe other condition for the amplitude zero may be simply written as\ncos θ∗ =\n\nQf2 − Qf1\nQf1 + Qf2\n\n(3)\n\nwhere the Qfi are the charges of the incoming particles and θ∗ is the angle between the\nincoming f1 and\n√ the outgoing photon, in the limit that all the particle masses are negligible\ncompared to s. At lower energies where mass effects become important, the position of\nthe amplitude zero in cos θ∗ shifts, and the RAZ is generally more shallow in depth.\nThe above result can be extended to processes involving the emission of other bosons.\nIn reactions with final-state gluons, the RAZ tend to get washed out after summing over\ncolor states [14]. For massive gauge bosons, the amplitudes associated with their production\nwith longitudinal polarization do not vanish, even at high energies, and so the zero is only\napproximate. In addition, the minimum of the angular distribution may shift considerably\nfrom the position of the original RAZ, due to the interference of the position of the true\namplitude zero for transversely polarized production with the angular distribution for longitudinally polarized production. For example, at high energies, the approximate amplitude\nzero in W Z associated production occurs at the position given by Eq. 3, with the electric\ncharges of the incoming quarks replaced by their left-handed couplings to the Z [12]. More\ngenerally, the expression for the scattering\n√ angle where the RAZ occurs contains an overall\nmultiplicative factor that depends on s and the W and Z masses, and approaches unity\nin the high energy limit.\nIn attempting to supersymmetrize RAZ, we first note that in exact supersymmetry,\nif a RAZ exists in a given SM process, an analogous zero will be found in its supersymmetric\n4\n\n\fcounterpart [20]. For instance, in the limit of exact supersymmetry, an amplitude zero is\nexpected in W̃ γ̃ production at cos θ∗ = 13 , where θ∗ is now the angle between the incoming\nd ̄ and the final-state photino, in the CM frame [16]. It should also be noted that RAZ have\nbeen predicted to occur in SUSY processes that have no SM analog, i.e., charged Higgs\ndecay [13]; we do not consider this possibility here.\nWe now generalize the results of [10] and [16] to investigate the positions of potential\namplitude zeros in chargino-neutralino associated production in the MSSM. For simplicity,\nlet us first consider in turn the extreme cases where the produced neutralino is a pure bino,\nwino, or Higgsino eigenstate. If the couplings of the neutralino to the uA and d ̄B quarks\nare gu and gd ̄ respectively, where A, B = L, R denote the chiralities of the quarks, then we\n0\nwould expect an amplitude zero to exist in the parton level amplitude for uA d ̄B → χ̃+\ni χ̃j at\ncos θ∗ =\n\ngd ̄ − gu\n,\ngu + gd ̄\n\n(4)\n\nin the high energy limit of negligible sparticle masses, where θ∗ is the scattering angle between\nthe u and the neutralino in the CM frame. In general, we must average over all possible\ninitial fermion chiralities. However, when the neutralino is a pure wino, only the fermions\nthat are charged under SU(2)L may participate. Since the uL and d ̄R are both in SU(2)L\ndoublets with T3 = + 12 , they have identical couplings under the weak interaction, and thus\na pure W̃ 3 neutralino yields a RAZ at cos θ∗ = 0.\nOn the other hand, when the neutralino is a bino, all initial fermion chiralities contribute to chargino-neutralino production. The bino has non-vanishing chiral couplings to\nthe quarks, and we must average over all possible quark chiralities. From Eq. 4, we see that\neach set of initial chiralities gives a different RAZ position, and when all possible chiralities\nare combined, the zero is completely washed out. Furthermore, since the uL and d ̄R belong to\nSU(2)L doublets with opposite hypercharge, the denominator of the RHS of Eq. 4 becomes\nzero for this specific set of quark chiralities.\nLastly, since light quarks have negligible couplings to the Higgs sector, there is no\namplitude zero when the neutralino is a Higgsino. It is also interesting to note that because\nof the coupling structure of supersymmetry, a Higgsino-like neutralino cannot be produced\nat tree level in association with a gaugino-like chargino, or vice versa. This structure implies\nthat the RAZ described above for chargino-neutralino production when the neutralino is\nwino-like is only observable if the chargino has appreciable wino content as well.\nThese results are summarized in Table 1. The position of the RAZ for a wino-like\nneutralino is particularly attractive, both because it remains unaffected by the masses of the\nfinal state sparticles, by analogy with W Z production, and because it predicts that the effects\nof the RAZ will be seen in the central region of the detector. As an example, in Figure 1 we\n0\nshow the CM frame angular distribution for χ̃±\n1 χ̃2 production for the Snowmass benchmark\npoint SPS4 [21] (based on mSUGRA), where the χ̃02 is almost a pure wino eigenstate, with\nevents generated using MadGraph/MadEvent 4 [22]. We see the clear appearance of the\n5\n\n\f2500\n\nEvents / Bin\n\n2000\n\n1500\n\n1000\n\n500\n\n0\n1.0\n\n\u0001\n\n0.5\n\n\u0002\u0003\n\n0.0\n\n0.5\n\n1.0\n\n0.5\n\n1.0\n\ncos\n\n(a)\n\n1400\n\n1200\n\nEvents / Bin\n\n1000\n\n800\n\n600\n\n400\n\n200\n\n\u0004\n\n0\n1.0\n\n\u0005\n\n0.5\n\n\u0006\u0007\n\n0.0\n\ncos\n\n(b)\n0\nFigure 1: The angular distribution in the center-of-mass frame for the process ud ̄ → χ̃+\n1 χ̃2 for\nthe benchmark point SPS4, where the neutralino is almost purely wino. Here, θ∗ is the angle\nbetween the quark and the neutralino. In the top panel, the energies of the incoming partons\nare taken to be 1 TeV for illustration. Note the amplitude zero at cos θ∗ = 0. Incorporating\nthe full parton distribution functions at the 14 TeV LHC, the analogous distribution is shown\nin\n√ the bottom panel. The parton-level cross section is larger near threshold, and at lower\nŝ, the zero gets shallower, but does not change position.\n\n6\n\n\fTable 1: Predictions for amplitude zeros in associated chargino-neutralino production for\nthe various weak eigenstates.\nW̃ ±\n\nH̃ ±\n\nB̃\n\nNo physical RAZ\n\nNo tree level diagrams\n\nW̃ 3\n\nRAZ at cos θ∗ = 0\n\nNo tree level diagrams\n\nH̃1,2\n\nNo tree level diagrams\n\nNo physical RAZ\n\nRAZ in the figure at the position indicated by Table 1, with a position that is independent\nof CM energy.\nSince chargino-neutralino production can only exhibit a RAZ when the neutralino\nis a wino, the presence of an amplitude zero may be used to infer the wino content of the\nneutralino. We now turn to practical methods of observing this amplitude zero.\n\n4\n\nObserving Supersymmetric RAZ at the LHC\n\nAs shown above, associated chargino-neutralino production has a radiation amplitude zero at\ncos θ∗ = 0 in the high energy limit, when the neutralino is a pure wino and the chargino has\na non-trivial wino component. We nos discuss how this may be observed at the LHC. The\nstrategy of looking at the rapidity correlations of the final state particles to see the amplitude\nzero, as proposed for W γ production in [5], cannot be applied here because the chargino and\nneutralino decays are more complicated than the decay of the W and additionally involve\nthe massive but unobservable LSP. If the neutralino is not the χ̃01 , which we have assumed to\nbe the LSP, it may decay to a pair of leptons and the LSP, either through a slepton cascade\nor a Z ∗ + LSP decay. Similarly, the chargino may decay to a lepton, neutrino, and the\nLSP. Together, these two decays yield the \"golden\" trilepton signature [23] that is known\nfor being a relatively clean signal at hadron colliders and which we consider here. There\nis, in principle, a RAZ in chargino-LSP production when the lightest neutralino is a wino.\nHowever, because the LSP is stable, chargino-LSP production does not yield a trilepton\nsignature, and there are not enough visible final state particles in this situation to observe\nthe RAZ.\n0\nThe RAZ in χ̃±\n1 χ̃2 production may be observed as follows. The leptons from the\nchargino and neutralino decays will tend to have more transverse momentum if their parent\nparticles are produced at a large angle with respect to the beam axis. If the neutralino is a\nwino, the radiation amplitude zero will lead to a deficit of events at small cos θ∗ , implying\nthat there will be fewer high-pT leptons from the decaying chargino and neutralino. We can\nthus test whether the chargino-neutralino production amplitude zero is present, i.e., whether\n\n7\n\n\fthe neutralino has a large wino content, by comparing the leptonic pT spectrum to that of\na control process that is known not to exhibit an amplitude zero. For models with a large\nwino content of the neutralinos, the lepton spectra will be softer and the effect of the RAZ\nshould tend to be more pronounced.\n0\nIn Figure 2, we show the pT distribution of the softest lepton for χ̃±\n1 χ̃2 → 3l + MET\nproduction for the SUSY benchmark point SPS4 [21]. For comparison, we also show the\n−\ncorresponding pT spectrum of the softest lepton in a control process, χ̃+\n1 χ̃1 → 2l + MET,\nwhich does not have a radiation amplitude zero. Note that χ̃02 ≈ W̃ 3 for SPS4, and so we see\nthat indeed the chargino-neutralino softest lepton pT distribution falls off significantly faster\nthan for its chargino pair production counterpart, displaying the presence of an amplitude\nzero. For all of the simulations in this analysis, events were generated for the LHC at\n14 TeV using PYTHIA 6.4 [24], with initial-state radiation, final-state radiation, multiple\ninteractions, and fragmentation turned off. Because we only consider signatures with leptons\nand missing energy in the final state, we do not expect these choices to significantly affect\nour results. Throughout, we require that leptons be observed within |η| < 2.5.\n\nFollowing a procedure similar to that presented in [25], we attempt to ascertain the\npresence of a radiation amplitude zero in chargino-neutralino production by examining the\n± 0\n−\nratio of number of χ̃+\n1 χ̃1 → 2l + MET events to that of χ̃1 χ̃2 → 3l + MET, as a function of\nthe softest lepton pT cut. This ratio is straightforward to measure experimentally, and we\nexpect it to rise significantly with the pT cut when there is an amplitude zero. Specifically,\nwe define\nR23 (pmin\nT ) = C23 *\n\n−\nN(χ̃+\n1 χ̃1 → 2l + MET)\n,\n0\nN(χ̃±\n1 χ̃2 → 3l + MET)\n\n(5)\n\nwhere C23 is a normalization factor chosen such that R23 (0.1∆) = 1, with ∆ = m(χ̃±\n1) −\n0\nm(χ̃1 ). We are interested in how R23 changes as the softest lepton pT cut is increased relative\nto the characteristic scale of the momentum of the lepton from χ̃±\n1 decay, which is roughly\n∆. Figure 3 shows this ratio for two different SPS benchmark points, for illustration. For\nSPS4, with χ̃02 ≈ W̃ 3 , as the softest lepton pT cut increases, there are comparatively fewer\nevents left from the chargino-neutralino production process exhibiting an amplitude zero,\n0\nand so the ratio rises. Conversely, the χ̃02 in SPS9 is nearly pure bino, and χ̃±\n1 χ̃2 production\ndoes not feature an amplitude zero in this scenario; and so here, we find that R23 decreases\nas the pT cut is increased. This demonstrates the promise of this approach to determine the\nwino content of neutralinos.\nIf the leptons from the neutralino decay are significantly less energetic than those from\n−\n± 0\nthe chargino decay, the softest lepton pT spectra for the χ̃+\n1 χ̃1 → 2l + MET and χ̃1 χ̃2 →\n3l+MET processes will not be directly comparable. Such a situation may arise, for instance,\n0\nif both the χ̃±\n1 and χ̃2 decay through cascades, and the characteristic momentum scales for\n0\nthe leptons from the chargino and neutralino decays are m(χ̃±\n1 ) − m(ν̃l ) ≫ m(χ̃2 ) − m(l̃). In\nthis case, we can instead compare the softest lepton pT of the processes χ̃02 χ̃02 → 4l + MET\n0\nand χ̃±\n1 χ̃2 → 3l + MET. While the four lepton signature tends to have lower statistics, since\n8\n\n\f104\n\nEvents / 5 GeV\n\n103\n\n102\n\n101\n\n100 0\n\n20\n\n40\n\npT (GeV)\n\n60\n\n80\n\n100\n\n−\n± 0\nFigure 2: The pT distribution of the softest lepton in χ̃+\n1 χ̃1 → 2l +\n√MET (red) and χ̃1 χ̃2 →\n3l + MET (blue) events for the SUSY benchmark point SPS4, at s = 14 TeV. Because of\nthe amplitude zero in the latter process, the spectrum falls off more sharply.\n\n9\n\n\f5\n\n4\n\nR\n\n23\n\n3\n\n2\n\n1\n\n0\n0.1\n\n0.2\n\n0.3\n\npT /\nmin\n\n0.4\n\n0.5\n\n0.6\n\n0.4\n\n0.5\n\n0.6\n\n∆\n\n(a)\n\n5\n\n4\n\nR\n\n43\n\n3\n\n2\n\n1\n\n0\n0.1\n\n0.2\n\n0.3\n\npT /\nmin\n\n∆\n\n(b)\n\nFigure 3: The ratios R23 (top) and R43 (bottom), of 2l + MET to 3l + MET and 4l + MET\nto 3l + MET events respectively, as a function of the lepton pT cut, for the SUSY benchmark\npoints SPS4 (blue) and SPS9 (red).\n\n10\n\n\fwe typically have m(χ̃02 ) > m(χ̃±\n1 ), it complements our first approach above. We may thus\nalso construct the additional ratio\nR43 (pmin\nT ) = C43 *\n\nN(χ̃02 χ̃02 → 4l + MET)\n0\nN(χ̃±\n1 χ̃2 → 3l + MET)\n\n(6)\n\nas a function of the lepton transverse momentum cut. As before, C43 is chosen such that\nR43 (0.1∆) = 1. Figure 3 shows R43 for the SUSY benchmark points SPS4 and SPS9, again\ndemonstrating the ability of our observables to investigate neutralino mixing.\nWe now examine these two ratios in our pMSSM model set. Many models feature\n0\nvery small χ̃±\n1 -χ̃1 mass splittings, which would render the softest lepton unobservable for\nprocesses involving leptonic chargino decays. We have thus restricted ourselves to the subset\nof models where ∆ > 50 GeV, corresponding to approximately 16% of the full model set. For\n−\n± 0\n0 0\nthis smaller set of models, we generated χ̃+\n1 χ̃1 , χ̃1 χ̃2 , and χ̃2 χ̃2 events, and constructed the\nratios R23 and R43 . When the produced gauginos/Higgsinos have small leptonic branching\nratios or are very heavy, the statistics are generally low. In our work, we have further\nrestricted ourselves to those models where the 14 TeV LHC with 1 ab−1 of data could\nacquire enough statistics to yield meaningful values for the ratios R23 and R43 through a\nminimum pT cut on the softest lepton of 0.5∆. Figures 4 and 5 show how R23 and R43\nvary with |N22 |, the magnitude of the neutralino mixing matrix element corresponding to\nthe wino content of the second neutralino. These figures show the results for approximately\n4.4 * 103 and 1.2 * 103 models, respectively. The trend in these figures is generally as expected,\nwith higher values of |N22 | corresponding to larger ratios. As we increase the softest lepton\npT cut, the overall number of events for our models drop, but the rising trend of the ratios\nR23 and R43 becomes easier to discern. Again, we have considered the values of the ratios\nat a lepton pT cut of 0.5∆ to strike a balance between statistics and clarity.\nWhile the models with low values of R23 (0.5∆) indeed have generally non-wino-like\nχ̃02 , there are outliers in the upper region of Figure 4, with R23 rising faster than expected.\nThe converse is true in Figure 5, where the region corresponding to high R43 is very clean. In\naddition to the issues related to the spectrum dependence discussed above, another reason\nfor these features is the number of unobservable leptons in our processes. There are 4 leptons\n(charged and neutral) in the final state of each reaction we have considered, but either 0, 1,\nor 2 neutrinos. The ratios R23 and R43 depend on the numbers of events from these processes\nwhich survive a pT cut on the softest charged lepton. Since this cut does not remove events\nwith low pT neutrinos, a given event with four total charged leptons and missing energy from\nthe LSP in the final state is more likely to pass such a cut tnan if one or more of the final\nstate leptons are unobservable neutrinos, as there is then more accepted phase space in the\nsparticle decays.\nFinally, Figures 6 and 7 show our 90% confidence level upper and lower limits on |N22 |\nfrom the smaller pMSSM model set employed in the previous figures as functions of R23 (0.5∆)\nand R43 (0.5∆), respectively. We see that taken together, these two measurements can provide\nmeaningful constraints. With enough integrated luminosity, measuring these ratios at the\n11\n\n\f2.5\n\n2.0\n\n1.0\n\nlog\n\nR23(0.5∆)\n\n1.5\n\n0.5\n\n0.0\n\n−0.5\n0.0\n\n0.2\n\n0.4\n\nN22\n\n|\n\n0.6\n\n0.8\n\n1.0\n\n|\n\nFigure 4: R23 (0.5∆) for all models in our set with sufficient statistics. Since R23 is normalized\nsuch that R23 (0.1∆) = 1, this measures how much R23 changes with the lepton pT cut. For\nmodels with low values of R23 (0.5∆), e.g., those below the sample red line, the second\nneutralino tends to have low wino content.\n\n12\n\n\f1.5\n\n0.5\n\nlog\n\nR43(0.5∆)\n\n1.0\n\n0.0\n\n−0.5\n0.0\n\n0.2\n\n0.4\n\nN22\n\n|\n\n0.6\n\n0.8\n\n1.0\n\n|\n\nFigure 5: R43 (0.5∆) for all models in our set with sufficient statistics. Since R43 is normalized\nsuch that R43 (0.1∆) = 1, this measures how much R43 changes with the lepton pT cut. For\nmodels with high values of R43 (0.5∆), e.g., those above the sample red line, the second\nneutralino tends to have high wino content.\n\n13\n\n\f1.0\n\n0.8\n\n|\n\nN22\n\n|\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n0.2\n\n0.3\n\n0.4\n\n0.5\n\n0.6\n\nlog\n\nR23(0.5∆)\n\n0.7\n\n0.8\n\n0.9\n\n1.0\n\nFigure 6: Upper limit on |N22 | from R23 in our pMSSM model set. The uncolored region is\nexcluded with 90% confidence. Note that because of outliers in Figure 4, the lower limit on\n|N22 | from R23 is not useful.\n\n14\n\n\f1.0\n\n0.8\n\n|\n\nN22\n\n|\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n\n−0.4\n\n−0.2\n\n0.0\n\nlog\n\nR43(0.5∆)\n\n0.2\n\n0.4\n\nFigure 7: Lower limit on |N22 | from R43 in our pMSSM model set. The uncolored region is\nexcluded with 90% confidence. Note that because of outliers in Figure 5, the upper limit on\n|N22 | from R43 is not useful.\n\n15\n\n\fLHC should provide a simple way to bound the wino content of the neutralino. Even\nmore data would enable the construction of R23 and R43 with a higher leptonic transverse\nmomentum cut pmin\nT , potentially yielding a significantly better constraint on the neutralino's\nwino content.\n\n5\n\nConclusion\n\nWe have investigated the potential of the LHC to determine the wino content of the neutralino present in supersymmetric theories through the measurement of radiation amplitude\nzeros, a feature of certain processes first discovered in the early days of the Standard Model.\nLooking at chargino-neutralino associated production is the natural extension to supersymmetry of studies of W γ and W Z production, and we expect analogous amplitude zeros if\nthe neutralino is a wino eigenstate. Even though the dramatic RAZ signature is somewhat\nmasked at a hadron collider such as the LHC, we have shown that it should still be visible\nin many cases, using an appropriate observable.\nUsing a model set derived from a scan of the 19-dimensional pMSSM parameter space,\nwe have demonstrated the ability of this approach to place bounds on the wino content of\nχ̃02 . To demonstrate, we used PYTHIA to compare the event rate for chargino-neutralino\nproduction to that of control processes which never exhibit a RAZ, as a function of the\ntransverse momentum cut on the softest lepton. We observe that the number of charginoneutralino events tends to fall off faster with increasing lepton pT cut when the neutralino is\na wino. We find that by constructing different observables, both upper and lower limits on\nthe magnitude of the neutralino mixing matrix element |N22 | may be obtained with minimal\ndependence on the exact spectrum of the theory.\nWhile we have only considered production of the second neutralino χ̃02 , our analysis\nwill also apply to the heavier neutralinos as well. In theory, similar ratios of events passing\nminimum pT cuts could be used to constrain the mixing matrix elements |N32 | and |N42 |.\nHowever, to construct these ratios, a significant sample of events would be needed. Depending on the SUSY spectrum realized by nature, particularly the masses and branching ratios\nof the heavier neutralinos, obtaining bounds on the content of heavier neutralinos may or\nmay not be beyond the scope of the LHC.\nIt should be noted that if a specific model of SUSY breaking is realized, our results\nremain relevant. Since there are fewer parameters in these scenarios, it is possible that the\nneutralino mixing matrix may be implicitly determined in the early years of the LHC, through\nthe extraction of the model parameters from other processes; for instance, see [26] in the case\nof mSUGRA. Indeed, global fits have been attempted in more general MSSM scenarios as\nwell [27], and our analysis complements these works. In such cases, we would already know\nthe mixing in the neutralino sector at some level, without having to wait for sufficiently\nlarge samples of chargino-neutralino events to perform our RAZ analysis. However, the\n16\n\n\fpredicted RAZ behavior of the various chargino-neutralino production processes could then\nbe used to verify the coupling structure of the newly discovered supersymmetric particles,\njust as studies of W γ continue to test the couplings of the W and the gauge structure of the\nStandard Model.\nRadiation amplitude zeros have provided a powerful way to probe the Standard Model\nin the past, and as the LHC is on the verge of determining the mechanism underlying\nelectroweak symmetry breaking, we have shown how an old technique can be applied to a\nnew theory. In the coming years, we expect that amplitude zeros will be very useful to\ninvestigate the structure of supersymmetry and beyond.\n\nAcknowledgements\nThe authors are grateful for discussions with S. Brodsky, J. Conley, R. Cotta, J. Gainer,\nand M.P. Le. AI was supported in part by the Natural Sciences and Engineering Research\nCouncil of Canada.\n\n17\n\n\fReferences\n[1] S. P. Martin, In *Kane, G.L. (ed.): Perspectives on supersymmetry* 1-98.\n[hep-ph/9709356]; M. Drees, R. Godbole, P. Roy, Hackensack, USA: World Scientific\n(2004) 555 p.; H. Baer, X. Tata, Cambridge, UK: Univ. Pr. (2006) 537 p.\n[2] A. H. Chamseddine, R. L. Arnowitt, P. Nath, Phys. Rev. Lett. 49, 970 (1982);\nL. E. Ibanez, Phys. Lett. B118, 73 (1982); R. Barbieri, S. Ferrara, C. A. Savoy, Phys.\nLett. B119, 343 (1982); J. R. Ellis, D. V. Nanopoulos, K. Tamvakis, Phys. Lett. B121,\n123 (1983); E. Cremmer, P. Fayet, L. Girardello, Phys. Lett. B122, 41 (1983); L. J. Hall,\nJ. D. Lykken, S. Weinberg, Phys. Rev. D27, 2359-2378 (1983); L. Alvarez-Gaume,\nJ. Polchinski, M. B. Wise, Nucl. Phys. B221, 495 (1983).\n[3] G. Kane, E. Kuflik and B. D. Nelson, [arXiv:1105.3742 [hep-ph]].\n[4] J. L. Feng, M. E. Peskin, H. Murayama, X. R. Tata, Phys. Rev. D52, 1418-1432 (1995).\n[hep-ph/9502260].\n[5] U. Baur, S. Errede, G. L. Landsberg, Phys. Rev. D50, 1917-1930 (1994).\n[hep-ph/9402282].\n[6] V. M. Abazov et al. [D0 Collaboration], Phys. Rev. Lett. 100, 241805 (2008)\n[arXiv:0803.0030 [hep-ex]].\n[7] S. Chatrchyan et al. [CMS Collaboration], [arXiv:1105.2758 [hep-ex]].\n[8] R. W. Brown, D. Sahdev, K. O. Mikaelian, Phys. Rev. D20, 1164 (1979);\nK. O. Mikaelian, M. A. Samuel, D. Sahdev, Phys. Rev. Lett. 43, 746 (1979).\n[9] D. -P. Zhu, Phys. Rev. D22, 2266 (1980); C. J. Goebel, F. Halzen, J. P. Leveille, Phys.\nRev. D23, 2682-2685 (1981); R. W. Brown, K. L. Kowalski, S. J. Brodsky, Phys. Rev.\nD28, 624 (1983).\n[10] S. J. Brodsky, R. W. Brown, Phys. Rev. Lett. 49, 966 (1982).\n[11] R. W. Brown, K. L. Kowalski, Phys. Lett. B144, 235 (1984).\n[12] U. Baur, T. Han, J. Ohnemus, Phys. Rev. Lett. 72, 3941-3944 (1994). [hep-ph/9403248].\n[13] B. Mukhopadhyaya, M. A. Samuel, J. Woodside, J. Reid, G. Tupper, Phys. Lett. B247,\n607-610 (1990).\n[14] N. G. Deshpande, X. -G. He, S. Oh, Phys. Rev. D51, 2295-2301 (1995).\n[hep-ph/9410373].\n[15] M. A. Doncheski and R. W. Robinett, Phys. Lett. B 435, 364 (1998). [hep-ph/9805328].\n18\n\n\f[16] V. D. Barger, R. W. Robinett, W. -Y. Keung, R. J. N. Phillips, Phys. Lett. B131, 372\n(1983).\n[17] C. F. Berger, J. S. Gainer, J. L. Hewett, T. G. Rizzo, JHEP 0902, 023 (2009).\n[arXiv:0812.0980 [hep-ph]].\n[18]\n[18] J. A. Conley, J. S. Gainer, J. L. Hewett, M. P. Le, T. G. Rizzo, Eur. Phys. J. C71, 1697\n(2011). [arXiv:1009.2539 [hep-ph]]; J. A. Conley, J. S. Gainer, J. L. Hewett, M. P. Le,\nT. G. Rizzo, [arXiv:1103.1697 [hep-ph]].\n[19] R. C. Cotta, J. A. Conley, J. S. Gainer, J. L. Hewett, T. G. Rizzo, JHEP 1101,\n064 (2011). [arXiv:1007.5520 [hep-ph]]; R. C. Cotta, K. T. K. Howe, J. L. Hewett,\nT. G. Rizzo, [arXiv:1105.1199 [hep-ph]].\n[20] R. W. Robinett, Phys. Rev. D30, 688 (1984).\n[21] B. C. Allanach et al., in Proc. of the APS/DPF/DPB Summer Study on the Future\nof Particle Physics (Snowmass 2001) ed. N. Graf, Eur. Phys. J. C 25, 113 (2002)\n[arXiv:hep-ph/0202233].\n[22] J. Alwall, P. Demin, S. de Visscher, R. Frederix, M. Herquet, F. Maltoni, T. Plehn,\nD. L. Rainwater et al., JHEP 0709, 028 (2007). [arXiv:0706.2334 [hep-ph]].\n[23] H. Baer, C. -H. Chen, F. Paige, X. Tata, Phys. Rev. D50, 4508-4516 (1994).\n[hep-ph/9404212].\n[24] T. Sjostrand, S. Mrenna, P. Z. Skands, JHEP 0605, 026 (2006). [hep-ph/0603175].\n[25] U. Baur, S. Errede, J. Ohnemus, Phys. Rev. D48, 4103-4120 (1993). [hep-ph/9304239].\n[26] I. Hinchliffe, F. E. Paige, M. D. Shapiro, J. Soderqvist and W. Yao, Phys. Rev. D 55,\n5520 (1997) [arXiv:hep-ph/9610544].\n[27] R. Lafaye, T. Plehn, D. Zerwas. [hep-ph/0404282]; P. Bechtle, K. Desch, P. Wienemann,\nComput. Phys. Commun. 174, 47-70 (2006). [hep-ph/0412012]; P. Bechtle, K. Desch,\nM. Uhlenbrock, P. Wienemann, Eur. Phys. J. C66, 215-259 (2010). [arXiv:0907.2589\n[hep-ph]].\n\n19\n\n\f"}