{"id": "http://arxiv.org/abs/1009.5937v1", "guidislink": true, "updated": "2010-09-29T16:37:08Z", "updated_parsed": [2010, 9, 29, 16, 37, 8, 2, 272, 0], "published": "2010-09-29T16:37:08Z", "published_parsed": [2010, 9, 29, 16, 37, 8, 2, 272, 0], "title": "Cherenkov mesons as in-medium quark energy loss", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.5796%2C1009.1137%2C1009.3119%2C1009.1053%2C1009.4258%2C1009.1234%2C1009.1255%2C1009.3295%2C1009.3592%2C1009.2139%2C1009.0660%2C1009.4749%2C1009.4067%2C1009.2754%2C1009.1833%2C1009.2374%2C1009.5434%2C1009.2152%2C1009.4004%2C1009.4295%2C1009.1551%2C1009.5101%2C1009.0803%2C1009.2390%2C1009.1880%2C1009.0329%2C1009.4681%2C1009.3531%2C1009.5617%2C1009.5579%2C1009.3107%2C1009.4407%2C1009.1528%2C1009.4743%2C1009.1712%2C1009.1452%2C1009.4906%2C1009.1808%2C1009.5540%2C1009.1512%2C1009.2783%2C1009.6194%2C1009.0761%2C1009.2516%2C1009.3489%2C1009.2698%2C1009.5025%2C1009.5613%2C1009.0958%2C1009.3533%2C1009.3819%2C1009.4711%2C1009.2262%2C1009.1707%2C1009.5937%2C1009.4261%2C1009.1756%2C1009.3945%2C1009.4912%2C1009.1561%2C1009.4856%2C1009.0932%2C1009.1715%2C1009.3038%2C1009.4355%2C1009.6073%2C1009.3387%2C1009.3044%2C1009.3069%2C1009.2631%2C1009.4189%2C1009.0844%2C1009.0135%2C1009.5369%2C1009.3924%2C1009.5167%2C1009.0259%2C1009.5877%2C1009.2599%2C1009.0306%2C1009.0352%2C1009.0462%2C1009.2377%2C1009.3062%2C1009.2751%2C1009.5572%2C1009.5077%2C1009.2233%2C1009.3289%2C1009.4496%2C1009.3403%2C1009.2937%2C1009.3484%2C1009.2131%2C1009.2509%2C1009.2014%2C1009.1205%2C1009.4456%2C1009.4618%2C1009.5713%2C1009.4802&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Cherenkov mesons as in-medium quark energy loss"}, "summary": "We recently showed that a heavy quark moving sufficiently fast through a\nquark-gluon plasma may lose energy by Cherenkov-radiating mesons [1]. Here we\nreview our previous holographic calculation of the energy loss in N=4 Super\nYang-Mills and extend it to longitudinal vector mesons and scalar mesons. We\nalso discuss phenomenological implications for heavy-ion collision experiments.\nAlthough the Cherenkov energy loss is an O(1/Nc) effect, a ballpark estimate\nyields a value of dE/dx for Nc=3 which is comparable to that of other\nmechanisms.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.5796%2C1009.1137%2C1009.3119%2C1009.1053%2C1009.4258%2C1009.1234%2C1009.1255%2C1009.3295%2C1009.3592%2C1009.2139%2C1009.0660%2C1009.4749%2C1009.4067%2C1009.2754%2C1009.1833%2C1009.2374%2C1009.5434%2C1009.2152%2C1009.4004%2C1009.4295%2C1009.1551%2C1009.5101%2C1009.0803%2C1009.2390%2C1009.1880%2C1009.0329%2C1009.4681%2C1009.3531%2C1009.5617%2C1009.5579%2C1009.3107%2C1009.4407%2C1009.1528%2C1009.4743%2C1009.1712%2C1009.1452%2C1009.4906%2C1009.1808%2C1009.5540%2C1009.1512%2C1009.2783%2C1009.6194%2C1009.0761%2C1009.2516%2C1009.3489%2C1009.2698%2C1009.5025%2C1009.5613%2C1009.0958%2C1009.3533%2C1009.3819%2C1009.4711%2C1009.2262%2C1009.1707%2C1009.5937%2C1009.4261%2C1009.1756%2C1009.3945%2C1009.4912%2C1009.1561%2C1009.4856%2C1009.0932%2C1009.1715%2C1009.3038%2C1009.4355%2C1009.6073%2C1009.3387%2C1009.3044%2C1009.3069%2C1009.2631%2C1009.4189%2C1009.0844%2C1009.0135%2C1009.5369%2C1009.3924%2C1009.5167%2C1009.0259%2C1009.5877%2C1009.2599%2C1009.0306%2C1009.0352%2C1009.0462%2C1009.2377%2C1009.3062%2C1009.2751%2C1009.5572%2C1009.5077%2C1009.2233%2C1009.3289%2C1009.4496%2C1009.3403%2C1009.2937%2C1009.3484%2C1009.2131%2C1009.2509%2C1009.2014%2C1009.1205%2C1009.4456%2C1009.4618%2C1009.5713%2C1009.4802&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We recently showed that a heavy quark moving sufficiently fast through a\nquark-gluon plasma may lose energy by Cherenkov-radiating mesons [1]. Here we\nreview our previous holographic calculation of the energy loss in N=4 Super\nYang-Mills and extend it to longitudinal vector mesons and scalar mesons. We\nalso discuss phenomenological implications for heavy-ion collision experiments.\nAlthough the Cherenkov energy loss is an O(1/Nc) effect, a ballpark estimate\nyields a value of dE/dx for Nc=3 which is comparable to that of other\nmechanisms."}, "authors": ["Jorge Casalderrey-Solana", "Daniel Fernandez", "David Mateos"], "author_detail": {"name": "David Mateos"}, "author": "David Mateos", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/JHEP11(2010)091", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1009.5937v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1009.5937v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "PDFLaTeX, 32 pages + appendices", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1009.5937v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1009.5937v1", "journal_reference": "JHEP 1011:091,2010", "doi": "10.1007/JHEP11(2010)091", "fulltext": "Preprint typeset in JHEP style - PAPER VERSION\n\nCERN-PH-TH/2010-214\nICCUB-10-055\n\narXiv:1009.5937v1 [hep-th] 29 Sep 2010\n\nCherenkov mesons as in-medium quark energy loss\n\nJorge Casalderrey-Solana,1 Daniel Fernández2 and David Mateos3,2\n1\n\nPhysics Department, Theory Unit, CERN, CH-1211 Genève 23, Switzerland\n\n2\n\nDepartament de Fı́sica Fonamental & Institut de Ciències del Cosmos (ICC), Universitat\nde Barcelona, Martı́ i Franquès 1, E-08028 Barcelona, Spain\n3\n\nInstitució Catalana de Recerca i Estudis Avançats (ICREA), Passeig Lluı́s Companys 23,\nE-08010, Barcelona, Spain\n\nAbstract: We recently showed that a heavy quark moving sufficiently fast through a quarkgluon plasma may lose energy by Cherenkov-radiating mesons [1]. Here we review our previous\nholographic calculation of the energy loss in N = 4 Super Yang-Mills and extend it to\nlongitudinal vector mesons and scalar mesons. We also discuss phenomenological implications\nfor heavy-ion collision experiments. Although the Cherenkov energy loss is an O(1/Nc ) effect,\na ballpark estimate yields a value of dE/dx for Nc = 3 which is comparable to that of other\nmechanisms.\nKeywords: D-branes, Supersymmetry and Duality, 1/N Expansion, Gauge-gravity\ncorrespondence, QCD Phenomenology.\n\n\fContents\n1. Introduction\n\n1\n\n2. A universal mechanism of quark energy loss\n\n2\n\n3. Quarks in the N = 4 SYM plasma\n\n5\n\n4. Meson dispersion relations in the N = 4 SYM plasma\n4.1 Vector mesons\n4.2 Scalar mesons\n\n8\n9\n14\n\n5. Quark energy loss in the N = 4 SYM plasma\n5.1 Energy loss into vector mesons\n5.2 Energy loss into scalar mesons\n\n16\n16\n24\n\n6. Phenomenological implications for HIC experiments\n\n27\n\n7. Discussion\n\n30\n\nA. Boundary conditions at the string endpoint\n\n34\n\nB. Energy loss formula\n\n35\n\nC. High-momentum radial wave functions\n\n36\n\nD. Energy loss at small r0\nD.1 Scalar mesons\nD.2 Transverse vector mesons\nD.3 Longitudinal vector mesons\n\n38\n39\n39\n39\n\nE. Low-temperature limit\n\n40\n\n1. Introduction\nWith the advent of the Large Hadron Collider (LHC) the field of heavy-ion collisions (HIC)\n√\nenters a new era. The center-of-mass energy per nucleon in LHC collisions, sNN ' 5.5 TeV,\nis almost 30 times larger than that of the most energetic collisions at the Relativistic Heavy\nIon Collider (RHIC). The highest temperature of the quark-gluon plasma (QGP) created in\n\n–1–\n\n\fRHIC experiments is approximately TRHIC ' 2Tc , with Tc ' 175 MeV the deconfinement\ntemperature of Quantum Chromodynamics (QCD). Despite the large increase in the collision\nenergy, this is expected to lead only to a moderate increase in the plasma temperature at\nthe LHC [2], i.e. TLHC ' (3 − 4)Tc .1 In contrast, high-energy partons originating from hard\ninitial collisions will be copiously produced at the LHC. This will allow the study of quarks\nand gluons in the 100 GeV range, an order of magnitude larger than that at the RHIC.\nExperimentally, extremely valuable information is obtained by analyzing the energy loss\nof these energetic partons as they travel through the QGP. In order to use this information to\nlearn about the plasma, a theoretical, quantitative understanding of the different mechanisms\nof parton energy loss is needed. Several such mechanisms have been previously studied, both\nin QCD itself [3] and in the context of the gauge/gravity duality [4].\nA remarkable conclusion from the RHIC experiments [5] is that the QGP does not behave\nas a weakly coupled gas of quarks and gluons, but rather as a strongly coupled fluid [6].\nBecause of the moderate increase in the temperature and the logarithmic running of the\nQCD coupling constant, a qualitatively rather similar behaviour may be expected for the\nQGP at the LHC. This makes it particularly important to understand mechanisms of parton\nenergy loss that may operate at strong coupling. We recently uncovered one such mechanism\n[1] whereby a sufficiently fast heavy quark traversing a strongly coupled plasma loses energy\nby Cherenkov-radiating in-medium mesons.\nThe analysis in [1] showed that this mechanism takes place in all strongly coupled, largeNc gauge theory plasmas with a gravity dual. The argument is so simple that we reproduce\nit in section 2 for completeness. This section emphasizes the universality of the mechanism,\nsince no reference to a specific model is necessary.\nRef. [1] also performed a quantitative analysis in the simple example of a quark moving\nthrough the N = 4 super Yang-Mills (SYM) plasma. The quark Cherenkov-radiates both\nvector and scalar mesons. The rate of energy loss into the transverse modes of the vector\nmesons was calculated in [1], and again we reproduce it here for completeness. The vector\nmesons in question are massive, and thus they also possess a longitudinal mode. Here we\nextend the calculation of [1] and obtain the rate of energy loss into longitudinal vector mesons\nand scalar mesons. The result for the former is qualitatively similar to that for the transverse\nmodes, whereas the result for scalar mesons displays some qualitative differences.\nRef. [1] presented a rather preliminary exploration of the potential implications of these\nresults for HIC experiments. Here we elaborate on that discussion and extend it to include\npossible implications of the new results presented in this paper.\n\n2. A universal mechanism of quark energy loss\nThe reason that the mechanism we are going to describe is universal is that it only relies on\n1\n\nA rough estimate is obtained by assuming that the temperature scales as the fourth root of the energy\ndensity.\n\n–2–\n\n\ftwo universal features of the gauge/gravity duality:2 (i) the fact that the deconfined phase\nof the gauge theory is described by a black hole geometry on the gravity side [7], and (ii)\nthe fact that a finite number Nf of quark flavours is described by Nf D-brane probes [8] – see\nfig. 1.\nGauge theory directions\n\nρ\n\nD-branes\n\nBoundary\n\nv\n\nQuark\n\nvlim\nHorizon\n\nBlack Hole\nFigure 1: D-branes and an open string in a black hole geometry.\n\nIn addition to the gauge theory directions, the gravity description always includes a radial\ndirection (denoted by ρ in fig. 1) which is dual to the gauge theory energy scale. The radial\nposition of the horizon is proportional to the plasma temperature T . The D-branes extend\nin the radial direction down to a minimum value proportional to the quark mass Mq .\nAs it is intuitively clear, for Mq sufficiently larger than T the D-branes sit completely\noutside the horizon [9, 10, 11, 12, 13].3 In this phase, scalar and vector gauge theory mesons\nare described by small, normalizable fluctuations of scalar and vector fields propagating on\nthe branes, whose low-energy dynamics is governed by a Maxwell-like theory. The spectrum\nof these fluctuations is discrete and gapped, which means that stable heavy meson states exist\nin the plasma. In other words, sufficiently heavy mesons survive deconfinement, in agreement\nwith lattice and potential model predictions for QCD [14].\nConsider now the in-medium dispersion relation ω(q) for these heavy mesons, where ω\nand q are the energy and the spatial three-momentum of the meson, respectively. As an\nillustrative example, the dispersion relations for vector and scalar mesons in the N = 4 SYM\nplasma4 are depicted in fig. 2.\nAs q → ∞, the DR becomes linear: ω(q) ∼ vlim q, with vlim < 1. This subluminal limiting\nvelocity, which is the same for all mesons, can be easily understood in the gravitational\ndescription [10]. Since highly energetic mesons are strongly attracted by the gravitational\npull of the black hole, their wave-function is very concentrated at the bottom of the branes.\nConsequently, their velocity is limited by the local speed of light at that point, vlim (see\n2\n\n2\nIn the limit Nc , gYM\nNc → ∞.\nIn contrast, as the ratio Mq /T decreases, a first-order phase transition eventually occurs and a part of the\nbranes falls through the horizon. See section 3.\n4\nWith quarks introduced as D7-branes; see below for details.\n3\n\n–3–\n\n\f8\n\n6\n\n6\nω/πT\n\nω/πT\n\n8\n\n4\n2\n0\n\n0\n\n2\n\n4\n\n6\n\n8\n\n4\n2\n0\n\n10 12 14\n\nq/πT\n\n0\n\n2\n\n4\n\n6\n\n8\n\n10 12 14\n\nq/πT\n\nFigure 2: Left: Dispersion relation for the transverse (black, continuous curve) and longitudinal (red,\ndashed curve) n = 0 modes of a heavy vector meson with vlim = 0.35 in the N = 4 SYM plasma.\nRight: Analogous curves for a scalar (black, continuous curve) and pseudoscalar (red, dashed curve)\nmeson. In both plots the blue, continuous straight lines correspond to ω = vq with vlim < v < 1. The\nblack, dotted, vertical lines mark the crossing points between the meson dispersion relations and the\nblue lines.\n\nfig. 1). Because of the black hole redshift, vlim is lower than the speed of light at infinity (i.e.\nat the boundary), which is normalised to unity. In the gauge theory this translates into the\nstatement that vlim is lower than the speed of light in the absence of a medium, namely in\nthe vacuum. The reason is that the absence of a medium in the gauge theory corresponds to\nthe absence of a black hole on the gravity side, in which case vlim = 1 everywhere.\nImagine now a heavy quark in the plasma. In the gravitational picture, this is described\nby a string that starts on the D-branes and falls through the horizon – see fig. 1. In order to\nmodel a highly energetic quark we consider a string whose endpoint moves with an arbitrary\nvelocity v at an arbitrary radial position ρ0 . Roughly speaking, the interpretation of ρ0 in the\ngauge theory is that of the inverse size of the gluon cloud that dresses the quark. This can\nbe seen, for example, by holographically computing the profile of hTrF 2 (x)i around a static\nquark source dual to a string whose endpoint sits at ρ = ρ0 [15].\nTwo simple observations now lead to the effect that we\nmeson\nare interested in. The first one is that the string endpoint\nquark\nquark\nis charged under the scalar and vector fields on the branes.\nIn the gauge theory, this corresponds to an effective quark√\nmeson coupling (see fig. 3) of order e ∼ 1/ Nc . We will Figure 3: Effective quarkderive these facts rigorously below, but physically they can meson coupling.\nbe understood very simply. The fields on the branes describe\nfluctuations around the branes equilibrium configuration. The string endpoint pulls on the\nbranes and therefore excites (i.e. it is charged under) these fields. The branes tension is of\norder 1/gs ∼ Nc , where gs is the string coupling constant, whereas the string tension is Nc independent. This means that the deformation of the branes caused by the string is of order\ne2 ∼ 1/Nc . We thus conclude that the dynamics of the 'branes+string endpoint' system\n\n–4–\n\n\fis (a generalization of) that of classical electrodynamics in a medium in the presence of a\nfast-moving charge.\nThe second observation is that the velocity of the quark may exceed the limiting velocity\nof the mesons, since the redshift at the position of the string endpoint is smaller than at\nthe bottom of the branes. As in ordinary electrodynamics, if this happens then the string\nendpoint loses energy by Cherenkov-radiating into the fields on the branes.5 In the gauge\ntheory, this translates into the quark losing energy by Cherenkov-radiating scalar and vector\nmesons. The rate of energy loss is set by the square of the coupling, and is therefore of order\n1/Nc .\n\n3. Quarks in the N = 4 SYM plasma\nThe four-dimensional N = 4 SYM theory with gauge group SU (Nc ) at non-zero temperature\nis dual to type IIB string theory on the gravitational background sourced by Nc black D3branes. Nf quark flavours may be introduced in the gauge theory by adding D7-branes on\nthe gravity side. The relative orientation of the 'colour' and 'flavour' branes is summarised\nby the array\n0 1 2 3 4 5 6 7 89\n(3.1)\nNc D3: × × × ×\nNf D7: × × × × × × × ×\nIn the limit Nf \u001c Nc the backreaction of the D7-branes on the spacetime metric may be\nignored and the D7-branes may be treated as probes in the gravitational background sourced\nby the D3-branes. Following [1, 10] we write the spacetime metric as ds2 = L2 ds2 (G), where\n\u0014 2\n\u0015\n\u0003\nf\nρ2\n1 \u0002\n2\n2\n2\n ̃\n− dt + f dxi + 2 dr2 + r2 dΩ23 + dR2 + R2 dθ2 ,\n(3.2)\nds (G) =\n ̃\n2\nρ\nf\nand\nL4 = 4πgs Nc `4s ,\n\nρ2 = R2 + r2 ,\n\nf = 1 − 1/ρ4 ,\n\nf ̃ = 1 + 1/ρ4 .\n\n(3.3)\n\nThe four gauge theory directions are xμ = {t, ~x} = {t, xi }, and they are identified with the\n0123-directions shared by both sets of branes in (3.1). The metric inside the second set of\nbrackets in (3.2) is just the flat metric on R6 = R4 × R2 , which corresponds to the 456789directions in (3.1), written in terms of two sets of spherical coordinates {r, Ω3 } and {R, θ}.\nThe coordinate ρ is the overall radial coordinate in R6 . This splitting is convenient since the\nD7-branes extend along the {r, Ω3 }-directions. All coordinates above are dimensionless, and\nthey are related to their dimensionful counterparts (denoted with tildes) through\nxμ = πT x̃μ ,\n\n{r, R, ρ} =\n\n1\n{r̃, R̃, ρ̃} .\nπL2 T\n\n(3.4)\n\nIn particular, this means that we are measuring energy and momentum in the gauge theory\nin units of πT . In addition, since the horizon of the metric (3.2) in dimensionless coordinates\n5\n\nThis can be viewed as a particular limit of string breaking – see sec. 7.\n\n–5–\n\n\flies at ρhor = 1, we see that the size of the horizon in physical units is proportional to the\ngauge theory temperature, i.e. ρ̃hor ∝ T .\nD7-brane embeddings\nWe now specialize to Nf = 1; we will discuss the case Nf > 1 in sec. 7. The action governing the dynamics of a D7-brane in the background sourced by D3-branes takes the form\nSD7 = −TD7\n\nZ\n\np\n2π`2s\nd8 x − det (g + 2π`2s F ) + TD7\n2\n\n\u00012 Z\n\nC4 ∧ F ∧ F .\n\n(3.5)\n\nIn this equation TD7 = 1/gs (2π)7 `8s is the D7-brane tension, `s is the string length, xa (a =\n0, . . . , 7) are intrinsic coordinates on the brane's worldvolume, g is the induced metric, F = dA\nis the field-strength of the worldvolume U (1) gauge field Aa , and C4 stands for the pull-back\nof the spacetime Ramond-Ramond four-form potential sourced by the D3-branes. As we will\nsee below, the term in the action involving C4 will not contribute to any of our calculations.\nIn order to describe the D7-brane embedding we use xa = {xμ , r, Ω3 } as worldvolume coordinates. In other words, the brane extends along the gauge theory directions and the radial\ndirection r, and it wraps an S 3 in the directions transverse to the D3-branes. Translational\nsymmetry along xμ and rotational symmetry along Ω3 then imply that the embedding must\nbe specified as R = R(r) and θ = θ(r). Since θ is also a symmetry direction, a consistent\nsolution is obtained by choosing θ = const. A typical D7-brane embedding with different sets\nof coordinates suppressed is shown in fig. 4.\n\nFigure 4: Minkowski-type D7-brane embedding showing the S 3 wrapped by the branes (left) and the\ngauge theory directions (right). The angular coordinate θ is suppressed in both cases. The asymptotic\nposition of the brane is proportional to the quark mass Mq , whereas the size of the black hole horizon\n(shown in dark grey) is proportional to the temperature T .\n\nUnder these circumstances the induced metric on the D7-brane takes the form ds2 =\n\n–6–\n\n\fL2 ds2 (g) with\n\u0015\n\u0014 2\n(1 + Ṙ2 ) 2 r2 2\nf\nρ2\n2\n2\n ̃\n− dt + f d~x +\nds (g) =\ndr + 2 dΩ3 ,\n2\nρ2\nρ\nf ̃\n2\n\n(3.6)\n\nwhere Ṙ = dR/dr. The function R(r) is determined by inserting (3.6) in (3.5), setting F = 0,\nand varying with respect to R(r). The resulting Euler-Lagrange equation of motion is\n\" \u0012\n#\n\u0013\np\n1\nṘ\nr3 R\np\n∂r r 3 1 − 2\n=\n8\n1 + Ṙ2 .\n(3.7)\n2 + R 2 )5\n(r + R2 )4\n(r\n2\n1 + Ṙ\nIn the limit r → ∞, this equation leads to the asymptotic behaviour\nR(r) ' m +\n\nc\n+ *** .\nr2\n\n(3.8)\n\nHolography relates the dimensionless constants m and c to the quark mass and condensate\nas (see [10] for details)\nMq =\n\n1√\nλT m,\n2\n\nhψ̄ψi = −\n\n1√\nλ Nf Nc T 3 c ,\n8\n\n(3.9)\n\n2 N = 2πg N is the 't Hooft coupling. An important point is that the constant\nwhere λ = gYM\nc\ns c\nm can also be written in terms of the mass Mmes of the lightest meson in the theory at zero\ntemperature as [10]:\nMmes\n2Mq\n=\n.\n(3.10)\nm= √\n2πT\nλT\n\nEq. (3.7) cannot be solved analytically, but numerical solutions for any value of the\nasymptotic brane position, m = R(r → ∞), can be easily found. The constants m and\nc correspond to the two solutions at infinity of the second-order equation of motion (3.7).\nThese solutions are mathematically independent, but not physically: once m is specified, the\nrequirement of regularity in the interior determines c. The physical solution is thus uniquely\ncharacterized by the value of m.6 In the gauge theory this translates into the statement that\nonce the quark mass (and the temperature) are specified, the dynamics determines the quark\ncondensate.\nSolutions of eq. (3.7) fall into two classes. For m > 1.3, i.e. for quark masses sufficiently\nlarger than the temperature, the brane bends towards the horizon because of its gravitational\npull, but the brane tension is able to compensate for this and the brane sits entirely outside the\nhorizon, as in fig. 4 and on the left-hand side of fig. 5. In this case the brane embedding is of\nthe so-called 'Minkowski' type [9, 10], and we will denote by R0 = R(r = 0) the radial position\nof the bottom of the branes. For Minkowski embeddings there is a one-to-one correspondence\nbetween m and R0 , and the lowest value m = 1.3 corresponds to R0 = 1.2.\n6\n\nFor thermodynamically stable embeddings. In the case of thermodynamically metastable or unstable\nembeddings, c may be multivalued [9, 10].\n\n–7–\n\n\fMinkowski embedding\n\nBlack hole embedding\n\nFirst-order\nphase transition\n\nFigure 5: First-order phase transition between Minkowski and black-hole type embeddings.\n\nIn contrast, for m < 1.3, the brane falls through the black hole horizon in a so-called\n'black-hole embedding', since in this case the induced metric on the branes possesses a horizon\n– see fig. 5. At m = 1.3 a first-order phase transition between the two phases occurs, as\nindicated in fig. 5. As we will see below, in the Minkowski phase stable mesons exist, and their\nspectrum is discrete and gapped. In contrast, no stable mesons (in fact, no quasi-particles)\nexist in the black hole phase. For this reason, the phase transition above is interpreted in the\ngauge theory as a dissociation or 'melting' phase transition for mesons in the N = 4 plasma\n[9, 10, 16].\nThe value m = 1.3 thus corresponds to the (stable) Minkowski-type brane that comes\nclosest to the horizon, and therefore to the one for which the in-medium meson dispersion\nrelation is most dramatically modified with respect to that in the vacuum. For this reason,\nwe have chosen the embedding with m = 1.3 to illustrate some results in the sections below.\nSpecifically, we see from eq. (3.6) that the local speed of light at the bottom of the brane is\nr\ng00\nf (R0 )\nvlim = −\n,\n(3.11)\n=\ng11 r=0 f ̃(R0 )\nwhere we recall that R0 = R(r = 0). Since m = 1.3 corresponds to R0 = 1.2, the formula\nabove gives vlim ' 0.35, i.e. in this case the limiting velocity of mesons in the plasma is about\n1/3 of that in the vacuum.\n\n4. Meson dispersion relations in the N = 4 SYM plasma\nDespite the fact that the N = 4 SYM theory is in a deconfined phase at any T > 0, stable\nquark-antiquark states exist for sufficiently large Mq /T , and the spectrum of these mesons\nis discrete and gapped. In particular, scalar and vector mesons in the gauge theory are dual\nto regular, normalizable modes of the scalar and vector fields on the D7-brane. Here we will\nreview the dispersion relations for these modes, which we will need in order to compute the\nquark energy loss below. The dispersion relation for (some) vector mesons in the D3/D7\n\n–8–\n\n\fsystem appeared in [1], but no details were presented there. The dispersion relation for scalar\nmesons was first computed in [10] and then revisited in [17]. Here we will review the result in\nthe geometric parametrization of [17], which is particularly suited for calculating the energy\nradiated into these modes by the quark.\n4.1 Vector mesons\nThese are dual to regular, normalizable fluctuations of the worldvolume gauge field A. The\nN = 4 SYM theory possesses an internal, global SO(6) symmetry that is broken down to\nSO(4) by the addition of quarks. In the string description, SO(6) is the isometry group of\nthe spacetime metric (3.2), whereas SO(4) is the isometry group of the S 3 wrapped by the\nD7-branes. Under the preserved SO(4) symmetry, meson modes decompose into singlet and\nnon-singlet modes. Since we are interested in using the N = 4 SYM plasma as a toy model for\nthe QCD plasma, and since QCD possesses no analog of the SO(4) symmetry, we will focus\non singlet modes. The equation of motion for these modes receives no contribution from the\nsecond term in the action (3.5) [18], and therefore we will ignore this term in the following.\nIn conclusion, since we are interested in singlet modes, we only need to consider the first\nterm in the action (3.5). In addition, since we are only interested in their dispersion relation\n(as opposed to higher-order couplings), it suffices to expand this term to quadratic order in\nF in the fixed worldvolume metric (3.6).7 The result is\nZ\n\u0001\n√\n1\n4\n2 2\nSvector = −TD7 L 2πls\nd8 x −g F ab Fab ,\n(4.1)\n4\nleading to the equation of motion\n√\n√\n−g ∇a F ab = ∂a ( −g F ab ) = 0 .\n\n(4.2)\n\nThe metric g that enters these expressions is that in eq. (3.6), which contains no factors of\nL; these have been explicitly included in the prefactor of (4.1).\nSinglet modes take the form\nAμ = Aμ (xμ , r) ,\n\nAr = Ar (xμ , r) ,\n\nAΩ3 = 0 ,\n\n(4.3)\n\ni.e. they have no components along the S 3 and depend only on r and the gauge theory\ndirections. The equations of motion are further simplified by the gauge choice Ar = 0, which\nwe will employ henceforth. In addition, we will work with the Fourier components of the\ngauge field defined through\nZ\ndωd3 q\nAμ (t, x, r) =\nAμ (ω, q, r) e−iωt+iq*x ,\n(4.4)\n(2π)4\nwhere ω and q are the energy and the three-momentum of the meson, respectively. Finally,\nwe choose the momentum to point along x1 without loss of generality.\n7\n\nAt higher orders gauge field fluctuations would mix with scalar fluctuations. Similarly, at higher orders\nsinglet modes would generically mix with non-singlet modes.\n\n–9–\n\n\fUnder the conditions above, the equations of motion for the transverse modes A2 , A3\ndecouple from each other and from those for the longitudinal mode A0 , A1 , so we will study\nthem in turn.\nTransverse modes\nLet us collectively denote A = {A2 , A3 }. Both modes obey identical equations of motion\nwhich take the form\n∂r\n\n√\n\n\u0001 √\n\u0001\ng g rr g 33 ∂r A − g g 33 g 00 ω 2 + g 11 q 2 A = 0 .\n\n(4.5)\n\nUpon using (3.6) this becomes\n∂r\n\n!\np\nf r3\nr3\np\n∂r A + 1 + Ṙ2 4\nρ\n2 1 + Ṙ2\n\nω 2 f ̃ q 2 f\n−\nf\nf ̃\n\n!\nA = 0.\n\nSince we are interested in regular, normalizable solutions, we can expand A as\nX\nA(ω, q, r) =\nAn (ω, q) ξn (q, r)\n\n(4.6)\n\n(4.7)\n\nn\n\nin terms of a basis of regular, normalizable eigenfunctions {ξn (q, r)} in the radial direction.\nThese are solutions of eqn. (4.6) with q-dependent eigenvalues ω = ωn (q), i.e. they obey the\neigenstate equation\n!\np\np\nf r3\nf r3 2\nf ̃r3\np\n−∂r\nq ξn (q, r) = 1 + Ṙ2 4 ωn (q)2 ξn (q, r) (4.8)\n∂r ξn (q, r) + 1 + Ṙ2\nfρ\nf ̃ρ4\n2 1 + Ṙ2\nand satisfy the orthonormality relations\nZ\n0\n\n∞\n\ndr\n\nf ̃r3 p\n1 + Ṙ2 ξm (q, r)ξn (q, r) = δmn .\nf ρ4\n\n(4.9)\n\nAs we will see in more detail below, the discreteness of the spectrum is guaranteed by the\nboundary conditions on the ξn : regularity at r = 0 and normalizability at r = ∞. Inserting\nthe expansion (4.7) in (4.6), and using the eigenstate equation (4.8) and the orthonormality\nrelations (4.9), we find that each of the An (ω, q) fields obeys an independent equation of the\nform\n\u0002 2\n\u0003\nω − ωn2 (q) An (ω, q) = 0 .\n(4.10)\nThus, through the expansion (4.7) we have 'Kaluza-Klein-reduced' the five-dimensional field\nA(ω, q, r) to a discrete, infinite tower of independent four-dimensional fields {An (ω, q)}. Each\nof these fields is dual in the gauge theory to a transverse vector meson with dispersion relation\nω = ωn (q), which is the physical meaning of the wave equation (4.10). In the gauge theory,\neach of the mesons in this infinite set is distinguished by its 'internal' quantum number n. In\n\n– 10 –\n\n\fξ0\n\n30\n25\n20\n15\n10\n5\n0\n0.0\n\n0.5\n\n1.0\n\n6\n5\n4\nξ0 /q 3\n2\n1\n0\n\n1.5\n\n0\n\n1\n\nr\n\n2\n\n√\n\n3\n\n4\n\nqr\n\n40\n\n10\n\n30\nξ1 /q\n\nξ1 20\n\n5\n\n10\n0\n0.0\n\n0.5\n\n1.0\n\n0\n0.0 0.5 1.0 1.5\n2.0 2.5 3.0\n√\n\n1.5\n\nr\n\nξ2\n\nqr\n\n60\n50\n40\n30\n20\n10\n0\n\n20\n15\nξ2 /q 10\n\n5\n0\n0.0\n\n0.0 0.2 0.4 0.6 0.8 1.0 1.2 1.4\nr\n\n0.5\n\n1.0\n\n√\n\n1.5\n\n2.0\n\nqr\n\nFigure 6: Normalized transverse vector meson radial profiles ξn (q, r) for a D7-brane embedding with\nm = 1.3. The blue, violet, brown and green curves (i.e. bottom to top on the left, top to bottom on\nthe right) correspond to q = 1, 2, 4, 11, respectively. The rescalings on the right-hand side correspond\nto those in appendix C. Note that the area under the curves is not unity because of the non-trivial\nmeasure in eq. (4.9).\n\nthe string description, each value of n corresponds to a different, q-dependent radial 'wavefunction' ξn (q, r). As we will see below, this structure of mesons in the fifth dimension will\nplay an important role in determining the strength with which each of them couples to a\nquark.\n\n– 11 –\n\n\fω/πT\n\nGiven that the brane embedding R(r) entering eq. (4.8) is only known numerically, the\nradial profiles must also be found numerically. The general solution of eq. (4.8) behaves as\nξn ∼ a+b/r2 as r → 0, and as ξn ∼ ã+ b̃/r2 as r → ∞, for some constants a, b, ã, b̃. Regularity\nat r = 0 requires b = 0, whereas normalizability imposes the condition ã = 0. For fixed q,\nthese two requirements are mutually compatible only for a discrete set of values of the energy,\nωn (q). This is the origin of the dispersion relation.\nFig. 6 shows several numerically-obtained\n12\nradial profiles of the first lowest-lying modes\n10\nξn (q, r) for several values of q for a D7-brane\n8\nembedding with m = 1.3. The corresponding\n6\nvalues of the energy, ωn (q), are given by the\n4\ndispersion relation curves in figs. 2 and 7. As\n2\nis familiar with solutions of Schrödinger-like\n0\n0\n5\n10\n15\n20\nequations, the nth solution possesses n zeros.\nq/πT\nMore importantly, we see that the radial wavefunctions for all these modes become concentrated around the bottom of the brane, r ' 0,\nas q → ∞. Relatedly, we observe that the limiting velocity of all these modes agrees with\nthe local speed of light at the bottom of the\nbrane, eq. (3.11), as expected from the general\nargument in section 2.\n\nFigure 7: Dispersion relation for the first transverse modes ξn of a heavy vector meson with\nvlim = 0.35 in the N = 4 SYM plasma. The\ncurves correspond to n = 0, 1, 2 from bottom\nto top. The blue, continuous straight line corresponds to ω = vq with vlim < v < 1.\n\nLongitudinal modes\nEq. (4.2) with b = 0, 1 and r yields two second-order dynamical equations and a first-order\nconstraint equation, respectively, in which the longitudinal components A0 and A1 are coupled to one another. Only two out of the three equations are independent, which we take to\nbe\n\u0001\n√\n√\n∂r\n−gg rr g 00 ∂r A0 + iq −gg 11 g 00 E = 0 ,\n(4.11)\niωg 00 ∂r A0 − iqg 11 ∂r A1 = 0 ,\n\n(4.12)\n\nwhere we have introduced the gauge-invariant electric field\nE = F10 = iqA0 + iωA1 .\nFrom these two equations, it is easy to see that E satisfies\n\u0012√\n\u0013\n√\n−g g rr g 00 g 11\n−iq ∂r\n∂\nE\n+ iq −g g 11 g 00 E = 0 .\nr\n2\n11\n2\n00\nq g +w g\n\n(4.13)\n\n(4.14)\n\nIn order to turn this into an eigenstate equation we introduce a new field Φ defined as\n√\n−gg rr g 00 g 11\nΦ = 2 11\n∂r E .\n(4.15)\nq g + w2 g 00\n\n– 12 –\n\n\fEq. (4.14) then implies the inverse relation\nE=√\n\n1\n∂r Φ\n−g g 11 g 00\n\nwhich, when substituted back into (4.15), yields the equation of motion for Φ:\n\u0012\n\u0013\n1\nq 2 g 11 + w2 g 00\n√\n∂\nΦ\n+\nΦ = 0.\n−∂r √\nr\n−g g 11 g 00\n−g g rr g 00 g 11\nInserting the explicit form of the metric functions, we arrive at\n!\np\n\u0012\n\u0013\nf ρ4\n1 + Ṙ2\nf2 2\n2\np\n∂r\n∂r Φ + 2\nw − q Φ = 0.\nf r3\nf ̃2\nf ̃r3 1 + Ṙ2\n\n(4.16)\n\n(4.17)\n\n(4.18)\n\nFrom this point onward, we proceed as in the case of transverse modes. We expand Φ as\nX\nΦ(ω, q, r) =\nΦn (ω, q)φn (q, r)\n(4.19)\nn\n\nin terms of a basis of regular, normalizable eigenfunctions {φn (q, r)} in the radial direction.\nThese are solutions of eq. (4.18) with q-dependent eigenvalues ω = ωn (q), and are subject to\nthe orthonormality relations\np\nZ ∞\n1 + Ṙ2\nφn (q, r)φm (q, r) = δmn .\n(4.20)\ndr 2\nf r3\n0\nAs in the case of transverse modes, the longitudinal modes Φn (ω, q) obey the wave equation\n\u0002\n\n\u0003\nω 2 − ωn2 (q) Φn (ω, q) = 0 ,\n\n(4.21)\n\nas appropriate for a four-dimensional field with dispersion relation ω = ωn (q). Again, through\nthe expansion (4.19) we have Kaluza-Klein-reduced the five-dimensional field Φ(ω, q, r) to a\ndiscrete, infinite tower of independent four-dimensional fields {φn (ω, q)}, each of which is\ndual to a longitudinal vector meson in the gauge theory.\nThe general solution of eq. (4.18) behaves as φn ∼ a+br4 as r → 0, and as φn ∼ ã+ b̃ log r\nas r → ∞, for some constants a, b, ã, b̃. Normalizability with respect to (4.20) as r → 0 requires\nthat a = 0, and regularity as r → ∞ requires that b̃ = 0. As in the case of the transverse\nmodes, for fixed q these two requirements are mutually compatible only for a discrete set of\nenergies ωn (q).\nFig. 8 shows the electric field, eq. (4.16), of several numerically-obtained radial profiles\nof the lowest-lying mode φn=0 (q, r) for several values of q. The corresponding values of the\nenergy, ωn=0 (q), are given by the dispersion relation curve in fig. 2. These results correspond\nagain to a D7-brane embedding with asymptotic position m = 1.3. We observe the same\nlimiting velocity vlim = 0.35 given by the local speed of light at the bottom of the branes,\neq. (3.11).\n\n– 13 –\n\n\fE0 /q 3/2\n\nE0\n\n150\n100\n50\n0\n0.0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\n14\n12\n10\n8\n6\n4\n2\n0\n0.0 0.5 1.0 1.5 2.0 2.5 3.0\n√\n\nr\n\nqr\n\nFigure 8: Electric field E0 (q, r) of the normalized longitudinal vector meson radial profiles φ0 (q, r)\nfor a D7-brane embedding with m = 1.3. The blue, violet, brown and green curves (i.e. bottom to\ntop on the left, top to bottom on the right) correspond to q = 1, 2, 4, 11, respectively. The rescalings\non the right-hand side correspond to those in appendix C. Note that the area under the curves is not\nunity because of the non-trivial measure in eq. (4.20).\n\n4.2 Scalar mesons\nThe scalar fields on the brane get excited by the string endpoint because the string tension\npulls on the brane. A crucial feature is the fact that the boundary conditions at the string\nendpoint imply that the string must end orthogonally on the brane. (The unfamiliar reader\ncan find a concise derivation in appendix A.) For this reason it is convenient to work with\nspacetime coordinates that locally parametrize the directions orthogonal to the brane. In the\ncase of interest to us, the θ coordinate in (3.2) satisfies this requirement, since the vector field\n∂/∂θ is orthogonal to the fiducial D7-brane embedding at each point on the brane. However,\nthe R coordinate does not meet this requirement, since ∂/∂R is in general not orthogonal\nto the brane due to the brane bending in the r − R directions. We therefore follow [17] and\nwork with two geometric coordinates X A defined as follows. At each point on the brane, the\ntwo-dimensional space orthogonal to the brane is spanned by the unit vectors\nV1 ∝\n\n∂\n∂\n− Ṙ(r) ,\n∂R\n∂r\n\nV2 ∝\n\n∂\n,\n∂θ\n\n(4.22)\n\nso a general vector orthogonal to the brane takes the form U = X A VA . For each vector U we\nshoot off a geodesic with unit affine parameter that at the brane has U as its tangent vector.\nThe endpoint of this geodesic defines a point in a neighborhood of the brane. In this way we\nobtain a one-to-one correspondence (the so-called exponential map [19]) between the values\nof X A and the points near the brane. In other words, X A are the coordinates orthogonal to\nthe brane that we were seeking, since on the brane we have ∂/∂X A = VA by construction. In\nparticular, this implies that in these coordinates GAB = δAB when evaluated precisely on the\nbrane, where G is the spacetime metric (3.2). Note that in this section the ten dimensionless\ncoordinates of spacetime are thus {xa , X A }, with a = 0, . . . , 7 and A = 1, 2.\nWe chose the fiducial embedding of the brane to be given by X A = 0, so that the X A\nfields parametrize fluctuations around it. As shown in [17], to quadratic order in these fields\n\n– 14 –\n\n\fthe D7-brane action takes the simple form\n\u0014\n\u0015\nZ\n1 ab\n1 2\n8\n8 √\nA\nB\nA B\n,\nSscalar = −TD7 L\nd x −g g ∂a X ∂b X GAB + mAB (x)X X\n2\n2\n\n(4.23)\n\nwhere g is the induced metric (3.6) on the fiducial embedding of the brane, i.e. it is X A independent. As usual, this metric contains no factors of L, since this have been factored out\nexplicitly in front of the action. The position-dependent mass matrix m2AB (x) is diagonal and\ngiven in terms of geometric quantities as\nm211 = R11 + R2112 + 2R22 + (8) R − R ,\n\nm222 = −R22 + R2112 ,\n\n(4.24)\n\nwhere\nR2112 = V2M V1N V1P V2Q RM N P Q ,\nR11 =\nR22 =\n\nV1M V1N RM N\nV2M V2N RM N\n\n(4.25)\n\n,\n\n(4.26)\n\n.\n\n(4.27)\n\nRM N P Q and RM N are, respectively, the Riemann and the Ricci tensors of the ten-dimensional\nspacetime metric G, R is the corresponding Ricci scalar, and (8) R is the Ricci scalar of the\neight-dimensional induced metric on the brane g. Again none of these quantities contains any\nfactors of L.\nUsing the fact that GAB = δAB the action (4.23) leads to the equation of motion\n\u0001 √\n√\n√\n√\n−g ∇2 X A − −g m2 X A = ∂a\n−g ∂ a X A − −g m2 X A = 0 ,\n(4.28)\nwhere m = m11 or m22 as appropriate. Following the vector meson case, we focus on the\nzero-mode of X A on the S 3 , and work with its Fourier components X A (ω, q, r), for which the\nequation of motion is\n\u0001 √\n\u0001\n√\n∂r\n(4.29)\n−g g rr ∂r X A − −g g 00 ω 2 + g 11 q 2 + m2 X A = 0 ,\nwhich upon substitution of the metric functions becomes\n!\n!\np\n ̃\nf f ̃r3 ρ2\n2\nf\n2\n∂r p\n∂r X A + f f ̃r3 1 + Ṙ2\nq 2 − m2 X A = 0 .\nω2 −\nρ2 f 2\nρ2 f ̃\n1 + Ṙ2\n\n(4.30)\n\nAs usual, we expand X A as\nX A (ω, q, r) =\n\nX\n\nXnA (ω, k) φA\nn (k, r)\n\n(4.31)\n\nn\n\nin terms of a basis of normalizable eigenfunctions {φA\nn (k, r)} in the radial direction. These\nare solutions of eq. (4.30) with q-dependent eigenvalues ω = ωnA (k), and are subject to the\northonormality relations\np\nZ ∞\n2f ̃2 r3 1 + Ṙ2 A\ndr\nφm (q, r)φA\n(4.32)\nn (q, r) = δmn .\n2f\nρ\n0\n\n– 15 –\n\n\fInserting the expansion (4.31) in (4.30), and using the orthonormality relations (4.32), we\nfind that each of the XnA (ω, q) fields obeys\n\u0002 2\n\u0003\n2\nω − ωnA\n(q) XnA (ω, q) = 0 ,\n(4.33)\nas expected. As explained in [12], the modes XnA (ω, q) with A = 1, 2 correspond in the gauge\ntheory to scalar and pseudoscalar mesons, respectively.\nBoth masses (for A = 1, 2) in eq. (4.30) behave as m2 ' −3 − m2 /r2 + * * * for r → ∞\nand m2 ' −c1 + c2 r2 + * * * for r → 0, where c1,2 are positive constants. It follows that the\ntwo independent solutions for X A behave as 1/r and 1/r3 for r → ∞ and as r0 and 1/r2 for\nr → 0. Thus in this case normalizability requires that X A ∼ 1/r3 for r → ∞ and regularity\nrequires that X A ∼ r0 for r → 0. As in the case of vector modes, for fixed q these two\nrequirements are compatible with each other only for a discrete set of energies ωnA (q).\nFig. 9 shows several numerically-obtained radial profiles of the lowest-lying mode φn=0 (q, r)\nfor several values of q. The corresponding values of the energy, ωn=0 (q), are given by the dispersion relation curves in fig. 2. These results correspond again to a D7-brane embedding\nwith asymptotic position m = 1.3. We observe the same limiting velocity vlim = 0.35 given\nby the local speed of light at the bottom of the brane, eq. (3.11).\n\n5. Quark energy loss in the N = 4 SYM plasma\nWe now turn to the main topic of this paper, namely the rate at which a heavy quark\ntraversing the N = 4 SYM plasma loses energy by Cherenkov-radiating mesons. As we will\nsee in detail below, the quark acts a source for the brane stress-energy tensor, defined as\n2 δSD7\nTab = − √\n.\n−g δg ab\n\n(5.1)\n\nThis leads to its non-conservation, ∇a Tab 6= 0, where ∇ is the covariant derivative defined by\nthe eight-dimensional worldvolume metric g. Under these circumstances the energy per unit\ntime deposited on the brane by the quark is given by\nZ\n√\ndE\n= − d7 x −g ∇a Ta0 ,\n(5.2)\ndt\nwhere the integral is taken over the brane's worldspace. For the reader's convenience, a short\nderivation of this formula is provided in appendix B. Our task below will be to evaluate this\nformula for the cases of vector and scalar mesons.\n5.1 Energy loss into vector mesons\nThe endpoint of an open string attached to the brane couples to the worldvolume gauge field,\nso the action (4.1) is modified in the presence of the quark to\nZ\nZ\n\u0001\n1 ab\ndxa\n4\n2 2\n8 √\nSvector = −TD7 L 2πls\nd x −g F Fab − dτ Aa\n,\n(5.3)\n4\ndτ\n\n– 16 –\n\n\f(A=1)\n\n/q\n\n8\n\nφ0\n\n(A=1)\n\nφ0\n\n30\n25\n20\n15\n10\n5\n0\n0.0\n\n0.5\n\n1.0\n\n6\n4\n2\n0\n0.0 0.5 1.0 1.5 2.0 2.5 3.0\n\n1.5\n\n√\n\n/q\n(A=2)\n\n25\n20\n15\n10\n5\n0\n0.0\n\nφ0\n\nφ0\n\n(A=2)\n\nr\n\n0.5\n\n1.0\n\n1.5\n\nqr\n\n6\n5\n4\n3\n2\n1\n0\n0.0 0.5 1.0 1.5 2.0 2.5 3.0\n√\n\nr\n\nqr\n\nFigure 9: Normalized scalar (top plots) and pseudoscalar (bottom plots) meson radial profiles φn (q, r)\nfor a D7-brane embedding with m = 1.3. The blue, violet, brown and green curves (i.e. bottom to\ntop on the left, top to bottom on the right) correspond to q = 1, 2, 4, 11, respectively. The rescalings\non the right-hand side correspond to those in appendix C. Note that the area under the curves is not\nunity because of the non-trivial measure in eq. (4.32).\n\nwhere, as usual, the worldvolume metric g contains no factors of L. The second term is\nthe familiar coupling between an Abelian gauge field and a charged particle moving along a\nworldline parametrized as xa (τ ).8 In order to work with a canonically normalized gauge field\nwe rescale A → eA with\n1\n8π 4\ne2 =\n=\n,\n(5.4)\nNc\nTD7 (2πls2 )2 L4\nso that the action becomes\nSvector = −\n\nZ\n\n√\n\n1\nd x −g F ab Fab − e\n4\n8\n\nZ\n\nd8 x Aa J a ,\n\n(5.5)\n\nwhere J a = δ (7) (x − x(τ )) ẋa . As anticipated in section 2, the coupling e between the quark\n√\nand the vector mesons is of order 1/ Nc , which justifies our neglect of terms of order higher\nthan quadratic in the action.\n8\n\nThe relative normalization between the two terms in the action can be confirmed by noting that it ensures\nthat supersymmetric BIon-like excitations on a D7-brane in flat space have tension 1/2π`2s , as in [20].\n\n– 17 –\n\n\fUsing the definition (5.1), the contribution from the gauge field to the brane's stressenergy tensor is easily calculated to be\n1\nTab = Fac Fb c − gab F 2 .\n4\n\n(5.6)\n\nIn the presence of the string endpoint, the equation of motion (4.2) for the gauge field is\nmodified to\n√\n√\n−g ∇a F ab = ∂a ( −g F ab ) = eJ b ,\n(5.7)\nwhich implies the non-conservation of the stress-energy tensor\n√\n−g ∇a Tab = eFba J a .\n\n(5.8)\n\nInserting this into the general formula (5.2) yields the rate at which the quark deposits energy\ninto the gauge field:\nZ\ndEvector\n= −e d3 xdrdΩ3 F0a J a .\n(5.9)\ndt\nThis formula has the simple interpretation of minus the work done on the quark by the gauge\nfield. In order to evaluate it, we need to specify the quark trajectory. For simplicity, we will\nassume that the quark moves with constant velocity along a straight line at constant radial\nand angular positions, so we write\nJ a = δ (3) (~x − ~v t) δ(r − r0 ) δ (3) (Ω − Ω0 ) × (1, ~v , 0, ~0) .\n\n(5.10)\n\nIn reality, r0 and v will of course decrease with time because of the black hole gravitational\npull and the energy loss. However, we will concentrate on the initial part of the trajectory\n(which is long provided the initial quark energy is large) for which r0 and v are approximately\nconstant [21] – see fig. 1. The delta-functions in (5.10) allow us to perform the integral in\n(5.9) and obtain\ndEvector\n= −ev i F0i (t, ~v t, r0 , Ω0 ) .\n(5.11)\ndt\nWe thus see that we need to compute the electric field sourced by the string endpoint at\nthe location of the string endpoint itself. To do so, we will solve the equation of motion (5.7)\nby expanding the gauge field in normalizable modes in the radial direction, as in section 4.\nNote that the fact that the quark is localized on the S 3 means that it will radiate both into\nS 3 singlets and non-singlets. A simple group theory argument shows that these two types of\ncontributions can be calculated separately and independently at the quadratic level at which\nwe are working. For the reasons explained in section 4, we will only calculate the energy loss\ninto singlet modes, whose form in Fourier-space we recall to be:\nAμ = Aμ (ω, q, r) ,\n\nAr = 0 ,\n\nAΩ3 = 0 .\n\n(5.12)\n\nWithout loss of generality, we choose ~q = (q, 0, 0) and ~v = (v cos θ, v sin θ, 0). After integrating\nover the S 3 , the relevant Fourier-space components of the current are then\nJ μ = 2πδ(ω − qv cos θ) δ(r − r0 ) × (1, v cos θ, v sin θ, 0) .\n\n– 18 –\n\n(5.13)\n\n\fWe are now ready to compute the energy loss into the transverse and longitudinal modes of\nthe gauge field.\nTransverse modes\nWith the choice above the only transverse mode of the gauge field excited by the source\nis A = A2 , which couples to J = J 2 . The equation of motion (4.6) for this mode now\nbecomes\n!\n!\np\n3\n2 f ̃\n2f\nf r 3 ∂r A\nr\nω\nq\np\n∂r\n+ 1 + Ṙ2 4\nA = ẽJ ,\n(5.14)\n−\nρ\nf\n2\nf ̃\n2 1 + Ṙ\nwhere ẽ = e/Ω3 and the volume factor Ω3 = 2π 2 comes from integration over the S 3 . We now\nfollow section 4 and solve (5.14) by expanding A as in (4.7), where the radial eigenfunctions\n{ξn (q, r)} satisfy exactly the same properties as in that section. In this case, inserting the\nexpansion (4.7) in (5.14), and using the eigenstate equation and the orthonormality relations,\nwe find that eq. (4.10) becomes\n\u0002 2\n\u0003\nω − ωn2 (q) An (ω, q) = ẽJn (ω, q) ,\n(5.15)\nwhere\nJn (ω, q) =\n\nZ\n\ndrJ (ω, q)ξn (q, r) = 2πδ (ω − qv cos θ) v sin θ ξn (q, r0 ) .\n\n(5.16)\n\nAn important fact implied by eqs. (5.15)-(5.16) is that each of the four-dimensional meson\nmodes An (ω, q) couples to the quark with an effective strength proportional to the value of\nξn at the location of the quark:\neeff (q, r0 ) = e ξn (q, r0 ) .\n\n(5.17)\n\nThe intuition behind this is that the radial profiles ξn (q, r) roughly play the role of a 'wave\nfunction' in the fifth dimension for the corresponding meson mode An (ω, q). This fact will\nplay an important role below.\nWith retarded boundary conditions, as appropriate for the reaction to the quark's passage, the solution of eq. (5.15) is\nAn (ω, q) =\n\nẽJn (ω, q)\n.\n(ω + i\u000f)2 − ωn2 (q)\n\n(5.18)\n\nIn order to evaluate the energy loss (5.11), we first express F02 (t, ~v t, r0 , Ω0 ) as an integral over\nits Fourier components:9\ndEtrans\n= −ev 2 ∂t A2 (t, ~v t, r0 , Ω0 )\ndt\nZ\ndωd3 q\n=\n(−ev sin θ)(−iω) A(ω, q, r0 ) e−iωt eiq*x\n(2π)4\n9\n\n~\nx=~v t\n\n.\n\nNote that the singlet mode is independent of the S 3 position Ω0 of the string endpoint.\n\n– 19 –\n\n(5.19)\n\n\fInserting the expansion (4.7) we obtain\ndEtrans X\n=\ndt\nn\n\nZ\n\ndωd3 q\n(ev sin θ)(iω) An (ω, q)ξn (q, r0 ) e−iωt eitq*v .\n(2π)4\n\n(5.20)\n\nSubstituting the solution (5.18) for An and using the delta-function in (5.16) to integrate over\nfrequencies, we arrive at\ndEtrans X\n=\ndt\nn\n\nZ\n\nd3 q\nẽv sin θ\nξn2 (q, r0 ) .\n(ev sin θ)(iqv cos θ)\n3\n(2π)\n(qv cos θ + i\u000f)2 − ωn2 (q)\n\n(5.21)\n\nNote that the two exponentials have cancelled out upon setting ω = qv cos θ. In order to\nintegrate over momenta we set d3 q = 2πq 2 dqdz, where z = cos θ, so that the integral above\nbecomes\nZ\nZ 1\ndEtrans X e2 v ∞ dq 2\ndz\nz(1 − z 2 )\n=\nq ξn (q, r0 )\n,\n(5.22)\n−\n2\n2\ndt\nΩ3 0 2π\n−1 2πi (z + i\u000f) − zn (q)\nn\nwhere zn (q) = vn (q)/v, and vn (q) = ωn (q)/q is the phase velocity of the n-th mode.\nThe integral over z can be performed in\nz\nthe complex plane by considering the contour shown in fig. 10. The integral of interest\nΓ1\ncorresponds to the integral over the segment\nΓ1 . In the limit \u000f → 0, this coincides with\n2!\n−zn − i!\nzn − i!\nthe integral over Γ2 , and the contribution\nfrom the vertical sides of the contour vanΓ2\nishes. Thus in this limit the integral over\nz in (5.22) equals 1/2 times the contour integral of fig. 10. Now consider the poles of Figure 10: Contour in the complex plane used to\nevaluate the z-integral in eq. (5.22).\nthe integrand, which lie at z = ±zn − i\u000f. If\nv < vn (q) then zn (q) > 1 and the poles lie\noutside the contour, so the integral vanishes. In contrast, if v > vn (q), then both poles lie\ninside the contour and they yield identical contributions equal to (1 − zn2 ). Taking into consideration the extra minus sign coming from the orientation of the contour, the final result is\nthus\n\u0012\n\u0013 \u0012\n\u0013\nZ\ndEtrans X e2 v ∞ dq 2\nvn2 (q)\nvn2 (q)\n=\nq ξ (q, r0 ) 1 −\nΘ 1−\n.\n(5.23)\ndt\n2Ω3 0 2π n\nv\nv\nn\nWe see that the energy loss is a discrete sum over all mesons, as well as an integral over all\nthe momentum modes of each meson into which the quark is allowed to radiate. As expected\nfor Cherenkov radiation, this can only happen if the velocity v of the quark exceeds the phase\nvelocity of the corresponding momentum mode, vn (q). For example, in the case of transverse\nvector mesons, the quark can only emit momentum modes to the right of the dashed, vertical\nline in fig. 2. This cut-off is implemented by the Heaviside function in eq. (5.23).\n\n– 20 –\n\n\f3.5\n3.0\n2.5\n2.0\n1.5\n1.0\n0.5\n0.0\n\n25\n20\nNc dE\n(2πT )2 dt\n\nNc dE\n(2πT )2 dt\n\nSince the radial profiles ξn (q, r0 ) and the dispersion relations vn (q) entering eq. (5.23) are\nonly known numerically, the energy loss must also be evaluated numerically. The result for\nthe n = 0 term in the sum is plotted in fig. 11. As one may expect, for fixed r0 the energy\nloss increases monotonically with v up to the maximum allowed value of v, the local speed\nof light at r0 . In other words, a quark sitting at a fixed radial position radiates more the\nhigher its velocity is. As r0 decreases, the limiting velocity of the quark approaches that of\nthe mesons from above. Therefore the quark and the meson dispersion relation curves cross\nat a higher momentum, i.e. the vertical dashed line in fig. 2 moves to the right. This means\nthat the characteristic momentum qchar of the modes contributing to the integral in (5.23)\nincreases. As r0 → 0 these modes become increasingly peaked at small r (see fig. 6(left)),\nand their effective couplings to the quark eeff (qchar , r0 ) diverge. This explains why the energy\nloss at the maximum allowed value of the velocity diverges as r0 → 0. As we will discuss in\nsection 7, however, this mathematical divergence is removed by physical effects that we have\nnot taken into account.\n\n15\n10\n5\n0\n0.88 0.90 0.92 0.94 0.96 0.98 1.00\n\n0.4 0.5 0.6 0.7 0.8 0.9 1.0\nv\n\nv\n\nFigure 11: Energy loss into the transverse vector mode A(n=0) for an embedding with m = 1.32, R0 =\n1.2 (left) and m = 2.0, R0 = 2.0 (right). The continuous curves correspond (from top to bottom) to\nr0 = 0.86, 0.97, 1.10, 1.25, 1.45 (left) and to r0 = 1.50, 1.69, 1.91, 2.18, 2.52 (right). The dotted curve is\ndefined by the endpoints of the constant-r0 curves.\n\nLongitudinal modes\nIn the presence of the source eq. (4.11) becomes\n∂r\n\n√\n\n\u0001\n√\n−gg rr g 00 ∂r A0 + iq −gg 11 g 00 E = ẽJ 0 .\n\n(5.24)\n\nEq. (4.12) remains unchanged, and together with the eq. above it yields\n−iq ∂r\n\n\u0012√\n\n−g g rr g 00 g 11\n∂r E\nq 2 g 11 + w2 g 00\n\n\u0013\n\n√\n+ iq −g g 11 g 00 E = ẽJ 0 .\n\n(5.25)\n\nWe now introduce a new field Φ defined as in eq. (4.15), but in this case the inverse relation\n\n– 21 –\n\n\f(4.16) is modified by the source:\nE=√\n\n1\n1\n∂r Φ + √\nẽJ 0 .\n11\n00\n−g g g\niq −g g 11 g 00\n\nSubstituting back into eq. (4.15) we find the new equation of motion for Φ:\n\u0012\n\u0013\n\u0012\n\u0013\n1\nq 2 g 11 + w2 g 00\n1\n1\n0\n√\n√\n−∂r √\n∂\nΦ\n+\nΦ\n=\nẽJ\n.\n∂\nr\nr\n−g g 11 g 00\n−g g rr g 00 g 11\niq\n−g g 11 g 00\n\n(5.26)\n\n(5.27)\n\nInserting the explicit form of the metric functions, we finally arrive at\n!\n!\np\n\u0012\n\u0013\n2\n4\nf ρ4\n1 + Ṙ2\nf\nf\nρ\n1\np\np\n∂r\n∂r Φ + 2\nw2 − q 2 Φ = − ∂r\nẽJ 0 . (5.28)\n3\n2\n ̃\nf\nr\niq\n2\n2\n3\n3\n ̃\n ̃\nf\nf r 1 + Ṙ\nf r 1 + Ṙ\nWe now follow section 4 and solve (5.28) by expanding Φ as in (4.19), where the radial\neigenfunctions {φn (q, r)} satisfy exactly the same properties as in that section. In this case,\ninserting the expansion (4.19) in (5.28), and using the eigenstate equation and the orthonormality relations, we find that eq. (4.21) becomes\n\u0002\n\n\u0003\nω 2 − ωn2 (q) Φn (ω, q) = ẽJn0 (ω, q) ,\n\n(5.29)\n\nwhose solution with retarded boundary conditions is\nΦn (ω, q) =\n\nẽJn0 (ω, q)\n.\n(ω + i\u000f)2 − ωn2 (q)\n\nThe coefficients Jn0 are given (after integration by parts) by\nZ ∞\n1\nf ρ4\n2π\n0\np\nJn (ω, q) =\ndr\nδ(ω − qv cos θ)Fn (q, r0 ) ,\nJ 0 (ω, q) ∂r φn (q, r) =\niq f ̃r3 1 + Ṙ2\niq\n0\nwith\nFn (q, r) = − √\n\nf ρ4\n1\np\n∂\nφ\n(q,\nr)\n=\n∂r φn (q, r) .\nr n\n−g g 11 g 00\nf ̃r3 1 + Ṙ2\n\n(5.30)\n\n(5.31)\n\n(5.32)\n\nNote that the coefficients Fn appear in the expansion of the electric field (5.26), i.e.\nE(ω, q, r) = −\n\nX\n\nΦn (ω, q)Fn (q, r) +\n\nn\n\niq\n\n√\n\n1\nẽJ 0 (ω, q, r) .\n−g g 11 g 00\n\n(5.33)\n\nAs in the case of transverse modes, we see from eq. (5.29) that the effective coupling between\na longitudinal meson Φn (ω, q) and the quark is determined by the radial wave function of the\nmeson, in this case\neeff (q, r0 ) = e Fn (q, r0 ) .\n(5.34)\nOur task now is to compute the rate of energy loss into longitudinal meson modes. For\nthis purpose, eq. (5.11) instructs us to evaluate the electric field at the location of the quark.\n\n– 22 –\n\n\fIf we naively do so using the expression (5.26) for E then the second term gives a divergent\nresult, since J 0 (r0 ) ∝ δ(0). However, this divergence is unphysical: if one replaces the deltafunction by a smooth charge distribution, then the integral over space in (5.9) vanishes.\nIndeed, suppose that the current (5.13) is replaced by\nJ a = %(3) (~x − ~v t, r, Ω) × (1, ~v , 0, ~0) ,\n\n(5.35)\n\nwhere % is a smooth function. Then in Fourier space\nJ a = 2π δ(ω − ~q * ~v ) %(3) (~q, r, Ω) × (1, ~v , 0, ~0)\nand the energy loss (5.9) is\nZ\nZ\ndE\n= −e drdΩ d3 x E(t, ~x, r, Ω) * J(t, ~x, r, Ω)\ndt\nZ\nZ\nZ\ndωdω̃ −iωt−iω̃t\nd3 q\n= −e drdΩ\ne\nz E(ω̃, −~q, r, Ω) J 1 (ω, ~q, r, Ω) ,\n(2π)2\n(2π)3\n\n(5.36)\n\n(5.37)\n\nwhere as usual z = cos θ is the relative angle between ~q and ~v and d3 q = 2πq 2 dqdz. If we\nsubstitute the term in E that is proportional to J 0 we see that the integrand is proportional\nto\n1\nδ(ω̃ + qvz) δ(ω − qvz) %(−~q, r, Ω) %(~q, r, Ω) z .\n(5.38)\niq\nThis is odd under ~q → −~q (since ω and ω̃ are dummy variables) and therefore the integral\nover z vanishes.\nWe therefore conclude that we can neglect the second term in (5.33) in order to evaluate\n(5.11). Following the previous section we have\ndElong\n= ev 1 E(t, ~v t, r0 , Ω0 )\ndt\nX Z dωd3 q\n=\n−\n(ev cos θ) Φn (ω, q)Fn (q, r0 ) e−iωt eitq*v\n4\n(2π)\nn\nX Z d3 q\nẽ\n1\n=\n−\n(ev cos θ)\nFn2 (q, r0 )\n2\n3\n2\n(2π)\niq\n(qv cos θ + i\u000f) − ωn (q)\nn\nZ 1\nX e2 Z ∞ dq 1\ndz\nz\n2\n=\n−\nFn (q, r0 )\n.\n2\n2\nΩ3 v 0 2π q\n−1 2πi (z + i\u000f) − zn (q)\nn\n\n(5.39)\n\nThe z-integral can be evaluated using the same contour of fig. 10. In this case each pole\ncontributes -1/2, so the final result is\n\u0012\n\u0013\nZ ∞\ndElong X e2\ndq 1 2\nvn2 (q)\n=\nF (q, r0 ) Θ 1 −\n.\n(5.40)\ndt\n2Ω3 v 0 2π q n\nv\nn\nThe energy loss into the n = 0 mode is shown in fig. 12. The same comments as in the\ncase of transverse modes apply here.\n\n– 23 –\n\n\f25\n20\nNc dE\n(2πT )2 dt\n\nNc dE\n(2πT )2 dt\n\n3.5\n3.0\n2.5\n2.0\n1.5\n1.0\n0.5\n0.0\n\n15\n10\n5\n\n0.4 0.5 0.6 0.7 0.8 0.9 1.0\nv\n\n0\n0.88 0.90 0.92 0.94 0.96 0.98 1.00\nv\n\nFigure 12: Energy loss into the longitudinal vector mode Φ(n=0) for an embedding with m =\n1.32, R0 = 1.2 (left) and m = 2.0, R0 = 2.0 (right). The continuous curves correspond (from top\nto bottom) to r0 = 0.86, 0.97, 1.10, 1.25, 1.45 (left) and to r0 = 1.50, 1.69, 1.91, 2.18, 2.52 (right). The\ndotted curve is defined by the endpoints of the constant-r0 curves.\n\n5.2 Energy loss into scalar mesons\nThe endpoint of an open string attached to the brane couples to the worldvolume scalar fields,\nso in the presence of the quark the action (4.23) is modified to\n\u0014\n\u0015\nZ\n1 ab\n1 2\n8 √\n8\nA\nB\nA B\nd x −g g ∂a X ∂b X GAB + mAB (x)X X\nSscalar = −TD7 L\n2\n2\nZ\n2\np\nL\ndτ −ẋ2 GAB X A nB ,\n(5.41)\n−\n2π`2s\nwhere ẋ2 = gab ẋa ẋb and nA is the unit vector that is tangent to the string and orthogonal\nto the brane at the string endpoint. As usual, in the last term we have explicitly factored\nout the L-dependence associated to the spacetime metric (3.2). The square-root factor in the\nlast term is necessary to make the integrand a scalar density on the worldline of the string\nendpoint, which is contained in the brane's worldvolume. We emphasize that the indices of\nẋa are not contracted with the gauge theory metric ηab but with the D7-brane metric gab .\nThe relative normalization between the two lines in (5.41) can be confirmed as described\nin footnote 8. As explained in appendix A, the boundary condition at the string endpoint\nimplies that the string ends orthogonally on the brane. The unit normal in the last term of\nthe action (5.41) means that the string couples to the scalar that parametrizes the direction\nalong which the string pulls on the brane, as one may intuitively expect.\n√\nIn order to work with canonically normalized fields we rescale X A → TD7 L8 X A so that\nthe action becomes\n\u0014\n\u0015\nZ\nZ\n√\n1\n1\nSscalar = − d8 x −g g ab ∂a X A ∂b X B GAB + m2AB (x)X A X B − e d8 x JA X A , (5.42)\n2\n2\n√\nwhere JA = δ (7) (x − x(τ )) −ẋ2 GAB nB and e is the same coupling constant defined in (5.4).\nSince the scalars do not interact with each other, they give independent contributions to the\n\n– 24 –\n\n\fstress tensor of the brane. Using the definition (5.1), the contribution from either scalar field\nis easily found to be\nh\ni\n1\nδm2\nTab = ∇a X∇b X − gab (∇X)2 + m2 X 2 + X 2 ab .\n2\nδg\n\n(5.43)\n\nFor ease of notation, in this equation we have dropped the superindex 'A' on the scalar, and\nwe will continue to do so below. The last term originates from the non-trivial dependence\nof the scalar masses (4.24) on the metric. Fortunately, we will see that we do not need to\nevaluate this term explicitly in order to compute the divergence of the stress-tensor.\nIn the presence of the string endpoint, the equation of motion (4.28) for the scalars is\nmodified to\n\u0001\n√\n−g ∇2 − m2 X = eJ .\n(5.44)\nUsing this, the divergence of the stress tensor takes the form\n\u0012\n\u0013\n√\nδm2\n−g ∇a Tab = J ∇b X − X 2 ∇b m + ∇a X 2 ab .\nδg\n\n(5.45)\n\nThe second term on the right-hand side is due to the possible spacetime dependence of the\nscalar masses m(x), but it vanishes identically for the case of interest here, b = 0, because of\nthe time-translation invariance of the theory. The last term on the right-hand side vanishes\nwhen evaluated on a solution of the equations of motion, even in the presence of the source\nJ. To see this, recall that the stress tensor must be identically conserved in the absence of\nthe source because of the diffeomorphism invariance of the brane's worldvolume theory. This\nmeans, in particular, that when J = 0 we have\n\u0012 2\u0013\n\u0012 2\u0013\nδm\na δm\nX∇\n+2\n∇a X = 0 .\n(5.46)\na0\nδg\nδg a0\nThe key point now is that this equation is linear in X. Since the solution in the presence\nof the source is a linear supersposition of solutions of the source-less equation, linearity of\n(5.46) implies that this expression also vanishes for solutions of eq. (5.44) with J 6= 0. We\nthus conclude that (the time component of) the non-conservation of the stress-tensor in the\nscalar sector takes the form\n√\n−g ∇a Ta0 = J ∇0 X .\n(5.47)\nAs in the case of vector mesons, we consider a rectilinear quark motion with constant\nvelocity, in which case\np\nJ = −ẋ2 (r0 ) δ (3) (~x − ~v t) δ(r − r0 ) δ (3) (Ω − Ω0 ) .\n(5.48)\nNote that, although the velocity v is the quark velocity as seen by a gauge theory observer,\n√\nthe prefactor above is not just 1 − v 2 but depends non-trivially on the quark position in\nthe radial direction through\np\np\n−ẋ2 (r0 ) = −g00 (r0 ) − g11 (r0 )v 2 .\n(5.49)\n\n– 25 –\n\n\fBecause of the black hole redshift, for fixed r0 this factor vanishes before v reaches the speed\nof light, i.e. at v < 1. As we will see, this fact is responsible for a qualitative difference\nbetween the energy radiated into scalar and into vector mesons.\nFollowing section 4.2, we focus on the zero-mode of X on the S 3 , and work with its\nFourier components X(ω, q, r), for which the equation of motion takes the form\n\u0001 √\n\u0001\n√\n∂r\n−g g rr ∂r X − −g g 00 ω 2 + g 11 q 2 + m2 X = ẽJ ,\n(5.50)\nwhere the relevant Fourier-space components of the source are\np\nJ = −ẋ2 (r0 ) 2πδ(ω − qv cos θ) δ(r − r0 ) ,\n\n(5.51)\n\nand as usual ẽ = e/Ω3 . We solve (5.50) by expanding X as in eq. (4.30). In the presence of\nthe source, the equation obeyed by the Xn mode is\n\u0002 2\n\u0003\nω − ωn2 (q) Xn (ω, q) = ẽJn (ω, q) ,\n(5.52)\nwhere\nZ\nJn (ω, q) =\n\ndrJ(ω, q)φn (q, r) =\n\np\n−ẋ2 (r0 ) 2πδ(ω − qv cos θ)φn (q, r0 ) .\n\n(5.53)\n\nWith retarded boundary conditions, as appropriate for the reaction to the quark's passage,\neq. (5.52) yields\nẽJn (ω, q)\n.\n(5.54)\nXn (ω, q) =\n(ω + i\u000f)2 − ωn2 (q)\n\nAs in the case of vector modes, we see from eq. (5.52) that the effective coupling between a\nscalar meson Xn (ω, q) and the quark is determined by the radial wave function of the meson,\nin this case\np\neeff (q, r0 ) = e −ẋ2 (r0 ) φn (q, r0 ) .\n(5.55)\n\nWe are now ready to compute the rate of energy deposition into scalar mesons. From\neqs. (5.2) and (5.47) we have\nZ\np\ndEscalar\n(5.56)\n= −e d3 xdrdΩ3 ẊJ = −e −ẋ2 (r0 ) Ẋ(t, ~v t, r0 , Ω0 ) .\ndt\nFollowing the steps of the vector meson case we find:\nZ\nX p\ndEscalar\ndωd3 q\n2\n=\n−e −ẋ (r0 )\n(−iω) Xn (ω, q)φn (q, r0 ) e−iωt eitq*v\n4\ndt\n(2π)\nn\nZ\nX\n\u0002 2\n\u0003\nd3 q\nẽ\n=\n−e −ẋ (r0 )\n(−iqv cos θ)\nφ2n (q, r0 )\n2\n3\n2\n(2π)\n(qv cos θ + i\u000f) − ωn (q)\nn\nZ\nZ 1\n∞\n2\nX e \u0002\n\u0003\ndq\ndz\nz\n2\n2\n=\n−\nq φn (q, r0 )\n−ẋ (r0 )\n2\n2\nΩ3 v\n2π\n0\n−1 2πi (z + i\u000f) − zn (q)\nn\n\u0012\n\u0013\nZ\nX e2 \u0002\n\u0003 ∞ dq\nvn2 (q)\n2\n2\n−ẋ (r0 )\nq φn (q, r0 ) Θ 1 −\n=\n.\n(5.57)\n2Ω3 v\n2π\nv\n0\nn\n\n– 26 –\n\n\f3.0\n2.5\n2.0\n1.5\n1.0\n0.5\n0.0\n\nNc dE\n(2πT )2 dt\n\nNc dE\n(2πT )2 dt\n\nThe result for the energy loss into the lowest-lying scalar and pseudoscalar modes is shown\nin figs. 13 and 14. The main difference with respect to the case of vector mesons is the fact\nthat the constant-r0 curves do not rise monotonically as v increases, but instead they vanish\nwhen v reaches the local speed of light at r0 . The reason for this is of course the factor in\neq. (5.49).\n\n0.4 0.5 0.6 0.7 0.8 0.9 1.0\n\n10\n8\n6\n4\n2\n0\n0.88 0.90 0.92 0.94 0.96 0.98 1.00\n\nv\n\nv\n(A=1)\n\nFigure 13: Energy loss into the scalar mode φ(n=0) for an embedding with m = 1.32, R0 = 1.2\n(left) and m = 2.0, R0 = 2.0 (right). The continuous curves correspond (from top to bottom) to\nr0 = 0.86, 0.97, 1.10, 1.25, 1.45 (left) and to r0 = 1.50, 1.69, 1.91, 2.18, 2.52 (right). The dotted curve is\ndefined by the maxima of the constant-r0 curves.\n\n2.0\nNc dE\n(2πT )2 dt\n\nNc dE\n(2πT )2 dt\n\n1.5\n1.0\n0.5\n0.0\n\n0.4 0.5 0.6 0.7 0.8 0.9 1.0\n\n10\n8\n6\n4\n2\n0\n0.88 0.90 0.92 0.94 0.96 0.98 1.00\nv\n\nv\n(A=2)\n\nFigure 14: Energy loss into the pseudoscalar mode φ(n=0) for an embedding with m = 1.32, R0 = 1.2\n(left-hand side plots) and m = 2.0, R0 = 2.0 (right-hand side plots). The continuous curves correspond\n(from top to bottom) to r0 = 0.86, 0.97, 1.10, 1.25, 1.45 (left) and to r0 = 1.50, 1.69, 1.91, 2.18, 2.52\n(right). The dotted curve is defined by the maxima of the constant-r0 curves.\n\n6. Phenomenological implications for HIC experiments\nAs is clear from our general discussion in section 2, the mechanism of Cherenkov energy loss\ndepends only on two qualitative properties encoded in the dispersion relations of fig. 2: the\nfact that heavy mesons remain bound in the gauge theory plasma, and the fact that their\n\n– 27 –\n\n\flimiting velocity in the plasma is subluminal. Both properties can be motivated in QCD\nirrespectively of whether or not a string dual of QCD exists. The first property is suggested\nby the fact that sufficiently heavy mesons are smaller than the screening length in the plasma\n[22], and is supported by calculations of both the static quark-antiquark potential [23] and of\nMinkowski-space spectral functions in lattice-regularized QCD [24].10 The second property,\nwhich goes back to ref. [26], is suggested by the fact that moving mesons see a boosted, higher\nenergy density that will melt them if they move sufficiently fast [27].11\nRigorously verifying these two properties in QCD is not presently feasible. For this reason\nit is reassuring that, as we explained in section 2, they are both realized in all gauge theory\nplasmas with a gravity dual in the large-Nc , strong coupling limit. In this section we will\nassume that the two properties are also realized in the QGP and extract some phenomenological consequences that might be observable in heavy ion collisions.12 Since the heavier the\nmeson the more perturbative its properties become, we expect that our conclusions are more\nlikely to be applicable to the charmonium rather than to the bottomonium sector.\nAn interesting feature of the energy loss by Cherenkov radiation is that, unlike other\nenergy-loss mechanisms, it is largely independent of the details of the quark excited state,\nsuch as the precise features of the gluon cloud around the quark, etc. In the gravity description\nthese details would be encoded in the precise profile of the entire string, but the Cherenkov\nemission only depends on the trajectory of the string endpoint. This leads to a dramatic\nsimplification which, with the further approximation of rectilinear uniform motion, reduces\nthe parameters controlling the energy loss to two simple ones: the string endpoint velocity v\nand its radial position r0 . The former is just the velocity of the quark in the gauge theory,\nwhereas the second roughly measures the size of the gluon cloud that dresses the quark [15].\nIn order to obtain a ballpark estimate of the magnitude of the energy loss, we will assume\nthat in a typical collision quarks are produced with order-one values of r0 . Under these\ncircumstances the energy loss is of order unity in units of (2πT )2 /Nc , which for a temperature\nrange of T = 200 − 400 MeV and Nc = 3 leads to dE/dx ≈ 2 − 8 GeV/fm. This is is of the\nsame order of magnitude as other mechanisms of energy loss in the plasma; for example, the\nBDMPS radiative energy loss dE/dx = αs CF q̂L/2 yields values of dE/dx = 7 − 40 GeV/fm\nfor q̂ = 1 − 5 GeV 2 /fm, αs = 0.3 and L ≈ 6 fm. Since our gravity calculation is strictly valid\nonly in the infinite-quark energy limit (because of the linear trajectory approximation), we\nexpect that our estimate is more likely to be applicable to highly energetic quarks at LHC\nrather than to those at RHIC.\nEven if in the QGP the magnitude of Cherenkov energy loss turns out to be subdominant\nwith respect to other mechanisms, its velocity dependence and its geometric features may still\nmake it identifiable. Indeed, Cherenkov energy loss would only occur for quarks moving at\n10\n\nIn some models light mesons also remain bound above Tc by Coulomb-like forces [25].\nAn alternative possibility would be that meson states with q above some upper bound cease to exist. In\nany event, our conclusions rely on meson states existing (with a sufficiently narrow width) only up to some\nmoderate q for which q & ω(q).\n12\nImplications for photon production have been discussed in [28], and for deep inelastic scattering in [29].\n11\n\n– 28 –\n\n\fvelocities v > vlim , with vlim the limiting velocity of the corresponding meson in the plasma.\nThe presence of such a velocity threshold is the defining characteristic of Cherenkov energy\nloss. The precise velocity at which the mechanism starts to operate may actually be higher\nthan vlim in some cases, since the additional requirement that the energy of the quark be equal\nor larger than the in-medium mass of the meson must also be met. A related conclusion of\nour calculation in the N = 4 model is that the energy loss decreases as the velocity of the\nquark approaches the speed of light. This is in fact a universal feature of all plasmas with\na gravity dual. The reason is that the quark velocity can approach unity only in the limit\nr0 → ∞, in which the effective couplings (5.17), (5.34) and (5.55) between the quark and\nthe mesons vanish because the meson radial wave functions are normalizable. In fact, in the\ncase of scalar mesons the energy loss ceases completely at some subluminal velocity at which\n(5.49) vanishes. If these properties also hold in QCD then Cherenkov energy loss may be\nidentifiable because it only operates in a limited range of quark velocities.\nCherenkov mesons would be radiated at a characteristic angle cos θc = vlim /v with respect\nto the emitting quark, where v is the velocity of the quark. Taking the gravity result as\nguidance, vlim could be as low as vlim = 0.35 at the meson dissociation temperature [10],\ncorresponding to an angle as large as θc ≈ 1.21 rad. This would result in an excess of\nheavy mesons associated to high-energy quarks passing through the plasma. Our estimate\nof the energy loss suggests that the number of emitted J/ψ's, for example, could range from\none to three per fm. This emission pattern is similar to the emission of sound waves by\nan energetic parton [30] in that both effects lead to a non-trivial angular structure. One\nimportant difference, however, is that the radiated heavy mesons would not thermalize and\nhence would not be part of a hydrodynamic shock wave. As in the Mach cone case, the\nmeson emission pattern could be reflected in azimuthal dihadron correlations triggered by a\nhigh-pT hadron. Due to surface bias, the energetic parton in the triggered direction is hardly\nmodified, while the one propagating in the opposite direction moves through a significant\namount of medium, emitting heavy mesons. Thus, under the above assumptions, the dihadron\ndistribution with an associated J/ψ would have a ring-like structure peaked at an angle\nθ ≈ π − θc .\nA final observation is that Cherenkov energy loss also has a non-trivial temperature\ndependence, since it requires that there are meson-like states in the plasma, and therefore it\ndoes not take place at temperatures above the meson dissociation temperature. Similarly, it is\nreasonable to assume that it does not occur at temperatures below Tc , since in this case we do\nnot expect the meson dispersion relation to become spacelike.13 Under these circumstances,\nthe Cherenkov mechanism is only effective over a limited range of temperatures Tc < T < Tdiss\nwhich, if Tdiss & 1.2Tc as in [31], is a narrow interval. As was pointed out in [32], a mechanism\nof energy loss which is confined to a narrow range of temperatures in the vicinity of Tc\nconcentrates the emission of energetic probes to a very narrow layer on the collision geometry\nand is able to explain v2 -data at high pT at RHIC [33]. Provided that the meson dissociation\n13\n\nThis assumption is certainly correct for plasmas with a gravity dual, since the corresponding geometry\ndoes not include a black hole horizon if T < Tc .\n\n– 29 –\n\n\ftemperature Tdiss is not much larger than Tc , the radiation of Cherenkov mesons is one such\nmechanism.\n\n7. Discussion\nCherenkov emission of mesons [34] and gluons [35] in QCD has been considered before. Although some of the underlying physics is similar, the mechanism we have discussed is different\nin several respects. First, it operates in the QGP, as opposed to in a hadronic medium as in\n[34], and the radiated particles are colourless mesons, as opposed to gluons as in [35]. Second,\nthe gauge/string duality provides a large class of completely explicit examples (although none\nof them includes QCD) in which this mechanism is realized and in which the energy loss can\nbe calculated without further model assumptions.\nFigs. 11, 12, 13 and 14 show the rate of energy deposition into vector and scalar modes on\nthe brane. All these figures share the property that the energy loss diverges as 1/r06 (as shown\nanalytically in appendix D) in the limit r0 → 0. However, this mathematical divergence is\nremoved by physical effects we have not taken into account. For example, for sufficiently\nlarge q the radial profile of the mesons becomes of order the string length and stringy effects\nbecome important [17]. Also, mesons acquire widths Γ ∝ q 2 at large q [36] and can no\nlonger be treated as well defined quasiparticles. Finally, the approximation of a constant-v,\nconstant-r0 trajectory ceases to be valid whenever the energy loss rate becomes large.\n\nNc dE\n(2πT )2 dt\n\n20\n15\n10\n5\n0\n\n0.4\n\n0.5\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1.0\n\nv\nFigure 15: Energy loss into the transverse vector mode A(n=0) for an embedding with m =\n1.32, R0 = 1.2 (left-hand side curves) and m = 2.0, R0 = 2.0 (right-hand side curves). The continuous curves correspond (from top to bottom) to r0 = 0.58, 0.70, 0.83, 0.98, 1.18 (left-hand side) and\nto r0 = 1.50, 1.69, 1.91, 2.18, 2.52 (right-hand side). The dotted curve is defined by the endpoints of\nthe constant-r0 curves.\n\nFigs. 11, 12, 13 and 14 also illustrate the simple dependence of the energy loss on the ratio\nm ∝ Mq /T . Increasing m decreases the redshift at the bottom of the branes, and therefore\nincreases the limiting velocity of mesons, vlim , at which quark energy loss via Cherenkov\nemission starts to operate. This means that the energy loss becomes concentrated on a\nnarrower range of velocities, closer to unity, as m is increased, but the structure of the curves\n\n– 30 –\n\n\f10\nNc dE\n(2πT )2 dt\n\n8\n6\n4\n2\n0\n\n0.4\n\n0.5\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1.0\n\nv\n(A=1)\n\nFigure 16: Energy loss into the scalar mode φ(n=0) for an embedding with m = 1.32, R0 = 1.2\n(left-hand side curves) and m = 2.0, R0 = 2.0 (right-hand side curves). The continuous curves\ncorrespond (from top to bottom) to r0 = 0.64, 0.74, 0.86, 1.00, 1.18 (left-hand side) and to r0 =\n1.50, 1.69, 1.91, 2.18, 2.52 (right-hand side). The dotted curve is defined by the maxima of the constantr0 curves.\n\nis roughly the same up to a rescaling. This can be seen in the figures above by comparing the\nenergy loss for m = 1.2 (left-hand side) and m = 2.0 (right-hand side). The concentration\nof energy loss on a narrower velocity interval is also illustrated in figs. 15 and 16, where the\nresult for both values of m is shown simultaneously on the same plot (for the transverse vector\nand scalar modes).\nIn this paper we have concentrated on the case Nf = 1, i.e. we have assumed the presence\nof a single heavy flavour. Consider now a theory with multiple heavy quarks, such as QCD\nwith c and b quarks, for example. In the string description this corresponds to a situation with\nNf > 1 D-branes. If all quarks have identical masses (and R-symmetry quantum numbers)\nthen the D-branes are all coincident and their worldvolume theory is described by a non ̃\nAbelian U (Nf ) theory, corresponding to the fact that mesons mf f come in multiplets that\ntransform in the adjoint representation of U (Nf ). A quark with flavour f then may emit any\nof the Nf mesons with flavour f f ̃, with f ̃ = 1, . . . , Nf . Under these circumstances the energy\nloss is enhanced by a power of Nf .14 Note that if the resulting meson has f ̃ 6= f then the\nquark must change flavour f → f ̃ in the emission process, as shown in fig. 17(left). A process\nin which the quark does not change flavour is also possible, as shown in fig. 17(right), but\nthis requires the emission of at least two mesons and is therefore further suppressed at large\nNc .\nConsider now the opposite situation, more analogous to QCD, in which the heavy quarks\nhave different masses, so that the D-branes in the string description do not overlap. This is\ndepicted in figs. 18, 19 and 20, which show the string description of the emission processes of\nfigs. 17(left) and 17(right), respectively. Figs. 18 and 19 correspond to emissions with f ̃ 6= f ,\nwhereas fig. 20 describes the emission of an f f -meson. In this geometric picture the necessity\n14\n\nThis corrects the corresponding statement in ref. [1].\n\n– 31 –\n\n\ff\nf ̃\n\nf\nf ̃\n\nf\n\nf\nf ̃\n\nf\n\nf ̃\n\nf\n\nFigure 17: Meson emissions by a quark in a theory with multiple flavours.\n\nof a two-meson emission in the case f ̃ 6= f in order to preserve the quark flavour is due to the\nfact that the string must break twice in order to stay attached to the same brane – see fig. 19.\nSince string breaking is suppressed at large Nc , this process is subleading with respect to onemeson emission. In any case, since an open string must always have its endpoints attached to\na brane, the emission of one or multiple mesons with f ̃ 6= f by a quark of flavour f requires a\ntunneling process in which the string fluctuates and touches the f ̃-brane, as shown in figs. 18\nand 19. The amplitude for this process can be studied semiclassically provided the distance\nbetween the two branes is sufficiently large compared to `s , but it is far from straightforward\nto calculate [37]. In addition, in the present context the calculation would require a precise\nspecification of the string profile. On general grounds, however, one may expect the amplitude\nto be exponentially suppressed, since it requires a large string fluctuation that is classically\nforbidden. Note that the same exponential suppression applies to the emission of a large f f meson by an f -quark, as shown in fig. 20. This is the reason why we neglected this process\nin our calculation of energy loss. More precisely, our calculation can be seen as accounting\nfor this process in the limit in which the size of the emitted meson is so small that it requires\nquantization of the resulting string. In this limit there is no exponential suppression, and the\nemitted string must be described as a field propagating on the brane.\nWe close with a comment on a possible extension of our work. In this paper we have\nfocused on the energy loss of quarks attached to branes that sit outside the horizon in a\nMinkowski embedding. It would be interesting to study the energy loss in the case of black hole\nembeddings, which describe light quarks. In this case no stable quark-antiquark bound states\nexist in the plasma, which in the string description corresponds to the fact that excitations\non the brane are characterized by quasinormal modes with complex frequencies. It would\nbe interesting to explore whether the emission of quasinormal modes could also lead to a\nsignificant energy loss.\n\nAcknowledgments\nWe thank Mariano Chernicoff, David d'Enterria, Roberto Emparan, Bartomeu Fiol, Alberto\n\n– 32 –\n\n\fFigure 18: String description of the emission of an f f ̃-meson with f ̃ 6= f . The quark changes flavour\nin the process.\n\nFigure 19: String description of the emission of two mesons with f ̃ 6= f . The quark does not change\nflavour in the process.\n\nFigure 20: String description of the emission of an f f -meson by an f -quark. The quark does not\nchange flavour in the process.\n\nGuijosa, Cristina Manuel, Angel Paredes, Robert Myers, Leonardo Patiño, Amit Sever and\nPaul Townsend for discussions. We are supported by a Marie Curie Intra-European Fellowship\nPIEF-GA-2008-220207 (JCS) and by 2009-SGR-168, MEC FPA 2007-66665-C02 and CPAN\nCSD2007-00042 Consolider-Ingenio 2010 (DF, DM).\n\n– 33 –\n\n\fA. Boundary conditions at the string endpoint\nThe action for the string may be written as\nZ\n√\n1\nS = −Tstring dτ dσ −g g αβ ∂α X M ∂β X N GM N .\n2\n\n(A.1)\n\nIn this form of the action g is an independent worldsheet metric and X M (τ, σ) specify the\nembedding in spacetime of the string worldsheet. Since g appears undifferentiated, it can be\neliminated from the action through its equation of motion. This equation implies that\ngαβ = ∂α X M ∂β X N GM N ,\n\n(A.2)\n\ni.e. that g is the induced metric on the worldsheet. Substituting this into the action one\nobtains the familiar Nambu-Goto action\nZ\n√\nTstring\n(A.3)\nS=−\ndτ dσ −g .\n2\nAn alternative way to proceed, which is more convenient to elucidate the boundary\nconditions at the string endpoint, is to choose the so-called conformal gauge. This means that\none uses the reparametrization invariance of the string action to ensure that the worldsheet\nmetric is conformally flat, i.e that gαβ = Ω2 (τ, σ)ηαβ . (In addition, Weyl invariance may be\nused to ensure that Ω = 1.) In this gauge the action becomes\nZ\n1\nS = −Tstring dτ dσ η αβ ∂α X M ∂β X N GM N .\n(A.4)\n2\nVariation of this action with respect to the embedding coordinates yields a bulk term proportional to the equation of motion, η αβ ∂α ∂β X M = 0, plus the boundary term\nZ\nh\ni\n0\n−Tstring dτ X M δX N GM N\n,\n(A.5)\nbdry\n\nwhich is integrated over the string boundary. The equation of motion must be supplemented\nby the constraints associated to the gauge fixing of g, which take the form\n0\n\nẊ * X 0 ≡ GM N Ẋ M X N = 0 ,\n\u0010\n\u0011\n0\n0\n2\nẊ 2 + X 0 ≡ GM N Ẋ M Ẋ N + X M X N = 0 .\n\n(A.6)\n\nThe boundary conditions follow from the requirement that the boundary term vanish. This\n0\nmay be achieved by imposing either a Neumann boundary condition, X M |bdry = 0, or a\nDirichlet boundary condition, δX M |bdry = 0. If all coordinates satisfy Neumann boundary\nconditions, then the second constraint immediately implies that Ẋ 2 |bdry = 0, namely the\nfamiliar condition that the endpoint moves at the speed of light. Suppose however that the\nstring is attached to a Dp-brane, and let the first p + 1 coordinates X a be coordinates along\nthe brane directions, and X A be coordinates orthogonal to the brane. Then by definition\n\n– 34 –\n\n\fwe must choose Neumann boundary conditions for X a and Dirichlet boundary conditions for\nX A:\nẊ A |bdry = 0 .\n(A.7)\nX a0 |bdry = 0 ,\n\nThe Neumann boundary condition on X a implies that the string ends orthogonally on the\n0\nbrane, since the vector tangent to the string at its endpoint, X M |bdry = 0, has no components\nalong the brane. Substituting both boundary conditions on the second constraint equation\none finds that\n2\n02\n(A.8)\nẊ a |bdry = − X A |bdry ≤ 0 ,\nwhich means that the endpoint moves along the brane at a speed lower than or equal to the\nlocal speed of light.\n\nB. Energy loss formula\nA charge can be defined for each of the isometries of the brane's worldvolume metric (3.6). For\nconcreteness, in this section we will focus on the four-momentum associated to translations\nin the gauge theory, which is generated by the set of Killing vector fields kμ = ∂μ .\nLet Σ be a spacelike 7-surface in the brane's worldvolume, which we take to be a t = const.\n√\nsurface, and n = ∂t / −g00 the future-pointing unit normal to Σ. The momenta are then\ngiven by\nZ\nZ\n√\n7 √\na\nb\nPμ =\nd x gsp n Tab kμ =\nd7 x gsp na Taμ ,\n(B.1)\nΣ\n\nΣ\n\nwhere gsp is the spatial metric on Σ. Since the time-space off-diagonal components of g vanish\nwe have that\n√\n√\n√\n−g = −g00 gsp .\n(B.2)\ng 00 = 1/g00 ,\nUsing these relations Pμ may be rewritten as\nZ\nZ\n√\n1\n√\nPμ =\nd7 x gsp √\nT0μ = − d7 x −g T 0μ .\n−g00\nΣ\nΣ\nFor μ = 0, these formulas give the energy on the brane:\nZ\nZ\n√\n1\n7 √\nT00 = − d7 x −g T 00 ≥ 0 .\nE = P0 =\nd x gsp √\n−g00\nΣ\nΣ\n\n(B.3)\n\n(B.4)\n\nNote that this is non-negative because T00 ≥ 0.15\nConsider now the brane's worldvolume V as shown in fig. 21. Σ1 and Σ2 are spacelike\nhypersurfaces at times t1 and t2 , respectively, and Σ∞ is a timelike hypersurface at spatial\ninfinity. Applying Stoke's theorem we then have\nZ\nZ\nZ\nZ\n√\n√\n√\n√\na\na\na\n−g ∇ Taμ =\ngsp n(1) Taμ +\ngsp n(2) Taμ +\ngsp na(∞) Taμ .\n(B.5)\nV\n\nΣ2\n\nΣ1\n\n15\n\nΣ∞\n\nFor example, in flat space eq. (5.6) gives T00 = E 2 /2 + B 2 /2 ≥ 0, where Ei = Fi0 , E i = F i0 , E 2 = Ei E i ,\nand 2B 2 = Fij F ij .\n\n– 35 –\n\n\fThe unit normals must be taken inward-pointing if they are timen\nlike, and outward-pointing if they are space-like. Therefore we\nΣ2\nhave na(1) = −na(2) = n and na(∞) = ñ, so eq. (B.5) with μ = 0\nV\nñ\nyields\nZ\n√\nn\nE2 − E1 + F∞ = −\n−g ∇a Ta0 ,\n(B.6)\nΣ∞\nV\nR √\nΣ1\nwhere E1,2 is the energy contained in Σ1,2 and F∞ = − Σ∞ gsp ña Ta0\nis the energy flux that has escaped through Σ∞ between t1 and\nt2 .16 The left-hand side of eq. (B.6) is the total energy deposited Figure 21: Brane's worldR\nR\non the brane by the source. Since V = dtd7 x, if t1 and t2 are volume, to which Stoke's theorem is applied.\ninnitesimally close we obtain\nZ\n√\ndE\n= − d7 x −g ∇a Ta0 .\n(B.7)\ndt\n\nC. High-momentum radial wave functions\nAs shown (on the left-hand side of) figs. 6, 8, and 9, the high-momentum radial profiles of\nthe different modes are concentrated near the tip of the brane (r = 0). In this region of high\nq and small r it is possible to find analytic expressions for the radial profiles [17]. In this\nappendix we shortly review this computation and extend it to vector modes.\nFollowing [17] we introduce the coordinate z which fulfills\ns\nr\ndz\ngrr\n2f ̃(1 + Ṙ2 )\n=\n=\n.\n(C.1)\ndr\n−g00\nρ4 f 2\nIn terms of this new coordinate, the different modes Ψα = {φ1 , φ2 , A, Φ} satisfy a differential\nequation of the generic form\n\u0014\n\u0015\nf2 2\nα\nα\nα\n2\n∂z [a (z) ∂z Ψ ] + a (z) ω − q Ψα − bα (z) (mα )2 Ψα = 0 ,\n(C.2)\nf ̃2\nwhere mα = {m11 , m22 , 0 , 0 } and the different coefficient functions are given by\n√\na1 = a2 = − −g g 00 ,\n√\na3 = − −g g 00 g 11 ,\n√\na4 = −g11 g00 / −g ,\n√\nb1 = b2 = −g .\n(C.3)\n√\nVia the simple rescaling ψ α = aα Ψα , the set of eqs. (C.2) can be written in the Schrödinger\nform\n−∂z2 ψ α + V α ψ α = ω 2 ψ α ,\n(C.4)\n16\n\nThe minus sign in the definition of the flux comes from the fact that the energy current in the a-direction\nis given by −Ta0 , as can be seen from the continuity equation. For example, in flat space in the absence of\nsources the continuity equation ∂ a Ta0 = 0 yields ∂0 T00 − ∂i Ti0 = 0.\n\n– 36 –\n\n\fwhere the potential is given by\n√ \u0001\naα\nbα\nf 2 ∂z2\nV (z, q) = q\n+ √ α + α (mα )2 .\na\na\nf ̃2\nα\n\n2\n\n(C.5)\n\nThis potential is a complicated function of z which is only known numerically because it\ndepends non-trivially on the brane embedding. However, since the radial profiles are concentrated near the tip of the brane, we focus on the small-z expansion of the potential (C.5). In\nthe limit z → 0, eq. (C.1) reduces to17\np\n2(R04 + 1)\nz=\nr,\n(C.6)\nR04 − 1\nand the small-z potential is given by\n\u0012\n\u0013\n1\n3\n1\n2 2\n+ `α (`α + 2)\n+ vlim\nq + z 2 q 2 Ω2 ,\nV α (z, q) =\n4\nz2\n4\n\n(C.7)\n\nwhere `α = {0, 0, 0, 1}, vlim is the meson limiting velocity (3.11), and\n16R02 (R04 − 1)2 (1 + R08 )\n.\n(C.8)\n(1 + R04 )5\n√\nAs claimed, this potential has a minimum at z ∝ 1/ q which means that, at least for the\nlowest modes, the wave functions are concentrated at small z. Different meson excitations\ncorrespond to different states of the four-dimensional harmonic oscillator (C.7). The eigenfunctions and eigenvalues are given by\nΩ2 =\n\n2 2\nq + qΩ(2n + 2 + `α ) ,\nωn2 = vlim\n\u0013\n\u0012\n\u0013\n\u0012\n3\n1\n1\nα\nα +1)\n2\n2\nψnα = N α z 2 +` L(`\nΩqz\nexp\n−\nΩqz\n,\nn\n2\n4\n\n(C.9)\n(C.10)\n\nwhere L`+1\nis the generalized Laguerre polynomial and N α are normalization constants den\ntermined by the requirements\nZ\nα\ndz ψnα (z) ψm\n(z) = δmn .\n(C.11)\nThese normalization conditions coincide with those in eqs. (4.9), (4.20) and (4.32).\nFor future use, we provide explicit expressions for the lowest excitations, which correspond\nto n = 0. The normalization constants are given by\n`α\n\n(qΩ)1+ 2\nN = √ 1+`α p\n,\n2\n(1 + `α )!\nα\n\n17\n\n(C.12)\n\nTo derive this expression we have used the small-r expansion of the embedding, R(r) = R0 +\n\u0001\nr / R0 (R08 − 1) .\n2\n\n– 37 –\n\n\fand the radial wave functions take the form\nΨα0\nwhere β α = limr→0\n\n√\n\nα\n\nα 4`α\n\n=β N z\n\n\u0012\n\u0013\n1\n2\nexp − Ωqz\n,\n4\n\n(C.13)\n\naα :\n23/2 R03\n\u00013/2 ,\nR04 − 1\n\u00011/2\n2R02 1 + R04\n3\nβ =\n\u00013/2 ,\nR04 − 1\n\u00013/2\nR04 − 1\n4\nβ =\n\u00011/2 .\n2R02 1 + R04\n\nβ1 = β2 =\n\n(C.14)\n\n(C.15)\n\n(C.16)\n\nD. Energy loss at small r0\nAs the quark position approaches the tip of the branes, r0 → 0+ , the maximum velocity of\nthe quark approaches the meson limiting velocity vlim from above. As a consequence, the\nquark and meson dispersion relations cross at q0 \u001d T . In fig. 2 this means that the dotted\nvertical lines move to the right. For a fixed r0 the smallest value of the crossing point, q0min ,\nis attained at the maximal velocity of the quark, vmax . Using the high-momentum dispersion\nrelation (C.9), the crossing momentum at an arbitrary quark velocity v is determined by the\ncondition\n\u0012\n\u0013\n`α\nΩ\nvlim q0 + 1 + n +\n= vq0 ,\n(D.1)\n2 vlim\nwhich leads to\n\n\u0013\n\u0012\nΩ\n1\n`α\nq0 = 1 + n +\n.\n2 vlim v − vlim\n\n(D.2)\n\nThe maximal velocity for a quark at r0 is\nr\ng00\nvmax (z0 ) = −\ngii\n\nr0\n\n≈ vlim + z02\n\nΩ2\n,\n8vlim\n\n(D.3)\n\nwhere we have expanded to leading order in r0 and used the definition (C.6) of z. Substituting\nthis value of v in eq. (D.2) we find that the minimum crossing point is\n\u0012\nmin\n\nq0\n\n=\n\n`α\n1+n+\n2\n\n\u0013\n\n8\n.\nΩz02\n\n(D.4)\n\nThus, the energy loss can be reliably computed with the approximate solutions of appendix C.\nSince the energy-loss formulas are different for each mode, we will address them separately.\nFurthermore, we will focus on the lowest state of each mode.\n\n– 38 –\n\n\fD.1 Scalar mesons\nSince in the high-momentum, small-r region both scalar modes have the same radial profile,\nthe energy loss into scalar mesons in this limit will also be the same. Expanding the energy\nloss formula (5.57) and using the radial profiles (C.13) we obtain\n\u0014 2\n\u0015\u0014\n\u0015\n\u0012\n\u0013\nZ\n\u0001 2 ∞ dq 3\ne2\nvmax (z0 ) − v 2 1 + R04\n1\ndEscalar\n1 2 Ω\n2\n=\nβ\nq exp − Ωqz0 .\n(D.5)\ndt\n2Ω3\nv\n2 q0min 2π\n2\n2R02\nAfter integration, this yields\n\u00012 1 \u00012 \u0014\n\u0015\n2 (z ) − v 2\nβ\nvmax\ndEscalar\ne2 1 + R04\n0\n×\n=\ndt\n4πΩ3\nv\n2R02\n\u0014\n\u0015\n\u0012\n\u0013\n48 + 24Ωq0min z02 + 6Ω2 (q0min )2 z04 + Ω3 (q0min )3 z06\n1 min 2\nexp − Ωq0 z0 . (D.6)\n2\nΩ2 z08\nAs expected on general grounds, and in agreement with figs. 13 and 14, we see that the energy\nloss vanishes both for v → vmax and for v → vlim . The former is due to the fact that the factor\n(5.49) vanishes in this limit. The latter is implemented by the fact that q0min diverges as\nv → vlim , which in turn is a manifestation of the Heaviside theta function in eq. (5.57). As\nreflected in figs. 13 and 14, the maximum energy loss occurs at some intermediate velocity such\nthat vlim < vint < vmax . Although vint is not easy to compute, we know that vmax − vlim ∝ z02 .\nIt then follows that also vmax − vint ∝ z02 and therefore that the maximum energy loss diverges\nas 1/z06 .\nD.2 Transverse vector mesons\nThe energy lost into these modes is given by eq. (5.23) which, utilizing (C.13), leads to\n\u0012\n\u0013\u0012\n\u0013\nZ\n2\n\u0001 2 ∞ dq 3\ndEtrans\ne2 v\n1\nvlim\n2Ω\n3 2 Ω\n2\n=\nβ\nq exp − Ωqz0\n1− 2 − 2 .\n(D.7)\ndt\n2Ω3\n2 q0min 2π\n2\nv\nqv\nUnlike for scalar meson emission, it is easy to see that in this case the energy loss is a\nmonotonically growing function of the velocity. Thus, the maximum value of the energy loss\nis attained for v = vmax and, to leading order in z0 , it is given by\n\u00012 76 exp(−4)\ndEtrans\ne2\n.\n=\nβ3\ndt\n4πΩ3\nvlim z06\n\n(D.8)\n\nThis shows the same divergence for small r0 as in the case of scalar modes.\nD.3 Longitudinal vector mesons\nInserting (C.13) into the expression for energy loss (5.40), and to leading order in z0 we obtain\ndElong\ne2 2Ω3 1\n=\ndt\n2Ω3 v (β 4 )2\n\nZ\n\n∞\n\nq0min\n\n\u0012\n\u00132\n\u0012\n\u0013\ndq 2\n1\n1\n2\n2\nq 1 − Ωqz0 exp − Ωqz0 .\n2π\n8\n2\n\n– 39 –\n\n(D.9)\n\n\fAs in the transverse vector case, the maximum energy loss is attained at v = vmax . Using\n(D.4) and setting `α = 1 (see the definition below eq. (C.7)) the maximum energy loss is\n1 632 exp(−6)\ne2\ndElong\n=\n.\ndt\n4πΩ3 (β 4 )2\nvlim z06\n\n(D.10)\n\nAgain, this diverges with the same power of z0 as in the cases of transverse and scalar modes.\nNote also that since β 4 = 1/β 3 and the numerical factors in eqs. (D.10) and (D.8) are similar,\nwe find that in this limit the energy lost into transverse and longitudinal vector modes is\ncomparable.\nFinally, we may comment on the mass dependence of the energy lost into vector mesons.\nThe maximal energy loss is proportional to\n\u00012\nR04 R04 − 1 1\ndE\n\u0001\n∝\n.\n(D.11)\ndt max\nr06\nR04 + 1\nThe fact that this is a growing function of R0 means that the energy loss increases if the\nquark mass is increased while keeping all other parameters such as r0 , v, etc. fixed. However,\nthis should not be necessarily taken as an indication that Cherenkov energy loss in a real HIC\nexperiment increases as the quark mass increases, because the 'preferred' or 'mean' values of\nthese parameters with which a quark is produced may themselves depend on the quark mass.\n\nE. Low-temperature limit\nAs T → 0 with all other scales fixed, the redshift at the bottom of the branes decreases,\nand so the limiting velocity of mesons, vlim , approaches unity. In turn, this means that the\nmomentum q0 (T ) at which Cherenkov radiation turns on diverges as T → 0, much in the\nsame way as in the case r0 → 0 studied above. The purpose of this section is to estimate\nq0 (T ) in the low-temperature limit. As we will see, the product q0 (T ) T 2 remains finite as\nT → 0, which makes this limit harder to study than the r0 → 0 limit.\nAs T → 0 with fixed quark mass, the parameter m ∝ Mq /T controlling the asymptotic\nposition of the branes, R(r → ∞) = m, diverges. For this reason it is convenient to introduce\nrescaled coordinates\n√\nxμ\nx̂μ = √ ,\n{r̂, R̂, ρ̂} = \u000f{r, R, ρ} ,\n(E.1)\n\u000f\nwhere \u000f ≡ 1/m2 and we are interested in the limit \u000f → 0. The rescaling of the x-coordinates\nis chosen so that the induced metric on the D7-brane takes the same form as that in (3.6),\ni.e. ds2 = L2 ds2 (g) with\n\u0014 2\n\u0015\n ̇\nρ̂2\nf\n(1 + R̂2 ) 2 r̂2 2\n2\n2\nds (g) =\n− dt̂ + f ̃d~x̂ +\ndr̂ + 2 dΩ3 ,\n2\nρ̂2\nρ̂\nf ̃\n2\n\nwhere now\nf (ρ̂) = 1 −\n\n\u000f2\n,\nρ̂4\n\n\u000f2\nf ̃(ρ̂) = 1 + 4 .\nρ̂\n\n– 40 –\n\n(E.2)\n\n(E.3)\n\n\f√\nIn this new set of coordinates the horizon is located at ρ̂hor = \u000f, whereas R̂(r̂ → ∞) = 1. In\nfact, in the limit \u000f → 0 the gravitational pull of the black hole becomes very small and the\nbrane bends very little. Inserting the ansatz R̂(r̂) = 1 + δ R̂(r̂) in eq. (3.7) and linearizing in\nδ R̂ one finds that δ R̂ = O(\u000f4 ). Since we will work to order \u000f2 we will neglect this correction.\nFurthermore, it is easy to see that the equations of motion for the transverse (4.6), longitudinal\n(4.18) and scalar (4.30) modes are unmodified by the rescaling (E.1) provided we rescale the\n√\nmomentum in a consistent way, i.e. {ω̂, q̂} = \u000f{ω, q}, so that we leave the product (ωt−~q *~x)\ninvariant. For ease of notation, in the following we will omit the hat symbol.\nFollowing appendix C, eqs. (4.6), (4.18) and (4.30) can be rewritten in the Schrödinger\nform (C.4). The potential (C.5) is in general a complicated function, but it simplifies in the\nlimit \u000f → 0. Indeed, in this case eq. (C.1) can be integrated explicitly with the result\n\u0013\n\u0012\n√\n3\nr(5 + 3r2 ) 2\n\u000f + O(\u000f4 ) ,\n(E.4)\nz(r) = 2 arctan r + √\n3 arctan r +\n8 2\n(1 + r2 )2\n√\nso that zmax ≡ z(r → ∞) ' π/ 2. The potential can then be written as\nV α (z, q) = V1 (z)q 2 + V α2 (z) ,\n\n(E.5)\n\nwhere\n\u0012\n\n\u0013\nz\nV1 (z) = 1 − 4 cos √\n\u000f2 + g(z)\u000f4 + O(\u000f6 ) ,\n2\n√ \u0001\n√ \u0001\nα cos2\nA\n2z\n+ Bα cos 2z + Cα\n(mα )2\nα\n√\n√ \u0001 + h(z)\u000f2 + O(\u000f4 ) ,\n\u0001\n+\nV 2 (z) =\n2\n2 sin\n2z\n1 + cos 2z\n4\n\n(E.6)\n(E.7)\n\nwith Aα = {0, 0, 1, 1}, Bα = {−6, −6, 0, 8} and Cα = {9, 9, 2, 6}. The functions g(z) and h(z)\nare smooth and bound, and their explicit form will not be needed.\nBefore proceeding further let us clarify one point. In the limit z → zmax , V 42 (z) shows a\nnegative divergence. This is related to the fact that the radial profile Ψ4 (r) = Φ(r) does not\nvanish near the boundary. This may seem counterintuitive, since generically one expects a\n'confining' potential near the boundary (the AdS 'box') which is partly responsible for the\ndiscreteness of the spectrum. However, note that the physical electric field E is related to Φ\nthrough eq. (4.16), which may be written as E = a4 (z)∂z Φ. In the limit r → ∞, the factor\nf 2 /f ̃2 in eq. (C.2) approaches 1, so one can differentiate this equation with α = 4 and use the\nfact that a4 (z) = 1/a3 (z) to show that the asymptotic form of the equation for E is identical\nto that for the transverse mode Ψ3 = A.\nLet us now return to the potential (E.5). As explained above, we are interested in the\nlimit \u000f → 0 and q ≥ q0 (\u000f) → ∞. In particular, we wish to determine whether in this limit\nthe product \u000fq0 goes to zero, remains finite, or diverges. We will establish that the product\nremains finite by showing that the other two possibilities lead to a contradiction.\nConsider first the possibility that \u000fq0 → ∞ as \u000f → 0. Then the potential takes the form\n√ \u0001\n√ \u0001\n\u0013\n\u0012\nα cos2\nα cos\nA\n2z\n+\nB\n2z + Cα\n(mα )2\nz\nα\n2\n4\n√ \u0001\n√ \u0001 − 4 cos √\nV (z, q) − q '\n+\n\u000f2 q 2 ,\n2 sin2\n2z\n1 + cos 2z\n2\n(E.8)\n\n– 41 –\n\n\fV 3 (z, q) − q 2\n\nwhere the last term dominates everywhere except near the endpoints z = 0 and zmax , at\nwhich the order-one part of the potential, given by the first two terms on the right-hand side,\ndiverges. As an illustration, fig. 22 shows the potential for the α = 3 - mode for several values\nof \u000fq. We see that the potential develops a minimum at a small value of z as \u000fq becomes large.\nThis allows us to consider an expansion for\n500\nsmall z in order to obtain the energy levels\n0\nassociated to the potential. In this way we\nreproduce the result (C.9), approximated for\n-500\n\u000f → 0. For example, in the case α = 3 and\n-1000\nn = 0 the dispersion relation takes the form:\n2 p\nω(q) = 1 − 2\u000f q + √\n1 + 20q 2 \u000f2 +O(\u000f2 ) .\n5q\n(E.9)\nThe value of q0 is determined by the condition ω(q0 ) = vq0 , where v is the quark velocity,\nwhich depends on the quark position through\n2\n\n-1500\n0.0\n\n\u0001\n\nv(r0 ) = 1 −\n\n0.5\n\n1.0\n\n1.5\n\n2.0\n\nz\nFigure 22: Potential for α = 3, in the limit\n\u000f → 0, q → ∞ and \u000fq fixed. From top to bottom\nthe curves correspond to \u000fq = 4, 8, 12, 16, 20.\n\n2\u000f2\n+ O(\u000f4 ) .\nρ40\n\n(E.10)\n\nThe result is\nq\n\u0001 −1/2\n20 + r20 (2 + r20 ) 40 + 21r20 (2 + r20 )\n√\n\n\u000fq0 = −10 + 5\n.\n(1 + r20 )2\n\n\n(E.11)\n\nThis expression is not parametrically large for any value of r0 except in the limit r0 → 0, which\nwas considered above and is unrelated to the zero-temperature limit under consideration here.\nIn particular, for small r0 eq. (E.11) yields \u000fq0 = 1/r0 2 + 3/2 + O(r02 ), whereas for large r0\none finds \u000fq0 = 2.01 + 1.99/r04 + O(1/r06 ). We therefore conclude that \u000fq0 (\u000f) remains finite as\n\u000f → 0, in contradiction with our initial assumption that \u000fq0 (\u000f) → ∞ in this limit.\nConsider now the opposite possibility, i.e. that \u000fq0 → 0 as \u000f → 0. In this case the last term\nin the potential (E.8) is small and the energy levels can be determined using perturbation\ntheory with the result\nω 2n (q) = q 2 + λn − wn \u000f2 q 2 + O(\u000f4 q 4 ) .\n(E.12)\nHere, λn are the eigenvalues of the problem in the absence of the perturbation, and −ωn is\nthe (negative) first-order correction given by the expectation value of the perturbation in the\n√\nn-th eigenstate, hn| − 4 cos4 (z/ 2)|ni . The key point is that λn and wn are independent\nof \u000f and q. In order to find the crossing point, we need to solve ω 2n (q0 ) = v 2 q 20 . Since the\nminimum possible value of q0 corresponds to the maximum quark velocity, v = 1, we find\nr\nλn\n\u000fq0 '\n,\n(E.13)\nwn\n\n– 42 –\n\n\fwhich is in contradiction with our initial assumption that \u000fq0 → 0.\nWe therefore conclude that the combination\n√ !3\n\u0013\n\u0012\n√\nq̃\n1 q̃\nλT\n2πT 3 q̃\n=\n=\n\u000fq̂ = \u000f \u000fq = 3\nm πT\n2Mq\nπT\nMmes\nπT\n\n(E.14)\n\nremains finite in the limit T → 0, where we have reinstated the hat and we recall that q̃ is\n3 ,\nthe physical, dimensionful momentum. We see that in this limit q̃(T ) T 2 ∼ Mq3 /λ3/2 ∼ Mmes\nwhich remains finite in the low-temperature limit, as we anticipated. This means that the\nrelevant potential in this limit is (E.8), where all terms are of the same order. This makes the\nproblem harder than that associated to the limit r0 → 0, and we have been unable to find\nanalytic expressions for the corresponding eigenfunctions and eigenvalues.\n\nReferences\n[1] J. Casalderrey-Solana, D. Fernandez and D. Mateos, \"A New Mechanism of Quark Energy\nLoss,\" Phys. Rev. Lett. 104 (2010) 172301 [arXiv:0912.3717 [hep-ph]].\n[2] N. Armesto et al., \"Heavy Ion Collisions at the LHC - Last Call for Predictions,\" J. Phys. G 35,\n054001 (2008) [arXiv:0711.0974 [hep-ph]].\n[3] M. Gyulassy, I. Vitev, X. N. Wang and B. W. Zhang, \"Jet quenching and radiative energy loss\nin dense nuclear matter,\" arXiv:nucl-th/0302077;\nA. Kovner and U. A. Wiedemann, \"Gluon radiation and parton energy loss,\"\narXiv:hep-ph/0304151;\nJ. Casalderrey-Solana and C. A. Salgado, \"Introductory lectures on jet quenching in heavy ion\ncollisions,\" Acta Phys. Polon. B 38, 3731 (2007) [arXiv:0712.3443 [hep-ph]].\n[4] C. P. Herzog, A. Karch, P. Kovtun, C. Kozcaz and L. G. Yaffe, \"Energy loss of a heavy quark\nmoving through N = 4 supersymmetric Yang-Mills plasma,\" JHEP 0607, 013 (2006)\n[arXiv:hep-th/0605158];\nH. Liu et al, K. Rajagopal and U. A. Wiedemann, \"Calculating the jet quenching parameter\nfrom AdS/CFT,\" Phys. Rev. Lett. 97, 182301 (2006) [arXiv:hep-ph/0605178];\nS. S. Gubser, \"Drag force in AdS/CFT,\" Phys. Rev. D 74, 126005 (2006)\n[arXiv:hep-th/0605182];\nJ. Casalderrey-Solana and D. Teaney, \"Heavy quark diffusion in strongly coupled N = 4 Yang\nMills,\" Phys. Rev. D 74, 085012 (2006) [arXiv:hep-ph/0605199];\nM. Chernicoff and A. Guijosa, \"Acceleration, Energy Loss and Screening in Strongly-Coupled\nGauge Theories,\" JHEP 0806, 005 (2008) [arXiv:0803.3070 [hep-th]].\n[5] J. Adams et al. [STAR Collaboration], \"Experimental and theoretical challenges in the search\nfor the quark gluon plasma: The STAR collaboration's critical assessment of the evidence from\nRHIC collisions,\" Nucl. Phys. A 757, 102 (2005) [arXiv:nucl-ex/0501009];\nK. Adcox et al. [PHENIX Collaboration], \"Formation of dense partonic matter in relativistic\nnucleus nucleus collisions at RHIC: Experimental evaluation by the PHENIX collaboration,\"\nNucl. Phys. A 757, 184 (2005) [arXiv:nucl-ex/0410003].\n\n– 43 –\n\n\f[6] E. Shuryak, \"Why does the quark gluon plasma at RHIC behave as a nearly ideal fluid?,\" Prog.\nPart. Nucl. Phys. 53, 273 (2004) [arXiv:hep-ph/0312227];\n\"What RHIC experiments and theory tell us about properties of quark-gluon plasma?,\" Nucl.\nPhys. A 750, 64 (2005) [arXiv:hep-ph/0405066].\n[7] E. Witten, \"Anti-de Sitter space, thermal phase transition, and confinement in gauge theories,\"\nAdv. Theor. Math. Phys. 2, 505 (1998) [arXiv:hep-th/9803131].\n[8] A. Karch and L. Randall, \"Open and closed string interpretation of SUSY CFT's on branes\nwith boundaries,\" JHEP 0106, 063 (2001) [arXiv:hep-th/0105132];\nA. Karch and E. Katz, \"Adding flavor to AdS/CFT,\" JHEP 0206, 043 (2002)\n[arXiv:hep-th/0205236].\n[9] D. Mateos, R. C. Myers and R. M. Thomson, \"Holographic phase transitions with fundamental\nmatter,\" Phys. Rev. Lett. 97, 091601 (2006) [arXiv:hep-th/0605046].\n[10] D. Mateos, R. C. Myers and R. M. Thomson, \"Thermodynamics of the brane,\" JHEP 0705,\n067 (2007) [arXiv:hep-th/0701132].\n[11] J. Babington, J. Erdmenger, N. J. Evans, Z. Guralnik and I. Kirsch, \"Chiral symmetry breaking\nand pions in non-supersymmetric gauge / gravity duals,\" Phys. Rev. D 69, 066007 (2004)\n[arXiv:hep-th/0306018];\nI. Kirsch, \"Generalizations of the AdS/CFT correspondence,\" Fortsch. Phys. 52, 727 (2004)\n[arXiv:hep-th/0406274].\n[12] M. Kruczenski, D. Mateos, R. C. Myers and D. J. Winters, \"Towards a holographic dual of\nlarge-N(c) QCD,\" JHEP 0405, 041 (2004) [arXiv:hep-th/0311270].\n[13] O. Aharony, J. Sonnenschein and S. Yankielowicz, \"A holographic model of deconfinement and\nchiral symmetry restoration,\" Annals Phys. 322, 1420 (2007) [arXiv:hep-th/0604161];\nA. Parnachev and D. A. Sahakyan, \"Chiral phase transition from string theory,\" Phys. Rev.\nLett. 97, 111601 (2006) [arXiv:hep-th/0604173].\n[14] See e.g. A. Bazavov, P. Petreczky and A. Velytsky, \"Quarkonium at Finite Temperature,\"\narXiv:0904.1748 [hep-ph], and references therein.\n[15] J. L. Hovdebo, M. Kruczenski, D. Mateos, R. C. Myers and D. J. Winters, \"Holographic\nmesons: Adding flavor to the AdS/CFT duality,\" Int. J. Mod. Phys. A 20, 3428 (2005).\n[16] C. Hoyos-Badajoz, K. Landsteiner and S. Montero, \"Holographic Meson Melting,\" JHEP 0704,\n031 (2007) [arXiv:hep-th/0612169].\n[17] Q. J. Ejaz, T. Faulkner, H. Liu, K. Rajagopal and U. A. Wiedemann, \"A limiting velocity for\nquarkonium propagation in a strongly coupled plasma via AdS/CFT,\" JHEP 0804, 089 (2008)\n[arXiv:0712.0590 [hep-th]].\n[18] M. Kruczenski, D. Mateos, R. C. Myers and D. J. Winters, \"Meson spectroscopy in AdS/CFT\nwith flavour,\" JHEP 0307, 049 (2003) [arXiv:hep-th/0304032].\n[19] S. Kobayashi and K. Nomizu, \"Foundations of Differential Geometry,\" Vol. 1, Chapter 3,\nWiley-Interscience (1963).\n\n– 44 –\n\n\f[20] C. G. Callan and J. M. Maldacena, \"Brane dynamics from the Born-Infeld action,\" Nucl. Phys.\nB 513, 198 (1998) [arXiv:hep-th/9708147];\nG. W. Gibbons, \"Born-Infeld particles and Dirichlet p-branes,\" Nucl. Phys. B 514, 603 (1998)\n[arXiv:hep-th/9709027].\n[21] P. M. Chesler, K. Jensen, A. Karch and L. G. Yaffe, \"Light quark energy loss in\nstrongly-coupled N = 4 supersymmetric Yang-Mills plasma,\" Phys. Rev. D 79, 125015 (2009)\n[arXiv:0810.1985 [hep-th]].\n[22] T. Matsui and H. Satz, \"J/psi Suppression by Quark-Gluon Plasma Formation,\" Phys. Lett. B\n178, 416 (1986).\n[23] O. Kaczmarek, F. Karsch, F. Zantow and P. Petreczky, \"Static quark anti-quark free energy and\nthe running coupling at finite temperature,\" Phys. Rev. D 70, 074505 (2004) [Erratum-ibid. D\n72, 059903 (2005)];\nP. Petreczky and K. Petrov, \"Free energy of a static quark anti-quark pair and the renormalized\nPolyakov loop in three flavor QCD,\" Phys. Rev. D 70 (2004) 054503 [arXiv:hep-lat/0405009];\nO. Kaczmarek and F. Zantow, \"Static quark anti-quark interactions in zero and finite\ntemperature QCD. I: Heavy quark free energies, running coupling and quarkonium binding,\"\nPhys. Rev. D 71, 114510 (2005) [arXiv:hep-lat/0503017];\nA. Mocsy and P. Petreczky, \"Can quarkonia survive deconfinement ?,\" Phys. Rev. D 77, 014501\n(2008) [arXiv:0705.2559 [hep-ph]];\nA. Mocsy, \"Potential Models for Quarkonia,\" arXiv:0811.0337 [hep-ph].\n[24] M. Asakawa and T. Hatsuda, \"J/ψ and η/c in the deconfined plasma from lattice QCD,\" Phys.\nRev. Lett. 92 (2004) 012001 [arXiv:hep-lat/0308034];\nS. Datta, F. Karsch, P. Petreczky and I. Wetzorke, \"Behavior of charmonium systems after\ndeconfinement,\" Phys. Rev. D 69 (2004) 094507 [arXiv:hep-lat/0312037];\nT. Hatsuda, \"Hadrons above Tc ,\" Int. J. Mod. Phys. A 21 (2006) 688 [arXiv:hep-ph/0509306];\nF. Karsch, D. Kharzeev and H. Satz, \"Sequential charmonium dissociation,\" Phys. Lett. B 637\n(2006) 75 [arXiv:hep-ph/0512239];\nH. Satz, \"Quarkonium binding and dissociation: The spectral analysis of the QGP,\"\narXiv:hep-ph/0609197;\nM. Asakawa, T. Hatsuda and Y. Nakahara, \"Hadronic spectral functions above the QCD phase\ntransition,\" Nucl. Phys. A 715, 863 (2003) [Nucl. Phys. Proc. Suppl. 119, 481 (2003)].\n[25] E. V. Shuryak and I. Zahed, \"Towards a theory of binary bound states in the quark gluon\nplasma,\" Phys. Rev. D 70, 054507 (2004) [arXiv:hep-ph/0403127].\n[26] M. C. Chu and T. Matsui, \"Dynamic Debye screening for a heavy quark-antiquark pair\ntraversing a quark-gluon plasma,\" Phys. Rev. D 39, 1892 (1989).\n[27] K. Peeters, J. Sonnenschein and M. Zamaklar, \"Holographic melting and related properties of\nmesons in a quark gluon plasma,\" Phys. Rev. D 74, 106008 (2006) [arXiv:hep-th/0606195];\nH. Liu, K. Rajagopal and U. A. Wiedemann, \"An AdS/CFT calculation of screening in a hot\nwind,\" Phys. Rev. Lett. 98, 182301 (2007) [arXiv:hep-ph/0607062];\nM. Chernicoff, J. A. Garcia and A. Guijosa, \"The energy of a moving quark-antiquark pair in\nan N = 4 SYM plasma,\" JHEP 0609, 068 (2006) [arXiv:hep-th/0607089];\nQ. J. Ejaz, T. Faulkner, H. Liu, K. Rajagopal and U. A. Wiedemann, \"A limiting velocity for\nquarkonium propagation in a strongly coupled plasma via AdS/CFT,\" JHEP 0804, 089 (2008)\n[arXiv:0712.0590 [hep-th]].\n\n– 45 –\n\n\f[28] J. Casalderrey-Solana and D. Mateos, \"Prediction of a Photon Peak in Relativistic Heavy Ion\nCollisions,\" Phys. Rev. Lett. 102, 192302 (2009) [arXiv:0806.4172 [hep-ph]].\n[29] E. Iancu and A. H. Mueller, \"Light-like mesons and deep inelastic scattering in\nfinite-temperature AdS/CFT with flavor,\" arXiv:0912.2238 [hep-th].\n[30] J. Casalderrey-Solana, E. V. Shuryak and D. Teaney, \"Conical flow induced by quenched QCD\njets,\" J. Phys. Conf. Ser. 27, 22 (2005) [Nucl. Phys. A 774, 577 (2006)] [arXiv:hep-ph/0411315].\n[31] A. Mocsy and P. Petreczky, \"Can quarkonia survive deconfinement ?,\" Phys. Rev. D 77, 014501\n(2008) [arXiv:0705.2559 [hep-ph]].\n[32] J. Liao and E. Shuryak, \"Angular Dependence of Jet Quenching Indicates Its Strong\nEnhancement Near the QCD Phase Transition,\" Phys. Rev. Lett. 102, 202302 (2009)\n[arXiv:0810.4116 [nucl-th]].\n[33] S. S. Adler et al. [PHENIX Collaboration], \"A detailed study of high-p(T) neutral pion\nsuppression and azimuthal anisotropy in Au + Au collisions at s(NN)**(1/2) = 200-GeV,\"\nPhys. Rev. C 76, 034904 (2007) [arXiv:nucl-ex/0611007];\nJ. Adams et al. [STAR Collaboration], \"Azimuthal anisotropy and correlations at large\ntransverse momenta in p + p and Au + Au collisions at s(NN)**(1/2) = 200-GeV,\" Phys. Rev.\nLett. 93, 252301 (2004) [arXiv:nucl-ex/0407007].\n[34] W. Wada, Phys. Rev. 75 (1949) 981;\nD. D. Ivanenko, V. A. Gurgenidze, DAN SSSR, 67 (1949) 997;\nD. I. Blokhintsev, V. L. Indenbom, ZhETF 20 (1950) 1123;\nG. Yekutieli, Nuovo Cim. 13 (1959) 446, 1306;\nW. Czyz, T. Ericson, S. L. Glashow, Nucl. Phys. 13 (1959) 516;\nW. Czyz, S. L. Glashow, Nucl. Phys. 20 (1960) 309;\nP. Smrz, Nucl. Phys. 35 (1962) 165;\nD. B. Ion, \"Mesonic Cerenkov-like Effect as Possible Mechanism of Meson Production in\nHadronic Interactions,\" DSc Thesis, Bucharest University (1971);\nD. B. Ion, \"The classical theory of mesonic Cerenkov radiation in nuclear media,\" St. Cerc. Fiz.\n22 (1970) 125;\nD. B. Ion, F. G. Nichitiu, \"A possible Cerenkov mechanism for single pion production in\nhadron-hadron interactions at high energy,\" Nucl. Phys. B29 (1971) 547;\nD. F. Zaretskii, V. V. Lomonosov, Sov. J. Nucl. Phys. 26 (1977) 639;\nI. M. Dremin, Pisma v ZhETF 30 (1979) 152; JETP Lett. 30 (1979) 140;\nI. M. Dremin, Yad. Fiz. 33 (1981) 1357; Sov. J. Nucl. Phys. 33 (1981) 726.\n[35] V. Koch, A. Majumder and X. N. Wang, \"Cherenkov Radiation from Jets in Heavy-ion\nCollisions,\" Phys. Rev. Lett. 96, 172302 (2006) [arXiv:nucl-th/0507063];\nI. M. Dremin, \"Ring-like events: Cherenkov gluons or Mach waves?,\" Nucl. Phys. A 767, 233\n(2006) [arXiv:hep-ph/0507167].\n[36] T. Faulkner and H. Liu, \"Meson widths from string worldsheet instantons,\" Phys. Lett. B 673,\n161 (2009) [arXiv:0807.0063 [hep-th]].\n[37] K. Peeters, J. Sonnenschein and M. Zamaklar, \"Holographic decays of large-spin mesons,\"\nJHEP 0602, 009 (2006) [arXiv:hep-th/0511044];\nA. L. Cotrone, L. Martucci and W. Troost, \"String splitting and strong coupling meson decay,\"\nPhys. Rev. Lett. 96 (2006) 141601 [arXiv:hep-th/0511045].\n\n– 46 –\n\n\f"}