{"id": "http://arxiv.org/abs/1007.0272v1", "guidislink": true, "updated": "2010-07-01T22:30:46Z", "updated_parsed": [2010, 7, 1, 22, 30, 46, 3, 182, 0], "published": "2010-07-01T22:30:46Z", "published_parsed": [2010, 7, 1, 22, 30, 46, 3, 182, 0], "title": "Oscillatory behavior in the quiet Sun observed with the New Solar\n  Telescope", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1007.1523%2C1007.3716%2C1007.3446%2C1007.3949%2C1007.4762%2C1007.2732%2C1007.0250%2C1007.0128%2C1007.4324%2C1007.3352%2C1007.2824%2C1007.2129%2C1007.4431%2C1007.3894%2C1007.3688%2C1007.3950%2C1007.4071%2C1007.2673%2C1007.3053%2C1007.3258%2C1007.4284%2C1007.4983%2C1007.2562%2C1007.4416%2C1007.0451%2C1007.0702%2C1007.1271%2C1007.0237%2C1007.0020%2C1007.4977%2C1007.3940%2C1007.0378%2C1007.1332%2C1007.0550%2C1007.3187%2C1007.4201%2C1007.4709%2C1007.3016%2C1007.3239%2C1007.2332%2C1007.3151%2C1007.3948%2C1007.0272%2C1007.2717%2C1007.3650%2C1007.1236%2C1007.4411%2C1007.2177%2C1007.4598%2C1007.0764%2C1007.3663%2C1007.3534%2C1007.1042%2C1007.0826%2C1007.3481%2C1007.5232%2C1007.2491%2C1007.4634%2C1007.0916%2C1007.2385%2C1007.3233%2C1007.0407%2C1007.4294%2C1007.2505%2C1007.0031%2C1007.1301%2C1007.5134%2C1007.2435%2C1007.4242%2C1007.4741%2C1007.3870%2C1007.1907%2C1007.3229%2C1007.2118%2C1007.3553%2C1007.0007%2C1007.1254%2C1007.1929%2C1007.4915%2C1007.3421%2C1007.2583%2C1007.4076%2C1007.5367%2C1007.2910%2C1007.1079%2C1007.3219%2C1007.5065%2C1007.3221%2C1007.4172%2C1007.2774%2C1007.5136%2C1007.2731%2C1007.3480%2C1007.4334%2C1007.4313%2C1007.5457%2C1007.0052%2C1007.5229%2C1007.0640%2C1007.1093%2C1007.2037&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Oscillatory behavior in the quiet Sun observed with the New Solar\n  Telescope"}, "summary": "Surface photometry of the quiet Sun has achieved an angular resolution of\n$0\".1$ with the New Solar Telescope at Big Bear Solar Observatory revealing\nthat a disproportionate fraction of the oscillatory events appear above\nobserved bright point-like structures. During the tracking of these structures,\nwe noted that the more powerful oscillatory events are cospatial with them,\nindicating that observed flux tubes may be the source of many observed\noscillatory events.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1007.1523%2C1007.3716%2C1007.3446%2C1007.3949%2C1007.4762%2C1007.2732%2C1007.0250%2C1007.0128%2C1007.4324%2C1007.3352%2C1007.2824%2C1007.2129%2C1007.4431%2C1007.3894%2C1007.3688%2C1007.3950%2C1007.4071%2C1007.2673%2C1007.3053%2C1007.3258%2C1007.4284%2C1007.4983%2C1007.2562%2C1007.4416%2C1007.0451%2C1007.0702%2C1007.1271%2C1007.0237%2C1007.0020%2C1007.4977%2C1007.3940%2C1007.0378%2C1007.1332%2C1007.0550%2C1007.3187%2C1007.4201%2C1007.4709%2C1007.3016%2C1007.3239%2C1007.2332%2C1007.3151%2C1007.3948%2C1007.0272%2C1007.2717%2C1007.3650%2C1007.1236%2C1007.4411%2C1007.2177%2C1007.4598%2C1007.0764%2C1007.3663%2C1007.3534%2C1007.1042%2C1007.0826%2C1007.3481%2C1007.5232%2C1007.2491%2C1007.4634%2C1007.0916%2C1007.2385%2C1007.3233%2C1007.0407%2C1007.4294%2C1007.2505%2C1007.0031%2C1007.1301%2C1007.5134%2C1007.2435%2C1007.4242%2C1007.4741%2C1007.3870%2C1007.1907%2C1007.3229%2C1007.2118%2C1007.3553%2C1007.0007%2C1007.1254%2C1007.1929%2C1007.4915%2C1007.3421%2C1007.2583%2C1007.4076%2C1007.5367%2C1007.2910%2C1007.1079%2C1007.3219%2C1007.5065%2C1007.3221%2C1007.4172%2C1007.2774%2C1007.5136%2C1007.2731%2C1007.3480%2C1007.4334%2C1007.4313%2C1007.5457%2C1007.0052%2C1007.5229%2C1007.0640%2C1007.1093%2C1007.2037&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Surface photometry of the quiet Sun has achieved an angular resolution of\n$0\".1$ with the New Solar Telescope at Big Bear Solar Observatory revealing\nthat a disproportionate fraction of the oscillatory events appear above\nobserved bright point-like structures. During the tracking of these structures,\nwe noted that the more powerful oscillatory events are cospatial with them,\nindicating that observed flux tubes may be the source of many observed\noscillatory events."}, "authors": ["A. ~Andic", "P. R. Goode", "J. Chae", "W. Cao", "K. Ahn", "V. Yurchyshyn", "V. Abramenko"], "author_detail": {"name": "V. Abramenko"}, "author": "V. Abramenko", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/2041-8205/717/2/L79", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1007.0272v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1007.0272v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "5 pages 4 figures", "arxiv_primary_category": {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1007.0272v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1007.0272v1", "journal_reference": "2010ApJ...717L..79A", "doi": "10.1088/2041-8205/717/2/L79", "fulltext": "Astrophysical Journal Letters manuscript No.\n(will be inserted by the editor)\n\nA. And̄ić * P.R.Goode * J. Chae * W. Cao * K. Ahn * V. Yurchyshyn * V.Abramenko\n\nOscillatory behavior in the quiet Sun\nobserved with the New Solar Telescope\n\narXiv:1007.0272v1 [astro-ph.SR] 1 Jul 2010\n\nHigh frequency oscillations observed with Rapid Dual Imager\n\nReceived: date\n\nAbstract Surface photometry of the quiet Sun has achieved\nan angular resolution of 0′′ .1 with the New Solar Telescope\nat Big Bear Solar Observatory revealing that a disproportionate fraction of the oscillatory events appear above observed bright point-like structures. During the tracking of\nthese structures, we noted that the more powerful oscillatory events are cospatial with them, indicating that observed\nflux tubes may be the source of many observed oscillatory\nevents.\nKeywords photosphere * oscillation\n\n1 Introduction\nWhen the excitation of oscillations of quiet-Sun (QS) regions is considered, one may think of the extensive research\non acoustic oscillations being driven by accelerated down\nflows in the already dark intergranular lanes (Rimmele et al.\n1995; Espagnet et al. 1996; Nordlund & Stein 2001; And̄ić\n2007); that is, dark lanes that get locally precipitously cooler\nand darker representing a sharp accelerating down flow followed by acoustic noise. However, the oscillations in the\ndark lanes could be more subtle with other types of oscillations being present as well. In particular, here we present observational evidence, using the New Solar Telescope (NST),\nA. And̄ić\nBig Bear Solar Observatory, 40386 North Shore Lane, BigBear City,\nCA 92314, USA\nTel.: +1-909-8665791 ex 21\nFax: +1-909-8664240\nE-mail: aandic@bbso.njit.edu\nP.R.Goode, J. Chae, W. Cao, K. Ahn, V. Yurchyshyn, V.Abramenko\nBig Bear Solar Observatory, 40386 North Shore Lane, BigBear City,\nCA 92314, USA\nJ. Chae, K. Ahn\nAstronomy Program, Department of Physics and Astronomy,Seoul National University, Seoul 151-741, Korea\n\nfor oscillations closely associated with the bright points (BPs)\non the dark lanes.\nSome of the simulations of magnetohydrodynamics (Vögler\net al. 2005 and references therein) showed the existence of\nthe small flux tubes in the QS lanes, those were not observed\nin significant number until HINODE observations (Ceteno et\nal. 2007; Isobe et al. 2008; Lites et al. 2008).\nRecently, Khomenko et al. (2008) found that oscillatory\nevents can, in addition, be caused by deep horizontal motions of the flux tube that generate a slow magnetic mode\nand a surface mode. They expect these modes to be efficiently transformed into slow acoustic modes in the vA < cS\natmosphere, where cS is the sound speed and vA the Alfvén\nspeed. Such a transformed mode should propagate along the\nfield lines and might effectively deposit the energy of the oscillatory driver into the chromosphere. Of course, this kind\nof the oscillatory generation can be seen only where flux\ntubes can be resolved.\nResearch so far established that Bright Points (BPs) are\nconnected with magnetic flux concentrations, with a size of\nabout 100 km, lifetimes of order of minutes and a tendency\nto form clusters if they are close to each other (Falchi et al.\n1999; Berger & Title, 1996; Berger et al., 2004; Viticchie et\nal., 2009).\nIn this work, we present the results of an analysis of the\noscillations seen in a QS area that was recently observed using the 1.6 meter New Solar Telescope (NST) (Goode et al.,\n2010) at Big Bear Solar Observatory (BBSO). The significantly greater spatial resolution of the NST makes possible observations providing a clearer picture of the mechanisms involved in QS dynamics. With increased resolution,\nwe observed a plethora of the BPs in the QS area and noted\ncospatial with them, behavior of the oscillations that indicate\nthat the flux tubes are an additional source of the oscillatory\nevents observed in the QS.\n\n2 Observations\nThe data set used here was obtained on 29 July 2009. We\nused an optical setup at the Nasmyth focus of the NST of\n\n\f2\n\nAnd̄ić et. al\n\nwhich the main components are a TiO broadband filter and\na PCO.2000 camera. The TiO filter has a central wavelength\nat 705.68 nm with a 1 nm band pass. This filter has also a\n1nm leakage around 613 nm with 25% of the transmission\ninto the main spectral line. However, this does not jeopardize the interpretation of our observations. Broadband filters\nintegrate in wavelength and average over the line and continuum intensities making the signal only weakly dependent on\nthe properties of individual spectral lines. That is desirable\nin our case since the TiO line is very weak in the QS. Hence,\nwe can assume that the height of formation in the data set is\nvery close to that of the continuum. Use of the TiO filter allowed us to observe the solar photosphere at the diffraction\nlimit of 0′′ .1. We used a camera with 2048×2048 pixels,\nwhere the pixel size is 7.4×7.4 μ m2 . The peak quantum efficiency (QE) of a camera is at 500 nm in the monochrome\nmode, yielding a QE 25% at the observed wavelength. The\nQS was observed at disk center.\nThe data sequence consists of 120 bursts with 100 images in each burst. The exposure time for an individual frame\nwas 10 ms. The cadence of the data, between bursts, is 15 s.\nThe data were acquired in the morning with seeing levels\nthat remained fairly constant throughout the observations.\nThe images have a sampling of 0.037\" per pixel. The CCD\nsampling was set to match the telescope's diffraction limited\nresolution in G − band, which caused a slight oversampling\nof the data.\n\n3 Data reduction and analysis methods\nThe data obtained were speckle reconstructed based on the\nspeckle masking method of [14] using the procedure and\ncode described in [23]. The short exposure times used for\nthese data freeze out atmospheric distortions and at the same\ntime capture the signals at high spatial frequencies (Sütterlin\net al., 2001); higher than studied here.\nThe cadence of our reconstructed data provided us with a\nNyquist frequency of 67 mHz. After speckle reduction, images were co- aligned using a Fourier co-aligning routine,\nwhich uses cross-correlation techniques and mean squared\nabsolute deviation to provide sub-pixel co-alignment accuracy. However, we did not implement sub-pixel image shifting to avoid interpolation errors. Instead, the procedure was\niterated 6 times to achieve the best possible co-alignment.\nWe analyzed oscillations in the most reliable period range\nachievable with our data sets, from 87 s to 700 s. The decision to analyze only this range, even when our Nyquist frequency would allow access to shorter periods, came from\ncamera induced noise that severely effected the signal for\nshorter periods. In order to strengthen reliability of our results we ignored the oscillations with the periods shorter\nthan 87 s.\nWavelet analysis of the light curves was performed using\nthe Morlet wavelet:\nt2\n\nψ0 (t) = π − 4 eiω0 t e− 2 ,\n1\n\n(1)\n\nwhere ω0 is a non-dimensional frequency and t is a nondimensional time parameter. The wavelet analysis code used\nin this work is based on the work of Torrence and Compo\n(1998), and our approach to automated wavelet analysis has\nbeen carried out previously, and presented in detail in Bloomfield et al. 2006.\nTo ensure that detected oscillations correspond to the\nreal periodic motion, we applied several constraining criteria:\n– The light curve was tested against spurious detections\nof power that may be caused by Poisson noise, assuming that it is normally distributed and following a χ 2\ndistribution with two degrees of freedom. A confidence\nlevel of 99% was set by multiplying the power in the\nbackground spectrum by the values of χ 2 corresponding to the 99th percentile of the distribution, (Torrence\n&Compo 1998; Mathiooudakis et al. 2003).\n– The light curve was compared with a large number (1500)\nof randomized time strings with identical count distributions. Comparing the value of power found in the input light curve with the number of times that the power\ntransform of the randomized strings produced a peak of\nsimilar power. The probability of detecting non-periodic\npower was calculated for the peak power at each timestep (Banerjee et al., 2001).\n– All oscillations of duration less than 1.3 cycles were excluded in a comparison of the width of the peak in the\nwavelet power spectrum with the decorrelation time. This\nis done to distinguish between a spike in the data and a\nharmonic periodic component at the equivalent Fourier\nfrequency, thus defining the oscillation lifetime at the\nperiod of each power maximum as the interval of time\nfrom when the power supersedes 95% significance, until\nit subsequently dips below 95% significance (McAteer\net al. 2004). To obtain the number of cycles the lifetime\nis divided by the period.\n– All oscillations above a period of 701 s were excluded as\nwell, since they might be caused by edge effects due to\nthe limited time sequence of our data. This highest credible period was calculated using the relationship between\nperiod of the oscillations and the length of our data set.\nWe decided to ignore all periods that do not cover at least\n2 cycles of the wave during our time series, in order to\neliminate possible edge effects.\nWe analyzed 42 BPs and tracked their displacement within\nthe field of view. In our field of view, there was a plethora of\nobserved BP-like structures. Since we do not have magnetic\ninformation, we choose the BPs using their evolution and\nsize as determining factors. As criteria we used behavior,\ndimension and evolution of the BPs, which were already established in previous research (Berger et al., 2004; Viticchie\net al., 2009). As the result, majority of the BPs analyzed here\nhave an average size of 0′′ .2, a lifetime around 5 min and if\nthey are close enough to each other, they tend to form clusters. To broaden our sample we included few of the BP-like\n\n\fOscillatory behavior in the quiet sun observed with NST\n\nFig. 1 The position of a detected oscillation in the field of view. The\nimage shows detected power directly within a BP-like structure. Oscillations are represented with the blue contour. For this image, we took\ninto consideration only oscillations with power above 80% of maximum oscillatory power.\n\nstructures that do not match these criteria. Two of them were\npresent in images throughout our whole data set and 3 have\nvery short lifetimes, being visible only for a minute. Each of\nthem was tracked using the NAVE methodology ([6]). The\nNAVE method uses nonlinear affine velocity estimator to detect sub-pixel motions, super-pixel motions and nonuniform\nmotions.\n\n4 Results\nPrevious works (Rimmele et al., 1995; Espagnet et al., 1996;\nAndic, 2007) noted oscillations are located mostly in intergranular lanes, i.e. darker parts of the observed granulation\npattern. In the work by Andic (2007), 70% of all registered\noscillatory power at a height of 200 km above τ500 = 1 level\nwas cospatial with the darker parts. However, the results here\ncontradict those findings. We found that there is a significant\ncontribution to the oscillatory power at the BPs observed in\nthe QS area.\nWe analyzed separately the oscillations with the power\nabove 80% of the maximum oscillatory power. Our results\nshowed that those oscillations tend to appear above the BPlike structures. Fig.1 shows an example of one of those results. In the figure, this strong oscillation is presented with a\nblue contour, located at coordinates (7′′ .5, 9′′ .7), which encompasses only few pixels directly on the top of the BP\nstructure. As long as this high oscillatory power was detectable in the data set, the structure did not showed any\nmovement or visible evolution. These peaks of power lasted\nbetween 30 s, and 120 s.\nSimilar results were obtained when we included all registered power into the analysis. We took a sub-area of the image that surrounds the analyzed BP. The analyzed sub-area\nwas 3′′ .5 × 3′′ .5, in average with the single BP was occupying around 3% of the sub-area surface. We formed masks\nthat isolated the analyzed BP in the sub-area, and an inverse\nmask that eliminated the BP in question. In Fig.2, for each\n\n3\n\nFig. 2 The percentage of the oscillatory power in masked area that appears within the BP, covering the range of period analyzed, is presented\nfor 42 BPs. The percentage is averaged over the time and space. The\ndotted lines with triangles present an average percentage of power that\nappeared within individual BPs. To illustrate the main trend, an average of all analyzed BPs is presented in thick solid line. And horizontal\nsolid line marks the 50% level.\n\nanalyzed BP, we showed the percentage of the power that\nappears within the BP across the period range. The percentage is averaged over the duration of our data and analyzed\nsurface. The dotted lines represent the change in the percentage over the period range for each BP, the triangles present\nan average percentage for that particular period sub-range.\nTo illustrate the main trend, an average is calculated from\nall analyzed BPs and it is presented as a thick solid line. We\nnote that for most period ranges the BPs tend to contribute\nsignificantly to the power in the sub-area. Most of the BPs\nhad more than 50% of the sub-areal power cospatial with\nthem even though the BPs covered only about 3% of each\nsub-area.\nIt seems that there is a noticeable drop in contribution\nfor longer periods. This might be a consequence of the BPs\nlifetime. An average lifetime of analyzed BPs was around\n4.3 min. Oscillations with a longer period than the lifetime\ncannot be observed at non-existent BPs.\nThe wavelet analysis employs pixel by pixel curves, so\nif an oscillatory source moves from one pixel to another, the\nautomated analysis will conclude that the oscillation ceased.\nAlso due to the shift of wave train from one pixel to another, the wave train is interrupted and as such partially disregarded from our analysis because it does not fulfill the\ncycle conditions imposed on the data set (see section 3).\nThe end result will be the detection of fewer oscillations. By\ntracking the detected source across the field of view, one can\nbe assured that the source is always at the same pixel. This\nprocedure ensures that the observed wave trains are not artificially interrupted but registered and analyzed in full. This\nprocedure yields, as a result, a more accurate picture of oscillations in the QS.\nWe decided to follow a number (42) of BP-like structures and register the oscillations above them. We tracked\nthe structures using the NAVE method. Then, using an information about the motion of the structure obtained with\nthe NAVE method, we aligned the sub-images in such a way\nthat a tracked structure was always in the same position. As\n\n\f4\n\nAnd̄ić et. al\n\ngues that small flux tubes will create oscillations by their\nmotions, and then conduct them upward. Our work indicates\nthat this might be correct.\nThe higher resolution of the NST enabled us to detect a\nricher spectrum of BPs, and in turn yielded the conclusion\nthat a fraction of the oscillatory power registered in QS lanes\nis essentially cospatial with BPs. Our plots showed a preference for the oscillations to appear above small structures in\nthe granulation image.\nWe observe more oscillatory power within the BPs as\ncompared to areas that do not contain any BPs. Since the\nFig. 3 The observed oscillatory power averaged over time and space observed extra power is co-spatial with the BPs, this might\nin our data set. The solid line represent the oscillatory power observed\nwithin the 42 tracked BP structures. The dashed and doted-dashed lines indicate that this extra power is generated by a driver conrepresents the averaged oscillatory power above the area in which nei- nected with the BPs. One of the possible drivers is described\nther BP nor any small structure was detected during our time series, in the work by Khomenko et al. (2008). Waves are generdashed line represent the power above granules, while doted-dashed ated by deep horizontal motions of the flux tubes; those moline above the lanes.\ntions generate a slow magnetic and a surface mode that are\nefficiently transformed into a slow acoustic mode inside of\na comparison region for the amount of the emitted oscilla- those flux tubes. However, we registered oscillations only at\ntions, we chose several sub-areas (3′′ .5 × 3′′ .5) of true QS; the height very close to τ500 = 1 level without any indication\nmeaning, we took care that these areas did not contained of the shock formation, so we can only speculate that this\neither a single BP or any other small structure during the extra power is caused by the driver described in Khomenko\nwhole duration of our time series. Those sub-areas contained et al. (2008). In favor of this speculation goes the simple deonly granules and the lanes that look empty at our resolution. duction that if the all of the observed oscillations were genThis gave us a referent power of the emitted oscillations for erated without any contribution by BPs, then the averaged\npower over the compared areas should be similar in intencomparison.\nBy tracking BPs, we were able to observe the oscillatory sity. Since this is not a case, we have the implication that\npower that is connected with the BPs and not their move- there is an additional oscillatory driver connected with BPs.\nMost of the low intensity BPs were not detectable with\nment. In the Fig.3, we can see that oscillations detected within\nthe BPs have more power than oscillations detected over the earlier lower resolution observations and hence could not be\nareas where neither a BP nor any small structure was ob- connected to the oscillatory behavior, leading to the earlier\nserved during the time series. This apparent difference in conclusions that the all powerful oscillatory behavior in the\nthe power may indicate different drivers for registered oscil- QS is connected with the pure dark lanes ([1]) and turbulent\nlations. The noticeable trend for longer period oscillations plasma flow. Our research implies that a part of oscillatory\nstrengthen the conclusion that the drop in percentage from events we observed are connected with the previously unobFig.2 for the same range is in part a consequence of the served plethora of the flux tubes in QS (Ceteno et al., 2007;\nIsobe et al., 2008; Lites et al., 2008). Due to the limitation\nmethod of analysis.\nWith current resolution of the NST, we are capable of of our data set we were unable to determine does these osresolving much finer detail in the photosphere. However, if cillations propagate upward and how much they contribute\nthe same image is degraded to match the resolution of the to the heating of the upper layers of the solar atmosphere.\nold telescope in BBSO, we can see that only the most inOur main conclusion is that a part of the detected ostense BPs structures remain visible, while the rest of them cillations exists within the small magnetic flux tubes. The\ndisappear in the lanes. This is illustrated in Fig.4.\nobserved additional oscillatory power is most likely generThe left panel of Fig.4 presents a part of a random granu- ated by the additional driver closely connected with BPs. We\nlation image from our data set, while in the right panel is that expect to learn more about the nature of these oscillatory\nsame image degraded so that resolution of it corresponds to events with the installation of the newly developed instruthat of the old BBSO telescope. Hardly any BPs in the right ments at NST that will allow us access to a high resolution\npanel can be detected in the left panel.\nDoppler maps and vector magnetograms at multiple heights\nin the solar atmosphere.\n5 Conclusions\nWhen the proper motion of the BPs is removed, we can detect above them more powerful oscillations than above the\nareas in the field of view where neither a BP nor any small\nstructure was detected. Work by Khomenko et al. (2008) ar-\n\nAcknowledgements We would like to thank anonymous referee for\nthe comments that helped to sharpen the some key point in this paper.\nWe gratefully acknowledge support of NSF (ATM-0745744 and ATM0847126), NASA (NNX08BA22G) and AFOSR (FA9550-09-1-0655).\nWe are grateful to our knowledgable engineers for making possible for\nus to observe even during the final tuning of the telescope at Nasimyth\nfocus.\n\n\fOscillatory behavior in the quiet sun observed with NST\n\n5\n\nFig. 4 The examples of the granular field. The left panel shows granulation as it is observed with the NST (1.6 m) at BBSO. The right panel\nshows how that same granulation would have looked if observed with the old, 0.6 m telescope at BBSO. To make the right panel, the image on\nthe left was degraded to match the resolution of the old telescope.\n\nReferences\n1. And̄ić,A. 2007, So.Ph., 243, 131A\n2. Banerjee,D., O'Shea,E., Doyle,J.G., Goossens,M. 2001, A&A,\n371, 1137\n3. Berger, T.E., Title, A.M. 1996, ApJ, 463, 365\n4. Berger,T.E., Rouppe van der Voort,L.H.M., Löfdahl,M.G., Carlsson,M., Fossum,A., Hansteen,V.H., Marthinussen,E, Title,A.,\nScharmer,G. 2004, A&A, 428, 613\n5. Bloomfield,D.S., McAteer,R.T.J., Mathioudakis,M., Keenan,F.P.\n2006, ApJ, 652, 812B\n6. Chae,J., Sakurai,T. 2008, ApJ, 689, 593\n7. Centeno,R., Socas-Navarro,H., Lites,B., Kubo,M., Frank,Z.,\nShine,R., Tarbell,T., Title,A., Ichimoto,K., Tsuneta,S., Katsukawa,Y., Suematsu,Y., Shimizu,T., Nagata.S. 2007, ApJ, 666,\nL137\n8. Espagnet,O., Muller,R., Roudier,Th., Mein,P., Mein,N., Malherbe,J.M. 1996, A&A, 313, 297\n9. Falchi,A., Cauzzi,G., Falciani,R., Vial,J.C. 1999, in APS Conference Series Vol. 184:Magnetic Fields and Oscillations, ed.\nB.Schmieder, A.Hofmann, J.Staude, 261\n10. Goode,P.R., Yurchyshyn,V., Cao,W., Abramenko.V., Andic,A.,\nAhn,K., Chae, J. 2010, ApJ, 714, L31\n11. Isobe,H., Proctor,M.R.E., Weiss,N.O. 2008, ApJ, 679, L57\n12. Khomenko,E., Collados,M., Felipe,T. 2008, So.Ph., 251, 589\n13. Lites,B.W., Kubo,M., Socas-Navarro,H., Berger,T., Frank,Z.,\nShine,R., Tarbell,T., Title,A., Ichimoto,K., Katsukawa,Y.,\nTshuneta,S., Suematsu,Y., Shimizu,T., Nagata.S. 2008, ApJ,\n672, 1237\n14. von der Lühe,O. 1993, A&A, 268, 347\n15. Mathioudakis,M.,Seiradakis,J.H., Williams,D.R., Avgoloupis,S.,\nBloomfield,D.S., McAteer,R.T.J. 2003, A&A, 403, 1101\n16. McAteer,R.T.J., Gallagher,P.T., Bloomfield,D.S., Williams,D.R.,\nMathioudakis,M., Keenan,F.P. 2004, ApJ, 602, 436\n17. Nordlund,Ȧ., Stein,R.F. 2001, ApJ, 546, 576\n18. Rimmele,T.R., Goode,P.R., Harold,E., Stebbins,R.T. 1995, ApJ,\n444, L119\n19. Sütterlin,P.,Hammerschlag,R.H., Bettonvil,F.C.M., et al., 2001,\nASP Conference Series, Vol. 236\n20. Torrence,C., Compo,G.P. 1998, Bull. Amer. Meteor. Soc. 79, 61\n21. Viticchié,B., Del Moro,D., Berrilli,F., Bellot Rubio,L.,\nTritschler,A. 2009 ApJ, 700L, 145V\n22. Vögler,A., Shelyag,S., Schüssler,M., Cattaneo,F., Emonet,T.,\nLinde,T. 2005 A&A, 429, 335\n23. Wöger,F., von der Lühe,O., Reardon,K. 2008, A&A, 488, 375W\n\n\f"}