{"id": "http://arxiv.org/abs/1003.3652v1", "guidislink": true, "updated": "2010-03-18T18:52:26Z", "updated_parsed": [2010, 3, 18, 18, 52, 26, 3, 77, 0], "published": "2010-03-18T18:52:26Z", "published_parsed": [2010, 3, 18, 18, 52, 26, 3, 77, 0], "title": "SNS: Analytic Receiver Analysis Software Using Electrical Scattering\n  Matrices", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.5038%2C1003.3909%2C1003.1227%2C1003.1352%2C1003.0945%2C1003.3735%2C1003.1337%2C1003.2608%2C1003.5796%2C1003.1718%2C1003.0649%2C1003.4606%2C1003.5945%2C1003.1475%2C1003.3001%2C1003.2225%2C1003.3082%2C1003.0110%2C1003.3107%2C1003.0453%2C1003.0865%2C1003.2104%2C1003.3832%2C1003.4100%2C1003.1565%2C1003.1701%2C1003.0899%2C1003.2486%2C1003.5131%2C1003.4940%2C1003.0060%2C1003.4314%2C1003.4002%2C1003.5198%2C1003.4946%2C1003.2871%2C1003.0420%2C1003.3028%2C1003.2943%2C1003.4429%2C1003.5279%2C1003.3289%2C1003.4060%2C1003.0841%2C1003.5148%2C1003.3000%2C1003.0824%2C1003.4749%2C1003.1525%2C1003.1843%2C1003.0020%2C1003.3259%2C1003.5774%2C1003.3297%2C1003.2517%2C1003.1618%2C1003.1908%2C1003.1127%2C1003.4153%2C1003.1738%2C1003.1065%2C1003.2521%2C1003.3958%2C1003.3249%2C1003.1764%2C1003.3220%2C1003.4991%2C1003.5857%2C1003.1877%2C1003.0476%2C1003.3935%2C1003.0889%2C1003.0957%2C1003.3652%2C1003.3521%2C1003.3424%2C1003.0657%2C1003.2876%2C1003.0831%2C1003.3898%2C1003.4557%2C1003.3519%2C1003.1489%2C1003.5860%2C1003.2181%2C1003.2408%2C1003.0980%2C1003.5025%2C1003.5116%2C1003.2526%2C1003.4857%2C1003.4838%2C1003.4733%2C1003.0609%2C1003.1564%2C1003.2417%2C1003.5454%2C1003.1781%2C1003.3359%2C1003.0816%2C1003.0119&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "SNS: Analytic Receiver Analysis Software Using Electrical Scattering\n  Matrices"}, "summary": "SNS is a MATLAB-based software library written to aid in the design and\nanalysis of receiver architectures. It uses electrical scattering matrices and\nnoise wave vectors to describe receiver architectures of arbitrary topology and\ncomplexity. It differs from existing freely-available software mainly in that\nthe scattering matrices used to describe the receiver and its components are\nanalytic rather than numeric. This allows different types of modeling and\nanalysis of receivers to be performed. Non-ideal behavior of receiver\ncomponents can be parameterized in their scattering matrices. SNS enables the\ninstrument designer to then derive analytic expressions for the signal and\nnoise at the receiver outputs in terms of parameterized component\nimperfections, and predict their contribution to receiver systematic errors\nprecisely. This can drive the receiver design process by, for instance,\nallowing the instrument designer to identify which component imperfections\ncontribute most to receiver systematic errors, and hence place firm\nspecifications on individual components. Using SNS to perform this analysis is\npreferable to traditional Jones matrix-based analysis as it includes internal\nreflections and is able to model noise: two effects which Jones matrix analysis\nis unable to describe. SNS can be used to model any receiver in which the\ncomponents can be described by scattering matrices. Of particular interest to\nthe sub-mm and terahertz frequency regime is the choice between coherent and\ndirect detection technologies. Steady improvements in mm and sub-mm Low Noise\nAmplifiers (LNAs) mean that coherent receivers with LNAs as their first active\nelement are becoming increasingly competitive, in terms of sensitivity, with\nbolometer-based receivers at frequencies above ~100 GHz. As an example of the\nutility of SNS, we use it to compare two polarimeter architectures commonly\nused to perform measurements of the polarized Cosmic Microwave Background:\ndifferencing polarimeters, an architecture commonly used in polarization\nsensitive bolometer-based polarimeters; and pseudo-correlation polarimeters, an\narchitecture commonly used in coherent, LNA-based, polarimeters. We\nparameterize common sources of receiver systematic errors in both architectures\nand compare them through their Mueller matrices, which encode how well the\ninstruments measure the Stokes parameters of the incident radiation. These\nanalytic Mueller matrices are used to demonstrate the different sources of\nsystematic errors in differencing and correlation polarimeters.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.5038%2C1003.3909%2C1003.1227%2C1003.1352%2C1003.0945%2C1003.3735%2C1003.1337%2C1003.2608%2C1003.5796%2C1003.1718%2C1003.0649%2C1003.4606%2C1003.5945%2C1003.1475%2C1003.3001%2C1003.2225%2C1003.3082%2C1003.0110%2C1003.3107%2C1003.0453%2C1003.0865%2C1003.2104%2C1003.3832%2C1003.4100%2C1003.1565%2C1003.1701%2C1003.0899%2C1003.2486%2C1003.5131%2C1003.4940%2C1003.0060%2C1003.4314%2C1003.4002%2C1003.5198%2C1003.4946%2C1003.2871%2C1003.0420%2C1003.3028%2C1003.2943%2C1003.4429%2C1003.5279%2C1003.3289%2C1003.4060%2C1003.0841%2C1003.5148%2C1003.3000%2C1003.0824%2C1003.4749%2C1003.1525%2C1003.1843%2C1003.0020%2C1003.3259%2C1003.5774%2C1003.3297%2C1003.2517%2C1003.1618%2C1003.1908%2C1003.1127%2C1003.4153%2C1003.1738%2C1003.1065%2C1003.2521%2C1003.3958%2C1003.3249%2C1003.1764%2C1003.3220%2C1003.4991%2C1003.5857%2C1003.1877%2C1003.0476%2C1003.3935%2C1003.0889%2C1003.0957%2C1003.3652%2C1003.3521%2C1003.3424%2C1003.0657%2C1003.2876%2C1003.0831%2C1003.3898%2C1003.4557%2C1003.3519%2C1003.1489%2C1003.5860%2C1003.2181%2C1003.2408%2C1003.0980%2C1003.5025%2C1003.5116%2C1003.2526%2C1003.4857%2C1003.4838%2C1003.4733%2C1003.0609%2C1003.1564%2C1003.2417%2C1003.5454%2C1003.1781%2C1003.3359%2C1003.0816%2C1003.0119&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "SNS is a MATLAB-based software library written to aid in the design and\nanalysis of receiver architectures. It uses electrical scattering matrices and\nnoise wave vectors to describe receiver architectures of arbitrary topology and\ncomplexity. It differs from existing freely-available software mainly in that\nthe scattering matrices used to describe the receiver and its components are\nanalytic rather than numeric. This allows different types of modeling and\nanalysis of receivers to be performed. Non-ideal behavior of receiver\ncomponents can be parameterized in their scattering matrices. SNS enables the\ninstrument designer to then derive analytic expressions for the signal and\nnoise at the receiver outputs in terms of parameterized component\nimperfections, and predict their contribution to receiver systematic errors\nprecisely. This can drive the receiver design process by, for instance,\nallowing the instrument designer to identify which component imperfections\ncontribute most to receiver systematic errors, and hence place firm\nspecifications on individual components. Using SNS to perform this analysis is\npreferable to traditional Jones matrix-based analysis as it includes internal\nreflections and is able to model noise: two effects which Jones matrix analysis\nis unable to describe. SNS can be used to model any receiver in which the\ncomponents can be described by scattering matrices. Of particular interest to\nthe sub-mm and terahertz frequency regime is the choice between coherent and\ndirect detection technologies. Steady improvements in mm and sub-mm Low Noise\nAmplifiers (LNAs) mean that coherent receivers with LNAs as their first active\nelement are becoming increasingly competitive, in terms of sensitivity, with\nbolometer-based receivers at frequencies above ~100 GHz. As an example of the\nutility of SNS, we use it to compare two polarimeter architectures commonly\nused to perform measurements of the polarized Cosmic Microwave Background:\ndifferencing polarimeters, an architecture commonly used in polarization\nsensitive bolometer-based polarimeters; and pseudo-correlation polarimeters, an\narchitecture commonly used in coherent, LNA-based, polarimeters. We\nparameterize common sources of receiver systematic errors in both architectures\nand compare them through their Mueller matrices, which encode how well the\ninstruments measure the Stokes parameters of the incident radiation. These\nanalytic Mueller matrices are used to demonstrate the different sources of\nsystematic errors in differencing and correlation polarimeters."}, "authors": ["Oliver G. King"], "author_detail": {"name": "Oliver G. King"}, "author": "Oliver G. King", "arxiv_comment": "10 pages, 7 figures, to be presented at the 21st International\n  Symposium on Space Terahertz Technology", "links": [{"href": "http://arxiv.org/abs/1003.3652v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1003.3652v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph.IM", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.IM", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1003.3652v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1003.3652v1", "journal_reference": null, "doi": null, "fulltext": "SNS: Analytic Receiver Analysis Software\nUsing Electrical Scattering Matrices\n\narXiv:1003.3652v1 [astro-ph.IM] 18 Mar 2010\n\n∗ California\n\nOliver G. King∗†\nInstitute of Technology, MC 249-17, 1200 E. California Blvd., Pasadena, CA, 91125\n† Contact: ogk@astro.caltech.edu\n\nAbstract-SNS is a MATLAB-based software library written\nto aid in the design and analysis of receiver architectures. It uses\nelectrical scattering matrices and noise wave vectors to describe\nreceiver architectures of arbitrary topology and complexity. It\ndiffers from existing freely-available software mainly in that the\nscattering matrices used to describe the receiver and its components are analytic rather than numeric. This allows different\ntypes of modeling and analysis of receivers to be performed.\nNon-ideal behavior of receiver components can be parameterized in their scattering matrices. SNS enables the instrument\ndesigner to then derive analytic expressions for the signal\nand noise at the receiver outputs in terms of parameterized\ncomponent imperfections, and predict their contribution to receiver systematic errors precisely. This can drive the receiver\ndesign process by, for instance, allowing the instrument designer\nto identify which component imperfections contribute most to\nreceiver systematic errors, and hence place firm specifications\non individual components. Using SNS to perform this analysis\nis preferable to traditional Jones matrix-based analysis as it\nincludes internal reflections and is able to model noise: two effects\nwhich Jones matrix analysis is unable to describe.\nSNS can be used to model any receiver in which the components can be described by scattering matrices. Of particular\ninterest to the sub-mm and terahertz frequency regime is the\nchoice between coherent and direct detection technologies. Steady\nimprovements in mm and sub-mm Low Noise Amplifiers (LNAs)\nmean that coherent receivers with LNAs as their first active\nelement are becoming increasingly competitive, in terms of\nsensitivity, with bolometer-based receivers at frequencies above\n∼ 100 GHz.\nAs an example of the utility of SNS, we use it to compare two polarimeter architectures commonly used to perform\nmeasurements of the polarized Cosmic Microwave Background:\ndifferencing polarimeters, an architecture commonly used in\npolarization sensitive bolometer-based polarimeters; and pseudocorrelation polarimeters, an architecture commonly used in\ncoherent, LNA-based, polarimeters. We parameterize common\nsources of receiver systematic errors in both architectures and\ncompare them through their Mueller matrices, which encode\nhow well the instruments measure the Stokes parameters of the\nincident radiation. These analytic Mueller matrices are used\nto demonstrate the different sources of systematic errors in\ndifferencing and correlation polarimeters.\n\nAn instrument built to detect very faint signals will almost\ncertainly be heavily affected by systematic errors. It is increasingly important to be able to model the effects of receiver\nsystematic errors on the measured signal, and on the receiver\nsensitivity. We want to be able predict the level of receiver\nsystematic errors, show their impact on the gathered data,\nand make quantitative comparisons between different receiver\narchitectures.\nPrevious analytic and semi-analytic approaches to characterizing systematic effects in receivers have usually employed\nJones matrices to describe receiver components and Mueller\nmatrices to characterize the effects of receiver systematics on\nthe observed Stokes parameters [3], [4]. The use of Jones matrices to describe individual receiver components has several\nshortcomings. Only the forward path of the signal through\nthe instrument is modeled – internal scattering caused by\nreflections from poorly matched components is not included;\nand Jones matrix modeling is unable to describe component\nnoise, and hence receiver sensitivity. Modeling a receiver with\na full analytic description of the outputs and sensitivity in\nterms of individual component parameters allows us to identify\nwhich parameters of each component in a receiver are most\nimportant, and concentrate our efforts on improving them.\n\nI. I NTRODUCTION\n\nThis paper introduces a technique and software for developing full analytic descriptions of receiver outputs and\nsensitivities in terms of lab-measureable errors in individual\ncomponents. In this technique components are modeled by\nelectrical scattering matrices. When describing a network of\ncomponents with Jones matrices the forward-path cascaded\nresponse can be obtained through simple matrix manipulation\nand multiplication. The scattering matrix formulation does not\nshare this simplicity of calculation: only the case of cascaded\n2-port devices is amenable to a relatively simple analytic\nsolution. This paper describes an algorithm for calculating\nthe response of arbitrarily connected networks of components.\nWe present software which implements this algorithm, and\napply it to two common polarimeter architectures: differencing\npolarimeters, and pseudo-correlation polarimeters.\n\nMany fields of astrophysics aim to measure increasingly\nfaint signals. For instance, there is great interest at present in\ndetecting and characterizing the B-mode [1] of the polarized\nCosmic Microwave Background (CMB). The strength of this\nsignal is not yet determined by theory, but a strong upper limit\nis 170 nK [2], a tiny fraction of the CMB total intensity signal\n(∼ 2.7 K).\n\nThis software allows us to make robust analytic comparisons of receiver architectures. Errors in individual receiver\ncomponents can be parameterized and propagated into the\ndescription of the receiver performance, e.g. the instrument\nMueller matrix. We hence have a powerful tool for guiding\nthe instrument design process and diagnosing the causes of\nnon-ideal instrument behavior.\n\n\f2\n\nII. E LECTRICAL S CATTERING M ATRICES\nWe model the behavior of individual receiver components,\nand the full receiver, using electrical scattering matrices.\nThe electrical scattering matrix (hereafter referred to as the\nscattering matrix) is a representation of a network using the\nideas of incident, reflected, and transmitted waves. It provides\na complete description of an N -port network as seen at\nits N ports. A significant advantage of modeling receiver\ncomponents with scattering matrices is that noise can easily\nbe included in the modeling. The noise produced by a device\nis modeled with a noise wave vector; see e.g. [5].\nConsider the arbitrary N -port network shown in Figure 1a.\nWe denote the incident wave at port i by Vi+ , the reflected\nwave by Vi− , and the noise wave produced by the network at\nthat port by ci . These quantities are related by the scattering\nmatrix S and noise wave vector c as follows:\n  +  \n − \nc1\nV1\nS11 S12 * * * S1N\nV1\n   \n  \n.\n   \n − \n.. \n V2+   c2 \nV2   S21\n   +   (1)\n =\n  ..   .. \n ..   ..\n .   . \n .   .\n   \n  \nVN−\n\nSN 1\n\n***\n\nVN+\n\nSN N\n\ncN\n\nThe noise wave voltages ci of an N -port network are\ncomplex time-varying random variables characterized by a\ncorrelation matrix C\nC =hc ⊗ c† i\n\nh|c1 |2 i\n\n hc2 c∗1 i\n\n= .\n ..\n\nhcN c∗1 i\n\nhc1 c∗2 i\n\n***\n\n***\n\nhc1 c∗N i\n.. \n. \n\n\n\n\nh|cN |2 i\n\nFirst, let us consider the effect of connecting together ports\nk and m of an N -port network described by Equation 1.\nConnecting the ports means that Vk+ = Vm− and Vk− = Vm+ .\nManipulation of rows k and m of Equation 1 then gives us\nthe expressions\nX\nSmi\nSmm\ncm\nVm− =\nV++\nV−+\n(3)\n1 − Smk i\n1 − Smk k\n1 − Smk\ni6=k,m\nX\nSki\nSkk\nck\nVk− =\nVi+ +\nVm− +\n(4)\n1 − Skm\n1 − Skm\n1 − Skm\ni6=k,m\n\nBy substituting Equations 3 and 4 into each other we\ncan obtain expressions for Vm− and Vk− . Substituting these\nexpressions into Equation 1 we can obtain a new expression\nfor the reflected wave Vi− :\n\"\nX\n(1 − Skm )(1 − Smk )\nSij +\nVi− =\n(1 − Skm )(1 − Smk ) − Skk Smm\nj6=k,m\n\nSik Smj\nSik Smm Skj\n+\n1 − Smk\n(1 − Smk )(1 − Skm )\nSim Skj\nSim Skk Smj\n+\n+\n1 − Skm\n(1 − Skm )(1 − Smk )\n\n!#\nVj+\n\n(1 − Skm )cm + Smm ck\n+ ci + Sik\n(1 − Skm )(1 − Smk ) − Skk Smm\n!\n(1 − Smk )ck + Skk cm\n+ Sim\n(1 − Skm )(1 − Smk ) − Skk Smm\n\n!\n\n(5)\n\n\n\nwhere the angle brackets indicate time averaging, † indicates\nthe conjugate transpose operation, and ⊗ indicates the outer\nproduct (or Kronecker product). The diagonal terms of C give\nthe noise power deliverable at each port in a 1 Hz bandwidth.\nThe off-diagonal terms are correlation products. The noise\ncorrelation matrix C for a passive network is determined from\nits scattering matrix S by [6]\n†\n\nC = kT (I − SS )\n\n(2)\n\nwhere k is Boltzmann's constant, T is the physical temperature\nof the network, and I is the identity matrix. The noise\ncorrelation matrix for an active network can be determined\nby measurement or modeling.\nIII. S OLVING A RBITRARY N ETWORKS\nConsider the arbitrarily connected network of N -port networks shown in Figure 1b. We need an algorithm to calculate\nthe scattering matrix S and noise wave vector c which describe the connected network. The algorithm derived here is\nan extension of the algorithm described in [7], with added\nnoise wave vector manipulation. Similar algorithms are used\nnumerically in SUPERMIX [8].\n\nFrom Equation 5 we obtain replacement expressions for the\nelements Sij of S and the noise waves ci :\nh\nnew\nSij\n=Sij + A Sik Smj (1 − Skm ) + Sik Skj Smm\ni\n+ Sim Skj (1 − Smk ) + Sim Smj Skk\n(6)\nh\n\u0001\ncnew\n=ci + A Sim Skk + Sik (1 − Skm ) cm\ni\n\u0001 i\n+ Sik Smm + Sim (1 − Smk ) ck\n(7)\nwhere A =\n\n1\n(1 − Skm )(1 − Smk ) − Skk Smm\n\nRows and columns k and m are then removed from S and\nrows k and m are removed from c to create the scattering\nmatrix and noise vector which describe the new (N − 2)-port\nnetwork.\nA. Algorithm\nTo obtain the scattering matrix and noise wave vector which\ndescribe the arbitrarily connected network shown in Figure 1b\nbegin by forming the scattering matrix and noise wave vector\nwhich describe the unconnected network:\n\n\n \nS1 0 * * *\n0\nc1\n\n \n.. \n 0 S2\n c2 \n. \n\n\n \nS= .\n,c =  . \n(8)\n\n ..\n\n .. \n\n\n \n0 ***\nSN\ncN\n\n\f3\n\nN-port\n\n+\n\n-\n\nV2\n\nV2\n\nports\n\nNode\n\nN-port\n\nNb Nf\n2 1\n\nports\n\nNb Nf\n3 2\n\n3\n\n1\n\np2\n\nc2\n\nc3\n\nV\n\n+\n\nV1\n\n-\n\nV1\n\np1\nc1\n\np3\n\nFig. 2. Schematic showing the nature of node and N -port objects and how\nthey connect to each other in the software.\n\n-\n\n+\n\nVN\n(a)\n\n[SN],[cN]\n\n[S1],[c1]\n\n4\nS,c,N=4\n\nNode\n\n+\n\nV3\n\ncN\n\nVN\n\n3\nS,c,N=3\n\n[S],[c]\npN\n\n2\n\n2\n\n3\n\n1\n\n...\n[S2],[c2]\n\n(b)\nFig. 1. (a) An arbitrary N -port network. The total signal at each port pi\nconsists of an incident signal Vi+ , a reflected signal Vi− , and a noise signal\nci . The reflected signal Vi− is a weighted sum of the incident signal at port\ni and transmitted signals from the other ports of the network, the coefficients\nof the sum being the elements of the network scattering matrix S. The noise\nsignals are given by the noise wave vector c. (b) An arbitrarily connected\nnetwork of N-port devices.\n\nWe then successively form each connection in the network.\nFor each connection, find the rows and columns k and m of\nS and c in Equation 8 which correspond to the ports being\nconnected. Use the replacement formulae given by Equations 6\nand 7 to adjust the S matrix and c vector. Remove rows\nand columns k and m from S, and rows k and m from c.\nRepeat for each remaining connection until we are left with\nthe scattering matrix S and noise vector c which describe the\nfully connected network.\nIV. S OFTWARE I MPLEMENTATION\nWe have derived an algorithm in §III-A for finding the\nscattering matrix and noise wave vector which describe an\narbitrarily connected network. We need to be able to apply it\nto arbitrary receivers with parameterized scattering matrices\ndescribing the receiver components and obtain analytic expressions for the outputs and noise in terms of the component\nparameters.\nThe algorithm must be implemented in a programming\nlanguage with the ability to manipulate symbolic algebraic\n\nexpressions. This programming language must also support\npointers (or equivalent data structure) to allow the creation\nof a navigateable network. We implemented the algorithm in\nMATLAB1 , which has a powerful and well developed symbolic algebra toolbox. While it does not have a native pointer\ndata type (as of version R2008b), a third party open-source\npointer library2 adds this capability. The software package we\ndeveloped to perform this modeling is called SNS3 .\nA. Representing a Network\nA network is represented by nodes and N -port objects, as\nshown in Figure 2. They are both pointer objects. Each N -port\nobject contains an array of references to the nodes connected\nto each of its N ports, a scattering matrix S, a noise wave\nvector c, and a variable N , the number of ports of the object.\nEach node object contains two pointers; these refer to the\nN -port objects the node connects to in the \"forward\" and\n\"backward\" directions, and which port number the connection\nis made to (Nf p and Nbp respectively). Note that the forward\nand backward directions are completely arbitrary; they are\nmerely a helpful concept when trying to visualize the operation\nof the algorithms which act on the network.\nThe network is constructed by creating all the node and\nN -port objects using functions called makeNode() and\nmakeNport(), assigning scattering matrices and noise wave\nvectors to the N -port objects, and connecting each node to\nits forward and backward N -port objects. A connectNode\nfunction hides the complexity of assigning references to the\nappropriate array locations and assigning the appropriate port\nnumbers to variables.\nNodes are classified into four types: input, output, central,\nand terminated. We want to calculate the performance of a\nnetwork in terms of the response seen at the outputs due to\nsignals presented at the inputs. The central and terminated\nnodes are removed by the network-solving program.\nOnce all the objects have been created, assigned matrices\nand vectors, and connected, it suffices to describe the network\nby the four arrays of nodes. Due to the fully connected nature\nof the network representation it is possible to start at any node\nand navigate to any other node by following the appropriate\nlinks between objects.\n1 http://www.mathworks.com/\n2 http://code.google.com/p/pointer/\n3 Download\n\nat http://www.astro.caltech.edu/∼ogk/SNS/\n\n\f4\n\nB. Solving a Network\nThe network-solving program accepts four arrays of nodes:\nthe inputs, outputs, central nodes, and terminated nodes. It\nreturns the scattering matrix and noise wave vector for the\nconnected network, where the central and terminated nodes\nhave been removed through application of the algorithm\ndescribed in §III-A.\nThe first step the software performs is to remove the\nterminated nodes, if there are any. The software assumes\nthat the terminations are perfectly matched and at a common\nphysical temperature. It modifies the object scattering matrices\nto remove the terminated nodes, and adds the noise terms\nproduced by the terminated nodes to the noise wave vectors.\nThe network sans terminated nodes is then passed to a\nrecursive network shrinking program. This program begins\nwith the first central node and applies the algorithm given by\nEquations 6 and 7 to a sub-network consisting of the two N port objects connected to that particular node. A new N -port\nobject is created and assigned the resulting scattering matrix\nand noise wave vector. All the nodes which were connected to\nthe now-defunct N -port objects are reconnected to this new N port object at the appropriate ports. A new network is formed\nby excluding the central node just considered and the program\nis recursively called on this new network. This continues until\nthere are no more central nodes, at which point the scattering\nmatrix and noise wave vector of the single remaining N -port\nobject are returned.\nApplying the algorithm in this fashion, rather than to the\nentire network at once, means that the size of the matrix S\nin Equation 8 is kept small, speeding up computation. This is\nnot an optimum solution to network shrinking, but we have\nfound it to be significantly faster than applying the algorithm\nto the full unconnected network for networks of more than a\nfew N -port objects.\nThe description given above glosses over the significant\ncomplexity in keeping track of which nodes should be connected where, and certain configurations of nodes and N -port\nobjects which would cause the default implementation of the\nalgorithm to fail. The majority of the code is dedicated to\nperforming these functions; only a small fraction of the code\nactually carries out the calculations described by the algorithm.\nC. Example Code Listing\nTo illustrate the operation of the program consider the\nnetwork shown in Figure 3. It is represented in software by\nconnected lists of nodes and N -port objects, as shown in the\nfollowing code listing:\n% Matrices S1, S2, S3, S4, S5 and vectors c1, c2, c3, c4, c5 assumed to\n% have been previously defined using symbolic algebra library.\n% Make the N-port objects\nP1 = makeNport(); P2 = makeNport(); P3 = makeNport();\nP4 = makeNport(); P5 = makeNport();\n% Assign scattering matrices and noise vectors\nP1.S = S1; P2.S = S2; P3.S = S3; P4.S = S4; P5.S = S5;\nP1.c = c1; P2.c = c2; P3.c = c3; P4.c = c4; P5.c = c5;\n% Make the nodes which connect the N-port objects\nIn1 = makeNode(); In2 = makeNode(); On1 = makeNode();\nOn2 = makeNode(); Tn1 = makeNode(); Cn1 = makeNode();\nCn2 = makeNode(); Cn3 = makeNode();\nCn4 = makeNode(); Cn5 = makeNode();\n% Connect nodes to N-ports\nconnectNode(In1,[],1,P1,1); connectNode(In2,[],1,P1,4);\nconnectNode(Cn1,P1,2,P3,1); connectNode(Cn2,P1,3,P4,1);\nconnectNode(Cn3,P3,2,P2,1); connectNode(Cn4,P4,2,P2,4);\nconnectNode(Cn5,P3,3,P5,1); connectNode(Tn1,P2,3,[],1);\nconnectNode(On1,P5,2,[],1); connectNode(On2,P2,2,[],1);\n% Build arrays of nodes\ninputs = {In1 In2}; outputs = {On1 On2};\n\n[S 5]\n[c 5]\n\nOn 1\n\n2\n\n1\n\nIn 1\n\n1\n\n2\n\n4\n\nCn1\n\n3\n\n1\n\n[S1]\n[c1]\n\nIn 2\n\nCn5\nCn3\n[S ]\n\n3\n\nCn2\n3\n\n1\n\n[c 3] 2\n\n1 [S 4] 2\n[c 4]\n\n2\n\n[S2]\n[c2]\n\nCn4\n4\n\nOn 2\nT n1\n\n3\n\nFig. 3. An arbitrary network of N -port devices to illustrate the software.\nNodes are indicated by open circles, N -port devices by rectangles. N -port\ndevice i is described by scattering matrix Si and noise wave vector ci . Input\nnodes to the network are Ini , central nodes Cni , terminated nodes Tni , and\noutput nodes Oni .\n\ncnodes = {Cn1 Cn2 Cn3 Cn4 Cn5}; tnodes = {Tn1};\n% Pass arrays of nodes to network calculator\n[S, c] = getScatteringRecursive(inputs,outputs,cnodes,tnodes);\n\nThe getScatteringRecursive program performs the\nactions described in §IV-B, and returns the scattering matrix S\nand noise wave vector c for the resulting 4-port object. Nodes\nIn1 , In2 , On1 , and On2 are connected sequentially to ports 1\nto 4 of this object.\nV. P OLARIMETRY\nThe example presented in the coming section, §VI, compares two receiver architectures commonly used to measure\nlinear polarization at radio to sub-mm wavelengths. This section provides necessary background information by sketching\na brief summary of polarization. It shows how a receiver may\nbe described by a Mueller matrix, and shows how to derive a\nreceiver Mueller matrix from the scattering matrix produced\nby the software described in §IV.\nA. Brief Summary of Polarization\nAn electromagnetic signal is said to be polarized if there is\nsome lasting amplitude or phase relation between its orthogonal modes. The coherency vector [9] captures this relation:\n\n\nEx (t)Ex∗ (t)\nEx (t)Ey∗ (t)\n\ne =h\nEy (t)Ex∗ (t)i\nEy (t)Ey∗ (t)\n=hE ⊗ E∗ i\nHere E is the complex vector of the orthogonal modes Ex (t)\nand Ey (t) of the signal, h. . .i indicates time averaging, and ⊗\nindicates the outer product.\nIf the signal E is acted on by an object described by a Jones\nmatrix J, i.e. Eout = JE, then the new coherency vector is\ngiven by\neout =(J ⊗ J∗ )e\n\n(9)\n\nThe polarization state of a signal is usually described by\nthe Stokes parameters, I, Q, U , and V . I describes the total\nintensity of the signal, Q and U describe the linear polarization\n\n\f5\n\nstate, and V describes the circular polarization state. The\nStokes vector eS is obtained from the coherency vector e by\n \nI\n\n\nQ\n\neS = \n(10)\nU  = Te\nV\n\n\n1 0 0 1\n1 0 0 −1\n\nwhere T = \n(11)\n0 1 1 0 \n0 −i i 0\nWe see that T is a coordinate transformation of the coherency\nvector to the abstract Stokes frame.\nThe Stokes parameters are a convenient and powerful way\nof the describing the state of polarization of an electromagnetic\nsignal. From Equation 10 we have:\nI =h|Ex (t)|2 i + h|Ey (t)|2 i\nQ =h|Ex (t)|2 i − h|Ey (t)|2 i\nU =2h<{Ex (t)Ey∗ (t)}i\n=hEx (t)Ey∗ (t)i + hEx∗ (t)Ey (t)i\nV =2h={Ex (t)Ey∗ (t)}i\n= − i[hEx (t)Ey∗ (t)i − hEx∗ (t)Ey (t)i]\n\n(12)\n\na) Mueller Calculus: Suppose that a signal defined by\nthe complex electric field vector E and coherency vector e is\nmodified by an object described by the Jones matrix J. From\nEquations 9 and 10 we see that the output signal Eout = JE\nwill be described by the Stokes vector\neSout =T(J ⊗ J∗ )T−1 eS\n=MeS\nThe matrix M = T(J ⊗ J∗ )T−1 is called the Mueller matrix.\nIt represents the action of the object characterized by Jones\nmatrix J in the Stokes vector space.\nMueller calculus is a matrix method for manipulating Stokes\nvectors. We denote the Mueller matrix elements as\n\n\nMII MIQ MIU MIV\nMQI MQQ MQU MQV \n\nM =\n MU I MU Q M U U MU V \nMV I MV Q MV U MV V\nMueller matrices are a convenient means of describing the\naction of an astronomical polarimeter. Of particular interest are\nthe MQI and MU I parameters, which describe the leakage of\nthe total intensity I into the measured linear polarization vector\ncomponents. Much of the radio and mm/sub-mm spectrum is\nonly slightly linearly polarized, hence non-zero values of MQI\nand MU I can imply serious contamination of the measured\nlinear polarization vector by the total intensity signal.\n\nEx\nEy\n\n3\n1\n\n[S]\n\nm\n\nD\n\n2\nN\n\nFig. 4. A arbitrary receiver, where orthogonal linear polarizations Ex (t) and\nEy (t) are presented at inputs 1 and 2 respectively. D is the output at port\nm. The receiver is described by scattering matrix S.\n\na Mueller matrix which describes the action of the receiver on\nthe Stokes vector of the incident electromagnetic signal.\nConsider the arbitrary receiver shown in Figure 4. Orthogonal linear polarizations Ex (t) and Ey (t), representing either\nsignals in transmission lines, orthogonal modes in waveguide,\nor orthogonal modes in free-space, are connected to ports\n1 and 2 of the receiver respectively. Receiver output D\nis connected to port m. The receiver is described by the\nscattering matrix S.\nThe output Em (t) seen at port m is given by (assuming that\nthe connections to ports 3 to N are reflectionless):\nEm (t) =Sm1 Ex (t) + Sm2 Ey (t)\nThe power contained in the signal Em (t) is then measured.\nAt radio wavelengths this is often achieved through the use of\na square-law detector diode. At mm and sub-mm wavelengths\na bolometer might be used. The measured power PD is given\nby:\nPD =αhEm (t)Em (t)∗ i\nh\n=α h|Ex (t)|2 i|Sm1 |2 + h|Ey (t)|2 i|Sm2 |2\n∗\n+ hEx (t)Ey∗ (t)iSm1 Sm2\n∗\n+ hEx∗ (t)Ey (t)iSm1\nSm2\n\ni\n\n(13)\n\nwhere h. . .i indicates time averaging, α is a proportionality\nconstant dependent on the power detection method, and we\nassume that the instrument scattering matrix parameters are\nconstant during the average time period. Now let\nPD =MDI I + MDQ Q + MDU U + MDV V\n=MDI h|Ex (t)|2 + |Ey (t)|2 i\n+ MDQ h|Ex (t)|2 − |Ey (t)|2 i\n+ MDU hEx (t)Ey∗ (t) + Ex∗ (t)Ey (t)i\n− iMDV hEx (t)Ey∗ (t) − Ex∗ (t)Ey (t)i\n\n(14)\n\nB. Deriving Receiver Mueller Matrix\nSay we have calculated the scattering matrix which describes the behavior of a receiver. For polarimeters, a natural\nway of expressing the receiver's performance is with a Mueller\nmatrix. We need to translate the receiver scattering matrix into\n\nwhere we have used the definition of the Stokes parameters\ngiven in Equation 12.\nBy comparing Equations 13 and 14 we can obtain the\ncontribution of each Stokes parameter to the power measured\n\n\f6\n\nat output D:\nα\nMDI = {|Sm1 |2 + |Sm2 |2 }\n2\nα\nMDQ = {|Sm1 |2 − |Sm2 |2 }\n2\nα\n∗\n∗\nMDU = {Sm1 Sm2\n+ Sm1\nSm2 }\n2\niα\n∗\n∗\nMDV = {Sm1 Sm2\n− Sm1\nSm2 }\n(15)\n2\nWe can derive the receiver Mueller matrix by applying this\ntechnique to all the outputs of the receiver.\n\n4\n\nEy\n\n1\n\n4\n\n2\n\n3\n\nCircularizer\n3\n\n[Scirc]\n\nER\n\n[SGR]\n\nEx\nFaraday 1\nRotator\n\n[Sfr]\n\n2\n\nEL\n4\n\n1\n\n3\n\n2\n\n1\n2\n\nLNAs\n\nOMT\n\n[SOMT]\n\n1\n2\n\n[SGL]\n\n1\n\nPhase\nswitch\n\nΘps [SPS]\n\n4\n\n1\n\n3\n\n2\n\nα1\n\nα2\n\nD1\n\nD2\n\n2\n4\n\n1\n\n3\n\n2\n\nD2\n\n[S180]=\n\n1\n2\n\n0\n1\n1\n0\n\n1\n0\n0\n-1\n\n1\n2\n\n0\n1\ni\n0\n\n1\n0\n0\ni\n\n1 0\n0 -1\n0 1\n1 0\n\nD1\n4\n\n1\n\n3\n\n2\n\n90°\n\nA. Differencing Polarimeters\nAn example of a differencing polarimeter architecture is\nshown in Figure 5 (right). The powers in orthogonal linear\nmodes D1 and D2 are detected and differenced to obtain one\nof the linear polarization parameters. Differencing polarimeters have a much simpler architecture than pseudo-correlation\n\nEx\n\n180°\n\nVI. P OLARIMETER A RCHITECTURE C OMPARISON\nTwo basic types of architectures are used to measure the polarization of an electromagnetic signal: differencing polarimeters, an architecture commonly used in polarization sensitive\nbolometer-based polarimeters [10]; and pseudo-correlation (or\ncorrelation) polarimeters, an architecture commonly used in\ncoherent, LNA or mixer based, polarimeters such as QUIET\n[11].\nDifferencing polarimeters measure the difference in power\nbetween orthogonal linear modes of the electromagnetic signal; see the definition of Q in Equation 12 for inspiration. Correlation, or pseudo-correlation, architectures measure\nthe polarization state by measuring the correlation between\northogonal modes. Correlation polarimeters are required to\npreserve the phase of the incident signal. They are hence only\nfeasible if coherent (i.e. phase-preserving) amplifiers or mixers\nare available.\nThe choice of which architecture to use for a particular\nexperiment is often dominated by sensitivity considerations. At\nlow frequencies (<∼ 60 GHz) the availability of low-noise coherent amplifiers has favored correlation architectures [12]. At\nhigher frequencies, the fundamental quantum limits that amplifier noise is subject to has favored direct detection technologies\nsuch as bolometers, and hence differencing polarimeter architectures, for continuum polarimetry experiments. However,\ncontinuing improvement in coherent amplifier technology at\nhigh frequencies has pushed their performance closer to the\nquantum limit, e.g. [13]. As coherent amplifier technology\nimproves, sensitivity may no longer be the deciding factor\nbetween technologies, and hence architectures.\nDifferencing and correlation architectures measure the polarization information of the incident signal in very different\nways, and hence suffer from different sources of systematic\nerror. A careful analysis of the fundamental strengths and\nweaknesses of each architecture is needed. SNS is well suited\nto perform this analysis. In this section we use SNS to\nderive receiver Mueller matrices for examples of these two\npolarimeter architectures. This analysis highlights the different\nsources of systematic error in these architectures.\n\nEy\n\nD4\n\n[S90]=\n\ni\n0\n0\n1\n\n0\ni\n1\n0\n\nD3\n\nFig. 5. Examples of two commonly used polarimeter architectures. (left) A\npseudo-correlation polarimeter. (right) A differencing polarimeter. Orthogonal\nwaveguide modes Ex and Ey are circularized or rotated, and extracted from\nwaveguide by an orthomode transducer (OMT). In the pseudo-correlation\narchitecture the signals are further processed. The powers in signals D1 to\nD4 are detected and processed to obtain the Stokes parameters, as explained\nin the text.\n\npolarimeters. However, they measure only a single linear\nStokes parameter; a duplicate receiver oriented at 45◦ to the\nfirst is needed to measure the second linear Stokes parameter.\nB. Pseudo-correlation Polarimeters\nAn example of a pseudo-correlation polarimeter architecture\nis shown in Figure 5 (left). The Stokes parameters of linear\npolarization in a circular basis are given by:\n1\nEl (t) = √ [Ex (t) − iEy (t)]\n2\n1\nEr (t) = √ [Ex (t) + iEy (t)]\n2\nQ =2h<{El (t)Er∗ (t)}i\nU = − 2h={El (t)Er∗ (t)}i\n\n(16)\n\nPseudo-correlation polarimeters measure the linear Stokes\nvector by correlating circular polarization signals El and Er\nwith (D3 and D4 ) and without (D1 and D2 ) a 90◦ phase shift.\n\n\f7\n\nThe powers in signals D1 to D4 are detected and combined\nto obtain the linear Stokes parameters.\nWhile the architecture of a pseudo-correlation polarimeter is\nmore complex than that of a differencing polarimeter, it does\nprovide some significant advantages. For instance, both linear\npolarization parameters can be measured with a single optical\nassembly, providing twice the information for the same focal\nplane area occupied.\nC. Parameterized Scattering Matrices\nSome of the components in the receivers shown in Figure 5\nhave parameterized scattering matrices. While it is possible to\ndescribe every component in a receiver with a suitable parameterized scattering matrix, the resulting analytic expressions for\nthe outputs soon become too complicated to be useful when\nwritten down.\nIn this analysis the components are assumed to be perfectly\nmatched, i.e. the diagonal elements of the parameterized\nscattering matrices are zero.\n1) Circularizer: The circular phase shifter translates orthogonal linear polarizations into orthogonal circular polarizations. It introduces a 90◦ phase shift into one orthogonal\nlinear mode, and is oriented at 45◦ to the OMT linear axis.\nA possible parameterization of the circularizer's scattering\nmatrix as shown in Figure 5 is:\n\n\n0\n1\n1\n0\nπ\nLc 1\n0\n0\n−ei( 2 +θc ) \n\nπ\nScirc = √ \ni(\n0\n0\ne 2 +θc ) \n2 1\nπ\nπ\n0 −ei( 2 +θc ) ei( 2 +θc )\n0\nHere L2c is the insertion loss of the circularizer, and θc is the\nerror in the 90◦ phase shift. The circularizer is assumed to be\notherwise perfect.\n2) Faraday Rotator: The Faraday rotator shown in the\ndifferencing polarimeter in Figure 5 is a component sometimes\nused in PSBs [14]. It modulates the measured polarization\nsignal by introducing a variable rotation to the plane of linear\npolarization of the incident signal. A similar effect can be\nachieved with a rotating birefringent half-waveplate, or a wire\ngrid.\nThe scattering matrix for the rotator considered here is:\n\n\n0\ncos(θps ) sin(θps )\n0\ncos(θps )\n0\n0\n− sin(θps )\n\nSf r = \n sin(θps )\n0\n0\ncos(θps ) \n0\n− sin(θps ) cos(θps )\n0\nHere 2θps is the time-dependent linear plane rotation introduced by the Faraday rotator.\n3) OMT: The OMT extracts orthogonal linear modes from\nthe waveguide. The scattering matrix parameterization considered here is:\n\n\n0\nDx dyx\n0\n Dx\n0\n0 dxy \n\nSOM T = \ndyx\n0\n0\nDy \n0 dxy Dy\n0\nHere Dx and Dy measure the insertion loss for each orthogonal mode, while dxy and dyx measure the leakage of one mode\n\ninto the other. From conservation of energy considerations in\na passive component we have the constraints |Dx | = |Dy | =\n|D|, |dxy | = |dyx | = |d|, and |D|2 + |d|2 = L2omt , where\nL2omt is the insertion loss of the OMT. The parameters may\nhave arbitrary phase.\n4) LNAs and Phase Switch: The scattering matrices for the\nLNAs in the pseudo-correlation polarimeter are given by:\n\u0014\n\u0015\n0\n0\nSL,R =\nGL,R 0\nHere GL and GR are the complex voltage gains of the left\nand right circular polarization amplifiers respectively.\nThe phase switch in the pseudo-correlation polarimeter\nmodulates the phase of one of the signal arms relative to the\nother. Its scattering matrix is given by:\n\u0014\n\u0015\n0\neiθps\nSps = iθps\ne\n0\nHere θps is the time-dependent phase shift introduced by the\nphase switch, usually shifting between 0◦ and 180◦ .\nD. Polarimeter Mueller Matrix Elements\nWe now build a connected model of each polarimeter in\nSNS using the matrix parameterizations given in §VI-C. We\nuse Equation 15 to obtain expressions for the powers measured\nat each receiver output in terms of the incident signal Stokes\nparameters.\nFor the ideal pseudo-correlation polarimeter, i.e. where all\nthe components are perfect, the outputs are:\n1\nPD1 = I\n2\n1\nPD 2 = I\n2\n1\nPD 3 = I\n2\n1\nPD 4 = I\n2\n\n1\n− U\n2\n1\n+ U\n2\n1\n− Q\n2\n1\n+ Q\n2\n\n(17)\n\nHere we have assumed that θps = 0 and α = 1. To measure\nthe Stokes parameters we take Qm = PD4 − PD3 , Um =\nPD2 − PD1 , and Im = 12 (PD1 + PD2 + PD3 + PD4 ).\nFor the ideal differencing polarimeter the outputs are:\n1\n1\nPD1 = I + cos(2θps )Q −\n2\n2\n1\n1\nPD2 = I − cos(2θps )Q +\n2\n2\n\n1\nsin(2θps )U\n2\n1\nsin(2θps )U\n2\n\n(18)\n\nWhich linear Stokes parameter we measure depends on the\nplane rotation introduced by the Faraday rotator, and is given\nby Lm = PD1 − PD2 = cos(2θps )Q − sin(2θps )U . The\nmeasured total intensity is Im = PD1 + PD2 .\nThe Mueller matrix parameters of particular interest in CMB\npolarization studies are: MII , MQQ , and MU U , the diagonal\nelements of the Mueller matrix; MQI and MU I , the leakage\nof the total intensity signal into the (generally) small linear\npolarization signal; and MQU and MU Q , which measure the\nrotation of the linear polarization vector by the receiver.\n\n\f8\n\n0.5\n\nThese Mueller matrix parameters for the pseudo-correlation\npolarimeter are:\n\nMQQ\nMU U\n\nMQI\nMU I\nMQU\n\nMU Q\nwhere θ1\nθ2\nθ3\nθ4\n\n=θDy − θdxy − (θGL − θGR + θps )\n=θDx − θdyx + (θGL − θGR + θps )\n=θDx − θDy + (θGL − θGR + θps )\n=θdxy − θdyx + (θGL − θGR + θps )\n\nHere X = |X|eiθX . We have implicitly assumed that the\nresponses of all the power detectors are equal and stable.\nTo keep the comparison between the architectures reasonable, we need to include varying power detection sensitivity in\nthe differencing polarimeter. Let the power detection proportionality constants (see Equation 13) be α1 and α2 for outputs\n1 and 2 respectively. We also need to decide on the rotation\nangle of the Faraday rotator to specify which linear Stokes\nparameter we actually measure. Let θps = ±45◦ (i.e. Stokes\nU). We then obtain the Mueller matrix parameters:\ni\nL2omt h\nα1 + α2\n2\nih\ni\nsin(2θps ) h\n=\nα1 + α2 |D|2 − |d|2 − cos(2θps )|Dd|\ni\nh 2\nα1 cos(θDx − θdxy ) − α2 cos(θDy − θdyx )\ni\nL2 h\n= omt α1 − α2\n2\nih\ni\ncos(2θps ) h\nα2 − α1 |D|2 − |d|2 − sin(2θps )|Dd|\n=\nh 2\ni\nα1 cos(θDx − θdxy ) − α2 cos(θDy − θdyx )\n(20)\n\nMII =\nMU U\n\nMU I\nMU Q\n\n1) Discussion: One of the greatest sources of systematic\nerror in polarimeters is leakage of the total intensitypsignal into\nthe measured linear polarization amplitude, P = Q2 + U 2 .\nThe fractional contribution to P from total intensity leakage,\n∆PI = MP I /MII , is given by:\nq\n∆PI =\n\n2 + M2\nMQI\nUI\n\nMII\n\nAssume that we have two differencing polarimeters oriented\nsuch that they measure Q and U respectively, identical except for their values of α. The \"Q\" polarimeter has values\nα1 , α2 , while the \"U \" polarimeter has α3 , α4 . For the pseudo-\n\nCorrelation polarimeter: |d|2 = −30dB\nCorrelation polarimeter: |d|2 = −40dB\n\n0.4\n\nCorrelation polarimeter: |d|2 = −50dB\n\n0.35\n0.3\n|Δ PI |\n\nMII\n\ni\nL2 L2 h\n= c omt |GL |2 + |GR |2\n2\nh\ni\n=L2c |GL GR | |D|2 cos(θ3 ) + |d|2 cos(θ4 )\nh\n=L2c |GL GR | cos(θc ){|D|2 cos(θ3 ) − |d|2 cos(θ4 )}\ni\n− sin(θc )|Dd|{sin(θ1 ) + sin(θ2 )}\nh\ni\n=L2c |GL GR ||Dd| cos(θ2 ) + cos(θ1 )\nh\ni\n=L2c |GL GR ||Dd| sin(θ1 ) − sin(θ2 )\nh\n=L2c |GL GR | cos(θc ){|D|2 sin(θ3 ) − |d|2 sin(θ4 )}\ni\n+ sin(θc )|Dd|{cos(θ2 ) − cos(θ1 )}\nh\ni\n= − L2c |GL GR | |D|2 sin(θ3 ) + |d|2 sin(θ4 )\n(19)\n\nDifferencing polarimeter\n0.45\n\n0.25\n0.2\n0.15\n0.1\n0.05\n0\n−0.5\n\n−0.4\n\n−0.3\n\n−0.2\n\n−0.1\n\n0\nΔ\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n0.5\n\nFig. 6. Comparison of the effect of imbalance on the fractional total intensity\nto polarization leakage for pseudo-correlation and differencing polarimeter\narchitectures. For the pseudo-correlation architecture, ∆ = ∆|G|2 . For the\ndifferencing architecture ∆ = ∆α. |d|2 is the OMT cross polarization.\n\ncorrelation and differencing polarimeters we then have:\n√\np\n2 2|GL GR |\nc\n∆PI =\n|d|\n(1 − |d|2 )(1 + cos(θ1 + θ2 ))\n|GL |2 + |GR |2\np\n(α1 − α2 )2 + (α3 − α4 )2\nd\n∆PI =2\nα1 + α2 + α3 + α4\nAs a simplification, assume that ∆α = (α1 − α2 )/α2 = (α3 −\n|2 −|GR |2\nα4 )/α4 , and let ∆|G|2 = |GL|G\n. Take the worst-case\n2\nR|\nphase scenario, where cos(θ1 + θ2 ) = 1. We now have:\np\np\n1 + ∆|G|2\n∆PIc =4|d| 1 − |d|2\n(21)\n2 + ∆|G|2\n√\n2∆α\n∆PId =\n(22)\n2 + ∆α\nEquations 21 and 22 are plotted in Figure 6. Several\nattributes are noteworthy: ∆PI is independent of the OMT\ncross polarization |d|2 for the differencing polarimeter, but\nis heavily dependent on the power sensitivity imbalance ∆α;\n∆PI is almost independent of gain imbalance ∆|G|2 for the\npseudo-correlation polarimeter, but is dependent on the OMT\ncross polarization.\nFigure 6 clearly illustrates the difference between the polarimeter architectures in terms of total intensity to polarization\nleakage. Correlation polarimeters are very insensitive to what\nis generally the most unstable parameter in a coherent receiver:\nfluctuating LNA gain. They are moderately sensitive to OMT\ncross polarization |d|2 . The comparatively high sensitivity of\ndifferencing polarimeters to power detection imbalance can be\nreduced if ∆α is stable and well-known; the data can then be\ncorrected and the leakage of I into P reduced.\nE. Pseudo-Correlation Polarimeter Noise Temperature\nA very powerful benefit of using scattering matrices to\nmodel receivers is the ability to perform noise analysis. We\nspecify parameterized noise wave vectors for the pre-LNA\ncomponents and ignore any noise produced by the components\n\n\f9\n\n\"down stream\" of the LNAs, as their contribution will be\nnegligible if the LNA gain is high.\nIf the noise wave vector of the pseudo-correlation polarimeter is given by c, then the noise power measured at the output\nDi in a 1 Hz bandwidth is given by Pi = αhcj c∗j i, where cj\nis the noise wave vector element corresponding to output Di .\nSuppose that component k of M total components has N\nports, and is specified by the scattering matrix Sk and the\nnoise wave vector ck . cj is given by:\n\ncj =\n\nM\nX\n\nckj , where ckj =\n\nN\nX\n\nbki cki\n\ni=1\n\nk=1\n\nNoise waves from different devices are not correlated:\n∗\nhcki (cm\nj ) i = 0 for k 6= m. So, Pi is given by:\n\nPi =α\n\nM\nX\n\nPik\n\nD4 :\n\nk=1\n\nwhere Pik =\n\nXX\u0010\n\nCk * bk ⊗ (bk )\n\n\u0001\u0011\n†\n\nThe noise correlation matrices for the passive pre-LNA\ncomponents are obtained using Equation 2. To get the noise\ncorrelation matrices for the LNAs we make two simplifications\nto the HEMT noise correlation matrix model in [5]: first,\nthe off-diagonal terms of an LNA noise correlation matrix\n(hc1 c∗2 i and hc∗1 c2 i) are much smaller than the diagonal terms\nso we take them to be zero. Second: h|c2 |2 i ' |S21 |2 h|c1 |2 i '\nk|S21 |2 TN , where TN is the amplifier noise temperature and k\nis Boltzmann's constant.\nReceiver noise temperature is referenced to the input. We\nconsider the receiver temperature Ti at output Di to be\nthe temperature of a thermal source seen equally at each\ninput which produces the same total output noise power in\na noiseless receiver:\nNin\n\u0010X\n\n\u0011\n|Sij |2 Ti\n\nj=1\n\nPM\n\nPik\n∴ Ti = PNk=1\nin\n2\nj=1 |Sij |\n\ni T h G i\nTp h G\nN\n−\n1\n+ 2\nL2c E − F\nLc E − F\ni T h G i\nTp h G\nN\n−1 + 2\nT2 =Tc + 2\nLc E + F\nLc E + F\ni T h G i\nTp h G\nN\nT3 =Tc + 2\n−1 + 2\nLc E − H\nLc E − H\ni T h G i\nTp h G\nN\n−1 + 2\nT4 =Tc + 2\nLc E + H\nLc E + H\ni\nh 1\nwhere Tc =Tp 2 − 1\nLc\nG =|GL |2 + |G2R |\n\u0001\nE = |GL |2 + |G2R | L2omt\nh\ni\nF =2|GL GR ||Dd| cos(θ1 ) + cos(θ2 )\nh\ni\nH =2|GL GR ||Dd| sin(θ1 ) − sin(θ2 )\nT1 =Tc +\n\nHere Ck is the noise correlation matrix for component k, *\n⊗P\nis\nis the matrix dot product, bk is the vector [bk1 . . . bkN ]T ,P\nthe outer product, and † is the hermitian conjugate. The\nindicates a sum over all the matrix elements.\n\nPi =α\n\nFig. 7. Plots of T1 /TN against various parameters. We see that the receiver\nis most sensitive to the cross polarization, |d|2 , and is negligibly sensitive to\nthe other parameters. We assume TN = TP = 15 K. See text for details.\n\n(23)\n\nHere Nin is the number of inputs to the receiver, and S is the\nreceiver scattering matrix.\nApplying this technique to the pseudo-correlation polarimeter we derive the receiver temperatures for the outputs D1 to\n\n(24)\n\nHere we have assumed that the amplifiers have noise temperature TN , and that the circularizer and OMT are at a physical\ntemperature of Tp . θ1 and θ2 are given in Equation 19.\n1) Discussion: Which parameters in the multiparameter\nexpression for T1 in Equation 24 have the greatest impact on\nthe receiver temperature? The most obvious are L2c and L2omt ,\nthe insertion losses of the circularizer and OMT respectively.\nSetting those aside, how do the other parameters affect the\nreceiver temperature?\nThe minimum value that T1 can have is TN . Our sensitivity\nimpact metric is then T1 /TN ≥ 1. We fix L2c = p\n−0.1 dB and\nL2omt = −0.2 dB, and set |GR | = 1, |GL | = 1 + ∆|G|2 ,\nθGL = 0, and θDx = 0 (only relative phases matter here). This\nleaves us with six parameters: |d|2 , ∆|G|2 , θGR , θDy , θdxy ,\nand θdyx .\nWe generate random sets of physically realistic values for\nthese parameters, and evaluate the metric T1 /TN for each set.\nWe plot T1 /TN against each parameter under consideration\n\n\f10\n\nin Figure 7. It is immediately clear that the most important\nparameter in this set is |d|2 . Discarding the least important\nparameters we now have:\nT1 w\n\nTp + TN\n1\np\n− Tp\nL2c L2omt − 2|d| L2omt − |d|2\n\nTp (1 − L2c L2omt ) + TN\nw\nsince |d|2 \u001c L2omt\nL2c L2omt\n\nacknowledges the support of a Dorothy Hodgkin Award in\nfunding his studies while a student at Oxford, and the support\nof a W.M. Keck Institute for Space Studies Postdoctoral\nFellowship at Caltech.\nR EFERENCES\n\n(25)\n\nThis simplified expression for T1 is exactly what we would\nderive using a conventional noise temperature analysis, indicating that the software has calculated the noise temperature\ncorrectly.\nVII. C ONCLUSIONS\nWe have presented SNS, a MATLAB-based software library\nwritten to aid in the design and analysis of receiver architectures. It uses electrical scattering matrices and noise wave\nvectors to describe receiver architectures of arbitrary topology\nand complexity.\nWe use SNS to compare two polarimeter architectures commonly used to perform measurements of the polarized CMB:\ndifferencing polarimeters, an architecture commonly used in\nPSB-based polarimeters; and pseudo-correlation polarimeters,\nan architecture commonly used in coherent polarimeters. This\nanalysis highlights the differing sources of systematic error in\nthese architectures: I to P leakage in pseudo-correlation polarimeters is almost immune to gain imbalance, but sensitive to\nOMT cross polarization; while I to P leakage in differencing\npolarimeters is immune to OMT cross polarization, but very\nsensitive to power detection imbalance.\nWe show how SNS can be used to calculate analytical\nexpressions for the receiver noise temperature of arbitrary\nreceivers. Analytic expressions for the receiver temperature of\na pseudo-correlation polarimeter are derived, and are found to\nbe consistent with those obtained from conventional receiver\ntemperature calculations.\nACKNOWLEDGMENTS\nThanks go to Dr Paul Grimes for helpful discussions and\npointers to papers, to Prof. Mike Jones for helpful suggestions, support and motivation, and to Nikolai Yu. Zolotykh\nfor developing the pointer library for MATLAB. OGK\n\n[1] M. Zaldarriaga and U. Seljak, \"All-sky analysis of polarization in the\nmicrowave background\", Physical Review D (Particles, vol. 55, p. 1830,\nJan 1997.\n[2] L. Page, G. Hinshaw, E. Komatsu, M. R. Nolta, D. N. Spergel, C. L.\nBennett, C. Barnes, R. Bean, O. Doré, J. Dunkley, M. Halpern, R. S.\nHill, N. Jarosik, A. Kogut, M. Limon, S. S. Meyer, N. Odegard, H. V.\nPeiris, G. S. Tucker, L. Verde, J. L. Weiland, E. Wollack, and E. L.\nWright, \"Three-year Wilkinson Microwave Anisotropy Probe (WMAP)\nobservations: Polarization analysis\", The Astrophysical Journal Supplement Series, vol. 170, p. 335, May 2007.\n[3] W. Hu, M. M. Hedman, and M. Zaldarriaga, \"Benchmark parameters for\nCMB polarization experiments\", Physical Review D, vol. 67, p. 43004,\nFeb 2003.\n[4] D. O'Dea, A. Challinor, and B. R. Johnson, \"Systematic errors in cosmic\nmicrowave background polarization measurements\", Monthly Notices of\nthe Royal Astronomical Society, vol. 376, p. 1767, Apr 2007.\n[5] S. Wedge and D. Rutledge, \"Wave techniques for noise modeling and\nmeasurement\", Microwave Theory and Techniques, IEEE Transactions\non, vol. 40, no. 11, pp. 2004–2012, 1992.\n[6] --, \"Noise waves and passive linear multiports\", Microwave and\nGuided Wave Letters, IEEE Transactions On, vol. 1, no. 5, pp. 117–\n119, 1991.\n[7] G. Filipsson, \"A new general computer algorithm for S-matrix calculation of interconnected multiports\", 11th European Microwave Conference, pp. 700–704, 1981.\n[8] J. Ward, F. Rice, G. Chattopadhyay, and J. Zmuidzinas, \"Supermix: a\nflexible software library for high-frequency circuit simulation, including\nSIS mixers and superconducting elements\", Tenth International Symposium on Space Terahertz Technology: Symposium Proceedings, pp.\n268–281, 1999.\n[9] J. P. Hamaker, J. D. Bregman, and R. J. Sault, \"Understanding radio\npolarimetry. I. Mathematical foundations\", Astronomy and Astrophysics\nSupplement, vol. 117, p. 137, May 1996.\n[10] W. C. Jones, T. E. Montroy, B. P. Crill, C. R. Contaldi, T. S. Kisner,\nA. E. Lange, C. J. Mactavish, C. B. Netterfield, and J. E. Ruhl, \"Instrumental and analytic methods for bolometric polarimetry\", Astronomy\nand Astrophysics, vol. 470, p. 771, Aug 2007.\n[11] L. Newburgh and QUIET Collaboration, \"QUIET: The Q/U Imaging\nExperimenT\", American Astronomical Society, vol. 215, p. 549, Jan\n2010.\n[12] J. Zmuidzinas, \"Progress in coherent detection methods\", The Physics\nand Chemistry of the Interstellar Medium, p. 423, Aug 1999.\n[13] T. C. Gaier, \"Coherent radiometers for cosmic microwave background\npolarization detection\", Polarimetry in Astronomy. Edited by Silvano\nFineschi . Proceedings of the SPIE, vol. 4843, p. 296, Jan 2003.\n[14] B. G. Keating, \"Faraday rotation modulators for mm-wavelength polarimetry\", CMBPol White Papers, pp. 1–12, Jul 2008.\n\n\f"}