{"id": "http://arxiv.org/abs/0712.0101v1", "guidislink": true, "updated": "2007-12-01T18:57:50Z", "updated_parsed": [2007, 12, 1, 18, 57, 50, 5, 335, 0], "published": "2007-12-01T18:57:50Z", "published_parsed": [2007, 12, 1, 18, 57, 50, 5, 335, 0], "title": "Pancharatnam-Berry phase optical elements for wavefront shaping in the\n  visible domain: switchable helical modes generation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0712.4064%2C0712.1391%2C0712.1152%2C0712.0607%2C0712.1322%2C0712.3537%2C0712.3488%2C0712.1385%2C0712.1447%2C0712.4182%2C0712.3787%2C0712.3326%2C0712.0238%2C0712.0918%2C0712.3961%2C0712.0405%2C0712.1971%2C0712.3512%2C0712.3876%2C0712.1985%2C0712.0444%2C0712.1813%2C0712.2511%2C0712.4081%2C0712.2816%2C0712.2628%2C0712.2669%2C0712.0905%2C0712.0767%2C0712.0100%2C0712.2168%2C0712.3677%2C0712.1903%2C0712.3004%2C0712.3065%2C0712.2785%2C0712.4203%2C0712.0101%2C0712.4045%2C0712.3932%2C0712.1022%2C0712.2415%2C0712.2124%2C0712.3155%2C0712.2607%2C0712.0836%2C0712.0496%2C0712.0457%2C0712.1852%2C0712.3150%2C0712.2474%2C0712.4118%2C0712.2610%2C0712.2951%2C0712.0585%2C0712.3307%2C0712.4336%2C0712.3665%2C0712.1031%2C0712.0603%2C0712.0187%2C0712.1918%2C0712.1725%2C0712.2647%2C0712.0286%2C0712.3351%2C0712.0955%2C0712.3616%2C0712.3903%2C0712.4339%2C0712.0193%2C0712.3858%2C0712.2670%2C0712.2535%2C0712.0684%2C0712.2266%2C0712.0082%2C0712.2401%2C0712.0076%2C0712.2674%2C0712.2617%2C0712.1677%2C0712.4176%2C0712.1506%2C0712.3520%2C0712.4377%2C0712.2239%2C0712.3603%2C0712.3465%2C0712.0592%2C0712.2060%2C0712.0813%2C0712.3999%2C0712.3296%2C0712.0170%2C0712.1546%2C0712.2834%2C0712.1028%2C0712.0131%2C0712.1036%2C0712.4180&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Pancharatnam-Berry phase optical elements for wavefront shaping in the\n  visible domain: switchable helical modes generation"}, "summary": "We report the realization of a Pancharatnam-Berry phase optical element [Z.\nBomzon, G. Biener, V. Kleiner, and E. Hasman, Opt. Lett. \\textbf{27}, 1141\n(2002)] for wavefront shaping working in the visible spectral domain, based on\npatterned liquid crystal technology. This device generates helical modes of\nvisible light with the possibility of electro-optically switching between\nopposite helicities by controlling the handedness of the input circular\npolarization. By cascading this approach, fast switching among multiple\nwavefront helicities can be achieved, with potential applications to\nmulti-state optical information encoding. The approach demonstrated here can be\ngeneralized to other polarization-controlled devices for wavefront shaping,\nsuch as switchable lenses, beam-splitters, and holographic elements.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0712.4064%2C0712.1391%2C0712.1152%2C0712.0607%2C0712.1322%2C0712.3537%2C0712.3488%2C0712.1385%2C0712.1447%2C0712.4182%2C0712.3787%2C0712.3326%2C0712.0238%2C0712.0918%2C0712.3961%2C0712.0405%2C0712.1971%2C0712.3512%2C0712.3876%2C0712.1985%2C0712.0444%2C0712.1813%2C0712.2511%2C0712.4081%2C0712.2816%2C0712.2628%2C0712.2669%2C0712.0905%2C0712.0767%2C0712.0100%2C0712.2168%2C0712.3677%2C0712.1903%2C0712.3004%2C0712.3065%2C0712.2785%2C0712.4203%2C0712.0101%2C0712.4045%2C0712.3932%2C0712.1022%2C0712.2415%2C0712.2124%2C0712.3155%2C0712.2607%2C0712.0836%2C0712.0496%2C0712.0457%2C0712.1852%2C0712.3150%2C0712.2474%2C0712.4118%2C0712.2610%2C0712.2951%2C0712.0585%2C0712.3307%2C0712.4336%2C0712.3665%2C0712.1031%2C0712.0603%2C0712.0187%2C0712.1918%2C0712.1725%2C0712.2647%2C0712.0286%2C0712.3351%2C0712.0955%2C0712.3616%2C0712.3903%2C0712.4339%2C0712.0193%2C0712.3858%2C0712.2670%2C0712.2535%2C0712.0684%2C0712.2266%2C0712.0082%2C0712.2401%2C0712.0076%2C0712.2674%2C0712.2617%2C0712.1677%2C0712.4176%2C0712.1506%2C0712.3520%2C0712.4377%2C0712.2239%2C0712.3603%2C0712.3465%2C0712.0592%2C0712.2060%2C0712.0813%2C0712.3999%2C0712.3296%2C0712.0170%2C0712.1546%2C0712.2834%2C0712.1028%2C0712.0131%2C0712.1036%2C0712.4180&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report the realization of a Pancharatnam-Berry phase optical element [Z.\nBomzon, G. Biener, V. Kleiner, and E. Hasman, Opt. Lett. \\textbf{27}, 1141\n(2002)] for wavefront shaping working in the visible spectral domain, based on\npatterned liquid crystal technology. This device generates helical modes of\nvisible light with the possibility of electro-optically switching between\nopposite helicities by controlling the handedness of the input circular\npolarization. By cascading this approach, fast switching among multiple\nwavefront helicities can be achieved, with potential applications to\nmulti-state optical information encoding. The approach demonstrated here can be\ngeneralized to other polarization-controlled devices for wavefront shaping,\nsuch as switchable lenses, beam-splitters, and holographic elements."}, "authors": ["L. Marrucci", "C. Manzo", "D. Paparo"], "author_detail": {"name": "D. Paparo"}, "author": "D. Paparo", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.2207993", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0712.0101v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0712.0101v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0712.0101v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0712.0101v1", "arxiv_comment": null, "journal_reference": "Appl. Phys. Lett. 88, 221102 (2006)", "doi": "10.1063/1.2207993", "fulltext": "Pancharatnam-Berry phase optical elements for wavefront shaping\nin the visible domain: switchable helical modes generation\nL. Marrucci,∗ C. Manzo, and D. Paparo\nCNR-INFM Coherentia and Dipartimento di Scienze Fisiche,\n\narXiv:0712.0101v1 [physics.optics] 1 Dec 2007\n\nUniversità di Napoli \"Federico II\",\nCompl. di Monte S.Angelo, v. Cintia, 80126 Napoli, Italy\n(Dated: January 19, 2006)\n\nAbstract\nWe report the realization of a Pancharatnam-Berry phase optical element [Z. Bomzon, G. Biener,\nV. Kleiner, and E. Hasman, Opt. Lett. 27, 1141 (2002)] for wavefront shaping working in the\nvisible spectral domain, based on patterned liquid crystal technology. This device generates helical\nmodes of visible light with the possibility of electro-optically switching between opposite helicities\nby controlling the handedness of the input circular polarization. By cascading this approach, fast\nswitching among multiple wavefront helicities can be achieved, with potential applications to multistate optical information encoding. The approach demonstrated here can be generalized to other\npolarization-controlled devices for wavefront shaping, such as switchable lenses, beam-splitters,\nand holographic elements.\n\n1\n\n\fWhen the polarization of an electromagnetic wave undergoes a continuous sequence of\ntransformations following a closed path in the space of polarization states (e.g., the Poincaré\nsphere), the wave acquires a phase shift, known as Pancharatnam-Berry phase, that is determined only by the geometry of the polarization path.1,2 By the same principle, if a wave is\nsubjected to transversely inhomogeneous polarization transformations with a homogeneous\ninitial and final polarization state, the associated inhomogeneous geometrical phases will induce an overall wavefront reshaping. This approach to wavefront shaping is fundamentally\ndifferent from the usual optical-path-length approaches of standard lenses, curved mirrors,\nand gradient-index (GRIN) elements. It is also conceptually different from holographic\napproaches, although the two are related, as we will discuss further below. The realization of so-called Pancharatnam-Berry phase optical elements (PBOE) for wavefront shaping\nhas been proposed only recently,3,4 and it has been experimentally demonstrated only in\nthe mid-infrared domain, using subwavelengths inhomogeneous gratings to manipulate the\npolarization.4,5,6,7 An additional general feature of PBOE's is that they are polarizationcontrolled, i.e. different input polarizations will give rise to different wavefront shaping in\nthe same PBOE element. Since the polarization can be electro-optically switched at a high\nrate, PBOE's allow a very fast control of the generated wavefront. This polarization multiplexing is limited to a finite set of predefined wavefronts, so PBOE's cannot compete with\nspatial light modulators in terms of flexibility, but they will be much faster and cheaper.\nTo be more specific, let us consider a PBOE made as a single (uniaxial) birefringent plate\nhaving a homogeneous phase retardation of π (half-wave PBOE) for light propagation in the\nlongitudinal z direction but a transversely inhomogeneous optical axis n(x, y), lying in the\nxy plane. To analyze the effect of this element on the optical field, it is convenient to adopt\nthe Jones formalism. Let α(x, y) be the angle between n(x, y) and a fixed axis x. The Jones\nmatrix M to be applied on the field at each transverse position x, y is the following:\n\n\nM = R(−α)\n\n\n\n\n\n\n\n\n1 0 \n cos 2α sin 2α \nR(α) = \n,\n0 −1\nsin 2α − cos 2α\n\n(1)\n\nwhere R(α) is the two-dimensional rotation matrix by angle α. An input left-circular polarized plane wave, described by the Jones electric-field vector Ein = E0 × [1, i], will be\n\n2\n\n\ftransformed by this element into the following field (up to an overall phase):\n\n\nEout\n\n\n\n 1 \n= M * Ein = E0 ei2α(x,y) \n.\n−i\n\n(2)\n\nIt is seen that the output wave is uniformly right-circular polarized, but its wavefront has\nacquired a nonuniform phase retardation ∆Φ(x, y) = 2α(x, y). If the input light is rightcircular polarized, it is easy to verify that the wavefront is the conjugate one, i.e. ∆Φ(x, y) =\n−2α(x, y).\nTo appreciate the possible applications of these devices, consider, for example, a half-wave\nPBOE having a polarization-grating geometry as that shown in Fig. 1a. This device will\nfunction as a circular-polarizing beam-splitter or as polarization-controlled optical switch.6\nA PBOE lens can instead be obtained with an optical axis geometry given by α∝r2 , where\nr is the radial coordinate in the xy plane, as that shown in Fig. 1b. This element will be\nfocusing or defocusing, depending on the input circular polarization handedness.3,7\nLet us consider now a PBOE geometry given by α = qφ + α0 , where φ is the azimuthal\nangle in the xy plane, and q and α0 are two constants. We further assume that q is an\ninteger or a semi-integer, so that the optical axis does not have discontinuity lines in the\nplate, but only a defect in the center. We will call these devices \"q-plates\". Figures 1c and\n1d show examples of these devices for q = 1/2 and q = 1, respectively. These q-plates give\nrise to a wavefront modulation given by ∆Φ = ±2qφ, with a sign depending on the input\ncircular polarization handedness, i.e. they generate helical wavefronts of order ±2q.8,9 Thus\nfar, q-plates have been demonstrated only for the mid-infrared wavelength of 10.6 μm, based\non the subwavelength gratings technology.5,10\nWe manufactured q = 1 plates working at the visible wavelength λ = 633 nm based on\nthe patterned liquid crystal (LC) technology (see, e.g., Refs. 11,12 and references therein).\nNematic LC planar cells were prepared with a thickness (about 1 μm) and a material (E63\nfrom Merck, Darmstadt, Germany) chosen so as to obtain a birefringence retardation of approximately a half wave. Before cell assembly, one of the inner surfaces of the two containing\nglasses of the cell was pressed against a piece of fabric kept in continuous rotation. This\n\"circular rubbing\" procedure leads to a surface easy axis (i.e. the preferred orientation of LC\nmolecules) having the desired q = 1 circular-symmetric geometry, as that shown in Fig. 1d.\nThe other glass was left unrubbed, for degenerate planar alignment. To ensure good LC\nalignment, the cell was heated above the clearing point and then cooled slowly, keeping the\n3\n\n\frubbed surface slightly colder than the unrubbed one. In this way, nematic order nucleated\non the rubbed surface and then extended to the whole cell. Some cells were prepared with\na polyimide coating for planar alignment, others with bare glass, with comparable results\n(although they required different rubbing pressures and lengths). A photograph of a LC\nq-plate held between crossed polarizers is shown in Fig. 2a.\nTo test the optical effect of a q-plate, a circularly-polarized He-Ne laser beam having\na TEM00 transverse mode and a beam-waist radius of about 1 mm was sent through it,\ntaking care of aligning the beam axis on the q-plate center. The intensity profile of the\noutput beam, shown in Fig. 2b, has the \"doughnut\" shape expected for a helical mode.\nHowever, a complete test must be based on measuring the beam wavefront shape, rather\nthan its intensity profile. To this purpose, we inserted the q-plate in the signal arm of\na Mach-Zender interferometer based on the same He-Ne laser source. The input circularpolarization handedness was selected by properly rotating a quarter-wave plate. The beam\nemerging from the q-plate was sent through another quarter-wave plate and a linear polarizer\narranged for transmitting the polarization handedness opposite to the initial one, so as to\neliminate any residual unchanged circular polarization (this step would be unnecessary for\nan exact half-wave retardation of the q-plate). The final interference pattern generated\nafter superposition with the reference was formed directly on the sensing area of a CCD\ncamera. We used two reference wavefront geometries: (i) plane-tilted, for which an order-2\nhelical wavefront will give rise to a double disclination defect in a otherwise regular straightline fringe pattern; (ii) spherical, for which the helical wavefront will give rise to a double\nspiral fringe pattern. Figures 2c-f show the interference patterns we obtained for one of\nour cells in these two geometries, respectively for a left-circular (panels c and e) and rightcircular (panels d and f) input polarization. These results confirm that the wavefront of the\nlight emerging from our q-plate is indeed helical of order ±2, as expected, with the ± sign\ndetermined by the input polarization handedness.\nThis polarization-based control of the generated helical wavefront is a good example of\nthe possible advantages of the PBOE approach to wavefront shaping. Indeed, all other\nexisting approaches to helical mode generation (i.e. cylindrical lenses, spiral phase plates,\nand holographic methods) have an essentially fixed output. Of course, by introducing a\nsuitable spatial light modulator, dynamical control becomes possible, but only at relatively\nlow switching rates. In our approach, a simple electro-optical control of the input polariza4\n\n\ftion allows switching of the generated helical mode at very high rate. By cascading several\nq-plates in series with suitable electro-optic devices in between, as shown in Fig. 3, one can\nobtain fast switching among several different helical orders. This could be very useful if helical modes are to be used in multi-state optical information encoding, as recently proposed\nfor classical communication13 and for quantum communication and computation.14,15\nAlthough in our proof-of-principle demonstration reported here we used a method for\npatterning our LC cell that works only for circular-symmetric geometries (as in the q = 1\nplate), LC cell patterning has the potential for obtaining any desired PBOE geometry.\nDifferent approaches, such as micro-rubbing,11 masked or holographic photo-alignment,16,17\nand silicon-oxide evaporated coatings,18 are all suitable.\nFinally, we note that the PBOE principle is strictly related to the so-called polarization\nholography (PH), in which the holographic material records the information contained in the\noptical polarization.19 Typically, in PH one needs a light-sensitive polymer that can align\nits molecular chains parallel or perpendicular to the polarization direction.20 In order to\nmemorize a given wavefront in a PH hologram, one must superimpose the wave carrying\nthat wavefront with a plane-wave reference, taking care that both waves are circularly polarized, with opposite handedness. The resulting interference field will have uniform intensity\nand it will be everywhere linearly polarized, but it will have a nonuniform polarization orientation which will be imprinted in the hologram. When illuminated with a plane wave,\nthis hologram will reconstruct the recorded wavefront, or its conjugate, at its ±1 diffraction\norders. However, if the hologram is \"developed\" into a inhomogeneous birefringent plate\nhaving half-wave retardation (for example by using the hologram as a \"command\" surface\nof a LC cell, or if the hologram itself has sufficient birefringence), the zero diffraction order\nwill vanish identically and the hologram becomes a PBOE device generating a single optical\noutput with the recorded wavefront, or its conjugate, when illuminated with a circularly\npolarized plane wave.\nIn conclusion, we have demonstrated a Pancharatnam-Berry phase optical element working in the visible domain, based on patterned liquid crystal technology. This device can\nbe used for generating fast switchable helical modes, with potential applications to optical\ninformation encoding. Some plausible strategies for generalizing our approach have been\ndiscussed.\n\n5\n\n\f∗\n\nElectronic address: lorenzo.marrucci@na.infn.it\n\n1\n\nS. Pancharatnam, Proc. Indian Acad. Sci. Sect. A 44, 247 (1956).\n\n2\n\nM. V. Berry, J. Mod. Opt. 34, 1401 (1987).\n\n3\n\nR. Bhandari, Phys. Rep. 281, 1 (1997).\n\n4\n\nZ. Bomzon, G. Biener, V. Kleiner, and E. Hasman, Opt. Lett. 27, 1141 (2002).\n\n5\n\nG. Biener, A. Niv, V. Kleiner, and E. Hasman, Opt. Lett. 27, 1875 (2002).\n\n6\n\nE. Hasman, Z. Bomzon, A. Niv, G. Biener, and V. Kleiner, Opt. Commun. 209, 45 (2002).\n\n7\n\nE. Hasman, V. Kleiner, G. Biener, and A. Niv, Appl. Phys. Lett. 82, 328 (2003).\n\n8\n\nL. Allen, M. W. Beijersbergen, R. J. C. Spreeuw, and J. P. Woerdman, Phys. Rev. A 45, 8185\n(1992).\n\n9\n\nS. Sundbeck, I. Gruzberg, and D. G. Grier, Opt. Lett. 30, 477 (2005).\n\n10\n\nA. Niv, G. Biener, V. Kleiner, and E. Hasman, Opt. Commun. 251, 306 (2005).\n\n11\n\nS. Varghese, G. P. Crawford, C. W. M. Bastiaansen, D. K. G. de Boer, and D. J. Broer, Appl.\nPhys. Lett. 85, 230 (2004).\n\n12\n\nI. M. Syed, G. Carbone, C. Rosenblatt, and B. Wen, J. Appl. Phys. 98, 034303 (2005).\n\n13\n\nG. Gibson, J. Courtial, M. J. Padgett, M. Vasnetsov, V. Pas'ko, S. M. Barnett, and S. FrankeArnold, Opt. Express 12, 5448 (2004).\n\n14\n\nJ. Leach, M. J. Padgett, S. M. Barnett, S. Franke-Arnold, and J. Courtial, Phys. Rev. Lett. 88,\n257901 (2002).\n\n15\n\nA. Vaziri, G. Weihs, and A. Zeilinger, Phys. Rev. Lett. 89, 240401 (2002).\n\n16\n\nM. Schadt, H. Seiberle, and A. Schuster, Nature 381, 212 (1996).\n\n17\n\nY.-H. Fan, H. Ren, and S.-T. Wu, Opt. Express 11, 3080 (2003).\n\n18\n\nJ. Chen, P. J. Bos, D. R. Bryant, D. L. Johnson, S. H. Jamal, and J. R. Kelly, Appl. Phys.\nLett. 67, 1990 (1995).\n\n19\n\nT. Todorov, L. Nikolova, and N. Tomova, Appl. Opt. 23, 4309 (1984).\n\n20\n\nM. Eich, J. H. Wendorff, B. Peck, and H. Ringsdorf, Makromol. Chem. Rapid. Commun. 8, 59\n(1987).\n\n6\n\n\fFIG. 1: Examples of half-wave PBOE geometries. Dashes indicate local optical axis direction.\n(a) PBOE behaving as a circular-polarizing beam-splitter or switch; (b) PBOE behaving as a\npolarization-dependent lens; (c) q-plate PBOE with q = 1/2 and α0 = 0, generating helical modes\nof order ±1; (d) q-plate PBOE with q = 1 and α0 = π/2, generating helical modes of order ±2.\n\n7\n\n\fFIG. 2: Experimental images. (a) A LC q-plate held between crossed polarizers, showing the\nexpected pattern for q = 1 geometry. (b) \"Doughnut\" intensity profile of the beam emerging from\nthe q-plate. (c-f) Interference patterns of helical modes generated by our q-plate. (c-d) panels refer\nto the plane-wave reference geometry, (e-f) panels to the spherical-wave reference one. Panels on\nthe left, (c) and (e), are for a left-circular input polarization and those on the right, (d) and (f),\nfor a right-circular one.\n\n8\n\n\fFIG. 3: A n stages PBOE optical system for generating helical modes of light having an order l\nwhich can be electro-optically switched in the set l ∈ {−2nq, −2(n − 2)q, . . . , +2(n − 2)q, +2nq}.\nLegend: PC - Pockel cell; QWP - quarter-wave plate.\n\n9\n\n\f"}