{"id": "http://arxiv.org/abs/1005.5204v1", "guidislink": true, "updated": "2010-05-28T02:46:47Z", "updated_parsed": [2010, 5, 28, 2, 46, 47, 4, 148, 0], "published": "2010-05-28T02:46:47Z", "published_parsed": [2010, 5, 28, 2, 46, 47, 4, 148, 0], "title": "Spreading of Fluids on Solids Under Pressure: Effect of Slip", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.4457%2C1005.0891%2C1005.0800%2C1005.1688%2C1005.1512%2C1005.3827%2C1005.2512%2C1005.3584%2C1005.1387%2C1005.4911%2C1005.5397%2C1005.3841%2C1005.5241%2C1005.3489%2C1005.3645%2C1005.1228%2C1005.5705%2C1005.4452%2C1005.3010%2C1005.3295%2C1005.3253%2C1005.4859%2C1005.3058%2C1005.5582%2C1005.0360%2C1005.2671%2C1005.3082%2C1005.3307%2C1005.0379%2C1005.0179%2C1005.0721%2C1005.3594%2C1005.5232%2C1005.3960%2C1005.3371%2C1005.2439%2C1005.2563%2C1005.2596%2C1005.3541%2C1005.1575%2C1005.2074%2C1005.0912%2C1005.1879%2C1005.1635%2C1005.5140%2C1005.2546%2C1005.0822%2C1005.5204%2C1005.2405%2C1005.2960%2C1005.0635%2C1005.1502%2C1005.3545%2C1005.4741%2C1005.1311%2C1005.3432%2C1005.1614%2C1005.4461%2C1005.0875%2C1005.0380%2C1005.0037%2C1005.0946%2C1005.1351%2C1005.0798%2C1005.1396%2C1005.0545%2C1005.0674%2C1005.5549%2C1005.3237%2C1005.0824%2C1005.2833%2C1005.2523%2C1005.5301%2C1005.3920%2C1005.4235%2C1005.4111%2C1005.1566%2C1005.5508%2C1005.2333%2C1005.3605%2C1005.3128%2C1005.3392%2C1005.1471%2C1005.2204%2C1005.4474%2C1005.0561%2C1005.2791%2C1005.1196%2C1005.5453%2C1005.2967%2C1005.2933%2C1005.2163%2C1005.5076%2C1005.5070%2C1005.2501%2C1005.2682%2C1005.3668%2C1005.4414%2C1005.3703%2C1005.0998%2C1005.4241&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Spreading of Fluids on Solids Under Pressure: Effect of Slip"}, "summary": "Spreading of different types of fluid on substrates under an impressed force\nis an interesting problem. Here we study spreading of four fluids, having\ndifferent hydrophilicity and viscosity on two substrates - glass and perspex,\nunder an external force. The area of contact of fluid and solid is\nvideo-photographed and its increase with time is measured. The results for\ndifferent external forces can be scaled onto a common curve. We try to explain\nthe nature of this curve on the basis of existing theoretical treatment where\neither the no-slip condition is used or slip between fluid and substrate is\nintroduced. We find that of the eight cases under study, in five cases\nquantitative agreement is obtained using a slip coefficient.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.4457%2C1005.0891%2C1005.0800%2C1005.1688%2C1005.1512%2C1005.3827%2C1005.2512%2C1005.3584%2C1005.1387%2C1005.4911%2C1005.5397%2C1005.3841%2C1005.5241%2C1005.3489%2C1005.3645%2C1005.1228%2C1005.5705%2C1005.4452%2C1005.3010%2C1005.3295%2C1005.3253%2C1005.4859%2C1005.3058%2C1005.5582%2C1005.0360%2C1005.2671%2C1005.3082%2C1005.3307%2C1005.0379%2C1005.0179%2C1005.0721%2C1005.3594%2C1005.5232%2C1005.3960%2C1005.3371%2C1005.2439%2C1005.2563%2C1005.2596%2C1005.3541%2C1005.1575%2C1005.2074%2C1005.0912%2C1005.1879%2C1005.1635%2C1005.5140%2C1005.2546%2C1005.0822%2C1005.5204%2C1005.2405%2C1005.2960%2C1005.0635%2C1005.1502%2C1005.3545%2C1005.4741%2C1005.1311%2C1005.3432%2C1005.1614%2C1005.4461%2C1005.0875%2C1005.0380%2C1005.0037%2C1005.0946%2C1005.1351%2C1005.0798%2C1005.1396%2C1005.0545%2C1005.0674%2C1005.5549%2C1005.3237%2C1005.0824%2C1005.2833%2C1005.2523%2C1005.5301%2C1005.3920%2C1005.4235%2C1005.4111%2C1005.1566%2C1005.5508%2C1005.2333%2C1005.3605%2C1005.3128%2C1005.3392%2C1005.1471%2C1005.2204%2C1005.4474%2C1005.0561%2C1005.2791%2C1005.1196%2C1005.5453%2C1005.2967%2C1005.2933%2C1005.2163%2C1005.5076%2C1005.5070%2C1005.2501%2C1005.2682%2C1005.3668%2C1005.4414%2C1005.3703%2C1005.0998%2C1005.4241&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Spreading of different types of fluid on substrates under an impressed force\nis an interesting problem. Here we study spreading of four fluids, having\ndifferent hydrophilicity and viscosity on two substrates - glass and perspex,\nunder an external force. The area of contact of fluid and solid is\nvideo-photographed and its increase with time is measured. The results for\ndifferent external forces can be scaled onto a common curve. We try to explain\nthe nature of this curve on the basis of existing theoretical treatment where\neither the no-slip condition is used or slip between fluid and substrate is\nintroduced. We find that of the eight cases under study, in five cases\nquantitative agreement is obtained using a slip coefficient."}, "authors": ["Soma Nag", "Tapati Dutta", "Sujata Tarafdar"], "author_detail": {"name": "Sujata Tarafdar"}, "author": "Sujata Tarafdar", "arxiv_comment": "6 figures", "links": [{"href": "http://arxiv.org/abs/1005.5204v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1005.5204v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1005.5204v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1005.5204v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:1005.5204v1 [cond-mat.soft] 28 May 2010\n\nSpreading of Fluids on Solids Under Pressure:\nEffect of Slip\nSoma Nag1, Tapati Dutta2 and Sujata Tarafdar1∗\nMarch 1, 2018\n1\n\nCondensed Matter Physics Research Centre, Physics Department\nJadavpur University, Kolkata 700032, India\n2\nPhysics Department, St. Xavier's College, Kolkata 700016, India\n∗\nCorresponding author: Email: sujata tarafdar@hotmail.com,\nPhone:+913324146666(extn. 2760)\nAbstract\nSpreading of different types of fluid on substrates under an impressed\nforce is an interesting problem. Here we study spreading of four fluids,\nhaving different hydrophilicity and viscosity on two substrates - glass\nand perspex, under an external force. The area of contact of fluid\nand solid is video-photographed and its increase with time is measured. The results for different external forces can be scaled onto a\ncommon curve. We try to explain the nature of this curve on the basis\nof existing theoretical treatment where either the no-slip condition is\nused or slip between fluid and substrate is introduced. We find that\nof the eight cases under study, in five cases quantitative agreement is\nobtained using a slip coefficient.\n\nKeywords: Spreading, squeeze film, viscous flow, slip\nPACS Nos.: Wetting in liquid-solid interfaces - 68.08.Bc\n: Viscosity, experimental study - 66.20.Ej\n\n1\n\nIntroduction\n\nWetting and spreading[1, 2, 3] are very common everyday phenomena, but\nthere are still a lot of open problems in this field. A simple example is 1\n\n\fwhat happens when a fluid is forced to spread under an externally impressed\nforce ? There is no fully satisfactory answer to be found in the otherwise\ncomprehensive literature on the topic, though such experiments are routinely\nused to characterize viscoelastic materials.\nIn the present paper, we report a set of very simple experiments on the\nso-called 'squeeze film' and try to find a theoretical framework to explain\nour results. The problem is briefly described as follows - a small droplet of\na liquid, placed on a solid plate will take the shape of a section of a sphere.\nUnder equilibrium, the well known Young-Laplace relation holds, involving\nan equilibrium angle of contact θe .The dynamic condition while the fluid is\nspreading, i.e. the area of contact of the fluid and solid is increasing in time,\nis also well studied. There are a number of excellent reviews summarising\nstudies on - the rate of spreading, the forces responsible and other interesting\nfeatures [1, 3, 4, 5]. We now look at a simple extension of the problem - what\nhappens if the fluid is forced to spread beyond its equilibrium area, under a\nconstant weight placed on top of it. A preliminary report was published by\nour group in [6]. In this paper we study four different fluids on two different\nsolids, so as to have different combinations of viscosities of fluids as well as\ndifferent degrees of hydrophilicity of the fluids and solids. The results are\nanalyzed on the basis of viscous energy dissipation with and without slip[7, 4].\nWe find that while the no-slip result gives a fair quantitative estimate of\nthe contact area as function of time for only one case, it is possible to get\na better agreement in 5 of the 8 cases, on introducing a slip coefficient. Of\ncourse, this involves introduction of a free parameter (the slip coefficient)\nwhereas the no-slip analysis did not. The slip coefficient appears to depend\nmore on the solid surface than the fluid, and is an order of magnitude lower\nfor the perspex plate. The results for spreading of the same fluid on different\nsurfaces is quite different. There are 3 cases where the agreement between\ntheory and experiment is unsatisfactory and cannot be improved by introducing slip, so other effects are also at play. We describe the experimental\nsetup followed by the theory and present detailed results in the third section. Finally we compare experimental results with theory and discuss the\nimplications.\n\n2\n\nExperimental\n\nThe experimental fluids are castor oil, linseed oil, glycerol and ethylene glycol.\nThe choice of fluids is motivated by the following idea. While castor oil and\nlinseed oil are insoluble in water, with a low dielectric constant ǫ the other two\nfluids ethylene glycol and glycerol having high dielectric constants, are soluble\n2\n\n\fin water. (ǫ = 4.67, 3.35, 47.70 and 43.0 respectively for castor oil,linseed\noil, glycol and glycerol). Again, one fluid belonging to each type according\nto hydrophilicity, has high viscosity(μ), namely castor oil and glycerol(μ for\ncastor oil=986-451 cp for temp 20-30c,glycerol is 1490-629 cp for temp 2030c), while the others have much lower viscosity(μ for glycol is 19.9-9.13 cp\nfor temp 20-40c , linseed oil=33.1-17.6 cp for temp 20-50c).\nA constant volume Vf of the fluid is measured with a micropipette and\nplaced on the lower plate. The upper plate is then placed on the drop and a\nload of M kg. (M = 1 to 5) is placed on it. The pair of plates are ∼ 1 cm thick,\none pair is made of float glass and the other of perspex. A video camera,\nplaced below the lower glass plate records the slow increase in area. The video\nclips are analyzed using Image Pro-plus software. We find that the area of the\ndrop in contact with the plate increases with time at first. Then after some\ntime it reaches a saturation value and does not increase significantly with\ntime any more. The time of saturation and area of saturation are different\nfor different fluid-solid combinations. We plotted the area vs. time graph\nfor all fluid-solid combinations. Fig(1) and fig(2) show respectively area vs.\ntime graphs for Castor oil and glycol respectively on perspex for loads from\n1-5 kg. Interestingly when the data for area are divided by the load mass\nM, the curves come very close to each other, almost collapsing to a single\nmaster curve. Again, for castor oil on perspex area increases for a long time.\nIt takes several minutes to saturate approximately and continue to increase\nvery slowly even after 5 minutes.For glycol on both the substrates, on the\nother hand, the area increases very fast and saturates in a few seconds. Video\nphotos are taken initially, at the rate of 10 frames/sec, in this case.\n\n3\n\nTheory\n\nWe discuss in this section standard formulations for this kind of problem. The\n'squeeze flow' usually discussed in chemical engineering literature is different\nfrom our experiment, ours is a constant volume squeeze, where whole mass of\nfluid taken is always confined within the two plates. In the usual experiment\na constant area setup is used, where both plates are immersed in the fluid,\nthe distance between the plates as function of time is measured as a force is\napplied on the upper plate.\nFirst we outline the steps worked out for the no-slip case, i.e. assuming\nthat the layer of fluid next to the static plate has zero velocity. The analysis\nroughly follows [7].\n\n3\n\n\f3.1\n\nNo-slip\n\nWe assume the fluid to be Newtonian and incompressible with constant volume vf . Ours is a constant force set up, the force Mg acts on the fluid layer.\nThe velocity first builds up, reaches a maximum and then starts to reduce as\nit squeezes the liquid film. The details are presented in [6], here we consider\nthe velocity decreasing regime only. We equate the loss of potential energy\nof the loaded plate with the work done against the viscous resistance. With\nh and r representing the instantaneous thickness and radius of the film respectively, p the pressure and pA the atmospheric pressure. In moving over\na distance dh the work done is given by\nZ\ndh (p − pA )2πrdr\n(1)\nThe loss of potential energy is\nMg(h − (h − dh)) = Mgdh\n\n(2)\n\nNow the pressure p at any point r from the center of the upper plate for\nany given distance h, where the velocity of the upper plate V = −dh/dt can\nbe calculated as\n3μV (R2 − r 2 )\np−A=\nh3\nTherefore, we can write,\nZ\nZ\nZ\nMgdh = dh (p − pA )2πrdr\nSubstituting for (p − pA ), we get,\nZ\n3μV (R2 − r 2 )\nMg =\n2πrdr\nh3\nWhich , on integration gives,\n3μvf2 dh\n2πh5 dt\nZ\nZ t\n3μvf2 2 dh\nMgdt = −\n2π 1 h5\n0\nMg = −\n\n1\n3μ(vf )2 1\n[ 4 − 4]\nMgt =\n8π\nh2 h1\n4\n\n(3)\n\n(4)\n\n(5)\n\n(6)\n(7)\n(8)\n\n\fMgt =\n\n3μ\n(A4 − A41 )\n8πvf2 2\n\n(9)\n\nThe right hand expression depends on the impressed force Mg through the\narea of contact A(t). If we divide both sides by M, the LHS is independent\nof M. The RHS is now a function of A(M), M and t. We call this function\nG(M, t). We calculate the RHS from experimental data and compare with the\nLHS. If the principles on which the derivation is based are correct, the RHS\ncalculated from experimental results should be independent of M. That is\nthe curves G(M, t) vs. t should collapse to a single curve and be numerically\nequal gt.\nso, we test the result\ngt = G(M, t)\n\n(10)\n\nby plotting the LHS and RHS separately on the same graph and check\nhow well they agree. Of course the agreement can be expected only for the\ntime interval before the area of contact saturates, since the LHS goes on\nincreasing linearly.\n\n3.2\n\nAnalysis of Experimental Results assuming no-slip\n\nThe results for glycerol on glass are shown in fig(3). We see that for this\ncombination assuming no slip gives an acceptable quantitative agreement\nbetween the lhs and rhs of eq(10). This calculation involves no adjustable\nparameter. It may further be noted that the data for different loads collapse\nalmost to a single line, on scaling by M. However, for the other fluid-solid\ncombinations, such quantitative agreement is not found. We try to see now\nif this discrepancy may be attributed to the effect of slip at the fluid and\nsolid interface.\nWe follow the equation given by [8] listed in [4] for this situation.\n\n3.3\n\nEffect of slip\n\nRelative motion between a solid surface and material contacting it (wall\nslip) is a phenomenon observed with many materials [4]. In the last section\nwe assumed that the layer of the liquid touching the lower fixed plate has\nzero velocity. So that the applied force is entirely carried away by viscous\ndissipation. But experiments show that there may be cases where the layer of\nthe liquid having contact with the substrate may have finite velocities, which\nmay affect the spreading of the liquid drop. In these cases, shear stresses at\n5\n\n\fthe sample-plate interfaces may vanish (for perfect slip) or reduce (for partial\nslip). The amount of slip depends not only on the liquid tested, but also on\nthe material and roughness of the substrates. We introduce partial slip in\nthe analysis as follows.\n\n3.4\n\nPartial slip\n\nNo slip and perfect slip are two limiting cases of slip phenomenon. To explain\nour results, we take partial slip into consideration. Stefan[8] gave a slip law\nof the form ,\nv =β∗τ\n\n(11)\n\nwhere, β is the slip coefficient and τ is the wall shear stress . The value\nof β is zero for no slip and is infinity for perfect slip cases. It may have\nany value in between, for partial slip cases, depending on the liquid and the\nsubstrate.\nWith the introduction of β,the force equation becomes,\nZ\n3μvf (R2 − r 2 )2πrdr\nMg =\n(12)\nh3 (1 + 6βμ/h)\nZ\nZ\n3μvf2\ndh\n(13)\nMgdt = −\n5\n2π\nh + 6βμh4\nZ\n3μvf2\ndh\nMgt = −\n(14)\n2π\nh5 + 6βμh4\nDividing by M.\ngt = R(M, t)\n\n(15)\n\nwhere, the integral can be evaluated as\nR(M, t) = −1/k 4 ∗ [k 3 /h3 + 3k 2 /2h2 − ln(1 + k/h)]h2\nh1\n\n(16)\n\nwith k = 6βμ\nThe above force equation, on integration, gives us the function R(M, t)\nsimilar to G(M, t) for the no-slip case. We fit the slip coefficient β so as to\nget the best fit between the left and right sides of equation 15. the results\nare shown in the next section.\n\n6\n\n\f3.5\n\nResults with partial slip\n\nTable(1) shows values of β for different fluid-solid combinations. We find\nthat the values of β ranges from 10−3 to 10−5 for glass and from 10−5 to 10−6\nfor perspex. So glass has a larger β than perspex. For a definite substrate\nthe values of β are different for different liquids. In Table 1 we also show\nthe initial contact area A0 (before loading) and the viscosities and dielectric\nconstants of the fluids and substrates.\nFigures (4) and (5) show respectively the graphs comparing R(M, t) and\ngt for ethylene glycol on glass and for castor oil on perspex. The coefficients\nβ for the best fit are given in table 1.\nWhile five of the eight curves can be fit quite well with a finite β, in the\nremaining three cases a discrepancy remains. Here the fit becomes worse for\nany finite β. This is shown for glycol on perspex in figure(6), the other two\ncases are glycol on glass and linseed oil on perspex.\n\n4\n\nDiscussion\n\nOut of eight cases studied, we find that the theoretical framework considered\nhere can account for five cases fairly well with one free parameter, the slip\ncoefficient β. This is not bad considering the complexity of the problem and\nthe simplifications introduced.\nScrutiny of the table 1, reveals several interesting features. Let us look\nat A0 , the area of contact with only the plate on the fluid drop and no\nextra weights. we consider this as the reference condition. The mass of the\nperspex plate is 250 gm and the glass plate is about 700 gms. It is seen\nfrom spreading vs. load data (see [6]) that extrapolating to zero load does\nnot change this reference point significantly. We see that for glass A0 ranges\nfrom 2-5 cm2 , while for perspex we have values less than 1 and the highest\nis 1.4 cm2 . So equilibrium spreading on glass is higher in all cases. However,\nunder load fluids spread to a much greater extent on perspex, compared to\nglass. Looking at the percentage (of A0 ) spreading for the 5 kg. load, we\nsee that for glass it is always less than 50 %, whatever the fluid, while for\nperspex the area increases by 100 to 400 %. So, where the initial spreading\nis large, the effect of load is less and vice versa.\nThe highest spreading with load is observed for castor oil on perspex,\nmoreover castor oil shows a creep like behavior and continues to spread for\nvery long times, though the rate slows down. Possibly visco-elastic effects\nalso play important role and should be taken into consideration.\nThe three cases which cannot be explained by the present theory are all\n\n7\n\n\ffor the low viscosity fluids ethylene glycol and linseed oil. This treatment\nfocussing on the viscous effect works better in case of high viscosity. We have\ntabulated the dielectric constants along with other data in table 1, because\nearlier work [9] showed that the polarizabilties of the fluid and substrate are\nimportant in spreading phenomena. But here we find no significant correlation except that the maximum spreading (under load) is for the low dielectric\nfluid on the low dielectric substrate.\nTo conclude, spreading of different types of fluids on different solids is a\nvery complex and interesting problem, still open for exploration. Very simple\nexperimental apparatus provides a lot of food for thought in this area. The\nspreading and flow characteristics are routinely used for classifying soft materials in food technology and chemical engineering, so a deeper understanding\nwill be useful.\nFurther experiments and theoretical study taking into account effects of\nrheology, surface roughness and ambient conditions is required\n\n5\n\nAcknowledgment\n\nThis work is supported by UGC, Govt. of India. SS is grateful to UGC for\naward of a research fellowship.\n\nReferences\n[1] P. G. de Gennes, Wetting: statics and dynamics, Rev. Mod. Phys.\n57(1985) 827-862\n[2] William A. Zisman, Elaine G. Shaffin, J.Phys.Chem.,1960,64(5),pp 519524.\n[3] D. Bonn, J. Eggers, J. Meunier, E. Rolley, Wetting and spreading, to\nappear in Rev. Mod. Phys. 2009\n[4] J. Engmann, C. Servais, A.S. Burbridge, Squeeze flow theory and applications to rheometry: A review, J. Non-Newt. Fluid Mech. 132(2005)127\n[5] R. Asthana, N. Sobczak, Wettability,spreading and interfacial phenomena in high-temperature coatings, JOM-e 52(2000)\n[6] Soma Nag, Suparna dutta, Sujata Tarafdar, Applied Surface Science 256\n(2009) 353-355\n8\n\n\fsolid\n\nfluid\n\nǫs\n\nǫf\n\nglass\n\n7\n\n4.67\n\n450\n(30o C)\n2.63 4.67\n450\n\nglass\n\ncastor\noil\ncastor\noil\nlinseed\noil\nlinseed\noil\nglyce\nrol\nglyce\nrol\nglycol\n\npersp\n\nglycol\n\npersp\nglass\npersp\nglass\npersp\n\n7\n\nμ\npoise\n\nS\nN/m2\n\nβ\n\nA0\ncm2\n\n3.9\n\n.001\n\n%\nspread\n(1kg)\n2.05\n5\n\n%\nspread\n(5kg)\n29\n\n3.9\n\n.001\n\n1.42\n\n200\n\n370\n\n3.35\n\n33\n\n3.3\n\n.028\n\n4.4\n\n11.6\n\n48\n\n2.63 3.35\n\n33\n\n3.3\n\n-\n\n0.73\n\n21\n\n135\n\n.05\n\n5\n\n11\n\n31\n\n41\n\n90\n\ncomment\n\ngood\nfit\ngood\nfit\ngood\nfit\n×\n\n7\n\n43\n\n1000\n\n6.3\n\n2.63\n\n43\n\n1000\n\n63\n\n7\n\n41\n\n14\n\n4.8\n\n-\n\n2.22\n\n10\n\n42\n\ngood\nfit\ngood\nfit\n×\n\n2.63\n\n41\n\n14\n\n4.8\n\n-\n\n0.85\n\n38\n\n235\n\n×\n\n.0016 1.01\n\nTable 1: The table shows properties of the fluids and substrates used, μ\nrepresents the viscosity, ǫs and ǫl , the solid and liquid dielectric constants,\nS the surface tension. Results from the experiment are - the initial area of\ncontact A0 , the percentile spreading of area under loads of 1 and 5 kg., the\nslip coefficient β which gives a best fit for the spreading master curve.\n\n9\n\n\f[7] F.R. Eirich, D. Tabor, Collisions through liquid films, Proc. Camb. Phil\nSoc. (1948) 566-581\n[8] J Stefan, Akad.Wiss.Math.Nat.Wien 69(2)(1874)713-735\n[9] S. Sinha, T. Dutta, S. Tarafdar, Eur. Phys. J. E 25(2008) 267-275\n\n10\n\n\f7\n1.25 kg\n2.25 kg\n3.25 kg\n4.25 kg\n5 kg\n\n6\n\nArea(sq.cm)\n\n5\n\n4\n\n3\n\n2\n\n1\n\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\n70\n60\nTime(sec)\n\n80\n\n90\n\n100\n\n110\n\n120\n\nFigure 1: This figure shows area vs. time graph for Castor oil on perspex.\n\n11\n\n\f4\n1.25 kg\n2 25 kg\n3 25 kg\n4.25\n5.25\n\n3.5\n\nArea(sq.cm)\n\n3\n\n2.5\n\n2\n\n1.5\n\n1\n0\n\n1\n\n2\n\n3\n\n4\n\nTime(sec)\n\nFigure 2: This figure shows area vs.time graph for glycol on perspex.\n\n12\n\n5\n\n\fG(M,t) Nm/sec\n\n1000\n\n100\n\n1 kg\n2 kg\n3 kg\n4 kg\n5 kg\ngt\n\n10\n\n0.2\n\n0.4\nTime(sec)\n\n0.6\n\nFigure 3: This figure tests gt=G(M,t) results for glycerol on glass\n\n13\n\n\f100\n\nR(M,t)Nm/sec\n\n10\n\ngt\n1 kg\n2 kg\n3 kg\n4 kg\n5 kg\n\n1\n\n0.1\n\n0.01\n\n0.5\nTime(sec)\n\nFigure 4: This figure tests gt = R(M,t) results for glycol on glass. Introduction of slip coefficient β gives a good agreement.\n\n14\n\n\fR(M,t)Nm/sec\n\n1000\n\n100\n\ngt\n1 kg\n2 kg\n3 kg\n4 kg\n5 kg\n\n10\n\n1\n\n2\n\n4\n\n6\nTime(sec)\n\n8\n\n10\n\nFigure 5: This figure tests gt = R(M,t) results for castor oil on perspex.\nIntroduction of slip coefficient β gives a good agreement.\n\n15\n\n\f10\n\nR(M,t)Nm/sec\n\n1\n\n0.1\ngt\n1 kg\n2 kg\n3 kg\n4 kg\n5 kg\n\n0.01\n\n0.001\n\n0.2\n\n0.4\nTime(sec)\n\n0.6\n\nFigure 6: This figure shows that gt does not equal R(M,t) for glycol on\nperspex, for any positive value of β.\n\n16\n\n\f"}