{"id": "http://arxiv.org/abs/0905.1898v1", "guidislink": true, "updated": "2009-05-12T16:26:14Z", "updated_parsed": [2009, 5, 12, 16, 26, 14, 1, 132, 0], "published": "2009-05-12T16:26:14Z", "published_parsed": [2009, 5, 12, 16, 26, 14, 1, 132, 0], "title": "Automorphism Groups of Schur Rings", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0905.1361%2C0905.4424%2C0905.1759%2C0905.1015%2C0905.4839%2C0905.2769%2C0905.0066%2C0905.0760%2C0905.2083%2C0905.3007%2C0905.4165%2C0905.3761%2C0905.2724%2C0905.0238%2C0905.1898%2C0905.4104%2C0905.4140%2C0905.4226%2C0905.0715%2C0905.3755%2C0905.0422%2C0905.1475%2C0905.1132%2C0905.1831%2C0905.3561%2C0905.0864%2C0905.0697%2C0905.4832%2C0905.1879%2C0905.2664%2C0905.3969%2C0905.0573%2C0905.2129%2C0905.4528%2C0905.0575%2C0905.4415%2C0905.0847%2C0905.0435%2C0905.1684%2C0905.1848%2C0905.0965%2C0905.0276%2C0905.1230%2C0905.1781%2C0905.0789%2C0905.1379%2C0905.0882%2C0905.1715%2C0905.4514%2C0905.4157%2C0905.0252%2C0905.4156%2C0905.3434%2C0905.4421%2C0905.4070%2C0905.1669%2C0905.2089%2C0905.1559%2C0905.3121%2C0905.0963%2C0905.1053%2C0905.4206%2C0905.0350%2C0905.3544%2C0905.2385%2C0905.0714%2C0905.3971%2C0905.4387%2C0905.4355%2C0905.1829%2C0905.1318%2C0905.0538%2C0905.2489%2C0905.2540%2C0905.1617%2C0905.0099%2C0905.2173%2C0905.2882%2C0905.4320%2C0905.3468%2C0905.3713%2C0905.2135%2C0905.0437%2C0905.2341%2C0905.2476%2C0905.2779%2C0905.4061%2C0905.1067%2C0905.0615%2C0905.2388%2C0905.4395%2C0905.2342%2C0905.1634%2C0905.1498%2C0905.2768%2C0905.2009%2C0905.3877%2C0905.1339%2C0905.2900%2C0905.0150%2C0905.2867&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Automorphism Groups of Schur Rings"}, "summary": "In 1993, Muzychuk \\cite{muzychuk} showed that the rational Schur rings over a\ncyclic group $Z_n$ are in one-to-one correspondence with sublattices of the\ndivisor lattice of $n$, or equivalently, with sublattices of the lattice of\nsubgroups of $Z_n$. This can easily be extended to show that for any finite\ngroup $G$, sublattices of the lattice of characteristic subgroups of $G$ give\nrise to rational Schur rings over $G$ in a natural way. Our main result is that\nany finite group may be represented as the (algebraic) automorphism group of\nsuch a rational Schur ring over an abelian $p$-group, for any odd prime $p$. In\ncontrast, we show that over a cyclic group the automorphism group of any Schur\nring is abelian. We also prove a converse to the well-known result of Muzychuk\n\\cite{muzychuk2} that two Schur rings over a cyclic group are isomorphic if and\nonly if they coincide; namely, we show that over a group which is not cyclic,\nthere always exist distinct isomorphic Schur rings.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0905.1361%2C0905.4424%2C0905.1759%2C0905.1015%2C0905.4839%2C0905.2769%2C0905.0066%2C0905.0760%2C0905.2083%2C0905.3007%2C0905.4165%2C0905.3761%2C0905.2724%2C0905.0238%2C0905.1898%2C0905.4104%2C0905.4140%2C0905.4226%2C0905.0715%2C0905.3755%2C0905.0422%2C0905.1475%2C0905.1132%2C0905.1831%2C0905.3561%2C0905.0864%2C0905.0697%2C0905.4832%2C0905.1879%2C0905.2664%2C0905.3969%2C0905.0573%2C0905.2129%2C0905.4528%2C0905.0575%2C0905.4415%2C0905.0847%2C0905.0435%2C0905.1684%2C0905.1848%2C0905.0965%2C0905.0276%2C0905.1230%2C0905.1781%2C0905.0789%2C0905.1379%2C0905.0882%2C0905.1715%2C0905.4514%2C0905.4157%2C0905.0252%2C0905.4156%2C0905.3434%2C0905.4421%2C0905.4070%2C0905.1669%2C0905.2089%2C0905.1559%2C0905.3121%2C0905.0963%2C0905.1053%2C0905.4206%2C0905.0350%2C0905.3544%2C0905.2385%2C0905.0714%2C0905.3971%2C0905.4387%2C0905.4355%2C0905.1829%2C0905.1318%2C0905.0538%2C0905.2489%2C0905.2540%2C0905.1617%2C0905.0099%2C0905.2173%2C0905.2882%2C0905.4320%2C0905.3468%2C0905.3713%2C0905.2135%2C0905.0437%2C0905.2341%2C0905.2476%2C0905.2779%2C0905.4061%2C0905.1067%2C0905.0615%2C0905.2388%2C0905.4395%2C0905.2342%2C0905.1634%2C0905.1498%2C0905.2768%2C0905.2009%2C0905.3877%2C0905.1339%2C0905.2900%2C0905.0150%2C0905.2867&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In 1993, Muzychuk \\cite{muzychuk} showed that the rational Schur rings over a\ncyclic group $Z_n$ are in one-to-one correspondence with sublattices of the\ndivisor lattice of $n$, or equivalently, with sublattices of the lattice of\nsubgroups of $Z_n$. This can easily be extended to show that for any finite\ngroup $G$, sublattices of the lattice of characteristic subgroups of $G$ give\nrise to rational Schur rings over $G$ in a natural way. Our main result is that\nany finite group may be represented as the (algebraic) automorphism group of\nsuch a rational Schur ring over an abelian $p$-group, for any odd prime $p$. In\ncontrast, we show that over a cyclic group the automorphism group of any Schur\nring is abelian. We also prove a converse to the well-known result of Muzychuk\n\\cite{muzychuk2} that two Schur rings over a cyclic group are isomorphic if and\nonly if they coincide; namely, we show that over a group which is not cyclic,\nthere always exist distinct isomorphic Schur rings."}, "authors": ["Brent Kerby"], "author_detail": {"name": "Brent Kerby"}, "author": "Brent Kerby", "links": [{"href": "http://arxiv.org/abs/0905.1898v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0905.1898v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.RA", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.RA", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.GR", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "16S34", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0905.1898v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0905.1898v1", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "arXiv:0905.1898v1 [math.RA] 12 May 2009\n\nAutomorphism Groups of Schur Rings\nBrent Kerby\nOctober 19, 2018\nBrigham Young University, Department of Mathematics, Provo, UT 84604\nAbstract\nIn 1993, Muzychuk [18] showed that the rational Schur rings over a cyclic\ngroup Zn are in one-to-one correspondence with sublattices of the divisor lattice\nof n, or equivalently, with sublattices of the lattice of subgroups of Zn . This\ncan easily be extended to show that for any finite group G, sublattices of the\nlattice of characteristic subgroups of G give rise to rational Schur rings over G\nin a natural way. Our main result is that any finite group may be represented\nas the (algebraic) automorphism group of such a rational Schur ring over an\nabelian p-group, for any odd prime p. In contrast, we show that over a cyclic\ngroup the automorphism group of any Schur ring is abelian. We also prove a\nconverse to the well-known result of Muzychuk [19] that two Schur rings over a\ncyclic group are isomorphic if and only if they coincide; namely, we show that\nover a group which is not cyclic, there always exist distinct isomorphic Schur\nrings.\n\nSchur rings (or S-rings), first developed by I. Schur in [20] in 1933 as a tool for\ninvestigating permutation groups, have subsequently found several applications in\ngraph theory and algebraic combinatorics. For a survey of the recent developments in\nS-rings and their applications, see [17]. All of the definitions and elementary results\nthat we need will be reviewed in §1.\nA great deal of effort has been focused on obtaining a classification of S-rings\nover cyclic groups, which was achieved in [13, 14]. After the successful classification\nof S-rings over cyclic groups, a logical next step has been to seek classifications for\nS-rings over broader families of groups. This, however, appears to be a very difficult\nproblem even in the case, for instance, of abelian p-groups. One approach is to restrict\nattention to special types of S-rings, in particular rational S-rings, in the hope that\nunderstanding these may shed light on the general problem. In §2 we describe a general construction which, for each sublattice of the lattice of characteristic subgroups\nof a group G, produces a corresponding rational S-ring over G. This construction generalizes the one in [18] used to classify rational S-rings over cyclic groups. In §3 we\nreview the structure of the lattice of characteristic subgroups over abelian p-groups.\nThis enables us to explicitly describe the construction of many rational S-rings over\nsuch groups, which we will need for our main result in §4.\n1\n\n\fWe consider the following question: Which groups can occur as the automorphism\ngroup of an S-ring? It is clear that the automorphism group of a full group ring CG\n(as an S-ring) is isomorphic to the automorphism group of G. Thus, any group which\nmay be represented as the automorphism group of a group may also be represented\nas the automorphism group of an S-ring in a rather trivial way. It is known, however,\nthat there are finite groups (for instance, Z3 ) which are not isomorphic to the automorphism group of any group (see, e.g., [22], or [12, Theorem 3.6]). Nevertheless,\nevery finite group occurs as the automorphism group of some S-ring, as our main\nresult shows:\nTheorem 4.1 (Main Theorem). Let p be an odd prime. Every finite group can be\nrepresented as the automorphism group of a rational S-ring over an abelian p-group.\nAt the core of the proof is an application of a theorem of Birkhoff that any finite\ngroup can be represented as the automorphism group of a finite distributive lattice.\nIn §5 we use the Leung-Man classification of S-rings over cyclic groups to prove the\nfollowing theorem, which shows that it is impossible to strengthen our main result by\nrestricting to S-rings over cyclic groups:\nTheorem 5.5. If S is an S-ring over a cyclic group Zn , then Aut(S) is abelian.\nA remarkable theorem of Muzychuk states that over a cyclic group, two S-rings\nare isomorphic if and only if they coincide [19]. This fact plays a key role in several\napplications, including our proof of Theorem 5.5. In §6, we prove a converse to this\nresult, as follows:\nTheorem 6.3. Let G be a finite group which is not cyclic. Then there exist distinct\nCayley-isomorphic S-rings S1 and S2 over G.\nFinally, in §7 we mention some interesting examples of rational S-rings over abelian\np-groups which cannot be constructed using the method of §2. We do not yet entirely\nunderstand how to generalize these examples, but doing so may be a starting point for\napproaching the general problem of classifying rational S-rings over abelian p-groups,\na problem which we believe shows some promise of being tractable.\nNote: Most of the results in this paper were included as part of the author's master's\nthesis [12], under the supervision of Stephen P. Humphries.\n\n1\n\nBasic definitions\n\nLet G be a finite\nPgroup and F a field. If C is a subset of G, then we define C to\nbe the element g∈C g in the group algebra F G, and we call C a simple quantity\nof F G. Given a subset C ⊆P\nG and an integer m, we define\nC (m) = {g m : g ∈ C}.\nP\nFor any x ∈ F G, where x = g∈G ag g, we define x(m) = g∈G ag g m . Given a subset\nX ⊆ F G, we denote the subspace spanned by X by F X. If L is a collection of subsets\nof G, we let L denote the set {C : C ∈ L}.\n2\n\n\fA subalgebra S of the group algebra F G is called a Schur ring (or S-ring) over\nG if there are disjoint nonempty subsets T1 , . . . , Tn of G such that T 1 , . . . , T n form a\nbasis for S, with the following properties,\n(−1)\n\n(i) For every i there is some j such that Ti\n\n= Tj .\n\n(ii) T1 = {1}, and G = T1 ∪ T2 ∪ * * * ∪ Tn .\nThe sets T1 , . . . , Tn are called basic sets of S and are said to form a Schur partition\nof G. The corresponding T 1 , . . . , T n are called the basic quantities of S. If S satisfies\ncondition (i), but perhaps not (ii), then S is called a pseudo S-ring (or PS-ring). The\ntwo sets {1}, G \\ {1} always form a Schur partition; the corresponding S-ring is called\nthe trivial S-ring over G.\nP\nP\nGiven x, y ∈ F G, where x = g∈G ag g, y = g∈G bg g, their Hadamard product is\ndefined by\nX\nx◦y =\nag bg g.\ng∈G\n\nThere is a well-known purely algebraic description of S-rings and PS-rings in terms of\nclosure under the Hadamard product, avoiding reference to the combinatorial notion\nof basic sets (for proofs, see [18, Proposition 3.1] and [19, Lemma 1.3], or [12, Theorem\n1.7, Corollary 1.8]):\n\nTheorem 1.1. Let A be a subalgebra of F G. Then A is a P S-ring if and only if A\nis closed under ◦ and (−1) .\nCorollary 1.2. Let A be a subalgebra of F G. Then A is an S-ring if and only if A\nis closed under ◦ and (−1) and contains 1 and G.\nDefinition 1.3. Let S1 and S2 be S-rings over groups G1 and G2 respectively. An\nalgebra isomorphism φ : S1 → S2 is called an isomorphism of S-rings if φ maps basic\nquantities to basic quantities, i.e., if for every basic set C of S1 there is some basic\nset D of S2 such that φ(C) = D.\nThe following well-known result gives a purely algebraic characterization of S-ring\nisomorphisms (an elementary proof may be found in [12, Theorem 3.4]):\nTheorem 1.4. Let S1 and S2 be S-rings over groups G1 and G2 respectively. Then an\nF -algebra isomorphism φ : S1 → S2 is an S-ring isomorphism if and only if φ respects\nthe Hadamard product, i.e., if and only if φ(x ◦ y) = φ(x) ◦ φ(y) for all x, y ∈ S1 .\nElsewhere in the literature, for clarity, an isomorphism of S-rings is sometimes\ncalled an algebraic isomorphism, in contrast to the notion of a combinatorial isomorphism of S-rings, which, properly speaking, is an isomorphism of the association\nschemes corresponding to the S-rings.\nIf C is any simple quantity contained in an S-ring S, then we say that C is an\nS-set. The following is also well-known (For a proof, see [12, Theorem 3.7, Corollary\n6.8]):\n3\n\n\fTheorem 1.5. Let φ : S1 → S2 be an isomorphism of S-rings over groups G1 and\nG2 respectively. Let C ⊆ G1 be an S1 -set. Then φ(C) = D for some S2 -set D ⊆ G2 ,\nand we write φ(C) = D. Moreover,\n(i) |C| = |D|, and\n(ii) If C is a subgroup then D is also a subgroup.\nAn isomorphism from an S-ring onto itself is called an automorphism. The set\nof automorphisms of an S-ring S is denoted Aut(S). Every group automorphism in\nAut(G) naturally induces an S-ring isomorphism of S (onto a possibly distinct Sring); such an isomorphism is called a Cayley isomorphism, and the two S-rings are\ncalled Cayley-isomorphic.\nIt is possible to consider S-rings where the coefficient field F is replaced by an\narbitrary ring R (with unity). The collection of Schur partitions is affected only by the\ncharacteristic of R; so whether R is Z, Q, C, or any other ring of characteristic 0 makes\nno difference, as far as the collection of Schur partitions is concerned. Nevertheless,\nTheorem 1.1 and Corollary 1.2 both become false over any commutative ring R which\nis not a field; for this reason, we will always take our coefficient ring to be a field F .\nOver rings of nonzero characteristic, the collection of Schur partitions includes all\nthose associated with zero characteristic in addition possibly to others. (For proof\nof these statements, see [12, Example 1.10, Theorem 1.12].) It is possible for the\nisomorphism class of the automorphism group Aut(S) to change depending on the\ncharacteristic of the coefficient field F (see Example 5.9 below). Throughout the\nliterature on S-rings, most authors assume a coefficient ring of characteristic zero.\nWe will also need this assumption in §5 when we show that the automorphism group\nof an S-ring over a cyclic group is abelian; indeed, this theorem becomes false over\nany ring of nonzero characteristic, as Example 5.9 will show.\n\n2\n\nCentral and rational S-rings\n\nDefinition 2.1. A PS-ring S over a group G is central if S ⊆ Z(F G), i.e., S is\ncontained in the center of the group algebra.\nRemark. This is equivalent to requiring that every basic set Ti be a union of conjugacy\nclasses of G.\nOf course, over an abelian group every S-ring is central. We are primarily interested in a special class of central S-rings known as rational S-rings:\nDefinition 2.2. A PS-ring S over a group G is rational if for every x ∈ S and\nφ ∈ Aut(G), we have φ(x) = x.\nRemark. This is equivalent to requiring that every basic set Ti be a union of automorphism classes of G, where the automorphism classes of G are the orbits of Aut(G)\nacting on G in the natural way.\n\n4\n\n\fThe following provides a method for constructing many interesting central and\nrational S-rings:\nTheorem 2.3. Let G be any finite group, and let L be any sublattice of the lattice of\nnormal subgroups of G. Then the vector space F L is a central PS-ring over G with\nthe following properties, for all H, K ∈ L:\n(i) H\n\n(−1)\n\n=H\n\n(ii) H ◦ K = H ∩ K\n(iii) H K = |H ∩ K|HK\n(iv) F L is an S-ring if and only if 1, G ∈ L.\n(v) F L is rational if and only if L consists entirely of characteristic subgroups.\nProof. (i) is clear since H, as a subgroup, is closed under inverses. (ii) is immediate\nfrom the definition of the Hadamard product. (iii) is clear since, by elementary group\ntheory, every element of HK can be written in |H ∩ K| ways as a product of an\nelement in H with an element in K. Now, since the subgroups H and K are normal,\nHK is also a subgroup of G; since L is a lattice, we have H ∩ K, HK ∈ L. Thus, (i)–\n(iii) show that F L is closed under (−1) , multiplication, and the Hadamard product,\nso by Theorem 1.1, F L is a PS-ring. Since each subgroup H is normal, we have\ngHg −1 = gHg −1 = H for all g ∈ G and H ∈ L, so that H ∈ Z(F G). It follows that\nF L is a central PS-ring.\nNow, if 1, G ∈ L then 1, G ∈ F L, so byTCorollary 1.2, F L is an S-ring. Suppose\nconversely that F L is an S-ring. Let L = H∈L H, so that L ∈ L. If |L| > 1, then\nsince L ⊆ H for every spanning element H of F L, it follows that every element of\nF L with a non-zero coefficient of 1 ∈ G also has other non-zero coefficients (namely,\nthe other elements of L have non-zero coefficients), so that 1 ∈\n/ F L, contrary to\nthe assumption that F L Q\nis an S-ring. So we must have L = 1, hence 1 ∈ L, as\ndesired. Now define M = H∈L H. If M 6= G, then since H ⊆ M for every spanning\nelement H of F L, it follows that the nonzero coefficients of every element x ∈ F L\nare contained in M, so that G ∈\n/ F L, again contradicting that F L is an S-ring. So\nG ∈ L as desired.\nFinally, F L is rational if and only if φ(H) = H for every φ ∈ Aut(G) and each\nspanning element H of F L; this holds if and only if φ(H) = H for each H ∈ L, i.e.\nif and only if each H ∈ L is characteristic.\nIf G is a cyclic group, then every subgroup of G is characteristic; consequently,\nthe construction of Theorem 2.3 produces only rational S-rings. In this context, we\nmay state the main theorem of [18] as follows:\nTheorem 2.4. (Muzychuk)Every rational S-ring over a finite cyclic group may be\nconstructed as in Theorem 2.3.\n\n5\n\n\fThere are rational S-rings over abelian p-groups which cannot be constructed as\nin Theorem 2.3 (see Example 7.1). However, there are other types of groups for which\nTheorem 2.3 produces the complete set of rational S-rings. We mention an example,\nwhose proof can be found in [12, Theorem 2.6]:\nTheorem 2.5. Every rational S-ring over a finite dihedral group may be constructed\nas in Theorem 2.3.\n\n3\n\nCharacteristic subgroups of abelian p-groups\n\nIn this section, we review the description of the automorphism classes and characteristic subgroups of finite abelian p-groups. This topic was considered in 1905 and 1920\nby G. A. Miller [15, 16] and again, independently, in 1934 by Baer, who considered\nthe more general case of periodic abelian groups [1], and finally in 1935 by Birkhoff\n[2]. The historical nature of these early works is such that they are not easy reading;\nthe present author confesses that in many places the statements made in them, and\nparticularly the proofs, do not always seem clear. A more recent treatment may be\nfound in [11] (or [12]), which includes proofs of all the results below as well as a\ndetailed description of the exceptional case p = 2.\nThroughout this section, G will denote a finite abelian p-group:\nG = Zp λ 1 × Zp λ 2 × * * * × Zp λ n ,\nwhere λ1 ≤ λ2 ≤ * * * ≤ λn . We define λ(G) to be the tuple (λ1 , . . . , λn ). For convenience, we will often use the convention λ0 = 0. As we will be working extensively\nwith such tuples of integers, it will be useful to introduce some notation for dealing\nwith them:\nDefinition 3.1. Given tuples a = (a1 , . . . , an ) and b = (b1 , . . . , bn ) with integer\nentries, define\na ≤ b if ai ≤ bi for all i ∈ {1, . . . , n}\na ∧ b = (min{a1 , b1 }, min{a2 , b2 }, . . . , min{an , bn })\na ∨ b = (max{a1 , b1 }, max{a2 , b2 }, . . . , max{an , bn })\nDefine Λ(G) to be the set of tuples\nΛ(G) = {a : 0 ≤ a ≤ λ(G)}.\nIt is evident that Λ(G), under the partial order ≤, forms a finite lattice in which ∧\nand ∨ are the greatest lower bound and least upper bound respectively.\nGiven a tuple a ∈ Λ(G), we define T (a) to be the set of elements g ∈ G for which\nthe ith component of g has order pai :\nT (a) = {(g1 , g2 , . . . , gn ) ∈ G : |gi | = pai for all i = 1, . . . , n}.\nNote that the sets T (a) partition the group G. If g ∈ T (a), we say that the type of\ng is T (a).\nThe following is straightforward to prove:\n6\n\n\fLemma 3.2. If two elements have the same type, then they are in the same automorphism class.\nDefinition 3.3. Given a type T (a), the automorphism class of G containing T (a) is\ndenoted O(a).\nDefinition 3.4. A tuple a = (a1 , . . . , an ) and its corresponding type T (a) are called\ncanonical if for all i ∈ {1, . . . , n − 1},\n(i) ai ≤ ai+1 and\n(ii) ai+1 − ai ≤ λi+1 − λi .\nThe definition of \"canonical\" is justified by the following theorem.\nTheorem 3.5. Every automorphism class contains a unique canonical type.\nExample 3.6. Let G = Z2 × Z8 = Z2 × Z23 = hsi × hti. Then there are 6 automorphism classes of G, namely:\nO(0, 0) = T (0, 0) = {1},\nO(0, 1) = T (0, 1) = {t4 },\nO(0, 2) = T (0, 2) = {t2 , t6 },\nO(1, 1) = T (1, 1) ∪ T (1, 0) = {s, st4 },\nO(1, 2) = T (1, 2) = {st2 , st6 },\nO(1, 3) = T (1, 3) ∪ T (0, 3) = {t, st, t3 , st3 , t5 , st5 , t7 , st7 }.\n\nHaving established a sufficiently detailed description of the automorphism classes\nfor our purposes, we now turn to the characteristic subgroups. We let Char(G) denote\nthe lattice of characteristic subgroups of G.\nDefinition 3.7. Given a tuple a ∈ Λ(G), we define the subgroup R(a) = ∪ T (b)\nb≤a\n\nand call R(a) the regular subgroup below a.\nRemark. We use the term \"regular\", following Baer ([1]). But this concept of regular\nshould not be confused with the notion of a regular permutation group, nor of a\nregular p-group.\nTheorem 3.8. R(a) is a characteristic subgroup if and only if a is canonical.\nThe following is easily verified by direct calculation:\nTheorem 3.9. For any a, b ∈ Λ(G),\n(i) R(a) ∩ R(b) = R(a ∧ b)\n(ii) hR(a), R(b)i = R(a ∨ b)\n7\n\n\f(iii) |R(a)| = p\n\nPn\n\ni=1\n\nai\n\nFrom (i) and (ii), it follows that the regular characteristic subgroups form a sublattice of Char(G). Using Theorem 3.8, this then implies that if a and b are canonical\ntuples then so are a ∧ b and a ∨ b. (This is also not difficult to verify directly.) Thus\nthe canonical tuples form a sublattice of Λ(G); this sublattice will be denoted by\nC(G).\nThe following theorem is of great importance to us:\nTheorem 3.10 (Miller-Baer). If p 6= 2, then every characteristic subgroup of G is\nregular.\nWe then have the following important corollaries:\nCorollary 3.11. If p 6= 2, then Char(G) ∼\n= C(G).\nCorollary 3.12 (Miller-Baer-Birkhoff). For any prime p, the number of automorphism classes of G = Zpλ1 × Zpλ2 × * * * × Zpλn is\nn\nY\n\n(λi − λi−1 + 1).\n\ni=1\n\nIf p 6= 2, then this is also the number of characteristic subgroups of G.\nProof. We apply Corollary 3.11, observing that the canonical tuples a are precisely\nthose which satisfy ai−1 ≤ ai ≤ ai−1 + λi − λi−1 for each i ∈ {1, . . . , n}. Thus there\nare λi − λi−1 + 1 choices for each coordinate ai , and the first statement follows. The\nsecond follows from the first and Theorems 3.8 and 3.10.\nWe define W(G) to be the subalgebra of elements of F G which are invariant under\nAut(G). Thus, W(G) is the maximum rational S-ring over F G; its basic sets are the\nautomorphism classes of G. We then obtain one last corollary:\nCorollary 3.13. If p 6= 2, then Char(G) is a basis for W(G).\nProof. Clearly Char(G) ⊆ W(G). By Theorem 3.5, the S-ring W(G) is spanned by\n{O(a) : a ∈ C(G)}. For any canonical tuple a ∈ C(G), we can write\nX\nO(a) = R(a) −\nO(b),\nb∈C(G)\nb<a\n\nand, since R(a) ∈ Char(G), it follows by induction that each O(a) is in the span of\nChar(G). Since dim(W(G)) = | Char(G)| by Corollary 3.12, the result follows.\nExample 3.14. Let G = Zp × Zp3 for an odd prime p. Then the characteristic\nsubgroups of G are shown in Table 1.\n\n8\n\n\fTable 1: Characteristic subgroups of G = Zp × Zp3 for odd prime p\nH6\nH1\nH2\nH3\nH4\nH5\nH6\n\nH5\n\nR(0,0)\nR(0,1)\nR(0,2)\nR(1,1)\nR(1,2)\nR(1,3)\n\nH3\n\nH4\nH2\nH1\n\nTable 2: Characteristic subgroups of G = Zp × Zp3 × Zp5 for odd prime p\nH1\nH2\nH3\nH4\nH5\nH6\nH7\nH8\nH9\nH10\nH11\nH12\nH13\nH14\nH15\nH16\nH17\nH18\n\nR(0,0,0)\nR(0,0,1)\nR(0,0,2)\nR(0,1,1)\nR(0,1,2)\nR(0,1,3)\nR(0,2,2)\nR(0,2,3)\nR(0,2,4)\nR(1,1,1)\nR(1,1,2)\nR(1,1,3)\nR(1,2,2)\nR(1,2,3)\nR(1,2,4)\nR(1,3,3)\nR(1,3,4)\nR(1,3,5)\n\nH18\nH17\nH15\n\nH16\n\nH9\n\nH14\n\nH8\n\nH12 H13\n\nH6\n\nH7\n\nH5\n\nH10\n\nH3\n\nH4\nH2\nH1\n\n9\n\nH11\n\n\fExample 3.15. Let G = Zp × Zp3 × Zp5 for an odd prime p. Then the characteristic\nsubgroups of G are shown in Table 2. Note that the sublattice of Char(G) between\nH5 = R(0, 1, 2) and H14 = R(1, 2, 3) forms a cube; i.e., this sublattice is isomorphic\nto the boolean lattice P(X) of subsets of a set X of cardinality 3.\nThe following theorem gives a generalization of preceding two examples which will\nbe important to us in §4:\nTheorem 3.16. Let X be a (finite) set containing n elements, and let\nG = Zp × Zp3 × * * * × Zp2n−1 .\nThen there is an embedding ψ of the boolean lattice P(X) into Char(G). Further, ψ\nhas the property that for all subsets Y1 , Y2 of X, |Y1 | = |Y2 | ⇐⇒ |ψ(Y1)| = |ψ(Y2 )|.\nProof. We will map P(X) onto the sublattice of Char(G) between R(0, 1, 2, . . . , n−1)\nand R(1, 2, 3, . . . , n) in the following way: Write X = {x1 , . . . , xn }; then, for Y ⊆ X\ndefine ψ(Y ) = R(a), where a = (a1 , . . . , an ) is given by\n(\ni − 1, if xi ∈\n/Y\nai =\ni,\nif xi ∈ Y\nNote that ψ is well-defined since each the tuple a, as thus defined, is always canonical,\nsince the difference between two consecutive components is either 0, 1, or 2. We have\nψ(Y1 ∩ Y2 ) = R(a(Y1 ∩ Y2 )) = R(a(Y1 ) ∧ a(Y2 ))\n= R(a(Y1 )) ∩ R(a(Y2 )) = ψ(Y1 ) ∩ ψ(Y2 )\nand\nψ(Y1 ∪ Y2 ) = R(a(Y1 ∪ Y2 )) = R(a(Y1 ) ∨ a(Y2 ))\n= hR(a(Y1 )), R(a(Y2 ))i = hψ(Y1 ), ψ(Y2)i,\nso that ψ is a lattice homomorphism. By construction ψ is injective, so ψ is an\nn(n−1)\nembedding. Theorem 3.9(iii) shows that |ψ(Y )| = p 2 +|Y | , and the last claim\nfollows.\n\n4\n\nMain Theorem\n\nWe now turn to our main result. In this section, we take all S-rings over a coefficient\nfield F of characteristic 0.\nTheorem 4.1. (Main Theorem) Let p be an odd prime. Every finite group can be\nrepresented as the automorphism group of a rational S-ring over an abelian p-group.\nThe proof relies on three key ideas:\n10\n\n\f(1) Every finite group can be represented as the automorphism group of a finite\ndistributive lattice,\n(2) Every distributive lattice can be embedded in a boolean lattice, and\n(3) The lattice of characteristic subgroups of the group Zp × Zp3 × * * * × Zp2n−1\ncontains a boolean sublattice of order 2n .\nThe proof of the Main Theorem, in outline, goes as follows: Given a group G,\nby (1) there is a distributive lattice with automorphism group isomorphic to G. By\n(2), this lattice may be embedded in a boolean lattice, which by (3) may in turn be\nembedded as a sublattice of the lattice of characteristic subgroups of an appropriate\nabelian p-group P . Finally, using Theorem 2.3, we construct the rational S-ring over\nP associated with this lattice and show that the automorphism group of this S-ring\nis isomorphic to G.\n(1) was shown by Birkhoff in [3]; a proof may also be found in [12, §7], [9], or [8]\n(see also [7]). (2) is a standard result in lattice theory (also first proven by Birkhoff);\na proof may be found in [6, Theorem 5.12], [10, 20.1], [5, 11.3], or [12, Theorem 6.6].\nWe have already shown (3) in Theorem 3.16 above. So all that remains is to verify\nthe last step of our argument. Before doing this, however, we will need to give a more\nexplicit description of the embedding of (2):\nRecall that an element j of a lattice L is join-reducible if there exist x < j and\ny < j with j = x ∨ y. Otherwise j is said to be join-irreducible.\nTheorem 4.2 (Birkhoff). Let L be a finite distributive lattice and let J ⊆ L be the\nset of join-irreducible elements. Then the map φ(x) = {j ∈ J : j ≤ x} is a embedding\nof L into P(J).\nIn what follows, we will need the following fact:\nTheorem 4.3. In Theorem 4.2, |φ(α(x))| = |φ(x)| for all α ∈ Aut(L) and x ∈ L.\nProof. Since lattice isomorphisms permute the join-irreducible elements among themselves, we have\nφ(α(x)) = {j ∈ J : j ≤ α(x)} = {α(j) ∈ J : α(j) ≤ α(x)}\n= {α(j) ∈ J : j ≤ x} = α(φ(x)),\nhence |φ(α(x))| = |α(φ(x))| = |φ(x)|.\nNow we are able to prove the Main Theorem. Given a finite group G, by (1)\nthere is a finite distributive lattice D with Aut(D) ∼\n= G. By Theorem 4.2, there is an\nembedding φ of D into the boolean lattice P(J), where J is the set of join-irreducible\nelements of D. In turn, by Theorem 3.16, there is an embedding ψ of P(J) into the\nlattice of characteristic subgroups Char(P ) of an appropriate abelian p-group P . Let\nL = ψ(φ(D)) ∪ {1} ∪ {P }. Then by Theorem 2.3, F L is an S-ring over P . To prove\nthe theorem, we will show that Aut(F L) ∼\n= G.\n11\n\n\fSince every automorphism of L fixes 1 and P and hence restricts to an automorphism of ψ(φ(D)), it follows that Aut(ψ(φ(D))) ∼\n= Aut(L). So since D ∼\n= ψ(φ(D)),\n∼\n∼\n∼\nwe then have G = Aut(D) = Aut(ψ(φ(D))) = Aut(L). So it suffices to show\nAut(L) ∼\n= Aut(F L).\nWe define a map χ : Aut(L) → Aut(F L) by χ(β) : H 7→ β(H) for H ∈ L. We\nneed to justify that χ is well-defined, i.e., that χ(β) actually is an S-ring automorphism\nof L. After that, it will be clear that χ is an injective homomorphism. Proving the\nsurjectivity of χ will then complete the proof.\nLet β ∈ Aut(L). Since Corollary 3.13 implies that L is linearly independent and\nhence forms a basis for F L, it is clear that f = χ(β) is a well-defined bijective linear\nmap from F L to itself. To show that f is an S-ring automorphism, we just need to\nshow that it preserves the Hadamard and ordinary products. Applying Theorem 2.3,\nwe have\nf (H ◦ K) = f (H ∩ K) = β(H ∩ K) = β(H) ∩ β(K)\n= β(H) ◦ β(K) = f (H) ◦ f (K),\nso f preserves the Hadamard product. Before we can show f preserves the ordinary\nproduct, we first need the result that for all H ∈ L, |β(H)| = |H|. For H = 1 or\nH = P this is trivially true since in these cases β(H) = H. For any other H, we\nmay write H = ψ(φ(x)) for some x ∈ D. Now, letting α ∈ Aut(D) be the composite\nfunction α = φ−1 ψ −1 βψφ, we see that showing |β(H)| = |H| is equivalent to showing\n|ψ(φ(α(x)))| = |ψ(φ(x))|, which by Theorem 3.16 is equivalent to showing |φ(α(x))| =\n|φ(x)|, which in turn holds by Theorem 4.3. So we have proven |β(H)| = |H|. In\nparticular, if H, K ∈ L, we have\n|H ∩ K| = |β(H ∩ K)| = |β(H) ∩ β(K)|,\nand from this, by applying Theorem 2.3, we obtain\nf (H K) = f (|H ∩ K|HK) = |H ∩ K|f (HK)\n= |H ∩ K|β(HK) = |H ∩ K|β(H)β(K)\n= |β(H) ∩ β(K)|β(H)β(K) = β(H) β(K) = f (H)f (K),\nso f preserves the ordinary product, which proves f ∈ Aut(F L).\nNow we only need to show that χ is surjective. Suppose γ is any S-ring automorphism of F L. For any H ∈ L, we have γ(H) = K for some subgroup K ≤ G by\nTheorem 1.5(ii). Since F L is a rational S-ring, K is necessarily characteristic. By\nthe linear independence of characteristic subgroups (Corollary 3.13), we must have\nK ∈ L. Thus γ permutes the basis elements {H : H ∈ L} of F L. We can then define\na bijection β : L → L by setting β(H) = K where K is the subgroup of G such that\nγ(H) = K, so that β(H) = γ(H) for all H ∈ L. Once we show that β is a lattice\nautomorphism of L, we will have γ = χ(β), which will complete the proof.\nTheorem 2.3 implies\nβ(H ∩ K) = γ(H ∩ K) = γ(H ◦ K)\n= γ(H) ◦ γ(K) = β(H) ◦ β(K) = β(H) ∩ β(K)\n12\n\n\fso that β(H ∩ K) = β(H) ∩ β(K). Observe that |β(H)| = |H| by Theorem 1.5(i),\nhence\n|H ∩ K| = |β(H ∩ K)| = |β(H) ∩ β(K)|,\nso a further application of Theorem 2.3 implies\n\u0012\n\u0013\n1\n1\nβ(HK) = γ(HK) = γ\nH K =\nγ(H)γ(K)\n|H ∩ K|\n|H ∩ K|\n1\n1\nβ(H) β(K) =\nβ(H) β(K) = β(H)β(K)\n=\n|H ∩ K|\n|β(H) ∩ β(K)|\nso that β(HK) = β(H)β(K). This proves that β is a lattice automorphism of L, as\ndesired.\n\n5\n\nAutomorphisms of S-rings over cyclic groups\n\nIn this section, we again take all S-rings over a coefficient field F of characteristic\nzero.\nIn [14], Leung and Man give a recursive classification of all S-rings over cyclic\ngroups. We give a brief description of this classification. They give three basic\nmethods of constructing S-rings over a group G:\n(I) Given a subgroup Ω ≤ Aut(G), let T1 , . . . , Tn be the orbits of Ω acting on G.\nThen T1 , . . . , Tn form a Schur partition of G.\n(II) Suppose G = H × K for nontrivial subgroups H, K ≤ G, and suppose SH is\nan S-ring over H with basic sets C1 , . . . , Ch and SK is an S-ring over K with\nbasic sets D1 , . . . , Dk . Then the product sets Ci Dj , 1 ≤ i ≤ h, 1 ≤ j ≤ k, form\na Schur partition of G.\n(III) Suppose H and K are nontrivial, proper subgroups of G with H ≤ K and\nH E G, and let SK be an S-ring over K with basic sets C1 , . . . , Ck and SG/H\nbe an S-ring over G/H with basic sets D1 , . . . , Dk , and suppose that π(SK ) =\nF (K/H) ∩ SG/H , where π : G → G/H is the natural projection map, extended\nto a natural projection map of the group algebra F G onto F (G/H). Then\nG = C1 ∪ * * * ∪ Ck ∪ {π −1 (Di ) : i ∈ {1, . . . , k}, Di * K/H}\nforms a Schur partition of G.\nIn the case of cyclic groups, the S-ring constructed in (I) is called a cyclotomic\nS-ring (a more general definition of cyclotomic S-rings, together with some of their\napplications, is found in [17]). The S-ring constructed in (II) is denoted SH * SK and\nis called the dot product (also denoted SH ⊗ SK and called the tensor product) of SH\nand SK . The S-ring constructed in (III) is denoted SK ∧ SG/H and is called the wedge\nproduct (or generalized wreath product) of SK and SG/H .\nThe main theorem of Leung and Man ([14, Theorem 3.7]) may then be stated as\nfollows:\n13\n\n\fTheorem 5.1. Every nontrivial S-ring over a cyclic group G is either cyclotomic, a\ndot product, or a wedge product.\nNote that the constructions (I), (II), and (III) can be used to produce S-rings\nover an arbitrary group G, but if G is not cyclic then it is not necessarily true that\nall S-rings can be constructed using these methods. For instance, over elementary\nabelian p-groups we have the following (for proofs, see [12, Theorem 8.4, Example\n8.5]):\nTheorem 5.2. Let p be a prime with p ≥ 5. Then there are S-rings over Zp × Zp\nwhich cannot be constructed as in (I), (II), or (III).\nTheorem 5.3. There are S-rings over Z3 × Z3 × Z3 × Z3 which cannot be constructed\nas in (I), (II), or (III).\nIn contrast, all S-rings over Z3 × Z3 and Z3 × Z3 × Z3 can be constructed as in (I).\nIn [12, Question 8.6], the question was asked of whether all S-rings over an elementary\nabelian 2-group can be constructed as in (I). We can now give a negative answer to\nthis:\nTheorem 5.4. There are S-rings over Z26 which cannot be constructed as in (I), (II),\nor (III).\nProof. Consider G = Z26 as the additive group of the finite field F64 . Since x6 + x4 +\n×\nx3 + x + 1 is primitive over F2 , F64\nhas a generator ω with ω 6 + ω 4 + ω 3 + ω + 1 = 0.\n×\nThe action of multiplication by hω 9i partitions F64\ninto 9 orbits (each of size 7),\nCi = {ω i+9j : j ∈ {0..6}},\n\ni = 0, . . . , 8.\n\nWe have found using MAGMA [4] that\n{0}, C0 ∪ C1 ∪ C2 ∪ C3 ∪ C4 , C5 ∪ C6 ∪ C7 ∪ C8\nforms a Schur partition of G whose corresponding S-ring S cannot be constructed as\nin (I), (II), or (III) (For (II) and (III), this is fairly obvious: since basic sets have\nsize 35, 28, and 1, it is clear that S has no nontrivial proper S-subgroup, i.e., S is a\nprimitive S-ring.)\nRemark. An exhaustive enumeration using MAGMA shows that all S-rings over Z2n\nfor n ≤ 4 can be constructed as in (I). The question in the case n = 5 remains\nopen; this remaining case would probably still be feasible to answer by exhaustive\nenumeration, if one reduced the computation by taking advantage of the symmetry\nof the group.\nWe now turn to the main result of this section:\nTheorem 5.5. If S is an S-ring over a cyclic group Zn , then Aut(S) is abelian.\n\n14\n\n\fBefore proving this, we need a few elementary lemmas, proofs of which may be\nfound in [12, Lemmas 8.8, 8.9, 8.10]. A version of Lemma 5.6 can be found in [23,\nTheorem 23.9], while more general versions of Lemmas 5.7 and 5.8 can be found in\n[19, Propositions 3.1, 3.4].\nLemma 5.6 (Wielandt). Suppose S is an S-ring over an abelian group G and m is\n(m)\n∈ S. Moreover, if C is a\nan integer relatively prime to |G|. If C ∈ S, then also C\n(m)\nis also a basic element of S.\nbasic element of S then C\nLemma 5.7. Suppose S is an S-ring over an abelian group G and φ ∈ Aut(S). Then\nfor any simple quantity C ∈ S and any integer m relatively prime to |G|, we have\nφ(C (m) ) = φ(C)(m) .\nLemma 5.8. Suppose S is a cyclotomic S-ring over Zn . Let φ be an automorphism\nof S. Then for any basic set T of S, there is an integer m relatively prime to n such\nthat φ(T ) = T (m) .\nRemark. Lemma 5.6 says that over an abelian group, every Cayley isomorphism is\nactually an automorphism of the S-ring. Lemma 5.7 says that the Cayley automorphisms are in the center of the automorphism group of the S-ring. Finally, Lemma 5.8\nsays that for a cyclotomic S-ring over a cyclic group, every S-ring automorphism \"locally\" behaves like a Cayley automorphism. (In Lemma 5.8, the assumption that the\nS-ring be cyclotomic is actually unnecessary. However, the generalization omitting\nthis hypothesis is a much deeper result which we will not need to use directly; it may\nbe found in [19, Theorem 1.1'], where it plays a key role in the proof of Muzychuk's\nresult cited in Theorem 6.1.)\nProof of Theorem 5.5. If S is a trivial S-ring, then Aut(S) is also trivial, hence\nabelian, and we are done. So first consider the case that S is cyclotomic. Each\nbasic set of S then consists of elements of the same order. Let Td be the collection\nof basic sets of S containing elements of order d. We can consider Aut(S) as a permutation group acting on the basic sets of S, and by Lemma 5.8, for each d, Aut(S)\npermutes the basic sets of Td among themselves. If we let Ad denote the restriction\nof Aut(S) to Td , then Aut(S) is a subdirect product of all the Ad 's, so it suffices to\nshow that each Ad is abelian. Fix a divisor d of n, and let T be a basic set in Td .\nFor any k relatively prime to n, T (k) is another basic set of Td by Lemma 5.6, and\nevery basic set of Td has this form, for if T ′ is any basic set in Td , there is an integer\nl relatively prime to n such that T (l) ∩ T ′ 6= ∅, hence T (l) = T ′ . Now, by Lemma 5.8,\nφ(T ) = T (m) for some m relatively prime to n. It follows by Lemma 5.7 that for any\nbasic set T (k) ∈ Td ,\nφ(T (k) ) = φ(T )(k) = (T (m) )(k) = (T (k) )(m) .\nThus φ(T ′ ) = (T ′ )(m) for any basic set T ′ ∈ Td . From this it is evident that Ad is\nabelian.\nNow suppose S is a dot product SH *SK . By induction we may assume Aut(SH ) and\nAut(SK ) are abelian. Let φ be an element of Aut(S). Since H is the unique subgroup\n15\n\n\fof order |H| in G, Theorem 1.5(i,ii) implies φ(H) = H, and similarly φ(K) = K. So\nφ(SH ) is an S-ring over H which is isomorphic to SH . By the result of Muzychuk\ncited in Theorem 6.1, the only such S-ring is SH itself, so we must have φ(SH ) = SH\nand likewise φ(SK ) = SK . So φ|SH ∈ Aut(SH ) and φ|SK ∈ Aut(SK ). Given another\nautomorphism ψ ∈ Aut(S), and any basic set CD of S, where C is a basic set of SH\nand D is a basic set of SK , we have φ(ψ(C)) = ψ(φ(C)) and φ(ψ(D)) = ψ(φ(D))\nsince Aut(SH ) and Aut(SK ) are abelian, hence\nφ(ψ(CD)) = φ(ψ(C D)) = φ(ψ(C)ψ(D)) = φ(ψ(C))φ(ψ(D))\n= ψ(φ(C))ψ(φ(D)) = ψ(φ(C)φ(D)) = ψ(φ(C D)) = ψ(φ(CD))\nwhich proves that φ and ψ commute, so Aut(S) is abelian.\nFinally suppose S is a wedge product SK ∧SG/H . As above, given an automorphism\nφ ∈ Aut(S), we have φ|SK ∈ Aut(SK ). Now define F -linear maps π : F G → F (G/H)\nand π ′ : F (G/H) → F G by\nπ : g 7→ gH\nπ ′ : gH 7→ gH.\nThe following relations are easily checked:\nπ(π ′ (x)) = |H|x\nπ(xy) = π(x)π(y)\n1 ′\nπ (x)π ′ (y)\nπ ′ (xy) =\n|H|\nConsider the linear map φ∗ : SG/H → SG/H given by the composite function φ∗ =\n1\nπφπ ′ . We need to justify that this is well-defined. Note that if B is a basic set of\n|H|\nSG/H then π ′ (B) = C where C is a basic set of SG and C is a union of cosets of H,\nso that C H = |H|C. Applying φ to boths sides gives φ(C)H = |H|φ(C), so that the\nbasic set D = φ(C) of SG is also union of cosets of H. Then π(D) = |H|E for a basic\nset E of SG/H . Putting this together, we have\nφ∗ (B) =\n\n1\n1\n1\nπ(φ(π ′(B))) =\nπ(φ(C)) =\nπ(D) = E,\n|H|\n|H|\n|H|\n\nso that φ∗ is well-defined and maps basic quantities to basic quantities. Now, we have\n\u0012\n\u0013\n1 ′ −1\n1 ′ −1 ′\n1 ′ −1\n1 ′\nπ φ π φ∗ =\nπ φ ππ φπ =\nπ φ φπ =\nπ π = 1F G ,\n2\n|H|\n|H|\n|H|\n|H|\nso φ∗ is a bijection. Finally,\n1\n1\n(πφπ ′ )(xy) =\nπ(φ(π ′(x)π ′ (y)))\n|H|\n|H|2\n1\nπ(φ(π ′ (x)))π(φ(π ′ (y))) = φ∗ (x)φ∗ (y)\n=\n2\n|H|\n\nφ∗ (xy) =\n\n16\n\n\fso φ∗ is an S-ring automorphism of SG/H .\nBy induction we may assume Aut(SK ) and Aut(SG/H ) are abelian. Then, given\nanother automorphism ψ ∈ Aut(S) and a basic set C of S, to complete the proof, it\nsuffices to show φ(ψ(C)) = ψ(φ(C)). We have two cases: If C ⊆ K, then\nφ(ψ(C)) = φ|SK (ψ|SK (C)) = ψ|SK (φ|SK (C)) = ψ(φ(C))\nand we are done. Suppose instead that C * K. Then C is a union of cosets of H,\nhence π ′ (π(C)) = |H|C. As above, φ(C) is also a union of cosets of H. Similarly, so\nare ψ(C), φ(ψ(C)), and ψ(φ(C)). It follows that\n(π ′ πφ)(C) = π ′ (π(φ(C))) = |H|φ(C) = |H|φ(C)\nand likewise\n(π ′ πψ)(C) = |H|ψ(C)\n(π ′ πφψ)(C) = |H|(φψ)(C)\n(π ′ πψφ)(C) = |H|(ψφ)(C)\nFrom all of this it follows that\n(φψ)(C) =\n=\n=\n=\n=\n\n1\n1\n(π ′ πφψ)(C) =\n(π ′ πφπ ′ πψ)(C)\n|H|\n|H|2\n1\n(π ′ πφπ ′πψπ ′ π)(C)\n|H|3\n1\n1\n(π ′ φ∗ ψ ∗ π)(C) =\n(π ′ ψ ∗ φ∗ π)(C)\n|H|\n|H|\n1\n(π ′ πψπ ′ πφπ ′ π)(C)\n|H|3\n1\n1\n(π ′ πψπ ′ πφ)(C) =\n(π ′ πψφ)(C) = (ψφ)(C),\n2\n|H|\n|H|\n\nso that φ and ψ commute, as desired.\nWe observe that Theorem 5.5 is false if the coefficient field F , or more generally\nthe coefficient ring R, has nonzero characteristic:\nExample 5.9. Let R have characteristic n > 0. Set G = Z4n = hti and H = Zn ≤ G.\nDefine SH to be the S-ring S = SH ∧ SG/H where SH is the trivial S-ring over H and\nSG/H is the full group algebra R(G/H). Then S has five basic sets\n{1}, Zn − {1}, T1 , T2 , T3\nwhere Ti = ti Zn . Then in RG we have T i T j = nti+j Z n = 0 for all i, j ∈ {1, 2, 3}\nwhile (Z n − 1)T i = −T i . Thus Aut(S) ∼\n= Sym3 is non-abelian. Over a ring with\ncharacteristic zero, this same Schur partition gives an S-ring with automorphism\ngroup isomorphic to Z2 .\n17\n\n\fWe observe that the Leung-Man classification of S-rings over cyclic groups does\nnot hold if the coefficient field has nonzero characteristic (see, e.g., [12, Example\n1.11]), but Example 5.9 shows that this is not the only reason that Theorem 5.5 fails\nin this case. This suggests two problems, both of which we can expect to be difficult:\nProblem 5.10. Classify the S-rings over cyclic groups for coefficient rings of nonzero\ncharacteristic.\nProblem 5.11. Describe the automorphism groups of such S-rings.\n\n6\n\nConverse to Muzychuk's Theorem\n\nA remarkable theorem of Muzychuk states:\nTheorem 6.1 ([19]). Two S-rings over a cyclic group Zn are isomorphic if and only\nif they are identical.\nWe prove a converse to this result. But first we need the following lemma:\nLemma 6.2. Let G be a finite group which is not cyclic. Then G has a subgroup\nwhich is not characteristic.\nProof. By way of contradiction, suppose every subgroup of G is characteristic. Then\nin particular every subgroup of G is normal. If G is non-abelian, then G is a Hamiltonian group (i.e., a nonabelian group in which every subgroup is normal) and we may\nwrite G = Q × A where Q is an 8-element quaternion group hi, ji and A is abelian\n[21, 9.7.4]. But in this case hii is a subgroup of G which is not characteristic, since\nthere is an automorphism of Q mapping hii to hji and this automorphism extends to\nan automorphism of G. Therefore G must be abelian.\nSince G is not cyclic, some Sylow p-subgroup of G is not cyclic and, by the\nFundamental Theorem of finitely-generated abelian groups, we may write G = hti ×\nhsi × A where |t| = pa and |s| = pb for some a and b where 1 ≤ a ≤ b. Then hsi is not\ncharacteristic, since an automorphism φ is determined by setting φ(s) = ts, φ(t) = t,\nand φ(a) = a for all a ∈ A.\nWe remark that, by a similar method of proof, Lemma 6.2 may be extended\nto infinite non-abelian groups and to finitely generated abelian groups. However,\nthere are non-cyclic infinitely generated abelian groups\nin which every subgroup is\nP\ncharacteristic, an example being the direct sum\nZp .\np prime\n\nTheorem 6.3. Let G be a finite group which is not cyclic. Then there exist distinct\nCayley-isomorphic S-rings S1 and S2 over G.\nProof. By Lemma 6.2, let H be a subgroup of G which is not characteristic. Choose\nsome φ ∈ Aut(G) such that φ(H) 6= H. Then S1 = F {1, H, G} and S2 = F {1, φ(H), G}\nare S-rings over G which are Cayley-isomorphic. We only need to verify that they are\ndistinct. The basic quantities of S1 are {1, H − 1, G − H} while the basic quantities of\n18\n\n\fS2 are {1, φ(H)−1, G −φ(H)}. If S1 = S2 then the basic quantities of the two S-rings\nmust be the same (in some order), so either H − 1 = φ(H) − 1 or H − 1 = G − φ(H).\nThe former is impossible since H 6= φ(H). The latter would imply G = H ∪ φ(H),\nwhich is impossible, since no group is the union of two proper subgroups.\n\n7\n\nSome examples\n\nExample 7.1. Let G = Zp × Zp3 for an odd prime p. Let H1 , . . . , H6 be the characteristic subgroups of G, in the order shown in Table 1. Using Theorem 1.1, it is\neasy to check that S = F {1, H 2 , H 3 + H 4 , H 5 , G} is a rational S-ring. We show that\nS cannot be constructed as in Theorem 2.3. Suppose S = F L for some lattice L.\nBy Corollary 3.13, the elements {H : H ∈ L} are linearly independent, hence form a\nbasis for S. So dim S = |L|. Now dim S = 5, yet, by applying Corollary 3.13 again,\nit is easy to see that 1, H2, H5 , and G are the only four subgroups of G which are\nS-sets, hence |L| ≤ 4, a contradiction.\nOver other abelian p-groups, it is easy to construct many rational S-rings similar\nto Example 7.1, where the basic quantities are sums of characteristic subgroups, chosen in such a way as to ensure closure under the Hadamard and ordinary product;\nbut, thus far, it has not been possible to extend this construction to give a complete classification of rational S-rings over abelian p-groups. Some of the difficulty is\nindicated by the following example:\nExample 7.2. Let G = Zp × Zp3 × Zp5 where p is any prime. Let H1 , . . . , H18 be the\nregular characteristic subgroups of G, as in Table 2. By direct computation, one can\nshow using Corollary 1.2 that\nS = F {1, H 5 , H 6 + H 7 − H 8 − H 11 , H 8 + 3H 11 − H 12 − H 13 , H 14 , G}\nis an S-ring over G if and only if p = 3. It is of course also possible to present S in\nterms of its basic elements:\nS = F {1, O2 +O3 +O4 +O5 , O6 +O7 +O14 , O12 +O13 , O8 +O10 +O11 , O9 +O15 +O16 +O17 +O18 },\nwhere Oi = O(a) for Hi = R(a). This S-ring does not have a basis consisting of\nsums of characteristic subgroups. This example also shows that choice of prime p can\nmake a difference in determining whether a partition of automorphism classes of G is\na Schur partition or not, and that it is not merely a question of whether p = 2. For a\nfurther discussion of this and related examples, see [12, Example 5.28] (But note that\nthe initial basis given there for S is erroneous; we have given a correct basis above).\nSuch examples lead us to a conjecture:\nConjecture 7.3. Let (λ1 , . . . , λn ) be a tuple of integers, 1 ≤ λ1 ≤ * * * ≤ λn . Then,\nas p → ∞, the set of Schur partitions of the abelian p-group\nG = Zp λ 1 × * * * × Zp λ n\n19\n\n\fis eventually constant, and for sufficiently large p, every rational S-ring over G has\na basis consisting of sums of characteristic subgroups (where, here we are abusing\nnotation slightly by thinking of the Schur partitions as partitions of C(G), rather than\nof G itself ).\nOne natural approach to classifying rational S-rings over abelian p-groups would\ninvolve (1) answering this conjecture, (2) giving an explicit description of which sums\nof characteristic subroups are allowed, and (3) attempting to understand the apparently \"exceptional\" rational S-rings which occur when p is small relative to n.\n\nReferences\n[1] Reinhold Baer. Types of elements and characteristic subgroups of abelian groups.\nProc. London Math. Soc., 39(2054):481–514, 1934.\n[2] Garrett Birkhoff. Subgroups of abelian groups. Proc. London Math. Soc., 38:385–\n401, 1935.\n[3] Garrett Birkhoff. Sobre los grupos de automorfismos. Revista de la Unión\nMatemática Argentina, 11:155–157, 1946.\n[4] Wieb Bosma, John Cannon, and Catherine Playoust. The Magma algebra system. J. Symbolic Comput., 24(3-4):235–265, 1997.\n[5] Peter Crawley and Robert P. Dilworth. Algebraic Theory of Lattices. PrenticeHall: Englewood Cliffs, New Jersey, 1973.\n[6] B. A. Davey and H. A. Priestley. Introduction to Lattices and Order, 2nd Ed.\nCambridge University Press, 2002.\n[7] S. Foldes. On automorphism groups of graphs and distributive lattices. Algebra\nUniversalis, 41:115–120, 1999.\n[8] G. Grätzer, H. Lakser, and E. T. Schmidt. On a result of Birkhoff. Periodica\nMathematica Hungarica, 30(3):183–188, 1995.\n[9] G. Grätzer, E. T. Schmidt, and D. Wang. A short proof of a theorem of Birkhoff.\nAlgebra Universalis, 37(2):253–255, 1997.\n[10] H. Hermes. Einführung in die Verbandstheorie. Springer-Verlag, 1955.\n[11] Brent Kerby and Emma Turner. Characteristic subgroups of finite abelian\ngroups, preprint. http://arxiv.org/abs/0905.1885. 2008.\n[12] Brent L. Kerby. Rational schur rings over abelian groups. Master's thesis,\nBrigham Young University. http://etd.byu.edu, 2008.\n[13] K. H. Leung and S. H. Man. On schur rings over cyclic groups. Israel J. Math.,\n106:251–267, 1998.\n20\n\n\f[14] Ka Hin Leung and Shing Hing Man. On Schur rings over cyclic groups, II.\nJournal of Algebra, 183:273–285, 1996.\n[15] G. A. Miller. Determination of all the characteristic subgroups of any abelian\ngroup. American Journal of Mathematics, 27(2):15–24, 1905.\n[16] G. A. Miller, H. F. Blichfeldt, and L. E. Dickson. Theory and Applications of\nFinite Groups. John Wiley and Sons, Inc., 1916.\n[17] Mikhail Muzychuk and Ilia Ponomarenko. Schur rings. European Journal of\nCombinatorics, 2009, doi: 10.1016/j.ejc.2008.11.006.\n[18] Mikhail E. Muzychuk. The structure of rational Schur rings over cyclic groups.\nEuropean Journal of Combinatorics, 14:479–490, 1993.\n[19] Mikhail E. Muzychuk. On the structure of basic sets of Schur rings over cyclic\ngroups. Journal of Algebra, 169:655–678, 1994.\n[20] Issai Schur. Zur Theorie der einfach transitiven Permutationsgruppen. Sitzungsber. Preuss. Akad. Wiss., Phys.-Math., pages 598–623, 1933.\n[21] W. R. Scott. Group Theory. Englewood Cliffs, New Jersey: Prentice-Hall, 1964.\n[22] H. de Vries and A. B. de Miranda. Groups with a small number of automorphisms. Mathematische Zeitschrift, 68:450–464, 1957.\n[23] Helmut Wielandt. Finite Permutation Groups. New York, Academic Press, 1964.\n\n21\n\n\f"}