{"id": "http://arxiv.org/abs/1104.2945v1", "guidislink": true, "updated": "2011-04-14T23:59:31Z", "updated_parsed": [2011, 4, 14, 23, 59, 31, 3, 104, 0], "published": "2011-04-14T23:59:31Z", "published_parsed": [2011, 4, 14, 23, 59, 31, 3, 104, 0], "title": "Strong absorption and selective thermal emission from a mid-infrared\n  metamaterial", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1104.2894%2C1104.2189%2C1104.3238%2C1104.2791%2C1104.2210%2C1104.3119%2C1104.2212%2C1104.2294%2C1104.0625%2C1104.4800%2C1104.0310%2C1104.5163%2C1104.0945%2C1104.4809%2C1104.4054%2C1104.2702%2C1104.4849%2C1104.1884%2C1104.4924%2C1104.4881%2C1104.1026%2C1104.5630%2C1104.4013%2C1104.0047%2C1104.5120%2C1104.0443%2C1104.2945%2C1104.3619%2C1104.4883%2C1104.5557%2C1104.4425%2C1104.1500%2C1104.2863%2C1104.0646%2C1104.0696%2C1104.0536%2C1104.1926%2C1104.2295%2C1104.4702%2C1104.4384%2C1104.5607%2C1104.3101%2C1104.3491%2C1104.5233%2C1104.5065%2C1104.2811%2C1104.0911%2C1104.4738%2C1104.3016%2C1104.2539%2C1104.3965%2C1104.3673%2C1104.0221%2C1104.1914%2C1104.0959%2C1104.3030%2C1104.1640%2C1104.0490%2C1104.4505%2C1104.1791%2C1104.2310%2C1104.5461%2C1104.0822%2C1104.0804%2C1104.2806%2C1104.4290%2C1104.4209%2C1104.2219%2C1104.1018%2C1104.0325%2C1104.3096%2C1104.4661%2C1104.3817%2C1104.0809%2C1104.2697%2C1104.2300%2C1104.5029%2C1104.1230%2C1104.2931%2C1104.0371%2C1104.5016%2C1104.5237%2C1104.0242%2C1104.4990%2C1104.0584%2C1104.2732%2C1104.4358%2C1104.2932%2C1104.2700%2C1104.0773%2C1104.0607%2C1104.3751%2C1104.1775%2C1104.5593%2C1104.4024%2C1104.0795%2C1104.2550%2C1104.0094%2C1104.1796%2C1104.0402%2C1104.5441&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Strong absorption and selective thermal emission from a mid-infrared\n  metamaterial"}, "summary": "We demonstrate thin-film metamaterials with resonances in the mid-infrared\nwavelength range. Our structures are numerically modeled and experimentally\ncharacterized by reflection and angularly-resolved thermal emission\nspectroscopy. We demonstrate strong and controllable absorption resonances\nacross the mid-infrared wavelength range. In addition, the polarized thermal\nemission from these samples is shown to be highly selective and largely\nindependent of emission angles from normal to 45 degrees. Experimental results\nare compared to numerical models with excellent agreement. Such structures hold\npromise for large-area, low-cost metamaterial coatings for control of gray- or\nblack-body thermal signatures, as well as for possible mid-IR sensing\napplications.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1104.2894%2C1104.2189%2C1104.3238%2C1104.2791%2C1104.2210%2C1104.3119%2C1104.2212%2C1104.2294%2C1104.0625%2C1104.4800%2C1104.0310%2C1104.5163%2C1104.0945%2C1104.4809%2C1104.4054%2C1104.2702%2C1104.4849%2C1104.1884%2C1104.4924%2C1104.4881%2C1104.1026%2C1104.5630%2C1104.4013%2C1104.0047%2C1104.5120%2C1104.0443%2C1104.2945%2C1104.3619%2C1104.4883%2C1104.5557%2C1104.4425%2C1104.1500%2C1104.2863%2C1104.0646%2C1104.0696%2C1104.0536%2C1104.1926%2C1104.2295%2C1104.4702%2C1104.4384%2C1104.5607%2C1104.3101%2C1104.3491%2C1104.5233%2C1104.5065%2C1104.2811%2C1104.0911%2C1104.4738%2C1104.3016%2C1104.2539%2C1104.3965%2C1104.3673%2C1104.0221%2C1104.1914%2C1104.0959%2C1104.3030%2C1104.1640%2C1104.0490%2C1104.4505%2C1104.1791%2C1104.2310%2C1104.5461%2C1104.0822%2C1104.0804%2C1104.2806%2C1104.4290%2C1104.4209%2C1104.2219%2C1104.1018%2C1104.0325%2C1104.3096%2C1104.4661%2C1104.3817%2C1104.0809%2C1104.2697%2C1104.2300%2C1104.5029%2C1104.1230%2C1104.2931%2C1104.0371%2C1104.5016%2C1104.5237%2C1104.0242%2C1104.4990%2C1104.0584%2C1104.2732%2C1104.4358%2C1104.2932%2C1104.2700%2C1104.0773%2C1104.0607%2C1104.3751%2C1104.1775%2C1104.5593%2C1104.4024%2C1104.0795%2C1104.2550%2C1104.0094%2C1104.1796%2C1104.0402%2C1104.5441&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We demonstrate thin-film metamaterials with resonances in the mid-infrared\nwavelength range. Our structures are numerically modeled and experimentally\ncharacterized by reflection and angularly-resolved thermal emission\nspectroscopy. We demonstrate strong and controllable absorption resonances\nacross the mid-infrared wavelength range. In addition, the polarized thermal\nemission from these samples is shown to be highly selective and largely\nindependent of emission angles from normal to 45 degrees. Experimental results\nare compared to numerical models with excellent agreement. Such structures hold\npromise for large-area, low-cost metamaterial coatings for control of gray- or\nblack-body thermal signatures, as well as for possible mid-IR sensing\napplications."}, "authors": ["J. A. Mason", "S. Smith", "D. Wasserman"], "author_detail": {"name": "D. Wasserman"}, "author": "D. Wasserman", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.3600779", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1104.2945v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1104.2945v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "The following article has been submitted to Appl. Phys. Lett. After\n  it is published, it will be found at http://apl.aip.org/. 14 pages including\n  4 figure pages", "arxiv_primary_category": {"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1104.2945v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1104.2945v1", "journal_reference": "Appl. Phys. Lett., 98 (2011) 241105", "doi": "10.1063/1.3600779", "fulltext": "Strong absorption and selective thermal emission from a midinfrared metamaterial\nJ. A. Mason, S. Smith, and D. Wasserman*\nDepartment of Physics ,University of Massachusetts Lowell, One University Avenue,\nLowell, MA, 01854, USA\n*\n\nCorresponding author: daniel_wasserman@uml.edu\n\nWe demonstrate thin-film metamaterials with resonances in the mid-infrared\nwavelength range.\n\nOur structures are numerically modeled and experimentally\n\ncharacterized by reflection and angularly-resolved thermal emission spectroscopy. We\ndemonstrate strong and controllable absorption resonances across the mid-infrared\nwavelength range. In addition, the polarized thermal emission from these samples is\nshown to be highly selective and largely independent of emission angles from normal to\n45 degrees.\n\nExperimental results are compared to numerical models with excellent\n\nagreement. Such structures hold promise for large-area, low-cost metamaterial coatings\nfor control of gray- or black-body thermal signatures, as well as for possible mid-IR\nsensing applications.\n\n\fThe emergence of the field of metamaterials has led to the development of\nartificial materials with pre-defined optical properties not obtainable in nature. The\npotential applications for metamaterials are numerous, with the most commonly cited\nbeing the development of optical cloaks [1, 2] and superlenses [3-6]. In the mid-infrared\n(mid-IR) wavelength range (2-30μm), where all room temperature biological materials\nand mechanical objects emit thermal radiation, this ability to tailor the optical properties\nof materials has potentially significant implications. In particular, the development of\nmetamaterial coatings for grey- or black-body emitters would allow for the alteration of\nthe emitters' thermal signatures, 'fooling' thermal sensors designed to detect the coated\nobjects.\n\nIn this work we demonstrate selective thermal emission from 1D metamaterial films\nwith controllable resonances in the mid-IR spectral range. The metamaterials\ndemonstrated here are easily fabricated and can be removed from their carrier substrate,\ngiving a thin-film mid-IR metamaterial wall-paper for coating thermal emitters. Our\nstructures are characterized by reflectivity and angularly-dependent emissivity\nmeasurements, and show a substantial modification of the thermal characteristics of the\nbulk materials coated.\n\nIn addition, we model our structures numerically, and good\n\nagreement with our experimental results is observed.\n\nFundamentally, the basis for selective thermal emission lies the ability to control a\nmaterial's absorbtivity, α(), which, by Kirchoff's Law, is equivalent to controlling the\nmaterial emissivity, ε() [7]. For any material, then, we can experimentally determine\nemissivity by accounting for all of the light not absorbed by the material (reflected,\n\n\fscattered, and transmitted).\n\nA material with subwavelength surface roughness and\n\ngeometry can be treated as a homogeneous material, thus removing the scattering term\n[8]. With the inclusion of an optically thick layer of metal as the material ground plane\n(preventing transmission), Kirchoff's Law reduces to the simplified α()=ε()=1-r(),\nwhere r() is the wavelength-dependent reflectivity.\nPerfect absorbers and selective emitters based on plasmonic and phononic\nmetamaterials have been demonstrated recently at IR frequencies [9-12].\n\nSimilar\n\nstructures have also been proposed and numerically and analytically characterized at THz\nand near-IR frequencies [13, 14]. Our structures are quite similar to those described in\nthe references above [9, 13], and consist of a three layer system: an optically thick layer\nof gold (Au) below a layer of spin-on-glass (SOG) into which is integrated a periodic\narray of Au strips. While earlier work utilized circular plasmonic 'pucks', giving a\npolarization insensitive optical response, our 1D stripes will result in strong absorption\nsignatures for only TM-polarized light (electric field perpendicular to the stripe direction,\nas shown in Fig. 1). Despite this, the underlying physics of the structures remains\nsimilar. The distinctive optical characteristics of our structures can be qualitatively\nunderstood as follows: for TM-polarized light, the stripes act as optical antennas,\ncoupling in incident radiation with a resonance based upon the stripe width (as well as the\nsurrounding dielectric). The incident radiation couples strongly to the magnetic moment\ncreated by the anti-parallel surface currents in the stripe and the metal ground plane. The\nconfinement of electromagnetic energy in the dielectric spacer between the stripes and\nthe ground plane results, ideally, for a dielectric spacer of the correct thickness, in 100%\nabsorption. In Ref. [9], the absorption of energy occurs in the gold layers. For our\n\n\fstructures, as we will show, absorption occurs in both the dielectric spacer and the Au\nlayers.\nA schematic of our sample structure, as well as a scanning electron micrograph of a\nrepresentative sample is shown in Fig. 1. The structures are fabricated by first patterning\nthe 50nm-thick Au stripes with periodicity Λ=4.8μm onto a sacrificial substrate. The\nSOG (Honeywell Accuglass 211) is then spun (thickness t=250nm) above the Au stripes\nand cured, and subsequently coated with the thick (200nm) Au layer. The sacrificial\nsubstrate is removed and the thin film attached to a glass slide, solid Au side down.\nSamples with stripe widths of w=1.9, 2.26, and 3.18μm were fabricated and\ncharacterized.\nSamples were first studied by reflection spectroscopy. Here, normally incident\nbroadband mid-IR light from a Bruker V70 Fourier Transform Infrared (FTIR)\nspectrometer was focused onto the surface of the patterned material through a mid-IR\nbeam splitter. Light reflected from the sample surface was filtered through a polarizer\nand collected by an external HgCdTe (MCT) detector.\n\nThe reflection signal was\n\nnormalized to the polarized reflection from a flat gold mirror and the reflectivity\nspectrum was calculated.\n\nBy Kirchoff's Law, dips in the reflection spectra, for\n\nwavelengths greater than the stripe periodicity, indicate coupling to absorption\nresonances.\nOur samples were subsequently characterized by thermal emission spectroscopy.\nHere the patterned sample was heated to 160°C using a custom-built hot-plate mounted\non a rotational stage. The emission from the sample was spatially filtered through a slit\nparallel to the axis of rotation (to minimize the angular spread of the collected light),\n\n\fcollected with a 2 in. diameter, 5 in. focal length ZnSe lens, and analyzed with the FTIR\nspectrometer. A polarizer between the collecting lens and the FTIR was used to select\nthe polarization of the emitted light. The collected spectra were compared to a calibrated\nblackbody source (Infrared Industries model 101C) at 160°C. The background thermal\nemission of the experimental set-up (without sample or heaters) was collected and\nsubtracted from each spectrum (sample and calibrated blackbody). The backgroundcorrected emission spectra from our samples are then normalized to the backgroundcorrected blackbody source.\nFor the angular dependence of the thermal emission, the sample was rotated about\nthe focal point of the collection lens, with emission spectra collected in 10° rotational\nincrements. Angularly-dependent spectra were measured for TM polarized light for\nrotations in both φ and θ (as shown in Fig. 1(a)), and background-corrected and\nnormalized to the calibrated blackbody.\nOur samples showed strong absorption resonances at wavelengths determined by\nthe device stripe width, and not stripe periodicity, indicating that the observed resonances\nare localized to individual stripes (Fig. 2(b)). For the device with 3.18μm stripe widths,\n100% absorption was achieved at a wavelength of 8 μm. In order to understand the nature\nof these absorption resonances, the optical properties of the spin-on-glass layer were\nobtained by broad-band ellipsometry measurements, shown in Fig. 2(c).\n\nThe SOG\n\nexhibits a number of absorption peaks, with the dominant peak at   9m . A weaker\nSOG absorption is also seen at   7.85m . For device geometries giving absorption\nresonances far from the 7.85μm SOG absorption line, this feature appears as a dip in the\nnormal incidence reflection spectra. However, for the w=3.18μm stripes, where the\n\n\fgeometric absorption resonance is well-aligned with the 7.85μm material absorption line,\na clear splitting is observed in the device reflection spectra giving a local increase in the\ndevice reflectivity at the material resonance, and suggesting a coupling between our\ndevice's geometric resonance and the material resonance in the SOG.\nOur structures were numerically simulated with commercial FEM software [15],\nusing the experimentally determined SOG complex index of refraction. Reflectivity plots\nfor our numerical models are shown in Fig. 2(a). The simulated data shows excellent\nagreement with our experimental results, including the reproduction of the effects of the\nmaterial absorption resonance on the reflectivity from the structures.\nThe demonstration of strong absorption in our samples should result in strongly\nselective emission at the absorption peaks upon sample heating.\n\nFig. 3 shows the\n\nbackground corrected and normalized emission spectrum from the w=3.18μm structure,\nas well as the reflectivity from the same sample, for comparison. As expected, spectral\ndips in the sample's reflection spectrum are mirrored by peaks in the selective emission\nof the sample. It is important to note that although the emissivity rises above unity at\nresonance, we do not claim that our samples will emit more power, at certain\nwavelengths, than a blackbody at equivalent temperature. Such an anomaly has been\nnoted in previous selective emission work [16], and was eventually determined to be a\nresult of localized heating of the selective emitter beyond the bulk material temperature\n[17].\n\nAs radiative emission away from the sample resonance is suppressed, the\n\nquenching of these radiative channels results in a localized heating of the thin\nmetamaterials membrane.\n\nBecause we measure sample temperature on the carrier\n\n\fsubstrate, and not the film itself, the substrate temperature is expected to underestimate\nthe actual local temperature of the metamaterial film.\nFinally, angular emission from the surface of the heated sample (w=3.18μm) was\ncollected for emission angles between 0 and 45° in both the θ and φ directions (see Fig.\n1(a)) in order to determine the angular dependence of thermal emission from our\nstructures (Fig 4). In addition, the angular dependence of the sample reflectivity was\nnumerically modeled for varying θ, and the resulting 1- r() plotted for angles θ=0-45°. A\nstrong selective emission is seen at ~8 μm, and its insensitivity to angle is in good\nagreement with both our numerical simulations and the results of ref. 9. Slight spectral\nshifts in the selective emission peak can be seen for angled emission at higher φ, an effect\nwhich has also been noted in previous work.\nIn summary, we have designed, fabricated, and characterized thin-film mid-IR\nmetamaterials with strong absorption resonances. The fabricated structures, as expected,\ndemonstrate strongly selective polarized thermal emission at the designed wavelength.\nOur experimental results show excellent agreement to numerical simulations.\n\nIn\n\naddition, we qualitatively determine the absorption/emission signals to be a result of both\ngeometrical and material resonances. The development of thicker mid-IR transparent\ndielectric spacer layers will allow for structures with geometry-based perfect absorption\nresonances. Conversely, the strong spectral modulation from weak absorption resonances\nin the dielectric spacer layer suggests the potential of similar structures for mid-IR\nsensing applications. In total, the device geometries presented show significant potential\nfor the further development of mid-IR metamaterial-based devices and thin films for\nsensing and security applications.\n\n\fThis work was supported by the National Science Foundation (Award #: 0925542\nand the UMass Lowell GK-12 Waves and Vibes program). The authors would also like\nto thank James Ginn of Sandia National Labs for mid-IR ellipsometry measurements on\nthe spin-on-glass used in this work.\n\n\fReferences.\n1. J. B. Pendry, D. Schurig, and D. R. Smith, Science 312, 1780 (2006).\n2. D. Schurig, J. J. Mock, B. J. Justice, S. A. Cummer, J. B. Pendry, A. F. Starr, and\nD. R. Smith, Science 314, 5801 (2006).\n3. V. G. Veselago, Sov. Phys. Usp. 10, 509 (1968).\n4. J. B. Pendry, Phys. Rev. Lett. 85, 3966 (2000).\n5. A. Grbic and G.V. Eleftheriades, Phys. Rev. Lett., 92, 117403 (2004\n6. N. Fang, H. Lee, C. Sun and X. Zhang, Science 308, 534 (2005).\n7. J.J. Greffet and M. Nieto-Vesperinas, J. Opt. soc. Am. A 10, 2735 (1998).\n8. S. M. Rytov, Sov. Phys. JETP 2, 466 (1955).\n9. N. Liu, M. Mesch, T Weiss, M. Hentschel, and H. Giessen, Nano Lett., 10, 2342\n(2010).\n10. S. O. C. Giraud and D. G. Hasko, Microelectron. Eng. 41/42, 579 (1998).\n11. J.-J. Greffet, R. Carminati, K. Joulain, J.-P. Mulet, S. Mainguy, and Y. Chen,\nNature (London) 416, 61–64 (2002).\n12. J. A. Mason, D. C. Adams, Z. Johnson, S. Smith, A. W. Davis, and D.\nWasserman, Opt. Express 18, 25192 (2010).\n13. M. Diem, T. Koschny, and C. M. Soukoulis, Phys. Rev. B 79, 033101 (2009).\n14. Y. Avitzour, Y. A. Urzhumov, and G. Shvets, Phys. Rev. B 79, 045131 (2009).\n15. www.comsol.com\n16. S. Y. Lin, J. G. Fleming, and J. Moreno, Appl. Phys. Lett. 83, 380 (2003).\n17. J. G. Fleming, Appl. Phys. Lett. 86, 249902 (2005).\n\n\fFigure Captions.\n\nFigure 1: (a) Schematic of the mid-IR metamaterial absorber and (b) scanning\nelectron micrograph of the sample.\n\nFigure 2:\n\n(a) Simulated and (b) experimental reflectivity from metamaterial\n\nabsorbers for stripe widths of 1.9 μm (blue), 2.26 μm (green) and 3.18 μm (red). (c)\nExperimentally determined real (black) and imaginary (orange) components of the\nspin-on-glass refractive index.\n\nFigure 3:\n\nReflectivity (blue) and emissivity (red) of metamaterial absorber\n\nstructures with stripe widths of 3.18 μm. Emission data was taken at 160°C and\nnormalized to a calibrated blackbody source at the same temperature.\n\nFigure 4: Angular dependence of thermal emission from 3.18 μm stripe width\nmetamaterial sample for rotations in (a) θ (experimental), (b) φ (experimental) and\n(c) θ (numerical). (d) Schematic of experimental set-ups for data collected in (a) and\n(b).\n\n\fFig. 1\n\n\fFig. 2\n\n\fFig. 3\n\n\fFig. 4\n\n\f"}