{"id": "http://arxiv.org/abs/1010.6050v1", "guidislink": true, "updated": "2010-10-28T18:54:41Z", "updated_parsed": [2010, 10, 28, 18, 54, 41, 3, 301, 0], "published": "2010-10-28T18:54:41Z", "published_parsed": [2010, 10, 28, 18, 54, 41, 3, 301, 0], "title": "Entering New Markets-a Challenge in Times of Crisis", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1010.6256%2C1010.4874%2C1010.2644%2C1010.1608%2C1010.2354%2C1010.4231%2C1010.5832%2C1010.0904%2C1010.4060%2C1010.1225%2C1010.2089%2C1010.1399%2C1010.1857%2C1010.5038%2C1010.5447%2C1010.0146%2C1010.4638%2C1010.5613%2C1010.0199%2C1010.4737%2C1010.0489%2C1010.4929%2C1010.5214%2C1010.2654%2C1010.4046%2C1010.1084%2C1010.0942%2C1010.2051%2C1010.4223%2C1010.5249%2C1010.2896%2C1010.3122%2C1010.0157%2C1010.4699%2C1010.5469%2C1010.5754%2C1010.2629%2C1010.2904%2C1010.4487%2C1010.3004%2C1010.4600%2C1010.4062%2C1010.3174%2C1010.1145%2C1010.4396%2C1010.0495%2C1010.2734%2C1010.4254%2C1010.0264%2C1010.4717%2C1010.1367%2C1010.4877%2C1010.3361%2C1010.4222%2C1010.5763%2C1010.2528%2C1010.1968%2C1010.6088%2C1010.5872%2C1010.0619%2C1010.3989%2C1010.4529%2C1010.1022%2C1010.3340%2C1010.0533%2C1010.0543%2C1010.4336%2C1010.1009%2C1010.0116%2C1010.3478%2C1010.5974%2C1010.0422%2C1010.0179%2C1010.3358%2C1010.0509%2C1010.5834%2C1010.0729%2C1010.1380%2C1010.4306%2C1010.1618%2C1010.1904%2C1010.5683%2C1010.6234%2C1010.3699%2C1010.4031%2C1010.1433%2C1010.0173%2C1010.2432%2C1010.1943%2C1010.4777%2C1010.6050%2C1010.4174%2C1010.2034%2C1010.5491%2C1010.3194%2C1010.3246%2C1010.1784%2C1010.1533%2C1010.4088%2C1010.2210%2C1010.0802&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Entering New Markets-a Challenge in Times of Crisis"}, "summary": "After September 2008, the advanced economies severe decline caused demand for\nemerging economies' exports to drop and the crisis became truly global, much\ndeeper and broader than expected. In these times of global depression, most\ncountries and companies are affected, some more than others. The financial\ncrisis has turned out to be much deeper and broader than expected. Entering new\nmarkets has always been a hazardous entrepreneurial attempt, but also a\nrewarding one, in the case of success. The paper aims to asses the market entry\nrisk of a company trying to make a good acquisition, to buy shares of another\ncompany, activating in a foreign country. For this purpose, the case of\nElectroputere S.A., the old Romanian producer of railway equipment, has been\nchosen. The data were collected from the records of Bucharest Stock Exchange.\nAfter two years from the acquisition, one can draw a conclusion whether the\nstrategy of the investor was a good one or a waste of money.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1010.6256%2C1010.4874%2C1010.2644%2C1010.1608%2C1010.2354%2C1010.4231%2C1010.5832%2C1010.0904%2C1010.4060%2C1010.1225%2C1010.2089%2C1010.1399%2C1010.1857%2C1010.5038%2C1010.5447%2C1010.0146%2C1010.4638%2C1010.5613%2C1010.0199%2C1010.4737%2C1010.0489%2C1010.4929%2C1010.5214%2C1010.2654%2C1010.4046%2C1010.1084%2C1010.0942%2C1010.2051%2C1010.4223%2C1010.5249%2C1010.2896%2C1010.3122%2C1010.0157%2C1010.4699%2C1010.5469%2C1010.5754%2C1010.2629%2C1010.2904%2C1010.4487%2C1010.3004%2C1010.4600%2C1010.4062%2C1010.3174%2C1010.1145%2C1010.4396%2C1010.0495%2C1010.2734%2C1010.4254%2C1010.0264%2C1010.4717%2C1010.1367%2C1010.4877%2C1010.3361%2C1010.4222%2C1010.5763%2C1010.2528%2C1010.1968%2C1010.6088%2C1010.5872%2C1010.0619%2C1010.3989%2C1010.4529%2C1010.1022%2C1010.3340%2C1010.0533%2C1010.0543%2C1010.4336%2C1010.1009%2C1010.0116%2C1010.3478%2C1010.5974%2C1010.0422%2C1010.0179%2C1010.3358%2C1010.0509%2C1010.5834%2C1010.0729%2C1010.1380%2C1010.4306%2C1010.1618%2C1010.1904%2C1010.5683%2C1010.6234%2C1010.3699%2C1010.4031%2C1010.1433%2C1010.0173%2C1010.2432%2C1010.1943%2C1010.4777%2C1010.6050%2C1010.4174%2C1010.2034%2C1010.5491%2C1010.3194%2C1010.3246%2C1010.1784%2C1010.1533%2C1010.4088%2C1010.2210%2C1010.0802&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "After September 2008, the advanced economies severe decline caused demand for\nemerging economies' exports to drop and the crisis became truly global, much\ndeeper and broader than expected. In these times of global depression, most\ncountries and companies are affected, some more than others. The financial\ncrisis has turned out to be much deeper and broader than expected. Entering new\nmarkets has always been a hazardous entrepreneurial attempt, but also a\nrewarding one, in the case of success. The paper aims to asses the market entry\nrisk of a company trying to make a good acquisition, to buy shares of another\ncompany, activating in a foreign country. For this purpose, the case of\nElectroputere S.A., the old Romanian producer of railway equipment, has been\nchosen. The data were collected from the records of Bucharest Stock Exchange.\nAfter two years from the acquisition, one can draw a conclusion whether the\nstrategy of the investor was a good one or a waste of money."}, "authors": ["Anca Gheorghiu", "Anda Gheorghiu"], "author_detail": {"name": "Anda Gheorghiu"}, "author": "Anda Gheorghiu", "arxiv_comment": "10 pages, 3 tables, 5 figures", "links": [{"href": "http://arxiv.org/abs/1010.6050v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1010.6050v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "q-fin.GN", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "q-fin.GN", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1010.6050v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1010.6050v1", "journal_reference": "Proceedings of the 3rd World Congress on the Advancement of\n  Scholarly Research in Science, Economics, Law and Culture, New York, Addleton\n  Academic Publishers, S.U.A. (pag.41-53) ISBN 978-1-935494-04-1, 2009, 25-29\n  august", "doi": null, "fulltext": "Entering new markets-a challenge in times of crisis\nANCA GHEORGHU\nanca.gheorghiu@gmail.com\nANDA GHEORGHIU\nanda.gheorghiu@gmail.com\nHyperion University\n\nAbstract\nAfter September 2008, the advanced economies severe decline\ncaused demand for emerging economies' exports to drop and the crisis\nbecame truly global, much deeper and broader than expected.\nIn these times of global depression, most countries and companies\nare affected, some more than others. The financial crisis has turned out to\nbe much deeper and broader than expected.\nEntering new markets has always been a hazardous\nentrepreneurial attempt, but also a rewarding one, in the case of success.\nThe paper aims to asses the market entry risk of a company trying to\nmake a good acquisition, to buy shares of another company, activating in\na foreign country. For this purpose, the case of Electroputere S.A., the\nold Romanian producer of railway equipment, has been chosen. The data\nwere collected from the records of Bucharest Stock Exchange. After two\nyears from the acquisition, one can draw a conclusion whether the\nstrategy of the investor was a good one or a waste of money.\nKeywords: risk management, crisis, privatization, takeover\n\n\f1. Preamble\nThe financial crisis which started in 2007 and is still ongoing in 2010 has been\nconsidered the worst financial crisis since the Great Depression of the 1930s, since it\naffected drastically most countries in the world, big corporations and contributed to\ndeclines in consumer wealth and a noteworthy downward spiral in economic activity.\nAfter September 2008, the advanced economies severe decline caused demand\nfor emerging economies' exports to drop and the crisis became truly global, much\ndeeper and broader than expected.\nIn these times of global depression, most countries and companies are\naffected, some more than others. The financial crisis has turned out to be much deeper\nand broader than expected.\nBut the crises do not bring out only losers; there are opportunities for savvy\ncompanies able to involve the entire staff in supporting new market entry strategies,\nguidelines for increased efficiency, by minimizing risks and cutting costs in key areas.\nThe attempt to enter new markets has always been a risky entrepreneurial act,\nbut also a rewarding one, in the case of success. Producing profits from selling or\nproducing abroad are great achievements for firms trying to expand their market share\nin foreign countries. However, companies should think very thoroughly their market\nentry strategies, in order to avoid the negative impact of some risks like: country risk,\ncontractual risks, currency risk, environmental risks, etc.\n2. Description of a tool used to asses the prospective of success or failure for\na company trying to enter a new market\nAn useful tool to asses the prospective of success or failure for a company\ntrying to enter a new market by using an associative strategy is I, a risk indicator\ndefined1 as follows:\n1 + RIT 1 + RCET V company X\nI=NxFx\nx\nx\n1 + RIO 1 + RCEO CS company X\nwhere the factors are:\n• -the country-risk rating of the target-market (N)\n• -the degree of cultural and organizational compatibility (F)\n• -the inflation rate for the target-market ( RIT )\n• -the inflation rate for the country of origin ( RIO )\n• -the rate of economic growth for the target-country ( RCET )\n• -the rate of economic growth for the country of origin ( RCEO )\n• -the social capital of the X firm, the patrimonial entity that is used for settling\nan associative strategy (CS X firm)\n• -the economic value of the enterprise (VX firm ).\nIf the society is listed at the stock exchange , than VX firm is the market value.\nThe rating N assess the risk degree of the target-country; it can take values\nbetween 1-10 (10 for stabile countries and with a good quality of the credit and 1 for\nthe economic crisis situation and incertitude concerning payments and\ndisbursements).\n1\n\nGheorghiu Anda, Managementul riscului la patrunderea pe piata internationala, Editura Victor,\nBucuresti, 2009, pag.251\n\n\fF is a more complex factor and can have values between 0.1 (absolutely\nincompatible ) and 100 (total compatibility).\n1 + RIT\nThe ratio\nreflects the monetary risks; if RIO > RIT , it is a signal that\n1 + RIO\nthe country of origin is weaker than that of the target-market. The reasonable limits\nof the scale are 0 and 2; over this value, the inflation of the target-market is soaring,\nthe market entry risk being very high.\n1 + RCET\nreflects the risk of entering a market with a different\nThe ratio\n1 + RCEO\nrhythm of growth than that of the country from where the investment comes. The\nreasonable limits of the scale are o and 2; over this value, the inflation of the targetmarket is plummeting, the market-entry risk being too high.\nV company X\nThe ratio\n, varies between 0 şi 100.\nCS company X\nIf Vcompany X > CS company X, the company is rich in assets, which exceed the\nscriptural value of the capital (most common situation), while if Vcompany X < CS\ncompany X, the company is almost bankrupt.\nThe indicator I can take positive values (from 0 to +∞).\nFor a nuanced analysis, one can apply apply the logarithm over I and the result is\n1 + RIT 1 + RCET\nV company X\nI* = lg I= lg (N x\nx\n) + lg ( F x\n).\n1 + RIO 1 + RCEO\nCS company X\nThe first term characterizes the degree of risk of the target region/country,\nwhile the second characterizes the microeconomic risk.\nIf I* < 0 and the country risk is more than 6, the factors which characterize the\nexternal environment being in normal limits, than the company envisaged for\nassociation is either less evaluated, or almost bankrupt, vulnerable, able to be taken\nover very easily and changed radically, in terms of items produced.\nIf I* > 5, under the same circumstances, than the company envisaged for\nassociation has a very good financial situation.\nTherefore, five intervals of values for the I* indicator were settled. The\nextremes of this grid are:\nI* < 0, in this case, the optimal strategy is the direct greenfield investment\nI* > 5, in this case, the optimal strategy is the export, as it can be seen in the following\ntable:\n\n\fTable 1-The evaluation of the microeconomic environment analysed in rapport\nwith the values on the grid of I*\nThe values of\nI* =lg(I)\nI* < 0\n0 < I* < 1,6\n1,6 < I* < 2\n2 < I* < 5\n\nI* > 5\n\nThe evaluation of the microeconomic\nenvironment\nThe microeconomic environment likely to be\nentirely taken over\nThe microeconomic environment likely to be\nentirely taken over by a buy of the majority of\nstocks and joining the management team\nThe microeconomic environment likely to be\ntaken over at a equal rate to that of the partner\nThe microeconomic\nenvironment\nfavourable for economic cooperation\nThe microeconomic environment hard to be\napproached through a partnership but\nfavourable for trading operations\n\nThe optimal entry\nstrategy\nDirect greenfield\ninvestment\nAcquisition\n\nMergers, acquisitions\nLicensing,\nfranchising,\nstrategic alliances,\nmanagement contract\nExport\n\nOf course, there are many other tools used in the investment process, like\nmethods based on the experience and subjective assessment\nof the\nanalyst/team/consultant, which apply the cost-profit analysis and which have set as an\nobjective the examination of different elements for the risk calculus2.\n\n3. The case of Electroputere SA-Al Arrab\nIn order to illustrate the above described analysis tool, we have chosen the\ncase of Electroputere S.A., the old Romanian producer of railway equipment, for\nwhich we calculated the time evolution of the indicator I *, then we made predictions\nfor further 4 years, by using the extrapolation technique.\nIn this regard, by using the database provided by Financial Investment\nServices Company SSIF Intercapital SA,we have calculated daily quotations and the\nvolume of shares transacted by Electroputere SA on the Bucharest Stock Exchange.\nElectroputere Craiova was founded on September 1, 1949, producing\nequipment for the energy sector and for the rail transport sector. In 1990,\nElectroputere was divided into 7 companies and in 1994 they met in the current\nholding SC Electroputere SA. The company still produces motors, electric apparatus,\nrotating electrical machines, power transformers, railways and urban vehicles. In\n2007, the local sales were 49%, while the overseas sales were 41%. Unfortunately, in\ntime, the external market, has decreased slowly, because the management politics\nhave been not set enough on conquering new areas; for instance, the company did not\nparticipated to many foreign auctions, which could have helped it to grow.\nElectroputere Craiova was formerly owned by the state assets recovery body\n(AVAS) and in 2007 the company was privatized, after a public bid. Before the\nprivatization, the shareholders structure was the following:\n2\n\nGheorghiu Anca, Econofizicǎ investiţionalǎ, Editura Victor, București, 2007 , pag.203\n\n\fShareholder\nAVAS\nALŢI ACŢIONARI\nCLIENTI NEREZIDENŢICITIBANK NOMINEE A/C\nTotal\n\nShares\n78.009.632\n34.536.922\n\nPercentage\n62,83%\n28,38%\n\n11.621.400\n\n8,80%\n\n124.167.954\n\n100%\n\nFig. 1- The shareholders structure at Electroputere SA at Oct. 31, 2007\nSource: Depozitarul Central (www.bvb.ro)\n\nAl-Arrab Construction Company Ltd , a firm from Saudi Arabia took over on\nNovember 6, 2007, 62.82% of the equity of the company Electroputere. It was a 120\nmillion euro deal. According to AVAS, Al-Arrab Contracting Company Ltd Saudi\nArabia has made an investment program amounting to 23,084,000 euros, of which\nEUR 3,084,000 EUR 20,000,000 investment environment and investment for\ndevelopment and refurbishment.\nAl-Arrab Construction Company is a company located in Saudi Arabia which\naims at reaching the highest possible percentage of the construction\nindustry professional active in the Middle East and North Africa (MENA)\nbuilding, construction machinery, road, and power generation markets.\nAl-Arrab consider the investment as a step for entering the very important and\nstrategic market of Romania and intends to transform Electroputere into a global\nproducer of energy and transport. The group of Al-Arrab is composed of 30 firms\nvaluing 40 billion (27 billion euros). Al-Arrab had, in 2006, a turnover of 133.85\nmillion dollars (90 million euros) and a net profit of 13.65 million dollars (9.2 million\neuros).\nThe evolution of the quotation of Electroputere over the capital market, the\nindicator I and its decimal logarithm (I *) increased before the privatization. Just\nbefore the takeover, it recorded a dramatic boost, probably due to a positive\nperception of the other investors. In other words, although the company has had not\nyet being profitable, the market anticipated good future prospective.\nTherefore, it is very interesting to analyze the development of indicators I and\nI * before the takeover of Electroputere by Al-Arrab Contracting Company, namely at\nthe date of June 1, 2007 (a randomly chosen date, with no special meaning) and\nNovember 6, 2007, the date when the company has been taken over.\nWe took into account the following factors:\n\u0001 N-the rating which expresses the level of risk for the target country (Romania), in\nvalue of 7, because in 2007, Moody's rating for Romania was Baa3.\n\u0001 F-the score given for the degree of cultural/organizational compatibility, in value\nof 10 (compatible) because, although there were important cultural differences\nbetween our country and Saudi Arabia, in terms of business international\nexperience and management style, there are approaches and therefore compatible.\n\u0001 RIT -inflation rate in the target-country, Romania, 6.6% in 2007.\n\u0001 RIO -inflation rate, in Saudi Arabia, 4.1% in 2007 (Source: CIA Worldfactbooks3)\n\u0001 RCET - growth rate of the target country, Romania, 6% in 2007\n3\n\nhttps://www.cia.gov/library/publications/the-world-factbook/geos/sa.html\n\n\f\u0001\n\u0001\n\u0001\n\nRCEO - growth rate in the country of origin, Saudi Arabia, 4% in 2007 (Source:\nCIA Worldfactbooks)\nCS Electroputere , the common stock of Electroputere S.A. , amount: 12.416.795,40\nlei\nV Electroputere, the economic value of the enterprise.\n\nDate\n01.06.2007\n06.11.2007\n\nMarket capitalisation\n0,256\n1,22\n\nNumber of shares\n124.167.954\n124.167.954\n\nV Electroputere\n31.786.996 lei\n151.484.904 lei\n\nFig. 2- The economic value of Electroputere S.A. in 2007\nSource: The authors\n\nThe value of the indicator at the two dates chosen for analyze is the following:\nJune 1, 2007:\n1 + 0,066 1 + 0,06\n1 + RIT 1 + RCET V firma EPT\nI=NxFx\nx\nx\n=7 x 10 x\nx\nx\n1 + RIO 1 + RCEO CS firma EPT\n1 + 0,041 1 + 0,04\n31.786.996 lei\n= =4,382\n12.416.795 lei\nI*=lg(I) = lg 4,382 = 0,641672373\nNovember, 6 , 2007:\n1 + RIT 1 + RCET V firma EPT\n1 + 0,066 1 + 0,06 151.484.904 lei\nI=NxFx\nx\nx\n=7x10x\nx\nx\n=\n1 + RIO 1 + RCEO CS firma EPT\n1 + 0,041 1 + 0,04 12.416.795 lei\n= 20,8895\nI*=lg(I) = lg 20,8895= 1.31992804\nWe notice that on both dates, namely on June 1, 2007 and the November 6,\n2007, the value of lg (I) fluctuates within the interval [0-1,6], which convey that in\n2007, Electroputere SA was a company predisposed to be taken over. Therefore, the\nindicator confirms that the market entry strategy chosen by Al-Arrab Construction\nCompany, i.e. acquiring a majority stake in Electroputere SA, was a correct one.\n\n\fFig.3-The evolution of I and I*for Electroputere S.A.\nSource: Data from Intercapital Start www.intercapital.ro and Tradeville www.tradeville.eu; data\nprocessing was made by the authors\n\nFact is that, after the takeover, the market capitalization of Electroputere SA\ndeclined, as happened with many other companies, not only in Romania, but also\nworldwide. It was a general trend in 2007, when public perception was a negative\none and this affected the market value of the large majority of corporations, due to the\nU.S. subprime crisis, which had influenced global macroeconomic indicators.\nSubprime lending in finance means making loans that are in the riskiest category of\nconsumer loans and are typically sold in a market from prime loans. In the early\n2000's, banks credited many people with loans based on uncertain incomes; they were\npeople with doubtful creditworthiness.\nThe crisis began to affect the financial sector in February 2007, when HSBC,\none of the world's largest bank, wrote down its holdings of subprime-related MBS by\n$10.5 billion, the first major subprime related loss to be reported. The main effect of\nthe crisis was a much diminished access to cash, therefore the crisis has affected many\nbusinesses, especially investment banks, such as Lehman Brothers or brokerage\ncorporations such as Merrill Lynch.\nFor 2008 and 2009, we have calculated the indicators I and I * by taking into\naccount some changes of the input data:\na) because of the world economic downturn, Romania has been severely affected\neconomically in the past 15 months and some rating agencies have downgraded the\ncountry to \"junk\" level for investment; that is the reason for which we have\nconsidered a level of 5 for N (the country-risk rating of the target-market)\nb) the inflation level for the target-market (Romania- RIT ) has grown in 2008 and\n2009 from 6% to 10-12%\nc) we considered that the company may be interesting for acquisition by a company\nsituated in EU, therefore we have taken into account a rate of economic growth for\n\n\fthe country of origin ( RCEO ) of 1%, while for Romania, we have considered a rate of\neconomic growth for the target-country ( RCET ) of -7%.\nd) we considered F = 10 (complete cultural/organizational compatibility.\nThe outcome demonstrates that during the crisis, I and I * have both sharply\nfallen, with a negative record in the summer of 2009. No wonder, that the company\nannounced in August 2009 a plan to dismiss 500 employees, following the company's\nrestructuring plan. Then, it was a very favourable period for acquisition. Still, because\nof the acute lack of liquidities and of the country risk downgrading, no foreign\ncompany had shown any sign of interest for Electroputere. However, since the\nindicators are still low, the company remains very attractive for investors in the first\nquarter of 2010.\nThe evolution of the market value of Electroputere S.A shows also a\nsignificant drop after September 2009, with timid signs of recovery in the last months\nof 2009.\n\nFig.4- Evolution of the market value of Electroputere S.A. (EPT)\nSource: Intercapital Start www.intercapital.ro and Tradeville www.tradeville.eu; data processing was\nmade by the authors\n\n\f4. Later developments and conclusions\nThe later developments showed that, despite a good evolution in the first\nmonths of 2007, the effects of the global crisis have been felt in Romania as well and\nhave had a negative influence over the evolution of Electroputere stocks (see fig.5).\nThe most dramatic fall was in the first quarter of 2009. Afterwards, one can notice a\nrising trend of the price evolution, which will probably continue in the following\nmonths.\n\nFig.5- Price evolution of Electroputere SA stocks in 2009-2010\nSource: www.bvb.ro\n\nAl Arrab Company Ltd offered 2.3 million euros in 2008 for 62.82 % of the\nshares, but ended up by owing 86.28 percent of the company after the last share\ncapital increase (December 2008). The up-to-date number of shares of Al Arrab at\nDecember 31, 2009 is 291.284.640 (86,28%) from the total capital.\nElectroputere Craiova announced losses of 545,300 lei in the first quarter of\n2009, down 13-fold compared the same period last year. Its business advanced from\n28.3 million lei to 63.18 million lei in the mentioned period.\nAs a conclusion, assessing the risk the prospective of success or failure for a\ncompany trying to enter a new market is a must. There are many tools, models,\nalgorithms or software for risk management; among them is the indicator presented in\nthe present paper. The case of Electroputere S.A. is relevant; it shows how the analyst\nshould proceed in order to find and propose to the management team the best strategy\nfor entering a new market. Definitely, no model or method can offer a 100%\nguarantee that the project will be a success. Unpredictable events, like the subprime\ncrisis which started in 2007 and evolved as an international financial crisis, can shatter\nthe plans of a company to enlarge the global market share and heighten the profits.\nWell-capitalized companies, with robust financial positions and with\nliquidities to invest, have now a unique chance to make strategic acquisitions and to\nbuy previously unaffordable assets. Of course, it takes audacity to act in a risky\nclimate, but as more and more targets become available, taking advantage of this\n\n\foccasion will help daring companies to have success in the years of boost after the\ncrisis.\nA recent study4 conducted for Deloitte Touche Tohmatsu by Forbes Insights\nreveals that economic optimism reached its highest level in the past 12 months among\nsurveyed executives only in December 2009. The analysis discloses that in the last\nmonth of the year 2009, more than one-third of the executives surveyed (35%) believe\nthe worst of the economic crisis is behind us-the highest level of economic confidence\nsince the survey began in January 2009 (Figure 6). The data comes from a survey of\n335 senior executives and talent managers from large companies (annual sales $500+\nmillion), across a range of many industries and the three major economic regions, the\nAmericas, Asia Pacific (APAC), and Europe, the Middle East, and Africa (EMEA).\n\nFigure 6-Executive outlook on the economy (December 2009)\nSource: Deloitte Development LLC\n\nIndeed, the forecast of IMF5 suggests the same positive trend will follow the\nmajor economic indexes. The world trade volume is expected to rise in 2010 at 5.8\nper cent in 2009 compared with a dramatic -12.3 per cent in 2009. The oil prices is\npredicted to get much higher in 2010 (22.6 per cent in 2010 compared to a sharp drop\nof -36.1 in 2009). Projections are as well good for 2011.\n\nREFERENCES:\n1.Gheorghiu Anca, Econofizicǎ investiţionalǎ, Editura Victor, București,2007,pag.203\n2.Gheorghiu Anda, Managementul riscului la patrunderea pe piata internationala,\nEditura Victor, Bucuresti, 2009, pag.251\n3.Deloitte Development LLC-Managing talent in a turbulent economy – January 2010\n4.International Monetary Fund- Overview of the World Economic Outlook\nProjections, 2010\n5. CIA-The world fact book, 2008\n\n4\n\nDeloitte Development LLC-Managing talent in a turbulent economy – January 2010\nInternational Monetary Fund- Overview of the World Economic Outlook Projections, 2010,\nhttp://www.imf.org/external/pubs/ft/weo/2009/update/01/pdf/table1.pdf\n\n5\n\n\f"}