{"id": "http://arxiv.org/abs/0912.2455v1", "guidislink": true, "updated": "2009-12-12T21:58:25Z", "updated_parsed": [2009, 12, 12, 21, 58, 25, 5, 346, 0], "published": "2009-12-12T21:58:25Z", "published_parsed": [2009, 12, 12, 21, 58, 25, 5, 346, 0], "title": "Will recently proposed experiments be able to demonstrate quantum\n  behavior of entire living organisms?", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0912.3015%2C0912.3890%2C0912.1840%2C0912.2621%2C0912.4910%2C0912.1908%2C0912.1652%2C0912.2857%2C0912.3380%2C0912.0206%2C0912.2340%2C0912.0424%2C0912.3110%2C0912.0311%2C0912.3569%2C0912.0080%2C0912.4815%2C0912.2315%2C0912.5129%2C0912.0089%2C0912.0710%2C0912.0064%2C0912.2455%2C0912.4069%2C0912.2932%2C0912.4299%2C0912.3919%2C0912.2360%2C0912.3146%2C0912.0739%2C0912.0245%2C0912.4633%2C0912.4834%2C0912.0148%2C0912.3830%2C0912.5383%2C0912.4028%2C0912.5077%2C0912.3744%2C0912.4921%2C0912.4348%2C0912.0928%2C0912.0500%2C0912.0650%2C0912.5529%2C0912.0523%2C0912.2384%2C0912.0568%2C0912.1020%2C0912.5082%2C0912.4033%2C0912.5135%2C0912.4119%2C0912.2749%2C0912.3692%2C0912.4933%2C0912.1193%2C0912.0611%2C0912.2722%2C0912.2121%2C0912.1863%2C0912.2405%2C0912.4932%2C0912.2326%2C0912.2223%2C0912.3238%2C0912.5355%2C0912.1195%2C0912.1584%2C0912.2907%2C0912.2312%2C0912.2298%2C0912.2602%2C0912.4473%2C0912.0544%2C0912.0209%2C0912.4526%2C0912.1636%2C0912.1748%2C0912.0536%2C0912.4968%2C0912.3656%2C0912.3670%2C0912.2677%2C0912.0049%2C0912.4156%2C0912.2487%2C0912.3331%2C0912.5303%2C0912.2839%2C0912.4928%2C0912.3275%2C0912.4675%2C0912.0904%2C0912.2840%2C0912.1135%2C0912.4417%2C0912.2699%2C0912.4922%2C0912.4920%2C0912.3797&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Will recently proposed experiments be able to demonstrate quantum\n  behavior of entire living organisms?"}, "summary": "Recently proposed experiments consider creating and observing the quantum\nsuperposition of small living organisms. Those proposed experiments are\nexamined here for feasibility on the basis of results of earlier studies\nidentifying a boundary separating obligatory classical behavior from quantum\nbehavior. It appears that the proposed experiments may be expected to succeed\nfor the case of viruses, but most probably fail for the case of the appreciably\nlarger organisms that are also considered.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0912.3015%2C0912.3890%2C0912.1840%2C0912.2621%2C0912.4910%2C0912.1908%2C0912.1652%2C0912.2857%2C0912.3380%2C0912.0206%2C0912.2340%2C0912.0424%2C0912.3110%2C0912.0311%2C0912.3569%2C0912.0080%2C0912.4815%2C0912.2315%2C0912.5129%2C0912.0089%2C0912.0710%2C0912.0064%2C0912.2455%2C0912.4069%2C0912.2932%2C0912.4299%2C0912.3919%2C0912.2360%2C0912.3146%2C0912.0739%2C0912.0245%2C0912.4633%2C0912.4834%2C0912.0148%2C0912.3830%2C0912.5383%2C0912.4028%2C0912.5077%2C0912.3744%2C0912.4921%2C0912.4348%2C0912.0928%2C0912.0500%2C0912.0650%2C0912.5529%2C0912.0523%2C0912.2384%2C0912.0568%2C0912.1020%2C0912.5082%2C0912.4033%2C0912.5135%2C0912.4119%2C0912.2749%2C0912.3692%2C0912.4933%2C0912.1193%2C0912.0611%2C0912.2722%2C0912.2121%2C0912.1863%2C0912.2405%2C0912.4932%2C0912.2326%2C0912.2223%2C0912.3238%2C0912.5355%2C0912.1195%2C0912.1584%2C0912.2907%2C0912.2312%2C0912.2298%2C0912.2602%2C0912.4473%2C0912.0544%2C0912.0209%2C0912.4526%2C0912.1636%2C0912.1748%2C0912.0536%2C0912.4968%2C0912.3656%2C0912.3670%2C0912.2677%2C0912.0049%2C0912.4156%2C0912.2487%2C0912.3331%2C0912.5303%2C0912.2839%2C0912.4928%2C0912.3275%2C0912.4675%2C0912.0904%2C0912.2840%2C0912.1135%2C0912.4417%2C0912.2699%2C0912.4922%2C0912.4920%2C0912.3797&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Recently proposed experiments consider creating and observing the quantum\nsuperposition of small living organisms. Those proposed experiments are\nexamined here for feasibility on the basis of results of earlier studies\nidentifying a boundary separating obligatory classical behavior from quantum\nbehavior. It appears that the proposed experiments may be expected to succeed\nfor the case of viruses, but most probably fail for the case of the appreciably\nlarger organisms that are also considered."}, "authors": ["C. L. Herzenberg"], "author_detail": {"name": "C. L. Herzenberg"}, "author": "C. L. Herzenberg", "arxiv_comment": "6 pages, 0 figures", "links": [{"href": "http://arxiv.org/abs/0912.2455v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0912.2455v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.gen-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.gen-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.pop-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0912.2455v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0912.2455v1", "journal_reference": null, "doi": null, "fulltext": "Will recently proposed experiments be able to demonstrate quantum behavior of\nentire living organisms?\nC. L. Herzenberg\nAbstract\nRecently proposed experiments consider creating and observing the quantum\nsuperposition of small living organisms. Those proposed experiments are examined here\nfor feasibility on the basis of results of earlier studies identifying a boundary separating\nobligatory classical behavior from quantum behavior. It appears that the proposed\nexperiments may be expected to succeed for the case of viruses, but most probably fail\nfor the case of the appreciably larger organisms that are also considered.\n\nIntroduction\nThe existence of superposed quantum states has been demonstrated for a variety of small\nphysical objects, including electrons, atoms, ions, and molecules, and also including\nlarger molecules such as fullerene buckyballs. A recent article proposes setting up\nexperiments to attempt to create and examine quantum superposition of larger objects,\nnotably including small organisms.(1) For how large an object or organism would this be\ndemonstrable?\nA number of studies have examined aspects of the behavior of quantum objects in an\nexpanding universe of limited duration.(2-8) These studies have suggested that quantum\nobjects in an expanding universe must necessarily experience a limitation on the spatial\nextent of their quantum wave structure, and it follows from these results that sufficiently\nlarge objects must exhibit classical rather than quantum behavior.(2-8) The boundary\nbetween obligatory classical behavior based on these effects and allowed quantum\nbehavior can be expressed in terms of size and mass or in terms of the moment of inertia.\nThus, from an estimate of the magnitude of the moment of inertia of an object, it is\npossible to arrive at a conclusion as to whether a particular object would be obligatorily\nclassical due to these effects; or whether it might instead exhibit quantum behavior under\nsuitable conditions. We can use this criterion to provide guidance as to whether the\norganisms proposed for study by Romero-Isard and his colleagues might be able to\nexhibit quantum superposition as entire objects, or whether instead they would not\nexhibit superposition, and behave instead as classical objects.\n\nAnalysis and discussion\nWe address the question of whether Romero-Isart and his colleagues Juan, Quidant, and\nCirac may be expected to be able to demonstrate quantum superposition in any of their\nproposed target objects or organisms, or whether the presence of a fundamental constraint\nmight forbid quantum superposition in any of the proposed experiments.(1)\n\n1\n\n\fThese authors propose an experiment in which an attempt would be made to place a\ntarget organism such as a virus into a quantum superposition of states by conducting\nquantum optomechanical experiments. The organism would be maintained in a low\nvacuum in isolation from the environment by levitating it inside an optical cavity using\nan optical tweezers technique or by self-trapping using two cavity modes.(1) Because the\norganism is not in direct thermal contact with a substrate, it is considered possible to use\nlaser Doppler cooling to cool the organism down to the ground state of its mechanical\nmotion.(1) The organism might then be excited into a resonant quantum excited state of\nmechanical motion, and consequently might also potentially be excited into a\nsuperposition of the ground state and the excited state. Romero-Isart and colleagues\nanalyse the possibility of performing the proposed experiment with living organisms, and\nindicate that the size of some of the smallest living organisms, such as spores and viruses,\nis comparable to the laser wavelength considered for their experiment, as required.(1)\nThese organisms would have to survive the vacuum, behave optically like dielectric\nobjects, and be largely transparent to the laser light, issues that have all been addressed\nby the authors. But, beyond these and other experimental issues, are there fundamental\nissues that could interfere with such an experiment? Could this quantum superposition of\nstates take place, and could it be observed?\nPossible inherent limitations on quantum behavior for objects in an expanding universe of\nfinite duration have been studied earlier.(2-5) This work has shown that sufficiently large\nobjects in an expanding universe might be expected to behave classically, while small\nobjects would exhibit quantum behavior.(2-5) The threshold between classical and\nquantum behavior, i.e. the quantum-classical boundary, is sensitive to both the size and\nthe mass of an object, and turns out to depend directly on the magnitude of the moment of\ninertia.(6-8) The threshold moment of inertia has been estimated to be given approximately\nby the equation:(6,8)\nIth ≈ h/4πHo\n\n(1)\n\nHere, h is Planck's constant, and Ho is the Hubble constant. It should be noted that this\ncriterion can at best be expected to provide only a very rough estimate of a threshold\nseparating obligatory classical from possible quantum behavior of physical objects.\nEqn. (1) provides a very straightforward criterion for a boundary separating the smaller\nobjects potentially exhibiting quantum behavior from those larger objects that apparently\nwill necessarily exhibit classical behavior as a result of effects associated with properties\nof the universe such as its duration and expansion rate.(6,8)\nWe can evaluate this threshold numerically; we will use h = 6.63 x 10-34 joule-seconds as\nthe value for Planck's constant, and Ho = 2.3 x 10-18 sec-1 as the value for the Hubble\nconstant. Inserting these values into Eqn. (1), we can evaluate a numerical value for the\nthreshold moment of inertia in mks or SI units as:\nIth ≈ 2.3 x 10-17 kg*m2\n\n2\n\n(2)\n\n\fThis result tells us that, approximately speaking, any object with a moment of inertia\nlarger than about10-17 kg*m2 would be expected to behave in a classical manner, while\nany object with a moment of inertia smaller than about10-17 kg*m2 may exhibit quantum\nbehavior, unless brought into classical behavior by other effects such as quantum\ndecoherence.(9-11)\nLet's look at the magnitudes of the moment of inertia of some objects that have\npreviously been shown to behave quantum mechanically as entire objects and the\nmagnitudes of the moments of inertia of the small organisms under discussion, and\ncompare them with the threshold moment of inertia given in Eqn. (2).\nWe know that some small physical objects such as electrons, atoms, and small molecules\ncan behave quantum mechanically as entire objects. Small molecules have relatively\nsmall moments of inertia. As an example, the moments of inertia for a water molecule\nwith respect to different axes through the center of mass are reported in the range of\nabout 1 x 10– 47 kg*m2 to 3 x 10– 47 kg*m2.(12) These moment of inertia values are some 30\norders of magnitude smaller than the critical threshold moment of inertia evaluated above\nin Eqn. (2), and thus are well within the range of expected quantum behavior according to\nthis criterion.\nThe largest molecules for which successful quantum interference experiments have been\nreported are medium-sized molecules, the fullerenes.(13-15) For orientation purposes, the\ndiameter of a C60 fullerene buckyball is about a nanometer. Successful quantum\ninterference experiments with fullerenes (both C60 and C70 molecules) have been carried\nout.(9,13) Research groups have sent fullerene molecules with 60 or 70 carbon atoms each\nthrough the equivalent of two-slit interference equipment, dramatically displaying their\nquantum wave nature as entire objects in translational motion. Those quantum\ninterference experiments have established clearly that these intermediate size molecules\ncan behave quantum mechanically with respect to their translational motion. A value for\nthe moment of inertia of a fullerene buckyball (C60) has been referred to in the literature\nas 1.0 x 10-43 kg*m2; additional measurements have been reported for other fullerenes.(15)\nThe moment of inertia values for these medium-sized molecules that have been shown to\nexhibit superposed quantum states are roughly 26 orders of magnitude smaller than the\nquantum-classical boundary estimated above in Eqn. (2). This extensive range of\nmagnitudes for moments of inertia that are above those of the fullerenes while still well\nbelow the quantum-classical threshold value suggests that chemical structures\nconsiderably larger than fullerenes should also exhibit quantum interference effects,\naccording to this criterion.\nMacromolecules have somewhat larger moments of inertia than the fullerenes; that of the\nmedium-sized protein lysozyme is reported to be 5 x 10-41 kg*m2; while a macromolecular\nassembly, a ribosome, has a reported moment of inertia five orders of magnitude larger;\nand a tobacco mosaic virus has a reported moment of inertia seven orders of magnitude\nlarger.(16)\n\n3\n\n\fMost viruses that have been studied have diameters between about 10 and 300\nnanometers.(17) Because of the wide range in their sizes, viruses might also be expected to\nexhibit a spread of values for their moments of inertia, with values perhaps more\ntypically of the order of magnitude of 10-33 kg*m2 to 10-35 kg*m2; as noted above, the\nmoment of inertia of a tobacco mosaic virus is in this range. Moments of inertia such as\nthose estimated or measured for viruses are well within the range of values associated\nwith quantum behavior for entire objects according to the present criterion, and so viruses\nwould be expected to behave in a quantum manner unless brought into classicality by\nother effects.(6,9-11)\nRomero-Isart and colleagues consider as an initial case the possibility of working with\ncommon influenza viruses, objects of size about 100 nanometers.(1) They also consider\nworking with tobacco mosaic viruses, which have rod-like shapes with widths of about\n50 nm and lengths of almost a micron.(1) As noted above, according to the present\ncriterion, both the common influenza virus and the tobacco mosaic virus have moments\nof inertia that are far below the threshold of obligatory classical behavior. Hence, these\nviruses could be within the range of possible quantum behavior unless brought into\nclassicality by other effects.(6,9,10)\nRomero-Isart and colleagues also consider the possibility of conducting these\nexperiments with tardigrades, small segmented eight-legged animals which range in size\nfrom about 100 μm to about 1.5 mm.(1) Taking the infamous \"assume a spherical cow\"\napproach, we can estimate moment of inertia values for typical tardigrades. In the case of\ntardigrades, the moments of inertia so estimated would be close to or above the estimated\nvalue for the threshold moment of inertia. Therefore, on the basis of this criterion,\ntardigrades would be classified as most probably classically behaved as entire creatures.\nConsequently, we might expect that it would be far more difficult if not impossible to\nobserve these organisms in superposed quantum states.\n\nSummary and discussion\nTo summarize, it appears that the experiments that have been proposed to create and\nobserve quantum superposition of small living organisms may be expected to succeed in\nthe cases they have discussed involving influenza viruses and tobacco mosaic viruses, but\nthat the success of the corresponding experiment for the case of tardigrades remains\ndoubtful because of the magnitude of the size and mass or moment of inertia of these\nsmall creatures.\nWe note that quantum objects can be brought into classicality by effects other than the\nlimitations imposed by the expansion and finite lifetime of the universe that has been the\nbasis for our analysis. Notably, decoherence effects and related effects dependent on\ninteractions with the local environment can bring about classical behavior in objects that\nwould otherwise behave quantum mechanically.(9-11)\n\n4\n\n\fIt should be noted that the general criterion distinguishing classical from quantum\nbehavior that is given in Eqns. (1) and (2) was derived for and hence expected to be\napplicable to free objects, whereas these experiments involve objects trapped inside\ncavities, so while the conclusions drawn from comparison with this criterion may be valid\nand certainly are of interest, its application under these circumstances might not be fully\njustified.\nWe also note that the estimates for a critical threshold value separating classical from\nquantum behavior are fairly crude estimates, good to an order of magnitude at best, and\nthat more careful and systematic work examining the behavior of quantum wave\nfunctions in an expanding universe would be desirable in order to address potentially\nfundamental limitations on the feasibility of experiments such as these in a more\nthorough manner.\n\nREFERENCES\n1.Oriol Romero-Isart, Mathieu L. Juan, Romain Quidant, and J. Ignacio Cirac, \"Toward\nQuantum Superposition of Living Organisms,\" http://arxiv.org/abs/0909.1469\n(September 2009).\n2. C. L. Herzenberg, \"Becoming Classical: A Possible Cosmological Influence on the\nQuantum-Classical Transition,\" Physics Essays 19, 4, 1-4 (2006).\n3. C. L. Herzenberg, \"The Role of Hubble Time in the Quantum-Classical Transition,\"\nPhysics Essays 20, 1, 142-147 (2007a).\n4. C. L. Herzenberg, \"Why our human-sized world behaves classically, not quantummechanically: A popular non-technical exposition of a new idea,\"\nhttp://arxiv.org/abs/physics/0701155 (2007b).\n5. C. L. Herzenberg, \"The Quantum-Classical Transition and Wave Packet Dispersion,\"\narXiv:0706.1467 http://arxiv.org/abs/0706.1467 (2007c).\n6. C. L. Herzenberg, \"The quantum-classical boundary and the moments of inertia of\nphysical objects,\" http://arxiv.org/abs/0908.1760 (2009).\n7. C. L. Herzenberg, \"How the classical world got its localization: An elementary account\nof how the age of the universe may be implicated in the quantum-classical transition,\"\nhttp://vixra.org/abs/0909.0038 (September 2009).\n8. C. L. Herzenberg, \"Can the expansion of the universe localize quantum wave\nfunctions? How classical behavior may result from Hubble expansion,\"\nhttp://arxiv.org/abs/0912.1158 (December, 2009).\n\n5\n\n\f9. Erich Joos, \"Decoherence and the transition from quantum physics to classical\nphysics,\" in Entangled World: The Fascination of Quantum Information and\nComputation, Jürgen Audretsch (Ed.), Wile-VCH Verlag, Weinhem 2002.\n10. Erich Joos, \"Decoherence,\" http://www.decoherence.de/ (accessed 13 July 2009).\n11. Wikipedia, \"Quantum decoherence,\"\nhttp://en.wikipedia.org/wiki/Quantum_decoherence\n(accessed 13 September 2009).\n12. Martin Chaplin, \"Water Structure and Science,\"\nhttp://www.lsbu.ac.uk/water/data.html ,\n(accessed 30 July 2009).\n13. Markus Arndt and Klaus Hornberger, \"Quantum interferometry with complex\nmolecules,\" http://arxiv.org/pdf/0903.1614v1 (9 March 2009), (accessed 19 July 2009).\n14. M. Krause, M. Hulman, H. Kuzmany, O. Dubay, G. Kresse, K.Vietze, G. Seifert,\nC.Wang, and H. Shinohara, \"Fullerene Quantum Gyroscope,\" Physical Review Letters\n93, 13, 1-4. 24 September 2004.\n15. Emil Roduner, , Kosmas Prassides, , Roderick M. Macrae, Ian M. Thomas, Christof\nNiedermayer, Ulrich Binninger, Christian Bernhard, Anselm Hofer and Ivan D. Reid,\n\"Reorientational dynamics of C60 in the solid state. An avoided level-crossing muon spin\nresonance study\", Chemical Physics, Volume 192, Issue 3, 15 March 1995, Pages 231237.\n16. D. Starodub, R.B. Doak, K. Schmidt, U. Weierstall, J. S. Wu, J. C. Spence, M.\nHowells, M. Marcus, D. Shapiro, A. Barty, and H. N. Chapman, \"Damped and thermal\nmotion of laser-aligned hydrated macromolecule beams for diffraction,\" Journal of\nChemical Physics 123, No. 24, 244304, December 2005.\n17. Wikipedia, \"Virus,\" http://en.wikipedia.org/wiki/Virus (accessed 3 October 2009).\n\n6\n\n\fquantumlivingsizeeffects.doc\n12 December 2009 draft\n\n7\n\n\f"}