{"id": "http://arxiv.org/abs/1006.4023v1", "guidislink": true, "updated": "2010-06-21T10:22:27Z", "updated_parsed": [2010, 6, 21, 10, 22, 27, 0, 172, 0], "published": "2010-06-21T10:22:27Z", "published_parsed": [2010, 6, 21, 10, 22, 27, 0, 172, 0], "title": "Activity statistics, avalanche kinetics, and velocity correlations in\n  surface growth", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1006.1772%2C1006.4750%2C1006.3832%2C1006.4068%2C1006.5212%2C1006.0689%2C1006.0871%2C1006.2761%2C1006.2448%2C1006.5847%2C1006.3845%2C1006.5537%2C1006.4181%2C1006.1483%2C1006.1544%2C1006.2159%2C1006.0678%2C1006.0828%2C1006.2045%2C1006.0894%2C1006.4562%2C1006.0101%2C1006.1998%2C1006.4023%2C1006.0062%2C1006.2840%2C1006.3666%2C1006.0854%2C1006.5823%2C1006.0501%2C1006.0954%2C1006.5415%2C1006.4699%2C1006.5677%2C1006.5907%2C1006.2192%2C1006.5441%2C1006.4166%2C1006.5928%2C1006.1391%2C1006.2170%2C1006.1491%2C1006.3179%2C1006.5574%2C1006.2476%2C1006.4323%2C1006.2209%2C1006.3302%2C1006.3111%2C1006.4155%2C1006.3391%2C1006.0608%2C1006.2701%2C1006.3350%2C1006.5640%2C1006.2815%2C1006.4988%2C1006.5959%2C1006.3517%2C1006.3075%2C1006.3753%2C1006.4886%2C1006.2509%2C1006.0783%2C1006.0469%2C1006.2342%2C1006.4082%2C1006.5435%2C1006.3066%2C1006.2478%2C1006.0709%2C1006.5491%2C1006.4837%2C1006.5406%2C1006.2837%2C1006.2811%2C1006.0220%2C1006.2055%2C1006.4748%2C1006.4413%2C1006.4385%2C1006.2156%2C1006.5164%2C1006.0708%2C1006.4157%2C1006.3941%2C1006.1000%2C1006.4915%2C1006.1322%2C1006.0577%2C1006.0975%2C1006.0696%2C1006.0371%2C1006.4599%2C1006.0013%2C1006.3889%2C1006.0324%2C1006.4045%2C1006.3515%2C1006.2318%2C1006.4465&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Activity statistics, avalanche kinetics, and velocity correlations in\n  surface growth"}, "summary": "We investigate the complex spatio-temporal dynamics in avalanche driven\nsurface growth by means of scaling theory. We study local activity statistics,\navalanche kinetics, and temporal correlations in the global interface velocity,\nobtaining different scaling relationships among the involved critical exponents\ndepending on how far from or close to a critical point the system is. Our\nscaling arguments are very general and connect local and global magnitudes\nthrough several scaling relationships. We expect our results to be applicable\nin a wide range of systems exhibiting interface kinetic roughening driven by\navalanches of local activity, either critical or not. As an example we apply\nthe scaling theory to analyze avalanches and roughening of forced-flow\nimbibition fronts in excellent agreement with phase-field numerical\nsimulations.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1006.1772%2C1006.4750%2C1006.3832%2C1006.4068%2C1006.5212%2C1006.0689%2C1006.0871%2C1006.2761%2C1006.2448%2C1006.5847%2C1006.3845%2C1006.5537%2C1006.4181%2C1006.1483%2C1006.1544%2C1006.2159%2C1006.0678%2C1006.0828%2C1006.2045%2C1006.0894%2C1006.4562%2C1006.0101%2C1006.1998%2C1006.4023%2C1006.0062%2C1006.2840%2C1006.3666%2C1006.0854%2C1006.5823%2C1006.0501%2C1006.0954%2C1006.5415%2C1006.4699%2C1006.5677%2C1006.5907%2C1006.2192%2C1006.5441%2C1006.4166%2C1006.5928%2C1006.1391%2C1006.2170%2C1006.1491%2C1006.3179%2C1006.5574%2C1006.2476%2C1006.4323%2C1006.2209%2C1006.3302%2C1006.3111%2C1006.4155%2C1006.3391%2C1006.0608%2C1006.2701%2C1006.3350%2C1006.5640%2C1006.2815%2C1006.4988%2C1006.5959%2C1006.3517%2C1006.3075%2C1006.3753%2C1006.4886%2C1006.2509%2C1006.0783%2C1006.0469%2C1006.2342%2C1006.4082%2C1006.5435%2C1006.3066%2C1006.2478%2C1006.0709%2C1006.5491%2C1006.4837%2C1006.5406%2C1006.2837%2C1006.2811%2C1006.0220%2C1006.2055%2C1006.4748%2C1006.4413%2C1006.4385%2C1006.2156%2C1006.5164%2C1006.0708%2C1006.4157%2C1006.3941%2C1006.1000%2C1006.4915%2C1006.1322%2C1006.0577%2C1006.0975%2C1006.0696%2C1006.0371%2C1006.4599%2C1006.0013%2C1006.3889%2C1006.0324%2C1006.4045%2C1006.3515%2C1006.2318%2C1006.4465&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We investigate the complex spatio-temporal dynamics in avalanche driven\nsurface growth by means of scaling theory. We study local activity statistics,\navalanche kinetics, and temporal correlations in the global interface velocity,\nobtaining different scaling relationships among the involved critical exponents\ndepending on how far from or close to a critical point the system is. Our\nscaling arguments are very general and connect local and global magnitudes\nthrough several scaling relationships. We expect our results to be applicable\nin a wide range of systems exhibiting interface kinetic roughening driven by\navalanches of local activity, either critical or not. As an example we apply\nthe scaling theory to analyze avalanches and roughening of forced-flow\nimbibition fronts in excellent agreement with phase-field numerical\nsimulations."}, "authors": ["Juan M. Lopez", "Marc Pradas", "Aurora Hernandez-Machado"], "author_detail": {"name": "Aurora Hernandez-Machado"}, "author": "Aurora Hernandez-Machado", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevE.82.031127", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1006.4023v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1006.4023v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "6 pages, 3 eps figures", "arxiv_primary_category": {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1006.4023v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1006.4023v1", "journal_reference": null, "doi": "10.1103/PhysRevE.82.031127", "fulltext": "Activity statistics, avalanche kinetics, and velocity correlations in surface growth\nJuan M. López∗\nInstituto de Fı́sica de Cantabria (IFCA), CSIC–UC, E-39005 Santander, Spain\n\narXiv:1006.4023v1 [cond-mat.stat-mech] 21 Jun 2010\n\nMarc Pradas† and A. Hernández-Machado‡\nDepartament d'Estructura i Constituents de la Matèria,\nUniversitat de Barcelona, Avinguda Diagonal 647, E-08028 Barcelona, Spain\n(Dated: October 17, 2018)\nWe investigate the complex spatio-temporal dynamics in avalanche driven surface growth by means of scaling\ntheory. We study local activity statistics, avalanche kinetics, and temporal correlations in the global interface\nvelocity, obtaining different scaling relationships among the involved critical exponents depending on how far\nfrom or close to a critical point the system is. Our scaling arguments are very general and connect local and\nglobal magnitudes through several scaling relationships. We expect our results to be applicable in a wide range\nof systems exhibiting interface kinetic roughening driven by avalanches of local activity, either critical or not.\nAs an example we apply the scaling theory to analyze avalanches and roughening of forced-flow imbibition\nfronts in excellent agreement with phase-field numerical simulations.\nPACS numbers: 05.40.-a, 47.56.+r, 64.60.Ht, 68.35.Ct\n\nI.\n\nINTRODUCTION\n\nThe dynamics of rough surfaces in systems exhibiting\navalanches or bursts of activity in response to a slow external\ndriving has attracted a great deal of attention in recent years.\nPhysical examples include fracture cracks [1], fluid imbibition\nfronts in porous media [2–4], or the motion of domain-walls\nin magnets [5]. By means of high resolution fast imaging\ntechniques it has recently been possible to characterize experimentally avalanche dynamics of activity from either the local\nvelocity map [1] or the average velocity time series [4, 6]. A\nfundamental problem is to understand the role played by local fluctuations (avalanches) in the building up of large-scale\nspace-time interface correlations and scale-invariant roughening.\nIn this paper we show that local activity statistics, avalanche\nscaling properties, and time correlations (in both, the surface and the global velocity-fluctuations) are generically connected through scaling relations that we derive by means of\nsimple scaling arguments. Depending on the form of probability distribution of the first-return time of activity to a given\nsite, we divide avalanche driven surface growth systems into\ntwo separate classes as follows. We consider that driven systems can exhibit either off-critical or critical (fractal) spatiotemporal activity, and the scaling relations among the corresponding exponents are different for each class. On the one\nhand, there are systems where scale-invariant interface growth\nemerges from off-critical spatio-temporal patterns of activity,\nwhere avalanches have a finite extent and the probability for\nthe activity to return to any given place is short tailed. On the\nother hand, there are growing interfaces where local activity\nis critical, showing fractal patterns in space and/or time. Examples include systems at the depinning transition as well as\n\n∗\n†\n‡\n\nlopez@ifca.unican.es\npradas@ecm.ub.es\naurora@ecm.ub.es\n\ninterface systems that self-organize into a critical state. This\nleads to critical avalanches of activity with fat tails that lead\nto strong fluctuations of the avalanche size, avalanche extent,\nand first return time of activity. In both cases, however, we\nfind that the interface space-time correlations turn out to be\nrelated to the spatio-temporal activity, leading then to a connection between local and global quantities via scaling relationships that we obtain. Our arguments are very general and\nwe expect our results to be widely applicable in systems where\nsurface roughness fluctuations are driven by local avalanches.\nAs an example of much current interest, we apply the scaling theory to the problem of forced-flow imbibition fronts,\nwhich occurs when a viscous fluid advances through a disordered media displacing a less viscous fluid (typically air) [7].\nIn forced-flow imbibition experiments a constant fluid injection rate is applied while the spatially averaged velocity of the\nliquid-air interface v is kept constant [4]. This system exhibits\na natural characteristic length scale ξ× ∼ (1/v)1/2 [7–11]\ncorresponding to the typical extent of interface correlations,\nwhich can be controlled by the injection rate. Therefore, imbibition offers an excellent example where the theory we shall\npresent here can be tested, since the system may be either in\nan off-critical regime (v ≫ 0) with avalanches extending over\nshort length scales of order ξ× , or fronts can be driven into a\ncritical regime (v → 0) by simply tuning the fluid injection\nrate. Interestingly, these regimes can be accesible to experimentation [4].\nThe paper is organized as follows. In Sec. II we study the\nlocal aspects of the interface dynamics in terms of activity\nstatistics, where we give the exact definitions of critical and\noff-critical activity. We also study there the avalanche kinetics, where we present the different scaling relations among\nthe local quantities describing avalanches. In Sec. III we analyze the global dynamics of the interface by means of the\nmultiscaling properties of the surface and the mean interface\nvelocity time-correlations. All the different quantities defined\nthoughout the paper are then studied numerically in forcedflow imbibition fronts in Sec. IV. The final conclusions are\n\n\f2\ngiven in Sec. V.\nII.\n\nLOCAL DYNAMICS\n\nA. Activity statistics\n\nWe consider an advancing interface h(x, t) in d + 1 dimensions where x is the substrate position and t is time. A site x\nis said to be active at a given time if it is moving. For discrete\nmodels this corresponds to sites to be updated, h → h + 1,\nin the next time step. For continuous systems defining single\nsite activity is more cumbersome but it can be effectively done\nby considering a site is active whenever the local velocity is\nabove some fixed threshold. In order to characterize the local spatio-temporal activity we calculate the first-return time\nprobability density, Pf (T ), for a site x to become active again\nafter a period of inactivity T . This probability describes the\ntime duration of intervals separating subsequent returns of activity at any given site so that the average number of returns\nN (T ) in a time interval of duration T satisfies [12]\nZ T\nN (T ) = T − N (T )\nu Pf (u)du,\n(1)\nδT\n\nwhere the temporal resolution can be set to unity, δT = 1,\nwithout loss of generality.\nIn systems far from a critical point, which we denote as\noff-critical systems, activity is expected to be described by a\ngeneral scaling function:\nPf (T ) = a(T0 )f (T /T0 ),\n\n(2)\n\nsuch that f (y) →R 0 as y → ∞ and a(T0 ) is a normalization\n∞\nconstant so that\nduPf (u) = 1 is fulfilled. The average\nreturn time in this case is simply\nZ ∞\nhT i =\nu Pf (u)du ∝ T0 ,\n(3)\n1\n\nand thus a finite average surface velocity v ∝ 1/hT i exists. A\nvery common example are systems where the return of activity\nis a Poison process, so that the time interval distribution is\nsimply exponential f (T /T0 ) ∼ exp (−T /T0 ). In the case of\nsystems exhibiting some degree of correlation between two\nconsecutive returns of activity to a given site the distribution\nis more likely to be described by\n′\n\nPf (T ) ∼ T −τf exp(−T /T0 ),\n\n(4)\n\nwhere τf′ represents an effective exponent characterizing the\npower-law regime. This case will also be classified as offcritical here since there still exists a finite average surface velocity with the average return time also given by Eq. (3).\nIn contrast, under certain circumstances, some systems may\nshow patterns of activity recurrence that become critical or\nfractal (i.e. scale-invariant) in time in such a way that the firstreturn time probability density exhibits a power-law asymptotic tail:\nPf (T ) ∼ T −τf\n\nfor\n\nT ≫ 1,\n\n(5)\n\nwith exponent τf > 1 for the distribution to be properly normalizable. In this case, in the long time limit we obtain that\nthe average number of return points is N (T ) ∼ T τf −1 with\nsome critical exponent within the range τf ∈ (1, 2]. Note that,\nfor τf > 2, although the activity is still described by a powerlaw, the system is actually off-critical due to the existence of\na finite return time hT i, i.e., returns become dense in time,\nand the interface advances at finite velocity (∂T N ∼ const.).\nIn contrast, for 1 < τf ≤ 2 returns rarely occur and activity\nis said to be fractal in time. In this case, the infinite average\nreturn time\nZ ∞\nhT i ∼\nu1−τf du → ∞,\n(6)\n1\n\ntypical of a critical dynamics. Fractal activity occurs, for instance, near a pinning/depinning critical transition (v → 0)\nor in surface growth models that self-organize into the critical\nstate.\nB. Avalanche kinetics\n\nAn avalanche is defined as a spatially connected cluster\nof active sites. Avalanches are characterized by the typical\nsize s(l) of an event of lateral spatial extent l. The duration\nand lateral extent of an event are related, l ∼ t1/zav , via the\navalanche dynamic exponent zav . One expects the average\navalanche size to scale with the lateral extent up to the cutoff\nlength scale (if any): s(l) ∼ ldav for l ≪ ξ× , where dav is the\navalanche dimension exponent. Conversely, one also expects\nto observe a scaling relation s(t) ∼ tγ between size s and duration t of avalanches. Since an avalanche of lateral length l\nleads to a fluctuation of the surface height of the order of the\nlocal width w(l), dav can be easily related to the local roughness exponent αloc . Indeed, one has s(l) ∼ ld w(l) ∼ ld lαloc ,\nand dav = d+αloc for a surface in d+1 dimensions. Likewise,\nthe avalanche size-duration exponent γ can then be obtained\nfrom the identity s ∼ tγ ∼ ld+αloc and we find\nαloc + d\n,\n(7)\nzav\nwhich connects avalanche dynamics with surface roughness [2].\nIn the case of off-critical activity, non-critical avalanches\nwith a typical spatial extent cutoff ξ× are expected so that\ndurations are also bounded and scaling only holds for t ≪\nzav\nt× ∼ ξ×\n. The avalanche size can be written in terms of the\naverage velocity associated with the event as s ∼ ld N (t) ∼\nld v(l)t, for an avalanche of lateral extent l and duration t.\nWe assume that the typical velocity of the avalanche scales\nwith the avalanche size as v(l) ∼ l−δ . The identity s ∼\nld v(l)t ∼ ld+αloc leads to lzav −δ ∼ lαloc and we obtain the\nscaling relation\nγ=\n\nzav = αloc + δ,\n\n(8)\n\nrelating surface roughness and avalanche exponents in the\ncase of off-critical activity (non-critical avalanches). The exponent δ in Eq. (8) gives account of possible inter-event correlations. For instance, in the case of uncorrelated avalanches,\n\n\f3\ntypically, one should expect Gaussian fluctuations of the\navalanche velocity and hv(l)v(l′ )i ∼ δ d (l − l′ ), giving\nv(l) ∼ l−d/2 . Avalanches are initiated in places favored given\nthe disordered background. If this disorder is spatially uncorrelated it follows that avalanche velocity should also be uncorrelated and δ = d/2. Correlations in the random medium\ncan produce non trivial correlations in the avalanche velocity\nand that possibility is contemplated here. Also, in the case of\nnon disordered systems, where movement is driven by some\nexternal noise, the same argument applies since the noise may\nbe either white or correlated. We have assumed a general situation by introducing the exponent δ that accounts for possible\nvelocity correlations in case they exist.\nA different result is obtained for driven surfaces exhibiting\na fractal profile of activity which leads to critical avalanches\nwith no characteristic length or time scales (t× → ∞).\nThis is an interesting case because it includes surfaces near\nthe pinning/depinning transition, surfaces driven into selforganized critical states, and surfaces obeying extremal dynamics, among other surface models in the critical state. As\ndiscussed above, avalanches in the presence of fractal activity\ndo not have a finite velocity since the average number of returns of activity to a given site is N (t) ∼ tτf −1 with τf < 2.\nThis means that the scaling relation (8) does not apply. However, the scaling relation between avalanche size and local\nwidth, s ∼ ld N (t) ∼ ld w(l), is indeed valid also in this case,\nbut with N (t) ∼ tτf −1 . Thus we find the scaling relation [13]\nτf =\n\nαloc\n+ 1,\nzav\n\n(9)\n\nwhich connects the local roughness with the statistics of the\nfirst-return time of surfaces exhibiting a fractal activity.\n\n(∆h)m ∼ nmov (t)[∆hmax (t)]m ∼ tmβ∞ +d/zav L−d , (12)\nfor fluctuations at time scales t ≪ t× , while it becomes\n(∆h)m ∼ tm(2α+d)/2zav ,\n\n(13)\n\nHaving activity in the form of localized avalanches implies that growth is highly inhomogeneous in space with many\ntime scales involved, which, in turn, may produce multiscaling of the height-height correlations [14]. As it is shown below, this can give information about local properties through\nglobal observables. To this end we define ∆h(x, t; t0 ) ≡\nh(x, t+t0 )−h(x, t0 ) and investigate the generalized q-heightheight correlation function in the saturated regime\ni ∼ tβ q ,\n\n(10)\n\nwhere the over bar is a spatial average and brackets denote\naverage over independent realizations. When the exponents\nβq depend on q the surface is said to exhibit multiscaling and\nthis indicates a highly non trivial probability distribution of\nthe height fluctuations. We are interested in obtaining βq as a\nfunction of the roughness and activity exponents.\nIn the limit q → ∞ only the site with the maximum growth,\n∆hmax (t) ≡ hmaxx {∆h(x, t; t0 )}i, contributes and we have\n\n1/q\n\n. Therefore we can write Cq (t) ∼ tβq , with\n(\nβ∞ + qzdav for t ≪ t×\n,\n(14)\nβq =\n2α+d\nfor t ≫ t×\n2zav\n\nthe term (∆h)q\n\nA. Multiscaling of the height-height correlations\n\n1/q\n\nwhere the crossover time t× is the average avalanche duration.\nIn the case of off-critical activity t× is finite, while it diverges\nfor fractal activity.\nFor a system of lateral extent L, surface fluctuations over\ntime scales t ≪ t× involve localized avalanche events of activity and so only a fraction of the surface nmov ∼ (l/L)d ∼\n(t1/zav /L)d is moving. By using Eq. (11), we can roughly\nestimate that a term of the form (∆h)m for m > 1 scales as\n\nfor t ≫ t× . Now, note that in the temporal regime t ≪ Lzav\nof interest here, the main contribution in Eq. (10) comes from\n\nIII. GLOBAL DYNAMICS\n\nCq (t) ≡ h|∆h(x, t; t0 ) − ∆h(x, t; t0 )|q\n\nC∞ (t) ≈ ∆hmax (t). Note that ∆hmax (t) becomes an important quantity since it corresponds to the typical height fluctuation produced on the surface by avalanche events in a time interval t. For time intervals t shorter than the average avalanche\nduration cutoff (t ≪ t× ) we have ∆hmax (t) ∼ tβ∞ , where\nthe exponent is β∞ ≡ limq→∞ βq . In contrast, in time\nscales longer than the typical event duration (t ≫ t× ) surface fluctuations are no longer spatially localized- vary many\navalanches occurring at different parts of the surface overlap\nand contribute to the fluctuation. Therefore surface height\nfluctuations must become spatially homogeneous at long time\nscales (t ≫ t× ) and the typical growth ∆hmax (t) should scale\nwith the global surface width W (t) ∼ tα/zav , where α is the\nglobal roughness exponent. These two limiting behaviors can\nbe put as\n\u001a β\nfor t ≪ t×\nt ∞\n∆hmax (t) ∼\n,\n(11)\ntα/zav for t ≫ t×\n\nthat gives the multiscaling exponents βq induced in the surface fluctuations by the localized avalanche dynamics, valid\nfor both off-critical (finite t× ) and fractal (unbounded t× ) distributions of activity. The exponent for the infinite moment\ncan then be obtained by considering that a height fluctuation\nat time scales t ≪ t× corresponds to an avalanche of lateral\nextent l and is given by ∆hmax ∼ s(t)/ld ∼ tγ−d/zav . Using\nEq. (7) we have β∞ = αloc /zav .\nIt is interesting to particularize these results for the case\nof models exhibiting extremal dynamics [14–16], where the\navalanche-duration exponent is γ = 1 (only one site is growing at any given time) and we have ∆hmax (t) ∼ s(t)/ld ∼\nt/ld and β∞ = 1 − d/zav with t× → ∞ since the model is\ncritical, in agreement with existing results for critical depinning models with extremal dynamics [14].\nThe presence of multiscaling is due to the infinitely many\ntime scales involved in the problem that are induced by a\n\n\f4\n(a)\nPf(T)\n\n10\n10\n10\n\nv0/40\nv0/5\nv0\n\n-3\n\n-1.48(2)\n-5\n-6\n\n1\n\n10\n\n2\n\n10\n\n10\n\n3\n\n4\n\n5\n\n10\n\n10\n\nT\n(b)\n\ncth = 8\ncth = 6\ncth = 4\ncth = 2\n\n-3\n\n10\n\nPf(T)\n\nhighly inhomogeneous surface growth. An illustrative way to\nshow this is to note that the time scale defined by C1 (t) ∼ tβ1\nis associated with the avalanche size-duration exponent γ\nsince, from Eq. (14), β1 = β∞ + d/zav = (αloc + d)/zav = γ\n[cf. Eq. (7)]. In the other limit, when q → ∞, we have β∞ =\nαloc /zav that corresponds to the time scale of single-site activity. This observation is transparent for a fractal activity distribution where ∆hmax ∼ tβ∞ can be related to the average\nnumber of returns to a given site, ∆hmax ∼ N (t) ∼ tτf −1 .\nThis gives τf = β∞ + 1, which corresponds to the previously\nderived scaling relation (9). This allows us to immediately associate the ∞- correlation moment (a global observable) with\nthe distribution of the return times of activity at any given site\n(a local observable). This is useful for experiments, where\nsingle site motion, and therefore local observables, may be\ndifficult to measure.\n\n-1.48(2)\n\n-5\n\n10\n\n-6\n\n10\n\n-8\n\n10\n\n10\n\n2\n\n3\n\n10\n\n4\n\n10\n\n10\n\n5\n\nT\nB. Correlations of the global velocity fluctuations\n\nRecently, there has been much interest [2, 4, 6, 17, 18] in\nobtaining information about the avalanche kinetics from the\nscaling behavior of the global activity/velocity fluctuations.\nThis is particularly important in experiments where the global\nvelocity time series is readily available, while it is difficult\nto monitor microscopic avalanches. The scaling relations obtained in the preceding sections can be used to give a full solution to this problem in the context of surface growth.\nIn the stationary state, t0 ≫ Lzav , we consider the velocityvelocity correlation ∆v(t) = h[v(t + t0 ) − v(t0 )]2 i, where\nv(t) is the average instantaneous velocity time series. Equivalently, we can compute the velocity fluctuation spectrum\nh|v̂(ω)|2 i, where v̂(ω) is the Fourier component at frequency\nω ∼ t−1 . Generally, one expects ∆v(t) ∼ t2H where H is\nHurst exponent of the velocity time series, while in Fourier\nspace we have h|v̂(ω)|2 i ∼ ω −ν , with ν = 2H + 1. Since\nv(t) ≡ ∂t h, the velocity fluctuation spectrum can be written\nb\n2\ni. We are interested here in the\nas h|v̂(ω)|2 i = ω 2 h|h(ω)|\ncase of surfaces exhibiting kinetic surface roughening in d + 1\ndimensions where the structure factor describing the heightheight correlations scales as\nh|ĥ(k, t)|2 i = k −(2α+d) f (kt1/zav ),\nwhere k = |k|, and the scaling function f (u) ∼ u\nu → 0. We have\n\n(15)\n2α+d\n\nb\n2\nh|h(ω)|\ni = lim h|ĥ(k, ω)|2 i ∼ (1/ω)(2α+d)/zav +1 ,\nk→0\n\nfor\n\n(16)\n\nleading to the scaling exponent\nν=\n\n2α + d\n− 1,\nzav\n\n(17)\n\nwhich relates the low-frequency behavior of the velocityfluctuation spectrum to the roughness properties of the surface. This formula generalizes an earlier analytical result [19],\nν = (d + 4)/z − 3, valid for the Kardar-Parisi-Zhang equation [20]. This scaling behavior holds for frequencies above\nω0 ∼ (1/L)zav , below which the spectrum becomes flat.\n\nFIG. 1. (Color online) (a) First-return time probability density Pf (T )\ncalculated at different velocities. It reflects an off-critical activity\n(moderate velocities: v = v0 and v = v0 /5), characterized by :\n′\nPf (T ) ∼ T −τf exp (−T /T0 ) with effective exponents of τf′ ≃ 1.0\nand 1.37, respectively. Fractal activity is found at low velocities:\nv = v0 /40 where Pf (T ) ∼ T −τf with τf = 1.48 ± 0.02. All\nresults shown correspond to a threshold value of cth = 6. (b) Effect of the election of a velocity threshold cth . First-return time\nprobability density for the case of v = v0 /40, when the singlesite activity is critical, calculated by choosing different values of\nthe threshold cth . For cth < 6 the distribution can be fitted to\nPf (T ) ∼ T −τf exp (−T /Tth ) with Tth depending on cth . Note\nthat τf ≃ 1.48 is robust for different velocity thresholds cth indicating it is a critical exponent.\n\nIV. CASE STUDY: FLUID IMBIBITION IN RANDOM\nMEDIA\n\nWe now apply the above scaling theory to the problem of\nforced-flow imbibition in disordered media [7]. As it has been\nnoted in the introduction, the main point in forced-flow imbibition lays in the existence of a natural characteristic length\nξ× ∼ (1/v)1/2 for the typical avalanche extent [7–11], which\ncan be controlled by the liquid flow rate. In this way, we have\na system whose activity can be made progressively fractal as\nthe velocity is tuned from moderate to very low values.\nWe simulate forced-imbibition in 1 + 1 dimensions in the\ncapillary dominated regime by integrating a standard phasefield model [7–11]\n\u0002\n\u0003\n∂t φ = ∇M ∇ − φ + φ3 − ǫ2 ∇2 φ − η(r) ,\n(18)\n\nin a two-dimensional system of lateral size L = 512 with\nǫ = 1. The quenched random field η(r) > 0 models capillary\ndisorder and favors the liquid (wet) phase, forcing the interface to advance at the expense of the air (dry) phase. The parameter M in the above equation is the mobility which we take\nconstant at the liquid phase (φ > 0) and zero at the air phase\n(φ < 0). In our numerical model we have used a spatially distributed dichotomic quenched noise and the results have been\naveraged over 25 disorder realizations. The interface position\n\n\f5\n(b) β = 0.53(3)\n8\n\n10\n\nβ = 0.64(3)\n\n-4\n\n-1.05(7)\n\n0\nβ1 = 0.94(3)\n\n-1\nβ1 = 0.93(3)\n\n-2\n0\n\n1\n\n2\n\nlog10(t)\n\n3\n\n3\n\n4\n\nlog10(t)\n\n5\n\nFIG. 2. (Color online) Height-height time correlation function\nCq (t) ∼ tβq , calculated at two typical velocities, shows the presence\nof multiscaling with β1 ≈ 0.93, β2 ≈ 0.81, β3 ≈ 0.73, β4 ≈ 0.70,\nand β∞ ≈ 0.64 at moderate velocities, v = v0 (a), and β1 ≈ 0.94,\nβ2 ≈ 0.75, β3 = 0.67, β4 ≈ 0.63, and β∞ ≈ 0.53 at low velocities,\nv = v0 /40 (b).\n\nh(x, t) separating the wet and dry phases is computed. A site\non the interface is active at time t if its local velocity is above\nsome fixed threshold, v(x, t) > cth v, where cth is some arbitrary constant.\nIn Fig 1(a) we plot the distribution of first-return times of\nactivity to any given site. We see that for moderate velocities,\nv = v0 = 2 × 10−3 and v = v0 /5, the activity is an exponentially cut-off power-law with an exponent that depends\non the mean velocity, while it tends to be pure power-law distributed for very low velocities, v = v0 /40, where we obtain\nτf = 1.48 ± 0.02 over a range of more than three decades.\nThese distributions of activity correspond to the fact that the\ncharacteristic avalanche size (and duration) diverges as one\ngets closer to the pinned state, v → 0 [11]. It is worth to mention here that the observed results do not depend on the choice\nof the arbitrary threshold cth . Figure 1(b) shows that changing the value of cth only introduces an artificial cut-off but\ndoes not change the exponent, something already observed in\nRef. [11].\nLet us now study these two different dynamical regimes. In\nthe case of moderate velocities (off-critical activity) the stationary surface is super-rough [21] and recent numerical work\nshows [2, 11] that the global and local roughness exponents\nare, α ≈ 5/4 and αloc = 1, respectively. Avalanches in imbibition are driven by the capillary disorder [2], which is a\nrandom quenched and uncorrelated field, so we should expect\nthe Gaussian value δ = 1/2. Inserting these values in Eqs. (7)\nand (8), we find the dynamic exponent zav = 3/2 and the\navalanche duration exponent γ = 4/3 in d = 1, in excellent agreement with the existing numerical estimates [2, 11]\nfor imbibition fronts in this range of velocities. Figure 2\nshows that the surface fluctuations display multiscaling up\nto a given characteristic time scale. In particular, we predict\nβ∞ = αloc /zav = 2/3, which is in excellent agreement with\nthe numerical estimate in Fig. 2(a). However, Eq. (14) with\nαloc = 1 and zav = 3/2 only reproduces the trend of the\nnumerical estimated exponents but not the exact values, as a\nclear consequence of the strong crossover effects due to the\nfinite cut-off time scale t× . We expect our prediction for βq\nto become better as t× becomes larger (see below).\nRegarding the velocity fluctuations spectrum we predict a\ndecay as ∼ (1/ω)ν with ν given by Eq. (17) up to a cut-\n\n^\n|v(ω)|\n\n2\n\n8\n\nlog10[Cq(t)]\n\n(a)\n1\n\n10\n\n10\n\n-6\n\nv = vo/40\n-8\n\nv = vo\n10\n\n-1.26(8)\n-4\n\n10\n\n-3\n\nω\n\n10\n\n-2\n\n10\n\n-1\n\nFIG. 3. (Color online) Power spectrum of the mean interface velocity h|v̂(ω)|2 i ∼ ω −ν calculated at two typical velocities, obtaining\nν = 1.26(8) at high velocities and ν = 1.05(7) at low velocities in\nagreement with the theoretical prediction 1.33 and 1.0 respectively.\n\noff frequency ω0 ∼ (1/ξ× )zav associated with the saturation time in a finite-length correlated system. Replacing the\nknown numerical estimates [2, 11] for the critical exponents\nα = 5/4 and zav = 3/2, we predict a velocity correlation\nexponent ν = 4/3 in good agreement with our simulations\nν = 1.26 ± 0.08 in Fig. 3, as well as the numerical estimate\nin Ref. [2].\nThe scaling behavior changes dramatically when we drive\nthe front at very low velocities, where the activity statistics becomes approximatively fractal (see Fig. 1). Although, for an\ninfinite size system, a truly fractal activity distribution would\nonly appear in the limit v → 0, we observe that for velocities as low as v = v0 /40 our finite system has a robust\nscale-invariant activity distribution Pf (T ) ∼ T −τf over four\ndecades in T . We recall that, according to the arguments discussed in the previous sections, the scaling relation (8) is no\nlonger valid for fractal activity and has to be replaced by (9).\nThe scaling exponents α = 3/2, αloc = 1, zav = 2, and\nγ = 1 in this close-to-pinning regime have been recently obtained [11] both analytically and numerically by using the\nphase-field model described above. We are therefore able\nto check our scaling relations (9), (14), and (17). Replacing\nαloc = 1 and zav = 2 in (9) we find the first-return time distribution exponent τf = 3/2, which is in excellent agreement\nwith our numerical estimate in Fig. 1.\nFigure 2(b) shows that the system also exhibits multiscaling in the regime of low velocities. In this regime the system\nis very close to the pinning critical point (lacking characteristic lengths or time scales) and our prediction for the multiscaling exponents βq is expected to be more accurate. In\nfact, inserting αloc = 1 and zav = 2 in Eq. (14) we obtain\nβq = (q + 1)/2q, which leads to the set of theoretical exponents β1 = 1, β2 = 0.75, β3 = 0.667, and β4 = 0.625 in\nexcellent agreement with our simulations [cf. Fig. 2(b)]. Also,\nin the limit q → ∞ we expect to have β∞ = αloc /zav = 1/2\nto be compared with the numerical result β∞ ≈ 0.53.\nFinally, regarding the temporal correlations of the global\nvelocity signal in the low-velocity regime we can replace α =\n3/2 and zav = 2 in Eq. (17) to obtain ν = 1 for the full range\nof frequencies, which is to be compared with our numerical\nestimate ν = 1.05 ± 0.07 shown in Fig. 3.\n\n\f6\nV. CONCLUSION\n\nTo summarize, we have presented a scaling theory of surface roughening in systems driven by avalanches exhibiting\neither off-critical activity distribution, described by a powerlaw with a cut-off function, or critical activity distribution,\ncharacterized by a pure power-law. Our results connect, on the\none hand, distributions of local activity with the scaling properties of avalanches and surface roughness. On the other hand,\ntemporal correlations in both the surface and the global velocity signal with local activity and avalanche kinetics turn out\nto be also connected by means of scaling relations. For illustration, we have applied the theory to the problem of forcedfluid imbibition, which can show both off-critical or critical\ndistributions of local activity as the the front velocity is tuned\n\n[1] K. J. Måløy, S. Santucci, J. Schmittbuhl, and R. Toussaint,\nPhys. Rev. Lett. 96, 045501 (2006).\n[2] M. Rost et al. , Phys. Rev. Lett. 98, 054502 (2007).\n[3] J. Soriano et al. , Phys. Rev. Lett. 95, 104501 (2005).\n[4] R. Planet, S. Santucci, and J. Ortin, Phys. Rev. Lett. 102,\n094502 (2009).\n[5] J. P. Sethna, K. Dahmen, and C. Myers, Nature 410, 242 (2001).\n[6] S. T. Bramwell, Nature Phys. 5, 443 (2009).\n[7] M. Alava, M. Dubé, and M. Rost, Adv. Phys. 53, 83 (2004).\n[8] M. Dubé et al., Phys. Rev. Lett. 83, 1628 (1999).\n[9] T. Laurila et al., Eur. Phys. J. B 46, 553 (2005).\n[10] M. Pradas and A. Hernández-Machado, Phys. Rev. E 74,\n041608 (2006).\n[11] M. Pradas, J. M. López, and A. Hernández-Machado, Phys.\nRev. E (Rapid Comm.) 88 050101 (2009).\n\ntoward zero, obtaining in both cases excellent agreement between theory and numerical results. Our predictions for the\nsigle-site activity statistics, avalanche distribution, roughness,\nand velocity-fluctuation correlations are novel and of interest\nfor the experiments in this little explored region in the context of forced-imbibition near the depinning transition. Our\narguments are very general and should be of general validity in very different contexts where surface roughness fluctuations are driven by local avalanches of motion, characterized\nby having either a parallel or extremal dynamics.\nACKNOWLEDGMENTS\n\nThis work is supported by the DGI (Ministerio de Educación y Ciencia, Spain) through Grant Nos. FIS2009-12964C05-02 and 05.\n\n[12] S. Maslov, M. Paczuski, and P. Bak, Phys. Rev. Lett. 73, 2162\n(1994).\n[13] L. Laurson and M. J. Alava, Eur. Phys. J. B 42, 407 (2004).\n[14] H. Leschhorn and L.-H. Tang, Phys. Rev. E 49, 1238 (1994).\n[15] K. Sneppen, Phys. Rev. Lett. 69, 3539 (1992).\n[16] M. Paczuski, S. Maslov, and P. Bak, Phys. Rev. E 53, 414\n(1996).\n[17] M. C. Kuntz and J. P. Sethna, Phys. Rev. B 62, 11699 (2000).\n[18] L. Laurson, M. J. Alava, and S. Zapperi, J. Stat. Mech. L11001\n(2005); L. Laurson, X. Illa, and M. J. Alava, J. Stat. Mech.\nP01019 (2009).\n[19] J. Krug, Phys. Rev. A 44, R801 (1991).\n[20] M. Kardar, G. Parisi, and Y.-C. Zhang, Phys. Rev. Lett. 56, 889\n(1986).\n[21] J. J. Ramasco, J. M. López, and M. A. Rodrı́guez, Phys. Rev.\nLett. 84, 2199 (2000).\n\n\f"}