{"id": "http://arxiv.org/abs/0801.1659v1", "guidislink": true, "updated": "2008-01-10T19:52:48Z", "updated_parsed": [2008, 1, 10, 19, 52, 48, 3, 10, 0], "published": "2008-01-10T19:52:48Z", "published_parsed": [2008, 1, 10, 19, 52, 48, 3, 10, 0], "title": "Statistical Analysis of Crossed Undulator for Polarization Control in a\n  SASE FEL", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0801.0166%2C0801.1692%2C0801.3167%2C0801.1723%2C0801.2862%2C0801.0445%2C0801.1975%2C0801.1125%2C0801.4902%2C0801.0435%2C0801.4422%2C0801.1205%2C0801.2378%2C0801.4727%2C0801.3713%2C0801.4316%2C0801.1889%2C0801.0924%2C0801.1138%2C0801.4011%2C0801.4137%2C0801.2876%2C0801.1277%2C0801.2546%2C0801.1222%2C0801.4245%2C0801.2133%2C0801.2749%2C0801.1514%2C0801.0281%2C0801.4846%2C0801.2558%2C0801.4321%2C0801.3063%2C0801.2812%2C0801.0749%2C0801.2613%2C0801.1887%2C0801.0099%2C0801.1478%2C0801.3315%2C0801.1823%2C0801.0013%2C0801.1448%2C0801.3918%2C0801.3461%2C0801.2235%2C0801.3230%2C0801.1548%2C0801.2292%2C0801.3424%2C0801.2344%2C0801.4401%2C0801.0503%2C0801.1022%2C0801.2598%2C0801.3178%2C0801.1787%2C0801.2936%2C0801.2861%2C0801.2169%2C0801.2288%2C0801.1411%2C0801.2481%2C0801.4922%2C0801.1608%2C0801.3240%2C0801.3265%2C0801.3661%2C0801.1801%2C0801.4480%2C0801.0631%2C0801.2137%2C0801.2430%2C0801.2254%2C0801.4203%2C0801.3684%2C0801.2530%2C0801.4492%2C0801.1058%2C0801.3311%2C0801.3668%2C0801.1593%2C0801.1422%2C0801.4108%2C0801.0726%2C0801.0926%2C0801.0253%2C0801.0109%2C0801.4949%2C0801.1659%2C0801.0868%2C0801.2738%2C0801.0375%2C0801.3806%2C0801.3045%2C0801.3163%2C0801.3976%2C0801.1755%2C0801.3570%2C0801.4559&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Statistical Analysis of Crossed Undulator for Polarization Control in a\n  SASE FEL"}, "summary": "There is a growing interest in producing intense, coherent x-ray radiation\nwith an adjustable and arbitrary polarization state. In this paper, we study\nthe crossed undulator scheme (K.-J. Kim, Nucl. Instrum. Methods A {\\bf 445},\n329 (2000)) for rapid polarization control in a self-amplified spontaneous\nemission (SASE) free electron laser (FEL). Because a SASE source is a\ntemporally chaotic light, we perform a statistical analysis on the state of\npolarization using FEL theory and simulations. We show that by adding a small\nphase shifter and a short (about 1.3 times the FEL power gain length),\n$90^\\circ$ rotated planar undulator after the main SASE planar undulator, one\ncan obtain circularly polarized light -- with over 80% polarization -- near the\nFEL saturation.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0801.0166%2C0801.1692%2C0801.3167%2C0801.1723%2C0801.2862%2C0801.0445%2C0801.1975%2C0801.1125%2C0801.4902%2C0801.0435%2C0801.4422%2C0801.1205%2C0801.2378%2C0801.4727%2C0801.3713%2C0801.4316%2C0801.1889%2C0801.0924%2C0801.1138%2C0801.4011%2C0801.4137%2C0801.2876%2C0801.1277%2C0801.2546%2C0801.1222%2C0801.4245%2C0801.2133%2C0801.2749%2C0801.1514%2C0801.0281%2C0801.4846%2C0801.2558%2C0801.4321%2C0801.3063%2C0801.2812%2C0801.0749%2C0801.2613%2C0801.1887%2C0801.0099%2C0801.1478%2C0801.3315%2C0801.1823%2C0801.0013%2C0801.1448%2C0801.3918%2C0801.3461%2C0801.2235%2C0801.3230%2C0801.1548%2C0801.2292%2C0801.3424%2C0801.2344%2C0801.4401%2C0801.0503%2C0801.1022%2C0801.2598%2C0801.3178%2C0801.1787%2C0801.2936%2C0801.2861%2C0801.2169%2C0801.2288%2C0801.1411%2C0801.2481%2C0801.4922%2C0801.1608%2C0801.3240%2C0801.3265%2C0801.3661%2C0801.1801%2C0801.4480%2C0801.0631%2C0801.2137%2C0801.2430%2C0801.2254%2C0801.4203%2C0801.3684%2C0801.2530%2C0801.4492%2C0801.1058%2C0801.3311%2C0801.3668%2C0801.1593%2C0801.1422%2C0801.4108%2C0801.0726%2C0801.0926%2C0801.0253%2C0801.0109%2C0801.4949%2C0801.1659%2C0801.0868%2C0801.2738%2C0801.0375%2C0801.3806%2C0801.3045%2C0801.3163%2C0801.3976%2C0801.1755%2C0801.3570%2C0801.4559&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "There is a growing interest in producing intense, coherent x-ray radiation\nwith an adjustable and arbitrary polarization state. In this paper, we study\nthe crossed undulator scheme (K.-J. Kim, Nucl. Instrum. Methods A {\\bf 445},\n329 (2000)) for rapid polarization control in a self-amplified spontaneous\nemission (SASE) free electron laser (FEL). Because a SASE source is a\ntemporally chaotic light, we perform a statistical analysis on the state of\npolarization using FEL theory and simulations. We show that by adding a small\nphase shifter and a short (about 1.3 times the FEL power gain length),\n$90^\\circ$ rotated planar undulator after the main SASE planar undulator, one\ncan obtain circularly polarized light -- with over 80% polarization -- near the\nFEL saturation."}, "authors": ["Yuantao Ding", "Zhirong Huang"], "author_detail": {"name": "Zhirong Huang"}, "author": "Zhirong Huang", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevSTAB.11.030702", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0801.1659v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0801.1659v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "14 pages, 4 figures", "arxiv_primary_category": {"term": "physics.acc-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.acc-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0801.1659v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0801.1659v1", "journal_reference": "Phys.Rev.STAccel.Beams11:030702,2008", "doi": "10.1103/PhysRevSTAB.11.030702", "fulltext": "Statistical Analysis of Crossed Undulator for Polarization Control\nin a SASE FEL\nYuantao Ding and Zhirong Huang\n\narXiv:0801.1659v1 [physics.acc-ph] 10 Jan 2008\n\nStanford Linear Accelerator Center, Menlo Park, CA 94025\n\nAbstract\nThere is a growing interest in producing intense, coherent x-ray radiation with an adjustable\nand arbitrary polarization state. In this paper, we study the crossed undulator scheme (K.-J.\nKim, Nucl. Instrum. Methods A 445, 329 (2000)) for rapid polarization control in a self-amplified\nspontaneous emission (SASE) free electron laser (FEL). Because a SASE source is a temporally\nchaotic light, we perform a statistical analysis on the state of polarization using FEL theory and\nsimulations. We show that by adding a small phase shifter and a short (about 1.3 times the FEL\npower gain length), 90◦ rotated planar undulator after the main SASE planar undulator, one can\nobtain circularly polarized light – with over 80% polarization – near the FEL saturation.\nPACS numbers: 41.60.Cr\n\n1\n\n\fI.\n\nINTRODUCTION\n\nSeveral x-ray free electron lasers (FELs) based on self-amplified spontaneous emission\n(SASE) are being developed worldwide as next-generation light sources [1, 2, 3]. In the soft\nx-ray wavelength region, polarization control (from linear to circular) is highly desirable in\nstudying ultrafast magentic phenomena and material science. The x-ray FEL is normally\nlinearly polarized based on planar undulators. Variable polarization could in principle be\nprovided by employing an APPLE-type undulator [4]. However, its mechanical tolerance\nfor lasing at x-ray wavelengths has not been demonstrated, and its focusing property may\nchange significantly when its polarization is altered. An alternative approach for polarization\ncontrol is the so-called \"crossed undulator\" (or \"crossed-planar undulator\"), which is the\nsubject of this paper.\nThe crossed-planar undulator was proposed by K.-J Kim to generate arbitrarily polarized light in synchrotron radiation [5] and FEL sources [6]. It is based on the interference\nof horizontal and vertical radiation fields generated by two adjacent planar undulators in a\ncrossed configuration (see Fig. 1). A phase shifter between the undulators is used to delay\nthe electron beam and hence to control the final polarization state. For incoherent radiation\nsources, the radiation pulses generated in two adjacent undulators by each electron do not\noverlap in time. Thus, a monochromator after the second undulator is required to stretch\nboth pulses temporally in order to achieve interference. The degree of polarization is limited\nby beam emittance, energy spread, and the finite resolution of the monochromator, as studied in a series of experiments at BESSY [7, 8]. On the other hand, for completely coherent\nradiation sources (such as generated from a seeded FEL amplifier or an FEL oscillator),\nthe interference occurs due to the overlap of two radiation components in the second undulator [6]. A recent crossed-undulator experiment at the Duke storage ring FEL reported\ncontrollable polarization switches with a nearly 100% total degree of polarization [9].\nIt is well-known in the FEL community that SASE light is transversely coherent but\ntemporally chaotic due to the shot noise startup. Thus, the effectiveness of the crossed\nundulator for polarization control deserves a detailed study. In this paper, starting with\none-dimensional (1D) FEL theory, we calculate both radiation components and generalize\nthe results of Ref. [6] to the case of SASE. We then determine the required length of the\nsecond undulator in order to produce the same average power as that produced in the\n2\n\n\fy\nx\nEy\nEx\n\nz\nPhase\nUndulator-2\nShifter\n\nUndulator-1\n\nFIG. 1: (color) Schematic of the crossed undulator for polarization control\n\nfirst undulator. We show that the degree of polarization can be determined by the time\ncorrelation of the two radiation fields and compute its asymptotic expression in the highgain limit. The analytical results are compared with 1D SASE simulations after a proper\nstatistical averaging. Finally, three-dimensional (3D) effects and simulation results are also\ndiscussed.\n\nII.\n\nFIELD CALCULATION\n\nFigure 1 shows a schematic of the crossed undulator applied to a SASE FEL. In the\nfirst planar undulator with a total length L1 , spontaneous radiation is amplified to generate\nhorizontally polarized SASE field Ex . In the second undulator (of length L2 ) that is rotated\n90◦ with respect to the first one, Ex propagates freely without interacting with the electron\nbeam, while a vertically polarized radiation field Ey is produced by the micro-bunched beam.\nA simple phase shifter such as a four-dipole chicane placing between the two undulators can\nslightly delay the electrons in order to adjust the relative phase of the two polarization\ncomponents.\nIn this section, we determine both SASE field components generated by the crossed\nundulator. Let E(z, t) be the complex but slowly varying electric field at undulator distance\nz and time t. We write\nE(z, t) =\n\nZ\n\nω1 dν\n√ Eν (z)ei∆ν[(k1 +ku )z−ω1 t] ,\n2π\n\n(1)\n\nwhere ω1 = k1 c is the fundamental resonant frequency corresponding to the average beam\nenergy (c is the speed of light); ν = ω/ω1 and ∆ν = ν − 1 is the relative frequency detuning,\nku = 2π/λu with λu the undulator period. Following Refs. [10, 11], the 1D FEL interaction\nstarting from shot noise can be described by the coupled Maxwell-Klimontovich equations.\n3\n\n\fIn the small signal regime before FEL saturation, the equations can be linearized and solved\nby the Laplace transformation:\n\ndμ\n(−i2ρku )e−i2ρμku z Eν,μ ,\n2πi\nI\ndμ −i2ρμku z κ1 Eν,μ dV /dη − Fν (0)\nFν (z) =\ne\n,\n2πi\n(η/ρ − μ)\n\nEν (z) =\n\nI\n\n(2)\n\nwhere\n\u0012\n\u0013\nZ\ni\niκ2 n0\nFν (0)\nEν,μ =\nEν (0) +\ndη\n,\n2ρku D(μ)\n2ρku\nη/ρ − μ\nZ\n∆ν\nV (η)\nD(μ) = μ −\n− dη\n.\n2ρ\n(η/ρ − μ)2\n\n(3)\n\nHere Eν and Fν are, respectively, the Fourier components of the electric field and of the\nKlimontovich distribution function that describes the discrete electrons in longitudinal phase\nspace, with Eν (0) and Fν (0) the Fourier components of the initial conditions; D(μ) = 0\ndetermines the FEL dispersion relation where μ is the Laplace parameter. In addition,\nparameter ρ is the dimensionless FEL Pierce parameter [12], V (η) is the electron energy\ndistribution with η the relative energy deviation, n0 is the electron volume density; κ1 =\neK[JJ]/(4γ02 mc2 ), κ2 = eK[JJ]/(2ǫ0 γ0 ), where K is the dimensionless undulator strength\nparameter, the Bessel function factor [JJ] is equal to [J0 (ξ) − J1 (ξ)] with ξ = K 2 /(4 + 2K 2 ),\n\nγ0 is the initial electron energy in units of mc2 , and ǫ0 is the vacuum permittivity. Note\n\nthat the contour integration of μ in Eq. (2) must enclose all singularities in the complex μ\nplane. Based on this solution, we can calculate radiation field components in the crossed\nundulator according to their initial conditions.\n\nA.\n\nHorizontal radiation field\n\nThe radiation field Ex in the first undulator develops from electron shot noise, with the\ninitial conditions\nEνx (0)\n\n= 0,\n\nZ\n\nFνx (0)dη\n\nNe\n1 X\neiνω1 tj (0) ,\n=\nNλ j=1\n\n(4)\n\nwhere Nλ is the number of electrons in one radiation wavelength, and tj (0) is the random\narrival time of the j th electron at the entrance to the first undulator. We assume the first\n4\n\n\fundulator operates in the exponential growth regime. In this regime, the dispersion relation\nhas a solution μ0 with a positive imaginary part that gives rise to an exponentially growing\nfield amplitude. For a cold beam with vanishing energy spread, we take V (η) = δ(η) in\nEq. (2) and obtain\nN\n\nEνx (z)\n\ne\n−iκ2 n0 −iμ0 2ρku z X\n=\ne\neiνω1 tj\n2ρku Nλ 3μ0\nj=1\n\nfor z ≤ L1 .\n\n(5)\n\nIn this high-gain regime, the electron distribution from Eq. (2) can be simplified as [6]:\nFνx (z) =\n\niκ1 Eνx (z)dV /dη\n2ku (−μ0 ρ + η)\n\nfor z ≤ L1 .\n\n(6)\n\nThis electron distribution function will be used as an initial condition for the calculation of\nthe vertical radiation field as follows.\n\nB.\n\nVertical radiation field\n\nThe radiation field Ey in the second undulator is generated by the pre-bunched electron\nbeam in the first undulator. To control the radiation polarization, the required path length\ndelay of the phase shifter chicane is on the order of the FEL wavelength. Such a weak\nchicane does not have dispersive effects that could result in micro-bunching, such as can be\nfound for example in an optical klystron (see, e.g., Ref. [13]). Hence, the initial conditions\nat the entrance of the second undulator is\nEνy (0) = 0 ,\n\nFνy (0) = Fνx (L1 ) .\n\n(7)\n\nAs the electron beam develops micro-bunching during the FEL interaction in the first\nundulator, it will radiate coherently in the second undulator. From discussions in Ref. [6]\nand simulation results shown in Sec. IV below, the intensity of Ey can increase to the same\nlevel as that of Ex in about one gain length. Thus, for a relatively short second undulator,\nwe consider only coherent radiation and ignore any feedback of the radiation on the electron\nbeam. With this approximation, the third term at the right hand side of D(μ) in Eq. (3)\ncan be dropped, and Eq. (2) can now be written as\n\u0014\n\u0015\nZ\nI\nFνx (L1 )\ndμ e−i2ρμku z2 iκ2 n0\ny\niφ\ndη\nEν (z2 ) =e\n2πi μ − ∆ν/2ρ 2ρku\nη/ρ − μ\nI\n−i2ρμku z2\nx\nEν (L1 ) μ + μ0\ndμ e\n.\n= − eiφ\n2πi μ − ∆ν/2ρ μ20\nμ2\n5\n\n(8)\n\n\fHere z2 is the undulator distance from the beginning of the second undulator. The extra\nphase factor eiφ is introduced by the phase shifter just before the second undulator. In the\nlast step of Eq. (8), we have taken a cold beam with vanishing energy spread and made\nuse of the relation κ1 κ2 n0 = 4ku2 ρ3 . Note that μ0 is the exponential growth solution that\nsatisfies D(μ0 ) = 0 and is a function of the detuning parameter ∆ν, i.e.,\n√ \u0014\n\u0014\n\u0015\n\u0015\n3\n1\n∆ν (∆ν)2\n(∆ν)2\nμ0 ≈ − 1 −\n1−\n+i\n.\n+\n2\n3ρ\n36ρ2\n2\n36ρ2\nEq. (8) can be solved by the residue theorem:\n\u0012 \u0013\n\u0003\nψ 2i \u0002\ny\nx\ni(φ−ψ/2)\nEν (z2 ) = Eν (L1 )e\nsinc\nρku z2 − μ0 eiα (ρku z2 )2 ,\n2\n2 μ0\n\nwhere sinc(x) = sin(x)/x, ψ = ∆νku z2 , and\n\u0014\n\u0015\nsin(ψ/2)\nα = arctan\n.\nsinc(ψ/2) − cos(ψ/2)\n\n(9)\n\n(10)\n\n(11)\n\nNote that α = π/2 when ∆ν = 0. The first term in the square bracket of Eq. (10) describes\ncoherent spontaneous radiation from a density-modulated beam and grows linearly with\nthe undulator distance z2 (as discussed in Ref. [14] in the context of harmonic generation).\nSince the electron beam from the first undulator possesses not only density modulation but\nalso energy modulation, the momentum compaction of the second undulator can convert\nthe energy modulation into additional density modulation. Thus, the second term in the\nsquare bracket of Eq. (10) describes the enhanced radiation due to the evolution of the density modulations inside the second undulator which grows quadratically with the undulator\ndistance.\nIn order to generate circularly polarized light, we require that both Ex and Ey have the\nsame average amplitude. From Eq. (10), this corresponds to the condition\n\u0003\n2i \u0002\nρku z2 − μ0 eiα (ρku z2 )2 = 1 .\n2\nμ0\n\n(12)\n\nWe consider a cold electron beam with vanishing energy spread, hence the growth rate\nIm(μ0 ) is maximized on resonance, i.e., ∆ν = 0. In this case we obtain the required length\nof the second undulator from Eq.(12)\nL2 ≈ 1.3LG ,\n\nwhere LG =\n\nis the 1D power gain length.\n6\n\nλu\n√\n4π 3ρ\n\n(13)\n\n\fIII.\n\nDEGREE OF POLARIZATION\n\nThe interference of the two radiation components generated by the crossed undulator will\nproduce flexible polarization. At the end of the second undulator when z = L1 + L2 , these\nradiation fields in the time domain are\nZ\nω1 dν y\n√ Eν (z2 = L2 )ei∆ν[(k1 +ku )(L1 +L2 )−ω1 t] ,\nEy (t) =\n2π\nZ\nω1 dν x\n√ Eν (z = L1 )ei∆ν[(k1 +ku )L1 +k1 L2 −ω1 t] .\nEx (t) =\n2π\n\n(14)\n\nNote that we only used Eq. (1) for Ex at z = L1 (and t1 ) and applied the free space\npropagation phase factor ei∆ν[k1 L2 −ω1 (t−t1 )] in the second undulator as Ex does not interact\nwith the electron beam there. Because of the chaotic nature of SASE radiation, we perform\na statistical analysis to quantify the state of polarization.\nFollowing the standard optics textbooks (see, e.g., Refs. [15, 16]), the state of polarization\ncan be described by the coherency matrix\n\n\nhEx (t)Ex∗ (t)i hEx (t)Ey∗ (t)i\n,\nJ=\n∗\n∗\nhEy (t)Ex (t)i hEy (t)Ey (t)i\n\n(15)\n\nwhere * means complex conjugate, and the angular bracket refers to the ensemble average.\nThe degree of polarization can be calculated as [15, 16]\ns\ndet[J]\n,\nP ≡ 1−4\n(tr[J])2\n\n(16)\n\nwhere det[J] and tr[J] are the determinant and trace of the coherency matrix, respectively.\nIt is also convenient to introduce the first-order time correlation between Ex and Ey as\ngxy ≡\n\nhEx (t)Ey∗ (t)i\n.\n[h|Ex (t)|2 ih|Ey (t)|2 i]1/2\n\n(17)\n\nFor polarization control in the crossed undulator, we are particularly interested in the\ncase when the average intensities of the two radiation components are the same: h|Ex (t)|2 i =\n ̄ Under this condition, the coherency matrix simplifies to\nh|Ey (t)|2 i = I.\n\n\nJ = I ̄ \n\n1\n|gxy |e−iθ\n7\n\niθ\n\n|gxy |e\n1\n\n\n\n,\n\n(18)\n\n\fwhere θ is the phase difference between Ex and Ey . When θ = ± π2 , the combined radiation\n\nis circularly polarized; when θ = 0 or π, it is linearly polarized at ±45◦ relative to the\nhorizontal axis. The state of polarization is controllable by adjusting the phase shift φ in\n\nEq. (10) so that the net phase in gxy is θ = ± π2 or 0/π. With equal intensity in both\ntransverse directions, the degree of polarization in Eq. (16) is simply given by the amplitude\nof the x-y time correlation, i.e.,\nP = |gxy | .\n\n(19)\n\nIn the x-ray wavelength region, the electron bunch duration is typically much longer than\nthe coherence time of the SASE radiation. Thus, a SASE pulse consists of many random\nintensity spikes that are statistically independent. For a flattop current distribution (of\nwidth T ), we can convert the ensemble average of Eq. (17) into a time average as\nZ T /2\n1\ngxy = lim  ̄\ndtEx (t)Ey∗ (t)\nT →∞ IT −T /2\nZ ∞\n1\nω1 dνEνx (L1 )Eνy∗ (L2 )e−i∆νku L2 ,\n= ̄\nIT −∞\n\n(20)\n\nwhere we have applied Eq. (14) and the Parseval relation in converting the time integration\nto the frequency integration. Assuming that the first undulator operates in the exponential\ngain regime, the frequency dependence of Eνx is approximately Gaussian, i.e.,\nh|Eνx (z)|2 i\n\n2\n ̄\nIT\n− (∆ν)2\n2σ\nν ,\ne\n=√\n2πσω\n\nwhere the relative rms SASE bandwidth is [10, 11]\ns\nσν = σω /ω1 =\n\n√\n\n(21)\n\n9ρ\n.\n3ku L1\n\n(22)\n\nSince the short second undulator generates coherent radiation from a pre-bunched beam\nthat possesses the same narrow bandwidth σν , we can expand μ20 in Eq. (10) to first order\nin ∆ν by using Eq. (9). We also ignore the frequency dependence of the second term in the\nsquare bracket of Eq. (10) because its contribution to the radiation intensity is relatively\nsmall. Finally, we have\n1\n|gxy | ≈ √\n2π\n\nZ\n\n∞\n\n−∞\n\ndν̄\n\n\u0010 2\n\u0011\nexp − ν̄2 − i ν̄σν k2u L2 sinc\n1 + (− 12 + i\n\n√\n\n3 ν̄σν\n) 3ρ\n2\n\nν̄σν ku L2\n2\n\n\u0001\n\n,\n\n(23)\n\nwhere ν̄ = ∆ν/σν . In view of Eq. (13), we take L2 = 1.3LG in Eq. (23) and obtain the\ndegree of polarization by computing |gxy |.\n8\n\n\fTABLE I: Main parameters for the LCLS soft x-ray FEL used in simulations.\nParameter\n\nvalue unit\n\nelectron beam energy\nrelative energy spread\nbunch peak current\n\n0(0.023) %\nkA\n\n1.2\n\nμm\n\naverage beta function\n\n8\n\nm\n\nundulator period λu\n\n3\n\ncm\n\nundulator parameter K\n\nA.\n\nGeV\n\n2\n\ntransverse norm. emittance\n\nIV.\n\n4.3\n\n3.5\n\nFEL wavelength\n\n1.509\n\nnm\n\nFEL ρ parameter\n\n0.119\n\n%\n\n1D power gain length LG\n\n1.17\n\nm\n\n3D power gain length L3D\nG\n\n1.48\n\nm\n\nNUMERICAL SIMULATIONS\n\n1D results\n\nWe first use a 1D FEL code to simulate the SASE radiation produced by the crossed\nundulator configuration and to analyze the degree of polarization. The code follows the\ntime-dependent approach developed in Ref. [17] and employs the shot noise algorithm of\nPenman and McNeil [18]. Electron energy spread can be included using Fawley's beamlet\nmethod [19]. After computing the Ex field produced in the first undulator, we allow Ex to\npropagate freely without further interacting with the electron beam. The simulated electron\ndistribution from the first undulator is then used to generate the Ey field in the second\nundulator.\nAs a numerical example, we use the parameter set listed in Table I that is similar to the\nsoft x-ray LCLS operation [1]. In the 1D simulations, the energy spread is set to zero since\nwe want to compare with the previous analytical results.\nFig. 2 shows the average radiation power in both x and y directions produced by the\ncross undulator. The length of the first undulator is allowed to vary, while the second\n\n9\n\n\f2\n\nAverage power ( GW )\n\n10\n\n0\n\n10\n\n−2\n\n10\n\n−4\n\n10\n\n<Px>\n<Py>\n\n−6\n\n10\n\n0\n\n5\n\n10\n15\nL1 ( m )\n\n20\n\n25\n\nFIG. 2: (color) 1D simulations of the average SASE power at 1.5 nm from the first (blue cross) and\nthe second (red plus) undulator. Here L1 is the length of the first undulator, L2 = 1.3LG = 1.53\nm is the length of the second undulator.\n\nundulator length L2 = 1.3LG ≈ 1.53 m is held constant. As predicted by Eq. (13), the\npower of the two radiation components are essentially the same in the exponential gain\nregime. Near saturation, the power of the vertical field is lower than that of the horizontal\none because the FEL-induced energy spread starts to de-bunch the electron beam in the\nsecond undulator. We repeat the simulations 200 times for each L1 with different random\nseeds to start the process and calculate the first-order time correlation between Ex and Ey\nat the exit of the second undulator using the ensemble average defined in Eq. (17). Figure 3\nshows the amplitude of this correlation from the simulation results as well as the numerical\nintegration of Eq. (23) (the red solid curve) for a comparison. When the first undulator\nis less than a couple of gain lengths, the crossed undulator operates in the spontaneous\nemission regime, the amplitude of the x-y correlation and hence the degree of polarization\nare very small without the use of a monochromator. The degree of polarization increases in\nthe exponential growth regime and reaches a maximum of 85% near the FEL saturation. In\nthis regime and especially when the gain is very high, we see very good agreement between\nsimulations and Eq. (23). In the saturation regime, the amplitude of the x-y correlation\nstarts to decrease, and the linear theory starts to deviate from the simulation results.\nThere are two effects that prevent the degree of polarization to reach 100% in a crossedundulator SASE FEL. First, there is relative slippage between Ex and Ey in the second\n10\n\n\f1\n\n| gxy |\n\n0.8\n0.6\n0.4\n0.2\n0\n0\n\n5\n\n10\n\n15\nL1 (m)\n\n20\n\n25\n\nFIG. 3: (color) Amplitude of the time correlation |gxy | from the 1D simulations (black star) and\nfrom Eq. (23) (red solid curve). The degree of polarization is equal to |gxy | when hPx i = hPx i. For\ncomparison, the blue dashed curve shows an estimate of the polarization by Eq. (24) (see text for\nmore details).\n\nundulator. Since Ex stops interacting with the electron beam after the first undulator, the\ngroup velocity of Ex is the speed of light c. However, the group velocity of Ey is slower than\nc because it is generated by the micro-bunched beam that travels at the average longitudinal\nvelocity βk c. In fact, 1D simulations indicate that the group velocity of Ey is almost the\nsame as that of the electrons within the short second undulator section. (This numerical\nresult is also confirmed in 3D simulations to be discussed in the next section.) To estimate\nthe slippage effect, we take Ey (t) ≈ Ex (t − τ ) with cτ = L2 (1 − βk ) and apply the first-order\ntime correlation function of the SASE field to estimate |gxy |:\n\u0013\n\u0012\nπτ 2\n(24)\ng(τ ) = exp − 2 ,\n2τc\n√\nwhere τc = π/σω is the coherence time [20], and σω is given by Eq. (22). Equation (24)\nyields the blue dashed curve shown in Fig. 3, which indicates that the slippage effect only\naccounts for about a half of the depolarization in the crossed undulator. A careful examination of the intensity profile between Ex and Ey shows a visible difference from a simple\ntime delay (see Fig. 4 for a 3D example). This accounts for the additional depolarization\neffect in a crossed undulator SASE FEL.\n\n11\n\n\fB.\n\n3D Discussions\n\nA remarkable feature of a SASE FEL is its transverse coherence. At a sufficiently high\ngain, a single transverse mode with the largest growth rate will dominate over all other\ntransverse modes for a typical SASE FEL. Thus, we expect the previous 1D analysis still\napplies to 3D situations in the high gain limit, with the maximum polarization obtainable at\nthe end of the exponential growth regime. Since the length of the second undulator is short,\nthe diffraction effects for the free-propagating Ex in the x-ray wavelength regime is expected\nto be small. Thus, the 3D effects such as emittance and diffraction do not play significant\nroles in determining the degree of polarization for a crossed undulator SASE FEL.\nWe use the 3D FEL code GENESIS 1.3 [21] to check these expectations. The electron\nbeam is dumped at the end of the first undulator and is used to generate Ey in the second\nundulator. Ex propagates in the same length of the second undulator but without any\nundulator magnetic field. We use the same soft x-ray FEL example listed in Table I as the\n1D case but with a relative energy spread of 0.023%, which roughly corresponds to the LCLS\nsoft x-ray parameters. The length of the first undulator is chosen to be 23 m and is about 3 m\nbefore the saturation point. A 2-m short second undulator is necessary to produce the same\nradiation power for the vertical field (see Fig. 4). The 3D power gain length corresponding to\nthese parameters is L3D\nG = 1.48 m, so Eq. (13) approximately holds in this 3D case. We use\nthe on-axis far-field radiation intensity and phase from GENESIS simulations to calculate\nthe time correlation between Ex and Ey of Eq. (17). Instead of performing many statistical\nruns for the ensemble average, we average the result over hundreds of intensity spikes within\nthe radiation pulse in order to save on simulation effort. The amplitude of the x-y correlation\nfrom this 3D calculation is 87%, very close to the 1D prediction. Figure 4 shows the central\nsection of the simulated power profiles Px and Py at the end of the second undulator. A\nsmall time delay due to the slippage effect and a somewhat different temporal structures\nbetween Px and Py are the main depolarization effects, as discussed in the previous section.\n\nV.\n\nCONCLUSIONS\n\nThe statistical analysis presented in this paper shows that the crossed-planar undulator\nis an effective method for polarization control in a SASE FEL. To optimize the degree of\n\n12\n\n\f1.4\nPx\n\n1.2\n\nPy\n\nPower ( GW )\n\n1\n0.8\n0.6\n0.4\n0.2\n0\n\n−15\n\n−10\n\n−5\n\n0\nt ( fs )\n\n5\n\n10\n\n15\n\nFIG. 4: (color) GENESIS simulated power profiles of the horizontal field (blue dashed curve) and\nthe vertical field (red solid curve) at the end of the second undulator, bunch head at left.\n\npolarization, the first undulator should operate at the end of the exponential growth regime,\nwhile in order to generate circularly polarized x-rays, the second undulator should be about\n1.3 times the power gain length. The maximum degree of polarization is over 80% from both\ntheory and simulations. If fast pulsed magnets are employed in the phase shifter chicane, the\nrelative phase between the two radiation components from the crossed undulator can vary at\nhundreds of Hz, hence enabling fast polarization switching for many scientific applications.\n\nVI.\n\nACKNOWLEDGMENTS\n\nWe thank P. Emma, J. Hastings, and K.-J. Kim for many useful discussions. Special\nthanks to K. Bane for a careful reading of the manuscript and for his comments. This work\nwas supported by Department of Energy Contract No. DE-AC02-76SF00515.\n\n[1] Linac Coherent Light Source Conceptual Design Report, SLAC-R-593, SLAC (2002).\n[2] TESLA Technical Design Report, TESLA FEL 2002-09, DESY (2002).\n[3] SPring-8 Compact SASE Source Conceptual Design Report, http://www-xfel.spring8.or.jp\n(2005).\n[4] S. Sasaki, Nucl. Instrum. Methods A 347, 83-86 (1994).\n[5] K.-J Kim, Nucl. Instrum. Methods A 219, 425 (1984).\n\n13\n\n\f[6] K.-J. Kim, Nucl. Instrum. Methods A 445, 329 (2000).\n[7] J. Bahrdt, A. Gaupp, W. Gudat, M. Mast, K. Molter, W. B Peatman, M. Scheer, Th. Schroeter\nand Ch. Wang, Rev. Sci. Instrum. 63, 339 (1992).\n[8] J. Bahrdt, private communication.\n[9] Y.K. Wu, N.A. Vinokurov, S. Mikhailov, J. Li and V. Popov, Phys. Rev. Lett. 96, 224801\n(2006).\n[10] K.-J Kim, Nucl. Instrum. Methods A 250, 396 (1986).\n[11] J. -M. Wang and L. -H. Yu, ibid, 484 (1986).\n[12] R. Bonifacio, C. Pellegrini and L.M. Narducci, Opt. Commun. 50, 373 (1984).\n[13] Y. Ding, P. Emma, Z. Huang and V. Kumar, Phys. Rev. ST Accel. Beams 9, 070702 (2006).\n[14] L.H. Yu, Phys. Rev. A 44, 5178 (1991).\n[15] M. Born and E. Wolf, Principles of Optics (Cambridge Universtiy Press, 7th ed., 1999).\n[16] J. Goodman, Statistical Optics (Wiley, 2000).\n[17] R. Bonifacio, B.W.J. McNeil, and P. Pierini, Phys. Rev. A 40, 4467 (1989).\n[18] C. Penman and B.W.J. McNeil, Opt. Commun. 90, 82 (1992).\n[19] W.M. Fawley, Phys. Rev. ST Accel. Beams 5, 070701 (2002).\n[20] E.L. Saldin, E.A. Schneidmiller and M.V. Yurkov, Opt. Commun. 148, 383 (1998).\n[21] S. Reiche, Nucl. Instrum. Methods A 429, 243 (1999).\n\n14\n\n\f"}