{"id": "http://arxiv.org/abs/1108.1597v1", "guidislink": true, "updated": "2011-08-08T02:09:26Z", "updated_parsed": [2011, 8, 8, 2, 9, 26, 0, 220, 0], "published": "2011-08-08T02:09:26Z", "published_parsed": [2011, 8, 8, 2, 9, 26, 0, 220, 0], "title": "Evolving network models under a dynamic growth rule", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.0400%2C1108.4992%2C1108.0559%2C1108.5639%2C1108.4184%2C1108.3537%2C1108.5580%2C1108.3512%2C1108.0510%2C1108.2544%2C1108.2033%2C1108.1481%2C1108.6163%2C1108.1152%2C1108.3062%2C1108.3064%2C1108.5281%2C1108.2058%2C1108.5683%2C1108.1681%2C1108.0578%2C1108.5370%2C1108.4218%2C1108.2888%2C1108.2530%2C1108.3070%2C1108.4796%2C1108.2312%2C1108.5753%2C1108.1480%2C1108.4306%2C1108.2983%2C1108.0283%2C1108.6302%2C1108.0525%2C1108.4505%2C1108.4854%2C1108.1879%2C1108.4488%2C1108.3128%2C1108.4261%2C1108.2209%2C1108.3526%2C1108.0819%2C1108.3489%2C1108.1843%2C1108.2449%2C1108.2066%2C1108.2747%2C1108.1567%2C1108.5396%2C1108.3081%2C1108.0340%2C1108.5889%2C1108.3437%2C1108.5857%2C1108.2820%2C1108.6231%2C1108.5016%2C1108.3372%2C1108.0166%2C1108.1309%2C1108.1850%2C1108.2194%2C1108.2968%2C1108.4117%2C1108.4705%2C1108.5560%2C1108.5525%2C1108.5444%2C1108.4789%2C1108.1702%2C1108.1597%2C1108.6129%2C1108.4181%2C1108.3155%2C1108.5070%2C1108.1492%2C1108.1721%2C1108.1404%2C1108.4496%2C1108.5876%2C1108.3506%2C1108.4383%2C1108.0513%2C1108.3071%2C1108.2974%2C1108.3102%2C1108.5614%2C1108.0137%2C1108.1809%2C1108.0668%2C1108.2319%2C1108.4663%2C1108.0778%2C1108.0103%2C1108.2928%2C1108.4474%2C1108.5146%2C1108.5226%2C1108.3166&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Evolving network models under a dynamic growth rule"}, "summary": "Evolving network models under a dynamic growth rule which comprises the\naddition and deletion of nodes are investigated. By adding a node with a\nprobability $P_a$ or deleting a node with the probability $P_d=1-P_a$ at each\ntime step, where $P_a$ and $P_d$ are determined by the Logistic population\nequation, topological properties of networks are studied. All the fat-tailed\ndegree distributions observed in real systems are obtained, giving the evidence\nthat the mechanism of addition and deletion can lead to the diversity of degree\ndistribution of real systems. Moreover, it is found that the networks exhibit\nnonstationary degree distributions, changing from the power-law to the\nexponential one or from the exponential to the Gaussian one. These results can\nbe expected to shed some light on the formation and evolution of real complex\nreal-world networks.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.0400%2C1108.4992%2C1108.0559%2C1108.5639%2C1108.4184%2C1108.3537%2C1108.5580%2C1108.3512%2C1108.0510%2C1108.2544%2C1108.2033%2C1108.1481%2C1108.6163%2C1108.1152%2C1108.3062%2C1108.3064%2C1108.5281%2C1108.2058%2C1108.5683%2C1108.1681%2C1108.0578%2C1108.5370%2C1108.4218%2C1108.2888%2C1108.2530%2C1108.3070%2C1108.4796%2C1108.2312%2C1108.5753%2C1108.1480%2C1108.4306%2C1108.2983%2C1108.0283%2C1108.6302%2C1108.0525%2C1108.4505%2C1108.4854%2C1108.1879%2C1108.4488%2C1108.3128%2C1108.4261%2C1108.2209%2C1108.3526%2C1108.0819%2C1108.3489%2C1108.1843%2C1108.2449%2C1108.2066%2C1108.2747%2C1108.1567%2C1108.5396%2C1108.3081%2C1108.0340%2C1108.5889%2C1108.3437%2C1108.5857%2C1108.2820%2C1108.6231%2C1108.5016%2C1108.3372%2C1108.0166%2C1108.1309%2C1108.1850%2C1108.2194%2C1108.2968%2C1108.4117%2C1108.4705%2C1108.5560%2C1108.5525%2C1108.5444%2C1108.4789%2C1108.1702%2C1108.1597%2C1108.6129%2C1108.4181%2C1108.3155%2C1108.5070%2C1108.1492%2C1108.1721%2C1108.1404%2C1108.4496%2C1108.5876%2C1108.3506%2C1108.4383%2C1108.0513%2C1108.3071%2C1108.2974%2C1108.3102%2C1108.5614%2C1108.0137%2C1108.1809%2C1108.0668%2C1108.2319%2C1108.4663%2C1108.0778%2C1108.0103%2C1108.2928%2C1108.4474%2C1108.5146%2C1108.5226%2C1108.3166&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Evolving network models under a dynamic growth rule which comprises the\naddition and deletion of nodes are investigated. By adding a node with a\nprobability $P_a$ or deleting a node with the probability $P_d=1-P_a$ at each\ntime step, where $P_a$ and $P_d$ are determined by the Logistic population\nequation, topological properties of networks are studied. All the fat-tailed\ndegree distributions observed in real systems are obtained, giving the evidence\nthat the mechanism of addition and deletion can lead to the diversity of degree\ndistribution of real systems. Moreover, it is found that the networks exhibit\nnonstationary degree distributions, changing from the power-law to the\nexponential one or from the exponential to the Gaussian one. These results can\nbe expected to shed some light on the formation and evolution of real complex\nreal-world networks."}, "authors": ["Ke Deng", "Ke Hu", "Yi Tang"], "author_detail": {"name": "Yi Tang"}, "author": "Yi Tang", "arxiv_comment": "5 pages, 1 figure", "links": [{"href": "http://arxiv.org/abs/1108.1597v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1108.1597v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.soc-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.soc-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cs.SI", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1108.1597v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1108.1597v1", "journal_reference": null, "doi": null, "fulltext": "Evolving network models under a dynamic growth rule\nKe Deng,1, 2 Ke Hu,2 and Yi Tang2\n\narXiv:1108.1597v1 [physics.soc-ph] 8 Aug 2011\n\n2\n\n1\nDepartment of Physics, Jishou University, Jishou Hunan, 416000, China\nDepartment of Physics, Xiangtan University, Xiangtan Hunan 411105, China\n(Dated: March 17, 2018)\n\nEvolving network models under a dynamic growth rule which comprises the addition and deletion\nof nodes are investigated. By adding a node with a probability Pa or deleting a node with the\nprobability Pd = 1−Pa at each time step, where Pa and Pd are determined by the Logistic population\nequation, topological properties of networks are studied. All the fat-tailed degree distributions\nobserved in real systems are obtained, giving the evidence that the mechanism of addition and\ndeletion can lead to the diversity of degree distribution of real systems. Moreover, it is found\nthat the networks exhibit nonstationary degree distributions, changing from the power-law to the\nexponential one or from the exponential to the Gaussian one. These results can be expected to shed\nsome light on the formation and evolution of real complex real-world networks.\nPACS numbers: 87.23.Kg, 89.75.Fb, 05.10.-a, 89.75.Hc\n\nI.\n\nINTRODUCTION\n\nConsiderable interest is focused on complex networks\ncurrently due to their potential to describe many systems\nin nature and society [1, 2]. Theoretical models are developed to reproduce topological properties of these systems [3–5]. The recently observed scale-free (SF) property [5] has made the scientists to realize that static network models [3, 4] do not provide appropriate descriptions to real systems which essentially keep growing with\ntime [1, 2]. Barabási and Albert [5] proposed a simple\nevolving network model (BA model) to explain such SF\nproperty. In this model, the growing nature of real systems is captured by a BA-type growth rule. According\nto this rule, one node is added into the network at each\ntime step, intending to mimic the growing process of real\nsystems. Another ingredient in this model is the mechanism of preferential attachment (PA), which assumes that\nnewly added nodes are attached preferentially to nodes\nwith higher degrees [6]. Based on the BA-type growth\nrule, many evolving network models are introduced [1, 2].\nThe modeling framework of network evolution is formed.\nAmong the many quantities proposed to characterize\ntopological properties of networks[1, 2], the degree distribution p(k), which gives the probability that a node\nin the network possesses k edges, is of particular importance. The study of networks has undergone a transition from the investigation of static network models with\nPoisson degree distribution [3, 4] to the explanation of\nreal systems with various fat-tailed degree distributions\n(FTDDs) [1, 2]. It was found that many real-world networks are characterized by the power-law degree distribution (PLDD) [5], as well as the exponential degree distribution (EDD) [7]. Some more exhaustive experiment\nreveals that, in addition to the PLDD and the EDD,\nthe truncated power-law degree distribution (TPLDD)\n[8, 9] and the truncated exponential degree distribution\n(TEDD) [10] are also observed. Furthermore, in Ref. [8],\nthe Gaussian degree distribution (GDD) was reported as\nwell.\n\nOne theoretical challenge has been to explain the origin\nof these observed FTDDs. In the BA model, the fact is\nrevealed that growing networks with PA yield the PLDD\n[5]. In addition, growing networks without PA were also\nstudied in the random evolving network model (REN\nmodel) [11, 12], in which networks grow by the growth\nrule of BA-type, while the newly added nodes connect to\nrandomly chosen existing ones. In this model, the EDD\nwas obtained. In order to explain those observed degree\ndistributions which are neither strict power-law nor strict\nexponential [8–10], many other mechanisms were added\ninto this two models, such as the mechanism of adding\nand rewiring edges between existing nodes [13–16], the\nmechanism of ageing and cost [8], as well as the mechanism of information filtering [9]. These more specialized\nmodels indeed created the TPLDD or the EDD in some\nparameter regimes. However, relatively lesser attention\nis paid to systematical studies on the origin of the diversity of the observed FTDDs, with some recent exceptions\n[8, 17, 18].\nThe BA-type growth rule gives a somewhat simplified\ndescription to the evolution of real system. As a matter\nof fact, in real growing networks, there are constant addition of new elements, but accompanied by permanent\nremoval of old elements (deletion of nodes) [19–21]. The\nscaling behavior of growing networks has already been\nshown to be strongly affected when the deletion of node\nis taken into account [22–25]. In a recent work [17], we\nproposed a new type of network growth rule which comprises the addition and deletion (AD) of nodes. Based\non such AD growth rule, by adding a node with a probability Pa or deleting a node with probability Pd = 1 − Pa\nat each time step, topological properties of growing networks with and without PA are studied, respectively. In\nref. [17], we considered a simple case: Pa and Pd were\ntreated as constants. (Pa is an adjustable parameter in\nthe model.) All the observed FTDDs of real systems were\nobtained in the model, indicating that the mechanism of\nAD can lead to the diversity of FTDD in real systems.\nThe AD growth rule introduced in [17] gives a more de-\n\n\f2\ntailed description to the evolution of real systems. However, this evolution can be even more complex. For example, as real systems grow, limited resources will cause\ninterelement competition which, in turn, has a tendency\nto retard the growth of these systems. Such competition\nis intensified when the number of element is increased.\nAs a result, growth rate of real systems usually decreases\nwith the increase of the system size, exhibiting the socalled density-dependent growth [26]. In fact, competitive dynamics has been found to dominate the evolution\nof variety of social [27], biological [28] and economic [29]\nnetwork systems. Thus, with respect to the AD growth\nrule, to be more realistic, Pa should be a decreasing function of the number of nodes in the network, rather than\na constant [17]. In this paper, we introduce the Logistic population equation [26] into the AD growth rule.\nAs a result, the probabilities of addition (deletion) becomes a decreasing (increasing) function of the network\nsize. Based on this dynamical AD growth rule, growing networks models with and without PA are investigated, respectively. In the present models, networks exhibit the density-dependent growth and all the observed\nFTDDs are created. Moreover, it is found that the networks exhibit nonstationary degree distributions, changing from power-law to exponential one or from exponential to Gaussian one. These results can be expected to\nshed some light on the formation and evolution of real\ncomplex real-world networks.\n\nII.\n\nand\nPa + Pd = 1,\nwhich yield\nPa (t) =\n\nK\na\n=\na + cN (t)\nK + N (t)\n\n(4)\n\nPd (t) =\n\ncN (t)\nN (t)\n=\n.\na + cN (t)\nK + N (t)\n\n(5)\n\nand\n\nWhere N (t) stands for the number of nodes at time t and\nK is the parameter which denotes the maximum nodes\nin the network.\nThen the Logistic AD model can be defined as follows:\nWe start from m0 isolated nodes, which act as the nuclear of a growing network. At each time step, either a\nnew node is added to the network with probability Pa or\na randomly selected old node is removed from the network with probability Pd = 1 − Pa , where Pa and Pd are\ndetermined by Eq. (4) and Eq. (5), respectively.\nWhen a new node is added to the network, there are\nstill two ways for it to attach to the existing nodes in the\nnetwork. One way is to randomly choose m nodes to set\nup connections (growing network without PA) [11, 12],\nand the other way is to preferentially select m nodes to\nconnect by means of preferential probability in the BA\nmodel [5], which reads\n\nNETWORK MODELS WITH LOGISTIC AD\nGROWTH RULE\n\nThe Logistic equation [26] was proposed by Pierre Verhulst for the analysis of population competitive dynamics. Verhulst assumed that during the population growth,\nas a result of the competition for the limited resources,\nthe death rate per individual is a lineally increasing function of the number of population. Then the Logistic\nequation can be written as\ndN (t)\nN (t)\n= [a − cN (t)]N (t) = a[1 −\n]N (t) ,\ndt\nK\n\n(1)\n\nwhere N (t) denotes the number of population at time t;\na and c are constants; a is the birth rate per individual\nand cN (t) stands for the death rate per individual at\ntime t; K = a/c is called carrying capacity [30, 31] which\nrepresents the largest population the environment can\nsupport due to limited resources.\nA more realistic description to the real-network's evolution can be achieved by the introduction of such Logistic dynamics into the AD growth rule. To do this, we\nobtain the probability of addition Pa and the probability\nof deletion Pd by the following two equations\nPa\naN (t)\n=\nPd\ncN (t)2\n\n(2)\n\n(3)\n\nΠi = P\n\nki + 1\n,\nj (kj + 1)\n\n(6)\n\nwhere ki is the degree of the ith node (growing network\nwith PA). Here, we should note that in order to give\nchance for isolated nodes to receive a new edge we choose\nΠi proportional to ki + 1 [13].\nOne can find from Eq. (4) and Eq. (5) that when\nN (t) ≪ K, Pa (t) ≫ Pd (t). This means that the networks\ngrow rapidly at the initial stages of their evolution. In\nfact, in a Logistic model [26]:\n\u0015\n\u0014\ndN (t)\nK − N (t)\nN (t),\n(7)\n=a\ndt\nK\nwhen N (t) ≪ K,\ndN (t)\n≈ aN (t),\ndt\n\n(8)\n\nN (t) = C0 exp (at) ,\n\n(9)\n\nthe solution is:\n\nwhere C0 is a integral constant. Indeed, this kind of\nexponential growth has been observed in many newly\nemerged real-world networks, such as the World-WideWeb (WWW) and the Internet [19, 20]. This indicates\nthat the rapid growth of some real systems in their young\n\n\f3\nage is well described by the Logistic AD model. As N (t)\nincrease, Pa (t) decrease while Pd (t) increase, the growth\nof network is slowed down. In the limit of large t,\n\npower-law fit\nt=12000\nt=31000\nt=72000\n\n(10)\n\nt=150000\n\n10\n\nt=260000\nt=500000\nt=1000000\n\nP(k)\n\n1\nlim Pa (t) = lim Pd (t) = ,\nt→∞\nt→∞\n2\n\n-1\n\nand\n\nt=2000000\nexponential fit\n\n(11)\n\ni.e., the network reach a steady state and the number\nof nodes has the upper limit K. The above analysis\nimply that networks in the Logistic AD model exhibit\ndensity-dependent growth characterizing the evolution of\nmany real systems, not captured in most previous network models.\nWe investigated the degree distribution of the networks\nby extensive computer simulations. In the simulation,\nwe set m0 = m = 5 and K = 100000. Network is\nleft to evolve until the steady state is reached. Cumulative degree distributions of growing networks with and\nwithout PA at different time step are given in Fig. 1(a)\nand Fig. 1(b), respectively. We found that in the Logistic AD model, the networks exhibit nonstationary degree\ndistribution before the steady state is reached. This is\nillustrated in Fig. 1. For the growing network with PA,\nas time goes on, P (k) of the network undergos a process of transition, which can be roughly separated into\nseveral stages: (1) At the earlier stage of network evolution, i.e., when t ≤ 72000, the network exhibits various PLDDs with different power-law exponents. In addition, the exponent increases with time. Particularly,\nin the asymptotic cases of Pa being close to 1, the network is almost equivalent to the well-known BA model,\nthus it have PLDD with power-law exponents γ = 3. (2)\n72000 < t < 1000000. P (k) of the network is truncated\nby an exponential cutoff and the network exhibits the\nTPLDD during this stage. Generally, if a node needs\nto obtain the high degree, it must exists in network with\nenough long time. While, longer do the nodes live, higher\nis the probability that they are deleted. Moreover, with t\nincreasing, Pd increases. Thus the surviving probability\nof the nodes with high degrees is greatly reduced, and the\ndegree distribution evolves with time, gradually changing\nfrom a power-law form to a power-law with a exponential cutoff, then to a exponential one. (3) In the limit of\nlarge t, e.g., when t ≥ 1000000, the network shows a well\nshaped stationary EDD [see Fig. 1(a)]. Speciously, this\nasymptotic case seems to be a non-growing network (or\na very slowly growing one). The case of the preferential\nattachment on a non-growing network was considered in\nRef. [19] where it was found that P (k) is not stationary,\nchanging from a power-law type directly to is a Gaussian\none. On the other hand, for the growing network without\nPA, as time goes on, P (k) of the network exhibits a continuous transition from the EDD to a variety of TEDDs\nwhich prove to be a series of intermediate states, and in\nthe limit of large t, e.g., when t ≥ 1045700, the network\nexhibits a well shaped stationary GDD [see Fig. 1(b)].\n\n(a)\n-5\n\n10\n\n0\n\n1\n\n10\n\n2\n\n10\n\n3\n\n10\n\n10\n\nexponential fit\nt=13780\nt=50045\nt=86973\n\n-1\n\n10\n\nt=165728\nt=218474\nt=416298\n\nP(k)\n\nlim N (t) = K,\n\nt→∞\n\n-3\n\n10\n\nt=1045700\nt=2184780\nGauss fit\n-3\n\n10\n\n(b)\n-5\n\n10\n\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\n60\n\n70\n\n80\n\nk\n\nFIG. 1: (a) Cumulative degree distribution of the growing\nnetwork with PA, for different time steps t, in logarithmic\nscales. The dash line is power-law fit and the solid line is\nexponential fit. (b) Cumulative degree distribution of the\ngrowing network without PA, for different time steps t, in\nsemi-logarithmic scales. The dash line is exponential fit and\nthe solid line is Gaussian fit. Results in both (a) and (b) are\nbased on many independent realizations.\n\nThe results of Fig. 1 reveal a nonstationary behavior\nfor the degree distribution of real systems. During the\nevolution of these systems, various events take place on\ndifferent timescales. These events include, for instance,\nthe addition and deletion of nodes, the creating and\nrewiring of edges between existing nodes (internal edges),\nand so on. In general, the timescale on which a node\njoin or leave the network (the addition and deletion of\nnodes) may be much longer than the timescale on which\nother events take place. For example, in a social network, creating internal edges means that the individuals\nmake new friends, which happens on the timescale that\ncan be as short as hours or days. While the timescale on\nwhich individuals are born or die is typically some years\nor decades. So that our model, which is based on the\nmechanism of addition and deletion, gives the prediction\nof a long-run behavior of real systems. For this reason,\nthis kind of nonstationary FTDD of real systems, which\ncan be difficult to observe in a relatively short time interval, has been neglected in most previous studies [1, 19].\nHowever, in recent years, the Internet and the WWW is\n\n\f4\nin the initial and rapid growth stage of their evolutions.\nPerhaps, the observations for their degree distributions\nmight provide some clues for our results. The WWW at\nthe document level had grown at least five times larger\nduring the two years time delay between the first and\nlast web crawl, and the degree distributions obtained at\ndifferent time are reported to be of a power-law form\n[32–34]. The power-law exponent, though seems to be invariable for the in-degree distributions, has an increasing\ntendency with the sample size or time for the out-degree\ndistribution, changing from 2.45 in 1999 to 2.72 in 2000\n[32–34]. Another clue is refereed to the Internet on the\ninter-domain level. The degree distribution of the Internet is also of power-law form. The exponent, however,\nsuffer a little change from 2.15 in November 1997, to 2.16\nin April 1998, then to 2.20 in December 1998 [35]. In fact,\nit is hard to achieve this precision. One may estimate the\nvalue of the exponent using the highest degrees and the\nsystem's size [36]. Such estimations also confirm the reported values. For November 1977, we gets γ ≃ 2.22, for\nApril 1998, γ ≃ 2.24, and for December 1998, γ ≃ 2.26.\nOf course, exist additional factors (nonlinear PA [36] and\naccelerating growth of edges [37], etc.) that may change\nthese values. Finally, we are glad to point out that in a\nrecent work [14], such nonstationary degree distribution\nwas also reported when the creation of internal edges was\nconsidered in growing and static networks.\nIt is well known that the structure of complex networks has strong effects on their function. Therefor such\nneglect, at least in some case, may be dangerous because\nnetworks with different degree distribution act differently\nif we consider the dynamic processes taking place on\nthem. This is especially the case, for example, in the\nstrategy designing for the prevention of virus spreading\nor for the defense of network attacking [38–40]. Provided that, after some years, the WWW has gradually\nchanged into an exponential network, but is still treated\nas a scale-free one, what will happen to this network of\n\n[1] R. Albert and A.-L. Barabási, Rev. Mod. Phys. 74, 47\n(2002).\n[2] M. E. J. Newman, SIAM Review 45, 167 (2003).\n[3] P. Erdős and A. Rényi, Publ. Math. Debrecen 6, 290\n(1959); Publ. Math. Inst. Hungar. Acad. Sci. 5, 17 (1960);\nBull. Inst. Int. Statis. Tokyo 38, 343 (1961).\n[4] D. J. Watts and S. H. Strogatz, Nature (London) 393,\n440 (1998).\n[5] A.-L. Barabási and R. Albert, Science, 286, 509 (1999).\n[6] H. Jeong, Z. Néda, and A.-L. Barabási, Europhys. Lett.\n61, 567 (2003).\n[7] J. Camacho, R. Guimerà, and L. A. N. Amaral, Phys.\nRev. Lett. 88, 228102 (2002).\n[8] L. A. N. Amaral, A. Scala, M. Barthélémy, and H. E.\nStanley, Proc. Natl. Acad. Sci. U.S.A. 97, 11149 (2000).\n[9] S. Mossa, M. Barthélémy, H. E. Stanley, and L. A. N.\nAmaral, Phys. Rev. Lett. 88, 138701 (2002).\n[10] J. A. Dunne, R. J. Williams, and N. D. Martinez, Proc.\n\nhigh technological importance if it runs under the antivirus strategy designed for a scale-free network?\n\nIII.\n\nCONCLUSION\n\nIn summary, we have proposed a dynamic growth rule\nwhich comprises the addition and deletion of nodes in\nthe network. Based on this rule, by adding a node\nwith a probability Pa or deleting a node with probability Pd = 1 − Pa at each time step, topological properties\nof growing networks with and without PA are studied\nrespectively. The probabilities of addition and deletion\nare assumed to be determined by the Logistic population\nequation. In our model, networks exhibit the densitydependent growth which characterizes the evolution of\nvarious real systems, and all the observed degree distributions of real systems are created. Moreover, the networks exhibit nonstationary degree distributions, changing from power-law to exponential one or from exponential to Gaussian one. It is discussed that this kind of nonstationary behavior can be unconspicuous in real-world\nnetworks. The result indicates that the degree distribution of real systems, which has been believed to be\nstationary in most previous studies, may in fact be nonstationary.\n\nACKNOWLEDGMENTS\n\nThis work was supported by the Outstanding Young\nResearcher's Foundation of Hunan Province, China,\nGrant No. 03JJY1001, and by the Natural Science Foundation of Hunan Province, China, Grant No. 00JJY2072.\nThis work is also supported by the Foundation of Educational Committee of Hunan Province, china, Grant No.\n00C189 and No.01B019.\n\nNatl. Acad. Sci. U.S.A. 99, 12917 (2002).\n[11] D. S. Callaway et al., Phys. Rev. E 64, 041902 (2001).\n[12] A.-L. Barabási, R. Albert, and H. Jeong, Physica A 272,\n173 (1999).\n[13] R. Albert and A.-L. Barabási, Phys. Rev. Lett. 85, 5234\n(2000).\n[14] W. Jeżewski, Phys. Rev. E 66, 067102 (2002).\n[15] J. S. Kong and V. P. Roychowdhury, Phys. A (Amsterdam) 387, 3335 (2008).\n[16] S. Johnson, J. Marro, and J. Torres, J. Stat. Mech.\n(2010)P03003.\n[17] K. Deng and Y. Tang, Chin. Phys. Lett. 21, 1858 (2004).\n[18] Y. Gu and J. Sun, Phys. Lett. A 372, 4564 (2008).\n[19] K.-I. Goh, B. Kahng, and D. Kim, Phys. Rev. Lett. 88,\n108701 (2002).\n[20] Q. Chen et al., The origins of power laws in Internet\ntopologies revisited, in Proceedings of the 21st Annual\nJoint Conference of the IEEE Computer and Communi-\n\n\f5\ncations Societies, IEEE Computer Society (2002).\n[21] H.-Y. Shan and W.-P. Wang, Modeling of evolving knowledge network with node deletion, in Proceedings of the\n2nd International Workshop on Knowledge Discovery\nand Data Mining, 219(2009).\n[22] S. N. Dorogovtsev and J. F. F. Mendes, Phys. Rev. E 63,\n056125 (2001).\n[23] N. Sarshar and V. Roychowdhury, Phys. Rev. E 69,\n026101 (2004).\n[24] K. Deng, H. Zhao, and D. Li, Phys. A 379, 714 (2007).\n[25] D. Juher and J. Saldaña, Phys. Rev. E 83, 016110 (2011).\n[26] P. F. Verhulst, Corresp. Math. Phys. 10, 113 (1838).\n[27] M. Anghel, Z. Toroczkai, K. E. Bassler, and G. Korniss,\nPhys. Rev. Lett. 92, 058701 (2004).\n[28] D. Chowdhury, D. Stauffer, and A. Kunwar, Phys. Rev.\nLett. 90, 068101 (2003).\n[29] A. Cavagna, J. P. Garrahan, I. Giardina, and D. Sherrington, Phys. Rev. Lett. 83, 4429 (1999).\n[30] J. D. Murray, Mathematical Biology (Springer-Verlag,\nBerlin, 1993), Biomathematics Vol. 19.\n[31] J. M. Smith, Models in Ecology (Cambridge University\nPress, Cambridge, 1974).\n\n[32] R. Albert, H. Jeong and A.-L. Barabási, Nature 401, 130\n(1999).\n[33] R. Kumar, P. Raghavan, S. Rajalopagan, and A.\nTomkins, Extracting large-scale knowledge basis from the\nWeb, in Proceedings of the 9th ACM Symposium on Principles of Database Systems, 1 (1999).\n[34] A. Broder, R. Kumar, F. Maghoul, P. Raghavan, S. Rajalopagan, R. Stata, A. Tomkins, and J. Wiener, Comput. Netw. 33, 309 (2000).\n[35] M. Faloutsos, P. Faloutsos, and C. Faloutsos, Comput.\nCommun. Rev. 29, 251 (1999).\n[36] P. L. Krapivsky, S. Redner, and F. Leyvraz, Phys. Rev.\nLett. 85, 4629 (2000).\n[37] S. N. Dorogovtsev and J. F. F. Mendes, Phys. Rev. E 63,\n025101(R)(2001).\n[38] R. Pastor-Satorras and A. Vespignani, Phys. Rev. Lett.\n86, 3200 (2001); Phys. Rev. E 63, 066117 (2001).\n[39] R. Albert, H. Jeong, and A.-L. Barabási, Nature (London) 406, 378 (2000).\n[40] Z. Liu, Y. C. Lai, and N. Ye, Phys. Rev. E 66, 036112\n(2002).\n\n\f"}