{"id": "http://arxiv.org/abs/0911.1279v2", "guidislink": true, "updated": "2009-12-24T16:00:35Z", "updated_parsed": [2009, 12, 24, 16, 0, 35, 3, 358, 0], "published": "2009-11-06T15:44:50Z", "published_parsed": [2009, 11, 6, 15, 44, 50, 4, 310, 0], "title": "Morphologies of local Lyman break galaxy analogs II: A Comparison with\n  galaxies at z=2-4 in ACS and WFC3 images of the Hubble Ultra Deep Field", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0911.1005%2C0911.3496%2C0911.4603%2C0911.0523%2C0911.1583%2C0911.2139%2C0911.3001%2C0911.3770%2C0911.1218%2C0911.5475%2C0911.2751%2C0911.0960%2C0911.1519%2C0911.1294%2C0911.5388%2C0911.4876%2C0911.4574%2C0911.4010%2C0911.4832%2C0911.0059%2C0911.0482%2C0911.1620%2C0911.3455%2C0911.1008%2C0911.3909%2C0911.5523%2C0911.2551%2C0911.0603%2C0911.3673%2C0911.3803%2C0911.4196%2C0911.0369%2C0911.2539%2C0911.3070%2C0911.5268%2C0911.1072%2C0911.0831%2C0911.3624%2C0911.3448%2C0911.1643%2C0911.2599%2C0911.1369%2C0911.1279%2C0911.1817%2C0911.0745%2C0911.0649%2C0911.2531%2C0911.1430%2C0911.4006%2C0911.0480%2C0911.2368%2C0911.4166%2C0911.0581%2C0911.2122%2C0911.2757%2C0911.4983%2C0911.4724%2C0911.3573%2C0911.1141%2C0911.1361%2C0911.3936%2C0911.3200%2C0911.1213%2C0911.4143%2C0911.1930%2C0911.2118%2C0911.4639%2C0911.1339%2C0911.0266%2C0911.4024%2C0911.3231%2C0911.0690%2C0911.3399%2C0911.1868%2C0911.0685%2C0911.3118%2C0911.3945%2C0911.4467%2C0911.4241%2C0911.0452%2C0911.5569%2C0911.3865%2C0911.1762%2C0911.5259%2C0911.0359%2C0911.4900%2C0911.5248%2C0911.5056%2C0911.3764%2C0911.5448%2C0911.3300%2C0911.3492%2C0911.4678%2C0911.2111%2C0911.1417%2C0911.0958%2C0911.0062%2C0911.2339%2C0911.1206%2C0911.4458%2C0911.2606&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Morphologies of local Lyman break galaxy analogs II: A Comparison with\n  galaxies at z=2-4 in ACS and WFC3 images of the Hubble Ultra Deep Field"}, "summary": "Lyman break galaxies (LBGs) display a range in structures (from\nsingle/compact to clumpy/extended) that is different from typical local\nstar-forming galaxies. Recently, we have introduced a sample of rare, nearby\n(z<0.3) starbursts that appear to be good analogs of LBGs. These \"Lyman Break\nAnalogs\" (LBAs) provide an excellent training set for understanding starbursts\nat different redshifts. We present an application of this by comparing the\nrest-frame UV/optical morphologies of 30 LBAs with those of sBzK galaxies at\nz~2, and LBGs at z~3-4 in the HUDF. The UV/optical colors and sizes of LBAs and\nLBGs are very similar, while the BzK galaxies are somewhat redder and larger.\nThere is significant overlap between the morphologies (G, C, A and M_20) of the\nlocal and high-z samples, although the latter are somewhat less concentrated\nand clumpier. We find that in the majority of LBAs the starbursts appear to be\ntriggered by interactions/mergers. When the images of the LBAs are degraded to\nthe same sensitivity and resolution as the images of LBGs and BzK galaxies,\nthese relatively faint asymmetric features are no longer detectable. This\neffect is particularly severe in the rest-frame UV. It has been suggested that\nhigh-z galaxies experience intense bursts unlike anything seen locally,\npossibly due to cold flows and instabilities. In part, this is based on the\nfact that the majority (~70%) of LBGs do not show morphological signatures of\nmergers. Our results suggest that this evidence is insufficient, since a large\nfraction of such signatures would likely have been missed in current\nobservations of z>2 galaxies. This leaves open the possibility that clumpy\naccretion and mergers remain important in driving the evolution of these\nstarbursts, together with rapid gas accretion through other means.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0911.1005%2C0911.3496%2C0911.4603%2C0911.0523%2C0911.1583%2C0911.2139%2C0911.3001%2C0911.3770%2C0911.1218%2C0911.5475%2C0911.2751%2C0911.0960%2C0911.1519%2C0911.1294%2C0911.5388%2C0911.4876%2C0911.4574%2C0911.4010%2C0911.4832%2C0911.0059%2C0911.0482%2C0911.1620%2C0911.3455%2C0911.1008%2C0911.3909%2C0911.5523%2C0911.2551%2C0911.0603%2C0911.3673%2C0911.3803%2C0911.4196%2C0911.0369%2C0911.2539%2C0911.3070%2C0911.5268%2C0911.1072%2C0911.0831%2C0911.3624%2C0911.3448%2C0911.1643%2C0911.2599%2C0911.1369%2C0911.1279%2C0911.1817%2C0911.0745%2C0911.0649%2C0911.2531%2C0911.1430%2C0911.4006%2C0911.0480%2C0911.2368%2C0911.4166%2C0911.0581%2C0911.2122%2C0911.2757%2C0911.4983%2C0911.4724%2C0911.3573%2C0911.1141%2C0911.1361%2C0911.3936%2C0911.3200%2C0911.1213%2C0911.4143%2C0911.1930%2C0911.2118%2C0911.4639%2C0911.1339%2C0911.0266%2C0911.4024%2C0911.3231%2C0911.0690%2C0911.3399%2C0911.1868%2C0911.0685%2C0911.3118%2C0911.3945%2C0911.4467%2C0911.4241%2C0911.0452%2C0911.5569%2C0911.3865%2C0911.1762%2C0911.5259%2C0911.0359%2C0911.4900%2C0911.5248%2C0911.5056%2C0911.3764%2C0911.5448%2C0911.3300%2C0911.3492%2C0911.4678%2C0911.2111%2C0911.1417%2C0911.0958%2C0911.0062%2C0911.2339%2C0911.1206%2C0911.4458%2C0911.2606&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Lyman break galaxies (LBGs) display a range in structures (from\nsingle/compact to clumpy/extended) that is different from typical local\nstar-forming galaxies. Recently, we have introduced a sample of rare, nearby\n(z<0.3) starbursts that appear to be good analogs of LBGs. These \"Lyman Break\nAnalogs\" (LBAs) provide an excellent training set for understanding starbursts\nat different redshifts. We present an application of this by comparing the\nrest-frame UV/optical morphologies of 30 LBAs with those of sBzK galaxies at\nz~2, and LBGs at z~3-4 in the HUDF. The UV/optical colors and sizes of LBAs and\nLBGs are very similar, while the BzK galaxies are somewhat redder and larger.\nThere is significant overlap between the morphologies (G, C, A and M_20) of the\nlocal and high-z samples, although the latter are somewhat less concentrated\nand clumpier. We find that in the majority of LBAs the starbursts appear to be\ntriggered by interactions/mergers. When the images of the LBAs are degraded to\nthe same sensitivity and resolution as the images of LBGs and BzK galaxies,\nthese relatively faint asymmetric features are no longer detectable. This\neffect is particularly severe in the rest-frame UV. It has been suggested that\nhigh-z galaxies experience intense bursts unlike anything seen locally,\npossibly due to cold flows and instabilities. In part, this is based on the\nfact that the majority (~70%) of LBGs do not show morphological signatures of\nmergers. Our results suggest that this evidence is insufficient, since a large\nfraction of such signatures would likely have been missed in current\nobservations of z>2 galaxies. This leaves open the possibility that clumpy\naccretion and mergers remain important in driving the evolution of these\nstarbursts, together with rapid gas accretion through other means."}, "authors": ["R. A. Overzier", "T. M. Heckman", "D. Schiminovich", "A. Basu-Zych", "T. Goncalves", "D. C. Martin", "R. M. Rich"], "author_detail": {"name": "R. M. Rich"}, "author": "R. M. Rich", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0004-637X/710/2/979", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0911.1279v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0911.1279v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "ApJ, In Press (14 pages, 7 figures; minor changes since v1). For\n  background material, see http://www.mpa-garching.mpg.de/~overzier/index.html", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0911.1279v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0911.1279v2", "journal_reference": "Astrophys.J.710:979-991,2010", "doi": "10.1088/0004-637X/710/2/979", "fulltext": "Draft version October 30, 2018\nPreprint typeset using LATEX style emulateapj v. 08/22/09\n\nMORPHOLOGIES OF LOCAL LYMAN BREAK GALAXY ANALOGS II: A COMPARISON WITH GALAXIES\nAT Z ≃ 2 − 4 IN ACS AND WFC3 IMAGES OF THE HUBBLE ULTRA DEEP FIELD\nR. A. Overzier1 , T. M. Heckman2 , D. Schiminovich3 , A. Basu-Zych4 , T. Gonçalves5 , D. C. Martin5 & R. M. Rich6\n\narXiv:0911.1279v2 [astro-ph.CO] 24 Dec 2009\n\nDraft version October 30, 2018\n\nABSTRACT\nPrevious work has shown that Lyman break galaxies (LBGs) display a range in structures (from single\nand compact to more clumpy and extended) that is different from typical local star-forming galaxies.\nRecently, we have introduced a sample of rare, nearby (z < 0.3) starburst galaxies that appear to\nbe good analogs of LBGs. These \"Lyman Break Analogs\" (LBAs) provide an excellent training set\nfor understanding starbursts at different redshifts. We present an application of this by comparing\nthe rest-frame UV and optical morphologies of 30 LBAs with those of galaxies at z ∼ 2 − 4 in the\nHubble Ultra Deep Field. We compare LBAs with star-forming sBzK galaxies at z ∼ 2, and LBGs at\nz ∼ 3 − 4 at the same intrinsic UV luminosity (LUV & 0.3L∗z=3 ). The UV/optical colors and sizes of\nLBAs and LBGs are very similar, while the BzK galaxies are somewhat redder and larger. LBAs lie\nalong a mass-metallicity relation that is offset from that of typical local galaxies, but similar to that\nseen at z ∼ 2. There is significant overlap between the morphologies (G, C, A and M20 ) of the local\nand high redshift samples, although the high redshift samples are somewhat less concentrated and\nclumpier than the LBAs. Based on their highly asymmetric morphologies, we find that in the majority\nof LBAs the starbursts appear to be triggered by interactions/mergers. When the images of the LBAs\nare degraded to the same sensitivity and linear resolution as the images of LBGs and BzK galaxies, we\nfind that these relatively faint asymmetric features are no longer detectable. This effect is particularly\nsevere in the rest-frame ultraviolet. It has been suggested that high redshift galaxies experience intense\nbursts unlike anything seen in the local universe, possibly due to cold flows and instabilities. In part,\nthis is based on the fact that the majority (∼70%) of LBGs do not show morphological signatures of\ninteractions or mergers. Our results suggest that this evidence is insufficient, since a large fraction\nof such signatures would likely have been missed in current observations of galaxies at z ∼ 2 − 4.\nThis leaves open the possibility that clumpy accretion and mergers remain important in driving the\nevolution of these starbursts, together with rapid gas accretion through other means.\nSubject headings: cosmology: observations – early universe – galaxies: high-redshift – galaxies: starburst\n1. INTRODUCTION\n\nOne of the key tasks in galaxy evolution is to understand how the young, forming galaxies observed\nat high redshift relate to the well-defined Hubble sequence observed at the present epoch. The study\nof sizes and morphologies of large samples of galaxies\nas a function of redshift would not have been possible without the Hubble Space Telescope (HST). Studies of the rest-frame UV sizes of Lyman Break Galaxies (LBGs) at z ∼ 3 − 7 indicate that they are\nmostly very compact objects with a single core (r1/2 ∼\n0.7 − 1.5 kpc), and that the size distribution develops a tail of larger sized objects of up to several\nElectronic address: overzier@mpa-garching.mpg.de\n1 Max-Planck-Institut für Astrophysik, D-85748 Garching, Germany.\n2 Department of Physics and Astronomy, The Johns Hopkins\nUniversity, 3400 North Charles Street, Baltimore, MD 21218.\n3 Department of Astronomy, Columbia University, MC 2457, 550\nWest 120th Street, New York, NY 10027.\n4 NASA Goddard Space Flight Center, Laboratory for X-ray Astrophysics, Greenbelt, MD 20771, USA.\n5 California Institute of Technology, MC 405-47, 1200 East California Boulevard, Pasadena, CA 91125.\n6 Deptartment of Physics and Astronomy, Division of Astronomy and Astrophysics, University of California, Los Angeles, CA\n90095-1562, USA.\n\nkpc towards lower redshifts (e.g. Bouwens et al. 2004;\nFerguson et al. 2004; Papovich et al. 2005; Oesch et al.\n2009b). Morphological studies performed by means\nof (a combination of) visual classifications, quantitative morphological parameters and two-dimensional profile fitting (e.g. Abraham et al. 1996; Lotz et al. 2004,\n2006; Elmegreen et al. 2005; Ravindranath et al. 2006;\nConselice & Arnold 2009; Petty et al. 2009) have shown\nthat this increase in sizes at z ∼ 2 − 4 is related to the\naccumulation of luminous star-forming clumps or cores\nwithin a variety of structures, including spheroid- and\ndisk-like objects and irregular objects. These clumpy\nsystems are expected to coalesce and form a spheroid\nwhile a surrounding disk may grow through the continued accretion of gas (Elmegreen et al. 2008, 2009;\nDekel et al. 2009). Individual clumps could in some cases\nbe the nuclei of star-forming objects that are merging together, or they could be giant starburst regions inside a\nlarger gaseous system induced by merging or a plentiful smooth or \"lumpy\" gas supply. Detailed knowledge\non the importance of such processes would, in principle,\nprovide powerful constraints on models of galaxy formation (e.g. Birnboim & Dekel 2003; Somerville et al. 2001,\n2008; Guo & White 2008, 2009; Dekel et al. 2009), but\nobservationally they are hard to ascertain, especially at\n\n\f2\n\nR.A. Overzier et al.\n\nhigh redshift. First, estimates of the (major) merger rate\nof galaxies by means of galaxy pair counts are difficult\nand critically depend on the merger time-scale, which\nmay evolve with redshift (Kitzbichler & White 2008).\nSecond, our ability to identify galaxy mergers is a strong\nfunction of, e.g., the stage of the merger, the viewing\nangle, and gas fraction (e.g. Lotz et al. 2008). Third,\nat high redshift it is neither possible to directly measure the (HI) gas fractions of galaxies nor to map the\ndistribution of intergalactic hydrogen gas believed to be\nthe supplying reservoir. However, the relatively wide\nrange in kinematic properties of the emission line gas\nobserved in high redshift galaxies (e.g. Law et al. 2007,\n2009; Lehnert et al. 2009; Förster Schreiber et al. 2009;\nLowenthal et al. 2009) may indicate that a variety of the\nbasic mechanisms outlined above could be at play.\nOne of the most basic tools that can be used to study\nthe origin of these peculiar morphologies at high redshift is to contrast them against local or lower redshift samples of galaxies (e.g. Hibbard & Vacca 1997;\nBurgarella et al. 2006; Lotz et al. 2006; Scarlata et al.\n2007; Cardamone et al. 2009; Elmegreen et al. 2009;\nÖstlin et al. 2009; Petty et al. 2009; Rawat et al. 2009).\nHowever, it is important to keep in mind that the properties of galaxies in the local universe are generally very\ndifferent from those at high redshift, making it hard\nto disentangle actual physical differences from observational biases. To better facilitate the straight comparison, the \"Lyman break analogs\" (LBA) project was\ndesigned in order to search for local starburst galaxies that share typical characteristics of high redshift\nLBGs (Heckman et al. 2005). In brief, the UV imaging survey performed by the Galaxy Evolution Explorer\n(GALEX) was used in order to select the most luminous\n(LF UV > 1010.3 L⊙ ) and most compact (IF UV > 109\nL⊙ kpc−2 ) star-forming galaxies at z < 0.3. Although\nsuch galaxies are very rare, they tend to be much more\nluminous in the UV than typical local starburst galaxies\nstudied previously (Heckman et al. 1998; Meurer et al.\n1997, 1999) consistent with high SFRs and relatively little dust extinction. The median absolute UV magnitude of the sample is –20.3, corresponding to ≃ 0.5L∗z=3 ,\nwhere L∗z=3 is the characteristic luminosity of LBGs at\nz ∼ 3 (Steidel et al. 1999, i.e., M1700,AB = −21.07).\nAnalysis of their spectra from the Sloan Digital Sky Survey (SDSS) and their spectral energy distributions from\nSDSS, GALEX, Spitzer and VLA and follow-up spectroscopy subsequently showed that the LBAs are similar\nto LBGs in their basic global properties, including: stellar mass, metallicity, dust extinction, SFR, and emission\nline gas properties (Heckman et al. 2005; Hoopes et al.\n2007; Basu-Zych et al. 2007; Overzier et al. 2009).\nOne of the advantages of LBAs being so bright in the\nrest-frame UV is that their morphologies can be easily\ncompared with typical galaxies at high redshift without\nhaving to artifically brighten them as was done in previous studies (Lotz et al. 2004; Petty et al. 2009). In\nOverzier et al. (2008) (Paper I) we analyzed the UV\nmorphologies of a small sample of 8 LBAs observed\nwith HST, finding that most of the UV emission in the\nLBAs originates in highly compact burst regions in small,\nclumpy galaxies that appear morphologically similar to\nLBGs. We argued that if LBGs at high redshift are also\n\nsmall merging galaxies similar to the LBAs, this would\nbe very hard to detect given the much poorer physical\nresolution and sensitivity. In this paper, we present an\nanalysis of the morphologies of our full data set consisting of rest-frame UV and optical HST images of 30 LBAs\nand compare with star-forming galaxies at z ≃ 2, 3, 4\nin the Hubble Ultra Deep Field (HUDF). The structure\nof this paper is as follows. In Section 2 we describe\nour low and high redshift samples, the observations and\ndata reduction methods, and our techniques for producing redshifted simulated images as well as for performing parametrized galaxy morphologies. In Section 3 we\ncompare the rest-frame UV and optical colors, sizes and\nmorphologies of the LBAs, BzKs and LBGs. We discuss\nour results in Section 4, followed by a summary of the\nmain results. We use the AB magnitude system throughout the paper, and assume a cosmology [ΩM ,ΩΛ ,H0 ] =\n[0.27,0.73,73.0] (with H0 in km s−1 Mpc−1 ) so that the\nangular scales at z ≈ 0.2 and 3.0 are about 3 and 8 kpc\narcsec−1, respectively.\n2. SAMPLES, DATA, AND SIMULATIONS\n2.1. Lyman Break Analogs at z < 0.3\n\nWe use the data from our sample of 30 LBAs observed with HST (Programs 10920/11107). Rest-frame\nUV images for 24 objects were obtained with the Advanced Camera for Surveys (ACS) Solar Blind Channel\n(SBC) in the filter F150LP (λc ≈ 1614Å, twenty-four\nobjects) and with the High Resolution Camera (HRC)\nin the filter F330W (λc ≈ 3334Å, six objects). The exposure times per object were typically ∼2500 s. Matching observations in the rest-frame optical were carried\nout either using the Wide Field and Planetary Camera\n2 for ∼3600 s in F606W (λc ≈ 6001Å; twenty-four objects) or using the ACS Wide Field Channel for ∼2200\ns in F850LP (λc ≈ 9170Å; seven objects). The ACS\nand WFPC2 observations were divided into, respectively,\nthree and six dithered exposures and were combined using multidrizzle (Koekemoer et al. 2002). These data\nwere presented in Overzier et al. (2008, 2009). The UV\nand optical images are shown in Fig. 1.\n2.2. Star-forming Galaxies at z ≃ 2, 3, 4\nIn order to be able to compare the morphologies of\nLBAs with the best quality morphological data possible, our high redshift samples all come from the Hubble\nUltra Deep Field (HUDF). The comparison data consist of three samples of star-forming galaxies at z ∼ 2,\nz ∼ 3 and z ∼ 4. These three samples were chosen\nbecause starburst galaxies can be efficiently selected at\neach of these redshifts, using photometric color criteria\ndescribed below. This has resulted in good statistical\ndata on the sizes, morphologies and stellar populations\nof such galaxies.\nOur highest redshift samples are based on the photometric redshift catalog of galaxies in the HUDF from\nCoe et al. (2006). We selected two samples of LBGs having redshifts in the range 2.5 < z < 3.5 (z ∼ 3) and\n3.5 < z < 4.5 (z ∼ 4). We only selected objects having a\nhigh photometric redshift accuracy (\"ODDS\">0.99, i.e.,\nthe Bayesian redshift probability distribution, P (z), is\npeaked around the adopted best-fit photometric redshift\nwithout any significant secondary peaks or plateaus at\n\n\fMorphologies of local Lyman break galaxy analogs\n\n3\n\nFig. 1.- HST images of LBAs in the UV and optical at their true and similated redshifts. For each object, we show a set of four postage\nstamps. The top-left and top-right show the observed UV (6′′ × 6′′ ) and optical (10′′ × 10′′ ) images, respectively. The ID numbers and\nredshifts from Overzier et al. (2009) are indicated in the optical ('OPT') stamps. Below these images we show the same object simulated\nat z = 3 and observed at the HUDF depth through the ACS/WFC V606 and WFC3/IR H160 filters probing the rest-frame UV (bottomleft) and optical (bottom-right), respectively. The simulated images measure 2′′ × 2′′ . The observed UV images most often show one to\nseveral high surface brightness clumps, while in many of the optical images faint tidal features and companions suggest that the UV-bright\nstarburst regions are triggered by mergers between small galaxies. In most cases the UV and optical light distributions are very similar,\nalthough in a small number of cases (e.g., objects 080844 and 210358) the UV emission is dominated by a single point-like source situated\nin a more extended and often disturbed disk seen in the optical (these objects were referred to as Dominant Central Objects (DCOs) in\nOverzier et al. (2009)). In most cases, the loss in sensitivity and resolution in the artificially redshifted images causes the UV clumps to\nblend into larger regions and hides the underlying structures and subtle features associated with the mergers seen in the optical. For color\n\n\f4\n\nR.A. Overzier et al.\n\nother redshifts). It is important to note that we are\nnot working with spectroscopic redshifts, meaning that\nwe anticipate some scatter between the actual and the\nadopted redshifts7 . Nonetheless, after we have applied\nan additional cut on UV luminosity (see below), it is\nexpected that these samples are very similar to the typical UV-selected LBG samples referred to in literature\nas U -dropouts (z ∼ 3) and B-dropouts (z ∼ 4). At\nz ∼ 2, analogous selections can be made based on the\nU GR colors of starbursts that are typically referred to\nas 'BM/BX' samples. Because deep U and G-band data\nwere not available to us for the HUDF, we have instead\nused a sample of galaxies selected according to BzK =\n(z − K) − (B − z) > −0.2 from Kong et al. (2008). This\ncriterion selects star-forming galaxies (\"sBzK\" galaxies)\nwith photometric redshifts in the range z ∼ 1.4 − 2.5\n(Daddi et al. 2004), and it has been shown that there\nis a high degree of overlap between the UV-selected\n\"BM/BX\" galaxies and the K-selected sBzK galaxies,\nparticularly at faint (KV ega ∼ 22) magnitudes (e.g.\nReddy et al. 2005, 2006; Grazian et al. 2007; Kong et al.\n2008). However, we note that the sBzK selection is much\nmore complete in terms of dust extinction, and thus includes a higher fraction of relatively obscured galaxies\nmissed by the UV selections. In any case, in order to\nmake sure we are comparing objects of similar intrinsic\nUV luminosities to those of the LBAs, we have limited\nthe sBzK and LBG samples to MUV,1700 < −19.5 in our\nanalysis below. After further cleaning the samples from\nobjects that are blended or near bright foreground objects or that lie too close to the image edges, we are left\nwith 30 (z ∼ 2), 66 (z ∼ 3) and 45 (z ∼ 4) objects in\nthe region of the HUDF covered in the optical imaging\nprovided by the ACS.\nTo measure morphologies in the rest-frame far-UV\nwe use the ACS V606 -band image from Beckwith et al.\n(2006). These data cover an area of 11.2 arcmin2 and\nwere taken in 122 dithered exposures with a combined\nexposure time of 135320 s. The frames were drizzled\nat an output pixel scale of 0.′′ 03 pixel−1 with a PSF of\n≈0.′′ 1 full-width-at-half-maximum (FWHM). In order to\nalso measure morphologies in the rest-frame optical at\nhigh redshift we require high quality near-infrared data.\nWe use data from the WFC3/IR channel observations\nperformed as part of the early release science observations program 11563 (Bouwens et al. 2009a; Oesch et al.\n2009a). We only use images taken through the filter\nH160 (λc ≈ 1.54 μm) covering an area of 4.7 arcmin2\ncentered on 3h 32m 38.5s and −27d47′ 0.0′′ . In order to\ncreate the H160 combined mosaic image, we started from\nthe pipeline calibrated (flt) images released as part of\nthe Servicing Mission 4 Early Public Observation Data\nProducts as input to MultiDrizzle. The H160 data were\ntaken in 14 visits of 2 orbits each during August 26, 2009\nto September 6, 2009. After removal of several visits\nand exposures of reduced quality, we were left with 47\n7 We further note that the Coe et al. (2006) photometric redshift\nanalysis did not incorporate any U -band data, which is important\nfor a careful sampling of the Lyman break at z ∼ 3. However,\nit has been shown that the main advantage of the inclusion of\nU -band data is that it resolves some ambiguities in the P (z) of\ngenuine z ∼ 3 objects, while there are relatively few low redshift\ninterlopers that are wrongfully placed at z ∼ 3 when U -band data\nis not available (Nonino et al. 2009; Rafelski et al. 2009).\n\nTABLE 1\nOverview of Rest-frame Wavelengths of the\nObservations/Simulations.\nLBAs (Na )\nz < 0.3\nF150LP (24)\n∼1350Å\nF606W (23)\n∼5000Å\n\nBzKs\nz∼2\n\nLBGs\nz∼3\n\nLBGs\nz∼4\n\nRest-UV\nF330W (6)\nACS/WFC F606W\n∼2800Å\n∼2000Å ∼1500Å ∼1200Å\nRest-optical\nF850LP (7)\nWFC3/IR F160W\n∼7500Å\n∼5100Å ∼3900Å –\n\na\n\nNumbers between parentheses indicate the number of LBAs\nobserved in each filter.\n\ndithered flt images with a total exposure time of ≈66000\ns. Two passes through multidrizzle were made. During the first stage, we created single distortion-corrected,\nregistered images and combined them into a median image. Because the median image contained significant levels of background structure not removed by the pipeline,\nSExtractor was used to create an object-free background\nimage. This background image was blotted back to the\ngeometry of each of the original input frames and subtracted. In the second stage, the frames were drizzled together to produce a final cleaned background-free mosaic\nwith an output pixel scale of 0.′′ 06 pixel−1 (pixfrac=0.7)\nand a PSF of ∼ 0.′′ 2 (FWHM). Because of the smaller\ncoverage in the near-infrared provided by the Wide Field\nCamera 3 (WFC3), the sample sizes are 22 at z ∼ 2 and\n35 at z ∼ 3.\nIn Section 3 we will also make use of some of the photometric data in the ACS filters B435 , V606 , i775 and z850\ntaken from the HUDF catalog from Coe et al. (2006),\nand groundbased H- and Ks -band data from the publicly available Great Observatories Origins Deep Survey\nMultiwavelength Southern Infrared Catalog (GOODSMUSIC) from Santini et al. (2009).\n2.3. Redshift Simulations\n\nIn order to be able to compare the sizes and morphologies of our low and high redshift samples, we performed\nredshift simulations of the low-z LBA sample. We apply\ncorrections for cosmological surface brightness dimming\nand for changes in physical resolutions. The first step of\nthe procedure is to rebin the low-z images by a factor\nb = (θ1 /θ2 )(s2 /s1 ), where θi is the angle on the sky of an\nobject of fixed size d at z = zi , and si is the instrumental pixel scale (in arcsec pixel−1 ). The rebinning factor\ncan be expressed in terms of the ratio of angular diameter distances, b = (DA2 /DA1 )(s2 /s1 ), where DAi = d/θi\nand z2 > z1 . The second step is to reduce the surface\nbrightness of each (rebinned) pixel according to the relative amount of cosmological dimming of a galaxy at\nz2 with respect to that at z1 . We calculate the scaling\nby making use of the fact that the absolute rest-frame\nmagnitude (or luminosity) of the object before and after\nredshifting will be conserved (Mλ2 /(1+z2 ) = Mλ1 /(1+z1 )\nwith matched filters so that λ2 ≈ λ1 (1 + z2 )/(1 + z1 )).\nThe effectiveness of our simulations is limited mainly\nby two factors. One, for each LBA we have only a single\nband in each of the UV and optical available. This means\nthat there will be uncertainties in the (morphological) Kcorrections. While our rest-frame far-UV images are a\n\n\fMorphologies of local Lyman break galaxy analogs\n\n5\n\nFig. 2.- Panels show the distributions in absolute UV magnitude (left), UV continuum slope βU V (middle) and rest-frame UV-optical\n(F U V − R) color (right). In each panel, black histograms correspond to the LBAs, while blue, green and red histograms show the\ndistributions for the z ∼ 2, z ∼ 3, and z ∼ 4 comparison samples, respectively. The vertical dotted dashed line in the left panel indicates\nthe magnitude limit applied to the comparison samples. On the top axis of the middle panel we give the inferred E(B − V ) extinctions\ncorresponding to the measured β of a young star-forming galaxy (Calzetti 2001). On the top axis of the panel on the right we give the\ninferred age corresponding to the color measured for a young star-forming galaxy of solar metalliticy and a reddening of E(B − V ) = 0.1\nobserved at z = 0.2. When calculating the UV and UV-optical colors, we did not perform filter interpolations but instead for each sample\nwe used those filters that were closest in rest-frame wavelength to the desired colors. The four samples are largely comparable in all three\nproperties, although the median UV and UV-optical colors of the BzK sample is somewhat redder compared to those of the LBAs and\nLBGs. The histograms in the middle and right panels were all normalized to the area of the LBA histograms.\n\nnear perfect match to the observed optical ACS images\nof the LBGs, the six U -band images probe rest-frame\nwavelengths that are slightly redder even than the ACS\nz850 -band data on LBGs (WFC3/IR F105W and F125W\nwould provide a better rest-frame match). Second, our\nrest-frame optical images probe rest-frame wavelengths\nof ∼ 5000 − 8000Å, while the reddest band available\nfor LBGs in the HUDF (WFC3/IR F160W) only probes\nthe rest-frame optical at λ ∼ 4000Å even for LBGs at\nz ∼ 3. We will remedy these shortcomings as follows.\nIn the minority of cases where our available UV data\nis somewhat bluer or redder than the mean rest-frame\nwavelenghts of the high redshift data, we will assume\nthat the morphological K-corrections from rest-frame\nFUV to NUV/U are negligible. This is a reasonable\nassumption given that the morphological K-corrections\nfor both LBAs and LBGs are found to be quite modest\neven from the rest-frame UV to the rest-frame optical\n(see, e.g., Lotz et al. 2004, 2006; Papovich et al. 2005;\nConselice & Arnold 2009, and Section 3 of this paper).\nWe will further assume that our relatively red rest-frame\noptical images of LBAs are always representative for the\nmorphologies at λ & 4000Å. We then simulate rest-frame\nUV images in F606W (ACS/WFC) and rest-frame optical images in F160W (WFC3/IR), both at the HUDF\ndepth. However, in all cases we apply appropriate color\nterms based on the full UV-optical spectral energy distribution that is available to us from GALEX and SDSS\nin order to minimize at least the spectral K-corrections.\nThis will ensure that the objects have the correct surface\nbrightness when artificially redshifted. Because of the\nrelatively blue rest-frame wavelength of F160W we will\nonly simulate rest-frame optical images for comparison8\n8 In a future paper we plan to perform similar simulations for\nJWST or AO-assisted, ground-based observations in the observed\nK-band in order to compare morphologies of LBAs and LBGs at\nlonger rest-frame optical wavelengths.\n\nwith LBGs at z ∼ 3. Our simulated images take into account the effects of sky background, Poisson noise, dark\ncurrent, readnoise, sub-exposures, and PSF convolution\nbased on stars in the actual HUDF V606 and H160 images. The different instrumental configurations and corresponding rest-frame wavelengths used for the observed\nand simulated data are summarized in Table 1. Examples of the ACS/WFC V606 and WFC3/IR H160 images\nsimulated based on LBAs redshifted to z = 3 are shown\nin Fig. 1.\n\n2.4. Size and Morphology Measurements\n\nWe will compare the galaxy radii r50 and r90 containing, respectively, 50 and 90% of the light measured in\nthe UV and optical using SExtractor. The \"total\" light\nradius was set to 4 times the Kron radius. We will\nalso compare a number of morphologial quantities used\nwidely in the literature: the Gini coefficient (G; a measure of the equality with which the flux is distributed\nacross a galaxy), M20 (the log of the ratio of the second\norder moment of the pixels containing the 20% brightest flux to the total second order moment), concentration (C; five times the log of the ratio of the circular\nradii containing 80 and 20% of the flux), and asymmetry (A; a measure of the mirror symmetry of an object).\nA fifth and commonly used parameter that measures the\nclumpiness (S) of galaxies will not be used here, as it was\nfound to be of limited use at high redshift where galaxies tend to be faint and compact (Conselice & Arnold\n2009). We also do not perform any two-dimensional profile fitting, but note that inferences made based on such\nstudies applied to LBGs can be found elsewhere (e.g.\nRavindranath et al. 2006; Rawat et al. 2009; Petty et al.\n2009). To calculate the four parameters we closely follow\nthe definitions and procedures described in Lotz et al.\n\n\f6\n\nR.A. Overzier et al.\n\n(2004, 2006) and Paper I and in the footnote9 . Some\nLBAs have faint companions that were included in the\nsimulated images. For the high redshift samples, it is\noften hard to determine whether neighbouring objects\nare physically associated or not given the general clumpy\nnature of BzK and LBG galaxies as well as overcrowding in the deep HUDF images. Our SExtractor settings\nwere chosen such that high surface brightness regions\nconnected by diffuse emission were largely considered as\na single system, while other neighbouring objects were\nmasked out fairly aggressively. This should be kept in\nmind as the inclusion and rejection of close neighbours\ncan have significant effects on some of the morphological\nparameters. However, we believe that our main conclusions will not be affected by this.\n3. RESULTS\n3.1. Rest-frame UV-optical Colors\nIn order to re-emphasize the high degree of similarity\nbetween the LBAs and typical star-forming galaxies at\nhigh redshift, we compare the main UV and optical photometric properties in Fig. 2. In the panel on the left, we\nfirst show the distribution in absolute UV magnitudes at\n1700Å for the LBAs (black histogram) and the three high\nredshift samples (BzK in blue, U -dropouts in green and\nB-dropouts in red). As stated in Section 2.2 we match\nthe four samples in UV luminosity by placing a cut at\nMUV = −19.5 mag. In the middle panel of Fig. 2 we plot\nthe distributions of the UV continuum slope βUV , where\nfλ ∝ λβ and β is typically measured for λ in the range\n1650Å to 2300Å corresponding to approximately the farand near-UV (e.g. Meurer et al. 1995, 1999). For the\nLBAs, we estimate β from the (FUV–NUV) color, while\nwe use (B435 –V606 ) at z ∼ 2, (V606 –i775 ) at z ∼ 3 and\n(i775 –z850 ) at z ∼ 4. The top axis of the middle panel\nshows how a given β corresponds to the approximate\nE(B − V ) extinction for a young star-forming galaxy\n(∼100 Myr old and forming stars at a constant rate) assuming the dust recipes from Calzetti (2001). The distributions are all very blue, consistent with no or only small\namounts of reddening due to dust. The median reddening in the BzK sample is somewhat higher than that\nin the LBA/LBG samples consistent with other works\n(Kong et al. 2008; Bouwens et al. 2009b). In the right\npanel of Fig. 2 we show the distributions in rest-frame\nUV-optical colors for the four samples. The colors of the\nhigh redshift samples were calculated using the filters\nthat were closest to the rest-frame central wavelengths\nprobed by the (F U V − R) color of the LBAs at z ∼ 0.2.\nOn the top axis of the panel on the right we give the\n9 In brief, we use SExtractor to make an object segmentation\nmap and mask out neighboring objects. The image is background\nsubtracted, and we calculate an initial Petrosian radius (rP with\nη ≡ 0.2) using the object center and (elliptical) shape information\nfrom SExtractor. We then smooth the image by σ = rP /5 and\ncreate a new segmentation map by selecting those pixels that have\na surface brightness higher than the mean surface brightness at the\nPetrosian radius. We recalculate the object center by minimizing\nthe second order moment of the flux, and then recalculate the\nPetrosian radius in the original image using this center. The total\nflux is defined as the flux within a radius of 1.5×rP . C is calculated\nin circular apertures containing 20 and 80% of the light. A is\ncalculated within a circular region of radius 4×r50 , and we subtract\nthe asymmetry of the background using a similar sized region free\nof objects.\n\nFig. 3.- The stellar mass-metallicity (M∗ –Z) relation. Contours indicate the distribution from a large sample of star-forming\nand composite objects at z < 0.3 extracted from the SDSS/DR7\nspectroscopic sample. Large black symbols indicate the values measured for individual objects in our LBA sample from Overzier et al.\n(2009). Blue symbols indicate the average values found for starforming galaxies at z ∼ 2 in several mass bins from Erb et al.\n(2006). The grey points indicate the M∗ –Z distribution of a statistical sample of ∼500 LBAs extracted from the GALEX/GR5\nand SDSS/DR7 crossmatched samples (Overzier et al. 2010, in\nprep.). Objects identified as star-forming/AGN composites have\nbeen indicated using a darker shade of grey. All metallicities have\nbeen estimated using the \"N2\" method based on the [NII]/Hα ratio\nfrom Pettini & Pagel (2004). The horizontal dotted line indicates\nsolar metallicity, and we note that the metallicities derived using\nthe N2 method saturate near this line.\n\ninferred age corresponding to the color measured for a\nyoung star-forming galaxy of solar metalliticy and a reddening of E(B − V ) = 0.1 observed at z = 0.2. The\ndistributions are similar to those expected for galaxies\nhaving ages that peak around a few hundred Myr to a\nGyr.\n3.2. Mass-Metallicity Relation\nThe (stellar) mass-metallicity (M∗ − Z) relation is\na crucial diagnostic for evaluating the gas-phase metal\nabundance of galaxies as a function of their baryonic\nmass (e.g. Zaritsky et al. 1994; Tremonti et al. 2004;\nSavaglio et al. 2005). In Fig. 3 we reproduce the M∗ − Z\nrelation of LBAs first shown by Hoopes et al. (2007), and\nupdated according to our most recent samples and measurements. Large black symbols indicate the values measured for the 30 LBAs from our sample and using the\nSDSS-based stellar masses and emission line ratios based\npresented in Overzier et al. (2009). Contours show the\ndensity distribution from a large sample of star-forming\nand composite objects at z < 0.3 extracted from the\nSDSS/DR7 spectroscopic sample10 . Although we do not\n10 Available on the website of the Max-Planck Institute for Astrophysics: http://www.mpa-garching.mpg.de/SDSS/DR7/\n\n\fMorphologies of local Lyman break galaxy analogs\nhave the gas-phase metallicities of the three main comparison samples at high redshift that are used in this\npaper, we can at least compare with the mass-binned\naverages found for star-forming galaxies at z ∼ 2 from\nErb et al. (2006) (shown in blue). This z ∼ 2 sample\nis very similar to our z ∼ 2 BzK sample in most aspects. All metallicities in Fig. 3 have been estimated\nusing the \"N2\" method based on the [NII]/Hα ratio from\nPettini & Pagel (2004). The horizontal dotted line indicates solar metallicity, and we note that the metallicities\nderived using the N2 method saturate near this line.\nFig. 3 illustrates the very similar distributions both in\nstellar mass and in metallicity for LBAs and the z ∼ 2\nsample, and in such a way that their M∗ − Z relation is\nincreasingly offset from the local relation towards lower\nstellar masses. As shown by Erb et al. (2006), the offset\nwith respect to the local relation is similar at all masses,\nand could be explained by the (mass-independent) loss\nof metals from supernova winds. Except for the highest\nmasses, the LBAs show very similar offsets with respect\nto local galaxies of the same mass. This could either\nindicate that LBAs are still in the process of converting a relatively large gas mass into stars compared to\nother galaxies of the same mass, or that they have had a\nrecent accretion event of metal-poor gas associated with\nthe onset of the starburst, possibly coupled with a (massdependent) outflow of metals due to winds (Hoopes et al.\n2007; Overzier et al. 2009).\n3.3. Sizes\n\nIn Fig. 4 we show the half-light radius distributions\nfor the four samples. The three panels on the left\nmarked 'UV' show the rest-frame UV sizes for each of\nthe high redshift samples, while the two panels on the\nright marked 'OPT' show the rest-frame optical sizes for\nthe z ∼ 2 and z ∼ 3 samples. In each panel, the sizes\nmeasured for LBAs simulated at corresponding redshifts\nare shown in black, while their \"true\" size distribution\nmeasured from the full-resolution, low redshift HST images is indicated by the grey lines. On the top axes we\nhave indicated the corresponding angular scales. The\nsize distributions of the four samples are comparable,\nwith a notable exception being the, on average, larger\nsizes measured for the BzK galaxies in the rest-frame\noptical. Our results are consistent with earlier studies of the size distributions at high redshift finding that\nstar-forming galaxies at z ∼ 2 − 4 are compact galaxies having half-light radii in the range ∼ 0.5 to a few\nkpc in the UV and ∼ 0.5 to 6 kpc in the optical, consistent with more detailed analyses from the literature (e.g.\nBouwens et al. 2004; Ferguson et al. 2004; Trujillo et al.\n2006; Dahlen et al. 2007; Oesch et al. 2009b).\nThe main purpose for comparing the main physical\nquantities summarized in Figs. 2, 3 and 4 that are\nnot sensitive to redshift-dependent observational effects\n(i.e., luminosity, color, mass, metallicity and size) was to\ndemonstrate the basic similarities between our samples.\nThe results support our basic premise that the sample\nof LBAs is useful for investigating various other properties of high redshift galaxies, such as their morphologies\nthat are likely very sensitive to redshift effects and that\ncan not be easily obtained from the available data. In the\nfollowing subsection we will compare the morphologies of\nLBAs, BzKs and LBGs in order to investigate whether\n\n7\n\nthey are similar as well or perhaps notably different.\n3.4. Morphologies\n\nOur results on the morphologies (G, C, A and M20 )\nmeasured in the rest-frame UV and optical images following our methods outlined in Sect. 2.4 are presented\nin Figs. 5–7 and Tables 2 –4. Before we discuss our\nresults, we will briefly describe what the different parameters are most sensitive to (e.g., see Abraham et al.\n1996, 2003; Lotz et al. 2004, 2006; Conselice et al. 2000;\nConselice & Arnold 2009; Lisker 2008, and references\ntherein for derivations and detailed discussions). C is\na powerful diagnostic for separating relatively shallow\n(low C) versus highly concentrated (high C) light profiles, such as late-type spirals and bulge-dominated galaxies. Two issues can affect C. First, galaxies may contain\nunresolved components containing more than 20% of the\nlight, thereby causing R20 to be overestimated and C to\nbe underestimated. Second, a small offset between the\nestimated center of a galaxy and a highly concentrated\nnucleus will also cause C to be underestimated compared\nto its true value. Because both effects can only be countered effectively for the redshifted LBA sample (for which\nsub-resolution and sub-sensitivity spatial information is\navailable) but not for the real high redshift samples, we\nhave not attempted to correct for these effects. The Gini\ncoefficient is known to correlate with C, but differs in\nthe sense that it is sensitive to any concentrated light\nindependent of its spatial distribution (Abraham et al.\n2003; Lotz et al. 2004). Similar to C and G, the M20 parameter is also sensitive to concentrated light. However,\nbecause every pixel is multiplied by the square of its distance relative to the centre (a free parameter), it is more\nsensitive to spatial fluctuations such as bright clumps or\ndouble nuclei from merging systems (high M20 ). The\ndeviation from rotational symmetry, A, can distinguish\nbetween symmetric profiles such as those of early-type\ngalaxies (low A) and those that are less symmetric such\nas spirals, irregulars and mergers (high A).\nBelow, we will first investigate the effect of redshift\non the measurement of morphologies in the LBA sample\nitself (Sect. 3.4.1). Then, we will compare the redshifted\nLBA samples with the high redshift comparison samples\n(Sect. 3.4.2).\n3.4.1. Investigating redshift effects on LBA morphologies\n\nIn Fig. 5 we compare the values calculated for\nLBAs at their intrinsic redshifts (z ∼ 0.2) with those\ncalculated after redshifting them to z = 2, 3, 4. Black\npoints indicate the individual measurements at low\nredshift, while green points indicate the measurements\nat z = 3. Large crosses indicate the median values at\nz ∼ 0.2 (black), z = 2 (blue), z = 3 (green) and z = 4\n(red), and the length of the bars indicate the 15–85 percentile ranges. We summarize the main results as follows:\n1. In both the UV (left) and optical (right), the median\nvalues of G, M20 and A decrease from low to high redshift, with A being the most sensitive to redshift: both\nits median value and its scatter are significantly smaller\ncompared to low redshift. The C does not change in the\nUV. The drop in the median values can be explained due\nto a combination of the loss in resolution and sensitivity.\n\n\f8\n\nR.A. Overzier et al.\n\nFig. 4.- Panels on the left show the physical half-light radii measured in the rest-frame UV images for BzK galaxies (blue histogram),\nLBGs at z ∼ 3 (green histogram) and LBGs at z ∼ 4 (red histogram). The black histogram in each panel indicates the size distribution\nof the LBAs as measured from the images simulated at each of the redshifts of the comparison samples. The grey line shows the \"true\"\nsize distribution of the LBAs measured from the full-resolution, low redshift HST images. The two panels on the right show the size\nmeasurements based on the rest-frame optical data in a similar fashion. The rest-frame optical sizes are typically twice as large as the\nrest-frame UV sizes. In the rest-frame optical, BzK galaxies are somewhat larger than both LBAs and LBGs. The top axes of each panel\nindicate the corresponding angular sizes. The sizes were measured using SExtractor and have not been corrected for the size of the PSF\n(F W HM ≈ 0.′′ 1 in the UV and ≈ 0.′′ 2 in the optical).\n\nFig. 5.- Distributions of the morphological parameters G, C, A M20 for the LBAs at their true and simulated redshifts in the rest-frame\nUV (left) and optical (right). Black crosses indicate the 15–85 percentile ranges measured off the true (low-redshift) images. For comparison\nwe indicate the ranges found for LBAs redshifted to z = 2 (blue crosses), z = 3 (green crosses), and z = 4 (red crosses). The z ∼ 4 sample\nis not shown on the right as we lack a sufficiently red band to probe the rest-frame optical light. Small symbols indicate the individual\nmeasurements for the LBAs at their intrinsic (low) redshift (black points) and LBAs simulated at z = 3 (green points).\n\nThe loss of faint structures causes the 80% light radius to\nbe underestimated (lowering C) and the flux to be more\nevenly distributed over the detected pixels (lowering G).\nResolution causes bright, clearly separated clumps seen\nin the unredshifted images to blend (see Fig. 1), thereby\nlowering M20 and A.\n2. If we focus on the M20 − A plane (lower-left panels)\n– which as we will see below, in principle, serves as the\nbest diagnostic for identifying highly disturbed galaxies –\nwe find that the relatively high asymmetries measured for\nthe LBAs at low redshift are less affected by the redshifting in the optical image compared to the UV. Previous\nstudies of morphologies have suggested criterions of, e.g,\nM20 & −1.1 and/or A & 0.35 as indicators for double\n\nnucleated (e.g., merging) or generally disturbed galaxies\n(Lotz et al. 2006; Conselice & Arnold 2009). Based on\nthe M20 criterion, very few LBAs fall in this category\neven at z ∼ 0.2 (respectively 3 and 5 in the UV and optical), while none would be selected at z = 3. Based on\nasymmetry, most LBAs are classified as disturbed both\nin the UV and optical at low redshift and in the optical\nat high redshift, while only a very small fraction would\nbe classified as such in the UV at high redshift.\n3.4.2. Comparing LBAs, BzKs and LBGs\n\nIn Fig. 6 we present our measurements for the high\nredshift samples, while in Fig. 7 we compare the\nparameter distributions measured for BzKs and LBGs\n\n\fMorphologies of local Lyman break galaxy analogs\n\n9\n\nFig. 6.- Distributions of the morphological parameters measured in the rest-frame UV (left) and optical (right) for the high-redshift\nHUDF samples. The z ∼ 2 BzK sample is shown in blue, the z ∼ 3 LBG sample in green, and the z ∼ 4 LBG sample in red. The\nz ∼ 4 sample is not shown on the right as the WFC3 H160 filter is too blue for probing the rest-frame optical at λ & 4000Å. Dashed\nlines indicate standard criteria used to separate mergers or disturbed galaxies (e.g., A > 0.35 ∨ M20 > −1.1 ∨ G > −0.14M20 + 0.33 ∨\nG > −0.4A + 0.68, where ∨ is the logical OR operator) from galaxies having more symmetric profiles taken from Lotz et al. (2004, 2008)\nand Conselice & Arnold (2009).\n\nwith the LBAs simulated at the same redshift (barred\nsquared and circles indicate the median and 15–85\npercentile ranges for comparison samples and redshifted\nLBAs, respectively). We observe the following trends:\n1. At each redshift, there are systematic differences\nbetween the median values of LBAs on one hand, and\nBzKs/LBGs on the other. However, this difference is\noften comparable or smaller than the (large) scatter on\nthe mean. The differences as well as the scatters are\nsmaller in the optical compared to the UV.\n2. BzKs/LBGs (large squares in Fig. 7) are somewhat less concentrated, have lower G and higher M20\ncompared to the LBAs simulated at the same redshift.\n3. In the rest-frame UV, the BzK galaxies (blue\nsquares in Fig. 7) have the most notable offsets compared to the LBAs (simulated at z = 2, blue circles),\nin the sense that they are much less concentrated, have\nhigher asymmetries and larger M20 . In this respect, they\nalso differ from ≃ 3 − 4 LBGs (although part of this is\nlikely a redshift effect). In the optical, the offsets are considerably smaller but show the same general trend that\nthe difference between BzK galaxies and LBAs is larger\nthan that between the z ∼ 3 LBGs and LBAs.\n4. In the UV, a significant fraction of sources in each\nof the high redshift samples have M20 > −1.1, compared\nto none of the sources in the redshifted LBA samples.\nIn the optical, the M20 is also higher for the true high\nredshift samples compared to the LBAs, although it\nmust be noted that the 15–85 percentiles lie entirely at\nM20 < −1.1 for all samples.\nIn Tables 2–4 we have summarized the main results presented graphically in the three figures discussed\n\nabove. Table 2 lists the median parameters found for\neach sample, and we estimate a scatter on the mean from\nthe sample variances. Tables 3 and 4 gives a measure\nof the statistical significance of the difference in median\nvalues between each\nq pair of samples. We define the ratio\nRP ≡ (P2 − P1 )/ σP2 1 + σP2 2 , where Pi and σPi are the\nmedian and standard deviation in the morphological parameter P measured for sample i. A value of |RP | ≈ 1\nthen indicates that the difference is comparable to the\nscatter, while |RP | ≈ 0 indicates that the difference is\nsmall. For each parameter and combination of samples,\nwe also give the level of significance that the null hypothesis that the two samples are drawn from the same\nparent distribution is true, as calculated from a two-sided\nK-S test. The statistical results are consistent with our\nqualitative conclusions summarized above.\n4. DISCUSSION\n4.1. Morphologies of LBAs at different redshifts\n\nIn previous works we have shown that LBAs are\nclumpy starburst galaxies with peculiar morphologies\nthat are most consistent with merging (Overzier et al.\n2008, 2009). Although we currently do not know the\nrelative contribution from major and minor mergers,\nthe diversity in LBA morphologies at least suggests a\nrange in merger conditions and stages albeit that they\nall have in common that their starbursts are all very\nyoung (ages of a few tens of Myr), compact and UVluminous (Overzier et al. 2009). We have shown that,\nboth in the UV and optical, asymmetry appears to be a\nbetter indicator for this merger activity than M20 . The\nmedian A is larger than the merger criterion of A > 0.35\nfrom Conselice & Arnold (2009), while the median M20\nis much lower than the merger criterion of M20 & −1.1\n\n\f10\n\nR.A. Overzier et al.\n\nFig. 7.- Comparison of the rest-frame UV (left) and optical (right) parameters for (redshifted) LBAs and the high-redshift comparison\nsamples. Barred squares indicate the median and 15–85 percentile ranges measured for the z ∼ 2 BzK sample (blue), the z ∼ 3 LBG\nsample (green) and the z ∼ 4 sample (red), while barred circles of corresponding colors indicate the values measured for LBAs simulated at\nthe corresponding redshifts. In the UV, the distributions show significant overlap in morphological parameter space, although the median\nG, C and M20 of the high redshift samples indicate that they are somewhat less concentrated and clumpier compared to the (artificially\nredshifted) LBAs. The strongest offsets are observed for the BzK sample. In the rest-frame optical, there is better agreement between the\nmedian values measured for the BzK, LBG and LBA samples compared to those measured in the rest-frame UV.\n\n(e.g. Lotz et al. 2004; Conselice & Arnold 2009). We redshifted the LBAs to z = 2−4 and found a significant drop\nin the UV asymmetries such that the median A fell well\nbelow the merger criterion. In the optical, the drop was\nsmaller and less significant. M20 became even smaller\nas the different star-forming clumps blended into single\nlight concentrations at high redshift. We thus conclude\nthat if galaxies similar to LBAs were observed in the UV\nat high redshift, all but a few would be mistaken as being\nrelatively smooth and symmetric rather than identified\nas mergers. In the optical, we estimate that ∼50% would\nbe identified as symmetric.\nLotz et al. (2008) investigated in detail the complicated relation between the ability to morphologically\nclassify merging galaxies on one hand, and the physical details of the merger on the other. As expected,\nthe merger observability time-scale (i.e., the time during which a merger is identified as such compared to the\ntotal merging time) critically depends on, e.g., orbital\nparameters, gas fraction, dust, SN feedback, and viewing angle. These results explain, for example, why the\nG, C, A, M20 system is much more effective in identifying the roughly two-thirds of local ULIRGs having more\nthan one nuclei that are seen either just prior to final coalescence or in projection at first passage, than single nucleus ULIRGs (Lotz et al. 2004, 2008). In a similar fashion, this \"merger observability\" as defined by Lotz et al.\n(2008) can also explain why a significant fraction of the\nLBAs do not appear to be particularly disturbed for some\nor all of the morphological parameters. However, in addition to these effects, our simple simulations clearly show\nthat for LBA-like galaxies observed at high redshift the\ndecreased physical resolution and sensitivity are of equal\nor even greater importance than the physical details of\n\nthe merger.\n4.2. Morphologies of LBAs, BzKs and LBGs\n\nThe median M20 of LBGs at z ∼ 3 − 4 is larger than\nthat of LBAs, while the A is similar. The fractions of\nLBGs classified as disturbed based on either one of these\nparameters in the UV is ∼30%, consistent with previous\nworks (Lotz et al. 2004, 2006; Conselice & Arnold 2009).\nIn the optical, a similar result is obtained based on A,\nwhile a much smaller fraction is derived based on M20 .\nIt is interesting to note that the differences observed between BzK galaxies and LBAs are much more significant\nthan those between LBGs and LBAs: in the UV, BzKs\nhave the highest A and M20 and the lowest C and G of\nall samples considered here. In the optical, BzKs had\nthe largest median half-light radii.\nIt must be noted, however, that our way of selecting\nLBAs based on a UV surface brightness criterion was\ntuned to select objects having similar UV luminosities\nand sizes as typical LBGs at z ∼ 3 (Heckman et al.\n2005). In principle, the LBA selection could be expanded\nor modified to search for such objects more similar to\nBzK galaxies, but one must be more careful as such a\nselection would include a wider variety of galaxies that\nare not so suitable analogs of high redshift objects compared to LBAs (Hoopes et al. 2007). An example of a\nparticularly clumpy LBA is the luminous blue compact\ndwarf galaxy Haro 11 at z = 0.02 (Östlin et al. 2009),\nwhich lies close to the edge of our LBA selection criteria based on FUV luminosity and surface brightness\n(Grimes et al. 2007). It is similar to the LBAs in most\naspects but with a relatively high degree of clumpiness\ndue to three strong light concentrations in an otherwise\namorphous, forming galaxy. Its UV morphology at high\n\n\fMorphologies of local Lyman break galaxy analogs\nredshift is similar to that of double nucleated galaxies\nidentified on the basis of a large M20 or even a \"by eye\"\nclassification (Overzier et al. 2008).\n4.3. Possible Implications for accretion processes in\n\nstarbursts at high redshift\nBased on the results presented in the previous sections,\nwe can now make a series of statements purely based on\nthe comparison of the morphologies of LBAs and high\nredshift starbursts (such as BzKs and LBGs):\n1. LBAs show clumpy star formation. Our redshift\nsimulations suggest that real high redshift samples have\na similar (LBGs; z ∼ 3−4) or perhaps a slightly stronger\n(BzKs; z ∼ 2) degree of clumpy star formation.\n2. LBAs show luminous UV clumps and faint optical tidal features that, in the majority of cases, are\ninterpreted by us as being due to mergers based on\nthe visual evidence. Our simulations suggest that this\ninformation can not be recovered from the rest-frame\nUV morphological parameters at high redshift, while\nin the rest-frame optical perhaps 1 out of every 2\nobjects would be classified as disturbed. This clearly\ndemonstrates that current estimates for the fraction of\ngalaxies at high redshift having disturbed morphologies\n(as opposed to smooth/symmetric morphologies) is most\nlikely a (weak) lower limit on the true fraction. This\nstatement is independent of the physical mechanism\nthat is the cause of these disturbed morphologies.\n3. The observations suggest a scenario where either\ncold gas accretion and internal instabilities can drive\nclumpy star formation in LBGs at levels higher than\nany seen in LBAs in the local universe, or where clumpy\ncold accretion, possibly at the level of major or minor\nmergers may be responsible for star formation in LBAs\nand LBGs alike. We will discuss these possibilities in\nmore detail below.\nThe latest observational evidence suggests that the\nfraction of LBGs at z ∼ 3 − 4 having disturbed or distorted morphologies is ∼30% (e.g., Conselice et al. 2003;\nLotz et al. 2006; Conselice & Arnold 2009, This Paper).\nAlthough these disturbances do not necessarily need to\nbe explained by galaxy mergers, it does suggest that bulk\nmaterial is coming in, perhaps in the form of giant gas\nclouds or minor mergers. Conselice & Arnold (2009) find\nthat the fraction of z ∼ 4 B-dropouts forming a pair\nwith another B-dropout is very similar to the fraction\nof disturbed morphologies: ∼20% within a 20 h−1 kpc\nprojected radius. Interpreting the similarity in the pair\ncounts and morphologies as evidence for merging, they\nestimate that a ∼ 1010 M⊙ galaxy will undergo a major merger every 1–2 Gyr at z ∼ 3 − 4. Similar high\nmerger rates were obtained for z ∼ 2 − 3, possibly with\nan increase towards the most massive and most luminous\ngalaxies (Conselice et al. 2003; Conselice & Arnold 2009;\nBluck et al. 2009). With such high inferred merger rates,\nthe mass growth of LBGs due to these mergers could\nmake a significant contribution to the mass growth at\nz ∼ 3 compared to that due to star formation fueled by\na more continuous gas accretion and sustained over a period of a Gyr at a rate of ∼ 10 M⊙ yr−1 . Perhaps these\n\n11\n\ntwo channels of formation are not contradictory given\nthat the high density environments of LBGs are likely to\nbe simultaneously associated with both frequent mergers of small galaxies and rapid cold accretion (likely with\nsome level of lumpiness).\nConselice & Arnold (2009) suggest that the remaining 70–80% of LBGs, that appear as relatively\nsmooth/symmetric and are forming stars at a similarly\nhigh rate as the disturbed objects, could be the result\nfrom rapid gas collapse, provided that a sufficiently long\namount of time (&0.5 Gyr) has passed since their last major merger otherwise this would have been apparent in\ntheir morphology given the high (inferred) merger rates.\nHowever, our new results based on LBAs present an important caveat to this interpretation: we have shown\nthat, at least for galaxies at high redshift similar to\nLBAs, in the majority of cases we are not able to detect significant disturbances or asymmetries to their morphologies (mostly because of redshift effects, and not because they are not there). This allows for the possibility\nthat the fraction of galaxies at high redshift that is undergoing interactions could be much higher than currently\ninferred from the observations. Alternatively, less violent\naccretion processes coupled with large disk instabilities\nat high redshift are capable of triggering starbursts at\nlevels only seen in low redshift, merger-induced samples\nsuch as the LBAs. Future deep, high resolution observations of rest-frame optical morphologies and kinematics\n(see below), together with constraints on the LBG pair\nfractions and small-scale clustering (Conselice & Arnold\n2009; Cooke et al. 2009) will perhaps allow us to distinguish between these scenarios.\n4.4. Relation to Studies of Gas kinematics\n\nIn recent years, the study of high redshift LBGs has advanced considerably beyond studies that are based purely\non morphology. Mainly through the use of integral field\nspectrographs in the near-infrared it has become feasible to determine the basic kinematical properties of the\nemission line gas as well. Motivated by the high degree of similarity in the properties of our locally selected\nUV-luminous galaxies and those at high redshift, it is\na useful exercise to compare the gas kinematics of LBAs\nand LBGs. In a first study published by Basu-Zych et al.\n(2009), the bright Pa-α emission line was used to study\nthe resolved gas dynamics in 3 of our LBAs. In two cases,\na mild velocity gradient was found, but in all three cases\nthe kinematics were dominated by the dispersion rather\nthan structured rotation (v/σ ∼ 1 − 2). Simulating the\ndata at z ∼ 2 demonstrated that the (gas) kinematical\nproperties of these objects are similar to the kinematical\nprofiles commonly seen at high redshift (e.g. Law et al.\n2007, 2009; Genzel et al. 2008; Förster Schreiber et al.\n2009; Lowenthal et al. 2009).\nLehnert et al. (2009) argued that neither the selfgravity of disks fueled by gas accretion flows nor the\ninternal velocity dispersions of massive star-forming\nclumps can fully explain the high velocity dispersions\nobserved at high redshift. Furthermore, the most massive of clumps observed possibly would not have been\nformed at all if the gas turbulence in the disk was not\nhigh enough to begin with (Elmegreen et al. 2009), while\nmergers alone may not be sufficient to explain those objects dominated by a large number of massive clumps\n\n\f12\n\nR.A. Overzier et al.\n\nin so-called \"clump-cluster\" or \"chain galaxy\" configurations at high redshift (Bournaud & Elmegreen 2009).\nInstead, Lehnert et al. (2009) suggest that the kinematic\nproperties of the ISM in starburst galaxies is affected by\nthe mechanical energy input resulting from massive star\nformation. In this scenario, the starbursts that are associated with each of the clumps drive blast waves from\nsupernovae (SN) and stellar winds that appear sufficient\nto give rise to the high gas pressures and high velocity dispersions observed. As shown in Overzier et al.\n(2009), some LBAs show very high pressures and clear\nevidence for an ISM that is dominated by starburstand SN-feedback associated with massive star-forming\nclumps, consistent with such a scenario. If this is correct, then estimates for the merger rates at high redshift estimated from pair counts or morphologies are\nperhaps less biased than those obtained from the (ionized) gas kinematics because the latter may not always\ntrace galaxy interactions, if present, very well. In addition, Robertson & Bullock (2008) have shown with simulations that at least some merging systems would still be\nclassified as \"disks\" using the methodology applied to observations at z ∼ 2 by Shapiro et al. (2008). The simulations of Robertson & Bullock (2008) also show how some\nof the main structural, spectral and chemical properties\nof certain BzK galaxies can be explained in the context of gas-rich mergers as well, eventhough it has been\nclaimed that such systems cannot be merger remnants.\nSimilar studies of the gas kinematics in LBAs as initiated by Basu-Zych et al. (2009) will be very useful, and\nwill allow us to carefully test the methods typically applied to high redshift starbursts in a suitable low redshift\ncomparison sample. Results on the kinematical properties in a much larger sample of LBAs are forthcoming\n(Gonçalves et al. 2010, in prep.).\n5. SUMMARY\n\n• We have compared the sample of 30 nearby UVselected starburst galaxies from Overzier et al. (2009)\nwith samples of starburst galaxies at z ∼ 2, z ∼ 3 and\nz ∼ 4 selected from the Hubble Ultra Deep Field ACS\nand WFC3 observations.\n• These so-called Lyman Break Analogs have comparable UV colors (a probe of dust), UV-optical colors (a\nprobe of age), metallicity and half-light radii compared\nto BzK galaxies at z ∼ 2 and LBGs at z ∼ 3 − 4 all\nselected to have the same rest-frame UV luminosity (a\nprobe of SFR) of LUV & 0.3Lz=3\n∗ .\n• LBAs lie on a stellar mass-metallicity relation that\nis offset from typical local galaxies of the same mass,\nbut similar to that observed for starburst galaxies at\nz ∼ 2. This indicates that these starburst galaxies\nare still in the process of converting relatively pristine gas into stars or had a recent accretion event of\nmetal-poor gas, possibly coupled with outflows of metals.\n• We have determined the morphological parameters\n(G, C, A, and M20 ) of LBAs in the rest-frame UV and\noptical, and performed redshift simulations to study\nthe effects of degradations in physical resolution and\nsensitivity on morphological classifications. The high\nUV luminosities of the LBAs allow us to make such a\n\ncomparison without the need for artificial brightening\nas employed in previous studies. While at low redshift\nmost LBAs can be classified as being disturbed (only!)\non the basis of a high asymmetry, there is a significant\nreduction in the asymmetries at high redshift. This\nreduction is less in the optical than in the UV. These\nresults suggest that morphological disturbances in\nstarburst galaxies similar to LBAs can be easily missed\nin current observations of high redshift galaxies.\n• We have compared the morphologies of BzKs\nand LBGs with those of LBAs simulated at a similar\nredshift. For the rest-frame UV and optical comparison,\nthe LBAs were simulated in ACS/WFC V606 and\nWFC3/IR H160 images, respectively, having similar\nexposure times as the actual HUDF observations. The\nmeasured morphologies are generally very similar for\nthe three samples with a few exceptions: the median\nM20 of LBGs at z ∼ 3 − 4 is larger than that of LBAs,\nwhile BzK galaxies have the highest A and M20 and\nthe lowest C and G, consistent with a higher degree of\nclumpiness. BzK galaxies are also somewhat redder and\nlarger than LBGs (and LBAs), consistent with previous\nfindings.\n• It has been suggested that high redshift galaxies\nexperience intense bursts unlike anything seen in the\nlocal universe, possibly due to cold flows and instabilities. In part, this is based on the fact that the majority\n(∼70%) of LBGs do not show morphological signatures\nof interactions or mergers. Our results suggest that this\nevidence is insufficient, since in the majority of cases\nwe are not able to detect significant disturbances or\nasymmetries in LBAs artificially redshifted to z ∼ 2 − 4.\nLikewise, some conclusions drawn from the nebular\ngas kinematics in LBGs have also been shown to be\nambiguous. This leaves open the possibility that, at\nleast in starburst galaxies such as the ones discussed\nhere, clumpy accretion and mergers remain important\nprocesses, possibly together with rapid gas accretion\nthrough other means.\nAs advocated in this paper, the HST sample of LBAs is\nextremely well-suited for performing morphological comparisons with other samples of galaxies at a wide redshift range, or, for example, for testing morphological\nclassification schemes. In the next decade we can expect\nsignificant improvements in the measurements of merger\nrates, morphologies, gas fractions and gas and stellar\nkinematics in large samples of high redshift galaxies using the James Webb Space Telescope (JWST), the Atacama Large Millimeter Array (ALMA), the Extremely\nLarge Telescope (ELT), and the Square Kilometer Array\n(SKA). Also, improved semi-analytic modeling of high\nredshift galaxies and detailed hydro-simulations of the\nformation and evolution of clumpy systems will better\nconstrain the importance of mergers, infall and general\ndissipational processes as a function of redshift. The\nstudy of similar processes occurring in nearby galaxies\nsuch as the LBAs studied in this paper provides an invaluable tool for comparing with the observational record\nat high redshift. The authors would be happy to make\nthe calibrated images available on request.\n\n\fMorphologies of local Lyman break galaxy analogs\n\n13\n\nTABLE 2\nSummary of Medians and Scatters† for the Morphological Parameters from Figs. 5–7.\nRest-UV\n\nRest-optical\nM20\n\nSample\n\nhzi\n\nG\n\nC\n\nM20\n\nA\n\nG\n\nC\n\nLBA\n...\n...\n...\nBzK\nLBG\nLBG\n\n0.2\n2.0\n3.0\n4.0\n2.0\n3.0\n4.0\n\n0.60 ± 0.04\n0.58 ± 0.05\n0.59 ± 0.04\n0.55 ± 0.05\n0.54 ± 0.11\n0.52 ± 0.18\n0.52 ± 0.18\n\n3.13 ± 0.57\n3.15 ± 0.51\n3.18 ± 0.49\n3.09 ± 0.46\n2.51 ± 0.73\n2.69 ± 0.99\n2.75 ± 1.05\n\n−1.56 ± 0.36\n−1.74 ± 0.23\n−1.79 ± 0.25\n−1.83 ± 0.29\n−1.12 ± 0.42\n−1.36 ± 0.55\n−1.44 ± 0.59\n\n0.44 ± 0.15\n0.25 ± 0.09\n0.22 ± 0.07\n0.20 ± 0.05\n0.34 ± 0.13\n0.23 ± 0.14\n0.14 ± 0.11\n\n0.61 ± 0.05\n0.54 ± 0.04\n0.52 ± 0.03\n...\n0.49 ± 0.08\n0.50 ± 0.04\n...\n\n3.62 ± 1.38\n2.89 ± 0.34\n2.90 ± 0.40\n...\n2.58 ± 0.31\n2.72 ± 0.27\n...\n\n−1.56 ± 0.77\n−1.77 ± 0.20\n−1.76 ± 0.26\n...\n−1.60 ± 0.19\n−1.65 ± 0.22\n...\n\nA\n0.44 ± 0.15\n0.36 ± 0.10\n0.36 ± 0.15\n...\n0.29 ± 0.18\n0.25 ± 0.18\n...\n\n† The standard deviation on the mean is estimated from the bias-corrected sample variance. Note, however, that the distributions are often not symmetric\naround the median or mean.\n\nTABLE 3\nStatistical Significance† of the Differences between Morphological\nParameters from Figs. 5–7 in the rest-frame UV.\nSample\nLBA–LBA\n...\n...\nLBA–BzK\nLBA–LBG\nLBA–LBG\n\nhzi\n0.2→2.0\n0.2→3.0\n0.2→4.0\n2.0→2.0\n3.0→3.0\n4.0→4.0\n\nG\n\nC\n\nM20\n\nA\n\nR\n\nKS\n\nR\n\nKS\n\nR\n\nKS\n\nR\n\nKS\n\n–0.34\n–0.24\n–0.77\n–0.35\n–0.39\n–0.17\n\n3e–1\n1e–1\n1e–2\n5e–3\n1e–3\n8e–2\n\n0.02\n0.07\n–0.05\n–0.72\n–0.45\n–0.29\n\n5e–1\n2e–1\n5e–1\n6e–4\n3e–4\n1e–2\n\n–0.43\n–0.51\n–0.58\n1.30\n0.71\n0.59\n\n5e–2\n5e–2\n1e–1\n6e–8\n3e–6\n7e–4\n\n–1.10\n–1.32\n–1.54\n0.60\n0.08\n–0.52\n\n5e–6\n2e–9\n6e–11\n1e–2\n2e–1\n3e–4\n\n† We define the significance using the parameters R and KS. R ≡ (P − P )/ σ2 + σ2 , where P\n2\n1\ni\nP2\nP1\nr\n\nand σP are the median and standard deviation of the morphological parameter P measured for sample\ni\ni. The standard deviation is estimated from the bias-corrected sample variance. The parameters KS\nindicate the value of significance that the null hypothesis is true for the two-sided K-S statistic applied\nto each pair of samples.\n\nTABLE 4\nStatistical Significance† of the Differences between Morphological\nParameters from Figs. 5–7 in the rest-frame optical.\nSample\nLBA–LBA\n...\n...\nLBA–BzK\nLBA–LBG\nLBA–LBG\n\nhzi\n0.2→2.0\n0.2→3.0\n0.2→4.0\n2.0→2.0\n3.0→3.0\n4.0→4.0\n\nG\n\nC\n\nM20\n\nA\n\nR\n\nKS\n\nR\n\nKS\n\nR\n\nKS\n\nR\n\nKS\n\n–1.10\n–1.49\n...\n–0.58\n–0.35\n...\n\n2e–5\n6e–8\n...\n6e–5\n5e–2\n...\n\n–0.52\n–0.50\n...\n–0.66\n–0.38\n...\n\n2e–3\n2e–3\n...\n3e–4\n4e–2\n...\n\n–0.26\n–0.25\n...\n0.61\n0.32\n...\n\n5e–3\n1e–1\n...\n7e–4\n5e–2\n...\n\n–0.46\n–0.39\n...\n–0.36\n–0.47\n...\n\n5e–2\n1e–1\n...\n3e–1\n5e–2\n...\n\n† We define the significance using the parameters R and KS. R ≡ (P − P )/ σ2 + σ2 , where P\n2\n1\ni\nP\nP\nr\n\n2\n1\nand σP are the median and standard deviation of the morphological parameter P measured for sample\ni\ni. The standard deviation is estimated from the bias-corrected sample variance. The parameters KS\nindicate the value of significance that the null hypothesis is true for the two-sided K-S statistic applied\nto each pair of samples.\n\nWe are grateful to Xu Kong for providing us with\nthe source list of BzK galaxies in the Hubble Ultra\nDeep Field from Kong et al. (2008). We thank Guinevere Kauffmann, Qi Guo and Eyal Neistein for sharing\ntheir insight on the different gas accretion modes. We\nthank Brant Robertson, James Bullock, Marc Rafelski\nand Jeff Cooke for very useful comments to a previous\n\nversion of this paper submitted to the e-print archive.\nBased on observations made with the NASA/ESA\nHubble Space Telescope, which is operated by the Association of Universities for Research in Astronomy, Inc.,\nunder NASA contract NAS 5-26555. These observations\nare associated with programs #10920, 11107 and 11563.\n\nREFERENCES\nAbraham, R. G., van den Bergh, S., Glazebrook, K., Ellis, R. S.,\nSantiago, B. X., Surma, P., & Griffiths, R. E. 1996, ApJS, 107,\n1\nAbraham, R. G., van den Bergh, S., & Nair, P. 2003, ApJ, 588,\n218\n\nBasu-Zych, A. R., et al. 2007, ApJS, 173, 457\nBasu-Zych, A., et al. 2009, ApJ, 699, L118\nBeckwith, S. V. W., et al. 2006, AJ, 132, 1729\nBirnboim, Y., & Dekel, A. 2003, MNRAS, 345, 349\n\n\f14\n\nR.A. Overzier et al.\n\nBluck, A. F. L., Conselice, C. J., Bouwens, R. J., Daddi, E.,\nDickinson, M., Papovich, C., & Yan, H. 2009, MNRAS, 394,\nL51\nBournaud, F., & Elmegreen, B. G. 2009, ApJ, 694, L158\nBouwens, R. J., Illingworth, G. D., Blakeslee, J. P., Broadhurst,\nT. J., & Franx, M. 2004, ApJ, 611, L1\nBouwens, R. J., et al. 2009a, ApJ, Submitted (arXiv:0909.1803)\nBouwens, R. J., et al. 2009b, ApJ, 705, 936\nBurgarella, D., et al. 2006, A&A, 450, 69\nCalzetti, D. 2001, PASP, 113, 1449\nCardamone, C. N., et al. 2009, MNRAS, 399, 1191\nCoe, D., Benı́tez, N., Sánchez, S. F., Jee, M., Bouwens, R., &\nFord, H. 2006, AJ, 132, 926\nConselice, C. J., Bershady, M. A., & Jangren, A. 2000, ApJ, 529,\n886\nConselice, C. J., Bershady, M. A., Dickinson, M., & Papovich, C.\n2003, AJ, 126, 1183\nConselice, C. J., & Arnold, J. 2009, MNRAS, 397, 208\nCooke, J., Berrier, J. C., Barton, E. J., Bullock, J. S., & Wolfe,\nA. M. 2009, MNRAS, in press (arXiv:0912.1632)\nDaddi, E., Cimatti, A., Renzini, A., Fontana, A., Mignoli, M.,\nPozzetti, L., Tozzi, P., & Zamorani, G. 2004, ApJ, 617, 746\nDahlen, T., Mobasher, B., Dickinson, M., Ferguson, H. C.,\nGiavalisco, M., Kretchmer, C., & Ravindranath, S. 2007, ApJ,\n654, 172\nDekel, A., Sari, R., & Ceverino, D. 2009, ApJ, 703, 785\nElmegreen, D. M., Elmegreen, B. G., Rubin, D. S., & Schaffer,\nM. A. 2005, ApJ, 631, 85\nElmegreen, B. G., Bournaud, F., & Elmegreen, D. M. 2008, ApJ,\n688, 67\nElmegreen, D. M., Elmegreen, B. G., Marcus, M. T., Shahinyan,\nK., Yau, A., & Petersen, M. 2009, ApJ, 701, 306\nElmegreen, B. G., Elmegreen, D. M., Fernandez, M. X., &\nLemonias, J. J. 2009, ApJ, 692, 12\nErb, D. K., Shapley, A. E., Pettini, M., Steidel, C. C., Reddy,\nN. A., & Adelberger, K. L. 2006, ApJ, 644, 813\nFerguson, H. C., et al. 2004, ApJ, 600, L107\nFörster Schreiber, N. M., et al. 2009, ApJ, 706, 1364\nGenzel, R., et al. 2008, ApJ, 687, 59\nGonçalves, T. et al. 2010, In prep.\nGrazian, A., et al. 2007, A&A, 465, 393\nGrimes, J. P., et al. 2007, ApJ, 668, 891\nGuo, Q., & White, S. D. M. 2008, MNRAS, 384, 2\nGuo, Q., & White, S. D. M. 2009, MNRAS, 396, 39\nHeckman, T. M., Robert, C., Leitherer, C., Garnett, D. R., & van\nder Rydt, F. 1998, ApJ, 503, 646\nHeckman, T. M., et al. 2005, ApJ, 619, L35\nHibbard, J. E., & Vacca, W. D. 1997, AJ, 114, 1741\nHoopes, C., et al. 2007, ApJS, 173, 441\nHopkins, P. F., et al. 2009, MNRAS, 397, 802\nKitzbichler, M. G., & White, S. D. M. 2008, MNRAS, 391, 1489\nKoekemoer, A. M., Fruchter, A. S., Hook, R. N., & Hack, W.\n2002, The 2002 HST Calibration Workshop : Hubble after the\nInstallation of the ACS and the NICMOS Cooling System,\nProceedings of a Workshop held at the Space Telescope Science\nInstitute, Baltimore, Maryland, October 17 and 18,\n2002. Edited by Santiago Arribas, Anton Koekemoer, and\nBrad Whitmore. Baltimore, MD: Space Telescope Science\nInstitute, 2002., p.337, 337\nKong, X., Zhang, W., & Wang, M. 2008, Chinese Journal of\nAstronomy and Astrophysics, 8, 1\n\nLaw, D. R., Steidel, C. C., Erb, D. K., Larkin, J. E., Pettini, M.,\nShapley, A. E., & Wright, S. A. 2007, ApJ, 669, 929\nLaw, D. R., Steidel, C. C., Erb, D. K., Larkin, J. E., Pettini, M.,\nShapley, A. E., & Wright, S. A. 2009, ApJ, 697, 2057\nLehnert, M. D., Nesvadba, N. P. H., Tiran, L. L., Matteo, P. D.,\nvan Driel, W., Douglas, L. S., Chemin, L., & Bournaud, F.\n2009, ApJ, 699, 1660\nLisker, T. 2008, ApJS, 179, 319\nLotz, J. M., Primack, J., & Madau, P. 2004, AJ, 128, 163\nLotz, J. M., Madau, P., Giavalisco, M., Primack, J., & Ferguson,\nH. C. 2006, ApJ, 636, 592\nLotz, J. M., Jonsson, P., Cox, T. J., & Primack, J. R. 2008,\nMNRAS, 391, 1137\nLowenthal, J. D., Koo, D. C., Simard, L., & van Kampen, E.\n2009, ApJ, 703, 198\nMeurer, G. R., Heckman, T. M., Leitherer, C., Kinney, A.,\nRobert, C., & Garnett, D. R. 1995, AJ, 110, 2665\nMeurer, G. R., Heckman, T. M., Lehnert, M. D., Leitherer, C., &\nLowenthal, J. 1997, AJ, 114, 54\nMeurer, G. R., Heckman, T. M., & Calzetti, D. 1999, ApJ, 521, 64\nNonino, M., et al. 2009, ApJS, 183, 244\nOesch, P. A., et al. 2009a, ApJ, In Press (arXiv:0909.1806)\nOesch, P. A., et al. 2009b, ApJ, In Press (arXiv:0909.5183)\nÖstlin, G., Hayes, M., Kunth, D., Mas-Hesse, J. M., Leitherer, C.,\nPetrosian, A., & Atek, H. 2009, AJ, 138, 923\nOverzier, R. A., et al. 2008, ApJ, 677, 37\nOverzier, R. A., et al. 2009, ApJ, 706, 203\nPapovich, C., Dickinson, M., Giavalisco, M., Conselice, C. J., &\nFerguson, H. C. 2005, ApJ, 631, 101\nPettini, M., & Pagel, B. E. J. 2004, MNRAS, 348, L59\nPetty, S. M., de Mello, D. F., Gallagher, J. S., Gardner, J. P.,\nLotz, J. M., Matt Mountain, C., & Smith, L. J. 2009, AJ, 138,\n362\nRafelski, M., Wolfe, A. M., Cooke, J., Chen, H.-W., Armandroff,\nT. E., & Wirth, G. D. 2009, ApJ, 703, 2033\nRavindranath, S., et al. 2006, ApJ, 652, 963\nRawat, A., Wadadekar, Y., & De Mello, D. 2009, ApJ, 695, 1315\nReddy, N. A., Erb, D. K., Steidel, C. C., Shapley, A. E.,\nAdelberger, K. L., & Pettini, M. 2005, ApJ, 633, 748\nReddy, N. A., Steidel, C. C., Erb, D. K., Shapley, A. E., &\nPettini, M. 2006, ApJ, 653, 1004\nRobertson, B. E., & Bullock, J. S. 2008, ApJ, 685, L27\nSantini, P., et al. 2009, A&A, 504, 751\nSavaglio, S., et al. 2005, ApJ, 635, 260\nScarlata, C., et al. 2007, ApJS, 172, 406\nShapiro, K. L., et al. 2008, ApJ, 682, 231\nSomerville, R. S., Primack, J. R., & Faber, S. M. 2001, MNRAS,\n320, 504\nSomerville, R. S., Hopkins, P. F., Cox, T. J., Robertson, B. E., &\nHernquist, L. 2008, MNRAS, 391, 481\nSteidel, C. C., Adelberger, K. L., Giavalisco, M., Dickinson, M.,\n& Pettini, M. 1999, ApJ, 519, 1\nTremonti, C. A., et al. 2004, ApJ, 613, 898\nTrujillo, I., et al. 2006, ApJ, 650, 18\nZaritsky, D., Kennicutt, R. C., Jr., & Huchra, J. P. 1994, ApJ,\n420, 87\n\n\f"}