{"id": "http://arxiv.org/abs/0906.5457v1", "guidislink": true, "updated": "2009-06-30T10:02:54Z", "updated_parsed": [2009, 6, 30, 10, 2, 54, 1, 181, 0], "published": "2009-06-30T10:02:54Z", "published_parsed": [2009, 6, 30, 10, 2, 54, 1, 181, 0], "title": "Laser induced magnetization switching in films with perpendicular\n  anisotropy: a comparison between measurements and a multi-macrospin model", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0906.5448%2C0906.2712%2C0906.1808%2C0906.4616%2C0906.1462%2C0906.3246%2C0906.2751%2C0906.1145%2C0906.2228%2C0906.2066%2C0906.2010%2C0906.2352%2C0906.2550%2C0906.2101%2C0906.3060%2C0906.4661%2C0906.0999%2C0906.5202%2C0906.5457%2C0906.3500%2C0906.3682%2C0906.1745%2C0906.4312%2C0906.1222%2C0906.3021%2C0906.5383%2C0906.3911%2C0906.3896%2C0906.4386%2C0906.0339%2C0906.4784%2C0906.3249%2C0906.3739%2C0906.2905%2C0906.5351%2C0906.0839%2C0906.4120%2C0906.1862%2C0906.5258%2C0906.2995%2C0906.5204%2C0906.2746%2C0906.0761%2C0906.0171%2C0906.1144%2C0906.1610%2C0906.0735%2C0906.4467%2C0906.5003%2C0906.1156%2C0906.5194%2C0906.3351%2C0906.0675%2C0906.1368%2C0906.2636%2C0906.3099%2C0906.3356%2C0906.2011%2C0906.2511%2C0906.5156%2C0906.5489%2C0906.1735%2C0906.0664%2C0906.2971%2C0906.3590%2C0906.0299%2C0906.2615%2C0906.4151%2C0906.3237%2C0906.1587%2C0906.2090%2C0906.4422%2C0906.2833%2C0906.2733%2C0906.2028%2C0906.2116%2C0906.3493%2C0906.3213%2C0906.1226%2C0906.2850%2C0906.2146%2C0906.2432%2C0906.3699%2C0906.2788%2C0906.1421%2C0906.2017%2C0906.2909%2C0906.3945%2C0906.2391%2C0906.3165%2C0906.3504%2C0906.4176%2C0906.4330%2C0906.1299%2C0906.1705%2C0906.5470%2C0906.1612%2C0906.0860%2C0906.1302%2C0906.3854%2C0906.3728&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Laser induced magnetization switching in films with perpendicular\n  anisotropy: a comparison between measurements and a multi-macrospin model"}, "summary": "Thermally-assisted ultra-fast magnetization reversal in a DC magnetic field\nfor magnetic multilayer thin films with perpendicular anisotropy has been\ninvestigated in the time domain using femtosecond laser heating. The experiment\nis set-up as an optically pumped stroboscopic Time Resolved Magneto-Optical\nKerr Effect magnetometer. It is observed that a modest laser fluence of about\n0.3 mJ/square-cm induces switching of the magnetization in an applied field\nmuch less than the DC coercivity (0.8 T) on the sub-nanosecond time-scale. This\nswitching was thermally-assisted by the energy from the femtosecond pump-pulse.\nThe experimental results are compared with a model based on the Landau\nLifschitz Bloch equation. The comparison supports a description of the reversal\nprocess as an ultra-fast demagnetization and partial recovery followed by\nslower thermally activated switching due to the spin system remaining at an\nelevated temperature after the heating pulse.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0906.5448%2C0906.2712%2C0906.1808%2C0906.4616%2C0906.1462%2C0906.3246%2C0906.2751%2C0906.1145%2C0906.2228%2C0906.2066%2C0906.2010%2C0906.2352%2C0906.2550%2C0906.2101%2C0906.3060%2C0906.4661%2C0906.0999%2C0906.5202%2C0906.5457%2C0906.3500%2C0906.3682%2C0906.1745%2C0906.4312%2C0906.1222%2C0906.3021%2C0906.5383%2C0906.3911%2C0906.3896%2C0906.4386%2C0906.0339%2C0906.4784%2C0906.3249%2C0906.3739%2C0906.2905%2C0906.5351%2C0906.0839%2C0906.4120%2C0906.1862%2C0906.5258%2C0906.2995%2C0906.5204%2C0906.2746%2C0906.0761%2C0906.0171%2C0906.1144%2C0906.1610%2C0906.0735%2C0906.4467%2C0906.5003%2C0906.1156%2C0906.5194%2C0906.3351%2C0906.0675%2C0906.1368%2C0906.2636%2C0906.3099%2C0906.3356%2C0906.2011%2C0906.2511%2C0906.5156%2C0906.5489%2C0906.1735%2C0906.0664%2C0906.2971%2C0906.3590%2C0906.0299%2C0906.2615%2C0906.4151%2C0906.3237%2C0906.1587%2C0906.2090%2C0906.4422%2C0906.2833%2C0906.2733%2C0906.2028%2C0906.2116%2C0906.3493%2C0906.3213%2C0906.1226%2C0906.2850%2C0906.2146%2C0906.2432%2C0906.3699%2C0906.2788%2C0906.1421%2C0906.2017%2C0906.2909%2C0906.3945%2C0906.2391%2C0906.3165%2C0906.3504%2C0906.4176%2C0906.4330%2C0906.1299%2C0906.1705%2C0906.5470%2C0906.1612%2C0906.0860%2C0906.1302%2C0906.3854%2C0906.3728&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Thermally-assisted ultra-fast magnetization reversal in a DC magnetic field\nfor magnetic multilayer thin films with perpendicular anisotropy has been\ninvestigated in the time domain using femtosecond laser heating. The experiment\nis set-up as an optically pumped stroboscopic Time Resolved Magneto-Optical\nKerr Effect magnetometer. It is observed that a modest laser fluence of about\n0.3 mJ/square-cm induces switching of the magnetization in an applied field\nmuch less than the DC coercivity (0.8 T) on the sub-nanosecond time-scale. This\nswitching was thermally-assisted by the energy from the femtosecond pump-pulse.\nThe experimental results are compared with a model based on the Landau\nLifschitz Bloch equation. The comparison supports a description of the reversal\nprocess as an ultra-fast demagnetization and partial recovery followed by\nslower thermally activated switching due to the spin system remaining at an\nelevated temperature after the heating pulse."}, "authors": ["C. Bunce", "J. Wu", "G. Ju", "B. Lu", "D. Hinzke", "N. Kazantseva", "U. Nowak", "R. W. Chantrell"], "author_detail": {"name": "R. W. Chantrell"}, "author": "R. W. Chantrell", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.81.174428", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0906.5457v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0906.5457v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "8 pages, 10 figures, to be submitted to PRB", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0906.5457v1", "affiliation": "University of York - York - England", "arxiv_url": "http://arxiv.org/abs/0906.5457v1", "journal_reference": null, "doi": "10.1103/PhysRevB.81.174428", "fulltext": "Laser induced magnetization switching in films with perpendicular anisotropy: a\ncomparison between measurements and a multi-macrospin model\nC. Bunce1 , J. Wu1 ,∗ G. Ju2 , B. Lu2 , D. Hinzke3 , N. Kazantseva1, U. Nowak3, and R. W. Chantrell1\n\narXiv:0906.5457v1 [cond-mat.mtrl-sci] 30 Jun 2009\n\n2\n\n1\nDepartment of Physics, University of York, York YO10 5DD, U. K.\nSeagate Technology, Recording Media Operations, Fremont, CA, U. S. A and\n3\nFachbereich Physik, Universität Konstanz, 78457 Konstanz, Germany\n\nThermally-assisted ultra-fast magnetization reversal in a DC magnetic field for magnetic multilayer thin films with perpendicular anisotropy has been investigated in the time domain using\nfemtosecond laser heating. The experiment is set-up as an optically pumped stroboscopic Time\nResolved Magneto-Optical Kerr Effect magnetometer. It is observed that a modest laser fluence\nof about 0.3 mJ/cm2 induces switching of the magnetization in an applied field much less than\nthe DC coercivity (0.8 T) on the sub-nanosecond time-scale. This switching was thermally-assisted\nby the energy from the femtosecond pump-pulse. The experimental results are compared with a\nmodel based on the Landau Lifschitz Bloch equation. The comparison supports a description of the\nreversal process as an ultra-fast demagnetization and partial recovery followed by slower thermally\nactivated switching due to the spin system remaining at an elevated temperature after the heating\npulse.\nPACS numbers: 75.50.Ss 75.40.Mg 75.40.gb 76.60.es\n\nI.\n\nINTRODUCTION\n\nThere is currently considerable interest in ultra-fast\nlaser-induced magnetization processes. Since the demonstration by Beaurepaire et al.1 that the magnetization can respond on the picosecond timescale to heat\npulses produced by femtosecond lasers, a number of\ngroups2,3,4 have studied magnetization processes on this\ntimescale. Experiments generally use pump-probe processes in which a high energy laser pulse is used to heat\nthe sample and a low energy probe pulse (split from the\nmain pulse) is used to monitor the magnetic response using the Magneto-Optical Kerr Effect (MOKE). Much of\nthis work has investigated the dynamics of the destruction and recovery of the magnetization, which can occur\non the sub-picosecond timescale, although the recovery\ncan take an order of magnitude longer due to frustration\neffects among large numbers of nucleation sites at which\nthe recovery starts locally5 .\nThe dynamics of reversal during a pulsed laser experiment in the presence of an applied field has received less\nattention. Hohlfeld et al.2 investigated the magnetization reversal induced by 100 fs laser pulses in a GdFeCo\nMagneto-Optical recording medium with perpendicular\nanisotropy. They observed an ultra-fast demagnetization\nof the film occurring within the first picosecond; followed\nby a slower recovery, taking nearly a nanosecond, in the\ndirection of the applied field as the heat drains from the\nmedia layer. They analyzed their measurements using\nthe Bloch equation and concluded that the reversal process was governed by the nucleation and growth of domains in the applied field.\nLaser assisted magnetization processes have considerable potential for future ultra-high density recording\nsystems. Essentially, the path to higher densities requires continuous reduction in the grain volume V of\nthe storage medium, necessitating an increase in the\n\nmagneto-crystalline anisotropy energy density K in order to preserve a sufficiently large value of the parameter\nKV /kB T (∼ 60) to ensure thermal stability of written\ninformation6 . However, the large value of K impacts the\nwritability of the information, and some scheme is required to overcome this problem. A promising solution is\nHybrid or Heat Assisted Magnetic Recording (HAMR)7\nin which the medium is heated in order to lower the\nanisotropy and thereby allow information to be written to\nthe medium. Since this is a relatively new field the magnetization reversal mechanisms are not well understood.\nAlthough the work of Hohlfeld et al.2 has demonstrated\nthermally activated domain processes in magneto-optical\nmedia, perpendicular recording requires relatively weakly\ncoupled granular media in which domain processes are\nnot the dominant reversal mechanism.\n\nThis paper presents time-domain measurements of the\nmagnetization reversal process induced by an ultra-fast\nlaser pulse in a thin film with perpendicular anisotropy.\nThe film was especially designed to have a low Curie temperature in order to simplify the experiments. We compare the results with a computational model using the\nLandau-Lifshitz-Bloch (LLB) equation10 , which is ideally\nsuited to simulation of magnetization processes up to and\nbeyond Tc and has been shown11,12 to give an excellent\ndescription of the physics of pulsed laser processes. It\nis concluded that the magnetization response consists of\na fast demagnetization followed by a slower response in\nwhich the magnetization evolves into the field direction\nby a process of thermally activated transitions over the\nlocal energy barriers. Our LLB-micromagnetic model is\nshown to give a good description of the physics of the\nreversal process on both timescales.\n\n\f2\nII.\n\nMETHOD\n\nThe experiment is a stroboscopic pump-probe experiment using a strong laser pulse to initiate a change in\nthe magnetic state of the sample and a weak probe pulse\nto observe the resulting magnetization dynamics via the\nMOKE. The sample is mounted in a spin-stand which\nfirst moves the magnetic film through a reset field of magnitude ∼ 1T for a duration of 0.2 ms which ensures that\nthe sample is in a remanent state before exposure to each\nlaser pulse. Fig. 1 illustrates the spin-stand arrangement,\nwith the insert showing the temporal field profile experienced by the magnetic film. After resetting to saturation\nthe sample then moves into a perpendicular applied field\nfrom an electromagnet (field range of ±0.52 T). We note\nthat the field applied is always lower than the static coercivity of the sample as measured at room temperature by\na vibrating sample magnetometer. At the center of the\npole piece a small hole allows optical access to the sample\nat which point the sample is exposed to the pump-pulse.\nThe laser pulses arrive at a rate of 1 kHz but the rotation\nof the spin-stand (about 7,000 rpm) ensures that freshly\nsaturated film arrives between pulses.\n\nregion probed. The probe approaches the sample surface\nat near normal incidence; this polar MOKE geometry\nyields sensitivity to the out-of-plane component of magnetization. The reflected probe beam is directed into\nan optical bridge detector which uses a Wollaston prism\nto split the beam into two orthogonal polarized components which impinge on a two segment photo-detector.\nBy rotating the detector to the angle where the output\nof the two polarization channels (A & B) are approximately equal, then the difference between them (A-B) is\nsensitive to small changes of the polarization angle of the\nreflected probe which in turn is proportional to mz . The\nsum (A+B) is sensitive to changes in reflectivity ∆R,\nwhich is associated with temperature changes and stress\nwaves due to processes such as lattice expansions. In order to improve immunity to laser drift the pump beam\nwas chopped and lock-in amplifiers used to detect the\nsum and difference signals. This makes the measurement\nsensitive to the difference between the state of the sample without the pump pulse applied and the state induced\nby the pump-pulse. Therefore the measurements are relative and it is difficult to assign an absolute scale to the\nmagnetization changes.\n\nIII.\n\nFIG. 1: Illustration of spin-stand arrangement used to ensure\nthe materials magnetization is reset between pump pulses.\n\nThe stroboscopic experiment uses a Libra laser system\n(made by Coherent) which can produce a 1 kHz stream\nof 1 mJ, 150 fs pulses of 800 nm radiation. This beam\nis attenuated, the probe beam is split off and frequency\ndoubled to 400 nm. The pump beam is routed around\nan optical delay line with 17 fs resolution over a 1 ns\nrange and then focused at normal incidence to a spot\napproximately 800 μm in diameter on the disk surface.\nThe probe beam is polarized and then brought to a 400\nμm focal spot, centered on the pump beam with a power\nlevel of about 1/20th of the pump. Because the probe\nis only half the diameter of the pump it must be noted\nthat there will be a temperature distribution across the\n\nEXPERIMENTAL RESULTS\n\nFor characterization of the sample the quasi-static hysteresis loop was measured. Of particular importance is\nthe coercivity, which on this timescale is ∼ 0.85T, and\nthe saturation magnetization Ms , which is equal to 0.35\n×106 A/m. The coercivity of course is already greater\nthan the field applied during our pulsed field experiment.\nHowever, it is important to note that the dynamic coercivity on the timescale of the pulsed laser experiment is\neven larger. The intrinsic coercivity (H0 ) and the thermal stability factor (KV /kB T ) were measured by making\na series of time dependent coercivity measurements and\nfitting to Sharrock's law13 . The intrinsic coercivity is related to the anisotropy field and is expected to give a\nreasonable estimate of the coercivity at the nanosecond\ntimescale. The value of H0 was found to be 1.4T; a factor of almost 3 greater than the maximum field available\nfrom the electromagnet. Separate measurements determined the anisotropy K to be 4 × 106 J/m3 , from which\na grain size of 10nm was estimated.\nFig. 2 shows a set of time-resolved measurements on\nthe sample. Fig. 2 (a) shows the reflectivity data, Fig. 2\n(b) shows the dynamic magnetic response for zero applied field and Fig. 2 (c) shows the response in the presence of a reversing field of 0.52 T. The laser pulse energy\nis varied up to 1.14 μJ per pulse (which corresponds to\na fluence of approximately 0.23 mJ/cm2 ). This value\nis the largest than can safely be applied to this sample\nas energy fluences above about 0.5 mJ/cm2 damage the\nsample. The sample reflectivity data shown in Fig. 2\n(a) is a probe of the electron/lattice temperature in the\nsystem. It indicates that the same temperature profile\n\n\fa)\n\n0\n-0.2\n-0.4\n-0.6\n-0.8\n-1\n0.2\n0\n-0.2\n-0.4\n-0.6\n-0.8\n-1\n\nb)\n\nc)\n\n1\n\napplied field. Recalling that the dynamic coercivity estimated from magnetic measurements is around 1.46T,\nthis demonstrates a significant heat-assistance during the\nsub-nanosecond reversal process.\nWe now consider in detail the processes involved in\nthe magnetization dynamics, which involves three characteristic timescales as illustrated in Fig. 2. The initial phase involves a rapid demagnetization of the samB = 0.00T\nple lagging the change in reflectivity by only 50 fs. The\ndemagnetization takes about 500 fs, independent of the\napplied field. This is consistent with the normal expectation of a rapid demagnetization as previously demonstrated experimentally1,2,4 and theoretically5,14 . The\nsample then appears to partially recover its magnetization in the original direction, on a timescale independent of the applied field. It is interesting to note that\nthe rate of recovery from the demagnetization peak is\nrelated to the amount of demagnetization achieved - a\npattern consistent with the calculations of Kazantseva et\nal.5 . Throughout the whole process the only apparent\nfield dependence occurs in the longer time-scale dynam100\n1000 ics (20ps-1ns). Over this timescale, for the higher laser\npowers, a gradual reversal of the magnetization is seen.\n1.14μJ\n0.70μJ\n0.42μJ\n0.23μJ\n\nB = −0.52T\n\n10\nt[ps]\n\nFIG. 2: Series of measurements in an applied reversing field\nof 0.52T for different laser pulse energies. a) shows the reflectivity data, b) the mz component of magnetization, and c)\nshows the response in the presence of a reversing field\n\n0.52T\n0.28T\n0T\n-0.28T\n-0.52T\n\n0\nmz\n\nmz\n\n1\n0.8\n0.6\n0.4\n0.2\n0\n\nmz\n\nreflectivity\n\n3\n\n-0.5\nis generated each time and that the temperature scales\nlinearly with pulse energy. The reflectivity measurement\nhas three distinct features. Within the first 5 ps is a large\npeak having a width of 350 fs, which corresponds to the\nlarge rise in electron temperature caused by the arrival\nof the 150 fs laser pulse. The electron system then establishes thermal equilibrium with the lattice which creates\nthe second, rather broader, peak 20 ps later. In reality\nthe peak temperature the lattice reaches is much lower\nthan that for the electrons; however, it seems that in\nthis sample the change in reflectivity is more sensitive to\nthe lattice temperature than the electron temperature.\nThe waves seen superimposed onto the lattice temperature peak during the 3-35 ps time frame are probably\nstress pulses launched into the film by the laser heating\nof the surface, which reflect off the interface with the\nglass substrate. The time between peaks is 12 ps, which,\ngiven the film and interlayer thickness of 25 nm, suggests\na propagation speed of 4,100 m/s; consistent with the\nspeed of sound in a typical metal. The sample appears\nto cool rather slowly as the lattice temperature has only\nfallen to half its peak value after 1 ns. This reflects the\nfact that in this film there is no heat sink to absorb the\nheat. Fig. 2 (b) and (c) show the magnetization dynamics in applied fields of 0 and -0.52 T respectively. Fig. 2\n(c) clearly demonstrates heat assisted reversal due to the\npulse. For pulse energies above ∼ 0.5μJ the sample is\nseen to cool with the magnetization aligning along the\n\n-1\n1\n\n10\n\n100\n\n1000\n\nt[ps]\nFIG. 3: Series of measurements of the temporal variation of\nmz in various applied reversing fields for a constant laser pulse\nenergy.\n\nA similar systematic trend is also exhibited by the temporal variation of mz at constant laser power in various\napplied fields, as shown in Fig. 3. The initial disappearance and recovery of the magnetization is similar for all\napplied fields, but with increasing positive field the longterm trend is clearly toward positive magnetization.\nThe form of the dynamics, involving a trend against\nthe field direction followed by a slow reversal into the\nfield direction is apparently somewhat counter-intuitive.\nHowever, the form of the magnetization evolution can\nbe explained by consideration of the different timescales\nassociated with processes at the atomic and macrospin\nlength scales. Within each grain or 'macrospin' the disappearance and recovery of the magnetization will be\ngoverned by the longitudinal relaxation time, which is\ntemperature dependent but typically of a sub-picosecond\ntimescale, which is consistent with the experimental data\nof Fig. 2 (b) and (c). However, after this process the system remains at an elevated temperature for around 1ns,\n\n\f4\nso there is a possibility of thermally activated magnetization reversal. This will have a characteristic timescale determined by the macrospin energy barrier, which is lowered by the reduction of the anisotropy constant at elevated temperature, but typically has values much greater\nthan 1ps. On this basis we would expect to see a fast reduction and recovery of the magnetization due to atomic\nprocesses on the picosecond timescale with a slower relaxation into the field direction due to thermally activated\nreversal of the macrospins. In order to test this hypothesis in relation to the experimental results we have developed a computational model of the laser heating process\nbased on the LLB equation which has been shown12 to\ngive a good description of magnetization processes over\nboth characteristic timescales.\nIV.\n\nDYNAMIC MODEL OF LASER HEATING\nPROCESS\n\nWe have developed a computational model of laserinduced magnetization dynamics of a thin film with\nperpendicular anisotropy. Consistent with experiments\nwe assume a granular microstructure for the film. For\nsimplicity we assume, in these initial calculations, a\nmono-disperse grain size and anisotropy. Inter-granular\nmagneto-static interactions are included, but the grains\nare taken as exchange decoupled. As mentioned previously the Landau-Lifschitz Gilbert (LLG) equation cannot be used for models of laser heating since it does not\nallow longitudinal fluctuations of the magnetization8,9 .\nIn the following, we use the LLB equation10 for the thermodynamic simulation of the laser-induced magnetization switching. As described in detail in Ref.12,15 , the\nLLB equation has been shown by comparison with atomistic calculations to give a remarkably good description\nof the physics of ultra-fast high temperature dynamics.\nThe LLB equation can be written as\n\u0011\nγ̃α|| \u0010\ni\ni\nm\n*\n(H\n+\nζ\n)\nmi\ni\neff\n||\nm2i\n\u0002\n\u0001\u0003\u0003\nγ̃α⊥ \u0002\n− 2 mi × mi × Hieff + ζ i⊥\n.\n(1)\nmi\n\nṁi = −γ̃[mi × Hieff ] +\n\nNote, that besides the usual precession and relaxation\nterms in the LLG equation (see Ref.17 for more details),\nthe LLB equation contains an additional term which controls the longitudinal relaxation. Here, mi is a spin polarization which is not assumed to be of constant length\nand even its equilibrium value me (T ) is temperature dependent. αk and α⊥ are dimensionless longitudinal and\ntransverse damping parameters.\nThe LLB equation is valid for finite temperatures and\neven above Tc though the damping parameters and effective fields are different below and above Tc . For T ≤ Tc\nthe damping parameters are\nαk = λ\n\n2T\n3Tc\n\nα⊥ = λ(1 −\n\nT\n)\n3Tc\n\n(2)\n\nand for T ≥ Tc the damping parameters are equal,\nα⊥ = αk =\n\n2λT\n.\n3Tc\n\n(3)\n\nIn these equations λ is a microscopic parameter which\ncharacterizes the coupling of the individual, atomistic\nspins with the heat bath.\nThermal fluctuations18 are included as an additional\nnoise term ζ il (t) with l =⊥, k, hζ il (t)i = 0 and\nhζli,ν (0)ζlj,η (t)i =\n\n2kB T\nδνη δij δ(t),\nγ̃αl Ms0 ∆3\n\n(4)\n\nwhere i, j denotes lattice sites and ν, η the Cartesian components. Here, ∆3 is the volume of the grains and Ms0 is\nthe value of the spontaneous magnetization at zero temperature.\nδf\n, with f the\nThe effective fields are Hieff = − M10 δm\ni\ns\nfree energy density. The total local field is given by10\nHieff = H+HiA +Hidipol+\n\n\n\n\n1\n\u00102χ̃k\n\nm2i\nm2e \u0011 mi\n3Tc m2i\n5(T −Tc ) mi\n\n\u0010\n1−\n\n − 1 1+\nχ̃k\n\n\u0011\n\nT ≤ Tc\nT ≥ Tc\n(5)\n\nwith the anisotropy field\nHiA\n\nmix ex + miy ey\n=−\nχ̃⊥\n\n\u0001\n\n(6)\n\nwhich makes the z axis the easy axis of the model, and\nthe dipolar field\nHidipol =\n\nMs0 ∆3 μ0 X 3(mi *eij )(eij *mj )−mi *mj\n3\nrij\n4π\ni<j\n\n(7)\n\nNote, that the susceptibilities χ̃l are defined by χ̃l =\n∂ml /∂Hl . At lower temperatures the perpendicular susceptibility χ̃⊥ is related to the anisotropy K via χ̃⊥ =\nMs0 m2e /(2K).10 . One problem for the application of the\nLLB equation is that one has to know the functions for\nthe spontaneous equilibrium magnetization me (T ), the\nperpendicular (χ̃⊥ (T )) and parallel (χ̃k (T )) susceptibilities. Here, we use the functions for FePt gained from a\nLangevin dynamics simulation of an atomistic spin model\nas described in15 . In the following, we assume that these\nfunctions reflect the correct temperature behavior. We\nnormalize the perpendicular susceptibility such that its\nvalue at 300K is consistent with experimentally determined values for CoPt (K = 3.94 * 105 J/m3 ) determined\nby the rotation method16 . The input functions are shown\nin Fig. 4.\nThe LLB equation is solved numerically by using\nLangevin dynamics simulations as described in17 . For\nour simulations we chose a disc of 32 × 32 × 1 cells, with\na grain size ∆ of 10nm.\n\n.\n\n\f5\n\nχ̃⊥\nχ̃k\nme\n\n0.2\n\nT[K]\n\nme\n\nχ̃[1/T]\n\n460\n440\n420\n400\n380\n360\n340\n320\n300\n\n0.8\n\n0.4\n\n0.4\n\n0\n\n0\n0\n\n150\n\n300\n\n450\n\n600 Tc 750\n\n900\n\nTe\nTl\nmagnetization\nreflectivity\n\n0\n\nT [K]\n\n2\n\n4\n\n6\n\n8\n\n10\n\nt[ps]\n\nCOMPARISON BETWEEN MULTI-MACRO\nSPIN MODEL AND EXPERIMENT\n\nIn order to make a comparison with the experimental\ndata it is necessary to have an approximation to the temporal variation of the temperature pulse caused by the\nheating. Because of the complex behavior of the reflectivity as discussed by Djordjevic et al.19 it is not feasible\nto use this property to determine the temperature profile\nin this work. Instead we make the simplifying assumption that, at low laser powers, the magnetization closely\nfollows the electron temperature during the heating and\ninitial recovery phase; an assumption essentially borne\nout by calculations in Ref.5 using an atomistic model,\nwhere fast demagnetization and recovery were found for\nlow peak electron temperatures. Following Ref.5 , we assume that the photon energy is transfered to electrons\nand that the magnetization is directly coupled to the electron temperature Te within a two-temperature model20 ,\nexpressed as the following coupled differential equations\nfor the electron and phonon temperatures, Te , Tl respectively:\ndTe\n= −Gel (Te − Tl ) + P (t)\ndt\ndTl\n= Gel (Te − Tl ),\nCl\ndt\n\nCe\n\nT [K]\n\nV.\n\nFIG. 5: Graph showing the electron temperature (Te ) and the\nlattice temperature (Tl ) simulated by the two-temperature\nmodel. Scaled reflectivity and magnetization data are also\nincluded for comparison.\n\n1240K\n\n1200\n1000\n800\n600\n400\n1\n\n0.52T\n0.28T\n0.00T\n-0.28T\n-0.52T\n\n0.5\nmz\n\nFIG. 4: Spontaneous equilibrium magnetization and parallel\nand transverse susceptibility vs. temperature.\n\n0\n\n-0.5\n1\n\n10\n\n100\n\n1000\n\nt[ps]\nFIG. 6: Calculated time dependence of the z-component\nof the magnetization for different applied magnetic fields.\nKV\n= 76 with K = 3.2 * 105 J/m3 and V = (10 nm)3 at\nkB T\nroom temperature. (Tep = 1240K, λ = 0.1)\n\n(8)\n\nwhere Ce , Cl are electron and lattice specific heat constant, Gel is a coupling constant and P (t) is the laser fluence. Eqs. 8 can easily be solved numerically to generate\nthe time variation of Te , Tl . We determine the parameters of the two-temperature model by fitting to the form\nof the initial magnetization decay and recovery, assuming\na Gaussian laser profile.\nFig. 5 shows a comparison of the two-temperature\nmodel with the data from the reflectivity and low laser\npower magnetization measurements in order to estimate\nphysically reasonable parameters for the model. The\ntime-scale of the peak in electron temperature Te matches\nthe demagnetization peak in the magnetization data and\nthe initial peak in the reflectivity data. The lattice tem-\n\nperature Tl reaches its peak value on the same time-scale\nas the second rise in the reflectivity data. For use in the\ncomputational model an interpolation function was fitted\nto the Te predicted above. Different laser fluences were\nsimulated by scaling the results to the peak electron temperature (Tep ), which becomes a main parameter in the\ncomparison with experiment.\nWe first describe calculations with the assumption of a\nspatially uniform temperature profile. The model parameters used correspond to a material with a Tc of 660K,\nMs = 1.75 ×105 A/m, an out-of-plane anisotropy K =\n3.2 ×105 J/m3 and a damping constant λ of 0.1. The material is broken up into 32 × 32 cells of size 10 nm which\nare exchange decoupled in order to model the granular\nstructure of a recording medium. The intention is to\n\n\f6\n\n1\n\n1170K\n1240K\n\nmz\n\n0.5\n0\n\n-0.5\n1\n\n10\n\n100\n\n1000\n\nt[ps]\nFIG. 7: Calculated time dependence of the z-component\nof the magnetization for two different peak temperatures.\nKV\n= 76 with K = 3.2 * 105 J/m3 and V = (10 nm)3 at\nkB T\nroom temperature. (λ = 0.1,Bz = −0.52T)\n\n1\n\n0.05\n0.01\n0.20\n\nmz\n\n0.5\n0\n\n-0.5\n1\n\n10\n\n100\n\n1000\n\nt[ps]\nFIG. 8: Calculated time dependence of the z-component of\nthe magnetization for different values of λ. kKV\n= 76 with K\nBT\n= 3.2 * 105 J/m3 and V = (10 nm)3 at room temperature (Tep\n= 1240 K, Bz = −0.52T)\n\noutline the effects of the major parameters in the model,\nnamely the applied field, peak electron temperature and\nthe coupling parameter. Fig. 6 shows the temporal response of the magnetization to a laser pulse giving rise to\na peak electron temperature of 1240K assuming a coupling parameter of λ = 0.1. It can be seen that the\nsimulation gives a reasonable qualitative description of\nthe time evolution of the magnetization following a laser\npulse. Specifically we note the initial fast demagnetization and recovery. In the case of a positive field the\nmagnetization recovers to the equilibrium value in the\npositive sense. In a reversing field the initial recovery is\nfollowed by a slow reversal of the magnetization toward\nthe field direction which, in the model, can be unambiguously attributed to thermally activated transitions\nover the particle energy barriers, supporting the earlier\ninterpretation of the experimental data.\nFig. 7 explores the effect of increasing the peak electron temperature. As might be expected, the effect of\nthis parameter is to lead to a more complete demagnetization during the laser pulse. After the high temperature\npulse the system remains demagnetized due to the high\ntemperature remaining after the pulse.\nFinally, we consider the effect of the coupling parame-\n\nter λ. Calculations for 3 different values of λ are shown\nin Fig. 8. Here, it can be seen that the effect of increasing λ is to achieve a more rapid demagnetization.\nThis is consistent with previous calculations5 , where the\neffect is interpreted in terms of the more efficient transfer of energy into the spin system at large λ leading to\na more complete demagnetization for a given laser pulse\nwidth. Clearly the increased demagnetization caused by\nthe stronger coupling to the conduction electron system\nresults in an increased heat assistance of the magnetization reversal.\nIn addition to the material parameters, the peak electron temperature and the coupling constant are seen to\nbe important in the heat assisted reversal process. Although the model reproduces the essential physics of the\nreversal process, particularly the different behavior on\nthe timescales of longitudinal relaxation (fast demagnetization) and transverse relaxation (super-paramagnetic\nfluctuations) qualitative agreement only is obtained with\nexperimental data. Specifically, the value of KV /kB T =\n76 (at room temperature) used in the simulations is\nrather small in comparison with the experimentally determined values. In order to obtain closed agreement\nwith experiment it is necessary to include an important\nexperimental factor; specifically the fact that the probe\npulse area is comparable to that of the pump. This introduces a significant temperature gradient within the\nprobe area, which must be taken into account in the calculations.\nHere, we model this effect using a Gaussian temperature profile for the laser spot. The diameter of the spot\nused in the model calculations is much smaller than in\nthe experiments (800μm). This would be an unrealistic approximation if the magnetization reversal involved\ndomain wall processes; however, since the grains are essentially decoupled in the experimental films this simplified model is able to gives some insight into the effects of the temperature profile. Since both pump and\nprobe beams have a Gaussian temperature variation, we\ntake the temperature variation to be of the form T (r) ∝\n2\nexp(−r2 /rpump\n), with rpump the radius of the pump\nbeam. The MOKE signal is assumed to be proportional\nto the product of the magnetization with a sensitivity\nfunction. The sensitivity function is proportional to the\narea of material generating the MOKE signal at a particular radius and the light intensity at that radius, which\n2\nhas a Gaussian weighting, i.e. ∝ mz r exp(−r2 /rprobe\n)dr,\nwith rprobe the radius of the probe. A numerical integration over the probe area was carried out to determine the\ncalculated MOKE signal from the film.\nThe introduction of a temperature profile results in a\nqualitative agreement with experiment using parameters\nclose to the measured values. Fig. 9 shows calculations\nof the time dependence of the magnetization following a\nlaser pulse with a peak temperature of 1480K for different values of the applied magnetic field. The parameters\nused were Ms0 = 0.4 × 106 A/m, giving a room temperature value close to the measured (VSM) values of\n\n\f7\n\n1\n\n0.52T\n0.28T\n0.00T\n-0.28T\n-0.52T\n\n0\n\n0.8\n\n-0.5\n1\n\n10\n\n100\n\na)\n\n0.6\n0.4\n0.2\nmz\n\nmz\n\n0.5\n\n0\n-0.2\n\n1000\n\n-0.4\n\nt[ps]\n\n-0.6\n-0.8\n\nFIG. 9: z-component vs. time for different applied magnetic\nfields Bz . kKV\n= 95 with K = 3.94 * 105 J/m3 and V = (10\nBT\n3\nnm) at room temperature (Tep = 1480K, λ = 0.1)\n\n0.8\n\nm\n\n0.6\n0.4\n0.2\n0\n0.3\n\n3\n8\n10\n30\n100\n300\n\nc)\n0.2\nmi\n\n0.32×106 A/m. The anisotropy constant K 0 at zero temperature was taken as 3.94×105J/m3 , which gives a value\nof KV /kB T = 95 at room temperature, in good agreement with the experimentally determined value of 96. It\nis interesting to note that if a larger value of Ms0 is used\nthen system appears to lock into a domain-state during\nreversal, which suggests that even at elevated temperatures the inter-granular magneto-static interactions can\nplay an important role. The exchange coupling can be\nadded, but values as big as 10% do not change the results\nsignificantly. As noted by Kazantseva et al.5 , changes in\nthe value of the damping constant affect the amount of\nenergy the magnetic system absorbs from the initial heat\npulse and so how much of a demagnetization is achieved\nfor a given peak electron temperature. In addition there\nis a slight broadening in the demagnetization peak.\nFig. 10 shows a more detailed analysis of the LLB simulations, indicating that the magnetization dynamics are\nan ultra-fast demagnetization and recovery caused by the\nelectron temperature peak, after which the elevated temperature of the lattice causes a gradual switching of the\nindividual grains of material. Fig. 10 shows the temporal\nevolution of the radial magnetization defined such that\nmα (r)dr is the spatially averaged magnetization over the\nannulus r → r + dr; here α is the z-component of the\nmagnetization mz (Fig. 10(a)), the total magnetization\n(Fig. 10(b)), and the in-plane magnetization, defined as\nthe spatial average of (m2x + m2y )1/2 (Fig. 10(c)).\nWe consider the behavior of two distinct regions; the\ncentral region for radius < 7 cell radii, where the temperature exceeds Tc during the pulse leading to complete demagnetization, and the outer region which doesn't exceed\nTc . The variation of the total magnetization (Fig. 10(b))\nis consistent with previous calculations5 . Specifically, the\nrate of recovery of the magnetization depends upon the\nmagnetic state. Within the central region the material is\ncompletely disordered and the recovery of the magnetization is relatively slow due to the need for the magnetization to recover from highly disordered states. In the\nouter region the magnetization retains some memory of\nthe initial state, which results in a rapid recovery5.\n\nb)\n\nps\nps\nps\nps\nps\nps\n\n0.1\n\n0\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\nr[cell]\n\nFIG. 10: Radial magnetization in a 0.52T field as a function\nof time after the laser pulse. (a) shows the perpendicular\ncomponent mz , (b) the magnitude m, and (c) the magnitude\nof the in-plane component mi\n\nOf most importance in terms of heat assisted reversal\nis the behavior of the central region. Heat assistance of\nthe reversal is demonstrated clearly in Fig. 10(a), which\nshows reversal of the central (heated) region while the\nmagnetization in the outer region is not switched. The\nnature of the reversal in the central region is further investigated using the radially resolved in-plane component\nof the magnetization, which is shown in Fig. 10(c). It is\ninteresting to note that a large in-plane component develops on the timescale of 10 → 30 ps. This results from the\nrelatively random recovery of the direction of the magnetization after cooling though Tc . This contributes to\nthe magnetization reversal in two ways. Firstly, some\nof the grains take on a negative sense of the magnetization on recovery. Others will recover in a positive sense\nbut at an angle greater than the energy maximum as\nthe anisotropy increases; these grains are most likely to\nswitch into the negative direction as the temperature decreases. At longer timescale, and consequently lower tem-\n\n\f8\nperatures, the in-plane component reduces as the magnetization of each grain begins to lie preferentially along the\neasy anisotropy axis. However, the in-plane component\ndoes not completely disappear, probably reflecting the\nBoltzmann distribution of the magnetization direction\nwithin each grain. In addition to these mechanisms it\nis also likely that there will be thermally activated reversal over the energy barriers at the elevated temperatures.\nAlong with the increase in spontaneous magnetization as\nthe film cools this would contribute to the gradual increase in mz over timescales of 1 ns.\nVI.\n\nCONCLUSIONS\n\nWe have presented laser pump-probe measurements\nwhich show a clear heat assistance from the laser pulse for\nswitching the magnetization state. This is demonstrated\nby the ability to switch in an externally applied field with\na magnitude lower than the intrinsic coercivity. The experiments show a rapid demagnetization and recovery followed by a slow evolution of the magnetization into the\nfield direction. This is consistent with the existence of\ntwo characteristic relaxation times; the longitudinal and\ntransverse relaxation times. The former is atomic-scale\nprocesses and is typically of the sub-picosecond order,\nwhereas the transverse relaxation time reflects transitions\nover the energy barrier and can be orders of magnitude\nlonger. In order to investigate the reversal mechanism we\nhave developed a micromagnetic model based on the LLB\nequation which naturally includes both timescales. The\n\n∗\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n7\n8\n\n9\n\n10\n11\n\n12\n\nElectronic address: jw50@york.ac.uk\nE. Beaurepaire, J.-C. Merle, A. Daunois, and J. Y. Bigot,\nPhys. Rev. Lett. 76, 4250 (1996).\nJ. Hohlfeld, T. Gerrits, M. Bilderbeek, T. Rasing, H.\nAwano, and N. Ohta, Phys. Rev. B 65, 012413 (2001).\nA. V. Kimel, A. Kirilyuk, A. Tsvetkov, R. V. Pisarev, and\nT. Rasing, Nature 429, 850 (2004).\nA. V. Kimel, A. Kirilyuk, P. A. Usachev, R. V. Pisarev,\nA. M. Balbashov, and T. Rasing, Nature 435, 655 (2005).\nN. Kazantseva, U. Nowak, R. W. Chantrell, J. Hohlfeld,\nand A. Rebei, Europhys. Lett. 81, 27004 (2008).\nD Weller and A Moser, IEEE Trans. Mag., 35, 4423 (1994)\nR.E Rottmayer et.al., IEEE Trans. Mag., 42, 2417 (2006)\nG. Grinstein and R. H. Koch, Phys. Rev. Lett. 90, 207201\n(2003).\nV.V. Dobrovitski, M. I. Katsnelson and B. N. Harmon,\nPhys. Rev.Lett. 90, 067201 (2003).\nD. A. Garanin, Phys. Rev. B 55, 3050 (1997).\nO. Chubykalo-Fesenko, U. Nowak, R. W. Chantrell, and\nD. Garanin, Phys. Rev. B 74, 094436 (2006).\nU.\nAtxitia, O.\nChubykalo-Fesenko, N.\nKazantseva, D. Hinzke, U. Nowak, and R. W. Chantrell,\nAppl. Phys. Lett. 91, 232507 (2007).\n\nLLB model calculations are in good quantitative agreement with the experimental data, as long as the the temperature gradient across the probe pulse is included. It\nappears that on the short time-scale (2 ps) there is a rapid\ndemagnetization of mz due to an associated loss of Ms\nvia the longitudinal relaxation. There is a partial recovery of mz in the original direction as Ms starts to recover.\nHowever, the switching is assisted by the recovery of the\nmagnetization of individual grains in random directions\nas the system cools through Tc . On the longer time-scale\nthe reversal of mz in the applied field may also be assisted\nby thermally activated switching caused by the elevated\nlattice temperature. The elevated temperature has the\neffect of lowering the anisotropy energy barriers (due to\nthe reduced values of the Magnetocrystalline anisotropy\nenergy) and also provides the thermal energy to induce\nthe transitions. The complex behaviour requires a model\nincluding both the longitudinal and transverse relaxation\ntimes, which is included here using the LLB equation.\nOur LLB based calculations encapsulate the physics of\nthe heat-assisted reversal process and suggest the LLB\nequation as a physically realistic model for Heat Assisted\nMagnetic Recording.\nVII.\n\nACKNOWLEDGMENTS\n\nThe authors would like to acknowledge the CLF (Central Laser Facility) who loaned the laser system used in\nthe project and Dr. S. Lepadatu for his assistance in\ndeveloping the experiment.\n\n13\n14\n\n15\n\n16\n\n17\n\n18\n\n19\n\n20\n\nM. P. Sharrock, J. Appl. Phys. 76, 6413 (1994)\nB. Koopmans, H. H. J. E. Kicken, M. van Kampen, and\nW. J. M. de Jonge, J. Magn. Magn. Mat. 286, 271 (2005).\nN. Kazantseva, D. Hinzke, U. Nowak, R. W. Chantrell,\nU. Atxitia, and O. Chubykalo-Fesenko, Phys. Rev. B 77,\n184428 (2008).\nV.W. Guo, Bin Lu, X.W Wu, G Ju, B Valcu and D Weller,\nJ Appl. Phys., 99, 08E918 (2006)\nU. Nowak, in Handbook of Magnetism and Advanced Magnetic Materials, Vol. 2, Micromagnetism, edited by H.\nKronmüller and S. Parkin (John Wiley & Sons Ltd., Chichester, 2007).\nD. A. Garanin and O. Chubykalo-Fesenko, Phys. Rev. B\n70, 212409 (2004).\nM. Djordjevic, M. Lüttich, P. Moschkau, P. Guderian, T.\nKampfrath, R. G. Ulbrich, M. Mnzenberg, W. Felsch, J.\nS. Moodera, Phys. Stat. Sol. (c) 3, 1347 1358 (2006)\nG. Zhang, W. Hübner, E. Beaurepaire, and J.-Y. Bigot, in\nSpin Dynamics in Confined Magnetic Structures I, edited\nby B. Hillebrands and K. Ounadjela (Springer-Verlag,\nBerlin Heidelberg New York, 2002), p. 245.\n\n\f"}