{"id": "http://arxiv.org/abs/1011.2016v2", "guidislink": true, "updated": "2011-06-15T02:40:32Z", "updated_parsed": [2011, 6, 15, 2, 40, 32, 2, 166, 0], "published": "2010-11-09T09:50:38Z", "published_parsed": [2010, 11, 9, 9, 50, 38, 1, 313, 0], "title": "Strain-mediated magnetoelectric coupling in\n  magnetostrictive/piezoelectric heterostructures and resulting high frequency\n  effects", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1011.6219%2C1011.3896%2C1011.1056%2C1011.6274%2C1011.4365%2C1011.5850%2C1011.4953%2C1011.0502%2C1011.0100%2C1011.2737%2C1011.3455%2C1011.6317%2C1011.2016%2C1011.5132%2C1011.3064%2C1011.2377%2C1011.4712%2C1011.0467%2C1011.2383%2C1011.2092%2C1011.3780%2C1011.0796%2C1011.1590%2C1011.2104%2C1011.4297%2C1011.5065%2C1011.3041%2C1011.3149%2C1011.3394%2C1011.5278%2C1011.5346%2C1011.4519%2C1011.4967%2C1011.1594%2C1011.0497%2C1011.2428%2C1011.3497%2C1011.4567%2C1011.3432%2C1011.1071%2C1011.1712%2C1011.5584%2C1011.3901%2C1011.5027%2C1011.3357%2C1011.4509%2C1011.3648%2C1011.3554%2C1011.0179%2C1011.0561%2C1011.0503%2C1011.6415%2C1011.1333%2C1011.2569%2C1011.4582%2C1011.0374%2C1011.4238%2C1011.3083%2C1011.2116%2C1011.1652%2C1011.5866%2C1011.0377%2C1011.0765%2C1011.1979%2C1011.2402%2C1011.1750%2C1011.2265%2C1011.3284%2C1011.3684%2C1011.2699%2C1011.5121%2C1011.4549%2C1011.0258%2C1011.3627%2C1011.6266%2C1011.5314%2C1011.1513%2C1011.6617%2C1011.4915%2C1011.6382%2C1011.0289%2C1011.3686%2C1011.2083%2C1011.2122%2C1011.4388%2C1011.0301%2C1011.5206%2C1011.1060%2C1011.5211%2C1011.5640%2C1011.1138%2C1011.4939%2C1011.5537%2C1011.2725%2C1011.4450%2C1011.6631%2C1011.3202%2C1011.5100%2C1011.6448%2C1011.4038%2C1011.4429&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Strain-mediated magnetoelectric coupling in\n  magnetostrictive/piezoelectric heterostructures and resulting high frequency\n  effects"}, "summary": "Magnetoelectric coupling terms are derived in piezoelectric/magnetostrictive\n(multiferroic) thin film heterostructures using Landau-Ginzburg free energy\nexpansions in terms of strain and by considering strain boundary conditions\nbetween the two materials. Then, a general effective medium method for solving\nfor the complete electromagnetic susceptibility tensor of such heterostructures\nis used to calculate the ferromagnetic resonance frequency in a\nBaTiO$_3$/NiFe$_2$O$_4$ superlattice. This method differs from existing methods\nfor treating magnetoelectric heterostructures since the magnetic and electric\ndipolar fields are not assumed constant but vary from one film to another. The\nferromagnetic resonance frequency shift is calculated as a function of applied\nelectric field and is compared to some experimental results.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1011.6219%2C1011.3896%2C1011.1056%2C1011.6274%2C1011.4365%2C1011.5850%2C1011.4953%2C1011.0502%2C1011.0100%2C1011.2737%2C1011.3455%2C1011.6317%2C1011.2016%2C1011.5132%2C1011.3064%2C1011.2377%2C1011.4712%2C1011.0467%2C1011.2383%2C1011.2092%2C1011.3780%2C1011.0796%2C1011.1590%2C1011.2104%2C1011.4297%2C1011.5065%2C1011.3041%2C1011.3149%2C1011.3394%2C1011.5278%2C1011.5346%2C1011.4519%2C1011.4967%2C1011.1594%2C1011.0497%2C1011.2428%2C1011.3497%2C1011.4567%2C1011.3432%2C1011.1071%2C1011.1712%2C1011.5584%2C1011.3901%2C1011.5027%2C1011.3357%2C1011.4509%2C1011.3648%2C1011.3554%2C1011.0179%2C1011.0561%2C1011.0503%2C1011.6415%2C1011.1333%2C1011.2569%2C1011.4582%2C1011.0374%2C1011.4238%2C1011.3083%2C1011.2116%2C1011.1652%2C1011.5866%2C1011.0377%2C1011.0765%2C1011.1979%2C1011.2402%2C1011.1750%2C1011.2265%2C1011.3284%2C1011.3684%2C1011.2699%2C1011.5121%2C1011.4549%2C1011.0258%2C1011.3627%2C1011.6266%2C1011.5314%2C1011.1513%2C1011.6617%2C1011.4915%2C1011.6382%2C1011.0289%2C1011.3686%2C1011.2083%2C1011.2122%2C1011.4388%2C1011.0301%2C1011.5206%2C1011.1060%2C1011.5211%2C1011.5640%2C1011.1138%2C1011.4939%2C1011.5537%2C1011.2725%2C1011.4450%2C1011.6631%2C1011.3202%2C1011.5100%2C1011.6448%2C1011.4038%2C1011.4429&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Magnetoelectric coupling terms are derived in piezoelectric/magnetostrictive\n(multiferroic) thin film heterostructures using Landau-Ginzburg free energy\nexpansions in terms of strain and by considering strain boundary conditions\nbetween the two materials. Then, a general effective medium method for solving\nfor the complete electromagnetic susceptibility tensor of such heterostructures\nis used to calculate the ferromagnetic resonance frequency in a\nBaTiO$_3$/NiFe$_2$O$_4$ superlattice. This method differs from existing methods\nfor treating magnetoelectric heterostructures since the magnetic and electric\ndipolar fields are not assumed constant but vary from one film to another. The\nferromagnetic resonance frequency shift is calculated as a function of applied\nelectric field and is compared to some experimental results."}, "authors": ["K. L. Livesey"], "author_detail": {"name": "K. L. Livesey"}, "author": "K. L. Livesey", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.83.224420", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1011.2016v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1011.2016v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 figures", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1011.2016v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1011.2016v2", "journal_reference": "Phys. Rev. B v.83, p.224420 (2011)", "doi": "10.1103/PhysRevB.83.224420", "fulltext": "Strain-mediated magnetoelectric coupling in\nmagnetostrictive/piezoelectric heterostructures and resulting\n\narXiv:1011.2016v2 [cond-mat.mtrl-sci] 15 Jun 2011\n\nhigh frequency effects\nK. L. Livesey∗\nSchool of Physics M013, University of Western Australia,\n35 Stirling Hwy, Crawley WA 6009, Australia\n(Dated: June 20, 2018)\n\nAbstract\nMagnetoelectric coupling terms are derived in piezoelectric/magnetostrictive (multiferroic) thin\nfilm heterostructures using Landau-Ginzburg free energy expansions in terms of three order parameters: strain, magnetization and electric polarization. Strain is eliminated using a particular\nset of interface boundary conditions. Then, a general effective medium method is used to calculate\nthe ferromagnetic resonance frequency in a BaTiO3 /NiFe2 O4 superlattice. This method differs\nfrom existing methods for treating magnetoelectric heterostructures since the magnetic and electric dipolar fields are not assumed constant but vary from one film to another. The ferromagnetic\nresonance frequency shift is calculated as a function of applied electric field and is compared to\nsome experimental results.\nPACS numbers: 75.85.+t,77.55.Nv,76.50.+g,77.55.H-\n\n∗\n\nElectronic address: livesey@physics.uwa.edu.au; Current address: Commonwealth Scientific and Industrial\n\nResearch Organisation, Australian Resources Research Centre, 26 Dick Perry Ave, Kensington WA 6151,\nAustralia\n\n1\n\n\fI.\n\nINTRODUCTION\n\nToday there is much interest in magnetoelectric heterostructures due to the possibility\nof creating multifunctional devices where magnetic properties can be controlled with an\nelectric field or vice-verse [1]. For example, an applied electric field has been shown to\nshift ferromagnetic resonance (FMR) frequencies [2]. This has potential application in fast\nmicrowave signal processing devices with lower energy consumption than current devices.\nThe most promising magnetoelectric heterostructures are those containing magnetostrictive\nand piezoelectric phases because an interface strain-mediated magnetoelectric (ME) coupling\ncan occur that is orders of magnitude bigger than in single-phase multiferroic materials (for\na review, see Ref. [1]).\nRecently we presented an effective medium method (EMM) for calculating susceptibilities\nand resonant frequencies in a heterostructure comprising alternating multiferroic (ferroelectric and antiferromagnet) and ferromagnetic thin films [3]. This EMM is based on previous\nwork on dielectric [4] and magnetic [5, 6] heterostructures respectively in the long wavelength electrostatic/magnetostatic limit. Only dipolar coupling was considered between the\nfilms. Since strain-mediated magnetoelectric coupling in heterostructures appears to be very\nimportant, in this paper we present a theory to calculate the strain-mediated coupling so\nthat the EMM can be applied and FMR frequency shifts can be predicted as a function of\napplied electric field.\nExisting methods to calculate the high frequency magnetic and magnetoelectric susceptibility of thin film magnetoelectric composites have focused on using a simplified EMM\nand solving magnetization equations of motion with a phenomenological magnetoelectric\ncoupling term [2]. The coupling term takes the form of an energy density\nEM E = Bikn Ei Mk Mn + bijkn Ei Ej Mk Mn ,\n\n(1)\n\nwhere E is the applied electric field that is assumed constant throughout the heterostructure\nand M is the magnetization in the magnetostrictive phase. The magnetoelectric coupling\nconstants Bikn and bijkn can be expressed as a combination of elastic, piezoelectric and\nmagnetostrictive constants of the individual phases and are derived by considering the strain\nboundary conditions at the interfaces and by considering the symmetries of the individual\nphases [7]. Bichurin et al. have also solved simultaneous magnetization and elastic equations\nof motion and found enhanced magnetoelectric effects near mechanical resonances [8].\n2\n\n\fOur EMM differs from that of Bichurin et al. in several ways. Firstly, both magnetization\nand dielectric equations of motion can be written and so the magnetic, magnetoelectric and\nelectric susceptibility may all be solved for, as shown in Ref. [3]. Secondly, our effective\nmedium method takes into account the interface boundary conditions for the dipolar magnetic and electric fields and these fields are not assumed constant through the heterostructure, as done in other works [2, 7, 9]. This means that demagnetizing and depolarizing\neffects are included in our method and different resonant frequencies will be calculated as\ncompared with simplified EMMs, as discussed in Ref. [3].\nInterface strain-mediated magnetoelectric terms like Eq. (1) can be added to the magnetic and dielectric energy densities of the heterostructure and dipolar boundary conditions\ntogether with equations of motion can be solved to find the susceptibility tensor. However,\nby writing the magnetoelectric energy in terms of electric field E rather than electric polarization P , electric fields can drive magnetization but magnetic fields cannot drive electric\npolarization. We therefore aim first in Section II to write a strain-mediated magnetoelectric\nenergy density in terms of M and P . Writing an energy density is not strictly valid since\nmagnetization and electric polarization are defined in different phases of the heterostructure.\nBut the EMM works by averaging the properties of the films so both the magnetization and\npolarization may be thought of as belonging to a single effective material, therefore this\nformalism does not present a problem.\nPreviously, studies have used one of two methods to derive magnetoelectric coupling in\nheterostructures. Either linear constituent equations are considered that relate strains to\nmagnetic and electric fields [7, 10, 11] or Landau free energy expansions are made in terms\nof magnetization, polarization and strain order parameters [12–14]. In Section II the latter\nmethod will be used to derive the magnetoelectric coupling. The full free energy expansions\nfor both films will be made, which leads to very complicated equations for the magnetoelectric\ncoupling once strain is eliminated from the equations. This is in contrast to previous works\nthat have considered the Landau expansion for only the piezoelectric film, with a misfit\nstrain that comes from the attached magnetostrictive film [12, 14], or that have considered\nthe expansion for only the magnetostrictive film, with a misfit strain from the piezoelectric\n[13]. The calculation in Section II therefore represents an extension of these works.\nIn Section III it is then shown how the derived strain-mediated magnetoelectric coupling\nalters the FMR frequency and also may dynamically couple magnetic and electric excita3\n\n\ftions. This is done by calculating just the zz-component of the high-frequency magnetic\nsusceptibility using the EMM presented in Ref. [3]. The FMR frequency shifts are compared\nto some existing experimental results.\nIt is hoped that the general methods presented in this work will enable experimentalist to\nestimate the resonant frequencies or the strain-mediated magnetoelectric coupling strength\nin piezoelectric/magnetostrictive heterostructures.\n\nII.\n\nSTRAIN-MEDIATED MAGNETOELECTRIC COUPLING FOR A CUBIC\n\nSYSTEM\n\nThe calculation for the magnetoelectric coupling in the piezoelectric/magnetostrictive\nheterostructure will proceed as follows. Landau-Ginzburg expansions for the free energy are\nwritten in terms of the order parameters: electric polarization Pi , magnetization Mi , and\n(p)\n\n(m)\n\nstrains in the respective phases, uij and uij\n\n(where i, j = x, y, z). Then strain boundary\n\nconditions are imposed between the phases, the free energy is minimized with respect to\nstrain, and finally an effective magnetoelectric coupling is derived for the heterostructure.\nNote that all the order parameters are considered constant within a phase. This is a good\napproximation for sufficiently thin films. So-called \"entire-cell\" effective medium methods\n[15, 16] are better adapted to treating thicker films where this assumption breaks down.\nBoth the magnetostrictive (denoted with a superscript m) and piezoelectric (p) free energies are written assuming that a cubic symmetry exists. While cubic symmetry often\nexists in the paramagnetic or paraelectric phases of these materials, usually the transition\nto magnetic/electric order is accompanied by a lowering of the crystal symmetry. Therefore,\nthis treatment may at first seem like a crude approximation below the Curie temperature.\nIn fact, this is not the case and the lowering of the crystal symmetry falls out naturally in\nthe subsequent calculation of the strains. For example, it can be shown that assuming the\nelectric polarization P is along the (111) direction in a bulk piezoelectric material, then the\nstrains minimizing the free energy correspond to an elongation of the cubic cell along (111),\nin other words, a rhombohedral distortion or a transformation to space group R3c. (See\nRef. [17] for a more detailed discussion.) The situation is more complex for thin films that\nare mechanically coupled to other materials; very different distortions may correspond to\nthe ground state as compared with bulk crystals (see, for example, Ref. [18]).\n4\n\n\fA.\n\nLandau free energy expansions\n\nWe start by quoting the parts of the free energy expansions for the magnetostrictive and\npiezoelectric phases that do not depend on strain. The magnetic part of the free energy\ndensity for the cubic magnetostrictive phase is given up to fourth order, for simplicity, by\n[19]:\nFFM (ai ) = K(a2x a2y + a2y a2z + a2z a2x ) − μ0 M0 H * a,\n\n(2)\n\nwhere K is the anisotropy constant, M0 is the saturation magnetization, H is the applied\nmagnetic field and a = M /M0 is the magnetization vector normalized to unity or the\nmagnetization direction cosines. The magnitude of the magnetization does not vary (at\nconstant temperature) and therefore terms such as a2i and a4i are ignored here. The exchange\nenergy is ignored as the magnetization is assumed to be all aligned within a film. Any\ndynamic motion (considered in Section III) involves the magnetization in the whole film\nmoving coherently.\nIn Eq. (2) the demagnetizing free energy is not included. For a thin film it is equal\nto 21 μ0 M02 a2z but for a heterostructure it is typically less than this value and takes a nonanalytic form [3]. Here it is noted that, for the material parameters used in Section II E, the\ndemagnetizing energy does not alter the equilibrium magnetization direction, as discussed\nlater. The effective medium method, that will be used in Section III to find the resonant\nfrequencies, calculates the dipolar energy in an implicit and elegant way, without recourse\nto a computationally intensive method such as a dipole sums method, and obtains very\naccurate results [16]. Therefore the demagnetizing effects will be considered properly in\nSection III.\nMost piezoelectric materials (for example, BaTiO3 , PZT and BiFeO3 ) undergo a firstorder phase transition and therefore the free energy must have terms at least up to sixth\norder in Pi . Also, the magnitude of the electric polarization can vary strongly as a function\nof applied field E. The electric part of the free energy density for the cubic piezoelectric\n\n5\n\n\fphase is [20]:\nFFE (Pi ) = α1 (Px2 + Py2 + Pz2 ) + α11 (Px4 + Py4 + Pz4 )\n+α12 (Px2 Py2 + Py2 Pz2 + Pz2 Px2 )\n+α111 (Px6 + Py6 + Pz6) + α123 Px2Py2 Pz2\n\u0002\n+α112 Px2 (Py4 + Pz4 ) + Py2 (Pz4 + Px4 )\n\u0003\n+Pz2(Px4 + Py4 ) − E * P ,\n\n(3)\n\nwhere the αs are dielectric stiffness coefficients, measured at constant strain. A recent paper\nsuggests that terms up to Pi8 are required in order to accurately model phase transitions in\nBaTiO3 [21]. However, in the present work the temperature dependence of the polarization\nis not being studied and in fact terms of higher order than Pi2 have little affect on the\nmagnetoelectric coupling. Therefore, for simplicity we stick to the Pi6 theory.\n2\nAs in the magnetic case, the depolarizing energy (equal to 21 ǫ−1\n0 Pz for a thin ferroelectric\n\nfilm but less than this value for a heterostructure) is ignored in Eq. (3). It will be commented\non later. Also, the gradient energy is ignored as the electric polarization is assumed to be\naligned within each film. In reality, the polarization may be greatly changed near an interface\nbut these more complicated effects are ignored here.\nThe elastic energy density for both cubic phases is given for simplicity by an expansion\nin strain up to second order terms [22]:\n(ρ)\n\nFel (uik ) =\n\n\u0001\n1 (ρ) (ρ)2\n(ρ)2\n(ρ)2\nC11 uxx + uyy\n+ uzz\n2\n\u0001\n1 (ρ) (ρ)2\n(ρ)2\n(ρ)2\n+ C44 uxy\n+ uyz\n+ uzx\n2\n\u0001\n(ρ)\n(ρ) (ρ)\n(ρ) (ρ)\n(ρ) (ρ)\n+C12 uxx\nuyy + uyy\nuzz + uzz\nuxx ,\n(ρ)\n\n(4)\n\n(ρ)\n\nwhere ρ = m, p denotes the two phases and uij are the strains. Cij are components of the\nelastic compliance tensor for each material.\nThe magnetostrictive energy density coupling the strains and magnetization in a cubic\nmaterial is given by [19, 23, 24]:\n(m)\nFFM-el (ai , ukl )\n\n= B1\n\n\u0010\n\n(m)\n(ax )2 uxx\n\n\u0010\n\n(m)\n\n+\n\n(m)\n(ay )2 uyy\n(m)\n\n+\n\n(m)\n(az )2 uzz\n(m)\n\n+B2 ax ay uxy + ay az uyz + az ax uzx\n\n\u0011\n\n\u0011\n,\n\n(5)\n\nwhere B1 and B2 , following the notation of Kittel, are the magnetoelastic constants with\nunits Jm−3 and can be related to measured magnetostriction constants λ100 and λ111 [19].\n6\n\n\fThe energy density coupling strains and electric polarization is given similarly by [25]\n(p)\n\n(p)\n(p)\n(p)\nFFE-el (Pi , ukl ) = q11 (Px )2 uxx\n+ (Py )2 uyy\n+ (Pz )2 uzz\n\n\u0001\n\n+q12 uxx (Py2 + Pz2 ) + uyy (Px2 + Pz2 ) + uzz (Px2 + Py2 )\n\u0001\n(p)\n(p)\n(p)\n+q44 Px Py uxy\n+ Py Pz uyz\n+ Pz Px uzx\n,\n\n\u0001\n\n(6)\n\nwhere P is the electric polarization and q11 , q12 and q44 are the coupling coefficients with\nunits JmC−2 .\nThe total elastic contribution to the energy density of the effective medium can be found\nby adding together the correctly weighted energy densities, Eqs. (4)-(6):\nn \u0010\n\u0011\n1\n(m)\n(m)\n(m)\n(p)\ndm FFM-el (ai , ukl ) + Fel (uik )\nFtot.el. (ai , Pj , ukl , upq\n) =\ndm + dp\n\u0010\n\u0011o\n(p)\n(p)\n+dp FFE-el (Pi , ukl ) + Fel (uik ) .\n\n(7)\n\nThe thicknesses of the magnetostrictive and piezoelectric films are given by dm and dp .\n\nB.\n\nStrain boundary conditions\n\nIn order to find an approximate magnetoelectric coupling, we impose boundary conditions on the strains in the two respective phases and then minimize Eq. (7) in order to\neliminate strain from the expression. The problem then is which boundary conditions to use.\nHarshé et al. considered four different cases of strain boundary conditions when deriving\nmagnetoelectric coupling between magnetic and electric fields, H and E, in magnetostrictive/piezoelectric thin film composites [10]. Here only one set of boundary conditions will\nbe considered.\nIt is assumed that the heterostructure is mechanically clamped in the z-direction, perpendicular to the plane of each interface. This is illustrated in Fig. 1(a). Therefore the total\ndistortion along the z direction must be zero and the boundary condition is [10]\n(m)\n(p)\ndm uzz\n+ dp uzz\n= 0.\n\n(8)\n\nFurthermore, it is assumed that each interface has perfect mechanical bonding and therefore\nany distortion in the transverse directions will be equal in both phases:\n(p)\n(m)\nuxx\n= uxx\n(m)\n(p)\nuyy\n= uyy\n.\n\n7\n\n(9)\n(10)\n\n\fFIG. 1: (Color online) Panel (a) shows a schematic of the heterostructure geometry. The structure\nis clamped, with no friction, in the z-direction. The magnetostrictive (m) and piezoelectric (p)\nphases are mechanically bonded. This geometry corresponds to Case IV in Ref. [10]. Two repeats\nonly are drawn for simplicity. Infinite repeats of the magnetostrictive/piezoelectric thin films are\nconsidered in the effective medium calculation in the next section. In panel (b), a schematic\ndrawing shows how the shear strains uyz may be different in different films.\n\nThis ignores any mismatch strain between the two materials due to different unit cell sizes.\nThis can be accounted for using methods used previously for piezoelectric films [18] and\nwould merely alter the boundary conditions by a constant while still ultimately giving rise\nto a magnetoelectric coupling.\nThe shear strains correspond to a change in the angle between the unstrained cartesian\ncoordinates. Therefore, the shear in the x − y plane must be equal in both films due to the\nperfect mechanical bonding:\n(m)\n(p)\nuxy\n= uxy\n.\n\n(11)\n\nHowever, the shears in the x − z and y − z planes have no restrictions. It is possible for\na shear in the magnetostrictive material to be different than the shear in the piezoelectric\nmaterial, as long as the height of the heterostructure in the z direction is conserved. This\nis illustrated schematically in Fig. 1(b).\n\n8\n\n\fC.\n\nSolutions for the strains\n(p)\n\n(p)\n\n(p)\n\n(p)\n\nSubstituting Eqs. (8)-(11) into Eq. (7), uxx , uyy , uzz and uxy can be eliminated. Then\nsolving\n\n∂F\n(m)\n∂uij\n\n= 0 (i,j = x,y,z) and\n\n∂F\n(p)\n∂uxz\n\n= 0 and\n\n∂F\n(p)\n∂uyz\n\n= 0, the strains that minimize the\n\nfree energy are found. The simplest strain components to derive (since they are uncoupled\nfrom the other strains) are the shear components:\nuxy = −\n(m)\nuxz\n= −\n(p)\nuxz\n= −\n(m)\nuyz\n= −\n(p)\nuyz\n= −\n\ndm B2 ax ay + dp q44 Px Py\n(m)\n\n(12)\n\n(p)\n\ndm C44 + dp C44\nB2 ax az\n(m)\n\n(13)\n\n(p)\n\n(14)\n\n(m)\n\n(15)\n\nC44\nq44 Px Pz\nC44\nB2 ay az\nC44\nq44 Py Pz\n(p)\n\nC44\n\n.\n\n(16)\n\nBy the symmetry of the boundary conditions, the transverse strains uxx and uyy are\n(m)\n\n(p)\n\nsymmetric on exchange of subscripts x and y, whereas uzz = −(dp /dm )uzz is different. The\ntransverse strains are therefore given by\ndm B1 f1 (ai ) + dp q11 f2 (Pj ) + dp q12 f3 (Pj )\nc1 c22\n= uxx (ax ↔ ay , Px ↔ Py )\n\nuxx =\n\n(17)\n\nuyy\n\n(18)\n\n9\n\n\fwhere functions f1 , f2 and f3 are defined\nh\n(m)\n(p)\n(m)\n(p)\nf1 (ai ) = −a2x (dm C11 + dp C11 )(dp C11 + dm C11 )\ni\n(m)\n(p) 2\n+dm dp (C12 − C12 )\nh\n(m)\n(p)\n(m)\n(p)\n+a2y (dm C12 + dp C12 )(dp C11 + dm C11 )\ni\n(m)\n(p)\n−dm dp (C12 − C12 )2\n(p)\n\n(m)\n\n−a2z dp (C12 − C12 )c1 ,\nh\n(m)\n(p)\n(m)\n(p)\nf2 (Pj ) = −Px2 (dm C11 + dp C11 )(dp C11 + dm C11 )\ni\n(m)\n(p) 2\n+dm dp (C12 − C12 )\nh\n(m)\n(p)\n(m)\n(p)\n+Py2 (dm C12 + dp C12 )(dp C11 + dm C11 )\ni\n(m)\n(p)\n−dm dp (C12 − C12 )2\n(p)\n\n(19)\n\n(m)\n\n+Pz2 dm (C12 − C12 )c1 ,\nh\n(p)\n(m)\n(p)\n(m)\n(p)\nf3 (Pj ) = Px2 dm (C11 + C12 − C12 )([dm − dp ]C12 + 2dp C12 )\ni\n(m)\n(m)\np\n2\n2\n+C11 (dm [dp − dm ]C12 + [dm + dp ]C12 )\n(p)\n\n(m)\n\nPy2 c20 − Pz2 (dm C11 + dp C11 )c1\n\n(20)\n\n(21)\n\nand\n(m)\n\n(p)\n\n(m)\n\n(p)\n\n(m)2\n\nc20 = −d2m C11 (C11 + C12 − C12 ) − dm dp C11\n(p)2\n\n(m)\n\n(p)\n\n(p)\n\n(m)\n\n(p)\n\n+ d2p C11 C11\n(m)\n\n+dm (−dp C11 + [C12 − C12 ][−dp C11 + (dm + dp )C12 ]\n(m)\n\n(m)\n\n(p)\n\n(p)\n\nc1 = dm (C11 − C12 ) + dp (C11 − C12 ),\n\u0011\n\u0010\n(p)\n(m)\nc22 = dm C11 + dp C11\n\u0010\n\u0011\n(m)\n(m)\n(p)\n(p)\n× dm (C11 + C12 ) + dp (C11 + C12 )\n(m)\n\n(p)\n\n−2dm dp (C12 − C12 )2 .\n\n(22)\n(23)\n\n(24)\n\nThe zz-component is given by\n(m)\nuzz\n=\n\n\u0010\n\u0011\n\u0001\ndp n\n(m)\n(p)\n2\n2\n−\nm\n+\nm\nB\nd\n−C\n+\nC\n− m2z B1 dp c3\n1\nm\nx\ny\n12\n12\nc22\n\u0011\n\u0001\u0010\n(m)\n(p)\n+ Px2 + Py2 dp q11 (C12 − C12 ) + q12 c3\n\u0010\n\u0011o\n(m)\n(p)\n−Pz2 q11 c3 − 2dp q12 (C12 − C12 )\n10\n\n(25)\n\n\fwhere\n(m)\n\n(m)\n\n(p)\n\n(p)\n\nc3 = dm (C11 + C12 ) + dp (C11 + C12 ).\n\nD.\n\n(26)\n\nResulting free energy\n\nSubstituting Eqs. (12)-(26) for the strain back into the total strain free energy [Eq. (7)],\nwe obtain a energy density which takes the form\nFtot.el. (ai , Pj ) = Xii a4i + Xij a2i a2j + Yii Pi4\n+Yij Pi2 Pj2 + Zii a2i Pi2\n∗\n+Zij a2i Pj2 + Zxy\nax Px ay Py ,\n\n(27)\n\nwhere Einstein summation over variables i, j = x, y, z is assumed and i 6= j. The X coefficients (units Jm−3 ) represent the effect of strain on the magnetization, the Y coefficients\n(units JC−4 m5 ) represent the effect of strain on the electric polarization, and the Z coefficients (units JC−2 m) give the strength of the magnetoelectric coupling. This represents\nmany more terms than is calculated using simpler Landau expansions, where only the complete free energy of one of the two films is considered [12–14].\nDue to the asymmetric boundary conditions, Xxx = Xyy 6= Xzz , Xxz = Xyz 6= Xxy , and\nso on for the other coefficients. The independent magnetic coefficients are given by\nB12 d2m c24\n2(dm + dp )c1 c22\ndm dp B12 c3\n= −\n2(dm + dp )c22\n\nXxx = −\n\n(28)\n\nXzz\n\n(29)\n!\n\nXxy\n\n1 2\nB\nd2m\nB12 c25\n2 2\n=\n−\n2\n(m)\n(p)\n(dm + dp ) c1 c2\ndm C44 + dp C44\n\nXxz\n\ndm B22\ndp d2m B12 (C12 − C12 )\n−\n= −\n,\n(m)\n(dm + dp )c22\n2(dm + dp )C44\n\n(p)\n\n(30)\n\n(m)\n\n(31)\n\nwhere\n(m)2\n\nc24 = dm dp C11\n\n\u0010\n\u0011\n(p)2\n(m)\n(p)\n+ dm dp C11 − (C12 − C12 )2\n(m)\n\n(p)\n\n+(d2m + d2p )C11 C11\n(m)\n\n(32)\n\n(p)\n\nc25 = −dm dp (C12 − C12 )2\n(p)\n\n(m)\n\n(p)\n\nm\n+(dm C11 + dp C11 )(dm C12\n+ dp C12 ).\n\n11\n\n(33)\n\n\fThe independent electric coefficients are given by:\n\nYxy\n\nYxz\n\n2 2 2\n2\n−q11\ndp c3 + 2q11 q12 d2p c26 + q12\ndp c27\n2(dm + dp )c1 c22\n\u0010\n\u0011\n(p)\n(m)\n(p)\n(m)\n2\n2\ndp dm q11 c3 − 4dm dp q11 q12 (C12 − C12 ) + 2dp q12 (dm C11 + dp C11 )\n= −\n2(dm + dp )c22\n\nYxx =\n\n(34)\n\nYzz\n\n(35)\n\n2\n2 2\nd2p q44\nd2p q11\nc5\n−\n=\n(m)\n(p)\n(dm + dp )c1 c22 2(dm + dp )(dm C44\n+ dp C44 )\n2 3\nd2p q11 q12 c29\ndp q12\nc8\n+\n+\n(36)\n(dm + dp )c1 c22 (dm + dp )c1 c22\ni\nh\nn\ndp\n(p)\n(m)\n(p)\n(m)\n(p)\n(m)\n2\n2\nd\n(C\n+\n2C\n−\n2C\n)\n+\nd\nC\nd\nd\nq\n(C\n−\nC\n)\n−\nd\nq\n=\nm\np\nm\np\np\n11\n12\n12\n11\n11\n12\n12\n12\n(dm + dp )c22\nh\nio\n(m)\n(m)\n(p)\n(m)\n(m)\n−q11 q12 (C11 + C12 )d2m + (2C11 + C12 )dm dp + C11 d2p )\n(p)2\n\n−\n\ndp q44\n\n(p)\n\n2C44 (dm + dp )\n\n,\n\n(37)\n\nwhere in Eq. (34) we have constants\n\u0011\n\u0010\n(m)\n(m)\n(m)\n(p)\n(p) (m)\nc26 = d2m (C12 − C11 )(C12 − C12 ) + C11 C12\n\u0010\n\u0011\n(m)\n(p)\n(p)\n(p)\n(p)\n(p)\n(m)\n(m)\n(m)\n+dm dp C12 (3C12 − C11 ) + 2C12 (C11 − C12 ) + C12 (C11 − C12 )\n(p)\n\n(m)\n\n+d2p C12 C11\n\u0010\n\u0011\n(m)\n(p)\n(p)\n(m)\n(m)\n(m)\n2\n2\nc7 = dp dm C11 (2C12 − 3C11 ) + C12 (2C12 − 2C11 )\n(m)2\n\n+dm (d2m + d2p )(C12\n(p)\n\n(p)\n\n(m)\n\n(m)2\n\n(38)\n\n(p)\n\n− C11 ) − d3p C11 C11\n(m)\n\n(p)\n\n−2dm d2p C11 (C11 + C12 − C12 ).\n\n12\n\n(39)\n\n\fThe magnetoelectric coefficients, which are of most interest, are given by:\ndm dp B1 (q11 c24 − q12 c26 )\n= Zyy\n(dm + dp )c1 c22\n\u0010\n\u0011\n(m)\n(p)\ndm dp B1 q11 c3 + 2q12 dp (C12 − C12 )\n\nZxx = −\n\n(40)\n\nZzz =\n\n(41)\n\nZxy =\nZxz =\nZzx =\n∗\nZxy\n=\n\n(dm + dp )c22\ndm dp B1 (q11 c25 + q12 c20 )\n(dm + dp )c1 c22\n\u0010\n\u0011\n(m)\n(p)\n(p)\n(m)\ndm dp B1 q11 dm (C12 − C12 ) + q12 (dm C11 + dp C11 )\n−\n= Zyz\n(dm + dp )c22\n\u0010\n\u0011\n(m)\n(p)\ndm dp B1 q11 dp (C12 − C12 ) + q12 c3\n= Zzy\n(dm + dp )c22\ndm dp q44 B2\n−\n.\n(m)\n(p)\n(dm + dp )(dm C44 + dp C44 )\n\n(42)\n(43)\n(44)\n(45)\n\nNotice that if the thickness of either films vanishes (dm/p → 0), then the magnetoelectric\ncoupling vanishes. There is also an optimum ratio dm /dp such that the magnetoelectric\ncoupling is maximized, as will be shown in Section III.\nNow that strain has been eliminated, the effective free energy due to strain [Ftot.el ,\nEq. (27)] can be added to the unstrained free energies of the piezoelectric and magnetostrictive phases [FFM + FFE , Eqs. (2) and (3)]. Before calculating the ferromagnetic resonant\nfrequency of such a system in Section III, we first estimate how the strain alters the magnetic and piezoelectric constants (K and α) and estimate the strength of the magnetoelectric\ncoupling for a BaTiO3 /NiFe2 O4 heterostructure.\n\nE.\n\nBaTiO3 /NiFe2 O4 coupling strength\n\nA heterostructure comprising equal thickness films (dm = dp ) of piezoelectric BaTiO3 and\nmagnetostrictive NiFe2 O4 is considered. The ferroelectric parameters for BaTiO3 in Eq. (3)\nare taken from Ref. [20] and are: α1 = −2.772 × 107 J m C−2 , α11 = −6.476 × 108 J m5 C−4 ,\nα12 = 3.230 × 108 J m5 C−4 , α111 = 8.004 × 109 J m9 C−6 , α112 = 4.470 × 109 J m9 C−6\nand α123 = 4.910 × 109 J m9 C−6 . The piezoelectric and elastic compliance parameters\nare also taken from Ref. [20]: q11 = −14.20 × 109 J m C−2 , q12 = 0.74 × 109 J m C−2 ,\n(p)\n\n(p)\n\nq44 = −3.14 × 109 J m C−2 , C11 = 27.50 × 1010 J m−3 , C12 = 17.90 × 1010 J m−3 and\n(p)\n\nC44 = 5.43 × 1010 J m−3 .\n13\n\n\f(m)\n\n(m)\n\nThe parameters for NiFe2 O4 are taken from Ref. [7]: C11 = 21.99 × 1010 N m−2 , C12 =\n(m)\n\n10.94 × 1010 N m−2 , C44\n\n= 8.12 × 1010 N m−2 and μ0 M0 = 0.32 T (4πM0 = 3200 G\n\nin CGS). The demagnetizing energy density is then 8.2 × 104 J m−3 . For the anisotropy\nconstant the value found by Weisz [26] is used, namely K = 4 × 103 J m−3 . An applied field\nμ0 H = 0.1 T x̂ is also applied to ensure that a preferred direction of magnetization exists\nand later the equations of motion will be well-defined.\nWith these material parameters, the equilibrium magnetization and electric polarization\ncan be found by calculating the free energy minima for each possible direction of the order\nparameters [18]. The equilibrium corresponds to the state with the lowest energy minima.\nThe spontaneous electric polarization and magnetization are found to both lie along the\nx axis (see Fig. 1), ie.\na = (1, ay , az )\n\n(46)\n\nP = (P + px , py , pz ),\n\n(47)\n\nwhere the lower case symbols ay , az << 1 and pi << P (i = x, y, z) represent small dynamic\nquantities that will be relevant in Section III. This result is obtained whether we consider the\ndemagnetizing and depolarizing energy to be that of a thin film or that of bulk. In reality,\nthe demagnetizing and depolarizing energy is somewhere between these two limits for the\nheterostructure and therefore the result holds for this geometry also. Then, by ignoring at\nfirst the contribution to the free energy due to strain [Eq. (27)] and only considering Eq. (3),\nthe polarization in zero applied field is [17]\np\n2\n−α11 ± α11\n− 3α1 α111\n= 0.265 Cm−2 .\nP =\n3α111\n\n(48)\n\nNow it is possible to estimate the effect that the strains have on the magnetic and electric\nx\nz\nsystems. Firstly, the strains alter α11 by over 10%: α11\n→ (α11 + Yxx ) and α11\n→ (α11 + Yzz ),\n\nwhere Yxx = −1.66 × 108 J C−4 m5 and Yzz = −1.03 × 108 J C−4 m5 , using Eqs. (34) and\n(35). This in turn alters the value of the polarization calculated without strains in Eq. (48)\nby 8% (P = 0.286 C m−2 ).\nAll of the strain-mediated magnetic, electric and magnetoelectric coefficients are listed\nin Table I for the material parameters listed above. The electric coefficients are multiplied\nby P 4 = 0.2864 and the magnetoelectric coefficients are multiplied by P 2 = 0.2862 so that\nevery term has units of energy density and their strengths can be compared.\n14\n\n\fTABLE I: Values of the strain-mediated magnetic (Xij ), electric (Yij ) and magnetoelectric (Zij )\ncoefficients for a BaTiO3 /NiFe2 O4 thin film heterostructure with dm = dp , derived from Eqs. (28)(45). Yij coefficients are multiplied by P 4 = 0.2864 C4 m−8 and Zij coefficients are multiplied by\nP 2 so that all values are in units J m−3 .\nXxx\n\nXzz\n\nXxy\n\nXxz\n\n-9.86\n\n-6.64\n\n-39.7\n\n-86.4\n\nYxx P 4\n\nYzz P 4\n\nYxy P 4\n\nYxz P 4\n\n−1.11 × 106\n\n−7.14 × 105\n\n1.27 × 106\n\n-6.88 ×104\n\nZxx P 2\n\nZzz P 2\n\nZxy P 2\n\nZxz P 2\n\n6.61 × 103\n\n−4.35 × 103\n\n−3.99 × 103\n\n-524\n\nZzx P 2\n\n∗ P2\nZxy\n\n587\n\n4.99 × 103\n\nStrain has a large effect on the ferroelectric parameters, as illustrated by the 8% change in\nP , but a very small effect on the magnetic parameters. This is perhaps not surprising since\nlattice displacements (strains) are intimately related to ferroelectricity but are not necessary\nfor magnetic ordering. For example, the magnetic coefficients Xii are all on the order of 1 80 J m−3 (see Table I) and so strain changes the anisotropy energy by under 1%. From now\non we therefore ignore the effect of the Xii .\nThe fact that strain has a large effect on the piezoelectric phase and a relatively small\neffect on the magnetostrictive phase leads to a strain-mediated magnetoelectric coupling\nwhich has an intermediate strength.\n\nIt is proportional to a product of magnetostric-\n\ntive/piezoelectric coefficients, such as B1 q11 . For example, Zxx P 2 = 6.61 × 103 J m−3 .\nWhile this value represents less than 0.3% of the ferroelectric energy density contributions\n(characterized by α1 ), it is larger than the magnetic anisotropy energy in an unstrained\nsystem. Therefore, we can expect in our subsequent calculation for the high frequency susceptibility that the ferromagnetic resonance (FMR) frequency will be shifted by an electric\nfield while the affect of a magnetic field on the electric modes will be negligible.\n\n15\n\n\fIII.\n\nHIGH FREQUENCY EFFECTS OF MAGNETOELECTRIC COUPLING\n\nTo calculate the high frequency susceptibility χ̂ of the heterostructure, the effective\nmedium method presented in Ref. [3] is used. Unlike in Ref. [3], the full 6 × 6 susceptieff\neff\nbility is not solved for. Instead, only χm\nzz ≡ mz /hz is solved for to demonstrate the action\n\nof the magnetoelectric coupling on the FMR frequency. In Section II the number of repeats\nof the thin films is considered finite, as illustrated in Fig. 1. However, the effective medium\nmethod considers the number of repeats to be infinite. The results for the frequency should\nbe accurate for a large number of unit cell repeats and will be qualitatively correct for a\nsmall number of repeats.\n\nA.\n\nEquations for the resonant frequencies\n\nThe calculation involves solving the linearized magnetization and electric polarization\nequations of motion together with Maxwell's boundary conditions for the dipolar fields.\nThe total energy density F = FFM + FFE + Ftot.el. , the sum of Eqs. (2), (3) and (27), is\nsubstituted into the equations of motion (in SI units):\n\u0013\n\u0012\n1 δF\nda\n= γa × −\ndt\nM δa\n2\ndP\nδF\n=\n−ǫ\nf\n,\n0\ndt2\nδP\n\n(49)\n(50)\n\nwhere γ is the gyromagnetic ratio (γ = 2π2.89 × 1010 rad Hz T−1 ) and f is the effective\nmass term (f = (2π)2 1.5 × 1026 Hz2 ). Then the equations are linearized using Eqs. (46) and\n(47) and small oscillatory solutions are assumed (ay/z ∝ e−iωt and pi ∝ e−iωt ). The resulting\nequations of motion for the magnetization in the magnetostrictive phase are:\niω\nay = = az [BK + B0 − Bxx (P ) − Bxz (P )]\nγ\n−μ0 hz(m)\niω\n− az = −ay [Bk + B0 − Bxx (P ) + Bxy (P )]\nγ\n∗\nZxy\nP\n−\npy + μ0 hy(m) ,\nM\n\n−\n\nwhere B 0 = μ0 H 0 represents the static magnetic field along the +x direction, BK =\nthe effective anisotropy field, Bij (P ) =\n\nP2\n\n2Zij\nM\n\n16\n\n(51)\n\n(52)\n2K\nM\n\nis\n\nis the effective magnetic field due to magne-\n\n\f(m)\n\ntoelectric coupling and hz\n\n(m)\n\nand hx\n\nare components of the dipolar magnetic field in the\n\nmagnetostrictive material.\n∗\nIn Eq. (52), it can be seen that the magnetoelectric coupling energy Zxy\nax ay Px Py leads to\n\na dynamic coupling between the magnetization and the y-component of the electric polarization in the piezoelectric phase. Moreover, the other magnetoelectric coupling terms alter\nthe effective static magnetic field felt by the system and therefore will alter the resonant\nfrequency.\nSince py is dynamically coupled to the magnetization equations of motion, we also write\nits equation here:\n\u0002\n\u0003\nω2\n∗\n−\npy = −2py α1 + (α12 + Yxy )P 2 + α112 P 4 − Zxy\nP ay + ey ,\nǫ0 f\n\n(53)\n\nwhere ey is a component of the electric dipolar field.\n\nMaxwell's boundary conditions between the films for the magnetic dipolar fields in the\nmagnetostatic limit are that the in-plane component of the magnetic field and the out-ofplane component of the magnetic induction must be continuous, ie.\nhz(m) + az M0 = hz(p) =\n(m)\n\nC\nμ0\n\n(54)\n\n(p)\n\nhx/y = hx/y ,\n\n(55)\n\nwhere C is a constant, defined for convenience in the calculation and h(p) is the magnetic\ndipolar field in the piezoelectric films. The susceptibility components due to the out-of-plane\n(m)/(p)\n\ndipolar field hz\n\nmust be calculated first to properly include the dipolar field effects due\n\nto the boundary conditions. It is this step of including Maxwell's boundary conditions before\nsolving for the equations of motion that sets this type of effective medium method apart\nfrom other effective medium methods and which leads to a more sophisticated model for the\ndemagnetizing effects on the frequencies.\nThe zz component of the magnetic susceptibility of the effective medium can be calculated\nby setting hy = 0 = ey and by using the weighted average:\nχm\nzz ≡\n\ndm az M\nmeff\nz\n=\n.\n(m)\n(p)\neff\nhz\ndm hz + dp hz\n(m)\n\nEqs. (51)-(54) can be rearranged so that az , ay , py , hz\n\n17\n\n(56)\n(p)\n\nand hz are all written in terms of\n\n\fthe constant C, which therefore cancels in Eq. (56). The result is\n\u0010\n\u0011\n∗2 P 2\nf ǫ0 Zxy\ndm μ0 Mγ 2 B0 + BK − Bxx + Bxy + M (ω\n2 −ω 2 )\nT\nχm\n,\nzz =\n2\n2\ndm (ω 2 − ωb ) + dp (ω 2 − ωf )\n\n(57)\n\nwhere ωb is the bulk ferromagnetic frequency under strain given by:\n\u0012\n∗2 2 \u0013\nf ǫ0 Zxy\nP\nωb2\n= B0 + BK − Bxx + Bxy +\n2\n2\nγ\nM(ω − ωT2 )\n× (B0 + BK − Bxx − Bxz + μ0 M) ,\n\n(58)\n\nωf is the thin film ferromagnetic frequency under strain given by:\n\u0012\n∗2 2 \u0013\nωf2\nf ǫ0 Zxy\nP\n= B0 + BK − Bxx + Bxy +\n2\n2\nγ\nM(ω − ωT2 )\n× (B0 + BK − Bxx − Bxz ) ,\n\n(59)\n\nand ωT is the frequency of the transverse phonon mode associated with the ferroelectric\npolarization, with oscillation in the y direction\n\u0001\nωT2 = f ǫ0 2 α1 + (α12 + Yxy )P 2 + α112 P 4 .\n\n(60)\n\nIt can be noticed that Eqs. (58) and (59), are implicit equations in ω. However, it can\nbe shown that ωb/f (typically in the low GHz) and ωT (typically in the low THz regime) are\nvery widely spaced in frequency. Therefore, the magnetic frequencies can be approximated\n∗\nvery well by ignoring the term proportional to Zxy\nin Eqs. (58) and (59).\n\nThe pole of Eq. (57) is given by the positive solution to\n\u0001\n0 = dm ω 2 − ωb2 + dp (ω 2 − ωf2 )\n\n(61)\n\nand corresponds to the ferromagnetic resonance frequency. This equation shows how the\neffective medium method calculates a resonant frequency for the heterostructure which is\nbetween that of bulk ωb and that of a thin film ωf . In Ref. [3] it was shown that the effective\nmedium FMR frequency reduces to the correct results in these well-known limits.\n\nB.\n\nElectric field shift of the FMR frequency\n\nSince applying an electric field alters the effective magnetic fields Bxx (P ) and Bxz (P )\nin Eqs. (58) and (59), it shifts the FMR frequency of the effective medium. This is shown\n18\n\n\fin Fig. 2. In panel (a) χm\nzz (Eq. (56)) is plotted as a function of frequency for no applied\nelectric field (solid line) and for an applied electric field along the +x̂ direction equal to\n107 V/m (dashed line). The pole in the susceptibility corresponds to the FMR frequency.\nSince damping is not included in the calculation, the peaks are not rounded at all, as is seen\nin real experiments. The FMR frequency is plotted as a function of electric field in panel\n(b).\n\nFIG. 2: (Color online) The zz-component of the magnetic susceptibility as a function of frequency\n(panel (a)) for a BaTiO3 /NiFe2 O4 heterostructure, with each film of equal thickness dm = dp . A\npeak occurs at the ferromagnetic resonance (FMR) frequency. The peak is shifted downwards by\napplication of an electric field in the positive x-direction (dashed line). In panel (b) the FMR\nfrequency is plotted as a function of applied electric field strength.\n\nAlthough it is encouraging to see a shift in the FMR frequency when an electric field is\napplied, a large field is needed to see a 0.2 GHz shift and this appears too small for signal\nprocessing applications. However, it is slightly larger than FMR shifts seen in most recent\nexperiments on similar systems, for example, Refs. [27, 28]. Alternatively, experiments may\n19\n\n\fapply a constant driving frequency and sweep the applied magnetic field H and then the\nresonant field shift as a function of E may be measured. At a constant driving filed of 9 GHz,\nour calculation gives a shift in H of 350 Oe (μ0 ∆H = 0.35 T) when a field E = 108 V/m\nis applied compared with when there is no field. This value is higher than measurements\nmade, for example, by Bichurin et al. [2] on ferrite/PZT samples but on the same order of\nmagnitude as that measued by Liu et al. [29]. However, even larger effects have recently\nbeen seen when the ferrite material is replaced with the amorphous alloy FeGaB [30, 31].\n\nFIG. 3: (Color online) The zz-component of the magnetic susceptibility as a function of frequency\nfor a BaTiO3 /NiFe2 O4 heterostructure (dm = dp ) at high frequencies. A peak occurs at the\ntransverse phonon resonance. The peak is shifted upwards by application of a positive electric field\n(dashed line). Notice that the vertical scale is 104 times smaller than that of Fig. 2(a).\n\nIt should be noted that there is a second, weak pole in the plot of χm\nzz as a function of\nfrequency outside the range shown in Fig. 2(a). This occurs at the transverse phonon mode\nfrequency and is due to the dynamic magnetoelectric coupling discussed. It could not be\npredicted in an EMM where the polarization dynamics were ignored. Since it is an electric\nmode frequency, it is highly tunable with electric fields, as illustrated in Fig. 3. A field of\nE = 107 V/m shifts the frequency upward by roughly 32 GHz. Although it is highly tunable,\nthis resonance is too weak and too high to be useful for microwave applications.\nTo try to match with particular experiments, the exact material parameters and geometry and strain boundary conditions must be input into the model. In particular, most\nexperiments are performed with the poling direction out-of-plane whereas the results in\nthis section have the polarization and applied electric field in-plane to simplify the effective\n20\n\n\fmedium method. Changing the poling direction to out-of-plane (therefore able to apply\nlarger electric fields) and modeling specific experiments represents an exciting extension to\nthe work presented here.\nOnly one other set of strain boundary conditions is considered to see what effect different\nboundary conditions have on the solutions demonstrated in Figs. 2 and 3. The mechanical\n(m)\n\n(p)\n\nclamping in the z-direction [Eq. (8)] is relaxed and uzz and uzz are decoupled. Repeating\nthe entire calculation for the strain-mediated magnetoelectric coupling and the resulting\nhigh frequency dynamics, it is found that the change in boundary conditions has little effect\non the FMR frequency, changing the values calculated by under 0.01 GHz. However, the\nfrequency of the transverse phonon mode, ωT , is shifted down in frequency by roughly\n10 GHz. This reflects again the fact that the piezoelectric system is sensitive to changes in\nthe strain whereas the magnetic system is weakly affected. Also, for this geometry, Zxx is\nthe magnetoelectric coupling term which most affects the FMR frequency (see Eqs. (58) and\n(59)) and this term is relatively unchanged when the uzz strains are altered. Changing the\nboundary conditions for in-plane strains may therefore alter the FMR frequency by a larger\namount.\n\nC.\n\nThickness effects\n\nBefore concluding this section, the effect of the relative film thicknesses will be discussed. The ratio of the thickness of the piezoelectric versus the magnetostrictive film\n(dp :dm ) changes both the magnetoelectric coupling strength and the magnetic dipolar fields\nin the heterostructure. Therefore the effective medium calculation for the FMR frequency is\naltered through Eq. (61). The result of these two effects is shown in Fig. 4, where the FMR\nfrequency is plotted as a function of the volume fraction of magnetostrictive material. The\nsolid line shows the result in zero applied electric field and the dashed line shows the result\nwhen E = 107 V/m. The dotted line at the top shows the result of the effective medium\ncalculation if the effect of strains is ignored (Bij = 0).\nIt can be seen in Fig. 4 that the strain coupling between the magnetostrictive and\npiezoelectric films changes the FMR frequency significantly.\n\nFor a volume fraction of\n\ndm /(dm + dp ) = 0.4, the FMR frequency in the strained system (solid line) is half that\nfor the unstrained system (dotted line). Fig. 4 also reveals that a volume fraction of around\n21\n\n\fFIG. 4: (Color online) The FMR frequency, calculated using Eq. (61), as a function of the magnetostrictive material's volume fraction dm /(dm + dp ). The solid line shows the result in zero applied\nelectric field and the dashed line shows the result when E = 107 V/m. The dotted line shows the\nresult if there were no strain coupling to the piezoelectric.\n\n0.5 results in the largest possible change in the FMR frequency on application of an applied electric field, although this effect is weak. All three frequency calculations agree in\nthe limits dm → 0 and dp → 0 since then the strain coupling (and electric field) have no\ninfluence on the FMR frequency. For dm → 0 (volume fraction is 0), the frequency of a thin\nmagnetostrictive film is found. For dp → 0 (volume fraction is 1), the frequency of the bulk\nmagnetostrictive material is found. In between, it can be seen how the effective medium\nmethod finds frequencies between these two limits since the dipolar energy is between these\ntwo extremes.\n\nIV.\n\nCONCLUSION\n\nIn conclusion, it has been shown how strain-mediated magnetoelectric coupling energies\ncan be determined for magnetostrictive/piezoelectric thin film heterostructures. This is done\nusing Landau free energy expansions in terms of the magnetization, polarization and strains\nof both thin films, and then eliminating strain using boundary conditions.\nThe resulting terms are used to calculate the electric field shift in the FMR frequency\nin a BaTiO3 /NiFe2 O4 heterostructure. A shift of 0.2 GHz is calculated for an applied\nfield E = 107 V/m. This is on the same order of magnitude as some experiments. The\n\n22\n\n\fparticular geometry and strain boundary conditions that are assumed may affect the strength\nof the derived magnetoelectric coupling terms and therefore affect the shift in the FMR\nfrequency. An analysis of different materials will enable predictions to be made on which\nheterostructures are best for possible applications.\nWhat has not been mentioned so far in this work is the fact that magnetoelectric (ferrimagnetic/ferroelectric) heterostructures in which there is little strain-mediated coupling\nbetween magnetic and electric phases have also been shown to have a large magnetoelectric\ncoupling and shifts in the FMR frequency may occur of the same magnitude as in mechanically bonded systems [32, 33]. This is due to the intrinsic hybridization of electric and\nmagnetic fields and is not captured in our theory since the magnetostatic and electrostatic\nlimit is assumed. Methods such as those described in Refs. [32, 34] may be used to calculate\nthe FMR frequency beyond the magnetostatic limit. Future work will involve adding strainmediated magnetoelectric couplings, like those derived in this paper, into such a theory to\nincorporate both the effects of strains and hybridized fields and to determine their relative\nimportance.\n\nAcknowledgments\n\nSupport is acknowledged from the Australian Research Council.\n\n[1] C.-W. Nan, M. I. Bichurin, S. Dong, D. Viehland, and G. Srinivasan, J. Appl. Phys 103,\n031101 (2008).\n[2] M. I. Bichurin, V. M. Petrov, Y. V. Kiliba, and G. Srinivasan, Phys. Rev. B 66, 134404 (2002).\n[3] K. L. Livesey and R. L. Stamps, Phys. Rev. B 81, 094405 (2010).\n[4] V. Agranovich and V. E. Kravtsov, Solid State Commun. 55, 373 (1985).\n[5] N. Raj and D. R. Tilley, Phys. Rev. B 36, 7003 (1987).\n[6] N. S. Almeida and D. L. Mills, Phys. Rev. B 38, 6698 (1988).\n[7] M. I. Bichurin, I. A. Kornev, V. M. Petrov, A. S. Tatarenko, Y. V. Kiliba, and G. Srinivasan,\nPhys. Rev. B 64, 094409 (2001).\n[8] M. I. Bichurin, V. M. Petrov, O. V. Ryabkov, S. V. Averkin, and G. Srinivasan, Phys. Rev.\n\n23\n\n\fB 72, 060408 (2005).\n[9] M.I. Bichurin, V.M. Petrova, and T.A. Galkina, Eur. Phys. J. Appl. Phys. 45, 30801 (2009).\n[10] G. Harshé, J. P. Dougherty and R. E. Newnham, Int. J. Appl. Electromagn. Mater. 4, 145\n(1993).\n[11] C.-W. Nan, Phys. Rev. B 50, 6082 (1994).\n[12] T. Wu, M. A. Zurbuchen, S. Saha, R.-V. Wang, S. K. Streiffer and J. F. Mitchell, Phys. Rev.\nB 73, 134416 (2006).\n[13] N. A. Pertsev, Phys. Rev. B 78, 212102 (2008).\n[14] V. G. Kukhar, N. A. Pertsev and A. L. Kholkin, Nanotech. 21, 265701 (2010).\n[15] R. L. Stamps and R. E. Camley, Phys. Rev. B 54, 15200 (1996).\n[16] K. L. Livesey, D. C. Crew, and R. L. Stamps, Phys. Rev. B 73, 184432 (2006).\n[17] A. Amin, M. J. Haun, B. Badger, H. McKinstry and L. E. Cross, Ferroelectrics 65, 107 (1985).\n[18] N. A. Pertsev, A. G. Zembilgotov and A. K. Tagantsev, Phys. Rev. Lett. 80, 1988 (1998).\n[19] C. Kittel, Rev. Mod. Phys. 21, 541 (1949).\n[20] J. Hlinka, P. Ondrejkovic and P. Marton, Nanotech. 20, 105709 (2009).\n[21] Y. L. Li, L. E. Cross and L. Q. Chen, J. Appl. Phys. 98, 064101 (2005).\n[22] D. R. Lovett, Tensor Properties of Crystals (IOP Publishing, Bristol, 1989).\n[23] R. R. Birss, Symmetry and Magnetism (North-Holland Publishing Company, Amsterdam,\n1964).\n[24] C. Kittel, Phys. Rev. 110, 836 (1958).\n[25] W. Cao and L. E. Cross, Phys. Rev. B 44, 5 (1991).\n[26] R. S. Weisz, Phys. Rev. 96, 800 (1954).\n[27] A. S. Tatarenko, A. B. Ustinov, G. Srinivasan, V. M. Petrov and M. I. Bichurin, J. Appl.\nPhys. 108, 063923 (2010).\n[28] J. Das, M. Li, S. S. Kalarickal, S. Altmannshofer, K. S. Buchanan, J. F. Li, and D. Viehland,\nAppl. Phys. Lett. 96, 222508 (2010).\n[29] M. Liu, O. Obi, J. Lou, Y. Chen, Z. Cai, S. Stoute, M. Espanol, M. Lew, X. Situ, K. S. Ziemer,\nV. G. Harris, and N. X. Sun, Adv. Funct. Mater 19, 1826 (2009).\n[30] J. Lou, D. Reed, C. Pettiford, M. Liu, P. Han, S. Dong, and N. X. Sun, Appl. Phys. Lett. 92,\n262502 (2008).\n[31] J. Lou, M. Liu, D. Reed, Y. Ren, and N. X. Sun, Adv. Mater. 21, 1 (2009).\n\n24\n\n\f[32] A. B. Ustinov, V. S. Tiberkevich, G. Srinivasan, A. N. Slavin, A. A. Semenov, S. F. Karmanenko, B. A. Kalinikos, J. V. Mantese, and R. Ramer, J. Appl. Phys. 100, 093905 (2006).\n[33] J. Das, Y.-Y. Song, N. Mo, P. Krivosik, and C. E. Patton, Adv. Mater. 21, 2045 (2009).\n[34] V. E. Demidov, B. A. Kalinikos, and P. Edenhofer, J. Appl. Phys. 91, 10007 (2002).\n\n25\n\n\f"}