{"id": "http://arxiv.org/abs/0801.4811v3", "guidislink": true, "updated": "2008-12-03T14:17:18Z", "updated_parsed": [2008, 12, 3, 14, 17, 18, 2, 338, 0], "published": "2008-01-31T03:16:39Z", "published_parsed": [2008, 1, 31, 3, 16, 39, 3, 31, 0], "title": "Equidistribution of Dynamically Small Subvarieties over the Function\n  Field of a Curve", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0801.0106%2C0801.2475%2C0801.4400%2C0801.1789%2C0801.0727%2C0801.1618%2C0801.1075%2C0801.2694%2C0801.3877%2C0801.0906%2C0801.3140%2C0801.3365%2C0801.2595%2C0801.1304%2C0801.1729%2C0801.1856%2C0801.1015%2C0801.4822%2C0801.3719%2C0801.0315%2C0801.0474%2C0801.3134%2C0801.4113%2C0801.1523%2C0801.3324%2C0801.1383%2C0801.2640%2C0801.0530%2C0801.2973%2C0801.0318%2C0801.4811%2C0801.3701%2C0801.0346%2C0801.1866%2C0801.1291%2C0801.2919%2C0801.4062%2C0801.1719%2C0801.4213%2C0801.4786%2C0801.0696%2C0801.0817%2C0801.4425%2C0801.4725%2C0801.2420%2C0801.0650%2C0801.1686%2C0801.1046%2C0801.3115%2C0801.1763%2C0801.2424%2C0801.3892%2C0801.0058%2C0801.0584%2C0801.0189%2C0801.3587%2C0801.3541%2C0801.2193%2C0801.1683%2C0801.3901%2C0801.0510%2C0801.1876%2C0801.4504%2C0801.0329%2C0801.4669%2C0801.2031%2C0801.2132%2C0801.2405%2C0801.2077%2C0801.2372%2C0801.1738%2C0801.4561%2C0801.1632%2C0801.1501%2C0801.0214%2C0801.4394%2C0801.1766%2C0801.4465%2C0801.1252%2C0801.3629%2C0801.2531%2C0801.3567%2C0801.1035%2C0801.1339%2C0801.3199%2C0801.2241%2C0801.2993%2C0801.0490%2C0801.4365%2C0801.3669%2C0801.0306%2C0801.1486%2C0801.0660%2C0801.2832%2C0801.3936%2C0801.0204%2C0801.3318%2C0801.1828%2C0801.0635%2C0801.2072%2C0801.2367&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Equidistribution of Dynamically Small Subvarieties over the Function\n  Field of a Curve"}, "summary": "For a projective variety X defined over a field K, there is a special class\nof self-morphisms of X called algebraic dynamical systems. In this paper we\ntake K to be the function field of a smooth curve and prove that at each place\nof K, subvarieties of X of dynamically small height are equidistributed on the\nassociated Berkovich analytic space. We carefully develop all of the arithmetic\nintersection theory needed to state and prove this theorem, and we present\nseveral applications on the non-Zariski density of preperiodic points and of\npoints of small height in field extensions of bounded degree.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0801.0106%2C0801.2475%2C0801.4400%2C0801.1789%2C0801.0727%2C0801.1618%2C0801.1075%2C0801.2694%2C0801.3877%2C0801.0906%2C0801.3140%2C0801.3365%2C0801.2595%2C0801.1304%2C0801.1729%2C0801.1856%2C0801.1015%2C0801.4822%2C0801.3719%2C0801.0315%2C0801.0474%2C0801.3134%2C0801.4113%2C0801.1523%2C0801.3324%2C0801.1383%2C0801.2640%2C0801.0530%2C0801.2973%2C0801.0318%2C0801.4811%2C0801.3701%2C0801.0346%2C0801.1866%2C0801.1291%2C0801.2919%2C0801.4062%2C0801.1719%2C0801.4213%2C0801.4786%2C0801.0696%2C0801.0817%2C0801.4425%2C0801.4725%2C0801.2420%2C0801.0650%2C0801.1686%2C0801.1046%2C0801.3115%2C0801.1763%2C0801.2424%2C0801.3892%2C0801.0058%2C0801.0584%2C0801.0189%2C0801.3587%2C0801.3541%2C0801.2193%2C0801.1683%2C0801.3901%2C0801.0510%2C0801.1876%2C0801.4504%2C0801.0329%2C0801.4669%2C0801.2031%2C0801.2132%2C0801.2405%2C0801.2077%2C0801.2372%2C0801.1738%2C0801.4561%2C0801.1632%2C0801.1501%2C0801.0214%2C0801.4394%2C0801.1766%2C0801.4465%2C0801.1252%2C0801.3629%2C0801.2531%2C0801.3567%2C0801.1035%2C0801.1339%2C0801.3199%2C0801.2241%2C0801.2993%2C0801.0490%2C0801.4365%2C0801.3669%2C0801.0306%2C0801.1486%2C0801.0660%2C0801.2832%2C0801.3936%2C0801.0204%2C0801.3318%2C0801.1828%2C0801.0635%2C0801.2072%2C0801.2367&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "For a projective variety X defined over a field K, there is a special class\nof self-morphisms of X called algebraic dynamical systems. In this paper we\ntake K to be the function field of a smooth curve and prove that at each place\nof K, subvarieties of X of dynamically small height are equidistributed on the\nassociated Berkovich analytic space. We carefully develop all of the arithmetic\nintersection theory needed to state and prove this theorem, and we present\nseveral applications on the non-Zariski density of preperiodic points and of\npoints of small height in field extensions of bounded degree."}, "authors": ["X. W. C. Faber"], "author_detail": {"name": "X. W. C. Faber"}, "author": "X. W. C. Faber", "links": [{"title": "doi", "href": "http://dx.doi.org/10.4064/aa137-4-4", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0801.4811v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0801.4811v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "v2: Various typos fixed; statement and proof of auxiliary Prop. 6.1\n  corrected. During the process of preparing this manuscript for submission, it\n  came to the author's attention that Walter Gubler has recently proved many of\n  the same results. See arXiv:0801.4508v3. v3: References updated and a few\n  more typos corrected. To appear in Acta Arithmetica", "arxiv_primary_category": {"term": "math.NT", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.NT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.DS", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "14G40; 11G35", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0801.4811v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0801.4811v3", "journal_reference": null, "doi": "10.4064/aa137-4-4", "fulltext": "EQUIDISTRIBUTION OF DYNAMICALLY SMALL SUBVARIETIES\nOVER THE FUNCTION FIELD OF A CURVE\n\narXiv:0801.4811v3 [math.NT] 3 Dec 2008\n\nX.W.C. FABER\nAbstract. For a projective variety X defined over a field K, there is a special class of\nmorphisms φ : X → X called algebraic dynamical systems. In this paper we take K to\nbe the function field of a smooth curve and prove that at each place v of K, subvarieties\nof dynamically small height are equidistributed on the associated Berkovich analytic space\nXvan . We carefully develop all of the arithmetic intersection theory needed to state and prove\nthis theorem, and we present several applications on the non-Zariski density of preperiodic\npoints and of points of small height in field extensions of bounded degree.\n\nContents\n1. Introduction\n2. Arithmetic Intersection Theory over Function Fields\n2.1. Notation and Terminology\n2.2. Arithmetic Intersection Numbers\n2.3. Model Functions\n2.4. Associated Measures\n2.5. Global Height Functions\n3. Algebraic Dynamical Systems\n3.1. Invariant Metrics\n3.2. Dynamical Heights\n3.3. The Invariant Measure μφ,v\n4. Proof of the Equidistribution Theorem\n5. Corollaries of the Equidistribution Theorem\n6. Appendix\nReferences\n\n2\n4\n5\n8\n18\n22\n26\n28\n28\n31\n33\n34\n37\n40\n41\n\n2000 Mathematics Subject Classification. 14G40 (primary); 11G35 (secondary).\nKey words and phrases. Arithmetic Dynamics, Equidistribution, Arakelov Theory, Function Fields, Preperiodic Points, Small Points.\n1\n\n\f1. Introduction\nA typical arithmetic equidistribution theorem says something like the following: if X is an\nalgebraic variety over a global field K that possesses an arithmetic height function h, then\nfor each place v of K there exists an analytic space Xvan and a measure μv supported on it\nso that the Galois orbits of any suitably generic sequence of algebraic points with heights\ntending to zero become equidistributed with respect to μv . The primary goal of this article\nis to prove such a theorem when K is the function field of a smooth curve and h and μv\nare intimately connected with the dynamics of a polarized endomorphism of X. Arithmetic\nequidistribution theorems of this type abound in the literature of the last decade, beginning\nwith the pioneering work of Szpiro/Ullmo/Zhang [SUZ97]. For a nice survey, see the recent\ntext by Silverman [Sil07, Chapter 3.10].\nA (polarized algebraic) dynamical system (X, φ, L) defined over a field K consists of a\nprojective variety X/K, an endomorphism φ of X, and an ample line bundle L on X such\nthat φ∗ L ∼\n= Lq for some integer q ≥ 2. The line bundle L is often referred to as a polarization\nof the dynamical system. A preperiodic point x ∈ X is a closed point such that the forward\norbit {φn (x) : n = 1, 2, . . .} is finite. In studying the arithmetic of algebraic dynamical\nsystems, one might ask if, for example, the set of K-rational preperiodic points is Zariski\ndense in X. We present a criterion in §5 for non-Zariski density as a corollary to the main\nequidistribution theorem of this paper.\nPerhaps the most well-known example of an algebraic dynamical system is (A, [2], L),\nwhere A is an abelian variety over K, [2] is the multiplication by 2 morphism, and L is\na symmetric ample line bundle on A (i.e., [−1]∗ L ∼\n= L). In this case, torsion points of A\nare the same as preperiodic points for the morphism [2]. Another important example of a\ndynamical system is (PdK , φ, O(1)) for some finite endomorphism φ of PdK . If (z0 : * * * : zd )\nare homogeneous coordinates on projective space, then φ can be described more concretely\nby giving d + 1 homogeneous polynomials fi of degree q without a common zero over K and\nsetting φ = (f0 : * * * : fd ). This is in a sense a \"universal dynamical system\" because any\nother dynamical system can be embedded in one of this type. (See the paper of Fakhruddin\n[Fak03] for an explanation.)\nTo state a version of our theorem, we set the following notation. Let B be a proper\nsmooth geometrically connected curve over a field k. Let K = k(B) be the function field of\nB. The places of K - i.e. equivalence classes of non-trivial valuations on K that are trivial\non k - are in bijective correspondence with the closed points of B. For a place v, denote\nby Kv the completion of K with respect to v. The Berkovich analytification of the scheme\nXKv will be denoted by Xvan . It is a compact Hausdorff topological space with the same\nnumber of connected components as XKv . For any dynamical system (X, φ, L), there exists\n2\n\n\fa measure μφ,v on Xvan that is invariant under φ; it reflects the distribution of preperiodic\npoints for the morphism φ. Also, each closed point x of X breaks up into a finite set of\npoints Ov (x) in Xvan , and we can define local degrees degv (y) for each y ∈ Ov (x) such that\nP\nan\ny∈Ov (x) degv (y) = deg(x). To the set Ov (x), we can associate a probability measure on Xv\nby\nX\n1\ndegv (y)δy ,\ndeg(x)\ny∈Ov (x)\n\nThere also exists a dynamical height function hφ on closed points of X defined via intersection\ntheory, so that hφ (x) measures the \"arithmetic and dynamical complexity\" of the point x.\nFor example, hφ (x) = 0 if x is a preperiodic point for φ.\nTheorem 1.1. Let (X, φ, L) be an algebraic dynamical system over the function field K.\nSuppose {xn } is a sequence of closed points of X such that\n• No infinite subsequence of {xn } is contained in a proper closed subset of X, and\n• hφ (xn ) → 0 as n → ∞.\nThen for any place v of K, and for any continuous function f : Xvan → R, we have\nZ\nX\n1\nf dμφ,v .\ndegv (y)f (y) =\nlim\nn→∞ deg(xn )\nXvan\ny∈Ov (x)\n\nThat is, the sequence of measures\n\nn\n\n1\ndeg(xn )\n\nP\n\ny∈Ov (xn ) degv (y)δy\n\no\nn\n\nconverges weakly to μφ,v .\n\nTheorem 1.1 is a simplified form of Theorem 4.1, which is the main result of this paper.\nIn the latter result, we prove that generic nets of small subvarieties are equidistributed. See\nsection 4 for the statement. The proof follows the technique espoused in the work of Yuan\n[Yua08] using the \"classical\" version of Siu's Theorem from algebraic geometry.\nSeveral equidistribution theorems in the function field case already exist in the literature. The work of Baker/Hsia [BH05] and Baker/Rumely [BR06] deal with polynomial\nmaps and rational maps on the projective line, respectively. These papers approach equidistribution using nonarchimedean capacity and potential theory. Favre/Rivera-Letelier give a\nquantitative form of equidistribution for rational maps on the projective line, which should\napply to the function field case despite the fact that they state their results for number fields\n[FRL06, FRL07]. Petsche has proved a quantitative equidistribution result for points of small\nNéron-Tate height on elliptic curves using Fourier analysis [Pet07]. Gubler has approached\nequidistribution using arithmetic intersection techniques (following Szpiro/Ullmo/Zhang).\nHe gives an equidistribution result for abelian varieties that admit a place of totally degenerate reduction [Gub07]. He has recently and independently proved equidistribution results\nessentially equivalent to our Theorems 1.1 and 4.1 [Gub08]. The work of Petsche and Gubler\n3\n\n\fholds also over the function field of a smooth projective variety equipped with an ample\ndivisor class.\nIn section 2 we state and prove all of the tools of arithmetic intersection theory over\nfunction fields necessary for the task at hand. This will only require the use of intersection\ntheory of first chern classes in classical algebraic geometry and a small amount of formal and\nanalytic geometry. Our approach is novel in that it is developed from global rather than\nlocal intersection theory. The associated measures and height functions will be introduced\nin this section as well. Section 3 is devoted to recalling the construction of invariant metrics\nfor dynamical systems, the dynamical height hφ , and the associated invariant measure μφ,v .\nWe state and prove the main equidistribution theorem in section 4. Finally, in section 5 we\ndiscuss applications of the equidistribution theorem to the distribution of preperiodic points\nand to the Zariski density of dynamically small points. Section 6 contains several auxiliary\nresults whose proofs could not be located in the literature.\nAcknowledgments. I would like to express my gratitude to my advisor Shou-wu Zhang for\nexplaining the big ideas of arithmetic intersection theory to me, to Matt Baker for introducing\nme to algebraic dynamics, and to Xinyi Yuan for the many hours we've passed talking about\nArakelov theory. Thanks also go to Brian Conrad and Antoine Ducros for lending their\nexpertise on nonarchimedean geometry.\n2. Arithmetic Intersection Theory over Function Fields\nIn this section we collect some definitions and facts from intersection theory needed for\nthe calculation of heights and for the proof of the main theorem. The basic principle is that\nheights can be computed via (limits of) classical intersection numbers on models. Much has\nbeen written in the literature on the subject of local intersection theory. Bloch/Gillet/Soulé\nhave studied nonarchimedean local intersection theory by formally defining arithmetic Chow\ngroups using cycles on special fibers of models [BGS95]. Gubler carries out a very careful\nstudy of local intersection theory on special fibers of formal schemes in a more geometric\nfashion, and then he patches it together into a global theory of heights using his theory\nof M -fields [Gub97, Gub98, Gub03]. One can avoid most of the technical difficulties that\narise in these approaches by working almost exclusively with classical intersection theory\non models of an algebraic variety; this requires a lemma of Yuan to lift data from a local\nmodel to a global model (Lemma 2.7). The upshot is that this treatment uses only ideas\nfrom algebraic geometry and a small input from formal geometry, and it works for any field\nof constants k.\nMost of these ideas appear in the literature on adelic metrics and height theory. We have\nendeavored to give complete proofs when the literature does not provide one or when the\nknown proof for the number field case requires significant modification.\n4\n\n\f2.1. Notation and Terminology.\n2.1.1. When we speak of a variety, we will always mean an integral scheme, separated and of\nfinite type over a field. We do not require a variety to be geometrically integral. Throughout,\nwe fix a field of constants k and a proper smooth geometrically connected k-curve B. At no\npoint do we require that the constant field k be algebraically closed. Denote by K the field\nof rational functions on B.\n2.1.2. The field K admits a set of nontrivial normalized valuations that correspond bijectively to the closed points of B. The correspondence associates to a point v ∈ B the\nvaluation ordv on the local ring OB,v at v, which is a discrete valuation ring by smoothness.\nThe normalization of v is such that a uniformizer in OB,v has valuation 1. Extend ordv to\nK by additivity. Such a valuation will be called a place of K. We will often identify closed\npoints of B with places of K without comment unless further clarification is necessary.\nThe places of K satisfy a product formula. For a ∈ K, set |a|v = exp{− ordv (a)}. Then\nfor any a ∈ K × , we have\nY\n|a|[k(v):k]\n= 1,\nv\nv∈B\n\nwhere k(v) is the residue degree of the point v. This formula appears more frequently in its\nlogarithmic form, in which it asserts that a rational function has the same number of zeros\nas poles when counted with the appropriate weights:\nX\n[k(v) : k] ordv (a) = 0.\nv∈B\n\n2.1.3. Now let X be a projective variety over K. Given an open subvariety U ⊂ B, a\nU -model of X consists of the data of a k-variety X , a projective flat k-morphism X → U ,\n∼\nand a preferred K-isomorphism ι : X → XK . In most cases the morphism X → U and the\nisomorphism ι will be implicit, and we will use them to identify X with the generic fiber of\nX . If L is a line bundle on X, a U -model of the pair (X, L) is a pair (X , L ) such that X\nis a U -model of X and L is a line bundle on X equipped with a preferred isomorphism\n∼\nι∗ L |XK → L.1 then a U -model of the pair (X, L) Again, this isomorphism will often be\nimplicit. We may also say that L is a model of L. To avoid trivialities, if we speak of a\nU -model (X , L ) of a pair (X, Le ) without extra qualifier, we will implicitly assume that\ne ≥ 1.\nFor a line bundle L on a variety X /k with function field k(X ), a rational section of L\nis a global section of the sheaf L ⊗ k(X ). Equivalently, a rational section is a choice of a\nnonempty open set U ⊂ X and a section s ∈ L (U ).\n1As\n\nis customary, we will use the terms \"line bundle\" and \"invertible sheaf\" interchangeably, but we will\nalways work with them as sheaves.\n5\n\n\fAsking X to be projective guarantees the existence of B-models. For example, let L be a\nvery ample line bundle on X. Let X ,→ PnK ,→ PnB = Pn × B be an embedding induced by\nL followed by identifying PnK with the generic fiber of PnB , and define X to be the Zariski\nclosure of X in PnB with the reduced subscheme structure. Let L = OX (1). Then (X , L )\nis a B-model of (X, L). More generally, if M is any line bundle on X, then we can write\nM = M1 ⊗ M2∨ for some choice of very ample line bundles M1 and M2 . The procedure just\ndescribed gives a means of constructing B-models (Xi , Mi ) of (X, Mi ). By the Simultaneous\nModel Lemma (Lemma 2.2), there exists a single B-model X of X as well as line bundles\nMi0 on X such that (X , Mi0 ) is a B-model of (X, Mi ). Evidently (X , M10 ⊗ (M20 )∨ ) is a\nB-model of (X, M ).\n2.1.4. For each place v of K, we let Kv be the completion of K with respect to the valuation\nv. Let Kv◦ be the valuation ring of Kv .\nWe now briefly recall the relevant definitions from formal and analytic geometry. For full\nreferences on these topics, see [Ber90, §2, 3.4], [Ber94, §1] and [BL93]. For each place v\nof K, let Xvan be the Berkovich analytic space associated to the Kv -scheme XKv . It is a\ncompact Hausdorff topological space equipped with the structure of a locally ringed space.\nThe space Xvan is covered by compact subsets of the form M (A ), where A is a strictly\naffinoid Kv -algebra and M (A ) is its Berkovich spectrum. As a set, M (A ) consists of all\nbounded multiplicative seminorms on A . The definition of the analytic space Xvan includes\na natural surjective morphism of locally ringed spaces ψv : Xvan → XKv . If L is a line bundle\non X, there is a functorially associated line bundle Lv on Xvan defined by ψv∗ (L ⊗K Kv ).\nA continuous metric on Lv , denoted k * k, is a choice of a Kv -norm on each fiber of Lv that\nvaries continuously on Xvan . More precisely, suppose {(Ui , si )} is a trivialization of Lv where\n{Ui } is an open cover of Xvan and si is a generator of the OXvan (Ui )-module Lv (Ui ). Then\nthe metric k * k is defined by a collection of continuous functions ρi : Ui → R>0 satisfying an\nappropriate cocycle condition by the formula ks(x)k = |σ(x)|ρ(x), where s is any section of\nLv over Ui and σ is the regular function on Ui such that s = σsi . Here |σ(x)| denotes the\nvalue of the seminorm corresponding to the point x at the function σ.2 A formal metric k * k\non the line bundle Lv is one for which there exists a trivialization {(Ui , si )} so that metric\nis defined by ρi ≡ 1. Equivalently, for this trivialization we have ks(x)k = |σ(x)| with s and\nσ as above.\nTo an admissible formal Kv◦ -scheme Xv , one can associate in a functorial way its generic\nfiber Xv,η , which is an analytic space in the sense of Berkovich. For us, the most important\nexample will be when Xv is the formal completion of a proper flat Kv◦ -scheme with generic\n2\n\nSeveral authors (e.g., [BG06]) speak of bounded continuous metrics on L ⊗ Cv over XCv , where Cv is the\ncompletion of an algebraic closure of Kv . Bounded and continuous metrics in their context are equivalent\nto our notion of continuous metric by compactness of the Berkovich analytic space Xvan .\n6\n\n\f∼\n\nfiber X/Kv . In this setting, properness implies there is a canonical isomorphism Xv,η →\nXvan [Con99, Thm. A.3.1]. A formal line bundle Lv on Xv determines a formal metric on\nLv = Lv ⊗ Kv as follows. Let {(Ui , si )} be a formal trivialization of Lv . Then the generic\nfiber functor gives a trivialization of Lv , namely {(Ui,η , si )}. We set ρi ≡ 1. This definition\nworks (i.e., the functions ρi transform correctly) because the transition functions for the\ncover {(Ui,η , si )} all have supremum norm 1 [Gub98, §7].\nFor an open subscheme U ⊂ B, a U -model (X , L ) of the pair (X, Le ) determines a\ncv be the formal\nfamily of continuous metrics, one on Lv for each place v of U . Indeed, let X\ncv be the formal completion\ncompletion of the scheme XKv◦ along its closed fiber, and let L\ncv is flat over K ◦ , hence admissible. We denote by\nof L . As XKv◦ is Kv◦ -flat, we know that X\nv\n1/e\ncv ⊗ Kv ∼\nk * kL ,v the formal metric on L\n= Lev . A metric k * kL ,v on Lv can then be given by\n1/e\n\n1/e\n\ndefining k`kL ,v = k`⊗e kL ,v for any local section ` of Lv .\nThere is an important subtlety here that is worth mentioning. If (X , L ) is a B-model\nof (X, OX ) and v is a place of B, then we get a metric k * k = k * kL ,v on OXvan . However,\n∼\nn\nfor any positive integer n via the canonical isomorphism given by 1 7→ 1⊗n , and\nOX → OX\nn\n). The metric induced on OXvan by\nso we just as easily view (X , L ) as B-model of (X, OX\nthis B-model is given by k * k1/n .\n2.1.5. An adelic metrized line bundle L on X consists of the data of a line bundle L on X\nand for each place v ∈ B a continuous metric k * kv on the analytic line bundle Lv subject\nto the following adelic coherence condition: there exists an open subscheme U ⊂ B, and\na U -model (X , L ) of the pair (X, Le ) for some positive integer e such that at all places v\n1/e\nin U we have equality of the metrics k * kv = k * kL ,v . The adelic metrized line bundle L\nwill be called semipositive if there exists an open subscheme U ⊂ B, a sequence of positive\nintegers en and a sequence of B-models (Xn , Ln ) of the pairs (X, Len ) such that\n• Ln is relatively semipositive for all n: it has nonnegative degree on any curve in a\nclosed fiber of X ;3\n1/e\n• For each place v of U , we have equality of the metrics k * kv = k * kLn,vn for all n; and\n1/e\n\n• For each place v 6∈ U , the sequence of metrics k * kLn,vn converges uniformly to k * kv\non Xvan .\nThe distance between two metrics k * k1,v and k * k2,v on Lv is given by\nks(x)k1,v\n,\nx∈Xv\nks(x)k2,v\nwhere s is any local section of Lv that does not vanish at x. The quotient inside the\nlogarithm is independent of the choice of s and defines a non-vanishing continuous function\ndistv (k * k1,v , k * k2,v ) = max\nlog\nan\n\n3Modern\n\nalgebraic geometers would probably call this line bundle relatively nef, but we preserve the term\n\"relatively semipositive\" for historical reasons.\n7\n\n\fon the compact space Xvan . This implies the existence of the maximum. A sequence (k*kn,v )n\nof metrics on Lv is said to converge uniformly to the metric k * kv if distv (k * kn,v , k * kv ) → 0\nas n → ∞. By abuse of notation, in the definition of semipositive metrized line bundle we\nmay say that the B-models Ln converge uniformly to L.\n∨\n\nAn adelic metrized line bundle is called integrable if it is of the form L1 ⊗ L2 for two\nsemipositive metrized line bundles L1 and L2 . We denote by Pic(X) the group of integrable\nadelic metrized line bundles on X (under tensor product). Semipositive metrized line bundles\nform a semigroup inside Pic(X). (This follows from Lemma 2.2 and the fact that the tensor\nproduct of nef line bundles is nef.)\n2.2. Arithmetic Intersection Numbers. Given d + 1 integrable metrized line bundles\n\u0001\n\u0001\nL0 , . . . , Ld , we wish to define the arithmetic intersection number b\nc1 L0 * * * b\nc1 Ld . In the\npresent situation, this is accomplished by approximating the metrics on these line bundles\nusing B-models, performing an intersection calculation on the B-models, and then passing to a limit. This procedure appears in the work of Zhang for the number field setting\n[Zha95b], and we devote this section to proving it works very generally for function fields of\ntranscendence degree one.\nThose well acquainted with intersection products in Arakelov theory will find little surprising in Theorem 2.1 below and probably nothing new in its proof. However, the literature\non the subject appears only to contain these facts and their proofs in the case where K is a\nnumber field or when K is a function field over an algebraically closed field k [Gub07, §3].\nHere we have removed the hypothesis that k is algebraically closed, with the only consequence being that a residue degree appears in some of the formulas. The benefit is that the\nproofs are global and algebraic in nature rather than local and formal.\nFor a projective variety Y over a field k, we will almost always identify a zero cycle\nP\nP\nnP [P ] with its degree\nnP [k(P ) : k]. For a line bundle L on Y , we write c1 (L) to denote\nthe first Chern class valued in A1 (Y ), the group of codimension-1 cycles on Y . When Y\nhas dimension d, we will write degL1 ,...,Ld (Y ) or c1 (L1 ) * * * c1 (Ld ) instead of the more correct\nform deg (c1 (L1 ) * * * c1 (Ld ) * [Y ]). Similarly, we may write degL (Y ) for c1 (L)d .\nTheorem 2.1. Let X be a projective variety of dimension d over the function field K. There\n\u0001\n\u0001\nexists a pairing b\nc1 L0 * * * b\nc1 Ld on Pic(X)d+1 satisfying the following properties:\n(i) Let X be a B-model of X and let L0 , . . . , Ld models on X of the line bundles\nLe00 , . . . , Ledd for some positive integers e0 , . . . , ed . If L0 , . . . , Ld are the associated\nadelic metrized line bundles with underlying algebraic bundles L0 , . . . , Ld , then\n\u0001\n\u0001 c1 (L0 ) * * * c1 (Ld )\nc1 L d =\nb\nc1 L 0 * * * b\n.\ne0 * * * ed\n8\n\n\f0\n\n(ii) Let L1 , . . . , Ld be semipositive metrized line bundles and take L0 and L0 to be two\nintegrable metrized lined bundles with the same underlying algebraic bundle L0 . The\n0\nmetrics of L0 and L0 agree at almost all places, and if k * k0,v and k * k00,v are the\ncorresponding metrics at the place v, then\n\u0012\n\u0010 0 \u0011∨ \u0013\n\u0001\n\u0001\nb\nc1 L0 ⊗ L0\nb\nc1 L 1 * * * b\nc1 Ld\n≤ degL1 ,...,Ld (X)\n\nX\n\n\u0001\n[k(v) : k] distv k * k0,v , k * k00,v .\n\nv∈B\n\n\u0001\n\n\u0001\n\n(iii) b\nc1 L0 * * * b\nc1 Ld is symmetric and multilinear in L0 , . . . , Ld .\n(iv) Let Y be a projective variety over K, and suppose φ : Y → X is a generically finite\nsurjective morphism. Then\n\u0001\n\u0001\n\u0001\n\u0001\nc1 φ∗ Ld = deg(φ) b\nc1 L 0 * * * b\nc1 Ld .\nb\nc1 φ∗ L0 * * * b\nMoreover, the pairing on Pic(X)d+1 is uniquely defined by properties (i) and (ii).\nThe proof of this theorem will occupy the remainder of section 2.2.\n2.2.1. Preliminary Lemmas. In order to define the pairing and show it is well-defined, we\nneed a number of preliminary facts. The following result allows one to take metrics induced\nfrom line bundles on several different models of X and consolidate the data on a single\nB-model of X.\nLemma 2.2 (Simultaneous Model Lemma). Let (X1 , L1 ), . . . , (Xn , Ln ) be B-models of the\npairs (X, L1 ), . . . , (X, Ln ), respectively. Then there exists a single B-model X along with Bmorphisms pri : X → Xi that restrict to isomorphisms on the generic fiber. For each i, the\nline bundle Li0 = pr∗i Li is a model of Li such that for each place v of K, the corresponding\nmetrics on Li,v satisfy k * kLi,v = k * kLi0 ,v . If Li is nef on Xi , then Li0 is nef on X .\nProof. Suppose that n = 2; the general case is only notationally more difficult. Consider the\nfollowing commutative diagram:\nX KK\nKK\nKK∆\nKK\nKK\n%\nX1 ×B X2\n%\n\n\u000f\n\npr2\n\n/\n\n%\n\npr1\n\nX2\n\nX1\n\n/\n\n\u000f\n\nB\n\nThe maps Xi → B are the structure morphisms. The map ∆ is the diagonal embedding of\nX in the generic fiber of X1 ×B X2 , which is just X ×K X, and the square is the fiber product.\nLet X be the Zariski closure of ∆(X) in X1 ×B X2 with the reduced subscheme structure;\n9\n\n\fit is a B-model of X via the diagonal map as preferred isomorphism on the generic fiber.\nWhen restricted to ∆(X), the two projections pri are isomorphisms, and so they induce\nisomorphisms between the generic fibers of X and Xi . Define Li0 = pr∗i Li |X .\nThe metrics on a line bundle L 0 are unchanged by pullback through a B-morphism\nX → X 0 that restricts to an isomorphism on the generic fiber. Indeed, completing at the\nclosed fiber over v gives a morphism of admissible formal Kv◦ -schemes f : X → X0 . Over\nopen sets Spf A 0 ⊂ X0 and Spf A ⊂ f −1 (Spf A 0 ) ⊂ X where the line bundles L0 and f ∗ L0\nare trivial, flatness of these algebras over Kv◦ implies that we have a commutative diagram\nof inclusions:\nA0\n\n/\n\nα\n\n\u000f\n\n/\n\nA 0 ⊗Kv◦ Kv\n\nA\n\u000f\n\nA ⊗Kv◦ Kv\n\nOver these open sets, the formal metrics on L0 and on f ∗ L0 are given at x by evaluation\n[Gub98, Lemma 7.4]; i.e., for any local section s of L0 defined near x corresponding to an\nelement σ ∈ A 0 , we have\nkf ∗ (s)(x)kf ∗ L0 = |α(σ)(x)| = |σ(x)| = ks(x)kL0 ,\nwhere the middle equality follows because f is an isomorphism on the generic fiber.\nThe final claim of the lemma is simply the fact that the pullback of a nef line bundle is\nnef (which follows from the projection formula for classical intersection products).\n\u0003\nNext we show that intersection numbers vary nicely in fibers over the base curve B. This\nis well-known for fibers over the closed points of B (cf. [Ful98, §10.2], \"Conservation of\nNumber\"), but we are also interested in comparing with the generic fiber.\nLemma 2.3. Let X be a projective variety over K of dimension d, L1 , . . . , Ld line bundles\non X, π : X → B a B-model of X, and L1 , . . . , Ld models of L1 , . . . , Ld on X . Then for\nany closed point v ∈ B, we have the equality\n[k(v) : k] degL1 ,...,Ld (X) = c1 (L1 ) * * * c1 (Ld ) * [Xv ],\nwhere Xv is the (scheme-theoretic) fiber over v.\nProof. As B is regular, we may speak of its Cartier and Weil divisors interchangeably. Note\nthat [Xv ] is the cycle associated to the Cartier divisor π ∗ [v]. Indeed, each is cut out on X\nby the image of a local equation for the point v under the map OB → OX .\n10\n\n\fNow we proceed by induction on d = dim X. If d = 0, then X = Spec F corresponds to a\nfinite extension of fields F/K. Also, π : X → B is a proper surjection of curves. Whence\ndeg([Xv ]) = deg(π ∗ [v]) = deg(π∗ π ∗ [v])\n= [k(X ) : k(B)] deg([v])\n\nby the projection formula\n\n= [F : K][k(v) : k],\nwhich is exactly what we want.\nNext assume the result holds for all K-varieties of dimension at most d − 1, and let\ndim X = d. Let sd be a rational section of Ld . Write [div(sd )] = Dh + Df , where Dh is\nhorizontal and Df is vertical on X . Then Df * [Xv ] = Df * [π ∗ [v]] = 0 in the Chow group\nbecause we may use linear equivalence on B to push π ∗ [v] away from the support of Df . In\nthe next computation, we use the letter Y to denote an arbitrary horizontal prime divisor\non X , and we set Y = YK , the generic fiber of Y . This gives a bijective correspondence\nbetween horizontal prime divisors on X and prime divisors on X. Moreover OX,Y = OX ,Y\nfor any such prime divisor, and codim(Y, X) = codim(Y , X ). Now we compute:\nc1 (L1 ) * * * c1 (Ld ) * [Xv ] = c1 (L1 ) * * * c1 (Ld−1 ) * [π ∗ [v]] * [div(sd )]\n= c1 (L1 ) * * * c1 (Ld−1 ) * [π ∗ [v]] * Dh\nX\n=\nordY (sd )c1 (L1 |Y ) * * * c1 (Ld−1 |Y ) * [π ∗ [v]|Y ]\nY ⊆supp(Dh )\ncodim(Y ,X )=1\n\n= [k(v) : k]\n\nX\n\nordY (sd |X ) degL1 |Y ,...,Ld−1 |Y (Y )\n\nY ⊆supp(Dh ∩X)\ncodim(Y,X)=1\n\n= [k(v) : k]c1 (L1 ) * * * c1 (Ld−1 ) * [div(sd |X )]\n= [k(v) : k] degL1 ,...,Ld (X).\nIn the third to last equality we applied the induction hypothesis. This completes the proof.\n\u0003\nThe next lemma allows us to see what happens to metrics after pullback through a morphism of B-models.\nLemma 2.4. Let φ : Y → X be a morphism of projective K-varieties. Let L be a line\nbundle on X and (X , L ) a B-model of the pair (X, L).\n(i) There exists a B-model Y of Y and a B-morphism φ\ne : Y → X such that φ\neK = φ.\n∗\n(ii) For any B-morphism φ\ne as in (i), the pair (Y , φ\ne L ) is a B-model of the pair\n∗\n(Y, φ L), and for each v we have the equality of metrics φ∗ k * kL ,v = k * kφe∗ L ,v .\nProof. Let Y0 be any B-model of Y . Define jX : X ,→ X to be the inclusion of the generic\n∼\nfiber (always implicitly precomposed with the preferred isomorphism ι : X → XK ), and\n11\n\n\fsimilarly for jY : Y ,→ Y0 . Let Γφ : Y → Y ×K X be the graph morphism. Consider the\ncommutative diagram\njX ◦φ\nY JJ\nJJ Γ\nJJeφ\nJJ\nJJ\n$\nY0 ×B X\njY\n\n%\n\n\u000f\n\npr2\n\n/\n\n$\n\npr1\n\nX\n\nY0\n\n/\n\n\u000f\n\nB\n\neφ = (jY × jX ) ◦ Γφ . Define Y to be the Zariski closure of Γ\neφ (Y ) in Y0 ×B X with the\nwhere Γ\nreduced subscheme structure, and give it the obvious structure as a flat proper B-scheme.\nLet φ\ne = pr2 |Y . The graph morphism Γφ gives the preferred isomorphism between Y and\nthe generic fiber of Y . With this identification, it is evident that φ\neK = φ.\nFor any φ\ne : Y → X such that φ\neK = φ, we find that (Y , φ\ne∗ L ) is a B-model of (Y, φ∗ L)\nbecause passage to the generic fiber commutes with pullback of line bundles.\nThe final statement of the lemma is a consequence of the compatibility of the generic\ncv → Y\ncv\nfiber functor for admissible formal schemes and the pullback morphism. Let φ\nbv : X\nbe the morphism induced between the formal completions of X and Y , respectively, along\ncv be the formal completion of L . The metric k * kL ,v is\ntheir closed fibers over v, and let L\ncv and a collection of functions ρi : Ui,η →\ndetermined by a formal trivialization {(Ui , si )} of L\nR>0 . (Recall that Ui,η is the generic fiber of Ui , and that {Ui,η } is a cover of Xvan .) If φan\nv :\nan −1\nan\nan\nYv → Xv is the induced morphism between analytic spaces, we find that (φv ) (Ui,η ) =\nφ\nb−1\nv (Ui )η ; i.e., pullback commutes with formation of the generic fiber. Therefore both metrics\n−1\nan ∗\nφ∗ k * kL ,v and k * kφe∗ L ,v are given by the cover {((φan\nv ) (Ui,η ), (φv ) (si ))} and the functions\nan −1\nρi ◦ φan\n\u0003\nv : (φv ) (Ui,η ) → R>0 .\nNext we prove an estimate that indicates the dependence of intersection numbers for line\nbundles on the metrics induced by them. In the course of the proof we shall need to relate\nspecial values of the metric on a section of the model to the orders of vanishing of the section.\nWe recall now how this works. Let (X , L ) be a B-model of (X, OX ) with X normal, and\nlet s be a rational section of L that restricts to the section 1 on the generic fiber. Write\nP P\n[div(s)] = v j ordWv,j (s) [Wv,j ], where {Wv,j }j are the distinct irreducible components of\nP\nthe fiber Xv over the point v. Let us also write [Xv ] = j m(v, j)[Wv,j ] for some positive\nintegers m(v, j).\nThere exists a surjective reduction map r : Xvan → Xv , and for each component Wv,j ,\nthere is a unique point ξv,j ∈ Xvan mapping to the generic point of Wv,j . See [Ber94, §1] for\nthe construction of the reduction map and an argument that shows its image is closed. We\nwill now give an argument to conclude that its image contains the generic points of Xv .\n12\n\n\fThe fiber Xv is unchanged if we replace X by X ×B Spec OB,v . Let ηv,j be the generic\npoint of Wv,j , and let Spec A be an affine open subscheme containing ηv,j . Set Â to be the\nmv -adic completion of A, where mv is the maximal ideal of OB,v , and set A = Â ⊗Kv◦ Kv to\nbe the corresponding strict Kv -affinoid algebra. Define a multiplicative seminorm on A by\n(\n\u0001\nexp − ordWv,j (a)/m(v, j) , a 6= 0\n|a| =\n0,\na = 0.\nExtending | * | to Â by continuity and then to A by taking fractions gives a bounded\nmultiplicative Kv -seminorm on A ; it corresponds to a point ξv,j ∈ M (A ) ⊂ Xvan such that\nr(ξv,j ) = ηv,j . Uniqueness follows from the fact that any x ∈ r−1 (ηv,j ) induces a valuation on\nFrac(A) whose valuation ring dominates OX ,ηv,j . But by normality, the two valuation rings\nmust coincide, and hence x = ξv,j .\nFinally note that if the rational section s of L corresponds to a rational function σ ∈\nFrac(A), then the definitions immediately imply that\n− log k1(ξv,j )kL ,v = − log |σ(ξv,j )| =\n\nordWv,j (s)\n.\nm(v, j)\n\n(1)\n\nCompare with [CL06, 2.3].\nLemma 2.5. Let X be a B-model of X, and suppose L1 , . . . , Ld on X are relatively\nsemipositive models of line bundles L1 , . . . , Ld on X. Let L0 be another line bundle on X\nand L0 and L00 two models of L0 . Then the metrics on L0 induced by L0 and L00 differ at\nonly finitely many places v, and we have\n\u0010\n\u0011\nX\n0\n|c1 (L0 ⊗ (L00 )∨ ) c1 (L1 ) * * * c1 (Ld )| ≤ degL1 ,...,Ld (X)\n[k(v) : k] distv k * kL0,v , k * kL0,v\n.\nv∈B\n\nProof. First note that since L0 and L00 restrict to the same line bundle on the generic fiber,\nthey must be isomorphic over some nonempty open subset U ⊂ B. The places corresponding\nto points of B \\ U are finite in number, and these are the only places at which the metrics\nof L0 and L00 can differ.\nf → X be the normalizaWe may reduce to the case that X is normal. Indeed, let φ\ne:X\nf with the structure of B-scheme via composition of φ\ntion morphism. Endow X\ne with the\nstructure morphism for X . Define φ = φ\neK . Then φ and φ\ne have degree 1, so the projection\nformula for classical intersection products shows that intersection numbers in the above inf and (X\nf)K . To see that the distance between the\nequality are unaffected by pullback to X\nmetrics is unaffected, we note that by Lemma 2.4, k * kφe∗ L ,v = φ∗ k * kL ,v for any line bundle\nfan → X an is surjective, we find\nL on X . Since the morphism φan : X\nKv\nKv\n\u0001\n\u0001\ndistv φ∗ k * kL0 ,v , φ∗ k * kL00 ,v = distv k * kL0 ,v , k * kL00 ,v .\n13\n\n\ff, (X\nf)K , and φ\nThus we may replace X , X, and Li by X\ne∗ Li , respectively. Note that φ\ne∗ Li\nis relatively semipositive by the projection formula.\nFinally, it suffices to prove that if L0 is any model of the trivial bundle on X, then\n\u001b\n\u001a\nX\n[k(v) : k] max\n− log k1(x)kL0,v .\n|c1 (L0 ) * * * c1 (Ld )| ≤ degL1 ,...,Ld (X)\nan\nx∈Xv\n\nv\n\nLet s be a rational section of L0 that restricts to the section 1 on the generic fiber. Write\nP P\nP\n[div(s)] =\nv\nj ordWv,j (s)Wv,j and [Xv ] =\nj m(v, j)Wv,j as in the remarks preceding\nthis lemma. The function x 7→ − log k1(x)kL0,v must assume its maximum value at one of\nthe ξv,j [Ber90, 2.4.4]. Using (1), we have\nXX\n|c1 (L0 ) * * * c1 (Ld )| ≤\n| ordWv,j (s)| |c1 (L1 ) * * * c1 (Ld ) * [Wv,j ]|\nv\n\n=\n\nv\n\n≤\n\nj\n\nXX\nX\u001a\nv\n\n− log k1(ξv,j )kL0,v m(v, j) c1 (L1 ) * * * c1 (Ld ) * [Wv,j ]\n\nj\n\n\u001b\nmax − log k1(x)kL0,v\n\nx∈Xvan\n\nc1 (L1 ) * * * c1 (Ld ) * [Xv ].\n\nIn the second inequality we dropped the absolute values on the intersection with Wv,j by\nusing the relative semipositivity of the line bundles L1 , . . . , Ld . The result now follows\nimmediately from Lemma 2.3.\n\u0003\n2.2.2. Existence of the Intersection Pairing. Now we define the intersection pairing. We will\nproceed in several steps. Unless stated otherwise, we let X be a projective variety over\nK, and L0 , . . . , Ld will be adelic metrized line bundles on X. The idea is to take property (i) of Theorem 2.1 as the definition when the metrics are induced by models, and then\nto use Lemma 2.5 to control the intersection number when passing to limits of model metrics.\nStep 1 (Metrics induced by relatively semipositive models) Suppose (Xi , Li ) is a B-model\nof (X, Lei i ) that induces the given metric on Li , and suppose further that each Li is relatively\nsemipositive. Using the Simultaneous Model Lemma (Lemma 2.2), we obtain a single Bmodel X and models of the Lei i that induce the given metric on Li . We abuse notation and\ndenote these models on X by Li . Then we define\n\u0001\n\u0001 c1 (L0 ) * * * c1 (Ld )\nb\nc1 L 0 * * * b\nc1 L d =\n.\ne0 * * * ed\nTo see that this is well-defined, it suffices to take X 0 to be another B-model of X and Li0\ne0\nto be models of Li i that also induce the given metrics. (Note that the exponents e0i need\nnot equal the ei .) In order to prove that this data gives the same intersection number, it is\n14\n\n\fenough to prove that\n\u0010 0\u0011\n\u0010 0\u0011\ne\ne\nc1 ((L00 )e0 ) * * * c1 ((Ld0 )ed ) = c1 L0 0 * * * c1 Ld d .\nBy another application of the Simultaneous Model Lemma, we can find a single B-model\nY of X, birational morphisms pr : Y → X and pr0 : Y → X 0 that are isomorphisms on\ne e0\ne0\ngeneric fibers over B, and models Mi = pr∗ Li i and Mi0 = pr0∗ (Li0 )ei of Li i i that induce\nthe given metrics on Li . By the projection formula, we are reduced to showing\nc1 (M0 ) * * * c1 (Md ) = c1 (M00 ) * * * c1 (Md0 ) .\n\n(2)\n\nObserve that Mi and Mi0 may be different line bundles on Y , but they are models of the\nsame line bundle on X and they induce the same metrics on it.\nProving (2) uses a telescoping sum argument. To set it up, note that since the metrics on\nLi induced by Mi and Mi0 agree, Lemma 2.5 shows that\n\u0001\n0\nc1 (M0 ) * * * c1 (Mi−1 ) c1 (Mi ⊗ (Mi0 )∨ ) c1 Mi+1\n* * * c1 (Md0 ) = 0.\nTherefore\n|c1 (M0 ) * * * c1 (Md ) − c1 (M00 ) * * * c1 (Md0 ) |\n=\n\nd\nX\n\n\u0001\n0\nc1 (M0 ) * * * c1 (Mi−1 ) c1 (Mi ⊗ (Mi0 )∨ ) c1 Mi+1\n* * * c1 (Md0 )\n\ni=0\n\n≤\n\nd\nX\n\n\u0001\n0\n|c1 (M0 ) * * * c1 (Mi−1 ) c1 (Mi ⊗ (Mi0 )∨ ) c1 Mi+1\n* * * c1 (Md0 ) | = 0.\n\ni=0\n\nThis completes the first step.\nStep 2 (Arbitrary semipositive metrized line bundles) Let L0 , . . . , Ld be semipositive metrized\nline bundles on X with underlying algebraic bundles L0 , . . . , Ld , respectively. For each place\nv, denote the metric on Li,v by k * ki,v . By definition, there exists a sequence of B-models\ne\n(Xi,m , Li,m ) of the pairs (X, Li i,m ) such that\n• Li,m is relatively semipositive on Xi,m for every i, m;\n• There exists an open set U ⊂ B such that for place v ∈ U , each index i and all m,\n1/ei,m\nwe have k * kLi,m\n,v = k * ki,v .\n1/e\n\ni,m\n• For each place v 6∈ U and each i, the sequence of metrics k * kLi,m\n,v converges\nuniformly to k * ki,v .\n\nDefine Li,m to be the semipositive metrized line bundle having algebraic bundle Li and the\nmetrics induced by Li,m . Now we define the arithmetic intersection number to be\n\u0001\n\u0001\n\u0001\n\u0001\nb\nc1 L0 * * * b\nc1 Ld =\nlim\nb\nc1 L0,m0 * * * b\nc1 Ld,md .\n(3)\nm0 ,...,md →∞\n\n15\n\n\fEach of the intersection numbers on the right is well-defined by Step 1, so we have to show\nthat the limit exists and that it is independent of the sequence of models.\nTo prove that the limit in (3) exists, we take (m0 , . . . , md ) and (m00 , . . . , m0d ) to be two\nei,m0\nei,m\n(d + 1)-tuples of positive integers and set Li = Li,mi i , Li0 = Li,m0 i , and ei = ei,mi ei,m0i .\ni\nThen on the generic fibers, we have\nei,m0\n\nei,m\n\nLi |X = Li,mi i |X = Lei i\n\nLi0 |X = Li,m0 i |X = Lei i .\ni\n\nLi0\n\nFurther, we may assume that for each i, Li and\nare line bundles on a single B-model\nX (Simultaneous Model Lemma). Then our definition of the intersection pairing in Step 1\ngives\n\u0001\n\u0001\n\u0001\n\u0001\nc1 L0,m00 * * * b\nc1 Ld,m0d\nc1 Ld,md − b\nb\nc1 L0,m0 * * *b\n\u0001\n\u0001\nc1 (L0,m0 ) * * * c1 (Ld,md ) c1 L0,m00 * * * c1 Ld,m0d\n=\n−\n(4)\ne0,m0 * * * ed,md\ne0,m00 * * * ed,m0d\n=\n\nc1 (L0 ) * * * c1 (Ld ) − c1 (L00 ) * * * c1 (Ld0 )\n.\ne0 * * * ed\n1/e\n\n1/e\n\nNow fix ε > 0. For all places v ∈ U , we have k * kLi ,vi = k * kL 0 ,vi = k * ki,v . For v 6∈ U and\ni\nmi , m0i sufficiently large, uniform convergence gives\n\u0011\n\u0010\n1/e\n1/e\ndistv k * kLi,vi , k * kL 0 i < ε.\ni,v\n\nJust as in Step 1, we use a telescoping argument and apply Lemma 2.5:\n|c1 (L0 ) * * * c1 (Ld ) − c1 (L00 ) * * * c1 (Ld0 ) |\n=\n\nd\nX\n\n\u0001\n0\nc1 (L0 ) * * * c1 (Li−1 ) c1 (Li ⊗ (Li0 )∨ ) c1 Li+1\n* * * c1 (Ld0 )\n\ni=0\n\n≤\n\nd\nX\n\n\u0001\n0\nc1 (L0 ) * * * c1 (Li−1 ) c1 (Li ⊗ (Li0 )∨ ) c1 Li+1\n* * * c1 (Ld0 )\n\ni=0\n\n≤\n\nd\nX\n\ndegLe0 ,...,Ld\ne (X)\nei\n,...,L d\n0\n\ni=0\n\n<ε\n\nd\nY\ni=0\n\ni\n\nd\n\nX\n\n[k(v) : k] distv k * kLi ,v , k * kLi0 ,v\n\nei\n\n\u0001\n\nv\n\n!\nX\n\n(5)\n\ndegL0 ,...,Lci ,...,Ld (X)\n\ni\n\n!\nX\n\n[k(v) : k] .\n\nv6∈U\n\n\u0001\n\u0001\nCombining (4) and (5) shows that the sequence {b\nc1 L0,m0 * * * b\nc1 Ld,md } is Cauchy, which\nis tantamount to showing the the limit in (3) exists.\nTo see that the limit in (3) is independent of the sequence of models chosen, for each i we\n0\n0\nlet {(Xi,m\n, Li,m\n)} be another sequence of models with associated metrics converging to the\ngiven ones on Li . Then we obtain a third sequence\n\b\n\b\n00\n00\n0\n0\n0\n0\n(Xi,m\n, Li,m\n) = (Xi,1 , Li,1 ), (Xi,1\n, Li,1\n), (Xi,2 , Li,2 ), (Xi,2\n, Li,2\n), . . . .\n16\n\n\fThis sequence also induces metrics converging uniformly to Li , so by our above work we\nknow that the limit in (3) exists for this sequence. Therefore the limits over odd and even\nterms must agree, which is precisely what we wanted to prove.\nNote that the symmetry and multilinearity of the pairing are guaranteed immediately by\nvirtue of the same properties for the classical intersection pairing.\nStep 3 (Integrable metrized line bundles) Now we extend the pairing by linearity since any\n0\n00\n0\n00\nintegrable metrized line bundle L can be written L = L ⊗(L )∨ with L and L semipositive.\nAs there may be multiple ways of decomposing L as a difference of semipositive metrized\nline bundles, a question of uniqueness arises. This is easily settled however using Lemma 2.5\nand we illustrate it only in the simplest case to avoid unnecessary notation.\nLet L1 , . . . , Ld be semipositive metrized line bundles and let L be an integrable metrized\n0\n00\nline bundle with a decomposition L = L ⊗ (L )∨ as above. Then\n\u0010 0\u0011\n\u0010 00 \u0011\n\u0001\n\u0001\n\u0001\n\u0001\n\u0001\n\u0001\n\u0001\nc1 L 1 * * * b\nc1 L 1 * * * b\nc1 L 1 * * * b\nb\nc1 L b\nc1 L d = b\nc1 L b\nc1 L d − b\nc1 L b\nc1 Ld .\n(6)\n0\n\n00\n\nIf L has a second decomposition M ⊗ (M )∨ as a difference of semipositive metrized line\n0\n00\n00\n0\nbundles, it follows that L ⊗ M = L ⊗ M . Each side of this last equality is semipositive\nwith the same underlying algebraic bundle and the same metrics, and so it follows from\nLemma 2.5 that\n\u0011\n\u0011\n\u0010 0\n\u0010 00\n\u0001\n\u0001\n\u0001\n\u0001\n00\n0\nc1 L 1 * * * b\nc1 L1 * * * b\nb\nc1 L ⊗ M b\nc1 L d = b\nc1 L ⊗ M b\nc1 Ld .\nSplitting each side into two terms using linearity and rearranging shows that the expression\nin (6) is indeed well-defined.\n2.2.3. Proof of Theorem 2.1. In the previous section we constructed an intersection pairing\non Pic(X)d+1 , and it is straight forward to check that the construction gives properties (i)-(iii)\nby using the symmetry and multilinearity of the classical intersection product, Lemma 2.5,\nand a limiting argument. Conversely, since we used (i) as our definition, and since the\nbehavior under limits is governed by (ii), our construction gives the only intersection product\nsatisfying these two properties.\nTherefore, it only remains to prove property (iv). Intuitively, the idea is that if Y and X\nare B-models of Y and X, respectively, then the morphism φ : Y → X extends to a rational\nmap φ\ne : Y 99K X that is generically finite and has degree equal to the degree of φ.\nBy linearity, it suffices to prove (iv) when L0 , . . . , Ld are semipositive metrized line bundles.\nLet us also assume for the moment that the metrics are induced by relatively semipositive\nmodels Li of Lei i . As per usual, we may use the Simultaneous Model Lemma to suppose all\nof these model line bundles live on a single B-model X of X. By Lemma 2.4 there exists\na B-model Y of Y and a morphism φ\ne : Y → X such that φ\neK = φ. In this case, we find\n17\n\n\fthat (Y , φ\ne∗ Li ) is a B-model of the pair (Y, φ∗ Lei i ). By the projection formula for classical\nintersection products, we get\n\u0001\n\u0001 c1 (φ\ne∗ L0 ) * * * c1 (φ\ne∗ Ld )\n∗\n∗\nc1 φ L d =\nb\nc1 φ L 0 * * * b\ne0 * * * ed\nc1 (L0 ) * * * c1 (Ld )\n= deg(φ)\ne\ne0 * * * ed\n\u0001\n\u0001\nc1 Ld .\n= deg(φ)\ne b\nc1 L0 * * * b\nPassing to the generic fibers of Y and X over B does not change their function fields; hence,\ndeg(φ)\ne = deg(φ). This completes the proof when the metrics are all induced by models.\nSince φ : Y → X is surjective, we know the induced morphism φan : Yvan → Xvan of\nanalytic spaces is too [Ber90, Prop. 3.4.6]. So if Li is an arbitrary semipositive metrized line\nbundle and (Xi , Li ) is a model of (X, Lei i ), we have\n\u0010\n\u0011\n\u0011\n\u0010\n1/e\n1/e\ndistv φ∗ k * kLi ,vi , φ∗ k * kLi ,v = distv k * kLi ,vi , k * kLi ,v ,\nwhere k * kLi ,v denotes the given metric on Li at the place v. This shows that if {Li,m }m is\na sequence of semipositive metrized line bundles induced from models for which the metrics\nconverge uniformly to those of Li , then {φ∗ Li,m }m is a sequence of semipositive metrized\nline bundles for which the metrics converge uniformly to those of φ∗ Li . This observation\ncoupled with the above work in the model case gives the desired conclusion.\n2.3. Model Functions. In this section we fix a projective variety X over K and a place v\nof K. As always, we will identify v with a closed point of the curve B.\nA function f : Xvan → R will be called a model function if it is of the form\nf (x) = − log k1(x)k1/e\nfor some formal metric k * k on OXvan and some positive integer e. Every such function is\ncontinuous on Xvan . The set of model functions forms a Q-vector space. (The tensor product\nand inverse of formal metrics is again a formal metric.) The importance of model functions\nstems from the following result:\nLemma 2.6 (Gubler). The space of model functions is uniformly dense in the space of\nreal-valued continuous functions on Xvan .\nProof. This is the content of Theorem 7.12 of [Gub98]. One should note that, while the\nauthor assumes at the outset of section 7 that the field K is algebraically closed, he makes\nno use of it (nor is it needed for his references to the papers of Bosch and Lutkeböhmert). \u0003\nAs our intersection theory for adelic metrized line bundles is defined via intersection theory\non B-models, we need to be able to relate model functions to global models in order to\nperform computations with them. A result of Yuan provides this relation.\n18\n\n\fLemma 2.7 (Yuan). Suppose k * kv is a formal metric on the trivial bundle over Xvan , e ≥ 1\n1/e\nis an integer, and f (x) = − log k1(x)kv is a model function. Then there exists a B-model\ne\n(X , O(f )) of (X, OX\n) such that the metrics on OX determined by O(f ) are trivial at all\n1/e\nplaces w 6= v, and at the place v the metric is k * kv . The line bundle O(f ) admits a\nrational section s such that s|X = 1 and such that the support of the divisor of s lies entirely\nin the fiber over the point v ∈ B.\nProof. When e = 1, this is precisely the content of the statement and proof of [Yua08,\nLemma 3.5]. The proof executed there in the case where K is a number field applies equally\nwell to the present situation. To extend to the case e > 1, we start with a model function\n1/e\nf (x) = − log k1(x)kv . Let g = ef . We may apply the case e = 1 to the model function g to\nget a B-model (X , O(g)) of (X, OX ) with trivial metrics at all places w 6= v and the metric\ne\nvia the canonical isomorphism\nk * kv at v. Now view O(g) as a model of the bundle OX\n∼\n⊗e\ne\nOX → OX sending 1 to 1 . This is precisely the B-model we seek, as the metric at v is\n1/e\nnow k * kv .\n\u0003\nMomentarily we will prove a fundamental formula for intersecting the line bundle O(f )\nwith the Zariski closure of a point of x in some model X . First we need some notation. If x is\nany closed point of X, note that x breaks up into finitely many closed points over Kv - one\nfor each extension of the valuation v to the residue field K(x) at x (cf. Proposition 6.1). Let\nOv (x) be the image of this set of points under the canonical inclusion of |XKv | ,→ Xvan , where\n|XKv | is the set of closed points of XKv . Another way to view Ov (x) is as the image of {x}an\nv in\nan\nXv . Let degv (y) = [Kv (y) : Kv ] be the degree of the residue field of the closed point y ∈ XKv\nP\nas an extension over Kv . These degrees satisfy the relation deg(x) = y∈Ov (x) degv (y). (This\nis a classical fact proved in the appendix. It can also be deduced from the discussion at the\nend of section 2.4 by integrating a nonzero constant function.)\nLemma 2.8. Suppose f is a model function on Xvan induced by a formal metric on OXvan .\nLet (X , O(f )) be a B-model of (X, OX ) as in Yuan's lemma. If x is a closed point of X,\nthen\nX\ndegv (y)f (y),\n(7)\nc1 (O(f )) * [x] = [k(v) : k]\ny∈Ov (x)\n\nwhere x is the Zariski closure of x in X and k(v) is the residue field of the point v ∈ B.\nProof. We begin the proof by interpreting the contribution of a point y ∈ Ov (x) to the\nsum in (7) in terms of lengths of modules over a neighborhood in the formal completion\nof X along the closed fiber over the point v. Then we interpret the intersection number\nc1 (O(f )) * x in terms of the same quantities by working on the formal completion of x along\nits closed fiber over v.\n19\n\n\fA point y ∈ Ov (x) corresponds to a finite extension of fields Kv (y)/Kv and a Kv -morphism\nSpec Kv (y) → XKv . Let R be the valuation ring of Kv (y); i.e., the integral closure of Kv◦ in\nKv (y). By properness, we obtain a lift to a Kv◦ -morphism ỹ : Spec R → XKv◦ . Now take an\nopen affine W = Spec A around the image of the closed point of Spec R via ỹ over which\nO(f )⊗Kv◦ is trivial. For topological reasons, ỹ factors through W . Set M = (O(f ) ⊗ Kv◦ ) |W ;\nit is a free A-module of rank 1. Then there exists a section u ∈ M that generates M as an Amodule and, by Yuan's lemma, a rational section s such that s|WKv = 1. Write s = (γ1 /γ2 )u\nfor some γ1 , γ2 ∈ A.\nLet mv and mR be the maximal ideals of Kv◦ and R, respectively. Both of the latter are\ndiscrete valuation rings; we denote the corresponding normalized valuations by ordv and\nordR , respectively. (Recall that this means a uniformizer has valuation 1.) Extend these\nvaluations to the fraction fields Kv and Kv (y) in the usual way. The normalized absolute\nvalue on Kv is given by |c| = exp(− ordv (c)) for any c ∈ Kv . If ey is the ramification index\nof Kv (y) over Kv , then the absolute value extends uniquely to Kv (y), and is given by the\nformula |c| = exp(− ordR (c)/ey ).\nPassing to the mv -adic completion of everything in sight gives a morphism ŷ : Spf(R) →\nSpf(Â), and we denote by γ̂i the image of γi in Â. Let αŷ : Â → R be the induced morphism\nof complete Kv◦ -algebras. By definition, we now have\nγ̂1\nαŷ (γ̂1 )\n(y) = − log\nγ̂2\nαŷ (γ̂2 )\n−1\n= ey ordR (αŷ (γ̂1 )/αŷ (γ̂2 )) .\n\nf (y) = − log k1(y)k = − log\n\nLetting kR = R/mR and kv = Kv◦ /mv be the relevant residue fields, we have [Kv (y) : Kv ] =\ney [kR : kv ]. This follows, for example, from the degree formula for extensions of Dedekind\nrings. Therefore\ndegv (y)f (y) = [kR : kv ] ordR (αŷ (γ̂1 )/αŷ (γ̂2 )) .\n\n(8)\n\nNote that kv is canonically isomorphic to the residue field of OB,v because the completion of\nthis local ring is precisely Kv◦ ; i.e., kv ∼\n= k(v).\nNow we turn to the intersection number c1 (O(f )) * [x]. Let π : X → B be the structure\nmorphism, and let j : x ,→ X be the closed immersion of x with its reduced subscheme\nstructure. There exists a rational section s such that supp[div(s)] is contained entirely in\nπ −1 (v), and s|X = 1. This is the same section s that was used above (prior to restriction\nand base change). As x is proper and quasi-finite over B, it is finite over B. To compute\nthe intersection number c1 (O(f )) * [x] we may restrict to an affine neighborhood U = Spec C\nof v. Let xU = Spec T , where T is a finite domain over C. We also call j the morphism\nSpec T ,→ XU . Let N = j ∗ (O(f )|XU ) be the corresponding T -module, and we will also\n20\n\n\fwrite s for the image of our rational section in N . By definition, we have\nX\n[k(t) : k] ordt (s).\nc1 (O(f )) * [x] =\n\n(9)\n\nt∈Spec T\nclosed points\n\nHere ordt (s) = lTmt (Tmt /σ1 Tmt ) − lTmt (Tmt /σ2 Tmt ), where mt is the maximal ideal of T\ncorresponding to the point t, and s corresponds to σ1 /σ2 for some σ1 , σ2 ∈ Tmt under an\n∼\nisomorphism N ⊗ Tmt → Tmt . It is independent of the choice of isomorphism and of the\nchoice of σi (cf. [Ful98, Appendix A.3]).\nTo say that supp[div(s)] lies in the fiber over v means that ordt (s) = 0 whenever the closed\npoint t does not lie over v. Thus localizing on the base U in (9) preserves all of the quantities\nin the sum, and so we may replace T by T ⊗C OB,v . We continue to call this semi-local ring\nT . But length is preserved by flat residually trivial base extension, so we may even pass\nto the mv -adic completion without affecting the quantities in (9). Now ÔB,v = Kv◦ , and\nQ\nT̂ = T ⊗OB,v Kv◦ = ri=1 T̂i , where the maximal ideals of T are m1 , . . . , mr and T̂i is the\nmv -adic completion of Tmi (cf. [Mat89, Thm 8.15]). Note also that the residue fields of OB,v\nand Kv◦ are canonically isomorphic. Equation (9) now becomes\nc1 (O(f )) * [x] = [k(v) : k]\n\nr\nX\n[k(t̂i ) : k(v)] ordt̂i (ŝ),\n\n(10)\n\ni=1\n\nwhere t̂1 , . . . , t̂r are the closed points of Spec T̂ , and ŝ is the image of s in the mv -adic\ncompletion of N .\nBy construction, base changing x ,→ X to Kv◦ gives a commutative diagram\nSpec T̂\n\nx\n\n/ XK ◦\nv\n??\n?? \u007f\u007f\n\u007f\n\u007f\n\u007f\u007f ???\n\u007f\n?\u001f \u000f\n\u007f\u007f\u007f\n\nxKv◦\n\n\u007f\u007f\n\u007f\u007f\n\u007f\n\u007f\n\u007f\u007f\n\u007f\u007f \u007f\n/X\nSpec Kv◦\n??\n??\n\u007f\u007f\n??\n\u007f\u007f\n\u007f\n??\n\u007f\u007f\n??\n\u001f \u000f \u007f\u007f\u007f\n\nB\n\nThe horizontal maps are closed immersions. By virtue of this diagram, we see that the points\nof Ov (x) are in bijective correspondence with the generic points of Spec T̂ , which in turn are\nin bijective correspondence with the generic points of the disjoint closed subschemes Spec T̂i .\nMoreover, given y ∈ Ov (x) corresponding to the generic point of Spec T̂i , the Kv◦ -morphism\nỹ : Spec R → XKv◦ constructed above factors through the closed immersion Spec T̂i ,→ XKv◦ .\nThis gives the equality of residue fields [kR : kv ] = [kR : k(t̂i )][k(t̂i ) : k(v)].\nComparing (8) and (10), we see the proof will be complete once we show that\nordt̂i (ŝ) = [kR : k(t̂i )] ordR (αŷ (γ̂1 )/αŷ (γ̂2 )) .\n21\n\n\fAgain for topological reasons, Spec R → Spec Â factors through Spec T̂i , so we find that the\ncomposition Â → T̂i → R equals the homomorphism αŷ : Â → R from before. Furthermore,\nthe definitions are such that the elements σˆj used to compute ordt̂i (ŝ) may be chosen to\ncorrespond to αŷ (γˆj ) under the homomorphism T̂i → R. As R is the integral closure of T̂i\nin Kv (y), the desired equality is easily deduced from the following well-known formula upon\nsetting S = T̂i and a = σ̂i .\n\u0003\nLemma 2.9 ([Ful98, Example A.3.1]). Let S be a one-dimensional local noetherian domain.\nFor any a ∈ S, we have\nX\nlS (S/aS) =\nlR (R/aR)[R/mR : S/mS ],\nR\n\nwhere the sum is over all discrete valuation rings of the fraction field of S that dominate S.\n2.4. Associated Measures. As before, let X be a projective variety of dimension d over the\nfunction field K, and fix a place v for the entirety of this section. For semipositive metrized\n\u0001\n\u0001\nline bundles L1 , . . . , Ld on X, we will define a bounded Borel measure c1 L1 * * * c1 Ld on\nXvan . In order to avoid extra notation, we do not indicate the dependence of the measure on\nthe place v as it will be apparent from context. Any model function f : Xvan → R induces\nan integrable metrized line bundle OX (f ) on X, and the measure is defined by\nZ\n\u0010\n\u0011\n\u0001\n\u0001\n\u0001\n\u0001\nf c 1 L 1 * * * c1 L d = b\nc1 OX (f ) b\nc1 L1 * * * b\nc1 Ld .\nXvan\n\nThis approach through global intersection theory has the advantage of being technically easy\nto define. However, it obscures the fact (which we shall prove) that the measure depends\nonly on the metrics of the Li at the place v. One could also develop local intersection theory on formal schemes over Kv◦ and define the associated measures purely in terms of local\nintersection products. This is the viewpoint taken by Gubler; for a nice synopsis of the properties of local intersection theory, see [Gub07, §2]. These measures were originally defined by\nChambert-Loir [CL06] in the number field case using the formula of Theorem 2.12(i) below,\nand then by passing to the limit using the local intersection theory of Gubler [Gub98].\nFor f a continuous function on Xvan , define OX (f ) to be the adelic metrized line bundle with\nunderlying bundle OX , the trivial metric at all places w 6= v and the metric k1(x)kv = e−f (x)\nat v.\nLemma 2.10. If f is a model function on Xvan , the adelic metrized line bundle OX (f ) is\nintegrable.\n1/e\n\nProof. If f = − log k * kv , then Yuan's Lemma (Lemma 2.7) allows one to construct a Be\nmodel (X , O(f )) of (X, OX\n) such that the associated adelic metrized line bundle is OX (f ).\nAs X is projective, we can write O(f ) = L1 ⊗ L2∨ for some ample line bundles L1 , L2\n22\n\n\fon X . They are a fortiori relatively semipositive, and so they induce semipositive metrized\n∨\n\u0003\nline bundles L1 , L2 such that OX (f ) = L1 ⊗ L2 . Thus OX (f ) is integrable.\nLemma 2.11. Let X be a projective variety of dimension d over the function field K and v a\nplace of K. For any choice of semipositive metrized line bundles L1 , . . . , Ld , the association\n\u0011\n\u0010\n\u0001\n\u0001\nc1 L 1 * * * b\nc1 L d\nf 7→ b\nc1 OX (f ) b\ndefines a bounded linear functional on the Q-vector space of model functions on Xvan with the\nuniform norm.\nProof. It is apparent from the definition that if f and g are two model functions, then\nOX (f ) ⊗ OX (g) = OX (f + g). Thus the map in question is additive. Next note that n1 f is\nn\na model function for any n ≥ 1 whenever f is a model function (view OX as OX\nvia the\nisomorphism 1 7→ 1⊗n ). It is therefore an easy consequence of additivity that the map in\nquestion is Q-linear as desired.\nThe map is bounded by Theorem 2.1(ii).\n\n\u0003\n\nThe space of model functions on Xvan is dense in the linear space C (Xvan , R) of real-valued\ncontinuous functions endowed with the uniform norm (Lemma 2.6), so the association in\nthe previous lemma extends to a bounded linear functional on C (Xvan , R). By the Riesz\nrepresentation theorem, we may identify it with a Borel measure on Xvan . Denote this\n\u0001\n\u0001\nmeasure by c1 L1 * * * c1 Ld . Evidently we require d = dim X ≥ 1 for this notation to be\nsensible, an annoyance we will remedy at the end of this section.\nTheorem 2.12. Let X be a projective variety of dimension d over the function field K\nand v a place of K. If L1 , . . . , Ld denote semipositive metrized line bundles on X, then the\n\u0001\n\u0001\nfollowing properties hold for the measures c1 L1 * * * c1 Ld :\n(i) Suppose X is normal, that X is a normal B-model of X, and that L1 , . . . , Ld\nare models on X of Le11 , . . . , Ledd , respectively, that induce the metrized line bundles\nP\nL1 , . . . , Ld . Let [Xv ] =\nm(j)[Wj ] with each Wj irreducible, and let δξj denote the\nDirac measure at the unique point ξj ∈ Xvan that reduces to the generic point of Wj .\n(See the remarks preceding Lemma 2.5.) Then\n\u0001\n\u0001 X\nc1 (L1 ) * * * c1 (Ld ) * [Wj ]\nm(j)\nδξj .\nc1 L 1 * * * c1 L d =\ne1 * * * ed\nj\n\u0001\n\u0001\n(ii) c1 L1 * * * c1 Ld is symmetric and multilinear in L1 , . . . , Ld .\n\u0001\n\u0001\n(iii) c1 L1 * * * c1 Ld is a nonnegative measure.4\n0\n(iv) If L1 and L1 have the same underlying\nbundle and identical metrics at the\n\u0010 0algebraic\n\u0011\n\u0001\n\u0001\n\u0001\nplace v, then c1 L1 * * * c1 Ld = c1 L1 * * * c1 Ld as measures on Xvan .\n4\n\nMeasure theory texts would called this a positive measure.\n23\n\n\f\u0001\n\u0001\n(v) The measure c1 L1 * * * c1 Ld has total mass [k(v) : k] degL1 ,...,Ld (X).\n(vi) If Y is another projective K-variety and φ : Y → X is a generically finite surjective\nmorphism, then\n\b\n\u0001\n\u0001\n\u0001\n\u0001\nφ∗ c1 φ∗ L1 * * * c1 φ∗ Ld = deg(φ)c1 L1 * * * c1 Ld .\nProof. (i) It suffices to prove that both measures integrate the same way against a model\nfunction of the form f = − log k1kv . Use Yuan's Lemma to choose a model (X , O(f )) of\n(X, OX ) and a rational section s of O(f ) such that the support of [div(s)] is contained in\nthe fiber Xv . Then we have\nZ\n\u0001\n\u0001 c1 (O(f )) c1 (L1 ) * * * c1 (Ld )\nf c1 L1 * * * c1 Ld =\ne1 * * * ed\nXvan\nX\nc1 (L1 ) * * * c1 (Ld ) * [Wj ]\n.\n=\nordWj (s)\ne\n*\n*\n*\ne\n1\nd\nj\nApplying (1) of section 2.2 shows us that ordWj (s) = m(j)f (ξj ), which implies the result.\n(ii) This follows immediately from Theorem 2.1(iii).\n(iii) It suffices to show that if f = − log k1kv is a nonnegative model function, then\n\u0001\n\u0001\nf c1 L1 * * * c1 Ld ≥ 0. We may also assume that all of our metrized line bundles are\nXvan\ninduced by models L1 , . . . , Ld by using a limit argument. Apply Yuan's lemma to get a line\nbundle O(f ) that induces the metrized line bundle OX (f ), and let s be a rational section\nof O(f ) whose associated divisor is supported in Xv . As f ≥ 0, we deduce that [div(s)] is\neffective (cf. (1)). Then\nZ\n\u0001\n\u0001\nf c1 L1 * * * c1 Ld = c1 (L1 ) * * * c1 (Ld ) * [div(s)] ≥ 0\nR\n\nXvan\n\nbecause the intersection of relatively semipositive line bundles on components of the fiber\nXv is nonnegative.\n(iv) It suffices to show that\nZ\nZ\n\u0001\n\u0001\ng c1 L1 * * * c1 Ld =\nXvan\n\nXvan\n\n\u0010 0\u0011\n\u0001\ng c 1 L 1 * * * c1 L d\n\nfor any model function g : Xvan → R. In terms of intersection numbers, we must show\n\u0011\n\u0011 \u0010 0\u0011\n\u0010\n\u0010\n\u0001\n\u0001\n\u0001\nb\nc1 OX (g) b\nc1 L1 * * * b\nc1 Ld = b\nc1 OX (g) b\nc1 L1 * * * b\nc1 L d .\nBy linearity, this reduces to proving that if L1 is an integrable metrized line bundle with\nunderlying bundle OX and the trivial metric at v, and if L2 , . . . , Ld are arbitrary semipositive\nmetrized line bundles, then\n\u0010\n\u0011\n\u0001\n\u0001\nb\nc1 OX (g) b\nc1 L1 * * * b\nc1 Ld = 0.\n24\n\n\fWe know L1 must have the trivial metric at almost all places, so there exist finitely many\nplaces w1 , . . . , wn of K and continuous functions fwi : Xwani → R such that\nL1 = OX (fw1 ) ⊗ * * * ⊗ OX (fwn ).\nWe may assume that no wi = v. Again by linearity, we may reduce to the case L1 = OX (fw )\nfor some continuous function fw with w 6= v. By a limit argument, we may further suppose\nthat fw is a model function and that L2 , . . . , Ld are induced by models L2 , . . . , Ld on some\nB-model X . Using Yuan's lemma (and the Simultaneous Model Lemma), we can find a line\nbundle O(fw ) on X that induces OX (fw ) and a rational section s of O(fw ) with associated\ndivisor supported entirely in the fiber Xw . Finally, use Yuan's lemma again to get a line\nbundle O(g) on X (perhaps after replacing X with a dominating model) equipped with a\nrational section t whose divisor is supported in Xv . Then\n\u0010\n\u0011\n\u0001\n\u0001\nb\nc1 OX (g) b\nc1 L1 * * * b\nc1 Ld = c1 (O(g)) c1 (O(fw )) c1 (L2 ) * * * c1 (Ld ) = 0,\nsince the section t is regular and invertible when restricted to Xw . Thus (iv) is proved.\n(v) Take any B-model X of X. The cycle [Xv ] is a Cartier divisor, and we can use it\nto define the constant model function 1. Indeed, if π is a uniformizer of OB,v , then π is a\nlocal equation for Xv on X . Consider the line bundle OX ([Xv ]); it induces the metrized\nline bundle OX (f ), where f (x) = − log k1(x)kv = − log |π|v = 1.\nBy a limiting argument we may assume that the metrized line bundles L1 , . . . , Ld are\ninduced by models L1 , . . . , Ld of Le11 , . . . , Ledd , respectively. Now Lemma 2.3 shows\nZ\n[k(v) : k] degLe11 ,...,Led (X)\n\u0001\n\u0001 c1 (L1 ) * * * c1 (Ld ) * [Xv ]\nd\n1 c1 L1 * * * c1 Ld =\n=\n.\ne1 * * * ed\ne1 * * * ed\nXvan\n(vi) This is an easy consequence of Theorem 2.1(iv) and the fact that OY (f ◦ φ) =\nφ∗ OX (f ) for any continuous function f .\n\u0003\nParts (iii) and (v) of the above theorem indicate a natural normalization for these measures. For a semipositive metrized line bundle L with ample underlying bundle L and a\nplace v of K, define a probability measure by\n\u0001d\nc1 L\nμL,v =\n.\n[k(v) : k] degL (X)\nGiven any subvariety Y ⊂ X, we can similarly define a probability measure supported on\nYvan since L|Y is also semipositive. If j : Yvan ,→ Xvan is the canonical inclusion, then we set\nn\n\u0001dim Y o\nj∗ c1 L|Y\nμY,L,v =\n.\n[k(v) : k] degL (Y )\nWhen Y = X, we see immediately that μY,L,v = μL,v .\n25\n\n\fFinally, we want to define μ{x},L,v for a closed point x ∈ X. For any model function f on\ndefine\n\u0010\n\u0011\nZ\nb\nc1 OX (f )|{x}\n.\nf dμ{x},L,v =\n[k(v) : k] deg(x)\nXvan\n\nXvan ,\n\nThe proofs of Lemma 2.11 and Theorem 2.12 apply here to show that μ{x},L,v extends to\na Borel probability measure on Xvan . Evidently it is independent of the semipositive line\nbundle L, but we have chosen to retain it in the notation to preserve symmetry with μY,L,v\nwhen Y is a higher dimensional subvariety. By Lemma 2.8, we have the appealing formula\nX\n1\nμ{x},L,v =\ndegv (y)δy ,\ndeg(x)\ny∈Ov (x)\n\nwhere δy is the point measure supported at y.\n2.5. Global Height Functions. In this section we define normalized height functions associated to semipositive metrized line bundles. One of the most useful properties of height\nfunctions with regard to arithmetic intersection theory is the transformation law that they\nsatisfy when one changes some of the metrics by a constant. For example, this property\nwill allow us to define canonical height functions and invariant measures associated to a\ndynamical system.\nSuppose L is an ample line bundle on X and L is a semipositive metrized line bundle with\nunderlying bundle L. Then L|Y is semipositive for any subvariety Y ⊂ X. We define the\nheight of such a subvariety by\n\u0001dim Y +1\nb\nc1 L|Y\nhL (Y ) =\n.\n(dim Y + 1) degL (Y )\nRecall that OX (b) is defined to be the adelic metrized line bundle with underlying bundle\nOX , the trivial metric at all places w 6= v and the metric k1(x)kv = e−b at v.\nTheorem 2.13. Suppose X is a projective variety over K, L is an ample line bundle on X,\nand L is any semipositive metrized line bundle with underlying bundle L.\n0\n\n(i) If L is another semipositive metrized line bundle with the same underlying algebraic\nbundle L, then there exists a positive constant C such that for any subvariety Y of\nX,\nhL (Y ) − hL0 (Y ) ≤ C.\nIn fact, we may take\nC=\n\nX\n\n[k(v) : k] distv (k * kL,v , k * kL0 ,v ).\n\nv\n\n26\n\n(11)\n\n\f(ii) Fix a real number b and a place v of K. Then the adelic metrized line bundle\nL ⊗ OX (b) is semipositive, and for any subvariety Y , we have\nhL⊗OX (b) (Y ) = hL (Y ) + b[k(v) : k].\n(iii) Given any closed point x and rational section s of L such that x 6∈ supp (div(s)), we\nhave the following local decomposition:\nhL (x) =\n\nX\n−1 X\n[k(v) : k]\ndegv (y) log ks(y)kL,v .\ndeg(x) v∈B\ny∈Ov (x)\n\nProof. To prove (i), we use the telescoping sum trick from (5) in the previous section, and\nTheorem 2.1(ii). Set r = dim Y . Then\nb\nc1 L|Y\n\n\u0001r+1\n\n\u0010\n\n0\n\n−b\nc1 L |Y\n\n\u0011r+1\n\n≤\n≤\n\nr\nX\nj=0\nr\nX\n\nb\nc1 L|Y\n\n\u0001j\n\ndegL (Y )\n\nb\nc1\n\nX\n\n\u0010\u0010\n\n0 ∨\n\nL ⊗ (L )\n\n\u0011\n\n\u0011\nY\n\n\u0010\n\n0\n\nb\nc1 L |Y\n\n\u0011r−j\n\n\u0010\n\u0011\n0\n[k(v) : k] distv k * kL,v , k * kL ,v\n\nv\n\nj=0\n\n= C(r + 1) degL (Y ),\nwhere C is the constant in (11). Dividing both sides by (r + 1) degL (Y ) and using the\ndefinition of height gives the result.\nFor (ii), we note that arithmetic intersection numbers are continuous with respect to\nchange of metric (Theorem 2.1(ii)). Therefore it suffices to assume that L is induced by a\nrelatively semipositive B-model (X , L ) of (X, Le ). Let us also assume that b = m\n∈ Q.\nn\nAs in the proof of Theorem 2.12, we can construct a B-model of OX that induces the\nmetrized line bundle OX (b) by taking the line bundle M = OX (m[Xv ]) associated to the\nCartier divisor m[Xv ] on X . It is a B-model of the trivial bundle OX , and we may view\n∼\nn\nn\nit as a B-model of OX\nvia the isomorphism OX → OX\ncarrying 1 to 1⊗n . If π is a local\nequation for Xv on X , then we see that the metric on OX at v induced by M is given by\n1/n\nk1(x)kM ,v = |π m |v = e−m/n . The metrics at all of the other places are evidently trivial.\nThe line bundle M is relatively semipositive on X . Indeed, take any curve C supported\nin the fiber over a point w ∈ B. If w 6= v, then C and [Xv ] are disjoint and [Xv ] * C = 0. If\nw = v, then we note that [Xv ] = π ∗ [v], where π : X → B is the structure morphism. Let\nD be a divisor on B linearly equivalent to [v] such that v 6∈ supp(D). Then π ∗ D is a divisor\nwith support disjoint from C, and so [Xv ] * C = π ∗ D * C = 0.\nNotice that, as an operator on codimension-two cycles, c1 (M )2 = 0 by a linear equivalence\nargument similar to the one at the end of the last paragraph. Hence, for any subvariety\n27\n\n\fY ⊂ X of dimension r, we have\n\u0013\nr+1 \u0012\n\u0011 \u0011r+1 X\n\u0011r+1−j\n\u0010\u0010\n\u0001j \u0010\nr+1\nc1 OX (b)|Y\nb\nc1 L ⊗ OX (b) Y\n=\nb\nc1 L|Y b\nj\nj=0\n\u0013\nr+1 \u0012\nX\nr + 1 c1 (L )j c1 (M )r+1−j * [Y ]\n=\nj\nej nr+1−j\nj=0\nc1 (L )r+1 * [Y ]\nc1 (L )r c1 (M ) * [Y ]\n+\n(r\n+\n1)\ner+1\ner n\nr\n\u0001r+1 m\nc1 (L ) * [Y ] * [Xv ]\n=b\nc1 L|Y\n+ (r + 1)\nn\ner\n\u0001\n\u0001r+1 m\nc1 (L |Y )r * [ Y v ]\n=b\nc1 L|Y\n+ (r + 1)\nn\ner\n\u0001r+1 m\n+ (r + 1)[k(v) : k] degL (Y ).\n=b\nc1 L|Y\nn\nThe last equality follows from Lemma 2.3. Applying the definition of height immediately\ngives the result in the case b = m\n. The general case follows by continuity of arithmetic\nn\nintersection numbers when we take a limit over rational approximations of b.\n=\n\nThe proof of (iii) is similar to the proof of Lemma 2.8, so we omit it.\n\n\u0003\n\n3. Algebraic Dynamical Systems\nIn this section we review the facts necessary to work with algebraic dynamical systems\ndefined over a function field, including the construction of the invariant metrics on the\npolarization of a dynamical system, the theory of (canonical) dynamical heights, and the\ninvariant measures for the dynamical system.\n3.1. Invariant Metrics. Here we are concerned with the existence and uniqueness properties of invariant metrics on the polarization of an algebraic dynamical system. This will\ngive us a natural semipositive metrized line bundle with which to define heights related to a\ndynamical system.\nLet (X, φ, L) be an algebraic dynamical system over K as in the introduction. Suppose\n∼\nθ : φ∗ L → Lq is an isomorphism with q > 1. For a place v of K, choose any initial metric\nk * k1,v on Lv . For example, it could be the metric induced by a B-model of L. We can\nconstruct an invariant metric on Lv by Tate's limit process: by induction, define\n\u00011/q\nk * kn+1,v = φ∗ k * kn,v ◦ θ−1\n.\nHere φ∗ k * kn,v denotes the metric on φ∗ Lv induced by pullback. It is well-known (cf. [BG06,\n§9.5] or [Zha95b, §2]) that this sequence of metrics converges uniformly to a continuous\nmetric k * k0,v on Lv with the following properties:\n28\n\n\f(i) The pullback by φ agrees with the qth tensor power (up to the isomorphism θ):\n∗\nk * k⊗q\n0,v ◦ θ = φ k * k0,v .\n\n(ii) If θ is replaced by θ0 = aθ for some a ∈ K × , then the corresponding metric constructed by Tate's limit process satisfies\n1\n\nk * k00,v = |a|vq−1 k * k0,v .\nProperty (i) uniquely determines the metric. In the literature this metric is sometimes called\nthe \"canonical metric\" or an \"admissible metric.\" We adhere to the term invariant metric\nbecause it is only canonical up to a choice of isomorphism θ by property (ii), and we feel\nthe term \"admissible\" is already overused in nonarchimedean geometry. We can interpret\nproperty (i) by saying that the family {k*k0,v }v of invariant metrics provide the unique adelic\n∼\nmetric structure on L such that the isomorphism θ : φ∗ L → Lq becomes an isometry.\nThe above discussion settles the existence of invariant metrics at each place v ∈ B, but\nwe still need to show that they fit together to give a semipositive adelic metrized line bundle:\n(iii) There exists a sequence of B-models (Xn , Ln ) of (X, Len ) such that each Ln is nef,\n1/en\n1/en\n→ k * k0,v uniformly for every other\n= k * k0,v for almost all v, and k * kLn ,v\nk * kLn ,v\nplace v. In particular, the metrized line bundle L with underlying bundle L and the\nfamily of metrics {k * k0,v }v is semipositive.\nThe first step in this direction is to construct a sequence of B-models that determine metrics\non L according to Tate's limit process.\nLemma 3.1. Let X be a projective variety over K and L an ample line bundle on X. Then\nthere exists a positive integer e and a B-model (X , L ) of (X, Le ) such that L is nef.\nProof. This proof was adapted from a remark in the Notation and Conventions section of\n[Yua08, §2.1]. Choose e so that Le is very ample. Let\nN\nN\nX ,→ PN\nK ,→ PB = P × B\nN\nbe an embedding induced by Le followed by identifying PN\nK with the generic fiber of PB , and\nset X to be the Zariski closure of X in PN\nB with the reduced structure. Let π : X → B be\nthe restriction of the second projection. Choose a collection of basepoint free global sections\ns0 , . . . , sN of Le , and let sei be the section si viewed as a rational section of OX (1). Let D\nbe an ample Cartier divisor B such that [π ∗ D] + [div(e\nsi )] is effective for all i. Finally, define\n∗\nL = OX (1) ⊗ π OB (D).\n\nWe claim that L is nef. Indeed, suppose Y is an irreducible curve on X . If Y is vertical\n- i.e., π(Y ) = {v} for some closed point v ∈ B - then\nc1 (L ) * [Y ] = deg(OX (1)|Y ) > 0,\n29\n\n\fsince OX (1) is relatively ample. If Y is horizontal, then choose one of the sections si of Le\nsuch that YK 6∈ supp[div(si )]. Then Y is not contained in the support of [div(e\nsi )], and it\nintersects properly with any subvariety of a vertical fiber. Hence,\nc1 (L ) * [Y ] = [div(e\nsi )]h * [Y ] + ([div(e\nsi )]f + c1 (π ∗ D)) * [Y ] ≥ 0,\nwhere [div(e\nsi )] = [div(e\nsi )]h + [div(e\nsi )]f is the decomposition of this cycle into its horizontal\nand vertical parts.\n\u0003\nReturning to our construction, choose an initial B-model (X1 , L1 ) of (X, Le1 ) such that\nL1 is nef on X1 . The above lemma guarantees the existence of such a B-model. Define the\n1/e\nmetric on Lv to be k * k1,v = k * kL1 ,v1 .\nWe proceed induction. Suppose (Xn , Ln ) is a B-model of (X, Len ), where en = q n−1 e1\nand Ln is nef. Let jn : X ,→ Xn be the inclusion of the generic fiber (always implicitly\n∼\nprecomposed with the preferred isomorphism ιn : X → (Xn )K ). Let Γφ : X → X ×K X be\nthe graph morphism. Consider the commutative diagram\njn ◦φ\nX KK\nKK Γ\nKKeφ\nKK\nKK\n%\nXn ×B Xn\njn\n\n%\n\n\u000f\n\npr2\n\n/\n\n%\n\npr1\n\nXn\n\nXn\n\n/\n\n\u000f\n\nB\n\neφ = (jn × jn ) ◦ Γφ . Define Xn+1 to be the Zariski closure of Γ\neφ (X) in Xn ×B Xn\nwhere Γ\nwith the reduced subscheme structure. Take Ln+1 = pr∗2 Ln |Xn+1 . The graph morphism\nΓφ and the tensor power θ⊗en give the preferred isomorphisms between X and the generic\nfiber of Xn+1 and between φ∗ Len and Lqen , respectively. As always, we will make these\nidentifications without comment in what follows. Set en+1 = qen , and define a metric on\n1/en+1\nLv by k * kn+1,v = k * kLn+1\n,v . Observe that Ln+1 is nef since it is the pullback of a nef line\nbundle.\nThe metrics on Lv are, by construction, exactly as given by Tate's limit process. This\nfollows from the fact that formation of formal metrics commutes with formal pullback\n(Lemma 2.4), and a small computation:\n\u0010\n\u00111/q\n1/en+1\n1/en\nk * kn+1,v = k * kLn+1\n=\nk\n*\nk\n∗\n,v\npr2 Ln,v |Xn+1\n\u0010\n\u00111/q\n1/en\n= φ∗ k * kLn ,v\n◦ θ−1\n\u00011/q\n= φ∗ k * kn,v ◦ θ−1\n.\nMoreover, we now show that almost all of the metrics constructed are stable under this\npullback procedure. As X is of finite type over K, there exists an open subset U ⊂ B\n30\n\n\fsuch that the endomorphism φ extends to a U -morphism φU : (X1 )U → (X1 )U , and the\n∼\n∼\nisomorphism θ : φ∗ L → Lq extends to an isomorphism θU : φ∗U L1 |π−1 (U ) → L1q |π−1 (U ) .\neφ extends over U to give a closed immersion (X1 )U → (X1 )U ×U\nThe graph morphism Γ\n(X1 )U . Consequently, its (scheme-theoretic) image is exactly (X2 )U , so that X1 and X2\nare isomorphic when restricted over U . Pulling back L2 via this isomorphism and applying\nq\nθU shows Γ∗φU L2 = φ∗U L1 ∼\n= L1 over U . As L2 is a model of Le2 via the graph morphism\nand the isomorphism θ, we conclude that for each place v corresponding to a closed point of\nU , we have\n1/e\n1/e\n1/qe\nk * k2,v = k * kL2 2 = k * kL q 1 = k * kL1 1 = k * k1,v .\n1\n\nThe isomorphism between (X1 )U and (X2 )U allows us to extend the work in the previous\nparagraph by induction to conclude that for each place v of U , the metrics k * kn,v on Lv are\nequal for all n.\n∼\n\n3.2. Dynamical Heights. Let the data (X, φ, L), θ : φ∗ L → Lq , and L be as in the previous\nsection. For a subvariety Y ⊂ X, we can define its dynamical height with respect to the\ndynamical system (X, φ, L) by the formula\n\u0001dim Y +1\nb\nc1 L|Y\nhφ (Y ) = hL (Y ) =\n.\n(dim Y + 1) degL (Y )\n∼\n\nTheorem 3.2. Let (X, φ, L) be a dynamical system over K, θ : φ∗ L → Lq an isomorphism,\nand L the line bundle L equipped with the corresponding invariant metrics {k * k0,v }v .\n(i)\n(ii)\n(iii)\n(iv)\n\nThe height hφ is independent of the choice of isomorphism θ.\nFor any subvariety Y ⊂ X, hφ (Y ) ≥ 0.\nFor any subvariety Y ⊂ X, hφ (φ(Y )) = qhφ (Y ).\nIf Y is preperiodic for the map φ (i.e., the forward orbit {φn (Y ) : n = 1, 2, . . .} is\nfinite), then hφ (Y ) = 0.\n\nBefore turning to the proof, we will need the following\nLemma 3.3. Let (X, φ, L) be a dynamical system defined over K, and let φ∗ L ∼\n= Lq for\nsome integer q > 1. Then for any subvariety Y ⊂ X, the induced morphism Y → φ(Y ) is\nfinite of degree q dim Y .\nProof. Let ψ : Y → φ(Y ) be the morphism induced by φ. First note that ψ ∗ (L|φ(Y ) ) is\nample on Y since the restriction of an ample bundle to a subvariety is still ample, and\n\u0001\nq\nψ ∗ L|φ(Y ) = (φ∗ L) |Y ∼\n= Lq |Y = (L|Y ) .\n\u0001\nIf ψ(Z) = {p} for some subvariety Z ⊂ Y and some point p, then ψ ∗ L|φ(Z) ∼\n= OZ , which\ncan only be ample if Z is reduced to a point. Hence ψ : Y → φ(Y ) has finite fibers. As X\nis projective, we see ψ is a projective quasi-finite morphism, and so it must be finite.\n31\n\n\fIf r = dim Y , the projection formula gives\nc1 (L)r * [Y ] = q −r c1 (φ∗ L)r * [Y ] = q −r c1 (L)r * φ∗ ([Y ]) =\n\ndeg(ψ)\nc1 (L)r * [Y ].\nr\nq\n\nAs L is ample, we may divide by c1 (L)r * [Y ] to conclude deg(ψ) = q r .\n\n\u0003\n\nProof of Theorem 3.2. (i) Let θ0 = aθ for some a ∈ K × . If M is the metrized line bundle\n1\n\nwith underlying bundle OX and metric at the place v given by k1(x)kv = |a|vq−1 , then the\n0\ninvariant metrized line bundle corresponding to θ0 is L = L⊗M (property (ii) in section 3.1).\nTake any model X of X and consider the line bundle O(div(a)) associated to the principal\nq−1\ndivisor div(a) on X . We can view it as a model of OX\non the generic fiber via isomorphisms\nq−1\n∼\n∼\nOX (div(a)) = OX = OX . It is easy to check that the metric on OX at v given by O(div(a))\ncoincides with that of M . Letting r = dim Y , we find that\n\u0010 0 \u0011r+1\n\u0001r+1\n\u0001r+1\n\u0001r+1\n−b\nc1 L|Y\n=b\nc1 L|Y ⊗ M |Y\n−b\nc1 L|Y\nb\nc1 L |Y\n\u0013\nr \u0012\nX\n\u0001i\n\u0001r+1−i\nr+1\n=\nb\nc1 L|Y b\nc1 M |Y\n.\ni\ni=0\n\u0001\nAll of the terms in this sum involve an intersection with b\nc1 M , and if we compute this\nintersection on a model we are forced to intersect with the principal divisor div(a). Thus\neach term in the sum vanishes.\n(ii) Arithmetic intersection numbers are continuous with respect to change of metric, so\nit suffices to prove c1 (L )dim Y +1 * [Y ] ≥ 0, whenever (X , L ) is a B-model of (X, Le ), L\nis nef and Y is the Zariski closure of Y in X . Kleiman's theorem on intersections with nef\ndivisors implies the desired inequality [Laz04, Thm. 1.4.9].\n(iii) Let r = dim Y . By Lemma 3.3, the morphism φ restricts to a finite morphism\nY → φ(Y ) of degree q r . Theorem 2.1(iv) implies\n\u0001r+1\n\u0001r+1\n\u0001r+1\nb\nc1 L|φ(Y )\nb\nc1 φ∗ L|Y\nb\nc1 L|Y\nhφ (φ(Y )) =\n=\n=q\n= qhφ (Y ).\n(r + 1) degL (φ(Y ))\n(r + 1) degφ∗ L (Y )\n(r + 1) degL (Y )\n(iv) If the set {φn (Y ) : n = 1, 2, . . .} is finite, then φn (Y ) = φm (Y ) for some m > n ≥ 1.\nBy the previous part, we have\nq n hφ (Y ) = hφ (φn (Y )) = hφ (φm (Y )) = q m hφ (Y ).\nAs q > 1, we are forced to conclude that hφ (Y ) = 0.\nAs a special case of part (iv) of the previous theorem, we note that\n\u0001d+1\nb\nc1 L\nhφ (X) =\n= 0.\n(d + 1) degL (X)\n32\n\n\u0003\n\n\f∼\n\n3.3. The Invariant Measure μφ,v . Choose an isomorphism θ : φ∗ L → Lq , and let L be\nthe line bundle L equipped with the invariant metrics constructed as above. Fix a place v\nof K. Define a Borel probability measure on Xvan by the formula\n\u0001d\nc1 L\n.\nμφ,v = μL,v =\n[k(v) : k] degL (X)\n\u0001d\nHere μL,v and c1 L are the measures constructed in section 2.4. An argument similar to the\none that proved Theorem 3.2(i) shows that μφ,v is independent of the choice of isomorphism\nθ. Although it is not logically necessary for what follows, we give some further commentary\non these measures.\nSince φ is finite of degree q d (Lemma 3.3), we see that the measure μφ,v has the following\ninvariance property:\nφ∗ μφ,v = μφ,v .\nq\n\nIndeed, it follows immediately from Theorem 2.12 and the fact that φ∗ L is isometric to L .\nGiven any subvariety Y ⊂ X, we can also define the measure μY,φ,v = μY,L,v as in section 2.4. Lemma 2.12(vi) can be used to show\nφ∗ μY,φ,v = μφ(Y ),φ,v .\nAn important example is the case when X is a smooth geometrically connected projective\nvariety over K and v is a place of good reduction for (X, φ, L); i.e., there exists an open\nsubvariety U ⊂ B containing the point v, a smooth U -model (X , L ) of (X, L), a U morphism φU : X → X whose restriction to the generic fiber is precisely φ, and an\n∼\nisomorphism φ∗U L → L q . Roughly, the dynamical system can be reduced (mod v). One\ncan see from Theorem 2.12(i) and our description of Tate's limit process that there exists a\npoint ζ ∈ Xvan such that μφ,v = δζ . The point ζ is the unique point mapping to the generic\npoint of the special fiber Xv under the reduction map Xvan → Xv . Moreover, the forward\ninvariance of the measure μφ,v implies that ζ is a fixed point of the analytification of φ:\nφan\nv (ζ) = ζ.\nAs a final remark, we mention a backward invariance property the measure μφ,v presumably\npossesses based on the work of Chambert-Loir [CL06, §2.8] and others, although we do not\nprovide any proof in the present article. There is a way to define a trace map φ∗ on the\nspace of continuous functions on Xvan , and by duality a pullback measure φ∗ μφ,v . It should\nthen be true that φ∗ μφ,v = q d μφ,v . As a consequence of this backward invariance property,\n−1\nif (X, φ, L) has good reduction at a place v, then (φan\nv ) (ζ) = ζ, where μφ,v = δζ as in the\nprevious paragraph. That is, ζ is a totally invariant point for the morphism φan\nv . By analogy\nwith the case of complex dynamical systems, we expect that the invariant measure μφ,v can\nbe completely characterized as the unique Borel probability measure on Xvan such that\n33\n\n\f• φ∗ μφ,v = q d μφ,v , and\n• μφ,v does not charge any proper subvariety of X: μφ,v (Yvan ) = 0 for any proper\nsubvariety Y ⊂ X.\nSee the articles of Chambert-Loir [CL06] and Chambert-Loir / Thuillier [CLT08] for proofs\nthat the above properties hold for the measure μφ,v . It is not yet known if they determine the measure. See the article of Briend and Duval [BD01] for a discussion of such a\ncharacterization in the setting of complex dynamics.\n4. Proof of the Equidistribution Theorem\nOur goal for this section is to prove Theorem 1.1. We will deduce it from a stronger result\nthat is more flexible for applications and also gives equidistribution of small subvarieties. As\nalways, we let X be a variety over the function field K. Let L be a semipositive metrized\nline bundle on X with ample underlying bundle L satisfying the following two conditions:\n(S1) There exists a sequence of B-models (Xn , Ln ) of (X, Len ) such that each Ln is nef,\n1/en\n1/en\nk * kLn ,v\n= k * k0,v for almost all v, and k * kLn ,v\n→ k * k0,v uniformly for every other\nplace v.\n(S2) The height of X is zero: hL (X) = 0.\nA net of subvarieties of X consists of an infinite directed set A and a subvariety Yα ⊂ X\nfor each α ∈ A. A net of subvarieties (Yα )α∈A is called generic if for any proper closed subset\nV ⊂ X, there exists α0 ∈ A so that Yα 6⊂ V whenever α ≥ α0 . Equivalently, there does not\nexist a cofinal subset A0 ⊂ A such that Yα ⊂ V for all α ∈ A0 . The net is called small if\nlimα∈A hL (Yα ) = 0.\nTheorem 4.1. Let X be a projective variety over the function field K equipped with a\nsemipositive metrized line bundle L with ample underlying bundle L satisfying conditions\n(S1) and (S2). Let (Yα )α∈A be a generic small net of subvarieties of X. Then for any place\nv of K, and for any continuous function f : Xvan → R, we have\nZ\nZ\nf dμYα ,L,v =\nf dμL,v .\nlim\nα∈A\n\nXvan\n\nThat is, the net of measures μYα ,L,v\n\n\u0001\nα∈A\n\nXvan\n\nconverges weakly to μL,v .\n\nBefore turning to the proof, let us indicate why Theorem 1.1 follows from Theorem 4.1. Let\n(X, φ, L) be a dynamical system defined over the function field K. Choose an isomorphism\n∼\nθ : φ∗ L → Lq . Let L be the semipositive metrized line bundle with underlying bundle L and\nthe associated invariant metrics at all places as defined in section 3.1. Then property (iii) of\nthe same section is precisely the condition (S1). As hφ = hL (by definition), the discussion\nat the end of section 3.2 shows condition (S2). Thus the hypotheses of Theorem 4.1 on L\n34\n\n\fare satisfied. Upon unraveling all of the definitions, the conclusion of Theorem 1.1 follows\nimmediately from that of the above theorem.\nIn order to see why the above theorem is more useful in practice, consider a dynamical\nsystem (X, φ, L), and let Y be any subvariety of X such that hφ (Y ) = 0. If φ(Y ) 6= Y ,\nthen Y cannot be considered as a dynamical system on its own. Nevertheless, we find that\nL|Y is a semipositive metrized line bundle satisfying conditions (S1) and (S2), and so we\ncan use the above theorem to deduce equidistribution statements for generic small nets of\nsubvarieties of Y .\nProof of Theorem 4.1. Fix a place v of K. By Lemma 2.6 and a limiting argument, it\n1/n\nsuffices to prove the theorem when f = − log k1kv is a model function. By linearity of\nthe integral, we may take n = 1. Lemma 2.7 allows us to assume that f is induced by a\nB-model (X , O(f )) of (X, OX ). We also choose ample line bundles M1 and M2 on X\nso that O(f ) = M1 ⊗ M2∨ . Let M i be the metrized line bundle on X determined by Mi .\nR\nFinally, we assume that X an f dμL,v > 0 for the moment and remove this hypothesis at the\nv\nend of the proof.\nN\n\nN\n\nFor any N ≥ 1, we define L (f ) := L ⊗ OX (f ). We wish to compute the degree of this\nmetrized line bundle in two ways. For the first, we have\n\u0010 N \u0011d+1 \u0010\n\u0010\n\u0011\u0011d+1\n\u0001\nb\nc1 L (f )\n= Nb\nc1 L + b\nc1 OX (f )\nZ\n\u0001d+1\n\u0001\nd\nd+1\n+ N (d + 1) degL (X)[k(v) : k]\nf dμL,v + O N d−1\n=N b\nc1 L\nXvan\nZ\n\u0001\nf dμL,v + O N d−1 .\n= N d (d + 1) degL (X)[k(v) : k]\nXvan\n\n(12)\nThe integral appears by definition of the measure μL,v . The term b\nc1 L\nvanishes because\nit is the numerator of hL (X) (condition (S2)). The constant in the error term depends on L\nand f .\n\u0001d+1\n\nOn the other hand, we see that\n\u0010 N \u0011d+1\n\u0010 N\n\u0011\n∨ d+1\nb\nc1 L (f )\n=b\nc1 L ⊗ M 1 ⊗ M 2\n\u0013\nd+1 \u0012\n\u0010 N\n\u0011i\nX\n\u0001d+1−i\nd+1\n(13)\n(−1)d+1−i b\nc1 L ⊗ M 1 b\n=\nc1 M 2\ni\ni=0\n\u0010 N\n\u0011d+1\n\u0010 N\n\u0011d\n\u0001\n\u0001\n=b\nc1 L ⊗ M 1\n− (d + 1)b\nc1 L ⊗ M 1 b\nc1 M 2 + O N d−1 .\nR\nRecall that we assumed X an f dμL,v > 0. Comparing (12) and (13) shows that for N suffiv\nciently large,\n\u0010 N\n\u0011d+1\n\u0010 N\n\u0011d\n\u0001\nb\nc1 L ⊗ M 1\n− (d + 1)b\nc1 L ⊗ M 1 b\nc1 M 2 > 0.\n35\n\n\fWe may fix such an N for the remainder of the argument, and as it will have no effect on\nN\nthe proof, we will replace L by L.\nChoose ε > 0. By condition (S1) we may select a B-model (X 0 , L ) of (X, Le ) such\n0\nthat L is nef, the metrics on the associated adelic metrized line bundle L with underlying\nbundle L are equal to those of L at almost all places, and the sum of the weighted distances\n[k(v) : k] distv (k * kL,v , k * kL0 ,v ) at the other places is bounded by ε. By the Simultaneous\nModel Lemma, we may assume that X 0 = X so that O(f ) and L are line bundles on X .\nFurthermore, continuity of intersection numbers with respect to changes in the metric allows\nus to assume that\nc1 (L ⊗ M1e )d+1 − (d + 1)c1 (L ⊗ M1e )d c1 (M2e ) > 0.\nThe necessary tool from algebraic geometry needed to move forward at this point is\nSiu's Theorem ([Laz04, Theorem 2.2.15]). Let Y be a projective variety of dimension n\nover the field k and suppose N1 and N2 are nef line bundles on Y . If\nc1 (N1 )n − n c1 (N1 )n−1 c1 (N2 ) > 0,\nthen (N1 ⊗ N2∨ )r has nonzero global sections for r \u001d 0.\ne\nWe are in a position to apply Siu's theorem\n\u0010 with Y = X , n =\u0011rd + 1, N1 = L ⊗ M1 and\n(−e)\n= (L ⊗ O(f )e )r admits\nN2 = M2e . It follows that the line bundle L ⊗ M1e ⊗ M2\nglobal sections for all r \u001d 0. Fix such an r and a nonzero global section s. As (Yα )α∈A is a\ngeneric net in X, there exists α0 such that Yα does not lie in the support of div(s) for any\nα ≥ α0 . This means c1 ((L ⊗ O(f )e )r ) * [Yα ] is an effective cycle. As L is nef, Kleiman's\ntheorem [Laz04, Thm. 1.4.9] shows\n\nc1 (L )dim Yα c1 ((L ⊗ O(f )e )r ) * [Yα ] ≥ 0,\nor equivalently\n\u0011\n\u0010 0 \u0011dim Yα \u0010 0\nb\nc1 (L ⊗ OX (f ))|Yα ≥ 0.\nb\nc1 L |Yα\n\n(14)\n\n0\n\nOur precision in picking the metrics on L and Theorem 2.1(ii) show that\n\u0010 0 \u0011dim Yα \u0010 0\n\u0011\n\u0011\n\u0001dim Yα \u0010\nb\nc1 L |Yα\nb\nc1 (L ⊗ OX (f ))|Yα − b\nc1 L|Yα\nb\nc1 (L ⊗ OX (f ))|Yα\n≤ ε(dim Yα + 1) degL (Yα ).\nFrom (14) and (15) we now get\nhL (Yα ) + [k(v) : k](dim Yα + 1)\n\n=\n\n−1\n\nZ\n\nf dμYα ,L,v\n\u0011\n\u0001dim Yα \u0010\nb\nc1 L|Yα\nb\nc1 (L ⊗ OX (f ))|Yα\nXvan\n\n(dim Yα + 1) degL (Yα )\n36\n\n≥ −ε\n\n(15)\n\n\ffor all α ≥ α0 . Taking the limit over α ∈ A in this last expression and recalling hL (Yα ) → 0\nproves that\nZ\nε(d + 1)\n.\nlim inf\nf dμYα ,L,v ≥ −\nα∈A\n[k(v) : k]\nXvan\nFinally, ε is independent of f , so we conclude that\nZ\nlim inf\nf dμYα ,L,v ≥ 0.\nα∈A\n\n(16)\n\nXvan\n\nR\nThis last inequality holds for any model function f such that X an f dμL,v > 0. In order\nv\nto lift this restriction, we take an arbitrary model function f and consider the function\np\nR\nf1 = f − ρ, where ρ ∈ log |Kv× | = Q is such that X an f1 dμL,v > 0. Constant functions of\nv\nthis form are model functions, and so nf1 satisfies all of the necessary hypotheses to make\nthe above argument go through for some positive integer n. (We need nf1 to be the model\nfunction associated to a formal metric - not just the root of a formal metric.) Applying (16)\nto nf1 shows that\nZ\nlim inf\nf dμYα ,L,v ≥ ρ.\nα∈A\n\nLetting ρ →\n\nR\nXvan\n\nXvan\n\nf dμL,v from below preserves the positivity of the integral of f1 and shows\nZ\nZ\nlim inf\nf dμYα ,L,v ≥\nf dμL,v .\nα∈A\n\nXvan\n\nXvan\n\nFinally, we may replace f with −f in this argument to obtain the opposite inequality. The\nproof is now complete.\n\u0003\n5. Corollaries of the Equidistribution Theorem\nOur first corollary of the equidistribution theorem shows that for a dynamical system\n(X, φ, L), the invariant measures μφ,v reflect the v-adic distribution of the preperiodic points\nof the morphism φ. Recall that a closed point x ∈ X is called preperiodic if its (topological)\nforward orbit {φn (x) : n = 1, 2, . . .} is a finite set.\nCorollary 5.1. Let (X, φ, L) be an algebraic dynamical system over the function field K.\nFor any generic net of preperiodic closed points (xα )α∈A in X and any place v, we have the\nfollowing weak convergence of measures on Xvan :\nX\n1\nlim\ndegv (y)δy = μφ,v .\nα∈A deg(xα )\ny∈Ov (xα )\n\nProof. This is immediate from Theorem 1.1 upon noting that preperiodic points have dynamical height zero (Theorem 3.2(iv)).\n\u0003\n37\n\n\fThe preceding corollary is meaningless unless we can find generic nets of preperiodic points.\nHowever, it is not difficult to show that preperiodic points in X(K) are Zariski dense in X.\nOnce Zariski density is established, it is not hard to construct a generic net of preperiodic\npoints by a diagonalization argument; for example, see the argument at the beginning of the\nproof of Corollary 5.2.\nIf E is a finite extension of K, we let [E : K]s be the separable degree of E over K. Write\n|X| for the set of closed points of a variety X.\nCorollary 5.2. Let (X, φ, L) be an algebraic dynamical system defined over the function\nfield K, let Y be any subvariety of X, and let n be a positive integer. Suppose there exists a\nplace v of K such that the support of the probability measure μY,φ,v on Xvan contains at least\nn + 1 points. Then there exists a positive number ε such that the set\nYn (ε) := {y ∈ |Y | : hφ (y) ≤ ε and [K(y) : K]s ≤ n}\nis not Zariski dense in Y .\nProof. If the theorem fails, then Yn (ε) is Zariski dense for each ε > 0. We begin by constructing a generic small net. Let A be the collection of all ordered pairs (F, ε) consisting\nof a proper Zariski closed subset F of Y and a positive real number ε. Then A becomes a\ndirected set when we endow it with the partial ordering\n(F, ε) ≤ (F 0 , ε0 ) ⇐⇒ F ⊆ F 0 and ε ≥ ε0 .\nFor each pair (F, ε) ∈ A, select a point yF,ε ∈ Yn (ε) ∩ (Y r F ), a feat that is possible\nbecause Yn (ε) is Zariski dense. One checks easily that the net of points (yF,ε ) is generic and\nhφ (yF,ε ) → 0. For ease of notation, we now relabel this net as (yα )α∈A .\nLet p0 , . . . , pn be distinct points of Yvan in the support of μY,φ,v . By topological normality\nof analytic spaces associated to proper varieties [Ber90, Thm. 3.5.3], we can choose an open\nneighborhood Ui of pi for each i with pairwise disjoint closures. Fix an index i0 . Inside Ui0 ,\nchoose a compact neighborhood W of pi0 . By Urysohn's lemma we may find a continuous\nfunction f : Xvan → [0, 1] such that f |W ≡ 1 and f |Xvan rUi0 ≡ 0. Then Theorem 4.1 shows\nZ\nX\n1\nlim\ndegv (z)f (z) =\nf dμY,φ,v ≥ μY,φ,v (W ) > 0.\nα∈A deg(yα )\nXvan\nz∈Ov (yα )\n\nHence there exists α0 ∈ A such that Ov (yα ) ∩ Ui0 6= ∅ for all α ≥ α0 . Repeating this\nargument for each index i, we can find α1 ∈ A so that for any i = 0, . . . , n and α ≥ α1 , we\nhave Ov (yα ) ∩ Ui 6= ∅.\nFor each point yα , the set Ov (yα ) consists of at most n points by Corollary 6.2 in the\nappendix. But the n + 1 sets Ui are disjoint by construction, so we have a contradiction. \u0003\n38\n\n\fWhen hφ (Y ) > 0, the last corollary can be proved using the Theorem of Successive Minima\nwith ε = hφ (Y )/2. We recall the statement of the theorem and indicate how this works. Let\nY be a variety defined over the function field K, and let L be a semipositive metrized line\nbundle on Y with ample underlying bundle L. Define the quantity\n\u001a\n\u001b\ne1 (Y, L) =\nsup\ninf hL (y) ,\nV ⊂Y\ncodim(V,Y )=1\n\ny∈|Y rV |\n\nwhere the supremum is over all closed subsets V of Y of pure codimension 1, and the infimum\nis over closed points of Y r V . The Theorem of Successive Minima tells us that\ne1 (Y, L) ≥ hL (Y ).\nThis inequality was originally discovered by Zhang when K is replaced by a number field\n[Zha95a, Thm. 5.2], and it was proved by Gubler when K is a function field [Gub07, Lem. 4.1].\nNow let L be the semipositive metrized line bundle associated to a dynamical system\n∼\n(X, φ, L) and an isomorphism θ : φ∗ L → Lq . By the Theorem of Successive Minima, given\nany δ > 0 there exists a closed codimension-1 subset V ⊂ Y so that\ninf{hφ (y) : y ∈ |Y r V |} > hφ (Y ) − δ.\nIf hφ (Y ) > 0, then we may take δ = hφ (Y )/2. The corollary follows immediately with\nε = hφ (Y )/2 since Yn (ε) ⊂ V . In fact, this shows that ∪n≥1 Yn (ε) is not Zariski dense in Y\nwhen hφ (Y ) > 0.\nCorollary 5.3. Let (X, φ, L) be an algebraic dynamical system over the function field K,\nlet Y be any subvariety, and let n be a positive integer. Suppose there exists a place v of K\nsuch that the support of the probability measure μY,φ,v on Xvan contains at least n + 1 points.\nThen the set of preperiodic closed points contained in Y of separable degree at most n over\nK is not Zariski dense in Y .\nThe problem with these last two results is that one must have some knowledge of the\nsupport of the measure μY,φ,v in order to utilize them. As we indicated at the end of\nsection 3.3, the support of the measure μφ,v is precisely one point if X is smooth and the\ndynamical system (X, φ, L) has good reduction at the place v. So we cannot apply the\ncorollaries in the case of good reduction.\nWe expect a converse to be true. Suppose that X is geometrically connected and smooth\nover K (e.g., the projective space PdK ). If E is a finite extension of K and v is a place of K,\nwe say that the dynamical system (X, φ, L) has potential good reduction at v if there exists\na place w of E lying over v so that the base-changed dynamical system (XE , φE , L ⊗ E) has\ngood reduction at w. If (X, φ, L) does not have potential good reduction at v, then it has\ngenuinely bad reduction at v. With these definitions in mind, we present the following folk\n39\n\n\fconjecture which, when combined with Corollaries 5.2 and 5.3, would yield very pleasing\narithmetic results:\nConjecture 5.4. Let (X, φ, L) be a dynamical system defined over the function field K, and\nsuppose X is smooth and geometrically connected. Then the support of the measure μφ,v is\neither a single point or else Zariski dense corresponding to the cases where (X, φ, L) has\npotential good reduction or genuinely bad reduction.\nThe conjecture is true when X is a curve. See for example the manuscript of Baker and\nRumely [BR08, §10.4] for the case X = P1K . (Compare the article [Bak08] of Baker for a\nsimilar statement and arithmetic consequence.) In [Gub07] Gubler's work shows that if X\nis an abelian variety with totally degenerate reduction at a place v, then μφ,v has Zariski\ndense support. For an elliptic curve, totally degenerate reduction is the same as genuinely\nbad reduction. In fact, in this case there is a topological subspace of Xvan homeomorphic to\na circle in such a way that μφ,v is a Haar measure on this circle.\n6. Appendix\nProposition 6.1. Let K be a field that is finitely generated over its prime field. Let E\nbe a finite extension of K, v a discrete valuation of K, and Kv the completion of K with\nrespect to v. Then there are at most [E : K]s valuations w extending v to E, and if Ew\nis the completion of E with respect to the valuation w, then there exists an isomorphism of\nKv -algebras\nY\nKv ⊗K E ∼\nEw .\n=\nw|v\n\nProof. If E is a separable extension of K, this is proved in [CF67, II.9-10]. Any algebraic\nextension can be decomposed as K ⊂ E s ⊂ E, where E s is the separable closure of K\nin E, and E/E s is a purely inseparable extension. By tensoring first up to the separable\nclosure, we may apply the result in the separable case and reduce to the situation where\nE/K is a purely inseparable extension. Thus we may suppose K has positive characteristic\np. It now suffices to show that the valuation v extends in exactly one way to E, and that\nKv ⊗K E ∼\n= Ew holds. To that end, we may even reduce to the case where E is a simple\nnontrivial extension of K; i.e., there is γ ∈ E r K such that E = K(γ).\nWe first argue Kv ⊗K E is a field. The valuation ring Ov ⊂ K, being the localization of an\nalgebra of finite type over Fp , is a G-ring [Mat89, §32]. Hence Ov → Ov∧ = Kv◦ is a regular\nhomomorphism, which implies Kv = Frac(Kv◦ ) is geometrically regular over K = Frac(Ov ).\nIn particular, Kv ⊗K E is a reduced ring.\nOn the other hand, as E is a simple purely inseparable extension of K, we may write\nn\nn\nE = K[x]/(f (x)) for some irreducible polynomial f (x) = xp − a = (x − γ)p , some positive\n40\n\n\finteger n, a ∈ K and γ ∈ E r K. Evidently Kv ⊗K E = Kv [x]/(f (x)) is reduced if and\nonly if γ 6∈ Kv . Thus f (x) is irreducible over Kv and Kv ⊗K E is a field. Note that it is the\n(unique) minimal extension of Kv containing E.\nIf F is any finite extension of Kv , then F inherits a unique extension of the valuation v\nand is complete with respect to the extended valuation. Therefore Kv ⊗K E is a complete\nfield under the unique extension of v. Let w be the restriction of the extended valuation to\nE ⊂ Kv ⊗K E. By continuity the completion Ew injects canonically into Kv ⊗K E, and since\nKv ⊗K E is the minimal extension of Kv containing E, we must have Ew = Kv ⊗K E. We\nhave already mentioned that v extends uniquely to Kv ⊗K E, so the proof is complete. \u0003\nCorollary 6.2. Let X be a variety over the function field K as in previous sections. If\nx ∈ |X| is a closed point, v is a place of K and ψ : XKv → X is the base change morphism,\nthen there are at most [K(x) : K]s points in ψ −1 (x), and\nX\n[K(x) : K] =\n[Kv (y) : Kv ].\ny∈ψ −1 (x)\n\nProof. The ring of functions on the scheme-theoretic fiber ψ −1 (x) is Kv ⊗K K(x). Use\nProposition 6.1 and compute dimensions over Kv .\n\u0003\nReferences\n[Bak08] Matthew Baker. A finiteness theorem for canonical heights attached to rational maps over function\nfields. arXiv:math/0601046v2, to appear in J. Reine Angew. Math., 2008.\n[BD01] Jean-Yves Briend and Julien Duval. Deux caractérisations de la mesure d'équilibre d'un endomorphisme de Pk (C). Publ. Math. Inst. Hautes Études Sci., (93):145–159, 2001.\n[Ber90] Vladimir G. Berkovich. Spectral theory and analytic geometry over non-Archimedean fields, volume 33 of Mathematical Surveys and Monographs. American Mathematical Society, Providence,\nRI, 1990.\n[Ber94] Vladimir G. Berkovich. Vanishing cycles for formal schemes. Invent. Math., 115(3):539–571, 1994.\n[BG06] Enrico Bombieri and Walter Gubler. Heights in Diophantine geometry, volume 4 of New Mathematical Monographs. Cambridge University Press, Cambridge, 2006.\n[BGS95] S. Bloch, H. Gillet, and C. Soulé. Non-Archimedean Arakelov theory. J. Algebraic Geom., 4(3):427–\n485, 1995.\n[BH05] Matthew H. Baker and Liang-Chung Hsia. Canonical heights, transfinite diameters, and polynomial\ndynamics. J. Reine Angew. Math., 585:61–92, 2005.\n[BL93] Siegfried Bosch and Werner Lütkebohmert. Formal and rigid geometry. I. Rigid spaces. Math. Ann.,\n295(2):291–317, 1993.\n[BR06] Matthew H. Baker and Robert Rumely. Equidistribution of small points, rational dynamics, and\npotential theory. Ann. Inst. Fourier (Grenoble), 56(3):625–688, 2006.\n[BR08] Matthew Baker and Robert Rumely. Potential theory on the Berkovich projective line.\nhttp://www.math.gatech.edu/~mbaker/pdf/NewBerkBook_111008.pdf, manuscript, 2008.\n[CF67] J. W. S. Cassels and A. Fröhlich, editors. Algebraic number theory. Proceedings of an instructional\nconference organized by the London Mathematical Society (a NATO Advanced Study Institute)\nwith the support of the Inter national Mathematical Union. Edited by J. W. S. Cassels and A.\nFröhlich. Academic Press, London, 1967.\n[CL06] Antoine Chambert-Loir. Mesures et équidistribution sur les espaces de Berkovich. J. Reine Angew.\nMath., 595:215–235, 2006.\n41\n\n\f[CLT08] Antoine Chambert-Loir and Amaury Thuillier. Mesures de Mahler et équidistribution logarithmique. arXiv:math/0612556v2 [math.NT], to appear in Ann. Inst. Fourier (Grenoble), 2008.\n[Con99] Brian Conrad. Irreducible components of rigid spaces. Ann. Inst. Fourier (Grenoble), 49(2):473–\n541, 1999.\n[Fak03] Najmuddin Fakhruddin. Questions on self maps of algebraic varieties. J. Ramanujan Math. Soc.,\n18(2):109–122, 2003. He proves that every dynamical system embeds in projective space.\n[FRL06] Charles Favre and Juan Rivera-Letelier. Équidistribution quantitative des points de petite hauteur\nsur la droite projective. Math. Ann., 335(2):311–361, 2006.\n[FRL07] Charles Favre and Juan Rivera-Letelier. Corrigendum to: \"Quantitative uniform distribution of\npoints of small height on the projective line\" (French) [Math. Ann. 335 (2006), no. 2, 311–361;\nmr2221116]. Math. Ann., 339(4):799–801, 2007.\n[Ful98] William Fulton. Intersection theory, volume 2 of Ergebnisse der Mathematik und ihrer Grenzgebiete.\n3. Folge. A Series of Modern Surveys in Mathematics [Results in Mathematics and Related Areas.\n3rd Series. A Series of Modern Surveys in Mathematics]. Springer-Verlag, Berlin, second edition,\n1998.\n[Gub97] Walter Gubler. Heights of subvarieties over M -fields. In Arithmetic geometry (Cortona, 1994),\nSympos. Math., XXXVII, pages 190–227. Cambridge Univ. Press, Cambridge, 1997.\n[Gub98] Walter Gubler. Local heights of subvarieties over non-Archimedean fields. J. Reine Angew. Math.,\n498:61–113, 1998.\n[Gub03] Walter Gubler. Local and canonical heights of subvarieties. Ann. Sc. Norm. Super. Pisa Cl. Sci.\n(5), 2(4):711–760, 2003.\n[Gub07] Walter Gubler. The Bogomolov conjecture for totally degenerate abelian varieties. Invent. Math.,\n169(2):377–400, 2007.\n[Gub08] Walter Gubler. Equidistribution over function fields. arXiv:0801.4508v1, to appear in\nManuscripta Math., 2008.\n[Laz04] Robert Lazarsfeld. Positivity in algebraic geometry. I, volume 48 of Ergebnisse der Mathematik und\nihrer Grenzgebiete. 3. Folge. A Series of Modern Surveys in Mathematics [Results in Mathematics\nand Related Areas. 3rd Series. A Series of Modern Surveys in Mathematics]. Springer-Verlag,\nBerlin, 2004. Classical setting: line bundles and linear series.\n[Mat89] Hideyuki Matsumura. Commutative ring theory, volume 8 of Cambridge Studies in Advanced Mathematics. Cambridge University Press, Cambridge, second edition, 1989. Translated from the Japanese by M. Reid.\n[Pet07] Clayton Petsche. Non-archimedean equidistribution on elliptic curves with global applications.\narXiv:0710.3957v2, preprint, 2007.\n[Sil07]\nJoseph H. Silverman. The arithmetic of dynamical systems, volume 241 of Graduate Texts in\nMathematics. Springer, New York, 2007.\n[SUZ97] L. Szpiro, E. Ullmo, and S. Zhang. Équirépartition des petits points. Invent. Math., 127(2):337–347,\n1997.\n[Yua08] Xinyi Yuan. Big line bundles over arithmetic varieties. Invent. Math., 173(3):603–649, 2008.\n[Zha95a] Shou-wu Zhang. Positive line bundles on arithmetic varieties. J. Amer. Math. Soc., 8(1):187–221,\n1995.\n[Zha95b] Shou-wu Zhang. Small points and adelic metrics. J. Algebraic Geom., 4(2):281–300, 1995.\nX.W.C. Faber, Department of Mathematics and Statistics, McGill University, 805 Sherbrooke Street West, Montreal, QC H2M 1X9, CANADA\nE-mail address: xander@math.mcgill.ca\n\n42\n\n\f"}