{"id": "http://arxiv.org/abs/1101.4630v1", "guidislink": true, "updated": "2011-01-24T19:30:34Z", "updated_parsed": [2011, 1, 24, 19, 30, 34, 0, 24, 0], "published": "2011-01-24T19:30:34Z", "published_parsed": [2011, 1, 24, 19, 30, 34, 0, 24, 0], "title": "The proton momentum distribution in strongly H-bonded phases of water; a\n  critical test of electrostatic models", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.5002%2C1101.0571%2C1101.1459%2C1101.0749%2C1101.3896%2C1101.3565%2C1101.0291%2C1101.1728%2C1101.4188%2C1101.5502%2C1101.0120%2C1101.1646%2C1101.5448%2C1101.5947%2C1101.2719%2C1101.5090%2C1101.0263%2C1101.1860%2C1101.5659%2C1101.1460%2C1101.4144%2C1101.5703%2C1101.5075%2C1101.2386%2C1101.0906%2C1101.0209%2C1101.5485%2C1101.4007%2C1101.0511%2C1101.3597%2C1101.5608%2C1101.1669%2C1101.3663%2C1101.0431%2C1101.4880%2C1101.3777%2C1101.0296%2C1101.0087%2C1101.5857%2C1101.5725%2C1101.3410%2C1101.5676%2C1101.1483%2C1101.6038%2C1101.0108%2C1101.5482%2C1101.3673%2C1101.4902%2C1101.2008%2C1101.3495%2C1101.0855%2C1101.5267%2C1101.5322%2C1101.2358%2C1101.2296%2C1101.0908%2C1101.2923%2C1101.4452%2C1101.3136%2C1101.0751%2C1101.0670%2C1101.0678%2C1101.5132%2C1101.4778%2C1101.0035%2C1101.1294%2C1101.0531%2C1101.1687%2C1101.4888%2C1101.2587%2C1101.0829%2C1101.0795%2C1101.3109%2C1101.4927%2C1101.0799%2C1101.0241%2C1101.0967%2C1101.4288%2C1101.1559%2C1101.0043%2C1101.5041%2C1101.2336%2C1101.1046%2C1101.4603%2C1101.3728%2C1101.0533%2C1101.3132%2C1101.1781%2C1101.0313%2C1101.4905%2C1101.2856%2C1101.4621%2C1101.1056%2C1101.5226%2C1101.5218%2C1101.2137%2C1101.0257%2C1101.4718%2C1101.4119%2C1101.5405%2C1101.4630&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The proton momentum distribution in strongly H-bonded phases of water; a\n  critical test of electrostatic models"}, "summary": "Water is often viewed as a collection of monomers interacting\nelectrostatically with each other. We compare the water proton momentum\ndistributions from recent neutron scattering data with those calculated from\ntwo electronic structure based models. We find that below 500 K the\nelectrostatic models are not able to even qualitatively account for the sizable\nvibrational zero-point contribution to the enthalpy of vaporization. This\ndiscrepancy is evidence that the change in the proton well upon solvation\ncannot be entirely explained by electrostatic effects alone.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.5002%2C1101.0571%2C1101.1459%2C1101.0749%2C1101.3896%2C1101.3565%2C1101.0291%2C1101.1728%2C1101.4188%2C1101.5502%2C1101.0120%2C1101.1646%2C1101.5448%2C1101.5947%2C1101.2719%2C1101.5090%2C1101.0263%2C1101.1860%2C1101.5659%2C1101.1460%2C1101.4144%2C1101.5703%2C1101.5075%2C1101.2386%2C1101.0906%2C1101.0209%2C1101.5485%2C1101.4007%2C1101.0511%2C1101.3597%2C1101.5608%2C1101.1669%2C1101.3663%2C1101.0431%2C1101.4880%2C1101.3777%2C1101.0296%2C1101.0087%2C1101.5857%2C1101.5725%2C1101.3410%2C1101.5676%2C1101.1483%2C1101.6038%2C1101.0108%2C1101.5482%2C1101.3673%2C1101.4902%2C1101.2008%2C1101.3495%2C1101.0855%2C1101.5267%2C1101.5322%2C1101.2358%2C1101.2296%2C1101.0908%2C1101.2923%2C1101.4452%2C1101.3136%2C1101.0751%2C1101.0670%2C1101.0678%2C1101.5132%2C1101.4778%2C1101.0035%2C1101.1294%2C1101.0531%2C1101.1687%2C1101.4888%2C1101.2587%2C1101.0829%2C1101.0795%2C1101.3109%2C1101.4927%2C1101.0799%2C1101.0241%2C1101.0967%2C1101.4288%2C1101.1559%2C1101.0043%2C1101.5041%2C1101.2336%2C1101.1046%2C1101.4603%2C1101.3728%2C1101.0533%2C1101.3132%2C1101.1781%2C1101.0313%2C1101.4905%2C1101.2856%2C1101.4621%2C1101.1056%2C1101.5226%2C1101.5218%2C1101.2137%2C1101.0257%2C1101.4718%2C1101.4119%2C1101.5405%2C1101.4630&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Water is often viewed as a collection of monomers interacting\nelectrostatically with each other. We compare the water proton momentum\ndistributions from recent neutron scattering data with those calculated from\ntwo electronic structure based models. We find that below 500 K the\nelectrostatic models are not able to even qualitatively account for the sizable\nvibrational zero-point contribution to the enthalpy of vaporization. This\ndiscrepancy is evidence that the change in the proton well upon solvation\ncannot be entirely explained by electrostatic effects alone."}, "authors": ["C. J. Burnham", "G. F. Reiter", "T. Hayashi", "S. Mukamel", "R. L. Napoleon", "T. Keyes"], "author_detail": {"name": "T. Keyes"}, "author": "T. Keyes", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.3649679", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1101.4630v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1101.4630v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.chem-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.chem-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1101.4630v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1101.4630v1", "arxiv_comment": null, "journal_reference": null, "doi": "10.1063/1.3649679", "fulltext": "The proton momentum distribution in strongly H-bonded phases of water; a critical\ntest of electrostatic models\nC. J. Burnham,1, a) G. F. Reiter,1 T. Hayashi,2 S. Mukamel,2 R. L. Napoleon,3 and T.\nKeyes3\n\narXiv:1101.4630v1 [physics.chem-ph] 24 Jan 2011\n\n1)\n\nPhysics Department, University of Houston, Houston,\n\nTexas 77004\n2)\n\nDepartment of Chemistry, University of California, Irvine,\n\nCalifornia 92697-2025\n3)\n\nDepartment of Chemistry, Boston University, Boston,\n\nMassachusetts 02215-2521\nWater is often viewed as a collection of monomers interacting electrostatically with\neach other. We compare the water proton momentum distributions from recent\nneutron scattering data with those calculated from two electronic structure based\nmodels. We find that below 500 K the electrostatic models are not able to even qualitatively account for the sizable vibrational zero-point contribution to the enthalpy of\nvaporization. This discrepancy is evidence that the change in the proton well upon\nsolvation cannot be entirely explained by electrostatic effects alone.\n\na)\n\nElectronic mail: christianjburnham@gmail.com\n\n1\n\n\f2\nI.\n\nINTRODUCTION\nA deep understanding of the physical and chemical properties of water in its liquid form is\n\nfundamental to the progress of atmospheric, biological and chemical sciences. Even though\nthe properties of this 'elementary' molecule have been the subject of intense research for\ndecades (and centuries), water has not yet yielded all its mysteries.\nFundamental to our understanding of the properties of water is a detailed description of\nthe H-bond energetics and how these intermolecular bonds are modified according to differing\nenvironments. Considerable effort has gone into characterizing these bonds.1 In order to\ndevelop a microscopic picture, it is useful to regard the covalently bonded O-H oscillators as\nprobes of the comparatively low frequency intermolecular (O-H–O) H-bonds in which they\nparticipate. Neutron Compton scattering is such a probe, providing a measurement of the\nmomentum distribution of the protons in the water.2\nThe momentum distribution, n(p) is a statistical average over single particle distributions,\nwith a shape determined by the shapes of the proton wells. The variations in n(p) with\nenvironment are a direct result of changes in the proton potential energy surface(PES), which\nin bulk water will be due to the perturbative effect of the solvating water molecules on the\nintramolecular PES. Measurement of the momentum distribution thus provides direct access\nto the changes in the PES upon solvation. That there are significant changes is well known.\nThe water OH stretch frequency in the bulk is redshifted by several hundred wavenumbers\nwith respect to the gas-phase, indicating a significant softening in the proton PES by the\nintermolecular interactions in the bulk. Identifying the intermolecular forces responsible for\nthis softening is still an open problem.\nIt seems reasonable to expect that intermolecular electrostatics accounts for much of the\nsoftening, but just how much is not known. Several studies\n\n3–5\n\nhave convincingly demon-\n\nstrated that there is a strong (though not necessarily linear) correlation between the intermolecular electric field and the OH stretch frequency in bulk water/ice. It remains an open\nquestion whether intermolecular electrostatics alone are sufficient to explain the softening in\nthe OH stretch. This has proven difficult to answer, in part because of the lack of accurate\n(geometry dependent) electrostatic models for water, though a promising start has been\nrecently made in that direction.6,7\nThe first attempt to simulate the momentum distribution of protons in ice Ih was per-\n\n\fThe proton momentum distribution... 30 May 2018\n\n3\n\nformed by Burnham et al 6 who developed a normal-mode path-integral molecular dynamics\nalgorithm for evaluating the reduced one-body density matrix elements ρ(r, r′ ). The Fourier\ntransform of this quantity being the particle momentum distribution. Simulations were performed on an ice-like water cluster using empirical water models. All of the water models\ngave similar differences to experiment. In particular, the models were found to overestimate the kinetic energy contribution from the stretch modes, suggesting that the models\noverestimate the stiffness along the stretch direction\nThis study was followed by the study of Morrone, Car et al 8 who used a 'staging'\nbased path-integral molecular dynamics technique with the flexible / non-polarizable SPCF2 water model of Lobaugh and Voth9 to find the proton distribution in ice Ih, ambient\nliquid water and super-critical water at 6730 K. Morrone et al working with a simple\nmodification of existing algorithms, used an approximation which appears to work very\nwell for water in which Nmol one body density matrices (on one proton per molecule) are\ncalculated per simulation. Consequently, their algorithm is Nmol times faster than 'serial\nmolecule' calculations without this approximation.\nThe empirical water model used by Morrone et al did not give any particular improvement in predictions for the momentum distributions over those of Burnham et al. However,\nMorrone and Car have recently reported\n\n10\n\na follow-up study, showing that momentum\n\ndistributions calculated from a Car-Parrinello\n\n11\n\nmolecular dynamics simulation using the\n\nBLYP functional gives much closer agreement with the experimental data for bulk ice and\nwater, whereas none of the empirical models have come close to reproducing the accuracy of\ntheir Car-Parrinello based calculations for the proton momentum distributions in water/ice.\nThough the Car-Parrinello results are impressive, it is important to note that almost all of\nthe exchange correlation functionals (including BLYP) being used in bulk-water simulations\nunderestimate the frequency of the OH stretch band in both the bulk12,13 and gas phases\n14,15\n\n. For instance, the bulk D2 O water/ice Car-Parrinello simulations of Chen et al\n\n16\n\nproduce infrared spectra which underestimate the experimental OD stretch frequency by\n≈ 300 cm−1 . The authors conclude that around 80 wavenumbers of this discrepancy is\ndue to artefacts associated with the fictitious mass, leaving around 220 cm−1 attributable\nto the approximate nature of the PBE functional used in the calculation. Unfortunately,\nquantization of the vibrational degrees of freedom is expected to increase the discrepancy,\nperhaps by another 50 cm−1 .\n\n\f4\n\nThe proton momentum distribution... 30 May 2018\n\nThe poor performance of commonly used functionals in reproducing the correct monomer\ndistortion energies in bulk simulation of water, as compared to the much more accurate\nCCSD(T) predictions for the single molecule PES, was recently critically examined by Santra\net al\n\n17\n\n. Consistent with previous studies, they found that both the BLYP18,19 and PBE20\n\nfunctionals significantly underestimate the stretch force constant. They also discovered that\nthe PBE0\n\n21\n\nhybrid functional does in fact seem capable of satisfactorily reproducing the\n\nvariation in the PES along the OH stretch coordinate; at least for distorted monomers. It\nshould be noted that the success of this functional was found to be at least partly due to\nfortuitous cancellation of errors in the exchange and correlation components (again compared\nto the CCSD(T) results).\nMost recently, Burnham et al 22 attempted to modify the electrostatics of the flexible/polarizable TTM2-F water model of Burnham et al\n\n23,24\n\nto create a more realistic proton\n\npotential. They argued (based on the study by Hermansson\n\n25\n\n) that a major factor in the\n\nsoftening of the OH stretch in the condensed phase is due to the geometry dependence of the\nOH bond polarizability. In nearly all polarizable water models the molecular polarizability\nis assumed independent of the molecular geometry. However electronic structure calculations demonstrate that the polarizability along the bond direction increases substantially as\nthe OH stretch is elongated, which acts to soften the proton potential and also increases\nthe bond dipole derivative in condensed phases. A parameterization of a water model that\nincorporated these effects was shown to produce a superior description of both the red-shift\nof the stretch band (reflecting a softening of the proton potential) and enhancement of the\nIR intensity (associated with the increased bond dipole-derivative) in agreement with experiment. However, this new model still overestimates the OH stretch, giving only a very\nminor improvement in the predicted momentum distribution with respect to experimental\ndata.\nThe experimental momentum distribution has yet to be reproduced by any of the empirical models. In this work we calculate the momentum distribution from an electronic\nstructure based-surface. This present study follows on from the work of Hayashi, Mukamel\net al\n\n26\n\nwho performed a computational study of the IR spectrum of HDO using a mixed\n\nQM/MM method. They first performed a simulation of the liquid using various empirical water models (polarizable and non-polarizable). The time-dependent electrostatic field\nabout each molecule was then characterized by coefficients in a Taylor series expansion in\n\n\fThe proton momentum distribution... 30 May 2018\n\n5\n\ndisplacements ∆r about each molecule's center of charge. The electronic structure response\nto a given (non-uniform) field was then characterized by a second Taylor series, this time of\nthe intramolecular potential energy surface (PES) and molecular dipole surface in vibrational\nnormal-mode coordinates expanded in terms of field components. Combining the two series\nallowed for an electronic structure calculation of the (time-dependent) vibrational PES due\nto the intermolecular field from surrounding (empirically modeled) water molecules. The\nnuclear Schrödinger eqn was then solved on the resulting potential energy surface to find\nthe vibrational eigenvalues and hence the 0 → 1 OH stretch transitions, which can then be\ncompared to the experimental IR spectra.\nIt was shown by Hayashi, Mukamel et al that their method gives an accurate representation of the position and line shape of the OH band in liquid HDO. However, in a\nsubsequent study27 of H2 O, a scaling factor of 2.2 was required in the fields in order to bring\nthe predicted and experimental OH frequency band into coincidence. Using the unscaled\nfield distribution, the model will underestimate the size of the observed redshift of the bulk\nOH stretch frequency with respect to the gas phase. This is consistent with the hypothesis\nthat whilst the redshift is strongly correlated with the intermolecular field, these fields are\nnot strong enough by themselves to account for all or even nearly all of the complete redshift.\nIn this work, we use two different, but related models for calculating the momentum\ndistribution in solvation. In both approaches electrostatic interactions are the only source of\nperturbation to the intramolecular PES of each water molecule. The results will be compared\nwith experimental neutron scattering data for water at different state points from 300K to\n673K. We find that the electrostatic interactions are insufficient to explain the softening of\nthe PES in the denser phases of water.\n\nII.\n\nMOMENTUM DISTRIBUTIONS\nIn this secion we will summarize a few properties of nuclear momentum distribution\n\nfunctions.\nThe experimental momentum distributions at the various state points covered in this\nwork are displayed in 1.\nAs motivation for the following, we have reproduced in 1 the experimentally determined momentum distributions of Pantalei et al for the various state points covered by this\n\n\f6\n\nThe proton momentum distribution... 30 May 2018\n\npresent study. Note the figure also includes a comparison to our earlier path-integral based\nsimulations which were performed using the TTM2-F water model of Burnham et al\n\n23,24\n\n.\n\nLet the probability of a particle possesing a momentum in the range p..p+dp be ρ(p)d3 p,\nwhere ρ(p) is the momentum distribution function. Equivalently, in terms of the wave vector\nk = p/h̄, we have ρ′ (k) = h̄3 ρ (p = h̄k).\nIt is useful to consider the harmonic limit, in which the momentum distribution becomes\na Gaussian ellipsoid ρg (k) = exp (−k.T.k/2) /((2π)3/2 |T|1/2 ), where the tensor T is defined\nP\n2\nby T =\nα=x,y,z α̂α̂/σα , with α̂ being the orthonormal ellipsoidal axes directions and\nσα2 = hkα2 i is the variance along the αth axis of the ellipsoid.\n\nThe observed n(p) of protons in bulk water/ice is generally close to a (prolate) Gaussian\nand can be usefully characterized by the sigmas σS > σT 1 ≈ σT 2 , where the stretch sigma\nσS is dominated by contributions from the OH stretch modes and the two transverse modes\nσT 1 , σT 2 are mostly due to motion in the bend and rotational modes of the waters.\nWe will focus on the isotropically averaged distribution functions n(k) = hρ(k)iφ,θ . Note\nthat the second moment of this function is related to the average kinetic energy per proton,\n\u0001R\nvia hK.E.i = h̄2 hk 2 i /2mp = h̄2 /2mp\n4πk 2 n(k)dk, where mp is the proton mass.\np\nFor an arbitrary distribution (i.e. non Gaussian) we define the RMS sigma σRM S = hσ 2 i\nP\nfrom hσ 2 i = 2mp hK.E.i /3h̄2 , which is defined so that hσ 2 i = (1/3) α=x,y,z σα2 for Gaussian\ndistributions.28\n\nThe variance of the proton momentum distribution along the stretch direction is almost\ncompletely determined by the ground state vibrational wave-function and is of a fundamentally quantum nature. Thus quantum methods are required to obtain the distribution.\nIn the ground state, the momentum distribution of the nth particle is given by\n1\nρn (kn ) =\n(2π)3\n\nZ\n\nD\nE\ne−iSn .kn D̂(Sn ) d3 Sn\nth\n\nwhere k̂n = −i∂/∂rn is the momentum operator for the n\n\n(1)\nD\n\nparticle, i.e. and D̂ (Sn )\n\u0010\n\u0011\nis the thermal (or trace) average of the displacement operator D̂(Sn ) = exp iSn .k̂n .\n\nE\n\nThe following strategy was used to obtain momentum distributions from the vibrational\n\nwavefunction. We solve the molecular wave-function in normal mode coordinates from which\nD\n\u0010\n\u0011E\nwe evaluate the one-body density matrix elements ρn (rn , r′n ) = hrn | exp −β Ĥ\n|r′ n i\nm6=n\n\nwhere the inner triangular brackets denote a trace average of the full density matrix ρ̂(β) =\n\n\fThe proton momentum distribution... 30 May 2018\n\n7\n\n\u0010\n\u0011\nexp −β Ĥ over all particles m 6= n. In our case, we are calculating properties for a single\n\nproton from a molecular wavefunction- thus the trace average is taken over the remaining\nH and O nuclei of the molecule.\nThe trace average of the displacement operator is then given by the autocorrelation\nfunction\n\nD\n\nE\n\nD̂(Sn ) =\n\nZ\n\n\u0013\n\u0012\nSn 3\nSn\nd rn .\n, rn +\nρn rn −\n2\n2\n\n(2)\n\nFinally, from eqn. 1, the momentum distribution is obtained from Fourier transforming\nthe above trace average back to k space.\n\nIII.\n\nEVALUATING THE VIBRATIONAL WAVE-FUNCTION\n\nWe begin this section with a description of the two approaches we used for calculating\nthe vibrational wavefunctions. Although the first of the two methods below does not (in\nthis implementation) give excited state properties, there is practically no population in the\nvibrational mode excited states over the temperature range considered in this work (<1000\nK) and calculation of ground state properties alone suffices.\nThe section continues with a discussion of harmonic corrections which are used to account\nfor the fact that the nuclear wavefunction is solved in only a subspace of the complete set of\nmolecular modes. Finally, we briefly desribe how the momentum distributions were obtained\nfrom the resulting harmonic-corrected wave-function eigenvectors.\n\nA.\n\nTaylor Series approach\nIn the first approach, hereafter referred to as the Taylor series approach, the ground\n\nstate nuclear wave-function of a gas-phase molecule is calculated by solving the vibrational\nSchrödinger eqn.in normal mode coordinates on the Born-Oppenheimer surface obtained\nfrom electronic structure calculations. The eigenvector describing the nuclear ground-state\nwavefunction is then Taylor series expanded as a function of external field and field derivatives in order to characterize the electrostatic response of the molecule. Field distributions in\nthe condensed phases are taken from a molecular dynamics simulation in periodic boundary\n\n\f8\n\nThe proton momentum distribution... 30 May 2018\n\nconditions using an empirical force field for water. Taking together the calculated field distributions and the field response as characterized by the Taylor series expansion, this method\nallows us to calculate the nuclear ground-state wavefunction of a single water molecule in\nthe condensed phase.\nThe vibrational Schrödinger eqn. for a gas-phase molecule is solved in the space of\nits three vibrational modes (bend, symmetric, antisymmetric stretch) using product basis\nstates Πm φAm (qm ), where φAm (qm ) is a Hermite basis function for the mth normal mode.\nThe vibrational wavefunction for the ith energy level is then given by\n\nψ i (q1 , q2 , q3 ) =\n\nX\n\nCAi φA1 (q1 )φA2 (q2 )φA3 (q3 ),\n\n(3)\n\nA\n\nwhere CAi are the eigenvectors of the ith state, and the index A labels the triplet A =\n(A1, A2, A3).\nWe next expand the electrostatic potential φ(r) in a Taylor series about the center of\ncharge. Using the notation rα = α̂.r and Eαβ = −∂ 2 φ/∂rαX ∂rβX\n\nφ(rX + ∆r) − φ(rX ) = −\n\nX\n\nEα ∆rα\n\nα\n\n1X\nEαβ ∆rα ∆rβ + ...\n−\n2 α,β\n\n(4)\n\nFinally, the eigenvector coefficients are also Taylor expanded, as a power series in the\nfield terms\n\nCA = CA0 +\n\nX ∂CA\nj\n\n∂Ej\n\n∆Ej\n\n1 X ∂ 2 CA\n+\n∆Ej ∆Ek + ...,\n2 jk ∂Ej Ek\n\n(5)\n\nwhere the j index sums over all ∆E indices (∆Eα ,∆Eαβ etc.). ∆Ej = Ej − Ej0 and CA0\nindicates the value of CA at E = hEi where the average is taken over all molecules. The\nelectronic structure monomer field response is calculated with respect to a reference liquid\ngeometry and hEi are the average field components in the liquid.\n\n\fThe proton momentum distribution... 30 May 2018\nB.\n\n9\n\nMultipole-based approach\nIn the second approach, the Born Oppenheimer surface of the gas-phase molecule is writ-\n\nten as the sum of the intramolecular potential energy surface (as obtained in zero field) and\nthe electrostatic energy of the charge distribution in an inhomogeneous external field. The\nelectrostatic response of a molecule in a field is then characterized from the geometry dependent multipole and polarizability surfaces using the electronic-structure charge distribution.\nNext, a non-linear least-mean squares fit of a polarizable water-model is performed in order\nto best reproduce the geometry dependent electronic structure multipole and polarizability\nsurfaces.\nIn common with the Taylor-series method, the condensed phase molecular structures are\ntaken from molecular dynamics calculations. Here the vibrational Schrödinger equation is\nsolved on a potential energy surface using the above-mentioned least-mean-squares fit watermodel to calculate both the response of the molecule to the fields and the fields themselves.\nA six site water-model was used to fit the multipole surfaces. Three sites are located\non the nuclear sites and three are off-nuclear sites. Each nuclear site contains a permanent\ncharge, a permanent dipole and a dipole-induction site. In addition two charge-sites are\npositioned symmetrically above and below the plane of the molecule along the molecular\nbisector. Finally, there is an off-nuclear induction site placed in the plane of the molecule\nand along the molecular bisector.\nAll electrostatic parameters in the water model (atomic charges and dipoles and location\nof off-nuclear sites) depend on the intramolecular geometry defined by r1 , r2 , θ, where r1 , r2\nare the two OH distances and θ is half the HOH bond angle. Defining symmetry coordinates\n√\n√\nS1 = (r1 − r2 )/ 2 and S2 = (r1 + r2 )/ 2 each parameter is expanded in the power/Fourier\nseries\n\nBn (∆S1 , ∆S2 , θ) =\niX\nmax\n\ni kX\nmax\nX\n\nbn,i,j,k (∆S1 )j (∆S2 )j−i cos (kθ + αn )\n\n(6)\n\ni=0 j=0 k=0\n\nwhere Bn is the nth parameter and αn is a constant. The expansion for each parameter\nis taken only over terms consistent with the molecular symmetry.\nThe expansion terms are parameterized by minimizing the fitness function A (b) =\n\n\f10\n\nThe proton momentum distribution... 30 May 2018\nP\n\nm\n\nWm ǫm with respect to the expansion coefficients, where ǫm is the RMS error per tensor\n\nelement over all elements of the rank m (traceless) Cartesian multipole tensor and Wm are\n\nweighting coefficients, with larger weights assigned to the lower rank tensor elements.\nThe induction sites were fit to the gas-phase multipole polarizability surfaces, using a least\nmean squares fit to the gas-phase electronic-structure multipole moments in the presence of\na small field in the x, y and z directions.\nWe found that the potential energy surface using the self-consistent multipoles becomes\nunstable, heading to -∞ for extensions of the stretch coordinate by a few tenths of an\nAngstrom longer than the equilibrium value. This dipole-catastrophe occurs whenever the\ndistance between interacting point-multipole induction sites gets too close. In order to\nremedy this unphysical behavior, the intermolecular dipole-dipole interactions were damped\nat short range based on the modified dipole tensor scheme of Thole29 . Changes in the\ndamping function parameters result in large effects on the calculated vibrational frequencies\nand in our implementation, these funcions were empirically fit to reproduce the frequency\nof the stretch band in the IR spectrum of ice. We find strong discrepancies in the calculated\nproton momentum distribution despite the fact that the vibrational spectrum is substantially\ncorrect.\n\nC.\n\nHarmonic Corrections\nAs noted above, in the Taylor series approach, eigenvectors are expanded as a function\n\nof m = 3 vibrational modes (i.e. the two stretch modes and the bend), whereas those in\nthe multipole based approach are expanded in three vibrational and three rotational modes,\ni.e. m = 6 modes in full. In order to account for the fact that both approaches use only a\nsubset of the total complement of nine degrees of freedom per molecule, additional harmonic\ncorrections are made to account for the (9 − m) modes missing from each calculation. The\nmomentum distribution is calculated from the Fourier transform of the trace average of the\ndensity operator over the included anharmonic degrees of freedom multiplied by a Gaussian\ncorrection accounting for displacement along the missing molecular modes:\nD\n\nSn .T−1\nh .Sn\nD̂(Sn ) = D̂(Sn ) exp −\n2\nA\nE\n\nD\n\nE\n\n\u0012\n\n\u0013\n\n(7)\n\nwhere < ... >A indicates an average over the included anharmonic degrees of freedom and\n\n\f11\n\nThe proton momentum distribution... 30 May 2018\n\nT−1\nh is a temperature dependent tensor obtained from a harmonic analysis in which estimates\nwere used for the harmonic frequencies of the missing modes. For the multipole model the\ntensor includes contributions from the three translational modes only, with the harmonic\nfrequencies assigned to be ωtrans =250cm−1 . In the Taylor-series based approach, only the\nvibrational degrees of freedom are accounted for and so harmonic corrections were required\nfor both the three librational and three translational modes. For this model, estimates for\nthe (temperature and density dependent) harmonic rotational frequencies were taken from\ncalculated IR spectra using the multipole-based model.\n\nD.\n\nCalculation of the momentum distribution\nFinally, the momentum distribution was calculated from the eigenvectors of the vibra-\n\ntional wavefunction as follows.\nThe autocorrelation function of the single particle density matrix (see eqn. 2) was calculated in the harmonic oscillator basis using the known relation for the autocorrelation of a\nHermite function in terms of associated Laguerre polynomials, e.g. see ref.\n\n30\n\n(Appendix B).\n\nThe resulting autocorrelation was then numerically Fourier transformed to give the single\nparticle momentum distribution (see eqn. 1) and the final momentum distribution is taken\nto be the average over single particle momentum distributions.\n\nIV.\n\nMODEL PARAMATERIZATION AND SIMULATION DETAILS\n\nAll simulations used 128 molecules in periodic boundary conditions at experimental densities. Momentum distributions in the bulk were calculated using intermolecular geometries obtained from 'snapshots' of molecular dynamics path integral simulations in periodic\nboundary conditions using the TTMF-4 water model. As has been previously shown,31 this\nmodel gives reasonable agreement with the experimentally determined structures over the\ntemperature/density range to be covered in this present work.\nThe path-integral simulations were used only to generate reasonable configurations representative of equilibrium structures and were not particularly computationally intensive,\nwith the equilibration requiring only a few hours of CPU time per state point.\n\n\fThe proton momentum distribution... 30 May 2018\nA.\n\n12\n\nThe Taylor-series approach\nThis model was parameterized using MP2/6-31+G(d,p) electronic structure data.\nThe Taylor series approach requires intermolecular field distributions provided from an\n\nelectrostatic model of the solvent molecules. We chose the TIP3P-F water model for this\npurpose because it was found to give similar field distributions to those used in the original\nstudy of Hayashi, Mukamel et al. The intermolecular electrostatics of this model are\nobtained using static charges placed on the nuclear sites, with qO = −2qH = −0.834|e|.\nIn determining the electronic-structure electrostatic response the local field at each expansion center was expanded up to fourth order (i.e. terms including Eαβγδ ). The wave-function\nexpansion coefficients CA were expanded up to second order in ∆Ej (see eqn. 5). A total\nof 35 CA coefficients (A1 + A2 + A3 ≤ 4) were used in the expansion of the ground state\nwavefunction of eqn. 3.\nThe electric fields were calculated via standard Ewald sum expressions. Gradients and\nhigher order derivatives of the field were calculated using a finite difference method using as\ninput the field evaluated at grid points around the field expansion center.\n\nB.\n\nThe multipole based approach\nThe multipole-based model was parameterized using RMP4/aug-cc-pvdz electronic struc-\n\nture data obtained using the Gaussian 03 code.32\nThe parameters were expanded up to a 6th order polynomial (imax = 6) in ∆S1 , ∆S2 ,\nwith six Fourier coefficients over θ, fit to reproduce 1500 geometries covering the range\n900 ≤ θHOH ≤ 1300 and 900 ≤ rH1 , rH2 ≤ 1300 .\nThe fit resulted in accurate reproduction of the geometry-dependent electronic structure\nmultipole surfaces up to rank-3 (octapole). The parameter set and FORTRAN code to run\nthe model is available by request from the corresponding author.\nThe polarizabile multipoles on each molecule are solved iteratively for each different\narrangement of nuclear coordinates, ensuring that the system remains at all times on the\nelectrostatic self-consistent surface.\nObtaining self-consistent multipoles across all molecules makes this approach far more\nexpensive than the Taylor-series approach. In order to reduce costs, a simple real-space\n\n\fThe proton momentum distribution... 30 May 2018\n\n13\n\nspherical cut-off was used for calculating electrostatic interactions, with a radius equal to\nhalf the shortest axis of the periodic simulation cell.\nThe multipole model uses Partridge and Schwenke's accurate intramolecular surface33 for\neach monomer. Thus, the multipole model becomes identical to the Partridge Schwenke\nmodel in the gas-phase.\nThe wavefunction was calculated from scanning over three vibrational and three rotational\nmodes per molecule. Performing a full 6-dimensional scan would be quite slow and so\nfollowing Jung and Gerber34 , a many-body approximation was employed in which only\ntwo body terms are retained, reducing the calculation to a more managable set of 6 ×\n5/2 = 15 scans per molecule. The wavefunction is then solved for by first calculating the\nvibrational self-consistent field (VSCF) solution35 in the 6D space. This results in a product\nV SCF\nwavefunction ψm\n(q1 , ..., q6 ) = φm1 (q1 )φm2 (q2 )...φm6 (q6 ) with ψ0V SCF giving the optimal\n\nsingle product ground state. The final wavefunction is then solved using a configuration\ninteraction in which the reduced Hamiltonian Hm,m′ = hm|H|m′ i is diagonalized, where\nP\nHm,m′ is formed from states m with i mi ≤ 4 leading to matrix sizes of ≈ 6500 × 6500.\nAltogether it takes ≈ 40 minutes to calculate the momentum distribution for one particle,\n\nwith the diagonalization stage being by far the most time-consuming part of the calculation.\n\nV.\n\nRESULTS\nThe calculated and experimental31 RMS sigmas σRM S for the set of temperature/density\n\nstate points are displayed in 2 as a function of temperature. At each temperature value we\nhave also plotted calculated values for the gas-phase momentum distributions.\nThe bulk values for σRM S are seen to approach the corresponding gas-phase values for\nT ≥ 500 K. In this high temperature region there appears to be practically no difference in\nthe kinetic energy between the bulk and gas-phases.\nThe observed approximate linear dependence with temperature of the predicted gasphase sigmas is due to the kB T /2 per degree of freedom kinetic energy in the near-classical\ntranslational and rotational modes. In the temperature range under study the gas-phase\nvibrational modes are nearly completely frozen out, having virtually no contribution to the\ntemperature dependence.\nThough the Taylor series and multipole-based approaches predict quite different absolute\n\n\f14\n\nThe proton momentum distribution... 30 May 2018\n\nvalues for σRM S , the two show very similar trends as a function of temperature. Most of\nthe difference between models appears to be due to their different gas-phase asymptotes,\nwith the Taylor-series approach predicting a slightly larger value for the gas phase σRM S at\neach temperature. Presumably this is due to the different intramolecular surfaces used in\nthe two models, with the gas-phase asymptote of the Taylor series model being given by\nMP2/6-31+G(d,p) electronic structure vs. the somewhat more accurate Partridge-Schwenke\ngas-phase surface incorporated into the multipole based model.\nThe multipole-based approach is in excellent agreement with the experimentally determined sigmas at high temperatures, T≥ 500 K. As the temperature is lowered, the curves\ndiverge, with the experimental σRM S showing a steeper drop than predicted by either of\nthe simulation approaches. At 300 K the discrepancy between the predicted and observed\nkinetic energies is 0.35 kcal/mol per proton, or 0.7 kcal/mol per molecule. This discrepancy\nbetween simulation and experiment accounts for ≈ 7% of the 9.7 kcal/mol per molecule\nenthalpy of vaporization, ∆H = H (g) − H (s) at 300K.\n\nFurthermore, the simulations predict the wrong sign for the kinetic energy contribution\nto ∆H. Assuming that the gas-phase kinetic energies calculated using the high-quality\nPartridge-Shwenke intramolecular surface are correct, the experimental data shows that\nbelow 500 K, the kinetic energy per proton in the bulk lies below the gas-phase values (at\nthe same temperature), whereas simulation predicts the opposite behavior, with the average\nkinetic energy per proton in the bulk becoming larger than the corresponding gas-phase\nvalues at lower temperatures.\nThe increase in the simulated kinetic energy is due to hindered rotations in the bulk\nhaving a larger kinetic energy than in the gas-phase, where the molecules act as free rotors.\nA similar contribution is expected to be present in the experimental data, but this is evidently\nmore than cancelled out by the lowering in kinetic energy due to the softening in the stretch\nmodes.\nThe experimentally observed reduction in σRM S over the correspoinding values in the\ngas-phase indicates that the effective proton potential is substantially softened at low temperatures; a softening manifestly not reproduced by the electrostatic models.\nExperiment has been previously shown31 that most of the reduction in the proton mean\nkinetic energy is due to a lowering of the stretch sigma (σs ) values.\n\n3 shows simulation\n\nresults for this sigma as a function of temperature, extracted from the calculated momentum\n\n\fThe proton momentum distribution... 30 May 2018\n\n15\n\ndistribution using the multipole and Taylor-series methods. The individual sigmas were then\nobtained from the tensor of second moments Mαβ = hkα kβ i, which when diagonalized gives\neigenvectors α̂ with corresponding eigenvalues σα2 .\n\nAgain, though there is a sizable offset between values calculated from the multipole and\nTaylor-series approaches, both approaches result in near identical trends as a function of\ntemperature. The simulation shows a modest, but definite decrease in the stretch sigmas\nas the temperature is lowered. This reduction is due to a softening of the proton potential,\nin turn caused by the increasing strength of the intermolecular fields at lower temperatures\nand higher densities.\n\nVI.\n\nSUMMARY AND CONCLUSIONS\n\nIn this work we tested how accurately state of the art electrostatic models for water,\nwhich perform well for infrared spectra can reproduce the observed neutron scattering data\nfor the proton kinetic energy and momentum distribution in bulk water. Both models\nwere parameterized to reproduce high quality electronic structure data for the geometry\ndependent monomer electrostatics. However, two quite different modeling approaches were\nused in order to generate the nuclear wave-function from which the momentum distributions\nwere calculated.\nAlthough the two electrostatic models give qualitively similar results for trends in the\nkinetic-energy and momentum widths, neither was able to fully reproduce the observed\nexperimental trends. In contrast with experiment, both models predict the kinetic energy\nper proton increases in the strong H-bonding region. Even sophisticated electrostatic models\nfor water, such as the ones used in this work are unable to reproduce the correct sign in the\nproton kinetic energy contribution to the enthalpy change between the gas and condensed\nphases at the same temperature.\nThese results have important implications for all simulations requiring accurate bulk\nproperties of water. For a simulation to reproduce the experimental enthalpy difference (for\nthe right reasons), it must take into account the zero-point changes associated with the\nvibrational degrees of freedom. Several recent studies have examined the thermodynamic\nproperties of water using rigid-body path-integral calculations.36–40 Though cheaper than\na fully flexible path-integral simulation, such calculations obviously cannot account for the\n\n\f16\n\nThe proton momentum distribution... 30 May 2018\n\nrelatively sizeable changes discussed in this work associated in the proton kinetic energy contribution to the enthalpies. In this regard it is also worth mentioning the recent simulations\nof Hyeon-Deuk and Ando,41 who performed a wavepacket dynamics simulation of bulk liquid\nwater using a simple empirical flexible water model. They observed significant correlations\nbetween the wave-packet width of the proton with its H-bond coordination number, further confirming that quantization vibrational modes will affect the properties of the H-bond\nnetwork.\nEven larger discrepancies than those described above between the electrostatically interacting monomer model and experimental momentum distributions are found in water in\nconfined spaces. Neutron scattering studies from Kolesnikov, Reiter et al\n\n42,43\n\nhas shown\n\nthat water in carbon nanotubes displays a very sizeable( 30%) reduction in the zero-point\nkinetic energy of the protons relative to bulk water, consistent with the anomalously large\nDebye Waller factors also observed. Measurements of the momentum distribution in water confined in xerogel by Garbuio et al 44 show, on the other hand, large increases in the\nkinetic energy of the protons in the water near the surface, also unexplainable with the\nelectrostatically interacting monomer model.\nFinally, consider the possible reasons why the electrostatic models fail to predict the\nproton kinetic energy changes in the bulk. Given that the proton momentum distribution\nis a function of the vibrational potential energy surface, we are led to conclude that the\nintermolecular perturbation on the proton potential in bulk phases cannot be satisfactorily\nmodeled using classical electrostatics alone. As evidenced by comparison with experiment,\nthere appears to be an additional softening of the proton potential upon H-bond formation,\nbeyond that accounted for by intermolecular electrostatics.\nWhy do the electrostatic models underestimate the required softening in the OH stretch?\nThe most probable explanation is that these models either completely neglect or at best\nprovide only a crude estimate of intermolecular overlap effects between H-bonded molecules,\ni.e. in a molecular orbital description of the wavefunction, the orbitals of the donor and\nacceptor molecules have a non-negligable overlap, resulting in a total wavefunction that\ncannot be accurately approximated as the product of single-molecule contributions.\nOverlap effects can be usefully subdivided into various contributions. First, there is\ncharge-overlap/penetration term. The intermolecular energy of overlapping charge distributions differs from that predicted using traceless multipole-multipole interactions. Charge\n\n\fThe proton momentum distribution... 30 May 2018\n\n17\n\noverlap always makes the interaction energy more positive with respect to the traceless\nmultipole approximation (the difference in both the e-e and e-Z terms are also separately\npositive).\nSecond, there is the exchange contribution arising from the Pauli exclusion principal. The\nintermolecular contribution to the exchange energy is generally positive for an interaction\nbetween closed shell molecules.\nLastly, there is electron correlation, which can be defined as the difference between the\nexact solution to the electronic Hamiltonian with respect to the self-consistent field solution\nobtained using the Hartree Fock method. The correlation contribution causes modifications\nto both the electronic kinetic and potential (Ve−e and Ve−Z ) expectation values, producing\nan overall reduction in the total energy. The intermolecular contribution is also negative and\ntherefore correlation is the only one of the overlap effects expected to reduce the energy. Also,\ngiven that all of the overlap effects tend to increase with increasing overlap, the correlation\nterm should result in an overall softening in the stretch PES of protons participating in\nH-bonds.\nThe Taylor-series approach as implemented in this work neglects all overlap effects. The\nmultipole-based approach however incorporates the aforementioned short-range damping\nterm in the fields in order to prevent over-polarization of the induction sites. Given that the\ndamping functions attenuate the short-range (electrostatic) interactions, it seems plausible\nthat a suitable parameterization of these terms can help to at least partly mimic the effects\nof overlap on the PES. We should not expect that such a simple modification to the PES can\nprovide anything better than a crude approximation to the actual overlap effects present in\nthe intermolecular interaction. Indeed, we have seen that even when damping functions are\nincluded, the multipole model is not accurate enough to give qualitative agreement with the\nobserved kinetic energies.\nIt may be very difficult to modify existing electrostatic based models to account for the\nintermolecular overlap effects on the OH stretch PES in order that, upon quantization of\nthe nuclear coordinates, they be capable of reproducing the observed kinetic energy changes.\nAs things stand, it is doubtful whether any of the existing models are accurate enough to\neven qualitatively account for the environmentally dependent kinetic energy changes in the\nvibrational modes. Nevertheless, comparison of results against the experimentally determined proton momentum distributions provides an invaluable benchmark of both empirical\n\n\fThe proton momentum distribution... 30 May 2018\n\n18\n\nmodels and exchange-correlation functionals, which should help in the effort to create more\naccurate simulations where water is involved and further reveal the nature of the H-bond.\n\nVII.\n\nACKNOWLEDGEMENTS\n\nC. J. Burnham and G. F. Reiter acknowledge support by the DOE, Office of Basic Energy\nSciences under Contract No. DE-FG02-03ER46078.\nS. Mukamel gratefully acknowledges the support of the National Institutes of Health\n(Grant GM59230) and the National Science Foundation (Grant CHE- 0745892)\nAcknowledgment is made to the donors of the American Chemical Society Petroleum\nResearch Fund for partial support of this research by T. Keyes and R. Napoleon. T. Keyes\nacknowledges support of the National Science Foundation (Grant CHE 0848427).\n\n\fThe proton momentum distribution... 30 May 2018\n\n19\n\nFIG. 1. Radial proton momentum distribution at several measured temperatures compared with\npath-integral molecular dynamics calculations using an extended TTM2-F model. Error bars on\nthe lower temperature measurements have been omitted for clarity and are similar to those shown.\n(Figure reproduced from Pantalei et al 31 ).\n\n\f20\n\nThe proton momentum distribution... 30 May 2018\n\nExpt.\nTaylor series / field from TIP3P\nTaylor series/ field from multipole model\nTaylor series gas phase\nMultipole model\nMultipole model / gas phase\n\nσRMS, inverse Angstroms\n\n5.6\n\n5.4\n\n5.2\n\n5\n\n4.8\n0\n\n100\n\n200\n\n300\n400\nTemperature, K\n\n500\n\n600\n\n700\n\nFIG. 2. RMS values of the observed and calculated proton momentum distribution width. These\nwidths give directly the kinetic energy of the protons. The results are shown as a function of\ntemperature, with densities 0.9 gcm−3 at 50 and 269 K 1 gcm−3 at 300 K, 0.9 gcm−3 at 423 K,\n0.8 gcm−3 at 523 K, 0.7 gcm−3 at 573 K and 673 K. (Data reproduced from Pantalei et al.31 )\nThe curve labeled gas phase is calculated by including the temperature dependence of classical\nrotation and translation modes in the calculation of the total energy in addition to the kinetic\nenergy calculated for the vibrational modes of the isolated molecule.\n\n\f21\n\nThe proton momentum distribution... 30 May 2018\n8\n\nTaylor-series using TIP3P field, bulk\nTaylor-series using field from multi. model, bulk\nTaylor-series, gas-phase\nMultipole model, bulk\nMultipole model, gas phase\n\nσ s, inverse Angstroms\n\n7.8\n\n7.6\n\n7.4\n\n7.2\n\n7\n\n6.8\n0\n\n100\n\n200\n\n300\n400\nTemperature, K\n\n500\n\n600\n\n700\n\nFIG. 3. The stretch sigma values(momentum witdths) of the calculated proton momentum distributions at the same temperature/density points as in Fig 1.\n\nREFERENCES\n1\n\nE. Arunan, G. R. Desiraju, R. A. Klein, J. Sadlej, S. Scheiner, I. Alkorta, D. C. Clary,\nR. H. Crabtree, J. J. Dannenberg, P. Hobza, H. G. Kjaergaard, A. C. Legon, B. Mennucci,\nand D. J. Nesbitt. A provisional recimmendation for the definition of the hydrogen bond.\nSubmitted to IUPAC, 2010.\n\n2\n\nC. Andreani, D. Colognesi, J. Mayers, G. F. Reiter, and R. Senesi. The momentum\ndistribution of light ions and molecules using inelastic neutron scattering. Adv. Phys.,\n54:3777, 2005.\n\n3\n\nS. A. Corcelli, C. P. Lawrence, and J. L. Skinner. Combined electronic structureÕmolecular\ndynamics approach for ultrafast infrared spectroscopy of dilute HOD in liquid H2 O and\nD2 O. J. Chem. Phys., 120:8107, 2004.\n\n4\n\nJ. R. Schmidt, S. A. Corcelli, , and J. L. Skinner. Pronounced non-condon effects in the\nultrafast infrared spectroscopy of water. J. Chem. Phys., 123:044513, 2005.\n\n\fThe proton momentum distribution... 30 May 2018\n5\n\n22\n\nMathias P. Ljungberg, A. P. Lyubartsev, Anders Nilsson, and Lars G. M. Pettersson.\nAssessing the electric-field approximation to ir and raman spectra of dilute hod in d2 o. J.\nChem. Phys., 131:034501, 2009.\n\n6\n\nC. J. Burnham, G. F. Reiter, J. Mayers, T. Abdul-Redah, H. Reichert, and H. Dosch.\nOn the origin of the redshift of the OH stretch in Ice Ih: evidence from the momentum\ndistribution of the protons and the infrared spectral density. Phys. Chem. Chem. Phys.,\n8:3966, 2006.\n\n7\n\nP. Mankoo and T. Keyes. Polir: Polarizable, flexible, transferable water potential optimized for ir spectroscopy. J. Chem. Phys., 129(034504), 2008.\n\n8\n\nJ. A. Morrone, V. Srinivasan, D. Sebastiani, and R. Car. Proton momentum distribution\nin water: an open path integral molecular dynamics study. J. Chem. Phys., 126:234504,\n2007.\n\n9\n\nJ. Lobaugh and G. A. Voth. A quantum model for water: Equilibrium and dynamical\nproperties. J. Chem. Phys., 106:2400, 1997.\n\n10\n\nJ. A. Morrone and R. Car. Nuclear quantum effects in water. Phys. Rev. Lett., 101:017801,\n2008.\n\n11\n\nR. Car and M. Parrinello.\n\nUnified Approach for Molecular Dynamics and Density-\n\nFunctional Theory. Phys. Rev. Lett., 55:2471, 1985.\n12\n\nPier Luigi Silvestrelli, M. Bernasconi, and Michele Parrinello. Ab initio infrared spectrum\nof liquid water. Chem. Phys. Lett., 277:478, 1997.\n\n13\n\nRadu Iftimie and M. E. Tuckerman. Decomposing total ir spectra of aqueous systems into\nsolute and solvent contributions: A computational approach using maximally localized\nwannier orbitals. J. Chem. Phys, 122:214508, 2005.\n\n14\n\nW. Koch and M. C. Holthausen. A Chemist's Guide to Density Functional Theory. FVAFrankfurter Verlagsanstalt GmbH, 2001.\n\n15\n\nR. K. Campen and J. D. Kubicki.\n\nInteraction Energy and the Shift in OH Stretch\n\nFrequency on Hydrogen Bonding for the H2 O→H2 O, CH3 OH→H2 O, and H2 O→CH3 OH\ndimers. J. Comp. Chem., 2009.\n16\n\nW. Chen, Manu Sharma, Raffaele Resta, Giulia Galli, and Roberto Car. Role of dipolar\ncorrelations in the infrared spectra of water and ice. Phys. Rev. B, 77:245114, 2008.\n\n17\n\nBiswajit Santra, Angelos Michaelides, and Matthias Scheffler. Coupled cluster benchmarks\nof water monomers and dimers extracted from density-functional theory liquid water: The\n\n\fThe proton momentum distribution... 30 May 2018\n\n23\n\nimportance of monomer deformations. J. Chem. Phys., 131(124509), 2009.\n18\n\nA. Becke. Density-functional exchange-energy approximation with correct asymptotic behavior. Phys. Rev. A, 38:3098, 1988.\n\n19\n\nChengteh Lee, Weitao Yang, and Robert G. Parr. Development of the colle-salvetti\ncorrelation-energy formula into a functional of the electron density. Phys. Rev. B, 37:785,\n1988.\n\n20\n\nJ. P. Perdew, K. Burke, and M Ernzerhof. Generalized gradient approximation made\nsimple. Phys. Rev. Lett., 77:3865, 1996.\n\n21\n\nCarlo Adamo and Vincenzo Barone. Toward reliable density functional methods without\nadjustable parameters: The pbe0 model. J. Chem. Phys., 110:6158.\n\n22\n\nC. J. Burnham, G. Reiter, D. Anick, and P. K. Mankoo. The vibrational proton potential\nin bulk liquid water and ice, to be submitted, manuscript available on request. J. Chem.\nPhys., 128:154519, 2008.\n\n23\n\nC. J. Burnham and S. S. Xantheas. Development of transferable interaction models for\nwater. IV. A flexible, all-atom polarizable potential (TTM2-F) based on geometry dependent charges derived from an ab initio monomer dipole moment surface. J. Chem. Phys,\n116:5115, 2002.\n\n24\n\nG. S. Fanourgakis and S. S. Xantheas. The Flexible, Polarizable, Thole-Type Interaction\nPotential for Water (TTM2-F) Revisited. J. Phys. Chem. A., 110:4100, 2006.\n\n25\n\nK. Hermansson. Electric-field effects on the OH vibrational frequency and infrared absorption intensity for water. J. Chem. Phys., 99:861, 1993.\n\n26\n\nT. Hayashi, T. l. C. Jansen, W. Zhuang, and S. Mukamel. Collective Solvent Coordinates\nfor the Infrared Spectrum of HOD in D2O Based on an ab Initio Electrostatic Map. J.\nPhys. Chem. A., 109:64, 2005.\n\n27\n\nA. Paarmann, T. Hayashi, S. Mukamel, and R. J. D. Miller. Nonlinear response of vibrational excitons: Simulating the two-dimensional infrared spectrum of liquid water. J.\nChem. Phys., 130:204110, 2009.\n\n28\n\n2\nA useful conversion factor: To find the kinetic energy in kcal/mol, hK.E.i = 0.1434σRM\nS,\n\nwhere σRM S is measured in Å−1 .\n29\n\nB. T. Thole. Molecular Polarizabilities Calculated with a Modified Dipole Interaction.\nChem. Phys., 59:341, 1981.\n\n30\n\nK. E. Cahill and R. J. Glauber. Ordered expansions in boson amplitude operators. Phys.\n\n\fThe proton momentum distribution... 30 May 2018\n\n24\n\nRev., 177:1857, 1969.\n31\n\nC. Pantalei, A. Pietropaolo, R. Senesi, S. Imberti, C. Andreani, J. Mayers, C. Burnham,\nand G. Reiter. Proton momentum distribution of liquid water from room temperature to\nthe supercritical phase. Phys. Rev. Lett., 100:177801, 2008.\n\n32\n\nH. B. Schlegel et al M. J. Frisch, G. W. Trucks. Gaussian 03. Gaussian Inc., Wallingford\nCT, 2004.\n\n33\n\nH. Partridge and D. W. Schwenke. The determination of an accurate isotope dependent\npotential energy surface for water from extensive ab initio calculations and experimental\ndata. J. Chem. Phys., 106:4618, 1997.\n\n34\n\nJ. O. Jung and R. B. Gerber. Vibrational wave functions and spectroscopy of ( H2 O)n ,\nn=2,3,4,5: Vibrational self-consistent field with correlation corrections. J. Chem. Phys.,\n105:10332, 1996.\n\n35\n\nJ. M. Bowman. Self-consistent field energies and wavefunctions for coupled oscillators. J.\nChem. Phys., 68:608, 1978.\n\n36\n\nC. McBride, C. Vega, E. G. Noya, R. Ramı́rez, and L. M. Sesé. Quantum contributions\nin the ice phases: The path to a new empirical model for water-tip4pq/2005. J. Chem.\nPhys., 131:024506, 2009.\n\n37\n\nL. Hernández de la Peña and P. G. Kusalik. Quantum effects in light and heavy liquid\nwater: A rigid body centroid molecular dynamics study. J. Chem. Phys., 121:5992, 2004.\n\n38\n\nL. Hernández de la Peña, M. S. Gulam Razul, and P. G. Kusalik. Quantum effects in ice\nIh. J. Chem. Phys., 123:144506, 2005.\n\n39\n\nL. Hernández de la Peña and P. G. Kusalik. Temperature dependence of quantum effects\nin liquid water. J. Am. Chem. Soc., 127:5246, 2005.\n\n40\n\nL. Hernández de la Peña, M. S. Gulam Razul, and P. G. Kusalik. Impacts of quantization\non the properties of liquid water. J. Phys. Chem. A., 109:7236, 2005.\n\n41\n\nK. Hyeon-Deuk and K. Ando. Quantum effects of hydrogen atoms on the dynamical\nrearrangement of hydrogen-bond networks in liquid water. J. Chem. Phys., 132:164507,\n2010.\n\n42\n\nA. I. Kolesnikov, J-M Zanotti, C-K Loong, and C. J. Burnham. Anomalously soft dynamics\nof water in a nanotube: A revelation of nanoscale confinement. Phys. Rev. Lett., 93:035503,\n2004.\n\n43\n\nG. Reiter, C. J. Burnham, D. Homouz, P. M Platzman, J. Mayers, T. Abdul-Redah, A. P.\n\n\fThe proton momentum distribution... 30 May 2018\n\n25\n\nMoravsky, J. C. Li, C-K Loong, and A. Kolesnikov. Anomalous behaviour of proton zero\npoint motion in water in carbon nanotubes. Phys. Rev. Lett., 97:247801, 2008.\n44\n\nV. Garbuio, C. Andreani, S. Imberti, A. Pietropaolo, G. F. Reiter, R. Senesi, and M. A.\nRicci. Proton quantum coherence observed in water confined in silica nanopores. J. Chem.\nPhys., 127:154501, 2007.\n\n\f"}