{"id": "http://arxiv.org/abs/0812.4007v1", "guidislink": true, "updated": "2008-12-21T00:43:53Z", "updated_parsed": [2008, 12, 21, 0, 43, 53, 6, 356, 0], "published": "2008-12-21T00:43:53Z", "published_parsed": [2008, 12, 21, 0, 43, 53, 6, 356, 0], "title": "Cosmological Constant and Polymer Physics", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0812.2376%2C0812.3992%2C0812.3646%2C0812.0097%2C0812.1603%2C0812.1307%2C0812.1971%2C0812.1588%2C0812.1889%2C0812.4851%2C0812.4452%2C0812.1412%2C0812.0518%2C0812.3039%2C0812.4714%2C0812.0782%2C0812.5106%2C0812.4929%2C0812.2448%2C0812.4150%2C0812.3627%2C0812.1767%2C0812.0258%2C0812.3379%2C0812.2629%2C0812.4276%2C0812.1108%2C0812.0918%2C0812.3357%2C0812.1979%2C0812.1024%2C0812.3190%2C0812.2379%2C0812.4115%2C0812.2072%2C0812.4903%2C0812.4715%2C0812.4228%2C0812.0678%2C0812.4598%2C0812.4071%2C0812.1977%2C0812.3803%2C0812.4239%2C0812.3588%2C0812.2253%2C0812.5066%2C0812.0628%2C0812.4963%2C0812.1972%2C0812.3412%2C0812.3850%2C0812.4838%2C0812.2175%2C0812.3546%2C0812.1316%2C0812.0614%2C0812.4174%2C0812.0233%2C0812.4417%2C0812.0519%2C0812.3473%2C0812.1752%2C0812.4007%2C0812.4789%2C0812.3449%2C0812.0460%2C0812.2144%2C0812.5103%2C0812.0291%2C0812.0723%2C0812.2215%2C0812.1634%2C0812.4226%2C0812.4592%2C0812.3543%2C0812.2173%2C0812.0738%2C0812.0698%2C0812.3153%2C0812.2884%2C0812.3307%2C0812.4513%2C0812.0556%2C0812.1731%2C0812.0421%2C0812.2639%2C0812.2999%2C0812.2669%2C0812.3889%2C0812.1479%2C0812.2811%2C0812.4050%2C0812.1010%2C0812.2236%2C0812.4783%2C0812.3410%2C0812.3418%2C0812.5017%2C0812.2568%2C0812.2868&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Cosmological Constant and Polymer Physics"}, "summary": "It is traced out a parallel between the cosmological constant problem and the\npolymer physics. The time evolution of the universe world line is compared with\nthe growing of a polymer chain. An equivalent Flory free energy and a\nmodification of it are used as a means to evaluate two versions for the radius\nof gyration of the universe. It is proposed a link between this radius of\ngyration and the cosmological constant parameter.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0812.2376%2C0812.3992%2C0812.3646%2C0812.0097%2C0812.1603%2C0812.1307%2C0812.1971%2C0812.1588%2C0812.1889%2C0812.4851%2C0812.4452%2C0812.1412%2C0812.0518%2C0812.3039%2C0812.4714%2C0812.0782%2C0812.5106%2C0812.4929%2C0812.2448%2C0812.4150%2C0812.3627%2C0812.1767%2C0812.0258%2C0812.3379%2C0812.2629%2C0812.4276%2C0812.1108%2C0812.0918%2C0812.3357%2C0812.1979%2C0812.1024%2C0812.3190%2C0812.2379%2C0812.4115%2C0812.2072%2C0812.4903%2C0812.4715%2C0812.4228%2C0812.0678%2C0812.4598%2C0812.4071%2C0812.1977%2C0812.3803%2C0812.4239%2C0812.3588%2C0812.2253%2C0812.5066%2C0812.0628%2C0812.4963%2C0812.1972%2C0812.3412%2C0812.3850%2C0812.4838%2C0812.2175%2C0812.3546%2C0812.1316%2C0812.0614%2C0812.4174%2C0812.0233%2C0812.4417%2C0812.0519%2C0812.3473%2C0812.1752%2C0812.4007%2C0812.4789%2C0812.3449%2C0812.0460%2C0812.2144%2C0812.5103%2C0812.0291%2C0812.0723%2C0812.2215%2C0812.1634%2C0812.4226%2C0812.4592%2C0812.3543%2C0812.2173%2C0812.0738%2C0812.0698%2C0812.3153%2C0812.2884%2C0812.3307%2C0812.4513%2C0812.0556%2C0812.1731%2C0812.0421%2C0812.2639%2C0812.2999%2C0812.2669%2C0812.3889%2C0812.1479%2C0812.2811%2C0812.4050%2C0812.1010%2C0812.2236%2C0812.4783%2C0812.3410%2C0812.3418%2C0812.5017%2C0812.2568%2C0812.2868&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "It is traced out a parallel between the cosmological constant problem and the\npolymer physics. The time evolution of the universe world line is compared with\nthe growing of a polymer chain. An equivalent Flory free energy and a\nmodification of it are used as a means to evaluate two versions for the radius\nof gyration of the universe. It is proposed a link between this radius of\ngyration and the cosmological constant parameter."}, "authors": ["Paulo Roberto Silva"], "author_detail": {"name": "Paulo Roberto Silva"}, "author": "Paulo Roberto Silva", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1590/S0103-97332008000500010", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0812.4007v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0812.4007v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "6 pages, no figures", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0812.4007v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0812.4007v1", "journal_reference": "Braz.J.Phys.38:587-590,2008", "doi": "10.1590/S0103-97332008000500010", "fulltext": "COSMOLOGICAL CONSTANT AND POLYMER PHYSICS\nP. R. Silva – Departamento de Física – ICEX – Universidade Federal de Minas Gerais\nC. P. – 702 - 30123-970 – Belo Horizonte – MG – Brazil\ne-mail1: prsilvafis@terra.com.br - e-mail2: prsilva@fisica.ufmg.br\nABSTRACT – It is traced out a parallel between the cosmological constant problem and the polymer physics.\nThe time evolution of the universe world line is compared with the growing of a polymer chain. An\nequivalent Flory free energy and a modification of it are used as a means to evaluate two versions for the\n\"radius of gyration\" of the universe. It is proposed a link between this radius of gyration and the cosmological\nconstant parameter.\n\nINTRODUCTION\nThe small value of the observed cosmological constant [1] can not be explained by the\nvalue of the vacuum energy density as predicted by the quantum field theory of the\nstandard-model degrees of freedom [2]. The smallness of the cosmological constant has\nbeen considered as one of the central problems of the theoretical physics [3]. Besides this,\nas was pointed out by Ke and Li [4], recently there has been considerable interest in\nexplaining the observed dark energy [5,6,7] by the holographic dark energy model [8,9]. In\ntheir holographic dark energy model Cohen, Kaplan and Nelson [8], found that the\ncosmological constant is determined by a relation which involves the radius of the observed\nuniverse and the Planck mass. This came from a conection between ultra violet and infra\nred cutoffs, such that an effective field theory should be a good description of nature.\nRecently Hsu and Zee [10] made a proposal of an effective action for our universe. This\naction is a sum of a term linear in the cosmological constant multiplied by a four-volume,\nwhere the length scale is that characteristic of the observable universe, plus a term which\ndepends inversely on the cosmological constant multiplied by the fouth power of the Planck\nmass. The second term of the action of Hsu and Zee [10] was explained by Ke and Li [4] as\ndue to quantum corrections (related to a kind of Casimir energy). Minimizing their effective\naction, Hsu and Lee obtained a relation for the cosmological constant which reproduces\nprevious results found by Cohen and collaborators [8].\nMeanwhile, as was pointed out by Hsu a nd Zee [10], Padmanabhan [11] has proposed\nthat gravity only couples to the fluctuations of the vacuum energy rather than the vacuum\nenergy itself. Working in this way, Padmanabhan obtained a relation for the cosmological\nconstant which is similar to those found in [8] and [10].\nOn the other hand, the simplest type of polymer are represented by linear chains of\nmonomers [12]. According to Raposo et al [12], in the lattice model of polymers, a dilute\nmacromolecule in a good solvent, is represented by a random self-avoiding walk (SARW)\non a regular lattice.\nInspired in these ideas of the polymer physics, we devised the possibility of describing\nthe time evolution of the univese as a grow of a polymer chain. As polymers chains grow\nby the addition of monomers units of fixed length, we are led to think these small units as\nfixing the high violet cut off of the model. Meanwhile we could consider that some features\nof the string physics [16] may be relevant to the present work due to the one dimensional\ncharacter of both of these mathematical objects.\n\n1\n\n\fA brilliant scheme for computing the radius of gyration of a polymer (the end-to-end\ndistance of a SARW) was devised by Flory long time ago [13], for the three dimensional\ncase. Later on, Fisher [14] extended the Flory results to other dimensions. In the following,\nwe use the arguments presented in de Gennes book [15], in order to introduce the Flory free\nenergy.\nThe starting point is a chain, with a certain unknown radius R and a internal monomer\nconcentration\ncint = N ⁄ Rd ,\n\n(1)\n\nwhere d stands for the fact that the calculation is peformed on a d-dimensional lattice.\nThere is a certain repulsive energy in the chain due to monomer-monomer interactions.\nThis repulsive energy per unit volume is proportional to c2, the number of pairs present. We\nwrite\nfrep = 1/2 t v c2,\n\n(2)\n\nwhere t is the temperature and v is the excluded volume parameter (see [15]). After\nintegrating in a volume Rd, we find that the overall repulsive energy scales as\nFrep = frep Rd = t v N2 ⁄ Rd.\n\n(3)\n\nHowever a linear ideal chain in any dimension has a a gaussian distribution for R, due to its\nrandom walk character, given by (see [15])\np(R) = p0 exp[-R2 ⁄ (Na2)],\n\n(4)\n\nwhere a is the lattice parameter. Relation (4) leads to an entropic contribution for the free\nenergy the so-called elastic energy\nFel = t R2 ⁄ (Na2).\n\n(5)\n\nFlory free energy is given by the sum of terms (3) and (5), namely\nF ⁄ t = v N2 ⁄ Rd + R2 ⁄ (Na2).\n\n(6)\n\nMinimizing (6) relative to R, we obtain Flory's Radius RF which scales as\nRF ~ Nυ,\n\n(7)\n\nυ = 3 ⁄ (d+2).\n\n(8)\n\nwhere υ is given by\n\nFor d = 4, relation (8) gives υ = 1⁄2, the ideal chain exponent (pure random walk).\n\n2\n\n\fTHE FIRST MODEL\nInspired in the Flory's free enegy model of an ideal polymer, we propose an alternative\nmodel to treat the cosmological constant problem. The basic hypothesis of the model are:\ni) The universe world line will be represented by a segmented line, as a lattice model of a\npolymer (SARW).\nii) The lattice spacing will be taking as the Planck length LP, which naturally sets up the\nultra violet cutoff of the problem.\niii) The walk can not make self-intersections, due to the excluded volume constraint.\niv) The extension of the chain will be take as L = NLP, where N is the number of steps, and\nL will be interpreted as the radius of of the observable universe, fixing the infra red cutoff\nof the problem. We observe that the present treatment considers that both time (N) and\nspace (LP) evolve through discrete accretion (steps).\nv) The radius of gyration or end to end distanc RΛ of the SARW, will be interpreted as the\nCompton length associated to the cosmological constant or dark energy.\nThus we write the Flory energy of the universe Fu, as\nFu ⁄ t = N2 LPd ⁄ Rd + R2 ⁄ (NLP2),\n\n(9)\n\nwhere t is un unspecified temperature.\nSetting L = NLP and minimizing (9) relative to R, we obtain for the cosmological radius\nRΛ, the relation\nRΛ(d) = L3 ⁄ (2+d) LP(d – 1) ⁄ (2+d).\n\n(10)\n\nIn the above relations , d is the space-time dimension. The d=4 dimension deserves special\nattention. We have:\nRΛ(d=4) = L 1 ⁄ 2 LP1 ⁄ 2.\n\n(11)\n\nIf we define as Hsu and Zee [10] a mass scale Mu = L-1 and MΛ = RΛ-1 = Λ1⁄ 4, we have:\nMΛ = ( Mu MP )1⁄ 2,\n\n(12)\n\nwhich reproduces relation (4 ) of Hsu and Zee [10] paper. Also if we take LP = 10-35 m and\nL = 1026 m, we get N = 1061 and\nRΛ(d=4) = √10 x 10-5 m.\n\n(13)\n\nRΛ(4) obtained in (13) perhaps could be interpreted as the radius of gyration ( or coherence\nlength ) of the universe. It is interesting to note that relation (10) also can be put in the form\nRΛ = N3 ⁄ (2+d) LP,\n\n(14)\n\nwhere 3 ⁄ (2+d) is the Flory's exponent.\nIf we identify RΛ obtained in (13) with the Compton wavelength of a particle of mass MΛ,\nthe mass-energy of this particle will be approximately 5x10 -3 eV, and this value is\n3\n\n\fcomparable in order of magnitude with the fourth root of the observed dark energy density\n[5,6].\nTHE SECOND MODEL\nIn the second model we will retain some elements of the Flory's theory, but introducing\nbesides this some important modifications. The new basic hypothesis of this second model\nare\na) We suppose that the chain which represents the universe world line is embedded in\na n-dimensional space-like volume. In this way, space and time are no more treated\nat equal footing.\nb) The entropy of the model is evaluated by counting the number of \"monomers units\"\nof length LP, necessary to fill up the line of length R.\nWith these ideas in mind, we write the new free energy as\nFn ⁄ t = N2 LPn ⁄ Rn + R ⁄ LP.\n\n(15)\n\nIn equation (15) the first term takes in account the feature a) of the model, while the feature\nb) is accounted by the second term.\nThe entropic contribution for the free energy (15) (see feature b)) may be justified\nthrough the following reasoning. The number of steps of size LP needed to fill up a chain of\nlength L is given by\nN = L / LP.\n\n(16)\n\nIndeed, Kalyana Rama [16] in a paper dealing with the size of black holes through polymer\nscaling found an entropy given by\nSstring = a M,\n\n(17)\n\nwhere a is a string scale and M is its mass. Making the requirement that the string scale be\nequals to LP, we can rewrite (17) as\nSstring = M / MP = L / LP.\n\n(18)\n\nIn (18) we have considered that the mass density of the chain is constant up to the string\nscale LP.\nInspired in Padmanabhan idea [11], we propose that in the case of the cosmological\nconstant are the fluctuations in the number of steps which contribute for the entropy of the\nproblem and write\nScosmological = ( L / LP )1/2.\n\n(19)\n\nScosmological = ( R / LP ),\n\n(20)\n\nTaking in account (11) we get\n\n4\n\n\fwhich leads to the entropic contribution to (15).\nNow taking the extremum of (15) relative to R, we obtain\nRn+1 = L2 LPn -1,\n\n(21)\n\nwhere L = NLP.\nAlternatively by setting Rn+1 = (Λn+1)-1, we get\nΛn+1 = Mu2 MPn -1.\n\n(22)\n\nIn the case of three spatial dimensions (n=3), relation (22) reproduces previous results both\nof Hsu and Zee [10] and Cohen, Kaplan and Nelson [8]. Our main result, equation (22)\nwhich generalizes to n-spatial dimensions, can be compared with the work of Ke and Li [4].\nThey used Cardy-Verlinde [17] and Gibbons-Hawking entropy to obtain the Casimir\nenergy to the problem and after, minimizing the total energy, they got the dark energy\nformula. Thus relation (22) of this paper must be compared with equation (7) of Ke and Li\n[4], for the holographic dark energy in n+1dimensions. To compare the two results, we\nmust consider that Λ and R of the work of Ke and Li corresponds respectively to Λn+1 and\nL of the present work Also, as noted by Ke and Li [4], equation (22) is consistent with a\n(n+1)-dimensional de Sitter space, if we identify in the Friedman equation in n+1\ndimensions, the matter density with the cosmological constant Λn+1 and the Hubble\nconstant H with L-1 (the inverse of the cosmic horizon size for a de Sitter space).\nCONCLUDING REMARKS\nIn closing this paper, we judge worth to add two pieces of reasoning that we suppose will\nbe relevant to best clarify the present work.\nFirst we discuss equation (9), namely the Flory energy of the universe in the case d=4. By\nconsidering R4 = 1/Λ, and L = N LP, we can write\nFu/t(d=4) = L2 LP2 Λ + [(L LP) Λ1/ 2] -1.\n\n(23)\n\nEquation (23) keeps some resemblance with the action proposed by Hsu and Zee [10], with\na term proportionl to Λ but integrated in a four-volume which linear dimension is the\ngeometric average between L and LP, plus a term which goes as Λ-1/2 and therefore does not\nbehaves smoothly as Λ goes to zero through positive values.\nAs a second remark, perhaps the simplest way of taking in account the contribution of the\ncosmological constant to the evolution of the universe can be found in a paper by Guth and\nSteinhardt [18], please see also [19]. Let us suppose a sphere of mass M homogeneously\ndistributed and radius r and a test mass m localized at its surface. We consider that the test\nmass is influenced by a potential energy which is a sum of an attractive gravitational term\ndue to the sphere of mass M plus a repulsive term due to the cosmological constant (or\ndark energy) and write\nEpot = - GMm ⁄r – 1⁄6 Λ1/2 m c2 r2.\n\n(24)\n\n5\n\n\fIn order to proceed with the analysis of the problem, let us take the total energy as\nEtotal = 1⁄2 m v2 + Epot,\n\n(25)\n\nwhere both Hubble's law (v = Hr), and the cosmological constant term Λ, are inserted in\n(25) by the hand. This procedure leads to the Friedmann equation for the ordinary matter\nand dark energy.\nFinally, we would like to stress that the calculations performed in this paper, neglects\nvarious constants parameters which would appear in the formulas for the free energies,\nassuming that they would be of the order of the unity.\n\nREFERENCES\n[1] N. A. Bachall, et al., Science 284, 1481 (1994).\n[2] P. Hořava and D. Minic, Phys. Rev. Lett..85, 1610 (2000).\n[3] S. Weinberg, Rev. Mod. Phys. 61,1 (1989).\n[4] K. Ke and M. Li, Phys. Lett. B 606, 173 (2005\n[5] A. G. Ries, et al., Astron. J. 116, 1009 (1998).\n[6] S. Perlmutter, et al., Astrophys. J. 517, 565 (1999).\n[7] C. L. Bennet, et al., Astrophys. J. Suppl. 148, 1 (2003).\n[8] A. Cohen, D. Kaplan and A. Nelson, Phys. Rev. Lett 82, 4971 (1999).\n[9] S. Thomas, Phys. Rev. Lett. 89, 081301 (2002).\n[10] S. Hsu and A. Zee, hep-th/0406142, Mod. Phys. Lett A20,2699(2005).\n[11] T. Padmanabhan, hep-th/0406060, Class. Quant. Grav.22,L107(2005).\n[12] E. P. Raposo, et al., Am. J. Phys. 59, 633 (1991).\n[13] P. Flory, Principles of Polymer Chemistry, Chap.XII, Cornell University Press, Ithaca,\nN.Y., 1971.\n[14] M. Fisher, J. Phys. Soc. Japan, 26 (Suppl.) 44 (1969).\n[15] P-G de Gennes, Scaling Concepts in Polymer Physics, Chap. I, Cornell University\nPress, Ithaca, N. Y., (1979).\n[16] S. Kalyana Rama, Phys. Lett. B 424, 39 (1998); please see also references cited\ntherein.\n[17] E. Verlinde, hep-th/0008140.\n[18]\"The inflationary universe\", by A. Guth and P. Steinhardt,in:\"The New Physics\",\nedited by P. Davies, Cambridge University Press,1996.\n[19] R. E. de Souza, Introdução à Cosmologia, Cap.8, Editora da Universidade de São\nPaulo (EDUSP),2004.\n\n6\n\n\f"}