{"id": "http://arxiv.org/abs/0901.1903v1", "guidislink": true, "updated": "2009-01-13T22:55:49Z", "updated_parsed": [2009, 1, 13, 22, 55, 49, 1, 13, 0], "published": "2009-01-13T22:55:49Z", "published_parsed": [2009, 1, 13, 22, 55, 49, 1, 13, 0], "title": "In search of the QCD-Gravity correspondence", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0901.1801%2C0901.0925%2C0901.1285%2C0901.2302%2C0901.0458%2C0901.4230%2C0901.4955%2C0901.1025%2C0901.0446%2C0901.3241%2C0901.1823%2C0901.2611%2C0901.2456%2C0901.1192%2C0901.3193%2C0901.1714%2C0901.4491%2C0901.2850%2C0901.4591%2C0901.1059%2C0901.2256%2C0901.1903%2C0901.4969%2C0901.2572%2C0901.2355%2C0901.2539%2C0901.2921%2C0901.1759%2C0901.2779%2C0901.4283%2C0901.3656%2C0901.1191%2C0901.0412%2C0901.4293%2C0901.2467%2C0901.2868%2C0901.1187%2C0901.0028%2C0901.3077%2C0901.0870%2C0901.0328%2C0901.1365%2C0901.0927%2C0901.4550%2C0901.1957%2C0901.1232%2C0901.3266%2C0901.0135%2C0901.3301%2C0901.3189%2C0901.0943%2C0901.3338%2C0901.2316%2C0901.3167%2C0901.0853%2C0901.2377%2C0901.4324%2C0901.0761%2C0901.4720%2C0901.3620%2C0901.4008%2C0901.0859%2C0901.3969%2C0901.1546%2C0901.0873%2C0901.2713%2C0901.1532%2C0901.4634%2C0901.0504%2C0901.3718%2C0901.0233%2C0901.3117%2C0901.4196%2C0901.2542%2C0901.3297%2C0901.1389%2C0901.0751%2C0901.4371%2C0901.2552%2C0901.1828%2C0901.4064%2C0901.0530%2C0901.1264%2C0901.2512%2C0901.2488%2C0901.4843%2C0901.2385%2C0901.1919%2C0901.4081%2C0901.3869%2C0901.3250%2C0901.0813%2C0901.2907%2C0901.1148%2C0901.4505%2C0901.3685%2C0901.0769%2C0901.2525%2C0901.2834%2C0901.1572%2C0901.0779&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In search of the QCD-Gravity correspondence"}, "summary": "Quantum Chromodynamics (QCD) is the fundamental theory of strong\ninteractions. It describes the behavior of quarks and gluons which are the\nsmallest known constituents of nuclear matter. The difficulties in solving the\ntheory at low energies in the strongly interacting, non-perturbative regime\nhave left unanswered many important questions in QCD, such as the nature of\nconfinement or the mechanism of hadronization. In these lectures oriented\ntowards the students we introduce two classes of dualities that attempt to\nreproduce many of the features of QCD, while making the treatment at strong\ncoupling more tractable: (1) the AdS/CFT correspondence between a specific\nclass of string theories and a conformal field theory and (2) an effective\nlow-energy theory of QCD dual to classical QCD on a curved conformal\ngravitational background. The hope is that by applying these dualities to the\nevaluation of various properties of the strongly-interacting matter produced in\nheavy ion collisions one can understand how QCD behaves at strong coupling. We\ngive an outline of the applications, with emphasis on two transport\ncoefficients of QCD matter -- shear and bulk viscosities.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0901.1801%2C0901.0925%2C0901.1285%2C0901.2302%2C0901.0458%2C0901.4230%2C0901.4955%2C0901.1025%2C0901.0446%2C0901.3241%2C0901.1823%2C0901.2611%2C0901.2456%2C0901.1192%2C0901.3193%2C0901.1714%2C0901.4491%2C0901.2850%2C0901.4591%2C0901.1059%2C0901.2256%2C0901.1903%2C0901.4969%2C0901.2572%2C0901.2355%2C0901.2539%2C0901.2921%2C0901.1759%2C0901.2779%2C0901.4283%2C0901.3656%2C0901.1191%2C0901.0412%2C0901.4293%2C0901.2467%2C0901.2868%2C0901.1187%2C0901.0028%2C0901.3077%2C0901.0870%2C0901.0328%2C0901.1365%2C0901.0927%2C0901.4550%2C0901.1957%2C0901.1232%2C0901.3266%2C0901.0135%2C0901.3301%2C0901.3189%2C0901.0943%2C0901.3338%2C0901.2316%2C0901.3167%2C0901.0853%2C0901.2377%2C0901.4324%2C0901.0761%2C0901.4720%2C0901.3620%2C0901.4008%2C0901.0859%2C0901.3969%2C0901.1546%2C0901.0873%2C0901.2713%2C0901.1532%2C0901.4634%2C0901.0504%2C0901.3718%2C0901.0233%2C0901.3117%2C0901.4196%2C0901.2542%2C0901.3297%2C0901.1389%2C0901.0751%2C0901.4371%2C0901.2552%2C0901.1828%2C0901.4064%2C0901.0530%2C0901.1264%2C0901.2512%2C0901.2488%2C0901.4843%2C0901.2385%2C0901.1919%2C0901.4081%2C0901.3869%2C0901.3250%2C0901.0813%2C0901.2907%2C0901.1148%2C0901.4505%2C0901.3685%2C0901.0769%2C0901.2525%2C0901.2834%2C0901.1572%2C0901.0779&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quantum Chromodynamics (QCD) is the fundamental theory of strong\ninteractions. It describes the behavior of quarks and gluons which are the\nsmallest known constituents of nuclear matter. The difficulties in solving the\ntheory at low energies in the strongly interacting, non-perturbative regime\nhave left unanswered many important questions in QCD, such as the nature of\nconfinement or the mechanism of hadronization. In these lectures oriented\ntowards the students we introduce two classes of dualities that attempt to\nreproduce many of the features of QCD, while making the treatment at strong\ncoupling more tractable: (1) the AdS/CFT correspondence between a specific\nclass of string theories and a conformal field theory and (2) an effective\nlow-energy theory of QCD dual to classical QCD on a curved conformal\ngravitational background. The hope is that by applying these dualities to the\nevaluation of various properties of the strongly-interacting matter produced in\nheavy ion collisions one can understand how QCD behaves at strong coupling. We\ngive an outline of the applications, with emphasis on two transport\ncoefficients of QCD matter -- shear and bulk viscosities."}, "authors": ["Theodor Brasoveanu", "Dmitri Kharzeev", "Mauricio Martinez"], "author_detail": {"name": "Mauricio Martinez"}, "author": "Mauricio Martinez", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/978-3-642-02286-9_10", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0901.1903v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0901.1903v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "31 pages, 7 figures; Lectures delivered by D. Kharzeev at the\n  International QGP Winter School, Jaipur, India, February 1-3, 2008", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0901.1903v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0901.1903v1", "journal_reference": "Lect.Notes Phys.785:341-369,2010", "doi": "10.1007/978-3-642-02286-9_10", "fulltext": "1\n\nIn Search of the QCD–Gravity Correspondence\n\narXiv:0901.1903v1 [hep-ph] 13 Jan 2009\n\nTheodor Braşoveanu1, Dmitri Kharzeev2 and Mauricio Martinez3\n\n1. Department of Physics, Princeton University tbrasove@princeton.edu\n2. Department of Physics, Brookhaven National Laboratory kharzeev@bnl.gov\n3. Helmholtz Research School and Otto Stern School, Goethe-Universität\nFrankfurt am Main guerrero@fias.uni-frankfurt.de\n\nSummary. Quantum Chromodynamics (QCD) is the fundamental theory of strong\ninteractions. It describes the behavior of quarks and gluons which are the smallest\nknown constituents of nuclear matter. The difficulties in solving the theory at low\nenergies in the strongly interacting, non-perturbative regime have left unanswered\nmany important questions in QCD, such as the nature of confinement or the mechanism of hadronization. In these lectures oriented towards the students we introduce\ntwo classes of dualities that attempt to reproduce many of the features of QCD,\nwhile making the treatment at strong coupling more tractable: (1) the AdS/CFT\ncorrespondence between a specific class of string theories and a conformal field theory and (2) an effective low-energy theory of QCD dual to classical QCD on a curved\nconformal gravitational background. The hope is that by applying these dualities to\nthe evaluation of various properties of the strongly-interacting matter produced in\nheavy ion collisions one can understand how QCD behaves at strong coupling. We\ngive an outline of the applications, with emphasis on two transport coefficients of\nQCD matter – shear and bulk viscosities.\n\n1 Introduction.\nRecent results from the Relativistic Heavy Ion Collider (RHIC) at BNL reveal\nsurprising dynamical properties of the strongly-coupled Quark-Gluon Plasma\n(sQGP). Some of these properties may be explained through two less than traditional methods that employ dualities to re-formulate the underlying gauge\ntheory in curved conformal gravitational backgrounds.\nThe first approach is inspired by string theory and is based on the Antide-Sitter/ Conformal-Field-Theory (AdS/CFT) gravity/gauge theory duality [1, 2, 3]. This correspondence maps conformal strongly-coupled SU(Nc )\ngauge theories (i.e. with large 't Hooft coupling λ = g 2 Nc ) onto a weaklycoupled dual gravity theory. This formalism has been applied to conformal\ngauge theories that share some features with QCD, such as a maximally supersymmetric N =4 Yang-Mills theory. This leads to interesting predictions for\n\n\f2\n\nseveral classes of observables that may be related to the QGP, such as entropy production, transport properties, jet quenching, dijet-bulk correlations\netc (for a review, see [4]).\nThe second approach introduces an effective low-energy Lagrangian of QCD\nwhich satisfies the constraints imposed by the Renormalization Group, is scale\nand conformally invariant in the limit of vanishing vacuum energy density and\nmatches the perturbative behavior at short distances (high energies) [5, 6].\nThis theory has a dual description as classical gluodynamics on a curved conformal space-time background on one hand, and gluodynamics in flat spacetime coupled to scalar glueballs (which play the role of dilatons) on the other.\nIn this approach, one may be able to describe confinement as an event horizon\nfor colored particles [7, 8], in close analogy to what happens in the vicinity\nof a black hole. Recent efforts link the bulk viscosity of QCD matter and the\nassociated entropy production to the breaking of scale invariance [9, 10].\n\n2 QCD and its properties.\nQuantum Chromodynamics (QCD) is at present universally accepted as the\ntheory of the strong interaction. The fundamental degrees of freedom in the\ntheory are the quarks and gluons that carry color charges. These particles\ncannot be directly seen in Nature, because confinement binds them into the\ncolor-neutral bound states – baryons and mesons. QCD has been thoroughly\ntested in experiment and is known to possess the expected properties: the\ncoupling constant weakens as the resolution scale grows (celebrated \"asymptotic freedom\" [11, 12]), the quarks and gluons manifest themselves through\nthe production of jets, the partonic constituents of matter are seen in Deep\nInelastic Scattering and the corresponding structure functions exhibit scaling\nviolation, etc.\nHowever in spite of these successes the behavior of the theory at low energies\nor large distances and the structure of its vacuum state are still poorly understood. One may hope that a progress can be achieved through the studies\nof thermodynamics of quarks and gluons – if history is any indication, understanding thermodynamic behavior may appear simpler than understanding the dynamics of the individual constituents. At temperatures accessible\nexperimentally, the typical distances between the quarks and gluons in the\n\"Quark-Gluon Plasma\" (QGP) are quite large and the coupling is strong.\nAchieving a progress in the understanding of QGP thus requires methods\nthat apply in the strong coupling domain. In these lectures we will focus\non two such methods, with applications to the transport coefficients of the\nquark-gluon plasma.\n\n\f3\n\n2.1 The QCD lagrangian.\nQCD is formulated as a gauge theory, in analogy with QED. The structure\nof QED is entirely fixed by the requirement of invariance under local gauge\ntransformations, that is invariance with respect to the phase rotation of the\nelectron field exp(iα(x)), where the phase factor α depends on the space-time\ncoordinates. In the case of QCD, we have the constituents – quarks – that\ncome in three different colors, Nc = 3. The local gauge invariance with respect\nto the SUc (Nc ) rotations in color space introduces Nc2 − 1 = 8 gauge bosons,\nthe gluons. Quarks are spin 1/2 particles that belong to the fundamental\nrepresentation of the SUc (3) whereas gluons are spin 1 particles defined in\nthe adjoint representation of SUc (3). Since quarks can have three different\ncolors – say, red, green and blue – a quark state vector can be expressed as\na color multiplet of three components. Interactions with gluons re-paint the\ncolors of the quarks; since color rotations do not commute (in other words,\nSUc (3) is a non-Abelian group) gluons can also interact with each other.\nLet us now formulate this mathematically. First, consider the free lagrangian\nof quark fields:\n\u0013\n\u0012\nX\nX\n∂\n− mq q(x) ,\n(1)\nLfree =\nq̄(x) iγμ\n∂xμ\nq=u,d,s... colors\n\nand impose its invariance under a gauge transformation of the quark fields\ndefined as\nU:\n\nq j (x)\n\n→\n\nUjk (x)q k (x).\n\n(2)\n\nwith j, k ǫ 1 . . .3 (we always sum over repeated indices). The fact that the lagrangian of the theory is invariant with respect to these gauge transformations\nimplies that all physical observables must be gauge invariant.\nNote that in Eq. (2) U is a unitary complex valued matrix, i.e., U U † = U † U =1\nand det U =1. In the fundamental representation of the group these matrices\nform the group SU (3) with 3 being the number of colors Nc . This group has\neight generators Tija , aǫ 1,2,..,8 of the fundamental representation of SU (3),\nhence the matrix U can be represented as\nU (x) = exp(−i φa (x) T a ).\nTija\n\n(3)\n\nThe properties of U imply that the generators\nare Hermitian (T = T a† )\na\nand traceless (T rT =0) (check this by making an infinitesimal transformation\nabout unity). These generators satisfy a Lie algebra:\n[T a , T b ] = ifabc T c\n\na\n\n(4)\n\nwhere fabc are SU (3) structure constants. This means that unlike QED, QCD\nis a non-Abelian gauge theory: different color rotations do not commute.\n\n\f4\n\nAfter we apply the local gauge transformation to the quark fields, the free\nlagrangian given in Eq. (1) acquires some extra terms proportional to ∂μ φa (x).\nIn order to keep gauge invariance, it is necessary to compensate for this extra\nterms. This can be achieved by introducing the gauge field (in QCD, gauge\nfields will be understood as gluons) Aμkj , and replacing the normal derivative\n∂μ in the free lagrangian (1) by the so-called covariant derivative:\nn\no\nμ j\n∂ μ q j (x) → Dkj\nq (x) ≡ δkj ∂ μ − iAμkj (x) q j (x)\n(5)\nNote that if we request for a gauge invariance, the lagrangian written in terms\nof covariant derivatives is no longer free, so we now have a coupling between\nquark fields and gauge fields. Under gauge transformations the gauge fields\nshould transform as:\nAμ (x) → U (x)Aμ (x)U † (x) + iU (x)∂ μ U † (x).\n\n(6)\n\nSo the QCD lagrangian reads as1 :\nLQCD =\n\nX\nq\n\nq̄(x) ( i γμ Dμ − mq ) q(x) −\n\n1\ntr Gμν (x)Gμν (x)\n4g 2\n\n(7)\n\nwhere\nDμ = ∂μ − i Aaμ ta ;\n\n(8)\n\nnote that we have included g in the definition of the gauge potential to reveal\nthe dependence of the Lagragian (7) on the coupling constant; we will need it\nin what follows.\nThe first term of (7) describes the dynamics of the interaction between the\nquarks and gluons while the second one describes the dynamics of the gluon\nfield. The gluon field strength tensor is given by:\nGμν (x) ≡ i [Dμ , Dν ] = ∂ μ Aν (x) − ∂ ν Aμ (x) − i [Aμ (x), Aν (x)]\n\n(9)\n\nor in terms of the colour components Aμa of the gauge field:\n\nμ\nν\nμ ν\nν μ\nGμν\na (x) = ∂ Aa (x) − ∂ Aa (x) + fabc Ab (x)Ac (x).\nμν\n\n(10)\nμν\n\nThe term T r(G (x)Gμν (x)) is also gauge invariant because T r (U Gμν G U † ) =\nT r (Gμν Gμν ). Note that the term T r (Gμν Gμν ) for the given stress tensor has non-linear couplings between the gauge fields themselves. Such selfinteractions are responsible for the complexity of QCD dynamics.\n1\n\nHereafter we will omit color indices explicitly.\n\n\f5\n\n2.2 Asymptotic freedom.\nOne of the most remarkable properties of QCD is related to the fact that\nat large energies the coupling constant is small, i.e. perturbation theory is\napplicable. To understand better this aspect, let us first refer to what happens\nin QED. The electron-positron pairs screen the electric charge. Therefore, the\nelectric charge becomes stronger at short distances. The dependence of the\nobserved effective charge on the distance is given by:\ne2 (r) =\n\n1+\n\ne2 (r0 )\n2e2 (r0 )\nlog rr0\n3π\n\n.\n\n(11)\n\nThis result can be obtained by resumming (logarithmically divergent, and\nregularized at the distance r0 ) electron-positron loops dressing the virtual\nphoton propagator.\nThe running of the coupling constant with the distance prescribed by (11) has\nsome paradoxical consequences. Indeed, at distances r ≫ r0 the coupling constant is seen to be independent of the value of the coupling at renormalization\nscale r0 . Moreover, it vanishes as ∼ log−1 (r/r0 ) so if we require the coupling\nconstant be finite at r0 , in the local limit of r0 → 0 the coupling will vanish.\nThis is so-called \"Moscow zero\" discovered by Landau and Pomeranchuk [13].\nThe possible ways out include the following: a) we know that QED is not a\ncomplete theory; at the scale r0 ∼ 1/MZ it has to be extended to the electroweak theory; b) At short distances QED is no longer weakly coupled, and\nso the perturbative expression (11) cannot be trusted and one should find a\ntrue non-perturbative answer.\nInstead of the dependence on the distance, we can also use momentum space\nand consider the dependence of the coupling on the virtuality of the photon,\nsay, q 2 ≡ Q2 . In terms of this variable, the expression (11) can be rewritten\nas:\nα(Q20 )\n\nα(Q2 ) =\n1−\n\nα(Q20 )\n3π\n\nlog\n\n\u0010\n\nQ2\nQ20\n\n\u0011\n\n(12)\n\nThe \"Moscow zero\" in momentum space manifests itself through the singularity at Q2 = Q20 exp(3π/α); note that since α ≪ 1, for all particle accelerator\nenergies this pole is very far away and so QED is an excellent effective theory.\nIn QCD the situation is different. Because of the gluon self-interactions, we\nhave anti-screening [11, 12]– the constant coupling becomes small at short distances (high energies) but large at large distances (low energies). In Coulomb\ngauge, the anti–screening stems from the diagram in which the exchange of a\nCoulomb gluon excites from the vacuum zero modes of the transverse gluons\n[15, 16, 17]; for review see [18]. This diagram is purely real and leads to a\n\n\f6\nNNLO\n\nTheory\n\nData\n\nLattice\n\nα s(Q)\n\nNLO\n\n0.5\n\nDeep Inelastic Scattering\ne+e- Annihilation\nHadron Collisions\nHeavy Quarkonia\n\n0.4\n\nΛ(5)\nMS\nQCD\nO(α 4s )\n\n0.3\n\n{\n\n251 MeV\n213 MeV\n178 MeV\n\nα s (Μ Z)\n0.1215\n0.1184\n0.1153\n\n0.2\n\n0.1\n1\n\n10\n\nQ [GeV]\n\n100\n\nFig. 1. The running coupling constant αs (Q2 ) as a function of momentum transfer\nQ2 determined from a variety of processes; from [14].\n\nCoulomb interaction that strengthens as the distance grows. As a result, the\nsign of log(Q2 /Q20 ) changes. The final result is given by the expression:\nαs (Q2 ) =\n\nαs (Q20 )\n1+\n\nαs (Q20 )\n12π\n\n(11 NC − 2 Nf ) log(Q2 /Q20 )\n\n.\n\n(13)\n\nIn Fig. 1 we show the experimental verification of this prediction. Formally\nspeaking, the fact that the coupling constant is small at high energies is related\nto the negative value of the so-called β-function. We will explain this in detail\nin Sect. 2.3.\nNote that with (13), no singularity appears in the local limit – so QCD by\nitself is a fully consistent field theory. However the pole is still present at\nsmall virtuality; it thus could affect all soft processes. This problem is very\nlikely related to confinement of quarks and gluons, and finding the right way\nof dealing with it is akin to discovering the Holy Grail for the QCD theorists.\n2.3 Scale invariance breaking in QCD\nScale invariance plays an important role in many sub-fields of physics. In\na scale-inavriant theory, the physics looks the same at all scales. Suppose\nthat the action that describes the dynamics of some theory is invariant under\ndilatations:\nx → λx\n\n(14)\n\n\f7\n\nIf this is the case, by Noether theorem, we have a dilatation current sμ that\nis conserved and is given by:\nsμ = xν θμν\nwhere θ\n\nμν\n\n(15)\n\nis the energy-momentum tensor. The conservation law reads as:\n∂μ sμ = θμμ\n\n(16)\n\nTherefore the divergence of the scale current corresponding to a scale transformation is equal to the trace of the energy-momentum tensor, and a scaleinvariant theory will have θμμ = 0. Deviations from this will indicate a breaking\nof scale invariance.\nAs a simple example consider classical electrodynamics without external\nsources:\n1\n(17)\nL = − Fμν F μν\n4\n¿From this lagrangian, it is straightforward to obtain the energy-momentum\ntensor:\n1\n(18)\nθνμ = −F μρ Fνρ + δνμ Fρσ F ρσ\n4\nTaking the trace of this tensor, we find that it will vanish in four dimensions\nsince in that case δμμ = 4; this shows that classical electromagnetism without\nsources is scale invariant. Indeed, the result is the same at classical level for\nnon-abelian Yang-Mills theories.\nHowever at quantum level this is not true. A simple way to understand this\nis the following: in quantum theory, the fluctuations can exist at all scales\nand thus their total energy is infinite. To obtain a finite result, we have to\nrenormalize the theory. We do this at the cost of introducing the renormalization scale which is a dimensionful parameter. Clearly, its presence violates\nthe original classical scale invariance of our theory.\nIn Sect. 2.2, we mentioned that the coupling constant in gauge theories\nchanges as a function of the virtuality Q2 due to quantum effects – the fluctuations of the vacuum that dress the propagator of a gauge boson. Because of\nthis, QED and QCD lose the invariance under scaling transformations at quantum level. Indeed, once quantum correction are taken properly, the trace of the\nenergy-momentum tensor calculated from the QCD lagrangian (7) is [19, 20]:\n∂ μ sμ = Θμμ =\n\nX\nq\n\nmq q̄q +\n\nβ(g)\ntrGμν Gμν ,\n2g 3\n\n(19)\n\n\f8\n\nwhere β(g) is the QCD β-function, which governs the behavior of the running\ncoupling:\nμ\n\ndg(μ)\n= β(g).\ndμ\n\n(20)\n\nAs we already discussed in Sect. 2.2, the small value for the coupling αs at\nhigh energies is related to the sign of the β function which is negative for\nQCD. This means that the theory is asymptotically free. The leading term in\nthe perturbative expansion is (cf. Eq. (13))\nβ(g) = −b\n\ng3\n+ O(g 5 ),\n(4π)2\n\nb = 11Nc − 2Nf ,\n\n(21)\n\nwhere Nc and Nf are the numbers of colors and flavors, respectively.\nThe hadron masses are defined as the forward matrix elements of trace of the\nQCD energy-momentum tensor: 2m2h = h|Θμμ |h (the factor of 2mh is due to\nrelativistic normalization of states |hi. The sum in (19) runs over all quark flavors, and it might seem that heavy quarks can give a substantial contribution\nto the masses of light hadrons. However that does not happen since at small\nvirtualities the heavy flavor contribution to the sum (19) is exactly canceled\nby a corresponding heavy flavor contribution to the β-function [21]. Since the\nlight quarks are light, the dominant contribution to the masses of most light\nhadrons comes from the gluon term in (19) – in other words, most of the\nobservable mass in the Universe is due to the energy of gluon interactions.\n2.4 Confinement and the broken scale invariance.\nThe asymptotic freedom allows us to probe quarks and gluons at short distances when the coupling constant is small. However the growth of the coupling at large distances leads to the binding of quarks and gluons into colorsinglet hadrons of size ∼ 1 fm.\nIn quantum field theory, the evaluation of scattering amplitudes involves the\nconcept of asymptotic states. However, the fact that quarks and gluons are\nconfined prevents us from using quarks and gluons as asymptotic states within\nthe S matrix approach. An appropriate object for studying confinement of\nquarks is the so-called Wilson loop [22]:\n\u0015\u001b\n\u001a\n\u0014 Z\n,\n(22)\nAaμ T a dxμ\nW (R, T ) = T r P exp i\nC\n\nwhere Aaμ is the gluon field and T a is the generator of SU (3). Let us first\nchoose the contour C in the integral as a rectangle with side R in one of\nthe space dimensions and T in the time direction. With this contour we are\ndealing with the propagation of a heavy static quark and antiquark separated\n\n\f9\n\nby a distance R propagating in time for a period T . One important property\nof the Wilson loop is its relation to the potential acting between the static\nquark and antiquark: when T → ∞,\nlim W (R, T ) = exp [−T V (R)] ,\n\nT →∞\n\n(23)\n\nwhere V (R) is the static potential between the heavy quarks.\nIf we now decide to stretch the size of the rectangle in all directions by the\nsame factor (T → λT and R → λR simultaneously) one can expect that the\nvalue of the Wilson loop will be modified. The only exception is the Coulomb\npotential, which maintains the scale invariance in the asymptotic value of the\nWilson loop:\nW (R, T ) = W (λ R, λ T ), if V (R) ∼ 1/R.\n\n(24)\n\nFor QCD, the quark-antiquark potential has the form\n4 αs (R)\n+ σR,\n(25)\n3 R\nwhere σ is the tension of the string stretched between the quark and antiquark.\nPhenomenology tells us that its value is around ∼ 1 GeV/fm. As one can easily\nsee, both the running coupling and confinement are in violent contradiction\nwith the scale invariance.\nV (R) = −\n\nIn the limit when T → ∞ and large distances, the asymptotic behavior of the\nWilson loop reads approximately as:\nW (R, T ) ≃ exp [−σT R] ,\n\n(26)\n\nThis is the famous \"area law\" of the Wilson loop that signals confinement.\nAt finite temperature, various transport properties of QCD matter appear\nsensitive to confinement. In Sect. 5.3 we discuss the intriguing relation between\nbulk viscosity and breaking of scale invariance.\n\n3 Black holes.\nThe concept of a black hole dates back to the 18th century, when the British\ngeologist and astronomer Rev. John Mitchell advanced the idea of the existence of a body so massive that the escape velocity at its surface would be\nequal to the speed of light. In a paper he wrote to the Royal Society in 1783\nhe concludes that \"all light emitted would be made to return towards it, by its\nown proper gravity.\" This was due in part to the popularity of the \"corpuscular theory\" of light at the time, which made possible that light could be\naffected by gravity in the same way as ordinary matter [23].\n\n\f10\n\nThe same idea of strong-gravity objects trapping light was proposed by the\nmathematician Pierre-Simon Laplace in his book Exposition du Systeme du\nMonde in 1796, though it did not gain much consideration throughout the\n19th century, as the \"wave theory\" of light was gaining ground.\nLater on, upon the advent of general relativity as a new theory of gravity in\n1915 and the formulation of Einstein's field equations, relating the curvature\nof spacetime with the matter and energy content within the spacetime (via\nthe stress-energy tensor Tμν )\n8πG\nTμν ,\n(27)\nc4\nthe German physicist and astronomer Karl Schwarzschild gave the solution for\na static, isotropic gravitational field, predicting the existence of a singularity\nat r=2GM, the so-called Schwarzschild radius [24]. Schwarzschild introduced\na metric\nGμν =\n\nds2 = c2 dt2 (1 −\n\ndr2\n2GM\n)\n−\n− r2 dΩ 2\nrc2\n1 − 2GM\n2\nrc\n\n(28)\n\nwhich was proved to be the most general solution of Einstein's equations\nwithout matter (Tμν = 0) and spherical symmetry – via Birkhoof's theorem in 1923. It was later used by Oppenheimer and Volkoff in 1939 to predict the collapse of massive stars [25]. It was not until the introduction of\nthe Eddington-Finkelstein coordinates in 1958 that the Schwarzschild surface\nr=2GM was interpreted as the event horizon of a black hole, acting as a perfect unidirectional membrane. That is, information from outside the boundary\nwas allowed to cross it, but events occurring inside the boundary could in no\nway affect an outside observer [26].\nA major breakthrough came in the 1970s, when Jacob Bekenstein proposed\nthat a black hole should have a finite non-zero entropy and temperature, proportional to the area of its horizon. A finite entropy is in agreement with\nthe second law of thermodynamics. By applying quantum field theory to the\ncurved spacetime around the event horizon, Stephen Hawking concluded in\n1974 that black holes should emit thermal radiation [27]. He found the temperature of the emitted radiation to be proportional to the acceleration due\nto gravity of a near-horizon observer\nTBH =\n\nh̄c3\n8πGM kB\n\n(29)\n\nand confirmed Beckenstein's conjecture by fixing the constant of proportionality between the entropy and the area of the black hole event horizon. In\nthe equation above, kB is Boltzmann's constant, G is Newton's gravitational\nconstant, h is Plank's constant, while M is the mass of the black hole.\n\n\f11\n\nInterestingly, in gravitational theories the black hole entropy appears to be\nthe maximum entropy that one can squeeze within a fixed volume, and this\nentropy is proportional to the area A of the black hole horizon:\nkB Ac3\n,\n(30)\n4Gh̄\nThis is in sharp contradiction to the \"usual\" physics when the entropy is proportional to the volume of the system. Since the entropy counts the number of\ndegrees of freedom, one may wonder whether the \"true\" number of degrees of\nfreedom in gravitational theory is smaller than naively expected, and whether\nthe dynamics might be formulated as a dynamics of the surface modes. We\nwill come back to this crucial question shortly.\nSBH =\n\nAn interesting consequence of (29) is that black holes that are less massive\nthan the planet Mercury would become hotter than the cosmic microwave\nbackground (about 2.73 K) and would slowly evaporate with time by giving up\nenergy through Hawking radiation. As their mass decreased, their temperature\nwould gradually increase. Thus, small black holes will eventually undergo\nrunaway evaporation and vanish in a burst of radiation.\nDuring the last decade, concerns regarding the formation in high-energy particle accelerators of black holes that would accrete ordinary matter and put\nin danger the Earth were firmly dismissed. The reader can easily check on\nthe basis of formulae given in this section that the energies of any existing or\nplanned accelerator is many orders of magnitude below the one needed for the\nblack hole formation in either classical or quantum gravitational framework.\nThe corresponding studies have been done at both the Relativistic Heavy-Ion\nCollider (RHIC) [28] and more recently at the Large Hadron Collider (LHC).\nIn the case of RHIC, the speculative disaster scenarios were to some extent\ndue to the misinterpretation of a mathematically dual treatment of the hot\nQCD matter as a black hole in AdS5 x S 5 space via the AdS/CFT correspondence [29], which is the topic of section 4.1.\n\n4 Using black holes to understand gauge theories.\n4.1 The AdS/CFT correspondence.\nThe AdS/CFT correspondence is a successfully tested conjecture about the\nmathematical equivalence of a string theory defined on an Anti de Sitter (AdS)\nspace and a conformal field theory2 defined on the boundary of the AdS space.\nIt follows as an application of the holographic principle [30], developed by\n2\n\nConformal invariance is a generalization of scale invariance.\n\n\f12\n\nt'Hooft and Susskind, which states that the description of a volume of space\ncan be encoded on a boundary to that region of space3 .\nHere we focus on a particular version of this equivalence, namely the duality\nbetween Type IIB string theory on AdS5 x S 5 and a supersymmetric N =4\nYang-Mills gauge theory4 on the 4-dimensional boundary of AdS5 , as it was\noriginally introduced by Maldacena [1] in 1997, followed by Gubser, Klebanov,\nPolyakov [2] and Witten [3] in 1998.\nAnti de Sitter Space.\nOn the gravity side, the requirement of conformal invariance fixes the metric\nof the 5th dimension uniquely; it is an Anti de Sitter space AdS5 – that is,\na space with Lorentzian signature (- + +...+) and constant negative curvature [31]. The Anti de Sitter space is a maximally symmetric, vacuum solution\nof Einstein′ s field equations with negative cosmological constant Λ < 0. In d\ndimensions, it is defined by an embedding in d+1 dimensions\nds2 = −dx20 +\n2\n\n−R =\n\n−x20\n\nd−1\nX\ni=1\n\n+\n\ndx2i − dx2d+1 ,\n\nd−1\nX\ni=1\n\nx2i − x2d+1 ,\n\n(31)\n\n(32)\n\nwhich makes it the Lorentzian version of Lobachevski space. It is invariant under the group SO(2,d-1) that rotates the coordinates xμ = (x0 , xd+1 , x1 , ..., xd−1 )\ninto x′μ = Λμν xν . In Poincaré coordinates, the metric of this space is given by\nd−2\n\nds2 =\n\nX\nR2\ndx2i + dx20 ),\n(−dt2 +\n2\nx0\ni=1\n\n(33)\n\nwhere t > −∞, xi < +∞ and 0 < x0 < +∞. Up to a conformal factor,\nthis is just like (flat) 3d Minkowski space, though not all space is covered.\nThus, in these Poincaré coordinates, Anti de Sitter space can be understood\nas a d-1 dimensional Minkowski space in (t, x1 , ..., xd−2 ) coordinates, with\na warp factor (gravitational potential) that depends only on the additional\ncoordinate x0 .\n3\n\n4\n\nIn case of a black hole, the holographic principle states that the description of all\nobjects falling into the black hole is entirely given by surface fluctuations of the\nevent horizon.\nN =4 supersymmetric Yang-Mills is a conformal field theory.\n\n\f13\n\nSupersymmetry.\nNow, our conformal field theory needs to be supersymmetric – that is, associate a fermion (particle with half-integer spin) to every type of boson (particle with integer spin) and a boson to every type of fermion. This can be\nrepresented by a graded Lie algebra generalization of the Poincaré + internal\nsymmetries, with \"even\" generators Pa , Jab , Tr and \"odd\" generators Qiα ,\nsatisfying the following commuting and anticommuting laws [31]:\n[even, even] = even; {odd, odd} = even; [even, odd] = odd.\n\n(34)\n\nWe note that Pa and Jab are, respectively, the generators of 3+1 dimensional\ntranslation symmetries and the Lorentz generators of the SO(1,3) Lorentz\ngroup, which together define the Poincaré symmetry, Tr correspond to internal\nsymmetries of particle physics such as local U(1) of electromagnetism or local\nSU(3) of QCD or global SU(2) of isospin, while Qiα are spinors satisfying the\nsupersymmetry algebra\nQ boson = f ermion; Q f ermion = boson.\n\n(35)\n\nSince all symmetries of the field theory should be reflected in the dual string\ntheory, the supersymmetry requirement further constrains the 10-dimensional\nstring theory to live in AdS5 x S 5 (that is 5-dimensional AdS space times a\n5-sphere) [32]. We make sense of the higher dimensions (D > 4) of the theory\nby means of Kaluza-Klein dimensional reduction, which states that the extra\nD – 4 dimensions are all curled up in a small space, in the form of a small\nsphere or torus.\nD Branes and Black Holes in String Theory.\nThe metric commonly used in AdS/CFT calculations is the AdS5 -Schwarzschild\nsolution, which describes the near-horizon geometry of D3-branes (see below):\n\u0015\n\u0014\nz4\nL2\ndz 2\n→2\n2\n2\n, h(z) = 1 − H4 .\nds5 = 2 −h(z)dt + d x +\n(36)\nz\nh(z)\nz\n2\n\nHere L is the common radius of curvature of AdS5 and S 5 , z = Lr and\nzH is the corresponding z-coordinate of the black-hole horizon5 . This metric\nextremizes an action derived from type IIB string theory on S 5 :\nZ\n√\n1\n12\n(37)\nS=\nd5 x −g(R + 2 ).\n16πG5\nL\n5\n\nz ranges from 0 to ∞ and corresponds to what we previously defined as x0 in (32)\n\n\f14\n\nFig. 2. The AdS-Schwarzschild solution, dual to a thermal state of N =4 superYang-Mills, by Gubser.\n\nThe relationship between gauge theories and string theory on Anti-de-Sitter\nspaces was motivated by studies of D-branes and black holes in string theory [32]. D-branes are solitons in string theory and are defined (in string perturbation theory) as surfaces where open strings can end. These open strings\nhave massless modes describing the oscillations of the branes, a gauge field\nliving on the brane or their fermionic partners. Having N coincident branes\non which the open strings can start and end points us towards a low energy dynamics described by a U(N) gauge theory. Now, if one considers D-pbranes, which are charged under p+1-form gauge potentials, and adds to them\nD-branes, they generate together a flux of the corresponding field strengths\nassociated with the gauge potentials, which contributes to the stress energy\ntensor; so the geometry becomes curved. One can find solutions of the supergravity equations carrying these fluxes. These solutions are very similar to\nextremal charged black hole solutions in general relativity, except that in this\ncase they are black branes with p extended spatial dimensions (which, like\nblack holes, contain event horizons).\n\nFig. 3. D-brane representation, by Gubser.\n\n\f15\n\nIf one considers a set of N coincident D-3-branes, the near horizon geometry\nturns out to be the famed AdS5 x S 5 [32]. We also know that the low energy\ndynamics on their worldvolume is governed by a U(N) gauge theory with N =4\nsupersymmetry. These two pictures of D-branes are perturbatively valid for\ndifferent regimes of the coupling. While perturbative field theory is valid when\ngs N is small, the low-energy gravitational description is perturbatively valid\nwhen the radius of curvature is much larger than the string scale, that is\nwhen gs N becomes very large. As an object is brought closer to the black\nbrane horizon, its energy measured by an outside observer gets redshifted by\nthe large gravitational potential, so it becomes very small. Since low energy\nexcitations on the branes are governed by the Yang-Mills theory, it becomes\nnatural to conjecture that Yang-Mills theory at strong coupling is describing\nthe near horizon region of the black brane, whose geometry is AdS5 x S 5 !\nNear r=0, the extremal 3-brane geometry given in (36) is non-singular and\nall appropriately measured curvature components\nbecome small for large L.\n√\nThus, for L much larger than the string scale α′ , the entire 3-brane geometry\nhas small curvature everywhere and can be described by the supergravity\napproximation to type IIB string theory. By expressing the ADM tension\n(mass per unit area) of the extremal 3-brane classical solution to N times the\ntension of a single D3-brane, one obtains the relation [33]:\n√\n2 4\nπ\nL\nΩ\n=\nN\n.\n(38)\n5\n2\nκ\nκ\n√\nIn this context, Ω5 = π 3 is the volume of a unit 5-sphere and κ = 8πG is the\n10-dimensional gravitational constant. Since κ = 8π 7/2 gs α′2 and gY2 M = 4πgs ,\nEq. (38) becomes\n2\n\nL4 = gY2 M N α′ ,\n\n(39)\n\nwhere gs and gY√\nM are the string and Yang-Mills couplings, respectively. Thus,\nfor large L ≫ α′ a strong t'Hooft coupling gY2 M N ≫ 1 is required. This\nremarkable result lies at the heart of the success of the AdS/CFT correspondence. We further point to references [31, 32, 33] for comprehensive reviews\nof the conjectured equivalence.\n4.2 QCD and Gravity\nAs we discussed above, asymptotic freedom and confinement explicitly break\nconformal invariance in QCD, and the AdS/CFT correspondence relies on\nconformal symmetry in a very essential way. This is at present the main obstacle in the way of applying these ideas to QCD. We are interested in the\nstrong coupling behavior which in QCD is encountered in the the low energy\nregime. It is thus natural to try and gain a physical insight on confinement\nby considering effective low-energy theories. In this section we will sketch the\n\n\f16\n\nconstruction of one of these theories. What is interesting in this example is\nthat it also points toward gravity: the resulting effective lagrangian can be\nmathematically reformulated as classical QCD on a curved conformal gravitational background. Our discussion follows the arguments from Ref. [5].\nWe would like to construct an effective theory that is not scale invariant\nbut transforms under scale transformations in a well-defined way prescribed\nby the asymptotic freedom, i.e. is invariant under the Renormalization Group\n(RG) transformations6. Since as we have seen above the scale transformations\nare generated by the trace of the energy momentum tensor, we will begin by\nencoding the dynamics prescribed by the RG into a set of low energy theorems\nfor the correlation functions of the trace of the energy-momentum tensor. We\nreproduce the derivation [34] of these theorems here because they will be\nrelevant in the construction of the effective lagrangian.\nThe expectation value of an operator O that is invariant with respect to the\nchange of renormalization scale M0 can be written as\nid\nh\n8π\n−\nhOi ∼ M0 e b g2 (M0 ) ;\n\n(40)\n\nthis way the expectation value does not change with the scale M0 , and there\nis thus no anomalous dimension, only the canonical dimension d.\nOn the other hand, we can write down this expectation value as a functional\nintegral that will contain the exponential of the action. We have seen above\n(see (7)) that the action density in gluodynamics depends on the coupling\nconstant g; it is proportional to 1/4g 2:\na\nL = (−1/4g 2)F̃ aμν F̃μν\n\n(41)\n\nwhere F̃ = gF is the rescaled gluon field. The derivative w.r.t. −1/4g 2(Q2 )\nof the expectation value of O thus generates a zero-momentum correlation\nfunction:\nZ\nd\ni\ndx hT { O(x) , F̃ 2 (0) }i = −\nhOi;\n(42)\nd(−1/4g 2)\nthis procedure is analogous to differentiating w.r.t. the inverse temperature in\nstatistical mechanics. Combining Eqs. (40) and (42), we obtain [34] for d = 4:\n\ni lim\n\nq→0\n\nZ\n\ndx ei q x h0|T { O(x) ,\n\nβ(αs ) 2\nF (0) }|0iconnected = hOi (−4) .\n4 αs\n\n(43)\n\nThis result can be easily generalized through an iteration method to obtain a\nset of relations between n-point correlation functions and an arbitrary number\n6\n\nRenormalization group is a field theory technique that allows one to investigate\nthe changes of a physical system as one views it at different distance scales.\n\n\f17\n\nof operators F 2 . If our operator O is the trace of the energy-momentum tensor\nitself, i.e.\nO ≡ θμμ =\n\nβ(g) a aμν\nF F\n,\n2 g μν\n\n(44)\n\nthen Eq. (43) can be written as:\nin\n\nZ\n\ndx1 . . . dxn h0|T {θμμ11 (x1 ), . . . ,θμμnn (xn ), θμμ (0)}|0iconnected\n\n(45)\n\n= hθμμ (x)i (−4)n .\nThis infinite chain of low-energy theorems determines the structure of the lowenergy theory completely, and we will now construct our effective lagrangian\nusing the method developed in [35].\nLet us consider gluodynamics in a curved conformally flat background in d\ndimensions, with a background described by the metric:\ngμν (x) = eh(x) δμν .\nThe action of the gluon fields in this curved background is:\nZ\n√\n1\na\na\nS = − 2\nF̃νσ\n,\ndd x − g g μν g λσ F̃μλ\n4g\n\n(46)\n\n(47)\n\nwith g = det g μν . Note that Yang-Mills theory on a curved background is\nscale and conformally invariant in any number of dimensions d, contrary to\nthe case a flat space when the same theory is scale and conformally invariant\nonly if d=4, see (18). The regularization of the action brings in an extra term\nin Eq. (47) in d = 4:\n\u0015\n\u0014\nZ\nb g2\n1\na 2\n4\n2h\n(F̃ ) .\nd xe\n(48)\n−\n∆S = − 2\n4g\n32 π 2 μν\nwhere b = 11 NC /3. This new term is proportional to the second term of\nthe right hand side of Eq. (19). Therefore, the explicit breaking of the scale\ninvariance of QCD manifests itself in the theory defined by the effective action given by the sum of Eqs. (47) and (48) through a term containing the\nauxiliary scalar field h(x) [35], without any dimensionful parameters. For a\ntheory defined on a flat space-time, the scale anomaly presents itself in the\nphenomenon of dimensional transmutation, which brings in a dimensionful\nparameter explicitly.\nThe kinetic part for the field h(x) can be obtained in a manifestly scale and\nconformally invariant way using the Einstein-Hilbert Lagrangian for the oneloop effective Yang-Mills field:\n\n\f18\n\nSef f =\n\nZ\n\nd4 x\n\n√\n\n−g\n\n\u0012\n\n\u0013\n1\n1 μν λσ a a\n2h μ\ng\ng\nF̃\nF̃\n−\ne\nθ\nR−\nμλ νσ\nμ ,\n8πG\n4 g2\n\n(49)\n\nwhere G is some dimensionful constant and R is the Ricci scalar. Using (46)\nwe get\n√\n√\n3\nR −g ≡ Rμμ −g = eh (∂μ h)2 .\n(50)\n2\nIn deriving (50) we have neglected terms of higher order in derivatives and\nconstrained ourselves to the Einstein's gravity. This corresponds to an expansion in powers of the gradients for a slowly varying background field.\nWith this example, we have constructed an effective lagrangian that preserves\nscale invariance of QCD in a classical curved background at a price of a new\ndilaton field h(x).\nConfinement as an event horizon for colored particles?\nIn the previous section we have constructed an effective low-energy lagrangian\nthat preserves the scale invariance. This effective theory is mapped mathematically onto classical QCD on a curved conformal gravitational background. It\nis interesting that this theory may offer a geometrical way of associating confinement with an event horizon for colored particles [8]. In general relativity\nthe appearance of an event horizon occurs through the modification of the underlying space-time structure by the gravitational interaction. Our effective\nlagrangian L depends on a single background field, and the modification of\nthe metric can be computed as follows [36]:\ngμν = ημν L′ − 4 Fαμ Fνα L′′\n\n(51)\n\ng 2 (0)\n1\n1\nFμν F μν 2\n= Fμν F μν ǫ(gF ),\n4\ng (gF )\n4\n\n(52)\n\nwhere the primes indicate first and second derivatives with respect to F ≡\nFμν F μν . The vanishing of the temporal component of the modified metric will\ndefine the compact region of the theory, i.e. the counterpart of a black hole.\nIt is possible to write the effective lagrangian derived from the action (49) as:\nLQCD =\n\nwith the \"dielectric\" constant of the system under the presence of the background field at one loop given by:\n\u0012 2\u0013\ng\nΛ2\nǫ(gF ) ≃ 1 − β0\nln\n.\n(53)\n4π\ngF\nHere β0 = (11Nc − 2Nf )/48π 2 , while Nc and Nf specify the number of colors\nand flavors, respectively. Therefore the effective metric (51) computed for the\nlagrangian (52) can yield the vanishing temporal component g00 = 0 when\n\n\f19\n\ngF ∗ = Λ2 exp{−4π/β0g 2 }.\n\n(54)\n√\nTherefore, an event horizon may be formed at r∗ ∼ 1/ gF ∗ in our effective\ntheory – it would take colored particles an infinite time to escape. In black\nhole physics there is a deep relation between the Hawking temperature and\nthe existence of an event horizon. Consequently, the radiation emitted by a\nblack hole and its evaporation process might be related to thermal hadron\nproduction (see [8] for details).\n\n5 Applications: shear and bulk viscosities.\nTo exemplify the use of the two methods presented previously in sections 4.1\nand 4.2 we will discuss the calculation of two important transport coefficients\nof QCD matter, which can be linked to relevant observables in studies of\nultrarelativistic heavy-ion collisions.\n5.1 Definitions.\nIn finite temperature field theory, the shear and bulk viscosity are defined as\ntransport coefficients of the energy-momentum tensor. For this, we consider a\nplasma slightly out of equilibrium, such that there is local thermal equilibrium\neverywhere, but the temperature and average velocity are allowed to slowly\nvary in space. Then one can define at any point a local rest frame, where the\n3-momentum density vanishes, θi0 = 0. In this frame, one has the following\nconstitutive relation for the energy-momentum tensor [37, 38]:\n→ →\n2\n(55)\nθij = Peq (ǫ)δij − η(∂i uj + ∂j ui − δij ∂k uk ) − ζδij ∇ * u ,\n3\nwhere Peq (ǫ) is the pressure (related to the energy density of the system\nthrough an equilibrium equation of state), η is the shear viscosity, ζ the bulk\nviscosity and ui are the flow velocities. All kinetic coefficients can be expressed, via Kubo formulas, as static limits of correlation functions of the\ncorresponding currents, namely [39]:\nZ\nZ\n1 ∞\n1\nη = lim\ndt d3 r eiωt h[θxy (t, x), θxy (0, 0)]i,\n(56)\n2 ω→0 ω 0\nZ\nZ\n1\n1 ∞\nζ = lim\ndt d3 r eiωt h[θii (t, x), θkk (0, 0)]i.\n(57)\n9 ω→0 ω 0\n\nThe shear viscosity η indicates how much entropy is produced by transformation of shape at constant volume; it is generated by translations. Correspondingly, the bulk viscosity ζ quantifies how much entropy is produced by\ntransformation of volume at constant shape; it is generated by dilatations.\n\n\f20\n\n5.2 The shear viscosity bound.\nIn [40], the ratio of shear viscosity to volume density of entropy η/s is computed for a large class of strongly interacting quantum field theories which\nhave a dual description involving black holes in Anti de Sitter space. This\nratio can be used to characterize how close a given fluid is to being perfect.\nA first step is to relate the shear viscosity as defined in Eq. (56) to the absorption cross-section of low-energy gravitons. We consider a graviton of frequency\nω, polarized in the xy direction and propagating perpendicularly to a brane.\nSince according to the gauge-gravity duality, the stress-energy tensor couples\nto the metric perturbations at the boundary [32], then in the field theory picture the absorption cross-section of the graviton by the brane is proportional\nto the imaginary part of the retarded Green function of the operator coupled\nto hxy , that is θxy :\n\nσabs (ω) = −\n\nκ2\n2κ2\nImGR (ω) =\nω\nω\n\nZ\n\n0\n\n∞\n\ndt\n\nZ\n\nd3 r eiωt h[θxy (t, x), θxy (0, 0)]i,\n\n(58)\n√\nwhere κ = 8πG emerges as a result of the normalization of the graviton's\naction. Upon comparing Eq. (56) to (58), one obtains immediately the shear\nviscosity as a function of the graviton absorption cross-section:\nσabs (0)\nσabs (0)\n=\n.\n(59)\n2κ2\n16πG\nThe next step is to prove that the absorption cross-section of a graviton by a\nblack hole is the same as that of a scalar, which is equal in the low-frequency\nlimit ω → 0 to the area of the horizon, namely σabs (0) = a.\nη=\n\nFinally, one needs to compute the volume density of entropy. Again, we use\nthe dual holographic description and conclude that the entropy of the dual\nfield theory is equal to the entropy of the black brane, which is proportional\nto the area of its event horizon, as found by Beckenstein and Hawking in\nEq. (30). The entropy density is therefore\nkB a\n,\n4Gh̄\nwhich results in a shear viscosity to entropy density ratio of\ns=\n\n(60)\n\nh̄\nη\n.\n=\ns\n4πkB\n\n(61)\n\nIt is remarkable that the result – which applies in the limit of strong coupling,\nwhere the gravity description is appropriate – does not depend on the specific\nmetric chosen, the ratio being the same for various types of Dp- and Mpbranes, even if the corresponding dual theories are very different. Furthermore,\n\n\f21\n\naccording to a conjecture due to the authors of [40], this result can be viewed\nas a universal lower bound for all relativistic quantum field theories at finite\ntemperature and zero chemical potential. The inequality is to be saturated\nby theories with gravity duals. We further refer to [40] for the arguments\nsupporting this conjecture; see also [41, 42] for a discussion of circumstances\nunder which this bound may be violated.\nRecent lattice results [44] give η/s = 0.134(33) for T = 1.65 Tc and η/s =\n0.102(56) for T = 1.24 Tc – the values which are above, but not much above,\nthe bound (61).\n\nFig. 4. The ratio of the shear viscosity to the entropy as a function of T/Tc from\n[43]. KSS bound is 1/4π.\n\nAt the same time, RHIC data provide a limit for the ratio η/s by measuring\nthe elliptic flow of particles produced in very energetic heavy-ion collisions.\nResults so far have pointed towards a very low-viscosity, nearly perfect fluid\nof quarks and gluons [46, 47, 48, 49].\n5.3 Bulk viscosity and hadronization.\nThe transport coefficient of the plasma which is directly related to its conformal properties is the bulk viscosity [9]. Indeed, it is related by Kubo's formula\nto the correlation function of the trace of the energy-momentum tensor. It is\nclear from Eq. (57) that for any conformally invariant theory with θμμ = 0\nthe bulk viscosity should vanish. This is the case for N =4 SUSY Yang-Mills\ntheory. In contrast, a non-zero ζ can be generated by breaking the scale invariance.\nA perturbative evaluation by [38] has yielded very small values for ζ, with the\nratio ζ/η of the order of 10−3 for 3-flavor QCD with αS ≤ 0.3, neglecting quark\n\n\f22\n\nmasses. Specifically, ζ was found to scale with α2S for massless QCD, where\nconformal symmetry is broken by the running of the coupling β(αS ) ∼ α2S :\nζ∼\n\nT3\nα2S T 3\n2 2\n×\n(α\n)\n∼\nf or m0 ≪ αS T.\nS\nα2S log[1/αS ]\nlog[1/αS ]\n\n(62)\n\nThe presence of quark masses also leads to breaking conformal invariance\nprovided that m0 ≤ T , and this time\nζ∼\n\nα2S\n\nT3\nm40\nm2\n× ( 20 )2 ∼\nf or αS T ≪ m0 ≪ T.\n2\nlog[1/αS ]\nT\nT αS log[1/αS ]\n\n(63)\n\nHere m0 refers to the heaviest zero-temperature quark mass which is smaller\nthan or of order of the temperature T. Only the case of weakly coupled QCD,\nwith vanishing or negligible chemical potential μ ∼ 0 was considered. Based\non the above results, we can safely conclude that bulk viscosity is negligibly\nsmall (at least with respect to shear viscosity) in the perturbative regime of\nQCD. Specifically:\nη\n1\nζ\n∼ α2S and ∼ 2 .\ns\ns\nαS\n\n(64)\n\nFig. 5. Shear versus bulk viscosity: η/s and ζ/s (s the entropy density) as a function\nof αS , for Nf =3 QCD, neglecting quark masses. Bulk viscosity ζ has been rescaled\nby a factor of 1000; from [38].\n\nNote that the parametric dependence of the shear and bulk viscosities on the\ncoupling constant (64) can be easily read off the Kubo formulas (56) and (57)\nif we recall the dependence of the QCD action and the trace of the energymomentum tensor on the coupling constant, see (7) and (19).\n\n\f23\n\nBut what happens at strong coupling, where perturbation theory is no longer\napplicable? Such is the regime of interest for the Quark-Gluon Plasma. Lattice\ncalculations [43, 44] indicate that shear viscosity gets small, with η/s not much\nhigher than the conjectured lower bound of 1/4π (refer to Sect. 5.2). Does this\nmean that the bulk viscosity at strong coupling may become large?\nSince the bulk viscosity is related by the Kubo formula (57) to the correlation function of the trace of the energy-momentum tensor, this quantity is\nintimately related to the breaking of scale invariance. In Sect. 4.2, we introduced the low-energy theorems for the correlation functions of the trace of\nthe energy-momentum tensor which do not rely on perturbation theory. Let\nus see what can be said about the bulk viscosity on the basis of this approach;\nwe will follow Ref. [9].\nIn this approach, bulk viscosity can be related to the \"interaction measure\",\ni.e. the expectation value of the trace of the energy-momentum tensor hθi =\nǫ − 3P , where ǫ is the energy density and P is the pressure, both of which\nare measured with high precision on the lattice. Following the definitions and\nconventions of [39], we can re-write Eq. (57) by means of the retarded Green's\nfunction as\n\nζ=\n\n1\n1\nlim\n9 ω→0 ω\n\nZ\n\n∞\n\ndt\n\n0\n\nZ\n\nd3 r eiωt i GR (x) = −\n\n→\n1\n1\nlim Im GR (ω, 0 ),\n9 ω→0 ω\n\n(65)\n\nwhere P-invariance was imposed to yield the last expression. Since the spectral\ndensity is defined as\n→\n1\n(66)\nIm GR (ω, p ),\nπ\nwe can further express the retarded Green's function by using the KramersKonig relation to yield [9]\n→\n\nρ(ω, p ) = −\n\n1\nG (ω, p ) =\nπ\nR\n\n→\n\nZ\n\n∞\n−∞\n\n→\n\nIm GR (u, p )\ndu =\nu − ω − iǫ\n\nZ\n\n∞\n\n−∞\n\n→\n\nρ(u, p )\ndu.\nω − u + iǫ\n\n(67)\n\nNow, relate by analytic continuation the retarded Green's function for a\nbosonic excitation to the corresponding Euclidean Green's function\n→\n\n→\n\nGE (ω, p ) = −GR (iω, p ), ω > 0.\n\n(68)\n\n→\n\nand use (67) together with the fact that ρ(ω, p ) is odd w.r.t. ω to obtain\n→\n\nGE (0, 0 ) = 2\n\nZ\n\n0\n\n∞\n\n→\n\nρ(u, 0 )\ndu.\nu\n\n(69)\n\nWe can now use the set of low-energy theorems [34] satisfied by the correlation\nfunctions of the trace of the energy-momentum tensor θ introduced in Sect. 4.2\n\n\f24\n\nto relate the Euclidean Green's function to the thermal expectation value of\nθ. Following the generalization to the case of finite temperature of [50], we\nget:\nZ\n→\n∂\nE\nG (0, 0 ) = d4 x hT θ(x), θ(0)i = (T\n− 4) hθi .\n(70)\n∂T\nAs discussed before in Sect. 2.3, the scale symmetry of the QCD lagrangian\nis broken by quantum fluctuations, which makes θ acquire a non-zero expectation value. We now know from Eq. (57) that a non-zero bulk-viscosity is\nassociated with hθi 6= 0, fact clearly observed on the lattice for SU(3) gluodynamics [51] (the same holds in the presence of quarks or at large Nc ). So\nlet us relate this thermal expectation value to the quantities computed on the\nlattice via\n(ǫ − 3P )LAT = hθiT − hθi0 with hθi0 = −4 |ǫv | ,\n\n(71)\n\nwhere the zero-temperature expectation value of θ, related to the vacuum\nenergy density ǫv < 0 has to be subtracted. Using Eq. (69), (70), (71) we\nderive an exact sum rule for the spectral density ρ [9]:\n\n2\n\nZ\n\n0\n\n∞\n\n→\n\n∂\n∂ (ǫ − 3P )LAT\nρ(u, 0 )\n+ 16 |ǫv | .\ndu = (T\n− 4) hθiT = T 5\nu\n∂T\n∂T\nT4\n\n(72)\n\nBefore extracting the bulk viscosity from (72), one needs to make an ansatz for\nthe spectral density in the low-frequency regime only – since the perturbative,\ndivergent contribution has already been subtracted in the definition of the\nquantities on the r.h.s. of the sum rule (72). In order to satisfy Eq. (65)\nand (66), the following ansatz has been assumed in [9]:\n→\n\nρ(ω, 0 )\n9ζ ω02\n.\n=\nω\nπ ω02 + ω 2\n\n(73)\n\nUpon substituting Eq. (73) into (72) one obtains the much-sought expression\nfor the bulk viscosity:\n\u001a\n\u001b\n∂ (ǫ − 3P )LAT\n1\nT5\n+\n16\n|ǫ\n|\n.\n(74)\nζ=\nv\n9ω0\n∂T\nT4\nWe have to emphasize that our result depends crucially on the assumed spectral density. The shape of the spectral density (and in particular the presence\nof a ∼ ωδ(ω) term) and the behavior of the relaxation time ∼ ω0−1 in the\nvicinity of the critical point both affect the extracted bulk viscosity.\n\n\f25\n\nContrary to what Kubo's formula (57) may naively imply, ζ is linear rather\nthan quadratic in the difference ǫ − 3P , which seems to be in agreement with\nthe strong-coupling result obtained for the non-conformal SUSY Yang-Mills\ngauge plasma studied by [57]. The parameter ω0 (T ) ∝ T is the scale at which\nperturbation theory becomes valid, i.e. when the lattice calculations of the\nrunning coupling coincide with the perturbative expression at a \u0010given\n\u0011 temT\nT\n<\n3\nit\nwas\nfound\nthat\nω\n(T\n)\n≈\n1.4\nperature. In the region 1 < Tc\n0\nTc GeV .\nApplying Eq. (74) to the lattice data from [51], with |ǫv | = 0.62 Tc4 and Tc =\n0.28 GeV , the bulk viscosity can be extracted and the ratio ζ/s computed as\na function of temperature. It turns out that ζ is indeed small at high T away\nfrom the critical temperature Tc - in agreement with the perturbative results\nof [38], but becomes very large at T close to Tc , as confirmed by recent lattice\ncalculations of [45, 58]. A comparison between the results of [9] and [45] is\ngiven in Fig. 6 below.\n\nFig. 6. ζ/s as a function of T/Tc ; comparison with lattice results [45].\n\nCorroborated with the lattice results for shear viscosity of [43, 44], the present\nresult suggests that bulk viscosity may be the dominant correction to ideal\nhydrodynamics in the vicinity of the deconfinement phase transition in the\nplasma. Several condensed matter systems, such as He3 near the critical\nliquid-vapor point, exhibit an analogous behavior, with a large ratio of ζ/η\naffecting sound propagation in these media [59].\nThe analysis described above has been extended to the case of QCD with 2+1\nquark flavors [10], with qualitatively similar results. This latter case is directly relevant for heavy-ion collision experiments, where the two light flavors\n\"up\" and \"down\", along with strangeness, are produced most abundantly.\nMore recent, high statistics lattice data on the equation of state for QCD\n\n\f26\n\nwith almost physical quark masses from the RIKEN-BNL-Columbia-Bielefeld\ncollaboration [60] are used as an input to extract the bulk viscosity.\nThe behavior of bulk viscosity near the critical temperature in the presence of\nlight quarks has been discussed in the framework of the effective lagrangians,\nsee [52, 53, 54, 55, 56]. It is interesting to note that bulk viscosity can exhibit\na rapid growth in the vicinity of the chiral critical point [10].\nWe should mention that the effects of conformal symmetry breaking on bulk\nviscosity have been studied before in the framework of the gauge-gravity duality, for non-conformal supersymmetric mass-deformed7 N =2∗ Yang-Mills\ntheory in the regime of large 't Hooft coupling gY2 M Nc ≫ 1 in [57], yielding a\nlinear dependence of ζ in ǫ − 3P which is similar to [9]. Further progress has\nbeen made by [61] and [62] in computing bulk viscosity by considering various\nclasses of black hole solutions, which are gravity duals of gauge theories with\nbroken conformal invariance, via the AdS/CFT correspondence introduced in\nsection 4.1. The latter results also yield a rise of ζ in the vicinity of T = Tc ,\nthough much less sharp than the one predicted in [9] and [10].\nBulk viscosity and the mechanism of hadronization.\nLet us now briefly discuss the connection between the growth of bulk viscosity near the critical temperature and an increase in entropy, manifested in\nabundant particle production in heavy-ion collisions. Namely, the expansion\nof QCD matter close to the phase transition, produced in such collisions, is\naccompanied by the production of many soft partons, which screen the color\ncharges of the quarks and gluons present in the medium [10]. Such a scenario\nmay be called \"soft statistical hadronization\", since the produced partons\ncarry low momenta and the hadronization pattern is not expected to depend\non the phase-space distributions of the original partons.\nThe association of inherent entropy to the hadronization process may be similar to the \"black hole hadronization\" picture that associates an event horizon\nto the confinement of colored particles [7, 8]. Since quantum tunnelling turns\nout to be the only allowed means of crossing the event horizon of quarks, one\ncould in principle relate entropy growth and hadron production to a succession\nof quantum tunnelling processes that lead to the emission of thermal radiation, which is the QCD counterpart of the Hawking-Unruh radiation emitted\nby black holes.\nWithin this framework, the results of [9] and [45] shown in Fig. 6 point towards\nthe ζ/s vs. T dependence as a clear indicator of confinement, as seen by the offequilibrium thermodynamics. In heavy-ion collisions, this may be manifested\nthrough both a decrease of the average transverse momentum of the resulting\n7\n\nAssumes the same mass for all fermions and bosons in the theory.\n\n\f27\n\nFig. 7. The mechanism of soft statistical hadronization as an indicator of entropy\ngrowth.\n\nparticles and an increase in the total particle multiplicity. Let us also mention\nan interesting scenario [63] where the growth of bulk viscosity induces an\ninstability in the hydrodynamical flow of the plasma.\n\n6 Limitations of the present approaches and Outlook.\nIn these lectures, we have introduced the two dualities relating QCD and\ngravity, and discussed applications to the computation of the shear and bulk\nviscosities of strongly-coupled QCD matter. However useful and mathematically sound these dual approaches may seem, there are some serious drawbacks\nassociated with the use of these methods which we outline below.\nIn case of the AdS/CFT correspondence presented in section 4.1, it relates\nperturbative string theory calculations to nonperturbative (strong coupling)\ncalculations in the 4 dimensional N = 4 Super Yang-Mills theory, which are\notherwise very difficult to obtain. The ultimate interest is, however, to perform strong coupling calculations in the real world - in QCD, the theory\nof the strong interaction. N = 4 Super Yang-Mills is quite far from QCD,\nin particular by being supersymmetric and conformally invariant. The fact\nthat AdS/CFT is defined for a gauge group SU(Nc ) as a perturbation around\nNc = ∞ further complicates matters.\nIn case of the second method, one major but hopefully solvable problem is to\ninclude the quarks in the effective action. It may also be useful to formulate the\neffective action explicitly as a gravity action in five dimensions and to study\nthe duality of solutions of the effective dilaton-gluon action on one side and\nof the Einstein-Hilbert gravity action on the other. The string–like confining\nsolution of the effective dilaton-gluon action has been obtained recently in [6]\nwhere it was found that the formation of the string is accompanied by the\nemergence of a massless dilaton mode.\n\n\f28\n\nThe two approaches outlined in these lectures are at first glance completely\ndifferent: it is enough to mention that one is essentially guided by conformal\ninvariance whereas the other is driven by the pattern of conformal invariance\nbreaking. Nevertheless, it is quite likely that once the breaking of scale invariance is introduced within the AdS/CFT correspondence on one hand (see\n[64, 65, 61] for work in this direction), and the effective dilaton action is formulated in dual language as a five-dimensional gravity on the other, the two\napproaches may appear closer than it seems at present. In any case, even a\nremote prospect of finding some day a gravity dual of QCD certainly justifies\ngiving it a try.\nD.K. is grateful to H. Satz and B. Sinha for the invitation to deliver these\nlectures and the hospitality in Jaipur. The work of D.K. was supported by\nthe U.S. Department of Energy under Contract No. DE-AC02-98CH10886.\n\nReferences\n1. J. Maldacena: The Large N Limit of Superconformal field theories and supergravity, Adv. Theor. Math. Phys. 2, 231-252 (1998), arXiv:hep-th/9711200.\n2. S. Gubser, I. Klebanov, A. Polyakov: Gauge theory correlators from non-critical\nstring theory, Phys. Lett. B 428, 105-114 (1998), arXiv:hep-th/9802109.\n3. E. Witten: Anti-de Sitter space, thermal phase transition, and confinement in gauge theories, Adv. Theor. Math. Phys. 2, 505-532 (1998),\narXiv:hep-th/9803131.\n4. E. Shuryak, Physics of Strongly coupled Quark-Gluon Plasma, Prog. Part. Nucl.\nPhys. 62, 48 (2009) [arXiv:0807.3033 [hep-ph]].\n5. D. Kharzeev, E. Levin, K. Tuchin: QCD in curved space-time: a conformal bag\nmodel, Phys. Rev. D 70, 054005 (2004), arXiv:hep-ph/0403152; Phys. Lett. B\n547, 21 (2002) [arXiv:hep-ph/0204274].\n6. D. Kharzeev, E. Levin and K. Tuchin, Broken scale invariance, massless dilaton\nand confinement in QCD, arXiv:0809.3794 [hep-ph].\n7. D. Kharzeev and K. Tuchin, From color glass condensate to quark gluon\nplasma through the event horizon, Nucl. Phys. A 753, 316 (2005) [arXiv:hepph/0501234];\nD. Kharzeev, E. Levin and K. Tuchin, Multi-particle Production and Thermalization in High-Energy QCD, Phys. Rev. C 75, 044903 (2007) [arXiv:hepph/0602063].\n8. P. Castorina, D. Kharzeev and H. Satz, Thermal Hadronization and HawkingUnruh Radiation in QCD, Eur. Phys. J. C 52, 187 (2007) [arXiv:0704.1426\n[hep-ph]].\n9. D. Kharzeev, K. Tuchin: Bulk viscosity of QCD matter near the critical temperature, arXiv:0705.4280 [hep-ph].\n10. F. Karsch, D. Kharzeev, K. Tuchin: Universal properties of bulk viscosity near the QCD phase transition, Phys. Lett. B 663, 217 (2008),\narXiv:0711.0914 [hep-ph].\n11. D. J. Gross and F. Wilczek, Ultraviolet behavior of non-Abelian gauge theories,\nPhys. Rev. Lett. 30, 1343 (1973).\n\n\f29\n12. H. D. Politzer, Reliable perturbative results for strong interactions?, Phys. Rev.\nLett. 30, 1346 (1973).\n13. L. D. Landau and I. Y. Pomeranchuk, On Point interactions in quantum electrodynamics, Dokl. Akad. Nauk Ser. Fiz. 102, 489 (1955); also published in\n\"Collected Papers of L.D. Landau\", Edited by D. Ter Haar. Pergamon Press,\n1965. pp. 654-658.\n14. S. Bethke: Determination of the QCD Coupling αs , J. Phys. G 26, R27 (2000),\narXiv:hep-ex/0004021.\n15. I. B. Khriplovich, Green's functions in theories with non-abelian gauge group,\nYad. Fiz. 10, 409 (1969).\n16. V. N. Gribov, Quantization of non-Abelian gauge theories, Nucl. Phys. B 139,\n1 (1978).\n17. D. Zwanziger, No confinement without Coulomb confinement, Phys. Rev. Lett.\n90, 102001 (2003) [arXiv:hep-lat/0209105].\n18. Y. L. Dokshitzer and D. E. Kharzeev, The Gribov conception of quantum chromodynamics, Ann. Rev. Nucl. Part. Sci. 54, 487 (2004) [arXiv:hep-ph/0404216].\n19. J. R. Ellis, Aspects of conformal symmetry and chirality, Nucl. Phys. B 22, 478\n(1970);\nR. J. Crewther, Broken scale invariance in the width of a single dilaton, Phys.\nLett. B 33, 305 (1970);\nM. S. Chanowitz and J. R. Ellis, Canonical Anomalies And Broken Scale Invariance, Phys. Lett. B 40, 397 (1972);\nJ. Schechter, Effective Lagrangian With Two Color Singlet Gluon Fields, Phys.\nRev. D 21, 3393 (1980).\n20. J. C. Collins, A. Duncan and S. D. Joglekar, Trace And Dilatation Anomalies\nIn Gauge Theories, Phys. Rev. D 16, 438 (1977);\nN. K. Nielsen, The Energy Momentum Tensor In A Nonabelian Quark Gluon\nTheory, Nucl. Phys. B 120, 212 (1977).\n21. M. A. Shifman, A. I. Vainshtein and V. I. Zakharov, QCD And Resonance\nPhysics. Sum Rules, Nucl. Phys. B 147, 385 (1979).\n22. K. Wilson, Confinement of quarks, Phys. Rev. D 10:2445, 1974.\n23. A. Ellis: Black Holes - History, Journal of the Astronomical Society of Edinburgh 39, (1999).\n24. K. Schwarzschild: Ü ber das Gravitationsfeld eines Kugel aus inkompressibler\nFlüssigkeit nach der Einsteinschen Theorie, Sitzungsber. Preuss. Akad. D.\nWiss., 424–434 (1916).\n25. J. Oppenheimer, G. Volkoff: On massive neutron cores, Physical Review 55,\n374-381 (1939).\n26. D. Finkelstein: Past-future asymmetry of the gravitational field of a point particle, Phys. Rev. 110, 965-967 (1958).\n27. S. Hawking(1974): Black hole explosions?, Nature 248, 3031 (1974).\n28. W. Busza, R. Jaffe, J. Sandweiss, F. Wilczek: Review of speculative \"disaster\nscenarios\" at RHIC, arXiv:hep-ph/9910333.\n29. H. Nastase: The RHIC fireball as a dual black hole, arXiv:hep-th/0501068.\n30. R. Bousso: The Holographic Principle, arXiv:hep-th/0203101.\n31. H. Nastase: Introduction to AdS-CFT, arXiv:0712.0689 [hep-th].\n32. O. Aharony, S. Gubser, J. Maldacena, H. Ooguri, Y. Oz: Large N Field\nTheories, String Theory and Gravity, Phys. Rept. 323, 183-386 (2000),\narXiv:hep-th/9905111.\n\n\f30\n33. I. Klebanov: TASI Lectures – Introduction to the AdS/CFT Correspondence,\narXiv:hep-th/0009139.\n34. V. A. Novikov, M. A. Shifman, A. I. Vainshtein and V. I. Zakharov, Are All\nHadrons Alike?, Nucl. Phys. B 191, 301 (1981).\n35. A. A. Migdal and M. A. Shifman, Dilaton Effective Lagrangian In Gluodynamics, Phys. Lett. B 114, 445 (1982).\n36. M. Novello, V. A. De Lorenci, J. M. Salim and R. Klippert, Geometrical aspects\nof light propagation in nonlinear electrodynamics, Phys. Rev. D 61, 045001\n(2000) [arXiv:gr-qc/9911085].\n37. G. Policastro, D. Son, A. Starinets: Shear viscosity of strongly coupled N=4\nsupersymmetric Yang-Mills plasma, Phys. Rev. Lett. 87, 081601 (2001),\narXiv:hep-th/0104066.\n38. P. Arnold, C. Dogan, G. Moore: The bulk viscosity of high-temperature QCD,\nPhys.Rev. D 74, 085021 (2006), arXiv:hep-ph/0608012.\n39. E. Lifshitz and L. Pitaevskii: Statistical Physics (Pergamon Press, New York\n1980) Pt. 2, Sec. 90.\n40. P. Kovtun, D. Son, A. Starinets: Viscosity in Strongly Interacting Quantum\nField Theories from Black Hole Physics, Phys. Rev. Lett. 94, 111601 (2005),\narXiv:hep-th/0405231.\n41. Y. Kats and P. Petrov, arXiv:0712.0743 [hep-th].\n42. A. Buchel, R. C. Myers and A. Sinha, arXiv:0812.2521 [hep-th].\n43. A. Nakamura, S. Sakai: Transport Coefficients of Gluon Plasma, Phys. Rev.\nLett. 94, 072305 (2005), arXiv:hep-lat/0406009.\n44. H. Meyer: A calculation of the shear viscosity in SU(3) gluodynamics,\narXiv:0704.1801 [hep-lat].\n45. H. Meyer: A calculation of the bulk viscosity in SU(3) gluodynamics,\narXiv:0710.3717 [hep-lat].\n46. K. Dusling and D. Teaney, Simulating elliptic flow with viscous hydrodynamics,\nPhys. Rev. C 77, 034905 (2008) [arXiv:0710.5932 [nucl-th]].\n47. P. Romatschke and U. Romatschke, Viscosity Information from Relativistic\nNuclear Collisions: How Perfect is the Fluid Observed at RHIC?, Phys. Rev.\nLett. 99, 172301 (2007) [arXiv:0706.1522 [nucl-th]].\n48. M. Luzum and P. Romatschke, Conformal Relativistic Viscous Hydrodynamics:\nApplications to RHIC results at 200 GeV, Phys. Rev. C 78, 034915 (2008)\n[arXiv:0804.4015 [nucl-th]].\n49. H. Song and U. W. Heinz, Extracting the QGP viscosity from RHIC data – a\nstatus report from viscous hydrodynamics, arXiv:0812.4274 [nucl-th].\n50. P. Ellis, J. Kapusta and H. Tang: Low-Energy Theorems for Gluodynamics at\nFinite Temperature, Phys. Lett. B 443, 63 (1998), arXiv:nucl-th/9807071.\n51. G. Boyd, J. Engels, K. Karsch, E. Laermann, C. Legeland, M. Luetgemeier, B.\nPetersson: Thermodynamics of SU(3) lattice gauge theory, Nucl. Phys. B 469,\n419-444 (1996), arXiv:hep-lat/9602007.\n52. K. Paech and S. Pratt, Origins of bulk viscosity at RHIC, Phys. Rev. C 74,\n014901 (2006) [arXiv:nucl-th/0604008].\n53. J. W. Chen and J. Wang, Bulk Viscosity of a Gas of Massless Pions,\narXiv:0711.4824 [hep-ph].\n54. D. Fernandez-Fraile and A. G. Nicola, Bulk viscosity and the conformal anomaly\nin the pion gas, arXiv:0809.4663 [hep-ph].\n55. J. Noronha-Hostler, J. Noronha and C. Greiner, Transport Coefficients of\nHadronic Matter near Tc , arXiv:0811.1571 [nucl-th].\n\n\f31\n56. C. Sasaki and K. Redlich, Transport coefficients near chiral phase transition,\narXiv:0811.4708 [hep-ph].\n57. P. Benincasa, A. Buchel and A. O. Starinets: Sound waves in strongly coupled non-conformal gauge theory plasma, Nucl. Phys. B 733, 160 (2005),\narXiv:hep-th/0507026.\n58. A. Nakamura, S. Sakai: Lattice calculation of the QGP viscosities,\narXiv:0710.3625 [hep-lat].\n59. A. Kogan and H. Meyer, J. Low Temp. Phys. 110, 899 (1998).\n60. M. Cheng et al: The QCD Equation of State with almost Physical Quark Masses,\narXiv:0710.0354 [hep-lat].\n61. S. Gubser, A. Nellore, S. Pufu, F. Rocha: Thermodynamics and bulk viscosity\nof approximate black hole duals to finite temperature quantum chromodynamics,\narXiv:0804.1950 [hep-th].\n62. S. Gubser, S. Pufu, F. Rocha: Bulk viscosity of strongly coupled plasmas with\nholographic duals, arXiv:0806.0407 [hep-th].\n63. G. Torrieri and I. Mishustin, Instability of Boost-invariant hydrodynamics with\na QCD inspired bulk viscosity, Phys. Rev. C 78, 021901 (2008) [arXiv:0805.0442\n[hep-ph]].\n64. A. Karch, E. Katz, D. T. Son and M. A. Stephanov, Linear Confinement and\nAdS/QCD, Phys. Rev. D 74, 015005 (2006) [arXiv:hep-ph/0602229].\n65. U. Gursoy and E. Kiritsis, Exploring improved holographic theories for QCD,\nJHEP 0802, 032 (2008) [arXiv:0707.1324 [hep-th]]; JHEP 0802, 019 (2008)\n[arXiv:0707.1349 [hep-th]].\n\n\f"}