{"id": "http://arxiv.org/abs/0904.4907v1", "guidislink": true, "updated": "2009-04-30T18:25:02Z", "updated_parsed": [2009, 4, 30, 18, 25, 2, 3, 120, 0], "published": "2009-04-30T18:25:02Z", "published_parsed": [2009, 4, 30, 18, 25, 2, 3, 120, 0], "title": "Protoplanetary Disk Evolution around the Triggered Star Forming Region\n  Cepheus B", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0904.1356%2C0904.1047%2C0904.1682%2C0904.1350%2C0904.4591%2C0904.0831%2C0904.1108%2C0904.3400%2C0904.0622%2C0904.3221%2C0904.3607%2C0904.2147%2C0904.1446%2C0904.2707%2C0904.2572%2C0904.4399%2C0904.3790%2C0904.3732%2C0904.0168%2C0904.4819%2C0904.3262%2C0904.4858%2C0904.2650%2C0904.1454%2C0904.4545%2C0904.1396%2C0904.1033%2C0904.3780%2C0904.3825%2C0904.2071%2C0904.4890%2C0904.0954%2C0904.1202%2C0904.0091%2C0904.4705%2C0904.1558%2C0904.1824%2C0904.0825%2C0904.3778%2C0904.0960%2C0904.0993%2C0904.2874%2C0904.3358%2C0904.1700%2C0904.4262%2C0904.0397%2C0904.2346%2C0904.0314%2C0904.0975%2C0904.0841%2C0904.3714%2C0904.4907%2C0904.2948%2C0904.4468%2C0904.3718%2C0904.3785%2C0904.1878%2C0904.0713%2C0904.4413%2C0904.0097%2C0904.3508%2C0904.3195%2C0904.2146%2C0904.1068%2C0904.3364%2C0904.1681%2C0904.1322%2C0904.4550%2C0904.3990%2C0904.3817%2C0904.1729%2C0904.0597%2C0904.0143%2C0904.1540%2C0904.3419%2C0904.0999%2C0904.3648%2C0904.1754%2C0904.1920%2C0904.4710%2C0904.3806%2C0904.1154%2C0904.2810%2C0904.0508%2C0904.3534%2C0904.2109%2C0904.3812%2C0904.3515%2C0904.3069%2C0904.2586%2C0904.3737%2C0904.3127%2C0904.3330%2C0904.3477%2C0904.2800%2C0904.2083%2C0904.0398%2C0904.2934%2C0904.3260%2C0904.3277%2C0904.0655&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Protoplanetary Disk Evolution around the Triggered Star Forming Region\n  Cepheus B"}, "summary": "The Cepheus B (CepB) molecular cloud and a portion of the nearby CepOB3b OB\nassociation, one of the most active regions of star formation within 1 kpc,\nhave been observed with the IRAC detector on board the Spitzer Space Telescope.\nThe goals are to study protoplanetary disk evolution and processes of\nsequential triggered star formation in the region. Out of ~400 pre-main\nsequence (PMS) stars selected with an earlier Chandra X-ray Observatory\nobservation, 95% are identified with mid-infrared sources and most of these are\nclassified as diskless or disk-bearing stars. The discovery of the additional\n>200 IR-excess low-mass members gives a combined Chandra+Spitzer PMS sample\ncomplete down to 0.5 Mo outside of the cloud, and somewhat above 1 Mo in the\ncloud. Analyses of the nearly disk-unbiased combined Chandra+Spitzer selected\nstellar sample give several results. Our major finding is a spatio-temporal\ngradient of young stars from the hot molecular core towards the primary\nionizing O star HD 217086. This strongly supports the radiation driven\nimplosion (RDI) model of triggered star formation in the region. The empirical\nestimate for the shock velocity of 1 km/s is very similar to theoretical models\nof RDI in shocked molecular clouds...ABRIDGED... Other results include: 1.\nagreement of the disk fractions, their mass dependency, and fractions of\ntransition disks with other clusters; 2. confirmation of the youthfulness of\nthe embedded CepB cluster; 3. confirmation of the effect of suppression of\ntime-integrated X-ray emission in disk-bearing versus diskless systems.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0904.1356%2C0904.1047%2C0904.1682%2C0904.1350%2C0904.4591%2C0904.0831%2C0904.1108%2C0904.3400%2C0904.0622%2C0904.3221%2C0904.3607%2C0904.2147%2C0904.1446%2C0904.2707%2C0904.2572%2C0904.4399%2C0904.3790%2C0904.3732%2C0904.0168%2C0904.4819%2C0904.3262%2C0904.4858%2C0904.2650%2C0904.1454%2C0904.4545%2C0904.1396%2C0904.1033%2C0904.3780%2C0904.3825%2C0904.2071%2C0904.4890%2C0904.0954%2C0904.1202%2C0904.0091%2C0904.4705%2C0904.1558%2C0904.1824%2C0904.0825%2C0904.3778%2C0904.0960%2C0904.0993%2C0904.2874%2C0904.3358%2C0904.1700%2C0904.4262%2C0904.0397%2C0904.2346%2C0904.0314%2C0904.0975%2C0904.0841%2C0904.3714%2C0904.4907%2C0904.2948%2C0904.4468%2C0904.3718%2C0904.3785%2C0904.1878%2C0904.0713%2C0904.4413%2C0904.0097%2C0904.3508%2C0904.3195%2C0904.2146%2C0904.1068%2C0904.3364%2C0904.1681%2C0904.1322%2C0904.4550%2C0904.3990%2C0904.3817%2C0904.1729%2C0904.0597%2C0904.0143%2C0904.1540%2C0904.3419%2C0904.0999%2C0904.3648%2C0904.1754%2C0904.1920%2C0904.4710%2C0904.3806%2C0904.1154%2C0904.2810%2C0904.0508%2C0904.3534%2C0904.2109%2C0904.3812%2C0904.3515%2C0904.3069%2C0904.2586%2C0904.3737%2C0904.3127%2C0904.3330%2C0904.3477%2C0904.2800%2C0904.2083%2C0904.0398%2C0904.2934%2C0904.3260%2C0904.3277%2C0904.0655&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Cepheus B (CepB) molecular cloud and a portion of the nearby CepOB3b OB\nassociation, one of the most active regions of star formation within 1 kpc,\nhave been observed with the IRAC detector on board the Spitzer Space Telescope.\nThe goals are to study protoplanetary disk evolution and processes of\nsequential triggered star formation in the region. Out of ~400 pre-main\nsequence (PMS) stars selected with an earlier Chandra X-ray Observatory\nobservation, 95% are identified with mid-infrared sources and most of these are\nclassified as diskless or disk-bearing stars. The discovery of the additional\n>200 IR-excess low-mass members gives a combined Chandra+Spitzer PMS sample\ncomplete down to 0.5 Mo outside of the cloud, and somewhat above 1 Mo in the\ncloud. Analyses of the nearly disk-unbiased combined Chandra+Spitzer selected\nstellar sample give several results. Our major finding is a spatio-temporal\ngradient of young stars from the hot molecular core towards the primary\nionizing O star HD 217086. This strongly supports the radiation driven\nimplosion (RDI) model of triggered star formation in the region. The empirical\nestimate for the shock velocity of 1 km/s is very similar to theoretical models\nof RDI in shocked molecular clouds...ABRIDGED... Other results include: 1.\nagreement of the disk fractions, their mass dependency, and fractions of\ntransition disks with other clusters; 2. confirmation of the youthfulness of\nthe embedded CepB cluster; 3. confirmation of the effect of suppression of\ntime-integrated X-ray emission in disk-bearing versus diskless systems."}, "authors": ["Konstantin V. Getman", "Eric D. Feigelson", "Kevin L. Luhman", "Aurora Sicilia-Aguilar", "Junfeng Wang", "Gordon P. Garmire"], "author_detail": {"name": "Gordon P. Garmire"}, "author": "Gordon P. Garmire", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0004-637X/699/2/1454", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0904.4907v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0904.4907v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Accepted for publication in The Astrophysical Journal. 48 pages, 14\n  figures. For a version with high-quality figures, see\n  http://www.astro.psu.edu/users/gkosta/RESEARCH/cepb_spitzer_chandra.pdf", "arxiv_primary_category": {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0904.4907v1", "affiliation": "Penn State", "arxiv_url": "http://arxiv.org/abs/0904.4907v1", "journal_reference": "Astrophys.J.699:1454-1472,2009", "doi": "10.1088/0004-637X/699/2/1454", "fulltext": "arXiv:0904.4907v1 [astro-ph.SR] 30 Apr 2009\n\nAccepted for publication in The Astrophysical Journal\n04/30/09\n\nProtoplanetary Disk Evolution around the Triggered Star\nForming Region Cepheus B\nKonstantin V. Getman1 , Eric D. Feigelson1,2 , Kevin L. Luhman1,2 , Aurora Sicilia-Aguilar3 ,\nJunfeng Wang4 , Gordon P. Garmire1\ngkosta@astro.psu.edu\nABSTRACT\nThe Cepheus B (Cep B) molecular cloud and a portion of the nearby\nCep OB3b OB association, one of the most active regions of star formation\nwithin 1 kpc, have been observed with the IRAC detector on board the Spitzer\nSpace Telescope. The goals are to study protoplanetary disk evolution and processes of sequential triggered star formation in the region. Out of ∼ 400 pre-main\nsequence (PMS) stars selected with an earlier Chandra X-ray Observatory observation, ∼ 95% are identified with mid-infrared sources and most of these are\nclassified as diskless or disk-bearing stars. The discovery of the additional > 200\nIR-excess low-mass members gives a combined Chandra+Spitzer PMS sample\nthat is almost complete down to 0.5 M⊙ outside of the cloud, and somewhat\nabove 1 M⊙ in the cloud.\nAnalyses of the nearly disk-unbiased combined Chandra and Spitzer selected\nstellar sample give several results. Our major finding is a spatio-temporal gradient of young stars from the hot molecular core towards the primary ionizing\nO star HD 217086. This strongly supports the radiation driven implosion (RDI)\nmodel of triggered star formation in the region. The empirical estimate for the\nshock velocity of ∼ 1 km/s is very similar to theoretical models of RDI in shocked\n1\n\nDepartment of Astronomy & Astrophysics, 525 Davey Laboratory, Pennsylvania State University, University Park PA 16802\n2\n\nCenter for Exoplanets and Habitable Worlds, 525 Davey Laboratory, Pennsylvania State University,\nUniversity Park PA 16802\n3\n\nMax-Planck-Institut fur Astronomie, Konigstuhl 17, 69117 Heidelberg, Germany\n\n4\n\nHarvard-Smithsonian Center for Astrophysics, 60 Garden Street, Cambridge, MA 02138, USA\n\n\f–2–\nmolecular clouds. The initial mass function (IMF) of the lightly obscured triggered population exhibits a standard Galactic field IMF shape. The unusually\nhigh apparent value of & 70% star formation efficiency inferred from the ratio\nof star mass to current molecular gas mass indicates that most of the Cep B\nmolecular cloud has been already ablated or transformed to stars. Contrary to\nthe current RDI simulations, our findings indicate that star formation triggering\nby HII region shocks is not restricted to a single episode but can continue for\nmillions of years. Other results include: 1. agreement of the disk fractions, their\nmass dependency, and fractions of transition disks with other clusters; 2. confirmation of the youthfulness of the embedded Cep B cluster; 3. confirmation of\nthe effect of suppression of time-integrated X-ray emission in disk-bearing versus\ndiskless systems.\nSubject headings: ISM: individual (Cepheus B cloud) - open clusters and associations: individual (Cepheus OB3) - stars: protoplanetary disks - stars: pre-main\nsequence - stars: formation - X-rays: stars\n\n1.\n\nINTRODUCTION\n\nCepheus B (Cep B) is a molecular core located at the edge of the Cepheus giant molecular cloud at a distance around 725 pc and lying 2.6◦ above the Galactic Plane (Sargent\n1977; Yu et al. 1996). A handful of embedded young stars were found in Cep B from radio\ncontinuum and infrared (IR) studies (Felli et al. 1978; Testi et al. 1995). The unobscured\nstellar OB association Cep OB3 lies around Cep B; the younger subgroup, Cep OB3b, lies\nclosest to the cloud as shown in Figure 1 (Blaauw 1964; Kun et al. 2008). For many years,\nthe Cep OB3 association has been considered to be a good example of large-scale sequential\nstar formation in accord with the model of Elmegreen & Lada (1977) where stellar winds\nand supernova remnants of an older stellar cluster compress and trigger a second generation\nof star formation in nearby molecular cloud cores (Sargent 1979).\nThe interface between the molecular cloud and the Cep OB3b star association is clearly\ndelineated by the optically bright HII region Sharpless 155 (S 155), where cloud material is\nionized and heated by the radiation field of the O7 star HD 217086, B1 star HD 217061 and\nperhaps other cluster members (Panagia & Thum 1981; Beuther et al. 2000). Figure 1 shows\nthe spatial relationship of the cloud, HII region, and exciting stars. Unlike in the Orion\nNebula where the HII region lies between the cloud and ourselves, the photodissociation\nregion at S 155 is favorably oriented to reveal the progression of star formation. Following\nthe triggered star formation model, we expect the surface of the cloud to be eroded by the\n\n\f–3–\nearly-type stars so that the cloud edge moves eastward across the observer's field of view\nwith new stars emerging from the obscuring molecular cloud. Sources located within but\nnear the edge of the molecular cloud would represent a new generation of star formation\ntriggered by the HII region shock propagating into the cloud.\nThis scenario of triggered star formation has been recently strengthened by the discovery\nusing the Chandra X-ray Observatory of > 300 lightly-obscured low-mass pre-main sequence\n(PMS) members of the Cep OB3b cluster located outside of the cloud, and a rich population\nof ∼ 60 PMS stars in the cluster embedded within Cep B (Getman et al. 2006). X-ray surveys\nare particularly effective in discriminating disk-free PMS populations from Galactic field stars\nwhich often badly contaminate infrared (IR) surveys of young stellar clusters (see review\nby Feigelson et al. 2007). Using 2MASS counterparts of the X-ray sources, Getman et al.\n(2006) found that PMS stars in the embedded cluster are more likely (26% vs. 4%) to\nhave K-band excesses from heated inner protoplanetary disks than stars in the unobscured\nCep OB3 region. This supports both, youthfulness of the embedded Cep B population and\nthe prevalence of planet forming disks in the embedded cluster.\nWe seek here to elucidate the relationships of disks and environments in this region using\nmid-IR photometry from the Spizer Space Telescope which is exceptionally well-suited for detecting disks around low-mass members of young clusters (e.g. Allen et al. 2004; Sicilia-Aguilar et al.\n2006; Luhman et al. 2008b, and references therein). Measures of disk fractions as functions of\nstellar mass and age in different star-forming environments can provide better understanding\nof the evolution of circumstellar disks in different environments and thus have direct astrophysical importance in evaluating the conditions for planet formation. X-ray PMS selection is\nvery complementary to IR surveys. As X-ray emission from PMS stars is based on enhanced\nsolar-type magnetic reconnection events rather than disk or accretion processes, X-ray selection delivers rich and clean samples of diskless stars missed by IR selection (Feigelson et al.\n2007). The X-ray stars identified by Getman et al. (2006) in combination with discovered\nhere Spitzer disk-bearing stars constitute a valuable sample to measure protoplanetary disk\nproperties in different radiative environments and to study the triggering process inside the\nCep B molecular cloud. We use the spatial distribution of disks around young stars of the\nselected Chandra and Spitzer sample to test concepts of cloud ablation and the radiative\ndriven implosion (RDI) model of triggered star formation on the edges of HII regions (e.g.,\nBertoldi 1989).\nIn §2 we report the Spitzer observations using the InfraRed Array Camera (IRAC)\ndetector. Classification on disk-bearing and diskless X-ray emitting PMS stars is provided\nin §3 and the discovery of the new population of non-Chandra IR-excess members is given\nin §4. The IMF and mass completeness limits of the combined Chandra and Spizer stellar\n\n\f–4–\nsamples of different parts of the region are considered in §5. The results on the disk evolution\nof the selected PMS sample are presented in §6. We end in §7 with the implications of the\nnew observational findings for the star formation process in the region. We adopt a distance\nof 725 pc to the star forming complex and infer an age of 2 − 3 Myr for the Cep OB3b stars\nand an age between < 1 and 2 Myr for the embedded Cep B stars, as discussed in Appendix\nA. Appendix B presents the relationship between X-ray activity, stellar mass and disks;\nthese results confirm those found in other young stellar clusters.\n\n2.\n\nCHANDRA AND SPITZER OBSERVATIONS\n2.1.\n\nX-ray Data\n\nThe X-ray observations of the Cep B/OB3b and their data analysis are described in detail by Getman et al. (2006). The 30 ks exposure was obtained on 2003 March 11.51 − 11.88\nwith the Advanced CCD Imaging Spectrometer (ACIS) detector (Garmire et al. 2003) onboard NASA's Chandra X-ray Observatory (Weisskopf et al. 2002) as part of the ACIS Instrument Team's Guaranteed Time Observions (ObsId #3502, G. Garmire, PI). The imaging\narray (ACIS-I) consists of four abutted 1024 × 1024 pixel front-side illuminated chargecoupled devices (CCDs) covering about 17′ × 17′ on the sky. Following data reduction based\non the ACIS Extract IDL script, Getman et al. (2006) obtained an X-ray catalog of 431\nsources, most with < 0.5′′ positional accuracy (Figure 2). Using 2MASS counterparts, 89%\nof the X-ray sources are confidently associated with cluster PMS members of the region. The\nremaining X-ray sources are mostly extragalactic active galactic nuclei.\n\n2.2.\n\nIRAC Data\n\nThe mid-IR observation of Cep B and Cep OB3b was obtained on 2007 February 18\nwith the IRAC detector (Fazio et al. 2004) on NASA's Spitzer Space Telescope in the 3.6,\n4.5, 5.8, and 8.0 μm channels. This is a General Observer project (program identification\n#30361; J. Wang, PI). Two adjacent fields subtending ∼ 20′ ×15′ in channel pairs 3.6/5.8 μm\nand 4.5/8.0 μm were centered, respectively, on α = 22h 57m 09.s 7, δ = +62◦37′ 52.′′ 3 (J2000)\nand α = 22h56m 20.s 3, δ = +62◦ 41′ 43.′′ 0 (J2000). The orientation of the fields long axis is\nP.A. = 36.3◦ . These fields were imaged with a 3 × 4 mosaic of adjacent positions separated\nby 290′′ , and images were taken at 12 dithered positions for each of the 12 cells of the mosaic.\nThe images were taken in the high-dynamic-range mode with long effective exposures of 96.8 s\nin 3.6, 4.5, 5.8 μm channels, and two 46.8 s exposures in the 8.0 μm channel, as well as short\n\n\f–5–\neffective exposures of 0.4 s in all 4 channels. Full coverage in all four channels is obtained\nfor a ∼ 13′ × 15′ area, which in turn covers ∼ 65% of the 17′ × 17′ Chandra's ACIS-I field,\nas shown in Figures 1 and 2.\nBasic Calibrated Data (BCD) products from the Spitzer Science Center's IRAC pipeline\nversion S15.3.0 were automatically treated with the WCSmosaic IDL package developed by R.\nGutermuth for the IRAC instrumental team. Starting with BCD data products, the package\nmosaics individual exposures while treating bright source artifacts, cosmic ray rejection,\ndistortion correction, subpixel offsetting, and background matching (Gutermuth et al. 2008).\nWe selected a plate scale of 0.86′′ for the reduced IRAC mosaics, which is the native scale\n√\ndivided by 2.\nAperture photometry of IRAC sources was obtained using the IRAF task PHOT. For\nthe most of the X-ray and non-Xray (§4) selected sources, an aperture radius of 4 pixels\n(3.44′′ ) was used with an adjoining sky annulus width of 1 and 6 pixels (0.86′′ and 5.16′′ ) for\nthe 3.6/4.5 and 5.8/8.0 μm bands, respectively. For the crowded sources, aperture radii of 2\nor 3 pixels (1.72′′ and 2.58′′ ) and adjoining sky annulus width of 1 pixel (0.86′′ ) in all 4 bands\nwere used. We adopted zero point magnitudes (ZP ) of 19.670, 18.921, 16.855, and 17.394\nin the 3.6, 4.5, 5.8, and 8.0 μm bands, where M = −2.5 log(DN/sec) + ZP (Reach et al.\n2005). The total aperture corrections applied to our measurements are: 0.185, 0.175, 0.165,\n0.250 in the case of 4 pixel aperture; 0.275, 0.305, 0.515, 0.735 in the case of 3 pixel aperture;\nand 0.655, 0.735, 1.005, 1.010 in the case of 2 pixel aperture in the 3.6, 4.5, 5.8, and 8.0 μm\nbands, respectively. The reported photometric errors include Poisson errors in the source\nand background emission plus a 2% uncertainty in the calibration of IRAC (Reach et al.\n2005).\n\n2.3.\n\nIRAC Counterparts to X-ray Sources\n\nThe initial list of point sources in these images was produced by running IRAF task\nSTARFIND with a low detection threshold in order to identify as many sources as possible,\npermitting false detections in this stage of the analysis. An automated cross-correlation\nbetween the Chandra source positions of Getman et al. (2006) and IRAC candidate source\npositions was made using a search radius of 2′′ within ∼ 6′ of the ACIS field center, and\na search radius of 3.5′′ in the outer regions of the ACIS field where X-ray source positions\nare more uncertain due to the deterioration of the Chandra telescope point spread function\n(Figure 2). This was followed by a careful visual examination of each source in both bands\nto remove dubious sources and associations.\n\n\f–6–\nOf the 431 X-ray sources within the 17′ ×17′ Chandra ACIS-I field (Getman et al. 2006),\n396 (92%) lie within the 3.6/5.8 μm IRAC coverage and 412 (96%) lie within the 4.5/8.0 μm\nIRAC coverage. Out of [396, 412, 396, 412] X-ray sources in the [3.6, 4.5, 5.8, 8.0 μm]\nchannels, [384, 399, 369, 385] are identified with IRAC sources. The IRAC detection rate\nof X-ray sources is thus ∼ 97% for 3.6 and 4.5 μm channels and ∼ 93% for 5.8 and 8.0 μm\nchannels.\n2MASS associations are obtained as described in Getman et al. (2006). Optical counterparts were identified from the V Ic photometric catalog of Mayne et al. (2007)1 . Unlike\nthe search for the IR counterparts, we lacked the ability to visually examine the Chandraoptical matches. We therefore compared the Chandra-optical offset (Off1 in Table 1) with\nthe Chandra-2MASS and Chandra-IRAC positional offsets (Off2 and Off3 ). Accepted optical matches typically have |Off 1 − Off 2,3 | . 0.2′′ . Out of the total of 431 Chandra X-ray\nsources, 368 are in the field of view of the optical survey and 321 of them have optical\ncounterparts. The detection rate of the X-ray sources in the optical survey is thus ∼ 87%.\nThere are [12, 13, 27, 27] X-ray sources in the [3.6, 4.5, 5.8, 8.0 μm] channels lacking\nmid-IR counterparts. Roughly half of these lie in the interface region between the Cep B\nmolecular cloud and S 155 HII region where the IRAC point source sensitivity is reduced\nby the high background nebular emission from heated dust (Figure 1). These are probably\ntrue cluster members, but are omitted from the science analysis below. The other half of\nthese unidentified X-ray sources is uniformly distributed outside of the Cep B cloud with\nweak X-ray fluxes and high X-ray median energies consistent with extragalactic background\nsources. Most of these are listed in Table 4 of Getman et al. (2006) as likely extragalactic\ncontaminants.\nThe results of this search for stellar counterparts of the Chandra sources are presented in\nTable 1. Listed by Chandra sequence number, the table gives offsets between the optical/IR\nstars and the X-ray sources, V Ic JHKs and IRAC photometry, and photometric flags. The\nfinal column gives the aperture used in the photometry for each IRAC band; a '9' value\nindicates that the X-ray source lies outside the IRAC coverage in that band or the IRAC\nsource is too weak or strongly contaminated with no reliable photometry.\n1\n\nThe optical survey encompasses most of the Chandra-ACIS-I field and extends further from the ACIS-I\n∼ 15′ to the north-west and ∼ 20′ to the west.\n\n\f–7–\n3.\n\nPRE-MAIN SEQUENCE DISK CLASSIFICATION\n\nWe base the evolutionary classification of X-ray emitting PMS stars in the Cepheus\nregion on a comparison of their IR spectral energy distributions (SEDs) with the SEDs of\nPMS stars in the well-studied IC 348 cluster in the Perseus molecular cloud (Lada et al.\n2006). IC 348 stars have roughly the same 2 − 3 Myr age as Cep OB3b stars. The categories\nare: Class I (protostar, disk and envelope), Class II (PMS star and accretion disk), and\nClass III (PMS star with weak or absent disks). A simple characterization of IR SEDs\ninvolves the SED spectral slope α of the SED α = d log(λFλ )/d log(λ) over the range 2 <\nλ < 20μm. Class I sources have 0 < α . 3, Class II sources have −2 . α ≤ 0, and Class III\nsources have −3 < α . −2. Using optical and IR data for the IC 348 PMS stars, Lada et al.\n(2006) showed the utility of the SED slope measured in the IRAC wavelength range from\n3.6 to 8.0 μm. Comparing optical and IRAC SEDs to disk models calculated from a Monte\nCarlo radiative transfer code (Wood et al. 2002; Walker et al. 2004), they find that Class II\nsystems with optically thick disks have dereddened IRAC slopes αd > −1.8, \"transition disk\"\n(TD) systems with inner disk holes or optically thin inner disks have −2.56 < αd < −1.8, and\ndiskless Class III systems have αd < −2.56. Lada et al. (2006) also provide useful empirical\ntemplates of median SEDs of IC 348 PMS stars for each evolutionary class.\nWe proceed with the disk classifications through the comparison of the observed Cepheus\nSEDs in 2MASS+IRAC IR bands to the (de)reddened median SED templates of IC 348 PMS\nstellar photospheres. We further confirm these classifications through calculations of the SED\nslope α, and locations in IRAC color-color diagrams. Results of our disk classification are\nshown in Table 2.\n\n3.1.\n\nComparison with IC 348\n\nFirst, a rough estimate of individual stellar masses of the Cepheus PMS stars is made\nby de-reddening star positions in the J versus J − H color-magnitude diagram to the 3 Myr\nand 2 Myr theoretical isochrons for the Cep OB3b/S 155 and Cep B subregions, respectively,\nbased on the models of Siess et al. (2000) and Baraffe et al. (1998, see Appendix A). These\nindividual stellar photometric mass and extinction estimates are listed in Table 2. Although\nindividual mass estimates may be subject to significant uncertainties and may not be always\ncompatible with masses obtained by more accurate methods such as optical spectroscopy,\nthis approach should be adequate to assign an IC 348 SED template (Table 4 of Lada et al.\n2006) to individual Cepheus PMS stars.\nSecond, it is important to note that the IC 348 template SEDs are observed (not de-\n\n\f–8–\nreddened) and exhibit an extinction of AV ∼ 2 − 2.5 mag (Lada et al. 2006). Thus for each\nof the Cepheus stars, an IC 348 template SED at the corresponding spectral sub-class is first\nreddened and de-reddened within the wide but finite range of extinctions using reddening\nrelationships described in Appendix A for JHKs and Flaherty et al. (2007) for IRAC bands.\nThe (de)reddened IC 348 template which, after normalization to an observed J-band Cepheus\nSED point, is the closest to an observed H-band Cepheus point (both J and H-band points\nare considered to be indicators of a pure photospheric emission) is recognized here as the\nbest-fit to Cepheus data. Third, the best-fit IC 348 (de)reddened median template is visually\nmatched to the observed Cepheus SED, allowing classification of the Cepheus stars.\nOut of the total of 431 X-ray Cepheus sources, our classification procedure yields 215\ndiskless Class III systems (labelled \"NoD\" in Table 2) and 139 Class II or I disk-bearing systems (\"DSK\"). Based on the membership analysis of Getman et al. (2006), 24 X-ray sources\nwithout IR counterparts are possible extragalactic contaminants (\"EXG\") and 13 are foreground candidates (\"FRG\"). Forty Chandra sources with IR detections which are unreliable\nor insufficient for classification have an uncertain classification (\"UNC\"). We further subjectively classify 20 stars as Class II/III transition disks (labelled as \"TD\" and \"DSK\"); these\nfollow the photospheric SED at wavelengths shorter than at least ∼ 3.6μm. Four Chandra\nsources ( ## 314, 322, 328, and 390) embedded in the Cep B core have extreme SED excesses\nwith α > 0 and are classified as Class I stars.\nExamples of diskfree, disk-bearing, and transition SEDs are shown in Figures 3-5. The\ncomplete set of SEDs for 354 X-ray emitting Cepheus PMS stars classified here is available\non-line as a Figure Set. The on-line atlas contains 161 diskfree stars of the Cep OB3b region\n(labelled as \"NoD\" and \"CepOB3b\" in Table 2); 75 disk-bearing stars of the Cep OB3b\n(\"DSK\" and \"CepOB3b\"); 36 diskfree stars of the S 155 region (\"NoD\" and \"S 155\"); 26 diskbearing stars of the S 155 region (\"DSK\" and \"S155\"); 18 diskfree stars in the Cep B region\n(\"NoD\" and \"CepB\"); and 38 disk-bearing stars in the Cep B region (\"DSK\" and \"CepB\").\nQuantitative information derived from the fitting process is given in Table 2 including the\nmasses and absorptions estimated from the J − (J − H) color-magnitude diagram (columns\n4 and 5) and the SED classification obtained by comparison with IC 348 templates (columns\n6 and 7).\n\n3.2.\n\nCalculation of SED slope α\n\nWe performed least-squares linear fits to the log(λFλ ) values in the four IRAC wavelength band to obtain the observed (not de-reddened) SED spectral index, α0 . These are\ntabulated in column 2 of Table 2. Figure 6 shows the histogram of 354 α0 values for the X-ray\n\n\f–9–\nselected Cepheus PMS stars compared to 299 IC 348 PMS stars from Lada et al. (2006).\nTwo important features are noted. First, the Cepheus histogram shows a bimodal\ndistribution with peaks at α0 ∼ −1.3 and −2.7 corresponding to disk-bearing and diskless\nstar samples, respectively. The IC 348 histogram has the same peaks, and similar bi-modality\nis seen in the PMS populations of the Cha I cloud (Luhman et al. 2008a) and σ Ori cluster\n(Hernández et al. 2007). Second, in contrast to the IC 348 population, the Cepheus region\ndoes not produce a rich TD population in the interval −2.6 < α0 < −1.8. The X-ray selected\nCepheus population has 20/139 (14%) TDs among disk-bearing stars compared to 70/163\n(43%) in IC 348. This apparent difference in TD frequency is discussed in § 6.3.\n3.3.\n\nIRAC Color-Color Diagrams\n\nComparison of Spitzer-IRAC source positions in the [3.6] −[4.5] vs. [5.8] −[8.0] diagram\nwith the results of models of stars with dusty disks and envelopes led Allen et al. (2004) and\nMegeath et al. (2004) to propose this diagram as an excellent tool for PMS classification.\nHartmann et al. (2005) show that similarly successful PMS classification schemes can be\nobtained at shorter wavelengths using the [3.6] − [4.5] vs. [4.5] − [5.8] and Ks − [3.6] vs.\n[3.6] − [4.5] diagrams. In Figure 7, we compare the SED-based classifications of Cepheus\nX-ray stars derived in §3.1 with the expected loci of PMS stars in IRAC color-color diagrams.\nHere we also begin comparison of the disk characteristics in three spatial subregions: the\nunobscured Cep OB3b cluster, the optically-bright S 155 nebula, and the Cep B molecular\ncloud core. The regions are measured radially from the location of the hot molecular core\nat α = 22h 57m 15.s 2, δ = +62◦37′ 11.′′ 1 (J2000).\nFigure 7 shows the three IRAC color-color diagrams for the sources in the three subregions. Seventy-seven Cep OB3b sources are missing from the plots due to inadequate\nphotometry, often due to location outside of the full four-band coverage. Sources are also\nomitted from the S 155 and Cep B areas when photometry at the longer 5.8 μm and 8.0 μm\nbands are absent or inaccurate due to bright nebular emission. The positions of stars in the\ncolor-color diagrams generally agree with our previous classification of stars as disk-bearing\nand diskless PMS stars based on comparison with IC 348 stars (§3.1), shown as blue and red\nsymbols in Figure 7. The F2 flag of Table 2 indicates sources with their disk classification\nfrom 3.1 inconsistent with the simple color criterion that diskless stars have [3.6]−[4.5] . 0.2,\n[4.5] − [5.8] . 0.2 or [5.8] − [8.0] . 0.2. Several sources with such \"discrepant\" locations on\ncolor-color diagrams may represent additional cases of transitional disks.\n\n\f– 10 –\n4.\n\nNON-CHANDRA INFRARED-EXCESS MEMBERS\n\nDue to the relatively short Chandra exposure and large distance to the Cepheus region,\nthe X-ray PMS sample is only complete down to ∼ 0.5 M⊙ for Cep OB3b/S 155 Class III\nstars, less complete for Cep OB3b/S 155 Class II stars, and even less complete for Cep B\nembedded objects (§5). As the stellar Initial Mass Function peaks around ∼ 0.3 M⊙ , hundreds of Cepheus stars should be present in the Chandra field of view with their X-ray\nluminosities below the sensitivity limits of the Chandra observation of log Lx ∼ 29 − 29.5\nerg s−1 (Getman et al. 2006). With an age around ∼ 2 − 3 Myr and younger (Appendix A),\na large fraction of the Cepheus stars with masses below 0.5 M⊙ in our field will have optically thick disks detectable with IRAC. Selection by IRAC IR-excess should even detect\nmany brown dwarfs in the region. Shallow IRAC exposures efficiently detected disks around\nbrown dwarfs in the Orion cloud at a distance of ∼ 400 pc over several magnitudes in\nbrightness (Luhman et al. 2008b, and references therein). The sensitivity at the Cepheus\ndistance around ∼ 725 pc will be reduced by ∼ 1.3 mag, sufficient to detect a considerable\nfraction of the disk-bearing brown dwarfs. Thus some fraction of non-X-ray PMS stars with\nlower-masses are expected to be detected in the IRAC survey within the Chandra field of\nview.\nFigure 8a − c shows IRAC color-color diagrams for 774 IRAC sources in the Chandra\nACIS-I field of view that are not associated with X-ray sources. We restrict these diagrams to\nsources with photometric errors < 0.1 mag in all four IRAC bands. Using the IR color-color\nclassification criteria presented in § 3.3, we identify 224 non-X-ray IR-excess stars. Table 3\ngives IR properties for the 224 non-X-ray IR-excess sources.\nFigure 8d − f compares X-ray-selected and IR-excess-selected samples in the [4.5] vs.\n[4.5]−[8.0] color-magnitude diagram. As expected, the majority of these new PMS candidates\nare fainter than the X-ray selected sample, although there is a considerable overlap in the\ndistributions around 14 < [4.5] < 12 mag (∼ 0.1−0.3 M⊙ ). Most of these new stars thus have\nmasses in the < 0.5 M⊙ and some in sub-stellar range. Panels show that, despite the different\nselection criteria, the color distributions of these IRAC-selected stars are similar to those of\nthe X-ray selected PMS stars. However, several of the weakest and reddest ([4.5] & 14 mag\nand [4.5] − [8.0] & 0.5 mag) IR-selected sources may be unrelated extragalactic objects\n(Harvey et al. 2006). Four probable extragalactic contaminants from the X-ray-selected\nsample lie near this region of the diagram (grey diamonds in Figure 8d).\nIn the unobscured Cep OB3b subregion, the combined X-ray-selected and IR-excessselected sample should give a complete census of the disk-bearing population down to 0.2 −\n0.3 M⊙ , a nearly complete census of the disk-free population down to 0.5 M⊙ , and a fraction\nof both the disk-bearing and disk-free populations into the brown dwarf regime (§5). But\n\n\f– 11 –\ndue to the limited point source sensitivity from the non-uniform IR nebular emission, the\nidentified PMS populations of the S 155 and Cep B subregions are less complete. This can be\nseen from the paucity of sources fainter than [4.5] > 14 mag in S 155 and [4.5] > 13 mag in\nCep B (Figure 8e − f ). More accurate information on mass completeness limits of Cepheus\nPMS stars is given in the next section.\n\n5.\n\nINITIAL MASS FUNCTION OF THE CEPHEUS CLUSTER\n\nIn the area covered by the Chandra field and all four bands of the IRAC mosaic, we\nexamine the stellar IMF separately for diskless and disk-bearing stars in each of the three\nsub-regions. For a given mass, the X-ray detection efficiency of Class III stars is somewhat\nhigh than that of Class II stars (Appendix B). To compensate for this effect, in this IMF\nand the following disk evolution analyses, we use the disk-bearing stellar sample that is the\ncombination of the Chandra and non-Chandra IR-excess member young stars (§4) while\nretaining the diskless stellar sample as purely composed of X-ray stars. In this IMF analysis\nsection, we exclude X-ray stars lying outside of the 4 IRAC band mosaic, as well as the most\nmassive young star in the region, O7Vn star HD 217086 (Chandra # 240) which is the only\nstar with mass above 4 M⊙ (upper boundary of considered IMF mass range; Figure 9). We\nalso exclude 51 non-Chandra IR-excess possible members with inferred masses below 0.1, as\nsome of them may still be extragalactic background objects (§4).\nFigure 9a shows that the mass distributions of the Cep OB3b sub-region stars, both\ndiskless (red) and disk-bearing (blue), nicely follow the shape of the Galactic field IMF,\nshowing a Salpeter powerlaw slope between 0.5 − 3 M⊙ , and a peak around 0.3 − 0.5 M⊙ .\nThe decline seen below 0.3 − 0.5 M⊙ is attributable to our incompleteness limits and is\nprobably not intrinsic to the cluster. The pure Chandra Class III sample is complete down\nto 0.5 M⊙ , while the combined Chandra and non-Chandra Class II sample is complete for\n& 0.3 M⊙ Cep OB3b stars. Assuming a Galactic field IMF shape, we estimate the total\nPMS population in the Cep OB3b sub-region to be ∼ 750 stars down to 0.1 M⊙ .\nAn important negative result here is that we do not confirm the tentative explanation\nby Getman et al. (2006) that the non-standard X-ray luminosity function of the Cep OB3b\nis due to an anomalous 'bottom-heavy' IMF with an excess of 0.3 M⊙ stars. Although a\nslight difference between the combined Chandra and Spitzer sample and the Galactic field\nIMF is seen (Figure 9a), it is not statistically significant.\nFigure 9b shows that mass distributions of the S 155 sub-region stars, although with\nfewer stars than in Cep OB3b, also follow the Galactic field shape with mass completeness\n\n\f– 12 –\nlimits of 0.5 M⊙ for both Class II and Class III stellar samples with an estimated total PMS\npopulation of ∼ 200 S 155 stars down to 0.1 M⊙ .\nThe observed mass distribution of the embedded Cep B cluster may be either top-heavy\nor, more likely, simply lacking unidentified low-mass disk-free PMS stars due to Chandra\nsensitivity loss from obscuration (Figure 9c). A similar situation is noticed in the study of the\nembedded population of the bright-rimmed cloud IC 1396N (Getman et al. 2007). In the case\nof usual IMF with still unidentified low-mass stars, the observed Cep B stellar population\nmay be complete only somewhere above 1 M⊙ , and the total intrinsic PMS population of the\nCep B may reach a few hundred stars. The triggered population is thus much larger than\nthat identified by early radio and infrared techniques (Testi et al. 1995).\n\n6.\n6.1.\n\nDISK EVOLUTION\nMass Dependence\n\nGrowing evidence has emerged from IRAC young cluster studies that more massive\nPMS stars have shorter disk lifetimes. Luhman et al. (2008a,b) find that disk fractions in\nthe 2 − 3 Myr old IC 348 and σ Ori clusters decrease from ∼ 50 − 60% in brown dwarfs to\n∼ 30 − 40% in stars with M & 1 M⊙ . In the older 5 Myr old Upper Sco and NGC 2362\nclusters, the disk fraction decreases from 10−20% in 0.1−1 M⊙ stars to . 1% in higher-mass\nstars (Carpenter et al. 2006; Dahm & Hillenbrand 2007). The trend may not be universal:\nthe disk fraction of M & 1 M⊙ stars in the 2 Myr old Cha I cluster is > 60% (Luhman et al.\n2008a), much higher than that found in IC 348 and σ Ori at similar ages.\nThe Figure 10 compares the mass-dependent disk fractions of Cep OB3b and the other\nthree regions examined by Luhman et al. (2008b). Our sample here is the combined 215\nChandra (classified as \"DSK\" or \"NoD\" in Table 2) and 142 disk-bearing non-Chandra\n(Table 3) Cep OB3b sources within the overlap area of 4 IRAC band and Chandra fields,\nomitting the most massive young star in the region, O7Vn star (Chandra # 240) with\nMJ < 0 mag, and 37 non-Chandra IR-excess possible members of Cep OB3b with inferred\nmasses below 0.1 M⊙ . Appendix B shows that the relatively short Chandra observation\nis only sensitive to stars down to 0.2 M⊙ , so we have no Cep OB3b coverage for very\nlow mass Class III stars and brown dwarfs. Cep OB3b stars have average ages around\n2 − 3 Myr old (Appendix A) similar to the ages in Cha I, IC 348, and σ Ori; possibly\nyounger stars in the S 155 and Cep B region are omitted here. Following Luhman et al.,\nthe absolute J-band magnitude MJ serves as a proxy of mass. Our MJ values are obtained\nusing individual AJ extinctions from Tables 2-3, which in turn were derived through the\n\n\f– 13 –\nevolutionary model-dependent procedure assuming the distance of 725 pc and the age of\n3 Myr. Individual magnitude accuracies should be sufficient to reliably assign individual\nsources to the coarse, 2 mag-wide MJ bins. Errors on disk fractions have been estimated using\nbinomial distribution statistics as described by Burgasser et al. (2003). For the Cep OB3b\nstars, MJ bins have been systematically shifted by +0.3 mag from those of other regions in\norder to include in the second MJ bin the ∼ 0.5 M⊙ mass stars, stars for which the combined\nChandra and non-Chandra Cep OB3b sample is complete (§5).\nFigure 10 shows that the disk fraction of the Cep OB3b stars (circles) for the two highest\nmass bins is around 45% and agrees with the fractions seen in IC 348, but appears higher than\nthe comparison clusters for the lowest < 0.5 M⊙ mass bin. The most plausible explanation\nfor the reduced disk fraction in the < 0.5 M⊙ bin is incompleteness of the Cep OB3b sample\nat low masses (§5). Here, our short Chandra observation is not sensitive to many low-mass\nClass III stars and the observational bias towards non-Chandra disk-bearing stars affects\nthe sample selection.\nWe thus find no significant dependence of disk fraction on mass in the Cep OB3b\nChandra plus non-Chandra selected sample above 0.5 M⊙ 2 . This agrees with the lack of\nmass dependence seen in IC 348 and σ Ori in the > 0.2 M⊙ regime. The increased fractions\nreported in these clusters were found in the < 0.2 M⊙ regime which is not covered by\nour Cep OB3b selected sample. However, we do not support studies in other clusters that\nreport a rapid loss of IRAC-band disk emission in intermediate-mass stars. These studies\nmight consider possible sample incompleteness effects, such as an under-sampling of diskfree\nClass III low-mass members. Our inclusion of the X-ray selected sample is specifically\ndesigned to be nearly free of this bias.\n\n6.2.\n\nSpatial Gradients\n\nWe now consider spatial distribution of the disks around the mass-complete Chandra\nplus non-Chandra PMS samples over the area covered by the 4 IRAC mosaics and the\nChandra field. Figure 11 shows the spatial distribution, and Table 4 provides quantitative\ndetails for two mass strata, two azimuthal zones (NE and SW), three radial subregions\n(Cep OB3b, S 155, and Cep B), and three radial layers discussed below (inner, intermediate,\nand outer). The azimuthal zones are separated by the line that roughly bisects the opticallybright (Figure 1) and IR-bright nebular emission. Radial distances are measured from the\n2\n\nThe results are similar with a choice of longer distance of ∼ 850 pc and thus younger age of ∼ 2 Myr\nfor the Cep OB3b cluster (Appendix A).\n\n\f– 14 –\nhot core of the molecular cloud (α = 22h 57m 15.s 2, δ = +62◦ 37′ 11.′′ 1 (J2000)). Below we\nconsider the Cepheus sample of 220 Chandra plus non-Chandra PMS stars with stellar\nmasses above 0.5 M⊙ , the mass completeness limit for Cep OB3b/S 155 stars (§5), as well\nas its mass-stratified sub-samples. The observed stellar population of the embedded Cep B\ncluster may be complete somewhere above 1 M⊙ (§5) and thus the analysis of the > 1 M⊙\nstellar sub-sample may provide more realistic disk fraction estimates for this sub-region.\nExamining first azimuthal dependence, we find that the NE zone of the region has\n∼ 1.5 −1.7 times higher stellar surface density than the SW zone. There is also an indication\nfor possible slight increase in disk fraction from NE to SW zones of the Cep OB3b/S 155\nregion, although the effect is not statistically significant (Table 4).\nExamining next the radial dependence, a dramatic trend is seen: the disk fraction\nincreases from 40 − 50% in the Cep OB3b subregion to 50 − 60% in the S 155 subregion\nto 70 − 80% in Cep B (Table 4). This trend is elucidated in more detail in Figure 12 as a\nrunning average disk fraction. Here the running disk fraction for the > 0.5 M⊙ mass stratum\n(red) is evaluated within a 2′ wide sliding window at 1′ intervals, while the 0.5 < M < 1 M⊙\n(black) and M > 1 M⊙ (blue) mass strata are evaluated within a 4′ wide sliding window at\n2′ intervals. Note these values are not independent because a given star is included in two\nadjacent values. The effect could either be viewed as a smooth trend in disk fractions, or\na step-function at 30% (outer layer), 60% (intermediate layer) and 70 − 80% (inner layer)\ndisk fractions in 0.6 − 0.8 pc radial bins (grey bars). It is important to note that the outer\nedge of the second bin (intermediate layer) is coincident with the projected position of the\nionizing source of the region, O7V star HD 217086.\nIf one adopt the simple relation between stellar age and disk fraction derived by Hernández et al.\n(2007, see their Figure 14), the Cepheus disk fraction gradient corresponds to an age gradient\nfrom 3 − 5 Myr in the outer layer (part of Cep OB3b subregion), 2 − 3 Myr in the intermediate layer (part of Cep OB3b/S 155 region), and ∼ 1 Myr in the inner layer (embedded\nCep B subregion). This inferred age gradient agrees with that estimated from stellar (vs.\ndisk) properties in Appendix A.\n\n6.3.\n\nTransition Disks\n\nAs noted earlier in § 3.2, the Cepheus OB3b population appears deficient in transition\ndisks compared to the 2−3 Myr old cluster IC 348. We investigate this further here, including\ncomparison to the low-mass 1 Myr old Coronet cluster (Sicilia-Aguilar et al. 2008) and the\n4 Myr old Tr 37 cluster (Sicilia-Aguilar et al. 2006). Tr 37, like our Cep OB3b field, harbors\n\n\f– 15 –\nan O7-type star.\nIt is important to recall that different studies of different star forming regions use different criteria for identifying TDs. In the Tr 37 and the Coronet cluster studies, TDs are\nidentified with a photometric excess longward of ∼ 6μm. In the study of IC 348, small\nexcesses around 2 μm define \"anemic disks\" systems (Lada et al. 2006). Our classification\nof Cepheus stars here (§3) relies on an intermediate criterion of excess longward of ∼ 3.6μm.\nThus, if the fraction of transition disks were intrinsically the same in all clusters, we expect\nthe reported fractions to be largest in IC 348, intermediate in our sample, smallest in Tr 37\nand the Coronet. Furthermore, inter-cluster comparison of TD fractions should also consider similar mass strata, as lower-mass PMS stars may have flatter disks with more frequent\ninner holes than more massive PMS stars (e.g. Hartmann et al. 2006; Sicilia-Aguilar et al.\n2008). From Table 2 of Lada et al. (2006), a TD fraction among disk-bearing stars in IC 348\ndecreases from 0.45 ± 0.04 (64/142) for M-type stars to 0.31+0.15\n−0.09 (4/13) for G-K-type stars,\nalthough this decrease is not statistically significant. The Tr 37 study combined stars from\nlate G to M2-type (∼ 0.4 − 2 M⊙ ) and reported a 0.10+0.03\n−0.02 (11 − 14 out of 140 − 150) TD\nfraction among disk-bearing stars. The Coronet cluster study included only M0-M8 objects\nand reported a 0.50+0.13\n−0.12 (7/14) TD fraction.\nOur classification of X-ray selected PMS stars in the Cep B/Cep OB3b obtained 20\nTDs out of 139 disk-bearing stars giving a TD fraction of 0.14+0.03\n−0.02 . Most of these (13 out of\n20) are in the unobscured Cep OB3b subregion and none are present close to the Cep B hot\ncore. To perform a mass-stratified analysis, we consider here only the most rich star sample,\nCep OB3b. From Table 2, we find the Cep OB3b TD fraction may be mass-dependent with\n+0.06\n0.29+0.1\n−0.07 (8 out of 28) among M . 0.5 M⊙ (M-type) disk-bearing stars and 0.11−0.03 (5 out\nof 47) around more massive stars.\nThese results are roughly consistent with the previous studies, once the TD definitions\nand mass ranges are taken into account. Our overall ∼ 14% TD fraction is intermediate\nbetween the ∼ 40% reported for IC 348 and ∼ 10% reported for Tr 37, as expected for an\nintrinsically constant TD fraction. Our finding that M stars have a higher TD fraction than\nmore massive stars agrees with the indication for trend seen in IC 348 and the high fraction\nfound in Coronet M stars. We thus conclude that the fraction of Cep OB3b TDs agrees with\nthat of other clusters despite the apparent deficit noted earlier in Figure 6.\n\n\f– 16 –\n7.\n\nIMPLICATIONS FOR TRIGGERED STAR FORMATION\n7.1.\n\nAnalogy with Bright Rimmed Clouds\n\nThe observed picture of the Cep B region is in many respects reminiscent, on a larger\nscale of several parsecs, of those of smaller bright-rimmed clouds (BRCs) and cometary\nglobules (CGs) found on the edges of giant H II regions (Sugitani et al. 1991). BRCs are\nisolated clouds surrounded by ionized rims facing the exciting star(s) with their dense cores\nclose to the rims. BRCs are modeled as externally illuminated, photoevaporated and ablated\ninto elongated head-tail morphologies by ultraviolet radiation of OB stars (Reipurth 1983).\nIt is likely that pressure from the ionization shock front at the surface propagates through a\nglobule and overcomes the magnetic, turbulent and thermal pressure that supports it against\ncollapse, thereby triggering localized star formation. This astrophysics of radiation-driven\nimplosion (RDI) in molecular globules has been extensively studied (e.g., Bertoldi 1989;\nLefloch & Lazareff 1994; Miao et al. 2009). RDI models typically consider the triggering of\na single star formation episode in a small (< 1 pc) cloud with tens of M⊙ of molecular gas.\nThe characteristic timescale for producing cometary morphologies and inducing gravitational\ncollapse varies with initial conditions from 0.1 to ∼ 1 Myr.\nIn most cases, molecular, IR, Hα surveys of BRCs trace only the most recently formed\nstars (e.g., Sugitani et al. 1995; Ogura et al. 2002; Thompson et al. 2004b; Urquhart et al.\n2006). In a few cases, Chandra observations have added the diskfree PMS populations\n(Getman et al. 2007; Sanchawala et al. 2007; Getman et al. 2008a; Wang et al. 2009). Triggered BRCs often show a few embedded mid-IR sources denoting protostars, while Hα, JHK\nand X-ray surveys reveal small clusters of disk-bearing PMS stars within and in front of the\nbright rim. In a few cases, spatial-age gradients in the stellar population are seen where\nthe youngest stars are embedded and older stars are aligned toward the ionizing sources\n(Matsuyanagi et al. 2006; Ogura et al. 2007; Getman et al. 2007). This directly supports\nthe RDI mechanism and implies that the existing clouds have been actively forming stars\nfor several million years.\nThe Cepheus region possesses all of the observational features of an RDI triggered star\nformation region:\n1. The presence of exciting star(s) and a molecular cloud surrounded by an ionized rim\nfacing the exciting stars shown in Figures 1-2 (Minchin et al. 1992; Beuther et al. 2000);\n2. The presence of a dense molecular core close to the rim (Yu et al. 1996; Beuther et al.\n2000);\n\n\f– 17 –\n3. The spatio-temporal gradient of young stars oriented towards the exciting star(s) shown\nin Figures 11-12.\nThe major difference of the Cepheus region from other BRCs is its larger scale: its extent is\n∼ 4 pc linear size, its molecular mass is ∼ 200 M⊙ , its observed PMS X-ray stellar population\nis > 60 embedded and up to ∼ 300 older unobscured members, as well as estimated intrinsic\npopulation of ∼ 1000 unobscured and possibly a few hundred embedded stars (§5). The largescale morphology is also different from most other BRCs. Rather than lying on the edge of a\ncircular HII region surrounding a concentrated OB association, it is an extension of a giant\nmolecular cloud protruding into a large evacuated region produced by a partially dispersed\nOB association. Another unusual case of a very large BRC with star formation triggered\nover several million years is the high-latitute cometary globule CG 12 (Getman et al. 2008a).\n\n7.2.\n\nImplications for the Radiative Driven Implosion Mechanism\n\nBased on the RDI triggered star formation concept, we can propose some new insights into the star formation process of the Cepheus region and make some simple modelindependent estimates for a shock propagation velocity and a star formation efficiency (SFE)\nof the RDI process. In §6.2 and Appendix A, we establish the spatio-temporal gradient of\nCepheus PMS stars from the center of the cloud towards the HD 217086 O7Vn star. Assuming a distance around 725 pc, the innermost 0.6 − 0.8 parsec adjoining the hot core of the\ncloud has the youngest (< 1 − 2 Myr) stars with the highest seen disk fraction (70 − 80%).\nThe intermediate 0.6 − 1 parsec layer around S 155 has older (2 − 3 Myr) stars with an\nintermediate disk fraction (∼ 60%) (Figure 12). The outer layer of mostly diskless stars in\nthe unobscured Cep OB3b cluster has the lowest disk fraction (∼ 30%)3\nWe consider two scenarios for RDI-induced star formation in this region. First, a relatively slow shock with speed . 0.5 km s−1 may have passed through the molecular cloud,\ntriggering star formation in the outer layers around 2 − 3 Myr ago and continuing to trigger\nstar formation close to the Cep B hot core today. This slow shock speed is consistent with the\n0.6 km s−1 propagation rate inferred from the age gradient of the PMS stars in the globule\nIC 1396N, located ∼ 11 pc projected distance of its ionizing O6e type star (Getman et al.\n2007). In this scenario, stellar kinematic drift from their birthplaces plays an important role\nin relocating PMS stars. The O7Vn star HD 217086 star is probably the principal ionization\n3\n\nIf the distance to the cloud is ∼ 850 pc, the ages of the Cep B and S 155/Cep OB3b subregions are older\nby ∼ 0.5 − 1 Myr but the ∼ 1 Myr difference between them remains (Appendix A).\n\n\f– 18 –\nsource but other OB stars (Figure 1), including the B1Vn star HD 217061 currently located\nwithin the SW zone of the S 155 subregion, probably also play a role. If the original cloud\nwere only slightly larger than the size observed today, the RDI shock would have slowly\npropagated through ∼ 1 pc of the Cep B molecular cloud over ∼ 2 − 3 Myr years, implying\na shock velocity around . 0.5 km s−1 . The stars formed early in this process would have\ndrifted 2 − 10′ (0.4 − 2 pc) in all directions, populating much of the Chandra field of view\nwith triggered stars. Such star drifting would require a stellar velocity dispersion around\n1 km s−1 . This is expected from the turbulent velocities within a cloud several parsecs in\nextent (Efremov & Elmegreen 1998), which can be supplemented by dynamical interactions\nbetween protostars during star formation (Bate 2008; Fűrész et al. 2008).\nA second scenario involves the passage of a faster shock propagating at ∼ 1 km s−1\nthrough a cloud that was originally much larger than the Cep B cloud we see today. In\nthis model, most of the original cloud material has ablated and most of the stars in the\nChandra field formed in the cloud during the past ∼ 2 − 3 Myr. Present locations of the\nintermediate layer around S 155 and the inner layer around the molecular core (separated by\n0.8 − 1 pc, Figure 12) may be directly associated with the passage of the RDI shock ∼ 2 − 3\nand . 1−2 Myr years ago, respectively. Star drift plays a less important role here. A similar\nfast shock speed is observed in the triggered star formation in the molecular pillars of the\nEagle Nebula (M 16) and other bright rimmed clouds (Fukuda et al. 2002; Thompson et al.\n2004b), and is consistent with the theoretical models of Motoyama et al. (2007).\nA critical discriminant between these scenarios is the SFE of the cloud. Integrating the\nstellar masses in Figure 9, the total stellar mass of the Cep OB3b disk-bearing population\nassuming a standard Galactic field IMF is ∼ 130 M⊙ in our observed field. With the average\ndisk fraction of 45% (§6.1, Table 4), we add ∼ 160 M⊙ of diskfree stars and ∼ 20 M⊙ from\nHD 217086 to give a total mass of the Cep OB3b population around 310 M⊙ . A similar\nestimate for the S 155 population from information in Figure 9 and Table 4 gives a total\nstellar mass around 80 M⊙ . Assuming that the observed Cep B embedded population is\ncomplete only somewhere above 1 M⊙ (§5) and follows a standard Galactic field IMF as\nwell, we use star count and disk fraction information for the highest mass bin from Figure 9\nand Table 4 to obtain an estimated total mass of the Cep B population of 120 − 250 M⊙ .\nThe mass of the observed molecular gas in the Cep B molecular portion of the Cepheus\nmolecular cloud is only ∼ 200 M⊙ (Yu et al. 1996; Beuther et al. 2000).\nThe inferred SFE for the embedded Cep B population alone is thus around 35% − 55%,\nat the top of typical SFE range of 10 − 40% measured in other active star forming regions\n(Elmegreen et al. 2000, and references therein). This is far above the SFE found in smaller\nmolecular globules triggered by UV shocks (e.g. Getman et al. 2007). For the total Cepheus\n\n\f– 19 –\nstellar population within the Chandra field, the apparent SFE is extremely high around\n& 70%. This is unrealistically high and indicates that most of the Cep OB3b stars were not\nformed from the presently seen cloud material but arose from an earlier generation of star\nformation from gas that is no longer present. This supports the second scenario involving a\nfast shock passing through a much larger and more massive original cloud.\nTwo other aspects of RDI triggered star formation can be discussed. First, Sugitani et al.\n(1991) provided observational evidence for a non-standard IMF where intermediate-mass\nstars are preferentially formed over lower mass stars in BRCs. In the case of the embedded\ntriggered PMS population of IC 1396N, Getman et al. (2007) also found indications for a\nnonstandard IMF biased towards higher mass stars, but cautioned about possible observation selection effects. A similar situation arises here in the case of the embedded Cep B\npopulation (§5). While the shape of the Cep B stellar mass distribution is not definite yet,\nthe stellar mass distribution of likely RDI triggered stellar population of the Cep OB3b/S 155\nregion agrees well with a standard Galactic IMF, at least down to ∼ 0.2 − 0.5 M⊙ (§5).\nSecond, most theoretical calculations of RDI triggering involve small globules and a\nsingle episode of triggering. The 2−3 Myr range of stellar ages found in the Cep B/Cep OB3b\nregion, and an even wider age spread found in CG 12 (Getman et al. 2008a), implies repeated\nor continuing star formation over millions of years when the RDI mechanism occurs in a larger\nmolecular cloud.\n\n8.\n\nCONCLUSIONS\n\nWe present a Spitzer IRAC observation of the Cepheus B molecular cloud, the S 155 HII\nregion on its periphery, and a portion of the nearby Cep OB3b OB association. The goals of\nthis work are to study disk evolution of the nearly disk-unbiased combined Chandra-ACIS\nand Spitzer-IRAC selected samples of PMS stars and to provide new clues of the sequential\ntriggered star formation process in the region.\nOut of ∼ 400 X-ray emitting PMS stars in the region, 354 are classified as diskless or\ndisk-bearing stars based on IR photometry: 161, 36, and 18 (75, 26, and 38) diskless (diskbearing) stars in the Cep OB3b, S 155, and Cep B subregions, respectively. We immediately\nsee that samples selecting only IR-excess stars miss the majority of stars outside the Cep B\nmolecular core. Among all X-ray emitting disk-bearing systems, only 4 are Class I protostars;\nthey lie in the younger embedded Cep B cluster (§3). In addition to the ∼ 400 X-ray emitting\nPMS stars in the region, we identify > 200 non-Chandra IR-excess low-mass members of\nthe region (§4). For the lightly-obscured Cep OB3b and S 155 clusters around the cloud, the\n\n\f– 20 –\ncombined Chandra and non-Chandra PMS samples are complete down to 0.5 M⊙ , while for\nthe embedded Cep B cluster the observed PMS sample may be complete only above 1 M⊙\n(§5).\nThe spatial distribution of the disks around stars of the combined Chandra − Spitzer\nPMS samples reveals a dramatic spatio-temporal gradient: younger stars are clustered\naround the hot core of the molecular cloud, while older stars are dispersed in the direction of the primary ionizing O7-type star HD 217086 (§6.2). Disk fractions fall from 80%\nto 30% across the S 155 HII region. This finding constitutes strong endorsement for the\nbasic model of triggered star formation in the region by passage of shocks driven by the\nOB stellar ionization and/or winds into the Cep B molecular cloud. Our estimate of the\nshock velocity of ∼ 1 km s−1 agrees with empirical estimates obtained for a number of other\nshocked bright-rimmed clouds and with theoretical models. The IMF of the Cep OB3b/S 155\ntriggered stellar population exhibits a standard Galactic field shape; we do not confirm our\nearlier suggestion of a bottom-heavy IMF. The unusually large apparent value of star formation efficiency of & 70% based on the present day molecular cloud indicates that most of the\nCep B molecular material has likely already been evaporated or transformed to stars. Contrary to the current RDI simulations of typical small globules which model a single triggering\nevent over . 1 Myr time period, our observational findings support a picture of multiple\nepisodes of triggering over millions of years (§7).\nUsing the nearly disk-unbiased combined Chandra-ACIS and Spitzer-IRAC selected\nstellar sample, we also obtain several other results. First, the disk fraction as a function of\nstellar mass in the Cep OB3b cluster is similar to that of the IC 348 PMS stars with ages\nsimilar to Cep OB3b (§6.1). Second, the fraction of Cep OB3b transition disks agrees with\nthat of other clusters, such as Tr 37, Coronet, and IC 348 (§6.3). Third, in agreement with\nthe disk fraction analysis of §6.2, we obtain photometric ages of < 1 − 2 and 2 − 3 Myr for\nthe embedded Cep B and lightly-obscured Cep OB3b clusters, respectively using the optical\ncolor-magnitude diagram (Appendix A) and assuming a distance of 725 pc. Fourth, the\neffect of reduced X-ray emission in disk-bearing versus diskless stars which was originally\nestablished in studies of ONC and Taurus regions is confirmed in the Cepheus systems\n(Appendix B).\n\nA.\n\nAPPENDIX A: DISTANCE AND AGE OF THE CEP B/CEP OB3\nCOMPLEX\n\nThe distance to the Cep B/Cep OB3 complex is somewhat uncertain. From the optical\nphotometry of the early-type members of the Cep OB3 association, Blaauw et al. (1959) and\n\n\f– 21 –\nCrawford & Barnes (1970) obtained a distance estimate of 725 pc. Later Moreno-Corral et al.\n(1993) combined near-IR photometry with the earlier optical photometry and spectroscopy\ndata of bright members to derived a distance estimate of 850 pc. A recent VLBI parallax\nmeasurement using the methanol maser in the Cep A molecular core gives a distance of\n∼ 700 pc (Moscadelli et al. 2009). A distance of 870 pc has been inferred for the nearby\nCep OB2 association (Contreras et al. 2002; Sicilia-Aguilar et al. 2005). Our X-ray study\n(Getman et al. 2006) adopted the 725 pc estimate while the optical studies of the Cep OB3b\nby Pozzo et al. (2003) and Mayne et al. (2007) adopted a distance of 850 pc.\nThe chosen distance influences age estimates of the lower-mass stars as PMS evolutionary isochrones on the Hertzsprung-Russell diagram (HRD) depend on absolute luminosities.\nEarly photometric age estimates of the OB population indicated a relatively old cluster\naround ∼ 4 − 5.5 Myr (Blaauw 1964; Jordi et al. 1996). For the X-ray PMS stars in the\nChandra field, we adopted an age of ∼ 1 Myr (Getman et al. 2006) based on the HRD\nof five PMS X-ray sources (Pozzo et al. 2003). Recently, Mayne et al. (2007) obtained V and Ic -band photometry data for an area including most of the Chandra ACIS-I field and\nmeasured a ∼ 3 Myr photometric age for the low-mass Cep OB3b population. It is unclear\nfrom any of these earlier datasets whether the age is uniform across the region.\nWe seek here to estimate stellar ages from the V - and Ic -band color-magnitude diagram\nfor the Chandra X-ray PMS stars using the photometry of Mayne et al. (2007) listed in Table\n1. The 2MASS near-IR photometry was first used with the combination of the synthesized\nSiess et al. (2000) (for 1.4 6 M 6 7.0 M⊙ ) and Baraffe et al. (1998) (for 0.02 6 M 6 1.4 M⊙ )\nPMS evolutionary isochrones to obtain individual extinction estimates for Chandra sources.\nWe obtained different sets of source extinctions (AV,N IR ) using the J versus J − H colormagnitude diagram (similar to the one shown in Figure 5 of Getman et al. 2006) with two\ntrial assumed distances (725 and 850 pc) and three trial assumed ages (1, 2, and 3 Myr).\nThe six sets of source extinctions were applied to correct the observed optical magnitudes\nof Chandra sources and to place them on the V versus V − Ic diagram. Based on the\nvalues of E(B − V ) = 0.91 mag and E(V − I) = 1.18 mag at AV = 2.8 mag adopted\nby Pozzo et al. (2003) and the reddening laws of Winkler (1997), we used the reddening\nrelationships AIc /AV = 0.58, AJ /AV = 0.27, and AH /AV = 0.16. The Cep B optical stars\nhave an average extinction < AV,N IR >∼ 7 mag while S 155 stars have < AV,N IR >∼ 3 mag\nand Cep OB3b stars have < AV,N IR >∼ 2 mag. Within each of the areas, the extinctions of\ndisk-bearing stars are systematically higher than those of diskless stars.\nAs the inferred visual source extinctions differ by AV < 0.5 − 1 mag for the six trial\ncombinations of distance and age, and the reddening vector on the optical color-magnitude\ndiagram is almost parallel to the PMS evolutionary tracks, the X-ray sources occupy very\n\n\f– 22 –\nsimilar loci in the V − Ic color-magnitude diagram for all six cases. The X-ray sources\nare centered mostly around the ∼ 2 − 3 Myr isochrons assuming the distance of 725 pc,\nor the ∼ 2 Myr isochrone assuming the distance of 850 pc. Figure 13 shows the colormagnitude diagram for 725 pc. The plotted symbols stratify the 286 X-ray sources with\noptical photometry according to location in the star forming region and the presence of\ndisks: 62 disk-bearing (143 diskless), 22 disk-bearing (31 diskless), and 17 disk-bearing (11\ndiskless) for the Cep OB3b, S 155, and Cep B subregions, respectively.\nIn Figure 13, about thirty X-ray sources have V −(V −Ic ) locations inconsistent with any\nPMS model tracks. These outliers are not foreground or background stellar contaminants,\nas more than half of them have optically thick disks and very few field stars are predicted\nto be captured in the Chandra image. Most of these outliers have unusually high nearIR extinctions AV,N IR among the X-ray young stars seen in the optical bands. For the\nmajority of the outliers, the AV,N IR values are comparable (within 30%) to the absorption\nAV,Xray inferred from the X-ray median energy, MedE. MedE is first converted to equivalent\nhydrogen column density assuming solar abundances using the MedE − NH relation found\nfor the COUP sample (Feigelson et al. 2005), and NH is converted to AV,Xray assuming a\ngas-to-dust ratio of ∼ 2 ×1021 cm−2 /mag (Ryter 1996). This may point to discrepant optical\nmagnitudes and/or unusual conditions in these PMS systems; for example, some may posses\ndisk at high inclination where the optical light is enhanced by scattering above the disk.\nAlternatively, these outliers may have ages overestimated by incorrect consideration of birth\nline and accretion effects (e.g. Hartmann 2003).\nFrom a comparison of soft X-ray absorptions and fractions of Ks -band excess sources,\nGetman et al. (2006) presented evidence that the embedded Cep B cluster is younger than\nthe Cep OB3b population within the Chandra ACIS-I field. Figure 13 supports this age\ndifference. Ignoring outliers mentioned above, about half of the Cep B sources (blue symbols)\nare located closer to the 1 Myr track compared to only about one-sixth of the Cep OB3b (red\nsymbols). However, the Cep B sample is small because most of the X-ray selected members\nare embedded and do not have optical counterparts. The result supports the youthfulness\nof the Cep B population seen in the disk fraction discussed in § 6.2.\nWe thus cannot arrive at a clear conclusion on the distance to the star forming complex.\nHowever we do establish a dependence of the inferred average age on the assumed distance.\nIn this paper, we adopt (not derive) a distance to the Cep B/Cep OB3b complex of 725 pc,\nsupported by the recent VLBI parallax measurement of Cep A. We therefore adopt an age\nof 2 − 3 Myr for the Cep OB3b stars and < 1 − 2 Myr for the embedded Cep B stars. If the\ndistance is closer to 850 pc, the inferred ages would be decreased by ∼ 0.5 − 1 Myr.\n\n\f– 23 –\nB.\n\nAPPENDIX B: X-RAY ACTIVITY, STELLAR MASS AND DISKS\n\nOriginally found by Feigelson et al. (1993) from ROSAT data, it is now empirically wellestablished that PMS X-ray luminosities are strongly correlated with stellar mass, volume\nand surface area. The Lx ∝ M 1.7 relationship extends over 3 orders of magnitude range in\nX-ray luminosity. The clearest relationships are seen in the Chandra Orion Ultradeep Project\n(COUP) observation of the Orion Nebula Cluster (Getman et al. 2005; Preibisch et al. 2005)\nand in the XMM-Newton Extended Survey of Taurus (XEST, Güdel et al. 2007; Telleschi et al.\n2007). The astrophysical cause of this relationship is poorly understood, but probably is due\nto saturation of the magnetic dynamo in the fully convective stellar interior or on the surface\nof PMS stars.\nFigure 14 shows the Lx − M relationship for 222 unobscured Cep OB3b PMS stars\ncompared to 457 lightly-absorbed (AV < 5 mag) Orion COUP stars from Getman et al.\n(2005). Here, Lx represents the quantity Lt,c , the X-ray luminosity computed in the 0.5 −\n8 keV band and corrected for obscuration. A similar, roughly linear, relationship is seen\nin the Cep OB3b sample, but somewhat flatter than the relationship present in the COUP\nsample. This can be attributed to truncation effects: the Cep OB3b observation is complete\nto log Lx ≃ 29.5 erg s−1 (Getman et al. 2006), while the COUP observation is complete to\nlog Lx ≃ 28.0 erg s−1 . Examination of Figure 14 shows that the Cep OB3b X-ray sample\nalone is nearly complete down to 0.5 M⊙ and ∼ 1 M⊙ for the Class III and Class II stars,\nrespectively (see Figure 9). Much of the scatter in both relations can be attributed to errors\nin COUP and Cep OB3 stellar masses; less scatter is seen in the XEST Lx − M plot where\nmasses are carefully evaluated from accurate spectroscopy. X-ray members of the embedded\nCep B cluster show a similar Lx − M relationship with the completeness limit above 1 M⊙ .\nA second relationship between X-ray emission and accretion was originally found from\nChandra HRC (High Resolution Camera) data (Flaccomio et al. 2003) and has been confirmed in the COUP and XEST samples. This is thought to arise from a suppression of\ntime-integrated X-ray emission in accreting versus non-accreting PMS systems. This is a\nmore subtle effect than the X-ray dependence on mass with an amplitude of only a factor of\n∼ 2 within the 103 range in PMS X-ray luminosities (Preibisch et al. 2005; Telleschi et al.\n2007). The astrophysical cause of the mild suppression of X-ray emission in accreting PMS\nsystems is also uncertain. Preibisch et al. suggest that X-ray emission cannot arise in magnetic field lines that are mass loaded with disk material. Jardine et al. (2006) argue that\nthe outer magnetosphere of accretors is stripped by interaction with the disk. Gregory et al.\n(2007) propose that soft X-ray emission is attenuated by dense material in accretion columns.\nGetman et al. (2008c) find indications of shorter X-ray flare durations in Class II systems\nthat may be due to distortion and destabilization of magnetic loop structures in accreting\n\n\f– 24 –\nsystems.\nThis effect is shown in Figure 14 with running medians of accreting and non-accreting\nstars for the lightly-obscured Cep OB3b and COUP samples. The running medians are calculated within a sliding window with width 0.3 dex in log(M/M⊙ ). The errors on medians\nare median absolute deviations (see Appendix B of Getman et al. 2008b). The sample selections are not identical due to different X-ray sensitivity limits and due to different limited\nspectroscopic/photometric measurements in Orion and Cep OB3b regions. We show with\nthe • symbol 62 Cep OB3b stars classified as disk-bearing 'DSK' systems in § 3, and 142\nCOUP stars classified as active accretors having Ca II 8542 Å line in emission with equivalent width of EW (Ca II) < −1Å. The × symbols indicate 160 Cep OB3b stars classified\nas diskless 'NoD' and 315 weakly accreting or non-accreting COUP stars with absorption\nequivalent width of EW (Ca II) > 1Å. Thirteen Cep OB3b transition disk stars are marked\nby squares.\nThe factor of ∼ 2 offset between the accreting and non-accreting stars in the COUP\nsamples is clearly seen to be superposed on the dominant Lx − M relationship, but the effect\nis only marginally present in the Cep OB3b sample. The weakness of the offset here can be\nattributed to two effects. First, the incompleteness at lower-Lx values discussed above has\na greater impact on the weaker-Lx accreting stars than the stronger-Lx non-accreting stars.\nSecond, due to the absence of a spectroscopic survey of Cep OB3b stars, we classify stars\nhere using an infrared photometric disk indicator rather than a direct accretion indicator.\nIt has been established within the COUP sample that the presence of a disk itself does not\nsuppress X-ray emission, but active accretion must be present (Preibisch et al. 2005). These\ntwo effects plausibly explain the less pronounced observed effect of the Cep OB3b Class II\nX-ray emission suppression compared to that of the COUP stars.\nWe thank the anonymous referee for very useful comments that improved this work.\nWe thank Robert Gutermuth (CfA) for development of Spitzer data analysis tools, and\nPatrick Broos and Leisa Townsley (Penn State) for their development of Chandra tools. We\nbenefited from scientific discussions with Jeroen Bouwman, Thomas Henning and colleagues\nat MPIA. This work is supported by the Chandra ACIS Team (G. Garmire, PI) through\nthe SAO grant SV4-74018 and by Guest Observer JPL grant # 1287737 (J. Wang, PI). K.\nL. was supported by grant AST-0544588 from the National Science Foundation. This work\nis based on observations made with the Spitzer Space Telescope, which is operated by the\nJet Propulsion Laboratory, California Institute of Technology under a contract with NASA.\nWe also use data products of the Two Micron All Sky Survey, which is a joint project of\nthe University of Massachusetts and the Infrared Processing and Analysis Center/California\nInstitute of Technology, funded by NASA and NSF.\n\n\f– 25 –\nREFERENCES\nAllen, L. E., et al. 2004, ApJS, 154, 363\nBaraffe, I., Chabrier, G., Allard, F., & Hauschildt, P. H. 1998, A&A, 337, 403\nBertoldi, F. 1989, ApJ, 346, 735\nBate, M. 2008, arXiv:0811.0163\nBeuther, H., Kramer, C., Deiss, B., & Stutzki, J. 2000, A&A, 362, 1109\nBlaauw, A., Hiltner, W. A., & Johnson, H. L. 1959, ApJ, 130, 69\nBlaauw, A. 1964, ARA&A, 2, 213\nBurgasser, A. J., Kirkpatrick, J. D., Reid, I. N., Brown, M. E., Miskey, C. L., & Gizis, J. E.\n2003, ApJ, 586, 512\nCarpenter, J. M., Mamajek, E. E., Hillenbrand, L. A., & Meyer, M. R. 2006, ApJ, 651, L49\nContreras, M. E., Sicilia-Aguilar, A., Muzerolle, J., Calvet, N., Berlind, P., & Hartmann, L.\n2002, AJ, 124, 1585\nCrawford, D. L., & Barnes, J. V. 1970, AJ, 75, 952\nDahm, S. E., & Hillenbrand, L. A. 2007, AJ, 133, 2072\nDe Vries, C. H., Narayanan, G., & Snell, R. L. 2002, ApJ, 577, 798\nElmegreen, B. G., & Lada, C. J. 1977, ApJ, 214, 725\nElmegreen, B. G., Efremov, Y., Pudritz, R. E., & Zinnecker, H. 2000, Protostars and Planets\nIV, 179\nEfremov, Y. N., & Elmegreen, B. G. 1998, MNRAS, 299, 588\nFazio, G. G., et al. 2004, ApJS, 154, 10\nFelli, M., Tofani, G., Harten, R. H., & Panagia, N. 1978, A&A, 69, 199\nFeigelson, E. D., Casanova, S., Montmerle, T., & Guibert, J. 1993, ApJ, 416, 623\nFeigelson, E. D., et al. 2005, ApJS, 160, 379\nFeigelson, E., Townsley, L., Güdel, M., & Stassun, K. 2007, Protostars and Planets V, 313\n\n\f– 26 –\nFlaccomio, E., Damiani, F., Micela, G., Sciortino, S., Harnden, F. R., Jr., Murray, S. S., &\nWolk, S. J. 2003, ApJ, 582, 398\nFlaherty, K. M., Pipher, J. L., Megeath, S. T., Winston, E. M., Gutermuth, R. A., Muzerolle,\nJ., Allen, L. E., & Fazio, G. G. 2007, ApJ, 663, 1069\nFűrész, G., Hartmann, L. W., Megeath, S. T., Szentgyorgyi, A. H., & Hamden, E. T. 2008,\nApJ, 676, 1109\nFukuda, N., Hanawa, T., & Sugitani, K. 2002, ApJ, 568, L127\nGarmire, G. P., Bautz, M. W., Ford, P. G., Nousek, J. A., & Ricker, G. R. 2003, Proc. SPIE,\n4851, 28\nGetman, K. V., Flaccomio, E., Broos, P. S., et al. 2005, ApJS, 160, 319\nGetman, K. V., Feigelson, E. D., Townsley, L., Broos, P., Garmire, G., & Tsujimoto, M.\n2006, ApJS, 163, 306\nGetman, K. V., Feigelson, E. D., Garmire, G., Broos, P., & Wang, J. 2007, ApJ, 654, 316\nGetman, K. V., Feigelson, E. D., Lawson, W. A., Broos, P. S., & Garmire, G. P. 2008, ApJ,\n673, 331\nGetman, K. V., Feigelson, E. D., Broos, P. S., Micela, G., & Garmire, G. P. 2008, ApJ, 688,\n418\nGetman, K. V., Feigelson, E. D., Micela, G., Jardine, M. M., Gregory, S. G., & Garmire,\nG. P. 2008, ApJ, 688, 437\nGregory, S. G., Wood, K., & Jardine, M. 2007, MNRAS, 379, L35\nGüdel, M., et al. 2007, A&A, 468, 353\nGutermuth, R. A., et al. 2008, ApJ, 674, 336\nHaisch, K. E., Jr., Lada, E. A., & Lada, C. J. 2001, AJ, 121, 2065\nHartmann, L. 2003, ApJ, 585, 398\nHartmann, L., Megeath, S. T., Allen, L., Luhman, K., Calvet, N., D'Alessio, P., FrancoHernandez, R., & Fazio, G. 2005, ApJ, 629, 881\nHartmann, L., D'Alessio, P., Calvet, N., & Muzerolle, J. 2006, ApJ, 648, 484\n\n\f– 27 –\nHarvey, P. M., et al. 2006, ApJ, 644, 307\nHernández, J., et al. 2007, ApJ, 662, 1067\nHollenbach, D. J., Yorke, H. W., & Johnstone, D. 2000, Protostars and Planets IV, 401\nJardine, M., Cameron, A. C., Donati, J.-F., Gregory, S. G., & Wood, K. 2006, MNRAS,\n367, 917\nJohnstone, D., Hollenbach, D., & Bally, J. 1998, ApJ, 499, 758\nJordi, C., Trullols, E., & Galadi-Enriquez, D. 1996, A&A, 312, 499\nKessel-Deynet, O., & Burkert, A. 2003, MNRAS, 338, 545\nKroupa, P. 2002, Science, 295, 82\nKun, M., Kiss, Z. T., & Balog, Z. 2008, in Handbook of Star Forming Regions (B. Reipurth,\ned.), arXiv:0809.4761\nLada, C. J. 1987, Star Forming Regions, 115, 1\nLada, C. J., Muench, A. A., Haisch, K. E., Jr., Lada, E. A., Alves, J. F., Tollestrup, E. V.,\n& Willner, S. P. 2000, AJ, 120, 3162\nLada, C. J., et al. 2006, AJ, 131, 1574\nLefloch, B., & Lazareff, B. 1994, A&A, 289, 559\nLefloch, B., & Lazareff, B. 1995, A&A, 301, 522\nLuhman, K. L., et al. 2008a, ApJ, 675, 1375\nLuhman, K. L., Hernández, J., Downes, J. J., Hartmann, L., & Briceño, C. 2008b, ApJ, 688,\n362\nMatsuyanagi, I., Itoh, Y., Sugitani, K., Oasa, Y., Mukai, T., & Tamura, M. 2006, PASJ, 58,\nL29\nMayne, N. J., Naylor, T., Littlefair, S. P., Saunders, E. S., & Jeffries, R. D. 2007, MNRAS,\n375, 1220\nMegeath, S. T., et al. 2004, ApJS, 154, 367\nMiao, J., White, G. J., Nelson, R., Thompson, M., & Morgan, L. 2006, MNRAS, 369, 143\n\n\f– 28 –\nMiao, J., White, G. J., Thompson, M. A., & Nelson, R. P. 2009, ApJ, 692, 382\nMinchin, N. R., Ward-Thompson, D., & White, G. J. 1992, A&A, 265, 733\nMoreno-Corral, M. A., Chavarria, K. C., de Lara, E., & Wagner, S. 1993, A&A, 273, 619\nMorgan, L. K., Thompson, M. A., Urquhart, J. S., White, G. J., & Miao, J. 2004, A&A,\n426, 535\nMoscadelli, L., Reid, M. J., Menten, K. M., Brunthaler, A., Zheng, X. W., & Xu, Y. 2009,\nApJ, 693, 406\nMotoyama, K., Umemoto, T., & Shang, H. 2007, A&A, 467, 657\nOgura, K., Sugitani, K., & Pickles, A. 2002, AJ, 123, 2597\nOgura, K., Chauhan, N., Pandey, A. K., Bhatt, B. C., Ojha, D., & Itoh, Y. 2007, PASJ, 59,\n199\nPanagia, N., & Thum, C. 1981, A&A, 98, 295\nPozzo, M., Naylor, T., Jeffries, R. D., & Drew, J. E. 2003, MNRAS, 341, 805\nPreibisch, T., & Feigelson, E. D. 2005, ApJS, 160, 390\nPreibisch, T., et al. 2005, ApJS, 160, 401\nReach, W. T., et al. 2005, PASP, 117, 978\nReipurth, B. 1983, A&A, 117, 183\nRyter, C. E. 1996, Ap&SS, 236, 285\nSanchawala, K., Chen, W.-P., Lee, H.-T., Chu, Y.-H., Nakajima, Y., Tamura, M., Baba, D.,\n& Sato, S. 2007, ApJ, 656, 462\nSargent, A. I. 1977, ApJ, 218, 736\nSargent, A. I. 1979, ApJ, 233, 163\nStelzer, B., Flaccomio, E., Montmerle, T., Micela, G., Sciortino, S., Favata, F., Preibisch,\nT., & Feigelson, E. D. 2005, ApJS, 160, 557\nSicilia-Aguilar, A., Hartmann, L. W., Hernández, J., Briceño, C., & Calvet, N. 2005, AJ,\n130, 188\n\n\f– 29 –\nSicilia-Aguilar, A., et al. 2006, ApJ, 638, 897\nSicilia-Aguilar, A., Henning, T., Juhász, A., Bouwman, J., Garmire, G., & Garmire, A. 2008,\nApJ, 687, 1145\nSiess, L., Dufour, E., & Forestini, M. 2000, A&A, 358, 593\nStauffer, J. R., et al. 2007, ApJS, 172, 663\nSugitani, K., Fukui, Y., & Ogura, K. 1991, ApJS, 77, 59\nSugitani, K., Tamura, M., & Ogura, K. 1995, ApJ, 455, L39\nTelleschi, A., Güdel, M., Briggs, K. R., Audard, M., & Palla, F. 2007, A&A, 468, 425\nTesti, L., Olmi, L., Hunt, L., Tofani, G., Felli, M., & Goldsmith, P. 1995, A&A, 303, 881\nThompson, M. A., Urquhart, J. S., & White, G. J. 2004a, A&A, 415, 627\nThompson, M. A., White, G. J., Morgan, L. K., Miao, J., Fridlund, C. V. M., & HuldtgrenWhite, M. 2004b, A&A, 414, 1017\nUrquhart, J. S., Thompson, M. A., Morgan, L. K., & White, G. J. 2006, A&A, 450, 625\nWalker, C., Wood, K., Lada, C. J., Robitaille, T., Bjorkman, J. E., & Whitney, B. 2004,\nMNRAS, 351, 607\nWang, J., Feigelson, E. D., Townsley, K. K., Román-Zúñiga, C. G., Lada, E., & Garmire,\nG. P. 2009, ApJ, in press, arXiv:0903.5493\nWatson, A. M., Stapelfeldt, K. R., Wood, K., & Ménard, F. 2007, Protostars and Planets\nV, 523\nWeisskopf, M. C., Brinkman, B., Canizares, C., Garmire, G., Murray, S., & Van Speybroeck,\nL. P. 2002, PASP, 114, 1\nWinkler, H. 1997, MNRAS, 287, 481\nWood, K., Lada, C. J., Bjorkman, J. E., Kenyon, S. J., Whitney, B., & Wolff, M. J. 2002,\nApJ, 567, 1183\nYu, Z.-Y., Nagahama, T., & Fukui, Y. 1996, ApJ, 471, 867\n\nThis preprint was prepared with the AAS LATEX macros v5.2.\n\n\fTable 1. Optical and IR Photometry of X-ray Sources\nNo.\n\nV\n(mag)\n(3)\n\nV − Ic\n(mag)\n(4)\n\nOff2\n(′′ )\n(5)\n\nJ\n(mag)\n(6)\n\nH\n(mag)\n(7)\n\nKs\n(mag)\n(8)\n\n280\n281\n282\n283\n284\n285\n286\n287\n288\n289\n290\n291\n292\n293\n294\n295\n296\n\n0.1\n0.4\n0.3\n0.1\n0.3\n***\n0.2\n0.4\n0.0\n1.3\n0.2\n0.5\n0.4\n0.4\n0.3\n0.1\n***\n\n21.57 ± 0.01\n19.75 ± 0.01\n17.30 ± 0.01\n18.72 ± 0.01\n20.24 ± 0.01\n***\n19.76 ± 0.01\n17.76 ± 0.01\n19.09 ± 0.01\n12.55 ± 0.01\n19.33 ± 0.01\n21.32 ± 0.01\n19.26 ± 0.01\n18.02 ± 0.01\n15.88 ± 0.00\n20.11 ± 0.01\n***\n\n3.86 ± 0.02\n3.42 ± 0.01\n2.44 ± 0.01\n3.11 ± 0.01\n3.52 ± 0.01\n***\n3.43 ± 0.01\n2.40 ± 0.01\n3.05 ± 0.01\n1.05 ± 0.02\n3.03 ± 0.01\n3.72 ± 0.02\n2.99 ± 0.01\n2.66 ± 0.01\n2.01 ± 0.01\n3.49 ± 0.01\n***\n\n0.0\n0.4\n0.3\n0.1\n0.3\n0.3\n0.2\n0.5\n0.1\n1.6\n0.3\n0.5\n0.4\n0.4\n0.5\n0.2\n***\n\n15.38 ± 0.06\n14.30 ± 0.03\n13.06 ± 0.02\n13.63 ± 0.03\n14.46 ± 0.03\n14.48 ± 0.04\n14.11 ± 0.03\n13.38± * * *\n13.69 ± 0.02\n10.79 ± 0.02\n14.63 ± 0.06\n15.39 ± 0.07\n14.06 ± 0.04\n13.48 ± 0.04\n11.71 ± 0.02\n14.21 ± 0.04\n***\n\n14.39 ± 0.08\n13.31 ± 0.03\n12.10 ± 0.02\n12.63 ± 0.03\n13.50 ± 0.04\n13.47 ± 0.04\n13.11 ± 0.02\n12.54± * * *\n12.50 ± 0.02\n10.49 ± 0.02\n14.03 ± 0.05\n14.49 ± 0.06\n12.93 ± 0.04\n12.51 ± 0.03\n10.93 ± 0.02\n13.10 ± 0.03\n***\n\n13.74 ± 0.05\n12.97 ± 0.03\n11.64 ± 0.02\n12.29 ± 0.03\n13.13 ± 0.03\n13.06 ± 0.04\n12.66 ± 0.02\n12.26 ± 0.03\n12.06 ± 0.02\n10.40 ± 0.02\n13.80 ± 0.06\n14.13 ± 0.07\n12.53 ± 0.04\n12.24 ± 0.03\n10.62 ± 0.02\n12.62 ± 0.03\n***\n\nF1\n(9)\n\nOff3\n(′′ )\n(10)\n\n[3.6]\n(mag)\n(11)\n\n[4.5]\n(mag)\n(12)\n\n[5.8]\n(mag)\n(13)\n\n[8.0]\n(mag)\n(14)\n\nF2\n(15)\n\nAAA000\nAAA000\nAAA000\nAAAs00\nAAAc00\nAAAccc\nAAA000\nUUA00c\nAAA000\nAAA000\nAAA000\nAAA000\nAAA000\nAAA0s0\nAAA000\nAAA000\n***\n\n0.1\n0.5\n0.1\n0.1\n0.2\n0.2\n0.2\n0.6\n0.2\n1.6\n0.3\n0.3\n0.3\n0.3\n0.3\n0.5\n***\n\n12.99 ± 0.02\n12.79 ± 0.02\n10.76 ± 0.02\n12.04 ± 0.02\n12.86 ± 0.04\n12.16 ± 0.02\n12.15 ± 0.02\n12.02 ± 0.02\n11.68 ± 0.02\n10.33 ± 0.02\n13.46 ± 0.04\n13.81 ± 0.02\n12.16 ± 0.02\n11.98 ± 0.02\n10.35 ± 0.02\n12.29 ± 0.07\n***\n\n12.58 ± 0.02\n12.70 ± 0.02\n10.44 ± 0.02\n11.94 ± 0.02\n12.81 ± 0.04\n11.79 ± 0.03\n11.92 ± 0.02\n11.96 ± 0.03\n11.62 ± 0.02\n10.32 ± 0.02\n13.30 ± 0.05\n13.69 ± 0.02\n12.13 ± 0.02\n11.94 ± 0.02\n10.34 ± 0.02\n12.07 ± 0.07\n***\n\n12.36 ± 0.04\n12.65 ± 0.04\n10.04 ± 0.04\n11.97 ± 0.03\n12.72 ± 0.05\n11.40 ± 0.04\n11.71 ± 0.03\n12.18 ± 0.18\n11.78 ± 0.09\n10.34 ± 0.03\n***\n13.73 ± 0.06\n11.62 ± 0.05\n11.88 ± 0.03\n10.34 ± 0.03\n11.86 ± 0.07\n***\n\n11.72 ± 0.04\n12.72 ± 0.06\n9.36 ± 0.05\n12.11 ± 0.09\n12.74 ± 0.08\n10.71 ± 0.05\n10.99 ± 0.03\n***\n***\n10.37 ± 0.03\n***\n13.17 ± 0.09\n***\n11.98 ± 0.03\n10.27 ± 0.03\n***\n***\n\n4444\n4444\n4444\n4444\n2222\n3333\n4444\n3349\n4449\n4444\n2299\n4444\n4449\n4444\n4444\n2229\n9999\n\n– 30 –\n\n(1)\n\nOff1\n(′′ )\n(2)\n\nNote. - This table is available in its entirety in the electronic edition of the journal. A portion is shown here for guidance regarding its form and content. Column 1: X-ray source number. For\nX-ray source positions see Table 1 of Getman et al. (2006). Columns 2-4: Optical-X-ray positional offset, and optical V , V − Ic magnitudes. Optical data are from Mayne et al. (2007). Columns\n5-9: 2MASS-X-ray positional offset, 2MASS J HKs magnitudes, and 2MASS photometry quality and confusion-contamination flags. For 2MASS source names, see Table 2 of Getman et al. (2006).\nColumn 10: IRAC-X-ray positional offset. For the most of the sources the reported offset is for an IRAC source from the 3.6 μm-band image; when not available, the 4.5 μm-band position is used.\nColumns 11-14: IRAC magnitudes derived in this work. Column 15: Four digit flag (one for each IRAC band) giving photometric apertures and level of source contamination from nearby sources\nand nebular IR emission: 2 pixel aperture with likely high level of contamination, 3 pixel aperture with likely moderate contamination, 4 pixel aperture with likely low level of source contamination.\nA '9' indicates the inability to derive photometry for one of several reasons: out of IRAC channel field of view (this is further clarified by the flag F3 from Table 2), weak or absent source below\nthe detection threshold, strong contamination or confusion due to nearby source(s) or bright nebular emission.\n\n\fTable 2. Membership and Classification of X-ray Sources\nNo\n\nNb\n\nM\n(M⊙ )\n(5)\n\nClass\n\nF1\n\n(3)\n\nAJ\n(mag)\n(4)\n\n(1)\n\n(2)\n\n280\n281\n282\n283\n284\n285\n286\n287\n288\n289\n290\n291\n292\n293\n294\n295\n296\n\n−1.49 ± 0.03\n−2.60 ± 0.02\n−1.53 ± 0.02\n−2.67 ± 0.03\n−2.65 ± 0.08\n−1.29 ± 0.04\n−1.73 ± 0.01\n−2.72 ± 0.08\n−2.71 ± 0.06\n−2.88 ± 0.01\n−2.27 ± 0.23\n−2.41 ± 0.05\n−2.46 ± 0.06\n−2.78 ± 0.01\n−2.77 ± 0.01\n−2.03 ± 0.17\n***\n\nF2\n\nSubregion\n\nF3\n\n(6)\n\n(7)\n\n(8)\n\n(9)\n\n(10)\n\n4\n4\n4\n4\n4\n4\n4\n3\n3\n4\n2\n4\n3\n4\n4\n3\n0\n\n0.6\n0.5\n0.4\n0.5\n0.5\n0.6\n0.5\n0.1\n1.0\n***\n***\n0.5\n0.8\n0.5\n0.7\n0.7\n***\n\n0.2\n0.5\n0.8\n0.7\n0.4\n0.3\n0.5\n0.5\n1.0\n***\n***\n0.2\n0.7\n0.8\n2.1\n0.4\n***\n\nDSK\nNoD\nDSK\nNoD\nNoD\nDSK\nDSK\nNoD\nNoD\nFRG\nFRG\nDSK\nDSK\nNoD\nNoD\nDSK\nUNC\n\n***\n***\n***\n***\n***\n***\n***\n***\n***\n***\n***\nTD\nTD\n***\n***\n***\n***\n\n000\n000\n000\n000\n000\n000\n000\n300\n300\n333\n333\n011\n301\n000\n000\n300\n333\n\nCepOB3b\nCepOB3b\nCepB\nCepOB3b\nCepOB3b\nCepB\nS155\nCepB\nS155\nCepOB3b\nCepB\nCepOB3b\nS155\nCepOB3b\nCepOB3b\nCepB\nCepB\n\n0000\n0000\n0000\n0000\n0000\n0000\n0000\n0000\n0000\n0000\n0000\n0000\n0000\n0000\n0000\n0000\n0000\n\nNote. - This table is available in its entirety in the electronic edition of the journal. A\nportion is shown here for guidance regarding its form and content. Column 1: X-ray source\nnumber. Column 2: SED slope from IRAC photometry with 1σ error. Column 3: Number of\nIRAC bands from which the SED slope was derived. Columns 4-5: J -band source extinction and\nstellar mass estimated from the 2MASS J vs. J −H color-magnitude diagram and a 3(2) Myr PMS\nisochrones for the Cep OB3b/S 155(CepB) regions assuming d = 725 pc. Column 6: Membership\nand PMS class. The membership is from Getman et al. (2006) and the PMS class is derived here:\n\"EXG\" – possible extragalactic contaminant; \"FRG\" – possible foreground contaminant; \"DSK\"\nand \"NoD\" – disk-bearing and diskless PMS stars, respectively; \"UNC\" – object of the uncertain\nclass. Column 7: Flag indicating transition disks as based on our visual inspection of SEDs.\nColumn 8: Three-digit flag indicating source position on IR color-color diagrams: 3.6 − 4.5 vs.\n5.8 − 8.0 diagram, 3.6 − 4.5 vs. 4.5 − 5.8 diagram, and Ks − 3.6 vs. 3.6 − 4.5 diagram. Flag\nvalues: \"0\" – the PMS classification from Column 6 is consistent with location in the colorcolor diagram; \"1\" – disk-bearing PMS star from Column 6 lies in the locus of diskless stars in\nthe color-color diagram; \"2\" – diskless PMS candidate from Column 6 lies in the locus of diskbearing stars in the color-color diagram; \"3\" – not a PMS member from Column 6 or not enough\ninformation to place a member on the corresponding color-color diagram. Column 9: Subregion:\n\"CepOB3b\" – lightly absorbed Cepheus OB3b cluster; \"CepB\" – molecular cloud; \"S155\" – H II\nregion interface. Column 10: Positional flag for each IRAC channel: \"0\" – source lies within the\nIRAC channel field of view; \"1\" – source lies outside the IRAC channel field.\n\n– 31 –\n\nα0\n\n\fTable 3. Infrared Properties of non-Chandra IR-Excess Members\nNo.\n\nDecl.\n(deg)\n(3)\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n\n343.90431\n343.90796\n343.90916\n343.91215\n343.91421\n343.91472\n343.92033\n343.92861\n343.93061\n343.93414\n\n62.619685\n62.613150\n62.601677\n62.631087\n62.627495\n62.634968\n62.641813\n62.671552\n62.645682\n62.631564\n\nJ\n(mag)\n(4)\n16.26\n15.67\n15.06\n15.20\n14.08\n15.22\n15.76\n15.32\n16.03\n15.21\n\n± 0.12\n± 0.07\n± 0.04\n± 0.05\n± 0.03\n± 0.05\n± 0.07\n± 0.05\n± 0.10\n± 0.05\n\nH\n(mag)\n(5)\n14.99\n14.36\n13.76\n14.21\n12.97\n14.20\n14.58\n14.41\n14.74\n14.24\n\n± 0.09\n± 0.05\n± 0.04\n± 0.08\n± 0.03\n± 0.05\n± 0.07\n± 0.06\n± 0.07\n± 0.05\n\nKs\n(mag)\n(6)\n13.97\n13.60\n12.85\n13.93\n12.29\n13.51\n13.88\n14.06\n13.88\n13.46\n\n± 0.06\n± 0.04\n± 0.02\n± 0.05\n± 0.02\n± 0.04\n± 0.05\n± 0.05\n± 0.06\n± 0.03\n\nF1\n(7)\nBAAcc0\nAAA000\nAAA000\nAAA000\nAAA000\nAAA000\nAAA000\nAAA000\nAAAcc0\nAAA000\n\n[3.6]\n(mag)\n(8)\n12.49\n12.41\n11.66\n13.32\n11.46\n12.66\n12.69\n13.58\n12.67\n12.18\n\n± 0.02\n± 0.02\n± 0.02\n± 0.03\n± 0.02\n± 0.02\n± 0.02\n± 0.02\n± 0.02\n± 0.02\n\n[4.5]\n(mag)\n(9)\n11.81\n11.95\n11.12\n12.98\n11.02\n12.29\n12.28\n13.36\n12.04\n11.72\n\n± 0.02\n± 0.02\n± 0.02\n± 0.03\n± 0.02\n± 0.02\n± 0.02\n± 0.02\n± 0.02\n± 0.02\n\n[5.8]\n(mag)\n(10)\n11.15\n11.64\n10.67\n12.57\n10.74\n12.14\n11.95\n13.22\n11.38\n11.48\n\n± 0.03\n± 0.03\n± 0.03\n± 0.03\n± 0.03\n± 0.03\n± 0.03\n± 0.03\n± 0.03\n± 0.03\n\n[8.0]\n(mag)\n(11)\n\nSubregion\n\n10.34 ± 0.03\n11.06 ± 0.03\n9.92 ± 0.03\n11.81 ± 0.03\n10.03 ± 0.03\n11.69 ± 0.03\n11.39 ± 0.03\n12.75 ± 0.04\n10.35 ± 0.03\n11.00 ± 0.03\n\n(12)\n\nAJ\n(mag)\n(13)\n\nM\n(M⊙ )\n(14)\n\nCepOB3b\nCepOB3b\nCepOB3b\nCepOB3b\nCepOB3b\nCepOB3b\nCepOB3b\nCepOB3b\nCepOB3b\nCepOB3b\n\n1.3\n1.3\n1.2\n0.7\n0.7\n0.7\n1.0\n0.5\n1.3\n0.5\n\n0.20\n0.30\n0.43\n0.27\n0.61\n0.27\n0.24\n0.22\n0.24\n0.25\n\nNote. - This table is available in its entirety in the electronic edition of the journal. A portion is shown here for guidance regarding its form and content. Column 1: IR-excess source number.\nColumns 2-3: IRAC right ascension and declination for epoch J2000.0 in degrees. Columns 4-7: 2MASS J HKs magnitudes, and 2MASS photometry quality and confusion-contamination flag.\nColumns 8-11: IRAC magnitudes derived in this work. Column 12: Indicates on which region the source position is projected: \"CepOB3b\" – lightly absorbed Cepheus OB3b cluster; \"CepB\" –\nmolecular cloud; \"S155\" – H II interface. Columns 13-14: J -band source extinction and stellar mass derived from the J vs. J − H color-magnitude diagram by dereddening 2MASS photometric\ncolors to the 3(2) Myr PMS isochrones for the Cep OB3b/S 155(CepB) regions assuming d = 725 pc.\n\n– 32 –\n\n(1)\n\nR.A.\n(deg)\n(2)\n\n\fTable 4. Disk Fractions of mass complete PMS samples\nClass\n\nCep OB3b\nSW\n(3)\n\nS 155\nNE\n(4)\n\nS 155\nSW\n(5)\n\nCep B\nNE\n(6)\n\nDSK\nNoD\nDisk Frac.\n\n28\n34\n0.45+0.06\n−0.06\n\n14\n14\n+0.09\n0.50−0.09\n\n0.5 . M . 1 M⊙\n10\n14\n0.42+0.10\n−0.09\n\n9\n4\n\n5\n4\n\n4\n3\n\n0.69+0.10\n−0.14\n\n+0.14\n0.56−0.16\n\n0.57+0.15\n−0.18\n\nDSK\nNoD\nDisk Frac.\n\n10\n16\n0.38+0.10\n−0.08\n\n11\n13\n0.46+0.1\n−0.09\n\nM & 1 M⊙\n4\n1\n+0.08\n0.80−0.25\n\n3\n3\n\n9\n2\n\n4\n1\n\n0.50+0.18\n−0.17\n\n0.82+0.06\n−0.16\n\n0.80+0.08\n−0.25\n\nDSK\nNoD\nDisk Frac.\n\n38\n50\n0.43+0.05\n−0.05\n\nTotal over the M & 0.5 M⊙ mass range\n25\n14\n12\n27\n15\n7\n0.48+0.07\n0.48+0.09\n0.63+0.10\n−0.07\n−0.09\n−0.12\n\n14\n6\n0.70+0.08\n−0.11\n\n8\n4\n\nClass\n\nInner\n( 0′ − 3′ )\n\nDSK\nNoD\nDisk Frac.\n\n0.56+0.11\n−0.12\n\nIntermediate\n(4′ − 7′ )\n0.5 . M . 1 M⊙\n30\n24\n0.56+0.06\n−0.07\n\nDSK\nNoD\nDisk Frac.\n\n13\n3\n0.81+0.06\n−0.13\n\nM & 1 M⊙\n17\n13\n0.57+0.08\n−0.09\n\n2\n13\n+0.13\n0.13−0.04\n\nDSK\nNoD\nDisk Frac.\n\n22\n10\n0.69+0.07\n−0.09\n\nTotal over the M & 0.5 M⊙ mass range\n47\n37\n0.56+0.05\n−0.05\n\n12\n33\n0.27+0.07\n−0.05\n\n9\n7\n\nOuter\n(> 8′ )\n10\n20\n0.33+0.10\n−0.07\n\nCep B\nSW\n(7)\n\n0.67+0.10\n−0.15\n\n– 33 –\n\n(1)\n\nCep OB3b\nNE\n(2)\n\n\f– 34 –\n\nFig. 1.- (a) Large-scale optical image from the Digitized Sky Survey (DSS) of the\nCepheus B/OB3 environs. Magenta contours and core labels outline 12 CO emission from\nSargent (1977). O stars (cyan circles), B0-B3 (green), B4-B9 (red) are from Blaauw et al.\n(1959). The black dashed line demarcates the older sub-group Cep OB3a from Cep OB3b.\nNorth is up, east is to the left. (b) Closeup of the Cep B region showing the 20′ × 15′ IRAC\nimage in the 4.5 μm band. The ionizing sources of the region, the O7 star HD 217086 and\nB1 star HD 217061, are marked. The magenta contours show the 12 CO emission measured\nby Beuther et al. (2000) with the central hot core marked. The 17′ × 17′ Chandra ACIS-I\nfield is outlined in cyan. The H II S 155 interface between the Cep B molecular cloud and\nunobscured Cep OB3b association is schematically indicated in cyan.\n\n\f– 35 –\n\nFig. 2.- Combined X-ray and IR image of the Cep B/Cep OB3b region. The adaptively\nsmoothed Chandra ACIS-I image in the 0.5 − 8.0 keV band (blue) is superposed on the\nSpitzer IRAC composite image in the 3.6 μm (green) and 5.8 μm (red) bands. The 17′ × 17′\nChandra ACIS-I field is outlined in blue and the ∼ 20′ × 15′ field of the Spitzer IRAC\nmosaic in 3.6/5.8 μm bands is outlined in green.\n\n\f– 36 –\n\nFig. 3.- IR spectral energy distributions for nine representative diskfree (Class III) X-ray\nstars. From top to bottom, SEDs for stars in Cep OB3b, S 155 and Cep B subregions. JHKs\n(diamond) and IRAC-band (square) flux points with usually small errors. The dashed and\nsolid lines give the original and (de)reddened IC 348 median SED from Lada et al. (2006)\nfitted to the data. The top two lines of the panel labels give information from Table 2. The\nthird line gives the spectral class of the IC 348 median SED template from Lada et al. (2006)\nand reddening applied to the original template SED to fit the observed Cepheus source SED.\nSee the electronic edition of the Journal for the full atlas of IR SEDs of the Cepheus X-ray\nyoung stars.\n\n\f– 37 –\n\nFig. 4.- IR spectral energy distributions for nine representative disk-bearing (Class II)\nX-ray stars. See Figure 3 for details.\n\n\f– 38 –\n\nFig. 5.- IR spectral energy distributions for nine representative transition disk (Class II/III)\nX-ray stars. See Figure 3 for details.\n\n\f– 39 –\n\n70\n60\n\n(a)\n\nN\n\n50\n40\n30\n20\n10\n0\n\n40\n\n-3\n\n-2\n\n-3\n\n-2\n\n-1\n\n0\n\n1\n\n-1\n\n0\n\n1\n\n(b)\n\nN\n\n30\n20\n10\n0\n\nα0\n\nFig. 6.- Histograms of observed SED spectral slopes α0 for (a) X-ray stars in the Cepheus\nfield and (b) comparisons in IC 348. Colors indicate PMS evolutionary classes: diskfree\nClass III stars (red), disk-bearing Class I and II stars (blue), and transition disk Class II/III\nstars (green).\n\n\f– 40 –\n\nFig. 7.- Infrared color-color diagrams of X-ray stars: Cep OB3b (left), S 155 (middle) and\nCep B (right) subregions; long IRAC channels (top), short IRAC channels (middle), 2MASS\nKs and short IRAC channels (bottom). Colors indicate PMS evolutionary classes: Class III\n(red), Class I and II (blue), and Class II/III transition disk stars (green). The reddening\nvectors show AV ∼ 30 mag using the extinction law from Flaherty et al. (2007). Legends\nindicate number of stars with available photometry.\n\n\f– 41 –\n\nFig. 8.- IRAC color-color diagrams of non-X-ray IR-excess sources. Top: [3.6] −[4.5] versus\n[5.8] − [8.0] color-color diagrams employed to select PMS candidates for (a) Cep OB3b, (b)\nS 155, and (c) Cep B subregions. Dashed lines show classification criteria. Bottom: [4.5]\nversus [4.5] − [8.0] color-magnitude diagrams for (d) Cep OB3b, (e) S 155, and (f) Cep B\nsubregions showing X-ray emitting PMS stars (×) and non-X-ray PMS candidates (circles).\nPanel (d) also shows X-ray emitting extragalactic contaminants (diamonds). Reddening\nvectors represent AV ∼ 30 mag.\n\n\f– 42 –\n\n2.0\n\n~3.2\n(a)\n\n2.0\n\n1.3\n\n0.8\n\n0.5\n\n0.3\n\n0.2\n\n0.1MO\n\n48\n\nCepOB3b\n\n25\n\n1.5\n\n(19+25)\n\n(10+49)\n31\n(4+41)\n\n14\n13\n\n(17+4)\n\n1.0\n0.5\n\n4\n\n(8+1)\n\n2\n\n0.4\n(b)\n\n1.5\nlog (N)\n\n(5+3)\n\n(4+0)\n\n0.0\n2.0\n\n0.2\n\n0.0 -0.2 -0.4 -0.6 -0.8 -1.0 -1.2 -1.4\nClass III Chandra\nClass II (Chandra+non-Chandra)\n\nS155\n16\n10\n\n1.0\n\n(12+6)\n\n(0+7)\n\n(1+2)\n(0+0)\n1\n\n2\n(0+1)\n0\n\n0\n\n0.4\n\n0.2\n\n0.0 -0.2 -0.4 -0.6 -0.8 -1.0 -1.2 -1.4\n\n(c)\nCepB\n\n1.5\n1.0\n\n4\n3\n\n0.5\n\n2.0\n\n(10+0)\n(6+0)\n\n(4+1)\n(2+1)\n\n0.5\n\n(6+0)\n(4+1)\n\n6\n\n(4+0)\n\n0.0\n\n(5+6)\n\n(5+3)\n(3+1)\n\n0.0\n\n(1+19)\n\n10\n\n4\n\n(2+2)\n\n4\n\n3\n0\n\n0.4\n\n0\n\n0.2\n\n1\n\n0\n\n0.0 -0.2 -0.4 -0.6 -0.8 -1.0 -1.2 -1.4\nlog (M/MO)\n\nFig. 9.- Mass distribution of Class III Chandra (red) and combined Class II Chandra and\nnon-Chandra (blue) PMS stars in the (a) Cep OB3b, (b) S 155, and (c) CepB sub-regions.\nThe numbers of stars are estimated within mass bins of 0.2 dex width and 1σ equivalent\nPoisson errors are shown. Annotation labels indicate the corresponding to each bin number\nof detected Chandra Class III stars (red), as well as Chandra + non-Chandra Class II stars\n(blue). The dashed lines represent the scaled versions of the Galactic field IMF (Kroupa\n2002).\n\n\f– 43 –\n\n2.0 MO.\n2.5 MO.\n\n0.6 MO.\n1.2 MO.\n\n0.3 MO.\n\n1.0\nCha I (160pc; 2Myr)\nIC 348 (315pc; 2-3Myr)\nσ Ori (340pc; 3Myr)\nCepOB3b (725pc; 2-3Myr)\n\n0.8\n\nDisk Fraction\n\n148/219\n\n0.6\n10/22\n\n52/116\n\n0.4\n\n0.2\n\n0.0\n\n0\n\n2\n\n4\n\n6\nMJ [mag]\n\n8\n\n10\n\n12\n\nFig. 10.- Comparison of disk fraction as a function of stellar absolute J-band magnitude\nfor four 2 − 3 Myr stellar clusters: Cep OB3b (circles with 1σ error bars); Cha I (solid\nline); IC 348 (dashed line); and σ Ori (dashed-dotted line). The Cep OB3b stellar sample is\nthe combined Class II/III Chandra and Class II non-Chandra PMS stars from this work.\nData for the three other clusters are from Luhman et al. (2008b). The top axis shows an\napproximate scaling to stellar mass.\n\n\f– 44 –\n\nFig. 11.- Spatial distribution of Cepheus Chandra plus non-Chandra mass-complete selected PMS samples superposed on a grey-scale 5.8 μm band Spitzer-IRAC image: diskfree\nstars (red), disk-bearing stars (blue). Panel (a) shows 0.5 . M . 1.0 M⊙ stars, and panel\n(b) shows M & 1.0 M⊙ stars. The O7Vn star HD 2170786 is marked by the cyan squarecircle, and the molecular hot core by the cyan cross. The cyan dashed locus delineates the\nS 155 subregion. The Chandra field of view is outlined by the large cyan square, and the\nNE and SW azimuthal zones are demarcated by the magenta line.\n\n\f– 45 –\n\n1 pc\n\n1.0\n\nCep B\n\nS155\n\n2 pc\nCep OB3b\nM > 0.5MO\n0.5 < M < 1MO\nM > 1MO\n\n0.9\n0.8\n0.7\nDisk Fraction\n\nHD 217086\n0.6\n0.5\n0.4\n\nINTERMEDIATE\nLAYER\n\nINNER LAYER\n\n0.3\n0.2\n\nOUTER LAYER\n\n0.1\n0.0\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n7\n6\n8\nR [arcmin]\n\n9\n\n10\n\n11\n\n12\n\n13\n\nFig. 12.- Running average of the disk fraction as a function of angular distance from\nCep B hot core for the combined Chandra plus non-Chandra sample of PMS stars. The\nthree subregions are separated by dashed lines and the green vertical arrow indicates the\nprojected location of the primary ionizing star HD 217086. Mass-stratified sub-samples are\ncolor coded: M > 0.5 M⊙ (red), 0.5 < M < 1 M⊙ (black), and M > 1 M⊙ (blue). An\ninterpretation based on three constant disk fraction layers is indicated by horizontal grey\nbars with their disk fraction levels consistent with those from Table 4.\n\n14\n\n\f– 46 –\n\n8\n10\n12\n\nV0 [mag]\n\n14\n16\n18\n20\n22\n0\n\n1\n\n2\n(V - Ic)0 [mag]\n\n3\n\n4\n\nFig. 13.- V Ic color-magnitude diagram showing the Cep B/Cep OB3b X-ray selected PMS\nstars individually corrected for extinction. Disk-bearing stars are plotted as open squares,\nand diskfree stars as filled circles. Colors indicate subregion location: Cep OB3b (red),\nS 155 (green), and Cep B (blue). Solid lines show PMS isochrones for ages 1, 2, 3, 4, 5 Myr\nand the Zero-Age Main Sequence from evolutionary tracks of Siess et al. (2000) assuming\nd = 725 pc. Dashed lines show mass tracks 0.3, 1.0, and 3.0 M⊙ . The reddening vector\nshows AV ∼ 2 mag.\n\n\f– 47 –\n\nLog (LX) [erg/s]\n\n32\n\n(a)\n\n32\n\n31\n\n31\n\n30\n\n30\n\n29\n\n29\n\n28\n\n28\n\n(b)\n\n-1.0 -0.8 -0.6 -0.4 -0.2 0.0 0.2 0.4 0.6\n-1.0 -0.8 -0.6 -0.4 -0.2 0.0 0.2 0.4 0.6\nLog (M/Mo)\nFig. 14.- X-ray luminosity as a function of mass for lightly-obscured PMS stars in (a)\nCep OB3b and (b) the Orion Nebula Cluster from Getman et al. (2005). In this figure, ×\nsymbols are diskless or non-accreting stars, • are optically thick disk or accreting stars, and\n✷ are transition disk objects. Running medians for log Lx are shown as dashed (solid) lines\nfor diskless or non-accreting (optically thick disk or accreting) stars.\n\n\f"}