{"id": "http://arxiv.org/abs/0802.3050v1", "guidislink": true, "updated": "2008-02-21T13:18:23Z", "updated_parsed": [2008, 2, 21, 13, 18, 23, 3, 52, 0], "published": "2008-02-21T13:18:23Z", "published_parsed": [2008, 2, 21, 13, 18, 23, 3, 52, 0], "title": "High Efficiency 3-Phase Cmos Rectifier with Step Up and Regulated", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.2988%2C0802.3615%2C0802.3208%2C0802.0684%2C0802.2142%2C0802.2676%2C0802.2868%2C0802.1476%2C0802.1390%2C0802.4435%2C0802.4286%2C0802.2283%2C0802.0540%2C0802.2450%2C0802.2556%2C0802.3247%2C0802.0929%2C0802.2024%2C0802.0399%2C0802.3147%2C0802.1017%2C0802.4102%2C0802.0837%2C0802.0196%2C0802.4378%2C0802.0627%2C0802.3729%2C0802.0116%2C0802.2917%2C0802.2693%2C0802.2672%2C0802.3390%2C0802.2095%2C0802.0490%2C0802.4290%2C0802.4402%2C0802.0177%2C0802.3695%2C0802.0037%2C0802.3746%2C0802.0993%2C0802.1127%2C0802.0924%2C0802.0122%2C0802.0727%2C0802.4428%2C0802.3114%2C0802.0589%2C0802.1596%2C0802.4027%2C0802.3719%2C0802.3600%2C0802.3050%2C0802.1643%2C0802.0061%2C0802.2130%2C0802.3657%2C0802.3899%2C0802.1423%2C0802.2311%2C0802.0215%2C0802.1194%2C0802.1384%2C0802.1754%2C0802.4005%2C0802.3605%2C0802.2993%2C0802.1265%2C0802.3496%2C0802.3666%2C0802.2065%2C0802.4123%2C0802.3949%2C0802.1841%2C0802.2236%2C0802.3339%2C0802.2522%2C0802.0051%2C0802.4176%2C0802.0694%2C0802.1187%2C0802.2317%2C0802.2664%2C0802.2532%2C0802.3062%2C0802.3422%2C0802.1696%2C0802.2105%2C0802.1676%2C0802.3282%2C0802.0255%2C0802.2166%2C0802.2387%2C0802.3777%2C0802.2853%2C0802.2985%2C0802.1653%2C0802.4461%2C0802.4310%2C0802.0413%2C0802.2660&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "High Efficiency 3-Phase Cmos Rectifier with Step Up and Regulated"}, "summary": "This paper presents several design issues related to the monolithic\nintegration of a 3-phase AC to DC low voltage, low power rectifier for 3-phase\nmicro source electrical conditioning. Reduced input voltage operation (down to\n1V), high efficiency, and output voltage regulations are implemented, based on\ncommercially available CMOS technology. Global design and system issues are\ndetailed. The management of start-up sequences under self supplied conditions\nas well as output voltage regulations are specifically addressed. Simulation\nresults, practical implementation and validation are presented. They are based\non the association of three micro elements : a 3-phase micro-generator, a stand\nalone 3-phase AC to DC integrated rectifier, and an output voltage conditioner\nbased on a commercially available IC.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.2988%2C0802.3615%2C0802.3208%2C0802.0684%2C0802.2142%2C0802.2676%2C0802.2868%2C0802.1476%2C0802.1390%2C0802.4435%2C0802.4286%2C0802.2283%2C0802.0540%2C0802.2450%2C0802.2556%2C0802.3247%2C0802.0929%2C0802.2024%2C0802.0399%2C0802.3147%2C0802.1017%2C0802.4102%2C0802.0837%2C0802.0196%2C0802.4378%2C0802.0627%2C0802.3729%2C0802.0116%2C0802.2917%2C0802.2693%2C0802.2672%2C0802.3390%2C0802.2095%2C0802.0490%2C0802.4290%2C0802.4402%2C0802.0177%2C0802.3695%2C0802.0037%2C0802.3746%2C0802.0993%2C0802.1127%2C0802.0924%2C0802.0122%2C0802.0727%2C0802.4428%2C0802.3114%2C0802.0589%2C0802.1596%2C0802.4027%2C0802.3719%2C0802.3600%2C0802.3050%2C0802.1643%2C0802.0061%2C0802.2130%2C0802.3657%2C0802.3899%2C0802.1423%2C0802.2311%2C0802.0215%2C0802.1194%2C0802.1384%2C0802.1754%2C0802.4005%2C0802.3605%2C0802.2993%2C0802.1265%2C0802.3496%2C0802.3666%2C0802.2065%2C0802.4123%2C0802.3949%2C0802.1841%2C0802.2236%2C0802.3339%2C0802.2522%2C0802.0051%2C0802.4176%2C0802.0694%2C0802.1187%2C0802.2317%2C0802.2664%2C0802.2532%2C0802.3062%2C0802.3422%2C0802.1696%2C0802.2105%2C0802.1676%2C0802.3282%2C0802.0255%2C0802.2166%2C0802.2387%2C0802.3777%2C0802.2853%2C0802.2985%2C0802.1653%2C0802.4461%2C0802.4310%2C0802.0413%2C0802.2660&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "This paper presents several design issues related to the monolithic\nintegration of a 3-phase AC to DC low voltage, low power rectifier for 3-phase\nmicro source electrical conditioning. Reduced input voltage operation (down to\n1V), high efficiency, and output voltage regulations are implemented, based on\ncommercially available CMOS technology. Global design and system issues are\ndetailed. The management of start-up sequences under self supplied conditions\nas well as output voltage regulations are specifically addressed. Simulation\nresults, practical implementation and validation are presented. They are based\non the association of three micro elements : a 3-phase micro-generator, a stand\nalone 3-phase AC to DC integrated rectifier, and an output voltage conditioner\nbased on a commercially available IC."}, "authors": ["J. -C. Crebier", "Y. Lembeye", "H. Raisigel", "O. Deleage", "J. Delamare", "O. Cugat"], "author_detail": {"name": "O. Cugat"}, "author": "O. Cugat", "arxiv_comment": "Submitted on behalf of EDA Publishing Association\n  (http://irevues.inist.fr/EDA-Publishing)", "links": [{"href": "http://arxiv.org/abs/0802.3050v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0802.3050v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cs.OH", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cs.OH", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0802.3050v1", "affiliation": "G2ELab", "arxiv_url": "http://arxiv.org/abs/0802.3050v1", "journal_reference": "Dans Symposium on Design, Test, Integration and Packaging of\n  MEMS/MOEMS - DTIP 2007, Stresa, lago Maggiore : Italie (2007)", "doi": null, "fulltext": "Stresa, Italy, 25-27 April 2007\n\nHIGH EFFICIENCY 3-PHASE CMOS RECTIFIER WITH STEP UP AND REGULATED\nOUTPUT VOLTAGE - DESIGN AND SYSTEM ISSUES FOR MICRO GENERATION\nAPPLICATIONS\nJ.-C. Crebier, Y. Lembeye, H. Raisigel, O. Deleage, J. Delamare, and O. Cugat\nLaboratoire de Génie Electrique de Grenoble / G2Elab / www.g2elab.inpg.fr\nGrenoble, FRANCE\ncrebier@g2elab.inpg.fr, lembeye@g2elab.inpg.fr\nABSTRACT:\nThis paper presents several design issues related to the\nmonolithic integration of a 3-phase AC to DC low voltage,\nlow power rectifier for 3-phase micro source electrical\nconditioning. Reduced input voltage operation (down to 1V),\nhigh efficiency, and output voltage regulations are\nimplemented, based on commercially available CMOS\ntechnology. Global design and system issues are detailed.\nThe management of start-up sequences under self supplied\nconditions as well as output voltage regulations are\nspecifically addressed. Simulation results, practical\nimplementation and validation are presented. They are based\non the association of three micro elements: a 3-phase microgenerator, a stand alone 3-phase AC to DC integrated\nrectifier, and an output voltage conditioner based on a\ncommercially available IC.\n1. INTRODUCTION\nIn recent years, new micro-sources of electrical energy for\nwireless sensors and μ-devices have been investigated [1].\nThese new micro-sources, which represent an alternative to\nchemical batteries, generally provide a low-power electrical\noutput, often low-voltage, and sometimes erratic. The\nassociated power electronics providing the delicate interface\nbetween the load (sensor, transmitter) and its autonomous\nsupply must be adapted to these specific requirements, the\nsame time, it must be able to regulate and stabilize the DC\nvoltage applied to the load. Additional requirements in\ndesign and system integration are minimal wastage of\nenergy and limitation of device size [2].\n\nThe paper reports on the selection, design, fabrication and\ntesting of a highly integrated, low power conditioner for 3phase micro-generators [3]. Firstly, the choice of converter\ntopology is investigated, having in mind that the converter\nmust rectify the 3-phase variable input signals and at the\nsame time, it must provide a regulated and stabilized boosted\nDC output voltage to the load. After this first section, we\nfocus on the design of a stand-alone full-wave rectifier for 3phase AC inputs in the range of 1-3.3 V (line-to-line), 5-500\nmA at 10-100 kHz. Specific low powering issues such as\nlow voltage rectification, self-powering and automatic startup are clearly presented. These issues have been solved by\noriginal designs and concepts realized in CMOS 0.35 μm\ntechnology. Measurements on the fabricated μ-rectifier\ncoupled to a 3-phase micro-generator indicates its full\nfunctionality and high conversion efficiency (up to 90 %). A\n\n©EDA Publishing/DTIP 2007\n\nfinal part presents the second stage of the conditioner,\ndesigned to boost and regulate the output voltage of the\nconverter. Design issues are related, based on the use of a\nselection of commercially available devices. The global\nconverter operation is validated and characterized through\nexperimental implementations.\n2. TOPOLOGY SELECTION FOR 3-PHASE\nRECTIFICATION AND OUTPUT VOLTAGE\nREGULATION.\nThree-phase voltage rectification is a common, well known\nand well covered power electronics design topic. Usually\nbased on rectifier diodes, for low-voltage low-power\napplications, these devices are being replaced by MOSFET\ntransistors which are preferred for their lower forward voltage\ndrops and their absence of recovery. Operating either in\nsynchronous mode or coupled with intelligent drivers,\nthreshold-less as well as reduced forward voltage drops are\nachieved. These full-wave converters perform AC to DC\nrectification without the capability to boost nor regulate the\noutput voltage level. The basic topology is presented on\nfigure 1, implemented with complementary MOSFET\ntransistors driven by comparators.\n\nVDDA\n\nV1\n\ngnd\n\nI1\n\nI3\n\nFigure 1. Topology of a MOSFET-based full-wave 3-phase\nrectifier\n2.1. Two stage cascaded topology.\nOutput voltage boost and regulation may be carried out using\na second stage power electronic or switched capacitor\nconverter. Its choice depends in general on power flow level\nand range of conversion. Figures 2 presents two basic\ntopologies used to perform voltage boost and regulation.\n\nISBN: 978-2-35500-000-3\n\n\fJ.-C. Crebier et al.\nHigh Efficiency 3-Phase CMOS R ectifier with Step up and....\n\nFigure 2. Topology of dual- stage AC-DC and DC-DC stepup boot converter\n\nFigure 3. Quasi-single stage power electronic topology for\nAC-DC step-up electrical conditioning.\n\nNowadays, the active parts of this second stage can easily be\nintegrated into a single die, and devices are commercially\navailable [4, 5]. However, they also require several passive\nelements for storage and filtering which up to now remain\ndifficult to integrate in or above IC [6, 7]. Luckily, thanks to\nthese dual-stage cascaded topologies, the two converters are\ndecoupled, which offers the opportunity to optimize each\none separately. As a result, the second stage can operate at\nmuch higher switching frequencies, allowing drastic\nreductions in passive element sizes and stored energy levels ;\nindeed, the middle stage storage capacitor can be lowered\nthank to the second stage high bandwidth regulation loop.\n\nThe second solution takes advantage of the technology used\nfor the implementation of the 3-phase AC-DC rectifier based\non threshold-less, reduced forward voltage drop MOSFET\ncells. Thanks to these components, active 3-phase\nrectification and step-up conditioning can be achieved,\nswitching all transistors at much higher frequencies than the\ninput signals generated by the micro-generator. The resulting\nsingle-stage topology is depicted on figure 4. In this topology,\nthe number and sizes of active devices is minimized as well\nas the number of passive ones. In addition, the stress on active\ndevices is equally shared among all transistors, making this\nsolution highly suitable for our aims.\n\n2.2. Single-stage topologies\nIn order to reduce the number of converters but also the\nnumber of active and passive components, as well as to\nincrease the global efficiency of the electrical conditioner, it\nmay be interesting to merge the cascaded topology into a\nsingle-stage or quasi-single stage converter. In power\nelectronics, extensive research activities have been carried\nout in these fields in the past decade. In order to perform AC\nto DC rectification as well as voltage boost and regulation,\nthe single-stage converter must switch the input current at\nhigher frequencies than the micro-generator's output AC\nsignals. Taking advantage of its phase inductances which\nbecome dominant at high frequencies, energy can be stored\nand then released in a boost or step-up manner in order to\namplify and to regulate the output voltage level. According\nto our application, two possible topologies have been\nidentified.\nThe first topology is only based on the removal of the\nmiddle stage storage capacitor. Operating the boost chopper\nat high switching frequencies, and taking into account\nmicro-generator phase impedances, the output voltage can\nbe amplified, and at the same time the generator current\nwaveforms can be improved (leading to reduced harmonic\ncontents and reduced harmonic losses). Figure 3 presents the\ntopology. When operating the boost part of the converter in\ndiscontinuous mode, the 3-phase AC-DC converter acts only\nas a switch-gear for the 3-phase current. All components can\nbe integrated in the same silicon chip in CMOS technology,\nwhich is a highly suitable solution for global monolithic\nintegration. Besides, fewer passive elements are needed. The\nmain drawback is that the stress applied to the boost chopper\nis quite important. Besides, the converter voltage ratings\nmust be set according to output voltage levels.\n\n©EDA Publishing/DTIP 2007\n\nFigure 4. Single-stage AC-DC boost rectifier topology.\n2.3. Micro conditioner selection.\nThe choice of the best converter relies on many design and\noperating issues. At first, the single-stage topology seems to\noffer the best compromises. However, it requires operating\npower CMOS inverter legs at high switching frequencies.\nThis is quite challenging because the switching transition of\nthe CMOS legs at high frequencies will generate large power\nlosses making its optimization difficult.\nLarge CMOS components are not suitable for high switching\nfrequencies with basic control, because the occurrence of\nshort-circuits during transitions creates very large and\nundesirable source currents. As a result, in order to offer good\nresults this topology requires extensive and specific research\nactivity on CMOS switching transition management [8]. This\nis out of the scope of this paper and first work.\nA quasi-single stage structure also seems interesting, but its\nimplementation is delicate for the same reasons as above.\nIndeed, the boost chopper must operate in synchronous mode\nat high switching frequencies while carrying the full load\ncurrent. In addition, all devices must be rated to handle higher\nvoltage levels.\nAlthough the cascaded solution based on a dual-stage\ntopology requires a larger amount of active and passive\n\nISBN: 978-2-35500-000-3\n\n\fJ.-C. Crebier et al.\nHigh Efficiency 3-Phase CMOS R ectifier with Step up and....\n\ndevices, it appears as being the most affordable solution at\nthe moment. Besides, the primary and secondary stages are\ndecoupled, which allows for their respective optimizations.\nFinally, at the moment, a cascaded topology allows to\nmaintain switching frequencies of all converters at\nreasonable levels, leading to a good global efficiency (the\nprice to pay being the size and the amount of passives).\nThe following part of the paper will now focus on the global\ndesign and system integration issues related to the\nmonolithic and hybrid integrations of the cascaded topology.\n3. THREE-PHASE HIGH EFFICIENCY RECTIFIER\nWITH STEP-UP OUTPUT\nThis part presents the design of a dual-stage 3-phase AC-DC\nconditioner. According to the previous section, this function\nhas been separated in two parts. The first part deals with the\n3-phase rectifier that has been the subject of particular\nstudies for its integration in CMOS technology, which are\npresented in the following paragraph. Then the fabrication of\nthe second stage using a commercial circuit is presented.\n3.1. Converter primary stage: the three-phase rectifier\nThe monolithic integration of the 3-phase AC to DC micro\nconditioner relies on several design and technological issues.\nFirst of all, in order to minimize converter losses, a low\nvoltage CMOS technology has been considered. It offers the\npossibility to implement \"power\" devices with adapted\ncharacteristics (low ON state voltage drop, low voltage\nthresholds) while giving the opportunity to design highly\ndedicated control electronics. The rectification is no longer\nimplemented with diodes (not even Schottky): instead, we\nuse MOSFETs designed and controlled to rectify the low\nlevel voltages without threshold and under reduced forward\nvoltage drops. Specific care is given to the design of the\npower switches and their control. Each power switch is\ncontrolled by an associated comparator which drives it\naccording to its voltage polarity (Figure 1). These\ncomparators are supplied by the variable, low-level rectified\noutput DC voltage (for general and stand-alone purposes).\nAs a result, the rectifier is self-supplied and it must be\ndesigned to meet many specific functional requirements. In\nthis paper we will focus on two specific functionalities that\nare required for this rectifier. First, the start-up sequence is\npresented and its influence on the design is discussed.\nSecond, the difficult case of starting this self-powered circuit\nwhen having a heavy load (understand a large discharged\ncapacitor tank) is treated and a solution is presented. The\nother functionalities of this 3-phase rectifier have already\nbeen presented in [9].\n3.1.1. Start-up sequence\nSince the comparators are directly supplied by the rectifier\noutput DC voltage, there is obviously a problem at start-up.\nSince no power is available at the converter output, the\ncomparators are not supplied and the power switches are not\ndriven. Thus, another specific circuit is needed in order to\nensure start-up until the output voltage reaches 1V, during at\n\n©EDA Publishing/DTIP 2007\n\nleast a few μs so as to stabilize the current and voltage\nreferences within the comparators. A first solution would be\nthe use of the inherent body diodes within the MOS switches\nto rectify the voltages. In this case, all power MOSs must be\nmaintained in their OFF state by using, for example, pulldown resistors connected to their gates. But in this case, due\nto diode voltage drop, starting the μ-rectifier requires an input\nvoltage level higher than 2 x 0.6 V + 1 V = 2.2 V (voltage\ndrop of two diodes in series + minimum output voltage to\ninsure comparator minimum supply level) to enable the selfsupplied operation. Moreover, the pull-down resistors would\nproduce additional losses during the active drive of the μrectifier.\nThis problem has been solved by the addition of an\nautonomous electronic start-up circuit presented figure 5.\nDuring the output voltage shortage, this circuit controls\ndirectly the power switches instead of the comparators. The\nstrategy of this control is based on the synchronous\nrectification technique. In fact, the input AC voltages are\ndirectly used to drive the MOS power switches (through\ntransistors M3 and M4 on figure 5). Once the output rectified\nvoltage reaches 1 V after a few μs, the active control by\ncomparators is initiated and the synchronous start-up circuit is\nthen automatically disconnected so as not to interfere with the\nactive drive. Transistors M3 and M4 must be switched on at\nthe beginning of the start-up sequence when:\n- the phase-to-phase voltage U12 > VTH_P1 (0.7 V) > VTH_N2\n(0.5 V),\n- the rectified voltage (VDDA-GND) ≈ 0 V; all capacitors are\ndischarged,\n- the reference current is not established IREF = 0 A.\nAnd, they have to be switched OFF at the end of the start-up\nsequence when the supply voltage and the reference current\nare established; VDDA ≥ 1 V, IREF ≈ 2 μA.\nWith these conditions, the circuit presented on figure 6 can be\ndefined.\n\nFigure 5. Micro-rectifier start-up circuit topology.\nTransistors M3 and M4 are used to drive P1 and N2 as a\nsynchronous rectifier.\n\nISBN: 978-2-35500-000-3\n\n\fJ.-C. Crebier et al.\nHigh Efficiency 3-Phase CMOS R ectifier with Step up and....\n\nCourant\nPhase 1dans\ncurrent\nla phase 1\n\nVC0 ≈ 0V\n\nUs1-2\n\nΦC\n\nΦPHASE_2\n\nIREF\n\nCHARGE\n\nΦPHASE_1\n\nVGS_DECLANCH\nVGS_TH_M4\n≈ 0.5V\nInherent\ndiode\ndiode\nof M7\nintrinsèque\n\nCourant dans\nLoad current\nla charge\n\nde M7\n\nμ-rectifier off\n\nFigure 6. Simplified diagram of the start-up circuit\nNote that in this circuit, all transistors work in switching\nmode (except M7 and M8). At first and as long as U12 ≥ 1V,\ntransistors M4, M3, P1 and N2 are switched ON if:\n\nΦ C − Φ PHASE _ 2 > VTH _ M 4 ≈ 0.5V\nWhere ΦC is the electric potential on the floating terminal of\ncapacitor C1. Note that this potential is always between\nΦPHASE_MAX > ΦC > ΦPHASE_MIN because of very small but\npermanent current leakage.\nSince P1 and N2 are ON, VDDA starts to rise up to:\n\nSingle phase start-up\n\nSelf powering and 3-phase rectification ensured\n\nFigure 7. Start-up simulation for an output capacitor of 1 μF.\n\nTo overcome this difficulty, a \"gndc\" terminal has been added\nat the output of the μ-rectifier, and the output capacitor has\nbeen connected between this terminal and VDDA (Figure 8).\nDuring start-up, before the 3-phase active control command is\nactivated, the \"gndc\" terminal is set to high-impedance in\norder to disconnect the output capacitor from the μ-rectifier.\nAs soon as the 3-phase μ-rectifier works correctly, the gndc\nterminal is progressively connected to the GND terminal\nallowing the smooth charge of the output capacitor making\nuse of the full source power (Figure 9).\n\nVDDA = U12 – VDS_ON_P1 – VDS_ON_N2\nNevertheless, VC1 remains unchanged and transistor N7\nstays OFF until reference current -and thus the μ-rectifier\ncommands- are established.\nThe start-up circuit maintains the output terminals of the μrectifier connected to U12. Once the current reference is\nestablished, C1 starts to charge through M7 until VC1=VDDA\nand ΦC = GND. When ΦC reaches GND, M4 and M3 are\ndefinitively switched OFF, thus ending the starting sequence\nso as to not interfere with the active drive.\n\nFigure 8. μ-rectifier bloc diagram. After the start-up\nsequence, the gndc terminal is progressively connected to\ngnd!.\n= VDDA\n\n= VC1\n\nPhase current\n\nCourant\nd'une phase\n\nThe automatic start-up process and circuits are detailed in\n[10]. Note that, in steady-state operation, the active control\nperformed by comparators is much more efficient than the\nsynchronous one especially in 3-phase structures with\nsinusoidal inputs.\n\nCourant dans\nla charge\n\n3.1.2. Starting with heavy load.\n\nNevertheless, when the μ-rectifier is loaded, the start-up\ncircuit may not be sufficient since only a small part of the μgenerator power is converted at the output of the rectifier\n(only the U12 positive half-wave is rectified). In this case, if\nthe load connected below the rectifier is too large or if the\nfilter capacitance is too heavy, this limited power may not be\nenough to establish a sufficient supply voltage for the active\ncontrol command (Figure 7).\n\n©EDA Publishing/DTIP 2007\n\nFonctionnement sans\n\nChargement\n\nC1 connecté\n\nFonctionnement sans\n\nChargement\n\nC1 connecté\n\nFigure 9. Start-up simulation for an output capacitor of 1 μF\nprogressively connected via the gndc terminal.\n\nThe μ-rectifier start-up has been achieved using the\nsimultaneous action of these two circuits. For light loads\nconnected to the μ-rectifier, the start-up sequence lasts one\nhalf of the positive half-wave of U12 phase-to-phase voltage\napplied to the input. Moreover, simulations carried out with\nCadence have shown that our μ-rectifier can start with input\nvoltage U12MAX as low as 1 V.\n\nISBN: 978-2-35500-000-3\n\n\fJ.-C. Crebier et al.\nHigh Efficiency 3-Phase CMOS R ectifier with Step up and....\n\n3.2. Converter secondary stage: the step-up.\n\nThe secondary stage must increase the μ-rectifier output\nvoltage (1-3.3 V) up to 5 V. Therefore, it is necessary to\ndispose of a structure allowing: a) an important input voltage\nexcursion swing and b) an important and adjustable outputto-input voltage ratio while having a high efficiency. These\ntwo characteristics do not match with those of charge pumps\nbecause charge pumps a) are generally designed for one\nspecific voltage ratio, and b) offer high efficiency only if this\nratio is observed. To perform the step-up stage, a boost\nconverter was therefore chosen, and has been realised using\nthe self-powered commercial circuit MAX1676. This\ncomponent integrates the two active components (power\nMOS and power diode) built in MOS technology. According\nto the datasheet, this circuit can operate from 0.8 V input\nvoltage, and output voltage can be adjusted from 2 to 5.5 V\n(5 V in our application). Static consumption of the circuit is\nas low as 16 μA and efficiency can reach 94% for a 200 mA\noutput current. Only two additional components are needed:\na power inductor and an output capacitor. The switching\nfrequency is 500 kHz.\n\nFigure 11. Layout of the integrated μ-rectifier (2.9 mm2)\n\nThe inductor and capacitor were determined according to the\ndatasheet, and figure 10 shows the diagram of the realised\nboost converter (L = 22 μH, C = 47 μF).\nFigure 12. Rectifier die in SOIC-16 testing package\nVDDA\n\nVDDA\n\ngndc\ngnd!\n\nV1\n\nI3\n\nstart-up\n\nFigure 10. Boost converter based on MAX1676.\n\nFigure 13. Measured waveforms during the automatic startup sequence\nμ-rectifier efficiency vs. electrical load\nCout = 15μF, f = 50kHz\n\n4. TEST OF AC-DC INTEGRATED μ-CONVERTER.\n1\n0,9\n0,8\n0,7\nefficiencyt\n\nThe μ-rectifier chip was designed and simulated with\nCadence using the AMS design kit [11] (Figure 11). The\nfabrication was processed by the AMS foundry via the CMP\nsociety [12]. The chip (Figure 12) was tested coupled to a\nmagnetic micro-generator producing a 3-phase electrical\noutput at 50 kHz. The magnitude of the generated line-toline voltage varied from 1 to 3.3 V and the DC resistive load\nfrom 24 to 200 Ω. Under these typical operating conditions,\nthe first electrical trials of the rectifier chip demonstrated its\nfull functionality (including automatic start-up – Figure 13)\nand a conversion efficiency as high as 90 % (Figure 14).\n\nI1\n\nactive control\n\n0,6\n0,5\n\n200 ohm\n\n0,4\n\n100 ohm\n\n0,3\n\n51 ohm\n\n0,2\n\n24 ohm\n\n0,1\n0\n1\n\n1,5\n\n2\n2,5\nrectified voltage [V]\n\n3\n\n3,5\n\nFigure 14. Measured μ-rectifier efficiency (the μ-rectifier is\nsupplied by the 3-phase magnetic μ-generator)\n\n©EDA Publishing/DTIP 2007\n\nISBN: 978-2-35500-000-3\n\n\fJ.-C. Crebier et al.\nHigh Efficiency 3-Phase CMOS R ectifier with Step up and....\n\nThis μ-rectifier has been cascaded with the boost converter\npresented above, to obtain a μ-converter which delivers a\nregulated output voltage of 5 V (Figure 15).\nIntegrated μ-rectifier\n\nBoost Inductor\n\nMAX 1676\n\n6. REFERENCES:\n\nDC link capacitor\nFigure 15. Front and side views of the cascaded AC-DC μconverter\n\nFirst tests indicate that the μ-converter is fully functional\n(Figure 16): it starts automatically, even for phase-to-phase\ninput voltages as low as 1 V, and for large output loads.\nPower measurements show that the μ-converter efficiency is\nabout 80 % (Figure 17), which is a good and demonstrating\nresult for a low-voltage, low-power μ-converter.\n\nFigure 16. Measurements on the 3-phase AC/DC μconverter. Vout = 5 V, Pout = 25 mW.\n\nefficiency\n\nμ-converter efficiency versus output power\nand rectified voltage\n1\n0,9\n0,8\n0,7\n0,6\n0,5\n\n5 mW\n\n0,4\n0,3\n0,2\n0,1\n0\n\n25 mW\n50 mW\n\n1\n\nloads have been underlined. Practical implementation with a\nreal 3-phase micro-generator is presented in order to validate\nthe work and the designs that have been carried out. The\nglobal efficiency of the two stages ranks around 70 to 82 %.\nConsidering the application characteristics and a dual-stage\ntopology these results are correct. The next steps are now\ndirected towards the reduction of passive devices and the\nincrease in efficiency, as we try to integrate all necessary\nfunctionalities and elements into a single-stage topology.\n\n1,5\n\n2\n\n2,5\n\n3\n\n3,5\n\nRectified voltage Vdda [V]\n\n.\n[1] A. S. Holmes, G. Hong, and K. R. Buffard, \"Axial-flux\npermanent magnet machines for micropower generation,\"\nJ. Microelectromech. Syst., vol. 14, no. 1, pp. 54–62,\n2005\n[2] H. Jianyun, H. Yan, M. Hao, \"High Efficient Rectifier\nCircuit Eliminating Threshold Voltage Drop for RFID\nTransponders\", in Proc: 6th International Conference On\nASIC Proceedings, Shangai, 2005, vol. 2, pp. 607-610\n[3] H. Raisigel, O. Cugat and J. Delamare, \"Permanent\nmagnet planar micro-generators\", Sensors and Actuators\nA: Physical, vol. 130–131, pp. 438–444, 2006.\n[4] http://www.maxim-ic.com/\n[5] www.linear.com\n[6] M. Brunet, P. Dubreuil, E. Scheid, J-L. Sanchez,\n\"Development of fabrication techniques for high-density\nintegrated MIM capacitors in power conversion\nequipment\", SPIE MOEMS-MEMS Symposium Photonics\nWest, Jan 2006.\n[7] S-C. Ó. Mathúna, T. O'Donnell, N. Wang, K. Rinne\n\"Magnetics on Silicon: An Enabling Technology for\nPower Supply on Chip\" IEEE Transactions On Power\nElectronics, VOL. 20, N° 3, May 2005\n[8] V. Kursun, S.G. Narendra, V. K. De, E.G. Friedman,\n\"Low-Voltage-Swing Monolithic DC-DC Conversion\"\nIEEE Transaction on Circuits and Systems-II: Express\nBriefs, Vol. 51, N° 5, May 2004\n[9] H. Raisigel, J.-C. Crebier, Y. Lembeye, J. Delamare, O.\nCugat, \"Autonomous, Low-Voltage, High Efficiency,\nCMOS Rectifier for Three-Phase Micro-Generators\",\nIEEE Transducers'07, Lyon, France, June 10-14, 2007\n[10] H. Raisigel, \"Micro–générateur magnétique planaire et\nmicro-convertisseur intégré\", Ph.D. Thesis, INP\nGrenoble, France, Dec 2006\n[11] http://asic.austriamicrosystems.com/\n[12] http://cmp.imag.fr/\n\nFigure 17. Measured full AC-DC + DC/DC μ-converter\nefficiency versus VDDA for various loads.\n5. CONCLUSION\n\nThe paper has presented several power electronics\ntopologies able to rectify and to regulate the electrical power\nprovided by a low-voltage, low-power 3-phase microsource. Based on design issues and performance levels but\nalso for realistic first approach, a dual-stage structure has\nbeen selected. Specific design issues for stand alone\noperation, start-up sequence and/or under heavy capacitive\n\n©EDA Publishing/DTIP 2007\n\nISBN: 978-2-35500-000-3\n\n\f"}