{"id": "http://arxiv.org/abs/1110.1748v1", "guidislink": true, "updated": "2011-10-08T16:32:28Z", "updated_parsed": [2011, 10, 8, 16, 32, 28, 5, 281, 0], "published": "2011-10-08T16:32:28Z", "published_parsed": [2011, 10, 8, 16, 32, 28, 5, 281, 0], "title": "Microscopic Composition of Ion-Ion Interaction Potentials", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.0175%2C1110.0586%2C1110.6865%2C1110.2618%2C1110.4764%2C1110.2137%2C1110.3800%2C1110.2865%2C1110.3574%2C1110.2019%2C1110.4953%2C1110.6795%2C1110.2672%2C1110.3456%2C1110.5636%2C1110.6451%2C1110.1567%2C1110.0515%2C1110.3391%2C1110.2268%2C1110.2466%2C1110.2985%2C1110.3275%2C1110.0338%2C1110.2187%2C1110.1960%2C1110.1521%2C1110.5407%2C1110.5323%2C1110.1223%2C1110.4045%2C1110.3027%2C1110.3570%2C1110.0133%2C1110.1077%2C1110.3192%2C1110.3686%2C1110.4104%2C1110.4935%2C1110.1669%2C1110.3335%2C1110.5996%2C1110.3902%2C1110.2917%2C1110.0662%2C1110.3269%2C1110.2211%2C1110.3437%2C1110.6026%2C1110.0420%2C1110.1941%2C1110.5860%2C1110.2544%2C1110.3450%2C1110.5577%2C1110.5209%2C1110.1552%2C1110.1124%2C1110.0109%2C1110.5271%2C1110.0718%2C1110.4562%2C1110.0562%2C1110.5691%2C1110.4881%2C1110.5419%2C1110.4831%2C1110.6522%2C1110.1410%2C1110.2928%2C1110.3834%2C1110.1647%2C1110.1646%2C1110.2255%2C1110.4198%2C1110.5563%2C1110.4335%2C1110.0256%2C1110.1665%2C1110.2180%2C1110.3690%2C1110.3937%2C1110.6892%2C1110.0304%2C1110.4988%2C1110.1033%2C1110.2382%2C1110.6696%2C1110.4275%2C1110.4624%2C1110.6815%2C1110.5102%2C1110.3402%2C1110.3135%2C1110.2585%2C1110.1748%2C1110.3852%2C1110.2056%2C1110.6334%2C1110.0466%2C1110.5035&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Microscopic Composition of Ion-Ion Interaction Potentials"}, "summary": "We present a new method to calculate the total ion-ion interaction potential\nin terms of building blocks which we refer to as \"single-particle interaction\npotentials\". This allows also to compose the separate contributions from\nneutrons and protons to the interaction potentials. The method is applied to\nnuclear collisions via the use of time-dependent Hartree-Fock theory.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1110.0175%2C1110.0586%2C1110.6865%2C1110.2618%2C1110.4764%2C1110.2137%2C1110.3800%2C1110.2865%2C1110.3574%2C1110.2019%2C1110.4953%2C1110.6795%2C1110.2672%2C1110.3456%2C1110.5636%2C1110.6451%2C1110.1567%2C1110.0515%2C1110.3391%2C1110.2268%2C1110.2466%2C1110.2985%2C1110.3275%2C1110.0338%2C1110.2187%2C1110.1960%2C1110.1521%2C1110.5407%2C1110.5323%2C1110.1223%2C1110.4045%2C1110.3027%2C1110.3570%2C1110.0133%2C1110.1077%2C1110.3192%2C1110.3686%2C1110.4104%2C1110.4935%2C1110.1669%2C1110.3335%2C1110.5996%2C1110.3902%2C1110.2917%2C1110.0662%2C1110.3269%2C1110.2211%2C1110.3437%2C1110.6026%2C1110.0420%2C1110.1941%2C1110.5860%2C1110.2544%2C1110.3450%2C1110.5577%2C1110.5209%2C1110.1552%2C1110.1124%2C1110.0109%2C1110.5271%2C1110.0718%2C1110.4562%2C1110.0562%2C1110.5691%2C1110.4881%2C1110.5419%2C1110.4831%2C1110.6522%2C1110.1410%2C1110.2928%2C1110.3834%2C1110.1647%2C1110.1646%2C1110.2255%2C1110.4198%2C1110.5563%2C1110.4335%2C1110.0256%2C1110.1665%2C1110.2180%2C1110.3690%2C1110.3937%2C1110.6892%2C1110.0304%2C1110.4988%2C1110.1033%2C1110.2382%2C1110.6696%2C1110.4275%2C1110.4624%2C1110.6815%2C1110.5102%2C1110.3402%2C1110.3135%2C1110.2585%2C1110.1748%2C1110.3852%2C1110.2056%2C1110.6334%2C1110.0466%2C1110.5035&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present a new method to calculate the total ion-ion interaction potential\nin terms of building blocks which we refer to as \"single-particle interaction\npotentials\". This allows also to compose the separate contributions from\nneutrons and protons to the interaction potentials. The method is applied to\nnuclear collisions via the use of time-dependent Hartree-Fock theory."}, "authors": ["A. S. Umar", "V. E. Oberacker", "J. A. Maruhn", "P. -G. Reinhard"], "author_detail": {"name": "P. -G. Reinhard"}, "author": "P. -G. Reinhard", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevC.85.017602", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1110.1748v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1110.1748v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 5 figures", "arxiv_primary_category": {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.atm-clus", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.chem-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1110.1748v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1110.1748v1", "journal_reference": "Phys. Rev. C 85, 017602 (2012)", "doi": "10.1103/PhysRevC.85.017602", "fulltext": "Microscopic Composition of Ion-Ion Interaction Potentials\nA.S. Umar,1 V.E. Oberacker,1 J.A. Maruhn,2 and P.-G. Reinhard3\n1\n\nDepartment of Physics and Astronomy, Vanderbilt University, Nashville, Tennessee 37235, USA\n2\nInstitut für Theoretische Physik, Goethe-Universität, D-60438 Frankfurt am Main, Germany\n3\nInstitut für Theoretische Physik, Universität Erlangen, D-91054 Erlangen, Germany\n(Dated: July 4, 2018)\n\nWe present a new method to calculate the total ion-ion interaction potential in terms of building\nblocks which we refer to as \"single-particle interaction potentials\". This allows also to compose\nthe separate contributions from neutrons and protons to the interaction potentials. The method is\napplied to nuclear collisions via the use of time-dependent Hartree-Fock theory.\n\narXiv:1110.1748v1 [nucl-th] 8 Oct 2011\n\nPACS numbers: 21.60.-n,21.60.Jz,25.60.Pj,25.70.-z\n\nThe knowledge of interaction potentials between composite many-body systems is of fundamental importance\nfor predicting the outcome of reactions involving such\nentities. These are often modeled using empirical functions that depend on macroscopic variables, such as the\ndistance between the two centers, treating the composite\nobjects as structureless particles and ignoring the microscopic origins of these potentials (e.g., Lennard-Jones\npotential for rare-gas atoms [1], nucleon-nucleon potentials [2]). On the other hand, microscopic approaches\ntry to obtain such potentials by including the interactions of the constituents as the building-blocks and calculating the whole potential as a function of some set of\nmacroscopic variables (e.g., Born-Oppenheimer approximation for molecules [3], deformed shell models for nuclei [4]). However, the total potential obtained this way\ndoes not reveal the contribution coming from individual\nsingle-particle states. Quoting Schrödinger, best knowledge of a whole does not necessarily include best possible\nknowledge of the parts. The entanglement of these contributions may yield further insight as to the interaction\nof many-body systems via a representative potential.\nMost common microscopic approaches for calculating\ninteraction potentials usually employ the adiabatic or\nsudden approximations for the relative motion of the interacting systems [5]. Recently, we have introduced a\nnew microscopic approach for the calculation of ion-ion\npotentials for nuclear collisions. This method is based\non the time-dependent Hartree-Fock (TDHF) description of nuclear collisions coupled [6] with a constraint\non the local density at the given instant of time. Interaction potentials obtained using the so-called density\nconstrained TDHF (DC-TDHF) method [7] have been\nsuccessful in describing fusion cross-sections for a number of systems [8]. The new approach we will describe\nbelow is generally suitable for microscopic calculations\nprovided Koopmans' theorem [9] is applicable.\nThe microscopic approaches based on the mean-field\napproximation often use the energy difference between\nthe combined system and the asymptotic energies of the\nindividual systems to calculate the ion-ion interaction potential as\n(0)\n\n(0)\n\nV (R) = EA1 +A2 (R) − EA1 − EA1 ,\n\n(1)\n\nwhere EA1 +A2 (R) is the total energy obtained for the\ncombined system as a function of the distance R be(0)\ntween the two ions, and EAi are the individual binding energies of the two systems calculated using the\nsame interaction. The binding energies are often calculated either Rby integrating the energy density over\nall space E = d3 r H(r) or via Koopmans' expression\nP\nE = 21 α wα (tα +ǫα ) , where wα denotes the occupation\nprobability of the single-particle state α. This mixture of\nhalf kinetic energies tα and half single-particle energies\nǫα applies to Hartree-Fock calculations employing purely\ntwo-body forces. For mean-field calculations based on\ndensity-dependent effective forces [10] or energy-density\nfunctionals [11] a rearrangement term needs to be added\nto the above expression [12]. This can be disentangled to\nsingle-particle energies and rearrangement term as\n\u0012\n\u0013\nδv\n1\n1X\nwα (tα + ǫα ) − T r < HF | |HF > ρ ,\nE=\n2 α\n2\nδρ\n(2)\nwhere v is the density-dependent part of the interaction.\nWe can deduce a generalized single-particle sum from\nthat by decomposing the second ρ in the rearrangement\nP\nterm into single-particle densities as ρ = α ρα . This\nyields\n1X\nE=\nwα (tα + ǫα + ǫ̃α ) ,\n(3)\n2 α\nwhere ǫ̃α is the single-particle rearrangement energy arising from the above modification. All of the binding energies comprising the ion-ion interaction potential via\nEq. (1) can be expressed using the above form. In terms\nof these expressions the ion-ion interaction potential can\nbe represented as a sum over single-particle interaction\npotentials as\nX\nV (R) =\nwα vα (R) ,\n(4)\nα\n\nwith\nvα (R) =\n\n\u0003\n1\u0002\n(tα + ǫα + ǫ̃α )(R) − (t0α + ǫ0α + ǫ̃0α ) ,\n2\n\n(5)\n\nwhere the quantities with a superscript (0) denote the\nasymptotic values. This decomposition is sensible if the\n\n\f2\n\n12\n8\n\npoint Coulomb\nproton\n\n1−\n2\n\n6\n\n16\n\n\n\n16\n\nO+ O\n\n4\n2\n\n1+\n2\n\n\np1/2, p1/2\n\n0\n3+\n2\n\n5\n0\n\n\n\np3/2, p3/2\np3/2, p3/2\n\n1+\n\n2\n\n-5\n-10\n\n1−\n2\n\n\n3−\n2\n\n\n\n5\n\ntotal\n\n4\n\nV (MeV)\n\n8\n\nvα∈n (MeV)\n\nsingle particle energies are good representatives of the\ncorresponding separation energies according to Koopmans' theorem [9] and if the rearrangement corrections\nremain small. Such a situation is given in the application\nexample discussed below, namely nuclear mean field calculations using Skyrme forces. In that case, the proton\nand neutron interaction potentials are obtained simply\nby summing the single-particle potentials vα (R) over all\nprotons, or neutrons respectively. For electronic energydensity functionals one has to employ a self-interaction\ncorrection to restore Koopmans' theorem approximately\n[13, 14].\n\n1−\n\n2\n\ns1/2\ns1/2\n\n0\n0\n\n-5\n-4\n\n-10\n-8\n-12\n-16\n4\n\n1+\n2\n\nRB\n\n\n\nneutron\n\n6\n\n8\n\n10\nR (fm)\n\n16\n\n16\n\n-15\n4\n\n8\n\n6\n\nO+ O\n\n12\n\n14\n\nFIG. 1. (color online) Interaction potential for a head-on\ncollision of 16 O+16 O at Ec.m. = 12 MeV. The black curve\nis the total ion-ion interaction potential. The red and blue\ncurves show the contribution to the total potential coming\nfrom protons and neutrons, respectively. Also shown is the\npoint Coulomb potential.\n\nFor the application of the above concepts we have used\nthe DC-TDHF approach [7]. In this approach TDHF\ntime-evolution takes place with no restrictions. At certain times during the evolution the instantaneous densities ρp/n (r, t) are used to perform a static Hartree-Fock\nminimization while holding the neutron and proton densities constrained to be this instantaneous TDHF densities [15]. In essence, this introduces the concept of an\nadiabatic reference state for a given TDHF state. The\ndifference between these two energies represents the internal energy. The adiabatic reference state is the one\nobtained via the density constraint calculation, which is\nthe Slater determinant with lowest energy for the given\ndensity with vanishing current and approximates the collective potential energy after the subtraction of the static\nbinding energies as shown in Eq. (1). All of the dynamical features included in TDHF are naturally included in\nthe DC-TDHF calculations.\n\n10\nR (fm)\n\n12\n\n14\n\nFIG. 2. (color online) Contribution of neutron single-particles\nto the interaction potential for a head-on collision of 16 O+16 O\nat Ec.m. = 12 MeV. The sum of all these potentials give the\nneutron curve in Fig. 1. The arrow marked RB indicates the\nbarrier top of the total potential shown in Fig. 1.\n\nIn practice, we have used the Skyrme SLy4 effective\nnuclear interaction [16] for our calculations. The rearrangement terms described above can be written as;\n(C)\n(DC)\nǫ̃α = ǫ̃(3)\n,\nα + ǫ̃α + ǫ̃α\n\n(6)\n\nwith\n\n(C)\nǫ̃α\n\nǫ̃(DC)\nα\n\np\nt3\n12\n\nZ\n\nh\nx3\nd3 r ρα ρp−1 (1 + )ρ2\n2\n\u0015\n1\n− ( + x3 )(ρ2n + ρ2p )\n2\n\u0012 \u0013 13 Z\n1\n1 3\ne2 d3 r ρα ρp3 , α ∈ {protons}\n=−\n2 π\nZ\n1\n=−\nd3 r ρα λn,p (r) ,\n2\n\nǫ̃(3)\nα =−\n\nwhere we have defined ρα = ψα∗ (r)ψα (r), and λ(r) is the\ncoordinate dependent Lagrange multiplier for the density\nconstraint [15]. The subscripts n, p in the rearrangement\nterm for the density constraint indicates the choice corresponding to the isospin content of the index α. The\n\n\f3\n\n10\n\n12\n\n1−\n2\n\n8\n\n16\n\n\n\n16\n\nO+ O\n\n6\n2\n\nvα∈p (MeV)\n\n3+\n2\n\n\np3/2, p3/2\n\n1+\n2\n\n\n0\n-4\n-8\n8\n4\n\n3−\n2\n\ntotal\n\n0\np1/2, p1/2\n\n0\n8\n4\n\nproton\n\n4\n1+\n\n2\n\np3/2, p3/2\n1−\n\n2\n\nV (MeV)\n\n4\n\npoint Coulomb\n\n8\n\n-4\n-8\n-16\n-20\n16\n\n1−\n\n2\n\ns1/2, s1/2\n\n24\n\nO+ O\n\n-24\n-28\n4\n\n\n\nneutron\n\n-12\n\n6\n\n8\n\n10\nR (fm)\n\n12\n\n14\n\nFIG. 4. (color online) Interaction potential for a head-on\ncollision of the 16 O+24 O at Ec.m. = 12 MeV.\n\n0\n-4\n-8\n-12\n4\n\n1+\n\n2\n\nRB\n\n6\n\n8\n\n10\nR (fm)\n\n12\n\n14\n\nFIG. 3. (color online) Same as Figure 2, but for protons.\n\nsummation over α exactly reproduces the total rearrangement energies obtained by direct integration.\nThe first collision studied is 16 O+16 O at Ec.m. =\n12 MeV. In Fig. 1 we show the total interaction potential\n(black curve) as well as the contributions coming from\nneutrons and protons to this total potential. The total interaction potential is numerically identical to the\none obtained in standard DC-TDHF calculations using\nthe integral of the energy density to obtain the terms in\nEq. (1). As a reference we also show the point Coulomb\ninteraction. As can be seen from the figure the outer\npart of the potential barrier is primarily determined by\nthe interaction potential between the protons of the two\nnuclei while the neutron potential is essentially zero. In\nother words the neutron-proton interaction does not influence the outer barrier region. While inside the barrier\nneutrons provide all of the attraction and the proton potential remains positive for all R values.\nIn Fig. 2 we show the individual neutron single-particle\npotentials for the 16 O+16 O system. In spite of using\nthree-dimensional Cartesian coordinates, we are able to\ncalculate some quantum numbers when the solution possesses a good symmetry. In this case spherical initial\n16\nO nuclei allow the use of spherical quantum labels at\nthe asymptotic position of the two nuclei. On the other\n\nhand, when the nuclei overlap the system becomes approximately axially symmetric thus allowing the computation of parity and the z-component of total angular\nmomentum. The reassignment of parities and the behavior of the states as they evolve towards smaller R\nvalues is noteworthy. For smallest R values the filling of\nthe levels resembles the one for a single-centered 32 particle system. The trend seen in the actual single-particle\nenergies is relatively easy to understand; the two oxygen\nnuclei are initially far apart and are brought together.\nWhile they are far apart and isolated the nuclei have\nidentical energy levels. However, as the separation between the two nuclei becomes smaller the single-particle\nstates begin to overlap. The Pauli principle dictates that\nno two nucleons in an interacting system may have the\nsame quantum state. Therefore, each (doubled) energy\nlevel of the isolated nuclei splits into two orbitals, one\nlower in energy than the original level and one higher.\nThis can be most easily seen for the two initial 1s1/2\nstates. However, in addition to energy splitting the parity of one of these states also changes from positive to\nnegative since no more than two neutrons can be in the\n1s1/2 state (each state is originally occupied by two neutrons, wα = 2). In the language of molecular physics the\nstates that attain a lower energy than their asymptotic\nvalue are referred to as the bonding states, whereas the\nstates that evolve to a higher energy are the anti-bonding\nstates [3]. We observe that not all neutron states are\nbonding states but to the contrary about half are actually anti-bonding in character for small R values. One\nof the p3/2 states (green curve) make a transition from\nanti-bonding to bonding for smaller R values. Another\nmanifestation of the bonding and anti-bonding states is\ntheir spatial localization. Bonding states are localized in\nthe interior part of the combined system as opposed to\n\n\f4\nanti-bonding states that are more spread out, as can been\nseen from the single-particle moments. Figure 3 shows\nthe contribution of proton single-particle states to the total ion-ion potential. The trend of the proton states are\nessentially the same as the neutron states with the exception of the rise from the zero potential line (dotted lines)\ndue to the presence of the Coulomb interaction. The\nsum of all these proton single-particle potentials reproduces the point Coulomb potential for the two incoming\nnuclei as can been observed in Fig. 1. We have also performed calculations for head-on collisions of 16 O+24 O at\nEc.m. = 12 MeV, and for 40 Ca+40 Ca at Ec.m. = 55 MeV.\nIn Fig. 4 we show the neutron and proton potentials for\nthe 16 O+24 O system. We note that in comparison to the\n\nO+16 O system the potential minimum is considerably\n\nlower due to the presence of eight extra neutrons. The\nsurplus bending from the extra neutrons also affect the\nproton potential, bringing it down to negative values for\nsmall R. We also note that the neutron potential starts\nits dip to negative values at larger R values than the\n16\nO+16 O case thus bringing the total barrier maximum\nto a lower value. Figure 5 shows the same quantities for\nthe 40 Ca+40 Ca system. The behavior of the proton potential is significantly different in this case. Inside the\nbarrier the proton potential is essentially constant and it\nonly rises as the minimum value of R is reached. This\nis probably due to the stronger Coulomb potential which\ncounter-weights the nuclear binding. While the neutron\nand total potentials appear intuitively as expected, the\nproton potential behaves in an unexpected manner. This\nis further evidence that the total potential may be masking some interesting features of its building blocks.\nWe have introduced a general approach for the calculation of single-particle interaction potentials as the\nbuilding blocks of the total interaction potential for two\nfragments of finite fermion systems. The formulation is\ngeneral provided the Koopmans' theorem is applicable\nto the underlying energy functional used for the manybody calculations. The formalism is applied to calculate\nion-ion potentials for nuclear reactions using TDHF for\nthe time-evolution of the nuclear collision together with\nthe density constraint formalism to find the corresponding adiabatic reference state. We show the contribution\nof single-particle potentials to the total potential for the\n16\nO+16 O case. We identify repulsive and attractive contributions as bonding and anti-bonding states. Perhaps\nthe more obvious aspect is the identification of neutron\nand proton contributions to the total potential where we\nsee clearly the subtle interplay between Coulomb repulsion and nuclear attraction for the protons while neutrons\nare always the dominant contributors to binding.\nThis work has been supported by the U.S. Department\nof Energy under grant No. DE-FG02-96ER40963 with\nVanderbilt University, and by the German BMBF under\ncontract Nos. 06FY9086 and 06ER142D.\n\n[1] Neil W. Ashcroft and N. David Mermin, Solid State\nPhysics, (Holt, Rinehart and Winston ,1976).\n[2] R. Machleidt and I. Slaus, J. Phys. G 27, R69 (2001).\n[3] M. Weissbluth, Atoms and Molecules, (Academic Press,\n1978).\n[4] M. Brack, J. Damgård, A. S. Jensen, H. C. Pauli, V. M.\nStrutinsky, and C. Y. Wong, Rev. Mod. Phys. 44, 320\n(1972).\n[5] A. Faessler, M. Ismail, N. Ohtsuka, M. Rashdan, and W.\nWadia, Z. Phys. A 326, 501 (1987).\n[6] J. W. Negele, Rev. Mod. Phys. 54, 913 (1982).\n[7] A. S. Umar and V. E. Oberacker, Phys. Rev. C 74,\n021601(R) (2006).\n[8] A. S. Umar and V. E. Oberacker, Eur. Phys. J. A 39,\n243 (2009).\n[9] T. Koopmans, Physica (Amsterdam) 1,104 (1933).\n\n[10] M. Bender, P.-H. Heenen, and P.-G. Reinhard, Rev. Mod.\nPhys. 75, 121 (2003).\n[11] R. M. Dreizler and E. K. U. Gross, Density Functional\nTheory: An Approach to the Quantum Many-Body Problem, (Springer-Verlag, Berlin, 1990).\n[12] P. Ring and P. Schuck, The Nuclear Many-Body Problem,\n(Springer-Verlag, NY, 1980).\n[13] J. P. Perdew and A. Zunger, Phys. Rev. B 23, 5048\n(1981).\n[14] J. Messud, P. M. Dinh, P.-G. Reinhard, and E. Suraud,\nPhys. Rev. Lett. 101, 096404 (2008).\n[15] R. Y. Cusson, P. -G. Reinhard, M. R. Strayer, J. A.\nMaruhn, and W. Greiner, Z. Phys. A 320, 475 (1985).\n[16] E. Chabanat, P. Bonche, P. Haensel, J. Meyer and R.\nSchaeffer, Nucl. Phys. A635, 231 (1998); A643, 441(E)\n(1998).\n\n60\n\npoint Coulomb\n\n50\n\nV (MeV)\n\n40\n\nproton\n\n30\n\ntotal\n\n20\n10\n0\n-10\n-20\n-30\n6\n\nneutron\n\n8\n\n10\n\n12\n14\nR (fm)\n\n40\n\n40\n\n16\n\n18\n\nCa + Ca\n\n20\n\nFIG. 5. (color online) Same as Figure 4 but for a head-on\ncollision of the 40 Ca+40 Ca at Ec.m. = 55 MeV.\n\n16\n\n\f"}