{"id": "http://arxiv.org/abs/0808.1280v1", "guidislink": true, "updated": "2008-08-08T19:53:02Z", "updated_parsed": [2008, 8, 8, 19, 53, 2, 4, 221, 0], "published": "2008-08-08T19:53:02Z", "published_parsed": [2008, 8, 8, 19, 53, 2, 4, 221, 0], "title": "Stability of Galactic Gaseous Disks and the Formation of Massive\n  Clusters", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0808.1660%2C0808.3660%2C0808.2142%2C0808.1042%2C0808.1957%2C0808.2978%2C0808.3554%2C0808.0196%2C0808.1916%2C0808.1915%2C0808.1072%2C0808.0872%2C0808.3285%2C0808.0408%2C0808.2062%2C0808.0617%2C0808.0333%2C0808.2162%2C0808.2100%2C0808.2445%2C0808.2170%2C0808.4109%2C0808.3307%2C0808.3466%2C0808.2584%2C0808.3480%2C0808.0063%2C0808.1359%2C0808.3721%2C0808.2221%2C0808.0630%2C0808.0308%2C0808.1008%2C0808.0014%2C0808.1843%2C0808.0331%2C0808.1647%2C0808.0396%2C0808.1280%2C0808.3556%2C0808.1776%2C0808.2180%2C0808.0935%2C0808.3142%2C0808.3136%2C0808.2792%2C0808.4000%2C0808.2476%2C0808.3621%2C0808.3113%2C0808.0888%2C0808.3089%2C0808.3121%2C0808.1432%2C0808.2539%2C0808.0240%2C0808.0967%2C0808.2089%2C0808.0587%2C0808.3165%2C0808.1027%2C0808.3125%2C0808.2082%2C0808.0537%2C0808.0151%2C0808.0576%2C0808.3993%2C0808.3316%2C0808.2146%2C0808.0468%2C0808.0914%2C0808.3764%2C0808.2918%2C0808.4058%2C0808.3883%2C0808.2904%2C0808.3689%2C0808.3880%2C0808.1026%2C0808.1683%2C0808.3194%2C0808.1799%2C0808.3757%2C0808.1717%2C0808.3913%2C0808.3097%2C0808.2145%2C0808.1690%2C0808.3123%2C0808.0297%2C0808.2021%2C0808.0514%2C0808.0145%2C0808.3258%2C0808.0315%2C0808.4100%2C0808.2953%2C0808.0661%2C0808.3131%2C0808.4142%2C0808.0177&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Stability of Galactic Gaseous Disks and the Formation of Massive\n  Clusters"}, "summary": "We study gravitational instabilities in disks, with special attention to the\nmost massive clumps that form because they are expected to be the progenitors\nof globular-type clusters. The maximum unstable mass is set by rotation and\ndepends only on the surface density and orbital frequency of the disk. We\npropose that the formation of massive clusters is related to this largest scale\nin galaxies not stabilized by rotation. Using data from the literature, we\npredict that globular-like clusters can form in nuclear starburst disks and\nprotogalactic disks but not in typical spiral galaxies, in agreement with\nobservations.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0808.1660%2C0808.3660%2C0808.2142%2C0808.1042%2C0808.1957%2C0808.2978%2C0808.3554%2C0808.0196%2C0808.1916%2C0808.1915%2C0808.1072%2C0808.0872%2C0808.3285%2C0808.0408%2C0808.2062%2C0808.0617%2C0808.0333%2C0808.2162%2C0808.2100%2C0808.2445%2C0808.2170%2C0808.4109%2C0808.3307%2C0808.3466%2C0808.2584%2C0808.3480%2C0808.0063%2C0808.1359%2C0808.3721%2C0808.2221%2C0808.0630%2C0808.0308%2C0808.1008%2C0808.0014%2C0808.1843%2C0808.0331%2C0808.1647%2C0808.0396%2C0808.1280%2C0808.3556%2C0808.1776%2C0808.2180%2C0808.0935%2C0808.3142%2C0808.3136%2C0808.2792%2C0808.4000%2C0808.2476%2C0808.3621%2C0808.3113%2C0808.0888%2C0808.3089%2C0808.3121%2C0808.1432%2C0808.2539%2C0808.0240%2C0808.0967%2C0808.2089%2C0808.0587%2C0808.3165%2C0808.1027%2C0808.3125%2C0808.2082%2C0808.0537%2C0808.0151%2C0808.0576%2C0808.3993%2C0808.3316%2C0808.2146%2C0808.0468%2C0808.0914%2C0808.3764%2C0808.2918%2C0808.4058%2C0808.3883%2C0808.2904%2C0808.3689%2C0808.3880%2C0808.1026%2C0808.1683%2C0808.3194%2C0808.1799%2C0808.3757%2C0808.1717%2C0808.3913%2C0808.3097%2C0808.2145%2C0808.1690%2C0808.3123%2C0808.0297%2C0808.2021%2C0808.0514%2C0808.0145%2C0808.3258%2C0808.0315%2C0808.4100%2C0808.2953%2C0808.0661%2C0808.3131%2C0808.4142%2C0808.0177&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study gravitational instabilities in disks, with special attention to the\nmost massive clumps that form because they are expected to be the progenitors\nof globular-type clusters. The maximum unstable mass is set by rotation and\ndepends only on the surface density and orbital frequency of the disk. We\npropose that the formation of massive clusters is related to this largest scale\nin galaxies not stabilized by rotation. Using data from the literature, we\npredict that globular-like clusters can form in nuclear starburst disks and\nprotogalactic disks but not in typical spiral galaxies, in agreement with\nobservations."}, "authors": ["Andres Escala", "Richard B. Larson"], "author_detail": {"name": "Richard B. Larson"}, "author": "Richard B. Larson", "arxiv_comment": "Accepted for publication in ApJ Letters. Minor comments added due to\n  the referee's suggestion", "links": [{"href": "http://arxiv.org/abs/0808.1280v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0808.1280v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0808.1280v1", "affiliation": "Yale University", "arxiv_url": "http://arxiv.org/abs/0808.1280v1", "journal_reference": null, "doi": null, "fulltext": "Stability of Galactic Gas Disks and the Formation of Massive\nClusters.\n\narXiv:0808.1280v1 [astro-ph] 8 Aug 2008\n\nAndrés Escala\nKavli Institute for Particle Astrophysics and Cosmology\nStanford University Physics Department / SLAC, 2575 Sand Hill Rd. MS 29, Menlo Park, CA 94025,\nUSA.\n\nRichard B. Larson\nDepartment of Astronomy, Yale University, New Haven, CT 06520-8101, USA.\n\nABSTRACT\nWe study gravitational instabilities in disks, with special attention to the most massive clumps\nthat form because they are expected to be the progenitors of globular-type clusters. The maximum unstable mass is set by rotation and depends only on the surface density and orbital\nfrequency of the disk. We propose that the formation of massive clusters is related to this\nlargest scale in galaxies not stabilized by rotation. Using data from the literature, we predict\nthat globular-like clusters can form in nuclear starburst disks and protogalactic disks but not in\ntypical spiral galaxies, in agreement with observations.\nSubject headings: galaxies: disk instabilities - globular clusters: formation - star formation: general\n\n1.\n\nsive young clusters in merging galaxies (Ashman\n& Zepf 1998; Schweizer 1998). A modern theory\nof globular cluster formation should therefore address why globular cluster formation is common\nin some environments such as merging and highredshift galaxies but not in others such as the\npresent Milky Way.\nAnother question to be addressed is why some\nregions of galaxies are more favorable for the formation of massive clusters than others. For example, the inner part of the Milky Way galaxy\ncontains young clusters with masses up to several times 104 M⊙ , including some quite close to\nthe central black hole (Krabbe et al. 1995; Figer\n2008), that are an order of magnitude more massive than the typical open clusters found elsewhere\nin the galaxy.\nThe Giant Molecular Clouds (GMCs) in which\nopen clusters currently form in the outer Milky\nWay have masses of order 106 M⊙ , but they produce clusters with masses of only several times\n103 M⊙ . The formation of globular clusters with\n\nIntroduction\n\nThe study of instabilities in disks has a long history, following the seminal work of Toomre (1964),\nwith a considerable literature on many aspects of\nit. However, relatively little attention has been\ngiven to the most massive agglomerations that can\nform by the fragmentation of galactic gas disks.\nThese most massive agglomerations are of interest\nbecause they may be the precursors of the most\nmassive star clusters known, the globular clusters.\nGlobular clusters were until recently viewed\nas exclusively old objects, and cluster formation\nmodels were therefore based on ideas about early\nstages of galaxy formation. This view changed\nwith the realization that elliptical galaxies often\ncontain two populations of globular clusters that\nappear to have different origins, suggested to be\na 'primordial' population and a 'merger' population (Ashman & Zepf 1992). The existence of\na merger population was confirmed by the Hubble Space Telescope with the discovery of mas-\n\n1\n\n\fmasses of 105 − 106 M⊙ therefore requires either\nmuch more massive super-GMCs (Harris & Pudritz 1994) or a much higher star formation efficiency. In reality, a combination of these effects is\nprobably involved.\nSeveral scenarios have been proposed for the\nformation of massive super-GMCs, involving for\nexample a hot primordial plasma (Fall & Rees\n1985), collisions between normal GMCs (Harris &\nPudritz 1994), or confinement by high pressures\nin mergers (Ashman & Zepf 2001). Relatively little attention has been given to the possible role of\ndisks in the formation of globular clusters, with\nthe exception of Larson (1988, 1996), but this\npossibility now seems worth further investigation\ngiven the evidence for massive cluster formation\nin rotationally supported disks in merging galaxies (Ashman & Zepf 1998).\nIn this Letter we study the gravitational instability of galactic gas disks, with special attention\nto the most massive clumps that can form in them.\nWe also consider which galaxies or environments\nwill produce the largest unstable clumps and are\ntherefore most favorable for massive cluster formation. We start by reviewing the theory of instabilities in disks in §2, and continue with its application to the formation of globular-type clusters in\n§3. We discuss the most promising environments\nfor globular-cluster formation in §3.1, and in §4 we\nsummarize the main implications of our work.\n2.\n\ncase is a pressureless sheet with Cs = 0. Equation 1 then shows that only perturbations with\nλ < λrot = π 2 GΣ/Ω2 are unstable, so that rotation can only stabilize the sheet at large scales.\nThe existence of a maximum length scale not stabilized by rotation was first derived and discussed\nby Toomre (1964).\nClearly neither pressure nor rotation can by itself stabilize the sheet, and there is a range of unstable length scales limited on small scales by thermal pressure (at the Jeans length λJeans ) and on\nlarge scales by rotation (at the critical length set\nby rotation, λrot ). All intermediate length scales\nare unstable, and the most rapidly growing mode\nhas a wavelength 2 λJeans . Only a combination of\npressure and rotation can stabilize the sheet, and\nthis happens when the range of unstable wavelengths shrinks to zero; according to equation 1\nthis occurs when λJeans ≥ λrot /4, which is equivalent to Cs Ω/GΣ0 ≥ π/2, the classical Toomre\n(1964) criterion for the stability of a uniformly rotating disk.\nSuch stability analyses apply only to fluid disks\nthat are well described by a simple equation of\nstate (EOS), such as an isothermal or a polytropic EOS. Unfortunately, the real interstellar\nmedium in galaxies is highly complex and not\nwell described by a simple equation of state. The\ncomplex dynamics and thermodynamics of the\nreal interstellar medium produce large fluctuations\nand sharp transitions in its properties, as happens for example in molecular clouds, that change\nthe Jeans mass by orders of magnitude and are\nnot well described by a simple EOS. A medium\nwith complex structure and dynamics may therefore have no well-defined Jeans length, and there\nmay be no real lower limit on the sizes of the\nself-gravitating structures that can form until the\nmuch smaller thermal Jeans scale is reached in\nmolecular cloud cores. This thermal Jeans scale\nmay be the next smaller scale that has any clear\nphysical basis and where a relatively simple EOS\nmay again apply; stability analyses give length and\nmass scales in molecular cloud cores of around 0.1\npc and 1 M⊙ .\nThe maximum length scale set by rotation λrot\nis however still a meaningful quantity even when\nthe ISM is not well described by a simple EOS,\nbecause λrot depends only on the surface density\nand angular frequency of the disk and not on its\n\nGRAVITATIONAL INSTABILITY IN\nDISKS\n\nFor illustration we consider the simplest possible case: a uniformly rotating thin sheet or disk.\nLinear stability analysis of such a system yields\nthe dispersion relation for small perturbations in\nsurface density (Binney & Tremaine 1987)\nω 2 = 4Ω2 − 2πGΣ|k| + k 2 Cs2 ,\n(1)\nq\nwhere Cs = dP\ndΣ is the sound speed, Σ is the surface density, and Ω is the angular rotation speed.\nTo see the implications of equation 1, we first consider the limit of a non-rotating sheet with Ω = 0.\nIn this case the sheet is unstable (ω 2 < 0) for wavelengths λ = 2π/k larger than the Jeans length,\nλJeans = Cs2 /GΣ. Thus pressure can only stabilize the sheet at small scales. Another limiting\n\n2\n\n\f104 M⊙ at 20 kpc from the galactic center.\nIn the more general case of non-uniform rotation, equations 1 and 2 are easily generalized by\nreplacing 2Ω by the epicyclic frequency κ, which is\n2\n2\ngiven by κ2 (R) = R dΩ\ndR + 4Ω . Since the epicyclic\nfrequency κ varies only between Ω and 2Ω for centrally concentrated disks, we will continue to use Ω\nbecause it has a more simple and intuitive meaning. For a review of results of more general gravitational stability analyses see Larson (1985).\nThe effect of rotation on the properties of the\nmassive clumps that form in disks is illustrated\nby the simulations of nuclear gas disks by Escala\n(2007). These simulations study the evolution of a\ngas disk with a mass of 3 × 108 M⊙ and a diameter\nof 600 pc, varying only the constant rotation velocity of the disk and studying its effect on the disk's\nevolution. This was done by varying a fixed external potential in such a way that the disk is always\nrotationally supported, but with a range of rotation velocities. Here we compare the development\nof the instabilities in two disks with rotational velocities vrot of 110 and 321 km s−1 . Further details\nof the simulations are given by Escala (2007).\nFigure 1 illustrates a representative stage in the\nevolution of the two disks and shows the density\ndistribution in the disk midplane after 0.4 orbital\nperiods. The disk with a rotational velocity vrot\nof 110 km s−1 is shown in Figure 1a and the disk\nwith vrot = 321 km s−1 in Figure 1b. The plotted region in the x-y plane is 0.5 kpc on a side.\nBoth disks develop a complex clumpy structure,\nand the figures illustrate how rotation affects the\ngrowing instabilities. In the run with lower rotation (Fig. 1a) the clumps are denser and more\nnumerous, while in the more rapidly rotating disk\n(Fig. 1b) the clumps are less marked and filaments\nare more prominent, reflecting the disruption of\nsome clumps by rotation. This is an expected result since Figure 1b has a smaller Mclmax , so that\nrotation can here disrupt clumps that are able to\nsurvive in Figure 1a; this explains why the clumps\nare denser and more numerous in the run with less\nrotation.\nThe gas clumps in Figure 1a have typical\nmasses of several times 106 M⊙ , in rough agreement with the maximum clump mass of 1.5 ×\n107 M⊙ predicted by equation 2. For the disk\nwith higher rotation (Fig. 1b), the clumps have\n\nsmall-scale physics. If a disk has a well-defined average surface density, it should have a well-defined\nmaximum length scale for instabilities. This rotational maximum scale may then be the most relevant length scale for the large-scale dynamics of\na disk with complex small-scale physics. In the\nMilky Way, λrot is typically of the order of 1 kpc.\nAt intermediate scales between 0.1 pc and 1 kpc\nthere may not be any preferred scale, and it has\nbeen suggested by Larson (1979, 1981) and others (Ballesteros-Paredes et al. 2007 and references\ntherein) that the structure and dynamics of the\nISM on these intermediate scales may be roughly\nself-similar and described by power laws, as in a\nturbulent cascade.\nSince the maximum unstable length scale set by\nrotation is the only clearly meaningful length scale\nfor a gas disk with complex physics, we focus on\nthe characteristic mass associated with this scale.\nThe resulting maximum unstable mass, calculated\nas Mclmax = Σgas (λrot /2)2 , is\nMclmax =\n\nπ 4 G2 Σ3gas\n.\n4Ω4\n\n(2)\n\nFor typical parameters in the Milky Way disk,\nequation 2 gives a maximum unstable mass of the\norder of a few times 106 M⊙ , similar to the scale\nof giant cloud complexes in our Galaxy. Equation\n2 gives a mass scale similar to that derived previously by many authors (Balbus 1988; Elmegreen\n1994, 2002; Kim & Ostriker 2001) on the assumption that it is the Jeans mass MJeans =\nΣgas (λJeans /2)2 that determines the masses of giant cloud complexes, where the Jeans mass is\ncalculated assuming that on large enough scales\nthe ISM can be modeled as an isothermal fluid\nin which random cloud motions take the place of\nthermal motions. This mass scale is again about\n106 − 107 M⊙ , and it is similar to the rotational\nmaximum mass because the analysis assumes that\ndisks are marginally stable (Q ∼ 1), implying that\nthe Jeans scale and the rotational scale are similar.\nA significant radial variation is implied by 2,\nsince both Σgas and Ω are functions of radius\nin galactic disks. For disks with flat rotation\ncurves that have density profiles steeper than\nΣgas ∝ R−4/3 , the maximum clump mass decreases with radius. For example in the Milky\nWay, the maximum mass decreases with radius\nfrom about 106 M⊙ at the solar radius to 3 ×\n3\n\n\fsmaller typical masses of several times 105 M⊙ ,\nalso in agreement with the value of 4 × 105 M⊙\npredicted by equation 2. These values are valid\nfor the early evolution of the disk before much of\nits gas has been consumed by star formation. At\nlater times, as Σgas decreases, less massive clumps\nare formed.\n3.\n\nwith a mass of a few times 109 M⊙ and a gas fraction η of 1/5 (Downes & Solomon 1998), we predict the formation of clumps with masses up to\n108 M⊙ . The formation efficiency of massive clusters is very uncertain, but even with an efficiency\nof only 1% we predict the formation of clusters\nwith masses up to 106 M⊙ , characteristic of the\nmost massive globular clusters.\nIn normal disk galaxies like the Milky Way,\nthe total gas mass is similar but the gas fraction is only about 1/30 of the total mass. We\nthen predict clumps with masses of order a few\ntimes 106 M⊙ , as mentioned in §2, that are not\nmassive enough to form globular clusters. However, conditions for massive cluster formation become much more favorable in the protogalactic gas\ndisks that are expected to exist during the early\nstages of disk galaxy formation, where the gas is\nexpected to constitute 1/5 or more of the total\nmass (η ∼ 0.2). Such protogalactic disks, like for\nexample the clump cluster and chain galaxies observed at high redshift (Elmegreen & Elmegreen\n2005), would then also be very favorable sites for\nmassive cluster formation.\nThus we see from equation 4 that there are two\nfavorable environments for the formation of massive clusters: (1) nuclear gas disks in starburst\nsystems, and (2) protogalactic disks. This expectation agrees with the scenario for globular cluster formation proposed by Ashman & Zepf (1992),\nwhereby globular clusters form either in the early\nstages of galaxy formation or in galaxy mergers\nand interactions. This scenario has been successfully tested against several observed properties of\nglobular cluster systems, such as the typically bimodal age and metallicity distributions of globular clusters in elliptical galaxies and the presence\nof young globular clusters in merger remnants.\nMoreover it has been recently found that the oldest dwarf galaxies have the highest globular cluster\nfrequencies (Peng et al. 2008), which is expected\nsince systems that formed earlier would probably\nhave had higher gas fractions and therefore they\nwere more favorable sites for cluster formation.\n\nApplications: The largest proto-globular\nclusters\n\nThe condition for rotational support of a homogeneous uniformly rotating gas sheet against the\ngravity produced by the total mass enclosed within\nany radius R, Mtot = Mstar + MDM + Mgas , can\nbe written\nπGΣgas\n,\n(3)\nΩ2 =\nηR\nwhere η = Mgas /Mtot is the ratio of the gas mass\nto the total enclosed mass. For a uniformly rotating, rotationally supported gas sheet, the maximum clump mass predicted by equation 2 can be\nwritten\nπ 2 η 2 R2 Σgas\nMgas \u0010 η \u00112\nMclmax =\n.\n= 3 107 M⊙\n4\n109 M⊙ 0.2\n(4)\nEquation 4 shows that the formation of massive\nclusters requires not only a large gas content, as\nin the Milky Way, but also a large gas fraction\n(large η); the formation of massive clusters is thus\nstrongly favored in regions where the gas constitutes a large fraction of the mass.\nIn the local universe this condition is satisfied\nin ULIRGs, which are typically characterized by\nan ongoing burst of star formation. Recent observations have shown that massive clusters are\nin fact currently forming in these systems (Ashman & Zepf 1998). In these starburst systems,\nnot all of the star formation is confined to a single well-defined disk, especially during the early\nstages of a galaxy merger before it settles down\ninto an ordered flow, as in the Antennae system.\nHowever, the maximum mass derived above is due\nto a purely local effect and not dependent on largescale ordered motion. The mass scale is set by\nrotation via the local balance between centrifugal\nand self-gravitational forces, and it is not strongly\nsensitive to the geometry; equation 2 should therefore remain approximately valid within geometrical factors. For a typical nuclear starburst disk\n\n3.1.\n\nEnvironments for Massive Cluster\nFormation\n\nThe formulation presented in this Letter also allows us to predict which present environments are\nmost favorable for forming massive clusters, given\n4\n\n\fthe total gas mass and the gas fraction in galaxies, quantities that can easily be extracted from\nobservations of many systems. Figure 2 shows\nthe total gas mass of a sample of galaxies plotted\nagainst the gas fraction η = Mgas /Mtot , where the\nblack dots are nuclear starburst disks, the open\ncircles are spirals, and the triangles are dwarf irregular galaxies. The data for spiral galaxies are\nfrom Kent (1987), Giraud (1998), and Helfer et\nal. (2003). For dwarf irregular galaxies the data\nare from Côté et al. (2000), Van den Bosch et al.\n(2001), and for starburst galaxies they are from\nDownes and Solomon (1998). The parallel dotted\nlines show the maximum clump mass predicted by\nequation 4, with values varying from 104 M⊙ to\n108 M⊙ ; the solid line is for a maximum clump\nmass of 107 M⊙ .\nWe expect globular clusters to form in clumps\nwith masses above 107 M⊙ , so that galaxies above\nthe solid line in Figure 2 should be good candidates for massive cluster formation. If massive\nclusters form with an efficiency of 1% in GMCs\n(Lada & Lada 2003), this corresponds to cluster\nmasses of 105 M⊙ or more, comparable to globular cluster masses. Figure 2 shows that with one\nexception, only galaxies classified as nuclear starbursts lie on or above the 107 M⊙ line, in agreement with the fact that only starburst galaxies\nshow ongoing massive cluster formation. The one\nexception is the spiral galaxy NGC 2403, which\nhas many giant HII regions and is forming massive stellar clusters like starbursts (Drissen et al\n1999), in agreement with our prediction.\nFigure 2 also shows that dwarf irregular galaxies should not form massive clusters even though\nmost of their baryonic mass is in gas. This is because the more important quantity is the gas fraction, which is only between 1% and 10% in these\nsystems because they are dark-matter dominated.\nIn spiral galaxies, although the total amount of gas\nis comparable to that in starburst galaxies, the gas\nis more widely distributed and the gas fraction in\nthe star-forming region is therefore smaller, so we\ndo not expect massive cluster formation in most\nspirals, in agreement with observations.\nThe position of the Milky Way in Figure 2 is\ndenoted by MW and the position of the Large\nMagellanic Cloud is denoted by LMC. Both the\nMilky Way and the LMC are predicted to have\nmaximum clump masses of several times 106 M⊙ ,\n\nwhich for a cluster formation efficiency of 1% is\nconsistent with the fact that they are both currently forming clusters with masses up to several\ntimes 104 M⊙ (see Figer 2008 for the Milky Way\nand Larson 1988 for LMC). However, given the uncertainty in the cluster formation efficiency, what\nis more significant is the prediction that the Milky\nWay and the LMC should form clusters two orders\nof magnitude less massive than the most massive\nclusters that form in starbursts, as is observed.\n4.\n\nDISCUSSION\n\nIn this paper we have studied gravitational instabilities in disks, with special attention to the\nmost massive clumps that form because they are\nexpected to be the progenitors of globular-type\nclusters. The maximum unstable mass is set by rotation and depends only on the surface density and\norbital frequency of the disk, unlike other mass\nscales such as the Jeans mass that depend on the\ncomplex gas physics. This mass scale is due to\na purely local instability and not dependent on\nlarge-scale ordered motion. The maximum unstable mass is therefore a well-defined quantity even\nif the interstellar medium is not well described by\na simple equation of state.\nThe maximum clump mass can be expressed in\nterms of the total gas mass and the gas fraction in\na galaxy, and this formulation makes it clear that\nenvironments with a high gas fraction are the most\npromising places to form massive clusters. Using\ndata from the literature, we predict that massive\nglobular-like clusters can form in nuclear starburst\ndisks and protogalactic disks but not in typical\nspiral galaxies, in agreement with observations.\nThe scenario proposed here relates massive\nclusters to the largest scale in galaxies not stabilized by rotation, which is the only scale intermediate between stars and galaxies that has\na clear physical basis. There is no well-defined\n'Jeans mass' on these intermediate scales, and\nthe next smaller scale that has any clear physical basis is the thermal Jeans scale in molecular\nclouds, which is related to the masses of individual\nstars. The next larger physical scale is that of the\ngalaxy itself, so we predict three physically wellmotivated scales corresponding to stars, massive\nstellar clusters, and galaxies.\nAnother application of studies of the stabil-\n\n5\n\n\fLarson, R.B. 1981, MNRAS, 194, 809\n\nity of nuclear gas disks, not discussed here, is\nto their likely role in feeding supermassive central black holes in galaxies (Escala 2007). This\nrequires the outward transfer of angular momentum, and if gravity is the most important force\ninvolved, the same mass concentrations that form\nmassive clusters may also play an important role\nin the outward transfer of angular momentum and\nthe growth of a central black hole. We plan to investigate this problem further in ongoing work.\n\nLarson, R.B. 1985, MNRAS, 214, 379\nLarson, R.B. 1988. Proceedings of the 126th IAU\nSymposium, Kluwer Academic Publishers.\nLarson, R.B. 1996. Formation of the Galactic\nHalo...Inside and Out, ASP Conference Series,\nVol. 92, 1996.\nPeng, E.W., Jordan, A.,\narXiv:astro-ph/08030330\n\nREFERENCES\n\nCote,\n\nP. 2008,\n\nSchweizer, F. 1998. Galaxies: Interactions and Induced Star Formation, ed. R. C. Kennicutt et\nal., Springer: Berlin.\n\nAshman, K.M., Zepf, S.E. 1992, ApJ, 394, 50\nAshman, K.M., Zepf, S.E. 1998, Globular Cluster Systems. Cambridge University Press, Cambridge\n\nToomre, A. 1964, ApJ, 139, 1217\nVan den Bosch, F.C. 2001, MNRAS, 326, 1205\n\nAshman, K.M., Zepf, S.E. 2001, AJ, 122, 1888\nBalbus, S. A. 1988, ApJ, 324, 60\nBallesteros-Paredes, J., et al. 2007. Protostars and\nPlanets V, University of Arizona Press, Tucson.\nBinney, J., Tremaine, S. 1987, Galactic Dynamics.\nPrinceton University Press, Princeton\nCôté, S., et al. 2000, AJ, 120, 3027\nDownes, D., Solomon, P. M. 1998, ApJ, 507, 615\nDrissen, L., et al. 1999, AJ, 117, 1249\nElmegreen, B. G. 1994, ApJ, 433, 39\nElmegreen, B. G. 2002, ApJ, 577, 206\nEscala, A. 2007, ApJ, 671, 1264\nFall, S. M., & Rees, M. J. 1985, ApJ, 298, 18\nFiger, D. F. 2008 arXiv:astro-ph/08014178\nGiraud, E. 1998, AJ, 116, 1125\nHarris, W., Pudritz, R. 1994, ApJ, 429, 177\nHelfer, T.T., et al. 2003, ApJS, 145, 259\nKent, S.M. 1987, AJ, 93, 816\nKim, W.-T., Ostriker, E.C. 2001, ApJ, 559, 70\nKrabbe, A., et al. 1995, ApJ, 447L, 95\n\nThis 2-column preprint was prepared with the AAS LATEX\nmacros v5.2.\n\nLada, C.J., Lada, L.A. 2003, ARA&A, 41, 57\n6\n\n\fFig. 1.- a) Density distribution in the plane of the gas disk, in units of 1.19 ×10−21 g cm−3 and coded on a\nlogarithmic scale, at time t = 0.4 torb for the disk with rotational velocity of 110 km s−1 . The plotted region\nin the x-y plane is 0.5 kpc × 0.5 kpc. The figure shows a complicated multiphase structure, characterized\nby high density clumps that are embedded in a less dense medium. b) Same as in a) for the disk with\nrotational velocity of 321 km s−1 . The figure also shows a complicated multiphase structure as in a), but\nnow characterized by filaments that are embedded in a less dense medium\n\n7\n\n\fMW\nLMC\n\n0.01\n\n0.1\n\nFig. 2.- Total gas mass in a galaxy plotted against the gas fraction Mgas /Mtot . The black dots are\nnuclear starburst disks, open circles are spirals and triangles are dwarf irregulars. The parallel dotted lines\nindicate predicted clump masses from equation 4 of 104 M⊙ , 105 M⊙ , 106 M⊙ and 108 M⊙ . The solid line\nis for 107 M⊙ . MW denotes the position of the Milky Way in the plot, and LMC the position of the Large\nMagellanic Cloud.\n\n8\n\n\f"}