{"id": "http://arxiv.org/abs/1205.3100v1", "guidislink": true, "updated": "2012-05-14T17:05:34Z", "updated_parsed": [2012, 5, 14, 17, 5, 34, 0, 135, 0], "published": "2012-05-14T17:05:34Z", "published_parsed": [2012, 5, 14, 17, 5, 34, 0, 135, 0], "title": "SUSY and a 125 GeV Scalar", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1205.2310%2C1205.1187%2C1205.1795%2C1205.3493%2C1205.0356%2C1205.3977%2C1205.4001%2C1205.2902%2C1205.2510%2C1205.0187%2C1205.2051%2C1205.1388%2C1205.4118%2C1205.1455%2C1205.1762%2C1205.4006%2C1205.2375%2C1205.1399%2C1205.3759%2C1205.3361%2C1205.2175%2C1205.1626%2C1205.0568%2C1205.0386%2C1205.3796%2C1205.2356%2C1205.0495%2C1205.4287%2C1205.4492%2C1205.3701%2C1205.2407%2C1205.0903%2C1205.0716%2C1205.2507%2C1205.3120%2C1205.3969%2C1205.0943%2C1205.0914%2C1205.1567%2C1205.1791%2C1205.2467%2C1205.1656%2C1205.1846%2C1205.0294%2C1205.2625%2C1205.2216%2C1205.2738%2C1205.4391%2C1205.4313%2C1205.2903%2C1205.2463%2C1205.3029%2C1205.2992%2C1205.3100%2C1205.2544%2C1205.2108%2C1205.4055%2C1205.2106%2C1205.1797%2C1205.1635%2C1205.2929%2C1205.3344%2C1205.1269%2C1205.1697%2C1205.0538%2C1205.3234%2C1205.3823%2C1205.2669%2C1205.3442%2C1205.2442%2C1205.0595%2C1205.0803%2C1205.0462%2C1205.3380%2C1205.3835%2C1205.0142%2C1205.2827%2C1205.0340%2C1205.0381%2C1205.1177%2C1205.3075%2C1205.4329%2C1205.1334%2C1205.0698%2C1205.0821%2C1205.1229%2C1205.0980%2C1205.3254%2C1205.2518%2C1205.3411%2C1205.0897%2C1205.4444%2C1205.0580%2C1205.2390%2C1205.2487%2C1205.1273%2C1205.1282%2C1205.3109%2C1205.4155%2C1205.0236%2C1205.3068&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "SUSY and a 125 GeV Scalar"}, "summary": "An excess of events at a mass of ~ 125 GeV has been reported by both ATLAS\nand CMS collaborations using 5/fb of data. If this excess of events is\nconfirmed by further searches with more data, it will have extremely important\nconsequences in the context of supersymmetric extensions of the Standard Model.\nWe show that for a Standard Model like Higgs boson with a mass 122.5 < Mh <\n127.5 GeV, several unconstrained or constrained MSSM scenarios would be\nexcluded, while the parameters of some other scenarios would be severely\nrestricted.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1205.2310%2C1205.1187%2C1205.1795%2C1205.3493%2C1205.0356%2C1205.3977%2C1205.4001%2C1205.2902%2C1205.2510%2C1205.0187%2C1205.2051%2C1205.1388%2C1205.4118%2C1205.1455%2C1205.1762%2C1205.4006%2C1205.2375%2C1205.1399%2C1205.3759%2C1205.3361%2C1205.2175%2C1205.1626%2C1205.0568%2C1205.0386%2C1205.3796%2C1205.2356%2C1205.0495%2C1205.4287%2C1205.4492%2C1205.3701%2C1205.2407%2C1205.0903%2C1205.0716%2C1205.2507%2C1205.3120%2C1205.3969%2C1205.0943%2C1205.0914%2C1205.1567%2C1205.1791%2C1205.2467%2C1205.1656%2C1205.1846%2C1205.0294%2C1205.2625%2C1205.2216%2C1205.2738%2C1205.4391%2C1205.4313%2C1205.2903%2C1205.2463%2C1205.3029%2C1205.2992%2C1205.3100%2C1205.2544%2C1205.2108%2C1205.4055%2C1205.2106%2C1205.1797%2C1205.1635%2C1205.2929%2C1205.3344%2C1205.1269%2C1205.1697%2C1205.0538%2C1205.3234%2C1205.3823%2C1205.2669%2C1205.3442%2C1205.2442%2C1205.0595%2C1205.0803%2C1205.0462%2C1205.3380%2C1205.3835%2C1205.0142%2C1205.2827%2C1205.0340%2C1205.0381%2C1205.1177%2C1205.3075%2C1205.4329%2C1205.1334%2C1205.0698%2C1205.0821%2C1205.1229%2C1205.0980%2C1205.3254%2C1205.2518%2C1205.3411%2C1205.0897%2C1205.4444%2C1205.0580%2C1205.2390%2C1205.2487%2C1205.1273%2C1205.1282%2C1205.3109%2C1205.4155%2C1205.0236%2C1205.3068&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "An excess of events at a mass of ~ 125 GeV has been reported by both ATLAS\nand CMS collaborations using 5/fb of data. If this excess of events is\nconfirmed by further searches with more data, it will have extremely important\nconsequences in the context of supersymmetric extensions of the Standard Model.\nWe show that for a Standard Model like Higgs boson with a mass 122.5 < Mh <\n127.5 GeV, several unconstrained or constrained MSSM scenarios would be\nexcluded, while the parameters of some other scenarios would be severely\nrestricted."}, "authors": ["F. Mahmoudi"], "author_detail": {"name": "F. Mahmoudi"}, "author": "F. Mahmoudi", "arxiv_comment": "6 pages, 6 figures. Contribution to Moriond EW 2012 proceedings", "links": [{"href": "http://arxiv.org/abs/1205.3100v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1205.3100v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1205.3100v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1205.3100v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:1205.3100v1 [hep-ph] 14 May 2012\n\nCERN-PH-TH/2012-121\n\nSUSY and a 125 GeV Scalar\nF. Mahmoudi\nCERN Theory Division, Physics Department, CH-1211 Geneva 23, Switzerland\nClermont Université, Université Blaise Pascal, CNRS/IN2P3,\nLPC, BP 10448, 63000 Clermont-Ferrand, France\nAn excess of events at a mass of ∼ 125 GeV has been reported by both ATLAS and CMS\ncollaborations using 5 fb−1 of data. If this excess of events is confirmed by further searches with\nmore data, it will have extremely important consequences in the context of supersymmetric\nextensions of the Standard Model. We show that for a Standard Model like Higgs boson with\na mass 122.5 < Mh < 127.5 GeV, several unconstrained or constrained MSSM scenarios would\nbe excluded, while the parameters of some other scenarios would be severely restricted.\n\n1\n\nIntroduction\n\nThe search for supersymmetry (SUSY) constitutes the main focus of new physics searches at\nthe LHC. With no signal detected so far, these searches have imposed strong limits mainly in\nthe constrained SUSY scenarios. However a lot of solutions compatible with all present limits\nstill remain 1,2 , and even if the bounds are becoming stronger, it is not possible to validate or\nfalsify supersymmetry as a viable extension of the Standard Model (SM). An alternative path to\ntightly constrain and test the MSSM at the LHC is through the Higgs sector. Searches for the\nHiggs boson have now narrowed down the possible window for an SM–like Higgs to only a few\nGeV around 125 GeV, where an excess over background in several channels has been observed\n3,4 . If this excess is confirmed, it will have extremely important consequences for the MSSM,\nand we highlight here some of the main outcomes. This write-up is based on 5,6,7 where more\ndetails about the analyses can be found.\n2\n\nHiggs mass predictions\n\nIn the SM, the Higgs boson mass is basically a free parameter. In the MSSM however the lightest\nHiggs mass is bounded from above:\nMhmax ≈ MZ | cos 2β| + radiative corrections . 110 − 135 GeV .\n\n(1)\n\nImposing Mh places therefore very strong constraints on the MSSM parameters through their\ncontributions to the radiative corrections. The most sensitive parameters to the Higgs mass\n√\nare tan β, the CP–odd Higgs mass MA , the SUSY breaking parameter MS = mt̃1 mt̃2 and the\nmixing parameter in the stop sector, Xt = At − μ/ tan β. In the decoupling regime, the Higgs\nmass can be approximated by:\n\u0014\n\u0012\n\u0013\u0015\nMS2\nXt2\n3m4t\nXt2\n2 MA \u001dMZ\n2\n2\nMh\n≈\nMZ cos 2β + 2 2 log 2 + 2 1 −\n.\n(2)\n2π v\nmt\nMS\n12MS2\n\n\fFigure 1: The maximal Mh defined as the value for which 99% of the scan points have a mass smaller than it,\nshown as a function of tan β for various constrained MSSM models.\n\nmodel\nMhmax\n\nAMSB\n121.0\n\nGMSB\n121.5\n\nmSUGRA\n128.0\n\nno-scale\n123.0\n\nCNMSSM\n123.5\n\nVCMSSM\n124.5\n\nNUHM\n128.5\n\nTable 1: Maximal Mh value (in GeV) in various constrained MSSM scenarios.\n\nThe maximal Higgs mass can therefore be reached in the decoupling regime with large MA ,\nfor large\n√ values of tan β (& 10), for heavy stops (large MS ) and for the stop mixing parameter\nXt = 6MS corresponding to the so–called maximal mixing scenario.\n3\n\nImplications for MSSM\n\nWe first consider the implications of a Higgs boson mass determination for the constrained\nMSSM scenarios. For this purpose, we perform extensive scans in the parameter spaces of several constrained MSSM scenarios and generate the spectra using Suspect 8 . Since the various\nparameters which enter the radiative corrections to the MSSM Higgs sector are not all independent, it is not possible to freely tune the relevant weak–scale parameters to obtain a given value\nof Mh . In particular, a Higgs mass of around 125 GeV can have drastic consequences on the\nconstrained MSSM scenarios as can be seen from Fig. 1 where we restricted MS to be below 3\nTeV in order to have an \"acceptable\" finetuning. Table 1 gives the maximal Higgs mass reached\nin different constrained MSSM scenarios. Only scenarios such as mSUGRA and NUHM can\nprovide a sufficiently large mass for the Higgs. On the other hand, scenarios such as AMSB and\nGMSB are disfavoured in their minimal versions as the term At /MS is rather small and we are\nalmost in the no–mixing regime. However, by relaxing the condition on MS , larger values for\nMh could also become possible in these scenarios (at the cost of increasing the finetuning) as\ncan be seen in Fig. 2. The definition of the different models and more detailed discussions can\nbe found in 5 .\nNext we study the consequences for the phenomenological MSSM (pMSSM) 9 , where no\nuniversal boundary condition is assumed. The pMSSM with CP and R-parity conservation\ninvolves 19 free parameters. To study the pMSSM, we perform flat scans over the parameters\nas described in 5 . In Fig. 3 we show the light Higgs mass as a function of Xt /MS . As can be\nseen from the figure, scenarios\n√ with large Xt /MS values and, in particular, those close to the\nmaximal mixing At /MS ≈ 6 are favoured by the Higgs mass constraints. On the other hand,\n\n\fFigure 2: The maximal Mh in function of MS in mAMSB and mGMSB. For comparison the results in mSUGRA\nare also given.\n\nFigure 3: Light Higgs mass Mh as a function of Xt /MS in the pMSSM (left) and the contours for 123 < Mh <\n127 GeV in the (Mt̃1 , Xt ) plane for some selected ranges of tan β values (right).\n\nthe no–mixing scenario (Xt ≈ 0) is strongly disfavoured for MS . 3 TeV, and the typical mixing\nscenario needs large MS and moderate to large tan β values.\nThe requirement of having the lightest Higgs in the range 123 < Mh < 127 GeV does not\nnecessarily correspond to very heavy stop masses. Indeed, stops as light as 350 GeV can be\npossible in the pMSSM as can be seen from the right hand side of Fig. 3.\nIt is possible to further constrain the parameter space by combining the information from\ndirect Higgs and SUSY searches with those from flavour physics and dark matter. We calculate\nthe flavour constraints, dark matter relic density and muon (g − 2) using SuperIso Relic 10 ,\nthe SUSY spectra using Softsusy 11 , the Higgs decay rates using HDECAY 12 . To assess the\nobservability of each of the pMSSM scan points we generate events with PYTHIA 13 which are\npassed through fast detector simulation using Delphes 14 . More details about the scans and the\nemployed tools can be found in 1,6 .\nFig. 4 shows the fraction of pMSSM points which pass all the constraints and are compatible\nwith the direct SUSY searches by CMS with 1 fb−1 of data 15 and the projection for 15 fb−1\nas a function of the masses of the lightest squarks of the first two generations q̃1,2 and tan β\n1,6 . As can be seen from the plots 15 fb−1 of LHC data should provide a powerful constraint to\nMSSM solutions. In the right hand side of Fig. 4, we impose in addition constraints from the\ndiscovery of an SM–like Higgs at the LHC. A comparison between the right and left handed plots\nshows that the fraction of accepted points is strongly reduced, and values of tan β ≤ 6 become\ndisfavoured, while the shape of the mass distributions of squarks is not significantly affected.\n\n\fFigure 4: Fraction of accepted pMSSM points not excluded by the SUSY searches on 1 and 15 fb−1 of LHC data\nas a function of the mass of the lightest squark of the first two generations (upper left) and of tan β (lower left),\nand with the Higgs constraint in addition in the right hand side.\n\nIn Fig. 5 the points fulfilling the Higgs constraints are displayed in the plane (MA , tan β).\nWe observe that imposing the value of Mh selects a broad wedge at relatively large MA and\nmoderate to large values of tan β, extending beyond the projected sensitivity of the searches for\nthe A0 → τ + τ − decay but also that of direct DM detection and would be compatible with an SM–\nlike value for the rate of the Bs0 → μ+ μ− decay. Imposing in addition that the yields in the γγ,\nW + W − and Z 0 Z 0 final states satisfy the conditions 1≤ Rγγ <3 and 0.3< RW + W − /Z 0 Z 0 <2.5,\nthe wedge in the (MA , tan β) plane is further restricted, as can be seen from the right hand side\nof Fig. 5.\nFinally we highlight the consequences of the h0 mass limit for three benchmark scenarios,\nnamely the maximal, typical and no-mixing scenarios. The results in the plane (MA , tan β)\nare presented in Fig. 6, where for comparison we show also the LEP Higgs search limits 16 and\nthe CMS limits from A0 → τ + τ − searches with 4.6 fb−1 of data 17 . In addition, we apply\nflavour physics constraints from Bs → μ+ μ− , B → τ ν and b → sγ. As expected, the no-mixing\nscenario is excluded for MS = 1 TeV by the combination of LEP and CMS limits, and there\nis no solution for Mh in the accepted interval for MS = 2 TeV. The situation is similar for the\ntypical mixing scenario for MS = 1 TeV where no solution is found, whereas for MS = 2 TeV\na small corner survives at large tan β and large MA . On the other hand, as we have shown\nearlier, the maximal mixing scenario provides more solutions especially for MS = 1 TeV. For\nlarger MS only a narrow band remains at small tan β (around 5). Flavour physics constraints\nfurther exclude this region where MA . 160 GeV. The remaining allowed region in the (MA ,\ntan β) plane is therefore strongly narrowed down when one takes into account the constraints\nfrom Mh .\n4\n\nConclusions\n\nThe Higgs boson searches at the LHC, in conjunction with the flavour physics limits place highly\nconstraining bounds on the MSSM parameters. The impact is very strong in particular in the\n\n\fFigure 5: pMSSM points in the (MA , tan β) plane giving 123 < MH < 127 GeV. The different shades of blue\nshow the points in the pMSSM without cuts and those allowed by the 2011 data and by the projected 2012 data,\nassuming no signal beyond the lightest Higgs boson is observed. The lines represent the regions which include 90%\nof the scan points for the A → τ + τ − and Bs → μ+ μ− decays at the LHC and the dark matter direct detection\nat the XENON experiment.\n\nconstrained MSSM scenarios and several scenarios such as mAMSB and mGMSB are disfavoured\nas they lead to a too light h0 (for MS < 3 TeV). In the pMSSM on the other hand, strong restrictions can be set on the mixing in the top sector. In the (MA , tan β) plane we observe a favoured\nwedge corresponding to rather large values of the A0 mass and moderate to large values of tan β.\nFurther imposing the yields in the Higgs decay rates, the wedge becomes more pronounced and\nthe fraction of accepted points gets reduced preferentially at large sparticle masses. Focussing\nmore on specific benchmark scenarios we see that the no-mixing and typical mixing scenarios\nare severely restricted, while the maximal mixing scenario provides more solutions, and imposes\ncompetitive constraints with the CP-odd and charged Higgs searches on MA and tan β.\nAcknowledgements\nI would like to thank the organisers of the Moriond Electroweak meeting 2012 for their invitation,\nand A. Arbey, M. Battaglia and A. Djouadi for their collaboration.\nReferences\n1.\n2.\n3.\n4.\n5.\n6.\n7.\n8.\n9.\n10.\n11.\n12.\n13.\n\nA. Arbey, M. Battaglia and F. Mahmoudi, Eur. Phys. J. C 72, 1847 (2012).\nS. Sekmen, S. Kraml, J. Lykken et al., JHEP 1202, 075 (2012).\nG. Aad et al. [ATLAS Collaboration], Phys. Lett. B 710, 49 (2012).\nS. Chatrchyan et al. [CMS Collaboration], Phys. Lett. B 710, 26 (2012).\nA. Arbey, M. Battaglia, A. Djouadi, F. Mahmoudi and J. Quevillon, Phys. Lett. B 708,\n162 (2012).\nA. Arbey, M. Battaglia and F. Mahmoudi, Eur. Phys. J. C 72, 1906 (2012).\nA. Arbey, M. Battaglia, A. Djouadi and F. Mahmoudi, in preparation.\nA. Djouadi, J.L. Kneur and G. Moultaka, Comput. Phys. Commun. 176, 426 (2007).\nA. Djouadi and S. Rosiers–Lees et al., hep-ph/9901246; A. Djouadi, Phys. Rept. 459, 1\n(2008).\nF. Mahmoudi, Comput. Phys. Commun. 180, 1579 (2009); A. Arbey and F. Mahmoudi,\nComput. Phys. Commun. 181, 1277 (2010).\nB.C. Allanach, Comput. Phys. Commun. 143, 305 (2002).\nA. Djouadi, J. Kalinowski and M. Spira, Comput. Phys. Commun. 108, 56 (1998).\nT. Sjostrand, S. Mrenna, P. Z. Skands, JHEP 05, 026 (2006).\n\n\fFigure 6: Points in the (MA , tan β) plane for the maximal mixing (top), typical mixing (center) and no mixing\n(bottom) scenarios for MS = 1 TeV (left) and 2 TeV (right). The \"LEP limit\" zone correspond to exclusion by\nHiggs searches at LEP, whereas the \"CMS limit\" zone is excluded by the CMS searches for A0 → τ + τ − with\n4.6 fb−1 of data.\n\n14. S. Ovyn, X. Rouby, V. Lemaitre, arXiv:0903.2225 [hep-ph].\n15. S. Chatrchyan et al. [CMS Collaboration], Phys. Rev. Lett. 107, 221804 (2011).\n16. S. Schael et al. [ALEPH and DELPHI and L3 and OPAL and LEP Working Group for\nHiggs Boson Searches Collaborations], Eur. Phys. J. C 47, 547 (2006).\n17. S. Chatrchyan et al. [CMS Collaboration], arXiv:1202.4083 [hep-ex].\n\n\f"}