{"id": "http://arxiv.org/abs/1008.5333v2", "guidislink": true, "updated": "2010-10-06T07:57:31Z", "updated_parsed": [2010, 10, 6, 7, 57, 31, 2, 279, 0], "published": "2010-08-31T14:48:34Z", "published_parsed": [2010, 8, 31, 14, 48, 34, 1, 243, 0], "title": "Projective flatness in the quantisation of bosons and fermions", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1008.0299%2C1008.4840%2C1008.1199%2C1008.3699%2C1008.1334%2C1008.3267%2C1008.5076%2C1008.5088%2C1008.2138%2C1008.0388%2C1008.1025%2C1008.5081%2C1008.5322%2C1008.0164%2C1008.2717%2C1008.1988%2C1008.2609%2C1008.0598%2C1008.0214%2C1008.1136%2C1008.0400%2C1008.4295%2C1008.5099%2C1008.3226%2C1008.2833%2C1008.2878%2C1008.4789%2C1008.3384%2C1008.3048%2C1008.2402%2C1008.5150%2C1008.1476%2C1008.2732%2C1008.1098%2C1008.3276%2C1008.1828%2C1008.1685%2C1008.3309%2C1008.4945%2C1008.3124%2C1008.0667%2C1008.0387%2C1008.2527%2C1008.2004%2C1008.0446%2C1008.1276%2C1008.2662%2C1008.3299%2C1008.3030%2C1008.4283%2C1008.4687%2C1008.2028%2C1008.0276%2C1008.5333%2C1008.0438%2C1008.4833%2C1008.0260%2C1008.0437%2C1008.0267%2C1008.1893%2C1008.4501%2C1008.1134%2C1008.2939%2C1008.1579%2C1008.4817%2C1008.4234%2C1008.1951%2C1008.2469%2C1008.0547%2C1008.0776%2C1008.0987%2C1008.4294%2C1008.3190%2C1008.2196%2C1008.1691%2C1008.3266%2C1008.2880%2C1008.0121%2C1008.1820%2C1008.1578%2C1008.2081%2C1008.4186%2C1008.3473%2C1008.0760%2C1008.4876%2C1008.2622%2C1008.4373%2C1008.3049%2C1008.3008%2C1008.1512%2C1008.4419%2C1008.4228%2C1008.3814%2C1008.3404%2C1008.3864%2C1008.1704%2C1008.3652%2C1008.3327%2C1008.0986%2C1008.5184%2C1008.0406&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Projective flatness in the quantisation of bosons and fermions"}, "summary": "We compare the quantisation of linear systems of bosons and fermions. We\nrecall the appearance of projectively flat connection and results on parallel\ntransport in the quantisation of bosons. We then discuss pre-quantisation and\nquantisation of fermions using the calculus of fermionic variables. We then\ndefine a natural connection on the bundle of Hilbert spaces and show that it is\nprojectively flat. This identifies, up to a phase, equivalent spinor\nrepresentations constructed by various polarisations. We introduce the concept\nof metaplectic correction for fermions and show that the bundle of corrected\nHilbert spaces is naturally flat. We then show that the parallel transport in\nthe bundle of Hilbert spaces along a geodesic is the rescaled projection or the\nBogoliubov transformation provided that the geodesic lies within the complement\nof a cut locus. Finally, we study the bundle of Hilbert spaces when there is a\nsymmetry.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1008.0299%2C1008.4840%2C1008.1199%2C1008.3699%2C1008.1334%2C1008.3267%2C1008.5076%2C1008.5088%2C1008.2138%2C1008.0388%2C1008.1025%2C1008.5081%2C1008.5322%2C1008.0164%2C1008.2717%2C1008.1988%2C1008.2609%2C1008.0598%2C1008.0214%2C1008.1136%2C1008.0400%2C1008.4295%2C1008.5099%2C1008.3226%2C1008.2833%2C1008.2878%2C1008.4789%2C1008.3384%2C1008.3048%2C1008.2402%2C1008.5150%2C1008.1476%2C1008.2732%2C1008.1098%2C1008.3276%2C1008.1828%2C1008.1685%2C1008.3309%2C1008.4945%2C1008.3124%2C1008.0667%2C1008.0387%2C1008.2527%2C1008.2004%2C1008.0446%2C1008.1276%2C1008.2662%2C1008.3299%2C1008.3030%2C1008.4283%2C1008.4687%2C1008.2028%2C1008.0276%2C1008.5333%2C1008.0438%2C1008.4833%2C1008.0260%2C1008.0437%2C1008.0267%2C1008.1893%2C1008.4501%2C1008.1134%2C1008.2939%2C1008.1579%2C1008.4817%2C1008.4234%2C1008.1951%2C1008.2469%2C1008.0547%2C1008.0776%2C1008.0987%2C1008.4294%2C1008.3190%2C1008.2196%2C1008.1691%2C1008.3266%2C1008.2880%2C1008.0121%2C1008.1820%2C1008.1578%2C1008.2081%2C1008.4186%2C1008.3473%2C1008.0760%2C1008.4876%2C1008.2622%2C1008.4373%2C1008.3049%2C1008.3008%2C1008.1512%2C1008.4419%2C1008.4228%2C1008.3814%2C1008.3404%2C1008.3864%2C1008.1704%2C1008.3652%2C1008.3327%2C1008.0986%2C1008.5184%2C1008.0406&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We compare the quantisation of linear systems of bosons and fermions. We\nrecall the appearance of projectively flat connection and results on parallel\ntransport in the quantisation of bosons. We then discuss pre-quantisation and\nquantisation of fermions using the calculus of fermionic variables. We then\ndefine a natural connection on the bundle of Hilbert spaces and show that it is\nprojectively flat. This identifies, up to a phase, equivalent spinor\nrepresentations constructed by various polarisations. We introduce the concept\nof metaplectic correction for fermions and show that the bundle of corrected\nHilbert spaces is naturally flat. We then show that the parallel transport in\nthe bundle of Hilbert spaces along a geodesic is the rescaled projection or the\nBogoliubov transformation provided that the geodesic lies within the complement\nof a cut locus. Finally, we study the bundle of Hilbert spaces when there is a\nsymmetry."}, "authors": ["Siye Wu"], "author_detail": {"name": "Siye Wu"}, "author": "Siye Wu", "arxiv_comment": "20 pages, typo and other minor corrections made", "links": [{"href": "http://arxiv.org/abs/1008.5333v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1008.5333v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.SG", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.SG", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "53D50 (Primary), 32M15 (Secondary), 15A66, 58C50", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1008.5333v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1008.5333v2", "journal_reference": null, "doi": null, "fulltext": "arXiv:1008.5333[math.SG]\nHKU-IMR preprint IMR2010:#11\nAugust 2010 (revised: October 2010)\n\nProjective flatness in the quantisation of bosons and fermions\n\narXiv:1008.5333v2 [math.SG] 6 Oct 2010\n\nSiye Wu∗\n\nAbstract\nWe compare the quantisation of linear systems of bosons and fermions. We recall the appearance\nof projectively flat connection and results on parallel transport in the quantisation of bosons. We then\ndiscuss pre-quantisation and quantisation of fermions using the calculus of fermionic variables. We then\ndefine a natural connection on the bundle of Hilbert spaces and show that it is projectively flat. This\nidentifies, up to a phase, equivalent spinor representations constructed by various polarisations. We\nintroduce the concept of metaplectic correction for fermions and show that the bundle of corrected\nHilbert spaces is naturally flat. We then show that the parallel transport in the bundle of Hilbert spaces\nalong a geodesic is the rescaled projection or the Bogoliubov transformation provided that the geodesic\nlies within the complement of a cut locus. Finally, we study the bundle of Hilbert spaces when there is\na symmetry.\nKeywords: geometric quantisation, projectively flat bundles, Hermitian symmetric spaces\nMSC(2000): Primary 53D50; Secondary 32M15, 15A66, 58C50\n\n1\n\nIntroduction\n\nOne of the central questions in geometric quantisation is whether the quantum Hilbert spaces constructed\nfrom different choices of polarisations can be naturally identified. Since a quantum state actually corresponds\nto a ray of vectors, identification is only required for the projectivisation of the Hilbert spaces. This amounts\nto the existence of a natural projectively flat connection on the bundle of Hilbert spaces over the space of\npolarisations. When the symplectic manifold is Kähler, it is convenient to consider a subclass of polarisations\nthat come from complex structures compatible with the symplectic form. Given such a complex structure,\nthe quantum Hilbert space is the space of holomorphic sections of the pre-quantum line bundle. However,\nunder quite general conditions (satisfied by, for example, the 2-sphere), there is no naturally projectively flat\nconnection in the bundle of quantum Hilbert spaces [10].\nThe next best scenario is that projective flatness holds if we limit the polarisations to a smaller subset, for\nexample, to those respecting the symmetry of the system. For a symplectic vector space polarised by linear\ncomplex structures, there is indeed a natural projectively flat connection in the bundle of Hilbert spaces [1].\nMoreover, the connection is flat if we include metaplectic correction [29, 15]. Parallel transport in the bundle\nyields the familiar Fourier and Segal-Bargmann transforms that are usually used to identify wave functions\nin various pictures [15]. (The Segal-Bargmann transform can be generalised to relate polarisations on the\ncotangent bundles of compact Lie groups [11, 9].) Another example of projective flatness is from quantising\nthe space of flat connections on a compact orientable surface [13, 1]; in this case the complex structures are\ninduced by those on the surface.\nLet (V, ω) be a symplectic vector space and J, a compatible linear complex structure on V . The qunatum\nHilbert space is a representation of Heisenberg algebra, generated by tensor powers of V subject to the\ncanonical commutation relation. The existence of projective flatness is related to the celebrated Stonevon Neumann theorem [18], which asserts that the irreducible representation of the Heisenberg algebra is\nunique up to a unitary equivalence. Moreover, by Schur's lemma, any two unitary equivalences between two\nirreducible representations have to differ only by a phase. So between the fibres over two linear complex\n∗ Department\n\nof Mathematics, University of Hong Kong, Pokfulam Road, Hong Kong, China (current address)\nand Department of Mathematics, University of Colorado, Boulder, CO 80309-0395, USA\nEmail address: swu@maths.hku.hk\n\n1\n\n\fstructures in the bundle of Hilbert spaces, there is a unitary identification which is unique up to a phase.\nThis is the hallmark of projectively flat bundles.\nThe main purpose of this paper is to establish a similar structure of projective flatness in the quantisation\nof fermions. The phase space of a linear fermionic system is a Euclidean space (V, g) and quantisation means\nfinding an irreducible representation of the Clifford algebra, which is the fermionic analog of the Heisenberg\nalgebra. (See [16, 7] for formal similarities between the two algebras.) Such a representation is the spinor\nrepresentation, and just like the bosonic case, it is unique (when dim V is even) or nearly unique (when\ndim V is odd) [5]. In the construction of the spinor representation, one needs to choose a compatible complex\nstructure (see for example [3], §3.2), which is the fermionic counterpart of polarisation. We therefore expect\na projectively flat bundle (of spinor representations) over space of such complex structures.\nThe rest of the paper is organised as follows. In §2, we review the pre-quantisation and quantisation of\nbosonic systems whose phase spaces are symplectic vector spaces. We then recall the natural connection on\nthe bundle of Hilbert spaces and give a straightforward proof of its projective flatness [1]. The connection\nbecomes flat after metaplectic correction is included [29, 15]. We present, in a coordinate-free way, the\nresults in [15] on the parallel transport in the bundle of Hilbert spaces along geodesics in the base space.\nFinally, when there is a group acting symplectically on the vector space, we decompose the bundle of Hilbert\nspaces into a direct sum of projectively flat sub-bundles and identify the invariant part as the bundle from\nquantising the symplectic quotient. §3 is devoted to the quantisation of fermions when the phase space is\nan even-dimensional Euclidean space. We discuss the pre-quantisation and quantisation of fermions using\ncalculus of fermionic variables. We then define a natural connection on the bundle of Hilbert spaces and show\nthat it is projectively flat. This identifies, up to a phase, constructions of the spinor representation under\nvarious polarisations. We introduce the concept of metaplectic correction for fermions and show that the\nbundle of corrected Hilbert spaces is naturally flat. We then show that the parallel transport in the bundle\nof Hilbert spaces along a geodesic is the rescaled projection or the Bogoliubov transformation provided the\ngeodesic lies within the complement of a cut locus. The decomposition of the bundle of Hilbert spaces when\nthere is a symmetry is also studied. In §4, we conclude by highlighting the similarities and differences in the\nquantisation of bosons and fermions. In Appendix A, we consider the geometry of the spaces of complex\nstructures compatible to a symplectic or Euclidean structure, which are classical Hermitian symmetric spaces\n[21, 14]. We describe cut locus in the space of polarisations of a fermionic system. Appendix B is on the\ncalculus of fermionic variables. We describe fermionic coherent states and the fermionic analog of Bergman\nkernel. In Appendix C, we collect some facts on real and quaternionic representations and on complex\nstructures invariant under a representation.\n\n2\n2.1\n\nQuantisation of bosonic systems\nPre-quantisation and quantisation\n\nLet (V, ω) be a symplectic vector space of√\ndimension 2n. A pre-quantum line bundle l over V is a line bundle\nwith a connection whose curvature is ω/ −1 . The pre-quantum Hilbert space is H0 = L2 (V, l), the space\nof L2 -sections of l with respect to the symplectic volume form εω = ω ∧n /n! or ε̃ω = εω /(2π)n on V . The\ncovariant derivative ∇x along a constant vector field on V parallel\n√ to x ∈ V is a skew-self-adjoint operator on\nH0 and satisfies the commutation relation [∇x , ∇y ] = ω(x, y)/ −1 for any x, y ∈ V . As V is contractible,\nl is topologically trivial and is unique up to an isomorphism. We can choose a trivialisation of l identifying\nH0 with L2 (V, C) such that\n√\n∇x = Lx + 12 −1 ιx ω, x ∈ V.\nHere ιx ω ∈ V ∗ is regarded as a linear function on V multiplying on the sections of l or on L2 (V, C). For any\nα ∈ V ∗ , the corresponding pre-quantum operator acting on H0 is\n√\n√\nα̂ = −1 ∇ν −1 (α) + α = −1 Lν −1 (α) + 12 α.\n\nThese operators are self-adjoint on H0 and satisfy Heisenberg's canonical commutation relation [α̂, β̂] =\n√\n−1 ω −1 (α, β), where α, β ∈ V ∗ .\nConsider the space Jω of compatible complex structures on (V, ω). (We refer the reader to §A.1-2 for\nnotations and results on complex structures.) For each J ∈ Jω , the complex subspaces VJ1,0 , VJ0,1 of V C are\nLagrangian with respect to ω and they determine a (linear) complex polarisation of (V, ω). The quantum\nHilbert space associated to J is\nHJ = {ψ ∈ H0 | ∇x ψ = 0, ∀x ∈ VJ0,1 }.\n2\n\n\fSo a vector ψ ∈ HJ is a holomorphic L2 -section of l. The compatibility condition on J guarantees that the\nspace HJ is non-empty; in fact, it is infinite dimensional. Note that for any J ∈ Jω , HJ is a subspace of H0 .\nThus we have a bundle of quantum Hilbert spaces H → Jω whose fibre over J ∈ Jω is HJ .\nThe following results are well known.\nProposition 2.1 1. Any ψ ∈ HJ is of the form\n\n1\n\nψ = e− 4 qJ φ\nfor a unique J-holomorphic function φ on V , where qJ ∈ ω(*, J*) ∈ Sym2 (V ∗ ) is regarded as a quadratic\nfunction on V .\n1\n2. If φ is a J-holomorphic function on V , then ψ = e− 4 qJ φ is in HJ if and only if its norm\n\u00131/2\n\u0012Z\n2\n− 21 qJ\n|φ| ε̃ω\ne\nV\n\n− 12 qJ\n\nweighted by e\nis finite, in which case it is equal to the norm of ψ ∈ H0 .\n3. For any α ∈ V ∗ , α̂ preserves HJ and is self-adjoint on HJ . It acts on φ by\n√\nα̂ : φ 7→ −1 Lν −1 (α0,1 ) φ + α1,0 φ.\nIf xi (1 ≤ i ≤ n) are the complex coordinates on VJ1,0 with respect to a basis {ei }i=1,...,n , then the\ncovariant derivative along ēj̄ is ∇j̄ = ∂∂x̄j̄ + 21 qij̄ xi , where qij̄ = qJ (ei , ēj̄ ). A section ψ ∈ HJ can be\nidentified as a function of the form\nψ(x) = φ(x) exp[− 12 qij̄ xi x̄j̄ ],\nwhere φ(x) is a holomorphic function in x = (x1 , * * * , xn ) ∈ Cn .\n\n2.2\n\nProjectively flat connection and metaplectic correction\n\nThe vector bundle H → Jω of quantum Hilbert spaces is a sub-bundle of the product bundle Jω × H0 → Jω\nof pre-quantum Hilbert spaces. The trivial connection on the latter induces a natural connection on H by\northogonal projection. In [1], it was shown that the connection on H is projectively flat. For completeness\nand for comparison with the fermionic case (§3.2), we give a simple derivation of this result.\nWe first study the effect of the variation δJ on HJ . We choose a basis {ei }1≤i≤n of VJ1,0 . Suppose ψ ∈ HJ ,\ni.e., ∇k̄ ψ = 0 (1 ≤ k ≤ n). As J changes to J + δJ, the infinitesimal parallel transport ψ + δψ ∈ HJ+δJ\nof ψ ∈ HJ is the orthogonal projection of ψ on HJ+δJ . Thus we have two conditions: δψ ⊥ HJ , i.e.,\nδψ ⊥ ker ∇ī for 1 ≤ i ≤ n, and ψ + δψ ∈ HJ+δJ , or\n∇ēī +δēī (ψ + δψ) = 0,\nwhere δēī = (δ P̄ )ī j ej (see §A.2). This implies, to the first order, that δψ satisfies the equation\n∇ī (δψ) = −(δ P̄ )ī j ∇j ψ = (δP )ī j ∇j ψ.\nWe claim that\nδψ =\n\n1\n2\n\n√\n−1 ∇i (δP )ij ∇j ψ =\n\n1\n2\n\n√\n−1 (δP )ij ∇i ∇j ψ\n\nis the (unique) solution satisfying the above conditions. (The second equality holds because (δP )ij is a\nconstant tensor on V .) First, this δψ is orthogonal\nto HJ as ∇ī is the formal adjoint of ∇i . Second, as\n√\n∇ī ψ = 0, (δP )ij = (δP )ji and [∇ī , ∇j ] = ωīj / −1 , we get\n√\n√\n∇k̄ (δψ) = 21 −1 (δP )ij [∇k̄ , ∇i ∇j ]ψ = 12 −1 (δP )ij ([∇k̄ , ∇i ]∇j + ∇i [∇k̄ , ∇j ])ψ\n= ωk̄i (δP )ij ∇j ψ = (δP )k̄j ∇j ψ.\n\nThe uniqueness is clear from the geometric interpretation.\n√\nij\nThe connection 1-form AH on H satisfies (δ + AH )ψ = 0. Therefore AH = − −1\n2 (δP ) ∇i ∇j ; it is an\noperator-valued 1-form on Jω . We then calculate\nδ AH =\n=\n\n√\n1\n2\n\n−1\n2\n\n(δP )ij ∧ ∇δei ∇j =\n\nωk̄j (δP )ji ∧ (δP )ik̄ =\n3\n\n√\n1\n2\n\n−1\n2\n\n(δP )ij ∧ (δP )ik̄ ∇k̄ ∇j\n\ntr(P δP ∧ δP P ),\n\n\fignoring the terms that vanish on HJ , and\nAH ∧ AH = − 14 ∇i ∇j ∇k ∇l (δP )ij ∧ (δP )kl = 0.\nTherefore the curvature of the connection on H is\nFH =\n\n1\n2\n\n√\ntr(P δP ∧ δP P ) idH = σω /2 −1 idH .\n\nSince it is a 2-form on J times the identity operator on the fibre, the connection on H is indeed projectively\nflat [1]. (In §2.1 of [26], it was shown directly, without the orthogonal projection from H0 , that the formula\nfor AH defines a connection on H which is projectively flat.)\n∗\nWe now incorporate metaplectic correction. Denote the restriction of K\nω (see §A.1)\n√ = (detV) → J to J√\nK\n→\nJ\nsuch\nthat\n(\nK)⊗2 = K.\nby the same notation K. Since Jω is contractible,\nthere\nis\na\nunique\nbundle\nω\n√\nThe curvature of the natural connection on K is (see [15] or §A.1)\n√\n√\nF K = 12 FK = − 21 tr(P δP ∧ δP P ) = −σω /2 −1 .\n√\n√\nmetaplectically\nWe consider the bundle Ĥ = H ⊗ K. Its fibre ĤJ = HJ ⊗ KJ over J ∈ Jω is the √\ncorrected quantum Hilbert space with the polarisation J. Since the curvatures of H and K cancel, the\nbundle Ĥ → Jω is canonically flat [29, 15]. The flatness of the bundle indicates that for the symplectic linear\nspace, quantisation is independent of the choice of polarisations. We summarise the results in the following\nTheorem 2.2 ([1, 29, 15]) Consider the quantisation of a bosonic system whose phase space is a finite\ndimensional symplectic vector space (V, ω).\n√\n1. The bundle of quantum Hilbert spaces H → Jω is projectively flat, with curvature σω /2 −1 .\n2. The bundle of quantum Hilbert spaces with metaplectic correction Ĥ → Jω is flat.\n\n2.3\n\nParallel transport along geodesics and the Bogoliubov transformations\n\nWe recall various results in [15]. Let (V, ω) be a symplectic vector space. The space (Jω , ηω ) of compatible\ncomplex structures is non-positively curved and there is a unique geodesic connecting any two points. Let\nJ0 , J1 ∈ Jω define two complex polarisations. We want to study the parallel transport UJH1 J0 and UJĤ1 J0 in\nthe bundles H and Ĥ, respectively, along the geodesic from J0 to J1 . A related notion is the orthogonal\nprojection PJ1 J0 from HJ0 to HJ1 in H0 .\nTheorem 2.3 ([15]) Let J0 , J1 ∈ Jω and let γ = {Jt }0≤t≤1 be the (unique) geodesic from J0 to J1 , t being\nproportional to the arc-length parameter. Then\n\u00011/4\n1\n1. the parallel transport in H along γ is UJH1 J0 = det J0 +J\nPJ1 J0 ;\n2\nr\n√\n√\n\u0001−1\n√\nT\ndet J1/2 / −1 V 1,0\n, and\n2. the parallel transport in K along γ is UJ1K\nJ0 =\nJ0\n\n√\n\nh UJ1K\nJ0\nfor any μ0 , μ′0 ∈\n\nVn\n\n)∗ ;\n(VJ1,0\n0\n\np √\n\u0001−1/4 p ′ √\n1\nh μ0 , μ0 i\nμ′0 , μ0 i = det J0 +J\n2\n√\n\n3. the parallel transport in Ĥ along γ, which is UJĤ1 J0 = UJH1 J0 ⊗ UJ1K\nJ0 , corresponds to the pairing between\nĤJ0 and ĤJ1 given by\nV\n√\n√\n√\n√\nψl ∈ HJl , μl ∈ n (VJ1,0\n)∗ (l = 0, 1).\nhψ1 ⊗ μ1 , ψ0 ⊗ μ0 i = hψ1 , ψ0 ih μ1 , μ0 i,\nl\n\nProof: Part 1 is Theorem 3.4 of [15]. Part 2 follows from Theorem 3.3.2 and formula (3.9) of [15], except\nthe parallel transport itself is expressed more intrinsically using Proposition A.1. Part 3 is Corollary 3.7 of\n[15].\n\u0003\n\u00011/4\n1\n1\nWe note that J0 +J\nis always invertible for J0 , J1 ∈ Jω . The factor det J0 +J\nappeared in [8, 28] and\n2\n2\nwas used to rescale the projection PJ1 J0 to a unitary operator called the Bogoliubov transformation [28, 29].\nTherefore Theorem 2.3.1 shows that the parallel transport UJH1 J0 along the geodesic coincides with the\nBogoliubov transformation. (The induced parallel transport on the creation and annihilation operators gives\nthe more traditional version of Bogoliubov transformations.) The parallel transport can also be expressed\nusing the Bergman kernel (Proposition 3.6 of [15]):\n\n4\n\n\f1\n\nCorollary 2.4 ([15]) Let ψ = φ e− 4 qJ0 ∈ HJ0 . Then for x ∈ V ,\nZ\n√\n\u00011/4 − 1 qJ (x)\n1\n1\n4\n(UJH1 J0 ψ)(x) = det J0 +J\ne\nexp[ −1 ω(x1,0\nJ1 , y) −\n2\nV\n\n1\n4\n\nOf particular interest is the parallel transport of a coherent state\n√\n1,0\n1\ncα\nJ (x) = exp[qJ (ᾱ, x) − 4 qJ (x)] = exp[ −1 ω(ᾱ, xJ ) −\n\nqJ1 (y) −\n\n1\n4\n\n1\n4\n\nqJ (x)],\n\nqJ0 (y)] φ(y) ε̃ω (y).\n\nx ∈ V,\n\nwhere J ∈ Jω and α ∈ VJ1,0 is a parameter. We recall some results from [15], but in a coordinate-free way.\nTheorem 2.5 ([15]) Under the assumptions of Theorem 2.3,\n1. the parallel transport along γ of the coherent state cα\nJ0 ∈ HJ0 is, for x ∈ V ,\nJ0 +J1\n(UJH1 J0 cα\nJ0 )(x) = det\n2\n\n\u0001−1/4\n\n1\n\ne− 4 qJ1 (x) exp\n1\n\n\u00021\n\n2\n\nω x1,0\nJ1 − ᾱ,\n\n\u0001\nJ0 +J1 −1 1,0\n(xJ1\n2\n\n− ᾱ)\n\n\u0001\u0003\n;\n\n2. the parallel transport along γ of any state ψ = e− 4 qJ0 φ ∈ HJ0 is, for x ∈ V ,\nZ\n\u0003\n\u0001\n\u0001\n\u0001\n\u0002\n0,1\nJ0 +J1 −1 1,0\nJ0 +J1 −1/4 − 14 qJ1 (x)\nH\ne\n(xJ1 −yJ0,1\n) − 21 qJ0 (y) φ(y) ε̃ω (y).\nexp 21 ω x1,0\n(UJ1 J0 ψ)(x) = det 2\nJ1 −yJ0 ,\n2\n0\nV\n\nProof: Part 1 is Theorems 3.3.1 of [15], where it was proved by solving the equation of parallel transport.\nAs remarked in [15] (after Corollary 3.7), the result also follows from the Bergman kernel by Theorem 2.3.1\nor Corollary 2.4. Since the latter approach will be adapted in the proof of Theorem 3.5.1 for fermions, we\ninclude the details here for comparison. Indeed, for any x ∈ V ,\nZ\n\u0001\u0003 √\n\u0002√\nJ0 +J1\n− 14 qJ1 (x)\n1\ny e −1 ω(ᾱ,y) ε̃ω (y)\n)(x)\n=\ne\n(PJ1 J0 cα\nexp −1 ω(y, x1,0\nJ0\nJ1 ) − 2 ω y,\n2\nV\nZ\n\u0001\nJ +J\n1\n\u00021\n\u0001\u0003\n\u0001\n1\n1,0\n− 2 ω y′ , 0 2 1 y′\n− 4 qJ1 (x)\nJ0 +J1 −1 1,0\nexp 2 ω xJ1 − ᾱ,\nǫ̃(y ′ )\n=e\n−\nᾱ)\n(x\ne\nJ1\n2\n= det\n\nJ0 +J1\n2\n\n\u0001−1/2\n\ne\n\n− 14 qJ1 (x)\n\nexp\n\n\u00021\n2\n\nω\n\nx1,0\nJ1\n\n− ᾱ,\n\nV\n\u0001\nJ0 +J1 −1 1,0\n(xJ1\n2\n\n\u0001\u0003\n− ᾱ) ,\n\n√\n1 −1\n) (x1,0\nwhere the change of variable is y ′ = y − −1 ( J0 +J\nJ1 − ᾱ). Here we used the Gaussian integral\n2\nZ\n1\ne− 2 ω(x,Ax) ε̃ω (x) = (det A)−1/2\nV\n\nfor any A ∈ End(V ) such that ω(*, A*) is a symmetric, positive-definite bilinear form. (This implies det A >\n0.) Part 2 is Theorems 3.8 of [15].\n\u0003\nIn particular, when J1 = J0 , the above reduces to the identity transformation. When n = 1, we use the\n1,0\nparametrisation in §A.2. We note that α ∈ VJ1,0\nand x ∈ V ∼\n= VJ1 can be identified with complex numbers.\n0\nIf the geodesic {Jt }0≤t≤1 from J0 to J1 is given by z(t) = tanh bt, then Theorem 2.5 gives\n√\n\u0003\n\u0002\n(UJH1 J0 cα\nsech b exp ᾱx tanh b + 21 (ᾱ2 − x2 ) sech b − 14 |x|2 .\nJ0 )(x) =\nThis is an important case (n = 1) of Proposition 3.2 in [15].\n\n2.4\n\nBosonic systems with symmetries\n\nLet (V, ω) be a symplectic vector space of dimension 2n. The action of Sp(V, ω) on Jω can be lifted to H,\npreserving the projectively flat connection.\n√ It can be lifted to an action of the metaplectic group Mp(V, ω),\nwhich is a double cover of Sp(V, ω), on K and hence on Ĥ. The lifted action preserves the flat connection.\nLet K be a compact Lie group with Lie algebra k. Suppose there is a representation of K on V preserving\nω. Then it also acts on the bundles H and Ĥ preserving the connections. Over the fixed-point set (Jω )K ,\nthe group K acts on the fibres of H. Each fibre splits orthogonally into a direct sum of subspaces of various\nrepresentation types. Since K preserves the connection, the restriction of the bundle H to (Jω )K , together\nwith the projectively flat connection, splits into sub-bundles with fibre-wise K-actions. The sub-bundle HK\non which K acts trivially is related to the quantisation of the symplectic quotient.\n\n5\n\n\fThe action of K on V is Hamiltonian with a moment map μK : V → k∗ given by\nhμK (x), Ai =\n\n1\n2\n\nω(x, Ax),\n\nx ∈ V, A ∈ k.\n\nK\nThe symplectic quotient V //K = μ−1\nK (0)/K is a stratified symplectic space [23]. Choosing J ∈ (Jω ) , the\nC\nC\naction of K extends to that of K . Let π : V → V /K be the quotient map. With the above moment map,\nevery point in V is semi-stable, i.e., V ss = V (see Example 2.3 of [22]). The quotient V /K C = V //K is also\na stratified analytic space; a function f on an open set U ⊂ V /K C is analytic if π ∗ f is so on π −1 (U ). On\nthe singular space V //K, this analytic structure replaces the notion of polarisation. The sheaf of invariant\nsections π∗K l on V /K C defined by O(π∗K l)(U ) = Γ (π −1 (U ), O(l))K plays the role of a pre-quantum line\nbundle. We have (cf. Proposition 2.14 and Theorem 2.18 of [22])\n\nΓ (V //K, O(π∗K l)) ∼\n= Γ (V, O(l))K .\nRestricting to the L2 -subspaces, we can identify (HJ )K with the quantum Hilbert space arising from the\nquantisation of V //K with a complex structure induced from J.\nWe have a projectively flat bundle HK → (Jω )K whose fibres are quantum Hilbert spaces of V //K with\ncomplex structures from (Jω )K . The connection is unitary if the inner product in the fibres (HJ )K is the\nrestriction of that in HJ . This is the case, for example, in the quantisation of Chern-Simons gauge theory [1].\nThe inner product on (HJ )K from quantisation of V //K is usually different. In [12], it was shown that for a\ncompact symplectic manifold with a Hamiltonian group action and when metaplectic correction is included,\nthe two inner products agree in the semi-classical limit.\nUnless the moment map μK is proper, the symplectic quotient V //K is non-compact and the quantum\nHilbert space (HJ )K is expected to be infinite dimensional. When μK is proper however, the base space of\nthe bundle HK → (Jω )K is a point.\nProposition 2.6 If μK : V → k∗ is proper, then (Jω )K = {J0 }.\nProof: If (Jω )K 6= {J0 }, then by Proposition C.4.1, there is a non-zero K-invariant complex subspace (V ′ , J0 )\nof (V, J0 ) and a K-invariant real structure R on V ′ such that ω(Rx, Ry) = −ω(x, y) for all x, y ∈ V ′ . For\nany A ∈ k, x ∈ V ′ , we have\nhμK (Rx), Ai =\n\n1\n2\n\nω(Rx, ARx) =\n\n1\n2\n\nω(Rx, RAx) = − 21 ω(x, Ax) = −hμK (x), Ai.\n\nTherefore μK = 0 on V0′ = (V ′ )R and hence μK is not proper.\n\n3\n3.1\n\n\u0003\n\nQuantisation of fermionic systems\nPre-quantisation and quantisation\n\nWe consider pre-quantisation [17] and quantisation [28] of linear fermionic systems. The phase space is given\nby a finite-dimensional real vector space V equipped with a Euclidean inner product g. More precisely, it\nis a fermionic copy ΠV of V (see §B.1). The pre-quantum line bundle does not exists in the usual sense,\nbut its \"sections\" and the operators acting onVthem do. Motivated by the bosonic case (§2.1), we take the\npre-quantum Hilbert space H0 of fermions as • (V C )∗ , the space of \"functions\" on ΠV . On H0 , there is an\nHermitian form given by the Berezin integral (see §B.1 for definition and notations)\nZ\nψ̄ ∧ ⋆0 ψ ′ ǫg , ψ, ψ ′ ∈ H0 ,\nhψ, ψ ′ i0 =\nΠV\n\nwhere ψ̄ is the standard complex conjugation of ψ, ⋆0 is the Hodge star defined by the metric\ncovariant derivatives take the form\n∇x = ιx −\n\n1\n2\n\nν(x) ∧ * ,\n\n1\n2\n\ng. The\n\nx∈V\n\nand satisfy the relation\n{∇x , ∇y } = −g(x, y),\n\nx, y ∈ V.\n\nSo the \"curvature\" is a symmetric bilinear form; the minus sign is enforced by the requirement, as in the\nbosonic case, that the covariant derivatives are skew-self-adjoint operators on H0 .\n\n6\n\n\fA linear functional α ∈ V ∗ is a \"classical observable\" that can be pre-quantised, giving rise to a selfadjoint operator\nα̂ = ∇ν −1 (α) + α ∧ * = ιν −1 (α) + 12 α ∧ *\non H0 . These operators satisfy the canonical anti-commutation relation or the Clifford algebra relation\n{α̂, β̂} = g −1 (α, β),\n\nα, β ∈ V ∗ ,\n\nmaking H0 a (reducible) Clifford module.\nWe now assume that V is even dimensional; let dim V = 2n. Recall from §A.2 the space Jg of complex\nstructures on V compatible with the metric g and the orientation. Each J ∈ Jg defines a polarisation, a\nmaximally isotropic complex subspace VJ1,0 of V C . The quantum Hilbert space (with the choice of polarisation\nJ) is\nHJ = {ψ ∈ H0 | ∇x ψ = 0, ∀x ∈ VJ0,1 }.\nWe have a bundle of quantum Hilbert spaces H → Jg whose fibre over J ∈ Jg is HJ .\nOn H0 , there is an involution ψ 7→ ψ ∗ defined as the unique linear extension of the operation (α1 ∧ * * * ∧\nαk )∗ = ᾱk ∧ * * * ∧ ᾱ1 , where α1 , . . . , αk ∈ (V C )∗ .\nProposition 3.1 1. Any ψ ∈ HJ is of the form\n√\n\n−1\n\nψ = e 2 ̟J ∧ φ\nV\nV\nfor a unique φ ∈ • (VJ1,0 )∗ , where ̟J = g(J*, *) ∈ 2 V ∗ . Consequently, dimC HJ = 2n .\nV\n2. Suppose ψ, ψ ′ ∈ HJ correspond to φ, φ′ ∈ • (VJ1,0 )∗ , respectively, then\nZ\nZ\n√\n′\n′\nφ∗ ∧ φ′ ∧ e −1 ̟J ǫ̃g ,\nφ̄ ∧ ⋆ φ ǫg =\nhψ, ψ i0 =\nΠV\n\nΠV\n\n√\nwhere ⋆ is the Hodge star defined by g and ǫ̃g = −1 n ǫg .\nV\n3. For any α ∈ V ∗ , α̂ preserves HJ and remains self-adjoint on HJ . It acts on φ ∈ • (VJ1,0 )∗ by\nα̂ : φ 7→ ιν −1 (α0,1 ) φ + α1,0 ∧ φ.\n\nProof: 1. Write ψ = e\n\n√\n−1\n2\n\n̟J\n\n∧ φ for some (unique) φ ∈ H0 . Then for any x ∈ V , we have\n∇x ψ = e\n\n√\n−1\n2\n\n̟J\n\n∧ (ιx φ − ν(x1,0 ) ∧ φ).\n\nV• 1,0 ∗\nTherefore ψ ∈ HJ if and only if ιx φ = 0 for all x ∈ VJ0,1 . This implies φ ∈\n(VJ ) .\n2. We choose a basis {ei } of VJ1,0 such that g(ei , ēj ) = δij and ǫg = e1 ∧ * * * ∧ en . Assume, without loss of\ngenerality, that φ = φ′ = e∗1 ∧ * * * ∧ e∗k (1 ≤ k ≤ n). Then\nψ =φ∧\nSince ⋆0 = 2p−n ⋆ on\n\nVp\n\nX\n\n2−r\n\nr=0\n\nē∗i1 ∧ e∗i1 ∧ * * * ∧ ē∗ir ∧ e∗ir .\n\nk+1≤i1 <***<ir ≤n\n\nV ∗ , we have\n\nk(k−1)\n\n⋆0 ψ =\n\nn−k\nX\n\n(−1) 2\n√ n\n−1\n\nφ∧\n\nn−k\nX\n\n(−1)r 2r+k−n\n\nr=0\n\nX\n\nē∗j1 ∧ e∗j1 ∧ * * * ∧ ē∗jn−k−r ∧ e∗jn−k−r .\n\nk+1≤j1 <***<jn−r ≤n\n\nSo\nhψ, ψ ′ i0 =\n\nZ\n\nΠV\n\nψ̄ ∧ ⋆0 ψ ǫg =\n\nn−k\nX\nr=0\n\n2k−n\n\n\u0012\n\u0013\nn−k\n= 1.\nr\n\nThe two integrals in the equality are clearly 1 (cf. proof of Proposition B.2).\n3. This follows from the identity\nα̂(e\n\n√\n\n−1\n2\n\n̟J\n\n∧ φ) = e\n\n√\n−1\n2\n\n̟J\n\n7\n\n∧ (ιν −1 (α)φ + α1,0 ∧ φ),\n\n\fV• 1,0 ∗\nwhich yields the result when φ ∈\n(VJ ) .\n\u0003\nV• 1,0 ∗\n(VJ ) with the action of α ∈ V ∗ in Proposition 3.1.3 is the standard\nWe note that the space\nconstruction of the irreducible Clifford\nmodule of spinors. Here it arises naturally in the quantisation of\n√\n−1\nfermionic systems. The factor e 2 ̟J is the fermionic analogue of the Gaussian inVProposition 2.1.1. It is\n• ∗\ncrucial in achieving projective flatness for the bundle H → Jg (§3.2), as the bundle\nV → Jg without the\nfermionic Gaussian factor is not projectively flat.\nThe results in this section can be explained using \"fermionic coordinates\". We refer the reader to §B.2\nwhere this is done.\n\n3.2\n\nProjectively flat connection and metaplectic correction\n\nWe study the geometry of the bundle H → Jg of Hilbert spaces of the fermionic system (V, g). Following\n§2.2, we define a connection on H by orthogonal projection of the trivial connection on the product bundle\nJg × H0 → Jg . We now show that this connection is also projectively flat.\nAlong a variation δJ of J ∈ Jg , ψ ∈ HJ changes to ψ + δψ ∈ HJ+δJ by parallel transport. Since ψ + δψ\nis the (infinitesimal) orthogonal projection of ψ to HJ+δJ , we have, as in §2.2, δψ ⊥ HJ and\n∇ī (δψ) = −(δ P̄ )ī j ∇j ψ = (δP )ī j ∇j ψ.\nThe (unique) solution that satisfies the above two conditions is\nδψ = − 12 ∇i (δP )ij ∇j ψ = − 21 (δP )ij ∇i ∇j ψ.\nFirst, this δψ is orthogonal to HJ as ∇ī is the formal adjoint of ∇i . Second, as ∇ī ψ = 0, (δP )ij = −(δP )ji\nand {∇ī , ∇j } = −gīj , we get\n∇k̄ (δψ) = − 21 (δP )ij [∇k̄ , ∇i ∇j ]ψ = − 21 (δP )ij ({∇k̄ , ∇i }∇j − ∇i {∇k̄ , ∇j })ψ\n= gk̄i (δP )ij ∇j ψ = (δP )k̄j ∇j ψ.\n\nThe connection AH on H is determined by (δ + AH )ψ = 0 and thus AH =\ncalculations in §2.2, we get\n\n1\n2\n\n(δP )ij ∇i ∇j . Following the\n\nδ AH = − 21 (δP )ij ∧ ∇δei ∇j = − 12 (δP )ij ∧ (δP )ik̄ ∇k̄ ∇j\n= − 12 gk̄j (δP )ji ∧ (δP )ik̄ = − 12 tr(P δP ∧ δP P )\n\nand\nAH ∧ AH =\n\n1\n4\n\n∇i ∇j ∇k ∇l (δP )ij ∧ (δP )kl = 0.\n\nTherefore the curvature of the connection AH is\n\n√\nFH = − 12 tr(P δP ∧ δP P ) idH = σg /2 −1 idH .\nSince it is a 2-form on Jg times the identity operator on the fibre, the connection is projectively flat.\nWe propose a metaplectic correction for fermions. Recall the line bundle K−1 = det V → Jg whose fibre\nV\nover J is KJ−1 = n VJ1,0 . We claim that c1 (K) is even. This can be seen from the holonomy of√the bundle\nH with curvature FH = − 21 FK idH . Since Jg is simply connected, there is a unique line bundle K−1 → Jg\n√\n√\nsuch that ( K−1 )⊗2 = K−1 . The bundle K−1 has a connection (§A.1) whose curvature is\n√\n\nF\n\nK−1\n\n= − 21 FK =\n\n1\n2\n\n√\ntr(P δP ∧ δP P ) = −σg /2 −1 .\n\nVn 1,0\nVn 1,0\n−1\nFor any J, J ′ ∈ Jg , there is a pairing between K−1\nVJ and K−1\nVJ ′ . For any μ ∈ Kp\nJ =\nJ′ =\nJ and\n−1\n−1\n′\n′\n′\nμ ∈ KJ ′ , hμ , μi is the ratio\np of μ̄ ∧ μ and ǫ̃g . Since hμ, μi > 0 if μ 6= 0, there is an inner product on KJ\n√ √\ndefined by h μ, μi = hμ, μi.\nq\n√\nover J ∈ Jg is called the\nWe consider the bundle Ĥ = H ⊗ K−1 . The fibre ĤJ = HJ ⊗ K−1\nJ\n√\nmetaplectically corrected quantum Hilbert space in polarisation J. Since the curvatures of H and K−1\ncancel, the bundle Ĥ → J is canonically flat. The flatness of the bundle indicates that for the fermionic\nsystem whose phase space is a linear space, quantisation is independent of the choice of polarisations. We\n\n8\n\n\fnote\nto the bosonic case, the metaplectic correction is obtained by tensoring HJ with\nq here that in contrast\n√\n−1\nKJ instead of KJ . This is clearly related to the opposite way a fermionic measure transforms under\ncoordinate changes. We recall from §A.2 that the pseudo-Kähler form σ restricts to σω on Jω but to −σg\non Jg . Consequently, for both bosonic and fermionic systems, the line bundle of half-forms has a negative\nfirst Chern form on the space of polarisations.\nWe summarise the results in the following\nTheorem 3.2 Consider the quantisation of a fermionic system whose phase space is given by a finite dimensional Euclidean vector space (V, g).\n√\n1. The bundle of quantum Hilbert spaces H → Jg is projectively flat, with curvature σg /2 −1 .\n2. The bundle of quantum Hilbert spaces with metaplectic correction Ĥ → Jg is flat.\n\n3.3\n\nParallel transport along geodesics and the Bogoliubov transformations\n\nWe investigate the parallel transport in the bundles H and Ĥ along geodesics in Jg . Unlike Jω , which is\ncontractible and non-positively curved, the space Jg is compact and non-negatively curved. The geodesics\nthrough two conjugate points in Jg are not unique. Nevertheless, we show that if J0 , J1 ∈ Jg are not in\nthe cut loci (see §A.3) of each other, then the parallel transport UJH1 J0 along the (unique) length-minimising\nH0 . The latter was\ngeodesic from J0 to J1 is the rescaled orthogonal projection PJ1 J0 from HJ0 to HJ1 in q\n\ncalled the Bogoliubov transformation of fermionic systems [28]. The inner product in K−1\nJ0 extends to a\nq\nq\n−1\n−1\npairing between KJ0 and KJ2 along the geodesic, which is non-degenerate as long as J1 is not on the\ncut locus of J0 (Corollary A.5).\n\nTheorem 3.3 Let J0 , J1 ∈ Jg and let γ = {Jt }0≤t≤1 be a geodesic from J0 to J1 , t being proportional to\nthe arc-length parameter. Assume that the geodesic lies completely in the complement of the cut locus of J0 .\nThen\n\u0001−1/4\n1\n1. the parallel transport in H along γ is UJH1 J0 = det J0 +J\nPJ1 J0 ;\n2\n√\nq\n√\n√\n−1\nK\n2. the parallel transport in K−1 along γ is UJ1 J0 = det J1/2 / −1 V 1,0 , and\nJ0\n\nfor any μ0 , μ′0 ∈\n\nVn\n\nVJ1,0\n;\n0\n\n√\np √\n−1\nh UJ1K\nμ′0 , μ0\nJ0\n\n1\ni = det J0 +J\n2\n\n\u00011/4 p ′ √\nh μ0 , μ0 i\n√\n\n3. the parallel transport in Ĥ along γ, which is UJĤ1 J0 = UJH1 J0 ⊗ UJ1K\nJ0 , corresponds to the pairing between\nĤJ0 and ĤJ1 given by\nV\n√\n√\n√\n√\nψl ∈ HJl , μl ∈ n VJ1,0\n(l = 0, 1).\nhψ1 ⊗ μ1 , ψ0 ⊗ μ0 i = hψ1 , ψ0 ih μ1 , μ0 i,\nl\n−1\n\n∼ SO(2n)/ U(n) are given by Propo, the geodesics in Jg =\nProof: 1. Choosing a unitary basis {ei } of VJ1,0\n0\nsition A.3.2. We can assume without loss of generality (cf. the proof of Theorem 3.4 in [15]) that n = 2\nand k = 1, b = b1 > 0; the case n = 1 is trivial. Then as in the proof of Proposition A.4, the vectors\n(t)\n(t)\n(t)\n(t)\ne1 = cos bt e1 − sin bt ē2̄ , e2 = cos bt e2 + sin bt ē1̄ form a unitary basis of VJ1,0\n. Since (δP ) e1 = −b e2\nt\n(t)\n\n(t)\n\nand (δP ) e2 = b e1 , we have (δP )12̄ = −b and hence (δP )12 = b; here the tensor indices correspond to\n(t) (t)\nthe basis {e1 , e2 }. We want to find α(t) such that the quantity α(t)hψ ′ , ψt i is independent of t for any\n′\nψ ∈ HJ0 if ψt ∈ HJt is a parallel transport of ψ0 ∈ HJ0 . This would imply UJHt J0 = α(t)−1 PJt J0 . Since ψt\nsatisfies the differential equation\nψ̇t = − 21 (δP )ij ∇i ∇j ψt = −b ∇1 ∇2 ψt ,\n\nwe have\n\u0001\nd\nα(t)hψ ′ , ψt i = α̇(t)hψ ′ , ψt i − b α(t)hψ ′ , ∇1 ∇2 ψt i\ndt\n(0)\n= α̇(t)hψ ′ , ψt i − b α(t)hψ ′ , (sec bt ∇1 − tan bt ∇2̄ )∇2 ψt i\n= α̇(t)hψ ′ , ψt i + b α(t) tan bt hψ ′ , {∇2̄ , ∇2 }ψt i\n= (α̇(t) − b α(t) tan bt) hψ ′ , ψt i.\n9\n\n\fSolving α̇ − bα tan bt = 0 with α(0) = 1, we get α(t) = (cos bt)−1 . By Proposition A.4, the assumption on\nt\nt\nthe geodesic means that J0 +J\nis invertible for all t ∈ [0, 1]. Since det J0 +J\n= cos4 bt, this means |b| < π2\n2\n2\nand the result follows.\n√\n−1\nfollows from Lemma A.1. It suffices to show the rest when n = 2 using the above\n2. The formula for UJ1K\nJ0\n(0)\n\n(0)\n\nparametrisation. If we take μ0 = e1 ∧ e2 , then hμ0 , μ0 i = 1 and\n(t)\n\n−1\n\n(t)\n\nUJK1 J0 μ0 = e1 ∧ e2 = cos2 bt μ0 + * * * ,\nwhere the omitted part has a factor from VJ0,1\n. The result then follows from\n0\n−1\n\nt\nh UJK1 J0 μ0 , μ0 i = cos2 bt = det J0 +J\n2\n\n3. This is an immediately consequence of parts 1 and 2.\n\n\u00011/2\n\n.\n\u0003\n\n\u0001−1/4\n1\nNotice that although power of the factor det J0 +J\nin Theorem 3.3.1 is opposite to that in Theo2\nrem 2.3.1, both are greater than 1. Using the fermionic analog of the Bergman kernel projection in Proposition B.2, we have\nCorollary 3.4 Let ψ = e\n1\n(UJH1 J0 ψ)(θ) = det J0 +J\n2\n\n√\n−1\n2\n\n̟J0\n\n\u0001−1/4\n\n∧ φ ∈ HJ0 . Then for fermionic but real θ ∈ ΠV ,\nZ\n√\n√\n√\n\u0003\n\u0002\n−1\n−1\n̟J1 (θ)\n4\ne\nexp g(θJ1,0\n, χ) + −1\n4 ̟J1 (χ) +\n4 ̟J0 (χ) φ(χ) ǫ̃g (χ).\n1\nΠV\n\nWe recall from §B.2 the notion of fermionic coherent states.\nTheorem 3.5 Under the assumptions of Theorem 3.3,\n1. the parallel transport along γ of the coherent state cα\nJ0 is, for θ ∈ ΠV ,\nJ0 +J1\n(UJH1 J0 cα\nJ0 )(θ) = det\n2\n\n\u00011/4\n\ne\n\n√\n−1\n4\n\n̟J1 (θ)\n\nexp\n\n1\n\n\u0002 √−1\n2\n\n− ᾱ,\ng θJ1,0\n1\n\n\u0001\nJ0 +J1 −1 1,0\n(θJ1\n2\n\n− ᾱ)\n\n\u0001\u0003\n\n;\n\n2. the parallel transport along γ of any state ψ = e 4 ̟J0 ∧ φ ∈ HJ0 is, for θ ∈ ΠV ,\nZ\n√\n\u0002√\n\u0003\n\u0001\n\u0001\n1,0\n0,1\n0,1 \u0001\n−1\nJ0 +J1 1/4 41 ̟J1 (θ)\nH\nJ0 +J1 −1 1,0\nexp −1\n(UJ1 J0 ψ)(θ) = det 2\ng\nθ\n−χ\ne\n(θ\n,\n−χ\n)\n+\nJ1\nJ0\nJ1\nJ0\n2\n2\n4 ̟J0 (χ) φ(χ) ǫ̃g (χ).\nΠV\n\nProof: 1. We follow the proof of Theorem 2.5.1. By Lemma B.1 and Proposition B.2, we get, for fermionic\nbut real θ ∈ ΠV ,\nZ\n√\n√\n\u0002\n\u0001\u0003\n−1\n−1\n̟J1 (θ)\nα\nJ0 +J1\n4\nexp g(θJ1,0\n(PJ1 J0 cJ0 )(θ) = e\n,\nχ)\n+\nχ, χ eg(χ,ᾱ) ǫ̃g (χ)\n2 g\n2\n1\nΠV\nZ\n\u0001\n√\n√\nJ0 +J1 ′ ′\n\u0001\n\u0001\u0003\n\u0002√\n−1\n−1\n1,0\nχ ,χ\n(θ)\n̟\nJ0 +J1 −1 1,0\nJ\n2 g\n1\n2\ng\nθ\n−\nᾱ,\n(θ\n−\nᾱ)\ne\nǫ̃(χ′ )\nexp −1\n=e 4\nJ1\nJ1\n2\n2\n1\n= det J0 +J\n2\n\n\u00011/2\n\ne\n\n√\n−1\n4\n\n̟J1 (θ)\n\nexp\n\n\u0002 √−1\n2\n\n− ᾱ,\ng θJ1,0\n1\n\nΠV\n\u0001\nJ0 +J1 −1 1,0\n(θJ1\n2\n\n− ᾱ)\n\n\u0001\u0003\n\n,\n\n√\n1 −1\nwhere we made a change of variable χ′ = χ − −1 ( J0 +J\n) (θJ1,0\n− ᾱ) and used Lemma B.1. The condition\n2\n1\nJ0 +J1\nJ0 +Jt\nis in the same connected component of invertible\nthat 2 is invertible for all 0 ≤ t ≤ 1 implies that 2\nskew-symmetric operators as J0 . The result then follows from Theorem 3.3.1.\n2. By Proposition B.2, we have\nZ\ncχJ (θ) e−g(χ,χ̄) φ(χ, χ̄) ǫ̃(χ).\nψ(θ, θ̄) =\nΠV\n\nThe result then follows from part 1 and the linearity of fermionic integration.\nWhen n = 2, if the geodesic {Jt }0≤t≤1 from J0 to J1 is given by z(t) = tan bt, where |b| <\nTheorem 3.5 gives\n\u0003\n\u0002 1 1̄\n2 2̄\n1̄ 2̄\n1 2\n1 1̄\n2 2̄\n1\n1\n(UJ1 J0 cα\nJ0 )(θ) = cos b exp (θ ᾱ + θ ᾱ ) sec b + 2 (ᾱ ᾱ + θ θ ) tan b − 2 (θ θ̄ + θ θ̄ ) ,\n\n\u0003\nπ\n2,\n\nthen\n\nwhich can also be obtained by solving the equation of parallel transport as in the bosonic case (cf. [15]).\n\n10\n\n\f3.4\n\nFermionic systems with symmetries\n\nLet (V, g) be a Euclidean space of dimension 2n. The action of SO(V, g) on Jg can be lifted to H, preserving\nthe√\nconnection. It can be lifted to an action of the spin group Spin(V, g), which is a double cover of SO(V, g),\non K−1 and hence on Ĥ. The lifted action preserves the flat connection.\nSuppose K is a compact Lie group with Lie algebra k acting on (V, g) by an orthogonal representation.\nThen it also acts on the bundles H and Ĥ preserving the connections. Over the fixed-point set (Jg )K ,\nthe group K acts on the fibres of H. Each fibre splits orthogonally into a direct sum of subspaces of\nvarious representation-types of K. Since K preserves the connection, the restriction of the bundle H to\n(Jg )K together with the projectively flat connection splits into sub-bundles on which K acts fibre-wisely. In\nparticular, we have a projectively flat sub-bundle HK → (Jg )K on which K acts trivially on the fibres.\nWe now study the fermionic reduced phase space ΠV //K and its quantisation. The action of the Lie\nalgebra k yields Hamiltonian \"vector fields\" on ΠV [17]. The moment map μK is given by, for any A ∈ k,\nV2 ∗\nV or\nhμK , Ai = 21 g(A*, *) ∈\nhμK (θ), Ai =\n\n1\n2\n\ng(Aθ, θ),\n\nθ ∈ ΠV, A ∈ k\n\nusing fermionic variables. Following the construction of the usualVsymplectic quotients, the fermionic ana•\nlogue ΠV //K should be the \"spec\" of the non-commutative ring ( (V ∗ )C /hμK i)K , where hμK i is the ideal\ngenerated by hμK , Ai for all A ∈ k. The \"space\" ΠV //K is not usually a graded manifold in the sense of [17];\nit would be so if 0 were a regular value of μK [2]. So fermionic symplectic quotients are interesting examples\nof supermanifolds with curved fermionic coordinates. Consider the example V = R2n with K = S 1 acting\nby weights λ1 , . . . , λr 6= 0, λr+1 = * * * = λn = 0. Then the \"coordinate ring\" of ΠR2n //S 1 is generated by\n1, θ1 θ2 , . . . , θ2r−1 θ2r , θ2r+1 , . . . , θ2n subject to a relation λ1 θ1 θ2 + * * * + λr θ2r−1 θ2r = 0. Here θ1 , . . . , θ2n are\nthe fermionic coordinates on ΠR2n . When r = 1, the above ring is the exterior algebra on θ3 , . . . , θ2n and\nthus ΠR2n //S 1 ∼\n= ΠR2n−2 .\nProposition 3.6 If dim(Jg )K > 0, then there is a non-zero K-invariant complex subspace (V ′ , J0 ) of (V, J0 )\nwith a K-invariant quaternionic structure such that the restriction of μK to ΠV ′ is invariant under the scalar\nmultiplication by quaternions of unit norm.\nProof: By Proposition C.4.2, there is a non-zero K-invariant complex subspace (V ′ , J0 ) of (V, J0 ) and a\nK-invariant quaternionic structure Q on V ′ such that g(Q*, Q*) = g(*, *) on V ′ . For any A ∈ k, we have\nhμK (Qθ), Ai =\n\n1\n2\n\ng(Qθ, AQθ) =\n\n1\n2\n\ng(Qθ, QAθ) =\n\n1\n2\n\ng(θ, Aθ) = hμK (θ), Ai,\n\nwhere θ ∈ ΠV ′ . The result then follows easily from g(J0 *, J0 *) = g(*, *) and QJ0 = −J0 Q.\n\n4\n\n\u0003\n\nConcluding remarks\n\nWe end with a comparison of the quantisation of bosons and fermions. As explained in §1, the existence of\nprojectively flat connection is due largely to the fact that the irreducible representation of the operator algebra\n(Heisenberg algebra for bosons and Clifford algebra for fermions) is unique up to unitary equivalence. This\nenables us to identify, up to a phase, states in Hilbert spaces constructed from various linear polarisations.\nMoreover, the geometric structure of the bundle of Hilbert spaces and results on parallel transport are rather\nsimilar in the bosonic and fermionic cases.\nWe note however some conceptual differences. For bosons, the positivity condition is on the polarisation\nwhereas for fermions, it is on the Euclidean structure g. Indeed, the unitarity of the representation of the\nHeisenberg algebra is not sensitive to the sign of ω, whereas for fermions, the positivity condition on g is\nthe requirement for unitarity [25]. On the other hand, the positivity condition on polarisation for bosons\nguarantees the existence of holomorphic sections rather than elements in higher cohomology groups. For\nfermions, the cohomology is always at the zeroth degree; this reflects the Dirac sea picture in physics.\nMathematically, the spaces of allowed polarisations are Hermitian symmetric spaces in both cases. For\nbosons, the space non-compact, non-positively curved. Though it is contractible, the difficulty occurs at the\nboundary at infinity, where the limit of parallel transport should be carefully taken [15]. For fermions, the\nspace of polarisation is compact, non-negatively curved. Though it has no boundary, interesting phenomena\n(non-uniqueness of geodesics, degeneracy of the half-form pairing) because of cut locus (§A.3 and §3.3).\nFurthermore, the half-form bundles in metaplectic correction are of opposite powers of the canonical bundle\n\n11\n\n\fin the two cases in order to cancel the curvature of the projectively flat connection. We hope that these\nobservations are useful to future research on the quantisation of more general symplectic or graded symplectic\nmanifolds.\n\nAppendix\nA\nA.1\n\nGeometry of the space of complex structures\nComplex structures on a vector space\n\nLet V be a real vector space of dimension 2n. Consider the set J of complex structures on V compatible\n1,0\n0,1\n1,0\n0,1\nC\nwith a given orientation on V . For each J ∈ J, there is a decomposition\n√V = VJ ⊕ VJ , where VJ , VJ\nare the holomorphic and anti-holomorphic subspaces, on which J = ± −1 , respectively. Similarly, there is\na decomposition (V ∗ )C = (VJ1,0 )∗ ⊕ (VJ0,1 )∗ . For x ∈ V , α ∈ V ∗ , we write, accordingly,\n0,1\nx = x1,0\nJ + xJ ,\n\n0,1\nα = α1,0\nJ + αJ .\n\nThe space J is a connected smooth manifold of real dimension 2n2 . At any J0 ∈ J, the tangent space of J is\n0,1\n1,0\n0,1\n1,0\nT J0 J ∼\n= HomC (VJ0 , VJ0 ). Moreover, a dense open subset of J can be parametrised by Z ∈ HomC (VJ0 , VJ0 ):\n1,0\n1,0\nfor any such Z, the corresponding subspace VJ is the graph of Z, that is, VJ consists of the vectors of\n\u0001\nx\nunder the decomposition V C = VJ1,0\nthe form Zx\n⊕ VJ0,1\n, where x ∈ VJ1,0\n. These open sets (for various\n0\n0\n0\nJ0 ) have complex coordinates and form an open cover of J. This defines a complex structure on J. For a\nfixed J0 ∈ J, the complement of the open set consists of J ∈ J such that VJ1,0 ∩ VJ0,1\n6= {0}, which happens\n0\n0,1\n)\ncorresponds\nto a complex\n,\nV\nwhen J + J0 is not invertible. On the other hand, not every Z ∈ HomC (VJ1,0\nJ0\n0\n1,0\n0,1\n1,0\nstructure. If it does, then the condition VJ ∩ VJ = {0} implies that 1 − Z̄Z ∈ End(VJ0 ) is invertible.\nAn element Z that violates this condition is on the \"boundary\" of J. Finally, the projection onto VJ1,0 along\n√\nVJ0,1 is PJ = 12 (1 − −1 J). Given J0 , on the dense set where J can be parametrised by Z, the projection is\n\u0012 \u0013\n1\nPJ =\n(1 − Z̄Z)−1 (1, −Z̄).\nZ\nSuppose δJ is an infinitesimal\nvariation of J ∈ J. (The symbol δ can be interpreted as the differential on\n√\nJ.) Since the change δP = − −1\nδJ\nof P = PJ anti-commutes with J, it is off-diagonal with respect to the\n2\n1,0\n0,1\n1,0\nC\ndecomposition V = VJ ⊕VJ . The new holomorphic subspace VJ+δJ\nis the graph of the HomC (VJ1,0 , VJ0,1 )component of δP . Since P + P̄ = idV , we have δ P̄ = −δP .\nWe consider the vector bundle V → J whose fibre over J ∈ J is VJ1,0 . This is a sub-bundle of the product\nbundle J × V C and has a connection defined by the projection PJ . This connection on V is AV = −(δPJ )PJ\nand its curvature is\nFV = PJ δPJ ∧ δPJ PJ = − 41 PJ δJ ∧ δJ PJ\n\u0012 \u0013\n1\n=−\n(1 − Z̄Z)−1 δ Z̄ ∧ (1 − Z Z̄)−1 δZ(1 − Z̄Z)−1 (1, −Z̄).\nZ\nVn\nThe curvature of the line bundle det V =\nV → J is the 2-form\n\nFdetV = tr(PJ δPJ ∧ δPJ PJ ) = tr((1 − Z Z̄)−1 δZ ∧ (1 − Z̄Z)−1 δ Z̄).\n\n(All expressions in terms of Z are valid onVa dense open set of J only.) The canonical line bundle over V is\nn\nthe product bundle V × KJ , where KJ =\n(VJ1,0 )∗ . We have a line bundle K → J whose fibre over J ∈ J\n∗\nis KJ . In fact, K = (detV) and its curvature is FK = −FdetV .\nThe space J has a transitive action of GL+ (V ), the identity component of GL(V ) ∼\n= GL(2n, R) preserving\nthe orientation on V . At J0 ∈ J, the isotropy subgroup GL(V, J0 ) ∼\n= GL(n, C) consists of elements in GL(V )\nthat commutes with J0 . Therefore J can be identified as the homogeneous space GL+ (V )/ GL(V, J0 ). The\nLie algebra of GL+ (V ) has the decomposition gl(V ) = gl(V, J0 ) ⊕ m, where gl(V, J0 ), m are the subspaces in\ngl(V ) of elements that commute, anti-commute with J0 , respectively. Since m is invariant under the adjoint\n\n12\n\n\faction of GL(V, J0 ) and since [m, m] ⊂ gl(V, J0 ), GL+ (V )/ GL(V, J0 ) is a reductive symmetric space. The\ntrace form on m ∼\n= TJ0 J is a GL(V, J0 )-invariant non-degenerate symmetric bilinear form and it induces a\npseudo-Riemannian metric\nη = 2 tr(PJ δPJ δPJ PJ ) = 2 tr((1 − Z Z̄)−1 δZ (1 − Z̄Z)−1 δ Z̄)\non J. It is pseudo-Kähler with the pseudo-Kähler form\n√\n√\n√\nσ = FK / −1 = −1 tr(PJ δPJ ∧ δPJ PJ ) = −1 tr((1 − Z Z̄)−1 δZ ∧ (1 − Z̄Z)−1 δ Z̄).\nThe group GL+ (V ) acts on Z by fractional linear transformations preserving σ.\nThe map J 7→ J0−1 JJ0 is an isometric reflection on J that induces minus the identity map on the tangent\nspace TJ0 J ∼\n= m. As J is reductive, a geodesic in J is of the form t 7→ [gt ] with gt = g0 etM (see [19]), where\ng0 ∈ GL+ (V ), M ∈ m and [g] denotes the coset in GL+ (V )/ GL(V, J0 ) ∼\n= J represented by g ∈ GL+ (V ).\nThe parameter t ∈ R is proportional to the arc-length on the geodesic.\n√\nProposition A.1 For any t, Jt/2 / −1 is the parallel transport in V along the geodesic from J0 to Jt .\nProof: Since the geodesic starts from J0 , we have g0 = 1, hence gt gt′ = gt+t′ and gt−1 = g−t . The reflection\nat J0 reverses the direction of each geodesic passing through J0 , as J0−1 gt J0 = √\ng−t . The complex structure\nthe identity map on\nat [gt ] is Jt = gt J0 gt−1 = g2t J0 = J0 g−2t , and hence J0 J−t = Jt J0 = −g2t . J0 / −1 is√\n1,0\n0,1\n1,0\n1,0\nd\nJ\n=\ng\nM\nJ\nmaps\nV\nto\nV\n.\nSo\nJ\n/\nVJ1,0\n−1 satisfies all the\n,\nJ\n=\ng\nJ\nmaps\nV\nto\nV\n,\nand\nt\n0\nt\n0\nt/2\nt/2\nt/2\nJ0\nJt\nJ0\nJt\ndt\n0\nrequirements that uniquely defines the parallel transport in V.\n\u0003\nCorollary A.2 If J, J ′ and J ′′ are\nsuch that J ′ bisects the segment between J\n√ three points on a geodesic\n1,0\n1,0\n′′\n′\n′′ ′\n′\nand J , then J J = J J and J / −1 , which maps VJ to VJ ′′ , is the parallel transport in V from J to\nJ ′′ along the geodesic.\n\nA.2\n\nComplex structures compatible with a symplectic or Euclidean structure\n\nGiven a symplectic form ω on V , a complex structure J on V is compatible to ω if ω(J*, J*) = ω(*, *)\nand ω(*, J*) > 0. (The second condition implies that the orientation defined by J coincides with that\nof the volume form ω n /n!.) Let Jω be the set of such J. The symplectic form defines an isomorphism\nν = νω : V → V ∗ by x ∈ V 7→ ιx ω ∈ V ∗ and a holomorphic involution s = sω on J by J 7→ ν −1 ◦ TJ ◦ ν.\nThe fixed-point set Js consists of J ∈ J satisfying ω(J*, J*) = ω(*, *). The connected components of Js ,\none of which is Jω , are labelled by the signature of the symmetric bilinear form ω(*, J*). Since s is an\nisometry, Js is a totally geodesic submanifold. In fact, Jω is a Kähler manifold since the pseudo-Kähler\nmetric η restricts to a positive-definite metric ηω on Jω . So the restriction σω of σ to Jω is a Kähler form.\nGiven J0 ∈ Jω , the whole space Jω can be parametrised by Z ∈ HomC (VJ1,0\n, VJ0,1\n). We denote by the same\n0\n0\n1,0 ∗\nC\n∗ C\nnotation ν : VJ0,1\n→\n(V\n)\nthe\nrestriction\nof\nthe\nisomorphism\nν\n:\nV\n→\n(V\n)\n.\nThen\nJ ∈ Js if and only if\nJ0\n0\n. The tangent space TJ0 Jω consists of Z satisfying\n)∗ , or equivalently, Z ◦ ν −1 ∈ Sym2 VJ0,1\nν ◦ Z ∈ Sym2 (VJ1,0\n0\n0\nthis condition. The condition\nω(*,\nJ*)\n>\n0\nis\nequivalent\nto\n1 − Z̄Z > 0 with respect to the Hermitian form\n√\n.\nThe\nsymplectic\ngroup Sp(V, ω) acts transitively on Jω and\nh0 (x, y) = ω(x, J0 ȳ) = − −1 ω(x, ȳ), x, y ∈ VJ1,0\n0\nthe isotropic subgroup at J0 is the unitary group U(V, h0 ). So Jω ∼\n= Sp(V, ω)/ U(V, h0 ). It can be identified\nholomorphically with a bounded Hermitian symmetric domain or with the Siegel upper-half space; the two\nare related by a Cayley transform.\nIf instead there is a Euclidean inner product g on V , let Jg be the set of complex structures J that is\ncompatible with g, i.e., g(J*, J*) = g(*, *), and the orientation on V . There is an isomorphism ν = νg : V → V ∗\ndefined by x ∈ V 7→ ιx g ∈ V ∗ and an involution s = sg : J 7→ ν −1 ◦ TJ ◦ ν on J. The fixed-point set is Js = Jg .\nAs s is an isometry, Jg is totally geodesic in J as in the symplectic case. Jg is Kähler since the restriction ηg\nof −η to Jg is positive definite; the restriction σg of −σ to Jg is the Kähler form. Given J0 ∈ Jg , we denote\n)∗ the restriction of ν : V C → (V ∗ )C . On the dense set of J that can be parametrised\n→ (VJ1,0\nalso by ν : VJ0,1\n0\n0\nV2 0,1\nV2 1,0 ∗\nVJ0 .\n(VJ0 ) , or equivalently, Z ◦ν −1 ∈\nby Z, J ∈ Jg if and only if the corresponding Z satisfies ν ◦Z ∈\nThe tangent space TJ0 Jg consists of Z satisfying this condition. For any such Z, we always have 1 − Z̄Z > 0\n. The group SO(V, g) acts transitively on\nwith respect to the Hermitian form h0 (x, y) = g(x, ȳ), x, y ∈ VJ1,0\n0\nSO(V,\ng)/ U(V, h0 ) is a compact Hermitian\nJg and the isotropic subgroup at J0 is U(V, h0 ). The space Jg ∼\n=\nsymmetric space. Finally, if in addition there is a symplectic form ω on V such that ω(*, J0 *) is proportional\nto g, then Jω and Jg intersects at J0 orthogonally with respect to the pseudo-Kähler metric η on J.\n\n13\n\n\fWe describe the results using tensor indices. Let {ei }1≤i≤n be a basis of VJ1,0\n. Then {ēī } is a basis of VJ0,1\n.\n0\n0\n\nWe represent Z ∈ HomC (VJ1,0\n, VJ0,1\n) by a matrix Zij̄ such that Zei = Zij̄ ēj̄ . If (V, ω) is a symplectic vector\n0\n0\n\nspace, we have ωīj = ω(ēī , ej ) = −ωj ī . Set Zij = (ν ◦ Z)ij = Zik̄ ωk̄j and Z īj̄ = (Z ◦ ν −1 )īj̄ = ω īk Zkj̄ . Then\nZ determines an element in Jω if and only if Zij = Zji (or Z īj̄ = Z j̄ ī ) and the matrix δij − Zik̄ Z̄k̄j is positive\ndefinite. If (V, g) is a Euclidean space instead, then gīj = g(ēī , ej ) = gj ī . Set Zij = (ν ◦ Z)ij = Zik̄ gk̄j and\n\nZ īj̄ = (Z ◦ ν −1 )īj̄ = g īk Zkj̄ . Then Z determines an element in Jg if and only if Zij = −Zji (or Z īj̄ = −Z j̄ ī ).\nIf there is a variation δJ of J ∈ J, then we have tensors (δP )ij̄ = −(δ P̄ )ij̄ and (δP )īj = −(δ P̄ )īj . We note\n\n1,0\nthat {ei + δei }, where δei = (δP )ij̄ ēj̄ , is a basis of the new holomorphic subspace VJ+δJ\n, whereas {ēī + δēī },\n\n0,1\nwhere δēī = (δ P̄ )ī j̄ ēj̄ = −(δP )ī j̄ ēj̄ , is a basis of VJ+δJ\n. If (V, ω) is symplectic and J ∈ Jω , then J + δJ ∈ Jω\n(to the first order) if and only if any of the tensors (δP )ij , (δP )ij , (δP )īj̄ , (δP )īj̄ is symmetric. If (V, g) is\nEuclidean and J ∈ Jg , then J + δJ ∈ Jg (to the first order) if and only if any of the above tensors is\nanti-symmetric.\nin both the symplectic and the orthogonal cases, we have\nChoosing a unitary basis {ei }1≤i≤n of VJ1,0\n0\n∼\nJω = Sp(2n, R)/ U(n) and Jg ∼\n= SO(2n)/ U(n), respectively, where J0 is identified with the coset o of the\nidentity element. Using the basis {ei , ēī } of V C , the Lie groups and/or their Lie algebras that appear in the\nabove identifications are\nn\u0010\no\nn\u0010\n\u0011\n\u0011\no\nU 0\nA 0\nT\nT\nU(n) =\nŪ U = In , u(n) =\nĀ = −A ,\n0\n\nsp(2n, R) =\n\nŪ\n\nn\u0010\n\nA\nB̄\n\nB\n\n\u0011\n\nĀ\n\nT\n\no\nĀ=−A,\n,\nT\nB=B\n\nso(2n) =\n\n0\n\nĀ\n\nn\u0010\n\nA\nB̄\n\nB\nĀ\n\n\u0011\n\nT\n\nĀ=−A,\n\nT\n\nB=−B\n\no\n\n,\n\nwhere U, A, B are n × n complex matrices. The following results on geodesics are well-known:\nProposition A.3 ([21, 14]) 1. A geodesic γ in Sp(2n, R)/ U(n) from o is of the form\nh \u0010\n\u0011\ni\ncosh Bt sinh Bt\nγ(t) = k\nk −1 ,\nsinh Bt\n\ncosh Bt\n\nwhere k ∈ U(n) and B = diag{b1 , * * * , br , 0, * * * , 0} for some b1 , . . . , br > 0, r ≤ n.\n2. A geodesic γ in SO(2n)/ U(n) from o is of the form\nh \u0010 cos √−B 2 t\nγ(t) = k √ B sin √−B 2 t\n−B 2\n\nn\u0010\n\n\u0011\n\u0010\nb1\n,*** ,\n\nwhere k ∈ U(n) and B = diag\n−br\n−b1\n√\ncase, −B 2 = diag{b1 , b1 , * * * , br , br , 0, * * * , 0}.)\n\nbr\n\n\u0011\n\n√\ni\nsin −B 2 t \u0011\n−1\n√\n,\nk\n2\ncos −B t\n\n√B\n\n−B 2\n\n, 0, * * * , 0\n\no\n\nfor some b1 , . . . , br > 0, r ≤ [n/2]. (In this\n\nProof: Writing sp(2n,\nR) = u(n)⊕m and so(2n) = u(n)⊕m, respectively, geodesics are of the form γ(t) = [etM ]\n\u0010\n′\u0011\n0 B\nfor some M =\n∈ m. Since TB ′ = ±B ′ , by Theorems 5 and 7 in [14], respectively, there exists an\n′\nB\n\n0\n\n′\nT\nn × n complex matrix U , T Ū U = In , such that\n\u0010B =\n\u0011 U B U , where B is of the required form. The results\nU 0\nthen follow from simple calculations with k =\n∈ U(n).\n\u0003\n0\n\nŪ\n\nWhen n = 1, Jω = J because every complex structure compatible with the orientation is compatible\nwith the symplectic form. Choosing a base vector e1 of the 1-dimensional vector space VJ1,0\n, Jω can be\n0\nparametrised by z = Z11̄ ∈ C such that |z| < 1, with z = 0 for J0 . The Kähler form and metric are,\nrespectively,\n√\n2 −1 dz ∧ dz̄\n4 dz dz̄\nσω =\n,\nηω =\n.\n(1 − |z|2 )2\n(1 − |z|2 )2\n√\n\nA geodesic through z = 0 is of the form z(t) = e −1 α tanh t (0 ≤ α < 2π), where t ∈ R is half of the arc-length\nparameter. For Euclidean space (V, g), the first non-trivial case is, when n = 2, Jω ∼\n= SO(4)/ U(2) = S 2 .\n1,0\nChoose a basis {e1 , e2 } of VJ0 such that g11̄ = g22̄ , g12̄ = g21̄ = 0. Then the dense subset Jω \\{−J0 } can be\n\u0010\n\u0011\nz\nparametrised by Z = −z , where z ∈ C. On Jω , the point −J0 (which would be z = ∞) is conjugate to\nJ0 (z = 0). The Kähler form and metric are, respectively,\n√\n4 dz dz̄\n2 −1 dz ∧ dz̄\n,\nηω =\n.\nσg =\n(1 + |z|2 )2\n(1 + |z|2 )2\n14\n\n\f√\n\nA geodesic through z = 0 is of the form z(t) = e −1 α tan t (0 ≤ α < 2π), where t ∈ R is half of the arc-length\nparameter. Note that z(t) = ∞ at t = π2 corresponds to the antipodal point −J0 of J0 .\n\nA.3\n\nCut and first conjugate loci in Jg\n\nGiven a point o in a Riemannian manifold M , the first conjugate point p of o along a geodesic γ from o is\na point such that there is a Jacobi field along γ that is zero at o and p but nowhere zero in between. The\ncollection of such points form the first conjugate locus of o. The cut point of o along a geodesic γ from o is\nthe point p such that γ is length-minimising between o and p but fails to be so beyond p. There is an open\ncell B in To M such that the exponential map is a diffeomorphism from B onto a (connected) open subset of\nM whose compliment is the cut locus of o. The image of the closure B̄ under the exponential map is M .\nWhile the structure of cut loci or first conjugate loci for general Riemannian manifolds is quite complicated\n(see for example [24]), there is a Lie-theoretical description for compact Riemannian symmetric spaces. For\nsimply connected symmetric spaces (such as the space Jg above), the cut locus and first conjugate locus\ncoincide [6], though this fails to be true in general [20]. For example, the cut and first conjugate loci of\nGrassmannian manifolds are known explicitly in terms of Schubert varieties [27] (see however Remark 4.3\nof [20]). We determine the cut (or the first conjugate) locus of Jg , which is the space of polarisations of\nfermionic systems.\nProposition A.4 Let J0 , J ∈ Jg . The following statements are equivalent:\n(a) J is on the\u0001 cut locus of J0 ;\n(b) det J02+J = 0;\n−1\n(c) the pairing between K−1\nJ0 and KJ is degenerate.\n, we have Jg ∼\nProof: Choosing a unitary basis {ei }1≤i≤n of VJ1,0\n= SO(2n)/ U(n). The geodesics from o\n0\nare given by Proposition A.3.2. Since k ∈ U(n) acts as an isometry, we can assume k = 1 as well as\nb1 ≥ * * * ≥ br > 0 without loss of generality. For any t, VJ1,0\nhas a unitary basis consisting of vectors\nt\n(t)\n\n(t)\n\n(t)\n\ne2i−1 = cos bi t e2i−1 − sin bi t ē2i , e2i = cos bi t e2i + sin bi t ē2i−1 (1 ≤ i ≤ r) and ej = ej (2r + 1 ≤ j ≤ n).\n(π/2b )\n\n1\n(a)⇒(b): The cut point of o along the above geodesic is at t = π/2b1 . It is clear that e1\n= −ē2̄ ∈\n\u0001\nJ\n+J\n0\n0,1\n1,0\nπ/2b1\nVJπ/2b ∩ VJ0 and hence det\n= 0.\n2\n1\n\u0001\n(b)⇒(a): Consider a geodesic γ from J0 to J of the above form. Then det J02+J = 0 implies that\nt = π/2bi for some i = 1, . . . , r. Assume i = 1. For 2 ≤ j ≤ r, let b′j be defined such that |b′j | ≤ b1 and b′j = bj\nn\u0010\n\u0011 \u0010\n\u0011\n\u0010\n\u0011\no\nb′2\nb′r\nb1\nmod 2b1 . Let γ ′ be the geodesic from o corresponding to B ′ = diag\n,\n,*** ,\n, 0, * * * , 0 .\n′\n′\n\nThen J = γ ′ (π/2b1 ) is the cut point of o along γ ′ .\n(t)\n(t)\n(b)⇔(c): Along the geodesic, let μt = e1 ∧ * * * ∧ en . Then\nhμ, μ0 i =\n\nr\nY\n\ncos2 bi = det\n\ni=1\n\n−b1\n\nJ0 +J\n2\n\n−b2\n\n−br\n\n\u0001\n\nand hence the result.\n\n\u0003\n\nCorollary A.5\n\u0001 If J ∈ Jg is not on the cut locus of J0 , then\n1. det J02+J > 0;\nq\nq\nq\n−1\nK\nK−1\nextends\ncontinuously\nto\na\nnon-degenerate\npairing\nbetween\nand\n2. the inner product on K−1\nJ .\nJ0\nJ0\nProof: Consider\n\u0001 the\nQr geodesic in the proof of Proposition A.4.\n1. det J02+J = i=1 cos2 bi > 0 if t < π/2bi for all i = 1, . . . , r.\nQr\n√ √\n2. Consider μt in the proof of Proposition A.4. The pairing is given by h μt , μ0 i = i=1 cos bi .\n\n15\n\n\u0003\n\n\fB\nB.1\n\nBerezin integral and the fermionic Bergman kernel\nCalculus of fermionic variables\n\nLet V be an n-dimensional\nV real vector space with a (non-zero) volume element ǫ = ǫV ∈\nintegral of a form α ∈ • (V ∗ )C on V is\nZ\nα ǫV = hα(n) , ǫV i,\n\nVn\n\nV . The Berezin\n\nΠV\n\nwhere the pairing is between the top-degree component α(n) and ǫV . To highlight its formal similarity with\nthe usual integration, the Berezin integral is often expressed, as in the physics literature, as an \"integration\"\nover fermionic variables. While the setting is well known, we recall it here to fix the sign convention. For\na standard reference, see for example, §1.4-7 of [30]. For a mathematical treatment of graded manifolds or\nsupermanifolds, especially in the context of geometric quantisation, see [17].\nWe imagine a copy ΠV of the vector space that is identical as V except it has fermionic coordinates,\nwhich are \"numbers\" satisfying the same law of addition but anti-commute when they are multiplied. If we\nchoose a basis {ei }1≤i≤n of V , then a \"vector\" θ ∈ ΠV has the form θ = θi ei , where θ1 , . . . , θn the fermionic\ncoordinates. Although\ndoes not exist as a set of points, the \"functions\" on ΠV are elements of the\nV• ∗ ΠV\n(V )C . In fact, any form\nexterior algebra\nα=\n\nn\nX\n\nX\n\nk=0 1≤i1 <***<ik ≤n\n\nαi1 ...ik ei1 ∧ * * * ∧ eik\n\non V determines a \"function\"\nα(θ) =\n\nn\nX\n\nX\n\nk=0 1≤i1 <***<ik ≤n\n\nαi1 ...ik θi1 * * * θik\n\non ΠV . The \"derivative\" of such functions corresponds the usual contraction on forms:\n∂\nα(θ) = (ιei α)(θ).\n∂θi\nSuppose the basis {ei } spans a unit volume, i.e., ǫ = e1 ∧ * * * ∧ en . The volume element provides a \"measure\"\nǫ(θ) = dθ1 * * * dθn on ΠV . The fermionic integral is defined by\nZ\nZ\nn(n−1)\nα12...n θ1 * * * θn dθ1 * * * dθn = (−1) 2 α12...n .\nα(θ) ǫ(θ) =\nΠV\n\nΠRn\n\nThis differs from the Berezin integral by a sign because dθi also anti-commutes with θj . As a useful example,\nwe calculate\nZ\nZ\nZ\nZ\n√\n√\n√\n1 2√\n(1 + −1 aθ1 θ2 ) −1 dθ1 dθ2 = a\nθ1 dθ1\nθ2 dθ2 = a,\ne −1 aθ θ −1 dθ1 dθ2 =\nΠR2\n\nΠR2\n\nΠR\n\nΠR\n\nwhere a ∈ R.\nSuppose V is even dimensional,\nsay dim V = 2n. Let g be a Euclidean metric on V and ǫ = ǫg , a unit\n√\nvolume element. Set ǫ̃g = −1 n ǫg .\nLemma B.1 If A ∈ End(V ) is skew-symmetric with respect to g, then\nZ\n√\n−1\ne 2 g(Aθ,θ) ǫ̃g (θ) = Pf(A).\nΠV\n\nProof: We choose an orthonormal basis of V so that A decomposes as a direct sum of 2 × 2 skew-symmetric\nmatrices. The result then follows from the example computed above.\n\u0003\nNow assume that J is a complex structure on V compatible with g and the orientation given by ǫg . If A\nis invertible and if A and J are in the same connected component of invertible, skew-symmetric operators\non V , then\nPf(A) = (det A)1/2 ,\nwhere the square root is chosen so that (det J)1/2 = 1. Compare this with the usual Gaussian integral in\nthe proof of Theorem 2.5.1, in which A is symmetric and the determinant factor (det A)1/2 appears in the\ndenominator.\n\n16\n\n\fB.2\n\nThe fermionic Bergman kernel and projection\n\nWe work with the pre-quantum data of the fermionic system in §3.1: a real Euclidean space (V, g) of\ndimension 2n with a complex structure J compatible with g and a unit volume element ǫg which agrees with\nthe orientation of J. Choosing a basis {ei }1≤i≤n of VJ1,0 , we have complex fermionic coordinates θ1 , . . . , θn\nof θ ∈ ΠVJ1,0 or ΠV . An element ψ in the pre-quantum Hilbert space H0 can be regarded as a \"function\"\nψ(θ, θ̄) of θi and θ̄ī (1 ≤ i ≤ n). The covariant derivative along ei and ēj̄ are, respectively,\n∇i =\nwhere g(θ, θ̄) = gij̄ θi θ̄j̄ . Any ψ = e\n\n∂\n∂θ i\n\n√\n−1\n2\n\n−\n\n̟J\n\n1\n2\n\ngij̄ θ̄j̄ ,\n\n∇j̄ =\n\n∂\n∂ θ̄ j̄\n\n−\n\n1\n2\n\ngij̄ θi ,\n\n∧ φ ∈ HJ can be written as (cf. Theorem 3.1.1)\n1\n\nψ(θ, θ̄) = φ(θ) e− 2 g(θ,θ̄) ,\nwhere φ(θ)\nis a \"holomorphic function\",\nthat is, it depends on θi only. By Theorem 3.1.2, the inner product\n√\n√\n−1\n−1\nof ψ = e 2 ̟J ∧ φ and ψ ′ = e 2 ̟J ∧ φ′ in HJ is\nZ\nhψ, ψ ′ i =\nφ(θ)∗ φ′ (θ) e−g(θ,θ̄) ǫ̃g (θ).\nΠV\n\n∗\n\nHere φ(θ) is obtained from φ(θ) by complex conjugation and reversing the order in the multiplication, i.e.,\n(θi1 * * * θik )∗ = θ̄īk * * * θ̄ī1 ,\n\n1 ≤ i1 < * * * < ik ≤ n, 0 ≤ k ≤ n.\n\nThe formula bears a formal resemblance with that in Proposition 2.1.2 of the bosonic case. Moreover, the\nprojection from H0 to HJ is given by the fermionic counterpart of the Bergman kernel.\nProposition B.2 The orthogonal projection from ψ ∈ H0 onto HJ is\nZ\n1\n− 21 g(θ,θ̄)\neg(θ,χ̄)− 2 g(χ,χ̄) ψ(χ, χ̄) ǫ̃(χ).\nψ(θ, θ̄) 7−→ e\nΠV\n\nProof: Suppose the basis is unitary, i.e., g(ei , ēj̄ ) = δij . We write θχ̄ = θ1 χ̄1̄ + * * * + θn χ̄n̄ for two fermionic\nvectors ψ, χ in ΠV . The fermionic measure can be written as\nǫ̃(θ) = dθ1 dθ̄1̄ * * * dθn dθ̄n̄ = dθdθ̄.\n1\n\nIt is easy to check that HJ has an unitary basis {θi1 * * * θik e− 2 θθ̄ | 0 ≤ k ≤ n, 1 ≤ i1 < * * * < ik ≤ n}. So the\nBergman kernel that produces the orthoganal projection from H0 to HJ is\n1\n\n1\n\nK(θ, χ̄) = e− 2 θθ̄− 2 χχ̄\n\nn\nX\n\n1\n\nX\n\nk=0 1≤i1 <***<ik ≤n\n\n1\n\nθi1 * * * θik χ̄īk * * * χ̄ī1 = eθχ̄− 2 θθ̄− 2 χχ̄ .\n\u0003\n\nA fermionic coherent state cα\nJ is of the form\ncα\nJ (θ) = exp[g(θ, ᾱ) −\n\n1\n2\n\ng(θ, θ̄)],\n\nwhere α ∈ ΠVJ1,0 is a fermionic parameter. The above projection can be written as\nZ\n1\ncθJ (χ)∗ ψ(χ, χ̄) ǫ̃(χ).\nψ(θ, θ̄) 7−→ e− 2 g(θ,θ̄)\nΠV\n\n√\nFinally, we find the relation to real fermionic coordinates. Let θ0 = θ + θ̄ ∈ ΠV . We have 2 √−1 g(θ, θ̄) =\n−1\n̟J (θ0 , θ0 ), which we write as ̟J (θ0 ) for short. Then the fermionic Gaussian factor becomes e 4 ̟J (θ0 ) .\n\n17\n\n\fC\nC.1\n\nInvariant real, complex and quaternionic structures\nRepresentations of real and quaternionic types\n\nLet W be a finite-dimensional complex vector space. An operator C : W → W is conjugate linear if C is\nreal linear and C(ax) = ā(Cx) for all a ∈ C, x ∈ W . Such operators are in HomC (W, W̄ ), where W̄ the\ncomplex vector space which is equal to W as an Abelian group but whose scalar multiplication is given by\n(a, x) ∈ C×W 7→ āx ∈ W . A real structure on W is a conjugate-linear operator R on W such that R2 = idW .\nSuch an R determines a real vector space W0 = W R ⊂ W fixed by R and W ∼\n= (W0 )C as complex vector\nspaces. A quaternionic structure on W is a conjugate-linear operator Q on W such that Q2 = − idW . This\nmakes W a quaternionic vector space whith the scalar multiplication (a + bj, x) ∈ H × W 7→ ax + bQx ∈ W\n(where a, b ∈ C).\nSuppose a group K acts on W by a complex representation. The representation is of real type if there is\na K-invariant real structure on W . Such a representation is the complexification of a real representation of\nK on W0 . The representation is of quaternionic type if there is a K-invariant quaternionic structure on W .\nSuch a representation is quaternionic-linear with the above scalar multiplication by H. We refer the reader\nto [4] for the standard properties of real- and quaternionic-type representations. We collect here some more\nresults that will be used in §C.2.\nUnless stated otherwise, we assume from now on that K is a finite group or a compact Lie group. By\naveraging over K, there is a K-invariant Hermitian form h : W × W̄ → C on W . Our convention of Hermitian\nforms on W is that they are complex linear in the first variable but conjugate linear in the second. (However,\nwe took the opposite convention of physicists for pre-quantum or quantum Hilbert spaces.)\nLemma C.1 Consider a representation of K on a complex vector space W . Then\n1. the representation is of real (quaternionic, respectively) type if and only if there is a non-degenerate Kinvariant symmetric (skew-symmetric, respectively) bilinear form on W ;\n2. there is a non-zero sub-representation W ′ ⊂ W of real (quaternionic, respectively) type if and only if there\nis a non-zero K-invariant symmetric (skew-symmetric, respectively) bilinear form on W .\nProof: Part 1 is well known; see for example Proposition II.6.4 in [4] or the proof of Lemma C.2 below. Part 2\nfollows immediately by taking W ′ as the orthogonal complement (with respect to a K-invariant Hermitian\nform) of the kernel of the bilinear form.\n\u0003\nLemma C.2 Under the same conditions as in Lemma C.1, suppose h is a K-invariant Hermitian form\non W . If the representation of K on W is of real (quaternionic, respectively) type, then there is a Kinvariant real structure R (quaternionic structure Q, respectively) on W such that h(Rx, Ry) = h(y, x)\n( h(Qx, Qy) = h(y, x), respectively) for all x, y ∈ W .\n\nProof: Suppose C0 is a K-invariant real (quaternionic, respectively) structure on W . Then C02 = ǫ idW , where\nǫ = ±1, respectively. Consider the complex bilinear form β on W given by β(x, y) = h(x, C0 y) + ǫ h(y, C0 x),\nwhere x, y ∈ W . Then β is symmetric (skew-symmetric, respectively) when ǫ = ±1. Moreover, β is nondegenerate as β(C0 x, x) = h(x, x) + h(C0 x, C0 x) for any x ∈ W . Following the proof of Proposition II.6.4\nin [4], we define an invertible, conjugate-linear operator C on W by β(x, y) = h(x, Cy), x, y ∈ W . Then\nh(C 2 x, y) = ǫ h(Cy, Cx) = h(x, C 2 y). Consequently, ǫ C 2 is self-adjoint and positive definite with respect\nto h. The space W decomposes as a direct sum of eigenspaces of ǫ C 2 , each of which is K-invariant since\nC 2 is so. Without loss of generality, assume that W is the eigenspace of ǫ C 2 of a single eigenvalue λ > 0.\nSince C 2 = ǫλ idW and λh(x, y) = h(Cy, Cx) for all x, y ∈ W , λ−1/2 C is the desired real (quaternionic,\nrespectively) structure on W when ǫ = ±1.\n\u0003\n\nThe results in Lemma C.2 can also be explained in matrix language; we do so when the representation is\nof real type. Choosing a real basis of the real subspace W0 , the Hermitian form h corresponds to a positive\ndefinite Hermitian matrix H. There is a unitary matrix U such that D = TU H Ū is a diagonal matrix\nof positive entries. With the representation of K, U can be chosen to commute with K. Let R = U TU .\nSince RR̄ is the identity matrix, R defines a real structure on W . The result follows form the identity\nT\nRH R̄ = U DTŪ = H̄.\n\nC.2\n\nComplex structures invariant under a representation\n\nIf V is a real vector space and J is a complex structure on V , we denote by (V, J) the\n√ complex vector space\nwhose underlying real vector space is V and on which the scalar multiplication by −1 is the action of J.\n18\n\n\f1,0\nClearly, (V, J) ∼\n= VJ as complex vector spaces. Let K be a finite or a compact Lie group. A presentation\nof K on V is a complex representation on (V, J) if and only if J ∈ J is invariant under K.\n\nProposition C.3 1. Suppose (V, ω) is a symplectic vector space and J ∈ Jω . If a representation of K\non (V, J) is of real type and preserves ω, then there is a K-invariant real structure R on (V, J) such that\nω(Rx, Ry) = −ω(x, y) for all x, y ∈ V .\n2. Suppose (V, g) is an oriented Euclidean vector space of even dimension and J ∈ Jg . If a representation\nof K on (V, J) is of quaternionic type and preserves g, then there is a K-invariant quaternionic structure Q\non (V, J) such that g(Qx, Qy) = g(x, y) for all x, y ∈ V .\n√\nProof: 1. Let h(x, y) =√ω(x, Jy) − −1 ω(x, y), x, y ∈ V . Then h is a K-invariant Hermitian form, as\nh(Jx, y) = −h(x, Jy) = −1 h(x, y). By Lemma C.2, there is a K-invariant real structure R on (V, J) (i.e.,\nRJ = −JR, R2 = idV ) such\n√ that h(Rx, Ry) = h(y, x). This is equivalent to ω(Rx, Ry) = −ω(x, y).\n2. Let h(x, y)√= g(x, y) − −1 g(Jx, y), x, y ∈ V . Then h is a K-invariant Hermitian form, as h(Jx, y) =\n−h(x, Jy) = −1 h(x, y). By Lemma C.2, there is a K-invariant quaternionic structure Q on (V, J) (i.e.,\nQJ = −JQ, Q2 = − idV ) such that h(Qx, Qy) = h(y, x). This is equivalent to g(Qx, Qy) = g(x, y).\n\u0003\n\nSince the group K acts on Jω (Jg , respectively) by isometry, the fixed-point set (Jω )K ((Jg )K , respectively)\nis a totally geodesic submanifold.\n\nProposition C.4 1. Suppose J0 ∈ Jω is preserved by a symplectic representation of K on (V, ω). Then\n1,0\nTJ0 (Jω )K ∼\n= (Sym2 (VJ0 ))K . Moreover, the following statements are equivalent:\n(a) (Jω )K contains a point other than J0 ;\n(b) (Sym2 (VJ1,0\n))K 6= {0};\n0\n(c) there is a non-zero complex sub-representation (V ′ , J0 ) of (V, J0 ) of real type.\nIn this case, V ′ can be chosen as a symplectic subspace and there is a K-invariant real structure R on (V ′ , J0 )\nsuch that ω(Rx, Ry) = −ω(x, y) for all x, y ∈ V ′ .\n2. Suppose J0 ∈ Jg is preserved by an orthogonal representation of K on (V, g). Then TJ0 (Jg )K ∼\n=\nV\nK\n))\n.\nMoreover,\nthe\nfollowing\nstatements\nare\nequivalent:\n( 2 (VJ1,0\n0\n(a) (Jg )K is not a discrete set;\nV2\n))K 6= {0};\n(b) ( (VJ1,0\n0\n(c) there is a non-zero complex sub-representation (V ′ , J0 ) of (V, J0 ) of quaternionic type.\nIn this case, there is a K-invariant quaternionic structure Q on (V ′ , J0 ) such that g(Qx, Qy) = g(x, y) for\nall x, y ∈ V ′ .\nProof: 1. The result on the tangent space follows from §A.2. Since Jω is also K-equivariantly diffeomorphic to\n), the equivalence of (a) and (b) is clear. The equivalence with (c) is a consequence of Lemma C.1.2\nSym2 (VJ1,0\n0\nand the rest follows from Proposition\nC.3.1.\nV2\nK\n))\nglobally, the latter is isomorphic to the tangent space TJ0 (Jg )K , which\n2. Although (Jg )K is not ( (VJ1,0\n0\nK\nis zero if and only if (Jg ) is a discrete set. The rest of the proof is similar to that of part 1.\n\u0003\nBy compactness, the set (Jg )K is finite if it is discrete. When K is a compact torus group, the number\nof elements in (Jg )K is equal to the Euler characteristic χ(Jg ) = 2n−1 . (This is the quotient of the order of\nthe Weyl group of SO(2n) by that of U(n).) For example, Jg ∼\n= S 2 when n = 2. If K = S 1 acts on C2 with\nK\nweights 1 and −1, then the fixed-point set in Jg is (Jg ) = {±J0 }, whose cardinal is 2 = χ(S 2 ).\nAcknowledgments. Part of the work has been reported at various conferences, in Oberwolfach (2004),\nSendai (2005), Tianjin (2005), Hong Kong (2006). The author thanks W. D. Kirwin, N. Mok and R. Sjamaar for helpful discussions. The work is supported in part by CERG HKU705407P, Fondation Sciences\nMathématiques de Paris and Université Paris–Diderot (Paris 7).\n\nReferences\n[1] S. Axelrod, S. Della Pietra and E. Witten, Geometric quantization of Chern-Simons gauge theory, J.\nDiff. Geom. 33 (1991) 787-902\n[2] P. Baguis and T. Stavracou, Marsden-Weinstein reduction on graded symplectic manifolds, J. Math.\nPhys. 38 (1997) 1670-1684, arXiv:math.SG/0109119\n\n19\n\n\f[3] N. Berline, E. Getzler and M. Vergne, Heat kernels and Dirac operators, Grund. der Math. Wissen.\nvol. 298, Springer, Berlin (1992)\n[4] T. Bröcker and T. tom Dieck, Representations of compact Lie groups, Grad. Text Math. vol. 98, Springer,\nBerlin, NewYork (1985)\n[5] C. Chevalley, The algebraic theory of spinors, Columbia Univ. Press, New York (1954)\n[6] R. Crittenden, Minimum and conjugate points in symmetric spaces, Canad. J. Math. 14 (1962) 320-328\n[7] A. Crumeyrolle, Algèbre de Clifford symplectique, revêtements du groupe symplectique, indices de Maslov\net spineurs symplectiques, J. Math. Pures Appl. 56 (1977) 205-230\n[8] I. Daubechies, Coherent states and projective representation of the linear canonical transformations, J.\nMath. Phys. 21 (1980) 1377-1389\n[9] C. Florentino, P. Matias, J. Mourão and J. P. Nunes, On the BKS pairing for Kähler quantizations for\nthe cotangent bundle of a Lie group, J. Func. Anal. 234 (2006) 180-198, arXiv:math.DG/0411334\n[10] V. L. Ginzburg and R. Montgomery, Geometric quantization and no-go theorems, in: Poisson geometry\n(Warsaw, 1998), Banach Center Publ., 51, eds. J. Grabowski and P. Urbański, Polish Acad. Sci. Warsaw\n(2000), pp. 69-77, arXiv:dg-ga/9703010\n[11] B. C. Hall, Geometric quantization and the generalized Segal-Bargmann transform for Lie groups of\ncompact type, Comm. Math. Phys. 226 (2002) 233-268, arXiv:quant-ph/0012105\n[12] B. C. Hall and W. D. Kirwin, Unitarity in \"quantization commutes with reduction\", Commun. Math.\nPhys. 275 (2007) 401-422, arXiv:math.SG/0610005\n[13] N. J. Hitchin, Flat connections and geometric quantization, Commun. Math. Phys. 131 (1990) 347-380\n[14] L.-K. Hua, On the theory of automorphic functions of a matrix variable I–geometrical basis, Amer. J.\nMath. 66 (1944) 470-488\n[15] W. D. Kirwin and S. Wu, Geometric quantization, parallel transport and the Fourier transform, Commun. Math. Phys. 266 (2006) 577–594, arXiv:math.SG/0409555\n[16] B. Kostant, Symplectic spinors, in: Symposia Mathematica, Vol. XIV (Convegno di Geometria Simplettica e Fisica Matematica, INDAM, Rome, 1973), Academic Press, London (1974), pp. 139-152\n[17] B. Kostant, Graded manifolds, graded Lie theory, and prequantization, in: Differential geometrical\nmethods in mathematical physics (Proc. Sympos., Univ. Bonn, Bonn, 1975), Lecture Notes in Math.,\n570, eds. K. Bleuler and A. Reetz, Springer, Berlin (1977), pp. 177-306\n[18] J. von Neumann, Die Eindeutigkeit der Schrödingerschen Operatoren, Math. Ann. 104 (1931) 570-578\n[19] K. Nomizu, Invariant affine connections on homogeneous spaces, Amer. J. Math. 76 (1954) 33-65\n[20] T. Sakai, On cut loci of compact symmetric spaces, Hokkaido Math. J. 6 (1977) 136-161\n[21] C. L. Siegel, Symplectic geometry, Amer. J. Math. 65 (1943) 1-86\n[22] R. Sjamaar, Holomorphic slices, symplectic reduction and multiplicities of representations, Ann. Math.\n141 (1995) 87-129, arXiv:alg-geom/9304004\n[23] R. Sjamaar and E. Lerman, Stratified symplectic spaces and reduction, Ann. Math. 134 (1991) 375-422\n[24] A. D. Weinstein, The cut locus and conjugate locus of a riemannian manifold, Ann. Math. 87 (1968)\n29-41\n[25] E. Witten, Quantization of Chern-Simons gauge theory with complex gauge group, Commun. Math.\nPhys. 137 (1991) 29-66\n[26] E. Witten, Quantum background independence in string theory, preprint IASSNS-HEP-93/29 (1993),\narXiv:hep-th/9306122\n[27] Y.-C. Wong, Conjugate loci in Grassmann manifolds, Bull. Amer. Math. Soc. 74 (1968) 240-245\n[28] N. M. J. Woodhouse, Geometric quantization and the Bogoliubov transformation, Proc. Royal Soc.\nLondon A 378 (1981) 119-139\n[29] N. M. J. Woodhouse, Geometric quantization (2nd ed.), Oxford Univ. Press, Inc., Oxford, New York\n(1992)\n[30] J. Zinn-Justin, Quantum field theory and critical phenomena (4th ed.), Oxford Univ. Press, Inc., Oxford,\nNew York (2002)\n\n20\n\n\f"}