{"id": "http://arxiv.org/abs/0910.1550v1", "guidislink": true, "updated": "2009-10-08T19:19:47Z", "updated_parsed": [2009, 10, 8, 19, 19, 47, 3, 281, 0], "published": "2009-10-08T19:19:47Z", "published_parsed": [2009, 10, 8, 19, 19, 47, 3, 281, 0], "title": "Probing Yukawian gravitational potential by numerical simulations. I.\n  Changing N-body codes", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0910.2381%2C0910.4180%2C0910.3703%2C0910.5742%2C0910.0192%2C0910.4243%2C0910.5542%2C0910.1399%2C0910.3547%2C0910.2817%2C0910.4073%2C0910.1735%2C0910.2274%2C0910.3640%2C0910.0330%2C0910.4538%2C0910.1412%2C0910.1013%2C0910.3573%2C0910.3003%2C0910.1804%2C0910.1361%2C0910.0974%2C0910.3828%2C0910.1417%2C0910.1602%2C0910.5469%2C0910.3792%2C0910.3567%2C0910.1950%2C0910.3492%2C0910.4722%2C0910.2493%2C0910.5091%2C0910.4701%2C0910.1119%2C0910.0026%2C0910.1981%2C0910.2805%2C0910.5901%2C0910.0773%2C0910.4179%2C0910.2598%2C0910.1423%2C0910.2409%2C0910.4753%2C0910.4991%2C0910.2201%2C0910.1371%2C0910.2032%2C0910.4006%2C0910.3591%2C0910.5684%2C0910.0280%2C0910.1550%2C0910.5603%2C0910.2639%2C0910.2059%2C0910.1456%2C0910.4296%2C0910.3967%2C0910.4917%2C0910.0805%2C0910.4843%2C0910.3214%2C0910.0700%2C0910.1782%2C0910.2149%2C0910.5926%2C0910.3686%2C0910.1414%2C0910.4676%2C0910.1703%2C0910.2641%2C0910.2147%2C0910.0666%2C0910.2441%2C0910.2083%2C0910.4848%2C0910.1744%2C0910.3662%2C0910.0486%2C0910.4672%2C0910.2050%2C0910.2500%2C0910.4178%2C0910.1997%2C0910.4972%2C0910.2626%2C0910.3944%2C0910.5265%2C0910.2633%2C0910.2930%2C0910.5814%2C0910.3044%2C0910.2649%2C0910.2882%2C0910.0586%2C0910.4041%2C0910.4970%2C0910.5336&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Probing Yukawian gravitational potential by numerical simulations. I.\n  Changing N-body codes"}, "summary": "In the weak field limit general relativity reduces, as is well known, to the\nNewtonian gravitation. Alternative theories of gravity, however, do not\nnecessarily reduce to Newtonian gravitation; some of them, for example, reduce\nto Yukawa-like potentials instead of the Newtonian potential. Since the\nNewtonian gravitation is largely used to model with success the structures of\nthe universe, such as for example galaxies and clusters of galaxies, a way to\nprobe and constrain alternative theories, in the weak field limit, is to apply\nthem to model the structures of the universe. In the present study, we consider\nhow to probe Yukawa-like potentials using N-body numerical simulations.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0910.2381%2C0910.4180%2C0910.3703%2C0910.5742%2C0910.0192%2C0910.4243%2C0910.5542%2C0910.1399%2C0910.3547%2C0910.2817%2C0910.4073%2C0910.1735%2C0910.2274%2C0910.3640%2C0910.0330%2C0910.4538%2C0910.1412%2C0910.1013%2C0910.3573%2C0910.3003%2C0910.1804%2C0910.1361%2C0910.0974%2C0910.3828%2C0910.1417%2C0910.1602%2C0910.5469%2C0910.3792%2C0910.3567%2C0910.1950%2C0910.3492%2C0910.4722%2C0910.2493%2C0910.5091%2C0910.4701%2C0910.1119%2C0910.0026%2C0910.1981%2C0910.2805%2C0910.5901%2C0910.0773%2C0910.4179%2C0910.2598%2C0910.1423%2C0910.2409%2C0910.4753%2C0910.4991%2C0910.2201%2C0910.1371%2C0910.2032%2C0910.4006%2C0910.3591%2C0910.5684%2C0910.0280%2C0910.1550%2C0910.5603%2C0910.2639%2C0910.2059%2C0910.1456%2C0910.4296%2C0910.3967%2C0910.4917%2C0910.0805%2C0910.4843%2C0910.3214%2C0910.0700%2C0910.1782%2C0910.2149%2C0910.5926%2C0910.3686%2C0910.1414%2C0910.4676%2C0910.1703%2C0910.2641%2C0910.2147%2C0910.0666%2C0910.2441%2C0910.2083%2C0910.4848%2C0910.1744%2C0910.3662%2C0910.0486%2C0910.4672%2C0910.2050%2C0910.2500%2C0910.4178%2C0910.1997%2C0910.4972%2C0910.2626%2C0910.3944%2C0910.5265%2C0910.2633%2C0910.2930%2C0910.5814%2C0910.3044%2C0910.2649%2C0910.2882%2C0910.0586%2C0910.4041%2C0910.4970%2C0910.5336&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In the weak field limit general relativity reduces, as is well known, to the\nNewtonian gravitation. Alternative theories of gravity, however, do not\nnecessarily reduce to Newtonian gravitation; some of them, for example, reduce\nto Yukawa-like potentials instead of the Newtonian potential. Since the\nNewtonian gravitation is largely used to model with success the structures of\nthe universe, such as for example galaxies and clusters of galaxies, a way to\nprobe and constrain alternative theories, in the weak field limit, is to apply\nthem to model the structures of the universe. In the present study, we consider\nhow to probe Yukawa-like potentials using N-body numerical simulations."}, "authors": ["C. S. S. Brandao", "J. C. N. de Araujo"], "author_detail": {"name": "J. C. N. de Araujo"}, "author": "J. C. N. de Araujo", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/s10714-009-0879-6", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0910.1550v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0910.1550v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "17 pages, 11 figures. To appear in General Relativity and Gravitation", "arxiv_primary_category": {"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.IM", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0910.1550v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0910.1550v1", "journal_reference": "Gen.Rel.Grav.42:777-793,2010", "doi": "10.1007/s10714-009-0879-6", "fulltext": "General Relativity and Gravitation manuscript No.\n(will be inserted by the editor)\n\nProbing Yukawian gravitational potential by Numerical\nSimulations. I. Changing N-Body Codes\n\narXiv:0910.1550v1 [astro-ph.GA] 8 Oct 2009\n\nC. S. S. Brandao * J. C. N. de Araujo\n\nReceived: date / Accepted: date\n\nAbstract In the weak field limit general relativity reduces, as is well known, to the\nNewtonian gravitation. Alternative theories of gravity, however, do not necessarily\nreduce to Newtonian gravitation; some of them, for example, reduce to Yukawa-like\npotentials instead of the Newtonian potential. Since the Newtonian gravitation is\nlargely used to model with success the structures of the universe, such as for example\ngalaxies and clusters of galaxies, a way to probe and constrain alternative theories, in\nthe weak field limit, is to apply them to model the structures of the universe. In the\npresent study we consider how to probe Yukawa-like potentials using N -body numerical\nsimulations.\nPACS 04.50.+h, 04.50.Kd, 45.50.-j\n\n1 Introduction\nEinstein's General Relativity (GR) is one of the most beautiful theories ever imagined\nby the human mind. Although GR is a successful theory of gravitation, it is unable to\nexplain, for example, the accelerating expansion of the universe, unless a cosmological\nconstant or a dark energy fluid is considered. Nowadays other theories of gravitation\nintend to give an alternative interpretation to this accelerating expansion (see, e.g.,\n[1]). Most of these alternative theories, although having different approaches (some\nscalar-tensor theories of gravitation, nonsymmetric gravitational theory, etc), reduce,\nin the weak-field limit, to a Yukawa-like gravitational potential (hereafter YGP), i.e.,\nφ(r) = −\n\nGM −r/λ\ne\n.\nr\n\nC. S. S. Brandao * J. C. N. de Araujo\nDivisão de Astrofı́sica\nInstituto Nacional de Pesquisas Espaciais\nAvenida dos Astronautas 1758\nSão José dos Campos - 12227-010 SP - Brazil\nTel.: +55-12-39457200\nFax: +55-12-39456811\nE-mail: claudio@das.inpe.br, jcarlos@das.inpe.br\n\n(1)\n\n\f2\n\nThe above equation gives the potential of a point mass m at a distance r; G is the\nuniversal gravitational constant and λ is a constant. When λ → ∞, this potential tends\nto the Newtonian one. Note that the parameter λ is the Compton wavelength of the\nexchange particle, which in the present case is a graviton. The graviton mass is related\nto λ through the well known equation mg = h/λc, where h is the Planck constant and\nc is the speed of light.\nThe YGP has been investigated in the literature, in particular, in galactic\nastronomy and cosmology. For example, Signore [2] studies this potential under\nthe cosmological context, on the other hand, de Araujo & Miranda [3] study how\nvariations of the λ parameter can disturb galactic disks. This last study generalizes\nthe (Newtonian) Toomre's [4] expressions for rotation curves in order to account for a\nYGP. Rodriguez-Meza et al. [5] consider the YGP as a correction on the Newtonian\npotential.\nRecently, some numerical approaches have been developed to study alternative\ntheories. Cervantes-Cota et al. [6, 7] have developed numerical studies of a scalar-tensor\ntheory in the weak field limit, using the N -body method. In these studies they consider\nthat the gravitational potential in the weak field limit is given by\nΦST T = φN (r) + αφ(r)/(1 + α) ,\nwhere ΦST T is the potential from the scalar-tensor theory, φN (r) is the Newtonian\npotential, φ(r) is given by Eq.(1), and α ≡ 1/(3 + 2ω), with ω being the BransDicke parameter [8]. They changed a particular N -body code replacing the Newtonian\npotential by the potential ΦST T and analyzed its influence on isolated galaxies, two\ncolliding spiral galaxies and issues concerning the formation of bars. Simulations of\ncosmological structure formation in ΛCDM scenarios are also studied.\nIn the present paper, we use similar techniques to that used by Cervantes et al. [6,\n7], although with a gravitational potential derived from other theories. We modify a\npopular N -body code, Gadget-2 [9], replacing the Newtonian potential by a pure YGP\nas given by Equation 1, which is derived from some alternative theories of gravitation\n(see, e.g., Visser's theory [10]).\nIt is worth stressing that although we have chosen a particular gravitational\npotential, the approach considered here can be applied to any alternative gravitational\npotential.\nThis paper is organized as follows: in section 2, we show the changes made in the\nGadget-2 code, in section 3, we test the YGP Gadget-2 code using a pair of particles\nand N -body systems. Finally, in section 4, we present the conclusions and briefly discuss\nhow this modified code can be used to test alternative theories of gravitation via galactic\ndynamics.\n\n2 Changing the Gadget-2 Code\nGadget-2 code is a new massively parallel TreeSPH Code, designed to simulate the\nevolution of N -body collisionless systems, like, e.g., cosmological fluids, interacting\ngalaxies, etc. It was developed to work with the concept of particles: matter distribution\nis represented by a system of particles, where each particle has position, velocity, label,\ngravitational potential, density (if it represents a gas), and so on.\nGadget-2 uses an advanced system of processor's communication, based on MPI\ninterface. MPI is a computer implementation that allows many computers to work in\n\n\f3\n\nparallel. Thus, one can simulate from thousand of particles using desktops machines\nto billions of particles using supercomputers. This code computes quickly many\ngravitational forces using a hierarchical tree algorithm, like the Barnes' Tree Code\n[11], grouping distant particles into larger cells and computing their total potential\nby multipole expansions. This method is very efficient and the computational effort\nis O(N log N ) interactions, faster than the N 2 interactions from direct sum method.\nGadget-2 also computes gravitational potentials using particle-mesh (PM) method,\nwhen cosmological simulations are considered. In this case, the so called \"long range\"\npotentials are calculated by the PM method, which computes potentials in the Fourier\nspace using the mesh method. On the other hand, the \"short range\" potentials are\ncalculated in real space using the tree algorithm.\nIt is worth stressing another very important characteristic of the Gadget-2 code:\nits capability to integrate the equations of motion of particles with a leapfrog integrator\nbased on the the KDK scheme (KDK means kick-drift-kick, see [9]), which conserves the\nsymplectic nature of collisionless systems, in other words, it preserves the Hamiltonian\nstructure of these simulated systems. This approach is more efficient than other ones\nif applied with the adaptive timestep method, as shown by Springel [9]. In this way,\nGadget-2 is in general more efficient than codes based on the Runge-Kutta integrators.\nIt is worth mentioning that Gadget-2 offers a set of options: pure newtonian\nsimulations, cosmological comoving periodic simulation with the alternative use of\nthe TreePM formalism, etc. However, the \"Cosmological simulation options\" can be\nactivated or not, whether the code is compiled with these respective options. To\nsimulate only gravitational interactions in local systems, such as galaxies or globular\nclusters, we compile this code without the advanced cosmological options listed in the\nMakefile, \"turning on\" the gravitation, and \"turning off\" all the advanced options, such\nas PM formalism, expansion of the universe, etc.\nIn the present paper, we intend to study only gravitational interactions in local\nsystems, without gas and cosmological expansion. To this end, we compile Gadget-2\nwithout the advanced options, and so we are able to study a cloud of particles selfinteracting gravitationally.\nWe fully studied the Gadget-2 code in order to see where it is necessary to modify\nit in order to take into account the corresponding YGP expressions. We concluded that\nit is only necessary to change the code where instructions related to the Newtonian\npotential and accelerations appear. In this case, the acceleration reads\na=−\n\nG M −r/λ\ne\n(r + λ) r.\nλ r3\n\n(2)\n\nIt is important to note that we have left λ as a free parameter.\n\n3 Testing the Code\nThe reliability of a N -body simulation to model a given system depends on how one\ncan control the numerical errors naturally intrinsic in this approach.\nFor example, the particles have their accelerations computed by a tree recursive\ncode and, consequently, their positions and velocities are updated from the integrators.\nAs a result the total energy of the simulated system, can be well conserved or not,\nwhether the treecode calculations and the integration processes are well accurate or\n\n\f4\n\nnot. For these reasons, errors must be investigated and minimized to an acceptable\nlevel.\nIn the N -body numerical formalism, one uses the fact that gravitation obeys the\nsuperposition principle. Therefore, one should firstly test the two-body problem, testing\nthe code's integrator precision to the new gravitational potential one is considering.\nSubsequent tests should consider N -body systems, verifying not only the treecode\nprecision, but also the influence of some numerical parameters on the timestep values.\n\n3.1 Simulating the motion of two particles\nIn this first test, we are able to probe how our changes in the Gadget-2 code modify\nits integrator's precision. A similar test was performed by [9] using newtonian physics.\nThis test is very important, because we are interested in verifying the code's precision\nto drift positions and velocities in each timestep for the YGP.\nOn the other hand, one could argue that N -body systems and a two-body system\nare very different numerically, and consequently that this test would be useless.\nHowever, the N -body formalism is based on the superposition principle, in other words,\nthe total potential is the sum of the potential from all individual particles. Then, we\nfirstly test the two-body problem in order to verify if the code can work appropriately.\nSubsequently, we performe tests with a large amount of particles.\nIn fact, in the case where treecodes are used, the superposition principle is used\nimplicitly in the monopole, quadrupole and octopole expansion terms. But, Gadget2 uses only the monopolar expansions, which is sufficient and very accurate in the\nnewtonian case, as shown by [9]. In the case where the YGP is used, we have performed\nsome tests and, as we will show in the next sections, its monopolar term is also enough\nto yield satisfactory results.\nIn this first test, we simulate the motion of two particles: a massive particle and a\ntest particle (whose mass can be neglected). The massive particle has mass M=100.0\n(in code units, i.e., M=1.0 ≡ 1.0 × 1010 M⊙ ), and is located at (0, 0, 0) kpc, the origin\nof a cartesian coordinate system, and has velocity v = (0, 0, 0) km.s−1 . It is important\nto note that this system of units is very common in galactic simulations with the\nGadget-2 code. In this system, the time unit is given in 9.8 × 108 ∼ 109 years.\nThe test particle has mass m = 0.1, and is located initially at r = (100, 0, 0) kpc\nwith vp = (0, 104, 0) km.s−1 . We have chosen λ = 100 kpc, for our computational\npurposes. Note that the initial separation between the particles is equal to λ. In this\nsimulation, the timestep ∆t values are 0.00146484 ≤ ∆t ≤ 0.00585938. It is worth\nnoting that in Gadget-2, the timestep criterion is\n»\n„\n«–\n2ηǫ\n∆t = min ∆tmax ,\n,\n(3)\n|a|\nwhere η is an accuracy parameter; ∆tmax , the the maximum timestep allowed, which\nis usually chosen to be a small fraction of the dynamical time of the system under\nstudy; ǫ, the gravitational softening; and |a|, the modulus of the particle's acceleration,\nestimated from the last timestep. In the subsection 3.1.1, we consider the role of the\ntimestep in our simulations.\nWe have made the system orbiting for 6 Gyears. So, we are able to study the\ntrajectory of the test particle in detail. We display the test particle's orbit in Fig. 1.\nThis picture is made by displaying the particle's position in the xy−plane obtained\n\n\f5\n\nFig. 1 Trajectories of the particles on the xy−plane. The central particle is the massive one.\n\nfrom 600 snapshots, including the initial one. As can be seen, the test particle orbits\nin the xy−plane and precesses. This orbit characteristic is very important to test the\nreliability of our modified code.\nThe orbit precession showed in Fig. 1 is a real physical effect, it is not related to any\nnumerical instabilities. YGP decreases with distance more steeply than the Newtonian\npotential. It is well known, from the Bertrand's theorem, that potentials that fall with\ndistance differently from 1/r make the orbits to precess; in other words, the orbits are\nnot closed, as we show in Fig. 1. In the following sections, we will study this issue in\ndetail.\n3.1.1 Timesteps in the two-body simulation\nFrom Equation 3, the ∆t values depend strongly on the acceleration of the particles.\nBut the acceleration depends also on some other parameters, for example, the softening\nlength ǫ and the YGP parameter λ. When the distance between two particles is smaller\nthan the softening length scale, the gravity law in the simulation is replaced by a\nsoftening kernel that avoids divergences in the calculated field (see, e.g., [9]). Due to\nthe numerical nature of our calculations, the investigation of the timestep values is a\nvery important task, due to the fact that their values are used by the KDK algorithm\nto update positions and velocities. Therefore, it is necessary to probe the influence\n\n\f6\nTable 1 Some runs with different ǫ and λ values. The first column shows the λ values, the\nsecond one the ǫ values and the third one, ∆t. The first line display the results of the simulation\ndescribed in Subsection 3.1.\nλ\n100.0\n100.0\n10.0\n10.0\n1.0\n1.0\n\nǫ\n1.0\n0.1\n1.0\n0.1\n1.0\n0.1\n\n∆t\n0.0015 ≤ ∆t ≤ 0.0059\n0.0003 ≤ ∆t ≤ 0.0036\n0.0059\n0.0059\n0.0059\n0.0059\n\nof the numerical parameters λ and ǫ on the values of the timesteps. In this sense,\nwe have rerun the two-body simulations described above, changing the values of the\nparameters λ and ǫ. Concerning the N -body system, we will show in the next sections\nwhy Gadget-2 is a safe code to deal with these parameters, displaying the ∆t values\nfor different parameters λ and ǫ.\nIn Table 1, we display the maximum ∆t values from a set of 6 runs, where we\nhave set the same simulated time and used the same two-body system described in\nSubsection 3.1. We have only changed the values of ǫ and λ, setting η = 0.025 for all\nexperiments, to improve the timestep accuracy.\nIn these simulations, we run the two-body system for 6 Gyears for λ = 1, 10 and\n100 kpc, and with ǫ = 0.1 and 1 kpc. Although setting ǫ values for two-body tests\nseems to be unnecessary, we want to probe how these parameters change our results.\nWe have also made a newtonian simulation for a two-body system using the default\nGadget-2, to compare our modified code to the original one. In the newtonian case,\nwe obtain 0.0015 ≤ ∆t ≤ 0.0031 for ǫ = 1 kpc and 0.00038 ≤ ∆t ≤ 0.00076 for ǫ = 0.1\nkpc.\nIt is worth mentioning that for all the runs, for different values of λ, ǫ and timesteps,\nthe total energy conserves very well, as we will see below.\n3.1.2 Testing the reliability of our simulations\nA good integrator must conserve the total energy of the simulated system within\nan acceptable level. However, due to the nature of the YGP, orbits are not closed\nand this feature reveals itself as a good indicator to probe how reliable is our twobody simulation. So, we performed four additional tests to verify the reliability of\nour simulation described in the Subsection 3.1, namely: energy conservation, angular\nmomentum, orbital period and precession of the orbit.\nIn the energy conservation test, we compare our results with the Newtonian case.\nThus, we have made another simulation with the original (Newtonian) code. This\nsimulation is performed with the same initial conditions, as we explained in the last\nsection. In Figs. 2 and 3, we show the total energy evolution for both simulations.\nThese pictures show the evolution of the total energy E normalized by the total initial\nenergy E0 . To the cases where λ = 100 kpc, we consider ǫ = 0.1 and ǫ = 1 and the\nresults are practically the same. Therefore, we display here only the results for ǫ = 1\nand λ = 100 kpc.\nIn Fig. 2, we conclude that the maximum energy violation (E − E0 )/E0 is about\n0.6% at t ≃ 3.3 Gyears. In the YGP case, as can be seen in Fig. 3, the energy violation\nis systematically (E − E0 )/E0 ≃ 1.3%. Note that the energy conservation is better in\n\n\f7\n\nFig. 2 The total energy (normalized by the total initial energy E0 ) evolution as function of\ntime for the Newtonian case.\n\nNewtonian case, this has to due with the fact that 1/r behaves numerically better than\ne−r/λ . However, we consider that this violation can be neglected for two reasons: firstly,\n6 Gyears is a great time lapse for such an energy violation. Secondly, this violation is\nsystematic, at some snapshots the violation is null and this behavior also appears in\nNewtonian case. It is interesting to note that at 6 Gyears the energy violation is almost\nnull in both situations, showing that our method is consistent.\nOne could ask what happen with the energy conservation if we follow the\nsimulations, say, till 100 Gyears. The results of a such simulation show that the energy\nconservation is systematically small, just like in the 6 Gyears simulation. Such a result\nshows again the reliability of our code.\nWe have also tested the conservation of angular momentum. Fig. 4 shows the\nevolution of the total angular momentum L normalized by the total initial angular\nmomentum L0 . We note that the total angular momentum is violated by an amount\nof 0.2 % over the initial value.\nBesides the energy and the angular momentum conservation, we have also\nperformed three additional tests. The first one is to verify the orbital half-period of\nthe test particle. The second one is to check the precession of the particle's orbit. The\nthird test investigates the difference between the potentials calculated by the tree and\nthe direct sum methods in the modified code. To do this test, we use 30,000 particles\nto represent a typical snapshot of galaxy simulations.\n\n\f8\n\nFig. 3 The total energy (normalized by the total initial energy E0 ) evolution as function of\ntime for the Yukawian case with λ = 100 kpc.\n\nIn the test of the period, we evaluate the half-period, which is given by:\nTr =\n\nZ\n\nrp\nrap\n\ndr\nq\n\n2[E − Φ(r)] −\n\nL2\nr2\n\n,\n\n(4)\n\nwhere Tr is the orbital half-period, rap is the apocenter, rp is the pericenter, E is the\ninitial total energy per unit mass, Φ(r) is the potential over the test particle, r is the\ndistance from the center of mass to the test particle and L the angular momentum\nper unit mass. We calculate the above integral numerically and found a value of 0.78\nGyears. In our simulation, the numerical value obtained from the snapshots is also 0.78\nGyears, i.e., the results agree quite well. This result can also be seen in Figs. 5 and 6.\nThe second test consists in the evaluation of the precession angle. Bertrand's\ntheorem states that potentials decreasing with distance differently from 1/r make the\norbits to precess (see, e.g., Goldstein [12]). We then evaluated the precession using the\nfollowing equation:\n∆φ = 2L\n\nZ\n\nrp\nrap\n\nr2\n\ndr\nq\n2[E − Φ(r)] −\n\nL2\nr2\n\n,\n\n(5)\n\nwhere ∆φ is the shift of the semi major axis. We again evaluate this integral numerically\nand found that ∆φ = 28.72◦ . This value agrees with the results obtained from a\nsnapshot of our simulation. Taking the snapshot at t=0.78 Gyears, we found that the\n\n\f9\n\nFig. 4 Evolution of the angular momentum (normalized by the initial angular momentum)\nfor λ = 100 kpc simulation.\n\nparticle's position, from the first snapshot, is ∆Φ = 28.72◦ . This result again shows\nthat our YGP Gadget-2 works quite well and reproduces many physical properties of\nthis kind of potential, due to the good accuracy provided by its integrator's algorithm.\n\n3.2 Tests with N -body systems\nSo far we have investigated the two-body problem, whose tests demonstrated that our\nmodified code produces reliable results. Now, we consider the N -body problem, for\nwhich Gadget-2 was designed. In this way, we are initially interested in the recursive\noctaltree algorithm accuracy to compute the YGP, when compared to the particleparticle method. We are also interested in the influence of the numerical parameters\nN , λ and ǫ over the timestep values, as well as in the energy conservation. In what\nfollows, we will show the main results of a set of N -body simulations.\n3.2.1 The recursive tree algorithm in the YGP case\nThese tests consist in the comparison of the gravitational potentials of a system of\nparticles calculated by two different methods: the exact one, also called the direct sum\nmethod or particle-particle (PP) method, that computes all potentials using ∼ N 2\noperations, and the treecode method, used by Gadget-2 code, as we explained above.\nIn this test, we use both codes, the default Gadget-2 and our modified version. To\ndo this, we have chosen a typical snapshot used in galactic dynamics. This snapshot\n\n\f10\n\nFig. 5 Evolution of the particle's distance from the center of mass frame for the λ = 100 kpc\nsimulation.\n\ndescribes a system of particles modeling the initial conditions of one exponential\ndisk galaxy composed by 10,000 particles embedded in a Hernquist dark matter halo\ncomposed by 20,000 particles. Both systems are built from typical parameters, like the\ngalaxy models developed by Springel & White [13]. Later on we will see that such a\nresolution is enough to test the reliability of the modified treecode method to compute\nthe YGPs of all the particles.\nIn Fig. 7 we show a visualization of our galaxy model. In another publication to\nappear elsewhere we show such galaxy models in detail.\nUsing a Fortran code, we have computed the total potential of each halo and\ndisk particles by the direct sum method and compared these results to the potentials\ncomputed by Gadget-2 code. We define ∆φ = |φN body − φT ree | as the modulus\nof the difference resulting from computation of the potential by the two different\nmethods. φN body indicates the potential calculated by the direct sum method with our\nFortran code, and φT ree , the potential calculated with the Gadget-2, that uses the\ntree method. To do this, we have used typical parameters of the tree, e.g., the tolerance\nparameter θ = 0.8, and softening lengths of ǫh = 1 kpc for the dark matter halo and\nǫd = 0.4 for the baryonic disk. These parameters are unchanged in the Newtonian and\nthe YGP cases, i.e., they are fixed parameters. Defining the relative error ∆φ/φN body ,\nwe can compare both methods. The system of units used here is 1010 M⊙ for unit mass,\nkpc for distances and km.s−1 for velocities.\n\n\f11\n\nFig. 6 Evolution of the particle's velocity from the center of mass frame for the λ = 100 kpc\nsimulation.\n\nFig. 7 Typical snapshot modeling a spiral galaxy and its dark matter halo seen in perspective.\nEach box side has 80 kpc. Blue particles represent dark matter halo and white/yellow particles\nindicate the disk.\n\n\f12\n\nFig. 8 Modulus of the relative errors as a function of the gravitational newtonian potential\nfor the particles of the dark matter halo and for the baryonic disk.\n\nIn Fig. 8, we display ∆φ/φN body against the potentials of the particles in the\nnewtonian case, while in Fig. 9 we show the YGP case, having in mind that both cases\nare calculated to the same snapshot. To compute the potentials in the YGP case, we\nhave set λ=100 kpc, the same halo's length displayed in Fig. 7. Due to the fact that the\nhalo and λ have equal length in our snapshot, the e−r/λ factor plays a important role\nin the potential computations at medium and great separations between the particles.\nNote that if two particles are at distance of 2.5 kpc, the potential is 0.976 Newtonian\n(see Eq. 1). But, in the case where the distance is 10 kpc, the Yukawian potential is\n0.9 of the Newtonian, and when the distance is 25 kpc, the potential is 0.78 of the\nNewtonian.\nAnalyzing Figs. 8 and 9, we conclude that in the YGP case for λ = 100 kpc the tree\nprecision behaves very similarly to the Newtonian case. Errors are the same in both\ncases and our figures show that the modified code can compute potentials of N -body\nsystems with the same precision as the Default Code. Note that we have used the initial\nsnapshots in Figs. 8 and 9, but similar results are obtained for any other snapshots of\nour simulations.\n3.2.2 Additional N -body tests: λ = 1 kpc and λ = 10kpc.\nIn addition to the tests described above, we make simulations now considering λ = 1\nand 10 kpc, using a snapshot similar to the previous one, but with a better resolution,\n\n\f13\n\nFig. 9 The same as Figure 8 for YGP with λ = 100kpc.\n\nnamely: 30,000 particles for the disk and for the dark halo, totalizing 60,000 particles.\nIn this new test, we have changed the ǫ values to ǫh = 0.1 and ǫd = 0.05. Our\ncomputational procedures are very similar to that described in the previous Subsection\nand here we show that φtree and φN body are practically the same.\nThe results are displayed in the Figs. 10 and 11, where we have plotted φtree\nagainst φN body for all the particles of our simulations; the dashed line represents\nφN body = φtree . Note that the points are distributed along the dashed line, with a\nvery small scattering. This result shows that our modified code calculates very well the\ngravitational potential.\n3.2.3 Timestep tests\nNumerical simulations are subject yet to considerable controversy, mostly concerning\ntheir numerical collisionless nature and their resolution. It is well known that the\nparameters N , ǫ and ∆t can change the simulation's results, and, in the galactic\ndynamic scenarios, the final morphology can depend on this set of parameters.\nAn important detailed study in this issue is provided by Gabbasov et. al.[15], where\nthey probe the influence of the numerical parameters N , ǫ and ∆t on the outcomes of a\nset of simulations with disk galaxies and issues related to the formation of bars in these\nlate-type systems. They prove, for example, that different sets of these parameters can\nchange significantly the results of simulations that have initially the same snapshot.\n\n\f14\n\nFig. 10 The octtree accuracy for λ = 1 kpc case. φtree vs. φNbody for all the particles of our\nsimulations; the dashed line represents φNbody = φtree .\n\nIn this paper, we make some tests similar to those by Gabbassov's team to probe\nthe influence of the numerical parameters N , the total number of particles, ǫ, and λ on\nthe timesteps values, using a methodology similar to that used in [15]. It is important\nto bear in mind that our tests are somewhat less complex and we performed a set of\nnumerical simulations up to 0.1 Gyears of simulated time only to verify the influence\nof these parameters.\nThis simulated time is short, if compared to the many runs performed by [15].\nHowever, due to the Gadget-2 method in computing the timesteps, each of our runs\ntake ∼ 500-5000 steps to be completed, being a very satisfactory number of steps to\nour purposes.\nBesides, in some tests performed with 30,000 and 300,000 particles over 1 Gyear,\nthe ∆E/E0 values did not change significantly during all the simulated time, although\n50,000 steps were necessary to this end.\nIn this sense, 0.1 Gyears are sufficient for our studies. In this way, we have used three\nsnapshots with 30,000, 300,000 and 1,200,000 particles, conserving the ratio 1:2 for the\nbaryonic disk and dark halo, respectively. We run these snapshots for different values\nof ǫ and λ. These snapshots represent an exponential disk embedded in a Hernquist\nSphere, as we explained above.\n\n\f15\n\nFig. 11 The octtree accuracy for λ = 10 kpc case. φtree vs. φNbody for all the particles of\nour simulations; the dashed line represents where φNbody = φtree .\nTable 2 Some runs for different N , ǫ and λ values (in kpc). Note that the respective ∆t values\nare calculated by the Gadget-2 code. The energy conservation ∆E/E0 is also shown for each\nrun.\nN\n30 000\n30 000\n300 000\n300 000\n1 200 000\n1 200 000\n30 000\n30 000\n300 000\n300 000\n1 200 000\n1 200 000\n30 000\n30 000\n300 000\n300 000\n1 200 000\n1 200 000\n\nλ\n1.0\n1.0\n1.0\n1.0\n1.0\n1.0\n10.0\n10.0\n10.0\n10.0\n10.0\n10.0\n100.0\n100.0\n100.0\n100.0\n100.0\n100.0\n\nǫh\n1.0\n0.1\n0.1\n0.01\n0.1\n0.01\n1.0\n0.1\n0.1\n0.01\n0.1\n0.01\n1.0\n0.1\n0.1\n0.01\n0.1\n0.01\n\nǫd\n0.4\n0.04\n0.04\n0.004\n0.04\n0.004\n0.4\n0.04\n0.04\n0.004\n0.04\n0.004\n0.4\n0.04\n0.04\n0.004\n0.04\n0.004\n\n∆t\n0.0016\n0.00020 ≤ ∆t ≤ 0.00039\n0.00020 ≤ ∆t ≤ 0.00078\n4.88281 × 10−5\n0.00020 ≤ ∆t ≤ 0.00039\n9.76562 × 10−5\n0.00078\n0.00020\n0.00020\n2.44141 ×10−5\n0.00020\n4.88281 ×10−5\n0.00078\n0.00020\n0.00020\n2.44141 ×10−5\n0.00020\n4.88281 ×10−5\n\n∆E/E0 ≤\n1%\n0.3%\n0.015%\n0.1%\n0.01%\n0.02%\n0.4%\n0.15%\n0.02%\n0.15%\n0.015%\n0.04%\n0.08%\n0.08%\n0.06%\n0.2%\n0.04%\n0.05%\n\n\f16\n\nTo make the runs displayed in the Table 2, we estimate the ǫ values taking the\nmean inter-particle separation at the center of the halo and disk. Our values are near\nto those used by [15] and are typical, if compared to those cited in the literature. Note\nthat in the cases where ǫ < 0.01, the simulations gets \"more collisional\" and the energy\nconservation gets a little bit worse, in agreement to the results obtained by [15]. If the\nresolution is increased, in other words, if the ǫ values are smaller, then timestep values\nare smaller as well. As a consequence, the Gadget-2 tree algorithm computes greater\naccelerations and potentials at these smaller scales than in the small resolution cases\n(greater ǫ values).\nHowever, in these cases where N is very large, the system tends to be\ncollisionless, because in the close encounters, the softening kernel prevent divergences\nof accelerations and potentials, once ǫ is chosen appropriately. Also, the collective\npotential dominates over individual interactions, making results better to N > 105\nparticles.\nSo, the greater the resolution is (i.e., the greater N) the better is the energy\nconservation as long as the ǫ values are correctly chosen. But, note that, even with\na modest value of N, the energy conservation can be quite good. Also, to probe a given\nalternative theory it is not always necessary a high resolution simulation, since the\nglobal properties of a galaxy, such as, for example, the density profile, can be very\nsensitive to the alternative potential. In other papers to appear elsewhere we consider\nthis issue for early and late type galaxies.\nFrom our results, we consider our modified code able to test the YGP. Therefore,\nwe are able to study alternative theories using galaxies or globular clusters, with the\nsame quality one obtains with the use of Newtonian codes.\n\n4 Conclusions\nThe present paper considers the use of the well known Gadget-2, with the appropriate\nmodifications, to study alternative theories of gravitation, with particular attention to\nthe YGP. In this first paper we discuss how to modify the Gadget-2 and evaluate how\nreliable this modified code is, performing a series of tests.\nAs we have shown in the previous sections, our tests are successful: numerical errors\nfrom our changes on Gadget-2 are neglected and we can use this modified code to\nprobe alternative theories of gravitation. For example, we can use arguments based\non galactic dynamics to exclude or not the Yukawa potential hypothesis. This is very\nimportant, due to the fact that alternative theories appear frequently in the literature,\nbut so far there are no many investigations in the galactic scales using N -body codes\nand galactic dynamics formalism. We will show, in future papers, how to test these\nalternative theories using early and late-type galaxies.\nAcknowledgements The authors would like to thank the Brazilian agencies CAPES, CNPq\nand FAPESP for support. The authors would like also to thank Márcio Eduardo da Silva Alves\nfor interesting suggestions, discussions and for the critical reading of the paper.\n\nReferences\n1. Piazza, F. & Marinoni, C., Physical Review Letters, 91, 14 (2003).\n2. Signore, R. L., Monthly Notices of the Royal Astronomical Society, 364, 1219 (2005).\n\n\f17\n3. de Araujo, J. C. N., & Miranda O. D., General Relativity and Gravitation, 39, 777 (2007).\n4. Toomre, A., The Astrophysical Journal, 138, 385 (1963).\n5. Rodrı́guez-Meza, M. A., Cervantes-Cota, J. L., Pedraza, M. I., Tlapanco, J. F., de la\nCalleja, E.M., General Relativity and Gravitation, 37, 823 (2005).\n6. Cervantes-Cota, J. L., Rodrı́guez-Meza, M. A., Gabbasov, R., Klapp, J., Revista Mexicana\nde Fisica, S53, 22 (2007)\n7. Rodrı́guez-Meza, M. A., González-Morales, A. X., Cervantes-Cota, J. L., Gabbasov, R.,\nJournal of Physics: Conference Series, 91, 012012 (2007)\n8. Brans, C., Dicke, R., Physical Review, D124, 925 (1961).\n9. Springel, V., Monthly Notices of the Royal Astronomical Society, 364, 1105, 4 (2005).\n10. Visser, M., General Relativity and Gravitation, 30, 12 (1998).\n11. Barnes, J. E. & Hut, P., Nature, 324, 446 (1986).\n12. Goldstein, H.: Classical Mechanics. Addison-Wesley Publishing Company (1980).\n13. Springel, V. & White, S. D. M., Monthly Notices of the Royal Astronomical Society, 307,\n162 (1999).\n14. Binney, J., Tremaine, S.: Galactic Dynamics, Princeton: Princeton Univ. Press (2008)\n15. Gabbasov, R. F., Rodrı́guez-Meza, M. A., Klapp, J., Cervantes-Cota, J. L., Astronomy\nand Astrophysics, 449, 1043 (2006).\n\n\f"}