{"id": "http://arxiv.org/abs/0811.2106v3", "guidislink": true, "updated": "2009-06-04T18:48:07Z", "updated_parsed": [2009, 6, 4, 18, 48, 7, 3, 155, 0], "published": "2008-11-13T13:30:54Z", "published_parsed": [2008, 11, 13, 13, 30, 54, 3, 318, 0], "title": "NMR Response in quasi one-dimensional Spin-1/2 Antiferromagnets", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0811.1979%2C0811.2436%2C0811.0397%2C0811.1178%2C0811.0968%2C0811.0450%2C0811.4219%2C0811.1127%2C0811.0933%2C0811.2317%2C0811.2722%2C0811.2381%2C0811.4110%2C0811.1492%2C0811.1259%2C0811.2056%2C0811.0945%2C0811.4226%2C0811.1183%2C0811.3968%2C0811.1297%2C0811.0737%2C0811.1371%2C0811.0851%2C0811.1247%2C0811.3550%2C0811.0121%2C0811.3913%2C0811.3855%2C0811.4334%2C0811.1366%2C0811.4372%2C0811.1312%2C0811.1191%2C0811.2784%2C0811.4045%2C0811.3958%2C0811.2913%2C0811.0970%2C0811.3619%2C0811.1020%2C0811.3505%2C0811.3547%2C0811.0867%2C0811.0106%2C0811.4536%2C0811.3826%2C0811.1408%2C0811.4730%2C0811.3922%2C0811.1511%2C0811.4727%2C0811.4099%2C0811.2720%2C0811.1266%2C0811.4185%2C0811.2097%2C0811.0410%2C0811.3492%2C0811.0611%2C0811.3740%2C0811.2706%2C0811.1612%2C0811.1386%2C0811.1459%2C0811.3863%2C0811.4759%2C0811.2741%2C0811.0471%2C0811.3296%2C0811.1379%2C0811.2279%2C0811.4339%2C0811.0395%2C0811.3873%2C0811.4415%2C0811.0161%2C0811.0037%2C0811.3624%2C0811.1684%2C0811.3963%2C0811.3440%2C0811.3308%2C0811.1364%2C0811.3055%2C0811.1309%2C0811.4071%2C0811.3171%2C0811.3626%2C0811.2106%2C0811.0879%2C0811.2223%2C0811.1900%2C0811.2574%2C0811.4685%2C0811.3074%2C0811.3110%2C0811.2246%2C0811.3493%2C0811.1446%2C0811.2014&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "NMR Response in quasi one-dimensional Spin-1/2 Antiferromagnets"}, "summary": "Non-magnetic impurities break a quantum spin chain into finite segments and\ninduce Friedel-like oscillations in the local susceptibility near the edges.\nThe signature of these oscillations has been observed in Knight shift\nexperiments on the high-temperature superconductor YBa$_2$Cu$_3$O$_{6.5}$ and\non the spin-chain compound Sr$_2$CuO$_3$. Here we analytically calculate NMR\nspectra, compare with the available experimental data for Sr$_2$CuO$_3$, and\nshow that the interchain coupling is responsible for the complicated and so far\nunexplained lineshape. Our results are based on a parameter-free formula for\nthe local susceptibility of a finite spin chain obtained by bosonization which\nis checked by comparing with quantum Monte Carlo and density-matrix\nrenormalization group calculations.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0811.1979%2C0811.2436%2C0811.0397%2C0811.1178%2C0811.0968%2C0811.0450%2C0811.4219%2C0811.1127%2C0811.0933%2C0811.2317%2C0811.2722%2C0811.2381%2C0811.4110%2C0811.1492%2C0811.1259%2C0811.2056%2C0811.0945%2C0811.4226%2C0811.1183%2C0811.3968%2C0811.1297%2C0811.0737%2C0811.1371%2C0811.0851%2C0811.1247%2C0811.3550%2C0811.0121%2C0811.3913%2C0811.3855%2C0811.4334%2C0811.1366%2C0811.4372%2C0811.1312%2C0811.1191%2C0811.2784%2C0811.4045%2C0811.3958%2C0811.2913%2C0811.0970%2C0811.3619%2C0811.1020%2C0811.3505%2C0811.3547%2C0811.0867%2C0811.0106%2C0811.4536%2C0811.3826%2C0811.1408%2C0811.4730%2C0811.3922%2C0811.1511%2C0811.4727%2C0811.4099%2C0811.2720%2C0811.1266%2C0811.4185%2C0811.2097%2C0811.0410%2C0811.3492%2C0811.0611%2C0811.3740%2C0811.2706%2C0811.1612%2C0811.1386%2C0811.1459%2C0811.3863%2C0811.4759%2C0811.2741%2C0811.0471%2C0811.3296%2C0811.1379%2C0811.2279%2C0811.4339%2C0811.0395%2C0811.3873%2C0811.4415%2C0811.0161%2C0811.0037%2C0811.3624%2C0811.1684%2C0811.3963%2C0811.3440%2C0811.3308%2C0811.1364%2C0811.3055%2C0811.1309%2C0811.4071%2C0811.3171%2C0811.3626%2C0811.2106%2C0811.0879%2C0811.2223%2C0811.1900%2C0811.2574%2C0811.4685%2C0811.3074%2C0811.3110%2C0811.2246%2C0811.3493%2C0811.1446%2C0811.2014&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Non-magnetic impurities break a quantum spin chain into finite segments and\ninduce Friedel-like oscillations in the local susceptibility near the edges.\nThe signature of these oscillations has been observed in Knight shift\nexperiments on the high-temperature superconductor YBa$_2$Cu$_3$O$_{6.5}$ and\non the spin-chain compound Sr$_2$CuO$_3$. Here we analytically calculate NMR\nspectra, compare with the available experimental data for Sr$_2$CuO$_3$, and\nshow that the interchain coupling is responsible for the complicated and so far\nunexplained lineshape. Our results are based on a parameter-free formula for\nthe local susceptibility of a finite spin chain obtained by bosonization which\nis checked by comparing with quantum Monte Carlo and density-matrix\nrenormalization group calculations."}, "authors": ["J. Sirker", "N. Laflorencie"], "author_detail": {"name": "N. Laflorencie"}, "author": "N. Laflorencie", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1209/0295-5075/86/57004", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0811.2106v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0811.2106v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "final version", "arxiv_primary_category": {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0811.2106v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0811.2106v3", "journal_reference": "Europhys. Lett. 86, 57004 (2009)", "doi": "10.1209/0295-5075/86/57004", "fulltext": "epl draft\n\nNMR Response in quasi one-dimensional Spin- 21 Antiferromagnets\nJ. Sirker1 and N.Laflorencie2,3,4\n\narXiv:0811.2106v3 [cond-mat.str-el] 4 Jun 2009\n\n1\n2\n3\n4\n\nMax-Planck-Institut für Festkörperforschung - Heisenbergstrasse 1, D-70569 Stuttgart, Germany\nLaboratoire de Physique des Solides, Université Paris-Sud - UMR-8502 CNRS, 91405 Orsay, France\nUniversité de Toulouse; UPS; Laboratoire de Physique Théorique (IRSAMC) - F-31062 Toulouse, France\nCNRS; LPT (IRSAMC) - F-31062 Toulouse, France\n\nPACS\nPACS\nPACS\n\n75.10.Pq – Spin chain models\n76.60.-k – Nuclear magnetic resonance and relaxation\n11.10.Wx – Finite-temperature field theory\n\nAbstract. - Non-magnetic impurities break a quantum spin chain into finite segments and induce\nFriedel-like oscillations in the local susceptibility near the edges. The signature of these oscillations has been observed in Knight shift experiments on the high-temperature superconductor\nYBa2 Cu3 O6.5 and on the spin-chain compound Sr2 CuO3 . Here we analytically calculate NMR\nspectra, compare with the available experimental data for Sr2 CuO3 , and show that the interchain coupling is responsible for the complicated and so far unexplained lineshape. Our results\nare based on a parameter-free formula for the local susceptibility of a finite spin chain obtained\nby bosonization which is checked by comparing with quantum Monte Carlo and density-matrix\nrenormalization group calculations.\n\nIntroduction. – An important tool to study the local spin dynamics in strongly correlated electron systems\nis nuclear magnetic resonance (NMR). NMR experiments\nhave been instrumental in investigating spin fluctuations\nand impurity effects in high-temperature superconductors\n[1], as well as in confirming the triplet nature of superconductivity in Sr2 RuO4 [2]. Quite recently, NMR was also\nused to study the CuO chains in YBa2 Cu3 O6.5 (YBCO)\n[3]. The NMR study showed that the chain ends induce\nFriedel-like oscillations which manifest themselves also in\nthe CuO2 planes. Similar oscillations have also been observed earlier in the prototypical quasi one-dimensional\nS = 1/2 spin chain compound Sr2 CuO3 (SCO) [4, 5].\nTheoretically, a large alternating component of the local susceptibility near the end of a semi-infinite Heisenberg chain has been predicted [6]. Other studies (for a\nrecent review see ref. [7]) have addressed local spin correlations near a chain end by numerical means in a variety of\none-dimensional models ranging from the frustrated and\ndimerized spin-1/2 chain to spin ladders and the spin-1\nHeisenberg chain [8].\n\ntransport perhaps related to the integrability of the model\nby Bethe ansatz. NMR and muon spin relaxation experiments on SCO [15, 16], on the other hand, have found\ndiffusive behavior. In order to analyze these experiments\non a quantitative level in the future, it is first of all important to know in how far a spin-only model for SCO is\nvalid. In particular, it has been claimed in ref. [5] that\nalready the NMR spectra - where only static correlations\nare tested - can only be understood if a coupling to the\nlattice is taken into account.\n\nIn the first part of this letter we will calculate NMR\nspectra for a Heisenberg chain with a Poisson distribution of non-magnetic impurities.This is known to be the\nrelevant model for SCO, with chain breaks caused by the\npresence of excess oxygen [17, 18]. We will start with the\nideal chain but will then show that the interchain couplings are essential to fully explain the experimental data\nfor SCO [4,5]. Our main findings are that the theoretically\ncalculated spectra for a spin-only model of weakly coupled Heisenberg chains are in perfect agreement with experiment whereas the phenomenological model proposed\nAn interesting open question concerning the physics of in [5], involving some coupling to lattice degrees of freethe spin-1/2 Heisenberg chain is whether its transport dom, cannot - if taken seriously - explain the data. The\nproperties are ballistic or diffusive. The theoretical re- calculated NMR spectra are based on a parameter-free forsults are contradictory [9–14] but seem to point to ballistic mula for the local susceptibility of finite S = 1/2 XXZ\np-1\n\n\fJ. Sirker N.Laflorencie\n\nχj [1/J]\n\nχj [1/J]\n\nchains at finite temperatures obtained by a bosonization is then given by\napproach as explained in the second part of this letter.\n∞\nN\nΓ X p(1 − p)N −1 X\n1\nThe analytical results allow for a full impurity averaging\nP (K) =\n. (3)\n(N ) 2\nwhich would be impossible to achieve at low temperatures\nπ\nN\n) + Γ2\nj=1 (K − Kj\nN =1\nby numerical calculations.\nAs we will show in the second part of this letter, bosoniza(N )\nN=49\n3\ntion allows us to derive a parameter-free result for χj in\nh || a,b\n2\n(a)\nthe limit T /J ≪ 1 and N ≫ 1. Because the deviations for\n1\n0\nvery small chain lengths are not important for the NMR\n200 K\n-1\nspectra as long as the probability of having such tiny seg180 K\n-2\n-3\n160\nK\nments is low, the only parameters entering in (3) are the\n0 10 20 30 40 50\nj\n140 K\nmaterial-dependent constants J, A0 and A±1 .\nT=200K\n120 K\nT=100K\nNMR measurements have been performed on the\nT=20K\n100 K\nN=50\nHeisenberg (∆ = 1) chain compound SCO [4, 5]. Chain\n0.8\n80 K\n0.6\n(b)\nbreaks in this system are believed to be caused by ran0.4\n60 K\n0.2\ndomly distributed excess oxygen leading to the formation\n40 K\n0\n-0.2\nof Zhang-Rice singlets [17, 18]. From measurements of\n20 K\n-0.4\n7.7\n7.6\n7.55\n7.65\nthe total susceptibility it follows that J ∼ 2200 K [17].\n0 10 20 30 40 50\nh [T]\nj\nBy a comparison with YBa2 Cu3 O6+δ [19] and theory\nthe hyperfine coupling constants A0c /(2~γn ) ≈ −13 T,\nFig. 1: (Color online) Theoretical NMR spectra (3) for a A0ab /(2~γn ) ≈ 2 T, and A1 /(2~γn ) ≈ 4 T are obtained.\nPoisson distribution with p = 0.3% non-magnetic impuri- Here the index denotes the magnetic field direction. We\nties, parameters J, A0 , A±1 as appropriate for SCO (see text), calculate the spectra as a function of h = (1 + K)h0\nres\nΓ = 4 * 10−4 , and h0res = 7.61 T (dashed line). The dotted\nwhere h0res = ν/γn is the resonance field for an isolated\nlines mark the maxima corresponding to the bulk susceptibil- 63\nCu atom. In experiment ν = 86 MHz [4] and γn ≈ 11.3\nity. Insets (a) and (b) show local susceptibilities at various\nMHz/T\n[20] leading to h0res ≈ 7.61 T. Exemplarily, we\ntemperatures indicated on the plot.\nshow the evolution of the lineshape for an ideal chain\nwith impurity concentration p = 0.3% in fig. 1. At high\ntemperatures a central peak dominates whose position\nNMR spectra. – The Hamiltonian of the spin-1/2\ncorresponds to the bulk susceptibility value. In addiXXZ model with N sites and open boundary conditions\ntion, broad\nedges are visible whose separation increases\np\n(OBCs) is given by\n∼ h0res v/T ln1/4 (v/T ) with decreasing temperature with\nv being the spin velocity. These edges are caused by the\nN\nN\n−1\nX\nX\n\u0003\n\u0002 x x\nextrema in the local susceptibilities of chain segments with\ny y\nz\nz z\nSj .\nSj Sj+1 + Sj Sj+1 + ∆Sj Sj+1 − h\nH =J\nlengths N ≫ πv/T (see Figs. 1 (a) and (b), respectively).\nj=1\nj=1\n(1) Furthermore, we observe a gradual transfer of weight from\nHere J is the exchange constant, ∆ ∈ [0, 1] an exchange a peak at high temperatures to a peak corresponding to\nanisotropy, and h the applied magnetic field. Due to the zero Knight shift at low temperatures stemming from the\nOBCs, translational invariance is broken leading to a po- increasing number of even chain segments with N ≪ πv/T\nwhich become frozen into their singlet ground state (see\nsition dependent local susceptibility\nfig. 1(b)). The odd chain segments with N ≪ πv/T , on\nthe other hand, will yield large Knight shifts (see fig. 1(a)).\n∂\n1\n(N )\nz\nχj =\nhSjz ih=0 = hSjz Stot\nih=0\n(2) This leads to a background which grows in intensity and\n∂h\nT\nexpands with decreasing temperature. The temperature\nP z\n∗\nz\nThe T where the peak corresponding to zero Knight and the\nwhere T is the temperature and Stot =\nj Sj .\npeak\ncorresponding to the bulk susceptibility value have\nhyperfine interaction couples nuclear and electron spins.\nequal\nheight is therefore directly related to the impurity\nFor a chain segment of length N this leads to the\n(N )\nconcentration.\nFor p ≪ 1 we analytically find\n=\nKnight shift of the nuclear resonance frequency Kj\nP\n′\n(N )\n∗\n2\n(γe /γn ) j ′ Aj−j χj ′ , where γe (γn ) is the electron (nup ≈ 1 − 3−2T /(Jπ )\n(4)\nclear) gyromagnetic ratio, respectively. The hyperfine interaction is short ranged so that usually only A0 and A±1 which is a simple criterion to determine the impurity conmatter. The NMR spectrum is proportional to the distri- centration from the NMR spectra alone.\nbution of Knight shifts. Let us assume in the following a\nThe observation of a central peak at high temperatures\np\nPoisson distribution of non-magnetic impurities with con- and broad edges with separation ∆h ∼ h0res v/T is in\ncentration p and a Lorentzian lineshape with width Γ for agreement with experimental observations [4, 5] as shown\neach Knight shift. The normalized probability distribution in fig. 2. It has indeed already been pointed out in [4] p-2\n\n\f(b)\n\nh || a\n\nh || a\nDh\n\nexperiment\n\n1\nst\n\ntheory\n\nexperiment\n\n∆h\n7.55\n\nχuni + |χj |\n\nδh\n\n(a)\n\n7.6\nh [T]\n\n7.65\n\n7.5\n\n7.6\nh [T]\n\n7.65\n\n7.7\n\n(c)\n\n0.8\n0.6\n\n7.55\n\ntheory\n\n∆h\n\nIntensity [Arb. units]\n\nIntensity [Arb. units]\n\nNMR Response in quasi one-dimensional Spin- 12 Antiferromagnets\n\nchain I\nchain II\n\n0.4\n0.2\n-300\n\n-200\n\n-100\n\n0\n\n100\n\n200\n\n300\n\nj\nFig. 2: (Color online) (a) Comparison between experimental\ndata taken from [4] and theory with material-dependent parameters as given in the text and p = 5 × 10−4 , Γ = 4 × 10−4\nat T = 60 K. The peak height has been adjusted to agree with\nexperiment and h0res = 7.5955. (b) Same as (a) at T = 30 K.\n(c) Calculated oscillations χj at T = 30 K in an infinite chain\nwith an impurity at x = 0 (chain I) and reflections in the infinite chain II without impurities due to an interchain coupling\nwith strength J⊥ = 5 K.\n\nbased on the theoretical results for the semi-infinite chain\nby Eggert and Affleck [6] - that the edges are a consequence of the maxima in the local susceptibility. However,\nat temperatures T . 30 K additional structures are visible\nin the experimental spectra. The peak develops shoulders\nwhose separation is denoted by Dh in fig. 2(b) following\nthe notation introduced in [4]. Furthermore, a splitting of\nthe peak, δh, very different from the weight transfer with\ntemperature shown in fig. 1, is observed. In ref. [5] it has\nbeen tried to explain these features by a phenomenological\nmodel of mobile bond defects. In particular, the feature\nδh was ascribed to a periodic arrangement of bond defects\nleading to chain segments of odd length N only. However,\nanalytically we find that the splitting of the central peak\nwould then grow like ∼ h0res J ln1/4 (N )/(T N 1/2 ). Due to\nthe prefactor ∼ J this predicts a very rapid increase of\nthe splitting not observed in experiment showing that this\nmodel is incorrect. Instead, as we will show below, the additional features Dh and δh are a consequence of the interchain coupling. The interchain coupling along one of the\ncrystal axes perpendicular to the chains is of order J⊥ ∼ 5\nK while it is three orders of magnitude smaller along the\nother direction [17,21]. At T ∼ 30 K we might therefore already expect significant effects of the interchain couplings\nwhich, however, can be included perturbatively. Doing so\nwe find that the susceptibility oscillations near an impurity residing in one chain (zeroth order) lead to substantial\nreflections in the neighboring chain (first order) for parameters appropriate for SCO as shown in fig. 2(c). The\nratio of the maximum in chain I to the maximum in chain\nII is ∼ ∆h/(Dh), i.e., the shoulders of the peak, Dh, are\ncaused by the maxima of the reflected oscillations. We find\n\n√\nDh ∼ h0res J⊥ vT −3/2 but logarithmic corrections can disguise this scaling as will become clear later on. The splitting of the central peak δh, see fig. 2(b), has a more complicated origin. First, there are also a reflections in nextnearest neighboring chains (second order).\nThe maxima\n2√\nwould then yield a splitting δh ∼ h0res J⊥\nvT −5/2 (again\nignoring logarithmic corrections). However, for impurity\nconcentrations p ∼ 5 × 10−4 relevant for the experiments\nthere is another effect which actually dominates: Including the first and second order reflections from neighboring chains, the chain of average length N̄ ≈ 1/p will not\nhave any sites left which show bulk behavior. This means\nthat at temperatures T . 30 K the probability for having Knight shifts corresponding to values close to the bulk\nsusceptibility starts to decrease dramatically thus leading\nto a drop in intensity in P (K). Therefore δh denotes not\na splitting of the central peak but rather a dip of intensity\nat the bulk susceptibility value. The oscillations, which\nnow basically spread over the entire crystal, might get further stabilized by anisotropic exchange terms. This might\nalso explain the small differences in the lineshape near the\npeak for h k a and h k c [4,5]. A detailed analysis of these\nanisotropy effects is beyond the scope of this letter.\nWe also want to stress that having additional structures\nin the spectra due to interchain couplings is very different from a scenario where instead such structures occur\ndue to a direct hyperfine interaction or a dipolar coupling of the nuclear spins with electron spins in adjacent\nchains. The latter case would lead to Dh/∆h = const.\n(δh/∆h = const.) as a function of temperature if the\nshoulders (splitting) are caused by this mechanism, respectively. Only three (two) different temperatures are\npresented in [5] where the shoulders (splitting) are visible,\nrespectively, making a detailed analysis impossible. However, we find that the data are consistent with Dh/∆h ∼\n1/T as expected if interchain coupling dominates but certainly not consistent with either Dh/∆h = const. or\nδh/∆h = const..\nTo calculate the NMR lineshapes for SCO at low temperatures, we have to deal with a two-dimensional array\nof weakly coupled chains. In general, this is a very complicated task requiring a two-dimensional impurity averaging. However, for small impurity concentrations significant simplifications are possible. At a given temperature,\nthe oscillations extend over a characteristic length ξ. If\nN̄ = 1/p ≫ ξ then the probability of having two impurities in neighboring chains so close to each other that the\nzeroth order oscillations in the chain and the reflections\nfrom neighboring chains overlap is small. We therefore assume that reflections in a chain of length N only occur in\nregions where the chain shows bulk behavior. In a chain\nof length N , 2pN reflections from the nearest neighbor\nchains and 2pN reflections from nearest-neighbor chains\nwill occur on average. If a chain segment is long enough,\nwe consider the zeroth, first, and second order oscillations\nas independent entities. If the segment is too short, we\nreduce the extend of the first and second order oscilla-\n\np-3\n\n\fJ. Sirker N.Laflorencie\ntions mimicking the overlap. For the chain segments we\nthen do the full impurity averaging (3). The theoretically\ncalculated lineshapes we obtain this way are in excellent\nagreement with experiment as shown in fig. 2. For both\ntemperatures we use the peak to adjust the intensity. For\nT = 60 K we also used p and h0res as parameters and find\np = 5 × 10−4 and h0res = 7.5955 T. In fig. 2 (b) we use the\nsame values. An even better agreement would be obtained\nhere if we choose h0res = 7.598 T which is equivalent to a\ndeviation of 0.03% from our prediction for the evolution\nof the bulk susceptibility value. Furthermore, the intensity of the edges ∆h is overestimated. This is most likely a\nconsequence of our assumption that the zeroth order oscillations do not overlap with the reflections. Configurations\nwhere such an overlap occur would wash out the maxima\nof the zeroth order oscillations. In addition, this might\nalso point to some deviations from a Poisson distribution\nwith short chains occurring less frequently than expected.\n\nN=100\n\n0.6\n\n0.4\n\nχj\n\n0.6\n\nN=99\n\n0.4\n\nT/J=0.02\nBosonization\n\n0.2\n\n0.2\n\nχj\n\nQMC\n0\n\n-0.2\n\n0\n\n0\n\n20\n\n40\n\n60\n\n80\n\n100\n\n0\n\n20\n\nj\n\n40\n\n60\n\n80\n\n-0.2\n100\n\nj\n\nFig. 3: (Color online) χj for ∆ = 0.3 and T /J = 0.02. Comparison between QMC and field theory for N = 100 and N = 99.\n\nq\nR L+a\nP\nz\nL\nfulfills j Sjz ≈ K\n∂x Φ ≡ Stot\nand the oscillator\n2π 0\npart (second line of eq. (7)) vanishes for j = 0, N + 1 as\nrequired.\nLocal susceptibility. – We now explain how the\nUsing (5) in the formula for the local susceptibility (2),\n(N )\nhave been obtained. In we find χj = χuni + (−1)j χst . The uniform part is indeparameter-free results for χj\nj\nj\nthe low-energy limit, the spin operators can be expressed pendent of position, χuni ≡ χuni = h(S z )2 i/(T N ) and\ntot\nj\nin terms of a boson Φ as\nwe can therefore directly use the parameter-free result der\nrived in [18]. For √\nthe staggered part,\nhand, we\np\nKL\n√ on the other\nz\nz\n∂x Φ + c(−1)j cos 2πKL Φ .\nSj ≈\n(5) find χst\nizm where\n= Tc hcos 2πKL Φiosc hcos 2πKL ΦStot\nj\n2π\nwe have split the correlation function into an oscillator\nHere KL is the Luttinger parameter and c the amplitude and a zero mode part according to (7). Using\nthe cumu√\nof the alternating part. The integrability of model (1) by lant theorem for bosonic modes hexp(±i 2πKL Φ)iosc =\nBethe ansatz allows it to determine KL and c exactly for exp(−πKL hφφiosc ) we obtain, following [18, 23],\nall ∆. Ignoring bulk and boundary irrelevant operators,\n\u0012\n\u0013KL /2 3KL /2 − πv \u0001\np\nthe Hamiltonian (1) is equivalent to a free boson model\nη\ne TL\nπ\n\u0010\n\u0011.\nhcos 2πKL Φiosc =\nπv\nKL /2\nr\nπj\nN +1\n− 2T\nZ L+a\nZ L+a\nL\n,\ne\nθ\n1\n\u0003\n\u0002\nN +1\nKL\nv\ndx Π2 + (∂x Φ)2 − h\ndx ∂x Φ (6)\nH =\n(8)\n2 0\n2π 0\nHere η(x) is the Dedekind eta-function and θ1 (u, q) the\nwhere v is the spin velocity, L = N a, and a the lattice elliptic theta-function of the first kind. For the zero mode\nconstant. The bosonic fields obey the standard commu- part we find\ntation rule [Φ(x), Π(x′ )] = iδ(x − x′ ) with Π = v −1 ∂t Φ.\np\nz\nTo calculate the local susceptibility (2) we use a mode\nhcos 2πKL ΦStot\nizm\n(9)\nP\n2\nexpansion\nm sin[2πmj/(N + 1)]e−πvm /(KL LT )\nP −πvm2 /(K LT )\n= − m\nr\nr\nL\nme\nπ\n2π z\nj\nΦ(x = ja, t) =\n+\nStot\n(7)\n8KL\nKL\nN +1\nwith m running over all integers (half-integers) for N even\n∞\n\u0010\n\u0011\nX sin (πnj/(N + 1))\nπnvt\n(odd), respectively. In the thermodynamic limit, N → ∞,\n−i πnvt\ni\n†\n√\ne L+a bn + e L+a bn\n+\nwe can simplify our result and obtain\nπn\nn=1\n\nwhich incorporates the OBCs. Here bn is a bosonic annihilation operator. Eq. (7) is a discrete version of the mode\nexpansions used in [18, 22] with x = ja becoming a continuous coordinate for a → 0, N → ∞ with L = N a fixed.\nUsing this mode expansion, the local observables respect\nthe discrete lattice symmetry j → N + 1 − j corresponding\nto a reflection at the central bond (site) for N even (odd),\nrespectively. The sites 0 and N + 1 are added to model\n(1) and we demand that the spin density vanishes at these\nsites. Therefore the upper boundary for the integrals in\n(6) is L + a. The zero mode part (first line of eq. (7))\n\nχst\nj =\n\ncKL\nv \u0002\n\nx\nv\nπT\n\nsinh\n\n2πT x\nv\n\n\u0001\u0003K/2\n\n(10)\n\nwith x = ja. This agrees for the isotropic Heisenberg case,\nKL = 1, with the result in [6]. The amplitude c can be\ndetermined with the help of the Bethe\np ansatz along the\nlines of ref. [24]. This leads to c = Az /2 with Az as\ngiven in eq. (4.3) of [24]. Our result for the staggered\npart of the local susceptibility is therefore parameter free.\nThis means that we can directly compare our analytical\nresult for χj with quantum Monte Carlo (QMC) data. For\n\np-4\n\n\fNMR Response in quasi one-dimensional Spin- 12 Antiferromagnets\n1\n\n0.4\n.02\n\n0\n/J=\n\n0.5\n\nχj\n\nT\n\n.05\n\n0.2\n\n=0\n\nT/J\n\n0.1\n\nst\nχj 0\n\n=\nT/J\n\n0\n\n-0.2\n-0.5\n\n0\n\n-0.4\n20\n\n40\n\n60\n\n80\n\n0\n\n100\n\nj\n\n10\n\n20\n\n30\n\n40\n\nj\n\nFig. 4: (Color online) χj for ∆ = 1 and N = 100. Comparison between QMC (closed symbols) and field theory (open\nsymbols) for T /J = 0.02, 0.05, 0.1, as indicated on the plot.\n\nan anisotropy ∆ = 0.3, shown in fig. 3, the agreement is\nexcellent.\nNext, we come to the experimentally most relevant\nisotropic case, ∆ = 1 (KL = 1). Umklapp scattering is\nthen marginally irrelevant and the scaling dimensions of\ncorrelation functions have to be replaced by renormalization group improved versions. For χj the calculations are\nrather similar to those in ref. [25] for the longitudinal spinspin correlation function. We find that we have to replace\n1/KL → 1−g in (9) whereas KL ≡ 1 in the oscillator part,\neq. (8). The renormalization of KL for this part is incorporated into an effective amplitude c → (2π 3 g)−1/4 . The\nrunning coupling constant g depends, in general, on the\nthree length scales x, L, and v/T . At low enough energies\nthe smallest scale will always dominate and g is given by\nthe solution of 1/g + ln(g)/2 = ln {C0 min[x, L − x, v/T ]}\nwhere C0 is a constant. In fig. 4 a comparison between this\nanalytic result and QMC data is shown with C0 = 6. We\nnote that fitting the constant C0 improves the results near\nthe boundaries. For low temperatures and x, L − x ≫ 1,\nhowever, the value of C0 becomes irrelevant and our result for χj therefore again parameter-free. The agreement\nwith QMC is not as good as for the anisotropic case. This\nis a consequence of the fact that g has been derived in the\nlimit x, L, v/T ≫ 1. However, the deviations are only of\nthe order of a few percent and have very little effect on\nthe NMR spectra presented in the first part of this letter.\nst(1)\nof susceptibility\nFinally, the first order reflection χj\noscillations in a neighboring chain, shown in fig. 2(c), is\ngiven in first order perturbation theory in J⊥ by\n\nFig. 5: (Color online) χst\nj for ∆ = 1, J⊥ = 0.03J, and T = 0.1J.\nComparison between DMRG data (closed symbols) and field\ntheory (open symbols) for an infinite chain with a non-magnetic\nimpurity at j = 0 (squares) and an infinite neighboring chain\nwithout impurities (circles).\n\nParticularly suited to study the case of an infinite chain\nwith a single non-magnetic impurity at the origin which\nis weakly coupled to an infinite chain without impurities\nis the density-matrix renormalization group (DMRG) applied to transfer matrices. This algorithm allows it to directly obtain results in the thermodynamic limit [26, 27].\nIn fig. 5, DMRG data are compared to the field theoretical\nformulas (10,11) and good agreement is found. The maxst(1)\nimum of |χj | and therefore the separation of the shoulders Dh scales like T −3/2 for KL = 1 with complicated\nlogarithmic corrections coming in through the amplitude\nc. This might make it hard to detect this power law in experiment. The second order reflections can be calculated\nanalogously.\n\nConclusions. – To conclude, we have derived an analytic formula for the local susceptibility of a finite Heisenberg chain. This allows us to calculate NMR spectra for\nspin chains with arbitrary impurity concentrations and\ndistributions which would be impossible by numerical calculations at temperatures T /J ≪ 1. We also showed how\nto calculate NMR spectra for weakly coupled spin chains if\nthe impurities are dilute. For SCO we have demonstrated\nexcellent agreement between our theory and experiment\nshowing that SCO is indeed a prototypical quasi onedimensional spin chain compound. More generally speaking, we have shown that NMR spectra are extremely useful\nto extract information about the impurity concentration\nas well as about the magnetic couplings. In particular,\nX\nJ⊥\nst(1)\nzz,st\nthe coupling between the chains leads to an additional\nχst\nG\n.\n(11)\n= − (−1)j\nχj\nk j−k\nT\nstructure and its position allows it to directly extract the\nk\ncoupling strength. We also want to remark that this struczz,st\nHere eq. (10) has to be used for χst\n= ture is very sensitive to the type of interchain coupling. If\nk and Gj−k\n\u0002 v\n\u0003K\nhSjz Skz ist = c2 / πT\nsinh( πT\nis the staggered two chains are coupled by a zigzag-interchain coupling, as\nv |j − k|)\nst(1)\nwould be\npart of the bulk two-point correlation function. While is the case, for example, for SrCuO2 [17], χj\nit would be extremely difficult to obtain accurate numer- zero, i.e., there would not be any reflections to first order\nical data for two weakly coupled chains at temperatures in neighboring chains. An analysis of NMR spectra can\nT /J ∼ 0.01 as considered in fig. 2(c) we can easily check therefore also help to clarify the geometry of the relevant\nformula (11) at higher temperatures but still T /J ≪ 1. magnetic exchange couplings. Furthermore, we expect the\np-5\n\n\fJ. Sirker N.Laflorencie\nresults presented here to be also helpful for a more detailed\nanalysis of NMR spectra for systems like YBCO [3] where\nCuO chains and CuO2 planes are weakly coupled.\n∗∗∗\nThe authors thank I. Affleck and, in particular, S. Eggert for helpful discussions about the role of interchain\ncouplings.\n\n[24] Lukyanov S. and Terras V., Nucl. Phys. B , 654 (2003)\n323.\n[25] Affleck I., J. Phys. A , 31 (1998) 4573.\n[26] Sirker J. and Klümper A., Europhys. Lett., 60 (2002)\n262.\n[27] Bortz M. and Sirker J., J. Phys. A: Math. Gen., 38\n(2005) 5957.\n\nREFERENCES\n[1] Takigawa M. et al., Phys. Rev. B, 43 (1991) 247; Alloul H. et al., Phys. Rev. Lett., 67 (1991) 3140.\n[2] Ishida K., Mukuda H., Kitaoka Y., Asayama K.,\nMao Z. Q., Mori Y. and Maeno Y., Nature , 396 (1998)\n658.\n[3] Yamani Z., Statt B. W., MacFarlane W. A., Liang\nR., Bonn D. A. and Hardy W. N., Phys. Rev. B , 73\n(2006) 212506.\n[4] Takigawa M., Motoyama N., Eisaki H. and Uchida\nS., Phys. Rev. B , 55 (1997) 14129.\n[5] Boucher J. P. and Takigawa M., Phys. Rev. B , 62\n(2000) 367.\n[6] Eggert S. and Affleck I., Phys. Rev. Lett. , 75 (1995)\n934.\n[7] Alloul H., Bobroff J., Gabay M. and Hirschfeld\nP. J., Rev. Mod. Phys., 81 (2009) 45.\n[8] Martins G.B. et. al, Phys. Rev. Lett., 78 (1997) 3563.\nLaukamp M. et. al, Phys. Rev. B, 57 (1998) 10755.\nTedoldi F. et. al, Phys. Rev. Lett., 83 (1999) 412. Alet\nF. and Sorensen E.S., Phys. Rev. B, 62 (2000) 14116.\nDas J. et. al, Phys. Rev. B, 69 (2004) 144404.\n[9] Zotos X., Phys. Rev. Lett. , 82 (1999) 1764.\n[10] Benz J., Fukui T., Klümper A. and Scheeren C., J.\nPhys. Soc. Jpn. Suppl., 74 (2005) 181.\n[11] Heidrich-Meisner F., Honecker A., Cabra D.C. and\nBrenig W., Phys. Rev. B, 68 (2003) 134436.\n[12] Sirker J., Phys. Rev. B, 73 (2006) 224424.\n[13] Giamarchi T., Phys. Rev. B, 73 (1991) 2905.\n[14] Rosch A. and Andrei N., Phys. Rev. Lett., 85 (2000)\n1092.\n[15] Thurber K.R., Hunt A.W., Imai T. and Chou F.C.,\nPhys. Rev. Lett., 87 (2001) 247202.\n[16] Pratt F.L., Blundell J., Lancaster T., Baines C.\nand Takagi S., Phys. Rev. Lett., 96 (2006) 247203.\n[17] Motoyama N., Eisaki H. and Uchida S., Phys. Rev.\nLett. , 76 (1996) 3212.\n[18] Sirker J., Laflorencie N., Fujimoto S., Eggert S.\nand Affleck I., Phys. Rev. Lett. , 98 (2007) 137205; J.\nStat. Mech., (2008) P02015\n[19] Monien H., Pines D. and Takigawa M., Phys. Rev. B,\n43 (1990) 258.\n[20] Abragam A. and Bleaney B., Electron Paramagnetic\nResonance of Transition Ions (Clarendon Press) Oxford\n1970.\n[21] Rosner H., Phys. Rev. B, 56 (1997) 3402.\n[22] Eggert S. and Affleck I., Phys. Rev. B , 46 (1992)\n10866.\n[23] Mattson A.E. et al., Phys. Rev. B, 56 (1997) 15615;\nEggert S. et al., Phys. Rev. Lett., 89 (2002) 047202.\n\np-6\n\n\f"}