{"id": "http://arxiv.org/abs/1004.2189v1", "guidislink": true, "updated": "2010-04-09T15:55:59Z", "updated_parsed": [2010, 4, 9, 15, 55, 59, 4, 99, 0], "published": "2010-04-09T15:55:59Z", "published_parsed": [2010, 4, 9, 15, 55, 59, 4, 99, 0], "title": "Randomness criteria in binary visibility graph perspective", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.3416%2C1004.2810%2C1004.4078%2C1004.1627%2C1004.1894%2C1004.2874%2C1004.4318%2C1004.4705%2C1004.0141%2C1004.4867%2C1004.3190%2C1004.2191%2C1004.2821%2C1004.4759%2C1004.5450%2C1004.0138%2C1004.0933%2C1004.2649%2C1004.1154%2C1004.1540%2C1004.2182%2C1004.4479%2C1004.1339%2C1004.0147%2C1004.4900%2C1004.2802%2C1004.1013%2C1004.4279%2C1004.3039%2C1004.5365%2C1004.5006%2C1004.4586%2C1004.5583%2C1004.4044%2C1004.5265%2C1004.0521%2C1004.5208%2C1004.2189%2C1004.3654%2C1004.0450%2C1004.1919%2C1004.5543%2C1004.3307%2C1004.4350%2C1004.2256%2C1004.5524%2C1004.1733%2C1004.5567%2C1004.4527%2C1004.0572%2C1004.0339%2C1004.2495%2C1004.5573%2C1004.2818%2C1004.2061%2C1004.0614%2C1004.0290%2C1004.2890%2C1004.3535%2C1004.2503%2C1004.0418%2C1004.5015%2C1004.4801%2C1004.1033%2C1004.3136%2C1004.1650%2C1004.4626%2C1004.4715%2C1004.0121%2C1004.3286%2C1004.3570%2C1004.0292%2C1004.5508%2C1004.5293%2C1004.2927%2C1004.3590%2C1004.4001%2C1004.1195%2C1004.3912%2C1004.1034%2C1004.4055%2C1004.4877%2C1004.4122%2C1004.1518%2C1004.2206%2C1004.1964%2C1004.1038%2C1004.2654%2C1004.0123%2C1004.4672%2C1004.1379%2C1004.4945%2C1004.1864%2C1004.0652%2C1004.0679%2C1004.2389%2C1004.1307%2C1004.1146%2C1004.1588%2C1004.5244%2C1004.4499&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Randomness criteria in binary visibility graph perspective"}, "summary": "By means of a binary visibility graph, we present a novel method to study\nrandom binary sequences. The behavior of the some topological properties of the\nbinary visibility graph, such as the degree distribution, the clustering\ncoefficient, and the mean path length have been investigated. Several examples\nare then provided to show that the numerical simulations confirm the accuracy\nof the theorems for finite random binary sequences. Finally, in this paper we\npropose, for the first time, three topological properties of the binary\nvisibility graph as a randomness criteria.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.3416%2C1004.2810%2C1004.4078%2C1004.1627%2C1004.1894%2C1004.2874%2C1004.4318%2C1004.4705%2C1004.0141%2C1004.4867%2C1004.3190%2C1004.2191%2C1004.2821%2C1004.4759%2C1004.5450%2C1004.0138%2C1004.0933%2C1004.2649%2C1004.1154%2C1004.1540%2C1004.2182%2C1004.4479%2C1004.1339%2C1004.0147%2C1004.4900%2C1004.2802%2C1004.1013%2C1004.4279%2C1004.3039%2C1004.5365%2C1004.5006%2C1004.4586%2C1004.5583%2C1004.4044%2C1004.5265%2C1004.0521%2C1004.5208%2C1004.2189%2C1004.3654%2C1004.0450%2C1004.1919%2C1004.5543%2C1004.3307%2C1004.4350%2C1004.2256%2C1004.5524%2C1004.1733%2C1004.5567%2C1004.4527%2C1004.0572%2C1004.0339%2C1004.2495%2C1004.5573%2C1004.2818%2C1004.2061%2C1004.0614%2C1004.0290%2C1004.2890%2C1004.3535%2C1004.2503%2C1004.0418%2C1004.5015%2C1004.4801%2C1004.1033%2C1004.3136%2C1004.1650%2C1004.4626%2C1004.4715%2C1004.0121%2C1004.3286%2C1004.3570%2C1004.0292%2C1004.5508%2C1004.5293%2C1004.2927%2C1004.3590%2C1004.4001%2C1004.1195%2C1004.3912%2C1004.1034%2C1004.4055%2C1004.4877%2C1004.4122%2C1004.1518%2C1004.2206%2C1004.1964%2C1004.1038%2C1004.2654%2C1004.0123%2C1004.4672%2C1004.1379%2C1004.4945%2C1004.1864%2C1004.0652%2C1004.0679%2C1004.2389%2C1004.1307%2C1004.1146%2C1004.1588%2C1004.5244%2C1004.4499&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "By means of a binary visibility graph, we present a novel method to study\nrandom binary sequences. The behavior of the some topological properties of the\nbinary visibility graph, such as the degree distribution, the clustering\ncoefficient, and the mean path length have been investigated. Several examples\nare then provided to show that the numerical simulations confirm the accuracy\nof the theorems for finite random binary sequences. Finally, in this paper we\npropose, for the first time, three topological properties of the binary\nvisibility graph as a randomness criteria."}, "authors": ["S. Ahadpour", "Y. Sadra"], "author_detail": {"name": "Y. Sadra"}, "author": "Y. Sadra", "arxiv_comment": "13 pages", "links": [{"href": "http://arxiv.org/abs/1004.2189v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1004.2189v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "nlin.CD", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nlin.CD", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cs.DS", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.data-an", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1004.2189v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1004.2189v1", "journal_reference": null, "doi": null, "fulltext": "Randomness criteria in binary visibility graph\n\narXiv:1004.2189v1 [nlin.CD] 9 Apr 2010\n\nperspective\nS. Ahadpour ∗ , Y. Sadra†.\n\nDepartment of Physics, University of Mohaghegh Ardabili, Ardabil, Iran.\n\nOctober 29, 2018\n\nAbstract\nBy means of a binary visibility graph, we present a novel method to study random binary\nsequences. The behavior of the some topological properties of the binary visibility graph, such as\nthe degree distribution, the clustering coefficient, and the mean path length have been investigated.\nSeveral examples are then provided to show that the numerical simulations confirm the accuracy\nof the theorems for finite random binary sequences. Finally, in this paper we propose, for the first\ntime, three topological properties of the binary visibility graph as a randomness criteria.\n\n1\n\nIntroduction\n\nThe relationship between time series analysis and complex networks have emerged [1, 2]. Zhang et\nal. introduced a method of mapping between time series and complex networks, they found that, the\ndynamics of time series are encoded into the topology of the corresponding network [3, 4]. Lacasa et\n∗\n\nE-mail:ahadpour@uma.ac.ir\n\n†\n\nE-mail:sadra@uma.ac.ir\n\n1\n\n\f2\n\nBinary visibility graph\n\nal. have proposed an alternative mapping between time series and complex networks based on the\nvisibility graph algorithm, they are able to discriminate uncorrelated randomness from chaos series\n[5, 6].\nRecently, complex network theory has stimulated explosive interests in the study of social, informational, technological and biological systems, resulting in a deeper understanding of complex systems\n[7, 8, 9, 10]. We apply visibility algorithm as a new method for random binary sequences analysis,\nwhich converts binary sequences into complex networks. Whereas the previous works [11, 3] were\nfocused on the dynamics of a complex system is usually recorded in the form of time series, which\ncan be studied through its visibility graph from a complex network perspective. The intent of this\npaper is to propose a new binary visibility graph (BVG) which stands as a subgraph of the visibility\ngraph. The rest of the paper is organized as follows. In Sec.II we introduce the BVG algorithm.\nIn Sec.III we derive exact results for topological properties of the BVG such as degree distribution,\nlocal clustering coefficient, long distance visibility. we propose, for the first time, three topological\nproperties of the BVG as a randomness criteria. This section is followed by an outlook section.\n\n2\n\nConstruction of BVG\n\nWe start with the description of the visibility graph. By considering an arbitrary sampled time series\n{ut : t = 1, 2, ..., N }. Each data point of the time series is encoded into a node of the visibility graph.\nTwo arbitrary data points ui and uj in the time series have visibility, and consequently become two\nnodes in the associated graph, if any other data point uk such that i < k < j fulfills.\nuk < ui + (ui − uj )\n\ni−k\n.\nj −i\n\n(2-1)\n\nAn example of a time series containing 20 data points and the associated visibility graph derived from\nthe visibility algorithm is illustrated in (Fig.1). By definition, any visibility graph extracted from a\ntime series is always connected since each node see, at least its nearest neighbors and the degree of\nany node ut with 1 < t < N is more than 2. Furthermore, the constructed graph inherits several\nproperties of the series in its structure. Therefore, periodic series convert into regular graphs, random\nseries convert into irregular random graphs and fractal series do so into scale-free networks [5]. It\n\n\fBinary visibility graph\n\n3\n\nis also found that a visibility graph is invariant under affine transformation of the series data since\nthe visibility criterion is invariant under rescaling of both horizontal and vertical axes, and under\nhorizontal and vertical transformation [12].\nThe BVG is an algorithm that maps a binary sequence into a graph (as shown in Fig.2). Here, we\nbriefly describe the binary visibility algorithm in the following way:\nLet {xi }i=1,...,N be a binary sequence of N bits. The algorithm assigns each bit of the binary sequence\nto a node in the BVG the algorithm is abbreviated as BVA . Two nodes i and j in the BVG are\nconnected if one can draw a visibility line in the binary sequence joining xi and xj that does not\nintersect any intermediate bits height. xi (xj ) can only be 0 and 1. Therefore, i and j are two\nconnected nodes if the succeeding geometrical criterion is satisfied with the binary sequence:\nxi + xj > xn that xn = 0 f or all n such that i < n < j .\n\n(2-2)\n\nIt is important to note that, given a binary sequence, its BVG is a subgraph of its associated\nvisibility graph. consequently, as in the former case, the BVG associated with a binary sequence\nis always connected and undirected, since, each node sees at least its first neighbors (left-hand and\nright-hand). In what follows we will show that the simplicity of the binary version of the algorithm\nallows analytical solvability and geometrically simpler, this new method can attest to distinguish\nbetween random and non-random binary sequences.\n\n3\n\nTopological properties of the BVG\n\nIn order to investigate some statistical characteristics of the binary sequences, the following assumptions are made with respect to random binary sequences to be tested:\nUniformity: The occurrence of zeros and ones are of equal probabilities, i.e. if a sequence is of\nlength n, the expected number of ones (or zeros) is n/2.\n\nScalability: Any subsequences should have the same statistic characters with the sequence they\nrandomly extracted from, i.e. any test applicable to a sequence can also be applied to the\n\n\fBinary visibility graph\n\n4\n\nsubsequences.\n\nConsistency: The behavior of a generator must be consistent across starting values (seeds).\n\nUnder above framework, The National Institute of Standards and Technology (N IST ) statistical tests\nsuite (which can be freely down- loaded from website http://csrc.nist.gov/rng/) for random binary\nsequences offers a battery of sixteen statistical tests [13]. In the following three subsections we will\npresent three intuitive interpretations of the topological properties of the BVG .\n\n3.1\n\nDegree distribution\n\nLet us consider a bi-infinite binary sequence created from a binary valued random variable X(with\nx as its values) such that x ∈ {0, 1}. For simplicity, we will label a generic bit x0 as the \"seed\" bit\nhere after. In order to obtain the degree distribution P (k) [14] of the associated graph, we are going\nto estimate the probability of an arbitrary bit having x0 value which can be observe, k other bits. If\nk bits are observed by x0 , there will be encounter with two bounding bits with values on each side,\none on the right-hand side of x0 and the other on its (L.H.S). So that the k − 2 visible bits will be\nlocated in that window, i.e. they are zeros. This implies the minimum possible degree is k = 2.\nAs these \"inner\" bits should appear sorted by its position from seed(being on the left or right side\nif depending in the position of the seed), Hence we can say that there are exactly k − 1 different\npossible configurations {Ci }i=0,...,k−2, where the index i determines the number of inner bits on the\nright-hand side of x0 (see Fig.3). It should be mentioned that the case where k = 4 and x0 = 0 is\nan exception, since the seed is always in between two inner bits. In this paper, for a more exacting\nanalysis, we study the cases x0 = 0 and x0 = 1, separately.\nWe are calculated for the first example a set of possible configurations for a seed bit x0 with k = 4\nresult denoted in Fig.3. As it is observe the sign of the subindex in xi depending bit is whether, it\nis located at the (L.H.S)or (R.H.S) of x0 . Therefore, the boundings bits subindex directly indicates\n\n\f5\n\nBinary visibility graph\n\nthe amount of bits located in that side. As an example, in x0 = 1, C0 is the configuration where\nnone of the k − 2 = 2 inner bits are located in the (L.H.S) of x0 , and hence the left bounding bits\nare labeled as x−1 and the right bounding bits are labeled as x3 . For x0 = 0, C0 is the configuration\nwhere one of the k − 2 = 2 inner bits are located in the (L.H.S) of x0 , and therefore the left bounding\nbits are labeled as x−2 and the right bounding bits are labeled as xn+1 . Note that n hidden bits can\nbe located in the (R.H.S) of the inner bit. In x0 = 1, C1 is the configuration for which inner bits\nare located in the (L.H.S) of x0 and another inner bits are located in its (R.H.S). For x0 = 0, C1 is\nthe configuration for which n1 hidden bits are located in the (L.H.S) of x0 and n2 hidden bits are\nlocated in its (R.H.S). Finally, in x0 = 1, C2 is the configuration for which both inner bits are located\nin the (L.H.S) of the seed. For x0 = 0, C2 is the configuration where one of the k − 2 = 2 inner bits\nare located in the (R.H.S) of x0 , and therefore the right bounding bits are labeled as x2 and the left\nbounding bits are labeled as x−(n+1) . Notice that n hidden bits can be located in the (R.H.S) of the\ninner bit (see Fig. 3).\nConsequently, Ci corresponds to the configuration for which i inner bits are placed at the (R.H.S) of\nx0 , and k − 2 − i inner bits are placed at its (L.H.S). Each of these possible configurations have an\nassociated probability pi ≡ p(Ci ) that will result in P (k) such that\nP (k) =\n\nk−2\nX\n\npi .\n\n(3-3)\n\ni=0\n\nNow, the calculation of a general relation for P (k) should be done in the following steps:\nIn the first step, we are going to perform to calculation of Eq.(3), for k = 2,i.e. the probability that\nthe seed bits have two and only two visible bits. These obviously will be the bounding bits that we\nwill label x−1 and x1 for (L.H.S) and (R.H.S) of the seed, respectively. For k ≥ 2, by taking into\naccount the total probability that x0 sees is 1. Because of any bit in the introduced binary visibility\nalgorithm (sec.2), sees at least its first neighbors. Now, let us look at the particular case for Eq.(3),\ntaken at k = 2:\nFor x0 = 0:\np(x0 = 0) = P rob(x1 , x−1 = 1) =\n\n1\n8\n\n\f6\n\nBinary visibility graph\nFor x0 = 1:\np(x0 = 1) = P rob(x1 , x−1 = 1) =\n\n1\n8\n\nThen,\nP (k = 2) = p(x0 = 0) + p(x0 = 1) =\n\n1\n4\n\n(3-4)\n\nIn this step, we are going to perform to calculation of Eq.(3), for k = 3,i.e. for the seed which has\nthree and only three observable bits. In this process, we encounter with two different configurations\n: C0 , in which x0 has two bounding visible bits (x−1 and x2 , respectively) and a (R.H.S) inner bit\n(x1 , and the same for C1 but with the inner bit being placed at the (L.H.S) of the seed; so\nP (k = 3) = p(C0 ) + p(C1 ) ≡ p0 + p1\nNote that at this point for x0 = 0, an arbitrary number n of hidden bits b1 , b2 , * * * , bn can eventually\nbe located between the inner and the bounding bits, and this fact needs to be taken into account in\nthe probability calculation. The geometrical restrictions for the bj hidden bits are bj = 0( j=1,* * *,n)\nfor C0 and dj = 0( j=1,* * *,n′ ) for C1 . Then,\np0 (x0 = 0) = P rob[(xn+1 , x−1 = 1) ∩ ({bj = 0}j=1,...,n )],\np1 (x0 = 0) = P rob[(x−(n′ +1) , x1 = 1) ∩ ({dj = 0}j=1,...,n′ )],\nAt this stage we have to consider all the hidden bits totally configurations (C0 without hidden bits,\nC0 with a single hidden bit, C0 with two hidden bits, and so on, and the same for C1 ). With a little\ncalculation, one obtains\np0 (x0 = 0) =\n\n∞ Y\nn\nX\n2\n3\n[1 +\n(\np(nj ))] =\n32\n32\nn=2 j=2\n\n(3-5)\n\nwhere the first term in the square bracket in Eq.(5) corresponds to the contribution of a configuration\nwith no hidden bits and the second sums over the contributions of n hidden bits.\np0 (x0 = 1) = P rob[(x2 , x−1 = 1) ∩ (x1 = 0)] =\n\n2\n,\n32\n\nFor a similar result p1 can be find. As a consequence of this similarity the configurations are\nsymmetrical for be C0 , C1 . Ultimately, one gets\nP (k = 3) = 2(p0 (x0 = 0) + p0 (x0 = 1)) =\n\n10\n32\n\n(3-6)\n\n\f7\n\nBinary visibility graph\n\nTo continue the evaluation, we need to calculate the contributions due to the Eq.(3), for k = 4 ,\ni.e. for the seed which has four and only four observable bits. For x0 = 1(x0 = 0), we encounter\nwith three different configurations: C0 , in which x0 has two bounding visible bits x−1 , x3 (x−2 , xn+1 )\nrespectively and two (R.H.S) inner bits x1 , x2 (x−1 , x1 ) and the same for C1 but with the inner bits\nbeing place at the (L.H.S) of the seed; so\nP (k = 4) = p(C0 ) + p(C1 ) + p(C2 ) ≡ p0 + p1 + p2\nNote at this point that for x0 = 0, an arbitrary number n of hidden bits b1 , b2 , * * * , bn can eventually be located between the inner and the bounding bits, and this fact needs to be taken into\naccount in the probability calculation. The geometrical restrictions for the bj (bi ) hidden bits are\nbj = 0(j=1,* * *,n2)[bi = 0( i=-1,* * *,-n1)] for C0 and the same for C1 ,C2 . Then,\n\np0 (x0 = 0) = P rob[(xn2+1 , x−(n1+1) = 1) ∩ ({bj = 0}j=1,...,n2 ) ∩ ({bi = 0}i=−1,...,−n1 )],\nNow, we need to consider every possible hidden bits configuration (C0 without hidden bits, C0 with\na single hidden bit, C0 with two hidden bits, and so on, and the same for C1 ,C2 ). With a little\ncalculation, one obtains\np0 (x0 = 0) =\n\n∞ Y\nn\nX\n1\n2\n[1 + 2\n(\np(nj ))] =\n32\n32\nn=2 j=2\n\n(3-7)\n\nwhere the first term in the square bracket in Eq.(7) corresponds to the contribution of a configuration\nwith no hidden bits and the second sums over the contributions of n1 and n2 hidden bits.\np0 (x0 = 1) = P rob[(x3 , x−1 = 1) ∩ (x1 = 0) ∩ (x2 = 0)] =\n\n1\n,\n32\n\nWe obtain similar results for p1 (p2 ) and consequently the configuration provided by C1 (C2 ) is symmetrical to the one provided by C0 . Ultimately, one gets\nP (k = 4) = 3(p0 (x0 = 0) + p0 (x0 = 1)) =\n\n9\n32\n\n(3-8)\n\nLet us proceed by tackling the case P (k = 5), that is, the probability that the seed has five and only\nfive visible bits. Four different configurations arise: C0 , in which x0 has two bounding visible bits\n\n\f8\n\nBinary visibility graph\n\nx−1 , x4 respectively and three right-hand side inner bits x1 , x2 , x3 and the same for C1 , C2 , C3 but\nwith the inner bits being place at the left-hand side of the seed; so\nP (k = 5) = p(C0 ) + p(C1 ) + p(C2 ) + p(C3 ) ≡ p0 + p1 + p2 + p3 ,\nThen,\np0 (x0 = 1) = P rob[(x4 , x−1 = 1) ∩ (x1 = 0) ∩ (x2 = 0) ∩ (x3 = 0)] =\n\n1\n,\n64\n\nWe can find an identical result for p1 (p2 ,p3 ) and consequently the configuration provided by C1 (C2 ,C3 )\nis similar to the one provided by C0 . Ultimately, one gets\nP (k = 5) = 4p0 (x0 = 1) =\n\n4\n64\n\n(3-9)\n\nThe results of the present calculations are summarized:\n\nP (x0 = 0) =\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nP (x0 = 1) =\n\n4\n32\n\nk=2\n\n6\n32\n\nk = 3, 4\n\n0\n\nk≥5\n\n(k − 1)\n2k+1\n\nk≥2\n\nTherefore, we can argue that, for k ≥ 5:\nP (k) =\n\n(k − 1)\n2k+1\n\n(3-10)\n\nBut, in general,\nP (k) = P (x0 = 0) + P (x0 = 1)\n\n(3-11)\n\nWe can achieve that, the degree distribution P (k) of the associated BVG has the semiexponential\nform.\nThe values of χ2 goodness-of-fit test between the theoretical prediction degree distribution Eq. (11)\nand numerical results demonstrated the measure of uniformity. In order to confirm further the\naccuracy of our analytical results for the case of finite binary sequences, we have performed several\nnumerical simulations. We have generated random binary sequences of 106 bits and their associated\n\n\f9\n\nBinary visibility graph\n\nBVG. In Fig. 4 we have plotted the degree distribution of the resulting graphs (triangles correspond\nto a sequence extracted from a CCCBG tent map [15], while circles correspond to one extracted from\na CCCBG logistic map [15, 16], respectively). The line is the best fit of the theoretical , showing a\nperfect agreement with the numerics.\n\n3.2\n\nLocal clustering coefficient distribution\n\nBy means of geometrical arguments, we can obtain the local clustering coefficient C [8, 7, 17, 18, 14]\nof a BVG associated with a binary sequence. For a reference node i, C means the rate of nodes\nconnected to i that are connected between each other, where C represents the clustering. In other\nwords, we have to work out from a reference node i how many nodes from those visible to i have\nmutual visibility (triangles), normalized with the set of possible triangles (k2 ). In a first step, if a\ngeneric node i has degree k = 2, these nodes are straightforwardly two bounding bits, hence having\nmutual visibility. Hence , in this condition there exists one triangle and C(k = 2) = 1. Now if a\ngeneric node i has degree k = 3(k = 4, 5), one (two,three) of its neighbors will be an inner bit(two,\nthree bits), which will only have visibility of one of the bounding bits (by construction). We achieve\nthat in this condition we can only form three (five,five) triangles out of three(six,ten) possible ones,\nthereby:\n\nC(k) =\n\n\n\n\n1\n\n\n\n\n\n\n\n\n\n\n\n5\n6\n\n2k−5\n(k2 )\n\nk = 2, 3\n(3-12)\n\nk=4\nk≥5\n\nThis relation between k and C for k ≥ 5 allows us to deduce the local clustering coefficient distribution\nP (C) as follows:\nk−1\nP (k) = k+1 = P\n2\n\nf (C) − C + 4\nC2\n\n5C+4+f (C)\n2C\n\n!\n\n,\n\n1\n\nWhere f (C) = (C 2 − 32C + 16) 2 . In general,\n\nP (C) =\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nf (C)−C+4\nC2\n9\n32\n18\n32\n\n5C+4+f (C)\n2C\n\n0<C ≤\nC=\n\n5\n6\n\nC=1\n\n5\n10\n\n(3-13)\n\n\f10\n\nBinary visibility graph\n\nTo confirm the validity of this latter relation within finite binary sequences, in Fig. 5 we illustrate\nthe clustering distribution of a BVG associated with a random binary sequence of 106 bits (circles)\nobtained numerically. The line is the best fit of the theoretical and triangles corresponds to the\ntheoretical prediction (C = 1, 65 ), in excellent agreement with the numerics.\nThe values of χ2 goodness-of-fit test between the theoretical prediction clustering distribution Eq.\n(13) and numerical results demonstrated the measure of consistency.\n\n3.3\n\nLong distance visibility, mean degree, mean path length\n\nThe mean path length scaling [14], can be derived as below, let us first estimate the probability P (n)\nthat two bits separated by n intermediate bits be two connected nodes in the graph. By taking into\naccount a binary sequence to construct associated BVG. An arbitrary x0 = 1 from the mentioned\nsequence can be \"observe\" xn = 1 (and therefore would be connected to node xn in the graph) if and\nonly if xi = 0 for all xi (i = 1, 2, ..., n − 1). Then P (n) may be estimated as\nP (n) = prob[(x0 , xn = 1) ∩ ({xi = 0}i=1,...,n−1 )] =\n\n1\n2n\n\n(3-14)\n\nNow, we can derive the mean degree < k > of the binary visibility graph as follows:\n< k >=\n\nX\n\nkP (k) = 3.5,\n\n(3-15)\n\nwhich we can be obtained from P (n) as\n< k >= 3.5\n\n∞\nX\n\nP (n) = 3.5.\n\n(3-16)\n\nn=1\n\nAt this point, in the Fig. 6 to illustrate the adjacency matrix [14] of the BVG associated with a\nrandom binary sequence of 500 bits ( if nodes i and j are connected, then the entry i , j are filled\nin black and otherwise they are filled, blank ). Since every bit xi has visibility of its first neighbors\nxi−1 ,xi+1 , every node i will be connected by construction to nodes i − 1 and i + 1: the graph is\nthus connected. The Fig. 6 indicates that the graph is very to exact homogeneous structure,i.e.\nthe adjacency matrix is exactly filled around the main diagonal. Moreover, the matrix evidences a\nsuperposed compact structure, noticeably the visibility probability P (n) =\n\n1\n2n\n\nthat introduces some\n\n\f11\n\nBinary visibility graph\n\nshortcuts in the BVG, much in the vein of the small-world model [12]. Here, the P (n) denotes, the\nshortcuts probability.From the Statistical point of view, we can interpret the graphs structure as\nnearly homogeneous, where by increasing the size of graphs, the size of the local neighborhood do\nnot change. Hence, we can approximate its mean path length L(N ) as\nL(N ) ≈\n\nN\n−1\nX\n\nnP (n) =\n\nn=1\n\nN\n−1\nX\nn=1\n\nn\nN +1\n= 2(1 −\n)\n2n\n2N\n\n(3-17)\n\nIt is observe that, the logarithmic scaling emerged , denoting that the BVG associated with a generic\nrandom sequence is small world [12], which may be observed in the Fig. 5. The numerical results of L(N ) (circles) of a BVG associated with several random binary sequences of increasing size\nN = 27 , 28 , ..., 219 in the Fig. 7, have been plotted . The line is the best fit of the theoretical. The\nvalues of χ2 goodness-of-fit test between the theoretical prediction mean path length Eq. (17) and\nnumerical results demonstrated the measure of scalability.\n\n4\n\nConclusion and outlook\n\nIn this article, we have investigated the binary visibility graph, constructed from the random binary\nsequences. The present study illustrates the uselessness of the previous works in the analysis of\nrandom binary sequences [19, 20, 6]. We have also evaluated exact results on several topological\nproperties of the BVG associated with generic uncorrelated random binary sequences, and numerical\nsimulations confirmed its reliability for finite sequences, and the results show the three topological\nproperties of the binary visibility graph as a excellent randomness criteria.\nFurthermore, we do hope that our obtained results through this paper will pave the way for further\nstudies on nonlinear dynamical systems.\n\n5\n\nAcknowledgments\n\nThe authors would like to express their heartfelt gratitude to Mr. D. Manzoori, Mr. S. Behnia for\nthe nice editing of their paper.\n\n\fBinary visibility graph\n\n12\n\nReferences\n[1] N. Marwan, J. F. Donges, Y. Zou, R. V. Donner, J. Kurths, Complex network approach for\nrecurrence analysis of time series, Phys.Lett.A 373 (2009) 4246-4254.\n[2] P. Li, B. H. Wang, An approach to Hang Seng Index in Hong Kong stock market based on\nnetwork topological statistics, Chinese Science Bulletin 51 (2006) 624- 629.\n[3] J. Zhang , M. Small, Complex network from pseudoperiodic time series: Topology versus dynamics. Phys Rev Lett 96, (2006), 238701- 238704.\n[4] J. Zhang, J. F. Sun, X. D. Luo, K. Zhang, T. Nakamura, M. Small, Characterizing pseudoperiodic\ntime series through the complex network approach, Physica D 237 (2008) 2856 2865.\n[5] L. Lacasa, B. Luque, F. Ballesteros, J. Luque, J. C. Nuno, From time series to complex networks:\nThe visibility graph, PNAS, 105, (2008) 4972-4975.\n[6] B. Luque, L. Lacasa, F. Ballesteros, J. Luque, Horizontal visibility graphs: Exact results for\nrandom time series, physical review E 80, (2009) 046103- 11.\n[7] R. Albert, A. L. Barabasi, Statistical mechanics of complex networks, Rev Mod Phys 74, (2002),\n4797.\n[8] M. E. J. Newman, The structure and function of complex networks, SIAM Rev 45, (2003) 167256.\n[9] S.N. Dorogovtsev, J. F. F. Mendes, Evolution of Networks: From Biological Nets to the Internet\nand the WWW, Oxford University Press, Oxford, 2003.\n[10] S. Boccaletti, V. Latora, Y. Moreno, M. Chavez, D. U. Hwang, Phys. Rep. 424 (2006) 175- 308.\n[11] X. H. Ni, Z. Q. Jiang, W. X. Zhou, Degree distributions of the visibility graphs mapped from\nfractional Brownian motions and multifractal random walks, Phys. Lett. A, 373 (2009) 3822\n-3826.\n[12] D. J. Watts and S. H. Strogatz, Collective dynamics of 'small-world' networks, Nature, 393,\n(1998) 440 -442.\n\n\fBinary visibility graph\n\n13\n\n[13] National Institute of Standards and Technology, A statistical testsuit for random and pseudorandomnumber generators for cryptographic applications, NIST special publication, (2001)\n800-22.\n[14] B. Bollobs, Modern Graph Theory, Springer-Verlag, New York, (1998).\n[15] P. K. Narendra , P. Vinod , K. K. Sud, A Random Bit Generator Using Chaotic Maps, International Journal of Network Security, 10, (2010) 32-38 .\n[16] A. Kanso, N. Smaoui, Logistic chaotic maps for binary numbers generations,Chaos, Solitons and\nFractals, 40 (2009) 2557 2568.\n[17] S. Dorogovtsev, J. F. F. Mendes, Evolution of networks, Adv. Phys. 51, (2002) 1079-1187 .\n[18] S. Boccaletti, V. Latora, Y. Moreno, M. Chvez, D. U. Hwang, Complex networks: Structure and\ndynamics, Phys. Rep. 424,(2006) 175-308.\n[19] A. L. Barabsi, R. Albert, Emergence of scaling in random networks, Science 286 (1999) 509 -512.\n[20] L. Chuang , Z. Wei-Xing , Y. Wei-Kang , Statistical properties of visibility graph of energy dissipation rates in three-dimensional fully developed turbulence,http://arxiv.org/abs/0905.1831v2.\n\n\f"}