{"id": "http://arxiv.org/abs/1005.4677v1", "guidislink": true, "updated": "2010-05-25T20:00:02Z", "updated_parsed": [2010, 5, 25, 20, 0, 2, 1, 145, 0], "published": "2010-05-25T20:00:02Z", "published_parsed": [2010, 5, 25, 20, 0, 2, 1, 145, 0], "title": "Peculiarities in Velocity Dispersion and Surface Density Profiles of\n  Star Clusters", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.3073%2C1005.1087%2C1005.3967%2C1005.0897%2C1005.0399%2C1005.0734%2C1005.1273%2C1005.5238%2C1005.4056%2C1005.1212%2C1005.4469%2C1005.1470%2C1005.1945%2C1005.3428%2C1005.4079%2C1005.2080%2C1005.3302%2C1005.2795%2C1005.1873%2C1005.1496%2C1005.3263%2C1005.4151%2C1005.3990%2C1005.0765%2C1005.4814%2C1005.2024%2C1005.4361%2C1005.1837%2C1005.3798%2C1005.1074%2C1005.1914%2C1005.4088%2C1005.1612%2C1005.1991%2C1005.5395%2C1005.1280%2C1005.1240%2C1005.3264%2C1005.0569%2C1005.3312%2C1005.0420%2C1005.3402%2C1005.5259%2C1005.1365%2C1005.2445%2C1005.3313%2C1005.1008%2C1005.4413%2C1005.4376%2C1005.1343%2C1005.1393%2C1005.1221%2C1005.3050%2C1005.2378%2C1005.1571%2C1005.1500%2C1005.2004%2C1005.2644%2C1005.1858%2C1005.5275%2C1005.3666%2C1005.5585%2C1005.1317%2C1005.3486%2C1005.4809%2C1005.1285%2C1005.4828%2C1005.1486%2C1005.0918%2C1005.3939%2C1005.1763%2C1005.2331%2C1005.5016%2C1005.3855%2C1005.4677%2C1005.1889%2C1005.2740%2C1005.3184%2C1005.3394%2C1005.5002%2C1005.1724%2C1005.2244%2C1005.0954%2C1005.1378%2C1005.0564%2C1005.1380%2C1005.0866%2C1005.2387%2C1005.3009%2C1005.2542%2C1005.1538%2C1005.2820%2C1005.4665%2C1005.2131%2C1005.4551%2C1005.4355%2C1005.5361%2C1005.1457%2C1005.4293%2C1005.5604%2C1005.0347&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Peculiarities in Velocity Dispersion and Surface Density Profiles of\n  Star Clusters"}, "summary": "Based on our recent work on tidal tails of star clusters (Kuepper et al.\n2009) we investigate star clusters of a few 10^4 Msun by means of velocity\ndispersion profiles and surface density profiles. We use a comprehensive set of\n$N$-body computations of star clusters on various orbits within a realistic\ntidal field to study the evolution of these profiles with time, and ongoing\ncluster dissolution From the velocity dispersion profiles we find that the\npopulation of potential escapers, i.e. energetically unbound stars inside the\nJacobi radius, dominates clusters at radii above about 50% of the Jacobi\nradius. Beyond 70% of the Jacobi radius nearly all stars are energetically\nunbound. The velocity dispersion therefore significantly deviates from the\npredictions of simple equilibrium models in this regime. We furthermore argue\nthat for this reason this part of a cluster cannot be used to detect a dark\nmatter halo or deviations from Newtonian gravity. By fitting templates to the\nabout 10^4 computed surface density profiles we estimate the accuracy which can\nbe achieved in reconstructing the Jacobi radius of a cluster in this way. We\nfind that the template of King (1962) works well for extended clusters on\nnearly circular orbits, but shows significant flaws in the case of eccentric\ncluster orbits. This we fix by extending this template with 3 more free\nparameters. Our template can reconstruct the tidal radius over all fitted\nranges with an accuracy of about 10%, and is especially useful in the case of\ncluster data with a wide radial coverage and for clusters showing significant\nextra-tidal stellar populations. No other template that we have tried can yield\ncomparable results over this range of cluster conditions. All templates fail to\nreconstruct tidal parameters of concentrated clusters, however. (abridged)", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.3073%2C1005.1087%2C1005.3967%2C1005.0897%2C1005.0399%2C1005.0734%2C1005.1273%2C1005.5238%2C1005.4056%2C1005.1212%2C1005.4469%2C1005.1470%2C1005.1945%2C1005.3428%2C1005.4079%2C1005.2080%2C1005.3302%2C1005.2795%2C1005.1873%2C1005.1496%2C1005.3263%2C1005.4151%2C1005.3990%2C1005.0765%2C1005.4814%2C1005.2024%2C1005.4361%2C1005.1837%2C1005.3798%2C1005.1074%2C1005.1914%2C1005.4088%2C1005.1612%2C1005.1991%2C1005.5395%2C1005.1280%2C1005.1240%2C1005.3264%2C1005.0569%2C1005.3312%2C1005.0420%2C1005.3402%2C1005.5259%2C1005.1365%2C1005.2445%2C1005.3313%2C1005.1008%2C1005.4413%2C1005.4376%2C1005.1343%2C1005.1393%2C1005.1221%2C1005.3050%2C1005.2378%2C1005.1571%2C1005.1500%2C1005.2004%2C1005.2644%2C1005.1858%2C1005.5275%2C1005.3666%2C1005.5585%2C1005.1317%2C1005.3486%2C1005.4809%2C1005.1285%2C1005.4828%2C1005.1486%2C1005.0918%2C1005.3939%2C1005.1763%2C1005.2331%2C1005.5016%2C1005.3855%2C1005.4677%2C1005.1889%2C1005.2740%2C1005.3184%2C1005.3394%2C1005.5002%2C1005.1724%2C1005.2244%2C1005.0954%2C1005.1378%2C1005.0564%2C1005.1380%2C1005.0866%2C1005.2387%2C1005.3009%2C1005.2542%2C1005.1538%2C1005.2820%2C1005.4665%2C1005.2131%2C1005.4551%2C1005.4355%2C1005.5361%2C1005.1457%2C1005.4293%2C1005.5604%2C1005.0347&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Based on our recent work on tidal tails of star clusters (Kuepper et al.\n2009) we investigate star clusters of a few 10^4 Msun by means of velocity\ndispersion profiles and surface density profiles. We use a comprehensive set of\n$N$-body computations of star clusters on various orbits within a realistic\ntidal field to study the evolution of these profiles with time, and ongoing\ncluster dissolution From the velocity dispersion profiles we find that the\npopulation of potential escapers, i.e. energetically unbound stars inside the\nJacobi radius, dominates clusters at radii above about 50% of the Jacobi\nradius. Beyond 70% of the Jacobi radius nearly all stars are energetically\nunbound. The velocity dispersion therefore significantly deviates from the\npredictions of simple equilibrium models in this regime. We furthermore argue\nthat for this reason this part of a cluster cannot be used to detect a dark\nmatter halo or deviations from Newtonian gravity. By fitting templates to the\nabout 10^4 computed surface density profiles we estimate the accuracy which can\nbe achieved in reconstructing the Jacobi radius of a cluster in this way. We\nfind that the template of King (1962) works well for extended clusters on\nnearly circular orbits, but shows significant flaws in the case of eccentric\ncluster orbits. This we fix by extending this template with 3 more free\nparameters. Our template can reconstruct the tidal radius over all fitted\nranges with an accuracy of about 10%, and is especially useful in the case of\ncluster data with a wide radial coverage and for clusters showing significant\nextra-tidal stellar populations. No other template that we have tried can yield\ncomparable results over this range of cluster conditions. All templates fail to\nreconstruct tidal parameters of concentrated clusters, however. (abridged)"}, "authors": ["A. H. W. Kuepper", "P. Kroupa", "H. Baumgardt", "D. C. Heggie"], "author_detail": {"name": "D. C. Heggie"}, "author": "D. C. Heggie", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1111/j.1365-2966.2010.17084.x", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1005.4677v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1005.4677v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "23 pages, 13 figures, accepted for publication in MNRAS", "arxiv_primary_category": {"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1005.4677v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1005.4677v1", "journal_reference": null, "doi": "10.1111/j.1365-2966.2010.17084.x", "fulltext": "Mon. Not. R. Astron. Soc. 000, 1–20 (2009)\n\nPrinted 23 October 2018\n\n(MN LATEX style file v2.2)\n\narXiv:1005.4677v1 [astro-ph.GA] 25 May 2010\n\nPeculiarities in Velocity Dispersion and Surface Density\nProfiles of Star Clusters\nAndreas\nH.W. Küpper1,2⋆ , Pavel Kroupa1, Holger Baumgardt1,3 and Douglas C. Heggie4\n1\nArgelander Institut für Astronomie (AIfA), Auf dem Hügel 71, 53121 Bonn, Germany\nSouthern Observatory, Alonso de Cordova 3107, Vitacura, Santiago, Chile\n3 University of Queensland, School of Mathematics and Physics, QLD 4072, Australia\n4 University of Edinburgh, School of Mathematics and Maxwell Institute for Mathematical Sciences, King's Buildings, Edinburgh EH9 3JZ, UK\n2 European\n\nAccepted . . . . Received . . . ; in original form . . .\n\nABSTRACT\n\nBased on our recent work on tidal tails of star clusters (Küpper et al. 2010) we investigate star clusters of a few 104 M⊙ by means of velocity dispersion profiles and\nsurface density profiles. We use a comprehensive set of N -body computations of star\nclusters on various orbits within a realistic tidal field to study the evolution of these\nprofiles with time, and ongoing cluster dissolution.\nFrom the velocity dispersion profiles we find that the population of potential escapers,\ni.e. energetically unbound stars inside the Jacobi radius, dominates clusters at radii\nabove about 50% of the Jacobi radius. Beyond 70% of the Jacobi radius nearly all\nstars are energetically unbound. The velocity dispersion therefore significantly deviates from the predictions of simple equilibrium models in this regime. We furthermore\nargue that for this reason this part of a cluster cannot be used to detect a dark matter\nhalo or deviations from Newtonian gravity.\nBy fitting templates to the about 104 computed surface density profiles we estimate\nthe accuracy which can be achieved in reconstructing the Jacobi radius of a cluster in\nthis way. We find that the template of King (1962) works well for extended clusters on\nnearly circular orbits, but shows significant flaws in the case of eccentric cluster orbits.\nThis we fix by extending this template with 3 more free parameters. Our template\ncan reconstruct the tidal radius over all fitted ranges with an accuracy of about 10%,\nand is especially useful in the case of cluster data with a wide radial coverage and\nfor clusters showing significant extra-tidal stellar populations. No other template that\nwe have tried can yield comparable results over this range of cluster conditions. All\ntemplates fail to reconstruct tidal parameters of concentrated clusters, however.\nMoreover, we find that the bulk of a cluster adjusts to the mean tidal field which it\nexperiences and not to the tidal field at perigalacticon as has often been assumed in\nother investigations, i.e. a fitted tidal radius is a cluster's time average mean tidal\nradius and not its perigalactic one.\nFurthermore, we study the tidal debris in the vicinity of the clusters and find it to\nbe well represented by a power-law with a slope of -4 to -5. This steep slope we ascribe to the epicyclic motion of escaped stars in the tidal tails. Star clusters close to\napogalacticon show a significantly shallower slope of up to -1, however. We suggest\nthat clusters at apogalacticon can be identified by measuring this slope.\nKey words: galaxies: kinematics and dynamics – galaxies: star clusters – methods:\nanalytical – methods: N -body simulations\n\n1\n\n⋆\n\nE-mail:\nakuepper@astro.uni-bonn.de\n(AHWK);\npavel@astro.uni-bonn.de (PK); h.baumgardt@uq.edu.au (HB);\nd.c.heggie@ed.ac.uk (DCH)\n\nINTRODUCTION\n\nVelocity dispersion profiles and surface density profiles are\namong the most basic tools for investigating the structure\nof star clusters. However, such investigations indicate\nthat the region around the tidal radius, at which the\ninternal acceleration of a star cluster is similar to the tidal\n\n\f2\n\nA.H.W. Küpper, P. Kroupa, H. Baumgardt and D.C. Heggie\n\nacceleration due to the galactic tidal field, is particularly\npoorly understood.\nVelocity dispersion profiles sometimes show peculiarities which have been discussed in the literature.\nDrukier et al. (1998), for example, observed a flattening\nin the outer parts of the velocity dispersion profile of the\nGalactic globular cluster M15 which they interpreted as\nan effect of tidal heating by the general Galactic tide or\nby tidal shocks. Scarpa, Marconi & Gilmozzi (2003) also\nfound a flattening of the velocity dispersion profile for ω\nCen and more recently for other Galactic globular clusters\nlike NGC6171, NGC7099 and NGC288 (Scarpa et al. 2007).\nThe deviation from an expected Keplerian fall-off in the\nvelocity dispersion profile occurred in all clusters at radii\nwhere the internal gravitational acceleration is about\na0 = 1.2 × 10−8 cm s−2 and was therefore interpreted by\nScarpa et al. as a hint of Modified Newtonian Dynamics\n(Milgrom 1983) in globular clusters. Alternatively, they\nbriefly discussed the possible effect of tidal heating or a\ndark matter halo on the cluster stars.\nOn the contrary, McLaughlin & Meylan (2003b) found\nthat by fitting a Wilson (1975) model, which has a less\nsharp cut-off at the tidal radius than the commonly used\nKing (1966) model, to the re-analyzed ω Cen data, its\nvelocity dispersion profile could be explained without modifying Newtonian gravity and without adding dark matter.\nSimilar investigations of cluster profiles, e.g. Lane et al.\n(2009, 2010) and Baumgardt et al. (2010), were also not in\nfavour of MOND.\nBut it is not only the velocity dispersion profiles of\nstar clusters which behave strangely at the tidal boundary;\ntheir surface density profiles also show peculiarities and\nsometimes controversial behaviour.\nKing (1962) showed that the surface density profiles of\nmany globular clusters can be fitted by a simple analytical\nformula having a sharp cut-off radius, which could be\ninterpreted as the tidal radius of the cluster. Later he\nderived a set of physically motivated models, with a similar\ncut-off radius corresponding to an energy cut-off in the\nenergy distribution function of the cluster stars, which\nprovided an even better fit to cluster profiles (King 1966).\nIn contrast to that, Elson, Fall & Freeman (1987),\nand more recently Gouliermis et al. (2010), found that\nyoung massive clusters in the LMC show an exponential\nsurface density profile without any tidal truncation at\nthe expected tidal radius. They interpreted these findings as being due to tidal debris which was expelled at\nbirth from the clusters and has not had time to disperse yet.\nFurthermore,\nCôté et al.\n(2002),\nCarraro, Zinn & Moni Bidin (2007) and Carraro (2009)\nfind the outer halo Milky-Way globular clusters Palomar\n13, Whiting 1 and AM 4, respectively, to have a significant\nexcess of stars at the tidal boundary, which makes any\nfit to the surface density data very inaccurate. For all\nclusters they find the radial surface density profile, Σ(R),\nto be well represented by a power-law Rη with slopes of\n\nabout η ≃ −1.8. This excess of stars is interpreted by the\nauthors as heavy mass loss in a final stage of dissolution.\nThe same was found for Palomar 5, which is a well studied\nMW globular cluster close to the apogalacticon of its orbit\n(Odenkirchen et al. 2003).\nMoreover, McLaughlin & van der Marel (2005) showed\nthat most globular clusters of the Milky Way, the LMC and\nSMC, as well as of the Fornax dwarf spheroidal, are more\nextended than can be explained by King (1966) models,\nand therefore are better represented by Wilson (1975)\nmodels. In this context they emphasised the lack of physical\nunderstanding of this phenomenon.\nOn the contrary, Barmby et al. (2009) found that of 23\nyoung massive clusters in M31 most were better fitted by\nKing (1966) models as these clusters do not show extended\nhaloes.\nAs a consequence of this lack of understanding,\nBarmby et al. (2009) asked in their investigation how\nrobust the physical parameters are which were derived in\nsuch analyses. This they tried to estimate by analyzing\nartificial clusters in the same way as the real observations. A similar analysis has also been performed by\nBonatto & Bica (2008), although they tested the analytic\nformula of King (1962) with artificial observations under\nvarious limiting conditions. Both investigations came\nto the conclusion that physical parameters can in principle be well recovered from such idealized mock observations.\nBut probably the idealized nature of these investigations is misleading, since both tests were performed with\ndynamically unevolved clusters. However, a self-consistent\ntest of deriving physical parameters from a set of numerical\ncomputations of star clusters with a range of initial parameters has not been performed yet. Just a few investigations\nhave touched this topic so far by means of numerical computations (e.g. Capuzzo Dolcetta, Di Matteo, & Miocchi\n2005, Drukier et al. 2007, Trenti, Vesperini & Pasquato\n2010). This is due to the fact that fast codes for globular\ncluster integration like Fokker-Planck or Monte-Carlo codes\nare not able to address this problem properly, as they\ncannot follow the evolution of the tidal debris and are\nrestricted to cut-off criteria in energy or angular momentum\nspace. Moreover, limits in computational power prevented\nus from carrying out such investigations by means of\ncollisional N -body codes. But the recent improvements in\ncomputational speed of N -body codes and the availability\nof accelerator hardware (GRAPEs, GPUs) now allows us to\nstudy the dynamical evolution of star clusters with masses\nof up to several times 104 M⊙ .\nThus, by computing various star clusters in a range of\ntidal conditions over several Gyr we investigate the structure\nof star clusters, and in particular the evolution of the region\naround the tidal radius - the transition region between the\nstar cluster and the tidal tails - in terms of velocity dispersion and surface density profiles. The paper is organized as\nfollows: first, a brief introduction to the topic of potential\nescapers is given in Sec. 2 as these stars play a key role in\nthis investigation. Then a few methodological remarks will\n\n\fPeculiarities in Velocity Dispersion and Surface Density Profiles of Star Clusters\nbe made in Sec. 3 before we come to the velocity dispersion\nprofiles in Sec. 4.1 and then to the surface density profiles\nin Sec. 4.2. In the last section we will give a summary with\na brief discussion.\n\n2\n\nescape from the cluster on an escape time scale which is\ngiven by (Fukushige & Heggie 2000, equation 9 therein)\ntesc ∝ tcr\n\n\u0010\n\nE − Ecrit\nEcrit\n\n\u0011−2\n\n,\n\n(2)\n\nwhere Ecrit is the critical energy at the Lagrange points,\ni.e. at the Jacobi radius. From this it follows that the excess\nenergy can be written as\n\nPOTENTIAL ESCAPERS\n\nA major problem in producing velocity dispersion and\nsurface density profiles from observations is how to disentangle cluster members from background/foreground stars.\nBy only looking at stars which are inside a projected,\nestimated Jacobi radius with similar radial velocities and\ncolours it is at least possible to distinguish between the\ncluster population and field stars. Even here, however,\nthe question arises whether the choice of the cut in radial\nvelocity significantly influences the results, especially of\nthe velocity dispersion profile (see Küpper & Kroupa\n2010). Moreover, one has to be careful with how the\nJacobi radius was estimated, i.e. was it evaluated using a\nmass estimate and was the mass estimated through the\nvelocity dispersion? Or was the Jacobi radius estimated\nby a cut-off radius in the profile and is the assumption\nthat this cut-off radius is equal to the Jacobi radius\nreasonable? What if the cluster is on an eccentric orbit\nabout the galaxy; how does this influence the cut-off radius?\nBesides, the observer does not know if the stars in\nthe sample which was extracted in this way are actually\nmembers of the cluster or if they are already evaporated\nfrom the cluster and are now part of its tidal debris, and\njust lie in projection within the cluster.\nBut even if the observer could distinguish between stars\ninside the Jacobi radius and those that are beyond this\nradius, it would still be unclear if the stars in the sample are\nbound to the cluster or have already gained enough energy\nto leave the cluster but just haven't done so yet. These,\nso-called, potential escapers will have a significant influence\non both the surface density and the velocity dispersion\nprofile, if there is a non-negligible fraction of them in the\ncluster, as these stars will make the profiles deviate from\nany theory which does not take them into account - which\nmost theoretical approaches do not.\nIn numerical modelling of star clusters we have detailed\nphase space information on every single star in the computation. Mainly by numerical investigations it has been found\nthat the escape process through which stars escape from a\ncluster in a constant tidal field, e.g. on a circular orbit about\na galaxy, is divided into two steps. First the stars get unbound via two-body relaxation, thus on a relaxation time\nscale (ignoring constants),\ntrel ∝ N tcr ,\n\n3\n\n(1)\n\nwhere N is the number of stars in the cluster and tcr is\nthe crossing time of the cluster (note that we neglected the\nslowly varying Coulomb logarithm in eq. 1, for further details see e.g. Heggie & Hut 2003). In the second step, these\nenergetically unbound stars, or potential escapers, with specific energy E higher than some critical escape energy Ecrit ,\n\nE − Ecrit\n∝ (tcr /tesc )1/2 .\nEcrit\n\n(3)\n\nOn the other hand, the relation\nE − Ecrit\n∝ (tesc /trel )1/2\nEcrit\n\n(4)\n\nholds, whence we find that\ntesc ∝ (tcr trel )1/2 .\n\n(5)\n\nHence, a fraction of stars with excess energy (E −\nEcrit )/Ecrit escapes on a time scale tesc and the time scale\nof mass loss, e.g. the time on which a cluster dissolves, tdiss ,\nis given by\ntdiss\n\n\u0010E − E\n\n∝\n\ntesc\n\n∝\n\nt1/4\ncr trel\n\n∝\n\ntrel N\n\ncrit\n\nEcrit\n\n3/4\n\n−1/4\n\n\u0011−1\n\n(6)\n(7)\n(8)\n\nwhich was also found by Baumgardt (2001). This result is\nin contrast to the 'classic' picture where the dissolution\ntimes of clusters scale with the relaxation time (see e.g.\nBinney & Tremaine 2008), i.e.\ntdiss ∝ trel ,\n\n(9)\n\nand demonstrates the importance of potential escapers\non the dissolution process of star clusters. The remaining\nquestion is whether the population of potential escapers is\nlarge enough that it also has an influence on the velocity\ndispersion and surface density profiles. For clusters of a few\n104 stars in a constant tidal field Baumgardt (2001) finds\nabout 10-20% of all stars within the Jacobi radius to be\npotential escapers, Just et al. (2009) even find the fraction\nof potential escapers for similar clusters to be 1/3 of the\ncluster population. Moreover, Baumgardt (2001) found that\nfor clusters in a constant tidal field the fraction of potential\nescapers varies with the number of stars within a cluster\napproximately as N −1/4 . Thus, this fraction should still be\nsignificant for high-N globular clusters.\nStar clusters in time-dependent tidal fields have not\nbeen investigated in this respect yet, but as tidal perturbations tend to increase the energy of the stars in a cluster\n(e.g. Gnedin, Lee & Ostriker 1999), the population of potential escapers should be even larger in such clusters. Thus,\npotential escapers should have a significant effect on both\nthe velocity dispersion and the surface density profiles of all\nkinds of star clusters.\n\n3\n\nMETHOD\n\nWhen analyzing velocity dispersion and surface density\ndata of star clusters, confusion over nomenclature often\n\n\f4\n\nA.H.W. Küpper, P. Kroupa, H. Baumgardt and D.C. Heggie\n\narises. Therefore we strictly stick to the following three\nterms: profiles, models and templates. The first will be\nused for the data, which in our case comes from N -body\ncomputations but might also originate from observations.\nThe term models will be used for physically motivated\ndistribution functions such as those proposed by King\n(1966) or Wilson (1975). The word templates covers the\nanalytic expressions which have been found empirically and\nwhich do not originate from a physical derivation by being\nsolutions of the Collisionless Boltzmann Equation (e.g.\nKing 1962; Elson, Fall & Freeman 1987; Lauer et al. 1995).\nThe word template hereby emphasises their artificial nature.\n\ngives the\nTable 1. Overview of all computed models. Rapo\nG\napogalactic radius of the cluster orbit and ǫ the corresponding\nperi\napo\neccentricity. The latter is defined as ǫ = (Rapo\nG − RG )/(RG +\napo\nperi\nRG ) with RG being the apogalactic radius of the cluster orbit,\nand Rperi\nbeing the perigalactic radius. Rhp /RJ gives the initial\nG\nconcentration of the model, whereas Rh is the initial half-mass\nradius. The clusters are divided into three categories: extended\nclusters in a constant tidal field (A0-D0), extended clusters in\ntime-dependent tidal fields (A1-D3) and compact clusters (A0cD0c). Note that each model has initially N = 64k stars, a lower\nstellar mass limit of 0.1 M⊙ and an upper limit of 1.2 M⊙ .\nRapo\nG [kpc]\n\nǫ\n\nRhp\nRJ\n\nRh [pc]\n\nA0\nB0\nC0\nD0\n\n4.25\n8.50\n12.75\n17.0\n\n0.00\n0.00\n0.00\n0.00\n\n0.15\n0.15\n0.15\n0.15\n\n5.8\n8.8\n11.7\n14.3\n\nA1/A2/A3\nB1/B2/B3\nC1/C2/C3\nD1/D2/D3\n\n4.25\n8.50\n12.75\n17.0\n\n0.25/0.50/0.75\n0.25/0.50/0.75\n0.25/0.50/0.75\n0.25/0.50/0.75\n\n0.15\n0.15\n0.15\n0.15\n\n5.8\n8.8\n11.7\n14.3\n\nA0c\nB0c\nC0c\nD0c\n\n4.25\n8.50\n12.75\n17.0\n\n0.00\n0.00\n0.00\n0.00\n\n0.08\n0.06\n0.05\n0.04\n\n3.0\n3.0\n3.0\n3.0\n\nName\n\nFurther confusion arises about the term tidal radius.\nAgain there is a physically motivated and an empirical\nversion. The former is the radius at which the internal\ngravitational acceleration equals the tidal acceleration from\nthe host galaxy (see e.g. Binney & Tremaine 2008). This\nwill be named Jacobi radius in our text. The empirical tidal\nradius is defined through the cut-off radius of the models\nand templates which are fitted to the profiles. We will refer\nto this cut-off radius as edge radius here and would like\nto emphasise that Jacobi radius and edge radius are two\ndifferent concepts and therefore are not necessarily equal.\nIn fact, we will show that the two are often significantly\ndifferent and that conclusions from a fitted edge radius\nshould be drawn with caution.\nNote also that the results of this investigation cannot\nbe easily scaled to more massive globular clusters, as the\nrelative importance of tidal features depends on the mass of\nthe cluster, since the mass in the tidal debris is proportional\nto the mass-loss rate of the cluster and the mass-loss rate\ndoes not scale linearly with cluster mass, M , but rather\nwith M 1/4 (Baumgardt & Makino 2003).\nMoreover, even though we have some concentrated\nclusters in our sample this investigation focuses on less\nconcentrated clusters, with a ratio of projected half mass\nradius to Jacobi radius between 0.1 < Rhp /RJ < 0.3\nbecause Baumgardt et al. (2010) showed that clusters with\nratios of Rhp /RJ < 0.05 cannot be properly fitted by either\nKing (1962) templates or King (1966) models as their ratio\nof Rhp /RJ is too high. Therefore, our conclusions mainly\nhold for less concentrated clusters which Baumgardt et al.\n(2010) named the extended cluster population, and which\nare likely to be on the main sequence of cluster evolution\n(Küpper, Kroupa & Baumgardt 2008), the final and universal stage of cluster evolution after core collapse, where\nthe ratio Rhp /RJ only depends on the mass of the cluster.\nIn the following sections we will first give some details\nabout our data set before we explain how we extract the\nvelocity dispersion and surface density profiles. Thereafter\nwe briefly describe the analytical templates which are used\nin this investigation and specify our fitting method.\n3.1\n\nData set\n\nThe velocity dispersion and surface density profiles are\nmainly taken from our recent investigation of star clusters\nand their tidal tails (Küpper et al. 2010). For this analysis\n\nwe computed a comprehensive set of star clusters on various\norbits about a Milky-Way potential.\nIn addition to the 16 clusters taken from Küpper et al.\n(2010), we computed 4 concentrated clusters which are of\nspecific interest for this investigation. All clusters were setup using the publicly available code McLuster1 (Küpper et\nal., in prep.), and integrated over time with the N -body code\nNBODY4 (Aarseth 2003) on the GRAPE-6A computers at\nAIfA Bonn (Fukushige, Makino & Kawai 2005). The code\nwas modified so that the Milky-Way potential suggested by\nAllen & Santillan (1991) could be used. Due to its analytic\nform this potential is useful for calculating the Jacobi radius,\nRJ , of the star clusters. Throughout the computations RJ\nwas evaluated using equation 12 of Küpper et al. (2010), i.e.\nRJ =\n\nGM\n,\n2\nΩ2 − ∂ 2 Φ/∂RG\n\n(10)\n\nwhere G is the gravitational constant, M is the cluster\nmass, Ω is the angular velocity of the cluster on its orbit\n2\nabout the galaxy, and ∂ 2 Φ/∂RG\nis the second derivative of\nthe gravitational potential of the galaxy with respect to the\ngalactocentric radius, RG . We always determine the Jacobi\nradius iteratively, assuming first a mass of the cluster, then\napplying eq. 10. With this estimate we determine the mass\nof the cluster again, counting all masses around the cluster\ncentre within RJ , and compute the Jacobi radius once\nmore, and so on until the value of RJ converges.\nThe clusters were set up using a Plummer density\ndistribution with a ratio of half-mass radius to Jacobi radius\nof Rh /RJ = 0.2, i.e. a ratio of projected half-mass radius\n\n1\n\nwww.astro.uni-bonn.de/~akuepper/mcluster/mcluster.html\n\n\fPeculiarities in Velocity Dispersion and Surface Density Profiles of Star Clusters\nto Jacobi radius of Rhp /RJ = 0.15. This choice resembles\nthe extended globular clusters of the Milky Way, which are\nless concentrated, and stand in contrast to the compact\nclusters, which are deeply embedded within their Jacobi\nradius and for which tidal influences are rather negligible\n(Baumgardt et al. 2010).\nAll clusters had initially 65536 stars which were\ndrawn from the canonical IMF2 (Kroupa 2001) ranging\nfrom 0.1 M⊙ to 1.2 M⊙ , resulting in a total initial mass\nof about 20 000 M⊙ . All clusters were modelled without\nstellar evolution and without primordial binaries. They\nwere computed for a time span of 4 Gyr, if they did not\ndissolve before reaching this age. An overview of all clusters\nin our sample is given in Tab. 1.\nFor all clusters we produced two-dimensional snapshots\nof the stars projected onto the orbital plane every 10 Myr;\nthus, as each of the 20 clusters is modelled over 4 Gyr, we\nhave about 20 × 400 ∼ 104 representations of star clusters.\nIn each snapshot we determine the centre of the cluster stars\nwithin the Jacobi radius following Casertano & Hut (1985)\nand bin the stars around this centre in 50 annuli of equal\nlogarithmic width between 1.0 pc and 500 pc to produce\nthe velocity dispersion and surface density profiles. By going out to 500 pc we are able to show not only the region\nclose to the Jacobi radius but also a considerable part of the\ntidal tails, which have not been investigated in this respect\nyet, but show an interesting, variable behaviour, depending\non the cluster orbit, which can even influence the velocity\ndispersion and surface density within the Jacobi radius (see\nKüpper et al. 2010). For most of the investigation, however,\nwe concentrate on the inner 100 pc.\n3.2\n\nVelocity dispersion profiles\n\nIn each annulus the velocity dispersion along the line-of-sight\n(los), σ, is determined using\nσ2 =\n\nN\n1 X\n(vi − v)2 = v 2 − v 2 ,\nN\n\n(11)\n\ni=1\n\nwhere vi is the velocity of the i-th star along the line-of-sight,\nv is the mean los velocity of the N stars in the annulus,\nand v 2 is their mean squared los velocity. In addition, we\nestimate an uncertainty for each velocity dispersion,\nN\n\u00012\n1 X\n∆σ 2 = 2 2\n(vi − v)2 − σ 2 ,\nN σ\n\n(12)\n\ni=1\n\nwhich originates from a Taylor expansion of the standard\ndeviation of the velocity dispersion.\nThe velocity dispersion is first measured by taking\ninto account all stars in the snapshot, independent of their\nprojected distance from the cluster centre, which is what\nan ideal observer would see. Then it is measured for only\nthe stars within the Jacobi radius, i.e. r 6 RJ . In this way\n2 The canonical IMF has a slope of α = 1.3 for stellar masses\n1\nm = 0.08 − 0.5 M⊙ , and the Salpeter slope α2 = 2.3 for m >\n0.5 M⊙ .\n\n5\n\nwe will investigate the effect of foreground/background\nstars, i.e. stars in the tidal debris, on the observed velocity\ndispersion. Finally we measure σ taking only the bound\nstars into account to test if energetically unbound stars have\na significant influence on the observed velocity dispersion.\nFor this purpose we have to search for potential escapers\nand remove them from the sample. Thus, bound stars are\ndefined as stars which are inside the Jacobi radius and which\nhave a Jacobi energy smaller than\nEcrit = −\n\n3GM\n,\n2RJ\n\n(13)\n\nwhich is the critical energy at the Lagrange points, i.e. at the\nJacobi radius. We therefore compute the Jacobi energy, E,\nof each star with mass m in a co-rotating reference frame, according to the near-field approximation which can be found\nin Spitzer (1987):\nE=\n\n\u0001\nmv 2\nGM m\nm\n−\n+ Ω2 z 2 + 3x2 ,\n2\nr\n2\n\n(14)\n\nwhere the first term is the kinetic energy of the star,\nthe second term is its energy in the gravitational field\nof the cluster with mass M at the star's radius r, and\nthe third term is a combination of the centrifugal and\ntidal potentials. In this last term z gives the distance\nof the star from the cluster centre perpendicular to the\ncluster's orbital plane in the galaxy, whereas x denotes\nthe coordinate of the star relative to the cluster centre,\nalong the axis pointing to the galactic centre (for a detailed\ndescription see e.g. Fukushige & Heggie 2000). We are\nwell aware of the fact that this approximation holds only\nfor nearly circular cluster orbits in a point-mass galactic field, and take it only as a first-order approximation here.\nNote that we remove binaries from our data and\nreplace them by their centre-of-mass particles, since\nwe want to focus on the effect of potential escapers\non the velocity dispersion. In observational data, binaries, of course, can play a major role, as has recently\nbeen shown by Gieles, Sana & Portegies Zwart (2009),\nKouwenhoven & de Grijs (2009) and Küpper & Kroupa\n(2010) but only for clusters with a velocity dispersion of\nless than about 5-10 km/s.\n\n3.3\n\nSurface density profiles\n\nIn each annulus the surface density, Σ(R), is determined by\ncounting the number of stars, N , in the given (projected)\nradial range [R − ∆R, R], and dividing by the surface area,\nA, of the given annulus, i.e.\nΣ(R) =\n\nN\nN\n=\n.\nA\n2π (R2 − (R − ∆R)2 )\n\n(15)\n\nMoreover, for each annulus an uncertainty is estimated by\nthe square root of the number of stars in the annulus divided\nby its surface area,\n√\nN\n.\n(16)\n∆Σ(R) =\n2π (R2 − (R − ∆R)2 )\nFirst the surface density profiles are evaluated by taking into\naccount all stars in each sample, and then additionally only\n\n\f6\n\nA.H.W. Küpper, P. Kroupa, H. Baumgardt and D.C. Heggie\n\nTable 2. Overview of the templates used in this investigation.\nnf gives the number of free parameters, where the +1 denotes an\nadditionally assumed constant background. As each template was\noriginally designed with the focus on specific components of star\nclusters, this table shows for each template which of the three\nbasic components it can handle: core, bulk and tidal debris.\nName\nKing\nEFF\nNuker\ngen. Nuker\nKKBH\n\nnf\n\ncore\n\nbulk\n\ntidal debris\n\n3+1\n3+1\n5+1\n8\n6+1\n\nflat\nflat\ncuspy\ncuspy\ncuspy\n\nseparated\nnot sep.\nnot sep.\nseparated\nseparated\n\nn/a\npower-law\npower-law\npower-law\npower-law\n\nthat they can be easily set up and extended, according\nto the needs of the corresponding investigation. We found\nthat star clusters consist basically of three parts: core, bulk\nand tidal debris. The templates which have been set up\nin the past were adjusted according to the different foci\nof the corresponding investigations. For example, King\n(1962) was mainly interested in the bulk of the cluster,\nand so the template mainly consists of a bulk and just a\nflat core, whereas Elson, Fall & Freeman (1987) focused on\nthe tidal debris of young clusters, and so their template\nhas a flat core, no separated, explicitly defined bulk but a\npower-law distribution of tidal debris. Therefore, we will\nstudy some existing templates in a systematic way to show\ntheir advantages and their flaws, and finally design a more\ngeneral template. An overview of all templates is given in\nTab. 2.\nThe 'classic' templates we use, their abbreviations for\nthe rest of the text, and their fit parameters are the following:\n• King denotes the empirical fitting formula which was\ndevised by King (1962) and which works surprisingly well\nfor many extended globular clusters (i.e. Rhp /RJ > 0.05)\nand open clusters. It has the form\n\n\"\n\n1\n\n1\n\nf (R) = k p\n−p\n1 + (R/Rc )2\n1 + (Rt /Rc )2\n\nFigure 1. Sketch of the KKBH template for two different values of the core slope γ. Also shown are the two sub-components\nfor the bulk (f 1(R), eq. 22), which resembles the King (1966)\ntemplate, and the tidal debris (f 2(R), eq. 23), which resembles\nthe Elson, Fall & Freeman (1987) template. The break radius between the two components is at μRt , where μ is found to be 0.5\nin most cases, i.e. for radii larger than 50% of the edge radius the\nsurface density profiles of the clusters follow a power-law. More\nflexibility for large radii is added to most templates through a\nconstant background b.\n\nthe bound stars, to show where and in which way potential\nescapers influence the profile.\nAnalytical templates\n\nEven though physically motivated models like King (1966)\nor Wilson (1975) have often proved to more generally\nrepresent observations of globular clusters than analytical\ntemplates (e.g. McLaughlin & van der Marel 2005), they\nhave one decisive flaw: there is no simple analytical description which can be quickly fitted to star cluster profiles.\nThus, due to their simplicity, analytical templates are still\nin use, especially for larger data sets of extra-Galactic\nclusters.\nMoreover, analytical templates have the advantage\n\n+b\n\n(17)\n\nfor R < Rt and f (R) = b for R > Rt , where k is a scale\nfactor, Rc is a core radius, and Rt is often denoted as the\ntidal radius - in our nomenclature it is the edge radius, the\nlimiting radius between the bulk of a cluster and its tidal\ndebris. The King template therefore consists of a flat core\nand a bulk, but has no term for the tidal debris. Note that\nwe allow for a constant background b instead, as would\nbe done in real observations even though we have no real\nbackground but only the tidal debris of the clusters. We\nfound this constant to significantly improve the quality and\nstability of the fit.\n• EFF is the empirical template used in the work of\nElson, Fall & Freeman (1987) on young LMC clusters of\nabout the same mass as the clusters in our sample. They\nfound that the outer parts of those clusters were poorly fitted by the King template and adopted this template which\nhas no edge radius but falls off like a power-law:\n\n\u0014\n\nf (R) = k 1 +\n3.4\n\n#2\n\n\u0010\n\nR\nRc\n\n\u00112 \u0015−η/2\n\n+ b,\n\n(18)\n\nwhere k is a scale factor, Rc is a core radius, b is a constant\nbackground and η is the slope of the template for radii much\nlarger than the core radius. The EFF template was designed\nto fit observations of clusters with pronounced tidal debris,\nand therefore consists of a flat core and an unseparated bulk\nand tidal debris which are represented by a single power-law.\n• Nuker denotes the template which was adopted by\nLauer et al. (1995) for elliptical galaxies and which has also\noccasionally been used for star clusters. It is also a powerlaw but shows more flexibility than EFF and can also fit a\n\n\fPeculiarities in Velocity Dispersion and Surface Density Profiles of Star Clusters\ncluster with a non-flat core, e.g. a core-collapsed cluster or\na cluster with a massive central black hole. It has the form\nf (R) = k 2\n\nη−γ\nα\n\nh\n\nR\nRc\n\ni−γ h\n\n\u0010\n\n1+\n\nR\nRc\n\n\u0011α i− η−γ\nα\n\n+ b,\n\n(19)\n\nwhere k is a scale factor, Rc is a core radius and b is a\nconstant background. γ gives the power-law slope inside\nRc , whereas η gives the slope for radii larger than the\nbreak radius Rc . With the factor α, the smoothness of the\ntransition between the two slopes is defined. Thus, the\nNuker template consists of a flexible core and a power-law\ntidal debris.\nAdditionally, we set up two templates which have a flexible core plus an edge radius, i.e. a well-defined bulk, but can\nalso fit the region beyond the edge radius in a more sophisticated way than by just a constant background.\n• Generalised Nuker, gen. Nuker, is the same as Nuker\nbut allows for a different power-law slope for radii larger\nthan a second break radius. The template has been introduced by van der Marel & Anderson (2010) to get a smooth\nrepresentation of the surface density profile of ω Cen. It has\nthe form\nf (R)\n\n=\n\nk2\n\n\u0014\n\nη−γ\nα\n\n1+\n\n\u0010\n\nh\n\nR\nRc\n\nR\nRt\n\ni−γ h\n\n1+\n\n\u0011δ \u0015− ǫ−η\nδ\n\n\u0010\n\nR\nRc\n\n\u0011α i− η−γ\nα\n\n×\n\n,\n\nwhere the parameters are the same as in Nuker, though\nwithout the constant background, but instead with an\nadditional second break radius, Rt , a slope for radii larger\nthan this radius, ǫ, and a factor δ which determines the\nsmoothness of the transition between ǫ and η. In their\ninvestigation of ω Cen, van der Marel & Anderson (2010)\nfound that the two break radii in this template roughly\ncorrespond to the core and Jacobi radius of the cluster. In\nour nomenclature their template consists of a flexible core,\na bulk and a tidal debris, which are separated by two break\nradii: the core radius and the edge radius.\n• Finally, we set up our own template which is tailored\nto the purpose of this investigation. KKBH is based on the\nKing template but modified in two steps: first we modified\nthe King template in much the same way as the Nuker template is modified with respect to EFF, i.e. we allow it to\nhave a power-law cusp in the core, but without changing\nthe behaviour in the outer parts of the template:\nf (R)\n\n=\n\n\u0014\n\nR/Rc\nk\n1 + R/Rc\n\n\"\n\n\u0015−γ\n\n1\n\np\n\n1 + (R/Rc )2\n\n×\n1\n\n−p\n1 + (Rt /Rc )2\n\n#2\n\nextra-tidal component in the form of a power-law slope. For\nthe core and the inner part of the bulk of the cluster it\nbehaves like the previous template, but at a radius which is\na fraction μ of the edge radius the template changes abruptly\ninto a power-law, and thus behaves like EFF (see Fig. 1). It\nis given by\nf1 (R)\n\n=\n\nk\n\n\"\n\n\u0014\n\nR/Rc\n1 + R/Rc\n\n+ b (21)\n\nfor R < Rt and f (R) = b for R > Rt , with the same\nparameters as King plus an additional core power-law slope\nγ. For γ = 0 it gives the original King template. This\ntemplate therefore consists of a flexible core and a bulk but\nstill has no tidal debris term, yet.\nFor this reason we modified it further with an additional\n\n\u0015−γ\n\n×\n1\n\n1\n\np\n\n1 + (R/Rc )2\n\n−p\n1 + (Rt /Rc )2\n\n#2\n\n(22)\n\nfor radii smaller than μ Rt , and\n\n\"\n\nf2 (R) = f1 (μ Rt ) 1 +\n\n\u0012\n\nR\nμ Rt\n\n\u001364 #−η/64\n\n(23)\n\nfor R > μ Rt , where the parameters are the same as for the\nprevious template, except for the new ones in the function\nf2 (R). The exponent 64 in f2 (R) causes the template to\nchange abruptly into the power-law slope of η at a fraction μ\nof the edge radius. With an additional constant background,\nb, the complete function looks as follows when using ternary\noperators\nf (R) = (R < μRt\n\n(20)\n\n7\n\n?\n\nf1 (R) + b\n\n:\n\nf2 (R) + b)\n\n(24)\n\n(meaning: if R is smaller than μRt use f1 (R) + b, else use\nf2 (R) + b). Defined in this way, the KKBH template has\na flexible core, a well-defined bulk and a power-law tidal\ndebris (see Fig. 1). A brief explanation on how to use the\nKKBH template with gnuplot is given in Appendix A.\nThe three additional parameters of KKBH may not be\nuseful in all applications but are motivated through the following facts:\n– Mass segregation or the presence of an intermediatemass black hole can have a significant influence on the\nslope of the core profile. This cannot be fitted and thus\nquantified by the original King template, and therefore we\nadd the parameter γ to the template.\n– In most applications the star counts in the outer\nparts of surface density profiles drop quickly, while\ntheir uncertainties grow, so that a template, and hence\nthe edge radius, is mostly fitted by the inner profile\n(Baumgardt et al. 2010). Hence, by allowing a smooth\ntemplate for the inner profile and an independent powerlaw for the outer profile we decouple the two parts and\nlook for the transition point between the two, which is set\nby the second additional parameter μ.\n– Potential escapers and background/foreground stars\nas well as the tidal debris of the cluster influence the template fits in the outer parts of profiles (Côté et al. 2002;\nCarraro, Zinn & Moni Bidin 2007; Carraro 2009). Thus,\nthe tidal debris is not reflected properly by templates like\nKing, and so the results of template fitting are not independent of the presence of debris. Furthermore, by measuring the slope of the surface brightness profile outside\nthe edge radius we aim to be able to deduce information\non the orbital phase of the cluster, and therefore we add\nthe parameter η.\n\n\f8\n\nA.H.W. Küpper, P. Kroupa, H. Baumgardt and D.C. Heggie\n\n3.5\n\nFitting method\n\nWe fit the above templates to the data by finding a minimum\nin χ2 using a nonlinear least-squares Marquardt-Levenberg\nalgorithm. Here we define χ2 as a measure of the differences\nbetween the template, f (R), and the data, Σ(R), weighted\nby the uncertainties in the surface density data, ∆Σ(R),\nsummed up over all data points, i.e.\nχ2 =\n\nX (Σ(Ri ) − f (Ri ))2\ni\n\n∆Σ(Ri )2\n\n.\n\n(25)\n\nTo compare the fits to each other and to account for the\ndifferent complexity of the templates we calculate a reduced\nχ2 which is given by the above χ2 divided by the number of\ndegrees of freedom, n,\nχ2\n,\n(26)\nn\nwhere n is given by the number of data points, nd , minus\nthe number of parameters of the given template, nf , minus\n1 (as one parameter can be fixed by the mean value of the\ndata points), i.e.\nχ2red =\n\nn = nd − nf − 1.\n\n(27)\nχ2red\n\nThe resulting values of\nshould ideally be close to one,\nas too low a value would imply that the template is too\ncomplex for the underlying data.\nEach template is fitted to each cluster for five different ranges of radii to see if the goodness of the fit changes\nfor different coverages of the cluster and its debris, which\nalso implies a differing number of data points. Therefore we\nchoose fixed radial intervals of 1-25 pc, 1-50 pc, 1-100 pc,\n1-200 pc and 1-500 pc. Since the number of data points between 1-500 pc is fixed to 50 for all clusters, we get [25, 31,\n37, 42, 50] data points in the given radial ranges. As the\nclusters have the same initial mass but orbit the galaxy at\ndifferent galactocentric radii, these five intervals will cover\nquite different parts of the clusters. For instance a cluster\nof 20 000 M⊙ has a Jacobi radius of about [27, 40, 52, 63]\npc for a circular orbit at [4.25, 8.5, 12.75, 17] kpc (eq. 10),\nrespectively.\n\n4\n\nRESULTS\n\n4.1\n4.1.1\n\nEach of the clusters in a constant tidal field has a\nsteadily declining velocity dispersion within the Jacobi\nradius (green/red), although the clusters in the stronger\ntidal fields already show an onset of a flattening of the\nprofile at the Jacobi radius. Beyond the Jacobi radius\nthe velocity dispersion fluctuates strongly as the number\nstatistics in these outer bins is quite low and a single\nfast escaper may dominate the velocity dispersion in the\ncorresponding bin (red).\nFrom the differently coloured curves we can see that\nthe stars which lie within the projected Jacobi radius,\nbut actually are in the foreground or background of the\ncluster within its tidal debris, hardly influence the velocity\ndispersion of the clusters (green). Only in some of the\ngraphs can one make out a small contribution in the very\noutermost bins; everywhere else the green data points lie\non top of the red ones.\nBy contrast, potential escapers have a significant influence on the profiles (green data vs. blue data). By definition\nthe velocity dispersion of the bound stars approaches zero\nat the Jacobi radius, where the tidal forces are equal to the\ngravitational acceleration of the cluster. But we see a significant influence already at about 50% of the Jacobi radius.\n\n4.1.2\n\nTime-dependent tidal fields\n\nIf we take a look at columns 2 and 3 of Fig. 2 we can see\nthe effect of time-dependent tidal fields on the velocity\ndispersion profiles. With increasing eccentricity the extent\nand onset of the population of potential escapers stays the\nsame (∼ 0.5RJ ), since in the snapshots all clusters are at\napogalacticon. But from the green curve we can see that\nthe energy of the potential escapers increases, which leads\nto a flattening of the velocity dispersion profiles. This is in\nagreement with findings by Gnedin, Lee & Ostriker (1999)\nwho showed that stars at large radii are most affected by\ntidal perturbations like disk shocks or pericentre passages\nand that stars, on average, gain energy through such events.\nFurthermore, it supports the assumption of Küpper et al.\n(2010) that stars do not escape from the cluster immediately\nafter a tidal perturbation, but can remain in the cluster for\nseveral cluster orbits about the galactic centre.\n\nVelocity dispersion profiles\nConstant tidal fields\n\nA typical sample of velocity dispersion profiles is shown in\nFig. 2. In each graph the velocity dispersion is plotted i) for\nall stars in the sample (red), ii) for all stars that lie within\nthe Jacobi radius (green), and iii) for all bound stars (blue).\nThe first column shows the clusters in a constant tidal\nfield, i.e. on circular orbits. Comparing the graphs for the\ndifferent galactocentric distances shows that, as expected,\nthe clusters at larger galactocentric distances are more\nextended. Since they all have the same mass of about\n15 000 M⊙ in the snapshots, the central velocity dispersion\ndecreases with RG , whereas the size of the flat part within\nthe core radius increases.\n\nIn Fig. 3 we show a time series of a cluster on an orbit\nwith an eccentricity of 0.75 and an apogalactic radius of 17\nkpc. The time series starts 210 Myr after the beginning of\nthe computations, where the cluster is just about to finish\nits first revolution about the galactic centre and has a mass\nof 16 200 M⊙ . At 310 Myr (middle panel) the cluster is\nat perigalacticon with a mass inside the Jacobi radius of\n7 700 M⊙ , and at 410 Myr it is again at apogalacticon with\n13 500 M⊙ left.\nWe see that for the largest part of the orbit, from 250\nMyr to 370 Myr (RG < 15 kpc) the velocity dispersion profile appears to be more or less flat. For the perigalactic part\nof the orbit (300 Myr - 320 Myr, RG < 5 kpc) a good fraction\nof the cluster stars even lies beyond the Jacobi radius (about\n50% of the apogalactic cluster mass). Nevertheless, even af-\n\n\fPeculiarities in Velocity Dispersion and Surface Density Profiles of Star Clusters\n\n9\n\nFigure 2. Velocity dispersion profiles of 12 different clusters (A0-2, B0-2, C0-2, D0-2). The apogalactic distance and eccentricity of the\nclusters' orbits are given in the graphs. At the given snapshot each cluster is at apogalacticon and has a mass of about 15 000 M⊙ . The\ncorresponding Jacobi radius can be deduced by the outermost green data point. Two effects are visible: first, for increasing galactocentric\ndistance the extension of the cluster, and hence also the flat part inside the core radius, both grow as the Jacobi radius grows; this results\nfrom setting up the cluster half-mass radii to scale with RJ (Sec. 3.1). This also implies a lower central velocity dispersion. Second and\nmore important, for increasing eccentricity the effect of potential escapers (green points vs. blue points) on the flatness of the velocity\ndispersion profile outside the core radius grows. Corresponding surface density profiles are given in Figs. 5 & 9.\n\n\f10\n\nA.H.W. Küpper, P. Kroupa, H. Baumgardt and D.C. Heggie\n\nFigure 3. Velocity dispersion profiles for the cluster D3, which is on an eccentric orbit with eccentricity 0.75 and an apogalactic distance\nof 17 kpc. The snapshots show the evolution of the profile with time during one revolution about the galactic centre, from apogalacticon\nto apogalacticon. In each graph the corresponding simulation time and galactocentric radius are given. In the middle graph the cluster\nis at perigalacticon. Here the Jacobi radius is at its minimum (∼10 pc) and most of the cluster is unbound. For a large fraction of the\norbit the velocity dispersion profile is approximately flat. Corresponding surface density profiles are given in Fig. 11.\n\nter such a dramatic pericentre passage the cluster's velocity\ndispersion profile returns to nearly its original shape.\n\nnear core collapse. Even so, there is no significant difference\nto the other clusters with respect to the potential escapers.\n\n4.1.4\n4.1.3\n\nConcentrated clusters\n\nIn Fig. 4 the velocity dispersion profile for a cluster at 4.25\nkpc is shown. It had an initial (3-dimensional) half-mass radius of 3 pc, and is thus what Baumgardt et al. (2010) would\nclassify as a compact cluster. At the time of the snapshot\nthe cluster has 15 000 M⊙ and still has a ratio of projected\nhalf-mass radius to Jacobi radius Rhp /RJ = 0.08. The profile does not show a well-defined core in the range of the data\npoints, as all other profiles do, but rises steeply in the centre. This is a clear indication of the fact that the cluster is\n\nConclusions\n\nFrom the velocity dispersion profiles studied in this section\nwe can conclude that the population of potential escapers\nhas a significant influence on the kinematical structure of a\nstar cluster. The influence of this population on the velocity\ndispersion profiles grows with increasing eccentricity of\nthe cluster orbit. In such cases an observer would have\nto be very cautious when deriving a dynamical mass out\nof velocity dispersion measurements as it would tend to\nbe overestimated, the possible degree of overestimation\ndepending on the cluster characteristics such as its orbit\n\n\fPeculiarities in Velocity Dispersion and Surface Density Profiles of Star Clusters\n\nFigure 4. Velocity dispersion profile for the concentrated cluster\nwith a galactocentric radius of 4.25 kpc (A0c). At the time of the\nsnapshot the cluster has a mass of about 15 000 M⊙ and a ratio\nof projected half-mass radius to Jacobi radius of 0.08. Compared\nto the other clusters at the same stage of evolution, the velocity\ndispersion rises steeply in the centre due to core collapse, but\nshows a similar behaviour in the outer parts. A corresponding\nsurface density profile is given in Fig. 13.\n\n11\n\nFigure 6. Evolution of the slopes of the tidal debris of the templates which can fit such a component, i.e. the surface density\nin the tidal debris falls off with R−X , for the cluster on a circular orbit at 8.5 kpc (B0). Since the gen. Nuker template has\ntwo power-law slopes we show both here. Note that the Nuker\nand the gen. Nuker slopes are smoothed, as the variations between the individual time steps are very large. The other slopes\nare not smoothed since they are better behaved. The EFF and\nKKBH slopes show a rise in the beginning of the simulation which\ncorresponds to an initial increased mass-loss rate due to primordial escapers. The Nuker and gen. Nuker slopes give no reliable\ninformation on the tidal debris slope.\n\nand its velocity dispersion.\nFurthermore, we saw that the velocity dispersion profile\ndeviates from the expected Keplerian profile at a radius of\nabout half the Jacobi radius. Since most globular clusters in\nthe Milky Way experience a gravitational acceleration which\n2\nis about the size of GMGal /RGal\n≃ 1.2 × 10−8 cm s−2 ≃ a0\none may easily be misled to deduced deviations from\nNewtonian gravity (e.g. Scarpa et al. 2007). To reduce\nthe influence of potential escapers, velocity dispersion\nmeasurements should be made within 50% of the Jacobi\nradius. Nevertheless, extra caution has to be taken for\nclusters on eccentric orbits.\nMoreover, we can see the general structure of star clusters already in the velocity dispersion profiles. There is a\ncore which can be flat or cuspy. Then there is a bulk of\nbound stars whose limiting radius is somewhat smaller than\nthe Jacobi radius, and finally there is the tidal debris whose\nonset lies within the Jacobi radius as a consequence of potential escapers. Most of this cluster structure is temporarily\nerased during pericentre passages for eccentric cluster orbits.\nBy contrast, the concentrated clusters show a different cluster structure, as they do not seem to show a distinct core\nand bulk within the range of the data points.\n\n4.2\n4.2.1\n\nSurface density profiles\nConstant tidal fields\n\nAs an example to demonstrate the fitting process, in Fig. 5\nthe surface density profile of the cluster on a circular\n\nFigure 7. Evolution of the Jacobi radius RJ of the cluster on a\ncircular orbit at 8.5 kpc (B0), evaluated using eq. 10 (red dotted\nline), and the edge radii of the fitted templates for a fit range\nof 1-100 pc. None of the edge radii reproduces the Jacobi radius\nwell over the whole simulation time. King shows considerable evolution with respect to the Jacobi radius. The edge radius of the\ngen. Nuker template is smoothed since it fluctuates a lot, or sometimes does not converge properly (see text). In cases when it converges, it mostly gives a radius which is about 50% larger than\nRJ . KKBH has about the same values as King, though reduced\nby another 10%, but is less influenced by the initial mass loss due\nto primordial escapers, i.e. is more stable.\n\n\f12\n\nA.H.W. Küpper, P. Kroupa, H. Baumgardt and D.C. Heggie\n\nFigure 5. Surface density profiles of the cluster in a constant tidal field at a galactocentric distance of 8.5 kpc (B0). The upper panels of\nthe first five graphs show the data and the template fits according to Sec. 3.4 for the five ranges of 1-[25, 50, 100, 200, 500] pc. The lower\npanels of the first five graphs give the relative deviation of the templates from the data. Vertical dashed lines mark the fitting range. The\ntheoretical Jacobi radius can be read off from the outermost green data point (bound stars). The lower right panel shows the reduced\nχ2 for all of the five ranges, averaged over all snapshots of this cluster. Error bars give the standard deviation of χ2red . A corresponding\nvelocity dispersion profile is given in Fig. 2.\n\n\fPeculiarities in Velocity Dispersion and Surface Density Profiles of Star Clusters\n\n13\n\npanel of Fig. 5).\nTaking a closer look at the tidal debris of this cluster\nat the given, dynamically well-evolved state shows that the\nslope outside the Jacobi radius is quite similar to the slope\nof the bulk, though it is not the same. If the data had been\nslightly more noisy we could have even concluded that the\nslope of the tidal debris close to the cluster is the same as\nthe slope of the bulk, which is what Elson, Fall & Freeman\n(1987) might have seen in their data on young LMC\nclusters. This is also the reason why EFF and Nuker fit this\ncluster reasonably well even though they have no separate\nbulk and debris terms.\n\nFigure 8. Ratio of the fitted edge radii to the Jacobi radius averaged over the whole simulation of the cluster on a circular orbit\nat 8.5 kpc (B0) and shown for all 5 fit ranges. Error bars give\nthe standard deviations from the mean. The King template reproduces the Jacobi radius to about 10% accuracy for sufficiently\nlarge fit ranges. Gen. Nuker gives values 2-3 times larger than\nthe Jacobi radius and shows large fluctuations. KKBH shows a\nconstant value over all fit ranges which is about 20% smaller than\nthe Jacobi radius. Also shown are the edge radius of the bound\nstars, which lies at about 70% of RJ , and the break radius of\nthe KKBH template at which the profile of the cluster becomes\ndominated by potential escapers.\n\norbit at 8.5 kpc is shown when the cluster has a mass of\n15 000 M⊙ , just as was shown for the velocity dispersion\nin the 4th panel of Fig. 2. In the upper panels of the first\nfive graphs the cluster data and the fits of the analytical\ntemplates from Sec. 3.4 are shown for the five different\nranges of 1-[25, 50, 100, 200, 500] pc. In the lower panels\nof these graphs the relative errors can be seen. The lower\nright panel gives the reduced χ2 for each template for each\nfit range averaged over all 400 snapshots of the cluster.\nWe see that for the smallest fit range (1-25 pc) all templates fit about equally well, whereas for the larger ranges\nsignificant differences in the quality of the fits appear. This\nis due to the fact that the smallest fit range only covers the\ncore of the cluster, which in this case is flat, and a part of\nthe bulk. Such a profile can be fit by all templates in the\nsample. But already the second smallest fit range of 1-50\npc covers part of the tidal debris, as the Jacobi radius in\nthis snapshot is 36 pc. Hence the King template, which\ndoes not have a proper tidal debris term, gets significantly\nworse with increasing fit range. Furthermore, since there is\nan inflexion point of the slope between the bulk and the\ntidal debris at about the Jacobi radius, the templates which\ncannot account for the bulk and debris separately (EFF\nand Nuker) get worse for increasing fit range as well. In\ncontrast to EFF, however, Nuker can partially compensate\nthe missing bulk term by a more flexible core term. Besides\nNuker, only the two templates which consist of three parts\nhave a good reduced χ2 value over all fit ranges (lower right\n\nAnother striking fact is that the tidal debris does\nnot show a constant slope for radii much larger than the\nJacobi radius. From a constant mass-loss rate (which this\ncluster shows for several Gyr) and a constant velocity of\nthe escapers within the tidal tails away from the cluster we\nwould infer that the number of stars in the debris grows\nlinearly with radial distance from the cluster. Thus, the\nsurface density profile of the debris should fall off with R−1 ,\nas the surface area of the annuli grows with R2 . Instead we\nsee a slope which is steeper close to the cluster and gets\nmore shallow at radii of several hundred pc.\nThis is due to the fact that stars do not move linearly\nalong the tidal tails as they escape from the cluster, but\nexhibit an epicyclic motion in which they get periodically\naccelerated and decelerated (Küpper, Macleod & Heggie\n2008). Since escaping stars are first accelerated away from\nthe cluster, the slope of the surface density close to the\ncluster should be lower than -1. This acceleration then\nturns into a deceleration at a distance R = 0.5 yC , where\nthe length of the epicycles, yC , depends on the tidal field.\nAt a distance R = yC , which in this case is given by approximately 3πRJ ≃ 340 pc, the slowest escapers (escapers\nwith E − Ecrit ≃ 0) are coming to a halt before they get\nre-accelerated. Escapers with a finite velocity above the\nescape velocity come to a halt at a somewhat larger yC ,\nso that the mean escaper reaches its lowest drift velocity\nalong the tidal tails at about 400-500 pc. (For a detailed\ndescription of the tidal tails of this particular cluster see\nKüpper et al. 2010). In this range the slope of the surface\ndensity profile should be significantly larger than -1.\nOf greatest interest with regard to real star clusters is\nthe tidal debris close to the clusters, as observations barely\nextend to radii of several Jacobi radii. Thus, we focus on\nthe inner 100 pc in the following discussion. In Fig. 6 the\nevolution of the power-law slopes of the tidal debris can be\nseen as fitted by the given templates for a fit range of 1-100\npc. We see that EFF and KKBH have a similar evolution,\nthough KKBH varies less with time. This is due to the fact\nthat EFF fits one slope for the bulk of the cluster and the\ntidal debris, whereas KKBH decouples the two parts and\ntherefore gives a more accurate value for the slope of the\ntidal debris close to the cluster. As expected, the slope is\nsignificantly smaller than -1; indeed it has a value of about\n-5. Note that KKBH and EFF show a slightly shallower\nslope at the beginning of the simulation, where the cluster\nloses more mass as a consequence of primordial escapers\n\n\f14\n\nA.H.W. Küpper, P. Kroupa, H. Baumgardt and D.C. Heggie\n\n(see Küpper et al. 2010). By contrast, we see that the\nNuker and the gen. Nuker templates do not give reliable\ninformation on the tidal debris slope. The power-law slopes\nof the Nuker and the gen. Nuker templates in Fig. 6 even\nhad to be smoothed in order to reduce the stochastic noise\nto a reasonable level. Even so, the fluctuations in the values\nare too large to allow any conclusions to be drawn from\nthem. This is due to the factors α and δ in eq. 19 & 20\nwhich are meant to adjust the smoothness of the transition\nfrom one slope to another but have quite a large influence\non the fitting results.\nFrom Fig. 5 we can see that the surface density of bound\nstars falls off more steeply than the surface density of all\nstars in the sample (green profile vs. red profile), i.e. the\nedge of the bulk of bound stars lies further in than the edge\nof the bulk of all stars. Thus, the population of potential escapers enhances or even dominates the surface density profile for radii larger than about half the Jacobi radius, just as\nwe saw in the velocity dispersion profiles (Fig. 2). It should\nbe kept in mind, however, that the underlying investigation\nis limited to star clusters with up to 64k stars. How this\nbehaviour changes with increasing N still has to be considered. From Baumgardt (2001), however, we expect only a\nweak dependence on N .\nIn Fig. 7 the time evolution of the Jacobi radius of this\ncluster is shown. As the cluster constantly loses mass the\nJacobi radius (eq. 10) slowly decreases. Also shown in the\nfigure are the fitted edge radii of the King, the gen. Nuker\nand the KKBH templates for a fit range of 1-100 pc. We\nsee that none of the templates reproduces the Jacobi radius\naccurately over the whole simulation time.\nThe King Rt shows strong evolution at the beginning,\nbecause of an initial burst of mass-loss due to primordial\nescapers, which the template tries to fit. For the rest of the\nsimulation the King edge radius agrees with the Jacobi radius to within about 10%.\nThe gen. Nuker Rt shows large fluctuations, which are\ndue to the above mentioned smoothness parameters α and δ,\nwhich introduce a large ambiguity but also cause problems\nin the fitting process. Thus, for this template the MarquardtLevenberg algorithm sometimes does not converge properly,\nand then the starting value for Rt , which was chosen to be\n90 pc for all templates, is retained. In case the fit converges,\nit mostly yields an edge radius which is about 50% too large.\nThe KKBH template usually yields similar results to\nKing, though 10% smaller, but is much less influenced by\nthe initial mass loss of primordial escapers, and thus more\naccurately reproduces the edge radius of the bulk of the\ncluster. This case is a good example in which heavy mass\nloss significantly influences fitting results, as may have\nhappened in the investigation of Elson, Fall & Freeman\n(1987), or as was mentioned by Côté et al. (2002),\nCarraro, Zinn & Moni Bidin (2007) and Carraro (2009) for\nthe Milky-Way globular clusters Palomar 13, Whiting 1 and\nAM 4, respectively. The structure of the KKBH template\nhelps to minimise such a problem.\nIn Fig. 8 we show all these fitted edge radii in units\nof the Jacobi radius, averaged over all time steps of the\nsimulation, for all 5 fit ranges. King shows a value which\nlies within 10% of the true Jacobi radius for large fit ranges.\n\nOnly the smallest fit range of 1-25 pc yields an average edge\nradius which is about 30% off, so here the fit range would\nsignificantly influence the fitting result. In contrast to that\nthe KKBH template gives a more constant value over all\nfit ranges but which is reduced compared to King by about\n10%. The gen. Nuker template does not yield a reliable\nvalue for the edge radius, as the fluctuations between the\ntime steps are large, as indicated by the error bars, and the\nmean strongly depends on the fit range.\nThroughout the analysis we found the bound stars to\nbe well represented by a simple King template. From Fig. 8\nwe see that the edge of bound stars lies at about 70% of\nthe Jacobi radius. The break radius of the KKBH template,\nat which it changes into the power-law tidal debris, is also\nshown in the figure and lies at about 50% of RJ and can be\ninterpreted as the radius at which the profile of the cluster\ndeviates from a smooth bulk profile and gets dominated by\npotential escapers.\nIn Tab. B1 a summary of the fitting results of the edge\nradii for the three smallest fitting ranges for all clusters\nin a constant tidal field is given. From this table we can\nconclude that the edge radii are closer to the Jacobi radius\nthe larger the fit range is. For the smallest fit range the\ndeviation can be even up to 40%. Averaging over all the\nfitting results in Tab. B1 confirms our findings: the King\nedge radius is on average a little (10-20%) smaller than the\ntrue Jacobi radius. Gen. Nuker yields no reliable results,\nwhereas KKBH is more stable than King but yields an edge\nradius which is also about 20% smaller than the true Jacobi\nradius. Furthermore we see from the table that the edge of\nbound stars lies at about 70% of the Jacobi radius and that\nKKBH finds a break in the profile slope at about 50% of\nthe Jacobi radius. Thus, at this radius the profile becomes\ndominated by potential escapers.\nFrom the investigation of the clusters in a constant tidal\nfield we can conclude that our ansatz for constructing a star\ncluster template consisting of core, bulk and debris was chosen well. The unbound tidal debris has a significant influence\non the fitting results, but this can be minimised by the addition of an independent tidal debris term. In addition, our\nconstructed KKBH template is a good tool with which to\nmeasure the power-law slope of the tidal debris and to look\nfor a break in the surface density profile. In this way we saw\nthat the influence of potential escapers on the cluster profile\nis significant for radii larger than 0.5RJ and that beyond\nabout 0.7RJ nearly all stars are unbound.\n4.2.2\n\nTime-dependent tidal fields\n\nIn Fig. 9 we see the clusters with an orbital eccentricity of\n0.25 (left panel) and 0.5 (right panel) at the time when they\nare at their apogalactic distance of 8.5 kpc, just as shown\nin Fig. 2 for the velocity dispersion profiles. Also shown in\nthe figure are the template fits for a fit range of 1-100 pc.\nWe see no significant difference from the surface density\nprofile of the cluster on a circular orbit (Fig. 5), except for\nthe mean density within the tidal debris, which gets larger\nwith increasing eccentricity. This is due to the average mass\nloss of the clusters as well as the orbital compression of the\n\n\fPeculiarities in Velocity Dispersion and Surface Density Profiles of Star Clusters\n\n15\n\nFigure 9. Surface density profiles of the clusters at an apogalactic distance of 8.5 kpc with an orbital eccentricity of 0.25 (B1, left) and\n0.5 (B2, right). At the time of the snapshot both clusters are at apogalacticon and have a mass of about 15 000 M⊙ . The power-law slope\nof the tidal debris as measured by the KKBH template is η = 5.2 ± 0.3 on the left and η = 4.5 ± 0.2 on the right. The inner cluster\nprofiles look quite similar whereas the average density outside the cluster with an orbital eccentricity of 0.5 is higher, which is due to\nthe higher mass-loss rate of this cluster and the larger orbital compression of its tidal tails. The theoretical Jacobi radii can be read off\nfrom the outermost green data points (bound stars). Corresponding velocity dispersion profiles are given in Fig. 2.\n\nFigure 11. Surface density profiles for the cluster at an apogalactic distance of 17 kpc with an orbital eccentricity of 0.75 (D3). On\nthe left the cluster is shown shortly before reaching apogalacticon, in the middle it is at apogalacticon whereas on the right it is at\nperigalacticon. The power-law slope of the tidal debris as measured by the KKBH template is η = 1.7 ± 0.2 on the left, η = 2.9 ± 0.5\nin the middle and η = 3.8 ± 0.1 on the right. Close to and at apogalacticon the cluster and its tidal tails get heavily compressed which\nleads to a great enhancement in the number of stars close to the cluster. At perigalacticon most of the profile is best fit by a power-law.\nFurthermore, most stars are unbound (green line), just as we have seen in the velocity dispersion profile (middle graph of Fig. 3). The\ndrop in surface density in the left and middle panel for large radii is due to the young age of the cluster and its short tails, as escaped\nstars simply could not travel far at this time. Corresponding velocity dispersion profiles are given in Fig. 3.\n\ntails at apogalacticon, which both increase with eccentricity.\nThe slope of the tidal debris close to the cluster\n(∼ R−η ) is η = 5.2 ± 0.3 for ǫ = 0.25 and η = 4.5 ± 0.2\nfor ǫ = 0.5, i.e. about the same as in the constant tidal\nfield (about η = 5 for ǫ = 0.0). But since the cluster has\na lower orbital velocity at apogalacticon for increasing\neccentricity, the epicyclic overdensities in the tidal tails are\nalso located closer to the cluster (see Küpper et al. 2010)\nand the surface density is enhanced relative to the circular\ncase.\nFrom Fig. 10 we see that for a small orbital eccentricity\nof ǫ = 0.25 the tidal debris slope evolves very much as\n\nin the constant tidal field case. For ǫ = 0.5 we see that\nthe slope on average shows the same evolution, but in\naddition shows jumps to smaller values. These jumps occur\nshortly before apogalacticon where the tails get maximally\ncompressed due to the orbital acceleration, so that, for\nlarge eccentricities, they literally get pushed back inside the\ncluster. This enhances the tidal debris close to the cluster\nand thus temporarily yields a shallower slope. This effect\nis shown in Fig. 11 for the cluster with an apogalactic\ndistance of 17 kpc and an orbital eccentricity of 0.75. The\nleft panel shows the cluster close to apogalacticon, the\nmiddle panel shows it at apogalacticon whereas the right\npanel shows the cluster at perigalacticon, similar to what\nwe have seen in Fig. 3. The slopes η of the three snapshots\n\n\f16\n\nA.H.W. Küpper, P. Kroupa, H. Baumgardt and D.C. Heggie\n\nFigure 10. Evolution of the slopes of the tidal debris of the\ntemplates as shown in Fig. 6 for the clusters with an apogalactic\ndistance of 8.5 kpc and an orbital eccentricity of 0.25 (B1, upper\npanel) and 0.5 (B2, lower panel). The Nuker and the gen. Nuker\nslopes are smoothed with a cubic spline, as the variations between\nthe individual time steps are very large. The EFF and KKBH\n(for ǫ = 0.5 also the Nuker) slopes again show a similar evolution\naround an average value of about η = 5. For increasing orbital\neccentricity the power-law slope of the tidal debris starts to vary\nwith the orbital phase. As the cluster gets compressed close to\napogalacticon, the slope of the tidal debris abruptly decreases to\nvalues of about η = 2 − 3.\n\nas measured by the KKBH template are η = 1.7 ± 0.2\nclose to apogalacticon, η = 2.9 ± 0.5 at apogalacticon and\nη = 3.8 ± 0.1 at perigalacticon.\nSummarising the results, including also those from\nall the other models of our systematic study, which are\nnot shown here in detail, we can conclude that the tidal\ndebris close to the cluster (up to about three times the\nJacobi radius) has a power-law slope η in the range 4 to\n5, which can decrease to values in the range 1-2 shortly\nbefore apogalacticon due to orbital compression of the tidal\ntails. This may lead to the conclusion that we can identify\nthose star clusters which are at an orbital phase close to\napogalacticon by the slope of their surface density profiles\noutside the Jacobi radius. Star clusters like Palomar 13,\nAM 4 and Whiting 1 may well be in such an orbital phase,\nas their surface density profiles show slopes of about η = 1.8\n(Côté et al. 2002; Carraro, Zinn & Moni Bidin 2007;\nCarraro 2009). This assumption is further strengthened by\nthe Milky-Way globular cluster Palomar 5, whose orbit is\nwell constrained due to its long tidal tails (Dehnen et al.\n2004). It is currently located close to apogalacticon and\nshows a power-law slope of about -1.5 (Odenkirchen et al.\n2003).\nFrom the right panel of Fig. 11 we can see that at\nperigalacticon, where the Jacobi radius is smallest (about\n\nFigure 12. Evolution of the Jacobi radii, evaluated using eq. 10\n(red dotted line), and the edge radii of the fitted templates for a fit\nrange of 1-100 pc for the clusters with an apogalactic distance of\n8.5 kpc and an orbital eccentricity of 0.25 (B1, upper panel) and\n0.5 (B2, lower panel). The line colours are the same as in Fig. 7.\nEven though the Jacobi radius changes periodically the bulk of\nthe cluster seems to be unaffected. The evolution of the King\nand KKBH edge radii (red and black solid line) are very much\nlike in Fig. 7 but shifted to lower values for increasing orbital\neccentricity. Only the break radius of the KKBH template (black\ndashed line) seems to be somewhat affected by the changing tidal\nfield.\n\n10 pc), most of the cluster is unbound (green data points vs.\nred data points) just as we have seen in the corresponding\nvelocity dispersion profile (middle panel of Fig. 3). Also\nnote here how much more poorly the King template fits\nthe cluster at perigalacticon than at apogalacticon. By\ncontrast, the KKBH template, as well as the others with\na power-law tidal debris term, can cover the whole cluster\n\n\fPeculiarities in Velocity Dispersion and Surface Density Profiles of Star Clusters\nand its debris perfectly well.\nIn Fig. 12 we show the evolution of the Jacobi radius\nand of the fitted edge radii for the above clusters with\neccentricities of 0.25 and 0.5, just as in Fig. 7 for ǫ = 0.0.\nWhile the Jacobi radius oscillates with an amplitude which\nincreases with increasing eccentricity, the overall evolution\nof the other radii is very similar to the constant tidal field\ncase. The edge radius of the King template shows some\nevolution at the beginning but then gives the mean Jacobi\nradius of the cluster. The KKBH template again shows less\nevolution than King at the beginning, i.e. is less affected by\nheavy initial mass loss, but again gives a nearly constant\nvalue similar to that of King, but reduced by about 10%.\nThe gen. Nuker edge radius does not show a well-behaved\nevolution at all.\nThe results from all models on eccentric orbits in our\nset are presented in Tab. B2-B4 sorted by eccentricity. The\nresults of the clusters with ǫ = 0.25 and ǫ = 0.5 agree well\nwith the findings for the clusters in a constant tidal field\n(Tab. B1). We note especially the consistent values for the\nedge of the bound stars at 70% of the Jacobi radius and\nthe break radius of the KKBH template at 50% of the\nJacobi radius. But also the fact that the King template\nyields on average about 90% of the mean Jacobi radius\nis interesting, since it is commonly thought that observed\nedge radii correspond to the perigalactic Jacobi radii of the\ncorresponding clusters. The fact that the edge radius is not\nset at perigalacticon is due to the fact that stars do not\nleave the cluster immediately after becoming unbound but\nstay within the Jacobi radius for up to several orbits of the\ncluster about the galaxy. Moreover, when we consider the\nelongated shape of the equipotential surfaces of a cluster\nin a tidal field it is quite reasonable that a spherically\nsymmetric, one-dimensional density profile will yield a\nsmaller value than the two-dimensional (i.e. projected)\nJacobi radius.\nNote that the mean results and fluctuations get worse\nfor increasing tidal field strength. All clusters with orbital\neccentricities of 0.75 get disrupted within a few orbits about\nthe galactic centre and thus are barely in a state close to\nvirial equilibrium. Also the clusters at 4.25 kpc and 8.5 kpc\nwith eccentricities of 0.5 show large spreads in the fits as\nthey penetrate deeply into the central part of the galaxy.\nAt the beginning of these N -body computations, however,\nwhen the clusters are still very massive and much less\nvulnerable to tidal influences, the fitting results are more\nstable and agree with the findings for the other clusters.\nFrom the clusters in time-dependent tidal fields we can\nconclude that our KKBH template again proves to be a good\ntool to investigate the state of the clusters and their tidal\ndebris. Thus, we were able to extend our findings of the\nprevious section to clusters on eccentric orbits. Moreover,\nwe suggest that star clusters in an orbital phase close to\napogalacticon can be identified by the slope of their surface\ndensity profile outside the Jacobi radius. We furthermore\nfind that the bulk of the cluster adjusts to the mean tidal\nfield rather than, as usually believed, to the perigalactic tidal\nfield.\n\n4.2.3\n\n17\n\nConcentrated clusters\n\nFig. 13 shows the surface density profiles of the clusters at\n4.25 kpc (left) and 12.75 kpc (right), which both had an\ninitial (3-dimensional) half-mass radius of 3 pc; for the first\nof these the corresponding velocity dispersion profile was\nshown in Fig. 4. At the time of the snapshots the clusters\nhave 15 000 M⊙ and a ratio of projected half-mass radius\nto Jacobi radius of 0.08 (left) and 0.06 (right). From the\nfigures and the fitted templates we see that the power-law\nslope of the tidal debris agrees with the previous findings\n(η = 4.6 ± 0.6 for the left panel and η = 4.3 ± 0.3 for\nthe right). Furthermore, we see that the EFF template\ncompletely fails to fit the data. This is due to the fact\nthat the clusters do not have a distinct core (at least down\nto a radius of 1 pc) but appear to consist only of a bulk\nand tidal debris. Thus the EFF template, which consists\nof a flat core and a tidal debris term, cannot reproduce it.\nThe King template does a better job for the bulk but fails\nat the edge of the bulk, whereas KKBH can give a good\nrepresentation of all parts of both clusters. Nuker and gen.\nNuker are also flexible enough to cover the whole radial\nrange. These characteristics become more pronounced for\nincreasing galactocentric radius as the half-mass radius is\nfixed at 3 pc but the Jacobi radius increases, and so the\nconcentration increases. Note also that the quality of the\nKing template fit decreases with a larger concentration.\nThis supports the findings by Baumgardt et al. (2010) that\nconcentrated clusters cannot be properly fitted by a King\ntemplate.\nBut even though most templates yield good χ2 values,\nfrom Tab. B5 we can see that the fitted edge radii do not\ncorrespond to the Jacobi radii any more. With increasing\nconcentration the edge radii shrink compared to the Jacobi\nradii. That is the reason why we avoid the term tidal radius\nand instead use edge radius, since this edge radius does not\nhave to be a result of the galactic tide.\nMoreover, since the bound stars follow a similarly concentrated distribution and since we tried fitting this distribution with a King template, these numbers also get unreliable. Here a reconsideration of the templates with regard\nto the structure of concentrated clusters would be necessary,\nsince the templates we used here all seem to fail in giving information on the cluster structure, due to the fact that these\nclusters do not show a distinct core and bulk down to 1 pc.\nThus, we conclude that Jacobi radii cannot be reliably determined from observed clusters using these templates if their\nconcentration is high, i.e. with Rhp /RJ ≃ 0.1 or smaller.\n4.3\n\nReview of templates\n\nBefore summarising the results of this investigation let us\nbriefly discuss the performance of the templates which were\ndefined in Sec. 3.4 and which were used here.\n• King has proved to be a reasonable tool for studying\nthe Jacobi radius of extended clusters but fails when the\ncluster has a pronounced tidal debris component or is too\nconcentrated. It cannot give information on the core slope\nof either mass segregated clusters or clusters with an IMBH\nin the centre. Eccentric cluster orbits are also a problem for\n\n\f18\n\nA.H.W. Küpper, P. Kroupa, H. Baumgardt and D.C. Heggie\n\nFigure 13. Surface density profiles of the concentrated clusters at a galactocentric radius of 4.25 kpc (A0c, left) and 12.75 kpc (C0c,\nright). At the time of the snapshots both clusters have a mass of about 15 000 M⊙ . The power-law slope of the tidal debris as measured\nby the KKBH template is η = 4.6 ± 0.6 (left) and η = 4.3 ± 0.3 (right). The theoretical Jacobi radii can be read off from the outermost\ngreen data points (bound stars). One corresponding velocity dispersion profile is given in Fig. 4.\n\nthe template. Moreover, the fit results strongly depend on\nthe radial range of the cluster which is covered; it is thus\nquite unreliable for obtaining cluster parameters.\n• EFF is a good tool for the study of clusters with a\npronounced tidal debris component, provided that they are\nnot too concentrated or mass segregated. It cannot, however,\ngive information on the edge radius.\n• Nuker can fit most of the clusters in our sample well,\nbut it is not possible to deduce cluster parameters reliably\nfrom the fitting results. Furthermore it does not have an\nedge radius.\n• Gen. Nuker is a very powerful template with a low\nχ2 for all fit ranges but, just as Nuker, does not allow the\ndeduction of reliable structural parameters from the fitting\nresults, as the resulting parameters of the template vary\nstrongly and depend strongly on the radial coverage of the\ncluster.\n• KKBH has proved to be a reasonable extension of\nKing, improving the fitting results for all clusters in the\nsample. It also yields the most reliable structural information over all fit ranges in terms of edge radius and the slope\nof the tidal debris. Like all other templates, however, it fails\nin the case of concentrated clusters.\n\n5\n\nCONCLUSIONS\n\nThis systematic investigation of velocity dispersion profiles\nand surface density profiles of star clusters with masses of\nabout 104 M⊙ has shown how complex and versatile these\nprofiles can be, depending on the circumstances of the\nclusters.\nFurthermore we have shown the importance of potential escapers for these two quantities. Both profiles are\ninfluenced by this population of energetically unbound stars\nfor radii larger than about 50% of the Jacobi radius and\n\nare completely dominated by it for radii larger than about\n70% of the Jacobi radius (Fig. 2 & 3). Baumgardt (2001)\nfound that for clusters in a constant tidal field the fraction\nof potential escapers varies with the number of stars within\na cluster approximately as N −1/4 . Thus, even if the cluster\nmass increases by a factor of 10, the fraction (and influence)\nof potential escapers will only be reduced by less than 50%\ncompared to this investigation.\nAs a consequence of the potential escaper population,\nthe velocity dispersion profiles in our sample do not show\na clear separation between the bulk of the cluster and the\ntidal debris at the Jacobi radius, but rather show a smooth\ntransition from cluster to debris. For mass estimates which\nare based on velocity dispersion measurements we therefore\nrecommend to use stars within 50% of the Jacobi radius to\nminimise the effect of potential escapers.\nMoreover, we argue that investigations on velocity dispersion profiles like Drukier et al. (1998),\nScarpa, Marconi & Gilmozzi (2003) or (Scarpa et al.\n2007) have to be interpreted with caution. Also, detecting\na possible dark matter halo around globular clusters is less\nfeasible due to the population of potential escapers. Based\non our investigation we suggest that no deviation from\nNewtonian gravity in a star cluster has been detected so\nfar, neither has there been evidence for a dark matter halo.\nFrom our large set of surface density profiles we saw\nthat in most cases the structure of extended star clusters\ncan be split into core, bulk and tidal debris.\n(i) The core is the innermost part of the cluster which\nextends out to the core radius. In most cases it is flat,\nand only for clusters with strong mass segregation or with\nan IMBH is it cuspy. Very concentrated clusters with\nRhp /RJ < 0.1 have such a small core that fitting such\nclusters leads to problems with templates as well as with\n\n\fPeculiarities in Velocity Dispersion and Surface Density Profiles of Star Clusters\nphysical models (see also Baumgardt et al. 2010).\n\n(ii) The bulk contains most stars of the cluster and\nextends from the core to the tidal debris. We found that\nthe bulk can be well represented by a King-like template.\nWe named the radius at which such a template approaches\nzero density the edge of the bulk and not the tidal radius of\nthe cluster, since we found it not to be consistent with the\nJacobi radius. In the case of concentrated clusters, the edge\nradius is not even determined by tidal forces at all (Tab. B5).\nMoreover, for clusters on eccentric orbits we found that\nthe edge radius of a cluster adjusts to the mean Jacobi\nradius (Fig. 12) and not the perigalactic Jacobi radius,\nwhich has been assumed in earlier investigations (e.g.\nInnanen, Harris, & Webbink 1983, Fall & Zhang 2001), but\nhas never been checked by self-consistent calculations on a\nstar-by-star basis. Since nearly all globular clusters of the\nMilky Way are more compact and massive than our test\ncluster, and thus should be less influenced by tidal variations, this finding should also hold for most of these clusters.\nThe edge radius of extended and moderately concentrated clusters, as fitted by the King template, lies within\nabout 10% accuracy at 90% of the mean Jacobi radius\n(Tab. B1-B4). But we found the King template to be a bad\nrepresentation of the true profile in the case of non-circular\ncluster orbits because it is significantly influenced by\nthe tidal debris and by the potential escaper population.\nFurthermore the accuracy of the results strongly depends\non the radial coverage of the cluster. We therefore created\nan enhanced version of the King template which has more\nflexibility in the core and has an additional tidal debris\nterm, given by a power-law. With this KKBH template\nwe achieved a higher stability over all fit ranges. Furthermore, we were able to measure the edge of the bulk more\naccurately and found it to lie at 80% of the Jacobi radius.\nThis discrepancy is easily understandable if we take into\naccount the fact that the edge radius of a template fits\nthe azimuthally averaged mean of a cluster's tidal surface,\nwhereas the Jacobi radius is by definition the semi-major\naxis of the equipotential surface.\nFurthermore we found that the edge radii from concentrated clusters with Rhp /RJ < 0.1 cannot be extracted\nproperly with currently available templates. The higher\nthe concentration of the cluster the smaller is the ratio of\nthe fitted edge radius to the theoretically evaluated Jacobi\nradius (Tab. B5).\n\n(iii) The tidal debris falls off like a power-law with a\nslope of about -4 to -5, rather than the expected dependence\nof R−1 . This is due to the epicyclic motion of the stars in\nthe tidal tails, which is most pronounced in the vicinity of\nthe cluster.\nFor clusters on eccentric orbits, at a time shortly before\nreaching apogalacticon, the slope was found to deviate\nfor a short time to a value of about -2 as a consequence\nof orbital compression of the tails (Fig. 10 & 11). We\n\n19\n\nsuggest that this enhanced slope can be used to identify\nstar clusters which are close to or at the apogalacticon of\ntheir orbit. The most prominent example of such a cluster\nis the Milky Way globular cluster Palomar 5 which is\nwell known to be close to the apogalacticon of its orbit\n(Dehnen et al. 2004), and which shows a power-law slope of\n-1.5 outside its assumed Jacobi radius (Odenkirchen et al.\n2003). Moreover, the MW globular clusters Palomar 13, AM\n4 and Whiting 1 may be further candidates for being close\nto apogalacticon, since their surface density profiles show\npower-law slopes of about -1.8 outside the Jacobi radius,\nwhich has been attributed to heavy ongoing mass loss by\nthe authors of the corresponding investigations (Côté et al.\n2002; Carraro, Zinn & Moni Bidin 2007; Carraro 2009).\nFurthermore we showed that due to the population of potential escapers the power-law slope of the tidal debris begins even before the Jacobi radius is reached. Thus, the bulk\nand the tidal debris partially overlap. With our KKBH template we found the debris to dominate for radii larger than\nabout 50% of the Jacobi radius (Tab. B1-B4).\nWith the help of our comprehensive set of clusters it\nis possible to tailor a star cluster template to the facts we\nhave found. Our KKBH template seems to be a good first\nstep but, like all other available templates, shows discrepancies for concentrated clusters. Of course, templates are\nless attractive than physically motivated models. None of\nthe existing models, like King (1966) and Wilson (1975),\nhowever, account for the above mentioned facts. We suggest\nthat a general, physically motivated model for star clusters\nshould include a term for mass segregation and should\ninclude a potential escaper population when being fitted to\nobservations. Finally, the possible influence of (compressed)\ntidal tails on the surface density profiles of star clusters\nshould be kept in mind when fitting surface density profiles.\nMoreover, the fact that all clusters in the sample showed\na constant edge of the bulk with time (Fig. 12) and that\nstars which get unbound escape from a cluster with a delay,\nsupports our theoretical treatment of epicyclic overdensities\nin tidal tails for clusters in time-dependent tidal fields in\nKüpper et al. (2010).\n\nACKNOWLEDGEMENTS\nWe are very grateful to Sverre Aarseth for making his\nNbody4 and Nbody6 codes freely vailable and for continuous support. AHWK kindly acknowledges the support of an\nESO Studentship.\n\nREFERENCES\nAarseth S. J., 2003, Gravitational N-Body Simulations,\nCambridge, UK, Cambridge University Press\nAllen C., Santillan C., 1991, RMxAA, 22, 255\nBarmby P., et al., 2009, AJ, 138, 1667\nBaumgardt H., 2001, MNRAS, 325, 1323\nBaumgardt H., Makino J., 2003, MNRAS, 340, 227\nBaumgardt H., Côté P., Hilker M., Rejkuba M., Mieske S.,\nDjorgovski S. G., Stetson P., 2009, MNRAS, 396, 2051\n\n\f20\n\nA.H.W. Küpper, P. Kroupa, H. Baumgardt and D.C. Heggie\n\nBaumgardt H., Parmentier G., Gieles M., Vesperini E.,\n2010, MNRAS, 401, 1832\nBinney J., Tremaine S., 2008, Galactic Dynamics, Princeton, NJ, Princeton University Press\nBonatto C., Bica E., 2008, A&A, 477, 829\nCapuzzo Dolcetta R., Di Matteo P., Miocchi P., 2005, AJ,\n129, 1906\nCarraro G., Zinn R., Moni Bidin C., 2007, A&A, 466, 181\nCarraro G., 2009, AJ, 137, 3809\nCasertano S., Hut P., 1985, ApJ, 298, 80\nCôté P., Djorgovski S. G., Meylan G., Castro S., McCarthy\nJ. K., 2002, ApJ, 574, 783\nDehnen W., Odenkirchen M., Grebel E. K., Rix H.-W.,\n2004, AJ, 127, 2753\nDrukier G. A., Slavin S. D., Cohn H. N., Lugger P. M.,\nBerrington R. C., Murphy B. W., Seitzer P. O., 1998, AJ,\n115, 708\nDrukier G. A., Cohn H. N., Lugger P. M., Slavin S. D.,\nBerrington R. C., Murphy B. W., 2007, AJ, 133, 1041\nElson R. A. W., Fall S. M., Freeman K. C., 1987, ApJ, 323,\n54\nFall S. M., Zhang Q., 2001, ApJ, 561, 751\nFukushige T., Heggie D. C., 2000, MNRAS, 318, 753\nFukushige T., Makino J., Kawai A., 2005, PASJ, 57, 1009\nGieles M., Sana H., Portegies Zwart S. F., 2009, MNRAS,\nin press\nGnedin O. Y., Lee H. M., Ostriker J. P., 1999, ApJ, 522,\n935\nGouliermis D. A., Mackey D., Xin Y., Rochau B., 2010,\nApJ, 709, 263\nHeggie D., Hut P., 2003, The Gravitational Million-Body\nProblem, Cambridge, UK, Cambridge University Press\nInnanen K. A., Harris W. E., Webbink R. F., 1983, AJ, 88,\n338\nJordi K., et al., 2009, AJ, 137, 4586\nJust A., Berczik P., Petrov M. I., Ernst A., 2009, MNRAS,\n392, 969\nKing I. R., 1962, AJ, 67, 471\nKing I. R., 1966, AJ, 71, 64\nKouwenhoven M. B. N., de Grijs R., 2009, Ap&SS, 324,\n171\nKroupa P., 2001, MNRAS, 322, 231\nKüpper A. H. W., Macleod A., Heggie D. C., 2008, MNRAS, 387, 1248\nKüpper A. H. W., Kroupa P., Baumgardt H., 2008, MNRAS, 389, 889\nKüpper A. H. W., Kroupa P., Baumgardt H., Heggie D. C.,\n2010, MNRAS, 401, 105\nKüpper A. H. W., Kroupa P., 2010, ApJ submitted\nLane R. R., Kiss L. L., Lewis G. F., Ibata R. A., Siebert\nA., Bedding T. R., Székely P., 2009, MNRAS, 400, 917\nLane R. R., Kiss L. L., Lewis G. F., Ibata R. A., Siebert\nA., Bedding T. R., Székely P., 2010, MNRAS, 401, 2521\nLauer T. R., et al., 1995, AJ, 110, 2622\nMcLaughlin D. E., 2003, ASPC, 296, 101\nMcLaughlin D. E., Meylan G., 2003, ASPC, 296, 153\nMcLaughlin D. E., van der Marel R. P., 2005, ApJS, 161,\n304\nMilgrom M., 1983, ApJ, 270, 365\nOdenkirchen M., et al., 2003, AJ, 126, 2385\nScarpa R., Marconi G., Gilmozzi R., Carraro G., 2007,\nMsngr, 128, 41\n\nScarpa R., Marconi G., Gilmozzi R., 2003, A&A, 405, L15\nSpitzer L., 1987, Dynamical evolution of globular clusters,\nPrinceton, NJ, Princeton University Press, 1987, 191 p.\nŠubr L., Kroupa P., Baumgardt H., 2008, MNRAS, 385,\n1673\nTrenti M., Vesperini E., Pasquato M., 2010, ApJ, 708, 1598\nvan der Marel R. P., Anderson J., 2010, ApJ, 710, 1063\nWilson C. P., 1975, AJ, 80, 175\n\nAPPENDIX A: FITTING KKBH USING\nGNUPLOT\nWhen using gnuplot, fitting the KKBH template is quite\nsimple since it is possible to use ternary operators. First\nthe two functions f1 (R) and f2 (R) (eq. 22 & 23) need to be\ndefined with\nf1(x) = (x<Rt ? k * (x/Rc/(1.0+x/Rc))**(-gamma)\n* (1.0/(1.0+(x/Rc)**2.0)**(0.5) 1.0/(1.0+(Rt/Rc)**2.0)**(0.5))**2.0 : 0)\nand\nf2(x) = f1(Rt*mu) * (1.0 +\n(x/(Rt*mu))**64.0)**(-eta/64.0)\nafter which the KKBH function is defined\nf(x) = (x < mu*Rt ? f1(x) + b : f2(x) + b)\nis defined. Then the constants have to be set to some\nreasonable value, e.g.\nk = 1.0\nRc = 5.0\ngamma = 0.01\nRt = 50.0\nmu = 0.5\neta = 3.0\nb = 0.0001\nIf surface density data exists in a file named, e.g.,\ndata.txt, with columns R, Σ(R) and ∆Σ(R), the final\nfitting is carried out by use of the command\nfit f(x) ′data.txt′ u 1:2:3 via k, Rc, gamma, Rt,\neta, mu, b.\n\nAPPENDIX B: DATA TABLES\n\nThis paper has been typeset from a TEX/ LATEX file prepared\nby the author.\n\n\fPeculiarities in Velocity Dispersion and Surface Density Profiles of Star Clusters\nTable B1. Fitting results for the edge radii in units of the theoretical Jacobi radius for the clusters in a constant tidal field\naveraged over all available snapshots of the specific model. The results are given for the three smallest fit ranges. In the last line\na weighted mean and the standard deviation of the results is given. Rt gives the edge radius of the specific template, whereas RJ\nstands for the theoretical Jacobi radius. μ is the fraction of the edge radius, at which the KKBH template turns into a power-law.\nName\n\nA0\n\nB0\n\nC0\n\nD0\n\nfit range\n[pc]\n1-25\n1-50\n1-100\n1-25\n1-50\n1-100\n1-25\n1-50\n1-100\n1-25\n1-50\n1-100\n\nmean\n\nKing\n\nGen. Nuker\n\nRt\nRJ\n\nRt\nRJ\n\n0.86\n0.97\n0.98\n0.68\n0.89\n0.92\n0.63\n0.84\n0.92\n0.56\n0.78\n0.90\n\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n\n0.06\n0.06\n0.06\n0.05\n0.05\n0.07\n0.04\n0.01\n0.05\n0.05\n0.01\n0.05\n\n0.81 ± 0.14\n\n3.70\n2.12\n2.22\n2.58\n1.48\n1.36\n1.94\n1.56\n1.36\n1.58\n1.32\n1.20\n\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n\nKKBH\nμRt\nRJ\n\n0.86\n0.98\n0.97\n0.41\n0.70\n0.49\n0.35\n0.89\n0.74\n0.26\n0.96\n0.74\n\n1.84 ± 0.72\n\n0.49\n0.53\n0.57\n0.41\n0.49\n0.51\n0.60\n0.46\n0.50\n0.57\n0.39\n0.49\n\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n\nKing (bound)\nRt\nRJ\n\n0.09\n0.08\n0.11\n0.12\n0.06\n0.07\n0.05\n0.05\n0.05\n0.02\n0.03\n0.05\n\n0.50 ± 0.06\n\n0.82\n0.85\n0.86\n0.75\n0.81\n0.81\n0.76\n0.79\n0.81\n0.71\n0.76\n0.80\n\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n\nRt\nRJ\n\n0.07\n0.07\n0.08\n0.06\n0.06\n0.06\n0.03\n0.03\n0.03\n0.02\n0.02\n0.03\n\n0.78 ± 0.15\n\n0.77\n0.74\n0.74\n0.70\n0.71\n0.71\n0.67\n0.71\n0.71\n0.63\n0.71\n0.71\n\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n\n0.47\n0.13\n0.13\n0.04\n0.04\n0.04\n0.02\n0.01\n0.01\n0.01\n0.01\n0.03\n\n0.69 ± 0.04\n\nTable B2. Fitting results for the edge radii in units of the theoretical Jacobi radius for the clusters in time-dependent tidal fields\nand orbital eccentricities of 0.25 averaged over all available snapshots of the specific model. The results are given for the three\nsmallest fit ranges. In the last line a weighted mean and the standard deviation of the results is given. Rt gives the edge radius\nof the specific template, whereas RJ stands for the theoretical Jacobi radius. μ is the fraction of the edge radius, at which the\nKKBH template turns into a power-law.\nName\n\nA1\n\nB1\n\nC1\n\nD1\n\nmean\n\nfit range\n[pc]\n1-25\n1-50\n1-100\n1-25\n1-50\n1-100\n1-25\n1-50\n1-100\n1-25\n1-50\n1-100\n\nKing\n\nGen. Nuker\n\nRt\nRJ\n\nRt\nRJ\n\n0.90\n0.98\n0.98\n0.76\n0.95\n0.97\n0.66\n0.90\n0.96\n0.69\n0.87\n0.97\n\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n\n0.19\n0.22\n0.22\n0.12\n0.16\n0.17\n0.06\n0.09\n0.11\n0.13\n0.15\n0.18\n\n0.85 ± 0.12\n\n3.83\n3.37\n2.08\n2.97\n1.60\n1.54\n2.18\n1.59\n1.38\n1.86\n1.49\n1.30\n\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n\nKKBH\nμRt\nRJ\n\n1.76\n1.51\n1.59\n0.70\n0.69\n0.57\n0.41\n0.94\n0.53\n0.49\n1.00\n0.53\n\n1.92 ± 0.84\n\n0.56\n0.58\n0.65\n0.44\n0.54\n0.55\n0.63\n0.51\n0.54\n0.63\n0.47\n0.53\n\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n\n0.13\n0.13\n0.14\n0.11\n0.10\n0.12\n0.09\n0.07\n0.07\n0.11\n0.09\n0.09\n\n0.55 ± 0.06\n\nKing (bound)\nRt\nRJ\n\n0.84\n0.86\n0.88\n0.80\n0.86\n0.85\n0.81\n0.85\n0.86\n0.79\n0.82\n0.85\n\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n\nRt\nRJ\n\n0.17\n0.17\n0.18\n0.13\n0.14\n0.15\n0.08\n0.08\n0.08\n0.13\n0.14\n0.14\n\n0.84 ± 0.03\n\n0.71\n0.69\n0.69\n0.71\n0.72\n0.72\n0.68\n0.72\n0.72\n0.66\n0.71\n0.71\n\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n\n0.42\n0.04\n0.04\n0.04\n0.08\n0.08\n0.03\n0.02\n0.02\n0.05\n0.03\n0.03\n\n0.70 ± 0.02\n\n21\n\n\f22\n\nA.H.W. Küpper, P. Kroupa, H. Baumgardt and D.C. Heggie\nTable B3. Fitting results for the edge radii in units of the theoretical Jacobi radius for the clusters in time-dependent tidal fields\nand orbital eccentricities of 0.5 averaged over all available snapshots of the specific model. The results are given for the three\nsmallest fit ranges. In the last line a weighted mean and the standard deviation of the results is given. Rt gives the edge radius\nof the specific template, whereas RJ stands for the theoretical Jacobi radius. μ is the fraction of the edge radius, at which the\nKKBH template turns into a power-law.\nName\n\nA2\n\nB2\n\nC2\n\nD2\n\nfit range\n[pc]\n1-25\n1-50\n1-100\n1-25\n1-50\n1-100\n1-25\n1-50\n1-100\n1-25\n1-50\n1-100\n\nmean\n\nKing\n\nGen. Nuker\n\nRt\nRJ\n\nRt\nRJ\n\n1.01\n1.18\n1.23\n0.80\n0.94\n0.97\n0.70\n0.90\n0.95\n0.64\n0.87\n0.94\n\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n\n0.53\n0.68\n0.73\n0.31\n0.37\n0.38\n0.24\n0.32\n0.34\n0.22\n0.31\n0.35\n\n0.88 ± 0.17\n\n3.39\n2.75\n3.46\n2.72\n2.30\n1.58\n2.59\n1.92\n1.59\n2.25\n1.57\n1.33\n\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n\nKKBH\nμRt\nRJ\n\n2.75\n2.45\n2.49\n1.72\n1.63\n1.29\n1.18\n0.98\n1.02\n0.88\n0.91\n0.74\n\n2.06 ± 0.72\n\n0.54\n0.58\n0.68\n0.50\n0.51\n0.55\n0.45\n0.51\n0.54\n0.52\n0.49\n0.55\n\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n\nKing (bound)\nRt\nRJ\n\n0.25\n0.27\n0.56\n0.19\n0.18\n0.19\n0.17\n0.17\n0.18\n0.19\n0.16\n0.18\n\n0.52 ± 0.06\n\n0.83\n0.95\n1.08\n0.79\n0.81\n0.82\n0.76\n0.82\n0.82\n0.74\n0.79\n0.81\n\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n\nRt\nRJ\n\n0.40\n0.68\n1.04\n0.30\n0.31\n0.31\n0.25\n0.28\n0.28\n0.25\n0.27\n0.27\n\n0.81 ± 0.09\n\n0.61\n0.62\n0.62\n0.66\n0.66\n0.66\n0.65\n0.67\n0.67\n0.62\n0.66\n0.66\n\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n\n0.10\n0.10\n0.10\n0.07\n0.07\n0.07\n0.11\n0.07\n0.07\n0.10\n0.07\n0.07\n\n0.65 ± 0.02\n\nTable B4. Fitting results for the edge radii in units of the theoretical Jacobi radius for the clusters in time-dependent tidal fields\nand orbital eccentricities of 0.75 averaged over all available snapshots of the specific model. The results are given for the three\nsmallest fit ranges. In the last line a weighted mean and the standard deviation of the results is given. Rt gives the edge radius\nof the specific template, whereas RJ stands for the theoretical Jacobi radius. μ is the fraction of the edge radius, at which the\nKKBH template turns into a power-law.\nName\n\nA3\n\nB3\n\nC3\n\nD3\n\nmean\n\nfit range\n[pc]\n1-25\n1-50\n1-100\n1-25\n1-50\n1-100\n1-25\n1-50\n1-100\n1-25\n1-50\n1-100\n\nKing\n\nGen. Nuker\n\nRt\nRJ\n\nRt\nRJ\n\n2.06\n2.26\n2.17\n0.64\n0.87\n0.94\n1.38\n1.96\n2.24\n1.36\n1.75\n2.06\n\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n\n2.01\n2.27\n2.09\n0.22\n0.31\n0.35\n1.39\n1.81\n1.83\n1.67\n1.66\n1.74\n\n1.14 ± 0.58\n\n4.99\n3.67\n4.12\n2.25\n1.57\n1.33\n3.12\n2.57\n2.60\n2.67\n2.09\n2.10\n\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n\nKKBH\nμRt\nRJ\n\n2.44\n2.31\n2.05\n0.88\n0.91\n0.74\n2.11\n1.94\n1.91\n1.85\n1.73\n1.64\n\n2.43 ± 1.06\n\n1.16\n1.20\n1.91\n0.52\n0.49\n0.55\n0.26\n0.88\n1.04\n1.17\n1.25\n1.36\n\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n\n2.23\n1.47\n2.23\n0.19\n0.16\n0.18\n1.68\n1.06\n1.40\n1.73\n1.94\n1.80\n\n0.67 ± 0.46\n\nKing (bound)\nRt\nRJ\n\n1.08\n2.07\n1.31\n0.74\n0.79\n0.81\n1.60\n1.57\n1.77\n1.43\n1.74\n1.74\n\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n\nRt\nRJ\n\n0.72\n2.44\n1.28\n0.25\n0.27\n0.27\n1.78\n1.53\n1.84\n1.53\n1.89\n1.65\n\n1.03 ± 0.44\n\n1.47\n1.43\n1.43\n0.62\n0.66\n0.66\n0.95\n0.85\n0.87\n1.07\n1.25\n1.29\n\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n\n2.06\n1.90\n1.90\n0.10\n0.07\n0.07\n1.21\n0.73\n0.76\n1.15\n1.47\n1.52\n\n0.72 ± 0.32\n\n\fPeculiarities in Velocity Dispersion and Surface Density Profiles of Star Clusters\nTable B5. Fitting results for the edge radii in units of the theoretical Jacobi radius for the concentrated clusters with a half-mass\nradius of 3 pc averaged over all available snapshots of the specific model. The results are given for the three smallest fit ranges. In\nthe last line a weighted mean and the standard deviation of the results is given. Rt gives the edge radius of the specific template,\nwhereas RJ stands for the theoretical Jacobi radius. μ is the fraction of the edge radius, at which the KKBH template turns into\na power-law.\nName\n\nA0c\n\nB0c\n\nC0c\n\nD0c\n\nmean\n\nfit range\n[pc]\n1-25\n1-50\n1-100\n1-25\n1-50\n1-100\n1-25\n1-50\n1-100\n1-25\n1-50\n1-100\n\nKing\n\nGen. Nuker\n\nRt\nRJ\n\nRt\nRJ\n\n0.75\n0.79\n0.80\n0.56\n0.64\n0.64\n0.47\n0.55\n0.56\n0.36\n0.42\n0.43\n\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n\n0.10\n0.10\n0.10\n0.10\n0.12\n0.13\n0.12\n0.14\n0.15\n0.06\n0.09\n0.10\n\n0.57 ± 0.15\n\n3.72\n1.85\n2.46\n2.51\n2.17\n1.50\n1.87\n1.48\n1.39\n1.65\n1.36\n1.29\n\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n\nKKBH\nμRt\nRJ\n\n0.24\n0.93\n0.90\n0.25\n0.90\n0.51\n0.60\n0.57\n0.34\n1.04\n0.81\n0.32\n\n2.10 ± 0.70\n\n0.35\n0.43\n0.44\n0.36\n0.33\n0.33\n0.34\n0.20\n0.26\n0.26\n0.14\n0.17\n\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n\n0.10\n0.10\n0.12\n0.23\n0.13\n0.09\n0.19\n0.06\n0.10\n0.15\n0.02\n0.05\n\n0.24 ± 0.10\n\nKing (bound)\nRt\nRJ\n\n0.65\n0.72\n0.71\n0.55\n0.57\n0.58\n0.49\n0.43\n0.49\n0.38\n0.32\n0.36\n\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n\nRt\nRJ\n\n0.11\n0.11\n0.12\n0.19\n0.14\n0.14\n0.19\n0.12\n0.15\n0.14\n0.06\n0.08\n\n0.50 ± 0.13\n\n0.79\n0.69\n0.69\n0.59\n0.64\n0.64\n0.52\n0.53\n0.53\n0.41\n0.42\n0.42\n\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n±\n\n0.92\n0.06\n0.06\n0.10\n0.43\n0.43\n0.12\n0.13\n0.13\n0.07\n0.09\n0.09\n\n0.55 ± 0.12\n\n23\n\n\f"}