{"id": "http://arxiv.org/abs/0708.2752v1", "guidislink": true, "updated": "2007-08-21T02:27:13Z", "updated_parsed": [2007, 8, 21, 2, 27, 13, 1, 233, 0], "published": "2007-08-21T02:27:13Z", "published_parsed": [2007, 8, 21, 2, 27, 13, 1, 233, 0], "title": "Cubic points on cubic curves and the Brauer-Manin obstruction on K3\n  surfaces", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0708.2704%2C0708.0714%2C0708.2396%2C0708.1610%2C0708.4343%2C0708.0848%2C0708.3039%2C0708.4182%2C0708.0792%2C0708.3669%2C0708.1346%2C0708.4311%2C0708.4024%2C0708.2068%2C0708.3171%2C0708.2633%2C0708.3679%2C0708.4384%2C0708.0735%2C0708.3839%2C0708.0100%2C0708.2553%2C0708.0667%2C0708.0053%2C0708.2255%2C0708.4299%2C0708.2778%2C0708.4314%2C0708.4064%2C0708.1531%2C0708.2467%2C0708.0275%2C0708.2675%2C0708.3205%2C0708.3472%2C0708.3868%2C0708.0204%2C0708.0288%2C0708.1564%2C0708.3426%2C0708.4034%2C0708.0299%2C0708.3522%2C0708.0812%2C0708.3023%2C0708.1443%2C0708.0353%2C0708.2752%2C0708.1671%2C0708.2035%2C0708.1110%2C0708.2462%2C0708.2157%2C0708.0797%2C0708.0687%2C0708.1815%2C0708.0993%2C0708.3682%2C0708.4213%2C0708.3973%2C0708.3214%2C0708.3277%2C0708.2370%2C0708.1335%2C0708.4019%2C0708.2794%2C0708.0135%2C0708.2950%2C0708.0028%2C0708.0620%2C0708.1916%2C0708.0138%2C0708.1930%2C0708.4112%2C0708.3944%2C0708.0253%2C0708.1979%2C0708.0584%2C0708.3445%2C0708.2710%2C0708.1267%2C0708.1800%2C0708.2123%2C0708.3137%2C0708.1448%2C0708.1249%2C0708.0788%2C0708.4252%2C0708.0612%2C0708.1285%2C0708.1796%2C0708.1164%2C0708.0557%2C0708.2942%2C0708.0014%2C0708.4028%2C0708.2460%2C0708.2164%2C0708.3237%2C0708.0413%2C0708.3735&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Cubic points on cubic curves and the Brauer-Manin obstruction on K3\n  surfaces"}, "summary": "We show that if over some number field there exists a certain diagonal plane\ncubic curve that is locally solvable everywhere, but that does not have points\nover any cubic galois extension of the number field, then the algebraic part of\nthe Brauer-Manin obstruction is not the only obstruction to the Hasse principle\nfor K3 surfaces.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0708.2704%2C0708.0714%2C0708.2396%2C0708.1610%2C0708.4343%2C0708.0848%2C0708.3039%2C0708.4182%2C0708.0792%2C0708.3669%2C0708.1346%2C0708.4311%2C0708.4024%2C0708.2068%2C0708.3171%2C0708.2633%2C0708.3679%2C0708.4384%2C0708.0735%2C0708.3839%2C0708.0100%2C0708.2553%2C0708.0667%2C0708.0053%2C0708.2255%2C0708.4299%2C0708.2778%2C0708.4314%2C0708.4064%2C0708.1531%2C0708.2467%2C0708.0275%2C0708.2675%2C0708.3205%2C0708.3472%2C0708.3868%2C0708.0204%2C0708.0288%2C0708.1564%2C0708.3426%2C0708.4034%2C0708.0299%2C0708.3522%2C0708.0812%2C0708.3023%2C0708.1443%2C0708.0353%2C0708.2752%2C0708.1671%2C0708.2035%2C0708.1110%2C0708.2462%2C0708.2157%2C0708.0797%2C0708.0687%2C0708.1815%2C0708.0993%2C0708.3682%2C0708.4213%2C0708.3973%2C0708.3214%2C0708.3277%2C0708.2370%2C0708.1335%2C0708.4019%2C0708.2794%2C0708.0135%2C0708.2950%2C0708.0028%2C0708.0620%2C0708.1916%2C0708.0138%2C0708.1930%2C0708.4112%2C0708.3944%2C0708.0253%2C0708.1979%2C0708.0584%2C0708.3445%2C0708.2710%2C0708.1267%2C0708.1800%2C0708.2123%2C0708.3137%2C0708.1448%2C0708.1249%2C0708.0788%2C0708.4252%2C0708.0612%2C0708.1285%2C0708.1796%2C0708.1164%2C0708.0557%2C0708.2942%2C0708.0014%2C0708.4028%2C0708.2460%2C0708.2164%2C0708.3237%2C0708.0413%2C0708.3735&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We show that if over some number field there exists a certain diagonal plane\ncubic curve that is locally solvable everywhere, but that does not have points\nover any cubic galois extension of the number field, then the algebraic part of\nthe Brauer-Manin obstruction is not the only obstruction to the Hasse principle\nfor K3 surfaces."}, "authors": ["Ronald van Luijk"], "author_detail": {"name": "Ronald van Luijk"}, "author": "Ronald van Luijk", "arxiv_comment": "17 pages, comments welcome", "links": [{"href": "http://arxiv.org/abs/0708.2752v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0708.2752v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.NT", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.NT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.AG", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "11G05, 14J28, 14C22", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0708.2752v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0708.2752v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:0708.2752v1 [math.NT] 21 Aug 2007\n\nCUBIC POINTS ON CUBIC CURVES AND THE\nBRAUER-MANIN OBSTRUCTION ON K3 SURFACES\nRONALD VAN LUIJK\nAbstract. We show that if over some number field there exists a certain\ndiagonal plane cubic curve that is locally solvable everywhere, but that does\nnot have points over any cubic galois extension of the number field, then the\nalgebraic part of the Brauer-Manin obstruction is not the only obstruction to\nthe Hasse principle for K3 surfaces.\n\n1. Introduction\nIf we want to prove that a variety X defined over the field of rational numbers\nQ does not have any rational points, it suffices to show that X has no real points\nor no p-adic points for some prime number p. For some varieties the converse\nholds as well. Conics, for instance, have a rational point if and only if they have\na real point and a p-adic point for every prime p, i.e., if and only if they have a\npoint locally everywhere. This is phrased by saying that conics satisfy the Hasse\nprinciple. Selmer's famous example of the plane curve given by\n(1)\n\n3x3 + 4y 3 + 5z 3 = 0\n\nshows that cubic curves in general do not satisfy the Hasse principle, as this smooth\ncurve has points everywhere locally, but it has no points over Q (see [20]).\nSome varieties with points locally everywhere have no global points because of\nthe socalled Brauer-Manin obstruction to the Hasse principle. This obstruction\nis based on the Brauer group of the variety. We refer to [25], section 5.2, for a\ngood description of this obstruction. The main idea is the following. For a smooth,\nprojective, geometrically integral variety Q\nX over a number field k, the set X(Ak )\nof adelic points on X equals the product v X(kv ), where v runs over all places of\nk and kv denotes the completion of k at v. This product is nonempty if and only\nif X has points locally everywhere. Based on class field theory, one associates to\neach element g in the Brauer group Br X of X a certain subset X(Ak )g of X(Ak )\nthat contains the set X(k) of k-points on X, embedded diagonally in X(Ak ). We\nsay there is a Brauer-Manin obstruction\nT to the Hasse principle if X(Ak ) 6= ∅, but\nfor some subset B ⊂ Br(X) we have g∈B X(Ak )g = ∅, and thus X(k) = ∅. Often\none focuses on the set B = Br1 X of socalled algebraic elements, defined as the\nkernel of the map Br X → Br Xk , where k denotes an algebraic closure of k. These\nalgebraic elements are relatively easy to get our hands on.\nFor certain classes of varieties the Brauer-Manin obstruction is the only obstruction to the Hasse principle. For a cubic curve C with finite Tate-Shafarevich group,\nfor instance, it is indeed true that if C has points locally everywhere and there is no\n2000 Mathematics Subject Classification. 11G05, 14J28, 14C22.\nKey words and phrases. K3 surfaces, abelian points, cubic curves, Brauer-Manin obstruction.\n1\n\n\f2\n\nRONALD VAN LUIJK\n\nBrauer-Manin obstruction, then C contains a rational point (see [12], or [25], Thm.\n6.2.3). It is conjectured that the Brauer-Manin obstruction is the only obstruction\nto the Hasse principle on all curves of genus at least 2 and all smooth, proper,\ngeometrically integral, rationally connected varieties over number fields (see [18]\nand [5], p. 3).\nFor K3 surfaces, however, it is not at all clear whether the Brauer-Manin obstruction is the only one. Even if in general this is not the case, it could still be true\nfor special K3 surfaces, such as singular K3 surfaces, which are those with maximal\nPicard number 20. A priori, it could be true that the algebraic part already gives\nan obstruction, if there is any.\nIn this paper, a k-cubic point is a point defined over some galois (Z/3Z)-extension\nof k. Our main theorem states the following.\nTheorem 1.1. Let k be a number field. Suppose we have a smooth curve C ⊂ P2k\ngiven by ax3 + by 3 + cz 3 = 0, such that\n(1) the product abc is not a cube in k,\n(2) the curve C has points locally everywhere,\n(3) the curve C has no k-cubic points.\nThen there exists a quotient of C × C, defined over k, such that its minimal desingularization Y is a singular K3 surface satisfying Y (Ak )Br1 Y 6= ∅ and Y (k) = ∅.\nIn other words, if a certain cubic curve exists, then the Brauer-Manin obstruction\ncoming from the algebraic part of the Brauer group is not the only obstruction to\nthe Hasse principle for singular K3 surfaces, let alone for K3 surfaces in general.\nThe existence of any plane cubic curve satisfying the third condition in Theorem\n1.1 is unknown and an interesting object of study by itself. The curve given by (1)\nsatisfies the first two conditions mentioned in Theorem 1.1. Several people have\nwondered whether it satisfies the third condition as well. It turns out that this is\nnot the case, as the intersection points of that curve with the lines\n711x + 172y + 785z = 0,\n657x + 124y + 815z = 0,\n4329x + 3988y + 2495z = 0\nare all Q-cubic points.\nIn the following section we will construct the quotient X of the surface C × C\nassociated to a general plane cubic C that will be used in the proof of Theorem 1.1.\nWe give explicit equations in the case of diagonal cubics and cubics in Weierstrass\nform and discuss some of the arithmetic properties of X and its desingularization Y .\nIn section 3 we will go deeper into the geometry in the case that k has characteristic\n0 and investigate the Néron-Severi group of Y . In section 4 we will prove the main\ntheorem. The fact that there is no Brauer-Manin obstruction will follow from the\nfact that Br1 Y is isomorphic to Br k, which never yields an obstruction. Some\nrelated open problems are stated in the last section.\nThe author would like to thank Hershy Kisilevsky, Michael Stoll, Bjorn Poonen,\nand Bas Edixhoven for helpful discussions and suggestions. He also thanks Universidad de los Andes, PIMS, University of British Columbia, and Simon Fraser\nUniversity for their support.\n\n\fCUBIC POINTS AND THE BRAUER-MANIN OBSTRUCTION ON K3 SURFACES\n\n3\n\n2. A K3 surface associated to a plane cubic curve\nLet k be any field of characteristic not equal to 2 or 3, and C any smooth\nprojective cubic curve in P2k . We extend the regular notion of collinearity by saying\nthat any three points P, Q, and R on C are collinear if the divisor (P ) + (Q) + (R)\nis linearly equivalent with a line section of C. By Bezout's theorem we know that\nfor any two points P and Q on C there is a unique third point R on C such that\nP, Q, and R are collinear. If P equals Q, then R is the \"third\" intersection point\nof C with the tangent to C at P . This yields a natural isomorphism\n\b\n(2)\nC ×C ∼\n= (P, Q, R) ∈ C 3 : P , Q, and R are collinear .\n\nLet ρ be the automorphism of C × C that sends (P, Q) to (Q, R), where P, Q, and R\nare collinear. Under the identification of (2) this corresponds to sending (P, Q, R)\nto (Q, R, P ). Clearly ρ has order 3. We let XC denote the quotient (C × C)/ρ, and\nwrite X = XC if C is understood. Let π : C × C → X denote the quotient map.\nThe surface XC is the quotient mentioned in Theorem 1.1. It is also used in [7],\nwhere the number of rational points on XC is related to random matrix theory.\nThe fixed points of ρ are exactly the nine points (P, P ) where P runs through\nthe flexes of C. Let P be such a flex and let r and s be two copies of a uniformizer\nat P . Then modulo the square of the maximal ideal at (P, P ) in C × C, the\nautomorphism ρ is given by (r, s) 7→ (s, t) with t = −r − s, c.f. [23], p. 115. The\nsubring of k[r, s] of invariants under the automorphism (r, s) 7→ (s, t) is generated\nas k-algebra by a = −rs − rt − st = r2 + rs + s2 , b = 3rst = −3rs(r + s), and\nc = r2 s + s2 t + t2 r = r3 + 3r2 s − s3 . They satisfy the equation a3 = b2 + bc + c2 ,\nwhich locally describes the corresponding singularity on XC up to higher degree\nterms, which do not change the type of singularity. We conclude that XC has\nnine singular points, all double points. Each is resolved after one blow-up, with\ntwo smooth (−2)-curves above it, intersecting each other in one point. Let YC\ndenote the blow-up of XC in its singular points. Again, we write Y = YC if C is\nunderstood. As the singular locus of X is defined over k, so is Y .\nDefinition 2.1. A K3 surface over k is a smooth, projective, geometrically integral\nsurface Z over k with trivial canonical sheaf, for which H 1 (Z, OZ ) = 0.\nProposition 2.2. The surface Y is a smooth K3 surface.\nProof. We have seen that ρ only has isolated fixed points. The corresponding singularities are A2 -singularities, which are rational double points. From the symmetry\nof the right-hand side of (2), it follows that ρ fixes the unique (up to scaling) nonvanishing regular differential of C × C. By [11], Thm. 2.4, these conditions imply\nthat a relatively minimal model of X is a K3 surface. By [11], Lemma 2.7, this\nmodel is isomorphic to the minimal resolution Y of X.\n\u0003\nWe now discuss some of the arithmetic properties of X and Y .\nLemma 2.3. The surface X has a k-rational point if and only if Y does.\nProof. Any k-rational point of Y maps to a k-rational point of X. Conversely,\nsuppose X has a k-rational point P . If P is not a singular point, then the unique\npoint of Y above P is also k-rational. If P is a singular point, then the unique\nintersection of the two irreducible components in the exceptional divisor above P\nis a k-rational point on Y .\n\u0003\n\n\f4\n\nRONALD VAN LUIJK\n\nCorollary 2.4. If k is a number field and C has points locally everywhere, then so\ndoes Y .\nProof. Let v be any place of k and kv the corresponding\n\u0001 completion. By assumption,\nC contains a kv -rational point P . Then π (P, P ) is a kv -rational point on X.\nApplying Lemma 2.3 to kv , we find that Y has a kv -rational point as well, so Y\nhas points locally everywhere.\n\u0003\nLemma 2.5. The k-rational points of X correspond to triples (P, Q, R), up to cyclic\npermutation, of collinear points on C that are defined over some galois (Z/3Z)extension l of k and permuted by Gal(l/k).\nProof. Suppose l is a galois (Z/3Z)-extension of k and (P, Q, R) a triple of l-rational\ncollinear points, permuted by Gal(l/k). Then all permutations of (P, Q, R) induced\nby Gal(l/k) are even, so the orbit {(P, Q), (Q, R), (R, P )} of ρ is galois invariant and\nyields a k-rational point of X. Conversely, any k-rational point of X corresponds\nto a galois invariant orbit of ρ, say {(P, Q), (Q, R), (R, P )}. This implies that galois\npermutes {P, Q, R}, but only by even permutations, so P, Q, and R are defined\nover k or over some galois (Z/3Z)-extension of k. They are collinear because (P, Q)\nand (Q, R) are in the same orbit of ρ.\n\u0003\nRemark 2.6. Note that the words \"permuted by Gal(l/k)\" mean that the points\nP, Q, and R are either all defined over k, or they are all conjugates.\nLemma 2.7. The surface Y has a k-rational point if and only if there exists a\ngalois (Z/3Z)-extension l of k such that C contains three collinear points defined\nover l and permuted by Gal(l/k).\nProof. This follows immediately from Lemmas 2.3 and 2.5.\n\n\u0003\n\nCorollary 2.8. If C has no k-cubic points, then Y has no k-rational points.\nProof. This follows immediately from Lemma 2.7.\n\n\u0003\n\nLet J = Jac C denote the Jacobian of C. The following proposition is not needed\nfor the proof of the main theorem, but it is an interesting fact, conveyed and proved\nto the author by Bjorn Poonen.\nProposition 2.9. Suppose that J(k) is finite and that 3 does not divide the order\nof J(k). Then the converse of Corollary 2.8 holds as well.\nProof. Suppose that C contains a k-cubic point P . If P is k-rational, then (P, P ) ∈\nC × C maps to a k-rational point on X, so Y has a k-rational point by Lemma\n2.3. If P is not k-rational then it is defined over a (Z/3Z)-extension l of k and\nhas two conjugates Q and R. Let L denote a line section of C. Then we have\n(P ) + (Q) + (R) − L ∈ J(k), while by assumption J(k) = 3J(k), so there is an\nelement D ∈ J(k) such that (P ) + (Q) + (R) − L ∼ 3D. By Riemann-Roch there\nexist unique points P ′ , Q′ , R′ ∈ C(l) that are linearly equivalent with P − D, Q − D,\nand R−D respectively. Then (P ′ )+(Q′ )+(R′ ) ∼ L, so P ′ , Q′ , and R′ are collinear.\nSince Gal(l/k) fixes D, it permutes P ′ , Q′ , and R′ . By Lemma 2.7 the surface Y\nhas a k-rational point.\n\u0003\nRemark 2.10. The Jacobian of the Selmer curve C given by (1) has trivial MordellWeil group over Q. Since C does not have any Q-rational points, by the proofs\nof Lemmas 2.3, 2.5, and Proposition 2.9 this implies that the galois conjugates of\n\n\fCUBIC POINTS AND THE BRAUER-MANIN OBSTRUCTION ON K3 SURFACES\n\n5\n\nany Q-cubic point on C are collinear, so it is no surprise that the Q-cubic points\nmentioned in the introduction come from intersecting C with a line.\nWe now show how to find explicit equations for XC . Let P̆2 denote the dual of\nP and let τ : C × C → P̆2 be the map that sends (P, Q) to the line through P and\nQ, and (P, P ) to the tangent to C at P . By Bezout's theorem, for a general line L\nin P2 we have #(L ∩ C) = 3, so there are 6 ordered pairs (P, Q) ∈ C × C that map\nunder τ to L. We conclude that τ is generically 6-to-1. The map τ factors through\nπ, inducing a 2-to-1 map φ : X → P̆2 that is ramified over the dual C̆ of C.\n2\n\nπ\n\nC ×C\n\nX\n\nφ\n\nP̆2\n\nτ\n\nThe dual C̆ has nine cusps, corresponding to the nine flexes of C. As a double\ncover of P2 ramified over a curve with a cusp yields the same singularity as the\nA2 -singularities of XC , we conclude that XC is not only birational, but in fact\nisomorphic to a double cover of P2 , ramified over a sextic with nine cusps.\nRemark 2.11. Suppose that an affine piece of C is given by f (x, y) = 0. Then the\nfunction field k(C × C) of C × C is the quotient field of the ring\n\u0001\nk[x1 , y1 , x2 , y2 ]/ f (x1 , y1 ), f (x2 , y2 ) .\nThe line L through the generic points (x1 , y1 ) and (x2 , y2 ) on C is given by\n\n(3)\n\nL : y=\n\nx2 y1 − x1 y2\ny2 − y1\nx+\n.\nx2 − x1\nx2 − x1\n\nLet the coordinates of P̆2 be given by r, s, t, where the point [r : s : t] corresponds\nto the line in P2 given by rx + sy + tz = 0, or in affine coordinates y = − rs x − st .\nComparing this to equation (3), we find that the inclusion of function fields\n\u0012\n\u0013\nr t\n∗\n2\nτ : k(P̆ ) = k\n→ k(C × C)\n,\ns s\nis given by\nr\nt\ny2 − y1\nx2 y1 − x1 y2\n,\nand\n.\n=−\n=−\ns\nx2 − x1\ns\nx2 − x1\nLet x3 ∈ k(C × C) be the x-coordinate of the third intersection point of the line\nL and C. Then the element d = (x1 − x2 )(x2 − x3 )(x3 − x1 ) is invariant under\nρ, so it is contained in the function field k(X) of X, embedded in k(C × C) by\nπ ∗ . The element d is not contained in k(P̆2 ), as it is only invariant under even\n2\npermutations of the xi . Hence d generates the quadratic\n\u0001 extension k(X)/k(P̆ ).\nr t\nWe may therefore identify k(X) with the field k s , s , d ⊂ k(C × C).\n\nExample 2.12. After applying a linear transformation defined over some finite extension of k, we may assume that one of the 9 inflection points of C is equal to\n[0 : 1 : 0] and that the tangent at that point is the line at infinity given by z = 0.\nAssume this can be done over k itself. Then the affine part given by z = 1 is given\nby a Weierstrass equation and as the characteristic of k is not equal to 2 or 3, we\ncan arrange for C to be given by\ny 2 = x3 + Ax + B\n\n\f6\n\nRONALD VAN LUIJK\n\nwith A, B ∈ k. With the point O = [0 : 1 : 0] as origin, C obtains the structure\nof an elliptic curve. Note that the inflection points of C are exactly the 3-torsion\npoints on the elliptic curve.\nTo find an explicit model for XC , we find a relation among rs , st , and d. The\nx-coordinates x1 , x2 , x3 of the intersection points of C with the generic line L given\nby rx + sy + t = 0 are the solutions to the equation\n\u0012\n\u00132\nr\nt\n− − x−\n+ x3 + Ax + B = 0.\ns\ns\nThe square of d = (x1 − x2 )(x2 − x3 )(x3 − x1 ) is exactly the discriminant of this\npolynomial, which is easy to compute. We find that XC can be given in weighted\nprojective space P(1, 1, 1, 3) with coordinates r, s, t, u by\nu2 = 4Br6 − 4Ar5 t + A2 r4 s2 + 36Br3 s2 t − 4r3 t3 − 18ABr2 s4\n\n− 30Ar2 s2 t2 + 24A2 rs4 t − (4A3 + 27B 2 )s6 + 54Bs4 t2 − 27s2 t4 ,\n\nwith u = s3 d. This is exactly the same as in [7], with b = −r/s and a = −t/s for\ntheir variables a and b. The map φ : X → P̆2 ramifies where the right-hand side of\nthe equation vanishes, which describes the dual C̆ of C. We can describe the cusps\nof C̆ very explicitly. The cusp corresponding to O is [0 : 0 : 1]. The slopes dy/dx at\nthe inflection points of C that are not equal to O are the roots of the polynomial\nF = u8 + 18Au4 + 108Bu2 − 27A2 .\n\n4\n\n+3A\n).\nIf α is a root of F , then the corresponding inflection point is (x, y) = ( 31 α2 , α 6α\n2\n4\nThe corresponding cusp on C̆ is [r : s : t] = [6α : −6α : 3A − α ]. Note that the\nsplitting field of F is exactly k(C[3]), the field of definition of all 3-torsion.\n\nExample 2.13. Suppose C is given by\nax3 + by 3 + c = 0.\nThen as in Example 2.12 we find that in this case XC ⊂ P(1, 1, 1, 3) can be given\nby\n3u2 = 2abc(cr3 s3 + br3 t3 + as3 t3 ) − b2 c2 r6 − a2 c2 s6 − a2 b2 t6 ,\nwith u = 91 a2 s3 d = 19 a2 s3 (x1 − x2 )(x2 − x3 )(x3 − x1 ). Each of the coordinate axes\nx = 0 and y = 0 and the line z = 0 at infinity intersects the curve C at three flexes.\nEach of the corresponding nine cusps on C̆ lies on one of the coordinate axes given\nby rst = 0 in P̆2 .\nIn the next section we will investigate the geometry of Y and find its Picard group\nPic Y , at least in the general case that C does not admit complex multiplication.\nThe group Pic Y is generated by irreducible curves on Y , of which we will now\ndescribe some explicitly.\nLet Π denote the set of the nine cusps of C̆. We will freely identify the elements\nof Π with the flexes on C that they correspond to. A priori one would not expect\nthere to be any conics going through six points of Π, but it turns out there are 12.\nThey are described by Proposition 2.14. Fix a point O ∈ Π to give C the structure\nof an elliptic curve. Then Π is the group C[3] of 3-torsion and thus Π obtains the\nstructure of an F3 -vectorspace in which a line is any translate of any 1-dimensional\nlinear subspace. The three points on such lines are actually collinear as points on\nC. The set of these 12 lines in Π is thus in bijection with the set of triples of\ncollinear points in Π, and therefore independent of the choice of O.\n\n\fCUBIC POINTS AND THE BRAUER-MANIN OBSTRUCTION ON K3 SURFACES\n\n7\n\nProposition 2.14. The six points on any two parallel lines in Π lie on a conic\nwhose pull-back to X consists of two components.\nProof. It suffices to prove this in the setting of Example 2.12. Let l and m be two\nparallel lines in Π. After translation by an element of Π = C[3] we may assume\nthat O is not contained in l ∪ m. Let P be a point other than O on the linear\nsubspace that l and m are translates of. By Example 2.12, the point P corresponds\nto a root α of F , which factors as F = (u2 − α2 )fα . The point −P corresponds to\n−α and the points in l ∪ m correspond to the roots of fα . These points all lie on\nthe conic given by\n(4)\n\n27t2 − 6α2 rt + (α4 + 18A)r2 + (α6 + 21Aα2 + 81B)s2 = 0.\n\nFrom Example 2.12 we find that the pull back of this conic to X is given by (4)\nand\nα2 u2 = (Ar3 + 9Brs2 + 3rt2 − 6As2 t)2 ,\nwhich indeed contains two components.\n\u0003\nRemark 2.15.\n√ Consider the situation of the proof of Proposition 2.14. Over the\nfield k(α, −3), the polynomial fα splits as the product of two cubics such that\nthe points of l correspond to the roots of one of the two cubics and the points of\nm correspond to the roots of the other.\nRemark 2.16. The fact that the conics of Proposition 2.14 have a reducible pull\nback to X also follows without explicit equations. Set H = τ ∗ L for any line L ⊂ P̆2\nthat does not go through any of the P ∈ Π. For each P ∈ Π, let ΘP ∈ Div Y be\nthe sum of the two (−2)-curves above the singular point on X corresponding to P .\nAs these curves intersect each other once, we find Θ2P = −2, while we also have\nH * ΘP = 0 and H 2 = 2. Any curve Γ ⊂ P̆2 of degree m that goes through P ∈ Π\nwith multiplicity aP pulls back to a curve on X whose strict transformation to Y\nis linearly equivalent with\nX\nD = mH −\naP Θ P .\nP ∈Π\n\n2\n\n2\n\nP\n\na2P .\n\nWe have D = 2m − 2\nFor a conic Γ through six of the points of Π we get\nD2 = −4. Let pa (D) be the arithmetic genus of D. As the canonical divisor KY of\nY is trivial, we find from the adjunction formula 2pa (D) − 2 = D * (D + KY ) (see\n[9], Prop. V.1.5) that pa (D) = −1 is negative, which implies that D is reducible.\nWe can use the same idea to find (−2)-curves on Y . For instance, the strict\ntransformation on Y of any pull back to X of a line through 2 points of Π, or of a\nconic through 5 points of Π will be such a curve.\n3. The geometry of the surface\nIn this section we investigate some geometric properties of X and Y . As our\nmain theorem only concerns characteristic 0, we will for convenience assume that\nthe ground field k equals C throughout this section. Several of the results, however,\nalso hold in positive characteristic, which we will point out at times. We start with\na quick review of lattices.\nA lattice is a free Z-module L of finite rank, endowed with a symmetric, bilinear,\nnondegenerate map L × L → Q, (x, y) 7→ x * y, called the pairing of the lattice.\nAn integral lattice is a lattice with a Z-valued pairing. A lattice L is called even if\n\n\f8\n\nRONALD VAN LUIJK\n\nx * x ∈ 2Z for every x ∈ L. Every even lattice is integral. If L is a lattice and m\na rational number, then L(m) is the lattice obtained from L by scaling its pairing\nby a factor m. A sublattice of a lattice Λ is a submodule L of Λ such that the\ninduced bilinear pairing on L is nondegenerate. The orthogonal complement in Λ\nof a sublattice L of Λ is\nL⊥ = {λ ∈ Λ : λ * x = 0 for all x ∈ L}\n\nA sublattice L of Λ is primitive if Λ/L is torsion-free. The minimal primitive\nsublattice of Λ containing a given sublattice L is (L⊥ )⊥ = (L ⊗ Q) ∩ Λ. The\nGram matrix of a lattice L with respect to a given basis x = (x1 , . . . , xn ) is Ix =\n(hxi , xj i)i,j . The discriminant of L is defined by disc L = det Ix for any basis x of L.\nA unimodular lattice is an integral lattice with disriminant ±1. For any sublattice\nL of finite index in Λ we have disc L = [Λ : L]2 * disc Λ. The dual lattice of a lattice\nL is\nĽ = {x ∈ L ⊗ Q : x * λ ∈ Z for all λ ∈ L}.\nIf L is integral, then L is contained in Ľ with finite index [Ľ : L] = | disc L| and the\nquotient AL = Ľ/L is called the dual-quotient of L. If L is a primitive sublattice\nof a unimodular lattice Λ, then the dual-quotients AL and AL⊥ are isomorphic as\ngroups, and we have | disc L| = | disc L⊥ |. For more details on these dual-quotients\nand the discriminant form defined on them, see [16].\nIf Z is a smooth projective irreducible surface, let Pic0 Z ⊂ Pic Z denote the\ngroup of divisor classes that are algebraically equivalent to 0. The quotient NS(Z) =\nPic Z/ Pic0 Z is called the Néron-Severi group of Z. The exponential map C →\n∗\nC∗ , z 7→ exp(2πiz) induces a short exact sequence 0 → Z → OZ → OZ\n→ 1\nof sheaves on the complex analytic space Zh associated to Z. The induced long\n∗\nexact sequence includes H 1 (Zh , OZ ) → H 1 (Zh , OZ\n) → H 2 (Zh , Z). There is an\n1\n∗ ∼\nisomorphism H (Zh , OZ ) = Pic Z and the image of the first map H 1 (Zh , OZ ) →\n∗\nH 1 (Zh , OZ\n) is exactly Pic0 Z. We conclude that there is an embedding NS(Z) ֒→\nH 2 (Zh , Z). The intersection pairing induces a pairing on NS(Z), which coincides\nwith the cup-product on H 2 (Zh , Z). By abuse of notation we will write H 2 (Z, Z) =\nH 2 (Zh , Z). See [9], App. B.5, for statements and [22] and [2], §IV.2, for more\ndetails.\nProposition 3.1. If Z is a K3 surface, then Pic0 Z = 0 and we have an isomorphism Pic Z ∼\n= NS(Z).\nProof. By definition we have H 1 (Z, OZ ) = 0, so from the above we find Pic0 Z = 0.\nThe isomorphism follows immediately.\n\u0003\nNote that by fixing a point on C, the surface C × C obtains the structure of an\nabelian surface.\nProposition 3.2. Let Z be an abelian surface (resp. K3 surface). Then H(Z, Z)\nis an even lattice with discriminant −1 of rank 6 (resp. 22) in which NS(Z) embeds\nas a primitive sublattice.\nProof. The lattice H(Z, Z) is even by [2], Lemma VIII.3.1. If Z is an abelian\nsurface, then this lattice is unimodular by [2], §V.3, and indefinite by the Hodge\nindex theorem, see [9], Thm. V.1.9. From the classification of even indefinite\nunimodular lattices we find that H(Z, Z) is isomorphic with U 3 , where U is the\n\n\fCUBIC POINTS AND THE BRAUER-MANIN OBSTRUCTION ON K3 SURFACES\n\n9\n\nhyperbolic lattice with discriminant −1, see [21], Thm. V.5. A similar argument\nholds for K3 surfaces, see [2], Prop. VIII.3.3 (VIII.3.2 in first edition). This implies\nthat in both cases the map H 2 (Z, Z) → H 2 (Z, C) is injective, so NS(Z) is the image\nof Pic Z in H 2 (Z, C). By [2], Thm. IV.2.13 (IV.2.12 in first edition), this image is\nthe intersection of H 2 (X, Z) with the C-vectorspace H 1,1 (X, ΩX ) inside H 2 (X, C).\nThis implies the last part of the claim.\n\u0003\nRemark 3.3. From Propositions 3.1 and 3.2 it follows that linear, algebraic, and numerical equivalence all coincide on a complex K3 surface. In positive characteristic\nthis is the case as well, see [4], Thm. 5.\nLemma 3.4. Let Z be an abelian variety or a K3 surface. Let D be a curve on Z\nwith arithmetic genus pa (D). Then we have D2 = 2pa (D) − 2.\nProof. The canonical divisor KZ is trivial for both abelian varieties and K3 surfaces.\nThe adjunction formula therefore gives 2pa (D) − 2 = D * (D + KZ ) = D2 (see [9],\nProp. V.1.5).\n\u0003\nLemma 3.5. Take any point R ∈ C and define the divisors\nD1 = { (P, Q) : P, Q, R collinear },\n\nD2 = C × {R},\n\nD3 = {R} × C\n\non C × C. The automorphism ρ acts on the Di as the permutation (D1 D2 D3 ).\nThe images in NS(C × C) of the Di are independent of the choice of R. We have\nDi * Dj = 1 if i 6= j and Di2 = 0. The elements D1 , D2 , D3 are numerically\nindependent.\nProof. The first statement is obvious. All fibers of the projection of C × C onto\nthe second copy of C are algebraically equivalent to each other, so the image of D2\nin NS(C × C) is independent of R. As D1 and D3 are in the orbit of D2 under ρ,\ntheir images are independent of R as well. The divisors D2 and D3 intersect each\nother transversally in one point, so D2 * D3 = 1. As D2 is isomorphic to C, the\ngenus pa (D2 ) of D2 equals 1, so Lemma 3.4 gives D22 = 0. The other intersection\nnumbers follow by applying ρ. The last statement follows immediately.\n\u0003\nFor any R ∈ C the three divisors Di of Lemma 3.5 all map birationally to the\nsame curve on XC , namely the pull back φ∗ (R̆) of the dual R̆ of R, i.e., the line in\nP̆2 consisting of all lines in P2 going through R.\nFor each P ∈ Π, let LP ⊂ NS(Y ) be the lattice generated by the two (−2)-curves\nabove the singularity on X corresponding to P . Then the lattice\nLL generated by all\nthese (−2)-curves is isomorphic to the orthogonal direct sum P ∈Π LP . For each\nP ∈ Π, the dual-quotient ALP is a 1-dimensional F3 -vectorspace. Let Λ = (L⊥ )⊥\nbe the minimal primitive sublattice of NS(Y ) that contains L. Then L\nΛ is contained\n∼\nin the dual Ľ of L, so Λ/L is a subspace of the dual-quotient AL = P ∈Π ALP .\nLemma 3.6. We can identify each ALP with F3 and give Π the structure of an\nF3 -vectorspace in such a way that\nM\nΛ/L ⊂\nALP ∼\n= FΠ\n3\nP ∈Π\n\nconsists of all affine linear functions Π → F3 .\nProof. See [3], Thm. 2.5. The subspace Λ/L corresponds to L3 as defined on page\n269 of [3].\n\u0003\n\n\f10\n\nRONALD VAN LUIJK\n\nCorollary 3.7. We have [Λ : L] = 27 and disc Λ = 27.\nProof. The first equality follows from Lemma 3.6 and the fact that there are 27\naffine linear functions F23 → F3 . The second equality then follows from the equation\n[Λ : L]2 * disc Λ = disc L = 39 .\n\u0003\nRemark 3.8. Fix a point O ∈ Π. Then C obtains the structure of an elliptic\ncurve and Π corresponds to the group C[3] of 3-torsion elements, which naturally\nhas the structure of an F3 -vectorspace. The 24 nonconstant affine linear functions\nΠ → F3 correspond to the irreducible components of the 12 pull backs of the conics\nof Proposition 2.14.\nLet TC×C and TY denote the othogonal complements of NS(C × C) and NS(Y )\nin H 2 (C × C, Z) and H 2 (Y, Z) respectively. The main result of this section is the\nfollowing.\nProposition 3.9. There is a natural isomorphism TY ∼\n= TC×C (3) of lattices.\nρ\nProof. For convenience write HC×C\n= H 2 (C × C, Z)hρi . From Katsura's table\nρ\nin [11], p. 17, we find rk HC×C = 4 and the remaining eigenvalues of ρ∗ acting\non H 2 (C × C, Z) are ζ and ζ 2 , where ζ is a primitive cube root of unity. Let\nΓ′ ⊂ NS(C × C) denote the sublattice generated by the Di of Proposition 3.5, and\nset D = D1 + D2 + D3 . By Proposition 3.5, D is fixed by ρ. As ρ∗ acts unitarily on\nH 2 (C × C, C), its eigenspaces corresponding to different eigenvalues are orthogonal.\nWe conclude from Proposition 3.5 that the orthogonal complement Γ of hDi inside\nρ\n= Γ⊥ inside\nΓ′ corresponds to the eigenvalues ζ and ζ 2 , which in turn implies HC×C\nρ\n2\nthe unimodular lattice H (C × C, Z), because HC×C corresponds to the eigenvalue\n1. The lattice Γ is generated by D1 − D2 and D2 − D3 and has discriminant 3, so\nρ\nit is primitive and we also have | disc HC×C\n| = | disc Γ| = 3. Set N = Γ′⊥ . Taking\nρ\n′\northogonal complements in Γ ⊂ Γ ⊂ NS(C × C) we find TC×C ⊂ N ⊂ HC×C\n.\n′\nFrom the fact that (Γ /Γ)⊗ Q is generated by D, it follows that N is the orthogonal\nρ\ncomplement of D inside HC×C\n.\nLet HX denote the orthogonal complement of L (or Λ) in the unimodular lattice\nH 2 (Y, Z), so that by Corollary 3.7 we have | disc HX | = | disc Λ| = 27. Recall that\nρ\nπ denotes the quotient map C × C → XC . There are maps π ∗ : HX → HC×C\nand\nρ\n∗\nπ∗ : HC×C → HX such that π and π∗ send transcendental cycles to transcendental\ncycles and\n(i) π ∗ (x) * π ∗ (y) = 3x * y, ∀x, y ∈ HX ,\nρ\n(ii) π∗ (x) * π∗ (y) = 3x * y, ∀x, y ∈ HC×C\n,\n∗\n(iii) π∗ (π (x)) = 3x,\n∀x ∈ HX ,\nρ\n,\n(iv) π ∗ (π∗ (x)) = 3x,\n∀x ∈ HC×C\n\nsee [10], §1, and [3], p. 273. From (iv) and the fact that H 2 (C ×C, Z) is torsion-free,\nρ\nwe find that π∗ is injective. Therefore, by (ii) we have an isomorphism π∗ (HC×C\n)∼\n=\nρ\nHC×C (3) and\nρ\n\nρ\nρ\nρ\n| disc π∗ (HC×C\n)| = | disc HC×C\n(3)| = 3rk HC×C * | disc HC×C\n| = 35 .\n\nFrom\nρ\nρ\n[HX : π∗ (HC×C\n)]2 * | disc HX | = | disc π∗ (HC×C\n)|,\n\nρ\nwe then find [HX : π∗ (HC×C\n)] = 3.\n\n\fCUBIC POINTS AND THE BRAUER-MANIN OBSTRUCTION ON K3 SURFACES\n\n11\n\nRecall that π∗ (D1 ) = π∗ (D2 ) = π∗ (D3 ) = H, where H denotes the class of the\nstrict transformation of the pull back of a line in P̆2 to X. Therefore, π∗ (D) = 3H.\nρ\nρ\nFrom 9 ∤ 6 = D2 we conclude D 6∈ 3HC×C\n, and thus 3H = π∗ (D) 6∈ 3π∗ (HC×C\n),\nρ\nρ\nwhich implies H ∈ HX \\ π∗ (HC×C ). As the index [HX : π∗ (HC×C )] = 3 is prime,\nρ\nit follows that HX /π∗ (HC×C\n) is generated by H, so the orthogonal complement\nρ\nπ∗ (N ) of 3H = π∗ (D) in π∗ (HC×C\n) is primitive in HX . From the primitive inclusion\nπ∗ (TC×C ) ⊂ π∗ (N ) it follows that also π∗ (TC×C ) is primitive in HX , and thus in\nH 2 (Y, Z).\nFrom L ⊂ NS(Y ) we find TY ⊂ HX . From (i)-(iv) and the fact that π∗\nand π ∗ send transcendental elements to transcendental elements, we find 3TY ⊂\nπ∗ (TC×C ) ⊂ TY . This implies rk TY = rk TC×C and together with the fact that\nπ∗ (TC×C ) is primitive in H 2 (Y, Z), it follows that we have TY = π∗ (TC×C ) ∼\n=\nρ\nρ\nTC×C (3), where the last isomorphism follows from π∗ (HC×C\n)∼\n\u0003\n= HC×C (3).\nRemark 3.10. Proposition 3.9 is mentioned without proof in [17], where it is claimed\nthat the proof is exactly the same as in the classical Kummer case, where Y is the\ndesingularization of the quotient X of an abelian surface A by an involution ι.\nIndeed there are many similarities between the proof of the classical case (see for\ninstance [14], Prop. 4.3) and the one just presented, but there are some essential differences. A first difference is that in the classical case ι acts trivially on\nH 2 (A, Z). There is, however, a much more significant difference. In the classical\ncase the lattice π∗ H(A, Z)hιi is easily proved to be primitive in the orthogonal complement HX of the lattice L generated by the 16 exceptional divisors on Y . This\nimmediately implies that π∗ TA is primitive in H 2 (Y, Z). As in our case the index\nρ\n[HX : π∗ HC×C\n] = 3 is not trivial, the classical proof does certainly not directly\napply.\nAs before, let Jac C denote the Jacobian of C and End Jac(C) its endomorphism\nring, which is isomorphic to Z or an order in either an imaginary quadratic field or\na quaternion algebra.\nProposition 3.11. We have rk NS(C × C) = 2 + rk End Jac C.\n\nProof. Note that for a curve D the group Pic0 D is the kernel of the degree map\nPic D → Z, so that we have an isomorphism NS(D) ∼\n= Z. The statement then\nfollows from [24], App., or [1], Thm. 3.11.\n\u0003\nProposition 3.12. With r = rk End Jac C we have\nrk NS(Y ) = 18 + r\n\nand\n\ndisc NS(Y ) = 34−r disc NS(C × C).\n\nProof. From Propositions 3.2 and 3.11 we get rk TC×C = 6 − rk NS(C × C) = 4 − r.\nFrom Propositions 3.2 and 3.9 we then conclude\nrk NS(Y ) = 22 − rk TY = 22 − rk TC×C = 18 + r.\nFrom Proposition 3.9 we also get\ndisc TY = disc TC×C (3) = 3rk TC×C disc TC×C = 34−r disc TC×C .\nFrom Proposition 3.2 we then find\ndisc NS = − disc TY = −34−r disc TC×C = 34−r disc NS(C × C).\n\u0003\n\n\f12\n\nRONALD VAN LUIJK\n\nRemark 3.13. The conclusion rk NS(Y ) = 18 + rk End Jac C of Proposition 3.12\nis much weaker than the statement of Proposition 3.9 as it suffices to work with\ncoefficients in Q or C instead of Z in the cohomology. By working with étale\ncohomology instead, we can deduce the same equation in positive characteristic.\nFor most of the details, see [11], which only gives rk NS(Y ) ≥ 19 ([11], p. 17).\nCorollary 3.14. If C does not admit complex multiplication, then the Néron-Severi\nlattice NS(YC ) has rank 19, discriminant 54, and is generated by the pull back H\nof a line in P̆2 , the irreducible components above the P ∈ Π, and the irreducible\ncomponents of the pull backs of the conics of Proposition 2.14.\nProof. If C does not admit complex multiplication, then End Jac C has rank r = 1\nby definition, so by Proposition 3.12 we have rk NS(YC ) = 19 and 27| disc NS(Y ).\nThe lattice Λ generated by the irreducible components above the P ∈ Π and the\nconics of Proposition 2.14 has rank 18 and discriminant 27 by Corollary 3.7 and\nRemark 3.8. The class H is orthogonal to Λ and satisfies H 2 = 2, so hHi ⊕ Λ has\ndiscriminant 27 * 2 = 54 and rank 19, and thus finite index in NS(Y ). From\ndisc NS(Y ) * [NS(Y ) : hHi ⊕ Λ]2 = dischHi ⊕ Λ = 54,\n\nand the fact that 27| disc NS(Y ), we find that the index equals 1, so NS(Y ) =\nhHi ⊕ Λ.\n\u0003\n4. Diagonal cubics and the proof of the main theorem\nLet C ⊂ P2 be a diagonal cubic, defined over a number field k, given by ax3 +\nby + cz 3 = 0. Let ζ ∈ k denote a primitive cube root of unity. Then J = Jac C is\nan elliptic curve of j-invariant 0, with endomorphism ring End J ∼\n= Z[ζ]. Consider\nthe automorphism ζx : [x : y : z] 7→ [ζx : y : z] of C. The line through a point\nP = [x0 : y0 : z0 ] and ζx P is given by z0 y − y0 z = 0 and also goes through ζx2 P ,\nso the map τ : C × C → P̆2 sends both (P, ζx P ) and (P, ζx2 P ) to [0 : z0 : −y0 ]. It\nfollows that both curves\n3\n\nD4 = { (P, ζx P ) ∈ C × C : P ∈ C }\n\b\nD5 = (P, ζx2 P ) ∈ C × C : P ∈ C\n\nmap under τ to the line Lr in P̆2 given by r = 0. However, the two curves are both\nfixed by ρ, so they map to different curves in XC . Hence, the pull back to XC of\nLr consists of two irreducible components. The same could be concluded from an\nargument similar to that in Remark 2.16. The line Lr goes through three cusps of\nC̆ (see Example 2.13), so the strict\nP transform D on YC of the pull back to XC of\nLr is linearly equivalent to H − P ∈Π∩Lr ΘP , which implies D2 = −4 < −2, so D\nis reducible. Obviously, the same holds for the lines given by s = 0 and t = 0.\nBy Proposition 3.11 we have rk NS(C × C) = 4. The divisors D1 , D2 , D3 of\nProposition 3.5 and D4 from above mutuallly intersect each other exactly once.\nThey are all isomorphic to C, so they have genus 1 and we have Di2 = 0 by Lemma\n3.4. It follows that the Di (1 ≤ i ≤ 4) generate a sublattice V of NS(C × C) of rank\n4 and discriminant −3. As this discriminant is squarefree, we find NS(C × C) = V ,\nand thus disc NS(C × C) = −3. By Proposition 3.12 we conclude disc NS(Y ) = −27\nand rk NS(Y ) = 20. We will now describe the Néron-Severi group more concretely.\nBy Example 2.13, the pull back of the line Lr given by r = 0 to XC ⊂ P(1, 1, 1, 3)\nis given by r = 0 and −3u2 = a2 (bt3 − cs3 )2 . We will denote the two components\n\n\fCUBIC POINTS AND THE BRAUER-MANIN OBSTRUCTION ON K3 SURFACES\n\n13\n\nby Drω , where ω ∈ {ζ, ζ 2 } is such that 1 + 2ω = a(bt3 − cs3 )/u on the corresponding\nP\n2\ncomponent. We have Drζ + Drζ ∼ H − P ∈Π∩Lr ΘP with ΘP as in Remark 2.16.\nSimilarly, Dsω and Dtω denote the irreducible components above s = 0 and t = 0\nwith ω such that 1 + 2ω equals the value along the corresponding component of\nb(cr3 − at3 )/u and c(as3 − br3 )/u respectively.\nChoose elements α, β ∈ k such that α3 = −c/b and β 3 = −a/c, and set γ =\n−α−1 β −1 , so that γ 3 = −b/a. The flexes of C are given by [0 : α : ζ i ], [ζ i : 0 : β],\nand [γ : ζ i : 0], with 0 ≤ i ≤ 2. The corresponding cusps of C̆ are [0 : −ζ i : α],\n[β : 0 : −ζ i ], and [−ζ i : γ : 0] respectively. Let O, P , and Q denote the cusps\n[0 : −1 : α], [0 : −ζ : α], and [β : 0 : −1] respectively. Identifying the cusps of C̆\nwith the flexes of C, the curve C gets the structure of an elliptic curve with origin\nO. The following addition table shows what the other cusps correspond to.\nO\nP\n−P\n\nO\nQ\n−Q\n[0 : −1 : α] [β : 0 : −1] [−1 : γ : 0]\n[0 : −ζ : α] [β : 0 : −ζ] [−ζ : γ : 0]\n[0 : −ζ 2 : α] [β : 0 : −ζ 2 ] [−ζ 2 : γ : 0]\n\nThe curve in P̆2 given by\nr2 + α2 β 2 s2 + β 2 t2 + αβrs − βrt − αβ 2 st = 0\nis one of the conics of Proposition 2.14, going through the points nQ ± P for any\ninteger n. Its pullback to XC ⊂ P(1, 1, 1, 3) is given by the same equation together\nwith α2 u = ±β 2 c2 rst, therefore containing two irreducible components that we\n±\nwill denote according to the sign in the equation by Dα,β\n. By choosing α and β\ndifferently, we get nine out of the twelve conics of Proposition 2.14. The remaining\nthree are the three possible pairs out of the three lines given by rst = 0.\nTake any α′ ∈ {α, ζα, ζ 2 α} and consider the affine coordinates u′ = u/s3 ,\n′\nr = r/s, and t′ = t/s + α′ . By Example 2.13, XC is locally given by u′2 =\n−3a2 b2 α′4 t′2 + (higher order terms), where the point R = [0 : −1 : α′ ] corresponds\nto (0, 0, 0). Therefore, the square of the ratio 3abα′2 t′ /u′ equals −3 on both irreducible components of the exceptional divisor of the blow-up at R. We denote these\nω\n2\n′2 ′\n′\ncomponents by Θω\nr,α′ or ΘR , with ω ∈ {ζ, ζ } such that 1 + 2ω = 3abα t /u =\n2\n\n3abα′2 s2 (t + α′ s)/u on the corresponding component. Note that ΘζR + ΘζR = ΘR ,\nc.f. Remark 2.16. Similarly, for β ′ ∈ {β, ζβ, ζ 2 β} and R = [β ′ : 0 : −1], we\nω\ndenote the irreducible components above R by Θω\ns,β ′ or ΘR , with ω such that\n′2 2\n′\n′\n2\n1 + 2ω = 3bcβ t (r + β t)/u. For γ ∈ {γ, ζγ, ζ γ} and R = [−1 : γ ′ : 0], we denote\nω\nthe irreducible components above R by Θω\nt,γ ′ or ΘR in such a way that we have\n1 + 2ω = 3acγ ′2 r2 (s + γ ′ r)/u on the corresponding component.\n±\nω\nWe will see that the 43 divisors H, Θω\nR , Dv and Dα′ ,β ′ generate the Néron-Severi\ngroup. Their intersection numbers are easily computed from the above and given\nby\nH 2 = 2,\nH * Dvω = 1,\nDα+′ ,β ′ * Dα−′′ ,β ′′ = 0,\n±\nω\nH * ΘR = 0, H * Dα′ ,β ′ = 2, Dvω * Dα±′ ,β ′ = 0,\n\n\f14\n\nRONALD VAN LUIJK\n\nω2\n1\nΘω\nv,δ * Θw,δ ′\n\nω2\nDvω1 * Dw\n\nDαǫ ′ ,β ′ * Dαǫ ′′ ,β ′′\n2\nDvω1 * Θω\nw,δ\n\nDαǫ ′ ,β ′ * Θω\nv,δ\n\n\n −2 if v = w and δ = δ ′ and ω1 = ω2 ,\n1 if v = w and δ = δ ′ and ω1 6= ω2 ,\n=\n\n0 otherwise,\n\n −2 if v = w and ω1 = ω2 ,\n=\n1 if v 6= w and ω1 6= ω2 ,\n\n0 otherwise,\n\n −2 if α′′ = α′ and β ′′ = β ′ ,\n=\n1 if α′′ α′−1 = β ′′ β ′−1 6= 1,\n\n0 otherwise,\n\u001a\n1 if v = w and ω1 = ω2 ,\n=\n0 otherwise,\n\n1 if v = r and α′ /δ = ω ǫ ,\n\n\n\n1 if v = s and β ′ /δ = ω ǫ ,\n=\n1\nif v = t and γ ′ /δ = ω ǫ (γ ′ = −(α′ β ′ )−1 ),\n\n\n\n0 otherwise\n\nfor any R ∈ Π, v, w ∈ {r, s, t}, ω ∈ {ζ, ζ 2 }, ǫ ∈ {+, −}, α′ , α′′ ∈ {α, ζα, ζ 2 α},\nβ ′ , β ′′ ∈ {β, ζβ, ζ 2 β}, δ ∈ {ζ i α, ζ i β, ζ i γ : 0 ≤ i ≤ 2} and ω + = ω and ω − = ω −1 .\nThe names of all the divisors are chosen to optimize symmetry. In particular, under\nthe identification of the multiplicative group μ3 with the additive group F3 , and\nwith the F3 -vectorspace structure on Π coming from the addition on the elliptic\ncurve, the superscripts of the Θω\nR correspond exactly with the choices that need\nto be made in Lemma 3.6. Many of these intersection numbers follow from that\n2\nlemma, but we preferred this concrete distinction between the ΘζR and ΘζR , which\nmore easily reveals the intersection numbers with the Dvω and where the galois\naction on these divisors is given by the action on the superscripts and subscripts.\nProposition 4.1. The Néron-Severi group of Y has rank 20 and discriminant −27.\nIt is generated by the galois-invariant set\no \b\nn\n2\n2\nDrζ , Drζ ∪ Θω\nR : R ∈ Π, ω ∈ {ζ, ζ }\nn\no\n∪ Dα+′ ,β ′ : α′ ∈ {α, ζα, ζ 2 α}, β ′ ∈ {β, ζβ, ζ 2 β} .\nProof. The 29 given divisors generate a lattice Λ of rank 20 and discriminant −27.\nAs we had already seen rk NS(Y ) = 20 and disc NS(Y ) = −27, we conclude Λ =\nNS(Y ).\n\u0003\nProposition 4.2. If abc is not a cube in k, then we have H 1 (k, Pic Y ) = {1}.\nProof. From Proposition 4.1 we know a galois-invariant set of generators for Pic Y .\nLet ρ, σ, τ be the automorphisms of Pic Y induced by acting as follows on the\nsuperscript and subscripts.\nρ : (α, β, ζ) 7→ (ζα, β, ζ),\n\nσ : (α, β, ζ) 7→ (α, ζβ, ζ),\nτ : (α, β, ζ) 7→ (α, β, ζ 2 ).\n\nThe automorphisms ρ and σ commute and the group G = hρ, σ, τ i is isomorphic to\nthe semi-direct product hρ, σi ⋊ hτ i ∼\n= (Z/3Z)2 ⋊ Z/2Z, where τ acts on hρ, σi by\ninversion. The group Pic Y is defined over k(ζ, α, β), so we have H 1 (k, Pic Y ) ∼\n=\n\n\fCUBIC POINTS AND THE BRAUER-MANIN OBSTRUCTION ON K3 SURFACES\n\n15\n\nH 1 (k(ζ, α, β)/k, Pic Y ). The galois group Gal(k(ζ, α, β)/k) injects into G. In for\ninstance magma we can compute H 1 (H, Pic Y ) for every subgroup H of G, see [28].\nIt turns out that if H 1 (H, Pic Y ) is nontrivial, then H is contained in hρσ, τ i. This\nimplies that if H 1 (k(ζ, α, β)/k, Pic Y ) is nontrivial, then Gal(k(ζ, α, β)/k) injects\ninto the group hρσ, τ i, so β/α is fixed by the action of galois and therefore contained\nin k, so abc = (cβ/α)3 is a cube in k.\n\u0003\nProof of Theorem 1.1. By Proposition 2.2 the surface Y is a K3 surface. As its\nPicard number equals 20 by Proposition 4.1, it is in fact a singular K3 surface. By\nCorollary 2.8 we have Y (k) = ∅. By Corollary 2.4 the surface Y has points locally\neverywhere, so Y (Ak ) 6= ∅. By the Hochschild-Serre spectral sequence we have an\nexact sequence Br k → Br1 Y → H 1 (k, Pic Y ), see [25], Cor. 2.3.9. By Proposition\n4.2 we find Br1 Y = im Br k. As Br k never yields a Brauer-Manin obstruction, we\nfind Y (Ak )Br1 Y 6= ∅.\n\u0003\nRemark 4.3. For some fields k the conditions (2) and (3) of Theorem 1.1 imply\ncondition (1). To see this, assume that we have a smooth curve C ⊂ P2k given by\nax3 + by 3 + cz 3 = 0 that satisfies conditions (2) and (3) while abc is a cube in the\nnumber field k, say abc = d3 . For any λ ∈ k we consider e = λ3 b/a. Then the\nlinear transformation [x : y : z] → [x : λ−1 y : λ−2 b−1 dz] sends C isomorphically\nto the curve given by x3 + ey 3 + e2 z 3 , so without loss of generality we will assume\na = 1 and b = e and c = e2 . By picking λ suitably, we may also assume that e is\nintegral. Let p be a place of k. If 3 ∤ vp (e), then C is not locally solvable at p as the\nthree terms of the defining equation have different valuations, so we find 3|vp (e) for\neach place p of k, which means that the ideal (e) is the cube of some ideal I of the\nring Ok of integers of k. Now assume that the class number of k is not a multiple\nof 3. Then from the fact that I 3 is principal we find that I itself is principal, so\ne = uv 3 , for some v ∈ Ok and u ∈ Ok∗ . By rescaling y and z by a factor v and v 2\nrespectively, we may assume v = 1, so that C is given by x3 + ux3 + u2 z 3 = 0. This\nmeans that C is isomorphic to one in a fixed finite set of curves, depending on k,\nnamely those curves given by x3 + wy 3 + w2 z 3 = 0 where w ∈ Ok∗ runs over a set\nof representatives of Ok∗ /(Ok∗ )3 . For some fields k, none of these curves satisfy both\n(2) and (3) so that we have a contradiction. For k = Q for instance, the group\nOk∗ /(Ok∗ )3 is trivial and the curve x3 + y 3 + z 3 = 0 does not satisfy (3) as it contains\nthe point [0 : −1 : √\n1]. For any imaginary quadratic field the same argument holds,\nexcept for k = Q( −3), where Ok∗ /(Ok∗ )3 is generated by a primitive cube root ζ\nof unity. In that case there is one extra isomorphism class represented by the curve\ngiven by x3 + ζy 3 + ζ 2 z 3 = 0, which contains the rational point [1 : 1 : 1]. We\nconclude that if k = Q or k is an imaginary quadratic field whose class number is\nnot a multiple of 3, then conditions (2) and (3) of Theorem 1.1 imply condition (1).\n5. Open problems\nQuestion 1. Is there any (not necessarily diagonal) plane cubic curve over a number field k that has points locally everywhere, but no k-cubic points?\nQuestion 2. Is there any diagonal plane cubic curve over a number field k that\nhas points locally everywhere, but no k-cubic points?\nQuestion 3. Is the Brauer-Manin obstruction the only obstruction to the Hasse\nprinciple on K3 surfaces?\n\n\f16\n\nRONALD VAN LUIJK\n\nReferences\n[1] P. Argentin, Sur certaines surfaces de Kummer, Ph.D. thesis, Université de Genève, 2006.\n[2] W. Barth, K. Hulek, C. Peters, and A. Van de Ven, Compact Complex Surfaces, Second\nEnlarged Edition, Ergebnisse der Mathematik und ihrer Grenzgebiete, 3. Folge, Band 4, A\nSeries of Modern Surveys in mathematics 4, Springer-Verlag, 2004.\n[3] J. Bertin, Réseaux de Kummer et surfaces K3, Invent. Math. 93 (1988), pp. 267–284.\n[4] E. Bombieri and D. Mumford, Enriques' classification of surfaces in char. p, II, Complex\nAnalysis and Algebraic Geometry - Collection of papers dedicated to K. Kodaira, ed. W.L.\nBaily and T. Shioda, Iwanami and Cambridge Univ. Press (1977), pp. 23–42.\n[5] J.-L. Colliot-Thélène, Points rationnels sur les fibrations, Higher dimensional varieties and\nrational points, Proceedings of the 2001 Budapest conference (K. Böröczky, J. Kollár, and\nT. Szamuely, eds.), Springer, 2003, Bolyai Society Colloquium Publications, pp. 171–221.\n[6] A. Grothendieck et al., Théorie des Intersections et Théorème de Riemann-Roch, Lect. Notes\nin Math. 225, Springer-Verlag, Heidelberg, 1971.\n[7] J. Fearnley and H. Kisilevsky, Vanishing and non-vanishing Dirichlet twists of L-functions\nof elliptic curves, Research report, Concordia University, 2004.\n[8] R. Hartshorne, Equivalence relations of algebraic cycles and subvarieties of small codimension, Algebraic Geometry, Arcata 1974, Amer. Math. Soc. Proc. Symp. Pure Math. 29\n(1975), pp. 129–164.\n[9] R. Hartshorne, Algebraic Geometry, GTM 52, Springer, 1977.\n[10] H. Inose, On certain Kummer surfaces which can be realized as non-singular quartic surfaces\nin P3 , J. Fac. Sci. Univ. Tokyo Sect IA Math. 23 (1976), pp. 545–560.\n[11] T. Katsura, Generalized Kummer surfaces and their unirationality in characteristic p, J.\nFac. Sci. Univ. Tokyo Sect IA Math. 34 (1987), pp. 1–41.\n[12] Yu.I. Manin, Le groupe de Brauer-Grothendieck en géométrie diophantienne, in: Actes\nCongrès Int. Math. Nice, 1970, tome I, Gauthier-Villars (1971), pp. 401–411.\n[13] J.S. Milne, Étale Cohomology, Princeton Mathematical Series 33, Princeton University\nPress, New Jersey, 1980.\n[14] D. Morrison, On K3 surfaces with large Picard number, Invent. Math. 75 (1984), pp. 105–\n121.\n[15] T. Mutsasaka, The Criteria for Algebraic Equivalence and the Torsion Group, Am. J. Math.,\nVol. 79, No. 1 (1957), pp. 53–66.\n[16] V. Nikulin, Integral symmetric bilinear forms and some of their applications, Math. USSR\nIzvestija 14, 1 (1980), pp. 103–167.\n[17] H. Önsiper and S. Sertöz, Generalized Shioda-Inose structures on K3 surfaces, Manuscripta\nMath. 98 (1999), pp. 491–495.\n[18] P. Poonen, Heuristics for the Brauer-Manin obstruction for curves, Experimental Math. 15\n(2006), no. 4, pp. 415–420.\n[19] D. Eriksson and V. Scharaschkin, On the Brauer-Manin obstruction for zero-cycles on\ncurves, preprint, available on arXiv:math/0602355.\n[20] E.S. Selmer, The Diophantine equation ax3 + by 3 + cz 3 = 0, Acta Math. 85 (1951), pp.\n203–362.\n[21] J.-P. Serre, A course in Arithmetic, GTM 7, Springer, 1973.\n[22] J.-P. Serre, Géométrie algébrique et géométrie analytique, Annales de l'institut Fourier,\nTome 6 (1956), pp. 1–42.\n[23] J. Silverman, The Arithmetic of Elliptic Curves, GTM 106, Springer, 1986.\n[24] T. Shioda, Algebraic Cycles on Certain K3 Surfaces in Characteristic p, Manifolds-Tokyo\n1973, ed. A. Hattori, Univ. of Tokyo Press (1975), pp. 357–364.\n[25] A. Skorobogatov, Torsors and Rational Points, Cambridge Tracts in Mathematics 144,\nCambridge University Press, 2001.\n[26] J. Tate, Algebraic cycles and poles of zeta functions, Arithmetical Algebraic Geometry, ed.\nO.F.G. Schilling (1965), pp. 93–110.\n[27] R. van Luijk, An elliptic K3 surface associated to Heron triangles, J. of Number Theory\n123 (2007), pp. 92–119.\n[28] Electronic file with magma-code to verify some of the computations in this article, available\nfrom the author upon request.\n\n\fCUBIC POINTS AND THE BRAUER-MANIN OBSTRUCTION ON K3 SURFACES\n\nDept. of Math., Simon Fraser University, Burnaby, BC, Canada, V5A 1S6\nE-mail address: rmluijk@gmail.com\n\n17\n\n\f"}