{"id": "http://arxiv.org/abs/1002.3504v2", "guidislink": true, "updated": "2010-03-18T15:43:34Z", "updated_parsed": [2010, 3, 18, 15, 43, 34, 3, 77, 0], "published": "2010-02-18T12:37:07Z", "published_parsed": [2010, 2, 18, 12, 37, 7, 3, 49, 0], "title": "Non-local fluctuation correlations in active gels", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1002.0266%2C1002.0184%2C1002.0399%2C1002.0891%2C1002.1507%2C1002.0812%2C1002.4248%2C1002.3971%2C1002.4954%2C1002.2851%2C1002.1415%2C1002.2464%2C1002.0013%2C1002.1533%2C1002.4724%2C1002.2638%2C1002.4357%2C1002.0316%2C1002.0332%2C1002.0528%2C1002.3827%2C1002.1007%2C1002.0560%2C1002.3448%2C1002.1663%2C1002.3282%2C1002.0069%2C1002.4822%2C1002.1555%2C1002.0358%2C1002.1074%2C1002.3858%2C1002.1620%2C1002.0434%2C1002.0679%2C1002.2045%2C1002.1952%2C1002.3053%2C1002.3728%2C1002.2400%2C1002.5010%2C1002.2202%2C1002.1447%2C1002.1908%2C1002.3477%2C1002.1242%2C1002.2491%2C1002.0418%2C1002.4463%2C1002.3504%2C1002.4384%2C1002.4311%2C1002.4611%2C1002.0453%2C1002.2840%2C1002.2872%2C1002.0402%2C1002.3352%2C1002.2814%2C1002.1061%2C1002.2606%2C1002.1327%2C1002.0321%2C1002.4863%2C1002.0004%2C1002.2318%2C1002.2817%2C1002.3720%2C1002.0926%2C1002.4420%2C1002.3178%2C1002.0017%2C1002.2704%2C1002.0410%2C1002.3546%2C1002.3339%2C1002.2910%2C1002.1629%2C1002.2123%2C1002.3266%2C1002.1506%2C1002.0728%2C1002.1739%2C1002.5031%2C1002.4792%2C1002.4231%2C1002.3866%2C1002.3969%2C1002.1147%2C1002.2823%2C1002.3706%2C1002.3723%2C1002.0977%2C1002.0228%2C1002.3114%2C1002.4126%2C1002.0990%2C1002.2162%2C1002.3322%2C1002.4377%2C1002.3651&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Non-local fluctuation correlations in active gels"}, "summary": "Many active materials and biological systems are driven far from equilibrium\nby embedded agents that spontaneously generate forces and distort the\nsurrounding material. Probing and characterizing these athermal fluctuations is\nessential for understanding the properties and behaviors of such systems. Here\nwe present a mathematical procedure to estimate the local action of\nforce-generating agents from the observed fluctuating displacement fields. The\nactive agents are modeled as oriented force dipoles or isotropic compression\nfoci, and the matrix on which they act is assumed to be either a compressible\nelastic continuum or a coupled network-solvent system. Correlations at a single\npoint and between points separated by an arbitrary distance are obtained,\ngiving a total of three independent fluctuation modes that can be tested with\nmicrorheology experiments. Since oriented dipoles and isotropic compression\nfoci give different contributions to these fluctuation modes, ratiometric\nanalysis allows us characterize the force generators. We also predict and\nexperimentally find a high-frequency ballistic regime, arising from individual\nforce generating events in the form of the slow build-up of stress followed by\nrapid but finite decay. Finally, we provide a quantitative statistical model to\nestimate the mean filament tension from these athermal fluctuations, which\nleads to stiffening of active networks.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1002.0266%2C1002.0184%2C1002.0399%2C1002.0891%2C1002.1507%2C1002.0812%2C1002.4248%2C1002.3971%2C1002.4954%2C1002.2851%2C1002.1415%2C1002.2464%2C1002.0013%2C1002.1533%2C1002.4724%2C1002.2638%2C1002.4357%2C1002.0316%2C1002.0332%2C1002.0528%2C1002.3827%2C1002.1007%2C1002.0560%2C1002.3448%2C1002.1663%2C1002.3282%2C1002.0069%2C1002.4822%2C1002.1555%2C1002.0358%2C1002.1074%2C1002.3858%2C1002.1620%2C1002.0434%2C1002.0679%2C1002.2045%2C1002.1952%2C1002.3053%2C1002.3728%2C1002.2400%2C1002.5010%2C1002.2202%2C1002.1447%2C1002.1908%2C1002.3477%2C1002.1242%2C1002.2491%2C1002.0418%2C1002.4463%2C1002.3504%2C1002.4384%2C1002.4311%2C1002.4611%2C1002.0453%2C1002.2840%2C1002.2872%2C1002.0402%2C1002.3352%2C1002.2814%2C1002.1061%2C1002.2606%2C1002.1327%2C1002.0321%2C1002.4863%2C1002.0004%2C1002.2318%2C1002.2817%2C1002.3720%2C1002.0926%2C1002.4420%2C1002.3178%2C1002.0017%2C1002.2704%2C1002.0410%2C1002.3546%2C1002.3339%2C1002.2910%2C1002.1629%2C1002.2123%2C1002.3266%2C1002.1506%2C1002.0728%2C1002.1739%2C1002.5031%2C1002.4792%2C1002.4231%2C1002.3866%2C1002.3969%2C1002.1147%2C1002.2823%2C1002.3706%2C1002.3723%2C1002.0977%2C1002.0228%2C1002.3114%2C1002.4126%2C1002.0990%2C1002.2162%2C1002.3322%2C1002.4377%2C1002.3651&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Many active materials and biological systems are driven far from equilibrium\nby embedded agents that spontaneously generate forces and distort the\nsurrounding material. Probing and characterizing these athermal fluctuations is\nessential for understanding the properties and behaviors of such systems. Here\nwe present a mathematical procedure to estimate the local action of\nforce-generating agents from the observed fluctuating displacement fields. The\nactive agents are modeled as oriented force dipoles or isotropic compression\nfoci, and the matrix on which they act is assumed to be either a compressible\nelastic continuum or a coupled network-solvent system. Correlations at a single\npoint and between points separated by an arbitrary distance are obtained,\ngiving a total of three independent fluctuation modes that can be tested with\nmicrorheology experiments. Since oriented dipoles and isotropic compression\nfoci give different contributions to these fluctuation modes, ratiometric\nanalysis allows us characterize the force generators. We also predict and\nexperimentally find a high-frequency ballistic regime, arising from individual\nforce generating events in the form of the slow build-up of stress followed by\nrapid but finite decay. Finally, we provide a quantitative statistical model to\nestimate the mean filament tension from these athermal fluctuations, which\nleads to stiffening of active networks."}, "authors": ["D. A. Head", "D. Mizuno"], "author_detail": {"name": "D. Mizuno"}, "author": "D. Mizuno", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevE.81.041910", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1002.3504v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1002.3504v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "12 pages, 7 figures; some clarifications and ammended figure\n  notation.", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1002.3504v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1002.3504v2", "journal_reference": null, "doi": "10.1103/PhysRevE.81.041910", "fulltext": "Non–local fluctuation correlations in active gels\nD. A. Head1,2 and D. Mizuno3\n1\n\narXiv:1002.3504v2 [cond-mat.mtrl-sci] 18 Mar 2010\n\n2\n\nInstitute of Industrial Science, University of Tokyo, Meguro-ku, Tokyo 153-8505, Japan\nInstitut für Festkörperforschung, Theorie II, Forschungszentrum Jülich 52425, Germany and\n3\nInstitute for the advanced study, Kyushu Univ., 812-8581, Fukuoka, Japan\n(Dated: November 11, 2018)\n\nMany active materials and biological systems are driven far from equilibrium by embedded agents\nthat spontaneously generate forces and distort the surrounding material. Probing and characterizing these athermal fluctuations is essential for understanding the properties and behaviors of such\nsystems. Here we present a mathematical procedure to estimate the local action of force-generating\nagents from the observed fluctuating displacement fields. The active agents are modeled as oriented\nforce dipoles or isotropic compression foci, and the matrix on which they act is assumed to be either a compressible elastic continuum or a coupled network-solvent system. Correlations at a single\npoint and between points separated by an arbitrary distance are obtained, giving a total of three\nindependent fluctuation modes that can be tested with microrheology experiments. Since oriented\ndipoles and isotropic compression foci give different contributions to these fluctuation modes, ratiometric analysis allows us characterize the force generators. We also predict and experimentally\nfind a high-frequency ballistic regime, arising from individual force generating events in the form\nof the slow build-up of stress followed by rapid but finite decay. Finally, we provide a quantitative\nstatistical model to estimate the mean filament tension from these athermal fluctuations, which\nleads to stiffening of active networks.\nPACS numbers: 87.16.Ka, 62.20.D-\n\nI.\n\nINTRODUCTION\n\nLiving organisms are inherently non–equilibrium systems that continually harvest external resources in order\nto maintain their activity and complex hierarchical ordering [1, 2]. Thermodynamic equilibrium is therefore\nexpected to apply, at best, to length and time regimes\nthat are not associated with biological processes. The\ncellular cytoskeleton, a complex assembly composed of\nfilamentous proteins, motor proteins and other accessories which provides a cellular scaffolding [3–7], is a\ncase in point. This dynamic structure hydrolyses energy transfer molecules such as adenosine triphosphate\n(ATP) to promote morphological and mechanical variations, thus regulating many biomechanical processes such\nas organelle transport, muscle contraction, and cell division [4–7]. Since such processes need not obey the statistics of thermodynamic equilibrium [8, 9], novel analytic\ntechniques need to be devised both to predict the viscoelastic response, and to physically describe the active\nentities from experimental data.\nThe violation of thermodynamic equilibrium has been\ndemonstrated in model in vitro cytoskeletons consisting\nof an actin filament network coupled to the motor protein myosin [10], which generates ∼ pN forces upon ATP\nhydrolysis [3, 4]. The material's mechanical viscoelastic response was simultaneously determined by two microrheology protocols, one (passive) that assumes thermodynamic equilibrium and a second (active) that does\nnot [11–16]. Any difference between these two protocols,\nwhich has been observed at low (i.e. biological) frequencies, is attributed to the existence of non–equilibrium\nfluctuations [10, 16, 17]. A departure from Gaussian\nfluctuation statistics has also been observed in active, en-\n\ntangled actin–microtubule mixtures [18]. The existence\nof athermal force generators in various model systems\nhas been shown to spontaneously create non–equilibrium\nflow patterns and structures [19–21], requiring novel analytical techniques to understand their collective behavior\n[22–28]. Introducing permanent crosslinkers such as biotin/avidin complexes into in vitro cytoskeletal systems\nblocks filament flow and reduces complexity to that of\nfluctuations in a static medium. This allows for a physical characterization of the athermal fluctuations, leading\nthe way to a fundamental understanding of their biological implications.\nHere we derive the spatial and temporal correlations\nin the fluctuating displacement field generated by a population of athermal force generators, or 'firers', dispersed\nin a linear viscoelastic material, in a form that can be directly compared to microrheology data. Firers are modeled as force dipoles, generating stress and strain fields\nthat propagate long distances as dictated by material response. As a consequence the correlations induced by\nmotor activity are non–local; that is, a single motor activation generates correlated motion in distant parts of the\nmedium. For the surrounding environment, we consider\ntwo material types, (i) a single–component elastic continuum, and (ii) a two–component system consisting of a\nsparse elastic network that is frictionally coupled to an interspersed, incompressible solvent, known as the '2–fluid\nmodel' [12, 29–32]. The latter is closer in spirit to the\ncellular cytoskeleton, but as our calculations will show,\nthe consequence of the explicit solvent–network description to predicted microrheology data is negligibly small\nin most cases. Thus the single–component model should\napproximately apply to systems of interest, as has been\nalready assumed in prior microrheology studies. Since we\n\n\f2\nexpect a critical role of strong local compression induced\nby molecular force dipoles on the mechanics of networks,\nwe do not assume material incompressibility, in contrast\nto previous approaches [8, 9]. Macroscopic isotropy and\nhomogeneity, relevant to in vitro experiments, are assumed throughout [33–36].\nFor both classes of material, we derive exact expressions for the displacement power spectrum Cij (ω), which\nis the magnitude of displacement fluctuations hu2 i expressed as a function of frequency ω, and the two–point\nspectrum Dij (R, ω) that quantifies correlations in displacements between points separated by a vector distance R. These quantities can be directly compared to\ndata from 1 and 2–point microrheology experiments, respectively. We find 3 sources of variation with frequency:\n(i) The power spectrum of the forces generated by individual firers. For an actin–myosin system, in which\nthe contractile motor stresses build up gradually but are\nrapidly released, the power spectrum is expected to take\nthe form ∼ ω −2 , as has been observed [17, 18, 37, 38]. In\nreality the time required to release the developed compression is short but finite, so to probe this effect we\nsolve a simple model with a controllable release time, and\npredict a crossover to a high–frequency ballistic regime\n∼ ω −4 . Experimental data confirming the existence of\nthis ballistic regime is also provided. (ii) The frequency\ndependence of the mechanical response (shear modulus μ(ω)) of the matrix. The linear mechanical response\nof an actin gel has been studied intensively and is now\nrelatively well understood as a network of semi–flexible\npolymers [39–44], at least for affine deformation [45–52]\nand negligible contribution from crosslinkers or other accessory proteins [53–55]. (iii) When the material is assumed to obey the 2–fluid model, a third source of variation comes from the frictional coupling between the network and solvent, which becomes tighter at higher frequencies and suppresses compressional/longitudinal response modes. For parameters relevant to actin–myosin\nsystems, our calculations indicate that this contribution\nis expected to be small.\nAn example of the correlation functions for the 2–fluid\nmodel from our calculations is given in Fig. 1, where we\nhave projected out the parallel Dk (R) and perpendicular D⊥ (R) components of Dij (R) in the usual way, as\nDij (R) = Dk (R)R̂i R̂j + D⊥ (R)(δij − R̂i R̂j ) with δij the\nKrönecker delta, R = |R| and R̂ = R/R. These calculations are based on the assumption of a population of\nrandomly distributed and oriented, independently–firing\nactive agents modeled as force dipoles. The inset shows\nthe spatial variation of Dij (R) with R (as R−1 ) which is\nconsistent with experiments and specific to force dipoles;\nhigher–order multipoles give different power laws, as explained in Sec. III C below. The scaling with R does not\ndetermine the symmetry of the underlying force dipole,\nand we identify two cases of relevance to actin–myosin\nsystems, namely an oriented force dipole consisting of two\nnearby placed equal–and–opposite forces, corresponding\nto a single myosin minifilament attached to the actin net-\n\nwork, and an isotropic compression center corresponding\nto the orientational average of the first class. This latter case is expected to arise due to fluctuations in the\nlocal concentration of motor protein, or filament rupture\nleading to local network compression. Below we derive\nCij and Dij for both classes of dipole, explicitly confirming Dij ∼ 1/R but revealing qualitatively different low–\nfrequency behavior for the parallel correlations Dk (R),\nwhich approaches 2D⊥ (R) for oriented dipoles in the incompressible limit, but entirely vanishes for compression\ncenters. Hence, by investigating the length–scale dependence of each athermal fluctuation mode or by comparing\nthe amplitude of different independent modes, it is now\npossible to identify the class of firer in a system of unknown composition, and further test the validity of the\ntheoretical modeling or fine–tune the model to specific\nexperimental systems.\nBefore proceeding, it should be noted that active gels\nare not the only situation where internally–generated\nforce impulses are of relevance. Soft glasses and colloidal gels relaxing towards their equilibrium state exhibit local spontaneous rearrangement events or micro–\ncollapses [56–58], generating dipolar force perturbations\nmuch as in active gels. Elastic propagation of stress from\nlocal irreversible rearrangements is the essence of various\nphysical descriptions of glassy systems (see [59–62] and\nreferences therein), which are also typically modeled as\na consequence of creation and annihilation of local force\ndipoles. The results obtained in this study thus apply\nto a broader range of non-equilibrium systems than suggested by the primary, biophysical motivation.\nThis paper is arranged as follows. In Sec. II we define both oriented force dipoles and isotropic compression centers in terms of a frequency–dependent dipole\nmoment κ(ω). We show that a simple model with slow\nstress build–up followed by a rapid but finite–duration\nrelease exhibits a high–frequency ballistic regime in its\npower spectrum, |κ(ω)|2 ∼ ω −4 . Microrheology data\nconsistent with this prediction is also given. The correlation functions of the athermal fluctuating displacements fields are derived in Sec. III. We first define the\nmechanical response of 2 types of materials, single– and\ntwo–component, in Sec. III A, and then derive Cij (ω)\nand Dij (R, ω) for oriented force dipoles for both materials in Sec. III B and Sec. III C respectively. In Sec. III D\nthe same quantities are derived for isotropic compression\ncenters. Finally in Sec. IV we estimate the mean network\ntension from the magnitude of athermal fluctuations in\nan active gel.\n\nII.\n\nINDIVIDUAL FIRERS\n\nAn active agent or 'firer' here refers to any local construct embedded within a continuum body that is capable of spontaneously generating mechanical stress. For\nexample, in an actin–myosin system each firer is a bipolar minifilament of O(10) myosin motors that consumes\n\n\f3\n-2\n\n10\n\nC\npar\nD\nperp\nD\n\n-4\n\nn̂\n\n-2\n\nf\n\n-6\n\n10\n\n✲ ✉\n✛\n\n10\n\n-10\n\n10\n\n❅\n!\n❅\n!\n\n✲\n✉✛ f\n✲\n\nε\n\n-8\n\nD(ω) / D0\n\nC(ω) / C0, D(ω) / D0\n\n10\n\n-6\n\n10\n\n!\n❄!\n✠\n1 ✛\n\n✒\n!\n\n■\n✻❅\n\n!\n\n(a)\n\n-7\n\n10\n\n10 R(μm) 102\n\n10\n\n0.01\n\n❅\n❘\n✲\n\n❅\n\n-1\n\n1\n\n-12\n\n❅\n\n0.1\n\n1\n\n10\n\n100\n\n-1\n\nω (s )\n\nFIG. 1: Example of the one–point and two–point correlation functions Cij (ω) and Dij (R, ω), resp., from the analytical expressions (10) and (13) for the two–fluid model. The\ninset shows Dij (ω = 1s−1 ) for different separations R. Following [38], the network shear modulus is μ(ω) = μ0 (1 +\n[−iω/ω0 ]3/4 ) with ω0 = 10 s−1 . For the dipole moment power\nspectrum |κ(ω)|2 , we used the finite–release model (3) with\nτ = 100s and α = 10−3 . Other parameters are ν = 0.3 and\nΓ = 1011 kg m−3 s−1 corresponding to a mesh size ξ ≈ 100nm\nand solvent viscosity η ≈ 10−3 Pa s. The normalization factors are C0 = c̄κ20 /μ20 a and D0 = c̄κ20 /μ20 R with κ20 = 2τ hκi2 .\n\nthe local supply of ATP upon activation [20, 63, 64].\nWe consider only the linear response, and leave non–\nlinear considerations to future work (such as the mixed\nresponse mode introduced in [16]). The active forces can\nthen be written as a multipole expansion of the form\n∼ f εn ∇n δ(r), where ε, f are microscopic length and\nforce scales, resp., and n = 1, 2 . . . corresponds to dipoles,\nquadrupoles etc. The monopole term n = 0 vanishes for\na stable network as the total force must balance, but\nthere is no a priori reason to neglect higher terms. Thus\nfirers are here taken as dipolar to leading order, and we\nshall later confirm that experiments are in line with this\nassumption.\nA single firer in an active gel at the position x is modeled as a pair of equal–and–opposite forces ±f n̂ located\nat x∓ 2ε n̂, respectively, where n̂ is the firer orientation, as\nshown in Fig. 2(a). For simplicity we take the limit ε → 0\nand f → ∞ with a fixed dipole moment κ = εf . This\nreduces each firer to a point force dipole of zero spatial\nextent, which is a valid approximation when addressing\nquantities that vary on length scales much larger than\nthe size of the firer (as in the typical microrheology situation). The force density due to a single point dipole\nis\nf ani (r, t) = κ(t)n̂(n̂ * ∇)δ(r − x)\n\n(1)\n\nwhere the suffix 'ani' differentiates these dipoles, with\norientation n̂, from the isotropic compression centers defined below. The time–dependent strength of the dipole\n\n(b)\n\nFIG. 2: (a) A single contractile force dipole of size ε,\nforce f and orientation n̂. (b) Schematic representation of\nan isotropic compression center as the orientational average\nof (a).\n\nmoment κ(t), which as defined is positive for contractile\nfirers and negative for expansive ones, denotes a train of\nactivation events, including the possibility of 'dead–time'\nbetween pulses with κ ≡ 0\nAs mentioned in the introduction, we also consider\nisotropic compression centers as in Fig. 2(b), applicable when local clusters of coupled firers activate near–\nsimultaneously or when independent firers are locally aggregated. Formally these are the average of (1) over the\norientation vector n̂,\nf iso (r, t) =\n\n1\nκ(t)∇δ(r − x)\n3\n\n(2)\n\nwhere we have used the identity n̂i n̂j → 31 δij under averaging. Such isotropic force dipoles or dilation/compression centers have been studied in a number\nof contexts [65, 66].\nA.\n\nPower spectrum for a single firer\n\nThe temporal dependence of the dipole moment κ(t)\ncan by itself significantly contribute to the system's fluctuation spectrum. It is experimentally observed that\nstrains induced by myosin minifilaments slowly build up\nover time scales that in some cases extend up to ∼1-\n10 s, and then rapidly release [10], allowing the internally\ngenerated tension to relax to an unstrained state. This\nrapid release generates a pseudo–diffusive power spectrum ∼ ω −2 for frequencies larger than the inverse characteristic build–up time, despite the lack of any diffusing\nfield [37, 38]. At frequencies far below this time, a plateau\n∼ ω 0 is expected. However, although rapid, the time for\nstress release is nonetheless finite. As already discussed\nin [10], stress build–up is accompanied by significant local network compression deriving from the non–linear response of actin filaments. In order to relax, it is therefore\nnecessary for the network to dilate, the rate of which is\nlimited by the inflow of solvent. A relaxation time of\n∼ 0.1 s was estimated by balancing frictional and elastic\n\n\f4\n\nu\n\n✻\nrelease rate τ −1\n\n✟✟❊\n✟\n✟\n❊\n✟\n✟\n❊ −κ̇R\n❊\n❊\n✟✟❊\n✟\n✟\n❊\n✟\n❊ ✟✟\n✟\n❊✟\n❊✟\n✲t\nκ̇G\n\nκ0\n\nFIG. 3: Notation for the finite–release model. The dipole\nmoment κ increases linearly at a rate κ̇G , initiates release at\na rate τ −1 after which it decreases linearly at a rate −κ̇R until\nreaching zero when the cycle restarts.\n\nforces during relaxation, and found to be consistent with\nexperimental observation [10]. To quantify the effect of\na finite release time on the power spectrum, we consider\nhere a simple model in which the dipole moment of a single firer κ(t) slowly increases in time before stochastically\nreleasing stress as shown in Fig. 3. The model is defined\nby 3 parameters: The rate of increase of the moment κ\nin the growth phase, κ̇G > 0; the corresponding rate in\nthe release phase, −κ̇R < 0, and the release rate τ −1 at\nwhich growth switches to release. Note that κ always\nreturns to zero before growth restarts, so it is bounded\nand does not diffuse. The steady state solution is found\nfollowing the procedure described in Appendix A. The\nresulting power spectrum |κ(ω)|2 due to this single firer\nis\n|κ(ω)|2 =\n\n2τ hκi2\n1−α\n\n\u001a\n\n1\nα2\n−\n1 + ω2τ 2\n1 + α2 ω 2 τ 2\n\n\u001b\n\n(3)\n\nwhere α = κ̇G /κ̇R < 1 is the ratio of growth to release\nrates, and hκi = τ κ̇G is the mean moment in steady\nstate. This expression admits 3 regimes: (i) A low frequency plateau |κ(ω)|2 ∼ ω 0 for ω ≪ τ −1 ; (ii) An intermediate pseudo–diffusive regime |κ(ω)|2 ∼ ω −2 for\nτ −1 ≪ ω ≪ (ατ )−1 , where the upper crossover frequency\nis the inverse mean release time; and (iii) A high frequency ballistic regime |κ(ω)|2 ∼ ω −4 for ω ≫ (ατ )−1 .\nIn the rapid release limit α → 0, the ballistic regime vanishes and the pseudo–diffusive regime extends to all high\nfrequencies, as expected. An example for α = 1/100 is\ngiven in Fig. 4.\nFor an actin–myosin system, the ballistic regime should\nbe clearly resolved for frequencies greater than ∼10 Hz\nusing the estimated release time ∼ 0.1 s discussed above.\nThis is around the frequency where thermal fluctuations\nstart to dominate [10, 16], so achieving a satisfactory\nsignal–to–noise ratio is already challenging. Furthermore this frequency is above the elastic plateau for typical network densities, so the ballistic spectrum may be\nobscured by additional frequency variation coming from\n\nFIG. 4: The thick line gives the power spectrum |κ(ω)|2 of a\nsingle dipole according to (3), with α = κ̇G /κ̇R = 1/100, so\nthe mean release time is 1% of the growth time. The straight\ndashed lines have given slopes and both axes have been made\ndimensionless by suitable normalization.\n\nthe network viscoelasticity. For highly crosslinked networks, however, thermal noise is suppressed and the elastic plateau extends to higher frequencies [43], so the contribution of the fluctuation of firers, |κ(ω)|2 , should dominate the frequency dependence of the experimentally–\nmeasured displacement power spectrum, even at high frequencies.\nExperimental confirmation of the ballistic ω −4 regime\nis presented in Fig. 5, where the athermal component\nof the power spectral density (PSD) of both loosely and\ntightly crosslinked networks are given, as measured using the same microrheology protocol as detailed in [16].\nAlso shown are absolute shear moduli |G| of both networks over the same frequency range, confirming that the\ntightly crosslinked network is still in its elastic plateau\nup to frequencies of ∼ 100Hz. Thus the downturn in\nthe PSD is not due to the network response. It is however consistent with the ∼ ω −4 ballistic regime predicted\nabove, and we conclude this is its origin. Note that while\nthere is evidence of a ∼ ω 0 regime at low frequencies for\nthe sparsely crosslinked network, the data here is also\nconsistent with a weak frequency variation, possibly due\nto the very slow, irreversible changes in network structure\nin response to strong force generations.\n\nIII.\n\nATHERMAL FLUCTUATION\nCORRELATIONS\n\nIn this section, correlations in the fluctuations of the\ndisplacement field generated by a population of many\nfirers are derived, for two classes of material. The starting\npoint for the calculations is the displacement field around\na single active firer, which will here be denoted by the\nmaterial–dependent propagator P(x, t; n̂) that gives the\n\n\f5\n\nDisplacement PSD (m2s)\n\n10-15\n0\n\n10-16\n10\n\n-17\n\n10\n\n-18\n\n0 = μ∇2 u + (μ + λ)∇(∇ * u) + Γ(v − ∂t u) + f ext\n0 = η∇2 v − ∇P − Γ(v − ∂t u)\n(5)\n\n-2\n\nwith μ, λ the elastic Lamé coefficients and η the solvent\nviscosity. The pressure gradient ∇P imposes ∇ * v = 0\nand the external force f ext describes all active force generators. The frictional coupling coefficient Γ is estimated\nto be ∼ η/ξ 2 with ξ the network mesh size [12]. The\nsolution is found by transforming to Fourier space, i.e.\n\n10-19\n10\n\n-20\n\n-4\n\n10-21\n\n|G| (Pa)\n\n100\n10\n1\n0.1\n\n1\n\n10\n\nc(q, ω; n̂) =\n\n100\n\nFrequency (Hz)\n\nFIG. 5: (Color online) The upper panel shows the athermal component of the displacement power spectral density\nfor loosely (filled squares) and a tightly (open triangles)\ncrosslinked networks obtained from microrheology [16]. The\nstraight lines have the given slopes. The lower panel shows\nthe absolute shear moduli |G(ω)| for the same networks,\ndemonstrating plateau response and confirming the observed\nfrequency–dependence in the power spectrum is not due to\nnetwork viscoelasticity.\n\ndisplacement at a point x and time t due to the activity\nof a firer at x = 0 and an earlier time t = 0. The total\ndisplacement u at a point r and time t can then be found\nby linear superposition of all active firers,\nu(r, t) =\n\ndx\n\nZ\n\nds\n\nZ\n\ndn̂ P(r − x, t − s; n̂)c(x, s; n̂) (4)\n\nwhere c(x, s; n̂) describes the number of firers per unit\nvolume of orientation n̂ at time s. We assume activity\nis statistically uniform and uncorrelated in both space\nand time, with a mean firing rate per unit volume (of\nany orientation) denoted c̄. Note that in an actin-myosin\nsystem, c refers to myosin mini–filaments and not simply\nthe concentration of myosin.\nA.\n\nMechanics of materials\n\nTo proceed it is necessary to specify P(x, t; n̂) by describing the mechanical response of the material. Two\nmaterials are considered here, both represented on the\ncontinuum level under the assumption that the quantities of interest vary on lengths larger than the coarse–\ngraining length of the network. First we consider the\ntwo–fluid model that has already been used to calculate the viscoelastic response of filament networks in solution [12, 37, 38]. In brief, the system is modeled as\na coupled two–component system, consisting of a fixed\nisotropic elastic network interacting via local friction with\nan incompressible fluid. The network displacement u and\nsolvent velocity v obey\n\ndx\n\nZ\n\ndt ei(ωt−q*x) c(x, t; n̂)\n\n(6)\n\nand projecting the transformed u and v into components\nperpendicular and parallel to q̂, solvent incompressibility\nrequiring that the latter vanishes for v. The transformed\npropagator P(q, ω) can be written in terms of the projected components of a single firer f act (q, ω) as\n\nP(q, ω) =\n\n[f act * q̂]q̂\nf act − [f act * q̂]q̂\n+\nB(ω)q 2 − iωΓ\nq 2 G(ω)\n\n(7)\n\nwhere B = 2μ + λ and G = μ − iωη is the total shear\nmodulus. The force f act (q, ω) is the transform of either\nthe oriented dipole (1), or the isotropic compression (2),\n\nf\nZ\n\nZ\n\nact\n\n(q, ω) =\n\n\u001a\n\niκ(ω)q[q̂ * n̂]n̂ : oriented\n1\n: isotropic\n3 iκ(ω)q\n\n(8)\n\nThe expression (7) is valid for Γ ≫ ηq 2 , i.e. q ≪ ξ −1 ,\nwhich is anyway necessary to justify the use of the continuum equations [38]. The Poisson ratio ν = λ/[2(μ + λ)]\ncan be estimated by assuming an affine network deformation, giving the frequency–independent value ν = 1/4, as\nexplained in Appendix B.\nThe second material considered here is a classical elastic body. Formally this corresponds to the Γ ≡ 0 limit\nin (5), but allows the calculations to be carried out in real\n(rather than Fourier) space, which makes a small difference to the calculation for single point fluctuations as explained below. These calculations start from the known\nresult for the displacement field due to a force monopole,\nfrom which the dipole field is found and the displacement correlations calculated by integrating the products\nof displacements. Details are given in Appendix C.\n\nB.\n\nSingle–point athermal fluctuations\n\nFluctuations in the network strain field can either be\nmeasured at the same point, or at points separated by a\nfinite distance, corresponding to 1 and 2–point microrheology, respectively. While fluctuations in active materials have both a thermal and an athermal origin, they\n\n\f6\nmay often be treated as independent and extracted separately as described in [10]. We calculate here the athermal contributions to these quantities deriving solely from\nfirers, beginning with the 1–particle correlation function\nCij (t) = hui (0, 0)uj (0, t)i, where the angled brackets\ndenote averaging over space, time and dipole orientations n̂ (isotropic compression centers are considered in\nSec. III D). By making use of (4) and assuming uncorrelated, uniform firers, Cij (t) can be rewritten in frequency\nspace as\n\nCij (ω) =\n\nc̄\nδij\n24π 3\n\n\u001cZ\n\ndq |P(q, ω)|\n\n2\n\n\u001d\n\n(9)\n\nn̂\n\nwhere h* * * in̂ denotes averaging over orientation n̂ only.\nFor the propagators (7) and (8), there is a short–\nwavelength divergence in (9) at high q resulting from the\nslow decay of P, P 2 ∼ q −2 . The physical origin of this\nsingularity is the diverging magnitude of displacements\ninduced at positions arbitrarily close to an active firer.\nRecall however that the expression for P in (7) corresponds to point dipoles; for real finite–size dipoles, P will\nbecome strongly attenuated at length scales corresponding to the dipole size and this divergence will be avoided.\nIn microrheology, a further small distance cut-off appears\nfrom the finite radius a of the probe particle, which excludes dipoles from a range a of the origin. We focus on\nthis form of cut–off and introduce a maximum magnitude\nfor the wave vector, q max = π/2a [12], and perform the\nintegration in (9) using P defined by the oriented dipole\nin (8), giving\n\u001a\n\u001b\n1\n2\n1\n2\nCij (ω) =\n+\nψ (2a/πl)\nc̄κ δij\n60πa\n3|G|2\n|B|2\n\u0014\n\u001a\n\u0015\u001b\n√\n1\n1\n√\nψ(z) = 1 −\nR Bz −i arctan\nR(B)\nz −i\n(10)\np\nbelow, R() dewhere the length l = B/ωΓ is discussed√\nnotes the real part and the same root of −i should be\nchosen for both occurrences. Note that κ2 = |κ(ω)|2 is\nthe power spectrum for a single firer, and there is implicit\nfrequency dependence in both B(ω) and G(ω). A representative example of Cij (ω) for an actin–myosin system\nis given in Fig. 1. The corresponding result from the\nreal–space elasticity calculations is\n\nel\nCij\n=\n\n3 − 7ν + 5ν 2 c̄κ2 1\nδij\n(1 − ν)2 180πμ2 a\n\n(11)\n\nNote that this differs slightly from the low–frequency\n2 3 −7ν+5ν 2 c̄κ2 1\nlimit of (10), Cij (ω = 0) = 4 (1−ν)2 180πμ\n2 a δij , by the\nconstant coefficient in the numerator polynomial, which\nis attributable to the different manner of handling the\nshort wavelength cut–off in real and Fourier space [31].\n\nFIG. 6: Schematic representation of the effects of the coupling between the network and the solvent on the 1–particle\nresponse function Cij (t) = hui (0, 0)uj (0, t)i. The crossover\nbetween the coupled response at large lengths (light grey) and\nthe decoupled response at short lengths (dark grey)pis given\nby the frequency–dependent penetration length l = B/ωΓ,\nand the dominant response determined by the ratio of l to\nthe probe radius a. (a) For low frequencies, l/a ≫ 1 and Cij\nis dominated by decoupled network and solvent responses.\n(b) For high frequencies, l ≪ a and Cij is now dominated by\nthe coupled network–solvent response.\n\nEquation (10) is composed of shear/transverse modes\n∝ |G|−2 , and compressional/longitudinal modes ∝ |B|−2 .\nThe contribution from transverse modes is independent\nof the network–solvent coupling, which is entirely contained in the longitudinal contribution. The magnitude\nof this term depends on the ratio of the cut–off radius\np a to\nthe frequency–dependent penetration length l = B/ωΓ,\nwhich determines the range of the longitudinal network\nmodes [38]. Two different coupling regimes occur in the\nlimits a ≪ l and a ≫ l, as schematically shown in Fig. 6.\nFor low frequencies such that a ≪ l, the network is fully\ndecoupled from the solvent and ψ(z) ≈ 1. In this limit\nthe longitudinal response is dominated by the elastic network. In the opposite limit a ≫ l, network and solvent\nare fully coupled and now ψ(z) ≈ |B|2 π 4 /(80ω 2 Γ2 a4 ).\nThis term therefore decays as ∼ ω −2 at high frequencies,\nso the longitudinal response vanishes and only the shear\ncontributions remain.\nC.\n\nTwo–point athermal correlations\n\nSpatial correlations of athermal fluctuations are\nencoded in the 2–particle function Dij (R, t) =\nhui (0, 0)uj (R, t)i, which quantifies correlated motion\nover a vector distance R. Using (4) and again assuming\nspatio–temporally uniform activity, this can be rewritten\nin reciprocal space as\nDij (q, ω) = c̄ hPi (q, ω; n̂)Pj (−q, −ω; n̂)in̂\n\n(12)\n\nThis can be evaluated following the procedure outlined in Appendix D.\nIn terms of the projections parallel and perpendicular to the line of\n\n\f7\ncenters R, Dij (R) = Dk (R)R̂i R̂j + D⊥ (R)(δij − R̂i R̂j )\nwith R = |R|, we find\n\u001b\n1\n3 k\nc̄κ2\nk\n+\nψ (R/l)\nD (R, ω) =\n60πR\n|G|2\n|B|2\n\u001a\n\u001b\nc̄κ2\n1\n3 ⊥\nD⊥ (R, ω) =\n+\nψ\n(R/l)\n(13)\n120πR\n|G|2\n|B|2\n√\n√\n−z −i\n−i)e\n)]/z 2 }/R(B)\nwhere ψ ⊥ (z) = R{2iB[1−(1+z\n√\nk\n−z −i\n⊥\nand ψ (z) = R{Be √ }/R(B)− ψ (z), and the root is\nchosen such that R(z −i) > 0. See Fig. 1 for an example\nrelevant for actin–myosin systems. For comparison, the\nreal–space calculations give\n\ncoupled\n\nc̄κ2 1\n60πμ2 R\n16ν 2 − 20ν + 7 c̄κ2 1\nel\nD⊥\n(R) =\n(1 − ν)2\n480πμ2 R\n\n-ve\n\n+ve\n\ndecoupled\nR\n\n\u001a\n\nDkel (R) =\n\n+ve\n\nl\n\n(a)\n\nl\n\n(b)\n\nFIG. 7: Same as Fig. 6 but for the 2–particle correlation\nfunction Dij (R, t) = hui (0, 0)uj (R, t)i. The crossover between the decoupled (a) and coupled (b) regimes is determined by the inter–particle spacing R relative to the penetration length l. Also shown in (b) are the regions responsible\nfor negative and positive correlations to Dk,iso (R, ω) when\nthe firers are isotropic compression centers, as discussed in\nSec. III D.\n\n(14)\n\nwhich is exactly the zero–frequency limit of (13).\nDij admits a similar scaling form as for Cij , but with\nthe inter–particle spacing R instead of the probe radius a,\nDij ∼ c̄κ2 /μ2 R. As for Cij , the coupling factors ψ k , ψ ⊥\nexhibit different high and low frequency behaviors, but\nnow the crossover frequency is determined by the ratio\nR/l instead of a/l, as schematically shown in Fig. 7. The\ndecoupled limit arises at low frequencies such that l ≫ R,\nwhen ψ ⊥ (z) → 1 and ψ k → 0. Conversely in the fully\ncoupled limit l ≪ R, both ψ ⊥ and ψ k vanish. Note that\nψ k , ψ ⊥ are closely related to the response functions χk ,\nχ⊥ derived in [37, 38].\nDespite the dependence of Dij on R through the coupling functions ψ ⊥,k (R/l), only the overall scaling 1/R\nhas been observed experimentally [8, 16]. The reason is simply that, for typical actin–myosin parameters, this additional source of variation is weak over the\nranges of R typically probed, as confirmed in the inset\nof Fig. 1. The overall scaling R−1 is a direct consequence of the dipolar nature of the active agents. Dimensional analysis suggests higher–order force multipoles\nwill obey higher powers of R, i.e. for quadrupoles of the\nform f (r) ∼ κQ ∇2 δ(r) with κQ the quadrupole moment,\nDij ∝ c̄κ2Q /μ2 R3 is expected (see Appendix D). Therefore the experimental Dij ∼ 1/R [8, 16] provides independent confirmation that activated myosin mini–filaments\ndo indeed act as force dipoles to leading order.\nIn the high frequency regime, or for an incompressible\nnetwork with ν = 1/2 for which B diverges, the coupling\nterms in (13) vanish and Dk = 2D⊥ . The same ratio between parallel and perpendicular correlations also holds\nfor thermal fluctuations in incompressible, passive media [12]. Although one might hypothesize the existence\nof universality here, contrary evidence can be obtained\nby repeating the calculations for the force quadrupoles\nmentioned above. As described in Appendix D, in this\ncase we expect Dk = −2D⊥ , so the ratio between Dk\n\nand D⊥ in athermal fluctuation is not solely determined\nby a material's mechanical properties. In particular, by\nmixing a population of dipoles and quadrupoles of suitable moments it is hypothetically possible to generate a\ncontinuous range of ratios.\n\nD.\n\nIsotropic compression centers\n\niso\nFor the isotropic compression centers given by (2), Cij\niso\nand Dij can be found by following the same procedure as\nabove, with the propagator Piso (q, ω) in (7) now defined\nin terms of the isotropic force dipole from (8). Repeating\nthe calculations gives\n\nc̄κ2\nδij ψ(2a/πl)\n108πa|B|2\nc̄κ2\nDkiso (ω) =\nψ k (R/l)\n36πR|B|2\nc̄κ2\niso\nψ ⊥ (R/l)\nD⊥\n(ω) =\n72πR|B|2\niso\nCij\n(ω) =\n\n(15)\n\n(16)\n\nwhere the coupling functions ψ are the same as before. Note that the shear terms have now vanished,\nand thus the variation in frequency due to coupling is\nfar broader than before, suggesting a system of isotropic\ndipoles would present a stronger test for the prediction\nof the two–fluid model than the anisotropic case. Both\nCij and Dij vanish in the strongly–coupled limit. Since\nψ k (z) → 0 as z → 0, the parallel correlations Dk (R, ω)\nalso vanish at low frequencies, which is most easily explained by reference to the real–space calculations below.\nCalculations for an elastic medium in real space are\ncarried out following the same procedure as before, but\nfor the displacement field due to an isotropic dipole. De-\n\n\f8\ntails are given in Appendix C. The resulting expressions\nare\n\niso,el\nCij\n\n=\n\n\u0012\n\n1 − 2ν\n1−ν\n\n\u00132\n\nc̄κ2 1\nδij\n432πμ2 a\n\nDkiso,el = 0\n\u00132\n\u0012\nc̄κ2 1\n1 − 2ν\niso,el\nD⊥\n=\n1−ν\n288πμ2 R\n\n(17)\n\n(18)\n\niso\nThe results in all cases (including Cij\n) match the low–\nfrequency limits of the expressions (15) and (16). As\nin (16), Dkiso vanishes in the low–frequency, elastic limit.\nThis is seen to arise, in real space calculation, from an\nexact cancellation of firers in between the two probe particles, which generate negative correlations, and those far\naway, which generate positive correlations; see Fig. 7(b).\nThis cancellation requires a displacement field that decays as the inverse–square with distance and would not\noccur for e.g. quadrupoles, which instead decay as 1/r3 .\n\nIV.\n\nDISCUSSION\n\nThe expressions for athermal fluctuations, Cij (ω)\nand Dij (R, ω) derived in this study serve a number of\nuses. As explained above, the scaling of Dk and D⊥\nwith distance R can be used to infer the leading–order\nforce multipole representative of the firers. In an active\ngel, myosin minifilaments might work either as oriented\ndipole or isotropic compression depending on their aggregation and geometries. By comparing the measured\nparallel and perpendicular correlations, it is also possible\nto determine the symmetry of the active firers (oriented\nor isotropic). For materials obeying the 2–fluid model, we\ncan further predict the extent of deviation from the incompressible limits of Cij and Dij in terms of microscopic\nparameters, as expressed through the coupling functions\nψ, ψ k and ψ ⊥ . In actin–myosin systems, this effect is\nfound to be weak, accounting for a ∼ 10-30% variation\nover the usual experimental frequency window, comparable to experimental precision. We can therefore extract\nthe product c̄|κ(ω)|2 /|G(ω)|2 , to good approximation, by\nfitting microrheology data to these expressions. Further\nmeasuring G(ω) independently with active microrheology, the quantity c̄|κ(ω)|2 can be determined.\nActive media are generally expected to have viscoelastic properties different from their equivalent passive systems. For filament networks with active crosslinks (e.g.\nmyosin mini–filaments), the forces generated by microscopic firers place the filaments in a state of non–zero\nmean tension, in contrast to a passive network which is on\naverage unstrained under thermal fluctuations. Semiflexible polymers are known to stiffen under tension, thus an\nactivated filament network is stiffer than a passive one in\nvitro [10]. The local action of force firers c̄|κ(ω)|2 , which\ncan be quantified using the expressions given in this\n\nstudy, is the microscopic origin of the observed macroscopic active stiffening. Here we further provide two tentative scaling arguments that lead to expressions for the\nmean filament tension σ in terms of c̄|κ(ω)|2 , which can\nbe used to predict the macroscopic pre–stressed network\nresponse [10]. One argument is microscopic in nature,\nthe second at the continuum level, and we show at the\nend are they in broad agreement with each other.\nFor the microscopic argument, we first need an estimate of the number of active myosin crosslinks per actin\nfilament. Taking the volume associated with a filament\nof length l in a network of mesh size ξ to be ∼ lξ 2 ,\nthen the typical number of myosin crosslinks per filament\nshould scale as ∼ c̄lξ 2 . Substituting typical values for in\nvitro actin–myosin systems (ξ ∼ 100nm, l ∼ 1 − 10μm\nand c̄ ∼ 1μm−3 [67]) gives < O(1) active crosslinks per\nfilament. We therefore ignore the possibility of multiple active forces on the same filament. The longitudinal\ncomponent of a force applied to a filament will propagate a distance ∼ λ before being transferred into bending\nmodes of filaments in the surrounding network, where λ\nis related to the mean distance between crosslinks lc (as\nmeasured along the filament contour) by λ ∼ lc (lc /dA )z\nwith z a small exponent and dA the characteristic filament diameter [45, 46]. Therefore the mean tension σ\nin the network is estimated to be the number of active\ncrosslinks per filament scaled by λ/l, multiplied by the\nforce per active crosslink ∼ κ/ε. Assuming that the motor generated forces act between crosslinks [10], ε ∼ lc ,\nthe mean tension in the active network is obtained as\nσ ∼ c̄κξ 2\n\n\u0012\n\nlc\ndA\n\n\u0013z\n\n.\n\n(19)\n\nThe exponent z has been predicted to be 2/5 [46], although the slightly different value z = 1/3 was empirically better in athermal, two–dimensional networks at\nintermediate crosslinking densities [45].\nFor the continuum calculation, we consider a single\noriented force dipole in an isotropic elastic body, which,\nwhen active, generates the strain field uij derived in Appendix C. The relative extension of a filament segment\nof length lc is estimated as δlc /lc = uij n̂i n̂j with n̂ the\nfilament orientation [68], assuming uij is uniform over its\nlength. Averaging uij over all filament and dipole orientations trivially gives a zero mean extension δlc = 0.\nHowever, filaments can only support limited compression\nδlc < 0 before relaxing their longitudinal stress via buckling. Therefore the integration should be restricted to\npurely elongating filaments δlc > 0 within a range X\nfrom the dipole. At this length X, the strain is just large\nenough to initiate buckling; beyond X, both compression and elongation are allowed and the contribution to\nδlc averages to zero. Averaging and integrating uij with\nthis restriction, we obtain that the mean extension per\nfilament is δlc /lc ∼ (c̄κ/μ) ln(X/lc ). The logarithmic\nfactor ln(X/lc ) derives from the inverse–cube decay of\nthe strain field with distance r, uij ∼ r−3 , necessitating\n\n\f9\nboth long and short wavelength cut–offs. Since it is logarithmic, it varies only slowly with X and lc and may\nbe regarded as a constant in most cases. To calculate\nthe mean tension σ, we use the known force–extension\nrelation σ ∼ (l2p kB T /l3c )(δlc /lc ) with lp the filament's\npersistence length [39], giving the final estimate\n\nσ∼\n\nl2p kT c̄κ\nln(X/lc )\nl3c μ\n\n.\n\n(20)\n\nRegarding the weakly–varying multipliers ln(X/lc ) and\n(lc /dA )z≪1 as numerical prefactors, (19) and (20) give\nus the network shear modulus μ ∼ l2p kB T /l3c ξ 2 in agreement with prior studies [39]. Despite the very different approximations taken, these two estimates are thus\nbroadly consistent. Therefore by determining c̄|κ(ω)|2\nand G(ω) using microrheology experiments and the expressions derived in this manuscript, it is now possible to\ncompletely address the mechanism of how the nonequilibrium activity leads to the modification of the network\nviscoelasticity via (19) or (20).\nAcknowledgments\n\nfirst term on the right hand side of (A1) corresponds\nto an initially growing κ that does not start releasing\nby time t, the second to those that start releasing at\nsome time 0 < s < t and are still in this release phase\nat t, the third to initially releasing κ, and the fourth\nand fifth terms to second and subsequent cycles after\nthe first release phase has finished. The derivation of\n(A1) is straightforward; for instance, the second term is\nRt\npA t1 ds τ1 e−s/τ δ(κ − [κ0 + κ̇G s − (t − s)κ̇R ]), where the\nexponential gives the probability for the first release\nevent at s, the delta function maps to the corresponding\nvalue of κ at t, and t1 = max(0, [tκ̇R − κ0 ]/[κ̇G + κ̇R ])\nensures κ ≥ 0. Performing the integral gives the second\nterm in (A1). The fourth and fifth terms are derived in\na similar manner.\nWe note that Q(κ, t; κ0 ) is properly\nR∞\nnormalized, 0 dκ Q(κ, t; κ0 ) = 1 ∀ t, κ0 .\nAs t → ∞, Q(κ, t; κ0 ) → Q∞ (κ) = τ κ̇1G e−κ/τ κ̇G , which\nis just an exponential distribution with mean hκi = τ κ̇G .\nThe correlation function C(t) = hκ(t0 + t)κ(t0 )it0 − hκi2\nin steady state is found by integrating over (A1) suitably\nweighted by Q∞ (κ0 ),\nC(t) =\n\nZ\n\n∞\n\n0\n\nThe authors would like to thank F. MacKintosh and\nC. Schmidt for useful discussions regarding this work.\nAppendix A: Finite release–time model\n\nHere we derive the power spectrum |κ(ω)|2 for the\nstochastic grow–and–release model given in Fig. 3. In\nsteady state, the dipole moment κ(t) will be growing\nwith probability pG = κ̇R /(κ̇G + κ̇R ) and releasing with\nprobability pR = 1 − pG = κ̇G /(κ̇G + κ̇R ). To find\nQ(κ, t; u0 ), the probability density function of κ at time\nt given κ = κ0 at t = 0, we therefore integrate over all\npossible histories and weight according to pG or pR . The\nresult is\nQ(κ, t; κ0 )\n= pG e−t/τ δ(κ − [tκ̇G + κ0 ])\n+ pG θ(κ − [κ0 − tκ̇R ])θ(κ0 + tκ̇G − κ)e\n\n−t/T\n\ne\n\n−\n\n= hκi2\n\nZ\n\n∞\n\ndκ κ0 κ Q∞ (κ0 )Q(κ, t; κ0 ) − hκi2\n\u001b\n1\n1\n−t/ατ\n−t/τ\n(A2)\ne\ne\n+\n1−α\n1 − α−1\n\ndκ0\n\u001a\n\n0\n\nusing α = κ̇G /κ̇R < 1 for the ratio of growth to release\nrates. This exhibits positive correlations on the characteristic time scale for growth τ , and negative correlations\non the release time scale ατ . In the rapid release limit\nα → 0 we recover the expected correlation for a Poisson\nprocess, C(t) = hκi2 e−t/τ . Note that although we assume α < 1 for this discussion and in the main text, the\nresult is also valid for α > 1 and indeed the steady state\nis invariant under (α, κ̇G , κ̇R , τ ) ↔ (α−1 , κ̇R , κ̇G , ατ ).\nIt is now straightforward to Fourier transform (A2)\npower spectrum for a single firer |κ(ω)|2 =\nRto∞get the\niωt\nC(|t|), which is given in (3). For completeness\n−∞ dt e\nwe also give here the limiting case κ̇G → κ̇R when the cycle is symmetric. We find that C(t) ∼ hκi2 (1 + t/τ )e−t/τ\nand |κ(ω)|2 = 4τ hκi2 /(1+ω 2 τ 2 )2 , so the pseudo–diffusive\nregime is now entirely absent.\n\nκ−κ0\nT κ̇R\n\nT κ̇R\n\n+ pR δ(κ − [κ0 − tκ̇R ])\n\n+ pR θ(t − κ0 /κ̇R )δ(κ − κ̇G [t − κ0 /κ̇R ])e−t/τ eκ0 /τ κ̇R\n\u0012\n\u0014\n\u0015\u0013\nκ0\nκ\n+ θ t−\n×\n+\nκ̇R\nκ̇G\n\u001a\n\u001b\n1 −κ/τ κ̇G\n−t/T 1\n−(κ−κ0 )/T κ̇R\n− pG e\ne\ne\n(A1)\nτ κ̇G\nT κ̇R\nwhere T = τ (κ̇G + κ̇R )/κ̇R is the mean total cycle\ntime (growth plus release), θ is the Heaviside step function and κ ≥ 0 is implicitly assumed throughout. The\n\nAppendix B: Poisson ratio for affine network\ndeformation\n\nHere we derive the Poisson ratio for a 3–dimensional\nfilament network under the assumptions of affine quasi–\nstatic deformation and a homogeneous, isotropic network. Consider a single filament of length l and orientation n̂ with respect to some fixed axes. If the system\nis deformed to give a displacement field u(x, t), and assuming this macroscopic field scales uniformly down to\nlengths ≪ l (i.e. the deformation is affine), then the\nfilament elongates by an amount δl given by [68]\n\n\f10\n\nδl\n= uij n̂i n̂j\nl\n\n(B1)\n\nwhere uij = (∂i uj + ∂j ui )/2 is the linear strain tensor.\nThe increase in energy in this filament's deformed state\nis then δE = 12 k(δl)2 = 21 kl2 (uij n̂i n̂j )2 with k an effective spring constant. Note that k may depend on l, the\nfrequency of deformation change, any pre–tensile stress\nin the filament etc. For the purposes of this calculation,\nhowever, we need to only assume k is independent of the\nfilament orientation n̂.\nNow consider a homogeneous population of filaments\nwith length distribution L(l), orientation distribution\nN (n̂) and number density ρ. To ensure isotropy, l and\nn̂ are uncorrelated and N (n̂) = (4π)−1 . The increase in\nenergy per unit volume is then\nZ\n1\ndl L(l) dn̂ N (n̂) kl2 (uij n̂i n̂j )2 (B2)\n2\nZ\n1\n= Σ\ndn̂ (uij n̂i n̂j )2\n(B3)\n4π\nR\nwhere Σ = 12 ρ dlL(l)kl2 . Assuming quasi–static response, this energy change equals the corresponding elastic energy ∆E el = 12 λu2ii +μu2ij with λ, μ the Lamé coefficients [68]. By choosing two independent strain fields uij\nit is therefore possible to determine both λ and μ. For\ninstance, an isotropic compression uij = −γδij gives the\nequation γ 2 Σ = 29 λγ 2 + 3μγ 2 . For simple shear, where\nuxy = uyx = γ/2 and uij = 0 otherwise, another equation γ 2 Σ/15 = μγ 2 /2 is obtained. From these 2 equations, we obtain λ = μ = 2Σ/15, and the Poisson ratio\nν = λ/[2(λ + μ)] = 1/4, independent of Σ and hence k.\nBy coincidence, this is in good agreement with the value\nobtained for semi–dilute flexible polymers in a good solvent [69, 70].\n∆E = ρ\n\nZ\n\nAppendix C: Real-space calculations\n\nThe displacement field u(r) due to a point\nforce f applied at the origin of an infinite, homogeneous, isotropic elastic continuum is known,\nui (r) = [16πμ(1 − ν)r]−1 {(3 − 4ν)δij + r̂i r̂j } fj , with μ\nthe shear modulus, ν the Poisson ratio, r = |r| and\nr̂ = r/r [68]. The displacement field extending from the\ndipole with orientation n̂ defined in (1) is then obtained\nby taking the gradient of the monopole solution,\nuani\ni (r; n̂) =\n\n1n\nκ\n2(1 − 2ν)[r̂ * n̂]n̂i\n16πμ(1 − ν) r2\no\n(C1)\n−(1 − 3[r̂ * n̂]2 )r̂i\n\nwith κ = εf the dipole moment. The linear strain uij =\n(∂i uj +∂j ui )/2 and stress fields can be found by the usual\nrelations. For instance, the strain is\n\nTABLE I: The displacement, strain and stress fields for an\nisotropic compression center of size ε centered on the origin.\nSij is the traceless tensor Sij = 31 δij − r̂i r̂j .\nField\nDisplacement\nStrain uiso\nij (r)\nTrace uiso\nii (r)\niso\nStress σij\n(r)\n\nr < ε/2\nr > ε/2\nr\nκ(1\n−\n2ν)\nκ(1\n− 2ν) 1\nuiso\nr̂i −\nr̂i\ni (r) −\n3πμ(1 − ν) ε3\n24πμ(1 − ν) r 2\nκ(1 − 2ν) 1\nκ(1 − 2ν) 1\n−\nδij −\nSij\n3πμ(1 − ν) ε3\n8πμ(1 − ν) r 3\nκ(1 − 2ν) 1\n−\n0\nπμ(1 − ν) ε3\n2κ(1 + ν) 1\nκ(1 − 2ν) 1\n−\nδij −\nSij\n3π(1 − ν) ε3\n4π(1 − ν) r 3\n\nκ\n1\nuani\n×\nij (r; n̂) = −\n16πμ(1 − ν) r3\nn\n2(1 − 2ν)n̂i n̂j − 3(5[r̂ * n̂]2 − 1)r̂i r̂j\n\no\n+(3[r̂ * n̂]2 − 1)δij + 6ν[r̂ * n̂](n̂i r̂j + n̂j r̂i ) . (C2)\n\nThis equation has a trace uani\nii = −κ(1 − 2ν)[8πμ(1 −\nν)r3 ]−1 (1 − 3[r̂ * n̂]2 ) that vanishes in the incompressible\nlimit ν = 1/2 as expected.\nIt is possible to derive an exact solution for finite dipole\nwith size ε by exploiting the spherical symmetry that\narises after averaging over n̂. The resultant displacement\nfield is found by integrating the monopole solution over\na sphere of inward–pointing monopole forces −2f r̂. The\nsphere has radius ε/2 centered on the origin, and the factor 2 arises since each dipole consists of 2 monopoles. By\nsymmetry only the response at, say, a point (0, 0, z) needs\nto be considered. The integration is simplified by switching to spherical polar\np coordinates and making the change\nof variables u = r2 + ε2 /4 − rε cos θ for the polar angle\nθ; the cases z < ε/2 and z > ε/2 correspond to different\nintegral limits and must be considered separately. The\nresults are presented in Table I.\nThe firers are assumed to be independently and uniformly distributed throughout space, so the firer concentration field c(x) obeys hc(x)c(y)i = c̄δ(x − y) and hence\nhui (0)uj (R)i\n\u001cZ\n\u001d\nZ\n=\ndx dy c(x)c(y)ui (−x)uj (R − y) (C3)\nZ\n= c̄ dx ui (−x)uj (R − x)\n(C4)\nThe single–point correlations correspond to R = 0. The\nrequired expression for a single isotropic or anisotropic\nfield ui is then inserted into the integrand. For the 2–\npoint correlations it is convenient to set R = (0, 0, R)\nfor the integration, and rotate to general R̂ at the end.\n\n\f11\nThe integration is facilitated by switching to spherical polar coordinates by converting variables as u =\n√\nr2 + R2 − 2rR cos θ. We give here an intermediate expression for the correlations due to a nematic field of\nanisotropic dipoles with the same orientation n̂,\nc̄κ2\nani\nDij\n=\n(1 − [n̂ * R̂]2 )×\n256πμ2 (1 − ν)2 R\nn\n(1 − [n̂ * R̂]2 )δij + 4[n̂ * R̂](2 − 3ν)[n̂i R̂j + R̂i n̂j ]\no\n+4(1 − 2ν)(3 − 4ν)n̂i n̂j − (1 − 5[n̂ * R̂]2 )R̂i R̂j\n\n(C5)\n\nbe projected into components parallel and perpendicular to the real–space unit vector R̂, i.e.\nDij (R) = Dk (R)R̂i R̂j + D⊥ (R)(δij − R̂i R̂j ).\n\nTo relate the q–space projections to the real\nspace ones, note that R̂i R̂j Dij (R) = Dk (R) and\n(δij − R̂i R̂j )Dij (R) = 2D⊥ (R). By writing Dij (R) as\nthe inverse transform of (D1) in both of these expressions, it is readily seen that the following transform pairs\nhold between Dk,⊥ (R) and E k,⊥ (q),\n\nFT\n\nDk (R) −→ E ⊥ (q)(1 − [q̂ * R̂]2 ) + E k (q)[q̂ * R̂]2\nFT\n\nThe expression given in (14) is then found by averaging\n(C5) over n̂. For isotropic dipoles we assume ε/r → 0\nand hence only use the r > ε/2 expressions in Table I.\nAppendix D: Dij for the 2–fluid model\n\nDij (q, ω) for the 2–fluid model is found by inserting the\nanisotropic dipole propagator P(q, ω) from (7) and (8)\ninto (12) and then averaging over orientation n̂. In terms\nof projection operators parallel and perpendicular to q̂,\n\n2D⊥ (R) −→ E ⊥ (q)(1 + [q̂ * R̂]2 ) + E k (q)(1 − [q̂ * R̂]2 )\n(D2)\n\nPerforming the inverse transforms of the E k,⊥ (q) in (D1)\nusing (D2) gives the final expressions (13). The integrations are facilitated by switching to cylindrical polar coordinates (ρ, θ, z) and exploiting isotropy to set\nR = (0, 0, R) without loss of generality.\n\nNote this projection is in q–space, not real space.\nFor an isotropic material Dij (R) can similarly\n\nIt is possible to make some general remarks on\nthe correlations of displacement fields driven by force\nquadrupoles, f (r) ∼ κQ ∇2 δ(r) with κQ the quadrupole\nmoment, without going through detailed calculations.\nAfter averaging over the quadrupole internal degrees of\nfreedom, Dij is expected to take the same form as (D1)\nbut with E ⊥ (q) ∝ c̄κ2Q /|G|2 , the different power of q\n(with respect to dipoles) being due to the one–higher\nderivative of δ(r) in f . The longitudinal component\nE k ≡ 0 for an incompressible body. Repeating the inverse transformations (D2) now gives Dk = −2D⊥ ∝\nc̄κ2Q /|G|2 R3 , as discussed in the text.\n\n[1] B. Alberts, D. Bray, J. Lewis, M. Raff , K. Roberts and\nJ. D. Watson, Molecular Biology of the Cell (Garland,\nNew York, 1994).\n[2] What is Life?, E. Schrödinger (Canto, Cambridge University Press, Cambridge).\n[3] Mechanics of motor proteins and the cytoskeleton, J.\nHoward (Sinauer, Massachusetts, 2001).\n[4] A. B. Kolomeisky and M. E. Fisher, Annu. Rev. Phys.\nChem. 58, 675 (2007).\n[5] Mechanics of the Cell, D. Boal (CUP, Cambridge, 2002).\n[6] Cell movements: From Molecules to Motility, D. Bray\n(Garland, New York, 2001).\n[7] E. Paluch, C. Sykes, J. Prost and M. Bornens, Trends in\nCell Biology 16 5 (2006).\n[8] A. W. C. Lau, B. D. Hoffman, A. Davies, J. C. Crocker,\nand T. C. Lubensky, Phys. Rev. Lett. 91, 198101 (2003).\n[9] A. W. C. Lau and T. C. Lubensky, Phys. Rev. E 80,\n011917 (2009).\n[10] D. Mizuno, C. Tardin, C. F. Schmidt and F. C. MacKintosh, Science 315, 370 (2007).\n\n[11] F. Gittes, B. Schnurr, P. D. Olmsted, F. C. MacKintosh\nand C. F. Schmidt, Phys. Rev. Lett. 79, 3286 (1997).\n[12] A. J. Levine and T. C. Lubensky, Phys. Rev. Lett. 85,\n1774 (2000).\n[13] J. C. Crocker, M. T. Valentine, E. R. Weeks, T. Gisler,\nP. D. Kaplan, A. G. Yodh and D. A. Weitz, Phys. Rev.\nLett. 85, 888 (2000).\n[14] A. J. Levine and T. C. Lubensky, Phys. Rev. E 65,\n011501 (2001).\n[15] L. G. Wilson, A. W. Harrison, A. B. Schofield, J. Arit\nand W. Poon, J. Phys. Chem. B 113, 3806 (2009).\n[16] D. Mizuno, D. A. Head, T. Toyota, C. Tardin and C. F.\nSchmidt, in preparation.\n[17] D. Mizuno, D. A. Head, F. C. MacKintosh and C. F.\nSchmidt, Macrmolecules 41, 7194 (2008).\n[18] C. P. Brangwynne, G. H. Koenderink, F. C. MacKintosh\nand D. A. Weitz, Phys. Rev. Lett. 100, 118104 (2008).\n[19] F. Nédélec, T. Surrey, A. C. Maggs and S. Leibler, Nature\n389, 305 (1997).\n[20] T. Surrey, F. Nédélec, S. Leibler and E. Karsenti, Science\n\nDij (q, ω) = E k (q)q̂i q̂j + E ⊥ (q)(δij − q̂i q̂j )\nq2\n5|Bq 2 − iωΓ|2\n1\nE ⊥ (q) = c̄κ2\n15q 2 |G|2\nE k (q) = c̄κ2\n\n(D1)\n\n\f12\n292, 1167 (2001).\n[21] F. Backouche, L. Haviv, D. Groswasser and A.\nBernheim–Grosswasser, Phys. Biol. 3, 264 (2006).\n[22] T. B. Liverpool and M. C. Marchetti, Phys. Rev. Lett.\n90, 138102 (2003).\n[23] K. Kruse, J. F. Joanny, F. Jülicher, J. Prost and K. Sekimoto, Phys. Rev. Lett. 92, 078101 (2004).\n[24] T. B. Liverpool and M. C. Marchetti, Europhys. Lett.\n69, 846 (2005).\n[25] K. Kruse, J. F. Joanny, F. Jülicher, J. Prost and K. Sekimoto, Eur. Phys. J. E 16, 5 (2005).\n[26] T. B. Liverpool, Phil. Trans. Roy. Soc. A 364, 3335\n(2006).\n[27] R. Voituriez, J. F. Joanny and J. Prost, Phys. Rev. Lett.\n96, 028102 (2006).\n[28] V. Rühle, F. Ziebert, R. Peter and W. Zimmermann, Eur.\nPhys. J. E 27, 243 (2008).\n[29] A. Onuki, J. Chem. Phys. 106, 5761 (1997).\n[30] H. Tanaka, J. Phys.: Cond. Mat. 12, R207 (2000).\n[31] A. Furukawa, J. Chem. Phys. 121, 9716 (2004).\n[32] H. Tanaka and T. Araki, Chem. Eng. Sci. 61, 2108\n(2006).\n[33] P. Bursac, G. Lenormand, B. Fabry, M. Oliver, D. A.\nWeitz, V. Viasnoff, J. P. Butler and J. J. Fredberg, Nature Mat. 4, 557 (2005).\n[34] J. C. del Alamo, G. N. Norwich, Y. J. Li, J. C. Lasheras\nand S. Chien, Proc. Nat. Acad. Sci. 105, 15411 (2008).\n[35] M. H. G Duits, Y. Li, S. A Vanapalli and F. Mugele,\nPhys. Rev. E 79, 051910 (2009).\n[36] C. M. Brawley and R. S. Rock, Proc. Nat. Acad. Sci.\n106, 9685 (2009).\n[37] F. C. MacKintosh and A. J. Levine, Phys. Rev. Lett.\n100, 018104 (2008)\n[38] A. J. Levine and F. C. MacKintosh, J. Phys. Chem. B\n113, 3820 (2009).\n[39] F. C. MacKintosh, J. Käs and P. A. Janmey, Phys. Rev.\nLett. 75, 4425 (1995).\n[40] H. Isambert and A. C. Maggs, Macromolecules 29, 1036\n(1996).\n[41] K. Kroy and E. Frey, Phys. Rev. Lett. 77, 306 (1996).\n[42] D. C. Morse, Macromolecules 31, 7044 (1998).\n[43] F. Gittes and F. C. MacKintosh, Phys. Rev. E 58, R1241\n(1998).\n[44] M. Tassieri, R. M. L. Evans, L. Barbu-Tudoran, G. N.\nKhaname, J. Trinick and Tom A. Waigh, Phys. Rev. Lett.\n101, 198301 (2008).\n[45] D. A. Head, A. J. Levine and F. C. MacKintosh, Phys.\nRev. Lett. 91, 108102 (2003).\n[46] D. A. Head, A. J. Levine and F. C. MacKintosh, Phys.\nRev. E 68, 061907 (2003).\n[47] J. Wilhelm and E. Frey, Phys. Rev. Lett. 91, 108103\n\n(2003).\n[48] M. L. Gardel, J. H. Shin, F. C. MacKintosh, L. Mahadevan, P. Matsudaira and D. A. Weitz, Science 304, 1301\n(2004).\n[49] J. Liu, G. H. Koenderink, K. E. Kasza, F. C. MacKintosh\nand D. A. Weitz, Phys. Rev. Lett. 98, 198304 (2007).\n[50] G. A. Buxton and N. Clarke, Phys. Rev. Lett. 98, 238103\n(2007).\n[51] M. Das, F. C. MacKintosh and A. J. Levine, Phys. Rev.\nLett. 99, 038101 (2007).\n[52] C. P. Broedersz, C. Storm and F. C. MacKintosh, Phys.\nRev. E 79, 061914 (2009).\n[53] O. Lieleg, M. M. A. E. Claessens, Y. Luan and A. R.\nBausch, Phys. Rev. Lett. 101, 108101 (2008).\n[54] S. M. V. Ward, A. Weins, M. R. Pollak and David A.\nWeitz, Biophys. J. 95, 4915 (2008).\n[55] K. E. Kasza, G. H. Koenderink, Y. C. Lin, C. P. Broedersz, W. Messner, F. Nakamura, T. P. Stossel, F. C.\nMacKintosh and D. A. Weitz, Phys. Rev. E 79, 041928\n(2009).\n[56] J.-P. Bouchaud and E. Pitard, Eur. Phys. J. E 6, 231\n(2001).\n[57] J.-P. Bouchaud and E. Pitard, Eur. Phys. J. E 9, 287\n(2002).\n[58] L. Cipelletti, S. Manley, R. C. Ball and D. A. Weitz,\nPhys. Rev. Lett. 84, 2275 (2000).\n[59] G. Picard, A. Ajdari, F. Lequeux and L. Bocquet, Eur.\nPhys. J. E 15, 371 (2004).\n[60] G. Picard, A. Ajdari, F. Lequeux and L. Bocquet, Phys.\nRev. E 71, 010501(R) (2005).\n[61] J. Goyon, A. Colin, G. Ovarlez, A. Ajdari and L. Bocquet, Nature 454, 84 (2008).\n[62] M. L. Manning, J. S. Langer and J. M. Carlson, Phys.\nRev. E 76, 056106 (2007).\n[63] D. Humphrey, C. Duggan, D. Saha, D. Smith and K.\nKäs, Nature 416, 413 (2002).\n[64] D. P. Kiehart and R. Feghali, J. Cell. Biol. 103, 1517\n(1986).\n[65] R. Siems, Phys. Stat. Sol. 30, 645 (1968).\n[66] U. S. Schwarz and S. A. Safran, Phys. Rev. Lett. 88,\n048102 (2002).\n[67] D. Mizuno, R. Bacabac, C. Tardin, D. A. Head and C.\nF. Schmidt, Phys. Rev. Lett. 102, 168102 (2009).\n[68] L. D. Landau and E. M. Lifshitz, Theory of Elasticity,\n3rd ed. (Pergamon Press, Oxford, 1986).\n[69] E. Geissler and A. M. Hecht, Macromolecules 13, 1276\n(1980).\n[70] E. Geissler and A. M. Hecht, Macromolecules 14, 185\n(1981).\n\n\f"}