{"id": "http://arxiv.org/abs/1101.4184v3", "guidislink": true, "updated": "2014-02-05T07:51:27Z", "updated_parsed": [2014, 2, 5, 7, 51, 27, 2, 36, 0], "published": "2011-01-21T17:03:02Z", "published_parsed": [2011, 1, 21, 17, 3, 2, 4, 21, 0], "title": "Bridges of Lévy processes conditioned to stay positive", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.3690%2C1101.3890%2C1101.5126%2C1101.4094%2C1101.3704%2C1101.3020%2C1101.2571%2C1101.2030%2C1101.2622%2C1101.4940%2C1101.2210%2C1101.4353%2C1101.4171%2C1101.3646%2C1101.5840%2C1101.3444%2C1101.3879%2C1101.5182%2C1101.0904%2C1101.3781%2C1101.3280%2C1101.0244%2C1101.4184%2C1101.3014%2C1101.3053%2C1101.4273%2C1101.4887%2C1101.3428%2C1101.1608%2C1101.1861%2C1101.1849%2C1101.1974%2C1101.0605%2C1101.3639%2C1101.4511%2C1101.5833%2C1101.1987%2C1101.3138%2C1101.3427%2C1101.0144%2C1101.0568%2C1101.2901%2C1101.0641%2C1101.0338%2C1101.3484%2C1101.5353%2C1101.5422%2C1101.3862%2C1101.1897%2C1101.2855%2C1101.3993%2C1101.0612%2C1101.5354%2C1101.1911%2C1101.0879%2C1101.0822%2C1101.1778%2C1101.2390%2C1101.5287%2C1101.4078%2C1101.0288%2C1101.3154%2C1101.4136%2C1101.2054%2C1101.2114%2C1101.4362%2C1101.2100%2C1101.2966%2C1101.0770%2C1101.5588%2C1101.0200%2C1101.1871%2C1101.1115%2C1101.0599%2C1101.6023%2C1101.4275%2C1101.3292%2C1101.2562%2C1101.6024%2C1101.3388%2C1101.0355%2C1101.2842%2C1101.2010%2C1101.3903%2C1101.2491%2C1101.5061%2C1101.2222%2C1101.1645%2C1101.5230%2C1101.2074%2C1101.3327%2C1101.0380%2C1101.2611%2C1101.4383%2C1101.2046%2C1101.1758%2C1101.5886%2C1101.1442%2C1101.4117%2C1101.4214%2C1101.2682&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Bridges of Lévy processes conditioned to stay positive"}, "summary": "We consider Kallenberg's hypothesis on the characteristic function of a\nL\\'{e}vy process and show that it allows the construction of weakly continuous\nbridges of the L\\'{e}vy process conditioned to stay positive. We therefore\nprovide a notion of normalized excursions L\\'{e}vy processes above their\ncumulative minimum. Our main contribution is the construction of a continuous\nversion of the transition density of the L\\'{e}vy process conditioned to stay\npositive by using the weakly continuous bridges of the L\\'{e}vy process itself.\nFor this, we rely on a method due to Hunt which had only been shown to provide\nupper semi-continuous versions. Using the bridges of the conditioned L\\'{e}vy\nprocess, the Durrett-Iglehart theorem stating that the Brownian bridge from $0$\nto $0$ conditioned to remain above $-\\varepsilon$ converges weakly to the\nBrownian excursion as $\\varepsilon \\to0$, is extended to L\\'{e}vy processes. We\nalso extend the Denisov decomposition of Brownian motion to L\\'{e}vy processes\nand their bridges, as well as Vervaat's classical result stating the\nequivalence in law of the Vervaat transform of a Brownian bridge and the\nnormalized Brownian excursion.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.3690%2C1101.3890%2C1101.5126%2C1101.4094%2C1101.3704%2C1101.3020%2C1101.2571%2C1101.2030%2C1101.2622%2C1101.4940%2C1101.2210%2C1101.4353%2C1101.4171%2C1101.3646%2C1101.5840%2C1101.3444%2C1101.3879%2C1101.5182%2C1101.0904%2C1101.3781%2C1101.3280%2C1101.0244%2C1101.4184%2C1101.3014%2C1101.3053%2C1101.4273%2C1101.4887%2C1101.3428%2C1101.1608%2C1101.1861%2C1101.1849%2C1101.1974%2C1101.0605%2C1101.3639%2C1101.4511%2C1101.5833%2C1101.1987%2C1101.3138%2C1101.3427%2C1101.0144%2C1101.0568%2C1101.2901%2C1101.0641%2C1101.0338%2C1101.3484%2C1101.5353%2C1101.5422%2C1101.3862%2C1101.1897%2C1101.2855%2C1101.3993%2C1101.0612%2C1101.5354%2C1101.1911%2C1101.0879%2C1101.0822%2C1101.1778%2C1101.2390%2C1101.5287%2C1101.4078%2C1101.0288%2C1101.3154%2C1101.4136%2C1101.2054%2C1101.2114%2C1101.4362%2C1101.2100%2C1101.2966%2C1101.0770%2C1101.5588%2C1101.0200%2C1101.1871%2C1101.1115%2C1101.0599%2C1101.6023%2C1101.4275%2C1101.3292%2C1101.2562%2C1101.6024%2C1101.3388%2C1101.0355%2C1101.2842%2C1101.2010%2C1101.3903%2C1101.2491%2C1101.5061%2C1101.2222%2C1101.1645%2C1101.5230%2C1101.2074%2C1101.3327%2C1101.0380%2C1101.2611%2C1101.4383%2C1101.2046%2C1101.1758%2C1101.5886%2C1101.1442%2C1101.4117%2C1101.4214%2C1101.2682&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We consider Kallenberg's hypothesis on the characteristic function of a\nL\\'{e}vy process and show that it allows the construction of weakly continuous\nbridges of the L\\'{e}vy process conditioned to stay positive. We therefore\nprovide a notion of normalized excursions L\\'{e}vy processes above their\ncumulative minimum. Our main contribution is the construction of a continuous\nversion of the transition density of the L\\'{e}vy process conditioned to stay\npositive by using the weakly continuous bridges of the L\\'{e}vy process itself.\nFor this, we rely on a method due to Hunt which had only been shown to provide\nupper semi-continuous versions. Using the bridges of the conditioned L\\'{e}vy\nprocess, the Durrett-Iglehart theorem stating that the Brownian bridge from $0$\nto $0$ conditioned to remain above $-\\varepsilon$ converges weakly to the\nBrownian excursion as $\\varepsilon \\to0$, is extended to L\\'{e}vy processes. We\nalso extend the Denisov decomposition of Brownian motion to L\\'{e}vy processes\nand their bridges, as well as Vervaat's classical result stating the\nequivalence in law of the Vervaat transform of a Brownian bridge and the\nnormalized Brownian excursion."}, "authors": ["Gerónimo Uribe Bravo"], "author_detail": {"name": "Gerónimo Uribe Bravo"}, "author": "Gerónimo Uribe Bravo", "links": [{"title": "doi", "href": "http://dx.doi.org/10.3150/12-BEJ481", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1101.4184v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1101.4184v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Published in at http://dx.doi.org/10.3150/12-BEJ481 the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "arxiv_primary_category": {"term": "math.PR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.PR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1101.4184v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1101.4184v3", "journal_reference": "Bernoulli 2014, Vol. 20, No. 1, 190-206", "doi": "10.3150/12-BEJ481", "fulltext": "arXiv:1101.4184v3 [math.PR] 5 Feb 2014\n\nBernoulli 20(1), 2014, 190–206\nDOI: 10.3150/12-BEJ481\n\nBridges of Lévy processes conditioned to stay\npositive\nGERÓNIMO URIBE BRAVO\nInstituto de Matemáticas, Universidad Nacional Autónoma de México, Área de la Investigación\nCientı́fica, Circuito Exterior, Ciudad Universitaria, Coyoacán, 04510, México, D.F.\nE-mail: geronimo@matem.unam.mx\nWe consider Kallenberg's hypothesis on the characteristic function of a Lévy process and show\nthat it allows the construction of weakly continuous bridges of the Lévy process conditioned to\nstay positive. We therefore provide a notion of normalized excursions Lévy processes above their\ncumulative minimum. Our main contribution is the construction of a continuous version of the\ntransition density of the Lévy process conditioned to stay positive by using the weakly continuous\nbridges of the Lévy process itself. For this, we rely on a method due to Hunt which had only\nbeen shown to provide upper semi-continuous versions. Using the bridges of the conditioned Lévy\nprocess, the Durrett–Iglehart theorem stating that the Brownian bridge from 0 to 0 conditioned\nto remain above −ε converges weakly to the Brownian excursion as ε → 0, is extended to Lévy\nprocesses. We also extend the Denisov decomposition of Brownian motion to Lévy processes and\ntheir bridges, as well as Vervaat's classical result stating the equivalence in law of the Vervaat\ntransform of a Brownian bridge and the normalized Brownian excursion.\nKeywords: Lévy processes; Markovian bridges; Vervaat transformation\n\n1. Introduction and statement of the results\nOur discussion will use the canonical setup: X = (Xt )t≥0 denotes the canonical process\non the Skorohod space of càdlàg trajectories, F denotes σ-field generated by X (also\nwritten σ(Xs , s ≥ 0)), (Ft , t ≥ 0) is the canonical filtration, where Ft = σ(Xs , s ≤ t) and\nθt , t ≥ 0, are the shift operators given by θt (ω)s = ωt+s . Emphasis is placed on the various\nprobability measures considered.\nFocus will be placed on two special (Markovian) families of probability measures,\ndenoted (Px , x ∈ R) and (P↑x , x ≥ 0). The probability measure P0 corresponds to the\nlaw of a Lévy process: under P0 the canonical process has independent and stationary\nincrements and starts at 0. Then Px is simply the law of x + X under P0 , and under each\nPx the canonical process is Markov and the conditional law of (Xt+s , s ≥ 0) given Ft is\nPXt . (Collections of probability measures on Skorohod space satisfying the latter property\n\nThis is an electronic reprint of the original article published by the ISI/BS in Bernoulli,\n2014, Vol. 20, No. 1, 190–206. This reprint differs from the original in pagination and\ntypographic detail.\n1350-7265\n\nc\n\n2014 ISI/BS\n\n\f2\n\nG. Uribe Bravo\n\nare termed Markovian families.) We also make use of the dual Lévy process by letting P̂x\ndenote the law of x − X under P0 . Associated to Px , x ∈ R, P↑x can be interpreted as the\nlaw of the Lévy process conditioned to stay positive; as this event can have probability\nzero, the precise definition of P↑x can be described as follows: a Lévy process conditioned\nto stay positive is the (weak) limit of X conditioned to stay positive until an independent\nexponential Tα of parameter α as α → 0 (cf. Chaumont and Doney [5], Proposition 1).\nIt is actually simpler to actually construct Lévy processes conditioned to stay positive\nby a Doob transformation and justifying this passage to the limit afterwards, as recalled\nin Section 4.\nUnder very general conditions, given a Markovian family of probability laws like\n(Px , x ∈ R), one can construct weakly continuous versions of the conditional laws of\n(Xs , s ≤ t) under Px given Xt = y. They are termed bridges of Px between x and y of\nlength t and usually denoted Ptx,y . In Section 2, we review the construction of these\nbridges from Chaumont and Uribe Bravo [9]. Our first result is to show that one can\napply this general recipe to the laws P↑x . To this end, we impose two conditions on the\nLévy process.\nR\n(K) Under P0 and for any t > 0, |E0 (eiuXt )| du < ∞.\n(R) 0 is regular for both half-lines (−∞, 0) and (0, ∞).\nAssumption (K) was introduced by Kallenberg as a means of imposing the existence\nof densities for the law of Xt for any t > 0 which posses good properties (in particular\ncontinuity). A construction of Lévy process bridges under hypothesis (K) was first accomplished in Kallenberg [16] by means of convergence criteria for processes with exchangeable increments. This construction is retaken as an example of the general construction\nof Markovian bridges in Chaumont and Uribe Bravo [9].\n↑\nTheorem 1. Under (K) and (R), we can construct bridges P↑,t\nx,y of Px for any x, y ≥ 0\nand t > 0 and that they are weakly continuous as functions of x and y.\n\nTheorem 1 presents another example of the applicability of Theorem 1 in Chaumont\nand Uribe Bravo [9], and the proof of the former consists on verifying the technical\nhypotheses in the latter. These technical hypotheses are basically: the existence of a\ncontinuous and positive version of the densities of Xt under P↑x . For nonzero starting\nstates, we will inherit absolute continuity from that of the Lévy process killed upon\nbecoming negative (in Lemma 3) and the later can be studied by a technique inspired from\nHunt [15] for the Brownian case, in which a transition density for the killed Lévy process\nis obtained from a transition density of the Lévy process using its bridges. (Cf. Equation\n(5.1) and Lemma 2.) Hunt's technique has typically allowed only the construction of\nlower semicontinuous versions of the density, but with weakly continuous bridges one\ncan show that Hunt's density is actually continuous. This is one possible application\nof the existence of weakly continuous Markovian bridges. Another problem is then to\ncharacterize the points at which the density is positive. Hunt does this for Brownian\nmotion and the result has been extended to (multidimensional) stable Lévy processes in\nthe symmetric case by Chen and Song [10], Theorem 2.4 and in the asymmetric case by\n\n\fBridges of Lévy processes conditioned to stay positive\n\n3\n\nVondraček [24], Theorem 3.2. We study positivity of the density by exploiting the cyclic\nexchangeability property of Lévy processes, following Knight [17].\nRecall that when P0 is the law of Brownian motion, Ptx,y is the law of the Brownian\nbridge between x and y of length t and the corresponding law P↑,t\n0,0 is the law of a Brownian\nexcursion of length t. In this context, our next result is an extension to Lévy processes of\nthe classical result of Durrett, Iglehart and Miller [13], which covers the Brownian case.\nCorollary 1. The conditional law of (Xs , s ≤ t) under Pt0,0 given X t > −ε, where\nX t = inf Xs ,\ns≤t\n\nconverges weakly, as ε → 0 to P↑,t\n0,0 .\nThe Brownian case of Corollary 1 was first proved by Durrett, Iglehart and Miller\n[13] by showing the convergence of finite-dimensional distributions and then tightness,\nwhich follows from explicit computations with Brownian densities. Another proof for\nthe Brownian case was given by Blumenthal [3] this time using rescaling, random time\nchange and simple infinitesimal generator computations. For us, Corollary 1 is a simple\nconsequence of Theorem 1.\nWe now present a generalization of a decomposition of the Brownian trajectory at the\ntime it reaches its minimum on a given interval due to Denisov [11].\nLet ρt be the first time that X reaches its minimum on the interval [0, t]. Consider the\npre- and post-minimum processes on the interval [0, t] given by:\nXs← = X(ρt −s)+ − − X t\n\nand Xs→ = X(ρt +s)∧t − X t\n\ndefined for s ≥ 0, where Xs− is the left limit of X at s.\nA Lévy meander of length t (following Chaumont and Doney [7]) is the weak limit as\nε → 0 of X conditioned to remain above −ε on [0, t] under P0 . Lévy meanders can also\nbe characterized by an absolute continuity relationship with Lévy processes conditioned\nto stay positive as recalled in Section 4. Denote by Pme,t the law of a meander of length\nt and by P̂me,t the meander of the dual Lévy process.\nTheorem 2. Assume conditions (K) and (R). Under P0 , the conditional law of\n(X ← , X → ) given ρt is P̂me,ρt ⊗ Pme,t−ρt .\nThe previous result is a consequence of results in Chaumont and Doney [5]. It is our\nstepping stone on the way to our generalization of Vervaat's relationship between the\nBrownian bridge and the normalized Brownian excursion. This extension requires the\nfollowing conditioned version of Theorem 2.\nTheorem 3. A regular conditional distribution of (X ← , X → ) given ρt = s and −X t = y\n↑,t−s\nunder Pt0,0 is P̂↑,s\n0,y ⊗ P0,y .\n\n\f4\n\nG. Uribe Bravo\n\nWe finally turn to an extension of the classical relationship between the Brownian\nbridge between 0 and 0 and the Brownian excursion of the same length.\nTheorem 4. Define the Vervaat transformation V of X on [0, t] by\nVs = X(ρt +s) mod t − X t .\nUnder (K) and (R), the law of V under Pt0,0 is P↑,t\n0,0 .\nTheorem 4 was found by Vervaat [23] for Brownian motion and proved there using\napproximation by a simple random walk. Biane [2] gives a proof using excursion theory\nfor Brownian motion. Then Chaumont [4] gave a definition of normalized stable excursion\nand proved Theorem 4 in the case of stable Lévy processes, again using excursion theory.\nThis extension of Vervaat's theorem is the closest to the one in this work. Miermont\n[18] gives a version of Theorem 4 for spectrally positive Lévy processes in the context of\nthe intensity measures for excursions above the cumulative minimum, with an explicit\nlink with the Lévy process conditioned to stay positive. Finally, Fourati [14] gives an\nabstract version of Theorem 4 for Lévy processes, again as a relation between two σfinite measures which can be though of as bridges of random length, although there is\nno explicit link with Lévy processes conditioned to stay positive. After establishing this\nlink, Theorem 4 would follow from the theory developed in Fourati [14] using regularity\nresults for bridges (like weak continuity) in order to condition by the length. Instead of\nthat, we propose a direct proof.\nThe paper is organized as follows. In Sections 2 and 3, we review the construction\nof Markovian and Lévy bridges of Chaumont and Uribe Bravo [9]. In Section 4, we\ndefine, following Chaumont and Doney [5], Lévy processes conditioned to stay positive\nand meanders. Section 5 is devoted to the construction of bridges of Lévy processes\nconditioned to stay positive, where we prove Theorem 1 and Corollary 1. In Section\n6, we consider extensions and consequences of Denisov's theorem, proving in particular\nTheorems 2 and 3. Finally, in Section 7, we prove our extension of Vervaat's theorem,\nwhich is Theorem 4.\n\n2. Weakly continuous bridges of Markov processes\nLet Px be the law of a Feller process which starts at x which is an element of a polish\nspace S (for us either R, (0, ∞), or [0, ∞)). Suppose P is its semigroup and assume that:\n(AC) There is a σ-finite measure μ and a function ht (x, *) such that\nZ\nPt f (x) = f (y)ht (x, y)μ(dy).\n(C) The function (s, x, y) 7→ hs (x, y) is continuous.\n\n\f5\n\nBridges of Lévy processes conditioned to stay positive\n(CK) The Chapman–Kolmogorov equations\nZ\nhs+t (x, z) = hs (x, y)ht (y, z)μ(dy)\nare satisfied.\nLet us denote by Bδ (y) the ball of radius δ centered at y and\nPx,t = {y ∈ S: ht (x, y) > 0}.\n\nTheorem 5 (Chaumont and Uribe Bravo [9]). Under (AC), (C) and (CK), the law\nof X on [0, t] under Px given Xt ∈ Bδ (y) converges weakly in the Skorohod J1 topology\nto a measure Ptx,y for every y ∈ Px,t . Furthermore:\n1. The family {Ptx,y : y ∈ Px,t } is a regular conditional distribution for X on [0, t]\ngiven Xt under Px .\n2. The finite-dimensional distributions of Ptx,y are given by\nPtx,y (Xt1 ∈ dx1 , . . . , Xtn ∈ dxn )\n= ht1 (x, x1 )ht2 (x1 , x2 ) * * * htn −tn−1 (xn−1 , xn )\n\nht−tn (xn , y)\ndx1 * * * dxn .\nht (x, y)\n\n3. As y ′ → y and x′ → x, Ptx′ ,y′ converges weakly to Ptx,y .\nRemark. The finite-dimensional distributions of the bridge laws can be written succinctly using the following local absolute continuity condition valid for s < t:\nPtx,t |Fs =\n\nht−s (Xs , y)\n* Px |Fs .\nht (x, y)\n\n(2.1)\n\nThe reasoning in Revuz and Yor [21], Chapter VIII, implies that for any stopping time\nT taking values in [0, t):\nPtx,t |FT =\n\nht−T (XT , y)\n* Px |FT .\nht (x, y)\n\n(2.2)\n\n3. Lévy processes and their bridges\nLet Px be the Markovian family of a Lévy process which satisfies assumptions (K) and\n(R). As argued by Kallenberg [16], Fourier inversion implies that Xt possesses continuous\nand bounded densities which vanish at infinity (by the Riemann-Lebesgue lemma) for\nall t > 0. Actually, (K) also implies that the continuous version ft of the density of Xt\nunder P0 satisfies a form of the Chapman–Kolmogorov equations:\nZ\nft (x) = fs (y)ft−s (x − y) dy\nfor 0 < s < t.\n(3.1)\n\n\f6\n\nG. Uribe Bravo\n\nFrom ft one can build a bi-continuous transition density pt by means of pt (x, y) = ft (y −\nx) which satisfies (AC), (C) and (CK).\nUnder hypotheses (K) and (R), Sharpe [22] shows that ft is strictly positive for all\nt > 0, which implies that pt > 0.\nFrom Theorem 5, we see that under (K) and (R), we can consider the bridges Ptx,y\nfrom x to y of length t for any x, y ∈ R and any t > 0, and that these are jointly weakly\ncontinuous in x and y.\n\n4. Lévy processes conditioned to stay positive and\nmeanders\nThe most general construction for Lévy processes conditioned to stay positive, now recalled, is from Chaumont and Doney [5] (see Chaumont and Doney [6] for a correction\nand Doney [12] for a lecture note presentation). When the initial state is positive, it is a\nDoob transformation of Px by a procedure we now detail. Let\nX t = min Xs\ns≤t\n\nand consider the Markov process R = X − X. Under (R), 0 is regular state of R for itself\nand so we can consider the local time at zero L of R. We can then define the downwards\nladder height process H of X by\nH = −X ◦ L,\nwhich is a (possibly killed) subordinator (cf. Bertoin [1] or Doney [12]). Let h be the\nrenewal function of H given by\n\u0012Z ∞\n\u0013\nh(x) = E\n1Hs ≤x ds .\n0\n\nFor x > 0, let Qx be the law of x + X under P killed when it leaves (0, ∞), which is a\nMarkov process on (0, ∞) whose semigroup is denoted Q = (Qt , t ≥ 0). Chaumont and\nDoney [5] prove that if X drifts to −∞ (limt→∞ Xt = −∞ almost surely) then h is\nexcessive and otherwise h is invariant for Qt and proceed to define the semigroup Pt↑ by\nPt↑ (x, dy) =\n\nh(y)\nQt (x, dy)\nh(x)\n\nfor x > 0.\n\nThe Markovian laws P↑x , x > 0, define the Lévy process conditioned to stay positive. Note\nthat X has finite lifetime under P↑x if and only if X drifts to −∞ under Px . Under\nhypothesis (R), Chaumont and Doney [5] prove that P↑x has a weak limit (in the Skorhod\nJ1 topology) as x → 0, denoted P↑0 , and that (P↑x )x≥0 is Markovian and has the Feller\nproperty.\nWe now give an alternate definition of the meander, from which one can justify the\nweak limit construction we have alluded to (cf. Chaumont and Doney [7], Lemma 4).\n\n\f7\n\nBridges of Lévy processes conditioned to stay positive\n\nA Lévy meander is a stochastic process whose law Pme,t satisfies the following absolute\ncontinuity relationship with respect to the law P↑0 on Ft = σ(Xs : s ≤ t):\n\u0013\n\u0012\n1\n1\n↑\n↑\nPme,t |Ft =\n.\nwith\nβ\n=\nE\n*\nP\n|\nt\nF\n0\n0 t\nβt h(Xt↑ )\nh(Xt↑ )\n\n5. Bridges of Lévy processes conditioned to stay\npositive\nWe now construct the bridges of a Lévy process conditioned to stay positive under hypotheses (K) and (R). This is done through Theorem 5 by verifying the existence of a\ncontinuous version of their densities (cf. Lemma 3). For positive arguments, the density\nis constructed from the density of the killed Lévy process, a continuous version of which\nis constructed using bridges of the Lévy process itself in Lemma 2. Then, a delicate\npoint is to study the densities at 0; this requires the following duality lemma. Let P̂x be\nthe law of x − X and let P̂t be its semigroup. We can also consider the objects ĥ, P̂↑x ,\netc. . . associated with −X instead of X as well as p̂.\nLemma 1. The semigroups Pt↑ and P̂t↑ are in duality with respect to the measure λ↑\ngiven by\nλ↑ (dx) = h(x)ĥ(x) dx.\nProof. Since Pt and P̂t are in duality with respect to Lebesgue measure λ, it follows\nthat Qt and Q̂t are also in duality with respect to λ.\nHence, we get\nZ\nZ\nZ\nZ\nQt (gh)\n↑\n↑\nhĥ dλ = Q̂t (f ĥ)gh dλ = P̂t↑ (f )ghĥ dλ\nf Pt (g) dλ = f\nh\nZ\n= P̂t↑ (f )g dλ↑ .\n\u0003\nWe now consider the absolute continuity of the semigroup of X killed when it becomes\nnegative.\nLemma 2. Under (K) and (R), let\nqt (x, y) = Etx,y (X t > 0)pt (x, y)\n\nfor x, y > 0.\n\n(5.1)\n\nThen qt is a transition density for Qt with respect to Lebesgue measure which is continuous, strictly positive, bounded by p, satisfies the Chapman–Kolmogorov equations, and\nwhich satisfies the following duality formula:\nqt (x, y) = q̂t (y, x).\n\n\f8\n\nG. Uribe Bravo\n\nRemark. It is simple to see that the absolute continuity of Pt (x, *) translates into absolute continuity of Qt (x, *) since if A has Lebesgue measure zero then\nQt (x, A) = Px (Xt ∈ A, X t > 0) ≤ Px (Xt ∈ A) = 0.\nWhat is more difficult, is to see that the q is strictly positive; similar results have been\nobtained in the literature for killed (multidimensional) Brownian motion and stable Lévy\nprocesses in Hunt [15], Chen and Song [10], Vondraček [24]. Our proof of uses the weakly\ncontinuous Markovian bridges provided by Theorem 5. The almost sure positivity of q\ncan also be obtained from Theorem 4 of Pitman and Uribe Bravo [20].\nProof of Lemma 2. Conditioning on Xt , we see that\nEx (1X t >0 f (Xt )) = Ex [Ptx,Xt (X t > 0)f (Xt )]\nZ\n= Ptx,y (X t > 0)f (y)pt (x, y)λ(dy)\nfor measurable and bounded f . On the other hand, the definition of the law Qt gives\nZ\nEx (1X t >0 f (Xt )) = Qx (f (Xt )) = f (y)Qt (x, dy)\nso that q is a transition density of Q with respect to Lebesgue measure.\nWe know that p is continuous. To see that q is continuous, it suffices to apply the\nportemanteau theorem. Note that the boundary ∂{X t > 0} of {X t > 0} has Ptx,y -measure\nzero. Indeed, since the minimum on [0, t] is a continuous functional on Skorohod space\n(cf. Whitt [25], Section 13.4):\n∂{X t > 0} ⊂ {Xs ≥ 0 for all s ∈ [0, t] and there exists s ∈ [0, t] such that Xs = 0}.\nSince x, y > 0 and under Ptx,y we have X0+ = x and Xt− = y almost surely, we see that\nthe process cannot touch zero at times 0 or t. However, using the local absolute continuity\nrelationship (2.2) at the first time T such that XT = 0, we see that Ptx,y (∂{X t > 0} = 0)\nas soon as\nPx (Touching zero on (0, t) and staying nonnegative) = 0,\nwhich is true since 0 is regular for (−∞, 0).\nTo prove the duality formula for q, we first Proposition II.1 of Bertoin [1], which\nproves that pt (x, y) = p̂t (y, x) for almost all x and y and remove the almost all qualifier\nby continuity. Next, Corollary II.3 of Bertoin [1] proves that for almost all x and y the\nimage of Ptx,y under the time reversal operator is P̂ty,x , which by weak continuity of\nbridge laws can be extended to every x and y. Since the event X t is invariant under time\nreversal, we see that\nqt (x, y) = Etx,y (X t > 0)pt (x, y) = Êty,x (X t > 0)p̂t (y, x) = q̂t (y, x).\n\n\f9\n\nBridges of Lévy processes conditioned to stay positive\n\nBy definition, we see that q ≤ p almost everywhere, and so continuity implies that q\nis bounded by p everywhere; this will help us prove that q satisfies the (CK) equations.\nIndeed, the Markov property implies that\nZ\nqt+s (x, z) = qs (x, y)qt (y, z)λ(dy)\nfor λ-almost all z.\n(5.2)\nSince\n0 ≤ qs (x, y)qt (y, z) ≤ ps (x, y)pt (y, z)\nand\nZ\n\nps (x, y)pt (y, z)λ(dz) = pt+s (x, z),\n\nwhich is continuous in z, the generalized dominated convergence theorem tells us that\nZ\nz 7→ qs (x, y)qt (y, z)λ(dy)\nis continuous (on (0, ∞)). Because both sides of (5.2) are continuous, we can change the\nalmost sure qualifier to for all z.\nIt remains to see that qt (x, y) > 0 if x, y, t > 0. We first prove that for any x, y, t > 0, if\nδ > 0 is such that Bδ (y) ⊂ (0, ∞), then\nQt (x, Bδ (y)) > 0.\n\n(5.3)\n\nThis is done by employing a technique of Knight [17]. For any s ∈ (0, t), consider the\nprocess (Xrs , r ≤ t) given by\nXrs = X0 + X(r+s) mod t − Xs .\nSince X has independent and stationary increments, then, for any fixed s, the laws of\nX s and (Xr , r ≤ t) coincide under Px for any x ∈ R; this is referred to as the cyclic\nexchangeability property in Chaumont, Hobson and Yor [8]. Note that Xts = Xt ; if s is\nclose to the place where X reaches its minimum on (0, t), then the minimum X st of X s\non the interval [0, t] is positive. Hence, the random variable\nI=\n\nZ\n\n0\n\nt\n\n1X st >0,Xt ∈Bδ (y) ds\n\nis positive on {Xt ∈ Bδ (y)} which has positive probability since pt is strictly positive. On\nthe other hand, from cyclic exchangeability, we can compute:\n0 < Ex (I) =\n\nZ\n\n0\n\nt\n\nPx [X st > 0, Xts ∈ Bδ (y)] ds = tPx [X t > 0, Xt ∈ Bδ (y)] = tQt (x, Bδ (y)),\n\n\f10\n\nG. Uribe Bravo\n\nwhich proves (5.3). To prove positivity of qt , first note that since P̂y almost surely X0+ =\ny, then for s small enough:\nQ̂s (y, Bδ (y)) = P̂y (Xs ∈ Bδ (y), X s > 0) ≥ P̂y (Xr ∈ Bδ (y) for all r ∈ [0, s]) > 0,\nso that, by continuity of qs , there exists an open subset Us of Bδ (y) such that qs (*, y) =\nq̂s (y, *) > 0 on Us . By Chapman–Kolmogorov and (5.3), we see that\nZ\nQt−s (x, dz)qs (z, y) > 0.\nqt (x, y) ≥\n\u0003\nUs\nWe now turn to a similar result for Lévy processes conditioned to stay positive.\nLemma 3. Under (K) and (R), Pt↑ (x, *) is equivalent to Lebesgue measure for all t > 0\nand x ≥ 0. Furthermore, there exists a version of the transition density p↑ which is\ncontinuous, strictly positive, and satisfies the Chapman–Kolmogorov equations.\nTherefore, the density p↑ satisfies the assumptions (AC), (C) and (CK) of Theorem 5.\nProof of Lemma 3. Since the renewal function of a subordinator is positive, continuous\nand finite, we deduce by h-transforms and Lemma 2 that the function\np↑t (x, y) =\n\nqt (x, y)\nh(x)ĥ(y)\n\n,\n\nx > 0, y > 0, t > 0,\n\nis a transition density for P ↑ starting at positive states:\nZ\nPt↑ f (x) = p↑t (x, y)f (y)λ↑ (dy)\nfor x > 0.\nNotice that p↑ so defined is strictly positive, continuous, and satisfies the Chapman–\nKolmogorov equations.\nFor 0 < s < t, consider the function\nZ\n↑s\npt (y) = Ps↑ (0, dx)p↑t−s (x, y) > 0\nfor y > 0.\nOn one hand, Chapman–Kolmogorov implies that for any bounded measurable f :\nZ\nZZ\nZ\n↑\n↑\n↑\n↑\np↑s\n(y)f\n(y)λ\n(dy)\n=\nP\n(0,\ndx)p\n(x,\ny)f\n(y)λ\n(dy)\n=\nPt↑ (0, dy)f (y),\nt\ns\nt−s\n↑\n↑\n′\nso that p↑s\nt is a version of the density of Pt (0, *) with respect to λ and so if 0 < s < s < t\n↑s\n↑s\n↑s′\nthen pt (y) = pt (y) for λ-almost all y. On the other hand, we now see that pt (y) is\n\n\f11\n\nBridges of Lévy processes conditioned to stay positive\n\na continuous function of y, so that actually, the almost sure qualifier can be dropped.\nIndeed, since\nMt−s := sup pt−s (x, y) < ∞\nx,y\n\nand from Chaumont and Doney [5]\nβs := P↑0 (1/h(Xs )) < ∞,\ncontinuity of p↑s\nt follows from the dominated convergence theorem.\nWe can now define\np↑t (0, y) = p↑s\nt (y),\n\ny > 0,\n\nfor any s ∈ (0, t). Since p↑t (0, y) is continuous for y ∈ (0, ∞), and is a version of the density\nof Pt↑ (0, *), the Markov property implies:\nZ\np↑t+s (0, y) = p↑t (0, x)p↑s (x, y)λ↑ (dx).\nFurthermore, we have the bound\np↑t (0, y) ≤ βs Mt−s /ĥ(y)\n\nfor y > 0.\n\nWe now provide an uniform bound for the transition density in the initial state. Recall\nthat pt (x, y) → 0 as x → ∞. Since qt ≤ pt , then p↑t (x, y) → 0 as x → ∞ for any t > 0 and\ny > 0. Choose now any s ∈ (0, t). By Chapman–Kolmogorov:\nZ\np↑t (x, z) = p↑s (x, y)p↑t−s (y, z)λ↑ (dy)\n≤\n\nZ\n\np↑s (x, y)\n\nMt−s\n\nh(y)ĥ(z)\n\u0013\n\u0012\nMt−s\n1\n.\n≤ E↑x\nh(Xs ) ĥ(z)\n\nλ↑ (dy)\n\n1\n) is continuous on (0, ∞), hence bounded on compact subsets of\nNote that x 7→ E↑x ( h(X\ns)\n(0, ∞). Continuity at zero is proved in Corollary 1 of Chaumont and Doney [6]. Hence,\nwe obtain\n\nsup p↑t (x, y) < ∞\n\nfor all y > 0 and t > 0.\n\nx≥0\n\nWe now prove that\nlim p↑t (x, y) = p↑t (0, y)\n\nx→0\n\nfor y > 0.\n\n(5.4)\n\n\f12\n\nG. Uribe Bravo\n\nIndeed, from the Chapman–Kolmogorov equations\nZ\n↑\npt (x, z) = p↑t−s (y, z)Ps↑ (x, dy).\nNote that Ps↑ (x, *) converges weakly to Ps↑ (0, *) as x → 0 and that p↑t−s (*, z) is continuous\nand bounded on (0, ∞), which is the support of Ps↑ (0, *).\nBy applying the above arguments to the dual process, we can define p↑t (x, 0) as p̂↑t (0, x)\nand note that\nlim p↑t (x, y) = p↑t (x, 0)\n\ny→0\n\nfor x > 0.\n\nWe can now define\np↑,s\nt (0, 0) =\n\nZ\n\np↑s (0, y)p↑t−s (y, 0)λ↑ (dy).\n\nTo show that the above definition does not depend on s, we now show that limz→0 p↑t (0, z) =\np↑,s\nt (0, 0). By Chapman–Kolmogorov, we get\nZ\np↑t (0, z) = p↑s (0, y)p↑t−s (y, z)λ↑ (dy).\nWe know that p↑t−s (y, z) converges to p↑t−s (y, 0) as z → 0. Dominated convergence, which\napplies because of the bound\np↑t−s (y, z) ≤ C/h(y),\nthen implies\nlim\n\nz→0\n\np↑t (0, z) =\n\nZ\n\np↑s (0, y)p↑t−s (y, 0)λ↑ (dy),\n\nwhich shows that we can define p↑t (0, 0) = p↑,s\nt (0, 0), and we have\nlim p↑t (0, z) = p↑t (0, 0)\n\nz→0\n\nlim p↑t (x, 0) = p↑t (0, 0).\n\nand by duality\n\nx→0\n\nFinally, we will prove that\nlim p↑t (x, z) = pt (0, 0).\n\nx,z→0\n\nTake xn , zn → 0 and write\nlim sup|p↑t (xn , zn ) − p↑t (0, 0)|\nn\n\n≤ lim sup|p↑t (xn , zn ) − p↑t (xn , 0)| + lim sup|p↑t (xn , 0) − p↑t (0, 0)|\nn\n\n≤ lim sup\nn\n\nn\n\nZ\n\nPs↑ (xn , dy)|p↑t−s (y, zn ) − p↑t−s (y, 0)|.\n\n\fBridges of Lévy processes conditioned to stay positive\n\n13\n\nSince Ps↑ (xn , *) weakly to Ps↑ (0, *) and\n|p↑t−s (y, zn ) − p↑t−s (y, 0)| ≤ C/h(y),\nwhere C is a finite constant, we obtain the desired result.\n\n\u0003\n\nThe main result of this section is the construction of weakly continuous bridges for the\nLévy process conditioned to stay positive. Indeed, by applying Theorem 5 and Lemma\n3, we obtain Theorem 1.\nThe proof of Corollary 1 is simple from Theorem 1 and the following remarks. First, we\nt\nnote that the finite-dimensional distributions of the bridges P↑,t\nx,y and Qx,y are identical\nif x, y, t > 0 (because we have an h-transform relationship between Qx and P↑x for x > 0).\nt\nNext, note that the law of X − ε under Qtε,ε = P↑,t\nε,ε is precisely that of P0,0 conditioned on\n↑,t\nX t > −ε. Finally, since the laws Px,y are weakly continuous, Corollary 1 is established.\n\n6. An extension of the Denisov decomposition of the\nBrownian trajectory\nWe now turn to the extension of the Denisov decomposition of the Brownian trajectory\nof Theorem 2.\nProof of Theorem 2. We will use Lemma 4 in Chaumont and Doney [7], which states\nthat if xn → 0 and tn → t > 0 then the law of (Xs , s ≤ tn ) conditionally on X tn > 0 under\nPxn converges as n → ∞ in the sense of finite-dimensional distributions to Pme,t when 0\nis regular for (0, ∞). (This was only stated in Chaumont and Doney [7] for fixed t and\nfollows from Corollary 2 in Chaumont and Doney [5]. However, the arguments, which are\nactually found in Chaumont and Doney [6], also apply in our setting.)\nFix t > 0. Since 0 is regular for both half-lines, X reaches its minimum X t on the\ninterval [0, t] continuously at an unique place ρt , as proved in Propositions 2.2 and 2.4\nof Millar [19]. Let\nρnt = ⌊ρt 2n ⌋/2n\nand note that\nXt =\n\nmin\n\nn\nn\ns∈[ρn\nt ,ρt +1/2 ]\n\nXs .\n\nFor continuous and bounded f : R → R and functions F of G of the form h(Xt1 , . . . , Xtm )\nfor some t1 , . . . , tm ≥ 0 and continuous and bounded h, we will compute the quantity\nE0 (F (X*∧ρn )f (ρn )G(X(ρn +1/2n +*)∧t − Xρn )).\nThis is done by noting the decomposition\n{ρnt = k/2n } = Ak,n ∩ Bk,n ,\n\n\f14\n\nG. Uribe Bravo\n\nwhere\nAk,n = {mk,n ≤ Xs for s ≤ k/2n },\nBk,n = {mk,n ≤ Xs for s ∈ [(k + 1)/2n , t]}\nand\nmk,n =\n\ninf\n\nr∈[k/2n ,(k+1)/2n ]\n\nXr .\n\nApplying the Markov property at time (k + 1)/2n we obtain\nE0 (F (X*∧ρn )f (ρn )G(X(ρn +1/2n +*)∧t − mk,n )1ρn =k/2n )\n= E0 (F (X*∧ρn )f (ρn )H(t − (k + 1)/2n , X(k+1)/2n , X (k+1)/2n )1Ak,n ),\nwhere\nH(s, x, y) = Ex (G(X s − y)1X s >y ) = Ex−y (G(X s )1X s >0 ).\nBy reversing our steps, we obtain\nE0 (F (X*∧ρn )f (ρn )H(t − (k + 1)/2n , X(k+1)/2n , X (k+1)/2n )1Ak,n )\n= E0 (F (X*∧ρn )f (ρn )H̃(t − (k + 1)/2n , X(k+1)/2n , X (k+1)/2n )1ρnt =k/2n ),\nwhere\nH̃(s, x, y) = Ex−y (G(X s ) |X s > 0).\nBy the continuity assumptions of f, F and G we can pass to the limit using the\nChaumont–Doney lemma to get\nE0 (F (X*∧ρt )f (ρt )G(X → )) = E0 [F (X*∧ρt )f (ρt )Eme,t−ρt (G)].\nBy time reversal at t, we see that\nE0 (F (X ← )f (ρt )G(X → )) = E0 [Ême,ρt (F )f (ρt )Eme,t−ρt (G)].\n\n\u0003\n\nWe now establish a Denisov-type decomposition for bridges of Lévy processes.\nProof of Theorem 3. Since 0 is regular for (−∞, 0) under P0 , using local absolute\ncontinuity between Pt0,0 and P0 we see that X t < 0 and ρt > 0 almost surely under Pt0,0 .\nTime reversal and regularity of 0 for (0, ∞) proves that ρt < t almost surely under Pt0,0 .\nFrom the absolute continuity relationship between the meander and the Lévy process\nconditioned to stay positive, we see that P↑,t\n0,x is a regular conditional probability of X\ngiven Xt = x under Pme,t . Hence, Theorem 2 allows the conclusion\n↑,ρt\n↑,ρt\nE0 (F1 (X ← )f (ρt )g(X t , Xt )F2 (X → )) = E0 [Ê0,−X\n(F1 )f (ρt )g(X t , Xt )Ê0,X\n(F2 )].\nt −X\nt\n\nt\n\n\f15\n\nBridges of Lévy processes conditioned to stay positive\nHence, we see that for every continuous and bounded f, g1 , g2 , F1 , F2 :\nZ\nEt0,x [F1 (X ← )f (ρt )g1 (X t )F2 (X → )]g2 (x)pt (0, x) dx\n=\n\nZ\n\n↑,ρt\n↑,ρt\nEt0,x [Ê0,X\n(F1 )f (ρt )g1 (X t )E0,X\n(F2 )]g2 (x)pt (0, x) dx.\nt\n\nt\n\nSince both integrands are continuous because of weak continuity of the bridge laws (of\nthe Lévy process, its dual, and their conditioning to remain positive), we see that\n↑,ρt\n↑,ρt\n(F1 )f (ρt )g1 (X t )E0,X\n(F2 )].\nEt0,0 (F1 (X ← )f (ρt )g1 (X t )F2 (X → )) = Et0,0 [Ê0,X\nt\n\nt\n\n\u0003\n\nTheorems 2 and 3 imply the following corollary.\nCorollary 2. The joint law of (ρt , X t , Xt ) under P0 admits the expression\nP0 (ρt ∈ ds, −X t ∈ dy, Xt − X t ∈ dz) = P0 (ρt ∈ ds)P̂me,s (Xs ∈ dy)Pme,t−s (Xt−s ∈ dz).\nThe joint law of (ρt , X t ) under Pt0,0 admits the expression\nPt0,0 (ρt ∈ ds, −X t ∈ dy) =\n\nP0 (ρt ∈ ds) me,s\nP̂\n(Xs ∈ dy)Pme,t−s (Xt−s ∈ dy).\npt (0, 0)\n\n7. An extension of Vervaat's theorem\nIn this section, we prove Theorem 4.\nProof of Theorem 4. Let λt be Lebesgue measure on (0, t); we will work under the\nlaw P↑,t\n0,0 ⊗ λt and we keep the notation X for the canonical process (which is now defined\non the product space Ω × (0, t)) and U will be the projection in the second coordinate of\nthis space. Then a regular version of the law of Xr∧U , r ≥ 0, and X(U+r)∧t , r ≥ 0, given\n↑,t\nU = u and XU = y is P↑,t\n0,y ⊗ Py,0 and the law of (U, XU ) admits the following density:\n(u, y) 7→\n\np↑s (0, y)p↑t−s (y, 0)\nt * p↑t (0, 0)\n\ndu λ↑ (dx).\n\nOn the other hand, the Vervaat transformation of X is the concatenation of X →\nfollowed by the time-reversal of X ← at ρt ; under Pt0,0 , the joint law of (X → , X ← ) given\n↑,t−s\nρt = t − s and X t = y is P↑,s\n0,y ⊗ Py,0 .\nWe finish the proof by identifying the law of (t − ρt , X t ) under Pt0,0 with that of (U, XU )\nunder P↑,t\n0,0 × λ1 . Indeed, by Corollary 2, a version of the density with respect to Lebesgue\nmeasure of (t − ρt , −X t ) at (s, y) is\nP0 (ρt ∈ t − ds)p↑t−s (0, y)p↑s (y, 0)h(y)ĥ(y)\npt (0, 0)β̂t−s βs\n\n.\n\n\f16\n\nG. Uribe Bravo\n\nHowever, by the Chapman–Kolmogorov equations we can obtain the marginal density of\nρt under Pt0,0 at u:\nP0 (ρt ∈ t − ds)p↑t (0, 0)\npt (0, 0)β̂t−s βs\n\n.\n\nSince ρt has an uniform law under Pt0,0 as proved in Knight [17], then, actually the above\nexpression is almost surely equal to 1/t so that a joint density of (ρt , X t ) under Pt0,0 is\n(u, y) 7→\n\np↑s (0, y)p↑t−s (y, 0)\nt * p↑t (0, 0)\n\ndu λ↑ (dy).\n\n\u0003\n\nNote added in proof\nIt has been pointed out to the author that the proof of what we state as Theorem 5\n(taken from reference [9]) has an error. Since we use this theorem to construct our\nbridges, the reader should note that Theorem 5 has a simple proof when the Markov\nprocess in the statement has a Feller dual. This is the case both for Lévy processes and\nfor Lévy processes conditioned to stay positive (thanks to Lemma 1 for the latter), and\nthis ensures the validity of the results in this paper.\n\nAcknowledgements\nThe author would like to thank Loı̈c Chaumont, Pat Fitzsimmons, and Jim Pitman for\nstimulating conversations, information, references which were helpful in developing this\nresearch, and for spotting some obscurities and errors in the paper. Further thanks are\ndue to Jim Pitman who suggested to look for further extensions of Vervaat's theorem and\nperformed the work of an engaging postdoctoral supervisor. Research partially conducted\nat the Department of Statistics of the University of California at Berkeley. Supported by\na postdoctoral fellowship from UC MexUS – CoNaCyt, NSF Grant DMS-08-06118 and\nPAPIIT Grant IN100411.\n\nReferences\n[1] Bertoin, J. (1996). Lévy Processes. Cambridge Tracts in Mathematics 121. Cambridge:\nCambridge Univ. Press. MR1406564\n[2] Biane, P. (1986). Relations entre pont et excursion du mouvement brownien réel. Ann.\nInst. Henri Poincaré Probab. Stat. 22 1–7. MR0838369\n[3] Blumenthal, R.M. (1983). Weak convergence to Brownian excursion. Ann. Probab. 11\n798–800. MR0704566\n[4] Chaumont, L. (1997). Excursion normalisée, méandre et pont pour les processus de Lévy\nstables. Bull. Sci. Math. 121 377–403. MR1465814\n\n\fBridges of Lévy processes conditioned to stay positive\n\n17\n\n[5] Chaumont, L. and Doney, R.A. (2005). On Lévy processes conditioned to stay positive.\nElectron. J. Probab. 10 948–961. MR2164035\n[6] Chaumont, L. and Doney, R.A. (2008). Corrections to: \"On Lévy processes conditioned\nto stay positive\" [Electron J. Probab. 10 (2005) 948–961]. Electron. J. Probab. 13 1–4.\nMR2375597\n[7] Chaumont, L. and Doney, R.A. (2010). Invariance principles for local times at the maximum of random walks and Lévy processes. Ann. Probab. 38 1368–1389. MR2663630\n[8] Chaumont, L., Hobson, D.G. and Yor, M. (2001). Some consequences of the cyclic\nexchangeability property for exponential functionals of Lévy processes. In Séminaire\nde Probabilités, XXXV. Lecture Notes in Math. 1755 334–347. Berlin: Springer.\nMR1837296\n[9] Chaumont, L. and Uribe Bravo, G. (2011). Markovian bridges: Weak continuity and\npathwise constructions. Ann. Probab. 39 609–647. MR2789508\n[10] Chen, Z.Q. and Song, R. (1997). Intrinsic ultracontractivity and conditional gauge for\nsymmetric stable processes. J. Funct. Anal. 150 204–239. MR1473631\n[11] Denisov, I.V. (1983). Random walk and the Wiener process considered from a maximum\npoint. Teor. Veroyatn. Primen. 28 785–788. MR0726906\n[12] Doney, R.A. (2007). Fluctuation Theory for Lévy Processes. Lecture Notes in Math. 1897.\nBerlin: Springer. MR2320889\n[13] Durrett, R.T., Iglehart, D.L. and Miller, D.R. (1977). Weak convergence to Brownian meander and Brownian excursion. Ann. Probab. 5 117–129. MR0436353\n[14] Fourati, S. (2005). Vervaat et Lévy. Ann. Inst. Henri Poincaré Probab. Stat. 41 461–478.\nMR2139029\n[15] Hunt, G.A. (1956). Some theorems concerning Brownian motion. Trans. Amer. Math. Soc.\n81 294–319. MR0079377\n[16] Kallenberg, O. (1981). Splitting at backward times in regenerative sets. Ann. Probab. 9\n781–799. MR0628873\n[17] Knight, F.B. (1996). The uniform law for exchangeable and Lévy process bridges.\nAstérisque 236 171–188. MR1417982\n[18] Miermont, G. (2001). Ordered additive coalescent and fragmentations associated to Levy\nprocesses with no positive jumps. Electron. J. Probab. 6 33 pp. (electronic). MR1844511\n[19] Millar, P.W. (1977). Zero–one laws and the minimum of a Markov process. Trans. Amer.\nMath. Soc. 226 365–391. MR0433606\n[20] Pitman, J. and Uribe Bravo, G. (2012). The convex minorant of a Lévy process. Ann.\nProbab. 40 1636–1674.\n[21] Revuz, D. and Yor, M. (1999). Continuous Martingales and Brownian Motion, 3rd ed.\nGrundlehren der Mathematischen Wissenschaften [Fundamental Principles of Mathematical Sciences] 293. Berlin: Springer. MR1725357\n[22] Sharpe, M. (1969). Zeroes of infinitely divisible densities. Ann. Math. Statist. 40 1503–\n1505. MR0240850\n[23] Vervaat, W. (1979). A relation between Brownian bridge and Brownian excursion. Ann.\nProbab. 7 143–149. MR0515820\n[24] Vondraček, Z. (2002). Basic potential theory of certain nonsymmetric strictly α-stable\nprocesses. Glas. Mat. Ser. III 37 211–233. MR1918106\n[25] Whitt, W. (2002). Stochastic-Process Limits: An Introduction to Stochastic-Process Limits\nand Their Application to Queues. Springer Series in Operations Research. New York:\nSpringer. MR1876437\nReceived March 2012 and revised September 2012\n\n\f"}