{"id": "http://arxiv.org/abs/1109.4535v1", "guidislink": true, "updated": "2011-09-21T14:24:47Z", "updated_parsed": [2011, 9, 21, 14, 24, 47, 2, 264, 0], "published": "2011-09-21T14:24:47Z", "published_parsed": [2011, 9, 21, 14, 24, 47, 2, 264, 0], "title": "Disentangling dark energy and cosmic tests of gravity from weak lensing\n  systematics", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1109.3959%2C1109.4983%2C1109.4781%2C1109.6412%2C1109.6446%2C1109.5599%2C1109.4535%2C1109.0092%2C1109.4435%2C1109.0981%2C1109.1613%2C1109.3635%2C1109.0437%2C1109.2928%2C1109.2670%2C1109.1512%2C1109.4742%2C1109.1432%2C1109.5443%2C1109.1120%2C1109.5648%2C1109.2408%2C1109.4646%2C1109.5462%2C1109.6895%2C1109.2435%2C1109.6865%2C1109.0176%2C1109.3361%2C1109.6572%2C1109.1065%2C1109.0647%2C1109.0384%2C1109.4406%2C1109.3738%2C1109.5263%2C1109.0843%2C1109.2172%2C1109.1016%2C1109.1707%2C1109.1455%2C1109.1358%2C1109.5571%2C1109.3137%2C1109.5817%2C1109.2053%2C1109.5844%2C1109.3331%2C1109.1444%2C1109.5974%2C1109.0559%2C1109.5981%2C1109.6866%2C1109.3021%2C1109.2042%2C1109.3477%2C1109.5082%2C1109.5385%2C1109.0351%2C1109.2540%2C1109.5503%2C1109.0497%2C1109.0623%2C1109.5422%2C1109.4332%2C1109.5384%2C1109.3657%2C1109.2841%2C1109.1530%2C1109.0017%2C1109.6807%2C1109.4296%2C1109.1848%2C1109.0879%2C1109.0162%2C1109.5526%2C1109.5081%2C1109.6418%2C1109.0666%2C1109.6087%2C1109.6676%2C1109.0815%2C1109.0604%2C1109.2054%2C1109.0947%2C1109.5008%2C1109.6323%2C1109.1732%2C1109.2828%2C1109.5906%2C1109.6009%2C1109.5415%2C1109.1548%2C1109.6936%2C1109.2442%2C1109.5377%2C1109.2635%2C1109.6921%2C1109.1248%2C1109.1595%2C1109.0539&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Disentangling dark energy and cosmic tests of gravity from weak lensing\n  systematics"}, "summary": "We consider the impact of key astrophysical and measurement systematics on\nconstraints on dark energy and modifications to gravity on cosmic scales. We\nfocus on upcoming photometric \"Stage III\" and \"Stage IV\" large scale structure\nsurveys such as DES, SuMIRe, Euclid, LSST and WFIRST. We illustrate the\ndifferent redshift dependencies of gravity modifications compared to intrinsic\nalignments, the main astrophysical systematic. The way in which systematic\nuncertainties, such as galaxy bias and intrinsic alignments, are modelled can\nchange dark energy equation of state and modified gravity figures of merit by a\nfactor of four. The inclusion of cross-correlations of cosmic shear and galaxy\nposition measurements helps reduce the loss of constraining power from the\nlensing shear surveys. When forecasts for Planck CMB and Stage IV surveys are\ncombined, constraints on the dark energy equation of state and modified gravity\nmodel are recovered, relative to those from shear data with no systematic\nuncertainties, if fewer than 36 free parameters in total are used to describe\nthe galaxy bias and intrinsic alignment models as a function of scale and\nredshift. To facilitate future investigations, we also provide a fitting\nfunction for the matter power spectrum arising from the phenomenological\nmodified gravity model we consider.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1109.3959%2C1109.4983%2C1109.4781%2C1109.6412%2C1109.6446%2C1109.5599%2C1109.4535%2C1109.0092%2C1109.4435%2C1109.0981%2C1109.1613%2C1109.3635%2C1109.0437%2C1109.2928%2C1109.2670%2C1109.1512%2C1109.4742%2C1109.1432%2C1109.5443%2C1109.1120%2C1109.5648%2C1109.2408%2C1109.4646%2C1109.5462%2C1109.6895%2C1109.2435%2C1109.6865%2C1109.0176%2C1109.3361%2C1109.6572%2C1109.1065%2C1109.0647%2C1109.0384%2C1109.4406%2C1109.3738%2C1109.5263%2C1109.0843%2C1109.2172%2C1109.1016%2C1109.1707%2C1109.1455%2C1109.1358%2C1109.5571%2C1109.3137%2C1109.5817%2C1109.2053%2C1109.5844%2C1109.3331%2C1109.1444%2C1109.5974%2C1109.0559%2C1109.5981%2C1109.6866%2C1109.3021%2C1109.2042%2C1109.3477%2C1109.5082%2C1109.5385%2C1109.0351%2C1109.2540%2C1109.5503%2C1109.0497%2C1109.0623%2C1109.5422%2C1109.4332%2C1109.5384%2C1109.3657%2C1109.2841%2C1109.1530%2C1109.0017%2C1109.6807%2C1109.4296%2C1109.1848%2C1109.0879%2C1109.0162%2C1109.5526%2C1109.5081%2C1109.6418%2C1109.0666%2C1109.6087%2C1109.6676%2C1109.0815%2C1109.0604%2C1109.2054%2C1109.0947%2C1109.5008%2C1109.6323%2C1109.1732%2C1109.2828%2C1109.5906%2C1109.6009%2C1109.5415%2C1109.1548%2C1109.6936%2C1109.2442%2C1109.5377%2C1109.2635%2C1109.6921%2C1109.1248%2C1109.1595%2C1109.0539&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We consider the impact of key astrophysical and measurement systematics on\nconstraints on dark energy and modifications to gravity on cosmic scales. We\nfocus on upcoming photometric \"Stage III\" and \"Stage IV\" large scale structure\nsurveys such as DES, SuMIRe, Euclid, LSST and WFIRST. We illustrate the\ndifferent redshift dependencies of gravity modifications compared to intrinsic\nalignments, the main astrophysical systematic. The way in which systematic\nuncertainties, such as galaxy bias and intrinsic alignments, are modelled can\nchange dark energy equation of state and modified gravity figures of merit by a\nfactor of four. The inclusion of cross-correlations of cosmic shear and galaxy\nposition measurements helps reduce the loss of constraining power from the\nlensing shear surveys. When forecasts for Planck CMB and Stage IV surveys are\ncombined, constraints on the dark energy equation of state and modified gravity\nmodel are recovered, relative to those from shear data with no systematic\nuncertainties, if fewer than 36 free parameters in total are used to describe\nthe galaxy bias and intrinsic alignment models as a function of scale and\nredshift. To facilitate future investigations, we also provide a fitting\nfunction for the matter power spectrum arising from the phenomenological\nmodified gravity model we consider."}, "authors": ["Istvan Laszlo", "Rachel Bean", "Donnacha Kirk", "Sarah Bridle"], "author_detail": {"name": "Sarah Bridle"}, "author": "Sarah Bridle", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1111/j.1365-2966.2012.20994.x", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1109.4535v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1109.4535v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "18 pages, 8 figures", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1109.4535v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1109.4535v1", "journal_reference": null, "doi": "10.1111/j.1365-2966.2012.20994.x", "fulltext": "Mon. Not. R. Astron. Soc. 000, 1–18 (2009)\n\nPrinted October 13, 2018\n\n(MN LATEX style file v2.2)\n\nDisentangling dark energy and cosmic tests of gravity from\nweak lensing systematics\n\narXiv:1109.4535v1 [astro-ph.CO] 21 Sep 2011\n\nIstvan Laszlo1, Rachel Bean1, Donnacha Kirk2, Sarah Bridle2\n\n1 Department\n2 Department\n\nof Astronomy, Cornell University, Ithaca, NY 14853, USA\nof Physics & Astronomy, University College London, Gower Street, London, WC1E 6BT, UK\n\nOctober 13, 2018\n\nABSTRACT\n\nWe consider the impact of key astrophysical and measurement systematics on constraints on dark energy and modifications to gravity on cosmic scales. We focus on\nupcoming photometric \"Stage III\" and \"Stage IV\" large scale structure surveys such\nas DES, SuMIRe, Euclid, LSST and WFIRST. We illustrate the different redshift\ndependencies of gravity modifications compared to intrinsic alignments, the main astrophysical systematic. The way in which systematic uncertainties, such as galaxy bias\nand intrinsic alignments, are modelled can change dark energy equation of state and\nmodified gravity figures of merit by a factor of four. The inclusion of cross-correlations\nof cosmic shear and galaxy position measurements helps reduce the loss of constraining power from the lensing shear surveys. When forecasts for Planck CMB and Stage\nIV surveys are combined, constraints on the dark energy equation of state and modified gravity model are recovered, relative to those from shear data with no systematic\nuncertainties, if fewer than 36 free parameters in total are used to describe the galaxy\nbias and intrinsic alignment models as a function of scale and redshift. To facilitate\nfuture investigations, we also provide a fitting function for the matter power spectrum\narising from the phenomenological modified gravity model we consider.\nKey words: cosmology: gravitational lensing: weak – dark energy – equation of state\n– cosmological parameters – large-scale structure of Universe\n\n1\n\nINTRODUCTION\n\nUpcoming large scale structure surveys promise to provide\ndeep and wide angular scale measurements of both the distribution of luminous matter, through galaxy position surveys, and the total matter distribution, through weak lensing\nshear measurement. These include the ground-based KIloDegree Survey (KIDS), Pan-STARRS 1 , Subaru Measurement of Images and Redshifts (SuMIRe) 2 the Dark Energy Survey (DES) 3 and the Large Synoptic Survey Telescope (LSST) 4 , and prospective space-based Euclid5 and\nWFIRST6 surveys. The expectation is that these will support a significant improvement in constraints on the effect\nof dark energy on the growth of cosmic structure.\nThere has been an active discussion of the implications\nof such measurements for constraining cosmological models\n\n1\n2\n3\n4\n5\n6\n\nhttp://pan-starrs.ifa.hawaii.edu\nhttp://sumire.ipmu.jp/en/\nhttp://www.darkenergysurvey.org\nhttp://www.lsst.org\nhttp://sci.esa.int/euclid\nhttp://wfirst.gsfc.nasa.gov\n\nc 2009 RAS\n\nthat might predict growth histories that are distinct from\nthose of the 'vanilla' ΛCDM cosmological model, in which\nthe universe is populated by normal matter, cold dark matter (CDM) and a cosmological constant (Λ) and an evolution determined by General Relativity (GR). Particular\nattention has been given to models arising from large scale\nmodifications of gravity, such as those proposed as alternatives to explain the accelerating expansion of the universe,\nfor example Dvali et al. (2000); Sawicki & Carroll (2005);\nZhang (2006); Amarzguioui et al. (2006); Bean et al. (2007);\nGuo et al. (2006); Movahed et al. (2009); Fang et al. (2008);\nSong et al. (2007); Carvalho et al. (2008); Schmidt et al.\n(2009); Xia (2009); Lombriser et al. (2009); Copeland et al.\n(2006); Jain & Khoury (2010); Capozziello et al. (2011);\nHarko et al. (2011).\nRather than considering a specific theory, one can\nconsider a phenomenological parameterisation for how\nthe gravitational metric perturbations are related to\nthe underlying matter distribution and motion, such\nas was discussed in Ishak et al. (2006); Knox et al.\n(2006); Stabenau & Jain (2006); Kunz & Sapone (2007);\nSong (2006); Laszlo & Bean (2008); Amendola et al.\n(2008); Zhang et al. (2007); Linder (2008); Jain & Zhang\n\n\f2\n\nI. Laszlo, R. Bean, D. Kirk, S. Bridle\n\n(2008); Bertschinger & Zukin (2008); Zhao et al. (2009b);\nSong & Koyama (2009); Thomas et al. (2009); Song & Dore\n(2009); Zhao et al. (2009b); Silvestri & Trodden (2009);\nCaldwell & Kamionkowski (2009); Stril et al. (2010);\nZhao et al. (2009a); Guzik et al. (2010); Reyes et al.\n(2010); Pogosian et al. (2010); Jennings et al. (2011);\nMartinelli et al. (2011); Hwang et al. (2010); Song et al.\n(2010); Daniel et al. (2010); Bean & Tangmatitham (2010);\nZhao et al. (2010); Daniel & Linder (2010); Dossett et al.\n(2011); Camera et al. (2011); Jain (2011); Clifton et al.\n(2011); Linder (2011); Tsujikawa (2010); Beynon et al.\n(2009). One parameterisation in particular is well suited to\ncontrasting information about galaxy positions with weak\nlensing measurements. It specifies how the evolution of the\ntwo scalar metric perturbations in the conformal Newtonian\ngauge, the \"Newtonian potentials\", is distinct from that\npredicted by GR. While galaxy distributions are sensitive\nto just one of the potentials, lensing is sensitive to the sum\nof both.\nCross-correlations between position and lensing observables have been proposed as a source of additional cosmological information by Hu & Jain (2004) and were used in\nBernstein (2009). It has been found that these observables\ncould greatly increase constraining power for modified gravity (MG) theories (Zhang et al. 2007, 2008), however such\ncross-correlations also play an important role in mitigating\ncritical sources of systematic error, in particular the effect\nof intrinsic alignments (IA) on the observed shear signal\nand galaxy bias (Joachimi & Bridle 2010; Kirk et al. 2010;\nZhang 2010).\nHowever, since both an alternative theory of gravity\nand intrinsic alignments qualitatively alter the measured\nshear signal and its correlations with other observables, one\nmight expect this to translate into a degeneracy between\nMG and IA parameters, and a deterioration of cosmological\nconstraints. For example, Zhang et al. (2007) highlight the\nuse of galaxy-shear correlations (galaxy-galaxy lensing) to\nconstrain modified gravity models in the absence of intrinsic alignments, whereas Zhang (2010) proposes the use of\nthe same correlations as a method for measuring intrinsic\nalignments in GR models.\nIn this paper, we characterise and quantify the degeneracies between dark energy parameter measurements\nand weak lensing systematics, and assess how they affect our ability to obtain bounds on the nature of cosmic acceleration and gravity on cosmic scales. In a related\npaper ( D. Kirk, I. Laszlo, S. Bridle and R. Bean 2011), we\ndiscuss how surveys can be optimised in light of intrinsic\nalignment and galaxy bias systematics.\nIntrinsic alignments of galaxies arise from the fact that,\nas large scale structure is assembled, galaxies acquire an intrinsic correlated ellipticity. Cosmic shear is the apparent coherent alignment of galaxies due to gravitational distortions\nby intervening matter. Therefore, if intrinsic alignments are\nnot accounted for then they can be falsely attributed to\nweak lensing and thus contaminate observations. Such intrinsic correlations arise in two forms: an effect from physically close galaxies forming or evolving in the same potential\n(termed II) and a correlation between the apparent shape\nof a distant galaxy lensed by a foreground mass and the\nintrinsic alignment of a foreground galaxy due to the same\nforeground mass (termed GI) (Hirata & Seljak 2004).\n\nIncluding IA effects in a cosmological analysis\nis well motivated; comparing simulations to observations reveals a need for these effects (Croft & Metzler\n2000; Crittenden et al. 2001; Heavens et al. 2000;\nHeymans et al. 2006; Mandelbaum et al. 2006; Hirata et al.\n2007; Okumura et al. 2009; Okumura & Jing 2009;\nFaltenbacher et al. 2009; Pereira & Bryan 2010) and\nalignments have been directly observed in existing large\nscale structure surveys (Brown et al. 2002; Hirata et al.\n2004;\nPereira & Kuhn\n2004;\nMandelbaum et al.\n2005; Agustsson & Brainerd 2006; Hirata et al. 2007;\nMandelbaum et al. 2009; Brainerd et al. 2009; Siverd et al.\n2009; Faltenbacher et al. 2009; Lee 2011; Joachimi et al.\n2010; Lee 2011; Blazek et al. 2011; Hao et al. 2011). At\ntypical redshifts, the intrinsic alignment signal can be about\nten per cent of the cosmic shear signal we want to measure.\nHowever, to measure the dark energy equation of state to\npercent level accuracy, we need to measure the cosmic shear\nsignal itself to a similar accuracy, therefore incorrectly\nignoring the intrinsic alignment signal can lead to biases of\norder tens of percent in the dark energy equation of state\n(Bridle & King 2007). The difficulty in lensing then, even\nfor a perfect instrument, is to separate out the true lensing\nsignal (termed GG) from these intrinsic alignment terms.\nThe II term can be removed by avoiding inclusion\nof physically close galaxy pairs as in King & Schneider\n(2002, 2003); Heymans & Heavens (2003); Takada & White\n(2004). However, no similar simple treatment can be used\nfor GI, since GI depends on line of sight interactions between background alignments and forground lensing, and it\nis precisely the integrated lensing distortion along the line of\nsight that is relevant to the pure weak lensing signal. This\nleaves a contamination that must be handled in order for\nweak lensing to improve in quality even as instrumental errors are being beaten down (Hirata et al. 2007). Recent work\nhas shown that one can remove some IA contamination by\n\"nulling\" (Joachimi & Schneider 2010a,b). This technique\ninvolves a transform of the shear data which downweights\nthe impact of both II and GI terms. Nulling essentially removes information from the survey in order to produce unbiased, but necessarily less tight, constraints. An alternative\napproach is to model the IA and include additional parameters to characterise the uncertainty in the model.\nThere has been some effort centered on producing a\nrobust theoretical model for IA formation and evolution,\nprimarily derived from the Linear Alignment (LA) model\n(Catelan et al. 2001; Hui & Zhang 2002; Hirata & Seljak\n2004; Bridle & King 2007; Lee et al. 2008). These models\nare based on the assumption that elliptical galaxies take\nshapes aligned with those of their parent dark matter haloes,\nwhich themselves respond linearly to the background gravitational tidal field. Spiral galaxies have shapes produced by\ntorques acting on the angular momentum axis of the galaxies and are shown not to produce IAs to first order. The LA\nmodel is a simple model which generates results consistent\nwith GI measurements (Joachimi et al. 2011; Blazek et al.\n2011).\nAlthough the linear alignment model serves as a suitable starting point for generating agreement with observations, there are several complicating factors. IAs are likely to\nbe modified through merger and accretion events as structure forms, and also impacted by additional factors such as\nc 2009 RAS, MNRAS 000, 1–18\n\n\fDisentangling dark energy and cosmic tests of gravity from weak lensing systematics\ncolor, redshift, galaxy type, and luminosity dependence and\none-halo corrections (Hirata et al. 2007; Faltenbacher et al.\n2009; Mandelbaum et al. 2009; Hao et al. 2011; Lee 2011;\nSchneider & Bridle 2010; Kirk et al. 2010; Joachimi et al.\n2011).\nRather than attempt to model each of these complex\neffects directly, we allow for added freedom in the LA model\nby introducing a gridded bias scheme, gridded in scale and\nredshift space, and marginalise over the additional parameters. Including such a scheme to account for uncertainties in\nthe IA amplitude, variation with galaxy type and evolution\neffects, will impact constraints on cosmological parameters\nBernstein (2009); Bridle & King (2007); Kitching & Taylor\n(2010); Joachimi et al. (2011).\nA primary goal of future surveys is to beat down instrumental systematic errors to improve cosmological constraining power. In extracting cosmological constraints, however,\none has to also disentangle astrophysical systematic effects.\nAlong with the effect of baryons on small scales, our ability\nto model the growth of non-linearities in large scale structure and the contamination due to intrinsic alignments are,\nperhaps, the main astrophysical systematic challenges facing\nweak lensing surveys. The formation, evolution as a function\nof redshift and scale, and variation by galaxy type of IAs are\nall relativity unknown. Realistically one might expect that\none will have to extract an understanding of dark energy\nand IAs simultaneously from lensing and galaxy position\ncorrelations, this is particularly so in the context of modified gravity, which affects both the cosmic homogenous expansion and inhomogeneous perturbation growth histories.\nHere we present a detailed analysis of this task at the level\nof a Fisher matrix analysis.\nThe paper is structured as follows: in section 2 we outline the formalism used to describe the cosmological model,\nincluding dark energy parameters to describe modifications\nto ΛCDM in how the homogeneous expansion and growth\nof inhomogeneities evolve. We describe how the large scale\nstructure and CMB surveys are modeled and how we treat\nuncertainties in galaxy bias and intrinsic alignments. In section 3 we present the results of the Fisher matrix investigation and summarise our findings in 4. In an Appendix we\nintroduce a fitting function that allows others to generate\nweak lensing and galaxy position correlations for the modified gravity model we consider here.\n\n2\n\nFORMALISM\n\nIn this section we describe the details of our analytical approach: the cosmological model we use to parameterise dark\nenergy and modifications to gravity is outlined in section 2.1,\nsections 2.2 and 2.3 respectively describe the statistical correlations for large scale structure and CMB observables and\nthe survey specifications we assume. In 2.4 and 2.5 we describe how systematic uncertainties in the galaxy bias model\nand intrinsic alignments are included in the analysis.\n2.1\n\nCosmological model\n\nTheories that suggest a cosmic scale modification to gravity\ncan produce deviations from ΛCDM in both the homogeneous expansion history and the growth of inhomogeneities.\nc 2009 RAS, MNRAS 000, 1–18\n\n3\n\nWe model alterations from ΛCDM in the expansion history\nusing an effective equation of state for the additional physics\nproducing the cosmic acceleration\nw = w0 + wa (1 − a),\n\n(1)\n\nwhere a is the expansion factor, with a = 1 today, and w0\nand wa describe the effective equation of state today and\nits derivative with respect to a respectively (w0 = −1 and\nwa = 0 recover a cosmological constant, Λ.).\nThe Friedmann equation relates the Hubble expansion\nrate, H(a), to the cosmic energy density, ρ(a)\n8πG X\nH 2 (a) =\nρi (a)\n(2)\n3c2 i\n\u0014\n\u0015\nΩm\nΩγ\n−3(1+w0 +wa ) 3wa (1−a)\n= H02\n(3)\n+\n+\nΩ\na\ne\nΛ\na3\na4\nwhere ρi is the homogeneous (background) density of component i, H0 is Hubble's constant, Ωm and Ωγ are the fractional energy densities today in non-relativistic and relativistic matter respectively.\nTo describe the growth of inhomogeneities we use\nthe conformal Newtonian gauge using the notation of\nMa & Bertschinger (1995)\nds2 = −a2 (τ )[1 + 2ψ(x, τ )]dτ 2 + a2 (τ )[1 − 2φ(x, τ )]dx2 (4)\nwhere τ is conformal time, xi are comoving coordinates and\nψ and φ are the Newtonian potentials.\nWe consider a phenomenological parameterisation for\ncosmic scale deviations from GR that employs two functions\nto modify the perturbed Einstein equations. Such modifications have been widely discussed in the literature, both because they are phenomenologically simple, and also because\nthey can be mapped onto predictions for modifications derived from scalar tensor and higher dimensional theories of\ngravity.\nUnlike with the equation of state, notation for these\nmodifications varies widely. Here we write the modified Einstein equations as\nX\nk2 φ = −4πGQa2\nρ i ∆i\n(5)\ni\n\nψ − Rφ\n\n=\n\n−12πGQa\n\n2\n\nX\ni\n\nρi (1 + w)\n\nσi\n.\nk2\n\n(6)\n\nwhere the first, the Poisson equation, comes from a combination of the time-time and time-space Einstein equations, and\nthe second is the anisotropic space-space equation. Here k is\nthe comoving wavenumber, ∆i is the perturbation of component i in the component's rest-frame (the frame in which it\nhas zero peculiar velocity) and σi is its anisotropic stress. ∆i\nis a gauge invariant perturbation, related to a perturbation\nin a general frame, δi , in which the component's peculiar velocity is, vi , by ∆i = δi + 3H(1 + wi )vi /k. In the discussion\nbelow, we focus on density perturbations in CDM, denoted\nby ∆c .\nIn General Relativity the two functions Q = R = 1. The\nfunction Q(k, a) describes the relation between space-space\ngravitational potential perturbation and a matter overdensity through the Poisson equation, creating an effective\ngravitational constant Gef f (k, a) = Q(k, a)G. The second\nfunction R(k, a) modifies the relationship between the two\nNewtonian potentials. In GR, an inequality between these\n\n\f4\n\nI. Laszlo, R. Bean, D. Kirk, S. Bridle\n\ncan only be generated by the presence of relativistic matter, through the presence of anisotropic shear stress. Shear\nstresses are rapidly suppressed in non-relativistic matter,\nand would be extraordinarily difficult to sustain in a fluid\nwith a negative equation of state. As such, R 6= 1 could be\nviewed as a potential smoking gun signal of a modification\nto GR being present. We assume that the fluid equations for\nnormal matter are unaltered and assume that dark energy,\nas a modification of gravity rather than a fluid, does not\ncluster.\nThe growth of overdensities on large and small\nscales have different dependencies on Q and R\nBean & Tangmatitham (2010). On small scales, they\nare purely determined by the peculiar motion during infall,\nψ, proportional to QR,\n2\n ̈ c + H∆\n ̇ c − 3H Ωm (a)QR∆c ≈ 0,\n∆\n2\n\n(7)\n\nwhere H = d ln a/dτ = aH. For late-time, large scale behaviour the degeneracy between Q and R is not present and\nCDM density perturbation evolution is governed by\n ̈ c + H∆\n ̇ c − 3(φ̈ + H(2φ̇ + ψ̇) + (2Ḣ + H2 )ψ) ≈ 0.\n∆\n\n(8)\n\nWe assume that time evolution of the effects of modifications to GR on the growth of inhomogeneities would vary\nin concert with alterations to the background expansion, and\nconsider modifications of the form,\nQ(a)\n\n1 + (Q0 − 1)as\n\n=\n\nR(a)\n\ns\n\n=\n\n1 + (R0 − 1)a .\n\n(9)\n(10)\n\nFor our analysis we fix s = 3 to allow modifications to the\ngrowth of structure to evolve at a comparable rate to the\nonset of an accelerative component in the homogeneous expansion history. We omit any scale dependence in our modifications. Two conditions, Q(a) > 0 and R(a) > −1 are\nimposed to ensure that overdensities remain gravitationally\nattractive and that light is bent towards the lens.\n\nwhere we have assumed that the density perturbation for\nmatter is equivalent to that for CDM\nThe power spectrum for the correlation between fields\nX and Y is related to the source functions by, PXY ≡\nhSX SY i, allowing one to rewrite the angular correlation in\na common form:\nZ χ∞\ndχ\nClXY =\nWX (χ)WY (χ)PXY (kl , χ).\n(14)\nχ2\n0\nThe galaxy and lensing window functions are dependent\non the normalised distribution of galaxy number density in\neach redshift bin i for the relevant survey, ni (χ). We assume\nthe galaxies are distributed according to (Smail et al. 1994)\nwith\n\u0012\n\u00133/2\nz\n2\nn(z) ∝ z exp −\n.\n(15)\nz0\nWe break up the galaxy distribution into Nph photometric\nredshift bins, divided so that they each contain an equal\nnumber of galaxies. The photometric redshifts are measured\nwith accuracy σ(z) = σz0 (1 + z) and could have a potential\nsystematic offset, which we model as a constant within each\nredshift bin, ∆zi . The observed distribution of galaxies in\nbin i is given by\nni (z)\n\nn(z)\n[erf(zi − z + ∆zi ) − erf(zi−1 − z + ∆zi−1 )] (16)\n2\n\n=\n\nThe galaxy and lensing window functions are then given by\ni\nWm\n(χ)\n\nWGi (χ)\n\n=\n\nn̂i (z)\nZ χ∞\n\n=\n\nχ\n\n(17)\nr(χ)r(χ′ − χ)\ndχ n̂i (χ )\n,\nr(χ′ )\n′\n\n′\n\n(18)\n\nwhere r(χ) is the comoving angular diameter distance to comoving distance χ, and n̂i is the normalised number density,\nn̂i (z) = R ∞\n\nni (z)\n.\nni (z)dz\n\n(19)\n\nz=0\n\n2.2\n\nObservables\n\nWe are interested in how well measurements of weak lensing\nshear distortions and galaxy counts, from future surveys,\nwill be able to constrain deviations from ΛCDM. Combining\nthese observables is key to detecting changes in the growth\nhistory of the universe as they depend differently on the\nNewtonian potentials.\nWe characterise each observable by their 2D angular\npower spectrum, Cl , for auto- and cross-correlations between each observable in a given redshift bin. For two fields\nX and Y , Cl , under the Limber approximation, is given by\nZ χ∞\ndχ\nClXY =\nWX (χ)WY (χ)SX (kl , χ)SY (kl , χ) (11)\nχ2\n0\nwhere kl = l/χ, and X, Y ={δ, G} for mass and lensing shear\nfields respectively. WX and SX are the window function and\nsource function associated with the field X, respectively.\nThe source functions for the mass distribution and weak\nlensing shear are\nSδ\n\n=\n\n∆c ,\n\n(12)\n\n2\n\nSG\n\n=\n\n−\n\nk\n(φ + ψ).\n2\n\n(13)\n\nIn relating the observed correlations of galaxies to the\ndark matter correlation functions above, we must account\nfor a bias between dark and luminous matter. This bias is\ndependent on the galaxy type, redshift and environment in a\nway that is poorly understood. We allow for this uncertainty\nby introducing a redshift and scale dependent bias parameter, bg , to relate the auto-correlation of the galaxies to the\nautocorrelation of the mass and an independent, correlation\nparameter, rg , to describe the bias in the cross-correlation\nof luminous matter and the mass. The correlation parameter, rg , would be equal to unity if the galaxies trace the\nmass, and less than unity if there is some stochasticity in\nthe galaxy formation process e.g. see Dekel & Lahav (1999)\nfor a review.\nThe galaxy position auto-correlation and galaxy\nposition-shear cross-correlation are then related to the underlying mass and shear observables by\nPgg (k, χ)\n\n=\n\nb2g (k, χ)Pδδ (k, χ),\n\n(20)\n\nPgG (k, χ)\n\n=\n\nbg (k, χ)rg (k, χ)PδG (k, χ).\n\n(21)\n\nwhere g and δ, denote galaxy and underlying mass observables respectively.\nNote that in modified gravity models the lensing source\nc 2009 RAS, MNRAS 000, 1–18\n\n\fDisentangling dark energy and cosmic tests of gravity from weak lensing systematics\nSurvey Parameters\n\nStage III\n\nStage IV\n\nArea(sq.\n√ deg.)\n2z0\nzmin\nzmax\nNg\nNph\nσz0\nγrms\n\n5000\n0.8\n0.001\n3\n10\n5\n0.07\n0.23\n\n20000\n0.9\n0.001\n3\n35\n10\n0.05\n0.35\n\nThe noise for each survey is modeled as statistical errors\ngiven by\nǫ ǫj\n\nNl i\n\n100\n\n143\n\n217\n\nfsky\nθF W HM (arc min)\nσT (μK)\nσE (μK)\n\n0.8\n10.7\n5.4\n-\n\n0.8\n8.0\n6.0\n11.4\n\n0.8\n5.5\n13.1\n26.7\n\n=\n\nn nj\n\nNl i\n\n=\n\nn ǫj\n\nNl i\n\nTable 1. Summary of the photometric large scale structure survey specifications assumed for the Stage\n√ III and Stage IV survey:\nsurvey area; median survey redshift, 2z0 ; minimum and maximum redshifts observed, zmin and zmax ; number of galaxies, per\nsquare arcminute, Ng ; number of photometric redshift bins, Nph ;\nstandard photometric redshift measurement error at z = 0, σz0 ,\nand the r.m.s. shear measurement error, γrms .\n\nν(GHz)\n\n5\n\nTable 2. CMB survey specifications for a Planck-like survey. We\nmodel this on the temperature, T , and E-mode polarisation specifications from three lowest frequency bands for the Planck HFI\ninstrument.\n\n=\n\n2\nγrms\n,\n2nj\n1\nδij ,\nnj\n\n(25)\n\nδij\n\n(26)\n\n0,\n\n(27)\n\nwhere γrms is the root mean square uncertainty in the shear\nmeasurement of the galaxies and nj is numberPof galaxies\nper steradian in j th photometric redshift bin so i ni = Ng .\nThe survey specifications assumed in our analysis for\nthe Stage III and IV surveys are given in Table 1.\nWe include complementary constraints from temperature (T) and E-mode polarisation (E) measurements from\na Planck-like CMB survey up to l = 3000. As summarised\nin Table 2, we model this by considering the three lowest\nfrequency bands of the Planck HFI instrument, three channels for temperature data and 2 for E mode polarisation,as\ndescribed in the Planck Bluebook 7 . We assume each frequency channel has Gaussian beams of width θF W HM and\nerror in X = T, E of σX , so that the noise in channel c is\ngiven by\n2\n\nNlXX,c\n\n=\n\n(σX,c θF W HM,c )2 el(l+1)θF W HM,c /8 ln(2) ,\n\nand over all channels,\n#−1\n\"\nX \u0010 XX \u0011−1\nNl,c\n.\nNlXX =\n\n(28)\n\n(29)\n\nc\n\nterm and the mass source term must be different\n\u0014\n\u0015\nQ(χ)(R(χ) + 1)\nPδG (k, χ) =\nPδδ (k, χ),\n2\n\u00152\n\u0014\nQ(χ)(R(χ) + 1)\nPδδ (k, χ).\nPGG (k, χ) =\n2\n\n(22)\n(23)\n\nThe growth of the dimensionless power spectrum Pδδ is itself dependent on modified gravity parameters Q and R, as\nsummarised by (7) and (8).\nTo obtain the lensing and galaxy position correlations in\nthe modified gravity scenarios we integrate the full equations\nof motion using a modified version of CAMB (Lewis et al.\n2000).\nTo support other researchers investigating the role of\nmodified gravity models on large scale structure observations, without having to integrate the full perturbation equations, we provide a fitting function in the Appendix for\nthe ratio, rf it (k, z), between a fiducial ΛCDM linear matter\npower spectrum, Pδδ,ΛCDM (k, z) and the one for a modified\ngravity model described in 2.1, parameterised by Q0 , R0 and\ns:\nrf it (k, z; Q0 , R0 , s) ≡\n2.3\n\nPδδ,f it (k, z; Q0 , R0 , s)\n.\nPδδ,ΛCDM (k, z)\n\n(24)\n\nSurvey specifications\n\nWe consider the impact of including IAs on cosmological\nconstraints for a near-term Dark Energy Task Force (DETF)\nAlbrecht et al. (2006) Stage III survey, such as DES or\nSuMIRe, and a longer-term Stage IV survey, such as Euclid, LSST or WFIRST.\nc 2009 RAS, MNRAS 000, 1–18\n\n2.4\n\nIntrinsic Alignments\n\nCosmic shear describes the distortion of the image of a distant galaxy due to the bending of light from that galaxy\nby gravity as it passes massive large-scale structure. For a\ngalaxy in the ith photo-z bin, the observed ellipticity, ǫ, of\nthe galaxy can be written as a sum of three independent\ncontributions: the cosmic shear γG , the intrinsic, non-lensed\nshape of the galaxy, γI , and apparent ellipticity introduced\nthrough instrumental and foreground noise, ǫrnd ,\nǫi (θ)\n\n=\n\ni\nγG\n(θ) + γIi (θ) + ǫirnd (θ).\n\n(30)\n\nThe cosmic shear signal γG is very small, and we cannot\nmeasure directly the intrinsic shear of any individual galaxy.\nTo recover the cosmic shear, therefore, one averages over a\nnumber of galaxies on a small patch on a sky. Assuming\nthat their intrinsic ellipticities are distributed randomly, and\nthat their light passes by similar large scale structure, the\nintrinsic ellipticities cancel in the two-point function, and\nwe are left with the cosmic shear signal.\nIn reality, the assumption that intrinsic ellipticities are\nrandomly distributed on the sky is inaccurate. There are\ntwo strains of intrinsic alignment of galaxy ellipticities, both\narising from the same physics of galaxy formation.\nThe measured weak lensing signal reflects a correlation\nin shapes arising from distant galaxies passing near the same\nforeground gravitational lens. However, if the background\n7\n\nwww.rssd.esa.int/SA/P LAN CK/docs/Bluebook − ESA −\nSCI(2005)1 V 2.pdf\n\n\f6\n\nI. Laszlo, R. Bean, D. Kirk, S. Bridle\n\nimages are already correlated, this boosts the measured signal and gives rise to a systematic deviation in the observed\nshear.\nIn section 2.4.1, we describe the linear alignment\nmodel (Catelan et al. 2001; Hirata & Seljak 2004) we use\nas our basis to describe intrinsic alignment contributions. In this model, galaxies quickly align along the curvature of the gravitational potential. While this model\ndoes provide a reasonable starting point for an overall\nagreement with observations, and thus a suitable baseline for use in our statistical analysis, it neglects known\ncomplicating factors of dependency on galaxy luminosity,\ngalaxy type and redshift, and the effect of post-processing\nof IA in mergers and accretion events (Hirata et al.\n2007; Faltenbacher et al. 2009; Mandelbaum et al. 2009;\nHao et al. 2011; Schneider & Bridle 2010; Joachimi et al.\n2011; Lee 2011; Blazek et al. 2011). In section 2.4.2 we therefore extend beyond the LA model, in an attempt to allow for\nthese effects, through the inclusion of additional non-linear\ncorrections, and scale and redshift dependent bias terms.\n\n2.4.1\n\nThe Linear Alignment Model\n\nThe Linear Alignment (LA) model introduced in\nCatelan et al. (2001); Hirata & Seljak (2004) assumes\nthat galaxies would align with the stretching axis of the\npotential in which they form, so that the intrinsic shear is\nassumed to be\n(1,2)\n\nγI\n\n=−\n\nCf\n(∇2 − ∇2y , ∇x ∇y )ψ(zf ).\n4πG x\n\n(31)\n\nψ(zf ) is the smoothed gravitational potential field sourcing the shear alignments at a primordial redshift, zf ,when\ngalaxy formation occured and Cf is a normalisation determined by matching the model to observations. We take\nzf = 50 here, however we expect zf to be well within the\nmatter dominated era, when the potential ψ remains roughly\nconstant in time and gravity can be well-described by GR, so\nthat the analysis should be largely insensitive to the precise\nvalue of zf assumed.\nThe presence of intrinsic alignments alters the observed\nshear correlations. We denote the measured galaxy shear and\nposition observables by ǫ and n, to distinguish them from\nthe underlying theoretical IA-free shear and position variables, G and g respectively. The observed angular correlation functions for galaxy shear and position, when intrinsic\nalignments are included, are given by\nClǫǫ\nClnǫ\n\n=\n\nClGG + ClGI + ClII ,\n\n(32)\n\n=\n\nClgG\n\n(33)\n\n+\n\nClgI\n\nignoring magnification terms (Joachimi & Bridle 2010).\nThe Intrinsic-Intrinsic (II) alignment correlation applies to physically close galaxies. These form in the same\nlarge-scale gravitational potential and their intrinsic ellipticities tend to align with the field lines of that potential.\nWhen these galaxies are observed on the sky they will tend\nto point in the same direction. This alignment produces a\nspurious correlation which adds to the observed cosmic shear\nsignal.\nSince the II correlation is greatest for closely positioned\ngalaxies, there is a related correlation between the position\n\nand the intrinsic alignment of a pair of physically close galaxies, this is the galaxy position-intrinsic alignment (gI) correlation.\nSomewhat more subtle is the Gravitational-Intrinsic\nalignment (GI) correlation which applies to galaxies close\non the sky but separated in redshift. The intrinsic ellipticity of the foreground galaxy will tend to align with the\nnearby gravitational potential which, in turn, is responsible for gravitationally lensing the background galaxy. This\ntends to produce an anti-correlation which subtracts from\nthe observed cosmic shear signal as we observe the galaxies\noriented orthogonally.\nWe can write angular correlation functions involving intrinsic alignments using the formalism in (11), defining a\nsource term, SI , and window function, WI , for the intrinsic\nalignments\nSI (k, χ)\n\n=\n\nWIi (χ)\n\n=\n\nCf 2\nk ψ(k, zf ),\n4πG\ni\nWm (χ) = n̂i (χ).\n\n−\n\n(34)\n(35)\n\nThe angular correlation is often written in terms of the linear\npower spectra, PXY = hSX SY i,\nZ χ∞\ndχ\nGI\nWG,i (χ)n̂j (χ)PGI (k, χ),\nCij\n(l) =\nχ2\n0\nZ χ∞\ndχ\nII\nn̂i (χ)n̂j (χ)PII (k, χ),\n(36)\nCij\n(l) =\nχ2\n0\nZ χ∞\ndχ\ngI\nn̂i (χ)n̂j (χ)PgI (k, χ).\nCij\n(l) =\nχ2\n0\nOne can write the correlations in (36) in terms of the matter\npower spectrum at zf ,\nPGI (k, z)\n\n=\n\nPII (k, z)\n\n=\n\nPgI (k, z)\n\n=\n\nQ(k, z)[1 + R(k, z)] D(k, z)\nCf ρ̄m (1 + zf )Pδδ (k, zf ),\n2\nD(k, zf )\nCf2 ρ̄2m (1 + zf )2 Pδδ (k, zf ),\nD(k, z)\nbg (k, z)\nCf ρ̄m (1 + zf )Pδδ (k, zf ),\nD(k, zf )\n\nwhere ρ̄m is the mean matter density today and D(k, z) is\nthe linear growth factor for CDM perturbations,\n∆c (k, z) =\n\nD(k, z)\n∆c (k, zf ).\nD(k, zf )\n\n(38)\n\nIn GR the linear growth factor is scale independent. If\ngravity is modified on cosmic scales, however, it can be scale\ndependent, and sensitive to the functions Q and R.\nHow does one normalise the IA correlations, and the\nconstant Cf ? Bridle & King (2007) provide a numerical\nvalue for ClII , by comparing with Hirata & Seljak (2004)\nwho used observations of low redshift galaxies today. Rather\nthan normalising the IA source function at zf , they normalise it, with constant C1 , relative to the gravitational potential today assuming a ΛCDM cosmology, ψΛ ,\nSI (k, z)\n\n=\n\n−\n\nC1 2\nk ψΛ (k, 0).\n4πG\n\n(39)\n\nThey find C1 = 5 × 10−14 (h2 Msun /M pc−3 )−1 =\n8.25h−2 × 104 M pc2 . We extrapolate the normalisation of\n(Bridle & King 2007) at z = 0 to z = zf by assuming a\nΛCDM growth factor, DΛ (z) (Carroll et al. 1992). The early\nand late time normalisations, Cf from C1 , are then related\nc 2009 RAS, MNRAS 000, 1–18\n\n(37)\n\n\fDisentangling dark energy and cosmic tests of gravity from weak lensing systematics\nby\nCf\n\n2.4.2\n\n=\n\nC1\n\nDΛ (0)\n.\nDΛ (zf )(1 + zf )\n\n(40)\n\nGeneralising the IA model\n\nThough the correlations in galaxy orientation might be\nformed in the era of galaxy formation, the intrinsic alignments we observe will invariably be sensitive to the evolution\nof those galaxies, and the galaxy environment.\nOne factor that is not included in the LA model is the\nimpact of non-linear clustering of galaxies on the distribution of the galaxies sourcing the intrinsic alignments. A nonlinear alignment (NLA) model was introduced as an ad-hoc\nway to incorporate non-linear clustering into the LA model\n(Hirata et al. 2007; Bridle & King 2007). This replaces the\nlinear power spectrum in the intrinsic alignment angular correlation expression (37) with the non-linear power spectrum\nbased on the fitting function derived from the halo model of\nSmith et al. (2003).\nWhile this is somewhat adhoc, it was found to give\na qualitatively similar result to the more motivated halo\nmodel of intrinsic alignments in Schneider & Bridle (2010)\nand it has been shown, in for example Hirata et al. (2007);\nBlazek et al. (2011), that it gives a more consistent fit to the\ndata than the linear alignment model.\nWe extend this approach to take into account the modified growth history, if gravity deviates from GR. We model\nthe effect of non-linear clustering by boosting the IA source\nfunction, SINLA relative to that predicted by linear alignments,\ns\nPδδ (k, χ)nonlin\nNLA\nLA\nSI\n(k, χ) = SI (k, χ)\n.\n(41)\nPδδ (k, χ)lin\nlin\nhere Pδδ\nis the linear matter power spectrum predicted\nnonlin\nmodified gravity model, and Pδδ\nis the non-linear spectrum after a correction is applied to the power spectrum\nusing the Smith et. al. halo fitting function (Smith et al.\n2003). The use of the Smith et al. fitting function, for a modified expansion history, is equivalent to assuming that nonlinear collapse in the modified gravity theories follows the\nZel'dovich approximation; this was shown to be reasonable\nif the phenenomological modifications in (5) and (6) hold\nto nonlinear scales (Stabenau & Jain 2006; Laszlo & Bean\n2008). We briefly discuss the motivation and possible impact\nof deviations from this assumption later in the analysis.\nIn figure 1 we show how each intrinsic alignment contribution to the observed correlations varies as a function\nof redshift for a fixed multipole, l = 1000. We refer the\ninterested reader to Joachimi & Bridle (2010) for a figure\ndetailing the variation in lensing, galaxy and IA correlations across all multipoles and redshift bins. The same-bin\ncorrelations vary monotonically as a function of redshift (denoted by the index of the photometric redshift bin), while\nthe cross-bin correlations involving galaxy positions dramatically fall off as the photometric redshift bins become more\nseparated. By contrast, the cross-bin correlations for GG\nand GI, can remain significant even in cross-correlations between widely separated bins because of the broad redshift\nkernel for the lensing window function.\nFigure 2 compares the amplitude and variation in shear\n\nc 2009 RAS, MNRAS 000, 1–18\n\n7\n\nand galaxy correlations when, separately, IAs are added and\nwhen the modified gravity theory is allowed. While the two\neffects can be of comparable amplitude, their distinct redshift dependencies, if the intrinsic alignment model is perfectly known, could assist in disentangling them.\nIntrinsic alignments are unlikely, however, to be described fully by the linear alignment model; they will depend on the details of galaxy formation within dark matter halos, and baryonic physics within galaxies, with complexity beyond this model. For example, it is known that\nthe IA signal depends strongly on galaxy type and color,\n(Lee 2011; Blazek et al. 2011); spirals are supported by\nangular momentum, and so more likely subject to tidal\ntorquing of the angular momentum vector, while elliptical galaxies are better described by linear alignments.\nThis bifurcation translates into colour dependence, as spirals are blue while ellipticals are older and redder, and is\nnoted in surveys which split samples by colour (Hirata et al.\n2007; Faltenbacher et al. 2009; Mandelbaum et al. 2009).\nRedshift and luminosity dependences, and one-halo corrections at smaller scales also exist, as in (Hirata et al.\n2007; Faltenbacher et al. 2009; Mandelbaum et al. 2009;\nHao et al. 2011; Schneider & Bridle 2010; Joachimi et al.\n2011).\nRather than attempt to incorporate these numerous effects by direct modelling, we choose to allow a scale and\nredshift dependent bias factor to parameterise our ignorance\nand marginalise over the bias parameter in a redshift and\nscale gridding. We introduce two additional bias parameters\ninto the IA correlations, bI and rI , analogous to the galaxy\nbias bg and rg , to reflect our uncertainty in the bias model:\n(f id)\n\nPII\n\n=\n\nb2I PII\n\nPGI\n\n=\n\nbI rI PGI\n\n(f id)\n\n(42)\n(43)\n\nwhere the fiducial functions are given by the LA or NLA\nmode.\n2.5\n\nModeling galaxy bias and IA amplitudes\n\nWe consider two scenarios for galaxy and IA bias. In our\nsimple model all bias parameters are k and z independent,\ni.e. bg , bI , rg and rI are each a single constant free parameter\ndetermining the amplitude of the bias. In the more realistic\nscenario, motivated by Joachimi & Bridle (2010) each bias\ncoefficient, BX ∈ {bg , rg , bI , rI }, is interpolated from a Nk ×\nij\nNz grid of values logarithmically spaced in k and z, BX\n,\nrespectively,\ni\nh\nij\nij+1\nBX (k, a) = (1 − ∆k ) (1 − ∆z )BX\n+ ∆z BX\ni\nh\ni+1j\ni+1j+1\n+∆k (1 − ∆z )BX\n(44)\n+ ∆z BX\n\nfor ki < k < ki+1 and zj < z < zj+1 , with\n∆k\n\n≡\n\n∆z\n\n≡\n\nln(k/ki )\nln(ki+1 /ki )\nln[(1 + z)/(1 + zj )]\nln[(1 + zj+1 )/(1 + zj )]\n\n(45)\n(46)\n\nand modulated by a free constant amplitude parameter.\nWe choose kmin = 10−3 M pc−1 and kmax = 30M pc−1\nfor the gridding, and assume BX (k < kmin ) = 1 and\nN N\nBX (k > kmax ) = BXk z at all times. We consider scenarios\n\n\f8\n\nI. Laszlo, R. Bean, D. Kirk, S. Bridle\n\nFigure 1. A comparison of the intrinsic alignment and cosmological contributions, assuming a fiducial ΛCDM cosmology, to the shearshear [left panel] and position-shear correlations [right panel] as a function of photometric redshift bin, Ni , for the Stage IV survey\nspecification for a single multipole, l = 1000. Same-bin 'ii' [full lines] and cross-bin correlations with the 5th , central, redshift bin '5i'\n[dashed] are shown for the cosmological correlations GG, gg and gG, and the intrinsic aligment correlations II, GI, and gI. For the gG,\ngI and GI correlations we plot the larger of i5 and 5i correlations in each case.\n\nFigure 2. The difference in shear-shear [left panel] and position-shear correlations [right panel] in which IAs are included [blue lines]\nor using a modified gravity model (with no IAs) [red lines] in comparison to a fiducial model, in which no IAs are included and GR\nis assumed. The modified gravity model shown has Q0 = 1.05 and R0 = 1. As in figure 1, we show correlations for l = 1000 in each\nphotometric redshift bin, Ni , for the Stage IV specification.\n\nin which 1 6 Nk = Nz 6 5. Each of the Nk × Nz grid nodes\nis a freely varying parameter. This means that, in our more\nsophisticated model, there are 4Nk Nz nuisance parameters\nwhen all correlations and cross-correlations are included.\nA multi-bin marginalisation over bias parameters is arguably conservative, however we believe it reasonably reflects the current uncertainties in the bias and IA models.\nIt was inspired by the work of Bernstein (2009) which was\nused in Albrecht et al. (2009) who bin the biases in redshift\nand multipole bins, rather than redshift and wavenumber as\nwe do here.\nFor observables involving the galaxy position correlations we truncate the maximum l used as a function of\nredshift bin, as per Rassat et al. (2008); Joachimi & Bridle\n(2010) to remove poorly understood biasing on non-linear\nscales from the likelihood calculation. We introduce a maximum wavenumber kmax for a photometric redshift bin i,\nand neglect all li > kmax χ(zi ).\nOur analysis spans from the optimistic to conservative\n\nscenarios. Optimisitically one might assume one can extract,\nand therefore exclude, IAs with perfect precision and can\nmodel the galaxy bias as scale and redshift independent.A\nconservative perspective would be to represent our ignorance\nin IA and galaxy bias modeling with 100 marginalised parameters (Nk = Nz = 5). Where, within this range, the\nrealistic range will finally fall will depend on progress in understanding IAs potentially through the use of complementary spectroscopic redshift surveys and the development of\ngalaxy training sets, or preferential selection of galaxy subgroups in which intrinsic alignments are less pronounced,\nand galaxy bias is well-understood.\n\n3\n\nANALYSIS\n\nFor our analysis of the impact of systematics on dark energy constraints, we consider constraints on 10 cosmological\nc 2009 RAS, MNRAS 000, 1–18\n\n\fDisentangling dark energy and cosmic tests of gravity from weak lensing systematics\nparameters:\np\n\nQ0 (1 + R0 )\n, Ωb h2 , Ωm h2 , τreion ,\n2\nns , ln(1010 As )}\n(47)\n\n=\n\n{ΩΛ , w0 , wa , Q0 ,\n\nwhere τreion is the optical depth to the epoch of reionisation,\nand ns and As are the spectral index and normalisation of\nthe primordial spectrum of curvature perturbations, with\npivot scale k = 0.05M pc−1 . We choose fiducial values for\nthese parameters assuming ΛCDM, and consistent with a\nW M AP 7 bestfit cosmology (Larson et al. 2010).\nAs can be seen in 2.2, a primary constraint on modified\ngravity parameters from weak lensing is the combination\nfrom Q0 (1 + R0 )/2, rather than R0 . We therefore use Q0\nand Q0 (1 + R0 )/2 as variables in the Fisher analysis, and\ntake GR with Q = R = 1 as the fiducial model.\nUnless stated otherwise, we consider a conservative scenario for astrophysical systematics, and marginalise over\nthe galaxy and intrinsic alignment biases bg , rg , bI , rI with\nNk = Nz = 5 bins. We assume bg = rg = bI = rI = 1 for\nthe fiducial model.\nOur fiducial scenario involves a 5 × 5 grid of 4 autocorrelation and cross-correlation galaxy and IA bias parameters and 10 cosmological parameters, giving a total of 110\nparameters.\nThe large number of parameters, especially when using\nthe full bias model, favors the use of a Fisher matrix approach. For N parameters, only N + 1 samples are required\nto estimate the parameter covariance matrix, Cij = Fij−1 ,\nwith,\nX X ∂Da (l)\n−1 ∂Db (l)\nFij =\nCovab\n,\n(48)\n∂pi\n∂pj\nab\n\nl\n\nn n\n\nn ǫ\n\nǫ ǫ\n\nwhere D(l) = {ClCM B , Cl i j , Cl i j , Cl i j } are the set of\nobservables across all multipole bins, and redshift bin combinations. We consider correlations for 10 6 l 6 3000 in 50\nlogarithmically spaced bins in l space.\nTo calculate the partial derivatives,∂D(l)/∂p, we take a\n2% reduction in each parameter with non-zero fiducial value,\nand an absolute step of −0.02 for all parameters whose fiducial value is zero. We checked that the results are insensitive\nto the exact size of the step size, obtaining consistent results\nwith 1% and 3% step sizes.\n−1\nThe covariance matrix Covab\nbetween two observables,\nin multipole bin with mid-value l and spanning lmin (l) 6\nl′ 6 lmax (l), is given by\nWi Xj\n\nCov[Cl\n\nXj Z n\n\n, ClYm Zn ]\nWi Xj\n\nĈl\n\nf (l)\n\n=\n≡\n≡\n\nĈlWi Ym Ĉl\nWi Xj\n\nCl\n\nY\n\n+ ĈlWi Zn Ĉl m\nf (l)fsky\n\nXj\n\nWi Xj\n\n+ Nl\n\nlmax (l)\n\nX\n\n(2l′ + 1).\n\n(49)\n\nl′ =lmin (l)\n\nWe have modified the publicly available CosmoMC\n(Lewis & Bridle 2002) and CAMB Lewis et al. (2000) codes\nto calculate the Fisher matrix and the correlation functions\nfor the future survey specifications, in light of the IA and\nmodified gravity models.\nBoth relaxing the assumption that gravity is described\nby GR on cosmic scales and adding in systematic uncertainties increase the degrees of freedom fit by the prospective\nc 2009 RAS, MNRAS 000, 1–18\n\n9\n\ndata and hence can degrade the quality of the cosmological\ninformation obtained. In figure 3 we show these dual effects\non the 2D marginalised constraints for the dark energy parameters. The constraints shown are for all data combined:\nCMB, galaxy position, lensing shear and cross-correlations,\nwith the conservative bias marginalisation model using an\nNk = Nz = 5 grid. Either including IAs, or allowing a modification to gravity, separately has a roughly comparable effect on reducing the constraining power on w0 and wa , with\nIAs having a slightly larger impact. The inclusion of intrinsic\nalignments, while not significantly changing the degeneracy\ndirection, does noticeably weaken the modified gravity parameter constraints.\nWe quantify the constraining power of the surveys using the covariance matrix for the parameters , Cij = Fij−1 .\nThe diagonal elements of the covariance matrix give the\n√ 1σ measurement uncertainty in each parameter, σi = Cii .\nA 2 × 2 submatrix of a pair of parameters, C̃(pi , pj ), then\ngives the figure of merit (FoM) that includes the covariances\nbetween the parameters,\nF oM (pi , pj ) ≡ det[C̃(pi , pj )]−1/2 .\n\n(50)\n\n2\nWith this definition F oM = 1/σef\nf , where σef f is the geometric mean of the principal axes of the 2-dimensional error\nellipsoid. Note this differs by a factor of 1/6.17π, from another commonly quoted FoM, the area of the 95% confidence\nellipsoid in the 2D marginalised space.\nWe consider the Dark Energy Task Force figure of merit\non the equation of state (EoS), F oM (w0 , wa ) both in the\nabsence of modifications to gravity, and also when the modified gravity parameters and included and marginalised over.\nWe quantify constraints on the modified gravity parameters\nby considering an equivalent 2 × 2 FoM, F oM (Q0 , Q0 (1 +\nR0 )/2).\nAn alternative way to measure dark energy constraints\nis to consider the combined constraints from equation of\nstate and modified gravity together, through considering the\nFoM from a 4 × 4 covariance submatrix,\n\nF oM (comb) ≡ det[C̃(w0 , wa , Q0 , Q0 (1 + R0 )/2)]−1/4 .\n\n(51)\n\nWang et al. (2010) applied an analogous statistic to compare constraints on a multi-parameter, model-independent\ndark energy figure of merit. This FoM accounts for all covariances between the equation of state and modified gravity parameters, but at the same time entangles the EoS and\nMG constraints, with their different dependencies on measurements of the expansion history and growth of structure.\nWith this definition, for n parameters, our F oM gives a\nmeasure of 1/σef f 2 , the mean error in the n-dimensional\nconfidence ellipsoid. We note that Wang et al. (2010) define\na slightly different F oM = 1/σef f n , giving a figure of merit\nthat scales with the volume of the n-dimensional space.\nFor a 2 × 2 covariance matrix, M , for parameters x\nand y, one can\np calculate a correlation coefficient rcorr =\nσxy /σx σy = 1 − det(M )/σx2 σy2 . By dividing the 4 × 4 covariance matrix for all 4 parameters, {w0 , wa , Q0 , Q0 (1 +\nR0 )/2}, into 2 × 2 submatrices, we can define an equivalent\ncorrelation coefficient between the equation of state parameters and modified gravity parameters,\ns\n0)\n)\nF oM (w0 , wa )F oM (Q0 , Q0 (1+R\n2\n. (52)\n1−\n|rcorr | ≡\nF oM (comb)2\n\n\f10\n\nI. Laszlo, R. Bean, D. Kirk, S. Bridle\n\nFigure 3. A comparison of dark energy constraints in the 2D marginalised parameter planes when intrinsic alignments are included\nusing the LA model [full lines], in comparison to when it is assumed that IA's are perfectly understood and can be extracted to reveal\nthe underlying cosmological shear and galaxy position correlations [dotted lines]. 95% confidence level constraints are shown when both\nGR is assumed [red] and when large scale modifications to gravity \"MG\" are allowed [black]. These results combine Planck-like CMB\ndata with a Stage IV survey's galaxy position and shear auto and cross correlations.\n\nTable 3 summarises the 1-σ, figure of merit (FoM) and\ncorrelation coefficient, rcorr results for constraints coming\nfrom prospective Stage III and Stage IV surveys. We compare the different IA treatments, and the effect of lensing\ncalibration and photometric redshift offsets.\nIn the absence of modifications to gravity, IAs still have\na significant impact, as was, for example, pointed out in\n(Joachimi & Bridle 2010). If IAs are assumed to be perfectly\nunderstood then one can achieve a ∼ 14 fold improvement\nin the dark energy FoM from the Stage IV survey relative to\nStage III. However when astrophysical uncertainties about\nIAs are included, and marginalised over, we find that the\nrelative improvement of the photometric Stage IV survey, is\nreduced to 9.\nWhen the modification to gravity described in 2.1 is\nincluded, measurements of the growth of structure no longer\npurely constrain w0 and wa . With IAs excluded, the EoS\nfigure of merit with modified gravity allowed is weakened by\n50% relative to GR for a stage III survey, and by 70% for\nstage IV.\nThe inclusion of IA uncertainties reduces both the EoS\n\nand MG figures of merit by roughly a factor of 2 relative to\nthose when IAs are excluded from the analysis. Both with\nand without IAs included, the modified gravity FoM for a\nStage IV survey is roughly a factor 6 improvement over that\nfor Stage III.\nOverall, when both modified gravity and dark energy\nparameters are considered together, the FoM improves by a\nfactor 8.5 between Stage III and Stage IV in the absence of\nIAs, and this is reduced to just under 7 with the conservative modeling of IAs. The similarities in the adjustments in\nDE and MG FoM between Stage III and Stage IV suggest a\nhigh degree of correlation between the two parameter pairs.\nThis is quantitatively reinforced by the correlation coefficient rcorr ; the correlations are higher for Stage IV than for\nStage III and are degraded by ∼15 and 25%, respectively,\nwith the inclusion of intrinsic alignments.\nThere is only a small difference between the figures of\nmerit for the linear alignment and nonlinear alignment models are included; with the NLA model giving slightly poorer\nconstraints. The small difference suggests that the differences between the LA and NLA models are to a large exc 2009 RAS, MNRAS 000, 1–18\n\n\fDisentangling dark energy and cosmic tests of gravity from weak lensing systematics\nSurvey\n\nScenario\n\nσ(ΩΛ )\n\nσ(w0 )\n\nσ(wa )\n\nσ(wp )\n\nF oM (EoS)\n\nno IA\nLA\nNLA\nno IA\nLA\nNLA\n\n0.014\n0.025\n0.027\n0.003\n0.008\n0.008\n\n0.169\n0.272\n0.294\n0.045\n0.081\n0.086\n\n0.451\n0.677\n0.728\n0.127\n0.207\n0.217\n\n0.029\n0.042\n0.043\n0.008\n0.017\n0.017\n\n76.1\n35.2\n32.3\n1041.1\n287.3\n268.7\n\n0.605\n0.923\n0.971\n0.176\n0.274\n0.276\n0.204\n0.295\n0.296\n\n0.034\n0.043\n0.043\n0.017\n0.022\n0.022\n0.024\n0.031\n0.031\n\n48.8\n25.3\n23.8\n334.5\n166.1\n164.0\n200.5\n109.9\n108.4\n\nσ(Q0 )\n\nσ\n\n\u0010\n\nQ0 (1+R0 )\n2\n\n\u0011\n\n11\n\nF oM (M G)\n\nF oM (comb)\n\n|rcorr |\n\n40.1\n25.0\n23.7\n253.6\n151.6\n143.7\n196.3\n129.8\n123.8\n\n54.9\n29.6\n27.7\n469.8\n202.1\n190.8\n327.9\n162.7\n153.9\n\n0.59\n0.53\n0.51\n0.79\n0.62\n0.60\n0.78\n0.64\n0.61\n\nAssuming GR\nStage III\n\nStage IV\n\nAllowing an alternate modified gravity model\nStage III\n\nStage IV\nStage IV\n+sys. offsets\n\nno IA\nLA\nNLA\nno IA\nLA\nNLA\nno IA\nLA\nNLA\n\n0.019\n0.030\n0.032\n0.007\n0.010\n0.011\n0.008\n0.012\n0.012\n\n0.226\n0.363\n0.383\n0.064\n0.105\n0.106\n0.072\n0.111\n0.112\n\n0.666\n0.894\n0.897\n0.198\n0.280\n0.292\n0.226\n0.290\n0.301\n\n0.091\n0.118\n0.118\n0.032\n0.041\n0.041\n0.039\n0.045\n0.046\n\nTable 3. Comparison of figures of merit and marginalised 1-σ errors for dark energy equation of state (EoS) parameters {w0 , wa } and\nmodified gravity (MG) parameters {Q0 , Q0 (1 + R0 )/2}. A combined figure of merit including covariances between all 4 dark energy\nparameters, F oM (comb), and a correlation coefficient, rcorr , between the EoS and MG parameters are also included. The table shows\nprospective constraints from galaxy position and weak lensing auto- and cross-correlations from Stage III and Stage IV surveys in\ncombination with temperature and polarisation data from a Planck-like CMB survey. We assume a conservative model for galaxy and\nIA bias parameters, with Nk = Nz = 5. The results with \"+sys. offsets\" include marginalisation over weak lensing calibration and\nphotometric redshift offset parameters meant to reflect possible instrumental systematic errors.\n\ntent drowned out by the uncertainities in the IA bias model.\nSmall scale galaxy position correlations, which would be sensitive to differences in LA vs NLA through the gI term, are\ntypically excluded since the multipoles exceed lmax .\nFor the analysis shown in the table alone, we also consider the impact of two additional instrumental systematics:\nphotometric redshift offsets and lensing shear calibration offsets , on the figures of merit. Photometric redshift offsets,\n∆zi alter the galaxy distribution inferred from observations\nas in (16). When systematic offsets are considered, we model\nthem following Albrecht et al. (2009): we allow independent\noffsets in each photometric redshift bins and impose a prior\non these offsets of σ(∆zi ) = 0.002. We model shear calibration offsets by altering the measured shear correlations\nǫ ǫj ,of f set\n\nCl i\n\nn ǫ ,of f set\nCl i j\n\n=\n=\n\nǫ ǫj\n\n(1 + ∆mi )(1 + ∆mj )Cl i\n(1 +\n\nn ǫ\n∆mj )Cl i j\n\n(53)\n\n(54)\np\nand impose a prior of σ(∆mi ) = 0.001 Nph in each bin.\nShear and redshift calibration offsets introduce an additional\n10 parameters. Shear calibration offsets are qualitatively degenerate with the inclusion of IA correlations of unknown\namplitude in the ǫǫ correlation, and both cause a reduction\nin the figures of merit. While the systematic shear offsets\nin ǫǫ and nǫ are wholly correlated, the IA contributions can\ndiffer through the inclusion of the rI degree of freedom in\nthe GI cross-correlations. As such, the degradation in the\nconstraints from including the instrumental systematic offsets, as we model them here, are not as severe as those from\nmarginalising over the uncertainties in the IA model.\nIn figure 4, we breakdown the impact of including IAs\non the figures of merit derived as one combines CMB plus\ngalaxy, lensing and galaxy lensing cross correlations in a\nc 2009 RAS, MNRAS 000, 1–18\n\npiece-wise fashion. The inclusion of intrinsic alignments significantly deteriorates the expected dark energy constraints\ncoming from weak lensing on its own, while the use of a grid\nbias model leads to the galaxy-galaxy correlations providing\nlittle constraining power on the non-bias parameters in the\nmodel. When lensing and galaxy position data are added in\ntandem, however, they are able to provide improved constraints, over and above the lensing data alone. When IAs\nare included, the combined constraints are noticeably weaker\nthan the constraints predicted by pure shear-shear measurements when IAs are neglected. The effects are mitigated to\na good degree by gaining complementary information about\nthe underlying cosmological potentials, and isolating out the\nIAs, by adding in galaxy position data. In particular, the inclusion of cross-correlations, between galaxies and lensing,\nallow the correlated effects of the II and GI IA contributions to reduce the uncertainties in the IA model.\nOur findings for constraints on equation of state parameters are consistent with those of Joachimi & Bridle (2010);\nin the absence of CMB data, figures of merit with all galaxy\nposition and weak lensing correlations and IAs included are\ncomparable with those predicted by weak lensing alone in\nthe absence of IAs. We do find, however that when we include CMB data the FoM with IAs never becomes comparable with those when IAs are excluded, even when all\ncross-correlation information is included.\nIn a number of recent analyses of dark energy constraints from prospective surveys, the uncertainties in the\ngalaxy bias model are treated by a single, scale and redshift independent, factor. In figure 5 we highlight that this\nassumption can have a dramatic effect on the predicted constraining power of the survey. Allowing a gridded galaxy bias\nmodel, while excluding IA uncertainties, reduces the EoS fig-\n\n\f12\n\nI. Laszlo, R. Bean, D. Kirk, S. Bridle\n\nFigure 4. How figures of merit (FoM) are affected by intrinsic alignments and the choice of data sets utilised in the analysis for\nequations of state parameters (w0 vs wa ) and modified gravity parameters (Q0 vs. Q0 (1 + R0 )/2). We compare analyses in which IAs\nare ignored [black full, triangle], where they are included using the linear alignment model [red dotted lines, square] and the non-linear\nalignment model [blue dashed, cross]. Datasets include a Planck-like CMB survey, denoted 'cmb', and Stage IV galaxy position-position\n'nn', shear-shear 'ǫǫ' and shear-galaxy position cross-correlations'nǫ'.\n\nure of merit by roughly a third, and MG figure of merit by\nalmost a half.\nIncluding intrinsic alignments in the analysis, while assuming single, scale and redshift independent, amplitude has\na marginal impact on the EoS and MG FoMs. In fact, interestingly, assuming that you know how IAs are formed and\nevolve provides additional information, actually improving\nthe constraints.\nOne can understand this by noting that the GG, II and\nGI components all depend on the underlying matter distribution but each exhibit a different evolution with redshift.\nAssuming a single-parameter normalisation, but multiplybinned measurements (from tomography) for the IAs, enables us to obtain an independent measurement of ψ(zf )\nfrom the GG and both IAs. When uncertainties in the IA\nmodel are introduced, however, by using the grid bias model,\nthey markedly degrade the dark energy constraints. One\ndoesn't see the plateauing of the FoM that one would see\nwith intrinsic alignments excluded from the analysis.\nWe rationalise the plateau with no intrinsic alignments\nas follows: the contributions from shear-shear, shear-position\n\nand position-position power spectra have different dependencies on redshift resolution. We expect the constraining\npower of position-position alone to be weak given the multipole cuts, and to be badly affected by even a small number of\nfree bias parameters. Therefore we should be dominated by\nshear-shear and shear-position information which are much\nmore resilient to a lack of redshift information because, when\nIAs are not included, each is modulated by the broad lensing\nweight function.\nWe can combine the information in figures 4 and 5 to\nidentify how many free parameters can be accommodated\nbefore constraints degrade relative to conventional constraints: from shear-shear correlations alone, in which IAs\nare ignored. CMB plus shear-shear data alone give a modified gravity figure of merit of 170 (figure 4), which is roughly\nthe same value obtained when including all two-point crosscorrelations and including a bias grid with Nbias = 4 (figure\n5). For the equation of state figure of merit we can use a\nbias grid with Nbias = 3 before we reach the same figure of\nmerit using all two-point functions as we would obtain from\nthe traditional approach. A bias grid with Nbias = 3 has\nc 2009 RAS, MNRAS 000, 1–18\n\n\fDisentangling dark energy and cosmic tests of gravity from weak lensing systematics\n\n13\n\nFigure 5. The impact of the number of k and z bins, Nk = Nz = Nbias , in the bias model on the equation of state (EoS) and modified\ngravity (MG) figures of merit (FoM). Scenarios are shown in which IAs are excluded [black ,triangle], and in which linear alignment\n(LA) [red, square] and nonlinear alignment (NLA) [blue, cross] models for intrinsic alignments are used. If IAs are excluded one sees\na plateauing of the figure of merit as the number of bias marginalisation parameters in increased. With the addition of parameters\nto describe uncertainties in the IA amplitude no such plateauing is seen. The inclusion of IA, with an assumption that they are well\nunderstood, and can be described by scale and redshift independent nuisance parameters (Nbias = 1) actually improves the dark energy\nconstraints because the IAs provide additional cosmological information about the high redshift potential φ(zf ). If uncertainties in the\nIA model are allowed however, there is a significant deterioration in the constraints on both FoM. The results presented here are for\nprospective CMB and Stage IV large scale structure survey utilising all galaxy position and shear auto- and cross- correlations.\n\n3 × 3 × 4 = 36 free parameters in total, 18 for galaxy bias\nand a further 18 for the intrinsic alignment model. We therefore need astrophysics to be sufficiently kind that the bias\nfunctions are sufficiently smooth in both scale and redshift,\nor to have sufficient information from simulations to be able\nto parameterise the functions with roughly this number of\nfree parameters.\nThe inclusion of information in the mildly nonlinear\nregime can have a potentially significant effect on improving\nconstraints on dark energy parameters, purely as a result of\nthe large number of modes available to include in the analysis. If modifications to gravity are included however then\none has to make an assessment of how well large scale structure growth in the non-linear regime is understood. Recent\nanalyses show that in some specific modified gravity theories there can be subtleties in the non-linear behaviour that\nmight have to be included (Oyaizu 2008; Oyaizu et al. 2008;\nSchmidt et al. 2009; Khoury & Wyman 2009; Ferraro et al.\n2011; Cui et al. 2010; Zhao et al. 2011; Brax et al. 2011). In\nfigure 6 we highlight the sensitivity of the figure of merit to\nthe assumptions about the smallest scales to be included in\nthe analysis, parameterised here by lmax .\nWhen CMB data is included, the pressure to go to high\nmultipoles is reduced. There is only a 50% increase in FoM\non increasing the maximum multipole from 1000 to 3000,\ncompared to over a factor of two when CMB data is not\nused.\n\n4\n\nCONCLUSIONS\n\nUsing tests of the expansion history of spacetime and the\ngrowth of large scale structure, in tandem, gives the best\nprospects for testing gravity on cosmic scales. Weak lensing,\nc 2009 RAS, MNRAS 000, 1–18\n\ngalaxy position, CMB ISW and potential peculiar velocity\nobservations provide very complementary constraints on the\ngravitational potentials, through measuring both their sum,\nφ + ψ and ψ on its own.\nFundamental to realising the full potential of these\ncomplementary observations is a requirement to minimise\nboth instrumental and astrophysical systematic uncertainties that can dilute the cosmological constraining power of\nupcoming surveys. Weak lensing observations could potentially offer a direct way to measure the gravitational potentials without the bias uncertainty in relating galaxy positions to the underlying CDM matter distribution. On the\nother hand, intrinsic alignments provide a significant systematic signal. Uncertainties about IA formation, evolution,\nand variation amongst galaxy-type, have to be factored into\na realistic assessment of how well weak lensing shear measurements can constrain a cosmological model.\nIn this paper, we have shown that how systematic uncertainties are modelled can have a profound impact on the\npredicted dark energy and modified gravity constraints from\nfuture large scale structure imaging surveys.\nBy utilising a grid-based approach to marginalise over\nuncertainties in both galaxy bias and intrinsic alignment\ncontributions to lensing shear and galaxy position correlations, we have provided conservative and optimistic bounds\nfor constraints on both dark energy equation of state parameters and a useful phenomenological modified gravity model.\nWe considered three figures of merit to quantitatively\ncompare constraints on the dark energy equation of state\nand modified gravity parameters both separately and in\ncombination. Quoting separate figures of merit for EoS and\nMG parameters can be used to show their different dependences on data sets and assumptions. They can also contrast\nthe equation of state parameter dependence on expansion\n\n\f14\n\nI. Laszlo, R. Bean, D. Kirk, S. Bridle\n\nFigure 6. The impact of including observations on small scales, denoted by the maximum multipole, lmax , up to which correlations\nare considered, on the equation of state (EoS) and modified gravity (MG) figures of merit (FoM) . Results are shown for a Stage IV\nphotometric survey alone [upper panel] and [lower panel] including complementary constraints from a Planck-like CMB survey when\nIAs are excluded [black full line] and included using the LA [red,dotted] and NLA [blue,dashed] models. While including smaller-scale\nobservations would appear to improve both figures of merit, one has to consider the theoretical uncertainties present in modeling these\nsmall scales, especially in the context of modifications to gravity, therefore it is worthwhile assessing how a conservative approach of\nneglecting such scales might impact the projected cosmological constraints.\n\nhistory measurements, and modified gravity parameter dependence on the growth history. We have found, however,\nthat there is a high degree of correlation between these two\nsets of parameters so that treating them independently ignores an important association. We proposed, and quantified, a combined figure of merit and related correlation coefficient as a way to address this.\nWe have found that the constraints have a significant\nsensitivity to how galaxy bias and intrinsic alignments are\nincorporated into the analysis. The equation of state and\nmodified gravity figures of merit are a factor of 4 smaller\nwhen a conservative scale and redshift dependent grid model\nis used, than when bias and IAs uncertainities are assumed\nto be redshift and scale independent. Marginalising over systematic uncertainties in the IA model led to a factor of two\nreduction in the figures of merit.\nWhether a linear alignment or nonlinear alignment\nmodel underpinned the IA model had only a small effect in comparison to our assumptions about the evolu-\n\ntion of bias and IAs in redshift and scale. Understanding the astrophysical evolution and population dependence\nof intrinsic alignments, therefore, could dramatically improve the cosmological information that comes out of future photometric large scale structure surveys, such as DES,\nSuMIRe, Euclid, LSST and WFIRST. We discuss the implications of weak lensing systematics for optimising cosmic\nshear surveys to measure dark energy in a related paper\n( D. Kirk, I. Laszlo, S. Bridle and R. Bean 2011).\nIn addition to uncertainties in bias and IAs, an understanding of evolution in the nonlinear regime could also have\na profound impact on constraints, through increasing the\nmaximum multipole to which analyses can proceed. If GR\ngoverns cosmic evolution this may be achievable, while the\nmodel dependence of the non-linear regime in modified gravity models could make this far more challenging.\nCombining information from the photometric surveys\nwe have considered here with that from spectroscopic galaxy\ndata, such as might come from BigBOSS, EUCLID and\nc 2009 RAS, MNRAS 000, 1–18\n\n\fDisentangling dark energy and cosmic tests of gravity from weak lensing systematics\nWFIRST, might allow closely situated galaxies to be isolated, and their intrinsic alignments to be studied. We will\nconsider in future work how this could provide an important\navenue to improve our understanding of intrinsic alignments\nand in turn maximise the cosmological constraining power\nof future wide and deep photometric surveys.\nWe finally note that, as part of this work, we have provided a fitting function to allow other researchers to generate\nweak lensing and galaxy position correlations for modified\ngravity theories of the form we consider here.\n\nACKNOWLEDGEMENTS\nWe thank the Aspen Center for Physics for support and\nfor hosting two coincident workshops on \"Wide-Fast-Deep\nSurveys: New Astrophysics Frontier\" and \"Testing General\nRelativity in the Cosmos\" in 2009 where this work was conceived. The authors would like to thank the Kavli Royal Society International Centre for hosting the \"Testing general\nrelativity with cosmology\" workshop in 2011 that supported\nfruitful discussion and collaboration.\nWe thank Filipe Abdalla, Adam Amara, David Bacon, Scott Dodelson, Ole Host, Martin Kilbinger, Andrew\nJaffe, Bhuvnesh Jain, Benjamin Joachimi, Ofer Lahav,\nRachel Mandelbaum, Anais Rassat, Alexandre Refregier and\nJochen Weller for helpful discussions.\nRB's and IL's research is supported by NSF CAREER grant AST0844825, NSF grant PHY0968820, NASA\nAstrophysics Theory Program grants NNX08AH27G and\nNNX11AI95G and by Research Corporation. SLB thanks\nthe Royal Society for support in the form of a University\nResearch Fellowship and acknowledges support from European Research Council in the form of a Starting Grant with\nnumber 240672.\n\nA\n\nAPPENDIX: MODIFIED GRAVITY\nFITTING FUNCTION\n\nA.1\n\nFitting function form\n\nSome modified gravity (MG) models, such as f (R) theories, can be tailored to reproduce a selected expansion history. However their predictions for the growth of structure\ncan then differ from that predicted by that expansion history assuming GR. Here we consider a fitting function for\na modified gravity model in which the expansion history\nis described by ΛCDM, but the growth history is modified\nthrough a deviation from GR described by two parameters,\nQ0 and R0 , and a third parameter s which encapsulates the\ntime dependence of the deviation:\nQ(a)\n\n=\n\nR(a)\n\n=\n\n1 + (Q0 − 1)as\n\n1 + (R0 − 1)as .\n\n(55)\n\nIn the main analysis in this paper we have assumed s = 3.\nThe key input into calculating the galaxy position and\nweak lensing shear observables is the matter power spectrum\nas a function of scale, k, and redshift, z. Here we obtain a\nanalytical fit for the ratio of the matter power spectrum\nin the modified gravity model in (55), to that predicted by\nc 2009 RAS, MNRAS 000, 1–18\n\n15\n\nΛCDM for the same cosmological parameters:\nrf it (Q0 , R0 , s) =\n\nP (k)lin,M G\n.\nP (k)lin,ΛCDM\n\n(56)\n\nTo motivate the form of the fit, we note that\nthe behaviour of growth in this model is described in\nBean & Tangmatitham (2010) has two distinct regimes as\ngiven in (7) and (8). On small scales the growth purely depends on the product Q0 R0 , via (7). On large scales, the behaviour involves various derivatives of the modified gravity\nparameters, and the equations depend uniquely on Q0 and\nR0 . Our fit distinguishes between these two regimes in scale,\nand fits the evolution with redshift of the high wavenumber\n('H') and low wavenumber ('L') regime separately. The two\nregimes are joined via a third function, x(k), assuming a\ntransition scale, kc .\nrf it (k, z)\n\n=\n\nrL (z)\n\n≡\n\n[1 − x(k)] rL (z) + x(k)rH (z)\n(57)\n\u0010\n\u0011i\nh\nL3\nL3 Q0\n1 + L1 (1 − R0 ) + L2 e − e\n\u0010\n\u0011\n× eL4 z + L5\n(58)\n(59)\n\nrH (z)\n\n≡\n\nx(k)\n\n≡\n\n\u0010\n\n1 + H1 (1 − Q0 R0 ) e\n\u0014\u0012 \u0013p \u0015\nk\ntanh\nkc\n\nH2 z\n\n+ H3\n\n\u0011\n\n(60)\n(61)\n\nThe values for the 10 fitting parameters\n{L1 , L2 , L3 , L4 , L5 , H1 , H2 , H3 , kc , p}, are obtained using OriginLab's Origin software to fit our custom function\nto the power spectra coming from the CAMB code. While\ns = 1 and s = 3 have been most commonly used choice in\nthe literature, we obtain the fit for s = 1 − 4, using a grid of\nvalues in Q0 and R0 between 0.9 and 1.1. The spectra were\ncalculated at 50 redshift steps in 0 6 z 6 3 and for over a\nhundred values in k ranging from 7 × 10−6 to 40M pc−1 .\nFor s = 3, 23 different {Q0 ,R0 } pairs were used to obtain\nthe fit, for s = 1 and s = 2 a subset of these was used, and\nfound to be sufficient to achieve sub percent accuracy in\nthe Cl s.\nTable A.1 provides the values for the fits parameters for\neach value of s.\nA.2\n\nPerformance\n\nThe fit given above reproduces the ratios of the matter power\nspectrum in (56), derived from CAMB, to better than 0.01%\nfor k > 10kc , within 0.6% around the transition scale, kc ,\nand within 0.8% at scales around the horizon scale today.\nThis is sufficient to reproduce the Cl s in the modified gravity\nscenario to within sub percent (∼0.1%) levels. The error is\nlargest for low ls and increases as s decreases.\nFigure 7 shows the ratio of the matter power spectrum\ntoday for the modified gravity model to that for the fiducial\nΛCDM model for both the fit and the full integration using\nCAMB. At z = 0, where the modifications are largest, as a\nfunction of k, the fit matches the simulations to within 0.8\n% and remains accurate at this level for all z for 5% changes\nin Q0 and R0 .\nWhen calculating the angular correlation function, Cl ,\nthe power spectrum fit is integrated over k, z. Applying the\n\n\f16\n\nI. Laszlo, R. Bean, D. Kirk, S. Bridle\n\nFit Parameter\n\ns=1\n\ns=2\n\ns=3\n\ns=4\n\nL1\n\n0.5293\n\n0.4947\n\n0.4268\n\n0.3635\n\nL2\n\n-4.733\n\n-5.692\n\n-6.300\n\n-6.575\n\nL3\n\n-1.610\n\n-1.660\n\n-1.764\n\n-1.817\n\nL4\n\n-0.8678\n\n-1.610\n\n-2.409\n\n-3.263\n\nL5\n\n0.2878\n\n0.0867\n\n0.0336\n\n0.0156\n\nH1\n\n-0.5655\n\n-0.2023\n\n-0.0984\n\n-0.0557\n\nH2\n\n-0.6144\n\n-1.263\n\n-1.935\n\n-2.718\n\nH3\n\n0.1803\n\n0.0754\n\n0.0317\n\n0.0153\n\nkc\n\n[M pc−1 ]\np\n\n1×\n\n10−3\n\n0.9422\n\n7×\n\n10−4\n\n1.048\n\n6×\n\n10−4\n\n1.076\n\n5 × 10−4\n1.090\n\nTable 4. Summary of values for the 10 parameters used in the\nfitting function, given for each value of s, the power law exponent\nin the modified gravity function (55).\n\nFigure 7. Ratios of z = 0 matter power spectra in modified\ngravity model to the fiducial ΛCDM model obtained via simulation [red] compared with the ratios obtained using the fitting\nfunction [blue]. Two models shown are Q0 = 1, R0 = 0.95 [dashed\nlines] and Q0 = 0.95, R0 = 1 [dotted lines]. At small scales the\ntwo models are degenerate, since the evolution of the matter perturbations is only dependent on the product QR, while at large\nscales their behaviours are distinct. The fitting function provides\nagreement to within 0.01% for most scales. At the transition scale\nk ∼ kc and on horizon scales the fit is a litter poorer, ∼ 0.8%, however this limited range of scales contributes only a small amount\nto the angular correlations Cl used in the analysis.\n\nfit factor to a standard power spectrum, and using this\nfit power spectrum to compute Cl s for galaxy autocorrelations, galaxy-weak lensing cross-correlations, and weak lensing auto-correlations results in sub percent(0.1%) level accuracy, as shown in figure 8.\n\nReferences\nD. Kirk, I. Laszlo, S. Bridle and R. Bean 2011, Optimising\ncosmic shear surveys to measure modifications to gravity\non cosmic scales\nAgustsson I., Brainerd T. G., 2006, Astrophys. J., 644, L25\nAlbrecht A., et al., 2006\nAlbrecht A., et al., 2009\n\nAmarzguioui M., Elgaroy O., Mota D. F., Multamaki T.,\n2006, Astron. Astrophys., 454, 707\nAmendola L., Kunz M., Sapone D., 2008, JCAP, 0804, 013\nBean R., Bernat D., Pogosian L., Silvestri A., Trodden M.,\n2007, Phys. Rev., D75, 064020\nBean R., Tangmatitham M., 2010, Phys. Rev., D81, 083534\nBernstein G. M., 2009, Astrophys. J., 695, 652\nBertschinger E., Zukin P., 2008, Phys. Rev., D78, 024015\nBeynon E., Bacon D. J., Koyama K., 2009\nBlazek J., McQuinn M., Seljak U., 2011, JCAP, 1105, 010\nBlazek J., McQuinn M., Seljak U., 2011, ArXiv e-prints\nBrainerd T. G., Agustsson I., Madsen C. A., Edmonds\nJ. A., 2009\nBrax P., van de Bruck C., Davis A.-C., Li B., Shaw D. J.,\n2011, Phys. Rev., D83, 104026\nBridle S., King L., 2007, New Journal of Physics, 9, 444\nBrown M. L., Taylor A. N., Hambly N. C., Dye S., 2002,\nMon. Not. Roy. Astron. Soc., 333, 501\nCaldwell R. R., Kamionkowski M., 2009, Ann. Rev. Nucl.\nPart. Sci., 59, 397\nCamera S., Diaferio A., Cardone V. F., 2011\nCapozziello S., Carlevaro N., De Laurentis M., Lattanzi M.,\nMontani G., 2011\nCarroll S. M., Press W. H., Turner E. L., 1992, Ann. Rev.\nAstron. Astrophys., 30, 499\nCarvalho F. C., Santos E. M., Alcaniz J. S., Santos J., 2008,\nJCAP, 0809, 008\nCatelan P., Kamionkowski M., Blandford R. D., 2001,\nMonthly Notices of the Royal Astronomical Society, 320,\nL7\nClifton T., Ferreira P. G., Padilla A., Skordis C., 2011\nCopeland E. J., Sami M., Tsujikawa S., 2006, Int. J. Mod.\nPhys., D15, 1753\nCrittenden R. G., Natarajan P., Pen U.-L., Theuns T.,\n2001, Astrophys. J., 559, 552\nCroft R. A. C., Metzler C. A., 2000, Astrophys. J., 545,\n561\nCui W., Zhang P., Yang X., 2010, Phys. Rev., D81, 103528\nDaniel S. F., et al., 2010\nDaniel S. F., Linder E. V., 2010, Phys. Rev., D82, 103523\nDekel A., Lahav O., 1999, Astrophys.J., 520, 24\nDossett J., Moldenhauer J., Ishak M., 2011\nDvali G. R., Gabadadze G., Porrati M., 2000, Phys. Lett.,\nB485, 208\nFaltenbacher A., Li C., White S. D. M., Jing Y.-P., ShuDeMao Wang J., 2009, Research in Astronomy and Astrophysics, 9, 41\nFang W., et al., 2008, Phys. Rev., D78, 103509\nFerraro S., Schmidt F., Hu W., 2011, Phys. Rev., D83,\n063503\nGuo Z.-K., Zhu Z.-H., Alcaniz J. S., Zhang Y.-Z., 2006,\nAstrophys. J., 646, 1\nGuzik J., Jain B., Takada M., 2010, Phys. Rev., D81,\n023503\nHao J., et al., 2011\nHarko T., Lobo F. S. N., Nojiri S., Odintsov S. D., 2011\nHeavens A., Refregier A., Heymans C., 2000, Mon. Not.\nRoy. Astron. Soc., 319, 649\nHeymans C., Heavens A., 2003, Monthly Notices of the\nRoyal Astronomical Society, 339, 711\nHeymans C., White 1 M. J., Heavens A., Vale C.,\nc 2009 RAS, MNRAS 000, 1–18\n\n\fDisentangling dark energy and cosmic tests of gravity from weak lensing systematics\n\n17\n\nFigure 8. A comparison of the ratios of the Cl s in the modified gravity model to the fiducial ones obtained via simulation [red] compared\nto the ratios obtained using the fitting function [blue]. Two models are shown Dashed lines are Q0 = 1.05, R0 = 1.00 [dashed lines] and\nfor Q0 = 0.95, R0 = 1 [dotted lines] . Subpanels left to right indicate correlations in low to high tomographic redshift bins, 1 − 1, 5 − 5,\nand 10 − 10 respectively. The agreement between fit and simulated Cl s is at the level of ∼ 0.1%.\n\nVan Waerbeke L., 2006, Mon. Not. Roy. Astron. Soc., 371,\n750\nHirata C. M., et al., 2004, Mon. Not. Roy. Astron. Soc.,\n353, 529\nHirata C. M., Mandelbaum R., Ishak M., Seljak U., Nichol\nR., Pimbblet K. A., Ross N. P., Wake D., 2007, Monthly\nNotices of the Royal Astronomical Society, 381, 1197\nHirata C. M., Seljak U., 2004, Phys. Rev., D70, 063526\nHu W., Jain B., 2004, Phys. Rev., D70, 043009\nHui L., Zhang J., 2002, ArXiv Astrophysics e-prints\nHwang J.-c., Noh H., Park C.-G., 2010\nIshak M., Upadhye A., Spergel D. N., 2006, Phys. Rev.,\nD74, 043513\nJain B., 2011\nJain B., Khoury J., 2010, Annals Phys., 325, 1479\nJain B., Zhang P., 2008, Phys. Rev., D78, 063503\nJennings E., Baugh C. M., Pascoli S., 2011, Astrophys. J.,\n727, L9\nJoachimi B., Bridle S., 2010, Astron.Astrophys., 523, A1\nJoachimi B., Mandelbaum R., Abdalla F. B., Bridle S. L.,\n2010\nJoachimi B., Mandelbaum R., Abdalla F. B., Bridle S. L.,\n2011, Astronomy and Astrophysics, 527, A26+\nJoachimi B., Schneider P., 2010a\nJoachimi B., Schneider P., 2010b, Astron. Astrophys., 517,\nA4\nKhoury J., Wyman M., 2009, Phys. Rev., D80, 064023\nKing L., Schneider P., 2002, Astronomy and Astrophysics,\n396, 411\nKing L. J., Schneider P., 2003, Astronomy and Astrophysics, 398, 23\nKirk D., Bridle S., Schneider M., 2010, Mon. Not. Roy.\nAstron. Soc., 408, 1502\nKitching T. D., Taylor A. N., 2010\nKnox L., Song Y.-S., Tyson J. A., 2006, Phys. Rev., D74,\n023512\nKunz M., Sapone D., 2007, Phys. Rev. Lett., 98, 121301\nLarson D., et al., 2010\nLaszlo I., Bean R., 2008, Phys. Rev., D77, 024048\nLee J., 2011, Astrophys. J., 732, 99\nLee J., Springel V., Pen U.-L., Lemson G., 2008, Monthly\nc 2009 RAS, MNRAS 000, 1–18\n\nNotices of the Royal Astronomical Society, 389, 1266\nLewis A., Bridle S., 2002, Phys. Rev., D66, 103511\nLewis A., Challinor A., Lasenby A., 2000, Astrophys. J.,\n538, 473\nLinder E. V., 2008, Astropart. Phys., 29, 336\nLinder E. V., 2011\nLombriser L., Hu W., Fang W., Seljak U., 2009, Phys. Rev.,\nD80, 063536\nMa C.-P., Bertschinger E., 1995, Astrophys. J., 455, 7\nMandelbaum R., et al., 2005, Mon. Not. Roy. Astron. Soc.,\n361, 1287\nMandelbaum R., et al., 2009\nMandelbaum R., Hirata C. M., Ishak M., Seljak U.,\nBrinkmann J., 2006, Monthly Notices of the Royal Astronomical Society, 367, 611\nMartinelli M., et al., 2011, Phys. Rev., D83, 023012\nMovahed M. S., Farhang M., Rahvar S., 2009, Int. J. Theor.\nPhys., 48, 1203\nOkumura T., Jing Y. P., 2009, Astrophysical Journal Letters, 694, L83\nOkumura T., Jing Y. P., Li C., 2009, Astrophys. J., 694,\n214\nOyaizu H., 2008, Phys. Rev., D78, 123523\nOyaizu H., Lima M., Hu W., 2008, Phys. Rev., D78, 123524\nPereira M. J., Bryan G. L., 2010, Astrophys. J., 721, 939\nPereira M. J., Kuhn J. R., 2004\nPogosian L., Silvestri A., Koyama K., Zhao G.-B., 2010\nRassat A., Amara A., Amendola L., Castander F. J., Kitching T., et al., 2008\nReyes R., et al., 2010, Nature, 464, 256\nSawicki I., Carroll S. M., 2005\nSchmidt F., Lima M. V., Oyaizu H., Hu W., 2009, Phys.\nRev., D79, 083518\nSchmidt F., Vikhlinin A., Hu W., 2009\nSchneider M. D., Bridle S., 2010, Monthly Notices of the\nRoyal Astronomical Society, 402, 2127\nSilvestri A., Trodden M., 2009, Rept. Prog. Phys., 72,\n096901\nSiverd R. J., Ryden B. S., Gaudi B. S., 2009\nSmail I., Ellis R. S., Fitchett M. J., 1994\nSmith R. E., et al., 2003, Mon. Not. Roy. Astron. Soc., 341,\n\n\f18\n\nI. Laszlo, R. Bean, D. Kirk, S. Bridle\n\n1311\nSong Y.-S., 2006\nSong Y.-S., Dore O., 2009, JCAP, 0903, 025\nSong Y.-S., et al., 2010\nSong Y.-S., Koyama K., 2009, JCAP, 0901, 048\nSong Y.-S., Peiris H., Hu W., 2007, Phys. Rev., D76, 063517\nStabenau H. F., Jain B., 2006, Phys. Rev., D74, 084007\nStril A., Cahn R. N., Linder E. V., 2010, Mon. Not. Roy.\nAstron. Soc., 404, 239\nTakada M., White M., 2004, Astrophysical Journal Letters,\n601, L1\nThomas S. A., Abdalla F. B., Weller J., 2009, Mon. Not.\nRoy. Astron. Soc., 395, 197\nTsujikawa S., 2010, Lect. Notes Phys., 800, 99\nWang Y., et al., 2010, Mon. Not. Roy. Astron. Soc., 409,\n737\nXia J.-Q., 2009, Phys. Rev., D79, 103527\nZhang P., 2006, Phys. Rev., D73, 123504\nZhang P., 2010, Mon. Not. Roy. Astron. Soc., 406, L95\nZhang P., Bean R., Liguori M., Dodelson S., 2008\nZhang P., Liguori M., Bean R., Dodelson S., 2007, Phys.\nRev. Lett., 99, 141302\nZhao G.-B., et al., 2010, Phys. Rev., D81, 103510\nZhao G.-B., Li B., Koyama K., 2011, Phys. Rev., D83,\n044007\nZhao G.-B., Pogosian L., Silvestri A., Zylberberg J., 2009a,\nPhys. Rev. Lett., 103, 241301\nZhao G.-B., Pogosian L., Silvestri A., Zylberberg J., 2009b,\nPhys. Rev., D79, 083513\n\nc 2009 RAS, MNRAS 000, 1–18\n\n\f"}