{"id": "http://arxiv.org/abs/0811.3324v1", "guidislink": true, "updated": "2008-11-20T12:20:58Z", "updated_parsed": [2008, 11, 20, 12, 20, 58, 3, 325, 0], "published": "2008-11-20T12:20:58Z", "published_parsed": [2008, 11, 20, 12, 20, 58, 3, 325, 0], "title": "The adic realization of the Morse transformation and the extension of\n  its action on the solenoid", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0811.2348%2C0811.1948%2C0811.3324%2C0811.3003%2C0811.2018%2C0811.3479%2C0811.4701%2C0811.0840%2C0811.0511%2C0811.0558%2C0811.0237%2C0811.4381%2C0811.1184%2C0811.4212%2C0811.2104%2C0811.0052%2C0811.2959%2C0811.4578%2C0811.0653%2C0811.0029%2C0811.3376%2C0811.0571%2C0811.1629%2C0811.1410%2C0811.1076%2C0811.4412%2C0811.3584%2C0811.2294%2C0811.3999%2C0811.4388%2C0811.3947%2C0811.4257%2C0811.3270%2C0811.4589%2C0811.0308%2C0811.0499%2C0811.2610%2C0811.3242%2C0811.0180%2C0811.2800%2C0811.1980%2C0811.2429%2C0811.3166%2C0811.0996%2C0811.1040%2C0811.0291%2C0811.2238%2C0811.2619%2C0811.3095%2C0811.0486%2C0811.0987%2C0811.1019%2C0811.4493%2C0811.2126%2C0811.3359%2C0811.2640%2C0811.3689%2C0811.2639%2C0811.0333%2C0811.3546%2C0811.3923%2C0811.0588%2C0811.0891%2C0811.2211%2C0811.0900%2C0811.3817%2C0811.3646%2C0811.2401%2C0811.0252%2C0811.4689%2C0811.2605%2C0811.2476%2C0811.4079%2C0811.2020%2C0811.1475%2C0811.0726%2C0811.2328%2C0811.2814%2C0811.2541%2C0811.4664%2C0811.4630%2C0811.0245%2C0811.4109%2C0811.4387%2C0811.0352%2C0811.3417%2C0811.3053%2C0811.3280%2C0811.2747%2C0811.1342%2C0811.3506%2C0811.4771%2C0811.0645%2C0811.2830%2C0811.1770%2C0811.4376%2C0811.1139%2C0811.4018%2C0811.2094%2C0811.0960%2C0811.0870&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The adic realization of the Morse transformation and the extension of\n  its action on the solenoid"}, "summary": "We consider the adic realization of the Morse transformation on the additive\ngroup of integer dyadic numbers. We discuss the arithmetic properties of that\naction. Then we extend that action to the action of the group of rational\ndyadic numbers on the solenoid.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0811.2348%2C0811.1948%2C0811.3324%2C0811.3003%2C0811.2018%2C0811.3479%2C0811.4701%2C0811.0840%2C0811.0511%2C0811.0558%2C0811.0237%2C0811.4381%2C0811.1184%2C0811.4212%2C0811.2104%2C0811.0052%2C0811.2959%2C0811.4578%2C0811.0653%2C0811.0029%2C0811.3376%2C0811.0571%2C0811.1629%2C0811.1410%2C0811.1076%2C0811.4412%2C0811.3584%2C0811.2294%2C0811.3999%2C0811.4388%2C0811.3947%2C0811.4257%2C0811.3270%2C0811.4589%2C0811.0308%2C0811.0499%2C0811.2610%2C0811.3242%2C0811.0180%2C0811.2800%2C0811.1980%2C0811.2429%2C0811.3166%2C0811.0996%2C0811.1040%2C0811.0291%2C0811.2238%2C0811.2619%2C0811.3095%2C0811.0486%2C0811.0987%2C0811.1019%2C0811.4493%2C0811.2126%2C0811.3359%2C0811.2640%2C0811.3689%2C0811.2639%2C0811.0333%2C0811.3546%2C0811.3923%2C0811.0588%2C0811.0891%2C0811.2211%2C0811.0900%2C0811.3817%2C0811.3646%2C0811.2401%2C0811.0252%2C0811.4689%2C0811.2605%2C0811.2476%2C0811.4079%2C0811.2020%2C0811.1475%2C0811.0726%2C0811.2328%2C0811.2814%2C0811.2541%2C0811.4664%2C0811.4630%2C0811.0245%2C0811.4109%2C0811.4387%2C0811.0352%2C0811.3417%2C0811.3053%2C0811.3280%2C0811.2747%2C0811.1342%2C0811.3506%2C0811.4771%2C0811.0645%2C0811.2830%2C0811.1770%2C0811.4376%2C0811.1139%2C0811.4018%2C0811.2094%2C0811.0960%2C0811.0870&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We consider the adic realization of the Morse transformation on the additive\ngroup of integer dyadic numbers. We discuss the arithmetic properties of that\naction. Then we extend that action to the action of the group of rational\ndyadic numbers on the solenoid."}, "authors": ["A. Vershik", "B. Solomyak"], "author_detail": {"name": "B. Solomyak"}, "author": "B. Solomyak", "arxiv_comment": "18 pp, 13 Ref", "links": [{"href": "http://arxiv.org/abs/0811.3324v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0811.3324v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.DS", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.DS", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.NT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "37B10, 30G06", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0811.3324v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0811.3324v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:0811.3324v1 [math.DS] 20 Nov 2008\n\nTHE ADIC REALIZATION OF THE MORSE TRANSFORMATION\nAND THE EXTENSION OF ITS ACTION ON THE SOLENOID\nA. M. VERSHIK AND B. SOLOMYAK\nAbstract. We consider the adic realization of the Morse transformation on the\nadditive group of integer dyadic numbers. We discuss the arithmetic properties of\nthat action. Then we extend that action to the action of the group of rational dyadic\nnumbers on the solenoid.\n\nTo the memory of Alexander Livshits\nSasha Livshits (1950-2008) was the author of one of the most important theorems\nof modern dynamics, which is well-known now, - the theorem about cohomology of\nhyperbolic systems. He proved it when he was a student. Later he worked on many\nother problems of symbolic dynamics, ergodic theory and combinatorics. His deep\nand important ideas made a great impression on those who interacted with him (this\nincludes the second author). The first author considers him the best of his students.\n1. Introduction\nThe Morse dynamical system was discovered by Morse and popularized by HedlundGottshalk. Later is was studied by many authors (see [9, 8] and references there), as\na simplest nontrivial substitution. Moreover, it was historically the first example of\na substitution. It is generated by the Thue-Morse sequence, which was extensively\nstudied from the point of view of combinatorics of words and symbolic complexity\n(see [1, 7] and references there). The new approach to symbolic dynamics and ergodic\ntransformations (adic transformation) which was suggested by the first author [11], can\nbe applied also to substitutions (stationary adic transformations); this was done in the\npaper of A. Livshits and the first author ([13]). Later, other authors developed this\nconnection in the context of topological dynamics, see [5, 4], but here our focus is on\nmeasure-preserving transformations. The adic realization of a substitution dynamical\nDate: August 28, 2018.\n1\n\n\f2\n\nA. M. VERSHIK AND B. SOLOMYAK\n\nsystem allows one to consider simultaneously not only the substitution itself but also\nthe one-sided shift which accompanies any substitution. The idea which was advocated\nby the first author in [12] is to consider the natural extension of that shift and correspondingly extend the substitution system in order to make an essential link between\nthe theory of substitutions and hyperbolic dynamics. In this paper we consider the\n\"two-sided extension\" of the Morse system which yields the Morse action of the countable group Q2 (the group of dyadic rational numbers) on the group of its characters -\nb2 , reworking more carefully and correcting some details of [12]. We obtain\nsolenoid Q\n\nalso some new properties of the adic realization of the Morse transformation. One\nof the corollaries of the adic approach is an explicit calculation which shows how to\n\nobtain the Morse system as a time-change of the dyadic odometer. The operation of\ndifferentiation of dyadic sequences plays an important role in our constructions. The\nspectral theory of the Morse system, which goes back to Kakutani [6] (see also [9, 8]\nand references there) is also becoming more transparent under these considerations,\nbut we do not address it in this paper.\nIn Section 2 we collect a series of auxiliary results, which use the adic realization\nof the Morse system; some of them new, others are well-known, but we give their\nadic version. We discuss in more detail (than in [12]) the so-called \"Morse arithmetic\".\nSection 3 describes the two-sided extension of the Morse transformation and embedding\nb2 . We also formulate some\nof it to the Morse action of the group Q2 on the group Q\n\nproblems.\n\nOne should consider this article as an attempt, looking at the special case of the\n\nMorse transformation, to attack the general problem of defining a two-sided extension\nof a substitution system, and corresponding to this extension its embedding into an\naction of a larger group. The final goal of the constructions is to show the link between\nthe theory of substitutions and of hyperbolic systems.\nThe first author thanks to Max Plank Institute for Mathematical Physics in Bonn and\nErwin Schrodinger International Institute for Mathematical Physics in Vienna where\nthis article was finished, and Russian funds RFBR-08-01-000379a, NSh-2460.20081112.\nThe research of the second author was supported in part by NSF grant DMS-0654408.\n\n\fEXTENSION OF THE MORSE TRANSFORMATION\n\n3\n\n2. Definitions and adic realizations of Morse system.\n2.1. Morse as a substitution system. Consider the alphabet {0, 1}. The Morse\nsubstitution is defined by ζ(0) = 01, ζ(1) = 10; it is extended to words in {0, 1} by\nconcatenation. The Thue-Morse sequence (sometimes also called Prouhet-Thue-Morse\nsequence) is a fixed point of the substitution\n(1)\n\nu = u0 u1 u2 . . . = lim ζ n (0) = 0110100110010110 . . .\nn→∞\n\nIt has many remarkable features, see e.g. [1] and [8, Ch.2, Ch.5]. It is easy to see that\nu[0, 2n+1 − 1] = u[0, 2n − 1] u[0, 2n − 1] for n ≥ 0,\nwhere we denote u[i, j] = ui . . . uj and w is the \"flip\" of a word w in the alphabet\n{0, 1}, that is, we interchange 0 ↔ 1. The sequence u is non-periodic, but uniformly\nrecurrent, with well-defined uniform frequencies of subwords. It is also known that un\nis the sum of the digits (mod 2) in the binary representation of n.\nLet σ be the left shift on the spaces {0, 1}N and {0, 1}Z with the product topology.\nThe substitution dynamical system is sometimes considered on the space of one-sided\nsequences, and sometimes on the space of two-sided sequences.\n\n1\n\nThe \"one-sided\" substitution space is defined as the orbit closure of u under the\nshift:\nXζ+ = clos{σ n u : n ≥ 0}.\nThe \"two-sided\" substitution space is defined as the set Xζ of all bi-infinite sequences in\n{0, 1}Z whose every block (subword) occurs in u. The substitution dynamical systems\nare (Xζ+ , σ) (one-sided) and (Xζ , σ) (two-sided). The advantage of the two-sided system\nis that it is a homeomorphism, whereas the one-sided is not. Measure-theoretically\nthese two systems are isomorphic: in fact, both are minimal and uniquely ergodic,\nand the one-sided system is a.e. invertible. The restriction of any point in Xζ to nonnegative coordinates is in Xζ+ , and all but countable many elements of Xζ+ have a\nunique extension to points in Xζ . The exceptions are u, which extends to u . u and\nu . u, and its \"flip\" u, as well as their orbits.\n1We\n\nbelow.\n\nhave used above the notion \"one-sided\" and \"two-sided\" in completely different sense, see also\n\n\f4\n\nA. M. VERSHIK AND B. SOLOMYAK\n\n2.2. Adic realization. Here we follow the general definition of the adic transformation\nfrom [11] and [13], but focus only on the Morse system as it was done in [12]. Consider\nZ2 ∼\n= {0, 1}N , the compact additive group of 2-adic integers, and the odometer (\"adding\nmachine\") transformation T , which is adic transformation by definition - this is group\ntranslation on Z2 (see below). We obtain the adic realization of Morse transformation\nby changing the order of symbols 0, 1 depending on the next symbol. Namely, consider\nthe lexicographic order on Z2 induced by\n0 ≺0 1, 1 ≺1 0\nas follows:\n{xi } ≺ {yi } ⇐⇒ ∃ j : xi = yi for i > j and xj ≺z yj , where z = xj+1 = yj+1.\nThis is a partial order; two sequences are comparable if they are cofinal (agree except\nin finitely many places). The set of maximal points is Max = {(01)∞ , (10)∞ }, and the\nset of minimal points is Min = {(0)∞ , (1)∞ }.\n\n2\n\nLet M be the immediate successor\n\ntransformation in the order ≺ on Z2 . Here we write down the formulas for the action\nof M explicitly. If x 6∈ Max, then x starts with (01)n 00 or (01)n 1, or (10)n 0, or (10)n 11,\nwhere n ≥ 0. We have\nM((01)n 00∗) = (12n+1 0∗),\n\n(2)\n\nM((10)n 0∗) = (12n 0∗),\n\nM((01)n 1∗) = (02n 1∗),\nM((10)n 11∗) = (02n+1 1∗)\n\nNote that it is well-defined everywhere except on the two maximal points: Max =\n{(01)∞ , (10)∞ }. It is easy to see that M is continuous on Z2 \\ Max. But it is impossible to extend M by continuity to those points: there are no well-defined limits of\nlimn→∞ M((01)n ∗), and limn→∞ M((10)n ∗), because\nlim M((01)n 00∗) = (1)∞ ,\n\nn→∞\n\nbut\nlim M((01)n 1∗) = (0)∞ .\n\nn→∞\n\nAnalogously,\nlim M((10)n 00∗) = (1)∞ ,\n\nn→∞\n2We\n\ndenote infinite periodic sequence with period (ab . . . c) as (ab . . . c)∞ .\n\n\fEXTENSION OF THE MORSE TRANSFORMATION\n\n5\n\nbut\nlim M((10)n 1∗) = (0)∞ .\n\nn→∞\n\nSince we also have two minimal points, we can extend M to a bijection arbitrarily,\nsetting\nM((01)∞ ) = (1)∞ ,\n\n(3)\n\nM((10)∞ ) = (0)∞ ,\n\nor vice versa. But this extension is not continuous at those points.\nThe obvious corollary of the definition of M is that it commutes with \"flips,\" that\nis,\n(4)\n\nM(x) = M(x) for all x ∈ Z2 .\n\nThe action of M on Z2 \\ Max may be expressed as follows: we scan the sequence x\nto the right until we see two identical symbols aa and replace the beginning of the\nsequence by a . . . aa, keeping the second occurrence of a and everything that follows\nunchanged.\n2.3. The relation of adic model to traditional representation. Now we indicate\nthe relation between the dynamical systems (Z2 , M) and (Xζ , σ). Let\ng : Z 2 → Xζ ,\n\ng(x) = {(M n−1 x)0 }n∈Z .\n\nWe have the following diagram:\nM\n\nZ2 −−−→\n\ng\ny\nσ\n\nZ2\n\ng\ny\n\nXζ −−−→ Xζ\n\nIt is obvious from the definition that the diagram commutes. It is also easy to see that\ng\ng and g(0∞ ) = u . u. Here we denoted by Max\ng is surjective, continuous on Z2 \\ Max,\n\nthe set of points in Z2 which are cofinal with the points in Max (equivalently, their left\nsemi-orbit).\n\nIt may be useful to write down g −1 explicitly. Consider the substitution map on Xζ :\nζ : Xζ → Xζ , ζ(. . . a−2 a−1 . a0 a1 . . .) = . . . ζ(a−2 )ζ(a−1) . ζ(a0 )ζ(a1) . . .\nIt is well-known (and easy to see) that for every a ∈ Xζ there is a unique a′ ∈ Xζ\nsuch that either a = ζ(a′ ) or a = σζ(a′), and these cases are mutually exclusive. Let\n\n\f6\n\nA. M. VERSHIK AND B. SOLOMYAK\n\nΨ : Xζ → Xζ be given by Ψ(a) = a′ . Then we have the following commutative\ndiagram:\nσ\n\nZ2 −−−→\n\ng\ny\nΨ\n\nZ2\n\ng\ny\n\nXζ −−−→ Xζ\n\nwhere σ is the left shift on Z2 . Therefore, to compute the n-th symbol of g −1(a) we\nneed to take (Ψn (a))0 for n = 0, 1, 2 . . .\nNow let us explain why this model is richer than the \"two-sided\" model Xζ . In the\nadic realization, we have the adic transformation, which is isomorphic, up to neglecting\nof two orbits, to the substitution, AND we have the one-sided shift in the space Z2 .\nEvolution under the adic transformation of the first digit x0 of the sequence {xi } ∈ Z2\njust gives the orbit of u under the transformation σ on Xζ . The one-sided shift in the\nspace Z2 in terms of substitutions is the substitution itself - i.e. the transformation\nof any sequence which substitutes 0 by 01 and 1 by 10. So we have in the adic model a\nsimultaneous realization of both transformations: the adic and the shift (substitution).\nThe problem arises how to include in this picture the natural extension of the one-sided\nshift - the two-sided shift, and at the same time how to extend the adic transformation\nto the whole space. We will do this in the next section but first we interpret a familiar\nproperty of the Morse system in our terms.\n2.4. Morse as a 2-point extension of the odometer.\nDefinition 2.1. The classical 2-odometer is the following affine transformation T on\nthe additive group Z2 of dyadic integers:\nT : T x = x + 1.\nThe transformation T preserves the Haar (=Bernoulli, Lebesgue) measure on the\ngroup Z2 . It is well-known that the Morse system can be represented as a group (2point) extension of the dyadic odometer. This is the most popular point of view on\nthe Morse system in dynamics. The adic realization of the Morse transformation gives\nanother way to look at this fact; it is an illustration of the importance of the so-called\ndifferentiation of sequences.\nDefine the important map:\n\n\fEXTENSION OF THE MORSE TRANSFORMATION\n\n7\n\nDefinition 2.2. Differentiation of sequences is the map D : Z2 → Z2 :\nD({xn }∞\nn=0 ) = {(xn+1 − xn ) mod 2, n = 0, 1, . . . }.\nThis is nothing other than a 2-to-1 factorization of Z2 on itself. It is clear that the\ndifferentiation commutes with the \"flip\" which has been defined above: D(x) = D(x).\nIn spite of simplicity of the definition of the map D : Z2 → Z2 , there are no good and\nsimple \"arithmetic\" or \"analytic\" expressions for the description of D(*). Recently V.\nArnold for different reasons made many experiments on the behavior of 0-1 sequences\nunder the iteration of differentiation [2]. But the most important thing for us is that\nthe map D takes the Morse transformation into the odometer:\nProposition 2.3. The following equality takes place: T ◦ D = D ◦ M.\nThis is an immediate corollary of (2). So in the adic realization, the Morse transformation M is a 2-covering of the odometer in its algebraic form. Let us give a precise\ndescription of the equivalence between the Morse transformation and a 2-extension of\nthe odometer. Let F (x) = (Dx, x0 ) be the map from Z2 to Z2 × {0, 1}. This is a\nbijection, and we have the following commutative diagram:\nZ2\n\n\nyF\n\nM\n\n−−−→\n\nT (φ)\n\nZ2\n\n\nyF\n\nZ2 × {0, 1} −−−→ Z2 × {0, 1}\nHere T (φ) is a 2-extension of T with a cocycle φ on Z2 defined by\n(\n0 if y starts with odd number of 1's\n(5)\nφ(y) =\n1 if y starts with even number of 1's\nTo make it work on maximal elements we also need to set φ(1∞ ) = φ(0∞ ) = 1. Recall\nthat the group extension is defined by\nT (φ)(x, g) = (T x, φ(x) + g).\nWe have\nM = F −1 T (φ)F,\nso M is canonically isomorphic to a 2-extension of the odometer T with cocycle φ. We\ncan identify Z2 with Z2 × {0, 1} regarding the second component {0, 1} as a new digit\n\n\f8\n\nA. M. VERSHIK AND B. SOLOMYAK\n\nof a sequence; then the map F becomes a transformation of Z2 , and we can consider\nthe extension inside the group Z2 . We give another interpretation of this cocycle in\nthe next section.\nRemark. The Morse system can also be realized as a 2-point extension of the\nodometer in the traditional substitution form, and it is interesting that the projection\nis again given by the differentiation map. This follows from the fact that for the\nThue-Morse sequence u (see (1)), its derivative sequence D(u) = 1011101010 . . . is the\nfixed point of the substitution 0 → 11, 1 → 10 (see [1, p.201]), which generates a\nmeasure-preserving transformation isomorphic to the 2-odometer.\nDenote by S the map x → 2x on Z2 , this is nothing other than the one-sided noninvertible shift or Bernoulli endomorphism if we represent the elements of Z2 as a\nsequence of 0's and 1's. It is easy to check the following fact.\nProposition 2.4. The 2-odometer as well as the Morse transformation satisfy the\nfollowing equation:\nT S = ST 2 ,\n\nMS = SM 2 .\n\n2.5. Morse as a time change of the odometer and Morse arithmetic. Because\nthe group of rational integers Z is a dense invariant subgroup of the group of dyadic\nintegers, we can consider the Morse transformation M in the adic realization as a map\nof integers to itself. This subsection is based on [12, p.538], but we provide more details.\nLet us identify a sequence x0 x1 x2 . . . with the dyadic decomposition of a number:\nP\nj\nj xj 2 . Here is the list of several first values of M(n):\n0 1 2 3 4\n\n5\n\n6 7 8\n\n9\n\n10 11 12 13 14 15 . . .\n\n1 3 7 2 5 15 4 6 9 11 31 10 13\nThe table can be easily verified using (2).\nTo this end, we introduce the following sequence:\n r\n 2 3−1 if r ≡ 0 (mod 2),\nar =\n 2r −2 if r ≡ 1 (mod 2).\n3\n\n8\n\n12 14 . . .\n\n\fEXTENSION OF THE MORSE TRANSFORMATION\n\n9\n\nEach n ∈ N is uniquely represented in one of the following ways (r = r(n)):\n(\n2r l + ar−1\n(i),\n(6)\nn=\nr\nr−1\n2 l+2\n+ ar (ii),\nwhere l ≥ 0 is an integer. Define the mapping M : N → N \\ {0} by\n(\nn + ar(n) in the case (i),\n(7)\nM(n) =\nn − ar(n) in the case (ii).\nAlthough these formulas look a bit mysterious, they easily follow from (2). In fact,\n2r − 1\n2r − 2\n= (10)(r−2)/2 , r ≡ 0 (mod 2), ar =\n= (01)(r−1)/2 , r ≡ 1 (mod 2).\n3\n3\nCase (i) above occurs when the first pair aa in the binary representation of n is 00.\nar =\n\nThen M(n) replaces the beginning of the sequence with 1's, which increases the number\nby ar(n) (observe that ar−1 + ar = 2r−1 − 1 = (1)r−1 independent of the parity of r).\nSimilarly, the case (ii) above occurs when the first pair aa in the binary representation\nof n is 11. In this case M(n) decreases or increases the number n by ar(n) .\nThus, we have described independently the restriction of the adic Morse system\nto N; that is why we use the same symbol M. Define M for negative integers by\nM(−n) = −M(n − 1) − 1. Then it is easy to check that we have the properties\nM(x) = M(x) where n = −n − 1; this should be understood by identifying integers\nwith their binary expansions. Thus, we have M : Z → Z\\ {0, −1}. Note that 0 = (0)∞\nand −1 = (1)∞ are the two minimal points in our ordering on Z2 . According to (3),\nM(−1/3) ≡ M((10)∞ ) = (0)∞ ≡ 0 and M(−2/3) ≡ M((01)∞ ) = (1)∞ ≡ −1.\n2.6. The orbit equivalence of Morse system and 2-odometer. The orbit of the\npoint x ∈ X with respect to an invertible transformation S of X is a set of S n x, n ∈ Z.\nEvidently, the T -orbit of any point x ∈ Z2 which has infinitely many 0's and 1's is the\nset of all points which are eventually equal to x. The set of all points which have\nfinitely many 0's or 1's make one orbit (this is the common T -orbit of (0)∞ and (1)∞ ).\nLet us describe the orbit partition of Morse transformation, which follows directly from\nthe definition (2).\nProposition 2.5. If a point x ∈ Z2 has infinitely many subwords 00 and subwords\n11, then the M-orbit of x is the set of all points which are eventually equal to x;\n\n\f10\n\nA. M. VERSHIK AND B. SOLOMYAK\n\nthe remaining countable set of the points which have finitely many subwords 00 or\nsubwords 11, is just the union of four semiorbits of M: two positive M-semiorbits\n(Z+ M-orbit)- of the point (0)∞ and point (1)∞ , and two negative M-semiorbits (Z−\nM-orbit) - of the point (10)∞ and point (01)∞ .\nNote that the negative M-semiorbit of (10)∞ (correspondingly (01)∞ ) consists of the\nset of points which are eventually (10)∞ (correspondingly (01)∞ ) and have an initial\neven word.\nCorollary 2.6. Orbit partitions of the 2-odometer and the adic realization of the Morse\ntransformation coincide ( mod 0) with respect to the Haar (Lebesgue) measure on Z2 .\nAs we saw, they coincide on the complement of a countable set. We will refine this\nclaim below.\nUsing our extension of M by the definition (3) we can make an additional remark\nabout those four semiorbits; we do not use it later. Note that two positive M-semiorbits\ngenerate one T -orbit, and each negative M-semiorbit is a full T -orbit. So in our\ndefinition (3) we cut one T -orbit of (0)∞ and (1)∞ and glue the first part (0∞ ) with\nthe M-semiorbit of the point (10)∞ , and the second part (1∞ ) with the M-semiorbit\nof the point (01)∞ .\nIf x ∈ N ⊂ Z2 then we can write tautologically\nM(n) = T M (n)−n (n),\nwhere in the left-hand side M(n) is the image of n under the transformation M, and\nin the right-hand side M(n) is a natural number. Now observe that by the definition\nof the action of the Morse automorphism M on the set of integers defined by (7) above\nwe have:\nM(n) − n = (−1)r(n) * ar(n) .\nIt is worth mentioning here that the value of the cocycle φ(n) from the previous\nsubsection is exactly M(n) − n (mod 2), e.g. it is equal to 0 iff n and M(n) have the\nsame parity.\nDenote\nθ(n) = (−1)r(n) * ar(n) ,\n\n\fEXTENSION OF THE MORSE TRANSFORMATION\n\n11\n\nthen we have the formula\nM(n) = T θ(n) n\nfor each rational integer n. It is clear that the function r(*) and consequently the\nfunction θ(*) can be extended from positive integers N to the group of all dyadic\nintegers Z2 as follows: formula (5) makes sense for all x ∈ Z2 with some r ∈ N and\nl ∈ Z2 , not only for integers x, with the same definition. We just consider infinite\nsequences of xn . So θ(*) becomes a function on Z2 with integer values; we can say that\nthis is simply the extension of θ(*) by continuity in the pro-2-topology.\nWe have proved the following:\nTheorem 2.7. Let M be the adic realization of the Morse transformation in the space\ng ∪ Min\ng be the countable set which is union of the semi-orbits under the\nZ2 . Let Max\naction of M of the four points of Z2 :\n\n(0)∞ , (1)∞ , (01)∞ , (10)∞ .\ng ∪ Min)\ng the odometer T : T x = x + 1 and the\nThen on the M-invariant set Z2 \u001f(Max\n\nMorse transformation M have the same orbit partition, and moreover,\nMx = T θ(x) x for\n\nwhere θ(x) is the function defined above.\n\ng ∪ Min),\ng\nx ∈ Z2 \u001f(Max\n\nThe formula above gives an independent definition of the Morse transformation using\na time change of the odometer.\nDye's Theorem asserts that any ergodic automorphism S is isomorphic (mod 0) to\nan automorphism which is a time change of the odometer T (or any other given ergodic\nautomorphism): Sx = T θ(x) (x). Nevertheless, there are few examples of an explicit\nformula for such a time change function θ(*). The theorem above is just of this type: the\nMorse automorphism is represented as a time change of the dyadic odometer. It is also\nknown (see [3], theorem 3.8) that the time change integer-valued function θ(*) cannot\nbe integrable if ergodic automorphisms have the same orbits, unless T = S or T = S −1 .\nIt is easy to check that our function θ is indeed non-integrable because it has exactly\ntwo singularities on the space Z2 at the points (01)∞ (≡ −1/3), and (10)∞ (≡ −2/3),\nand the measure of the cylinder on which the values of θ(x) are equal to ar is of order\nC2−r , hence the singularities have the type of simple poles 1/t. The weakness (closeness\n\n\f12\n\nA. M. VERSHIK AND B. SOLOMYAK\n\nto integrability) of these singularities shows that the Morse automorphism is in a sense\nvery close to the odometer, i.e. to an automorphism with discrete spectrum.\nQuestion. What is the group generated by two transformations of Z2 - the odometer T and the Morse transformation M? Is it a free group?\n3. Extension of the Morse transformation up to action of the group\nQ2 on the solenoid\nIn this section we define the so-called two-sided extension of the Morse transformation which acts on the group of characters of dyadic rational numbers. It is an\nelaboration of [12, p.539] with important changes and additions.\nb2 , etc. Consider the exact\n3.1. Preliminary facts about dyadic groups Q2 , Q\n\nsequence\n\n1 −→ Z −→ Q2 −→ Q2 /Z −→ 1\n\nwhere Q2 is the countable additive group of real dyadic rational numbers (r/2m , r ∈\nZ, m ≥ 0), the subgroup Z ⊂ Q2 is the group of rational integers, and the quotient\ngroup Q2 /Z is the group of all the roots of unity of orders 2n , n = 0, 1, . . . (a subgroup\nof the rotation group).\nThe group Q2 can be presented as an inductive limit\nlim (Z, wn ),\n\n−→n\n\nof the groups Z, with the embedding of n-th group given by\nwn (x) = 2x,\n\nn = 0, 1 . . . .\n\nConsider the corresponding dual exact sequence for the groups of characters of the\ngroups above:\nb2 ←− Z2 ←− 1\n1 ←− R/Z ←− Q\n\nThe group of characters of the group Q2 /Z is just the additive group of dyadic integers,\nZ2 , which we considered in the previous sections, and which is the inverse limit of 2n cyclic groups:\nZ2 = lim(Z/2n , pn ),\n←−\n\n\fEXTENSION OF THE MORSE TRANSFORMATION\n\n13\n\nwith the maps pn : Z/2n → Z/2n−1 , pn (x) = x mod 2n−1 . The group of characters of\nthe group Z is the rotation group S 1 = R/Z (or the unit circle).\nb2 of characters of the group Q2 , is the so-called\nOur main object - the group Q\n2-solenoid and can be presented as an inverse limit of the rotation groups:\nb2 = lim (R/Z, vn+1 ), n = 0, 1, . . .\nQ\n←−n\n\nwhere the homomorphisms are\n\nvn : R/Z → R/Z, vn (u) = 2u, n = 1, 2, . . . .\nb2 of those elements which have the\nThe group Z2 is a closed subgroup of the group Q\n\nzero projection on R/Z equal to 0.\n\nb2 as\nThe additive group Q2 of dyadic rational numbers is naturally embedded into Q\n\na dense subgroup; it consists of those characters which send the elements of the group\nQ2 to the roots of unity of degree 2n .\n\nNote that the additive group of the locally compact field Q2 of all 2-adic number is\nb2 as a dense subgroup of those elements of Q\nb2 ,\nnaturally embedded into the solenoid Q\n\nb2 → R/Z to a root of unity of degree 2n\nwhich have the projection under the map Q\nfor some n:\n\nb2 .\nQ2 ⊂ Q\n\nb2 has a normalized Haar measure which is the product of\nAs a compact group, Q\n\nHaar measures on the groups Z2 and R/Z.\nb2 is not the direct product of the subgroups Z2 and the quotient group\nThe group Q\n\nR/Z; there is a nontrivial 2-cocycle Z2 of the group R/Z with values in Z (integer part\n\nof product). But there is a non-algebraic decomposition into the direct product of the\nsubgroup and the quotient group:\nb2 = R/Z × Z2 .\nQ\n\nHere the first component of the decomposition is realized as the first unit circle (for\nn = 0 in the definition of the projective limit above). The second component is the\nb2 which consists of the elements which have the second coordinate in\nsubgroup Z2 ⊂ Q\n\nthe decomposition equal to 1 ∈ R/Z. This decomposition gives the coordinatization of\nb2 .\nthe group Q\n\n\f14\n\nA. M. VERSHIK AND B. SOLOMYAK\n\nBecause the group Q2 of dyadic rational numbers can be represented as the group\nof all finite on both sides two-sided sequences of 0's and 1's with the usual binary\nexpansion over 2n , n ∈ Z, one can think that the analog of such decomposition for the\nb2 is also true. Moreover, we have used one-sided sequences with positive indices\ngroup Q\nfor parametrizations of the elements of the subgroup Z2 , and that parametrization\n\nagrees with the group structure of 2-adic integers. Thus, it is tempting to consider\nb2 of characters of the group Q2 as a compact space of all two-sided\nthe whole group Q\nQ\nZ\ninfinite {0, 1} sequences: X = +∞\n−∞ {0, 1} = {0, 1} . But this is not correct, because\n\nthere is no needed group structure on the space X. Nevertheless, it is possible to define\nb2 with the help of the usual dyadic decomposition of the points of the\na map π : X → Q\n\nunit interval (0, 1) as follows: let {xn }, n ∈ Z, be a point of X; define the pair (y, λ),\nwhere y ∈ Z2 is generated by the sequence {xn , n ≥ 0} as in Section 1,\nλ=\n\n∞\nX\n\nx−n 2−n .\n\nn=1\n\nDenote this map by π:\n(8)\n\n+∞\nY\nb2 ,\nπ:\n{0, 1} −→ Q\n\nπ : {xn } 7→ (y, λ).\n\n−∞\n\nThe map π is not an isomorphism of the groups or even topological spaces but trivially\nis an isomorphism (mod 0) of the measure spaces, where the measure on the space\nb2 , it is the Haar\nX is the (1/2, 1/2) Bernoulli (product) measure, and on the group Q\nb2 and consider it not as solenoid but\nmeasure. So, if we ignore the group structure of Q\n\nas a symbolic space with measure-preserving transformations (odometer, Morse, etc.),\nQ\nb\nthen it is convenient to use the canonical map π; +∞\n−∞ {0, 1} → Q2 , which identifies\n\nonly countably many pairs of points. Roughly speaking, we can consider the 2-solenoid\nb2 as the space X of all two-sided sequences 0's and 1's after some identifications of\nQ\n\nelements from the negative (left) side, which (identification) corresponds to the nonuniqueness of dyadic decomposition on the left side.\n\n3.2. Some transformations and differentiation on the solenoid. There is a\nb2 : the multiplication by 2; it is conjugate to\ncanonical automorphism Sb on the group Q\n\nthe automorphism S ∗ of the group Q2 - the multiplication by 1/2. The transformation\nSb is a hyperbolic automorphism of the solenoid and in the usual coordinatization it is\n\n\fEXTENSION OF THE MORSE TRANSFORMATION\n\n15\n\njust the Bernoulli 2-shift and natural extension in Rokhlin sense [10] of the one-sided\nshift S of the space Z2 . which was defined in he section 2.\nNow we define the two-sided version of 2-odometer. Let 1 be the unit of the ring Z2\n(unity of the multiplicative group). We extend the odometer T from Section 2, using\nnotation Tb, by the same formula\nTbx = x + 1,\n\nb2 . It is useful to keep in mind that 1 is a character of\nwhere x now is an element of Q\nthe group Q2 which sends integers Z ⊂ Q2 to 1.\nThe action of Tb does not change the second (left)component in the decomposition\nb2 = Z2 × R/Z, so it is indeed an extension of T . Note that Tb is not an ergodic\nQ\n\nb2 , whereas T is ergodic on Z2 . We can define also the family of\ntransformation of Q\nodometer-transformations\n\nT0 := Tb, Ti := S i T0 S −i , i ∈ Z.\n\nb2 is the action of the group\nIt is clear that Ti and Tj commute and its joint action on Q\nb2 ; this is the translation on the corresponding elements, as mentioned above.\nQ2 on Q\n\nWe claim that\n\nTi2 = Ti+1 , i ∈ Z.\n\n(9)\n\nIndeed, this is immediate for i = 0 and hence for all i.\nTogether with the shift Sb the odometers Ti generate a solvable group (wreath prodP\nb2 is continuous and localuct) Z ⋌ Z Z; the action of this group on the group Q\n\ntransversal in the sense of the paper [12].\nb as a transformation of X which extends the map D to\nDefine the differentiation D\nthe space of two-sided sequences.\n\n+∞\nb\nD({x\nn }−∞ ) = {(xn − xn+1 ) (mod 2)}\n\nb2 by D\ne = π◦D\nb ◦ π −1 ,\nWe can, of course, define the differentiation on the solenoid Q\nb identifies a two-sided sequence\nwhich is well-defined almost everywhere. Observe that D\n\nb2 we have\nx̃ with its \"flip\" x̃, and hence almost everywhere on Q\n\ne λ) = D(z,\ne γ) ⇐⇒ (y, λ) = (z, γ) or (y, λ) = (z, 1 − γ).\nD(y,\n\n\f16\n\nA. M. VERSHIK AND B. SOLOMYAK\n\ne in terms of\nAs we mentioned above, it is difficult to give a precise formula for D\n\ncharacters.\n\n3.3. Extension of the Morse transformation. Now we would like to extend the\nb2 and space X.\nMorse transformation M from the subgroup Z2 to the whole group Q\n\nc: it must be a 2-extension of the\nWe want to have the following properties of M\nextended odometer Tb, namely, the relation generalizing Proposition 2.1 must be valid:\n\n(10)\n\nand it should be an extension:\n\nb =D\nb ◦M\nc,\nTb ◦ D\nc|Z = M.\nM\n2\n\nTheorem 3.1. There is a unique transformation of the space X which satisfies the\nf on Q\nb2 via\nlast two equations. Then it defines a measure-preserving transformation M\nf= π◦M\nc ◦ π −1 , where π is defined by (8).\nM\nProof. The uniqueness is clear, and the existence can be shown as follows. The\n\nsequences of the space X can be divided into positive and negative parts: for x̂ =\n(. . . x−1 , x0 , x1 . . . ) denote x− = (. . . x−2 , x−1 ) and x+ = (x0 , x1 . . . ). Then we can\ndefine\nc(x̂) ≡ M\nc((x− , x+ )) =\nM\n\n(11)\n\n(\n\n(x− , M(x+ )), if φ(x+ ) = 0\n(x− , M(x+ )), if φ(x)+ = 1.\n\nHere φ is the cocycle defined in (5). Verification of (10) is immediate.\nb2 we get an explicit formula for the Morse transformation:\nOn the solenoid Q\nf(y, λ) = (My, λ) if φ(y) = 0,\nM\n\n(Here y corresponds to x+ in X.)\n\nf(y, λ) = (Ma, 1 − λ) if φ(y) = −1.\nM\n\n\u0003\n\nc is not \"local\" in the sense that it does change negative coordinates\nObserve that M\n\nwhen the cocycle does not vanish.\ng which is a set of full (Haar)\nc is continuous on {x ∈ Q\nb2 : x+ 6∈ Max},\nThe extension M\n\nmeasure.\n\nc = M0 and define Mi = S i M0 S −i ; clearly, we have\nDenote M\n\n(12)\n\nb=D\nb ◦ Mi ,\nTi ◦ D\n\n\fEXTENSION OF THE MORSE TRANSFORMATION\n\n17\n\nb commutes with S.\nbecause D\n\nTheorem 3.2. The group of transformations, generated by Mi , i ∈ Z, is algebraically\nisomorphic to the group Q2 :\nMi+1 = Mi2 , i ∈ Z.\n\n(13)\n\nb2 . For all i, Mi is a 2-point\nThus, we get a new (Morse) action of the group Q2 on Q\n\nextension of Ti .\n\nProof. We only need to check (13); other statements follow immediately. Using\nb = DS\nb and Ti+1 = T 2 , we obtain that DM\nb i+1 = DM\nb 2 . It remains to observe that\nSD\ni\n\ni\n\ng \u0003\nMi+1 (x̂) and Mi2 (x̂) are cofinal (agree sufficiently far to the right) for all x 6∈ Max.\n\nWe have defined two canonical measure-preserving actions of the solvable group Z ⋌\nb2 - the first is generated by the odometer (this is an algebraic action), and\nQ2 on Q\n\nthe second which is generated by the Morse action. Remember that the Morse action\nis continuous only almost everywhere.\nQuestions.\n\n1. Find the cocycle which defines the Morse action as a 2-extension of the algebraic\naction analogously to formula (5).\n2. Give formula analogous to the formula of Theorem 2.7 which gives the Morse\naction on the solenoid as a time change of the algebraic action.\n3. How can we characterize both actions of the group Z ⋌ Q2 in an intrinsic way?\nReferences\n[1] J.-P. Allouche and J. Shallit, Automatic sequences. Theory, applications, generalizations, Cambridge University Press, Cambridge, 2003.\n[2] V.I.Arnold. Complexity of finite sequences of zero and ones and geometry of finite space of\nfunctions Funct. Anal. Other Math. 1 (2006), no. 1, 1-15.\n[3] R.Belinskaya. Partitions of Lebesgue space on trajectories defined by ergodic automorphisms.\nFunc. Anal. and its Appl. 2 1968, no. 1, 190-199.\n[4] F. Durand, B. Host, and C. Skau, Substitutional dynamical systems, Bratteli diagrams and\ndimension groups, Ergodic Theory Dynam. Syst., 19 (1999), 953–993.\n[5] A. Forrest, K-groups associated with substitution minimal systems, Isr. J. Math., 98 (1997),\n101–139.\n\n\f18\n\nA. M. VERSHIK AND B. SOLOMYAK\n\n[6] S. Kakutani, Ergodic theory on shift transformations, Proc. 5th Berkeley Symp. Math. Statist.\nProbab. II, Berkeley, CA, 1967, pp. 405–414.\n[7] Y. Moshe, On the subword complexity of Thue-Morse polynomial extractions, Theoret. Comput.\nSci. 389 (2007), no. 1-2, 318–329.\n[8] N. Pytheas-Fogg, Substitutions in Dynamics, Arithmetics and Combinatorics, Lecture Notes in\nMath. 1794, Springer-Verlag, 2002.\n[9] M. Queffelec, Substitution Dynamical Systems - spectral analysis, Springer Lecture Notes in Mathematics, 1294 (1987) 1–240.\n[10] V. A. Rokhlin, Exact endomorphisms of a Lebesgue space (Russian), Izv. Akad. Nauk SSSR Ser.\nMat. 25 1961, 499–530.\n[11] A. M. Vershik, Uniform algebraic approximations of shift and multiplication operators. Dokl.\nAkad. Nauk SSSR 259, No.3, 526-529 (1981). English translation: Sov. Math. Dokl. 24, 97-100\n(1981).\n[12] A. M. Vershik, Locally transversal symbolic dynamics, (Russian) Algebra i Analiz 6 (1994), no.\n3, 94–106; English translation: St. Petersburg Math. J. 6 (1995), no. 3, 529–540.\n[13] A. M. Vershik, A.N. Livshits, Adic models of ergodic transformations, spectral theory, and related\ntopics, Adv. in Soviet Math. AMS Transl. 9 (1992), 185–204.\nAnatoly Vershik, Mathematical Institute of Russian Academy of Sciences, St.Petersburg\nbranch, Fontanka 27, St.Petersburg, 191023, Russia\nE-mail address: vershik@pdmi.ras.ru\nBoris Solomyak, Box 354350, Department of Mathematics, University of Washington, Seattle WA 98195\nE-mail address: solomyak@math.washington.edu\n\n\f"}