{"id": "http://arxiv.org/abs/0901.0355v1", "guidislink": true, "updated": "2009-01-04T17:29:18Z", "updated_parsed": [2009, 1, 4, 17, 29, 18, 6, 4, 0], "published": "2009-01-04T17:29:18Z", "published_parsed": [2009, 1, 4, 17, 29, 18, 6, 4, 0], "title": "Promotion of cooperation on networks? The myopic best response case", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0901.1958%2C0901.4054%2C0901.0600%2C0901.0072%2C0901.4718%2C0901.2483%2C0901.3162%2C0901.1615%2C0901.3671%2C0901.0117%2C0901.2301%2C0901.4364%2C0901.4093%2C0901.1297%2C0901.3352%2C0901.1736%2C0901.4406%2C0901.0845%2C0901.1317%2C0901.1216%2C0901.1277%2C0901.0302%2C0901.2816%2C0901.3446%2C0901.1260%2C0901.2282%2C0901.4022%2C0901.0186%2C0901.2641%2C0901.3275%2C0901.0771%2C0901.1039%2C0901.4625%2C0901.4839%2C0901.2191%2C0901.3081%2C0901.3103%2C0901.0897%2C0901.3440%2C0901.1214%2C0901.0159%2C0901.0296%2C0901.2062%2C0901.1411%2C0901.1516%2C0901.2781%2C0901.4627%2C0901.3761%2C0901.2255%2C0901.2715%2C0901.1163%2C0901.3028%2C0901.1664%2C0901.3772%2C0901.0657%2C0901.0876%2C0901.3286%2C0901.4319%2C0901.0355%2C0901.1006%2C0901.0739%2C0901.4476%2C0901.1392%2C0901.0004%2C0901.1458%2C0901.0333%2C0901.3448%2C0901.0002%2C0901.1976%2C0901.1231%2C0901.3790%2C0901.3435%2C0901.0582%2C0901.0729%2C0901.1304%2C0901.0228%2C0901.1656%2C0901.1067%2C0901.0915%2C0901.1351%2C0901.1636%2C0901.1342%2C0901.1940%2C0901.2092%2C0901.4458%2C0901.0871%2C0901.2709%2C0901.1493%2C0901.3506%2C0901.4894%2C0901.3629%2C0901.0271%2C0901.4615%2C0901.1280%2C0901.0823%2C0901.1874%2C0901.3680%2C0901.4925%2C0901.4968%2C0901.2583%2C0901.0399&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Promotion of cooperation on networks? The myopic best response case"}, "summary": "We address the issue of the effects of considering a network of contacts on\nthe emergence of cooperation on social dilemmas under myopic best response\ndynamics. We begin by summarizing the main features observed under less\nintellectually demanding dynamics, pointing out their most relevant general\ncharacteristics. Subsequently we focus on the new framework of best response.\nBy means of an extensive numerical simulation program we show that, contrary to\nthe rest of dynamics considered so far, best response is largely unaffected by\nthe underlying network, which implies that, in most cases, no promotion of\ncooperation is found with this dynamics. We do find, however, nontrivial\nresults differing from the well-mixed population in the case of coordination\ngames on lattices, which we explain in terms of the formation of spatial\nclusters and the conditions for their advancement, subsequently discussing\ntheir relevance to other networks.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0901.1958%2C0901.4054%2C0901.0600%2C0901.0072%2C0901.4718%2C0901.2483%2C0901.3162%2C0901.1615%2C0901.3671%2C0901.0117%2C0901.2301%2C0901.4364%2C0901.4093%2C0901.1297%2C0901.3352%2C0901.1736%2C0901.4406%2C0901.0845%2C0901.1317%2C0901.1216%2C0901.1277%2C0901.0302%2C0901.2816%2C0901.3446%2C0901.1260%2C0901.2282%2C0901.4022%2C0901.0186%2C0901.2641%2C0901.3275%2C0901.0771%2C0901.1039%2C0901.4625%2C0901.4839%2C0901.2191%2C0901.3081%2C0901.3103%2C0901.0897%2C0901.3440%2C0901.1214%2C0901.0159%2C0901.0296%2C0901.2062%2C0901.1411%2C0901.1516%2C0901.2781%2C0901.4627%2C0901.3761%2C0901.2255%2C0901.2715%2C0901.1163%2C0901.3028%2C0901.1664%2C0901.3772%2C0901.0657%2C0901.0876%2C0901.3286%2C0901.4319%2C0901.0355%2C0901.1006%2C0901.0739%2C0901.4476%2C0901.1392%2C0901.0004%2C0901.1458%2C0901.0333%2C0901.3448%2C0901.0002%2C0901.1976%2C0901.1231%2C0901.3790%2C0901.3435%2C0901.0582%2C0901.0729%2C0901.1304%2C0901.0228%2C0901.1656%2C0901.1067%2C0901.0915%2C0901.1351%2C0901.1636%2C0901.1342%2C0901.1940%2C0901.2092%2C0901.4458%2C0901.0871%2C0901.2709%2C0901.1493%2C0901.3506%2C0901.4894%2C0901.3629%2C0901.0271%2C0901.4615%2C0901.1280%2C0901.0823%2C0901.1874%2C0901.3680%2C0901.4925%2C0901.4968%2C0901.2583%2C0901.0399&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We address the issue of the effects of considering a network of contacts on\nthe emergence of cooperation on social dilemmas under myopic best response\ndynamics. We begin by summarizing the main features observed under less\nintellectually demanding dynamics, pointing out their most relevant general\ncharacteristics. Subsequently we focus on the new framework of best response.\nBy means of an extensive numerical simulation program we show that, contrary to\nthe rest of dynamics considered so far, best response is largely unaffected by\nthe underlying network, which implies that, in most cases, no promotion of\ncooperation is found with this dynamics. We do find, however, nontrivial\nresults differing from the well-mixed population in the case of coordination\ngames on lattices, which we explain in terms of the formation of spatial\nclusters and the conditions for their advancement, subsequently discussing\ntheir relevance to other networks."}, "authors": ["Carlos P. Roca", "Jose A. Cuesta", "Angel Sanchez"], "author_detail": {"name": "Angel Sanchez"}, "author": "Angel Sanchez", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1140/epjb/e2009-00189-0", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0901.0355v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0901.0355v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "q-bio.PE", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "q-bio.PE", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cs.GT", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.soc-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0901.0355v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0901.0355v1", "arxiv_comment": null, "journal_reference": null, "doi": "10.1140/epjb/e2009-00189-0", "fulltext": "EPJ manuscript No.\n(will be inserted by the editor)\n\narXiv:0901.0355v1 [q-bio.PE] 4 Jan 2009\n\nPromotion of cooperation on networks? The myopic best\nresponse case\nCarlos P. Roca1,2 , José A. Cuesta1 , and Angel Sánchez1,3,4\n1\n\n2\n3\n4\n\nGrupo Interdisciplinar de Sistemas Complejos (GISC), Departamento de Matemáticas, Universidad Carlos III de Madrid,\nSpain\nChair of Sociology, in particular of Modeling and Simulation, ETH Zurich, Switzerland\nInstituto de Ciencias Matemáticas CSIC-UAM-UC3M-UCM, Madrid, Spain\nInstituto de Biocomputación y Fı́sica de Sistemas Complejos (BIFI), Universidad de Zaragoza, Spain\nReceived: date / Revised version: date\nAbstract. We address the issue of the effects of considering a network of contacts on the emergence of\ncooperation on social dilemmas under myopic best response dynamics. We begin by summarizing the main\nfeatures observed under less intellectually demanding dynamics, pointing out their most relevant general\ncharacteristics. Subsequently we focus on the new framework of best response. By means of an extensive\nnumerical simulation program we show that, contrary to the rest of dynamics considered so far, best\nresponse is largely unaffected by the underlying network, which implies that, in most cases, no promotion\nof cooperation is found with this dynamics. We do find, however, nontrivial results differing from the wellmixed population in the case of coordination games on lattices, which we explain in terms of the formation\nof spatial clusters and the conditions for their advancement, subsequently discussing their relevance to\nother networks.\nPACS. 89.65.-s Social and economic systems – 87.23.Ge Dynamics of social systems – 02.50.Le Decision\ntheory and game theory – 89.75.Fb Structures and organization in complex systems\n\n1 Introduction\nThe origin and sustainability of cooperation in animal and\nhuman societies is a long-standing puzzle whose importance cannot be overstated [1]. Since the pioneering works\nby Hamilton [2,3], and the introduction of the theoretical\nsetup of evolutionary game theory [4], a number of reasons have been advanced as possible explanations for the\nubiquity and robustness of cooperative behavior [5] (see\nalso [6]). Among these proposals, network reciprocity, or\nthe existence of a (possibly social) network of contacts that\ngoverns the individuals a particular one interacts with, has\nreceived much attention in the last two decades. This specific line of research started with a seminal work by Nowak\nand May [7], who studied the Prisoner's Dilemma (PD)\n[8] game on a square lattice, finding evidence for substantial amounts of cooperation in parameter regions where\ndefection was the only possible outcome in a well-mixed\npopulation (i.e., when every individual interacts with every other one). Subsequent work has explored many other\nchoices for the network as well as other dynamical rules\nfor the update of strategies in the game, giving rise to a\nconsiderable amount of work [9] which, however, yielded\nquite a few contradictory results and no global picture of\nthe observed phenomenology. In fact, only recently [10]\nsuch a general conclusion was presented for homogeneous\n\ndegree networks, the case of heterogeneous ones being well\nunderstood from other recent works [11,12].\nIn this paper we aim at extending our work on games\non spatial structures and homogeneous degree networks to\nthe case when the updating of the strategies follows the\nmyopic best response rule [13,14]. There are a number of\nreasons that support the relevance of such a study. First,\nprevious works on games on networks considered in general only imitative rules, i.e., a specific individual updates\nher strategy by imitating the strategy of one of her neighbors selected through different protocols (see e.g. [9] for\na review). Such updating procedure makes only modest\nrequirements on the cognitive capabilities and/or information or memory of the players: in these contexts, best\nresponse schemes are the next step of sophistication, positing that individuals revise their strategies by choosing the\nbest reply to the strategies used by their neighbors in the\nprevious time step. This choice of updating based only on\nthe previous action of the neighbors is the reason why this\ndynamics is usually referred to as myopic [15], although\nfor brevity we will just use the term \"best response\" in\nwhat follows. Second, best response not only endows the\nindividuals of the model with more complete intellectual\ncapabilities but also is an innovative rule, as it allows extinct strategies to be reintroduced in the system whereas\nimitative dynamics cannot do that. Third, best response\n\n\f2\n\nCarlos P. Roca et al.: Promotion of cooperation on networks? The myopic best response case\n\nis the rule of choice in most studies from the economical\nviewpoint, the reason it is not so often considered among\nphysicists being that it gives rise to a differential inclusion\nrather than a differential equation [16] and, subsequently,\nit is less amenable to analytical approaches. Finally, earlier\nworks on best response dynamics on lattices [14] left interesting, hitherto unanswered questions such as the strong\ndependence of the outcome of the evolution in coordination games on the initial conditions, a point that we will\nspecifically address here.\nWe discuss our results according to the following scheme:\nIn Sec. 2 we summarize what is known about evolutionary\ngames on networks of homogeneous degree, which includes\nspatially structured populations and random networks.\nWe will consider in Sec. 3 the specific case of the Snowdrift\ngame [21] as a paradigmatic example of the difficulties\narising in these studies. We will then proceed in Sec. 4 to\npresent our simulation results on best response dynamics\non different types of networks and to subsequently discuss\nin detail the behavior observed in lattices, providing an\nexplanation as to why there may be more or less cooperation on lattices than on the well-mixed case, depending on\nthe initial conditions. Finally, Sec. 5 concludes the paper.\n\n2 Evolutionary games on networks of\nhomogeneous degree\n\nTo study the competition between cooperation and defection from an evolutionary perspective, the payoffs obtained by playing the game are considered as fitness and\na darwinian dynamics is introduced to promote the fittest\nstrategy. The classic framework to do so is the replicator dynamics [16,22], which assumes an infinite and wellmixed population, i.e. a population with no structure,\nwhere each individual plays with every other. Let x be\nthe density of cooperators, and fc and fd the fitness of\na cooperator and a defector, respectively. The replicator\ndynamics states that x evolves as [16]\nẋ = x(1 − x)(fc − fd ).\n\n(2)\n\nThen, if cooperators are doing better than defectors their\ndensity rises accordingly, and the opposite occurs if they\nare doing worse. Provided that the initial density of cooperators x0 is different from 0 and 1, the asymptotic state\nof this dynamical system is, for each game (x∗ represents\nthe asymptotic density of cooperators) [16]: HG, full cooperation, x∗ = 1; PD, full defection, x∗ = 0; SH, full\ncooperation if x0 > xe , or full defection if x0 < xe ; SD,\nmixed population with x∗ = xe , regardless of the initial\ndensity x0 . Both in SH and SD the coexistence equilibrium has a cooperation density xe = S/(S + T − 1). It is\nimportant to note that the outcome of these four games\nencompasses all the possible cases for any symmetric 2 × 2\ngame [23] (see also [6]).\n\n2.1 2×2 evolutionary games\nThe basic ingredient in the models we are going to discuss is evolutionary game theory and, in particular, 2×2\ngames. Let us now briefly introduce the main concepts. A\nsymmetric 2 × 2 game is a game with 2 players who choose\nbetween 2 strategies and with no difference in role. Each\nplayer obtains a payoff given by the following matrix\nC\nD\n\n\u0012 C D\u0013\n1 S\n.\nT 0\n\n(1)\n\nThe rows represent the strategy of the player who obtains\nthe payoff and the columns that of her opponent.\nThe strategies are labeled as C and D for cooperate and\ndefect, because we interpret the game as a social dilemma.\nIndeed, certain values of S and T undermine a hypothetical situation of mutual cooperation. If S < 0 a cooperator faces the risk of losing if the other player defects,\nperforming worse than with mutual defection. If T > 1 a\ncooperator has the temptation to defect and obtain a payoff larger than that of mutual cooperation. Both tensions\ndetermine the social dilemmas represented by symmetric 2 × 2 games [17]. Restricting the values of the coefficients within the intervals −1 < S < 1 and 0 < T < 2,\nwe have the Harmony game [18] (HG, 0 < S, T < 1)\nand three classic social dilemmas: the Prisoner's Dilemma\n(PD, −1 < S < 0, 1 < T < 2), the Stag-Hunt game [19]\n(SH, −1 < S < 0 < T < 1), and the Hawk-Dove [20] or\nSnowdrift game [21] (SD, 0 < S < 1 < T < 2). Each game\ncorresponds, thus, to a quadrant in the ST -plane.\n\n2.2 2×2 evolutionary games on networks\nAs we stated in Sec. 1, in 1992 Nowak and May [7] introduced spatial structure in the context of evolutionary\ngames by considering the players located at the nodes of a\nsquare lattice, playing the game only with their neighbors\n(and playing the same action vs every one of them) and\nnot with the whole population. They introduced evolution\nin this setup by using the unconditional imitation rule\n(also known as \"imitate-the-best\" [9]), where each player\nchooses the strategy of the neighbor with largest payoff,\nprovided this payoff is greater than the player's. With\nthis rule, they found that cooperators survived by selforganizing in clusters, where the interactions within the\nclusters yielded larger payoffs to cooperators than those\nobtained by defectors at the boundaries of cooperators'\nclusters.\nNowak and May's pioneering work opened the way to a\nlarge number of studies focused on different games, different evolutionary rules, and different lattices or networks.\nAs a loose conclusion of those works, it was generally believed that the existence of structure in the population,\nwhether spatial or of another kind, enhanced the emergence of cooperation in games where defection was the\nnorm. However, such conclusion did not agree with all the\navailable research, contradictions arose at several points\n(an example of which will be discussed in Sec. 3 below)\nand there were no studies that identified parameter regions where one could firmly establish it. Therefore, in\n[10] we carried out a very ambitious simulation program,\n\n\fCarlos P. Roca et al.: Promotion of cooperation on networks? The myopic best response case\n0.999\n\n1\n\n0.432\n\n1\n\nB\n\n0.447\n\nC\n\n0\n\n-1\n\n1\n\n0.999\n\n0.426\n\n1\n0.9\n0.8\n0.7\n0.6\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\nD\n\n0.615\n\n0.0116\n\n0.56\n\n0.0121\n\n0.844\n\n0.0998\n\n0.907\n\n0.0708\n\n0.999\n\n0.392\n\n1\n\n0.406\n\n0.996\n\n0.479\n\n0.999\n\n0.612\n\nF\n\nG\n\n-1\n0\n\n0.676\n\n1\nT\n\n0.00545\n\n2\n\n0\n\n0.832\n\n1\n\n0.0378\n\n2\n\nT\n\nS\n\n0\n\n1\n0.9\n0.8\n0.7\n0.6\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\nH\n\nS\n\nE\n\nS\n\n0.996\n\nS\n\nS\n\nA\n\n0.443\n\n3\n\n0\n\n0.877\n\n1\n\n0.147\n\n2\n\n0\n\n0.95\n\n1\n\n0.204\n\n2\n\nT\n\nT\n\nFig. 1. Asymptotic density of cooperators x∗ in homogeneous random networks (upper row, A to D) compared to regular\nlattices (lower row, E to H), with degree k = 4 (first and third columns, A, E, C, G) and k = 8 (second and forth columns,\nB, F, D, H). Left plots (A, B, E, F) correspond to the replicator update rule, where right ones (C, D, G, H) use unconditional\nimitation as update rule(see text). The initial density of cooperators is x0 = 0.5 in all cases. The graphs display the key role of\nboth the clustering of the network and the update rule (see main text). The promotion of cooperation is, in general, restricted\nto SH. The influence on PD is only significant when the update rule is unconditional imitation.\n\nas a result of which we were able to reach some unambiguous conclusions. While a full report of our results is\navailable in [10], we find it convenient to briefly recall here\na few of the ideas presented there, both as background information for the reader as well as to introduce the way\nwe will present our new results.\nOne of the most relevant findings reported in [10] was\nthat the spatial structure of a population, when modeled\nby a regular lattice, only has a significant effect on cooperation when the clustering coefficient is high, as seen\nby comparing results with those of homogeneous random\nnetworks of the same degree. This is illustrated by Fig. 1,\nwhere results for random homogeneous networks (upper\nrow) are compared to results on regular lattices (lower\nrow). Only when there is high transitivity or clustering in\nthe network [24], as occurs for regular lattices of degree\nk = 8, significant differences appear.\nFig. 1 also highlights the crucial influence of the update\nrule. Right columns show the results with unconditional\nimitation (introduced above), while the left ones present\nthose obtained with the so-called replicator rule [16,22].\nThis rule is defined as follows: Let i = 1 . . . N label the\nindividuals in the population. Let si be the strategy of\nplayer i, πi her payoff and Ni her neighborhood. With the\nreplicator update rule one neighbor j of player i is chosen\nat random, j ∈ Ni . The probability of player i adopting\n\nthe strategy of player j is given by\n\nptij ≡ P{stj → st+1\n}=\ni\n\n\u001a\n\n(πjt − πit )/Φ : πjt > πit\n, (3)\n0\n: πjt ≤ πit\n\nwith Φ = k(max(1, T ) − min(0, S)) to ensure P(*) ∈ [0, 1].\nFig. 1 presents the results for the space of 2 × 2 games\nas a whole, using a color code which will be the same\nhereafter. Furthermore, we have introduced a quantitative measure CG for the overall asymptotic cooperation in\ngame G (= HG, PD, SH, SD), given by the mean value\nof x∗ over the corresponding region in the ST -plane. This\nglobal index of cooperation has a range CG ∈ [0, 1] and\nappears on the graphs by the quadrant of each game.\nBoth the qualitative assessment of the plots and the comparison of the values of this quantitative index yield an\nimportant regularity in the effect of the social structure\nmodeled by this kind of networks: cooperation is generally\nenforced in coordination games (SH), specially when the\nclustering coefficient is high, whereas it is inhibited in anticoordination games (SD). Remarkably, the positive effect\non PD requires a particular update rule, namely unconditional imitation. We refer the interested reader to [10] for\na complete discussion on these and related issues.\n\n\f4\n\nCarlos P. Roca et al.: Promotion of cooperation on networks? The myopic best response case\n1\n\n0.406\n\n0.998\n\n0.499\n\nstudies. There is indeed a decrease of cooperation when\nusing the replicator dynamics as in [25], along the line of\nA\nB\ninterest but also in the SD quadrant as a whole. However, when the dynamics is best response we do observe a\nstepped profile in the SD quadrant as Sysi-Aho et al. did,\n0\nwhile the mean value of the cooperation over the quadrant\nis the same as in a well mixed population. The reader is\nreferred to the middle panel of Fig. 3, where the results\non a well mixed population with the same initial condition\n-1\n0.832\n0.0378 2 0\n0.502\n0.00187 2\nare depicted.\n0\n1\n1\nT\nThese results open up a series of questions, beginning\nT\nwith the following: What is the effect of best response dyFig. 2. Simulations of the models discussed in [25] (A) and namics on other networks, given that on a square lattice\n[26] (B). The lines mark the range of parameters studied in its effect is not very noticeable? Let us recall that best\nresponse is a step further towards \"intelligence\" of the\nboth works. See text for a discussion.\nagents as compared to the replicator rule, an imitative,\nnon-innovative dynamics, and therefore we might expect\n3 The case of SD\nthat players could exploit better the existence of a network. This issue is what we discuss in detail in what folPrevious section introduced an important property of these lows. However, there is a more general problem, namely\nevolutionary models, the crucial dependence that the re- what does it mean \"promotion of cooperation by the strucsult has on the update rule. We will now discuss a specific ture of a population\"? Do we refer to a specific set of paexample which, on the one hand, allows us to make this rameters, such as the line studied in [25,26]? Do we refer\npoint and, on the other hand, will introduce us to our main to a global measure of the cooperation level in a region,\nsubject, namely the effects of best response dynamics.\nsuch as the values we compute for each quadrant? Or do\nIn 2004, Hauert and Doebeli [25] presented a study of we refer to the ST -plane as a whole? Note that in this\nthe Snowdrift game in which they concluded that, con- last case the replicator rule of Hauert and Doebeli, while\ntrary to the general belief, the existence of a spatial struc- indeed leading to less cooperation in the SD game, yields\nture may inhibit cooperation. To that end, they studied a very large increase of the cooperative region in the SH\nthe dependence of the level of cooperation on the param- quadrant, favoring players to coordinate in the Paretoeter r, the cost-benefit ratio (understood as cost of coop- dominant equilibrium [22]. Had we been looking at that\nerating and corresponding benefit accrued), which in our quadrant only, we would have certainly concluded that coparameterization is r = (T − S)/2. They did not consider operation is promoted by the square lattice. Or, looking at\nthe whole ST -plane but only the line given by T = 1 + r, the SD game, had we considered unconditional imitation\nS = 1 − r (see Fig. 2) and obtained asymptotic levels of as the update rule, we would have found evidence of spacooperation below those found in well mixed populations. tial structure fostering cooperation in SD. While we will\nOne year later, Sysi-Aho and coworkers [26] repeated not dwell any further in this issue here (but see [10,27] for\nthe same study changing only the dynamical rule: Where a discussion in depth of these problems) we want to stress\nHauert and Doebeli had used the replicator rule men- that statements about promotion of cooperation should\ntioned above, Sysi-Aho and coworkers used the best re- be made in a much more specific manner without trying\nsponse rule, introducing a probability p < 1 to update to attach to them unchecked general implications beyond\nstrategy, i.e., at every time step every player chose her the scope of the case under study.\nstrategy as a best response to their neighbors with probability p or left it unchanged with probability 1 − p. The\nreason to do that is to prevent the systems from falling\nonto a sequence of alternate states of full defection and full 4 Best response dynamics\ncooperation, which is an artifact of the rule (and which are\nnever reached as soon as p < 1, see [26]). They studied the 4.1 Different types of networks\nsame range of parameters, finding that cooperation subsisted even for r close to 1, being larger (resp. smaller) Motivated by the reasons discussed in the introduction\nthan in a well mixed population for large (resp. small) r. and by the issues raised by our study in Sec. 3, we unIn order to understand better this issue, we have re- dertook the study of the effects of the best response dyproduced the simulations in [25,26], using the same square namics on a large family of networks. We considered latlattices, neighborhoods (k = 8) and initial conditions (co- tices, which may represent spatial structure, homogeneous\noperation and defection equally likely) they used, obtain- random networks (random networks where all nodes have\ning the results we summarize in Fig. 2. As we may see, exactly the same degree), Erdös-Renyi random networks\nthe two different dynamics lead to rather different results [28], small-world networks, Barabási-Albert [29] scale free\nwhen looked at in the framework of the whole ST -plane. networks and Klemm-Eguı́luz [30] scale free networks with\nWe stress that, along the line indicated in the plots, we different mean degrees, thus exploring all possible combiexactly reproduce the results reported in those previous nations of small-world phenomena, scale free behavior and\nS\n\n1\n\n1\n0.9\n0.8\n0.7\n0.6\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\n\fCarlos P. Roca et al.: Promotion of cooperation on networks? The myopic best response case\n1\n\n1\n\n0.5\n\n1\n\nS\n\nA\n\n0.5\n\n1\n\nB\n\n0.5\n\n1\n0.9\n0.8\n0.7\n0.6\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\nC\n\n0\n\n-1\n\n0.242\n\n0\n\n1\nT\n\n0\n\n2\n\n0.5\n\n0\n\n1\nT\n\n0\n\n2\n\n0.742\n\n0\n\n1\nT\n\n0\n\n5\n\n2\n\nFig. 3. Asymptotic density of cooperators x∗ in well mixed populations under best response dynamics, with p = 0.1 (see main\ntext), when the initial density of cooperators is x0 = 1/3 (left, A), x0 = 1/2 (middle, B) and x0 = 2/3 (right, C).\n0.997\n\n1\n\n0.997\n\n0.5\n\nS\n\nA\n\nB\n\n0.996\n\n0.5\n\n1\n0.9\n0.8\n0.7\n0.6\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\nC\n\n0\n\n-1\n\n1\n\n0.502\n\n0.00318\n\n0.502\n\n0.00318\n\n0.502\n\n0.00387\n\n0.998\n\n0.499\n\n0.998\n\n0.499\n\n0.998\n\n0.5\n\nD\n\nS\n\n0.5\n\nE\n\n1\n0.9\n0.8\n0.7\n0.6\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\nF\n\n0\n\n-1\n0\n\n0.502\n\n1\nT\n\n0.00186\n\n2\n\n0\n\n0.502\n\n1\nT\n\n0.00187\n\n2 0\n\n0.502\n\n1\nT\n\n0.00239\n\n2\n\nFig. 4. Asymptotic density of cooperators x∗ in random (left, A and D), regular (middle, B and E), and scale-free networks\n(right, C and F) with degrees k = 4 (upper row, A to C) and 8 (lower row, D to F). The update rule is best response with\np = 0.1 and the initial density of cooperators is x0 = 0.5. Differences are negligible in all cases; note, however, that the steps\nappearing in the SD quadrant are slightly different.\n\nlarge or small clustering. We have also considered the complete graph as the reference for a well mixed population,\nresults for which are presented in Fig. 3.\nWe will begin by focusing on the case in which the initial conditions are a 50% of cooperators and a 50% of defectors. Our reference for comparison will then be Fig. 3 B,\ncorresponding to a well-mixed (complete network) population with that initial condition. A small subset of our\nresults for the other networks is presented in Fig. 4, showing that the asymptotic behavior does not depend at all on\nthe type of network considered, with the only and unimportant exception of slight differences in the stepping in\nSD. We want to stress that we have tested many other\nnetworks aside from those presented here with exactly the\n\nsame results. Not only the mean cooperation levels per\nquadrant are practically the same, but also the dependence on S and T for each quadrant. We note that this\nis a very remarkable result, in so far as for most other\n(imitative) dynamics studied there is always a largely noticeable effect of the type of network on which the games\nare played, as we have seen above (cf. Figs. 1 and 2; see\nalso [10,11] for more details on homogeneous and scale\nfree networks, respectively). We have made every effort to\nensure that our results are robust and independent of the\ntechnicalities of the simulations. To begin with, we have\nchecked a correct convergence, verifying that simulation\ntimes larger up to a factor of 10 lead to the same results.\nOn the other hand, the probability parameter p, which\n\n\f6\n\nCarlos P. Roca et al.: Promotion of cooperation on networks? The myopic best response case\n0.998\n\n1\n\n0.499\n\n0.998\n\nS\n\nA\n\n0.499\n\n1\n0.9\n0.8\n0.7\n0.6\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\nB\n\n0\n\n-1\n0\n\n0.502\n\n1\nT\n\n0.00196\n\n2\n\n0\n\n0.502\n\n1\nT\n\n0.00195\n\n2\n\nFig. 5. Asymptotic density of cooperators x∗ in regular lattices with degree k = 8. The update rule is best response and\nthe initial density of cooperators is x0 = 0.5. Left (A): asynchronous updating with p = 0.1; right (B): synchronous updating with p = 0.01. Both results are virtually identical to that of\nFig. 4 E, which was obtained with synchronous updating and\np = 0.1.\n\ngoverns how often agents update their strategy, is not relevant, and neither it is the use of asynchronous updating\n(see Fig 5), in which an agent is chosen at random to update its strategy after a round of the game has been played\nby her and her neighbors (we note that asynchronicity was\nreported to have a small but noticeable effect with imitative update rules in [10]). With all these checks, we can finally state our first conclusion, namely that best response\ndynamics is insensitive to the type of network on which\nthe game is played, meaning that when the networks are\ninitiated from the same proportion of cooperators and defectors the asymptotic results are the same as well. This\nunexpected result may have interesting implications in applied contexts, implications which we will discuss in the\nconcluding Section.\n\n4.2 The effect of initial conditions\nHaving found that best response is largely unaffected by\nplaying the different 2×2 games on a network, we extended\nour analysis of the problem to consider different initial\nconditions. We initiated our simulations with an initial\ndensity of cooperators x0 = 1/3 or x0 = 2/3 and repeated\nour simulation program for our family of networks. In order to understand the observed phenomenology, we find\nit convenient to begin the discussion by the case of lattices. Figure 6 shows the results for lattices with different\nnumber of neighbors and x0 = 1/3 (the outcome of the\nsimulations for x0 = 2/3 is similar, with the green region\nin the SH quadrant of Fig. 5 being symmetrically located\nbelow the S = T − 1 line). As can be seen from Fig. 6,\nfor 4 and 6 neighbors the results for x0 = 1/3 are indistinguishable from the results for x0 = 1/2. This must be\ncompared with Fig. 3 A, which shows for a well-mixed\npopulation a cooperative region in the SH quadrant that\nis roughly a 50% of the one we have obtained on lattices.\nAs the asymptotics is the same for lattices with 4 and\n6 neighbors, we also conclude that the clustering of the\n\nnetwork does not play any role. On the other hand, the\nlattice with 8 neighbors shows a striking result, namely\nthe appearance on the SH quadrant of a region with intermediate values of cooperation. Let us recall that, as a\nstand-alone game, SH has two equilibria, full cooperation\nor full defection, and that depending on the initial condition the system ends up in one or the other. This is the\nbehavior observed in all the lattices and networks studied\nso far with imitative rules and also was what we observed\nfor best response with x0 = 0.5.\nIn order to understand this surprising feature, the appearance of regions with seemingly mixed behavior in SH\nand its dependence on the number of neighbors, appearing for 8 neighbors but not for smaller numbers, we have\nlooked in detail at the time evolution of specific realizations. Fig. 7 presents a representative example of this dynamics with 8 neighbors and for values of S and T in\nthe intermediate region we are interested in. We clearly\nobserve that there is an initial stage in which isolated cooperators (in red) die out and only clusters with a significantly larger presence of cooperators avoid extinction\nand eventually begin to grow. A careful look at the pictures and at the whole time evolution allows one to notice\nthat clusters grow due to the advancement of some of its\nsides, in particular those which are basically flat but have\njust one kink, whereas some others are stopped unless hit\nby some other advancing front. Very clearly observable\namong the latter are diagonal fronts (see, in particular,\nthe last three frames in the sequence). This can be easily\nunderstood analytically by just considering the different\npossible types of front and the conditions for their advancement in terms of best response dynamics. Thus, for\na planar front such as\nC\nC\nC\nC\nC\nC\n\nC\nC\nC\nC\nC\nC\n\nC\nC\nC\nC\nC\nC\n\nD\nD\nD\nD\nD\nD\n\nD\nD\nD\nD\nD\nD\n\nD\nD\nD\nD\nD\nD\n\nthe borderline defectors will become cooperators if S >\n3(T − 1)/5, whereas cooperators are transformed into defectors if S < 5(T − 1)/3. Therefore, in the intermediate\nregion 5(T − 1)/3 < S < 3(T − 1)/5 planar fronts are\nstable in the lattice with 8 neighbors. It is easy to check\nthat diagonal fronts are stable in this region as well. This\nmust be compared with the situation when there is a kink\nin the front, as in\nC\nC\nC\nC\nC\nC\n\nC\nC\nC\nC\nC\nC\n\nC\nC\nC\nC\nC\nC\n\nD\nD\nD\nC\nC\nC\n\nD\nD\nD\nD\nD\nD\n\nD\nD\nD\nD\nD\nD\n\nIn this case the defector at the kink becomes a cooperator if S > T − 1, and the cooperator at the kink becomes\na defector in the opposite case, S < T − 1. Therefore,\nfor this type of front there is no stability region and it\n\n\fCarlos P. Roca et al.: Promotion of cooperation on networks? The myopic best response case\n0.997\n\n1\n\n0.499\n\n0.998\n\nS\n\nA\n\n0.998\n\n0.5\n\nB\n\n0.499\n\n11\n0.0.9\n9\n0.0.8\n8\n0.0.7\n7\n0.0.6\n6\n0.0.5\n5\n0.0.4\n4\n0.0.3\n3\n0.0.2\n2\n0.0.1\n1\n00\n\nC\n\n0\n\n-1\n0\n\n0.488\n\n1\nT\n\n0.00285\n\n2\n\n0\n\n0.49\n\n1\nT\n\n0.00221\n\n2\n\n0\n\n0.392\n\n1\nT\n\n0.00179\n\n7\n\n2\n\nFig. 6. Asymptotic density of cooperators x∗ in regular lattices with initial density of cooperators x0 = 1/3. The degrees are\nk = 4 (left, A), k = 6 (middle, B) and k = 8 (right, C). The update rule is best response with p = 0.1. Equivalent (symmetrical)\nresults are obtained for x0 = 2/3 (see main text).\n\nFig. 7. Snapshots of the evolution on a regular lattice of degree k = 8, under best response dynamics with p = 0.1. Sites\ndepicted in red are cooperators, blue ones are defectors. The initial density of cooperators is x0 = 1/3. The game parameters\nare S = −0.6, T = 0.2, in the SH quadrant. Times are as indicated in the snapshots. System size is 100×100 with periodic\nboundary conditions. In this particular realization, cooperation eventually dominates entirely the lattice.\n\nalways advances in one direction or the other. This analysis shows that the fate of a specific realization depends\non the geometry of the clusters arising at its first stage.\nWhat we see in the special region in Fig. 6 C is the result of some simulations that cannot reach full cooperation\nbecause the growing clusters arrest at some point in the\nsimulations, whereas in other cases their geometry is such\n(as in Fig. 7) that the system ends up dominated entirely\nby cooperators. We note that the discussion is symmetrical with respect to the initial condition and it can be\napplied to explain the results for x0 = 2/3 (not shown).\nIt remains to be explained why the other lattices do\nnot show this region of intermediate behavior. The reason\ncan again be traced back to the geometry of the clusters:\n\nConsider, for instance, the case with 4 neighbors. One can\nthen show that diagonal fronts are never stable and, in\nfact, are subject to the same conditions as planar fronts\nwith a kink, making it much more difficult for a particular\nrealization to have all its clusters arrested. Hence, in the\nsimulations on the lattice with 4 neighbors situations with\na mixed population of cooperators and defectors are never\nfound. A similar reasoning explains the results for the 6\nneighbor lattice.\nThe mechanism behind the appearance of the mixed\npopulations suggests that the coexistence of cooperators\nand defectors in the SH may be due to finite size effects. To\ncheck this possibility, we have simulated the lattice with 8\nneighbors on a large variety of sizes, plotting a histogram\n\n\f8\n\nCarlos P. Roca et al.: Promotion of cooperation on networks? The myopic best response case\n\nFinally, with the understanding of the observations on\nlattices at hand, we have also looked at the effect of initial\nconditions on other networks. Two examples of our simulations are presented in Fig. 9. By comparing with the\nwell mixed result in Fig. 3 A, we see that initial conditions\ndifferent from x0 = 0.5 also give rise to non trivial effects\non random and scale free lattices. No regions of mixed\npopulations are observed, and the mean cooperation level\nincreases slightly when going from well mixed to homogeneous random and from there to scale free networks,\nbut always to a lesser extent than on lattices. Unfortunately. the topology of these networks renders the analysis\nin terms of clusters unapplicable. We do not have a clear\nunderstanding of this small promotion of cooperation (inhibition in the case x0 = 2/3) on these networks, but we\ncan tentatively hypothesize the development of weak, long\nrange correlations, which would be responsible for such a\nweaker effect, in contrast to those of lattices, of a short\n1 and stronger nature.\n\n10\n\nN = 625\nN = 2500\nN = 10000\nN = 40000\nN = 160000\n\n8\n6\n4\n2\n0\n0\n\n0.2\n\n0.6\n\n0.4\n\n0.8\n\nx*\n\nFig. 8. Normalized histogram of the asymptotic densities of\ncooperators x∗ reached in the simulations on regular lattices\nof degree k = 8 with initial density of cooperators x0 = 1/3.\nThe update rule is best response with p = 0.1. Sizes are as\nindicated in the plot. Note that the value at x∗ = 1 goes out\nof range for the two largest sizes. S and T are as in Fig. 7.\n0.998\n\n1\n\n0.5\n\n0.998\n\nS\n\nA\n\n0.493\n\n1\n0.9\n0.8\n0.7\n0.6\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\nB\n\n0\n\n-1\n0\n\n0.305\n\n1\nT\n\n0.00179\n\n2\n\n0\n\n0.33\n\n1\nT\n\n0.0022\n\n2\n\nFig. 9. Asymptotic density of cooperators x∗ in homogeneous\nrandom (left, A) and scale free (right, B) networks with initial density of cooperators x0 = 1/3. The update rule is best\nresponse with p = 0.1. Equivalent (symmetrical) results are\nobtained for x0 = 2/3.\n\nof the number of realizations that stop on a mixed population. The result is depicted in Fig. 8, showing clearly that\nas the system size grows the number of asymptotically\nmixed realizations becomes negligible. This is a strong indication that in the infinite size limit the 8 neighbor lattice\nwill behave as those with less neighbors, arriving always\nat the same asymptotics as for the x0 = 0.5 initial condition, at least for initial data not too close to x0 = 0 or\nx0 = 1. We note, however, that for applications of these\nideas to real life problems, where populations (e.g., in a\nsocial context) are finite, it may be possible to observe\nmixed populations in SH dilemmas under best response\ndynamics.\n\n5 Discussion and conclusions\nIn this paper we have presented a thorough analysis of\nmyopic best response dynamics on 2 × 2 social dilemmas\nwith different types of networks. The original motivation\nof our results was the clarification of the discrepancies\namong the work of Hauert and Doebeli [25] and Sysi-Aho\net al. [26], who reported an inhibition (resp. promotion) of\ncooperation in the SD game on square lattices. We have\nshown that the problem is that the comparison is basically meaningless in so far as they use different update\nrules (proportional update or replicator dynamics vs best\nresponse) and also because restricting the comparison to\nSD games leads to missing the larger picture of the set\nof possible dilemmas. Indeed, in the proportional update\ndynamics there is a large increase of cooperation in the\nSH quadrant, which contrasts with the phenomenology of\nthe SD dilemma (as is generically the case, see [10]).\nOur analysis of myopic best response dynamics has\nyielded two main results: First, there is practically no\neffect of the type of network considered on the asymptotic behavior for any value of the game parameters; and,\nsecond, there is a noticeable effect of the initial conditions with particular importance in the case of lattices.\nThe first result is most interesting, more so if viewed in\nthe context of previous work on imitative rules [10,11]. In\nprinciple, given the definition of best response dynamics,\none would not expect important effects on the Harmony\nand PD quadrants, where there is only one global best\nresponse and therefore the network can not introduce any\nnovel feature. However, the fact that SD has only one stable equilibrium of a mixed character, that may be difficult\nto fulfill in the presence of a network, or the bistable nature of SH allow to expect some influence from the interaction networks. The fact that there is none (at least at a\nglobal level, for the whole network; local peculiarities are\nnot being considered here) is therefore quite remarkable\nand casts a shadow of doubt on the applicability of the\n\n\fCarlos P. Roca et al.: Promotion of cooperation on networks? The myopic best response case\n\nstudies of imitative rules to specific socio-economic contexts. Indeed, if using a rule with a higher degree of intelligence renders the network effect unnoticeable, whereas\nit is crucial for simple (non-innovative) dynamics, one can\npresume that the behavior of actual economic agents will\nbe closer to best response and hence network-independent\nto some extent. Interestingly, this idea may be related to\nthe fact that models of network formation in economics\noften lead to very simple networks (see, e.g., [31,32], and\nreferences in the latter), which might be another hint of\nthe secondary role played by the network structure in economical applications.\nOn the other hand, we have also seen that there are\nnetwork effects even under best response dynamics, that\narise in the dependence of the asymptotic behavior on\nthe initial conditions. Lattices are prominent examples of\nthese phenomena and, using the regularity of their structure, we have been able to trace the differences with wellmixed populations to the formation of clusters, whose stability depends on the degree of the lattice (at least for\nfinite size lattices). We have thus seen that cooperation\nmay be promoted (resp. inhibited) in the SH quadrant in\nsituations when the initial amount of cooperators would\nbe insufficient (resp. sufficient) to take the system to full\ncooperation. The effect is also observed on other networks,\nalways with the same symmetrical character, but the reason for this behavior remains still an open issue. Again, in\na economical context this result is interesting because it is\ngenerally believed that best response does not exhibit any\nnew feature when used on a network, whereas here we see\nthat the dependence on the initial conditions is not the\nsame as in the complete network.\nFinally, from a more general viewpoint, we have presented yet another example that the phenomenology of social dilemmas on networks is largely non universal. While\nbest response turns out to be peculiar in the sense that it\ngives rise to network-independent behavior, it is important\nto realize that once again changing the dynamics of the\nstrategy update leads to large, non-trivial changes in the\nresults of evolution as compared to other rules. Furthermore, as we have already mentioned, only a full study of\nthe whole space of dilemmas under consideration (in our\ncase, 2 × 2 games) can shed some light on the mechanism\ngoverning the evolution on different networks and under\ndifferent rules. In this sense, we have presented here a detailed analysis of best response games which highlights the\nfact that, as compared to what is observed on well-mixed\npopulations, the dilemma that is most affected is SH, i.e.,\nrisky situations, rather than contexts in which the important tension is the temptation to defect. This is clearly\nrelated to the bistable character of SH, in which the best\nresponse tends to be equal to the opponent's actions, and\nsuggests that similar mechanisms may be at work in games\nand dilemmas with more players and/or strategies. Further research along these lines is needed to confirm these\nintuitions.\n\n9\n\nAcknowledgments\nWe are grateful to Constanza Fosco for a critical reading\nof the manuscript. This work is partially supported by\nMinisterio de Ciencia e Innovación (Spain) under grants\nIngenio-MATHEMATICA and MOSAICO, by Comunidad\nde Madrid (Spain) under Grants MOSSNOHO-CM and\nSIMUMAT-CM and by European Science Foundation under COST Action P10.\n\nReferences\n1. Pennisi, E., Science 309, (2005) 93.\n2. Hamilton, W.D., J. Theor. Biol. 7, (1964) 1–16 (1964).\n3. Axelrod, R. and Hamilton, W.D., Science 211, (1981) 1390–\n1396.\n4. Maynard Smith, J., Evolution and the Theory of Games.\n(Cambridge University Press, Cambridge, 1982).\n5. Nowak, M.A., Science 314, (2006) 1560–1563.\n6. Roca, C.P., Cuesta, J.A., & Sánchez, A. Phys. Rev. Lett.\n97, 158701.\n7. Nowak, M.A. and May, R.M. Nature 359, (1992) 826–829.\n8. Rapoport, A. and Chammah, A. M., Prisoner's Dilemma:\nA Study in Conflict and Cooperation (University of Michigan\nPress, Ann Arbor, 1965).\n9. Szabó, G. and Fáth, G. Physics Reports 446, (2007) 97–\n216.\n10. Roca, C. P., Cuesta J. A. and Sánchez, A., arXiv:0806.1649\n(2008).\n11. Santos, F. C., Pacheco, J. M. and Lenaerts, T., Proc. Natl.\nAcad. Sci. USA 103 (2006) 3490–3494.\n12. Gómez-Gardeñes, J., Campillo, M, Florı́a, L. M. and\nMoreno, Y. Phys. Rev. Lett. 98, 108103.\n13. Matsui, A., J. Econ. Theory 57, (1992) 343-362.\n14. Blume, L., Games Econ. Behav. 5, (1993) 387-424.\n15. Ellison, G., Econometrica 61, (1993) 1047–1071.\n16. Hofbauer, J. and Sigmund, K., Evolutionary Games and\nPopulation Dynamics (Cambridge University Press, Cambridge, 1998).\n17. Macy, M. W. and Flache, A., Proc. Natl. Acad. Sci. USA\n99, (2002) 7229–7236.\n18. Licht, A. N., Yale J. Int. Law 24, (1999) 61–125.\n19. Skyrms, B., The Stag Hunt and the Evolution of Social\nStructure. (Cambridge University Press, Cambridge, 2003).\n20. Maynard Smith, J. and Price, G.R. Nature 246, (1973)\n15–18.\n21. Sugden, R., Economics of Rights, Co-operation and Welfare, 2nd edition. (Palgrave Macmillan, Hampshire, 2004).\n22. Gintis, H. 2000 Game Theory Evolving. Princeton University Press.\n23. Rapoport, A. and Guyer, M. General Systems 11, (1966)\n203–214.\n24. Newman, M.E.J. SIAM Review 45, (2003) 167–256.\n25. Hauert, C. and Doebeli, M. Nature 428, (2004) 643–646.\n26. Sysi-Aho, M., Saramäki, J., Kertész, J. and Kaski, K., Eur.\nPhys. J. B 44, (2005) 129–135.\n27. Roca, C. P., Cuesta J. A. and Sánchez, A., in preparation\n(2009).\n28. Bollobas, B., Random Graphs. (Cambridge University\nPress, Cambridge, 2001).\n29. Barabási, A.-L. and Albert, R. Science 286, (1999) 509–\n512.\n\n\f10\n\nCarlos P. Roca et al.: Promotion of cooperation on networks? The myopic best response case\n\n30. Klemm, K. and Eguı́luz, V. M., Phys. Rev. E 65, (2002)\n036123.\n31. Jackson, M.O. and Wolinsky, A., J. Econ.Theory 71,\n(1996) 44–74.\n32. Goyal, S and Vega-Redondo, F., J. Econ. Theory 137,\n(2007) 460–492.\n\n\f\f"}