{"id": "http://arxiv.org/abs/1005.0722v2", "guidislink": true, "updated": "2010-10-23T08:46:06Z", "updated_parsed": [2010, 10, 23, 8, 46, 6, 5, 296, 0], "published": "2010-05-05T11:51:44Z", "published_parsed": [2010, 5, 5, 11, 51, 44, 2, 125, 0], "title": "On Theta-palindromic Richness", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.3077%2C1005.3768%2C1005.2462%2C1005.4277%2C1005.2207%2C1005.0698%2C1005.3809%2C1005.1244%2C1005.3656%2C1005.4212%2C1005.2508%2C1005.0117%2C1005.4419%2C1005.0059%2C1005.5542%2C1005.2380%2C1005.2067%2C1005.0273%2C1005.3665%2C1005.4520%2C1005.2969%2C1005.4198%2C1005.0606%2C1005.0046%2C1005.1069%2C1005.2750%2C1005.1536%2C1005.5460%2C1005.1948%2C1005.5446%2C1005.0766%2C1005.4128%2C1005.4801%2C1005.4988%2C1005.3026%2C1005.4878%2C1005.4743%2C1005.2784%2C1005.4192%2C1005.0413%2C1005.0516%2C1005.0629%2C1005.5141%2C1005.1398%2C1005.3099%2C1005.5189%2C1005.4736%2C1005.0934%2C1005.2578%2C1005.3298%2C1005.5561%2C1005.2159%2C1005.5352%2C1005.1077%2C1005.5515%2C1005.2469%2C1005.2014%2C1005.1021%2C1005.1216%2C1005.4267%2C1005.2944%2C1005.1680%2C1005.2419%2C1005.0722%2C1005.0400%2C1005.0348%2C1005.0370%2C1005.0196%2C1005.0422%2C1005.2195%2C1005.2755%2C1005.1150%2C1005.1891%2C1005.2061%2C1005.3856%2C1005.1379%2C1005.1362%2C1005.4339%2C1005.5030%2C1005.1149%2C1005.4054%2C1005.4979%2C1005.3242%2C1005.5180%2C1005.3610%2C1005.4806%2C1005.5131%2C1005.5123%2C1005.2670%2C1005.2399%2C1005.4307%2C1005.0123%2C1005.0079%2C1005.3702%2C1005.0818%2C1005.2686%2C1005.4795%2C1005.5270%2C1005.0970%2C1005.0147%2C1005.1751&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "On Theta-palindromic Richness"}, "summary": "In this paper we study generalization of the reversal mapping realized by an\narbitrary involutory antimorphism $\\Theta$. It generalizes the notion of a\npalindrome into a $\\Theta$-palindrome -- a word invariant under $\\Theta$. For\nlanguages closed under $\\Theta$ we give the relation between\n$\\Theta$-palindromic complexity and factor complexity. We generalize the notion\nof richness to $\\Theta$-richness and we prove analogous characterizations of\nwords that are $\\Theta$-rich, especially in the case of set of factors\ninvariant under $\\Theta$. A criterion for $\\Theta$-richness of\n$\\Theta$-episturmian words is given together with other examples of\n$\\Theta$-rich words.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.3077%2C1005.3768%2C1005.2462%2C1005.4277%2C1005.2207%2C1005.0698%2C1005.3809%2C1005.1244%2C1005.3656%2C1005.4212%2C1005.2508%2C1005.0117%2C1005.4419%2C1005.0059%2C1005.5542%2C1005.2380%2C1005.2067%2C1005.0273%2C1005.3665%2C1005.4520%2C1005.2969%2C1005.4198%2C1005.0606%2C1005.0046%2C1005.1069%2C1005.2750%2C1005.1536%2C1005.5460%2C1005.1948%2C1005.5446%2C1005.0766%2C1005.4128%2C1005.4801%2C1005.4988%2C1005.3026%2C1005.4878%2C1005.4743%2C1005.2784%2C1005.4192%2C1005.0413%2C1005.0516%2C1005.0629%2C1005.5141%2C1005.1398%2C1005.3099%2C1005.5189%2C1005.4736%2C1005.0934%2C1005.2578%2C1005.3298%2C1005.5561%2C1005.2159%2C1005.5352%2C1005.1077%2C1005.5515%2C1005.2469%2C1005.2014%2C1005.1021%2C1005.1216%2C1005.4267%2C1005.2944%2C1005.1680%2C1005.2419%2C1005.0722%2C1005.0400%2C1005.0348%2C1005.0370%2C1005.0196%2C1005.0422%2C1005.2195%2C1005.2755%2C1005.1150%2C1005.1891%2C1005.2061%2C1005.3856%2C1005.1379%2C1005.1362%2C1005.4339%2C1005.5030%2C1005.1149%2C1005.4054%2C1005.4979%2C1005.3242%2C1005.5180%2C1005.3610%2C1005.4806%2C1005.5131%2C1005.5123%2C1005.2670%2C1005.2399%2C1005.4307%2C1005.0123%2C1005.0079%2C1005.3702%2C1005.0818%2C1005.2686%2C1005.4795%2C1005.5270%2C1005.0970%2C1005.0147%2C1005.1751&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this paper we study generalization of the reversal mapping realized by an\narbitrary involutory antimorphism $\\Theta$. It generalizes the notion of a\npalindrome into a $\\Theta$-palindrome -- a word invariant under $\\Theta$. For\nlanguages closed under $\\Theta$ we give the relation between\n$\\Theta$-palindromic complexity and factor complexity. We generalize the notion\nof richness to $\\Theta$-richness and we prove analogous characterizations of\nwords that are $\\Theta$-rich, especially in the case of set of factors\ninvariant under $\\Theta$. A criterion for $\\Theta$-richness of\n$\\Theta$-episturmian words is given together with other examples of\n$\\Theta$-rich words."}, "authors": ["Stepan Starosta"], "author_detail": {"name": "Stepan Starosta"}, "author": "Stepan Starosta", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.tcs.2010.12.011", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1005.0722v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1005.0722v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "14 pages", "arxiv_primary_category": {"term": "math.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "68R15", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1005.0722v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1005.0722v2", "journal_reference": "Theoretical Computer Science, Volume 412, Issues 12-14, 18 March\n  2011, Pages 1111-1121", "doi": "10.1016/j.tcs.2010.12.011", "fulltext": "ON THETA-PALINDROMIC RICHNESS\n\narXiv:1005.0722v2 [math.CO] 23 Oct 2010\n\nŠTĚPÁN STAROSTA\nAbstract. In this paper we study generalization of the reversal mapping realized by an arbitrary\ninvolutory antimorphism Θ. It generalizes the notion of a palindrome into a Θ-palindrome – a word\ninvariant under Θ. For languages closed under Θ we give the relation between Θ-palindromic complexity\nand factor complexity. We generalize the notion of richness to Θ-richness and we prove analogous\ncharacterizations of words that are Θ-rich, especially in the case of set of factors invariant under Θ. A\ncriterion for Θ-richness of Θ-episturmian words is given together with other examples of Θ-rich words.\n\n1. Introduction\nA palindrome is a word that reads the same from the left as from the right. In the last decade the\nstudy of palindromes in the field of combinatorics on words has notably grown. The motivation comes\nfor instance from the application in mathematical physics or diophantine approximation. Two notions\nwere mainly studied. First the palindromic complexity which counts the number of palindromes of\ngiven length in an infinite word. Its study resulted for example in a new equivalent definition of Sturmian\nwords using palindromic complexity ([12]). The second notion is the notion of defect which measures\nthe saturation by palindromic factors of a finite word ([6]) . An important class of words that are \"rich\"\nin palindromes in the utmost sense (called rich words) have been defined in [11, 13]. They have been\nfurther studied and many characterizations have been found. For recent results and summary on rich\nwords see for instance [9, 10, 13].\nA more general approach to the notion of palindrome has been considered by replacing the reversal\nmapping by a mapping Θ having the needed properties, i.e., being an involution and antimorphism. A\nword which is invariant under such mapping is called a pseudopalindrome or Θ-palindrome. See\nfor instance [2] or [7]. In this work we concentrate on Θ-palidromic saturation in infinite words. We\nderive an upper bound for the number of distinct Θ-palindromic factors in a finite word. We define an\nanalogue to rich words – words containing the maximum number of Θ-palindromes possible. For this\nclass of words that are rich in Θ-palindromes (or shortly Θ-rich) we prove similar equivalent statements\nas are known for rich words. The main result concerns words with set of factors closed under Θ. We\nprove the following relation between Θ-palindromic complexity PΘ (n) and factor complexity C(n) which\nis analogous to the case of the reversal mapping ([3]). PΘ (n) denotes the function counting the number\nof distinct Θ-palindromic factors of length n in a given word and C(n) denotes the function counting the\nnumber of distinct factors of length n in a given word.\nTheorem 1. Let u be an infinite word with language closed under Θ. Then\nPΘ (n) + PΘ (n + 1) ≤ C(n + 1) − C(n) + 2, for all n ∈ N.\nWe show that the equality is attained for Θ-rich words, a result analogous to the case of the reversal\nmapping in [9].\nTheorem 2. Let u be an infinite word with language closed under Θ. Then u is Θ-rich if and only if\nPΘ (n) + PΘ (n + 1) = C(n + 1) − C(n) + 2 for all n ≥ 1.\nWe also make a connection to Θ-episturmian words that are a generalization of episturmian words –\na well known example of rich words. For a survey on such class of words see for instance [8]. Unlike\nepisturmian words, Θ-episturmian words are not all Θ-rich. We give a condition when this is true.\nDate: October 28, 2018.\n1\n\n\f2\n\nŠTĚPÁN STAROSTA\n\nSection 2 summarizes notation and introduces some needed results from combinatorics on words. It\nincludes known results on rich words and defines Θ-palindromes. Section 3 establishes a relation between\nΘ-palindromic and factor complexity. Next section introduces the definition of Θ-richness and a proof of\nTheorem 2. Section 5 provides examples of Θ-rich words and contains also examples of Θ-episturmian\nwords which are not Θ-rich.\n2. Notation and basic facts\nBy A we denote an alphabet – a finite set of symbols, called letters. A finite sequence of letters\nw = w0 w1 w2 . . . wn−1 is called a word. Its length is denoted by |w| and equals n. The set of all words\nover an alphabet A, together with the empty word ε and the operation of concatenation, form a free\nmonoid A∗ .\nThe reversal of a finite word w = w0 w1 . . . wn−1 is the word w = wn−1 wn−2 . . . w0 . The mapping\nw 7→ w is called reversal and clearly is a bijection on A∗ . If w = w then such word w is called a\npalindrome.\nAn infinite sequence u = u0 u1 u2 . . . of letters from A is said to be an infinite word over A. A finite\nword v is called a factor of a finite word w if there exist words v ′ and v ′′ such that w = v ′ vv ′′ . If v ′ = ε\nthen v is called a prefix of w. If v ′′ = ε then v is called a suffix. A factor of an infinite word u is defined\nanalogously with v ′′ being infinite.\nThe language L(u) of an infinite word u is the set\nS of all its factors. Ln (u) denotes the set of factors of\nu of length n. We have L0 (u) = {ε} and L(u) = n∈N Ln (u). If for every factor w ∈ L(u) the reversal\nimage of w is in L(u), then we say that the language L(u) is closed under reversal.\nFor any factor w ∈ L(u) there exists an index i such that w = ui ui+1 . . . ui+|w|−1 . Such an index is\ncalled an occurrence of w in u. We will say that a factor v is unioccurent in some word w if v occurs\nexactly once in w. If every factor of u has at least 2 occurrences in u then the word u is said to be\nrecurrent. One can verify that this is equivalent with every factor occurring infinitely many times. For a\nrecurrent infinite word we define a complete return word 1 to a factor w ∈ L(u) to be a factor with exactly\n2 distinct occurrences of w, one as a prefix and one as a suffix.\nA factor w ∈ L(u) is said to be left (right) special if there exist two distinct letters a, b ∈ A such that\naw ∈ L(u) and bw ∈ L(u) (wa ∈ L(u) and wb ∈ L(u)). A factor is bispecial if it is right and left special.\nThe factor complexity of an infinite word u is a mapping N 7→ N defined as C(n) := #Ln (u). The\npalindromic complexity is a mapping N 7→ N defined as P(n) := # {w ∈ Ln (u) | w = w}.\nIn [3] the following connection between palindromic complexity and the first difference of factor complexity ∆C(n) = C(n + 1) − C(n) was proved.\nTheorem 3 ([3]). Let u be an infinite word with language closed under reversal. Then for all n we have\n(1)\n\nP(n) + P(n + 1) ≤ ∆C(n) + 2.\n\nGiven an infinite word u and n ∈ N, we define the Rauzy graph of order n of the word u, denoted\nΓn (u), as follows. Γn (u) is a directed graph whose set of vertices equals Ln (u) and set of edges equals\nLn+1 (u). There is an edge e ∈ Ln+1 (u) going from the vertex v1 to the vertex v2 if v1 is a prefix of e and\nv2 is a suffix of e. If the word u is recurrent then for all n the graph Γn (u) is strongly connected, i.e.,\nthere exists a directed path from any vertex to any other vertex. Let deg+ (w) denote the outdegree of\na vertex w. Especially for Γn (u) we have deg+ (w) = # {a ∈ A | wa ∈ L(u)}. Rauzy graphs are a useful\ntool to calculate the complexity as we have\nX\n\u0001\ndeg+ (w) − 1 .\n∆C(n) =\nw∈Ln (u)\n\nAn n-simple path p is a factor of u of length at least n + 1 such that its prefix of length n and its\nsuffix of length n are both special (left or right) and no interior factor of length n is special. We can now\ndefine the reduced Rauzy graph of order n of u Γ′n (u). Its set of vertices equals the set of special (right\nor left) factors of Ln (u). There is an edge e from v1 to v2 if there is a n-simple path p which begins with\n1A shorter term \"complete return\" is also used.\n\n\fON THETA-PALINDROMIC RICHNESS\n\n3\n\nv1 and ends with v2 . Note that if for a given length N there is no special factor, the word u is periodic,\ni.e., can be written as u = v ω = vvv . . ., where v is a finite word. In such cases the definition of reduced\nRauzy graph of order n results in an empty graph for all n ≥ N .\nConsider now an infinite word u with language closed under reversal. We can define the super reduced\nRauzy graph of order n of u denoted Γ′′n (u) (first defined in [9]). Its set of vertices is formed by unordered\npairs {w, w}, where w ∈ Ln (u) is a special factor. There is an undirected edge {e, e} from {v, v} to\n{w, w} if there is an n-simple path e starting with v or v and ending with w or w. Note that Γ′′n (u) may\nhave multiple edges or loops.\n2.1. Palindromic richness. We say that a finite word w is rich if it has exactly |w| + 1 palindromic\nfactors. It is in fact the maximum number of palindromic factors possible. An infinite word is rich if all\nits factors are rich. This definition arises from the work done in [11] and in [13].\nThe following theorem summarizes some known characterizations of rich words. Listed equivalent\ndefinitions of richness have been proven respectively in [13], [9], [10].\nTheorem 4 ([13], [9], [10]). For any infinite word u the following conditions are equivalent:\n(1) u is rich,\n(2) any complete return word to a palindromic factor of u is a palindrome,\n(3) for any factor w of u, every factor of u that contains w only as its prefix and w only as its suffix\nis a palindrome,\n(4) each factor of u is uniquely determined by its longest palindromic prefix and its longest palindromic\nsuffix.\nThe following theorem gives a characterization of rich infinite words with language closed under reversal. It also answers the question whether the inequality (1) in Theorem 3 is reached for rich words.\nTheorem 5 ([9]). Let u be an infinite word with language L(u) closed under reversal. Then u is rich if\nand only if P(n + 1) + P(n) = ∆C(n) + 2 for all n ∈ N.\nIn [4] a different characterization of rich words with language closed under reversal has been shown.\nIt is based on bispecial orders of factors.\nLet us mention two classes of words that we will refer to later and that are also rich. The well-known\nSturmian words are exactly those words with factor complexity C(n) = n + 1 for all n ∈ N. The second\nclass consists of so-called episturmian words. They are defined as words whose language is closed under\nreversal and have at most one left special factor of every length.\nFor further information on episturmian or rich words you can refer for instance to [5, 11, 13, 14].\nA differently constructed class of rich words than the two mentioned above may be found in [1].\n2.2. Θ-palindromicity. The reversal mapping can in fact be understood as a special case of a more\ngeneral mapping Θ: A∗ 7→ A∗ which satisfies two conditions:\n(1) it is an involution, i.e., Θ2 = id;\n(2) Θ is an antimorphism, i.e., ∀v, w ∈ A∗ , Θ(vw) = Θ(w)Θ(v).\nFrom now on, Θ will denote a mapping with such properties. It is easy to verify that Θ can only be a\ncomposition of the reversal mapping and an involutory permutation of letters. Such permutation has two\ntypes of cycles distinguished by their length 1 or 2.\nThe definitions in the previous section can be modified in the following way. A finite word w is called\na Θ-palindrome if w = Θ(w). Θ-palindromic complexity is a mapping N 7→ N defined as\nPΘ (n) := # {w ∈ Ln (u) | w = Θ(w)} .\nThe language of u is closed under Θ if for any factor w ∈ L(u) we have Θ(w) ∈ L(u). The definition of\nsuper reduced Rauzy graph is analogous: for words closed under Θ the reversal mapping is replaced by\nΘ.\nAs we will see later, a crucial difference between the reversal mapping and a Θ mapping different from\nthe reversal mapping is that there exists a letter a such that a 6= Θ(a). Therefore there exist words that\nhave no non-empty Θ-palindromic suffix at all.\n\n\f4\n\nŠTĚPÁN STAROSTA\n\nThe research on Θ-palindromicity has led to several generalizations of known results. We will recall\none such generalization. A word is Θ-episturmian if its language is closed under Θ and if for each n\nthere exists at most one left special factor of length n. Such words are discussed for instance in [8]. In [2]\nthese words are called pseudopalindromic. A more general class that we will mention later is discussed\nin [7].\n3. Θ-palindromic and factor complexity\nAs for the reversal mapping, if u has its language closed under Θ, then it is recurrent. To see that,\nconsider a non-Θ-palindromic factor w ∈ L(u). As L(u) is closed under Θ we can find an occurrence of\nΘ(w) and so find a factor r having w as a prefix (respectively suffix) and Θ(w) as a suffix (respectively\nprefix). If r is not a Θ-palindrome, then we can find a different occurrence of Θ(r) and in it a second\noccurrence of w. If w or r is a Θ-palindrome it suffices to consider a non-Θ-palindromic factor that\ncontains w or r as factor. Such factor either exists (for instance one can look only among prefixes of u)\nor u is trivial (periodic with period 1).\nThe following observation, stated as a lemma, will be used in the proof of Theorem 1. We provide a\nshort proof.\nLemma 6. Let u be an infinite word with language closed under Θ. If there exists an integer N such\nthat there is no special factor of length N , then for all n ≥ N we have PΘ (n) + PΘ (n + 1) = 2.\nProof. As u is recurrent, it is clear that for all n ≥ N , Γn (u) is a cycle. Take n ≥ N . We will consider\nan undirected graph G whose vertices are defined by unordered pairs {w, Θ(w)} for all w ∈ Ln (u). Let e\nbe an edge of Γn (u) going from the vertex w to the vertex v. For each pair {e, Θ(e)}, there is an edge in\nG between the vertex {w, Θ(w)} and the vertex {v, Θ(v)}. Note that there may be multiple edges and\nalso loops (in the case e = Θ(e)). According to the terminology already used this graph may be called\n\"super Rauzy graph of order n\".\nAs Γn (u) is a cycle, it is clear that G is formed by one elementary path p and at most 2 loops one possibly on the first vertex of p, one possibly on the last vertex of p. Suppose there is an interior\nvertex {w, Θ(w)} in p such that w = Θ(w). Then w would be a special factor of length n and we have a\ncontradiction. Denote by {s, Θ(s)} the first vertex of p. If there is a loop on {s, Θ(s)}, then it is clear\nthat s 6= Θ(s) as otherwise s would be special. On the other hand, if there is not a loop on {s, Θ(s)},\nthen s = Θ(s) as Γn (u) would be disconnected. The reasoning is analogous for the last vertex of p.\nAs a loop in G is in fact a Θ-palindrome of length n + 1, we have at most 2 Θ-palindromes of length\nn or n + 1 - one associated with the first vertex of p and one with the last vertex of p.\n\u0003\nWe will now prove the analogue of Theorem 3 for languages closed under Θ.\nProof of Theorem 1. Consider the operation θ which to every vertex w of a Rauzy graph associates Θ(w)\nand to every edge e associates Θ(e). Since we supposed the language closed under Θ, θ is well defined\non all Rauzy graphs of u. In fact, θ maps every Rauzy graph Γn (u) onto itself. We will omit u in the\nnotation of Rauzy graphs from now on.\nFix n. We are interested in n-simple paths. As L(u) is closed under Θ, u is recurrent. Thus the graph\nΓn is strongly connected and every vertex and every edge belongs to an n-simple path.\nFor an edge satisfying θ(e) = e we find the n-simple path p which contains e. Then the operation θ\nmust map the path represented by p onto itself, i.e., p = Θ(p). Similarly, for a non-special vertex w such\nthat θ(w) = w, the n-simple path containing w is mapped by θ onto itself.\nNote that an n-simple path can contain at most one Θ-palindrome of length n or n + 1 which is not its\nprefix or suffix. To prove that suppose the contrary. Let z be an n-simple path containing two interior Θpalindromic factors of length n or n + 1. Denote p1 the Θ-palindrome with leftmost occurrence in z which\nis not a prefix of z. Since there is another Θ-palindrome of length n or n + 1 and z is a Θ-palindrome,\nthere is another occurrence of p1 as an interior factor of z. Let r be the shortest left special factor such\nthat p1 is its suffix. If there is no occurrence of r in z, then there is another occurrence in z of the prefix\nof z of length n which is neither its prefix nor suffix. If there is at least one occurrence of r in z, then\n\n\fON THETA-PALINDROMIC RICHNESS\n\n5\n\neither the prefix of length n of r is a special factor of z different from its prefix or suffix, or again the\nprefix of z of length n has another occurrence in z different from its prefix or suffix. In both cases, we\ncan find an interior occurrence of a special factor of length n - a contradiction with z being an n-simple\npath.\nTo give an upper bound on PΘ (n) + PΘ (n + 1) therefore consists in finding the number of n-simple\npaths in Γn that are mapped by θ onto themselves and the number of special Θ-palindromes of length n.\nFor that we can consider the reduced Rauzy graph Γ′n .\nThe set of vertices of Γ′n can be partitioned into two disjoint subsets. The first subset is given by special\nΘ-palindromes of length n. Let α denote the number of such vertices. The second subset is formed by\nthe rest of the vertices – non-Θ-palindromic special factors of length n. Let the number of such vertices\nbe denoted by 2β. The total number of vertices in Γ′n is then α + 2β.\nIt is clear that the super reduced Rauzy graph Γ′′n has exactly α + β vertices. As Γ′′n is connected,\nit has at least α + β − 1 edges. Thus the number of edges in Γ′n is at least 2(α + β − 1). These edges\ncorrespond to the n-simple paths in Γn which are not mapped by θ onto themselves.\nAs already mentioned, the number of Θ-palindromes of length n or n + 1 is bounded by the number\nof n-simple paths in Γn which are mapped onto themselves, and the number of special Θ-palindromic\nvertices. We thus have\nX\nPΘ (n) + PΘ (n + 1) ≤\ndeg+ (w) − 2(α + β − 1) + α,\nw is special\n\nwhere the first summand is the number of all n-simple paths in Γn , the second summand estimates the\nnumber of n-simple paths which are not mapped onto themselves, and the third counts the number of\nspecial Θ-palindromic vertices. We obtain\nX\ndeg+ (w) − (α + 2β) + 2 =\nPΘ (n) + PΘ (n + 1) ≤\nw∈Ln (u) is special\n\n(2)\n\nX\n\n=\n\nw∈Ln (u) is special\n\n\u0001\ndeg+ (w) − 1 + 2 =\n\n=\n\n∆C(n) + 2.\n\nThe proof is finished except for the special case where the word u is periodic. This implies existence\nof N such that for all n ≥ N we have ∆C(n) = 0, i.e., there is no special factor of length n. It this case\nthe reduced Rauzy graph of order n is empty. According to Lemma 6 we have PΘ (n) + PΘ (n + 1) = 2\nfor all n ≥ N , which completes the proof.\n\u0003\nCorollary 7. Let L(u) be closed under Θ. Let n ≥ 0. The equality\n(3)\n\nPΘ (n) + PΘ (n + 1) = ∆C(n) + 2\n\nholds if and only if both of the following conditions are satisfied:\n(1) the graph Γ′′n after removing loops is a tree,\n(2) any simple path forming a loop in the graph Γ′′n is mapped by θ onto itself.\nProof. First, we rewrite the equality in the relation (2) as\n∆C(n) + 2 = #n-simple paths in Γ′n − α − 2β + 2\nwhere α is again the number of special Θ-palindromes of length n and 2β is the number of non-Θpalindromic special factors of length n. Let p denote the number of n-simple paths that are mapped by\nθ onto themselves and m the number of n-simple paths that are not mapped onto themselves.\nWe will prove the equivalence directly. Suppose that PΘ (n) + PΘ (n + 1) = ∆C(n) + 2. We have\nα + p = PΘ (n) + PΘ (n + 1) = ∆C(n) + 2 = p + m − α − 2β + 2.\nTherefore m = 2(α + β − 1). From the proof of Theorem 1, this is equivalent with having exactly the\nminimum number of non-Θ-palindromic n-simple paths needed so that the graph Γ′n is strongly connected.\n\n\f6\n\nŠTĚPÁN STAROSTA\n\nAs loops are not needed to have the graph strongly connected, they are counted in the number p. These\ntwo facts are equivalent with Γ′′n being a tree after removing loops and all loops being Θ-palindromic.\n\u0003\nA natural question is whether there exist such words for which the equality (3) is satisfied for all n.\nThe answer is positive only for Θ equal to the reversal mapping. In any other case we have PΘ (1) < #A\nand thus\nPΘ (0) + PΘ (1) < (#A − 1) + 2 = ∆C(0) + 2.\nHowever, there are words saturated in Θ-palindromes that satisfy the equality for all n ≥ 1. Examples\nof such words are given in Section 5.1.\n4. Θ-Richness\nRecall that a finite word is rich if it has the maximum possible number of palindromic factors. If we\nwant to use the same notion of richness for Θ-palindromes, we need to take into consideration that there\nis always fewer Θ-palindromes since some letters may not be Θ-palindromes. To define richness we need\nto evaluate the number of these letters contained in a given word. We introduce the set γ(w) as follows\n\b\nγ(w) := {a, Θ(a)} | a ∈ A, a 6= Θ(a), a or Θ(a) ∈ L(w) .\n\nIt is clear that if w′ is a prefix of some finite word w, then #γ(w′ ) ≤ #γ(w). It is also clear that if for\nsome letter x ∈ A we have γ(w) 6= γ(wx),\n\b then the word wx has no Θ-palindromic suffix as Θ(x) does\nnot occur in it. Also, as γ(wx) = γ(w) ∪ {x, Θ(x)} , one can see that in this case #γ(wx) = #γ(w) + 1.\nThe following proposition gives the maximum number of Θ-palindromes that may occur in a finite\nword.\nProposition 8. Let w be a finite word. Then the number of its Θ-palindromic factors is bounded by\n|w| + 1 − #γ(w).\n\nProof. The proof is done by induction on |w|. The statement is clear for |w| ≤ 1. Suppose that for\n|w| ≤ N , w contains at most |w| + 1 − #γ(w) different Θ-palindromes. Let x ∈ A. We will count the\nnumber of Θ-palindromes in the word wx. It is clear that the number of Θ-palindromes in wx is equal\nto the number of Θ-palindromes in w plus the number of new Θ-palindromic factors – Θ-palindromic\nsuffixes of wx that do not occur in w.\nFirst suppose we have γ(w) 6= γ(wx). As there is no Θ-palindromic suffix the number of Θ-palindromes\nin wx equals the number of Θ-palindromes in w which is at most |w| + 1 − #γ(w) = |wx| + 1 − #γ(wx).\nSuppose γ(wx) = γ(w). Suppose for contradiction that wx contains more than |wx| + 1 − #γ(wx)\ndifferent Θ-palindromes. As |wx| + 1 − #γ(wx) = (|w| + 1 − #γ(w)) + 1, it is clear that there must be\nat least two different Θ-palindromes p and q such that w = yp and w = zq that do not occur previously\nin w (as they were not yet counted). We can assume that |p| > |q| and p is the longest of such suffixes\nof wx. On the other hand we have p = vq = qΘ(v) where |v| > 0. Therefore every such factor q occurs\nalready in w and has already been counted in the number of Θ-palindromes in w – a contradiction. We\ncan see that the number of Θ-palindromes in wx is equal to either the number of Θ-palindromes in w\nor the number of Θ-palindromes in w plus 1. Therefore the upper bound is |w| + 1 − #γ(w) + 1 which\nequals |wx| + 1 − #γ(wx).\n\u0003\nWe can see from the preceding proof that if there is a new Θ-palindromic factor, it is the longest\nΘ-palindromic suffix. We will now define a class of words having maximum number of Θ-palindromes.\nDefinition 9. A finite word w is Θ-rich if it contains |w| + 1 − #γ(w) Θ-palindromic factors.\nAn infinite word is Θ-rich if all its factors are Θ-rich.\nOne can see that all factors of a finite Θ-rich word are Θ-rich as well. Thus, if an infinite word has all\nits prefixes Θ-rich, then all its factors are Θ-rich and it is by definition Θ-rich.\nThe following equivalence is a consequence of the last remark and of the proof of Proposition 8. It is\na Θ-rich analogue of results in [11, 13].\n\n\fON THETA-PALINDROMIC RICHNESS\n\n7\n\nProposition 10. An infinite or finite word u is Θ-rich if and only if the longest Θ-palindromic suffix of\neach prefix p is unioccurrent except for prefixes having the form px, with x ∈ A and γ(p) 6= γ(px).\nProposition 10 leads to the following corollary, which is a Θ-rich analogue of a result in [9].\nCorollary 11. Let u be an infinite Θ-rich word. Then for all w ∈ L(u), w 6= Θ(w), the occurrences of\nw and Θ(w) alternate.\nProof. Suppose there exist a factor w ∈ L(u), w 6= Θ(w), and a factor v ∈ L(u), |v| > |w|, such that\nw is its prefix and its suffix and there is no occurrence of Θ(w) in v. Since the last letter of v already\noccurred in v and v does not have a unioccurrent Θ-palindromic suffix, according to Proposition 10 we\nhave a contradiction.\n\u0003\nThe following proposition gives an equivalent characterization of Θ-rich words.\nProposition 12. Let u be an infinite or finite word. Then u is rich Θ-rich if and only if for each factor\nv 6= ε of u, any factor of u beginning with v and ending with Θ(v), containing no other occurrences of v\nor Θ(v), is a Θ-palindrome; and for all a ∈ A, the occurrences of a and Θ(a) in u alternate.\nProof. (⇒): Let v be a factor of u. Consider a factor r containing v as a prefix and Θ(v) as a suffix,\nwith no other occurrences of v or Θ(v).\nIf |v| = |r|, then v = Θ(v) and r is a Θ-palindrome.\nLet us assume |v| < |r|. Let s be the longest Θ-palindromic suffix of r. (There is such a suffix as r is\nΘ-rich and the image by Θ of the last letter of r has already occurred in r as the first letter.)\nIf |s| ≤ |v| then we can write Θ(v) = zs with z ∈ A∗ . Then v = Θ(s)Θ(z) = sΘ(z). We have a second\noccurrence of s in r – a contradiction with its unioccurrence.\nIf |v| < |s| < |r| then as Θ(v) is a suffix of s we can write s = zΘ(v) = vΘ(z). Therefore we can find\na second occurrence of v in r – a contradiction with choice of r.\nThe last possibility left is s = r and thus r is a Θ-palindrome.\nAlternation of a and Θ(a) follows from Corollary 11.\n(⇐): Suppose for contradiction that u is not Θ-rich. Then there is a prefix p whose longest Θpalindromic suffix s occurs at least twice in p or there is a prefix p with no non-empty Θ-palindromic\nsuffix such that p ends in a non-Θ-palindromic letter a and has at least one another occurrence of a or\nΘ(a).\nIn the first case, as s occurs in p for a second time, there is a complete return word to s contained in\np which is its suffix. The complete return word is a Θ-palindrome and is longer than s – a contradiction.\nIn the second case, as occurrences of a and Θ(a) alternate, we can find the rightmost occurrence of\nΘ(a) in p. The suffix starting at that occurrence is then a word beginning with Θ(a), ending with a and\nwith no other occurrences of a or Θ(a). We supposed such words were Θ-palindromic. Thus p has a\nΘ-palindromic suffix and we have a contradiction.\n\u0003\nIn the last proof we did not need all the assumptions to prove the second implication. We can formulate\na weaker sufficient condition as follows.\nProposition 13. Let u be an infinite or finite word satisfying\n• all complete return words to Θ-palindromes are Θ-palindromes;\n• for any a ∈ A, a 6= Θ(a), occurrences of a and Θ(a) alternate;\n• factors beginning with a ∈ A and ending with Θ(a), with no other occurrences of a or Θ(a), are\nΘ-palindromes.\nThen u is Θ-rich.\nThe following lemma will be used in the proof of Theorem 2.\nLemma 14. Let u be an infinite word with language closed under Θ. If PΘ (1) + PΘ(2) = ∆C(1) + 2 then\nfor all letters a, a 6= Θ(a), occurrences of a and Θ(a) alternate.\n\n\f8\n\nŠTĚPÁN STAROSTA\n\nProof. Let a ∈ A and suppose a is not a Θ-palindrome. We will look at the super reduced Rauzy graph\nΓ′′1 for which the statements in Corollary 7 hold.\nSuppose a is not special. Then a is a factor of exactly one 1-simple path p. If the edge {p, Θ(p)} is\na loop in Γ′′1 then the occurrences of a and Θ(a) must alternate as p = Θ(p). If {p, Θ(p)} is not a loop\nthen there is no path in Γ′′1 that would contain 2 occurrences of p and no occurrence of Θ(p). Such path\nwould form a cycle in Γ′′1 which is not possible.\nSuppose now that a is special. Then {a, Θ(a)} is a vertex of Γ′′1 . We will look at paths going from\n{a, Θ(a)} again to {a, Θ(a)} which are not going through the vertex {a, Θ(a)}. There are 2 possibilities.\nIn the first case such path corresponds to a loop in Γ′′1 connected to {a, Θ(a)}. Therefore, the corresponding path in Γ1 is a 1-simple path and is a Θ-palindrome beginning with a or Θ(a) respectively and\nending with Θ(a) or a respectively.\nIn the second case such path starts with an edge {e, Θ(e)}. It is clear that the end of this path is again\nthe same edge {e, Θ(e)} as otherwise there would be a cycle in Γ′′1 . If the corresponding path in Γ1 starts\nwith e, it must end with Θ(e) as otherwise there would be a multiple edge (forming a cycle) between the\nvertices of Γ′′ connected by {e, Θ(e)}. Therefore, if such path starts with a, it must end with Θ(a) and\nthe proof is finished.\n\u0003\nIn what follows, to ease the notation, we will borrow some elements from the free group generated\nby A and use them in the following way. Let w be a finite word. By w−1 we denote an element whose\nconcatenation with w produces the empty word, i.e., ww−1 = w−1 w = ε. The notation is justified by the\nfact that we will never concatenate w−1 with anything else than w.\nProof of Theorem 2.\n(⇐):\nSuppose that u is not rich. According to Lemma 14 non-Θ-palindromic letters alternate. Proposition 12\nimplies there exists a factor v ∈ L(u) and a factor r ∈ L(u) such that r begins with v and ends with\nΘ(v), with no other occurrences of v or Θ(v), and r is not a Θ-palindrome. Then r is of the form\nr = vwxsyΘ(w)Θ(v),\nwhere w and s are finite words and x, y ∈ A, x 6= Θ(y). As the language is closed under Θ, we can\nsee that vwΘ(y) ∈ L(u). This means that the factor vw is right special and therefore {vw, Θ(vw)} is a\nvertex in Γ′′|vw| .\nIf r is a |vw|-simple path then r forms a loop in Γ′′|vw| . Therefore according to Corollary 7 it is a\nΘ-palindrome – a contradiction.\nSuppose now that r is not a |vw|-simple path, i.e., contains other special factors of length |vw|. Denote\nby p, q two factors of r such that they are |vw|-simple paths and p is a prefix and q a suffix of r. Let p′\ndenote the special suffix of length |vw| of p and q ′ the special prefix of q of length |vw|. It is clear that\nvertices {vw, Θ(vw)} and {p′ , Θ(p′ )} are connected as well as {vw, Θ(vw)} and {q ′ , Θ(q ′ )} are connected.\n−1\nIf p′ and q ′ coincide, i.e., r = pp′ q, then as x 6= Θ(y) we have a multiple edge in Γ′′|vw| – a cycle in Γ′′|vw|\n′\nand thus a contradiction. If p and q ′ do not coincide there exists a path in Γ′′|vw| leading from {p′ , Θ(p′ )}\nto {q ′ , Θ(q ′ )}, avoiding {vw, Θ(vw)}, which together with the two paths connecting {vw, Θ(vw)} forms\na cycle and we have again a contradiction with Corollary 7.\n(⇒):\nWe say that a factor r is a realization of an edge in Γ′′ between vertices {v, Θ(v)} and {w, Θ(w)} if\n• r has a prefix v or Θ(v) and a suffix w or Θ(w) OR\n• r has a prefix w or Θ(w) and a suffix v or Θ(v),\nand contains no interior occurrences of factors v, Θ(v), w and Θ(w).\nWe will denote by v ⇁ w a realization of an edge between vertices {v, Θ(v)} and {w, Θ(w)} which\nstarts with v and ends with w.\n\n\fON THETA-PALINDROMIC RICHNESS\n\n9\n\nFirst, we are going to show that for every pair of distinct vertices {v, Θ(v)} and {w, Θ(w)} there are\nexactly two realizations of an edge between them and that they are Θ images of each other. Let w 6= v and\nw 6= Θ(v). Suppose without loss of generality there is a realization v ⇁ w. We will find two consecutive\nrealizations, denoted r1 and r2 . See Figure 1.\n\nv| ⇁\n{z w} . . . . . . . . . . . . . . . . . . . . . . . . . . . . v| ⇁\n{z w}\nr1\n\nr2\n\nFigure 1. Two consecutive realizations v ⇁ w.\nAccording to Corollary 11 occurrences of each factor alternate with occurrences of its Θ image. Therefore we can find occurrences of Θ(v) and Θ(w) between occurrences of r1 and r2 . Let us first find the\nleftmost occurrence (after r1 ) of Θ(v). As every factor beginning with v and ending with Θ(v) is a\nΘ-palindrome, we can find a realization Θ(w) ⇁ Θ(v). Denote this realization by q1 . See Figure 2. Note\nthat the occurrences of the factor w in r1 and Θ(w) in q1 may coincide.\nΘ-palindrome\n\nz\n}|\n{\nv ⇁ w . . . Θ(w) ⇁ Θ(v) . . . . . . . . . . . . v ⇁ w\n{z\n}\n|\nq1\n\nFigure 2. The leftmost occurrence of realization Θ(w) ⇁ Θ(v).\nLet us now find the rightmost occurrence (before r2 ) of Θ(w). Analogously, we find a realization\nΘ(w) ⇁ Θ(v). Denote this realization by q2 . See Figure 3.\nΘ-palindrome\n\n}|\n{\nz\nv ⇁ w . . . . . . . . . . . . Θ(w) ⇁ Θ(v) . . . v ⇁ w\n|\n{z\n}\nq2\n\nFigure 3. The rightmost occurrence of realization Θ(w) ⇁ Θ(v).\nSuppose now that occurrences of q1 and q2 are not equal. If they are not consecutive, we can find a\nrealization of Θ(w) ⇁ Θ(v), denoted by q1′ , such that q1′ and q2 are consecutive. Now, using the same\narguments as for consecutive realizations r1 and r2 , we can find a realization v ⇁ w between q1′ and q2 .\nThis is a contradiction with r1 and r2 being consecutive. Thus the occurrence of q1 equals the occurrence\nq2 and q1 = q2 . Θ-palindromes depicted in Figure 2 and Figure 3 imply q1 = Θ(r1 ) and q2 = Θ(r2 ),\nrespectively. Therefore r1 = r2 and we deduce that every realization v ⇁ w equals r1 and every realization\nΘ(v) ⇁ Θ(w) equals Θ(r1 ).\nSo far we have shown that for every pair of distinct vertices {v, Θ(v)} and {w, Θ(w)} there are exactly\ntwo realizations of an edge between them and that they are Θ images of each other. This implies that Γ′′\nafter removing loops is a tree. Corollary 11 claims that occurrences of w and Θ(w) alternate, thus any\nrealization between the same vertices {w, Θ(w)} is of the form w ⇁ Θ(w) or Θ(w) ⇁ w. By Proposition 12,\nsuch realizations are Θ-palindromes. These realizations are in fact loops in Γ′′ . Using Corollary 7 these\ntwo parts together imply that the equality (3) holds.\n\u0003\n5. Examples of Θ-rich words\nIn this section we will provide examples of Θ-rich words. We first concentrate on a generalization of\nepisturmian words, namely Θ-episturmian words, mentioned earlier. The following definition will serve\nto reveal the structure of the language of a Θ-episturmian word. Its main aim is to ease the notation.\n\n\f10\n\nŠTĚPÁN STAROSTA\nK\n\nDefinition 15. Let u be a Θ-episturmian word. Denote by (wk )k=0 the sequence of all bispecial factors\nof u, ordered by increasing length and starting by w0 = ε with K possibly equal to +∞. Furthermore let\nzk denote the unique letter such that wk zk is a prefix of wk+1 . Denote by pk ∈ A∗ the word such that\nwk+1 = pk Θ(zk )wk . For all k ∈ N and all a ∈ A let rk,a denote the complete return word to wk beginning\nwith wk a, if it exists.\nFor a letter a 6= Θ(a), let ka denote the maximal index k ≤ K, if it exists, such that wk has non-Θpalindromic complete return words beginning with wk a and with wk Θ(a). If ka does not exist, we will\nconsider it to be +∞.\nNote that since there is at most one complete return word wk having a prefix wk a, the definition of\nrk,a is correct. As the language of u is closed under Θ, rk,a exists if and only if rk,Θ(a) exists. Note also\nthat ka ≥ 1 for every letter a 6= Θ(a).\nProposition 16. Let u be a Θ-episturmian word.\n(1) If a = Θ(a) and rk,a exists, then rk,a is a Θ-palindrome;\n(2) if a 6= Θ(a), then\na. if k ≤ ka , then rk,a equals wk awk , furthermore a is not contained in wk or in any other\ncomplete return word to wk except for rk,a ;\nb. if k > ka , then at most one of the words rk,a and rk,Θ(a) exist.\nProof. The proof will be done by induction on k.\nFor k = 0, we have w0 = ε and the claim holds trivially (for non-Θ-palindromic a we are in the case\n(2a)).\nSuppose the claim holds for k. We will prove it for k + 1. We need to consider especially the case\nk + 1 = ka + 1 for all a to be able to assume also (2b).\nCase (1):\nLet a = Θ(a). If a = zk then rk+1,a = pk Θ(zk )wk as for some word s. As there is at most one complete\nreturn word to wk beginning with wk a, we have wk as = wk aΘ(pk ). Thus, rk+1,a = pk awk aΘ(pk ) which\nis a Θ-palindrome.\nIf a 6= zk suppose that rk+1,a is not a Θ-palindrome. Therefore we can write rk+1,a = pk Θ(zk )wk ax\nand wk ax = yawk v = rk,a v with x, y, v ∈ A∗ . By the assumption rk,a is a Θ-palindrome which implies\nthat v cannot start with zk as rk+1,a would be a Θ-palindrome. In other words we can find a factor\nhaving the form awk b with b 6= zk .\nWe can then find two different factors Θ(zk )wk a ∈ L(u) and Θ(b)wk a ∈ L(u). Thus wk a is left special\nwhich is a contradiction with wk zk being a second left special factor of the same length. Thus b = zk and\nwe have rk+1,a = pk Θ(zk )rk,a zk Θ(pk ) which is a Θ-palindrome. This concludes the proof of the case (1).\nCase (2):\nLet now a 6= Θ(a). We distinguish the following three cases according to the value of ka .\nI. k + 1 ≤ ka\nSuppose that a is contained in wk+1 . This means that wk awk is a factor of wk+1 and so is\nwk Θ(a)wk .\nSuppose zk = a. We have wk+1 = wk awk pwk Θ(a)wk where p is a Θ-palindrome or wk −1 .\nThen the complete return word rk+1,a equals wk+1 awk pwk Θ(a)wk which is a Θ-palindrome and\ncontradicts the assumption k + 1 < ka .\nSuppose now zk 6= a. We can then find a factor of wk+1 of the form bwk awk c with b 6= Θ(zk ).\n(If b = Θ(zk ), then we would have a shorter bispecial factor than wk+1 but longer than wk .) Since\nrk+1,a exists we can find a factor Θ(zk )wk a. Thus wk a is right special which contradicts wk zk being\nright special of the same length.\nWe will now prove that rk+1,a is the only complete return word to wk+1 to contain a. Suppose\nthat a is contained in rk+1,b with b 6= a. Since a is not contained in wk+1 , rk+1,b is of the form\nwk+1 xwk+1 where x ∈ A∗ contains a.\n\n\fON THETA-PALINDROMIC RICHNESS\n\n11\n\nWe can find a factor of x equal to cwk a with c 6= Θ(zk ). As rk+1,a exists there is a factor\nΘ(zk )wk a which implies that wk a is right special. Since especially a 6= zk as otherwise it would be\ncontained in wk+1 , we arrive at a contradiction.\nIt remains to show that rk+1,a = wk+1 awk+1 . Since k + 1 < ka we know from the definition of ka\nthat both rk+1,a and rk+1,Θ(a) exist. We can see that rk+1,a = pk Θ(zk )rk,a x with x ∈ A∗ . If the first\nletter of x is zk we are finished. Suppose it is not true and denote that letter by x0 6= zk . We have\nawk x0 ∈ L(u). As rk+1,Θ(a) exists (from the definition of ka ) we know that Θ(zk )wk Θ(a) ∈ L(u)\nwhich implies awk zk ∈ L(u). This implies that awk is right special. As Θ(zk ) 6= a we can see that\nwe have 2 right special factors of the same length and thus x0 must be zk . Finally as rk,a = wk awk\nwe have rk+1,a = pk Θ(zk )rk,a zk Θ(pk ) = wk+1 awk+1 .\nII. k + 1 = ka + 1\nIf wk+1 does not exist, then rk+1,a does not exist too.\nIf wk+1 exists, suppose that both rk+1,a and rk+1,Θ(a) exist and at least one of them is a Θpalindrome. We can suppose without loss of generality that rk,a is a Θ-palindrome. We can then\nfind a factor Θ(a)wk zk . rk+1,Θ(a) contains a factor Θ(a)wk b with b 6= zk as otherwise we would\nhave two complete return words rk+1,a . The factor Θ(a)wk is therefore right special which implies\nzk = a. As Θ(a)wk Θ(a) ∈ L(u) we have also awk a ∈ L(u) and awk is not right special. Since wk a\ncan only be extended as wk awk we arrive to a contradiction – u = pwk awk awk a . . . which implies\nu is not recurrent (Θ(a) occurs only in the word p).\nIII. k + 1 > ka + 1\nIt suffices to see that if rk,a does not exist then rk+1,a does not exist too.\n\u0003\nCorollary 17. For all letters a 6= Θ(a) the value of ka is finite.\nProof. If u is periodic, then K is finite and so is ka . For u aperiodic if ka = +∞ then we stay in the case\n(2a) for all k. In other words all bispecial factors do not contain a which is clearly impossible.\n\u0003\nFrom the above corollary we can deduce that if Θ is different from the reversal mapping, then there\nexists k such that ∆C(|wk |) < #A − 1, i.e., the growth of factor complexity is not constant.\nThe following corollary will serve to derive the criterion for richness of Θ-episturmian words.\nCorollary 18. Let k > ka and rk,a is a Θ-palindrome. Then either rk+1,a does not exist or is a Θpalindrome.\nProof. Suppose that rk+1,a exists and is not a Θ-palindrome. Then rk+1,a begins by pk Θ(zk )rk,a b where\nzk 6= b ∈ A. As Θ(a)wk b ∈ L(u) so is Θ(b)wk a ∈ L(u). Together with Θ(zk )wk a ∈ L(u) we see that\nwk a is left special, i.e., zk = a. This is impossible as we would have rk+1,a = pk Θ(a)wk aΘ(pk ) – a\nΘ-palindrome.\n\u0003\nCorollary 19. Let u be a Θ-episturmian word. Let lk = |wk |. If there exists an index k0 such that\nPΘ (lk0 ) + PΘ (lk0 + 1) = ∆C(lk0 ) + 2, then for all n ≥ lk0\nPΘ (n) + PΘ (n + 1) = ∆C(n) + 2.\nProof. First note that as u is Θ-episturmian, Γ′′n has at most one vertex for all n.\nAccording to Corollary 7, the graph Γ′′lk consists of one vertex and PΘ (lk0 ) + PΘ (lk0 + 1) − 1 edges\n0\nwhich are loops mapped onto themselves. Therefore all complete return words to wk0 are Θ-palindromes.\nThus, using Corollary 18, for all k > k0 , the graph Γ′′lk consists of one vertex with loops mapped onto\nthemselves. Thus using again Corollary 7, we see that PΘ (lk ) + PΘ (lk + 1) = ∆C(lk ) + 2.\nWe will prove that for all k > k0 , for all n such that lk−1 < n < lk , the graph Γ′′n is of the same form\nas Γ′′lk (one vertex with loops mapped onto themselves) and thus according to Corollary 7 the equation\nPΘ (n)+PΘ (n+1) = ∆C(n)+2 holds. It suffices to see that every n-simple path is in fact a Θ-palindromic\nfactor of a (lk )-simple path or wk .\nIt remains to see the case of finite value of K. Then for all n > K, there is no special factor of length\nn. According to Lemma 6, we have 2 = PΘ (n) + PΘ (n + 1) = ∆C(n) + 2.\n\n\f12\n\nŠTĚPÁN STAROSTA\n\n\u0003\nThe following corollary stems from combining the previous claim with Theorem 2. It gives a criterion\nto see whether a Θ-episturmian word is Θ-rich or not.\nCorollary 20. Θ-episturmian word is Θ-rich if and only if PΘ (1) + PΘ (2) = ∆C(1) + 1.\n5.1. Examples. This section contains examples of infinite words with properties mentioned above.\nExample 21. Let π denote a morphism {0, 1}∗ →\n7 {a, a′ , c}∗ :\n\u001a\n0 7→ aa′\nπ:\n.\n1 7→ aa′ c\nDenote Θ an involutory antimorphism defined as\nΘ : a 7→ a′ , a′ 7→ a, c 7→ c.\nThen the infinite word u = π(v), where v is a Sturmian word, has the following properties:\n(1) is Θ-episturmian,\n(2) satisfies the equality PΘ (n) + PΘ (n + 1) = ∆C(n) + 2 for n ≥ 1,\n(3) is Θ-rich.\nAs v is Sturmian, it is clear that u is aperiodic. Furthermore if we enumerate L2 (u) we see that\n∆C(1) = 1. These two facts imply that for n ≥ 1 we have ∆C(n) = 1. As the language L(v) is closed\nunder reversal, the language L(u) is closed under Θ.\nTo prove the rest we can either apply directly Corollary 20 or enumerate Θ-palindromic complexity.\nIn the following examples the mapping Θ is considered the same as in Example 21.\nExample 22. Let π be the following morphism\nπ : 0 7→ a′ cacc, 1 7→ a′ cac.\nWe set u = π(v) where v is a Sturmian word over {0, 1}. Then u is Θ-episturmian and not Θ-rich.\nThe proof is similar as in Example 21. From v we can deduce that the word u is aperiodic, uniformly\nrecurrent and contains infinitely many Θ-palindromes. The last two properties imply that L(u) is closed\nunder Θ. As ∆C(2) = 1 and there is one special factor of length 1 – the factor c – it is clear that u is\nΘ-episturmian.\nu is not Θ-rich: factors ca′ c and cac do not have a unioccurrent Θ-palindromic suffix.\nNext example is a Θ-rich word which is not Θ-episturmian.\nExample 23. Set π as follows\nπ : 0 7→ aa′ , 1 7→ acca′ .\nLet v be a Sturmian word over {0, 1}. Then the word π(v) is Θ-rich and is not Θ-episturmian. The proof\nis left to the reader.\nThe following two examples concern periodic infinite words.\nω\n\nExample 24. The word (caca′ ) is periodic but not Θ-rich. The factors ca′ c and cac do not have a\nunioccurrent Θ-palindromic suffix as before.\nω\n\nExample 25. The word (ccaa′ ) is periodic and Θ-rich. It follows from the fact that we can find a\nunioccurrent Θ-palindromic suffix for each prefix of this word.\n\n\fON THETA-PALINDROMIC RICHNESS\n\n13\n\n6. Final remarks\nA wider class of infinite words related to Θ-palindromes has been studied in [7]. The class is constructed\nusing the right Θ-palindromic closure operator. To any word w in A∗ it associates the word w⊕ which is\nthe shortest Θ-palindromic word having w as prefix. It is clear that if s denotes the longest Θ-palindromic\nsuffix of w then if we denote w = ps we have w⊕ = psΘ(p).\nLet u0 be a fixed finite word called seed. Let Ψ : A∗ → A∗ be a map defined as follows\nΨ(ε) = u0 ,\n⊕\n\nΨ(ux) = (Ψ(u)x)\n\nfor u ∈ A∗ and x ∈ A.\n\nFor a given infinite word t we can define Ψ(t) as\nΨ(t) = lim Ψ (pref n (t))\nn→+∞\n\nwhere pref n stands for the prefix of length n. The word t is called the directive word of Ψ(t) and is\ndenoted ∆(Ψ(t)). The word Ψ(t) is called Θ-standard word with seed if u0 6= ε otherwise it is called\njust Θ-standard. Θ-episturmian words are included in Θ-standard words with seed (exact condition and\ndetails are given in [7]).\nAs the definition of Θ-standard word is constructive, a rough and direct condition to decide whether\na Θ-standard word is Θ-rich is easy to derive. If the word Ψ (pref n (t)) tn is Θ-rich for all n ≥ 0 (with\nt = t0 t1 t2 . . .), then Ψ(t) is Θ-rich.\nThe following proposition connects the class of Θ-standard words with seed with the class of Θ-rich\nwords.\nProposition 26 (Proposition 4.7, [7]). Let u be a Θ-standard word with seed. Then there exists an\ninteger M such that any prefix p of u of length greater than M has a unioccurrent Θ-palindromic suffix.\nThe integer M is explained in detail in the paper. It is clear that if M = 1, then u is Θ-rich. However\nM = 1 implies some restrictions on Θ and a criterion whether a Θ-standard word with seed is Θ-rich\nremains an open question.\n7. Acknowledgements\nI would like to thank Edita Pelantová and L'ubomíra Balková for their careful reviewing and fruitful\nsuggestions. I acknowledge financial support by the Czech Science Foundation grant no. 201/09/0584,\nby the grant no. MSM6840770039 and LC06002 of the Ministry of Education, Youth, and Sports of\nthe Czech Republic and by the grant no. SGS10/085OHK4/1T/14 of the Grant Agency of the Czech\nTechnical University in Prague.\nReferences\n1. Petr Ambrož, Christiane Frougny, Zuzana Masáková, and Edita Pelantová, Palindromic complexity of infinite words\nassociated with simple Parry numbers, Ann. Inst. Fourier (Grenoble) 56 (2006), 2131–2160.\n2. Vyoma Anne, Luca Q. Zamboni, and Ioana Zorca, Palindromes and pseudo-palindromes in episturmian and pseudoepisturmian infinite words, in: S. Brlek, C. Reutenauer (Eds.), Words 2005, n. 36 in Publications du LACIM, 2005,\npp. 91–100.\n3. Peter Baláži, Zuzana Masáková, and Edita Pelantová, Factor versus palindromic complexity of uniformly recurrent\ninfinite words, Theoret. Comput. Sci. 380 (2007), no. 3, 266–275.\n4. L'ubomíra Balková, Edita Pelantová, and Štěpán Starosta, Sturmian jungle (or garden?) on multiliteral alphabets, to\nappear in RAIRO-Theor. Inf. Appl.\n5. Jean Berstel, Sturmian and episturmian words: a survey of some recent results, CAI'07: Proceedings of the 2nd\ninternational conference on Algebraic informatics (Berlin, Heidelberg), Lecture Notes in Computer Science, vol. 4728,\nSpringer-Verlag, 2007, pp. 23–47.\n6. Srecko Brlek, Sylvie Hamel, Maurice Nivat, and Christophe Reutenauer, On the palindromic complexity of infinite\nwords, Internat. J. Found. Comput. 15 (2004), no. 2, 293–306.\n7. Michelangelo Bucci, Aldo de Luca, Alessandro De Luca, and Luca Q. Zamboni, On different generalizations of episturmian words, Theoret. Comput. Sci. 393 (2008), no. 1-3, 23–36.\n, On theta-episturmian words, European J. Combin. 30 (2009), no. 2, 473–479.\n8.\n\n\f14\n\nŠTĚPÁN STAROSTA\n\n9. Michelangelo Bucci, Alessandro De Luca, Amy Glen, and Luca Q. Zamboni, A connection between palindromic and\nfactor complexity using return words, Advances in Applied Mathematics 42 (2009), no. 1, 60 – 74.\n, A new characteristic property of rich words, Theoret. Comput. Sci. 410 (2009), no. 30-32, 2860–2863.\n10.\n11. Xavier Droubay, Jacques Justin, and Giuseppe Pirillo, Episturmian words and some constructions of de Luca and\nRauzy, Theoret. Comput. Sci. 255 (2001), no. 1-2, 539–553.\n12. Xavier Droubay and Giuseppe Pirillo, Palindromes and Sturmian words, Theoret. Comput. Sci. 223 (1999), no. 1-2,\n73–85.\n13. Amy Glen, Jacques Justin, Steve Widmer, and Luca Q. Zamboni, Palindromic richness, European J. Combin. 30\n(2009), no. 2, 510–531.\n14. Glen, Amy and Justin, Jacques, Episturmian words: a survey, Theoret. Inf. Appl. 43 (2009), no. 3, 403–442.\nDepartment of Mathematics, FNSPE, Czech Technical University in Prague, Trojanova 13, 120 00\nPraha 2, Czech Republic\nE-mail address: staroste@fjfi.cvut.cz\n\n\f"}