{"id": "http://arxiv.org/abs/1009.5163v1", "guidislink": true, "updated": "2010-09-27T05:40:50Z", "updated_parsed": [2010, 9, 27, 5, 40, 50, 0, 270, 0], "published": "2010-09-27T05:40:50Z", "published_parsed": [2010, 9, 27, 5, 40, 50, 0, 270, 0], "title": "Helicity of the solar magnetic field", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.5677%2C1009.0138%2C1009.1004%2C1009.0625%2C1009.2867%2C1009.1085%2C1009.2346%2C1009.5221%2C1009.1432%2C1009.1899%2C1009.3450%2C1009.1458%2C1009.2755%2C1009.1256%2C1009.3631%2C1009.4797%2C1009.0903%2C1009.3512%2C1009.5868%2C1009.3812%2C1009.1151%2C1009.4517%2C1009.3546%2C1009.1826%2C1009.5471%2C1009.5209%2C1009.4418%2C1009.3032%2C1009.2926%2C1009.5163%2C1009.5674%2C1009.4356%2C1009.0456%2C1009.5610%2C1009.2708%2C1009.5739%2C1009.1963%2C1009.4955%2C1009.5133%2C1009.0055%2C1009.0302%2C1009.3169%2C1009.0794%2C1009.0718%2C1009.5469%2C1009.2511%2C1009.2349%2C1009.5453%2C1009.0694%2C1009.3358%2C1009.2607%2C1009.4222%2C1009.2412%2C1009.5283%2C1009.1527%2C1009.3579%2C1009.5015%2C1009.3727%2C1009.1642%2C1009.4238%2C1009.2532%2C1009.1956%2C1009.1744%2C1009.1546%2C1009.1192%2C1009.0907%2C1009.4610%2C1009.3013%2C1009.4410%2C1009.4388%2C1009.1042%2C1009.5168%2C1009.3933%2C1009.1647%2C1009.5030%2C1009.3564%2C1009.3243%2C1009.5654%2C1009.0899%2C1009.1135%2C1009.3258%2C1009.2533%2C1009.3460%2C1009.2397%2C1009.2583%2C1009.2347%2C1009.2817%2C1009.0878%2C1009.2844%2C1009.1128%2C1009.2617%2C1009.2432%2C1009.3688%2C1009.1578%2C1009.4262%2C1009.1261%2C1009.5886%2C1009.2429%2C1009.1447%2C1009.6217%2C1009.5368&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Helicity of the solar magnetic field"}, "summary": "Helicity measures complexity in the field. Magnetic helicity is given by a\nvolume integral over the scalar product of magnetic field {\\bf B} and its\nvector potential {\\bf A}. A direct computation of magnetic helicity in the\nsolar atmosphere is not possible due to unavailability of the observations at\ndifferent heights and also due to non-uniqueness of {\\bf A}. The force-free\nparameter $\\alpha$ has been used as a proxy of magnetic helicity for a long\ntime. We have clarified the physical meaning of $\\alpha$ and its relationship\nwith the magnetic helicity. We have studied the effect of polarimetric noise on\nestimation of various magnetic parameters. Fine structures of sunspots in terms\nof vertical current ($J_z$) and $\\alpha$ have been examined. We have introduced\nthe concept of signed shear angle (SSA) for sunspots and established its\nimportance for non force-free fields. We find that there is no net current in\nsunspots even in presence of a significant twist, showing consistency with\ntheir fibril-bundle nature. The finding of existence of a lower limit of SASSA\nfor a given class of X-ray flare will be very useful for space weather\nforecasting. A good correlation is found between the sign of helicity in the\nsunspots and the chirality of the associated chromospheric and coronal\nfeatures. We find that a large number of sunspots observed in the declining\nphase of solar cycle 23 do not follow the hemispheric helicity rule whereas\nmost of the sunspots observed in the beginning of new solar cycle 24 do follow.\nThis indicates a long term behaviour of the hemispheric helicity patterns in\nthe Sun. The above sums up my PhD thesis.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1009.5677%2C1009.0138%2C1009.1004%2C1009.0625%2C1009.2867%2C1009.1085%2C1009.2346%2C1009.5221%2C1009.1432%2C1009.1899%2C1009.3450%2C1009.1458%2C1009.2755%2C1009.1256%2C1009.3631%2C1009.4797%2C1009.0903%2C1009.3512%2C1009.5868%2C1009.3812%2C1009.1151%2C1009.4517%2C1009.3546%2C1009.1826%2C1009.5471%2C1009.5209%2C1009.4418%2C1009.3032%2C1009.2926%2C1009.5163%2C1009.5674%2C1009.4356%2C1009.0456%2C1009.5610%2C1009.2708%2C1009.5739%2C1009.1963%2C1009.4955%2C1009.5133%2C1009.0055%2C1009.0302%2C1009.3169%2C1009.0794%2C1009.0718%2C1009.5469%2C1009.2511%2C1009.2349%2C1009.5453%2C1009.0694%2C1009.3358%2C1009.2607%2C1009.4222%2C1009.2412%2C1009.5283%2C1009.1527%2C1009.3579%2C1009.5015%2C1009.3727%2C1009.1642%2C1009.4238%2C1009.2532%2C1009.1956%2C1009.1744%2C1009.1546%2C1009.1192%2C1009.0907%2C1009.4610%2C1009.3013%2C1009.4410%2C1009.4388%2C1009.1042%2C1009.5168%2C1009.3933%2C1009.1647%2C1009.5030%2C1009.3564%2C1009.3243%2C1009.5654%2C1009.0899%2C1009.1135%2C1009.3258%2C1009.2533%2C1009.3460%2C1009.2397%2C1009.2583%2C1009.2347%2C1009.2817%2C1009.0878%2C1009.2844%2C1009.1128%2C1009.2617%2C1009.2432%2C1009.3688%2C1009.1578%2C1009.4262%2C1009.1261%2C1009.5886%2C1009.2429%2C1009.1447%2C1009.6217%2C1009.5368&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Helicity measures complexity in the field. Magnetic helicity is given by a\nvolume integral over the scalar product of magnetic field {\\bf B} and its\nvector potential {\\bf A}. A direct computation of magnetic helicity in the\nsolar atmosphere is not possible due to unavailability of the observations at\ndifferent heights and also due to non-uniqueness of {\\bf A}. The force-free\nparameter $\\alpha$ has been used as a proxy of magnetic helicity for a long\ntime. We have clarified the physical meaning of $\\alpha$ and its relationship\nwith the magnetic helicity. We have studied the effect of polarimetric noise on\nestimation of various magnetic parameters. Fine structures of sunspots in terms\nof vertical current ($J_z$) and $\\alpha$ have been examined. We have introduced\nthe concept of signed shear angle (SSA) for sunspots and established its\nimportance for non force-free fields. We find that there is no net current in\nsunspots even in presence of a significant twist, showing consistency with\ntheir fibril-bundle nature. The finding of existence of a lower limit of SASSA\nfor a given class of X-ray flare will be very useful for space weather\nforecasting. A good correlation is found between the sign of helicity in the\nsunspots and the chirality of the associated chromospheric and coronal\nfeatures. We find that a large number of sunspots observed in the declining\nphase of solar cycle 23 do not follow the hemispheric helicity rule whereas\nmost of the sunspots observed in the beginning of new solar cycle 24 do follow.\nThis indicates a long term behaviour of the hemispheric helicity patterns in\nthe Sun. The above sums up my PhD thesis."}, "authors": ["Sanjiv Kumar Tiwari"], "author_detail": {"name": "Sanjiv Kumar Tiwari"}, "author": "Sanjiv Kumar Tiwari", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1017/S1743921311014955", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1009.5163v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1009.5163v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "06 pages; To appear in the \"Physics of Sun and star spots\",\n  Proceedings of IAU Symposium 273, eds. D.P. Choudhary and K.G. Strassmeier", "arxiv_primary_category": {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1009.5163v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1009.5163v1", "journal_reference": null, "doi": "10.1017/S1743921311014955", "fulltext": "IAU-273, Physics of Sun and Star Spots\nProceedings IAU Symposium No. 273, 2011\nD. P. Choudhary & K. G. Strassmeier, eds.\n\nc 2011 International Astronomical Union\nDOI: 00.0000/X000000000000000X\n\nHelicity of the solar magnetic field\nSanjiv Kumar Tiwari\n\narXiv:1009.5163v1 [astro-ph.SR] 27 Sep 2010\n\nUdaipur Solar Observatory, Physical Research Laboratory, Dewali, Bari Road,\nUdaipur - 313 001, India.\nemail: stiwari@prl.res.in\nAbstract. Helicity measures complexity in the field. Magnetic helicity is given by a volume\nintegral over the scalar product of magnetic field B and its vector potential A. A direct computation of magnetic helicity in the solar atmosphere is not possible due to unavailability of the\nobservations at different heights and also due to non-uniqueness of A. The force-free parameter\nα has been used as a proxy of magnetic helicity for a long time. We have clarified the physical meaning of α and its relationship with the magnetic helicity. We have studied the effect of\npolarimetric noise on estimation of various magnetic parameters. Fine structures of sunspots in\nterms of vertical current (Jz ) and α have been examined. We have introduced the concept of\nsigned shear angle (SSA) for sunspots and established its importance for non force-free fields.\nWe find that there is no net current in sunspots even in presence of a significant twist, showing\nconsistency with their fibril-bundle nature. The finding of existence of a lower limit of SASSA\nfor a given class of X-ray flare will be very useful for space weather forecasting. A good correlation is found between the sign of helicity in the sunspots and the chirality of the associated\nchromospheric and coronal features. We find that a large number of sunspots observed in the\ndeclining phase of solar cycle 23 do not follow the hemispheric helicity rule whereas most of the\nsunspots observed in the beginning of new solar cycle 24 do follow. This indicates a long term\nbehaviour of the hemispheric helicity patterns in the Sun. The above sums up my PhD thesis.\nKeywords. Sun: atmosphere, Sun: magnetic fields, Sun: sunspots\n\n1. Introduction\nMagnetic helicity is a physical quantity that measures the degree of linkage and twistedness in the magnetic field lines (Moffatt 1978). It is given as\nZ\nHm = A * B dV\n(1.1)\nThe term magnetic helicity was introduced by Elsasser (1956) and many of its important\ncharacteristics were studied by Woltjer (1958); Taylor (1974); Berger & Field (1984) etc.\nThe handedness associated with the field is defined by 'chirality'. Helicity is closely\nrelated to chirality. If the twist on the surface is clockwise, the chirality is negative and\nthe field bears dextral chirality. The sunspot twist direction is decided by the curvature\nof sunspot whirls (Martin 1998; Tiwari 2009). If the twist is counterclockwise (when we\ngo from sunspot center towards outside), the chirality is sinistral and sign of helicity is\npositive. Reverse is true for the dextral chirality. These definitions of chirality have been\nused to study the hemispheric patterns of the active regions (Tiwari et al. 2008, 2010b).\nOne of the main motivations of the thesis (Tiwari 2009) was to use the helicity or related\nparameters to help in predicting the severity of the solar flares. If done so, this would\ncontribute in improving the space-weather forecasting. We have found the parameter\nsigned shear angle (SSA) to be very useful in this context (Tiwari et al. 2010a).\nSome of the important results of my Ph.D. thesis are summarized very briefly in the\nfollowing sections.\n1\n\n\f2\n\nSanjiv Kumar Tiwari\n\n2. Estimating magnetic parameters\nPhysical meaning of α. We arrive at the following depiction of α (for details, please\nsee Appendix A of Tiwari et al. (2009a)):\nα=2\n\ndφ\ndz\n\n(2.1)\n\nFrom Equation 2.1, it is clear that the α gives twice the degree of twist per unit axial\nlength. If we take one complete rotation of flux tube i.e., φ = 2π, and loop length λ ≈ 109\nmeters, then\n2 × 2π\nα=\n(2.2)\nλ\ncomes out to be of the order of 10−8 per meter.\nCorrelation between sign of Hm and that of α. Vector potential in terms of scalar potential φ can be expressed as (for details, please see Appendix B of Tiwari et al. (2009a))\nA = Bα−1 + ∇φ\n\n(2.3)\n\nwhich is valid only for constant α. Using this relation in Equation 1, we get magnetic\nhelicity as\nZ\nHm = (Bα−1 + ∇φ) * B dV\nZ\nZ\nZ\n= B 2 α−1 dV + (B * ∇)φ dV ∼ ( (φ B) * n dS)\n(2.4)\nshowing that the force free parameter α has the same sign as that of the magnetic helicity\niff n * B = 0 i.e., no field lines cross the boundary, which is not the case with the Sun.\nA direct method for calculating global α. We prefer to use the second moment of minimization (Tiwari et al. 2009a) leading to the following expression:\nP ∂By\nx\n)Bz\n( ∂x − ∂B\nP 2∂y\nαg =\n.\n(2.5)\nBz\n(2)\n\nThis formula gives a single global value of α in a sunspot and is the similar to αav of\nHagino & Sakurai (2004). We do not use direct mean (0th order moment) as it leads\nto singularities at neutral lines where Bz ∼ 0. First order moment will also lead to\nsingularities when flux is balanced.\nEstimating the effect of polarimetric noise in the measurement of field parameters. Using the analytical bipole method (Low 1982), non-potential force-free field components\nBx , By & Bz in a plane have been generated. We calculate the synthetic Stokes profiles\nfor each B, γ and ξ in a grid of 100 x 100 pixels, using the He-Line Information Extractor \"HELIX\" code (Lagg et al. 2004). We add random noise of 0.5 % of the continuum\nintensity Ic (Ichimoto et al. 2008) to the polarimetric profiles as observed in SOT/SP\naboard Hinode. In addition, we also study the effect of adding a noise of 2.0% level to\nStokes profiles as a worst case scenario. We add 100 realizations of the noise of the orders\nmentioned above to each pixel and invert the corresponding 100 noisy profiles using the\n\"HELIX\" code. The effect of polarimetric noise in the derivation of vector fields and\nother parameters such as αg and magnetic energy is found to be very small. We have\ndone similar investigations as a second step using real data (Gosain et al. 2010). As a\nthird step we plan to use MHD simulated data to check the inversion codes including the\neffect of optical depth corrugation.\n\n\fHelicity of the solar magnetic field\n\n3\n\n3. Global twist of sunspot magnetic fields\nIntroduction of signed shear angle (SSA). To emphasize the sign of shear angle we introduce the signed shear angle (SSA) for the sunspots as follows: choose an initial reference azimuth for a current-free field (obtained from the observed line of sight field).\nThen move to the observed field azimuth from the reference azimuth through an acute\nangle. If this rotation is counter-clockwise, then assign a positive sign for the SSA. A\nnegative sign is given for clockwise rotation. This sign convention will be consistent with\nthe sense of azimuthal field produced by a vertical current. This sign convention is also\nconsistent with the sense of chirality (Tiwari et al. 2009b). The SSA is computed from\nthe following formula (Tiwari et al. 2010a):\nSSA = tan−1 (\n\nByo Bxp − Byp Bxo\n)\nBxo Bxp + Byo Byp\n\n(3.1)\n\nwhere Bxo , Byo and Bxp , Byp are observed and potential transverse components of sunspot\nmagnetic fields respectively. A spatial average of the SSA (SASSA) gives the global twist\nof sunspot magnetic fields at observed height irrespective of the force-free nature of the\nfield and shape of sunspots (Venkatakrishnan & Tiwari 2009).\nFine structures in terms of Jz and α. Local Jz and α patches of opposite signs are\npresent in the umbra of each sunspot. The amplitude of the spatial variation of local\nα in the umbra is typically of the order of the global α of the sunspot. We find that\nthe local α is distributed as alternately positive and negative filaments in the penumbra.\nThe amplitude of azimuthal variation of the local α in the penumbra is approximately\nan order of magnitude larger than that in the umbra. The contributions of the local\npositive and negative currents and α in the penumbra cancel each other giving almost\nno contribution for their global values for whole sunspot. The data sets used in the\nanalysis are taken from ASP/DLSP and Hinode (SOT/SP). See for details: Tiwari et al.\n(2009b). Most of the data sets we studied are observed during the declining minimum\nphase of solar cycle 23. All except 5, out of 43 sunspots observed, follow the reverse twist\nhemispheric rule, while 5 follow the conventional helicity rule. Also, αg has same sign as\nthe SASSA and therefore the same sign of the photospheric chirality of the sunspots, but\nthe magnitudes of SASSA and αg are not well correlated. This lack of correlation could\nbe due to a variety of reasons: (a) departure from the force-free nature (b) even for the\nforce-free fields, α is the gradient of twist variation whereas SASSA is purely an angle.\nThe missing link is the scale length of variation of twist.\n\n4. Net current in sunspots\nExpression for net current. We consider a long straight flux bundle surrounded by a\nregion of \"field free\" plasma following Parker (1996). Parker (1996) assumed azimuthal\nsymmetry as well as zero radial component Br , of the magnetic field. For realistic sunspot\nfields, we have already seen the ubiquitous fine structure of the radial magnetic field.\nHence, we need to relax both these assumptions.\nThe vertical component of the electric current density consists of two terms, viz.\n∂(rB )\nr\n− μ10 r ∂B\nand μ10 r ∂r ψ . We will call the first term as the \"pleat current density\",\n∂ψ\njp and the second term as the \"twist current density\", jt . The total current Iz within a\ndistance ̟ from the center is then given by\nZ 2π\nZ ̟\nIz (̟) =\ndψ\nrdr(jp + jt )\n(4.1)\n0\n\n0\n\n\f4\n\nSanjiv Kumar Tiwari\n\nThe ψ integral over jp vanishes, while the second term yields\nZ\n̟ 2π\nIz (̟) =\ndψBψ (̟, ψ)\nμ0 0\n\n(4.2)\n\nwhich gives the net currents within a circular region of radius ̟. The transverse vector\ncan be expressed in cylindrical geometry as\nBr =\n\n1\n(xBx + yBy )\nr\n\n(4.3)\n\n1\n(−yBx + xBy )\n(4.4)\nr\nThe azimuthal field Bψ is then used in Equation 4.2 for obtaining the value for the total\nvertical current within a radius ̟.\nNo net current: an evidence for fibril bundle nature of sunspot magnetic field? As expected from the trend in Figure 3 of Venkatakrishnan & Tiwari (2009), the net current\nshows evidence for a rapid decline after reaching a maximum. Similar trends were seen\nin other sunspots. This can be interpreted as evidence for the neutralization of the net\ncurrent. Table 1 of Venkatakrishnan & Tiwari (2009) shows the summary of results for\nall the sunspots analyzed. Along with the power law index δ of Bψ decrease, we have\nalso shown the average deviation of the azimuth from the radial direction (\"twist angle = tan−1 (Bψ /Br )\"), as well as the SASSA. The average deviation of the azimuth is\nwell correlated with the SASSA for nearly circular sunspots, but is not correlated with\nSASSA for more irregularly shaped sunspots. Thus, SASSA is a more general measure\nof the global twist of sunspots, irrespective of their shape.\nAs is well known for astrophysical plasmas, that the plasma distorts the magnetic field\nand the curl of this distorted field produces a current by Ampere's law (Parker 1979).\nParker's (1996) expectation of net zero current in a sunspot was basically motivated by\nthe concept of a fibril structure for the sunspot field. However, he also did not rule out the\npossibility of vanishing net current for a monolithic field where the azimuthal component\nof the vector field in a cylindrical geometry declines faster than 1/̟. While it is difficult\nto detect fibrils using the Zeeman effect, notwithstanding the superior resolution of SOT\non Hinode, the stability and accuracy of the measurements have allowed us to detect the\nfaster than 1/̟ decline of the azimuthal component of the magnetic field, which in turn\ncan be construed as evidence for the confinement of the sunspot field by the external\nplasma. The resulting pattern of curl B appears as a sharp decline in the net current\nat the sunspot boundary. Although the existence of a global twist in the absence of a\nnet current is possible for a monolithic sunspot field (Baty 2000), a fibril model of the\nsunspot field can accommodate a global twist even without a net current (Parker 1996).\nA sunspot, made up of a bundle of magnetically isolated current free fibrils, can be given\nan overall torsion without inducing a global current. For details and more discussions\nplease see Venkatakrishnan & Tiwari (2009); Tiwari (2009, 2010).\nBψ =\n\n5. Relationship between the SASSA of active regions and associated\nGOES X-ray flux\nWe find an upper limit of peak X-ray flux for a given value of SASSA can be given for\ndifferent classes of X-ray flares. Figures 5(a) and 5(b) of Tiwari et al. (2010a) represent\nscatter plots between the peak GOES X-ray flux and interpolated SASSA and mean\nweighted shear angle (MWSA: Wang (1992)) values for that time, respectively. The cubic\nspline interpolation of the sample of the SASSA and the MWSA values has been done\n\n\fHelicity of the solar magnetic field\n\n5\n\nto get the SASSA and MWSA exactly at the time of peak flux of the X-ray flare. For\ndetails kindly see Tiwari et al. (2010a). We find that the SASSA, apart from its helicity\nsign related studies, can also be used to predict the severity of the solar flares. However\nto establish these lower limits of SASSA for different classes of X-ray flares, we need\nmore cases to study. The SASSA already gives a good indication of its utility from the\npresent four case studies using 115 vector magnetograms from Hinode (SOT/SP). Once\nthe vector magnetograms are routinely available with higher cadence, the lower limit of\nSASSA for each class of X-ray flare can be established by calculating the SASSA in a\nseries of vector magnetograms. This will provide the inputs to space weather models.\nAlso, SASSA has shown a good correlation with the free magnetic energy computed by\nJing et al. (2010).\nThe other non-potentiality parameter MWSA studied in Tiwari et al. (2010a) does\nshow a similar trend as that of the SASSA. The magnitudes of MWSA, however, do not\nshow consistent threshold values as related with the peak GOES X-ray flux of different\nclasses of solar flares. One possible reason for this behavior may be explained as follows:\nThe MWSA weights the strong transverse fields e.g., penumbral fields. From the recent\nstudies (Su et al. 2009; Tiwari et al. 2009b; Tiwari 2009; Venkatakrishnan & Tiwari 2009,\n2010) it is clear that the penumbral field contains complicated structures with opposite\nsigns of vertical current and vertical component of the magnetic tension forces. Although\nthe amplitudes of the magnetic parameters are found high in the penumbra, they do\nnot contribute to their global values because they contain opposite signs, which cancel\nout in the averaging process (Tiwari 2009; Tiwari et al. 2009b). On the other hand, the\nMWSA adds those high values of shear and produces a pedestal that might mask any\nthe relation between the more relevant global non-potentiality and the peak X-ray flux.\nWhereas the SASSA perhaps gives more relevant value of the shear after cancelation of\nthe penumbral contribution.\n\n6. Solar cycle dependence\nHelicity hemispheric rule. We compare the behaviour of magnetic helicity sign of AR's\nobserved in the beginning of 24th solar cycle with some AR's observed in the declining\nphase of 23rd solar cycle. We find that the majority of active regions in the beginning\nof solar cycle 24 do follow the hemispheric helicity rule whereas those observed in the\ndeclining phase of solar cycle 23 do not (Tiwari, 2009; Tiwari et al., 2010c, in prep.).\nSign of magnetic helicity at different heights in the solar atmosphere. A good correlation has been found among the sign of helicity in the associated features observed at\nphotospheric, chromospheric and coronal heights without solar cycle dependence (Tiwari\net al. 2008; Tiwari, 2009; Tiwari et al. 2010b; Tiwari et al., 2010c, in prep.).\n\n7. Conclusions\nThe magnetic field parameters can be derived very accurately using the recent data\navailable (e.g., from Hinode (SOT/SP)) and advanced inversion codes. The SASSA is\nthe best measure of the global magnetic twist of sunspot magnetic fields at observed\nheight, irrespective of the force-free nature and the shape of sunspots. The sunspots with\nsignificant twist and no net currents show consistency with the fibril bundle nature of\nthe sunspots. The study of evolution of SASSA of sunspots showed threshold values for\ndifferent classes of X-ray flares. This is an important discovery which was being sought\nafter for many decades. The magnetic helicity sign of active regions studied, has good\ncorrelation with the sign of chirality of associated features observed at chromospheric\n\n\f6\n\nSanjiv Kumar Tiwari\n\nand coronal heights. The majority of sunspots observed in the declining phase of solar\ncycle 23 follow a reverse hemispheric helicity rule, whereas most of the AR's emerged in\nthe beginning of solar cycle 24 follow the conventional helicity rule. This result indicates\nthat revisiting the hemispheric helicity rule using data sets of several years is required.\nAcknowledgements\nThe presentation of this paper in the IAU Symposium 273 was possible due to partial support from the National Science Foundation grant numbers ATM 0548260, AST\n0968672 and NASA - Living With a Star grant number 09-LWSTRT09-0039. I am grateful to Professor P. Venkatakrishnan for his invaluable and patient guidance during my\nPhD thesis. Hinode is a Japanese mission developed and launched by ISAS/JAXA, with\nNAOJ as domestic partner and NASA and STFC (UK) as international partners. It is\noperated by these agencies in co-operation with ESA and NSC (Norway).\nReferences\nBaty, H. 2000, A&A, 360, 345\nBerger, M. A., & Field, G. B. 1984, Journal of Fluid Mechanics, 147, 133\nElsasser, W. M. 1956, Rev. Mod. Phys., 28, 135\nFan, Y., & Gibson, S. E. 2004, ApJ, 609, 1123\nGosain, S., Tiwari, S. K., & Venkatakrishnan, P. 2010, ApJ, 720, 1281\nHagino, M., & Sakurai, T. 2004, PASJ, 56, 831\nIchimoto, K., et al. 2008, Solar Phys., 249, 233\nJing, J., Tan, C., Yuan, Y., Wang, B., Wiegelmann, T., Xu, Y., & Wang, H. 2010, ApJ, 713,\n440\nLagg, A., Woch, J., Krupp, N., & Solanki, S. K. 2004, A&A, 414, 1109\nLow, B. C. 1982, Solar Phys., 77, 43\nMartin, S. F. 1998, in Astronomical Society of the Pacific Conference Series, Vol. 150, IAU\nColloq. 167: New Perspectives on Solar Prominences, ed. D. F. Webb, B. Schmieder, &\nD. M. Rust, 419\nMoffatt, H. K. 1978, Magnetic field generation in electrically conducting fluids, ed. H. K. Moffatt\nParker, E. N. 1979, Cosmical magnetic fields: Their origin and their activity (Oxford, Clarendon\nPress; New York, Oxford University Press, 1979)\nParker, E. N. 1996, ApJ, 471, 485\nSu, J. T., Sakurai, T., Suematsu, Y., Hagino, M., & Liu, Y. 2009, ApJ, 697, L103\nTaylor, J. B. 1974, Physical Review Letters, 33, 1139\nTiwari, S. K. 2009, Ph.D. thesis, Udaipur Solar Observatory/Physical Research Laboratory,\nMohanlal Sukhadia University, Udaipur\nTiwari, S. K. 2010, Helicity of the Solar Magnetic Field: An application to predicting the severity\nof solar flares (Lambert Academic Publishing, 2010, ISBN: 978-3-8383-9771-9)\nTiwari, S. K., Joshi, J., Gosain, S., & Venkatakrishnan, P. 2008, in Turbulence, Dynamos, Accretion Disks, Pulsars and Collective Plasma Processes, ed. S. S. Hasan, R. T. Gangadhara,\n& V. Krishan, Astrophysics and Space Science Proceedings, 329\nTiwari, S. K., Venkatakrishnan, P., & Gosain, S. 2010a, ApJ, 721, 622\nTiwari, S. K., Venkatakrishnan, P., Gosain, S., & Joshi, J. 2009a, ApJ, 700, 199\nTiwari, S. K., Venkatakrishnan, P., & Sankarasubramanian, K. 2009b, ApJ, 702, L133\nTiwari, S. K., Venkatakrishnan, P., & Sankarasubramanian, K. 2010b, in Magnetic Coupling\nbetween the Interior and Atmosphere of the Sun, ed. by S.S. Hasan and R.J. Rutten;\nAstrophysics and Space Science Proceedings. Published by Springer Berlin Heidelberg; ISBN\n978-3-642-02858-8 (Print) 978-3-642-02859-5 (Online), pp.443-447\nVenkatakrishnan, P., & Tiwari, S. K. 2009, ApJ, 706, L114\nVenkatakrishnan, P., & Tiwari, S. K. 2010, A&A, 516, L5\nWang, H. 1992, Solar Phys., 140, 85\nWoltjer, L. 1958, ApJ, 128, 384\n\n\f"}