{"id": "http://arxiv.org/abs/1101.0354v1", "guidislink": true, "updated": "2011-01-01T17:23:30Z", "updated_parsed": [2011, 1, 1, 17, 23, 30, 5, 1, 0], "published": "2011-01-01T17:23:30Z", "published_parsed": [2011, 1, 1, 17, 23, 30, 5, 1, 0], "title": "Quantum nondemolition measurements of a flux qubit coupled to a noisy\n  detector", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.0580%2C1101.3620%2C1101.3847%2C1101.3624%2C1101.3712%2C1101.5740%2C1101.1760%2C1101.1888%2C1101.1172%2C1101.5113%2C1101.4432%2C1101.0361%2C1101.5039%2C1101.4257%2C1101.1493%2C1101.0552%2C1101.0186%2C1101.2009%2C1101.3026%2C1101.0604%2C1101.0253%2C1101.1124%2C1101.5885%2C1101.2687%2C1101.2478%2C1101.1184%2C1101.0354%2C1101.3482%2C1101.2903%2C1101.0805%2C1101.4667%2C1101.5300%2C1101.3305%2C1101.0738%2C1101.3806%2C1101.5607%2C1101.2794%2C1101.1098%2C1101.2075%2C1101.0812%2C1101.4911%2C1101.1066%2C1101.0478%2C1101.4658%2C1101.3778%2C1101.0797%2C1101.3293%2C1101.4833%2C1101.5295%2C1101.3060%2C1101.0356%2C1101.2705%2C1101.6012%2C1101.4804%2C1101.3964%2C1101.1748%2C1101.3621%2C1101.0776%2C1101.3270%2C1101.2914%2C1101.5749%2C1101.5504%2C1101.2686%2C1101.0189%2C1101.6013%2C1101.5930%2C1101.3739%2C1101.6007%2C1101.4612%2C1101.4138%2C1101.4757%2C1101.2952%2C1101.3044%2C1101.5662%2C1101.5207%2C1101.2799%2C1101.2456%2C1101.2760%2C1101.3535%2C1101.0976%2C1101.2208%2C1101.3705%2C1101.4861%2C1101.2556%2C1101.2765%2C1101.2932%2C1101.5906%2C1101.2131%2C1101.3498%2C1101.4649%2C1101.5246%2C1101.1084%2C1101.5174%2C1101.4845%2C1101.0310%2C1101.3973%2C1101.1027%2C1101.0801%2C1101.2936%2C1101.1393%2C1101.4142&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quantum nondemolition measurements of a flux qubit coupled to a noisy\n  detector"}, "summary": "We theoretically study the measurement-induced dephasing caused by back\naction noise in quantum nondemolition measurements of a superconducting flux\nqubit which is coupled to a superconducting quantum interference device\n(SQUID). Our analytical results indicate that information on qubit flows from\nqubit to detector, while quantum fluctuations which may cause dephasing of the\nqubit also inject to qubit. Furthermore, the measurement probability is\nfrequency dependent in a short time scale and has a close relationship with the\nmeasurement-induced dephasing. When the detuning between driven and bare\nresonator equals coupling strength, we will access the state of qubit more\neasily. In other words, we obtain the maximum measurement rate. Finally, we\nanalyzed mixed effect caused by coupling between non-diagonal term and external\nvariable. We found that the initial information of qubit is destroyed due to\nquantum tunneling between the qubit states.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.0580%2C1101.3620%2C1101.3847%2C1101.3624%2C1101.3712%2C1101.5740%2C1101.1760%2C1101.1888%2C1101.1172%2C1101.5113%2C1101.4432%2C1101.0361%2C1101.5039%2C1101.4257%2C1101.1493%2C1101.0552%2C1101.0186%2C1101.2009%2C1101.3026%2C1101.0604%2C1101.0253%2C1101.1124%2C1101.5885%2C1101.2687%2C1101.2478%2C1101.1184%2C1101.0354%2C1101.3482%2C1101.2903%2C1101.0805%2C1101.4667%2C1101.5300%2C1101.3305%2C1101.0738%2C1101.3806%2C1101.5607%2C1101.2794%2C1101.1098%2C1101.2075%2C1101.0812%2C1101.4911%2C1101.1066%2C1101.0478%2C1101.4658%2C1101.3778%2C1101.0797%2C1101.3293%2C1101.4833%2C1101.5295%2C1101.3060%2C1101.0356%2C1101.2705%2C1101.6012%2C1101.4804%2C1101.3964%2C1101.1748%2C1101.3621%2C1101.0776%2C1101.3270%2C1101.2914%2C1101.5749%2C1101.5504%2C1101.2686%2C1101.0189%2C1101.6013%2C1101.5930%2C1101.3739%2C1101.6007%2C1101.4612%2C1101.4138%2C1101.4757%2C1101.2952%2C1101.3044%2C1101.5662%2C1101.5207%2C1101.2799%2C1101.2456%2C1101.2760%2C1101.3535%2C1101.0976%2C1101.2208%2C1101.3705%2C1101.4861%2C1101.2556%2C1101.2765%2C1101.2932%2C1101.5906%2C1101.2131%2C1101.3498%2C1101.4649%2C1101.5246%2C1101.1084%2C1101.5174%2C1101.4845%2C1101.0310%2C1101.3973%2C1101.1027%2C1101.0801%2C1101.2936%2C1101.1393%2C1101.4142&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We theoretically study the measurement-induced dephasing caused by back\naction noise in quantum nondemolition measurements of a superconducting flux\nqubit which is coupled to a superconducting quantum interference device\n(SQUID). Our analytical results indicate that information on qubit flows from\nqubit to detector, while quantum fluctuations which may cause dephasing of the\nqubit also inject to qubit. Furthermore, the measurement probability is\nfrequency dependent in a short time scale and has a close relationship with the\nmeasurement-induced dephasing. When the detuning between driven and bare\nresonator equals coupling strength, we will access the state of qubit more\neasily. In other words, we obtain the maximum measurement rate. Finally, we\nanalyzed mixed effect caused by coupling between non-diagonal term and external\nvariable. We found that the initial information of qubit is destroyed due to\nquantum tunneling between the qubit states."}, "authors": ["Wei Jiang", "Yang Yu", "Lianfu Wei"], "author_detail": {"name": "Lianfu Wei"}, "author": "Lianfu Wei", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1674-1056/20/8/080307", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1101.0354v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1101.0354v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "6 pages, 3 figures", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1101.0354v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1101.0354v1", "journal_reference": null, "doi": "10.1088/1674-1056/20/8/080307", "fulltext": "Quantum nondemolition measurements of a flux qubit coupled to a noisy detector\nWei Jiang,1 Yang Yu,1, 2, ∗ and Lianfu Wei2, †\n\narXiv:1101.0354v1 [quant-ph] 1 Jan 2011\n\n1\n\nNational Laboratory of Solid State Microstructures and Department of Physics, Nanjing University, Nanjing 210093, China\n2\nLab. of Quantum Opt-electronics, Southwest Jiaotong University, Chengdu 610031, China\nWe theoretically study the measurement-induced dephasing caused by back action noise in quantum nondemolition measurements of a superconducting flux qubit which is coupled to a superconducting quantum interference device (SQUID). Our analytical results indicate that information on qubit flows from qubit to detector, while quantum fluctuations which may cause dephasing of the qubit also inject to qubit. Furthermore,\nthe measurement probability is frequency dependent in a short time scale and has a close relationship with\nthe measurement-induced dephasing. When the detuning between driven and bare resonator equals coupling\nstrength, we will access the state of qubit more easily. In other words, we obtain the maximum measurement\nrate. Finally, we analyzed mixed effect caused by coupling between non-diagonal term and external variable.\nWe found that the initial information of qubit is destroyed due to quantum tunneling between the qubit states.\nPACS numbers: 03.65.Ta, 03.67.Lx, 42.50.Lc, 85.25.Dq\n\nI.\n\nINTRODUCTION\n\nThe concept of quantum nondemolition (QND) measurement which can be used for detection of weak force acting\non system such as gravitational wave had been introduced to\nallow repeatable detection.1 The basic requirement of a QND\nmeasurement is that a series of measurements of the variable\nof system should give predictable results.2 It means that the\nobservable Â must commute with Hamiltonian Ĥ that describes interacting system and detector, i.e., [Â, Ĥ] = 0. A\nlarge number of works associated with QND measurements\nhave been done in quantum optic,3–5 cavity QED6,7 and circuit QED.8\nRecently, QND measurements have experimentally been\nachieved on superconducting flux qubit system by investigating the correlation between the results of two consecutive\nmeasurements.9 However, in general , the measuring apparatus is a mesoscopic system (e.g., dc-SQUID) which is coupled\nto environment. Therefore, noise can affect discrimination of\nsignal which reflects the information of qubit via coupling between meter and qubit (see Fig. 1(b)). There exist a larger\nnumber of works in mesoscopic system where one is forced to\nthink about the quantum mechanics of detection process,11,12\nand about the fundamental quantum limits which constrain the\nperformance of the detector.13,15 In practice, noise plays an\nimportant role in quantum measurement: quantum noise from\nthe meter acts back on the system, such as qubit, at the same\ntime, the information about the variable conjugate to the measured variable is destroyed. This phenomenon is omnipresent,\nbecause information about system is carried away into the surrounding due to indirect environmental coupling via coupling\nto detector.14 For a weak measurement, the detection may be\nquantum limited that the signal-to-noise of measurement, defined as the ratio of the amplitude of the oscillation line in the\noutput spectrum to background noise, is no more than 4.15\nIn this article, we study the correlation between measurement probability and measurement-induced dephasing. Our\nmodel which is used to analyze the interaction between qubit\nand detector is based on the theory of QND measurement of\nflux qubit dynamics in a short time.16 The conclusion shows\n\nthat the easier we gain information about one variable, the\nfaster we lose information about its conjugate variable. It\nmeans that the dc-SQUID can be used as a quantum-limited\nmesoscopic detector.17 We also study the deviation of QND\nmeasurement due to the coupling between non-diagonal term\nof qubit and variable of detector. This article is organized as\nfollows. In Sec. II the basic models were introduced firstly,\nfrom which we use master equation to discuss the dephasing\ncaused by quantum noise and its correlation with measurement probability distribution. In Sec. III, we discuss the effect of non-diagnose term on QND measurement. We show\nthat the mix effect caused by coupling between non-diagnose\nterm and detector can demolish the information of qubit.\n\nII. PROBABILITY DISTRIBUTION AND\nMEASUREMENT-INDUCED DEPHASING\n\nThe Hamiltonian of system is given by16\nĤ(t) = Ĥs + Ĥmeter + Ĥint + Ĥdrive (t),\n\n(1)\n\nwhere Ĥs is the Hamiltonian of qubit which can be considered\nas a two level system\nĤs =\n\nǫ\n∆\nσ̂z + σ̂x ,\n2\n2\n\n(2)\n\nwhere σ̂z and σ̂x are Pauli matrices, ǫ and ∆ are energy difference and tunnel splitting of qubit. The Hamiltonian of detector which acts as an oscillator is\nĤmeter = ~ωos â† â.\n\n(3)\n\nThe Hamiltonian that describes coupling between qubit and\noscillator is\nĤint = ~gσ̂z â† â,\n\n(4)\n\nfrom which we know that the variable that we want to measure\nis σ̂z . g is coupling strength. In other words, we can conclude\nthe state of qubit from the states of detector according to the\n\n\f2\n\nFIG. 1: (a) Schematic of flux qubit coupled to a SQUID which used\nfor qubit readout as a detector. (b) Schematic of the process of information detraction from qubit and noise injection from one-port\ndetector.\n\nvalue of σ̂z . We assign |0i to σz = 1 and |1i to σz = −1. The\nHamiltonian of external driving of harmonic oscillator is\nĤdrive (t) = f (t)(â + â† ),\n\n(5)\n\nwhere f (t) = 2f cos(ωd t) is the driving force with driving\nfrequency ωd . For an ideal QND measurement, it is necessary\nthat the condition [σ̂z , Ĥ] = 0 must be satisfied. However,\nfor superconducting flux qubits, due to the off-diagonal term\n∆ 6= 0, the measurement is not perfect QND. In case that\n∆ ≪ ǫ is satisfied, σ̂z still would be treated as a conserved\nquantity on the time scale determined by 1/ǫ and one expects\nsmall deviations from an ideal QND case16 . After neglecting\nthe off-diagonal term and moving in the rotating frame with\nfrequency ωd , we obtain the new Hamiltonian\nǫ\nĤ = σ̂z + ~(δω + gσ̂z )â† â + f (â + â† )\n(6)\n2\nwith δω = ωos − ωd . Then we can get a QND measurement\nfrom the form of the Hamiltonian. In order to find the relationship between measurement-induced dephasing and probability distribution, we analyze the impact of noise on QND\nmeasurement in part A and make a more quantitative analysis\nin part B.\n\nFIG. 2: (color online) (a) Probability distribution considering zero\npoint fluctuation for getting the measurement result for 0 and the\ninitial state |0ih0|, plotted as a function of detuning δω. (b) Probability distribution considering the back action noise instead of zero\npoint fluctuation with the same parameter. The damping rate of resonator κ = 0.1GHz, the couple strength between qubit and oscillator\ng = 0.3GHz and the back action noise spectra density SII = 2/κ.\n\nφi = arctan (\n\nBased on the model mentioned by Ref. [16], we substitute\na Gaussian white noise for the zero point fluctuation because\nof the fact that noise contributes a large part in the actual measurement. The distribution of qubit signal I conditioned on\nthe qubit state σz = ±1 is\n\n−(x − xi )\n1\nexp[\n],\n(7)\np(I|σ̂z ) = √\n2SII t\n2πSII t\n√\nwhere xi (t) = 2Re[αi (t)], i = ±, SII is noise spectra density. After turning on the interaction with time t, the coherent\nstate qubit-dependent amplitude is found to be16\nαi (t) = Ai eiφi [1 − e−iδωi t−κt/2 ]\n\nP (I, t) =\n\nδx(t)\n1\n[1 + I erf( √\n)hσ̂z i0 ].\n2\n2SII t\n\n(12)\n\n1\n|A|t\n)].\n[1 + Ihσ̂z i0 erf( √\n2\n2SII t\n\n(13)\n\n√\nIf we measure a rotated quadrature X̂φ = (ae−iφ +a† eiφ )/ 2\nand choose the phase φ = arg A. The qubit difference becomes δx(t) = |A|t, and the probability for the measurement\nis\n\nIn Fig. 2 we plot the probability of measuring the 0 state\nunder the condition that we consider the contribution of zero\npoint fluctuation (Fig. 2 (a)). We also plot the probability of\nmeasuring the 0 state under the condition that we consider the\ncontribution of back action noise instead of the zero point fluctuation during the measurement process (Fig. 2 (b)). Due to\nthe influence of back action noise, we can find that the strong\nmeasurement region, compared with the one that only considered the zero point fluctuation, is reduced. It means that we\nneed more time to reach the same measurement strength as the\nsituation that we only consider contribution of the zero point\nfluctuation.\n\n(8)\n\nwith qubit-dependent detuning δωi = δω − gσz and the qubitdependent amplitudes and phase given by\nf\nAi = p\n(δωi )2 + κ2 /4\n\n(10)\n\nIf we choose a time t ∼ 1/ǫ, then the signal difference\nbecomes16\n√\nδα(t) ≈ 2tA,\n(11)\n√\nwhere A = f (e2iφ0 − e2iφ1 )/ 2. We obtain the outcome\nprobability distribution\n\nP (I, t) =\nA. THE IMPACT OF NOISE ON QND MEASUREMENT\n\nδωi\nπ\n)− .\nκ/2\n2\n\n(9)\n\nB. CORRELATION BETWEEN MEASUREMENT\nPROBABILITY AND DEPHASING RATE\n\nWe choose the initial state of system to be ρ(0) = ρ0 ⊗\n|0ih0|, i.e., at time t = 0 the harmonic oscillator in the vac-\n\n\f3\nuum state. Then, we turn on qubit and oscillator interaction,\nafter a period of time, qubit and oscillator entangle with each\nother. At the same time, we perform a strong measurement\nof the flux quadrature x̂ = â + â† . As a result, the pointer\nstate (the oscillator state) is projected to the state |xihx|. If\nthe measurement is strong enough that the states of oscillator\n|x± ihx± | which correspond to the qubit states |0i and |1i respectively are orthogonal, the coherence of qubit is destroyed\nby the measurement. To describe this phenomenon, we must\nfind out the equation of motion that can describes the system\nstate evolution. The master equation used in circuit QED system is valid here.10 The qubit density matrix obeys:\ni\nγ2\nρ̇ = Lρ = − [Ĥ, ρ] + κD[â]ρ + γ1 D[σ̂− ]ρ + D[σ̂z ]ρ,\n~\n2\n(14)\nwhere D[L̂] is damping superoperator defined by D[L̂] =\n(2L̂ρLˆ† − Lˆ† L̂ρ − ρLˆ† L̂)/2. In above expression, κ is decay rate of resonator, γ1 is qubit relaxation rate and γ2 is dephasing rate. To figure out the effect induced by measurement due to coupling of qubit to the oscillator, we do not consider the coupling between qubit and environment. Therefore,\nwe neglect relaxation due to coupled to environment and set\nγ1 = 0, (i.e., for an ideal QND measurement no quantum\ntunneling occurs between qubit states|0i and |1i during measurement). Eq. (14) can be solved under the condition that the\ndensity matrix with an expansion in positive P representation.\nIn Ref. [10] the solution of the master equation was found to\nbe\nZ t\na10 (t) = a10 (0)exp[−i(ǫ − iγ2 )t − i2g\nα+ (t)α∗− (t)dt′ ]\n0\n\n(15)\nand a01 (t) = a∗10 (t). The amplitude of coherence state α± (t)\nare determined by\nα+ (t) = αs+ + exp[−(κ/2 + ig + iδω)t](α+ (0) − αs+ ) (16)\nwith αs+ = −if /(iκ/2 + ig + δω), and\nα− (t) =\n\nαs− + exp[−(κ/2 − ig + iδω)t](α− (0) − αs− )\n\n(17)\n\nwith αs− = −if /(k/2 − ig + iδω), where αs± is the steady\ncoherence state value of the oscillator, α+ and α− are amplitudes of coherent state |α+ i and |α− i, which depends on\nqubit states, a01 is the coherence term.\nWe can find that γ2 is the intrinsic dephasing rate from\nEq. (15) and Γm is the measurement-induced dephasing rate\nwhich is determined by αs± for a project measurement and expressed as following10\nΓm = 2gIm(αs+ αs− ) =\n|αs± |2\n\n2\n\n(n+ + n− )κg 2\n,\nκ2 /4 + g 2 + δω 2\n2\n\n2\n\n(18)\n\nwhere n± =\n= f /[κ /4 + (δω ± g) ] is average number\nof\nphotons\nin the resonator. We find that for\np\nδω = ± g 2 + κ2 /4 we will get a large probability if measure the amplitude of the signal. In other words, when matching one of the frequencies of qubit (i.e., δω = ±g), the information of qubit is encoded in the amplitude rather than\n\nphase which is the conjugate variable with amplitude. At the\nsame time, the measurement-induced dephasing rate will get\nthe maximum value. In Fig. 3, we plot the probability distribution that measuring 0 state conditioned on initial state\nis prepared on |0ih0| and measurement-induced dephasing as\na function of detuning. When matching one of qubit frequency, both measurement-induced dephasing rate and measurement probability get a maximum value. In the region\nwhere erf(|A|t) ≈ 1, it corresponds to a strong projective\nmeasurement case. At the same time, the two coherent states\nof oscillator are well separated in phase space due to decay of\ncoherence term at a measurement-induce dephaing rate Γm .\nIn general case, at time t = 0, the system is in a product state\n|ψ(t = 0)i =\n\n1\n(|0i + |1i) ⊗ |αi,\n2\n\n(19)\n\nwhere |αi is the initial state of oscillator. At time t, the state\nof system can be written as\n|ψ(t)i =\n\n1\n(|0i|α+ i + |1i|α− i).\n2\n\n(20)\n\nThen, if we know oscillator state is αi , the qubit state\ncan be determined exactly. From Eq. (18) we find that the\nmeasurement-induced dephasing depends on the overlap of\nboth two oscillator state α± 18 . In case that the oscillator states\n|α− i and |α+ i are orthogonal, the measurement could be considered as a strong projective measurement, i.e., in the region\nerf(|A|t) = 1. For the maximum dephasing value, the oscillator states decay to a steady state significantly, which explains the feature of Fig. 3 that both measurement-induced dephasing rate and measurement probability get a high value for\nmatching the qubit frequency. In this situation, the qubit state\nis encoded in the amplitude of coherence rather than phase.\nIt means that the easier we gain information about amplitude,\nthe faster we lose information about phase. The measurementinduced dephasing rate can also be expressed as\n|hα− (t)|α+ (t)i| = e−Γm t .\n\n(21)\n\nIn addition, as shown in Fig. 3, with the value of damping\nrate κ increasing, both structures of probability distribution\nand measurement-induced dephasing rate become flat with\nsynchronous tendency, which consistent with the expectation.\nIncreasing of driving force f only change the overall scale of\n(e)∼(h) rather than the structure, which explains the trend that\nwith the value of driving force increasing, the strong measurement region in (a)∼(h) becomes wider and the measurement\nprobability increases significantly, especially for matching the\nqubit frequency.\nIII. DEVIATION OF A PERFECT QND MEASUREMENT\nDUE TO MEASUREMENT-INDUCED TUNNELING\n\nTaking into account the impact of non-diagonal term of\nqubit, we obtain the system Hamiltonian\nĤs =\n\nǫ\n∆\nσ̂z + σ̂x .\n2\n2\n\n(22)\n\n\f4\n\nFIG. 3: (color online) (a)∼(d) Probability of measuring 0 state for the initial state |0ih0| with damping rate of oscillator κ = 0.1 GHz,\nκ = 0.2 GHz, κ = 0.3GHz, κ = 0.4GHz, respectively, and qubit coupling strength g = 0.3GHz, t = 0.1ns, noise spectra density\nSII = 2/κ. (e)∼(h) measurement-induced dephasing rate Γm as a function of detuning δω between resonator and drive frequency with\ndriving force f = 1GHz. The parameters of (e)∼(h) are same with those in (a)∼(d), respectively.\n\nThen we can diagonalize the qubit Hamiltonian Ĥs . In new\neigenvector space, the system Hamiltonian can be written as\nE\nĤs = σ̂z ,\n2\n\n(23)\n\nmeanwhile, the interact Hamiltonian can be written as\nĤint = ~gσ̂n â† â,\n\n(24)\n√\nwhere E = ǫ2 + ∆2 /2 is energy splitting of qubit and n\nis a vector that represents the direction of qubit basis before\ndiagonalized relative to the energy basis\nσ̂n = cos ησ̂z + sin ησ̂x ,\n\n(26)\n\nFrom Eq. (24) we find that fluctuation induced by external noise in particle number n̂ = â† â can causes transition\nbetween qubit states. Therefore, qubit acts as a spectrum analyzer. We separate the interaction Hamiltonian into two parts,\none is ~g cos ησ̂z â† â and the other is ~g sin ησ̂x â† â. The first\npart does not affect the repeatability of QND measurement as\ndiscussed in previous sections. The second part will cause\n\"spin flip\" transition due to the coupling between qubit offdiagonal term and external variable. According to the equation of motion, the time evolution of density matrix is obtained\nin interaction picture by\n\n1 I\n[Ĥ (t), ρI (t)].\ni~ int\n\n(27)\n\nWe choose the initial state as the a product of qubit and\ndetector, i.e., ρ(0) = ρ0 (0) ⊗ ρD (0). Then, tracing Eq. (27)\nover the detector degrees and expanding its right hand to the\nsecond order, we obtain the time evolution of reduced density\nmatrix ρ0 . Eq. (27) becomes\nρ̇I0 (t)\n\n1\n= − 2\n~\n\nZ\n\nt\n0\n\ndτ {[σ̂nI (t), σ̂nI (t − τ )ρI (t − τ )]hn̂I (τ )n̂iD\n\n− [σ̂nI (t), ρI (t − τ )σ̂nI (t − τ )]hn̂n̂I (τ )iD }.\n\n(25)\n\nwith η = arctan (∆/ǫ). The eigenstates are denoted by the\nsuperposition of |0i and |1i\nη\nη\n| ↑i = cos |0i + sin |1i\n2\n2\nη\nη\n| ↓i = − sin |0i + cos |1i.\n2\n2\n\nρ̇I (t) =\n\n(28)\n\nAfter taking matrix elements between eigenstates of Ĥs ,\nwe finally obtain the equation of motion that can describe the\nreduced density matrix evolution\nZ t X\nρ̇Ikk′ (t) = −\ndτ\nMkk′ ll′ ρIll′ (t),\n(29)\n0\n\nl,l′\n\nin which we introduced the matrix\nMkk′ ll′ =\ng {hn̂I (τ )n̂i[(σ̂nI (t)σ̂nI (t−τ ))kl δl′ k′ −(σ̂nI (t−τ ))kl (σ̂nI (t))l′ k′ ]\n2\n\n+hn̂n̂I (τ )i[(σ̂nI (t−τ )σ̂nI (t))l′ k′ δkl −(σ̂nI (t))kl (σ̂nI (t−τ ))l′ k′ ]}.\n(30)\nTo calculate the energy relaxation rate and dephasing rate,\nwe compute the transition rate between qubit eigenstates by\n\n\f5\ncomputing evolution of the diagonal terms of reduced density\nmatrix ρ11 and ρ00 , and the decay of the off-diagonal term\nρ01 with the initial state being a σ̂x eigenstate. The transition\nrates between the two qubit eigenstates can be derived from\nEq. (29)\nΓ↓ = g 2 sin2 ηSnn (ω01 )\nΓ↑ = g 2 sin2 ηSnn (−ω01 ),\n\n(31)\n\nwhere Γ↑ and Γ↓ are rates at which qubit is excited from\nground state to excited state and decay from excited state\nto ground state, respectively. ω01 = E/~, Snn (ω) =\nRt\niωτ\nhn̂(τ )n̂(0)i. If the noise source is in the thermal\n0 dτ e\nequilibrium at temperature T , the transition rate must satisfy\nthe balance condition Γ↑ /Γ↓ = exp(−β~ω01 ) with effective\ntemperature β = 1/kB Tef f . It means that the qubit energy\ncan be absorbed or emitted by detector and the ratio between\npositive and negative noise spectral density depends on the\neffective temperature. We can also obtain the expression of\ndephasing rate Γφ\n1 2 2\ng sin η[Snn (ω01 ) + Snn (−ω01 )]\n2\n+ g 2 cos2 ηSnn (ω = 0)\nΓ↑ + Γ↓\n+ γφ ,\n=\n2\n\nwhere θ0 = arctan (2g/κ) ≈ 2g/κ is phase shift during\nmeasurement derived from Eq. (10), which is identical with\nRef. [10] and Ref. [19] with a coefficient of expression difference that is caused by the difference of the lower limit of\nintegral. It is quite a contrast to Eq. (18) that has double peaks\nfor matching the frequencies of qubit. With the amplitude of\noff-diagonal term of density matrix increasing, the pure dephasing rate become weak and relaxation will be dominant.\nForm Eq. (33), we find that the decay of coherence is caused\nby intrinsic dephasing and aggravated by measurementinduced dephasing. In addition, the deviation from the initial\nvalue of hσz i become bigger as the time goes by due to transition between the qubit states. Therefore, the state of qubit\nis acquired; meanwhile, the repeatability of measurement is\ndestroyed. It means that it should not be considered as a QND\nmeasurement. Based on this effect, it can be used for \"back\naction cooling\" in many system, such as a cantilever coupled\nto a optical cavity,20 a noisy qubit coupled to a mechanical\nresonator,(author?) 21 nanomechanical resonator coupled to a\ndriven superconducting resonantor22 and cooling a micromirror by radiation pressure inside a optical cavity.23\n\nΓφ =\n\n(32)\n\nwhere γφ is qubit pure dephasing rate. For the case ∆ = 0,\nthe measurement is a perfect QND measurement which cannot\ncauses transition between qubit states, in which the dephasing\nrate is\nZ ∞\nΓ φ = γφ = g 2\ndτ hn̂I (τ )n̂iD .\n(33)\n−∞\n\nTo calculate dephasing rate caused by fluctuation of particle\nnumber of oscillator during measurement, we should calculate correlator hδn̂(τ )δn̂i, where δn̂ is quantum fluctuations\naround the mean of photons in the resonator. For a driving\nresonator with frequency ωd , the following equation is valid19\nˆ\nâ(t) = e−iωd t [α + d(t)],\n\n(34)\n\nwhere α is a classic part corresponding to the coherence state\nˆ is a quantum part which can annihilate the coher|αi and d(t)\nence state to the vacuum state. Then the correlator becomes\nκ\nˆ )d(0)i\nˆ\nhδn̂(τ )δn̂(0)i = hd(τ\n= neiδωt−i 2 t ,\n\n∗\n\nElectronic address: yuyang@nju.edu.cn\n\nCONCLUSION\n\nWe have analyzed the QND measurement of a flux qubit\ncoupled to a noisy detector. The analytical results reveal\nthat both of the measurement probability and measurementinduced dephasing have a similar trend that their values have\npeaks for matching one of the qubit frequencies and reduce\nat the resonance point, at which driving frequency equals the\nbare harmonic oscillator frequency. With the resonator decay rate increasing, both of the curves of dephasing rate and\nmeasurement probability become flat. Due to the coupling\nbetween the non-diagonal term of qubit and variable of detector, the noise of detector perturbs the initial state of qubit.\nAs a result, the transition between the qubit states destroys\nthe initial information of qubit. Therefore, there will be energy exchange between qubit and detector according to the\nvalue of effective temperature of noise, which can be used\nfor \"back action\" cooling. Conversely, the behavior of qubit\nwhich acts as a spectrum analyzer can also be used for analyzing the property of noise.\n\n(35)\n\nwhere n is the average photo number in the resonator. Under\nthe condition that δω = 0 and weak coupling g ≪ κ, the\nmeasurement induced dephasing rate is\nΓm = κnθ02 ,\n\nIV.\n\n(36)\n\nV.\n\nACKNOWLEDGEMENT\n\nThis work was partially supported by the State Key Program for Basic Research of China (2006CB921801) and\nNSFC (10725415).\n\n†\n\nElectronic address: lfwei@swjtu.edu.cn\n\n\f6\n1\n\n2\n\n3\n4\n\n5\n\n6\n7\n\n8\n\n9\n\n10\n\n11\n12\n\nD. F. Walls and G. J. Milburn, Quantum Optics, (Springer-Verlag,\nBerlin, 1994).\nC. M. Caves, K. S. Thorne, R. W. P. Drever, V. D. Sandberg, and\nM. Zimmermann, Rev. Mod. Phys. 52, 341 (1980)\nG. J. Milburn and D. F. Walls, Phys. Rev. A. 28, 2065 (1980).\nN. Imoto, H. A. Haus and Y. Yamamoto, Phys. Rev. A. 32, 2287\n(1985).\nH. A. Bachor, M. D. Levenson, D. F. Walls, S. H. Perlmutter and\nR. M. Shelby, Phys. Rev. A. 38, 180 (1988).\nJ. Larson and M. Abdel-Aty, Phys. Rev. A. 80, 053609 (2009).\nM. Brune, S. Haroche and J. M. Raimond, Phys. Rev. A. 45, 5139\n(1988).\nM. Boissonneault, J. M. Gambetta and A. Blais, Phys. Rev. A. 79,\n013819 (2009).\nA. Lupascu, S. Saito, T. Picot, P. C. De Groot, C. J. P. M.Harmans\nand J. E. Mooij, Nat. Phys. 3, 119 (2007).\nJ. Gambetta, A. Blais, D. I. Schuster, A. Wallraff, L. Frunzio, J.\nMajer and M. H. Devoret, S. M. Girvin, and R. J. Schoelkopf\nPhys. Rev. A. 74, 042318 (2006).\nM. F. Bocko and R. Onofrio, Rev. Mod. Phys. 68, 755 (1996).\nY. Makhlin, G. Schon and A. Shnirman, Phys. Rev. Lett. 85, 4578\n(2000).\n\n13\n\n14\n15\n16\n17\n\n18\n\n19\n\n20\n\n21\n\n22\n\n23\n\nA. A. Clerk, S. M. Girvin and A. D. Stone, Phys. Rev. B. 67,\n165324 (2003).\nL. Viola, R. Onofrio and T. Calarco, Phys. Lett. A. 229, 23 (1997)\nD. V. Averin, arXiv:cond-mat/0004364v1.\nL. Chirolli and G. Burkard, Phys. Rev. B. 80, 184509 (2009).\nA. A. Clerk, M. H. Devoret, S. M. Girvin, Florian Marquardt and\nR. J. Schoelkopf, Rev. Mod. Phys. 82, 1155 (2010).\nJ. Gambetta, A. Blais, M. Boissonneault, A. A. Houck, D. I.\nSchuster and S. M. Girvin, Phys. Rev. A. 77, 012112 (2008).\nA. Blais, R. S. Huang, A. Wallraff, S. M. Girvin, and R. J.\nSchoelkopf, Phys. Rev. A. 69, 062320 (2004)\nF. Marquardt, J. P. Chen, A. A. Clerk and S. M. Girvin, Phys. Rev.\nLett. 99, 093902 (2007).\nY. D. Wang, Y. Li, F. Xue, C. Bruder and K. Semba, Phys. Rev. B.\n80, 144508 (2009).\nT. Rocheleau, T. Ndukum, C. Macklin, J. B. Hertzberg, A. A.\nClerk and K. C. Schwab, Nature 463, 72 (2010).\nS. Gigan, H. R. Bohm, M. Paternostro, F. Blaser, G. Langer, J.\nB. Hertzberg, K. C. Schwab, D. Bauerle, M. Aspelmeyer and A.\nZeilinger, Nature 444, 67 (2006).\n\n\f"}