{"id": "http://arxiv.org/abs/1011.0475v1", "guidislink": true, "updated": "2010-11-02T00:00:08Z", "updated_parsed": [2010, 11, 2, 0, 0, 8, 1, 306, 0], "published": "2010-11-02T00:00:08Z", "published_parsed": [2010, 11, 2, 0, 0, 8, 1, 306, 0], "title": "The magnetic field in the NGC 2024 FIR 5 dense core", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1011.3955%2C1011.1173%2C1011.0845%2C1011.1078%2C1011.0468%2C1011.0783%2C1011.6128%2C1011.0489%2C1011.3163%2C1011.6584%2C1011.1936%2C1011.2188%2C1011.2740%2C1011.0475%2C1011.4362%2C1011.4635%2C1011.0850%2C1011.6244%2C1011.5723%2C1011.5116%2C1011.1716%2C1011.4726%2C1011.3619%2C1011.5990%2C1011.3612%2C1011.4291%2C1011.3210%2C1011.3466%2C1011.5565%2C1011.2030%2C1011.4503%2C1011.1212%2C1011.4690%2C1011.5796%2C1011.5940%2C1011.5348%2C1011.3905%2C1011.4014%2C1011.4802%2C1011.1061%2C1011.0023%2C1011.0404%2C1011.0409%2C1011.4498%2C1011.6551%2C1011.2178%2C1011.5811%2C1011.4663%2C1011.4267%2C1011.1306%2C1011.3785%2C1011.1246%2C1011.0086%2C1011.5412%2C1011.5531%2C1011.5117%2C1011.6044%2C1011.2231%2C1011.5024%2C1011.1673%2C1011.6637%2C1011.4258%2C1011.4049%2C1011.5894%2C1011.3555%2C1011.1219%2C1011.3043%2C1011.3977%2C1011.3053%2C1011.3616%2C1011.5922%2C1011.2278%2C1011.5396%2C1011.3843%2C1011.6314%2C1011.4264%2C1011.2534%2C1011.0607%2C1011.1749%2C1011.6322%2C1011.2215%2C1011.2894%2C1011.6344%2C1011.4593%2C1011.3783%2C1011.1248%2C1011.2535%2C1011.2905%2C1011.2995%2C1011.0154%2C1011.0084%2C1011.2955%2C1011.5763%2C1011.3287%2C1011.3406%2C1011.3551%2C1011.4009%2C1011.4349%2C1011.4278%2C1011.3517%2C1011.6603&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The magnetic field in the NGC 2024 FIR 5 dense core"}, "summary": "We used the Submillimeter Array (SMA) to observe the thermal polarized dust\nemission from the protostellar source NGC 2024 FIR 5. The polarized emission\noutlines a partial hourglass morphology for the plane-of-sky component of the\ncore magnetic field. Our data are consistent with previous BIMA maps, and the\noverall magnetic field geometries obtained with both instruments are similar.\nWe resolve the main core into two components, FIR 5A and FIR 5B. A possible\nexplanation for the asymmetrical field lies in depolarization effects due to\nthe lack of internal heating from FIR 5B source, which may be in a prestellar\nevolutionary state. The field strength was estimated to be 2.2 mG, in agreement\nwith previous BIMA data. We discuss the influence of a nearby H{\\sc ii} region\nover the field lines at scales of $\\sim 0.01$ pc. Although the hot component is\nprobably compressing the molecular gas where the dust core is embedded, it is\nunlikely that the radiation pressure exceeds the magnetic tension. Finally, a\ncomplex outflow morphology is observed in CO (3 $\\rightarrow$ 2) maps. Unlike\nprevious maps, several features associated with dust condensations other than\nFIR 5 are detected.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1011.3955%2C1011.1173%2C1011.0845%2C1011.1078%2C1011.0468%2C1011.0783%2C1011.6128%2C1011.0489%2C1011.3163%2C1011.6584%2C1011.1936%2C1011.2188%2C1011.2740%2C1011.0475%2C1011.4362%2C1011.4635%2C1011.0850%2C1011.6244%2C1011.5723%2C1011.5116%2C1011.1716%2C1011.4726%2C1011.3619%2C1011.5990%2C1011.3612%2C1011.4291%2C1011.3210%2C1011.3466%2C1011.5565%2C1011.2030%2C1011.4503%2C1011.1212%2C1011.4690%2C1011.5796%2C1011.5940%2C1011.5348%2C1011.3905%2C1011.4014%2C1011.4802%2C1011.1061%2C1011.0023%2C1011.0404%2C1011.0409%2C1011.4498%2C1011.6551%2C1011.2178%2C1011.5811%2C1011.4663%2C1011.4267%2C1011.1306%2C1011.3785%2C1011.1246%2C1011.0086%2C1011.5412%2C1011.5531%2C1011.5117%2C1011.6044%2C1011.2231%2C1011.5024%2C1011.1673%2C1011.6637%2C1011.4258%2C1011.4049%2C1011.5894%2C1011.3555%2C1011.1219%2C1011.3043%2C1011.3977%2C1011.3053%2C1011.3616%2C1011.5922%2C1011.2278%2C1011.5396%2C1011.3843%2C1011.6314%2C1011.4264%2C1011.2534%2C1011.0607%2C1011.1749%2C1011.6322%2C1011.2215%2C1011.2894%2C1011.6344%2C1011.4593%2C1011.3783%2C1011.1248%2C1011.2535%2C1011.2905%2C1011.2995%2C1011.0154%2C1011.0084%2C1011.2955%2C1011.5763%2C1011.3287%2C1011.3406%2C1011.3551%2C1011.4009%2C1011.4349%2C1011.4278%2C1011.3517%2C1011.6603&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We used the Submillimeter Array (SMA) to observe the thermal polarized dust\nemission from the protostellar source NGC 2024 FIR 5. The polarized emission\noutlines a partial hourglass morphology for the plane-of-sky component of the\ncore magnetic field. Our data are consistent with previous BIMA maps, and the\noverall magnetic field geometries obtained with both instruments are similar.\nWe resolve the main core into two components, FIR 5A and FIR 5B. A possible\nexplanation for the asymmetrical field lies in depolarization effects due to\nthe lack of internal heating from FIR 5B source, which may be in a prestellar\nevolutionary state. The field strength was estimated to be 2.2 mG, in agreement\nwith previous BIMA data. We discuss the influence of a nearby H{\\sc ii} region\nover the field lines at scales of $\\sim 0.01$ pc. Although the hot component is\nprobably compressing the molecular gas where the dust core is embedded, it is\nunlikely that the radiation pressure exceeds the magnetic tension. Finally, a\ncomplex outflow morphology is observed in CO (3 $\\rightarrow$ 2) maps. Unlike\nprevious maps, several features associated with dust condensations other than\nFIR 5 are detected."}, "authors": ["Felipe de O. Alves", "Josep M. Girart", "Shih-Ping Lai", "Ramprasad Rao", "Qizhou Zhang"], "author_detail": {"name": "Qizhou Zhang"}, "author": "Qizhou Zhang", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0004-637X/726/2/63", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1011.0475v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1011.0475v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "48 pages, 12 figures, accepted for publication in The Astrophysical\n  Journal", "arxiv_primary_category": {"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.GA", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1011.0475v1", "affiliation": "Harvard-Smithsonian Center for Astrophysics", "arxiv_url": "http://arxiv.org/abs/1011.0475v1", "journal_reference": null, "doi": "10.1088/0004-637X/726/2/63", "fulltext": "The magnetic field in the NGC 2024 FIR 5 dense core\n\narXiv:1011.0475v1 [astro-ph.GA] 2 Nov 2010\n\nFelipe de O. Alves and Josep M. Girart\nInstitut de Ciències de l'Espai (IEEC–CSIC), Campus UAB, Facultat de Ciències, Torre\nC5 – parell 2, 08193, Bellaterra, Catalunya, Spain\n[oliveira;girart]@ice.cat\nShih-Ping Lai\nInstitute of Astronomy and Department of Physics, National Tsing Hua University,\nHsinchu 30043, Taiwan\nslai@phys.nthu.edu.tw\nRamprasad Rao\nSubmillimeter Array, Institute of Astronomy and Astrophysics, Academia Sinica, 645 N\nAohoku Pl, HI 9672\nrrao@sma.hawaii.edu\nand\nQizhou Zhang\nHarvard-Smithsonian Center for Astrophysics, 60 Garden Street, Cambridge, MA 02138,\nUSA\nqzhang@cfa.harvard.edu\nReceived\n\n;\n\naccepted\n\n\f–2–\nABSTRACT\n\nWe used the Submillimeter Array (SMA) to observe the thermal polarized\ndust emission from the protostellar source NGC 2024 FIR 5. The polarized\nemission outlines a partial hourglass morphology for the plane-of- sky component\nof the core magnetic field. Our data are consistent with previous BIMA maps,\nand the overall magnetic field geometries obtained with both instruments are\nsimilar. We resolve the main core into two components, FIR 5A and FIR 5B. A\npossible explanation for the asymmetrical field lies in depolarization effects due\nto the lack of internal heating from FIR 5B source, which may be in a prestellar\nevolutionary state. The field strength was estimated to be 2.2 mG, in agreement\nwith previous BIMA data. We discuss the influence of a nearby Hii region over\nthe field lines at scales of ∼ 0.01 pc. Although the hot component is probably\ncompressing the molecular gas where the dust core is embedded, it is unlikely that\nthe radiation pressure exceeds the magnetic tension. Finally, a complex outflow\nmorphology is observed in CO (3 → 2) maps. Unlike previous maps, several\nfeatures associated with dust condensations other than FIR 5 are detected.\nSubject headings: ISM: individual (NGC 2024) – ISM: magnetic fields – Polarization\n– Stars: formation – Techniques: interferometric.\n\n\f–3–\n1.\n\nIntroduction\n\nUnderstanding the evolution of molecular clouds and protostellar cores is one of the\noutstanding concerns of modern astrophysics. Particularly, efforts are concentrated in\ndetermining which physical agents are mainly responsible for controlling the dynamical\nproperties of the dense cores. It is widely accepted by the astronomical community that\nmagnetic fields must be taken into account in evolutionary models of collapsing protostellar\ncores (Shu et al. 1999). Although some theories claim that turbulent supersonic flows drives\nstar formation in the interstellar medium (Elmegreen & Scalo 2004; Mac Low & Klessen\n2004), others demonstrate that the ambipolar diffusion collapse theory reproduces properly\nobserved molecular cloud lifetimes and star formation timescales (Tassis & Mouschovias\n2004; Mouschovias et al. 2006).\nOne way to resolve these open issues in star forming theory is to increase the number\nof high-quality observations which resolve the core collapse structure. Sampling several\nprotostellar cores with distinct physical properties can provide better constraints to improve\nsimulations. Particularly, the number of observations of magnetic fields in molecular clouds\nand dense cores has been increasing rapidly with the advent of new instruments with high\nsensitivity. In polarimetry, it is globally accepted that non-spherical dust grains are aligned\nperpendicular to field lines (Davis & Greenstein 1951) producing linearly polarized thermal\ncontinuum emission (Hildebrand 1988). Which mechanism mainly contributes to the\nalignment of interstellar dust grains is still a matter of debate (Lazarian 2007). However,\nvery recently Hoang & Lazarian (2008, 2009) have successfully modeled the polarization\nby radiative torques propelled by anisotropic radiation fluxes. Those torques act to align\nspinning non-spherical dust grains with their largest moment of inertia axis parallel to the\nfield lines. The polarized flux is usually only a small fraction of the total intensity (usually\na few percent) and for this reason the study of the magnetic field is highly limited by the\n\n\f–4–\ninstrumental sensitivity.\nCold dust emits mainly at far-IR and submm wavelengths. In the submm regime,\nthe emission is optically thin and, therefore, it is not affected by scattering or absorption.\nFor this reason, the SMA has been extensively used to study thermal emission from dust\nand cool gas. Several authors reported polarization observations of different classes of\nprotostellar cores. The textbook case is the low mass young stellar system NGC 1333\nIRAS 4A (Girart et al. 2006). The supercritical state is reflected in the SMA polarization\nmaps which indicates a clear hourglass morphology for the plane-of-sky magnetic field\ncomponent in a physical scale of 300-1000 AU. This remarkable result not only was\npredicted by theories of collapse of magnetized clouds (Fiedler & Mouschovias 1993;\nGalli & Shu 1993) but is commonly used to test models of low-mass collapsing cores\n(Shu et al. 2006; Gonçalves et al. 2008; Rao et al. 2009). In the regime of high mass\nprotostars, recent investigations performed with the SMA also provided observational\nconstraints on the physics involved during the core collapse stage. Two recent works\nexemplify distinct magnetic field features within this class of objects. The polarimetric\nproperties of G5.89–0.39 are consistent with a complex, less ordered field likely disturbed\nby an ionization front (Tang et al. 2009), while the hourglass morphology expected for\nmagnetically supported regimes was observed at large physical scales (∼ 104 AU) for the\nprotostellar core G31.41+03 (Girart et al. 2009). Despite the distinct energy balance and\ntimescales of the two regimes (low and high mass), both results imply that the magnetic\nsupport must not be ignored in the models.\nNGC 2024 is the most active star forming region in the Orion B giant molecular cloud.\nThe gas structure in this region has an ionized component surrounded by a background\ndense molecular ridge and a foreground dust and molecular component visible in the optical\nimages as a dark lane. Recently, the new ESO telescope VISTA (Visible and Infrared\n\n\f–5–\nSurvey Telescope for Astronomy) released a high sensitivity near-infrared image of NGC\n2024 (Figure 1). In this large scale view, the foreground dust lane which optically obscures\nthe Hii region is almost transparent. Scattered light produced by the ionization front is\nseen as bright emission in the top of the image, and a cluster of hot young stars is revealed.\nKandori et al. (2007) used near-infrared polarimetry to study the scattered light from the\nHii region. Several reflection nebulae associated with young stellar objects (YSO) were\ndiscovered in their polarization maps. The overall centro-symmetric pattern suggests that\nthe ionizing source is IRS 2b, a massive star located 5′′ north-west of IRS 2, in agreement\nwith a previous near-infrared photometric study carried out by Bik et al. (2003). The\nsubmillimeter continuum emission arising from the dense molecular ridge was first observed\nby Mezger et al. (1988, 1992). Several far infrared cores (so the acronym \"FIR\") at distinct\nevolutionary stages were identified and catalogued in a North-South (NS) distribution. In\nfact, the chain of FIR cores could have been generated by the interaction between the nearby\nHii region and the surrounding molecular cloud. Fukuda & Hanawa (2000) performed\nnumerical simulations of sequential star formation trigged by an expanding Hii region near\na filamentary cloud. In their models, isothermal expansion and magnetohydrodynamic\neffects are considered. Their simulations preview that a chain of cores is formed from this\ninteraction, each pair of cores belonging to a distinct generation though. Comparison\nbetween model and the dynamical parameters observed in NGC 2024 are quite good. In\nparticular, they state that FIR 4 and FIR 5 belong to the first generation of cores, what is\nconfirmed by the observed dynamical ages of their outflows. In this paper, we center our\ndiscussion on FIR 5, the brightest and most evolved of them, with a strong and collimated\nunipolar outflow (Richer et al. 1992). Continuum observations at 3 mm performed by\nWiesemeyer et al. (1997) suggest that FIR 5 is a double core embedded in an envelope.\nHowever, higher angular resolution observations from Lai et al. (2002) (LCGR02 from now\non) resolved the dust emission in one strong component surrounded by several weaker\n\n\f–6–\ncomponents in a radius of a few arcseconds.\nSeveral authors have conducted polarimetric investigations toward FIR 5.\nCrutcher et al. (1999) used the Very Large Array (VLA) to carry out Zeeman observations of OH and Hi absorption lines in order to trace the line-of-sight (LOS) component\nof the magnetic field. These authors found a LOS field gradient of ∼ 100 μG across the\nnortheast-southwest direction. Dust emission polarization in the surroundings of FIR 5 was\nmapped in 100 μm by Hildebrand et al. (1995) and Dotson et al. (2000) with the Kuiper\nAirborne Observatory. At longer wavelengths, Matthews et al. (2002) used the SCUBA\npolarimeter to observe the 850 μm emission with at the James Clerk Maxwell Telescope\n(JCMT) and obtained polarization patterns consistent with those derived with the 100 μm\ndata. Their single-dish dust polarization maps trace a relatively ordered magnetic field\nalong the ridge of emission containing FIR 4 and FIR 5 (Fig. 4 in their paper). Based on\nthe spatial coverage of their observations, this ordered field must extend over a distance of\nat least ∼ 0.5 pc (for the assumed distance of 415 pc to the Orion B cloud). Matthews et al.\n(2002) modeled this field using a helical-field geometry threading a curved filament, since\nthis configuration suited fairly to a 2-dimensional projection accordingly to the SCUBA\nmaps. However, they found that this geometry is not consistent with the LOS Zeeman\ndata of Crutcher et al. (1999) because no reversed fields are seen at both sides of the chain\nof cores. Instead, those authors offer another interpretation based on a compression zone\ncreated due to the expansion of the foreground ionization front. In this scenario, the\nmagnetic field lines are stretched around the ridge of dense cores in a physical morphology\nconsistent with LOS field gradient observed in the Zeeman data of Crutcher et al. (1999).\nConcerning the local field associated with FIR 5, the work of Lai et al. (2002, hereafter\nLCGR02) has the best resolution for the dust continuum emission so far. These authors\nused the Berkeley-Illinois-Maryland-Association (BIMA array) interferometer and obtained\n\n\f–7–\nan angular resolution of 2.′′ 4 × 1.′′ 4. The polarized flux of the BIMA maps extends in a N-S\ndirection, perpendicular to the putative protostellar disk. The corresponding field lines\nwere fitted with a geometric model consisting of a set of concentric parabolas, indicating\nthat the polarized flux trace a partial hourglass morphology for the magnetic field. In this\npaper, we report SMA dust continuum polarization toward FIR 5. The higher sensitivity\nof this instrument provides new information on the detailed field morphology of the FIR 5\ncore.\n\n2.\n\nObservations and Data Reduction\n\nThe high angular resolution of the SMA allows us to trace the thermal emission of\ndust grains at physical scales of few hundred astronomical units1 (for objects in the Orion\nmolecular cloud complex) and, therefore, is able to spatially resolve compact dust cores.\nA detailed description of SMA is given in Ho et al. (2004). The observations were carried\nout in 2007 November 24 and December 19 with the SMA in its compact configuration.\nThe number of antennas available for the observations were 7 and 6, respectively. The\natmospheric opacity at 225 GHz was 0.11 and 0.07 for the first and second day, respectively\n(values measured by the Caltech Submillimeter Observatory tau meter). Observations were\ndone in the 345 GHz atmospheric window, what corresponds to a wavelength of 870 μm.\nThe SMA receivers operate in two sidebands separated by ∼ 10 GHz. The central observed\nfrequencies for the lower and upper side bands were 336.5 GHz and 346.5 GHz, respectively.\nThe SMA correlator had a bandwidth of 1.9 GHz (for each sideband) divided in 24 \"chunks\"\n1\n\nThe Submillimeter Array is a joint project between the Smithsonian Astrophysical Ob-\n\nservatory and the Academia Sinica Institute of Astronomy and Astrophysics, and is funded\nby the Smithsonian Institution and the Academia Sinica.\n\n\f–8–\nof 128 channels each. In total, the full-band spectrum contains 3072 channels for each\nsideband and a spectral resolution of 0.62 MHz, which corresponds to a velocity resolution\nof 0.7 km s−1 . SMA receivers are single linearly polarized. By using a quarter-wave plate in\nfront of each receiver, the incoming radiation is converted into circular polarization (L, R).\nThe SMA correlator combines the signal into circular polarization vectors: RR, LL, RL,\nLR. In order to obtain the full four Stokes parameters for all the baselines, the visibilities\nhave to be averaged on a time scale of 5 minutes. A description of the SMA polarimeter\nand the discussion of the methodology (both hardware and software aspects) are available\nin Marrone et al. (2006) and Marrone & Rao (2008).\nThe phase center (α2000 = 05h 41m 44.s 3, δ2000 = −01◦ 55′ 40.′′ 8) was set according to the\npeak of emission obtained for FIR 5 in LCGR02. Uranus and Titan were observed as flux\ncalibrators in both tracks. The resulting visibility function for each calibrator is consistent\nwith the expected flux estimated by the SMA Planetary Visibility Function Calculator\nduring the observing runs. The quasar J0528+134 was used as the gain calibrator. The\nquasar 3c454.3 was used for bandpass and polarization calibration. The first track had a\nmuch better parallactic angle coverage for 3c454.3 than the second track, thus the 3c454.3\ndata from the first track were used to solve for the instrumental polarization or \"leakages\".\nThe minimum and maximum UV distance for both tracks was 16 and 88 kλ, respectively.\nAntenna 3 was used only in the second track, so no leakage solution could be derived.\nThus, antenna 3 was not used to obtain Stokes Q and U maps. After the calibration steps,\ndata from upper and lower sidebands for each track were synthesized into a single data\nset. Calibrated visibilities for each track were combined into a final data set. Removal of\ncontinuum contamination from the line data set was done. The main contribution arose\nfrom the CO (3 → 2) transition at the chunk # 4 of the upper sideband (∼ 345.76 GHz)2 .\n2\n\nSince our interest in the line data set concerns only Stokes I emission, antenna 3 is\n\n\f–9–\nAll the calibration and reduction steps were done with MIRIAD configured for SMA\ndata (Wright & Sault 1993). The science target was strong enough and self-calibration was\nperformed in order to increase the signal-to-noise ratio in the final maps. Imaging of the\nStokes parameters I, Q and U was performed. Maps of polarized intensity (IP ), polarized\nfraction (P ) and position of polarization angles (θ) were obtained by combining Q and U\n√\nQ2 +U 2\nU\nimages in such a way that P = IIP =\nand θ = 12 tan−1 ( Q\n). The resulting synthesized\nI\nbeam of Stokes I maps has 2.′′ 45 × 1.′′ 48, with a position angle (PA) of −39.8◦ . Table 1\nsummarizes the technical parameters of continuum and line observations.\n\n3.\n3.1.\n\nResults\n\nDust Continuum Emission\n\nFigure 2 shows the contour map of the 878 μm dust emission in FIR 5 obtained with\na quasi-uniform weighting (a robust of −1), which provides a better angular resolution of\n1.′′ 96 × 1.′′41. The overall submillimeter emission resembles the 1.3 mm dust continuum maps\nobtained with BIMA by LCGR02, although the latter has a rms a factor of 3 lower. Our\nobservations (with shortest baseline equal to 16 kλ) allow us to only measure structures\nsmaller than ∼ 5.7 arcseconds (see Equation A.5 of Palau et al. (2010)). In LCGR02, they\nfind extended emission at scales of 5-7 arcseconds with BIMA. The brightest emission arises\naround FIR 5: Main (following LCGR02 notation), which is resolved into two components,\n5A and 5B. Those components correspond to the double source detected in 3 mm by\nWiesemeyer et al. (1997) and indentified as FIR 5-w and FIR 5-e. However, not all the\nfainter sources observed in the FIR 5: Main core of LCGR02 have been detected with the\nSMA. FIR 5: Main appears more extended in the BIMA maps, attributable to the better\nunflagged in the deconvolved CO (3 → 2) maps.\n\n\f– 10 –\nsampling of shorter baselines with the BIMA array. In particular, the N-S direction contains\nemission of the dust condensations LCGR2, LCGR3 and LCGR5 (according to LCGR02\nnomenclature). These sources are missing in our SMA maps probably due to the absence of\nantenna 3 in the deconvolved maps (see section 2). Antennas 3 and 6 cover a short baseline\nin the UV plane which is parallel to the U axis and close to V = 0 kλ. In equatorial\ncoordinates, it corresponds to features parallel to the declination axis, and close to the\nphase center. Therefore, by flagging antenna 3 we lost this flux component which should be\nproduced by the missing sources. In addition, different visibility sampling between the two\naperture synthesis telescopes (BIMA sampled shorter baselines) must also be considered.\nWe also detect several faint peaks (at the 4 and 7–σ level; 1 σ = 18 mJy beam−1 ) also seen\nby LCGR02.\nTables 2 and 3 give the dust emission properties for the two condensations associated\nwith FIR 5: Main and for the fainter dust condensations, respectively. The intensity peak\nand the position of the sources were derived using the Miriad task \"maxfit\". For the two\nbright sources associated with FIR 5: Main, a two Gaussian fit (using the AIPS's \"imfit\"\ntask) was used to estimate the flux density of each component and its size. The two sources\nappear resolved but in different directions. Thus, source 5A has a full width half maximum\n(FWHM) size of 2.′′ 8 × 2.′′ 4 elongated close to the NE–SW axis (P A = 67◦ ), whereas source\n5B has a deconvolved FWHM size of 3.′′ 6 × 2.′′ 8 but is elongated along the SE–NW direction\n(P A = 124◦).\nIn order to estimate the column density and mass of the cores, we need to assume a\nvalue for the cores' temperatures. Different molecular line observations have established\nthat the NGC 2024 cores are warm with temperatures between 40 and 85 K (Ho et al.\n1993; Mangum et al. 1999; Watanabe & Mitchell 2008; Emprechtinger et al. 2009). Here we\nadopt a temperature of 60 K. We assume a dust opacity at 878 μm of 1.5 cm2 g−1 , which\n\n\f– 11 –\napproximately is the expected value for dust grains with thin dust mantles at densities of\n∼ 106 cm−3 (Ossenkopf & Henning 1994). Using the previous FWHM sizes derived from\nthe Gaussian fit, a beam-averaged column density of ∼ 4.7 × 1023 and 2.2 × 1023 cm−2 for\nsources 5A and 5B were derived, respectively. Similarly, masses for these two components\nare 1.09 and 0.38 M⊙ , respectively. The total mass of FIR 5:Main, 1.5 M⊙ , is consistent\nwith the value derived by Chandler & Carlstrom (1996).\n\n3.2.\n\nDistribution of the polarized flux\n\nFor better sensitivity to the weak polarized emission, maps of Stokes I, Q and U\nwere obtained with a robust weight of 0.50. Figure 3 shows the Stokes Q and U emission,\nwhich have different distributions. The Stokes Q emission arises from a negative compact\nspot about one arcsecond north of source A. The Stokes U is quite extended along FIR5:\nMain, with the brightest emission around source 5A. Source 5B has only weak polarized\nemission at 3–σ level. It is noteworthy that significant positive Stokes U emission appears\nwest of source 5A without dust emission associated. However, this spot of polarized\nemission coincides with the BIMA continuum source FIR 5: LCGR 1 (catalogue of\nLCGR02). The non-detection by the SMA could occur because dust emission has been\nresolved out by the interferometer (approximately 30% of the flux is filtered out, see\nsection 3.1). Thus, we tentatively associated this polarized spot to this source. A cutoff\np\nof 2–σ (1– σ ≃ 5 mJy beam−1 ) in polarized intensity ( Q2 + U 2 ) is used to obtain the\n\nlinear polarization emission and to derive the position angle in the plane of the sky of the\npolarization vectors.\nThe polarization intensity and the polarization fraction in our maps achieve values as\n\nhigh as 54 ± 6 mJy beam−1 and 15% ± 2%, respectively, at the northern portions of the\ncore, where the polarized emission is brighter. Figure 4 shows the dust continuum emission\n\n\f– 12 –\nfrom the protostar overlaid with the dust polarization vectors. Using the position of the\ncontinuum peak as reference, three main components can be distinguished: a northern\ncomponent, where the highest polarization degrees are obtained, a southwestern component\nand an eastern component offset by ≈ 5′′ from the continuum peak. This distribution is well\nrepresented in the histogram of polarization angles shown in Figure 5. There is a change of\nroughly 90◦ in the position angles of vectors associated with FIR 5A and the eastern vectors\nassociated with FIR 5B. Concerning only vectors associated with FIR 5A, position angles\nhave a gradual rotation of approximately 40◦ from north to south. Table 4 summarizes\nour polarization data. Note that the distribution of the polarized flux of the SMA data\nis remarkably consistent with the BIMA maps of LCGR02. Although the structure of\nemission in both the BIMA and SMA data sets has the same overall pattern, the latter has\na larger area of polarized flux. Compared to the JCMT maps of Matthews et al. (2002),\nthe mean direction of our SMA polarization field is consistent with the lower resolution\nsingle-dish data, which do not resolve the structure of FIR 5 and traces a larger physical\nscale associated with the diffuse gas found at the core envelope.\n\n3.3.\n\nCO (3 → 2) emission\n\nOur SMA CO (3 → 2) maps reveal a very complex morphology possibly related to\nmultiple outflows. Figure 6 shows the channel maps of the CO (3 → 2) emission with a\nvelocity resolution of ∼ 2.1 km s−1 . At blueshifted velocities the emission arises from an\nelongated but wiggling structure in the East-West direction. This blueshifted component\nappears to be associated with FIR 6. The distribution of the molecular gas at the cloud\nsystemic velocity (vLSR ≃ 10 km s−1 ) is basically associated with the FIR 5 main core.\nAt redshifted velocities (vLSR & 14 km s−1 ) there are two main elongated features almost\nparallel extending in the North–South direction and observed over a wide range of velocities\n\n\f– 13 –\n(up to vLSR ≃ 30 km s−1 ). One of these features is associated with the well-know outflow\npowered by FIR 5A (Sanders & Willner 1985; Richer et al. 1992; Chandler & Carlstrom\n1996) and the other one is located about 10′′ to the west and seems to arise from FIR 5-sw.\nThese two lobes have their brightest emission located near their associated dust components\n(FIR 5A and sw). The emission presents a clumpy morphology, with an average angular\nsize of ∼ 5′′ , corresponding to a physical size of 0.01 parsecs. It is worth noting that the\nthree possible CO high velocity features have no counterpart at the opposite flow velocities.\nThus, the North-South redshifted lobes have no blueshifted counterpart, and the East–West\nblueshifted lobe does not have a redshifted counterpart.\nFigure 7 shows the Position-Velocity (PV) diagram centered in FIR 5A with a PA\n= 0◦.9 (along the brightest redshifted lobe). The outflow powered by FIR 5A has a wide\ndistribution of velocities which prevails until ∼ 30 km s−1 . An extended spatial distribution\nis observed up to ∼ 35′′ south of the source, although only low velocity components are\nobserved at such distances. No blue lobe is seen and only residual emission is measured in\nthe northern counterpart. The blue component observed at the offset position of −14′′ is\npart of the outflow associated with FIR 6. In section 4.4 we provide a detailed discussion\nabout the molecular distribution in this region.\n\n4.\n4.1.\n\nDiscussion\n\nPolarization properties\n\nIn this section, we focus our analysis on the northern and southwestern polarization\nfeatures, which are the brightest components and scientifically more interesting since a less\nuniform pattern is observed. At 2-σ level, these two regions are connected and surround the\npeak of total intensity. From Figure 4, it can be noted that the peak of polarized and total\n\n\f– 14 –\nintensities are approximately 2.′′ 6 apart. Figure 8 shows the dependence of the polarization\nfraction with Stokes I flux and with respect to the distance to source A. In both cases,\nthere is a clear depolarization toward the center, where the highest density portions of the\ncore are located. The left panel of Figure 8 suggests that the distribution of polarization\nwith respect to the Stokes I emission seems to be composed by two subsets: the highest\npolarization fraction data that has a slower growing curve and corresponds to the northern\ncomponent, and the subset with a linear dependence, which arises from the southwestern\ncomponent. The right panel of Figure 8 was produced by performing averaging over\npolarization data for concentric annuli of 0.′′ 4 each.\nThe depolarization effect is observed not only at the brightest component, source A,\nbut also for the second dust component, source B, represented by a \"hole\" at r ≃ 4.′′ 5 in the\nright panel of Figure 8. Those diagrams are consistent with Figure 4, where the polarization\nfraction increases with distance from the peak of emission, but there is a lack of overall\npolarized emission toward source B.\nThe depolarization observed at higher values of Stokes I seems to be part of a global\neffect observed at different wavelengths (Goodman et al. 1995; Lazarian et al. 1997). In\nthe mm/submm range, this phenomenon was also observed in the BIMA data published\nby LCGR02, as well as far-infrared observations with single dishes (Schleuning 1998;\nMatthews et al. 2001) . The anti-correlation between Stokes I and polarization fraction\ncan be caused by different mechanisms. On one hand, it may be the result of changes\nin the grain structure at higher densities. Those changes may be responsible for a\ndecrease in the efficiency of dust grain alignment with respect to the local magnetic field\n(Lazarian & Hoang 2007). In the case of FIR 5B, the embedded source may be in a very\nearly stage of formation, prior even to collapse (since no clear evidence of star-forming\nsignatures like outflows has been assigned to it). In this case, the lack of internal infrared\n\n\f– 15 –\nradiation could provide no radiative torque to the dust grains and, therefore, no polarized\nflux is observed. Another explanation for this effect could be a twisted magnetic field or\nthe superposition of distinct field directions along the LOS resulting in a reduction of the\nnet polarization degree (Matthews et al. 2001). Observations at higher angular resolution\nwould be necessary to resolve the small scale structure.\n\n4.2.\n\nMagnetic field properties\n\nIn section 1 we briefly introduce the physical mechanisms associated with the alignment\nof dust grains with respect to the magnetic field lines. Although some works propose that\ngrain alignment could be independent of magnetic fields (e. g.: mechanical alignment by\nparticle flux, Gold (1952)), it has not been proven yet observationally. Dust grains are\nbelieved to have at least a small fraction of atoms containing magnetic momentum in their\ncompositions, so some interaction with the ambient magnetic field is expected. The most\nstable energy state is achieved when the grain longest axis rotates perpendicularly to the\nfield lines. Consequently, dust emission polarization vectors as observed in submillimeter\npolarimetry have to be rotated by 90◦ in order to be parallel to the plane-of-sky (POS)\ncomponent of the magnetic field. The LOS field component adds no information to the 2D\npolarization map because the spinning dust grains produce zero polarization flux. If a strong\nLOS component is expected, a decrease in net polarization flux is observed, and alternative\ntechniques must be used to measure it (e.g., Zeeman effect observations: Troland & Heiles\n(1982); Crutcher et al. (1993)). Therefore, the polarization map of Figure 4, when rotated\nby 90◦ , traces the projection of the 3D magnetic field morphology on the plane-of-sky (see\nFigure 9). For FIR 5A, the field geometry is described by curved lines centered on the\nprotostellar core. Toward the elongated emission associated with FIR 5B, the field lines are\nparallel to the core's major axis, implying a 90◦ change in the direction with respect to the\n\n\f– 16 –\nFIR 5A mean direction. By relaxing the signal-to-noise level down to 1–σ, one can see that\nthis change in the magnetic field direction is not abrupt, and an hourglass morphology can\nbe roughly derived for the main component (Figure 9, upper right box). Several theoretical\nworks have performed 3D simulations of collapsing magnetized clouds. They all agree that\nthe POS projection of the magnetic field morphology in those class of objects is a hourglass\nshape (Ostriker et al. 2001; Gonçalves et al. 2008). Our results, and many others (e.g.\nGirart et al. (2006); Rao et al. (2009)) provide observational support to these models.\nSo far, the CF relation developed by Chandrasekhar & Fermi (1953) is still the most\nstraightforward method to estimate the plane-of-sky component of the magnetic field.\nAssuming energy equipartition between kinetic and perturbed magnetic energies as\n1\n1\n2\nρδVLOS\n≃\nδB 2 ,\n2\n8π\n\n(1)\n\n(where δVLOS is the observational rms velocity along the line-of-sight and ρ is the average\ndensity), this method compares the fraction of uniform to random components of the field\n√\nunder effects of Alfvénic perturbations (δv ∝ δB ρ) taking into account isotropic velocity\ndispersions. The CF formula uses the dispersion of position of polarization angles and\nmolecular line widths as observational inputs for the gas motions in the core. However,\nrecent works showed that this approximation overestimates the magnetic field for coarser\nresolutions (Heitsch et al. 2001; Ostriker et al. 2001). These authors constrained the\napplication of this method to data sets with relatively low dispersion of position angles\n(∆θ ≤ 25◦ ), which means strong-field cases. By statistical studies of magnetic turbulent\nclouds, these authors showed that the CF formula is accurate only if this condition is\napplied. Using the small angle approximation δφ ≈ δB/Bunif orm , the CF formula can be\nstated as follows:\nBunif orm = ξ\n\np\nδVLOS\n,\n4πρ\nδφ\n\n(2)\n\nwhere δφ is the angle dispersion. The correction factor ξ (≃ 0.5) arises from the previously\n\n\f– 17 –\nmentioned strong field conditions to which this case applies (Ostriker et al. 2001).\nUnlike LCGR02, we opted for not applying any geometric model to the observed\nfield due to the low statistics of our data set. The observed dispersion in our data (main\ncomponent in the histogram of Figure 5) is 12.2◦ . According to δφobs = (δφ2int + σθ2 )1/2 ,\nthe observed dispersion depends on the intrinsic dispersion δφint plus the measurement\nuncertainty of the position of the polarization angles σθ , resulting from the contributions\nof both effects. Since that no geometric models were used to remove the systematic field\nstructure, changes on the large-scale field directions are included in the intrinsic dispersion,\ntogether with turbulent fields due to Alfvénic motions. In our data set, the position angle\nuncertainties average to 7.52◦, which gives us an intrinsic dispersion of 9.61◦ . Some extra\nobservational parameters are needed to compute the magnetic field strength with equation\n2. The average density and the rms velocity in FIR 5 can be obtained from previous\nworks. Emprechtinger et al. (2009) modeled the morphology of NGC 2024 based on APEX\nobservations of CO isotopologues. The various line profiles obtained for different transitions\nare consistent with a complex structure composed by a Photo Dominated Region (PDR)\nforeground to the molecular gas where the far infrared cores are found. In their models,\nthe dense molecular cloud must be warm (75 K) and dense (9 × 105 cm−3 ) to reproduce\nthe velocity gradients observed for distinct cloud components. These results agree with\nthe previous work of Mangum et al. (1999), based on formaldehyde observations. These\nauthors derived a kinetic temperature of TK > 40 K for FIR 3-7 and estimate densities at\nthe same order of magnitude (nH2 ≈ 2 × 106 cm−3 ). We adopt nH2 = 1.5 × 106 cm−3 as\nan average value for the density. For the velocity dispersion, we adopt δVLOS of 0.87 ±\n0.03 km s−1 , which is the value derived by Mangum et al. (1999) from the formaldehyde\nobservations. This molecule is a good tracer of dense gas, and for the single-dish data of\nMangum et al. (1999), it traces the gas kinetic temperature in a scale of ∼ 8000 AU, hence\nit is well correlated to the turbulent motions of the core. Finally, applying those inputs\n\n\f– 18 –\nto the equation 2, together with the δφint previously obtained, we estimate that the POS\nmagnetic field strength is 2.2 mG, which is in good agreement with the value estimated in\nLCGR02. The uncertainty in the magnetic field strength is determined mainly by the error\nin the volume density n, which is a factor of ∼ 2 due to the distinct assumptions on the\ncloud temperature. This factor implies an uncertainty of 40% for the derived field strength.\nAs mentioned earlier, the dispersion used as input in equation 2 carries the combined\neffects of changes on the large-scale field directions plus turbulent motions. In this case,\nthe derived field strength is only a lower limit since the angle dispersion is not generated\npurely by Alfvénic motions. On the other hand, beam averaging and line-of-sight effects\ndue to field twisting of multiple gas components usually underestimates the real value of\nthe turbulent component, and the estimated field strength in this case would be an upper\nlimit. So, we can assume that both effects cancel out and 2.2 mG is a fair estimation for\nthe POS field strength.\nThe mass-to-flux ratio gives information on whether the magnetic field can support\nthe cloud against the gravitational collapse and, therefore, it provides clues about the\nevolutionary state of the source. Specifically, this quantity compares the pressure produced\nby an amount of mass M in a magnetic tube of flux Φ. A critical value, reached when\nthe magnetic pressure is no longer able to support the gravitational pulling, is given by\n√\n(2π G)−1 (Nakano & Nakamura 1978). Observationally, this parameter is defined by\n(Crutcher et al. 1999):\nλ=\n\n√\n(M/Φ)observed\nN(H2 )\n= (mN(H2 )A/BA) × (2π G) = 7.6 × 10−21\n,\n(M/Φ)critical\nB\n\n(3)\n\nwhere (M/Φ)critical is the mass-to-flux ratio of an uniform disk where gravity is balanced by\nmagnetic pressure, m = 2.8mH allowing for He, A is the cloud area covered by observations,\nN(H2 ) is the column density and B is the magnetic field strength. Applying the POS\nmagnetic field strength obtained in the previous paragraph, B = 2.2 mG, and the column\n\n\f– 19 –\ndensities derived in section 3.1, we estimate a mass-to-flux ratio for FIR 5A of 1.6 (for\nT = 60 K), which corresponds to a core in a supercritical stage. In any case, those\ncalculations are restricted to the dust envelope, without taking into account the mass\ncontribution of the embedded protostar. We consider that the derived mass-to-flux values\nare only a lower limit for this quantity and therefore it is in agreement with the observed\nstar-forming signatures.\nWe can also derive the ratio between turbulent and magnetic energies. From the\nautocorrelation function of the polarization position angles, it is possible to measure how\nthe dispersion of PA's varies with respect to the distinct length scales within the cloud.\nThis function provides an indirect calculation of the turbulent to magnetic energy as\n(Hildebrand et al. 2009):\nβturb ≈ 3.6 × 10\n\n−3\n\n\u0012\n\nδφ\n1◦\n\n\u00132\n\n(4)\n\nFor the angular dispersion obtained from our sample, δφint = 9.61, we compute the turbulent\nto magnetic energy ratio as βturb = 0.33. This value agrees with the ratio estimated in\nLCGR02, which reinforces that the turbulent motions are magnetically dominated. The\nturbulent-to-magnetic energy ratio found for FIR 5 is consistent with what was measured\nfor other low-mass protostellar cores like NGC 1333 IRAS 4A and IRAS 16293 − 2422\n(Girart et al. 2006; Rao et al. 2009).\n\n4.3.\n\nMagnetic field around FIR 5A: gravitational pulling or Hii compression?\n\nIn this section, we try to elucidate which mechanism is mainly responsible for\nthe observed curved magnetic field morphology in FIR 5. One possibility is that the\ngravitational pulling overcomes the local magnetic support and drags the ionized material\ntoward the center, warping the field lines in such a way that they assume an hourglass\nmorphology. This is consistent with the previous result that the protostellar core is in the\n\n\f– 20 –\nsupercritical regime. However, if this is the case then only the hourglass component west\nof FIR 5A is observed. The lack of detected vectors east of FIR 5A could be due to the\noverlap in the line of sight of the dust polarization associated with both FIR 5A and FIR\n5B cores. The magnetic field direction associated with FIR 5B is perpendicular to the FIR\n5A main direction. Alternatively if the two cores are connected, then it could be due to an\nabrupt change in the magnetic field direction. In both cases, the net polarization flux is\nexpected to decrease significantly. Another possibility is that the grain alignment efficiency\nassociated with source B is smaller. Indeed, Figure 8b (right panel) show that the second\npolarization \"hole\" matches quite well to the position of FIR 5B. Of course, the cause could\nalso be a combination of these possibilities.\nIf the tension generated by the magnetic field curvature is produced by the gravitational\ncollapse, then we can make a rough estimation of the mass required to produce the observed\ncurvature. This magnetic force can be expressed as B 2 /R, where R is the radius of curvature\nof the field lines. According to the equations derived by Schleuning (1998), we have\n\u0014\n\u0015 \u0014\n\u00152 \u0014\n\u00152 \u0014\n\u0015−1 \u0014\n\u0015−1\nM\nB\nD\nR\nn(H2 )\n=\n100M⊙\n1mG\n0.1pc\n0.5pc\n105 cm−3\n\n(5)\n\nwhere D is the distance of the field lines from the protostar. At D = 1.′′ 9 (789 AU) the field\nlines have a radius of curvature R of 17′′ (7055 AU). At the selected radius of curvature,\nthe estimation of magnetic tension force is ∼ 10−23 dyne cm−3 . Applying these values to\nequation 5, we find that the mass inside the radius of 1.′′ 9 is ≃ 2.3 M⊙ . Although this\nvalue is almost a factor of two higher than the mass estimation done for FIR 5A in section\n3.1, it is within the same order of magnitude of the first estimation, even with the large\nuncertainties in the assumptions of D and the radius of curvature R. This method is an\nalternative approximation to test if gravitational pulling is the responsible for the magnetic\nfield curvature.\nGiven the situation of the FIR 5 core, the external agents may also interfere in\n\n\f– 21 –\nthe protostellar physical environment. Previous observations proved that the molecular\nridge and the chain cores in NGC 2024 are located at the far side of the Hii region\n(Barnes et al. 1989; Schulz et al. 1991; Chandler & Carlstrom 1996; Crutcher et al. 1999).\nThe distribution of molecular and ionized gas proposed by Matthews et al. (2002) for NGC\n2024 (Figure 8 in their paper) has the western portion of the ionization front expanding\ntoward the background molecular ridge and stretching the magnetic field lines around the\nridge of dense cores. At large scales (∼ 0.5 pc), this morphology is corroborated not only\nby the LOS field obtained from the CN Zeeman observations (Crutcher et al. 1999) but\nalso by the POS field from the single-dish dust polarization data. At smaller scales (∼ 0.02\npc), this could have an effect of compressing the magnetic field lines, bending them toward\nthe east, as observed around the FIR 5 core. In order to check if the radiation pressure\ncan be large enough to compress the molecular gas, we have studied the distribution of\nthe ionized gas in NGC 2024. For this purpose, we accessed the NRAO Data Archive\nSystem to search for centimeter emission that could reproduce this morphology. We found\nan extended emission in 6 cm related to the Hii region produced by the star IRS 2b.\nFigure 10 shows that the hot gas has an extended component to the west and is roughly\nflattened to the south (although slightly curved to the southwest). FIR 5A and FIR 5B,\nindicated as crosses in Figure 10, lie in the border of the Hii region. The bright southern\npattern near FIR 5 could trace the compressed ionized gas resulting from the interaction\nbetween hot/diffuse and cold/denser components. The radiation pressure produced by the\nilluminating star (Prad ) can be calculated by\n\nL\n,\ncA\n\nwhere L is the luminosity of the ionization\n\nsource, c is the speed of light and A is the area of the expanding shell. Bik et al. (2003)\nfound that the spectral type of IRS 2b is in the range O8 V–B2 V, which is consistent\nwith the intensities of radio continuum and recombination lines observed in the Hii region\n(Kruegel et al. 1982; Barnes et al. 1989). Therefore, we can assume L = 105.2 L⊙ , which is\nrepresentative of such a spectral type. A first estimation for the radius of the Hii region\n\n\f– 22 –\nwas done by Schraml & Mezger (1969) through low resolution (∼ 2′ ) radio observations\nof NGC 2024. These authors measured a radius of 0.2 pc (≃ 41 × 103 AU) inferred from\nthe observed emission. However, from Figure 10, the radius of the centimeter emission\ncan be fairly estimated in ∼ 1′ , which is approximately the distance between FIR 5 and\nIRS 2b. As a result, the radiation pressure Prad is calculated as 1.16 ×10−8 dyne cm−2 .\nThe ionization pressure (Ne × Te × k) also accounts for the energy produced by the PDR.\nWe assume an electron density of 5.94 ×103 cm−3 as derived from the emission parameters\nof the centimeter VLA map. The recombination line studies of Reifenstein et al. (1970)\nprovide an electron temperature of 7200 K for this Hii region. To be conservative, we adopt\na range of 7200–15000 K for Te . With these parameters, the ionization pressure is estimated\nto range between 5.9 × 10−9 and 1.2 × 10−8 dyne cm−2 . On the other hand, the magnetic\npressure is defined by Pmag =\n\nB2\n,\n8π\n\nwhere B is the total magnetic field strength. Since our\n\nSMA maps provide a two-dimensional picture of the total field, we are able to calculate only\na lower limit for the magnetic pressure. Therefore, applying the previous equation for the\nfield strength obtained in section 4.2, we have Pmag ≥ 1.96 × 10−7 dyne cm−2 . This value is\nat least one order of magnitude higher than the radiation and ionization pressures. Even\nif we add the thermal pressure to the calculations (Pther ≃ 1.4 × 10−9 dyne cm−2 , Vallee\n(1987)), the energy injected by the ionization front is still lower than the magnetic force.\nTherefore the expanding Hii region is not enough to compress the magnetic field lines into\nthe observed geometrical configuration, and the bending is produced by the gravitational\npulling.\n\n4.4.\n\nMultiple Outflows\n\nPrevious works reported that FIR 5 has an associated (redshifted) unipolar and highly\ncollimated outflow with a mass of ∼ 4 M⊙ and density of ∼ 102 cm−3 (Sanders & Willner\n\n\f– 23 –\n1985; Richer et al. 1992; Chandler & Carlstrom 1996). However, a rather complex\nmorphology was proposed by Chernin (1996) as indicated by their interferometric (BIMA)\nand single dish (NRAO 12 m telescope) combined maps of CO (1 → 0). In those, in\naddition to the unipolar lobe associated to FIR 5, there are two other redshifted features\nalong the North-South direction and practically parallel to the FIR 5 molecular outflow, but\nneither of them associated with it. These two components were named ns1 and ns2 and are\ndetected at vLSR velocities between 15 and 25 km s−1 . ns2 is associated with FIR 6. They\nalso identified a blueshifted feature, ew1, extending east of FIR 6. Chernin (1996) proposed\nthat the brightest outflow component apparently powered by FIR 5A has a layered velocity\nstructure. Their lower resolution combined molecular maps (∼ 4.′′ 5) are dominated by an\nunipolar red lobe composed by two parallel outflows at lower velocities (∼ 20 km s−1 in\ntheir Figure 1) which merge into only one at high velocities . This redder emission, referred\nas ns1 in their paper, is more collimated than the lower velocity components and arises 10′′\nwest of FIR 5: A. The author suggests that the ns1 outflow is widened by jet-wandering\nor internal shocks (Chernin & Masson 1995) and is powered by a deeply embedded and\nundetected source rather than FIR 5A due to its misalignment with it.\nIn this work, we offer a different interpretation for this scenario. The SMA CO\n(3 → 2) maps have an angular resolution a factor of 2 higher than the combined maps\nof Chernin (1996). Contrary to the suggestion by Chernin (1996), our maps show that\nthis outflow is clearly powered by FIR 5A instead of by a faint, undetected low-mass star.\nThe overall morphology described by Chernin (1996) is also observed in our maps. The\nmain difference is that we detect high velocity gas which is offset by 10′′ west of FIR 5A,\ncoinciding in position with the previously undetected FIR 5-sw dust condensation.Then,\ntwo interpretations can be derived from those features. Firstly, it is possible that all\ncomponents are part of a single but velocity-layered outflow, the two low velocity lobes\ntracing the cavity where the highest velocity outflow is located. The presence of the high\n\n\f– 24 –\nvelocity lobe not only at the center of the cavity but also displaced from it could suggest\nthat the outflow is precessing. Alternatively, the presence of the FIR 5-sw dust source\nassociated with the western red shifted lobe, and in particular at high outflow velocities,\nsuggest that this lobe could be an independent molecular outflow. As in the case of FIR\n5A, this outflow would be also an unipolar outflow.\nOur CO (3 → 2) maps seem to indicate a possible interaction between the different\noutflows. In the blue lobe of Figure 6, there is extended emission centered in the dust\ncondensation FIR 6n (using the LCGR02 nomenclature) with an EW orientation. The\nemission is associated with an unipolar outflow detected from ∼ 1.0 to 7.8 km s−1 and is\ncharacterized by a wandering/wiggling morphology. The outflow suffers structural changes\nin its shape, represented by drastic rotations in PA. From being powered initially toward the\nNW direction, it assumes an almost horizontal distribution (PA = 94◦ ) which corresponds\nto its brightest emission. Then, another structural change seen at 7.8 km s−1 results in an\nu−like shape. Both the bending from NW to the EW direction and the u−like structure\ncoincide spatially with the projection of the red-lobe NS outflows powered by FIR 5A and\nFIR 5: sw. Figure 11 shows contours of velocity channels 15.6, 19.2 and 29.7 km s−1 (black\ncontours) overlaid with the 7.2 km s−1 channel (red contours) in the upper, middle and\nbottom panels, respectively. The variations in PA of the EW outflow may be somehow due\nto the interaction with the main outflow powered by FIR 5A and the high velocity emission\nfrom FIR 5-sw. Global inspection of these three panels tentatively leads to the hypothesis\nof a shock interaction between distinct outflows in such a way that the gas structure is\nmodified. The spectrum exhibited in Figure 12 was obtained for the supposedly interacting\nzone of the panels of Figure 11. A box of −6′′ < ∆α < −18′′ and −9′′ < ∆δ < −24′′ was\nused to select a region where all three outflows components (EW, main and high velocity\nfeatures) contribute to the emission. The lack of CO emission seen at ∼ 25 km s−1 is\nprobably due to the cavity previously mentioned and corresponds to the velocity interval\n\n\f– 25 –\nbetween low and high red velocity components. The blue emission is related to the EW\noutflow.\n\n4.5.\n\nUnipolar molecular outflow\n\nPrevious observations of NGC 2024 fail to detect a blue counterpart for the bright\noutflow powered by FIR 5A (Richer et al. 1992; Chernin 1996). However, other studies\nclaim a bipolarity for this outflow (Sanders & Willner 1985; Barnes et al. 1989). In all\ncases, the red shift lobe which is ejected toward the south has a brighter, more extended\nand collimated emission than the putative blue counterpart. These works all identify this\nfeature as the main component of this outflow, making the morphology of the blue lobe, if\nit really exists, of unclear nature.\nThis asymmetrical pattern of the outflow powered by FIR 5A could be explained by\nthe cloud morphology proposed by Matthews et al. (2002), illustrated in Figures 6 and 8\nin their paper. They indicate how the NGC 2024 Hii region could be seen from the west\nand north directions, respectively. In this scenario, the dust cores appear in the dense\nmolecular cloud behind the Hii expanding front (using the line-of-sight as reference), with\nFIR 5 projected right below the interface zone. Consequently, the bipolar molecular outflow\nejected from this core will have the blue molecular component destroyed by the UV photons\nproduced in the Hii region, since it points right toward it, but the red lobe would remain\nintact. Despite the fact that Barnes et al. (1989) did not know accurately which core is the\ndriving source of the supposedly blue outflow, these authors found that the total luminosity\nof the nebula is comparable to the flow energy. Therefore, some interaction between both\ncould be expected.\n\n\f– 26 –\n5.\n\nConclusions\n\nIn this paper, we report SMA polarization observations of the intermediate-mass\nprotostellar core NGC 2024 FIR 5. Data acquisition was done using the polarimetric\ncapabilities of the SMA combined with wide spectral window receivers. The polarized flux\nappears distributed in three components: two of them around the peak of total intensity\n(Stokes I) and another component arising from the elongated portion of the core. The\noverall polarization portion resembles a partial hourglass morphology due to a possible\nambipolar diffusion phenomenon taking place in the core.\nThe magnetic field strength was estimated in 2.2 mG. The estimates of turbulentto-magnetic energy and mass-to-flux ratio are consistent with a supercritical highly\nmagnetized core. In previous works, magnetized collapsing cores were also observed in\nhigh-mass protostars. In general, ambipolar diffusion seems to affect core evolution globally,\nindependent of the mass range.\nThe absence of a symmetrical field morphology gives rise to different interpretations for\nthe field structure in the core. The dust cores in NGC 2024 may be affected by an expanding\nionization front compressing the molecular gas. It could be perturbing the field structure\nat smaller scales. The bended lines observed in our SMA maps could be the consequence\nof the radiation pressure of the hot component. Previous VLA 6 cm observations trace the\nforeground Hii region as an extended emission produced by the O2–B2 ionization source\nIRS 2b. However, our estimations of radiation pressure due to the expanding shell does not\novercome the magnetic pressure generated by the field lines. So, the asymmetrical magnetic\nfield is more likely due to depolarization effects arising in the position of the previously\nunresolved FIR 5B source.\nA complex outflow morphology was observed toward FIR 5. Several collimated features\nwere detected toward FIR 5, FIR 6 and FIR 5-sw. We speculate about a possible flow\n\n\f– 27 –\ninteraction between distinct components. It could explain the structural changes observed\nin some outflows. The brighter emission powered by FIR 5A has a clumpy structure and\narises highly collimated in a NS orientation. The absence of a blue lobe counterpart can be\nattributed to the expanding Hii region to the north of the core. The UV radiation field\nmay be responsible for dissociating the molecular structure of the outflow, destroying this\ncomponent.\n\nFOA would like to thank all the staff at the SMA in Hawaii and Cambridge, MA.\nFOA and JMG are supported by the MICINN AYA2008-06189-C03 and the AGAUR\n2009SGR1172 grants.\nFacilities: SMA (polarimetry).\n\n\f– 28 –\nREFERENCES\nBarnes, P. J., Crutcher, R. M., Bieging, J. H., Storey, J. W. V., & Willner, S. P. 1989, ApJ,\n342, 883\nBik, A., Lenorzer, A., Kaper, L., et al. 2003, A&A, 404, 249\nChandler, C. J. & Carlstrom, J. E. 1996, ApJ, 466, 338\nChandrasekhar, S. & Fermi, E. 1953, ApJ, 118, 113\nChernin, L. M. 1996, ApJ, 460, 711\nChernin, L. M. & Masson, C. R. 1995, ApJ, 455, 182\nCrutcher, R. M., Roberts, D. A., Troland, T. H., & Goss, W. M. 1999, ApJ, 515, 275\nCrutcher, R. M., Troland, T. H., Goodman, A. A., et al. 1993, ApJ, 407, 175\nDavis, L. J. & Greenstein, J. L. 1951, ApJ, 114, 206\nDotson, J. L., Davidson, J., Dowell, C. D., Schleuning, D. A., & Hildebrand, R. H. 2000,\nApJS, 128, 335\nElmegreen, B. G. & Scalo, J. 2004, ARA&A, 42, 211\nEmprechtinger, M., Wiedner, M. C., Simon, R., et al. 2009, A&A, 496, 731\nFiedler, R. A. & Mouschovias, T. C. 1993, ApJ, 415, 680\nFukuda, N. & Hanawa, T. 2000, ApJ, 533, 911\nGalli, D. & Shu, F. H. 1993, ApJ, 417, 243\nGirart, J. M., Beltrán, M. T., Zhang, Q., Rao, R., & Estalella, R. 2009, Science, 324, 1408\n\n\f– 29 –\nGirart, J. M., Rao, R., & Marrone, D. P. 2006, Science, 313, 812\nGold, T. 1952, MNRAS, 112, 215\nGonçalves, J., Galli, D., & Girart, J. M. 2008, A&A, 490, L39\nGoodman, A. A., Jones, T. J., Lada, E. A., & Myers, P. C. 1995, ApJ, 448, 748\nHeitsch, F., Zweibel, E. G., Mac Low, M.-M., Li, P., & Norman, M. L. 2001, ApJ, 561, 800\nHildebrand, R. H. 1988, QJRAS, 29, 327\nHildebrand, R. H., Dotson, J. L., Dowell, C. D., et al. 1995, in Astronomical Society of the\nPacific Conference Series, Vol. 73, From Gas to Stars to Dust, ed. M. R. Haas, J. A.\nDavidson, & E. F. Erickson, 97–104\nHildebrand, R. H., Kirby, L., Dotson, J. L., Houde, M., & Vaillancourt, J. E. 2009, ApJ,\n696, 567\nHo, P. T. P., Moran, J. M., & Lo, K. Y. 2004, ApJ, 616, L1\nHo, P. T. P., Peng, Y., Torrelles, J. M., et al. 1993, ApJ, 408, 565\nHoang, T. & Lazarian, A. 2008, MNRAS, 388, 117\nHoang, T. & Lazarian, A. 2009, ApJ, 697, 1316\nKandori, R., Tamura, M., Kusakabe, N., et al. 2007, PASJ, 59, 487\nKruegel, E., Thum, C., Pankonin, V., & Martin-Pintado, J. 1982, A&AS, 48, 345\nLai, S.-P., Crutcher, R. M., Girart, J. M., & Rao, R. 2002, ApJ, 566, 925 (LCGR02)\nLazarian, A. 2007, Journal of Quantitative Spectroscopy and Radiative Transfer, 106, 225\nLazarian, A., Goodman, A. A., & Myers, P. C. 1997, ApJ, 490, 273\n\n\f– 30 –\nLazarian, A. & Hoang, T. 2007, MNRAS, 378, 910\nMac Low, M.-M. & Klessen, R. S. 2004, Reviews of Modern Physics, 76, 125\nMangum, J. G., Wootten, A., & Barsony, M. 1999, ApJ, 526, 845\nMarrone, D. P., Moran, J. M., Zhao, J.-H., & Rao, R. 2006, ApJ, 640, 308\nMarrone, D. P. & Rao, R. 2008, in Presented at the Society of Photo-Optical Instrumentation\nEngineers (SPIE) Conference, Vol. 7020, Society of Photo-Optical Instrumentation\nEngineers (SPIE) Conference Series\nMatthews, B. C., Fiege, J. D., & Moriarty-Schieven, G. 2002, ApJ, 569, 304\nMatthews, B. C., Wilson, C. D., & Fiege, J. D. 2001, ApJ, 562, 400\nMezger, P. G., Chini, R., Kreysa, E., Wink, J. E., & Salter, C. J. 1988, A&A, 191, 44\nMezger, P. G., Sievers, A. W., Haslam, C. G. T., et al. 1992, A&A, 256, 631\nMouschovias, T. C., Tassis, K., & Kunz, M. W. 2006, ApJ, 646, 1043\nMyers, P. C. & Goodman, A. A. 1991, ApJ, 373, 509\nNakano, T. & Nakamura, T. 1978, PASJ, 30, 671\nOssenkopf, V. & Henning, T. 1994, A&A, 291, 943\nOstriker, E. C., Stone, J. M., & Gammie, C. F. 2001, ApJ, 546, 980\nPalau, A., Sánchez-Monge, Á., Busquet, G., et al. 2010, A&A, 510, A5+\nRao, R., Girart, J. M., Marrone, D. P., Lai, S., & Schnee, S. 2009, ApJ, 707, 921\nReifenstein, E. C., Wilson, T. L., Burke, B. F., Mezger, P. G., & Altenhoff, W. J. 1970,\nA&A, 4, 357\n\n\f– 31 –\nRicher, J. S., Hills, R. E., & Padman, R. 1992, MNRAS, 254, 525\nSanders, D. B. & Willner, S. P. 1985, ApJ, 293, L39\nSchleuning, D. A. 1998, ApJ, 493, 811\nSchraml, J. & Mezger, P. G. 1969, ApJ, 156, 269\nSchulz, A., Guesten, R., Zylka, R., & Serabyn, E. 1991, A&A, 246, 570\nShu, F. H., Allen, A., Shang, H., Ostriker, E. C., & Li, Z.-Y. 1999, in NATO ASIC Proc.\n540: The Origin of Stars and Planetary Systems, ed. C. J. Lada & N. D. Kylafis,\n193–+\nShu, F. H., Galli, D., Lizano, S., & Cai, M. 2006, ApJ, 647, 382\nTang, Y.-W., Ho, P. T. P., Girart, J. M., et al. 2009, ApJ, 695, 1399\nTassis, K. & Mouschovias, T. C. 2004, ApJ, 616, 283\nTroland, T. H. & Heiles, C. 1982, ApJ, 252, 179\nVallee, J. P. 1987, Ap&SS, 133, 275\nWatanabe, T. & Mitchell, G. F. 2008, AJ, 136, 1947\nWiesemeyer, H., Guesten, R., Wink, J. E., & Yorke, H. W. 1997, A&A, 320, 287\nWright, M. C. H. & Sault, R. J. 1993, ApJ, 402, 546\nZweibel, E. G. 1990, ApJ, 362, 545\n\nThis manuscript was prepared with the AAS LATEX macros v5.2.\n\n\f– 32 –\n\nFig. 1.- VISTA image of the Flame Nebula (NGC 2024). The obscuring dust lane that\nexists foreground to the bright Hii emission is seen almost transparent in this near infra-red\nimage. The glow of NGC 2023 and the Horsehead Nebula are seen in the lower portion of\nthe image.\n\n\f– 33 –\n\nFig. 2.- Dust continuum map of FIR 5 with quasi-uniform weighting (robust = −1).\nContours are drawn at −3, 3, 4, 6, 9, 13, 19, 25, 32, 42, 52, 62 σ (1–σ ≃ 18 mJy beam−1 ).\nThe half power beam width (HPBW) of the synthesized beam is 1.′′ 96 ×1.′′ 41 and the position\nangle is −70.6◦ . The crosses indicate the dust continuum sources detected by Lai et al. (2002)\nwith BIMA.\n\n\f– 34 –\n\nFig. 3.- Maps of Stokes Q (top panel) and U (bottom panel) emission. Dashed and solid thin\ncontours correspond to negative and positive polarized emission, repectively. The contours\nstart at −2–σ and 2–σ level with steps of 1–σ (1–σ = 5.3 mJy beam−1 ). The absolute Q\nand U peak fluxes are 0.056 Jy beam−1 and 0.047 Jy beam−1 , respectively. The thick grey\ncontours show the Stokes I emission. Crosses indicate the position of the two dust intensity\npeaks. The synthesized beam of the maps is shown in the bottom left corner of the bottom\npanel.\n\n\f– 35 –\n\nFig. 4.- Contour map of the dust continuum emission overlapped with the linear polarization vectors (black vectors) towards NGC 2024 FIR 5. Gray scale correspond to the polarized\ndust intensity. Contours levels are −3, 3, 4, 7, 11, 16, 22, 32, 42, 52, 62–× the rms noise of\nthe dust emission (∼ 19 mJy beam−1 ). The length of each segment is proportional to the\ndegree of polarization (the length corresponding to a polarization level of 10% is indicated at\nthe image bottom) . The synthesized beam is of 2.′′ 45 × 1.′′ 48 with a position angle of −40◦ .\nVectors are sampled as 2/3 of a beam.\n\n\f– 36 –\n\nFig. 5.- Histogram of position of polarization angles. The three polarized components of\nFIR 5 polarization map are clearly seen in this plot.\n\n\f– 37 –\n\nFig. 6.- Channel maps of the CO (3 → 2) emission associated to FIR 5 and FIR 6 dust cores.\nContours levels are -4, 4, 8, 12, . . . to 36 × 0.25 mJy beam−1 (the rms noise of the map). The\nvalue of the VLSR is shown in the top left corner of each panel. Source positions are indicated\nas crosses and labelled in the first panel. Magenta, green, red and brown arrows indicate\nthe position of the FIR 6, FIR 5A, the precessing and the FIR 5-sw outflows respectively.\nAn ellipse indicates the supposedly cavity produced by the high-velocity components of the\nmain FIR 5 outflow component.\n\n\f– 38 –\n\nFig. 7.- Position-Velocity plot of the CO (3 → 2) emission centered close to source FIR 5A\n(one arcsecond to the west) and along the North (positive offsets) to South (negative offsets)\ndirection. Contours levels are −5, −3, 3, and then steps of 3 times 0.3 Jy beam−1 , the rms\nnoise of the channel maps where the cut was obtained. The position of the driving source\nof the redshifted outflow, FIR 5A, is indicated with a dashed line. The spatial overlap with\nthe East ouftflow associated with FIR 6 is also shown with a dashed line.\n\n\f0.12\n\n0.1\n\nPol (%) x 0.01\n\nPol (%) x 0.01\n\n– 39 –\n\n0.08\n\n0.04\n\n0.01\n1\n\n0.2\nStokes I (Jy/beam)\n\n0\n\n0\n\n1\n\n2\n\n3\n4\nRadius (arcsec)\n\n5\n\n6\n\nFig. 8.- Distribution of polarization toward NGC 2024 FIR 5. Left panel: Polarization\nintensity versus total intensity. Right panel: Polarization intensity versus radius with respect\nto the peak of Stokes I emission.\n\nFig. 9.- Plane-of-sky field geometry for NGC 2024 FIR 5. Contours, beam and vector scale\nare the same than in Figure 4. Vectors are plotted at 2σP level and relaxed to 1σP in the\nupper right corner.\n\n\f– 40 –\n\nFig. 10.- VLA 6 cm emission from the Hii region in NGC 2024 (data from the VLA\nArchive). Grey scale-filled contours are 0.5, 1.5, 2, 3, 4, 5, 6, 7, 9, 11, 13.1σ (1σ ≃ 9\nmJy beam−1 ). The beam size of 8.6′′ × 7.5′′ and PA of 37◦ is shown in the lower left corner.\nCrosses indicate the location of FIR 5A and FIR 5B sources. The star indicates the position\nof the ionization source.\n\n\f– 41 –\n\nFig. 11.- Superposition of contours from 15.6, 19.2 and 29.7 km s−1 velocity channels (black\ncontours) over 7.2 km s−1 channel (red contours). Intensity contours are -3, 3, 4, 5, 7, 9, 12\nσ (1 σ ≈ 0.57 mJy beam−1 ). Source positions are maked as crosses.\n\n\f– 42 –\n\nFig. 12.- Spectrum of the interacting zone between the EW outflow, powered by FIR 6,\nand the high velocity feature apparently powered by FIR 5-sw. The spectrum was obtained\nfor a velocity range of 0 to 33.2 km s−1 . The three peaks correspond to the emission from\nthe EW outflow (the blue shifted peak at ∼ 7 km s−1 ), the main lobe powered by FIR 5A\nat ∼ 18 km s−1 and the high velocity lobe arising from FIR 5-sw at ∼ 30 km s−1 .\n\n\f– 43 –\n\nTable 1. Parameters of the continuum and line observations\nHPBW\n\nPA a\n\n(GHz)\n\n(arcsec)\n\n(◦ )\n\nContinuum\n\n345.8000\n\n2.45 × 1.48\n\n-39.8\n\n–\n\n1.19\n\n0.019 b\n\nCO (3→2)\n\n345.7960\n\n2.87 × 1.67\n\n-37.6\n\n0.7\n\n9.5\n\n0.57\n\nObservations\n\na Position\nb The\n\nRest frequency\n\nSpectral resolution\nkm\n\ns−1\n\nangles are measured from North to East.\n\nrms noise of Stokes I emission, obtained with a robust weight of 0.5\n\nPeak of emission\n(Jy\n\nbeam−1 )\n\nrms noise\n(Jy beam−1 )\n\n\f– 44 –\n\nTable 2. FIR 5: main componenta\nα2000 b\n\nDust\n\nδ2000 b\n\ncondensation\n\nPeakb\n\nTotalc\n\nFWHM\n\nDeconvolvedc\n\nDeconvolvedc\n\nof intensity\n\nflux\n\nGaussian fit\n\nsize\n\nPA\n\n(Jy)\n\n(arcsec)\n\n(arcsec)\n\n(◦ )\n\n(Jy\n\nbeam−1 )\n\nFIR 5A\n\n05 41 44.258\n\n−01 55 40.94\n\n1.16(2)\n\n2.44(6)\n\n2.8 × 2.4\n\n2.31(6)×1.58(8)\n\n47(5)\n\nFIR 5B\n\n05 41 44.510\n\n−01 55 42.35\n\n0.40(2)\n\n1.26(8)\n\n3.6 × 2.8\n\n3.1(2)×2.3(1)\n\n130(11)\n\nNote. - Units of right ascension are hours, minutes and seconds, and units of declination are degrees, arcminutes, and\narcseconds.\na Fit\n\nerror of the last digit in parenthesis.\n\nb Estimated\nc Values\n\nusing Miriad's \"MAXFIT\" task.\n\nderived with AIPS's \"IMFIT\" task.\n\n\f– 45 –\n\nTable 3. Sub-millimeter dust condensations\n\nDust\n\nα2000 b\n\nδ2000 b\n\nPeak\n\nFlux\n\nof intensity b\n\ndensity\n\n(mJy beam−1 )\n\n(mJy)\n\ncondensation\n\nFIR 5-sw\n\n05 41 43.667 -01 55 49.05\n\n77(18)\n\n81(21)\n\nFIR 5-ne\n\n05 41 45.043 -01 55 31.60\n\n131(18)\n\n202(30)\n\nFIR 6n a\n\n05 41 45.193 -01 56 00.50\n\n70(18)\n\n40(15)\n\nFIR 6c a\n\n05 41 45.134 -01 56 04.01\n\n124(18)\n\n116(22)\n\na\n\nAccording to Lai et al. (2002) numbering.\n\nb\n\nEstimated using Miriad's \"MAXFIT\" task.\n\n\f– 46 –\n\nTable 4. SMA polarization data from NGC 2024 FIR 5\n\n∆ RA a ∆ Dec\n\nP\n\nǫP σP b\n\n(arcsec) (arcsec) (%) (%)\n\nIP c\n\nθd\n\nǫθ\n\n(Jy beam−1 )\n\n(◦ )\n\n(◦ )\n\n5.4\n\n-2.1\n\n6.00 2.0 3.00\n\n0.018\n\n35.723 9.194\n\n0\n\n-2.1\n\n13.4 3.1 4.32\n\n0.027\n\n-34.364 6.093\n\n5.4\n\n-1.5\n\n9.20 2.8 3.29\n\n0.019\n\n27.954 8.355\n\n4.5\n\n-1.5\n\n3.40 1.4 2.43\n\n0.013\n\n24.122 12.244\n\n1.8\n\n-1.5\n\n3.60 1.6 2.25\n\n0.013\n\n-48.573 12.838\n\n0.9\n\n-1.5\n\n3.30 1.2 2.75\n\n0.016\n\n-47.342 10.207\n\n0\n\n-1.5\n\n5.20 1.1 4.73\n\n0.027\n\n-35.171\n\n-0.9\n\n-1.5\n\n8.00 1.9 4.21\n\n0.025\n\n-34.346 6.549\n\n1.8\n\n-0.9\n\n2.00 1.0 2.00\n\n0.012\n\n-49.173 13.955\n\n0.9\n\n-0.9\n\n1.70 0.7 2.43\n\n0.014\n\n-55.723 11.734\n\n0\n\n-0.9\n\n1.80 0.6 3.00\n\n0.017\n\n-39.46 9.757\n\n-0.9\n\n-0.9\n\n3.40 1.0 3.40\n\n0.019\n\n-37.513 8.696\n\n1.8\n\n-0.3\n\n1.50 0.7 2.14\n\n0.012\n\n-60.593 13.363\n\n0.9\n\n-0.3\n\n2.10 0.6 3.50\n\n0.022\n\n-64.888 7.45\n\n0\n\n-0.3\n\n1.40 0.5 2.80\n\n0.016\n\n-52.705 9.965\n\n-0.9\n\n-0.3\n\n1.60 0.8 2.00\n\n0.012\n\n-47.955 13.225\n\n3.6\n\n0.3\n\n4.80 2.4 2.00\n\n0.012\n\n32.233 13.901\n\n1.8\n\n0.3\n\n2.40 0.7 3.43\n\n0.019\n\n-64.96 8.479\n\n0.9\n\n0.3\n\n4.00 0.5 8.00\n\n0.042\n\n-67.692 3.88\n\n0\n\n0.3\n\n2.80 0.5 5.60\n\n0.031\n\n-58.781 5.187\n\n6.1\n\n\f– 47 –\n\nTable 4-Continued\n\n∆ RA a ∆ Dec\n\nP\n\nǫP σP b\n\n(arcsec) (arcsec) (%) (%)\n\nIP c\n\nθd\n\nǫθ\n\n(Jy beam−1 )\n\n(◦ )\n\n(◦ )\n\n-0.9\n\n0.3\n\n1.70 0.7 2.43\n\n0.013\n\n-56.207 12.44\n\n2.7\n\n0.9\n\n3.90 2.1 1.86\n\n0.011\n\n-10.944 15.247\n\n1.8\n\n0.9\n\n3.90 0.9 4.33\n\n0.023\n\n-62.435 6.924\n\n0.9\n\n0.9\n\n6.70 0.6 11.2\n\n0.061\n\n-70.852 2.667\n\n0\n\n0.9\n\n6.30 0.7 9.00\n\n0.051\n\n-63.767 3.165\n\n-0.9\n\n0.9\n\n3.30 1.0 3.30\n\n0.018\n\n-58.229 8.806\n\n1.8\n\n1.5\n\n6.80 1.7 4.00\n\n0.023\n\n-57.537 7.051\n\n0.9\n\n1.5\n\n9.40 0.9 10.4\n\n0.061\n\n-73.461 2.66\n\n0\n\n1.5\n\n11.7 1.1 10.6\n\n0.063\n\n-69.462 2.569\n\n-0.9\n\n1.5\n\n8.60 2.0 4.30\n\n0.025\n\n-61.584 6.407\n\n0.9\n\n2.1\n\n11.1 1.5 7.40\n\n0.043\n\n-71.543 3.729\n\n0\n\n2.1\n\n15.0 1.7 8.82\n\n0.054\n\n-72.681 2.981\n\n0.9\n\n2.7\n\n14.2 3.1 4.58\n\n0.028\n\n-61.117 5.685\n\n0\n\n2.7\n\n12.6 2.7 4.67\n\n0.029\n\n-71.458 5.554\n\na\n\nOffset respect to the peak of total intensity (same for dec-\n\nlination).\nb\n\nSignal-to-noise ratio of polarization.\n\n\f– 48 –\nc\n\nPolarized intensity ×10−2 .\n\nd\n\nPosition angles are measured from North to East.\n\n\f"}