{"id": "http://arxiv.org/abs/1203.0261v4", "guidislink": true, "updated": "2013-01-31T11:13:26Z", "updated_parsed": [2013, 1, 31, 11, 13, 26, 3, 31, 0], "published": "2012-03-01T18:28:58Z", "published_parsed": [2012, 3, 1, 18, 28, 58, 3, 61, 0], "title": "Quantization of linearized gravity in cosmological vacuum spacetimes", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1203.0944%2C1203.3228%2C1203.4550%2C1203.6007%2C1203.1862%2C1203.5359%2C1203.2994%2C1203.1982%2C1203.2936%2C1203.3731%2C1203.1411%2C1203.2377%2C1203.0721%2C1203.1733%2C1203.5791%2C1203.1453%2C1203.1942%2C1203.5426%2C1203.3052%2C1203.6061%2C1203.2338%2C1203.5674%2C1203.1534%2C1203.4962%2C1203.4035%2C1203.1526%2C1203.5555%2C1203.1362%2C1203.5879%2C1203.2542%2C1203.0908%2C1203.1424%2C1203.6622%2C1203.6406%2C1203.5532%2C1203.4066%2C1203.4646%2C1203.0271%2C1203.0408%2C1203.5682%2C1203.5964%2C1203.6333%2C1203.2448%2C1203.5210%2C1203.0096%2C1203.0324%2C1203.5884%2C1203.1646%2C1203.0203%2C1203.0112%2C1203.1133%2C1203.6826%2C1203.0261%2C1203.2493%2C1203.4951%2C1203.3044%2C1203.0395%2C1203.5269%2C1203.4238%2C1203.1750%2C1203.1164%2C1203.3043%2C1203.3988%2C1203.4560%2C1203.2026%2C1203.6813%2C1203.3596%2C1203.5961%2C1203.4834%2C1203.4545%2C1203.2175%2C1203.1712%2C1203.3274%2C1203.6323%2C1203.2123%2C1203.2177%2C1203.2450%2C1203.5562%2C1203.1996%2C1203.1542%2C1203.4920%2C1203.3034%2C1203.1566%2C1203.2592%2C1203.5081%2C1203.0878%2C1203.6249%2C1203.3886%2C1203.1460%2C1203.1300%2C1203.6696%2C1203.5069%2C1203.6190%2C1203.0539%2C1203.5178%2C1203.0833%2C1203.2236%2C1203.2704%2C1203.0599%2C1203.0947%2C1203.3324&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quantization of linearized gravity in cosmological vacuum spacetimes"}, "summary": "Linearized Einstein gravity (with possibly nonzero cosmological constant) is\nquantized in the framework of algebraic quantum field theory by analogy with\nDimock's treatment of electromagnetism [Rev. Math. Phys. 4 (1992) 223--233]. To\nachieve this, the classical theory is developed in a full, rigorous and\nsystematic fashion, with particular attention given to the circumstances under\nwhich the symplectic product is weakly non-degenerate and to the related\nquestion of whether the space of solutions is separated by the classical\nobservables on which the quantum theory is modelled.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1203.0944%2C1203.3228%2C1203.4550%2C1203.6007%2C1203.1862%2C1203.5359%2C1203.2994%2C1203.1982%2C1203.2936%2C1203.3731%2C1203.1411%2C1203.2377%2C1203.0721%2C1203.1733%2C1203.5791%2C1203.1453%2C1203.1942%2C1203.5426%2C1203.3052%2C1203.6061%2C1203.2338%2C1203.5674%2C1203.1534%2C1203.4962%2C1203.4035%2C1203.1526%2C1203.5555%2C1203.1362%2C1203.5879%2C1203.2542%2C1203.0908%2C1203.1424%2C1203.6622%2C1203.6406%2C1203.5532%2C1203.4066%2C1203.4646%2C1203.0271%2C1203.0408%2C1203.5682%2C1203.5964%2C1203.6333%2C1203.2448%2C1203.5210%2C1203.0096%2C1203.0324%2C1203.5884%2C1203.1646%2C1203.0203%2C1203.0112%2C1203.1133%2C1203.6826%2C1203.0261%2C1203.2493%2C1203.4951%2C1203.3044%2C1203.0395%2C1203.5269%2C1203.4238%2C1203.1750%2C1203.1164%2C1203.3043%2C1203.3988%2C1203.4560%2C1203.2026%2C1203.6813%2C1203.3596%2C1203.5961%2C1203.4834%2C1203.4545%2C1203.2175%2C1203.1712%2C1203.3274%2C1203.6323%2C1203.2123%2C1203.2177%2C1203.2450%2C1203.5562%2C1203.1996%2C1203.1542%2C1203.4920%2C1203.3034%2C1203.1566%2C1203.2592%2C1203.5081%2C1203.0878%2C1203.6249%2C1203.3886%2C1203.1460%2C1203.1300%2C1203.6696%2C1203.5069%2C1203.6190%2C1203.0539%2C1203.5178%2C1203.0833%2C1203.2236%2C1203.2704%2C1203.0599%2C1203.0947%2C1203.3324&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Linearized Einstein gravity (with possibly nonzero cosmological constant) is\nquantized in the framework of algebraic quantum field theory by analogy with\nDimock's treatment of electromagnetism [Rev. Math. Phys. 4 (1992) 223--233]. To\nachieve this, the classical theory is developed in a full, rigorous and\nsystematic fashion, with particular attention given to the circumstances under\nwhich the symplectic product is weakly non-degenerate and to the related\nquestion of whether the space of solutions is separated by the classical\nobservables on which the quantum theory is modelled."}, "authors": ["Christopher J. Fewster", "David S. Hunt"], "author_detail": {"name": "David S. Hunt"}, "author": "David S. Hunt", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1142/S0129055X13300033", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1203.0261v4", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1203.0261v4", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "41pp, v2&3 typos and errors corrected; references added. v4 Final\n  version to appear in Reviews in Mathematical Physics", "arxiv_primary_category": {"term": "math-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.MP", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1203.0261v4", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1203.0261v4", "journal_reference": "Rev. Math. Phys. 25, 1330003 (2013)", "doi": "10.1142/S0129055X13300033", "fulltext": "arXiv:1203.0261v4 [math-ph] 31 Jan 2013\n\nQuantization of linearized gravity in cosmological\nvacuum spacetimes\nChristopher J Fewster∗ and David S Hunt†\nDepartment of Mathematics, University of York,\nHeslington, York YO10 5DD, U.K.\nMay 24, 2018\n\nAbstract\nLinearized Einstein gravity (with possibly nonzero cosmological constant) is quantized in the framework of algebraic quantum field theory by analogy with Dimock's\ntreatment of electromagnetism [Rev. Math. Phys. 4 (1992) 223–233]. To achieve this,\nthe classical theory is developed in a full, rigorous and systematic fashion, with particular attention given to the circumstances under which the symplectic product is\nweakly non-degenerate and to the related question of whether the space of solutions\nis separated by the classical observables on which the quantum theory is modelled.\n\n1\n\nIntroduction\n\nLow energy effects of quantum gravitation can usefully be modelled by the quantum field\ntheory of linearized gravity, treated as a quantum field theory in a fixed background spacetime. The background of de Sitter space is particularly interesting from the cosmological\nviewpoint, where linearized gravitons can induce fluctuations in the cosmic microwave\nbackground, for instance, see [51, Ch. 4 & 10] for a discussion of inflation and tensor fluctuations. For these reasons, the quantum field theory of linear gravitational perturbations\nhas been studied extensively on several spacetimes, see for example [24] and references\ntherein for the case of Robertson-Walker spacetimes.\nIn the important de Sitter case, there has been a long-running controversy concerning\nthe existence of a suitable de Sitter invariant vacuum state. This arises because natural\nconstructions, for example, in the transverse-traceless and synchronous gauge associated\nwith conformally flat coordinates on the Poincaré patch [23] lead to a divergent expression\nfor the two-point function as a result of an infrared divergence in the integral over modes.\n∗\n†\n\nchris.fewster@york.ac.uk\ndsh501@york.ac.uk\n\n1\n\n\fSome parties to the controversy [33] nonetheless claim the existence of a de Sitter invariant\ntwo-point function whilst others [38] deny those claims. At issue is the validity of the use of\nEuclidean and analytic continuation methods, and the freedom to select gauge conditions\nor add gauge-fixing terms.\nFor this reason it seems appropriate to have a framework for the quantization of linear\ngravitational perturbations on a general cosmological vacuum spacetime that will, when\nrequired, allow one to reduce down to a specific choice of spacetime and will also permit\na rigorous investigation to be made into the issue of Hadamard states. This paper is the\nfirst step in that process.\nOf course the quantization of linear gravitational perturbations has previously been\nconsidered by numerous authors and it would not be feasible to list them all here, but,\nfor our purposes [2] in particular stands out because of its consideration of Hadamard\nrenormalization of the graviton stress tensor on cosmological vacuum spacetimes. However,\nthis was achieved by introducing gauge-breaking terms and ghost fields. We prefer to avoid\nthe introduction of such auxiliary fields and choices of gauge-breaking terms and apply a\nminimal approach along the same lines as Dimock's quantization of electromagnetism [16]\n(see also [17]). A brief outline of the method is as follows. Let (M, g) be a background\nspacetime that solves the cosmological vacuum Einstein equation. The classical phase space\nP(M) of linearized gravity consists of solutions to the linearized Einstein equation modulo\ngauge-equivalence with a typical equivalence class denoted [γ]. A classical observable is a\nfunction from P(M) to the set of complex numbers. For example, given any [γ] ∈ P(M),\nwe may smear any representative γ (i.e., a solution to the linearized Einstein equation)\nagainst a compactly supported test-tensor f , to give an observable\nZ\nFf ([γ]) =\nγab f ab dvolg ,\nM\n\nwhich is independent of the choice of representative provided that f satisfies the condition\n∇a f(ab) = 0. Once a presymplectic form is given on P(M), we may quantize to form a\n∗-algebra of observables – essentially by Dirac quantization. This is a particular instance\nof the algebraic approach to quantum field theory in curved spacetimes (see, e.g., [49,\nCh. 4.5] for an introduction). The advantages of this procedure are: (a) it is manifestly\nindependent of any choice of gauge, (b) it does not involve the addition of gauge-breaking\nterms or auxiliary fields in the action, (c) the method can be implemented in arbitrary\nglobally hyperbolic cosmological vacuum background spacetimes, (d) it separates the construction of the algebra of observables from questions concerning the existence or otherwise\nof particular vacuum states which can then be addressed separately, and (e) it circumvents\nthe known nonexistence of a Wightman theory of linearized gravity on Minkowski space\nallowing arbitrary smearings [46, 10]. Nonetheless, there is a disadvantage, namely that\nwe are not free to smear the metric perturbation against arbitrary tensors, which would\nbe necessary in order to couple it to other fields. However, this quantization provides a\nrigorous framework that could be broadened in further work, for example, by exploiting the\nrecent and rigorous approach to the Batalin–Vilkovisky formulation due to Fredenhagen\nand Rejzner [25]. Following the work reported here, Hack and Schenkel [30] have shown\n2\n\n\fthat our treatment of linearized gravity can be put into a broader framework of quantisations of linear theories with gauge invariance. It would also be interesting to adapt these\nmethods to other theories related to linearized gravity [12, 13, 14].\nAn important question is whether or not the class of observables identified above is\nsufficient to distinguish different equivalence classes of solutions. This is closely related\nto the issue of whether the pre-symplectic form is weakly non-degenerate, and thus symplectic. We will be able to resolve these questions positively at least in the case where\nthe background spacetime has compact Cauchy surfaces, by adapting splitting results of\nMoncrief [39] derived in the Arnowitt-Deser-Misner (ADM) formalism (briefly reviewed in\nAppendix B).\nAs mentioned above, the quantized theory leans heavily on the theory of classical linearized gravity and a substantial part of the present paper is devoted to a clear and general\npresentation of the theory. Much of this material is known, of course, but we have not found\na unified and full treatment in the literature that would be sufficient for our purposes.a\nWe therefore hope that our presentation of the theory may be of independent interest and\nutility. To a large extent we emphasize a four-dimensional 'spacetime' viewpoint on the\ntheory in contrast to the 'sliced' viewpoint of the ADM formulation. This is more natural\nfor the formulation of the quantum theory and also removes any suspicion of dependence\non particular slicings, coordinates or choices of (linearized) lapse and shift. However, as\nmentioned, we will draw on insights from the ADM formulation and make contact where\nnecessary.\nThe paper is structured as follows. In section 2 we begin with a brief introduction\nto linearized gravity and the gauge invariance of the theory. While our approach as a\nwhole is independent of gauge choice, particular gauges are used for technical purposes\nto establish results on the full solution space and, to this end, we describe three gauges,\nde Donder, transverse-traceless and synchronous, and the circumstances under which they\ncan be employed. This is largely standard, but for our discussion of the transverse-traceless\ngauge, for which we find that the topology of the Cauchy surface determines whether one\nmay pass globally to the transverse-traceless gauge. In the synchronous case it is shown\nthat a general perturbation is gauge-equivalent to a synchronous perturbation in a normal\nneighbourhood of any Cauchy surface (relative to the induced normal field).\nIn section 3 we review existence and uniqueness of solutions to the linearized Einstein\nequation and provide the proofs for perturbations that are spacelike-compact, i.e., supported in the union of the causal future and past of a compact set. Similar results are\nsketched in [22] for the case of compact Cauchy surfaces. We also prove various results\nconcerning Green's operators, which will be required in section 4. The upshot of this\ndiscussion is that, modulo gauge equivalence, all spacelike-compact solutions to linearized\ngravity are given by the action of the advanced-minus-retarded solution, associated to the\nLichnerowicz Laplacian Pab cd = ∇e ∇e δ ca δ db − 2Rcabd , acting on smooth, compactly supported, symmetric tensor fields f obeying ∇a (fab − 12 fc c gab ) = 0. One should note that\nalthough Lichnerowicz considers various Green's operators in [36], his existence results are\na\n\nFor instance [22, Sec. 4] considers only compact Cauchy surfaces, while [36] restricts to local results.\n\n3\n\n\fpurely local in nature, that is, they are valid in suitable open subsets of the manifold.\nLikewise, the book by Friedlander [26] also only considers local results. Our approach\nrests on the global theory of normally hyperbolic equations (developing the results just\nmentioned) that is described in the book of Bär, Ginoux and Pfäffle [6]. We make contact\nwith Lichnerowicz's work by confirming that our propagator is identical to the one posited\nin [36]. He justified its form by using analogy with electromagnetism and the work of Fierz\nand Pauli [20] for the case that the background spacetime was Minkowski. In the present\npaper, it emerges (in any cosmological vacuum spacetime) as the Dirac quantization of\nPoisson brackets of the classical observables Ff .\nThe final part is section 4, which deals with construction of the phase space for linearized gravity and its subsequent quantization. As mentioned, the weak non-degeneracy\nof the symplectic product is established for compact Cauchy surfaces using results from\nthe ADM formalism, in particular results of [39] providing various splittings of the space\nof initial data. Although these results are not established on general non-compact Cauchy\nsurfaces, we conjecture that the non-degeneracy (as we formulate it) will hold for a large\nclass of spacetimes with non-compact Cauchy surfaces as well. This is analogous to the\nsituation in electromagnetism [16] where to prove non-degeneracy one appeals to the Hodge\ndecomposition, again placing restrictions on the Cauchy surface.\nOnce the phase space is constructed, the quantization then follows standard lines, either\nby Dirac quantization of the observables or a direct quantization of the symplectic space;\nwe demonstrate that they are equivalent in section 4.3. We prove that the algebra satisfies\nthe time-slice condition, i.e., it is generated by smeared fields whose smearing tensors are\nsupported in any neighbourhood of a given Cauchy surface. We also briefly discuss the\nextent to which the construction respects the axioms of local covariance [11].\nSummarizing, our approach puts the quantum field theory of linearized gravity on a\nrigorous mathematical footing, which will permit future investigations into the states of the\ntheory. In particular, it will enable precise statements to be made, using techniques from\nmicrolocal analysis, about Hadamard states (cf. [17] for the case of electromagnetism).\nElsewhere, we will investigate what can be said concerning the existence of a de Sitter\ninvariant Hadamard state in the context of our framework. Note that the discussion of\nlinearization instabilities would manifest itself in the properties of states [41] of the algebra\nof observables we construct and so we do not consider these issues here.\nWe end this introduction with some preliminaries. We take, as in [31, 48], the Riemann\ntensor to be defined by\nRabcd ωd = (∇a ∇b − ∇b ∇a )ωc\n(1.1)\nand the Ricci scalar to be\nRac = Rabcb .\n\n(1.2)\n\nBoldface type is used to indicate a tensor written with its indices suppressed. We also use\nw ♭ to denote the covariant form of a vector field w and v ♯ to denote the contravariant form\nof a covector field v. A number of spaces of smooth scalar and tensor fields will be employed;\nall are taken to be complex-valued unless otherwise stated. As usual, C ∞ (M) denotes the\nspace of smooth functions on M, while we write C ∞ (Tba (M)) for the space of smooth rank\n4\n\n\f(a, b) tensor fields on M. Various subscripts will denote restrictions on the support of such\nfunctions; C0∞ (M) and C0∞ (Tba (M)) denote the compactly supported elements of C ∞ (M)\nand C ∞ (Tba (M)), while, following the notation of [6, p. 90], the subscript SC (spacelike∞\ncompact) attached to any of these spaces (e.g., CSC\n(Tba (M))) denotes the subspace of\ntensor fields of the appropriate type whose support is contained within J(K) for some\ncompact K ⊂ M. In particular this means that the intersection of the support with a\nCauchy surface is compact. The subscript T C (timelike-compact) denotes tensor fields\nwhose support lies between two Cauchy surfaces. Finally, S20 (M) (resp., S02 (M)) denotes\nthe symmetric elements of T20 (M) (resp., T02 (M)), giving rise to corresponding spaces of\nsymmetric tensor fields.\n\n2\n\nLinearized gravity\n\nA spacetime is a pair (M, g) consisting of a four-dimensional, smooth, real, connected,\nHausdorff, orientable manifold without boundary M together with a smooth Lorentzian\nmetric g of signature (− + ++), with respect to which M is time-orientable; such a spacetime is automatically paracompact by the theorem in the appendix of [29]. Each (background) spacetime will be assumed to be globally hyperbolic, i.e., it admits no closed causal\ncurves and for any two points p, q ∈ M the set J + (p)∩J − (q) is compact [8]. In addition, we\nassume that the metric solves the vacuum Einstein equations with cosmological constant\nGab + Λgab = 0,\n\n(2.1)\n\nwhere Gab = Rab − 21 Rgab as usual. As a consequence of (2.1), the background Ricci tensor\nand Ricci scalar obey\nRab = Λgab ,\nR = 4Λ,\n(2.2)\nwhich will often be used in what follows.\nOur aim is to quantize linearized perturbations of the Einstein equations. To linearize,\nwe consider a smooth one-parameter family of solutions λ 7→ g(λ) to (2.1) with g(0) =\ng. The linearized equation satisfied by the perturbation γ := ġ(0) ∈ C ∞ (T20 (M)) on a\ncosmological background is\nLab (γ) = 0,\n(2.3)\nwhere\n1\nLab (γ) = − gab (∇c ∇d γ(cd) − \u0003γ − Λγ) − Λγ(ab) − \u0003γ(ab)\n2\n1\n3\n− ∇a ∇b γ + ∇c ∇(a γbc) ,\n2\n2\n\n(2.4)\n\nγ = γ aa is the trace of γ and \u0003 = g ab ∇a ∇b . The linearized Einstein tensor Lab (γ) vanishes\nfor antisymmetric γ and for symmetric γ (our case of interest) reduces to\n1\n1\n1\nLab (γ) = − gab (∇c ∇d γcd − \u0003γ − Λγ) − Λγab − \u0003γab − ∇a ∇b γ + ∇c ∇(a γb)c .\n2\n2\n2\n5\n\n(2.5)\n\n\fThe linearized equation (2.5) also follows from the Euler-Lagrange equations of the Lagrangian (with γ assumed to be symmetric)\nL = T abcdef ∇a γbc ∇d γef + S abcd γab γcd ,\n\n(2.6)\n\nwhere T abcdef is given by\n1\nT abcdef = (g ad g bc g ef + g af g d(b g c)e + g d(b g c)f g ae\n4\n− g ad g e(b g c)f − g a(e g f )d g bc − g d(b g c)a g ef ),\n\n(2.7)\n\nwhich is symmetric on interchange of b to c and on interchange of e to f as required by\nthe symmetry of γ; T abcdef is also symmetric on interchange of abc to def . Finally\nS abcd =\n\nΛ ac bd Λ bc ad Λ ab cd\ng g + g g − g g\n4\n4\n4\n\n(2.8)\n\nis symmetric on interchange of ab to cd and symmetric on interchange of a to b and\ninterchange of c to d. The Lagrangian (2.6) comes from the second order expansion of the\nEinstein-Hilbert action with cosmological constant\nZ\nS = (R − 2Λ)dvolg ,\n(2.9)\nwhere dvolg denotes the volume element on spacetime associated with g. Note that in the\nexpansion, the linear term is a total divergence and the zeroth-order term is the EinsteinHilbert action for the background.\nThe covariant conjugate momentum\nδS\n1\n= 2T abcdef ∇d γef\nΠabc = √\n−g δ∇a γbc\n\n(2.10)\n\nis given by\n1\n1\n1\n1\n1\n1\n1\nΠabc = − ∇a γ bc + g bc ∇a γ − g bc ∇d γ ad − g ac ∇b γ − g ab ∇c γ + ∇b γ ac + ∇c γ ab (2.11)\n2\n2\n2\n4\n4\n2\n2\nand the Euler-Lagrange equations are thus\n∇c Πcab − 2S abcd γcd = Lab (γ) = 0.\n\n(2.12)\n\nNote that the first equality holds for all smooth symmetric γ, not just for solutions to the\nlinearized equations.\nThe linearized Einstein equation (2.3) is non-hyperbolic. To address existence and\nuniqueness properties of solutions we exploit gauge freedom to put the equation into a\nhyperbolic form. As is well known, the gauge transformations for linearized gravity take\nthe form\n′\nγ ′ = γ + £w g,\ni.e., γab\n= γab + 2∇(a wb)\n(2.13)\n6\n\n\ffor w ∈ C ∞ (T01 (M)). Owing to the identity\nLab (£w g) = £w (Gab + Λgab ),\n\n(2.14)\n\nthe linearized equation (2.3) is gauge invariant, in the sense that Lab (£w g) = 0, if and only\nif the background is a cosmological vacuum solution (see [45, Lem. 2.2]). This restricts our\nanalysis to such spacetimes.\nIn addition, to ensure well-posedness of the Cauchy problem and the existence of certain\nintegrals, we restrict attention to spacelike-compact perturbations. With this in mind we\nintroduce the notations\n∞\nT (M) = CSC\n(S20 (M))\nS (M) = {γ ∈ T (M) | Lab (γ) = 0}\n∞\nG (M) = {£w g | w ∈ CSC\n(T01 (M))}\n\n(2.15)\n(2.16)\n(2.17)\n\nfor, respectively, the spacelike-compact symmetric tensors, the subspace obeying the linearized Einstein equation and the pure gauge solutions induced by spacelike-compact vector\nfields.\nIn section 4 it will be necessary to consider the larger class of spacelike-compact pure\ngauge solutions induced by arbitrary smooth vector fields,\nGˆ(M) = {£w g : w ∈ C ∞ (T01 (M))} ∩ T (M).\n\n(2.18)\n\nIn fact, this coincides with G (M) whenever M has compact Cauchy surfaces; more generally, the two sets differ only if there exist regions of the form M \\ J(K), for K compact,\nsupporting Killing vector fields. The example of Minkowski space shows that the latter\ncondition, while necessary, is not sufficient: if £w g ∈ Gˆ(M), then w ∈ C ∞ (T01 (M)) satisfies the Killing equation outside some set J(K) with K compact; without loss of generality,\nJ(K) may be assumed to have connected complement, by expanding K if necessary. Because Minkowski space is maximally symmetric, there exists a global Killing vector field\nξ such that supp(w − ξ) ⊂ J(K); as £w−ξ g = £w g, we see that £w g ∈ G (M), so\nGˆ(M) = G (M) in this case. To see how Gˆ(M) and G (M) can differ, consider Minkowski\nspace with the causal future and past of the origin removed, which is still a globally hyperbolic Einstein manifold M and inherits all the Killing vector fields of Minkowski space.\nLet r be the standard radial coordinate in the time-zero hyperplane and let K be the\nset of all points in the time-zero hyperplane with R ≤ r ≤ 2R, for some R > 0. Then\nM \\ J(K) is disconnected, and neither component is relatively compact. Take any Killing\nvector field ξ and let w = f (r)ξ, where f is constant outside [R, 2R] with f (R) 6= f (2R).\nThen £w g ∈ Gˆ(M) \\ G (M).\nThe remainder of this section is devoted to identifying when particular gauge choices\ncan be made, and is largely standard with the exception of our remarks on the transverse\ntraceless gauge. We begin with the primary choice of gauge that will be used throughout\nthis paper, the de Donder gauge, in which the linearized Einstein equations reduce to a\nhyperbolic form.\n7\n\n\f2.1\n\nde Donder gauge\n\nThe de Donder gauge condition for a perturbation γ is ∇a γ ab = 0, where the standard\ntrace-reverse operation (see e.g., [48, Ch. 7.5]) is defined by γ ab := γab − 21 gab γ and satisfies\nγ = −γ and γ ab = γab . Note that for symmetric perturbations there is no ambiguity in\nwriting ∇ * γ for ∇a γab , and we will often do so.\nTo any rank (0, 2) symmetric tensor, not necessarily a solution to (2.3), there is a\ngauge equivalent rank (0, 2) symmetric tensor that satisfies the de Donder gauge condition.\n(Actually symmetry is not required in the proof.) Before stating this theorem we consider\nthe following lemma concerning pure gauge perturbations.\nLemma 2.1 For any w ∈ C ∞ (T01 (M)), on a cosmological vacuum background spacetime,\nwe have\n∇ * £w g = (\u0003 + Λ)(w)♭ .\n(2.19)\nProof. By the definition of trace-reversal, (£w g)ab = ∇a wb + ∇b wa − gab ∇c w c . Taking\nthe divergence of this gives\n∇a (£w g)ab = ∇a ∇a wb + ∇a ∇b wa − ∇b ∇c wc .\n\n(2.20)\n\nUsing (2.2) we have ∇a ∇b wa = ∇b ∇a wa + Λwb and hence the desired result.\nTheorem 2.2 The space T (M) may be decomposed as\nT (M) = T dD (M) + G (M),\n\n(2.21)\n\nwhere T dD (M) = {γ ∈ T (M) | ∇a γ ab = 0}. The intersection G dD (M) = T dD (M) ∩\nG (M) is given by\n∞\nG dD (M) = {£w g | w ∈ CSC\n(T01 (M)), (\u0003 + Λ)w = 0}.\n\n(2.22)\n\n∞\nProof. Given γ ∈ T (M) let γ ′ = γ + £w g for an arbitrary w ∈ CSC\n(T01 (M)). Taking\nthe divergence of the trace-reversal of this and using Lemma 2.1 gives\n\n∇a γ ′ab = ∇a γ ab + (\u0003 + Λ)wb .\n\n(2.23)\n\nTherefore γ ′ ∈ T dD (M) if and only if w obeys\n(\u0003 + Λ)w b = −∇a γ ab .\n\n(2.24)\n\nApplying standard results for hyperbolic equations, such as [6, Thm 3.2.11] (generalized\nto permit non-compactly supported source terms as in Corollary 5 in [5, Ch. 3]), there is a\nunique solution to (2.24) with initial data w|Σ and ∇n w|Σ that are smooth and compactly\nsupported (we take them identically vanishing) on a smooth spacelike Cauchy surface Σ\n\n8\n\n\fwith future-pointing unit normal vector n. The solution is smooth and spacelike-compact.b\nHence γ ′ −γ ∈ G (M), which gives the splitting (2.21). The final statement follows easily.\nRemark. From the proof, it is clear that the vector field w may be chosen to have support\ncontained in the future (or past) of any given spacelike Cauchy surface. The space G dD (M)\nspecifies the residual gauge freedom within the de Donder class.\nLinearity of the equation of motion combined with the previous theorem gives:\nCorollary 2.3 The space S (M) decomposes as\nS (M) = S dD (M) + G (M),\n\n(2.25)\n\nwhere S dD (M) = {γ ∈ T dD (M) | Lab (γ) = 0} is the space of de Donder gauge solutions.\nMoreover, S dD (M) ∩ G (M) = G dD (M).\nNext, we define a partial differential operator\nPab cd := \u0003δ ca δ db − 2Rcabd ,\n\n(2.26)\n\nwhich is of the type considered by Lichnerowicz in [36] (see equation (10.4) of that reference). We now note some important identities concerning this operator.\nLemma 2.4 On a cosmological vacuum background spacetime, P commutes with trace\nreversal. In particular, P (γ) = 0 if and only if P (γ) = 0.\nProof. We compute\n1\n(\u0003δ ca δ db − 2Rcabd )fcd = (\u0003δ ca δ db − 2Rcabd )fcd − gab (\u0003f + 2Λf )\n2\n1\n1\nc d\n= \u0003(fab − gab f ) − 2R ab (fcd − gcd f )\n2\n2\n\n(2.27)\n\nby using the identities gab g ef Rcefd fcd = −gab Rcd fcd = −Λgab f and gcd Rcabd f = −Rab f =\n−Λgab f = gab g ef Rcefd fcd , which hold in cosmological vacuum spacetimes.\nTheorem 2.5 For any γ ∈ C ∞ (S20 (M)), on a cosmological vacuum background spacetime,\n2Lab (γ) = −Pab cd γ cd + (£(∇*γ)♯ g)ab\n\n(2.28)\n\n2Lab (γ) = −Pab cd γab + (£(∇*γ)♯ g)ab .\n\n(2.29)\n\nor equivalently\nb\n\nHere we use the fact that γ has spacelike-compact support, which is not obviously the same as having\nsupport that has compact intersection with each Cauchy surface. After this paper was completed, and\nprompted by this concern, Sanders has shown that they are equivalent [44].\n\n9\n\n\fProof. The Lie derivative term is\n1\n(£(∇*γ)♯ g)ab = ∇a ∇c γcb + ∇b ∇c γca − ∇a ∇b γ − gab (∇d ∇c γcd − \u0003γ).\n2\nc\nc\nc d\nOne may show, using (2.2), that ∇a ∇ γbc = ∇ ∇a γbc − Λγab − R ab γcd and so\n\n(2.30)\n\n(£(∇*γ)♯ g)ab = ∇c ∇a γbc + ∇c ∇b γac − 2Λγab − 2Rcabd γcd − ∇a ∇b γ\n1\n− gab (∇d ∇c γcd − \u0003γ).\n(2.31)\n2\nThe P (γ) term is\n1\n− Pab cd γ cd = −\u0003γab + gab \u0003γ + 2Rcabd γcd + Λgab γ.\n(2.32)\n2\nCombine (2.31) and (2.32) and then compare with (2.5). The second identity follows from\nthe first by using Lemma 2.4.\n\nTherefore, for linearized gravity solutions on cosmological vacuum spacetimes that satisfy the de Donder condition ∇ * γ = 0, the equation of motion (2.4) reduces to\nPab cd γ cd = \u0003γ ab − 2Rcabd γ cd = 0,\n\n(2.33)\n\n\u0003γab − 2Rcabd γcd = 0.\n\n(2.34)\n\nor equivalently, by Lemma 2.4,\n\nFor future reference, we note the following identity.\n\nLemma 2.6 For any γ ∈ C ∞ (T20 (M)), on a cosmological vacuum background spacetime,\n∇a (Pab cd γcd ) = (\u0003 + Λ)∇a γab .\n\n(2.35)\n\n∇a (Pab cd γcd) = ∇a \u0003γab − 2(∇a Rcabd )γcd − 2Rcabd ∇a γcd .\n\n(2.36)\n\n∇a (Pab cd γcd) = ∇a \u0003γab − 2Rcabd ∇a γcd .\n\n(2.37)\n\n∇a \u0003γab = \u0003∇a γab + Λ∇a γab + 2Radbc ∇d γac\n\n(2.38)\n\nProof. Expanding out the left-hand side of (2.35) gives\n\nSubstituting (2.2) into the contracted Bianchi identity ∇a Rbcda + ∇b Rcd − ∇c Rbd = 0 gives\n∇a Rbcda = 0 and hence\nBy using the Riemann tensor identity (1.1) and the restriction to cosmological vacuum\nspacetimes (2.2) one can show that\nand hence the result.\n\nIt follows that if γ is any solution to (2.34), its divergence, and the divergence of its\ntrace reverse, obey\n(\u0003 + Λ)(∇a γab ) = (\u0003 + Λ)(∇a γ ab ) = 0.\n(2.39)\nIn addition, we see directly from (2.34) that its trace obeys\n(\u0003 + 2Λ)γ = 0.\nIn deriving equations (2.33), (2.34), (2.39) and (2.40), the result (2.2) was used.\n10\n\n(2.40)\n\n\f2.2\n\nTransverse-traceless gauge\n\nMany discussions of linearized gravity employ the transverse-traceless (TT) gauge, ∇a γab =\n0 and γ = 0, which is de Donder gauge with the additional constraint of vanishing trace.\nInspecting the proof of Theorem 2.2, we see that γ ∈ T (M) can be put into the TT gauge\nif and only if the system\n1\n∇a w a = − γ\n2\n\n(\u0003 + Λ)w a = 0,\n\n(2.41)\n\n∞\ncan be solved for w ∈ CSC\n(T01 (M)). It turns out that for vacuum spacetimes with a\nnon-vanishing cosmological constant (e.g. de Sitter) this may be achieved at least when γ\nsolves the linearized Einstein equation.\n\nTheorem 2.7 For cosmological vacuum spacetimes with Λ 6= 0 one may perform the following decomposition of the space of spacelike-compact solutions:\nS (M) = S T T (M) + G (M).\n\n(2.42)\n\nAs this is a departure from our main theme, the details are relegated to Appendix A.\nBy contrast, for vacuum spacetimes with a vanishing cosmological constant we find that\nthere is a cohomological obstruction to the solution of (2.41): it is possible if and only if\nthe trace of the solution γ obeys\nZ\n∇n γ dΣ = 0\n(2.43)\nΣ\n\non some (and hence all) Cauchy surfaces. To some extent this problem arises because we\nonly consider spacelike-compact perturbations. If this restriction is dropped and Σ is noncompact, then the TT gauge can also be achieved for Λ = 0, as is the case in Minkowski\nspace.\n\n2.3\n\nSynchronous gauge\n\nThe synchronous gauge is defined relative to a spacelike Cauchy surface Σ by the condition\nna γab = 0, where n is the future-pointing unit normal vector to Σ. Here, we describe how\none can make a gauge transformation to put any solution into the synchronous gauge near\na Cauchy surface. The result is similar to [4, Lem. 1.1], which shows that this can be done\non a Cauchy surface; our result is therefore slightly more general and our proof treats the\nsolution of various equations arising in detail.\nBefore we state the theorem we recall some definitions. Given a submanifold S ⊂ M,\nthe normal exponential map exp⊥ is the restriction of the exponential map to the normal\nbundle of S; therefore all the geodesics arising from this map will meet S orthogonally. A\nnormal neighbourhood of S is a neighbourhood of S that is diffeomorphic under exp⊥ to a\nconnected neighbourhood of the zero section in the normal bundle of S. In particular, on\nany normal neighbourhood O of Σ there is a unique future-pointing, geodesic, hypersurface\northogonal, unit vector field that we call the normal field of Σ in O.\n11\n\n\fTheorem 2.8 Let Σ be a smooth spacelike Cauchy surface with future-pointing unit normal\nvector n. Let O be any open normal neighbourhood of Σ, whose closure is contained in\nanother normal neighbourhood of Σ. Then\nsynch\n(M) + G (M),\nT (M) = TΣ,O\n\n(2.44)\n\nsynch\nwhere TΣ,O\n(M) = {γ ∈ T (M) | ña γab = 0 on O} and ñ is the normal field of Σ in O.\nIn particular, na γab = 0 holds on Σ.\n\nRemarks. Σ has normal neighbourhoods by [42, Prop. 7.26]. Given any such normal neighbourhood, we may restrict to a smaller normal neighbourhood whose closure is contained\nin the original. Therefore the existence of O in the hypothesis is not restrictive.\nProof of Theorem 2.8. Let γ ∈ T (M) be arbitrary. Then the condition γ + £w g ∈\nsynch\nTΣ,O\n(M) amounts to the equations\n1\n∇ñ W0 = − ña ñb γab\n2\n\n1\n(∇ñ wk )b − wka ∇b ña = −ña γab − ∇b W0 − ña ñc γac ñb ,\n2\n\n(2.45)\n(2.46)\n\nwhere W0 = ña wa and w k = w + W0 ñ♭ .\nThe first step is to obtain a solution W0 to (2.45) on O. This can be achieved as\nfollows. Through each point p ∈ Σ we have a unit speed normal geodesic λp : I → O with\n0 ∈ I ⊂ R and λp (0) = p. Equation (2.45) can be integrated along λp to give a solution\n1\n(W0 ◦ λp )(t) = −\n2\n\nZ\n\nt\n0\n\n(ña ñb γab ◦ λp )(s)ds\n\n(2.47)\n\nand we define the scalar function W0 at any q ∈ O by W0 (q) := (W0 ◦ λpq )(tq ), where pq\nand tq are uniquely determined by q = λpq (tq ). This satisfies (2.45) by definition. It is\nsmooth on O because tq and pq vary smoothly with q under the normal exponential map,\nwhich is a diffeomorphism on O, and ña ñb γab is smooth by assumption.\nNow, to obtain w k on O we solve (2.46) locally within a neighbourhood of each geodesic\nand then patch together the results with a partition of unity. For each q ∈ Σ, let Nq ⊂ Σ be\nan open normal neighbourhood of q. Hence on Nq we have well-defined normal coordinates\nxi (i = 1, 2, 3) based at q and associated basis vector fields ei . Now, for each q ∈ Σ let Mq\nbe the open set of points in O connected to Σ by geodesics emanating normally from Nq .\nThe sets Mq , for q ∈ Σ, form an open cover for O because it is a normal neighbourhood.\nWithin each Mq we can introduce Gaussian normal coordinates given by: the proper time\nt along the geodesics, with t = 0 on Σ, and the normal coordinates xi mentioned above.\nIn these coordinates, (2.46) becomes\nd(wk )i (t, x)\n∂W0 (t, x)\n− 2Γji0 (t, x)(wk )j (t, x) = −γ0i −\n.\ndt\n∂xi\n12\n\n(2.48)\n\n\fThis system can be solved using standard results (see, e.g., [47, Sec. 1.6]) to give w k on\nMq , where we have also used that (wk )0 = 0 in these coordinates. This process is repeated\non each Mq for all q ∈ Σ.\nAs Σ is an embedded submanifold of M, it will also be second-countable and Hausdorff.\nTherefore by [50, Thm 1.11], the open cover {Nq | q ∈ Σ} of Σ by normal neighbourhoods\nwill admit a countable partition of unity {χλ | λ ∈ I} subordinate to the cover with supp χλ\ncompact for each λ ∈ I. Hence, for each λ ∈ I there exists a q ∈ Σ such that supp χλ ⊂ Nq .\nTo obtain a suitable partition of unity χ̃λ on the Mq 's, we solve ∇ñ χ̃λ = 0 with χ̃λ |Σ = χλ\nby integrating along integral curves of ñ as before.\nTherefore the w k that we seek on O is given by\nX\nχ̃λ w λk ,\n(2.49)\nwk =\nλ\n\nwhere each wλk is the solution to (2.48) on the set Mq that contains χ̃λ . Observe that\n(2.49) satisfies (2.46) on O by the properties of χ̃λ .\nIn conjunction with W0 this will give the w on O to transform to the synchronous\ngauge. We now examine the support properties of w. Outside supp γ, (2.45) reduces to\n∇n W0 = 0 and so W0 = constant along each normal geodesic emanating from Σ, as long\nas the geodesic does not enter supp γ. Choosing W0 |Σ = 0 yields W0 = 0 on every geodesic\nthat does not intersect supp γ; hence W0 |O is spacelike-compact. Using this means that\noutside supp γ equation (2.46) reduces to (∇ñ wk )b − wka ∇b ña = 0; in Gaussian normal\ncoordinates, the right-hand side of (2.48) vanishes. Thus with wk |Σ = 0, the solution wki\nvanishes in every Mq that does not intersect supp γ, so w|O is spacelike-compact. Outside\nO we let w smoothly decay to zero. Hence w may be chosen to be compactly supported\nand therefore £w g ∈ G (M).\n\n3\n\nExistence and Uniqueness of solutions\n\nWe will now prove existence and uniqueness up to gauge of solutions to the non-hyperbolic\nequation (2.4), and show how Green's operators of the de Donder hyperbolic equation\n(2.34) are related to linearized gravity solutions.\n\n3.1\n\nExistence\n\nLet Σ be a smooth spacelike Cauchy surface with unit future-pointing normal vector n.\nThe Cauchy data mapc DataΣ : C ∞ (T20 (M)) → C ∞ ((T20 (M)|Σ ) ⊕ C ∞ ((T20 (M)|Σ ) is defined\nby\nDataΣ (γ) := (γ|Σ , ∇n γ|Σ ).\n(3.1)\nOur aim is to solve the equation Lab (γ) = 0 subject to given DataΣ (γ). As is well known,\nthis cannot be achieved for arbitrary data, because the components Lab (γ)nb |Σ do not\nc\n\nThe notation T20 (M )|Σ means the restriction of rank (0, 2) tensor fields on M to the surface Σ.\n\n13\n\n\finvolve second time-derivatives of γ and are therefore completely determined by the initial\ndata. Put more formally, there is a constraint map C Σ : C ∞ ((T20 (M)|Σ )⊕C ∞ ((T20 (M)|Σ ) →\nC ∞ (T10 (M)|Σ ), so that\nC Σ (γ|Σ , ∇n γ|Σ ) := na Lab (γ)|Σ\n(3.2)\nand the Cauchy data must be restricted to the kernel of C Σ . The precise form of the linear\nmap C Σ will not be needed here. We observe that gauge invariance of Lab entails that\nC Σ ◦ DataΣ is also gauge invariant.\n\nTheorem 3.1 Let Σ be a smooth spacelike Cauchy surface with future-pointing unit normal\nvector n. For any initial data ζ, ξ ∈ C0∞ (S20 (M)|Σ ) satisfying the initial value constraint\nC Σ (ζ, ξ) = 0 there exists a solution γ ∈ T (M) to (2.4) such that DataΣ (γ) = (ζ, ξ).\nProof. The proof is broken into two steps. First, we make a gauge transformation that\nputs the initial data into the de Donder gauge on Σ. Second, as the initial value problem\nfor (2.34) is well-posed, we obtain a solution with the transformed data, which obeys\nthe de Donder condition globally; it is here that the initial value constraint is vital. By\nTheorem 2.5, the solution will satisfy the linearized Einstein equation (2.4) and so by\nundoing the original gauge transformation we obtain a solution with the original Cauchy\ndata.\nFollowing the structure just set out, we begin by constructing a smooth χ ∈ T (M)\nsuch that DataΣ (χ) = (ζ, ξ). This is accomplished as follows: In a normal neighbourhood\nof Σ, we use parallel transport along geodesics normal to Σ to obtain ζ̃ ∈ T (M) with\nDataΣ (ζ̃) = (ζ, 0). Taking any extension of ξ in T (M), we form χ = ζ̃ + sξ, where s\nis determined uniquely at each point p of the normal neighbourhood by the requirement\np = expq sn|q for some q ∈ Σ. By extending smoothly, we obtain χ ∈ T (M) with the\nrequired properties.\n∞\nUsing the splitting of Theorem 2.2 there exists w ∈ CSC\n(T01 (M)) such that γ̃ = χ+£w g\nobeys the de Donder condition ∇a γ̃ ab = 0 and\n(γ̃ab − 2∇(a wb) )|Σ = χab |Σ = ζab\nn ∇c (γ̃ab − 2∇(a wb) )|Σ = nc ∇c χab |Σ = ξab .\nc\n\n(3.3)\n\nPassing to the second step, let γ̂ ∈ T (M) be the (unique) solution to the hyperbolic\nequation \u0003γ̂ab − 2Rcabd γ̂cd = 0 with initial data DataΣ (γ̂) = DataΣ (γ̃). The existence and\nuniqueness of γ̂ follows from [6, Thm 3.2.11].\nThe key point is now to show that γ̂ obeys the de Donder condition globally. As γ̂ obeys\n(2.34) then by Lemma 2.6, ∇a γ̂ ab obeys the hyperbolic equation (2.39); it also vanishes on\nΣ because ∇a γ̂ ab |Σ = ∇a γ̃ ab |Σ = 0. The following identity is now required.\nLemma 3.2 On a cosmological vacuum background spacetime, for any solution γ̂ to (2.34),\nit holds that nc ∇c (∇a γ̂ ab )|Σ = 2Lab (γ̂)na |Σ .\n\n14\n\n\fProof. Combining the hypothesis with Lemma 2.4 and using Theorem 2.5 gives 2Lab (γ̂) =\n(£(∇*γ̂)♯ g)ab . Contracting with n and expanding the right-hand side gives\n2Lab (γ̂)na = na ∇a ∇c γ̂ cb + na ∇b ∇c γ̂ ca − nb ∇d ∇c γ̂ cd .\n\n(3.4)\n\nThe metric may be written in terms of the normal vector n and a projection operator\n(see [31, Ch. 2.7]), so that gab = −na nb + qab . This allows one to split a vector into its\ncomponents normal and tangential to Σ. Using that ∇a γ̂ ab |Σ = 0 and na na = −1 one finds\nthat\n2Lab (γ̂)na |Σ = nc ∇c (∇a γ̂ ab )|Σ .\n(3.5)\nAs stated immediately prior to Theorem 3.1, the constraints are gauge invariant and\nso we have the following chain of equalities\nLab (γ̂)na |Σ = C Σ (DataΣ (γ̂)) = C Σ (DataΣ (γ̃)) = C Σ (DataΣ (χ)) = 0\n\n(3.6)\n\nand thus nc ∇c (∇a γ̂ ab )|Σ = 0.\nAccordingly, we have shown that ∇a γ̂ ab obeys a hyperbolic equation with vanishing\ninitial data on Σ; it therefore vanishes globally in M by [6, Cor. 3.2.4]. Thus, γ̂ solves\n(2.34) and satisfies the de Donder condition, so γ̂ ∈ S dD (M). By undoing the original\ngauge transformation, we obtain a solution γ = γ̂ −£w g to the linearized Einstein equation\n(2.5), which obeys DataΣ (γ) = (ζ, ξ) by virtue of (3.3).\n\n3.2\n\nUniqueness\n\nGiven any initial data satisfying the constraints then by Theorem 3.1 there exists a solution\nto the linearized Einstein equation. However, as the next theorem shows, this solution is\nonly unique up to gauge equivalence.\nTheorem 3.3 Suppose γ, γ ′ ∈ S (M) with DataΣ (γ) = DataΣ (γ ′ ) on some spacelike\nCauchy surface Σ. Then γ = γ ′ + £w g, also written as γ ∼ γ ′ . If, additionally, γ, γ ′ ∈\nS dD (M) then gauge equivalence is replaced by equality.\nProof. Let ξ = γ − γ ′ which satisfies DataΣ (ξ) = 0. By Theorem 2.2 we may write\nb\n∞\nγ̃ = ξ + £w g where γ̃ ∈ S dD (M) and w ∈ CSC\n(T01 (M)) obeys (\u0003 + Λ)w b = −∇a ξ a .\nChoose initial data, w|Σ = 0 and ∇n w|Σ = 0. Therefore DataΣ (γ̃) is given by\nγ̃ab |Σ = (∇a wb + ∇b wa )|Σ = 0\nn ∇c γ̃ab |Σ = nc ∇c (∇a wb + ∇b wa )|Σ .\nc\n\n(3.7)\n(3.8)\n\nIn fact nc ∇c γ̃ab |Σ also vanishes, as we will now show. Firstly, by the choice of data we know\nthat ∇a wb |Σ = 0 and therefore any derivative of this taken tangentially to Σ will vanish.\nNext, using the Riemann tensor identity (1.1) and the conditions on w at Σ, we have\nnc ∇c ∇a wb |Σ = ∇a (nc ∇c wb )|Σ − (∇a nc )∇c wb |Σ + nc Rcabd wd |Σ\nc\n\nd\n\nc\n\n= ∇a (n ∇c wb )|Σ = −na n ∇d (n ∇c wb )|Σ .\n15\n\n(3.9)\n(3.10)\n\n\fAs DataΣ (ξ) = 0, we have (\u0003+Λ)w|Σ = −∇*ξ|Σ = 0. Expanding, using gab = −na nb +qab ,\nna ∇a (nc ∇c w b)|Σ = q ac ∇a ∇c w b|Σ + (na ∇a nc )∇c w b |Σ + Λw b |Σ = 0.\n\n(3.11)\n\nTherefore nc ∇c ∇a wb |Σ = 0 and hence by (3.8), nc ∇c γ̃ab |Σ vanishes. As γ̃ satisfies the hyperbolic equation (2.34) with vanishing Cauchy data, it vanishes globally by [6, Cor. 3.2.4].\nThus ξ ∼ 0 and hence γ ∼ γ ′ .\nIf both of the solutions γ and γ ′ are de Donder with the same initial data then they\nmust coincide because they solve the hyperbolic equation (2.34) with identical data.\n\n3.3\n\nGreen's operators\n\nAny de Donder solution satisfies the two equivalent hyperbolic wave equations (2.33) and\n(2.34). By the results of [6, Ch. 1.5], the differential operator P (defined in equation (2.26))\nis a normally hyperbolic operator and therefore, by [6, Cor. 3.4.3], admits unique advanced (−) and retarded (+) Green's operators E ± : C0∞ (T20 (M)) → C ∞ (T20 (M)), whose\naction on test tensors we can write as\nZ\n′ ′\n± c′ d′\n(E ab fc′ d′ )(x) =\nE ±ab c d (x, x′ )fc′ d′ (x′ )dvol(x′ ),\n(3.12)\nM\n\nwhere f ∈ C0∞ (T20 (M)). The operators E ± satisfy P (E ± f ) = E ± P (f ) = f for all\nf ∈ C0∞ (T20 (M)), and have the support properties supp(E ± f ) ⊂ J ± (supp f ); moreover\nγ ± = E ± f is the unique solution to P (γ ± ) = f with support that is compact to the\npast (+)/future (−) (for the uniqueness of the Cauchy problem see [6, Thm 3.2.11]). The\nadvanced-minus-retarded solution operator is defined to be E := E − − E + . Analogous\nproperties hold for all normally hyperbolic operators. Any solution to (2.34) may be written\nin terms of E as the next lemma shows.\nLemma 3.4 Any γ ∈ T (M) solving P (γ) = 0 may be written as γ = Ef with f ∈\nC0∞ (S20 (M)).\nProof. See [6, Thm 3.4.7].\nThe preceding lemma concerns general solutions to the hyperbolic equation (2.34), however, as we are looking for solutions to linearized gravity we are interested more particularly\nin those solutions satisfying the de Donder condition, ∇ * γ = 0. Before showing when such\na solution will be de Donder, we first require the following lemma.\nLemma 3.5 For all f ∈ C0∞ (T20 (M)), we have Ef = Ef .\nProof. γ̃ ± = E ± f are the unique solutions to P (γ̃ ± ) = f with support in J ± (supp f )\nand γ ± = E ± f are the unique solutions to P (γ ± ) = f with support in J ± (supp f ). Since\ntrace-reversal commutes with P (Lemma 2.4) we have\nP (E ± f ) = f = P (E ± f ) = P (E ± f ).\n16\n\n(3.13)\n\n\fFor any k ∈ C0∞ (T20 (M)) one may show that supp k = supp k and hence J ± (supp k) =\nJ ± (supp k). Therefore by uniqueness (from the support properties) E ± f = E ± f and so\nEf = Ef .\nTheorem 3.6 For any f ∈ C0∞ (S20 (M)), we have Ef ∈ S dD (M) if and only if ∇ * f ∈\n(\u0003 + Λ)C0∞ (T10 (M)).\nProof. By definition, Ef ∈ S dD (M) if and only if ∇ * Ef ≡ 0 or equivalently, using\nLemma 3.5, ∇ * Ef = 0. Taking the divergence of P (E ± f ) = f and utilising Lemma 2.6,\nwe find that\n(\u0003 + Λ)(∇ * E ± f ) = ∇ * f\n(3.14)\n±\n\n±\n\nand deduce that ∇ * E ± f = Ê ∇ * f , where Ê are the advanced and retarded Green's\noperators for (\u0003+ Λ) on covector fields. Hence Ê∇ * f = ∇ * Ef = 0 and by [6, Thm 3.4.7],\nthis holds if and only if ∇ * f ∈ (\u0003 + Λ)C0∞ (T10 (M)).\n\nWe now prove an identity concerning the action of P on a pure gauge perturbation and\nthen, using this, prove the relationship between E and the Lie-derivative.\nLemma 3.7 Given a w ∈ C ∞ (T01 (M)) on a cosmological vacuum background spacetime,\nthen\n£(\u0003+Λ)w g = P (£w g).\n(3.15)\nProof. Expanding out the left-hand side of (3.15) gives\n(£(\u0003+Λ)w g)ab = 2∇(a \u0003wb) + 2Λ∇(a wb) .\n\n(3.16)\n\nOne can show, using the Riemann tensor identity (1.1), the Leibniz rule and (2.2), that\n∇a \u0003wb = \u0003(∇a wb ) − Λ∇a wb + 2Rac bd ∇c wd + wd ∇c Racbd .\n\n(3.17)\n\nWe know from the proof of Lemma 2.6 that ∇a Rbcda = 0 on cosmological vacuum background spacetimes and therefore we have\n∇a \u0003wb = \u0003(∇a wb ) − Λ∇a wb + 2Racbd ∇c wd .\n\n(3.18)\n\nCombining this with (3.16) gives the final result.\nLemma 3.8 Given a v ∈ C0∞ (T01 (M)) on a cosmological vacuum background spacetime,\nthen\n£Ẽv g = E(£v g),\n(3.19)\n±\n\nwhere Ẽ are the advanced and retarded Green's operators for (\u0003 + Λ) on vector fields.\nProof. Using Lemma 3.7, P (£Ẽ ± v g) = £(\u0003+Λ)Ẽ ± v g = £v g. Thus £Ẽ ± v g = E ± £v g and\nthe result follows by uniqueness of solutions with past/future-compact support.\nWe are now able to prove the main result of this subsection.\n17\n\n\fTheorem 3.9 Any γ ∈ S (M) is gauge equivalent to a Ef for some f ∈ C0∞ (S20 (M))\nsatisfying ∇ * f = 0.\nProof. Combining Corollary 2.3, Lemma 3.4 and Theorem 3.6 gives γ ∼ E f̃ with ∇ * f̃ =\n(\u0003 + Λ)v ♭ for some v ∈ C0∞ (T01 (M)). Thus we also have γ ∼ E f̃ − £Ẽv g = E(f̃ − £v g),\nby Lemma 3.8. Set f := f̃ − £v g, which is smooth and compactly supported on M.\nCalculating the divergence of the trace-reversal of f gives\n∇ * f = ∇ * f̃ − ∇ * (£v g) = (\u0003 + Λ)v ♭ − (\u0003 + Λ)v ♭ = 0\n\n(3.20)\n\nusing Lemma 2.1.\nThe remaining lemmas of this subsection are used in section 4.4. We will require the\nnotion of past/future compactness of a subset of spacetime. A subset S ⊂ M is said to be\npast/future compact if J − (p) ∩ S or J + (p) ∩ S is compact for all p ∈ M.\nLemma 3.10 Given f ∈ C0∞ (S20 (M)), if γ ∈ T (M) solves Lab (γ) = fab with supp γ\ncompact to the past/future then γ ∼ −2E ± f .\nProof. By Theorem 2.2 (and the remark thereafter) there exists a w ∈ C ∞ (T01 (M)) with\nsupport compact to the past/future such that γ ′ = γ + £w g obeys ∇ * γ ′ = 0. Using\nthat Lab (£w g) = 0 we have Lab (γ ′ ) = Lab (γ) = fab , which simplifies, on account of the de\nDonder condition in conjunction with Theorem 2.5, to P (γ ′ ) = −2f . The solutions, to this\ninhomogeneous equation, with past/future compact support are γ ′ = −2E ± f . Lemma 3.5\nentails that γ ′ = −2E ± f . Undoing the gauge transformation gives the required result.\nLemma 3.11 Given a f ∈ C0∞ (S20 (M)) satisfying ∇ * f = 0, suppose that Ef = E£v g\nfor some v ∈ C0∞ (T01 (M)). Then there exists h ∈ C0∞ (S20 (M)) such that\nf = −2L(h).\n\n(3.21)\n\nProof. E(f − £v g) = 0 and so by [6, Thm 3.4.7]\nf = £v g + P (h)\n\n(3.22)\n\nfor some h ∈ C0∞ (S20 (M)). But for divergence-free f , an application of Lemmas 2.1 and 2.6\ngives (\u0003 + Λ)(v ♭ + ∇ * h) = 0 and hence v ♭ = −∇ * h. Reinserting this in (3.22), tracereversing and applying Theorem 2.5 gives the result.\n\n4\n4.1\n\nPhase Space and Quantization\nPhase Space\n\nWe now construct the (complexified) phase space for linearized gravity on cosmological\nvacuum background spacetimes. Initially we consider the space S (M), which by the\n18\n\n\fresults of [35] (equation (2.21) and onwards in that reference, though our conventions differ)\napplied to the Lagrangian (2.6), can be endowed with a complex-bilinear pre-symplectic\nproduct, whose action on perturbations γ 1 , γ 2 ∈ S (M) is\nZ\n1\n2\n1 ab\n2 ab\nωΣ (γ , γ ) =\n(γab\nπ2 − γab\nπ1 )dvolh ,\n(4.1)\nΣ\n\nwhere Σ is a spacelike Cauchy surface with future-pointing unit normal vector n, dvolh\ndenotes the volume element on Σ associated with the induced spatial metric h and π is\ndefined in terms of the covariant conjugate momentum Π, given in (2.10), by\nπ ab := −nc Πcab .\n\n(4.2)\n\n(Note that nc is past-pointing as a covector, owing to our signature convention.) The\nproduct (4.1) is independent of the choice of Cauchy surface.\nLemma 4.1 Given γ 1 , γ 2 ∈ S (M) and two spacelike Cauchy surfaces Σ, Σ′ then ωΣ (γ 1 , γ 2 ) =\nωΣ′ (γ 1 , γ 2 ).\n2\n1\ncab\nProof. Defining the current of γ 1 and γ 2 to be j c (γ 1 , γ 2 ) := γab\nΠcab\n1 − γab Π2 , the presymplectic product of these perturbations is thus\nZ\n1\n2\nωΣ (γ , γ ) =\nnc j c (γ 1 , γ 2 )dvolh .\n(4.3)\nΣ\n\nc\n\n2 ab\n1 ab\nNow, the divergence of the current is ∇c j = γab\nL (γ 1 ) − γab\nL (γ 2 ) = 0, where we have\nused (2.12) and symmetry properties of S abcd and T abcdef . Using the divergence theorem\nover the region bounded by the two Cauchy surfaces Σ, Σ′ gives the desired result.\n\nDue to the preceding lemma, the Σ will be dropped from ωΣ from this point on if we\nare dealing purely with solutions.\nTo make the pre-symplectic product into a symplectic product, it is necessary to account\nfor the degeneracies of (4.1), that is, non-trivial solutions whose pre-symplectic product\nwith all solutions is zero. The subspace of degeneracies is also known as the radical of the\npre-symplectic form ω. The next lemma shows that ω is gauge invariant and therefore (as\nis well-known) pure gauge solutions are degeneracies on the space of solutions. Here, we\nwork with the broader class of pure gauge solutions Gˆ(M) defined in (2.18); that is, those\nspacelike-compact pure gauge solutions induced by arbitrary smooth vector fields. Recall\nthat Gˆ(M) coincides with G (M) if M has compact Cauchy surfaces, but the two can (but\ndo not always) differ in the non-compact case.\nLemma 4.2 Gˆ(M) is contained in the radical of ω.\nProof. Suppose w ∈ C ∞ (T01 (M)) and γ ∈ S (M), and let Σ be a smooth spacelike\nCauchy surface. From Theorem C.1 we have the identity\nZ\nωΣ (γ, £w g) = 2 w b CbΣ (DataΣ (γ))dvolh\n(4.4)\nΣ\n\n19\n\n\fand the right-hand side vanishes because C Σ (DataΣ (γ)) = 0.\nAt least in the case that M has compact Cauchy surfaces, we may prove that this\nexhausts the space of degeneracies of (4.1). It is natural to conjecture that the same is\ntrue for a large class of background spacetimes with non-compact Cauchy surfaces as well.\nTheorem 4.3 If M has compact Cauchy surfaces, the radical of ω is precisely the subspace\nof pure gauge solutions Gˆ(M) (which coincides with G (M) in this case). That is, given\nγ ′ ∈ S (M) such that ω(γ ′ , γ) = 0 for all γ ∈ S (M), then γ ′ ∈ Gˆ(M).\nThe proof requires results of Moncrief on the ADM formulation, and is given in Appendix B.\nIn any spacetime for which Gˆ(M) is the radical of ω, we obtain the complexified phase\nspace as the quotient space\nP(M) := S (M)/Gˆ(M)\n(4.5)\nwith weakly non-degenerate symplectic product\nZ\n1\n2\n1 ab\n2 ab\nω([γ ], [γ ]) =\n(γab\nπ2 − γab\nπ1 )dvolh .\n\n(4.6)\n\nΣ\n\nAs this is independent of the choice of representative we may choose de Donder representatives γ̃ i (i = 1, 2) for each class, for which the associated momenta are π̃iab = nc D cab [γ̃ i ],\nwhere the differential operator\n1\n1\n1\nD cab [γ] = ∇c γ ab − ∇b γ ca − ∇a γ cb\n2\n2\n2\nhas the property ∇c D cab [γ] = 21 (P γ)ab −Λγ ab for de Donder γ on cosmological background\nspacetimes.\nUnder complex conjugation, ω([γ 1 ], [γ 2 ])∗ = ω([γ 1∗ ], [γ 2∗ ]). The real phase space\nPR (M) is obtained by restricting all the above definitions to real-valued solutions and\nreal-valued gauge transformations.\nWe now wish to find out what the symplectic product is in terms of a de Donder\nresprentative written in terms of the solution operator, as in Theorem 3.6.\nTheorem 4.4 Given γ ∈ S (M) and f ∈ C0∞ (S20 (M)) satisfying ∇ * f = 0, then\nZ\n1\ndD ab\nω([Ef ], [γ]) = −\nγab\nf dvolg ,\n2 M\n\n(4.7)\n\nwhere γ dD denotes a de Donder representative of [γ].\nProof. By Theorem 3.6, Ef is a de Donder solution (and its proof shows that E ± f also\nobey the de Donder condition). If we select a de Donder representative γ dD of [γ] then\nthe left-hand side of (4.7) may be written as\nZ \u0010\n\u0011\ndD cab\nω([Ef ], [γ]) =\n(Ef )ab D cab [γ dD ] − γab\nD [Ef ] nc dvolh\n(4.8)\nΣ\n\n20\n\n\fusing that Ef = Ef = Ef from Lemma 3.5.\nAs supp f is compact we may choose Cauchy surfaces Σ, Σ′ such that Σ ⊂ I + (Σ′ ) and\nsupp f ⊂ I + (Σ′ ) ∩ I − (Σ). The region bounded by these two Cauchy surfaces is henceforth\ndenoted by V . We will utilise the Gauss Theorem applied to the vector field\ndD cab\nv c = γab\nD [E + f ] − (E + f )ab D cab [γ dD ]\n\n(4.9)\n\non the region V to prove the desired result. Using the formula ∇c D cab [γ] = 21 P (γ)ab −Λγ ab ,\napplied to the de Donder perturbations E + f and γ dD , the divergence of v is calculated to\nbe\n1 dD ab\ndD\nf + (∇c γab\n)D cab [E + f ] − (∇c (E + f )ab )D cab [γ dD ]\n∇ * v = γab\n(4.10)\n2\nwhere we have also used the fact that P (γ dD ) = 0 and P (E + f ) = f . Using the de\nDonder condition again, the second and third terms may be seen to cancel and we have\ndD ab\nf . By Gauss' Theorem applied to the region V, where ∂V = Σ ∪ Σ′ and\n∇ * v = 12 γab\nwith n denoting the future-pointing unit normal vector on ∂V , this gives\nZ\nZ\nZ\n1\ndD ab\nc\nγab f dvolg = − nc v dvolh +\nnc v c dvolh\n(4.11)\n2 V\nΣ\nΣ′\nThe integral over Σ′ is zero because E + f and its derivative vanish on Σ′ , so we obtain\nZ\nZ\n\u0011\n\u0010\n1\ndD ab\ndD cab\n(4.12)\nγab f dvolg = − nc γab\nD [E + f ] − (E + f )ab D cab [γ dD ] dvolh .\n2 V\nΣ\nAs E − f and its derivative vanish at Σ we may replace E + by −E and use (4.8) to obtain\nthe final result.\n\n4.2\n\nObservables\n\nObservables are functions on the (complexified) phase space, P(M). As for the scalar [15]\nand electromagnetic fields [16], the observables that will form the basis for the quantum\ntheory\nwill be certain smeared fields. In our case, we wish to consider integrals of the form\nR\nab\nγab f dvolg , where γ ∈ S (M) and f ∈ C0∞ (T20 (M)); however, this will only be gauge\ninvariant, that is, independent of the choice of representative of the equivalence class of γ,\nand thus a well-defined function on P(M), if f is restricted.\nR\nLemma 4.5 For f ∈ C0∞ (T20 (M)), we have M γab f ab dvolg = 0 for all γ ∈ Gˆ(M) if and\nonly if ∇a f(ab) = 0.\nProof. For γ = £w g ∈ Gˆ(M), we have\nZ\nZ\nZ\nab\n(ab)\n(∇(a wb) )f dvolg =\n∇a (wb f )dvolg −\nwb (∇a f (ab) )dvolg\nM\nMZ\nM\nb\na\n=−\nw (∇ f(ab) )dvolg ,\nM\n\n21\n\n(4.13)\n\n\fwhere we moved the symmetrization to f and then used the Leibniz rule and the divergence\ntheorem together with the support properties of f to obtain (4.13). For (4.13) to vanish it is\nclearly sufficient that ∇a f(ab) = 0; as w may, in particular, be any element of C0∞ (T01 (M)),\nnecessity holds as well.\nWe thus arrive at the final definition of observables for our theory.\nDefinition 4.6 For each f ∈ C0∞ (T20 (M)) satisfying ∇a f(ab) = 0 the observable Ff :\nP(M) → C is given by\nZ\nFf ([γ]) =\n\nγab f ab dvolg\n\n(4.14)\n\n(and is necessarily gauge invariant).\n\nThe observables (4.14) satisfy four important relations. The reader who is familiar with\nthe algebraic formulation of the real scalar field might expect that we would only state (iv)\nfor compactly supported f ; the reason for our use of f with time-compact support will\nbecome clear in the next subsection. For (iv), recall that L is defined on arbitrary tensors\nby (6); in particular it vanishes on antisymmetric tensors.\nTheorem 4.7 Given any [γ] ∈ P(M), the Ff 's satisfy:\n(i) Complex linearity: Fαf +β f̃ ([γ]) = αFf ([γ]) + βFf̃ ([γ]) for all α, β ∈ C and all\n′\nf , f ′ ∈ C0∞ (T20 (M)) satisfying ∇a f(ab) = 0 = ∇a f(ab)\n;\n∗\n∗\n∞\n∗\n(ii) Hermiticity: Ff ([γ]) = Ff ([γ ]) for all f ∈ C0 (T20 (M)) satisfying ∇a f(ab) = 0;\n(iii) Symmetry: Ff ([γ]) = 0 for all antisymmetric f ∈ C0∞ (T20 (M));\n(iv) Field equation (2.4) holds: FL(f ) ([γ]) = 0 for all f ∈ CT∞C (T20 (M)) with L(f ) ∈\nC0∞ (S20 (M)).\nProof. (i), (ii), (iii) are obvious, and (iv) holds because Lab is formally self adjoint.\nWe can now give a variant of Theorem 4.4 in which there is no longer any need to\nwork with de Donder representatives. The theorem is proved on the assumption that\nf is symmetric and has vanishing divergence; of course any f whose symmetric part\nis divergenceless may be decomposed into symmetric and antisymmetric parts and the\nantisymmetric part does not contribute to Ff ([γ]) by part (iii) of Theorem 4.7.\nTheorem 4.8 Given [γ] ∈ P(M) and f ∈ C0∞ (S20 (M)) satisfying ∇a fab = 0, then\nZ\nFf ([γ]) =\nγab f ab dvolg = −2ω([Ef ], [γ]).\n(4.15)\nM\n\nProof. As ∇a fab = 0 we can use Theorem 4.4 to give\nZ\n1\nω([Ef ], [γ]) = −\nγ dD f ab dvolg .\n2 M ab\n\n(4.16)\n\nAs f satisfies the requirements of Lemma 4.5 we may replace γ dD by γ and the result\nfollows.\n22\n\n\fThe final two results of this section make use of the weak non-degeneracy of the symplectic product, in contrast to those above. First, we show that there are sufficiently\nmany observables to distinguish points of P(M); by this we mean that given two distinct\nequivalence classes of solutions [γ] and [γ ′ ] then there exists at least one f ∈ C0∞ (T20 (M))\nsatisfying ∇a f(ab) = 0 such that Ff ([γ]) 6= Ff ([γ ′ ]). We are grateful to Atsushi Higuchi for\nraising this question with us.\nTheorem 4.9 Assuming weak non-degeneracy holds [thus, in particular, for any M with\ncompact Cauchy surfaces] then, for any distinct [γ 1 ], [γ 2 ] ∈ P(M), there exists a f ∈\nC0∞ (S20 (M)) with ∇a fab = 0 such that Ff ([γ 1 ]) 6= Ff ([γ 2 ]).\nProof. By weak non-degeneracy there exists a [γ] ∈ P(M) such that\nω([γ], [γ 1 ]) 6= ω([γ], [γ 2 ]).\n\n(4.17)\n\nBy Theorem 3.9, [γ] = [Ef ] for some f ∈ C0∞ (S20 (M)) satisfying ∇ * f = 0. Using\nTheorem 4.8 together with (4.17) gives\nFf ([γ 1 ]) = −2ω([Ef ], [γ 1 ]) 6= −2ω([Ef ], [γ 2 ]) = Ff ([γ 2 ]).\n\n(4.18)\n\nFinally, we compute the Poisson bracket of two observables in our class. Here, we\nregard P(M) as an infinite-dimensional symplectic manifold, with the smooth structure\ndetermined (as a Frölicher space-see, e.g. [34, Ch. 23]) by the symplectic form ω. Thus\na curve c : R → P(M) is defined to be smooth if t 7→ ω(v, c(t)) is smooth for all v and a\nfunction F : P(M) → C is defined to be smooth if F ◦ c is smooth for every smooth curve\nc; in particular, ω itself is a smooth function in each slot separately, and therefore our Ff 's\nare smooth. The Poisson bracket of two smooth functions F, G ∈ C ∞ (P(M)) is given in\nterms of the exterior derivatives of F and G by\n{F, G}([γ]) = dF (IdG)|[γ] ,\n\n(4.19)\n\nwhere the Hamiltionian vector field IdG induced by G satisfies\nω[γ] (IdG|[γ] , v) = dG|[γ] (v)\n\n(4.20)\n\nfor v ∈ T[γ] P(M) (we will show that this is uniquely defined in our context). Here ω[γ] is\nthe symplectic form at [γ] ∈ P(M). Under the identification T[γ] P(M) ∼\n= P(M), ω[γ] is\nreplaced by ω.\nTheorem 4.10 Assuming weak non-degeneracy holds [thus, in particular, if M has compact Cauchy surfaces], the Poisson bracket of two observables satisfying Definition 4.6 is\n{Ff , Ff ′ } = −2E(f s , f ′s ) = 4ω([Ef s ], [Ef ′s ]),\ns\nwhere f s denotes the symmetric part of f [i.e., fab\n= f(ab) ] and\nZ\n′\n′s\ns\nf (ab) (Eabcd f (cd) )dvolg .\nE(f , f ) :=\nM\n\n23\n\n(4.21)\n\n(4.22)\n\n\fProof. We note that dFf |[γ] ([γ ′ ]) = Ff ([γ ′ ]) by linearity of Ff . Thus, upon using (4.20)\nand then Theorem 4.8 we have\nω(IdFf |[γ] , [γ]) = Ff ([γ]) = Ff s ([γ]) = −2ω([Ef s ], [γ]).\n\n(4.23)\n\nBy weak non-degeneracy, this gives IdFf = −2[Ef s ] and thus\n{Ff , Ff ′ }([γ]) = −dFf |[γ] (2[Ef ′s ]) = −2Ff ([Ef ′s ]) = −2Ff s ([Ef ′s ])\n= −2E(f s , f ′s ).\n\n(4.24)\n\nFinally, we use Theorem 4.8 to obtain the final equality in (4.21) .\nAlthough superficially they do not appear the same, in fact the propagator 2E(f s , f ′s )\nis the same as the one considered by Lichnerowicz in equation (21.3) of [36]. If one expands\nout the trace-reversal then\n{Ff , Ff ′ } = −2E(f s , f ′s ) = −2E(f s , f ′s ) + E(f, f ′ ),\n\n(4.25)\n\nwhere f = fa a denotes the trace of f ; note the appearance of the scalar propagator E in\nthe last term of this equation.\n\n4.3\n\nReformulation of the phase space\n\nIn the next subsection we will apply Dirac quantization to the observables discussed above\nto obtain a ∗-algebra of observables. An alternative approach would be to directly quantize\nthe complexified symplectic space P(M) as an infinitesimal Weyl algebra. Similarly, the\nWeyl algebra provides another quantization based directly on the real symplectic space.\n(See, e.g., [19] for a presentation of both constructions emphasizing their functorial nature.)\nTo clarify the relationship between these prescriptions and Dirac quantization, we now show\nthat the observables form a complexified symplectic space, with their Poisson bracket as\nthe symplectic product, that is symplectically isomorphic to P(M).\nLet F (M) be the set of f ∈ C0∞ (S20 (M)) that are divergence-free, i.e., ∇a fab = 0. Then,\nby Theorem 4.7, F : f 7→ Ff is a linear map, intertwining the complex conjugations of\nF (M) and of complex-valued functions on P(M) and whose range coincides with the full\nset of observables in our class. In cases where P(M) is weakly non-degenerate, it is clear\nfrom Theorem 4.8 that the kernel of the map F is precisely the subspace of f ∈ F (M) for\nwhich Ef ∈ Gˆ(M). The next result will characterize this kernel in an attractively simple\nway.\nFor this subsection only, we consider extensions of various Green's operators from\nsmooth compactly supported tensor fields to tensor fields with time-compact support, i.e.,\nthe support lies between two Cauchy surfaces. The retarded/advanced Green's operators\nare extended by defining E ± f for f ∈ CT∞C (T20 (M)) to be the unique solution to P (γ) = f\nthat vanishes to the past/future of the support of f , and we define Ef = E − f − E + f .\n24\n\n\fMany standard results have analogues for these extensions, that follow by the same arguments as the standard versions. In particular, P has trivial kernel in CT∞C (T20 (M)), the\nkernel of the extended operator E is precisely P (CT∞C (T20 (M))) and any smooth solution\nto P (γ) = 0 may be written in the form Ef for some f ∈ CT∞C (T20 (M)). These facts may\nbe summarised in the commutative diagram\n0\n\nCT∞C (T20 (M))\n\nP\n\nCT∞C (T20 (M))\n\nE\n\nC ∞ (T20 (M))\n\nP\n\nC ∞ (T20 (M))\n\n0\n\nC0∞ (T20 (M))\n\nP\n\nC0∞ (T20 (M))\n\nE\n\n∞\nCSC\n(T20 (M))\n\nP\n\n∞\nCSC\n(T20 (M))\n\nin which the upper and lower lines are exact sequences of linear maps and the vertical\narrows are the obvious inclusion maps. The lower line is the content of [6, Thm 3.4.7].\nSimilar results hold for the extension Ẽ of the analogous vector Green's operators.\nMoreover, all the results from section 3.3, concerning the intertwining of the Green's operators with various other operations, in particular Lemma 3.8, carry straight through and\napply to the extensions.\nThe kernel of the map F may now be determined. In the following, L (M) = {L(k) :\nk ∈ C0∞ (S20 (M))}, while Lˆ(M) = {L(k) : k ∈ CT∞C (S20 (M))} ∩ C0∞ (S20 (M)). A consequence of the next result is that Gˆ(M) = G (M) if and only if Lˆ(M) = L (M).\nLemma 4.11 Suppose f ∈ F (M). Then Ef ∈ Gˆ(M) if and only if f ∈ Lˆ(M); similarly, Ef ∈ G (M) if and only if f ∈ L (M).\nProof. (⇒) Suppose Ef = £w g ∈ Gˆ(M). As ∇ * f = 0, £w g is a de Donder solution.\nIn consequence, w satisfies (\u0003 + Λ)w = 0 and may be written as w = Ẽv for some\nv ∈ CT∞C (T01 (M)). Therefore we have £w g = £Ẽv g = E£v g, using (the analogue of)\nLemma 3.8. Thus Ef = E£v g and so\n£v g = f + P (k)\n\n(4.26)\n\nfor some k ∈ CT∞C (S20 (M)). Taking the trace-reversal and then the divergence of this\nequation gives (\u0003+Λ)v ♭ = (\u0003+Λ)∇*k, from which one can deduce, using time-compactness\nof v and ∇ * k, that v ♭ = ∇ * k. Substituting this result into (4.26) and using Theorem 2.5\ngives f = £(∇*k)♯ g − P (k) = 2L(k). Therefore f = L(2k) ∈ Lˆ(M) as required.\n(⇐) Conversely, given k ∈ CT∞C (S20 (M)) satisfying L(2k) = f , let w = Ẽ(∇ * k)♯ ∈\nC ∞ (T01 (M)), which gives £w g = £Ẽ(∇*k)♯ g = E£(∇*k)♯ g, using (the analogue of) Lemma 3.8\nin the final equality. Now by Theorem 2.5 this becomes £w g = E(2L(k) + P (k)) = Ef ,\nbecause EP (k) = 0. As f is compactly supported by assumption, we deduce that\n∞\n£w g ∈ CSC\n(S20 (M)) and hence Ef ∈ Gˆ(M).\nThe second statement has an exactly analogous proof, replacing CT∞C by C0∞ and C ∞\n∞\nby CSC\n, and hatted spaces by their unhatted counterparts throughout.\n25\n\n\fIt follows that the vector space of observables is isomorphic to F (M)/Lˆ(M) if weak\nnon-degeneracy holds.\nProposition 4.12 The map f + Lˆ(M) 7→ [Ef ] is a linear isomorphism of F (M)/Lˆ(M)\nand P(M). Accordingly, if weak non-degeneracy holds [thus, in particular, for any M with\ncompact Cauchy surfaces], there is an isomorphism of the space of observables and P(M)\nsuch that Ff 7→ [Ef ] for all f ∈ F (M), and which is symplectic if the observables are\nequipped with symplectic product σ(Ff 1 , Ff 2 ) = 41 {Ff 1 , Ff 2 }.\nProof. Lemma 4.11 shows that the given map is well-defined and injective, while surjectivity is evident by Theorem 3.9. The symplectic product is seen to be preserved by combining\nTheorems 4.8 and 4.10 to give 4ω([Ef 1 ], [Ef 2 ]) = {Ff 1 , Ff 2 } for any f 1 , f 2 ∈ F (M).\n\n4.4\n\nQuantization\n\nTo quantize the theory we follow Dirac's prescription, which requires that we seek operators\nF̂f , labelled by test tensors f with divergence-free symmetric part and whose commutator\nis given by [F̂f , F̂f ′ ] = i{Ff , Ff ′ }1. We also expect these operators to respect the quantum\nanalogues of the relations for the classical observables from Theorem 4.7. As we will\nregard these objects as smeared quantum fields, we use the notation [γ](f ) rather than\nF̂f , cautioning that the [γ] in such expressions is not to be confused with an equivalence\nclass of classical solutions. Combining the above requirements gives the algebraic relations:\n(i) Complex-linearity: [γ](αf 1 + βf 2 ) = α[γ](f 1 ) + β[γ](f 2 ) for all α, β ∈ C and all\nf i ∈ C0∞ (T20 (M)) such that ∇a (fi )(ab) = 0;\n(ii) Hermiticity: [γ](f )∗ = [γ](f ∗ ) for all f ∈ C0∞ (T20 (M)) such that ∇a f(ab) = 0;\n(iii) Symmetry: [γ](f ) = 0 for all antisymmetric f ∈ C0∞ (T20 (M));\n(iv) Field equation: [γ](L(f )) = 0 for all f ∈ CT∞C (T20 (M)) such that L(f ) ∈ C0∞ (S20 (M)).\n(v) Commutation relation: [[γ](f 1 ), [γ](f 2 )] = −2iE(f s1 , f s2 )1 for all f i ∈ C0∞ (T20 (M))\nsuch that ∇a (fi )(ab) = 0.\nNote that (a) in the statement of the field equation, the linearized Einstein tensor L(f )\nis symmetric (by definition of L) and divergence free (by the Bianchi identities) for any\nf ∈ CT∞C (T20 (M)); (b) the final relation implies that the commutator vanishes if the f i are\nspacelike separated, as required by the Bose statistics of the spin-two field. As discussed\nin section 4.3, the use of time-compact test tensors in (iv) is necessary to allow for certain\neffects of nontrivial topology. An analogous modification to the axioms for the electromagnetic field is required if the topological restrictions imposed in [16, 17] are relaxed. Also\nnote that (ii) corresponds to item (ii) of Theorem 4.7 for real-valued γ.\nThe algebra of observables A(M, g), where (M, g) is the background spacetime, will\nconsist of finite linear combinations of finite products of [γ](f ), [γ](f )∗ and a unit 1\nobeying the above relations. More formally, it may be constructed as follows: we first form\nthe free unital ∗-algebra generated by symbols [γ](f ) together with a unit 1. However,\n\n26\n\n\fthis algebra is too large as it does not take into account the relations. To impose them we\nquotient by the two-sided ∗-ideal they generate.d\nThe algebra A(M, g) may also be constructed from a different perspective, as the\napplication of a quantization functor to the classical complexified phase space P(M) with\nsymplectic product ω (see [19, Sec. 5] for the definition and properties of this functor).\nThis is particularly convenient in the discussion of covariance below. The equivalence of\nthese approaches follows directly from Proposition 4.12.\nWe now state and prove a time-slice property. This shows that the algebra is generated\nby smeared fields with smearings supported in any slice around a Cauchy surface.\nTheorem 4.13 Given any connected causally convex open neighbourhood N of a spacelike\nCauchy surface Σ and a f ∈ C0∞ (S20 (M)) with ∇*f = 0 then there exists a f̃ ∈ C0∞ (S20 (N ))\nwith ∇ * f̃ = 0 and a h ∈ C0∞ (S20 (M)) such that\nf = f̃ − 2L(h).\n\n(4.27)\n\nThis entails that [γ](f̃ ) = [γ](f ) in A(M, g).\nProof. This follows the method used in the electromagnetic case from [17, Prop. A.3(b)].\nBy assumption, N is globally hyperbolic, and we may choose Cauchy surfaces Σ± for M\nwith Σ± ⊂ I ± (Σ) ∩ N . Take two scalar functions χ± ∈ C ∞ (M) satisfying χ+ = 1 in\nJ + (Σ+ ), χ+ = 0 in J − (Σ− ) and χ+ + χ− = 1. Define\nf̃ := 2L(χ+ Ef ),\n\n(4.28)\n\nwhich satisfies ∇ * f̃ = 0 by the linearized Bianchi identity and is compactly supported\nwithin N (χ+ Ef evidently vanishes to the past of N and coincides with a de Donder\nsolution to the linearized equations to the future of N by hypothesis on f ). Note that\n(4.28) implies that 2L(χ− Ef ) = −f̃ . By Lemma 3.10 we have −E + f̃ ∼ χ+ Ef , E − f̃ ∼\nχ− Ef and hence\nE f̃ = Ef + £w g\n(4.29)\nfor some £w g ∈ G (M). As ∇ * f̃ = ∇ * f = 0, both E f̃ and Ef are de Donder solutions\nand so w solves (\u0003 + Λ)w = 0 (see the remarks following Theorem 2.2); hence by [6,\nThm 3.4.7], w = Ẽv for some v ∈ C0∞ (T01 (M)). Substituting this result into (4.29) and\nusing Lemma 3.8 gives E(f̃ − f − £v g) = 0. Using Lemma 3.11 gives the desired result.\nFinally, we note that the theory could also be quantized by means of the Weyl algebra.\nThis results in a unital C ∗ -algebra W(M, g) generated by elements W ([γ]) ([γ] ∈ PR (M))\nobeying the relations\nW (0) = 1,\n\nW ([γ])∗ = W (−[γ]),\n\n′\n\nW ([γ] + [γ ′ ]) = eiω([γ],[γ ])/2 W ([γ])W ([γ ′ ]);\n\nand with the unique norm making the resulting system a C ∗ -algebra – for an explicit\nconstruction of the algebra see, for example, [37] or [6] (example 4.2.2 of that reference) in\nthe case of non-degenerate ω, or [9] in the degenerate case.\nd\n\nWe use the same notation for [γ](f ) and the corresponding equivalence class in the quotient.\n\n27\n\n\f4.5\n\nCovariance\n\nWe briefly discuss the extent to which the theory we have constructed may be formulated\nas a locally covariant theory in the functorial sense introduced by Brunetti, Fredenhagen\nand Verch (BFV) [11]; however, for brevity, we will not emphasize the categorical structures here (they are easily reinserted). Let (M, g M ) and (N, gN ) be globally hyperbolic\nspacetimes solving the vacuum Einstein equation with cosmological constant Λ, and assume that these spacetimes are endowed with time-orientations and orientations, which we\nleave implicit in what follows. Consider any smooth embedding ψ : M → N that is an\nisometry, preserves the (time-)orientation and has a causally convex image. We restrict\nto spacetimes for which P(M) and P(N) are both weakly non-degenerate, though we do\nnot assume that M and N have compact Cauchy surfaces.e\nOwing to the isomorphism in Proposition 4.12, the push-forward ψ∗ of compactly supported tensor fields induces a linear map P(ψ) : P(M) → P(N) so that P(ψ)[E M f ] =\n[E N ψ∗ f ], provided that ψ∗ Lˆ(M) ⊂ Lˆ(N). This raises the following question: given any\nk ∈ CT∞C (S20 (M)) so that LM (k) is compactly supported, does there exist k′ ∈ CT∞C (S20 (N))\nso that LN (k′ ) = ψ∗ LM (k)? Clearly, if k is compactly supported, k′ = ψ∗ k has the required property, so ψ∗ L (M) ⊂ L (N) ⊂ Lˆ(N). However, this argument cannot be used\nif k is a general element of CT∞C (S20 (M)), and it seems that there may be a genuine obstruction in some (though not all) cases where L (M) is a proper subspace of Lˆ(M). This\nis analogous to the distinction between de Rahm cohomology with or without compact\nsupport; an equivalent question here is whether or not ψ ∗ Gˆ(N) exhausts Gˆ(M).\nIf, indeed, ψ∗ Lˆ(M) ⊂ Lˆ(N) then the map P(ψ) is easily seen to be symplectic, as\nωN (P(ψ)[E M f ], P(ψ)[E M f ′ ]) = ωN ([E N ψ∗ f ], [E N ψ∗ f ′ ])\n1\n1\n= − E N (ψ∗ f , ψ∗ f ′ ) = − E M (f , f ′ )\n2\n2\n′\n= ωM ([E M f ], [E M f ])\n\n(4.30)\n\nfor arbitrary f , f ′ ∈ F (M). It is therefore also injective because P(M) was assumed to\nbe weakly non-degenerate. It is also clear that P(ψ) commutes with complex conjugation. Consequently, the general properties of the quantization functor used to construct\nA(M, gM ) from P(M) (see [19]) entail the existence of an injective, unit-preserving ∗homomorphism A(ψ) : A(M, gM ) → A(N, g N ), uniquely determined by the property\nA(ψ)[γ]M (f ) = [γ]N (ψ∗ f ). If we consider an additional embedding φ : M ′ → M of the\nabove type, it is evident that A (ψ) ◦ A (φ) = A (ψ ◦ φ); it is also clear that A maps the\nidentity mapping of M to the identity mapping of A (M, g M ). Moreover, if the image of\nψ contains a Cauchy surface of N, then the map A (ψ) is surjective by Theorem 4.13 and\nhence an isomorphism.\nThis discussion may be summarised in the language of [11] by saying that A defines a\ncovariant functor from a certain category of globally hyperbolic spacetimes to the category\ne\n\nNote, however, that if M has compact Cauchy surface, the existence of the embedding ψ entails that N\nalso has compact Cauchy surfaces, which are oriented-diffeomorphic to those of M ; see [18, Prop. 2.3(a)].\n\n28\n\n\fof unital ∗-algebras with unit-preserving injective ∗-homomorphisms as morphisms, and\nthat this theory has the time-slice property. Similarly, the quantization of PR (M) in\nterms of Weyl algebras defines a functor to the category of unital C ∗ -algebras. However,\nthe category of spacetimes is a subcategory of that usually studied in the BFV formalism:\nthe spacetimes themselves are restricted to those cosmological vacuum solutions on which\nthe phase space of linearized gravity is weakly non-degenerate, while the morphisms must\nbe restricted to permit only those embeddings ψ : M → N for which ψ∗ Lˆ(M) ⊂ Lˆ(N).\nA more geometrical characterization of this class would be desirable.\nThe restriction to cosmological vacuum solutions has an important consequence: it is\nnot possible to formulate the relative Cauchy evolution that plays an important part in\nthe BFV formalism – see [11] and [18, 19] – but which requires the freedom to consider\narbitrary (sufficiently small) compactly supported metric perturbations. This is related to\nthe well-known absence of a local stress-energy tensor for the gravitational field. Finally,\nthe detailed study of circumstances under which P(M) is weakly non-degenerate, and of\nthose morphisms ψ : M → N for which P(ψ) is well defined, are evidently interesting\nproblems with a cohomological flavour and deserve further investigation.\nAcknowledgements: The authors thank Atsushi Higuchi for many extremely useful discussions on this subject and Vincent Moncrief for invaluable assistance (via Atsushi) in\nunderstanding non-degeneracy of the symplectic product. We also thank Ian McIntosh for\nseveral discussions on geometrical results and Benjamin Lang for discussions concerning\nanalogues with electromagnetism. We are also grateful for comments received from Stanley\nDeser, Andrew Waldron and Ko Sanders.\n\nA\nA.1\n\nTransverse-traceless gauge\nConventions\n\nAs the proof of Theorem 2.7 makes use of differential forms we briefly summarize the\nconventions employed. We work with the smooth spacetime (M, g) satisfying all of the\ntopological criteria from section 2. Our conventions follow [1] and are consistent with\nthose of [17, 43]: for the space of p-forms on M we use the notation Ωp (M), the space of\ncompactly supported p-forms on M is denoted Ωp0 (M) and the space of p-forms that are\nspacelike-compact is denoted by ΩpSC (M).\nThe wedge-product of α ∈ Ωp (M) and β ∈ Ωq (M) is α ∧ β ∈ Ωp+q (M), which is given\nby\n(p + q)!\n(α ∧ β)a1 ...ap+q =\n(A.1)\nα[a1 ...ap βap+1 ...ap+q ] .\np!q!\nThe Hodge star operator is the map ∗ : Ωp (M) → Ωn−p (M) uniquely defined [1,\nProp. 6.2.12] by the condition α ∧ ∗β = (α, β)g dvolg for all α, β ∈ Ωp (M). Its square is,\nby [1, Prop. 6.2.13], equal to\n(∗)2 = (−1)p(n−p)+s ,\n(A.2)\n\n29\n\n\fwhere n is the dimension of the manifold and s is the index of the metric g. On a fourdimensional Lorentzian manifold (in −+++ signature) this becomes (∗)2 = (−1)p+1, while\non a spacelike Cauchy surface thereof it reduces to (∗)2 = 1.\nThere is a standard pairing, see [1, p. 538], between p-forms on a manifold M: given\nw ∈ Ωp (M) and f ∈ Ωp0 (M) one defines\nZ\nhw, f iM :=\nw ∧ ∗f .\n(A.3)\nM\n\nIf M is compact then the restriction that f be compactly supported can be dropped.\nThe exterior derivative d : Ωp (M) → Ωp+1 (M) is given by\n(dα)a1 ...ap+1 = (p + 1)∇[a1 αa2 ...ap+1 ] ,\n\n(A.4)\n\nwhere α ∈ Ωp (M). The codifferential δ : Ωp (M) → Ωp−1 (M) is, by [1, Dfn 6.5.21], given\nby\nδ = (−1)n(p−1)+s+1 ∗ d∗\n(A.5)\n\nand always annihilates 0-forms. On the spacetime (M, g), δ = ∗d∗, while on spacelike\nCauchy surfaces, δ = (−1)p ∗ d∗.\nBy using Stokes' Theorem one can show that\nhdα, βi = hα, δβi\n\n(A.6)\n\nfor α ∈ Ωp−1 (M) and β ∈ Ωp (M), provided at least one of them is compactly supported.\n\nA.2\n\nThe transverse-traceless gauge\n\nBy using differential forms we can make use of the methodology of [43, Prop. 2.6], which\ndeals with obtaining the Lorenz gauge in electromagnetism, where there is an identical\nhyperbolic equation and a constraint similar to (2.41).\nAs in [43, Sec. 2.4], define i : Σ → M to be the embedding of the Cauchy surface Σ in\nthe spacetime M and define the following forms on a Cauchy surface Σ:\nw(0)\nw(d)\nw(δ)\nw(n)\n\n:= i∗ w ∈ Ω10 (Σ)\n:= − ∗ i∗ ∗ dw ∈ Ω10 (Σ)\n:= i∗ δw ∈ Ω00 (Σ)\n:= − ∗ i∗ ∗ w ∈ Ω00 (Σ),\n\n(A.7)\n(A.8)\n(A.9)\n(A.10)\n\nwhich together constitute the Cauchy data on Σ for w, meaning they correspond to w|Σ\nand ∇n w|Σ . We sometimes use the notation ρ(0) , ρ(d) , ρ(δ) and ρ(n) from [43, Sec. 2.4] for\nthe linear maps (A.7), (A.8), (A.9) and (A.10) respectively, applied to one-forms and zeroforms. The forms on a Cauchy surface corresponding to the Cauchy data for a zero-form\nγ are\nγ(0) := ρ(0) γ ∈ Ω00 (Σ)\nγ(d) := ρ(d) γ ∈ Ω00 (Σ).\n30\n\n(A.11)\n(A.12)\n\n\f(Note: γ(δ) and γ(n) are automatically zero.) Writing (2.41) in forms notation gives\n−(δd + dδ)w + 2Λw = 0,\n1\nδw = γ\n2\n\n(A.13)\n(A.14)\n\nrespectively. In (A.14) we used δw = −∇a wa and in (A.13) the 'extra' Λw comes from\nnon-commutativity of covariant derivatives and using (2.2).\nWe will require scalar and one-form Green's identities, see [28, Appx A], [43, Sec. 2.4],f\nwhich link solutions of hyperbolic equations to their initial data on a spacelike Cauchy\nsurface Σ. For w ∈ Ω1SC (M) solving (A.13) we have\nhw, f iM = hw(0) , ρ(d) Ef iΣ + hw(δ) , ρ(n) Ef iΣ − hw(d) , ρ(0) Ef iΣ − hw(n) , ρ(δ) Ef iΣ , (A.15)\nwhere f ∈ Ω10 (M) and E is the advanced-minus-retarded solution operator for the differential operator −(δd + dδ) + 2Λ acting on 1-forms (see section 3.3 for further details on\nGreen's operators). The scalar case is (A.23).\nWe now show what constraints the Cauchy data need to satisfy in order that the solution\nto (A.13) also satisfies (A.14); we adapt [43, Prop. 2.6] to achieve this.\nTheorem A.1 Suppose w ∈ Ω1SC (M) solves (−(δd+dδ)+2Λ)w = 0 and γ is a de Donder\nsolution, then δw = 21 γ if and only if w(δ) = 21 γ(0) and δw(d) + 2Λw(n) = 21 γ(d) .\nProof. (⇒) The pull-back of the constraint δw = 21 γ to the Cauchy surface gives w(δ) =\n1\nγ , while applying − ∗ i∗ ∗ d to the constraint gives\n2 (0)\n1\n1\n− ∗i∗ ∗ dδw = ρ(d) δw = ρ(d) γ = γ(d) .\n2\n2\n\n(A.16)\n\n1\n∗ i∗ ∗ δdw − 2Λ ∗ i∗ ∗ w = γ(d) ,\n2\n\n(A.17)\n\nUsing (A.13), this yields\n\nwhich may be rewritten as δw(d) + 2Λw(n) = 21 γ(d) by using the definitions of the various\nquantities and the fact that d commutes with i∗ .\n(⇐) To prove that such a w will satisfy the constraint δw = 21 γ globally on (M, g) we\nbegin by taking an arbitrary f ∈ Ω00 (M) and computing\nhδw, f iM = hw, df iM = hw(0), ρ(d) Edf iΣ + hw(δ) , ρ(n) Edf iΣ\n− hw(d), ρ(0) Edf iΣ − hw(n) , ρ(δ) Edf iΣ , (A.18)\nwhere we use (A.6) and (A.15).\nf\n\nThe formulae in [28, 43] are modified by changing to our −+++ signature convention. Note that there\nare sign errors in Eq. (2.21) in [43], and that [28] uses the retarded-minus-advanced propagator, whereas\nwe use the advanced-minus-retarded.\n\n31\n\n\fFrom [43, Prop. 2.1] we know that Ed = dE, where E is the advanced-minus-retarded\nsolution operator for the differential operator −(δd + dδ) + 2Λ = −δd + 2Λ acting on\n0-forms. Using this and ρ(d) d = 0, (A.18) reduces to\nhδw, f iM = hw(δ) , ρ(n) dEf iΣ − hw(d) , ρ(0) dEf iΣ − hw(n) , ρ(δ) dEf iΣ .\n\n(A.19)\n\nFor the second term on the right-hand side we can use that the pullback and the exterior\nderivative commute, and then (A.6) to obtain\nhδw, f iM = hw(δ) , ρ(n) dEf iΣ − hδw(d) , ρ(0) Ef iΣ − hw(n) , ρ(δ) dEf iΣ\n1\n1\n= hγ(0) , ρ(n) dEf iΣ − hγ(d) , ρ(0) Ef iΣ\n2\n2\n+ 2Λhw(n), ρ(0) Ef i − hw(n) , ρ(δ) dEf iΣ ,\n\n(A.20)\n\n(A.21)\n\nwhere in (A.21) we substituted the restrictions on the Cauchy data. The last two terms\ncancel because ρ(δ) dEf = ρ(0) δdEf = 2Λρ(0) Ef . Therefore\n1\n1\nhδw, f iM = hγ(0) , ρ(d) Ef iΣ − hγ(d) , ρ(0) Ef iΣ ,\n2\n2\n\n(A.22)\n\nwhere we have used that, in this case, ρ(d) = ρ(n) d.\nThe trace of a de Donder solution γ satisfies the scalar wave equation (2.40), which\nin forms notation is −δdγ + 2Λγ = 0. Therefore we can use the scalar version of (A.15)\n[recall that γ(δ) = γ(n) = 0], i.e.,\nhγ, f iM = hγ(0) , ρ(d) Ef iΣ − hγ(d) , ρ(0) Ef iΣ\n\n(A.23)\n\nfor any f ∈ Ω00 (M). Comparing this with (A.22) gives hδw, f iM = 21 hγ, f iM for all f ∈\nΩ00 (M), and hence δw = 12 γ.\nWe may now give the proof of the splitting S (M) = S T T (M) + G (M) for Λ 6= 0.\nProof of Theorem 2.7. We know from Corollary 2.3 that S (M) = S dD (M) + G (M),\ntherefore if we can decompose the space of de Donder solutions as S dD (M) = S T T (M) +\nG (M) ∩ S dD (M) then we can achieve (2.42). Given a perturbation γ ∈ S dD (M) on a\ncosmological vacuum spacetime (M, g) with Λ 6= 0, the constraints of Theorem A.1 are\n1\n1\nsatisfied by w(0) = 4Λ\ndγ(0) , w(d) = 0, w(n) = 4Λ\nγ(d) and w(δ) = 21 γ(0) as Cauchy data.\n1\nThe solution with this data is w = 4Λ dγ, which corresponds to the choice in equation (9)\nof [32] for de Sitter spacetime. Therefore appropriate Cauchy data exists and one may\ngauge transform from the de Donder gauge to the transverse-traceless gauge.\nIn the case Λ = 0, the second constraint of Theorem A.1 reduces to δw(d) = 12 γ(d) ,\nwhich becomes a cohomological problem. The scalar γ(d) is co-closed, δγ(d) = 0, but is it\nco-exact? Equivalently, we must solve\n1\nd(∗w(d)) = − ∗ γ(d) ,\n2\n32\n\n(A.24)\n\n\fin which ∗γ(d) is a 3-form on Σ and necessarily closed.\nThere are two cases to consider: depending on whether or not w has compact support\non Cauchy surfaces. If as we assume, w has compact support on Cauchy surfaces then\nfrom [1, Thm 7.5.19(i)], ∗γ(d) is exact if and only if\nZ\n∗γ(d) = 0.\n(A.25)\nΣ\n\nIf, on the other hand, Σ is non-compact and w is allowed to have non-compact support on\nΣ, [1, Thm 7.5.19(iii)] gives that H 3 (Σ) = 0 and so ∗γ(d) is exact and the TT gauge may\nbe attained as is standard, e.g., in Minkowski spacetime.\n\nB\n\nNon-degeneracy\n\nB.1\n\nBackground on the ADM formalism\n\nIn order to prove Theorem 4.3 we need to appeal to the results of [39, 22], which use the\nADM formalism (for original references, see [3]). This formalism puts general relativity into\nthe form of a dynamical system, where given a three-dimensional smooth manifold Σ and\nCauchy data (h, ̟) ∈ C ∞ (S20 (Σ)) × C ∞ (S̃02 (Σ)) we can obtain a solution ((−ǫ, ǫ) × Σ, g)\nto Einstein's equation. Here S̃02 (Σ) is the space of smooth√second rank contravariant\ntensor\n\u0001\n1 ab\nab\nab\ndensities on Σ, h is the spatial metric on Σ and ̟ = h k − 2 h k is the conjugate\nmomentum, where k is the desired extrinsic curvatureg of Σ in the solution spacetime and\nh is the determinant of the metric h. In fact, to obtain a solution, one also needs to specify\na lapse function and a shift vector field on Σ, which can both be time-dependent and are\nfreely specifiable and non-dynamical. Together they make up the components of a vector\nfield whose integral curves provide a flow of time in spacetime. The spacetime metric g is\nconstructed from the lapse and shift as well as the evolved spatial metric h obtained from\nsolving the ADM equations (B.17) below.\nThe initial data (h, ̟) are not freely specifiable as they need to satisfy constraints\ngiven by the map Φ : C ∞ (S20 (Σ)) × C ∞ (S̃02 (Σ)) → C ∞ (Σ) × C ∞ (T01 (Σ)), where\nΦ(h, ̟) = (H (h, ̟), δ(h, ̟))\n\n(B.1)\n\nand the Hamiltonian and momentum constraints are\nH (h, ̟) = −R(3) (h) +\n\n̟ ab ̟ab ̟ 2\n−\n+ 2Λ\nh\n2h\n\nand\na\n\nδ (h, ̟) = Db\ng\n\n\u0012\n\n̟ ab\n√\nh\n\n\u0013\n\nOur convention differs from [22]; however, the overall definitions of ̟ coincide.\n\n33\n\n(B.2)\n\n(B.3)\n\n\frespectively. Here R(3) (h) is the Ricci scalar for the metric h and Da is the covariant\nderivative associated with h. Vanishing of (B.1) is a necessary condition for a spacetime\nto be a solution to the vacuum Einstein equation with cosmological constant.\nFor linearized gravity in the ADM formalism, one considers a one-parameter family of\nCauchy data (h(λ), ̟(λ)) and takes the derivative\nat λ\u0011= 0. Thus the Cauchy data for the\n\u0010\n∂̟(λ)\n∂h(λ)\n, ∂λ\nand the linearized constraints\nlinearized ADM equations are (γ (3) , p) =\n∂λ\nλ=0\n\nare the components of the derivative of the constraint map (B.1) at (h, ̟). One should note\nthat to solve the linearized ADM equations one needs to specify a linearized lapse function\nand linearized shift vector field; as in the full non-linear case they are non-dynamical and\nfreely specifiable.\nFrom now on we assume that the background is a solution to the vacuum Einstein\nequation with cosmological constant and so Φ(h, ̟) = 0. The linearized constraints are\nthe derivative of the constraint map (B.1),\nDΦ(h, ̟) : C ∞ (S20 (Σ)) × C ∞ (S̃02 (Σ)) → C ∞ (Σ) × C ∞ (T01 (Σ))\n\n(B.4)\n\nevaluated at (h, ̟), where\n\u0012 (3) \u0013\n\nγ\n\u0012 (3) \u0013\nDH (h, ̟)\n\np\u0013 \nγ\n\n\u0012 (3)\n=\nDΦ(h, ̟)\n\n\np\nγ\nDδ(h, ̟)\np\n\n(B.5)\n\nwhose actions are given by\n\u0012 (3) \u0013\n\u0014 \u0012\n\u0013\n\u0012\n\u0013\n1\n1 2\n1\nγ\nab\n(3)\nab\n=\nDH (h, ̟)\n− ̟ ̟ab − ̟ γ + 2 ̟ab p − ̟p\np\nh\n2\n2\n\u0015 \u0010\n\u0013\n\u0012\n\u0011\n1\n(3)\na b (3)\na\n(3)\n(3)ab (3)\nab\nac\n(B.6)\nγab\nγab − D D γab − D Da γ − R\n+2 ̟ ̟cb − ̟̟\n2\n\nand\n\n\u0012 (3) \u0013\n\u0011i\n\u0010\n1 h\nγ\n(3)a\na (3)\n= √ 2Db pab + ̟ bc Dc γ b + Db γ (3)a\nDδ(h, ̟)\n,\n−\nD\nγ\nc\nbc\np\nh\n(3)\n\n(B.7)\n\nwhere γ (3) = hab γab , ̟ = hab ̟ ab and p = hab pab . To get these into a form analogous to\nthat in [39, 22] we evaluate (B.6) on the constraint surface to give\n\u0014\n\u0012\n\u0013\n\u0012\n\u0013\n\u0012 (3) \u0013\n1\n1 2 (3)\n1\n1\nγ\nab\nab\n−\n̟ ̟ab − ̟ γ + 2 ̟ab p − ̟p\nDH (h, ̟)\n=\np\nh\n2\n2\n2\n\u0015 h\n\u0013\n\u0012\n1\n(3)\n(3)\n+2 ̟ ac ̟cb − ̟̟ ab γab − D a D b γab − D a Da γ (3)\n2\n\u0012\n\u0015\n\u0013\n1 ab (3)\n(3)\n(3)ab\nab\n− R\n− h R + Λh\nγab . (B.8)\n2\n34\n\n\fNote that the difference between this and the Λ = 0 case considered in equation (2.8) of\n[39] is the cosmological constant term.\nWe also require the following inner products, defined in [39] (equations (2.4) and (2.6)\nin that reference). The first acts on the domain of DΦ(h, ̟), i.e., the vector space\nC ∞ (S20 (Σ)) × C ∞ (S̃02 (Σ)) and is\n\u0013\nZ \u0012√\n1\n(3) (3) ac bd\n(3)\n(3)\nab cd\nhγab γ̃cd h h + √ hac hbd p p ,\nh(γ , p); (γ̃ , p̃)i :=\n(B.9)\nh\nΣ\nwhere γ (3) , γ̃ (3) ∈ C ∞ (S20 (Σ)) and p, p̃ ∈ C ∞ (S̃02 (Σ)). The second acts on the codomain\nC ∞ (Σ) × C ∞ (T01 (Σ)) of DΦ(h, ̟) as follows\nZ\n ̃\nhh(f, V ); (f , Ṽ )ii :=\n(f * f ̃ + hab V a V b )dvolh ,\n(B.10)\nΣ\n\nwhere f, f ̃ ∈ C ∞ (Σ) and V , Ṽ ∈ C ∞ (T01 (Σ)).\nThe adjoint of the differential operator DΦ(h, ̟) is calculated, using the inner products\n(B.9) and (B.10) and integration by parts, to be\n\u0012 \u0013 \u0012\n\u0013\nf\nDH (h, ̟)∗ (f )\n∗\n=\n,\n(B.11)\nDΦ(h, ̟)\nV\nDδ(h, ̟)∗ (V )\nwhere DH (h, ̟)∗ (f ) = (α, β) with\n\u0014\n\u0012\n\u0013\n\u0012\n\u0013 \u0015\n1\n1 2\n1\n1\ncd\nc\n−\n̟ ̟cd − ̟ hab f +2 ̟ac ̟ b − ̟ab ̟ f\nαab =\nh\n2\n2\n2\n\u0013 \u0015\n\u0014\n\u0012\n1\n(3)\n(3)\nc\n− Da Db f − hab D Dc f − Rab − hab R + Λhab f (B.12)\n2\n\nand\nβ\n\nab\n\nAlso\nDδ(h, ̟)∗ (V ) =\n\n\u0012\n\u0013\n1\nab\nab\n= 2f ̟ − ̟h\n.\n2\n√1\nh\n\n\u0010\n\nDc (V c ̟ab ) − 2̟ c(a D|c| Vb)\n√\n− h(D a V b + D b V a )\n\n(B.13)\n\u0011!\n\n.\n\n(B.14)\n\nWe now define a unitary U : C ∞ (S20 (Σ)) × C ∞ (S̃02 (Σ)) → C ∞ (S20 (Σ)) × C ∞ (S̃02 (Σ)) by\n\u0012\n\u0013\n−1 ♭♭ √\n(3)\n(3) ♯♯\nU(γ , p) := √ p , h(γ )\n(B.15)\nh\n\u0012\n\u0013\n0\n−1\nso that U ◦ DΦ(h, ̟)∗ corresponds to γ(h, ̟) ≡\n◦ DΦ(h, ̟)† from [39], where\n1 0\nDΦ(h, ̟)† is the 'new form of the adjoint' defined in equation (4.2) of that reference. The\ninverse map U −1 : C ∞ (S20 (Σ)) × C ∞ (S̃02 (Σ)) → C ∞ (S20 (Σ)) × C ∞ (S̃02 (Σ)) is given by\n\u0013\n\u0012\n1 ♭♭ √\n(3) ♯♯\n−1\n(3)\n(B.16)\nU (γ , p) = √ p , − h(γ ) .\nh\n35\n\n\fThe ADM evolution equations may be written as follows\n\u0013\n\u0012\n\u0013\n\u0012\n∂\nN\nh(λ)\n−1\n∗\n,\n= U ◦ DΦ(h, ̟)\n−N\n∂λ ̟(λ)\n\n(B.17)\n\nwhere N is the lapse function and N is the shift vector field associated with the slicing.\nThe ADM symplectic product on the background (h, ̟) is, see [22, p. 333], given by\nZ\n(3)\n(3)\nADM\n(3)\n(3)\nω(h,̟) ((γ , p); (γ̃ , p̃)) =\n(γab p̃ab − γ̃ab pab )d3 x.\n(B.18)\nΣ\n\nObserve that\nADM\nω(h,̟)\n((γ (3) , p); (γ̃ (3) , p̃)) = h(γ (3) , p); U −1 (γ̃ (3) , p̃))i.\n\nB.2\n\n(B.19)\n\nAnalogues of Moncrief 's splitting theorems\n\nIn [39] it is shown that the space of initial data can be decomposed into orthogonal subspaces, using the inner product (B.9). Here, we generalize these decompositions to the\ncase of nonzero cosmological constant. The first splitting is\nC ∞ (S20 (Σ)) × C ∞ (S̃02 (Σ)) = ker DΦ(h, ̟) ⊕ range DΦ(h, ̟)∗ ,\n\n(B.20)\n\nwhere ker DΦ(h, ̟) is the subspace of data satisfying the linearized constraints and\nrange DΦ(h, ̟)∗ is the unphysical data. This splitting was done for the case of Λ = 0 in\n[39, Sec. 3] using ellipticity of the operator DΦ(h, ̟) ◦ DΦ∗ (h, ̟), which is proven by\nshowing that DΦ∗ (h, ̟) has injective principal symbol and applying [7, Thm 4.4], which\nis valid on compact Riemannian manifolds. Since our modifications to the linearized constraint map and its adjoint only add a Λh term, the principal symbol will be unaffected\nand so the operator is still elliptic. Hence the remainder of the Moncrief argument of [39,\nSec. 3] remains valid and the first splitting holds for general Λ.\nThe second splitting decomposes the subspace ker DΦ(h, ̟) into a pure gauge subspace, meaning data for pure gauge solutions, and a physical subspace. In [40, Sec. IV] it\nis shown that data for a pure gauge solution to the linearized equations corresponding to\n£w g, on a vacuum spacetime with Λ = 0, is given by\n\u0012 \u0013\nC\n(3)\n∗\n,\n(B.21)\n(γ , p)gauge = U ◦ DΦ(h, ̟)\nX\nwhere C = na w a and X a = q ab w b are respectively the normal (with respect to the future\npointing normal vector n) and tangential projections, relative to Σ (using the associated\nprojection tensor q ab ), of the gauge vector field. The above result was initially proved via\na lengthy calculation, and later by more geometrical methods, see [22, Thm 4.7]. The\nresult (B.21) also holds on vacuum spacetimes with non-vanishing cosmological constant\nby following the same argument used in the proof of [22, Thm 4.7] but instead using the\nvacuum ADM equations with cosmological constant (B.17).\n36\n\n\fBefore performing the final split, one needs to check that the pure gauge subspace lies\nin the constraint subspace. Again, one could check this by lengthy calculation, as was done\nin [39, Thm 4.1] for the Λ = 0 case; instead, we appeal to the geometrical method of [22,\nProp. 3.2] whose result is unaffected by the inclusion of a cosmological constant.\nWith the two preceding results and, as argued earlier, ellipticity of DΦ(h, ̟)◦DΦ∗ (h, ̟)\nunaffected by addition of a cosmological constant, the subspace ker DΦ(h, ̟) can be decomposed, see the argument in between Theorem 4.1 and Theorem 4.2 of [39], into\nker DΦ(h, ̟) = range(U ◦ DΦ(h, ̟)∗ ) ⊕ ker((U ◦ DΦ(h, ̟)∗ )∗ ∩ ker DΦ(h, ̟), (B.22)\nwhere the first space is pure gauge and the second space is the physical space.\nTherefore the final split of the initial data is\nC ∞ (S20 (Σ)) × C ∞ (S̃02 (Σ)) = range DΦ(h, ̟)∗ ⊕ range(U ◦ DΦ(h, ̟)∗ )\n⊕ ker((U ◦ DΦ(h, ̟)∗ )∗ ∩ ker DΦ(h, ̟), (B.23)\nwhich is the same result as the Λ = 0 case from [39, Thm 4.2]. This decomposition allows\none to prove that on the space of initial data obeying the constraints, ker DΦ(h, ̟),\nthe only degeneracies of the ADM symplectic product are pure gauge. We now give the\nanalogue of [21, Prop. 4.38].\nTheorem B.1 The ADM symplectic orthogonal complement to the subspace ker DΦ(h, ̟)\nis the pure gauge space range(U ◦ DΦ(h, ̟)∗ ).\nADM\n((γ (3) , p); (γ̃ (3) , p̃)) = 0 for all (γ (3) , p) ∈\nProof. Let (γ̃ (3) , p̃) ∈ ker DΦ(h, ̟) satisfy ω(h,̟)\nker DΦ(h, ̟). Then by (B.19),\n\nh(γ (3) , p); U −1 (γ̃ (3) , p̃))i = 0\n\n(B.24)\n\nand so U −1 (γ̃ (3) , p̃) is orthogonal to ker DΦ(h, ̟). By the first Moncrief split (B.20) this\nmeans that U −1 (γ̃ (3) , p̃) ∈ range DΦ(h, ̟)∗ . Hence\n(γ̃ (3) , p̃) ∈ range(U ◦ DΦ(h, ̟)∗ )\n\n(B.25)\n\nand is therefore pure gauge.\n\nB.3\n\nProof of Theorem 4.3\n\nThe main issue is to translate Theorem B.1 into the setting studied in the main body of\nthe paper. Begin by taking an arbitrary smooth spacelike Cauchy surface Σ and denote\nby N a normal neighbourhood of Σ. (For details about normal neighbourhoods, see the\nsecond paragraph of section 2.3.) Assume that a solution γ ′ ∈ S (M) is a degeneracy of\nthe symplectic form ω, i.e., ω(γ ′ , γ) = 0 for all γ ∈ S (M). Without loss of generality, γ ′\nmay be chosen synchronous near Σ; it will be enough to restrict attention to synchronous γ\nas well. (Theorem 2.8 means that we can gauge transform any solution to the synchronous\n37\n\n\fgauge near Σ and since, by Lemma 4.2, pure gauge is a degeneracy then γ ′ will still be a\ndegeneracy of ω.)\nWe now restrict our attention to the normal neighbourhood N , on which we can\nintroduce Gaussian normal coordinates. In such coordinates the spacetime metric takes\nthe form g = −dt ⊗ dt + h̃ij dxi ⊗ dxj and the synchronous condition is precisely γ0μ = 0.\nThe solutions γ ′ , γ correspond to solutions to the linearized ADM equations about the\nbackground (N , g|N ) in the slicing given by the Gaussian normal coordinates: thus we\nhave unit lapse, vanishing shift (and vanishing linearizations thereof). The corresponding\nADM Cauchy data are (γ ′(3) , p′ ), (γ (3) , p) ∈ C ∞ (S20 (Σ)) × C ∞ (S̃02 (Σ)) respectively, where\nin these coordinates\n(3)\nγij = γij |Σ\n(B.26)\npij =\n\n√ γ (3) im jn\n\u0001\nh\nh h − hij hmn ∂0 hmn\n4\n√ \u0010\n\u0011\nh im jn\njn\nij mn\nmn\n∂0 hmn\nγ(3) h + him γ(3)\n− γ(3)\nh − hij γ(3)\n−\n2\n√\n\u0012\n\u0011\u0013\n\u0001\nh im jn\n1 kl \u0010\n(3)\n(3)\nij mn\n+\n. (B.27)\nh h −h h\n(∇n γ)mn |Σ + h ∂0 hml γkn + ∂0 hnl γmk\n2\n2\n\nUsing, for convenience, Gaussian normal coordinates one may showh that\nADM\nω(γ ′ , γ) = ω(h,̟)\n((γ ′(3) , p′ ); (γ (3) p)).\n\n(B.28)\n\nBy Theorem B.1 and degeneracy of γ ′ , (γ ′(3) , p′ ) is data for a pure gauge solution; therefore\non the region N , γ ′ = £w g for some w ∈ C ∞ (T01 (N )). Now perform a global gauge\ntransformation on γ ′ using a vector field v ∈ C ∞ (T01 (M)) satisfying v = −w on an open\nneighbourhood of Σ within N . The result will still be both a solution and a degeneracy in\nS (M) but has DataΣ (γ ′ −£v g) = (0, 0) and therefore by Theorem 3.3, γ ′ = £u g for some\nu ∈ C ∞ (T01 (M)). Note that due to the compactness of Σ, all three vector fields w, v and\nu will be spacelike-compact and hence so will their associated pure gauge perturbation.\nTherefore γ ′ ∈ G (M) = Gˆ(M).\n\nC\n\nIdentity connecting the symplectic product and linearized constraints\n\nTheorem C.1 For any γ ∈ T (M), w ∈ C ∞ (T01 (M)) and smooth spacelike Cauchy surface Σ with unit future-pointing normal vector n, we have\nZ\nZ\na\nb\nωΣ (γ, £w g) = 2 w Lab (γ)n dvolh = 2 w bCbΣ (DataΣ (γ))dvolh .\n(C.1)\nΣ\n\nΣ\n\nh\n\nWe caution that the relationship between π and p is not straightforward, although they do coincide\non constant time hypersurfaces in Minkowski space.\n\n38\n\n\fProof. Choose a vector field v ∈ C ∞ (T01 (M)) such that v = w in a neighbourhood of Σ\nand v vanishes to the far past of Σ. (This trick originates, as far as we know, from [27],\nsee the paragraph preceding equation (79) in that reference). By (3.2) we have\nZ\nZ\na Σ\nw Ca (DataΣ (γ))dvolh =\nw a Lab (γ)nb dvolh .\n(C.2)\nΣ\n\nΣ\n\nThe proof now uses two identities to successively re-express the right-hand side of (C.2).\nLemma C.2 With γ, w and v as above,\nZ\nZ\na\nb\nw Lab (γ)n dvolh = −\n\nM−\n\nΣ\n\n∇(a vb) Lab (γ)dvolg ,\n\n(C.3)\n\nwhere M − = I − (Σ) is the region to the past of the Cauchy surface Σ.\nProof. Using the properties of v and the Gauss Theorem on the region M − we have\nZ\nZ\na\nb\nw Lab (γ)n dvolh = −\n∇b (v a Lab (γ))dvolg ,\n(C.4)\nM−\n\nΣ\n\nwhere we have used that v vanishes to the far past. The right-hand side can be rearranged\nusing the Leibniz rule, symmetry of Lab and ∇a Lab = 0 to give the result.\nNow utilise the pre-symplectic product (4.1) to re-express the right-hand side of (C.3).\nLemma C.3 With γ, w and v as above,\nZ\nωΣ (γ, £w g) = −\n\n2∇(a vb) Lab (γ)dvolg .\n\n(C.5)\n\nM−\n\nProof. Expanding the left-hand side and using (4.1) and the properties of v gives\nZ\nωΣ (γ, £w g) =\nna [2∇(b vc) Πabc (γ) − γbc Πabc (£v g)]dvolh .\n(C.6)\nΣ\n\nApplying the Gauss Theorem on the region M − gives\nZ\nωΣ (γ, £w g) = −\n∇a [2∇(b vc) Πabc (γ) − γbc Πabc (£v g)]dvolg .\n\n(C.7)\n\nM−\n\nThe integrand is\n∇a (2∇(b vc) Πabc (γ) − γbc Πabc (£v g)) = 2∇a ∇(b vc) Πabc (γ)\n\n+ 2∇(b vc) ∇a Πabc (γ) − ∇a γbc Πabc (£v g) − γbc ∇a Πabc (£v g). (C.8)\n39\n\n\fUsing (2.10) and the symmetries of T abcdef , the first and third terms cancel. The remaining\ntwo terms reduce to\n2∇(b vc) ∇a Πabc (γ) − γbc ∇a Πabc (£v g) = 2∇(b vc) Lbc (γ),\n\n(C.9)\n\nwhere we used the first identity in (2.12) and Lbc (£v g) = 0. Hence we achieve the desired\nresult.\nThe proof of Theorem C.1 is completed by combining the results of Lemma C.2 and\nLemma C.3 with (C.2).\n\nReferences\n[1] R. Abraham, J. E. Marsden, and T. Ratiu, Manifolds, tensor analysis, and applications,\nApplied Mathematical Sciences, Vol. 75, 2nd edn. (Springer-Verlag, New York, 1988).\n[2] B. Allen, A. Folacci, and A. C. Ottewill, Renormalized graviton stress-energy tensor in\ncurved vacuum space-times, Phys. Rev. D 38 (1988) 1069–1082.\n[3] R. Arnowitt, S. Deser, and C. W. Misner, The dynamics of general relativity, in Gravitation:\nAn introduction to current research (Wiley, New York, 1962), pp. 227–265.\n[4] A. Ashtekar and A. Magnon-Ashtekar, On the symplectic structure of general relativity,\nCommun. Math. Phys. 86 (1982) 55–68.\n[5] C. Bär and K. Fredenhagen (eds.), Quantum field theory on curved spacetimes: Concepts\nand mathematical foundations, Lecture Notes in Physics, Vol. 786 (Springer-Verlag, Berlin,\n2009).\n[6] C. Bär, N. Ginoux, and F. Pfäffle, Wave equations on Lorentzian manifolds and quantization,\nESI Lectures in Mathematics and Physics (European Mathematical Society (EMS), Zürich,\n2007).\n[7] M. Berger and D. Ebin, Some decompositions of the space of symmetric tensors on a Riemannian manifold, J. Differential Geometry 3 (1969) 379–392.\n[8] A. N. Bernal and M. Sánchez, Globally hyperbolic spacetimes can be defined as 'causal'\ninstead of 'strongly causal', Class. Quantum Grav. 24 (2007) 745–749.\n[9] E. Binz, R. Honegger, and A. Rieckers, Construction and uniqueness of the C ∗ -Weyl algebra\nover a general pre-symplectic space, J. Math. Phys. 45 (2004) 2885–2907.\n[10] L. Bracci and F. Strocchi, Einstein's equations and locality, Commun. Math. Phys. 24 (1972)\n289–302.\n[11] R. Brunetti, K. Fredenhagen, and R. Verch, The generally covariant locality principle: A\nnew paradigm for local quantum physics, Commun. Math. Phys. 237 (2003) 31–68.\n[12] S. Deser and A. Waldron, Gauge invariances and phases of massive higher spins in (anti-)\nde Sitter space, Phys. Rev. Lett. 87 (2001) 031601, 4.\n[13] S. Deser and A. Waldron, Partial masslessness of higher spins in (A)dS, Nuclear Phys. B\n607 (2001) 577–604.\n[14] S. Deser and A. Waldron, Stability of massive cosmological gravitons, Phys. Lett. B 508\n(2001) 347–353.\n[15] J. Dimock, Algebras of local observables on a manifold, Commun. Math. Phys. 77 (1980)\n219–228.\n\n40\n\n\f[16] J. Dimock, Quantized electromagnetic field on a manifold, Rev. Math. Phys. 4 (1992) 223–\n233.\n[17] C. J. Fewster and M. J. Pfenning, A quantum weak energy inequality for spin-one fields in\ncurved space-time, J. Math. Phys. 44 (2003) 4480–4513.\n[18] C. J. Fewster and R. Verch, Dynamical locality and covariance: What makes a physical\ntheory the same in all spacetimes?, Annales H. Poincaré 13 (2012) 1613–1674.\n[19] C. J. Fewster and R. Verch, Dynamical locality of the free scalar field, Annales H. Poincaré\n13 (2012) 1675–1709.\n[20] M. Fierz and W. Pauli, On relativistic wave equations for particles of arbitrary spin in an\nelectromagnetic field, Proc. Roy. Soc. (London) Ser. A. 173 (1939) 211–232.\n[21] A. E. Fischer and J. E. Marsden, The initial value problem and the dynamical formulation of\ngeneral relativity, in General Relativity: An Einstein centenary survey, ed. S. W. Hawking\n& W. Israel (1979), pp. 138–211.\n[22] A. E. Fischer and J. E. Marsden, Topics in the dynamics of general relativity, in Isolated\nGravitating Systems in General Relativity, ed. J. Ehlers (1979), pp. 322–395.\n[23] L. H. Ford and L. Parker, Infrared divergences in a class of Robertson-Walker universes,\nPhys. Rev. D 16 (1977) 245–250.\n[24] L. H. Ford and L. Parker, Quantized gravitational wave perturbations in Robertson-Walker\nuniverses, Phys. Rev. D 16 (1977) 1601–1608.\n[25] K. Fredenhagen and K. Rejzner, Batalin-Vilkovisky formalism in the functional approach to\nclassical field theory, Commun. Math. Phys. 314 (2012) 93–127.\n[26] F. G. Friedlander, The wave equation on a curved space-time (Cambridge University Press,\nCambridge, 1975), Cambridge Monographs on Mathematical Physics, No. 2.\n[27] J. L. Friedman, Generic instability of rotating relativistic stars, Commun. Math. Phys. 62\n(1978) 247–278.\n[28] E. P. Furlani, Quantization of massive vector fields in curved space-time, J. Math. Phys. 40\n(1999) 2611–2626.\n[29] R. Geroch, Spinor structure of space-times in general relativity. I, J. Math. Phys. 9 (1968)\n1739–1744.\n[30] T.-P. Hack and A. Schenkel, Linear bosonic and fermionic quantum gauge theories on curved\nspacetimes, arXiv:1205.3484.\n[31] S. W. Hawking and G. F. R. Ellis, The large scale structure of space-time (Cambridge\nUniversity Press, London, 1973), Cambridge Monographs on Mathematical Physics, No. 1.\n[32] A. Higuchi and S. S. Kouris, Large-distance behaviour of the graviton two-point function in\nde Sitter spacetime, Class. Quantum Grav. 17 (2000) 3077–3090.\n[33] A. Higuchi, D. Marolf, and I. A. Morrison, de Sitter invariance of the dS graviton vacuum,\nClass. Quantum Grav. 28 (2011) 245012.\n[34] A. Kriegl and P. W. Michor, The convenient setting of global analysis, Mathematical Surveys\nand Monographs, Vol. 53 (American Mathematical Society, Providence, RI, 1997).\n[35] J. Lee and R. M. Wald, Local symmetries and constraints, J. Math. Phys. 31 (1990) 725–743.\n[36] A. Lichnerowicz, Propagateurs et commutateurs en relativité générale, Inst. Hautes Études\nSci. Publ. Math. (1961) 56.\n[37] J. Manuceau and A. Verbeure, Quasi-free states of the C.C.R.-algebra and Bogoliubov transformations, Commun. Math. Phys. 9 (1968) 293–302.\n[38] S. P. Miao, N. C. Tsamis, and R. P. Woodard, Gauging away Physics, Class. Quantum Grav.\n28 (2011) 245013.\n\n41\n\n\f[39] V. Moncrief, Decompositions of gravitational perturbations, J. Math. Phys. 16 (1975) 1556–\n1560.\n[40] V. Moncrief, Spacetime symmetries and linearization stability of the Einstein equations. I,\nJ. Math. Phys. 16 (1975) 493–498.\n[41] V. Moncrief, Quantum linearization instabilities, General Relativity and Gravitation 10\n(1979) 93–97.\n[42] B. O'Neill, Semi-Riemannian geometry, Pure and Applied Mathematics, Vol. 103 (Academic\nPress Inc. [Harcourt Brace Jovanovich Publishers], New York, 1983).\n[43] M. J. Pfenning, Quantization of the Maxwell field in curved spacetimes of arbitrary dimension, Class. Quantum Grav. 26 (2009) 135017.\n[44] K. Sanders, A note on spacelike and timelike compactness, arXiv:1211.2469.\n[45] J. M. Stewart and M. Walker, Perturbations of space-times in general relativity, Proc. Roy.\nSoc. (London) Ser. A 341 (1974) 49–74.\n[46] F. Strocchi, Gauge problem in quantum field theory. II. Difficulties of combining Einstein\nequations and Wightman theory, Phys. Rev. 166 (1968) 1302–1307.\n[47] M. E. Taylor, Partial differential equations I. Basic theory, Applied Mathematical Sciences,\nVol. 115, 2nd edn. (Springer, New York, 2011).\n[48] R. M. Wald, General relativity (University of Chicago Press, Chicago, IL, 1984).\n[49] R. M. Wald, Quantum field theory in curved spacetime and black hole thermodynamics,\nChicago Lectures in Physics (University of Chicago Press, Chicago, IL, 1994).\n[50] F. W. Warner, Foundations of differentiable manifolds and Lie groups, Graduate Texts in\nMathematics, Vol. 94 (Springer-Verlag, New York, 1983).\n[51] S. Weinberg, Cosmology (Oxford University Press, Oxford, 2008).\n\n42\n\n\f"}