{"id": "http://arxiv.org/abs/0904.4155v5", "guidislink": true, "updated": "2010-08-20T14:01:27Z", "updated_parsed": [2010, 8, 20, 14, 1, 27, 4, 232, 0], "published": "2009-04-27T13:33:06Z", "published_parsed": [2009, 4, 27, 13, 33, 6, 0, 117, 0], "title": "Fundamentals of the Backoff Process in 802.11: Dichotomy of the\n  Aggregation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0904.2551%2C0904.3844%2C0904.1962%2C0904.2991%2C0904.3062%2C0904.0583%2C0904.0084%2C0904.3569%2C0904.3308%2C0904.1433%2C0904.4345%2C0904.4048%2C0904.2741%2C0904.4540%2C0904.0236%2C0904.2437%2C0904.4361%2C0904.1671%2C0904.0300%2C0904.3320%2C0904.2496%2C0904.0160%2C0904.1866%2C0904.3524%2C0904.0162%2C0904.3711%2C0904.3552%2C0904.0345%2C0904.4509%2C0904.3472%2C0904.4426%2C0904.1266%2C0904.4683%2C0904.4673%2C0904.4782%2C0904.4253%2C0904.1725%2C0904.1539%2C0904.3971%2C0904.2464%2C0904.0564%2C0904.4155%2C0904.0338%2C0904.2654%2C0904.2825%2C0904.2356%2C0904.3708%2C0904.1994%2C0904.1294%2C0904.2476%2C0904.2452%2C0904.0882%2C0904.4615%2C0904.3088%2C0904.2899%2C0904.1111%2C0904.1730%2C0904.4765%2C0904.0888%2C0904.3258%2C0904.3372%2C0904.4661%2C0904.2541%2C0904.3086%2C0904.1816%2C0904.1189%2C0904.2311%2C0904.3459%2C0904.2349%2C0904.2534%2C0904.2194%2C0904.4588%2C0904.0317%2C0904.1210%2C0904.4211%2C0904.3913%2C0904.4885%2C0904.3653%2C0904.2487%2C0904.2722%2C0904.0351%2C0904.0527%2C0904.0137%2C0904.2319%2C0904.0388%2C0904.0302%2C0904.2904%2C0904.0898%2C0904.3002%2C0904.4578%2C0904.0031%2C0904.1833%2C0904.0401%2C0904.0915%2C0904.2301%2C0904.2244%2C0904.3667%2C0904.0169%2C0904.4617%2C0904.3424%2C0904.2601&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Fundamentals of the Backoff Process in 802.11: Dichotomy of the\n  Aggregation"}, "summary": "This paper discovers fundamental principles of the backoff process that\ngoverns the performance of IEEE 802.11. A simplistic principle founded upon\nregular variation theory is that the backoff time has a truncated Pareto-type\ntail distribution with an exponent of $(\\log \\gamma)/\\log m$ ($m$ is the\nmultiplicative factor and $\\gamma$ is the collision probability). This reveals\nthat the per-node backoff process is heavy-tailed in the strict sense for\n$\\gamma>1/m^2$, and paves the way for the following unifying result.\n  The state-of-the-art theory on the superposition of the heavy-tailed\nprocesses is applied to establish a dichotomy exhibited by the aggregate\nbackoff process, putting emphasis on the importance of time-scale on which we\nview the backoff processes. While the aggregation on normal time-scales leads\nto a Poisson process, it is approximated by a new limiting process possessing\nlong-range dependence (LRD) on coarse time-scales. This dichotomy turns out to\nbe instrumental in formulating short-term fairness, extending existing formulas\nto arbitrary population, and to elucidate the absence of LRD in practical\nsituations. A refined wavelet analysis is conducted to strengthen this\nargument.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0904.2551%2C0904.3844%2C0904.1962%2C0904.2991%2C0904.3062%2C0904.0583%2C0904.0084%2C0904.3569%2C0904.3308%2C0904.1433%2C0904.4345%2C0904.4048%2C0904.2741%2C0904.4540%2C0904.0236%2C0904.2437%2C0904.4361%2C0904.1671%2C0904.0300%2C0904.3320%2C0904.2496%2C0904.0160%2C0904.1866%2C0904.3524%2C0904.0162%2C0904.3711%2C0904.3552%2C0904.0345%2C0904.4509%2C0904.3472%2C0904.4426%2C0904.1266%2C0904.4683%2C0904.4673%2C0904.4782%2C0904.4253%2C0904.1725%2C0904.1539%2C0904.3971%2C0904.2464%2C0904.0564%2C0904.4155%2C0904.0338%2C0904.2654%2C0904.2825%2C0904.2356%2C0904.3708%2C0904.1994%2C0904.1294%2C0904.2476%2C0904.2452%2C0904.0882%2C0904.4615%2C0904.3088%2C0904.2899%2C0904.1111%2C0904.1730%2C0904.4765%2C0904.0888%2C0904.3258%2C0904.3372%2C0904.4661%2C0904.2541%2C0904.3086%2C0904.1816%2C0904.1189%2C0904.2311%2C0904.3459%2C0904.2349%2C0904.2534%2C0904.2194%2C0904.4588%2C0904.0317%2C0904.1210%2C0904.4211%2C0904.3913%2C0904.4885%2C0904.3653%2C0904.2487%2C0904.2722%2C0904.0351%2C0904.0527%2C0904.0137%2C0904.2319%2C0904.0388%2C0904.0302%2C0904.2904%2C0904.0898%2C0904.3002%2C0904.4578%2C0904.0031%2C0904.1833%2C0904.0401%2C0904.0915%2C0904.2301%2C0904.2244%2C0904.3667%2C0904.0169%2C0904.4617%2C0904.3424%2C0904.2601&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "This paper discovers fundamental principles of the backoff process that\ngoverns the performance of IEEE 802.11. A simplistic principle founded upon\nregular variation theory is that the backoff time has a truncated Pareto-type\ntail distribution with an exponent of $(\\log \\gamma)/\\log m$ ($m$ is the\nmultiplicative factor and $\\gamma$ is the collision probability). This reveals\nthat the per-node backoff process is heavy-tailed in the strict sense for\n$\\gamma>1/m^2$, and paves the way for the following unifying result.\n  The state-of-the-art theory on the superposition of the heavy-tailed\nprocesses is applied to establish a dichotomy exhibited by the aggregate\nbackoff process, putting emphasis on the importance of time-scale on which we\nview the backoff processes. While the aggregation on normal time-scales leads\nto a Poisson process, it is approximated by a new limiting process possessing\nlong-range dependence (LRD) on coarse time-scales. This dichotomy turns out to\nbe instrumental in formulating short-term fairness, extending existing formulas\nto arbitrary population, and to elucidate the absence of LRD in practical\nsituations. A refined wavelet analysis is conducted to strengthen this\nargument."}, "authors": ["Jeong-woo Cho", "Yuming Jiang"], "author_detail": {"name": "Yuming Jiang"}, "author": "Yuming Jiang", "arxiv_comment": "15 pages, 4 figures; An abstract version of this paper was presented\n  at ACM SIGMETRICS Workshop on MAthematical performance Modeling and Analysis\n  (MAMA 2009)", "links": [{"href": "http://arxiv.org/abs/0904.4155v5", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0904.4155v5", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cs.NI", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cs.NI", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cs.PF", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0904.4155v5", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0904.4155v5", "journal_reference": null, "doi": null, "fulltext": "1\n\nFundamentals of the Backoff Process in 802.11:\nDichotomy of the Aggregation\n\narXiv:0904.4155v5 [cs.NI] 20 Aug 2010\n\nJeong-woo Cho and Yuming Jiang\n\nAbstract-This paper discovers fundamental principles of the\nbackoff process that governs the performance of IEEE 802.11. A\nsimplistic principle founded upon regular variation theory is that\nthe backoff time has a truncated Pareto-type tail distribution with\nan exponent of (log γ)/ log m (m is the multiplicative factor\nand γ is the collision probability). This reveals that the per-node\nbackoff process is heavy-tailed in the strict sense for γ > 1/m2 ,\nand paves the way for the following unifying result.\nThe state-of-the-art theory on the superposition of the heavytailed processes is applied to establish a dichotomy exhibited\nby the aggregate backoff process, putting emphasis on the\nimportance of time-scales on which we view the backoff processes.\nWhile the aggregation on normal time-scales leads to a Poisson\nprocess, it is approximated by a new limiting process possessing long-range dependence (LRD) on coarse time-scales. This\ndichotomy turns out to be instrumental in formulating short-term\nfairness, extending existing formulas to arbitrary population, and\nto elucidate the absence of LRD in practical situations. A refined\nwavelet analysis is conducted to strengthen this argument.\nIndex Terms-Point process theory, regular variation theory,\nmean field theory.\n\nI. I NTRODUCTION\nSince its introduction, the performance of IEEE 802.11\nhas attracted a lot of research attention and the center of\nthe attention has been the throughput [6], [27]. Recently,\nother critical performance aspects of 802.11 also burst onto\nthe scene, which include short-term fairness [12], [26] and\ndelay [38]. It goes without saying that there has been a\nphenomenal growth of Skype and IPTV users [14], [15] and it\nis reported in [23] that an ever-increasing percentage of these\nusers connects to the Internet through wireless connections\nin US. Remarkably, it is found in [15] that jitter is more\nnegatively correlated with Skype call duration than delay, i.e.,\nSkype users tend to hang up their calls earlier with large jitters.\nThis finding empirically testifies large jitter of access networks\nannoys Skype users, let alone QoS (quality of service). This\nquantified dissatisfaction of users provides a motivation for\na thorough understanding of delay and jitter performance in\n802.11.\nThis work was supported in part by \"Centre for Quantifiable Quality of\nService in Communication Systems, Centre of Excellence\" appointed by\nThe Research Council of Norway, and funded by The Research Council,\nNTNU and UNINETT. A part of this work was done when J. Cho was with\nEPFL, Switzerland. A preliminary abstract version of this work appeared at\nACM SIGMETRICS Workshop on Mathematical Performance Modeling and\nAnalysis (MAMA'09).\nJ. Cho and Y. Jiang are with the Centre for Quantifiable Quality\nof Service in Communication Systems, Norwegian University of Science and Technology (NTNU), NO-7491 Trondheim, Norway (email:\n{jeongwoo,jiang}@q2s.ntnu.no).\n\nFor throughput analysis, Kumar et al., in the seminal paper\n[27], axiomized several remarkable observations based on a\nfixed point equation (FPE), advancing the state of the art\nto more systematic models and paving the way for more\ncomprehensive understanding of 802.11. Above all, one of the\nkey findings of [27], already adopted in the field [28], [34],\nis that the full interference model1 , also called the singlecell model [27], in 802.11 networks leads to the backoff\nsynchrony property [31] which implies the backoff process\ncan be completely separated and analyzed through the FPE\ntechnique. Another observation in [27] was that if the collision\nprobability γ is constant, one can derive the so-called Bianchi's\nformula by appealing to renewal reward theorem [13], without\nthe Markov chain analysis in [6].\nAn intriguing notion, called short-term fairness, has been\nintroduced in some recent works [5], [12], [26], defining\nP[z|ζ] as the probability that other nodes transmit z packets\nwhile a tagged node is transmitting ζ packets. It can be\neasily seen that this notion pertains to a purely backoff-related\nargument also owing to the backoff synchrony property in\nthe full interference model [27]. The two papers [5], [12], in\nthe course of deriving equations for P[z|ζ], assumed that the\nsummation of the backoff values generated per packet, which\nwe denote by Ω, is uniformly and exponentially distributed,\nrespectively. Specifically, despite the same situation where two\nnodes contend for the medium, the former [5] assumed that Ω\nis uniformly distributed because the initial backoff is uniformly\ndistributed over the set {0, 1, * * * , 2b0 − 1} where 2b0 is the\ninitial contention window and observed in [5, Fig. 2] that this\nassumption leads to a good match between the expression\nP[z|ζ] derived under the uniform assumption on Ω and the\ntestbed data measured in their experiments, while the latter\n[12] also observed in [12, Fig. 5(a)] that the testbed data\nmeasured in their experiments closely match the expression\nP[Z|ζ] derived under the the exponential assumption on Ω:\nQ1:\"What makes two different observations?\" (to be answered in Section III)\nIn addition, the two works [5], [12] acquired the expression\nof P[z|ζ] only for the two node case. A more general formula\nfor arbitrary number of nodes should deepen our appreciation\nof short-term fairness. It is natural to ask the following\npertinent questions:\nQ2:\"Can we develop a general model for short-term fairness?\" (to be answered in Corollaries 1 & 2)\nIn proportion as people take a growing interest in the\n1 In the full interference or single-cell model, every node interferes with the\nrest of the nodes, i.e., its corresponding interference graph is fully connected.\n\n\f2\n\ndelay performance of 802.11, the number of fundamental\nquestions that we face increases. In [1], it was argued based\non simulation results that the access delay in 802.11 closely\nfollows a Poisson distribution. They have shown that the\nnumber of successful packet transmissions by any node in the\nnetwork over a time interval has a probability distribution that\nis close to Poisson by an upper bounded distribution distance.\nThis raises an intriguing question:\nQ3:\"Is there a Poissonian property? If yes, what is the\ncause?\" (to be answered in Theorem 1)\nAnother case in point is found in a recent work [34] that\nextends the access delay analysis in the seminal paper of\nKwak et al. [28] and makes an attempt at analyzing higher\norder moments by applying the FPE technique. One interesting\nfinding in [34] is that the access delay has a wide-sense\nheavy-tailed distribution [34, Theorem\n1] which means that\nR∞\nits moment generating function 0 etx f (x)dx is ∞, ∀t > 0,\nwhere f (x) is the corresponding pdf (probability density\nfunction) [32]. One should be careful in interpreting this finding because the wide-sense heavy-tailedness does not imply\nstrict sense heavy-tailedness, which roughly means the ccdf\n(complementary cumulative distribution function) is of Paretotype [17] with an exponent over (−2, 0). In fact, there are\nlots of distributions, namely, lognormal, Pareto, Cauchy and\nWeibull distributions, which belong to the class of wide-sense\nheavy-tailed distributions. Consequently, the discussion poses\nthe following challenge which is undoubtedly a tantalizing\nquestion.\nQ4:\"What is the distribution type of the delay-related variables?\" (to be answered in Theorems 2 & 3)\nFinally, it is, perhaps, surprising that long-range dependence\nof 802.11 has not been rigorously analyzed even for the single\nnode case, not to mention the aggregate process of many\nnodes. One minor contribution of this paper is that we prove\nin Theorem 3 that the individual arrival process (consisting\nof successful transmissions of one node) can be viewed as\na renewal process with heavy-tailed inter-arrival times, which\nimplies that the individual arrival process possesses long-range\ndependence simply by appealing to [30].\nHowever, for the superposition arrival process (consisting of\nsuccessful transmissions of all nodes), there is no clear answer.\nFor example, Tickoo and Sikdar [37] conjectured the absence\nof long-range dependence of aggregate total load, which we\ncall superposition arrival process. It is remarkable that the\nabsence of long-range dependence has been also supported\nthrough empirical analysis such as wavelet-based method [2]\nby Veres and Boda [39] in the context of TCP flows in\nwired networks. Since there is an analogy between the backoff\nmechanisms adopted by 802.11 and TCP (in wired networks)\nin that\n1) both of them adopt backoff schemes (802.11) or retransmission scheme (TCP) where the probability of these\nevents is either the collision probability (802.11) or the\npacket drop probability in router buffers (TCP),\n2) the mean of the backoff (contention window in 802.11)\nor retransmission time (timeout in TCP) doubles for each\nbackoff or retransmission,\n\none might wonder if there is a fundamental reason that\nelucidates these observations.\nQ5:\"Does the aggregate transmission process possess longrange dependence? If yes, why is it seldom observed?\" (to be\nanswered in Theorem 4 and Section VII)\nThe focus of this paper is on the backoff process in 802.11,\nsince it plays the central role in quantifying the performance\nof 802.11 [27]. For example, to grasp the heart of the delay properties, the backoff value distribution in 802.11 DCF\n(distributed coordination function) mode can be used as a\nsurrogate for the access delay [28]. As discussed above, the\nthroughput performance and short-term fairness performance\nalso depend on the backoff process and are particularly affected by the backoff synchrony property. Essentially, once the\nbackoff distribution is obtained, various performance aspects\ncan be analyzed.\nA. Contributions of this work\nThis paper discovers fundamental principles of the backoff\nprocess and provides answers to the open questions highlighted above, which constitute the contributions of the paper.\nParticularly, it turns out that we find out the answers to most\naforementioned questions Q2-Q5 in the course of deriving the\nfollowing two principles based on a new methodology, i.e.,\npoint process approach.\n• Power-tail principle: The per-packet backoff time distribution has a slowly-varying power-tail (Theorem 3).\n• Dichotomy of aggregation: Depending on the timescales on which the backoff processes are aggregated,\nthe resultant process becomes either Poissonian or a new\nprocess (Theorems 1 & 4).\nThe power-tail principle, which is derivable only after we\naccumulate a store of knowledge (Section III, Lemma 1\nand Theorem 2), characterizes the backoff distribution in a\ntractable and simplistic way, owing to regular variation theory,\nanswering Q4. The dichotomy of aggregation implies that,\nwhen we view the aggregate process on normal time-scales,\nowing to the tendency of each component process to become\nsparse as population grows, we observe only a Poissonian as\nits marginal distribution. However, viewed on coarse timescales, the aggregate process is identified as a long-range\ndependent process. This rigid dichotomy is instrumental in\nfinding answers to Q2, Q3 and Q5, and expatiates upon the\ncoexistence of contrary properties suggested by Q3 and Q5.\nAll the theorems in the paper are closely linked with each\nother, forming a solid framework for the performance analysis\nof 802.11. These results help us to get the complex details\nof the backoff process in 802.11 into perspective under one\nframework.\nThe rest of the paper is organized as follows. In Section\nII, we revisit the Bianchi's formula along with a survey of\nrecent advances in mean field theory, with which the analysis\nof the backoff process at one node can be decoupled from other\nnodes. In Section III, we present the exact distribution of perpacket backoff. We establish in Section IV that the aggregate\nbackoff process can be approximated by a Poisson process\nunder the large population regime. In Section V, we extend\n\n\f3\n\nto asymptotic analysis and prove the power-tail principle. In\nSection VI, we first propose a new process approximation on\na coarse time scale, which is then applied to formulate shortterm fairness and to identify long-range dependence. After\nconducting a wavelet analysis on long-range dependence in\nSection VII, we conclude this paper.\nII. B IANCHI ' S F ORMULA R EVISITED\nThe backoff process in 802.11 is governed by a few rules\nif the duration of per-stage backoff is taken to be exponential:\n(i) every node in backoff stage k attempts transmission with\nprobability pk for every time-slot; (ii) if it succeeds, k changes\nto 0; (iii) otherwise, k changes to (k + 1) mod (K + 1)\nwhere K is the index of the highest backoff stage. Markov\nchain models, which have been widely used in describing\ncomplex systems including 802.11, however, very often lead\nto excessive complications as discussed in Section I. In this\nsection, we present a surrogate tool for the analysis, mean\nfield theory. It is noteworthy that the rules used in 802.11,\ni.e., (i)–(iii), closely resemble the mean field equations laid\nout below.\nA. Basic Operation of DCF Mode\nTime is slotted. Each node following the randomized access\nprocedure of 802.11 distributed coordination function (DCF)\ngenerates a backoff value after receiving the Short Inter-Frame\nSpace (SIFS) if it has a packet to send. This backoff value is\nuniformly distributed over {0, 1, * * * , 2b0 −1} (or {1, 2, * * * ,\n2b0 }) where 2b0 is the initial contention window.\nWhenever the medium is idle for the duration of a Distributed Inter-Frame Space (DIFS), a node unfreezes (starts)\nits countdown procedure of the backoff and decrements the\nbackoff by one per every time-slot. It freezes the countdown\nprocedure as soon as the medium becomes busy. There exist K + 1 backoff stages whose indices belong to the set\n{0, 1, * * * , K} where we assume K > 0. If two or more\nwireless nodes finish their countdowns at the same time-slot,\nthere occurs a collision between RTS (ready to send) packets\nif the CSMA/CA (carrier sense multiple access with collision\navoidance) is implemented, otherwise two data packets collide\nwith each other. If there is a collision, each node who participated in the collision multiplies its contention window by the\nmultiplicative factor m. In other words, each node changes its\nbackoff stage index k to k + 1 and adopts a new contention\nwindow 2bk+1 = 2mk+1 * b0 . If k + 1 is greater than the index\nof the highest backoff stage number, K, the node steps back\ninto the initial backoff stage whose contention window is set\nto 2b0 . In the IEEE 802.11b standard, m = 2, K = 6 (7\nattempts per packet), and 2b0 = 32 are used.\nThis work focuses on the performance of single-cell 802.11\nnetworks where it is sufficient to analyze the backoff process\nin order to investigate the performance of single-cell networks\n\n[28], [34]. Assuming that there are N nodes, the Bianchi's\nformula can be written compactly in a more general fixed point\nequation (FPE) form:\nPK\nk\nk=0 γ\n,\n(FPE1)\np̄ = PK\nγk\nk=0 qk\n−(N −1)p̄\n\nγ =1−e\n\n(FPE2)\n\nwhere p̄ and γ respectively designate the average attempt rate\nand collision probability of every node at each time-slot. The\nattempt probability in backoff stage k is denoted by qk and\ndefined as the inverse of the mean contention window, i.e.,\nqk = 2/(2bk − 1). It satisfies 0 < qk ≤ 1 as bk ≥ 1. Note that\nBianchi's formula holds under the well-known assumption:\nA.1 All the transmission queues of nodes are saturated.\nExactly under which condition (FPE1) holds is recently\nbeing rediscovered with rigorous mathematical arguments [4],\n[11], [35], which, sometimes called mean field approximation. This fundamental approach was originally developed by\nBordenave et al. [11] and Sharma et al. [35]. Remarkably,\nBordenave et al. [11] adopted a generalized particle interaction\nmodel which encompasses Markovian evolution of the system\nother than particles at the same time. Benaı̈m and Le Boudec\n[4] overcame some limitations of the model [11], broadening\nits applicability. The main result here is that, as the number of\nparticles goes to infinity, i.e., N → ∞, the state distribution\nof every node evolves according to a set of K + 1 dimensional\nnonlinear ordinary differential equations under an appropriate\nscaling of time. Benaı̈m and Le Boudec [4] also observed\nthat decoupling approximation represented by (FPE1) does\nnot hold if the differential equations does not have a unique\nglobally attractor.\nRemarkably, Bordenave et al. [11] have proven that the\ndifferential equations are globally stable if K = ∞ and the rescaled attempt probability Qk := N qk satisfies Qk+1 = Qk /2\nwith Q0 < ln 2. In the meantime, Sharma et al. [35] obtained\na result for K = 1 and mentioned the difficulty to go beyond.\nHowever, the case for other finite K has remained to be proved\n[4, pp.833]. Recently, we solved this issue to a large extent [16]\nby proving that, for finite K, a simplistic condition Qk ≤ 1\n(or qk ≤ 1/N ) for all k ∈ {0, * * * , K} guarantees the global\nstability of the differential equations as well as the uniqueness\nof the solutions to the Bianchi's formula. As we discussed\nin [16], there are still many outstanding problems upon the\nstability of the associated differential equations.\nWhile one of the aims of these efforts [4], [11], [16], [35]\nis to identify the fundamental conditions under which the\ncollision probability is deterministic and time-invariant for\nlarge population (N = ∞), once we assume the collision\nprobability is such for N < ∞, the demonstration of the\nformula (FPE1) is shown to be straightforward [27]. That is\nto say, we need to make the following simple assumption.\n\nB. The Bianchi's Formula\n\nA.2 For each node, conditional upon its transmission attempt,\nthe collision events form an i.i.d. sequence, which is\nindependent from other nodes.\n\nIn performance analysis of 802.11, Bianchi's formula and\nits many variants are probably the most known [6], [27],\n\nThe observation in [27] was that, under the above assumptions,\none can easily derive (FPE1) by appealing to renewal reward\n\n\f4\n\ntheorem [13], without the Markov chain analysis in [6]. Thus\nfrom now on, the attempt probability is given by (FPE1). As\na by-product, we can also see that the distribution of backoff\nstages, which we denote by φk , k ∈ {0, * * * , K}, takes the\nfollowing form\nφk =\n\nγk\n1\n* PK\nqk\n\nγk\nk=0 qk\n\n.\n\n(1)\n\nThe expression of the collision probability (FPE2) was first\nused in [27, Section IV]. A similar expression was also used\nin [4], [11] under the intensity scaling, which means that the\nattempt probability of every node in any backoff stage is of the\norder of 1/N . We use (FPE2) instead of its original version in\n[6] because, as argued in [4], [11], the approximation provided\nby (FPE2) is well founded on a mean field result. Lastly, it is\nalso noteworthy that the analysis in Section III and IV does\nnot depend on whether K is finite or not.\nIII. BACKOFF A NALYSIS\nThe backoff value distribution and the backoff stage distribution should not be confused in meaning. While the latter is\nthe distribution of the backoff stage of a node, the former is\nthe distribution of the backoff value generated for initiating the\nbackoff countdown when the node has a packet to transmit.\nThe backoff value distribution at backoff stage k has a discrete\nuniform pdf (probability density function) fk (*) on the integers\n{0, 1, * * * , 2bk −1} with mean 1/qk = (2bk −1)/2 and variance\nVark =\n\nb2k\n3\n\n−\n\n1\n1 2bk + 1 1\n= *\n*\n=\n12\n3 2bk − 1 qk2\n\nvk2\nqk2\n\nwhere the pre-factor is denoted by vk2 to simplify the exposition\nin the current section. Note that limbk →∞ vk2 = 1/3.\nLet Ω and fΩ (*) respectively denote the sum of the backoff\nvalues generated for a packet, and its pdf. Also denote by Ω̄\n2\nits mean and σΩ\nits variance. It should be clear that the sum of\nthe backoff values generated for a packet Ω which we baptize\nin this paper per-packet backoff can be formally defined as a\ncompound random variable:\nPκ\nΩ := k=0 Bk\n(2)\nwhere Bk is a random variable denoting the backoff value\ngenerated at the kth backoff stage, for a packet of a tagged\nnode, and κ is also a random variable designating the highest\nbackoff stage reached by the packet.\nThe probability that the kth backoff stage is reached during\nthe backoff duration for a packet can be computed as γ k\nirrespective of the backoff distribution at any backoff stage.\nHence we have\nP[κ = k] = γ k − γ k+1 ,\n\n∀k ∈ {0, * * * , K − 1},\n\nand P[κ = K] = γ K . From Bayes' theorem, fΩ (*) becomes:\nPK\nfΩ (x) = k=0 fΩ (x | κ = k) * P [κ = k]\n(3)\n\nwhere fΩ (x | κ = k) denotes the sum of the backoff values\nfrom 0th to kth stages for a given k. Applying the fact that\n\nthe sum of k random variables with pdfs f0 (*), * * * , fk (*) has\na pdf of the convolution of the pdfs yields\nPK−1\nfΩ (x) = f ∗K (x)γ K + (1 − γ) k=0 f ∗k (x)γ k\n(4)\n\nwhere f ∗k (*) := (f0 ∗ * * * ∗ fk )(*) is the convolution of k + 1\nfunctions. In a similar way, Ω̄ can be computed from (2):\nhP\ni\nPκ\nPK\nk\n′\nΩ̄ = E [ k=0 Bk ] = k=0 E\n* P[κ = k]\nB\n′\nk\nk =0\n\u0011\nPK \u0010Pk\n1\n* P[κ = k].\n(5)\n= k=0\nk′ =0 q ′\nk\n\nBy manipulating (5) combined with the expression of P[κ =\nk], it is easy to see that\nΩ̄ =\n\nK\nX\nγk\n\nk=0\n\nqk\n\n.\n\n(6)\n\nIn addition, using E[Bk2 ] = (1 + vk2 )/qk2 , the second moment\nof Ω can be rearranged as\ni\nhP\n2\nκ\n2\nσΩ\n+ Ω̄2 = E ( k=0 Bk )\n\u0014\u0010\n\u00112 \u0015\nPK\nPk\n′\nP[κ = k]\n(7)\n= k=0 E\nB\nk′ =0 k\n\n\nk\nk X\ni−1\nX\nX\n2\nPK\n1+vk\n′\n1 \n= k=0 \nP[κ = k]\n(8)\n+\n2\nqi qj\nq2\n=\n\n\u0010P\n\nk′ =0\n\nK\nk=0\n\nk′\n\ni=1 j=0\n\n\u0011\n\u0010P\nK\nγ\n2\n(1\n+\nv\n)\n+\n2\n2\nk\nk=1\nq\nk\n\nk\n\nγk\nqk\n\nPk−1\n\n1\ni=0 qi\n\n\u0011\n\nThe above equalities can be easily verified by rearranging (7)\nand (8). Moreover, it is shown in Appendix A that, if qk =\n2\n2\n2/(2b0mk − 1) as in the standard, vΩ\n:= σΩ\n/Ω̄2 simplifies to\nPK\nk=0 δk\n(9)\n\u0010P\n\u00112 − 1\nK\nk\nk\n(b\nm\n−\n1/2)γ\nk=0 0\nwhere\n\nδ k = b 0 mk −\n\n1\n2\n\n\u0001\n\nγk\n\nn\u0010\n\nm+1\nm−1\n\n+ vk2\n\n\u0011\n\nb 0 mk −\n\n1\n2\n\n\u0001\n\n−k−\n\n2b0 −1\nm−1\n\nRemark 1 R1.1 The result puts forward an alternative\nviewpoint. We can view the backoff process reflecting the\ncollision effect among nodes as if there is no collision at all\nand the per-packet backoff for every node has a distribution\n2\nwith mean Ω̄ and CV vΩ (or equivalently variance σΩ\n).\nR1.2 [Answer to Q1] Consider the case N = 2. It can\nbe computed from (9) that Ω is approximately uniformly\ndistributed in 802.11b while it is exponentially distributed in\n802.11a/g\n√ in the sense that vΩ ≈ 0.7 (though slightly larger\nthan 1/ 3) and vΩ ≈ 1.0, respectively, mainly due to different\ninitial contention windows (2b0 = 32 in 802.11b and 2b0 = 16\nin 802.11a/g). This is the reason why they [5], [12] observed\nthat their testbed data closely match the expressions of intertransmission probability P[Z|ζ], which were derived under\ntheir respective assumptions. Note that we communicated with\nthe first author of [12] to verify the protocol (802.11g) used in\ntheir testbed. We will formally define P[Z|ζ] in Section VI-A.\nTo verify the analysis, simulations have been conducted. We\nhave used ns-2 version 2.33 with its built-in 802.11 module\nand the parameter set of 802.11b, i.e., m = 2 and 2b0 = 32,\n\no\n\n.\n\n\f5\n\n2\n\nanalysis: contours of K\nanalysis: contours of N\nsimulation: K=15\nsimulation: K=6\nerror\n\nK=∞\n\nN=100\n\nΩ\n\nper−packet backoff CV (v )\n\n10\n\nN=80\n1\n\n10\n\nK=15\n\nN=60\nN=40\nK=6\nN=20\nN=10\n0\n\n10\n\nN=5\n\n0\n\n↑N=2\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n0.5\n\ncollision probability (γ)\n\nFig. 1. Per-packet backoff CV vΩ vs. collision probability γ for K =\n6, 15, ∞; and N = 2, * * * , 100.\n\nexcept that K is varied to observe the asymptotic property. All\nsimulations use a 3000s warm-up period and all quantities are\nmeasured over the next 320, 000s (≈ 90h).\nFig. 1 presents the per-packet CV vΩ , computed from (9),\n(FPE1) and (FPE2), and compared with the simulation results.\nThe figure shows a good match between them. In the figure,\nthe intersecting points of contours of K and N at each level\ndecide vΩ and γ simultaneously. As is predicted by (9), vΩ\ngoes to ∞ as K goes to ∞ for γ ≥ 1/m2 = 0.25. It is\nremarkable that for a given N ≥ 9 (N ≥ 5 for 802.11a/g), vΩ\nis extremely sensitive to K, forming a striking contrast with\nthe insensitivity of γ to K.\nThe discrepancy between analysis and simulation study is\npartly due to reduced contention effect, which is a less-known\nsubtlety of DCF behavior discovered by Bianchi et al. [7] and\nis shown through simulations to be a factor of error by Sakurai\nand Vu [34].\nIV. P OINT P ROCESS A PPROACH : P OISSONIAN I NSIGHTS\nA basic property of per-packet backoff Ω discovered by\nKwak et al. [28, Theorem 1] and later strengthened by Kumar\net al. [27, Theorem 7.2] is that the mean of per-packet backoff\nis proportional to the population, i.e., Ω̄ = Θ(N ). This turns\nout to play a key role in our point process approach in this\nsection.\nA. Justification of Point Process Approach\nIn order to justify our point process approach, we need\nto show that the backoff process of each node has nonzero\nintensity, i.e., Ω̄ = E[Ω] is finite. Though, for finite K, this\nis self-evident from the form of (6), we need to assume the\nfollowing to prove Ω̄ < ∞ for K = ∞.\nA.3 qk = 2/(2b0 mk − 1) for all k ∈ {0, * * * , K}, and m > 1.\n\nUnder this assumption we can prove the following lemma\nwhich assures us that Ω̄ is finite whether K is finite or not.\nWe also would like to point out that a part of the proof of\n[27, Theorem 7.2], which corresponds to the case K = ∞ of\n\nLemma 1 in our work, has a flaw\nP∞ because they should have\nproven γ < 1/m before using k=0 (mγ)k = 1/(1 − mγ).\n\nLemma 1 (Mean Exists)\nUnder the above assumption, there exists a finite K0 such that\nγ < 1/m and γ is decreasing in K. This implies:\n• there exist K0 such that γ < 1/m for all K ≥ K0\nincluding K = ∞,\n• the mean Ω̄ = E[Ω] exists for K = ∞.\n\nProof: Suppose γ ≥ 1/m. Then we have from (FPE1)\nand qk = 2/(2b0 mk − 1) that, for any ǫ > 0, there exists\nK1 such that p̄ < ǫ for all K ≥ K1 . In the meantime, from\n1 − e−x ≤ x, we also have γ ≤ (N − 1)p̄ < (N − 1)ǫ. This\ncontradicts γ ≥ 1/m, implying that there must exist K0 such\nthat γ < 1/m for K = K0 .\nDenote the right-hand side of (FPE1) by P(K). Since the\nright-hand side of (FPE2) is increasing in p̄ and P(K) is\nnonincreasing in γ from [27, Lemma 5.1], 1 − e−(N −1)P(K)\nis nonincreasing in γ. Therefore, it suffices to show that\n1 − e−(N −1)P(K0 +1) ≤ 1 − e−(N −1)P(K0 ) ,\nor equivalently P(K0 + 1) ≤ P(K0 ), for all γ < 1/m. After\nsome manipulation and some intricate factorization, it can be\nverified that P(K0 ) − P(K0 + 1) takes the form:\n\u0001\nPK0 k\nb0 γ K0 +1 k=0\nγ mK0 +1 − mk\nnP\n\u0001 o nPK0 +1\n\u0001 o\nK0\n1\nk\nk\nb0 mk − 12 γ k\nk=0\nk=0 b0 m − 2 γ\n\nwhich is greater than zero for m > 1, implying that the\nsolution γ ∗ of (FPE1) and (FPE2) for K = K0 + 1 is smaller\nthan that for K = K0 . Applying mathematical induction\ncompletes the proof. Also note that this implies γ < 1/m\nfor any K ≥ K0 .\nFor the case K = ∞, since we have shown that γ < 1/m\nis decreasing in K for all K ≥ K0 , it follows from [33,\nTheorem 3.14] that as K goes to infinity, γ should converge\nto γ̂ < 1/m. The existence of E[Ω] follows from (6).\nSince m > 1 guarantees that there exists K0 such that\nγ < 1/m for all K ≥ K0 , it can be seen from (1) that,\nfor the case of K = ∞, m > 1 is also a sufficient condition\nfor the existence of κ such that φk > φk+1 for all k ≥ κ,\ni.e., the average number of nodes in backoff stage k is larger\nthan that in backoff stage k + 1. This corresponds to the\ntightness condition of φk , which prevents a node from escaping\nto infinite backoff stage [8]. The fact that the condition m > 1\nprevents a node from escaping to infinite backoff stage appears\nto be in best agreement with our usual intuition.\nB. Essential Assumption\nTo establish Poisson limit result in Theorem 1 and to justify\npoint process approach in the remaining sections, we need the\nfollowing essential assumption.\nA.4 Per-stage backoff distribution fk (*) is√a uniform continuous function. It also means vk = 1/ 3.\nRecall that fΩ (*) is expressed by (4), hence now it is a\nweighted sum of convolutions of continuous pdfs fk (*) where\nthe weight for each convolution function f ∗k (*) = (f0 ∗ * * * ∗\n\n\f6\n\nfk )(*) is (1 − γ)γ k , which is a function of γ. As we noted in\nRemark 1, fΩ (*) reflects the collision effect through γ which\ndetermines how much fΩ (*) is dispersed.\nOn continuity assumption: Denote by Dn (t) the number of\ncumulative per-node successful transmissions until time-slot t.\nFormally, Dn (t) is discrete-time renewal process that counts\nthe number of arrivals during the interval [0, t] where the\ninter-arrival times are i.i.d. copies of discrete P\nrandom variable\nN\nΩ. Consider superposition process D(t) := n=1 Dn (t). A\nsubtlety in 802.11 is that there may be no intervening backoff\ntime-slot between two consecutive successful transmissions.\nMore precisely, at the beginning of a backoff time-slot,\nif the transmission attempts of nodes lead to a successful\ntransmission, the time-slot is rendered unused, meaning that\nthe time-slot is reused after the successful transmission. The\nsame subtlety applies to collision events. Simply suppose the\nprobability that a successful transmission (or a collision event)\noccurs at the beginning of a time-slot converges to PS (or PC )\nas N → ∞. Putting\nP (x) := P[limN →∞ D(t + 1) − D(t) = x], x ∈ {0, 1, * * * },\nwe can see from the subtlety that\nP\nPS\ni\nP (x + 1) = P (x) * ∞\ni=0 PC PS = 1−PC P (x).\nP∞\nBecause x=0 P (x) = 1, we have a geometric distribution\n\u0010\n\u0011\u0010\n\u0011x\nPS\nPS\nP (x) = 1 − 1−P\n, x ∈ {0, 1, * * * }\n1−PC\nC\n\nhence the limiting (as N → ∞) distribution of cumulative\nprocess D(t) for arbitrary integer t takes a Pascal (negative\nbinomial) distribution2 . This fact can be exploited for a more\naccurate approximation. A simpler approximation at the cost\nof accuracy is to be presented in Theorem 1.\nOnce again, the continuity assumption turns out unavoidable\nin Section V because regular variation theory [10] exploited\nby Theorem 3 is not well developed for discrete functions.\nThe uniform distribution assumption of fk (*) was made only\nto simplify the exposition of Theorems 2 and 3 in Section V.\nC. Poisson Process Approximation\nWe can now view the backoff procedure of node n as\na stationary simple renewal process An (t) that counts the\nnumber of arrivals during the interval (0, t] where the jth intern\narrival times, Tjn − Tj−1\n, are given by the i.i.d. copies of the\ncontinuous random variable Ω. Then the backoff procedure of\nall nodes can be regarded as a superposition of N statistically\nidentical renewal processes, i.e.,\nPN\nA(t) := n=1 An (t).\n\nIt should be remarked that, if one or more component processes are not Poisson, the superposition process A(t) is\nnot renewal, and even if the inter-arrival times of A(t) are\nidentically distributed, they are not independent [3].\nIn the following, we present a novel way to tackle this\nanalytical difficulty caused by the dependence among the interarrival times of the superposition process. The key observation\n2 Sakurai and Vu [34, Section III-B] assumed D(t) is a Bernoulli process.\nThis simplification was justified by the reduced contention effect [7].\n\nis that the entropy of the superposition point process A(t)\nincreases with N , which is implied by the following known\nresult [18, Proposition 11.2.VI].\nLemma 2 (Poisson Limit for Superposition)\nLet Ξ(t) denote the point process obtained by superposing M\nindependent replicates B m (t), m ∈ {1, * * * , m}, of a simple\nstationary point process with intensity λ and dilating the timescale by a factor M . Formally speaking,\nP\nm\nΞ(t) = M\n(10)\nm=1 B (t/M ).\nThen as M → ∞, Ξ(t) converges weakly to a Poisson process\nwith the intensity λ.\n\nNow it follows from the basic property [27, Theorem 7.2]\nfor K = ∞ that the mean inter-arrival time of An (t), Ω̄, is of\norder N . Therefore, there must exist a point process\nB n (t) := lim An (N t) with intensity λ = lim N/Ω̄\nN →∞\n\nN →∞\n\nwhere intensity λ does not scale with N and we have\nB n (t/N ) ≈ An (t) as N goes to ∞. This in turn implies\nPN\nPN\nn\nn\nn=1 B (t/N )\nn=1 A (t) ≈\n\nwhich has the same form of (10). Applying Lemma 2 to the\nabove equation leads to the following theorem.\n\nTheorem 1 (Dichotomy of Aggregation: First Part)\nSuppose\nΩ̄ = Θ(N ). Then the superposition process\nPN\nn\nA\n(t)\nconverges weakly to a Poisson process as N →\nn=1\n∞.\nRemark 2 This result states that the Poissonian nature is\ninherent in the backoff process of 802.11 and provides an\nanswer to Q3.\nR2.1 The reason we do not require K = ∞: Recalling\nour discussion at the beginning of this section, we can see that\nK =∞\n\n[27, Theorem 7.2]\n\n=⇒\n\nΩ̄ = Θ(N )\n\nTheorem 1\n\n=⇒\n\nPoisson.\n\nIf we require K = ∞ instead of Ω̄ = Θ(N ), the above\ntheorem would look simpler, but it would not be applicable\nfor the case K < ∞. Even if K is finite, the crucial scaling\ncondition Ω̄ = Θ(N ) holds for a wide range of N , as hinted\nby previous works (See the simulation result with a practical\nparameter set in [34, Figures 2 and 5]). However, for extremely\nlarge N , the scaling becomes Ω̄ = Θ(1).\nR2.2 From a different angle, the backoff procedure of\n802.11 along with its setting K = 6 is intentionally designed\nso that the successful attempt intensity of each node 1/Ω̄ is\nkept being of the order of 1/N for a wide range of N , by\nallowing enough number of backoffs for each packet.\nWhat is the premise of Poisson limit?: The question remains\nwhether the approximation is precise even for t = ∞. As Whitt\ndiscussed in [41, Chapter 9.8], the underlying assumption of\nthe Poisson limit theorem (Lemma 2) is that t is finite. In the\nmeantime, the basic premise of the Poisson limit theorem is\nthat the component process An (t) should become sparse (Ω̄ =\nΘ(N )) [40, pp.83]. If we allow t → ∞ at the same time as\nN → ∞, An (t) may not remain sparse. This is essentially why\nwe must adopt an another approximation in Section VI where\n\n\f7\n\nt = Θ(N ). In the light of these points, the above theorem\nprovides a natural approximation of the backoff processes on\nnormal time-scale, as compared with the other approximation\nin Section VI on coarse time-scales.\nV. A SYMPTOTIC A NALYSIS\nA stochastic process with infinite variance and selfsimilarity exhibits phenomena called Noah effect and Joseph\neffect, respectively, in Mandelbrot's terminology [36], [41].\nNoah and Joseph effects refer to the biblical figures Noah,\nwho experienced an extreme flood – exceptionally large values\n– and, Joseph, who experienced long periods of plenty and\nfamine – self-similarity or strong positive dependence. This\nsection lifts the veil to discover these effects and to explain\ntheir influences on the backoff process in 802.11. We have\nnot assumed K = ∞ because all results derived so far are\napplicable if either of finite and infinite K is used (See Remark\n2 also). However, all results derived in this section require\nK = ∞, hence we formally assume the following.\nA.5 There are infinite backoff stages, i.e., K = ∞.\nA. Moment Analysis\nWe introduce the notion of a wide-sense heavy-tailed distribution borrowed from [32]. We call a pdf f (x) wide-sense\nheavy-tailed if its moment generating function is infinite, i.e.,\nR ∞ tx\ne f (x)dx = ∞, ∀t > 0.\n0\n\nWe now characterize the existence of all fractional moments\nof Ω. Let us define\nα := −(log γ)/log m\n\nfollows from c > 1. Hence, from the last expression, we have\nE[Ωc ] → ∞ as K → ∞. Note that c is real. Since there exist\ninfinite moments, Ω has a wide-sense heavy-tailed distribution.\nNow consider the cth moment for 1 < c < α.\n\u0011c i\nh\u0010P\n\u0002 Pκ\nP∞\nc\u0003\nk\n* P[κ = k]\nE ( k=0 Bk ) = k=0 E\nk′ =0 Bk′\ni\nh\nP\nP∞\nc\nk\n(11)\n≤ k=0 E (k + 1)c−1 k′ =0 (Bk′ ) * P[κ = k]\n′\nk\nc\nP∞\nPk\nm −1)\n* P[κ = k]\n(12)\n= k=0 (k + 1)c−1 k′ =0 (2b0(c+1)\nc k+1\nc P\n∞\n−1\n0)\nc−1 (m )\n* P[κ = k]\n≤ (2b\nk=0 (k + 1)\n(c+1)\nmc −1\nc P\nc k+1 k\n∞\nγ\n0)\nc−1 (m )\n≤ (2b\n(13)\nk=0 (k + 1)\n(c+1)\nmc −1\nP∞\n(2b0 m)c\n= (c+1)(mc −1) k=0 (k + 1)c−1 (mc γ)k\n(14)\n\nwhere (11) can be obtained by applying original Hölder's\ninequality, i.e.,\n\u0011 c−1\n\u0011 \u0010P\n\u0010P\n\u00111\n\u0010P\nc\nc\nk\nk\nk\nc c\nc−1\n.\nk′ =0 1\nk′ =0 (bk′ )\nk′ =0 1 * bk′ ≤\nR c\n(12) can be verified by computing b fk′ (b)db where fk′ (b)\n′\nis a uniform pdf with mean b0 mk − 1/2. (13) follows from\nP[κ = k] ≤ γ k . Then it suffices to show that d'Alembert's\nratio of the series (14) is less than one. Recalling that mc γ <\nmα γ = 1, we can see that\n(k + 2)c−1 (mc γ)k+1\n= mc γ < 1.\nk→∞ (k + 1)c−1 (mc γ)k\nlim\n\nThis establishes (14) is finite for K = ∞, and completes the\nproof.\nRemark 3 [Answer to Q4] This theorem reveals that Ω is\nwide-sense heavy-tailed in the sense that not all of its moments\nexist, as Sakurai and Vu [34, Theorem 1] first noted.\n\nwhere α > 1 is satisfied by Lemma 1. Also it is remarkable\nthat Sakurai and Vu [34] established a similar result for integer\nmoments. Note however that we cannot prove Theorem 3\nwithout the following extended result for fractional moments.\n\n2\nAs shown in Fig. 1, the variance σΩ\nin 802.11b is not\nvery large. Nevertheless, the statistics of Ω certainly contain\nprecursors of infinite-variance distributions, as shown in the\nnext section.\n\nTheorem 2 (Existence of Fractional Moments)\nThe per-packet backoff Ω has a wide-sense heavy-tailed distribution. In addition, its cth moment E[Ωc ] is\n\nB. Strict-Sense Heavy-Tailedness: Tauberian Insights\n\n•\n•\n\ninfinite if c ≥ α,\nand finite if 0 ≤ c < α.\n\nProof: First we note α = −(log γ)/log m is equivalent to\nmα γ = 1. It also follows from Lemma 1 that α > 1. Letting\nc be any real number such that c ≥ α, we have mc γ ≥ 1.\nThen the cth moment of Ω, E[Ωc ], can be computed as\n\u0011c i\nh\u0010P\nP∞\nk\n′\nB\n* P[κ = k]\nE\n′\nk\nk =0\nk=0\ni\u0011\n\u0010\nh\nc\nP\nPk\n≥ ∞\n* P[κ = k]\nk=0 E\nk′ =0 Bk′\n\u0011c\n\u0010\nP∞ Pk\n1\nk′\n)\n* P[κ = k]\n= k=0\n(b\nm\n−\n′\n0\nk =0\n2\nP∞ Pk\n′\n≥ k=0 k′ =0 (b0 mk − 12 )c * P[κ = k]\nP\n1 c k\nk\n= ∞\nk=0 (b0 m − 2 ) γ\n\nwhere the first inequality holds by Hölder's inequality for\nexpectations, i.e., (E[X])c ≤ E[X c ], and the second inequality\n\nAlthough there has been some work to prove the wide-sense\nheavy-tailedness of the delay or backoff duration [34] and the\npower-law like behavior of access delays was identified only\nthrough simulations in a few works [34], [37], to the best of\nour knowledge, none of them proved that the delay or backoff\nduration has a power-law tail. This quite intuitive property has\nnot been established mainly due to the theoretical difficulties\nunderlining the proof. It is important to note that this theorem\nis a prerequisite for mathematical analysis of Noah effect,\nwhich implies strict-sense heavy-tailedness.\nWe would like to place particular emphasis on the following\ntheorem for another reason. We note that some work [21], [39]\nconsidered the question whether a single long-lived TCP flow\ncan generate traffic that exhibits long-range dependence (or,\nequivalently, asymptotical second-order self-similarity). It is\nsignificant that long-range dependence is a property which is\nautomatically implied by heavy-tailed inter-arrival times [30]\nfor the single flow (or node) case, irrespective of the context.\n\n\f8\n\nTheorem 3 (Power Tail Principle3 )\nThe per-packet backoff Ω has a Pareto-type tail with an\nexponent of −α. Formally,\nZ ∞\nFΩc (x) :=\nfΩ (x)dx ∼ x−α l (x) .\n(15)\nx\n\nThe notation f (x) ∼ g(x) means limx→∞ f (x)/g(x) = 1,\nand l (x) is slowly varying4.\nRemark 4 This principle, formulated in terms of the ccdf\nFΩc (*), not only defines a fundamental characteristic of delay\nbut also lays the groundwork for further analysis using regular\nvariation theory.\nR4.1 [Answer to Q4] This clear-cut and simple result\nreveals the statistical attribute of Ω for any population N . It\nhas a Pareto-type distribution whose exponent parameter is\n−α. Theorem 3 proves the strict-sense heavy-tailedness of\nΩ for α < 2, and puts an end to the discussions in Section I.\nR4.2 This theorem dispenses the complicated convolution\nexpression (4) and leads us to a simpler conclusion. The most\nrepresentative distribution of backoff times Ω is a truncated\nPareto-type distribution (though it must be slowly-varying),\nrather than uniform or exponential as observed in the simulation studies of [5], [12].\nR4.3 The simplistic term l(*) in (15) is irreplaceable with\nany other expressions, implying its pivotal role. For instance,\nFinal Value Theorem tells nothing but limx→∞ fΩ (x) = 0.\nThe ccdf of Ω obtained through ns-2 simulations is plotted\nin Fig. 2 on a log-log scale where the estimated slopes α̂ are\ncompared with the analytical formulae α = −(log γ)/ log m,\n(FPE1) and (FPE2). Observe that these simple formulae along\nwith (15) provide a precise estimate for the tail distribution.\nRemarkably, even for K = 6, i.e., the value adopted in\n802.11b, the ccdf of Ω can be accurately approximated by\na truncated power-law tail.\n3 The\n\nproof in fact requires α to be not an integer. For the complicated case\nwhen α is an integer, we refer to [19] and [10, Theorem 8.1.6]. However,\nsince an integer α can be approximated for any small ǫ > 0 by a real number\nα̃ such that |α − α̃| < ǫ, we expect the result of Theorem 3 to be valid for\nall α > 0.\n4 A function f (x) is called regularly varying [10] at infinity of index ρ\niff limx→∞ f (λx)/f (x) = λρ , ∀λ > 0. For the special case ρ = 0, it is\ncalled slowly varying and usually denoted by l(x). For example, a positive\nconstant, (log x)ǫ for any real number ǫ is a slowly varying function. A\nslowly varying function l(x) is dominated by any positive power function,\ni.e., limx→∞ l(x)/xǫ = 0, ∀ǫ > 0.\n\n10\n\n10\n\n0\n\n−1\n\nւ\n10\n\n10\n\nα̂ = 1.01\nα = 1.07\n\n−2\n\nα̂ = 1.76\nր\nα = 1.81\n\n−3\n\nΩ\n\nccdf (Fc (x))\n\nThat is, even a renewal process (no correlation of inter-arrival\ntimes) with heavy-tail distributed inter-arrival times generates\nlong-range dependence in the counting process. In the light of\nthis point, one do not need to conduct analyses of tremendous\ntraffic traces if there is a solid mathematical work that can\nsettle this kind of dispute.\nIn the following theorem, we prove that the per-packet\nbackoff distribution has a power tail by lighting upon the fact\nthat the moment generating function has a recursive relation,\nand by applying the theory of regular variation [10] and the\nless-known modified Tauberian theorem of Bingham & Doney\n[9]. For your own good, note that this theorem requires only\nK = ∞, nothing about N .\n\n10\n\n10\n\n−4\n\nւ\n−5\n\nւ\n10\n\n10\n\nα̂ = 1.15\nα = 1.18\n\n−6\n\n−7\n\n10\n\nα̂ = 1.78\nα = 1.83\n\nsimulation: K=6, N=10\nsimulation: K=15, N=10\nsimulation: K=6, N=40\nsimulation: K=15, N=40\n0\n\n10\n\n1\n\n2\n\n10\n\n10\n\n3\n\n10\n\n4\n\n10\n\n5\n\n6\n\n10\n\nper−packet backoff (x)\nc (x) for K =\nFig. 2. Complementary cumulative distribution function FΩ\n6, 15; and N = 10, 40.\n\nVI. S HORT-T ERM FAIRNESS A NALYSIS\nFirst of all, we cancel the assumption K = ∞ we made\nin Section V because we present in this section a new\napproximation for the superposition process and short-term\nfairness analysis, both of which will be applicable to both\ncases K < ∞ and K = ∞.\nA. Inter-Transmission Probability\nThe notion of short-term fairness [5], [12], [26], defined\nas the distribution of successful transmissions of nodes for a\nfinite time, has been getting the limelight due to its central\nrole in quantifying the behavior of random access protocols\nover short time-scales and its close link to access delays.\nAmong the set of nodes {1, * * * , N }, we tag node N , without\nloss of generality. Assume that the tagged node successfully\ntransmitted a packet at time t = 0. Denote by Zn the number\nof packets successfully transmitted by node n while the tagged\nnode transmits ζ packets. Recalling that An (t) counts the\narrivals during the interval (0, t], we can see\nZn := An (t′ ) where t′ = min{t : AN (t) = ζ}.\nIt is clear that ZN = ζ from the above definition. For shortterm fairness analysis, we consider\nZ=\n\nPN −1\nn=1\n\nZn .\n\nFor the sake of convenience, we denote P[Z = z|ZN = ζ] by\nPN [z|ζ]. We call the conditional probability PN [z|ζ] intertransmission probability. In terms of the point processes\nAn (t), it is equivalent to\n\u0011\ni\nhP\n\u0010\nN −1 n Pζ\n=\nz\nPN [z|ζ] = P\nA\nΩ\nj\nn=1\nj=1\nwhere Ωj denotes the per-packet backoff for each jth packet\nof the tagged node N and are i.i.d. copies of Ω.\n\n\f9\n\nB. Intermediate Telecom Process on Coarse Time Scales\nThe premise\ndoes not hold: Look into\nPN −1\nPζ the above superposition\nprocess n=1 An (t) where t = j=1 Ωj . Recall the basic\npremise of Poisson limit theorem (Lemma 2) is that each\ncomponent process must become sparse as N grows. It is\neasy to see thatPthis premise does not hold any longer here\nζ\nbecause t =\nj=1 Ωj is of order of ζ * Ω̄ in the sense\nthat E[t] = Θ(ζ Ω̄) and Ω̄ is of order of N in most cases\n(See Remark 2). Therefore, we need a new approximation\nof the superposition process on coarse time-scales such that\nt = Θ(N ).\nBefore that, we epitomize theory of stable law [41, Chapter\n4] briefly only for the case α ∈ (1, 2]. Denote by Sα (σ, β, μ)\nLévy α-stable laws whose four parameters are: the index α; the\nscale parameter σ; the skewness parameter β; and the mean\nμ. If X1 , * * * , Xn are i.i.d. copies of Sα (σ, β, μ), they satisfy\nthe stability property which takes the following form\nPm\n\ni=1 (Xi\n\nd\n\n1\n\n− μ) = m α (X1 − μ)\n\nd\n\nwhere the notation = means equality in distribution. The case\nα = 2 is singular because we have S2 (σ, β, μ) = N(μ, 2σ 2 )\nwhere β plays no role. However, for the rest of cases α ∈\n(1, 2), there is no closed form expression for its pdf.\nSince Leland et al. [29] created a wave of interest in the\nself-similarity in the Internet, the probabilistic community\nhas been concerned with the limit processes of aggregate\nrenewal processes under different limit regimes. Here a point\nat issue was the order of limit operations, i.e., t → ∞ and\nN → ∞. Recently, Kaj et al. [22], [24], [25] have established\na fundamental connection between Noah effect and Joseph\neffect, elucidating the above issue as well.\nAggregate Process on Coarse Time Scales: A premise of [24,\nTheorem 1] is that each component process should not become\nsparse as N grows, i.e., inter-arrival times not scaling with\nN . This premise is fully satisfied when we consider An (Ω̄t)\ninstead of An (t). In other words, we now view An (τ ) on\ncoarse time-scales τ = Ω̄t. Also note that E[An (Ω̄t)] = t.\nThen applying [24, Theorem 1] yields to the following result\nwhich is applicable to various cases K = ∞, K < ∞, finite\ntime (which must be large enough though), and infinite time.\nTheorem 4 (Dichotomy of Aggregation: Second Part5 )\nSuppose, for K = ∞, the inter-arrival times of An (Ω̄t)\nhas ccdf FΩc (Ω̄x) in (15) which does not vary with N . For\nK < ∞, nothing is assumed. Define the centred superposition\nprocess\nn\no\ne := PN An (ζ Ω̄t) − N ζt.\nA(t)\nn=1\n\nThen, as ζ → ∞ and N → ∞, we have\n\u0012 \u0013\ne\nt\nA(t)\nweakly\n, for K = ∞, α ∈ (1, 2), (16)\n−→ −c * Yα\nζ\nc\n\u001a\ne\nA(t)\nweakly\nfor K < ∞,\n√\n−→ vΩ * B(t),\n(17)\nfor K = ∞, α ∈ (2, ∞),\nNζ\n\nwhere the scaling constant c := {N Ω̄−α l(ζ Ω̄)}1/(α−1) /ζ,\nB(*) is a standard Brownian motion, and Yα (*) belongs to\n\nthe family of Intermediate Telecom process [25] of index α\nwhose cgf takes the form\n\u0001\n\u0002\n\u0003\n1−α\nlog E eθYα (τ ) = τα−1 eθτ − 1 − θτ\n\u0001\n\u0001\nRτ\n+ 0 eθx − 1 − θx ατ x−α−1 + (2 − α)x−α dx. (18)\n\nProof: First, for K = ∞, the ccdf of inter-arrival \u0001times\nof An (Ω̄t) now satisfies FΩc (Ω̄x) ∼ x−α Ω̄−α l Ω̄x due\nto its scaling. From E[An (Ω̄t)] = t, the mean inter-arrival\ntime is one.\n\u0001 It follows from the underlined assumption that\nΩ̄−α l Ω̄x does not scale with N and it is a slowly-varying\ne\nfunction of x. Applying [24, Theorem 1] yields that A(t)/ζ\nweakly converges to the process in (16).\nFor the rest of cases, (i) K < ∞ and (ii) K = ∞ and α ∈\n(2, ∞), we do not need any assumption because E[Ω2 ] < ∞\nholds both for (i) and (ii) by appealing to Theorem 2. These\nfinite variance cases were analyzed in [36, Section 2.1.3(a)]\nwhose 'ON/OFF source model' reduces to our model if we\nuse μ1 = 1 and μ2 ≫ 1. Remark that it is discussed in [36,\nSection 2.3] that the order of limit operations does not matter\nin these cases.\nThe phrase 'as ζ → ∞ and N → ∞' is pregnant with\nmeaning. The fundamental strength of the above theorem\nfor the case of (16) is in that its result is not subject to\nthe order of limit operations. Instead, the scaling structure\nbetween ζ and N , represented by c, determines the kind of\nthe approximation in the sense that, as c → 0 and c → ∞,\nc1/α Yα ( ct ) and cH Yα ( ct ) respectively converges to Λα (t) (αstable Lévy motion) and BH (t) (fractional Brownian motion\nof index H = (3 − α)/2), up to constants [22]. For finite\nc ∈ (0, ∞), Yα ( ct ) becomes an in-between process. For the\ncase of (17), even this scaling structure does not matter.\nIt is significant that c → 0 and c → ∞ respectively\nequivalent to limN →∞ limζ→∞ and limζ→∞ limN →∞ in the\nliterature. Therefore, the essence of the advance [24, Theorem\n1] is that it has emancipated the limit form of the superposition process from the order of the two limit operations,\nwidening the applicability of the theory.\nRemark 5 Though, for K = ∞, the underlined phrase\nmakes a strong assumption which is not reasonable in view\nof α = −(log γ)/ log m which heavily depends on N , the\nabove theorem deserves its result in the sense that it suggests\na possible approximation of the backoff process in 802.11,\nbased on the state-of-the-art theory. We will come back to the\npreciseness of the approximation later in Remark 7 where we\nobserve that α is required to be not too close to 1.\nR5.1 As we have discussed in Footnote 5 and [41, Chapter\n9] as well as at the beginning of this section, Poisson approximation in Theorem 1 is poor on coarse time-scales, i.e., large\ntime. Therefore, for short-term fairness analysis, the following\n5 Consistency between (17) and Theorem 1: Suppose K = ∞ and\nα ∈ (2, ∞) (which is very unlikely as N must be large). Then assume\nthe superposition process A(ζ Ω̄t) is Poisson. For large ζ Ω̄, this Poisson\nprocess should have a Gaussian marginal distribution with mean N ζt and\n2 N ζt.\nvariance N ζt, whereas the process (17) has mean N ζt and variance vΩ\nTherefore, Theorem 1 is inconsistent with (17) for vΩ 6= 1. The inconsistency\nis due to the premise of Theorem 1, i.e., finite time. A similar remark is given\nin [41, Remark 9.8.1].\n\n\f10\n\napproximations inspired by (16) and (17) are essential:\n\u0012 \u0013\nt\ne\nA(t) ≈ −ζ * c * Yα\n,\nfor K = ∞, α ∈ (1, 2), (19)\nc\np\ne ≈ N ζ * vΩ * B(t),\notherwise. (20)\nA(t)\n\nR5.2 [Answer to Q5] It turns out that for KP= ∞ and α ∈\nN\nn\n(1, 2), the superposition process A(ζ Ω̄t) =\nn=1 A (ζ Ω̄t)\nexhibits long-range dependence due to the heavy power tail\nof inter-arrival times Ω. This process is non-Gaussian and nonstable and has stationary, but strongly dependent, increments\nin the sense that it has the same covariance as a multiple of\nfractional Brownian motion of index H = (3 − α)/2 [22].\nIt is also shown in [22] that this process is (both locally and\nglobally) asymptotically self-similar though not self-similar.\nWe believe that networking community has been longing for\na mathematical evidence which makes extensive simulations\nin [37] less necessary.\nTurning back to the discussion of inter-transmission probability PN [z|ζ] in Section VI-A, we demonstrate the strength of\nthe above approximations in the following corollaries where\nζ is now taken to be number of packets transmitted by the\ntagged node.\nCorollary 1 (Asymp. Inter-Transmission Probability)\nSuppose ζ ≫ 1 and N ≫ 1. If K = ∞ along with α ∈ (1, 2),\nwe have\nZ ∞ Z q+ (τ (y))\nPN [Z = z|ζ] ≈\nTcτ (y)/c (x)dx * Lv(y)dy\n−∞\n\nq− (τ (y))\n\n(21)\n\nwhere q± (τ (y)) := − {z ∓ δ − (N − 1)ζ * τ (y)} /(ζc), δ =\n1/2, τ (y) := 1+ζ (1−α)/α l0 (ζ)*y. Here l0 (*) is slowly varying\nat infinity, Tcτ (*) is the pdf of Yα (τ ) whose cgf is given\nby (18), and Lv(*) is the pdf of Sα (1, 1, 0) whose index is\nα = −(log γ)/log m.\n\nProof: Under the assumption\nP −1ζ n≫ 1 and N ≫ 1, it\nfollows from Theorem 4 that N\nn=1 A (ζ Ω̄t) can be approximated by an Intermediate Telecom process so that its marginal\ndistribution takes the form\nhP\ni\n\u0001\nN −1 n\nP\nζ Ω̄t = z\nn=1 A\n≈ P [(N − 1)ζt − ζcYα (t/c) ∈ (z − δ, z + δ)]\n\n= P [Yα (t/c) ∈ (q− (t), q+ (t))]\nhR\ni\nq (t)\n= P q−+(t) Tct/c (x)dx .\n\n(22)\n\nIn the meantime, it follows from the definition of skewness β\nand fΩ (−x) = 0, ∀x > 0 that\nβ :=\n\nc\n2FΩ\n(x)\nlimx→∞ F c (x)+R −x\nf (x)dx\nΩ\n−∞ Ω\n\n− 1 = 1.\n\nPζ\nPut t =\nj=1 Ωj /(ζ Ω̄). Applying the lesser-known stablelaw central limit theorem [41, Theorem 4.5.1] to the power\ntailedness result of Theorem 3, taken together with the fact\nβ = 1, it follows that, for ζ ≫ 1,\nd\n\nt ≈ 1 + ζ (1−α)/α * l0 (ζ) * Sα (1, 1, 0).\nPlugging this line into (22) yields (21).\n\nCorollary 2 (Inter-Transmission Probability)\nSuppose ζ ≫ 1 and N ≫ 1. If K < ∞, or K = ∞ along\nwith α ∈ (2, ∞), we have\n\u0013\n\u0012\nz − (N − 1)ζ\n√\n(23)\nPN [z|ζ] ≈ Nm\n(N − 1) ζvΩ\nwhere the CV vΩ is given by (9), and Nm(x) :=\n\n2\n\nx\n√1 e− 2\n2π\n\n.\n\nProof: Likewise, we have\nhP\ni\n\u0001\nN −1 n\nP\nA\nζ\nΩ̄t\n=\nz\nn=1\n\u0002\n\u0001\n\u0003\n2\n≈ P (N − 1)ζt + N 0, vΩ\n(N − 1)ζt ∈ (z − δ, z + δ) .\n!#\n\"\nz − (N − 1)ζt\np\n(24)\n≈ P Nm\nvΩ (N − 1)ζt\n\u0001\nwhere N μ, σ 2 is the Gaussian random variable with mean\nP\nμ and variance σ 2 . Putting t = ζj=1 Ωj /(ζ Ω̄), t is approximated by\n\u0001 d\nvΩ\nd 1\n2\nζ = 1 + √ * N (0, 1)\nt ≈ * N ζ, vΩ\nζ\nζ\nfor ζ ≫ 1. Thus (24) becomes\n\n\u0001\n√\nZ ∞\nz − (N − 1) ζ + ζvΩ x\n\nNm  q\n\u0001 Nm(x)dx\n√\n−∞\nvΩ (N − 1) ζ + ζvΩ x\n\nwhich is approximated\nas (23) because the denominator\n√\nvΩ (N − 1)1/2 (ζ + ζvΩ x)1/2 is very large so that the first\npdf of √\nthe integrand\nis concentrated around z = (N −\n\u0001\n1) ζ + ζvΩ x .\nRemark 6 The derived equations provide us several penetrating insights and answers to Q2 as well. Note that the mean\nand variance of (21) are given by\nP∞\nZ̄ := z=0 z * PN [z|ζ] ≈ (N − 1)ζ\n\u0001\nP∞ 2\n2\n2\nσZ\n:=\n(25)\nz=0 z * PN [z|ζ] − Z̄ ≈ ∞,\nwhile those of (23) are given by\nZ̄ ≈ (N − 1)ζ,\n\n2\n2\nσZ\n= (N − 1)2 ζ * vΩ\n.\n\n(26)\n\nR6.1 For the case of (23), we can say that Z is approximately Gaussian for large ζ and N :\n\u0001\nd\n2\nZ ≈ N (N − 1)ζ, (N − 1)2 ζvΩ\n(27)\nwhereupon the CV of Z can be computed from (26) as\np\n(28)\nvZ := σZ /Z̄ ≈ vΩ / ζ.\n\nRemarkably, we have derived the most general expression\nof the inter-transmission probability PN [z|ζ] while [5], [12]\nderived the expressions of PN [z|ζ] only for N = 2.\nR6.2 (21) cannot be simplified in general. However, for for\nvery large ζ, hence very small c, it can be easily seen that\nZ has a Lévy α-stable distribution. Applying [22, Proposition\n2] to the right-hand side of (16) yields that it is negligible,\nimplying that the inner integral of (21) can be removed. Then\nZ becomes approximately Lévian and is expressed in the form\nd\n\n1\n\nZ ≈ Sα ((N − 1)ζ α l0 (ζ), 1, (N − 1)ζ).\n\n\f11\n\n−4\n\nx 10\n\ninter−transmission probability PN[z|ζ]\n\n5\n\nK=6\n\n4\n\nZ̄ = 3900\n\nZ̄ = 5900\n\n3\n2\n1\n0\n\n0\n\n1000\n\n2000\n\n3000\n\n4000\n\n5000\n\n6000\n\n7000\n\n8000\n\n9000\n\n10000\n\n−4\n\nx 10\n5\n\nsimulation: N=40\nsimulation: N=60\nanalysis: N=40\nanalysis: N=60\n\nK=15\n\n4\n3\n2\n1\n0\n\n0\n\n1000\n\n2000\n\n3000\n\n4000\n\n5000\n\n6000\n\n7000\n\n8000\n\n9000\n\n10000\n\nnumber of transmissions by N−1 nodes (z)\n\nFig. 3. Inter-transmission probability PN [z|ζ] for ζ = 100; K = 6, 15;\nand N = 40, 60.\n\nThis manifests the heavy-tail of Z, i.e.,\nP[Z > x] ≈ ζ{(N − 1)l0 (ζ)}α Cα * x−α\n\n(29)\n\nwhere l0 (*) is the same function used in τ (y) in (21) and\nCα = (α − 1)/ (Γ(2 − α) sin(π(α − 1)/2)) .\nR6.3 For the case of K = ∞ and α ∈ (1, 2), the representation (29) reveals the striking similarity between the ccdfs of Ω\nand Z. In terms of regular variation theory, both are regularly\nvarying of index −α, and in Mandelbrot's terminology, Noah\neffect of Ω infiltrates into Z.\nR6.4 For the case of K = ∞, the inter-transmission\nprobability bifurcates into two different categories at α = 2\n(or γ = 1/m2 ). Plainly speaking, if γ < 1/m2 , Z can still be\napproximated by the Gaussian distribution in (27), otherwise\n802.11 suffers from extreme unfairness containing precursors\nof power-tailed characteristics such as infinite variances and\nthe skewness (β = 1).\nR6.5 The skewness induces leaning tendency and directional unfairness. The leaning tendency implies the distribution is heavily leaning to the left, and the tendency increases\nas α decreases. The directional unfairness6 implies that while\nthe right part of the inter-transmission probability z ∈ (Z̄, ∞)\nhas a heavy power tail given by (29), its left part z ∈ (−∞, Z̄)\ndecays faster than exponentially [41, pp.113].\nWe conjecture based on extensive simulations that l(*) in\n(15) is approximately a constant, implying that l0 (*) in τ (y)\nin (21) is also a constant. Then it follows that the constant l\ncorresponds to the y-intercept of the straight line obtained by\ntaking logarithms of (15), and can be estimated from Fig. 2.\nAfter manipulation akin to [41, Theorem 4.5.2], we can show\na simple relation between them:\nl0 = (l/Cα )1/α /Ω̄\n6 The Lévy α-stable law used in this work has support on the entire real\nline because α ∈ (1, 2).\n\nwhich implies that we need to estimate only l and α.\nIn Fig. 3, the inter-transmission probability obtained through\nns-2 simulations is compared with the derived formulae of\nCorollaries 1 and 2 for ζ = 100. It is significant that, for K =\n6, PN [Z = z|ζ] is well approximated by Gaussian formula\n(23) along with (9), (FPE1) and (FPE2) for large N . This\nforms a striking contrast with the case K = 15 where the\ndistribution (21) is leaning to the left and its peak is far apart\nfrom its mean, i.e., Z̄ = (N − 1)ζ, meaning that there are\neven heavier tails on the right part. Our extensive simulations\nattested to the inevitability of complicated form (21).\nRemark 7 Preciseness of the approximation (19): remains a\nquestion due to the underlined assumption of Theorem 4. Note\nthat N is determined by α = −(log γ)/ log m provided that\nα is fixed, whereas [24, Theorem 1] demands that N → ∞\nprovided that α is fixed. Through extensive simulations, we\nhave found out that the approximation (19) becomes poor\nas α → 1 (or as N → ∞). Under the above simulation\nsetting, if N > 80, the approximation appears not reasonable.\nA thorough theory addressing this dependence between N and\nα is left for future work.\nVII. WAVELET A NALYSIS\n\nOF\n\nL ONG -R ANGE D EPENDENCE\n\nWe provide simulation results to support the argument over\nthe long-range dependence in Section VI-B under the assumption K = ∞. Recall from Theorem 4 that the time-scaled\nversion of the superposition arrival process is approximately\n\u0001\nPN\nA(ζ Ω̄t) = n=1 An (ζ Ω̄t) ≈ N ζt − ζc * Yα ct\n\nwhich holds for N such that α = −(log γ)/ log m < 2. Note\nthat such N is to ensure Ω is strict-sense heavy-tailed (See\nTheorem 3). Then by appealing to [22], one can show that\nA(ζ Ω̄t) has long-range dependent increments in the sense that\n•\n\nA(ζ Ω̄t) has the same covariance as a multiple of fractional Brownian motion of index H := (3 − α)/2.\n\nIt is easy to see that 1/2 < H < 1 due to 1 < α < 2.\nAll simulations obtained from ns-2 simulator use a 437h\nwarm-up period, after which we collected 728h-long traces.\nTo analyze these traces, we use the latest addition to the toolkit\nof inference techniques for long-range dependence, i.e., the\nrefined wavelet-based method using Daubechies wavelets with\nM vanishing moments which was proposed by Abry et al. [2]\nThey proposed the first unbiased estimator yj taking the form\n\u0002 \u0003\u0001\nE[yj ] = log2 E d2j ,\n\nconsidering the complication presented by the property\nE[log(*)] 6= log(E[*]) where dj is called detail processes of\nthe wavelet transform.\nThe estimates yj of the wavelet spectra over all time-scales\nj, called octaves, are shown in Fig. 4 for K = 6, K = 15\nand K = 25. Here we fix the other parameters as N = 40\nand M = 2. Though we present here only the simulation\nresults using Daubechies wavelets with M = 2, we obtained\nsimilar results using Daubechies wavelets with M > 2 and\nDiscrete Meyer wavelets. To quantify the integrity of the\nmethod, Gaussian 95% confidence intervals corresponding to\n\n\f12\n\nLogscale Diagram, [(j1, j2)= (5, 18), s Est.=0.00, H Est.=0.50]\n\nLogscale Diagram\n\nLogscale Diagram, [(j1, j2)= (12, 18), s Est.=0.66, H Est.=0.83]\n\n11\n\n11\n\n11\n10\n\n10\n\n9\n\n9\n\n10\n\nj\n\n8\n\ny\n\nyj\n\ny\n\nj\n\n9\n8\n\n8\n7\n\n7\n\n6\n\n6\n\n5\n\n5\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\n16\n\n18\n\n7\n6\n\n2\n\nOctave j (time−scale 2j+7 backoff time−slots)\n\n(a) K = 6, N = 40\nFig. 4.\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\nOctave j (time−scale 2j+7 backoff time−slots)\n\n(b) K = 15, N = 40\n\n16\n\n18\n\n5\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\n16\n\n18\n\nOctave j (time−scale 2j+7 backoff time−slots)\n\n(c) K = 25, N = 40\n\nWavelet spectra using Daubechies wavelets with M = 2.\n\nthe variability of yj are also shown as the vertical segments\ncentered on the estimates yj . Then the measurement of index\nH, called Hurst parameter, is reduced to the identification\nof region of alignment, the determination of the its lower\nand upper cutoff octaves, j1 and j2 , respectively, and the\ndetermination of the slope over the alignment region which\nwe denote by s̄. From the slope estimate s̄, we can obtain the\nestimates of H from the formula\nH̄ := (1 + s̄)/2.\nFig. 4(c) demonstrates that, for the case K = 25, the\nsuperposition arrival process possesses a sustained correlation\nstructure over a broad range of time-scales j ∈ [1, 18] where\nsj converges to 0.66 at octave j = 18, whereas, for the case\nK = 6, it shows a weaker correlation structure over a narrow\nrange j ∈ [1, 5] as shown in Fig. 4(a). The estimate of H\nfor K = 25 over the alignment region (j1 , j2 ) = (12, 18)\napproaches H̄ = 0.83 around (16, 17) which approximately\nmatches with analytical formula H = (3 − α)/2 = 0.90\nwhere α is obtained from α = (log γ)/ log m, Eqs. (FPE1)\nand (FPE2). The slope estimate over the alignment region for\nK = 6 is computed as H̄ = 0.50, implying that long-range\ndependence is not observed. A striking observation that can\nbe made by comparing Figs. 4(a) and 4(b) with Fig. 4(c) is\nthat the per-octave slope sj increases as octave j increases and\nconvergent only if K is large enough as in Fig. 4(c).\nObservation 1 (LRD over coarse times scales)\nLong-range dependence of the superposition process is conspicuous only over coarse time-scales.\nRemark 8 Essentially, there are two reasons behind this phenomenon which also give us answers to Q5.\nR8.1 Per-node process slows down: It is important to\nrecall that, for K = ∞, we first established Poisson process\napproximation for the superposition process in Theorem 1,\nmeaning that we cannot observe long-range dependence on\nnormal time-scales. As is the constant intensity of the superposition process for Theorem 1, the constant intensity of the\ncomponent process is essential for Theorem 4. To satisfy the\nlatter, we had to consider An (ζ Ω̄t) instead of An (t) because\nAn (t) becomes sparser as N → ∞. That being said, we\nmust view the superposition process over coarse time-scales\nζ Ω̄t instead of t to satisfy the premise of Theorem 4, which\n\nexplains long-range dependence.\nR8.2 Additional scaling of time: Another assumption of\nthe limit regime considered in [24] is ζ → ∞ at the same time\nas N → ∞. This implies we need additional scaling of time\nto compensate for the scaling of space.\nR8.3 In practical terms, if the wireless link capacity is\nshared by many nodes, the aggregate transmission process\nis highly invulnerable to long-range dependence for most\npractical K values, essentially due to reduced per-node rate\nand additional time scaling.\nWe also conjecture that the above coarser time scalings\ncaused the empirical analyses of Veres and Boda [39] (in\nthe context of TCP) and Tickoo and Sikdar [37] (in the\ncontext of 802.11) not to support long-range dependence of the\nsuperposition arrival process of TCP sources - they observed\nthat Ĥ ≈ 0.5 (or ŝ = 0), implying short-range dependence.\nThis is because both 802.11 nodes accessing a common base\nstation and TCP flows traversing a common bottleneck link\n(i) have similar backoff mechanisms and (ii) reduce (or slow\ndown) their transmission rates to share the given capacity as\nthe population increases.\nVIII. C ONCLUDING R EMARKS\nBeginning with derivation of per-packet backoff distribution,\nbased on which we studied its coefficient of variation that plays\na key role in formulating short-term fairness in later sections,\nwe have conducted a rigorous analysis of the backoff process\nin 802.11 and provided answers to several open questions.\nThe power-tail principle states that the per-packet backoff\nhas a truncated Pareto-type tail distribution, a simplistic description elucidating existing works. This in turn indicates that\nits heavy-tailedness in the strict-sense inherits from collision\nand paves the way for the rest of analysis. The dichotomy\nof aggregation, proven with the aids of a recent advance [24,\nTheorem 1] in probabilistic community, now tells the whole\nstory of contrary limits of the superposition process, i.e., Poisson process and Intermediate Telecom process, emphasizing\nthe importance of time-scales on which we view the backoff\nprocesses. Thanks to the applicability of [24] widened by the\norder-free scaling operations of time (ζ) and population (N ),\nwe identified long-range dependence in 802.11 and discovered that the inter-transmission probability bifurcates into two\n\n\f13\n\ncategories: either approximately Gaussian or a complicated\ndistribution which, under a limiting condition, simplifies to\nLévy α-stable distribution with α ∈ (1, 2) possessing strong\npower-tail characteristics.\nThough we have also conducted empirical analysis using\nwavelet-based method to support long-range dependence behavior inherent in 802.11, since we are with Willinger et al.\n[42] on the point - of cardinal importance is to advance\nour genuine physical understanding applicable to many other\nsystems, we believe that the essence of our analysis of longrange dependence lies in its mathematical explanation for the\nbehavior. That is, the heavy-tailed inter-arrival time of each\nper-node transmission process causes long-range dependence\nof the aggregate transmission process at the base station\nthough this dependence is seldom observed.\nThese results explore the fundamental principles characterizing the backoff process in 802.11. Some of them recall to\nour mind the beauty of simplicity, governing the asymptotic\ndynamics of 802.11, and the others form the theoretical\ngroundwork of short-term fairness.\nACKNOWLEDGMENT\nThe authors would like to thank Jean-Yves Le Boudec\nfor helpful discussions and penetrating comments which have\nimproved the quality of this work. We also would like to thank\nIngemar Kaj for elaborating upon his work. Lastly, we would\nlike to thank Hans Almåsbakk for making it possible to run\nvery long simulations on a cluster of a dozen processors.\nR EFERENCES\n[1] A. Abdrabou and W. Zhuang. Service time approximation in IEEE\n802.11 single-hop ad hoc networks. IEEE Trans. Wireless Commun.,\n7(1):305–313, Jan. 2008.\n[2] P. Abry, P. Flandrin, M. Taqqu, and D. Veitch. Self-similarity and longrange dependence through the wavelet lens. Theory and Applications of\nLong-Range Dependence, Birkhäuser Boston, pp. 527–556, 2003.\n[3] S. L. Albin. Approximating a point process by a renewal process, II:\nSuperposition arrival processes to queues. Oper. Res., 32(5):1133–1162,\n1984.\n[4] M. Benaı̈m and J.-Y. Le Boudec. A class of mean field interaction\nmodels for computer and communication systems. Perf. Eval., 65(1112):823–838, Nov. 2008.\n[5] G. Berger-Sabbatel, A. Duda, O. Gaudoin, M. Heusse, and F. Rousseau.\nFairness and its impact on delay in 802.11 networks. In Proc. IEEE\nGlobecom, Nov. 2004.\n[6] G. Bianchi. Performance analysis of the IEEE 802.11 distributed\ncoordination function. IEEE J. Select. Areas Commun., 18(3):535–547,\nMar. 2000.\n[7] G. Bianchi, I. Tinnirello, and L. Scalia. Understanding 802.11e\ncontention-based prioritization mechanisms and their coexistence with\nlegacy 802.11 stations. IEEE Network, 19(4):28–34, July 2005.\n[8] P. Billingsley. Convergence of Probability Measures. Wiley-Interscience,\n2nd ed., 1999.\n[9] N. Bingham and R. Doney. Asymptotic properties of supercritical\nbranching processes I: The Galton-Watson process. Advances in Applied\nProbability, 6(4):711–731, 1974.\n[10] N. Bingham, C. Goldie, and J. Teugels. Regular Variation. Cambridge\nUniversity Press, 1989.\n[11] C. Bordenave, D. McDonald, and A. Proutiere. A particle system in\ninteraction with a rapidly varying environment: Mean field limits and\napplications. Networks and Heterogeneous Media, 5(1):31–62, Mar.\n2010.\n[12] M. Bredel and M. Fidler. Understanding fairness and its impact on\nquality of service in IEEE 802.11. In Proc. IEEE Infocom, Apr. 2009.\n[13] P. Brémaud. Markov Chains, Gibbs Field, Monte Carlo Simulation and\nQueues. Springer-Verlag, 1999.\n\n[14] M. Cha, P. Rodriguez, J. Crowcroft, S. Moon, and X. Amatriain.\nWatching television over an IP network. In Proc. ACM IMC, Oct. 2008.\n[15] K.-T. Chen, C.-Y. Huang, P. Huang, and C.-L. Lei. Quantifying Skype\nuser satisfaction. In Proc. ACM Sigcomm, Sept. 2006.\n[16] J. Cho, J.-Y. Le Boudec, and Y. Jiang. On the validity of the fixed point\nequation and decoupling assumption for analyzing the 802.11 MAC\nprotocol. In Proc. ACM Sigmetrics MAMA, June 2010.\n[17] M. Crovella and A. Bestavros. Self-similarity in world wide web traffic:\nEvidence and possible causes. ACM/IEEE Trans. Networking, 5(6):835–\n846, Dec. 1997.\n[18] D. Daley and D. Vere-Jones. An Introduction to the Theory of Point\nProcesses - vol. II: General Theory and Structure. Springer-Verlag, 2nd\ned., 2008.\n[19] A. De Meyer. On a theorem of Bingham and Doney. J. Appl. Probab.,\n19(1):217–220, 1982.\n[20] W. Feller. An Introduction to Probability and Its Applications, vol. 2.\nWiley, New York, 2nd ed., 1971.\n[21] D. Figueiredo, B. Liu, A. Feldmann, V. Misra, D. Towsley, and W. Willinger. On TCP and self-similar traffic. Perf. Eval., 61(2-3):129–141, July\n2005.\n[22] R. Gaigalas. A Poisson bridge between fractional Brownian motion and\nLévy motion. Stochastic Processes and their Applications, 116:447–462,\n2006.\n[23] J. Horrigan. Home broadband adoption 2008. Pew Internet & American\nLife Project, July 2008.\n[24] I. Kaj. Limiting fractal random processes in heavy-tailed systems.\nFractals in Engineering, Springer-Verlag London, pp. 199–218, 2005.\n[25] I. Kaj and M. Taqqu. Convergence to fractional Brownian motion and\nto the Telecom process: the integral representation appoach. Progress\nin Probability, Birkhäuser Verlag Basel, 60:383–427, 2008.\n[26] C. Koksal, H. Kassab, and H. Balakrishnan. An analysis of short-term\nfairness in wireless media access protocols. In Proc. ACM Sigmetrics,\nJune 2000.\n[27] A. Kumar, E. Altman, D. Miorandi, and M. Goyal. New insights from\na fixed-point analysis of single cell IEEE 802.11 WLANs. ACM/IEEE\nTrans. Networking, 15(3):588–601, June 2007.\n[28] B.-J. Kwak, N.-O. Song, and L. Miller. Performance analysis of\nexponenetial backoff. ACM/IEEE Trans. Networking, 13(2):343–355,\nApr. 2005.\n[29] W. Leland, M. Taqqu, W. Willinger, and D. Wilson. On the self-similar\nnature of Ethernet traffic. In Proc. ACM Sigcomm, Sept. 1993.\n[30] L. Lipsky and P. Fiorini. Auto-correlation of counting processes\nassociated with renewal processes. Technical Report, Booth Research\nCenter, University of Connecticut, Sept. 1995.\n[31] A. Proutiere. Pushing mean field asymptotics to the limits: Stability\nand performance of random medium access control. In Proc. Stochastic\nNetworks Conference, ENS, Paris, June 2008.\n[32] T. Rolski, H. Schmidli, and T. Teugels. Stochastic Processes for\nInsurance and Finance. John Wiley & Sons Inc., 1999.\n[33] W. Rudin. Principles of Mathematical Analysis. McGraw-Hill, 3rd ed.,\n1976.\n[34] T. Sakurai and H. Vu. MAC access delay of IEEE 802.11 DCF. IEEE\nTrans. Wireless Commun., 6(5):1702–1710, May 2007.\n[35] G. Sharma, A. Ganesh, and P. Key. Performance analysis of contention\nbased medium access control protocols. IEEE Trans. Inform. Theory,\n55(4):1665–1681, Apr. 2009.\n[36] M. Taqqu, W. Willinger, and R. Sherman. Proof of a fundamental result\nin self-similar traffic modeling. ACM Comput. Commun. Rev., 27(2):5–\n23, Apr. 1997.\n[37] O. Tickoo and B. Sikdar. On the impact of IEEE 802.11 MAC on\ntraffic characteristics. IEEE J. Select. Areas Commun., 21(2):189–203,\nFeb. 2003.\n[38] O. Tickoo and B. Sikdar. Queueing analysis and delay mitigation in\nIEEE 802.11 random access MAC based wireless networks. In Proc.\nIEEE Infocom, Mar. 2004.\n[39] A. Veres and M. Boda. The chaotic nature of TCP congestion control.\nIn Proc. IEEE Infocom, Mar. 2000.\n[40] W. Whitt. Queues with superposition arrival processes in heavy traffic.\nStochastic Processes and their Applications, 21:81–91, 1985.\n[41] W. Whitt. Stochastic-Process Limits: An Introduction to StochasticProcess Limits and Their Application to Queues. Springer-Verlag, 2001.\n[42] W. Willinger, V. Paxson, R. Riedi, and M. Taqqu. Long-range dependence and data network traffic. Theory and applications of long-range\ndependence, Birkhäuser Boston, pp. 373–407, 2003.\n\n\f14\n\nA PPENDIX\n\nThe crucial observation that paves the way for applying\nthe theory of regular variation [10] is the following recursive\nrelation hidden in the underbraced term of (31):\n\nA. Derivation of (9)\nPlugging bk = mk b0 into vΩ = σΩ /Ω̄ yields\nr\nΥ\n\u0011 − 1.\nvΩ = \u0010P\nk\nk 2\nk∈K (b0 m − 1/2)γ\n\n(30)\n\nHere the nominator inside the square root is simplified as\n\u0010P\n\u0011\nK\nk\n2 k\n2\nΥ :=\nk=0 (b0 m − 1/2) γ (1 + vk )\n\u0013\n\u0012\nK\nX\nmk − 1\n− k/2\n+2\n(b0 mk − 1/2)γ k b0\nm−1\nk=1\n!\nK \u0010\n\u0011\nX\nm+1\nk\n2 k\n2\n=\nm−1 + vk (b0 m − 1/2) γ\nk=0\n\n−\n\n2\nm−1 (b0\n\n− 1/2)2 −\n\nK\nX\n\n(b0 mk − 1/2)γ k (k +\n\n2b0 −1\nm−1 )\n\n\u0011k=1\n\u00012\n2\n= k=0 m−1 + vk b0 mk − 12 γ k\n\u0011\n\u0010\n\u0001\n0 −1\nb0 mk − 12 γ k .\n− k + 2b\nm−1\nPK \u0010 m+1\n\nG(x) = γF0 (x) {1 + H(mx)}\nwhere\n\n( k\n\u0001)\n∞\nX\nY 1 − exp −(mi − 1/(2b0 m))x\nγ\nH(x) =\n. (36)\n(mi − 1/(2b0 m))x\ni=0\nk=0\n\nLet α = −(log γ)/log m ∈ R+ and z := ⌈α⌉ ∈ Z+ which\ndesignates the smallest integer not less than α. It follows from\nα > 0 that z ≥ 1. Appealing to Theorem\n2 and the basic\nz\nproperty of the LST, i.e., lims→0+ ddsFzΩ = (−1)z E[Ωz ] for\nz ∈ Z+ , it follows that\nlimx→0+\n\ndz G\ndxz (x)\n\n=\n=\n\n1\ndz G\n+\n(2b0 )z lims→0 dsz (s)\nγ\nz\nz\n(2b0 )z (1−γ) (−1) E[Ω ]\n\ni\n\nlim\n\nx→0+\n\nThroughout the proof, we denote the sets of real numbers\n(positive real numbers), integers (positive integers), and rational numbers by R (R+ ), Z (Z+ ) and Q, to simplify the\nexposition. Denoting the LST of fi (b) by Fi (s), we begin the\nproof by considering the LST of (4):\n)\n( k\n∞\nX\nY\n1−γ\n(31)\nγFi (s) .\nFΩ (s) = γ\nk=0\n\n|\n\ni=0\n\n{z\n\nG(s)\n\nThis is an infinite sum of the products of\n\n}\n\n1 − exp −(2b0 mi − 1)s\nFi (s) =\n(2b0 mi − 1)s\n\n\u0001\n\n(32)\n\nthat is the LST of the uniform distribution with mean b0 mi −\n1/2. For notational simplicity, we adopt the change of variable\nx := 2b0 s such that x also belongs to R+ . Thus we have\n( k\n\u0001)\n∞\nX\nY 1 − exp −(mi − 1/(2b0))x\nγ\nG(x) =\n. (33)\n(mi − 1/(2b0))x\ni=0\nk=0\n\nSince Fi (x) < 1 for x ∈ R+ , it is easy to see that G(x) is\nconvergent on R+ . Then it follows from Bernstein's Theorem\n[20, pp.439] that G(x) is completely monotone. That is,\nG(x) > 0 and it has derivatives of all orders, which satisfy\ni\n\n(−1)i ddxGi (x) > 0, ∀i ∈ Z+ ,\n\n(34)\n\nwhich implies that the ith derivative of G(x) is strictly\nmonotone for all i ∈ Z+ .\nStep 1: Recursive relation in G(*)\n\n= (−1)z * ∞.\n\nRecall limx→0+ ddxGi (x) is finite for i < z by Theorem 2.\ni\nLikewise, it is easy to see that limx→0+ ddxHi (x) is finite for i <\nz and infinite for i ≥ z. Moreover, since both the nominator\nand denominator of the limit\n\nPlugging the last line into (30) yields (9).\nB. Proof of Theorem 3\n\n(35)\n\ndz G\ndxz (x)\ndz H\ndxz (x)\n\n(37)\n\nare infinite, we may remove arbitrary number of products\nwhose zth derivatives at x = 0+ are finite from both of G(x)\nand H(x),P\nimplying in turn that we mayPreplace the summation\n∞\n∞\noperation k=0 in (33) and (36) by k=k′ for any k ′ ≥ 0.\nFormally speaking, we have\n\n\n′\n−1 Y\nk\n\n dz kX\ndz\nγF\n(x)\nG(x)\n=\ni\n\n dxz\ndxz\nk=0 i=0\n\n(\n)\n′\n∞ Y\n−1\nk\n dz kY\n X\n+\nγFi (x)\nγFi (x)\n dxz\n\ni=0\nk=k′ i=k′\n\n(\n)\n′\n∞ Y\nk\n−1\nkY\n dz X\nγFi (x)\n(38)\n+\nγFi (x)\n\n dxz\n′\n′\ni=0\nk=k i=k\n\nwhere only the third term (38) becomes infinite as x → 0+ .\nTherefore, we can easily see that the difference between G(x)\nand H(x) vanishes as k ′ increases and hence (37) must be 1.\nTaking derivatives of both sides of (35) z times and after\nsome manipulation, it becomes clear that it is sufficient to\nconsider only infinite terms which are related to each other in\nthe following form:\nh(m) :=\n\ndz H\ndz G\nz (mx)\ndxz (mx)\n= lim dx\nlim\nlim dz G\nzG\nd\n+\n+\nx→0\nx→0+\nx→0\ndxz (x)\ndxz (x)\n−z −1\nα−z\n\n=m\n\nγ\n\n=m\n\ndz G\ndxz (mx)\ndz H\ndxz (mx)\n\n(39)\n\nwhere we also exploited the fact that (37) is 1. Because the\nconvergence of (39) holds for any real sequences of xk → 0+ ,\nwe have that h(y) = y α−z for y ∈ M where M := {mi | i ∈\nZ} is a countably infinite set that is nowhere dense in R+ . The\nset on which the relation h(y) = y α−z holds is often baptized\nquantifier set in regular variation theory.\n\n\f15\n\nStep 2: Quantifier set is dense in R+\nWe will show that h(y) = y α−z holds on a dense subset L\nof R+ . Define a set\nL := {λ ∈ R+ | (log λ)/ log m ∈ R\\Q}\nwhere R\\Q is the set of irrational numbers. It should be clear\nthat M and L are disjoint, i.e., M ∩ L = ∅ and the set L\nis dense in R+ because it can be rewritten as L = {my ∈\nR+ | y ∈ R\\Q}. Defining\nΥ(y, x) :=\n\ndz G\ndz G\ndxz (yx)/ dxz (x),\n\nwe can see that Υ(y, x) is strictly decreasing in y because it\nfollows from (34), i.e., complete monotonicity, that\ndΥ(y,x)\ndy\n\n=\n\nd(yx) dz+1 G\ndz G\ndy dxz+1 (yx)/ dxz (x)\n\n< 0, ∀z ∈ Z+ .\n\nPick λ ∈ L in the interval (mi , mi+1 ) for any i ∈ Z. Since\nΥ(y, x) > 0 is strictly decreasing in y, it is upper-bounded\nby mi(α−z) as x → 0+ , meaning that Υ(y, x) is ultimately\nbounded in x. From its series expansion, it is easy to see that\nit is ultimately monotone in x as x → 0+ . Then we can apply\n[33, Theorem 3.14] to show that there exists α̃ such that\nh(λ) = limx→0+ Υ(λ, x) = λα̃−z ,\nj\n\n(40)\n\nj(α̃−z)\n\nwhich in turn implies that h(λ ) = λ\n, ∀j ∈ Z, as (39)\ndid. Assume that α̃ 6= α. Because Υ(y, x) is strictly decreasing\nin y, irrespective of z, we have\nmα−z ≤ limx→0+ Υ(y, x) ≤ 1\n\n(41)\n\nfor y ∈ (1, m). Put ŷ := m−⌊j(log λ)/ log m⌋ λj for j ∈ Z. This\ncan be rearranged as\nŷ = mj(log λ)/ log m−⌊j(log λ)/ log m⌋\nand (log λ)/ log m is irrational, hence its exponent is on (0, 1)\nand ŷ is on the interval (1, m). We now have from (39) and\n(40) that\nlimx→0+ Υ(ŷ, x) = limx→0+\n\nj log λ\n−⌊\n⌋\ndz G\nlog m λj x)\ndxz (m\ndz G\nj\ndxz (λ x)\n\n*\n\nj\ndz G\ndxz (λ x)\ndz G\n(x)\nz\ndx\n\nj log λ\n\n= m−⌊ log m ⌋(α−z) λj(α̃−z)\nj log λ\n\nj log λ\n\n= m−⌊ log m ⌋(α−z)+ log m (α̃−z)\nj log λ\nj log λ\n= m( log m −⌊ log m ⌋)(α−z) * λj(α̃−α) .\nwhere the key point is that the second equality follows from\nM ∩ L = ∅. Since the last term belongs to the closed interval\nI(j) := [mα−z λj(α̃−α) , λj(α̃−α) ]\nand α̃ 6= α, we must be able to pick j ∈ Z such that I(j) does\nnot overlap with [mα−z , 1]. This proves by contradiction that\nh(λ) = λα−z holds for λ ∈ L that is dense in R+ .\nStep 3: Applying regular variation theory\nApplying the 'Karamata Theorem for monotone functions'\n[10, Theorem 1.10.2] to the conclusion we obtained in Step 2\nz\nestablishes that ddxGz (x) is regularly varying (on the right) at\nthe origin x = 0 with index α − z. Formally speaking, G(s)\nsatisfies\n\u0001\ndz G\nα−z ∗ 1\nl s\nas s → 0+ ,\n(42)\ndsz (s) ∼ s\n\nwhere l∗ (x) is slowly varying at infinity x = ∞, i.e.,\nlim l∗ (yx) /l∗ (x) = 1\n\nx→∞\n\nfor all y ∈ R+ . Note that the original Karamata Tauberian\nTheorem in [10, Theorem 1.7.1] and [20, pp.445] cannot\nbe applied due to the fact α − z ≤ 0. These theorems are\ncomplemented by the modified Karamata Tauberian Theorem\nin [10, Theorem 8.1.6] and [9], which we apply to (42) to\nshow (15).\n\n\f"}