{"id": "http://arxiv.org/abs/0706.3035v1", "guidislink": true, "updated": "2007-06-20T17:56:48Z", "updated_parsed": [2007, 6, 20, 17, 56, 48, 2, 171, 0], "published": "2007-06-20T17:56:48Z", "published_parsed": [2007, 6, 20, 17, 56, 48, 2, 171, 0], "title": "Massive Clumps in the NGC 6334 Star Forming Region", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.3586%2C0706.0120%2C0706.4318%2C0706.1028%2C0706.0837%2C0706.1072%2C0706.0302%2C0706.2742%2C0706.0092%2C0706.2415%2C0706.1689%2C0706.4235%2C0706.3591%2C0706.2279%2C0706.0201%2C0706.1013%2C0706.4192%2C0706.1753%2C0706.3053%2C0706.1131%2C0706.3378%2C0706.4377%2C0706.1706%2C0706.3818%2C0706.1327%2C0706.1379%2C0706.1375%2C0706.1065%2C0706.0259%2C0706.1651%2C0706.0937%2C0706.4452%2C0706.2455%2C0706.3445%2C0706.2145%2C0706.3398%2C0706.2913%2C0706.1180%2C0706.2420%2C0706.1884%2C0706.0339%2C0706.4013%2C0706.1729%2C0706.1540%2C0706.2935%2C0706.1176%2C0706.3964%2C0706.3123%2C0706.0573%2C0706.1868%2C0706.3300%2C0706.0690%2C0706.3444%2C0706.0110%2C0706.4363%2C0706.0651%2C0706.2602%2C0706.3149%2C0706.2375%2C0706.0100%2C0706.3534%2C0706.3035%2C0706.2188%2C0706.0736%2C0706.1817%2C0706.2232%2C0706.1596%2C0706.1475%2C0706.0777%2C0706.1974%2C0706.2813%2C0706.2008%2C0706.3364%2C0706.1194%2C0706.2616%2C0706.3049%2C0706.3713%2C0706.2931%2C0706.3177%2C0706.3927%2C0706.1951%2C0706.2224%2C0706.0244%2C0706.1398%2C0706.4037%2C0706.3863%2C0706.0867%2C0706.3778%2C0706.0938%2C0706.3583%2C0706.2084%2C0706.4444%2C0706.1692%2C0706.0064%2C0706.0322%2C0706.3341%2C0706.3549%2C0706.3684%2C0706.4071%2C0706.2286%2C0706.2246&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Massive Clumps in the NGC 6334 Star Forming Region"}, "summary": "We report observations of dust continuum emission at 1.2 mm toward the star\nforming region NGC 6334 made with the SEST SIMBA bolometer array. The\nobservations cover an area of $\\sim 2$ square degrees with approximately\nuniform noise. We detected 181 clumps spanning almost three orders of magnitude\nin mass (3\\Msun$-6\\times10^3$ \\Msun) and with sizes in the range 0.1--1.0 pc.\nWe find that the clump mass function $dN/d\\log M$ is well fit with a power law\nof the mass with exponent -0.6 (or equivalently $dN/dM \\propto M^{-1.6}$). The\nderived exponent is similar to those obtained from molecular line emission\nsurveys and is significantly different from that of the stellar initial mass\nfunction. We investigated changes in the mass spectrum by changing the\nassumptions on the temperature distribution of the clumps and on the\ncontribution of free-free emission to the 1.2 mm emission, and found little\nchanges on the exponent. The Cumulative Mass Distribution Function is also\nanalyzed giving consistent results in a mass range excluding the high-mass end\nwhere a power-law fit is no longer valid. The masses and sizes of the clumps\nobserved in NGC 6334 indicate that they are not direct progenitors of stars and\nthat the process of fragmentation determines the distribution of masses later\non or occurs at smaller spatial scales. The spatial distribution of the clumps\nin NGC 6334 reveals clustering which is strikingly similar to that exhibited by\nyoung stars in other star forming regions. A power law fit to the surface\ndensity of companions gives $\\Sigma\\propto \\theta^{-0.62}$.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.3586%2C0706.0120%2C0706.4318%2C0706.1028%2C0706.0837%2C0706.1072%2C0706.0302%2C0706.2742%2C0706.0092%2C0706.2415%2C0706.1689%2C0706.4235%2C0706.3591%2C0706.2279%2C0706.0201%2C0706.1013%2C0706.4192%2C0706.1753%2C0706.3053%2C0706.1131%2C0706.3378%2C0706.4377%2C0706.1706%2C0706.3818%2C0706.1327%2C0706.1379%2C0706.1375%2C0706.1065%2C0706.0259%2C0706.1651%2C0706.0937%2C0706.4452%2C0706.2455%2C0706.3445%2C0706.2145%2C0706.3398%2C0706.2913%2C0706.1180%2C0706.2420%2C0706.1884%2C0706.0339%2C0706.4013%2C0706.1729%2C0706.1540%2C0706.2935%2C0706.1176%2C0706.3964%2C0706.3123%2C0706.0573%2C0706.1868%2C0706.3300%2C0706.0690%2C0706.3444%2C0706.0110%2C0706.4363%2C0706.0651%2C0706.2602%2C0706.3149%2C0706.2375%2C0706.0100%2C0706.3534%2C0706.3035%2C0706.2188%2C0706.0736%2C0706.1817%2C0706.2232%2C0706.1596%2C0706.1475%2C0706.0777%2C0706.1974%2C0706.2813%2C0706.2008%2C0706.3364%2C0706.1194%2C0706.2616%2C0706.3049%2C0706.3713%2C0706.2931%2C0706.3177%2C0706.3927%2C0706.1951%2C0706.2224%2C0706.0244%2C0706.1398%2C0706.4037%2C0706.3863%2C0706.0867%2C0706.3778%2C0706.0938%2C0706.3583%2C0706.2084%2C0706.4444%2C0706.1692%2C0706.0064%2C0706.0322%2C0706.3341%2C0706.3549%2C0706.3684%2C0706.4071%2C0706.2286%2C0706.2246&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report observations of dust continuum emission at 1.2 mm toward the star\nforming region NGC 6334 made with the SEST SIMBA bolometer array. The\nobservations cover an area of $\\sim 2$ square degrees with approximately\nuniform noise. We detected 181 clumps spanning almost three orders of magnitude\nin mass (3\\Msun$-6\\times10^3$ \\Msun) and with sizes in the range 0.1--1.0 pc.\nWe find that the clump mass function $dN/d\\log M$ is well fit with a power law\nof the mass with exponent -0.6 (or equivalently $dN/dM \\propto M^{-1.6}$). The\nderived exponent is similar to those obtained from molecular line emission\nsurveys and is significantly different from that of the stellar initial mass\nfunction. We investigated changes in the mass spectrum by changing the\nassumptions on the temperature distribution of the clumps and on the\ncontribution of free-free emission to the 1.2 mm emission, and found little\nchanges on the exponent. The Cumulative Mass Distribution Function is also\nanalyzed giving consistent results in a mass range excluding the high-mass end\nwhere a power-law fit is no longer valid. The masses and sizes of the clumps\nobserved in NGC 6334 indicate that they are not direct progenitors of stars and\nthat the process of fragmentation determines the distribution of masses later\non or occurs at smaller spatial scales. The spatial distribution of the clumps\nin NGC 6334 reveals clustering which is strikingly similar to that exhibited by\nyoung stars in other star forming regions. A power law fit to the surface\ndensity of companions gives $\\Sigma\\propto \\theta^{-0.62}$."}, "authors": ["Diego J. Munoz", "Diego Mardones", "Guido Garay", "David Rebolledo", "Kate Brooks", "Sylvain Bontemps"], "author_detail": {"name": "Sylvain Bontemps"}, "author": "Sylvain Bontemps", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1086/521206", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0706.3035v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0706.3035v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "16 pages, 11 figures, 4 tables. To appear in the Astrophysical\n  Journal", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0706.3035v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0706.3035v1", "journal_reference": null, "doi": "10.1086/521206", "fulltext": "Preprint typeset using LATEX style emulateapj v. 05/04/06\n\nMASSIVE CLUMPS IN THE NGC 6334 STAR FORMING REGION\nDiego J. Muñoz1 , Diego Mardones, Guido Garay and David Rebolledo\nDepartamento de Astronomı́a, Universidad de Chile, Casilla 36-D, Santiago, Chile\n\nKate Brooks\nAustralia Telescope National Facility,P.O. Box 76, Epping NSW 1710 Australia\n\nand\nSylvain Bontemps\n\narXiv:0706.3035v1 [astro-ph] 20 Jun 2007\n\nObservatoire de Bordeaux, 2 rue de l'Observatoire,33270 Floirac, France\n\nABSTRACT\nWe report observations of dust continuum emission at 1.2 mm towards the star forming region NGC\n6334 made with the SEST SIMBA bolometer array. The observations cover an area of ∼ 2 square\ndegrees with approximately uniform noise. We detected 181 clumps spanning almost three orders of\nmagnitude in mass (3M −6 × 103 M ) and with sizes in the range 0.1–1.0 pc. We find that the clump\nmass function dN/d log M is well fit with a power law of the mass with exponent −0.6 (or equivalently\ndN/dM ∝ M −1.6 ). The derived exponent is similar to those obtained from molecular line emission\nsurveys and is significantly different from that of the stellar initial mass function. We investigated\nchanges in the mass spectrum by changing the assumptions on the temperature distribution of the\nclumps and on the contribution of free-free emission to the 1.2 mm emission, and found little changes\non the exponent. The Cumulative Mass Distribution Function is also analyzed giving consistent results\nin a mass range excluding the high-mass end where a power-law fit is no longer valid. The masses and\nsizes of the clumps observed in NGC 6334 indicate that they are not direct progenitors of stars and\nthat the process of fragmentation determines the distribution of masses later on or occurs at smaller\nspatial scales.\nThe spatial distribution of the clumps in NGC 6334 reveals clustering which is strikingly similar to\nthat exhibited by young stars in other star forming regions. A power law fit to the surface density of\ncompanions gives Σ ∝ θ−0.62 .\nSubject headings: stars: formation - molecular clouds: individual(NGC 6334)-stars: initial mass\nfunction\n1. INTRODUCTION\n1.1. Massive Star Formation and Molecular Cloud\n\nStructure\nHalf of the mass in the interstellar medium is in the\nform of molecular gas exhibiting a broad range of structures, ranging from small isolated clouds, with masses of\na few M and subparsec sizes, to Giant Molecular Clouds\n(GMCs), with masses of several times 106 M and sizes\nof 100 pc (Blitz 1993). We adopt the nomenclature used\nin the review of Williams, Blitz & McKee (2000) to refer\nto the different observed molecular structures. GMCs\nare the sites of most of star formation activity in the\nMilky Way, and in particular of high mass stars, which\nare usually born in clusters within massive cores. In order to understand how massive cores form from the GMC\ncomplexes we must understand how fragmentation and\ncondensation proceed within them. It is essential for this\npurpose to determine the physical properties of complete\nsamples of massive cores within GMCs.\nMolecular line surveys, at millimeter and submillimeter wavelengths, have revealed the structure of\nGMCs to be highly inhomogeneous and clumpy (Blitz\n1993; Evans 1999). These surveys have shown that the\nmass spectra of clouds (Sanders et al. 1985; Solomon et\nal. 1987), clumps (Blitz 1993; Kramer et al. 1998; Lada\n1\n\ndmunoz@cfa.harvard.edu\n\n1999; Williams, Blitz & McKee 2000) and total mass of\nembedded clusters (Lada & Lada 2003) are similar to\none another. These mass spectra are notably different\nthan the stellar mass spectrum: the Initial Mass Function (IMF; Salpeter 1955. In particular, several works on\nmolecular line mapping of GMCs, show that their mass\nspectra follow a power law with nearly the same exponent, x ∼ 0.6, where dN/d log M ∝ M −x (e.g. Blitz\n1993; Williams, Blitz & McKee 2000).\nThe development of large bolometer arrays during the\nlast ten years has permitted to carry out extended millimeter and sub-millimeter continuum surveys, allowing\nthe direct dust mass determination of clumps. Motte et\nal (1998) mapped the Ophiuchus cloud with the IRAM\n30-m telescope and found a distribution of clump masses\nsimilar to Salpeter's IMF. Several works (Johnstone et\nal. 2001; Beuther & Schilke 2004; Mookerjea et al. 2005;\nReid & Wilson 2005; Johnstone et al. 2006) have reported mass spectra of dust cores with indexes similar\nto Salpeter's IMF, and different from those derived from\nmolecular line studies. If the mass function of cores is\nsimilar to the Salpeter IMF, independent of the range of\nmasses involved, then the star formation process within\nGMCs would be defined in the earliest stages as a result\nof cloud fragmentation.\n\n\f2\n\nMuñoz et al.\n\nIn this paper we present a large scale 1.2 mm continuum study of the NGC 6334 GMC aimed to find and\nstudy a complete sample of massive cores.\n\n1.2. NGC 6334 and NGC 6357\n\nNGC 6334 is one of the nearest and most prominent\nsites of massive star formation, at a distance of only 1.7\nkpc (Neckel 1978). The central region of NGC 6334 consists of a ∼ 10 pc long filament with seven sites of massive\nstar formation. Within them there is a wide variety of\nactivity associated with star formation, such as water\nmasers, HII regions (Rodrı́guez, Cantó & Moran 1982;\nCarral et al. 2002), and molecular outflows.\nEarly FIR (McBreen et al. 1979) and radio (Rodrı́guez,\nCantó & Moran 1982) surveys characterized the overall\nproperties of the main sites of massive star formation,\nwhereas NIR studies (Straw et al. 1989; Straw & Hyland 1989) revealed the cluster forming nature of many\nof these sites. Kraemer & Jackson (1999) and Burton et\nal. (2000) review the different notations used by previous\nauthors to identify bright sources. Sub-millimetric and\nmillimetric results on NGC 6334 have been previously reported by Gezari (1982), Sandell (2000) and McCutcheon\net al. (2000), all of which focused in the northern portion of the main filament: sources I and I(N) which\nhave been recently resolved into smaller cores (Hunter\net al. 2006). In the case of Sandell (2000), the sources\nI and I(N) were redefined as the central peaks of each\nrespective source. This after observations at 350 μm,\n450 μm, 380 μm, 1.1 mm and 1.3 mm showed inner\nstructure for Gezari's cores. In Sandell (2000) sources\nI and I(N) have angular sizes of 1000 × 800 and 1100 × 800\nrespectively. These sizes are ∼ 10 times smaller than our\nmassive clumps cl1 and cl2 identified as I and I(N) respectively. For the present work, cl1 encloses sources I\nand I(NW) of Sandell's nomenclature, while cl2 encloses\nI(N), SM1,SM2,SM4 and SM5 as well as considerable\nextended emission in both cases. Hence, the comparison\nbetween that work and ours is not straighforward.\nFollowing the evolutionary sequence proposed by\nBeuther et al. (2006), NGC 6334 and NGC 6357 appear to be in an intermediate phase of Massive Starless\nClumps and Protoclusters. The latter region seems more\nevolved that the former since compact HII regions are still\nprominent in NGC 6334 at radio wavelengths while the\nstructure of NGC 6357 is more disrupted, suggesting that\nmassive stars have already shaped the mother clouds.\nThis is also supported by the presence of more infrared\nsources in NGC 6357. From this evidence, and the lack\nof significant amounts of cold material in between the\ntwo regions, we will consider NGC 6334 and NGC 6357\nas two independent regions, defining NGC 6334 as the\nsoutheastern portion of the map as shown in Figure 1.\nEven though NGC 6334 is one of the closest GMCs,\nit is still far compared to low-mass star-forming regions\n(e.g. Ophiucus, Orion B, Taurus). As a consequence, the\ndetected clumps in NGC 6334 are larger and considerably more massive, and can be considered likely clusterforming cores (Motte et al. 2003; Ward-Thompson et al.\n2006; Beuther et al. 2006) and we are unable to resolve\ntheir inner structure.\n\n2. OBSERVATIONS AND DATA REDUCTION\n\nThe regions NGC 6334 and NGC 6357 were mapped\nusing the 37 channel SEST Imaging Bolometer Array\n(SIMBA) in the fast mapping mode in three different\nepochs: July 2002, September 2002 and May 2003. The\npassband of the bolometer has an equivalent width of\n90 GHz and is centered at 250 GHz (1.2 mm). The\nhalf-power beamwidth of the instrument is 2400 giving a spatial resolution of 0.2 pc. Ninety five observing blocks were taken towards the NGC 6334 and\nNGC 6357 regions, with typical extension of ∼ 100 × 200 ,\nto sample a total area of ∼ 2 square degrees between\n17h 16m 00s − 36◦ 400 0000 and 17h 28m 00s − 33◦ 400 0000 .\nSkydip observations were done approximately every two\nhours to determine the zenith opacity at 250 GHz. Typical opacities were τ ≈ 0.2 with values ranging from 0.17\nto 0.4 in a few cases. We also checked pointing on η Carinae every two hours and found a typical rms deviation of\n3-5\" in azimuth and elevation. Every night we observed\nUranus for flux calibration.\nThe SIMBA data were reduced using the MOPSI program written by Robert Zylka after conversion by the\nsimbaread program written at ESO. The SIMBA raw\ndata consists of a time series for each of the 37 bolometers (channels) in the array. The time series includes the\ncounts per channel and sky position. The reduction procedure first removes the brightest data spikes. Next a low\norder baseline in time is fit to the full observation file for\neach channel, and a zero order baseline is fit in azimuth\nfor each channel. The data is then deconvolved by the\ntime response function of each channel, as measured by\nthe SEST staff. Gain elevation and extinction corrections\nare applied next. An iterative sky noise reduction procedure is then applied, where the counts of each channel are\ncorrelated with those of the other 36 channels, yielding\na so-called flat field correction to calibrate the relative\nsensitivity of each pixel. A source image is finally produced by averaging the flux of all channels as they pass\nthrough the same position on the sky.\nThe sky noise reduction algorithm includes the flux\ncoming from both the source and the sky simultaneously.\nIf the source extends over several channels, this introduces spurious correlated flux which hampers the sky\nnoise reduction procedure. To avoid this, a smoothed\nmodel of the source flux distribution on the sky is subtracted from the raw time series data. Thus, the sky\nnoise reduction procedure can be repeated, finding a better source model with each iteration.\nThe calibration was derived from maps of Uranus. The\nresulting multiplicative factor varied between 0.06-0.09\nJy count−1 beam−1 . Finally, reduced images were combined with the MOPSI software to produce the final map\n(Figure 1). In order to reduce noise further, a Gaussian\nsmoothing of 30\" was applied to the final image and the\nmap edges were removed. The typical rms noise of the\nfinal map is 25 mJy beam−1 . SIMBA observations usually have an absolute flux uncertainty of ∼20% (Faúndez\net al. 2004).\n3. RESULTS\n3.1. Clump-finding Algorithms\n\nDifferent clump-finding algorithms have been used to\nstudy the substructure in molecular clouds. Among the\n\n\fMASSIVE CLUMPS IN NGC 6334\n\n3\n\nFig. 1.- Grey scale image of the 1.2 mm emission towards NGC 6334 and NGC 6357. The polygonal line was used to exclude the noisy\nborders of the mapped region. The large square indicates the area defined as NGC 6334 in the present analysis. It encloses 182 of the\n347 clumps found using clfind2d. Also labeled are the three sub-regions chosen for statistical analysis: the central region NGC 6334a (see\nFigure 2); a larger extension NGC 6334b; and finally NGC 6334c which includes only the clumps outside of NGC 6334b.\n\nmost used are Clumpfind (Williams, de Geus & Blitz\n1994) and Gaussclumps (Stutzki & Gusten 1990). Both\nalgorithms have different biases, but find similar clump\ndistributions (e.g. Schneider & Brooks 2004). We use the\nclumpfind algorithm because it makes no assumptions\nabout inherent clump shapes. Clumpfind first finds the\nbrightest emission peak in the image, then it descends to\na lower contour level and finds all the image pixels above\nthis level, associating them to the first peak (clump) if\ncontiguous, or else defines one or more additional clumps.\nThe spatial separation of clumps is defined along saddle\npoints. We used a conservative lower detection threshold\nof 75 mJy (3σ) per beam. We found 347 clumps in the\nwhole image, 182 of which are in the NGC 6334 region.\nOnly two clumps are likely to be fictitious based on their\nsmall effective radii and location close to the borders,\nand only one of them is in the NGC6334 region. Thus,\nwe will use the remaining 181 clumps in our analysis of\nthe region NGC 6334 in this paper. Table 1 lists the\n\nclumps in our sample associated with previously known\nradio and IR sources. These sources are all located in\nthe brightest part of the filament as seen in Figure 2.\n3.2. Clump Size Distribution\n\nFigure 3 shows a histogram of the clump size distribution. The effective radius, or size, is determined from\nthe angular area encompassed by each clump (from the\nclfind2d output) assuming a distance to NGC 6334 of\n1.7 kpc. The sizes range from 0.1 to 1.0 pc, with a median of 0.36 pc. These values are similar to those derived\nfor clumps within GMCs (Blitz 1993; Williams, Blitz &\nMcKee 2000; Pudritz 2002; Faúndez et al. 2004; Beuther\net al. 2006).\n3.3. Mass Estimates\nSince the dust emission at 1.2 mm is most likely to be\noptically thin (e.g. Garay et al. 2002), the mass of each\nclump can be estimated from the observed flux density.\n\n\f4\n\nMuñoz et al.\n\nFig. 2.- Peak position of the radio and FIR sources of Table 1 plotted over images of the SIMBA continuum at 250 GHz (left panel)\nand ATCA continuum at 1.6 GHz (right panel).\n\nTABLE 1\nRadio, FIR and Millimeter Sources in NGC 6334\nRadio\nName\n\nRadio Position\n\nFIR\nName\n\nα\n\nG351.20+0.70\nunnameda\nA\nC\nD\nE\nF\n***\n\nδ\n(J2000)\n17h 20m 04.1s -35◦ 56'10\"\n17h 20m 19.2s\n17h 20m 32.6s\n17h 20m 44.3s\n17h 20m 50.9s\n17h 20m 53.4s\n***\n\n-35◦ 54'45\"\n-35◦ 51'24\"\n-35◦ 49'18\"\n-35◦ 46'06\"\n-35◦ 47'02\"\n\nFIR Position\nα\n\nSIMBA\nName\nδ\n\n17h 19m 57.4s\n17h 20m 20.7s\n17h 20m 31.3s\n17h 20m 42.2s\n***\n17h 20m 55.1s\n17h 20m 53.6s\n\n-35◦ 57'52\"\n-35◦ 54'55\"\n-35◦ 51'48\"\n-35◦ 49'25\"\n-35◦ 47'04\"\n-35◦ 45'27\"\n\ncl210\ncl4\ncl3 (cl7,cl15)\ncl11\ncl19\n***\ncl1\ncl2\n\nδ\n(J2000)\n17h 19m 58.0s -35◦ 55'56\"\n17h 19m 56.7s -35◦ 57'56\"\n17h 20m 19.8s -35◦ 54'44\"\n17h 20m 34.2s -35◦ 51'32\"\n17h 20m 42.8s -35◦ 49'16\"\n***\n17h 20m 54.0s -35◦ 47' 00\"\n17h 20m 56.0s -35◦ 45'16\"\n\nRef\n\nα\n\n(J2000)\nV\nIV\nIII\nII\n***\nI\nI(N)\n\nSIMBA Position\n\n(4),†\n(2),†\n(1),(2),†\n(1),(2),†\n(1),(2),†\n(1)\n(1),(2),†\n(3),†\n\nReferences. - (1)Rodrı́guez, Cantó & Moran (1982),(2)McBreen et al. (1979), (3)Gezari (1982), (4)Moran et al. (1990), † This work\nNote. - The FIR and Radio Equatorial coordinates have been precessed from B1950 to J2000.\na The radio counterpart for FIR source V is observed at 1.6 Ghz with similar peak intensity to G351.20+0.70, but was not identified earlier as\nan HII region but as part of a PDR shell (Moran et al. 1990; Jackson & Kraemer 1999; Burton et al. 2000)\n\nFor an isothermal dust source, the total gas mass Mg is\nrelated to the observed flux density Sν at an optically\nthin frequency ν as (c.f. Chini, Krügel & Wargau 1987)\nMg =\n\nSν D2\n,\nRdg κν Bν (Td )\n\n(1)\n\nTd = 17 K 2 , we computed the mass of each clump found\nby clfind2d. We find that the clump masses in NGC 6334\nrange from 3 to 6000 M , with a mean value of 170 M\nand a median value of 60 M . The total mass of the\nclumps in NGC 6334 is Mtot ∼ 5 × 104 M .\n3.4. Clump Mass Spectrum\n\nwhere κν is the dust mass absorption coefficient, D is the\nsource distance, Rdg is the dust to gas mass ratio, and\nBν is the Planck function. In more convenient units the\ngas mass can be written as\n\u0012\n\u0013\u0012\n\u00132 \u0012\n\u0013\nS250GHz\nD\n0.01\nMg = 20.4\nJy\nkpc\nRdg\n\u0012\n\u0013h\ni\n2 −1\n12 K\n1cm g\n×\ne Td − 1 M .\n(2)\nκ250GHz\nUsing a dust mass absorption coefficient of κ250 GHz =\n1 cm2 g−1 (Ossenkopf & Henning 1994); a dust-to-gas ratio of 0.01; a distance of 1.7 kpc, and a dust temperature\n\nThe Clump Mass Function (CMF), ξα (M ), is defined\nas the number of clumps per unit mass,\nξα (M ) =\n\ndN\n∆N\n≈\n,\ndM\n∆M\n\n(3)\n\nwhere ∆N and ∆M are used to indicate observational estimates. Some workers prefer to use a logarithmic CMF,\nξx , defined as the number of clumps per unit logarithmic\n2 We choose a value of 17 K because it lies in the typical range\nfor cold dark clouds (Pudritz 2002). It is also also a factor of\ntwo smaller 34 K the average temperature of clouds with infrared\ncounterparts (Faúndez et al. 2004) making the comparison between\nboth temperatures easier.\n\n\fMASSIVE CLUMPS IN NGC 6334\n\n5\n\nNGC 6334\n181\n\nNGC 6334\nNumber of Clumps 181\n\nFig. 3.- Clump Size Distribution (in pc) assuming a distance\nof 1.7 kpc to NGC 6334. The cross below the histogram indicates\nthe median and standard deviation of the distribution.\n\nmass,\ndN\n∆N\nξx (M ) =\n≈\n.\nd(log M )\n∆(log M )\n\n(4)\n\nThese two functions are related by the expression\nξx (M ) = (M ln10)ξα (M ). If ξα (M ) has a power law dependence with mass, ξα (M ) ∝ M −α , then the logarithmic CMF should also have a power law dependence with\nmass, ξx (M ) ∝ M −x , where the power law exponents\nare related by x = α − 1. A Salpeter slope corresponds\nto x = 1.35 or α = 2.35.\nThe CMF is usually estimated from a histogram of the\nderived clump masses assuming it has a power law form.\nThe distinction between the observationally derived ξα\nand ξx is made by Scalo (1998), Kroupa (2001) and Larson (2003). Its implications in the type of binning used\nin the histogram is also mentioned in Klessen & Burkert (2000). Figure 4 shows an histogram of the mass\nof the clumps within NGC 6334. The bin size ∆ log M\nhas a constant value of 0.5. The completeness limit is\nestimated to be ∼ 30 M . A least squares linear fit\nto the ∆N versus log M relationship gives a slope of\n−0.62 ± 0.07.\nVariations of the CMF within NGC 6334. - Given the\nlarge number of clumps in our survey, we can assess\npossible changes in the CMF as a function of position\nwithin the cloud. We consider the three subregions\nwithin NGC 6334 defined in Figure 1 and construct a\nmass spectrum for each of them (see Figure 5). The CMF\nin NGC 6334a, which encompasses the central filament\ncontaining the most massive clumps and where star formation is clearly taking place, is well fitted with a power\nlaw with an exponent of x = 0.11 ± 0.12, significantly\nshallower than the value determined for the whole sample. The exponent steepens for NGC 6334b (x = 0.48),\nwhich covers a much larger region than the central filament. For NGC 6334c, which excludes the main filament,\nthe slope is even steeper, x = 0.82. Thus, the slope of\n\nFig. 4.- Mass histogram of the clumps within NGC 6334. ∆N\nis the number of clumps in bins of constant ∆ log M (=0.5). The\nshaded region delimits the 3σ detection limit and our estimated\ncompleteness limit. This region is excluded from the least squares\nfit.\n\nthe CMF in NGC 6334 depends on the location of the\nclumps within the cloud.\nOut of the total mass of 5 × 104 M in 181 dense massive clumps in NGC 6334, 3.4 × 104 M are contained\nwithin the NGC 6334a region and 1.6 × 104 M are outside. The slope of the CMF of the whole region is dominated by the relatively low mass clumps in the outer\nregion since they dominate by number. The bulk of the\ncloud mass is located in a few inner clumps which do\nnot affect significantly the exponent of the derived CMF.\nThis could shed light on the effects of the star formation\nactivity, mass segregation, or coalescence in the clump\nmass spectrum within GMCs. We know that it is more\nlikely to miss low mass clumps due to confusion within\nthe region NGC 6334a than in the outer regions under\nstudy. This bias naturally flattens the slope of the mass\nspectrum in the inner region. However, we find in §3.6.1\nthat clumps are not only concentrated by mass towards\nthe center, but also by number, hinting that this result is\npartly real. Higher angular resolution observations will\nbe needed to settle this issue.\n3.5. Possible Uncertainties in the CMF\n\nIn the above analysis we assumed a single temperature\nfor the whole ensemble of clumps. This is clearly an approximation; the clumps themselves are not isothermal\nand the temperature is likely to be different from clump\nto clump. In addition, we assumed that all the detected\n1.2-mm emission is due to dust thermal emission. It is\npossible, however, that some of the 1.2-mm emission is\ndue to free-free emission from ionized gas. In what follows we assess these two assumptions and quantify their\neffects on the derived CMF.\n3.5.1. Temperature\n\nAssuming that all clumps within a GMC are isothermal\nand have the same temperature is clearly a rough approximation. In particular, clumps with already formed stars\n\n\f6\n\nMuñoz et al.\n\nNGC 6334a\n\nNGC 6334b\n40\n\nNGC 6334c\n108\n\n73\n\nFig. 5.- Mass histogram of clumps within selected regions of NGC 6334 (see Figure 1). Top panel: NGC 6334a. x = 0.11 Middle panel:\nNGC 6334b. x = 0.48 Bottom panel: NGC 6334c. x = 0.82\n\nFig. 6.- Three color image of the MSX emission towards NGC 6334 (blue: Band A, 8.28μm; green: Band C, 12.13μm; red: Band E,\n21.3μm). The countours represent the SIMBA 1.2-mm emission. Green contours indicate clumps that are associated with extended or\npoint-like infrared counterparts.\n\n\fMASSIVE CLUMPS IN NGC 6334\n\nFig. 7.- ATCA radio continuum emission at 1.6 GHz overlayed\nwith contours of the 1.2-mm emission. Again, the red contours\nindicate cold clumps having no embedded MSX sources and the\ngreen contours indicate warm clumps with embedded MSX sources.\n\nare expected to be warmer than clumps with no signs of\nembedded objects. Beuther & Schilke (2004) have argued\nthat this assumption introduces an uncertainty in the derived slope of the mass spectrum. If higher temperatures\nare adopted for the more massive clumps their derived\nmasses will decrease, whereas if lower temperatures are\nadopted for the less massive clumps their derived masses\nwill increase: the change would steepen the slope of the\nspectrum.\nTo study the possible effects of temperature differences, we use MSX mid-infrared and/or ATCA cmcontinuum observations to determine the presence of embedded heating sources which are likely to be responsible for temperature differences between clumps. Figures 6 and 7 show, respectively, images of the MSX and\nATCA emission overlayed with contours of the SIMBA\n1.2-mm continuum emission. We identified by visual\ninspection clumps associated with extended or pointlike infrared counterparts (Figure 6), or clumps associated with significant radio continuum (free-free) emission\n(Figure 7). These clumps are likely to have embedded\nsources and are indicated with green contours in both\nimages. Clumps in red contours appear to be free of\nembedded infrared or radio sources.\nFor the purposes of constructing the CMF, the powerlaw index does not depend on the temperature chosen for\nthe whole ensemble of clumps, and the choice of higher\ntemperatures only displaces the histogram to the left.\nAny slight variation of x is due to the intrinsic problem of binning the data. Nevertheless, the choice of two\ndifferent temperature can change the shape of the histogram, but essentially depending on the ratio between\nthe temperatures chosen rather than the values themselves.\nWe identified 16 out of 181 cores that appear to be\nwarmer than the rest. For these clumps we adopt a temperature of 34 K, the average temperature of massive\nclumps with embedded IRAS sources as determined by\nFaúndez et al. (2004). In particular, the temperatures\n\n7\n\nassigned to the cores associated with NGC 6334 I and\nNGC 6334 I(N), of 34 K and 17 K respectively, are in\naccordance with the values given by Gezari (1982). However, Sandell (2000) argues that source I is much hotter\n(Td ≈ 100 K) while his estimate for I(N) is 30 K, just\na factor of two larger than our estimate. His estimate\nof the mass of NGC 6334 I of 200 M\nin contrast to\nthe 1800 M in the present work is not solely explained\nby the temperature difference but also by the integrated\nflux. With a resolution of 6\" at 800 μm, his estimate for\nthe size of source I is 1000 ×800 , implying an effective radius\n∼ 8 times smaller than our estimate. Similarly, the definition of Sandell (2000) of NGC 6334 I(N) corresponds to\nthe central peak of the larger clump detected by Gezari\n(1982). Sandell (2000) obtains a mass of 400 M for\nsource I(N) after assuming a temperature of 30 K (see\nSandell 2000 and references therein). Adding up the contributions from the different cores resolved within I(N)\nand including the surrounding cloud, Sandell (2000) finds\nthat the mass of the whole I(N) region is ∼ 2700 M This\nvalue is in agreement with other results found in the literature and is consistent with our result after taking into\naccount that our choice for the temperature is 17 K. We\nremark that estimating an exact value of the temperature for each of the clumps of the cloud is not relevant for\nthe statistical analysis we carry out in the present work.\nThe newly adopted temperatures imply a repositioning\nof ∼10% of the clumps in the mass histogram. The new\nmass histogram, made assuming a two temperature cloud\nensemble, is shown in Figure 8. A linear regression yields\na best fit value of x = 0.88±0.13 (dotted line), but a χ2 fit\nwith Poissonian error bars yields x = 0.62 ± 0.08 (solid\nline). Thus, even though the warmer clumps are also\npreferentially the most massive, they do not concentrate\nsolely on the most massive bin and do not affect the\nderived slope of the mass spectrum significantly.\nThe repositioning of clumps in the histogram could\nhave a more dramatic effect when the number of\nclumps is considerably smaller. For example, the area\nNGC 6334a includes 14 of the 16 warmer clumps in\nNGC 6334 and a total of only 40 clumps (figure 5).\nWhen using two temperatures in NGC 6334a, the shape\nof the histogram indeed steepens, but the large relative\nerrors yields a slope x = 0.35 ± 0.21. Excluding the\nlast bin, containing only one object, we obtain a slope\nof x = 0.09 ± 0.15. In both cases the slope remains consistent with the value x ∼ 0.1 from a single temperature\nclump mass distribution.\n3.5.2. Radio Emission Contribution\n\nFree-free emission is the main continuum contributor\nat radio frequencies. At frequencies of hundreds of GHz,\nthe contribution from bremsstrahlung emission is usually\nneglected and all the detected emission is assumed to be\ndue to dust. Since massive stars are being formed within\nNGC 6334, it is plausible that the 1.2-mm emission is\nnot completely due to cool dust emission and that the\nionized gas excited by these stars contribute an important amount. Brooks et al. (2005) studied the Keyhole\nnebula and found that the 1.2 mm emission towards the\nHII region Car-II is strongly correlated with the 4.8 GHz\ncontinuum emission and that there is a lack of molecularline emission. They concluded that the 1.2-mm flux from\nthe components of Car-II arise from free-free emission as-\n\n\f8\n\nMuñoz et al.\nbut the best fit exponent (x = 0.88 ± 0.13) is consistent\nwith the previous value.\n\nNGC 6334\n181\n\n3.5.3. Binning\n\nGiven a distribution of clump masses, the binning process invariably loses information (Rosolowsky 2005). The\nmass histogram can be interpreted as the derivative of a\ncumulative number function N (M ) which counts clumps\nwith mass greater than M ,\nR∞\nξα (m)dm\nN (M ) = RM\n.\n(5)\n∞\nξα (m)dm\n0\n\nFig. 8.- Histogram of mass distribution in NGC 6334 for a\ntwo-temperature clump ensemble: 17 K and 34 K.\n\nTABLE 2\nGaunt Factors for Free-Free Emission\nFrequency\n\nT=7000 K\n\n8000 K\n\n9000 K\n\n10000 K\n\n1.6 GHz\n250 GHz\n\n5.40327\n2.79429\n\n5.5134\n2.8871\n\n5.61051\n2.9702\n\n5.69735\n3.04545\n\nsociated with ionized gas and not from cool dust emission\nassociated with molecular gas.\nHere we make a correction to the observed emission\nat 250 GHz by free-free contamination by estimating the\nexpected ionized gas flux density at 250 GHz from the\nobserved flux density at 1.6 GHz. Assuming that the\nfree-free emission is optically thin at both frequencies,\nthe ratio of the emissivities is proportional to the ratio\nof the e−hν/kTe gf f (ν, Te ) factors (Rybicki & Lightman\n1979), where gf f is the Gaunt factor. The exponential\nis essentially 1 at both frequencies. We did not use the\nusual radio approximation for the Gaunt factors given\nby Altenhoff et al. (1961), but computed them more precisely using quantum mechanical calculations following\nthe work of Menzel & Pekeris (Menzel & Pekeris 1935;\nSommerfeld 1953). Table 2 lists the calculated gaunt factors averaged over a Maxwell-Boltzmann distribution of\nvelocities with temperatures between 7 × 103 and 104 K,\ntypical for HII regions in massive star forming regions\n(Beckert et al. 2000). At 1.6 GHz the computed Gaunt\nfactors are only ≈ 0.3% lower than the usual Altenhoff\net al. approximation. On the other hand, the calculated\nGaunt factors at 250 GHz are typically 15% smaller than\nthe values obtained from the Altenhoff et al. approximation.\nTable 3 summarizes the values of the estimated freefree emission at 250 GHz from selected clumps associated\nwith HII regions (see Figure 2). We subtracted this\nflux from the measured 1.2-mm flux density to estimate\nthe actual contribution from dust, rederiving the mass of\neach clump. The high mass bins are the most affected,\n\nSome authors argue in favor of using the cumulative number function N (M ) (Johnstone et al. 2000b, 2001; Kerton et al. 2001; Tothill et al. 2002) to avoid the loss of\ninformation. If the cumulative number function has a\npower-law dependance with mass, N (M ) ∝ M −γ , then\nthe CMF is also a power law ξα (M ) ∝ M −γ−1 . From\nthe definitions in section 3.4, it is clear that γ = x\nHowever, if there is an upper mass limit in the distribution of cores, then the cumulative mass function is not\na power-law , showing considerable curvature at the high\nmass end. N (M ) can be approximated by a power-law\nwith index x = α − 1 only at masses M \u001c Mmax (or\nwhen Mmax → ∞). For finite upper mass limit,\nN (M ) = C1 M −x + C2 ,\n\n(6)\n\nwhere C2 becomes unimportant for small masses (see\nRosolowsky 2005; Reid & Wilson 2006b; Li et al. 2006).\nA power-law form, N (M ) ∝ M −x , approximates the\ntrue CMF asymptotically towards low masses. Thus,\na power law fit to the CMF must be applied within a\nrange of masses that avoids both the incomplete lowmass range and the cutoff high-mass range. When fitting\na power-law function to an observed cumulative mass\nfunction in a mass range M > Mmax /2 the slope invariably increases, explaining the apparent Salpeter-like\nslopes found in previous studies. Furthermore, the slope\nthus obtained is strongly dependent on the break-point\nchosen to fit the high mass end of the cumulative mass\nfunction and does not reflect the underlying differential\nclump mass distribution (ξα or ξx ).\nFor sample sizes of ∼ 70 clumps or fewer, binning\nbecomes an important factor in fitting a power law to\ndifferential mass functions and the use of a cumulative\nmass function is preferred. Johnstone et al. (2000b, 2001,\n2006) and Reid & Wilson (2005, 2006a) use cumulative\nmass distribution functions to avoid this problem. Our\nsample (181 clumps) is large enough to analyse the data\nusing either the cumulative or the differential mass functions. Figure 9 plots the normalized cumulative number\nfunction of clumps in NGC6334. A single power-law fit,\nwhich we have shown does not represent the true underlying clump mass function, gives N (M ) ∝ M −0.87 . The\ndashed line in Figure 9 shows that the slope x = 0.62\nderived from the histogram (Figure 4) represents a good\nasymptote to the CMF, as predicted by the theory (Eq.\n6). We also show in Figure 9 a fit to the top 10% of\nthe cloud mass (log(M/M ) > 2.8, indicated by an arrow) which yields a slope x = 1.19 (dotted line) much\ncloser to Salpeter's value. The best fit exponent changes\nto x = 1.37 for log M ≥ 2.9, and to x = 1.47 for\nlog M ≥ 3.0. Even though these slopes are consistent\n\n\fMASSIVE CLUMPS IN NGC 6334\n\n9\n\nTABLE 3\nRadio an MM fluxes [Jy] for Selected Clumps in Figure 7\nFrequency\n\ncl1\n\ncl19\n\ncl169\n\ncl11\n\ncl27\n\ncl7\n\ncl210\n\ncl4\n\nATCA at 1.6 GHz (Free-Free)\nExpected Free-Free at 250 GHz\nSIMBA at 250 GHz\n\n0.59\n0.31\n68.38\n\n22.77\n12.16\n26.78\n\n0.45\n0.24\n1.13\n\n9.42\n5.03\n27.12\n\n5.28\n2.82\n13.69\n\n12.61\n6.73\n26.72\n\n3.49\n1.86\n1.34\n\n2.89\n1.54\n59.31\n\nM-0.62\n\nNGC 6334\n181\n\nM-1.19\n\nFig. 9.- Normalized cumulative mass function N (M ). The grey area corresponds to the region affected by completeness uncertainties\nas shown in Figure 4. The arrow delimits the top 10% of the CMF where a power-law fit to the CMF (dotted line) yields an apparent\nSalpeter-like slope.\n\nwith Salpeter's IMF, they are an artifact of having an\nupper clump mass limit in the sample and do not reflect\nthe true clump mass function\nIn summary, one must be aware of introducing biases\nwhen using the high mass range to fit power laws or when\nfitting broken power laws to the cumulative mass function. These problems are minimized (but still present)\nwith samples larger than 100 clumps.\n3.6. Spatial Distribution of Clumps\n\nIn order to understand the process of fragmentation,\nwe need to explain how masses are distributed in clumps\nand how they are positioned in space. A complete theory\nof star formation must not only reproduce the mass function, but it must explain it in all its physical implications\nincluding how clumps, cores and stars are distributed\nspatially during the evolution of the GMC (Bonnel et\nal. 2006). The exhaustive study of the spatial distribution of young stars in the Taurus region by Gómez et\nal. (1993) was extended by other authors and compiled\nby Larson (1995). Here we undertake a study the degree of clustering of clumps in NGC 6334 using a similar\napproach.\n3.6.1. Clustering and Segregation of Clumps\n\nThe number density of clumps can give us insight\nabout the actual state of fragmentation and how the\nclumps are distributed spatially independent of their\nmass. We study the number density of clumps by means\nof the Simple Grid3 and the Kernel Methods4 . Both\nmethods require a free parameter which determines the\n\"resolution\" of the number density estimator: the binning length D in the grid technique, and the smoothing\nlength h in the Kernel Method, where a kernel K is defined at each pixel of the map in Figure 1 by\n1 −(x2 +y2 )/2h2\nK(x, xi , y, yi ) =\ne\n,\n(7)\n2π\nwith the kernel density estimator D defined by\nn\n1 X\nD(x, y) = 2\nK(x, xi , y, yi ) ,\n(8)\nh i=1\nwhere x and y are measured in pc ignoring the sky curvature. The grid bin l was taken to be 2 pc while h was\n3 The Grid Method consists in binning the two-dimensional\nspace with squares of side l and then dividing the numbers of\nsources lying within each square by the area of it l2 , to obtain\nnumber density in units of length−2\n4 The Kernel Method (Silverman 1986) uses a kernel function K\noffering the advantage that the density distribution is smoothed. In\neach point (x, y) of (α, δ), the kernel density estimator determines\nthe density due to the contributions of all n data points.\n\n\f10\n\nMuñoz et al.\nNearest Neighbor Distance\n\nFig. 11.- Average Surface Density as a function of separation\nin degrees (Equation 10). The vertical dotted lines encompass the\nlimits of validity for the fit: the beamsize log θ = −2.7 (∼ 0.2 pc),\nand the sampling bias (the width of subregion NGC 6334b) at\nlog θ = −0.5 or 10 pc.\nFig. 10.- Normalized Nearest Neighbor Distribution after dividing by 181, the number of neighbor pairs (solid line) and the expected distribution for random (Poisson) distribution of the same\nnumber of objects as the original sample over an identical area\n(dot-dashed line). The medians of the distributions are indicated\nby dotted lines.\n\nchosen in order to smooth the distribution over an area\nπh2 similar in size to the area over which the simple grid\ntechnique smoothed the data points (l2 ).\nWe applied this analysis to the subregion NGC 6334b\nwhich covers and area of ∼ 330 pc−2 . We find that the\nprobability that the clumps are distributed at random\nwithin this subregion is ∼ 10−5 , which argues in favor of\nclustered fragmentation at scales between 0.1 and 10 pc.\nThus, we conclude that there is spatial segregation in\nclump number in addition to clump mass.\n3.6.2. The Nearest-Neighbor Distribution in NGC 6334\n\nWe calculate the nearest-neighbor distribution (i.e. the\nfrequency distribution of the linear distance to the nearest neighbor of each clump) for the clumps in NGC 6334.\nWe neglect those clumps located too close to the edge of\nthe mapping area but do not exclude them from the total\nsample since they can be the nearest neighbor for an inner clump. We binned the nearest neighbor distances in\nintervals of 0.2 pc to construct the histograms shown in\nFigure 10. The nearest neighbor distribution is strongly\nskewed to small separations and very different from the\ndistribution expected from random positions at the same\nmean density. The differential probability of observing\nat least one event in the interval [r1 , r2 ] which defines a\nring surrounding a central source is (Gómez et al. 1993)\n2\n\n2\n\n∆P (r1 , r2 , η) = e−πηr1 − e−πηr2 .\n\n(9)\n\nwhere η = N/A is the average density, in this case given\nby η = 0.11 clumps pc−2 . Figure 10 compares the Poisson distribution histogram (dashed line) with the normalized nearest-neighbor distribution for clumps. The\nmedian for the random distribution (1.7 pc) is a factor of ∼ 2.5 greater than that derived from the actual\nclump distribution (dotted vertical lines in Figure 10).\nWe would need to increase the average density η by a\nfactor of 5 to produce a random distribution with the\nsame median separation as the actual clump distribution. Thus, we conclude that the median separation of\nthe clump distribution is significantly smaller than the\nexpected median separation of a random distribution.\n\n3.7. The Average Angular Surface Density of Clumps in\n\nNGC 6334\nMost of the newly formed stars in nearby regions of\nstar formation are located in groups or clusters. The\ndegree of clustering of pre-main sequence stars can be\nobtained by measuring their surface density as a function\nof angular distance, Σ(θ), from each star. This surface\ndensity can be fit by power-laws (Gomez et al. 1993);\nLarson (1995) found that there is a characteristic spatial\nscale (∼ 0.04 pc) where the surface density changes slope.\nThis scale could mark a transition between the regime\nof cores within molecular clouds and protostars within\ncores.\nWe applied the approach followed by Larson (1995)\nto the clumps in NGC 6334, which have typical sizes\n∼ 0.1 pc and separations of ∼ 1 pc. We compute Σ(θ)\nby taking each clump k and dividing the surrounding\narea of the sky into a set of annuli of radius θi (with\nθi = 1.5θi−1 ), and counting the number of companion\nclumps Nk (θi ) in each annulus (Kitsionas et al. 1998).\nThen,\nPN\n1\n(θi + θi−1 )\nk=1 Nk (θi )\nΣ(θi ) =\nθi =\n. (10)\n2 ) ,\nN π(θi2 − θi−1\n2\nThe results are plotted in Figure 11. The surface density is poorly fitted by a single power-law, but the fit is\nmuch improved when using a broken-power law. However, this reflects a sampling problem at large separations, since the area observed around NGC 6334 is not\nsquare, Its narrowest part has a width of ∼ 10 pc, just\nwhere the power-law apparently breaks. The reliable\nportion of the power-law has a slope of −0.62\nΣc ∝ θ−0.62\n\n0.6 pc ≤ θD ≤ 10 pc ,\n\n(11)\n\nwhich is remarkably similar to the one found by Larson\n(1995) for separations larger than 0.04 pc calculated from\nyoung stars in the Taurus-Auriga region:\nΣc ∝ θ−0.62\n\n0.04 pc ≤ θD ≤ 2.5 pc.\n\n(12)\n\nThese two results cover two different separation ranges\nin regions with widely different physical properties, yet\nthe surface density distribution is the same. If clustering above the characteristic length of 0.04 pc maintains\na self-similar behavior up to 10 pc, then the grouping\nof stars at large separations (between subclusters for example) could be determined from early stages of cloud\nfragmentation before stars are formed.\n\n\fMASSIVE CLUMPS IN NGC 6334\n4. DISCUSSION\nThe CMF and its relation to the IMF. - The clump mass\n\nfunction is, on one hand tied to the formation and evolution of their parent molecular clouds, and on the other\nto the formation of their daughter stars. Provided that\nthe mechanism of clump fragmentation and collapse to\nform stars is universal, then the IMF should be a direct consequence of the CMF. However, since a single\nclump generally forms multiple stars, we can't expect\nthe distribution of clump masses and stellar masses to\nhave identical functional form.\nWe find that the mass spectrum of clumps in NGC 6334\nhas a power-law dependence with mass with an index\nx = 0.62 (dN/d log M ∝ M −0.62 ). This value is similar\nto values derived from dust continuum observations for\nother massive star forming regions (Kerton et al. 2001;\nTothill et al. 2002; Mookerjea et al. 2005). It is also similar to values derived from molecular line observations,\nusually isotopomeric lines of CO, for clouds with similar total mass. For instance, Nozawa et al. (1991) finds\nα = 1.7 in Ophiucus North (mass range of 4–250 M ),\nStutzki & Gusten (1990) finds the same exponent in\nM17SW (mass range of 10–3200 M ), and Kramer et\nal. (1998) reports α = 1.8 for NGC 7538 (mass range of\n50–3.9×103 M ). These results indicate that the clumps\nin all these massive star forming regions are not the direct progenitors of individual stars. The fact that the\nmassive clumps follow a power-law mass function over a\nwide range in mass is remarkable. The similarity of the\n\"high mass\" CMF slope to the Mass Function of GMC's\nin our Galaxy (Sanders et al. 1985; Solomon et al. 1987;\nPudritz 2002) seems to support a hierarchical or fractal\nmodel of the distribution of gas in the Milky Way, where\nfragmentation and mass distribution can be interpreted\nas scale free.\nIn order to build a complete theory of star formation we\nmust understand the process of clustered star formation\nin clumps satisfying the observed CMF (dN/d log M ∝\nM −0.6 ) and leading to the observed IMF (dN/d log M ∝\nM −1.35 ). This has stimulated studies about the process\nof fragmentation of GMCs and clumps both theoretically\nand observationally. Hydrodynamic and magnetohydrodynamic numerical calculations suggest that turbulence\nmight play a major role in the clump fragmentation process. For example Bonnell & Davies (1998) suggest that\nstars are formed through the competitive accretion of gas\nonto proto-cores within molecular clouds.\nRecent sub-millimeter and millimeter continuum observations of low-mass star forming regions (e.g. Ophiucus, Serpens, Orion B) (Motte et al. 1998; Testi &\nSargent 1998; Johnstone et al. 2000b, 2001; Beuther &\nSchilke 2004) have revealed a CMF with a slope similar to\nthat to the IMF. The different values obtained from the\nmolecular line observations described above and these\ncontinuum observations probably reflects the different\nmass ranges sampled. In fact, dust continuum emission\nobservations toward more distant massive star forming\nregions have revealed CMF slopes consistent with a value\nof -0.6 (Kerton et al. 2001; Tothill et al. 2002; Mookerjea et al. 2005; this work), similar to that obtained from\nmolecular line observations. From observations of a sample of massive clumps toward the massive star forming\nregion NGC 7538, Reid & Wilson (2005) concluded that\n\n11\n\na Salpeter-like mass function is already established at\nthe earliest stages of star formation. This is a surprising result since many of their clumps, with masses of\n102 − 103 M , are still likely to be undergoing the process of fragmentation and can not be direct progenitors\nof individual stars. Even if the structure in ISM were\nfractal, self-similarity must break on small scales, where\nstar formation is taking place. We note, however, that\nthe result of Reid & Wilson (2005) comes from a fit to\nthe high mass end of the cumulative mass function. We\nshowed in section 3.5.3 that these fits are biased towards\nlarger exponents. In addition to molecular line and dust\ncontinuum surveys, extinction maps can be used to map\nthe dense molecular cores in star forming regions. Using this technique, Alves et al. (2007) have found a mass\nspectrum for cores in the Pipe Nubula that is surprisingly similar to the IMF. Their CMF displaced to higher\nmasses with respect to the stellar IMF only by a factor\nof 3, suggesting a one-to-one mapping from cores to stars\nwith a star formation efficiency of ∼ 30%. In their case,\nthe cores detected span a range of masses of 1-10 M approximately. This clearly indicates a much smaller scale\nthan the clumps in our work whether determined by the\ntracer or just the spatial resolution of the observations. It\nis not clear if the scale of the observations determines the\nobserved fragmentation conditions i.e. the distribution\nof masses or if the IMF is a result of the complex evolution of the accreting cores and their interplay with the\nharboring molecular cloud and other companions. The\nlow star forming activity in the Pipe Nebula has led ?\nto suggest that this CMF can be determined at early\nevolutionary stages.\nAssuming that at scales of 0.4 pc and masses from\n100M to 5000M the Blitz slope (≡ 0.6) is valid, the\nquestion that arises is: What must happen to change\nthe slope from Blitz-like to Salpeter-like? In the context\nof gravitational opacity limited fragmentation, gravitational collapse starts from density inhomogeneities and\nproceeds with cooling, which in turn produces smaller\nJeans masses in the colder regions, favoring gravitational fragmentation on small scales. In a strictly selfsimilar regime, fragmentation should occur maintaining\nthe same slope in the mass spectrum at any scale. But\nat some point the gas cores will not be supported by\nthermal or non-thermal motions, collapse will occur and\nstars will form, halting the clump fragmentation, while\nlarger and less dense clumps will continue fragmenting.\nEventually large clump masses will be depleted, and the\nnumber of small mass clumps will increase steepening\nthe slope to eventually reach a Salpeter value. The exact\nform in which this happens is probably a combination of\nmany of the mechanisms proposed.\nWill these clumps form stars? - The discussion above assumes that all clumps fragment to form stars in order to\nobtain the IMF from a CMF. However, this might not\nbe the case, in particular for some of the least massive\nclumps further away from the cloud center. Are these\nclumps gravitationally bound? Are they hence likely to\ncollapse or are they only transient structures or overdensities triggered by turbulent compressive shocks? These\nquestions have yet to be answered,either observationally\nor theoretically.\nNumerical simulations commonly report that many\n\n\f12\n\nMuñoz et al.\n\nof the lower-mass cores formed are not gravitationally\nbound (Klessen 2001; Clark & Bonnell 2005; Tilley &\nPudritz 2005). Furthermore, the mass spectra can be understood as due to purely hydrodynamical effects without gravity (e.g. Clark & Bonnell 2006). As Padoan\n& Nordlund (2002) remark, the mass spectra resulting\nfrom turbulent fragmentation is different from the one\nthat considers collapsing or unstable cores. Only the latter form stars. These calculations show that many of the\nclumps could be transient structures; indeed a significant\nfraction of the cores end up re-expanding rather than collapsing (Vázquez-Semadeni et al. 2005; Nakamura & Li\n2005). This implies that fragmentation is not sufficient\nto trigger star formation. If supersonic turbulence generates the initial density enhancements from which cores\ndevelop, then these cores might not necessarily approach\nhydrostatic equilibrium at any point in their evolution\n(Ballesteros-Paredes et al. 1999).\nCan we distinguish observationally between bound and\ntransient clumps? To estimate if clumps are likely or\nnot to collapse, we need to know more than its mass.\nA clump's column density is important as a diagnostic\nof whether the clump is likely to collapse (Pudritz 2002).\nValues higher than N ' 1022 cm−2 are observed for cores\nwith embedded sources. The virial parameter, Mvir /M ,\nwhere M is a mass derived from column density and Mvir\nis the virial mass derived from the cloud radius and velocity dispersion(Bertoldi & McKee 1992), is known to have\nvalues close to 1.0 in star forming clouds (Onishi et al.\n1996; Yonekura et al. 2005). However, given the observational uncertainties it is not yet clear if this parameter is\na good diagnostic for star forming vs. transient clumps.\nPreferred spatial scale. - As Larson (1995) found in Taurus, there might exist a preferred scale of star formation\nat which clustering changes. This length can be related\nto the Jeans length and the Jeans mass. The surface\nnumber density of the clumps as a function of separation\ncan reveal a characteristic spatial scale, marking a transition between clumps and cores. At separations larger\nthan 0.6 pc and smaller than 10 pc, we find the same\nslope for the power-law fit to the surface density of companions as the protostars in Taurus do at large separations: Σ ∝ θ−0.62 . This suggests that large separations\nin stellar systems are determined by the position of their\nprogenitor clumps.\n5. CONCLUSIONS\n\nWe made observations of the 1.2-mm dust emission\ntoward the Giant Molecular Cloud NGC 6334 using the\nSIMBA bolometer at the SEST. The main results and\nconclusions presented in this paper are summarized as\nfollows.\nWe find 181 clumps, distributed in an area of ∼ 2.0\nsquare degrees centered on the main filament, which harbors most of the star-forming activity. The clumps range\nin size from 0.1 to 0.9 pc, with a median of 0.35 pc. This\nrange is similar to that found by Faúndez et al. (2004)\nand Plume et al. (1997) for clumps in different high mass\n\nstar forming regions. The clump masses, assuming they\nare isothermal, range from 3 M to 6 × 103 M , with a\ncompleteness limit of ∼ 30 M (assuming Td = 17 K).\nThe Clump Mass Function (CMF) is well fit with a\npower-law dependence with mass with an index x =\n0.62 ± 0.07 (dN/d log M ∝ M −x ) in the mass range between 30 M to 6 × 103 M . The slope differs from the\nstellar IMF slope, indicating that clumps are not direct\nprogenitors of stars. Therefore other processes besides\nfragmentation must be important in setting up the IMF\nfrom the CMF.\nWe assessed possible effects on the derived slope of the\nCMF due to changes on the temperature assumptions\nand due to the contribution of free-free emission from\nionized gas to the 1.2-mm emission. Although . 10%\nof the clumps are likely to be significantly warmer than\n17 K and are associated with regions of ionized gas, the\ncorrection for temperature and free-free emission has little effects on the derived slope.\nWe investigated possible differences in the value of x\namong different sub-regions of NGC 6334. We find that\nthe slope is significantly shallower toward the central filament (x ≈ 0.1), which contains the most massive clumps\nand represents the minimum of the gravitational potential in the GMC. As we cover more extended regions,\nwith clumps not actively forming stars, the slope steepens (≈ 0.5, 0.8), revealing that the bulk of the clumps\nare located in the outer areas of the molecular cloud and\nthat these low-mass clumps predominantly determine the\nshape of the mass function.\nWe caution about the power-law fitting procedures to\nthe mass function. The differential CMF is sensitive to\nbin size and to low-number statistics in the last bin (highmass end) as well as to completeness limits in the lowmass end. On the other hand, fitting a power-law to the\nhigh mass end of the cumulative CMF is incorrect due to\nits high mass cutoff. Both the low-mass and high-mass\nends of the cumulative CMF must be avoided in fitting\npower-laws.\nThe spatial analysis performed on the two-dimensional\ndistribution of clumps reveals that they are not distributed randomly. They are concentrated toward the\ncenter of the filament, indicating not only a segregation\nin mass but also a segregation in number which could\nsuggest a possible coalescence of massive clumps towards\nthe gravitational potential minimum. In addition, we\nstudy the surface density of companions as a function of\nseparation. This is well fit by a power-law with a similar\nexponent to the one found for proto-stars in Taurus at\nlarge angular separations. This suggests that the position of stars in clusters is determined in the fragmentation and star formation stage rather than after dynamical\nrelaxation.\nWe thank Simón Casassus and Dieter Nurnberger for\nhelpful comments. D.J.M., D.M., G.G., and D.R. gratefully acknowledge support from the Chilean Centro de\nAstrofı́sica FONDAP No. 15010003.\n\nREFERENCES\nAltenhoff, W., Mezger, P.G., Wendker, H., & Westerhout, G., 1961,\nVeroffentl. Sternwarte, 59, 48\nAlves, J., Lombardi, M., & Lada, C. J. 2007, A&A, 462, L17\n\nBallesteros-Paredes, J., Vázquez-Semadeni, E., & Scalo, J. 1999,\nApJ, 515, 286\nBeckert, T., Duschl, W. J., & Mezger, P. G. 2000, A&A, 356, 1149\n\n\fMASSIVE CLUMPS IN NGC 6334\nBertoldi, F., & McKee, C. F. 1992, ApJ, 395, 140\nBeuther, H. & Schilke, P. 2004, Science, 303, 1167\nBeuther, H., Churchwell, E. B., McKee, C. F., & Tan, J. C. 2006,\nArXiv Astrophysics e-prints, arXiv:astro-ph/0602012\nBonnell, I. A., & Davies, M. B. 1998, MNRAS, 295, 691\nBlitz, L. 1993, Giant Molecular Clouds, in Protostars and Planets\nIII, eds. E.H. Levy & J.I. Lunine (Tucson: Univ. of Arizona\nPress)\nBrooks, K. J., Garay, G., Nielbock, M., Smith, N., & Cox, P. 2005,\nApJ, 634, 436\nBurton, M.G., Ashley, M.C.B., Marks, R.D., Schinckel, A.E.,\nStorey, J.W.V., Fowler, A., Merril, M., Sharp, N., Gatley, I.,\nHarper, D.A., Loewenstein, R.F., Mrozek, F., Jackson, J.M., &\nKraemer, K.E. 2000 ApJ,542, 359\nCarral, P., Kurtz, S.E., Rodrı́guez, L.F., Menten, K., Cantó, J., &\nArceo, R. 1978, AJ, 123, 2574\nChini, R., Krügel, E. & Wargau, W. 1987, A&A, 181, 378\nClark, P. C., & Bonnell, I. A. 2006, MNRAS, 368, 1787\nClark, P. C., & Bonnell, I. A. 2005, MNRAS, 361, 2\nEvans, N. J., II 1999, ARA&A, 37, 311\nFaúndez, S., Bronfman, L., Garay, G., Chini, R., Nyman, L.-Å., &\nMay, J. 2004, A&A, 426, 97\nGaray, G., Brooks, K.J., Mardones, D., Norris,R.P., & Burton,\nM.G. 2002, ApJ, 579, 678\nGezari, D.Y. 1982, ApJ, 259, L29\nGómez, M.,Hartmann, S., Kenyon, S.J.,& Hewett,R. 1993, AJ, 105,\n5\nHunter, T. R., Brogan, C. L., Megeath, S. T., Menten, K. M.,\nBeuther, H., & Thorwirth, S. 2006, ApJ, 649, 888\nJackson, J.M. & Kraemer, K. E., 1999, ApJ, 512, 260\nJohnstone, D., Wilson, C. D., Moriarty-Schieven, G.,\nGiannakopoulou-Creighton, J., & Gregersen, E. 2000a, ApJS,\n131, 505\nJohnstone, D., Wilson, C.D., Moriarty-Schieven, G., Joncas, G.,\nSmith, G., Gregersen, E. & Fich, M. 2000b, ApJ, 545, 327\nJohnstone, D.,Fich, M. Mitchell, G.F., & Moriarty-Schieven, 2001,\nApJ, 559, 307\nJohnstone, D., Matthews, H., & Mitchell, G. F. 2006, ApJ, 639,\n259\nKerton, C.R., Martin, P.G.,, Johnstone, D., & Ballantyne, D.R.\n2001, ApJ, 552, 601\nKitsionas, S., Gladwin, P. P., & Whitworth, A. P. 1998, ASP\nConf. Ser. 132: Star Formation with the Infrared Space\nObservatory, 132, 434\nKlessen, R. S. 2001, ApJ,556, 837\nKlessen, R. S., & Burkert, A. 2000, ApJS, 128, 287\nKramer, C., Stutzki, J., Rörig, R.,& Corneliussen, U. 1998, A&A,\n329, 249\nKraemer, K. E., & Jackson, J. M. 1999, ApJS, 124, 439\nKraemer, K.E., Jackson, J.M. 1999, Lane, A.P. & Paglione, T.A.D.\nApJ, 542, 946\nKroupa, P. 2001, MNRAS, 322, 231\nLada, C. J., & Lada, E. A. 2003, ARA&A, 41, 57\nLada, E. A. 1999, NATO ASIC Proc. 540: The Origin of Stars\nand Planetary Systems, C.J. Lada, N.D. Kylafis, Eds. (Kluwer,\nDotrecht, Netherlands, 200), p 441\nLarson, R. 1995, MNRAS, 272, 213\nLarson, R. B. 2003, ASP Conf. Ser. 287: Galactic Star Formation\nAcross the Stellar Mass Spectrum, J.M. De Buizer abd N.S. van\nder Blick, (eds), 287, 65\nLi, D., Velusamy, T., Goldsmith, P. F., & Langer, W. D. 2006,\nArXiv Astrophysics e-prints, arXiv:astro-ph/0610634\nMcBreen,B., Fazio, G.G., Stier, M., & Wright, E.L. 1979, ApJ, 232,\nL183\nMcCutcheon, W.H., Sandell, G. Matthews, H.E., Kuiper, T.B.H.,\nSutton, E.C., Danchi, W.C. & Sato, T. 2000, MNRAS, 316, 152\n\n13\n\nMenzel, D. H., & Pekeris, C. L. 1935, MNRAS, 96, 77\nMookerjea, B., Kramer, C., Nielbock, M., & Nyman, L.-Å. 2005,\nA&A, 426, 119\nMoran, J. M., Greene, B., Rodriguez, L. F., & Backer, D. C. 1990,\nApJ, 348, 147\nMotte, F., Andre, P., & Neri, R. 1998, A&A, 336, 150\nMotte, F., Schilke, P., & Lis, D.C., 2003, ApJ, 582, 277\nMuñoz, D.J. 2006, M.Sc. Thesis, Universidad de Chile\nNakamura, F., & Li, Z.-Y. 2005, ApJ, 631, 411\nNeckel, T. 1978, A&A, 69, 51\nNozawa, S., Mizuno, A., Teshima, Y., Ogawa, H. & Fukui, Y. 1991,\nApJS, 77,647\nOnishi, t., Mizuno, A., Kawamura, A., Ogawa, H., & Fukui, Y.\n1996, ApJ, 465, 815\nOssenkopf, V., & Henning, T. 1994, A&A, 291, 943\nPadoan, P., & Nordlund, Å 2002, ApJ, 576, 870\nPlume, R., Jaffe, D. T., Evans, N. J., II, Martin-Pintado, J., &\nGomez-Gonzalez, J. 1997, ApJ, 476, 730\nPudritz, R. E. 2002, Science, 295, 68\nReid, M. A., & Wilson, C. D. 2005, ApJ, 625, 891\nReid, M. A., & Wilson, C. D. 2006a, ApJ, 644, 990\nReid, M. A., & Wilson, C. D. 2006b, ApJ, 650, 970\nRodrı́guez, L.F., Cantó, J., & Moran, J.M. 1982, ApJ, 255, 103\nRosolowsky, E. 2005, PASP, 117, 1403\nRybicki, G. B., & Lightman, A. P. 1979, Radiative Processes in\nAstrophysics, New York, Wiley-Interscience, 1979. 393 p.,\nSalpeter, E. E. 1955, ApJ, 121, 161\nSandell, G. 2000, A&A, 358,242\nSanders, D. B., Scoville, N. Z., & Solomon, P. M. 1985, ApJ, 289,\n373\nScalo, J. 1998, ASP Conf. Ser. 142: The Stellar Initial Mass\nFunction (38th Herstmonceux Conference), G. Gilmore and\nD. Howell (eds),142, 201\nSchneider, N., & Brooks, K. 2004, Publications of the Astronomical\nSociety of Australia, 21, 290\nSilverman, B. W. 1986, Monographs on Statistics and Applied\nProbability, London: Chapman and Hall, 1986\nSolomon, P. M., Rivolo, A. R., Barrett, J., & Yahil, A. 1987, ApJ,\n319, 730\nSommerfeld, A.J.F., Atombau und Spektrallinien, Vol.2. Ungar,\nNew York, 1953.\nStraw, S. M., & Hyland, A. R. 1989, ApJ, 340, 318\nStraw, S. M., Hyland, A. R., & McGregor, P. J. 1989, ApJS, 69,\n99\nStutzki, J., & Güsten, R. 1990, ApJ, 356, 513\nTesti, L., & Sargent, A. I. 1998, ApJ, 508, L91\nTilley, D. A., & Pudritz, R. E. 2005, ArXiv Astrophysics e-prints,\narXiv:astro-ph/0508562\nTothill,N.F.H., White, G.J., Matthews, H.E., McCutcheon, W.H.,\nMcCaughrean, M.J., & Kenworthy, M.A. 2002, ApJ, 580, 285\nVázquez-Semadeni, E., Kim, J., Shadmehri, M., & BallesterosParedes, J. 2005, ApJ, 618, 344\nWard-Thompson, D., Andre, P., Crutcher, R., Johnstone, D.,\nOnishi, T., & Wilson, C. 2006, ArXiv Astrophysics e-prints,\narXiv:astro-ph/0603474\nWilliams, J.P., Blitz,L. & McKee, C.F. 2000, in Protostars and\nPlanets IV, ed. V. Mannings, A.P. Boss, & S.S. Russell (Tucson:\nUniv. of Arizona), 97\nWilliams, J.P., de Geus ,E.J., & Blitz, 1994, ApJ, 428, 693\nYonekura, Y., Asayama, S., Kimura, K., Ogawa, H., Kanai, Y.,\nYamaguchi, N., Barnes, P. J., & Fukui, Y. 2005, ApJ, 634, 476\n\n\f14\n\nMuñoz et al.\nTABLE 4\nClump Properties in NGC 6334\n\nClump\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\n\n1\n2\n3\n4\n6\n7\n8\n9\n10\n11\n14\n15\n16\n19\n20\n23\n25\n27\n29\n30\n33\n34\n35\n37\n42\n43\n45\n48\n51\n52\n54\n56\n57\n58\n66\n74\n75\n76\n77\n79\n81\n84\n86\n89\n92\n95\n96\n104\n106\n108\n109\n110\n111\n112\n113\n114\n115\n117\n118\n120\n122\n123\n127\n128\n129\n131\n\nα\n(J2000)\n\nδ\nJ2000\n\nIpeak\n[Jy beam−1 ]\n\nSν\n[Jy]\n\nReff\n[pc]\n\nM1.2mm a\n[M ]\n\nM\n[M ]\n\nnb\n[cm−3 ]\n\n17h 20m 53.9s\n17h 20m 55.9s\n17h 20m 19.8s\n17h 19m 56.7s\n17h 17m 1.9s\n17h 20m 24.4s\n17h 20m 49.9s\n17h 20m 48.0s\n17h 20m 53.9s\n17h 20m 34.2s\n17h 23m 16.8s\n17h 20m 10.5s\n17h 20m 43.4s\n17h 20m 42.7s\n17h 20m 53.9s\n17h 20m 15.8s\n17h 20m 57.1s\n17h 20m 25.7s\n17h 20m 55.8s\n17h 20m 32.9s\n17h 20m 51.9s\n17h 21m 35.2s\n17h 19m 7.8s\n17h 20m 50.5s\n17h 20m 56.4s\n17h 17m 21.5s\n17h 17m 49.2s\n17h 19m 23.7s\n17h 17m 43.2s\n17h 22m 34.1s\n17h 22m 28.1s\n17h 17m 7.2s\n17h 22m 0.5s\n17h 23m 25.9s\n17h 22m 51.6s\n17h 20m 0.0s\n17h 19m 44.9s\n17h 20m 40.1s\n17h 20m 2.6s\n17h 19m 12.5s\n17h 19m 38.3s\n17h 23m 29.2s\n17h 21m 1.7s\n17h 18m 34.8s\n17h 20m 7.3s\n17h 19m 43.4s\n17h 21m 7.7s\n17h 17m 59.0s\n17h 16m 33.8s\n17h 21m 2.4s\n17h 22m 5.1s\n17h 21m 49.3s\n17h 21m 4.4s\n17h 22m 30.7s\n17h 21m 16.2s\n17h 19m 40.8s\n17h 22m 7.7s\n17h 21m 2.3s\n17h 22m 33.6s\n17h 19m 6.5s\n17h 22m 52.5s\n17h 20m 31.0s\n17h 21m 36.3s\n17h 19m 7.9s\n17h 21m 28.6s\n17h 17m 58.5s\n\n-35◦ 47' 1.3\"\n-35◦ 45'17.3\"\n-35◦ 54'45.7\"\n-35◦ 57'58.0\"\n-36◦ 20'53.9\"\n-35◦ 55' 1.9\"\n-35◦ 45' 9.4\"\n-35◦ 45'57.2\"\n-35◦ 43'25.3\"\n-35◦ 51'33.8\"\n-34◦ 48'43.6\"\n-35◦ 54'54.0\"\n-35◦ 47'49.6\"\n-35◦ 49'17.4\"\n-35◦ 42'21.2\"\n-35◦ 59'25.8\"\n-35◦ 40'29.3\"\n-35◦ 53'10.0\"\n-35◦ 41'41.3\"\n-35◦ 46'45.8\"\n-35◦ 40'29.3\"\n-35◦ 40'19.6\"\n-36◦ 7' 1.2\"\n-35◦ 35'25.4\"\n-35◦ 39'41.0\"\n-36◦ 8'31.6\"\n-36◦ 9'13.7\"\n-36◦ 3'41.8\"\n-36◦ 10'33.2\"\n-35◦ 13'11.6\"\n-35◦ 8'56.0\"\n-36◦ 19' 2.3\"\n-35◦ 27'38.2\"\n-34◦ 48'18.7\"\n-34◦ 52'54.1\"\n-36◦ 12'54.0\"\n-35◦ 56'21.8\"\n-35◦ 45'57.6\"\n-36◦ 12' 6.1\"\n-36◦ 6'13.3\"\n-35◦ 56'53.9\"\n-34◦ 48'34.2\"\n-35◦ 39' 1.1\"\n-36◦ 8'44.2\"\n-36◦ 9'10.1\"\n-36◦ 20'46.0\"\n-35◦ 43' 8.8\"\n-36◦ 13'22.1\"\n-36◦ 27'31.0\"\n-35◦ 42'29.2\"\n-35◦ 27'37.8\"\n-35◦ 27'23.0\"\n-35◦ 46'21.0\"\n-35◦ 11'12.1\"\n-35◦ 46'28.6\"\n-36◦ 24'54.0\"\n-35◦ 27'45.7\"\n-35◦ 31'32.9\"\n-34◦ 58'23.5\"\n-36◦ 10'37.2\"\n-35◦ 16'38.3\"\n-36◦ 1' 1.9\"\n-35◦ 32' 3.5\"\n-36◦ 4'29.3\"\n-35◦ 40'52.0\"\n-36◦ 9' 6.1\"\n\n17.47\n14.92\n8.92\n7.15\n4.13\n3.58\n2.91\n2.74\n2.62\n2.30\n1.98\n1.70\n1.68\n1.36\n1.29\n1.10\n1.08\n1.02\n0.94\n0.93\n0.81\n0.81\n0.77\n0.74\n0.68\n0.68\n0.64\n0.63\n0.57\n0.57\n0.55\n0.52\n0.50\n0.49\n0.45\n0.42\n0.42\n0.42\n0.42\n0.41\n0.41\n0.40\n0.39\n0.37\n0.35\n0.34\n0.33\n0.31\n0.31\n0.30\n0.30\n0.30\n0.29\n0.29\n0.28\n0.27\n0.27\n0.27\n0.26\n0.26\n0.26\n0.26\n0.25\n0.25\n0.24\n0.24\n\n68.38\n95.17\n61.08\n59.31\n31.86\n26.72\n16.45\n21.73\n13.90\n27.12\n13.54\n21.30\n16.44\n26.78\n6.93\n15.41\n6.89\n13.69\n5.27\n7.41\n5.27\n5.04\n12.77\n10.11\n5.00\n4.16\n6.43\n5.11\n5.34\n8.13\n6.33\n6.19\n2.68\n3.64\n1.57\n4.14\n3.97\n2.54\n3.92\n4.39\n4.99\n1.91\n3.86\n3.33\n1.46\n2.39\n1.91\n1.25\n1.64\n2.63\n1.41\n3.73\n1.44\n3.42\n1.47\n2.64\n2.40\n0.97\n4.01\n2.88\n1.48\n2.43\n2.35\n4.79\n0.59\n2.00\n\n0.59\n0.65\n0.62\n0.86\n0.92\n0.59\n0.36\n0.45\n0.45\n0.71\n0.68\n0.74\n0.50\n0.68\n0.36\n0.74\n0.39\n0.59\n0.36\n0.56\n0.39\n0.53\n0.77\n0.74\n0.39\n0.56\n0.53\n0.56\n0.53\n0.74\n0.68\n0.65\n0.36\n0.45\n0.36\n0.50\n0.47\n0.42\n0.53\n0.53\n0.56\n0.36\n0.45\n0.53\n0.33\n0.47\n0.39\n0.33\n0.42\n0.45\n0.33\n0.56\n0.36\n0.56\n0.36\n0.50\n0.50\n0.30\n0.65\n0.53\n0.39\n0.50\n0.47\n0.65\n0.24\n0.42\n\n4.22×103\n5.88×103\n3.77×103\n3.66×103\n1.97×103\n1.65×103\n1.02×103\n1.34×103\n8.59×102\n1.68×103\n8.36×102\n1.32×103\n1.02×103\n1.65×103\n4.28×102\n9.52×102\n4.25×102\n8.45×102\n3.25×102\n4.58×102\n3.26×102\n3.11×102\n7.89×102\n6.24×102\n3.09×102\n2.57×102\n3.97×102\n3.16×102\n3.30×102\n5.02×102\n3.91×102\n3.82×102\n1.65×102\n2.25×102\n9.69×101\n2.56×102\n2.45×102\n1.57×102\n2.42×102\n2.71×102\n3.08×102\n1.18×102\n2.38×102\n2.06×102\n9.04×101\n1.47×102\n1.18×102\n7.69×101\n1.02×102\n1.62×102\n8.68×101\n2.30×102\n8.92×101\n2.11×102\n9.06×101\n1.63×102\n1.48×102\n5.97×101\n2.48×102\n1.78×102\n9.11×101\n1.50×102\n1.45×102\n2.96×102\n3.64×101\n1.23×102\n\n1.74×103\n5.88×103\n1.56×103\n1.47×103\n8.12×102\n5.10×102\n1.02×103\n1.34×103\n8.59×102\n5.63×102\n3.45×102\n5.43×102\n1.02×103\n3.73×102\n4.28×102\n9.52×102\n4.25×102\n2.77×102\n3.25×102\n1.89×102\n3.26×102\n3.11×102\n7.89×102\n6.24×102\n3.09×102\n2.57×102\n3.97×102\n3.16×102\n3.30×102\n5.02×102\n3.91×102\n3.82×102\n1.65×102\n2.25×102\n9.69×101\n2.56×102\n2.45×102\n1.57×102\n2.42×102\n2.71×102\n3.08×102\n1.18×102\n2.38×102\n2.06×102\n9.04×101\n1.47×102\n1.18×102\n7.69×101\n1.02×102\n1.62×102\n8.68×101\n2.30×102\n8.92×101\n2.11×102\n9.06×101\n1.63×102\n1.48×102\n5.97×101\n2.48×102\n1.78×102\n9.11×101\n1.50×102\n1.45×102\n2.96×102\n3.64×101\n1.23×102\n\n3.48×104\n8.86×104\n2.70×104\n9.69×103\n4.37×103\n1.02×104\n9.44×104\n6.38×104\n4.08×104\n6.54×103\n4.55×103\n5.58×103\n3.32×104\n4.92×103\n3.97×104\n9.77×103\n3.11×104\n5.56×103\n3.02×104\n4.42×103\n2.38×104\n8.57×103\n7.20×103\n6.41×103\n2.25×104\n6.01×103\n1.09×104\n7.38×103\n9.08×103\n5.16×103\n5.16×103\n5.76×103\n1.54×104\n1.07×104\n9.00×103\n8.36×103\n9.60×103\n9.19×103\n6.66×103\n7.46×103\n7.21×103\n1.10×104\n1.13×104\n5.66×103\n1.09×104\n5.78×103\n8.61×103\n9.27×103\n5.94×103\n7.72×103\n1.05×104\n5.39×103\n8.28×103\n4.94×103\n8.41×103\n5.32×103\n4.84×103\n9.57×103\n3.74×103\n4.89×103\n6.65×103\n4.90×103\n5.70×103\n4.46×103\n1.14×104\n7.21×103\n\nregion\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\n\n6334(6334a)(6334b)\n6334(6334a)(6334b)\n6334(6334a)(6334b)\n6334(6334a)(6334b)\n6334(6334c)\n6334(6334a)(6334b)\n6334(6334a)(6334b)\n6334(6334a)(6334b)\n6334(6334a)(6334b)\n6334(6334a)(6334b)\n6334(6334c)\n6334(6334a)(6334b)\n6334(6334a)(6334b)\n6334(6334a)(6334b)\n6334(6334a)(6334b)\n6334(6334a)(6334b)\n6334(6334a)(6334b)\n6334(6334a)(6334b)\n6334(6334a)(6334b)\n6334(6334a)(6334b)\n6334(6334a)(6334b)\n6334(6334b)\n6334(6334b)\n6334(6334b)\n6334(6334a)(6334b)\n6334(6334c)\n6334(6334c)\n6334(6334b)\n6334(6334c)\n6334(6334c)\n6334(6334c)\n6334(6334c)\n6334(6334b)\n6334(6334c)\n6334(6334c)\n6334(6334b)\n6334(6334a)(6334b)\n6334(6334a)(6334b)\n6334(6334b)\n6334(6334b)\n6334(6334b)\n6334(6334c)\n6334(6334a)(6334b)\n6334(6334c)\n6334(6334b)\n6334(6334c)\n6334(6334a)(6334b)\n6334(6334c)\n6334(6334c)\n6334(6334a)(6334b)\n6334(6334b)\n6334(6334b)\n6334(6334a)(6334b)\n6334(6334c)\n6334(6334b)\n6334(6334c)\n6334(6334b)\n6334(6334b)\n6334(6334c)\n6334(6334b)\n6334(6334c)\n6334(6334b)\n6334(6334b)\n6334(6334b)\n6334(6334b)\n6334(6334c)\n\n\fMASSIVE CLUMPS IN NGC 6334\n\n15\n\nTABLE 4\nClump Properties in NGC 6334\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\n\n132\n133\n134\n135\n136\n138\n140\n141\n142\n143\n145\n146\n147\n148\n149\n151\n152\n153\n155\n156\n159\n161\n163\n164\n165\n167\n169\n171\n175\n176\n179\n180\n181\n182\n184\n185\n186\n188\n189\n190\n192\n194\n197\n198\n200\n201\n203\n204\n205\n208\n209\n210\n213\n214\n215\n216\n217\n218\n219\n220\n223\n226\n227\n229\n231\n232\n233\n237\n240\n\n17h 18m 27.2s\n17h 20m 7.9s\n17h 22m 3.7s\n17h 22m 1.8s\n17h 21m 32.4s\n17h 19m 28.9s\n17h 21m 33.1s\n17h 18m 26.8s\n17h 21m 6.4s\n17h 17m 58.4s\n17h 21m 11.7s\n17h 20m 3.3s\n17h 17m 10.9s\n17h 21m 1.7s\n17h 21m 29.1s\n17h 23m 13.0s\n17h 17m 41.3s\n17h 20m 19.7s\n17h 18m 28.8s\n17h 18m 15.9s\n17h 20m 31.6s\n17h 19m 58.7s\n17h 22m 14.2s\n17h 16m 13.2s\n17h 18m 7.5s\n17h 18m 30.5s\n17h 20m 48.0s\n17h 22m 36.2s\n17h 23m 19.3s\n17h 16m 40.4s\n17h 20m 55.2s\n17h 17m 37.5s\n17h 16m 53.0s\n17h 21m 56.5s\n17h 21m 5.8s\n17h 20m 44.0s\n17h 18m 7.1s\n17h 22m 8.5s\n17h 22m 30.5s\n17h 18m 7.0s\n17h 23m 6.1s\n17h 20m 56.4s\n17h 17m 58.4s\n17h 20m 54.0s\n17h 19m 42.1s\n17h 19m 48.2s\n17h 20m 2.6s\n17h 21m 18.8s\n17h 18m 5.7s\n17h 19m 38.1s\n17h 18m 35.9s\n17h 19m 58.0s\n17h 22m 2.4s\n17h 20m 11.2s\n17h 20m 38.8s\n17h 17m 33.2s\n17h 18m 0.9s\n17h 21m 56.6s\n17h 23m 52.1s\n17h 21m 17.0s\n17h 21m 23.4s\n17h 22m 38.5s\n17h 20m 46.8s\n17h 20m 52.7s\n17h 23m 11.4s\n17h 21m 47.7s\n17h 23m 13.3s\n17h 19m 16.5s\n17h 20m 57.9s\n\n-36◦ 25'39.7\"\n-35◦ 58'45.8\"\n-35◦ 24'42.1\"\n-35◦ 26'18.2\"\n-35◦ 31'31.8\"\n-36◦ 9'57.6\"\n-35◦ 32' 3.8\"\n-36◦ 14'11.8\"\n-35◦ 47'33.0\"\n-36◦ 10' 2.3\"\n-35◦ 50' 4.6\"\n-36◦ 9'25.9\"\n-36◦ 26'30.8\"\n-35◦ 37'25.0\"\n-35◦ 31'31.8\"\n-34◦ 49'40.1\"\n-36◦ 9'13.0\"\n-35◦ 42'29.9\"\n-36◦ 12'51.8\"\n-36◦ 26'51.4\"\n-35◦ 48'29.9\"\n-36◦ 8'46.0\"\n-35◦ 26'49.2\"\n-36◦ 28'25.0\"\n-36◦ 17'54.6\"\n-36◦ 25'23.9\"\n-35◦ 51'49.3\"\n-34◦ 57'19.4\"\n-35◦ 16'59.5\"\n-36◦ 27'39.6\"\n-35◦ 48'45.4\"\n-36◦ 26'24.7\"\n-36◦ 27'49.0\"\n-35◦ 26'42.4\"\n-35◦ 48'52.9\"\n-35◦ 39'49.3\"\n-36◦ 7'54.8\"\n-35◦ 10'57.7\"\n-35◦ 25'19.9\"\n-36◦ 12'50.8\"\n-35◦ 13'32.9\"\n-35◦ 32'21.1\"\n-36◦ 12'18.4\"\n-35◦ 50'37.3\"\n-36◦ 22'37.9\"\n-35◦ 47'42.0\"\n-36◦ 0' 6.1\"\n-35◦ 42'12.2\"\n-36◦ 11'30.5\"\n-36◦ 23'33.7\"\n-36◦ 23'48.1\"\n-35◦ 55'58.1\"\n-35◦ 23'30.1\"\n-36◦ 14'13.9\"\n-35◦ 43' 1.6\"\n-36◦ 13'36.5\"\n-36◦ 17'22.2\"\n-35◦ 28'18.5\"\n-34◦ 51'51.5\"\n-35◦ 53' 8.5\"\n-35◦ 41' 0.2\"\n-35◦ 29'19.3\"\n-35◦ 59'25.4\"\n-35◦ 59'49.2\"\n-35◦ 14'52.4\"\n-35◦ 39'47.2\"\n-35◦ 15'32.0\"\n-36◦ 2' 5.6\"\n-35◦ 49'57.0\"\n\n0.24\n0.23\n0.23\n0.23\n0.23\n0.23\n0.22\n0.22\n0.22\n0.22\n0.22\n0.22\n0.22\n0.22\n0.22\n0.22\n0.21\n0.21\n0.21\n0.20\n0.20\n0.20\n0.20\n0.20\n0.20\n0.20\n0.19\n0.19\n0.19\n0.19\n0.18\n0.18\n0.18\n0.18\n0.18\n0.18\n0.18\n0.18\n0.18\n0.18\n0.17\n0.17\n0.17\n0.17\n0.17\n0.17\n0.17\n0.16\n0.16\n0.16\n0.16\n0.16\n0.16\n0.15\n0.15\n0.15\n0.15\n0.15\n0.15\n0.15\n0.15\n0.15\n0.15\n0.14\n0.14\n0.14\n0.14\n0.14\n0.14\n\n1.28\n0.92\n1.99\n1.09\n1.49\n1.56\n0.74\n1.24\n0.56\n1.30\n0.86\n1.21\n1.72\n1.82\n0.67\n0.99\n1.13\n1.17\n1.29\n1.14\n0.46\n0.56\n2.37\n0.57\n1.21\n0.82\n1.13\n0.73\n0.86\n1.66\n0.35\n1.38\n1.52\n1.35\n0.64\n0.48\n1.68\n0.49\n0.46\n0.78\n0.81\n2.63\n0.58\n0.59\n1.09\n0.44\n0.96\n0.58\n1.43\n0.57\n0.88\n1.34\n1.09\n0.20\n0.55\n0.53\n0.87\n0.92\n0.49\n0.27\n0.16\n0.44\n0.57\n0.49\n0.83\n0.32\n0.76\n0.80\n0.46\n\n0.36\n0.30\n0.45\n0.33\n0.42\n0.42\n0.27\n0.36\n0.24\n0.36\n0.30\n0.33\n0.47\n0.42\n0.27\n0.30\n0.33\n0.39\n0.36\n0.39\n0.24\n0.24\n0.53\n0.24\n0.36\n0.30\n0.36\n0.30\n0.33\n0.45\n0.21\n0.42\n0.45\n0.36\n0.27\n0.24\n0.45\n0.24\n0.24\n0.30\n0.33\n0.53\n0.27\n0.27\n0.36\n0.24\n0.36\n0.27\n0.45\n0.27\n0.36\n0.42\n0.39\n0.15\n0.27\n0.27\n0.33\n0.33\n0.27\n0.18\n0.15\n0.24\n0.27\n0.27\n0.33\n0.21\n0.33\n0.33\n0.24\n\n7.90×101\n5.66×101\n1.23×102\n6.71×101\n9.19×101\n9.64×101\n4.55×101\n7.68×101\n3.47×101\n8.06×101\n5.34×101\n7.45×101\n1.06×102\n1.12×102\n4.13×101\n6.13×101\n6.97×101\n7.24×101\n7.97×101\n7.01×101\n2.82×101\n3.48×101\n1.46×102\n3.51×101\n7.44×101\n5.08×101\n6.99×101\n4.51×101\n5.32×101\n1.02×102\n2.16×101\n8.53×101\n9.39×101\n8.33×101\n3.97×101\n2.95×101\n1.04×102\n3.06×101\n2.87×101\n4.83×101\n5.01×101\n1.62×102\n3.56×101\n3.66×101\n6.74×101\n2.72×101\n5.93×101\n3.58×101\n8.82×101\n3.51×101\n5.45×101\n8.28×101\n6.74×101\n1.24×101\n3.38×101\n3.27×101\n5.37×101\n5.66×101\n3.01×101\n1.68×101\n1.01×101\n2.70×101\n3.50×101\n3.03×101\n5.12×101\n1.95×101\n4.69×101\n4.91×101\n2.83×101\n\n7.90×101\n5.66×101\n1.23×102\n6.71×101\n9.19×101\n9.64×101\n4.55×101\n7.68×101\n3.47×101\n8.06×101\n5.34×101\n7.45×101\n1.06×102\n1.12×102\n4.13×101\n6.13×101\n6.97×101\n2.99×101\n7.97×101\n7.01×101\n1.17×101\n3.48×101\n1.46×102\n3.51×101\n7.44×101\n5.08×101\n2.26×101\n4.51×101\n5.32×101\n1.02×102\n2.16×101\n8.53×101\n9.39×101\n8.33×101\n3.97×101\n2.95×101\n1.04×102\n3.06×101\n2.87×101\n4.83×101\n5.01×101\n1.62×102\n3.56×101\n3.66×101\n6.74×101\n2.72×101\n5.93×101\n3.58×101\n8.82×101\n3.51×101\n5.45×101\n*****\n6.74×101\n1.24×101\n1.40×101\n3.27×101\n5.37×101\n5.66×101\n3.01×101\n1.68×101\n1.01×101\n2.70×101\n3.50×101\n3.03×101\n5.12×101\n1.95×101\n4.69×101\n4.91×101\n2.83×101\n\n7.34×103\n9.09×103\n5.85×103\n8.09×103\n5.37×103\n5.64×103\n1.00×104\n7.14×103\n1.09×104\n7.49×103\n8.57×103\n8.98×103\n4.17×103\n6.57×103\n9.08×103\n9.83×103\n8.41×103\n2.18×103\n7.40×103\n5.12×103\n3.65×103\n1.09×104\n4.02×103\n1.10×104\n6.91×103\n8.16×103\n2.10×103\n7.24×103\n6.42×103\n4.86×103\n1.01×104\n4.99×103\n4.47×103\n7.73×103\n8.73×103\n9.23×103\n4.94×103\n9.58×103\n8.98×103\n7.75×103\n6.04×103\n4.47×103\n7.84×103\n8.06×103\n6.26×103\n8.52×103\n5.51×103\n7.87×103\n4.19×103\n7.74×103\n5.06×103\n*****\n4.92×103\n1.59×104\n3.08×103\n7.19×103\n6.48×103\n6.83×103\n6.63×103\n1.25×104\n1.30×104\n8.46×103\n7.70×103\n6.68×103\n6.17×103\n9.10×103\n5.66×103\n5.92×103\n8.87×103\n\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\n\n6334(6334c)\n6334(6334a)(6334b)\n6334(6334b)\n6334(6334b)\n6334(6334b)\n6334(6334b)\n6334(6334b)\n6334(6334c)\n6334(6334a)(6334b)\n6334(6334c)\n6334(6334b)\n6334(6334b)\n6334(6334c)\n6334(6334b)\n6334(6334b)\n6334(6334c)\n6334(6334c)\n6334(6334b)\n6334(6334c)\n6334(6334c)\n6334(6334a)(6334b)\n6334(6334b)\n6334(6334b)\n6334(6334c)\n6334(6334c)\n6334(6334c)\n6334(6334a)(6334b)\n6334(6334c)\n6334(6334c)\n6334(6334c)\n6334(6334a)(6334b)\n6334(6334c)\n6334(6334c)\n6334(6334b)\n6334(6334b)\n6334(6334b)\n6334(6334c)\n6334(6334c)\n6334(6334b)\n6334(6334c)\n6334(6334c)\n6334(6334b)\n6334(6334c)\n6334(6334a)(6334b)\n6334(6334c)\n6334(6334b)\n6334(6334a)(6334b)\n6334(6334a)(6334b)\n6334(6334c)\n6334(6334c)\n6334(6334c)\n6334(6334a)(6334b)\n6334(6334b)\n6334(6334c)\n6334(6334a)(6334b)\n6334(6334c)\n6334(6334c)\n6334(6334b)\n6334(6334c)\n6334(6334b)\n6334(6334a)(6334b)\n6334(6334b)\n6334(6334b)\n6334(6334b)\n6334(6334c)\n6334(6334b)\n6334(6334c)\n6334(6334b)\n6334(6334a)(6334b)\n\n\f16\n\nMuñoz et al.\nTABLE 4\nClump Properties in NGC 6334\n\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\ncl\n\n241\n242\n243\n245\n246\n247\n249\n251\n252\n253\n256\n259\n260\n261\n262\n264\n266\n268\n271\n273\n276\n279\n282\n284\n286\n287\n290\n292\n293\n294\n295\n300\n303\n307\n308\n309\n311\n318\n319\n326\n329\n336\n337\n340\n342\n343\n344\n\n17h 22m 7.6s\n17h 18m 17.6s\n17h 19m 56.7s\n17h 20m 19.7s\n17h 19m 51.4s\n17h 17m 32.8s\n17h 22m 19.3s\n17h 23m 36.5s\n17h 19m 40.2s\n17h 20m 50.1s\n17h 20m 53.4s\n17h 21m 6.1s\n17h 18m 9.4s\n17h 21m 17.7s\n17h 20m 35.6s\n17h 19m 33.5s\n17h 22m 2.1s\n17h 21m 12.7s\n17h 22m 25.1s\n17h 21m 25.8s\n17h 16m 57.0s\n17h 20m 5.3s\n17h 20m 12.6s\n17h 22m 22.1s\n17h 19m 42.9s\n17h 23m 37.8s\n17h 20m 7.3s\n17h 23m 48.8s\n17h 22m 13.1s\n17h 23m 9.7s\n17h 22m 17.3s\n17h 17m 44.2s\n17h 17m 48.2s\n17h 23m 3.4s\n17h 23m 5.8s\n17h 18m 16.1s\n17h 22m 35.2s\n17h 17m 15.8s\n17h 16m 58.0s\n17h 21m 34.5s\n17h 20m 24.2s\n17h 19m 42.8s\n17h 19m 42.8s\n17h 20m 8.6s\n17h 21m 25.9s\n17h 22m 20.4s\n17h 20m 25.0s\n\n-35◦ 25'29.6\"\n-36◦ 9'47.2\"\n-35◦ 53'42.0\"\n-35◦ 48'54.0\"\n-36◦ 2'30.1\"\n-36◦ 26' 8.5\"\n-35◦ 21'20.9\"\n-34◦ 51'45.4\"\n-36◦ 3' 9.7\"\n-35◦ 56'37.3\"\n-36◦ 1'57.4\"\n-35◦ 23'33.0\"\n-36◦ 20'19.0\"\n-35◦ 51'56.5\"\n-36◦ 3' 1.8\"\n-36◦ 24'37.8\"\n-35◦ 13' 5.9\"\n-35◦ 30'36.7\"\n-35◦ 16'56.3\"\n-35◦ 31'32.2\"\n-36◦ 25'25.3\"\n-36◦ 27'10.1\"\n-36◦ 7' 1.9\"\n-35◦ 27' 4.7\"\n-35◦ 59'49.9\"\n-34◦ 52'57.4\"\n-36◦ 7'34.0\"\n-34◦ 52'16.0\"\n-35◦ 35' 5.3\"\n-34◦ 49'32.2\"\n-35◦ 19'53.0\"\n-36◦ 22'33.2\"\n-36◦ 22'17.4\"\n-35◦ 12'21.2\"\n-35◦ 5'33.0\"\n-36◦ 18'35.3\"\n-35◦ 28'55.6\"\n-35◦ 59'51.0\"\n-36◦ 17'49.6\"\n-35◦ 37'39.7\"\n-35◦ 29'25.8\"\n-36◦ 3' 1.8\"\n-36◦ 23'25.8\"\n-36◦ 6'38.2\"\n-35◦ 32'36.2\"\n-35◦ 35'12.8\"\n-35◦ 41'10.0\"\n\n0.14\n0.14\n0.14\n0.14\n0.14\n0.13\n0.13\n0.13\n0.13\n0.13\n0.13\n0.13\n0.13\n0.13\n0.13\n0.12\n0.12\n0.12\n0.12\n0.12\n0.12\n0.12\n0.11\n0.11\n0.11\n0.11\n0.11\n0.11\n0.11\n0.11\n0.11\n0.11\n0.11\n0.11\n0.11\n0.11\n0.11\n0.10\n0.10\n0.10\n0.10\n0.10\n0.10\n0.10\n0.10\n0.10\n0.10\n\n0.41\n0.34\n0.41\n0.49\n0.62\n0.66\n1.42\n0.32\n0.39\n0.43\n0.45\n0.09\n0.72\n0.38\n0.19\n0.21\n0.34\n0.78\n0.79\n0.59\n0.38\n0.22\n0.17\n0.73\n0.44\n0.27\n0.18\n0.42\n0.14\n0.51\n1.43\n0.19\n0.24\n0.14\n0.36\n0.88\n0.21\n0.06\n0.87\n0.12\n0.17\n0.28\n0.29\n0.13\n0.17\n0.20\n0.21\n\n0.24\n0.21\n0.24\n0.27\n0.30\n0.30\n0.45\n0.21\n0.24\n0.24\n0.27\n0.12\n0.33\n0.24\n0.18\n0.18\n0.24\n0.36\n0.36\n0.30\n0.24\n0.18\n0.15\n0.36\n0.27\n0.21\n0.18\n0.24\n0.15\n0.27\n0.47\n0.18\n0.21\n0.15\n0.24\n0.39\n0.18\n0.09\n0.36\n0.15\n0.18\n0.21\n0.21\n0.15\n0.15\n0.18\n0.18\n\n2.52×101\n2.12×101\n2.53×101\n3.03×101\n3.80×101\n4.05×101\n8.76×101\n2.00×101\n2.38×101\n2.64×101\n2.80×101\n5.56\n4.43×101\n2.33×101\n1.19×101\n1.28×101\n2.13×101\n4.83×101\n4.90×101\n3.66×101\n2.37×101\n1.36×101\n1.06×101\n4.51×101\n2.74×101\n1.67×101\n1.14×101\n2.58×101\n8.40\n3.14×101\n8.86×101\n1.20×101\n1.49×101\n8.71\n2.24×101\n5.42×101\n1.28×101\n3.95\n5.36×101\n7.16\n1.06×101\n1.73×101\n1.80×101\n8.21\n1.05×101\n1.27×101\n1.28×101\n\n2.52×101\n2.12×101\n2.53×101\n1.25×101\n3.80×101\n4.05×101\n8.76×101\n2.00×101\n2.38×101\n2.64×101\n2.80×101\n5.56\n4.43×101\n2.33×101\n1.19×101\n1.28×101\n2.13×101\n4.83×101\n4.90×101\n3.66×101\n2.37×101\n1.36×101\n1.06×101\n4.51×101\n2.74×101\n1.67×101\n1.14×101\n2.58×101\n8.40\n3.14×101\n8.86×101\n1.20×101\n1.49×101\n8.71\n2.24×101\n5.42×101\n1.28×101\n3.95\n5.36×101\n7.16\n1.06×101\n1.73×101\n1.80×101\n8.21\n1.05×101\n1.27×101\n1.28×101\n\n7.90×103\n9.94×103\n7.94×103\n2.75×103\n6.11×103\n6.49×103\n4.17×103\n9.36×103\n7.45×103\n8.27×103\n6.16×103\n1.39×104\n5.34×103\n7.30×103\n8.81×103\n9.50×103\n6.68×103\n4.49×103\n4.55×103\n5.88×103\n7.41×103\n1.01×104\n1.36×104\n4.19×103\n6.02×103\n7.80×103\n8.44×103\n8.09×103\n1.08×104\n6.92×103\n3.47×103\n8.90×103\n6.99×103\n1.12×104\n7.01×103\n3.96×103\n9.50×103\n2.35×104\n4.98×103\n9.20×103\n7.89×103\n8.09×103\n8.41×103\n1.05×104\n1.35×104\n9.41×103\n9.54×103\n\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\nNGC\n\n6334(6334b)\n6334(6334c)\n6334(6334a)(6334b)\n6334(6334a)(6334b)\n6334(6334b)\n6334(6334c)\n6334(6334b)\n6334(6334c)\n6334(6334b)\n6334(6334b)\n6334(6334c)\n6334(6334c)\n6334(6334c)\n6334(6334b)\n6334(6334b)\n6334(6334c)\n6334(6334c)\n6334(6334b)\n6334(6334c)\n6334(6334b)\n6334(6334c)\n6334(6334c)\n6334(6334b)\n6334(6334b)\n6334(6334b)\n6334(6334c)\n6334(6334b)\n6334(6334c)\n6334(6334b)\n6334(6334c)\n6334(6334b)\n6334(6334c)\n6334(6334c)\n6334(6334c)\n6334(6334c)\n6334(6334c)\n6334(6334b)\n6334(6334c)\n6334(6334c)\n6334(6334b)\n6334(6334c)\n6334(6334b)\n6334(6334c)\n6334(6334b)\n6334(6334b)\n6334(6334b)\n6334(6334b)\n\nNote. - The clump numbers highlighted in the first column are those which are considered to be significantly warmer. Clump 210 has an\nundetermined mass after subtracting the free-free emission at 1.2 mm\na M\n1.2mm is the computed clump mass from all the emssion at 1.2 mm and assuming a temperature of 17 K, while M considers the twotemperature clump ensemble and the correction by free-free emission.\nb The average number density was computed using R\neff and M and assuming spherical clumps with a mean molecular weight of μ = 2.3.\n\n\f"}