{"id": "http://arxiv.org/abs/1203.1234v1", "guidislink": true, "updated": "2012-03-06T15:52:36Z", "updated_parsed": [2012, 3, 6, 15, 52, 36, 1, 66, 0], "published": "2012-03-06T15:52:36Z", "published_parsed": [2012, 3, 6, 15, 52, 36, 1, 66, 0], "title": "Discrete modelling of capillary mechanisms in multi-phase granular media", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1203.4444%2C1203.1014%2C1203.1519%2C1203.1118%2C1203.6161%2C1203.3222%2C1203.4506%2C1203.3728%2C1203.5034%2C1203.5369%2C1203.1472%2C1203.1407%2C1203.1729%2C1203.4637%2C1203.5758%2C1203.5119%2C1203.4554%2C1203.5658%2C1203.2239%2C1203.0755%2C1203.3598%2C1203.4966%2C1203.2165%2C1203.1129%2C1203.6041%2C1203.3920%2C1203.3808%2C1203.5347%2C1203.1518%2C1203.4932%2C1203.3675%2C1203.6034%2C1203.1576%2C1203.4016%2C1203.4420%2C1203.0152%2C1203.6589%2C1203.5639%2C1203.1349%2C1203.1117%2C1203.3422%2C1203.6366%2C1203.4801%2C1203.1819%2C1203.3953%2C1203.1381%2C1203.4344%2C1203.4691%2C1203.5644%2C1203.6387%2C1203.6555%2C1203.5044%2C1203.1701%2C1203.2441%2C1203.5916%2C1203.3443%2C1203.2968%2C1203.1747%2C1203.3991%2C1203.3427%2C1203.4760%2C1203.4001%2C1203.4840%2C1203.1121%2C1203.1867%2C1203.2808%2C1203.5802%2C1203.6239%2C1203.0473%2C1203.3276%2C1203.2855%2C1203.0802%2C1203.4214%2C1203.6115%2C1203.1234%2C1203.3350%2C1203.1817%2C1203.4561%2C1203.0132%2C1203.2184%2C1203.2997%2C1203.3481%2C1203.2313%2C1203.1539%2C1203.2760%2C1203.4987%2C1203.2703%2C1203.3246%2C1203.5195%2C1203.4639%2C1203.1485%2C1203.6139%2C1203.2341%2C1203.4136%2C1203.0233%2C1203.3495%2C1203.1690%2C1203.3199%2C1203.1615%2C1203.4511%2C1203.1902&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Discrete modelling of capillary mechanisms in multi-phase granular media"}, "summary": "A numerical study of multi-phase granular materials based upon\nmicro-mechanical modelling is proposed. Discrete element simulations are used\nto investigate capillary induced effects on the friction properties of a\ngranular assembly in the pendular regime. Capillary forces are described at the\nlocal scale through the Young-Laplace equation and are superimposed to the\nstandard dry particle interaction usually well simulated through an\nelastic-plastic relationship. Both effects of the pressure difference between\nliquid and gas phases and of the surface tension at the interface are\nintegrated into the interaction model. Hydraulic hysteresis is accounted for\nbased on the possible mechanism of formation and breakage of capillary menisci\nat contacts. In order to upscale the interparticular model, triaxial loading\npaths are simulated on a granular assembly and the results interpreted through\nthe Mohr-Coulomb criterion. The micro-mechanical approach is validated with a\ncapillary cohesion induced at the macroscopic scale. It is shown that\ninterparticular menisci contribute to the soil resistance by increasing normal\nforces at contacts. In addition, more than the capillary pressure level or the\ndegree of saturation, our findings highlight the importance of the density\nnumber of liquid bonds on the overall behaviour of the material.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1203.4444%2C1203.1014%2C1203.1519%2C1203.1118%2C1203.6161%2C1203.3222%2C1203.4506%2C1203.3728%2C1203.5034%2C1203.5369%2C1203.1472%2C1203.1407%2C1203.1729%2C1203.4637%2C1203.5758%2C1203.5119%2C1203.4554%2C1203.5658%2C1203.2239%2C1203.0755%2C1203.3598%2C1203.4966%2C1203.2165%2C1203.1129%2C1203.6041%2C1203.3920%2C1203.3808%2C1203.5347%2C1203.1518%2C1203.4932%2C1203.3675%2C1203.6034%2C1203.1576%2C1203.4016%2C1203.4420%2C1203.0152%2C1203.6589%2C1203.5639%2C1203.1349%2C1203.1117%2C1203.3422%2C1203.6366%2C1203.4801%2C1203.1819%2C1203.3953%2C1203.1381%2C1203.4344%2C1203.4691%2C1203.5644%2C1203.6387%2C1203.6555%2C1203.5044%2C1203.1701%2C1203.2441%2C1203.5916%2C1203.3443%2C1203.2968%2C1203.1747%2C1203.3991%2C1203.3427%2C1203.4760%2C1203.4001%2C1203.4840%2C1203.1121%2C1203.1867%2C1203.2808%2C1203.5802%2C1203.6239%2C1203.0473%2C1203.3276%2C1203.2855%2C1203.0802%2C1203.4214%2C1203.6115%2C1203.1234%2C1203.3350%2C1203.1817%2C1203.4561%2C1203.0132%2C1203.2184%2C1203.2997%2C1203.3481%2C1203.2313%2C1203.1539%2C1203.2760%2C1203.4987%2C1203.2703%2C1203.3246%2C1203.5195%2C1203.4639%2C1203.1485%2C1203.6139%2C1203.2341%2C1203.4136%2C1203.0233%2C1203.3495%2C1203.1690%2C1203.3199%2C1203.1615%2C1203.4511%2C1203.1902&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A numerical study of multi-phase granular materials based upon\nmicro-mechanical modelling is proposed. Discrete element simulations are used\nto investigate capillary induced effects on the friction properties of a\ngranular assembly in the pendular regime. Capillary forces are described at the\nlocal scale through the Young-Laplace equation and are superimposed to the\nstandard dry particle interaction usually well simulated through an\nelastic-plastic relationship. Both effects of the pressure difference between\nliquid and gas phases and of the surface tension at the interface are\nintegrated into the interaction model. Hydraulic hysteresis is accounted for\nbased on the possible mechanism of formation and breakage of capillary menisci\nat contacts. In order to upscale the interparticular model, triaxial loading\npaths are simulated on a granular assembly and the results interpreted through\nthe Mohr-Coulomb criterion. The micro-mechanical approach is validated with a\ncapillary cohesion induced at the macroscopic scale. It is shown that\ninterparticular menisci contribute to the soil resistance by increasing normal\nforces at contacts. In addition, more than the capillary pressure level or the\ndegree of saturation, our findings highlight the importance of the density\nnumber of liquid bonds on the overall behaviour of the material."}, "authors": ["L. Scholtès", "B. Chareyre F. Nicot", "F. Darve"], "author_detail": {"name": "F. Darve"}, "author": "F. Darve", "links": [{"title": "doi", "href": "http://dx.doi.org/10.3970/cmes.2009.052.297", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1203.1234v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1203.1234v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1203.1234v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1203.1234v1", "arxiv_comment": null, "journal_reference": "Computer Modeling in Engineering & Sciences, number 52, volume 3,\n  pp 297-318, 2009", "doi": "10.3970/cmes.2009.052.297", "fulltext": "arXiv:1203.1234v1 [cond-mat.mtrl-sci] 6 Mar 2012\n\nCopyright © 2009 Tech Science Press\n\nCMES, vol.1, no.1, pp.1-22, 2009\n\nDiscrete modelling of capillary mechanisms in multi-phase\ngranular media\nL. Scholtès1 , B. Chareyre2 F. Nicot3 and F. Darve4\n\nAbstract: A numerical study of multi-phase granular materials based upon micromechanical modelling is proposed. Discrete element simulations are used to investigate capillary induced effects on the friction properties of a granular assembly in\nthe pendular regime. Capillary forces are described at the local scale through the\nYoung-Laplace equation and are superimposed to the standard dry particle interaction usually well simulated through an elastic-plastic relationship. Both effects\nof the pressure difference between liquid and gas phases and of the surface tension at the interface are integrated into the interaction model. Hydraulic hysteresis\nis accounted for based on the possible mechanism of formation and breakage of\ncapillary menisci at contacts. In order to upscale the interparticular model, triaxial loading paths are simulated on a granular assembly and the results interpreted\nthrough the Mohr-Coulomb criterion. The micro-mechanical approach is validated\nwith a capillary cohesion induced at the macroscopic scale. It is shown that interparticular menisci contribute to the soil resistance by increasing normal forces at\ncontacts. In addition, more than the capillary pressure level or the degree of saturation, our findings highlight the importance of the density number of liquid bonds\non the overall behaviour of the material.\nKeywords: Discrete Element Method, micromechanics, capillarity, multi-phase\nmaterials.\n1\n\nIntroduction\n\nAn outstanding feature of granular materials lies in the existence of different scales\nof interest. First, the microscopic scale corresponding to the scale of individual\nparticles can be considered. The microscopic scale is intimately related to the interaction processes that occur between adjoining particles. Second, a mesoscopic\n1 CSIRO\n\nEarth Science & Resource Engineering - QCAT, Brisbane, Australia.\nSols, Solides, Structures - Risques, Grenoble, France.\n3 Cemagref - Unité de recherche Erosion Torrentielle Neige et Avalanches, Grenoble, France.\n4 Laboratoire Sols, Solides, Structures - Risques, Grenoble, France.\n2 Laboratoire\n\n\f2\n\nCopyright © 2009 Tech Science Press\n\nCMES, vol.1, no.1, pp.1-22, 2009\n\nscale can be identified, associated to a set of a few particles. The mesoscopic scale\nis relevant to describe local kinematics (Cambou, Chaze, and Dedecker (2000)), or\nto address the creation and deletion of force chains amongst several elements (Radjaï, Roux, and Moreau (1999)). Third, the macroscopic scale which is the scale of\nthe specimen, generally denoted as the material scale.\nAs a matter of fact, the overall mechanical behaviour of granular materials is intimately related to the local properties that take place at the microscopic scale. In\naddition to dry contact interactions, the presence of a surrounding liquid can modify local deformation, attrition, and sliding between particles. The material is thus\na tri-phasic medium where the skeleton, liquid and air interact depending on the\nthermodynamic equilibrium. According to the liquid content and to the void ratio of the medium, different saturation regimes can be observed. For small liquid\ncontents, as long as the liquid tends to be concentrated as independent menisci\nbetween adjoining particles, this is the pendular regime. For increasing liquid content, menisci begin to merge. From this point, all liquid-gas configurations until\nthe gaseous phase consists in gas bubbles within the liquid are classified as funicular configurations. Beyond, the medium is in a capillary state until it tends toward\na fully saturated regime. For each case, the presence of both liquid and gas induces attractive forces that confer specific constitutive properties to the material.\nHowever, even though interparticular menisci have been dealt with a great attention in the pendular regime (Hotta, Takeda, and Ionya (1974); Lian, Thornton, and\nAdams (1993); Soulié, Cherblanc, Youssoufi, and Saix (2006)), their modelling for\nhigher saturation regimes is still a great challenge to deal with due to complex thermodynamic arrangements between the three phases (Urso, Lawrence, and Adams\n(1999); Murase, Mochida, and Sugama (2004)). The present paper focuses on liquid bridges as defined in the pendular state as an attempt toward the understanding\nof induced complex macroscopic behaviours. The analysis is therefore limited to\nlow saturation degrees where the pendular assumption can be assumed.\nAssessing the constitutive behaviour of such multi-phasic materials at the macroscopic scale can be addressed through sophisticated phenomenological constitutive\nmodels, requiring specific assumptions and mathematical refinements (see Cambou (1998) for a general review). This line of thinking has prevailed during the\npast decades. A powerful alternative concerns the micromechanical approaches,\nin which the description of physical phenomena is dealt with at the microscopic\nscale. The overall behaviour is therefore derived thanks to homogeneous schemes,\nrelating both microscopic and macroscopic scales as presented in Christoffersen,\nMehrabadi, and Nemat-Nasser (1981); Cambou (1998); Kruyt and Rothenburg\n(2000); Nicot and Darve (2005) or Lu and Likos (2006) for example. Such methods are appealing since the local physics can be described by simple equations,\n\n\fManuscript Preparation for CMES\n\n3\n\nrequiring a small number of parameters with generally a clear physical meaning.\nFollowing a micromechanical approach, discrete element methods (DEM) constitute a particularly relevant computational tool to track the constitutive response of\ngranular masses along a variety of loading paths. Indeed, the rheological behaviour\nis obtained without any global hypotheses. Since the pioneering work of Cundall\nand Strack (1979), DEM approach has been popularized in the field of granular\nmaterials, and extension to multi-physical coupling issues is an emergent line of\nresearch. For example, hydro-mechanical modelling supports now a great source\nof efforts, both for unsaturated (Richefeu, Youssoufi, Peyrous, and Radjaï (2007);\nShamy and Gröger (2008); Scholtès, Chareyre, Nicot, and Darve (2009)) and saturated flows (Han, Feng, and Owen (2007); Zeghal and Shamy (2008)). This paper is\nsituated in this context, by showing how the local parameters characterizing wetted\ncontact interactions within a granular medium can influence the overall response of\nthe material. In the following, the numerical specimen is assumed to be homogeneous and constituted by a sufficient number of grains so as a constitutive relation\ncan be derived from both homogeneous strain and stress tensors: the specimen is\nconsidered as a Representative Volume Element (RVE) of a granular medium\n2\n\nMicromechanical model\n\nDEM has been extensively used to study soil mechanics providing, for instance,\nsome insights into shear strength and deformation properties of granular soils (see\nIwashita and Oda (1988) and Ting, Corkum, Kauffman, and Greco (1989) for example). Recently, DEM has been enhanced to investigate unsaturated granulates\nfeatures by considering the possible effects of capillary water between grains (Gili\nand Alonzo (2002); Jiang, Leroueil, and Konrad (2004); Richefeu, Youssoufi, and\nRadjaï (2006); Shamy and Gröger (2008); Scholtès, Chareyre, Nicot, and Darve\n(2009)). The DEM is essentially a Lagrangian (mesh-free) technique where each\nparticle of the material is a sphere identified by its own mass, radius and moment\nof inertia. For every time step of the computation, interaction forces between particles, and consequently resulting forces acting on each of them, are deduced from\nsphere positions through the interaction law. Newton's second law is then integrated through an explicit second-order finite difference scheme to compute new\nspheres' positions.\nWe present here a 3D discrete element model developed into the YADE-Open DEM\nplatform (Kozicki and Donzé (2008)), where effects of capillarity have been implemented in both terms of force and water retention through the resolution of the\nYoung-Laplace equation as presented hereafter. In the proposed model, each interaction can thus be described as the sum of a dry contact repulsive force and of\nan attractive capillary force resulting from the presence of liquid bridges between\n\n\f4\n\nCopyright © 2009 Tech Science Press\n\nCMES, vol.1, no.1, pp.1-22, 2009\n\nFigure 1: Contact interaction: (a) model and (b) overlap.\n\nFigure 2: Contact friction law: (a) normal force and (b) tangential force.\n\ngrains.\n2.1\n\nContact friction model\n\nThe elastic-plastic model for contact friction is presented in Fig. 1(a). Although the\nformulation is quite simplistic compared to more realistic Hertz-Mindlin solutions,\nit has been proved to give accurate results (DiRenzo and DiMaio (2004)), with a\nsignificant computational efficiency.\nParticles are considered to be rigid, but can overlap as shown in Fig. 1(b). This\noverlap accounts for the deformation induced by contacts forces. A linear elastic\nlaw provides the contact force as a function of the relative displacement between\ntwo interacting grains (see Fig. 2). A normal stiffness Kn is defined to relate the\nnormal force Fn to the intergranular normal distance Un such as:\n\u001a\nKnUn , if Un 6 0\nFn =\n(1)\n0, if Un > 0\nand a tangential stiffness Kt allows to deduce the shear force Ft induced by the\n\n\fManuscript Preparation for CMES\n\n5\n\nFigure 3: Illustration of a liquid bridge between two particles of unequal sizes: (a)\nglobal geometry, (b) details of the bridge.\n\nincremental tangential relative displacement dUt :\ndFt = −Kt dUt\n\n(2)\n\nKn and Kt are dependent functions of the interacting particle radii R1 and R2 and of\na characteristic modulus E of the material such as:\n(\nE.R1.R2\nKn = 2. (R1+R2)\n(3)\nKt = α.Kn\nwith α a fixed parameter. This definition results in a constant ratio between E and\nthe effective bulk modulus of the packing, whatever the size of the particles.\nShear and normal forces are finally related by a slip Coulomb model such that\nFtmax = −μFn , where μ is the contact friction coefficient defined as μ = tan(φc ),\nwith φc the intergranular friction angle.\n2.2\n\nCapillary model\n\nFor simplicity, we assume that capillary water inside the sample is solely composed\nof interparticular independent menisci as defined in the pendular state (Fig. 3).\nTheir exact shape between spherical bodies is defined by the Young-Laplace equation, which relates the pressure difference ∆u = ug − ul across the gas-liquid interface to the radius of curvature C of the bridge surface and to the surface tension γ\nof the liquid phase:\n∆u =\n\nγ\nC\n\n(4)\n\n\f6\n\nCopyright © 2009 Tech Science Press\n\nCMES, vol.1, no.1, pp.1-22, 2009\n\nIn the Cartesian coordinates of Fig. 3, C can be formulated as a function of the\nprofile y(x) of the liquid-gas interface curve, the x axis coinciding with the axis of\nsymmetry of the bridge, passing through the centers of the bonded spheres. Following the Young-Laplace equation (Eq. 4), the profile of the liquid bridge is thus\nrelated to the capillary pressure ∆u through the following non-linear differential\nequation:\n∆u\n1 + y02 (x)\n(1 + y02 (x))3/2 +\n− y00 (x) = 0\nγ\ny(x)\n\n(5)\n\nAccording to a recent study by Soulié, Cherblanc, Youssoufi, and Saix (2006),\nthe corresponding meniscus volume Vm and intergranular distance Un can be obtained by considering the x-coordinates (xc1 and xc2 ) of the three-phases contact\nlines defining the solid-liquid-gas interface such as:\nVm = π\n\nR xc2 2\n1\n3\n2\nxc1 y (x)dx − 3 πR1 (1 − acos(xc1 )) (2 + acos(xc1 ))\n\n− 13 πR32 (1 − acos(xc2 ))2 (2 + acos(xc2 ))\n\n(6)\n\nand\nUn = R2 (1 − acos(xc2 )) + xc2 + R1 (1 − acos(xc1 )) − xc1\n\n(7)\n\nThe capillary force due to the liquid bridge can then be calculated at the profile\napex y0 according to the 'gorge method' (Hotta, Takeda, and Ionya (1974)) and\nconsists of a contribution of both ∆u and γ:\nFcap = 2πy0 γ + πy20 ∆u\n\n(8)\n\nThe relation between the capillary pressure and the configuration of the capillary\ndoublet is thus described by a system of non-linear coupled equations (Eq. 5, Eq. 6,\nEq. 7, Eq. 8) where local geometry (Un ) and meniscus volume (Vm ) arise as a result\nof the solved system.\nIn order to account for capillarity in the YADE-Open DEM code, an interpolation scheme on a set of discrete solutions of the Young-Laplace equation has been\ndeveloped so as to link directly ∆u to Fcap and Vm for a given grain-pair configuration (R1 , R2 , Un ). This numerical procedure results in a suction-controlled model\nwhere, at every time-step during the simulation, capillary forces and water volumes\nare computed based upon the local geometry and the imposed capillary pressure.\nFig. 4 presents the evolution of the capillary force with the relative displacement\nbetween two interacting grains.\nIt is to be noted that capillary forces act exclusively in the axial direction of the\ninteraction (the normal to the tangential contact plane), and that Fcap is maximum\n\n\fManuscript Preparation for CMES\n\n7\n\nFigure 4: Evolution of the capillary force with the relative displacement between\ninteracting grains for a given capilary pressure ∆u: a meniscus can form for Un ≤\nUcreation and breaks for Un > Urupture .\n\nfor grains in contact (Un 6 0). Urupture is the debonding distance corresponding to\nthe minimum Un value from which the Young-Laplace equation has no solution.\nAn hydraulic hysteresis can be accounted for by defining Ucreation as the distance\nfrom which a liquid bridge can form between two interacting grains. For instance,\nas a drying scenario results in a desaturation of the material, liquid bridges can exist\nat stretched contacts as long as the debonding distance Un is less than the critical\nseparation distance Urupture (Fig. 5(a)). On the other hand, a wetting scenario only\nallows appearance of menisci between contacting or close grains (Fig. 5(b)) such\nas it would occur during a capillary condensation when the relative humidity of the\nsurrounding air is increased. The choice was made here to allow bridge appearance\nfor strict contact (Ucreation = 0), thus neglecting the possible effect of adsorbed\nwater. In the same way, once they break, menisci can reform when particles come\nstrictly in contact.\nFollowing these assumptions, wetting and drying scenarios can be taken into consideration for the initial state of the material, keeping in mind that, in our simulations, the contact angle θ (Fig. 3(b)) which defines the wetting of the material is\nset to 0◦ for simplicity, assuming a perfect wetting of the material and occulting\ntherefore its possible effect on local hysteresis mechanisms.\n2.3\n\nInterparticle behaviour\n\nThe interaction laws involve normal repulsion and Coulomb friction at contact as\nwell as capillary adhesion as presented respectively in Fig. 2 and Fig. 4.\n\n\f8\n\nCopyright © 2009 Tech Science Press\n\nCMES, vol.1, no.1, pp.1-22, 2009\n\nFigure 5: Hydraulic hysteresis history accounted for in the code: assembly of particles resulting from (a) a drying scenario, (b) a wetting scenario.\n\nCapillary forces are considered constant for the range of elastic contact deformation\n(Un 6 0), assuming a low deformability of particles during simulations. To pull two\nbonded spheres apart, an increasing external tensile force is needed. This force has\nto balanced the sum of the repulsive contact force Fn and the adhesive capillary\none Fcap which tends to decrease with the interparticle distance Un . The tensile\nprocess is stable as long as Un is less than the debonding distance Urupture which\nwill depend on both the doublet configuration (R1 , R2 ) and the capillary pressure\n∆u. As presented in Fig. 6, the particle size ratio r = RR21 has a great influence on\nboth the adhesive force and the liquid bridge volume. For instance, for a given ∆u\nvalue, the greater the ratio r is, the smaller the bridge volume Vm is, resulting in less\nsignificant interacting distances Urupture before rupture as well as in diminishing\nforce intensities.\nConcerning now the influence of the capillary pressure (Fig. 7), it has to be noted\nthat, for a given doublet configuration (r = 1), if higher values of ∆u result in\nsmaller liquid bridge volumes, capillary force intensity at contact (Un = 0) is quite\nconstant whatever ∆u. At the particle scale, capillary pressure, through its effect on\nmenisci volumes, finally influences more the debonding distance than the resulting\nadhesive force.\nTo sum up, in addition to the great influence of particle size distribution on their intensity level, capillary effects between interacting grains are strongly driven by the\namount of liquid involved in their behaviour. Such a complexity leads to numerous\nuncertainties when considering granular materials such as soils. The next section\nis therefore an attempt to provide some clarifications on capillarity consequences\nat the scale of a numerical granular assembly.\n\n\f9\n\nManuscript Preparation for CMES\n\nFigure 6: Effect of the particle size ratio r =\n∗ =\nforce Fcap\n\nFcap\n2πR2 γ\n\nof the separation\n\nR1\nR2\n\non (a) the normalized capillary\n\nand (b) the normalized meniscus volume Vm∗ =\n\ndistance Un∗\n\n=\n\nUn\nR2\n\nVm\nR32\n\nas a function\n\nfor ∆u = 1000 kPa.\n\nFigure 7: Effect of the capillary pressure ∆u on (a) the normalized capillary force\n∗ = Fcap and (b) the normalized meniscus volume V ∗ = Vm as a function of the\nFcap\nm\n2πR2 γ\nR3\nseparation distance Un∗ = UR2n for r =\n\nR1\nR2\n\n2\n\n= 1.\n\n\f10\n\nCopyright © 2009 Tech Science Press\n\nCMES, vol.1, no.1, pp.1-22, 2009\n\nTable 1: Input parameters\nGlobal Modulus\nE (MPa)\n50\n\nkt\nkn\n\nα\n0.5\n\nFriction angle\nφc (deg.)\n30\n\nFigure 8: The discrete element model.\n\n3\n\nMacroscopical behaviour\n\nIn order to investigate macroscopic consequences of interparticle capillary menisci,\nnumerical simulations were conducted on a polydisperse assembly composed of\n10,000 spheres (Fig. 8) with a uniform grain size distribution ranging from 0.035 mm\nto 0.07 mm. The specimen is contained inside a box made of six rigid frictionless\nboundary walls for which positions at each time steps are defined from the prescribed loading program. Tab. 1 provides a summary of the input parameters used\nin the simulations, referring to Eq. 1, Eq. 2 and Eq. 3.\nThe sample is prepared in a dry configuration by an isotropic-compaction technique\nwhich ensures the initial homogeneity of the packing (Scholtès, Chareyre, Nicot,\nand Darve (2009)). The final porosity of the sample depends on the intergranular\nfriction angle φc defined during the compaction stage. The smaller φc , the denser\nthe specimen. Here, φc was fixed to 1◦ , leading to a dense specimen with a porosity\nof about 0.39. φc was then set to 30◦ for all the simulations. Starting from the\nstabilized isotropic configuration, capillary pressure ∆u is then switched on, letting\nmenisci to be formed between all possible interacting grains following the chosen\ndrying or wetting scenario (stretched or contacting menisci respectively). It is to be\nnoted that the suction controlled scheme ensures menisci to be homogeneously dis-\n\n\fManuscript Preparation for CMES\n\n11\n\ntributed inside the medium in accordance the thermodynamic equilibrium between\nboth liquid and gas phases.\n3.1\n\nNumerical results\n\nSeveral loading paths were applied to the specimen in order to assess both its hydraulic and mechanical properties.\n3.1.1\n\nHydraulic properties\n\nDetermining hydraulic properties of unsaturated soils is of great interest because\nof the strong hydro-mechanical coupling consequences on the overall behaviour.\nHerein, the proposed model allows to determine the water content of an assembly\nas a result of the summation from all menisci volumes contained inside the medium.\nIndeed, the degree of saturation Sr of the numerical sample is obtained by:\nSr = 100 ∗\n\nNm\nVm\nVl\n∑m=1\n= 100 ∗\nVv\nVsample −Vgrains\n\n(9)\n\nwith Vl the total liquid volume and Vv the void volume resulting from the grains\narrangement inside the cubic box. Vv is equal to the difference between the total volume of the sample Vsample minus the volume occupied by all the grains g\nNg 4\n3\nforming the assembly (Vgrains = ∑g=1\n3 πRg ). By varying the capillary pressure ∆u\ninside a given sample, one can therefore construct its soil water characteristic curve\n(SWCC).\nHowever, due to the pendular assumption concerning liquid phase modelling (independent interparticular liquid bridges), the SWCC cannot be computed for high\ndegrees of saturation Sr. Indeed, below a given capillary pressure, liquid bridges\nbecome big enough to allow their overlap with neighbours. As this overlap leads\nto menisci fusion associated with a complete fluid reorganisation which makes obsolete the pendular assumption, a numerical procedure has been developed in order\nto identify menisci superpositions through the definition of their geometrical configuration. As defined in Fig. 3, the wetting of a liquid bridge over the grain surface\nis defined by its filling angles δ1 and δ2 . It is therefore possible to determine if,\nfor a given grain g of an assembly, neighbouring menisci meet through their wetted\nsurfaces.\nFor instance (see Fig. 9), if the angle O\\\ni Og O j formed between three interacting\ngrains g, i and j is smaller than the sum (δgi + δg j ) corresponding to the surface of\nthe grain wetted by menisci mg,i , and mg, j linking g with i and g with j respectively,\nan overlap occurs and fusion can therefore process. Obviously, the occurence of\nmenisci fusion strongly depends on the microstructural arrangement and on the\n\n\f12\n\nCopyright © 2009 Tech Science Press\n\nCMES, vol.1, no.1, pp.1-22, 2009\n\nFigure 9: illustration of the numerical procedure for menisci fusion: (a) definition\nof the local geometry, (b) identification of merged menisci: mg, j , mg,k and mg,l\noverlap on grain g surface.\n\nporosity of the medium. The range of saturation that corresponds to the pendular\nregime cannot therefore be infered for all materials and has to be checked for each\nparticular case.\nFig. 10 presents the SWCC obtained for the predefined numerical assembly in the\nrange of its pendular regime. For this particular case, our finding is that the independence of menisci is strictly ensured for Sr < 12 %, whereas overlappings are\nnegligible until Sr = 15 %.\nOne can note that, through the possible local mechanisms of formation and breakage of menisci, an hydraulic hysteresis arises at the macroscopic level, depending\non the wetting history of the material. This macroscopical hysteresis is directly\nlinked to the liquid bridge density inside the sample. Indeed, due to the possibility\nof stretched liquid bridges between separated grains for a drying scenario, menisci\nare numerous inside the medium and the corresponding degrees of saturation are\ntherefore larger for the simulated dried material than for the wetted one. Fig. 11\nillustrates this point through the evolution of the average number of liquid bridge\nper particle Km during both the two scenarios.\nIt is remarkable that both curves present two distinct stages:\n- For ∆u > 3 MPa, menisci distribution is driven by the particle gradation.\nMenisci progressively disappear with the increase in ∆u due to the persistence of capillary water between the smallest particles. For instance, this is\nthe reason why clay needs higher capillary pressures than sand to be fully\n\n\fManuscript Preparation for CMES\n\n13\n\nFigure 10: Soil Water Characteristic Curve generated with the proposed discrete\nelement model.\n\nFigure 11: Evolution of the average number of menisci per particle during both\nwetting and drying sequences.\n\n\f14\n\nCopyright © 2009 Tech Science Press\n\nCMES, vol.1, no.1, pp.1-22, 2009\n\nFigure 12: Simulation of drained triaxial compressions on the dry specimen under\n5, 10 and 20 kPa confining pressures.\n\ndesaturated.\n- For ∆u < 3 MPa, menisci distribution is driven by the capillary pressure according to the wetting history of the material. During the drying scenario,\nthe increase of ∆u induces smallest debonding distances (Fig. 7) and therefore less stretched bridges inside the sample. During the wetting scenario, as\nmenisci are only present at contacts, they keep constant in number whereas\ntheir respective volumes increase with the decrease of ∆u.\nAt the particle scale, the simulated hysteresis can be illustrated through Fig. 5 where\none can see that the darkest particle has more neighbours (Km = 5) after a drying\nsequence, than after a wetting one (Km = 2). This phenomenon, also denoted as the\nink-bottle effect, is probably the most significant hysteretic mechanisms involved in\nunsaturated soil mechanics. The consequences of this property on the mechanical\nbehaviour of granular assemblies is investigated in section 3.2.\n3.1.2\n\nStress-Strain response under triaxial loadings\n\nTo determine the effect of interparticular capillary menisci on the mechanical properties of a granular material, we performed a series of triaxial compression loadings\n(σ2 = σ3 , ε̇1 > 0) on the numerical assembly under 5, 10 and 20 kPa confining pressures.\nAs a reference, the response of the dry specimen is plotted in Fig. 12. The assembly\npresents a behaviour which is qualitatively close to that of a dense granular material\nwith strain softening associated with dilatancy. As shown in Fig. 13, the discrete\nelement model behaviour is well described through the Mohr-Coulomb criterion:\nτ = σ tan Φ + c\n\n(10)\n\n\f15\n\nManuscript Preparation for CMES\n\nFigure 13: Failure envelop for the dry sample.\n\nwith a null apparent cohesion c and an internal friction angle Φ of about 28◦ .\nIn order to cover the entire pendular regime, numerical unsaturated triaxial tests\nwere performed at different capillary pressures corresponding to degrees of saturation ranging from 0 to 10 % along the wetting path. Tab. 2 presents the correspondence between ∆u and initial values of Sr for the considered specimen.\nTable 2: Capillary pressures and corresponding initial degrees of saturation of the\ndiscrete element model\nCapillary pressure ∆u [kPa]\nDegree of saturation Sr [%]\n\n5000\n0.001\n\n3000\n0.01\n\n80\n1\n\n50\n2.5\n\n30\n5.5\n\n20\n10\n\nFig. 14 displays the responses of the unsaturated samples compared to the dry one\nfor triaxial compressions applied under a confining pressure of 10 kPa. For clarity\nreason, only four of the six tests are plotted. As expected, the shear strength is\ngreater for unsaturated materials and depends on the degree of saturation. The\nmore wetted the sample is, the higher the deviatoric strength is, with a trend for\ndilatancy more pronounced than in the dry case, suggesting a more interlocked\nstructure. To sum up all simulated tests, the corresponding failure envelops as well\nas the evolution of the apparent cohesion c with Sr are plotted in Fig. 15.\nAs a first observation, one can see that the internal friction angle Φ is independent\non the degree of saturation, whatever the water content level. This probably results from the assumption of null effect of capillarity on contact friction, but it is\nremarkable that such a local property arises at the scale of an assembly. Richefeu,\n\n\f16\n\nCopyright © 2009 Tech Science Press\n\nCMES, vol.1, no.1, pp.1-22, 2009\n\nFigure 14: Simulation of triaxial compressions at different capillary pressure levels\nunder a 10 kPa confining pressure.\n\nFigure 15: (a) Morh-Coulomb failure envelops and (b) apparent cohesion c as a\nfunction of the degree of saturation Sr.\n\n\f17\n\nManuscript Preparation for CMES\n\nFigure 16: Mean capillary force < Fcap > as a function of the degree of saturation\nSr.\n\nYoussoufi, and Radjaï (2006) came to the same conclusion from laboratory experiments on glass beads assemblies with pure water, providing therefore a good\nprediction to the idealized model. However, real granular materials such as soil\nwould certainly not highlight such an independence between local and global friction properties due to the complex combined effects of surface roughness and in\nsitu liquid wetting features.\nSecond, it is clear that the cohesion varies significantly from dry to unsaturated\nstates. c increases non-linearly till a maximum value for the higher degrees of\nsaturation that corresponds to the upper limit of the pendular state. This is fairly\ntypical based on synthesis of reported experimental data on sand (Lu, Bailin, and\nTan (2007)) or glass beads (Richefeu, Youssoufi, and Radjaï (2006)). Nevertheless,\nthis is quite remarkable in regards to the interparticle behaviour, since capillary\nforce intensity at contact is not such dependent on capillary pressure (Fig. 7). For\nNm\n\n∑\n\nFi\n\ninstance, computing the mean capillary force < Fcap >= i Nm cap in the specimen\nfor all tested degrees of saturation (Fig. 16) indicates that capillary forces tends to\nbe greater, on average, for higher capillary pressure levels (and therefore for smaller\nsaturation degrees).\nThis paradox is clearly due to capillary pressure influence on the debonding distance of menisci as presented in Fig. 7. Indeed, strong internal rearrangements\noccur during the loading, leading to a redistribution of the liquid inside the microstructure which is not obvious at the macroscopic scale. How this redistribution\noccurs and how it influences the shear strength of the material is strongly linked to\nthe elaborated properties of grains when they interact in an assembly. A micromechanical investigation is therefore needed in order to identify effects induced by\nstructural evolution of the medium on the liquid bridge distribution.\n\n\f18\n\nCopyright © 2009 Tech Science Press\n\nCMES, vol.1, no.1, pp.1-22, 2009\n\nFigure 17: (a) Evolution of the average number of menisci per particle Km during a\ntriaxial compression for several initial degree of saturation Sr, (b) Km values at the\nq-peak as a function of Sr.\n\n3.2\n\nMicroscopic analysis\n\nFig. 17(a) shows the evolution of the average number of menisci per particle Km\nfor different degrees of saturation during the unsaturated triaxial compressions presented before (Fig. 14).\nDue to particle rearrangements during the loading, liquid bridge distribution inside\nthe material changes with deformations, depending on the defined capillary pressure level. For instance, despite the fact that the initial liquid bridge densities are\nidentical for tests corresponding to degrees of saturation of 0.01, 2.5, 10 %, their\nevolutions during compression are totally different due to the local response of liquid bonds to loading. Typically, as a result of the local behaviour of menisci (see\nFig. 7), liquid bridges tend to persist more with the medium dilatancy for low values of ∆u (higher Sr), due to larger debonding distance Urupture . As discussed in\nScholtès, Chareyre, Nicot, and Darve (2009) as well as in Scholtès, Hicher, Nicot,\nChareyre, and Darve (2009), the microstructure strongly influences liquid distribution inside the medium. The initial bridge density number appears therefore not\nappropriate to accurately evaluate the shear strength of the material as it was suggested by Richefeu, Youssoufi, and Radjaï (2006), in the sense that failure does not\noccur for an isotropic configuration of the material, but after some deformations\nleading to significant changes inside the fabric due to the induced anisotropy. Cohesion, as well as the internal friction angle, is dependent on space direction, and\nhas to be evaluated at the yield state. Indeed, by plotting Km values corresponding\nto the q − peak (Fig. 17(b)), one can recover the shear strength hierarchy induced\nby capillarity depending on the degree of saturation.\n\n\f19\n\nManuscript Preparation for CMES\n\nFigure 18: (a) stress-strain relationships and (b) evolution of Km during a triaxial\ncompression on a sample subjected to a drying and a wetting scenario respectively\nunder the same capillary pressure ∆u=20 kPa.\n\nIt is important to note that, in the end, whatever the capillary pressure level or the\ndegree of saturation, the pertinent parameter which determines the shear strength of\na partially saturated granular material is the liquid bridge density inside the medium\nat the yield state. Obviously, the evolution of this density with deformations is\ntotally driven by the capillary pressure level, and, thereafter, by the water content.\nAnother way to illustrate the primacy of the liquid bridge density on shear strength\nproperties of a wet granular material is to compare its behaviour for both a drying\nand a wetting scenario. As suggested in section 3.1.1, a given sample can contain\ndifferent numbers of capillary bonds for a defined ∆u value (Fig. 11) due to the\npossible hydraulic hysteresis.\nFig. 18(a) presents the stress-strain relationships obtained for a numerical sample\nsubjected to a triaxial loading under the same capillary pressure (∆u = 20 kPa), but\nwith two different initial configurations resulting respectively from a drying and a\nwetting scenario. Due to numerous liquid bridges Fig. 18(b), the dried sample has\na greater shear strength (q peak =30 kpa) than the wetted one (q peak =27 kpa), which\nresults in respective cohesions of 5 and 6.5 kPa. It is remarkable that the ratio\ncDrying\n= 1.3 is strongly correlated to the ratio between the corresponding values\ncWetting\nof Km at the q − peak:\nKmq−peak\n\nKmDrying\nKmWetting\n\n=\n\n7.4\n5.5\n\n= 1.34, confirming here the possibility to link\n\nto the overall cohesion of the material.\n\nAnother remarkable feature of the coupled hydro-mechanical process is that internal rearrangements caused by the loading tend to conceal the initial difference\nbetween the two specimens, leading to a common residual state for large deformations with the same number of liquid bridges on average. This confirms the strong\ninfluence of the microstructure on the liquid phase distribution. For instance, if the\n\n\f20\n\nCopyright © 2009 Tech Science Press\n\nCMES, vol.1, no.1, pp.1-22, 2009\n\npresence of fluids inside a polyphasic granular material implies some consequences\non its overall behaviour, the coupling is also active in the other way. Microstructural rearrangements of the solid skeleton lead to strong modifications of the fluid\nphases and both aspects induce complex mechanisms at the macroscopic scale.\n\n4\n\nConclusion\n\nA micromechanical computational model for the analysis of wet granular soils in\nthe pendular regime has been proposed. Capillary mechanisms are described at the\ncontact scale based upon the capillary theory in both terms of interparticle adhesive force and water retention. Capillary menisci are distributed inside the medium\naccording to the thermodynamic equilibrium between liquid and gas phases. Moreover, an hydraulic hysteresis is accounted for based on the possible mechanisms of\nformation and breakage of liquid bridges during wetting and drying phases.\nTriaxial compression test simulations were performed on a granular assembly under several confining pressures for dry and partially saturated conditions in order to\nanalyze effects of local capillary menisci on macroscale cohesion and friction properties. The results confirm that capillary-induced attractive forces and hydraulic\nhysteresis play a significant role in the shear strength of granular materials. By\nincreasing normal forces at contact, capillary menisci contribute to the apparent\ncohesion of the material and enhances its stiffness. A remarkable aspect is that the\nshear strength of an assembly is basically controlled by the liquid bridge density\nand not by the capillary pressure level. A strong correlation is highlighted between\nthe average number of liquid bridges at the yield state and the induced cohesion.\nOn the other hand, the liquid bridge distribution inside the medium is controlled by\nthe capillary pressure which leads to counter-intuitive response at the scale of an\nassembly. In a separate way to capillary forces, Coulomb cohesion increases with\nwater content and tends to a maximum value for the upper limit of the pendular\nregime following the liquid bridge density. In additon, the results put in evidence\nthe effect of the skeleton induced anisotropy on liquid phase properties which is\ngenerally occulted when considering hydro-mechanical modelling. Solid fabric\nevolution clearly has a strong influence on the liquid distribution.\nThe proposed model is able to simulate the macroscopic response of wet granular materials and revealed a number of outstanding micromechanical mechanisms\nand response patterns consistent with experimental data. The multi-scale approach\npresented here appears to be a pertinent complementary tool for the study of unsaturated soil mechanics. A fundamental extension of this work would be to extend\nthe interaction model to higher degrees of saturation with, for example, a validation\nthrough tomographic imaging.\n\n\fManuscript Preparation for CMES\n\n21\n\nReferences\nCambou, B. (1998):\nMicromechanical approach in granular materials. Behaviour of granular materials, edited by B. Cambou, Springer Wien, New York, pp.\n170–216.\nCambou, B.; Chaze, M.; Dedecker, F. (2000):\nChange of scale in granular\nmaterials. Eur. J. Mech. A/Solids, vol. 19, pp. 999–1014.\nChristoffersen, J.; Mehrabadi, M.; Nemat-Nasser, S. (1981): A micromechanical description of granular material behaviour. J. Of Appl. Mech. Transactions of\nthe ASME, vol. 48, pp. 339–344.\nCundall, P.; Strack, O. (1979): A discrete numerical model for granular assemblies. Géotechnique, vol. 29, no. 1, pp. 47–65.\nDiRenzo, A.; DiMaio, F. (2004): Comparison of contact-force models for the\nsimulation of collisions in dem-based granular flow codes. Chemical Engineering\nScience, vol. 59, pp. 525–541.\nGili, J.; Alonzo, E. (2002): Microstructural deformation mechanisms pf unsaturated granular soils. Int. J. for Numer. and Anal. Meth. Geomech., vol. 26, no. 5,\npp. 433–468.\nHan, K.; Feng, Y.; Owen, D. (2007): Numerical simulations of irregular particle\ntransport in turbulent flows using coupled lbm-dem. Comp. Meth. in Eng. Sci., vol.\n18, no. 2, pp. 87–100.\nHotta, K.; Takeda, K.; Ionya, K. (1974): The capillary binding force of a liquid\nbridge. Powder Technology, vol. 10, pp. 231–242.\nIwashita, K.; Oda, M. (1988): Rolling resistance at contacts in simulation of\nshear band development by dem. J. of Eng. Mech., ASCE, vol. 124, no. 3, pp.\n285–292.\nJiang, M.; Leroueil, S.; Konrad, J. (2004): Insight into shear strength functions\nof unsaturated granulates by dem analyses. Computers and Geotechnics, vol. 31,\nno. 1, pp. 473–489.\nKozicki, J.; Donzé, F. (2008):\nA new open-source software using a discrete\nelement method to simulate granular material. Computer Meth. in Applied Mech.\nand Eng., vol. 197, pp. 4429–4443.\n\n\f22\n\nCopyright © 2009 Tech Science Press\n\nCMES, vol.1, no.1, pp.1-22, 2009\n\nKruyt, N.; Rothenburg, L. (2000): Micromechanical definition of the strain\ntensor for granular materials. J. Of Appl. Mech. Transactions of the ASME, vol.\n63, pp. 706–711.\nLian, G.; Thornton, C.; Adams, M. (1993): A theoretical study of the liquid\nbridge force between two spherical bodies. J. of Colloid and Interface Science,\nvol. 161, pp. 138–147.\nLu, N.; Bailin, W.; Tan, C. P. (2007): Tensile strength characteristics of unsaturated sands. Journal of Geotechnical and Geoenvironmental Egineering, vol. 133,\nno. 2, pp. 144–154.\nLu, N.; Likos, W. (2006): Suction stress characteristic curve for unsaturated soil.\nJournal of Geotechnical and Geoenvironmental Egineering, vol. 132, no. 2, pp.\n131–142.\nMurase, K.; Mochida, T.; Sugama, H. (2004): Experimental and numerical\nstudies on liquid bridge formed among three spheres. Granular Matter, vol. 6, pp.\n111–119.\nNicot, F.; Darve, F. (2005): A multi-scale approach to granular materials. Mechanics of Materials, vol. 37, no. 9, pp. 980–1006.\nRadjaï, F.; Roux, S.; Moreau, J. (1999): Contact forces in a granular packing.\nChaos, vol. 9, no. 3, pp. 544–550.\nRichefeu, V.; Youssoufi, M. E.; Peyrous, M.; Radjaï, F. (2007): A model of\ncapillary cohesion for numerical simulations of 3d polydisperse granular media.\nInt. J. for Numer. and Anal. Meth. in Geomech., vol. 32, no. 11, pp. 1365–1383.\nRichefeu, V.; Youssoufi, M. E.; Radjaï, F. (2006): Shear strength properties of\nwet granular materials. Physical Review E, vol. 73, no. 051304.\nScholtès, L.; Chareyre, B.; Nicot, F.; Darve, F. (2009): Micromechanics of\ngranular materials with capillary effects. Int. J. of Eng. Science, vol. 47, no. 1, pp.\n64–75.\nScholtès, L.; Hicher, P.-Y.; Nicot, F.; Chareyre, B.; Darve, F. (2009): On the\ncapillary stress tensor in wet granular materials. Int. J. for Numer. and Anal. Meth.\nin Geomech., vol. 33, no. 10, pp. 1289–1313.\nShamy, U. E.; Gröger, T. (2008): Micromechanical aspects of the shear strength\nof wet granular soils. Int. J. for Numer. and Anal. Meth. in Geomech., vol. 32, no.\n14, pp. 1763–1790.\n\n\fManuscript Preparation for CMES\n\n23\n\nSoulié, F.; Cherblanc, F.; Youssoufi, M. E.; Saix, C. (2006): Influence of liquid\nbridges on the mechanical behaviour of polydisperse granular materials. Int. J. for\nNumer. and Anal. Meth. in Geomech., vol. 30, no. 3, pp. 213–228.\nTing, J.; Corkum, B.; Kauffman, C.; Greco, C. (1989): Discrete numerical\nmodel for soil mechanics. J. of Geotech. Eng., ASCE, vol. 115, no. 3, pp. 379–398.\nUrso, M.; Lawrence, C. J.; Adams, M. J. (1999):\nPendular, funicular, and\ncapillary bridges: results for two dimensions. J. of Col. and Interf. Sc., vol. 220,\npp. 42–56.\nZeghal, M.; Shamy, U. E. (2008): Liquefaction of saturated loose and cemented\ngranular soils. Powder Technology, vol. 184, pp. 254–265.\n\n\f\f"}