{"id": "http://arxiv.org/abs/0907.4921v2", "guidislink": true, "updated": "2009-09-14T17:33:30Z", "updated_parsed": [2009, 9, 14, 17, 33, 30, 0, 257, 0], "published": "2009-07-28T14:10:51Z", "published_parsed": [2009, 7, 28, 14, 10, 51, 1, 209, 0], "title": "Jet-Medium Interactions with Identified Particles", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.3131%2C0907.4526%2C0907.0352%2C0907.1916%2C0907.2232%2C0907.3374%2C0907.4544%2C0907.4465%2C0907.1468%2C0907.4785%2C0907.0727%2C0907.4921%2C0907.2162%2C0907.2466%2C0907.3586%2C0907.2297%2C0907.3716%2C0907.4724%2C0907.4717%2C0907.2354%2C0907.3937%2C0907.3803%2C0907.5055%2C0907.4349%2C0907.3350%2C0907.3917%2C0907.0117%2C0907.3196%2C0907.2345%2C0907.2676%2C0907.2939%2C0907.5428%2C0907.1014%2C0907.1106%2C0907.0805%2C0907.1416%2C0907.1202%2C0907.3475%2C0907.2995%2C0907.0490%2C0907.2993%2C0907.3866%2C0907.4829%2C0907.2891%2C0907.3880%2C0907.2991%2C0907.0242%2C0907.4586%2C0907.1950%2C0907.5355%2C0907.2075%2C0907.3010%2C0907.1288%2C0907.4888%2C0907.3327%2C0907.5429%2C0907.1415%2C0907.0630%2C0907.3953%2C0907.0240%2C0907.1080%2C0907.2296%2C0907.2624%2C0907.3798%2C0907.4357%2C0907.1955%2C0907.2119%2C0907.4229%2C0907.3817%2C0907.1560%2C0907.3497%2C0907.0119%2C0907.0550%2C0907.4577%2C0907.2376%2C0907.1695%2C0907.2426%2C0907.3155%2C0907.1526%2C0907.0085%2C0907.0443%2C0907.1181%2C0907.0259%2C0907.1884%2C0907.2148%2C0907.0373%2C0907.1886%2C0907.0061%2C0907.2215%2C0907.5154%2C0907.4768%2C0907.1700%2C0907.2237%2C0907.1268%2C0907.3162%2C0907.1655%2C0907.1763%2C0907.4144%2C0907.4982%2C0907.2863%2C0907.1922&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Jet-Medium Interactions with Identified Particles"}, "summary": "Identified particles have long been of great interest at RHIC in large part\nbecause of the baryon/meson differences observed at intermediate $p_T$ and the\nimplications for hadronization via quark coalescence. With recent high\nstatistics data identified particles are also now central to understanding the\ndetails of the jet-medium interactions and energy loss and hadron formation at\nintermediate and high $p_T$. In particular, high $p_T$ identified particle\nspectra along with two-particle correlations triggered with direct photons,\nneutral pions or electrons from heavy flavor decay with hadrons can provide\ninformation about how medium modifications to jet fragmentation depend on\nparton type. I will review recent results with identified particles both in\nheavy ion systems and the reference measurements in p+p collisions.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.3131%2C0907.4526%2C0907.0352%2C0907.1916%2C0907.2232%2C0907.3374%2C0907.4544%2C0907.4465%2C0907.1468%2C0907.4785%2C0907.0727%2C0907.4921%2C0907.2162%2C0907.2466%2C0907.3586%2C0907.2297%2C0907.3716%2C0907.4724%2C0907.4717%2C0907.2354%2C0907.3937%2C0907.3803%2C0907.5055%2C0907.4349%2C0907.3350%2C0907.3917%2C0907.0117%2C0907.3196%2C0907.2345%2C0907.2676%2C0907.2939%2C0907.5428%2C0907.1014%2C0907.1106%2C0907.0805%2C0907.1416%2C0907.1202%2C0907.3475%2C0907.2995%2C0907.0490%2C0907.2993%2C0907.3866%2C0907.4829%2C0907.2891%2C0907.3880%2C0907.2991%2C0907.0242%2C0907.4586%2C0907.1950%2C0907.5355%2C0907.2075%2C0907.3010%2C0907.1288%2C0907.4888%2C0907.3327%2C0907.5429%2C0907.1415%2C0907.0630%2C0907.3953%2C0907.0240%2C0907.1080%2C0907.2296%2C0907.2624%2C0907.3798%2C0907.4357%2C0907.1955%2C0907.2119%2C0907.4229%2C0907.3817%2C0907.1560%2C0907.3497%2C0907.0119%2C0907.0550%2C0907.4577%2C0907.2376%2C0907.1695%2C0907.2426%2C0907.3155%2C0907.1526%2C0907.0085%2C0907.0443%2C0907.1181%2C0907.0259%2C0907.1884%2C0907.2148%2C0907.0373%2C0907.1886%2C0907.0061%2C0907.2215%2C0907.5154%2C0907.4768%2C0907.1700%2C0907.2237%2C0907.1268%2C0907.3162%2C0907.1655%2C0907.1763%2C0907.4144%2C0907.4982%2C0907.2863%2C0907.1922&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Identified particles have long been of great interest at RHIC in large part\nbecause of the baryon/meson differences observed at intermediate $p_T$ and the\nimplications for hadronization via quark coalescence. With recent high\nstatistics data identified particles are also now central to understanding the\ndetails of the jet-medium interactions and energy loss and hadron formation at\nintermediate and high $p_T$. In particular, high $p_T$ identified particle\nspectra along with two-particle correlations triggered with direct photons,\nneutral pions or electrons from heavy flavor decay with hadrons can provide\ninformation about how medium modifications to jet fragmentation depend on\nparton type. I will review recent results with identified particles both in\nheavy ion systems and the reference measurements in p+p collisions."}, "authors": ["Anne M. Sickles"], "author_detail": {"name": "Anne M. Sickles"}, "author": "Anne M. Sickles", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.nuclphysa.2009.09.015", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0907.4921v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0907.4921v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Proceedings for Quark Matter 2009, Knoxville TN", "arxiv_primary_category": {"term": "nucl-ex", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nucl-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0907.4921v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0907.4921v2", "journal_reference": "Nucl.Phys.A830:131c-138c,2009", "doi": "10.1016/j.nuclphysa.2009.09.015", "fulltext": "Jet-Medium Interactions with Identified Particles\nAnne M. Sickles\nBrookhaven National Laboratory, Upton NY 11973\n\narXiv:0907.4921v2 [nucl-ex] 14 Sep 2009\n\nAbstract\nIdentified particles have long been of great interest at RHIC in large part because of the baryon/meson\ndifferences observed at intermediate pT and the implications for hadronization via quark coalescence. With recent high statistics data identified particles are also now central to understanding\nthe details of the jet-medium interactions and energy loss and hadron formation at intermediate\nand high pT . In particular, high pT identified particle spectra along with two-particle correlations\ntriggered with direct photons, neutral pions or electrons from heavy flavor decay with hadrons\ncan provide information about how medium modifications to jet fragmentation depend on parton type. I will review recent results with identified particles both in heavy ion systems and the\nreference measurements in p+p collisions.\n\n1. Hard Scattering at RHIC\nHard probes of relativistic heavy ion collisions have long been a valuable probe of the hot\nmatter created in relativistic heavy ion collisions. Their main value comes from the fact that\ntheir production is both calculable in perturbative QCD and measurable in proton-proton collisions, providing quantified expectations for heavy ion collisions. Deviations from proton-proton\nexpectations provide measurements of the effects of the hot dense matter on the propagation of\nfast partons. In high energy experiments hard probes are often measured through directly reconstructing full jets. Such measurements are not naturally suited to the large soft background\nof heavy ion collisions, especially when one wants to study the modification of jets from baseline proton-proton collisions measurements (for a discussion of jet reconstruction in heavy ion\ncollisions see [1, 2]). More experimentally straightforward are single particle spectra and two\nparticle correlations which provide complementary observables with relatively large rates. Particle identification provides a valuable experimental handle for changing the probe partons (e.g.\nlight quarks, gluons, heavy quarks, photons) and for studying the effect of the matter on hadron\nformation [3, 4, 5, 6]. Current results from RHIC allow detailed quantitative studies of how jet\nmodifications depend on parton type and provide insights on the interactions of the matter with\nfast partons and the hadron formation process.\n2. Single Particle Production\nThe most stringent constraint on the opacity of the hot matter, within a particular theoretical\nmodel, comes from π0 RAA [7]. The RAA of other particles can provide additional information\nEmail address: anne@bnl.gov (Anne M. Sickles)\nPreprint submitted to Nuclear Physics A\n\nNovember 21, 2018\n\n\fabout parton-medium interactions and hadron formation. Expectations for the RAA of protons and\nanti-protons were that they would be more suppressed than π0 since gluon jets were thought to\nproduce more baryons than quark jets do (however, recent fragmentation functions incorporating\nthe STAR p, p̄ spectra cast some doubt on this [8]). Since gluons have a larger QCD color factor,\nthey should lose more energy. However, recent measurements from STAR show that RAA (p, p̄) >\nRAA (π0 ), Fig. 1. At intermediate pT , 2 < pT < 6 GeV/c, this difference is widely thought to be\nfrom recombination (see Ref [9] and references therein), though realistic calculations taking into\naccount spatial correlations, energy and momentum conservation and gluons have not yet been\ndone.\nFor pT > 6GeV/c, the difference between RAA (p, p̄) and RAA (π0 ) is smaller but still significant\nand is not understood. One possible idea is that as the jet partons traverse the matter they change\nflavor after scattering on matter partons [10, 11], for example a fast quark could scatter off a\nmedium gluon and emerge as a fast gluon. Discovery of these conversions would be extremely\ninteresting as it would provide a means to study the mean free path of partons in the matter. However, this mechanism could make RAA (p, p̄) ≈ RAA (π0 ), but cannot make RAA (p, p̄) > RAA (π0 ) so\nit cannot, in itself, explain the current data.\nAlternatively, it has been proposed that baryons and anti-baryons observed at RHIC at high\npT are produced in higher twist QCD processes in the initial state [5]. Processes such as uu → pd̄\ncan occur in QCD, but they are typically rare compared to production via jet fragmentation.\nHowever, since the protons produced directly in the hard scattering are small enough to propagate\nthrough the matter without interacting, similar to a direct photon. Such p and p̄ would also be\nproduced in proton-proton collisions, however the dense matter in the heavy ion collision selects\nout these protons because the partons that would lead to fragmentation p and p̄ production lose\nenergy. This mechanism naturally leads to RAA (p, p̄) > RAA (π0 ). The decreasing v2 of p and\np̄ [12] observed by PHENIX is also easily explained if an increasing fraction of the p and p̄ is\ninsensitive to the path length through the matter and this also explains the centrality dependence\nof p and p̄ triggered correlations at intermediate pT [13].\n3. Two Particle Correlations\nTwo particle correlations have been used extensively to investigate jet production at RHIC.\nThey are complementary to single particle observables, especially in that they are expected to\nhave a different sensitivity to geometry. Single particle observables are thought to be strongly\nbiased toward particles toward partons which have lost less than the average amount of energy\nwhich is dominated by those with a short path length through the matter. Requiring a correlated\nparticle changes the surface bias depending on the pT and ∆φ between the trigger and associated\nparticle. At high pT , two-particle back-to-back correlations can help constrain the path length\ndependence of energy loss. Previous measurements with charged hadrons have shown a strong\nsuppression of the away side hadrons when a high pT trigger is required [15, 16]. At intermediate\npT with hadron-hadron correlations a third peak at |∆φ − π| ≈1 radian, termed the shoulder is\nobserved [16, 17, 18]. Both the trigger particle and pT dependence of this structure are of great\ninterest in determining its origin and sensitivity to properties of the matter. New measurements\nwith the 2007 RHIC run allow further exploration of this with identified triggers and smaller pT\nbins. Identified trigger particles are important because of the dependence of RAA on the hadron\nspecies out to the highest measured pT .\n2\n\n\fFigure 1: (color online) Nuclear modification factor, RAA for charged π, K and p+ p̄ for central collisions [14].\n\n3.1. Direct Photon-Hadron & π0 -Hadron Correlations\nDirect photon-hadron (γdir -h) correlations have long been considered an important observable in studying energy loss. The photons are primarily produced in hard scattering processes in\nthe initial state. Photons do not lose energy in the matter and therefore, at leading order, provides\na measure of the away side jet energy (initial state kT and NLO effects modify this somewhat,\nsee Ref. [19] for recent measurements). Because the photons do not lose energy they are not\nsurfaced biased as hadron triggered measurements are.\nHowever, the measurements are extremely difficult because of the large background from\nphotons from meson (primarily π0 ) decay: γdecay . What is measured is the weighted average of\nthe conditional yield associated with γdir -h and γdecay -h:\nYγincl −h =\n\nNdecay\nNdirect\nYγ −h +\nYγ −h\nNincl direct\nNincl decay\n\n(1)\n\nThe two unknowns are then the fraction of the photons which are direct and the γdecay -h conditional yield. The PHENIX and STAR methods for determining these quantities are quite different and are explained elsewhere [20, 21, 22]. PHENIX recently published results from the\n2004 RHIC run which show first measurements of γdir -h correlations in Au+Au and p+p collisions [20]. Preliminary results from the 2007 RHIC run with higher statistics are available from\nboth PHENIX and STAR. Since the γdir provides a measurement of the jet energy, the conditional yield as a function of zT ≡ pT,h /pT,trig is approximately the jet fragmentation function\ninto hadrons. At leading order the away side jet is expected to be a (anti-)quark jet because γdir\nproduction is largely via qg → qγ. The data are shown in Figure 2. The exponential slope of the\nquark fragmentation function is ≈8 [23] and a fit to the p+p results gives a slope of 6.89±0.64\n3\n\n\fFigure 2: (color online) zT distributions for PHENIX [21] (left) and STAR [22] (right) γdir -h correlations for Au+Au and\np+p collisions.\n\nFigure 3: (color online) IAA for γdir -h and π0 -h away side yields from PHENIX[21] (left) and STAR [22] (right). Both\nresults show no pT dependence or any significant difference between the suppression of π0 and γdir triggers.\n\n(consistent with quark jet fragmentation functions [23]). Fitting the PHENIX Au+Au data gives\na slightly softer slope: 9.5±1.4.\nIt is useful to compare γdir -h and π0 -h correlations. π0 -h correlations show a nearly constant suppression with pT,trig and pT,h for a wide pT range in central collisions. In contrast π0 -h\ncorrelations are biased toward small medium path lengths and the π0 does not carry the full jet\nenergy. Therefore, differences between away side yields of γdir -h and π0 -h provide information\nabout the geometry and the energy dependences of energy loss. Within the current uncertainties\nthe data are consistent between these two channels. With the present uncertainties, theoretical predictions do not predict a measurable difference between these channels in the pT ranges\nmeasured [24, 25, 26, 27].\nNear side correlations, where the azimuthal angle between the γdir and the hadron is small are\nvery interesting in heavy ion collisions. In hadron-hadron correlations, these correlations come\nfrom same jet fragmentation. In γdir -hadron correlations in p+p collisions, these correlations\n4\n\n\fFigure 4: (color online) Near side conditional yields for γdir -h and π0 -h correlations in central Au+Au and p+p collisions\nfrom PHENIX [21].\n\nexist only when the photon is from jet fragmentation (for a discussion of fragmentation photons\nsee Ref. [28]). Thus, the yield in p+p collisions of near side hadrons per trigger should be much\nsmaller for γdir -h than π0 -h correlations, as observed in Fig. 4. The near side γdir -h correlations\nin Au+Au collisions are consistent with measurements from p+p collisions.\nAnother sensitive measure of the path length dependence of the energy loss is π0 -h correlations where the trigger is selected based on its angle with respect to the reaction plane. When the\ntrigger is aligned with (out of) the reaction plane the di-jet system sees a short (long) medium\npath length. When the energy loss through the core of the collision system is extremely large (all\ndi-jets are completely suppressed if they cross the center), then the orientation with the trigger\nin the reaction plan will have a smaller away side yield than when the trigger is out of plane;\ntangential di-jets which do not cross the center of the collision system will be favored. If the\ndi-jet suppression increases with the path length through the matter however the suppression will\nbe greater when the trigger is oriented out of the reaction plane since that maximizes the away\nside path length. Results from PHENIX shown in Fig. 5 [29]. show that the data favor the latter\ncase and the data favor a stronger reaction plane dependence than expected from some theoretical\nmodels [30, 31, 32].\n3.2. Heavy Flavor Conditional Yields\nIt has been known for some time that electrons from the decay of heavy mesons (Ds and Bs)\nare suppressed more than can typically be accounted for in radiative energy loss calculations [34,\n35]. There have been a variety of theoretical attempts to explain this including collisional energy\nloss [36], recombination [37, 38], and in-medium hadron formation [39]. The next experimental\n5\n\n\fFigure 5: (color online) Left: Away side conditional yield as a function of the angle of the trigger with respect to the\nreaction plane for π0 -h correlations in mid-central Au+Au collisions. Right: χ2 distribution for the ratio of the conditional\nyield out of plane to the conditional yield in plane using 4 < pT,π0 < 7GeV/c and hadrons with 3 < pT,h < 4GeV/c and\n4< pT,h < 5GeV/c in mid-central Au+Au collisions [29, 33].\n\nstep is to correlate the heavy quark electrons with other hadrons in the event in the same manner\nas is done for π0 -h and γdir -h correlations.\nThis measurement is severely complicated by the large number of background electrons from\nπ0 Dalitz decays and photon conversions and low statistics. STAR has developed a method of\ntagging photonic electrons via the invariant mass of e+ e− pairs [40]. PHENIX has established\na method analogous to that used for the γdir -h correlations shown above to statistically subtract\ncorrelations from photonic sources [41]. Figure 6 shows results from p+p collisions compared to\ncharm production simulated in PYTHIA [42] (left) [41] and away side IAA which suggests some\nsuppression of away side hadrons opposite to electrons from heavy flavor decay (right).\nInterpretation of these measurements is complicated because electrons from heavy flavor decay come both from charm and bottom production. Experimental efforts [43, 44] to determine\nthe relative contribution of these sources in p+p collisions have agreed with Fixed Order Next\nto Leading Log calculations [45]. However, the relative contributions to the electron sample\nin heavy ion collisions could be modified from p+p due to the effects of the medium. In the\npT,e range measured here the electrons are expected to mainly be from D meson decay. Higher\nstatistics measurements in the 2010 RHIC run might allow these measurements to be extended\nto higher pT where bottom contributions are expected to be more significant. With detector upgrades capable of displaced vertex measurements it will be possible to distinguish charm and\nbottom triggered correlations. Those measurements will be crucial in understanding the suppression of the single electron spectra in Au+Au collisions.\n3.3. Background Estimation and Two Source Model\nJet correlation measurements in heavy ion collisions depend on a procedure to estimate and\nremove the combinatorial background from pairs which do not come from the same di-jet production. Combinatorial pairs are assumed to only be angularly correlated through the reaction\nplane and the v2 values of the trigger and partner hadrons are assumed to be independent. The\nshape of the combinatorial background in ∆φ is then, b0 (1 + 2v2,trig v2,part cos(2∆φ)).\nb0 is often estimated by assuming the minimum in the jet function has zero yield [46]. There\nare a number of issues associated with this assumption. At the high momenta considered here\nthe fluctuation of the background level due to statistical fluctuations in the correlation functions\n6\n\n\fFigure 6: (color online) Away side eHF -h conditional yields in p+p collisions (left) [41] and IAA (right).\n\nis a large source of uncertainty and bias [47]. Also in heavy ion collisions the jet induced correlations are much wider than in p+p collisions making the assumption of a zero yield region less\ndesirable. The use of the Absolute Background Subtraction method [47] is preferable because of\nits stability in cases of low statistics and wide jets. Even when the combinatorial background is\nsmall compared to the jet yield (as it is at high pT ) the uncertainty can be large compared to the\njet conditional yields.\n4. Conclusions and Outlook\nHigh pT identified spectra and correlation measurements give a significantly more nuanced\npicture of parton-medium interactions than unidentified hadron measurements alone. Contrary\nto expectations of high pT particle production by vacuum fragmentation alone, excess p and p̄ in\nheavy ion collisions persist out to pT ≈10GeV/c. This could be evidence of significant highertwist baryon production and will be further investigated with higher statistics data, correlations,\nand v2 measurements. In contrast both π0 -h and γdir -h correlations are consist with each other\nand show little dependence on the pT of either the trigger or associated particle. Initial measurements of eHF -h correlation results have large statistical errors, but show some evidence for away\nside suppression. Future measurements with higher statistics and charm and bottom separation\nwill enable tomography of heavy flavor energy loss. While existing single and di-hadron measurements show that the created matter leads to a large energy loss, precision measurements with\nidentified particles will allow robust determination of the mechanism of energy loss as well as\nthe mechanisms of hadron formation.\n5. Acknowledgements\nI thank Andrew Adare, Bertrand Biritz, Megan Connors, Ahmed Hamed, Mike McCumber, Bedenga Mohanty, Dave Morrison, Jamie Nagle, Paul Stankus and Jiayin Sun interesting\ndiscussions and providing me with plots. I thank the Quark Matter 2009 organizers for a very\ninteresting and enjoyable conference. This work is supported by the U. S. Department of Energy\nunder contract DE-AC02-98CH1-886.\n7\n\n\fReferences\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n[29]\n[30]\n[31]\n[32]\n[33]\n[34]\n[35]\n[36]\n[37]\n[38]\n[39]\n[40]\n[41]\n[42]\n[43]\n[44]\n[45]\n[46]\n[47]\n\nS. Salur, these proceedings, arXiv:0907.4536.\nY. Lai, et al., these proceedings, arXiv:0907.4725.\nR. J. Fries, et al., Phys. Rev. C68 (2003) 044902.\nR. Hwa, C. B. Yang, Phys. Rev. C70 (2004) 024904.\nS. Brodsky, A. Sickles, Phys. Lett. B668 (2008) 111–115.\nI. Vitev, M. Gyulassy, Phys. Rev. Lett 89 (2002) 232301.\nA. Adare, et al., Phys. Rev. C77 (2008) 064907.\nD. de Florian, R. Sassot, M. Stratmann, Phys. Rev. D76 (2007) 074033.\nR. Fries, V. Greco, P. Sorensen, Ann. Rev. Nucl. Part. Sci. 58 (2008) 177–205.\nW. Liu, C. Ko, B. Zhang, Phys. Rev. C75 (2007) 051901.\nW. Liu, R. Fries, Phys. Rev. C77 (2008) 054902.\nS. Huang, et al., J. Phys. G 36 (2009) 064061.\nA. Adare, et al., Phys. Lett. B 649 (2007) 359–369.\nY. Xu, et al., these proceedings, arXiv:0907.4644.\nC. Adler, et al., Phys. Rev. Lett. 97 (2006) 162301.\nA. Adare, et al., Phys. Rev C78 (2008) 014901.\nS. S. Adler, et al., Phys. Rev. Lett. 97 (2006) 052301.\nC. Adler, et al., Phys. Rev. Lett. 95 (2005) 152301.\nJ. Frantz, et al., arXiv:0901.1393.\nA. Adare, et al., Phys. Rev. C 80 (2009) 024908.\nM. Connors, et al., these proceedings, arXiv:0907.4571.\nA. M. Hamed, et al., these proceedings, arXiv:0907.4523.\nS. S. Adler, et al., Phys. Rev. D74 (2006) 072002.\nH. Zhang, et al., Phys. Rev. Lett. 103 (2009) 032302.\nH. Zhang, et al., Phys. Rev. Lett. 98 (2007) 212301.\nT. Renk, Phys. Rev. 80 (2009) 014901.\nT. Renk, Phys. Rev. C78 (2008) 014903.\nA. Hanks, et al., these proceedings, arxiv:0907.4825.\nM. McCumber, et al., arXiv:0905.0429.\nV. Pantuev, nucl-ex/0610002.\nV. Pantuev, JETP Lett. 85 (2007) 104.\nT. Renk, Phys. Rev. C78 (2008) 034904.\nC. Chen, et al., these proceedings, arXiv:0907.4820.\nA. Adare, et al., Phys. Rev. Lett. 98 (2006) 172301.\nB. Abelev, et al., Phys. Rev. Lett. 98 (2007) 192301.\nS. Wicks, et al., Nucl. Phys A784 (2007) 426–442.\nP. R. Sorensen, X. Dong, Phys. Rev. C74 (2006) 024902.\nY. Oh, et al., Phys. Rev. C79 (2009) 044905.\nA. Adil, I. Vitev, Phys. Lett. B649 (2007) 139,146.\nG. Wang, et al., J Phys. G 35 (2008) 104107.\nA. Sickles, et al., arXiv:0905.2112.\nT. Sjoestrand, et al., Comp. Phys. Comm 135 (2001) 238.\nA. Adare, et al., Phys. Rev. Lett. 103 (2009) 082002.\nB. Biritz, et al., these proceedings, arXiv:0907.3937.\nM. Cacciari, P. Nason, R. Vogt, Phys. Rev. Lett. 95 (2005) 122001.\nN. N. Ajitanand, et al., Phys. Rev. C72 (2005) 011902.\nA. Sickles, M. McCumber, A. Adare, submitted to Phys. Rev. C, arXiv:0907.4113.\n\n8\n\n\f"}