{"id": "http://arxiv.org/abs/1010.1302v1", "guidislink": true, "updated": "2010-10-06T23:33:59Z", "updated_parsed": [2010, 10, 6, 23, 33, 59, 2, 279, 0], "published": "2010-10-06T23:33:59Z", "published_parsed": [2010, 10, 6, 23, 33, 59, 2, 279, 0], "title": "LISA Sensitivities to Gravitational Waves from Relativistic Metric\n  Theories of Gravity", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1010.2193%2C1010.1025%2C1010.5017%2C1010.4147%2C1010.1565%2C1010.4973%2C1010.4798%2C1010.3256%2C1010.3450%2C1010.4569%2C1010.4295%2C1010.3451%2C1010.2951%2C1010.1653%2C1010.4942%2C1010.5124%2C1010.3407%2C1010.2312%2C1010.4342%2C1010.0439%2C1010.1302%2C1010.5429%2C1010.5591%2C1010.4374%2C1010.1538%2C1010.1691%2C1010.2438%2C1010.1678%2C1010.4040%2C1010.1063%2C1010.3226%2C1010.5361%2C1010.1687%2C1010.1287%2C1010.6120%2C1010.5571%2C1010.0513%2C1010.4103%2C1010.4897%2C1010.0959%2C1010.4333%2C1010.5656%2C1010.2309%2C1010.4516%2C1010.0457%2C1010.2748%2C1010.0950%2C1010.5414%2C1010.5135%2C1010.2390%2C1010.0129%2C1010.1439%2C1010.3135%2C1010.3645%2C1010.0524%2C1010.0266%2C1010.5420%2C1010.1174%2C1010.4664%2C1010.3441%2C1010.6081%2C1010.1146%2C1010.5802%2C1010.3825%2C1010.3717%2C1010.0741%2C1010.3990%2C1010.1121%2C1010.0006%2C1010.3856%2C1010.1327%2C1010.4348%2C1010.2910%2C1010.6192%2C1010.4852%2C1010.5102%2C1010.2347%2C1010.6037%2C1010.5608%2C1010.0255%2C1010.6018%2C1010.4272%2C1010.4102%2C1010.0064%2C1010.2343%2C1010.1869%2C1010.2494%2C1010.0839%2C1010.3545%2C1010.0770%2C1010.4452%2C1010.1396%2C1010.3401%2C1010.2959%2C1010.2756%2C1010.3434%2C1010.4692%2C1010.6011%2C1010.2699%2C1010.5537%2C1010.4184&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "LISA Sensitivities to Gravitational Waves from Relativistic Metric\n  Theories of Gravity"}, "summary": "The direct observation of gravitational waves will provide a unique tool for\nprobing the dynamical properties of highly compact astrophysical objects,\nmapping ultra-relativistic regions of space-time, and testing Einstein's\ngeneral theory of relativity. LISA (Laser Interferometer Space Antenna), a\njoint NASA-ESA mission to be launched in the next decade, will perform these\nscientific tasks by detecting and studying low-frequency cosmic gravitational\nwaves through their influence on the phases of six modulated laser beams\nexchanged between three remote spacecraft. By directly measuring the\npolarization components of the waves LISA will detect, we will be able to test\nEinstein's theory of relativity with good sensitivity. Since a gravitational\nwave signal predicted by the most general relativistic metric theory of gravity\naccounts for {\\it six} polarization modes (the usual two Einstein's tensor\npolarizations as well as two vector and two scalar wave components), we have\nderived the LISA Time-Delay Interferometric responses and estimated their\nsensitivities to vector- and scalar-type waves. We find that (i) at frequencies\nlarger than roughly the inverse of the one-way light time ($\\approx 6 \\times\n10^{-2} $ Hz.) LISA is more than ten times sensitive to scalar-longitudinal and\nvector signals than to tensor and scalar-transverse waves, and (ii) in the low\npart of its frequency band is equally sensitive to tensor and vector waves and\nsomewhat less sensitive to scalar signals.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1010.2193%2C1010.1025%2C1010.5017%2C1010.4147%2C1010.1565%2C1010.4973%2C1010.4798%2C1010.3256%2C1010.3450%2C1010.4569%2C1010.4295%2C1010.3451%2C1010.2951%2C1010.1653%2C1010.4942%2C1010.5124%2C1010.3407%2C1010.2312%2C1010.4342%2C1010.0439%2C1010.1302%2C1010.5429%2C1010.5591%2C1010.4374%2C1010.1538%2C1010.1691%2C1010.2438%2C1010.1678%2C1010.4040%2C1010.1063%2C1010.3226%2C1010.5361%2C1010.1687%2C1010.1287%2C1010.6120%2C1010.5571%2C1010.0513%2C1010.4103%2C1010.4897%2C1010.0959%2C1010.4333%2C1010.5656%2C1010.2309%2C1010.4516%2C1010.0457%2C1010.2748%2C1010.0950%2C1010.5414%2C1010.5135%2C1010.2390%2C1010.0129%2C1010.1439%2C1010.3135%2C1010.3645%2C1010.0524%2C1010.0266%2C1010.5420%2C1010.1174%2C1010.4664%2C1010.3441%2C1010.6081%2C1010.1146%2C1010.5802%2C1010.3825%2C1010.3717%2C1010.0741%2C1010.3990%2C1010.1121%2C1010.0006%2C1010.3856%2C1010.1327%2C1010.4348%2C1010.2910%2C1010.6192%2C1010.4852%2C1010.5102%2C1010.2347%2C1010.6037%2C1010.5608%2C1010.0255%2C1010.6018%2C1010.4272%2C1010.4102%2C1010.0064%2C1010.2343%2C1010.1869%2C1010.2494%2C1010.0839%2C1010.3545%2C1010.0770%2C1010.4452%2C1010.1396%2C1010.3401%2C1010.2959%2C1010.2756%2C1010.3434%2C1010.4692%2C1010.6011%2C1010.2699%2C1010.5537%2C1010.4184&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The direct observation of gravitational waves will provide a unique tool for\nprobing the dynamical properties of highly compact astrophysical objects,\nmapping ultra-relativistic regions of space-time, and testing Einstein's\ngeneral theory of relativity. LISA (Laser Interferometer Space Antenna), a\njoint NASA-ESA mission to be launched in the next decade, will perform these\nscientific tasks by detecting and studying low-frequency cosmic gravitational\nwaves through their influence on the phases of six modulated laser beams\nexchanged between three remote spacecraft. By directly measuring the\npolarization components of the waves LISA will detect, we will be able to test\nEinstein's theory of relativity with good sensitivity. Since a gravitational\nwave signal predicted by the most general relativistic metric theory of gravity\naccounts for {\\it six} polarization modes (the usual two Einstein's tensor\npolarizations as well as two vector and two scalar wave components), we have\nderived the LISA Time-Delay Interferometric responses and estimated their\nsensitivities to vector- and scalar-type waves. We find that (i) at frequencies\nlarger than roughly the inverse of the one-way light time ($\\approx 6 \\times\n10^{-2} $ Hz.) LISA is more than ten times sensitive to scalar-longitudinal and\nvector signals than to tensor and scalar-transverse waves, and (ii) in the low\npart of its frequency band is equally sensitive to tensor and vector waves and\nsomewhat less sensitive to scalar signals."}, "authors": ["Massimo Tinto", "Márcio Eduardo da Silva Alves"], "author_detail": {"name": "Márcio Eduardo da Silva Alves"}, "author": "Márcio Eduardo da Silva Alves", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.82.122003", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1010.1302v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1010.1302v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Paper submitted to Physical Review D. It is 20 pages long and\n  contains 14 figures", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1010.1302v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1010.1302v1", "journal_reference": "Phys.Rev.D82:122003,2010", "doi": "10.1103/PhysRevD.82.122003", "fulltext": "LISA Sensitivities to Gravitational Waves from Relativistic\nMetric Theories of Gravity\nMassimo Tinto∗\nJet Propulsion Laboratory, California Institute of Technology, Pasadena, CA 91109\nMárcio Eduardo da Silva Alves†\n\narXiv:1010.1302v1 [gr-qc] 6 Oct 2010\n\nInstituto de Ciências Exatas, Universidade\nFederal de Itajubá, 37500-903 Itajubá, MG, Brazil\n(Dated: October 29, 2018)\n\nAbstract\nThe direct observation of gravitational waves will provide a unique tool for probing the dynamical\nproperties of highly compact astrophysical objects, mapping ultra-relativistic regions of space-time,\nand testing Einstein's general theory of relativity. LISA (Laser Interferometer Space Antenna),\na joint NASA-ESA mission to be launched in the next decade, will perform these scientific tasks\nby detecting and studying low-frequency cosmic gravitational waves through their influence on\nthe phases of six modulated laser beams exchanged between three remote spacecraft. By directly\nmeasuring the polarization components of the waves LISA will detect, we will be able to test\nEinstein's theory of relativity with good sensitivity. Since a gravitational wave signal predicted by\nthe most general relativistic metric theory of gravity accounts for six polarization modes (the usual\ntwo Einstein's tensor polarizations as well as two vector and two scalar wave components), we have\nderived the LISA Time-Delay Interferometric responses and estimated their sensitivities to vectorand scalar-type waves. We find that (i) at frequencies larger then roughly the inverse of the oneway light time (≈ 6 × 10−2 Hz.) LISA is more than ten times sensitive to scalar-longitudinal and\nvector signals than to tensor and scalar-transverse waves, and (ii) in the low part of its frequency\nband is equally sensitive to tensor and vector waves and somewhat less sensitive to scalar signals.\nPACS numbers: 04.80.Nn, 95.55.Ym, 07.60.Ly\n\n∗\n\nElectronic address: Massimo.Tinto@jpl.nasa.gov\n\n†\n\nElectronic address: alvesmes@unifei.edu.br\n\n1\n\n\fI.\n\nINTRODUCTION\n\nThe direct detection of gravitational waves will represent one of the greatest triumphs\nof experimental physics of this century, and provide us with a new observational tool for\nobtaining better and deeper understanding about their sources.\nSeveral experimental efforts have been underway for years, both on the ground and in\nspace [1–6], and only recently kilometer-size ground-based interferometers have been able\nto identify the most stringent upper-limits to date for the amplitudes of the radiation expected from several classes of sources. Although an unambiguous detection has not been\ndeclared with present-generation instruments, next-generation Earth-based interferometers\nand pulsar-timing experiments, as well as the LISA (Laser Interferometric Space Antenna)\nmission [7] are expected to achieve this goal.\nLISA, jointly proposed to the National Aeronautics and Space Administration (NASA)\nand the European Space Agency (ESA), is expected to be flown sometimes in the next\ndecade. Its goal is to detect and study gravitational waves (GW) in the millihertz frequency\nband. It will use coherent laser beams exchanged between three identical spacecraft forming\na giant (almost) equilateral triangle of side 5 × 106 kilometers. By monitoring the relative\nfrequency changes of the light beams exchanged between the spacecraft, it will extract the\ninformation about the gravitational waves it will observe at unprecedented sensitivities [7].\nThe astrophysical sources that LISA is expected to observe within its operational frequency\nband (10−4 − 1 Hz) will be very large in number, including galactic and extra-galactic\ncoalescing binary systems containing white dwarfs and neutron stars, extra-galactic supermassive black-hole coalescing binaries, and a stochastic gravitational wave background from\nthe early universe [8, 9].\nThe first unambiguous detection of a gravitational wave signal, whether performed on\nthe ground or in space, will also allow us to test Einstein's general theory of relativity (GR)\nby measuring the polarization components of the detected signals [10, 11]. Among all the\nproposed relativistic metric theories of gravity [12], GR is the most restrictive, allowing for\nonly two of possible six different polarizations [13]. By asserting that the spin-2 (\"tensor\")\npolarizations are the only polarization components observed, we would make a powerful\nproof of the validity of Einstein's theory of relativity, while a clear observation of some other\npolarization modes would disqualify it. Corroboration of polarization measurements with\n\n2\n\n\festimates of the propagation speed of the observed gravitational wave signal will provide\nfurther insight into the nature of the observed radiation and result into the determination\nof the mass of the graviton. It should be emphasized, however, that a propagation-speed\nmeasurement alone consistent with a value equal to the speed of light, would not automatically rule-out other relativistic metric theories of gravity. This is because waves with helicity\ns = 0 can also propagate at light-speed [14]. Gravitational waves with scalar polarization\nare predicted by the most common generalizations of GR such as scalar-tensor theories.\nBesides the classical example of Brans-Dicke theory [15], scalar-tensor theories result in the\nlow-energy limit of string theory (see, e.g., [16]). Modifications of the Einstein-Hilbert action, which consider generic functions of the Ricci scalar in the Lagrangian (f(R) theories),\nalso predict \"scalar\" gravitational waves [17]. Vector modes, on the other hand, can appear\nin the so-called \"quadratic gravity\" formulations [17], and in the context of theories in which\nthe graviton has a finite mass such as the Visser theory [18].\nLISA will not be able to distinguish the propagation speeds of scalar (helicity s = 0)\nand vector (helicity s = ±1) polarizations from the speed of light (a result following, as we\nshall see below, from a combination of the existing stringent upper limits on the mass of\nthe graviton [19–21] and the LISA observational bandwidth). However, it should be able\nto assess the polarizations of the observed gravitational wave signals. Since the accuracy\nby which LISA will distinguish one polarization from another will depend on their signalto-noise ratios [22], in this paper we estimate the LISA sensitivities to scalar- and vectorpolarized wave.\nThe paper is organized as follows. In Section (II) we derive the one-way Doppler response\nto a gravitational wave signal characterized by six polarizations (2 \"tensor\" (helicity s = ±2),\n2 \"vector\" (helicity s = ±1), and 2 \"scalar\" (helicity s = 0)). Since the resulting expression\nis equal in form to the one previously derived by Estabrook and Wahlquist [23] for tensor\nwaves (i.e. for waves predicted by General Relativity), we conclude that the responses of the\nvarious time-delay interferometric (TDI) combinations are also identical in form to those\npreviously derived within the framework of GR [24]. Although the derivation of the response\nfunction of a Michelson interferometer to non-tensor polarization modes has been considered\nin previous publications [10, 25], the expression presented there was correct in the so called\n\"long-wavelength-limit\", i.e. when the wavelength of the GW is much larger than the size of\nthe detector. Since LISA will be sensitive, over most of its observational frequency band, to\n3\n\n\fGWs of wavelength shorter than its linear size, we have derived the expressions of the LISA\nTDI responses to vector- and scalar- waves that are valid for any wavelength. In Section\n(III) we then compute the LISA sensitivities to vector and scalar waves. We find that (i)\nat frequencies larger then the inverse of the one-way light time (≈ 6 × 10−2 Hz) LISA is\nten-times more sensitive to scalar-longitudinal and vector signals than to tensor and scalartransverse waves, while (ii) it is equally sensitive to tensor and vector waves, and somewhat\nless sensitive to scalar signals in the low part of its frequency band. Although both these\nresults might seem surprising at first, we show that they are consequence of the physical and\ngeometrical properties of the vector and scalar waves and how they affect the frequency of\nthe light beams exchanged by the three LISA spacecraft. Finally in Section (IV) we present\na summary of the paper and our concluding remarks. Throughout the paper we will be\nusing natural units ( c = G = h = 1) except where mentioned otherwise.\n\nII.\n\nDERIVATION OF THE ONE-WAY DOPPLER RESPONSE\n\nIn what follows we present the derivation of the \"one-way\" Doppler response to a gravitational wave signal predicted by the most general relativistic metric theory of gravity [13].\nAlthough the result has already appeared in the literature [26], our derivation results into an\nexpression that is compact and identical in form to that first obtained by Wahlquist [27] in\nthe case of plane gravitational waves predicted by GR. This of course simplifies significantly\nthe derivation of the LISA TDI responses as they turn out to be equal in form to those\ngiven in [24]. As in [23, 27], our derivation is general and does not rely on any assumptions\nabout the size of the wavelength of the radiation relative to the size of the detector.\nLet us consider a space-time with the following metric\nds2 = −dt2 + (δij + hij (vt − z))dxi dxj , |hij | << 1,\n\n(1)\n\nwhere the usual sum convention over repeated indices is assumed, Latin indices go from\n1 to 3, and a plane- gravitational wave has been assumed, without loss of generality, to\npropagate along an arbitrary +z direction. In Eq. (1) we have allowed the wave to travel\nat a finite speed (group velocity) v < 1 to account for a possible non-zero mass of the\ngraviton. Working in the context of GR, it is well know that hij has two degrees of freedom\nrepresenting gravitational waves (GWs) with helicity s = ±2, and v = 1. On the other\n4\n\n\fhand, alternative relativistic metric theories of gravity allow for GWs with up to six degrees\nof freedom [13]. Therefore, in the most general case, hij can be represented in terms of six\ncomponents (with corresponding six metric amplitudes) in the following form [13]\nhij (vt − z) =\n\n6\nX\n\n(r)\n\n\u000fij h(r) (vt − z) ,\n\n(2)\n\nr=1\n(r)\n\nwhere \u000fij are the six polarization tensors associated with the six waveforms of the gravitational wave signal. If we introduce a set of Cartesian orthogonal coordinates (x, y, z)\nassociated with the wave, in which (x, y) are in the plane of the wave and z is along the\ndirection of propagation of the wave and orthogonal to the (x, y) plane, the above six polarization tensors assume the following matricial form [13]\n\n\n\n\n0 0 1\n0 0 0\n\n\n\n \u0002 \u0003\n\u0002 (1) \u0003\n\n\n\n\n\u000f ij =  0 0 0  \u000f(2) ij =  0 0 0 \n\n\n\n\n1 0 0\n0 0 1\n\n\n\n\n\n\n\n\n1 0 0\n0 0 0\n\n\n \u0002 \u0003\n\n\u0002 (3) \u0003\n\n\n (4)\n\n\u000f ij =  0 0 1  \u000f ij =  0 −1 0 \n\n\n\n\n0 0 0\n0 1 0\n\n\n\n\n\n\n(3)\n\n\n\n1 0 0\n0 1 0\n\n\n \u0002 \u0003\n\n\u0002 (5) \u0003\n\n\n (6)\n\n\u000f ij =  1 0 0  \u000f ij =  0 1 0  .\n\n\n\n\n0 0 0\n0 0 0\nFrom the above expressions it is easy to verify that the tensors \u000f(a) , a = 1, ...., 6 are linearly\nindependent and form an orthogonal basis. In our notation we have labeled 4 and 5 the\nusual + and × polarizations respectively (the tensor polarization waveforms). The vector\npolarizations (s = ±1) were labeled as 2 and 3, and finally the two scalar modes (s = 0)\nhave been denoted with the labels 1 (for the longitudinal scalar polarization) and 6 (for the\ntransversal scalar mode).\nFollowing [23, 28] we may notice that the space-time described by the metric of Eq. (1)\nallows for the following three Killing vectors\nρ\nK(1)\n= δxρ ,\n\nρ\nK(2)\n= δyρ ,\n\n5\n\nρ\nK(3)\n= δzρ +\n\nδtρ\n.\nv\n\n(4)\n\n\fGenerally speaking, in the weak field regime of a generic metric theory of gravity, GWs can\ntravel with v ≤ 1. In that case the linearized field equations are Klein-Gordon-type, and the\nresulting group velocity is determined by the mass of the graviton, m. Remembering that\n√\nv = ∂ω/∂k, and that the dispersion relation is equal to k = ω 2 − m2 , we find the following\nexpression for v in terms of m and ω\nr\nv(ω) =\n\n1−\n\n\u0010 m \u00112\nω\n\n.\n\n(5)\n\nSince the operational frequency band of LISA will be within the range (10−4 − 1 Hz), by\nassuming presently known upper-limits for the mass of the graviton from Eq. (5) we obtain\nthe resulting values for the group velocity of these waves. After restoring physical units and\ntaking m < 10−59 g (the most stringent constraint to date obtained by requiring the derived\ndynamical properties of a galactic disk to be consistent with observations [21]), at 10−4 Hz\nwe find a value for the group velocity v whose fractional difference, ∆v , from the speed of\nlight is equal to: ∆v = |v − c|/c ' 10−15 . A less stringent value for the mass of the graviton\nequal to m < 7.68×10−55 g (obtained from solar-system dynamics observations [19]), results\ninto a ∆v ' 10−8 . These considerations imply that, no matter whether we are conservative\nor not in our assumption about a likely upper limit for the graviton mass, LISA will not\nbe able to resolve the propagation speeds of the different polarization components of the\ndetected GWs by resolving the time-separations of their imprints in the TDI combinations\n[24]. For this reason, from now on, we will assume v = 1 in natural units, and rewrite the\nρ\nthird Killing vector K(3) as K(3)\n= δzρ + δtρ .\n\nLet us now consider the unit vector n̂ along the Doppler link and oriented from spacecraft\n1 to 2 (see Fig. 1). If we denote with (θ, φ) the usual polar angles, n̂ assumes the following\nfamiliar form\nnρ = sin θ cos φ δxρ + sin θ sin φ δyρ + cos θ δzρ .\n\n(6)\n\nSince the most general Killing vector of our metric can be written as a linear combination\nof the three Killing vectors above\nK ρ = a1 δxρ + a2 δyρ + a3 (δzρ + δtρ ) ,\n\n(7)\n\nwith a1 , a2 , a3 constants, by comparing Eq. (6) and Eq. (7) we note that by taking\n(a1 , a2 , a3 ) = C n̂, Eq. (7) becomes\nK ρ = C[nρ + k̂ * n̂ δtρ ] ,\n6\n\n(8)\n\n\fz\nk̂\n\n2\n0\n\nn̂\nL\n\n1\n\ny\n\n0\n\nx\n\nFIG. 1: A laser beam of nominal frequency ν0 is transmitted from spacecraft 1 to spacecraft 2 and\nsimultaneously another beam from spacecraft 2 is transmitted back to 1. The gravitational wave\ntrain propagates along the z direction, and the two polar angles (θ, φ) describe the direction of\npropagation of the laser beams relative to the wave. See text for a complete description.\n\nwhere C is an arbitrary constant, and k̂ is the unit vector along the direction of propagation\nof the wave (see Figure 1).\nIf we now consider the 4-momentum of a photon transmitted by spacecraft 1, its analytic\nexpression can be written in terms of the metric perturbation at spacecraft 1 in the following\nway [23, 28]\n\u0012\n\u0013\n1\nt\nξ\nPρ = ν0 −δρ + nρ + hρξ n\n,\n2\n\n(9)\n\nwhere it is easy to see that the condition Pρ P ρ = 0 is fulfilled to first order in the metric\nperturbation hij . Since Pρ K ρ = constant along the photon world line [23, 28], we obtain\nthe following relationship between the frequency of the photon emitted at spacecraft 1, ν0 ,\n\n7\n\n\fand that received at spacecraft 2, ν 0\nPρ K ρ = Pρ0 K 0ρ ,\n(10)\n\u0013\n\u0012\n\u0013\n\u0012\n1 0 0ξ\n1\nρ\nξ\nρ\n0\nt\n0\nt\nν0 −δρ + nρ + hρξ n (n + k̂ * n̂δt ) = ν −δρ + nρ + hρξ n (n0ρ + k̂ * n̂0 δtρ ) . (11)\n2\n2\n0ρ\nρ\nρ\nIf we now rewrite n = n + δn , we may notice that, to first order in hij , nρ δnρ = 0 because\nn0ρ nρ = nρ nρ = 1. This result, together with Eq.(11) above, allows us to derive the following\nexpression for the ratio of the two frequencies ν 0 and ν0\n1 − k̂ * n̂ + 21 nρ hρξ nξ\nν0\n=\n.\nν0\n1 − k̂ * n̂ + 21 nρ h0ρξ nξ\n\n(12)\n\nFinally, expanding the right-hand-side of the last equation to first order in hρξ we get the\nresulting expression for the one-way Doppler response, y\ny = (1 + k̂ * n̂) (Ψ − Ψ0 )\n\n(13)\n\nwhere y(t) ≡ (ν 0 (t) − ν0 )/ν0 , and Ψ(t) is equal to\nΨ(t) ≡\n\nni hij (t) nj\n2[1 − (k̂ * n̂)2 ]\n\n(14)\n\nBy explicitly showing the time dependence of the various terms, y(t) can be rewritten in the\nfollowing form [24]\nh\n\ni\ny(t) = (1 + k̂ * n̂) Ψ(t − L) − Ψ(t − k̂ * n̂L)\n\n(15)\n\nwhere L is the separation between the two spacecraft. Note that, in order to obtain the\nabove expression, we have only assumed the time-components of the metric perturbation,\nhρt to be equal to zero [13].\nThe expression for the one-way Doppler response measured on board spacecraft 1 at time\nt can be obtained from Eq. (15) by changing n̂ → −n̂, and further delaying the waveforms\nby k̂ * n̂ L. The resulting one-way Doppler response, y 0 (t), is equal to\nh\ni\ny 0 (t) = (1 − k̂ * n̂) Ψ(t − (1 + k̂ * n̂)L) − Ψ(t)\n\n(16)\n\nSince the above expressions of the one-way Doppler responses are identical in form to\nthose valid for tensor waves [27], it follows that the various TDI combinations of the LISA\nsix inter-spacecraft one-way Doppler measurements will also be identical in form to those\nderived in [24]. For these reasons they will not be given here, and we refer the reader to\n[24, 29, 30] for more details.\n8\n\n\fIII.\n\nLISA SENSITIVITIES\n\nIn this section we will compute the LISA TDI sensitivities to vector and scalar waves.\nAlthough the LISA sensitivities to tensor waves have already been presented in an earlier\npublication [31], for sake of comparison we will include them in the sensitivity plots presented\nin this section. We will specialize our calculations to the equilateral-triangle configuration:\narmlength 1 = armlength 2 = armlength 3 = L (L ' 16.7 light seconds) since the LISA\narm lengths will differ by at most a few percent, and any corrections to our results will be\nto this level of accuracy [24, 30, 31].\nThe LISA sensitivity to tensor GWs has been traditionally taken to be equal to (on\naverage over the sky and polarization states) the strength of a sinusoidal GW required to\nachieve a signal-to-noise ratio of 5 in a one-year integration time, as a function of Fourier\nfrequency. Although in the case of vector waves the average over the polarization states can\nbe performed by implementing the same procedure described in [24, 31] for tensor waves,\nin general this can not be done for scalar waves. This is because the two scalar fields are\nmutually orthogonal (and independent), as one is purely longitudinal and the other purely\ntransverse to the direction of propagation of the wave.\nIn order to compute the LISA sensitivities we will use the following expressions for the\npower spectra of the noises affecting the X, α, ζ, E, P , and U combinations [31] (see Figure\n(2))\n\nSX (f ) = [8 sin2 (4πf L) + 32 sin2 (2πf L)]Sypm (f ) + 16 sin2 (2πf L) Syop (f )\n\n(17)\n\nSα (f ) = [8 sin2 (3πf L) + 16 sin2 (πf L)]Sypm (f ) + 6 Syop (f )\n\n(18)\n\nSζ (f ) = 24 sin2 (πf L) Sypm (f ) + 6 Syop (f )\n\n(19)\n\nSE (f ) = [32 sin2 (πf L) + 8 sin2 (2πf L)]Sypm (f ) + [8 sin2 (πf L)\n+ 8 sin2 (2πf L)] Syop (f )\n\n(20)\n\nSP (f ) = [8 sin2 (2πf L) + 32 sin2 (πf L)]Sypm (f ) + [8 sin2 (2πf L)\n+ 8 sin2 (πf L)] Syop (f )\n\n(21)\n\nSU (f ) = [16 sin2 (πf L) + 8 sin2 (2πf L) + 16 sin2 (3πf L)]Sypm (f )\n+ [4 sin2 (πf L) + 8 sin2 (2πf L) + 4 sin2 (3πf L)] Syop (f ) ,\n\n9\n\n(22)\n\n\f−35\n\n10\n\n−36\n\n10\n\n−37\n\nNoise Power Spectra ( Hz−1)\n\n10\n\n−38\n\n10\n\n−39\n\n10\n\n−40\n\n10\n\nX\n−41\n\n10\n\nU\n\nα\n\n−42\n\n10\n\nE and P\n\n−43\n\n10\n\nζ\n−44\n\n10\n\n−4\n\n10\n\n−3\n\n10\n\n−2\n\n10\nf(Hz)\n\n−1\n\n10\n\n0\n\n10\n\nFIG. 2: Noise spectra in the X, α, ζ, E, P , and U time-delay interferometric combinations\naccounting for the nominal proof-mass and optical path noises. The varying depths of the minima\nin the high-frequency ranges of X, E, and P is an artifact of numerically calculating these functions\nat discrete frequencies\n\nwhere Sypm (f ) = 2.5 × 10−48 [f /1Hz]−2 Hz−1 is the spectrum of the relative frequency\nfluctuations due to each proof mass, and Syop (f ) = 1.8 × 10−37 [f /1Hz]2 Hz−1 is the spectrum\nof optical path (mainly shot and beam pointing) noise. Both these noises can be regarded\nas the main limiting noise sources for LISA [7, 31].\nGravitational wave sensitivity is the wave amplitude required to achieve a given signal-tonoise ratio. We calculate it in the conventional way, requiring a signal-to-noise ratio of 5 in a\np\none year integration time: 5 Sk (f ) B/(root-mean-squared gravitational wave response for\ndata combination k), where k is X, α, ζ, E, P , U , and Sk is the total noise power spectrum\nfor TDI combination k. The bandwidth, B, was taken to be equal to one cycle/year (i.e.\n3.17 × 10−8 Hz).\nWe have assumed the vector-waves to be elliptically polarized and monochromatic, with\ntheir wave functions, (h(2) , h(3) ), written in terms of a nominal wave amplitude, H, and the\n\n10\n\n\ftwo Poincaré parameters, (Φ, Γ), in the following way\nh(2) (t) = H sin(Γ) sin(ωt + Φ) ,\n\n(23)\n\nh(3) (t) = H cos(Γ) sin(ωt) .\n\n(24)\n\nFor scalar signals instead, the two wave functions, (h(1) , h(6) ), have been treated as independent and we calculated the TDI sensitivities to each of these two polarizations. For both\nvector and scalar signals we averaged over source direction by assuming uniform distribution\nof the sources over the celestial sphere; in the case of vector signals we also averaged over\nelliptical polarization states uniformly distributed on the Poincaré sphere for each source\ndirection. The averaging was done via Monte Carlo integration with 4000 source position/polarization state pairs per Fourier frequency bin and 7000 Fourier bins across the\nLISA (10−4 − 1) Hz band [24, 31].\nFigure (3) shows the root-mean-squared (r.m.s.) responses of the TDI combinations (a)\nX (unequal-arm Michelson), (b) α (Sagnac), (c) ζ (symmetrized Sagnac), (d) E (monitor),\n(e) P (beacon), and (f) U (relay) to tensor (already derived in [24] and shown here for\ncomparison), vector and scalar gravitational waves. In the high-part of the LISA frequency\nband we may notice that the r.m.s. responses to vector and scalar-longitudinal waves are\nsignificantly larger than those to tensor and scalar-transverse signals. In particular, the\nscalar-longitudinal r.m.s. response grows with the frequency at a much faster rate than the\nothers.\nIn order to physically understand this effect, let us compare a one-way Doppler response\n(that measured on board spacecraft 1, for instance) to a \"pulse\" tensor wave against that due\nto a scalar-longitudinal pulse wave. A tensor signal propagating orthogonally to the light\nbeam (direction for which the one-way Doppler response can reach its maximum magnitude\nin this case) will only interact with the light for the brief instance its wavefront crosses the\nlight beam. On the other hand, if a scalar-longitudinal wave propagates along the direction\nbetween the two spacecraft (over which the Doppler response will achieve its maximum in\nthis case) the frequency of the light will be affected by the gravitational wave for the entire\ntime L it takes the wave to propagate from one spacecraft to the other, resulting into an\namplification of the frequency shift when the wavelength of the wave is shorter than the\ninter-spacecraft distance, L. The above considerations become apparent by considering in\nboth cases the one-way Doppler response y 0 in the Fourier domain. For a tensor signal, the\n11\n\n\fmodulus-squared of the Fourier transform of Eq. (16) with k̂ * n̂ → 0 becomes equal to\n|ye0 (f )k̂*n̂→0 |2 = sin2 (πf L) |e\nh(f )|2 ,\n\n(25)\n\nwith e\nh≡e\nh(4) cos(2φ) + e\nh(5) sin(2φ). In the case of a scalar-longitudinal signal instead, it is\neasy to show that, in the limit of k̂ * n̂ → −1 the modulus-squared of the Fourier transform\nof Eq. (16) becomes equal to\n|ye0 (f )k̂*n̂→−1 |2 = (πf L)2 |e\nh(1) (f )|2 .\n\n(26)\n\nFrom the above two expressions we may conclude that, at frequencies larger than the inverse\nof the one-way-light-time and for tensor and scalar-longitudinal waves of comparable amplitudes, the maximum one-way Doppler response to a scalar-longitudinal signal will be larger\nthan the corresponding maximum response to a tensor wave by roughly a factor of πf L.\nThis example implies that the r.m.s. of the TDI responses to scalar-longitudinal signals will\nbe larger than those to tensor waves in the high-frequency region of the LISA band. Similar\nconsiderations can be made for understanding the differences between the r.m.s. responses\nto tensor and vector waves.\nIn the low-frequency limit (for f < 5 × 10−3 Hz) the tensor and vector r.m.s. responses\ncoincide, while those for the two scalars also coincide with each other but are smaller by\na factor of about 2 than those for tensor and vector waves. This is because the two scalar\nwaves, being mutually orthogonal, have been treated as independent rather than elliptically\npolarized like the vector and tensor waves.\nIn Figure (4) we then plot the corresponding sensitivities of the TDI combinations to the\ntensor, vector and the two scalar polarization components. The characteristic behavior of\nthe r.m.s. responses to scalar-longitudinal and vector signals shown in figure (3) folds into\nthe plots presented here. At high-frequencies the sensitivity to scalar-longitudinal waves is\nsignificantly better than that to tensor, vector, and scalar-transverse waves. At 1 Hz, for\ninstance, the sensitivity of scalar-longitudinal signals is about a factor of f L ' 17 better\nthan that to tensor waves, while it is only a factor of 3 better than the sensitivity to vector\nsignals.\nAnother interesting feature noticeable in Figure (4) is the lack of sensitivity of the Sagnac\ncombinations (b) α and (c) ζ to scalar-transverse waves at frequencies equal to integermultiples of the inverse of the one-way-light-time. We have verified this result analytically\n12\n\n\fScalar L\n\n(a)\n\nVector\n\n1\n\n10\n\nTensor\nScalar T\n\n0\n\nXRMS(f)/H\n\n10\n\n−1\n\n10\n\n−2\n\n10\n\n−3\n\n10\n\n−4\n\n10\n\n−4\n\n−3\n\n10\n\n−2\n\n10\n\n−1\n\n10\nf(Hz)\n\n0\n\n10\n\n10\n\nScalar L\n\n(b)\n\nVector\n\n1\n\n10\n\nTensor\nScalar T\n\n0\n\nαRMS (f)/H\n\n10\n\n−1\n\n10\n\n−2\n\n10\n\n−3\n\n10\n\n−4\n\n10\n\n−4\n\n10\n\n−3\n\n−2\n\n10\n\n10\nf(Hz)\n\n−1\n\n10\n\n0\n\n10\n\nand found that indeed, at these frequencies, the Sagnac responses are identically equal to\nzero independently of the direction of propagation of the signal.\n\nIV.\n\nSUMMARY AND CONCLUSIONS\n\nThe main results of our work have been that (i) LISA is more sensitive to scalarlongitudinal and vector signals than to tensor waves in the high-part of its frequency band,\nand (ii) at low-frequencies its sensitivities to tensor and vector signals are equal and some-\n\n13\n\n\fScalar L\n\n(c)\n\nVector\n\n1\n\n10\n\nTensor\nScalar T\n\n0\n\nζRMS(f)/H\n\n10\n\n−1\n\n10\n\n−2\n\n10\n\n−3\n\n10\n\n−4\n\n10\n\n−3\n\n−2\n\n10\n\n−1\n\n10\n\n0\n\n10\n\n10\n\nf(Hz)\n\n(d)\n1\n\nTensor\n\n10\n\nVector\n\nScalar L\n\nScalar T\n0\n\nERMS(f)/H\n\n10\n\n−1\n\n10\n\n−2\n\n10\n\n−3\n\n10\n\n−4\n\n10\n\n−4\n\n10\n\n−3\n\n−2\n\n10\n\n10\nf(Hz)\n\n−1\n\n10\n\n0\n\n10\n\nwhat better than those to scalar waves. We have also found that the LISA TDI Doppler\nresponses to scalar-longitudinal waves propagating along any of the three LISA arms will\nexperience an amplification proportional to the arm-length. These results, together with\nthe LISA capability for constructing three independent TDI combinations in the high part\nof its observational frequency band, should provide LISA with the capability for assessing the polarization of the waves it will detect. This will be the topic of our forthcoming\ninvestigation.\n\n14\n\n\fScalar L\n\n(e)\n1\n\nTensor\n\n10\n\nVector\n\nScalar T\n0\n\nPRMS(f)/H\n\n10\n\n−1\n\n10\n\n−2\n\n10\n\n−3\n\n10\n\n−4\n\n10\n\n−4\n\n10\n\n−3\n\n−2\n\n10\n\n10\nf(Hz)\n\n−1\n\n10\n\n0\n\n10\n\nAcknowledgments\n\nWe would like to thank Odylio Aguiar and Mario Novello for their kind hospitality at\ntheir institutions while this research was first formulated, and for financial support. We also\nthank Frank B. Estabrook and John W. Armstrong for their constant encouragement during\nthe development of this work. This research was performed at the Jet Propulsion Laboratory, California Institute of Technology, under contract with the National Aeronautics and\nSpace Administration.(c) 2008 California Institute of Technology. Government sponsorship\nacknowledged.\n\n[1] http://www.ligo.caltech.edu/ .\n[2] http://www.virgo.infn.it/ .\n[3] http://www.geo600.uni-hannover.de/ .\n[4] http://tamago.mtk.nao.ac.jp/ .\n[5] S. Detweiler, Ap. J., 234, 1100-1104 (1979).\n[6] J.W. Armstrong, Living Rev. Relativity, 9, (2006). URL (cited on May 20, 2010):\nhttp://www.livingreviews.org/lrr-2006-1 .\n[7] P. Bender, K. Danzmann, & the LISA Study Team, Laser Interferometer Space Antenna for\nthe Detection of Gravitational Waves, Pre-Phase A Report, MPQ233 (Max-Planck- Institüt\n\n15\n\n\fScalar L\n\n(f)\n1\n\nTensor\n\n10\n\nVector\n\nScalar T\n\n0\n\nURMS(f)/H\n\n10\n\n−1\n\n10\n\n−2\n\n10\n\n−3\n\n10\n\n−4\n\n10\n\n−4\n\n10\n\n−3\n\n−2\n\n10\n\n10\nf(Hz)\n\n−1\n\n10\n\n0\n\n10\n\nFIG. 3: Root-Mean-Square responses of the (a) X, (b) α, (c) ζ, (d) E, (e) P , and (f) U TDI combinations to tensor (s = ±2), vector (s = ±1), and scalar (s = 0) gravitational waves. The former\ntwo have been treated as elliptically polarized waves, while the two waveforms characterizing the\nscalar signals have not as they are mutually orthogonal (and therefore independent). The sensitivities have been calculated by assuming an ensemble of sinusoidal signals uniformly distributed\non the celestial sphere and (in the case of tensor and vector radiation) randomly polarized. In\nthe high-part of the frequency band the r.m.s. values of the vector and scalar-longitudinal waves\nare noticeably larger than the tensor and scalar-transverse signals, and grow with the Fourier\nfrequency.\nfür Quantenoptik, Garching), July 1998.\n[8] K.S. Thorne. In: Three Hundred Years of Gravitation, 330-458, Eds. S.W. Hawking, and W.\nIsrael (Cambridge University Press: New York), (1987).\n[9] B.S. Sathyaprakash and B.F. Schutz, Living Rev. Relativity, 12, (2009). URL (cited on August\n27, 2009): http://www.livingreviews.org/lrr-2009-2 .\n[10] A. Nishizawa, A. Taruya, K. Hayama, S. Kawamura, and M. Sakagami, Phys. Rev. D, 79,\n082002 (2009).\n[11] K.J. Lee, F. A. Jenet, and R.H. Price, Ap. J., 685, 1304, (2008).\n[12] C.M. Will, Living Rev. Relativity, 9, (2006), 3 http://www.livingreviews.org/lrr-2006-3.\n\n16\n\n\f−21\n\nX Sensitivity\n\n10\n\nTensor\nVector\n\n−22\n\nScalar T\n\n10\n\nScalar L\n−23\n\n10\n\n(a)\n−24\n\n10\n\n−4\n\n−3\n\n10\n\n−2\n\n10\n\n−1\n\n10\nf(Hz)\n\n0\n\n10\n\n10\n\n−21\n\n10\n\nScalar T\nα Sensitivity\n\nTensor\nVector\n−22\n\n10\n\nScalar L\n\n−23\n\n10\n\n(b)\n−24\n\n10\n\n−4\n\n10\n\n−3\n\n−2\n\n10\n\n10\nf(Hz)\n\n−1\n\n10\n\n0\n\n10\n\n[13] D.M. Eardley, D.L. Lee and A.P. Lightman, Phys. Rev. D, 8, 3308 (1973).\n[14] B.F. Schutz, A First Course in General Relativity, 2nd edition, (Cambridge University\nPress:New York), (2009).\n[15] C. Brans and R.H. Dicke, Phys. Rev., 124, 925 (1961)\n[16] J.A. Casas, J. Garcia-Bellido and M. Quirs, Nucl. Phys. B, 361, 713 (1991).\n[17] M.E.S. Alves, O.D. Miranda and J.C.N. de Araujo, Phys. Lett. B 679, 401 (2009).\n[18] W.L.S. de Paula, O.D. Miranda and R.M. Marinho, Class. Quantum Grav., 21, 4595 (2004).\n\n17\n\n\f−21\n\n10\n\nζ Sensitivity\n\nScalar T\nVector\n−22\n\n10\n\nScalar L\n\nTensor\n−23\n\n10\n\n(c)\n−24\n\n10\n\n−3\n\n−2\n\n10\n\n−1\n\n10\n\n0\n\n10\n\n10\n\nf(Hz)\n\n−21\n\nE Sensitivity\n\n10\n\nTensor\nVector\n−22\n\nScalar T\n\n10\n\nScalar L\n−23\n\n10\n\n(d)\n−24\n\n10\n\n−4\n\n10\n\n−3\n\n−2\n\n10\n\n10\nf(Hz)\n\n−1\n\n10\n\n0\n\n10\n\n[19] C. Talmadge, J.P. Berthias, R.W. Hellings and E.M. Standish, Phys. Rev. Lett., 61 (1988).\n[20] L.S. Finn and P.J. Sutton, Phys. Rev. D, 65, 044022 (2002)\n[21] J.C.N. de Araujo and O.D. Miranda, Gen. Relativ. Gravit., 39, 777 (2007).\n[22] C. W. Helstrom, Statistical Theory of Signal Detection, 2nd ed. (Pergamon Press, London,\n1968).\n[23] F.B. Estabrook and H.D. Wahlquist, Gen. Relativ. Gravit., 6,439 (1975).\n[24] J.W. Armstrong, F.B. Estabrook and M. Tinto, Ap. J., 527, 814 (1999).\n[25] A. Nishizawa, A. Taruya and S. Kawamura, Phys. Rev. D, 81, 104043 (2010).\n\n18\n\n\f−21\n\nP Sensitivity\n\n10\n\nTensor\nVector\n−22\n\nScalar T\n\n10\n\nScalar L\n−23\n\n10\n\n(e)\n−24\n\n10\n\n−4\n\n−3\n\n10\n\n−2\n\n10\n\n−1\n\n10\nf(Hz)\n\n0\n\n10\n\n10\n\n[26] R.W. Hellings, Phys. Rev. D, 17, 3158 (1978).\n[27] H.D. Wahlquist, Gen. Relativ. Gravit., 19, 1101 (1987).\n[28] W.L. Burke, Ap. J., 196, 329 (1975).\n[29] M. Tinto and J.W. Armstrong, Phys. Rev. D, 59, 102003, (1999).\n[30] M.\n\nTinto\n\nand\n\nS.V.\n\nDhurandhar,\n\nLiving\n\nRev.\n\nRelativity,\n\n8,\n\n4,\n\nhttp://www.livingreviews.org/lrr-2005-4\n[31] F.B. Estabrook, M. Tinto, and J.W. Armstrong, Phys. Rev. D, 62, 042002 (2000).\n\n19\n\n(2005).\n\n\f−21\n\nU Sensitivity\n\n10\n\nTensor\nVector\n\nScalar T\n\n−22\n\n10\n\nScalar L\n−23\n\n10\n\n(f)\n−24\n\n10\n\n−4\n\n10\n\n−3\n\n−2\n\n10\n\n10\nf(Hz)\n\n−1\n\n10\n\n0\n\n10\n\nFIG. 4: Sensitivities of the (a) X, (b) α, (c) ζ, (d) E, (e) P , and (f) U TDI combinations to\ngravitational waves with tensor (s = ±2), vector (s = ±1), and scalar (s = 0) components.\nConsistently with Figure (3) we may notice how more sensitive the various TDI combinations\nare to vector and scalar-longitudinal signals than to tensor and scalar-transverse waves in the\nhigh-frequency part of the LISA frequency band. See text for more details.\n\n20\n\n\f"}