{"id": "http://arxiv.org/abs/1108.6321v1", "guidislink": true, "updated": "2011-08-31T18:55:54Z", "updated_parsed": [2011, 8, 31, 18, 55, 54, 2, 243, 0], "published": "2011-08-31T18:55:54Z", "published_parsed": [2011, 8, 31, 18, 55, 54, 2, 243, 0], "title": "The Microwave Air Yield Beam Experiment (MAYBE): measurement of GHz\n  radiation for Ultra-High Energy Cosmic Rays detection", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.5395%2C1108.0153%2C1108.5116%2C1108.2394%2C1108.4954%2C1108.5094%2C1108.4118%2C1108.4717%2C1108.5993%2C1108.6040%2C1108.0740%2C1108.5661%2C1108.4167%2C1108.4317%2C1108.6237%2C1108.5154%2C1108.2601%2C1108.0818%2C1108.1100%2C1108.3513%2C1108.5647%2C1108.4338%2C1108.1763%2C1108.1418%2C1108.0236%2C1108.4486%2C1108.2135%2C1108.3024%2C1108.4096%2C1108.0037%2C1108.1665%2C1108.5935%2C1108.4513%2C1108.2929%2C1108.1429%2C1108.0307%2C1108.5510%2C1108.4533%2C1108.6131%2C1108.5955%2C1108.0374%2C1108.1434%2C1108.5038%2C1108.3928%2C1108.4242%2C1108.1444%2C1108.1997%2C1108.1098%2C1108.5163%2C1108.3215%2C1108.2460%2C1108.2881%2C1108.2258%2C1108.1598%2C1108.2216%2C1108.0674%2C1108.3309%2C1108.3421%2C1108.0450%2C1108.3168%2C1108.5153%2C1108.4738%2C1108.1574%2C1108.4166%2C1108.3833%2C1108.5907%2C1108.4550%2C1108.1019%2C1108.2814%2C1108.4973%2C1108.4033%2C1108.0427%2C1108.1766%2C1108.6321%2C1108.0863%2C1108.3742%2C1108.2314%2C1108.5925%2C1108.1783%2C1108.0497%2C1108.1295%2C1108.2225%2C1108.1905%2C1108.4062%2C1108.2638%2C1108.5057%2C1108.3427%2C1108.5670%2C1108.4307%2C1108.6292%2C1108.4115%2C1108.2329%2C1108.5190%2C1108.5228%2C1108.5599%2C1108.6291%2C1108.4774%2C1108.2532%2C1108.4926%2C1108.1282%2C1108.5743&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Microwave Air Yield Beam Experiment (MAYBE): measurement of GHz\n  radiation for Ultra-High Energy Cosmic Rays detection"}, "summary": "We present first measurements by MAYBE of microwave emission from an electron\nbeam induced air plasma, performed at the electron Van de Graaff facility of\nthe Argonne National Laboratory. Coherent radio Cherenkov, a major background\nin a previous beam experiment, is not produced by the 3 MeV beam, which\nsimplifies the interpretation of the data. Radio emission is studied over a\nwide range of frequencies between 3 and 12 GHz. This measurement provides\nfurther insight on microwave emission from extensive air showers as a novel\ndetection technique for Ultra-High Energy Cosmic Rays.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1108.5395%2C1108.0153%2C1108.5116%2C1108.2394%2C1108.4954%2C1108.5094%2C1108.4118%2C1108.4717%2C1108.5993%2C1108.6040%2C1108.0740%2C1108.5661%2C1108.4167%2C1108.4317%2C1108.6237%2C1108.5154%2C1108.2601%2C1108.0818%2C1108.1100%2C1108.3513%2C1108.5647%2C1108.4338%2C1108.1763%2C1108.1418%2C1108.0236%2C1108.4486%2C1108.2135%2C1108.3024%2C1108.4096%2C1108.0037%2C1108.1665%2C1108.5935%2C1108.4513%2C1108.2929%2C1108.1429%2C1108.0307%2C1108.5510%2C1108.4533%2C1108.6131%2C1108.5955%2C1108.0374%2C1108.1434%2C1108.5038%2C1108.3928%2C1108.4242%2C1108.1444%2C1108.1997%2C1108.1098%2C1108.5163%2C1108.3215%2C1108.2460%2C1108.2881%2C1108.2258%2C1108.1598%2C1108.2216%2C1108.0674%2C1108.3309%2C1108.3421%2C1108.0450%2C1108.3168%2C1108.5153%2C1108.4738%2C1108.1574%2C1108.4166%2C1108.3833%2C1108.5907%2C1108.4550%2C1108.1019%2C1108.2814%2C1108.4973%2C1108.4033%2C1108.0427%2C1108.1766%2C1108.6321%2C1108.0863%2C1108.3742%2C1108.2314%2C1108.5925%2C1108.1783%2C1108.0497%2C1108.1295%2C1108.2225%2C1108.1905%2C1108.4062%2C1108.2638%2C1108.5057%2C1108.3427%2C1108.5670%2C1108.4307%2C1108.6292%2C1108.4115%2C1108.2329%2C1108.5190%2C1108.5228%2C1108.5599%2C1108.6291%2C1108.4774%2C1108.2532%2C1108.4926%2C1108.1282%2C1108.5743&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present first measurements by MAYBE of microwave emission from an electron\nbeam induced air plasma, performed at the electron Van de Graaff facility of\nthe Argonne National Laboratory. Coherent radio Cherenkov, a major background\nin a previous beam experiment, is not produced by the 3 MeV beam, which\nsimplifies the interpretation of the data. Radio emission is studied over a\nwide range of frequencies between 3 and 12 GHz. This measurement provides\nfurther insight on microwave emission from extensive air showers as a novel\ndetection technique for Ultra-High Energy Cosmic Rays."}, "authors": ["M. Monasor", "M. Bohacova", "C. Bonifazi", "G. Cataldi", "S. Chemerisov", "J. R. T. De Mello Neto", "P. Facal San Luis", "B. Fox", "P. W. Gorham", "C. Hojvat", "N. Hollon", "R. Meyhandan", "L. C. Reyes", "B. Rouille D'Orfeuil", "E. M. Santos", "J. Pochez", "P. Privitera", "H. Spinka", "V. Verzi", "C. Williams", "J. Zhou"], "author_detail": {"name": "J. Zhou"}, "author": "J. Zhou", "links": [{"title": "doi", "href": "http://dx.doi.org/10.7529/ICRC2011/V03/0917", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1108.6321v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1108.6321v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 4 figures, published in the proceedings of 32nd\n  International Cosmic Ray Conference (ICRC)", "arxiv_primary_category": {"term": "physics.ins-det", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.ins-det", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ex", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1108.6321v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1108.6321v1", "journal_reference": null, "doi": "10.7529/ICRC2011/V03/0917", "fulltext": "arXiv:1108.6321v1 [physics.ins-det] 31 Aug 2011\n\n32 ND I NTERNATIONAL C OSMIC R AY C ONFERENCE , B EIJING 2011\n\nThe Microwave Air Yield Beam Experiment (MAYBE): measurement of GHz radiation for\nUltra-High Energy Cosmic Rays detection\nM. M ONASOR1 , M. B OH Á ČOV Á2 , C. B ONIFAZI3 , G. C ATALDI4 , S. C HEMERISOV5 , J.R.T. DE M ELLO N ETO3 ,\nP. FACAL S AN L UIS1 , B. F OX6 , P.W. G ORHAM6 , C. H OJVAT7 , N. H OLLON1 , R. M EYHANDAN6 , L.C. R EYES1 ,\nB. ROUILL É D 'O RFEUIL1 , E.M. S ANTOS3 , J. P OCHEZ1 , P. P RIVITERA1 , H. S PINKA5, 6 , V. V ERZI8 , C. W ILLIAMS1 ,\nJ. Z HOU1\n1\nKavli Institute for Cosmological Physics, University of Chicago IL 60637, USA\n2\nInstitute of Physics, Academy of Sciences of the Czech Republic, Prague, Czech Republic\n3\nUniversidade Federal do Rio de Janeiro, Instituto de Fı́sica, Rio de Janeiro, Brazil\n4\nDipartimento di Fisica dell'Università del Salento and Sezione INFN, Lecce, Italy\n5\nArgonne National Laboratory, Argonne, IL, USA\n6\nDepartment of Physics and Astronomy, University of Hawaii at Manoa, Honolulu, HI, USA\n7\nFermilab, Batavia, IL, USA\n8\nUniversità di Roma II \"Tor Vergata\" and Sezione INFN, Roma, Italy\nmonasor@uchicago.edu\nAbstract: We present first measurements by MAYBE of microwave emission from an electron beam induced air plasma,\nperformed at the electron Van de Graaff facility of the Argonne National Laboratory. Coherent radio Cherenkov, a major\nbackground in a previous beam experiment, is not produced by the 3 MeV beam, which simplifies the interpretation of\nthe data. Radio emission is studied over a wide range of frequencies between 3 and 12 GHz. This measurement provides\nfurther insight on microwave emission from extensive air showers as a novel detection technique for Ultra-High Energy\nCosmic Rays.\nKeywords: Ultra-high energy cosmic rays, microwave emission, electron beam experiment.\n\n1\n\nIntroduction\n\nThe possibility of studying air showers induced by cosmic\nrays in the microwave range has motivated the development of several prototypes [1] to study the feasibility of\na new detection technique that would combine the major\nadvantage of the fluorescence technique, i.e. observation\nof the shower development, with a 100% duty cycle and almost negligible atmospheric attenuation. Recent laboratory\nmeasurements [2] have found evidence of coherent broadband microwave emission from a laboratory plasma created ionizing air with high-energy electrons. This emission\nhas been interpreted as molecular bremsstrahlung radiation\nwith a major departure from the steady-state thermal emission limit. This is due to the particular conditions recreated\nin the plasma, i.e specific electron density or geometrical\nconfiguration, that can induce phase-space correlations and\ntherefore enhance the floor level signal.\nDue to the difficulty in quantifying analytically the expected emission and its dependence on electron density, laboratory measurements under different plasma conditions would be desirable. We have performed an\n\naccelerator-based experiment designed to characterize the\nmicrowave emission from a plasma created using a 3 MeV\nelectron beam injected into a RF anechoic chamber of 1\nm3 size. It was carried out at the Van der Graaff accelerator facility at Argonne National Laboratory. A detailed\ndescription of the experiment and first measurements are\ndescribed in this contribution.\n\n2\n2.1\n\nExperimental setup\nElectron beam\n\nThe beam consists of bunches of 3 MeV electrons with adjustable pulse width from 5 ns to 1 ms. The electron current\nand repetition rate can also be adjusted to generate bunches\ncontaining typically from ∼ 1010 to ∼ 1013 electrons. The\ntransverse size of the beam is ∼5 mm and the exit window\nat the end of the beam pipe is a Duraluminum foil of 0.002\"\nthickness. Notice the electron energy is well below the\nthreshold for Cherenkov production in air, a major source\nof background radiation in a previous experiment [2]. A\n\n\fM. M ONASOR et al. MAYBE: MEASUREMENT OF GH Z\n\nRADIATION FOR\n\nUHECR DETECTION\n\npickup coil was placed at the exit window of the beam pipe\nto monitor the beam current.\n\n2.2\n\nAnechoic chamber and antennas\n\nA schematic of the layout is presented in figure 1. The\nbeam enters a copper anechoic Faraday chamber of ∼ 1 m3\nfilled with air that prevents external radiation from getting\ninto the inner antennas. The inner surface is covered with\npyramidal absorbers that provide a minimum of 30 dB absorption at normal incidence for frequencies above 1 GHz.\nA circular port of 3 cm diameter was opened in the chamber to allow the entry of the 3 MeV electrons that otherwise\nwould not penetrate the copper wall. In this configuration,\ntransition radiation generated at the Duraluminum window\nand entering the chamber through this aperture can be a\nsource of background and must be taken into account.\nThree different radio receivers were mounted inside the\nchamber to characterize the microwave emission in a broad\nfrequency spectrum. The first two were commercial Cband (3.4-4.2 GHz) and Ku-band (12.2-12.7 GHz) feeds\nwhich system temperatures and gains were previously calibrated in the lab. The third receiver was a Rohde &\nSchwarz (R&S) HL050 log-periodic antenna. Due to its\nbroadband input frequency (0.85-26.5 GHz) this antenna is\nsuitable to measure the microwave emission over a wide\nspectral range. At the time of this beam test the logperiodic antenna was connected to a 1-2 GHz low noise\namplifier with an average gain of 40 dB so the spectral\nregion studied with this receiver was reduced to what we\ndenominated here low frequency range. All the antennas\nare located in a central plane perpendicular to the beam direction and pointing towards it so the distance beam axisantenna is always ∼0.5 m. Due to the limitation in distance,\nthe response of the receivers could be affected by near-field\neffects. The receivers only measure one polarization at a\ntime. Both polarizations, co-polarized and cross-polarized\nwith the beam axis, can be recorded. C-band, Ku-band and\nlow frequency (0.7-2.4 GHz) receivers were also located\noutside the chamber and close to the beam exit to monitor\nexternal radiation. Signals from all antennas were transmitted to the control room through ∼ 14 m coaxial cables\nthat have an average loss of 0.3 dB per meter in the frequency range of the transmitting signal. Losses from cable,\nadapters and connectors must be properly evaluated to later\ncorrect the recorded signal.\n\n2.3\n\nSimulations\n\nGeant4 simulations reproducing the setup and running conditions were performed in order to characterize the plasma\ncreated inside the chamber. The energy deposit in the\nchamber allows us to get a quantitative idea of the number\nof ionization electrons contained in the generated plasma\nand its density. The left panel of figure 2 shows the energy\ndeposit in the chamber as a function of both longitudinal z\nand transversal x directions (the distribution in y is sym-\n\nFigure 1: Schematic of anechoic chamber and layout of the\nradio receivers.\nmetrical to the one in x) for a typical beam configuration\nwith 2.5 × 109 electrons. The bin area selected to integrate\nthe energy deposit is 1cm x 1cm. As it can be observed, the\nenergy deposit is not uniformly distributed in the chamber\nbut denser in a conical region centered in the beam trajectory with a radius increasing from a few mm to ∼18 cm.\nThe right panel of figure 2 shows the integrated energy deposit as a function of z and its density calculated in cylindrical slices of 1 cm height and radius given by xRMS . This\ndensity, that increases fast in the first portion of the chamber and then remains almost constant, will be proportional\nto the ionization electron density. Assuming all the energy\ndeposit is invested in ionization we obtain typical values\nfor the ionization electron density of ∼ 108 electrons per\ncm3 .\nThe total energy deposit in the chamber calculated over the\nnumber of electrons pulsed in 3ns1 will oscillate for the different running conditions between 1014 and 1015 eV. This\namount of energy deposit is comparable to the total energy\ndeposit at the depth of maximum development by an extensive air shower originated by a cosmic ray of energy ∼ 1018\neV.\n\n3\n\nData acquisition\n\nData were taken both in frequency and time domains using a R&S spectrum analyzer (9 kHz-30 GHz frequency\nrange) and a Tektronix TDS6154C oscilloscope (40 GS/s\nand 20 GHz bandwidth) respectively. Coinciding with the\nbeginning and end of the beam entering the chamber we\nobserved a prompt and strong peak of signal in the logperiodic antenna whose origin is still unknown. A narrower\npeak is also occasionally observed at the beginning of the\n1. the measured signal comes from the contribution of electrons\ninside the chamber at a certain time that can be calculated from\nthe time the electrons need to cross the 1 m long chamber.\n\n\f32 ND I NTERNATIONAL C OSMIC R AY C ONFERENCE , B EIJING 2011\n\n×10\n\n120\n\n3\n\n2200\n\n3000\n\n2000\n1800\n\n2500\n\n200\n\n1600\n\n100\n\n100\n80\n\n0\n-100\n\n60\n\n-200\n\n40\n\n-300\n\n1400\n\n2000\n\n1200\n1500\n\nEdep\n\n1000\n\nEdep density\n\n20\n\n-400\n-500\n-500 -400 -300 -200 -100 0\n\nEdep (MeV)\n\n300\n\nEdep (MeV)\n\nx (mm)\n\n140\n\n400\n\nEdep density (MeV/cm )\n\n3\n\n3\n\n× 10\n\n500\n\n800\n600\n400\n200\n\n500\n\n100 200 300 400 500\nz (mm)\n\n1000\n\n-500 -400 -300 -200 -100\n\n0\n\n100 200 300 400 500\n\nFigure 2: Geant 4 simulations of the energy deposit inside the chamber. Left: Energy deposit as a function of longitudinal\nand transversal dimensions. Right: longitudinal development of energy deposit and its density.\ntrace in the C-band receiver, most noticeable at high beam\nenergies. This effect could be due to some charge deposit\non the chamber or external noise. Apart from this peak,\na clear signal is measured in coincidence with the beam in\nboth receivers. The analysis for the Ku-band antenna is still\nongoing.\n\n4\n\nData analysis\n\nA first step in the analysis of the traces is to select only\nfrequencies in the amplified spectral range using a Fast\nFourier Transform algorithm. Figure 3 show the average\nof 100 traces after selecting the frequency range of interest event by event. For this particular case the beam was\npulsed with a rate of 10 Hz and ∼2μs width. In order to\ndetermine the power measured in the receivers Pmeasured\n(the emitted one relies on a frequency calibration of the absolute gain of the whole system that is still pending) the\nRMS of the recorded voltage over a defined time window\nVRMS is calculated. Then the distribution of VRMS for the\nfiltered traces in the time range of interest is obtained. The\nemitted power is finally calculated as:\n\u0013\n\u0013\n\u0012\n\u0012\n< VRMS >2\n< VRMS >2\n−\nPmeasured =\nR\nR\nbeam\nbkg\n(1)\nwhere the first term is calculated over a time period where\nthe beam is active and stable, and the background contribution comes from the first part of the trace. R is the oscilloscope input impedance equal to 50Ω. No radiation was\nregistered in the antennas when the beam was blocked so\nno additional background subtraction due to emission coming from the accelerator itself is needed.\n\nDue to the beam structure, the described setup is not suitable to study a possible exponential decay of the signal due\nto thermalization processes.\n\n4.1\n\nScan in beam intensity\n\nOne of the goals of the experiment was to measure the proportionality of the recorded signal with beam energy, i.e.\nwith the number of electrons in the beam. The described\nanalysis was applied to traces measured for ∼1μs width\nbeam pulses with an intensity going from ∼5 to 30 μA2 .\nResults for both C-band and log-periodic antennas located\ninside the chamber and averaged over 100 traces are shown\nin figure 4. Both polarizations, co and cross-polarized with\nthe beam direction, were analyzed. Linear fits to the data\nare also shown. Preliminary results indicate a linear dependence on beam energy of the power emitted and a difference between polarizations of ∼ 30% for C-band and\n∼ 60% for the low frequency measurements. This difference could be due to the presence of different processes\nwith different degrees of polarization or to near field effects.\nTo bring some light into the origin of the measured radiation we did another scan in intensity with a thin aluminum\nfoil covering the entry hole in order to block possible contributions from outside radiation. No significant decrease\nin the total energy deposit inside the chamber due to the\nadditional extra layer is expected since beam electrons will\nbe almost unaltered. We are aware transition radiation can\nbe also generated in this new layer but we expect it to be\ndifferent to the one generated at the Duraluminum window\ndue to the different geometries. In the configuration with\nthe hole open, some incidence angles are cut and diffrac2. it corresponds to a beam current between 0.5 and 3 μC per\npulse.\n\n\fOscilloscope Voltage (V)\n\nOscilloscope Voltage (V)\n\nM. M ONASOR et al. MAYBE: MEASUREMENT OF GH Z\n\n0.015\n0.01\n0.005\n0\n\nRADIATION FOR\n\nUHECR DETECTION\n\n0.008\n0.006\n0.004\n0.002\n0\n\n-0.002\n\n-0.005\n\n-0.004\n-0.01\n\n-0.006\n-0.008\n\n-0.015\n-1000\n\n-500\n\n0\n\n500\n\n1000\n\n1500\n\n2000\n\n2500\nTime (ns)\n\n-2500 -2000 -1500 -1000\n\n-500\n\n0\n\n500 1000\nTime (ns)\n\nFigure 3: Average of 100 traces for the C-band (left) and log-periodic (right) antennas after filtering frequencies of interest\nwith a FFT analysis in a trace by trace basis.\n×10-3\n\nPmeasured (mW)\n\nPmeasured (mW)\n\n0.7\n0.6\n0.5\n\n55\n\n×10-6\n\n50\n45\n40\n35\n\n0.4\n\n30\n0.3\n\n25\n\n0.2\n0.1\n0.2\n\n0.3\n\n0.4\n\n0.5\n\n0.6\n\nCross Polarization\n\n20\n\nCo Polarization\n\n15\n\n0.7\n0.8\n0.9\nBeam Intensity (a.u.)\n\nCross Polarization\nCo Polarization\n\n0.2\n\n0.3\n\n0.4\n\n0.5\n\n0.6\n\n0.7\n0.8\n0.9\nBeam Intensity (a.u.)\n\nFigure 4: Evolution of the measured power Pmeasured as a function of beam energy for C-band (left) and log-periodic\n(right) antennas.\ntion effects can take place at the aperture. No significant\ndiscrepancies in Pmeasured , in the dependence with beam\nenergy or in the difference between polarizations were observed. This result could indicate that the measured signal\nis indeed produced inside the chamber.\n\n4.2\n\nSpectrum measurements\n\nMeasurements were also taken in frequency space for both\npolarizations of C-band and low frequency antennas. Even\nthough final results are still pending on an absolute calibration in frequency to correct for the multiple effects involved\nin the data acquisition process, a preliminary analysis of\nthe data shows a spectrum compatible with a continuum\nemission between 1 and 4 GHz. The difference between\npolarizations observed for the integrated spectral range is\nstill present but a study of this discrepancy as a function of\nfrequency is still ongoing.\n\n5\n\nDiscussion and future work\n\nResults presented in this work are preliminary. Final results\nfor the absolute emitted flux, its dependence on frequency\nas well as the scaling to air showers will need a frequency\ncalibration of the whole setup and a better understanding\nof the origin of the measured radiation. For the conditions\nrecreated with a 3 MeV electron beam, the measured signal is consistent with incoherent radiation. The origin of\nthis emission is still unknown due to possible contributions\nfrom transition radiation generated at the window placed at\nexit of the beam. Another beam test is already scheduled to\ncharacterize the emission between 2 and 12 GHz.\n\nReferences\n[1] P. Allison [Pierre Auger Collaboration], these proceedings.\n[2] P. Gorham et al. Phys. Rev. D 78 (2008) 032007.\n\n\f"}