{"id": "http://arxiv.org/abs/0707.2622v1", "guidislink": true, "updated": "2007-07-18T02:09:52Z", "updated_parsed": [2007, 7, 18, 2, 9, 52, 2, 199, 0], "published": "2007-07-18T02:09:52Z", "published_parsed": [2007, 7, 18, 2, 9, 52, 2, 199, 0], "title": "ATCA 1.2 cm Observations of the Massive Star Forming Region G305.2+0.2", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0707.0300%2C0707.4314%2C0707.4146%2C0707.1651%2C0707.3666%2C0707.3324%2C0707.1696%2C0707.0491%2C0707.1338%2C0707.2165%2C0707.3281%2C0707.3891%2C0707.0488%2C0707.3563%2C0707.2827%2C0707.1329%2C0707.3752%2C0707.2478%2C0707.1883%2C0707.2070%2C0707.3771%2C0707.0484%2C0707.3795%2C0707.3105%2C0707.2228%2C0707.0399%2C0707.3996%2C0707.3786%2C0707.1238%2C0707.2045%2C0707.2902%2C0707.3885%2C0707.3681%2C0707.1965%2C0707.2027%2C0707.4031%2C0707.3889%2C0707.1537%2C0707.1351%2C0707.2694%2C0707.2893%2C0707.3833%2C0707.3528%2C0707.2394%2C0707.2147%2C0707.0767%2C0707.0018%2C0707.2936%2C0707.4518%2C0707.0701%2C0707.1352%2C0707.0883%2C0707.3367%2C0707.2622%2C0707.2847%2C0707.2488%2C0707.1830%2C0707.3760%2C0707.3611%2C0707.1878%2C0707.2858%2C0707.0065%2C0707.1989%2C0707.2740%2C0707.2780%2C0707.3420%2C0707.0988%2C0707.1891%2C0707.1332%2C0707.3888%2C0707.0650%2C0707.2664%2C0707.2510%2C0707.2609%2C0707.0392%2C0707.1098%2C0707.3405%2C0707.0679%2C0707.4616%2C0707.2280%2C0707.2481%2C0707.0702%2C0707.1415%2C0707.3291%2C0707.1960%2C0707.2725%2C0707.2136%2C0707.2499%2C0707.2104%2C0707.4393%2C0707.4446%2C0707.2090%2C0707.4502%2C0707.0044%2C0707.1933%2C0707.3861%2C0707.2971%2C0707.0407%2C0707.2441%2C0707.1060%2C0707.0413&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "ATCA 1.2 cm Observations of the Massive Star Forming Region G305.2+0.2"}, "summary": "We report on Australia Telescope observations of the massive star forming\nregion G305.2+0.2 at 1.2 cm. We detected emission in five molecules towards\nG305A, confirming its hot core nature. We determined a rotational temperature\nof 26 K for methanol. A non-LTE excitation calculation suggests a kinematic\ntemperature of order 200 K. A time dependent chemical model is also used to\nmodel the gas phase chemistry of the hot core associated with G305A. A\ncomparison with the observations suggest an age of between 2 x10^4 and 1.5\nx10^5 years. We also report on a feature to the SE of G305A which may show weak\nClass I methanol maser emission in the line at 24.933 GHz. The more evolved\nsource G305B does not show emission in any of the line tracers, but strong\nClass I methanol maser emission at 24.933 GHz is found 3\\arcsec to the east.\nRadio continuum emission at 18.496 GHz is detected towards two \\hii regions.\nThe implications of the non-detection of radio continuum emission toward G305A\nand G305B are also discussed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0707.0300%2C0707.4314%2C0707.4146%2C0707.1651%2C0707.3666%2C0707.3324%2C0707.1696%2C0707.0491%2C0707.1338%2C0707.2165%2C0707.3281%2C0707.3891%2C0707.0488%2C0707.3563%2C0707.2827%2C0707.1329%2C0707.3752%2C0707.2478%2C0707.1883%2C0707.2070%2C0707.3771%2C0707.0484%2C0707.3795%2C0707.3105%2C0707.2228%2C0707.0399%2C0707.3996%2C0707.3786%2C0707.1238%2C0707.2045%2C0707.2902%2C0707.3885%2C0707.3681%2C0707.1965%2C0707.2027%2C0707.4031%2C0707.3889%2C0707.1537%2C0707.1351%2C0707.2694%2C0707.2893%2C0707.3833%2C0707.3528%2C0707.2394%2C0707.2147%2C0707.0767%2C0707.0018%2C0707.2936%2C0707.4518%2C0707.0701%2C0707.1352%2C0707.0883%2C0707.3367%2C0707.2622%2C0707.2847%2C0707.2488%2C0707.1830%2C0707.3760%2C0707.3611%2C0707.1878%2C0707.2858%2C0707.0065%2C0707.1989%2C0707.2740%2C0707.2780%2C0707.3420%2C0707.0988%2C0707.1891%2C0707.1332%2C0707.3888%2C0707.0650%2C0707.2664%2C0707.2510%2C0707.2609%2C0707.0392%2C0707.1098%2C0707.3405%2C0707.0679%2C0707.4616%2C0707.2280%2C0707.2481%2C0707.0702%2C0707.1415%2C0707.3291%2C0707.1960%2C0707.2725%2C0707.2136%2C0707.2499%2C0707.2104%2C0707.4393%2C0707.4446%2C0707.2090%2C0707.4502%2C0707.0044%2C0707.1933%2C0707.3861%2C0707.2971%2C0707.0407%2C0707.2441%2C0707.1060%2C0707.0413&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report on Australia Telescope observations of the massive star forming\nregion G305.2+0.2 at 1.2 cm. We detected emission in five molecules towards\nG305A, confirming its hot core nature. We determined a rotational temperature\nof 26 K for methanol. A non-LTE excitation calculation suggests a kinematic\ntemperature of order 200 K. A time dependent chemical model is also used to\nmodel the gas phase chemistry of the hot core associated with G305A. A\ncomparison with the observations suggest an age of between 2 x10^4 and 1.5\nx10^5 years. We also report on a feature to the SE of G305A which may show weak\nClass I methanol maser emission in the line at 24.933 GHz. The more evolved\nsource G305B does not show emission in any of the line tracers, but strong\nClass I methanol maser emission at 24.933 GHz is found 3\\arcsec to the east.\nRadio continuum emission at 18.496 GHz is detected towards two \\hii regions.\nThe implications of the non-detection of radio continuum emission toward G305A\nand G305B are also discussed."}, "authors": ["Andrew J. Walsh", "Jacqueline F. Chapman", "Michael G. Burton", "Mark Wardle", "T. J. Millar"], "author_detail": {"name": "T. J. Millar"}, "author": "T. J. Millar", "arxiv_comment": "13 pages 11 figures", "links": [{"href": "http://arxiv.org/abs/0707.2622v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0707.2622v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0707.2622v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0707.2622v1", "journal_reference": null, "doi": null, "fulltext": "Mon. Not. R. Astron. Soc. 000, 000–000 (0000)\n\nPrinted 18 November 2018\n\n(MN LATEX style file v2.2)\n\narXiv:0707.2622v1 [astro-ph] 18 Jul 2007\n\nATCA 1.2 cm Observations of the Massive Star Forming\nRegion G305.2+0.2\nAndrew J. Walsh1,2⋆, Jacqueline F. Chapman3,\nMichael\nG. Burton1, Mark Wardle3 and T. J. Millar4\n1\n\nSchool of Physics, University of New South Wales, Sydney, NSW 2052, Australia\nof Maths, Physics and IT, James Cook University, 4814, Australia\n3 Department of Physics, Macquarie University, Sydney, NSW 2109, Australia\n4 Astrophysics Research Centre, School of Mathematics and Physics, Queen's University Belfast, Belfast BT7 1NN, UK\n2 School\n\n18 November 2018\n\nABSTRACT\n\nWe report on Australia Telescope observations of the massive star forming region\nG305.2+0.2 at 1.2 cm. We detected emission in five molecules towards G305A, confirming its hot core nature. We determined a rotational temperature of 26 K for methanol.\nA non-LTE excitation calculation suggests a kinematic temperature of order 200 K. A\ntime dependent chemical model is also used to model the gas phase chemistry of the\nhot core associated with G305A. A comparison with the observations suggest an age\nof between 2 ×104 and 1.5 ×105 years. We also report on a feature to the SE of G305A\nwhich may show weak Class I methanol maser emission in the line at 24.933 GHz. The\nmore evolved source G305B does not show emission in any of the line tracers, but\nstrong Class I methanol maser emission at 24.933 GHz is found 3′′ to the east. Radio\ncontinuum emission at 18.496 GHz is detected towards two HII regions. The implications of the non-detection of radio continuum emission toward G305A and G305B are\nalso discussed.\nKey words: masers – stars: formation – infrared: ISM – ISM: molecules\n\n1\n\nINTRODUCTION\n\nThe study of the early stages of massive star formation\n(MSF) in our Galaxy has, until recently, received relatively\nlittle attention compared to low mass star formation. However, with the advent of telescopes, particularly in the millimetre (mm) and sub-mm part of the electromagnetic spectrum, it has become possible to study the earliest stages of\nMSF. This is the strongest part of their spectral energy distribution (SED) measureable from the ground. It also contains a myriad of complex molecular transitions, allowing\ninvestigation of the physics and chemistry surrounding these\nyoung sources.\nG305.2+0.2 is a site of MSF in the southern Galactic\nplane. Class II methanol masers were reported in two positions by Norris et al. (1993): G305.21+0.21 (G305A) and\nG305.20+0.21 (G305B), separated by approximately 22′′ .\nWalsh et al. (1999) observed this region in the near-infrared\nand found that whilst G305A is not associated with any infrared source, G305B is coincident with a bright and very\nreddened infrared source. More sensitive near-infrared observations by De Buizer (2003) indicate that there is indeed\n⋆\n\nE-mail: andrew.walsh@jcu.edu.au\n\na weak infrared source coincident with G305A, however, it is\nnot clear if it is associated with the maser site or is instead an\nunrelated foreground star. Observations in the mid-infrared\n(10.5 and 20 μm) by Walsh et al. (2001) confirm the infrared\nsource associated with G305B has a steeply rising spectral\nenergy distribution towards longer wavelengths. However,\nno mid-infrared source was found associated with G305A.\nThe Galactic Legacy Infrared Mid-Plane Survey Extraordinaire (GLIMPSE) is a legacy science program of the Spitzer\nSpace Telescope. It confirms the detection of a weak infrared\nsource at the position of G305A at 3.6 and 4.5μm. However,\nthe region shows much extended emission (see Figures 1a\nand 3b), which makes photometry unreliable.\nHill et al. (2005) have detected a strong 1.2 mm continuum source whose peak coincides with G305A (see figure\n1 of Walsh & Burton (2006)). The 1.2 mm map also shows\nsome extended emission in the direction of G305B, but the\nextended emission was poorly resolved. Because G305B appears to dominate the luminosity at shorter wavelengths (up\nto about 20 μm) and G305A appears to dominate at longer\nwavelengths (1.2 mm), there will be a transition point at farinfrared wavelengths where the two sources will have equal\nbrightnesses. Thus, it is impossible to tell which source is the\nmost luminous, based on infrared data alone. Neither maser\n\n\f2\n\nA. J. Walsh et al.\n\nsite is coincident with any detected radio continuum source\n(Phillips et al. 1998a). However, one might be expected from\nG305B, since extrapolation of its SED (Walsh et al. 2001)\nindicates it is powered by a star bright enough to produce an\nobservable ultracompact (UC) HII region. Furthermore, it is\nnot known why the brightest maser site, G305A is not associated with a bright infrared source, nor a radio continuum\nsource and yet appears to be a strong source of continuum\nemission at 1.2 mm.\nWalsh & Burton (2006) found G305A to be the local\npeak of emission for 1–0 transitions of 13 CO, HCO+ and\nN2 H+ , as well as transitions of CH3 CN and CH3 OH. NH3\n(1,1), (2,2) and (4,4) emission has been detected coincident with G305A (Steven Longmore, private communication 2007). This suggests G305A is a hot core and may be\nthe most massive component in the region. The line and\ndust continuum emission appear to be slightly elongated in\nthe direction of G305B. Therefore it appears G305B may be\nassociated with a secondary hot core, which was spatially\nunresolved with the previous observations. Walsh & Burton\n(2006) also identified the possible prestellar massive core\nG305SW, which was only detected in N2 H+ and shows narrow lines, compared to the emission elsewhere in the field\nof view. In this paper we attempt to better understand the\nnature of these sources by investigating both molecular line\nand continuum emission at 1.2 cm.\n\n2.2\n\nUsing the H214C hybrid configuration, we observed G305\nwith baselines ranging from 82 m to 240 m with five antennas. The primary beam for these observations was between 2.0′ and 2.6′ , and the synthesised beam was between 8.6′′ and 11.8′′ . Observations were made with a single point, with pointing centre 13h 11m 6.25s , right ascension and -62◦ 34′ 53′′ declination (J2000). The reason\nfor the different pointing centre to the 2005, May observations was to cover the newly discovered source G305SW\n(Walsh & Burton 2006). We spent a total of 11 hours observing G305 in this configuration, which included time for\nprimary calibration on 1934-638, bandpass calibration on\n0537-441 and phase calibration on 1414-59. We observed in\na frequency-switching mode, with five pairs of spectral line\nfrequencies, the details of which are given in Table 1.\nObservations made in this session have poorer spatial\nand spectral resolution than the 2005, May session. The\nmain implication of this is that the spectral resolution is insufficient to identify most systemic motions, although we are\nable to identify detections and discriminate between emission from G305A and G305B.\n\n3\n2\n\nOBSERVATIONS\n\nObservations towards G305.2+0.2 were carried out using\ntwo configurations of the ATCA in 2005. The first observations took place on 2005, May, 3-4th and utilised the 750A\nconfiguration. The second observations took place on 2005,\nSeptember, 4th and utilised the H214 configuration. Details\nof each observing session are given below.\n2.1\n\n2005, May observations\n\nUsing the 750A configuration, we observed G305 with baselines ranging from 77 to 735 m, with five antennas, and baselines up to 3750 m when including antenna 6. However, data\nfrom antenna 6 were only used when observing masers. The\nprimary beam for these observations was between 2.0′ and\n2.6′ , and the synthesised beam was between 3.2′′ and 4.9′′ ,\nwhen only 5 antennas were used. Observations were made towards a single position, with pointing centre 13h 11m 10.6s ,\nright ascension and −62◦ 34′ 38′′ declination (J2000). We\nspent a total of 12 hours observing G305 in this configuration, which included time for primary calibration on 1934638, bandpass calibration on 1253-055 and phase calibration\non 1414-59. We observed in a frequency-switching mode,\nwith main (spectral line) frequencies being 18199 MHz and\n24932 MHz, which include emission lines of cyanoacetylene\n(HC3 N (2–1)) and the K=2 ladder of methanol (CH3 OH),\nrespectively. Assumed rest frequencies for these lines are\ngiven in Table 1. Each frequency was observed with 256\nchannels over a bandwidth of 16 MHz, resulting in a velocity\nresolution of 1.0 km s−1 and 0.75 km s−1 per channel at the\nHC3 N and CH3 OH line frequencies, respectively. In addition to the spectral lines, continuum emission was observed\nat 18496 MHz with a bandwidth of 128 MHz.\n\n2005, September observations\n\nRESULTS\n\nApproximately half the lines that were searched were detected, and details of these lines are given in Table 2. The table also includes details of those lines that were not detected,\ntogether with their upper limits. Since the 2005 September\nobserving run was conducted using a relatively poor spatial and spectral resolution, we do not know line widths or\nprecise locations for most of the lines detected during this\ntime. In the last column of Table 2, we list the position of\nthe emission and nearest association if it is not found coincident with G305A or G305B. The observations of methanol\nand cyanoacetylene conducted in 2005 May have both higher\nspatial and spectral resolution, and so we report more detailed results on each below.\n\n3.1\n\nCH3 OH (methanol)\n\nThe bandpass covered three lines of methanol during these\nobservations, as listed in Table 1. We find strong, narrow line\nemission from the J=4 line close to the position of G305B,\nbut not coincident (Figure 1). The emission appears to be\noffset from G305B by approximately 3′′ to the east (13 11\n10.89 -62 34 38.5 J2000). In addition to this, weaker emission is seen in all three methanol lines at the position of\nG305A (Figure 1). The methanol emission around G305A\nalso shows extended emission to the south-south-east, extending by approximately 5′′ . This extension, which we refer\nto as G305A(SE), is strongest in the J=4 methanol line, but\nthe other two lines are also detected here. We note also that\nthe J=4 methanol line appears to be very narrow at this\nposition. So the relative methanol line intensities and line\nwidth are reminiscent of a weaker version of the emission\nseen close to G305B.\n\n\fATCA Observations of G305.2+0.2\n\n3\n\nTable 1. Properties of observed lines. The notation for each line in the second column either conforms to the structure of (Jupper –\nJlower ) or (J−K,+K – J−K,+K ).\n\n3.2\n\nDate\n\nObserved\nLine\n\nRest\nFrequency\n(MHz)\n\nPrimary\nBeam\n(′ )\n\nSynthesized\nBeam\n(′′ )\n\nBandwidth\n(MHz)\n\nVelocity\nResolution\n(km s−1 )\n\n2005 MAY 3-4\n\nHC3 N (2–1)\n\n18196.226\n\n2.6\n\n4.9\n\n16\n\n1.0\n\n2005 MAY 3-4\n\nCH3 OH (32,1 – 31,2 ) E\nCH3 OH (42,2 – 41,3 ) E\nCH3 OH (22,0 – 21,1 ) E\n\n24928.700\n24933.470\n24934.380\n\n2.0\n\n3.2\n\n16\n\n0.75\n\n2005 SEP 4\n\nNH3 (1,1)\nNH3 (2,2)\n\n23694.496\n23722.633\n\n2.0\n2.0\n\n9.0\n9.0\n\n32\n32\n\n3.2\n3.2\n\n2005 SEP 4\n\nH2 O (61,6 – 52,3 )\nCH3 OCHO (21,2 – 11,1 ) E\nCH3 OCHO (21,2 – 11,1 ) A\nNH3 (3,2)\n\n22235.080\n22827.741\n22828.134\n22834.185\n\n2.1\n2.1\n2.1\n2.1\n\n9.6\n9.4\n9.4\n9.4\n\n32\n32\n32\n32\n\n3.4\n3.3\n3.3\n3.3\n\n2005 SEP 4\n\nCH3 OH (82,6 – 81,7 ) E\nDC3 N (3–2)\n\n25294.417\n25329.437\n\n1.9\n1.9\n\n8.6\n8.5\n\n64\n64\n\n11.9\n12.0\n\n2005 SEP 4\n\nOCS (2–1)\n\n24325.927\n\n2.0\n\n8.8\n\n64\n\n12.3\n\n2005 SEP 4\n\nCH3 CN (1–0)\n\n18399.892\n\n2.6\n\n11.6\n\n32\n\n4.1\n\n2005 SEP 4\n\nDC3 N (2–1)\nH91β (RRL)\nHC7 N (15–14)\nHC5 N (7–6)\n\n16886.310\n16894.200\n16919.979\n18638.616\n\n2.8\n2.8\n2.8\n2.6\n\n12.7\n12.7\n12.7\n11.5\n\n64\n64\n64\n32\n\n17.8\n17.8\n17.7\n4.0\n\nHC3 N (cyanoacetylene)\n\nWe only detect cyanoacetylene coincident with the position of G305A (Figure 2). The emission appears\nto be unresolved spatially, but is resolved spectrally\nwith a line width of 5.1km s−1 . Cyanoacetylene can be\nformed by neutral–neutral reactions in interstellar space\n(Fukuzawa & Osamura 1997), and so is likely a precursor\nmolecule that is present at the onset of star formation.\nMillar et al. (1997) indicate that cyanoacetylene can also\nbe formed in hot cores. Their models also suggest that the\ncyanoacetylene abundance is greatly reduced after about 105\nyears. Implications of the time-dependant chemistry are discussed further in §5.\n\n3.3\n\nContinuum emission\n\nOur 2005 May data included a frequency (18496 MHz) devoted to continuum emission, with a bandwidth of 128 MHz.\nThe continuum map is shown in Figure 3. Two prominent continuum features appear in the map: the compact\nHII region G305HII (Walsh & Burton 2006), and a similarly\nsized compact HII region about 30′′ to the SE of G305A,\nwhich we call G305HII(SE). We assume that each HII region has its own powering source that is unrelated to either G305A or G305B. This is because there is a large\nseparation between the HII regions and G305A or G305B.\nAlso, the powering source for G305HII appears as a nearinfrared source at the centre of the radio continuum con-\n\ntours (Walsh & Burton 2006). The integrated intensity of\nthe emission from G305HII is 174 mJy and the integrated\nintensity of the emission from G305HII(SE) is 57 mJy. Linefree channels from the 2005 September data can be used\nto reconstruct the fluxes of the HII regions between 16 and\n25 GHz. A plot of the distribution of fluxes with frequency is\nshown in Figure 4. Overall, it appears that the flux remains\nconstant over the frequency range, which is consistent with\noptically thin free-free emission. There are apparent changes\nin flux in both sources which are matched in frequency. This\nis most likely due to errors in the absolute flux calibration,\nwhich precludes us from assessing small changes in the slope\nof the continuum emission. Phillips et al. (1998a) have previously measured the continuum flux of G305HII at 8.6 GHz\nto be 195 mJy, which is also consistent with optically thin\nfree-free emission.\nWe can make an estimate of the type of stars that\ngive rise to these HII regions, using equation (4) of\nKurtz, Churchwell & Wood (1994). Here, we assume the distance to G305 is 3.9 kpc, the electron temperature (Te )\nis 10000 K and a(ν, Te ) = 1. If we also assume that no\nphotons are absorbed by dust within the HII regions, then\nwe find the rate of emission of lyman continuum photons to be 2.7 × 1047 s−1 and 8.8 × 1046 s−1 for G305HII\nand G305HII(SE), respectively. Using the tables of Panagia\n(1973), these rates are equivalent to slightly earlier than a\nB0 spectral type for G305HII and slightly later than a B0\nspectral type for G305HII(SE). If, however, 90% of the lyman photons are absorbed by dust within the HII regions,\n\n\f4\n\nA. J. Walsh et al.\n\nFigure 1. (a) CH3 OH integrated intensity map of the J=4 line. Plus symbols show the positions of the 6.7 GHz CH3 OH maser sites\nG305A and G305B. Contour levels are 0.2, 0.4 and 0.6Jy/beam.km/s. (b) CH3 OH spectrum towards the bright line 3′′ to the east of\nG305B, at 13 11 10.89 -62 34 38.5 (J2000). (c) CH3 OH spectrum towards G305A. (d) CH3 OH spectrum towards G305A(SE), at 13 11\n14.00 -62 34 46.5 (J2000).\n\nFigure 2. (a) HC3 N integrated intensity map. Plus symbols show the positions of the maser sites G305A and G305B. (b) HC3 N spectrum\ntowards G305A. The dotted line is a best fit model to the HC3 N hyperfine structure, holding the optical depth constant at 0.1. Because\nwe do not see any signs of the hyperfine components, we will assume the emission is optically thin.\n\n\fATCA Observations of G305.2+0.2\n\n5\n\nTable 2. Properties of detections and non-detections. The notation for each line either conforms to the structure of (Jupper – Jlower )\nor (J−K,+K – J−K,+K ). Only detections for each transition are reported, except where no detection anywhere was made. In the case\nof a non-detection, then 1σ upper limit for the integrated intensity is given. The last column lists names that are used in the text as a\nreference for the position of the emission.\n\nObserved\nLine\nHC3 N (2–1)\nCH3 OH (32,1 – 31,2 ) E\nCH3 OH (42,2 – 41,3 ) E\nCH3 OH (22,0 – 21,1 ) E\nCH3 OH (32,1 – 31,2 ) E\nCH3 OH (42,2 – 41,3 ) E\nCH3 OH (22,0 – 21,1 ) E\nCH3 OH (32,1 – 31,2 ) E\nCH3 OH (42,2 – 41,3 ) E\nCH3 OH (22,0 – 21,1 ) E\nNH3 (1,1)\nNH3 (2,2)\nOCS (2–1)\nNH3 (3,2)\nH2 O (61,6 – 52,3 )\nH2 O (61,6 – 52,3 )\nH2 O (61,6 – 52,3 )\nCH3 OCHO (21,2 -11,1 ) E\nCH3 OCHO (21,2 -11,1 ) A\nCH3 OH (82,6 – 81,7 ) E\nDC3 N (3–2)\nCH3 CN (1–0)\nDC3 N (2–1)\nH91β (RRL)\nHC7 N (15–14)\nHC5 N (7–6)\n\nPosition\n(J2000)\n13\n13\n13\n13\n13\n13\n13\n\n11\n11\n11\n11\n11\n11\n11\n\n13 11\n13\n13\n13\n13\n13\n13\n13\n\n11\n11\n11\n11\n11\n11\n11\n\n13 11\n\n13 11\n\n13.71 -62\n13.71 -62\n13.71 -62\n13.71 -62\n14.00 -62\n14.00 -62\n14.00 -62\n10.89 -62\n13.71 -62\n13.71 -62\n14.08 -62\n13.71 -62\n13.71 -62\n13.50 -62\n08.29 -62\n10.89 -62\n08.87 -62\n-\n\n34\n34\n34\n34\n34\n34\n34\n\n40.5\n41.0\n41.0\n41.0\n46.5\n46.5\n46.5\n\n34 39.0\n34\n34\n34\n34\n34\n34\n34\n\n41.0\n41.0\n39.0\n41.0\n41.0\n31.0\n45.0\n\n34 39.0\n\n34 41.0\n\nthen these spectral types will be revised to O8 for G305HII\nand O9.5 for G305HII(SE). Note that we use the value of\n90% absorption to illustrate how this affects the spectral\ntype. We do not consider 90% as the most likely figure dust\nover, say 10% or 99%.\nWe do not see any continuum emission associated with\neither of the methanol maser sites G305A or G305B, with a\n3σ detection limit of 0.15 mJy and 0.09 mJy, respectively.\nThis is suprising as both sites are expected to harbour\nmassive stars, which should have detectable radio continuum emission, as is the case for G305HII and G305HII(SE).\nG305A in particular appears to be the concentration for\nstrong millimetre line emission (Walsh et al. 2006, and this\nwork). This leads us to the conclusion that G305A at least,\nand probably G305B, are at a very early stage of evolution where any HII region has not had enough time to form\nand/or expand to an observable size and strength.\n\n4\n4.1\n\nDISCUSSION\nMaser emission in G305.2+0.2\n\nAs well as the two Class II 6.7 GHz methanol maser sites\nG305A and G305B, a number of emission features detected\nin this work may also be masers. Water masers are detected\nat three positions in the field: coincident with G305A, ap-\n\nIntegrated\nIntensity\n(K.km s−1 )\n\nPeak\nVelocity\n(km s−1 )\n\nLine\nWidth\n(km s−1 )\n\nAssociation\n\n9.6\n12.2\n11.8\n9.0\n4.0\n5.3\n2.3\n<1.2\n46\n<1.2\n84\n11\n3.9\n15.0\n18000\n25\n6.3\n<0.11\n<0.11\n130\n<0.03\n<0.05\n<0.03\n3.7\n<0.03\n<0.11\n\n-41.9\n-39.8\n-39.8\n-40.0\n-39.7\n-39.7\n-39.8\n-42.1\n-42\n-39\n-40\n-52\n+4\n-43\n-43\n-\n\n5.1\n5.1\n4.8\n5.9\n2.5\n2.1\n2.9\n<0.75\n<12\n<13\n<3.4\n<3.4\n<3.4\n<12\n<18\n-\n\nG305A\nG305A\nG305A\nG305A\nG305A(SE)\nG305A(SE)\nG305A(SE)\n3′′ E of G305B\nG305A\nG305A\nG305A\nG305A\nG305A\n10′′ N of G305A\n14′′ SW of G305B\n3′′ E of G305B\nG305HII\n-\n\nproximately 10′′ N of G305A and approximately 14′′ SW of\nG305B. This last maser site is coincident with the extended\nradio continuum emission of G305HII (Figure 3). The three\nwater maser features appear over a velocity range of about\n56 km s−1 (Figure 5). It is therefore likely that at least one of\nthese features arises in an outflow, as water masers are commonly found in outflows (eg. Moscadelli, Cesaroni & Rioja\n(2005)), which can give rise to such high velocities.\nThe J=4 and J=8 methanol features exhibit very bright\nand narrow emission about 3′′ to the east of G305B, where\nthe Class II 6.7 GHz methanol maser lies. We suspect that\nboth are Class I methanol masers (Müller, Menten & Mäder\n2004). It is suprising that we see Class I and II methanol\nmasers in close proximity to each other as it is unlikely that\nboth Class I and II masers can be strong in the same place\n(Voronkov et al. 2005). However, we note that the 3′′ projected offset between the two corresponds to 12000 AU (assuming a distance of 3.9 kpc), which is certainly well separated enough that there may be different physical conditions\nat the positions of the Class I and II masers. Figure 1 shows\nthat G305A(SE) is a narrow line emission feature in the J=4\nmethanol line, which may also be a maser. Due to its intrinsic weakness, we cannot rule out the possibility that it is not\na maser, but unusually narrow-lined thermal emission. We\nexplore the possibility that this is thermal emission in the\nnext subsection.\n\n\f6\n\nA. J. Walsh et al.\n\nFigure 4. Continuum flux as a function of frequency for G305HII\nand G305HII(SE). The general trend is a flat distribution, consistent with optically thin free-free emission. The scatter seen in the\npoints is likely due to the errors in the absolute flux calibration\nfor each frequency and is therefore a good representation of the\nerror in the flux of each HII region.\n\nFigure 3. (a) 18496 MHz continuum emission towards G305. The\ntwo 6.67 GHz methanol maser sites G305A and G305B are indicated with the plus symbols. Water masers are indicated with\ndiamond symbols. The contours are at 10, 20, ... 90% of the peak\nflux density, which is 22 mJy/beam. (b) Spitzer 8μm image towards G305. Very strong emission is seen concident with G305B.\nThis creates an artifact that extends to the NE of G305B. No\nemission is seen coincident with G305A.\n\n4.2\n\nThermal CH3 OH (methanol)\n\nFor G305A, integrated intensities of the three thermal\nmethanol lines are listed in Table 2. Assuming the lines\nare optically thin, we can estimate the methanol column\ndensity and rotation temperature using a rotation diagram\nanalysis (Linke, Frerking & Thaddeus 1979), shown in Figure 6. We find a column density of (9.6 ± 4) × 1015 cm−2 and\ntemperature of 26 K. The errorbars shown in Figure 6 are\ndetermined by the relative uncertainty in the line integrated\nintensities. This uncertainty derives from the fit performed\nto each line, as well as the inherent uncertainty in the image\nreconstruction process. However, it does not include an absolute calibration error. We estimate that the error in our flux\ndeterminations is approximately a factor of two, based on\nthe flux calibration of the telescope. The size of this error is\nconfirmed by comparing observations of the J=3 and 4 tran-\n\nFigure 5. Water maser spectra for the three detected features.\nThe strongest feature is shown in the top spectrum and is coincident with G305A. This feature also dominates the emission seen\nin the other spectra. The dotted lines in the middle and bottom\nspectra show a 10-fold increase in the intensity axis, to highlight\nthe two weaker maser features that appear 10′′ to the north of\nG305A (middle) and 14′′ to the SW of G305B (bottom).\n\n\fATCA Observations of G305.2+0.2\n4.3\n\n7\n\nHC3 N (Cyanoacetylene)\n\nCyanoacetylene possesses hyperfine structure in its (2–\n1) transition. However, no hyperfine components were\nobserved, apart from the main two transitions at\n18196.279 MHz. Figure 2 shows a fit to the data, assuming a total optical depth of 0.1. The satellite components do\nnot appear above the modelled spectrum. Therefore, we can\nbe confident the main line cyanoacetylene emission has an\noptical depth less than 0.1 (ie. optically thin).\nGiven the integrated intensity listed in Figure 2, and assuming an excitation temperature of 26 K from the methanol\nmeasurements, we calculate the cyanoacetylene column density is 4.0 × 1014 cm−2 .\n\n4.4\n\nFigure 6. Methanol rotation diagram for G305A (top) and\nG305A(SE) (bottom). For each source, a straight (dashed) line\nis fitted through the three lower temperature transitions (J=2,3\nand 4). The fitted rotational temperature and column density is\ngiven for each line. Whilst the J=8 upper limit is consistent with\nthe fitted line for G305A, it is not possible to fit a line that is consistent with the J=8 upper limit for G305A(SE). The dotted line\nin the lower plot shows a fit through the J=8 line, which results in\na column density of 1.1 ×1017 cm−2 and rotational temperature\nof 78 K.\n\nAmmonia is detected towards G305A as an unresolved\nsource. Because our low spectral resolution data cannot resolve the hyperfine structure of the (1,1) and (2,2) inversion transitions, we are unable to use our data to investigate the optical depth of the ammonia emission. However, higher spectral and spatial resolution ammonia observations (Steven Longmore, private communication 2007) detect (1,1), (2,2) and (4,4) emission coincident with G305A.\nThe (1,1) and (2,2) transitions appear optically thick, so it\nis not possible to derive a reliable ammonia column density.\nThe presence of (4,4) emission, which has an upper energy\nlevel of 200 K above ground, strongly suggests a hot component to G305A.\n\n4.5\n\nsitions of methanol performed during both sessions in May\nand September. In addition to the three detected methanol\nlines, we also observed the 826 − 817 transition of methanol,\nbut failed to detect it. Therefore, we include the upper limit\nfor this transition in Figure 6. We find that the upper limit is\nconsistent the best fit line to the other three points. Because\nthe emission comes from regions which appear unresolved,\nwe do not consider missing flux due to missing short UV\nspacings a significant problem.\nFor G305A(SE), we also fit the three methanol lines\nin Figure 6, as well as the non-detection in the J=8 line.\nHere we find a column density of 1.1 × 1017 cm−2 and a\ntemperature of 78 K. The derived excitation temperature\nfrom the rotation diagram analysis does not have a physical interpretation as a kinetic temperature unless the gas\ndensity is above critical. Hence we perform, in §4.8, a nonLTE analysis to derive column densities and relative abundances. As mentioned in §4.1, the narrow linewidths of the\ndetected methanol transitions at this position are suggestive of maser emission. In addition to this, the methanol\nspectrum at G305A(SE) is similar to the methanol maser\nspectrum 3′′ to the east of G305B – the J=4 feature is the\nstrongest. Such maser emission could explain the unusual results of the rotational diagram analysis for G305(SE) and so\nwe favour the explanation that this is weak maser emission.\n\nNH3 (Ammonia)\n\nOCS (Carbonyl sulfide)\n\nCarbonyl sulfide is detected as an unresolved source towards\nG305A. Assuming an excitation temperature of 26 K, we calculate a column density of 2.5 × 1015 cm−2 for this molecule.\n\n4.6\n\nH91β radio recombination line\n\nThis radio recombination line is detected in the field and\nappears coincident with the HII region G305HII.\n\n4.7\n\nG305SW - a possible prestellar massive core\n\nWalsh & Burton (2006) reported the detection of G305SW\nin N2 H+ , but found it lacking in detectable emission in other\ntracers. They suggested this may be the signature of an extremely young and cold core, potentially prestellar. Unfortunately, G305SW lies just outside the primary beam of our\n2005 May observations, but lies within the primary beam\nfor the 2005 September observations. We found no evidence\nfor emission in any of the tracers from the 2005 September observations. This is not suprising for most of the more\ncomplex molecules, but it is suprising that we did not detect any ammonia associated with G305SW. Since N2 H+\nand ammonia are chemically very similar, we would expect\nthem to trace similar regions.\n\n\f8\n\nA. J. Walsh et al.\n\n4.8\n\nDerivation of column densities\n\nThe column densities listed above were derived with the assumption that the gas is in local thermodynamic equilibrium (LTE). The rotation diagram method used (see for\nexample Figure 5) produces inaccurate temperatures and\ncolumn densities if only limited line data is available (<3\nlines). Moreover, the assumption of LTE is only valid for\nlarge densities. We present below, column densities derived\nfrom a non-LTE analysis of the molecular lines observed in\nTable 2.\nObservations have shown CH3 OH accounts for a\nsignificant fraction of ice mantles relative to H2 O\n(Tielens & Allamandola 1987). It is believed that CH3 OH is\nformed on the surfaces of grains by the hydrogenation of CO\non the grain surface (Charnley et al. 1992). Above temperatures of ∼ 90 − 100 K, all ice species, including CH3 OH will\nbe sublimated from the surfaces of grains. The abundance\nof CH3 OH should therefore increase in the inner warmer regions of hot cores. In §4.2, three CH3 OH lines were analyzed\nwith a rotation diagram and a kinetic temperature of 26 K\nwas derived. However, to release the methanol from the surfaces of grains, the temperature must have been of the order\n90 − 100 K at some earlier time. It seems unlikely that the\ngas would have rapidly cooled to 26K, and we attribute the\nlow 26 K temperature to the inaccurate assumption of LTE.\nIn order to account for the discrepancy in the derived\nlow (26K) temperature using the rotation diagram analysis\nof the CH3 OH lines, we present below the results from a nonLTE radiative transfer model. A new analysis of the molecular lines in Table 2 produces new column density values and\ntemperatures, which agree better with our understanding\nof the underlying physics and chemistry (see also §5). For\nthis calculation, molecular data from Schöier et al. (2005) is\nused which includes energy levels, statistical weights, transition frequencies as well as collisional rate coefficients (for\ncollisions with H2 ), for each species of interest. In particular, we use CH3 OH rates from Pottage, Flower & Davis\n(2004), NH3 rates from Danby et al. (1988), OCS rates\nfrom Green & Chapman (1978) and Schöier et al. (2005)\nand HC3 N rates from Green & Chapman (1978). The calculation is similar to that of Schöier et al. (2005), and calculates the strength of the emission line for a species and\ntransition of interest, for a given density, temperature and\ncolumn density.\nTo derive a column\nR density for a given species, the integrated line intensity, TR∗ dv in K.km/s, is found as a function of both density (nH2 ) and column density. The source\nis assumed to fill the beam. Initially we assume some temperature and the line width for each line of interest is taken\nfrom the observations in Table 2. The constant contour of\nthe observed integrated line intensity can then be traced.\nThis will usually give an upper or lower limit to the column\ndensity. With more than one line, it is often possible to simultaneously derive both a column density and density, for\na given temperature.\nFigure 7a shows a plot of the integrated intensity as a\nfunction of nH2 and column density assuming a temperature\nof 26 K for the CH3 OH(42,2 − 41,3 )E line from Table 2, with\na FWHM of 4.8 km s−1 . The observed 11.8 K km s−1 contour is plotted as a dashed line. As the density is increased\nand LTE approached, the intensity becomes constant with\n\nFigure 7. Contours of integrated intensity for rotational\nmethanol transitions. (a) Integrated intensity of the CH3 OH 42,2 –\n41,3 transition calculated using a non-LTE theoretical model assuming a temperature of T=26 K. The constant contour which\ndescribes the observed intensity from Table 2 is plotted as the\ndashed line. (b) Comparison of the CH3 OH 42,2 –41,3 observed\nintensity from panel (a) with the CH3 OH 22,0 –21,1 and 32,1 –31,2\ntransitions calculated in a similar way for T=26 K using the values from Table 2. (c) and (d) are similar to panel (b), but for\ntemperatures of 100 K and 200 K, respectively.\n\n\fATCA Observations of G305.2+0.2\n\n9\n\nTable 3. Observations G305A from Steven Longmore (private\ncommunication 2007).\nObserved line\n\nIntegrated Intensity\n(K km s−1 )\n\nLine Width\n(km s−1 )\n\nNH3 (1,1)\nNH3 (2,2)\nNH3 (4,4)\n\n33.58\n23.05\n22.23\n\n5.5\n5.1\n7.9\n\ncolumn density. Hill et al. (2005) report a density of the order nH2 ∼ 1 − 2 × 104 cm−3 , implying a column density of\n∼ 4 × 1016 cm−2 from Figure 7a. However, the two other\nlines observed for CH3 OH can be used to further restrict\nthe column density.\nIn Figure 7b, the corresponding constant contours of\neach observed integrated line intensity for all three CH3 OH\nlines are over-plotted. All three lines overlap and agree for\nnH2 > 106 cm−3 , yielding the LTE limit of the column\ndensity. Since the observations of Hill et al. (2005) suggest\na lower density, it is likely that the gas is not in LTE.\nIn Figures 7c and 7d, the same lines are over-plotted assuming temperatures of 100K and 200K. In each of these\ncases, there is agreeement for densities and column densities in the ranges 1.8 × 104 cm−3 < nH2 < 8 × 104 cm−3 and\n7.9 × 1015 cm−2 < N < 2.0 × 1016 cm−2 respectively. Since all\nthree lines agree for both temperatures, this method does\nnot constrain the temperature. However, as previously mentioned, temperatures of 90 K or more are expected to evaporate CH3 OH off grain surfaces, and so we favour a temperature of at least 100 K.\nHigh spectral and spatial resolution ammonia observations have been carried out (Steven Longmore, private communication 2007) for the (1,1), (2,2) and (4,4) lines. The\ndetails of the detection of these lines coincident with G305A\nare given in Table 3. A similar analysis to that of Figure 7\nfor the three NH3 lines is shown in Figure 8. In Figure 8a,\nthe temperature is 26 K, and clearly there is no agreement\nbetween the NH3 (4,4) line and the other two lines. However,\nif the temperature is increased, as in Figures 8b and 8c then\nthere is closer agreement. The value derived from these plots\nfor the column density is a little ambiguous since the (1,1)\nand (2,2) contours only converge as nH2 decreases, so we\nonly quote a lower limit of NNH3 > 1015 cm−2 . However, it\nis important to note that the observation of the NH3 (4,4)\nstrongly suggests that there is a temperature in excess of\n100 K.\nWe note that densities of 1.8 × 104 − 8 × 104 cm−3\nare unusually low for traditional hot core densities (∼\n106 cm−3 ). However, complex organic molecules are seen\nin extended emission in SgrB2 and in the central molecular zone (Requena-Torres et al. 2006). Requena-Torres et al.\n(2006) find that these molecules, including CH3 OH, can have\nlow excitation temperatures (10-20 K) despite high kinetic\ntemperatures (∼100 K) and cold dust (<20 K) because the\ndensity is low (∼ 104 cm−3 ). They argue that shocks remove\nmantle material and drive 'hot core' type chemistry. So low\nexcitation temperatures may not necessarily reflect cold gasphase chemistry.\nWe cannot do a complete analysis of OCS and HC3 N,\nwith only single transitions for each. However we can give\n\nFigure 8. Contours of integrated intensity for rotational ammonia transitions. (a) Integrated intensities of the NH3 rotation\ntransitions (1,1), (2,2) and (4,4) calculated using a non-LTE theoretical model assuming a temperature of T=26 K. The chosen\ncontours are taken from the observed intensities of Table 3. In\npanels (b) and (c) the same comparisons are made, assuming\ntemperatures of 100 K and 200 K, respectively.\n\nnew values assuming densities in the range 1.8 × 104 cm−3 <\nnH2 < 8 × 104 cm−3 . Figure 9 shows the OCS(2–1) and\nHC3 N(2–1) lines plotted for 100K and 200K. For densities\nin the range 1.8 × 104 cm−3 < nH2 < 8 × 104 cm−3 , we can\nput limits on the column densities, which are given in Table\n4 for 100K, along with the other non-LTE values for NH3\nand CH3 OH. We note that column densities derived here\ncompare well to those derived in sections 4.2, 4.3 and 4.5,\nwhich assume LTE. This indicates that column densities derived under the assumption of LTE, at least in the case of\nG305A, may provide reasonable estimates of the true column density.\n\n\f10\n\nA. J. Walsh et al.\n\nFigure 9. Contours of integrated intensity for rotational OCS\nand HC3 N transitions. (a) Integrated intensities of the OCS (2–\n1) and HC3 N rotation transitions calculated using a non-LTE\ntheoretical model assuming a temperature of T=100 K. The chosen contours are taken from the observed intensities of Table 2.\n(b) the same transitions are presented as in panel (a), but with a\ntemperature of 200 K.\n\nTable 4. Column densities for G305A from §4.8, for 1.8 ×\n104 cm−3 < nH2 < 8 × 104 cm−3 .\nMolecule\n\nColumn Density (cm−2 )\n\nCH3 OH\nNH∗3\nOCS(100K)\nOCS(200K)\nHC3 N(100K)\nHC3 N(200K)\n\n7.9 × 1015 cm−2 < N < 2.0 × 1016 cm−2\n> 1015\n4.0 × 1015 < NOCS < 6.3 × 1015\n5.6 × 1015 < NOCS < 9.5 × 1015\n2.0 × 1014 < NHC3 N < 6.3 × 1014\n2.8 × 1014 < NHC3 N < 6.3 × 1014\n\n∗ value\n\n5\n\nderived from observations of Steven Longmore (private\ncommunication, 2007).\n\nTIME-DEPENDENT CHEMISTRY\n\nThe analysis in section 4, in particular the detection of the\nNH3 (4,4) line, strongly suggest that G305A has a hot component with a temperature of the order 100 – 200 K. We\nwill therefore now model the chemistry of G305A, based on\nthe assumption that it is a hot core. The time dependent\nchemistry of a spherical core, representative of G305A, will\nbe calculated below and the observations will be discussed\nin light of these results. A molecule found inside a hot core\nmay be present due the following three processes: if it is either formed by cold chemistry in the earlier core collapse\nphase then accreted onto a grain and re-released inside the\nhot core, formed by grain surface chemistry and released, or\nformed in the gas phase chemistry of the hot core. Although\n\nFigure 10. Time dependent column densities for the four species\nof interest, as calculated from a spherical hot core chemical model\nof G305A as described in §5. A constant density is assumed,\nnH2 = 1.8 × 104 cm−3 , with a temperature of 100 K (top panel) or\n200 K ( bottom panel). A comparison of a species column density\nconstrains the age of the core. The grey shaded bar illustrates the\nage range of the core derived in comparing the observed column\ndensities given in Table 4.\n\nthe mantle compositions are relatively simple e.g. CH3 OH\nand NH3 , the release of these into the gas phase are believed\nto be the drivers of the very complex chemistry observed in\nhot cores. The relative abundances of the mantle species,\nalong with varying densities and temperatures can lead to\nchemical differences among cores.\nWe now attempt to model the gas phase chemistry of\nG305A. We assume the core is spherical with a density\nnH2 = 1.8 × 104 cm−3 and nH2 = 8 × 104 cm−3 based on\nthe analysis in section 4.8, and a radius of 1.1 pc (Hill et al.\n2005). The model is run twice with constant temperatures\nthroughout of 100 K and 200 K. We use a model similar to\nMillar et al. (1997), which consists of 22 depth points, or\nshells, each with a specified density and temperature. Column densities are calculated by integrating along lines of\nsight, and to account for beam dilution, the column densities are weighted and summed over a gaussian beam (eg.,\nThompson, Macdonald & Millar 1999). The source is assumed to fill the beam. 211 species are chosen with 2575\nreactions and rate coefficients, taken from the online UMIST\ndatabase (Le Teuff et al. 2000).\nThe initial abundances are taken from Table 2 of\nMillar et al. (1997) which assumes that the gas is mostly\n\n\fATCA Observations of G305.2+0.2\n\n11\n\nTable 5. The initial abundances, with respect to H nuclei, assumed\nin the chemical model\n\nFigure 11. Column densities from the spherical core model,\nsimilar to Figure 10, but with the density increased to nH2 =\n8 × 104 cm−3 .\n\nmolecular with some ionization by cosmic rays. Assuming spontaneous evaporation from grain surfaces, there are\nalso the primary injected mantle molecules CH3 OH, NH3 ,\nC2 H2 ,C2 H4 ,C2 H6 ,CH4 , H2 CO, CO2 , O2 , H2 O, H2 S. Ice absorbtion spectra towards massive young stellar objects suggest that OCS should also be included as a mantle species\n(Keane et al. 2001). We also find that an initial abundance\nof OCS is needed in the model to generate an OCS abundance that resembles the observations, the gas phase chemistry alone cannot produce the observed column density (see\nthe discussion for Figures 10 and 11 below). The initial abundances are given in Table 5 which are based on the models of\nMillar et al. (1997) and Nomura and Millar (2004). The initial conditions are also chosen so that the total abundance of\nC, N and O do not exceed with the mean interstellar values;\nC/H = 1.4 × 10−4 , O/H= 3.19 × 10−4 and N/H = 7.5 × 10−5\n(Cardelli et al. 1996; Meyer et al. 1997, 1998). It should be\nnoted that differences in the mantle chemistry and choice of\ninitial abundances could drive a different gas phase chemistry, this will be considered in future papers, and is outside\nthe scope of the current work.\nThe model results are presented in Figures 10 and 11 for\nnH2 = 1.8 × 104 cm−3 and nH2 = 8 × 104 cm−3 , respectively.\nThe column densities of the four species of interest are plotted as a function of time since the onset of the core heating.\nIn each figure the chemical model has been run twice assuming temperatures of 100 K and 200 K. By comparing the\n\nSpecies\n\nAbundance\n\nSpecies\n\nAbundance\n\nCH3 OH\nNH3\nH2 S\nH2 O\nO2\nH2 CO\nCO\nHe+\nH+\n3\nFe+\n\n5 × 10−7\n1 × 10−5\n1 × 10−6\n1 × 10−5\n1 × 10−6\n4 × 10−8\n5 × 10−5\n2.5 × 10−11\n1 × 10−8\n2.4 × 10−8\n\nC2 H 2\nC2 H 4\nC2 H 6\nCH4\nCO2\nOCS\nN2\nH+\nSi+\n\n5 × 10−7\n5 × 10−9\n5 × 10−9\n2 × 10−7\n5.0 × 10−6\n5.0 × 10−8\n2 × 10−7\n1 × 10−10\n3.6 × 10−8\n\ncolumn densities for each species in Table 4, derived from the\nobserved emission lines in Table 2, the chemical model can\nbe used to constrain both the temperature and age of the\ncore. In the gas phase, the production of CH3 OH is very inefficient (eg. Woodall et al. (2007)); going via radiative association of CH+\n3 and H2 O at a low rate (Luca, Voulet & Gerlich\n2002), while Geppart et al. (2006) have recently shown that\nthe fraction of dissociative recombinations which produce\nmethanol are of the order 3%. From the methanol column\ndensity limits quoted in Table 4, upper age limits are derived in Figure 11 for nH2 = 8 × 104 cm−3 ; 3.1 × 104 years\nfor 100 K and 2 × 104 years from 200 K. The lower density\nnH2 = 1.8×104 cm−3 cases of Figure 10 do little to constrain\nthe age since NCH3 OH < 7.9 × 1015 cm−2 . From the NH3 observations, both Figures 10 and 11 give upper age limits of\n1.6 × 105 years.\nThe column density of HC3 N indicates either, a minimum age of ∼ 104 years, or an age of 105 years. We favor the\nlater time based on the NH3 comparisons discussed above.\nAs noted by Millar et al. (1997), HC3 N is usually regarded\nas a cold cloud tracer, however it is formed in a hot gas\nthrough reactions of N and C3 H2 and C2 H2 with CN, where\nC2 H2 is evaporated from grain mantles. This suggests that\nHC3 N should be a useful species to trace the conditions and\nages of hot cores. The highly variable HC3 N abundance with\ntime, in Figures 10 and 11, further supports the use of HC3 N\nas a 'chemical clock' species.\nThe OCS column densities quoted in Table 4 are >\n4 × 1015 cm−3 , which is higher than the maximum OCS column density for all cases. The observed OCS abundance can\nbe reproduced in the model if the initial abundance of OCS\nwas increased. For simplicity, we assumed the OCS abundance from Nomura and Millar (2004) based on their model\nof G34.3+0.15, and so it is highly possible that the initial\nOCS abundance was greater for G305A. We will examine the\neffects of changes in the model for varying initial conditions\nin future papers. It is important to note that if no initial\nabundance of OCS is assumed in the model, then the gas\nphase chemistry only produces a OCS column density of the\norder 4 × 1013 cm−2 (plots not shown here), which strongly\nsuggests that the origin of the OCS is the evaporated ice\nmantles. Moreover, OCS has been detected in ice-absorbtion\nfeatures of massive protostars (Keane et al. 2001).\nIt is important to note that the column densities of\nNH3 and HC3 N give similar core ages, ∼ 105 years, for each\n\n\f12\n\nA. J. Walsh et al.\n\nof the 4 cases plotted in Figures 10 and 11. However, the\ndetermination of the temperature and density is still a little\nambiguous. There is better agreement for NH3 and HC3 N\ntimes for the denser hotter case. Moreover, the NH3 observations (Steven Longmore, private communication 2007)\ndiscussed in §4.8 ( in particular Figure 8) suggest higher\ntemperatures of the order 200 K. We therefore favor the high\ndensity 8 × 104 cm−3 and 200 K case, suggesting a core age\nin the range 2 × 104 < tcore < 1.5 × 105 years.\n\nACKNOWLEDGMENTS\nWe would like to thank the anonymous referee who has\nhelped improve the quality of this work. We would like\nto thank Andrej Sobolev for helpful discussions. We would\nalso like to acknowledge the work of Steven Longmore who\nhelped with discussions and data of ammonia. The Australia Telescope is funded by the Commonwealth of Australia for operation as a National Facility managed by\nCSIRO. This research was supported under the Australian\nResearch Council's Discovery funding scheme (project number DP051893). Astrophysics at QUB is supported by a\ngrant from PPARC.\n\nREFERENCES\n6\n\nCONCLUSIONS\n\nWe have observed the massive star forming region\nG305.2+0.2 at 1.2 cm. We detected emission in methanol,\ncyanoacetylene, ammonia, carbonyl sulfide and water, as\nwell as the radio recombination line H91β. All molecular\ntransitions are detected towards G305A, which confirms the\nhot core nature of this source. Three lines of methanol are\nfound in emission at the position of G305A, and together\nwith a fourth transition which was not detected, we have\nconstructed a rotational diagram where we derive a rotational temperature of 26 K and a column density of 9.6\n×1015 cm−2 for methanol. However, because methanol requires temperatures in excess of 90 K to evaporate from dust\ngrains, we find the temperature unrealistic and attribute this\nto the incorrect assumption of LTE. With a non-LTE analysis of G305A, we derive a model which is consistent with\na density of 8 × 104 cm−3 , and a temperature of the order\n200 K. A gas phase time dependent chemical model further\nconstrains the age of the core to 2 × 104 < tcore < 1.5 × 105\nyears.\nExtended emission to the SE of G305A is seen in three\nmethanol transitions. It has a narrow line width and an\nunusually high rotational temperature (78 K). We interpret\nthis as evidence that the emission may be a weak maser.\nStrong methanol maser emission is found 3′′ to the east\nof G305B. Since the methanol transition at 24.933 GHz is a\nClass I maser, G305B appears to be a unique object worthy of further investigation as it shows both Class I and II\nmethanol maser emission within a small region. No other\ndetections were made at the position of G305B. Since it is\nalso known to be a luminous source, the lack of molecular\nemission suggests G305B is an older source that has already\nhad time to clear out its surrounding molecular material.\nRadio continuum emission at 18.496 GHz is detected\ntowards two HII regions (G305HII and G305HII(SE)).\nG305HII shows a cometary morphology and is probably powered by a star in the range O8 to B0, whereas\nG305HII(SE) shows a shell morphology and is probably\npowered by a star in the range O9.5 to B0.\nNo radio continuum emission was detected towards either G305A or G305B. For the case of G305A, this may be\nbecause the source is too young to have produced an observable HII region. However, it is not clear why the older, and\ninfrared-luminous, source G305B does not show any radio\ncontinuum emission.\n\nAndré, P., Ward-Thompson, D. & Barsony, M. 1993, ApJ,\n406, 122\nBergin, E. A., Ungerechts, H., Goldsmith, P. F., Snell, R.\nL., Irvine, W. M. & Schloerb, F. P. 1997, ApJ, 482, 267\nCardelli, J.A., Meyer, D.M., Jura, M., Savage B.D. 1996,\nApJ, 467, 334\nCharnley, S. B. 1997, ApJ, 481, 396\nCharnley S.B., Tielens A.G.G.M., Millar T.J. 1992, ApJ,\n399,L71\nCragg, D. M., Sobolev, A. M. & Godfrey, P. D. 2002, MNRAS, 331, 521\nDanby, G., Flower, D. R., Valiron, P., Schilke, P. & Walmsley, C.M. 1988, MNRAS, 235, 229\nDe Buizer, J. M. 2003, MNRAS, 341, 277\nDickman, R. L. 1978, ApJS, 37, 407\nForveille, T., Guilloteau, S., & Lucas, R. 1989, CLASS\nManual (Grenoble: IRAM)\nFukuzawa, K. & Osamura, Y., 1997, ApJ, 489, 113\nGeppert,W. D., Hamberg, M., Thomas, R. D., Osterdahl,\nF., Hellberg, F., Zhaunerchyk, V., Ehlerding, A., Millar,\nT.J., Roberts, H., Semaniak, J., af Ugglas, M., Kallberg,\nA., Simonsson, A., Kaminska, M. & Larsson, M., 2006,\nFaraday Discuss. 133, 177\nGreen, S. & Chapman, S. 1978, ApJS, 37, 169\nHartquist, T. W., Dalgarno, A. & Oppenheimer, M. 1980,\nApJ, 236, 182\nHatchell, J., Thompson, M. A., Millar, T. J. & MacDonald,\nG. H., 1998, MNRAS, 338, 713\nHill, T., Burton, M. G., Minier, V., Thompson, M. A.,\nWalsh, A. J., Hunt-Cunningham, M. & Garay, G. 2005,\nMNRAS, 363, 405\nKeane, J. V., Tielens, A. G. G. M., Boogert, A. C. A.,\nSchutte, W. A., Whittet, D. C. B. 2001, A&A, 376, 254\nKeto, E. 2003, ApJ, 599, 1196\nKurtz, S., Churchwell, E. & Wood, D. O. S. 1994, ApJS,\n91, 659\nLe Teuff Y. H., Millar T. J. & Marwick A. J. 2000, A&AS,\n157, 146\nLinke, R. A., Frerking, M. A. & Thaddeus, P. 1979, ApJ,\n234, L139\nLuca, A., Voulet, D. & Gerlich, D., 2002, WDSO2 Proceedings of Contributed papers, Part II, 294\nMeyer, D. M., Cardelli, J. A. & Sofia, U. J. 1997, ApJ, 490,\nL103\nMeyer, D. M., Jura, M. & Cardelli, J. A. 1998, ApJ, 493,\n222\n\n\fATCA Observations of G305.2+0.2\nMillar T. J., Macdonald G. H., & Gibb A. G. 1997, A&A,\n325, 1163\nMinier, V., Ellingsen, S. P., Norris, R. P. & Booth, R. S.\n2003, A&A, 403, 1095\nMoscadelli, L., Cesaroni, R. & Rioja, M. J., 2005, A&A,\n438, 889\nMüller, H. S. P., Menten, K. M. & Mäder, H., 2004, A&A,\n428, 1019\nNomura, H. & Millar, T. J. 2004, A&A, 414, 409\nNorris, R. P., Whiteoak, J. B., Caswell, J. L., Wieringa, M.\nH. & Gough, R. G., 1993, ApJ, 412, 222\nPanagia, N. 1973, AJ, 78, 929\nPhillips, C. J., Norris, R. P., Ellingsen, S. P. & McCulloch,\nP. M. 1998a, MNRAS, 300, 1131\nPirogov, L., Zinchenko, I., Caselli, P., Johansson, L. E. B.\n& Myers, P. C. 2003, A&A, 405, 639\nPottage, J. T., Flower, D. R. & Davis, S. L. 2004, MNRAS,\n352, 39\nRequena-Torres, M. A., Martı́n-Pintado, J., Rodrı́guezFranco, A., Martı́n, S., Rodrı́guez-Fernández, N. J. & de\nVicente, P. 2006, A&A, 455, 791\nSchöier, F. L., van der Tak, F. F. S., van Dishoeck E. F. &\nBlack, J. H. 2005, A&A 432, 369\nTafalla, M., Myers, P. C., Caselli, P., Walmsley, C. M. &\nComito, C. 2002, ApJ, 569, 815\nTielens A. G. G. M. & Allamandola L. J. 1987, in Physical\nProcesses in Interstellar Clouds, ed. G.E. Morfill and M\nScholer, Dordrecht: Kluwer, 333\nThompson M. A., Macdonald G. H., Millar T. J. 1999,\nA&A, 342, 809\nUngerechts, H., Bergin, E. A., Goldsmith, P. F., Irvine, W.\nM., Schloerb, F. P., & Snell, R. L. 1997, ApJ, 482, 245\nVoronkov, M. A., Sobolev, A. M., Ellingsen, S. P. & Ostrovskii, A. B., 2005, MNRAS, 362, 995\nWalsh, A. J., Burton, M. G., Hyland, A. R., Robinson, G.,\n1998, MNRAS, 301, 640\nWalsh, A. J., Burton, M. G., Hyland, A. R. & Robinson,\nG. 1999, MNRAS, 309, 905\nWalsh, A. J., Bertoldi, F., Burton, M. G. & Nikola, T. 2001,\nMNRAS, 326, 36\nWalsh, A. J. & Burton, M. G. 2006, MNRAS, 365, 321\nWoodall, J., Agundez, M., Markwick-Kemper, A.J. & Millar, T.J., 2007, A&A, in press\n\n13\n\n\f"}