{"id": "http://arxiv.org/abs/1107.3014v1", "guidislink": true, "updated": "2011-07-15T09:02:29Z", "updated_parsed": [2011, 7, 15, 9, 2, 29, 4, 196, 0], "published": "2011-07-15T09:02:29Z", "published_parsed": [2011, 7, 15, 9, 2, 29, 4, 196, 0], "title": "A combined high-pressure experimental and theoretical study of the\n  electronic band-structure of scheelite-type AWO4 (A = Ca, Sr, Ba, Pb)\n  compounds", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1107.6039%2C1107.0072%2C1107.4186%2C1107.5028%2C1107.1995%2C1107.5910%2C1107.3874%2C1107.2909%2C1107.1766%2C1107.3014%2C1107.2622%2C1107.3267%2C1107.5814%2C1107.1117%2C1107.4986%2C1107.3135%2C1107.0374%2C1107.5288%2C1107.3891%2C1107.1609%2C1107.5072%2C1107.0190%2C1107.4489%2C1107.2163%2C1107.6035%2C1107.3819%2C1107.0770%2C1107.0013%2C1107.5935%2C1107.1188%2C1107.0546%2C1107.2283%2C1107.1832%2C1107.1647%2C1107.2188%2C1107.5996%2C1107.3288%2C1107.0548%2C1107.3448%2C1107.5716%2C1107.3880%2C1107.2302%2C1107.2642%2C1107.1071%2C1107.2203%2C1107.4019%2C1107.1622%2C1107.4069%2C1107.1477%2C1107.0165%2C1107.4329%2C1107.1938%2C1107.0216%2C1107.3178%2C1107.1443%2C1107.1355%2C1107.1103%2C1107.5369%2C1107.4432%2C1107.5856%2C1107.5174%2C1107.5273%2C1107.3381%2C1107.4490%2C1107.5395%2C1107.3658%2C1107.1905%2C1107.3671%2C1107.4145%2C1107.2762%2C1107.0526%2C1107.4016%2C1107.2820%2C1107.5318%2C1107.5997%2C1107.2377%2C1107.2822%2C1107.0629%2C1107.4704%2C1107.1038%2C1107.1175%2C1107.0886%2C1107.0806%2C1107.1610%2C1107.5244%2C1107.0209%2C1107.5949%2C1107.5348%2C1107.2987%2C1107.0951%2C1107.1822%2C1107.2294%2C1107.5358%2C1107.2459%2C1107.1068%2C1107.2413%2C1107.3213%2C1107.2722%2C1107.5122%2C1107.1009%2C1107.2420&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A combined high-pressure experimental and theoretical study of the\n  electronic band-structure of scheelite-type AWO4 (A = Ca, Sr, Ba, Pb)\n  compounds"}, "summary": "The optical-absorption edge of single crystals of CaWO4, SrWO4, BaWO4, and\nPbWO4 has been measured under high pressure up to ~20 GPa at room temperature.\nFrom the measurements we have obtained the evolution of the band-gap energy\nwith pressure. We found a low-pressure range (up to 7-10 GPa) where\nalkaline-earth tungstates present a very small Eg pressure dependence (-2.1 <\ndEg/dP < 8.9 meV/GPa). In contrast, in the same pressure range, PbWO4 has a\npressure coefficient of -62 meV/GPa. The high-pressure range is characterized\nin the four compounds by an abrupt decrease of Eg followed by changes in\ndEg/dP. The band-gap collapse is larger than 1.2 eV in BaWO4. We also\ncalculated the electronic-band structures and their pressure evolution.\nCalculations allow us to interpret experiments considering the different\nelectronic configuration of divalent metals. Changes in the pressure evolution\nof Eg are correlated with the occurrence of pressure-induced phase transitions.\nThe band structures for the low- and high-pressure phases are also reported. No\nmetallization of any of the compounds is detected in experiments nor is\npredicted by calculations.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1107.6039%2C1107.0072%2C1107.4186%2C1107.5028%2C1107.1995%2C1107.5910%2C1107.3874%2C1107.2909%2C1107.1766%2C1107.3014%2C1107.2622%2C1107.3267%2C1107.5814%2C1107.1117%2C1107.4986%2C1107.3135%2C1107.0374%2C1107.5288%2C1107.3891%2C1107.1609%2C1107.5072%2C1107.0190%2C1107.4489%2C1107.2163%2C1107.6035%2C1107.3819%2C1107.0770%2C1107.0013%2C1107.5935%2C1107.1188%2C1107.0546%2C1107.2283%2C1107.1832%2C1107.1647%2C1107.2188%2C1107.5996%2C1107.3288%2C1107.0548%2C1107.3448%2C1107.5716%2C1107.3880%2C1107.2302%2C1107.2642%2C1107.1071%2C1107.2203%2C1107.4019%2C1107.1622%2C1107.4069%2C1107.1477%2C1107.0165%2C1107.4329%2C1107.1938%2C1107.0216%2C1107.3178%2C1107.1443%2C1107.1355%2C1107.1103%2C1107.5369%2C1107.4432%2C1107.5856%2C1107.5174%2C1107.5273%2C1107.3381%2C1107.4490%2C1107.5395%2C1107.3658%2C1107.1905%2C1107.3671%2C1107.4145%2C1107.2762%2C1107.0526%2C1107.4016%2C1107.2820%2C1107.5318%2C1107.5997%2C1107.2377%2C1107.2822%2C1107.0629%2C1107.4704%2C1107.1038%2C1107.1175%2C1107.0886%2C1107.0806%2C1107.1610%2C1107.5244%2C1107.0209%2C1107.5949%2C1107.5348%2C1107.2987%2C1107.0951%2C1107.1822%2C1107.2294%2C1107.5358%2C1107.2459%2C1107.1068%2C1107.2413%2C1107.3213%2C1107.2722%2C1107.5122%2C1107.1009%2C1107.2420&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The optical-absorption edge of single crystals of CaWO4, SrWO4, BaWO4, and\nPbWO4 has been measured under high pressure up to ~20 GPa at room temperature.\nFrom the measurements we have obtained the evolution of the band-gap energy\nwith pressure. We found a low-pressure range (up to 7-10 GPa) where\nalkaline-earth tungstates present a very small Eg pressure dependence (-2.1 <\ndEg/dP < 8.9 meV/GPa). In contrast, in the same pressure range, PbWO4 has a\npressure coefficient of -62 meV/GPa. The high-pressure range is characterized\nin the four compounds by an abrupt decrease of Eg followed by changes in\ndEg/dP. The band-gap collapse is larger than 1.2 eV in BaWO4. We also\ncalculated the electronic-band structures and their pressure evolution.\nCalculations allow us to interpret experiments considering the different\nelectronic configuration of divalent metals. Changes in the pressure evolution\nof Eg are correlated with the occurrence of pressure-induced phase transitions.\nThe band structures for the low- and high-pressure phases are also reported. No\nmetallization of any of the compounds is detected in experiments nor is\npredicted by calculations."}, "authors": ["R. Lacomba-Perales", "D. Errandonea", "A. Segura", "J. Ruiz-Fuertes", "P. Rodriguez-Hernandez", "S. Radescu", "J. Lopez-Solano", "A. Mujica", "A. Munoz"], "author_detail": {"name": "A. Munoz"}, "author": "A. Munoz", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.3622322", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1107.3014v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1107.3014v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "26 pages, 1 table, 6 figures", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.comp-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1107.3014v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1107.3014v1", "journal_reference": null, "doi": "10.1063/1.3622322", "fulltext": "A combined high-pressure experimental and theoretical study of the electronic\nband-structure of scheelite-type AWO4 (A = Ca, Sr, Ba, Pb) compounds\n\nR. Lacomba-Perales1, D. Errandonea1, A. Segura1, J. Ruiz-Fuertes1, P. RodríguezHernández2, S. Radescu2, J. López-Solano2, A. Mujica2, and A. Muñoz2\n1\n\nDepartamento de Física Aplicada-ICMUV, MALTA Consolider Team, Universitat de València,\nEdificio de Investigación, c/Dr. Moliner 50, 46100 Burjassot, Spain\n2\n\nDepartamento de Física Fundamental II, MALTA Consolider Team, Instituto de Materiales y\nNanotecnología, Universidad de La Laguna, La Laguna, 38205 Tenerife, Spain\n\nAbstract\nThe optical-absorption edge of single crystals of CaWO4, SrWO4, BaWO4, and\nPbWO4 has been measured under high pressure up to ~20 GPa at room temperature.\nFrom the measurements we have obtained the evolution of the band-gap energy with\npressure. We found a low-pressure range (up to 7-10 GPa) where alkaline-earth\ntungstates present a very small Eg pressure dependence (-2.1 < dEg/dP < 8.9 meV/GPa).\nIn contrast, in the same pressure range, PbWO4 has a pressure coefficient of -62\nmeV/GPa. The high-pressure range is characterized in the four compounds by an abrupt\ndecrease of Eg followed by changes in dEg/dP. The band-gap collapse is larger than 1.2\neV in BaWO4. We also calculated the electronic-band structures and their pressure\nevolution. Calculations allow us to interpret experiments considering the different\nelectronic configuration of divalent metals. Changes in the pressure evolution of Eg are\ncorrelated with the occurrence of pressure-induced phase transitions. The band\nstructures for the low- and high-pressure phases are also reported. No metallization of\nany of the compounds is detected in experiments nor is predicted by calculations.\nPACS numbers: 62.50.-p, 71.15.Mb, 78.40.Fy\n1\n\n\fI. INTRODUCTION\nDivalent-metal tungstates (AWO4) with the tetragonal scheelite structure (S.G.\nI41/a) [1], are wide band-gap semiconductors [2], which present several technological\napplications [3-6] due to their excellent properties as scintillating crystals. The\nelectronic structure of these compounds has been analyzed at ambient conditions [7,8].\nRecently, accurate values of the band-gap energy (Eg) at ambient conditions have been\nreported [2]. Furthermore, Eg has been revealed to be sensitive to the ionic radii and the\nelectronic configuration of the divalent metal [2]. On the other hand, high pressure has\nbeen shown to be an excellent tool to study fundamental properties of these materials\n[9]. Actually, several high-pressure (HP) works studying their structural properties\n[10,11] and lattice dynamics [12-15] can be found in the literature. These works put on\nmanifest the occurrence of pressure-induced phase transitions, which basically consist\nin a tetragonal to monoclinic symmetry reduction. However, there are very few studies\nconcerning the behavior of the optical properties and the electronic structure of\northotungstates under HP [16-18]. In this paper we report the evolution of Eg with\npressure for CaWO4, SrWO4, BaWO4, and PbWO4. This information was obtained by\nmeans of HP optical-absorption measurements up to 20 GPa. On top of the experiments,\nwe have also performed electronic band-structure calculations. Calculations were\nperformed at different pressures within the framework of the density-functional theory\n(DFT) and considering the crystalline structure of the low- and high-pressure phases.\nOur combined experimental and theoretical study provides a clear picture of the changes\ninduced by pressure in the electronic structure of scheelite-type tungstates.\nII. EXPERIMENTAL AND THEORETICAL DETAILS\nUltraviolet-visible (UV-VIS) transmittance measurements were carried out\nunder compression at room temperature (RT) in a 500-μm culet diamond-anvil cell\n\n2\n\n\f(DAC) [19]. From these experiments we determined the evolution with pressure of the\noptical-absorption edge of the studied tungstates. The absorption coefficient (α) was\nobtained from the sample transmittance, thickness, and reflectivity. The pressure\ndependence of the thickness was taken into account [10, 11]. The refractive index is\nassumed to be constant [20]. In the set-up we used as light source a deuterium lamp of\nbroad frequency spectrum. In order to avoid UV absorptions, fused silica lenses and\nCassegrain reflectors (x15) were used. The absorption spectra were collected by a\nbroad-range spectrophotometer (Ocean Optics USB4000-UV-VIS). Single crystals of\nAWO4 (A = Ca, Sr, Ba and Pb) were grown by Czochralski method starting from raw\npowders of 5N purity [21-25]. We used thin platelets with no determined orientation\n(size: ~ 50x50x20 μm3) directly cleaved from the bulk. A 200-μm diameter hole drilled\nin a 40-μm thick INCONEL gasket was used as pressure chamber. Methanol-ethanolwater (16:3:1) was the pressure-transmitting medium and pressure was determined\nusing ruby photoluminescence [26]. Measurements were limited to 20 GPa because at\nhigher pressures non reversible defects appear on the samples affecting their\ntransmittance and not allowing an accurate determination of α and Eg\nIn the last years ab initio methods have allowed detailed studies of the crystal\nand electronic structure of materials under pressure [27]. In this work, band-structure\ncalculations have been performed within the framework of DFT with the Vienna ab\ninitio simulation package (VASP) [28]. Technical details of these calculations can be\nfound in our previous works where the methodology is extensively described [10-11].\nIII. RESULTS AND DISCUSSION\nA. Evolution of the band gap with pressure\nThe optical-absorption spectra of CaWO4, SrWO4, BaWO4, and PbWO4,\nobtained at several pressures from the studied samples, are shown in Fig. 1. The spectra\n3\n\n\fmeasured at low pressures resemble those reported in literature at ambient conditions\n[2]. At 1 bar (10-4 GPa), a steep absorption starts at 4.8, 4.9, 5.0, and 3.7 eV in CaWO4,\nSrWO4, BaWO4, and PbWO4, respectively. An absorption tail is also clearly seen at\nlower energies. This tail is typical of orthotungstates [2]. Its nature has been the subject\nof considerable debate and is beyond the scope of this work. This tail overlaps partially\nwith the fundamental absorption but it does not preclude us to conclude that the\nfundamental band gap is direct; a conclusion that is also supported by our calculations\nwith the exception of PbWO4. The reason of this apparent discrepancy is that in PbWO4\nthere is a direct and indirect gap separated by a few meV (see Table I). Therefore, in\norder to obtain quantitative information from our experiments, we will consider that in\nthe four compounds the band gap is of the direct type and that the fundamental\nabsorption edge obeys Urbach's rule [29, 30].\nIn Fig. 1, it can be seen that the band gap of CaWO4 slightly decreases with\npressure up to 9 GPa. At this pressure, which agrees with the structural transition\npressure [9], there is an abrupt change of the pressure evolution of the absorption edge.\nThe pressure dependence obtained for Eg is given in Fig. 2 and its pressure coefficient\n(dEg/dP) is shown in Table I. In SrWO4 we observed a similar behavior in the lowpressure phase, but in this case the band gap slightly opens with pressure. This can be\nseen by comparing the spectra collected at 1 bar and 10.1 GPa. Beyond this pressure,\nthe band gap reverts its pressure evolution recovering the ambient pressure value near\n12.2 GPa (see figure). At this pressure there is an abrupt collapse of the band gap, after\nwhich the band gap red-shift at -81(6) meV/GPa (see Fig. 2). BaWO4 shows a behavior\nqualitatively similar to that of SrWO4, but in BaWO4 the band-gap collapse takes place\nat 7.4 GPa and it is much larger than in SrWO4 (ΔEg > 1.2 eV). Finally, PbWO4 is the\nonly compound that shows a different behavior for the low-pressure phase. In this\n\n4\n\n\fcompound, in the scheelite structure the band gap red-shifts at -62(2) meV/GPa in good\nagreement with previous published experiments [16]. Near the pressure-induced phase\ntransition there is also a band-gap collapse. The reason for the changes produced for\npressure in the absorption edge will be discussed in the following sections in relation\nwith the structural stability and the band structure of different phases. To conclude this\nsection, we would like to add that changes induced by pressure in the absorption edge\nare reversible in the four studied compound within the pressure range covered by these\nexperiments.\nB. Low-pressure range\nIn Fig. 3 band dispersions for the four materials are plotted along different\nsymmetry directions within the body-centered tetragonal Brillouin zone of the scheelite\nstructure. Brillouin zones of scheelite and other structures relevant for this work are\nshown in Fig. 4. The shapes of the bands for CaWO4, SrWO4, and BaWO4 are very\nsimilar to each other. In CaWO4, SrWO4 the valence-band maxima and conduction-band\nminima are located at the Γ point, so that these are direct-gap materials as commented\nin the previous section. In BaWO4 we found two band gaps very close in energy: a\ndirect band-gap (Γ-Γ) with Eg = 4.624 eV and an indirect-one (Γ-Z) with Eg = 4.617 eV.\nHowever, these differences are comparable to the error of calculations and since\nexperiments show that BaWO4 is a direct-gap material and the absorption intensity of\nindirect transitions is expected to be much lower, we will use the first value to compare\nwith experiments. Although the values of the band gaps calculated within densityfunctional theory are known to be underestimated, it is interesting to compare the gaps\ncalculated for the three materials as listed in Table I. In the three compounds Eg is\nunderestimated by the calculations at least by 0.6 eV. This underestimation increases\n\n5\n\n\ffollowing the sequence BaWO4 < SrWO4 < CaWO4. Similar results have been obtained\nfor CaWO4 and BaWO4 from previous calculations [7, 31].\nOne important feature to remark of the band structure of the scheelite phase in\nthe alkaline-earth tungstates is that the dispersion of the valence bands is relatively\nsmall, with comparable dispersions along different directions. In addition, the upper part\nof the valence band is dominated by O 2p states. On the other hand, the lower part of\nthe conduction band, which is composed primarily of electronic states associated with\nthe W 5d states, is separated by approximately 0.5 eV from the upper part of the\nconduction band formed from states of W and the 3d, 4d, 5d states of Ca, Sr, and Ba,\nrespectively. Fig. 5 shows the calculated density of states for scheelite illustrating the\ncontribution of different states.\nThe shape of the bands for PbWO4 is somewhat different from those of the other\nmaterials. For PbWO4, the band extrema are located away from the Γ point. Within the\nregion of the Brillouin zone studied for the dispersion plot shown in Fig. 3, we can state\nthat valence band has maxima in the Δ directions and the conduction-band minima are\nlocated in the Σ directions. In addition, very close to the absolute maxima of the valence\nband there are maxima at the Σ direction. Then according with calculations PbWO4 has\nan indirect gap of 3.19 eV and a direct gap of 3.27 eV. The proximity between both\ngaps could have made the indirect band gap undetectable in experiments, as previously\ncommented for BaWO4. The band structure obtained from the calculations is in good\nagreement with that reported by Zhang et al [7]. There are only differences smaller than\n10% in the value of the band gaps. In particular, the present calculations give band-gap\nenergies that differ less from the experiments. As in the case of the alkaline-earth\ntungstates, calculations show that in PbWO4, the valence and conduction bands are\nmainly composed of O 2p states and W 5d states. However, Pb 6s states to some extent\n6\n\n\falso contribute to the top of the valence band and bottom of the conduction band, being\na distinctive feature of PbWO4.\nThe calculated ordering of the band gaps at ambient pressure is given by PbWO4\n< CaWO4 < SrWO4 < BaWO4. Experimental data agree with this sequence. PbWO4 has\nthe smallest gap given the particular electronic configuration of Pb. In alkaline-earth\ntungstates only the s orbitals of the divalent cation make a minor contribution to the\nvalence and conduction bands. On the other hand, in PbWO4 there are two Pb s\nelectrons in the valence band, and the O2− 2p states and the W6+ 5d also hybridize with\nthe s and d states of Pb2+. From symmetry considerations (inversion symmetry), the Pb\n6s and O 2p states are expected not to mix in the Γ point but to strongly mix in\ndirections with lower symmetry. The resulting s-p repulsion pushes up (down) the\nmaximum (minimum) of the valence (conduction) band resulting in a band gap away\nfrom the Γ point. These conclusions have been confirmed by x-ray photoelectron\nspectroscopy measurements performed in BaWO4, CaWO4, and PbWO4 [8].\nRegarding the pressure evolution of the band gap, calculations give a similar\nbehavior than experiments for CaWO4 and PbWO4. The obtained pressure evolution for\nall compounds is shown in Fig. 6 and pressure coefficients are given in Table I. Some\ndiscrepancies are found for SrWO4. For this compound the calculations predict that the\ngap closes with pressure (dEg/dP = -4.3 meV/GPa) but from the experiments the\nopposite behavior is obtained (dEg/dP = + 3.7 meV/GPa). In the case of BaWO4,\ncalculations predict the direct gap slightly to open under compression, but the indirect\ngap to close. In the experiments the gap slightly opens under compression. The origin\nof the discrepancies for SrWO4 is not clear yet. One possible explanation is the\nexistence of excitonic effects that are not taken into account in DFT calculations but are\nnormally strong in the absorption edge of direct semiconductors. Small subtle changes\n7\n\n\fin the band structure under pressure (like a close indirect transition becoming closer or\nfurther in energy) can strongly change the exciton life and, consequently, its width. A\ndecrease of the exciton width would lead to a steeper absorption tail (as it seems to be\nthe case for SrWO4 in Fig. 1) and compensate the band gap red shift, as was observed\nfor the direct gap of CuAlO2 [32]. Measurements with thinner samples would be\nnecessary to elucidate the origin of this small discrepancy. However, differences on\npressure coefficients are of the order of a few meV/GPa. Such differences are\ncomparable with the error on gap determination both in experiments and calculations.\nAnother possibility to explain discrepancies can be differences in temperature and\nhydrostaticity between experiments and calculations.\nBy comparing the density of states at different pressures it is possible to explain\nthe changes induced by pressure in the band-structure of scheelites. In order to do it, the\ndensity of states is plotted at 5.5 GPa for the four different compounds in Fig. 5(b).\nThere it can be seen that most notorious changes in the density of states are induced in\nPbWO4 and BaWO4. According with the calculations, the reduction of the band gap in\nCaWO4 is a consequence of the increase of the contribution of Ca 3d states to the\nvalence band. A similar effect, but most moderate is predicted for SrWO4. According to\nthis, pressure should produce a reduction of Eg, but we observe experimentally the\nopposite as discussed above. Regarding PbWO4, its distinctive band structure, where Pb\nstates play a more important role than Ca, Sr, and Ba states in other compounds, makes\nthe effect of pressure to be more prominent, being dEg/dP an order of magnitude larger\nthan in other compounds. As a consequence of it the electronic band-gap is reduced\nunder compression more in PbWO4 than in any of the other three compounds. This can\nbe clearly seen by comparing Figs. 5(a) and 5(b). This conclusion is consistent with the\nfact that in scheelite-type PbMoO4 a dEg/dP similar to -62 meV/GPa was determined\n\n8\n\n\f[17]. Note that according to band-structure calculations PbWO4 and PbMoO4 have a\nquite similar electronic structure [7]. A similar band-structure is expected for EuWO4\n[33], in which pressure should induce a similar closing of the band-gap. On the other\nhand, CaMoO4 has a similar band structure to CaWO4 [7], which suggests that pressure\nshould have little effects on the band structure of CaMoO4 within the stability range of\nthe scheelite phase.\nC. High-pressure range\nSeveral phase transitions are induced by pressure in the studied compounds. In\nparticular in CaWO4 and SrWO4 a phase transition to the monoclinic fergusonite (I2/a)\nstructure is known to occur near 10 GPa [10]. On the other hand, in BaWO4 and PbWO4\nnot only the fergusonite structure appears under compression but also another\nmonoclinic phase is observed, with P21/n symmetry named BaWO4-II (or PbWO4-III)\n[11]. One or the other structure has been found to be the post-scheelite phase depending\nupon experimental conditions and in some cases both phases coexist in a broad pressure\nrange. In our case we will show that the scheelite-P21/n transition explains better the\nexperimental changes observed in the optical absorption [34].\nLet us discuss first CaWO4. In this compound our calculations found a collapse\nsmaller than 0.1 eV at the scheelite-fergusonite transition. This is in good agreement\nwith the experiments. We also found that the band gap of fergusonite is direct and\nlocated at the Γ point (see Fig. 3). The band structure of fergusonite resembles closely\nthat of scheelite, which is not surprising because fergusonite is a monoclinic distortion\nof scheelite. In addition, around 12 GPa the calculations predict a direct-to-indirect band\ncrossing in the HP phase, changing the lowest minimum of the conduction band to the\nY point of the Brillouin zone. This minimum moves much faster with pressure than the\nminimum at the Γ point and therefore the pressure coefficient becomes -105 meV/GPa\n9\n\n\f(see Fig. 6). This picture fully agrees with the results found in the experiments as can be\nseen in Fig. 2. A similar behavior is found for SrWO4, but in this case the band gap\ncollapse is larger than in CaWO4.\nIn the cases of BaWO4 and PbWO4 a monoclinic P21/n structure fits better than\na fergusonite with the changes observed in the band gap after the phase transition. The\nband structure of the P21/n high-pressure structure is different than that of fergusonite.\nIn particular, in the P21/n phase the band-gap is much smaller than in fergusonite,\nexplaining the larger collapse of the gap at the transition. We also found that the highpressure phase of PbWO4 is a direct band-gap semiconductor with the fundamental gap\nat the D point of the Brillouin zone. On the other hand, in the high-pressure phase of\nBaWO4 there are two gaps, one direct (D - D) and one indirect (Γ−D) very close in\nenergy. Regarding the pressure coefficient of the gap, the calculated values explain the\nexperimental results. In the P21/n structure the effect of pressure is smaller than in\nfergusonite. This is consistent with the fact that BaWO4-II and PbWO4-III are quite\ndense structures with a low compressibility.\nWe would like to comment on differences between the experimental results\nreported here for the HP phase of PbWO4 and those previously published [16]. In\ncontrast with the previous study we only found one abrupt change in Eg and supported\nby calculations we attribute it to the scheelite-to-PbWO4-III transition. Previously, a\ncollapse of Eg and a second change were detected. These differences are not surprising\nsince a rich polymorphism is induced by pressure in PbWO4 and BaWO4 [34]. In\naddition, we think that differences can be caused by the different thickness of the\nsamples used. In this case we used a thinner sample than in Ref. [16]. This could have\nlead to better quasi-hydrostatic conditions avoiding therefore the appearance of the\nfergusonite phase in between scheelite and PbWO4-III and making the formation of\n10\n\n\fdefects to appear at higher pressures. The improvement in the experimental conditions\nin the present experiments has also leaded to a better agreement between experiments\nand theory.\nIn the past, it has been argued that metallization can be induced by pressure in\nscheelite-structured oxides due to the increase of electronic hybridization [35]. In our\ncase both experiments and calculations do not point towards pressure-induced\nmetallization. In the case of PbWO4, the compound with the smallest gap, the band gap\nraches 2.3 eV at 18 GPa. This is consistent with color changes observed in the crystals,\nwhich become greenish when approaching this pressure. Upon further compression, we\nwere unable to determine Eg because of the appearance of many defects in the crystals.\nHowever, we have observed that around 25 GPa the crystals became orange, what\nindicates that the band-gap cannot be smaller than 2 eV. Calculations predict a similar\nbehavior for Eg in the HP phase. Extrapolating Eg to higher pressures, using the\nexperimental pressure coefficient, metallization is estimated to take place at 100 GPa.\nHowever, at much lower pressures additional phase transitions are predicted to take\nplace [10, 11] and amorphization has been observed [36].\nIV. CONCLUSIONS\nAbsorption spectra of CaWO4, SrWO4, BaWO4, and PbWO4 were measured as a\nfunction of pressure up to 20 GPa extending the pressure range of previous experiments\nthat were only performed for lead tungstate. In the low-pressure scheelite phase we\nobserved in PbWO4 a red-shift of the absorption edge under compression. In the other\nthree compounds the band gap is much less affected by pressure. At the transition\npressure to different monoclinic phases an abrupt change of the absorption spectrum\nwas found. Additionally, in CaWO4 and SrWO4 a band crossover occurs in the HP\nphase. The changes of the optical-absorption edge were attributed to the occurrence of\n\n11\n\n\fpreviously observed phase transitions. The results are explained by means of highpressure electronic structure calculations for the different structures of the four studied\ncompounds.\nAcknowledgements\nResearch financed by the Spanish MEC under Grants No. MAT2010-21270C01/03 and No. CSD-2007-00045. We acknowledge the supercomputer time provided\nby the Red Española de Supercomputación (RES).\n\n12\n\n\fReferences\n[1] A. W. Sleight, Acta Cryst. B 28, 2899 (1972).\n[2] R. Lacomba-Perales, J. Ruiz-Fuertes, D. Errandonea, D. Martínez, and A. Segura,\nEPL 83, 37002 (2008).\n[3] A. A. Annenkov, M. V. Korzhik, and P. Lecoq, Nucl Instrum Methods Phys Res A\n490, 30 (2002).\n[4] M. Nikl, P. Bohacek, N. Mihokova, N. Solovieva, A. Vedda, M. Martini, et al. J\nAppl Phys 91, 5041 (2002).\n[5] A. Brenier, G. Jia, and C. Y. Tu, J. Phys.: Condens. Matter 16, 9103 (2004).\n[6] S. Chernov, R. Deych, L. Grigorjeva, and D. Millers, Mater. Sci. Forum 239, 299\n(1997).\n[7] Y. Zhang, N. A. W. Holzwarth, and R. T. Williams, Phys. Rev. B 57, 12738 (1998).\n[8] M. Itoh, N. Fujita, Y. Inabe, Journal of the Physical Society of Japan 75, 084705\n(2006).\n[9] D. Errandonea, F. J. Manjón, Prog. Mat. Sci. 53, 711 (2008).\n[10] D. Errandonea, J. Pellicer-Porres, F. J. Manjón, A. Segura, Ch. Ferrer-Roca, R. S.\nKumar, O. Tschauner, P. Rodríguez-Hernández, J. López-Solano, S. Radescu, A.\nMujica, A. Muñoz, G. Aquilanti, Phys. Rev. B 72, 174106 (2005), and references\ntherein.\n[11] D. Errandonea, J. Pellicer-Porres, F. J. Manjón, A. Segura, Ch. Ferrer-Roca, R. S.\nKumar, O. Tschauner, J. López-Solano, P. Rodríguez-Hernández, S. Radescu, A.\nMujica, A. Muñoz, G. Aquilanti, Phys. Rev. B 73, 224103 (2006), and references\ntherein.\n[12] D. Christofilos, S. Ves, G. A. Kourouklis, Phys. Stat. Sol. (b) 198, 539 (1996).\n\n13\n\n\f[13] D. Christofilos, K. Papagelis, S. Ves, G. A. Kourouklis, C. Raptis, J. Phys.:\nCondens. Matter 14, 12641 (2002).\n[14] F. J. Manjón, D. Errandonea, N. Garro, J. Pellicer-Porres, P. Rodríguez-Hernández,\nS. Radescu, J. López-Solano, A. Mujica, A. Muñoz, Phys. Rev. B 74, 144111 (2006).\n[15] F. J. Manjón, D. Errandonea, N. Garro, J. Pellicer-Porres, J. López-Solano, P.\nRodríguez-Hernández, S. Radescu, A. Mujica, A. Muñoz, Phys. Rev. B 74, 144112\n(2006).\n[16] D. Errandonea, D. Martínez-García, R. Lacomba-Perales, J. Ruiz-Fuertes, A.\nSegura, Applied Physics Letters 89, 091913 (2006).\n[17] A. Jayaraman, B. Batlogg, and L. G. van Uitert, Phys. Rev. B 31, 5423 (1985).\n[18] J. Ruiz-Fuertes, D. Errandonea, A. Segura, F.J. Manjón, Zh. Zhu, and C.Y. Tu,\nHigh Pressure Research 28, 565 (2008).\n[19] A. Segura, J. A. Sanz, D. Errandonea, D. Martinez-Garcia, V. Fages, Appl. Phys.\nLett. 88, 011910 (2006).\n[20] P. Lecoq, I. Dafinei, E. Auffray, M. Scheegans, M. V. Korzhik, O. V. Missetvich,\nV. B. Pavlenko, A. A. Fedorov, A. N. Annenkov, V. L. Kostylev, V. D. Ligun, Nucl.\nInstrum. Methods Phys. Res. A 365, 291 (1995).\n[21] M. Nikl, P. Bohacek, N. Mihokova, M. Kobayashi, M. Ishii, Y. Usuki , et al. J.\nLumin. 87-89, 1136 (2000).\n[22] J. C. Brice and P. A. C. Whiffin, J. Appl. Phys. 18, 581 (1967).\n[23] F. G. Yang, C. Y. Tu, H. Y. Wang, Y. P. Wei, Z. Y. You, G. H. Jia, J. F. Li, Z. J.\nZhu, X. A. Lu, Y. Wang, J. Alloys Compd. 455, 269 (2008).\n\n14\n\n\f[24] D. Errandonea, C. Y. Tu, G. H. Ha, I. R. Martin, U. R. Rodriguez-Mendoza, F.\nLahoz, M. E. Torres, V. Lavin, J. Alloys Compds. 451, 212 (2008).\n[25] G. J. Piermarini, S. Block, J. D. Barnett, R. A. Forman, J. Appl. Phys. 46, 2774\n(1975).\n[26] D. Errandonea, A. Segura, V. Muñoz, and A. Chevy, Phys. Rev. B 60, 15866\n(1999).\n[27] A. Mujica, A. Rubio, A. Muñoz and R.J. Needs, Review Moderm Physics, 75, 863\n(2003).\n[28] G. Kresse and J. Hafner, Phys. Rev. B 47, 558 (1993); ibid 49, 14251(1994); G.\nKresse and J. Furthmüller, Comput. Mat. Sci. 6, 15 (1996); G. Kresse and J.\nFurthmüller, Phys. Rev. B 54, 11169 (1996).\n[29] J. Ruiz-Fuertes, D. Errandonea, F.J. Manjon, D. Martinez-Gracia, A. Segura, V.V.\nUrsaki, and I. M. Tiginyanu, J. Appl. Phys. 103, 063710 (2008).\n[30] F. Urbach, Phys. Rev. 92, 1234 (1953).\n[31] M. Tyagi, S.G. Singh, A.K. Chauhan, and S.C. Gadkari, Physica B 405, 4530\n(2010).\n[32] S. Gilliland, J. Pellicer-Porres, A. Segura, A. Muñoz, P. Rodríguez-Hernández, D.\nKim, M. Lee, and T. Kim, Phys. Stat. Sol. (b) 244, 309(2007).\n[33] D. Errandonea, Phys. Stat. Sol. (b) 242, R125 (2005).\n[34] R. Lacomba-Perales, D. Martinez-García, D. Errandonea, Y. Le Godec, J. Philippe,\nG. Le Marchand, J. C. Chervin, A. Polian, A. Múñoz, and J. López-Solano, Phys. Rev.\nB 81, 144117 (2010).\n[35] S. J. Duclos, A. Jayaraman, G.P. Espinosa, A.S. Cooper, and R.G. Maines Sr, J.\nPhys. Chem. Solids 50, 769 (1989).\n15\n\n\f[36] D. Errandonea, M. Somayazulu, and D. Häusermann, Phys. Stat. Sol. (b) 235, 162\n(2003).\n\n16\n\n\fTable I. Experimental and theoretical values of the band-gaps at ambient pressure,\nEg(0) in eV, and pressure coefficients, dEg/dP in meV/GPa. Values are obtained from\nlinear fits at the different pressure ranges from Fig. 2 – experiment - and Fig. 6 – theory.\nWe also listed the k-points for the top of the valence band and bottom of the conduction\nband. Pressure is given in GPa.\n\nTheory\n\nExperiment\n\nCaWO4\n\nScheelite\n\nP\n\n0.2 – 9.1\n\n9.1 – 13.4\n\nEg(0)\n\n4.94 ± 0.02\n\n5.57 ± 0.04\n\ndEg/dP\n\n-2.1 ± 0.3\n\n-73 ± 3\n\nSrWO4\nP\nEg(0)\ndEg/dP\n\n4.98 ± 0.04 5.06 ± 0.02 5.68 ± 0.08\n\nBaWO4\n\n-8 ± 2\n\n-81 ± 6\n\n13.1 – 18.5\n\n(Γ → Γ)\n\n(Γ → Γ)\n\n(Γ → Y)\n\n3.84\n\n3.76\n\n4.63\n\n-8.4\n\n-4.7\n\n-105\n\nFergusonite\n\n0 – 8.3\n\n9.8 – 14\n\n14 – 20.3\n\n(Γ → Γ)\n\n(Γ → Γ)\n\n(Γ → Y)\n\n4.20\n\n4.34\n\n5.05\n\n-4.3\n\n-18.9\n\n-70.5\n\nTheory\n\nExperiment\n\nP\n\n0 – 6.4\n\n7.4 – 15.9\n\nEg(0)\n\n5.20 ± 0.03\n\n4.10 ± 0.05\n\ndEg/dP\n\n8.9 ± 0.8\n\n-11 ± 5\n\nPbWO4\n\n9.4 – 12.9\n\nScheelite\n\n10.1 – 12.2 12.5 – 15.5\n\n3.7 ± 0.7\n\n0 – 7.5\n\nTheory\n\nExperiment\n0 – 10.1\n\nFergusonite\n\nScheelite\n\nBaWO4-II\n\n0 – 7.5\n\n9.4 – 14.5\n\n(Γ → Γ)\n\n(Γ −Ζ)\n\n(Γ → D) (D → D)\n\n4.624\n\n4.617\n\n3.45\n\n3.54\n\n3.9\n\n-3.1\n\n-8.7\n\n-6.8\n\nTheory\n\nExperiment\n\nP\n\n0 – 6.4\n\n7.4 – 19.4\n\nEg(0)\n\n4.01 ± 0.02\n\n3.13 ± 0.02\n\ndEg/dP\n\n-62 ± 2\n\n-30 ± 2\n\n17\n\nScheelite\n\nPbWO4-III\n\n0 – 5.2\n\n6.6 – 17.9\n\n(Δ → Σ)\n\n(Σ → Σ)\n\n(D → D)\n\n3.19\n\n3.27\n\n2.74\n\n-63.9\n\n-54.1\n\n-22.3\n\n\fFigure Captions\nFigure 1: Selected optical-absorption spectra for different pressures in each of the\nmaterials studied.\nFigure 2: Experimental evolution of the band gap with pressure. Solid points represent\nexperimental data collected upon pressure increase, while open points correspond to\nexperimental data collected upon pressure release. The solid lines are the fitting curves\nand the vertical dotted lines represent transition pressures. The different optical\ntransitions related to the fundamental gap are also indicated according with the\ninterpretation of theoretical calculations.\nFigure 3: Electronic band-structure dispersion curves. (a) for CaWO4, SrWO4, PbWO4,\nand BaWO4 in the scheelite structure at ambient pressure. (b) for fergusonite CaWO4\nand SrWO4 at 12.9 and 14 GPa, respectively, for BaWO4-II at 11.5 GPa, and for\nPbWO4-III at 12.8 GPa.\nFigure 4: Diagram of the Brillouin zone for the scheelite, fergusonite, and monoclinic\nP21/n structures.\nFigure 5: (color online) Density of states of the schelite phase at ambient pressure (a)\nand 5.5 GPa (b).\nFigure 6: Calculated evolution of the band gap with pressure for the stable phase in\neach pressure range. The lines are fitting curves and the symbols represent the points of\nthe Brillouin zone where the optical transition takes place. For the fergusonite phases of\nCaWO4 and SrWO4, the evolution of the Γ→Γand the Γ→Y gaps is shown to remark\nthe band-crossing present in these materials. For the scheelite phase of BaWO4 and\nPbWO4 we show the direct and indirect gaps.\n\n18\n\n\f\f5.2\n5.0\n\nCaWO4\n\nSrWO4\n\nFergusonite\n\nScheelite\n\nΓ\n\nScheelite Fergusonite\n\nΓ\n\nΓ\n\n5.0\nΓ\n\nΓ\n\nΓ\nΓ\n\n4.8\n\nY\n\nΓ\n\n4.8\ng\n\nEg (eV)\n\n4.9\n\nΓ\n\n4.7\n\n4.6\nΓ\n\n4.6\n\nY\n\n4.4\n4.5\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n0\n\n14\n\n4.4\n\n2\n\n6\n\n8\n\n10 12 14 16\n\n5.6\n\nScheelite Fergusonite\n\nPbWO4\n\n4.0\n\nScheelite Fergusonite\n\nBaWO4\n\n5.2\nΓ\n\n3.6\n\n4\n\nΔ\n\nΓ\n\nΣ\n\nEg (eV)\n\n4.8\n\n3.2\n4.4\n\nD\n\nD\n\nΓ\n\n2.8\n\nD\n\n4.0\n\n2.4\n0\n\n2\n\n4\n\n6\n\n8 10 12 14 16 18 20\n\nP (GPa)\n\n0\n\n2\n\n4\n\n6\n\n8\n\n10 12 14 16 18\n\nP (GPa)\n\n\f\f\fscheelite\nfergusonite\n\nBaWO4-II = PbWO4-III\n\n\f\f\fP (GPa)\n0\n\n5\n\n10\n\nP (GPa)\n15\n\n4.5\n\n20 0\n\n5\n\n10\n\n15\n\n20\n\nSrWO4\n\nCaWO4\nΓ−Y\n\nΓ−Γ\n\nΓ−Γ\n\n4.0\n\nΓ−Y\n\nEg (eV)\n\nEg (eV)\n\n4.0\nΓ−Γ\n\n4.5\n\nΓ−Γ\n\n3.5\n\n3.5\n\nscheelite\n\nfergusonite\n\nscheelite\n\nfergusonite\n\n3.0\n\n3.0\n\n3.7\n\nΓ−Γ\n\nPbWO4\n\n4.7\n\nBaWO4\n\nΓ−Z\n\nΣ−Σ\n\n4.2\nscheelite\n\nΔ−Σ\n\nEg (eV)\n\nEg (eV)\n\n3.2\n\nBaWO4-II\n\nPbWO4-III\n\n2.7\n\n3.7\nscheelite\n\nD-D\nD-D\n\nΓ-D\n\n2.2\n\n3.2\n0\n\n5\n\n10\n\nP (GPa)\n\n15\n\n20 0\n\n5\n\n10\n\nP (GPa)\n\n15\n\n20\n\n\f"}