{"id": "http://arxiv.org/abs/0911.0695v1", "guidislink": true, "updated": "2009-11-03T22:00:12Z", "updated_parsed": [2009, 11, 3, 22, 0, 12, 1, 307, 0], "published": "2009-11-03T22:00:12Z", "published_parsed": [2009, 11, 3, 22, 0, 12, 1, 307, 0], "title": "Quantum Theory and Beyond: Is Entanglement Special?", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0911.1794%2C0911.5562%2C0911.1458%2C0911.2336%2C0911.4768%2C0911.1755%2C0911.0578%2C0911.2167%2C0911.4286%2C0911.3766%2C0911.4570%2C0911.3055%2C0911.1701%2C0911.5631%2C0911.1035%2C0911.1338%2C0911.5683%2C0911.4262%2C0911.4388%2C0911.4416%2C0911.3703%2C0911.3085%2C0911.3797%2C0911.4392%2C0911.5170%2C0911.1905%2C0911.3554%2C0911.1285%2C0911.4056%2C0911.4931%2C0911.0542%2C0911.5639%2C0911.2840%2C0911.2626%2C0911.1820%2C0911.2117%2C0911.0494%2C0911.1693%2C0911.3529%2C0911.2425%2C0911.4723%2C0911.4744%2C0911.4860%2C0911.1952%2C0911.4424%2C0911.0543%2C0911.2610%2C0911.2198%2C0911.0438%2C0911.4946%2C0911.2941%2C0911.3285%2C0911.2074%2C0911.3645%2C0911.5474%2C0911.3727%2C0911.3755%2C0911.2235%2C0911.1646%2C0911.0762%2C0911.3116%2C0911.0591%2C0911.1364%2C0911.4640%2C0911.3860%2C0911.0299%2C0911.0216%2C0911.3530%2C0911.0552%2C0911.2185%2C0911.5184%2C0911.2049%2C0911.3886%2C0911.3594%2C0911.5517%2C0911.0817%2C0911.0948%2C0911.2883%2C0911.2966%2C0911.2045%2C0911.5147%2C0911.0149%2C0911.5293%2C0911.2749%2C0911.3313%2C0911.4830%2C0911.0681%2C0911.3317%2C0911.3095%2C0911.2034%2C0911.5082%2C0911.0695%2C0911.1720%2C0911.4374%2C0911.3568%2C0911.0805%2C0911.5004%2C0911.5397%2C0911.4538%2C0911.0884%2C0911.3035&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quantum Theory and Beyond: Is Entanglement Special?"}, "summary": "Quantum theory makes the most accurate empirical predictions and yet it lacks\nsimple, comprehensible physical principles from which the theory can be\nuniquely derived. A broad class of probabilistic theories exist which all share\nsome features with quantum theory, such as probabilistic predictions for\nindividual outcomes (indeterminism), the impossibility of information transfer\nfaster than speed of light (no-signaling) or the impossibility of copying of\nunknown states (no-cloning). A vast majority of attempts to find physical\nprinciples behind quantum theory either fall short of deriving the theory\nuniquely from the principles or are based on abstract mathematical assumptions\nthat require themselves a more conclusive physical motivation. Here, we show\nthat classical probability theory and quantum theory can be reconstructed from\nthree reasonable axioms: (1) (Information capacity) All systems with\ninformation carrying capacity of one bit are equivalent. (2) (Locality) The\nstate of a composite system is completely determined by measurements on its\nsubsystems. (3) (Reversibility) Between any two pure states there exists a\nreversible transformation. If one requires the transformation from the last\naxiom to be continuous, one separates quantum theory from the classical\nprobabilistic one. A remarkable result following from our reconstruction is\nthat no probability theory other than quantum theory can exhibit entanglement\nwithout contradicting one or more axioms.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0911.1794%2C0911.5562%2C0911.1458%2C0911.2336%2C0911.4768%2C0911.1755%2C0911.0578%2C0911.2167%2C0911.4286%2C0911.3766%2C0911.4570%2C0911.3055%2C0911.1701%2C0911.5631%2C0911.1035%2C0911.1338%2C0911.5683%2C0911.4262%2C0911.4388%2C0911.4416%2C0911.3703%2C0911.3085%2C0911.3797%2C0911.4392%2C0911.5170%2C0911.1905%2C0911.3554%2C0911.1285%2C0911.4056%2C0911.4931%2C0911.0542%2C0911.5639%2C0911.2840%2C0911.2626%2C0911.1820%2C0911.2117%2C0911.0494%2C0911.1693%2C0911.3529%2C0911.2425%2C0911.4723%2C0911.4744%2C0911.4860%2C0911.1952%2C0911.4424%2C0911.0543%2C0911.2610%2C0911.2198%2C0911.0438%2C0911.4946%2C0911.2941%2C0911.3285%2C0911.2074%2C0911.3645%2C0911.5474%2C0911.3727%2C0911.3755%2C0911.2235%2C0911.1646%2C0911.0762%2C0911.3116%2C0911.0591%2C0911.1364%2C0911.4640%2C0911.3860%2C0911.0299%2C0911.0216%2C0911.3530%2C0911.0552%2C0911.2185%2C0911.5184%2C0911.2049%2C0911.3886%2C0911.3594%2C0911.5517%2C0911.0817%2C0911.0948%2C0911.2883%2C0911.2966%2C0911.2045%2C0911.5147%2C0911.0149%2C0911.5293%2C0911.2749%2C0911.3313%2C0911.4830%2C0911.0681%2C0911.3317%2C0911.3095%2C0911.2034%2C0911.5082%2C0911.0695%2C0911.1720%2C0911.4374%2C0911.3568%2C0911.0805%2C0911.5004%2C0911.5397%2C0911.4538%2C0911.0884%2C0911.3035&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quantum theory makes the most accurate empirical predictions and yet it lacks\nsimple, comprehensible physical principles from which the theory can be\nuniquely derived. A broad class of probabilistic theories exist which all share\nsome features with quantum theory, such as probabilistic predictions for\nindividual outcomes (indeterminism), the impossibility of information transfer\nfaster than speed of light (no-signaling) or the impossibility of copying of\nunknown states (no-cloning). A vast majority of attempts to find physical\nprinciples behind quantum theory either fall short of deriving the theory\nuniquely from the principles or are based on abstract mathematical assumptions\nthat require themselves a more conclusive physical motivation. Here, we show\nthat classical probability theory and quantum theory can be reconstructed from\nthree reasonable axioms: (1) (Information capacity) All systems with\ninformation carrying capacity of one bit are equivalent. (2) (Locality) The\nstate of a composite system is completely determined by measurements on its\nsubsystems. (3) (Reversibility) Between any two pure states there exists a\nreversible transformation. If one requires the transformation from the last\naxiom to be continuous, one separates quantum theory from the classical\nprobabilistic one. A remarkable result following from our reconstruction is\nthat no probability theory other than quantum theory can exhibit entanglement\nwithout contradicting one or more axioms."}, "authors": ["Borivoje Dakic", "Caslav Brukner"], "author_detail": {"name": "Caslav Brukner"}, "author": "Caslav Brukner", "arxiv_comment": "14 pages, 4 figures", "links": [{"href": "http://arxiv.org/abs/0911.0695v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0911.0695v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0911.0695v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0911.0695v1", "journal_reference": "Deep Beauty: Understanding the Quantum World through Mathematical\n  Innovation, Ed. H. Halvorson (Cambridge University Press, 2011) 365-392", "doi": null, "fulltext": "Quantum Theory and Beyond: Is Entanglement Special?\nBorivoje Dakić1 and Časlav Brukner1, 2\n\narXiv:0911.0695v1 [quant-ph] 3 Nov 2009\n\n1\n\nFaculty of Physics, University of Vienna, Boltzmanngasse 5, A-1090 Vienna, Austria\n2\nInstitute of Quantum Optics and Quantum Information,\nAustrian Academy of Sciences, Boltzmanngasse 3, A-1090 Vienna, Austria\n\nQuantum theory makes the most accurate empirical predictions and yet it lacks simple, comprehensible physical principles from which the theory can be uniquely derived. A broad class of probabilistic theories exist\nwhich all share some features with quantum theory, such as probabilistic predictions for individual outcomes\n(indeterminism), the impossibility of information transfer faster than speed of light (no-signaling) or the impossibility of copying of unknown states (no-cloning). A vast majority of attempts to find physical principles\nbehind quantum theory either fall short of deriving the theory uniquely from the principles or are based on abstract mathematical assumptions that require themselves a more conclusive physical motivation. Here, we show\nthat classical probability theory and quantum theory can be reconstructed from three reasonable axioms: (1) (Information capacity) All systems with information carrying capacity of one bit are equivalent. (2) (Locality) The\nstate of a composite system is completely determined by measurements on its subsystems. (3) (Reversibility)\nBetween any two pure states there exists a reversible transformation. If one requires the transformation from the\nlast axiom to be continuous, one separates quantum theory from the classical probabilistic one. A remarkable\nresult following from our reconstruction is that no probability theory other than quantum theory can exhibit\nentanglement without contradicting one or more axioms.\n\nI.\n\nINTRODUCTION\n\nThe historical development of scientific progress teaches us\nthat every theory that was established and broadly accepted at\na certain time was later inevitably replaced by a deeper and\nmore fundamental theory of which the old one remains a special case. One celebrated example is Newtonian (classical)\nmechanics which was superseded by quantum mechanics at\nthe beginning of the last century. It is natural to ask whether\nin a similar manner there could be logically consistent theories that are more generic than quantum theory itself. It could\nthen turn out that quantum mechanics is an effective description of such a theory, only valid within our current restricted\ndomain of experience.\nAt present, quantum theory has been tested against very\nspecific alternative theories that, both mathematically and in\ntheir concepts, are distinctly different. Instances of such alternative theories are non-contextual hidden-variable theories [1], local hidden-variable theories [2], crypto-nonlocal\nhidden-variable theories [3, 4], or some nonlinear variants\nof the Schrödinger equation [5, 6, 7, 8]. Currently, many\ngroups are working on improving experimental conditions to\nbe able to test alternative theories based on various collapse\nmodels [9, 10, 11, 12, 13]. The common trait of all these proposals is to suppresses one or the other counter-intuitive feature of quantum mechanics and thus keep some of the basic\nnotions of a classical world view intact. Specifically, hiddenvariable models would allow to preassign definite values to\noutcomes of all measurements, collapse models are mechanisms for restraining superpositions between macroscopically\ndistinct states and nonlinear extensions of the Schrödinger\nequation may admit more localized solutions for wave-packet\ndynamics, thereby resembling localized classical particles.\nIn the last years the new field of quantum information has\ninitialized interest in generalized probabilistic theories which\nshare certain features – such as the no-cloning and the nobroadcasting theorems [14, 15] or the trade-off between state\n\ndisturbance and measurement [16] – generally thought of as\nspecifically quantum, yet being shown to be present in all\nexcept classical theory. These generalized probabilistic theories can allow for stronger than quantum correlations in the\nsense that they can violate Bell's inequalities stronger than the\nquantum Cirel'son bound (as it is the case for the celebrated\n\"non-local boxes\" of Popescu and Rohrlich [17]), though they\nall respect the \"non-signaling\" constraint according to which\ncorrelations cannot be used to send information faster than the\nspeed of light.\nSince the majority of the features that have been highlighted\nas \"typically quantum\" are actually quite generic for all nonclassical probabilistic theories, one could conclude that additional principles must be adopted to single out quantum theory uniquely. Alternatively, these probabilistic theories indeed\ncan be constructed in a logically consistent way, and might\neven be realized in nature in a domain that is still beyond\nour observations. The vast majority of attempts to find physical principles behind quantum theory either fail to single out\nthe theory uniquely or are based on highly abstract mathematical assumptions without an immediate physical meaning\n(e.g. [18]).\nOn the way to reconstructions of quantum theory from\nfoundational physical principles rather than purely mathematical axioms, one finds interesting examples coming from an\ninstrumentalist approach [19, 20, 21], where the focus is primarily on primitive laboratory operations such as preparations, transformations and measurements. While these reconstructions are based on a short set of simple axioms, they still\npartially use mathematical language in their formulation.\nEvidentally, added value of reconstructions for better understanding quantum theory originates from its power of explanation where the structure of the theory comes from. Candidates for foundational principles were proposed giving a basis for an understanding of quantum theory as a general theory\nof information supplemented by several information-theoretic\nconstraints [22, 23, 24, 25, 26]. In a wider context these ap-\n\n\f2\nproaches belong to attempts to find an explanation for quantum theory by putting primacy on the concept of information\nor on the concept of probability which again can be seen as\na way of quantifying information [27, 28, 29, 30, 31, 32, 33,\n34, 35, 36]. Other principles were proposed for separation of\nquantum correlations from general non-signaling correlations,\nsuch as that communication complexity is not trivial [37, 38],\nthat communication of m classical bits causes information\ngain of at most m bits (\"information causality\") [39], or that\nany theory should recover classical physics in the macroscopic\nlimit [40].\nIn his seminal paper, Hardy [19] derives quantum theory from \"five reasonable axioms\" within the instrumentalist\nframework. He sets up a link between two natural numbers,\nd and N, characteristics of any theory. d is the number of degrees of freedom of the system and is defined as the minimum\nnumber of real parameters needed to determine the state completely. The dimension N is defined as the maximum number\nof states that can be reliably distinguished from one another in\na single shot experiment. A closely related notion is the information carrying capacity of the system, which is the maximal\nnumber of bits encoded in the system, and is equal to log N\nbits for a system of dimension N.\nExamples of theories with an explicit functional dependence d(N) are classical probability theory with the linear dependence d = N − 1, and quantum theory with the quadratic\ndependence for which it is necessary to use d = N 2 − 1 real\nparameters to completely characterize the quantum state [65].\nHigher-order theories with more general dependencies d(N)\nmight exist as illustrated in Figure 1. Hardy's reconstruction resorts to a \"simplicity axiom\" that discards a large class\nof higher-order theories by requiring that for each given N,\nd(N) takes the minimum value consistent with the other axioms. However, without making such an ad hoc assumption\nthe higher-order theories might be possible to be constructed\nin agreement with the rest of the axioms. In fact, an explicit\nquartic theory for which d = N 4 − 1 [41], and theories for\ngeneralized bit (N = 2) for which d = 2r − 1 and r ∈ N [42],\nwere recently developed, though all of them are restricted to\nthe description of individual systems only.\nIt is clear from the previous discussion that the question on\nbasis of which physical principles quantum theory can be separated from the multitude of possible generalized probability\ntheories is still open. A particulary interesting unsolved problem is whether the higher-order theories of Refs. [19, 41, 42]\ncan be extended to describe non-trivial, i.e. entangled, states\nof composite systems. Any progress in theoretical understanding of these issues would be very desirable, in particular\nbecause experimental research efforts in this direction have\nbeen very sporadic. Although the majority of experiments indirectly verify also the number of the degrees of freedom of\nquantum systems [66], there are only few dedicated attempts\nat such a direct experimental verification. Quaternionic quantum mechanics (for which d = 2N 2 − N − 1) was tested in\na suboptimal setting [45] in a single neutron experiment in\n1984 [43, 44], and more recently, the generalized measure theory of Sorkin [46] in which higher order interferences are predicted was tested in a three-slit experiment with photons [47].\n\nFIG. 1: State spaces of a two-dimensional system in the generalized\nprobabilistic theories analyzed here. d is the minimal number of real\nparameters necessary to determine the (generally mixed) state completely. From left to right: A classical bit with one parameter (the\nweight p in the mixture of two bit values), a real bit with two real parameters (state ρ ∈ D(R2 ) is represented by 2×2 real density matrix),\na qubit (quantum bit) with three real parameters (state ρ ∈ D(C2 ) is\nrepresented by 2 × 2 complex density matrix) and a generalized bit\nfor which d real parameters are needed to specify the state. Note\nthat, when one moves continuously from one pure state (represented\nby a point on the surface of a sphere) to another, only in the classical\nprobabilistic theory one must go trough the set of mixed states. Can\nprobability theories that are more generic than quantum theory be extended in a logically consistent way to higher-dimensional and composite systems? Can entanglement exist in these theories? Where\nshould we look in nature for potential empirical evidences of the theories?\n\nBoth experiments put an upper bound on the extent of the observational effects the two alternative theories may produce.\nII.\n\nBASIC IDEAS AND THE AXIOMS\n\nHere we reconstruct quantum theory from three reasonable\naxioms. Following the general structure of any reconstruction we first give a set of physical principles, then formulate\ntheir mathematical representation, and finally rigorously derive the formalism of the theory. We will only consider the\ncase where the number of distinguishable states is finite. The\nthree axioms which separate classical probability theory and\nquantum theory from all other probabilistic theories are:\nAxiom 1. (Information capacity) An elementary system has\nthe information carrying capacity of at most one bit. All systems of the same information carrying capacity are equivalent.\nAxiom 2. (Locality) The state of a composite system is completely determined by local measurements on its subsystems\nand their correlations.\nAxiom 3. (Reversibility) Between any two pure states there\nexists a reversible transformation.\nA few comments on these axioms are appropriate here. The\nmost elementary system in the theory is a two-dimensional\nsystem. All higher-dimensional systems will be built out of\ntwo-dimensional ones. Recall that the dimension is defined\n\n\f3\n\nFIG. 2: Illustration of the assumption stated in axiom 1. Consider\na toy-world of a two-dimensional system in which the set of pure\nstates consists of only x1 and x2 and their orthogonal states x⊥1 and\nx⊥2 respectively, and where only two measurements exist, which distinguish {x1 , x⊥1 } and {x2 , x⊥2 }. The convex set (represented by the grey\narea within the circle) whose vertices are the four states contains all\nphysical (pure or mixed) states in the toy-world. Now, choose a point\nin the set, say y = λx1 + (1 − λ)x2 . Axiom 1 states that any physical state can be represented as a mixture of two orthogonal states\n(i.e. states perfectly distinguishable in a single shot experiment), e.g.\ny = ηx+(1−η)x⊥ . This is not fulfilled in the toy world, but is satisfied\nin a theory in which the entire circle represents the pure states and\nwhere measurements can distinguish all pairs of orthogonal states.\n\nas the maximal number of states that can be reliably distinguished from one another in a single shot experiment. Under\nthe phrase \"an elementary system has an information capacity of at most one bit\" we precisely assume that for any state\n(pure or mixed) of a two-dimensional system there is a measurement such that the state is a mixture of two states which\nare distinguished reliable in the measurement. An alternative\nformulation could be that any state of a two dimensional system can be prepared by mixing at most two basis (i.e. perfectly distinguishable in a measurement) states (see Figure 2).\nRoughly speaking, axiom 1 assumes that a state of an elementary system can always be represented as a mixture of two\nclassical bits. This part of the axiom is inspired by Zeilinger's\nproposal for a foundation principle for quantum theory [23].\nThe second statement in axiom 1 is motivated by the intuition that at the fundamental level there should be no difference between systems of the same information carrying\ncapacity. All elementary systems – be they part of higher\ndimensional systems or not – should have equivalent state\nspaces and equivalent sets of transformations and measurements. This seems to be a natural assumption if one makes\nno prior restrictions to the theory and preserves the full symmetry between all possible elementary systems. This is why\nwe have decided to put the statement as a part of axiom 1,\nrather than as a separate axiom. The particular formulation\nused here is from Grinbaum [48] who suggested to rephrase\nthe \"subspace axiom\" of Hardy's reconstruction using physical language rather than mathematical. The subspace axiom\nstates that a system whose state is constrained to belong to an\nM dimensional subspace (i.e. have support on only M of a set\nof N possible distinguishable states) behaves like a system of\ndimension M.\nIn logical terms axiom 1 means the following. We can think\nof two basis states as two binary propositions about an indi-\n\nvidual system, such as (1) \"The outcome of measurement A is\n+1\" and (2) \"The outcome of measurement A is -1\". An alternative choice for the pair of propositions can be propositions\nabout joint properties of two systems, such as (1') \"The outcomes of measurement A on the first system and of B on the\nsecond system are correlated\" (i.e. either both +1 or both -1)\nand (2') \"The outcomes of measurement A on the first system\nand of B on the second system are anticorrelated\". The two\nchoices for the pair of propositions correspond to two choices\nof basis states which each can be used to span the full state\nspace of an abstract elementary system (also called \"generalized bit\"). As we will see later, taking the latter choice, it will\nfollow from axiom 1 alone that the state space must contain\nentangled states.\nAxiom 2 assumes that a specification of the probabilities for\na complete set of local measurements for each of the subsystems plus the joint probabilities for correlations between these\nmeasurements is sufficient to determine completely the global\nstate. Note that this property does hold in both quantum theory and classical probability theory, but not in quantum theory\nformulated on the basis of real or quaternionic amplitudes instead of complex. A closely related formulation of the axiom\nwas given by Barrett [16].\nFinally, axiom 3 requires that transformations are reversible. This is assumed alone for the purposes that the set\nof transformations builds a group structure. It is natural to\nassume that a composition of two physical transformations is\nagain a physical transformation. It should be noted that this\naxiom could be used to exclude the theories in which \"nonlocal boxes\" occur, because there the dynamical group is trivial, in the sense that it is generated solely by local operations\nand permutations of systems with no entangling reversible\ntransformations (that is, non-local boxes cannot be prepared\nfrom product states) [49].\nIf one requires the reversible transformation from our axiom 3 to be continuous:\nAxiom 3'. (Continuity) Between any two pure states there exists a continuous reversible transformation,\nwhich separates quantum theory from classical probability\ntheory. The same axiom is also present in Hardy's reconstruction. By a continuous transformation is here meant that every\ntransformation can be made up from a sequence of transformations only infinitesimally different from the identity.\nA remarkable result following from our reconstruction is\nthat quantum theory is the only probabilistic theory in which\none can construct entangled states and fulfill the three axioms.\nIn particular, in the higher-order theories of Refs. [19, 41, 42]\ncomposite systems can only enjoy trivial separable states. On\nthe other hand, we will see that axiom 1 alone requires entangled states to exist in all non-classical theories. This will\nallow us to discard the higher-order theories in our reconstruction scheme without invoking the simplicity argument.\nAs a by product of our reconstruction we will be able to\nanswer why in nature only \"odd\" correlations (i.e. (1, 1, −1),\n(1, −1, 1), (−1, 1, 1) and (−1, −1, −1)) are observed when two\nmaximally entangled qubits (spin-1/2 particles) are both measured along direction x, y and z, respectively. The most famil-\n\n\f4\niar example is of the singlet state |ψ− i = 12 (|0i1 |1i2 − |0i1 |1i2 )\nwith anticorrelated results for arbitrarily but the same choice\nof measurement directions for two qubits. We will show that\nthe \"mirror quantum mechanics\" in which only \"even\" correlations appear cannot be extended consistently to composite\nsystems of three bits.\nOur reconstruction will be given in the framework of typical experimental situation an observer faces in the laboratory.\nWhile this instrumentalist approach is a useful paradigm to\nwork with, it might not be necessary. One could think about\naxioms 1 and 3 as referring to objective features of elementary constituents of the world which need not necessarily be\nrelated to laboratory actions. In contrast, axiom 2 seems to\nacquire a meaning only within the instrumentalist approach as\nit involves the word \"measurement\". Even here one could follow a suggestion of Grinbaum [48] and rephrase the axiom to\nthe assumption of \"multiplicability of the information carrying capacity of subsystems.\"\nConcluding this section, we note that the conceptual\ngroundwork for the ideas presented here has been prepared most notably by Weizsäcker [50], Wheeler [51] and\nZeilinger [23] who proposed that the notion of the elementary yes-no alternative, or the \"Ur\", should play a pivotal role\nwhen reconstructing quantum physics.\n\nIII. BASIC NOTIONS\n\nFollowing Hardy [19] we distinguish three types of devices\nin a typical laboratory. The preparation device prepares systems in some state. It has a set of switches on it for varying\nthe state produced. After state preparation the system passes\nthrough a transformation device. It also has a set of switches\non it for varying the transformation applied on the state. Finally, the system is measured in a measurement apparatus. It\nagain has switches on it with which help an experimenter can\nchoose different measurement settings. This device outputs\nclassical data, e.g. a click in a detector or a spot on a observation screen.\nWe define the state of a system as that mathematical object\nfrom which one can determine the probability for any conceivable measurement. Physical theories can have enough structure that it is not necessary to give an exhaustive list of all\nprobabilities for all possible measurements, but only a list of\nprobabilities for some minimal subset of them. We refer to\nthis subset as fiducial set. Therefore, the state is specified by\na list of d (where d depends on dimension N) probabilities for\na set of fiducial measurements: p = (p1 , . . . , pd ). The state is\npure if it is not a (convex) mixture of other states. The state\nis mixed if it is not pure. For example, the mixed state p generated by preparing state p1 with probability λ and p2 with\nprobability 1 − λ, is p = λp1 + (1 − λ)p2 .\nWhen we refer to an N-dimensional system, we assume that\nthere are N states each of which identifies a different outcome\nof some measurement setting, in the sense that they return\nprobability one for the outcome. We call this set a set of basis\nor orthogonal states. Basis states can be chosen to be pure. To\nsee this assume that some mixed state identifies one outcome.\n\nWe can decompose the state into a mixture of pure states, each\nof which has to return probability one, and thus we can use\none of them to be a basis state. We will show later that each\npure state corresponds to a unique measurement outcome.\nIf the system in state p is incident on a transformation device, its state will be transformed to some new state U(p). The\ntransformation U is a linear function of the state p as it needs\nto preserve the linear structure of mixtures. For example, consider the mixed state p which is generated by preparing state\np1 with probability λ and p2 with probability 1 − λ. Then, in\neach single run, either p1 or p2 is transformed and thus one\nhas:\nU(λp1 + (1 − λ)p2 ) = λU(p1 ) + (1 − λ)U(p2 ).\n\n(1)\n\nIt is natural to assume that a composition of two or more\ntransformations is again from a set of (reversible) transformations. This set forms some abstract group. Axiom 3 states that\nthe transformations are reversible, i.e. for every U there is an\ninverse group element U −1 . Here we assume that every transformation has its matrix representation U and that there is an\northogonal representation of the group: there exists an invertible matrix S such that O = S US −1 is an orthogonal matrix,\ni.e. OT O = 11, for every U (We use the same notation both for\nthe group element and for its matrix representation). This does\nnot put severe restrictions to the group of transformations, as\nit is known that all compact groups have such a representation (the Schur-Auerbach lemma) [55]. Since the transformation keeps the probabilities in the range [0, 1], it has to be a\ncompact group [19]. All finite groups and all continuous Lie\ngroups are therefore included in our consideration.\nGiven a measurement setting, the outcome probability\nPmeas can be computed by some function f of the state p,\nPmeas = f (p).\n\n(2)\n\nLike a transformation, the measurement cannot change the\nmixing coefficients in a mixture, and therefore the measured\nprobability is a linear function of the state p:\nf (λp1 + (1 − λ)p2 ) = λ f (p1 ) + (1 − λ) f (p2 ).\nIV.\n\n(3)\n\nELEMENTARY SYSTEM: SYSTEM OF\nINFORMATION CAPACITY OF 1 BIT\n\nA two-dimensional system has two distinguishable outcomes which can be identified by a pair of basis states {p, p⊥ }.\nThe state is specified by d probabilities p = (p1 , ..., pd ) for d\nfiducial measurements, where pi is probability for a particular outcome of the i-th fiducial measurement (the dependent\nprobabilities 1 − pi for the opposite outcomes are omitted in\nthe state description). Instead of using the probability vector p\nwe will specify the state by its Bloch representation x defined\nas a vector with d components:\nxi = 2pi − 1.\n\n(4)\n\nThe mapping between the two different representations is an\ninvertible linear map and therefore preserves the structure of\nthe mixture λp1 + (1 − λ)p2 7→ λx1 + (1 − λ)x2 .\n\n\f5\nIt\nP is convenient to define a totaly mixed state E =\nx∈Spure x, where Spure denotes the set of pure states and\nN is the normalization constant. In the case of a continuous set of pure states the summation has to be replaced by a\nproper integral. It is easy to verify that E is a totally invariant\nstate. This implies that every measurement and in particular\nthe fiducial ones will return the same probability for all outcomes. In the case of a two-dimensional system this probability is 1/2. Therefore, the Bloch vector of the totally mixed\nstate is the zero-vector E = ~0.\nThe transformation U does not change the totaly mixed\nstate, hence U(~0) = ~0. The last condition together with the\nlinearity condition (1) implies that any transformation is represented by some d × d real invertible matrix U. The same\nreasoning holds for measurements. Therefore, the measured\nprobability is given by the formula:\n1\nN\n\nPmeas =\n\n1\n(1 + rT x).\n2\n\n(5)\n\nThe vector r represents the outcome for the given measurement setting. For example, the vector (1, 0, 0, . . . ) represents\none of the outcomes for the first fiducial measurement.\nAccording to axiom 1 any state is a classical mixture of\nsome pair of orthogonal states. For example, the totally mixed\nstate is an equally weighted mixture of some orthogonal states\n~0 = 1 x + 1 x⊥ . Take x to be the reference state. According to\n2\n2\naxiom 3 we can generate the full set of states by applying all\npossible transformations to the reference state. Since the totally mixed state is invariant under the transformations, the\npair of orthogonal states is represented by a pair of antiparallel vectors x⊥ = −x. Consider the set Spure = { Ux | ∀U}\nof all pure states generated by applying all transformations to\nthe reference state. If one uses the orthogonal representation\nof the transformations, U = S −1 OS , which was introduced\nabove, one maps x 7→ S x and U 7→ O. Hence, the transformation Ux 7→ S Ux = OS x is norm preserving. We conclude\nthat all pure states are points on a d-dimensional ellipsoid described by ||S x|| = c with c > 0.\nNow, we want to show that any vector x satisfying ||S x|| = c\nis a physical state and therefore the set of states has to be the\nwhole ellipsoid. Let x be some vector satisfying ||S x|| = c and\nx(t) = tx a line trough the origin (totaly mixed state) as given\nin Figure 3 (left). Within the set of pure states we can always\nfind d linearly independent vectors {x1 , . . . , xd }. For each state\nxi there is a corresponding orthogonal state x⊥i = −xi in a set\nof states. We can expand a point on\nP the line into a linearly\nindependent set of vectors: x(t) = t di=1 ci xi . For sufficiently\nsmall t we can define a pair of non-negative\nλi (t) =\nP numbers\n1 1\n1 1\n⊥\n⊥\n(\n+\ntc\n)\nand\nλ\n(t)\n=\n(\n−\ntc\n)\nwith\n(λ\n(t)\n+\nλ\n(t))\n=1\ni\ni\ni\ni\ni\ni\n2 d\n2 d\nP\nsuch that x(t) is a mixture x(t) = di=1 λi (t)xi + λ⊥i (t)x⊥i and\ntherefore is a physical state. Then, according to axiom 1 there\nexists a pair of basis states {x0 , −x0 } such that x(t) is a mixture\nof them\nx(t) = tx = αx0 + (1 − α)(−x0 ),\n\n(6)\n\nwhere α = 1+t\n2 and x = x0 . This implies that x is a pure state\nand therefore all points of the ellipsoid are physical states.\n\nFIG. 3: (Left) Illustration to the proof that the entire d-dimensional\nellipsoid (here represented by a circle; d = 2) contains physical\nstates. Consider a line x(t) = tx through the origin. A point on\nthe line can be expanded into a set of linearly independent vectors xi\n(here x1 and x2 ). For sufficiently small t (i.e. when the line is within\nthe gray square) the point x(t) can be represented as a convex mixture\nover xi and their orthogonal vectors x⊥i and thus is a physical state.\nAccording to axiom 1, x(t) can be represented as a convex mixture of\ntwo orthogonal pure states x0 and x⊥0 : x(t) = tx = αx0 + (1 − α)(−x0 ),\nwhere x = x0 (see text for details). This implies that every point in\nthe ellipsoid is a physical state. (Right) Illustration to the proof that in\nthe orthogonal representation the measurement vector m that identifies the state x, i.e. for which the probability Pmeas = 21 (1 + mT y) = 1,\nis identical to the state vector, m = y. Suppose that m , y, then\n||m|| > 1, since the state vector is normalized. But then the same\nmeasurement for state y′ parallel to m would return a probability\nlarger than 1, which is nonphysical. Thus m = y.\n\nFor every pure state x, there exists at least one measurement\nsetting with the outcome r such that the outcome probability\nis one, hence rT x = 1. Let us define new coordinates y = 1c S x\nand m = cS −1T r in the orthogonal representation. The set of\npure states in the new coordinates is a (d − 1)-sphere Sd−1 =\n{y | ||y|| = 1} of the radius. The probability rule (5) remains\nunchanged in the new coordinates:\nPmeas =\n\n1\n(1 + mT y).\n2\n\n(7)\n\nThus, one has mT y = 1. Now, assume that m , y. Then\n||m|| > 1 and the vectors m and y span a two-dimensional\nplane as illustrated in Figure 3 (right). The set of pure states\nwithin this plane is a unit circle. Choose the pure state y′ to\nbe parallel to m. Then the outcome probability is Pmeasur =\n1\n′\n2 (1 + ||m||||y ||) > 1 which is non-physical, hence m = y.\nTherefore, to each pure state y, we associate a measurement\nvector m = y which identifies it. Equivalently, in the original\ncoordinates, to each x we associate a measurement vector r =\nDx, where D = c12 S T S is a positive, symmetric matrix. A\nproof of this relation for the restricted case of d = 3 can be\nfound in Ref. [19].\nFrom now one, instead of the measurement vector r we will\nuse the pure state x which identifies it. When we say that the\nmeasurement along the state x is performed we mean the measurement given by r = Dx. The measurement setting is given\nby a pair of measurement vectors r and −r. The measured\nprobability when the state x1 is measured along the state x2\n\n\f6\nfollows from formula (5):\nP(x1 , x2 ) =\n\n1\n(1 + xT1 Dx2 ).\n2\n\n(8)\n\nWe can choose orthogonal eigenvectors of the matrix D as\nthe fiducial set of states (measurements):\nDxi = ai xi ,\n\n(9)\n\nwhere ai are eigenvalues of D. Since xi are pure states, they\nsatisfy xTi Dx j = δi j . The set of pure states becomes a unit\nsphere Sd−1 = {x | ||x|| = 1} and the probability formula is\nreduced to\nP(x1 , x2 ) =\n\n1\n(1 + xT1 x2 ).\n2\n\n(10)\n\nThis corresponds to a choice of a complete set of mutually\ncomplementary measurements (i.e. mutually unbiased basis\nsets) for the fiducial measurements. The states identifying outcomes of complementary measurements satisfy P(xi , x j ) = 21\nfor i , j. Two observables are said to be mutually complementary if complete certainty about one of the observables\n(one of two outcomes occurs with probability one) precludes\nany knowledge about the others (the probability for both outcomes is 1/2). Given some state x, the i-th fiducial measurement returns probability pi = 12 (1+xi ). Therefore, xi is a mean\nvalue of a dichotomic observable bi = +1xi − 1x⊥i with two\npossible outcomes bi = ±1.\nA theory in which the state space of the generalized bit\nis represented by a (d − 1)-sphere has d mutually complementary observables. This is a characteristic feature of the\ntheories and they can be ordered according to their number.\nFor example, classical physics has no complementary observables, real quantum mechanics has two, complex (standard)\nquantum mechanics has three (e.g. the spin projections of\na spin-1/2 system along three orthogonal directions) and the\none based on quaternions has five mutually complementary\nobservables. Note that higher-order theories of a single generalized bit are such that the qubit theory can be embedded in\nthem in the same way in which classical theory of a bit can be\nembedded in qubit theory itself.\nHigher-order theories can have even better information processing capacity than quantum theory. For example, the computational abilities of the theories with d = 2r and r ∈ N\nin solving the Deutsch-Josza type of problems increases with\nthe number of mutually complementary measurements [42].\nIt is likely that the larger this number is the larger the error\nrate would be in secret key distribution in these theories, in a\nsimilar manner in which the 6-state is advantageous over the\n4-state protocol in (standard) quantum mechanics. In the first\ncase one uses all three mutually complementary observables\nand in the second one only two of them. (See Ref. [52] for a\nreview on characterizing generalized probabilistic theories in\nterms of their information-processing power and Ref. [53] for\ninvestigating the same question in much more general framework of compact closed categories.)\nA final remark on higher-order theories is of more speculative nature. In various approaches to quantum theory of grav-\n\nity one predicts at the Planck scale the dimension of spacetime to be different from 3 + 1 [54]. If one considers directional degrees of freedom (spin), then the d − 1-sphere (Bloch\nsphere) might be interpreted as the state space of a spin system\nembedded in real (ordinary) space of dimension d, in general\ndifferent than 3 which is the special case of quantum theory.\nThe reversible transformation R preserves the purity of state\n||Rx|| = ||x|| and therefore R is an orthogonal matrix. We have\nshown that the state space is the full (d − 1)-sphere. According to axiom 3 the set of transformations must be rich enough\nto generate the full sphere. If d = 1 (classical bit), the group\nof transformations is discrete and contains only the identity\nand the bit-flip. If d > 1, the group is continuous and is some\nsubgroup of the orthogonal group O(d). Every orthogonal matrix has determinant either 1 or -1. The orthogonal matrices\nwith determinant 1 form a normal subgroup of O(d), known\nas the special orthogonal group SO(d). The group O(d) has\ntwo connected components: the identity component which\nis the SO(d) group, and the component formed by orthogonal matrices with determinant -1. Since every two points on\nthe (d − 1)-sphere are connected by some transformation, the\ngroup of transformations is at least the SO(d) group. If we include even a single transformation with determinant -1, the set\nof transformations becomes the entire O(d) group. (Later we\nwill show that only some d are in agreement with our three\naxioms and for these d's the set of physical transformations\nwill be shown to be the SO(d) group).\n\nV.\n\nCOMPOSITE SYSTEM AND THE NOTION OF\nLOCALITY\n\nWe now introduce a description of composite systems. We\nassume that when one combines two systems of dimension L1\nand L2 into a composite one, one obtains a system of dimension L1 L2 . Consider a composite system consisting of two\ngeneneralized bits and choose a set of d complementary measurements on each subsystem as fiducial measurements. According to axiom 2 the state of the composite system is completely determined by a set of real parameters obtainable from\nlocal measurements on the two generalized bits and their correlations. We obtain 2d independent real parameters from the\nset of local fiducial measurements and additional d2 parameters from correlations between them. This gives altogether\nd2 + 2d = (d + 1)2 − 1 parameters. They are the components\nxi , yi , i ∈ {1, ..., d}, of the local Bloch vectors and T i j of the\ncorrelation tensor:\nxi = p(i) (A = 1) − p(i) (A = −1),\ny j = p( j) (B = 1) − p( j) (B = −1),\n\nT i j = p(i j) (AB = 1) − p(i j) (AB = −1).\n\n(11)\n(12)\n(13)\n\nHere, for example, p(i) (A = 1) is the probability to obtain\noutcome A = 1 when the i-th measurement is performed on\nthe first subsystem and p(i j) (AB = 1) is the joint probability\nto obtain correlated results (i.e. either A = B = +1 or A =\nB = −1) when the i-th measurement is performed on the first\nsubsystem and the j-th measurement on the second one.\n\n\f7\nNote that axiom 2 \"The state of a composite system is completely determined by local measurements on its subsystems\nand their correlations\" is formulated in a way that the nonsignaling condition is implicitly assumed to hold. This is\nbecause it is sufficient to speak about \"local measurements\"\nalone without specifying the choice of measurement setting\non the other, potentially distant, subsystem. Therefore, xi does\nnot depend on j, and y j does not depend on i.\nWe represent a state by the triple ψ = (x, y, T ), where x\nand y are the local Bloch vectors and T is a d × d real matrix\nrepresenting the correlation tensor. The product (separable)\nstate is represented by ψ p = (x, y, T ), where T = xyT is of\nproduct form, because the correlations are just products of the\ncomponents of the local Bloch vectors. We call the pure state\nentangled if it is not a product state.\nThe measured probability is a linear function of the state ψ.\nIf we prepare totaly mixed states of the subsystems (0, 0, 0),\nthe probability for any outcome of an arbitrary measurement\nwill be 1/4. Therefore, the outcome probability can be written\nas:\nPmeasur =\n\n1\n(1 + (r, ψ)),\n4\n\n(14)\n\nwhere r = (r1 , r2 , K) is a measurement vector associated to\nthe observed outcome and (..., ...) denotes the scalar product:\n(r, ψ) = rT1 x + rT2 y + Tr(K T T ).\n\n(15)\n\nNow, assume that r = (r1 , r2 , K) is associated to the\noutcome which is identified by some product state ψ p =\n(x0 , y0 , T 0 ). If we preform a measurement on the arbitrary\nproduct state ψ = (x, y, T ), the outcome probability has to factorize into the product of the local outcome probabilities of\nthe form (10):\n1\n(1 + rT1 x + rT2 y + xT Ky)\n4\n= P1 (x0 , x)P2 (y0 , y)\n1\n1\n= (1 + xT0 x) (1 + yT0 y)\n2\n2\n1\n= (1 + xT0 x + yT0 y + xT x0 yT0 y),\n4\n\nPmeasur =\n\n(16)\n(17)\n(18)\n(19)\n\nwhich holds for all x, y. Therefore we have r = ψ p . For each\nproduct state ψ p there is a unique outcome r = ψ p which identifies it. We will later show that correspondence r = ψ holds\nfor all pure states ψ.\nIf we preform local transformations R1 and R2 on the subsystems, the global state ψ = (x, y, T ) is transformed to\n(R1 , R2 )ψ = (R1 x, R2 y, R1 T RT2 ).\n\n(20)\n\nT is a real matrix and we can find its singular value decomposition diag[t1 , . . . , td ] = R1 T RT2 , where R1 , R2 are orthogonal\nmatrices which can be chosen to have determinant 1. Therefore, we can choose the local bases such that correlation tensor\nT is a diagonal matrix:\n(R1 , R2 )(x, y, T ) = (R1 x, R2 y, diag[t1 , . . . , td ]).\n\n(21)\n\nThe last expression is called Schmidt decomposition of the\nstate.\nThe local Bloch vectors satisfy ||x||, ||y|| ≤ 1 which implies\na bound on the correlation ||T || ≥ 1 for all pure states. The\nfollowing lemma identifies a simple entanglement witness for\npure states. The proof of this and all subsequent lemmas is\ngiven in the Appendix.\nLemma 1. The lower bound ||T || = 1 is saturated, if and only\nif the state is a product state T = xyT.\nRecall that for every transformation U we can find its orthogonal representation U = S OS −1 (the Schur-Auerbach\nlemma), where S is an invertible matrix and OT O = 11. The\nmatrix S is characteristic of the representation and should be\nthe same for all transformations U. If we choose some local\ntransformation U = (R1 , R2 ), U will be orthogonal and thus\nwe can choose to set S = 11. The representation of transformations is orthogonal, therefore they are norm preserving. By\napplying simultaneously all (local and non-local) transformations U to some product state (the reference state) ψ and to the\nmeasurement vector which identifies it, r = ψ, we generate the\nset of all pure states and corresponding measurement vectors.\nSince we have 1 = P(r = ψ, ψ) = P(Ur, Uψ), correspondence\nr = ψ holds for any pure state ψ. Instead of the measurement\nvector r in formula (14) we use the pure state which identifies\nit. If the state ψ1 = (x1 , y1 , T 1 ) is prepared and measurement\nalong the state ψ2 = (x2 , y2 , T 2 ) is performed, the measured\nprobability is given by\nP12 (ψ1 , ψ2 ) =\n\n1\n(1 + xT1 x2 + yT1 y2 + Tr(T 1T T 2 )).\n4\n\n(22)\n\nThe set of pure states obeys P12 (ψ, ψ) = 1. We can define\nthe normalization condition for pure states P12 (ψ, ψ) = 14 (1 +\n||x||2 + ||y||2 + ||T ||2) = 1 where ||T ||2 = Tr(T T T ). Therefore we\nhave:\n||x||2 + ||y||2 + ||T ||2 = 3,\n\n(23)\n\nfor all pure states.\nAn interesting observation can be made here. Although\nseemingly axiom 2 does not imply any strong prior restrictions to d, we surprisingly have obtained the explicit number\n3 in the normalization condition (23). As we will see soon this\nrelation will play an important role in deriving d = 3 as the\nonly non-classical solution consistent with the axioms.\nVI. THE MAIN PROOFS\n\nWe will now show that only classical probability theory and\nquantum theory are in agreement with the three axioms.\nA. Ruling out the d even case\n\nLet us assume the total inversion Ex = −x being a physical\ntransformation. Let ψ = (x, y, T ) be a pure state of composite\nsystem. We apply total inversion to one of the subsystems\n\n\f8\nand obtain the state ψ′ = (E, 11)(x, y, T ) = (−x, y, −T ). The\nprobability\n1\n(1 − ||x||2 + ||y||2 − ||T ||2)\n4\n1\n= (||y||2 − 1)\n2\n\nP12 (ψ, ψ′ ) =\n\n(24)\n(25)\n\nhas to be nonnegative and therefore we have ||y|| = 1. Similarly, we apply (11, E) to ψ and obtain ||x|| = 1. Since the local\nvectors are of the unit norm we have ||T || = 1 and thus, according to lemma 1, the state ψ is a product state. We conclude\nthat no entangled states can exist if E is a physical transformation. As we will soon see, according to axiom 1 entangled\nstates must exist. Thus, E cannot represent a physical transformation. We will now show that this implies that d has to be\nodd. Recall that the set of transformations is at least the SO(d)\ngroup. d cannot be even since E would have unit determinant\nand would belong to SO(d). d has to be odd in which case E\nhas determinant -1. The set of physical transformations is the\nSO(d) group.\n\nB. Ruling out the d > 3 case.\n\nLet us define one basis set of two generalized bit product\nstates:\nψ1\nψ2\nψ3\nψ4\n\n=\n=\n=\n=\n\n(e1 , e1 , T 0 = e1 eT1 )\n(−e1 , −e1 , T 0 )\n(−e1 , e1 , −T 0 )\n(e1 , −e1 , −T 0 )\n\n(26)\n(27)\n(28)\n(29)\n\nwith e1 = (1, 0, . . . , 0)T . Now, we define two subspaces S 12\nand S 34 spanned by the states ψ1 , ψ2 and ψ3 , ψ4 , respectively.\nAxiom 1 states that these two subspaces behave like one-bit\nspaces, therefore they are isomorphic to the (d − 1)-sphere\nS 12 \u001b S 34 \u001b Sd−1 . The state ψ belongs to S 12 if and only if\nthe following holds:\nP12 (ψ, ψ1 ) + P12 (ψ, ψ2 ) = 1.\n\n(30)\n\nSince the ψ1 , . . . , ψ4 form a complete basis set, we have\nP12 (ψ, ψ3 ) = 0, P12 (ψ, ψ4 ) = 0.\n\n(31)\n\nA similar reasoning holds for states belonging to the S 34 subspace. Since the states ψ ∈ S 12 and ψ′ ∈ S 34 are perfectly distinguishable in a single shot experiment, we have\nP12 (ψ, ψ′ ) = 0. Therefore, S 12 and S 34 are orthogonal subspaces.\nAxiom 1 requires the existence of entangled states as it is\napparent from the following Lemma 2.\nLemma 2. The only product states belonging to S 12 are ψ1\nand ψ2 .\nWe define a local mapping between orthogonal subspaces\nS 12 and S 34 . Let the state ψ = (x, y, T ) ∈ S 12 , with x =\n\n(x1 , x2 , . . . , xd )T and y = (y1 , y2 , . . . , yd )T . Consider the onebit transformation R with the property Re1 = −e1 . The local\ntransformation of this type maps the state from S 12 to S 34 as\nshown by the following lemma:\nLemma 3. If the state ψ ∈ S 12 , then ψ′ = (R, 11)ψ ∈ S 34 and\nψ′′ = (11, R)ψ ∈ S 34 .\n\nT\nLet us define Ti(x) = (T i1 , . . . , T id ) and T(y)\ni = (T 1i , . . . , T di ) .\nThe correlation tensor can be rewritten in two different ways:\n (x) \n T1 \n (x) \n\u0011\n\u0010\n T2 \n(y)\n(y)\n.\n(32)\nT =  .  or T = T(y)\nT\n.\n.\n.\nT\n1\n2\nd\n .. \n (x) \nTd\n\nConsider now the case d > 3. We define local transformations Ri flipping the first and i-th coordinate and R jkl flipping\nthe first and j-th, k-th, and l-th coordinate with j , k , l , 1.\nLet ψ = (x, y, (T1(x) , . . . , Td(x) )T ) belong to S 12 . According to\nLemma 2, the states ψi = (Ri , 11)ψ and ψ jkl = (R jkl , 11)ψ belong to S 34 , therefore P12 (ψ, ψi ) = 0 and P12 (ψ, ψ jkl ) = 0. We\nhave:\n0 = P12 (ψ, ψi )\n1 − x21 + x22 + * * * − x2i + * * * + x2d + ||y||2\n\n(33)\n(34)\n\n−||T1(x) ||2 + ||T2(x) ||2 + * * * − ||Ti(x) ||2 + * * * + ||Td(x) ||2\n\n=\n=\n\n1 − 2x21 − 2x2i − 2||T1(x) ||2 − 2||Ti(x) ||2\n2(2 − x21 − x2i − ||T1(x) ||2 − ||Ti(x) ||2 ).\n\n2\n\n(35)\n2\n\n+ ||x|| + ||y|| + ||T ||2\n(36)\n\nSimilarly, we expand P12 (ψ, ψ jkl ) = 0 and together with the\nlast equation we obtain:\nx21 + x2i + ||T1(x) ||2 + ||Ti(x) ||2 = 2\n\nx21\n\n+\n\nx2j\n\n+\n\nx2k\n\n+\n\nx2l\n\n+\n\n||T1(x) ||2\n\n+\n\n(37)\n\n2\n||T(x)\nj ||\n\n+\n\n||Tk(x) ||2\n\n+\n\n||Tl(x) ||2\n\n= 2.\n\nSince this has to hold for all i, j, k, l we have:\nx2 = x3 = * * * = xd = 0\nT2(x) = T3(x) = * * * = Td(x) = 0.\n\n(38)\n(39)\n\nWe repeat this kind of reasoning for the transformations\n(11, Ri ) and (11, R jkl ) and obtain:\n(y) 2\n2\ny21 + y2i + ||T(y)\n1 || + ||Ti || = 2\n\ny21\n\n+\n\ny2j\n\n+\n\ny2k\n\n+\n\ny2l\n\n+\n\n2\n||T(y)\n1 ||\n\n+\n\n(40)\n\n2\n||T(y)\nj ||\n\n+\n\n2\n||T(y)\nk ||\n\n+\n\n2\n||T(y)\nl ||\n\n= 2.\n\nTherefore, we have\ny2 = y3 = * * * = yd = 0\nT(y)\n2\n\n=\n\nT(y)\n3\n\n= *** =\n\nT(y)\nd\n\n(41)\n= 0.\n\n(42)\n\nThe only non-zero element of the correlation tensor is T 11 and\nit has to be exactly 1, since ||T || ≥ 1. This implies that ψ is a\nproduct state, furthermore ψ = ψ1 or ψ = ψ2 .\nThis concludes our proof that only the cases d = 1 and\nd = 3 are in agreement with our three axioms. To distinguish\nbetween the two cases, one can invoke the continuity axiom\n(3') and proceed as in the reconstruction given by Hardy [19].\n\n\f9\nVII.\n\n\"TWO\" QUANTUM MECHANICS\n\nWe now obtain two solutions for the theory of a composite\nsystem consisting of two bits in the case when d = 3. One\nof them corresponds to the standard quantum theory of two\nqubits, the other one to its \"mirror\" version in which the states\nare obtained from the ones from the standard theory by partial\ntransposition. Both solutions are regular as far as one considers composite systems of two bits, but the \"mirror\" one cannot\nbe consistently constructed already for systems of three bits.\nTwo conditions (30) and (31) put the constraint to the form\nof ψ:\nx1 = −y1 ,\n\nT 11 = 1.\n\n(43)\n2\n\nThe subspace S 12 is isomorphic to the sphere S . Let us\nchoose ψ complementary to the one bit basis {ψ1 , ψ2 } in S 12 .\nWe have P12 (ψ, ψ1 ) = P12 (ψ, ψ2 ) = 1/2 and thus x1 = y1 = 0.\nFor simplicity we write ψ in the form:\n!\n!\n!!\n1 TTy\n0\n0\nψ=\n,\n,\n,\n(44)\nx\ny\nTx T\nwith x = (x2 , x3 )T , y = (y2 , y!3 )T , Ty = (T 12 , T 13 )T , T x =\nT 22 T 23\n(T 21 , T 31 )T and T =\n.\nT 32 T 33\nLet R(φ) be a rotation around the e1 axis. This transformation keeps S 12 invariant. Now, we show that the state ψ as\ngiven by equation (44) cannot be invariant under local transformation (11, R(φ)). To prove this by reductio ad absurdum\nsuppose the opposite, i.e. that (11, R(φ))ψ = ψ. We have three\nconditions\nR(φ)y = y,\n\nTTy RT (φ)\n\n=\n\nTTy ,\n\nT\n\nT R (φ) = T,\n\n(45)\n\nTTy\n\nwhich implies y = 0,\n= 0 and T = 0 thus\n    \n\n 0   0   1 0 0 \nψ =  x2  ,  0  ,  T 2 0 0  .\nx3\n0\nT3 0 0\n\n(46)\n\nAccording to equations (37) and (40) we can easily check that\n||x|| = 1, and thus ψ is locally equivalent to the state:\n\n    \n 0   0   1 0 0 \n\n\n\n\n\n\n′\n′\n(47)\nψ =  0  ,  0  ,  T 2 0 0  .\nT 3′ 0 0\n0\n1\nLet χ1 = (−e3 , e1 , −e3 eT1 ) and χ2 = (−e3 , −e1 , e3 eT1 ). The two\nconditions P(ψ′ , χ1 ) ≥ 0 and P(ψ′ , χ2 ) ≥ 0 become\n\n1\n1\n(1 − 1 − T 3′ ) = − T 3′ ≥ 0\n(48)\n4\n4\n1\n1\n(1 − 1 + T 3′ ) = T 3′ ≥ 0\n(49)\n4\n4\nand thus T 3′ = 0. The normalization condition (23) gives T 2′ =\n±1. The state ψ′ is not physical. This can be seen when one\nperforms the rotation (R, 11) where\n\n 1\n √2 − √12 0 \n\n\n√1\nR =  √1\n(50)\n0  .\n2\n\n 2\n0\n0 1\n\nFIG. 4: Correlations between results obtained in measurements of\ntwo bits in a maximal entangled (Bell's) state in standard quantum\nmechanics (Left) and \"mirror quantum mechanics\" (Right) along x,\ny and z directions. Why do we never see correlations as given in the\ntable on the right? The opposite sign of correlations on the right and\non the left is not a matter of convention or labeling of outcomes. If\none can transport the two bits parallel to the same detector, one can\ndistinguish operationally between the two types of correlations [57].\n\n√\nThe transformed correlation tensor has a component 2\nwhich is non-physical.\nTherefore, the transformation\n(11, R(φ))ψ draws a full circle of pure states in a plane orthogonal to ψ1 within the subspace S 12 . Similarly, the transformation (R(φ), 11) draws the same set of pure states when applied\nto ψ. Hence, for every transformation (11, R(φ1 )) there exists a\ntransformation (R(φ2), 11) such that (11, R(φ1))ψ = (R(φ2 ), 11)ψ.\nThis gives us a set of conditions:\nR(φ2 )x\nR(φ1 )y\nR(φ2 )T x\nTTy RT (φ1 )\n\n=\n=\n=\n=\n\nx\ny\nTx\nTTy\n\nR(φ2 )T = T RT (φ1 ),\n\n(51)\n(52)\n(53)\n(54)\n(55)\n\nwhich are fulfilled if x = y = T x = Ty = 0 and T =\ndiag[T 1 , T 2 ]. Equation (37) gives T 22 = T 32 = 1 and we finally\nend up with two different solutions:\nψQM = (0, 0, diag[1, −1, 1]) ∨ ψMQM = (0, 0, diag[1, 1, 1]).\n(56)\nThe first \"M\" in ψMQM stands for \"mirror\". The two solutions are incompatible and cannot coexist within the same\ntheory. The first solution corresponds to the triplet state φ+ of\nordinary quantum mechanics. The second solution is a totally\ninvariant state and has a negative overlap with, for example,\nthe singlet state ψ− for which T = diag[−1, −1, −1]. That is,\nif the system were prepared in one of the two states and the\nother one were measured, the probability would be negative.\nNevertheless, both solutions are regular at the level of two\nbits. The first belongs to ordinary quantum mechanics with\nthe singlet in the \"antiparallel\" subspace S 34 and the second\nsolution is \"the singlet state in the parallel subspace\" S 12 . We\nwill show that one can build the full state space, transformations and measurements in both cases. The states from one\nquantum mechanics can be obtained from the other by partial\ntransposition ψPT\nQM = ψMQM . In particular, the four maximal\nentangled states (Bell states) from \"mirror quantum mechanics\" have correlations of the opposite sign of those from the\nstandard quantum mechanics (see Figure 4).\nNow we show that the theory with \"mirror states\" is physically inconsistent when applied to composite system of three\n\n\f10\nbits. Let us first derive the full set of states and transformations for two qubits in standard quantum mechanics. We have\nseen that the state ψQM belongs to the subspace S 12 , and furthermore, that it is complementary (within S 12 ) to the product\nstates ψ1 and ψ2 . The totally mixed state within the S 12 subspace is E12 = 21 ψ1 + 12 ψ2 . The states ψ1 and ψQM span one\ntwo-dimensional plane, and the set of pure states within this\nplane is a circle:\nψ(x) = E12 + cos x (ψ1 − E12 ) + sin x (ψQM − E12 ) (57)\n= (cos x e1 , cos x e1 , diag[1, − sin x, sin x]). (58)\nWe can apply a complete set of local transformations to the\nset ψ(x) to obtain the set of all pure two-qubit states. Let us\nrepresent a pure state ψ = (x, y, T ) by the 4 × 4 Hermitian\nmatrix ρ:\n3\n3\n3\nX\nX\nX\n1\nρ = (11⊗ 11+\nxi σi ⊗ 11+\nyi 11⊗σi +\nT i j σi ⊗σ j ), (59)\n4\ni=1\ni=1\ni, j=1\n\nwhere σi , i ∈ {1, 2, 3}, are the three Pauli matrices. It is\neasy to show that the set of states (57) corresponds to the\nset of one-dimensional projectors |ψ(x)ihψ(x)|, where |ψ(x)i =\ncos 2x |00i + sin 2x |11i. The action of local transformations\n(R1 , R2 )ψ corresponds to local unitary transformation U1 ⊗\nU2 |ψihψ|U1† ⊗ U2† , where the correspondence between U and\nR is given by the isomorphism between the groups SU(2) and\nSO(3):\n\n 3\n \n3 X\nX\n \n\n1 \n†\n Ri j x j  σi  .\nUρU = 11 +\n(60)\n2\ni=1 j=1\n\nHere Ri j = Tr(σi Uσ j U † ) and xi = Trσi ρ. When we apply a\ncomplete set of local transformations to the states |ψ(x)i we\nobtain the whole set of pure states for two qubits. The group\nof transformations is the set of unitary transformations SU(4).\nThe set of states from \"mirror quantum mechanics\" can be\nobtained by applying partial transposition to the set of quantum states. Formally, partial transposition with respect to subsystem 1 is defined by action on a set of product operators:\nPT1 (ρ1 ⊗ ρ2 ) = ρT1 ⊗ ρ2 .\n\n(61)\n\nwhere ρ1 and ρ2 are arbitrary operators. Similarly, we can\ndefine the partial transposition with respect to subsystem 2,\nPT2 . To each unitary transformation U in quantum mechanics we define the corresponding transformation in \"mirror\nmechanics\", e.g. with respect to subsystem 1: PT1 UPT1 .\nTherefore, the set of transformations is a conjugate group\nPT1 SU(4)PT1 := {PT1 UPT1 | U ∈ SU(4)}. Note that we could\nequally have chosen to apply partial transposition with respect\nto subsystem 2, and would obtain the same set of states. In\nfact, one can show that PT1 UPT1 = PT2 U ∗ PT2 , where U ∗ is\na conjugate unitary transformation (see Lemma 4 in the Appendix). Therefore, the two conjugate groups are the same\nPT1 SU(4)PT1 = PT2 SU(4)PT2 . We can generate the set of\n\"mirror states\" by applying all the transformations PTUPT\nto some product state, regardless of which particular partial\ntransposition is used.\n\nNow, we show that \"mirror mechanics\" cannot be consistently extended to composite systems consisting of three bits.\nLet ψ p = (x, y, z, T 12, T 13 , T 23 , T 123 ) be some product state of\nthree bits, where x, y and z are local Bloch vectors, T 12 , T 13 ,\nT 23 and T 123 are two- and three-body correlation tensors, respectively. We can apply the transformations PTUi j PT to a\ncomposite system of i and j, and we are free to choose with\nrespect to which subsystem (i or j) to take the partial transposition. Furthermore, we can combine transformations in\n12 and 13 subsystems such that the resulting state is genuine\nthree-partite entangled, and we can choose to partially transpose subsystem 2 in both cases. We obtain the transformation\nU123 = PT2 U12 PT2 PT2 U23 PT2\n= PT2 U12 U23 PT2 .\n\n(62)\n(63)\n\nWhen we apply U123 to ψ p we obtain the state\nPT2 U12 U23 φ p , where φ p = PT2 ψ p is again some product state.\nThe state U12 U23 φ p is a quantum three qubit state. Since states\nψ p and φ p are product states and do belong to standard quantum states, we can use the formalism of quantum mechanics\nand denote them as |ψ p i and |φ p i. Furthermore, since the state\n|ψ p i is an arbitrary product state, without loss of generality we\nset |φ p i = |0i|0i|0i. We can choose U12 and U23 such that:\nU12 |0i|0i = |0i|0i\n1\nU12 |0i|1i = √ (|0i|1i + |1i|0i)\n2\nr\n1\n2\nU23 |0i|0i = √ |0i|1i +\n|1i|0i.\n3\n3\n\n(64)\n(65)\n(66)\n\nThis way we can generate the W-state\n|Wi = U12 U23 |0i|0i|0i\n1\n= √ (|0i|0i|1i + |0i|1i|0i + |1i|0i|0i).\n3\n\n(67)\n(68)\n\nWhen we apply partial transposition with respect to subsystem\n2, we obtain the corresponding \"mirror W-state\" which we\ndenote as WM -state, WM = PT2 W. The local Bloch vectors\nand two-body correlation tensors for the W state are\nx = y = z = (0, 0, 31 )T ,\nT 12 = T 13 = T 23 =\n\ndiag[ 32 , 32 , − 31 ],\n\n(69)\n(70)\n\nwhere |0i corresponds to result +1. Consequently, the local\nBloch vectors and the correlation tensor for WM -state are\nx = y = z = (0, 0, 31 )T ,\nT 12 =\nT 13 =\n\nT 23 = diag[ 32 , − 32 , − 13 ],\ndiag[ 32 , 32 , − 31 ].\n\n(71)\n(72)\n(73)\n\nThe asymmetry in the signs of correlations in the tensors\nT 12 , T 23 and T 13 leads to inconsistencies because they define three different reduced states ψi j = (xi , x j , T i j ), i j ∈\n{12, 23, 13}, which cannot coexist within a single theory. The\nstates ψ12 and ψ23 belong to \"mirror quantum mechanics\",\nwhile the state ψ13 belongs to ordinary quantum mechanics.\n\n\f11\nTo see this, take the state ψ = (0, 0, diag[−1, −1, 1]) which\nis locally equivalent to state ψMQM = (0, 0, 11). The overlap\n(measured probability) between the states ψ13 and ψ is negative\nP(ψ, ψ13 ) =\n\n1\n2 2 1\n1\n(1 − − − ) = − .\n4\n3 3 3\n6\n\n(74)\n\nWe conclude that \"mirror quantum mechanics\" – while being a perfectly regular solution for a theory of two bits – cannot be consistently extended to also describe systems consisting of many bits. This also answers the question why we find\nin nature only four types of correlations as given in the table\n(Figure 4) on the left, rather than all eight logically possible\nones.\n\nVIII. HIGHER-DIMENSIONAL SYSTEMS AND STATE\nUP-DATE RULE IN MEASUREMENT\n\nHaving obtained d = 3 for a two-dimensional system we\nhave derived quantum theory of this system. We have also\nreconstructed quantum mechanics of a composite system consisting of two qubits. Further reconstruction of quantum mechanics can be proceeded as in Hardy's work [19]. In particular, the reconstruction of higher-dimensional systems from the\ntwo-dimensional ones and the general transformations of the\nstate after measurement are explicitly given there. We only\nbriefly comment on them here.\nIn order to derive the state space, measurements and transformations for a higher-dimensional system, we can use quantum theory of a two-dimensional system in conjunction with\naxiom 1. The axiom requires that upon any two linearly independent states one can construct a two-dimensional subspace\nthat is isomorphic to the state space of a qubit (2-sphere). The\nstate space of a higher dimensional system can be characterized such that if the state is restricted to any given two dimensional subspace, then it behaves like a qubit. The fact that all\nother (higher-dimensional) systems can be built out of twodimensional ones suggests that the latter can be considered as\nfundamental constituents of the world and gives a justification\nfor the usage of the term \"elementary system\" in the formulations of the axioms.\nWhen a measurement is performed and an outcome is obtain, our knowledge about the state of the system changes and\nits representation in form of the probabilities must be updated\nto be in agreement with the new knowledge acquired in the\nmeasurement. This is the most natural update rule present in\nany probability theory. Only if one views this change as a\nreal physical process conceptual problems arise related to discontinuous and abrupt \"collapse of the wave function\". There\nis no basis for any such assumption. Associated with each\noutcome is the measurement vector p. When the outcome is\nobserved the state after the measurement is updated to p and\nthe measurement will be a certain transformation on the initial state. Update rules for more general measurements can\naccordingly be given.\n\nIX. WHAT THE PRESENT RECONSTRUCTION TELLS\nUS ABOUT QUANTUM MECHANICS\n\nIt is often said that reconstructions of quantum theory\nwithin an operational approach are devoid of ontological commitments, and that nothing can be generally said about the ontological content that arises from the first principles or about\nthe status of the notion of realism. As a supporting argument\none usually notes that within a realistic world view one would\nanyway expect quantum theory at the operational level to be\ndeducible from some underlying theory of \"deeper reality\".\nAfter all, we have the Broglie-Bohm theory [58] which is a\nnonlocal realistic theory in full agreement with the predictions\nof (non-relativistic) quantum theory. Having said this, we cannot but emphasize that realism does stay \"orthogonal\" to the\nbasic idea behind our reconstruction.\nBe it local or nonlocal, realism asserts that outcomes correspond to actualities objectively existing prior to and independent of measurements. On the other hand, we have shown\nthat the finiteness of information carrying capacity of quantum\nsystems is an important ingredient in deriving quantum theory.\nThis capacity is not enough to allow assignment of definite\nvalues to outcomes of all possible measurements. The elementary system has the information carrying capacity of one\nbit. This is signified by the possibility to decompose any state\nof an elementary system (qubit) in quantum mechanics in two\northogonal states. In a realistic theory based on hidden variables and an \"epistemic constraint\" on an observer's knowledge of the variables' values one can reproduce this feature at\nthe level of the entire distribution of the hidden variables [59].\nThat this is possible is not surprising if one bears in mind that\nhidden-variable theories were at the first place introduced to\nreproduce quantum mechanics and yet give a more complete\ndescription [67]. But any realism of that kind at the same\ntime assumes an infinite information capacity at the level of\nhidden variables. Even to reproduce measurements on a single qubit requires infinitely many orthogonal hidden-variable\nstates [60, 61, 62]. It might be a matter of taste whether or\nnot one is ready to work with this \"ontological access baggage\" [60] not doing any explanatory work at the operational\nlevel. But it is certainly conceptually distinctly different from\nthe theory analyzed here, in which the information capacity of\nthe most elementary systems – those which are by definition\nnot reducible further – is fundamentally limited.\nTo further clarify our position consider the Mach-Zehnder\ninterferometer in which both the path information and interference observable are dichotomic, i.e. two-valued observables. It is meaningless to speak about \"the path the particle took in the interferometer in the interference experiment\"\nbecause this would already require to assign 2 bits of information to the system, which would exceed its information\ncapacity of 1 bit [63]. The information capacity of the system is simply not enough to provide definite outcomes to all\npossible measurements. Then, by necessity the outcome in\nsome experiments must contain an element of randomness and\nthere must be observables that are complementarity to each\nother. Entanglement and consequently the violation of Bell's\ninequality (and thus of local realism) arise from the possibility\n\n\f12\nto define an abstract elementary system carrying at most one\nbit such that correlations (\"00\" and \"11\" in a joint measurement of two subsystems) are basis states.\n\nX.\n\nCONCLUSIONS\n\nQuantum theory is our most accurate description of nature\nand is fundamental to our understanding of, for example, the\nstability of matter, the periodic table of chemical elements,\nand the energy of the sun. It has led to the development\nof great inventions like the electronic transistor, the laser, or\nquantum cryptography. Given the enormous success of quantum theory, can we consider it as our final and ultimate theory?\nQuantum theory has caused much controversy in interpreting\nwhat its philosophical and epistemological implications are.\nAt the heart of this controversy lies the fact that the theory\nmakes only probabilistic predictions. In recent years it was\nhowever shown that some features of quantum theory that one\nmight have expected to be uniquely quantum, turned out to be\nhighly generic for generalized probabilistic theories. Is there\nany reason why the universe should obey the laws of quantum\ntheory, as opposed to any other possible probabilistic theory?\nIn this work we have shown that classical probability theory and quantum theory – the only two probability theories\nfor which we have empirical evidences - are special in a\nway that they fulfill three reasonable axioms on the systems'\ninformation carrying capacity, on the notion of locality and\non the reversibility of transformations. The two theories can\nbe separated if one restricts the transformations between the\npure states to be continuous [19]. An interesting finding is\nthat quantum theory is the only non-classical probability theory that can exhibit entanglement without conflicting one or\nmore axioms. Therefore – to use Schrödinger's words [64]\n– entanglement is not only \"the characteristic trait of quantum mechanics, the one that enforces its entire departure from\nclassical lines of thought\", but also the one that enforces the\ndeparture from a broad class of more general probabilistic theories.\n\nProof. If the state is a product state then ||T ||2 = ||x||2||y||2 =\n1. On the other hand, assume that the state ψ = (x, y, T ) satisfies ||T || = 1. Normalization (23) gives ||x|| = ||y|| = 1.\nLet φ p = (−x, −y, T 0 = xyT ) be a product state. We have\nP(ψ, φ p ) ≥ 0 and therefore\n1 − ||x||2 − ||y||2 + Tr(T T T 0 ) = −1 + Tr(T T T 0 ) ≥ 0.\n\n(75)\n\nThe last inequality Tr(T T T 0 ) ≥ 1 can be seen as (T, T 0) ≥ 1\nwhere (, ) is the scalar product in Hilbert-Schmidt space. Since\nthe vectors T, T 0 are normalized, ||T || = ||T 0 || = 1, the scalar\nproduct between them is always (T, T 0) ≤ 1. Therefore, we\nhave (T, T 0 ) = 1 which is equivalent to T = T 0 = xyT .\nQED\nLemma 2. The only product states belonging to S 12 are ψ1\nand ψ2 .\nProof. Let ψ p = (x, y, xyT) ∈ S 12 . We have\n1 = P12 (ψ p , ψ1 ) + P12 (ψ p , ψ2 )\n1\n=\n(1 + xe1 + ye1 + (xe1 )(ye1 ))\n4\n1\n(1 − xe1 − ye1 + (xe1 )(ye1 ))\n+\n4\n1\n=\n(1 + (xe1 )(ye1 ))\n2\n⇒ xe1 = ye1 = 1 ∨ xe1 = ye1 = −1\n⇔ x = y = e1 ∨ x = y = −e1 .\n\n(76)\n(77)\n(78)\n(79)\n(80)\n(81)\nQED\n\nLemma 3. If the state ψ ∈ S 12 , then ψ′ = (R, 11)ψ ∈ S 34 and\nψ′′ = (11, R)ψ ∈ S 34 .\nProof. If ψ ∈ S 12 we have\n\n1 = P12 (ψ, ψ1 ) + P12 (ψ, ψ2 )\n(82)\n= P12 ((R, 11)ψ, (R, 11)ψ1 ) + P12 ((R, 11)ψ, (R, 11)ψ2 ) (83)\n= P12 (ψ′ , ψ3 ) + P12 (ψ′ , ψ4 ).\n(84)\nSimilarly, one can show that (11, R)ψ ∈ S 34 .\nQED\n\nAcknowledgments\n\nWe thank M. Aspelmeyer, J. Kofler, T. Paterek and A.\nZeilinger for discussions. We acknowledge support from\nthe Austrian Science Foundation FWF within Project No.\nP19570-N16, SFB and CoQuS No. W1210-N16, the European Commission Project QAP (No. 015848) and the Foundational Question Institute (FQXi).\n\nXI. APPENDIX\n\nIn this appendix we give the proofs of the lemmas from the\nmain text.\nLemma 1. The lower bound ||T || = 1 is saturated, if and only\nif the state is a product state T = xyT .\n\nLemma 4. Let U be some operator with the following action\nin the Hilbert-Schmidt space; U(ρ) = UρU † , and PT 1 and\nPT 2 are partial transpositions with respect to subsystems 1\nand 2, respectively. The following identity holds: PT1 UPT1 =\nPT2 U ∗ PT2 , where U ∗ is the complex-conjugate operator.\nProof. We can expand UP into some product basis in the\nHilbert-Schmidt space U = i j ui j Ai ⊗ B j . We have\nPT1 UPT1 (ρ1 ⊗ ρ2 ) = PT1 {UρT1 ⊗ ρ2 U † }\nX\n=\nui j u∗kl (A∗k ρ1 ATi ) ⊗ (B jρ2 B†l )\n\n(85)\n\ni jkl\n\nX\n= PT2 { ui j u∗kl (A∗k ρ1 ATi ) ⊗ (B∗l ρT2 BTj )}\ni jkl\n\nX\n= PT2 { u∗kl ui j (A∗k ⊗ B∗l )(ρ1 ⊗ ρT2 )(ATi ⊗ BTj )}\ni jkl\n∗\n\n= PT2 U PT2 (ρ1 ⊗ ρ2 ),\n\n\f13\nfor arbitrary operators ρ1 and ρ2 .\nQED\n\n[1] S. Kochen and E.P. Specker, The Problem of Hidden Variables\nin Quantum Mechanics, J. Math. Mech. 17, 59 (1967).\n[2] J.S. Bell, On the Einstein-Podolsky-Rosen paradox, Physics 1,\n195-200 (1964); reprinted in J.S. Bell, \"Speakable and Unspeakable in Quantum Mechanics\" (Cambridge Univ. Press,\nCambridge, 1987).\n[3] A.J. Leggett, Nonlocal Hidden-Variable Theories and Quantum Mechanics: An Incompatibility Theorem, Found. Phys. 33,\n1469 (2003).\n[4] S. Gröblacher, T. Paterek, R. Kaltenbaek, Č. Brukner, M.\nŻukowski, M. Aspelmeyer and A. Zeilinger, An experimental\ntest of non-local realism, Nature 446, 871 (2007).\n[5] I. Biaynicki-Birula and J. Mycielski, Nonlinear Wave Mechanics, Ann. Phys. 100, 62 (1976).\n[6] A. Shimony, Proposed neutron interferometer test of some\nnonlinear variants of wave mechanics, Phys. Rev. A 20, 394\n(1979).\n[7] C.G. Shull, D. K. Atwood, J. Arthur, and M. A. Horne, Search\nfor a Nonlinear Variant of the Schrödinger Equation by Neutron\nInterferometry, Phys. Rev. Lett. 44, 765 (1980).\n[8] R. Gähler, A.G. Klein, A. Zeilinger, Neutron Optical Tests of\nNonlinear Wave Mechanics, Phys. Rev. A 23, 1611 (1981).\n[9] G. C. Ghirardi, A. Rimini and T. Weber, Unified dynamics for\nmicroscopic and macroscopic systems, Phys. Rev. D 34, 470\n(1986).\n[10] F. Károlyházy, Nuovo Cimento 42, 390 (1966). F. Károlyházy,\nGravitation and Quantum Mechanics of Macroscopic Bodies\n(Thesis, in Hungarian), Magyar Fizikai Folyóirat 22, 23 (1974).\n[11] L. Diosi, Models for universal reduction of macroscopic quantum fluctuations, Phys. Rev. A 40, 1165 (1989).\n[12] R. Penrose, On Gravity's role in Quantum State Reduction,\nGen. Relativ. Gravit. 28, 581 (1996).\n[13] P. Pearle, Reduction of the state vector by a nonlinear\nSchrödinger equation, Phys. Rev. D 13, 857 (1976).\n[14] H. Barnum, J. Barrett, M. Leifer and A. Wilce, Cloning\nand broadcasting in generic probabilistic models, (2006)\n(arXiv:quant-ph/061129).\n[15] H. Barnum, J. Barrett, M. Leifer and A.Wilce, A general\nno-cloning theorem, Phys. Rev. Lett. 99, 240501 (2007)\n(arXiv:0707.0620).\n[16] J. Barrett, Information processing in general probabilistic theories, Phys. Rev. A. 75, 032304 (2007)\n(arXiv:quant-ph/0508211).\n[17] S. Popescu and D. Rohrlich, Quantum nonlocality as an axiom,\nFound. Phys. 24, 379 (1994).\n[18] G. W. Mackey, Quantum Mechanics and Hilbert Space, American Mathematical Monthly 64, 45 (1957).\n[19] L. Hardy, Quantum Theory From Five Reasonable Axioms\n(2001) (arXiv.org/quant-ph/0101012).\n[20] G.M. D'Ariano, Probabilistic theories: what is special about\nQuantum Mechanics?, in \"Philosophy of Quantum Information and Entanglement\", Eds. A. Bokulich and G. Jaeger (Cambridge University Press, Cambridge UK), (arXiv:0807.4383).\n[21] P. Goyal, K.H. Knuth and J. Skilling, Origin of Complex Quantum Amplitudes and Feynman's Rules (2009)\n\n(arXiv:0907.0909)\n[22] C. Rovelli, Relational Quantum Mechanics, Int. J. Theor. Phys.\n35, 1637 (1996).\n[23] A. Zeilinger, A Foundational Principle for Quantum Mechanics, Found. Phys. 29, 631 (1999).\n[24] Č. Brukner and A. Zeilinger, Information and Fundamental Elements of the Structure of Quantum Theory, in \"Time, Quantum, Information\", Eds. L. Castell and O. Ischebeck (Springer,\n2003) (arXiv:quant-ph/0212084). Č. Brukner and A. Zeilinger,\nInformation Invariance and Quantum Probabilities, Found.\nPhys. 39, 677 (2009).\n[25] R. Clifton, J. Bub, and H. Halvorson, Characterizing Quantum\nTheory in Terms of Information-Theoretic Constraints, Found.\nPhys. 33(11), 1561 (2003).\n[26] A. Grinbaum, Elements of information-theoretic derivation of\nthe formalism of quantum theory, Int. J. Quant. Inf. 1(3), 289\n(2003).\n[27] W.K. Wootters, Statistical distance and Hilbert space, Phys.\nRev. D 23, 357 (1981).\n[28] D.I. Fivel, How interference effects in mixtures determine the\nrules of quantum mechanics, Phys. Rev. A 59, 2108 (1994).\n[29] J. Summhammer, Maximum predictive power and the superposition principle, Int. J. Theor. Phys. 33, 171 (1994). J.\nSummhammer, Quantum Theory as Efficient Representation of\nProbabilistic Information, (2007) (arXiv:quant-ph/0701181).\n[30] A. Bohr and O. Ulfbeck, Primary manifestation of symmetry.\nOrigin of quantal indeterminacy, Rev. Mod. Phys. 67, 1 (1995).\n[31] A. Caticha, Consistency, amplitudes and probabilities in quantum theory, Phys. Rev. A 57, 1572 (1998).\n[32] C.A. Fuchs, Quantum mechanics as quantum information (and\nonly a little more), in Ed. A. Khrenikov \"Quantum Theory: Reconstruction of Foundations\" (Växjo, Växjo University\nPress, 2002) (quant-ph/ 0205039). C.A. Fuchs and R. Schack,\nQuantum-Bayesian Coherence, (2009) (arXiv:0906.2187).\n[33] P. Grangier, Contextual objectivity : a realistic interpretation of quantum mechanics, Eur. J. Phys. 23, 331 (2002)\n(arXiv:quant-ph/0012122); P. Grangier, Contextual objectivity\nand the quantum formalism, Proc. of the conference \"Foundations of Quantum Information\" (Camerino, Italy, 2004)\n(arxiv.org/quant-ph/0407025).\n[34] S. Luo, Maximum Shannon Entropy, Minimum Fisher Information, and an Elementary Game, Found. Phys. 32, 1757 (2002).\n[35] R. Spekkens, Evidence for the epistemic view of quantum\nstates: A toy theory, Phys. Rev. A 75, 032110 (2007).\n[36] P. Goyal, Information-geometric reconstruction of quantum\ntheory, Phys. Rev. A 78, 052120 (2008).\n[37] W. van Dam, Implausible Consequences of Superstrong Nonlocality, (2005) (arXiv:quant-ph/0501159).\n[38] G. Brassard, H. Buhrman, N. Linden, A. Methot, A. Tapp and\nF. Unger, A limit on nonlocality in any world in which communication complexity is not trivial, Phys. Rev. Lett. 96, 250401\n(2006).\n[39] M. Pawlowski, T. Paterek, D. Kaszlikowski, V. Scarani, A. Winter, and M. Zukowski, A new physical principle: Information\nCausality (2009) (arXiv:0905.2292).\n\n\f14\n[40] M. Navascues and H. Wunderlich, A glance beyond the quantum model (arXiv:0907.0372).\n[41] K. Zyczkowski, Quartic quantum theory: an extension of the\nstandard quantum mechanics, J. Phys. A 41, 355302 (2008).\n[42] T. Paterek, B. Dakic, Č. Brukner, Theories of systems with limited information content (2008) (arXiv:0804.1423).\n[43] A. Peres, Proposed test for complex versus quaternion quantum\ntheory, Phys. Rev. Lett. 42, 683 (1979).\n[44] H. Kaiser, E.A. George, and S.A. Werner, Neutron interferometric search for quaternions in quantum mechanics, Phys. Rev A\n29, 2276 (1984).\n[45] A. Peres, Quaternionic quantum interferometry, in \"Quantum\nInterferometry\", Eds. F. De Martini et al., (VCH Publ., 1996),\n431-437 (arXiv:quant-ph/9605024).\n[46] R. D. Sorkin, Quantum Mechanics as Quantum Measure Theory, Mod. Phys. Lett. A 9, 3119 (1994) (arXiv:gr-qc/9401003).\n[47] U. Sinha, C. Couteau, Z. Medendorp, I. Söllner, R.\nLaflamme, R. Sorkin and G. Weihs, Testing Born's Rule in\nQuantum Mechanics with a Triple Slit Experiment, (2008)\n(arXiv:0811.2068). Submitted to the proceedings of Foundations of Probability and Physics-5, Vaxjo, Sweden, August\n2008.\n[48] A. Grinbaum, Reconstruction of Quantum Theory, Brit. J. Phil.\nSci. 8, 387 (2007).\n[49] D. Gross, M. Mueller, R. Colbeck, and O.C.O. Dahlsten, All\nreversible dynamics in maximally non-local theories are trivial\n(2009) (arXiv:0910.1840). O.C.O. Dahlstein, privite communication.\n[50] C.F. von Weizsäcker, 1958, Aufbau der Physik (Carl Hanser,\nMünchen,1958).\n[51] J.A. Wheeler, Law without Law in Quantum Theory and Measurement, Eds. J.A. Wheeler and W.H. Zurek (Princeton University Press, Princeton, 1983) 182.\n[52] H. Barnum and A. Wilce, Information processing in convex\noperational theories, to be published in DCM/QPL (Developments in Computational Models / Quantum Programming Languages) (Oxford University, 2009) (arXiv:0908.2352).\n[53] S. Abramsky and B. Coecke, A categorical semantics of quantum protocols, Proc. 19th IEEE Conference on Logic in Computer Science, 415–425 (IEEE Computer Science Press, 2004).\n\n[54] See, for example, J. Ambjorn, J. Jurkiewicz and R. Loll, Reconstructing the Universe, Phys. Rev. D 72 064014 (2005).\n[55] H. Boerner, Representations of groups, (North- Holland publishing company, Amsterdam 1963).\n[56] R.A. Horn and C.R. Johnson, Matrix Analysis, (Cambridge\nUniversity Press, Chapter 8, 1990).\n[57] R. Spekkens, privite communication.\n[58] D. Bohm, A Suggested Interpretation of the Quantum Theory\nin Terms of \"Hidden Variables\" I, Phys. Rev. 85, 166 (1952).\nD. Bohm, A Suggested Interpretation of the Quantum Theory in\nTerms of \"Hidden Variables\" II, Phys. Rev. 85, 180 (1952).\n[59] See Ref [35] for a local version of such hidden-variable theory\nin which quantum mechanical predictions are partially reproduced.\n[60] L. Hardy, Quantum Ontological Excess Baggage, Stud. Hist.\nPhilos. Mod. Phys. 35, 267 (2004).\n[61] A. Montina, Exponential growth of the ontological space dimension with the physical size, Phys. Rev. A 77, 022104 (2008).\n[62] B. Dakic, M. Suvakov, T. Paterek, and Č. Brukner, Efficient\nHidden-Variable Simulation of Measurements in Quantum Experiments, Phys. Rev. Lett. 101, 190402 (2008).\n[63] Č. Brukner and A. Zeilinger, Young's experiment and the finiteness of information, Phil. Trans. R. Soc. Lond. A 360, 1061\n(2002).\n[64] E. Schrödinger, Discussion of Probability Relations Between\nSeparated Systems, Proceedings of the Cambridge Philosophical Society 31 (1935) 555-563; 32 (1936): 446-451\n[65] Hardy considers unnormalized states and for that reason takes\nK = d + 1 (in his notation) as the number of degrees of freedom.\n[66] As noted by Zyczkowski [41] it is thinkable that within\nthe time scales of standard experimental conditions \"hyperdecoherence\" may occur which cause a system described in the\nframework of the higher-order theory to specific properties and\nbehavior according to predictions of standard (complex) quantum theory.\n[67] That this cannot be done without allowing nonlocal influences\nfrom space-like distant regions is a valid point for itself, which\nwe do not want to follow here further.\n\n\f"}