{"id": "http://arxiv.org/abs/0709.2044v1", "guidislink": true, "updated": "2007-09-13T11:27:52Z", "updated_parsed": [2007, 9, 13, 11, 27, 52, 3, 256, 0], "published": "2007-09-13T11:27:52Z", "published_parsed": [2007, 9, 13, 11, 27, 52, 3, 256, 0], "title": "Lemaitre-Tolman-Bondi model and accelerating expansion", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0709.3596%2C0709.1336%2C0709.3505%2C0709.3127%2C0709.1121%2C0709.1247%2C0709.1051%2C0709.3456%2C0709.2989%2C0709.2612%2C0709.3443%2C0709.2547%2C0709.3906%2C0709.1980%2C0709.2138%2C0709.0081%2C0709.2566%2C0709.3681%2C0709.1936%2C0709.0838%2C0709.0618%2C0709.1900%2C0709.2271%2C0709.3736%2C0709.0287%2C0709.1961%2C0709.4395%2C0709.2407%2C0709.2025%2C0709.3572%2C0709.2313%2C0709.1872%2C0709.0089%2C0709.0108%2C0709.1375%2C0709.0696%2C0709.3638%2C0709.3465%2C0709.2428%2C0709.2791%2C0709.4451%2C0709.0525%2C0709.1219%2C0709.2105%2C0709.1600%2C0709.1008%2C0709.1493%2C0709.3700%2C0709.0849%2C0709.0064%2C0709.0366%2C0709.3642%2C0709.0250%2C0709.2044%2C0709.3911%2C0709.0201%2C0709.3302%2C0709.0185%2C0709.3987%2C0709.3784%2C0709.4500%2C0709.2974%2C0709.4490%2C0709.1444%2C0709.0860%2C0709.0284%2C0709.2497%2C0709.0901%2C0709.1352%2C0709.4186%2C0709.0119%2C0709.2958%2C0709.3577%2C0709.1802%2C0709.4320%2C0709.0480%2C0709.2299%2C0709.0610%2C0709.3253%2C0709.2694%2C0709.3860%2C0709.0200%2C0709.1126%2C0709.0146%2C0709.1166%2C0709.4221%2C0709.0218%2C0709.2693%2C0709.2995%2C0709.0589%2C0709.4155%2C0709.1498%2C0709.3747%2C0709.2433%2C0709.0057%2C0709.4271%2C0709.2449%2C0709.0320%2C0709.2486%2C0709.2982%2C0709.2753&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Lemaitre-Tolman-Bondi model and accelerating expansion"}, "summary": "I discuss the spherically symmetric but inhomogeneous Lemaitre-Tolman- Bondi\n(LTB) metric, which provides an exact toy model for an inhomogeneous universe.\nSince we observe light rays from the past light cone, not the expansion of the\nuniverse, spatial variation in matter density and Hubble rate can have the same\neffect on redshift as acceleration in a perfectly homogeneous universe. As a\nconsequence, a simple spatial variation in the Hubble rate can account for the\ndistant supernova data in a dust universe without any dark energy. I also\nreview various attempts towards a semirealistic description of the universe\nbased on the LTB model.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0709.3596%2C0709.1336%2C0709.3505%2C0709.3127%2C0709.1121%2C0709.1247%2C0709.1051%2C0709.3456%2C0709.2989%2C0709.2612%2C0709.3443%2C0709.2547%2C0709.3906%2C0709.1980%2C0709.2138%2C0709.0081%2C0709.2566%2C0709.3681%2C0709.1936%2C0709.0838%2C0709.0618%2C0709.1900%2C0709.2271%2C0709.3736%2C0709.0287%2C0709.1961%2C0709.4395%2C0709.2407%2C0709.2025%2C0709.3572%2C0709.2313%2C0709.1872%2C0709.0089%2C0709.0108%2C0709.1375%2C0709.0696%2C0709.3638%2C0709.3465%2C0709.2428%2C0709.2791%2C0709.4451%2C0709.0525%2C0709.1219%2C0709.2105%2C0709.1600%2C0709.1008%2C0709.1493%2C0709.3700%2C0709.0849%2C0709.0064%2C0709.0366%2C0709.3642%2C0709.0250%2C0709.2044%2C0709.3911%2C0709.0201%2C0709.3302%2C0709.0185%2C0709.3987%2C0709.3784%2C0709.4500%2C0709.2974%2C0709.4490%2C0709.1444%2C0709.0860%2C0709.0284%2C0709.2497%2C0709.0901%2C0709.1352%2C0709.4186%2C0709.0119%2C0709.2958%2C0709.3577%2C0709.1802%2C0709.4320%2C0709.0480%2C0709.2299%2C0709.0610%2C0709.3253%2C0709.2694%2C0709.3860%2C0709.0200%2C0709.1126%2C0709.0146%2C0709.1166%2C0709.4221%2C0709.0218%2C0709.2693%2C0709.2995%2C0709.0589%2C0709.4155%2C0709.1498%2C0709.3747%2C0709.2433%2C0709.0057%2C0709.4271%2C0709.2449%2C0709.0320%2C0709.2486%2C0709.2982%2C0709.2753&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "I discuss the spherically symmetric but inhomogeneous Lemaitre-Tolman- Bondi\n(LTB) metric, which provides an exact toy model for an inhomogeneous universe.\nSince we observe light rays from the past light cone, not the expansion of the\nuniverse, spatial variation in matter density and Hubble rate can have the same\neffect on redshift as acceleration in a perfectly homogeneous universe. As a\nconsequence, a simple spatial variation in the Hubble rate can account for the\ndistant supernova data in a dust universe without any dark energy. I also\nreview various attempts towards a semirealistic description of the universe\nbased on the LTB model."}, "authors": ["Kari Enqvist"], "author_detail": {"name": "Kari Enqvist"}, "author": "Kari Enqvist", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/s10714-007-0553-9", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0709.2044v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0709.2044v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Invited Review for a special Gen. Rel. Grav. issue on Dark Energy. 17\n  pages, 3 figures", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0709.2044v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0709.2044v1", "journal_reference": "Gen.Rel.Grav.40:451-466,2008", "doi": "10.1007/s10714-007-0553-9", "fulltext": "arXiv:0709.2044v1 [astro-ph] 13 Sep 2007\n\nLemaitre-Tolman-Bondi model and\naccelerating expansion\nAuthors: Kari Enqvist\n\nDepartment of Physical Sciences and Helsinki Institute of Physics,\nFIN-00014 University of Helsinki\n\nFebruary 1, 2008\n\nAbstract\nI discuss the spherically symmetric but inhomogeneous Lemaitre-TolmanBondi (LTB) metric, which provides an exact toy model for an inhomogeneous\nuniverse. Since we observe light rays from the past light cone, not the expansion\nof the universe, spatial variation in matter density and Hubble rate can have the\nsame effect on redshift as acceleration in a perfectly homogeneous universe. As\na consequence, a simple spatial variation in the Hubble rate can account for the\ndistant supernova data in a dust universe without any dark energy. I also review\nvarious attempts towards a semirealistic description of the universe based on the\nLTB model.\n\nKeywords: Dark Energy, Supernovae, Cosmology, Gravitation.\n\n\f1 Introduction\nThe simplest homogeneous and isotropic cosmological models, based on the FriedmannRobertson-Walker (FRW) metric, have proved to be remarkably successful ever since\nEdwin Hubble in 1929 rather cautiously suggested that the apparent linear correlation\nbetween the observed redshifts and distances of 24 galaxies could hint towards the\npossibility \"that the velocity-distance relation may represent the de Sitter effect, and\nhence that numerical data may be introduced into discussions of the general curvature\nof space\" [1]. Indeed, numerical data now guides the development of cosmology,\nwhich has become a precision science, albeit mostly within the framework of a\nperfectly homogenous background metric.\nThe FRW universe is characterized by two functions, the Hubble rate H and\nthe density parameter Ω, or the average expansion rate and the average density of\nmass energy, respectively, which depend on time but are independent of the spatial\nlocation. However, one should keep in mind that their values cannot be extracted\ndirectly from the observations but must be deduced from the properties of light coming\nfrom the past light cone. In the context of the FRW model this is almost trivial, since\nthe redshift z and scale factor a(t) are everywhere related by z = a(to )/a(te ) − 1,\nwhere the subscripts refer respectively to the observation and the emission of light.\nThis theoretical simplicity should however not cloud the fact that all cosmological\nparameter determination requires an element of interpretation of the data. Of course,\nthe FRW interpretation of the properties of the past light cone has served cosmology\nwell, giving a good fit to observations and, until the late 90's, implying a matter\ndominated universe with Ω ≈ ΩM .\nThe situation changed dramatically with the WMAP [2] and distant supernova data\n[3]. Considering the recent data from supernovae [4, 5], galaxy distributions [6] and\nanisotropies of the cosmic microwave background [7], the simplest FRW model would\nnow lead to a highly contradictory picture of the universe, with the following best fit\nvalues for the average matter density:\n• Cosmic microwave background: ΩM ∼ 1\n• Galaxy surveys: ΩM ∼ 0.3\n• Type Ia supernovae: ΩM ∼ 0\nAs is well known, the glaring discrepancies between the different data sets have\nconventionally been remedied by introducing the cosmological constant Λ or vacuum\nenergy ΩΛ to the Einstein equations. This gives rise to an accelerated expansion\nof the universe. As a consequence, the apparent dimming of the luminosity of\ndistant supernovae finds, in the context of perfectly homogeneous universe, a natural\nexplanation1.\nHowever, although the cosmological concordance ΛCDM-model [8] fits the observations well, there is no theoretical understanding of the origin of the cosmological\n1\n\nEven if the primordial perturbation is not scale free, the combination of the CMB fluctuations\nand the shape of the correlation function up to ∼ 100h−1 Mpc, seems to require dark energy for a\nhomogeneous FRW model [10].\n\n1\n\n\fconstant or its magnitude. For particles physicists, who have spent a long time\ntrying to prove that the cosmological constant must be zero, the tremendously small\ncosmological constant which just now happens to start to dominate the energy budget\nof the universe, is a theoretical nightmare. There exist a large number of different\ndark energy models (see e.g. [8, 9]) that attempt to provide a dynamical explanation\nfor the cosmological constant, but none of them are compelling from particle physics\npoint of view; moreover, very often they require fine-tuning. Modifications of the\ngeneral theory of relativity on cosmological scales appear to suffer from analogous\nproblems. For instance, f (R) gravity theories [11] in the metric formalism are plagued\nby instabilities [12] while in the Palatini approach the cosmological constant seems to\nbe essentially the only consistent modification that fits all the cosmological data [13].\nFacing such difficulties, one might be tempted to consider relinquishing the FRW\nassumption of the perfect homogeneity of the universe. After all, inhomogeneities\nare abundant in the universe: there are not only clusters of galaxies but also large\nvoids. Because general relativity is a non-linear theory, even relatively small local\ninhomogeneities with a sufficiently large density contrast could in principle give rise\nto cosmological evolution that is not accessed by the usual cosmological perturbation\ntheory in an FRW background. In fact, the potentially interesting consequences of\nthe inhomogeneities were recognized already at the time when the homogeneous and\nisotropic models of the universe were first studied, but their impact on the global\ndynamics of the universe is still largely unknown (see e.g. [14]). Then the question\narises: could the acceleration of the universe be just a trick of light, a misinterpretation\nthat arises due to the oversimplification of the real, inhomogeneous universe inherent\nin the FRW model? Light, while traveling though inhomogeneities, does not see\nthe average Hubble expansion but rather feels its variations, which could sum up to\nan important correction2 . This effect is particularly important for the case of large\nscale inhomogeneities which will be the focus of the present paper. If the local\nHubble expansion rate were to vary smoothly at scales of the order of, say, thousand\nmegaparsecs, that would very much change our interpretation of the distant supernova\nredshifts. In such an inhomogeneous universe we could also just happen to be located\nin a special position. For instance, fate could have relegated us to an underdense region\nwith a larger than average local Hubble parameter so that the discrepancy between\nnearby and distant supernovae luminosities could be resolved without dark energy.\nLocal inhomogeneities have recently been invoked as the culprit for the apparent\nacceleration of the expansion of the universe3, in particular by virtue of their socalled backreaction on the metric (for a discussion on the issues involved and a\ncomprehensive list of references, see [17, 18]). One constructs an effective description\nof the universe by averaging out the inhomogeneities to obtain averaged, effective\nEinstein equations which, in addition to the terms found in the usual homogeneous\ncase, include new terms that represent the effect of the inhomogeneities [19, 20, 21].\nHowever, since we can only observe the redshift and energy flux of light arriving\n2\n\nFor a recent calculation of the small scale inhomogeneity-induced correction to the cosmological\nconstant that one would infer from an analysis of the luminosities and redshifts of Type Ia supernovae,\nassuming a homogeneous universe, see [15].\n3\nInhomogeneities as an alternative to dark energy were first discussed in [16].\n\n2\n\n\ffrom a given source, not the expansion rate or the matter density of the universe\nnor their averages, one may wonder what are the actual observables related to the\naveraged equations. To wit, since we do not observe the average expansion of\nthe universe directly, its average acceleration is also an indirect conclusion, arising\nfrom the fact that in the perfectly homogeneous cosmological models dark energy is\nrequired for a good fit. Consequently, there is no a priori reason to assume that an\naccelerated expansion is necessarily required to fit the data if one assumes a general\ninhomogeneous model of the universe. One may also add that the averaging procedure\nas such is not without problems: in general it is not correct to integrate out constrained\ndegrees of freedom as if they were independent, and in cosmology the fact that we\ncan make observations only along our past light cone makes the observable universe\na constrained system. Hence it would be desirable to study the effects of the the\ninhomogeneities on the directly observable light in an exact cosmological model.\nUnfortunately, in the presence of generic inhomogeneities this would be practically\nan impossible task. Instead, one must resort to toy models, the simplest of which is\nthe spherically symmetric but inhomogeneous Lemaitre-Tolman-Bondi (LTB) model\n[22, 23, 24].\nThe great virtue of the LTB model is that it is exact. Because of its high degree of\nsymmetry, it may not be realistic as such, but the LTB model is nevertheless interesting\nat least on two counts. First, it serves as a simple testing ground for the effects of\ninhomogeneities when fitting the cosmological data without dark energy. Second, since\nthe fits can be performed unambiguously, the nature of the effective accelaration in the\nmodels where the spatial degrees of freedom have been averaged out, can be made\ntransparent by comparing the averaged and \"exact\" models.\nOf course, one can also take the LTB model more seriously. For instance, one may\nuse the LTB metric to describe a local underdense bubble in FRW universe, for which\nthere is some evidence both from supernova [25] and galaxy data [26]. First attempts\nalong these directions [27] assumed an underdense region separated from the outside\nhomogeneous FRW universe by a singular mass shell, followed by investigations of\nmore realistic models with a continuous transition between the inner underdensity and\nthe outer homogeneous universe (see e.g. [28, 29]). More complicated situations,\nincluding off-centered observers, can also be addressed, as will be discussed in Sect.\n4.\n\n2 The Lemaitre-Tolman-Bondi metric\nLet us consider a spherically symmetric dust universe with radial inhomogeneities as\nseen from our location at the center. Choosing spatial coordinates to comove (dxi /dt =\n0) with the matter, the spatial origin (xi = 0) as the symmetry center, and the time\ncoordinate (x0 ≡ t) to measure the proper time of the comoving fluid, the line element\ntakes the general form [22, 23, 24]\n\u0001\nds2 = −dt2 + X 2 (r, t)dr 2 + A2 (r, t) dθ2 + sin2 θdφ2 ,\n(2.1)\n3\n\n\fwhere the functions A(r, t) and X(r, t) have both temporal and spatial dependence.\nThe homogeneous FRW-metric is a special case and is obtained by letting\nX(r, t) → √\n\na(t)\n, A(r, t) → a(t)r.\n1 − kr 2\n\n(2.2)\n\nThe energy momentum tensor is given by\nT μν = −ρM (r, t)δ0μ δν0 − ρΛ δ μν ,\n\n(2.3)\n\nwhere ρM (r, t) is the matter density, uμ = δ0μ represent the components of the 4velocity-field of the fluid, and we have kept the vacuum energy ρΛ for generality. Note\nthat although the fluid is staying at fixed spatial coordinates, it can physically move in\nthe radial direction. Plugging Eq. (2.1) into the Einstein equation, Gμν = 8πGT μν ,\none finds the set of equations\n!2 \u0012\n\u00132\nA′ X ′\n1\nȦ\nA′′\nẊ Ȧ\nA′\n−2\n+2\n+2\n+\n+\n−\n= 8πG(ρM + ρΛ ) , (2.4)\nAX 2\nAX 3\nAX A2\nA\nAX\nȦ′ = A′\nÄ\n1\n2 + 2+\nA A\n\nȦ\nA\n\n!2\n\n−\n\nẊ\n,\nX\n\n\u0012\n\nA′\nAX\n\n(2.5)\n\u00132\n\n= 8πGρΛ ,\n\n(2.6)\n\nand\nÄ Ȧ Ẋ A′ X ′ Ẍ\nA′′\n+\n+\n+\n+\n= 8πGρΛ .\n(2.7)\nAX 2 A A X\nAX 3 X\nThese contain only three independent differential equations, and we may solve Ẋ and\nẌ from Eq. (2.5) and A′2 and A′′ from Eq. (2.6). Then one can substitute these into\nEq. (2.7) and find that it yields an identity. Thus only two of equations (2.5)-(2.7) are\nindependent. One can easily solve Eq. (2.5) to obtain\n−\n\nX(r, t) = C(r)A′ (r, t) ,\n\n(2.8)\n\nwhere\np the function C(r) depends only on the coordinate r. By redefining C(r) ≡\n1/ 1 − k(r), where k(r) < 1, we can thus write the LTB metric Eq. (2.1) in its usual\nform:\n\u0001\n(A′ (r, t))2 2\ndr + A2 (r, t) dθ2 + sin2 θdφ2 ,\n(2.9)\nds2 = −dt2 +\n1 − k(r)\nwhere k(r) is a function associated with the curvature of t = const. hypersurfaces.\nThe FRW metric is the limit A(r, t) → a(t)r and k(r) → kr 2 .\nThe two independent equations are given by\nȦ2 + k(r) 2ȦȦ′ + k ′ (r)\n+\n= 8πG(ρM + ρΛ ),\nA2\nAA′\nȦ2 + 2AÄ + k(r) = 8πGρΛ A2 .\n4\n\n(2.10)\n(2.11)\n\n\fThe first integral of Eq. (2.11) is\nF (r) 8πG\nk(r)\nȦ2\n=\n+\nρΛ − 2 ,\n2\n3\nA\nA\n3\nA\n\n(2.12)\n\nwhere F (r) is a non-negative function that, like k(r), is fixed by the boundary\ncondition. Substituting Eq. (2.12) into Eq. (2.10) yields\nF′\n= 8πGρM .\nA′ A2\n\n(2.13)\n\nBy combining Eqs. (2.10) and (2.11) we can construct the generalized acceleration\nequation\n2 Ä 1 Ä′\n4πG\n+\n=−\n(ρM − 2ρΛ )\n(2.14)\n′\n3A 3A\n3\nwhich implies that the total acceleration, represented by the left hand side, is negative\neverywhere unless the vacuum energy is large enough: ρΛ > ρM /2. However, it does\nnot exclude the possibility of having radial acceleration (Ä′ (r, t) > 0), even in the pure\ndust universe, if the angular scale factor A(r, t) is decelerating fast enough, and vice\nversa. This serves to demonstrate how the very notion of the acceleration becomes\nambiguous in the presence of the inhomogeneities [30].\nThe boundary condition functions F (r) and k(r) are specified by the exact\nphysical nature of the inhomogeneities. Their relation to the FRW model parameters\ncan be recognized by comparing Eq. (2.12) with the Einstein equation for the\nhomogeneous FRW-model\n8πG\nk\nȧ(t)\n=\n(ρM + ρΛ ) − 2\na(t)\n3\na\n\u0014\n\u0010 a \u00113\n\u0010 a \u00112 \u0015\n0\n0\n2\n= H0 ΩM\n,\n+ ΩΛ + (1 − ΩΛ − ΩM )\na\na\n\nH 2(t) ≡\n\n(2.15)\n(2.16)\n\nwhere a0 ≡ a(t0 ) and H0 ≡ H(t0 ). Thus, a comparison between Eqs. (2.12) and\n(2.15) motivates one to define the local Hubble rate as\nH(r, t) ≡\n\nȦ(r, t)\n.\nA(r, t)\n\n(2.17)\n\nThe local matter density can be defined through\nF (r) ≡ H02 (r)ΩM (r)A30 (r) ,\n\n(2.18)\n\nk(r) ≡ H02 (r)(ΩM (r) + ΩΛ (r) − 1)A20 (r) ,\n\n(2.19)\n\nwith\nwhere we have defined the boundary values at t0 through A0 (r) ≡ A(r, t0 ), H0 (r) ≡\nH(r, t0 ), and ΩΛ (r) ≡ 8πGρΛ /3H02 (r). With these definitions, the position-dependent\nHubble rate, Eq. (2.12), takes a physically transparent form [31]:\n\"\n\u0012 \u00133\n\u0012 \u00132 #\nA\nA0\n0\nH 2 (r, t) = H02 (r) ΩM (r)\n,\n(2.20)\n+ ΩΛ (r) + Ωc (r)\nA\nA\n5\n\n\fwhere Ωc (r) ≡ 1 − ΩΛ (r) − ΩM (r).\nThe difference between the conventional Friedmann equation (2.15) and its LTB\ngeneralization, Eq. (2.20), is that all the quantities in the LTB case depend on the rcoordinate. Thus in the presence of inhomogeneities, the values of the Hubble rate\nand the matter density can vary at every spatial point so that the inhomogeneous\ndust models are defined by two functions of the spatial coordinates: H0 (xi ) and\nΩM (xi ). As a consequence, the inhomogeneities are of two physically different kinds:\ninhomogeneities in the matter distribution, and inhomogeneities in the expansion\nrate. Although their dynamics are coupled via the Einstein equation, as boundary\nconditions they are independent. The universe could have an inhomogeneous big bang,\nwhere the universe came into being at different times at different points, and/or an\ninhomogeneous matter density. This opens up the possibility for an inhomogeneous\nuniverse that has a homogeneous present-day ΩM ; a model of this kind could\npotentially fit the supernova data as well as the galaxy surveys without invoking dark\nenergy. However, if ΩM (r) = const., the physical matter distribution ρM itself has\na spatial dependence provided H0 (r) 6= const.. It can be made constant by choosing\nΩM (r)H02(r) = const.\nThe spatial dependence holds true even for the gauge freedom of the scale function.\nIn the FRW case the present value of the scale factor a(t0 ) can be chosen to be any\npositive number. Similarly, the corresponding present-day scale function A(r, t0 ) of\nthe LTB model can be chosen to be any smooth and invertible positive function. In\nwhat follows we will choose the conventional gauge\nA(r, t0 ) = r .\n\n(2.21)\n\nIntegrating Eq. (2.20) then gives the relation between the scale factor A(r, t) and the\ncoordinates r and t, which can also be used to find the age of the LTB universe. One\nfinds\nZ 1\n1\ndx\np\nt0 − t =\n.\n(2.22)\nH0 (r) A(r,t)\nΩM (r)x−1 + ΩΛ (r)x2 + Ωc (r)\nA0 (r)\n\nFor any space-time point with coordinates (t, r, θ, φ), Eq. (2.22) determines the\nfunction A(r, t) and all its derivatives. Thus the metric Eq. (2.9) is specified, and given\nthe inhomogeneities, all the observable quantities can be computed. Eq. (2.22) can be\nintegrated in terms of elementary functions when ΩΛ (r) = 0 or ΩΛ (r) + ΩM (r) = 1;\nas an example, in the latter case one finds\n\n\ns\n\u0012\n\u00133\np\n2\narsinh ω(r) A(r, t) − arsinh ω(r) , (2.23)\n(t − t0 )H0 = p\nA0 (r)\n3 1 − ΩM (r)\nwhere\n\nω(r) =\n\n1 − ΩM (r)\n.\nΩM (r)\n\nIn this particular case A(r, t) can be found explicitly as\nr\n\u0015\n\u0014\n3\nH0 (r)sinh(τ ) ,\nA(r, t) = A0 (r) cosh(τ ) +\n8πGρΛ\n6\n\n(2.24)\n\n(2.25)\n\n\fwhere τ =\n\n√\n\n6πGρΛ (t − t0 ).\n\n3 Inhomogeneities and luminosity distance\nTo compare the inhomogeneous LTB model e.g. with the supernova observations,\nwe need an equation that relates the redshift and energy flux of light with the exact\nnature of the inhomogeneities. For this, one must study propagation of light in the\nLTB universe4. Let us here derive the appropriate equations for notational clarity; a\nmore general derivation for an off-center observer can be found in [33].\nFrom the symmetry of the situation, it is clear that light can travel radially, that is,\nthere exist geodesics with dθ = dφ = 0. Moreover, since light always travels along\nnull geodesics, we have ds2 = 0. Inserting these conditions into the equation for the\nline element, Eq. (2.9), we obtain the constraint equation for light rays\ndt\ndr A′ (r, t)\n,\n=− p\ndu\ndu 1 − k(r)\n\n(3.1)\n\nwhere u is a curve parameter, and the minus sign indicates that we are studying radially\nincoming light rays.\nConsider two light rays with solutions to Eq. (3.1) given by t1 = t(u) and t2 =\nt(u) + λ(u). Inserting these to Eq. (3.1) we obtain\nd\ndt(u)\ndr A′ (r, t)\nt1 =\n=− p\ndu\ndu\ndu 1 − k(r)\n\nd\ndλ(u)\ndt(u) dλ(u)\ndr A′ (r, t)\n+\nt2 =\n+\n=− p\ndu\ndu\ndu\ndu 1 − k(r)\ndu\n\ndr A′ (r, t) + Ȧ′ (r, t)λ(u)\ndr A′ (r, t(u) + λ(u))\nd\np\np\n=−\n,\nt2 = −\ndu\ndu\ndu\n1 − k(r)\n1 − k(r)\n\n(3.2)\n\n(3.3)\n(3.4)\n\nwhere Taylor expansion has been used in the last step and only terms linear in λ(u)\nhave been kept. Combining the right hand sides of Eqs. (3.3) and (3.4) gives the\nequality\ndλ(u)\ndr Ȧ′ (r, t)λ(u)\np\n.\n(3.5)\n=−\ndu\ndu 1 − k(r)\nDifferentiating the definition of the redshift, z ≡ (λ(0) − λ(u))/λ(u), we obtain\n\n4\n\ndz\ndλ(u) λ(0)\ndr (1 + z)Ȧ′ (r, t)\np\n,\n=−\n=\ndu\ndu λ2 (u)\ndu\n1 − k(r)\n\nLuminosity distance in a perturbed FRW universe has been considered in [32].\n\n7\n\n(3.6)\n\n\fwhere in the last step we have used Eq. (3.5) and the definition of the redshift. Finally,\nwe can combine Eqs. (2.19), (3.1) and (3.6) to obtain the pair of differential equations\n−A′ (r, t)\ndt\n=\n,\ndz\n(1 + z)Ȧ′ (r, t)\np\n1 + H02 (r)(1 − ΩM (r) − ΩΛ (r))A20 (r)\ndr\n,\n=\ndz\n(1 + z)Ȧ′ (r, t)\n\n(3.7)\n(3.8)\n\nwhich determine the relations between the coordinates and the observable redshift, i.e.\nt(z) and r(z).\nNow that we have related the redshift to the inhomogeneities, we still need the\nrelation between\nthe redshift and the energy flux F , or the luminosity-distance, defined\np\nas dL ≡ L/4πF , where L is the total power radiated by the source. This is given by\n[34]\ndL (z) = (1 + z)2 A(r(z), t(z)) .\n(3.9)\nLikewise, the angular distance diameter is given by\ndA (z) = A(r(z), t(z)) .\n\n(3.10)\n\nAs the z-dependence of t and r are determined by Eqs. (3.7) and (3.8) and the scale\nfunction A(r, t) by Eq. (2.22), using Eq. (3.9) one can calculate dL for a given z.\nAll of these relations have a manifest dependence on the inhomogeneities (i.e. on the\nfunctions H0 (r) and ΩM (r)). What remains is a comparison of Eq. (3.9) with the\nobserved dL (z).\nBecause the boundary functions of the LTB model are arbitrary, it comes as no\nsurprise that any isotropic set of observations can be explained by the appropriate\ninhomogeneities of the LTB model [35]. That the supernova data could be interpreted\nin terms of an inhomogeneous LTB model with no cosmological constant was first\nsuggested by Célérier [36], who pointed out that the LTB model is degenerate with\nrespect to any magnitude-redshift relation so that the accelerated expansion could be\nmodelled by a very large number of inhomogeneity profiles. In this sense the LTB\nmodel is not predictive. The intriguing aspect here is rather the matter of principle\nwhich the LTB model can be used to demonstrate: that the supernova data does not\nnecessarily imply accelerating expansion and hence the existence of dark energy is\nnot an unavoidable consequence of the data but rather depends on the framework the\ndata is interpreted in. Moreover, the inhomogeneities need not contradict the observed\nhomogeneity in galaxy surveys [6], as is often claimed (see e.g. [37]), since the model\nadmits solutions with constant ΩM but with a position-dependent H.\nTo demonstrate this, let us consider the gold sample of 157 supernovae of Riess\net. al. [4] and disregard LSS and CMB data for the moment. In the FRW model the\nparameters that best describe our universe are found by maximizing the likelihood\nfunction exp(−χ2 (H0 , ΩM , ΩΛ )) constructed from the observations. However, to find\nthe boundary conditions of the LTB universe that best describe our universe, we should\nin principle maximize the likelihood functional exp(−χ2 (H0 (r), ΩM (r))). In practice,\nthis is impossible. One can only consider some physically motivated types for the\n8\n\n\ffunctions H0 (r) and ΩM (r) that contain free parameters; these are then fitted to\nthe supernova observations by maximizing the leftover likelihood function. In the\nliterature there exist several fits to the supernova data employing a simple LTB model\nwith different authors having chosen different density profiles (and, unfortunately,\noften a different notation) [38, 28, 39, 40, 31, 41].\nSince the expansion rate of the FRW universe has to accelerate in order to fit\nthe supernova data, the second time derivative of the FRW scale function should be\npositive. In contrast, in the LTB universe the observations are affected by the variation\nof all the dynamical quantities along the past light cone, not just the time variation.\nIndeed, the directional derivative along the past light cone is given by\nd\n∂\ndt ∂\n∂\nA′ (r, t) ∂\n∂\n∂\n=\n+\n=\n−p\n≈\n− ,\ndt\n∂t dr ∂r\n∂t\n∂t ∂r\n1 − k(r) ∂r\n\n(3.11)\n\nwhere the approximation in the last step is more accurate for small values of r, but is\nqualitatively correct even for larger r.\nThe main message of Eq. (3.11) is that from the observational point of view,\nthe negative r-derivative roughly corresponds to the positive time derivative. This is\nnatural since by looking at a source, we simultaneously look into the past (i.e. along\nthe negative t-axis) and into a spatial distance (i.e. along the positive r-axis). Hence,\nto mimic the acceleration, i.e. for the expansion rate to look as if it were to increase\ntowards us along the past light cone, the expansion H0 (r) must decrease as r grows:\nhence we should look for an LTB model with H0′ (r) < 0. Thus, keeping in mind the\nhomogeneity of galaxy distributions, we could choose a simple four parameter LTB\nmodel like [31]\nH0 (r) = H + ∆He−r/r0 ,\nΩM (r) = Ω0 = constant ,\n\n(3.12)\n\nwhere H, ∆H, Ω0 and r0 are free parameters determined by the supernova observations. The best fit values are found to be [31]\nH + ∆H = 66.8 km/s/Mpc, ∆H = 10.5 km/s/Mpc, r0 = 500 Mpc, Ω0 = 0.45 .\n(3.13)\nThe goodness of the fit is χ2 = 172.6 (χ2 /157 = 1.10). The confidence level\ncontours with fixed values of Ω0 and H are shown in Fig. 1. For comparison with\nthe homogeneous case, the best fit nonflat ΛCDM has ΩM = 0.5, ΩΛ = 1.0 with\nχ2 = 175 (χ2 /157 = 1.11). What is perhaps surprising is the fact that the supernova\nfit is not only in qualitative agreement with the observed homogeneity in galaxy\nsurveys but also automatically yields a value for the present-day matter density that\nis consistent with the observations. The smallness (∼ 15%) of the spatial variation in\nthe Hubble parameter is also somewhat surprising, considering that it is of the same\norder as the uncertainty of the model-independent5 determination of the local Hubble\nrate by the Hubble space telescope [42]. The variation of the Hubble parameter found\n5\n\nNote that the smaller uncertainties found in the CMB data analysis cannot be used here as those fits\nassume that the entire universe is perturbatively close to the homogeneous FRW model.\n\n9\n\n\fVariation of the Hubble parameter in km/s/Mpc (parameter ∆H)\n\n24\n22\n20\n18\n16\n14\n12\n10\n8\n\n68.3%\n95.4%\n99.7%\n\n6\n4\n2\n0\n\n0\n\n200\n\n400\n\n600\n\n800\n\n1000\n\n1200\n\n1400\n\n1600\n\n1800\n\n2000\n\n2200\n\n2400\n\n2600\n\nLength scale of the variation in Mpc (parameter r0)\n\nFigure 1: Confidence level contours in the LTB model with ΩM (r) = constant = 0.45\nand H0 (r) = 56.3 km/s/Mpc + ∆He−r/r0 . From [31].\n\n10\n\n\fby Alnes, Amarzguioui and Grøn [28], who used a different model Ansatz, has also\nsimilar magnitude, but in contrast their model contains a large (∼ 400%) variation in\nthe matter density at scales larger than the current range of galaxy surveys.\nOne can also fit data with Eq. (3.12) together with a cosmological constant. Taking\nΩM (r) + ΩΛ (r) = 1 one finds no improvement [31]. If instead of ΩM = const. we\nassume a strictly uniform present-day matter distribution with ρM (r, t0 ) = constant,\nwhich implies H02 (r)ΩM (r) = constant, we may choose the parametrization\nH0 (r) = H + ∆He−r/r0 ,\nΩM (r) = Ω0 (H + ∆H)2 /(H + ∆He−r/r0 )2 .\n\n(3.14)\n\nThe best fit values in this case are\n\nVariation of the Hubble parameter in km/s/Mpc (parameter ∆H)\n\nH + ∆H = 67 km/s/Mpc, ∆H = 10 km/s/Mpc, r0 = 450 Mpc, Ω0 = 0.29 .\n(3.15)\nHere the goodness of the fit is χ2 = 172.6 (χ2 /157 = 1.10). The confidence level\ncontours with Ω0 and H fixed to their best fit values are displayed in Fig. 2.\n24\n22\n20\n18\n16\n14\n12\n10\n8\n\n68.3%\n6\n\n95.4%\n99.7%\n\n4\n2\n0\n\n0\n\n200\n\n400\n\n600\n\n800\n\n1000\n\n1200\n\n1400\n\n1600\n\n1800\n\n2000\n\n2200\n\n2400\n\n2600\n\nLength scale of the variation in Mpc (parameter r )\n0\n\nFigure 2: Confidence level contours in the LTB model with perfectly uniform presentday matter density: H0 (r) = 57 km/s/Mpc + ∆He−r/r0 , ΩM (r) = 0.29 (67\nkm/s/Mpc)2 /H02 (r). From [31].\nAll these models have an inhomogenous Big Bang. One could also have an\ninhomogenous expansion with a spatially constant age of the universe by choosing\n11\n\n\fe.g.\np\n\nH0 (r) = H \n\nΩM (r) =\n\n1 − ΩM (r) − ΩM (r)arsinh\n(1 − ΩM (r))3/2\n\nq\n\nΩ0\n.\n(1 + δe−r/r0 )2\n\n1−ΩM (r)\nΩM (r)\n\n\n\n ,\n\n(3.16)\n\nThe constraint of a simultaneous Big Bang leaves us with only one free function. The\nbest fit values are [31]\nH = 76.5 km/s/Mpc, δ = 1.21, r0 = 1000 Mpc, Ω0 = 0.29\n\n(3.17)\n\nwith χ2 = 175.5 (χ2 /157 = 1.12). Eq. (3.17) implies that the Hubble function\nH0 (r) varies from the value H0 (0) = 65 km/s/Mpc near us to its asymptotic value\nH0 (r ≫ r0 ) = 52 km/s/Mpc. The age of the universe is then tage = 1/H = 12.8\nGyr. Similar values have also been found in the model of ref. [28].\nThus simple and at least seemingly semirealistic LTB dust models can fit the\nsupernova data. The point to note is that although the LTB equations of motion do not\nin general permit locally accelerated expansion, this does not exclude the possibility\nthat there can be an effective, volume averaged acceleration, where a scale factor\ndefined via the physical volume of some comoving region has a positive double time\nderivative [43]. However, it can be shown there is no effective average acceleration\n[31] for the models considered above6.\n\n4 Towards more realistic LTB models\nWhether the supernova data combined with the CMB and LSS data would nevertheless\nrequire an accelerating universe is an open question; cosmological perturbation theory\nin LTB background is still non-existent.\nSome issues can be addressed, though. In particular, when the LTB metric models\na local underdensity, one may assume that the evolution of perturbations is identical\nto that in a homogeneous universe until the time of last scattering. Adopting this\napproach, Alnes, Amarzguioui and Grøn [28] have considered in an approximation\nconstraints arising from the position l1 of first acoustic peak. They find a shift relative\nto the concordance ΛCDM model that is given by\nS=\n\nl1\nΛCDM\nl1\n\n= 0.01419(1 − φ1 )\n\ndA\n,\nrs\n\n(4.1)\n\nwhere dA is the angular diameter distance to the last scattering surface, given by Eq.\n(3.10); this is the part that depends on the local underdensity, whereas rs , the sound\nhorizon at recombination, and the (small) value of the parameter φ1 can be obtained\n6\n\nAlthough fitting the supernova data does not require accelerating expansion, for some profiles\nthe LTB model may give rise to a suitably defined average acceleration [44]. For a discussion on\nbackreaction in LTB models, see also [45].\n\n12\n\n\fDescription\nDensity contrast parameter\nTransition point\nTransition width\nFit to supernovae\nPosition of first CMB peak\nAge of the universe\nRelative density inside underdensity\nRelative density outside underdensity\nHubble parameter inside underdensity\nHubble parameter outside underdensity\nPhysical distance to last scattering surface\nLength scale of baryon oscillation from SDSS\n\nSymbol\nValue\n∆α\n0.90\nr0\n1.35 Gpc\n∆r/r0\n0.40\nχ2SN\n176.5\nS\n1.006\nt0\n12.8Gyr\nΩm,in\n0.20\nΩm,out\n1.00\nhin\n0.65\nhout\n0.51\nDLSS 11.3 Gpc\nR0.35\n107.1\n\nTable 1: The best fit parameters of the locally underdense inhomogeneous model of\n[28].\nfrom the conventional homogeneous model. To be in agreement with the WMAP\nobservations, the shift parameter should be within the range S = 1.00 ± 0.01. The\nlocally underdense model depends on the density contrast parameter ∆α, functionally\nrelated to A(r, t) and specifying the difference between the two region, the transition\npoint r0 from LTB to FRW, and the transition width ∆r/r0 . A set of parameter values\nthat yields a good fit both to the supernova data and the first CMB peak position can\nbe found, as can be seen from Table 1. Generically, for the void picture to work, one\nshould have a local underdense region that extends at least up to the nearby supernovae\nor about 300-400 Mpc/h.\nThese considerations hold if we occupy the exact center of the local LTB universe.\nFor an observer that is located off-center, the universe appears to be anisotropic.\nEstimating the luminosity distance for an off-center observer is somewhat more\ncomplicated task than in the case of an observer at the center [33, 46]. One finds an\nanisotropic relation between the redshifts and the luminosity distances of supernovae,\nwhich however yields only a mild constraint as up to about 20 % displacement from the\ncenter is consistent with the data [47]. In contrast, the constraint from the CMB dipole\nappears to be very stringent, allowing only a displacement of about 15 Mpc from the\ncenter of the underdense bubble [33]. This result is obtained by assuming that all of\nthe observed dipole a10 ∼ 10−3 is due to the displacement. A cancelation of the dipole\ndue to our local peculiar motion towards the center of the underdensity is a possibility\nthat would allow for a larger displacement. Whether such a peculiar motion can arise\nnaturally or only by an accident, remains to be seen.\nFor an off-center observer the direction towards the center of the bubble singles\nout a special axis. Therefore one could hope that a local LTB bubble could provide\nan explanation for the observed peculiar alignments of the CMB quadrupoles and\noctopoles [48]. Because of the smallness of the displacement allowed by the dipole,\nthe quadru- and octopoles appear not to have enough power to explain their observed\nalignment [33], although again the conclusion depends on the assumption that our local\n13\n\n\faverage motion has been accounted for correctly.\nInstead of a single underdensity, one could also consider an \"onion model\" with\na homogeneous background density, on top of which there are density fluctuations\nwhich are periodic as a function of the radial coordinate. The observer sits in some\ngeneric position and looks at sources along the radial direction, and the LTB dust\nsolution incorporates the entire Universe. To study this set-up, Biswas, Mansouri and\nNotari [46] have derived an expression for the luminosity distance in an LTB metric\nfor an off-centre observer. The corrections due to underdensities to light propagation\nwere found to have a tendency to cancel far away from the observer because a radial\nlight ray unavoidably meets both underdense and overdense structures. However, in\nthe real universe light encounters hardly any structure, so the cancellations might\nbe an artifact of the onion model. Since in the real universe the photon is mostly\ntraversing voids it should get redshifted faster as the nonlinearities increase with\ntime and thereby effectively produce an apparent acceleration. In the onion model\none can nevertheless mimic an accelerating ΛCDM cosmology under certain special\nconditions: the observer has to be located around a minimum of the density contrast\nthat is required to be quite high [46].\nYet another approach is the \"Swiss cheese\" model of the inhomogeneous universe,\nwhere each spherical void is described by the LTB metric. At the boundary of\nthese regions the LTB metric is matched with the FRW metric that describes the\nevolution between the inhomogeneities. One can then seek for the modifications\nof the luminosity distance as the light passes through the underdense regions [49].\nIn the extreme case where one assumes that light traverses the centers of all the\ninhomogeneities along its path, assuming that the locations of the source and the\nobserver are random and inhomogeneities have sizes of order 10 Mpc, the relative\nincrease of the luminosity distance is however just of the order of a few percent near\nz ≃ 1. A qualitatively similar conclusion has been reached in [50].\nStructure formation and the smallness of CMB perturbations may in general pose a\ndifficulty for LTB models. For instance, for a class of inhomogeneities a homogeneous\nuniverse is actually a late time attractor solution. This means that at earlier times matter\ndensity and/or Hubble rate tends to be even more inhomogeneous than today. Whether\nthis presents an unsurmountable problem remains to be seen. Nevertheless, the LTB\nmodel serves as a reminder that the interpretation of the cosmological data is not only\nquantitatively but even qualitatively very much model dependendent. Therefore, all\noptions should be carefully examined before firm conclusions can be drawn. This\nis true in particular for dark energy, which is both an observational and theoretical\nenigma.\n\nAcknowledgements\nI thank Maria Ronkainen for help in preparing this manuscript and Teppo Mattsson\nfor many useful discussions on the LTB model. This work is partially supported by the\nAcademy of Finland grant 114419 and the Magnus Ehrnrooth foundation.\n\n14\n\n\fReferences\n[1] Proc. N. A. S. 15 (1929) 168.\n[2] D. N. Spergel et al., Astrophys. J. Suppl. 148:175, 2003.\n[3] A. G. Riess et al., Astron. J. 116:1009, 1998; S. Perlmutter et al., Astrophys. J.\n517:565, 1999.\n[4] A. G. Riess et al., Astrophys. J. 607:665, 2004.\n[5] P. Astier et al., Astron. Astrophys. 447:31,2006.\n[6] D. J. Eisenstein et al., Astrophys. J. 633:560, 2005.\n[7] D. N. Spergel et al., arXiv:astro-ph/0603449.\n[8] For a review, see E. J. Copeland, M. Sami and S. Tsujikawa, Int. J. Mod. Phys.\nD15:1753, 2006.\n[9] N. Straumann, Mod. Phys. Lett. A 21:1083, 2006.\n[10] A. Blanchard, M. Douspis, M. Rowan-Robinson, and S. Sarkar, Astron.\nAstrophys. 449:925, 2006.\n[11] See M. Francaviglia and S. Capoziello, this issue.\n[12] A. D. Dolgov and M. Kawasaki, Phys. Lett. B573:1, 2003.\n[13] T. Koivisto, Phys. Rev. D 73:083517, 2006.\n[14] A. Krasinski, \"Inhomogeneous Cosmological Models\", Cambridge University\nPress (1997).\n[15] R.Ali Vanderveld, Eanna E. Flanagan, Ira Wasserman, e-Print: arXiv:0706.1931\n[astro-ph].\n[16] J. F. Pascual-Sanchez, Mod. Phys. Lett. A 14:1539, 1999.\n[17] S. Räsänen, JCAP 0611:003, 2006.\n[18] T. Buchert, arXiv:gr-qc/0612166; see also E. Flanagan, this issue.\n[19] T. Buchert, Gen. Rel. Grav. 32:105, 2000; see also T. Buchert, this issue.\n[20] G. F. R. Ellis and T. Buchert, Phys. Lett. A 347:38, 2005.\n[21] A. A. Coley, N. Pelavas and R. M. Zalaletdinov, Phys. Rev. Lett. 95:151102,\n2005.\n[22] G. Lemaitre, Annales Soc. Sci. Brux. Ser. I Sci. Math. Astron. Phys. A 53:51,\n1933. For an English translation, see: G. Lemaitre, \"The Expanding Universe\",\nGen. Rel. Grav. 29:641, 1997.\n15\n\n\f[23] R. C. Tolman, Proc. Nat. Acad. Sci. 20:169, 1934.\n[24] H. Bondi, Mon. Not. Roy. Astron. Soc. 107: 410, 1947.\n[25] I. Zehavi et al., Astrophys. J. 503:483, 1998.\n[26] W.J. Frith, G.S. Busswell, R. Fong, N. Metcalfe, and T. Shanks, Mon. Not. Roy.\nAstron. Soc. 345:1049, 2003.\n[27] K. Tomita, Astrophys. J. 529:26, 2000; Prog. Theor. Phys. 106:929, 2001; Mon.\nNot. Roy. Astron. Soc. 326:287, 2001.\n[28] H. Alnes, M. Amarzguioui and O. Grøn, Phys. Rev. D 73:083519, 2006.\n[29] J.W. Moffat, JCAP 0510:012, 2005.\n[30] P. S. Apostolopoulos, N. Brouzakis, N. Tetradis and E. Tzavara, JCAP 0606: 009,\n2006.\n[31] K. Enqvist and T. Mattsson, JCAP 0702:019, 2007.\n[32] C. Bonvin, R. Durrer, and M. A. Gasparini, Phys. Rev. D 73:023523, 2006.\n[33] H. Alnes and M. Amarzguioui, Phys. Rev. D 74:103520, 2006.\n[34] G. F. R. Ellis, in Proc. School Enrico Fermi, \" General Relativity and\nCosmology\", Ed. R. K. Sachs, Academic Press (New York 1971).\n[35] N. Mustapha, C. Hellaby and G. F. R. Ellis, Mon. Not. Roy. Astron. Soc. 292:817,\n1997.\n[36] M. Célérier, Astron. Astrophys. 353:63, 2000.\n[37] R. A. Vanderveld, E. E. Flanagan and I. Wasserman, Phys. Rev. D 74:023506,\n2006.\n[38] H. Iguchi, T. Nakamura and K. I. Nakao, Prog. Theor. Phys. 108:809, 2002.\n[39] D. Garfinkle, Class. Quant. Grav. 23:4811, 2006.\n[40] D. J. H. Chung and A. E. Romano, Phys. Rev. D 74:103507, 2006.\n[41] K. Bolejko, arXiv:astro-ph/0512103.\n[42] W. L. Freedman et al., Astrophys. J. 553:47, 2001.\n[43] H. Alnes, M. Amarzguioui and O. Gron, JCAP 0701:007, 2007.\n[44] Chia-Hsun Chuang, Je-An Gu, and W-Y. P. Hwang, arXiv:astro-ph/0512651.\n[45] S. Räsänen, JCAP 0411:010, 2004.\n\n16\n\n\f[46] T. Biswas, R. Mansouri and A. Notari, arXiv:astro-ph/0606703.\n[47] H. Alnes and M. Amarzguioui, Phys. Rev. D75:023506, 2007.\n[48] A. de Oliveira-Costa, M. Tegmark, M. Zaldarriaga and A. Hamilton, Phys. Rev.\nD 69:063516, 2004; D. J. Schwarz, G. D. Starkman, D. Huterer and C. J. Copi,\nPhys. Rev. Lett. 93:221301, 2004.\n[49] N. Brouzakis, N. Tetradis, and E. Tzavara, JCAP 0702:013, 2007;\narXiv:astro-ph/0703586.\n[50] T. Biswas and A. Notari, arXiv:astro-ph/0702555.\n\n17\n\n\f"}