{"id": "http://arxiv.org/abs/0908.2601v1", "guidislink": true, "updated": "2009-08-18T16:26:37Z", "updated_parsed": [2009, 8, 18, 16, 26, 37, 1, 230, 0], "published": "2009-08-18T16:26:37Z", "published_parsed": [2009, 8, 18, 16, 26, 37, 1, 230, 0], "title": "Asteroseismic analysis of the CoRoT δ-Scuti star HD174936", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0908.3315%2C0908.1013%2C0908.0488%2C0908.2567%2C0908.3106%2C0908.4113%2C0908.2591%2C0908.2899%2C0908.2473%2C0908.1184%2C0908.1177%2C0908.2557%2C0908.3791%2C0908.0758%2C0908.2460%2C0908.3962%2C0908.0601%2C0908.2601%2C0908.3541%2C0908.0538%2C0908.2047%2C0908.2994%2C0908.1368%2C0908.1758%2C0908.4505%2C0908.3366%2C0908.2304%2C0908.4297%2C0908.2290%2C0908.0100%2C0908.3188%2C0908.1142%2C0908.3798%2C0908.3068%2C0908.3964%2C0908.3468%2C0908.4279%2C0908.2248%2C0908.0882%2C0908.4475%2C0908.0935%2C0908.0333%2C0908.1118%2C0908.0387%2C0908.2441%2C0908.1226%2C0908.0848%2C0908.1401%2C0908.0714%2C0908.1825%2C0908.2944%2C0908.2392%2C0908.1749%2C0908.2243%2C0908.3437%2C0908.3431%2C0908.2819%2C0908.1780%2C0908.3441%2C0908.3161%2C0908.2548%2C0908.1303%2C0908.3066%2C0908.1768%2C0908.3057%2C0908.2724%2C0908.4305%2C0908.1172%2C0908.0723%2C0908.0669%2C0908.2842%2C0908.0254%2C0908.2129%2C0908.1739%2C0908.0858%2C0908.3507%2C0908.2500%2C0908.3235%2C0908.3446%2C0908.3921%2C0908.3115%2C0908.0737%2C0908.2116%2C0908.0914%2C0908.4490%2C0908.1356%2C0908.0192%2C0908.0941%2C0908.0460%2C0908.2988%2C0908.1049%2C0908.2049%2C0908.0429%2C0908.4024%2C0908.3254%2C0908.4390%2C0908.2071%2C0908.1582%2C0908.1453%2C0908.2166%2C0908.1880&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Asteroseismic analysis of the CoRoT δ-Scuti star HD174936"}, "summary": "We present an analysis of the \\delta-Scuti star object HD 174936 (ID 7613)\nobserved by CoRoT during the first short run SRc01 (27 days). A total number of\n422 frequencies we are extracted from the light curve using standard\nprewhitening techniques. This number of frequencies was obtained by considering\na spectral significance limit of sig = 10 using the software package SigSpec.\nOur analysis of the oscillation frequency spectrum reveals a spacing\nperiodicity of around 52 \\muHz. Although modes considered here are not in the\nasymptotic regime, a comparison with stellar models confirms that this\nsignature may stem from a quasi-periodic pattern similar to the so-called large\nseparation in solar-like stars.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0908.3315%2C0908.1013%2C0908.0488%2C0908.2567%2C0908.3106%2C0908.4113%2C0908.2591%2C0908.2899%2C0908.2473%2C0908.1184%2C0908.1177%2C0908.2557%2C0908.3791%2C0908.0758%2C0908.2460%2C0908.3962%2C0908.0601%2C0908.2601%2C0908.3541%2C0908.0538%2C0908.2047%2C0908.2994%2C0908.1368%2C0908.1758%2C0908.4505%2C0908.3366%2C0908.2304%2C0908.4297%2C0908.2290%2C0908.0100%2C0908.3188%2C0908.1142%2C0908.3798%2C0908.3068%2C0908.3964%2C0908.3468%2C0908.4279%2C0908.2248%2C0908.0882%2C0908.4475%2C0908.0935%2C0908.0333%2C0908.1118%2C0908.0387%2C0908.2441%2C0908.1226%2C0908.0848%2C0908.1401%2C0908.0714%2C0908.1825%2C0908.2944%2C0908.2392%2C0908.1749%2C0908.2243%2C0908.3437%2C0908.3431%2C0908.2819%2C0908.1780%2C0908.3441%2C0908.3161%2C0908.2548%2C0908.1303%2C0908.3066%2C0908.1768%2C0908.3057%2C0908.2724%2C0908.4305%2C0908.1172%2C0908.0723%2C0908.0669%2C0908.2842%2C0908.0254%2C0908.2129%2C0908.1739%2C0908.0858%2C0908.3507%2C0908.2500%2C0908.3235%2C0908.3446%2C0908.3921%2C0908.3115%2C0908.0737%2C0908.2116%2C0908.0914%2C0908.4490%2C0908.1356%2C0908.0192%2C0908.0941%2C0908.0460%2C0908.2988%2C0908.1049%2C0908.2049%2C0908.0429%2C0908.4024%2C0908.3254%2C0908.4390%2C0908.2071%2C0908.1582%2C0908.1453%2C0908.2166%2C0908.1880&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present an analysis of the \\delta-Scuti star object HD 174936 (ID 7613)\nobserved by CoRoT during the first short run SRc01 (27 days). A total number of\n422 frequencies we are extracted from the light curve using standard\nprewhitening techniques. This number of frequencies was obtained by considering\na spectral significance limit of sig = 10 using the software package SigSpec.\nOur analysis of the oscillation frequency spectrum reveals a spacing\nperiodicity of around 52 \\muHz. Although modes considered here are not in the\nasymptotic regime, a comparison with stellar models confirms that this\nsignature may stem from a quasi-periodic pattern similar to the so-called large\nseparation in solar-like stars."}, "authors": ["A. García Hernández", "A. Moya", "E. Michel", "R. Garrido", "J. C. Suárez", "E. Rodríguez", "P. J. Amado", "S. Martín-Ruíz", "A. Rolland", "E. Poretti", "R. Samadi", "A. Baglin", "M. Auvergne", "C. Catala", "L. Lefevre", "F. Baudin"], "author_detail": {"name": "F. Baudin"}, "author": "F. Baudin", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361/200911932", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0908.2601v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0908.2601v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "7 pages, 7 figures, 2 tables. Accepted for publication in A&A CoRoT\n  Special Feature", "arxiv_primary_category": {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0908.2601v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0908.2601v1", "journal_reference": null, "doi": "10.1051/0004-6361/200911932", "fulltext": "arXiv:0908.2601v1 [astro-ph.SR] 18 Aug 2009\n\nAstronomy & Astrophysics manuscript no. 11932\n(DOI: will be inserted by hand later)\n\nNovember 7, 2018\n\nAsteroseismic analysis of the CoRoT⋆ δ-Scuti star HD 174936 ⋆⋆\nA. Garcı́a Hernández1 , A. Moya1 , E. Michel2 , R. Garrido1 , J.C. Suárez1 , E. Rodrı́guez1 , P.J. Amado1 , S.\nMartı́n-Ruı́z1 , A. Rolland1 , E. Poretti3 , R. Samadi2 , A. Baglin2 , M. Auvergne2 , C. Catala2 , L. Lefevre2 , and F.\nBaudin4\n1\n2\n3\n4\n\nInstituto de Astrofı́sica de Andalucı́a (CSIC), CP3004, Granada, Spain\nObservatoire de Paris, LESIA, CNRS, UMR 8109, Meudon, France\nINAF-Osservatorio Astronomico di Brera, Via E. Bianchi 46, I-23807 Merate (LC), Italy\nInstitut d'Astrophysique Spatiale, UMR8617, Université Paris X, Bât.121, 91405 Orsay, France\n\nReceived ... / Accepted ...\nAbstract. We present an analysis of the δ-Scuti star object HD 174936 (ID 7613) observed by CoRoT during the first short\n\nrun SRc01 (27 days). A total number of 422 frequencies we are extracted from the light curve using standard prewhitening\ntechniques. This number of frequencies was obtained by considering a spectral significance limit of sig=10 using the software\npackage SigSpec. Our analysis of the oscillation frequency spectrum reveals a spacing periodicity of around 52 μHz. Although\nmodes considered here are not in the asymptotic regime, a comparison with stellar models confirms that this signature may\nstem from a quasi-periodic pattern similar to the so-called large separation in solar-like stars.\nKey words. Stars: variables: δ Sct – Stars: rotation – Stars: oscillations – Stars: fundamental parameters – Stars: interiors\n\n1. Introduction\nThe δ-Scuti stars are intermediate-mass pulsating variables\nwith spectral types ranging from A2 to F0. They are located on\nand just off the main sequence in the lower part of the Cepheid\ninstability strip (luminosity classes IV & V). The δ-Scuti stars\nare considered as particularly suitable for asteroseismic studies\nof poorly known hydrodynamical processes occurring in stellar\ninteriors, such as convective overshoot, mixing of chemical elements, and redistribution of angular momentum (Zahn 1992),\nto mention only the most important ones. Because of the complexity of the oscillation spectra, their pulsating behaviour has\nnot been understood very well. The reader is referred to the review by Cox (2002) for a more detailed description of unsolved\nproblems in stellar pulsation physics.\nThe δ-Scuti star HD 174936 was uninterruptedly observed\nby CoRoT during 27 days of observation. The very precise\nspace photometry supplied by the CoRoT mission gives us the\npossibility of working with a lower limit in amplitudes of ∼ 14\nμmag. As a consequence of such precision, never reached by\nany ground-based observation campaign, we obtained a wide\nrange of oscillation frequencies ([0.05, 100] cd−1 ). This and\nSend offprint requests to: A. Garcı́a Hernández e-mail: agh@iaa.es\n⋆\nThe CoRoT space mission, launched on December 27, 2006, has\nbeen developed and is operated by the CNES, with the contribution of\nAustria, Belgium, Brasil, ESA, Germany, and Spain.\n⋆⋆\nTable 1 is only available in electronic form at the CDS\nvia anonymous ftp to cdsarc.u-strasbg.fr (130.79.128.5) or via\nhttp://cdsweb.u-strasbg.fr/cgi-bin/qcat?J/A+A/\n\nthe huge number of detected frequencies for such stars will help\nus in understanding the internal structure of intermediate-mass,\nmain-sequence stars.\nOne of the aims of the mission is that such high resolution\ncan enable us to detect some periodicities like rotational splitting (Baglin et al. 2006b). Using the CoRoT achievements, we\ncan carry out statistical studies and look for other possible periodicities that could help us to better understand the oscillation\nspectra observed.\nThe paper is structured as follows: an explanation of the\ndata analysis and the frequency content is described in Sect.\n2; a description of the method used for identifying the periodic spacing distribution of the extracted frequencies is given\nin Sect. 3; equilibrium models and oscillation computations to\ncheck the origin of the signature noticed in the observations are\ndescribed in Sect. 4; a brief discussion is carried out in Sect. 5;\nand some conclusions are reported in Sect. 6.\n\n2. Data analysis\nThe field δ-Scuti star HD 174936 was observed during the first\n30-day short run SRc01 (Baglin et al. 2006a) of CoRoT. The\nfinal time span of the collected dataset was ∆T=27.2 days,\nwith a sampling of one point each 32 sec. This means about\n73440 datapoints as the expected timeseries. However, the final dataset consisted of 66057 datapoints after removing those\npoints considered unreliable. With this, the Rayleigh frequency\nresolution is (1/∆ T)=0.037 cd−1 , and an oversampling of 20\nshould correspond to a frequency spacing of 0.0018 cd−1 . This\n\n\f2\n\nGarcı́a Hernández et al.: Asteroseismic analysis of the CoRoT δ-Scuti star HD 174936\n2.5\n\nAmplitude (mmag)\n\n2\n\n1.5\n\n1\n\n0.5\n\nFig. 1. Spectral window of the short-run CoRoT dataset on\nHD 174936.\n\n0\n0\n\n100\n\n200\n\n300\n\n400\n500\nFrequency (μHz)\n\n600\n\n700\n\n800\n\n900\n\nFig. 2. The 422 frequencies exctracted for HD 174936.\nis equivalent to the frequency spacing in mode \"High\" in the\nprogram package Period04 (Lenz & Breger 2005).\nFirst, the data were detrended (Auvergne et al. 2009) performing a linear fit to the light curves. Second, Period04 was\nused for a preliminary inspection of the periodograms. Later,\nthe timeseries was analysed using the computer program package SigSpec (Reegen 2007).\nNevertheless, the timeseries was previously investigated\nwith Period04 for the first 20 peaks. They were identical to\nthose achieved with SigSpec. This test has also been carried\nout successfully for the CoRoT target ID 123 (HD 50844,\nPoretti et al. 2009) with ∆T=56.7 days and 140016 datapoints.\nIn that case, Period04 was used to investigate the first 200\npeaks, The agreement between the two methods was successful\nin 99% of the cases.\nFigure 1 shows the spectral window of HD 174936, which\nis typical of all the targets observed by the CoRoT satellite in\nthe same run. As can be seen, the figure does not show the typical aliases at 1 cd−1 or the power levels that are common for\nground-based data. On the contrary, all the aliases are related\nto effects produced by the satellite and its orbital frequency\n(f s =13.972 cd−1 ), and their power levels are much lower than\nthose usual for ground-based data. The alias peak at about 2\ncd−1 comes from the South Atlantic Anomaly (SAA) crossing,\nwhich occurred twice each sidereal day. This means the alias\npeaks at 2.005 and 4.011 cd−1 , respectively.\nTo avoid problems with power close to zero frequency, the\nanalysis with SigSpec was carried out in the range 0.05-100\ncd−1 . In the case of Period04, the limit commonly used to consider one datapoint as significant is the amplitude signal-tonoise ratio S/N≥4.0. In the case of SigSpec, the parameter used\nfor significance is \"sig\" (= spectral significance), and the limit\nused as default is sig=5.0. This should be equivalent to about\nS/N=3.8 (and sig=5.46 should be approximately equivalent\nto S/N=4.0) (Reegen 2007; Kallinger et al. 2008). However,\nwe used a much more conservative limit, and our calculations\nwith SigSpec stopped when sig=10.0 because the corresponding S/N values, determined using Period04 on the residuals,\nwere much lower than expected. This is probably caused by a\nhigh number of peaks still remaining among the residuals in\nthe region of interest. This was explained in much more detail\n\nin similar recent works for other CoRoT targets (HD 50844,\nPoretti et al. 2009, HD 49434, Rodrı́guez et al., in preparation).\nThe limit of sig=10 was achieved after removing 422 peaks.\nThis means a level of about 14 ppm for the smallest amplitudes.\nThe first eleven frequencies, are listed in Table 1 along with\nthe most relevant parameters. Column 6 lists the S/N values\ncorresponding to each peak. These S/N values were calculated\nusing Period04 on the residual file provided by SigSpec. Each\nS/N value was calculated on a box of width=5 cd−1 centred\non the corresponding peak, as is usual for this type of variable\n(Rodrı́guez et al. 2006a,b).\nThe range of statistically significant detected frequencies\ngoes from some value close to zero up to about 70 cd−1 , i.e.\n800 μHz (1 cd−1 = 11.57μHz). But those with the highest amplitudes are grouped around 35 cd−1 (400 μHz, see Fig. 2). In\nthe following theorical analysis, we work in μHz.\n\n3. Looking for periodic patterns in the extracted\nfrequency set\nMode identification, mainly for δ-Scuti stars, is the present bottleneck for the progress in asteroseismology. Existing mode\nidentification techniques are based on spectroscopy or multicolour photometry not available in CoRoT data. Considering\nthat we have unprecedented, rich spectra, we seek to reveal\ncharacteristic structures in the frequencies distribution and to\nstart with quasi-regular spacings.\nWe consider the frequency set as a series of Dirac's δ's of\nequal amplitude. Then, the technique is simply to use the list\nof frequencies with unit amplitude and to normalise its Fourier\ntransform to unity at zero frequency spacing. If we have a given\nperiodicity in the frequency set (δ f ), then its Fourier transform\nwill show a clear periodic structure on the corresponding inverse scale.\nWe started this analysis assuming the hypothesis that, selecting a subset with the highest peaks of the entire frequency\nset, we are actually considering mainly the modes of the lowest\nl values. The visibility of the modes decreases approximately\nas l−2.5 or l−3.5 , depending whether the l degree is odd or even\n(Dziembowski 1977). We analysed several subsets with an ar-\n\n\fGarcı́a Hernández et al.: Asteroseismic analysis of the CoRoT δ-Scuti star HD 174936\n\n3\n\nTable 1. Frequencies of the highest amplitudes for HD 174936.\n\nIdentification\n\nFrequency (μHz)\n\nAmplitude (mmag)\n\nPhase (rad)\n\nSpectral significance\n\nS/N\n\nF1\nF2\nF3\nF4\nF5\nF6\nF7\nF8\nF9\nF10\nF11\n\n377.30\n412.71\n414.62\n360.08\n339.22\n367.96\n321.92\n387.63\n359.47\n385.89\n158.01\n\n2.12\n1.02\n0.72\n0.57\n0.55\n0.53\n0.36\n0.32\n0.30\n0.29\n0.28\n\n2.40\n2.49\n-0.41\n2.67\n1.18\n-0.82\n-1.36\n-2.55\n2.23\n-0.05\n-2.44\n\n7225.844\n3624.781\n2155.327\n1784.588\n1714.847\n1862.847\n908.218\n825.756\n713.637\n725.392\n707.305\n\n659.008\n336.581\n236.220\n174.791\n169.363\n164.484\n111.772\n103.085\n92.766\n93.201\n85.501\n\nPower spectrum normalised to unity at frequency equal zero\n\nPower spectrum of the frequency distribution\n0.18\n25.8\n0.16\n0.14\n\n12.9\n8.0\n\n0.12\n0.1\n\n50 frequencies\n100 frequencies\n250 frequencies\n422 frequencies\n\n6.5\n4.9\n\n0.08\n0.06\n0.04\n0.02\n0\n0\n\n5\n\n10\n\n15\n20\n25\n30\n35\n40\nPeriodicities in the frequency distribution (μHz)\n\n45\n\n50\n\nFig. 3. Power spectrum for various subsets of frequencies, selected by amplitude. The solid line represents the power spectrum\nwhen the highest 50 frequencies are selected; the dashed line corresponds to the highest 100 frequencies; the dotted line, for 200;\nand dot-dashed line for all of them. The peak corresponding to the large separation (25.8 μHz) and its sub-multiples are labelled\n(see text).\n\nbitrary number of frequencies but always including the highest\npeaks. In Fig. 3 the results are given for different sets of peaks.\nIt can be seen that the more frequencies in the subset, the flatter\nthe peaks, although the local maxima remain at the same position. This indicate that, when we only select the highest peaks,\n\nwe are enhancing some periodicities corresponding to a few l\nvalues. While, adding frequencies in the analysis, periodicities\nof all modes are powered and no pattern can be significantly\ndistinguished from others.\n\n\f4\n\nGarcı́a Hernández et al.: Asteroseismic analysis of the CoRoT δ-Scuti star HD 174936\n\nWhen we select 50 frequencies, a periodic pattern can be\nrecognised. Furthermore, the clear signature of a Dirac's comb\nis also present at 25.8, 13, 8, 6.5, and 4.9 μHz. That indicates\nthat we probably have a Dirac's comb of 25.8 μHz, which is the\nlowest divisible number. The appearance of these peaks can be\na clue to the confirmation that they are being caused by a periodic structure in the frequency set. Other peaks around 25.8\nμHz can be explained by the separation not being strictly periodic but quasi-periodic, as can be expected for these modes\n(see Sect. 4). This can be the imprint of a large separation-like\nstructure around 52 μHz.1\nOn the other hand, the rotational velocity measured for this\nstar is high (v sin i ∼ 170 km/s, see Sect. 4) giving a minimum rotational splitting of ∼ 20 μHz. It is then possible that\nthe observed frequency pattern does not come from the large\nseparation but from the rotational splitting. The pattern due to\nrotational effects should be observed only with l ≥ 1 and a statistically significant number of m , 0 values. However, because\nwe mainly select the lowest l values, the large separation is\nmore probable than the rotational splitting. In the next section,\nwe discuss the validity of this hypothesis using a theoretical\nmodel representative of the star.\nThe other peaks in Fig. 3 probably come from periodic\nstructures produced by the rotation and/or the small separation,\nmainly occupying the lowest part of the power spectrum. Works\nare in progress for understanding the meaning of these peaks.\n\n4. Periodic structures in theoretical spectra\nThe periodic pattern structures are familiar in solar-like oscillators, which have reached the asymptotic regime, but not in δScuti stars, which pulsate around the fundamental radial mode.\nTo understand the physical origin of the present observed periodic pattern shown in the previous section, we computed a\nrepresentative model of this star.\n\n4.1. Physical parameters\nWe consider the physical parameters of the star HD 174936,\nwhich are listed in Table 2. These values are taken from\n\"CorotSky Database\" (Charpinet et al. 2006). T eff , log g,\nand [Fe/H] were derived from Strömgren photometry\n(Hauck & Mermilliod 1998), while the rotational velocity\n(v sin i = 169.7km/s) was determined from high-resolution\nspectroscopy. The spectrum was taken in June 2, 2004 using\nthe FEROS spectrograph attached to the ESO 2.2 m-telescope\nat La Silla (Chile). It was obtained in the framework of the\nmission preparation and is available at the GAUDI archive\n(Solano et al. 2005). On the other hand, it has been shown that\nrapid rotation should be considered when calculating the stellar physical parameters from photometry. Michel et al. (1999)\npropose a method for determining the effects of rotation and\ngeometry (angle of inclination) on photometric parameters for\nstars in clusters. For δ-Scuti stars, that method was further de1\n\nFrequency values for l = 1 modes are placed around the centre of\ntwo consecutive l = 0 modes, so we expect to find a minimun periodicity of the half value of the large separation.\n\nTable 2. Physical parameters of the star with its uncertainties\nto construct the theoretical model (Charpinet et al. 2006).\n\nStar ID\n\nT eff (K)\n\nlog g\n\n[Fe/H]\n\nvsini (km/s)\n\nHD 174936\n\n8000±200\n\n4.08±0.2\n\n-0.32±0.2\n\n169.7\n\nveloped by Pérez Hernández et al. (1999), showing that uncertainties of around 100-150 K in effective temperature, and ∼\n0.10 dex in logg, can be found for moderately rotating stars.\nThat result was later confirmed by Suárez et al. (2002). In the\npresent case, considering the absence of additional information\non the inclination angle of the star, uncertainty boxes of 200 K\nin the HR diagram in T e f f and ∼ 0.2 dex in logg were adopted.\nAn uncertainty of ∼ 0.2 in metallicity was taken.\nThis is a main-sequence intermediate-mass star (∼1.6 M⊙ ).\nThe hydrogen abundance in the core is Xc ∼ 0.3. But it is\nyounger than the star studied in Poretti et al. (2009).\n\n4.2. Theoretical models\nUsing the physical parameters measured for the star and given\nin the previous subsection as input, we computed a theoretical model representative of the star. The evolutionary code cesam (Morel 1997; Morel & Lebreton 2008) and the pulsation\ncode graco (Moya et al. 2004; Moya & Garrido 2008) were\nused as numerical codes to calculate frequencies, growth rates\nand other physical quantities.\nFor the model, we computed the oscillation spectrum (radial and non-radial), from l = 0 to 3, in the range of observed\nfrequencies. Then, we calculated the large separation defined\nas ∆ν = νn+1,l − νn,l . In Fig. 4 the large separation calculated\nthis way is depicted. It is quite evident that the large separation\ndoes not vary much but is bounded within a frequency range\nof 10 μHz. In this particular case, the two discrepant points belonging to l = 2 correspond to an avoided crossing. Similar\nresults are expected for other higher l values.\nHowever, this is not critical for the detection of regularities using Fourier transform due to its statistical character. In\nFig. 5 we show an identical analysis to the one for the observed\nfrequencies (see previous section). It can be seen that we have\nsimilar results for the theoretical frequencies for a given representative model (even in a nonrotating model). This indicates\nthat such regularities, even in the non-asymptotic regime, may\nbe discerned by the Fourier transform technique explained in\nSect. 3. This opens a new window in the analysis of δ-Scuti\nstars.\n\n5. Discussion\nWe have shown that a periodic pattern, possibly corresponding to large separation, is found in the frequency spectrum\nobserved for the star (see Sect. 3). We have corroborated it\nthrough a theoretical model (see previous section). Clearly,\nthe large separation found in the studied regime does not have\nthe same physical meaning as found in the asymptotic regime\n\n\fGarcı́a Hernández et al.: Asteroseismic analysis of the CoRoT δ-Scuti star HD 174936\nFrequency versus ∆ν\n\n5\n\nUncertainty box in the HR diagram\n1.5\n\n58\n\n1.4\n\nTrack with Ω=170 km/s\nTrack with Ω=0 km/s\nUncertainty box ([Fe/H]=−0.12)\nUncertainty box ([Fe/H]=−0.52)\n\n56\n\n1.3\n\nlog L/LO\n\n∆ν (μHz)\n\n54\n\n52\n\n1.2\n\n1.1\n\n50\n\n1\n48\n\nL=0\nL=1\nL=2\n\n46\n\n200\n\n300\n\n400\n\n500\n\n600\n\nFrequency (μHz)\n\n700\n\n800\n\n900\n\n0.9\n\n0.8\n3.96\n\n3.95\n\n3.94\n\n3.93\n\n3.92\n\n3.91\n\n3.9\n\n3.89\n\nlog Teff\n\nFig. 4. Frequency dependance of the large separation for the\nthree lowest values of l: 0, 1, and 2. Solid line is for l =0,\ndashed line for l =1, and dot-dashed line for l =2. Large separation is then estimated using a Fourier transform method (see\nSect. 3).\n\nFig. 6. HR diagram containing two uncertainty boxes corresponding to the 1σ extremes of the metallicity ([Fe/H] = 0.12 and -0.52), with two evolutionary tracks. They correspond\nto the central model (M = 1.63 M⊙ ) at the central metallicity\n([Fe/H] = -0.32), one with rotation and the other without.\n\nPower spectrum normalised to unity at frequency equal zero\n\nPower spectrum of the frequency ([100,700]μHz) distribution\n0.14\n\n26.61\n\nerrors (1 σ) considered. Then, we reduced the corners of the\nuncertainty box to half and computed the corresponding models. Finally, we calculated the large separation for all them. The\nuncertainty boxes (1 σ) for the 1 σ extremes of the metallicity\nare depicted in Fig. 6. Two evolutionary tracks of the central\nmodel (M = 1.63 M⊙ ) with and without rotation are plotted,\ntoo.\n\n0.12\n\n0.1\n\n8.73\n\n13.27\n\n0.08\n\n0.06\n\n0.04\n\n0.02\n\n0\n0\n\n5\n\n10\n\n15\n\n20\n\n25\n\n30\n\n35\n\n40\n\n45\n\n50\n\nPeriodicities in the frequency distribution (μHz)\n\nFig. 5. Power spectrum of the oscillation frequencies of a\nmodel obtained using the technique described in Sect. 3. We\nuse only the range of observed data set, i.e., up to 700 μHz. A\nclear peak (and sub-multiples) is observed at 26.61 μHz, which\ncorresponds to a large separation of ∼53 μHz.\n\n(Christensen-Dalsgaard 2003). However, it is dependent on the\ninternal structure of the star, and we can study how this signature is robust and sensitive to evolution or mass, in order to\nopen up new perspectives about its diagnostic power.\nTo do so, we constructed seismic models that lie within the\nuncertainties of the physical parameters measured for this star.\nThat is, we computed models to reproduce the HR locations\ncorresponding to the four corners (1 σ) and the centre of the\nuncertainty box. After that, for each equilibrium model, we\ncomputed its oscillations. This procedure is followed for models built with the observed metallicity and the two maximum\n\nWe can see in Table 3 the results of all these calculations.\nThe large separation is close to the value found in the observed frequency set for the central models at each metallicity.\nTypically, it is higher for less massive models, and when reducing the half-bottom area of the uncertainty box it varies faster\nthan the half-upper one.\nOn the other hand, we computed the instability range for\nthese models (see Fig. 7). Some models covers the range\n(around 400 μHz) of the highest amplitudes in the frequency\nset, others do not. But not one of them gives the necessary instability range to represent the full range in the observations.\nIt is assumed that observed frequencies ([0.5, 900] μHz), at\nleast in ground-based data, must be within the instability range.\nHowever, as far as we know, no theory allows such a huge range\nof excited frequencies, even including the time-dependent convection theory. This is a new challenge for theory that should\nbe improved in order to predict the instability range observed\nin the new era of space telescopes.\nAs seen, the observed frequency set contains a lot of information (small separation, rotational splitting, etc.), and work\nis progressing. We hope that such a large number of frequencies will allow us to obtain precise models representative of\nthis star and to improve our understanding of the interiors of\nintermediate-mass stars.\n\n\f6\n\nGarcı́a Hernández et al.: Asteroseismic analysis of the CoRoT δ-Scuti star HD 174936\n\nTable 3. Models of the uncertainty boxes for each metallicity calculated with mass and large separation.\n\n[Fe/H]\n\nFirst box\nM (M⊙ ) ∆ν (μHz)\n\n-0.32\n\n1.63\n1.89\n1.77\n1.51\n1.43\n\n53\n37\n38\n82\n71\n\n-0.52\n\n1.51\n1.76\n1.62\n1.42\n1.33\n\n54\n39\n41\n74\n73\n\n-0.12\n\n1.76\n2.05\n1.90\n1.66\n1.55\n\n51\n37\n39\n71\n73\n\nSecond box\n[Fe/H] M (M⊙ ) ∆ν (μHz)\n\nGrowth rate/Observed frequencies\n3\n\n0\n\n2\n\n−0.5\n\n1\n\nAmplitude\n\nGrowth rate\n\n0.5\n\n−1\n0\n\n100\n\n200\n\n300\n\n400\n500\n600\nFrequency (μHz)\n\n700\n\n800\n\n900\n\n0\n1000\n\nFig. 7. Frequency versus growth rate and amplitude for the 1.63\nM⊙ model. Growth rate (solid line, left axis) shows the stability\nrange (< 0), and one vertical line of the length of the amplitude\nfor each frequency is represented (right axis).\n\n6. Summary & conclusions\nThis work has presented an analysis of the δ-Scuti star object HD 174936 (ID 7613), observed by CoRoT during the first\nshort run SRc01 (27 days). A total number of 422 frequencies\n(which reach up 700 μHz) are extracted from the light curve\nusing standard prewhitening techniques. This represents one of\nthe largest number of detected frequencies for a δ-Scuti ever\nobtained so far.\nWe combined the classical seismic analysis with the use of\nstatistical properties of the modes distribution in the observed\n\n-0.32\n\n1.63\n1.77\n1.71\n1.58\n1.54\n\n53\n44\n44\n60\n58\n\n-0.52\n\n1.51\n1.64\n1.58\n1.48\n1.43\n\n54\n44\n45\n60\n60\n\n-0.12\n\n1.76\n1.92\n1.85\n1.73\n1.67\n\n51\n43\n43\n58\n58\n\nfrequency range. In particular, we have found periodic patterns\nin the observed frequency spectrum, which were not expected\nfor this kind of pulsating star. We find a frequency distribution\nof the modes that seems to correspond to the large separation,\nwhich is about 52 μHz. This result is supported by an equivalent analysis performed with a representative model of the star.\nAll these results provide new prospects for the asteroseismology of δ-Scuti stars. In particular, the large separation\nfound for this star opens the possibility of performing similar studies to those for solar-like stars. Although we have not\nexplored the low-frequency region of Fig. 3, we cannot discard the possibility that relevant information concerning rotation and small differences are hidden in this peak forest.\nAcknowledgements. A.G.H., A.M., J.C.S., R.G., E.R., P.J.A., S.M.R.\nand A.R. acknowledge support from the Spanish \"Plan Nacional\ndel Espacio\" under project ESP2007-65480-C02-01. A.G.H. acknowledges support from a \"FPI\" contract of the Spanish Ministry\nof Science and Innovation. J.C.S. acknowledges support from the\n\"Consejo Superior de Investigaciones Cientı́ficas\" by an \"I3P\" contract financed by the European Social Fund. P.J.A. acknowledges financial support from a \"Ramón y Cajal\" contract of the Spanish\nMinistry of Science and Innovation. A.M. acknowledges financial support from a \"Juan de la Cierva\" contract of the Spanish Ministry of\nScience and Innovation. EP acknowledges support from the Italian\nESS project, contract ASI/INAF I/015/07/0, WP 03170.\n\nReferences\nAuvergne, M., Bodin, P., Boisnard, L., et al. 2009, A&A, in press\nBaglin, A., Auvergne, M., Barge, P., et al. 2006a, in ESA Special\nPublication, Vol. 1306, ESA Special Publication, ed. M. Fridlund,\nA. Baglin, J. Lochard, & L. Conroy, 33\nBaglin, A., Michel, E., Auvergne, M., & The COROT Team. 2006b,\nin ESA Special Publication, Vol. 624, Proceedings of SOHO\n18/GONG 2006/HELAS I, Beyond the spherical Sun\n\n\fGarcı́a Hernández et al.: Asteroseismic analysis of the CoRoT δ-Scuti star HD 174936\nCharpinet, S., Cuvilo, J., Platzer, J., et al. 2006, in ESA Special\nPublication, Vol. 1306, ESA Special Publication, ed. M. Fridlund,\nA. Baglin, J. Lochard, & L. Conroy, 353\nChristensen-Dalsgaard, J. 2003, Lecture notes on Stellar Oscillations,\n5th edn. (Institut for Fysik og Astronomi, Aarhus Universitet)\nCox, A. N. 2002, in ASP Conf. Ser. 259: IAU Colloq. 185: Radial and\nNonradial Pulsations As Probes of Stellar Physics, 21–34\nDziembowski, W. 1977, Acta Astronomica, 27, 203\nHauck, B. & Mermilliod, M. 1998, A&AS, 129, 431\nKallinger, T., Reegen, P., & Weiss, W. W. 2008, A&A, 481, 571\nLenz, P. & Breger, M. 2005, Communications in Asteroseismology,\n146, 53\nMichel, E., Hernández, M. M., Houdek, G., et al. 1999, A&A, 342,\n153\nMorel, P. 1997, A&AS, 124, 597\nMorel, P. & Lebreton, Y. 2008, Ap&SS, 316, 61\nMoya, A. & Garrido, R. 2008, Ap&SS, 316, 129\nMoya, A., Garrido, R., & Dupret, M. A. 2004, A&A, 414, 1081\nPérez Hernández, F., Claret, A., Hernández, M. M., & Michel, E.\n1999, A&A, 346, 586\nPoretti, E., Michel, E., Garrido, R., et al. 2009, A&A, in press\nReegen, P. 2007, A&A, 467, 1353\nRodrı́guez, E., Amado, P. J., Suárez, J. C., et al. 2006a, A&A, 450,\n715\nRodrı́guez, E., Costa, V., Zhou, A.-Y., et al. 2006b, A&A, 456, 261\nSolano, E., Catala, C., Garrido, R., et al. 2005, AJ, 129, 547\nSuárez, J.-C., Michel, E., Pérez Hernández, F., et al. 2002, A&A, 390,\n523\nZahn, J.-P. 1992, A&A, 265, 115\n\n7\n\n\f"}