{"id": "http://arxiv.org/abs/1004.0593v1", "guidislink": true, "updated": "2010-04-05T08:47:38Z", "updated_parsed": [2010, 4, 5, 8, 47, 38, 0, 95, 0], "published": "2010-04-05T08:47:38Z", "published_parsed": [2010, 4, 5, 8, 47, 38, 0, 95, 0], "title": "Potential Energy Landscape for hot electrons in periodically\n  nanostructured graphene", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.2027%2C1004.5409%2C1004.2585%2C1004.2828%2C1004.4100%2C1004.1732%2C1004.4232%2C1004.4898%2C1004.4352%2C1004.2769%2C1004.0647%2C1004.2357%2C1004.4451%2C1004.5134%2C1004.3713%2C1004.5183%2C1004.4662%2C1004.4571%2C1004.0490%2C1004.3457%2C1004.4397%2C1004.2899%2C1004.1999%2C1004.1786%2C1004.0834%2C1004.3029%2C1004.1598%2C1004.1070%2C1004.5355%2C1004.3768%2C1004.5084%2C1004.0148%2C1004.4399%2C1004.2303%2C1004.1618%2C1004.1236%2C1004.3967%2C1004.3843%2C1004.1423%2C1004.2723%2C1004.5528%2C1004.3066%2C1004.2766%2C1004.0755%2C1004.4378%2C1004.1373%2C1004.1062%2C1004.0204%2C1004.1046%2C1004.2997%2C1004.3293%2C1004.1176%2C1004.0422%2C1004.3387%2C1004.2651%2C1004.1610%2C1004.3322%2C1004.0057%2C1004.1825%2C1004.2696%2C1004.3880%2C1004.4603%2C1004.4204%2C1004.3500%2C1004.0073%2C1004.3330%2C1004.2524%2C1004.1110%2C1004.0593%2C1004.3987%2C1004.1059%2C1004.3174%2C1004.3675%2C1004.4260%2C1004.5032%2C1004.5469%2C1004.2183%2C1004.0463%2C1004.4247%2C1004.0799%2C1004.5157%2C1004.3949%2C1004.3273%2C1004.0710%2C1004.1911%2C1004.4097%2C1004.1230%2C1004.4963%2C1004.2872%2C1004.2003%2C1004.0350%2C1004.4750%2C1004.5010%2C1004.2870%2C1004.3128%2C1004.1638%2C1004.3633%2C1004.0208%2C1004.1443%2C1004.2618%2C1004.4050&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Potential Energy Landscape for hot electrons in periodically\n  nanostructured graphene"}, "summary": "We explore the spatial variations of the unoccupied electronic states of\ngraphene epitaxially grown on Ru(0001) and observed three unexpected features:\nthe first graphene image state is split in energy, unlike all other image\nstates, the split state does not follow the local work function modulation, and\na new interfacial state at +3 eV appears on some areas of the surface. These\nresults show the system behaves as a self-organized periodic array of quantum\ndots.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.2027%2C1004.5409%2C1004.2585%2C1004.2828%2C1004.4100%2C1004.1732%2C1004.4232%2C1004.4898%2C1004.4352%2C1004.2769%2C1004.0647%2C1004.2357%2C1004.4451%2C1004.5134%2C1004.3713%2C1004.5183%2C1004.4662%2C1004.4571%2C1004.0490%2C1004.3457%2C1004.4397%2C1004.2899%2C1004.1999%2C1004.1786%2C1004.0834%2C1004.3029%2C1004.1598%2C1004.1070%2C1004.5355%2C1004.3768%2C1004.5084%2C1004.0148%2C1004.4399%2C1004.2303%2C1004.1618%2C1004.1236%2C1004.3967%2C1004.3843%2C1004.1423%2C1004.2723%2C1004.5528%2C1004.3066%2C1004.2766%2C1004.0755%2C1004.4378%2C1004.1373%2C1004.1062%2C1004.0204%2C1004.1046%2C1004.2997%2C1004.3293%2C1004.1176%2C1004.0422%2C1004.3387%2C1004.2651%2C1004.1610%2C1004.3322%2C1004.0057%2C1004.1825%2C1004.2696%2C1004.3880%2C1004.4603%2C1004.4204%2C1004.3500%2C1004.0073%2C1004.3330%2C1004.2524%2C1004.1110%2C1004.0593%2C1004.3987%2C1004.1059%2C1004.3174%2C1004.3675%2C1004.4260%2C1004.5032%2C1004.5469%2C1004.2183%2C1004.0463%2C1004.4247%2C1004.0799%2C1004.5157%2C1004.3949%2C1004.3273%2C1004.0710%2C1004.1911%2C1004.4097%2C1004.1230%2C1004.4963%2C1004.2872%2C1004.2003%2C1004.0350%2C1004.4750%2C1004.5010%2C1004.2870%2C1004.3128%2C1004.1638%2C1004.3633%2C1004.0208%2C1004.1443%2C1004.2618%2C1004.4050&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We explore the spatial variations of the unoccupied electronic states of\ngraphene epitaxially grown on Ru(0001) and observed three unexpected features:\nthe first graphene image state is split in energy, unlike all other image\nstates, the split state does not follow the local work function modulation, and\na new interfacial state at +3 eV appears on some areas of the surface. These\nresults show the system behaves as a self-organized periodic array of quantum\ndots."}, "authors": ["B. Borca", "S. Barja", "M. Garnica", "D. Sanchez-Portal", "V. M. Silkin", "E. V. Chulkov", "F. Hermanns", "J. J. Hinarejos", "A. L. Vazquez de Parga", "A. Arnau", "P. M. Echenique", "R. Miranda"], "author_detail": {"name": "R. Miranda"}, "author": "R. Miranda", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.105.036804", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1004.0593v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1004.0593v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "20 pages, 6 figures", "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1004.0593v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1004.0593v1", "journal_reference": "Physical Review Letters 105, 036804 (2010)", "doi": "10.1103/PhysRevLett.105.036804", "fulltext": "Potential Energy Landscape for hot electrons in\nperiodically nanostructured graphene\nB. Borca1, S. Barja1,2, M. Garnica1,2, D. Sánchez-Portal3,4*, V.M. Silkin3,4,5, E.V. Chulkov3,4,6, F.\nHermanns1, J.J. Hinarejos1,7, A.L. Vázquez de Parga1,2,7*, A. Arnau3,4,6, P.M. Echenique3,4,6, R.\nMiranda1,2,7\n1\n\nDep. de Física de la Materia Condensada, Universidad Autónoma de Madrid, Cantoblanco 28049,\nMadrid, Spain\n\n2\n\nInstituto Madrileño de Estudios Avanzados en Nanociencia (IMDEA-Nanociencia), Cantoblanco 28049,\nMadrid, Spain\n3\n\nCentro de Física de Materiales (CFM-MPC), Centro Mixto CSIC-UPV/EHU, Campus Ibaeta, San\nSebastian, Spain\n\n4\n\nDonostia International Physics Centre (DIPC), Paseo de Manuel Lardizabal 4, 20018 San Sebastian,\nSpain\n5\n\nIKERBASQUE, Basque Foundation for Science, 48011 Bilbao, Spain\n6\n\nDep. de Física de Materiales (UPV/EHU), Facultad de Química,\nApartado 1072, 20080 San Sebastian, Spain\n\n7\n\nInstituto \"Nicolás Cabrera\", Universidad Autónoma de Madrid, Cantoblanco 28049, Madrid, Spain\n\n*\n\ne-mail: al.vazquezdeparga@uam.es, sqbsapod@sq.ehu.es\n\n1\n\n\fABSTRACT: We explore the spatial variations of the unoccupied electronic states of graphene\nepitaxially grown on Ru(0001) and observed three unexpected features: the first graphene image state is\nsplit in energy, unlike all other image states, the split state does not follow the local work function\nmodulation, and a new interfacial state at +3 eV appears on some areas of the surface. These results\nshow the system behaves as a self-organized periodic array of quantum dots.\n\nKeywords: nanostructured graphene, lateral superlattice, STM/STS, first principle calculations\nLateral superlattices in graphene, a form of carbon with unique electronic properties,1 can be realized\nby periodic arrays of doping centres, electronic and geometric corrugations2 or externally applied\npotentials3 and have been predicted to show a number of intriguing properties such as anisotropic\npropagation of charge carriers,3 miniband transport and, even, new quasiparticles for triangular\nsuperlattices.4 A lateral superlattice consisting of regions of graphene with different electronic properties\ncan easily be prepared by thermal decomposition of hydrocarbons on single-crystal metallic substrates.5,6\nThis process results in an epitaxial graphene monolayer with a periodic array of bumps and valleys\n(termed ripples) originating from the lattice mismatch between graphene and the different substrates,\nwhich provide us with a tuneable pattern of structural and electronic heterogeneities.7\nBecause graphene is only one atom thick it is very sensitive to the interaction with the substrate. Its\nelectronic structure can be modified by the substrate by doping with electrons or holes or by inducing a\nperiodic modulation in the density of states or both effects simultaneously.8,2 In particular, graphene\ngrown on Ru(0001) is an ideal model system to study the interaction of nanostructured graphene with a\nmetallic substrate because the chemical interaction is spatially modulated with a periodicity of only 29.7\nÅ.9,10 Close to the Fermi level this spatially periodic, chemical interaction modulates the electronic\nstructure producing an ordered array of electron pockets.2 The unoccupied electronic states of these\ngraphene superlattices, however, have not been characterized or discussed so far, in spite of their\nrelevance for the dynamics of excited, hot electrons.\n\n2\n\n\fParticularly relevant among the unoccupied states are the image states, bound by the classical imagecharge response of metallic surfaces and with a free-electron like dispersion parallel to the surface. The\ninverse dependence on distance from the surface of the image potential leads to a Rydberg-like series of\nstates that converges to the continuum at the vacuum level (Evac).11 Inverse photoemission studies of the\nimage potential states had shown experimentally that the energy position of the Rydberg series is tied to\nthe local work function of the material.12,13 In STM experiments the electric field across the tunnel\njunction causes a Stark shift in the states of the hydrogenic spectrum, expanding the image state spectrum\ninto a resonance spectrum associated with the V-shaped potential. Following the analysis performed by\nGundlach in the 60's,14 the resulting energy spectrum can be approximated by the expression:\nEn=Φ+α(n-0.25)2/3F2/3\n\n(1)\n\nwhere, Φ is the surface work function, α is a constant, F is the electric field between tip and sample and\nn is the quantum number of the states. These Field Emission Resonances (FERs) were experimentally\nobserved in field ion microscopy by Jason15 and with an STM by Binnig et al.16 and, since then, they have\nbeen used to chemically identify different transition metals at surfaces17, obtain atomic resolution on\ninsulating surfaces, like diamond18 or study local changes on the surface work function.19,20\nIn this article we explore by means of scanning tunnelling microscopy/spectroscopy and first-principles\ncalculations the periodic modulation of the unoccupied electronic states in graphene/Ru(0001), mapping\nthe potential energy landscape for hot electrons in this lateral superlattice of graphene dots.\nExperimentally, we found three unexpected features in this system. The first graphene image state is\nlocalized on the H-areas, while it is more extended on the L-areas. This state is not tied to the local work\nfunction, i.e. it does not shift in energy following the 0.25 eV increase of local work function from L- to\nH-areas. A new interfacial state at +3 eV appears in the L-areas.\nThe experiments were done in two independent UHV chambers. One of them equipped with a variable\ntemperature STM working between 80K and 300K, and the other equipped with a Low Temperature\nSTM capable of working at temperatures between 4.6K and 77K. The tunnelling spectra were measured\nwith the feedback loop connected and the variation of the distance between tip and sample, z, was\n\n3\n\n\frecorded as a function of the bias voltage, V, applied. The z(V) curves were numerically differentiated to\nobtain the dZ/dV curves shown in Figure 1. Experiments performed using the lock-in technique showed\nno significant differences in the results.\nFigure 1A shows a 150×150 Å2 STM image recorded on a sample of Ru(0001) partially covered with\ngraphene. The image shows the moiré superstructure that appears at this sample voltage as an ordered\ntriangular array of bumps (right half of the image). The local electronic structure, usually determined\nfrom the intensity versus voltage characteristics of the tunnel junction, is obtained in this case from the\ntunnel distance, Z, versus voltage, V, curves, which contain basically the same information. Fig. 1B\nshows the dZ/dV curve measured on the clean Ru(0001) region. Three peaks reflecting the FERs are\nvisible in the spectra, the energy of the first FER being slightly above the work function (5.4 eV) of\nRu(0001).21 Figure 1C shows the dZ/dV curves measured locally on the H- and L-areas of the graphene\nmoiré (blue and red curves respectively). In the curves measured on the H-areas of the moiré (blue line),\nwhere the distance between graphene and the metal substrate is larger, the first FER appears around +4.4\neV, close to the average work function (4.5 eV) measured on this surface.21\n\nFIGURE 1. (A) Scanning tunnelling microscopy image measured at 4.6K at the edge of a graphene\nisland (150×150 Å2, Vs= -0.5V). The left hand side is the uncovered Ru(0001) surface, while on the right\nhand side the moiré superlattice of graphene appears as an triangular array of bumps separated by 29.7 Å.\n(B) dZ/dV curve measured on the clean Ru(0001) (green box on panel A). The curve shows the presence\nof the first three FERs. The first one appears at +5.6 eV, slightly above the value of the work function of\nclean Ru(0001). (C) dZ/dV curves measured on the moiré superstructure on the graphene island. The\n\n4\n\n\fblue curve is measured in the H-areas of the moiré superstructure (blue box in panel A), it shows the\npresence of the first four FERs. The red curve shows the corresponding spectra measured in the L-areas\nof the moiré superstructure (red box in panel A). There are two striking features in this curve, the\nappearance of a new peak at +3 eV and the shift in energy of the first FER with respect to the one in the\nH-areas (blue curve) which is in the direction opposite to the change in the local value of the work\nfunction between H- and L-areas.\nThe curves measured on the L-areas of the moiré, where the chemical interaction between graphene\nand ruthenium is stronger and, accordingly, the interlayer distance shorter, present some unexpected\nfeatures. First, there is a new peak, 3 eV above the Fermi level, well below the vacuum level, which is not\npresent in the H-areas of the moiré. Second, the first FER (next peak in the curve) is located now at +4.8\neV, i.e. at higher energy than in the H-areas. All higher order FERs appear at different energies on L and\nH-areas, their energy position on L-areas being always smaller than on H-areas, reflecting the difference\nin the local work function (0.25 eV lower on the L-areas),22 as expected from theory [see Eq.(1)] and\nexperiments in other systems.16,18 The first FER at the L-areas shows, however, an energy shift of about\n0.4 eV with respect to the peak at H-areas and in the opposite direction to the local work function\nchange. This reversed shift of the first FER is a robust result, which does not depend on the tip\nsharpness, sample temperature (in the range 4.6K-300K) or tunnelling current used in the experiments,\nalthough the exact magnitude of the energy shift in each case depends on the electric field between tip\nand sample that, in turn, depends on the tip sharpness and the tunnelling current used in the\nmeasurements (see Supporting Information).\n\n5\n\n\fFIGURE 2. (A) STM topographic image (90×90 Å2, Vs=-0.5V) measured simultaneously with the\ndZ/dV maps shown in the other panels. (B) dZ/dV map showing the spatial distribution of the new\nfeature that appears at +3V in the L-areas of the moiré superstructure. This feature presents a small\nmodulation in intensity. (C) dZ/dV map showing the spatial distribution of the feature that appears in the\nspectra a +4.4 V. The intensity of this feature is strictly confined to the H-areas of the moiré. (D) dZ/dV\nmap showing the spatial distribution of the feature that appears in the spectra a +4.8 V, the intensity of\nthis feature is strictly confined to the L-areas of the moiré and presents a small intensity modulation that\ndepends on the stacking sequence of the L-areas of the moiré, similar to that shown in B. The red circle\nmarks the same spot in all the images.\nTaking advantage of the spatial resolution of the STM, we map the spatial distribution of the spectral\nfeatures discussed above. Figure 2A shows a 90×90 Å2 STM topographical image of a single layer of\ngraphene grown on Ru(0001) with the characteristic bright (H-areas) and dark (L-areas) regions. Panels\n2B, 2C and 2D show dZ/dV maps measured simultaneously with the STM topography at bias voltages\ncorresponding, respectively, to the peak at +3.0 V and the first FER measured on the H- and L-areas of\nthe moiré at +4.4 and +4.8 V. The dZ/dV map of the new peak at +3.0 V presents intensity only on the\nL-areas of the moiré. It shows a small modulation, also seen in our topographical images (see Fig. 1 and\nFig. 2A), probably due to the different stacking sequence in the L-areas of the moiré,23 as also observed,\n6\n\n\ffor instance, for bilayer Co islands grown on Cu(111) with different stacking.24 The spatial distribution of\nthe +4.4 eV peak (Figure 2C) reveals that the state is strictly localized on the H-areas. On the contrary,\nthe dZ/dV map at +4.8 eV (Figure 2D) shows localization of the state on the L-areas with a spatial\nmodulation in the amplitude similar to Figure 2B.\n\nFIGURE 3. The figure shows the calculated evolution of the energies (relative to the Fermi level) of the\nunoccupied states at Γ, i.e., within the projected band gap of Ru(0001), when a laterally strained\ngraphene layer is approached to the surface. The data correspond to the top-hcp stacking of graphene\nover the Ru surface, but the results are quite independent of the registry between graphene and Ru. The\ngreen horizontal lines, at the right hand side, show the energy position of the different states for a freestanding strained graphene layer with our basis set of numerical orbitals supplemented with diffuse\norbitals. States labelled with \"+1\" and \"-1\" correspond to the first and second image states as described\nin Ref. (27) The letters refer to the different panels of Figure 4 showing the density associated with\nparticular states. Squares and circles stand, respectively, for doubly and singly degenerate states.\nIn order to understand the origin of the new spectral feature at +3 eV and the anomalous energy shift\nof the first FER, as well as the above mentioned different spatial localization of the FERs, we have\n\n7\n\n\fperformed two different sets of first-principles calculations based on density functional theory (DFT). In\nthe first series we have used the SIESTA code25 to make an explicit description of the electronic and\natomic structure of the substrate in order to characterize the (different) C-Ru interactions in the L- and\nH-areas. A second set of calculations have been performed using plane-waves and pseudopotentials to\nstudy the dependence of the field emission resonances on the applied electric field. The metallic substrate\nhas been modelled in this case using a repulsive potential to simulate the effect of the projected band gap\naround  in the confinement of the graphene image states and field resonances. The first set of\ncalculations permits an unambiguous identification of the resonance appearing at +3 eV on the L-areas,\nwhile the second helps in understanding the different way the applied field influences the first FER.\nThe actual structure of the graphene layer on Ru(0001) involves a very large (and complex) unit cell\nnot yet fully understood.26 This makes precise first-principles calculations on this system extremely\ndemanding. For this reason, commensurate structures with graphene strained to match the Ru lattice\nparameter (2.7 Å) were used to identify the main dependence of the electronic structure on the grapheneRu interlayer distance and registry (see Supporting Information for details). Figure 3 shows the results\nobtained when a strained graphene plane with a top-hcp registry with respect to the Ru surface layer is\nmoved towards the Ru(0001) surface. Very similar results are found for other stackings and here we just\nconcentrate on the effect of the graphene-Ru distance. First, we will discuss the origin of the different\nbands. The green horizontal lines in Figure 3 indicate the energy position of the states for a free-standing,\nbut strained, graphene layer. The first two states correspond to the first two \"image states\" (1+, 1-)\ndescribed in Ref. (27). These states are still bound to the layer using local or semilocal DFT, i.e., without\nthe explicit inclusion of the image-potential tail. At large distances the main effect of the Ru substrate is\nto break the up-down symmetry of the layer, as well as to confine these extended states due to the gap\nthat exists in the projected band structure at the relevant energy range. As a result, the 1+ and 1- states of\ngraphene form linear combinations either with larger weight towards the vacuum (red dots in Figure 3)\nor in the interface region (blue dots). The later rapidly shift upwards in energy out of the window\n\n8\n\n\frelevant for our experiments. On the contrary, the 1+ state (red dots) stays constant in energy for\ngraphene-Ru distances larger than 3.0 Å.\n\nFIGURE 4. Planar average of the density associated with selected states in our DFT calculations of\nstrained graphene on Ru(0001). The vertical lines mark the Ru(0001) surface (dashed black) and\ngraphene plane (continuous red). The letters of the panels correspond to the letters shown in Figure 3.\nFor a graphene-Ru distance d ~3 Å (panels E and F), i.e., for relatively weak C-Ru interaction (H-areas),\nthere is no interfacial state, in agreement with STS, while the observed first FER corresponds to the\nStark-shifted first image state of graphene (\"+1\" image state) modified due to the localization induced by\nthe neighbouring Ru surface. For d=3 Å we start to see a Ru(0001) surface resonance emerging from the\nbottom of the projected band gap. At d=2.4 Å (L-areas), when the interaction is strong (panels C and D),\nthe interfacial state shifts upwards by 1 eV and displaces its charge appreciably outside the graphene\nlayer due to the interlayer confinement, while the first FER shifts upwards by 0.3 eV only and its charge\ndistributes on both sides of the C-surface (both features observed in STS). At d=2.4 Å, both charge\ndistributions at + 3 and +5 eV are quite similar, in agreement with the results shown in Figs. 2B and 2D.\nA further extra pushing of the C-layer towards the metal to d=2 Å (panels A and B) reveals an avoided\n\n9\n\n\fcrossing of the two bands and, thus, confirms the origin of the C and Ru states responsible for this\ninteraction.\nApproaching the graphene layer further we also induce the confinement of the electronic states of the\nRu(0001) surface. This effect is particularly noticeable for a surface resonance of Ru that is pushed to\nhigher energies (green dots in Figure 3). This resonance is reminiscent of the surface states often\nobserved in the (111) surfaces of the noble metals and, for the clean Ru surface, appears slightly below\nthe edge of the Ru(0001) projected band gap. When the distance between the graphene layer and the\nRu(0001) surface is smaller than 3.0 Å, this Ru resonance is promoted to a surface state and starts to\nhybridize with the first image state of graphene (points marked as E and F in Figure 3). The\ncorresponding charge distributions are shown in Figure 4E and 4F. For distances around 2.4 Å this\nadditional resonance, strongly hybridized with graphene, appears near +3 eV (point C in Figure 3). Its\ncorresponding charge distribution is shown in Figure 4C and shows a remarkable increase in the charge\nabove the graphene overlayer. Simultaneously, the 1+ image state strongly shifts upwards in energy, as\nseen in Figure 3 (point D). The corresponding charge distribution is shown in Figure 4D and clearly\nshows an increase in the charge density in the space between the graphene overlayer and the Ru(0001)\nsurface.\nExperimentally we observed a resonance at + 3 eV only in the L-areas. We can now identify it with the\nrather broad Ru(0001) surface resonance that is lifted upwards (~1 eV from the bottom of the projected\nband gap at  ) due to the C-Ru interaction in the strongly bonded L-areas. In general, the adsorption of\nan adlayer on a metal surface gives rise to the appearance at the interface of new resonances with hybrid\ncharacter, very sensitive to the strength of the interaction between them.28 Indeed, recent calculations29\nhave shown that the graphene-Ru distance in the L-areas is ~2.4 Å in excellent agreement with our\nresults. Furthermore, similar dZ/dV spectra recorded on the moiré superstructure of graphene on Ir(111),\nwhere the graphene-Ir distance is larger, do not show a peak at +3 eV, thus, supporting our identification\nas an interface peak related to the short C-Ru distance. The corresponding charge distribution is very\n\n10\n\n\fsensitive to the graphene-Ru distance, as shown in Figure 4. It corresponds to an interfacial state whose\ncharge protrudes outside the graphene layer (allowing its detection by STM) only at short graphene-Ru\ndistances. Below 2.4 Å both the interfacial state (Figure 4A) and the 1+ graphene state (Figure 4B) shift\nto energies higher, particularly the interfacial one than those where they are experimentally detected.\nThe calculations not only permit the identification of the peak at +3 eV, but also to find the reason\nbehind the reversed shift of the first FER. As the graphene layer approaches the metal surface, the\nconfinement and the hybridization with Ru states shift the 1+ state upwards (by ~0.32 eV upon changing\nthe C-Ru distance from 3.0 to 2.4 Å). The applied electrical field can further enlarge the value of the\nupward energy shift of the first FER in the L-areas (see Supporting Information), where the 1+ state\nappears at higher energies and the local work function is smaller. The combination of these two facts\nmakes the 1+ more extended towards the vacuum in the L-areas than in the H- areas and, therefore, more\nsensitive to the electrical field applied between the STM tip and the surface. This produces an additional\nupward shift of the first FER in L-areas with respect to H-areas. This relative shift amounts to ~0.5 eV\nfor an electric field of 0.4 eV/Å. Thus, the combined effect of the electric field and the Ru induced\nconfinement over-compensates the change of the local work-function from L to H areas and explains the\nreversed shift of the first FER.\nIn summary, the effective potential felt by an electron in the 1+ state is less repulsive in the H-areas and\ncan be pictured as a periodic array of shallow attractive (respect to the average) potential wells of\nnanometer size associated with the H-areas. This explains the strong localization of the peak at +4.4 eV\nin the H-areas. It is well known that in two dimensions any attractive potential of finite intensity, under\nquite general conditions, has at least one bound state30. The situation for a periodic potential is slightly\ndifferent,31 but the effect is similar: the splitting of the bottom of the free-electron-like 1+ band into a\nquantum dot-like lower band (+4.4 eV) localized in the H-areas and a higher band (+4.8 eV) localized in\nthe spatially connected L-areas (see Figure 2).\nIn conclusion, we have explored the potential energy landscape for hot electrons in a lateral\nsuperlattice of graphene grown on Ru(0001). Due to the spatial modulation of the interaction with the\n\n11\n\n\fmetallic substrate, the energy position of the first FER is not tied to the value of the local work function\nbut splits into two sub-bands: the one at higher energy is localized over the extended L-areas and the one\nat lower energy is localized at the H-areas. The appearance of a new interfacial state was also discussed.\nThe energy position of this state is strongly dependent on the graphene-Ru interaction and, thus, it can be\nused to calibrate the minimum height of the layer above the Ru surface. The spatial modulation of the\nfirst image state of graphene on Ru(0001) resembles that of a periodic array of quantum dots with small\nbinding energies. Therefore, interesting electron correlation effects can be expected when several\nelectrons are simultaneously injected into this band. Selective adsorption of electron donor or acceptor\nmolecules can take place in these superlattices, whose periodicities and potential variations can be tuned\nby choosing the appropriate substrates. These results could also be important to understand the\nproperties of graphene intercalated compounds32 where the so called interlayer state, recently identified\nas the first image state27, plays a crucial role in the superconducting properties of graphite intercalated\nmaterials.33\nAcknowledgements\n\nFinancial support by the Ministerio de Ciencia e Innovación through projects CONSOLIDERINGENIO 2010 on Molecular Nanoscience and grants No. FIS2007-61114, FIS2007-6671-C02-00, and\nMAT2007-62732,\n\nComunidad\n\nde\n\nMadrid\n\nthrough\n\nthe\n\nprogram\n\nNANOBIOMAGNET\n\nS-\n\n2009//MAT1726, the Basque Departamento de Educación, UPV/EHU (Grant No. IT-366-07), the\nETORTEK program funded by the Basque Departamento de Industria and the Diputación Foral de\nGuipuzcoa is gratefully acknowledged.\nReferences\n(1) Geim, A.K.; Novoselov, K.S. Nat. Mater. 2007, 6, 183-191.\n(2) Vázquez de Parga, A.L.; Calleja, F.; Borca, B.; Passeggi, M.C.G.; Hinarejos, J.J.; Guinea, F.;\nMiranda, R. Phys. Rev. Lett. 2008, 100, 056807-1-4.\n\n12\n\n\f(3) Park, Ch.-H.; Yang, L.; Son, Y.W.; Cohen, M.L.; Louie, S.G. Nat. Phys. 2008, 4, 213-217.\n(4) Park, Ch.-H.; Yang, L.; Son, Y.-W.; Cohen, M.L.; Louie, S.G. Phys. Rev. Lett. 2008, 101, 1268041-4.\n(5) Land, T.A.; Michely, T.; Behm, R.J.; Hemminger, J.C.; Comsa, G. Surf. Sci. 1992, 264, 261-270.\n(6) Oshima, Ch.; Nagashima, A. J. Phys.: Condens. Matter 1997, 9, 1-20.\n(7) Preobrajenski, A.B.; Ng, M.L.; Vinogradov, A.S.; Måtensson, N. Phys. Rev. B 2008, 78, 0734011-4.\n(8) Zhou, S.Y.; Gweon, G.-H.; Fedorov, A.V.; First, P.N.; de Heer, W.A.; Lee, D.-H.; Guinea, F.;\nCastro Neto, A.H.; Lanzara, A. Nat. Mater. 2007, 6, 770-775.\n(9) Wang, B.; Bocquet, M.L.; Marchini, S.; Günther, S.; Wintterlin, J. Phys. Chem. Chem. Phys. 2008,\n10, 3530-3534.\n(10) Jiang, D.; Du, M.-H.; Dai, S. J. Chem. Phys. 2009, 130, 074705-1-5.\n(11) Echenique, P.M.; Pendry, J.B. J. Phys. C 1978, 11, 2065-2075.\n(12) Straub, D.; Himpsel, F.J. Phys. Rev. B 1986, 33, 2256-2261.\n(13) Fischer, R.; Schuppler, S.; Fischer, N.; Fasuter, Th.; Steinmann, W. Phys. Rev. Lett. 1993, 70,\n654-657.\n(14) Gundlach, K.H. 1966, 9, 949-957.\n(15) Jason, A.J. Phys. Rev 1966, 156, 266-285.\n(16) Binnig, G.; Frank, K.H.; Fuchs, H.; Garcia, N.; Reihl, B.; Rohrer, H.; Salvan, F.; Williams, A.R.\nPhys. Rev. Lett. 1985, 55, 991-994.\n(17) Jung, T.; Mo, Y.W.; Himpsel, F.J. Phys. Rev. Lett. 1995, 74, 1641-1644.\n13\n\n\f(18) Bobrov, K.; Mayne, A.J.; Dujardin, G. Nature 2001, 413, 616-619.\n(19) Pivetta, M.; Patthey, F.; Stengel, M.; Baldereschi, A.; Schneider, W.-D. Phys. Rev. B 2005, 72,\n115404-1-6.\n(20) Ruffieux, P.; Aït-Mansour, K.; Bendounan, A.; Fasel, R.; Patthey, L.; Gröning, P.; Gröning, O.\nPhy. Rev. Lett. 2009, 102, 086807-1-4.\n(21) Himpsel, F.J.; Christmann, K.; Heimann, P.; Eastman,D.E.; Feibelman, P.J. Surf. Sci. 1982, 115,\nL159-L164.\n(22) Brugger, T.; Günther, S.; Wang, B.; Dil, J.H.; Bocquet, M.L.; Osterwalder, J.; Wintterlin, J.;\nGreber, T. Phys. Rev. B 2009, 79, 045407-1-4.\n(23) Marchini, S.; Günther, S.; Wintterlin J. Phys. Rev. B 2007, 76, 075429-1-9.\n(24) Vázquez de Parga, A.L.; García-Vidal, F.J.; Miranda, R. Phys. Rev. Lett. 2000, 85, 4365-4368.\n(25) Martoccia, D.; Willmott, P.R.; Brugger, T.; Björck, M.; Günther, S.; Schlepütz, C.M.; Cervellino,\nA.; Pauli, S.A.; Patterson, B.D.; Marchini, S.; Wintterlin, J.; Moritz, W.; Greber, T. Phys. Rev. Lett.\n2008, 101, 126102-1-4.\n(26) Silkin, V.M.; Zhao, J.; Guinea, F.; Chulkov, E.V.; Echenique, P.M.; Petek, H. Phys. Rev. B 2009,\n80, 121408-1-4.\n(27) Gonzalez-Lakunza, N.; Fernández-Torrente, I.; Franke, K.J.; Lorente, N.; Arnau, A.; Pascual, J.I.\nPhys. Rev. Lett. 2008, 100, 156805-1-4.\n(28) Soler, J. M.; Artacho, E.; Gale, J.D.; García, A.; Junquera, J.; Ordejón, P.; Sánchez-Portal, D. J.\nPhys.: Cond. Matter 2002, 14, 2745-2780.\n(29) Sutter, P.; Hybertsen, M.S.; Sadowski, J.T.; Sutter, E. Nano Lett. 2009, 9, 2654-2660.\n\n14\n\n\f(30) Simon, B. Ann. Phys. (N.Y.) 1976, 97, 279.\n(31) Wunsch, B.; Guinea, F.; Sols, F. New. J. Phys. 2009, 10, 103027-1-5.\n(32) Dresselhaus, M.S.; Dresselhaus, G. Adv. Phys. 2002, 51, 1-186.\n(33) Csányi, G.; Littlewood, P.B.; Nevidomsky, A.H.; Pickard, C.J.; Simons, B.D. Nat. Phys. 2005, 1,\n42-45.\n\n15\n\n\fSupporting Information\nPotential Energy Landscape for hot electrons in periodically nanostructured graphene\nB. Borca, S. Barja, M. Garnica, D. Sánchez-Portal, V.M. Silkin, E.V. Chulkov, F. Hermanns, J.J.\nHinarejos, A.L. Vázquez de Parga, A. Arnau, P.M. Echenique and R. Miranda\nInfluence of the electric field between tip and sample\nThe main features present on the dZ/dV curves, i.e. the appearance of a new peak at +3eV in the L-areas\nof the moiré superstructure and the anomalous (comparing with the high order FERs) shift of the first\nFER when moving from the H-areas to the L-areas in the moiré unit cell, do not depend on the tip\nstructure, sample temperature or electric field between tip and sample. First, we will focus our attention\non the influence of the electric field strength between tip and sample on the dZ/dV curves. In Figure S1\nwe show two dZ/dV curves measured with two different tunnelling currents using the same tip in the\nsame area of the sample. To exclude tip changes during the measurements, the curves were acquired\nseveral times alternating the value of the tunnelling current from one curve to the next. The upper panel\nin Figure S1 shows the dZ/dV curves acquired with 0.1 nA with tip and sample at 300K. The first FER\nappears at +4.27 eV in the curves measured in the H-areas of the moiré superstructure and at +4.68 eV\nin the curves measured in the L-areas. Increasing the tunnelling current by a factor of 30 we are reducing\nthe distance between the tip and the sample and therefore increasing the electric field between them. In\nthe lower panel in Figure S1 we show the curves measured with the same tip in the same sample spot\nwith a tunnelling current of 3.0 nA. In these measurements with a higher electric field between tip and\nsample, the surface resonance present in the L-areas does not shift in energy and remains at +3.0 eV. The\nfirst FER in the H-areas appears slightly shifted in energy (+4.4 eV versus +4.27 eV with low electric\nfield). For the curve measured in the L-areas the first FER appears also higher in energy (+4.9 eV versus\n+4.68 eV). Thus the anomalous shift of the first FER is a robust feature independent of the strength of\nthe electric field. For the high order FERs the energy shifts are larger, but the relative ordering of the\nFERs in different regions, with the resonances in the L-areas having always lower energies, is consistent\nwith the observed change of local work function. Notice, however, that this change in behaviour is\nprogressive to a certain extent and the second FER almost does not move when moving from L- to Hareas. Although at higher energies, the second FER still exhibits a non-negligible influence from the\npotential energy landscape imposed by the graphene-Ru interactions that partially compensates the local\nwork function difference.\n\n16\n\n\fIt is also interesting to note that there is no appreciable shift in energy of the peak appearing around +3\neV in the L-areas when the electric field between tips and sample is changed, as can be seen in Figure S1.\nThis reinforces our interpretation of this feature as a surface derived state.\n\nFIGURE S1.: dZ/dV curves measured at 300K with the same tip on the same surface spot. The upper\n(lower) panel shows the curves recorded with a tunnelling current of 0.1 (3.0) nA. The black and red\ncurves reflect the measurements carried out on the H- and L-areas of the moiré superstructure\nrespectively.\nCalculations on strained graphene\nWe have performed two different sets of first-principles calculations based on density functional theory\n(DFT) to compare with our experimental results. In the first series we have used the SIESTA code that\nuses a basis set of numerical atomic orbitals to represent the electronic states and norm-conserving\npseudopotentials to model the interaction of valence electrons with the atomic cores. The first two image\nstates, 1+ and 1- according to our nomenclature, are still bound to the graphene layer at the level of\nstandard DFT calculations. However, in order to be able to represent these two states with SIESTA is\n\n17\n\n\fnecessary to include diffuse orbitals with s and p symmetry to the Carbon basis set. The purpose of the\nSIESTA calculations is to explore the dependence of the interaction between the Ru surface and the\ngraphene layer with their interlayer distance and, in particular, the possible appearance of interface states\ndue to the hybridization of Ru and graphene states. Since the complex relationship with the substrate and\nthe large unit cell of the moiré (periodicity of the superlattice, 29.7 Å) would be very difficult to simulate\naccurately by first principles calculations[1,2] we have adopted a different strategy. We have performed\ncalculations for a 1x1 cell of strained graphene with a lateral lattice parameter of 2.7 Å and, thus,\ncommensurate with the Ru substrate as a function of the graphene-Ru distance. A similar approach has\nbeen followed in some other recent works.[3] We have checked before that the band structure of this\nstrained graphene is qualitatively identical to that of relaxed graphene. Furthermore, the results are quite\ninsensitive to the registry of graphene on the Ru surface layer, but strongly dependent on the grapheneRu distance. In our calculations we have used a symmetric slab containing 23 layers of Ru with a\ngraphene layer on top of both surfaces.\nModel calculation with plane waves\nA second set of calculations have been performed using plane-waves and pseudopotentials to study the\ndependence of the Field Emission Resonances on the applied electric field. The metallic substrate has\nbeen modelled in this case using a repulsive potential to simulate the effect of the projected band gap\naround Γ on the confinement of the graphene image states and field resonances. The upper panels in\nFigure S2 show the energy position and the charge distribution for the 1+ state without electric field for\ntwo different configurations, the one at the left with the graphene closer to the metal surface (L-area) and\nthe one at the right with the graphene further away (H-area). Changing the distance between graphene\nand the metallic substrate strongly modifies the charge distribution. For larger distances (right panels) the\ncharge density increases in the area between the graphene and the ruthenium surface. The energy position\nof the state shifts down when the distance is increased. In the L-areas the 1+ state appears at higher\nenergies and the local work function is smaller. The combination of these two facts makes the 1+ more\nextended towards the vacuum in the L-areas than in the H-areas and, therefore, more sensitive to applied\nfield.\nNote that this effect cannot be observed in Figure 4 of the main text. The decay into the vacuum of the\ncharge distributions shown there only reflects the shape of the diffuse orbitals used to augment the basis\nset of local orbital in those calculations. We have checked, however, using our model calculations with\nplane-waves that the effect due to the applied electric field between the STM tip and the surface\nproduces an additional upward shift of the first FER in L-areas respect to H-areas.\n\n18\n\n\fIf an electric field is applied to the system there are some major changes in the energy positions and also\nin the charge distribution (Figure S2 lower panels). When the distance between graphene and ruthenium\nis small (i.e. the L-areas) the main effect of the electric field is to Stark shift the image state upwards in\nenergy by more than 0.5eV, but the charge distribution is almost identical with and without electric field\n(left panels). On the contrary, when the distance between graphene and ruthenium is larger the electric\nfield modifies the charge density distribution, increasing it between the graphene layer and the ruthenium\nand reducing its amplitude towards the vacuum (Figure S2 right panels). In this case there is a shift to\nhigher energies smaller than 0.1 eV. Furthermore, simple comparison of the two lower panels in Figure\nS2 reveals that, in the presence of applied field, the energy shift from H- to L-areas amounts\napproximately 0.5 eV in agreement with the observations.\n\nFIGURE S2: The upper panels show the energy position (thin red horizontal line) and charge density of\nthe 1+ image state without external electric field for relative distances between graphene and ruthenium\ncorresponding to the L and H-areas respectively. The lower panels show the same configuration but with\nan external electric field of 0.4 V/Å. The graphene layer is placed at distance d= 0 Å. (thick vertical black\nline).\nReferences\n\n19\n\n\f(1) Wang, B.; Bocquet, M. L.; Marchini, S.; Günther, S.; Wintterlin, J., Phys. Chem. Chem. Phys., 2008,\n10, 3530-3534.\n(2) Jiang, D.; Du, M.-H.; Dai, S., J. Chem. Phys., 2009, 130, 074705-1-5.\n(3) Sutter, P.; Hybertsen, M.S.; Sadowski, J.T.; Sutter, E., Nano Lett. 2009, 9, 2654–2660.\n\n20\n\n\f"}