{"id": "http://arxiv.org/abs/1111.3320v1", "guidislink": true, "updated": "2011-11-14T18:50:23Z", "updated_parsed": [2011, 11, 14, 18, 50, 23, 0, 318, 0], "published": "2011-11-14T18:50:23Z", "published_parsed": [2011, 11, 14, 18, 50, 23, 0, 318, 0], "title": "Quantitative Analysis of LISA Pathfinder Test Mass Noise", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.0627%2C1111.5755%2C1111.1524%2C1111.7019%2C1111.6595%2C1111.6489%2C1111.2709%2C1111.3810%2C1111.3410%2C1111.1411%2C1111.3188%2C1111.5739%2C1111.6648%2C1111.7054%2C1111.5069%2C1111.5078%2C1111.2439%2C1111.6449%2C1111.6936%2C1111.3588%2C1111.2599%2C1111.4944%2C1111.4913%2C1111.1876%2C1111.3414%2C1111.6843%2C1111.2692%2C1111.6523%2C1111.7222%2C1111.5809%2C1111.3870%2C1111.1344%2C1111.3883%2C1111.2585%2C1111.6730%2C1111.4782%2C1111.2666%2C1111.3652%2C1111.3911%2C1111.4443%2C1111.5184%2C1111.5201%2C1111.1031%2C1111.2086%2C1111.5845%2C1111.3561%2C1111.5878%2C1111.4717%2C1111.2595%2C1111.7212%2C1111.4870%2C1111.4836%2C1111.2801%2C1111.4243%2C1111.0417%2C1111.5660%2C1111.0479%2C1111.6512%2C1111.6470%2C1111.5961%2C1111.2164%2C1111.0451%2C1111.4657%2C1111.7219%2C1111.3320%2C1111.2339%2C1111.7283%2C1111.0065%2C1111.1538%2C1111.3528%2C1111.0161%2C1111.6617%2C1111.1410%2C1111.4955%2C1111.5154%2C1111.5554%2C1111.0462%2C1111.6116%2C1111.4179%2C1111.5965%2C1111.6605%2C1111.3743%2C1111.5160%2C1111.1218%2C1111.1156%2C1111.6845%2C1111.6090%2C1111.6663%2C1111.5365%2C1111.2726%2C1111.1732%2C1111.0806%2C1111.4252%2C1111.2843%2C1111.0927%2C1111.2401%2C1111.5924%2C1111.2760%2C1111.2831%2C1111.4772%2C1111.2009&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quantitative Analysis of LISA Pathfinder Test Mass Noise"}, "summary": "In this paper we discuss two main problems associated with the analysis of\nthe data from LISA Pathfinder (LPF): i) Excess noise detection and ii) Noise\nparameter identification. The mission is focused on the low frequency region\n([0.1; 10] mHz) of the available signal spectrum. In such a region the signal\nis dominated by the force noise acting on test masses. Noise analysis is\nexpected to deal with a limited amount of non-Gaussian data, since the spectrum\nstatistics will be far from Gaussian and the lowest available frequency is\nlimited by the data length. In this paper we analyze the details of the\nexpected statistics for spectral data and develop two suitable excess noise\nestimators. One is based on the statistical properties of the integrated\nspectrum, the other is based on Kolmogorov-Smirnov test. The sensitivity of the\nestimators is discussed theoretically for independent data, then the algorithms\nare tested on LPF synthetic data. The test on realistic LPF data allows the\neffect of spectral data correlations on the efficiency of the different noise\nexcess estimators to be highlighted. It also reveals the versatility of the\nKolmogorov-Smirnov approach, which can be adapted to provide reasonable results\non correlated data from a modified version of the standard equations for the\ninversion of the test statistic. Closely related to excess noise detection, the\nproblem of noise parameter identification in non-Gaussian data is approached in\ntwo ways. One procedure is based on maximum likelihood estimator and another is\nbased on the Kolmogorov-Smirnov goodness of fit estimator. Both approaches\nprovide unbiased and accurate results for noise parameter estimation and\ndemonstrate superior performance with respect to standard weighted\nleast-squares and Huber's norm.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1111.0627%2C1111.5755%2C1111.1524%2C1111.7019%2C1111.6595%2C1111.6489%2C1111.2709%2C1111.3810%2C1111.3410%2C1111.1411%2C1111.3188%2C1111.5739%2C1111.6648%2C1111.7054%2C1111.5069%2C1111.5078%2C1111.2439%2C1111.6449%2C1111.6936%2C1111.3588%2C1111.2599%2C1111.4944%2C1111.4913%2C1111.1876%2C1111.3414%2C1111.6843%2C1111.2692%2C1111.6523%2C1111.7222%2C1111.5809%2C1111.3870%2C1111.1344%2C1111.3883%2C1111.2585%2C1111.6730%2C1111.4782%2C1111.2666%2C1111.3652%2C1111.3911%2C1111.4443%2C1111.5184%2C1111.5201%2C1111.1031%2C1111.2086%2C1111.5845%2C1111.3561%2C1111.5878%2C1111.4717%2C1111.2595%2C1111.7212%2C1111.4870%2C1111.4836%2C1111.2801%2C1111.4243%2C1111.0417%2C1111.5660%2C1111.0479%2C1111.6512%2C1111.6470%2C1111.5961%2C1111.2164%2C1111.0451%2C1111.4657%2C1111.7219%2C1111.3320%2C1111.2339%2C1111.7283%2C1111.0065%2C1111.1538%2C1111.3528%2C1111.0161%2C1111.6617%2C1111.1410%2C1111.4955%2C1111.5154%2C1111.5554%2C1111.0462%2C1111.6116%2C1111.4179%2C1111.5965%2C1111.6605%2C1111.3743%2C1111.5160%2C1111.1218%2C1111.1156%2C1111.6845%2C1111.6090%2C1111.6663%2C1111.5365%2C1111.2726%2C1111.1732%2C1111.0806%2C1111.4252%2C1111.2843%2C1111.0927%2C1111.2401%2C1111.5924%2C1111.2760%2C1111.2831%2C1111.4772%2C1111.2009&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this paper we discuss two main problems associated with the analysis of\nthe data from LISA Pathfinder (LPF): i) Excess noise detection and ii) Noise\nparameter identification. The mission is focused on the low frequency region\n([0.1; 10] mHz) of the available signal spectrum. In such a region the signal\nis dominated by the force noise acting on test masses. Noise analysis is\nexpected to deal with a limited amount of non-Gaussian data, since the spectrum\nstatistics will be far from Gaussian and the lowest available frequency is\nlimited by the data length. In this paper we analyze the details of the\nexpected statistics for spectral data and develop two suitable excess noise\nestimators. One is based on the statistical properties of the integrated\nspectrum, the other is based on Kolmogorov-Smirnov test. The sensitivity of the\nestimators is discussed theoretically for independent data, then the algorithms\nare tested on LPF synthetic data. The test on realistic LPF data allows the\neffect of spectral data correlations on the efficiency of the different noise\nexcess estimators to be highlighted. It also reveals the versatility of the\nKolmogorov-Smirnov approach, which can be adapted to provide reasonable results\non correlated data from a modified version of the standard equations for the\ninversion of the test statistic. Closely related to excess noise detection, the\nproblem of noise parameter identification in non-Gaussian data is approached in\ntwo ways. One procedure is based on maximum likelihood estimator and another is\nbased on the Kolmogorov-Smirnov goodness of fit estimator. Both approaches\nprovide unbiased and accurate results for noise parameter estimation and\ndemonstrate superior performance with respect to standard weighted\nleast-squares and Huber's norm."}, "authors": ["Luigi Ferraioli", "Martin Hewitson", "Giuseppe Congedo", "Miquel Nofrarias", "Mauro Hueller", "Michele Armano", "Stefano Vitale"], "author_detail": {"name": "Stefano Vitale"}, "author": "Stefano Vitale", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.84.122003", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1111.3320v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1111.3320v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Accepted for publication in Phys Rev D", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.data-an", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1111.3320v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1111.3320v1", "journal_reference": null, "doi": "10.1103/PhysRevD.84.122003", "fulltext": "Quantitative Analysis of LISA Pathfinder Test Mass Noise\nLuigi Ferraioli,∗ Giuseppe Congedo, Mauro Hueller, and Stefano Vitale\nUniversity of Trento and INFN, via Sommarive 14, 38123 Povo (Trento), Italy\n\nMartin Hewitson\nAlbert-Einstein-Institut, Max-Planck-Institut fuer Gravitationsphysik\nund Universität Hannover, Callinstr. 38, 30167 Hannover, Germany\n\nMiquel Nofrarias\nInstitut de Ciències de l'Espai, (CSIC-IEEC), Facultat de Ciències,\nCampus UAB, Torre C-5, 08193 Bellaterra, Spain\n\nMichele Armano\n\narXiv:1111.3320v1 [gr-qc] 14 Nov 2011\n\nSRE-OD ESAC, European Space Agency, Camino bajo del Castillo s/n,\nUrbanización Villafranca del Castillo, Villanueva de la Cañada, 28692 Madrid, Spain\nLISA Pathfinder (LPF) is a mission aiming to test the critical technology for the forthcoming\nspace-based gravitational wave detectors. The main scientific objective of the LPF mission\n√ is to\ndemonstrate test-masses free-falling with residual accelerations below 3 × 10−14 m s−2 / Hz at 1\nmHz. Reaching such an ambitious target will require a significant amount of system optimisation\nand characterisation, which will in turn require accurate and quantitative noise analysis procedures.\nIn this paper we discuss two main problems associated with the analysis of the data from LPF:\ni) Excess noise detection and ii) Noise parameter identification. The mission is focused on the\nlow frequency region ([0.1, 10] mHz) of the available signal spectrum. In such a region the signal\nis dominated by the force noise acting on test masses. At the same time, the mission duration\nis limited to 90 days and typical data segments will be 24 hours in length. Considering those\nconstraints, noise analysis is expected to deal with a limited amount of non-Gaussian data, since\nthe spectrum statistics will be far from Gaussian and the lowest available frequency is limited by\nthe data length. In this paper we analyze the details of the expected statistics for spectral data\nand develop two suitable excess noise estimators. One is based on the statistical properties of\nthe integrated spectrum, the other is based on Kolmogorov-Smirnov test. The sensitivity of the\nestimators is discussed theoretically for independent data, then the algorithms are tested on LPF\nsynthetic data. The test on realistic LPF data allows the effect of spectral data correlations on the\nefficiency of the different noise excess estimators to be highlighted. It also reveals the versatility of\nthe Kolmogorov-Smirnov approach, which can be adapted to provide reasonable results on correlated\ndata from a modified version of the standard equations for the inversion of the test statistic. Closely\nrelated to excess noise detection, the problem of noise parameter identification in non-Gaussian data\nis approached in two ways. One procedure is based on maximum likelihood estimator and another\nis based on the Kolmogorov-Smirnov goodness of fit estimator. Both approaches provide unbiased\nand accurate results for noise parameter estimation and demonstrate superior performance with\nrespect to standard weighted least-squares and Huber's norm. We also discuss the advantages of\nthe Kolmogorov-Smirnov formalism for the estimation of confidence intervals of parameter values\nin correlated data.\nPACS numbers: 04.80.Nn, 95.75.-z, 07.05.Kf\nKeywords: LISA Pathfinder; LISA Technology Package; LTP; Noise Analysis\n\nI.\n\nINTRODUCTION\n\nLISA Pathfinder (LPF), a European Space Agency mission, will be used to characterize and analyze all possible\nsources of disturbance which perturb free-falling test masses from their geodesic motion. The system is composed of a\nsingle spacecraft (SC) enclosing a scientific payload, the LISA Technology Package (LTP), which is composed of two\ntest masses (TMs) whose position is sensed by an interferometer. The spacecraft cannot simultaneously follow both\nmasses, therefore the trajectory of only one test mass is used as a drag-free reference along the measurement axis. In\n\n∗ Electronic\n\naddress: luigi@science.unitn.it\n\n\f2\norder to prevent the trajectories of the test-masses from diverging, the second test mass is capacitively actuated to\nfollow the first (free-falling) TM. In the main science operating mode, the first interferometer channel measures the\ndisplacement of the SC relative to the free-falling TM. The second interferometer channel (the differential channel)\nmeasures the relative displacement between the two TMs.\nLPF is a controlled system which can only be fully assessed during flight operation, therefore a considerable number\nof experiments will be devoted to the identification of the details of the dynamics of the system. A dynamical model of\nLPF is built in advance on the basis of physical considerations and from the results of test campaigns. The dynamical\nmodel is parametric so that it can be updated on the basis of the experiments that will be conducted during √\nmission\noperations. The overall aim of the process is to reach the best free-fall quality (below 3 × 10−14 m s−2 / Hz at\nfrequencies around 1 mHz) in a step-by-step procedure in which the result of the previous experiment is used to\nadjust the detailed configuration of the following experiments [1–4].\nSuch a demanding program requires daily analysis of the instrument signals constrained by two major factors:\ni) the amount of available data is tightly constrained by LTP mission duration (90 days), the telemetry bandwidth,\nand the length of each data segment (typically 24 h); ii) the scientific interest is mainly focused on the analysis of\nnoise sources which act directly on the TMs since that should provide a baseline reference for the forthcoming spacebased gravitational waves observatories [5–8]. The direct forces on the TMs are expected to dominate the instrument\noutput in the frequency range [0.1, 10] mHz. Sample power spectra are typically calculated with Welch's averaging\nperiodogram method (WOSA) [9]. In order to keep enough frequency resolution at low frequencies, the sample power\nspectra can not be averaged more than few times (we average 4 times in the present paper), this results in highly\nnon-Gaussian data for which we are developing dedicated techniques. In particular the paper aims to propose a\nsolution for two major data analysis challenges encountered in LPF: i) Different measurements of the same physical\nquantity can exhibit different noise content if they are performed under slightly different environmental conditions.\nThe objective of LISA Pathfinder data analysis during operations will be to discover such differences, understand\ntheir origin and adjust spacecraft physical parameters accordingly. Such a problem requires reliable excess noise\ndetection procedures which have to be based on solid statistical considerations; ii) Along with the demonstration of\nunprecedented test-mass free-fall, LPF will provide a model for the expected test mass force noise for future spacebased gravitational wave detectors. In order to do this, we need to be able to match an analytical model to a noisy\npower spectral density measurement. The quality of the match must be statistically quantified. Both data analysis\nproblems deal with sample spectra and the corresponding statistical properties. Section II reports on the properties\nof different experimental procedures for the detection of noise excess. In particular we considered two cases where\nthe noise excess is evaluated with respect to reference data or a reference model. The accuracy of the methods is\ntheoretically analyzed for the case of broadband and band-limited excess noise. In Section III the problem of noise\nparameter estimation for non-Gaussian data is explored and an algorithm based on maximum likelihood is derived.\nIn parallel, the application of the Kolmogorov-Smirnov formalism to the construction of a goodness of fit estimator\nis discussed. Section IV reports briefly on the extension of the analysis procedures to the case of non-stationary noise\nand time-frequency investigations. In Section V we provide an application of the developed algorithms to synthetic\ndata with LPF-like qualities. This allows us to shed light on the effects of data correlations on the accuracy of the\ndeveloped excess noise estimators. The analysis procedures are available as MATLAB tools in the framework of the\nLTPDA Toolbox [10–12]; an object oriented MATLAB Toolbox for advanced data analysis.\n\nII.\n\nQUANTITATIVE DETECTION OF NOISE POWER VARIATIONS\n\nThe problem of the detection of noise power variation in consecutive measurements can be formulated in two\ndifferent ways. i) Two different measurements of the power are compared; ii) The different measurements of the\npower are compared with a reference model. The problem in the first case is of general character and can be applied\nto a wide range of experiments, the second case, on the other hand, assumes that a reference model for the noise power\nis known and data must be compared against the given model in order to understand if the system is performing\nunder known conditions. The latter case is likely to be the scenario for LPF operations. The quantity typically\nP used\n2\nfor the detection of noise power variations is the total energy content of the data series. It is defined as E = T i |xi | .\nUnfortunately, E, provides a poor estimator for two reasons: i) As soon as the data series x0 , . . . , xN −1 departs from\nzero mean Gaussian white noise, the statistic of E becomes ill-defined and the definition of a confidence interval\nbecomes cumbersome; ii) E provides global information as it is not sensitive to noise changes in a given frequency\nband. While the first problem could be overcome (without little difficulty) by a numerical identification of the expected\nstatistic, the second problem suggests that a spectral based estimator would provide supplementary information which\ncould be fundamental in discriminating different noise sources.\n\n\f3\nA.\n\nDetection of noise variations with a model\n\nIn the case that a reference model is available, the detection of excess noise in the spectral domain can be effectively\nimplemented with a test on the normalized Welch's overlapped segment averaging (WOSA) spectrum RWOSA (fk )\ndefined in equation (A9). In particular, the test can pursue two different philosophies of which one aims to test a\nglobal scalar indicator of the properties of the data and another aims to test the details of the statistical distribution\nof the data.\nA sensible estimator for the first approach is provided by the integral of the normalized spectrum which, in the\ndiscrete case, can be written:\nIR =\n\nNf\nX\n\nRWOSA (fk ).\n\n(1)\n\nk=1\n\nIn the simplifying assumption of independent spectral data, the statistic of each element of RWOSA (fk ) is described\nby a gamma distribution as defined by equation (A8) with δ = 1/Ns and h = Ns . The sum over the different values\nat the frequencies fk is still a gamma distribution with δ = 1/Ns and h = Ns Nf . The expectation value for IR is\neasily obtained as E [IR] = δh = Nf .\nThe natural estimator for the second approach is provided by the empirical cumulative distribution function\n(ECDF). The ECDF for a data series can be defined as FN (x) = z/N , where z is the number of observations\nreporting a value less than or equal to x. x denotes the values taken by the data, in our case RWOSA (fk ) with\nk = 1, . . . , Nf . The ECDF can be tested against the theoretical expectation provided by equation (A8). If the\nmodel well represents the given sample spectrum then RWOSA (fk ) is distributed according to the expected gamma\ndistribution. Alternatively, if the sample spectrum contains a excess noise with respect to the reference model, then\nthe distribution of the normalized WOSA spectrum will be different from the one reported in equation (A8). The\nhypothesis that the two distributions are equal can be tested if a 'distance' between the ECDF and the theoretical\nreference, FΓ , is defined as:\ndK (x) = |FN (x) − FΓ (x)| ,\n\n(2)\n\nwith dK (x) assuming values on the interval [0, 1] and K = Nf . Kolmogorov found that the statistical properties of\ndK = max [dK (x)]\n\n(3)\n\nare independent from the specific distributions under test [13, 14]. This property qualifies dK as an excellent\ncandidate for the construction of a general test for cumulative distribution functions, the limiting statistic for dK was\nidentified by Kolmogorov himself and then inverted by Smirnov [15, 16] who provided an analytical expression for the\ncalculation of dK as a function of the significance level. General details about the Kolmogorov-Smirnov test (KS-test)\nare reported in appendix B.\nIt is interesting to calculate the expected sensitivity for the two estimators. IR is expected to be distributed\nas a gamma distribution (at least when the model and the data are in agreement), the corresponding cumulative\ndistribution function (CDF) is provided by the incomplete gamma function P (h, x/δ) [17]. The CDF assumes values\nin the interval [0, 1] as it defines the probability associated with the observation x. The inverse of the CDF provides\nthe critical values, xρ , associated with a given probability, ρ ∈ [0, 1]. The confidence range for a probability, ρ, for a\ngamma distributed variable can then be defined by the boundaries xlw = P −1 (α/2) and xup = P −1 (1 − α/2), with\nα = 1 − ρ. We assert that the measured sample spectrum is compatible with the reference model if xlw ≤ IR ≤ xup\nfor the given probability, ρ, or significance level, α.\nIf the noise excess is provided by a scale factor, γ, which affects the noise on the complete band of frequencies,\nthe expected value for IR changes to E (IR) = γNf . Therefore the detection threshold for γ is fixed by the interval\nxlw /Nf ≤ γ ≤ xup /Nf . In other words, the IR can detect a noise difference with respect to the reference model\nonly if γ < xlw /Nf or if γ > xup /Nf . If γ is non-zero only in a restricted band of frequencies [fa , fb ], then the\nexpectation value for IR changes to E (IR) = Nf − Nab + Nab γ. In this case IR can detect the noise difference only\nif γ < (xlw − Nf + Nab ) /Nab or γ > (xup − Nf + Nab ) /Nab . Nab is the number of frequency points in the interval\n[fa , fb ].\nIn the case of the Kolmogorov-Smirnov (KS) estimator, the ECDF of the WOSA normalized spectrum is compared\nwith the theoretical expectation P (Ns , xNs ). In the case that the noise excess is simply a constant scale factor, γ, over\nthe whole frequency band, the expected CDF for the normalized WOSA spectrum is P (Ns , xNs /γ). The expected\nvalue for the KS test variable is then written as:\n\u0012\n\u0013\nxNs\ndK (γ) = max P Ns ,\n− P (Ns , xNs ) .\n(4)\nγ\n\n\f4\n\n1.2\n\nNs = 4\n\nNs = 8\n\n1.2\n\nKS\nIR\n\n1.1\n\n1.1\n\n1.1\n\n1\n\n1\n\n1\n\n0.8 2\n10\n\nγ\n\nC\n\nγ\n\nB\n\nγ\n\nA\n\n0.9\n\n0.9\n\n3\n\n10\nNf\n\n10\n\n4\n\nNs = 16\n\n1.2\n\n0.9\n\n0.8 2\n10\n\n3\n\n10\nNf\n\n10\n\n4\n\n0.8 2\n10\n\n3\n\n10\nNf\n\n10\n\n4\n\nFIG. 1: Non-detection ranges for IR and KS estimators. Noise excess is assumed as a constant multiplicative factor\nγ extending along the whole band of frequencies. Darkened intervals define the thresholds for γ detection, if γ is\nlarger or smaller than the shaded values it can be detected with a confidence of 95%. Ns refers to WOSA averages.\nNf is the number of frequency points in the spectrum.\nNs = 4\n\n2\n\nNs = 8\n\n2\n\nB\n\nC\n\n1.5\n\n1.5\n\n1.5\n\n1\n\n1\n\n1\n\n0.5\n\n0 -2\n-1\n0\n10\n10\n10\nNab / Nf\n\nγ\n\nA\n\nγ\n\nγ\n\n2\n\n0.5\n\n0 -2\n-1\n0\n10\n10\n10\nNab / Nf\n\nNs = 16\nKS\nIR\n\n0.5\n\n0 -2\n-1\n0\n10\n10\n10\nNab / Nf\n\nFIG. 2: Non-detection ranges for IR and KS estimators in the case that noise excess coefficient γ is different from\nzero in a restricted band [fa , fb ]. Data are presented as a function of the ratio Nab /Nf where Nab is the number of\nfrequency points in the interval [fa , fb ] and Nf is the total number of frequency points in the spectrum. Ns refers to\nWOSA averages. Confidence level for excess detection is fixed to 95%.\n\nOnce a significance value α is provided, the corresponding critical value, dK (α), can be calculated from the equations\nfor the inversion of the limiting CDF for dK [15, 16]. The two distributions in equation (4) are incompatible at the\ngiven significance level if dK (γ) > dK (α). This defines the detection threshold for γ. If γ is non-zero only in a\nrestricted band of frequencies [fa , fb ], then the expected distribution for the normalized WOSA estimator is difficult\nto calculate. Nevertheless the detection threshold for the KS estimator can be calculated numerically from synthetic\ndata.\nIn figure 1, the ranges of non-detectability of the KS and IR estimators are reported as a function of Nf for three\ndifferent values of the WOSA averages Ns . Data refer to the case that the scale factor, γ, extends over the complete\nfrequency band. As can be clearly seen, the IR estimator always has a better sensitivity than the KS estimator. The\nsensitivity for the case of a band limited excess noise is reported in figure 2 as a function of the ratio Nab /Nf . As in\nthe previous case, the IR estimator provides a better sensitivity with respect to the KS estimator. The difference is\nparticularly relevant for Nab /Nf < 0.07, below such values the sensitivity of the KS estimator becomes poor. Both in\nfigure 1 and in figure 2 the confidence level for γ detection is fixed at 95%.\n\n\f5\n\n1.3\nA\n1.2\n\n2\n\nNs = 4\n\nB\n\nN =8\ns\n\n1.5\n\nN = 16\ns\n\nγ\n\nγ\n\n1.1\n1\n\n1\n0.5\n\n0.9\n0.8 2\n10\n\n3\n\n10\nNf\n\n10\n\n4\n\n0 -2\n10\n\n-1\n\n10\nNab / Nf\n\n10\n\n0\n\nFIG. 3: Non detection ranges for the KS estimator for the comparison of two sample spectra. A) Noise excess\ncoefficient γ 6= 0 on the full frequency band. Ns is the number of WOSA averages. Nf is the number of frequency\npoints in the sample spectrum. B) γ 6= 0 only in a restricted interval of frequencies [fa , fb ]. Nab is the number of\npoints in the interval.\n\nIt is worth noting that KS algorithm can be used directly on time series to quantitatively gauging departures\nfrom a given distribution (e.g. Gaussian). Once the ECDF for the data is calculated, it can be compared with the\nexpected distribution by calculating dK (x) from equation 2. Since the distribution of dK (x) coefficients is known it is\nstraightforward to set a confidence threshold. The procedure can be applied even in presence of correlations thanks\nto the generalizations discussed in section V B and in appendix B.\n\nB.\n\nDetection of noise variations without a model\n\nIn the case that an excess of noise has to be detected by comparing different measurements the Parseval's theorem\nPN/2\n[9] (E =\nP (fk )) suggests that the sum of the elements of a sample spectrum in a given frequency band\nPb k=0\nEab = k=a P (fk ) could provide a sensitive estimator for noise power variations. Such an estimator would be loosely\nequivalent to the IR discussed above, except that its statistic is hard to determine in a typical experimental situation.\nThe statistic of P (fk ) at each frequency, fk , is defined by equation (A4). Therefore, in the case of non-white noise,\nits parameters depend on S (fk ) and the statistic is different at different frequencies. Thus the statistic of Eab is not\neasily known.\nAn interesting alternative to Eab is provided by the KS estimator. Given two data series {xn1 } and {xn2 } of length\nN1 and N2 respectively. The hypothesis that their ECDFs have the same limiting cumulative distribution function\nF (x) can be tested if a distance in the ECDFs space is defined as:\ndK (x) = |Fn1 (x) − Fn2 (x)| ,\n\n(5)\n\nwith dK (x) defined on the interval [0, 1] and K = (N1 N2 ) / (N1 + N2 ) [14]. Also in this case, the statistical\nproperties of\ndK = max [dK (x)]\n\n(6)\n\nare independent from the distributions of xn1 and xn2 . The same equations used in the case of the comparison with\na given model can now be used for the inversion of the cumulative statistic of dK [31]. Considering the simplifying\nassumption of independent spectral data, the sensitivity of the KS estimator at a given significance level can be\ncalculated in analogy to what was discussed in the previous paragraph.\nIn figure 3 the calculated interval for non-detection is reported for the case that the excess, γ, is extending over the\nwhole frequency band and for the case that γ 6= 0 in [fa , fb ].\n\n\f6\nIII.\n\nNOISE MODEL IDENTIFICATION\n\nClosely related to the problem of excess noise detection, the problem of noise model identification is one of the\nprincipal scientific objectives of LPF mission. Of particular interest is the identification of a model for the force noise\nacting on the TMs, which can be used as a baseline for the forthcoming space-based gravitational wave observatories.\nThe main constrains on the identification of force noise on the TMs in LPF are fixed by i) the limited data series\nlength, typically 24 h; ii) the frequency range in which force noise on the TMs is dominating the signal is below\n10 mHz; iii) force noise data are not directly accessible since the system measures and reports TM displacement,\nrequiring that force noise on TMs be reconstructed by a numerical procedure [18, 19].\nThe result of the combination of the first two constraints is that the number of segment averages in the WOSA\nprocedure for sample spectrum estimation should be taken as low as possible so as to have a reasonable number\nof frequency points in the range f ∈ [0.1, 10] mHz. As a consequence, the distribution of the WOSA spectrum\nstrongly departs from a Gaussian distribution [32], meaning that the classical least-squares minimization procedure\nfor parameter estimation is not well conditioned and a full maximum likelihood procedure is required.\nA.\n\nMaximum Likelihood Parameter Estimation\n\nIf we replace S (fk ) in equation (A9) with a parametric model for the spectrum, S (fk ; θ1 , . . . , θH ), the normalized\nWOSA spectrum becomes parametric, RWOSA (fk ; θ1 , . . . , θH ), and can be used for the estimation of noise model\nparameters {θ1 , . . . , θH }. In this section we develop the likelihood formalism for the simple case that the noise model\nis a function of a single parameter, S (fk ; θ) = θS0 (fk ). This allows us, not only to find a sensible goodness of fit\nestimator for RWOSA (fk ; θ) that can be used also in the case of multiple parameters, but also to place the excess\nnoise estimator, IR, in a more solid theoretical framework.\nIndicating with θTRUE the 'true' value for the θ parameter, RWOSA (fk ; θ) can be rewritten as:\nPWOSA (fk )\nθTRUE S0 (fk )\ntrue\n= φRWOSA\n(fk ) .\n\nRWOSA (fk ; φ) = φ\n\n(7)\n\nHere φ = θtrue /θ. Assuming that θTRUE S0 (fk ) correctly reproduces the expected value for the spectrum, the\ntrue\ndistribution of RWOSA\n(fk ) is reported in equation (A8) with δ = 1/Ns and h = Ns . The distribution of the samples\nRWOSA (fk ; φ) is then:\ny\n\nf (y; h, δ, φ) =\n\ne− φδ y h−1\nh\n\n(φδ) Γ (h)\n\n.\n\n(8)\n\nUnder the simplifying assumption that the values of RWOSA (fk ; φ) are independent for different fk , the likelihood\nfunction can be written as:\nY\nL (h, δ, φ) =\nf (yk ; h, δ, φ) ∆y.\n(9)\nk\n\nHere ∆y is a constant term required to have a finite probability from the probability distribution function f (yk ; h, δ, φ).\nyk are observed samples corresponding to RWOSA (fk ; φ). It is typically more convenient to work with the natural\nlogarithm of the likelihood function l (h, δ, φ) = ln L (h, δ, φ).\nX\n1 X\nl (h, δ, φ) ∼ (h − 1)\nln yk −\nyk − Nf h ln φ.\n(10)\nφδ\nk\n\nk\n\nNf is the total number of frequency samples. Taking the first derivative with respect to φ and equating to 0 we find\nthe maximum likelihood estimator for the parameter φ:\n1X\nΛ=\nRWOSA (fk ; φ) − Nf .\n(11)\nφ\nk\n\nThe value of φ at which Λ = 0 corresponds to the maximum likelihood estimation for the parameter. The Λ\nestimator is unbiased, since, remembering that φ = θtrue /θ, it can be verified that limθ→θtrue E [Λ] = 0. For the\npractical purpose we can find the zero crossing of the reduced estimator\nX\nΛ̃ =\nRWOSA (fk ; θ) − Nf ,\n(12)\nk\n\n\f7\nwhich is crossing zero at the same θ value of Λ, since φ → 1 when θ → θtrue . It is worth noting that Λ̃ is practically\nthe IR excess noise estimator with the expectation value Nf subtracted. It is then worth noting that Λ̃ can be used\nnot only in the simple case of one parameter but it can also be applied in the general case of a model S (fk ; θ1 , . . . , θH )\nsince the condition Λ̃ → 0 when {θ1 , . . . , θH } → {θ1true , . . . , θHtrue } is always satisfied.\nB.\n\nKolmogorov-Smirnov Parameter estimation\n\nAs discussed in section II A, the KS estimator can be used as an alternative to a maximum likelihood procedure\nfor parameter estimation.\nThanks to the statistical properties of RWOSA (fk ; θ), the closer θ is to θtrue , the better the distribution of\nRWOSA (fk ; θ) is described by equation (A8) with δ = 1/Ns and h = Ns . Therefore, the Kolmogorov-Smirnov\ndistance parameter provides an effective goodness-of-fit estimator:\ndK (θ) = max |FR (x; θ) − P (Ns , xNs )| .\n\n(13)\n\nFR (α) is the ECDF for the current RWOSA (fk ; θ) estimate, P (Ns , xNs ) is the limiting distribution for θ → θtrue .\nKS estimation for θ is obtained by the minimization of dK (θ) with respect to θ. A confidence range for the\nparameter estimation can be readily defined from the non-rejection region of the KS-test at a given significance level.\nIn practice, having defined a significance level, the corresponding critical values of the KS statistic, dK (α), can be\ncalculated with \u0001standard equations [16] or Monte Carlo simulations in the case of correlated data. The values of θ̄\nfor which dK θ̄ = dK (α) provide the boundary for the confidence range at the given significance. The KS statistic\ncan also be successfully applied to multi-parameter identification, since the convergence of FR (α) to P (Ns , xNs ) is\nalways verified when {θ1 , . . . , θH } → {θ1true , . . . , θHtrue }.\nIV.\n\nANALYSIS OF NON-STATIONARY NOISE\n\nThe implementation of noise analysis procedures was so far discussed in the context of stationary or pseudostationary noise [33]. In the case of truly non-stationary noise the spectral content of a time series is investigated\nby time-frequency analysis techniques which include the spectrogram and the wavelet transform. The spectrogram is\nestimated by the square modulus of the short-time Fourier transform of the data [20]. It provides a direct extension\nof the PSD formalism to non-stationary time series. Given a data series of N samples, a fraction of length Q < N is\nwindowed and the Fourier transform is applied. Then the data window is time shifted and the process is repeated. The\ncalculation of the spectrogram is based on data windowing and the application of the Fourier transform, therefore the\nconsiderations noted in the previous sections for stationary noise can be applied directly to the spectrogram analysis\nof non-stationary noise.\nSince the short-time Fourier transform has the same resolution across the time-frequency plane, it is often preferable\nto resort to the wavelet transform. Wavelet transform is a decomposition of the time series over time-frequency\nelements that are obtained by scaling and translating a mother function ψ ∈ L2 (R):\n1\nψu,s = √ ψ\ns\n\n\u0012\n\nt−u\ns\n\n\u0013\n.\n\n(14)\n\nThe function ψ (t) has zero average and the wavelet elements ψu,s are normalized to 1. The wavelet transform of a\nfunction f (t) is then defined as:\nZ\nW f (u, s) =\n\n∞\n\n1\nf (t) √ ψ ∗\ns\n−∞\n\n\u0012\n\nt−u\ns\n\n\u0013\ndt.\n\n(15)\n\nIn the discrete case, the result of the wavelet transform on a time series is an array of coefficients wu,s where u is\nthe time index and s is the scale index which is associated to a given frequency band [21]. In the case of uncorrelated\nGaussian noise, the distribution of the coefficients wu,s is still Gaussian with a certain amount of correlation introduced\nby the convolution-like transform operation [21]. In such a favorable situation the extension of the method described in\nthe stationary case it appears straightforward. In particular Kolmogorov-Smirnov procedures are excellent candidates\nsince their robustness to correlation and the possibility of extending KS distance definition to a two-dimensional space\n[22, 23].\n\n\f8\n\nS1/2 [m s-2 Hz-1/2]\n\n10\n\n10\n\n10\n\n10\n\n10\n\n-11\n\nReadout\nTMs\nTMs + Rreadout\nLPF Spec.\nLPF worst case\n\n-12\n\n-13\n\n-14\n\n-15\n\n10\n\n-4\n\n-3\n\n-2\n\n10\n10\nFrequency [Hz]\n\n10\n\n-1\n\nFIG. 4: Projection of the spectrum of aeff . 'Readout' is the projection of the readout noise to aeff . 'TMs' is the\nprojection of the force noise on the test masses to aeff . 'TMs + Readout' is the complete noise projection for aeff , it\nrepresents the baseline noise level assumed in the present paper. 'LPF worst case' refers to a worst case scenario for\naeff and 'LPF Spec.' corresponds to the mission specifications.\n\nV.\n\nAPPLICATION TO LPF SYNTHETIC DATA\n\nIn this section the different procedures for excess noise detection and parameter estimation are applied to synthetic\nLPF data. This provides not only an interesting framework for testing their accuracy and precision, but it also helps\nclarifying the role of correlations among spectral data.\n\nA.\n\nSynthetic data and noise projection\n\nLPF provides two output channels along the principal measurement axis which are sensing the displacement of the\nSC relative to the free falling TM and the relative displacement between the TMs.\nFrom the knowledge of the displacement signals and a linear model for the system dynamics, an effective force-perunit-mass, aeff , acting on the TMs can be extracted. aeff is the combination of the 'true' force-per-unit-mass acting\non TMs and a projected interferometer readout noise. Details of the calculation are reported in appendix D.\nFollowing the same scheme, a given prediction for the different input noise sources can be projected to a prediction\nfor the power spectrum of aeff , as reported in figure 4. Here the model for the spectrum of force noise acting on TMs\nand the model for the spectrum of readout noise are projected into a model for the power spectrum of aeff (TMs +\nReadout in the figure notation), which represents this paper's baseline for the spectrum of aeff .\nIn figure 4 we also report the project specifications for LPF and the expected noise spectrum for aeff in a worst\ncase scenario. In our baseline we assumed a reduced force noise on the TMs compared to the worst case but choose\nto keep the worst case for the readout noise. This was done in order to represent one of the possible scenarios (not\nthe best one) that can be experienced during the mission.\nThe model assumed for the force noise on the TMs is characterized by a low frequency 1/f 2 behavior and a flat part\n0\nfor f > 1 mHz. The model can be written as STM (f ) = θSTM\n(f ). θ is an adjustable parameter which assumes values\nθ = 1 for the worst case scenario and θ = 0.1 for our baseline model. It is worth noting that STM (f ) is projected\n(together with the readout noise model) through LPF dynamics in order to obtain the expected noise spectrum for\naeff which we indicate with Sa (f ). Sa (f ) with θ = 0.1 corresponds to 'TMs + Readout' in figure 4, Sa (f ) with θ = 1\ncorresponds, instead, to the 'LPF worst case'.\n\nB.\n\nExcess noise detection\n\nA change of the noise level on STM (f ) (θ 6= 0.1) produces a variation of the energy content of aeff . Such variation,\nwhich may be 'improperly' identified as excess noise, can be detected with the procedures defined in section II. In\n\n\f9\nparticular we tested the detection of excess noise between two data series and between a data series and a reference\nmodel. Synthetic data were produced according to the following procedure:\n1. Different models for Sa (f ) are produced changing θ around the reference value θ = 0.1. Readout noise level is\nkept fixed.\n2. Corresponding noise time series for aeff are generated using the procedure reported in [24]. The time series are\n24 h long and have a sampling frequency of 1 Hz.\n3. Sample spectra are calculated for each series with the WOSA algorithm. We chose a Blackman-Harris data\nwindow, 50% segment overlap and number of segments averages Ns = 4.\n4. The analysis is restricted to the frequency interval [0.1, 10] mHz since, as can be seen from figure 4, it represents\nthe region in which the force noise on the TMs dominates Sa (f ).\nSpectral data are tested for excess noise. We used the KS algorithm (equation (6)) in the case of the test of two\ndata series. The data series for θ 6= 0.1 are compared against the reference series with θ = 0.1. In the case of the test\nof a data series against a model, both the KS algorithm (equation (3)) and the IR algorithm (equation (1)) are used.\nThe reference model is the projected Sa (f ) for θ = 0.1. The results of the tests are summarized in table I. KS critical\nvalues dK (α) and IR confidence intervals are calculated for a significance level α = 0.05 which corresponds to a 95%\nconfidence.\nEach value of θ corresponds to a value of the in-band energy content E (θ) of Sa (f ) in the analyzed frequency band.\nWe report in table I the relative change in energy ∆E/E corresponding to a relative change in θ. The quantity ∆E/E\nplays the same role of the parameter γ in figures 1 and 3, even though the two quantities are not completely comparable\nsince γ in figure 1 assumes independence of the data. Spectral data are correlated among different frequency values\nbecause of two effects [9, 25]: i) Data windowing which corresponds to a convolution in the frequency domain of the\nwindow function with the sample spectrum; ii) WOSA overlapped segment averaging. The first effect is unavoidable,\nthe second effect, instead, can be attenuated by a proper choice of the segment overlap. It can be demonstrated [34]\nthat for a Blackmann-Harris window the effect is negligible with 50% overlap.\n√\nTABLE I: Detection of noise differences in the frequency band [0.1, 10] mHz. The symbol\nindicates compatibility\nbetween tested objects. The symbol × is instead used for indicating test rejection. θ is an adjustable parameter\nwhich assumes value θ = 0.1 for our baseline model. Different values of θ correspond to different values of the\nin-band energy content E (θ) of Sa (f ). We reported here relative values with respect to reference. Details on\nMC\ndeff\nK (α), dK (α) and MC confidence interval for IR estimator can be found in appendix B and C respectively.\nKS vs. data\n∆E\nE\n\nKS vs. model\n\ndK (α)\n\ndMC\nK (α)\n\nIR\n\ndK (α)\n\ndeff\nK (α)\n\ndMC\nK (α)\n\n∆θ\nθ\n\ndK\n\n0.1030\n\n0.1006\n\ndK\n\n0.0730\n\n0.0982\n\n0.0969\n\nP\n\nk RWOSA (fk )\n\nConf. Int.\n\nMC Conf. Int.\n\n[323.14, 359.33]\n\n[311.33, 372.55]\n\n−0.14\n\n−0.7\n\n0.2352\n\n×\n\n×\n\n0.2547\n\n×\n\n×\n\n×\n\n250.74\n\n×\n\n×\n\n−0.08\n\n−0.4\n\n0.1424\n\n×\n\n×\n\n0.1103\n\n×\n\n×\n\n×\n\n303.72\n\n×\n\n×\n\n−0.06\n\n−0.3\n\n0.1806\n\n×\n\n×\n\n0.1747\n\n×\n\n×\n\n×\n\n274.54\n\n×\n\n×\n\n−0.05\n\n−0.25\n\n0.1740\n\n×\n√\n\n×\n√\n\n×\n\n0.0887\n\n×\n√\n\n294.42\n\n−0.2\n\n×\n√\n\n0.1685\n\n−0.04\n\n×\n√\n\n−0.03\n\n−0.15\n\n0.0906\n\n√\n\n√\n\n√\n\n√\n\n×\n√\n\n×\n√\n\n√\n\n317.10\n\n√\n\n−0.01\n\n−0.05\n\n0.0771\n\n√\n\n√\n\n√\n\n√\n\n√\n\n√\n\n√\n\n0.01\n\n0.05\n\n0.0551\n\n√\n\n√\n\n√\n\n√\n\n√\n\n√\n\n√\n\n0.03\n\n0.15\n\n0.0629\n\n√\n\n√\n\n√\n\n√\n\n√\n\n√\n\n√\n\n0.04\n\n0.2\n\n0.0603\n\n√\n\n√\n\n√\n\n√\n\n√\n\n√\n\n√\n\n0.05\n\n0.25\n\n0.0519\n\n√\n\n√\n\n√\n\n√\n\n√\n\n√\n\n0.0696\n0.0433\n0.0302\n0.0539\n0.0370\n0.0635\n0.0818\n\n×\n\n324.87\n339.47\n352.26\n345.38\n357.14\n369.05\n\n×\n\n√\n\n0.06\n\n0.3\n\n0.0857\n\n0.1253\n\n×\n\n×\n\n×\n\n388.01\n\n×\n\n×\n\n0.08\n\n0.4\n\n0.1103\n\n×\n\n×\n\n0.1137\n\n×\n\n×\n\n×\n\n402.14\n\n×\n\n×\n\n0.14\n\n0.7\n\n0.1520\n\n×\n\n×\n\n0.2423\n\n×\n\n×\n\n×\n\n459.64\n\n×\n\n×\n\nSince the standard statistics for the estimators (dK (α) for KS and confidence interval for IR) are calculated in\nsection II with the assumption of data independence, the standard critical values, dK (α), for the KS estimators and\nthe confidence intervals for the IR estimator can be applied only if the correlations among data are negligible. If this\nis not the case, the effective statistic of the estimators can be numerically calculated with Monte Carlo simulations.\nThe corresponding results of a Monte Carlo simulation with NMC = 5000 realizations of the reference data series are\n\n\f10\n√\nindicated in table I with the suffix MC. The symbol is used to indicate that the spectral data for the corresponding\n∆E/E is compatible with the reference. On the contrary the symbol × indicates a rejection.\nObserving the test results reported in columns 7 and 9 for the KS algorithm and the results in columns 11 and\n12 for the IR algorithm it is readily seen that correlations among data play a role. In the case of the KS test, the\ncomparison of the data with dK (α) determines a rejection for ∆E/E = 0.05. On the other hand, the same value is\naccepted when Monte Carlo result dMC\nK (α) is used. In the case of the IR estimator, the comparison with the standard\nconfidence interval leads to the rejection in correspondence with ∆E/E = 0.05 and ∆E/E = −0.04. Such values are\ninstead considered compatible by the Monte Carlo confidence interval. These results provide us with clear information\nthat the presence of correlations among data has affected the tests statistics and therefore the standard equations,\nassuming independence among data, are not usable in this situation.\nLooking at the results for the KS test between two data series, we discover that dK (α) and dMC\nK (α) are practically\nequal. In fact the results for the two corresponding columns of table I (columns 4 and 5) are in perfect agreement.\nThis is the practical result of one of the most interesting properties of the KS test. The test is based on equation (6).\nIt states that the two empirical cumulative distributions under test have the same limiting CDF. Since the sample\nspectra in our test are calculated following the same WOSA procedure, the degree of correlation among different\nfrequency points is the same, therefore the test statistic is not spoiled.\nComparing dK (α) and dMC\nK (α) of columns 7 and 9 we see that the effect of correlation is to increase the maximum\nexpected spread between ECDF and limiting CDF. Therefore the effect of data correlation is to distort the expected\nstatistic for dK . The 'distortion' of dK statistic can be taken into account if an effective value for the parameter K is\nintroduced. In the case of the comparison of the ECDF for correlated data against a theoretical CDF the application of\nthe standard values for dK , where K = Nf , Nf being the number of data elements, leads to a statistically unfair test.\nWe then discovered that test fairness can be recovered if an effective value for K is used rather than the standard\nK = Nf . In particular, for spectral data produced with the WOSA method, Blackmann-Harris window, Ns = 4\naverages on 50% overlapped segments, we obtained Keff = βNf with β = 0.55 for a significance level α = 0.05. It is\nworth noting that the value of β is independent from the number of data points considered, and from the spectral\nshape, provided that the different shapes have reasonably comparable smoothness on a frequency interval comparable\nwith the width of the first lobe of the data window. As an example, the value of β = 0.55 is valid for LPF-like data\nand for white-noise equivalently. The requirement on the smoothness of the spectrum is connected to the expression\nof the correlations introduced by data windowing. It can be demonstrated that if the spectrum can be assumed\nconstant in a frequency range of the order of the width of the first lobe of data window [9] then the correlations are\nindependent from the particular shape of the spectrum and are determined only by the window function. For such\nclass of spectra we expect the same value for β once the required significance level is fixed.\n\nC.\n\nNoise model identification\n\nThe problem of noise parameter identification is strictly connected to the problem of excess noise detection by a\ncomparison of a data series with a reference model. While in excess noise detection different data series are compared\nwith a given reference, in parameter estimation different realizations of a parametric model are compared with a\ndataset in order to find the best fit. Due to this, the same algorithms (i.e. KS and IR) can be applied to the solution\nof the two problems. Precision and accuracy in the estimation of the parameter, θ, controlling the excess force noise\non the TMs is tested with a Monte Carlo simulation over NMC = 5 × 103 realizations of the same process. The data\nseries reproduce aeff corresponding to the reference value θ = 0.1. Sample spectra are calculated with the procedure\ndescribed above and the analysis is restricted to the frequency range [0.1, 10] mHz. For each realization, data are\n0\ncompared with a bank of models obtained by the projection of TMs force noise STM (f ; θ) = θSTM\n(f ) and readout\nnoise into Sa (f ; θ) for different values of θ around the reference value. The KS and IR estimators are calculated\n ̃ = |IR − Nf |.\nfor each element of the model bank, in particular it is simpler to analyze the results in terms of IR\n ̃\nBoth KS and IR are expected to have a minimum corresponding to the best estimate for the parameter θ. The\ntwo methods proposed here are compared with the performance\nof a classical weighted least-squares method, which\nP\n2\nworks by minimizing the mean squared error MSE =\nfk ((PW OSA (fk ) − Sa (fk ; θ)) /Sa (fk ; θ)) , and a Huber's\nnorm estimator (details are reported in appendix E). The results of the analysis are reported in figure 5, where the\nhistograms of the best fit vales over NMC realizations are reported for the four procedures. In the same figure we also\nshow the evolution along the model grid of the four estimators for a particular set of data from the available NMC .\nThe distributions for the best fit parameter are reasonably symmetric for all the estimators; mean values and\nsample standard deviations are respectively θKS = 0.100, σKS = 0.012, θIR = 0.100, σIR = 0.012, θM SE = 0.148,\nσM SE = 0.016, θHuber = 0.130 and σHuber = 0.014. From the analysis of the Monte Carlo results, it is readily seen\n ̃ estimators provide equivalently precise and accurate results. On the other hand, the\nthat both the KS and the IR\nMSE algorithm provides a poor estimation, both from the accuracy and from the precision point of view. The best\n\n\f11\n\nFIG. 5: KS, IR, MSE and Huber's norm accuracy and precision in the estimation of the force-per-unit-of-mass noise\nparameter θ. Corresponding histograms report the result of NMC = 5000 MC realizations of the parameter search on\na grid of template models. We also show (black dots) the evolution along the model grid of the four estimators for a\nparticular set of data taken from the NMC available.\n\nestimation for the parameter is θM SE = 0.148, which is strongly biased with respect to the reference value of θ = 0.1.\n ̃ estimators. Huber's\nAlso, the distribution of the parameter values is wider than those obtained from the KS and IR\nnorm estimator, with the chosen parameter c = 0.05 E, performs better than MSE but the result θHuber = 0.130 is\nstill far from the true value.\nIt is worth discussing the effect of correlations among spectral data on the estimation of the parameter θ. As can\nbe observed from the results of the MC simulation, the accuracy of the estimators is not affected by correlations;\n ̃ estimators are practically indistinguishable. Some problems with IR\n ̃ can arise from data\nthe results for KS and IR\ncorrelations when the confidence interval for a single estimation is required. As discussed in the previous paragraph,\ncorrelations modify the statistic of the IR estimator making it impossible to easily calculate confidence intervals from\nthe standard equations. The statistic of the KS estimator is affected by correlations too, but we have demonstrated\nthat accurate critical values dK (α) can be recovered if an effective value for K is used, Keff = βNf . β is a shape\nparameter depending only on the correlations in the spectral data and on the required significance level. It can be\ncalculated for a specific spectrum (e.g., white noise) and effectively extended to a wide family of spectral shapes.\nUsing the value β = 0.65 reported in appendix B, we obtain deff\nK (α) ≈ 0.064 for α = 1 − 0.68%. The intersection of\nsuch a value with the curve of dK as a function of θ reported as black dots in figure 5A provides a 68% confidence\ninterval for the single estimation. In this specific case such an interval is θ ∈ [0.086, 0.114].\n\nVI.\n\nCONCLUSIONS\n\nThe problem of excess noise detection and noise parameter estimation for non-Gaussian data is analyzed in the\nframework of the LISA Pathfinder mission. Excess noise detection can be approached in two ways. In one way,\nthe noise content of a data series is compared with a reference data series, in the other way the noise content of\n\n\f12\nthe data is compared with a reference model. In the first case, simple estimators like the total energy content in a\ndata series are not suitable for formulating quantitative statements on a solid statistical basis. As an alternative a\nKolmogorov-Smirnov (KS) estimator is proposed and successfully applied to LPF synthetic data. The KS estimator\nhas the advantage of being independent of the statistical properties of the data under test. It is demonstrated in\nthe paper that such a convenient property makes the estimator robust to correlations among spectral data. Two\ndifferent estimators are investigated for the problem of comparing a data series to a model for excess noise detection.\nOne estimator (IR) is based on the integral of the normalized WOSA spectrum, the other is a KS estimator for the\ncomparison of an empirical cumulative distribution function with a limiting theoretical function. Despite the fact\nthat IR estimator proves to have better sensitivity on independent data, the versatility of the KS estimator is highly\nadvantageous on correlated data. Since the statistics of the estimators are distorted by the presence of correlations\namong test data, the standard and simple procedures for the determination of the confidence intervals, based on the\ninversion of the limiting distribution function, provide inaccurate results. While, in the case of the IR estimator, the\nproblem can be overcome only with dedicated Monte Carlo simulations, we demonstrated that the introduction of\na shape parameter allows us to use standard equations to calculate proper boundaries for KS confidence intervals.\nThe shape parameter depends on the required significance level and on the data correlations. It does not depend\non the number of data considered for the test. Since correlations among spectral data are mainly introduced by the\nwindowing process, the shape parameter is fixed for a wide family of spectral shapes. For example, synthetic LPF\ndata share the same shape parameter with white noise.\nClosely related to noise excess detection, the problem of noise parameter identification is analyzed with a maximum\nlikelihood approach which, in the particular case of linear dependence on a single parameter, provides an algorithm\nanalogous to the IR estimator used for excess noise detection. A KS algorithm was proposed as an alternative to the\nIR algorithm and the accuracy and precision of both were tested with a Monte Carlo simulation on LPF synthetic\ndata. Both the IR and KS estimators were demonstrated to give equivalently good results, even though the capability\nof the KS to handle data correlation is a clear advantage for the definition of a confidence interval for the estimated\nnoise parameter.\nData analysis procedures introduced in this paper are easily extended to the vast context of time-frequency analysis\nof non-stationary noise. KS algorithm can be applied effectively both to spectrogram and wavelets coefficients provided\nthat correlations among data are taken into account. KS algorithm has the advantage that can be generalized to two\ndimensions thus allowing to extend the analysis to the time-frequency plane.\n\nAppendix A: Statistic of the sample spectrum\n\nIn the case of a discrete, real-valued stationary process {xh }, the continuous spectral density function is defined as:\nS (f ) = T\n\n∞\nX\n\nsh e−ı2πf hT .\n\n(A1)\n\nh=−∞\n\nHere sh is the autocovariance sequence of the process {xh }, T is the sampling period and f is the frequency expressed\nin Hz. f is defined in the range |f | ≤ fN q ≡ 1/2T and fN q is known as the Nyquist frequency. In the case of a\nfinite representation x0 , . . . , xN −1 of the discrete process {xh }, the approximation to the spectral density function is\nprovided by the sample spectrum\nN −1\nT X\nP̃ (f ) =\nxh e−ı2πf hT\nN\n\n2\n\n.\n\n(A2)\n\nh=0\n\nf in this case is also defined on the interval [−fN q , fN q ]. If the sample spectrum is calculated on the grid of Fourier\nfrequencies (fk = k/ (N T ), |k| ≤ N/2) then it corresponds to the squared modulus of the discrete Fourier transform\nof the data sequence x0 , . . . , xN −1 . In practical applications only the positive frequency part of the spectrum is\nconsidered, and the one sided sample spectrum is defined as P (fk ) = 2P̃ (fk ) with k = 0, 1, . . . , N/2. In the rest of\nthe paper the one sided sample spectrum will be simply named the sample spectrum.\nIf the data series x0 , . . . , xN −1 is Gaussian distributed and the elements xj are independent then the Fourier transform produces a complex series X (fk ) whose elements are approximately independent and their real and imaginary\n2\n2\n2\nparts are Gaussian distributed. The term |X (fk )| = |< [X (fk )]| + |= [X (fk )]| is then the sum of two independent\n2\nvariables distributed as a χν where ν is the number of degrees-of-freedom of the distribution (ν = 1 in this case). If\nthe correlations among the elements of the data series x0 , . . . , xN −1 are non-vanishing, the statistical properties of\n\n\f13\nthe sample spectrum, in the simplifying assumption of independent P (fk ) elements, can be calculated from the case\nof a χ2ν distributed variable y multiplied by a constant z = λy. The characteristic function for z is\n\u0002\n\u0003\n−ν\nφz (t) = E eıtλy = (1 − 2ıtλ) 2 .\n\n(A3)\n\nHere E [] indicates the expected value. The inverse Fourier transform of φz (t) provides the probability density function\nfor z:\ne− 2λ z ( 2 −1)\n\u0001.\nν\n(2λ) 2 Γ ν2\nz\n\nF −1 [φz (t)] =\n\nν\n\n(A4)\n\nThis is a gamma distribution, f (z; k, θ), with k = ν/2 and θ = 2λ. Γ (k) is the gamma function. In the case of the\nsample spectrum at a given frequency, z = P (fk ) and λ = E [P (fk )] /ν ≈ S (f ) /ν [35]. It is useful, for the statistical\nanalysis of the spectrum, to introduce the normalized sample spectrum\nR (fk ) = ν\n\nP (fk )\n,\nS (f )\n\n(A5)\n\nwhich, at each frequency fk , is distributed as χ2ν .\nThe sample spectrum in equation (A2) can also be seen as a special case of the power spectral density, S (f ), when\nthe infinite data series {xh } is chopped by a square data window of length N . This operation introduces a considerable\namount of spectral leakage because of the convolution with the frequency response of the square data window [9, 26].\nTherefore it is common practice to multiply the time series x0 , . . . , xN −1 with a more performant data window, which\nincreases the accuracy of the sample spectrum in the case of processes with a high dynamic range. The application of\na data window introduces correlations among different elements of the sample spectrum. Such correlations affect the\nstatistics of the spectrum, resulting in a change in the probability distribution of the sample spectrum. An analytical\ntreatment of the spectrum statistics under such conditions is cumbersome, and it is easier to numerically evaluate\n(with a Monte Carlo simulation) the statistics of the sample spectrum for the case of interest.\nIn order to improve the variance properties of the sample spectrum, Welch's overlapped segment averaging (WOSA)\nmethod is applied [9]. The data series x0 , . . . , xN −1 is divided in overlapping windowed segments. The estimates of the\nsample spectrum of each segment are then averaged. The practice of averaging overlapping segments can modify the\nexpected statistics of the spectrum since the data in different segments can be correlated. Then, even in the simplifying\nassumption of vanishing spectral correlations from windowing and overlapping, the averaging process changes the\nstatistics of the estimated sample spectrum. In the assumption of vanishing window and overlap correlations, the\nstatistic of the WOSA spectrum corresponds to the average of Ns gamma distributed variables\nPWOSA (fk ) =\nThe critical function for the sum is φPWOSA (t) =\nto equation (A3)\n\nQ\n\nj\n\nNs\n1 X\nPj (fk ).\nNs j=1\n\n(A6)\n\nφj (t), where φj (t) is the critical function for Pj /Ns . Thanks\n\n\u0013−kNs\n\u0012\nıtθ\n,\nφPWOSA (t) = 1 −\nNs\n\n(A7)\n\nwhere θ = 2S (fk ) /ν and k = ν/2. The inverse Fourier transform of φPWOSA (t) provides the probability density\nfunction for the WOSA spectrum\nz\n\nfWOSA (z; h, δ) =\n\nz (h−1) e− δ\n,\nδ h Γ (h)\n\n(A8)\n\nwith δ = S (fk ) /Ns and h = Ns . Again it is useful to define a normalized WOSA spectrum as\nRWOSA (fk ) =\n\nPWOSA (fk )\n,\nS (fk )\n\nwhich is gamma distributed (equation (A8)) with δ = 1/Ns and h = Ns .\n\n(A9)\n\n\f14\nAppendix B: Kolmogorov - Smirnov Test\n\nKolmogorov - Smirnov is a well known test for distributions [13–16, 27, 28]. An empirical cumulative distribution\n(ECDF) is tested against a continuous theoretical model or, alternatively, two ECDFs are tested with the hypothesis\nthat they share the same limiting cumulative distribution function. Indicating with f (x) the probability density\nfunction associated with a given random process X, the corresponding cumulative distribution function (CDF) is\ndefined as:\nZ x\nf (u) du.\n(B1)\nF (x) = P rob [X ≤ x] =\n−∞\n\nGiven a particular realization of the random process X:\nXN = {x1 , . . . , xN } ,\n\n(B2)\n\nECDF is written as FN (x) = k/N where k is the number of observations which is smaller or equal to x.\nGiven two data series XN and YM , with N and M not necessarily equal, we can test if the two series are two\nparticular realizations of the same random variable by analysis of their ECDFs. Under the hypothesis that the two data\nseries comes from the same distribution function, Kolmogorov has demonstrated that the maximum distance between\nthe two ECDFs has a limiting distribution which is independent from the statistical properties of the corresponding\nrandom variable. If the test is performed against a theoretical distribution, the distance is defined as:\ndK = max |FN (x) − F (x)| .\n\n(B3)\n\nIn such a case K = N . In alternative, If the test is performed between two ECDFs, K = (N M ) / (N + M ) and:\ndK = max |FN (x) − FM (x)| .\n\n(B4)\n\nThe test is defined as follows:\n1. In the case of the test on a single data series, the null hypothesis is that the data are realizations of a random\nvariable which is distributed according to the given probability distribution. In the case of two data series,\nthe null hypothesis is that the two data series are realizations of the same random variable, which means their\nECDFs should tend to the same CDF. The test rejects or accepts the null hypothesis on the basis of the analysis\nof dnm .\n2. A significance level α is defined as the probability that the test rejects the null hypothesis when it is indeed\ntrue.\n3. The test can be formulated in terms of critical values. The critical value for the test is the value of dK (α)\ncorresponding to the significance level. Then if dK > dK (α), the null hypothesis is rejected.\nKS theory was formulated for independent data sets and the available equations for critical values are valid only if\nthis condition is satisfied [16]. The test can be formulated also in the presence of data correlation but the distortion\nto dK statistic introduced should be taken into account. This is possible if an effective value for K is introduced\nas Keff = βK, with β a shape parameter depending only on the data correlations and the required significance\nlevel. Alternatively, realistic critical values can be calculated with dedicated Monte Carlo (MC) simulations [29].\nThe advantage of the shape parameter β is that it depends only on correlations and the required significance level.\nTherefore it can be determined for a specific spectrum (e.g., white noise) and shared among a wide family of spectral\nshapes. Once β is known it can be used to calculate critical values for correlated data using standard equations\nreported in the literature [16].\nFocusing on the particular problem, we performed a Monte Carlo estimation of dK (α) for WOSA spectra representative of LPF. The number of frequency data considered is Nf = 341, corresponding K values are K = Nf in the\ncase of the test against a theoretical distribution and K = Nf /2 in the case of the test between two ECDFs. The\nresults are summarized in table II. In the same table we report the values of β that are required to obtain proper\ncritical values from the standard equations in the case of the test against a theoretical distribution.\n\n\f15\n\nTABLE II: Table of KS critical values for correlated spectral data. Critical values are calculated with a Monte Carlo\nsimulation for different values of the significance level α. Datasets used are representative of the data analyzed in\nthe current paper. We reported the values for testing an ECDF against a theoretical CDF (K = Nf ) and the values\nfor testing two ECDFs for the same limiting CDF (K = Nf /2). We also reported the values of the shape parameter\nbeta that can be used to calculate proper critical values from standard equations in the case of correlated data. α\nrefers to the significance level whereas 1 − α is the corresponding confidence level for the test. Nf = 341.\nα\n\n1−α\n\nK = Nf\n\nβ\n\nK = Nf /2\n\n0.32\n\n0.68\n\n0.0643\n\n0.65\n\n0.0723\n\n0.10\n\n0.90\n\n0.0863\n\n0.58\n\n0.0910\n\n0.05\n\n0.95\n\n0.0969\n\n0.55\n\n0.1006\n\n0.01\n\n0.99\n\n0.1214\n\n0.52\n\n0.1191\n\nAppendix C: IR Test\n\nThe statistics of the IR excess noise estimator are numerically estimated with a Monte Carlo simulation on the\nspectral data used for the present paper. Data series are 24 h long synthetic reconstructions of the force-per-unit-mass\nexpected on the TMs. WOSA spectra are calculated with Ns = 4 averages on 50% overlapped segments which were\nwindowed with the Blackman-Harris window. Results are reported in table III.\nTABLE III: Table of confidence bounds for the IR estimator on correlated spectral data. The values are calculated\nwith a Monte Carlo simulation for different values of the significance level α. Data sets used are representative of\nthe data analyzed in the current paper. The number of frequency points is Nf = 341, corresponding to the number\nof available spectral data in the range [0.1, 10] mHz, for a time series 24 h long and number of averages for the\nWOSA estimator Ns = 4.\nα\n\n1−α\n\nxlw\n\n0.32\n\n0.68\n\n325.88\n\n357.41\n\n0.10\n\n0.90\n\n316.33\n\n367.28\n\n0.05\n\n0.95\n\n311.33\n\n372.55\n\n0.01\n\n0.99\n\n300.48\n\n380.69\n\nxup\n\nAppendix D: Conversion of displacement noise\n\nLPF can be considered as a three body controlled system composed of the two TMs and the spacecraft (SC). Its\nequations of motion along the measurement axis can be written as:\nm1 x ̈1 + m1 x ̈sc + m1 ω12 x1 = f1\nm2 x ̈2 + m2 x ̈sc + m2 ω22 x2 = f2 + fc2\nmsc x ̈sc −\n\nm1 ω12 x1\n\n−\n\nm2 ω22 x2\n\n(D1)\n\n= fsc − fc2 + fcsc .\n\nHere:\n• x1 and x2 are TMs coordinates along the sensitive axis. They are relative coordinates in the SC reference frame.\n• xsc is the absolute SC coordinate along the sensitive axis.\n• m1 , m2 and msc are the masses of the two TMs and of the SC.\n• ω12 and ω22 are the parasitic stiffnesses coupling the TMs and the SC. The TMs are coupled to the spacecraft\nthrough the parasitic stiffness thus producing an oscillator like equation of motion. The spacecraft at the same\ntime experiences reaction forces given by −m1 ω12 x1 and −m2 ω22 x2 .\n• f1 , f2 and fsc are the forces acting on TMs and SC respectively.\n\n\f16\n• fc2 and fcsc are control forces on the second TM and the SC respectively. Since fc2 is an internal force to the\nsystem the SC experiences a reaction force −fc2 .\n• Dots over symbols represent time derivatives.\nIn the main LPF science operation mode, one TM (indicated here as TM1 ) is in free-fall and provides the reference\nfor the other TM (TM2 ) and the SC. In order to avoid unwanted drifting, both TM2 and the SC are controlled to\nfollow TM1 . It is worth noting that the system is, by construction, symmetric and the role of the two TMs can be\ninverted. In order to avoid confusion, we indicate with TM1 the free-fall reference and with TM2 the actuated TM.\nMoving to the Laplace domain, substituting for the SC dynamics and substituting for the differential coordinate\nx∆ of TM2 with respect to TM1 , the equation (D1) can be rewritten as:\n\u0012\n\u0013\nm1\nm2\nm2\n2\n2\ns x1 ω1 1 +\nx1 + ω22\nx1 + ω22\nx∆ =\nmsc\nmsc\nmsc\nf1\nfsc\n1\n1\n=\n−\n+\nH2 o ∆ −\nHsc o1\nm1\nmsc\nmsc\nmsc\n(D2)\n\u0001\n2\n2\n2\n2\ns x∆ + ω2 − ω1 x1 + ω2 x∆ =\nf1\n1\nf2\n−\n+\nH2 o∆ .\n=\nm2\nm1\nm2\nHere:\n• o1 and o∆ are output displacement signals as provided by the interferometer readout system. o1 is the displacement between the SC and the TM1 . o∆ is the displacement of TM2 relative to TM1 .\n• H2 and Hsc are transfer functions of the control systems on TM2 and SC. The force applied by the controllers\nis calculated on the basis of the output displacement, therefore fc2 = H2 o∆ and fcsc = Hsc o1 .\nCalculations can be more easily performed if we introduce a matrix notation:\n!\nx1\nx=\nx∆\n!\n\no1\no∆\n\no=\n\n(D3)\n\n(D4)\n\n\n\n\nf1\n\n\nf =  f2 \nfsc\n\nD=\n\nm1 2\nω1 +\ns2 + ω12 + m\nsc\n2\nω2 − ω12\n\nG=\n\n1\nm1\n− m11\n\nC=\n\nH=\n\n0\n1\nm2\n\n− m1sc\n0\n\n(D5)\n\nm2 2\nmsc ω2\n\n− m1sc\n0\n1\nmSC\n1\nm2\n\nHsc 0\n0 H2\n\nm2 2\nmsc ω2\n2\ns + ω22\n\n!\n(D6)\n\n!\n(D7)\n\n!\n(D8)\n\n!\n(D9)\n\n\f17\nWith the notation introduced, the equation of motion can be rewritten:\nD * x = G * f + C * H * o.\n\n(D10)\n\nThen we should consider that the output displacement o corresponds to the measurement of x provided by the\nsensing system:\no = S * x + orn .\n\n(D11)\n\nHere S is a 2 × 2 sensing matrix and orn is the readout noise.\nSubstituting equation (D11) in equation (D10), the dynamics can be rewritten in terms of the known output o:\nD * S−1 * o − C * H * o = G * f + D * S−1 * orn .\n\n(D12)\n\nThe quantity G * f represents the force-per-unit-mass acting on the test masses. Such a quantity is not directly\nknown from the system output since the available signal is o. From equation (D12) it is readily seen that an effective\nforce-per-unit-mass acting on the TMs can be reconstructed from the knowledge of o if the force applied by the control\nsystem (C * H * o) is calculated and subtracted from the reconstructed dynamics D * S−1 * o. Therefore the available\nquantity is g = G * f + D * S−1 * orn which contains the force-per-unit-mass acting on the TMs corrupted by the\nreadout noise of the system.\nThe expected values for g can be obtained thanks to the dynamics reported in equation (D12) once the expected\nvalues for f and orn are known. The same applies to the projection of the noise spectra for f and orn to g.\nAppendix E: Huber's norm\n\nHuber's norm [30] is a way to construct a goodness of fit estimator which is more robust\nto outliers and nonP\nGausianity than the standard mean squared error (MSE). The norm is constructed as i ρ(ri ), where ri are the\nresiduals between a data series and a parametric model. The function ρ(ri ) s defined as:\n(\nρ(ri ) =\n\n1 2\n2 ri\n\nc|ri | − 12 c2\n\nfor |ri | < c\nfor |ri | > c.\n\n(E1)\n\nThe value of the threshold constant c may depend on the given dataset, therefore some efforts must be\nspent to select the value of c providing the most accurate results. Normalized residuals are defined as ri =\n(PW OSA (fi ) − Sa (fi ; θ)) /Sa (fi ; θ) in accordance to the MSE definition in section V C. With such a definition, residuals are expected to be zero mean and unitary variance in correspondence of the 'true' model Sa (fi ; θ). Different values\nof c were tested with a Monte Carlo estimation on the first 1000 data of the analysis reported in section V C. Huber's\nnorm is minimized for each MC iteration and the corresponding values of the parameter θ are stored. The histogram\nof θ shows a mean steadily fixed on 0.13 for values of c ranging from 0.001 to 0.1. Increasing the value of c, the\ndistribution starts to shift toward the distribution obtained with MSE minimization. MSE and Huber distributions\nare practically undistinguishable for values c > 2. Since the 'true' value for the parameter θ is set to 0.1, Huber's\nnorm is performing better for values c < 0.1. It was then decided to use the value c = 0.05 for the final analysis\nreported in figure 5.\nReferences\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n\nF. Antonucci et al., Class. Quantum Grav. 28, 094002 (2011).\nF. Antonucci et al., Class. Quantum Grav. 28, 094006 (2011).\nF. Antonucci et al., Class. Quantum Grav. 28, 094001 (2011).\nM. Armano et al., Class. Quantum Grav. 26, 094001 (2009).\nLISA International Science Team, LISA Unveiling a hidden Universe, ESA/SRE(2011)3, February 2011.\nJ. Crowder and N. J. Cornish, Phys. Rev. D 72, 083005 (2005).\nKawamura S et al, Class. Quantum Grav. 23 S125 (2006).\n\n\f18\n[8] Ni W., Shiomi S. and Liao A., Class. Quantum Grav. 21 S641 (2004).\n[9] D. B. Percival and A. T. Walden Spectral Analysis for Physical Applications (Cambridge University Press, Cambridge,\n1993) p 290.\n[10] M. Hewitson et al., Class. Quantum Grav. 26, 094003 (2009).\n[11] MATLAB http://www.mathworks.com\n[12] LTPDA: a MATLAB toolbox for accountable and reproducible data analysis http://www.lisa.aei-hannover.de/ltpda.\n[13] A. N. Kolmogorov, Ist. Ital. Attuari 4, 83 (1933).\n[14] W. Feller, Ann. Math. Stat. 19, 177 (1948).\n[15] N. Smirnov, Ann. Math. Stat. 19, 279 (1948).\n[16] L. H. Miller, J. Amer. Statistical Assoc. 51, 273 (1956).\n[17] M. Abramowitz and I. A. Stegun Handbook of mathematical functions (Dover Publications, New York, 1972) p 260.\n[18] A. Monsky et al., Class. Quantum Grav. 26, 094004 (2009).\n[19] L. Ferraioli, M. Hueller and S. Vitale, Class. Quantum Grav. 26, 094013 (2009).\n[20] A. V. Oppenheim and R. W. Schafer Discrete-Time Signal Processing (Prentice-Hall, Upper Saddle River, New Jersey,\nUSA) p 714.\n[21] S. Mallat A Wavelet Tour of Signal Processing (Academic Press, San Diego, 1998).\n[22] J. A. Peacock, Mon. Not. R. astr. Soc. 202, 615 (1983).\n[23] G. Fasano and A Franceschini, Mon. Not. R. astr. Soc. 225, 155 (1987).\n[24] L. Ferraioli et. al., Phys. Rev. D 82, 042001 (2010).\n[25] D. J. Thomson, Bell Sys. Tech. Journal 56, 1769 (1977).\n[26] F. J. Harris, Proc. IEEE 66, 51 (1978).\n[27] N. I. Fisher, Int. Stat. rev. 51, 25 (1983).\n[28] M. B. Wilk and R. Gnanadesikan, Biometrika 55, 1 (1968).\n[29] M. S. Weiss, J. Amer. Statistical Assoc. 73, 872 (1978).\n[30] P. J. Huber, Ann. Stat. 1, 799 (1973).\n[31] As formulated by equation (6), the test is searching for differences in the noise content of the data series. It does not\nprovide information about which series has the largest noise content. Such information can be recovered graphically with a\ndistribution plot (for example, a quantile-quantile plot). Alternatively, a pure excess noise test for a data series, xm , with\nrespect to a reference series, xn , can be formulated by substituting dK with d+\nK = max {Fn2 (x) − Fn1 (x)}. The formalism\nused for the calculation of dK and d+\nK is the same, therefore the procedures described in this paper can be applied in either\ncase without any significant modification.\n[32] The distribution of the WOSA estimator for the sample spectrum is a gamma distribution, as reported in equation (A8).\nSuch a distribution tends to a Gaussian distribution as the number of averages increases. The difference between the 'true'\ndistribution and the corresponding Gaussian can be quantified by the maximum distance among cumulative distribution\nfunctions, d. As an example d = 0.067 for Ns = 4, d = 0.03 for Ns = 16, d = 0.019 for Ns = 50, d = 0.013 for Ns = 100\nand d = 0.0094 for Ns = 200. It is worth noting that since d is a difference in the space of the values of the CDF, it can\nassume values in [0, 1]. As can be seen, the distribution of the WOSA spectrum reasonably approaches a Gaussian only\nfor Ns as large as 200.\n[33] The term pseudo-stationary indicates a data series which is affected by slight non-stationarity of the kind that can be\nremoved with mean subtraction or standard polynomial fit trend removal.\n[34] If Ns is the number of averaging segments, Nf the length of each segment and h the shift factor, which is indicating the\nnumber of data points two consecutive data segments are shifted by, then the correction to the variance of the averaged\nP s −1 PNf\njh\njh\nprocess is proportional to [9] Γ (h) = N\nt=1 ht ht . Here ht are window elements shifted by a factor jh. With our\nj=1\nchoice of Ns = 4, a segment overlap of 50% and a total data length of 24 h, we find Γ (h) = 2.7 × 10−4 .\n[35] It is easy to verify that, in the case of z = P (fk ) and λ = E [P (fk )] /ν, the probability density function f (z; ν, λ) =\nν −1\n− z\n)\ne 2λ z ( 2\nis correctly represents the statistic of the sample spectrum. E [z] = ν2 2λ = E [P (fk )] as expected for the\nν\n2\n(2λ) Γ( ν\n2)\nspectrum [9]. var [z] = ν2 (2λ)2 = ν2 E [P (fk )] = E [P (fk )] since ν = 2 in the present case.\n\n\f"}