{"id": "http://arxiv.org/abs/0909.2896v2", "guidislink": true, "updated": "2009-09-17T04:47:06Z", "updated_parsed": [2009, 9, 17, 4, 47, 6, 3, 260, 0], "published": "2009-09-15T22:53:25Z", "published_parsed": [2009, 9, 15, 22, 53, 25, 1, 258, 0], "title": "Adaptive coupling for achieving stable synchronization of chaos", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0909.5286%2C0909.5196%2C0909.5154%2C0909.0562%2C0909.5382%2C0909.2842%2C0909.1626%2C0909.0271%2C0909.2330%2C0909.4642%2C0909.1107%2C0909.1756%2C0909.4247%2C0909.2534%2C0909.4850%2C0909.3096%2C0909.3506%2C0909.5456%2C0909.0307%2C0909.4457%2C0909.1807%2C0909.1264%2C0909.0748%2C0909.0106%2C0909.4224%2C0909.4324%2C0909.0193%2C0909.4736%2C0909.0314%2C0909.1172%2C0909.0167%2C0909.3695%2C0909.2870%2C0909.1392%2C0909.0058%2C0909.5255%2C0909.3666%2C0909.4937%2C0909.4321%2C0909.1294%2C0909.1205%2C0909.5108%2C0909.3187%2C0909.1977%2C0909.5160%2C0909.2151%2C0909.2107%2C0909.5533%2C0909.4346%2C0909.4437%2C0909.3040%2C0909.3958%2C0909.3712%2C0909.2352%2C0909.4172%2C0909.3322%2C0909.0170%2C0909.4196%2C0909.2795%2C0909.1286%2C0909.2145%2C0909.3918%2C0909.4074%2C0909.0453%2C0909.1239%2C0909.2430%2C0909.1790%2C0909.4202%2C0909.1098%2C0909.0493%2C0909.5553%2C0909.2335%2C0909.1249%2C0909.5501%2C0909.1477%2C0909.2081%2C0909.0292%2C0909.3832%2C0909.3475%2C0909.2896%2C0909.5591%2C0909.0057%2C0909.3023%2C0909.3143%2C0909.1600%2C0909.5670%2C0909.2784%2C0909.4173%2C0909.0201%2C0909.1250%2C0909.1580%2C0909.4984%2C0909.1353%2C0909.0368%2C0909.0225%2C0909.0097%2C0909.4375%2C0909.3850%2C0909.0075%2C0909.2727%2C0909.2334&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Adaptive coupling for achieving stable synchronization of chaos"}, "summary": "We consider synchronization of coupled chaotic systems and propose an\nadaptive strategy that aims at evolving the strength of the coupling to achieve\nstability of the synchronized evolution. We test this idea in a simple\nconfiguration in which two chaotic systems are unidirectionally coupled (a\nsender and a receiver) and we study conditions for the receiver to adaptively\nsynchronize with the sender. Numerical simulations show that, under certain\nconditions, our strategy is successful in dynamically evolving the coupling\nstrength until it converges to a value that is compatible with synchronization.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0909.5286%2C0909.5196%2C0909.5154%2C0909.0562%2C0909.5382%2C0909.2842%2C0909.1626%2C0909.0271%2C0909.2330%2C0909.4642%2C0909.1107%2C0909.1756%2C0909.4247%2C0909.2534%2C0909.4850%2C0909.3096%2C0909.3506%2C0909.5456%2C0909.0307%2C0909.4457%2C0909.1807%2C0909.1264%2C0909.0748%2C0909.0106%2C0909.4224%2C0909.4324%2C0909.0193%2C0909.4736%2C0909.0314%2C0909.1172%2C0909.0167%2C0909.3695%2C0909.2870%2C0909.1392%2C0909.0058%2C0909.5255%2C0909.3666%2C0909.4937%2C0909.4321%2C0909.1294%2C0909.1205%2C0909.5108%2C0909.3187%2C0909.1977%2C0909.5160%2C0909.2151%2C0909.2107%2C0909.5533%2C0909.4346%2C0909.4437%2C0909.3040%2C0909.3958%2C0909.3712%2C0909.2352%2C0909.4172%2C0909.3322%2C0909.0170%2C0909.4196%2C0909.2795%2C0909.1286%2C0909.2145%2C0909.3918%2C0909.4074%2C0909.0453%2C0909.1239%2C0909.2430%2C0909.1790%2C0909.4202%2C0909.1098%2C0909.0493%2C0909.5553%2C0909.2335%2C0909.1249%2C0909.5501%2C0909.1477%2C0909.2081%2C0909.0292%2C0909.3832%2C0909.3475%2C0909.2896%2C0909.5591%2C0909.0057%2C0909.3023%2C0909.3143%2C0909.1600%2C0909.5670%2C0909.2784%2C0909.4173%2C0909.0201%2C0909.1250%2C0909.1580%2C0909.4984%2C0909.1353%2C0909.0368%2C0909.0225%2C0909.0097%2C0909.4375%2C0909.3850%2C0909.0075%2C0909.2727%2C0909.2334&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We consider synchronization of coupled chaotic systems and propose an\nadaptive strategy that aims at evolving the strength of the coupling to achieve\nstability of the synchronized evolution. We test this idea in a simple\nconfiguration in which two chaotic systems are unidirectionally coupled (a\nsender and a receiver) and we study conditions for the receiver to adaptively\nsynchronize with the sender. Numerical simulations show that, under certain\nconditions, our strategy is successful in dynamically evolving the coupling\nstrength until it converges to a value that is compatible with synchronization."}, "authors": ["Francesco Sorrentino"], "author_detail": {"name": "Francesco Sorrentino"}, "author": "Francesco Sorrentino", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevE.80.056206", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0909.2896v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0909.2896v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "12 Pages, 9 figures, accepted for publication in Physical Review E", "arxiv_primary_category": {"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nlin.CD", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0909.2896v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0909.2896v2", "journal_reference": null, "doi": "10.1103/PhysRevE.80.056206", "fulltext": "Adaptive coupling for achieving stable synchronization of chaos\nFrancesco Sorrentino\nUniversità degli Studi di Napoli Parthenope, 80143 Napoli, Italy.\nInstitute for Research in Electronics and Applied Physics,\n\narXiv:0909.2896v2 [cond-mat.other] 17 Sep 2009\n\nUniversity of Maryland, College Park, Maryland 20742.\n\nWe consider synchronization of coupled chaotic systems and propose an adaptive strategy that\naims at evolving the strength of the coupling to achieve stability of the synchronized evolution. We\ntest this idea in a simple configuration in which two chaotic systems are unidirectionally coupled\n(a sender and a receiver) and we study conditions for the receiver to adaptively synchronize with\nthe sender. Numerical simulations show that, under certain conditions, our strategy is successful\nin dynamically evolving the coupling strength until it converges to a value that is compatible with\nsynchronization.\n\nI.\n\nINTRODUCTION\n\nIt is known that stability of the synchronized solution of coupled dynamical systems depends on the strength of the\ninteraction. Motivated by the observation that real-world networks are characterized by evolving adapting connections,\nsome studies have started to take in consideration how the time variability of the strength of the couplings may affect\nthe synchronization dynamics. A few papers have appeared on adaptive strategies, in which the coupling strengths\nare dynamically adjusted based on information on the states of the systems, e.g., in order to enhance or guarantee\nsynchronization. In this paper we address the problem of how to evolve the coupling strength from a given initial\ncondition to make it converge to a value which corresponds to stability of the synchronized evolution.\nPrevious works have addressed adaptive synchronization of chaos. For instance, in [1, 2], a problem was studied\nin which adaptation was needed in order to achieve synchronization in the presence of external unpredictable events\naffecting the communication between the coupled systems. As an applicative example, consider the case of two sensors\nthat seek to synchronize through a continuous signal that they exchange via wireless communication; if an object\nmoves across the communication pathway between the sensors, this causes an attenuation on the strength of the\nreceived signal, which may disrupt synchronization. Therefore, in [1, 2], adaptive strategies were introduced, having\nthe aim of maintaining synchronization with respect to such external (unpredictable) perturbations.\nHere, we will focus on a different but related problem, namely we consider a simple configuration in which a sender\n\n\f2\nis connected to a receiver and communication between the two is such that attenuations affecting the received signal\nare negligible; the problem is rather for the receiver to adaptively choose an appropriate coupling form (in what follows\nwe will specify our proposed problem to be that of choosing an appropriate coupling strength) with the received signal\nin order to achieve synchronization with the sender.\nTo better illustrate this problem, we introduce the equations for the sender and the receiver,\n\nẋ1 (t) = F (x1 (t)),\n\n(1a)\n\nẋ2 (t) = F (x2 (t)) + γ(t)(H(x1 (t)) − H(x2 (t))),\n\n(1b)\n\nwhere x1 (t) (x2 (t)) is the m-dimensional state of the sender (receiver) system, xi = [xi1 , xi2 , ..., xim ]; F (x) is the\ndynamics of an uncoupled system (hereafter assumed chaotic), F : Rm → Rm ; H(x) is an output function, H : Rm →\nRm ; and γ(t) is a time varying scalar function measuring the strength of the coupling. Here we assume that H(x) can\nbe rewritten as H(x) = Hh(x), where H = [H1 , H2 , ..., Hm ] is a constant m-vector and h : Rm → R is a scalar output\nfunction. In many practical situations, communication between the connected systems involves only a subset of the\ndynamical state variables of the systems. Therefore, in this paper we consider a situation in which synchronization\nhas to be achieved based solely on the scalar signal, h(x1 (t)), that system 2 receives from system 1. Our proposed\nproblem is to devise an adaptive strategy to dynamically evolve the coupling strength γ(t) from an arbitrary initial\ncondition γ(0) to a value that is compatible with synchronization.\nAs an example of an application for our proposed strategy (to be specified in Sec. II), we consider a sender-repeater\ncommunication scenario, in which the first device, say a wifi antenna, sends a signal, and the second identical device\nneeds to reproduce precisely the same signal to other systems that cannot get the original one. As another example, our\nstrategy could be used in applications that take advantage of synchronization of chaos for identification and prediction\nof the dynamics of unknown real systems [3, 4, 5, 6]. In particular, for the problems addressed in [3, 4, 5, 6], the\nreceiver is a model system which is meant to replicate the dynamics of an unknown true system (the sender) and a\ntechnique is proposed that aims at identifying the true system parameters by making the receiver synchronize with\nthe sender. The technique relies on the choice of a coupling strength which is compatible with synchronization, but for\nthis case, an extra difficulty is due to the fact that the dynamical form of the sender's F (x) is unknown at the receiver\nand therefore one is unable to compute the γ-range of stability (i.e., compute the master stability function; for more\ndetails on this subject the reader is referred to the background section) beforehand. Therefore, if one has to deal with\n\n\f3\nsuch a problem and unless one wants to exclusively rely on a try-and-error approach, it becomes necessary to introduce\nan adaptive strategy to dynamically evolve the coupling strength. We anticipate that the adaptive strategy that we\npresent here does not use information from the master stability function and is based exclusively on minimization of\nthe squared synchronization error [h(x1 (t)) − h(x2 (t))]2 . Therefore, we envision our strategy would be particularly\nuseful in applications that use synchronization as a tool to achieve parameter estimation and prediction of unknown\nsystems (e.g., for all the applications described in [3, 4, 5, 6]).\n\nA.\n\nBackground\n\nWe note that Eqs. (1a) and (1b) admit a synchronous solution of the type,\n\nx2 (t) = x1 (t),\n\n(2)\n\nwhich obeys the sender evolution (1a). Our proposed problem is to devise a strategy to evolve γ(t) from a given\ninitial condition γ(0) in order for the receiver system to synchronize with the sender. Let us now assume that γ(t)\nis constant and equal to γ. Following [7, 8, 9, 10], we know that depending on the choice of the functions F and H,\nsynchronization is possible in a certain range of values of γ, say Γ . To see this, let us linearize the receiver system\nequation (1b) about (2), obtaining,\n\nδ ẋ2 (t) = [DF (x1 (t)) − γDH(x1 (t))]δx2 (t),\n\n(3)\n\nwhere DF (x1 (t)) and DH(x1 (t)) are the Jacobians of the functions F and H evaluated about the synchronous solution\n(2). Then stability of the synchronous solution depends on the maximum Lyapunov exponent associated with Eq. (3)\n(this is a classic result, see [7, 8, 9, 10] for more details). Once the functions F and H are given, it becomes possible\nto study the dependence of the maximum Lyapunov exponent of (3) on γ. The function that associates γ with the\nmaximum Lyapunov exponent of (3) is usually called a master stability function [9].\nFrom [7, 8, 9, 10] and subsequent papers, we know that the range of values of γ, say Γ, in which the master stability\nfunction associated with Eq. (3) is negative, can be either bounded or unbounded. An example of a bounded range for\nγ is reported in Fig. 1, where for F (x) being the equation of the Rössler system, m = 3, and h(xi ) = xi1 , H = [1, 0, 0],\nthe master stability function is found to be negative in the range Γ = [0.3, 5]. Moreover, we observe from Fig. 1 that\n\n\f4\nthe master stability function has a minimum at γ ≃ 1.7 (corresponding to the maximum rate of contraction for (3)\nand therefore the fastest possible convergence to the synchronized evolution). Another example of a bounded stability\nrange Γ is reported in [10] for F (x) being the equation of the Lorenz system, m = 3, and h(xi ) = xi3 , H = [0, 0, 1].\n\nMaster stability function\n\n0.6\n\n0.4\n\n0.2\n\nγ=0.3\n\n0\n\n−0.2\n\nγ=5\n−0.4\n\nγ=1.7\n\n−0.6\n\n−0.8\n−1\n\n0\n\n1\n\n2\n\n3\n\n4\n\nγ\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\nFIG. 1: Master stability function corresponding to Eq. (3), for our choices of F (x) being the Rossler equation (11) and\nh(xi ) = xi1 , H = [1, 0, 0]. The zero ordinate line is shown as a guide to the eye (dotted line).\n\nThe problem we address in this paper (a strategy to evolve the strength of the coupling for achieving stable\nsynchronization) has already been addressed in a number of papers [3, 11, 12, 13]. Namely, in [11, 12, 13], the\nfollowing adaptive strategies were proposed,\n\nγ̇(t) = α|h(x1 (t)) − h(x2 (t))|,\nγ̇(t) = α\n\n|h(x1 (t)) − h(x2 (t))|\n,\n1 + |h(x1 (t)) − h(x2 (t))|\n\nin [12,13],\n\n(4a)\n\nin [11],\n\n(4b)\n\nwhere α > 0 is a suitable scalar gain. Equation (4b) is approximately equal to Eq. (4a) for |h(x1 (t)) − h(x2 (t))| ≪ 1,\nand is approximately equal to γ̇(t) = α, for |h(x1 (t)) − h(x2 (t))| ≫ 1. It is worth noting that both strategies are\nbased on increasing the coupling strength γ proportionally with the absolute value of the synchronization error (with\na saturation in the case of (4b)).\nWe note that the strategies proposed in [11, 12, 13] may not be the best suited to deal with coupled dynamical\nsystems whose stability is governed by a master stability function as that shown in Fig. 1. For example, for the case\nshown in Fig. 1, if γ(0) is larger than 5, then increasing γ will not be effective in order to achieve synchronization.\nMoreover, even if γ(0) ∈ Γ, strategies (4a,4b) may eventually increase γ outside the range Γ (e.g., beyond 5 in Fig.\n1) and yield desynchronization even in a case in which the systems would have synchronized with no adaptation (i.e.,\nwith γ̇ = 0).\n\n\f5\nAnother adaptive strategy has been proposed in [3], based on the following adaptation for γ(t),\n\nγ̇(t) = −aγ(t) + g[(h(x1 (t)) − h(x2 (t)))2 ],\n\n(5)\n\nwhere a > 0 and g(x) is a function such that g(x) ≈ x for small x and is bounded by a constant C for large x. We\nnote from (5), that for large t, γ(t) converges to a−1 g[(h(x1 (t)) − h(x2 (t)))2 ] and therefore for a monotonely increasing\ng(x), γ(t) increases monotonely with the squared synchronization error. Hence, (5) is subject to the same sort of\nlimitations as (4a,4b) when stability of the synchronized evolution is described by a master stability function as that\nshown in Fig. 1.\nIn what follows, we will present a novel adaptive strategy, which is aimed at evolving γ(t) from an arbitrary initial\ncondition γ(0) to converge on Γ. We note that the following limitations may apply to some of the previously reported\nstrategies (4a,4b,5),\n1. The strategies (4a,4b,5) are based on increasing the coupling strength with the synchronization error. Yet, for\nthe case of a bounded range of stability Γ, either increasing or decreasing the coupling strength γ may be needed\nin order to achieve synchronization.\n2. The strategies (4a,4b,5) are dependent on the choice of the initial condition γ(0).\n3. The strategies (4a,4b,5) do not seek to make the coupling γ(t) converge in a neighborhood of its optimal value\n(e.g., the minimum of the master stability function which is observed to be at about γ = 1.7 in Fig. 1).\nIn what follows, we focus on the common situation that the γ-range of stability is bounded from both below and\nabove (e.g., as shown for the case of the Rössler systems in Fig. 1). We devise an adaptive strategy that is based\non both increasing/decreasing γ(t) in order to reach synchronization and will be shown to be independent of the\ninitial condition γ(0), as far as γ(0) is not too distant from Γ. Moreover, though our problem is characterized by a\ncontinuous of solutions (represented by the range Γ), our hope is that γ(t) will converge not too far away from the\nvalue of γ = 1.7 which corresponds to the minimum of the master stability function, that is to the maximum rate of\ncontraction towards the synchronization manifold.\nWe wish to emphasize that our strategy described here is only a possible alternative approach to others already\npresented in the literature (e.g., [3, 11, 12, 13]) and we assume that many other possible solutions can be found to\nthe general problem addressed in this paper. At the same time, we hope our attempt will motivate further studies in\nthe same direction, which will provide better and better solutions to our proposed problem.\n\n\f6\nThe rest of the paper is organized as follows. In Sec. II, we present our adaptive strategy. In Sec. III, we show the\nresults of numerical simulations involving our adaptive strategy. In Sec. IV, the conclusions are presented.\n\nII.\n\nADAPTIVE STRATEGY\n\nIn this section we present our adaptive strategy. We introduce a potential/cost function Ψ(t),\n\nΨ(t) =< [h(x1 (t)) − h(x2 (t))]2 >ν ,\n\nwhere < G(t) >ν denotes the sliding exponential average\n\nRt\n\n(6)\n\n′\n\ne−ν(t−t ) G(t′ )dt′ . From (6), we note that Ψ(t) ≥ 0;\n\nmoreover, due to the chaotic nature of the x's, Ψ(t) = 0 can only be realized if x1 (t) and x2 (t) are in the synchronization\nmanifold, i.e., x1 (t) = x2 (t). Thus we seek to evolve γ(t) in order to minimize Ψ(t). To this aim we introduce the\nfollowing gradient descent relation,\ndγ(t)\ndΨ\n∂h T dx2\n= −β\n= 2β < [h(x1 (t)) − h(x2 (t))]\n>ν = 2βG,\ndt\ndγ\n∂x2 dγ\n\n(7)\n\n∂h T dx2\ndG(t)\n= −νG(t) + [h(x1 (t)) − h(x2 (t))]\n.\ndt\n∂x2 dγ\n\n(8)\n\nwhere β > 0, and\n\nWe are interested in how\n\ndx2\ndγ\n\nevolves in time. To this aim, we write,\n\nd dx2\n∂H dx2\ndẋ2\n∂F\n−γ\n]\n=\n=[\n+ [H(x1 (t)) − H(x2 (t))].\ndt dγ\ndγ\n∂x2\n∂x2 dγ\n\n(9)\n\nTo conclude, our adaptive strategy is fully described by the following set of differential equations,\n\nγ̇ = 2βG,\n\n(10a)\n\n∂h T\nξ,\n∂x2\n\n(10b)\n\n∂H\n∂F\n−γ\n]ξ + [H(x1 (t)) − H(x2 (t))].\nξ ̇ = [\n∂x2\n∂x2\n\n(10c)\n\nĠ = −νG(t) + [h(x1 (t)) − h(x2 (t))]\n\n\f7\nIII.\n\nNUMERICAL EXPERIMENTS\n\nIn this section we present numerical experiments involving our proposed adaptive strategy (10). We integrate the\nset of Eqs. (1),(10), and we specify our sender-receiver dynamical systems to be described by the Rössler equation,\nm = 3,\n\n\n\n\n\nF (xi ) = \n\n\n\n−xi2 − xi3\nxi1 + 0.2xi2\n0.2 + (xi1 − 10)xi3\n\n\n\n\n\n\n,\n\n\n\n(11)\n\ni = 1, 2, coupled through h(xi ) = xi1 , H = [1, 0, 0]. Fig. 2 shows the average synchronization error E defined as,\n\nE=\n\n1\n(t2 − t1 )ρ\n\nZ\n\nt2\n\n|h(x2 (t)) − h(x1 (t))|dt,\n\n(12)\n\nt1\n\nfrom integration of Eqs. (1) with γ(t) = γ, versus γ; the normalization factor ρ = < (h(x1 )− < h(x1 ) >)2 >1/2 , with\n< ... > indicating the time average, is calculated from dynamics of system (11) in the synchronous state, i.e., using\ndynamics from Eq. (1a).\n10\n9\n8\n7\n\nE\n\n6\n5\n4\n3\n2\n1\n0\n\n0\n\n2\n\n4\n\nγ\n\n6\n\n8\n\n10\n\nFIG. 2: The average synchronization error E from integration of Eqs. (1) versus (constant) γ, for γ in the range [−1, 10],\nt1 = 0.9 × 102 , t2 = 102 , ρ1 = 7.45.\n\nWe first consider the case that γ(0) is not far away from the stability range Γ = [0.3, 5]; namely we consider two\ncases: in the first case we choose γ(0) = 0, and in the second γ(0) = 5.3. In our numerical simulations, system (1a)\nand system (1b) are evolved from random initial conditions on the Rössler attractor. We choose ν = 0.1 so that ν −1\nis larger than the characteristic time scale of a chaotic oscillation T ≃ 2π, and β to be small enough that γ changes\nslowly on the time scale of the chaos, that is β = 10−4 .\n\n\f8\nThe results are shown in Fig. 3 (for the case γ(0) = 0) and Fig. 4 (for the case γ(0) = 5.3). In both cases, we see\nthat for large enough t, γ(t) converges to Γ = [0.3, 5], e.g., it approaches 2.32 for the case in Fig. 3 and 1.78 for the\ncase in Fig. 4. These values are not far away from the minimum of the master stability function at γ ≃ 1.7 (see Fig.\n1).\n\nx11(t),x21(t)\n\n20\n10\n0\n−10\n−20\n\n0\n\n20\n\n40\n\n0\n\n20\n\n40\n\n60\n\n80\n\n100\n\n60\n\n80\n\n100\n\nγ(t)\n\n3\n\n2\n\n1\n\n0\n\nt\n\nFIG. 3: The upper plot shows the time evolution of x11 (t) (dashed line) compared to x21 (t) (continuous line), while the lower\nplot shows the time evolution of γ(t). γ(0) = 0, β = 10−4 , ν = 10−1 .\n\nx11(t),x21(t)\n\n20\n10\n0\n−10\n−20\n\n0\n\n50\n\n100\n\n150\n\n200\n\n0\n\n50\n\n100\n\n150\n\n200\n\nγ(t)\n\n6\n\n4\n\n2\n\n0\n\nt\n\nFIG. 4: The upper plot shows the time evolution of x11 (t) (dashed line) compared to x21 (t) (continuous line), while the lower\nplot shows the time evolution of γ(t). γ(0) = 5.3, β = 10−4 , ν = 10−1 .\n\nWhen γ(0) is distant from the synchronization range Γ, our proposed problem becomes more complicated. In fact,\nsince it may take a long time for γ(t) to reach Γ, x2 (t) may move away from x1 (t) and the master stability function\nanalysis, which describes local stability about the synchronization manifold, may not apply anymore.\nFigure 5 shows a case in which γ(t) is evolved from γ(0) = 6.5, for β = 10−4 and ν = 10−1 . For this case,\nsynchronization is not achieved, and the emergence of an unexpected phenomenon is observed (namely, the emergence\nof a new attractor, corresponding to ẋ21 (t) ≃ 0, with both |x23 (t)| and |x22 (t)| growing in time in such a way that\nx23 (t) ≃ −x22 (t)). In particular, from Fig. 5 we see that γ(t) first decreases from γ(0) = 6.5 to a minimum value of\nabout −1.5 and then increases again up to about 44; it is worth noting that γ(t) crosses twice the synchronization\n\n\f9\nrange Γ = [0.3, 5] and neither the first nor the second time it converges to it. We have repeated the experiment in\nFig. 5 several times, eventually observing a different behavior, that is, γ(t) increases indefinitely above γ(0) = 6.5\nand never goes through the synchronization range Γ (not shown).\nBased on the above observations, we conclude that, in order to improve the effectiveness of our strategy, we need\nto appropriately tune the rate of change of γ(t). In particular, we note that (i) in the case that γ(t) is close to Γ,\nour strategy would benefit from bounding γ̇(t) so as to allow enough time for γ(t) to converge in Γ; (ii) in the case\nthat γ(t) is distant from Γ, our strategy would benefit from choosing large values of β so as to quickly adjust γ(t) to\nconverge towards Γ.\n\nx11(t),x21(t)\n\n50\n\n0\n\n−50\n\n−100\n0\n\n20\n\n40\n\n60\n\n80\n\n100\n\n120\n\n20\n\n40\n\n60\n\n80\n\n100\n\n120\n\n50\n\nγ(t)\n\n40\n30\n20\n10\n0\n0\n\nt\n\nFIG. 5: The upper plot shows the time evolution of x11 (t) (dashed line) compared to x21 (t) (continuous line), while the lower\nplot shows the time evolution of γ(t); in the lower plot, the zero ordinate line is shown as a guide to the eye (dotted line).\nγ(0) = 6.5, β = 10−4 , ν = 10−1 .\n\nTherefore, we propose to replace γ̇(t) = 2βG(t) in (10a) by,\n\nγ̇(t) = 2β\n\nG(t)\n,\n1 + |G(t)|\n\n(13)\n\nwhere Eq. (13) is approximately equal to (10a) in the case that |G(t)| ≪ 1, while is approximately equal to γ̇(t) =\n2β × sgn(G(t)) in the case that |G(t)| ≫ 1. Note that Eq. (13) corresponds to adding a saturation on γ̇(t), which\nnow is constrained to approximately lye in the range [−β, β].\nFigure 6 (Figure 7) shows the results of numerical simulations in which we have tested our modified adaptive\nstrategy, given by Eqs. (1),(13),(10b),(10c), for a case in which γ(0) = −1 (γ(0) = 10). For our experiments in Figs.\n6 and 7, we have chosen β = 10−1 . As can be seen, in both cases γ(t) is observed to converge to the synchronization\nrange Γ, though it starts from initial conditions that are far away from it.\n\n\f10\n\nx11(t),x21(t)\n\n20\n10\n0\n−10\n−20\n\n0\n\n20\n\n40\n\n0\n\n20\n\n40\n\n60\n\n80\n\n100\n\n60\n\n80\n\n100\n\n3\n\nγ(t)\n\n2\n1\n0\n−1\n\nt\n\nFIG. 6: Modified adaptive strategy. The upper plot shows the time evolution of x11 (t) (dashed line) compared to x21 (t)\n(continuous line), while the lower plot shows the time evolution of γ(t). γ(0) = −1, β = 10−1 , ν = 1.\n\nx11(t),x21(t)\n\n100\n\n0\n\n−100\n\n−200\n\n0\n\n20\n\n40\n\n60\n\n80\n\n100\n\n120\n\n0\n\n20\n\n40\n\n60\n\n80\n\n100\n\n120\n\nγ(t)\n\n15\n\n10\n\n5\n\n0\n\nt\n\nFIG. 7: Modified adaptive strategy. The upper plot shows the time evolution of x11 (t) (dashed line) compared to x21 (t)\n(continuous line), while the lower plot shows the time evolution of γ(t). γ(0) = 10, β = 10−1 , ν = 1.\n\nA.\n\nAn experiment with the Lorenz system\n\nWe now consider an example in which our sender-receiver dynamical systems are described by the Lorenz equation,\nm = 3,\n\n\n10(xi2 − xi1 )\n\n\n\n\nF (xi ) =  23xi1 − xi2 − xi1 xi3\n\n\nxi1 xi2 − xi3\n\n\n\n\n\n\n,\n\n\n\n(14)\n\ni = 1, 2. From [14] we know that when two Lorenz systems (14) are coupled as in (1) with constant coupling γ(t) = γ,\nh(xi ) = xi3 , H = [0, 0, 1], synchronization is stable in a bounded interval of the coupling strength γ, that is for\nγ ∈ Γ = [1.2, 6.5] .\nFigure 8 shows the average synchronization error E, defined in Eq. (12), for two Lorenz systems coupled as in\nEqs. (1), with constant coupling γ(t) = γ, h(xi ) = xi3 , H = [0, 0, 1], as function of the parameter γ; for this case, we\n\n\f11\nobserve that the transition to the non-synchronous state is characterized by on-off intermittency [15, 16, 17], which\nmakes the use of our adaptive strategy much harder, since the gradient descent relation (7) relies on the assumption\nthat the potential (6) is a monotonically increasing function of γ, for γ moving away from Γ. However, we have\nimplemented our adaptive strategy given by Eqs. (1),(13),(10b),(10c) and found that it can be successful applied to\nachieve synchronization, provided that γ(0) is not too far away from the stability range Γ = [1.2, 6.5]. Fig. 9 shows\nconvergence of γ(t) to values in the stability range Γ for two different choices of the initial conditions, that is, γ(0) = 8\nand γ(0) = 0.\n1\n0.9\n0.8\n0.7\n\nE\n\n0.6\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\nγ\n\n6\n\n7\n\n8\n\n9\n\n10\n\nFIG. 8: The average synchronization error E obtained from integration of Eqs. (1) with γ(t) = γ, versus (constant) γ, for γ in\nthe range [0, 10]. F (x) is the Lorenz equation, h(xi ) = xi3 , H = [0, 0, 1], t1 = 0.75 × 103 , t2 = 103 .\n\n9\n\n(a)\n\nγ(t)\n\n8\n7\n6\n5\n\n0\n\n200\n\n400\n\n600\n\n800\n\n1000\n\n3\n\nγ(t)\n\n2\n\n(b)\n\n1\n0\n−1\n\n0\n\n200\n\n400\n\n600\n\n800\n\n1000\n\nt\n\nFIG. 9: We have tested the modified adaptive strategy given by Eqs. (1),(13),(10b),(10c), for the case of coupled Lorenz\nsystems (14), h(xi ) = xi3 , H = [0, 0, 1]. The sender and the receiver systems are initialized from random points belonging to\nthe Lorenz attractor. The adaptive strategy is shown to be successful in two cases, corresponding to two different choices of\nthe initial conditions, γ(0) = 8 and γ(0) = 0. Plot (a) shows the time evolution of γ(t) from γ(0) = 8, β = 10−2 , ν = 1. Plot\n(b) shows the time evolution of γ(t) from γ(0) = 0, β = 10−2 , ν = 1.\n\n\f12\nIV.\n\nCONCLUSIONS\n\nIn this paper we have considered a situation in which a sender system is unidirectionally coupled to a receiver\nand we have studied conditions for the receiver to adaptively evolve the strength of the coupling to achieve stable\nsynchronization with the sender. We have proposed a simple adaptive strategy which has been shown to be successful\nin dynamically evolving the coupling strength γ until it converges to a value in the range of stable synchronization Γ.\nFor cases in which the coupling strength is evolved from initial conditions which are distant from Γ, we have proposed\nand numerically tested a modified adaptive strategy which includes a saturation on |γ̇|.\nThe author is indebted to Prof. Edward Ott for insightful advices and discussions.\nThis work was supported by the U.S. Office of Naval Research, contract N00014-07-1-0734.\n\n[1] F. Sorrentino and E. Ott, Phys. Rev. Lett. 100, 114101 (2008).\n[2] F. Sorrentino and E. Ott, Phys. Rev. E 79, 016201 (2009).\n[3] H. D. I. Abarbanel, D. R. Creveling, and J. M. Jeanne, Phys. Rev. E 77, 016208 (2008).\n[4] D. R. Creveling, P. E. Gill, and H. D. I. Abarbanel, Phys. Lett. A 372, 2640 (2008).\n[5] J. C. Quinn, P. H. Bryant, D. R. Creveling, S. R. Klein, and H. D. I. Abarbanel, Phys. Rev. E 80, 016201 (2009).\n[6] F. Sorrentino and E. Ott, Chaos 19, 033108 (2009).\n[7] H. Fujisaka and T. Yamada, Prog. Theor. Phys. 69, 32 (1983).\n[8] V. S. Afraimovich, N. N. Verichev, and M. I. Rabinovich, Inv. VUZ Radiofiz. 29, 795 (1986).\n[9] L. Pecora and T. Carroll, Phys. Rev. Lett. 80, 2109 (1998).\n[10] J. Yang, G. Hu, and J. Xiao, Phys. Rev. Lett. 80, 496 (1998).\n[11] C. Zhou and J. Kurths, Phys. Rev. Lett. 96, 164102 (2006).\n[12] P. De Lellis, M. di Bernardo, F. Sorrentino, and A. Tierno, International Journal of Computer Mathematics 85, 1189\n(2008).\n[13] P. De Lellis, M. di Bernardo, and F. Garofalo, Chaos 18, 037110 (2008).\n[14] G. Hu, J. Yang, and W. Liu, Phys. Rev. E 58, 4440 (1998).\n[15] A. S. Pikovsky, Z. Phys. B 55, 149 (1984).\n[16] N. Platt, E. A. Spiegel, and C. Tresser, Phys. Rev. Lett. 70, 279 (1993).\n[17] E. Ott and J. C. Sommerer, Phys. Lett. A 188, 39 (1994).\n\n\fAdaptive coupling for achieving stable synchronization of chaos\nFrancesco Sorrentino\nUniversità degli Studi di Napoli Parthenope, 80143 Napoli, Italy.\nInstitute for Research in Electronics and Applied Physics,\n\narXiv:0909.2896v2 [cond-mat.other] 17 Sep 2009\n\nUniversity of Maryland, College Park, Maryland 20742.\n\nWe consider synchronization of coupled chaotic systems and propose an adaptive strategy that\naims at evolving the strength of the coupling to achieve stability of the synchronized evolution. We\ntest this idea in a simple configuration in which two chaotic systems are unidirectionally coupled\n(a sender and a receiver) and we study conditions for the receiver to adaptively synchronize with\nthe sender. Numerical simulations show that, under certain conditions, our strategy is successful\nin dynamically evolving the coupling strength until it converges to a value that is compatible with\nsynchronization.\n\nI.\n\nINTRODUCTION\n\nIt is known that stability of the synchronized solution of coupled dynamical systems depends on the strength of the\ninteraction. Motivated by the observation that real-world networks are characterized by evolving adapting connections,\nsome studies have started to take in consideration how the time variability of the strength of the couplings may affect\nthe synchronization dynamics. A few papers have appeared on adaptive strategies, in which the coupling strengths\nare dynamically adjusted based on information on the states of the systems, e.g., in order to enhance or guarantee\nsynchronization. In this paper we address the problem of how to evolve the coupling strength from a given initial\ncondition to make it converge to a value which corresponds to stability of the synchronized evolution.\nPrevious works have addressed adaptive synchronization of chaos. For instance, in [1, 2], a problem was studied\nin which adaptation was needed in order to achieve synchronization in the presence of external unpredictable events\naffecting the communication between the coupled systems. As an applicative example, consider the case of two sensors\nthat seek to synchronize through a continuous signal that they exchange via wireless communication; if an object\nmoves across the communication pathway between the sensors, this causes an attenuation on the strength of the\nreceived signal, which may disrupt synchronization. Therefore, in [1, 2], adaptive strategies were introduced, having\nthe aim of maintaining synchronization with respect to such external (unpredictable) perturbations.\nHere, we will focus on a different but related problem, namely we consider a simple configuration in which a sender\n\n\f2\nis connected to a receiver and communication between the two is such that attenuations affecting the received signal\nare negligible; the problem is rather for the receiver to adaptively choose an appropriate coupling form (in what follows\nwe will specify our proposed problem to be that of choosing an appropriate coupling strength) with the received signal\nin order to achieve synchronization with the sender.\nTo better illustrate this problem, we introduce the equations for the sender and the receiver,\n\nẋ1 (t) = F (x1 (t)),\n\n(1a)\n\nẋ2 (t) = F (x2 (t)) + γ(t)(H(x1 (t)) − H(x2 (t))),\n\n(1b)\n\nwhere x1 (t) (x2 (t)) is the m-dimensional state of the sender (receiver) system, xi = [xi1 , xi2 , ..., xim ]; F (x) is the\ndynamics of an uncoupled system (hereafter assumed chaotic), F : Rm → Rm ; H(x) is an output function, H : Rm →\nRm ; and γ(t) is a time varying scalar function measuring the strength of the coupling. Here we assume that H(x) can\nbe rewritten as H(x) = Hh(x), where H = [H1 , H2 , ..., Hm ] is a constant m-vector and h : Rm → R is a scalar output\nfunction. In many practical situations, communication between the connected systems involves only a subset of the\ndynamical state variables of the systems. Therefore, in this paper we consider a situation in which synchronization\nhas to be achieved based solely on the scalar signal, h(x1 (t)), that system 2 receives from system 1. Our proposed\nproblem is to devise an adaptive strategy to dynamically evolve the coupling strength γ(t) from an arbitrary initial\ncondition γ(0) to a value that is compatible with synchronization.\nAs an example of an application for our proposed strategy (to be specified in Sec. II), we consider a sender-repeater\ncommunication scenario, in which the first device, say a wifi antenna, sends a signal, and the second identical device\nneeds to reproduce precisely the same signal to other systems that cannot get the original one. As another example, our\nstrategy could be used in applications that take advantage of synchronization of chaos for identification and prediction\nof the dynamics of unknown real systems [3, 4, 5, 6]. In particular, for the problems addressed in [3, 4, 5, 6], the\nreceiver is a model system which is meant to replicate the dynamics of an unknown true system (the sender) and a\ntechnique is proposed that aims at identifying the true system parameters by making the receiver synchronize with\nthe sender. The technique relies on the choice of a coupling strength which is compatible with synchronization, but for\nthis case, an extra difficulty is due to the fact that the dynamical form of the sender's F (x) is unknown at the receiver\nand therefore one is enable to compute the γ-range of stability (i.e., compute the master stability function; for more\ndetails on this subject the reader is referred to the background section) beforehand. Therefore, if one has to deal with\n\n\f3\nsuch a problem and unless one wants to exclusively rely on a try-and-error approach, it becomes necessary to introduce\nan adaptive strategy to dynamically evolve the coupling strength. We anticipate that the adaptive strategy that we\npresent here does not use information from the master stability function and is based exclusively on minimization of\nthe squared synchronization error [h(x1 (t)) − h(x2 (t))]2 . Therefore, we envision our strategy would be particularly\nuseful in applications that use synchronization as a tool to achieve parameter estimation and prediction of unknown\nsystems (e.g., for all the applications described in [3, 4, 5, 6]).\n\nA.\n\nBackground\n\nWe note that Eqs. (1a) and (1b) admit a synchronous solution of the type,\n\nx2 (t) = x1 (t),\n\n(2)\n\nwhich obeys the sender evolution (1a). Our proposed problem is to devise a strategy to evolve γ(t) from a given\ninitial condition γ(0) in order for the receiver system to synchronize with the sender. Let us now assume that γ(t)\nis constant and equal to γ. Following [7, 8, 9, 10], we know that depending on the choice of the functions F and H,\nsynchronization is possible in a certain range of values of γ, say Γ . To see this, let us linearize the receiver system\nequation (1b) about (2), obtaining,\n\nδ ẋ2 (t) = [DF (x1 (t)) − γDH(x1 (t))]δx2 (t),\n\n(3)\n\nwhere DF (x1 (t)) and DH(x1 (t)) are the Jacobians of the functions F and H evaluated about the synchronous solution\n(2). Then stability of the synchronous solution depends on the maximum Lyapunov exponent associated with Eq. (3)\n(this is a classic result, see [7, 8, 9, 10] for more details). Once the functions F and H are given, it becomes possible\nto study the dependence of the maximum Lyapunov exponent of (3) on γ. The function that associates γ with the\nmaximum Lyapunov exponent of (3) is usually called a master stability function [9].\nFrom [7, 8, 9, 10] and subsequent papers, we know that the range of values of γ, say Γ, in which the master stability\nfunction associated with Eq. (3) is negative, can be either bounded or unbounded. An example of a bounded range for\nγ is reported in Fig. 1, where for F (x) being the equation of the Rössler system, m = 3, and h(xi ) = xi1 , H = [1, 0, 0],\nthe master stability function is found to be negative in the range Γ = [0.3, 5]. Moreover, we observe from Fig. 1 that\n\n\f4\nthe master stability function has a minimum at γ ≃ 1.7 (corresponding to the maximum rate of contraction for (3)\nand therefore the fastest possible convergence to the synchronized evolution). Another example of a bounded stability\nrange Γ is reported in [10] for F (x) being the equation of the Lorenz system, m = 3, and h(xi ) = xi3 , H = [0, 0, 1].\n\nMaster stability function\n\n0.6\n\n0.4\n\n0.2\n\nγ=0.3\n\n0\n\n−0.2\n\nγ=5\n−0.4\n\nγ=1.7\n\n−0.6\n\n−0.8\n−1\n\n0\n\n1\n\n2\n\n3\n\n4\n\nγ\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\nFIG. 1: Master stability function corresponding to Eq. (3), for our choices of F (x) being the Rossler equation (11) and\nh(xi ) = xi1 , H = [1, 0, 0]. The zero ordinate line is shown as a guide to the eye (dotted line).\n\nThe problem we address in this paper (a strategy to evolve the strength of the coupling for achieving stable\nsynchronization) has already been addressed in a number of papers [3, 11, 12, 13]. Namely, in [11, 12, 13], the\nfollowing adaptive strategies were proposed,\n\nγ̇(t) = α|h(x1 (t)) − h(x2 (t))|,\nγ̇(t) = α\n\n|h(x1 (t)) − h(x2 (t))|\n,\n1 + |h(x1 (t)) − h(x2 (t))|\n\nin [12,13],\n\n(4a)\n\nin [11],\n\n(4b)\n\nwhere α > 0 is a suitable scalar gain. Equation (4b) is approximately equal to Eq. (4a) for |h(x1 (t)) − h(x2 (t))| ≪ 1,\nand is approximately equal to γ̇(t) = α, for |h(x1 (t)) − h(x2 (t))| ≫ 1. It is worth noting that both strategies are\nbased on increasing the coupling strength γ proportionally with the absolute value of the synchronization error (with\na saturation in the case of (4b)).\nWe note that the strategies proposed in [11, 12, 13] may not be the best suited to deal with coupled dynamical\nsystems whose stability is governed by a master stability function as that shown in Fig. 1. For example, for the case\nshown in Fig. 1, if γ(0) is larger than 5, then increasing γ will not be effective in order to achieve synchronization.\nMoreover, even if γ(0) ∈ Γ, strategies (4a,4b) may eventually increase γ outside the range Γ (e.g., beyond 5 in Fig.\n1) and yield desynchronization even in a case in which the systems would have synchronized with no adaptation (i.e.,\nwith γ̇ = 0).\n\n\f5\nAnother adaptive strategy has been proposed in [3], based on the following adaptation for γ(t),\n\nγ̇(t) = −aγ(t) + g[(h(x1 (t)) − h(x2 (t)))2 ],\n\n(5)\n\nwhere a > 0 and g(x) is a function such that g(x) ≈ x for small x and is bounded by a constant C for large x. We\nnote from (5), that for large t, γ(t) converges to a−1 g[(h(x1 (t)) − h(x2 (t)))2 ] and therefore for a monotonely increasing\ng(x), γ(t) increases monotonely with the squared synchronization error. Hence, (5) is subject to the same sort of\nlimitations as (4a,4b) when stability of the synchronized evolution is described by a master stability function as that\nshown in Fig. 1.\nIn what follows, we will present a novel adaptive strategy, which is aimed at evolving γ(t) from an arbitrary initial\ncondition γ(0) to converge on Γ. We note that the following limitations may apply to some of the previously reported\nstrategies (4a,4b,5),\n1. The strategies (4a,4b,5) are based on increasing the coupling strength with the synchronization error. Yet, for\nthe case of a bounded range of stability Γ, either increasing or decreasing the coupling strength γ may be needed\nin order to achieve synchronization.\n2. The strategies (4a,4b,5) are dependent on the choice of the initial condition γ(0).\n3. The strategies (4a,4b,5) do not seek to make the coupling γ(t) converge in a neighborhood of its optimal value\n(e.g., the minimum of the master stability function which is observed to be at about γ = 1.7 in Fig. 1).\nIn what follows, we focus on the common situation that the γ-range of stability is bounded from both below and\nabove (e.g., as shown for the case of the Rössler systems in Fig. 1). We devise an adaptive strategy that is based\non both increasing/decreasing γ(t) in order to reach synchronization and will be shown to be independent of the\ninitial condition γ(0), as far as γ(0) is not too distant from Γ. Moreover, though our problem is characterized by a\ncontinuous of solutions (represented by the range Γ), our hope is that γ(t) will converge not too far away from the\nvalue of γ = 1.7 which corresponds to the minimum of the master stability function, that is to the maximum rate of\ncontraction towards the synchronization manifold.\nWe wish to emphasize that our strategy described here is only a possible alternative approach to others already\npresented in the literature (e.g., [3, 11, 12, 13]) and we assume that many other possible solutions can be found to\nthe general problem addressed in this paper. At the same time, we hope our attempt will motivate further studies in\nthe same direction, which will provide better and better solutions to our proposed problem.\n\n\f6\nThe rest of the paper is organized as follows. In Sec. II, we present our adaptive strategy. In Sec. III, we show the\nresults of numerical simulations involving our adaptive strategy. In Sec. IV, the conclusions are presented.\n\nII.\n\nADAPTIVE STRATEGY\n\nIn this section we present our adaptive strategy. We introduce a potential/cost function Ψ(t),\n\nΨ(t) =< [h(x1 (t)) − h(x2 (t))]2 >ν ,\n\nwhere < G(t) >ν denotes the sliding exponential average\n\nRt\n\n(6)\n\n′\n\ne−ν(t−t ) G(t′ )dt′ . From (6), we note that Ψ(t) ≥ 0;\n\nmoreover, due to the chaotic nature of the x's, Ψ(t) = 0 can only be realized if x1 (t) and x2 (t) are in the synchronization\nmanifold, i.e., x1 (t) = x2 (t). Thus we seek to evolve γ(t) in order to minimize Ψ(t). To this aim we introduce the\nfollowing gradient descent relation,\ndγ(t)\ndΨ\n∂h T dx2\n= −β\n= 2β < [h(x1 (t)) − h(x2 (t))]\n>ν = 2βG,\ndt\ndγ\n∂x2 dγ\n\n(7)\n\n∂h T dx2\ndG(t)\n= −νG(t) + [h(x1 (t)) − h(x2 (t))]\n.\ndt\n∂x2 dγ\n\n(8)\n\nwhere β > 0, and\n\nWe are interested in how\n\ndx2\ndγ\n\nevolves in time. To this aim, we write,\n\nd dx2\n∂H dx2\ndẋ2\n∂F\n−γ\n]\n=\n=[\n+ [H(x1 (t)) − H(x2 (t))].\ndt dγ\ndγ\n∂x2\n∂x2 dγ\n\n(9)\n\nTo conclude, our adaptive strategy is fully described by the following set of differential equations,\n\nγ̇ = 2βG,\n\n(10a)\n\n∂h T\nξ,\n∂x2\n\n(10b)\n\n∂H\n∂F\n−γ\n]ξ + [H(x1 (t)) − H(x2 (t))].\nξ ̇ = [\n∂x2\n∂x2\n\n(10c)\n\nĠ = −νG(t) + [h(x1 (t)) − h(x2 (t))]\n\n\f7\nIII.\n\nNUMERICAL EXPERIMENTS\n\nIn this section we present numerical experiments involving our proposed adaptive strategy (10). We integrate the\nset of Eqs. (1),(10), and we specify our sender-receiver dynamical systems to be described by the Rössler equation,\nm = 3,\n\n\n\n\n\nF (xi ) = \n\n\n\n−xi2 − xi3\nxi1 + 0.2xi2\n0.2 + (xi1 − 10)xi3\n\n\n\n\n\n\n,\n\n\n\n(11)\n\ni = 1, 2, coupled through h(xi ) = xi1 , H = [1, 0, 0]. Fig. 2 shows the average synchronization error E defined as,\n\nE=\n\n1\n(t2 − t1 )ρ\n\nZ\n\nt2\n\n|h(x2 (t)) − h(x1 (t))|dt,\n\n(12)\n\nt1\n\nfrom integration of Eqs. (1) with γ(t) = γ, versus γ; the normalization factor ρ = < (h(x1 )− < h(x1 ) >)2 >1/2 , with\n< ... > indicating the time average, is calculated from dynamics of system (11) in the synchronous state, i.e., using\ndynamics from Eq. (1a).\n10\n9\n8\n7\n\nE\n\n6\n5\n4\n3\n2\n1\n0\n\n0\n\n2\n\n4\n\nγ\n\n6\n\n8\n\n10\n\nFIG. 2: The average synchronization error E from integration of Eqs. (1) versus (constant) γ, for γ in the range [−1, 10],\nt1 = 0.9 × 102 , t2 = 102 , ρ1 = 7.45.\n\nWe first consider the case that γ(0) is not far away from the stability range Γ = [0.3, 5]; namely we consider two\ncases: in the first case we choose γ(0) = 0, and in the second γ(0) = 5.3. In our numerical simulations, system (1a)\nand system (1b) are evolved from random initial conditions on the Rössler attractor. We choose ν = 0.1 so that ν −1\nis larger than the characteristic time scale of a chaotic oscillation T ≃ 2π, and β to be small enough that γ changes\nslowly on the time scale of the chaos, that is β = 10−4 .\n\n\f8\nThe results are shown in Fig. 3 (for the case γ(0) = 0) and Fig. 4 (for the case γ(0) = 5.3). In both cases, we see\nthat for large enough t, γ(t) converges to Γ = [0.3, 5], e.g., it approaches 2.32 for the case in Fig. 3 and 1.78 for the\ncase in Fig. 4. These values are not far away from the minimum of the master stability function at γ ≃ 1.7 (see Fig.\n1).\n\nx11(t),x21(t)\n\n20\n10\n0\n−10\n−20\n\n0\n\n20\n\n40\n\n0\n\n20\n\n40\n\n60\n\n80\n\n100\n\n60\n\n80\n\n100\n\nγ(t)\n\n3\n\n2\n\n1\n\n0\n\nt\n\nFIG. 3: The upper plot shows the time evolution of x11 (t) (dashed line) compared to x21 (t) (continuous line), while the lower\nplot shows the time evolution of γ(t). γ(0) = 0, β = 10−4 , ν = 10−1 .\n\nx11(t),x21(t)\n\n20\n10\n0\n−10\n−20\n\n0\n\n50\n\n100\n\n150\n\n200\n\n0\n\n50\n\n100\n\n150\n\n200\n\nγ(t)\n\n6\n\n4\n\n2\n\n0\n\nt\n\nFIG. 4: The upper plot shows the time evolution of x11 (t) (dashed line) compared to x21 (t) (continuous line), while the lower\nplot shows the time evolution of γ(t). γ(0) = 5.3, β = 10−4 , ν = 10−1 .\n\nWhen γ(0) is distant from the synchronization range Γ, our proposed problem becomes more complicated. In fact,\nsince it may take a long time for γ(t) to reach Γ, x2 (t) may move away from x1 (t) and the master stability function\nanalysis, which describes local stability about the synchronization manifold, may not apply anymore.\nFigure 5 shows a case in which γ(t) is evolved from γ(0) = 6.5, for β = 10−4 and ν = 10−1 . For this case,\nsynchronization is not achieved, and the emergence of an unexpected phenomenon is observed (namely, the emergence\nof a new attractor, corresponding to ẋ21 (t) ≃ 0, with both |x23 (t)| and |x22 (t)| growing in time in such a way that\nx23 (t) ≃ −x22 (t)). In particular, from Fig. 5 we see that γ(t) first decreases from γ(0) = 6.5 to a minimum value of\nabout −1.5 and then increases again up to about 44; it is worth noting that γ(t) crosses twice the synchronization\n\n\f9\nrange Γ = [0.3, 5] and neither the first nor the second time it converges to it. We have repeated the experiment in\nFig. 5 several times, eventually observing a different behavior, that is, γ(t) increases indefinitely above γ(0) = 6.5\nand never goes through the synchronization range Γ (not shown).\nBased on the above observations, we conclude that, in order to improve the effectiveness of our strategy, we need\nto appropriately tune the rate of change of γ(t). In particular, we note that (i) in the case that γ(t) is close to Γ,\nour strategy would benefit from bounding γ̇(t) so as to allow enough time for γ(t) to converge in Γ; (ii) in the case\nthat γ(t) is distant from Γ, our strategy would benefit from choosing large values of β so as to quickly adjust γ(t) to\nconverge towards Γ.\n\nx11(t),x21(t)\n\n50\n\n0\n\n−50\n\n−100\n0\n\n20\n\n40\n\n60\n\n80\n\n100\n\n120\n\n20\n\n40\n\n60\n\n80\n\n100\n\n120\n\n50\n\nγ(t)\n\n40\n30\n20\n10\n0\n0\n\nt\n\nFIG. 5: The upper plot shows the time evolution of x11 (t) (dashed line) compared to x21 (t) (continuous line), while the lower\nplot shows the time evolution of γ(t); in the lower plot, the zero ordinate line is shown as a guide to the eye (dotted line).\nγ(0) = 6.5, β = 10−4 , ν = 10−1 .\n\nTherefore, we propose to replace γ̇(t) = 2βG(t) in (10a) by,\n\nγ̇(t) = 2β\n\nG(t)\n,\n1 + |G(t)|\n\n(13)\n\nwhere Eq. (13) is approximately equal to (10a) in the case that |G(t)| ≪ 1, while is approximately equal to γ̇(t) =\n2β × sgn(G(t)) in the case that |G(t)| ≫ 1. Note that Eq. (13) corresponds to adding a saturation on γ̇(t), which\nnow is constrained to approximately lye in the range [−β, β].\nFigure 6 (Figure 7) shows the results of numerical simulations in which we have tested our modified adaptive\nstrategy, given by Eqs. (1),(13),(10b),(10c), for a case in which γ(0) = −1 (γ(0) = 10). For our experiments in Figs.\n6 and 7, we have chosen β = 10−1 . As can be seen, in both cases γ(t) is observed to converge to the synchronization\nrange Γ, though it starts from initial conditions that are far away from it.\n\n\f10\n\nx11(t),x21(t)\n\n20\n10\n0\n−10\n−20\n\n0\n\n20\n\n40\n\n0\n\n20\n\n40\n\n60\n\n80\n\n100\n\n60\n\n80\n\n100\n\n3\n\nγ(t)\n\n2\n1\n0\n−1\n\nt\n\nFIG. 6: Modified adaptive strategy. The upper plot shows the time evolution of x11 (t) (dashed line) compared to x21 (t)\n(continuous line), while the lower plot shows the time evolution of γ(t). γ(0) = −1, β = 10−1 , ν = 1.\n\nx11(t),x21(t)\n\n100\n\n0\n\n−100\n\n−200\n\n0\n\n20\n\n40\n\n60\n\n80\n\n100\n\n120\n\n0\n\n20\n\n40\n\n60\n\n80\n\n100\n\n120\n\nγ(t)\n\n15\n\n10\n\n5\n\n0\n\nt\n\nFIG. 7: Modified adaptive strategy. The upper plot shows the time evolution of x11 (t) (dashed line) compared to x21 (t)\n(continuous line), while the lower plot shows the time evolution of γ(t). γ(0) = 10, β = 10−1 , ν = 1.\n\nA.\n\nAn experiment with the Lorenz system\n\nWe now consider an example in which our sender-receiver dynamical systems are described by the Lorenz equation,\nm = 3,\n\n\n10(xi2 − xi1 )\n\n\n\n\nF (xi ) =  23xi1 − xi2 − xi1 xi3\n\n\nxi1 xi2 − xi3\n\n\n\n\n\n\n,\n\n\n\n(14)\n\ni = 1, 2. From [14] we know that when two Lorenz systems (14) are coupled as in (1) with constant coupling γ(t) = γ,\nh(xi ) = xi3 , H = [0, 0, 1], synchronization is stable in a bounded interval of the coupling strength γ, that is for\nγ ∈ Γ = [1.2, 6.5] .\nFigure 8 shows the average synchronization error E, defined in Eq. (12), for two Lorenz systems coupled as in\nEqs. (1), with constant coupling γ(t) = γ, h(xi ) = xi3 , H = [0, 0, 1], as function of the parameter γ; for this case, we\n\n\f11\nobserve that the transition to the non-synchronous state is characterized by on-off intermittency [15, 16, 17], which\nmakes the use of our adaptive strategy much harder, since the gradient descent relation (7) relies on the assumption\nthat the potential (6) is a monotonically increasing function of γ, for γ moving away from Γ. However, we have\nimplemented our adaptive strategy given by Eqs. (1),(13),(10b),(10c) and found that it can be successful applied to\nachieve synchronization, provided that γ(0) is not too far away from the stability range Γ = [1.2, 6.5]. Fig. 9 shows\nconvergence of γ(t) to values in the stability range Γ for two different choices of the initial conditions, that is, γ(0) = 8\nand γ(0) = 0.\n1\n0.9\n0.8\n0.7\n\nE\n\n0.6\n0.5\n0.4\n0.3\n0.2\n0.1\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\nγ\n\n6\n\n7\n\n8\n\n9\n\n10\n\nFIG. 8: The average synchronization error E obtained from integration of Eqs. (1) with γ(t) = γ, versus (constant) γ, for γ in\nthe range [0, 10]. F (x) is the Lorenz equation, h(xi ) = xi3 , H = [0, 0, 1], t1 = 0.75 × 103 , t2 = 103 .\n\n9\n\n(a)\n\nγ(t)\n\n8\n7\n6\n5\n\n0\n\n200\n\n400\n\n600\n\n800\n\n1000\n\n3\n\nγ(t)\n\n2\n\n(b)\n\n1\n0\n−1\n\n0\n\n200\n\n400\n\n600\n\n800\n\n1000\n\nt\n\nFIG. 9: We have tested the modified adaptive strategy given by Eqs. (1),(13),(10b),(10c), for the case of coupled Lorenz\nsystems (14), h(xi ) = xi3 , H = [0, 0, 1]. The sender and the receiver systems are initialized from random points belonging to\nthe Lorenz attractor. The adaptive strategy is shown to be successful in two cases, corresponding to two different choices of\nthe initial conditions, γ(0) = 8 and γ(0) = 0. Plot (a) shows the time evolution of γ(t) from γ(0) = 8, β = 10−2 , ν = 1. Plot\n(b) shows the time evolution of γ(t) from γ(0) = 0, β = 10−2 , ν = 1.\n\n\f12\nIV.\n\nCONCLUSIONS\n\nIn this paper we have considered a situation in which a sender system is unidirectionally coupled to a receiver\nand we have studied conditions for the receiver to adaptively evolve the strength of the coupling to achieve stable\nsynchronization with the sender. We have proposed a simple adaptive strategy which has been shown to be successful\nin dynamically evolving the coupling strength γ until it converges to a value in the range of stable synchronization Γ.\nFor cases in which the coupling strength is evolved from initial conditions which are distant from Γ, we have proposed\nand numerically tested a modified adaptive strategy which includes a saturation on |γ̇|.\nThe author is indebted to Prof. Edward Ott for insightful advices and discussions.\nThis work was supported by the U.S. Office of Naval Research, contract N00014-07-1-0734.\n\n[1] F. Sorrentino and E. Ott, Phys. Rev. Lett. 100, 114101 (2008).\n[2] F. Sorrentino and E. Ott, Phys. Rev. E 79, 016201 (2009).\n[3] H. D. I. Abarbanel, D. R. Creveling, and J. M. Jeanne, Phys. Rev. E 77, 016208 (2008).\n[4] D. R. Creveling, P. E. Gill, and H. D. I. Abarbanel, Phys. Lett. A 372, 2640 (2008).\n[5] J. C. Quinn, P. H. Bryant, D. R. Creveling, S. R. Klein, and H. D. I. Abarbanel, Phys. Rev. E 80, 016201 (2009).\n[6] F. Sorrentino and E. Ott, Chaos 19, 033108 (2009).\n[7] H. Fujisaka and T. Yamada, Prog. Theor. Phys. 69, 32 (1983).\n[8] V. S. Afraimovich, N. N. Verichev, and M. I. Rabinovich, Inv. VUZ Radiofiz. 29, 795 (1986).\n[9] L. Pecora and T. Carroll, Phys. Rev. Lett. 80, 2109 (1998).\n[10] J. Yang, G. Hu, and J. Xiao, Phys. Rev. Lett. 80, 496 (1998).\n[11] C. Zhou and J. Kurths, Phys. Rev. Lett. 96, 164102 (2006).\n[12] P. De Lellis, M. di Bernardo, F. Sorrentino, and A. Tierno, International Journal of Computer Mathematics 85, 1189\n(2008).\n[13] P. De Lellis, M. di Bernardo, and F. Garofalo, Chaos 18, 037110 (2008).\n[14] G. Hu, J. Yang, and W. Liu, Phys. Rev. E 58, 4440 (1998).\n[15] A. S. Pikovsky, Z. Phys. B 55, 149 (1984).\n[16] N. Platt, E. A. Spiegel, and C. Tresser, Phys. Rev. Lett. 70, 279 (1993).\n[17] E. Ott and J. C. Sommerer, Phys. Lett. A 188, 39 (1994).\n\n\f"}