{"id": "http://arxiv.org/abs/1105.0202v1", "guidislink": true, "updated": "2011-05-01T20:39:20Z", "updated_parsed": [2011, 5, 1, 20, 39, 20, 6, 121, 0], "published": "2011-05-01T20:39:20Z", "published_parsed": [2011, 5, 1, 20, 39, 20, 6, 121, 0], "title": "The behaviour of Fenchel-Nielsen distance under a change of pants\n  decomposition", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.6019%2C1105.2949%2C1105.2029%2C1105.2360%2C1105.0142%2C1105.2621%2C1105.1119%2C1105.2971%2C1105.0880%2C1105.4572%2C1105.3721%2C1105.2665%2C1105.2957%2C1105.3700%2C1105.0659%2C1105.1619%2C1105.5499%2C1105.3657%2C1105.6192%2C1105.5511%2C1105.5674%2C1105.2645%2C1105.5222%2C1105.3757%2C1105.1388%2C1105.0761%2C1105.1113%2C1105.0918%2C1105.5296%2C1105.5139%2C1105.3040%2C1105.3402%2C1105.6256%2C1105.0061%2C1105.6089%2C1105.3404%2C1105.6271%2C1105.3616%2C1105.3672%2C1105.0836%2C1105.2932%2C1105.5972%2C1105.0444%2C1105.3497%2C1105.5317%2C1105.4796%2C1105.1304%2C1105.6352%2C1105.5801%2C1105.5055%2C1105.4165%2C1105.6283%2C1105.5199%2C1105.5604%2C1105.3870%2C1105.5320%2C1105.5491%2C1105.1046%2C1105.2587%2C1105.2354%2C1105.0397%2C1105.2731%2C1105.5217%2C1105.0796%2C1105.2903%2C1105.4487%2C1105.1073%2C1105.5410%2C1105.4074%2C1105.5092%2C1105.5274%2C1105.4709%2C1105.3724%2C1105.0308%2C1105.4654%2C1105.3552%2C1105.5861%2C1105.3615%2C1105.0055%2C1105.5101%2C1105.1174%2C1105.4651%2C1105.4431%2C1105.1392%2C1105.5673%2C1105.0220%2C1105.5636%2C1105.4065%2C1105.4602%2C1105.0422%2C1105.2637%2C1105.5564%2C1105.3989%2C1105.5457%2C1105.4560%2C1105.3337%2C1105.3442%2C1105.0202%2C1105.4237%2C1105.3113%2C1105.3862&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The behaviour of Fenchel-Nielsen distance under a change of pants\n  decomposition"}, "summary": "Given a topological orientable surface of finite or infinite type equipped\nwith a pair of pants decomposition $\\mathcal{P}$ and given a base complex\nstructure $X$ on $S$, there is an associated deformation space of complex\nstructures on $S$, which we call the Fenchel-Nielsen Teichm\\\"uller space\nassociated to the pair $(\\mathcal{P},X)$. This space carries a metric, which we\ncall the Fenchel-Nielsen metric, defined using Fenchel-Nielsen coordinates. We\nstudied this metric in the papers \\cite{ALPSS}, \\cite{various} and\n\\cite{local}, and we compared it to the classical Teichm\\\"uller metric (defined\nusing quasi-conformal mappings) and to another metric, namely, the length\nspectrum, defined using ratios of hyperbolic lengths of simple closed curves\nmetric. In the present paper, we show that under a change of pair of pants\ndecomposition, the identity map between the corresponding Fenchel-Nielsen\nmetrics is not necessarily bi-Lipschitz. The results complement results\nobtained in the previous papers and they show that these previous results are\noptimal.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1105.6019%2C1105.2949%2C1105.2029%2C1105.2360%2C1105.0142%2C1105.2621%2C1105.1119%2C1105.2971%2C1105.0880%2C1105.4572%2C1105.3721%2C1105.2665%2C1105.2957%2C1105.3700%2C1105.0659%2C1105.1619%2C1105.5499%2C1105.3657%2C1105.6192%2C1105.5511%2C1105.5674%2C1105.2645%2C1105.5222%2C1105.3757%2C1105.1388%2C1105.0761%2C1105.1113%2C1105.0918%2C1105.5296%2C1105.5139%2C1105.3040%2C1105.3402%2C1105.6256%2C1105.0061%2C1105.6089%2C1105.3404%2C1105.6271%2C1105.3616%2C1105.3672%2C1105.0836%2C1105.2932%2C1105.5972%2C1105.0444%2C1105.3497%2C1105.5317%2C1105.4796%2C1105.1304%2C1105.6352%2C1105.5801%2C1105.5055%2C1105.4165%2C1105.6283%2C1105.5199%2C1105.5604%2C1105.3870%2C1105.5320%2C1105.5491%2C1105.1046%2C1105.2587%2C1105.2354%2C1105.0397%2C1105.2731%2C1105.5217%2C1105.0796%2C1105.2903%2C1105.4487%2C1105.1073%2C1105.5410%2C1105.4074%2C1105.5092%2C1105.5274%2C1105.4709%2C1105.3724%2C1105.0308%2C1105.4654%2C1105.3552%2C1105.5861%2C1105.3615%2C1105.0055%2C1105.5101%2C1105.1174%2C1105.4651%2C1105.4431%2C1105.1392%2C1105.5673%2C1105.0220%2C1105.5636%2C1105.4065%2C1105.4602%2C1105.0422%2C1105.2637%2C1105.5564%2C1105.3989%2C1105.5457%2C1105.4560%2C1105.3337%2C1105.3442%2C1105.0202%2C1105.4237%2C1105.3113%2C1105.3862&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Given a topological orientable surface of finite or infinite type equipped\nwith a pair of pants decomposition $\\mathcal{P}$ and given a base complex\nstructure $X$ on $S$, there is an associated deformation space of complex\nstructures on $S$, which we call the Fenchel-Nielsen Teichm\\\"uller space\nassociated to the pair $(\\mathcal{P},X)$. This space carries a metric, which we\ncall the Fenchel-Nielsen metric, defined using Fenchel-Nielsen coordinates. We\nstudied this metric in the papers \\cite{ALPSS}, \\cite{various} and\n\\cite{local}, and we compared it to the classical Teichm\\\"uller metric (defined\nusing quasi-conformal mappings) and to another metric, namely, the length\nspectrum, defined using ratios of hyperbolic lengths of simple closed curves\nmetric. In the present paper, we show that under a change of pair of pants\ndecomposition, the identity map between the corresponding Fenchel-Nielsen\nmetrics is not necessarily bi-Lipschitz. The results complement results\nobtained in the previous papers and they show that these previous results are\noptimal."}, "authors": ["Athanase Papadopoulos", "Lixin Liu", "Daniele Alessandrini", "Weixu Su"], "author_detail": {"name": "Weixu Su"}, "author": "Weixu Su", "links": [{"href": "http://arxiv.org/abs/1105.0202v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1105.0202v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.GT", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.GT", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1105.0202v1", "affiliation": "MPI", "arxiv_url": "http://arxiv.org/abs/1105.0202v1", "arxiv_comment": null, "journal_reference": "Communications in Analysis and Geometry 20 (2012), n. 2, 369-396", "doi": null, "fulltext": "THE BEHAVIOUR OF FENCHEL-NIELSEN DISTANCE UNDER\nA CHANGE OF PANTS DECOMPOSITION\n\narXiv:1105.0202v1 [math.GT] 1 May 2011\n\nD. ALESSANDRINI, L. LIU, A. PAPADOPOULOS, AND W. SU\nAbstract. Given a topological orientable surface of finite or infinite type\nequipped with a pair of pants decomposition P and given a base complex\nstructure X on S, there is an associated deformation space of complex structures on S, which we call the Fenchel-Nielsen Teichmüller space associated to\nthe pair (P, X). This space carries a metric, which we call the Fenchel-Nielsen\nmetric, defined using Fenchel-Nielsen coordinates. We studied this metric in\nthe papers [1], [2] and [3], and we compared it to the classical Teichmüller metric (defined using quasi-conformal mappings) and to another metric, namely,\nthe length spectrum, defined using ratios of hyperbolic lengths of simple closed\ncurves metric. In the present paper, we show that under a change of pair of\npants decomposition, the identity map between the corresponding FenchelNielsen metrics is not necessarily bi-Lipschitz. The results complement results\nobtained in the previous papers and they show that these previous results are\noptimal.\n\nAMS Mathematics Subject Classification: 32G15 ; 30F30 ; 30F60.\nKeywords: Teichmüller space, Fenchel-Nielsen coordinates, Fenchel-Nielsen metric.\nL. Liu and W. Su are partially supported by NSFC grant No. 10871211.\n\nContents\n1. Introduction\n2. The Fenchel-Nielsen metric\n3. The effect of an elementary move on the torus with one hole\n4. The effect of an elementary move on the sphere with four holes\n5. Comparing Fenchel-Nielsen distances\n6. General surfaces\nReferences\n\n1\n3\n5\n8\n12\n13\n17\n\n1. Introduction\nThis paper is in the lineage of the papers [1], [2], [3] and [6], in which we studied\nand compared various metrics on Teichmüller spaces of surfaces of finite or of infinite\ntopological type. The first important thing to know in that respect is that some\ndefinitions that are equivalent to each other in the Teichmüller theory of surfaces\nof finite type are no more equivalent in the setting of surfaces of infinite type.\nIndeed, there are Teichmüller spaces that are associated to a surface of infinite\ntype that are distinct (in the set-theoretic sense) and that would be equal if the\nsame definitions were made in the case of a surface of finite type. Furtermore,\neach such space associated to a surface of finite or of infinite type carries a natural\nDate: September 21, 2018.\n1\n\n\f2\n\nD. ALESSANDRINI, L. LIU, A. PAPADOPOULOS, AND W. SU\n\ndistance function, and it is an interesting problem to study the relations between\nthe various spaces, their distance functions and their topologies.\nIt is necessary to have different names to the various spaces that arise, and we\nbriefly recall the terminology.\nWe use the name quasi-conformal Teichmüller space for the \"classical\" Teichmüller space defined using quasi-conformal mappings and equipped with its\nTeichmüller metric.\nIn the paper [1], we introduced the Fenchel-Nielsen Teichmüller space, a certain\nspace of equivalence classes of complex structures on a surface, equipped with a\ndistance, called the Fenchel-Nielsen distance, defined using Fenchel-Nielsen coordinates. This Teichmüller space and its metric depend on the choice of a pair of\npants decomposition of the surface. The Fenchel-Nielsen Teichmüller space was a\nfundamental tool in our work, because it has explicit coordinates and an explicit\ndistance function, and we used it in the other papers mentioned to describe and\nunderstand the other Teichmüller spaces. One of the results obtained was that\nif the lengths of all the boundary curves of the pair of pants decomposition are\nbounded above by a uniform constant then there is a set-theoretic equality between\nthe Fenchel-Nielsen Teichmüller space and the quasiconformal Teichmüller space.\nFurthermore, the identity map between the two Teichmüller spaces, equipped with\ntheir respective metrics, is a locally bi-Lipschitz homeomorphism. This gives an\nexplicit description of the global topology and the local metric properties of the\nquasiconformal Teichmüller space.\nIn the paper [3], we obtained similar local comparison results between the FenchelNielsen Teichmüller space and the so-called length spectrum Teichmüller space, another deformation space of complex structures, whose definition and metric are\nbased on the comparison of lengths of simple closed curves between surfaces.\nIn the cases of surfaces of finite type, the various Teichmüller spaces coincide\nset-theretically, but there are still interesting questions on the local and global\ncomparison of the metrics that are defined on these spaces.\nIn the present paper, we prove that under a change of the pair of pants decomposition, the identity map between the corresponding Fenchel-Nielsen Teichmüller\nspaces is not bi-Lipschitz in general. This result holds for surfaces of finite and\nfor those of infinite type. We first prove this result in the case where the surface\nis a torus with one hole or a sphere with four holes. In this case, the two pair of\npants decompositions are obtained from each other by a single elementary move.\nThe proof is based on explicit computations that use formulae obtained by Okai in\n[8]. We then deduce an analogous result for arbitrary surfaces of finite or of infinite\ntype.\nTo state the theorems precisely, we now introduce some minimal amount of\nnotation. We refer the reader to Section 2 for more details.\nIf X0 is a surface equipped with a complex structure, we denote by Tqc (X0 )\nthe quasi-conformal Teichmüller space of X0 , equipped with the quasi-conformal\ndistance dqc , and by TF N,P (X0 ) the Fenchel-Nielsen Teichmüller space of X0 with\nreference to the pair of pants decomposition P, equipped with its associated FenchelNielsen distance dF N,P .\nIn Section 6 we prove the following:\nTheorem 1.1. Let S be an orientable surface which is either of finite topological\ntype of negative Euler characteristic and which is not a pair of pants, or of infinite\ntopological type. Let P be a pair of pants decomposition of S. Then we have the\nfollowing:\n(1) There exists another pair of pants decomposition P′ such that for every base\ncomplex structure X0 on S we have TF N,P (X0 ) = TF N,P′ (X0 ) as sets, but\n\n\fFENCHEL-NIELSEN COORDINATES\n\n3\n\nthe identity map between the two spaces equipped with their Fenchel-Nielsen\ndistances dF N,P and dF N,P′ respectively is not Lipschitz.\n(2) For every base complex structure X0 on S, consider the space T = Tqc (X0 )∩\nTF N,P(X0 ). Then the identity map from (T, dF N,P ) to (T, dqc ) is not Lipschitz.\n(3) If S is of infinite topological type, there exists a base complex structure X0\non S and another pair of pants decomposition P′ such that if T is the space\nTqc (X0 ) ∩ TF N,P (X0 ), then the identity map from (T, dF N,P ) to (T, dF N,P′ )\nis not continuous.\n(4) If S is of infinite topological type, there exists a base complex structure X0\non S such that if T is the space Tqc (X0 ) ∩ TF N,P (X0 ), then the identity\nmap from (T, dF N,P ) to (T, dqc ) is not continuous.\nFrom this result, we can see that the local comparison results we obtained in\nthe papers [1] and [3] are optimal in the sense that they cannot be extended to\nglobal comparison results, since the global metric geometry of the Fenchel-Nielsen\ndistance depends on the choice of the pair of pants decomposition.\n2. The Fenchel-Nielsen metric\nIn this section, we recall a few facts from our previous papers, which will help\nmaking the present paper self-contained.\nLet S be an orientable connected surface of finite or of infinite topological type,\nthat can have punctures and/or compact boundary components. The complex\nstructures that we consider on S are such that each boundary component has a\nregular neighborhood that is bi-holomorphically equivalent to a bounded cylinder\nand each puncture has a neighborhood that is bi-holomorphically equivalent to a\npunctured disc.\nWe start by reviewing the definition of the Fenchel-Nielsen metric on the Teichmüller space T(S) of S. The definition depends on the choice of a pair of pants\ndecomposition of S.\nA pair of pants decomposition P = {Ci i = 1, 2, . . .} of S is a decomposition\ninto generalized pairs of pants glued along their boundary components, where a\ngeneralized pair of pants is a sphere with three holes, a hole being either a point\nremoved (leaving a puncture on the pair of pants) or an open disc removed (leaving\na boundary component on the pair of pants). The curves Ci in the above definition\nare the closed curves on S (including the boundary components) that define the\ndecomposition. It is well-known that every surface of finite topological type with\nnegative Euler characteristic admits a pair of pants decomposition. It also follows\nfrom the classification of surfaces of infinite type that every such surface admits a\npair of pants decomposition [1].\nTo every complex structure on S we can associate a hyperbolic metric, called\nthe intrinsic metric, which was defined by Bers in [4]. This metric is conformally\nequivalent to the given complex structure, and every boundary curve is a geodesic\nfor that metric. The definition of the intrinsic metric is recalled in [1]. In the sequel,\nwhen we talk about geometric objects (geodesics, length, angles, etc.) associated to\na complex structure on S, it is understood that these are associated to the intrinsic\nmetric on S. A pair of pants decomposition P = {Ci } of the surface S equipped\nwith its intrinsic metric is said to be geodesic if each Ci is a geodesic closed curve in\nS with respect to this metric. In [1] we proved that every topological pair of pants\ndecomposition of S is homotopic to a unique geodesic pair of pants decomposition.\n(Note that this is not true for general hyperbolic metrics on S. For example, the\nPoincaré metric of S may not satisfy this property if this metric is different from\nthe intrinsic metric, and this may happen; we discussed this fact in [1].)\n\n\f4\n\nD. ALESSANDRINI, L. LIU, A. PAPADOPOULOS, AND W. SU\n\nGiven a closed curve C on the surface S, we make the convention that we shall\ncall also C the unique geodesic representative of this closed curve with reference to\nthe intrinsic metric.\nGiven a complex structure X on S and a geodesic pair of pants decomposition\nP = {Ci } of this surface, then for any closed geodesic Ci ∈ P there is a welldefined length parameter lX (Ci ), which is the length of this closed geodesic, and\na twist parameter τX (Ci ), which is defined only if Ci is not the homotopy class\nof a boundary component of S. The quantity τX (Ci ) is a measure of the relative\ntwist amount along the geodesic Ci between the two generalized hyperbolic pair of\npants (which might be the same) having this geodesic in common. In this paper,\nthe value τX (Ci ) is a signed distance-parameter, that is, it represents an amount of\ntwisting in terms of a distance measured along the curve, as opposed to an angle of\ntwisting parameter (whose absolute value would vary by 2π after a complete Dehn\ntwist).\nFor any complex structure X on S, its Fenchel-Nielsen parameter relative to P\nis a collection of pairs\n((lX (Ci ), τX (Ci )))i=1,2,...\nwhere it is understood that if Ci is a boundary geodesic, then it has no associated\ntwist parameter, and instead of a pair (lX (Ci ), τX (Ci )), we have a single parameter\nlX (Ci ).\nGiven two complex structures X and X ′ on S, their Fenchel-Nielsen distance\n(with respect to P) is defined as\n\n(1)\n\ndF N (X, X ′ ) = sup max\ni=1,2,...\n\n\u0012\n\nlog\n\n\u0013\nlX (Ci )\n, |τX (Ci ) − τX ′ (Ci )| ,\nlX ′ (Ci )\n\nagain with the convention that if Ci is a boundary component of S and therefore\nhas no associated twist parameter, we consider only the first factor.\nIf S is a surface of finite topological type, then dF N (X, X ′ ) is always finite, and\nthe function dF N defines a distance on the Teichmüller space of S, which we will\ndenote simply by T(S). If, instead, S is of infinite topological type, dF N (X, X ′ )\ncan assume the value infinity. In this case we fix a base complex structure X0 on S,\nand we define the Fenchel-Nielsen Teichmüller space of X0 as the set of homotopy\nclasses of complex structures X on S such that dF N (X0 , X) is finite. We denote\nthis space by TF N (X0 ). The function dF N is a distance function in the usual sense\non this space, and it makes it isometric to the sequence space l∞ .\nWhen it is important to stress on the dependence on a given pair of pants decomposition P, we shall denote the Teichmüller space by TF N,P (X0 ) (this dependence\nof the space on P may happen only for surfaces of infinite type), and the FenchelNielsen distance by dF N,P (the distance function depends on P also for a surface of\nfinite type).\nIf a pair of pants decomposition P is obtained from another pair of pants decomposition P′ by a finite number of elementary moves (represented in Figures\n1 and 2 below), then for any basepoint X0 we have the set-theoretic equality\nTF N,P (X0 ) = TF N,P′ (X0 ).\nIn the last section of this paper we will prove that for every surface S, there exist\ntwo pair of pants decompositions P, P′ such that for every base complex structure\nX0 , the Fenchel-Nielsen Teichmüller spaces are the same (that is, we have a settheoretical equality TF N,P (X0 ) = TF N,P′ (X0 )), but the identity map between the\ntwo spaces is not Lipschitz with reference to the two Fenchel-Nielsen distances\ndF N,P and dF N,P′ .\n\n\fFENCHEL-NIELSEN COORDINATES\n\n5\n\n3. The effect of an elementary move on the torus with one hole\nIn this section, the surface S = S1,1 is a torus with one hole, where the hole can\nbe either a boundary component or a puncture. A pair of pants decomposition of\nS is determined by a unique simple closed curve on S which is not homotopic to a\npoint or to the hole.\nWe consider two distinct pair of pants decomposition {α} and {α′ } of S defined\nby two essential simple closed curves α and α′ satisfying i(α, α′ ) = 1, as represented\nin Figure 1.\n\nPSfrag replacements\nα\nα′\nl0\n(a)\n(b)\n\nFigure 1. The two curves α and α′ intersect at one point. An elementary move replaces one of these curves by the other one.\n\nLet X be a complex structure on S, equipped with its intrinsic hyperbolic metric.\nAt the hole, X can have geodesic boundary, and in this case we denote by l0 its\nlength, or it can have a cusp, and in this case we write l0 = 0. We denote by (l, τ )\nthe length and twist parameters of the curve α, for the decomposition {α}, and\nby (l′ , τ ′ ) the length and twist parameters of the curve α′ , for the decomposition\n{α′ }. We need a formula relating these values. This was done by Okai ([8]) in the\ncase where the hole is a boundary component, but we also need similar formulae\nfor the case of a cusp. In the following proposition we obtain this with a continuity\nargument. In these formulae, the case where l0 = 0 means that at the hole the\nsurface has a cusp.\nProposition 3.1. With the above notation we have, for all l0 ≥ 0,\n\u0012\n\u00131/2\ncosh(l) + cosh(l0 /2)\n−1\n′\ncosh(l /2) = sinh (l/2) cosh(τ /2)\n2\n\b\n2\n′\ncosh(τ /2) = cosh(l/2) cosh (τ /2)(cosh(l) + cosh(l0 /2)) − 2 sinh2 (l/2)\n\b\n1/2\ncosh2 (τ /2)(cosh2 (l/2) + cosh2 (l0 /2)) + sinh2 (l/2) cosh(l0 /2)\n.\n\n1/2\n\nProof. When l0 > 0, these formulae are proved in [8]. To see that they also hold\nwhen l0 = 0 (the case of a cusp) we use the shear coordinates relative to an ideal\ntriangulation. We recall that in the case of a torus with one hole equipped with a\ncomplex structure (and the corresponding intrinsic metric), an ideal triangulation\nhas three edges, say a, b, c, and associated to every edge there is a real number,\ncalled the shear parameter. Thus, we have three numbers, sa , sb , sc . The boundary\nlength l0 can be read from the shear coordinates: l0 = |sa + sb + sc | (see [10, Prop.\n3.4.21]), and the cusp corresponds to the case where sa + sb + sc = 0. Here we\nneed the property that the parameters l, |τ |, l′ , |τ ′ | can also be written as continuous\nfunctions of the shear coordinates. To see this one can show that for every element γ\nof the fundamental group of the surface, the coefficients of the matrix corresponding\n\n\f6\n\nD. ALESSANDRINI, L. LIU, A. PAPADOPOULOS, AND W. SU\n\nto γ in the holonomy representation can be written as continuous functions of the\nshear coordinates. The length of the corresponding closed geodesic in the surface\nis a continuous function of the trace of this matrix, hence all simple closed curve\nlengths are continuous functions of the shear coordinates. For the twist parameters,\nwe note that their absolute values can be written as a continuous function of the\nlengths of some simple closed curves.\nTo show that the above formulae are valid for l0 = 0, we just need to note that\nboth the left hand side and the right hand side of the equations are continuous\nfunctions of the shear coordinates. It is known that shear coordinates extend to\nthe case of surfaces with cusps (see [10, Chapter 3]), see also [9]). Then as these\nfunctions are equal when l0 > 0, i.e. when sa + sb + sc 6= 0, and as this subset is\ndense in the space of shear coordinates, these functions are equal everywhere, that\nis, including the case where l0 = 0.\n\u0003\nFor simplicity, we choose a complex structure X on the torus with one hole\nsuch that its intrinsic metric has the property that the two closed geodesics in the\nhomotopy classes of α and α′ meet perpendicularly. To see that such a choice is\npossible, we can start with an arbitrary complex structure on S (equipped with its\nintrinsic metric) and we cut this surface along the closed geodesic α; in this way α′\nis cut into an essential geodesic arc, which is homotopic to a unique geodesic arc β\nthat is perpendicular to the two boundary components of Y \\ {α} that arise from\ncutting the surface along α. Then we glue back the two components in such a way\nthat in the resulting surface the two endpoints of β match. We obtain a complex\nstructure with the desired property. Such a complex structure corresponds to the\ncase τ = 0 in the notation of Okai [8].\nPerforming a Fenchel-Nielsen twist of magnitude t along α, we obtain from X a\nnew complex structure X t that has Fenchel-Nielsen coordinates denoted by (l, τt )\nin the coordinate system associated to {α} and (lt′ , τt′ ) in the coordinate system\nassociated to {α′ }. The coordinates of the complex structure X that we have\nchosen are (l, 0) and (l′ , 0) in the bases {α} and {α′ } respectively.\nSince X t is obtained by a time-t twist along the curve α, we have τt = t for all t.\nWe need to estimate lt′ and τt′ .\nBy the formula for length in Proposition 3.1, we have\n−1\n\n′\n\ncosh(l /2) = sinh\n\n(l/2)\n\n\u0012\n\ncosh(l) + cosh(l0 /2)\n2\n\n\u00131/2\n\nand\ncosh(lt′ /2)\n\n−1\n\n= sinh\n\n(l/2) cosh(t/2)\n\n\u0012\n\ncosh(l) + cosh(l0 /2)\n2\n\nThus, we have\n′\n\n′\n\n′\n\n′\n\ncosh(lt′ /2)\nelt /2−l /2 + e−lt /2−l /2\ncosh(t/2) =\n=\n.\ncosh(l′ /2)\n1 + e−l′\nUsing the fact that x ≤ ex , we obtain\n′\n\n′\n\n′\n\n0 ≤ lt′ /2 − l′ /2 ≤ elt /2−l /2 ≤ cosh(t/2)(1 + e−l )\nwhich implies\n′\n\n0 < lt′ /2 ≤ l′ /2 + cosh(t/2)(1 + e−l ).\n\n\u00131/2\n\n.\n\n\fFENCHEL-NIELSEN COORDINATES\n\n7\n\nAs a result, and using lt′ ≥ l′ (which follows from our hypothesis that α and α′\nmeet perpendicularly for t = 0), we have\n0 ≤ log\n\nlt′\nl′\n\n′\n\n≤ log\n\nl′ /2 + cosh(t/2)(1 + e−l )\nl′ /2\n′\n\n2 cosh(t/2)(1 + e−l )\n= log 1 +\nl′\n\n!\n\n′\n\n2 cosh(t/2)(1 + e−l )\n.\nl′\nNow we estimate the twist parameter, using the formula for the twist in Proposition 3.1. For the purpose of the computations, we use the following notation:\n\u0001\nA = cosh2 (l/2) cosh2 (t/2) (cosh(l) + cosh(l0 /2)) − 2 sinh2 (l/2)\n≤\n\nand\n\n\u0001\nB = cosh2 (t/2) cosh2 (l/2) + cosh(l0 /2) + sinh2 (l/2) cosh(l0 /2).\nThe quantities A and B are functions of t and l, and we have\nA\ncosh2 (τt′ /2) = .\nB\nWe shall focus on the case where l is small and t, l0 are bounded.\nConsider the second order expansions near l = 0.\ncosh2 (l/2) = 1 + l2 /4 + O(l4 ),\ncosh(l) = 1 + l2 /2 + O(l4 ),\nsinh2 (l/2) = l2 /4 + O(l4 ).\nThen we have\nA\n\n=\n×\n\n\u0001\n1 + l2 /4 + O(l4 ) ×\n\n\u0001\n\u0001\u0001\u0001\ncosh2 (t/2) 1 + l2 /2 + O(l4 ) + cosh(l0 /2) − l2 /4 + O(l4 )\n\n= cosh2 (t/2) (1 + cosh(l0 /2))\n+\nand\n\n\u0001 l2\n+ O(l4 )\n3 cosh2 (t/2) − 2 + cosh2 (t/2) cosh(l0 /2)\n4\n\n\u0001\n\u0001\n= cosh2 (t/2) 1 + l2 /4 + O(l4 ) + cosh(l0 /2) + l2 /4 + O(l4 ) cosh(l0 /2)\n\u0001 l2\n= cosh2 (t/2) (1 + cosh(l0 /2)) + cosh2 (t/2) + cosh(l0 /2)\n+ O(l4 ).\n4\nThis gives\n\nB\n\n\u0001 l2\n2 cosh2 (t/2) − 2 + cosh2 (t/2) cosh(l0 /2) − cosh(l0 /2)\n+ O(l4 )\n4\n1\n=\n(2 + cosh(l0 /2)) sinh2 (t/2)l2 + O(l4 ).\n4\nNote that the term O(l4 ) in the previous formula depends on l0 and |t| only via\ncontinuous functions of l0 , |t|. In particular, there exists an ǫ > 0 such that for l < ǫ\nwe have\nA − B ≤ Cl2\nwhere C is a constant that depends only on ǫ and the upper bound of l0 , |t|.\nA−B\n\n=\n\n\f8\n\nD. ALESSANDRINI, L. LIU, A. PAPADOPOULOS, AND W. SU\n\nNote that A ≥ B > 1. From this and the properties of the logarithm function\nwe obtain\nlog cosh2 (τt′ /2) = log\n\nA\n= log A − log B ≤ A − B.\nB\n\nThus, we have\n\nlog cosh2 (τt′ /2) ≤ Cl2 .\nFrom the continuity of the cosh function, if |τt′ | is bounded, then there is a constant K that depends only on the upper bound for |τt′ | such that |τt′ | ≤ K log cosh(τt′ /2).\nTherefore,\n|τt′ | ≤ M l\nwhere M is a constant that depends only on the upper bound of l, l0 , |t|.\nWe record the above results for the length and twist parameters in the following\nproposition.\nProposition 3.2. Let X be a complex structure on S1,1 with the following properties:\n(1) X has either geodesic boundary of length l0 , or a cusp (and in the latter\ncase we write l0 = 0);\n(2) there exist a pair of perpendicular simple closed geodesics α, α′ on X with\ni(α, α′ ) = 1.\nt\nLet X be the complex structure obtained from X by performing a Fenchel-Nielsen\ntwist of magnitude t along α. Let (l, τt ) and (lt′ , τt′ ) be the Fenchel-Nielsen coordinates of X t in the coordinate systems associated to {α} and {α′ } respectively.\n(Note that l0′ = l′ .)\nAssume l0 and |t| are bounded above by some constant L > 0. Then there exist\nconstants M and ǫ0 > 0, both depending only on L, such that for all l ≤ ǫ0 , we\nhave\n′\nl′\n2 cosh(t/2)(1 + e−l )\n4 cosh(t/2)\n(2)\nlog t′ ≤\n≤\nl\nl′\n| log l|\nand\n|τt′ | ≤ M l.\nNote that the second inequality in (2) follows from one version of the Collar\nLemma, which says that there exists ǫ > 0 such that for l ≤ ǫ0 , we have l′ ≥ | log l|.\n4. The effect of an elementary move on the sphere with four holes\nIn this section, the surface S = S0,4 is the sphere with four holes, where each\nhole can be either a boundary component or a cusp. We equip S with two pair\nof pants decompositions {α}, {α′ }, defined by two essential simple closed geodesics\nsatisfying i(α, α′ ) = 2.\nLet X be a complex structure on S equipped with its intrinsic metric. Near\neach of the four holes, X can have a geodesic boundary, or a cusp. We denote by\nl1 , l2 , l3 , l4 the lengths of the boundary components (as before with the convention\nthat li is zero if the corresponding hole is a cusp); see Figure 2. We denote by l, τ\nthe length and twist parameter respectively of the curve α, for the decomposition\n{α}, and by l′ , τ ′ the length and twist parameter respectively of the curve α′ , for\nthe decomposition {α′ }. We need a formula relating these values. Like in the case\nof the torus with one hole, Okai wrote such formulae in [8] in the case where all the\nholes are boundary components, and we need to see that the formulae also hold in\nthe case where some of the holes are cusps. In the following proposition we deduce\nthis by a continuity argument, as we did in the previous section for the case of the\none-holed torus.\n\n\fFENCHEL-NIELSEN COORDINATES\n\n9\n\nProposition 4.1. With the above notation we have\ncosh(l′ /2) = sinh−2 (l/2){cosh(l1 /2) cosh(l2 /2) + cosh(l3 /2) cosh(l4 /2)\n+ cosh(l/2) [cosh(l1 /2) cosh(l3 /2) + cosh(l2 /2) cosh(l4 /2)] + cosh(τ )[cosh2 (l/2)\n+2 cosh(l1 /2) cosh(l4 /2) cosh(l/2) + cosh2 (l1 /2) + cosh2 (l4 /2) − 1]1/2 [cosh2 (l/2)\n+2 cosh(l2 /2) cosh(l3 /2) cosh(l/2) + cosh2 (l2 /2) + cosh2 (l3 /2) − 1]1/2 }\nand\ncosh(τ ′ ) = {cosh2 (l1 /2) + cosh2 (l2 /2) + 2 cosh(l1 /2) cosh(l2 /2) cosh(l′ /2)\n+ sinh2 (l′ /2)}−1/2 {cosh2 (l3 /2) + cosh2 (l4 /2) + 2 cosh(l3 /2) cosh(l4 /2) cosh(l′ /2)\n+ sinh2 (l′ /2)}−1/2 {sinh2 (l′ /2) cosh(l/2)−cosh(l1 /2) cosh(l4 /2)−cosh(l2 /2) cosh(l3 /2)\n− cosh(l′ /2)[cosh(l1 /2) cosh(l3 /2) + cosh(l2 /2) cosh(l4 /2)]}\nProof. When all the boundary lengths are positive (l1 , l2 , l3 , l4 > 0) these formulae\nare proved in [8]. To see that they also hold when some li is zero, we proceed as in\nthe proof of Proposition 3.1. We fix an ideal triangulation, now having 6 edges, so\nwe have 6 shear coordinates. For i = 1 . . . 4 the length li can be expressed as the\nabsolute value of the sum of the shear coordinates relative to the edges adjacent\nto the hole involved (see [10, Prop. 3.4.21]), and the cusp corresponds to the case\nwhere this sum is zero. With exactly the same argument as in Proposition 3.1 we\ncan see that the parameters l, |τ |, l′ , |τ ′ | can be written as continuous functions of\nthe shear coordinates. Hence both the left hand side and the right hand side of\nthe equations are continuous functions of the shear coordinates. As these functions\nare equal when l1 , l2 , l3 , l4 > 0, and as this subset is dense in the space of shear\ncoordinates, the functions are equal everywhere, including on the set where the\nvalues li are zero.\n\u0003\nLike in the case of the torus with one hole, we choose X such that α and α′\nintersect perpendicularly, in order to simplify the computations. Performing a\nFenchel-Nielsen twist of magnitude t along α, we obtain from X a new complex\nstructure X t and we denote its Fenchel-Nielsen coordinates (l, τt ) in the coordinate\nsystem associated to {α} and (lt′ , τt′ ) in the coordinate system associated to {α′ }.\nAs before we have τt = t. Then we also have the following proposition.\nα′\nl1\n\nl4\n\nPSfrag replacements\nα\n\nl2\n\nl3\n\nFigure 2. An elementary move on the sphere with four holes replaces\none of the interior curves drawn by the other one.\n\nProposition 4.2. Let X be a complex structure on S0,4 with the following properties:\n\n\f10\n\nD. ALESSANDRINI, L. LIU, A. PAPADOPOULOS, AND W. SU\n\n(1) every hole of X is a geodesic boundary component or a cusp, with lengths\ndenoted by l1 , l2 , l3 , l4 (with the convention that li is zero if the corresponding\nhole is a cusp);\n(2) there exist a pair of perpendicular simple closed geodesics α, α′ on X with\ni(α, α′ ) = 2.\nLet X t be the complex structure obtained from X by performing a Fenchel-Nielsen\ntwist of magnitude t along α. Let (l, τt ) and (lt′ , τt′ ) be the Fenchel-Nielsen coordinates of X t in the coordinate systems associated to {α} and {α′ } respectively.\n(Note that l0′ = l′ .)\nThen, if l1 , l2 , l3 , l4 and |t| are bounded from above by some constant L, there\nexist constants K, M, ǫ0 > 0, all of them depending only on L, such that for l ≤ ǫ0\nwe have\n′\n\n(3)\n\nlog\n\nK(1 + e−l )\n2K\nlt′\n≤\n≤\n.\n′\nl\nl′\n| log l|\n\nand\n|τt′ | ≤ M l.\nProof. We note as in the case studied before that the second inequality in (3) follows\nfrom the Collar Lemma.\nTo prove the proposition, we use the formulae in Proposition 4.1. Setting\nA = cosh(l1 /2) cosh(l2 /2) + cosh(l3 /2) cosh(l4 /2)\n+ cosh(l/2) [cosh(l1 /2) cosh(l3 /2) + cosh(l2 /2) cosh(l4 /2)]\nand\nB = [cosh2 (l/2)+2 cosh(l1 /2) cosh(l4 /2) cosh(l/2)+cosh2 (l1 /2)+cosh2 (l4 /2)−1]1/2\n[cosh2 (l/2) + 2 cosh(l2 /2) cosh(l3 /2) cosh(l/2) + cosh2 (l2 /2) + cosh2 (l3 /2) − 1]1/2 ,\nthe formula for the length parameter l′ becomes\ncosh(lt′ /2) = sinh−2 (l/2) (A + cosh(t)B) .\nFor t = 0, this formula becomes\ncosh(l′ /2) = sinh−2 (l/2) (A + B) .\nThus, we have\n(A + cosh(t)B)\ncosh(lt′ /2)\n=\n≤ K,\n′\ncosh(l /2)\n(A + B)\nwhere K is a constant that depends only on L. Using the same estimates as in\nSection 3, we obtain\n′\nl′\n2K(1 + e−l )\nlog t′ ≤\n.\nl\nl′\nNow we estimate the twist τt′ . We assume that the twist is positive, to avoid\ntaking absolute values. The formula in Proposition 4.1 gives\ncosh(τt′ ) =\n\n(4)\n\nE\n,\nF\n\nwhere\nE = sinh2 (lt′ /2) cosh(l/2) − cosh(l1 /2) cosh(l4 /2) − cosh(l2 /2) cosh(l3 /2)\n− cosh(lt′ /2)[cosh(l1 /2) cosh(l3 /2) + cosh(l2 /2) cosh(l4 /2)]\n\n\fFENCHEL-NIELSEN COORDINATES\n\n11\n\nF = {cosh2 (l1 /2) + cosh2 (l2 /2) + 2 cosh(l1 /2) cosh(l2 /2) cosh(lt′ /2) + sinh2 (lt′ /2)}1/2\n{cosh2 (l3 /2) + cosh2 (l4 /2) + 2 cosh(l3 /2) cosh(l4 /2) cosh(lt′ /2) + sinh2 (lt′ /2)}1/2 .\nNote that E > F for all t 6= 0. Let E1 = E/ sinh2 (lt′ /2), and F1 = F/ sinh2 (lt′ /2).\nAs l → 0, we have l′ → ∞, and E1 , F1 → 1. As a result, we can assume that l\nis sufficiently small, so that E1 and F1 are not less than 1/2. Then\nlog cosh(τt′ ) = log\n\nE\nE1\n≤ 2(E1 − F1 ).\n= log\nF\nF1\n\n(We used the fact that log x − log y ≤ 2(x − y) for 12 ≤ x ≤ y.)\nNow we need to estimate E1 − F1 . To do this, note that by the first formula of\nProposition 3.1, we have\ncosh(lt′ /2) ≥ 8 sinh−2 (l/2).\nUsing the fact that sinh2 (x) = cosh2 (x) − 1 we conclude that if l is small, there\nexists a constant C depending only on ǫ0 such that\nsinh(lt′ /2) ≥\n\nC\n.\nl2\n\nFirst we estimate E1 − cosh(l/2):\n|E1 − cosh(l/2)| = |\n\n−\n\n− cosh(l1 /2) cosh(l4 /2) − cosh(l2 /2) cosh(l3 /2)\nsinh2 (lt′ /2)\n\ncosh(lt′ /2)[cosh(l1 /2) cosh(l3 /2) + cosh(l2 /2) cosh(l4 /2)]\n| ≤ Hl2\nsinh2 (lt′ /2)\n\nwhere H is a constant depending only on L and ǫ0 .\nThen we estimate F1 − 1:\n|F1 − 1| = |{1 +\n\n{1 +\n\ncosh2 (l1 /2) + cosh2 (l2 /2) + 2 cosh(l1 /2) cosh(l2 /2) cosh(lt′ /2) 1/2\n}\nsinh2 (lt′ /2)\n\ncosh2 (l3 /2) + cosh2 (l4 /2) + 2 cosh(l3 /2) cosh(l4 /2) cosh(lt′ /2) 1/2\n} − 1|\nsinh2 (lt′ /2)\n= |(1 + Rl2 + O(l4 ))(1 + Rl2 + O(l4 )) − 1| ≤ 2Sl2\n\nwhere R and S are constants depending only on L and ǫ0 .\nThen, finally:\n|E1 − F1 | ≤\n≤\n\n|E1 − cosh(l/2)| + |F1 − 1| + | cosh(l/2) − 1|\nl2\nHl2 + SL2 + + 0(l4 ).\n2\n\nNow if |τt′ | is small, then there is a constant K such that (τt′ )2 ≤ K log cosh(τt′ ).\n(We use the formula log cosh x = x2 /2 + O(x4 ).) Therefore,\n|τt′ | ≤ M l.\nThis proves Proposition 4.2.\n\n\u0003\n\n\f12\n\nD. ALESSANDRINI, L. LIU, A. PAPADOPOULOS, AND W. SU\n\n5. Comparing Fenchel-Nielsen distances\nWe reformulate Proposition 3.2 and Proposition 4.2 in the following.\nProposition 5.1. Let X be a complex structure on S1,1 or S0,4 that satisfies the\nassumptions in Proposition 3.2 or Proposition 4.2 respectively. Assume that |t|,\nl0 (in the case where S = S1,1 ) and l1 , l2 , l3 , l4 (in the case where S = S0,4 ) are\nbounded above by some constant L. Then there exist constants K, M and ǫ0 > 0,\nall depending only on L such that for l ≤ ǫ0 , we have\nlog\n\nlt′\nK\n≤\nl′\n| log l|\n\nand\n|τt′ | ≤ M l.\nFor S = S1,1 or S0,4 , let dF N1 and dF N2 denote the Fenchel-Nielsen coordinates on T(S) associated to {α} and {α′ } respectively. As above, for any complex\nstructure X on S, we denote by X t the complex structure obtained by the time-t\nFenchel-Nielsen twist of X along α. We have the following:\nProposition 5.2. Suppose that S is either the torus with one hole S1,1 or the\nsphere with four holes S0,4 , with α and α′ being homotopy classes of closed curves\nin S satisfying i(α, α′ ) = 1 in the case S = S1,1 and i(α, α′ ) = 2 in the case\nS = S0,4 . Then, there exist a sequence of points Xn ∈ T(S) such that\ndF N1 (Xn , Xnt ) = |t|, while lim dF N2 (Xn , Xnt ) = 0.\ni→∞\n\nProof. Let Xn , n = 1, 2, . . . be a sequence of complex structures on S satisfying the\nfollowing properties:\n(1) for any n = 1, 2, . . . the geodesics in the classes of α and α′ intersect perpendicularly;\n(2) the hyperbolic length lXn (α) = ǫn tends to 0 as n → ∞;\n(3) the hyperbolic length of the holes of the torus with one hole S1,1 or of the\nsphere with four holes S0,4 is bounded by some fixed constant L.\nIt is clear that dF N1 (Xn , Xnt ) = |t|. By Proposition 5.1, we have\n0 ≤ log\n\nlt′\nK\n≤\n,\n′\nl\n| log ǫn |\n\nand\n|τt′ | ≤ M ǫn .\nAs a result,\ndF N2 (Xn , Xnt ) = max{| log\nas ǫn → 0.\n\nlt′\n|, |τt′ |} → 0,\nl′\n\u0003\n\nWe conclude with the following\nCorollary 5.3. With the notation of Proposition 5.2, the identity map between the\nmetrics dF N1 and dF N2 is not Lipschitz. More precisely, there does not exist any\nconstant C satisfying dF N1 (x, y) ≤ CdF N2 (x, y) for all x and y in T(S).\n\n\fFENCHEL-NIELSEN COORDINATES\n\n13\n\n6. General surfaces\nThe aim of this section is to prove Theorem 1.1, which is the analogue of Corollary 5.3 for an arbitrary surface S of finite or infinite type.\nThe idea is to start with an arbitrary pair of pants decomposition P = {Ci } of\nS, to take in it an embedded subsurface of type S1,1 or S0,4 with boundary curves\nbelonging to the system {Ci }, and to modify the pair of pants decomposition P\ninto a pair of pants decomposition P′ by an elementary move α → α′ performed\ninside this subsurface, according to the scheme used in Sections 3 and 4.\nThere is one complication in doing this. Even though in the new pair of pants\ndecomposition P′ the length parameters of all the non-modified curves for the complex structure X t obtained by twisting along the curve α is the same in the systems\nP and P′ , the situation is not the same for the twist parameters. Performing the\nFenchel-Nielsen twist along the curve α does not modify the twist parameters of\nthe closed curves in the system P that are different from α, but in the system P′ ,\nthe twist parameters of the curves that are on the boundary of the subsurface S1,1\nor S0,4 do not remain constant. This is the main question that we deal with now.\nLet X be a complex structure on S equipped with a geodesic pair of pants\ndecomposition P, and let α ∈ P be a closed geodesic in the interior of X.\nThe closed geodesic α is either in the interior of a torus with one hole or of a\nsphere with four holes that is defined by the pair of pants decomposition P. We\ndenote such a one-holed torus or a four-holed sphere by Y .\nLet P′ be the pair of pants decomposition of X obtained from P by an elementary\nmove on α, replacing this curve with a curve α′ which is contained in Y and which\nhas minimal intersection number with α.\n\nC1\n\nβ\nC4\n\nα\n\nPSfrag replacements\nα′\n\nC3\nC2\n\nFigure 3.\nWe take a sequence Xi of complex structures on S satisfying lXi (α) → 0. By\nthe collar lemma, we then have lXi (α′ ) → ∞.\nWe assume that the curve α is adjacent to two distinct pairs of pants in the\ndecomposition P. The other case can be dealt with in the same way. We shall use\nthe notation of Figure 3.\n\n\f14\n\nD. ALESSANDRINI, L. LIU, A. PAPADOPOULOS, AND W. SU\n\nWe shall apply Proposition 4.2, and for this we assume that X is a complex\nstructure such that lX (α) is sufficiently small.\nLet X t be as before the time-t twist of X along α. Then, dF N (X, X t ) = |t|.\nTo estimate the distance dF N ′ (X, X t ), first apply Proposition 5.1:\nlog\n\nlX t (α′ )\nK\n≤\n,\n′\nlX (α )\n| log lX (α)|\n\n′\n′\n′\n′\n|τX\nt (α ) − τX (α )| ≤ M lX (α).\n\nFor any β ∈ P′ , β 6= α′ , the length is unchanged:\nlog\n\nlX t (β)\n= 0.\nlX (β)\n\n′\n′\nHowever, the equality τX\nt (β) = τX (β) is not necessarily true. Indeed, let C1 , . . . , C4\nbe the boundary components of the sphere with four holes that is the union of the\ntwo pairs of pants of P that contain α (notation of Figure 3). In the Fenchel-Nielsen\ncoordinates of P′ , the length of α′ is changed under the twist along α, and for each\n′\n′\nj = 1, . . . , 4, τX\nt (Cj ) may be not be equal to τX (Cj ).\nHowever, we have the following:\n′\n′\nLemma 6.1. For i = 1, . . . , 4, |τX\nt (Ci ) − τX (Ci )| → 0, as lX (α) → 0.\n\nProof. For the proof, we take i = 1.\nChoose a simple closed curve β as in Figure 3, contained in the 4-holed sphere\nthat is the union of the pair of pants with boundary curves α′ , C1 , C2 and the other\npair of pants adjacent to C1 , such that β satisfies i(C1 , β) = 2 and is disjoint from\nany other curve in P \\ {C1 }, as in Figure 3.\nWe may assume that the angles at the intersection points of C1 with β satisfy\ncos θ ≥ 21 . To achieve this we can choose a sufficiently large integer N , and replace\nβ with its image under an N -order positive Dehn twist along C1 .\nWe now apply the first variational formula of Wolpert [12].\nFor s > 0, we denote by ls (β) the hyperbolic length of β under the twist of\namount s along C1 . Denoting the intersection angles of C1 with β by θ1,s and θ2,s ,\nwe have\ndls (β)\n= cos θ1,s + cos θ2,s .\nds\nBy the mean value theorem, for each s > 0, there exists a ξ ∈ [0, s], such that\n(5)\n\nls (β) − l0 (β) = (cos θ1,ξ + cos θ2,ξ )s.\n\nSince cos θj,s , j = 1, 2 are strictly increasing functions of s (Proposition 3.5 of\nKerckhoff [5]), we have\n(6)\n\ncos θi,ξ ≥ cos θi,0 ≥\n\n1\n,\n2\n\nby assumption. Combining (5) and (6), we have\n(7)\n\nls (β) − l0 (β) ≥ s.\n′\n′\n|τX\nt (C1 )−τX (C1 )|\n′\n\nWe show that\n→ 0 as lX (α) → 0. Note that lX (C1 ) = lX t (C1 )\nand β also intersects α .\nSuppose first that the length of β is decreased by an amount of xt > 0 under\n′\n′\n′\n′\n′\nthe twist of distance t′ = τX\nt (α ) − τX (α ) along α . Then this length should be\nincreased by the same amount xt under the action of the twist along C1 . Note that\nxt ≤ 2|t′ |.\nApplying the inequality (7), we have\n(8)\n\n′\n′\n′\n′\n′\n′\n′\n|τX\nt (C1 ) − τX (C1 )| ≤ 2|t | = 2|τX t (α ) − τX (α )|.\n\n\fFENCHEL-NIELSEN COORDINATES\n\n15\n\n′\n′\nBy Proposition 5.1, t′ → 0 as lX (α) → 0. As a result, |τX\nt (C1 ) − τX (C1 )| → 0 as\nlX (α) → 0.\nThe case where the length of β is increased under the twist along α′ can be dealt\nwith by the same argument.\n\u0003\n\nNow we are ready to prove the various statements of Theorem 1.1.\nLet us summarize the setting. S is an orientable surface which is either of infinite\ntopological type or of finite topological type with negative Euler characteristic and\nwhich is not homeomorphic to a pair of pants. Let P be a pair of pants decomposition of S. Let α ∈ P be a curve which is not a boundary component of S,\nand consider the pair of pants decomposition P′ obtained from P by an elementary\nmove about α. We denote by α′ the curve replacing α in P′ . Let Y be the one-holed\ntorus or four-holed sphere containing α in its interior. If X is a complex structure\non S, and t a real number, we denote by X t the structure obtained by a time-t\nFenchel-Nielsen twist of X along α.\nTheorem 6.2. For every base complex structure X0 on S we have TF N,P(X0 ) =\nTF N,P′ (X0 ) as sets, but the identity map between these two spaces is not Lipschitz\nwith respect to the metrics dF N,P and dF N,P′ respectively. More precisely, there\nexists a sequence of points Xn ∈ TF N,P (X0 ) such that\ndF N,P (Xn , Xnt ) = |t|, while lim dF N,P′ (Xn , Xnt ) = 0.\nn→∞\n\nProof. Let Xn , n = 1, 2, . . . be a sequence of complex structures on S satisfying the\nfollowing properties:\n(1) for any n = 1, 2, . . . the geodesics in the classes of α and α′ intersect perpendicularly;\n(2) the hyperbolic length lXn (α) = ǫn tends to 0 as n → ∞;\n(3) the hyperbolic length of the boundary curves of the pairs of pants containing\nα and α′ is bounded by some fixed constant L.\nIt is clear that dF N,P (Xn , Xnt ) = |t|. By Proposition 5.1, there exists a constant K\nsuch that for all n\nlX t (α′ )\nK\n| log n ′ | ≤\nlXn (α )\n| log ǫn |\nand\n′\n′\n′\n′\n|τX\nt (α ) − τX (α )| ≤ Kǫn .\nn\nn\nIt follows from Lemma 6.1 that for each Cj ∈ P′ \\ {α},\nlim\n\nsup\n\nn→∞ C ∈P′ \\{α}\nj\n\n′\n′\n|τX\nt (Cj ) − τX (Cj )| = 0.\nn\nn\n\nAs a result,\nlim dF N,P′ (Xn , Xnt ) = 0.\n\nn→∞\n\n\u0003\nTheorem 6.3. For every base complex structure X0 on S, consider the space T =\nTqc (X0 ) ∩ TF N,P′ (X0 ). Then the identity map from (T, dF N,P′ ) to (T, dqc ) is not\nLipschitz. More precisely, there exists a sequence of points Xn ∈ T and a constant\nC > 0 such that\ndqc (Xn , Xnt ) ≥ C|t|, while lim dF N,P′ (Xn , Xnt ) = 0.\nn→∞\n\nProof. We use the same sequence as in the previous theorem. We claim that there\nexists a constant C, depending only on the constants L and |t|, and such that\ndqc (Xn , Xnt ) ≥ CdF N,P (Xn , Xnt ) = C|t|. This essentially follows from Theorem 7.6\nin [1], but some special care is needed because, in the form that theorem is stated,\n\n\f16\n\nD. ALESSANDRINI, L. LIU, A. PAPADOPOULOS, AND W. SU\n\none of the hypotheses is not satisfied: that the surfaces Xn are upper bounded, i.e.\nthat there exists a constant M such that for every curve C ∈ P we have lX0 (C) ≤ M .\nThis is not satisfied in general. The point is that here we are performing the twist\non surfaces Xn along the single curve α (while in Theorem 7.6 in [1] we allowed a\nmulti-twist around many curves), so we only need to check that the lengths of the\ncurves of the pairs of pants containing α are bounded by a constant. This is true\nin this case, because we are assuming that the lengths are bounded above by L. To\napply the theorem we also need to check that the lengths dqc (Xn , Xnt ) are bounded\nabove by a constant that depends only on L and |t|. This is given by Lemma 8.3\nin [1], again by paying attention to the fact that, even if the surfaces are not upper\nbounded, we are twisting only around α, and the lengths of the boundary curves\nof the pairs of pants containing α are bounded by L.\n\u0003\nNow assume that S is an orientable surface of infinite topological type and let\nP be a pair of pants decomposition of S. We choose a sequence of curves αi ∈ P\nsuch that the one-holed tori or four-holed spheres Yi containing αi in their interior\nare all disjoint. We also consider another pair of pants decomposition P′ , obtained\nfrom P by performing elementary moves about all the curves αi . For every i, let\nα′i be the curve replacing αi in P′ . Finally, we choose a base complex structure X0\non S satisfying the following:\n(1) lX0 (αi ) → 0 as i → ∞;\n(2) for all i the geodesics in the classes of αi and α′i intersect perpendicularly;\n(3) the lengths of all the curves of the decomposition P are bounded above by\nsome global constant M .\nFor a real number t, we denote by Xi the surface obtained by a time-t FenchelNielsen twist of X0 along αi .\nWe have the following:\nTheorem 6.4. If T is the space Tqc (X0 ) ∩ TF N,P (X0 ), then the identity map from\n(T, dF N,P′ ) to (T, dF N,P ) is not continuous. More precisely, using the above notation, the surfaces Xi are in T , and they satisfy\ndF N,P (X0 , Xi ) = |t|, while lim dF N,P′ (X0 , Xi ) = 0.\ni→∞\n\nProof. Assume that lX0 (αi ) = ǫi → 0. It is clear that dF N,P (X0 , Xi ) = |t|. Applying Proposition 5.1, we have\n| log\n\nlXi (α′i )\nK\n|≤\n,\nlX0 (α′i )\n| log ǫi |\n\nand\n′\n′\n(α′i )| ≤ Kǫi ,\n(α′i ) − τX\n|τX\n0\ni\nwhere K is a constant depending on M . It follows from Lemma 6.1 that for each\nCj ∈ P′ \\ {αi },\n′\n′\n(Cj )| = 0.\n(Cj ) − τX\nlim\nsup\n|τX\n0\ni\ni→∞ Cj ∈P′ \\{αi }\n\nAs a result,\nlim dF N,P′ (X0 , Xi ) = 0.\n\ni→∞\n\n\u0003\nTheorem 6.5. If T is the space Tqc (X0 ) ∩ TF N,P′ (X0 ), then the identity map from\n(T, dF N,P′ ) to (T, dqc ) is not continuous. More precisely, the surfaces Xi defined\nabove are in T , and there exists a constant C > 0 such that\ndqc (X0 , Xi ) ≥ C|t|, while lim dF N,P′ (X0 , Xi ) = 0.\ni→∞\n\n\fFENCHEL-NIELSEN COORDINATES\n\n17\n\nProof. As before, we claim that there exists a constant C, depending only on the\nconstant M and on |t|, such that dqc (Xi , Xit ) ≥ CdF N,P (Xi , Xit ) = C|t|. This\nfollows from Theorem 7.6 in [1]. This time all the hypotheses of that theorem are\nsatisfied, and we only need to check that dqc (Xi , Xit ) is bounded by something that\ndepends only on L and |t|. This is given by Lemma 8.3 in [1].\n\u0003\nReferences\n[1] D. Alessandrini, L. Liu, A.Papadopoulos, W. Su, and Z. Sun, On Fenchel-Nielsen coordinates\non Teichmüller spaces of surfaces of infinite type, to appear in Ann. Acad. Sci. Fenn., Math.\n[2] D. Alessandrini, L. Liu, A.Papadopoulos and W. Su, On various Teichmüller spaces of a\nsurface of infinite topological type. To appear in the Proceedings of the AMS.\n[3] D. Alessandrini, L. Liu, A.Papadopoulos and W.Su, On local comparison between various\nmetrics on Teichmüller spaces, to appear in Geometriae Dedicata.\n[4] L. Bers, Nielsen extension of Riemann surfaces, Annales Academiae Scientiarum Fennicae,\nSeries A. I. Mathematica, Vol. 2, 1976, 29–34.\n[5] S. Kerckhoff, The Nielsen realization problem, Ann. of Math. 117 (1983) 235–265.\n[6] L. Liu and A. Papadopoulos, Some metrics on Teichmüller spaces of surfaces of infinite type,\nto appear in the Transactions of the AMS.\n[7] Y. Minsky, Extremal length estimates and product regions in Teichmüller space, Duke\nMath.J. 83 (1996), 249-286.\n[8] T.Okai, Effects of change of pants decompositions on their Fenchel-Nielsen coordinates, Kobe\nJ. Math. 10 (1993), 215-223.\n[9] A. Papadopoulos and G. Théret, Shift coordinates, stretch lines and polyhedral structures\nfor Teichmüller space. Monatsh. Math. 153, No. 4, 309-346 (2008).\n[10] W. Thurston, Three-dimensional geometry and topology, Princeton Mathematical Series, 35,\nPrinceton University Press, Princeton, NJ, 1997.\n[11] H. Weiss, Non-smooth geodesic flows and the earthquake flow on Teichmüller space, Ergod.\nTh. & Dynam. Sys. 9 (1989), 517-568.\n[12] S. Wolpert, On the symplectic geometry of deformations of a hyperbolic surface, Ann. of\nMath. 117 (1983), 207-234.\nDaniele Alessandrini, Max-Plank-Institut für Mathematik, Vivatsgasse 7, 53111 Bonn,\nGermany\nE-mail address: daniele.alessandrini@gmail.com\nLixin Liu, Department of Mathematics, Sun Yat-Sen University, 510275, Guangzhou,\nP. R. China, and Hausdorff Research Institute for Mathematics, Poppelsdorfer Allee\n45 D-53115 Bonn Germany\nE-mail address: mcsllx@mail.sysu.edu.cn\nAthanase Papadopoulos, Université de Strasbourg and CNRS, 7 rue René Descartes,\n67084 Strasbourg Cedex, France, and Hausdorff Research Institute for Mathematics,\nPoppelsdorfer Allee 45 D-53115 Bonn Germany\nE-mail address: athanase.papadopoulos@math.unistra.fr\nWeixu Su, Department of Mathematics, Sun Yat-Sen University, 510275, Guangzhou,\nP. R. China, and Hausdorff Research Institute for Mathematics, Poppelsdorfer Allee\n45 D-53115 Bonn Germany\nE-mail address: su023411040@163.com\n\n\f"}