{"id": "http://arxiv.org/abs/0706.1329v3", "guidislink": true, "updated": "2007-08-26T20:14:51Z", "updated_parsed": [2007, 8, 26, 20, 14, 51, 6, 238, 0], "published": "2007-06-11T18:07:18Z", "published_parsed": [2007, 6, 11, 18, 7, 18, 0, 162, 0], "title": "Solidity of viscous liquids. V. Long-wavelength dominance of the\n  dynamics", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.0686%2C0706.3804%2C0706.1137%2C0706.2757%2C0706.1776%2C0706.1239%2C0706.2362%2C0706.2069%2C0706.4415%2C0706.2784%2C0706.2077%2C0706.3934%2C0706.4387%2C0706.1285%2C0706.3639%2C0706.3217%2C0706.4019%2C0706.3458%2C0706.2697%2C0706.3752%2C0706.2894%2C0706.1418%2C0706.3128%2C0706.0207%2C0706.0231%2C0706.0857%2C0706.4114%2C0706.3455%2C0706.1927%2C0706.1501%2C0706.2372%2C0706.1698%2C0706.1268%2C0706.2230%2C0706.2129%2C0706.0683%2C0706.1277%2C0706.1996%2C0706.1993%2C0706.3440%2C0706.4435%2C0706.2198%2C0706.0766%2C0706.4182%2C0706.0947%2C0706.3568%2C0706.3117%2C0706.1470%2C0706.0772%2C0706.1014%2C0706.0679%2C0706.4016%2C0706.1926%2C0706.3898%2C0706.2712%2C0706.0022%2C0706.3029%2C0706.2619%2C0706.2386%2C0706.2603%2C0706.1251%2C0706.0871%2C0706.1255%2C0706.2361%2C0706.4026%2C0706.2834%2C0706.4313%2C0706.2148%2C0706.1999%2C0706.1781%2C0706.3020%2C0706.1899%2C0706.3561%2C0706.0735%2C0706.0893%2C0706.3867%2C0706.2235%2C0706.3878%2C0706.3267%2C0706.2521%2C0706.1672%2C0706.3095%2C0706.2249%2C0706.0728%2C0706.1773%2C0706.2694%2C0706.0508%2C0706.3887%2C0706.2924%2C0706.2021%2C0706.0056%2C0706.1611%2C0706.0257%2C0706.2434%2C0706.2535%2C0706.3922%2C0706.1836%2C0706.1329%2C0706.4119%2C0706.2823%2C0706.2992&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Solidity of viscous liquids. V. Long-wavelength dominance of the\n  dynamics"}, "summary": "This paper is the fifth in a series exploring the physical consequences of\nthe solidity of glass-forming liquids. Paper IV proposed a model where the\ndensity field is described by a time-dependent Ginzburg-Landau equation of the\nnonconserved type with rates in $k$ space of the form $\\Gamma_0+Dk^2$. The\nmodel assumes that $D\\gg\\Gamma_0a^2$ where $a$ is the average intermolecular\ndistance; this inequality expresses a long-wavelength dominance of the dynamics\nwhich implies that the Hamiltonian (free energy) to a good approximation may be\ntaken to be ultralocal. In the present paper we argue that this is the simplest\nmodel consistent with the following three experimental facts: 1) Viscous\nliquids approaching the glass transition do not develop long-range order; 2)\nThe glass has lower compressibility than the liquid; 3) The alpha process\ninvolves several decades of relaxation times shorter than the mean relaxation\ntime. The paper proceeds to list six further experimental facts characterizing\nequilibrium viscous liquid dynamics and shows that these are readily understood\nin terms of the model; some are direct consequences, others are quite natural\nwhen viewed in light of the model.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.0686%2C0706.3804%2C0706.1137%2C0706.2757%2C0706.1776%2C0706.1239%2C0706.2362%2C0706.2069%2C0706.4415%2C0706.2784%2C0706.2077%2C0706.3934%2C0706.4387%2C0706.1285%2C0706.3639%2C0706.3217%2C0706.4019%2C0706.3458%2C0706.2697%2C0706.3752%2C0706.2894%2C0706.1418%2C0706.3128%2C0706.0207%2C0706.0231%2C0706.0857%2C0706.4114%2C0706.3455%2C0706.1927%2C0706.1501%2C0706.2372%2C0706.1698%2C0706.1268%2C0706.2230%2C0706.2129%2C0706.0683%2C0706.1277%2C0706.1996%2C0706.1993%2C0706.3440%2C0706.4435%2C0706.2198%2C0706.0766%2C0706.4182%2C0706.0947%2C0706.3568%2C0706.3117%2C0706.1470%2C0706.0772%2C0706.1014%2C0706.0679%2C0706.4016%2C0706.1926%2C0706.3898%2C0706.2712%2C0706.0022%2C0706.3029%2C0706.2619%2C0706.2386%2C0706.2603%2C0706.1251%2C0706.0871%2C0706.1255%2C0706.2361%2C0706.4026%2C0706.2834%2C0706.4313%2C0706.2148%2C0706.1999%2C0706.1781%2C0706.3020%2C0706.1899%2C0706.3561%2C0706.0735%2C0706.0893%2C0706.3867%2C0706.2235%2C0706.3878%2C0706.3267%2C0706.2521%2C0706.1672%2C0706.3095%2C0706.2249%2C0706.0728%2C0706.1773%2C0706.2694%2C0706.0508%2C0706.3887%2C0706.2924%2C0706.2021%2C0706.0056%2C0706.1611%2C0706.0257%2C0706.2434%2C0706.2535%2C0706.3922%2C0706.1836%2C0706.1329%2C0706.4119%2C0706.2823%2C0706.2992&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "This paper is the fifth in a series exploring the physical consequences of\nthe solidity of glass-forming liquids. Paper IV proposed a model where the\ndensity field is described by a time-dependent Ginzburg-Landau equation of the\nnonconserved type with rates in $k$ space of the form $\\Gamma_0+Dk^2$. The\nmodel assumes that $D\\gg\\Gamma_0a^2$ where $a$ is the average intermolecular\ndistance; this inequality expresses a long-wavelength dominance of the dynamics\nwhich implies that the Hamiltonian (free energy) to a good approximation may be\ntaken to be ultralocal. In the present paper we argue that this is the simplest\nmodel consistent with the following three experimental facts: 1) Viscous\nliquids approaching the glass transition do not develop long-range order; 2)\nThe glass has lower compressibility than the liquid; 3) The alpha process\ninvolves several decades of relaxation times shorter than the mean relaxation\ntime. The paper proceeds to list six further experimental facts characterizing\nequilibrium viscous liquid dynamics and shows that these are readily understood\nin terms of the model; some are direct consequences, others are quite natural\nwhen viewed in light of the model."}, "authors": ["Jeppe C. Dyre"], "author_detail": {"name": "Jeppe C. Dyre"}, "author": "Jeppe C. Dyre", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevE.76.041508", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0706.1329v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0706.1329v3", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0706.1329v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0706.1329v3", "arxiv_comment": null, "journal_reference": "Phys. Rev. E 76, 041508 (2007).", "doi": "10.1103/PhysRevE.76.041508", "fulltext": "Solidity of viscous liquids. V. Long-wavelength dominance of the dynamics\nJeppe C. Dyre\n\narXiv:0706.1329v3 [cond-mat.soft] 26 Aug 2007\n\nDNRF centre \"Glass and Time,\" IMFUFA, Department of Sciences,\nRoskilde University, Postbox 260, DK-4000 Roskilde, Denmark\n(Dated: October 25, 2018)\nThis paper is the fifth in a series exploring the physical consequences of the solidity of highly\nviscous liquids. Paper IV proposed a model where the density field is described by a time-dependent\nGinzburg-Landau equation of the nonconserved type with rates in k space of the form Γ0 + Dk2 .\nIf a is the average intermolecular distance, the model assumes that D ≫ Γ0 a2 . This inequality\nexpresses a long-wavelength dominance of the dynamics, which implies that the Hamiltonian (free\nenergy) to a good approximation may be taken to be ultralocal, i.e., with the property that equaltime field fluctuations are uncorrelated in space. Paper IV also briefly discussed how to generalize\nthe model by including the molecular orientational fields, the stress tensor fields, and the potential\nenergy density field. In the present paper it is argued that this is the simplest model consistent\nwith the following three experimental facts: 1) Viscous liquids approaching the glass transition do\nnot develop long-range order; 2) The glass has lower compressibility than the liquid; 3) The alpha\nprocess involves several decades of relaxation times shorter than the mean relaxation time. The\npaper proceeds to list six further experimental facts of viscous liquid dynamics and shows that these\nfollow naturally from the model.\nPACS numbers: 64.70.Pf\n\nI.\n\nINTRODUCTION\n\nThe idea that viscous liquids approaching the calorimetric glass transition are solid-like goes back in time\nat least to Kauzmann's and Goldstein's famous papers\nfrom 1948 and 1969 [1, 2]. According to these authors,\nwhen a molecule changes position in a highly viscous liquid, this happens in the form of a so-called flow event,\na sudden rearrangement of a group of molecules. In this\npicture, which was later confirmed by computer simulations [3, 4, 5, 6, 7], all motion is vibrational in the time\nbetween flow events. This indicates that a viscous liquid\nis much like a disordered solid [8].\nThe property that highly viscous liquids are solid-like\nand more to be viewed as \"solids that flow\" than like ordinary less-viscous liquids, is here termed solidity. This\npaper is the fifth in a series (I-IV) [9, 10, 11, 12] devoted\nto extracting the physical consequences of the solidity of\nhighly viscous liquids. A discussion of solidity, its motivation and consequences, may be found in the introduction\nto paper IV to which the reader is referred for further\nphysical background.\nA crucial ingredient of solidity is time-scale separation\nin the equilibrium viscous liquid. This is the fact that,\nwhereas some processes occur on the vibrational time\nscale, i.e., over picoseconds, the genuine relaxation processes are much slower. Depending on temperature the\nlatter occur on time scales of milliseconds, second, days,...\nThe below discussion focuses exclusively on modelling the\nrelaxation processes.\nOne paper utilizing arguments from solid-state elasticity to viscous liquid dynamics preceded this series. This\nwas a joint publication with Olsen and Christensen from\n1996 where the \"shoving model\" for the temperature dependence of the viscosity (or relaxation time) was pro-\n\nposed [13]. According to this and related elastic models\n[14, 15] the activation energy is proportional to the instantaneous shear modulus G∞ (the shear modulus measured on a very short time scale). This elastic constant\nincreases significantly upon cooling, enough to explain\nthe observed non-Arrhenius behavior for several molecular liquids [13, 14, 15] (more data, however, are needed\nto illuminate whether this generally explains the nonArrhenius viscosity).\nThe first and second papers of this series focussed on\nthe individual flow events. In paper I a \"solidity\" length\nl was introduced characterizing the length scale below\nwhich there is time between two flow events to establish\nelastic equilibrium. In terms of the average intermolecular distance a, the alpha relaxation time τ , and the highfrequency sound velocity c∞ , the solidity length is given\nby l4 = a3 τ c∞ . Close to the calorimetric glass transition\nthe solidity length approaches 1 μm, so glass-forming liquids are solid-like on quite large length scales. The model\ndiscussed in paper IV and here focuses on dynamics below the solidity length.\nPapers III and IV [11, 12] dealt with the alpha relaxation process and how to explain its seemingly generic\nhigh-frequency loss ∝ ω −1/2 [16]. Paper III approached\nthe problem inductively by noting that the BEL model\nfrom 1967 [17] fits data for the frequency-dependent shear\nmodulus well. Starting from the BEL model it was argued that the ω −1/2 high-frequency behavior arises from\na long-time-tail mechanism operating over a range of\ntimes shorter than the alpha relaxation time. This was\njustified by a solidity-based argument with the irrelevance of momentum conservation as an important ingredient, thus allowing for the centre of mass to move following a flow event. As detailed in Refs. [18, 19] momentum\nconservation is irrelevant for highly viscous liquids, just\nas it is irrelevant in theories for defect motion in crystals.\n\n\f2\nPaper IV took a deductive approach and proposed a\nfield-theoretic model giving a concrete realization of the\nidea of paper III. In this model, which is the subject also\nof the present paper, the generic ω −1/2 high-frequency\ndecay of the alpha loss derives from a third-order term in\nthe Hamiltonian (free energy) [20]. The model, besides\nregarding momentum conservation as irrelevant just as\nin other stochastic models (e.g., for polymer dynamics\n[21]), was based on the observation that density conservation is also apparently disobeyed. This follows from\nsolidity: A flow event brings the liquid from one potential energy minimum to another. Any potential energy\nminimum corresponds to a state of elastic equilibrium,\nthus a state of zero divergence of the stress tensor – a\n\"solid\" state. From the standard equations of elasticity [22] it follows that upon a local density change, the\nleading term in the displacement field in the surroundings is radial and varies with distance r from the flow\nevent as 1/r2 . This is a pure shear displacement [22],\nimplying that in a coarse-grained description density can\nchange at one point without changing elsewhere; density has the appearance of not being conserved. This is\nconveniently condensed into the following equation for\nthe coarse-grained density dynamics (where bμ is a dimensionless measure of the magnitude of the flow event\ntaking place at rμ at time tμ ):\nρ̇(r, t) =\n\nX\nμ\n\nbμ δ(r − rμ )δ(t − tμ ) .\n\n(1)\n\nEquation (1) does not constitute a theory, of course, since\nit does not describe how flow events correlate; it just\ndescribes the equilibrium coarse-grained density fluctuations. Nevertheless, Eq. (1) serves to emphasize that\ndensity has the appearance of not being conserved, a result which is less trivial than the already-mentioned momentum nonconservation deriving directly from the extremely large kinematic viscosity [23] characterizing liquids approaching the glass transition [19]. The model discussed in paper IV and below incorporates the main idea\nbehind Eq. (1), density nonconservation, into a framework that is explicitly consistent with statistical mechanics. The model description of the density dynamics is\nmore involved than that of Eq. (1), which is too simple because it corresponds to isotropic flow events. On\nvery large length scales, though, the model dynamics are\ndescribed by Eq. (1).\nIn the present paper, supplementing the arguments\nof papers III and IV, we adopt a combined inductive/deductive approach. First, we list three experimental facts characterizing highly viscous liquids from which\nthe model is arrived at as the simplest model consistent\nwith these facts; this constitutes the inductive part of the\npaper (Secs. 2 and 3). In Sec. 4 we proceed to discuss\nsix further experimental facts and their relation to the\nmodel. It is argued that most of these are consequences\nof the model whereas some, though not mathematical\nconsequences, appear quite natural when viewed in light\n\nof the model. This constitutes the deductive part of the\npaper. Section 5 gives a brief discussion.\n\nII.\n\nTHREE FACTS OF VISCOUS LIQUID\nDYNAMICS\n\nThis section lists three facts characterizing glassforming liquids approaching the calorimetric glass transition.\n• Fact 1: There is no long-range density-coupled order\nA popular approach to understanding why the viscosity\nincreases ten orders of magnitude for a temperature decrease of typically just 10-15% is to assume that some sort\nof long-ranged order gradually develops upon supercooling. According to several prominent models the dramatic\nrelaxation-time increase is a consequence of the liquid approaching a critical point where the relaxation time becomes infinite (see, e.g., the excellent recent reviews by\nTanaka [24], Tarjus and coworkers [25], and Lubchenko\nand Wolynes [26], and their references). Following the\ntheory of critical phenomena it is assumed that there is a\ndiverging correlation length at the critical point. There\nis no consensus on how to define the proposed diverging\ncorrelation length, though, i.e., which quantity develops\nlong-ranged correlations. Numerous X-ray and neutron\nscattering experiment however show that whatever this\nhypothetical quantity may be, it does not couple to the\ndensity field: No increase of long-range density fluctuations is observed upon cooling [27].\n• Fact 2: The glassy phase has lower compressibility\nthan the liquid phase.\nThe glass transition is a falling-out-of-equilibrium taking place when the liquid relaxation time becomes\nlonger than the characteristic laboratory time scale.\nCompliance-type linear-response quantities like specific\nheat, compressibility, and thermal expansion coefficient\nall decrease when going from the liquid to the glass [27].\nThis is easy to understand, because if each compliancetype linear-response quantity has contributions from\nboth the fast (vibrational) and the much slower (configurational) degrees of freedom, these linear-response quantities must decrease at the glass transition since below\nTg the configurational degrees freeze and cease to contribute.\n• Fact 3: The alpha process is characterized by\na distribution of relaxation times covering several\ndecades of times shorter than the alpha relaxation\ntime.\nDielectric relaxation experiments are often fitted by the\nfrequency-dependent response function corresponding to\nthe stretched exponential dipole time-autocorrelation\n\n\f3\nfunction, exp[−(t/τ )β ] [28]. This reflects the fact that\nviscous liquids with few exceptions [29] do not have simple exponential time-autocorrelation functions. There is\nnothing magic about the stretched exponential; it gives\na good single-parameter fit to data because it reproduces\nthe observed loss peaks that are always asymmetric to the\nhigh-frequency side [28]. The point to be made here is\nthat if one rewrites any good fit to the observed autocorrelation function as a sum of exponentials, the distribution function must include several decades of relaxation\ntimes shorter than the main (alpha) relaxation time.\n\nIII. THE SIMPLEST MODEL FOR\nEQUILIBRIUM VISCOUS LIQUID DYNAMICS\nCONSISTENT WITH FACTS 1-3\n\nIn this section we consider the question: Which variable(s) must be included in a useful theory? What are the\nsimplest dynamics for this/these variable(s) consistent\nwith facts 1-3? Most models for viscous liquid dynamics\nattempt to explain both the alpha relaxation characteristics at a given temperature and the non-Arrhenius temperature dependence of the alpha relaxation time. We\nhere leave aside the non-Arrhenius problem altogether,\nalthough solidity appears to play an important role for\nthis property as well [15]. The idea is to \"cut the Gordian Knot\" by separating the complex problem of viscous\nliquid dynamics into two independent, hopefully easier\nproblems.\nNowadays most of physics – from particle physics to\ncritical phenomena, electromagnetism, and condensedmatter physics in quite diverse contexts – is formulated\nin the language of field theory. It is natural to expect\nthat viscous-liquid dynamics should also be described by\na field theory [30]. The question which variables are relevant thus becomes: \"Which fields must be included in\nthe description?\"\nThe obvious fields are those of standard hydrodynamics: the momentum, energy, and particle density fields.\nAs mentioned, the conservation laws for momentum and\nenergy are both irrelevant for viscous liquids [18, 19].\nThus the standard hydrodynamic description, based on\ncontinuity equations for these quantities, looses its physical significance. Despite the fact that solidity also implies\n(apparent) density nonconservation, the situation is different for the particle density field – after all, molecules\nare not continuously exchanged with the surroundings in\nthe way that momentum and energy are. We thus base\nthe model sought for on the density field ρ(r, t). The\nquestion which other fields to include in order to have\na complete description of the macroscopic dynamics, is\ndealt with at the end of this section.\nThe next question is: What are the simplest possible dynamics? Density dynamics of viscous liquids\nhave two parts, the vibrations (phonons) and the \"relaxing\" part of the dynamics. At low temperatures the\nalpha relaxation time is much larger than picoseconds,\n\nand the two dynamics are very well separated. Thus it\nmakes good sense to ignore the vibrational part of the\ndynamics. Assuming that the relevant field theory is\nbased on a Hamiltonian (i.e., a free energy functional),\nthe question next is how to model the dynamics consistent with the Hamiltonian. The answer to this is wellknown, use Langevin dynamics that is the generic way\nto arrive at dynamics from statics [21, 31]: If the relevant variables are denoted by Q1 , ..., Qn , the Hamiltonian is H(Q1 , ..., Qn ), and β = 1/kB T , the Langevin\nequation is Q̇i = −Γi ∂i (βH)/∂Qi + ξi (t) where ξi (t) is\na Gaussian white noise term with zero mean obeying\nhξi (t)ξj (t′ )i = 2Γi δij δ(t − t′ ). These equations reproduce the canonical probability ∝ exp(−βH), thus ensuring consistency with statistical mechanics [21, 31].\nThe system consists of N molecules with coordinates\nrj in volume\nV , and the density field is defined by\nP\nρ(r) = j δ(r − rj ). As always when there is translational invariance it is convenient to go to k-space; the\nrange of allowed k-vectors is limited to the discrete set\nconsistent with periodic boundary conditions. We define\nthe k'th density component as\n1 X ik*rj\nρk = √\n.\ne\nN j\n\n(2)\n\nWith this normalization ρk fluctuations become independent of volume for V → ∞ (N/V = Const.) and the relaxational part of the static structure factor S(k) is given\nby S(k) = hρk ρ−k i for V → ∞. The Langevin equation\n[21, 31] is\n\nρ̇k = −Γk\n\n∂(βH)\n+ ξk (t) .\n∂ρ−k\n\n(3)\n\nThe complex Gaussian white noise term obeys ξk∗ (t) =\nξ−k (t) and hξk (t)ξk∗′ (t′ )i = 2Γk δk,k′ δ(t − t′ ). Equation\n(3) is a standard time-dependent Ginzburg-Landau equation. Because ρ∗k = ρ−k this equation in conjunction with\nthe equation for ρ−k is equivalent to two real Langevin\nequations, one for the real part of ρk and one for its\nimaginary part.\nFollowing standard field theory procedure we split H\ninto a sum of a quadratic \"free-field\" term H0 and an\n\"interaction\" term H ′ containing all higher-order terms:\nH = H0 + H ′ .\n\n(4)\n\nRegarding H ′ as a perturbation, let us focus on the dynamics embodied in the free-field time-autocorrelation\nfunction denoted by hρk (0)ρ−k (t)i0 . If there were no\nhigher order terms, because S(k) = hρk ρ−k i, the freefield Hamiltonian would be given by\nβH0 =\n\n1 X ρk ρ−k\n.\n2\nS(k)\nk\n\n(5)\n\n\f4\nSubstituting this into Eq. (3) we find that the free-field\ntime-autocorrelation function hρk (0)ρ−k (t)i0 is an exponential with decay rate γk given by\n\nγk =\n\nΓk\n.\nS(k)\n\n(6)\n\n′\n\nWhen H is just a perturbation, the distribution of relaxation rates is roughly given by the distribution of γk 's.\nSince molecules cannot disappear, one would a priori assume Γk ∝ k 2 (\"conserved\" case – model B of\nRef. [32]), reflecting the expectation that density at sufficiently long wavelengths obeys the diffusion equation.\nThis, however, is inconsistent with fact 2 for the following\nreason. At the glass transition the liquid high-frequency\ncompressibility becomes the glass compressibility. Fact\n2 states that this quantity is lower than the liquid (dc)\ncompressibility, implying that in the equilibrium liquid\nthere are relaxational volume fluctuations on a macroscopic length scale taking place on a finite time scale (the\nalpha time scale). (This is also known from measurements of the frequency-dependent bulk modulus showing that the low-frequency bulk modulus is smaller than\nthe high-frequency bulk modulus [33], as well as from\nthe so-called Mountain peak (relaxation mode) of light\nscattering [34, 35].) This implies that the relaxational\npart of the static structure factor, S(k), has a non-zero\nlimit for k → 0. Therefore, if Γk ∝ k 2 , by Eq. (6) the\nrate of the relaxational macroscopic density fluctuations\nwould go to zero for k → 0, i.e., be arbitrarily slow for\nlarge enough samples. This violates fact 2. Consequently,\ndensity fluctuations cannot be described by Γk ∝ k 2 as\nk → 0, and density must have the appearance of a nonconserved field.\nGiven that Γk ∝ k 2 does not work, the simplest alternative is that Γk is independent of k: Γk = Γ0 (\"nonconserved\" case – model A of Ref. [32]). This, however,\ndoes not work for the following reason. For ka ∼ 1 the\nstatic (relaxational) structure factor S(k) is of order one,\nwhereas for k → 0 S(k) converges to the ratio between\nliquid (relaxational) compressibility and that of an ideal\ngas at the same density. This ratio is typically of order\n10−2 [36]. Thus if Γk = Γ0 , Eq. (6) would imply a range\nof relaxation times covering at most 2 decades. This is\ninconsistent with fact 3 that requires several decades of\nrelaxation times. (It would also be physically counterintuitive to have long-wavelength density fluctuations decaying much faster than short-wavelength fluctuations.)\nSince Γk ∝ k 2 contradicts fact 2 and Γk = Γ0 contradicts fact 3, the next possibility is a combination of the\ntwo:\nΓk = Γ0 + Dk 2 .\n\n(7)\n\nFor this to be consistent with fact 3, however, D must be\nquite large: Unless the Dk 2 term makes Γk vary several\ndecades for the range of allowed k-vectors, the model\n\nwon't work for the same reason that Γk = Γ0 doesn't\nwork. Since the maximum k obeys ka ∼ 1, this means\nthat the following must be assumed:\nD ≫ Γ0 a 2 .\n\n(8)\n\nThe inequality (8) expresses a long-wavelength dominance of the dynamics because it implies that the Dk 2\nterm dominates the rate expression Eq. (7) for a range of\nsmall k vectors corresponding to wavelengths much larger\nthan a. Whereas in papers III and IV this inequality was\njustified by microscopic arguments, it here comes about\nfrom a search for the simplest possible model consistent\nwith facts 1-3.\nIn conjunction with fact 1, long-wavelength dominance\nof the dynamics implies that static (equal-time) correlations of density fluctuations at differing points can have\nlittle influence on the dynamics. Consequently, in the\nname of simplicity such correlations will be assumed to\nbe absent altogether. A field theory with no equal-time\ncorrelations between fields at different points in space is\ntermed \"ultralocal.\" In k-space the assumption of ultralocality means that all coefficients are\nP k independent\nin the expansion in orders\nof\nρ\n:\nH\n=\nk\n0\nk (1/2A)ρk ρ−k\n√\nP\nand H ′ = k,k′ (λ3 /3 N )ρk ρk′ ρ−k−k′ + ... [37].\nA similar long-wavelength dominance of the deeply\nsupercooled dynamics is crucial also in Schweizer's and\nSaltzman's theory of activated hopping in polymer melts\n[38]. Specifically, atomistic structure in S(k) is here\ncoarse-grained over, resulting in a statistical segment\nlevel (nm-scale) description where confining forces are\nquantified via the amplitude of thermal density fluctuations, which are proportional to the isothermal compressibility, i.e., given by S(0). In other words, it is assumed\nthat the most important dynamic length scale is significantly larger than a monomer.\nThe assumption that equal-time density fluctuations\nare uncorrelated in space does not mean that the model\nis trivial – there are non-zero correlations between density fluctuations at different positions at different times.\nThe situation is analogous to that of a trivial spin model\n(i.e., with no spin-spin interactions) with Kawasaki dynamics, where a spin flip at one point can take place only\nif a neighboring spin simultaneously flips in the opposite\ndirection. If by chance a given up spin is surrounded by\na large island of up spins, the given spin will be frozen for\nsome time; thus the dynamics of this spin is influenced\nby those of its surrounding spins even though there are\nno equal-time spin-spin correlations.\nAs a minimum, a theory for viscous liquid dynamics should make it possible to calculate all\nmacroscopic frequency-dependent linear-response quantities. Response functions are determined from the\nfluctuation-dissipation theorem by first calculating timeautocorrelation functions of variables like the total dipole\nmoment (dielectric constant), pressure (bulk modulus),\nshear stress (shear modulus), or energy density (specific\nheat). Note that the frequency-dependent bulk modulus\n\n\f5\nmay be determined from density fluctuations alone, implying that the pressure is not an independent variable\nin the present context, and the stress tensor has only 5\nrelevant components.\nThese considerations lead (paper IV) to the following\ngeneral recipe for modelling viscous liquid dynamics:\n1. The relevant degrees of freedom are fields φ(1) (r),\n..., φ(n) (r) defined as: a) the densities of the different molecules, b) the densities of the molecules' various configurational variables reflecting the molecular symmetry, c) the 5 stress tensor fields of the\ntraceless stress tensor, d) the potential energy density field;\n2. The Hamiltonian H (free energy) is ultralocal and\nconsists of scalar (i.e., rotationally and translationally invariant) terms;\n3. For each field the dynamics are described by a\ntime-dependent Ginzburg-Landau equation, i.e., a\nLangevin equation of the form\n\n(j)\n\n(j)\n\nφ̇k = −Γk\n\n∂(βH)\n(j)\n∂φ−k\n\n(j)\n\n+ ξk (t) ,\n\n(9)\n\n(j)\n\nwhere ξk (t) is a Gaussian white-noise term obey(i)\n(j)∗\n(i)\ning hξk (t)ξk′ (t)i = 2Γk δi,j δk,k′ δ(t − t′ );\n4. For each density field the Langevin equation\n(j)\n(j)\nrates are given by Γk = Γ0 + D(j) k 2 where\n(j)\nD(j) ≫ Γ0 a2 ; for all other fields the rates are\n(j)\n(j)\nk-independent: Γk = Γ0 .\nInclusion of the extra fields makes it possible to calculate the frequency-dependent dielectric constant and\nshear modulus, as well as all 8 fundamental frequencydependent thermoviscoelastic response functions [39]:\nthe isochoric and isobaric specific heats, the isothermal\nand adiabatic compressibilities, the isobaric expansion\ncoefficient, the adiabatic contraction coefficient, and the\nisochoric and adiabatic pressure coefficients.\nIV.\n\nSIX FURTHER FACTS OF VISCOUS\nLIQUID DYNAMICS AND THEIR\nINTERPRETATION IN LIGHT OF THE MODEL\n\nBelow are listed six experimental facts that are each\nnontrivial in the sense that there is no logically compelling connection between it and facts 1-3. Nevertheless, when viewed in light of the model, these facts all\nappear obvious.\n• Fact 4: Below the alpha-loss peak the loss virtually\nfollows the Debye prediction, i.e., is proportional to\nω. Thus there is an effective cut-off at long times\nin the relaxation-time distribution.\n\nAlpha loss peaks, which are typically measured by dielectric relaxation experiments, are generally asymmetric\ntowards the high-frequency side [28]. At low frequencies\nthey follow the Debye prediction [∝ 1/(1 + iωτ )], i.e.,\nthe loss is virtually proportional to frequency; the same\napplies, e.g., for the frequency-dependent shear modulus\n[40]. This implies that, if the linear response is written\nformally as a sum of Debye processes, there is an effective\ncut-off at long times in the relaxation-time distribution.\nGiven the spatial disorder of any viscous liquid it is\nnot surprising that Debye peaks are rarely observed, but\nthe observed effective cut-off at long relaxation times is\nhighly nontrivial. If the non-Debye relaxation were due\nto effects of disorder-induced activation-energy broadening, the obvious guess would be a Gaussian activationenergy distribution. This, however, implies loss peaks\nthat are symmetric in a log-log plot, which is inconsistent with experiment.\nBecause there is a minimum relaxation rate in the\nmodel, a long relaxation-time cut-off is automatically implied. Of course, this cut-off was built into the model via\nEq. (7). The point we wish make is merely that this\nequation was not justified from fact 4, but as the simplest way to rationalize facts 1-3. Fact 4 follows.\n• Fact 5: Above the alpha loss-peak frequency the\nloss appears to be generically close to ω −1/2 .\nThe alpha process is conveniently monitored by dielectric relaxation experiments [28]. Above the loss-peak\nfrequency the dielectric loss decays following an approximate power law ∝ ω −ν . The shape of the loss peak\noften changes with temperature, i.e., time-temperature\nsuperposition (TTS) is often not obeyed. It is now\ngenerally agreed that Johari-Goldstein beta processes\nmay be found at much lower frequencies than previously\nthought [41]. Thus, since alpha and beta relaxations\nhave quite different temperature dependence, low-lying\nbeta processes easily lead to TTS violations even in the\nHertz regime and below. According to this reasoning the\n\"generic\" characteristics of the alpha process is observed\nonly when TTS is accurately obeyed. A study of the dielectric loss of 10 molecular liquids published in 2001 [16]\nindicated that when TTS is accurately obeyed, the exponent ν is quite close to 1/2. A recent study comprising\n45 molecular liquids found that the minimum slope αmin\nabove the loss peak (characterizing the inflection point\nand thus giving the best approximate power-law fit) is\ngenerally fairly close to −1/2 (60% of the liquids studied\nobey −0.6 < αmin < −0.4) [42].\nAs shown in Ref. [20] and paper IV, to lowest order\nin perturbation theory a third-order term in the Hamiltonian implies that the loss varies as ω −1/2 for ω's considerably higher than the loss peak frequency.\n• Fact 6: The alpha relaxation process is dominated\nby small-angle jumps.\nMany models assume \"cooperatively rearranging regions\" that do not interact with one another. In this\n\n\f6\nspirit molecules either move significantly (those involved\nin the flow event) or do not move at all (those in the surroundings). Thus molecular jumps would be expected\nto be fairly large and molecular orientations likewise to\nchange considerably following a flow event. The molecular jump angles cannot be probed by linear-response\nexperiments, but fortunately they can by NMR experiments. The result of Böhmer and coworkers [43, 44] is\nthat small-angle jumps dominate.\nThis observation calls for an explanation in terms of solidity: The reason that small-angle jumps dominate must\nbe that – if the flow event picture is not completely wrong\n– the overall picture is dominated by the small adjustments in the surroundings required to re-establish elastic\nequilibrium after a flow event. A simple solidity-based\ncalculation (paper I) shows that the jump-angle distribution P (φ) varies as 1/φ2 , consistent with NMR findings\n[43] (this distribution is not normalizable because there\nare infinitely many molecules in the surroundings – in\nreality the distribution is cut-off at very small angles because elastic effects do not propagate beyond the solidity\nlength). Clearly, largest weight is given to small jump\nangles.\nWhen fact 6 is contemplated in light of the model,\nit should be noted (paper IV) that the crucial Γ0 6= 0\nidentity expressing apparent density nonconservation can\ncome about only if a flow event is followed by small\nsolidity-based adjustments of molecular positions in the\nfar surroundings. Thus fact 6 follows from the model's\nnonzero Γ0 .\n• Fact 7: Viscous slowing down is not accompanied\nby significant changes of the static structure factor.\nA popular and obvious explanation of the dramatically\nincreasing relaxation time for liquids approaching the\ncalorimetric glass transition is that upon cooling there\nis a gradual build-up of some sort of long-range order, in\nmany models signalling that there is a critical point not\nfar below Tg where the relaxation time becomes infinite\n[24, 25, 26]. As mentioned, numerous experiments have\nlooked for long-range order, but found none [27]. Not\nonly is there no long-range order, but the liquid structure\nas probed by S(k) via X-ray or neutron scattering experiments changes little over the temperature range where\nthe relaxation time changes by 10 or more orders of magnitude. It is matter of taste whether or not one regards\nthis as surprising [45]. A model with no spatial correlations at any temperature trivially predicts that there are\nno nontrivial changes of the static structure factor upon\ncooling. In this sense fact 7 follows from the model.\n• Fact 8: The Debye-Stokes-Einstein relation is often violated in viscous liquids.\nAn important finding of the 1990's was that translational\nmotions often decouple from and become 1-3 decades\nfaster than rotations [46]. Somehow, translations are enhanced compared to what one expects from the DebyeStokes-Einstein relation that estimates the single particle\n\ndiffusion constant Ds from the viscosity η. Although this\nrelation a priori applies only for macroscopic particles,\nthere is no obvious reason that a molecule on average\nshould move much longer than a during the rotational\ncorrelation time (the alpha relaxation time).\nThe generally accepted picture of Debye-StokesEinstein violations is that these reflect dynamic heterogeneity [46]. Although dynamic heterogeneity is not described by the model, this is not inconsistent with the\nmodel that provides only a coarse-grained description\nof the dynamics. Debye-Stokes-Einstein violations, in\nfact, fit nicely with the model if one assumes that the\nsingle-particle diffusion constant is roughly equal to the\ndiffusion constant D of Eq. (7); in this case the longwavelength dominance inequality (8) simply expresses\nDebye-Stokes-Einstein violation.\n• Fact 9: The dynamics are not sensitive to the\nchemistry.\nAt any given temperature the relaxation characteristics\n– linear as well as nonlinear – are similar for all glassforming liquids. Viscous liquids do differ as regards, e.g.,\nwhether or not there is a clearly defined beta relaxation\nin the liquid phase, or whether or not time-temperature\nsuperposition applies. But these differences do not appear to correlate with chemical characteristics in any simple fashion. For instance, as regards their dielectric and\nthermodynamics properties, liquids held together exclusively by van der Waals forces do not differ systematically\nfrom those involving hydrogen bonds [28]. Similarly, the\nfrequency-dependent shear modulus of viscous metallic\nliquids forming bulk metallic glasses is indistinguishable\nfrom that of typical molecular liquids [47]. The overall conclusion is that it is not possible from macroscopic\nmeasurements alone to determine which chemical bonds\nare involved (except, of course, from the fact that the\ntemperature range where the glass transition takes place\ntrivially provides information about the strength of the\nintermolecular forces). As a further confirmation of fact\n9 it should be noted that mixtures behave much like pure\nliquids and that, again, it is not generally possible from\npurely macroscopic measurements to tell whether or not\na given liquid is a mixture.\nThis insensitivity to the chemistry is a highly significant fact. For some reason the dynamics are fairly\nindifferent to details of the molecular interactions, but\nwhy? In the model chemistry independence is expected\nbecause of the long-wavelength dominance of the dynamics – clearly chemistry plays little role for dynamics on\nlength scales much larger than the size of a molecule.\nThe chemistry independence is similar to that of critical\nphenomena. This has motivated many attempts to draw\nparallels to the theory of critical phenomena by assuming\nthat viscous slowing down is accompanied by some kind\nof long-range order responsible for the observed quasiuniversality. The present model has no such assumption,\nbut on the contrary assumes that there are only shortrange static correlations of the relevant fields. Only when\n\n\f7\nit comes to the dynamics do long length scales play important roles. – Note that the model does not imply absolute chemistry independence, because the free energy\nas function of the fields varies with chemical composition.\nV.\n\nDISCUSSION\n\nIt is a long-standing assumption that viscous-liquid dynamics are cooperative. Mode-coupling theory [48, 49]\nis an interesting case where cooperativity enters via the\ncoupling of single-particle motion to the surroundings,\nresulting in a modification of the single-particle motion\nwith drastic consequences at low temperatures (infinite\nrelaxation time at a finite temperature in the simplest\nand most studied version of the theory). The present\nmodel is also cooperative, but in a rather simple-minded\nsense, with two elements of cooperativity: 1) Density\nnonconservation (implying Γ0 6= 0) is a cooperative effect because it involves the solidity-based movement of\nmolecules far from a flow event; 2) The long-wavelength\nassumption Eq. (8) expresses cooperativity in the sense\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n\nW. Kauzmann, Chem. Rev. 43, 219 (1948).\nM. Goldstein, J. Chem. Phys. 51, 3728 (1969).\nA. Heuer, Phys. Rev. Lett. 78, 4051 (1997).\nS. Sastry, P. G. Debenedetti, and F. H. Stillinger, Nature\n393, 554 (1998).\nL. Angelani, R. Di Leonardo, G. Ruocco, A. Scala, and\nF. Sciortino, Phys. Rev. Lett. 85, 5356 (2000).\nT. B. Schrøder, S. Sastry, J. C. Dyre, and S. C. Glotzer,\nJ. Chem. Phys. 112, 9834 (2000).\nF. Sciortino, J. Stat. Mech., Art. No. P05015 (2005).\nSolids also flow when subjected to an external stress.\nThe primary difference between a disordered solid and\na highly viscous liquid is that the latter is in a state of\nmetastable equilibrium, i.e., fully characterized by two\nthermodynamic variables (e.g., temperature and pressure). Thus the highly viscous liquid and its dynamics\nought to be much simpler.\nJ. C. Dyre, Phys. Rev. E 59, 2458 (1999) (paper I).\nJ. C. Dyre, Phys. Rev. E 59, 7243 (1999) (paper II).\nJ. C. Dyre, Phys. Rev. E 72, 011501 (2005) (paper III).\nJ. C. Dyre, Phys. Rev. E 74, 021502 (2006) (paper IV).\nJ. C. Dyre, N. B. Olsen, and T. Christensen, Phys. Rev.\nB 53, 2171 (1996).\nJ. C. Dyre, T. Christensen, and N. B. Olsen, J. NonCryst. Solids 351, 4635 (2006).\nJ. C. Dyre, Rev. Mod. Phys. 78, 953 (2006).\nN. B. Olsen, T. Christensen, and J. C. Dyre, Phys. Rev.\nLett. 86, 1271 (2001).\nA. J. Barlow, A. Erginsav, and J. Lamb, Proc. Roy. Soc.\nLondon, Ser. A 298, 481 (1967).\nJ. C. Dyre, J. Phys.: Condens. Matter 19, 205105 (2007).\nJ. C. Dyre, Philos. Mag. 87, 497 (2007).\nJ. C. Dyre, Europhys. Lett. 71, 646 (2005).\nM. Doi and S. F. Edwards, Theory of Polymer Dynamics\n(Oxford University Press, Oxford, 1986).\n\nthat motion over long wavelengths is mainly responsible\nfor the alpha process.\nThe overall purpose of this paper was to show that\nthe model of paper IV has implications that were not\nput into the model. The overall credibility of the model\nis strengthened by the fact that the model is consistent\nwith – and in most cases predicts – several experimental\nfacts that are independent of the model inputs. We would\nlike finally to emphasize that, despite the macroscopic\nreasoning of this paper, the long-wavelength dominance\ninequality Eq. (8) reflects properties of the individual\nflow events [50].\nAcknowledgments\n\nThe author wishes to thank Ken Schweizer for most\nuseful correspondences and discussions on the model and\nits underlying assumptions. This work was supported by\na grant from the Danish National Research Foundation\n(DNRF) for funding the centre for viscous liquid dynamics \"Glass and Time.\"\n\n[22] L. D. Landau and E. M. Lifshitz, Theory of Elasticity,\n2nd Ed. (Pergamon, London, 1970).\n[23] By an unfortunate mistake, in Ref. [15] the \"kinematic\nviscosity\" of the Navier-Stokes equation (viscosity over\ndensity, a quantity with same dimension as a diffusion\nconstant) was referred to as the \"dynamic viscosity.\" The\nkinematic viscosity is the transverse momentum diffusion\nconstant, a quantity that becomes very large when a liquid approaches the calorimetric glass transition. This is\nresponsible for the fact that momentum is exchanged between liquid and measuring equipment over the alpha\ntime scale, thus implying irrelevance of momentum conservation for realistic descriptions of viscous liquid dynamics as it is observed in the laboratory.\n[24] H. Tanaka, J. Non-Cryst. Solids 351, 3371 (2005); 351,\n3385 (2005); 351, 3396 (2005).\n[25] G. Tarjus, S. A. Kivelson, Z. Nussinov, and P. Viot, J.\nPhys.: Condens. Matter 17, R1143 (2005).\n[26] V. Lubchenko and P. G. Wolynes, Ann. Rev. Phys.\nChem. 58, 235 (2007).\n[27] G. Harrison, The dynamic properties of supercooled liquids (Academic Press, New York, 1976); J. Lamb, J.\nRheol. 22, 317 (1978); S. Brawer, Relaxation in Viscous\nLiquids and Glasses (American Ceramic Society, Columbus, OH, 1985); I. M. Hodge, J. Non-Cryst. Solids 169,\n211 (1994); C. A. Angell, K. L. Ngai, G. B. McKenna,\nP. F. McMillan, and S. W. Martin, J. Appl. Phys. 88,\n3113 (2000); C. Alba-Simionesco, C. R. Acad. Sci. Paris\n(Ser. IV) 2, 203 (2001); P. G. Debenedetti and F. H.\nStillinger, Nature 410, 259 (2001); E. Donth, The Glass\nTransition (Springer, Berlin, 2001); U. Buchenau and\nA. Wischnewski, Phys. Rev. B 70, 092201 (2004); W.\nKob, in Slow relaxations and nonequilibrium dynamics in\ncondensed matter, Proceedings of the Les Houches Summer School of Theoretical Physics, Session LXXVII, 1-26\n\n\f8\n\n[28]\n\n[29]\n\n[30]\n[31]\n\n[32]\n[33]\n[34]\n[35]\n[36]\n\n[37]\n\n[38]\n\n[39]\n[40]\n[41]\n\nJuly, 2002, p. 199, edited by J.-L. Barrat, M. Feigelman,\nJ. Kurchan, and J. Dalibard (Springer, Berlin, 2004); G.\nN. Greaves and S. Sen, Adv. Phys. 56, 1 (2007).\nA. Kudlik, S. Benkhof, T. Blochowicz, C. Tschirwitz,\nand E. Rössler, J. Mol. Structure 479, 201 (1999);\nP. Lunkenheimer, U. Schneider, R. Brand, and A.\nLoidl, Contemp. Phys. 41, 15 (2000); F. Kremer and\nA. Schönhals (Eds.), Broadband Dielectric Spectroscopy\n(Springer, Berlin, 2002); C. M. Roland, S. HenselBielowka, M. Paluch, R. Casalini, Rep. Prog. Phys. 68,\n1405 (2005).\nThere is one interesting exception, namely the lowest relaxation process of mono-hydroxy-alcohols that is purely\nDebye, a process which is much slower than the ordinary\nalpha process determining the calorimetric Tg , see, e.g.,\nL. M. Wang, S. Shahriari, and R. Richert, J. Phys. Chem.\nB 109, 23255 (2005).\nD. di Caprio and J. P. Badiali, arXiv:0707.3069 (2007).\nN. G. van Kampen, Stochastic Processes in Physics\nand Chemistry (North-Holland, Amsterdam, 1981); H.\nRisken, The Fokker-Planck Equation, 2nd Ed. (Springer,\nBerlin, 1989); L. E. Reichl, A Modern Course in Statistical Physics, 2nd Ed. (Wiley, New York, 1998).\nP. C. Hohenberg and B. I. Halperin, Rev. Mod. Phys. 49,\n435 (1977).\nT. Christensen and N. B. Olsen, Phys. Rev. B 49, 15396\n(1994).\nR. D. Mountain, J. Res. Natl. Bur. Stand. 72A, 95\n(1968).\nB. J. Berne and R. Pecora, Dynamic Light Scattering\n(Wiley, New York, 1976 - Dover edition 2000).\nJ. P. Boon and S. Yip, Molecular hydrodynamics\n(McGraw-Hill, New York, 1980); J. P. Hansen and I.\nR. McDonald, Theory of simple liquids 2nd Ed. (Academic Press, New York, 1986); J.–L. Barrat and J.–P.\nHansen, Basic concepts for simple and complex liquids\n(Cambridge University Press, Cambridge, 2003).\nNote that the assumption of an ultralocal Hamiltonian\nmeans that there is a direct connection to the macroscopic thermodynamics of the relaxing degrees of freedom\n(i.e., the non-vibrational contribution to the thermodynamics), because the Hamiltonian is nothing but the free\nenergy of the relaxing degrees of freedom.\nK. S. Schweizer and E. J. Saltzman, J. Chem. Phys. 121,\n1984 (2004); E. J. Saltzman and K. S. Schweizer, J. Phys.:\nCondens. Matter 19, 205123 (2007).\nN. L. Ellegaard, T. Christensen, P. V. Christiansen, N.\nB. Olsen, U. R. Pedersen, T. B. Schrøder, and J. C. Dyre,\nJ. Chem. Phys. 126, 074502 (2007).\nB. Jakobsen, K. Niss, and N. B. Olsen, J. Chem. Phys.\n123, Art. No. 234511 (2005).\nN. B. Olsen, J. Non-Cryst. Solids 235, 399 (1998).\n\n[42] A. I. Nielsen et al., in preparation (2007).\n[43] R. Böhmer and G. Hinze, J. Chem. Phys. 109, 241\n(1998).\n[44] R. Böhmer, G. Diezemann, G. Hinze, and E. Rössler,\nProg. Nucl. Magn. Reson. Spectrosc. 39, 191 (2001).\n[45] Mode-coupling theory, of course, is based on the assumption that the dramatic slowing down is caused by the\nquite small structural changes that are indeed observed\nupon cooling. This fact makes mode-coupling theory in\nits classical form less compelling. Schweizer and Salzman\ndeveloped a promising version of mode-coupling theory,\nwhich allows for barrier transitions and, via well-defined\napproximations, for calculating the alpha relaxation energy barrier from first principles [K. S. Schweizer and\nE. J. Salzman, J. Chem. Phys. 119, 1181 (2003); K. S.\nSchweizer, J. Chem. Phys. 123, 244501 (2005), E. J. Salzman and K. S. Schweizer, J. Chem. Phys. 125, 044509\n(2006)]. Very recently Schweizer showed how this novel\napproach connects to a number of other theories [K. S.\nSchweizer, J. Chem. Phys., submitted May 2007].\n[46] F. Fujara, B. Geil, H. Sillescu, and G. Fleischer, Z. Phys.\nB 88, 195 (1992); F. H. Stillinger and J. A. Hodgdon,\nPhys. Rev. E 50, 2064 (1994); M. T. Cicerone and M.\nD. Ediger, J. Chem. Phys. 104, 7210 (1996); G. Diezemann, H. Sillescu, G. Hinze, and R. Böhmer, Phys. Rev.\nE 57, 4398 (1998); J. F. Douglas and D. Leporini, J.\nNon-Cryst. Solids 235-237, 137 (1998); S. F. Swallen, P.\nA. Bonvallet, R. J. McMahon, and M. D. Ediger, Phys.\nRev. Lett. 90, 015901 (2003).\n[47] P. Wen, D. Q. Zhao, M. X. Pan, W. H. Wang, Y. P.\nHuang, and M. L. Guo, Appl. Phys. Lett. 84, 2790\n(2004); Z. F. Zhao, P. Wen, C. H. Shek, and W. H. Wang,\nPhys. Rev. B 75, 174201 (2007).\n[48] W. Götze and L. Sjögren, Rep. Progr. Phys. 55, 241\n(1992).\n[49] S. P. Das, Rev. Mod. Phys. 76, 785 (2004).\n[50] On a very short time scale flow events are uncorrelated\nand thus the inequality Eq. (8) translates directly into\nproperties of single flow events: If one flow event changes\nρk by δρk , one finds from paper IV that h|δρk |2 i = hb2 i/N\nfor k → 0 where b (compare Eq. (1)) is defined by\nthe radial displacement far from the flow event varying as −b/(4πhρi)1/r 2 (paper IV), whereas the term\n∝ k2 isk2 h∆R2 i/(3N ) where ∆R is the vector sum of\nall molecule displacements induced by the flow event. On\nthe other hand, integrating the noise term over a short\ntime shows that h|δρk |2 i ∝ Γ0 + Dk2 . Comparing these\nexpressions shows that the inequality Eq. (8) is equivalent to hb2 i ≪ h∆R2 i/a2 . This could be obeyed either if\n|b| ≪ 1 and h∆R2 i ∼ a2 , or if |b| ∼ 1 and the sum of\nall molecule displacements is much larger than the intermolecular distance a.\n\n\f"}