{"id": "http://arxiv.org/abs/1107.4324v1", "guidislink": true, "updated": "2011-07-21T17:50:02Z", "updated_parsed": [2011, 7, 21, 17, 50, 2, 3, 202, 0], "published": "2011-07-21T17:50:02Z", "published_parsed": [2011, 7, 21, 17, 50, 2, 3, 202, 0], "title": "Few simple rules governing hydrogenation of graphene dots", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1107.1262%2C1107.3774%2C1107.1260%2C1107.5660%2C1107.3589%2C1107.3445%2C1107.3450%2C1107.0642%2C1107.2080%2C1107.1988%2C1107.4815%2C1107.1090%2C1107.1537%2C1107.3957%2C1107.1166%2C1107.1496%2C1107.1576%2C1107.4803%2C1107.1079%2C1107.0439%2C1107.1270%2C1107.0798%2C1107.3646%2C1107.5887%2C1107.4559%2C1107.5494%2C1107.4420%2C1107.5106%2C1107.5001%2C1107.4526%2C1107.0027%2C1107.5241%2C1107.4443%2C1107.3465%2C1107.5950%2C1107.3402%2C1107.2682%2C1107.2441%2C1107.2570%2C1107.4324%2C1107.0061%2C1107.6010%2C1107.0578%2C1107.3138%2C1107.1410%2C1107.3173%2C1107.2802%2C1107.2683%2C1107.2218%2C1107.1459%2C1107.1281%2C1107.0454%2C1107.5010%2C1107.3144%2C1107.0406%2C1107.1601%2C1107.0586%2C1107.0037%2C1107.4030%2C1107.3569%2C1107.4321%2C1107.0634%2C1107.0946%2C1107.1912%2C1107.1834%2C1107.1562%2C1107.1649%2C1107.1305%2C1107.6016%2C1107.3526%2C1107.4478%2C1107.5163%2C1107.1552%2C1107.1540%2C1107.1538%2C1107.1136%2C1107.5965%2C1107.5237%2C1107.5374%2C1107.2563%2C1107.0497%2C1107.3286%2C1107.1735%2C1107.5934%2C1107.2476%2C1107.2716%2C1107.4383%2C1107.0486%2C1107.2393%2C1107.3217%2C1107.0839%2C1107.1376%2C1107.1689%2C1107.2746%2C1107.0245%2C1107.3742%2C1107.1254%2C1107.4859%2C1107.1354%2C1107.3669%2C1107.0501&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Few simple rules governing hydrogenation of graphene dots"}, "summary": "We investigated binding of hydrogen atoms to small Polycyclic Aromatic\nHydrocarbons (PAHs) - i.e. graphene dots with hydrogen-terminated edges - using\ndensity functional theory and correlated wavefunction techniques. We considered\na number of PAHs with 3 to 7 hexagonal rings and computed binding energies for\nmost of the symmetry unique sites, along with the minimum energy paths for\nsignificant cases. The chosen PAHs are small enough to not present radical\ncharacter at their edges, yet show a clear preference for adsorption at the\nedge sites which can be attributed to electronic effects. We show how the\nresults, as obtained at different level of theory, can be rationalized in\ndetail with the help of few simple concepts derivable from a tight-binding\nmodel of the $\\pi$ electrons.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1107.1262%2C1107.3774%2C1107.1260%2C1107.5660%2C1107.3589%2C1107.3445%2C1107.3450%2C1107.0642%2C1107.2080%2C1107.1988%2C1107.4815%2C1107.1090%2C1107.1537%2C1107.3957%2C1107.1166%2C1107.1496%2C1107.1576%2C1107.4803%2C1107.1079%2C1107.0439%2C1107.1270%2C1107.0798%2C1107.3646%2C1107.5887%2C1107.4559%2C1107.5494%2C1107.4420%2C1107.5106%2C1107.5001%2C1107.4526%2C1107.0027%2C1107.5241%2C1107.4443%2C1107.3465%2C1107.5950%2C1107.3402%2C1107.2682%2C1107.2441%2C1107.2570%2C1107.4324%2C1107.0061%2C1107.6010%2C1107.0578%2C1107.3138%2C1107.1410%2C1107.3173%2C1107.2802%2C1107.2683%2C1107.2218%2C1107.1459%2C1107.1281%2C1107.0454%2C1107.5010%2C1107.3144%2C1107.0406%2C1107.1601%2C1107.0586%2C1107.0037%2C1107.4030%2C1107.3569%2C1107.4321%2C1107.0634%2C1107.0946%2C1107.1912%2C1107.1834%2C1107.1562%2C1107.1649%2C1107.1305%2C1107.6016%2C1107.3526%2C1107.4478%2C1107.5163%2C1107.1552%2C1107.1540%2C1107.1538%2C1107.1136%2C1107.5965%2C1107.5237%2C1107.5374%2C1107.2563%2C1107.0497%2C1107.3286%2C1107.1735%2C1107.5934%2C1107.2476%2C1107.2716%2C1107.4383%2C1107.0486%2C1107.2393%2C1107.3217%2C1107.0839%2C1107.1376%2C1107.1689%2C1107.2746%2C1107.0245%2C1107.3742%2C1107.1254%2C1107.4859%2C1107.1354%2C1107.3669%2C1107.0501&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We investigated binding of hydrogen atoms to small Polycyclic Aromatic\nHydrocarbons (PAHs) - i.e. graphene dots with hydrogen-terminated edges - using\ndensity functional theory and correlated wavefunction techniques. We considered\na number of PAHs with 3 to 7 hexagonal rings and computed binding energies for\nmost of the symmetry unique sites, along with the minimum energy paths for\nsignificant cases. The chosen PAHs are small enough to not present radical\ncharacter at their edges, yet show a clear preference for adsorption at the\nedge sites which can be attributed to electronic effects. We show how the\nresults, as obtained at different level of theory, can be rationalized in\ndetail with the help of few simple concepts derivable from a tight-binding\nmodel of the $\\pi$ electrons."}, "authors": ["Matteo Bonfanti", "Simone Casolo", "Gian Franco Tantardini", "Alessandro Ponti", "Rocco Martinazzo"], "author_detail": {"name": "Rocco Martinazzo"}, "author": "Rocco Martinazzo", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.3650693", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1107.4324v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1107.4324v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1107.4324v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1107.4324v1", "arxiv_comment": null, "journal_reference": null, "doi": "10.1063/1.3650693", "fulltext": "Few simple rules governing hydrogenation of graphene dots\nM. Bonfanti,1 S. Casolo,1 G. F. Tantardini,1, 2, 3 A. Ponti,2 and R. Martinazzo1, 2, 3, a)\n1)\n\narXiv:1107.4324v1 [cond-mat.mes-hall] 21 Jul 2011\n\nDipartimento di Chimica Fisica ed Elettrochimica, Università degli Studi di Milano, v. Golgi 19, 20133 Milan,\nItaly\n2)\nIstituto di Scienze e Tecnologie Molecolari, Consiglio Nazionale delle Ricerche, v. Golgi 19, 20133 Milano,\nItaly\n3)\nCIMaINa, Interdisciplinary Center of Nanostructured Materials and Interfaces, v. Celoria 16, 20133 Milan,\nItaly.\n\nWe investigated binding of hydrogen atoms to small Polycyclic Aromatic Hydrocarbons (PAHs) - i.e. graphene\ndots with hydrogen-terminated edges - using density functional theory and correlated wavefunction techniques.\nWe considered a number of PAHs with 3 to 7 hexagonal rings and computed binding energies for most of\nthe symmetry unique sites, along with the minimum energy paths for significant cases. The chosen PAHs are\nsmall enough to not present radical character at their edges, yet show a clear preference for adsorption at the\nedge sites which can be attributed to electronic effects. We show how the results, as obtained at different level\nof theory, can be rationalized in detail with the help of few simple concepts derivable from a tight-binding\nmodel of the π electrons.\nI.\n\nINTRODUCTION\n\nGraphene, the recently discovered two-dimensional\nform of carbon1 , is a promising material for a future\ncarbon-based nanoelectronics. Its peculiar π − π ∗ electronic band structure, with a linear energy dispersion\nclose to the Fermi level, introduces subtle quantum\npseudo-relativistic effects in the low-energy charge carrier dynamics which hugely impact on the transport\nproperties2–4 . This results, e.g., in a robust anomalous quantum Hall effect5,6 , a universal conductivity\nminimum7 and ballistic transport which can reach the\nmicrometer scale8 . From a practical point of view, the\nsubstrate thickness, the high mobility of its charge carriers and their (high-field) high saturation velocity represent attractive features for the chip-makers. Nanostructuring, however, is needed for applications, e.g. for\ndevising graphene-based logic transistors where a bandgap is needed to achieve high operational on-off ratios.\nGraphene Nanoribbons (GNRs) can be cut which show\neither semiconducting or metallic properties, the latter\ncoming with edge states of unusual magnetic properties, possibly leading to carbon based nanomagnets9,10 .\nLikewise, Graphene Dots (GDs) can be designed to\nhave specific electronic structures and transport properties, by acting just on their shape and their connectivity. GDs have been suggested for realizing spin\nqubits11 , spin filters12,13 and spin-logic devices14 , and\nproposed as biomedical imaging agents15 and light absorbers for photovoltaics16 . Transport properties have\nbeen measured on a variety of dot devices carved entirely from graphene by high-resolution electron-beam\nlithography17 .\nMost of these properties arise entirely from the π electrons and remain unaltered when saturation of the dangling σ bonds occurs, e.g. in forming Polycyclic Aromatic\n\na) Electronic\n\nmail: rocco.martinazzo@unimi.it\n\nHydrocarbons (PAH). The latter offer an enhanced chemical stability, and their nanostructuring (energy level arrangement, interfacing with other materials, etc.) can be\nrealized with the help of well-developed carbon chemistry\nmethods. They have been used as building blocks for\natomically-precise nanoribbon fabrication18 and, in principle, may form the basis for a bottom-up approach to\nrealize arbitrarily complex carbon-nanostructures. PAHs\nhave also been investigated in many other fields, from\npetroleum chemistry to astrochemistry. For instance, in\nthe interstellar medium (ISM), i.e. the extremely rarefied medium which fills the space between stars, the\nobserved abundance of molecular hydrogen cannot be\nexplained by direct gas-phase routes involving H atoms\nonly, rather is believed to occur on the carbonaceous surface of dust grains19,20 and small carbonaceous particles.\nPAHs, which are estimated to lock up ca. 15% of the\ninterstellar carbon, have been suggested as possible catalysts for H2 formation21–23 .\nIn this work, we investigate the reaction of atomic hydrogen with a number of PAHs, complementing previous related studies21,22,24–26 which showed preference for\naddition at the edges of selected PAH molecules. The\nmain aim of this study was to emphasize the importance\nof substrate relaxation (\"geometrical\") effects in determining a preference towards the edges. To this end, we\nselected substrate PAH molecules with relatively small\n(sub-nanometer) dimensions, in such a way to prevent\nany enhanced chemical reactivity at the edges due to a\ntrue radical character (single occupation of a semilocalized edge state), as it occurs for instance at the edges\nof wide zig-zag GNRs. However, as we shall see in the\nfollowing, some edge localization is always present. This\nprovides an enhancement of the edge reactivity which is\nof purely electronic origin and can be easily understood\nin terms of few concepts derivable from a tight-binding\n(Hückel) model for the π electrons.\nIn addition, depending on the number of carbon atoms\navailable for the π electron system and their connectivity,\nthe systems considered can also show a marked sublattice\n\n\f2\n0\n\nII. BASIC PROPERTIES OF π ELECTRONS IN sp2\nCARBON STRUCTURES\n\n2\n\n1\n\nFigure 1. Left: Two- (red) and three- (blue) coordinated edge\nsites in the benzo[ghi]perylene molecule (E and F sites in the\nmain text). Right: E sites having different hypercoordination number (as indicated), along with their hypercoordinated\npartners (white circles).\n\npreference due to the \"alternating paths\" followed by (unpaired) itinerant electrons in graphenes (i.e. due to the\npresence of staggered midgap states). This is similar to\ngraphene27,28 , where these states form the basis for a\npreferential sticking mechanism29,30 forming para-dimers\n(i.e. two H atoms on opposite corners of the same ring).\nWe therefore distinguish two classes of PAHs according\nto whether the number of sites in each sublattice is balanced or not, and show how a final set of rules governing\nthe site reactivity results from the interplay of different\nelectronic effects. The basic concepts underlying these\nrules equally apply to larger systems, and thus allow one\nto easily predict the chemical reactivity of sp2 carbon\nnanostructures with monovalent species forming covalent\nbonds with the substrate.\nImportantly, in the present study we also take advantage of the modest size of the systems investigated, and\nexploit the unique opportunity of assessing the quality\nof the results of commonly used Density Functional Theory (DFT) methods in investigating chemically-derived\ngraphene structures. This is done here by complementing the DFT data with those obtained by using more accurate correlated wavefunction techniques. En passant,\nwe briefly discuss the magnetic properties of pristine and\nhydrogenated PAHs, which turn out to be well predicted\nby Lieb's theorem31 , in agreement with previous studies\non triangularly and hexagonally shaped GDs32 and other\ndefective graphenic structures27,28 .\nThe paper is organized as follows. Section I introduces\nsome basic properties of π-conjugated carbon systems\nwhich underlie the presentation of the results given in\nSection III, after Section II has provided the computational details of our calculations. Section IV summarizes\nand concludes.\nNotice that in the following we adopt a surface science\nterminology, whereby \"adsorption to the substrate\" (here\nmeant to be chemisorption) is used interchangeably with\n\"binding to the molecule\".\n\nCarbon sp2 structures like graphene, GNRs and GDs,\nare characterized by a bipartite lattice where two distinct\nsublattices, A and B, can be identified such that each A\nsite is connected to B sites only and viceversa. This has\nimportant consequences in the one-electron spectrum if,\nas it is the case for such structures, the transfer (hopping)\nenergies beyond the nearest-neighbors are of secondary\nimportance and the orbital overlap can be neglected. Under such circumstances, indeed, it is not difficult to prove\nthat the tight-binding Hamiltonian for the pz orbitals\nof the π electron system has a simple symmetry. Such\nHamiltonian reads as\nX\nHT B =\ntij a†i bj + h.c. = HAB + HAB\n<i,j>\n\nwhere ai (a†i ) annihilates (creates) an electron in site i\nof the sublattice A (similarly for bj (b†j ) and B sublattice sites), tij is the hopping between sites i and j, and\nthe on-site energy (the energy of an isolated pz orbital)\nhas been set to zero. Bipartism is responsible for its\n(off-)block structure - as emphasized here with the introduction of HAB and HBA which collectively describe\nthe transitions A → B and B → A, respectively - and\neasily leads to a symmetric spectrum around \u000f = 0. The\nlatter is also the position of the Fermi level with one electron per site (half-filling), and for this reason the above\nsymmetry is also called electron-hole symmetry. In conjunction with the spatial symmetry, the presence of such\nsymmetry is at the origin of the conically shaped band\nstructure of graphene close to the Fermi level28 , with interesting consequences on band-engineering33,34 and on\nthe chemical reactivity27 . Here, to clarify the connection\nwith chemical reactivity, we focus on some simple results\non the shape of low energy (i.e. close to the Fermi level)\norbitals that directly follow from such electron-hole symmetry.\nEdge localization and hypercoordination. Low\nenergy orbitals show a marked tendency to localize on\nedge sites, as can be easily seen at the tight-binding level.\nTo this end, we perform a lattice \"renormalization\" 33,35\nand focus on one sublattice only (say A) and on the\n\"renormalized\" Hamiltonian H̃ = HAB HBA . The renormalized energies \u000f ̃i are√simply related to the eigenvalues36\nTB\n, \u000f±\n\u000f±\n ̃i , and the renormalized lattice\ni of H\ni = ± \u000f\nis a triangular lattice (the sublattice A of the original\nsystem) with hopping t2 [assuming tij = t for simplicity] and on-site energies t2 Zi , where Zi is the coordination number of the i − th A site in the original lattice. An edge necessarily has undercoordinated (Z = 2)\nsites, hence the ground-state of the renormalized lattice\n(i.e. the highest occupied/lowest unoccupied molecular orbital [HOMO/LUMO] pair of the original lattice)\nnaturally tends to localize on these sites which present\nthe lowest on-site energy. In the following, we name\n\n\f3\n\nc\n\nE6'\n\nE'5 *\n\nE5\n\nE4\nG2\n\nE'4\n\nG\n\nE'1 *\n\nG1\n\nE1\n\nE2\n\nG*2\n\nE'3 *\n\nG1\nE*\n\nE2\n\nE3\n\nE'2\n\nG*\n\n2\n\nE1\n\nE1'\n\nE3\n\nb\n\nE'6 *\n\nE'7 *\n\nE5\n\nE6\n\nG2\n\nE5\n\nG1\n\nE'4\n\nE\n\nG\n\nG*3\n\nE'4 *\nE*3\n\nE3\nE2\n\nE2\n\nG2\n\nG*1\n\nE1'\n\nE1\n\nFigure 2. Balanced (a-d) and imbalanced (e-g) PAHs investigated in this work, shown via one of their possible Lewis\nstructures (carbon atoms are at the vertexes of the hexagons, and are meant to be saturated with hydrogen atoms -not shownif undercoordinated). (a) Pyrene, (b) anthanthrene, (c) benzo[ghi]perylene, (d) coronene, (e) phenalene (peri-naphtene), (f)\nbenzo[c]pyrene and (g) benzo[c]anthanthrene. Also indicated a labeling systems for the adsorption sites considered in this work,\nE and G for \"edge\" and \"graphitic\" sites, respectively. A prime is used for edge sites with hypercoodination number ξ = 2 and a\nstar is used in (e-g) for the majority sites, either E or G, where the unpaired electron (dot) localizes. See Section II for details.\n\nE these two-coordinated edge sites, to distinguish them\nfrom those three-coordinated sites which are also present\nat an edge (F sites), see Fig. 1. Importantly, we expect\nthat low-energy orbitals localize on E sites and, among\nthese, on those sites which show the largest number of undercoordinated neighbors in the renormalized lattice (or,\nequivalently, next-to-nearest E neighbors in the original\nlattice) to hybridize with. As is shown in the following,\nthis latter number turns out to be an important parameter ruling the reactivity of the edge sites; for this reason\nwe call it the hypercoodination number (ξ). Fig. 1, right\npanel, reports some illustrative cases.\nMidgap states and spin alignment. Obviously,\nenergy levels at \u000f = 0, if present, play a major role at\nhalf-filling in determining the reactivity and the magnetic properties of the GDs. It is instructive to see when\nthis situation occurs, as this also adds further constraints\non the spatial behaviour of the low energy orbitals. In\ngeneral, the number of these \"midgap\" states is determined by the site-connectivity but their occupancy (spinalignment) is solely determined by the sublattice imbalance. This follows from a rigorous result proved by Lieb31\nfor the realistic (repulsive) Hubbard model having H T B\nabove as one-electron Hamiltonian: Lieb's theorem states\nthat at half-filling the ground-state spin S is given by\nS = |nA − nB |/2 where nA and nB are the number of\nsites in sublattice A and B, respectively.\nTypically, the number of midgap states matches the\nsublattice imbalance, since this is enough to allow for\n|nA − nB | linearly independent eigenvectors of H T B at\nzero energy, all with null amplitudes on the minority\nsublattice sites37 . [Accordingly, in this case, Lieb's theorem above becomes a sort of Hund's rule applied to the\nmidgap states.]. This a simple algebraic result: for, let\n\nP\nnA > nB and |ψi = i αi |ai i be a trial solution (here\nP\n|ai i = a†i |0i). At zero energy, i hbj |H|ai i αi = 0 must\nhold for j = 1, ..nB , which is a set of nB equations for the\nnA > nB unknowns αi having (at least) nA − nB linearly\nindependent solutions. This also shows that ψ's localize\non the A lattice sites.\nMore generally, the concept of non-adjacent sites in\na N -site bipartite system helps counting the number of\nmidgap states38 . We say that two sites are non-adjacent\nif they are not bound (connected by a transfer integral)\nto each other; for instance, two sites on the same sublattice are non-adjacent. Clearly, there exists a maximal\nset of non-adjacent sites and we call α the sites in this\nset, and β the remaining ones (nα , nβ = N − nα in number, respectively). Each site α binds at least one site β,\notherwise it would represent a completely isolated site.\nArranging one electron per site α, however, we can form\nat most nβ bonds at a time, and therefore we are left\nwith η = nα − nβ = 2nα − N unpaired electrons. Equivalently, we end up with η midgap states localized on the\nmaximal set of non-adjacent sites. The case of a sublattice imbalance discussed above is a special result of this\nrule which, as is evident from the discussion above, can\nbe equivalently re-phrased by defining η to be the number of unpaired electrons in the Lewis structure(s) with\nthe maximum number of π (i.e. double) bonds.\nWe thus see that, in addition to the edge localization\ndiscussed above, depending on the number of sites and\ntheir connectivity, there may exist topological constraints\nwhich force the carbon sp2 -system to have zero energy\nstates. The latter localize on specific lattice positions\nwhich are easily identifiable by inspection.\nThe systems. In the following we mainly focus on\nstructures where the sublattice imbalance is the only\n\n\f4\n\nEbind / eV\n\n3.0\n2.0\n1.0\n0.0\n0\n\n5\n\nn\n\n10\n\n15\n\n0\n\n5\n\nn\n\n10\n\n15\n\nFigure 3. Convergence tests on the active space used in the\nMCQDPT calculations. The energies for H atom adsorption\nare reported for different sites as functions of the number n\nof active electrons in a (n, n) correlation scheme. Left: grey,\nred and blue symbols for sites E1 , E2 and G of the phenalene\nmolecule (structure (e) in Fig.2). Right: grey, red, green and\nblue symbols for sites E1 , E2 , E3 and G of pyrene (structure\n(a) in Fig.2). Horizontal lines mark the values obtained at\nthe DFT level.\n\nsource of migdap states, and call them balanced (S = 0)\nor imbalanced (S > 0), accordingly; in particular, only\nstructures with one unit of imbalance are considered, i.e.\nthey all have S = 1/2, as suggested by Lieb's theorem\nand confirmed by our calculations. The considered structures are shown in Fig.2, together with a labeling system\nfor the sites investigated, which distinguishes the (twocoordinated) edge sites from the graphitic sites, E and G\nin Fig.2. Sites at the edges which are three-coordinated\n(F ) are in between the two categories and will not be\nconsidered in the following. With this exception, all the\nsymmetry unique sites were investigated for binding of\na H atom, with the methods described in the following\nSection.\nNotice that Fig.2 further distinguishes those edge sites\nwhich have the largest possible hypercoordination number (ξ = 2) with a prime and, where appropriate,\nidentifies with a star the majority sites (either edge or\ngraphitic) where the midgap states are expected to localize. As is shown in the following these labels help\nidentifying the sites with the highest hydrogen affinity\n(i.e. the sites with the largest binding energy and the\nsmallest barrier to binding).\n\ncorrelation-consistent type (cc-pVDZ), as implemented\nin GAUSSIAN 0339 . On the DFT-optimized structures\nsingle-point wavefunction calculations were performed\nwith the same basis-set. These are of the multi-state,\nmulti-reference perturbation theory type according to\nthe scheme of Hirao40–43 and Nakano44,45 called MultiConfiguration Quasi-Degenerate Perturbation Theory\n(MCQDPT) and implemented in GAMESS46 . In this\nscheme dynamical correlation is introduced in a MultiConfigurational (MC) wavefunction by properly defining a reference one-electron Hamiltonian based on this\nwavefunction and computing the second-order perturbation correction. The chosen MC reference wavefunction was of the Complete Active Space Self-ConsistentField (CASSCF) type, where n valence electrons are distributed in m orbitals (CAS(n,m) in the following) and\nself-consistency is reached in a variational optimization.\nIn principle, for the PAHs above a consistent procedure\nwould require to put all the π electrons of the substrate\nmolecules and that of the H atoms in the same number of orbitals. This is of course impracticable for all\nbut the smallest molecules, and we therefore resorted to\nan orbital localization procedure which takes advantage\nof the local character of the bond formation process. We\nstarted from Pipek-Mezey ROHF localized orbitals47 and\nincluded in the active space the σ orbital describing the\nformation of the C − H bond and the π orbitals localized\non the sites which are nearest neighbors of the binding\nsite. This gives rise to typical CAS(9,9) or CAS(8,8)\nMCSCF wavefunctions and active spaces for the perturbation correction. For the smaller PAHs, we performed\nsome convergence tests on the size of the active space,\nsee Fig.3 for an example. Finally, we also performed\nplane-wave based, periodic DFT calculations with the\nhelp of the VASP code48,49 , with parameters similar to\nthose used in our previous works27,50 but adapted to a\ncluster calculation. Briefly, we adopted a 20 Åx20 Åx20\nÅ cell and a 700 eV energy cutoff, with a 1x1x1 Γ centered\nk-point grid. Inner electrons were frozen by the projector augmented wave51,52 (PAW) approach, and exchangecorrelation effects were handled with the Perdew-BurkeEznerhof53 (PBE) functional in its spin polarized version.\n\nIV.\nIII.\n\nRESULTS AND DISCUSSION\n\nCOMPUTATIONAL METHODS\nA.\n\nFor each of the selected PAH molecules we computed\nthe binding energy of a hydrogen atom to the sites labeled\nin Fig.2 according to\nEbind = EPAH + EH − EPAH-H\nwith two different electronic structure methods. PAH\nstructures were optimized at the (unrestricted) Density Functional Theory (DFT) level using the popular B3LYP hybrid exchange-correlation functional with\nDunning's double-valence, atom-centered basis set of the\n\nGraphitic vs. Edge sites\n\nWe start by showing the preference for adsorption\non the edge sites which was already noted by several\nauthors21,22,24–26 . Fig. 4 shows the computed binding\nenergy for all the E and G sites of the structures (a-d)\nof Fig. 2, as obtained in the ground-state spin manifold\nof the total system54 , S = 1/2. The DFT results (black\nhistograms) compare very well with the available literature data. For instance, for the pyrene molecule we find\n1.53, 1.67 and 1.09 eV for the sites E1 , E2 and E3 which\ncompare well with the values 1.50, 1.61 and 1.06 eV re-\n\n\f5\n2.5\n\n2.5\n\n(a)\n\n(b)\n\n(c)\n\n(d)\n\n(a) (b) (c) (d)\n2.0\n\n1.5\n\n1.5\n\n1.0\n\n1.0\n\n0.5\n\n0.5\n\nEbind / eV\n\nEbind / eV\n\n2.0\n\n0.0\n\n0.0\n\nE1 E2 E3\n\nE1 E2 E3 E4 E5 E6\n\nE1 E2 E3 E4 E5 E6\n\nE\n\nG\n\nG1 G2\n\nG1 G2\n\nG\n\nFigure 4. Binding energies for E (left) and G (right) sites in the structures (a-d) of Fig. 2. DFT and MCQDPT results are\nrepresented as black and green histograms, respectively, according to the labeling system of Fig.2.\n\nB.\n\n(a)\n\n(b)\nFigure 5. (a) Optimized structures for the singly hydrogenated coronene molecule. Left and right panel for adsorption on the G and E site, respectively. (b) Reorganization\nenergy for adsorption of a H atom in the indicated sites of\nthe benzo[ghi]perlyene molecule.\n\nGeometric vs. electronic effects\n\nBefore analysing the results in details, we show here\nthat \"geometrical\" effects per se cannot explain the different behaviour of edge and inner sites evident in Fig.4.\nBinding of a H atom on a sp2 −carbon atom requires a\nsp2 → sp3 rehybridization which leads to a tetrahedral\nreorganization of the bonding partners, as is shown in\nFig. 5 (a) for the case of the coronene molecule. Without\nsuch re-arrangement of the local environment no binding\nwould occur: a local substrate relaxation is essential to\n\"prepare\" the electronic structure for binding, but this\ntoo is affected by the overall electronic structure which\nis always dominated by molecular orbitals spreading all\nover the molecule.\nA simple (but wrong) argument would suggest that the\nsame local re-arrangement which occurs upon bonding\n(but without the H \"probe\") requires less energy for an\nedge than for an inner carbon atom, since in the first\ncase at least one of the bonding partners is a monovalent\nspecies not embedded in the molecular network. We can\ndefine this reorganization energy as\n∗\nER = Eeq\n(P AH) − Eeq (P AH)\n\ncently obtained by Rasmussen et al.26 with a real-space\nimplementation of the DFT-PBE level of theory.\nClearly, a striking difference between E and G sites\nis apparent from Fig. 4: binding energies at an E site\ncan be as large as twice the binding energy for a G site.\nThe latter, on the other hand, compare rather well with\nthe value of the hydrogen atom adsorption energy in\ngraphene27,55,56 and graphite56,57 . This simple finding,\ntogether with a corresponding behaviour for barrier energies to be discussed below, already suggests that the\nedges of realistic samples could be active sites where hydrogenation starts and propagates into the bulk.\n\nwhere Eeq (P AH) is the energy of the pristine molecule in\n∗\nthe equilibrium configuration and Eeq\n(P AH) is the energy of the molecule in the same distorted configuration\nthat it takes when binding the H atom. In contrast to\nthe expectation above, we find that ER for an E site is\nalways larger than that for a G site. For coronene, for\ninstance, we obtain 1.40 eV and 1.04 eV, respectively, at\nthe DFT level of theory, and similar values are found for\nall the structures considered in this work: the reorganization energy is ∼1.4±0.1 eV for E sites and ∼1.0±0.1\neV for G sites, see for instance Fig. 5(b) for the case of\nthe benzo[ghi]perylene. We thus see that the preference\nin binding a H atom to an edge site occurs despite the\nlarger reorganization energy needed at these kind of sites.\nThis allows us to conclude that this preference is due to\nthe electronic effects introduced in Section II.\n\n\f6\n3.00\n\n2.50\nξ=2\n\nE sites\nξ=1\n\nEbind / eV\n\n2.00\n1.50 ξ = 0\n\n1.00\n\nG sites\n0.50\n\n0.00\n0.00\n\n0.50\n\n1.00\n\n1.50\nN pi\n\n2.00\n\n2.50\n\n3.00\n\nFigure 6. Binding energies as functions of the site normalized\npopulations of the substrate HOMO. Black, red, green and\nblue symbols for structures (a-d), respectively. Also indicated\nthe hypercoordination number of the edge sites.\n\nC.\n\nHypercoordination\n\nNext we discuss the results of Fig. 4 in detail since,\napart from the overall behaviour, the binding energies\ncan take quite different values depending on the site they\nrefer to. A closer inspection reveals that the values for\nthe interesting E sites correlate very well with the hypercoordination number introduced in Section II: the lager\nis the hypercoordination the larger is the binding energy.\nThis can be made evident by reporting the results of Fig.\n4 as functions of the site populations pi of the HOMO;\nthe latter are meant here per spin species, and were obtained by a Mulliken analysis of the molecular orbitals\nof the pristine molecules, as computed with a restricted\nKohn-Sham determinant. This is shown in Fig.6 where\nthe populations have been normalized to the values they\nwould have if the HOMOs spread over all carbon atoms\n(1/N ). Fig. 6 shows that the binding energies correlate\nwell with N pi . The trend is roughly linear and different for the E and the G sites, but we did not attempt\nto extract any behaviour because of the limited number of data available. More importantly, Fig. 6 shows\nthat the energies correlate well with the hypercoordination number ξ of the site, particularly if the comparison\nis made between sites of the same molecule. As already\nemphasized above, this number can be readily obtained\nby simply inspecting the carbon structure under study.\n\nD.\n\nImbalanced structures\n\nNext we move to the more complicated situation (the\ndoublet structures (e-g) of Fig.2)) where topological constraints lead to the appearance of zero-energy modes and\nadditional \"localization\". Analogously to the results of\nFig. 4, we find also in this case a clear distinction between edge and graphitic sites. This is evident from Fig.\n7 where we report the binding energies for the structures\n\n(e-g) on a larger energy scale than the one used in Fig.\n4. This is one of the consequences of the additional electronic effect due to the appearance of the (singly occupied) midgap state: binding of two radical species only\nrequires coupling of their unpaired electrons and is thus\ntypically much more energetic than in the case where a\nbond has to be broken. A further consequence is a rough\nsplitting of the results into two \"branches\", according to\nwhether the relevant site belongs or not to the majority\nset (red and blue blocks of results in Fig. 7). Notice that,\naccording to Lieb's theorem, in the first case the resulting total spin state is a singlet, whereas in the second\ncase is a triplet. This indeed what we find: Fig.7 shows\nthat for adsorption of a H atom on a minority site the\nbinding energy in the triplet state is larger than in the\nsinglet. Not shown in the figure, we also checked that\nadsorption on a majority site occurs more favourably in\nthe singlet manifold; this is true for all cases considered\nbut the site G1 of structure (g) where we find that H\nbinds more favourably in the triplet state58 .\nWe thus see that, in the case considered in this section,\nthe energy ordering arises from the complicated interplay\nbetween coordination, hypercoordination and topological frustration. For this reason, in plotting the results\nas functions of the normalized populations, analogously\nto Fig. 6, we consider separately the majority and the\nminority sites, reported in the left and right panels of\nFig. 8, respectively. We see now that a good correlation\nbetween the binding energies and the HOMO populations is found only for the majority sites, nevertheless\nthe hypercoordination number remains a good parameter for establishing the right energy ordering within each\ncategory: the binding energy is found to monotonically\nincrease when increasing ξ. In general, majority sites\nshow larger binding energies of minority sites with the\nsame coordination number (i.e. either E or G) but, even\nfor the same molecule, a large hypercoordination may\noffset the topological frustration of a minority site. For\ninstance, the (minority) site E1 in structure (g) shows a\nlarger binding energy than the (majority) site E3 ; notice\nthough that the \"expected\" ordering is restored if comparison is made between results for the same spin manifold. In general, however, the most favoured (relevant)\nfinal hydrogenated structures are always easily identified:\nthey are obtained by binding a H atom to the majority\nE sites with the largest hypercoordination number.\nNotice further that imbalanced structures also arise after a H atom has been adsorbed onto any of the balanced\nstructures (a-d), since formation of a CH bond effectively\nremoves one carbon pz orbital from the π network and\nthus acts as a vacancy. In this case, hydrogen bonding\nto form a dimer follows the same rules. For instance,\nRauls and Hornekaer21 used DFT-PW91 to systematically investigate hydrogenation of coronene up to saturation. They found that addition of a H atom to the most\nstable H-coronene structure (i.e. with a first H bound\nto a E site) is most favoured in the ortho-edge position,\ni.e. on the E site which is nearest neighbor to the first\n\n\f7\n\n(e)\n\n(e)\n\n(g)\n\n(f)\n\n3.0\n\n2.5\n\n2.5\n\n(g)\n\nS=0\n\n0.5\n\n0.5\n\nS=1\n\nS=0\n\nS=1\n\n1.0\n\nS=1\n\n1.5\nS=0\n\nEbind / eV\n\nS=0\n\nS=1\n\nS=0\n\n1.0\n\nS=0\n\nS=0\n\nS=0\n\n1.5\n\n2.0\nS=1\n\nS=1\nS=1\n\nEbind / eV\n\n2.0\n\nS=1\n\nS=0\n\nS=1\n\n3.0\n\n(f)\n\n0.0\n\n0.0\n\nE1\n\nE2\n\nE2 E3 E5\n\nE1\n\nE4\n\nE3 E4 E6 E7\n\nE1\n\nE2\n\nG\n\nE5\n\nG2\n\nG1\n\nG1 G3\n\nG2\n\n3.50\n\n3.00 ξ = 1\n\n3.00\n\n2.50\n\n2.50\n\n2.00\n\n*\n\nE sites\n\n1.50\n\nξ=2\n\nE sites\n\nE / eV\n\n3.50\n\nEbind / eV\n\nEbind / eV\n\n4.00\n\nξ=1\n\n2.00\n\nξ=0\n\n0.5\n\n0.5\n\n0.0\n\n0.0\n\n-0.5\n\n-0.5\n\n-1.0\n\n-1.0\n\nG sites\n\n0.50\n\n0.50\n\n0.00\n0.00 1.00 2.00 3.00 4.00 5.00\nN pi\n\n0.00\n0.00\n\nG sites\n0.05\n\n0.10\nN pi\n\n0.15\n\n0.20\n\nFigure 8. Binding energies as functions of the site normalized\npopulations of the substrate HOMO. Black, red and green\nsymbols for structures (e-g), respectively. Also indicated the\nhypercoordination number of the edge sites. Left and right\npanels for majority and minority sites, respectively.\n\n-2.0\n\n-2.0\n\n0.0\n\n0.0\n\n-0.5\n\n-0.5\n\n-1.0\n\n-1.0\n\nadsorption site. This is a majority site with an effective\ncoordination number Z = 1, which would correspond to\nan additional type of site, \"D\". Furthermore, five E sites\nexist in H-coronene with ξ = 1 having a large binding energy. Analogous results holds for pyrene, see Rasmussen\net al.26 .\n\nAdsorption profiles\n\nWe now look at the full energy profiles (minimum energy paths) for a H atom adsorption, focusing on few\nillustrative cases. We show in particular that the arguments used so far for the adsorption energies equally apply to the energy barriers for the H atom sticking. Thus,\nthe energy ordering rules drawn in the previous sections\nnot only determines the thermodynamics but also the kinetics of the hydrogenation process.\n\n(c)\n\n-1.5\n-2.0\n0.5\n\nE.\n\n-1.5\n\n1.00\n\nE / eV\n\n*\n\n(b)\n\n(a)\n\n1.50\n\n-1.5\n1.00\n\n1.0\n\n1.5 2.0\ndC-H / A\n\n2.5\n\n(d)\n0.5\n\n1.0\n\n1.5 2.0\ndC-H / A\n\n2.5\n\nE / eV\n\nξ=2\n\n4.00\n\nE / eV\n\nFigure 7. Binding energies for E (left) and G (right) sites in the structures (e-g) of Fig. 2. DFT and MCQDPT results\nare represented as black and colored histograms, respectively, according to the labeling system of Fig.2. The color code (for\nMCQDPT results only) is red for majority and blue for minority sites; occasionally, both the singlet (full color) and the triplet\n(shaded) spin manifolds have been considered, as indicated. See text for details.\n\n-1.5\n-2.0\n3.0\n\nFigure 9. Hydrogen adsorption paths on pyrene (a-b) and\ncoronene (c-d), on the left for an edge site and on the right\nfor a graphitic site. Black and green symbols for DFT and\nMCQDPT results. Lines are spline interpolation to guide the\neyes.\n\nHydrogen atom binding is an activated process with an\nenergy barrier which typically prevents adsorption under room temperature conditions29,59 . For instance, in\ngraphite (graphene) the barrier is ∼0.2 eV high and this\nprevented for some time observation of a chemisorbed\nhydrogen phase. This barrier is typically linearly related\nto the binding energy itself27 , in accordance with the\ngeneral finding (known as Brønsted–Evans–Polayni rule)\nthat a larger reaction exothermicity is accompanied by a\nlower energy barrier. The same applies here, as is shown\nfor the cases of pyrene and coronene reported in Fig.9,\n\n\f8\n0.5\n0.0\n\nE / eV\n\n-0.5\n-1.0\n-1.5\n\nE / eV\n\n(d)\n\n0.5\n\n0.5\n\n0.2\n\n0.0\n\n0.0\n\n-0.5\n\n-0.2\n\n-1.0\n\n-0.5\n\n-1.5\n\n(b)\n\n-0.8\n-1.0\n0.5\n\n1.0\n\n1.5 2.0\ndC-H / A\n\n2.5\n\n(c)\n0.5\n\n1.0\n\n1.5 2.0\ndC-H / A\n\n2.5\n\nE / eV\n\n(a)\n\n-2.0\n\n-2.0\n-2.5\n3.0\n\nFigure 10. Adsorption curves for a second H atom in the\n(graphitic) ortho- (a), meta- (b) and para- (c) positions with\nrespect to a first H atom, as indicated in the insets. Grey and\ncolored symbols for DFT and MCQDPT results, respectively,\nand lines are spline interpolation to the data for guiding the\neyes. Panel (d) shows the spin-density of the H-coronene substrate with a H atom adsorbed on a G site.\n\nfor both an E and a G site. Such curves have been obtained by fixing the CH distance at the desired value and\nperforming a full structural relaxation of the remaining\ndegrees of freedom at the DFT-B3LYP level of theory.\nAs is evident from the figure, a larger binding energy\nreflects a smaller adsorption barrier, which can be even\nalmost vanishing when H binding occurs at an edge site.\nSimilar results hold for all the paths considered in this\nwork, i.e. for H atom adsorption on most of the sites\nconsidered in Fig.2. As already noticed above this finding suggests that the edges of realistic samples could be\nactive sites where hydrogenation starts and propagates\ninto the bulk: addition of H atoms to E sites modifies\nthe sublattice imbalance and at the same time effectively\nconverts a number of F (G) sites into E (F ) sites.\n\nfunction calculations to give a larger binding energy than\nDFT for the graphitic sites, see e.g. the right panel of\nFig. 4. This is particularly evident for the G site of\nthe coronene molecule: Fig. 9 (d) shows that binding\nto this site is ∼0.2 eV stronger when computed at the\nMCQDPT than at the DFT level of theory, and that a\ncorresponding trend is found for the barrier. However,\ngiven the limited number of active electrons that could\nbe consistently included in the wavefunction calculations\nwe doubt that this discrepancy is a manifestation of a\ntrue physical effect. This is made more evident in Fig.\n10, where the adsorption paths for a second H atom onto\nthe ortho-, meta- and para- position to the first G sites\nare displayed for the two different levels of theory. We\nchose to focus on this system because of the role it played\nas a cluster model for graphene (graphite) since Jeloaca\nand Sidis60 used it to investigate H atom adsorption on\nthe graphitic sites. As is clear from Fig. 10 the above\ndiscrepancy doubles when adsorption proceeds in parabut vanishes for the ortho- site, thereby suggesting that\nthe \"extension\" of the structure may be a source of error\nin the MCQDPT calculations. Notice that the wavefunction calculations are always two-state MCQDPT calculations, in order to correctly handle the barrier region,\nand included in some cases a level shift correction to get\nrid of the intruder state problem.\nFinally, we performed few additional calculations of\nthe binding energies with a very different implementation of the DFT-GGA theory, namely a Γ-point, periodic\nplane-wave calculation using a pure GGA functional as\ndescribed in Section III. We find for coronene 1.42 and\n0.67 eV for adsorption on the E and the G site, respectively, which compare very well with the values obtained\nwith the hybrid B3LYP functional, namely 1.42 and 0.61\neV. The same holds for the adsorption of a second atom\non the same sites considered in Fig. 10: we obtain 2.04,\n0.70 and 1.82 eV for the ortho-, meta- and para- graphitic\nsites, to be compared with 2.05, 0.69 and 1.65 eV. Notice\nthat also in this case the larger discrepancy occurs at the\npara- position, which might signal the need of additional\ncare in the correlation problem.\n\nV.\nF.\n\nCorrelation level\n\nFinally, we focus on some technical aspects concerning the treatment of electron correlation. Though not\nemphasized so far, the results of the DFT-B3LYP calculations have been shown in parallel to the results of\nmore accurate, though more expensive, MCQDPT calculations (see Section III) which we performed on the\nDFT-optimized structures. As is evident from Fig.s 4,7\nand 9 the two sets of data agree well with each other,\nthe discrepancies being at most few tenths of eV in few\ncases. No general trend is found in the comparison, except maybe for a general tendency of the correlated wave-\n\nSUMMARY AND CONCLUSIONS\n\nWe considered atomic hydrogen adsorption on a number of small graphenic structures (PAH molecules) in order to investigate the enhanced reactivity of the edge sites\nalready observed by several authors. To this end, we selected only small structures to prevent the formation of\nradical species at the edge, as it occurs with the formation of zero-energy states at the edges of large zig-zag\nnanoribbons. Surprisingly, we found that some edge localization always occurs as a consequence of the reduced\ncoordination of E sites which translates into a lower onsite energy in a renormalized lattice. Further localization\noccurs when E sites are highly coordinated in the renormalized lattice, as measured by a \"hypercoordination\"\n\n\f9\nnumber ξ. We found a very good correlation between the\nbinding (barrier) energies and the coordination and hypercoordination numbers: the most favoured sites for H\natom adsorption (but likely for adsorption of any monovalent species used to form covalent bonds with carbon)\nare those showing the lowest coordination and the largest\nhypercoordination numbers (E 0 sites in Fig. 2). We also\nfound, similarly to graphene, that further enhancement\nof the reactivity of specific lattice positions may arise\nfrom the same topological frustration which gives rise to\nmidgap states, i.e. that occurring when the maximal\nset of non-adjacent sites exceeds half the total number\nof sites. In this case a preference towards the maximal\nset of non-adjacent sites adds to the above preference for\ncoordination and high hypercoordination.\nWe obtained these results in small (subnanometersized) graphene structures, but they are expected to hold\nfor more complex structures. For instance, hydrogenation is known to occurs much more easily on a zig-zag\nthan on an armchair edge of large area graphene: May\net al.25 , for instance, extrapolated DFT values computed\non finite size graphenes towards the infinite size limit and\nobtained 2.86±0.15 eV for the zig-zag edge and 1.74±0.11\neV for the armchair one. This is consistent with the\n\"rules\" found here. Indeed, both edges have F and E\nsites, but only zig-zag E sites can be fully hypercoordinated: ξ = 2 in this case, to be compared with ξ = 0 for\nthe E sites of an armchair edge.\nBeside their simplicity, one of the main advantage of\nthe derived rules is that they are based on local considerations which hold irrespective of the global electronic\nproperties of the carbon nanostructure under study. As\na consequence, our findings suggest that exposing arbitrarly shaped graphene dots to controlled amount of\natomic hydrogen (e.g. under cold plasma conditions) hydrogenation starts from the edges and propagates into the\nbulk in a much more efficient way than expected solely\non the basis of the bulk adsorption energetics.\n\nREFERENCES\n1 K.\n\nS. Novoselov, A. K. Geim, S. V. Morozov, D. Jiang,\nY. Zhang, S. V. Dubonos, I. V. Gregorieva, and A. A.\nFirsov, Science 306, 666 (2004).\n2 A. H. Castro Neto, F. Guinea, N. M. R. Peres, K. S.\nNovoselov, and A. K. Geim, Rev. Mod. Phys. 81, 109 (2009).\n3 N. M. R. Peres, Rev. Mod. Phys. 82, 2673 (2010).\n4 S. Das Sarma, S. Adam, E. H. Hwang, and E. Rossi, Rev.\nMod. Phys. 83, 407 (2011).\n5 K. S. Novoselov, A. K. Geim, S. V. S. V. Morozov,\nD. Jiang, M. I. Katsnelson, I. V. Gregorieva, S. V.\nDubonos, and A. A. Firsov, Nature 438, 197 (2005).\n6 Y. Zhang, Y.-W. Tan, H. L. Stormer, and P. Kim, Nature\n438, 201 (2005).\n7 A. K. Geim and K. S. Novoselov, Nat. Mater. 6, 183 (2007).\n8 F. Schedin, A. K. Geim, S. V. Morozov, E. W. Hill,\nP. Blake, M. I. Katsnelson, and K. S. Novoselov, Nat.\nMater. 6, 652 (2007).\n9 T. Enoki, Y. Kobayashi, and K.-I. Fukui, Int. Rev. Phys.\nChem. 26, 609 (2007).\n\n10 Y.-W.\n\nSon, M. L. Cohen, and S. G. Louie, Phys. Rev. Lett.\n97, 216803 (2006).\n11 B. Trauzettel, D. V. Bulaev, D. Loss, and G. Burkard,\nNat. Phys. 3, 192 (2007).\n12 W. Sheng, Z. Y. Ning, Z. Q. Yang, and H. Guo, Nanotechnology 21, 385201 (2010).\n13 M. Ezawa, Phys. Rev. B 77, 155411 (2008).\n14 W. L. Wang, O. V. Yazyev, S. Meng, and E. Kaxiras, Phys.\nRev. Lett. 102, 157201 (2009).\n15 S. Zhu, J. Zhang, C. Qiao, S. Tang, Y. Li, W. Yuan, B. Li,\nL. Tian, F. Liu, R. Hu, H. Gao, H. Wei, H. Zhang, H. Sun,\nand B. Yang, Chem. Commun. 47, 6858 (2011).\n16 X. Yan, X. Cui, B. Li, and L.-s. Li, Nano Letters 10, 1869\n(2010).\n17 L. A. Ponomarenko, F. Schedin, M. I. Katsnelson,\nR. Yang, E. W. Hill, K. S. Novoselov, and A. K. Geim,\nScience 320, 356 (2008).\n18 J. Cai, P. Ruffieux, R. Jaafar, M. Bieri, T. Braun,\nS. Blankenburg, M. Muoth, A. P. Seitsonen, M. Saleh,\nX. Feng, K. Mullen, and R. Fasel, Nature 466, 470 (2010).\n19 R. J. Gould and E. E. Salpeter, Astrophy. J. 138, 393\n(1963).\n20 D. Hollenbach and E. E. Salpeter, Astrophy. J. 163, 155\n(1971).\n21 E. Rauls and L. Hornekaer, Astrophys. J. 679, 531 (2008).\n22 J. Charles W. Bauschlicher, The Astrophysical Journal Letters 509, L125 (1998).\n23 E. Habart, F. Boulanger, L. Verstraete, C. M. Walmsley, and G. Pineau des Forêts, A&A 414, 531 (2004).\n24 J. A. Sebree, V. V. Kislov, A. M. Mebel, and T. S. Zwier,\nJ. Phys. Chem. A 115, 6255 (2010).\n25 K. May, B. V. Unterreiner, S. Dapprich, and R. Ahlrichs,\nPhys. Chem. Chem. Phys. 2, 5089 (2000).\n26 J. A. Rasmussen, G. Henkelman, and B. Hammer, J. Chem.\nPhys. 134, 164703 (2011).\n27 S. Casolo, O. M. Løvvik, R. Martinazzo, and G. F. Tantardini, J. Chem. Phys. 130, 054704 (2009).\n28 R. Martinazzo, S. Casolo, and G. F. Tantardini, Physics\nand applications of Graphene - Theory, chapter 3, InTech, 2011.\n29 L. Hornekaer, E. Rauls, W. Xu, Ž. Šljivančanin, R. Otero,\nI. Stensgaard, E. Laeegsgaard, B. Hammer, and F. Besenbacher, Phys. Rev. Lett. 97, 186102 (2006).\n30 N. Rogeau, D. Teillet-Billy, and V. Sidis, Chem. Phys.\nLett. 431, 135 (2006).\n31 E. H. Lieb, Phys. Rev. Lett. 62, 1201 (1989).\n32 J. Fernandez-Rossier and J. J. Palacios, Phys. Rev. Lett.\n99, 177204 (2007).\n33 R. Martinazzo, S. Casolo, and G. F. Tantardini, Phys.\nRev. B 81, 245420 (2010).\n34 S. Casolo, R. Martinazzo, and G. F. Tantardini, J. Phys.\nChem. C 115, 3250 (2011).\n35 G. G. Naumis, Phys. Rev. B 76, 153403 (2007).\n36 The same holds for eigenvectors, see Ref.33 .\n37 M. Inui, S. A. Trugman, and E. Abrahams, Phys. Rev. B 49,\n3190 (1994).\n38 O. V. Yazyev, Reports on Progress in Physics 73, 056501\n(2010).\n39 M. J. Frisch, G. W. Trucks, H. B. Schlegel, G. E. Scuseria, M. A. Robb, J. R. Cheeseman, J. A. Montgomery, Jr.,\nT. Vreven, K. N. Kudin, J. C. Burant, J. M. Millam, S. S.\nIyengar, J. Tomasi, V. Barone, B. Mennucci, M. Cossi,\nG. Scalmani, N. Rega, G. A. Petersson, H. Nakatsuji,\nM. Hada, M. Ehara, K. Toyota, R. Fukuda, J. Hasegawa,\nM. Ishida, T. Nakajima, Y. Honda, O. Kitao, H. Nakai,\nM. Klene, X. Li, J. E. Knox, H. P. Hratchian, J. B.\nCross, V. Bakken, C. Adamo, J. Jaramillo, R. Gomperts,\nR. E. Stratmann, O. Yazyev, A. J. Austin, R. Cammi,\nC. Pomelli, J. W. Ochterski, P. Y. Ayala, K. Morokuma,\nG. A. Voth, P. Salvador, J. J. Dannenberg, V. G. Zakrzewski, S. Dapprich, A. D. Daniels, M. C. Strain,\n\n\f10\nO. Farkas, D. K. Malick, A. D. Rabuck, K. Raghavachari,\nJ. B. Foresman, J. V. Ortiz, Q. Cui, A. G. Baboul, S. Clifford, J. Cioslowski, B. B. Stefanov, G. Liu, A. Liashenko,\nP. Piskorz, I. Komaromi, R. L. Martin, D. J. Fox,\nT. Keith, M. A. Al-Laham, C. Y. Peng, A. Nanayakkara,\nM. Challacombe, P. M. W. Gill, B. Johnson, W. Chen,\nM. W. Wong, C. Gonzalez, and J. A. Pople, Gaussian 03,\nRevision C.02, Gaussian, Inc., Wallingford, CT, 2004.\n40 K. Hirao, Chem. Phys. Lett. 190, 374 (1992).\n41 K. Hirao, Chem. Phys. Lett. 196, 397 (1992).\n42 K. Hirao, Int. J. Quant. Chem. S26, 517 (1992).\n43 K. Hirao, Chem. Phys. Lett. 201, 59 (1992).\n44 H. Nakano, K. Nakayama, K. Hirao, and M. Dupuis, J.\nChem. Phys. 106, 4912 (1997).\n45 T. Hashimoto, H. Nakano, and K. Hirao, J. Mol. Struc.\n451, 25 (1998).\n46 M. Schmidt, K. Baldridge, J. Boatz, S. Elbert, M. Gordon, J. Jensen, S. Koseki, N. Matsunaga, K. Nguyen,\nS. Su, T. Windus, M. Dupuis, and J. Montgomery, J. Comput. Chem. 14, 1347 (1993), Version April 11, 2008.\n47 J. Pipek and P. Z. Mezey, J. Chem. Phys. 90, 4916 (1989).\n48 G. Kresse and J. Hafner, Phys. Rev. B 49, 14251 (1994).\n49 G. Kresse and H. J., Phys. Rev. B 47, 558 (1993).\n50 S. Casolo, E. Flage-Larsen, O. M. Løvvik, G. R. Darling,\n\nand G. F. Tantardini, Phys. Rev. B 81, 205412 (2010).\nE. Blöchl, Phys. Rev. B 50, 17953 (1994).\n52 G. Kresse and D. Joubert, Phys. Rev. B 59, 1758 (1999).\n53 J. P. Perdew, K. Burke, and M. Ernzerhof, Phys. Rev.\nLett. 77, 3865 (1996).\n54 For DFT calculations we refer here to the spin of the Kohn-Sham\nnon-interacting determinant. Spin contamination is always found\nminimal, i.e. the determinants are close to be eigenstates of the\ntotal (squared) spin operator, apart from having a well defined\nprojection.\n55 Y. Ferro, F. Marinelli, and A. Allouche, 116, 8124 (2002).\n56 A. Allouche, Y. Ferro, T. Angot, C. Thomas, and J.-M.\nLayet, J. Chem. Phys. 123, 124701 (2005).\n57 X. Sha and B. Jackson, Surf. Sci. 496, 318 (2002).\n58 This is likely due to the importance of next-to-nearest neighbor\nhing hoppings which are implicitly included in the ab-initio calculations and are enough to invalidate Lieb's theorem. Notice\nthat in this way the resulting chemical structure keeps unaltered\ntwo naphtalene moieties.\n59 L. Hornekaer, Ž. Šljivančanin, W. Xu, R. Otero, E. Rauls,\nI. Stensgaard, E. Laegsgaard, B. Hammer, and F. Besenbacher, Phys. Rev. Lett. 96, 156104 (2006).\n60 L. Jeloaica and V. Sidis, Chem. Phys. Lett. 300, 157 (1999).\n51 P.\n\n\f"}