{"id": "http://arxiv.org/abs/1005.1907v1", "guidislink": true, "updated": "2010-05-11T18:46:35Z", "updated_parsed": [2010, 5, 11, 18, 46, 35, 1, 131, 0], "published": "2010-05-11T18:46:35Z", "published_parsed": [2010, 5, 11, 18, 46, 35, 1, 131, 0], "title": "Dilatancy transition in a granular model", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.5609%2C1005.0796%2C1005.3001%2C1005.2144%2C1005.2132%2C1005.1460%2C1005.2785%2C1005.4073%2C1005.5360%2C1005.2276%2C1005.3299%2C1005.2423%2C1005.2983%2C1005.0613%2C1005.1414%2C1005.1864%2C1005.1310%2C1005.0581%2C1005.2068%2C1005.5333%2C1005.1263%2C1005.5144%2C1005.5554%2C1005.0772%2C1005.5087%2C1005.4953%2C1005.4524%2C1005.2764%2C1005.1782%2C1005.2859%2C1005.0639%2C1005.0361%2C1005.1703%2C1005.4514%2C1005.3190%2C1005.2281%2C1005.1619%2C1005.2962%2C1005.1907%2C1005.2221%2C1005.3395%2C1005.5389%2C1005.3000%2C1005.4512%2C1005.3280%2C1005.2918%2C1005.0838%2C1005.2915%2C1005.1523%2C1005.0259%2C1005.0764%2C1005.1755%2C1005.3356%2C1005.1292%2C1005.4850%2C1005.5649%2C1005.0446%2C1005.2511%2C1005.2929%2C1005.3580%2C1005.2002%2C1005.4173%2C1005.0992%2C1005.5325%2C1005.4462%2C1005.5347%2C1005.2229%2C1005.4893%2C1005.3350%2C1005.2497%2C1005.1070%2C1005.5546%2C1005.1253%2C1005.0625%2C1005.4811%2C1004.0582%2C1004.3122%2C1004.3584%2C1004.4211%2C1004.0027%2C1004.5353%2C1004.5544%2C1004.2660%2C1004.0305%2C1004.3950%2C1004.1562%2C1004.0317%2C1004.2832%2C1004.4830%2C1004.1270%2C1004.4567%2C1004.1696%2C1004.2369%2C1004.2292%2C1004.1784%2C1004.4780%2C1004.5261%2C1004.3549%2C1004.1840%2C1004.1740%2C1004.2863&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Dilatancy transition in a granular model"}, "summary": "We introduce a model of granular matter and use a stress ensemble to analyze\nshearing. Monte Carlo simulation shows the model to exhibit a second order\nphase transition, associated with the onset of dilatancy.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.5609%2C1005.0796%2C1005.3001%2C1005.2144%2C1005.2132%2C1005.1460%2C1005.2785%2C1005.4073%2C1005.5360%2C1005.2276%2C1005.3299%2C1005.2423%2C1005.2983%2C1005.0613%2C1005.1414%2C1005.1864%2C1005.1310%2C1005.0581%2C1005.2068%2C1005.5333%2C1005.1263%2C1005.5144%2C1005.5554%2C1005.0772%2C1005.5087%2C1005.4953%2C1005.4524%2C1005.2764%2C1005.1782%2C1005.2859%2C1005.0639%2C1005.0361%2C1005.1703%2C1005.4514%2C1005.3190%2C1005.2281%2C1005.1619%2C1005.2962%2C1005.1907%2C1005.2221%2C1005.3395%2C1005.5389%2C1005.3000%2C1005.4512%2C1005.3280%2C1005.2918%2C1005.0838%2C1005.2915%2C1005.1523%2C1005.0259%2C1005.0764%2C1005.1755%2C1005.3356%2C1005.1292%2C1005.4850%2C1005.5649%2C1005.0446%2C1005.2511%2C1005.2929%2C1005.3580%2C1005.2002%2C1005.4173%2C1005.0992%2C1005.5325%2C1005.4462%2C1005.5347%2C1005.2229%2C1005.4893%2C1005.3350%2C1005.2497%2C1005.1070%2C1005.5546%2C1005.1253%2C1005.0625%2C1005.4811%2C1004.0582%2C1004.3122%2C1004.3584%2C1004.4211%2C1004.0027%2C1004.5353%2C1004.5544%2C1004.2660%2C1004.0305%2C1004.3950%2C1004.1562%2C1004.0317%2C1004.2832%2C1004.4830%2C1004.1270%2C1004.4567%2C1004.1696%2C1004.2369%2C1004.2292%2C1004.1784%2C1004.4780%2C1004.5261%2C1004.3549%2C1004.1840%2C1004.1740%2C1004.2863&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We introduce a model of granular matter and use a stress ensemble to analyze\nshearing. Monte Carlo simulation shows the model to exhibit a second order\nphase transition, associated with the onset of dilatancy."}, "authors": ["David Aristoff", "Charles Radin"], "author_detail": {"name": "Charles Radin"}, "author": "Charles Radin", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/s10955-011-0180-4", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1005.1907v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1005.1907v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Future versions can be obtained from:\n  http://www.ma.utexas.edu/users/radin/papers/shear2.pdf", "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1005.1907v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1005.1907v1", "journal_reference": "J. Stat. Phys. 143(2011), 215-225", "doi": "10.1007/s10955-011-0180-4", "fulltext": "arXiv:1005.1907v1 [cond-mat.soft] 11 May 2010\n\nDilatancy Transition in a Granular Model\nby\nDavid Aristoff and Charles Radin *\nMathematics Department, University of Texas, Austin, TX 78712\n\nAbstract\nWe introduce a model of granular matter and use a stress ensemble to analyze shearing.\nMonte Carlo simulation shows the model to exhibit a second order phase transition,\nassociated with the onset of dilatancy.\n\nMay, 2010\n\nPACS Classification: 45.70.Cc, 81.05.Rm, 05.70.Ce\n* Research supported in part by NSF Grant DMS-0700120\n\n\f1. Introduction.\nStatic granular matter, such as a sand pile, can exist in a range of densities. In its\ndensely packed state, the more common form, it expands under shear, while when its\ngrains are loosely packed it contracts under shear [RN]. We introduce a model within\nwhich the transition between these qualitative behaviors is singular in the precise\ntraditional sense of a second order phase transition. (For two dimensional treatments\nsee [AS, PLR], and for an interpretation as a glass transition see [CH].)\nOur \"granular hard cubes\" model is a granular variant of the classical hard cubes\nmodel of equilibrium statistical mechanics [HHB], the latter being a simplification of\nthe classical hard sphere model in which the spheres are replaced by nonoverlapping,\nparallel unit cubes. In our granular version, following Edwards [EO], we only allow\nconfigurations in which the parallel cubes are mechanically stable under gravity, where\ngravity is acting parallel to edges of the cubes. We require that the centers of our cubes\nbe approximately at the vertices of an fcc lattice, which we orient so that gravity acts\nalong the 001 axis, so the fcc lattice is thought of as parallel 2-dimensional square\nlattice layers. We enforce this approximate structure by requiring that each cube sit\non exactly four cubes in the layer below it; see Fig. 1.\n\nFigure 1. Layers of parallel cubes.\nWe want to model the reaction of a sandpile to shear and in particular we need\na model which exhibits a critical state density, a density separating a high density\nregime of states, in which the material expands under shear, from a low density regime\nin which it contracts under shear [RN]. As we show, this is easy to arrange. The more\ninteresting question is whether the model predicts that the transition through that\ncritical state density is smooth, or is singular.\n1\n\n\fTo understand why it is natural for a granular model to have a critical state\ndensity it is useful to use the following \"stress\" ensemble. Instead of constant density\nwe introduce a pressure parameter, and in place of constant strain we introduce a\nshear stress parameter. In other words the states of the model, which, in the general\napproach of Edwards [EO] are probability densities of configurations of grains, optimize\nthe free energy\nF (p, f ) := S − pV + f αV,\n(1)\nwhere S = ln(Zp,f ) is the entropy, V is the volume in physical space, and α is the\nshear strain. The parameter p is pressure, f is shear stress, and\nZ Z\nZp,f =\nexp(−pV + f αV ) dV dα.\n(2)\nThis is equivalent to saying that a configuration C has an unnormalized probability\ndensity:\nP r(C) = exp(−pV + f αV ).\n(3)\nIt follows from this probability density that, in the absence of shear, the state of\nlowest possible particle density, called random loose packing, occurs at zero pressure\n[AR1] and some shear strain α = α0 . Therefore at sufficiently low pressure if one\nshears the system from α0 , the density has no way to change except to increase. So at\nsufficiently low density there is a regime in which the system contracts.\nOn the other hand, at least since Reynolds [Re] one understands the expansion of\n(dense) granular matter under shear, which he termed dilatancy, in geometric terms,\nas the need for parallel layers of spheres to get out of each others' way under a strain\ndeforming the layers, either by separating and/or by thinning within the layers. So we\nadjust the model to arrange for this (thinning) phenomenon, as follows.\n\nFigure 2. a) A view from above of a layer in a configuration, with a definition of the\nangle α; b) A cubic grain, with bumps on top and bottom faces.\nTo react to the strain (see Fig. 2a) we mimic the spherical caps that grains in\none layer present to grains in neighboring layers by adding \"bumps\" to the top and\n2\n\n\fbottom of our cubes; see Fig. 2b. Such cubes will, when we strain a sufficiently dense\nconfiguration in response to the shear, feel the bumps in the layers above and below\nit, and this will produce a dilatancy effect by thinning the layers. By considering\noptimally symmetric configurations one quickly finds φd := (1 + w)−1 , where w is the\nwidth of a bump, as an estimate of the density required for dilatancy; see Fig. 3. In\nour simulations we use w = 0.15, and so φd ≈ 0.59. The qualitative dilatancy effect is\nnot sensitive to the precise value of w, though the value φd is.\nSo the bumps, together with the universal behavior at low pressure or density,\nexplain the existence of a critical state density. The main question then is: as density\nis varied, does the transition through the critical state density proceed in a smooth\nor in a singular manner? We will show there is an unambiguous second order phase\ntransition at dilatancy onset, at density near φd . This suggests, by analogy with\nmatter in thermal equilibrium, that the material in the two regimes differs in other\ncharacteristics as well, for instance it would be expected that the yield force behave\ndifferently in the two regimes. In [SNRS] the yield force is measured as a function of\ndensity, and a second order phase transition is found at a density roughly 0.598. The\ncritical state density was not carefully measured because of the experimental setup, but\napproximately coincided. Our result suggests the two phenomena are simply different\nmanifestations of the same transition.\nWe also note that the behavior of granular matter at the random close packing\ndensity, about 0.64, has been interpreted in [Ra, AR2] as a first order phase transition\nin which the high density regime is an ordered phase. Together with our results here,\nthis means that the usual freezing transition of equilibrium fluids, at which the material\nacquires the solid features of an ordered (typically crystalline) internal structure as well\nas a strong resistance to shear, seems to be split into two stages in granular materials,\nwith the resistance to shear occuring at dilatancy onset at density about 0.6 and the\nordered internal structure occuring at the random close packing density of about 0.64.\n\nFigure 3. A regular arrangement of grains at maximum density, from above. The\nconfiguration can be partitioned into unit cells defined by the dotted lines.\n\n3\n\n\f2. Simulating the Model.\nAs noted above, our model consists of hard, parallel, oriented unit cubic grains,\nwith two small cubic bumps of width w ≪ 1 attached to the middle of their upper\nand lower faces. We use w = 0.15. Each grain must sit on exactly four other grains\n(except grains on the outside of the configuration), but not on the bumps, and grains\ncannot overlap. Thus, the grains appear on discrete vertical levels, so the distance in\nthe vertical or z-direction between the centers of grains on adjacent levels is equal to\n1; see Fig. 4.\n\nFigure 4. An arrangement of grains, viewed from above.\nEach simulation begins with a perfectly regular arrangement of N = n3 grains in\na large cubic structure, so that there are n2 grains in each level, with n in each row\nand each column of a level, and n total levels. (For ease in notation we associate a\nrow with the x-direction and a column with the y-direction; note that the model has\na well-defined row and column structure.) The grains on the side boundaries of the\ncubic structure are allowed to make coordinated moves corresponding to changes in\nconfiguration volume and shape, but they are not allowed to move singly.\nWe allow three types of Monte Carlo steps. With probability 1 − 1/N we choose\na random grain inside the boundary to move in either the x- or y-direction; and\nwith probability 1/N we allow a configuration to change shape or volume. When a\nconfiguration changes volume, the x- and y-coordinates of each grain, on each level,\nare scaled by the same factor λ. When it changes shape, the x-coordinate of each grain\n4\n\n\fin the kth column of each level is scaled, for some α, by the factor αk.\nTo prevent grains from getting stuck between the boundary grains, we impose\ntop-bottom periodic boundary conditions, and we remove the bumps from the grains\nnearest to the boundary and on the boundary.\nAs is standard in Monte Carlo, to simulate the distribution (3) we choose steps\nwith relative acceptance probabilities given by V N exp(−pV + f αV ). (The factor V N\narises from the necessity of rescaling position coordinates to live in a fixed-size box\n[Mc]). Here α is the angle of deformation of a configuration (see Fig. 2b), where\nfrom symmetry we can assume α ≥ 0 without loss of generality. The volume V of a\nconfiguration is the volume of the convex hull of the set of centers of all the grains.\nThe volume can be computed directly from the scale factor λ described above.\n3. Results of the Simulations.\nWe ran Markov chain Monte Carlo simulations on the model, with the Monte\nCarlo steps designed so that the stationary distribution of the Markov chain has the\nprobability density\nexp(−pV + f αV )\n(4)\nmp,f (C) =\nZp,f\ndescribed above. We want to measure how the (average) density φ = N/V changes\nas shear stress f varies near f = 0. (For convenience we do not include the bumps in\nthe calculation of φ, but since particle number N is fixed in our simulation, the \"true\"\nvolume fraction is just a constant multiple of φ.) That is, we want to estimate the\nderivative\n∂hφi\nD :=\n(5)\n∂f f =0\nof the average of φ as a function of p. From the definition of mp,f it is easy to see that\nh\nih\ni\nD = D(p) = N hαip,0 − hφip,0 hV αip,0 ,\n\n(6)\n\nwhere h*ip,f denotes average with respect to mp,f . Thus, to estimate D(p) from our\nsimulations we set f = 0 and calculate the sample averages of N α, φ, and V α. With\nthe free energy F (p, f ) = S − pV + f αV , which is the quantity minimized by the state\nmp,f , one can see from a direct calculation that\nD(p) =\n\n−hφi2p,0\n\n∂\n∂f\n\n\u0012\n\n∂F\n∂p\n\n\u0013\n\n,\n\n(7)\n\nf =0\n\nwhich shows that the function D(p) is a quantity for which a discontinuity might\nreasonably be described as a second order phase transition.\n\n5\n\n\f∂hφip,f\n, for systems of 143 = 2744, 123 = 1728,\n∂f\nf =0\n103 = 100, and 83 = 512 grains (data1-data4, resp.). The insert gives error bars on\nthe system with 143 grains.\nFigure 5. The graph of D(p) =\n\nWe investigate systems of 83 = 512, 103 = 100, 123 = 1728 and 143 = 2744 grains\nat pressures p1 < ... < pk , where the pressures chosen are different for each size system.\nIn the simulations we begin at low pressure p1 , and then slowly increase p until just\nafter the derivative D(p) falls sharply below zero, roughly corresponding to pressure\npk . The last configuration in the simulation of pi is used as the starting configuration\n6\n\n\fof the simulation of pi+1 . We use the standard biased autocorrelation function to\ndetermine a \"mixing time\", measured as the number of Monte Carlo steps required\nbefore the autocorrelation first crosses zero. We run our simulations long enough so\nthat the simulation of each pi contains, on average, at least 20 mixing times, and we\nrun 200 independent copies of each simulation to obtain the averages hN αip,0 , hφip,0 ,\nand hV αip,0 . From these averages we compute D(p) from (6). (We also ran some of\nour simulations much longer, with fewer copies and pressures, and noted agreement\nwith the already-obtained data on D(p).) Then, for error bars on D(p), we repeat the\nentire experiment 8 times and use the Student's t-distribution.\nOur simulations suggest that D(p) develops a discontinuity as the system size\nincreases (see Fig. 5). Changing variables we note that D, as a function of hφip,0 ,\ndevelops a discontinuity near the (average) volume fraction φd ≈ 0.59 discussed in the\nintroduction; we plot hφip,0 against p in Fig. 6b and D against hφip,0 in Fig. 6a.\nNote that for p ≤ 1, D(p) exhibits regular behavior in which D(p) is roughly\nconstant, D(p) = η ≈ 0.001. Then for 1 < p < 2, D(p) has some oscillation which is\ncharacteristic to the system size. Then for p ≥ 2, D(p) steadily increases to a peak,\nthen sharply decreases through zero. We believe that D(p) is discontinuous in the\nlimit of infinite system size, but the rate of change of D(p) is so large it is difficult\nto measure its variation with system size. Instead we consider two measures of the\ninterval R in which the discontinuity is developing, and then note that R gets smaller\nand smaller as system size increases.\nWe expect that the oscillation observed in D(p) in the interval 1 < p < 2 is\ncaused by finite-size effects, so that it disappears in the limit N → ∞. Furthermore\nwe expect the critical pressure pc to fall at either the end or the beginning of the\noscillation region. These two possibilities underlie, respectively, our measurements R1\nand R2 , defined below. Let η be the average value of D(p) over p ≤ 1. The left\nendpoint of R1 is the smallest value of p where p > 2 and D(p) ≈ η, and the right\nendpoint of R1 is the value of p where p > 2 and D(p) ≈ 0. The widths of R1 are\napproximately 1.75 ± 0.05, 1.15 ± 0.05, 0.75 ± 0.05, and 0.50 ± 0.05 for systems of\nN = 83 , 103 , 123 and 143 grains, respectively. On the other hand, the left endpoint\nof R2 is defined as the smallest value of p such that D(p) differs significantly from η,\nwhile the right endpoint of R2 is the same as the right endpoint of R1 . We estimate\nthat the widths of R2 are approximately 3.55 ± 0.05, 1.55 ± 0.05, 1.25 ± 0.15, and\n1.15 ± 0.05 for systems of N = 83 , 103 , 123 and 143 grains, respectively.\nIn either case, based on the decreasing sizes of the intervals R1 and R2 , we believe\nthat the jump from D(p) ≈ ν to D(p) ≪ 0 occurs over an interval which is vanishing in\nthe infinite volume limit, which, given the relation between D(p) and the free energy\nF (p, f ) in (7), is reasonably termed a second order phase transition. And as noted in\nthe introduction, there is experimental evidence for this interpretation in [SNRS].\n\n7\n\n\fFigure 6. a) D(p) as a function of hφip,0 ; b) hφip,0 as a function of p. In both plots,\ndata1-data4 represent systems of 143 = 2744, 123 = 1728, 103 = 100, and 83 = 512\ngrains, respectively.\n\nAcknowledgements. It is a pleasure to acknowledge useful discussions with Hans\nC. Andersen and Matthias Schröter.\n\n8\n\n\fReferences\n[AR1] D. Aristoff and C. Radin, Random loose packing in granular matter, J. Stat. Phys.\n135 (2009) 1-23.\n[AR2] D. Aristoff and C. Radin, Random close packing in a granular model,\narXiv:0909.2608.\n[AS] E. Aharonov and D. Sparks, Rigidity phase transition in granular packings, Phys.\nRev. E 60 (1999) 6890-6896.\n[CH] A Coniglio and H.J Herrmann, Phase transitions in granular packings, Physica A\n225 (1996) 1-6.\n[HHB] W.G Hoover, C.G Hoover and M.N. Bannerman, Single-Speed Molecular Dynamics of Hard Parallel Squares and Cubes, J. Stat. Phys. 136 (2009) 715-732.\n[EO] S.F. Edwards and R.B.S. Oakeshott, Theory of powders, Physica A 157 (1989)\n1080-1090.\n[Mc] I.R. MacDonald, NpT-ensemble Monte Carlo calculations for binary liquid mixtures, Molecular Physics Vol 100 (2002) 95-105.\n[PLR] M. Piccioni, V. Loreto, and S. Roux, Criticality of the \"critical state\" of granular\nmedia: Dilatancy angle in the Tetris model, Phys. Rev. E 61 (2000) 2813-2817.\n[Ra] C. Radin, Random close packing of granular matter, J. Stat. Phys. 131 (2008)\n567-573.\n[Re] O. Reynolds, On the dilatancy of media composed of rigid particles in contact.\nwith experimental illustrations, Phil. Mag. Series 5 20 (1885) 469-481.\n[RN] K.K. Rao and P.R. Nott, An Introduction to Granular Flow, (Cambridge University Press, Cambridge, 2008).\n[SNRS] M. Schröter, S. Nägle, C. Radin and H.L. Swinney, Phase transition in a static\ngranular system, Europhys. Lett. 78 (2007) 44004.\n\n9\n\n\f"}