{"id": "http://arxiv.org/abs/1101.2548v1", "guidislink": true, "updated": "2011-01-13T12:49:42Z", "updated_parsed": [2011, 1, 13, 12, 49, 42, 3, 13, 0], "published": "2011-01-13T12:49:42Z", "published_parsed": [2011, 1, 13, 12, 49, 42, 3, 13, 0], "title": "Intrinsic and extrinsic x-ray absorption effects in soft x-ray\n  diffraction from the superstructure in magnetite", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.5414%2C1101.3689%2C1101.1816%2C1101.4878%2C1101.2145%2C1101.0330%2C1101.2429%2C1101.3680%2C1101.5084%2C1101.1366%2C1101.4469%2C1101.1931%2C1101.3262%2C1101.0456%2C1101.1557%2C1101.2548%2C1101.4105%2C1101.3141%2C1101.5778%2C1101.0172%2C1101.5875%2C1101.4622%2C1101.2364%2C1101.1970%2C1101.4308%2C1101.2397%2C1101.3181%2C1101.1301%2C1101.5005%2C1101.1679%2C1101.3801%2C1101.6004%2C1101.1994%2C1101.2560%2C1101.2032%2C1101.0723%2C1101.5466%2C1101.1067%2C1101.3383%2C1101.4143%2C1101.2758%2C1101.2265%2C1101.1323%2C1101.1650%2C1101.5789%2C1101.3300%2C1101.3330%2C1101.2109%2C1101.5299%2C1101.5128%2C1101.5306%2C1101.5171%2C1101.1467%2C1101.0726%2C1101.0639%2C1101.5359%2C1101.2500%2C1101.2863%2C1101.5249%2C1101.2797%2C1101.0405%2C1101.1048%2C1101.4057%2C1101.3420%2C1101.6072%2C1101.1287%2C1101.0522%2C1101.2298%2C1101.5280%2C1101.4342%2C1101.5049%2C1101.1201%2C1101.0273%2C1101.0155%2C1101.4524%2C1101.4704%2C1101.1577%2C1101.3530%2C1101.5994%2C1101.4354%2C1101.2907%2C1101.2214%2C1101.2807%2C1101.4787%2C1101.2735%2C1101.5028%2C1101.3421%2C1101.5471%2C1101.5013%2C1101.3935%2C1101.5276%2C1101.0802%2C1101.4182%2C1101.1984%2C1101.0574%2C1101.5110%2C1101.2441%2C1101.2398%2C1101.4663%2C1101.1729%2C1101.1890&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Intrinsic and extrinsic x-ray absorption effects in soft x-ray\n  diffraction from the superstructure in magnetite"}, "summary": "We studied the (001/2) diffraction peak in the low-temperature phase of\nmagnetite (Fe3O4) using resonant soft x-ray diffraction (RSXD) at the Fe-L2,3\nand O-K resonance. We studied both molecular-beam-epitaxy (MBE) grown thin\nfilms and in-situ cleaved single crystals. From the comparison we have been\nable to determine quantitatively the contribution of intrinsic absorption\neffects, thereby arriving at a consistent result for the (001/2) diffraction\npeak spectrum. Our data also allow for the identification of extrinsic effects,\ne.g. for a detailed modeling of the spectra in case a \"dead\" surface layer is\npresent that is only absorbing photons but does not contribute to the\nscattering signal.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.5414%2C1101.3689%2C1101.1816%2C1101.4878%2C1101.2145%2C1101.0330%2C1101.2429%2C1101.3680%2C1101.5084%2C1101.1366%2C1101.4469%2C1101.1931%2C1101.3262%2C1101.0456%2C1101.1557%2C1101.2548%2C1101.4105%2C1101.3141%2C1101.5778%2C1101.0172%2C1101.5875%2C1101.4622%2C1101.2364%2C1101.1970%2C1101.4308%2C1101.2397%2C1101.3181%2C1101.1301%2C1101.5005%2C1101.1679%2C1101.3801%2C1101.6004%2C1101.1994%2C1101.2560%2C1101.2032%2C1101.0723%2C1101.5466%2C1101.1067%2C1101.3383%2C1101.4143%2C1101.2758%2C1101.2265%2C1101.1323%2C1101.1650%2C1101.5789%2C1101.3300%2C1101.3330%2C1101.2109%2C1101.5299%2C1101.5128%2C1101.5306%2C1101.5171%2C1101.1467%2C1101.0726%2C1101.0639%2C1101.5359%2C1101.2500%2C1101.2863%2C1101.5249%2C1101.2797%2C1101.0405%2C1101.1048%2C1101.4057%2C1101.3420%2C1101.6072%2C1101.1287%2C1101.0522%2C1101.2298%2C1101.5280%2C1101.4342%2C1101.5049%2C1101.1201%2C1101.0273%2C1101.0155%2C1101.4524%2C1101.4704%2C1101.1577%2C1101.3530%2C1101.5994%2C1101.4354%2C1101.2907%2C1101.2214%2C1101.2807%2C1101.4787%2C1101.2735%2C1101.5028%2C1101.3421%2C1101.5471%2C1101.5013%2C1101.3935%2C1101.5276%2C1101.0802%2C1101.4182%2C1101.1984%2C1101.0574%2C1101.5110%2C1101.2441%2C1101.2398%2C1101.4663%2C1101.1729%2C1101.1890&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We studied the (001/2) diffraction peak in the low-temperature phase of\nmagnetite (Fe3O4) using resonant soft x-ray diffraction (RSXD) at the Fe-L2,3\nand O-K resonance. We studied both molecular-beam-epitaxy (MBE) grown thin\nfilms and in-situ cleaved single crystals. From the comparison we have been\nable to determine quantitatively the contribution of intrinsic absorption\neffects, thereby arriving at a consistent result for the (001/2) diffraction\npeak spectrum. Our data also allow for the identification of extrinsic effects,\ne.g. for a detailed modeling of the spectra in case a \"dead\" surface layer is\npresent that is only absorbing photons but does not contribute to the\nscattering signal."}, "authors": ["C. F. Chang", "J. Schlappa", "M. Buchholz", "A. Tanaka", "E. Schierle", "D. Schmitz", "H. Ott", "R. Sutarto", "T. Willers", "P. Metcalf", "L. H. Tjeng", "C. Schuessler-Langeheine"], "author_detail": {"name": "C. Schuessler-Langeheine"}, "author": "C. Schuessler-Langeheine", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.83.073105", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1101.2548v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1101.2548v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "to appear in Phys. Rev. B", "arxiv_primary_category": {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1101.2548v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1101.2548v1", "journal_reference": null, "doi": "10.1103/PhysRevB.83.073105", "fulltext": "Intrinsic and extrinsic x-ray absorption effects in soft x-ray diffraction from the\nsuperstructure in magnetite\nC. F. Chang,1 J. Schlappa,1 M. Buchholz,1 A. Tanaka,2 E. Schierle,3 D. Schmitz,3 H. Ott,1\nR. Sutarto,1 T. Willers,1 P. Metcalf,4 L. H. Tjeng,1, 5 and C. Schüßler-Langeheine1\n1\n\narXiv:1101.2548v1 [cond-mat.str-el] 13 Jan 2011\n\n2\n\nII. Physikalisches Institut, Universität zu Köln, Zülpicher Str. 77, 50937 Köln, Germany\nDepartment of Quantum Matter, ADSM, Hiroshima University, Higashi-Hiroshima 739-8530, Japan\n3\nHelmholtz-Zentrum Berlin, Albert-Einstein-Str. 15, 12489 Berlin, Germany\n4\nDepartment of Chemistry, Purdue University, West Lafayette, Indiana 47907, USA\n5\nMax Planck Institute for Chemical Physics of Solids, Nöthnitzerstr. 40, 01187 Dresden, Germany\n(Dated: October 26, 2018)\nWe studied the (00 21 ) diffraction peak in the low-temperature phase of magnetite (Fe3 O4 ) using resonant soft x-ray diffraction (RSXD) at the Fe-L2,3 and O-K resonance. We studied both\nmolecular-beam-epitaxy (MBE) grown thin films and in-situ cleaved single crystals. From the comparison we have been able to determine quantitatively the contribution of intrinsic absorption effects,\nthereby arriving at a consistent result for the (00 12 ) diffraction peak spectrum. Our data also allow\nfor the identification of extrinsic effects, e.g. for a detailed modeling of the spectra in case a \"dead\"\nsurface layer is present that is only absorbing photons but does not contribute to the scattering\nsignal.\nPACS numbers: 71.30.+h, 61.05.cp\n\nMagnetite, Fe3 O4 , shows a first order anomaly in the\ntemperature dependence of the electrical conductivity at\nTV ∼ 120 K, the famous Verwey transition.1 It is accompanied by a structural phase transition from the cubic\ninverse spinel to a distorted structure. One usually connects this transition with charge ordering of the Fe2+ and\nFe3+ ions on the octahedrally coordinated, so-called Bsites. In a recent diffraction study, Wright, Attfield and\nRadaelli found long-range charge order from the pattern\nof shorter and longer bond lengths between B-site iron\nand oxygen ions below TV .2,3 Subsequently, using this\nstructure as input, local density approximation + Hubbard U (LDA+U ) band structure studies have calculated\nthe corresponding orbital ordering, which involves mainly\nthe minority spin electron in the t2g state of the 2+ Bsites.4,5\nRecently this t2g orbital order has been studied using\nRSXD at the O 1s → 2p (K)6 and Fe 2p → 3d (L2,3 )7\nresonance. The O-K edge resonance enhancement of the\n(00 12 ) diffraction peak (notation refers to the cubic roomtemperature unit cell) on an ex-situ polished bulk single\ncrystal was interpreted by Huang et al. as a signature\nof a particular charge/orbital order at the oxygen-sites.6\nAt the Fe L2,3 -edges, using MBE-grown thin films, the\n(00 12 ) maximum energy coincides with the resonance of\nthe 2+ B-site ions and was assigned by Schlappa et al.\nto Fe t2g -orbital order on these sites.7\nVery recently these results have been challenged.\nWilkins and coauthors have presented RSXD data from\nthe (00 12 ) peak [(001) in the orthorhombic notation used\nin Ref. 8] of bulk magnetite at the O-K and Fe-L2,3\nresonance.8 . Their O-K spectrum is similar to that of\nHuang et al.6 but their Fe-L2,3 data are very different from those of Schlappa et al.7 Almost at the same\ntime Garcı́a et al.9 reported a Fe-L2,3 RSXD spectrum\nfrom a bulk sample, which is very different from those of\n\nboth Wilkins et al. and Schlappa et al.. In both recent\npublications8,9 the shape of the respective Fe-L2,3 spectra\nare explained by absorption effects. Presently, hence, at\nleast three different Fe-L2,3 RSXD spectra for the (00 12 )\npeak of magnetite have been published and very different\nconclusions have been drawn about the electronic origin\nof the peak.\nHere we report our efforts to resolve the confusion\nabout the RXSD data on magnetite. Our strategy is\nto carry out the experiments using a magnetite bulk single crystal which was carefully cleaved in-situ in order to\nobtain the best possible surface quality, and to compare\nthe results with the measurements on high quality MBEgrown magnetite thin films. In this manner we are able\nto distinguish intrinsic absorption effects from extrinsic\neffects. Taking intrinsic effects properly into account, we\nfind consistent results for in-situ cleaved bulk samples\nand thin films. Furthermore, taking a so-called \"dead\"\nsurface into account, which leads to extrinsic absorption,\nwe are able to provide a quantitative explanation for the\nvarying RSXD spectra reported in the literature so far.\nThe soft x-ray scattering experiments were performed\nat the HZB beam line UE46-1 at BESSY using the twocircle UHV diffractometer designed at the Freie Universität Berlin. We used 40 nm thick magnetite films epitaxially grown on an epi-polished MgO(001) substrates and\nseveral magnetite bulk single crystals. The samples were\noriented such that two base vectors of the cubic roomtemperature unit cell (a = 8.396 Å) were parallel to the\nscattering plane. The polarization of incoming light was\neither parallel or perpendicular to the scattering plane\n(π- or σ-polarization, respectively). A silicon-diode photon detector without polarization analysis was used with\nthe angular acceptance set to 1◦ in the scattering plane\nand 5◦ perpendicular to it. The energy dependence of\nthe diffraction-peak intensities (diffraction spectra) from\n\n\f2\n7 0 0\n\n7 1 0\n\n7 2 0\n\n7 3 0\n\n7 0 0\n\n(a )\nF e -L\n\n2 ,3\n\n7 1 0\n(a )\n\n(0 ,0 ,1 /2 ) π\n\nIn te n s ity ( a r b . u n its )\n\nIn te n s ity ( a r b . u n its )\n\nO -K (0 ,0 ,1 /2 ) π\n\nF e -L\n\n7 3 0\n2 ,3\n\n(0 ,0 ,1 /2 ) π\n\nw ith\nw ith o u t\na b s o r p tio n c o r r .\n\nF ilm\nB u lk\n( w /o a b s o r p tio n c o r r .)\n\n(b )\n\n7 2 0\n\nX A S\n\n(b )\n\nO -K (0 ,0 ,1 /2 ) π\n\nF ilm\nB u lk\n( w /o a b s o r p tio n c o r r .)\n\n5 2 6\n\n5 2 8\n5 3 0\n5 3 2\nP h o to n E n e rg y (e V )\n\n5 3 4\n\nFIG. 1: (color online) RSXD spectra of the (00 12 ) peak of\nbulk magnetite (open symbols) and magnetite thin film (filled\nsymbols) at (a) Fe L2,3 -edges and at (b) O K-edge. The\nspectra are scaled to equal height.\n\nthe film sample were recorded by varying the photon energy and keeping the momentum transfer constant. For\nbulk samples this method leads to distorted spectra because of the much narrower peaks and refraction effects.\nWe therefore performed longitudinal (L) scans at every\nphoton energy and integrated the (00 21 )-peak intensity.\nFig. 1 displays the (00 12 ) resonance spectra at the Fe\nL2,3 and at O K-edges for bulk magnetite and magnetite\nthin film. One can observe very distinct differences between the bulk and the thin film. At the Fe edge, for\nexample, the first peak at 707 eV is much more pronounced in the bulk than in the thin film. At the O\nedge, the energy position of the peak of the bulk is clearly\nshifted with respect to that of the thin film. We ascribe\nthese differences to a change of the scattering volume due\nto variations of the penetration depth of the light as a\nfunction of its energy. This effect is quite severe for energy variations across resonances in the soft x-ray regime\ndue to the very high photo-absorption coefficients. For\na bulk sample, the scattered intensity in specular geometry is proportional to 1/μ, with μ being the absorption\ncoefficient.10 This absorption effect can be accounted for\nby multiplying the resonance spectra by μ; μ can be reliably obtained from the x-ray absorption spectroscopy\n(XAS) signal recorded in the total electron yield mode.\nThe effect of this correction is shown for bulk magnetite in Fig. 2 for both the Fe-L2,3 and O-K resonances.\nThe open symbols are the raw data and the filled symbols are those after correction. The absorption signals are\nshown as solid lines. The correction for the Fe-spectrum\naffects mainly the relative intensities of the spectral fea-\n\nX A S\n\n5 2 6\n\n5 2 8\n5 3 0\n5 3 2\nP h o to n E n e rg y (e V )\n\n5 3 4\n\nFIG. 2: (color online) RSXD spectra of the (00 12 ) peak of\nbulk magnetite without (open symbols) and with absorption\ncorrection (filled symbols) at (a) Fe L2,3 -edges and at (b) O\nK-edge. The spectra are scaled to equal height. XAS spectra\nare shown as solid lines.\n\ntures, while in the O-spectrum, the main peak, which is\njust on the slope of the absorption signal, becomes shifted\nin energy.\nFor a film of thickness D the factor to correct for absorption effects is μ/(1 − exp(−2μd)). d = D/ sin θ describes the effective photon path length at incident angle\nθ. To perform this correction requires to know μ in absolute units. Because of the thinness of the films, the\ncorrection should be smaller than for the bulk.\nIn Fig. 3 we now compare again the corrected spectra from the bulk (filled symbols) with the uncorrected\nfilm spectra as presented in Ref. 7 (open symbols). For\nthe O-K spectra the agreement between bulk and film\ndata is now close to perfect. Also for the Fe resonance\nthe overall agreement between the spectra is very good,\nall spectral features agree. The main discrepancy here is\nin the relative intensities of the L3 and L2 part of the\nFe-resonance spectra. The application of an absorption\ncorrection on also the thin film data would probably resolve much of this discrepancy. Thus, apart for this, we\nfind very similar spectra from the film and the bulk at\nboth resonances. We can, hence, safely conclude that\nthe resonant diffraction data recorded from the thin film\nsample are representative for the material magnetite as\nsuch and that the conclusions derived from the data of\nmagnetite thin films in our former Letter7 stand for the\nintrinsic properties of magnetite.\nWe now compare our experimental data with those\nfrom Huang et al.6 , Wilkins et al.8 , and Garcı́a et al.9\nfrom bulk magnetite. We first focus on the Fe L2,3 -edges\n\n\f3\n7 0 0\n\n7 1 0\n\n7 2 0\n\n7 3 0\n\n(a )\nF e -L\n\n2 ,3\n\n(0 ,0 ,1 /2 ) π\n\nIn te n s ity ( a r b . u n its )\n\nF ilm\nB u lk\n\n(b )\nO -K (0 ,0 ,1 /2 ) π\nF ilm\nB u lk\n\n5 2 6\n\n5 2 8\n5 3 0\n5 3 2\nP h o to n E n e rg y (e V )\n\n5 3 4\n\nFIG. 3: (color online) RSXD spectra of the (00 12 ) peak from\nmagnetite thin film and bulk crystal at (a) Fe L2,3 -edges and\n(b) O K-edge using π polarized light.\n\n7 0 0\n\n7 1 0\n\n7 2 0\n\n7 3 0\n\nB u lk F e 3 O\nIn te n s ity ( a r b . u n its )\n\nF e -L\n\n2 ,3\n\n4\n\n(0 ,0 ,1 /2 ) π\n\nR S X D\nX A S th\nR S X D\nX A S W\n\"D e a d\n\nth is\nis w\nW ilk\nilk in\nla y e\n\nw o rk\no rk\nin s\ns\nr\" m o d e l\n\nx 5 0 0\n\n7 0 0\n\n7 1 0\n\n7 2 0\n\n7 3 0\n\nP h o to n E n e rg y (e V )\n\nFIG. 4: (color online) Fe L2,3 -edges RSXD spectra of the\n(00 21 ) peak and XAS spectra taken from our magnetite bulk\ncrystal (red) and from Wilkins et al.,8 (black). The green\nthick line is the result of a simulation multiplied by a factor 500 (see text). The XAS spectra are included as energy\nreference.\n\ndata. In Fig. 4 we present our data and those reproduced\nfrom the paper of Wilkins et al.8 . The energy scales were\naligned using the XAS data to account for small energyscale offsets between different soft x-ray monochromators. The energy scale given at the top of Fig. 4 refers to\nthe one used by Wilkins et al.8 , and the bottom scale is\nthe one of our experiment. It was claimed by Wilkins et\nal. that their data were strongly distorted by absorption\neffects, which suppressed all scattered intensity when the\nabsorption increases. However, this cannot be the case\n\nbecause our raw data are already very different. In fact,\nit is quite unlikely that absorption in an otherwise intact\nsample can suppress the scattered intensity completely.11\nWhat could cause such strong distortions, however, is\na layer on top of the sample, which does absorb photons\nbut does not contribute to the scattered signal. This\ncould be either a polycrystalline layer or a crystalline\nlayer with different surface orientation as the bulk or a\nlayer of different chemical composition. That this \"dead\"\nlayer scenario is likely is demonstrated in Fig. 4. The diamond symbols are the experimental data from Wilkins et\nal.8 and the green thick solid line is a simulation in which\nwe describe the presence of an absorbing layer of thickness Da by multiplying our experimental RSXD spectrum by e−2da μ(hv) with da = Da / sin θ.\nWe find the best agreement between data and simulation for da × μ ≈ 18 at the absorption maximum. The\nresulting spectrum reproduces not only the peak position but also the shape of the data from Wilkins et al.8\nvery well. We note that as compared to our experimental\nspectrum the green line has been multiplied by a factor\n500; more than 99 percent of the intensity of the diffraction spectrum is taken away by the absorbing dead layer.\nConcerning the Fe L2,3 data from Garcı́a et al.9 we note\nthat their (raw) data are closer to ours, although there\nare appreciable quantitative differences. It therefore appears likely that the effect of an absorbing dead layer is\npresent also in their data, although of a much thinner\none than in the work of Wilkins et al.8\nWe now address the oxygen resonance spectra. Experimentally both in the papers by Wilkins et al.8 and Huang\net al.6 a single resonance peak is observed, while our data\nshow clearly a satellite 1.3 eV higher in energy. Huang\net al. observe additionally a broad hump at about 4 eV\nhigher photon energy, which is missing in our data. The\n1.3-eV satellite occurs at energies where the absorption\ncross section is high and the filter effect discussed above\nfor the Fe resonance may suppress this feature. Since no\nabsorption data for energy reference are given by Wilkins\net al.8 we focus on those from Huang et al.,6 . In Fig. 5\n(a) we reproduce the O-K RSXD data from Huang et\nal.6 . Again, we aligned the energy scales using the O-K\nXAS spectra (thin/dotted lines). Since our experiment\nwas performed with higher energy resolution, we broadened our experimental XAS data slightly to obtain the\nsame energy resolution as in the experiment of Huang et\nal.6 . On such a calibrated energy scale we find the resonance peak at a by 230 meV higher photon energy, i.e.\nmuch closer to the absorption maximum than Huang et\nal. did.\nWe have carried out the same simulation as in the Fe\nL2,3 -edges analysis above for O K-resonance as shown in\nFig. 5 (a). The triangle symbols are the experimental\ndata from Huang et al.6 and the green thick solid line is\nthe simulation result. The resulting spectrum reproduces\nthe main peak position and shape, and also contains the\nweak and broad hump at 4 eV above the main peak, i.e.\na structure which is not present in the real spectrum and\n\n\f4\n5 2 7\n\n5 2 9\n\n5 3 1\n\n5 3 3\n\n5 3 5\n\n(a )\nB u lk F e 3 O\n4\n\nIn te n s ity ( a r b . u n its )\n\nO -K (0 ,0 ,1 /2 ) π\nx 2 3\n\n(b )\n\n5 2 6\n\nR S X D\nX A S th\nR S X D\nX A S H\n\"D e a d\n\nth is\nis w\nH u a\nu a n\nla y e\n\n5 2 8\n5 3 0\n5 3 2\nP h o to n E n e rg y (e V )\n\nw o rk\no rk\nn g\ng\nr\" m o d e l\n\n5 3 4\n\nFIG. 5: (color online) (a) O K-edge RSXD spectra of the\n(00 12 ) peak and XAS spectra taken from our magnetite bulk\ncrystal (red) and from Ref. 6 (black). The green thick line is\na simulated result (see text). The XAS spectra are included\nas energy reference. (b) Red line and symbols is our RSXD\nspectrum, and green thick line is the same simulated result as\nin (a) but now both on the same vertical scale, showing that\nmore than 95 percent of signal is taken away by the absorbing\nlayer.\n\nwhich is artificially generated by the local minimum in\nthe absorption at that photon energy. In panel (b) we\nplot our original spectrum (red line and symbols) and\nthe one generated by assuming an absorbing layer (green\nsolid line) on the same vertical scale. One can also see\n\n1\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\nE. J. W. Verwey, Nature (London) 144, 327 (1939).\nJ. P. Wright, J. P. Attfield, and P. G. Radaelli, Phys. Rev.\nLett. 87, 266401 (2001).\nJ. P. Wright, J. P. Attfield, and P. G. Radaelli, Phys. Rev.\nB 66, 214422 (2002).\nI. Leonov, A. N. Yaresko, V. N. Antonov, M. A. Korotin,\nand V. I. Anisimov, Phys. Rev. Lett. 93, 146404 (2004).\nH.-T. Jeng, G. Y. Guo, and D. J. Huang, Phys. Rev. Lett.\n93, 156403 (2004).\nD. J. Huang, H.-J. Lin, J. Okamoto, K. S. Chao, H.-T.\nJeng, G. Y. Guo, C.-H. Hsu, C.-M. Huang, D. C. Ling,\nW. B. Wu, et al., Phys. Rev. Lett. 96, 096401 (2006).\nJ. Schlappa, C. Schüßler-Langeheine, C. F. Chang, H. Ott,\nA. Tanaka, Z. Hu, M. W. Haverkort, E. Schierle,\nE. Weschke, G. Kaindl, et al., Phys. Rev. Lett. 100, 026406\n(2008).\nS. B. Wilkins, S. Di Matteo, T. A. W. Beale, Y. Joly,\nC. Mazzoli, P. D. Hatton, P. Bencok, F. Yakhou, and\n\nhow much intensity of the diffraction spectrum is taken\naway by the absorbing dead layer: more than 95 percent\nof the signal is gone. The shape of the spectrum of Huang\net al.6 is completely destroyed, the 1.3-eV satellite is suppressed, and the 4-eV feature is artificially generated by\nthe dead surface layer.\nWe note that assuming a photon mean free path (1/μ)\nof about 1300 Å (a value proposed by Huang et al.6 )\nat the energy between 528 and 531 eV, and considering\nthe detection geometry with photon incidence and detection angle around 45 degrees, we find a thickness of the\n\"dead\" surface layer of about a quarter of a micrometer.\nA similar thickness comes out for the data of Wilkins et\nal.8 at the Fe-L3 when we estimate the photon mean free\npath at the Fe-L3 maximum based on our XAS data.\nIn summary, we have recorded RSXD spectra of the\n(00 21 ) peak at both Fe L2,3 -edges and O K-edge from invacuo cleaved magnetite single crystals, which essentially\nagree with those from magnetite thin films published earlier. We found that our spectra differ strongly from those\npublished by Huang et al.6 and Wilkins et al.8 , and to\nlesser extent, from Garcı́a et al.9 We were able to ascribe the distortions in their spectra to extrinsic effects,\nnamely the presence of a dead surface layer. Both our\nbulk and thin film data can hence be used for a reliable\nmodeling of the charge and orbital ordering phenomena\nin magnetite.\nWe acknowledge BESSY for excellent working conditions and Eugen Weschke for the making his soft x-ray\ndiffractometer available for the experiment. We thank\nLucie Hamdan and the mechanical workshop of the II.\nPhysikalische Institut for their skillful technical assistance. The research in Cologne is supported by the\nDeutsche Forschungsgemeinschaft through SFB 608 and\nby the BMBF through contract 05KS7PK1; work at\nBESSY by the BMBF through contract 05ES3XBA/5.\n\n9\n\n10\n\n11\n\nV. A. M. Brabers, Phys. Rev. B 79, 201102(R) (2009).\nJ. Garcı́a, G. Subı́as, J. Herrero-Martı́n, J. Blasco,\nV. Cuartero, M. C. Sánchez, C. Mazzoli, and F. Yakhou,\nPhys. Rev. Lett. 102, 176405 (2009).\nJ. Als-Nielsen and D. McMorrow, Elements of Modern Xray Physics (Wiley, New York, 2001).\nP. Abbamonte, private communication: For a single resonance the scattered intensity I = |f 0 + if 00 |2 at the resonance maximum is proportional to μ2 , because the real\npart of the scattering amplitude, f 0 is zero at the resonance\nmaximum and f 00 ∝ μ. The absorption effect, however, is\nlinear in μ, which means that the observed intensity will\nstill be finite and proportional to μ. While the actually\nprobed linear combination of scattering amplitudes may\nweaken this simple argument, it is still very unlikely that\nabsorption can reduce the scattered intensity to zero for a\nwide range of photon energies.\n\n\f"}