{"id": "http://arxiv.org/abs/1003.3318v2", "guidislink": true, "updated": "2010-05-28T06:28:49Z", "updated_parsed": [2010, 5, 28, 6, 28, 49, 4, 148, 0], "published": "2010-03-17T08:08:20Z", "published_parsed": [2010, 3, 17, 8, 8, 20, 2, 76, 0], "title": "Coherently manipulating flying qubits in a quantum wire with a magnetic\n  impurity", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.3350%2C1003.1934%2C1003.4794%2C1003.4556%2C1003.3599%2C1003.5352%2C1003.2971%2C1003.0525%2C1003.2205%2C1003.0972%2C1003.5978%2C1003.0995%2C1003.5396%2C1003.0009%2C1003.1125%2C1003.3617%2C1003.2109%2C1003.0703%2C1003.0757%2C1003.1368%2C1003.3309%2C1003.3188%2C1003.0471%2C1003.3234%2C1003.1338%2C1003.4175%2C1003.2253%2C1003.5828%2C1003.4954%2C1003.3064%2C1003.5513%2C1003.3981%2C1003.0859%2C1003.4102%2C1003.6010%2C1003.6061%2C1003.3318%2C1003.3355%2C1003.2005%2C1003.0722%2C1003.5079%2C1003.0910%2C1003.0326%2C1003.0510%2C1003.0792%2C1003.3396%2C1003.3917%2C1003.3773%2C1003.3476%2C1003.0358%2C1003.4861%2C1003.3077%2C1003.1432%2C1003.2064%2C1003.3239%2C1003.0993%2C1003.2245%2C1003.3025%2C1003.0415%2C1003.4730%2C1003.0952%2C1003.3451%2C1003.4386%2C1003.3467%2C1003.5128%2C1003.5410%2C1003.3012%2C1003.1928%2C1003.0159%2C1003.2424%2C1003.3454%2C1003.3608%2C1003.1428%2C1003.0718%2C1003.3603%2C1003.4849%2C1003.0702%2C1003.5273%2C1003.1426%2C1003.3418%2C1003.1433%2C1003.1854%2C1003.3136%2C1003.0643%2C1003.0569%2C1003.0784%2C1003.4071%2C1003.4055%2C1003.4324%2C1003.6092%2C1003.1505%2C1003.4575%2C1003.5084%2C1003.5742%2C1003.4363%2C1003.4338%2C1003.4123%2C1003.1986%2C1003.2461%2C1003.2058%2C1003.0979&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Coherently manipulating flying qubits in a quantum wire with a magnetic\n  impurity"}, "summary": "e study the effect of a magnetic impurity with spin-half on a single\npropagating electron in a one-dimensional model system via the tight-binding\napproach. Due to the spin-dependent interaction, the scattering channel for the\nflying qubit is split, and its transmission spectrum is obtained. It is found\nthat, the spin orientation of the impurity plays the role as a spin state\nfilter for a flying qubit.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.3350%2C1003.1934%2C1003.4794%2C1003.4556%2C1003.3599%2C1003.5352%2C1003.2971%2C1003.0525%2C1003.2205%2C1003.0972%2C1003.5978%2C1003.0995%2C1003.5396%2C1003.0009%2C1003.1125%2C1003.3617%2C1003.2109%2C1003.0703%2C1003.0757%2C1003.1368%2C1003.3309%2C1003.3188%2C1003.0471%2C1003.3234%2C1003.1338%2C1003.4175%2C1003.2253%2C1003.5828%2C1003.4954%2C1003.3064%2C1003.5513%2C1003.3981%2C1003.0859%2C1003.4102%2C1003.6010%2C1003.6061%2C1003.3318%2C1003.3355%2C1003.2005%2C1003.0722%2C1003.5079%2C1003.0910%2C1003.0326%2C1003.0510%2C1003.0792%2C1003.3396%2C1003.3917%2C1003.3773%2C1003.3476%2C1003.0358%2C1003.4861%2C1003.3077%2C1003.1432%2C1003.2064%2C1003.3239%2C1003.0993%2C1003.2245%2C1003.3025%2C1003.0415%2C1003.4730%2C1003.0952%2C1003.3451%2C1003.4386%2C1003.3467%2C1003.5128%2C1003.5410%2C1003.3012%2C1003.1928%2C1003.0159%2C1003.2424%2C1003.3454%2C1003.3608%2C1003.1428%2C1003.0718%2C1003.3603%2C1003.4849%2C1003.0702%2C1003.5273%2C1003.1426%2C1003.3418%2C1003.1433%2C1003.1854%2C1003.3136%2C1003.0643%2C1003.0569%2C1003.0784%2C1003.4071%2C1003.4055%2C1003.4324%2C1003.6092%2C1003.1505%2C1003.4575%2C1003.5084%2C1003.5742%2C1003.4363%2C1003.4338%2C1003.4123%2C1003.1986%2C1003.2461%2C1003.2058%2C1003.0979&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "e study the effect of a magnetic impurity with spin-half on a single\npropagating electron in a one-dimensional model system via the tight-binding\napproach. Due to the spin-dependent interaction, the scattering channel for the\nflying qubit is split, and its transmission spectrum is obtained. It is found\nthat, the spin orientation of the impurity plays the role as a spin state\nfilter for a flying qubit."}, "authors": ["Lan Zhou", "Jing Lu"], "author_detail": {"name": "Jing Lu"}, "author": "Jing Lu", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1140/epjb/e2010-00088-3", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1003.3318v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1003.3318v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "6 pages, 5 figures", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1003.3318v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1003.3318v2", "journal_reference": "Eur. Phys. J. D 74, 373 (2010)", "doi": "10.1140/epjb/e2010-00088-3", "fulltext": "Coherently manipulating flying qubits in a quantum wire with a magnetic impurity\nLan Zhou1 and Jing Lu1\n1\n\nKey Laboratory of Low-Dimensional Quantum Structures and Quantum Control of Ministry of Education,\nand Department of Physics, Hunan Normal University, Changsha 410081, China\nWe study the effect of a magnetic impurity with spin-half on a single propagating electron in a onedimensional model system via the tight-binding approach. Due to the spin-dependent interaction,\nthe scattering channel for the flying qubit is split, and its transmission spectrum is obtained. It is\nfound that, the spin orientation of the impurity plays the role as a spin state filter for a flying qubit.\n\narXiv:1003.3318v2 [quant-ph] 28 May 2010\n\nPACS numbers: 03.67.-a, 03.65.Nk, 72.10.-d, 71.70.Gm\n\nI.\n\nINTRODUCTION\n\nξ\n-3\n\nQubits are the quantum state of given physical systems. There are two kinds of qubits, the first kind is\ncalled stationary qubits which are fixed into space, the\nsecond kind is the so-called flying qubits whose position\nchanges in time. To faithfully transfer quantum information, individual qubit control would be desirable. Controlling qubits are implemented by a sequence of logical operations or quantum gates. For stationary qubits,\nquantum gates are performed by choosing a proper time,\nhowever, a logic operation has to be fixed into space for\nflying qubits.\nNowadays, more attention has been paid on the use\nof the flying qubit due to the advantage that it allows\none to entangle distant stationary qubits that never interacted directly [1, 2]. Therefore, there are with keen\ninterest in seeking new device for controlling flying qubits\n[3–15] . Photon is the archetypal flying qubit, which is\nspecial ideal for long distance communication due to its\nhigh speed, strong stability and minor loss. Therefore\nquantum devices that enable new filtering and switching functions have been proposed, such as single photon\ntransistor [7, 8], quantum switch [4–6, 10]. The spin of\na propagating electron is an alternative leading candidate for a flying qubit [12–15] in short distance communication mostly due to the intrinsic nature of electron\nspin, namely that the spin degree of freedom is well isolated from the environment. The ability to manipulate\nan mobile spin qubits is indispensable for the potential\napplication in quantum information processing. A singlet spin filter has been proposed by the Coulomb interaction between a flying qubit and the trapped electron\nin a weak confining potential [14]. Later on it was generalized to a potential well with multiple bound orbitals\n[15]. In this paper, we propose a scheme whereby a single\npropagating electron is subject to a spin-spin interaction\nwith a magnetic impurity in a quantum wire. The local\nexternal magnetic field removes the degeneracy. Then\nthe spin-dependent scattering behavior of the propagating electron has been investigated via the tight-binding\napproach. Due to the spin-flip interaction between a single propagating electron and the magnetic impurity, a total reflection of the propagating electron has been found\nby a proper choice of the injection energy of the electron,\n\n-2\n\n-1\n\n0\n\n1\n\n2\n\n3\n\nFIG. 1: (Color online). Schematic of the perfect quantum\nwire in one dimension, where a magnetic impurity with spin1\nis embedded in the 0th site.\n2\n\ni.e. a spin filter is formed which filters the electron spin\nantiparallel to that of the magnetic impurity.\nThis paper is organized as follow. In Sec. II, we introduce our system, a flying qubit in one-dimensional (1D)\nmodel systems with a magnetic impurity inserted locally.\nIn Sec. III, the spin-induced multichannels is found for\nthis 1D quantum wire. And via single-electron configurations, the quantum transport of the flying qubit has been\nanalyzed. A spin switching mechanism is provided on the\nFano resonance, which is cause by the coupling between\nthe bound state outside one energy band and the continuum in the other band. Conclusions are summarized at\nthe end of the paper.\n\nII.\n\nA FLYING QUBIT WITH A MAGNETIC\nIMPURITY\n\nThe model we considered in this paper is shown in\nFig. 1. Thanks to the success of nanofabrication techniques in producing extremely small quantum objects,\nthis kind of quantum wires are now close to reality either\nby small semiconductor and metal structures as a fabricated quantum dot array [16, 17], or by the scanning\ntunnel microscope [18, 19] as the atomic chain.\nThe system in Fig. 1 is a one-dimensional wire, which\nalso has a impurity embedded in a host lattice. The\nHamiltonian of this system consists three parts\n\nHc =\n\nX\nσ\n\ncσ\nHqw\n+ Hfcr + Hex ,\n\n(1)\n\n\f2\nwhere\ncσ\nHqw\n=\n\nX\n\nωa†jσ ajσ +\n\n=\n\nX\nσ\n\nHex\n\n-3\n\n-2\n\n-1\n\n0\n\n-3\n\n-2\n\n-1\n\n0\n\n-3\n\n-2\n\n-1\n\n0\n\n(a)\n\n1\n\n2\n\n3\n\n1\n\n2\n\n3\n\n1\n\n2\n\n3\n\nj\n\nj\n\nHfcr\n\n\u0011\nX \u0010 †\nξ ajσ aj+1σ + h.c. , (2)\n\n(ω0 −\n\nω) a†0σ a0σ\n\n+\n\n\u0011\n\u0010\n∆ a†0e a0e − a†0g a0g + 2ΩI SIz ,\n\u0011\n\u0010\n= −2Jz a†0e a0e − a†0g a0g SIz\n\u0011\n\u0010\n−J a†0e a0g SI− + h.c. .\n\n(b)\n\nFIG. 2: (Color online). The reduced one-dimensional quantum wire: (a) in the subspace with all spins up or all spins\ndown; (b) in the subspace with one spin up and one spin\ndown.\n\ncσ\nHere the superscript σ ∈ {e, g} in Hqw\ndescribes the spin\ndegree of freedom, where e (g) denotes spin up (down).\nThe host lattice is modeled as tight-binding Hamiltonian,\nwhich is represented by a sequence of potential sites with\non-site energies ω except the one at j = 0, and constant\namplitude ξ of hopping between the neighboring sites.\na†jσ (ajσ ) is the creation (annihilation) operator for the\n1D wire. The magnetic impurity of spin SI is located\nonly at one site, which is chosen as the origin. A given\nspin state of the impurity is changed by the spin rising\noperator SI+ and lowing operator SI− . In Eq. (2), Hamiltonian Hfcr has taken the interaction energy of the spin\nmagnetic moments with\n\u0010 the magnetic\u0011field into account\nthrough the terms ∆ a†0e a0e − a†0g a0g for the propagating electrons and 2ΩI SIz for the impurity. Here, ∆ and ΩI\nare the Zeeman splitting of the energy levels in the presence of an external magnetic field along the z-direction.\nThe exchange interaction among spins, which is a short\nrange point-like interaction localized at the point j = 0,\nis described by Hamiltonian Hex . Here we introduce the\nanisotropic spin-spin interaction with XXZ-type. Since\nwe are interested only in the coupling to single impurity, the interaction here is written in terms of the single\nspin operator above, rather than the second-quantized\ndescription of the impurity. By the Fourier transform,\nthe Hamiltonian for the conduction electrons reads\nX\ncσ\nHqw\n=\n(ω + 2ξ cos k) a†kσ akσ\nk\n\nwhere a†kσ and akσ are the usual creation and annihilation\noperators of the conduction electron with wave vectors k\nand spin σ. And the anisotropic spin-spin interaction\nreads\n\u0011\nJz X \u0010 †\nHex = −2\nake ak′ e − a†kg ak′ g SIz\nN ′\nkk\n\u0011\nJ X\u0010 †\nake ak′ g SI− + h.c.\n−\nN ′\nkk\n\ncσ\nwhere N is the number of sites in the lattice. σ Hqw\n+\nHex is the Hamiltonian for the system consisting of a\nlocalized spin in interaction with the conduction band,\nwhich is a simpler Kondo model when Jz = J.\n\nP\n\nIII. CONTROLLING THE PROPAGATING\nELECTRON IN 1D QUANTUM WIRE\n\nA flying qubit is a physical realization of a qubit which\nmoves freely and allows information to be transported\nfrom one location to another. Obivously, the spin of an\nelectron propagating along the host 1D structure acts as\na flying qubit, it also interacts and exchanges information\nwith the magnetic impurity due to the exchange interaction. For the sake of simplicity, we assume the magnetic\nimpurity is a spin-1/2 particle in the following discussion.\nThe single-electron particle picture is employed to study\nthe quantum transport in a quantum wire throughout\nthe paper. In this section, we will first derive the eigenvalue equation, and then study the quantum transport\nand discuss how to manipulate the flying qubits in this\nsystem.\n\nA.\n\nspin selective scattering\n\nThe total spin in z direction is always conserved during the time evolution of an arbitrary state. However,\nthe applied magnetic field breaks the spin degeneracy.\nTherefore, dependent on the spin-orientation of both the\nBloch electron and the magnetic impurity, the Hamiltonian in Eq. (1) can be rewritten as the direct sum of three\nparties: Hee , Hgg and Heg . Here,\nce\nHee = Hqw\n+ ΩI + δe a†0e a0e\n\n(3)\n\ncorresponds to the subspace with all spins up, where δe =\nω0 − ω + ∆ − Jz .\ncg\nHgg = Hqw\n− ΩI + δg a†0g a0g\n\n(4)\n\nis the Hamiltonian of the subspace with all spins down,\nwhere δg = ω0 − ω − ∆ − Jz . The two-by-two matrix\nHeg =\n\nX\nσ\n\ncσ\nHqw\n+\n\n\"\n\nω̄g a†0g a0g + ΩI\n−Jx a†0e a0e\n†\n−Jx a0g a0g\nω̄e a†0e a0e − ΩI\n\n#\n\n(5)\n\n\f3\ndescribes the interaction in the subspace with one spin\ndown and one spin up, where\nω̄g = Jz + ω0 − ω − ∆,\nω̄e = Jz + ω0 − ω + ∆.\n\n(6a)\n(6b)\n\nIn Eq. (5), the off-diagonal elements present the interaction of the electron spin with the x and y components\nof the impurity spins which leads to spin-flip. Obviously,\nthe original single-band split into subbands with energy\nseparations controlled by the local magnetic field applied\nto the impurity. In Fig. (2), we give a sketch of the equivalent quantum wire in different subspaces. In subspace\nwith all spins up or down, it is a 1D chain with nearest\nineraction, however in other subspace corresponding to\nthe mixture of the singlet and triplet states, it is two 1D\nchains which get crossed at the point j = 0.\n\nB.\n\nscattering in subspace with all spin down\n\nNow we study the transport property of the Bloch electron in this system.\nare simn Note othat the\nn configurations\no\n†\n†\nilar in subspace ajg |0gi and aje |0ei , as well as the\nsubspace described by Hamiltonian Heg when Jx = 0, so\nwe take the scattering problem in the subspace with all\nspin down as an example. When the Bloch electron and\nthe impurity are widely separated, we can separate the\nelectronic and impurity-spin degrees of freedom. Therefore the eigenstate for this subspace is in the form\n|Ek i =\n\nX\nj\n\nu1k (j) a†jg |0gi ,\n\n(7)\n\nwhere |gi is the spin state of the magnetic impurity, u1k (j)\nis the probability density for finding the Bloch electron\nwith spin down at the jth site. The wave function u1k (j)\nin this chain are obtained from the discrete Schrödinger\nequation\n\u0002\n\u0003\n(Ek − ǫe − δg δj0 ) u1k (j) = ξ u1k (j + 1) + u1k (j − 1)\n(8)\nwhere\nǫ e = ω − ΩI .\n\n(9)\n\nIf we regard the hopping between different sites as the\nkinetic term in Eq. (8), a delta-type potential is given\nrise to by the exchange interaction between spins and\nthe on-site energy at site j = 0.\nAn incoming wave with energy Ek , incident from the\nleft, results in a reflected and transmitted wave. The\nwave functions in the asymptotic regions on the left and\nright are given by\n\u001a ikj\ne + r1 e−ikj j < 0\n1\nuk (j) =\n(10)\nt1 eikj\nj>0\n\n( a)\n\n( b)\n\nFIG. 3: the contour plot of the transmission coefficient in the\ncomplex plane vs the energy E in (a), the wave number k\nin (b). k is in units of √\nthe lattice constant, E is in units of\nhopping energy ξ, δg = 5ξ, ω = 0.\n\nwhere r1 and t1 are some elements of the scattering matrix. Using the connection condition at j = 0\n\u0001\n\u0001\nu1k 0− = u1k 0+\n(11a)\n\u0002 1\n\u0003\n1\n1\n(E − ǫe + δg ) uk (0) = ξ uk (1) + uk (−1) (11b)\n\nthe transmission amplitude can be found\nt1 =\n\n2ξi sin k\n2ξi sin k − δg\n\n(12)\n\nand the backscattering amplitude also can be obtained\nby the relation t1 = 1 + r1 , where the dispersion relation\nEk = ǫe + 2ξ cos k\n\n(13)\n\nis used.\nAs the singularities of the scattering matrix give rise to\nthe resonant states, in Fig. 3, we plot the contour curve\n2\nof the transmission coefficient T = |t1 | in the complex\nplane. From Fig. 3(a), it can be seen that the transmission spectrum possesses two resonance poles in the\ncomplex-energy plane. Each pole is connected with a resonance level (or a quasibound state). According to the\nBreit-Wigner formalism, the real part of a pole presents\nthe energy of a quasibound state, and the imaginary part\nis related to the lifetime of the resonance level [20, 21].\nIn Fig. 3(a), these two poles are separate on the realenergy axis, which means that each pole corresponds to\na bound state. These states are produced by lack of periodicity in r-space. Bound states are the eigenfunctions\nin this system [22]. In this subspace with all spin down\n(or up), bound states has no contribution to the quantum transport, because scattering states survive only inside the band. However, in the subspace of antiparallel\nspins, shown in Fig. 2(b), things become different. We\nwill discuss this situation in the following section. Obviously, the energy of these bound states is tunable with\ngate voltage at origin applied by a quantum point contact, and the exchange coupling along z direction as well\nas the magnetic field. Transmission zeroes also include\nin Fig. 3(a), which appear at the border of the band.\n\n\f4\nTransmission vanishes due to the vanishing group velocities at k = 0, ±π. Figure 3(b) is the contour plot of\ntransmittance as a function a complex momentum. It\nconfirms the above results. Furthermore, transmission\nvanishes and two bound states appear outside the band\nat Rek = 0, ±π. This result can be found analytically\nby substituting the complex momentum into the dispersion relation in Eq. (13). Actually the energy and the\nformation of the bound states can be analytically gotten\nby the following assumption\n\u001a\nC1 e(inπ+κ)j j < 0\n1\n,\n(14)\nuκ (j) =\nC1 e(inπ−κ)j j > 0\nwhere n = 0, 1 and κ > 0. From the continuous condition given in Eq. (11b), the energy of the bound state is\nobtained as\nq\nn\nEk = ω + (−1)\n4ξ 2 + δg2 ,\n(15)\nand the normalized wavefunction reads\n\u001a√\ntanh κe(inπ+κ)j j < 0\n.\nu1κ (j) = √\ntanh κe(inπ−κ)j j > 0\n\n(16)\n\nHere, only bound states with even parity exist.\nC.\n\nspin-dependent switch\n\nWe now investigate the scattering process of the propagating electron in a subspace with one spin up and one\nspin down. The stationary state in this excited space has\nthe form\ni\nXh g\n(17)\nuk (j) a†jg |0ei + uek (j) a†je |0gi\n|Ek i =\nj\n\nwhere uik (j) is the wave function of the Bloch electron\nwith spin i = e or g. Applying Eq. (17) into the stationary Schrödinger equation, one obtains\nJx δj0 uek (j) = ξ [ugk (j + 1) + ugk (j − 1)]\n− (Ek − ǫg − ω̄g δj0 ) ugk (j)\ng\nJx δj0 uk (j) = ξ [uek (j + 1) + uek (j − 1)]\n− (Ek − ǫe − ω̄e δj0 ) uek (j)\n\n(18a)\n(18b)\n\nwhere ω̄i (i = e, g) are given in Eq. (6), ǫe is listed in\nEq. (9), the parameter\nǫ g = ω + ΩI .\n\n(19)\n\nEquation (18) shows that there is a delta potential at\nj = 0 in each channel, which can be adjusted by onsite energy ω0 , the Zeeman energy ∆, and the exchange\ninteraction strength Jz almong z direction. Obviously,\nwhen Jx = 0, these two chains are independent. From the\nabove discussion, we have already known that a discrete\nstate is created by the impurity and this discrete energy\n\n( a)\n\n( b)\n\n( c)\n\n( d)\n\ng\nFIG. 4: (Color online). The transmission Trl\n= |tgrl |2 (blue\ng\ng 2\nsolid line) and reflection coefficient Rll = |rll | (red dotted\ng\ng\nline), and the sum of Trl\n+ Rll\n(black dot-dashed line) as a\nfunction of either the energy E. Here ω = ω0 = 0, Jx = 0.5.\nParameters are in units of ξ. (a) ΩI = 0.8, ∆ = 0.8, Jz = 0.8,\n(b) ΩI = 2.01, ∆ = 0.8, Jz = 0.8, (c) ΩI = 2.01, ∆ = 1, Jz =\n0.6, (d) ΩI = 2.01, ∆ = 0.6, Jz = 1.\n\nis outside the band. In this section, new features arise\ndue to the nonvanishing coupling Jx . It is well known\nthat when a system is characterized by a coupling of a\ncertain discrete energy and a continuum state, Fano resonance [20, 23, 24] appears because the discrete state offers\none additional propagation path in the wave scattering\nwhich interact constructively or destructively.\nA propagating electron in these channel will occupy an\nenergy of the form\nEk = ǫg + 2ξ cos kg = ǫe + 2ξ cos ke ,\n\n(20)\n\nwhere ke and kg are the electron wave vectors. The process that an incident wave impinges upon the structure\nunder study, and transmitted and reflected wave emerge,\nis formulated by\n\u001a ik j\ne g + rllg e−ikg j j < 0\nugk (j) =\n,\n(21a)\ntgrl eikg j\nj>0\n\u001a\nDe−ike j\nj<0\nuek (j) =\n,\n(21b)\nBeike j\nj>0\nApplying Eq. (21) to the discrete Schrödinger equation (18) for the 0th and ±1th sites, we immediately\nobtain the transmission amplitude\ntgrl =\n\n2iξ sin kg (2iξ sin ke + ω̄e )\n,\n(2iξ sin kg + ω̄g ) (2iξ sin ke + ω̄e ) − Jx2\n\n(22)\n\nwithin the channel, where the spins of the Bloch electron and the magnetic impurity are down and up respectively. For later convenience, we denote this channel as\n|gei channel. The other channel in this subspace is denoted by |egi. The transmission amplitude from the |gei\nchannel to |egi channel reads\nB=\n\n2iξJx sin kg\n.\n(2iξ sin kg + ω̄g ) (2iξ sin ke + ω̄e ) − Jx2\n\n(23)\n\n\f5\n\nTransmission\n\n1.0\n0.8\n0.6\n0.4\n0.2\n0.0\n0\n\n1\n\n2\nE\n\n3\n\n4\n\nFIG. 5: (Color online). The transmission coefficient as a function of the energy E. Here ω = ω0 = 0, ΩI = 2.01, ∆ =\n0.8, Jz = 0.8, Jx = 0.2 for blue solid line and Jx = 0.5 for red\ndotted line in units of ξ.\n\nand three transmission zeroes in other figures. From\nEq. (18b), we know that there are no delta potentials\nat the 0th site in Fig. 4(a,b), however there are a delta\npotential well in Fig. 4(c) and a delta potential barrier\nin Fig. 4(d). The well increase the transmission at the\nright side of the dip and decrease it at the left side of the\ndip, vice verse for barrier. Figure 5 shows the influence of\nthe coupling strength Jx . It can be found that the width\nof the dip increases as Jx increases. The above discussion implies that one can use the local magnetic field and\ngate voltage to control the transport of this flying qubit,\na device with filtering and switching function is obtained.\nIV.\n\nThe reflection amplitudes rllg within the |gei channel and\nD from the |gei channel to |egi channel can be obtained\nby the relation tgrl = 1 + rllg and D = B respectively.\nHere, we interest in a specific situation, namely, a regime\nwhere the Fano resonance might happen. Due to the\nremoving the degeneracy of these two channels by the\napplied magnetic field, we can study the above regime\nby replacing ke with nπ + iκe . Then Eq. (22) becomes\nn\n\ntgrl =\n\n2iξ sin kg [ω̄e − (−1) 2ξ sinh κe ]\n(24)\nn\n(2iξ sin kg + ω̄g ) [ω̄e − (−1) 2ξ sinh κe ] − Jx2\n\nIn the following discussion we set n = 0.\ng\nIn Fig. 4, we plot the transmission coefficient Trl\n=\ng 2\ng\n|trl | (blue solid line), reflection coefficient Rll = |rllg |2\ng\n(red dotted line), and the sum of Trl\n+ Rllg (black dotdashed line) as a function of the energy E. It can be\nfound that: 1) there is a transmission zero (or a perfect reflection) inside the band; 2) the flow is preserved,\ng\nwhich is implied by Trl\n+Rllg = 1 in this regime. The vanishing transmission is caused by the coupling between\nthe continuum and the bound state. The reason for\nthe conserved flow is that except the bound state, other\nstates are forbidden outside the band of |egi channel,\nwhich is the energy regime we are interested, therefore\nenergy is conserved in |gei channel. The difference between Fig. 4(a) and others are that there is some overlap\nof the continuum between these two channels, which is\nwhy there are only two transmission zeroes in Fig. 4(a)\n\n[1] Y. L. Lim, A. Beige, and L. C. Kwek, Phys. Rev. Lett.\n95, 030505 (2005).\n[2] T. Durt, L. C. Kwek, and D. Kaszlikowski, Phys. Rev. A\n77, 042318 (2008).\n[3] J. Kim, O. Benson, H. Kan, and Y. Yamamoto, Nature\n(London) 397, 500 (1998).\n[4] J.-T. Shen and S. Fan, Phys. Rev. Lett. 95, 213001\n(2005).\n[5] C.P. Sun, L. F. Wei, Yu-xi Liu, and F. Nori, Phys. Rev.\nA 73, 022318 (2006);\n[6] P. Bermel, A. Rodriguez, S.G. Johnson, J.D. Joannopoulos, and M. Soljačič, Phys. Rev. A 74, 043818 (2006).\n[7] D.E. Chang, A.S. Sørensen, E.A. Demler, and\n\nCONCLUSION\n\nWe have investigated the spin of an electron propagating along the host 1D structure, which interacts and\nexchanges information with a local magnetic impurity.\nBy the tight-binding approach, the spin-dependent transmission/reflection coefficients is calculated within singleelectron configurations. The evanescent states are found,\ndue to the breaking periodicity of this 1D structure in\nr-space, and the energies of the evanescent states can be\nadjusted by the local electrode and the external magnetic\nfield. In particular, we have shown that a total reflection\noccurs for a propagating electron spin incident with the\nenergy of the evanescent state and anti-parallel to the\nspin orientation of the impurity. This total reflection is\noriginated from the Fano resonance. Therefore, the Zeeman splitting and spin-flip interaction are necessary.\n\nV.\n\nACKNOWLEDGMENTS\n\nThe author thanks Arkady M. Satanin for useful discussions. This work is supported by the NSFC under\nGrants No. 10704023 and 10775048, the NFRPC with under Grant Nos. 2007CB925204, New Century Excellent\nTalents in University (NCET-08-0682), and Scientific Research Fund of Hunan Provincial Education Department\nNo. 09B063 and No. 09C638\n\nM.D. Lukin, Nat. Phys. 3, 807 (2007).\n[8] Z. R. Gong, H. Ian, L. Zhou, and C.P. Sun, Phys. Rev.\nA 78, 053806 (2008).\n[9] B. Dayan, A. S. Parkins, T. Aoki, E. P. Ostby, K. J.\nVahala, and H. J. Kimble, Science 319, 1062 (2008).\n[10] L. Zhou, Z.R. Gong, Yu-xi Liu, C.P. Sun, and F. Nori,\nPhys. Rev. Lett. 101, 100501 (2008).\n[11] Lan Zhou, H. Dong, Yu-xi Liu, C. P. Sun and Franco\nNori, Phys. Rev. A 78, 063827 (2008).\n[12] S. Yang, Z. Song and C. P. Sun, Phys. Rev. A 73, 022317\n(2006).\n[13] D. Gunlycke, J. H. Jefferson, T. Rejec, A. Ramšak, D. G.\nPettifor, and G. A. D. Briggs, J. Phys.: Condens. Matter\n\n\f6\n18, S851 (2006)\n[14] J. H. Jefferson, A. Ramšak, and T. Rejec, Europhys. Lett.\n74, 764 (2006)..\n[15] M. Habgood, J. H. Jefferson, A. Ramšak, D. G. Pettifor,\nand G. A. D. Briggs, Phys. Rev. B 77, 075337 (2008).\n[16] D. Goldhaber-Gordon, H. Shtrikman, D. Mahalu, D.\nAbusch-Magder, U. Meirav, M.A. Kastner, Nature 391,\n156 (1998).\n[17] D. Goldhaber-Gordon, J. Göes, and M. A. Kastner, Phys.\nRev. Lett. 81, 5225 (1998).\n[18] N. Sundaram, S. A. Chalmers, P. F. Hopkins, and A. C.\nGossard, Science 254, 1326 (1991).\n[19] G. Binnig and H. Rohrer, Rev. Mod. Phys. 71, S324\n\n(1999).\n[20] A. M. Satanin and Y. S. Joe, Phys. Rev. B 71, 205417\n(2005).\n[21] Y.S. Joe, E.R. Hedin, and A.M. Satanin, Phys. Rev. B\n76, 085419 (2007).\n[22] N. Hatano, K. Sasada, H. Nakamura and T. Petrosky,\ne-print arXiv:0705.1388v2.\n[23] U. Fano, Phys. Rev. 124, 1866 (1961).\n[24] J. Gores, D. Goldhaber-Gordon, S. Heemeyer, M. A.\nKastner, H. Shtrikman, D. Mahalu, and U. Meirav, Phys.\nRev. B 62, 2188 (2000).\n\n\f"}