{"id": "http://arxiv.org/abs/1005.5278v2", "guidislink": true, "updated": "2010-08-18T08:05:55Z", "updated_parsed": [2010, 8, 18, 8, 5, 55, 2, 230, 0], "published": "2010-05-28T12:33:37Z", "published_parsed": [2010, 5, 28, 12, 33, 37, 4, 148, 0], "title": "Positive Supercompilation for a Higher-Order Call-By-Value Language", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.0171%2C1005.4790%2C1005.5335%2C1005.3851%2C1005.3227%2C1005.1776%2C1005.5625%2C1005.5578%2C1005.1309%2C1005.4974%2C1005.0742%2C1005.5472%2C1005.4202%2C1005.0958%2C1005.4545%2C1005.1422%2C1005.5413%2C1005.3517%2C1005.3593%2C1005.0312%2C1005.4146%2C1005.1615%2C1005.2472%2C1005.0065%2C1005.2476%2C1005.3872%2C1005.1403%2C1005.1505%2C1005.1511%2C1005.2997%2C1005.1642%2C1005.5191%2C1005.3842%2C1005.0603%2C1005.1099%2C1005.4675%2C1005.2316%2C1005.0434%2C1005.3300%2C1005.1650%2C1005.4756%2C1005.0243%2C1005.3532%2C1005.1585%2C1005.4242%2C1005.0474%2C1005.0709%2C1005.3895%2C1005.5688%2C1005.0877%2C1005.2870%2C1005.4370%2C1005.2950%2C1005.3066%2C1005.3670%2C1005.4993%2C1005.3234%2C1005.2662%2C1005.4703%2C1005.4920%2C1005.5399%2C1005.0907%2C1005.2753%2C1005.5135%2C1005.0204%2C1005.0807%2C1005.5696%2C1005.1769%2C1005.4846%2C1005.4872%2C1005.0901%2C1005.3261%2C1005.0040%2C1005.5706%2C1005.2842%2C1005.2187%2C1005.2779%2C1005.2465%2C1005.2503%2C1005.0290%2C1005.4855%2C1005.0769%2C1005.4767%2C1005.2458%2C1005.5523%2C1005.0151%2C1005.4378%2C1005.4712%2C1005.0484%2C1005.5177%2C1005.3198%2C1005.1665%2C1005.3838%2C1005.1441%2C1005.5432%2C1005.1456%2C1005.5278%2C1005.5212%2C1005.4246%2C1005.0024%2C1005.5068&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Positive Supercompilation for a Higher-Order Call-By-Value Language"}, "summary": "Previous deforestation and supercompilation algorithms may introduce\naccidental termination when applied to call-by-value programs. This hides\nlooping bugs from the programmer, and changes the behavior of a program\ndepending on whether it is optimized or not. We present a supercompilation\nalgorithm for a higher-order call-by-value language and prove that the\nalgorithm both terminates and preserves termination properties. This algorithm\nutilizes strictness information to decide whether to substitute or not and\ncompares favorably with previous call-by-name transformations.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.0171%2C1005.4790%2C1005.5335%2C1005.3851%2C1005.3227%2C1005.1776%2C1005.5625%2C1005.5578%2C1005.1309%2C1005.4974%2C1005.0742%2C1005.5472%2C1005.4202%2C1005.0958%2C1005.4545%2C1005.1422%2C1005.5413%2C1005.3517%2C1005.3593%2C1005.0312%2C1005.4146%2C1005.1615%2C1005.2472%2C1005.0065%2C1005.2476%2C1005.3872%2C1005.1403%2C1005.1505%2C1005.1511%2C1005.2997%2C1005.1642%2C1005.5191%2C1005.3842%2C1005.0603%2C1005.1099%2C1005.4675%2C1005.2316%2C1005.0434%2C1005.3300%2C1005.1650%2C1005.4756%2C1005.0243%2C1005.3532%2C1005.1585%2C1005.4242%2C1005.0474%2C1005.0709%2C1005.3895%2C1005.5688%2C1005.0877%2C1005.2870%2C1005.4370%2C1005.2950%2C1005.3066%2C1005.3670%2C1005.4993%2C1005.3234%2C1005.2662%2C1005.4703%2C1005.4920%2C1005.5399%2C1005.0907%2C1005.2753%2C1005.5135%2C1005.0204%2C1005.0807%2C1005.5696%2C1005.1769%2C1005.4846%2C1005.4872%2C1005.0901%2C1005.3261%2C1005.0040%2C1005.5706%2C1005.2842%2C1005.2187%2C1005.2779%2C1005.2465%2C1005.2503%2C1005.0290%2C1005.4855%2C1005.0769%2C1005.4767%2C1005.2458%2C1005.5523%2C1005.0151%2C1005.4378%2C1005.4712%2C1005.0484%2C1005.5177%2C1005.3198%2C1005.1665%2C1005.3838%2C1005.1441%2C1005.5432%2C1005.1456%2C1005.5278%2C1005.5212%2C1005.4246%2C1005.0024%2C1005.5068&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Previous deforestation and supercompilation algorithms may introduce\naccidental termination when applied to call-by-value programs. This hides\nlooping bugs from the programmer, and changes the behavior of a program\ndepending on whether it is optimized or not. We present a supercompilation\nalgorithm for a higher-order call-by-value language and prove that the\nalgorithm both terminates and preserves termination properties. This algorithm\nutilizes strictness information to decide whether to substitute or not and\ncompares favorably with previous call-by-name transformations."}, "authors": ["Peter A. Jonsson", "Johan Nordlander"], "author_detail": {"name": "Johan Nordlander"}, "author": "Johan Nordlander", "links": [{"title": "doi", "href": "http://dx.doi.org/10.2168/LMCS-6(3:5)2010", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1005.5278v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1005.5278v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cs.PL", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cs.PL", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "D.3.4; D.3.2", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1005.5278v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1005.5278v2", "arxiv_comment": null, "journal_reference": "Logical Methods in Computer Science, Volume 6, Issue 3 (August 18,\n  2010) lmcs:1038", "doi": "10.2168/LMCS-6(3:5)2010", "fulltext": "Logical Methods in Computer Science\nVol. 6 (3:5) 2010, pp. 1–39\nwww.lmcs-online.org\n\nSubmitted\nPublished\n\nJun. 1, 2010\nAug. 17, 2010\n\nPOSITIVE SUPERCOMPILATION\nFOR A HIGHER-ORDER CALL-BY-VALUE LANGUAGE\nPETER A. JONSSON AND JOHAN NORDLANDER\nLuleå University of Technology, Department of Computer Science and Electrical Engineering\ne-mail address: {pj,nordland}@csee.ltu.se\n\nAbstract. Previous deforestation and supercompilation algorithms may introduce accidental termination when applied to call-by-value programs. This hides looping bugs from\nthe programmer, and changes the behavior of a program depending on whether it is optimized or not. We present a supercompilation algorithm for a higher-order call-by-value\nlanguage and prove that the algorithm both terminates and preserves termination properties. This algorithm utilizes strictness information to decide whether to substitute or not\nand compares favorably with previous call-by-name transformations.\n\n1. Introduction\nIntermediate data structures such as lists allow functional programmers to write clear\nand concise programs, but carry a cost at run-time since additional heap cells need to be\nboth allocated and garbage collected. Both deforestation [57] and supercompilation [47] are\nautomatic program transformations which remove many of these intermediate structures.\nIn a call-by-value context these transformations are unsound, however, as they might hide\ninfinite recursion from the programmer. Consider the program\n(λx.y) (fac z).\nThis program could loop, if the value of z is negative. Applying Wadler's deforestation\nalgorithm to the program will result in y, which is sound under call-by-name or call-byneed. Under call-by-value the non-termination in the original program has been removed,\nand hence the meaning of the program has been altered by the transformation.\nThis is unfortunate since removing intermediate structures in a call-by-value language is\nperhaps even more important than in a lazy language since the entire intermediate structure\nhas to remain in memory during the computation.\nOhori and Sasano [35] saw this need and presented a very elegant algorithm for callby-value languages that removes intermediate structures. Their algorithm sacrifices some\ntransformational power for algorithmic simplicity. In this article we explore a different\npart of the design space: a more powerful transformation at the cost of some algorithmic\ncomplexity. The outcome is a meaning-preserving supercompiler for pure call-by-value\n1998 ACM Subject Classification: D.3.4, D.3.2.\nKey words and phrases: supercompilation, deforestation, call-by-value.\n\nl\n\nLOGICAL METHODS\nIN COMPUTER SCIENCE\n\nc\nDOI:10.2168/LMCS-6 (3:5) 2010\n\nCC\n\nP. A. Jonsson\nCreative Commons\n\n\f2\n\nP. A. JONSSON\n\nlanguages in general, together measurements from an implementation in a compiler for\nTimber [34], a pure call-by-value language.\nOur current work is a necessary first step towards supercompiling impure call-by-value\nlanguages, of which there are many available today. Well-known examples are OCaml [25],\nStandard ML [29] and F# [49]. Considering that F# is currently being turned into a\nproduct, it is quite likely that strict functional languages will be even more popular in the\nfuture.\nOne might think that our result should be easy to obtain by modifying a call-by-name\nalgorithm to simply delay beta reduction until every function argument has been specialized\nto a value. However, it turns out that this strategy misses even simple opportunities to\nremove intermediate structures. That is, eager specialization of function arguments risks\ndestroying fold opportunities that might otherwise appear, something which may prohibit\ncomplexity improvements to the resulting program.\nThe novelty of our supercompilation algorithm is that it concentrates all call-by-value\ndependencies to a single rule that relies on the result from a separate strictness analysis for\ncorrect behavior. In effect, our transformation delays transformation of function arguments\npast inlining, much like a call-by-name scheme does, although only as far as allowed by\ncall-by-value semantics. The result is an algorithm that is able to improve a wide range\nof illustrative examples like the existing algorithms do, but without the risk of introducing\nartificial termination.\nThe specific contributions of our work are:\n• We provide an algorithm for positive supercompilation including folding, for a strict and\npure higher-order functional language (Section 4).\n• We prove that the algorithm terminates and preserves the semantics of the program\n(Section 5).\n• We show preliminary benchmarks from an implementation in the Timber compiler (Section 6).\nWe start out with some examples in Section 2 to give the reader an intuitive feel of\nhow the algorithm behaves. Our language of study is defined in Section 3, right before the\ntechnical contributions are presented.\nThis article is an extended and improved version of a paper presented at POPL 2009 [20].\nAs well as clarifying a number of the examples and proofs, we give an improved formulation\nof Dapp () presented in Section 4.1, and make a small change to how let-expressions are\nhandled by the driving algorithm.\n2. Examples\nWadler [57] uses the example append (append xs ys) zs and shows that his deforestation\nalgorithm transforms the program so that it saves one traversal of the first list, thereby\nreducing the complexity from 2|xs| + |ys| to |xs| + |ys|.\nIf we naı̈vely change Wadler's algorithm to call-by-value semantics by eagerly attempting to transform arguments before attacking the body, we do not achieve this improvement.\nThe definition for append is:\nappend xs ys = case xs of\n[] → ys\n(x ′ : xs ′ ) → x ′ : append xs ′ ys\n\n\fPOSITIVE SUPERCOMPILATION\n\n3\n\nand we give an example of a hypothetical call-by-value variant of Wadler's deforestation\nalgorithm that attacks arguments first:\nappend (append xs ′ ys ′ ) zs ′\nInlining the body of the inner append and then pushing down the outer call into\neach branch gives\ncase xs ′ of\n[] → append ys ′ zs ′\n(x : xs) → append (x : append xs ys ′ ) zs ′\nTransformation of the first branch will create a new function h1 that is isomorphic\nto append, and call it. The second branch contains an embedding of the initial\nexpression and blindly transforming it will lead to non-termination of the transformation algorithm. One must therefore split this expression in two parts: the subexpression x : append xs ys ′ which we call h2 , and the outer expression append z zs ′\nwhere z is fresh. Continuing with x : append xs ys ′ and inlining append gives\nx : case xs of\n[] → ys ′\n(x ′ : xs ′ ) → x ′ : append xs ′ ys ′\nThe second branch contains a renaming of the expression we named h2 , so we\nsimply replace it with a call to h2 . Moving back to append z zs ′ we notice that this\nexpression is a renaming of the one called h1 , so we replace it with the call h1 z zs ′\nAssembling the pieces gives us the final result:\nletrec h1 xs ys = case xs of\n[] → ys\n(x ′ : xs ′ ) → x ′ : h1 xs ′ ys\nh2 x xs ys = x : case xs of\n[] → ys\n(x ′ : xs ′ ) → h2 x ′ xs ′ ys\n′\nin case xs of\n[] → h1 ys ′ zs ′\n(x : xs) → h1 (h2 x xs ys ′ ) zs ′\nNotice that the intermediate structure from the input program is still there after the transformation, and the complexity is still 2|xs| + |ys|! This can be compared to how the same\nexample is transformed by Wadler's algorithm as shown in Figure 1. The reason our hypothetical call-by-value algorithm failed to improve the program is that it had to split\nexpressions too early during the transformation, thereby preventing fold opportunities that\noccur in a call-by-name setting.\nHowever, changing the call-by-value algorithm to do the exact opposite - that is,\ncarefully delaying the transformation of arguments to a function past the inlining of its\nbody, but only as far as strictness allows - actually leads to the same result that Wadler\n\n\f4\n\nP. A. JONSSON\n\nappend (append xs ′ ys ′ ) zs ′\nNaming the first expression h1 and inlining both occurrences of append gives\ncase ( case xs ′ of\n[] → ys ′\n(x1 : xs1 ) → x1 : append xs1 ys ′ ) of\n[] → zs ′\n(x : xs) → x : append xs zs ′\nPushing down the outer case-expression into both branches of the inner one\nand reducing the resulting case-expression of a known constructor leads to\ncase xs ′ of\n[] → case ys ′ of\n[] → zs ′\n(x : xs) → x : append xs zs ′\n(x1 : xs1 ) → x1 : append (append xs1 ys ′ ) zs ′\nTransform each branch separately. Transformation of the second branch in\nthe first branch will create a new function h2 that is isomorphic to append,\nand the second branch of the outer case is a renaming of our initial expression\ncalled h1 . Assembling all pieces yields the following result:\nletrec h1 xs ys zs = case xs of\n[] → case ys of\n[] → zs\n(y ′ : ys ′ ) → y ′ : h2 ys ′ zs\n′\n′\n(x : xs ) → x ′ : h1 xs ′ ys zs\nh2 xs ys = case xs of\n[] → ys\n(x ′ : xs ′ ) → x ′ : h2 xs ′ ys\nin h1 xs ′ ys ′ zs ′\nFigure 1: Wadler's algorithm transforming append (append xs' ys') zs'\nobtains with append (append xs ys) zs. This is a key observation for obtaining deforestation\nunder call-by-value without altering the semantics, and our transformation exploits it.\nExcept for the fundamental reliance on strictness analysis, which is necessary to preserve semantics, our transformation shares many of its rules with Wadler's algorithm. The\ntransformation that is commonly referred to as case-of-case is crucial for our transformation, just like it is for a call-by-name algorithm. The case-of-case transformation is useful\nwhen a case-expression appears in the head of another case-expression, in which case the\nouter case context is duplicated and pushed into all branches of the inner case-expression.\nOur transformation also contains rules that correspond to ordinary evaluation which eliminate case-expressions that have a known constructor in their head or adds two primitive\nnumbers. The mechanism that ensures termination basically looks for \"similar\" terms to\n\n\fPOSITIVE SUPERCOMPILATION\n\n5\n\nones that have already been transformed, and if a similar term is encountered, the transformation will stop and split the term into smaller terms that are transformed separately.\nThe remaining rules of our transformation simply shifts focus to the proper subexpression\nand ensures that the algorithm does not get stuck.\nWe claim that our transformation compares favorably with previous call-by-name transformations, and we now proceed with demonstrating the transformation on some common\nexamples. The results of the transformation on these examples are identical to the results\nof Wadler's algorithm [57].\nThis does not hold in general, a counter-example is the transformation of the expression zip (map f xs) (map g ys) where Wadler's algorithm will eliminate both intermediate\nstructures and our transformation will only eliminate the first intermediate structure.\nOur first example is transformation of sum (map square ys), where the referenced functions are defined as:\nsquare x = x ∗ x\nmap f xs = case xs of\n[] → ys\n(x : xs) → f x : map f xs\nsum xs = case xs of\n[] → 0\n(x : xs) → x + sum xs\nWe start our transformation by allocating a new fresh function name h0 to the expression\nsum (map square ys), inlining the body of sum and substituting map square ys into the body\nof sum:\ncase map square ys of\n[] → 0\n(x ′ : xs ′ ) → x ′ + sum xs ′\nAfter inlining map and substituting the arguments into the body the result becomes:\ncase ( case ys of\n[] → []\n(x ′ : xs ′ ) → (square x ′ ) : map square xs ′ ) of\n[] → 0\n(x ′ : xs ′ ) → x ′ + sum xs ′\nWe duplicate the outer case in each of the inner case branches, using the expression\nin the branches as head of that case-expression. Continuing the transformation on each\nbranch with ordinary reduction steps yields:\ncase ys of\n[] → 0\n(x ′ : xs ′ ) → square x ′ + sum (map square xs ′ )\nAt this point we inline the body of the first square occurrence and observe that the\nsecond parameter to (+) is similar to the expression we started with and therefore we\nreplace it with h0 xs ′ . The result of our transformation is h0 ys, with h0 defined as:\nh0 ys = case ys of\n[] → 0\n(x ′ : xs ′ ) → x ′ ∗ x ′ + h0 xs ′\n\n\f6\n\nP. A. JONSSON\n\nThis new function only traverses its input once, and no intermediate structures are\ncreated. If the expression sum (map square xs) or a renaming of it is detected elsewhere in\nthe input, a call to h0 will be inserted instead.\nThe work by Ohori and Sasano [35] cannot fuse two successive applications of the same\nfunction, nor mutually recursive functions. We show in the next two examples that our\ntransformation can handle these cases. We need the following new function definitions:\nmapsq xs = case xs of\n[] → []\n(x ′ : xs ′ ) → (x ′ ∗ x ′ ) : mapsq xs ′\nf xs\n= case xs of\n[] → []\n(x ′ : xs ′ ) → (2 ∗ x ′ ) : g xs ′\ng xs\n= case xs of\n[] → []\n(x ′ : xs ′ ) → (3 ∗ x ′ ) : f xs ′\nTransforming mapsq (mapsq xs) will inline the outer mapsq , substitute the argument\nin the function body and inline the inner call to mapsq :\ncase ( case xs of\n[] → []\n(x ′ : xs ′ ) → (x ′ ∗ x ′ ) : mapsq xs ′ ) of\n[] → []\n(x ′ : xs ′ ) → (x ′ ∗ x ′ ) : mapsq xs ′\nAs previously, we duplicate the outer case in each of the inner case branches, using the\nexpression in the branches as head of that case-expression. Continuing the transformation\non each branch by ordinary reduction steps yields:\ncase xs of\n[] → []\n(x ′ : xs ′ ) → (x ′ ∗ x ′ ∗ x ′ ∗ x ′ ) : mapsq (mapsq xs ′ )\nHere we encounter a similar expression to what we started with, and create a new\nfunction h1 . The final result of our transformation is h1 xs, with the new residual function\nh1 that only traverses its input once defined as:\nh1 xs = case xs of\n[] → []\n(x ′ : xs ′ ) → (x ′ ∗ x ′ ∗ x ′ ∗ x ′ ) : h1 xs ′\nFor an example of transforming mutually recursive functions, consider the transformation of sum (f xs). Inlining the body of sum, substituting its arguments in the function\nbody and inlining the body of f yields:\ncase ( case xs of\n[] → []\n(x ′ : xs ′ ) → (2 ∗ x ′ ) : g xs ′ ) of\n[] → 0\n(x ′ : xs ′ ) → x ′ + sum xs ′\nWe now move down the outer case into each branch, and perform reductions until we end\nup with:\n\n\fPOSITIVE SUPERCOMPILATION\n\n7\n\ncase xs of\n[] → 0\n(x ′ : xs ′ ) → (2 ∗ x ′ ) + sum (g xs ′ )\nWe notice that unlike in previous examples, sum (g xs ′ ) is not similar to what we\nstarted transforming and we can therefore continue the transformation. For space reasons,\nwe focus on the transformation of the rightmost expression in the last branch, sum (g xs ′ ),\nwhile keeping the functions already seen in mind. We inline the body of sum, perform the\nsubstitution of its arguments and inline the body of g:\ncase ( case xs ′ of\n[] → []\n(x ′′ : xs ′′ ) → (3 ∗ x ′′ ) : f xs ′′ ) of\n[] → 0\n(x ′ : xs ′ ) → x ′ + sum xs ′\nWe now move down the outer case into each branch, and perform reductions:\ncase xs ′ of\n[] → 0\n(x ′′ : xs ′′ ) → (3 ∗ x ′′ ) + sum (f xs ′′ )\nWe notice a familiar expression in sum (f xs ′′ ), and fold when reaching it. Combining\nthe fragments together gives a new function h2 :\nh2 xs = case xs of\n[] → 0\n(x ′ : xs ′ ) → (2 ∗ x ′ ) + case xs ′ of\n[] → 0\n(x ′′ : xs ′′ ) → (3 ∗ x ′′ ) + h2 xs ′′\nThe new function h2 consumes a list and returns a number, so our algorithm has\neliminated the intermediate list between f and sum.\nKort [22] studied a ray-tracer written in Haskell, and identified a critical function in\nthe innermost loop of a matrix multiplication, called vecDot:\nvecDot xs ys = sum (zipWith (∗) xs ys)\nThis is simplified by our positive supercompiler to:\nvecDot xs ys = h1 xs ys\nh1 xs ys\n= case xs of\n(x ′ : xs ′ ) → case ys of\n(y ′ : ys ′ ) → x ′ ∗ y ′ + h1 xs ′ ys ′\n→ 0\n→ 0\nThe intermediate list between sum and zipWith is transformed away, and the complexity\nis reduced from 2|xs| + |ys| to |xs| + |ys| (since this is matrix multiplication |xs| = |ys|).\n\n\f8\n\nP. A. JONSSON\n\nExpressions\ne, f\n\n::= n | x | g | f e | λx.e | k e | e1 ⊕ e2 | case e of {pi → ei }\n| let x = f in e | letrec g = v in e\n\np\n\n::= n | k x\n\nValues\nv\n\n::= n | λx.e | k v\nFigure 2: The language\nfv(x)\nfv(n)\nfv(g)\nfv(k e)\nfv(λx.e)\nfv(f e)\nfv(let x = e in f )\nfv(letrec g = v in f )\nfv(case e of {pi → ei })\nfv(e1 ⊕ e2 )\n\n=\n=\n=\n=\n=\n=\n=\n=\n=\n=\n\n{x}\n∅\n∅\nfv(e)\nfv(e)\\{x}\nfv(f ) ∪ fv(e)\nfv(e) ∪ (fv(f )\\{x})\nfv(v) ∪ fv(f\nS )\nfv(e) ∪ ( (fv(ei )\\fv(pi )))\nfv(e1 ) ∪ fv(e2 )\n\nFigure 3: Free variables of an expression\n3. Language\nOur language of study is a strict, higher-order functional language with let-bindings\nand case-expressions. Its syntax for expressions, values and patterns is shown in Figure 2.\nHere we let variables and constructor symbols be denoted by x and k, respectively. The\nconstructor symbols k range over a set K and we also assume that there is a separate set G\nof recursively defined function symbols, ranged over by g. In what follows we will assume\nthat the meaning of such symbols is given by a recursive map G mapping symbols g to their\ndefined value.\nThe language contains integer values n and arithmetic operations ⊕, although these\nmeta-variables can preferably be understood as ranging over primitive values in general and\narbitrary operations on these. We let + denote the semantic meaning of ⊕.\nA list of expressions e1 . . . en is abbreviated as e, and a list of variables x1 . . . xn as x.\nWe denote the free variables of an expression e by fv(e), as defined in Figure 3. Along\nthe same lines we denote the function names in an expression e as fn(e), defined in Figure 4.\nWe encode letrec as an application containing fix, where fix is defined as\nf ix = λf.f (λn.f ix f n)\nDefinition 3.1. Letrec is defined as:\ndef\n\nletrec h = λx.e in e′ = (λh.e′ ) (λy.f ix (λh.λx.e) y)\n\n\fPOSITIVE SUPERCOMPILATION\n\nfn(x)\nfn(n)\nfn(g)\nfn(k e)\nfn(λx.e)\nfn(f e)\nfn(let x = e in f )\nfn(letrec g = v in f )\nfn(case e of {pi → ei })\nfn(e1 ⊕ e2 )\n\n=\n=\n=\n=\n=\n=\n=\n=\n=\n=\n\n9\n\n∅\n∅\n{g}\nfn(e)\nfn(e)\nfn(f ) ∪ fn(e)\nfn(e) ∪ fn(f )\n(fn(v) ∪ S\nfn(f ))\\{g}\nfn(e) ∪ ( (fn(ei ))\nfn(e1 ) ∪ fn(e2 )\n\nFigure 4: Function names of an expression\nReduction contexts\nE\n\n::= \u001f | E e | (λx.e) E | k E | E ⊕ e | n ⊕ E | case E of {pi → ei } | let x = E in e\nEvaluation relation\nEhgi\n7→\nEh(λx.e) vi\n7→\nEhlet x = v in ei\n7→\nEhcase k v of {ki xi → ei }i7→\nEhcase n of {ni → ei }i\n7→\nEhn1 ⊕ n2 i\n7→\n\nEhvi, if (g, v) ∈G\nEh[v/x]ei\nEh[v/x]ei\nEh[v/xj ]ej i, if k = kj\nEhej i, if n = nj\nEhni, if n = n1 + n2\n\n(Global)\n(App)\n(Let)\n(KCase)\n(NCase)\n(Arith)\n\nFigure 5: Reduction semantics\nBy defining letrec as syntactic sugar for other primitives we introduce an implicit requirement that the right hand side of letrec expressions must not contain any free variables\nexcept h. This is not a limitation since functions that contain free variables can be lambda\nlifted [17] to the top level.\nA program is an expression with no free variables and all function names defined in G.\nThe intended operational semantics is given in Figure 5, where [e/x]e′ is the capture-free\nsubstitution of expressions e for variables x in e′ .\nA reduction context E is a term containing a single hole, \u001f, which indicates the next\nexpression to be reduced. The expression Ehei is the term obtained by replacing the hole\nin E with e. E denotes a list of terms with just a single hole, evaluated from left to right.\nIf a variable appears no more than once in a term, that term is said to be linear with\nrespect to that variable. Like Wadler [57], we extend the definition slightly for linear caseexpressions: no variable may appear in both the head and a branch, although a variable\nmay appear in more than one branch. For example, the definition of append is linear is\nlinear with respect to ys, although ys appears in both branches.\n\n\f10\n\nP. A. JONSSON\n\n4. Higher Order Positive Supercompilation\nIt is time to make the intuition developed in Section 2 more formal. Our supercompiler\nis defined as a set of rewrite rules that pattern-match on expressions. This algorithm is called\nthe driving algorithm, and is defined in Figure 6. Three additional parameters appear as\nsubscripts to the rewrite rules: a driving context R, the set of global function definitions\nG and a memoization list ρ. The memoization list holds information about expressions\nalready traversed and is explained more in detail in Section 4.1. The driving context R is\nsmaller than E, and is defined as follows:\nR ::= \u001f | R e | case R of {pi → ei } | R ⊕ e | e ⊕ R\nInterestingly, this definition coincides with the evaluation contexts for a call-by-name language. The reason our transformation still preserves a call-by-value semantics is that beta\nreduction (rule R9) results in a let-binding, whose further specialization in rule R13 depends\non whether the body expression f is strict in the bound variable x or not.\nOur let-rule (R13) might change the order of computations, but since non-termination\nis commutative this does not matter in practice. Supercompiling impure languages requires\nstronger conditions for the let-rule, since expressions might contain effects other than nontermination. The difficulty of supercompiling an impure language is to find sufficient conditions that preserve soundness while still allowing the maximum amount of reordering of\nexpressions.\nIn principle, an expression e is strict with regards to a variable x if evaluation of e\neventually requires the value of x; in other words, if e 7→ . . . 7→ Ehxi. Such information\nis not computable in general, although call-by-value semantics allows for reasonably tight\napproximations. One such approximation is given in Figure 7, where the strict variables of\nan expression e are defined as all free variables of e except those that only appear under a\nlambda or not inside all branches of a case.\nThere is an ordering between the driving rules; i.e., all rules must be tried in the order\nthey appear. Rule R10 is the default fallback case for applications and rule R19 is the\ndefault fallback case for case expressions. These rules extend the driving context R and\nzoom in on the next expression to be driven. The program is turned \"inside-out\" by moving\nthe surrounding context R into all branches of the case-expression through rules R15 and\nR18. Rule R13 has a similar mechanism for let-expressions. Notice how the context is\nmoved out of the recursive call in rule R5, whereas rule R7 recursively applies the driving\nalgorithm to the full new term Rhni, forcing a re-traversal of the new term in search for for\nfurther reduction opportunities. Rule R12 is only allowed to match if the variable y is not\nfreshly generated by the splitting mechanism described in the next section. Meta-variable\na in rules R8 and R18 stands for an \"annoying\" expression; i.e., an expression that would\nbe further reducible were it not for a free variable getting in the way. The grammar for\nannoying expressions is:\na ::= x | n ⊕ a | a ⊕ n | a ⊕ a | a e\nSome expressions should be handled differently depending on context. If a constructor\napplication appears in an empty context, there is not much we can do but to drive the\nargument expressions (rule R4). On the other hand - if the application occurs at the head\nof a case-expression, we may choose a branch on basis of the constructor and leave the\narguments unevaluated in the hope of finding fold opportunities further down the syntax\ntree (rule R16).\n\n\fPOSITIVE SUPERCOMPILATION\n\nDJnKR,G,ρ\nDJxKR,G,ρ\nDJgKR,G,ρ\nDJk eK\u001f,G,ρ\nDJx eKR,G,ρ\nDJλx.eK\u001f,G,ρ\nDJn1 ⊕ n2 KR,G,ρ\nDJe1 ⊕ e2 KR,G,ρ\n\n=\n=\n=\n=\n=\n=\n=\n=\n\nDJ(λx.f ) eKR,G,ρ\nDJe e′ KR,G,ρ\nDJlet x = n in f KR,G,ρ\nDJlet x = y in f KR,G,ρ\nDJlet x = e in f KR,G,ρ\n\n=\n=\n=\n=\n=\n\nDJletrec g = v in eKR,G,ρ\nDJcase x of {pi → ei }KR,G,ρ\nDJcase kj e of {ki xi → ei }KR,G,ρ\nDJcase nj of {ni → ei }KR,G,ρ\nDJcase a of {pi → ei }KR,G,ρ\nDJcase e of {pi → ei }KR,G,ρ\nDJeKR,G,ρ\n\n=\n=\n=\n=\n=\n=\n=\n\nRhni\nRhxi\nDapp (g)R,G,ρ\nk DJeK\u001f,G,ρ\nRhx DJeK\u001f,G,ρ i\n(λx.DJeK\u001f,G,ρ )\nDJRhniK\u001f,G,ρ , where n = n1 + n2\nDJe1 K\u001f,G,ρ ⊕ DJe2 K\u001f,G,ρ , if e1 ⊕ e2 = a\nDJe2 KRhe1 ⊕\u001fi,G,ρ , if e1 = n or e1 = a\nDJe1 KRh\u001f⊕e2 i,G,ρ , otherwise\nDJlet x = e in f KR,G,ρ\nDJeKRh\u001f e′ i,G,ρ\nDJRh[n/x]f iK\u001f,G,ρ\nDJRh[y/x]f iK\u001f,G,ρ , if y not freshly generated\nDJRh[e/x]f iK\u001f,G,ρ , if x ∈ strict(f ) and\nx ∈ linear(f )\nlet x = DJeK\u001f,G,ρ in DJRhf iK\u001f,G,ρ , otherwise\nDJRheiK\u001f,G ′ ,ρ , where G' = G ∪(g, v)\ncase x of {pi → DJ[pi /x]Rhei iK\u001f,G,ρ }\nDJRhlet xj = e in ej iK\u001f,G,ρ\nDJRhej iK\u001f,G,ρ\ncase DJaK\u001f,G,ρ of {pi → DJRhei iK\u001f,G,ρ }\nDJeKRhcase \u001f of {pi →ei }i,G,ρ\nRhei\n\n11\n\n(R1)\n(R2)\n(R3)\n(R4)\n(R5)\n(R6)\n(R7)\n(R8)\n\n(R9)\n(R10)\n(R11)\n(R12)\n(R13)\n\n(R14)\n(R15)\n(R16)\n(R17)\n(R18)\n(R19)\n(R20)\n\nFigure 6: Driving algorithm\nstrict(x)\n= {x}\nstrict(n)\n=∅\nstrict(g)\n=∅\n= strict(e)\nstrict(k e)\nstrict(λx.e)\n=∅\nstrict(f e)\n= strict(f ) ∪ strict(e)\nstrict(let x = e in f )\n= strict(e) ∪ (strict(f )\\{x})\nstrict(letrec g = v in f ) = strict(f ) T\nstrict(case e of {pi → ei })= strict(e) ∪ ( (strict(ei )\\fv(pi )))\nstrict(e1 ⊕ e2 )\n= strict(e1 ) ∪ strict(e2 )\nFigure 7: The strict variables of an expression\nThe argumentation is analogous for lambda abstractions: if there is a surrounding\napplication context we perform a beta reduction, otherwise we proceed by driving the\nabstraction itself.\nNotice that the primitive operations ranged over by ⊕ cannot be unfolded and transformed like ordinary functions can. If the arguments of a primitive operation are annoying,\nour transformation will simply leave the primitive operation in place (rule R8).\n\n\f12\n\nP. A. JONSSON\n\nDapp (g)R,G,ρ = h x\nwhere x = σ(fv(e1 ))\nDapp (g)R,G,ρ = Rhgi\nDapp (g)R,G,ρ = [DJf K\u001f,G,ρ /y]DJfg K\u001f,G,ρ\nwhere (fg , f , y) = split(Rhgi, e1 )\nDapp (g)R,G,ρ = [DJf K\u001f,G,ρ /y]DJfg K\u001f,G,ρ\nletrec h = λx.e in h x\ne\nwhere (g, v) ∈ G,\ne = DJRhviK\u001f,G,ρ′ ,\nρ′ = ρ ∪ (h, Rhgi),\nh fresh,\nx = fv(Rhgi),\n(fg , f , y) = split(Rhgi, e1 )\n\nif ∃(h, e1 ) ∈ ρ . σe1 = Rhgi\n\n(1)\n\nif ∃(h, e1 ) ∈ ρ . e1 E Rhgi and Rhgi E e1 (2)\nif ∃(h, e1 ) ∈ ρ . e1 E Rhgi\n(3)\nif ∃e1 ∈ e . e1 E Rhgi\nif h ∈ fn(e)\notherwise\n\n(4a)\n(4b)\n(4c)\n\nFigure 8: Driving of applications\nIf we had a perfect strictness analysis and could decide whether an arbitrary expression\nwill terminate or not, the only difference in results between our transformation and a callby-name counterpart would be for the non-terminating cases. In practice, we have to settle\nfor an approximation, such as the simple analysis defined in Figure 7. One might speculate\nwhether the transformations thus missed will have adverse effects on the usefulness of our\ntransformation in practice. We believe we have seen clear indications that this is not the\ncase, and that the crucial factor is the ability to inline function bodies irrespective of whether\narguments are values or not.\nOur transformation always inlines functions unless the algorithm detects a risk of nontermination. Supero [30, Sec. 3.2] has a more advanced inlining strategy.\n4.1. Application Rule. In the driving algorithm rule R3 refers to Dapp (), defined in Figure 8. Dapp () can be inlined in the definition of the driving algorithm, it is merely given\na separate name to improve the clarity of the presentation. Figure 8 contains some new\nnotation: we use σ for a variable to variable substitution and = for syntactic equivalence\nof expressions.\nCare needs to be taken to ensure that recursive functions are not inlined forever. The\ndriving algorithm keeps track of previously seen function applications in the memoization\nlist ρ, which also associates a unique function name to each such expression. Whenever an\nexpression that is equivalent up to renaming of variables to a previous application, a call\nto the associated function symbol is inserted instead. This is not sufficient to guarantee\ntermination of the algorithm, but the mechanism is crucial for the complexity improvements\nmentioned in Section 2.\nTo ensure termination, we use the homeomorphic embedding relation E to define a\npredicate called \"the whistle\". When the predicate holds for an expression we say that\nthe whistle blows on that expression. The intuition is that when e E f , f contains all\nsubexpressions of e, possibly embedded in other expressions. For any infinite sequence\ne0 , e1 , . . . there must exist an i and a j such that i < j and ei E ej . This condition is\nsufficient to ensure termination.\n\n\fPOSITIVE SUPERCOMPILATION\n\ne\ne\nRight e\nfac y\n\nE\nE\nE\n\nf\nJust e\nRight (e, e ′ )\nfac (y − 1)\n\ntg\nx\nRight x\nfac x\n\nθ1\n[e/x]\n[e/x]\n[y/x]\n\n13\n\nθ2\n[Just e/x]\n[(e, e′ )/x]\n[(y − 1)/x]\n\nFigure 9: Examples of the homeomorphic embedding and the msg\nIn order to define the homeomorphic embedding we need a definition of uniform terms\nanalogous to the one defined by Sørensen and Glück [45]. We slightly adjust their version\nto fit our language.\nDefinition 4.1 (Uniform terms). Let s range over the set G ∪ K ∪ {caseof , let, letrec,\nprimop, lambda, apply}, and let caseof (e), let(e), letrec(v, e), primop(e), lambda(e),\nand apply(e) denote a case, let, recursive let, primitive operation, lambda abstraction or\napplication for all subexpressions e, e and v. The set of terms T is the smallest set of arity\nrespecting symbol applications s(e).\nDefinition 4.2 (Homeomorphic embedding). Define E as the smallest relation on T satisfying:\ne E fi for some i\ne1 E f1 , . . . , en E fn\nxEy\nn1 E n2\ne E s(f1 , . . . , fn )\ns(e1 , . . . , en ) E s(f1 , . . . , fn )\nWhenever the whistle blows, our transformation splits the input expression into strictly\nsmaller terms that are driven separately in the empty context. This might expose new\nfolding opportunities, and allows the algorithm to remove intermediate structures in subexpressions. The design follows the positive supercompilation algorithm outlined by Sørensen\n[44], except that we need to reassemble the transformed subexpressions into a term of the\noriginal form instead of pulling them out as let-definitions, in order to preserve strictness.\nOur transformation is also more complicated because we perform the program extraction\nimmediately, rather than constructing a large tree of terms and extracting the program in\na separate pass.\nSplitting expressions is rather intricate, and two mechanisms are needed; the first is the\nmost specific generalization (msg).\nDefinition 4.3 (Most specific generalization).\n• An instance of a term e is a term of the form θe for some substitution θ.\n• A generalization of two terms e and f is a triple (tg , θ1 , θ2 ), where θ1 , θ2 are substitutions\nsuch that θ1 tg ≡ e and θ2 tg ≡ f .\n• A most specific generalization (msg) of two terms e and f is a generalization (tg , θ1 , θ2 )\nsuch that for every other generalization (t′g , θ1′ , θ2′ ) of e and f it holds that tg is an instance\nof t′g .\nFor background information and an algorithm to compute most specific generalizations,\nsee Lassez et al. [23]. Figure 9 contains examples of the homeomorphic embedding and the\nmsg.\nThe most specific generalization is not always sufficient to split expressions. For expressions differing already in their roots, msg will return just a variable and substitutions\nequal to the input terms on that variable. If this happens we need to split expressions in a\ndifferent way. We therefore define our function split using two alternatives; one that applies\n\n\f14\n\nP. A. JONSSON\n\nwhen there is a non-trivial most specific generalization, and one that just splits along the\nspine of the first term in the other case.\nDefinition 4.4 (Split). For t ∈ T we define split(t1 , t2 ) by:\nsplit(s(e1 ), s′ (e2 )) = (tg , rng(θ1 ), dom(θ1 )) if s = s′\n= (s(x), e1 , x)\notherwise\n′\nwith (tg , θ1 , θ2 ) = msg(s(e1 ), s (e2 )) and x fresh.\nAlternatives 2 and 4a of Dapp () is for upwards generalization, and alternative 3 is\nfor downwards generalization. This is exemplified below. All the examples of how our\ntransformation works in Section 2 eventually terminate through a combination of alternative\n1 and alternative 4b of Dapp ().\nThe second alternative of Dapp () in combination with 4a is useful when transforming\nfunction calls that have the same parameter appearing twice, for example append xs xs as\nshown in Figure 10.\nThe third alternative is used when terms are \"growing\" in some sense. An example\nof reverse with an accumulating parameter is shown in Figure 11, assuming the standard\ndefinition of reverse.\n5. Correctness\nThe problem with using previous deforestation and supercompilation algorithms in a\ncall-by-value context is that they might change the termination properties of programs. In\nthis section we prove that our supercompiler both terminates itself, and preserves program\ntermination behavior for all input.\n5.1. Termination. In order to prove that the algorithm terminates we show that each\nrecursive application of DJK in the right-hand sides of Figure 6 and 8 has a strictly smaller\nweight than the left-hand side.\nThe weight of an expression is one plus the sum of the weight of its subexpressions,\nwhere variables, primitive numbers and function names have weight two. The weight of a\nfresh variable not in the initial input is one.\nDefinition 5.1. The weight of a variable x in the initial input, a primitive number n, and\na function name g is 2. The weight of a fresh variable not in theP\ninitial input is 1. The\nweight of any composite expression (n ≥ 1) is |s(e1 , . . . , en )| = 1 + ni=1 |ei |.\nDefinition 5.2. Let S be a set with a relation ≤. Then (S, ≤) is a quasi-order if ≤ is\nreflexive and transitive.\nDefinition 5.3. Let (S, ≤) be a quasi-order. (S, ≤) is a well-quasi-order if, for every infinite\nsequence s0 , s1 , . . . ∈ S, there exist i < j such that si ≤ sj\nThe following lemma tells us that the set of finite sequences over a well-quasi-ordered\nset is well-quasi-ordered, with one proof by Nash-Williams [32]:\nLemma 5.4 (Higman's lemma). If a set S is well-quasi-ordered, then the set S ∗ of finite\nsequences over S is well-quasi-ordered.\n\n\fPOSITIVE SUPERCOMPILATION\n\n15\n\nDJappend xs xsK (*)\n(By rule 4 of Dapp (), put (h0 , append xs xs) in ρ and transform according\nto the rules of the algorithm)\n=\n\ncase xs of\n[] → xs\n(x ′ : xs ′ ) → DJx ′ K : DJappend xs ′ xsK\n(Focus on DJ append xs ′ xsK and recall that ρ contains append xs xs\nso alternative 2 of Dapp ( ) is triggered and the transformation returns\nappend xs ′ xs. This returns all the way up to the start (*) and the transformation continues there through alternative 4a)\n\n=\n\nDJappend xs xsK\n(Generalize the expression with append xs ′ xs)\n\n=\n\n[DJxsK/x , DJxsK/y] DJappend x yK\n\n=\n\n[xs/x , xs/y] case x of\n[] → y\n(x ′ : xs ′ ) → DJx ′ K : DJappend xs ′ yK\n\n=\n\n[xs/x , xs/y] case x of\n[] → y\n(x ′ : xs ′ ) → x ′ : h0 xs ′ y\n\n= letrec h0 xs ys = case xs of\n[] → ys\n(x ′ : xs ′ ) → x ′ : h0 xs ′ ys\nin h0 xs xs\nFigure 10: Example of upwards generalization\nThe weight of the entire transformation is a triple that contains the maximum length\nof the memoization list ρ denoted by N, the weight of the term being transformed and the\nweight of the current term in focus. That such an N exists follows from Kruskal's Tree\nTheorem [8] and the homeomorphic embedding relation being a well-quasi-order.\nTheorem 5.5 (Kruskal's Tree Theorem). If S is a finite set of function symbols, then any\ninfinite sequence t1 , t2 , . . . of terms from the set S contains two terms ti and tj with i < j\nsuch that ti E tj .\nProof (Similar to Dershowitz [8]). Collapse all integers to a single 0-ary constructor, and\nall variables to a different 0-ary constructor.\nSuppose the theorem were false. Let the infinite sequence t = t1 , t2 , . . . of terms be\na minimal counterexample, measured by the size of the ti . By the minimality hypothesis,\n\n\f16\n\nP. A. JONSSON\n\nDJrev xs []K\n(By rule 4 of Dapp (), put (h0 , rev xs []) in ρ and transform the program\naccording to the rules of the algorithm)\ncase xs of\n[] → []\n(x ′ : xs ′ ) → DJrev xs ′ (x ′ : [])K\n(Focus on the second branch and recall that ρ contains rev xs [] so alternative 3 of Dapp ( ) is triggered and the expression is generalized)\n=\n\nDJrev xs ′ (x ′ : [])K\n(Generalize the expression with rev xs [])\n\n=\n\n[DJ(x ′ : [])K/zs]DJrev xs ′ zsK\n\n=\n\n[(x ′ : [])/zs]DJrev xs ′ zsK\n(Put (h1 , rev xs ′ zs) in ρ and transform according to the rules of the\nalgorithm)\n\n= [(x ′ : [])/zs]letrec h1 xs ys = case xs of\n[] → ys\n(x ′ : xs ′ ) → h1 xs ′ (x ′ : ys)\nin h1 xs ′ (x ′ : [])\n=\n\nletrec h1 xs ys = case xs of\n[] → ys\n(x ′ : xs ′ ) → h1 xs ′ (x ′ : ys)\n′\n′\nin h1 xs (x : [])\n(Putting the two parts together)\ncase xs of\n[] → []\n(x ′ : xs ′ ) → letrec h1 xs ys = case xs of\n[] → ys\n(x ′ : xs ′ ) → h1 xs ′ (x ′ : ys)\n′\n′\nin h1 xs (x : [])\nFigure 11: Example of downwards generalization\n\n\fPOSITIVE SUPERCOMPILATION\n\n17\n\nthe set of proper subterms of the ti must be well-quasi-ordered, or else there would be a\nsmaller counterexample t1 , t2 , . . . , tl−1 , s1 , s2 , . . ., for some l such that s1 is a subterm of t1\nand all s2 , . . . are subterms of one of tl , tl+1 , . . .. (None of t1 , t2 , . . . , tl−1 can embed any of\ns1 , s2 , . . ., since that would mean that ti also is embedded in some tj , i < l ≤ j).\nSince the set S of function symbols is well-quasi-ordered by ≥, there must exist an infinite subsequence r of t, the root (outermost) symbols of which constitute a quasi-ascending\nchain under ≤. (Any infinite sequence of elements of a well-quasi-ordered set must contain\nan infinite chain of quasi-ascending elements). Since the set of proper subterms is wellquasi-ordered, it follows by Lemma 5.4 that the set of finite sequences consisting of the\nimmediate subterms of the elements in r is also well-quasi-ordered. But then there would\nhave to be an embedding in t itself, in which case it would not be a counterexample.\nWe will show that each step of the driving algorithm will reduce the weight of what is\nbeing transformed. The constant N in the weight is the maximum length of the sequence\nof terms that are not related to each other by the homeomorphic embedding.\nCorollary 5.6. Any infinite sequence t1 , t2 , . . . ∈ T ∗ contains two terms ti and tj with i < j\nsuch that ti E tj .\nCorollary 5.7. There is a maximum N such that t1 , t2 , . . . , tN ∈ T ∗ contains no terms ti\nand tj with i < j and ti E tj .\nWe define the weight of driving a term as:\nDefinition 5.8. The weight of a call to the driving algorithm is |DJeKR,G,ρ | = (N −\n|ρ|, |Rhei|, |e|)\nTuples must be ordered for us to tell whether the weight of a term actually decreases\nfrom driving it. We use the standard lexical order between tuples.\nDefinition 5.9. The order between two tuples (n1 , n2 , n3 ) and (m1 , m2 , m3 ) is:\n(n1 , n2 , n3 ) < (m1 , m2 , m3 ) if n1 < m1\n(n1 , n2 , n3 ) < (m1 , m2 , m3 ) if n1 = m1 and n2 < m2\n(n1 , n2 , n3 ) < (m1 , m2 , m3 ) if n1 = m1 , n2 = m2 and n3 < m3\nWe also need to show that the memoization list ρ only contains elements that were in\nthe initial input program:\nLemma 5.10. The second component of the memoization list ρ, can only contain terms\nfrom the set T.\nProof. Integers and fresh variables are equal, up to E, to the already existing integers and\nvariables. Our only concern are the rules that introduce new terms that are not in T. The\nnew function names h are the only new terms introduced by the algorithm. By inspection\nof the rules it is clear that only rule R3 introduces such new terms. Inspection of the RHS\nof Dapp (),G,ρ :\n1: No recursive application in the RHS.\n2: No recursive application in the RHS.\n3: No new terms are created and the memoization list ρ is not extended.\n4a: No new terms are created and the memoization list ρ is not extended.\n4b: The newly created term h x is kept outside of the recursive call of the driving algorithm.\nThe memoization list ρ, is extended with terms from T.\n\n\f18\n\nP. A. JONSSON\n\n4c: No new terms are created, and the memoization list ρ, is extended with terms from T.\nWith these definitions in place, we can formulate a lemma that claims the weight is\ndecreasing in each step of our transformation.\nLemma 5.11. For each rule DJeKR,G,ρ = e1 in Figure 6 and Figure 8 and each recursive\napplication DJe′ KR′ ,G,ρ′ in e1 , |DJe′ KR′ ,G,ρ′ | < |DJeKR,G,ρ |\nLemma 5.12 (Totality). For all expressions Rhei, DJeKR,G,ρ is matched by a unique rule\nin Figure 6.\nTheorem 5.13 (Termination). The driving algorithm DJK terminates for all inputs.\nProof. The weight of the transformation is defined because of Kruskal's Tree Theorem and\nthe fact that the homeomorphic embedding is a well-quasi-order. Lemma 5.10 guarantees\nthat the memoization list ρ only contains terms from the initial input. By Lemma 5.11 the\nweight of the transformation decreases for each step and by Lemma 5.12 we know that each\nrecursive application will match a rule.\nSince < is well-founded over triples of natural numbers the system will eventually\nterminate.\n5.2. Total Correctness. The problem with previous deforestation and supercompilation\nalgorithms in a call-by-value context is that they might change termination properties of\nprograms. We prove that our supercompiler does not change what the program computes,\nnor does it alter whether a program terminates or not.\nSands [39] shows how a transformation can change the semantics in rather subtle ways –\nconsider the function\nf x = x + 42\nIt is clear that f 0 ∼\n= 42 (where ∼\n= is semantic equivalence with respect to the current\ndefinition). Using this equality and replacing 42 in the function body with f 0 yields:\nf x = x + f 0\nThis function will compute something entirely different than the original definition of\nf . We need some tools to ensure that the meaning of the original program is preserved and\nwe therefore introduce the standard notions of operational approximation and equivalence.\nA general context C which is an expression with zero or more holes in the place of some\nsubexpressions is used, and we say that an expression C[e] is closed if there are no free\nvariables in it.\nDefinition 5.14 (Operational Approximation and Equivalence).\n• e operationally approximates e′ , e ⊏ e′ , if for all contexts C such that C[e], C[e′ ] are\ne then so does evaluation of C[e′ ].\nclosed, if evaluation of C[e] terminates\n• e is operationally equivalent to e′ , e ∼\n= e′ , if e ⊏ e′ and e′ ⊏ e\ne\ne\nThe correctness of deforestation in a call-by-name setting has previously been shown\nby Sands [39] using his improvement theory. We use Sands's definitions for improvement\nand strong improvement:\nDefinition 5.15 (Improvement, Strong Improvement).\n\n\fPOSITIVE SUPERCOMPILATION\n\n19\n\n• e is improved by e′ , e D e′ , if for all contexts C such that C[e], C[e′ ] are closed, if\ncomputation of C[e] terminates using n function calls, then computation of C[e′ ] also\nterminates, and uses no more than n function calls.\n• e is strongly improved by e′ , e Ds e′ , iff e D e′ and e ∼\n= e′ .\nNote that improvement, D, is not the same as the homeomorphic embedding, E, defined\npreviously.\nWe use e 7→k v to denote that e evaluates to v using k function calls (and any other\nreduction rule as many times as it needs) and e′ 7→≤k v ′ to denote that e' evaluates to v'\nwith at most k function calls and using any other reduction rule as many times as needed.\nTo state the Improvement Theorem we view a transformation as the introduction of\nsome new functions from a given set of definitions. We let {gi }i∈I be a set of functions\nindexed by some set I, where each function has a fixed arity αi and are given by some\ndefinitions\n{gi = λx1 . . . xαi .ei }i∈I\n′\nand let {ei }i∈I be a set of expressions such that for each i ∈ I, fv(e′i ) ⊆ {x1 . . . xαi }. The\nfollowing results relate to the transformation of the functions gi using the expressions e′i :\nlet {hi }i∈I be a set of new functions given by the definitions\n{hi = [h/g]λx1 . . . xαi .e′i }i∈I\nTheorem 5.16 (Sands Improvement theorem). If g = e and e D C[g] then g D h where\nh = C[h].\nTheorem 5.17 (Cost-equivalence theorem). If ei ED e′i for all i ∈ I, then gi ED hi , i ∈ I.\nWe need a standard partial correctness result [39] associated with unfold-fold transformations\nTheorem 5.18 (Partial Correctness). If ei ∼\n= e′i for all i ∈ I then hi ⊏ gi , i ∈ I.\ne\nwhich we combine with Theorem 5.16 to get total correctness for a transformation:\nCorollary 5.19. If we have ei Ds e′i for all i ∈ I, then gi Ds hi , i ∈ I.\nImprovement theory in a call-by-value setting requires Sands operational metatheory\nfor functional languages [41], where the improvement theory is a simple corollary over the\nwell-founded resource structure hN, 0, +, ≥i. For simplicity of presentation we instantiate\nSands's theorems to our language. We use ≡ to denote expressions equal up to renaming\nof bound variables and borrow a set of improvement laws that will be useful for our proof:\nLemma 5.20 (Sands [40]). Improvement laws\n(1) If e D e′ then C[e] D C[e′ ].\n(2) If e ≡ e′ then e D e′ .\n(3) If e D e′ and e′ D e′′ then e D e′′\n(4) If e 7→ e′ then e D e′ .\n(5) If e D e′ then e ⊏ e′ .\ne\nIt is sometimes convenient to show that two expressions are related by showing that\nwhat they evaluate to is related.\nLemma 5.21 (Sands [39]). If e1 7→r e′1 and e2 7→r e′2 then (e′1 ED e′2 ⇔ e1 ED e2 ).\n\n\f20\n\nP. A. JONSSON\n\nWe need to show strong improvement in order to prove total correctness. Since strong\nimprovement is improvement in one direction and operational approximation in the other\ndirection, a set of approximation laws that correspond to the improvement laws in Lemma\n5.20 is necessary.\nLemma 5.22. Approximation laws\n(1) If e ⊐ e′ then C[e] ⊐ C[e′ ].\n(2) If e e\n≡ e′ then e ⊐ ee′ .\n(3) If e ⊐ e′ and e′ ⊐ee′′ then e ⊐ e′′\ne\n(4) If e e\n7→ e′ then ee⊐ e′ .\ne\nCombining Lemma 5.20 and Lemma 5.22 gives us the final tools we need to prove strong\nimprovement:\nLemma 5.23. Strong Improvement laws\n(1) If e Ds e′ then C[e] Ds C[e′ ].\n(2) If e ≡ e′ then e Ds e′ .\n(3) If e Ds e′ and e′ Ds e′′ then e Ds e′′\n(4) If e 7→ e′ then e Ds e′ .\nIf two expressions are improvements of each other, they are considered cost equivalent.\nCost equivalence also implies strong improvement, which will be useful in many parts of\nour proof of total correctness for our supercompiler.\nDefinition 5.24 (Cost equivalence). The expressions e and e′ are cost equivalent, e ED e′\niff e D e′ and e′ D e\nA local form of the improvement theorem which deals with local expression-level recursion expressed with a fixed-point combinator or with a letrec definition is necessary. This\nis analogous to the work by Sands [39], with slight modifications for call-by-value.\nWe need to relate local recursion expressed using fix and the recursive definitions which\nthe improvement theorem is defined for. This is solved by a technical lemma that relates\nthe cost of terms on a certain form to their recursive counterparts.\nTheorem 5.25. For all expressions e, if λg.e is closed, then f ix (λg.e) ED h, where h is\na new function defined by h = [λn.h n/g]e.\nProof (Similar to Sands [39]). Define a helper function h− = [λn.f ix (λg.e) n/g]e. Since\nf ix (λg.e) 7→1 (λf.f (λn.f ix f n)) (λg.e) 7→ (λg.e) (λn.f ix (λg.e) n) 7→ [λn.f ix (λg.e) n/g]e\nand h− 7→1 [λn.f ix (λg.e) n/g]e it follows by Lemma 5.21 that f ix (λg.e) ED h− . Since cost\nequivalence is a congruence relation we have that [λn.h− n/g]e ED [λn.f ix (λg.e) n/g]e,\nand so by Theorem 5.17, we have a cost-equivalent transformation from h− to h, where\nh = [h/h− ][λn.h− n/g]e = [λn.h n/g]e.\nWe state some simple properties that will be useful for proving our local improvement\ntheorem\nTheorem 5.26. Consequences of the letrec definition\ni): letrec h = λx.e in e′ ED [λn.f ix (λh.λx.e) n/h]e′\nii): letrec h = λx.e in h ED λn.f ix (λh.λx.e) n\niii): letrec h = λx.e in e′ ED [letrec h = λx.e in h/h]e′\n\n\fPOSITIVE SUPERCOMPILATION\n\n21\n\nProof. For i), expand the definition of letrec in the LHS, (λh.e′ ) (λn.f ix (λh.λx.e) n) and\nevaluate it one step to [λn.f ix (λh.λx.e) n/h]e′ . This is syntactically equivalent to the RHS,\nhence cost equivalent. For ii), set e′ = h and perform the substitution from i). For iii), use\nthe RHS of ii) in the substitution and notice it is equivalent to i).\nThis allows us to state the local version of the improvement theorem:\nTheorem 5.27 (Local improvement theorem). If variables h and x include all the free\nvariables of both e0 and e1 , then if\nletrec h = λx.e0 in e0 Ds letrec h = λx.e0 in e1\nthen for all expressions e\nletrec h = λx.e0 in e Ds letrec h = λx.e1 in e\nProof. Define a new function g = [λn.g n/h]λx.e0 . By Proposition 5.25 g ED f ix (λh.λx.e0 ).\nUse this, the congruence properties, and the properties listed in Proposition 5.26 to transform the premise of the theorem:\nletrec h = λx.e0 in e0 Ds letrec h = λx.e0 in e1\n[λn.f ix (λh.λx.e0 ) n/h]e0 Ds [λn.f ix (λh.λx.e0 ) n/h]e1\nλx.[λn.f ix (λh.λx.e0 ) n/h]e0 Ds λx.[λn.f ix (λh.λx.e0 ) n/h]e1\n[λn.f ix (λh.λx.e0 ) n/h]λx.e0 Ds [λn.f ix (λh.λx.e0 ) n/h]λx.e1\n[λn.g n/h]λx.e0 Ds [λn.g n/h]λx.e1\nSo by Corollary 5.19, g Ds g′ where g′ = [g′ /g][λn.g n/h]λx.e1 = [λn.g n/h]λx.e1 . Hence\nby Proposition 5.25, g′ ED f ix (λh.λx.e1 ). Adding it all together yields f ix (λh.λx.e0 ) ED\ng Ds g′ ED f ix (λh.λx.e1 ). From the transitivity and congruence properties of improvement\nwe can deduce that λn.f ix (λh.λx.e0 ) Ds λn.f ix (λh.λx.e1 ). By Proposition 5.26 we get\nletrec h = λx.e0 in h Ds letrec h = λx.e1 in h, which can be further expanded by congruency\nproperties of improvement to [letrec h = λx.e0 in h/h]e Ds [letrec h = λx.e1 in h/h]e. Using\nProposition 5.26 one more time yields letrec h = λx.e0 in e Ds letrec h = λx.e1 in e, which\nproves our theorem.\nThis allows us to state the total correctness theorem for our transformation:\nTheorem 5.28 (Total Correctness). Let Rhei be an expression, G a recursive map, and ρ\nan environment such that\n• the range of ρ contains only closed expressions, and\n• fv(Rhei) ∩ dom(ρ) = ∅, and\nthen Rhei Ds ρ(DJeKR,G,ρ ).\nThe proof is in Appendix A.1 to Appendix A.20.\n\n\f22\n\nP. A. JONSSON\n\n6. Benchmarks\nIn this section we provide measurements on a set of common examples from the literature on deforestation and perform a detailed analysis for each example. We show that our\npositive supercompiler removes intermediate structures and can improve the performance\nby an order of magnitude for certain benchmarks. The supercompiler was implemented as a\npass in the Timber compiler [34]. Timber is a pure functional call-by-value language which\nis very close to the language we describe in Section 3, and for the scope of this article it\ncan be thought of as a strict variant of Haskell. We have left out the full details of the\ninstrumentation of the run-time system but it is available in a separate report [19].\nAll measurements were performed on an idle machine running in an xterm terminal\nenvironment. Each test was run 10 consecutive times and the best result was selected\nbecause the programs are deterministic and the best result must appear under the minimum\nof other activity. The number of allocations and the total allocation sizes remained constant\nover all runs.\nRaw data for the time and size measurements before and after supercompilation are\nshown in Table 1, and allocation measures in Table 2. Compilation times are shown in Table\n3. The time column is the number of clock ticks obtained from the RDTSC instruction\navailable on Intel/AMD processors, and the binary size is in bytes. The total number of\nallocations and the total memory size in bytes allocated by the program are displayed in\ntheir respective column. The compilation times are measured in seconds and times from\nleft to right are for producing an object file, producing an executable binary, and the\ncorresponding operations with supercompilation turned on.\nBinary sizes are slightly increased by the supercompiler, but all run-times are faster.\nThe main reason for the performance improvement is the removal of intermediate structures,\nreducing the number of memory allocations. Compilation times are increased by 10-15%\nwhen enabling the supercompiler.\nThe supercompiled results on these particular benchmarks are identical to the results\nreported in previous work for call-by-name languages by Wadler [57] and Sørensen et al.\n[47]. We do not provide any execution-time comparisons with these, though, since for\nidentical intermediate representations after supercompilation, such measurements would\nonly illustrate differences caused by back-end implementation techniques.\nThe work on Supero by Mitchell and Runciman [30] shows that there remain open\nproblems when supercompiling large Haskell programs. These problems are mainly related\nto speed, both of the compiler and of the transformed program. When profiling Supero,\nMitchell and Runciman found that a majority of the time was spent on their homeomorphic\nembedding test. Our transformation performs the corresponding test on a smaller part of\nthe abstract syntax tree, so there is reason to believe that this will result in less time spent\non testing homeomorphic embedding even on large programs for our transformation. The\ncomplexity of the homeomorphic embedding relation has been investigated by Narendran\nand Stillman [31], and they give an algorithm of complexity O(size(e)×size(f )) for deciding\nwhether e E f . We expect essentially the same problems that Mitchell and Runciman\nobserved to appear in a call-by-value context as well, and intend to investigate them now\nthat we have a theoretical foundation for our transformation.\n\n\fPOSITIVE SUPERCOMPILATION\n\n23\n\nTime\nBenchmark\nBefore\nDouble Append\n105,844,704\nFactorial\n21,552\nFlip a Tree\n2,131,188\nSum of Squares of a Tree 276,102,012\nKort's Raytracer\n12,050,880\n\nBinary size\nBefore\nAfter\n89,484\n90,800\n88,968\n88,968\n95,452\n104,704\n95,452\n104,912\n91,968\n91,460\n\nAfter\n89,820,912\n21,024\n237,168\n28,737,648\n7,969,224\n\nTable 1: Time and size measurements\nAllocations\nBenchmark\nBefore\nAfter\nDouble Append\n270,035\n180,032\nFactorial\n9\n9\nFlip a Tree\n20,504\n57\nSum of Squares of a Tree 4,194,338\n91\nKort's Raytracer\n60,021\n17\n\nAlloc Size\nBefore\nAfter\n2,160,280\n1,440,256\n68\n68\n180,480\n620\n29,360,496\n908\n320,144\n124\n\nTable 2: Allocation measurements\nNot Supercompiled\nBenchmark\n-c\n–make\nDouble Append\n0.183\n0.300\nFactorial\n0.095\n0.213\nFlip a Tree\n0.211\n0.223\nSum of Squares of a Tree 0.214\n0.332\nKort's Raytracer\n0.239\n0.359\n\nSupercompiled\n-c -S –make -S\n0.202\n0.319\n0.097\n0.216\n0.230\n0.347\n0.234\n0.349\n0.278\n0.399\n\nTable 3: Compilation times\n6.1. Double Append. As previously seen, supercompiling the appending of three lists\nsaves one traversal over the first list. This is an example by Wadler [57], and the intermediate\nstructure is fused away by our supercompiler. The program is:\nappend xs ys = case xs of\n[] → ys\n(x ′ : xs ′ ) → x ′ : (append xs ′ ys)\nmain xs ys zs = append (append xs ys) zs\nSupercompiling this program gives the same result that we obtained manually in Section 2:\nh1 xs1 ys1 zs1 = case xs1 of\n[] → case ys1 of\n[] → zs1\n(y1′ : ys1′ ) → y1′ : (h2 ys1′ zs1 )\n′\n′\n(x1 : xs1 ) → x1′ : (h1 xs1′ ys1 zs1 )\nh2 xs2 ys2\n= case xs2 of\n[] → ys2\n(x2′ : xs2′ ) → x2′ : (h2 xs2′ ys2 )\nmain xs ys zs =h1 xs ys zs\n\n\f24\n\nP. A. JONSSON\n\nIn this measurement, three strings of 9000 characters each were appended to each other\ninto a 27 000 character string. As can be seen in Table 2, the number of allocations goes\ndown as one iteration over the first string is avoided. The binary size increases 1316 bytes,\non a binary of roughly 90k.\n6.2. Factorial. There are no intermediate lists created in a standard implementation of\na factorial function, so any performance improvements must come from inlining or static\nreductions.\nfac 0 =1\nfac n =n ∗ fac (n − 1)\nmain =show (fac 3)\nThe program is transformed to:\nh0\nhn\n\n=1\n=n ∗ h (n − 1)\n\nmain =show (3 ∗ h 2)\nOne recursion and a couple of reductions are eliminated, thereby slightly reducing the\nrun-time. The allocations remain the same and the final binary size remains unchanged.\n6.3. Flip a Tree. Flipping a tree is another example by Wadler [57], and just like Wadler\nwe perform a double flip (thus restoring the original tree) before printing the total sum of\nall leaves.\ndata Tree a = Leaf a | Branch (Tree a) (Tree a)\nsumtr (Leaf a) = a\nsumtr (Branch l r ) = sumtr l + sumtr r\nflip (Leaf x ) = Leaf x\nflip (Branch l r ) = Branch (flip r ) (flip l)\nmain xs = let ys = (flip (flip xs)) in show (sumtr ys)\nThis is transformed into:\nh t = case t of\nLeaf d → d\nBranch l r → (h l) + (h r )\nmain xs = show ( case xs of\nLeaf d → d\nBranch l r → (h l) + (h r ) )\nA binary tree of depth 12 was used in the measurement. The function h is isomorphic\nto sumtr in the input program, and the double flip has been eliminated. Both the total\nnumber of allocations and the total size of allocations is reduced. The run-time is reduced\nby an order of magnitude. The binary size increases by about 10%, though.\n\n\fPOSITIVE SUPERCOMPILATION\n\n25\n\n6.4. Sum of Squares of a Tree. Computing the sum of the squares of the data members\nof a tree is the final example by Wadler [57].\ndata Tree a = Leaf a | Branch (Tree a) (Tree a)\nsquare :: Int → Int\nsquare x = x ∗ x\nsumtr (Leaf x ) = x\nsumtr (Branch l r ) = sumtr l + sumtr r\nsquaretr (Leaf x ) = Leaf (square x )\nsquaretr (Branch l r ) = Branch (squaretr l) (squaretr r )\nmain xs = show (sumtr (squaretr xs))\nThis is transformed to:\nh t = case t of\nLeaf d → d ∗ d\nBranch l r → (h l) + (h r )\nmain xs = show ( case xs of\nLeaf d → d ∗ d\nBranch l r → (h l) + (h r )\nAlmost all allocations are removed by our supercompiler, but the binary size is increased\nby nearly 10%. The run-time is improved by an order of magnitude.\n6.5. Kort's Raytracer. The inner loop of a raytracer [22] written in Haskell is extracted\nand transformed.\nzipWith f (x : xs) (y : ys) = (f x y) : zipWith f xs ys\n= []\nzipWith\nsum :: [Int] → Int\nsum [] = 0\nsum (x : xs) = x + sum xs\nmain xs ys = sum (zipWith (∗) xs ys)\nThe transformed result is:\nh xs ys = case xs of\n(x ′ : xs ′ ) → case ys of\n(y ′ : ys ′ ) → (x ′ ∗ y ′ ) + (h xs ′ ys ′ )\n→ 0\n→ 0\nmain xs ys = h xs ys\nThe total run-time, the number of allocations, the total size of allocations and the\nbinary size all decrease.\n\n\f26\n\nP. A. JONSSON\n\n7. Related Work\nThere is much literature concerning algorithms that remove intermediate structures\nin functional programs. However, most of these works are in the the context of call-byname or call-by-need languages, which makes the task of supercompilation a different, yet\ndifficult, problem. We therefore start our survey of related work with one call-by-value\ntransformation and then look at the related transformations from a call-by-name or callby-need perspective.\n7.1. Lightweight Fusion. Ohori's and Sasano's Lightweight Fusion [35] works by promoting functions through the fix-point operator and guarantees termination by limiting\ninlining to at most once per function. They implement their transformation in a compiler\nfor a variant of Standard ML and present some benchmarks. The algorithm is proven correct for a call-by-name language. It is explicitly mentioned that their goal is to extend the\ntransformation to work for an impure call-by-value functional language.\nComparing lightweight fusion to our positive supercompiler is somewhat difficult, the\nalgorithms themselves are not very similar. Comparing results of the algorithms is more\nstraightforward – the restriction to only inline functions once makes lightweight fusion unable to handle successive applications of the same function or mutually recursive functions,\nsomething the positive supercompiler handles gracefully.\nDespite the early stage of their work, Ohori and Sasano are proposing an interesting\napproach that appears quite powerful.\n7.2. Deforestation. Deforestation was pioneered by Wadler [57] for a first order language\nmore than fifteen years ago. The function macros supported by the initial deforestation\nalgorithm were not capable of fully emulating higher-order functions.\nMarlow and Wadler [27] addressed the first-order restriction in a subsequent article [27].\nThis work was refined in Marlow's [1995] dissertation, where he also related deforestation to\nthe cut-elimination principle of logic. Chin [5] has also generalised Wadler's deforestation\nto higher-order functional programs by using syntactic properties to decide which terms\nthat can be fused.\nBoth Hamilton [14] and Marlow [28] have proven that their deforestation algorithms\nterminate. More recent work by Hamilton [15] extends deforestation with a treeless form\nthat is easy to recognise and handles a wide range of functions, giving more transparency\nfor the programmer.\nAlimarine and Smetsers [2] have improved the producer and consumer analyses in Chin's\n[1994] algorithm to be based on semantics rather than syntax. They show that their algorithm can remove much of the overhead introduced by generic programming [16].\nWhile these works are algorithmically rather close to ours due to the close relationship\nbetween deforestation and positive supercompilation, it supposes either a call-by-name or\ncall-by-need context, and is thus not applicable to the kind of languages we target.\n7.3. Supercompilation. Closely related to deforestation is supercompilation [52, 53, 54,\n55]. Supercompilation both removes intermediate structures and achieves partial evaluation,\nas well as some other optimisations. In partial evaluation terminology, the decision of when\nto inline is taken online. The initial studies on supercompilation were for the functional\n\n\fPOSITIVE SUPERCOMPILATION\n\n27\n\nlanguage Refal [56]. The supercompiler Scp4 [33] is implemented in Refal and is the most\nwell-known implementation from this line of work.\nThe positive supercompiler [47] is a variant which only propagates positive information\nsuch as inferred equalities between terms. The propagation is done by unification and\nthe work highlights how similar deforestation and positive supercompilation really are.\nNarrowing-driven partial evaluation [3, 1] is the functional logic programming equivalent of\npositive supercompilation but formulated as a term rewriting system. Their approach also\ndeals with non-determinism from backtracking, which makes the corresponding algorithms\nmore complicated.\nStrengthening the information propagation mechanism to propagate not only positive,\nbut also negative information, yields perfect supercompilation [42, 43]. Negative information\nis the opposite of positive information, namely inequalities. These inequalities can be used\nto prune case-expression branches known not to be applicable, for example.\nMore recently, Mitchell and Runciman [30] have worked on supercompiling Haskell.\nThey report run-time reductions of up to 55% when their supercompiler is used in conjunction with GHC.\nSupercompilation has seen applications beyond program optimization: verification of\ncache coherence protocols [26] and proving term equivalence [21] are two examples. We\ndo not believe that our supercompiler is useful for these applications since it is inherently\nweaker than the corresponding supercompiler with call-by-name semantics.\nThe positive supercompiler by Sørensen et al. [47] is the immediate ancestor of our\nwork, although we have extended it to a higher-order language and converted it to work\ncorrectly for call-by-value languages.\n7.4. Generalized Partial Computation. GPC [9, 50] uses a theorem prover to extract\nadditional properties about the program being specialized. Among these properties are the\nlogical structure of a program, axioms for abstract data types, and algebraic properties of\nprimitive functions.\nThe theorem prover is applied whenever a test is encountered, in order to determine\nwhich subset of the execution branches can actually be taken. Information about the\npredicate that was tested is propagated along the branches that are left in the resulting\nprogram. The reason GPC is such a powerful transformation is because it assumes the\nunlimited power of a theorem prover.\nFutamura et al. [10] have applied GPC in a call-by-value setting in a system called WSDFU (Waseda Simplify-Distribute-Fold-Unfold), and report many successful experiments\nwhere optimal or near optimal residual programs are produced. It is unclear whether WSDFU preserves termination behavior or if it is a call-by-name transformation applied to a\ncall-by-value language.\nWe note that the rules for the first order language presented by Takano [50] are very\nsimilar to the positive supercompiler, but the requirement for a theorem prover might\nexclude the technique as a candidate for automatic compiler optimisations. The lack of\ntermination guarantees for the transformation might be another obstacle. Considering the\nsimilarities between GPC and positive supercompilation it should be straightforward to\nconvert GPC to a call-by-value setting.\n\n\f28\n\nP. A. JONSSON\n\n7.5. Other Transformations. Considering the vast amount of research conducted on program transformations in general, we only briefly survey other related transformations.\n7.5.1. Partial Evaluation. Partial evaluation [18] is another instance of Burstall and Darlington's [1977] informal class of fold/unfold transformations.\nIf partial evaluation is performed offline, the process is guided by program annotations\nthat tell when to fold, unfold, instantiate and define functions. Binding-Time Analysis\n(BTA) is a program analysis that annotates operations in the input program based on\nwhether they are statically known or not.\nPartial evaluation does not remove intermediate structures, something we deem necessary to enable the programmer to write programs in the clear and concise listful style. Both\ndeforestation and supercompilation simulate call-by-name evaluation in the transformer,\nwhereas partial evaluation simulates call-by-value. It is suggested by Sørensen et al. [46]\nthat this might affect the strength of the transformation.\n7.5.2. Short Cut Fusion. Short cut deforestation [12, 13] takes a different approach to deforestation, sacrificing some generality by only working on lists.\nThe idea is that the constructors Nil and Cons can be replaced by a foldr consumer,\nand a special function build is used to enable the transformation to recognize the producer\nand enforce a type requirement. Lists using build/foldr can easily be removed with the\nfoldr/build rule:\nfoldr f c (build g) = g f c\nIt is the responsibility of the programmer or compiler writer to make sure list-traversing\nfunctions are written using build and foldr, thereby cluttering the code with information for\nthe optimiser and making it harder to read and understand for humans.\nGill implemented and measured short cut deforestation in GHC using the nofib benchmark suite [37]. Around a dozen benchmarks improved by more than 5%, the average was\n3% and only one example got noticeably worse, by 1%. Heap allocations were reduced, by\nhalf in one particular case.\nThe main argument for short cut deforestation is its simplicity on the compiler side\ncompared to full-blown deforestation. GHC currently contains a variant of the short cut\ndeforestation implemented using rewrite rules [38].\nTakano and Meijer [51] generalized short cut deforestation to work for any algebraic\ndatatype through the acid rain theorem. Ghani and Johann [11] have also generalized\nthe foldr/build rule to a fold/superbuild rule that can eliminate intermediate structures of\ninductive types without disturbing the contexts in which they are situated.\nLaunchbury and Sheard [24] worked on automatically transforming programs into suitable form for shortcut deforestation. Onoue et al. [36] showed an implementation of the\nacid rain theorem for Gofer where they could automatically transform recursive functions\ninto a form suitable for shortcut fusion.\nChitil [6] used type-inference to transform the producer of lists into the abstracted form\nrequired by short cut deforestation. Given a type-inference algorithm which infers the most\ngeneral type, Chitil is able to determine the list constructors that need to be replaced in\none pass.\nFrom the principal type property of the type inference algorithm Chitil was also able to\ndeduce completeness of the list abstraction algorithm. This completeness guarantees that\n\n\fPOSITIVE SUPERCOMPILATION\n\n29\n\nif a list can be abstracted from a producer by abstracting its list constructors, then the list\nabstraction algorithm will do so.\nThe implications of the completeness of the list abstraction algorithm is that a foldr\nconsumer can be fused with nearly any producer. One reason list constructors might not\nbe abstractable from a producer is that they do not occur in the producer expression but\nin the definition of a function which is called by the producer. A worker/wrapper scheme\nproposed by Chitil ensures that these list constructors are moved to the producer in order\nto make list abstraction possible.\nThe completeness property and the fact that the programmer does not have to write\nany special code, in combination with the promising results from measurements, suggest\nthat short cut deforestation based on type-inference is a practical optimisation.\nTakano and Meijer [51] noted that the foldr/build rule for short cut deforestation has\na dual. This is the destroy/unfoldr rule used in Zip Fusion [48], which has some interesting\nproperties: it can remove all argument lists from a function which consumes more than one\nlist. The method described by Svenningsson removes all intermediate lists in zip [1..n] [1..n],\naddressing one of the main criticisms against the foldr/build rule. The technique can also\nremove intermediate lists from functions which consume their lists using accumulating parameters, which is usually a problematic case. The destroy/unfoldr rule is defined as:\ndestroy g (unfoldr psi e) = g psi e\nThe Zip Fusion method is simple, and can be implemented in the same way as short\ncut deforestation. It still suffers from the drawback that the programmer or compiler writer\nhas to make sure the list traversing functions are written using destroy and unfoldr.\nIn more recent work Coutts et al. [7] have extended these techniques to work on functions that handle nested lists, list comprehensions and filter-like functions.\n8. Conclusions\nWe have presented a positive supercompiler for a higher-order call-by-value language\nand proven it correct with respect to call-by-value semantics. The adjustments required to\npreserve the termination properties of call-by-value evaluation are new and work well for\nmany examples in the literature intended to show the usefulness of call-by-name transformations.\n8.1. Future Work. We believe that the linearity restriction of rule R14 is not necessary\nfor the soundness of our transformation, but have not yet found a way to prove this. This is\na natural topic for future work, as is an investigation of whether the concept of an inlining\nbudget may be used to control the balance between supercompilation benefits and code size.\nMore work could be done on the strictness analysis component of our supercompiler.\nWe do not intend to focus on that subject, though; instead we hope that the modular\ndependency on strictness analysis will allow our supercompiler to readily take advantage of\ngeneral improvements in the area.\nThe supercompiler described in this article can be said to supersede several of the\nstandard transformations commonly implemented by optimizing compilers, such as copy\npropagation, constant folding and basic inlining. We conjecture that this range could be\nextended to include transformations like common subexpression elimination as well, by\n\n\f30\n\nP. A. JONSSON\n\nmeans of moderately small algorithm changes. An investigation of the scope for such generalizations is an important area of future research.\nAcknowledgements\nThe authors would like to thank Simon Marlow, Duncan Coutts and Neil Mitchell for\nvaluable discussions. Thorsten Altenkirch contributed insights about non-termination. We\nwould also like to thank Viktor Leijon and the anonymous referees for POPL'09 for providing\nuseful comments that helped improve the presentation and contents, and Germán Vidal for\nexplaining narrowing-driven partial evaluation to us.\nReferences\n[1] E. Albert and G. Vidal. The narrowing-driven approach to functional logic program\nspecialization. New Generation Comput, 20(1):3–26, 2001.\n[2] A. Alimarine and S. Smetsers. Improved fusion for optimizing generics. In Manuel V.\nHermenegildo and Daniel Cabeza, editors, Practical Aspects of Declarative Languages,\n7th International Symposium, PADL 2005, Long Beach, CA, USA, January 10-11,\n2005, Proceedings, volume 3350 of Lecture Notes in Computer Science, pages 203–218.\nSpringer, 2005. ISBN 3-540-24362-3.\n[3] M. Alpuente, M. Falaschi, and G. Vidal. Partial Evaluation of Functional Logic Programs. ACM Transactions on Programming Languages and Systems, 20(4):768–844,\n1998.\n[4] R.M. Burstall and J. Darlington. A transformation system for developing recursive\nprograms. Journal of the ACM, 24(1):44–67, January 1977.\n[5] W-N. Chin. Safe fusion of functional expressions II: Further improvements. J. Funct.\nProgram, 4(4):515–555, 1994.\n[6] O. Chitil. Type-Inference Based Deforestation of Functional Programs. PhD thesis,\nRWTH Aachen, October 2000.\n[7] D. Coutts, R. Leshchinskiy, and D. Stewart. Stream fusion: from lists to streams to\nnothing at all. In ICFP '07: Proceedings of the 12th ACM SIGPLAN international\nconference on Functional programming, pages 315–326, New York, NY, USA, 2007.\nACM. ISBN 978-1-59593-815-2.\n[8] N. Dershowitz. Termination of rewriting. Journal of Symbolic Computation, 3(1):\n69–115, 1987.\n[9] Y. Futamura and K. Nogi. Generalized partial computation. In D. Bjørner, A.P.\nErshov, and N.D. Jones, editors, Partial Evaluation and Mixed Computation, pages\n133–151. Amsterdam: North-Holland, 1988.\n[10] Y. Futamura, Z. Konishi, and R. Glück. Program transformation system based on\ngeneralized partial computation. New Gen. Comput., 20(1):75–99, 2002. ISSN 02883635.\n[11] N. Ghani and P. Johann. Short cut fusion of recursive programs with computational\neffects. In P. Achten, P. Koopman, and M. T. Morazán, editors, Draft Proceedings of\nThe Ninth Symposium on Trends in Functional Programming (TFP), number ICIS–\nR08007, 2008.\n\n\fPOSITIVE SUPERCOMPILATION\n\n31\n\n[12] A. Gill, J. Launchbury, and S.L. Peyton Jones. A short cut to deforestation. In Functional Programming Languages and Computer Architecture, Copenhagen, Denmark,\n1993, 1993.\n[13] A. J. Gill. Cheap Deforestation for Non-strict Functional Languages. PhD thesis, Univ.\nof Glasgow, January 1996.\n[14] G. W. Hamilton. Higher order deforestation. In PLILP '96: Proceedings of the 8th\nInternational Symposium on Programming Languages: Implementations, Logics, and\nPrograms, pages 213–227, London, UK, 1996. Springer-Verlag. ISBN 3-540-61756-6.\n[15] G. W. Hamilton. Higher order deforestation. Fundam. Informaticae, 69(1-2):39–61,\n2006.\n[16] R. Hinze. Generic Programs and Proofs. Habilitationsschrift, Bonn University, 2000.\n[17] T. Johnsson. Lambda lifting: Transforming programs to recursive equations. In FPCA,\npages 190–203, 1985.\n[18] N.D. Jones, C.K. Gomard, and P. Sestoft. Partial Evaluation and Automatic Program\nGeneration. Englewood Cliffs, NJ: Prentice Hall, 1993. ISBN 0-13-020249-5.\n[19] P. A. Jonsson. Positive supercompilation for a higher-order call-by-value language.\nLicentiate thesis, Luleå University of Technology, Sweden, Jun 2008.\n[20] P. A. Jonsson and J. Nordlander. Positive supercompilation for a higher-order call-byvalue language. In POPL '09: Proceedings of the 36th annual ACM SIGPLAN-SIGACT\nsymposium on Principles of programming languages, 2009.\n[21] I. Klyuchnikov and S. Romanenko. Proving the equivalence of higher-order terms by\nmeans of supercompilation. In PSI '09: Proceedings of the Seventh International Andrei\nErshov Memorial Conference, 2009.\n[22] J. Kort. Deforestation of a raytracer. Master's thesis, University of Amsterdam, 1996.\n[23] J-L. Lassez, M. Maher, and K. Marriott. Unification revisited. In Jack Minker, editor,\nFoundations of Deductive Databases and Logic Programming, pages 587–625. Morgan\nKaufmann, 1988.\n[24] J. Launchbury and T. Sheard. Warm fusion: Deriving build-cata's from recursive\ndefinitions. In FPCA, pages 314–323, 1995.\n[25] X. Leroy.\nThe Objective Caml system: Documentation and user's manual,\n2008. With D. Doligez, J. Garrigue, D. Rémy, and J. Vouillon. Available from\nhttp://caml.inria.fr (1996–2008).\n[26] A. Lisitsa and A. P. Nemytykh. Verification as a parameterized testing (experiments\nwith the SCP4 supercompiler). Programming and Computer Software, 33(1):14–23,\n2007.\n[27] S. Marlow and P. Wadler. Deforestation for higher-order functions. In John Launchbury\nand Patrick M. Sansom, editors, Functional Programming, Workshops in Computing,\npages 154–165. Springer, 1992. ISBN 3-540-19820-2.\n[28] S. D. Marlow. Deforestation for Higher-Order Functional Programs. PhD thesis, Department of Computing Science, University of Glasgow, April 27 1995.\n[29] R. Milner, M. Tofte, R. Harper, and D. MacQueen. The Definition of Standard ML,\nRevised edition. MIT Press, 1997.\n[30] N. Mitchell and C. Runciman. A supercompiler for core Haskell. In O. Chitil et al.,\neditor, Selected Papers from the Proceedings of IFL 2007, volume 5083 of Lecture Notes\nin Computer Science, pages 147–164. Springer-Verlag, 2008.\n[31] P. Narendran and J. Stillman. On the Complexity of Homeomorphic Embeddings.\nTechnical Report 87-8, Computer Science Department, State Univeristy of New York\n\n\f32\n\nP. A. JONSSON\n\nat Albany, March 1987.\n[32] C. St. J. A. Nash-Williams. On well-quasi-ordering finite trees. Proceedings of the\nCambridge Philosophical Society, 59(4):833–835, October 1963.\n[33] A. P. Nemytykh. The supercompiler SCP4: General structure. In Manfred Broy and\nAlexandre V. Zamulin, editors, Perspectives of Systems Informatics, 5th International\nAndrei Ershov Memorial Conference, PSI 2003, Akademgorodok, Novosibirsk, Russia,\nJuly 9-12, 2003, Revised Papers, volume 2890 of LNCS, pages 162–170. Springer, 2003.\nISBN 3-540-20813-5.\n[34] J. Nordlander, M. Carlsson, A. Gill, P. Lindgren, and B. von Sydow. The Timber home\npage, 2008. URL http://www.timber-lang.org.\n[35] A. Ohori and I. Sasano. Lightweight fusion by fixed point promotion. In POPL '07:\nProceedings of the 34th annual ACM SIGPLAN-SIGACT symposium on Principles\nof programming languages, pages 143–154, New York, NY, USA, 2007. ACM. ISBN\n1-59593-575-4.\n[36] Y. Onoue, Z. Hu, H. Iwasaki, and M. Takeichi. A calculational fusion system HYLO.\nIn R. S. Bird and L. G. L. T. Meertens, editors, Algorithmic Languages and Calculi,\nIFIP TC2 WG2.1 International Workshop on Algorithmic Languages and Calculi, 1722 February 1997, Alsace, France, volume 95 of IFIP Conference Proceedings, pages\n76–106. Chapman & Hall, 1997. ISBN 0-412-82050-1.\n[37] W. Partain. The nofib benchmark suite of Haskell programs. In John Launchbury and\nPatrick M. Sansom, editors, Functional Programming, Workshops in Computing, pages\n195–202. Springer, 1992. ISBN 3-540-19820-2.\n[38] S. L. Peyton Jones, A. Tolmach, and T. Hoare. Playing by the rules: Rewriting as\na practical optimisation technique in GHC. In Ralf Hinze, editor, Proceedings of the\n2001 ACM SIGPLAN Haskell Workshop (HW'2001), 2nd September 2001, Firenze,\nItaly., Electronic Notes in Theoretical Computer Science, Vol 59. Utrecht University,\nSeptember 28 2001. UU-CS-2001-23.\n[39] D. Sands. Proving the correctness of recursion-based automatic program transformations. Theoretical Computer Science, 167(1–2):193–233, 30 October 1996.\n[40] D. Sands. Total correctness by local improvement in the transformation of functional\nprograms. ACM Transactions on Programming Languages and Systems, 18(2):175–234,\nMarch 1996.\n[41] D. Sands. From SOS rules to proof principles: An operational metatheory for functional\nlanguages. In Proceedings of the 24th Annual ACM SIGPLAN-SIGACT Symposium\non Principles of Programming Languages (POPL). ACM Press, January 1997.\n[42] J. P. Secher. Perfect supercompilation. Technical Report DIKU-TR-99/1, Department\nof Computer Science (DIKU), University of Copenhagen, February 1999.\n[43] J.P. Secher and M.H. Sørensen. On perfect supercompilation. In D. Bjørner, M. Broy,\nand A. Zamulin, editors, Proceedings of Perspectives of System Informatics, volume\n1755 of Lecture Notes in Computer Science, pages 113–127. Springer-Verlag, 2000.\n[44] M.H. Sørensen. Convergence of program transformers in the metric space of trees. Sci.\nComput. Program, 37(1-3):163–205, 2000.\n[45] M.H. Sørensen and R. Glück. An algorithm of generalization in positive supercompilation. In J.W. Lloyd, editor, International Logic Programming Symposium, pages\n465–479. Cambridge, MA: MIT Press, 1995.\n\n\fPOSITIVE SUPERCOMPILATION\n\n33\n\n[46] M.H. Sørensen, R. Glück, and N.D. Jones. Towards unifying partial evaluation, deforestation, supercompilation, and GPC. In D. Sannella, editor, Programming Languages and Systems - ESOP'94. 5th European Symposium on Programming, Edinburgh, U.K., April 1994 (Lecture Notes in Computer Science, vol. 788), pages 485–500.\nBerlin: Springer-Verlag, 1994.\n[47] M.H. Sørensen, R. Glück, and N.D. Jones. A positive supercompiler. Journal of\nFunctional Programming, 6(6):811–838, 1996.\n[48] J. Svenningsson. Shortcut fusion for accumulating parameters & zip-like functions. In\nICFP, pages 124–132, 2002.\n[49] D. Syme.\nThe F# programming language,\nJune 2008.\nURL\nhttp://research.microsoft.com/fsharp.\n[50] A. Takano. Generalized partial computation for a lazy functional language. In Partial Evaluation and Semantics-Based Program Manipulation, New Haven, Connecticut\n(Sigplan Notices, vol. 26, no. 9, September 1991), pages 1–11. New York: ACM, 1991.\n[51] A. Takano and E. Meijer. Shortcut deforestation in calculational form. In FPCA, pages\n306–313, 1995.\n[52] V.F. Turchin. A supercompiler system based on the language Refal. SIGPLAN Notices,\n14(2):46–54, February 1979.\n[53] V.F. Turchin. Semantic definitions in Refal and automatic production of compilers. In\nN.D. Jones, editor, Semantics-Directed Compiler Generation, Aarhus, Denmark (Lecture Notes in Computer Science, vol. 94), pages 441–474. Berlin: Springer-Verlag, 1980.\n[54] V.F. Turchin. Program transformation by supercompilation. In H. Ganzinger and N.D.\nJones, editors, Programs as Data Objects, Copenhagen, Denmark, 1985 (Lecture Notes\nin Computer Science, vol. 217), pages 257–281. Berlin: Springer-Verlag, 1986.\n[55] V.F. Turchin. The concept of a supercompiler. ACM Transactions on Programming\nLanguages and Systems, 8(3):292–325, July 1986.\n[56] V.F. Turchin. Refal-5, Programming Guide & Reference Manual. Holyoke, MA: New\nEngland Publishing Co., 1989.\n[57] P. Wadler. Deforestation: transforming programs to eliminate trees. Theoretical Computer Science, 73(2):231–248, June 1990. ISSN 0304-3975.\nAppendix A. Proofs\nWe borrow a couple of technical lemmas from Sands [39], and adapt the proofs to be\nvalid under call-by-value:\nLemma A.1 (Sands, p. 24). For all expressions e and value substitutions θ such that\nh∈\n/ dom(θ), if e0 7→1 e1 then\nletrec h = λx.e1 in [θ(e0 )/z]e ED letrec h = λx.e1 in [h θ(x)/z]e\nProof. Expanding both sides according to the definition of letrec yields:\n(λh.[θ(e0 )/z]e) (λn.f ix (λh.λx.e1 ) n) ED (λh.[h θ(x)/z]e) (λn.f ix (λh.λx.e1 ) n)\nand evaluating both sides one step 7→ gives:\n[λn.f ix (λh.λx.e1 ) n/h][θ(e0 )/z]e ED [λn.f ix (λh.λx.e1 ) n/h][h θ(x)/z]e\nFrom this we can see that it is sufficient to prove:\n[λn.f ix (λh.λx.e1 ) n/h]θe0 ED [λn.f ix (λh.λx.e1 ) n/h]h θ(x)\n\n\f34\n\nP. A. JONSSON\n\nThe substitution θ can safely be moved out since h ∈\n/ dom(θ):\n[λn.f ix (λh.λx.e1 ) n/h]θe0 ED [λn.f ix (λh.λx.e1 ) n/h]θ(h x)\nPerforming evaluation steps on both sides yield:\n[λn.f ix (λh.λx.e1 ) n/h]θe0 ED[λn.f ix (λh.λx.e1 ) n/h]θ(h x)\n[λn.f ix (λh.λx.e1 ) n/h]θe0 ED[λn.f ix (λh.λx.e1 ) n/h]θ((λn.f ix (λh.λx.e1 ) n) x)\n[λn.f ix (λh.λx.e1 ) n/h]θe0 ED[λn.f ix (λh.λx.e1 ) n/h]θ(f ix (λh.λx.e1 ) x)\n[λn.f ix (λh.λx.e1 ) n/h]θe1 ED[λn.f ix (λh.λx.e1 ) n/h]θ((λf.f (λn.f ix f n)) (λh.λx.e1 ) x)\n[λn.f ix (λh.λx.e1 ) n/h]θe1 ED[λn.f ix (λh.λx.e1 ) n/h]θ((λh.λx.e1 ) (λn.f ix (λh.λx.e1 ) n) x)\n[λn.f ix (λh.λx.e1 ) n/h]θe1 ED[λn.f ix (λh.λx.e1 ) n/h]θ((λx.e1 ) x)\n[λn.f ix (λh.λx.e1 ) n/h]θe1 ED[x/x][λn.f ix (λh.λx.e1 ) n/h]θe1\n[λn.f ix (λh.λx.e1 ) n/h]θe1 ED[λn.f ix (λh.λx.e1 ) n/h]θe1\nThe LHS and the RHS are cost equivalent, so by Lemma 5.21 the initial expressions are\ncost equivalent.\nLemma A.2 (Sands, p. 25). ρ′ (DJRhviK\u001f,G,ρ′ ) ED letrec h = λx.Rhvi in ρ(DJRhviK\u001f,G,ρ′ )\nProof (Similar to Sands [39]). By inspection of the rules for DJ K, all free occurrences of h\nin DJRhviK\u001f,G,ρ′ must occur in sub-expressions of the form h x. Suppose there are k such\noccurrences, which we can write as θ1 h x . . . θk h x, where the θi are just renamings of the\nvariables x. So DJRhviK\u001f,G,ρ′ can be written as [θ1 h x . . . θk h x/z1 . . . zk ]e′ , where e′ contains\nno free occurrences of h. Then (substitution associates to the right):\nρ′ (DJRhviK\u001f,G,ρ′ )\n\n≡\n\n[λx.Rhgi/h]ρ(DJRhviK\u001f,G,ρ′ )\n\nED [λx.Rhgi/h]ρ([θ1 h x . . . θk h x/z1 . . . zk ]e′ )\nED ρ([θ1 Rhgi . . . θk Rhgi/z1 . . . zk ]e′ )\nED (by Lemma A.1)\nletrec h = λx.Rhv ei in ρ([θ1 h x . . . θk h x/z1 . . . zk ]e′ )\n≡ letrec h = λx.Rhvi in ρ(DJRhviK\u001f,G,ρ′ )\nLemma A.3. Rhlet x = e in f i Ds let x = e in Rhf i\nProof. Notice that Rhlet x = \u001f in f i is a redex, and assume e 7→k v. The LHS evaluates in k\nsteps Rhlet x = e in f i 7→k Rhlet x = v in f i 7→ Rh[v/x]f i, and the RHS evaluates in k steps\nlet x = e in Rhf i 7→k let x = v in Rhf i 7→ [v/x]Rhf i. Since contexts do not bind variables\nthese two terms are equivalent and by Lemma 5.21 the initial terms are cost equivalent.\nLemma A.4. Rhletrec g = v in ei DS letrec g = v in Rhei\nProof. Translate both sides by the definition of letrec into Rh(λg.e) (λn.f ix (λg.v) n)i DS\n(λg.Rhei) (λn.f ix (λg.v) n). Notice that Rh\u001fi is a redex. The LHS evaluates in 0 steps\nto Rh(λg.e) (λn.f ix (λg.v) n)i 7→ Rh[λn.f ix (λg.v) n/g]ei and the RHS evaluates in 0 steps\nto (λg.Rhei) (λn.f ix (λg.v) n) 7→ [λn.f ix (λg.v) n/g]Rhei. Since our contexts do not bind\nvariables these two terms are equivalent and by Lemma 5.21 the initial terms are cost\nequivalent.\n\n\fPOSITIVE SUPERCOMPILATION\n\n35\n\nLemma A.5. Rhcase e of {pi → ei }i Ds case e of {pi → Rhei i}\nProof. Notice that Rhcase \u001f of {pi → ei }i is a redex, and assume e 7→k nj . The LHS\nevaluates in k steps Rhcase e of {pi → ei }i 7→k Rhcase nj of {pi → ei }i 7→ Rhej i, and the\nRHS evaluates in k steps case e of {pi → Rhei i} 7→k case nj of {pi → Rhei i}Rhf i 7→ Rhej i.\nSince these two terms are equivalent the initial terms are cost equivalent by Lemma 5.21.\nWe set out to prove the main theorem about total correctness:\nTheorem A.6 (Total Correctness). Let Rhei be an expression, and ρ an environment such\nthat\n• the range of ρ contains only closed expressions, and\n• fv(Rhei) ∩ dom(ρ) = ∅, and\nthen Rhei Ds ρ(DJeKR,G,ρ ).\nWe reason by induction on the structure of expressions, and since the algorithm is total\n(Lemma 5.12) this coincides with inspection of each rule.\nA.1. R1. We have that ρ(DJnKR,G,ρ ) = ρ(Rhni), and the conditions of the proposition\nensure that fv(Rhni) ∩ dom(ρ) = ∅, so ρ(Rhni) = Rhni This is syntactically equivalent to\nthe input, and we conclude Rhni Ds ρ(DJnKR,G,ρ ).\nA.2. R2. We have that ρ(DJxKR,G,ρ ) = ρ(Rhxi), and the conditions of the proposition\nensure that fv(Rhxi) ∩ dom(ρ) = ∅, so ρ(Rhxi) = Rhxi This is syntactically equivalent to\nthe input, and we conclude Rhxi Ds ρ(DJxKR,G,ρ ).\nA.3. R3.\nA.3.1. Case: (1).\nSuppose ∃h.ρ(h) ≡ λx.Rhgi and hence that DJRhgiK\u001f,G,ρ = h x.\nThe conditions of the proposition ensure that x ∩ dom(ρ) = ∅, so ρ(DJRhgiK\u001f,G,ρ ) =\nρ(h x) = (λx.Rhgi) x. However, Rhgi and (λx.Rhgi) x are cost equivalent, which implies\nstrong improvement, and we conclude Rhgi Ds ρ(DJRhgiK\u001f,G,ρ )\nA.3.2. Case: (2).\nSuppose ∃(h, t) ∈ ρ.t E Rhgi and that Rhgi E t, hence DJRhgiK\u001f,G,ρ = Rhgi.\nThe term on the RHS is discarded and replaced with a new term higher up in the tree,\nso it does not matter what the term is.\nA.3.3. Case: (3).\n\n\f36\n\nP. A. JONSSON\n\nSuppose ∃(h, t) ∈ ρ.t E Rhgi and hence that DJRhgiK\u001f,G,ρ = [DJf K\u001f,G,ρ /y]DJfg K\u001f,G,ρ .\nWe have ρ(DJgKR,G,ρ ) = ρ([DJf K\u001f,G,ρ /y]DJfg K\u001f,G,ρ ) = [ρ(DJf K\u001f,G,ρ )/x]ρ(DJfg K\u001f,G,ρ ).\nBy the induction hypothesis, f Ds ρ(DJf K\u001f,G,ρ ) and fg Ds ρ(DJfg K\u001f,G,ρ ) and by congruence\nproperties of strong improvement (Lemma 5.23:1) Rhgi Ds ρ(DJgKR,G,ρ ).\nA.3.4. Case: (4a). Analogous to the previous case.\nA.3.5. Case: (4b).\nIf DJRhgiK\u001f,G,ρ = ρ(letrec h = λx.DJRhviK\u001f,G,ρ′ in h x).\n/ (x ∪ dom(ρ)). We need to show that:\nwhere ρ′ = ρ ∪ (h, λx.Rhgi) and h ∈\nRhgi Ds ρ(letrec h = λx.DJRhviK\u001f,G,ρ′ in h x)\nSince h, x ∈\n/ dom(ρ) we have that ρ(letrec h = λx.DJRhviK\u001f,G,ρ′ in h x) ≡ letrec h =\nλx.ρ(DJRhviK\u001f,G,ρ′ ) in h x.\nR is a reduction context, hence Rhgi 7→1 Rhvi. By Lemma A.1 we have that letrec h =\nλx.Rhvi in Rhg ei ED letrec h = λx.Rhvi in h x. Since h ∈\n/ fv(Rhgi) this simplifies to\nRhgi ED letrec h = λx.Rhvi in h x. It is necessary and sufficient to prove that\nletrec h = λx.Rhvi in h x Ds letrec h = λx.ρ(DJRhviK\u001f,G,ρ′ ) in h x\nBy Theorem 5.27 it is sufficient to show:\nletrec h = λx.Rhvi in Rhvi Ds\nletrec h = λx.Rhvi in ρ(DJRhviK\u001f,G,ρ′ )\nBy Lemma A.2 and letrec h = λx.Rhvi in Rhvi ED Rhvi, this is equivalent to showing that\nRhvi Ds ρ′ (DJRhviK\u001f,G,ρ′ )\nWhich follows from the induction hypothesis, since it is a shorter transformation.\nA.3.6. Case: (4c). We have that ρ(DJgKR,G,ρ ) = ρ(DJRhviK\u001f,G,ρ ). By the induction hypothesis Rhvi Ds ρ(DJRhviK\u001f,G,ρ ), and since Rhgi 7→1 Rhvi it follows from Lemma 5.23:4\nthat Rhgi Ds ρ(DJgKR,G,ρ ).\nA.4. R4. We have that ρ(DJk eK\u001f,G,ρ ) = ρ(k DJeK\u001f,G,ρ ), and the conditions of the proposition ensure that fv(k e) ∩ dom(ρ) = ∅, so ρ(k DJeK\u001f,G,ρ ) = k ρ(DJeK\u001f,G,ρ ). By the induction hypothesis, e Ds ρ(DJeK\u001f,G,ρ ), and by congruence properties of strong improvement\n(Lemma 5.23:1) k e Ds ρ(DJk eK\u001f,G,ρ ).\nA.5. R5. We have that ρ(DJx eKR,G,ρ ) = ρ(Rhx DJeK\u001f,G,ρ i), and the conditions of the\nproposition ensure that fv(Rhx ei)∩dom(ρ) = ∅, so ρ(Rhx DJeK\u001f,G,ρ i) = Rhx ρ(DJeK\u001f,G,ρ )i.\nBy the induction hypothesis, e Ds ρ(DJeK\u001f,G,ρ ), and by congruence properties of strong\nimprovement (Lemma 5.23:1) Rhx ei Ds ρ(DJx eKR,G,ρ ).\n\n\fPOSITIVE SUPERCOMPILATION\n\n37\n\nA.6. R6. We have that ρ(DJλx.eK\u001f,G,ρ ) = ρ(λx.DJeK\u001f,G,ρ ), and the conditions of the\nproposition ensure that fv(λx.e) ∩ dom(ρ) = ∅, so ρ(λx.DJeK\u001f,G,ρ ) = λx.ρ(DJeK\u001f,G,ρ ).\nBy the induction hypothesis, e Ds ρ(DJeK\u001f,G,ρ ), and by congruence properties of strong\nimprovement (Lemma 5.23:1) λx.e Ds ρ(DJλx.eK\u001f,G,ρ ).\nA.7. R7. We have that ρ(DJn1 ⊕ n2 KR,G,ρ ) = ρ(DJRhniK\u001f,G,ρ ). By the induction hypothesis, Rhni Ds ρ(DJRhniK\u001f,G,ρ ), and since Rhn1 ⊕ n2 i 7→ Rhni it follows from Lemma 5.23:4\nthat Rhn1 ⊕ n2 i Ds ρ(DJn1 ⊕ n2 KR,G,ρ ).\nA.8. R8.\na) e1 ⊕ e2 = a: We have that ρ(DJe1 ⊕ e2 KR,G,ρ ) = ρ(DJe1 K\u001f,G,ρ ⊕ DJe2 K\u001f,G,ρ ), by the given\nconditions fv(Rhe1 ⊕ e2 i) ∩ dom(ρ) = ∅, so ρ(RhDJe1 K\u001f,G,ρ ⊕ DJe2 K\u001f,G,ρ i) =\nRhρ(DJe1 K\u001f,G,ρ ) ⊕ ρ(DJe2 K\u001f,G,ρ )i. By the induction hypothesis e1 Ds ρ(DJe1 K\u001f,G,ρ ) and\ne2 Ds ρ(DJe2 K\u001f,G,ρ ), and by congruence properties of strong improvement (Lemma 5.23:1)\nRhe1 ⊕ e2 i Ds ρ(DJe1 ⊕ e2 KR,G,ρ ).\nb) e1 = n or e1 = a: We have ρ(DJe1 ⊕ e2 KR,G,ρ ) = ρ(DJe2 KRhe1 ⊕\u001fi,G,ρ ) and Rhe1 ⊕ e2 i Ds\nρ(DJe2 KRhe1 ⊕\u001fi,G,ρ ) follows from the induction hypothesis.\nc) otherwise: We have that ρ(DJe1 ⊕ e2 KR,G,ρ ) = ρ(DJe1 KRh\u001f⊕e2 i,G,ρ ) and Rhe1 ⊕ e2 i Ds\nρ(DJe1 KRh\u001f⊕e2 i,G,ρ ) follows from the induction hypothesis.\nA.9. R9. We have that ρ(DJ(λx.f ) eKR,G,ρ ) = ρ(DJRhlet x = e in f iK\u001f,G,ρ ). Evaluating\nthe input term yields: Rh(λx.f ) ei 7→r Rh(λx.f ) vi 7→ Rh[v/x]f i, and evaluating the input\nto the recursive call yields: Rhlet x = e in f i 7→r Rhlet x = v in f i 7→ Rh[v/x]f i. These\ntwo resulting terms are syntactically equivalent, and therefore cost equivalent. By Lemma\n5.21 their ancestor terms are cost equivalent, Rh(λx.f ) ei ED Rhlet x = e in f i, and cost\nequivalence implies strong improvement. By the induction hypothesis Rhlet x = e in f i Ds\nρ(DJRhlet x = e in f iK\u001f,G,ρ ), and therefore Rh(λx.f ) ei Ds ρ(DJ(λx.f ) eKR,G,ρ ).\nA.10. R10. We have ρ(DJe e′ KR,G,ρ ) = ρ(DJeKRh\u001f e′ i,G,ρ ) and Rhe e′ i Ds ρ(DJeKRh\u001f e′ i,G,ρ )\nfollows from the induction hypothesis.\nA.11. R11. We have that ρ(DJlet x = n in f KR,G,ρ ) = ρ(DJRh[n/x]f iK\u001f,G,ρ ). By the induction hypothesis Rh[n/x]f i Ds ρ(DJRh[n/x]f iK\u001f,G,ρ ), and since Rhlet x = n in f i 7→\nRh[n/x]f i it follows from Lemma 5.23:4 that Rhlet x = n in f i Ds ρ(DJlet x = n in f KR,G,ρ ).\nA.12. R12. We have that ρ(DJlet x = y in f KR,G,ρ ) = ρ(DJRh[y/x]f iK\u001f,G,ρ ). By the induction hypothesis Rh[y/x]f i Ds ρ(DJRh[y/x]f iK\u001f,G,ρ ), and since Rhlet x = y in f i ED\nRh[y/x]f i it follows that Rhlet x = y in f i Ds ρ(DJlet x = y in f KR,G,ρ ).\nA.13. R13.\n\n\f38\n\nP. A. JONSSON\n\nA.13.1. Case: x ∈ strict(f ). We have ρ(DJlet x = e in f KR,G,ρ ) = ρ(DJRh[e/x]f iK\u001f,G,ρ ).\nEvaluating the input term yields Rhlet x = e in f i 7→r Rhlet x = v in f i 7→ Rh[v/x]f i 7→s\nEhvi, and evaluating the input to the recursive call yields: Rh[e/x]f i 7→s Ehei 7→r Ehvi.\nThese two resulting terms are syntactically equivalent, and therefore cost equivalent. By\nLemma 5.21 their ancestor terms are cost equivalent, Rhlet x = e in f i ED Rh[e/x]f i, and\ncost equivalence implies strong improvement. By the induction hypothesis Rh[e/x]f i Ds\nρ(DJRh[e/x]f iK\u001f,G,ρ ), and therefore Rhlet x = e in f i Ds ρ(DJlet x = e in f KR,G,ρ ).\nA.13.2. Case: otherwise. We have that ρ(DJlet x = e in f KR,G,ρ ) =\nρ(let x = DJeK\u001f,G,ρ in DJRhf iK\u001f,G,ρ ), and the conditions of the proposition ensure that\nfv(Rhlet x = e in f i) ∩ dom(ρ) = ∅, so ρ(let x = DJeK\u001f,G,ρ in DJRhf iK\u001f,G,ρ ) =\nlet x = ρ(DJeK\u001f,G,ρ ) in ρ(DJRhf iK\u001f,G,ρ ). By the induction hypothesis e Ds ρ(DJeK\u001f,G,ρ )\nand Rhf i Ds ρ(DJRhf iK\u001f,G,ρ ). By Lemma A.3 the input is strongly improved by let x =\ne in Rhf i, and therefore Rhlet x = e in f i Ds ρ(DJlet x = e in f KR,G,ρ ).\nA.14. R14. We have that ρ(DJletrec g = v in eKR,G,ρ ) = ρ(letrec g = v in DJRheiK\u001f,G,ρ ),\nand the conditions of the proposition ensure that fv(Rhletrec g = v in ei) ∩ dom(ρ) = ∅,\nso ρ(letrec g = v in DJRheiK\u001f,G,ρ ) = letrec g = v in ρ(DJRheiK\u001f,G,ρ ). By the induction\nhypothesis Rhei Ds ρ(DJRheiK\u001f,G,ρ ). By Lemma A.4 the input is strongly improved by\nletrec g = v in Rhei, and therefore Rhletrec g = v in ei Ds ρ(DJletrec g = v in eKR,G,ρ ).\nA.15. R15. We have ρ(DJcase x of {pi → ei }KR,G,ρ ) = ρ(case x of {pi → DJRhei iK\u001f,G,ρ }),\nand the conditions of the proposition ensure that fv(Rhcase x of {pi → ei }i) ∩ dom(ρ) = ∅,\nso ρ(case x of {pi → DJRhei iK\u001f,G,ρ }) = case x of {pi → ρ(DJRhei iK\u001f,G,ρ )}. By the induction\nhypothesis Rhei i Ds ρ(DJRhei iK\u001f,G,ρ ). Using Lemma A.5 the input is strongly improved\nby case x of {pi → Rhei i}, and therefore Rhcase x of {pi → ei }i Ds\nρ(DJcase x of {pi → ei }KR,G,ρ ).\nA.16. R16. We have ρ(DJcase kj e of {pi → ei }KR,G,ρ ) = ρ(DJRhlet xj = e in ej iK\u001f,G,ρ ).\nEvaluating the input term yields Rhcase kj e of {pi → ei }i 7→r Rhcase kj v of {pi → ei }i 7→\nRh[v/xj ]ej i, and evaluating the input to the recursive call yields Rhlet xj = e in ej i 7→r\nRhlet xj = v in ej i 7→ Rh[v/xj ]ej i. These two resulting terms are syntactically equivalent,\nand therefore cost equivalent. By Lemma 5.21 their ancestor terms are cost equivalent,\nRhcase kj e of {pi → ei }i ED Rhlet xj = e in ej i, and cost equivalence implies strong improvement. According to the induction hypothesis Rhlet xj = e in ej i Ds\nρ(DJRhlet xj = e in ej iK\u001f,G,ρ ), and therefore Rhcase kj e of {pi → ei }i Ds\nρ(DJcase kj e of {pi → ei }KR,G,ρ ).\nA.17. R17. We have that ρ(DJcase nj of {pi → ei }K),G,ρ = ρ(DJRhej iK\u001f,G,ρ ). By the induction hypothesis Rhej i Ds ρ(DJRhej iK\u001f,G,ρ ), and since Rhcase nj of {pi → ei }i 7→ Rhej i\nit follows from Lemma 5.23:4 that Rhcase nj of {pi → ei }i Ds\nρ(DJcase nj of {pi → ei }KR,G,ρ ).\n\n\fPOSITIVE SUPERCOMPILATION\n\n39\n\nA.18. R18. We have that ρ(DJcase a of {pi → ei }KR,G,ρ ) =\nρ(case DJaK\u001f,G,ρ of {pi → DJRhei iK\u001f,G,ρ }), and the conditions of the proposition ensure that\nfv(Rhcase a of {pi → ei }i) ∩ dom(ρ) = ∅, so ρ(case DJaK\u001f,G,ρ of {pi → DJRhei iK\u001f,G,ρ }) =\ncase ρ(DJaK\u001f,G,ρ ) of {pi → ρ(DJRhei iK\u001f,G,ρ )}. By the induction hypothesis a Ds\nρ(DJaK\u001f,G,ρ ) and Rhei i Ds ρ(DJRhei iK\u001f,G,ρ ) and by Lemma A.5 the input is strongly\nimproved by case a of {pi → Rhei i}, and therefore Rhcase a of {pi → ei }i Ds\nρ(DJcase a of {pi → ei }KR,G,ρ ).\nA.19. R19. We have that ρ(DJcase e of {pi → ei }KR,G,ρ ) = ρ(DJeKRhcase \u001f of {pi →ei }i,G,ρ )\nand Rhcase e of {pi → ei }i Ds ρ(DJeKRhcase \u001f of {pi →ei }i,G,ρ ) follows from the induction hypothesis.\nA.20. R20. We have that ρ(DJeKR,G,ρ ) = ρ(Rhei), and the conditions of the proposition\nensure that fv(Rhei) ∩ dom(ρ) = ∅, so ρ(Rhei) = Rhei This is syntactically equivalent to\nthe input, and we conclude Rhei Ds ρ(DJeKR,G,ρ ).\n\nThis work is licensed under the Creative Commons Attribution-NoDerivs License. To view\na copy of this license, visit http://creativecommons.org/licenses/by-nd/2.0/ or send a\nletter to Creative Commons, 171 Second St, Suite 300, San Francisco, CA 94105, USA, or\nEisenacher Strasse 2, 10777 Berlin, Germany\n\n\f"}