{"id": "http://arxiv.org/abs/0806.2539v1", "guidislink": true, "updated": "2008-06-16T17:33:42Z", "updated_parsed": [2008, 6, 16, 17, 33, 42, 0, 168, 0], "published": "2008-06-16T17:33:42Z", "published_parsed": [2008, 6, 16, 17, 33, 42, 0, 168, 0], "title": "Reducibility of quantum representations of mapping class groups", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0806.1496%2C0806.3638%2C0806.2562%2C0806.1478%2C0806.0926%2C0806.0061%2C0806.4458%2C0806.0800%2C0806.3690%2C0806.0732%2C0806.0723%2C0806.4582%2C0806.3924%2C0806.4408%2C0806.0236%2C0806.0295%2C0806.2889%2C0806.2144%2C0806.0898%2C0806.4299%2C0806.2742%2C0806.4144%2C0806.4148%2C0806.0348%2C0806.0884%2C0806.2905%2C0806.1026%2C0806.0678%2C0806.4394%2C0806.2678%2C0806.3554%2C0806.3014%2C0806.2193%2C0806.3347%2C0806.3893%2C0806.2490%2C0806.3549%2C0806.3813%2C0806.2751%2C0806.1804%2C0806.3934%2C0806.2411%2C0806.4715%2C0806.1995%2C0806.4454%2C0806.2539%2C0806.0823%2C0806.0032%2C0806.0795%2C0806.3199%2C0806.3865%2C0806.4465%2C0806.0138%2C0806.4347%2C0806.0636%2C0806.0637%2C0806.2867%2C0806.1957%2C0806.4788%2C0806.4561%2C0806.4116%2C0806.1083%2C0806.0850%2C0806.0224%2C0806.4185%2C0806.3247%2C0806.0115%2C0806.2291%2C0806.2783%2C0806.0015%2C0806.0558%2C0806.0613%2C0806.2436%2C0806.2547%2C0806.3280%2C0806.2690%2C0806.3164%2C0806.3518%2C0806.0815%2C0806.3032%2C0806.2381%2C0806.3929%2C0806.3603%2C0806.3700%2C0806.0128%2C0806.2766%2C0806.2096%2C0806.4226%2C0806.2017%2C0806.2527%2C0806.1978%2C0806.0919%2C0806.1518%2C0806.0488%2C0806.3538%2C0806.3124%2C0806.4784%2C0806.4678%2C0806.1315%2C0806.2401%2C0806.1933&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Reducibility of quantum representations of mapping class groups"}, "summary": "In this paper we provide a general condition for the reducibility of the\nReshetikhin-Turaev quantum representations of the mapping class groups. Namely,\nfor any modular tensor category with a special symmetric Frobenius algebra with\na non-trivial genus one partition function, we prove that the quantum\nrepresentations of all the mapping class groups built from the modular tensor\ncategory are reducible. In particular for SU(N) we get reducibility for certain\nlevels and ranks. For the quantum SU(2) Reshetikhin-Turaev theory we construct\na decomposition for all even levels. We conjecture this decomposition is a\ncomplete decomposition into irreducible representations for high enough levels.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0806.1496%2C0806.3638%2C0806.2562%2C0806.1478%2C0806.0926%2C0806.0061%2C0806.4458%2C0806.0800%2C0806.3690%2C0806.0732%2C0806.0723%2C0806.4582%2C0806.3924%2C0806.4408%2C0806.0236%2C0806.0295%2C0806.2889%2C0806.2144%2C0806.0898%2C0806.4299%2C0806.2742%2C0806.4144%2C0806.4148%2C0806.0348%2C0806.0884%2C0806.2905%2C0806.1026%2C0806.0678%2C0806.4394%2C0806.2678%2C0806.3554%2C0806.3014%2C0806.2193%2C0806.3347%2C0806.3893%2C0806.2490%2C0806.3549%2C0806.3813%2C0806.2751%2C0806.1804%2C0806.3934%2C0806.2411%2C0806.4715%2C0806.1995%2C0806.4454%2C0806.2539%2C0806.0823%2C0806.0032%2C0806.0795%2C0806.3199%2C0806.3865%2C0806.4465%2C0806.0138%2C0806.4347%2C0806.0636%2C0806.0637%2C0806.2867%2C0806.1957%2C0806.4788%2C0806.4561%2C0806.4116%2C0806.1083%2C0806.0850%2C0806.0224%2C0806.4185%2C0806.3247%2C0806.0115%2C0806.2291%2C0806.2783%2C0806.0015%2C0806.0558%2C0806.0613%2C0806.2436%2C0806.2547%2C0806.3280%2C0806.2690%2C0806.3164%2C0806.3518%2C0806.0815%2C0806.3032%2C0806.2381%2C0806.3929%2C0806.3603%2C0806.3700%2C0806.0128%2C0806.2766%2C0806.2096%2C0806.4226%2C0806.2017%2C0806.2527%2C0806.1978%2C0806.0919%2C0806.1518%2C0806.0488%2C0806.3538%2C0806.3124%2C0806.4784%2C0806.4678%2C0806.1315%2C0806.2401%2C0806.1933&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this paper we provide a general condition for the reducibility of the\nReshetikhin-Turaev quantum representations of the mapping class groups. Namely,\nfor any modular tensor category with a special symmetric Frobenius algebra with\na non-trivial genus one partition function, we prove that the quantum\nrepresentations of all the mapping class groups built from the modular tensor\ncategory are reducible. In particular for SU(N) we get reducibility for certain\nlevels and ranks. For the quantum SU(2) Reshetikhin-Turaev theory we construct\na decomposition for all even levels. We conjecture this decomposition is a\ncomplete decomposition into irreducible representations for high enough levels."}, "authors": ["Jørgen Ellegaard Andersen", "Jens Fjelstad"], "author_detail": {"name": "Jens Fjelstad"}, "author": "Jens Fjelstad", "arxiv_comment": "23 pages, 39 figures", "links": [{"href": "http://arxiv.org/abs/0806.2539v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0806.2539v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.QA", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.QA", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.MP", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0806.2539v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0806.2539v1", "journal_reference": null, "doi": null, "fulltext": "Reducibility of quantum representations of mapping\nclass groups\n\narXiv:0806.2539v1 [math.QA] 16 Jun 2008\n\nJørgen Ellegaard Andersen and Jens Fjelstad\nOctober 26, 2018\nAbstract\nIn this paper we provide a general condition for the reducibility of the ReshetikhinTuraev quantum representations of the mapping class groups. Namely, for any modular tensor category with a special symmetric Frobenius algebra with a non-trivial\ngenus one partition function, we prove that the quantum representations of all the\nmapping class groups built from the modular tensor category are reducible. In particular for SU (N ) we get reducibility for certain levels and ranks. For the quantum\nSU (2) Reshetikhin-Turaev theory we construct a decomposition for all even levels. We conjecture this decomposition is a complete decomposition into irreducible\nrepresentations for high enough levels.\n\n1\n\n\fOne of the features of three dimensional TQFT, as defined first by Witten, Atiyah\nand Segal in [W], [At] and [S], and further made precise by Reshetikhin and Turaev in\n[RT1], [RT2], is that it provides finite dimensional representations of mapping class groups\nof compact orientable surfaces, possibly with marked points. More precisely, a TQFT\nbased on a modular category C with ground field k associates finite dimensional k-vector\nspaces H(X) to surfaces X, and linear isomorphisms ρ(f ) : H(X) → H(X′ ) to orientation\npreserving homeomorphisms f : X → X′ depending only on the mapping class [f ]. The\nassignment f 7→ ρ(f ) is quasi-functorial, where the failure of functoriality is measured\nby a non-zero multiplicative factor, with the end result that ρ : MC(X) → End(H(X))\nbecomes a projective representation. See [T] for a complete treatment of this.\nAnother machine that produces finite dimensional projective representations of mapping class groups is rational conformal field theory [MS, FrS]. Furthermore, given a\nrational CFT with chiral algebra V, it is expected that the corresponding representation\nof MC(X) is isomorphic to the representation given by a TQFT based on the modular\ncategory Rep(V). With some assumptions on V the statement has been shown to be true\nfor genus 0 and genus 1, but is still open for higher genus.\nApart from some special cases, not much is known about the (ir-)reducibility these\nrepresentations. For the rest of the paper we focus on surfaces with no marked points.\nIn the Reshetikhin-Tureav TQFT for Uq (sl(2, C)) Roberts has shown, with the use of the\nskein theoretical construction of this Resetikhin-Turaev TQFT by Blanchet, Habegger,\nMasbaum and Vogel [BHMV1], [BHMV2], that for k + 2 prime the representations are\nirreducible for any genus g ≥ 1 [R]. We recall that this result played a key role in proving\nthat the mapping class groups does not have Kazhdan's Property T [A2].\nThe method used to classify modular invariant torus partition functions in the SU(2)\nWZW models of CFT presented in [GQ] confirm this result for genus 1, since it is shown\nthat the commutant of the representation is trivial when k + 2 is prime. It is furthermore\nshown that the commutant is non-trivial for all other (integer) values of k > 1, and the\ncorresponding representations are reducible.\nThe TQFT representations of the mapping class group of a surface of genus 1 (i.e. of\nSL(2, Z)) are rather special since they factor through the finite group SL(2, Z/NZ)\n[CG, Ba]. It has been shown in some detail [CK] how the representations decompose\nfor g = 1 in the SU(3) theory at level k with k + 3 prime and k + 3 ≡ 2mod3. Furthermore the same reference contains the result that the representations in the SU(N) theory\nat level k where N > 2, k > N, and with k + N and N coprime are reducible for all genus\ng ≥ 1.\nA rational CFT with chiral algebra V is defined by a so called symmetric special Frobenius algebra in the modular category Rep(V). By means of the Frobenius algebra, a CFT\nassigns to a closed oriented surfaces X, elements in H(X) ⊗C H(X)∗ (correlators) commuting with the TQFT representation of MC(X) on H(X). The most familiar of these\ncorrelators are the modular invariant torus partition functions, which are elements of\nH(T 2 ) ⊗C H(T 2 )∗ . In a (canonically given) basis {χi }i of H(T 2 ), torus partition functions\nare represented by matrices Z(A) = (Zij (A)), determined by the Frobenius algebra A. We\nsay that this partition function is trivial, if Z(A) is proportional to the the identity. We\nuse techniques from rational CFT to investigate the TQFT representations of mapping\n2\n\n\fclass groups of compact closed orientable surfaces Xg of genus g ≥ 1, without marked\npoints.\nThe main results are presented in two theorems:\nTheorem 1 Let C be a modular tensor category. If there exists a special symmetric\nFrobenius algebra A in C such that Z(A) is not trivial, then the TQFT representation of\nthe mapping class group of Xg on H(Xg ) is reducible for every g ≥ 1.\nRemark 1 We expect that the qualifier \"Z(A) is not trivial\" can be replaced by requiring\nthat the symmetric special Frobenius algebra not Morita equivalent to 11. As we will see\n(cf remark 3) our present proof does not allow us to do this. It should be mentioned,\nhowever, that there is no known example of an algebra that yields the diagonal modular\ninvariant torus partition function, but at the same time is not Morita equivalent to 11.\nIf we include in the set of symmetric special Frobenius algebras in modular categories\nalso examples arising as canonical endomorphisms in nets of type III1 subfactors on the\ncircle, we get the following\nCorollary 1 The TQFT representations are reducible for all genus g ≥ 1 in the theories\nbased on\nSU(2) for all levels k ∈ 2N, k ≥ 4\nSU(3) for all levels k ∈ N, k ≥ 3\nSU(N) for N = mq, m, q ∈ N, m > 1 for level k such that kq ∈ 2mN if N is even\nand kq ∈ mN if N is odd.\nThe list is far from exhaustive, but contains the most interesting examples from the point\nof view of TQFT. Some other examples are listed in section 2, the largest and most important class of which is all theories admitting simple current invariants [FRS3]. It is\ngenerally believed that most non-trivial modular invariants will be simple current invariants, so although some of the other invariants may be spurious (i.e. they will not arise\nas the torus partition function of any CFT, and thus won't be realised by a symmetric\nspecial Frobenius algebra), the theorem most likely implies that reducibility for all genus\ng ≥ 1 is a rather generic feature of TQFT.\nIn the SU(2) case, the modular invariant torus partition functions have an ADE classification [CIZ]. In addition, the results in [KiO, Os] can be said to give an ADE classification\nof the (Morita equivalence classes of) symmetric special Frobenius algebras in the modular categories Ck of integrable dominant highest weight representations of the untwisted\ng,k,D/E\nb\naffine Lie algebra su(2)\nat level k. These results are used to produce projectors Π±\non the corresponding spaces H(Xg ), from which we can derive the following theorem.\nTheorem 2 Let V g,k ≡ (H(Xg ), ρg ) denote the representation of the mapping class group\nof Xg given by the TQFT based on the modular category Ck , i.e. the Reshetikhin-Turaev\nTQFT for Uq (sl(2, C)). If k ∈ 2Z+ , k ≥ 4, then have the following decomposition:\nV g,k = V+g,k,D ⊕ V−g,k,D ≡ Im(Πg,k,D\n) ⊕ Im(Πg,k,D\n).\n+\n−\n\n3\n\n(1)\n\n\fFor k = 10, 16, and 28 we have further\nV g,k = V+g,k,E ⊕ V−g,k,E ≡ Im(Πg,k,E\n) ⊕ Im(Πg,k,E\n)\n+\n−\n=\n\nV+g,k,E\n\n⊕ W g,k ⊕\n\nV−g,k,D\n\n≡\n\nIm(Πg,k,E\n)\n+\n\n⊕\n\nIm(Πg,k,D\nΠg,k,E\n)\n+\n−\n\n(2)\n⊕\n\nIm(Πg,k,D\n).\n−\n\n(3)\n\ng,k,D/E\n\nFor any g ≥ 1 and for any k in the given range, the vector spaces underlying V±\nW g,k are non-zero.\n\n,\n\nWe find it very interesting to understand if this decomposition is further reducible or not\nfor genus g ≥ 2. In fact for high enough level, we conjecture this decomposition can not\nbe further decomposed.\nWe also find it very interesting to try to understand the above decompositions in terms\nof the geometric model (see e.g. [ADW], [H], [A1], [A3] and references in there) for these\nTQFT's. In particular we expect that the above decomposition agrees with the one found\nin [AM]. Furthermore, the higher genus zero decompositions given by Blanchet in [Bl]\nmight also be related to the decompositions obtainable from the techniques introduced in\nthis paper.\n\n1\n\nPreliminaries\n\nIn this section we gather some preliminary results, and establish conventions and notation\nfor working in a ribbon category. The conventions and notation coincide to large extent\nwith those of references [FRS1, FrFRS1, FjFRS1, FjFRS2], which we refer to for more\nextensive discussions.\n\n1.1\n\nConventions and Notation for Ribbon Categories\n\nLet C be a strict abelian C-linear semisimple ribbon category with a finite number of\nisomorphism classes of simple objects. In practice we will be interested in modular categories, but the maximal non-degeneracy of the braiding will not play any role in this\npaper1 . With this definition, C is automatically idempotent complete (Karoubian), i.e.\nevery idempotent is split: let p ∈ End(U) be an idempotent, p◦p = p, then p is called split\nif there is a triple (V, e, r) with V an object, e ∈ Hom(V, U) a monic, and r ∈ Hom(U, V )\na morphism s.t. r ◦ e = idV and e ◦ r = p, i.e. (V, e, r) is a retract. The monic e is Im(p)\nin the categorical sense, and by abuse of notation we say Im(p) = V . We indicate that V\nis a subobject of U by writing V ≺ U, and the morphisms of a retract (V, e, r) of U are\ndenoted eV ≺U respectively rV ≺U .\nWe choose a representative of every isomorphism class of simple objects and denote\nthese by Ui , i ∈ I, where U0 = 11, the tensor unit. The braiding isomorphisms are denoted\ncU,V ∈ Hom(U ⊗ V, V ⊗ U). The twist isomorphisms are θU ∈ End(U), and for a simple\nobject Ui we write θUi = θi idUi where θi ∈ C× . Evaluation and coevaluation morphisms\nof the right duality are denoted by dU and bU respectively, while those for the left duality\nare denoted d ̃U resp. b̃U .\n1\n\nNote that a modular category in this sense is more restrictive than in the original sense, but includes\nall modular tensor categories obtained in rational conformal field theory.\n\n4\n\n\fWe will make frequent use of graphical calculus in C, let us therefore fix some conventions regarding diagrams representing morphisms. All diagrams are to be read upwards,\nfrom bottom to top. Morphisms e and r of a retract are drawn as\nU\n\nV\n\ne\n\nr\n\nV\n\nU\n\nThe various structural morphisms are pictured as\nV\n\nU\n\nU\n\nU∨\n\nU\n\nbU =\n\ncU,V =\n\ndU =\nU∨\n\nΘU =\n\nU\n\nU\n\nV\n\nU\n\nwith the obvious modifications for inverses of the isomorphisms and evaluation and\ncoevaluation for the left duality. We fix once and for all bases {λα(ij)k }α of morphism\n(ij)k\n\nspaces Hom(Ui ⊗ Uj , Uk ) and dual bases {λ̄ᾱ\n\n}ᾱ of Hom(Uk , Ui ⊗ Uj ).\n\nUk\n\nλα(ij)k =\n\nUi\n\n(ij)k\n\nα\n\nλ̄ᾱ\n\nUj\n\n=\nᾱ\n\nUi\n\nUk\n\nUj\n\nThe meaning of dual bases is shown in the following figure.\nUi\n\nUi\n\nβ\nUj\n\nUk\n\n= δα,β\n\nᾱ\nUi\n\nUi\n\nWhen one of the simple objects involved is the tensor unit we further choose the\nmorphisms as shown in figure 1, which is possible since C is strict.\nb k (2)\nA category related to su\nb k (2)\nThe category of integrable highest weight modules of the untwisted affine algebra su\nfor some k ∈ N or, alternatively, the semisimple part of the category of representations of\n2πi\nUq (sl2 ) for q = e k+2 , is a modular tensor category. In CFT it is the category underlying\n5\n\n\fUi\n\nUi\n\n=\n\nUi\n\n11\n\nUi\n\nUi\n\n11\n\n=\n\nUi\n\nUi\n\n=\n\n11\n\nUi\n\nUi\n\n11\n\nUi\n\n=\n\nUi\n\nUi\n\nFigure 1: Choice of adapted basis.\nthe su(2) WZW model at level k. We define C k to be strictifications of these categories.\nThere are k + 1 isomorphism classes of simple objects, i.e. I = {0, 1, . . . , k}, with fusion\nrules given by\nmin{i+j,2k−i−j}\nUl .\n(4)\nUi ⊗ Uj ∼\n= ⊕l=|i−j|\nIn particular we have the fusion coefficients Nij l ∈ {0, 1} for all values of i, j, and l. The\ntwist coefficients of the simple objects are given by\nθj = q\n\nj(j+2)\n4\n\n(5)\n\nand the quantum dimensions by\ndj ≡ dim(Uj ) =\n\nq j/2 − q −j/2\n.\nq 1/2 − q −1/2\n\n(6)\n\nThe object Uk is invertible2 , Uk ⊗ Uk ∼\n= 11, a fact that will play an important role in the\nnext section. We note that dk = 1 and θk = ik , so θk = 1 precisely when k = 4N and\nθk = −1 precisely when k = 2(2N +1). One important feature of invertible objects is that,\ntensoring any simple object with an invertible object gives a simple object. In particular,\nthe Picard group P ic(C) of C, i.e. the multiplicative group generated by isomorphism\nclasses of invertible objects, acts on isomorphism classes of simple objects (though not in\ngeneral on the set of simple objects). Obviously, P ic(Ck ) ∼\n= Z2 .\n\n1.2\n\nAlgebras in tensor categories and an Endofunctor\n\nBy an algebra in C we shall mean an associative unital algebra, i.e. an object A, a\nmultiplication morphism m : A ⊗ A → A and a unit morphism η : 11 → A satisfying\nthe associativity and unit constraints. The notion of a (coassociative, counital) coalgebra is the obvious dual concept, with comultiplication and counit denoted by ∆ and ε\nrespectively. Graphically, these morphisms and constraints are pictured as in figure 2.\nA Frobenius algebra in C is a 5-tuple (A, m, η, ∆, ε) s.t. (A, m, η) is an algebra,\n(A, ∆, ε) is a coalgebra, and there is the following compatibility condition between the\nalgebra and coalgebra structures:\n(idA ⊗ m) ◦ (∆ ⊗ idA ) = ∆ ◦ m = (m ⊗ idA ) ◦ (idA ⊗ ∆),\nwhich is shown graphically in figure 3.\n2\n\nIn physics nomenclature an invertible object is known as a simple current.\n\n6\n\n(7)\n\n\fA\n\nA\n\nA\n\nA\n\nm=\n\nη=\n\n∆=\n\nε=\nA\n\nA\n\nA\n\nA\n\n=\n\n=\n\n=\n\n=\n\n=\n\n=\n\nFigure 2: The graphical notation for a unital algebra and counital coalgebra, with associativity, coassociativity, left- and right-unit and -counit constraints.\n\n=\n\n=\n\nFigure 3: The Frobenius condition.\nAn algebra with counit, (A, m, η, ε) is called symmetric if the two obvious morphisms\nfrom A to A∨ are equal:\nΦ1 ≡ [(ε ◦ m) ⊗ idA∨ ] ◦ (idA ⊗ bA ) = [idA∨ ⊗ (ε ◦ m)] ◦ (b̃A ⊗ idA ) ≡ Φ2 ,\n\n(8)\n\nor in graphical notation as shown in figure 4\nAn algebra with counit (A, m, η, ε) is called non-degenerate if Φ1 (or equivalenty Φ2 )\nas defined above is an isomorphism.\nA Frobenius algebra is called normalised special if\nε ◦ η = dim(A)id11 , m ◦ ∆ = idA .\n\n(9)\n\nWe drop the prefix normalised and call a Frobenius algebra special if it satisfies these two\nconditions. Specialness is shown in graphical notation in figure 5.\nNote that there is always the structure of a symmetric special Frobenius algebra on the\nobject 11.\n\n7\n\n\fA∨\n\nA∨\n\n=\n\nA\n\nA\n\nFigure 4: The symmetry condition.\n\n= dA\n\n=\n\nFigure 5: The (normalised) specialness condition.\nThe notion of (left and right) modules and bimodules of algebras are defined in the\nobvious way, and we call an algebra A simple if it is simple as a bimodule over itself:\ndimC HomA|A (A, A) = 1. An algebra A is called haploid if it contains one copy of the\ntensor unit: dimC Hom(11, A) = 1.\nFor algebras of the form\n\nA∼\n= ⊕i∈J⊂I Ui\n\n(10)\n\n(implying haploidity of A) we choose retracts (Ui , eUi ≺A , rUi≺A ) corresponding to every\nsimple subobject. These distinguished retracts are drawn as follows\nA\n\nUi\n\neUi ≺A\n\nrUi ≺A\n\nUi\n\nA\n\nFigure 6: Graphical notation for the distingished retracts of an algebra A.\nIn particular we let e11≺A = η, so if A is (normalised) special we have r11≺A =\ndim(A)−1 ε. Using these retracts we define the components of the multiplication and\ncomultiplication as shown in figure 7.\nWe will need the following result from [FRS1]\nLemma 1 (Lemma 3.7 b) [FRS1]) Let (A, m, η) be an algebra and let ε ∈ Hom(A, 11) be\na morphism s.t. (A, m, η, ε) is a non-degenerate algebra, then there is a unique structure\nof symmetric special Frobenius algebra on A.\n\n8\n\n\fUk\n\nUj\n\nmij k λ(ij)k =\nUi\n\nUk\n\n∆ijk λ̄(jk)i =\nUj\n\nUi\n\nFigure 7: Definition of the components of the multiplication and comultiplication in terms\nof the distinguished retracts.\nAs a consequence, to check whether a triple (A, m, η) can be extended to a ssFa we\nonly need to check associativity, unitality and find a ε s.t. the resulting structure is\nnon-degenerate. If A is haploid we can already choose ε = dA r11≺A . If we restrict to\nalgebras of the form above, i.e. where dimC Hom(Ui , A) ∈ {0, 1} for any simple object Ui ,\nthe restrictions formed by demanding unitality, associativity and non-degeneracy can be\nexpressed rather compactly in terms of the components of m. In particular we have\n• Unitality:\nm0ii = 1 = mi0i ∀Ui ≺ A\n\n(11)\n\nmiῑ0 6= 0 ∀Ui ≺ A\n\n(12)\n\n• Non-degeneracy:\n\nEndofunctors Related to Algebras\nl/r\nLet A be a symmetric special Frobenius algebra, and consider the endomorphisms PA\nl/r\nshown in figure below. It follows straightforwardly from the properties of A that PA are\nidempotents, see lemma 5.2 of [FRS1].\n\nPAl =\n\nPAr =\n\nl/r\n\nDefinition 1 The images (Cl/r (A), el/r , rl/r ) of PA are called the left center respectively\nthe right center of A.\nThe left and right centers have the following properties\n• C ≡ Cl/r (A) has the structure of a commutative symmetric special Frobenius algebra, with mC = r ◦ m ◦ (e ⊗ e), , ηC = r ◦ η, ∆C = ζ(r ⊗ r) ◦ ∆ ◦ e, εC = ζε ◦ e for\nζ = dC d−1\nA . If A is simple, so is C. (proposition 2.37, [FrFRS1])\n• C has trivial twist, θC = idC (lemma 2.33, [FrFRS1])\n• In CFT, C has the interpretation as the maximal extension of the chiral algebra\nw.r.t a given modular invariant torus partition function\n9\n\n\fFor each object U we define two endomorphisms, PAl (U) and PAr (U), of A ⊗ U as in\nfigure 8.\nA\n\nU\n\nPAl (U) =\n\nA\n\nU\n\nA\n\nU\n\nPAr (U) =\n\nA\n\nU\n\nl/r\n\nFigure 8: Idempotent endomorphisms defining the two endofunctors EA .\nl/r\n\nl/r\n\nSimilarly as for PA the properties of A imply that PA (U) are idempotents, see lemma\n5.2 of [FRS1].\nl/r\n\nDefinition 2 The two endofunctors EA ∈ End(C) are defined through\nl/r\n\nl/r\n\n• U ∈ Obj(C) 7→ EA (U) ≡ Im(PA (U))\nl/r\n\n• f ∈ Mor(C) 7→ EA (f ) ≡ rl/r ◦ f ◦ el/r\nl/r\n\nNote that by taking U = 11 we get Cl/r (A) = EA (11).\nl/r\n\nl/r\n\nl/r\n\nRemark 2 The functors EA are not tensor functors since, in general, EA (U)⊗EA (V ) ≇\nl/r\nEA (U ⊗ V ). Using these it is, however, possible to construct tensor functors. The obl/r\njects EA (U) carry a natural structure of modules of Cl/r (A), and they furthermore have\nthe property of trivialising the braiding w.r.t. Cl/r (A). Such modules were called local\nmodules in [FrFRS1]. The category CClocl/r (A) of local modules of the left or right center\nof a symmetric special Frobenius algebra A happens to be a ribbon category, and if C is\nl/r\nmodular then so is CClocl/r (A) . By interpreting EA as functors from C to CClocl/r (A) , they are\nboth tensor functors (see [FrFRS1]).\nDenote by {χi }i∈I the basis of H(T 2 ) given by the coevaluation morphisms bUi , i.e. χi\nis given by the invariant of a solid torus with a single ribbon of trivial framing labelled by\nUi traversing the non-contractible cycle once, and let {χ̄i }i∈I be the dual basis. A crucial\nresult is given by the following\nP\nProposition 1 The modular invariant torus partition function Z(A) = i,j∈I Zij (A)χi ⊗\nχ̄j corresponding to a symmetric special Frobenius algebra A, of a rational CFT based on\nthe modular tensor category C, is given by\nZij (A) = dimC Hom(EAl (Ui ), Uj )\nProof: This follows immediately from eq. (2.49) and proposition 3.6 of [FrFRS1].✷\nWe will often drop the reference to A and simply write Zij for the coefficients.\n\n10\n\n(13)\n\n\fRemark 3\n• It follows from the discussion in section 3.3 of [FrFRS2] that if A and B\nare two Morita equivalent symmetric special Frobenius algebras in C, then Zij (A) =\nZij (B). Combining the same discussion with the uniqueness result of [FjFRS2]\nimplies that two rational CFT's based algebras A and B in the same modular category\nC are equivalent (see [FjFRS2] for the definition of equivalence) if and only if A and\nB are Morita equivalent. It is, however, not excluded at this point that there may\nexist two non-Morita equivalent algebras with the same torus partition function.\n• In the CFT litterature, including [FRS1, FrFRS1], it is conventional to express the\ntorus partition functions in a different basis, namely {χi ⊗ χ̃j }i,j∈I , where χ̃j ≡ χ̄j̄ .\nThus what here appears as the identity matrix is in the CFT litterature the matrix\nCij ≡ δi,j̄ , the charge conjugation matrix, and the partition function is referred to\nas the charge conjugation modular invariant. For our purposes it is convenient to\nidentify the partition function with an endomorphism of the corresponding space of\nconformal blocks, and it is therefore more convenient to have the identity endomorphism being represented by the identity matrix.\nFinally, the following result will be useful.\nProposition 2 Let A be a symmetric special Frobenius algebra in a modular tensor category such that Zij (A)∝\n/ δij . Then there is a subobject B ≺ A with the structure of a\nsymmetric special Frobenius algebra, and such that B is Morita equivalent to a haploid\nsymmetric special Frobenius algebra C with Zij (A)∝\n/ δij .\nProof. Lemma 5.23 of [FuS] implies that A is semisimple in the sense of [Os]. If\nA is indecomposable, then the corrollary to Theorem 1 in [Os] implies that A is Morita\nequivalent to a haploid non-degenerate algebra, and thus to a haploid symmetric special\nFrobenius algebra B, and Zij (B))∝\n/ δij according to remark 3. If A is decomposable, then\nthere is a sub object A1 ≺ A with the structure of a non-degenerate algebra such that\nZij (A1 )∝\n/ δij since Z(A ⊕ B) = Z(A) + Z(B), and we apply the same argument to A1 . A\nhas only a finite number of subobjects, so the procedure will end in a haploid symmetric\nspecial Frobenius algebra C such that Zij (C)∝\n/ δij .\nAlgebras in Ck\nThe modular invariant torus partition functions of the su(2) WZW model has a wellknown ADE classification [CIZ]. The modular invariant of A type is the diagonal one\nZij = δij , which exists for all values of k. For odd k, this is also the only one, and the\nmethods described here cannot be used to analyze mapping class group representations\nwith respect to reducibility. For all even k there is another, non-diagonal, modular invariant corresponding to the D in ADE, which we will use here. Finally there are three\nexceptional cases: for k = 10, 16 and 28 there are (non-diagonal) modular invariants\ncorresponding to the E6 , E7 and E8 Dynkin diagrams. Non-degenerate algebras corresponding to D2n , E6 and E8 were constructed in [KiO], and corresponding to D2n+1 and\nE7 in [Os]. Corresponding structures in the language of nets of subfactors on the circle\nwere, however, constructed earlier in [BE1], and it is a relatively straightforward task to\ntranslate between the two languages. In particular, the object underlying an algebra is\nobtained immediately.\n11\n\n\ftype\nA\nD\nE6\nE7\nE8\n\nZij\nlevels\nalgebra object\nδij\nk ∈ Z+\n11\nnon-diagonal k ∈ 2Z+ , k ≥ 4\n11 ⊕ Uk\nnon-diagonal\nk = 10\n11 ⊕ U6\nnon-diagonal\nk = 16\n11 ⊕ U8 ⊕ U16\nnon-diagonal\nk = 28\n11 ⊕ U10 ⊕ U18 ⊕ U28\n\nTable 1: The ADE classification of modular invariant torus partition functions for the\nsu(2) WZW model. It is indicated at what levels the different types occur. For each\ntype the object underlying a simple algebra in the corresponding Morita class is given.\nThe algebra structure is unique on all but the E8 one, which nevertheless has a unique\nstructure of a commutative algebra.\n\n2\n\nReducibility of mapping class group representations\n\nWe spend the first section proving theorem 1, and in the second section we investigate in\nmore detail the consequences of this theorem in the su(2) case, concluding with a proof\nof theorem 2. Fix notation as follows:\n• Let Xg denote an extended surface of genus g with no marked points\n• For a given modular tensor category C, we denote by H(X) the vector space corresponding to the extended surface X and by Z(M) the invariant corresponding to\nthe extended cobordism M, given by the TQFT associated to C.\n\n2.1\n\nProof of theorem 1\n\nThe strategy of the proof is to use Schur's lemma. Given a special symmetric Frobenius\nalgebra with the required property, we explicitly construct an element Pg ∈ End(H(Xg ))\nin the commutant of the representation of the mapping class group, and show that Pg ∝\n/ id.\nThe proof of theorem 1 requires some preparation, and we begin by defining extended\ncobordisms whose invariants provide the elements Pg in the commutant.\nLet T be a (Poincaré) dual triangulation of a surface X, i.e. an embedding of a trivalent\ngraph in X such that the Poincaré dual graph is a triangulation of X, and let A be a\nsymmetric special Frobenius algebra in a ribbon category C. By labelling T with A\nwe mean the following: Embed a (oriented and core-oriented) ribbon graph in X such\nthat each edge between two vertices of T is covered by a ribbon labeled by A, and each\ntrivalent vertex connects three edges by one choice of planar graph with coupons labelled\nby combinations of m, ∆, ε ◦ m, or ∆ ◦ η, in such a way that any region of the graph is\nconsistently interpreted as a morphism in C with the convention of letting core-orientation\nbeing the \"upwards\" direction.\nThere are thus many consistent ways of labelling T with A, but it is not difficult to\nconvince oneself that the properties symmetry, specialness and Frobenius are enough to\nguarantee that all possible consistent labellings are equivalent, as morphisms in C. An\nactual proof can be found by combining results from [FRS1, FRS2, FjFRS1]. By equipping\n12\n\n\feach edge of T with an orientation such that the edges at any vertex are either two ingoing and one out-going, or one in-going and two out-going, there is an unambiguous way\nto label T by A, where every trivalent vertex is covered with a coupon labelled either by\nm or by ∆. In the following we will indicate a particular labelling in this way.\nDefinition 3 Let A be a symmetric, special Frobenius algebra in C, and let Xg be an\nextended surface of genus g with no marked points. Pick a dual triangulation T of Xg ,\nand consider the three-manifold M[Xg ] ≡ X × [−1, 1] equipped with the natural orientation obtained from the orientation of Xg and the interval. Define an extended cobordism\nM[Xg , A, T ] : Xg → Xg by labelling T on Xg × {0} ⊂ M[Xg ] with A. We define an element\nP [Xg , A, T ] of End(H(Xg )) by\nP [Xg , A, T ] ≡ Z(M[Xg , A, T ]).\n\n(14)\n\nProposition 3 (Proposition 3.2, [FjFRS1]) P [Xg , A, T ] is independent of the choice of\ndual triangulation T .\nProposition 4 P [Xg , A, T ] commutes with the action of the mapping class group: If ρ\ndenotes the representation on H(Xg ), we have\nP [Xg , A, T ] ◦ ρ(f ) = ρ(f ) ◦ P [Xg , A, T ]\nfor any mapping class f .\nProof.\n\nFollows immediately from Theorem 2.2 of [FjFRS1].\n\nSince P [Xg , A, T ] is independent of triangulation we will drop the T . Furthermore, when\nit is clear from the context which algebra and surface is being used, we will abuse notation\nand simply write Pg ≡ P [Xg , A]. For the remaining discussion we will choose a directed\ndual triangulation for each genus g extended surface, as shown in figure 9. As indicated, an\norientation of the edges has been chosen, allowing an unambiguous labeling of the coupon\ncovering any given vertex. Next we will see how Pg acts on a standard basis element.\n\nFigure 9: Our fix choice of dual triangulation of an extended surface of genus g = 1, resp.\ng≥2\nThe standard basis of H(Xg ) is a tuple of (non-zero) λ's given by a pants decomposition\nof Xg by viewing Xg as the boundary of a handle body Hg with an embedded ribbon\ngraph, reduced by the corresponding pants decomposition of Hg to a tree as illustrated in\nfigure 10.\nThe action of Pg on a standard basis element is given by glueing the corresponding\ncobordisms and taking the invariant. 3 In the present case, the resulting cobordism is\nagain a handlebody, but with the following ribbon graph inserted.\n3\n\nIt is obvious that the corresponding Maslov index vanishes in this simple case.\n\n13\n\n\f∨\nUp\n\nUs\nUs∨\n\nν\n\n∨\nUk\n\nUm\n\nμ\nUr\n\nγ\n\nβ\n\nUq\n\nUl\n\nUi∨\n\nUk\nα\nUj\n\nUi\n\nFigure 10: A tree graph inside a pants-decomposed handle body corresponding to the\nbasis element (λα(iι)j , λβ(jk)l , λγ(lk)m , . . . , λμ(qp)r , λν(rs)s ).\n\nFigure 11: The extended cobordism resulting from glueing M[Xg , A, T ] : Xg → Xg onto\nthe handlebody shown in figure 10. Labels are supressed.\nNote that the ribbon graph represents a morphism involving a number of projectors\nConsider a tubular section of the handle body in figure 11 containing only such\na projector. Using the representation PAl (Ui ) = ei ◦ ri we conclude\nPAl (Ui ).\n\nA\n\n∼\nA\n\nUi\n\nl (U )\nEA\ni\n\nUi\nA\n\nUi\n\nFigure 12: The projectors PAl (Ui ) inside the handlebody can be represented by a composition ei ◦ ri .\nwhere ∼ means that the invariants of two extended cobordisms differing only in the\ndepicted region, coincide. Apply this to every occurence of PAl inside the handle body, and\nslide each of the ei and rj morphisms towards the vertices of the ribbon graph. Locally,\nin a tubular section around a vertex labelled by λα(ij)k ∈ Hom(Ui ⊗ Uj , Uk ), the extended\ncobordism then takes one of the two forms shown in figure 13.\nSince the endofunctor EAl is not a tensor functor, it is not straightforward to reduce\nthe corresponding morphisms further. Note, however, that if all three objects Ui , Uj , and\nUk are the tensor unit, the morphisms correspond to those defining the multiplication and\ncomultiplication of Cl (A) (up to a factor of dim(Cl (A))/dim(A) for the comultiplication).\n\n14\n\n\fFigure 13: The two possibilities of neighbourhoods around trivalent morphisms.\nFor any g ≥ 1 we define a special element vUg ∈ H(Xg ) for all U ∈ Obj(C) (if U is simple,\nabbreviate vig ≡ vUg i ) as follows. Consider the cobordism of the type shown in figure 10\nwith all but one of the objects the tensor unit (s.t. the corresponding ribbons can be\ncompletely left out in the handle body), and all morphisms given by unit constraints\n(since we're considering a strict category, these are all identity morphisms), and take the\n\"last\" object to be U. Denote the resulting cobordism, shown in figure 14, by MUg , and\ndefine vUg to be the corresponding element of the standard basis. Note that vi1 = χi with\nthe notation used in section 1.2.\n\nU\n\nFigure 14: The cobordism representing the element vUg .\nIt follows immediately that P1 (vi1 ) is precisely vE1 l (Ui ) . When g ≥ 2, the element Pg (vi )\nA\nis represented by a ribbon graph in a handle body where, following the discussion above,\nall but one of the ribbons are labelled by Cl (A) and all but one of the coupons are labelled\nby multiplications and comultiplications of Cl (A). The \"last\" ribbon is labelled by the\nobject EAl (Ui ), and a neighbourhood of the last coupon contains a graph representing the\nfollowing morphism.\nWe are now ready to prove the theorem.\nProof of Theorem 1:\nWithout loss of generality we can assume that A is haploid. Since A gives a non-trivial\ntorus partition function, according to (13) there exists a simple object Ui s.t. EAl (Ui ) ≇ Ui\nand is also not the zero-object. Take vig ∈ H(Xg ) as above corresponding to this object.\nIf there does not exist any ζ ∈ C such that Pg (vig ) = ζvig then, since Pg commutes with ρ,\nSchur's lemma implies that ρ is reducible.\nThe element Pg (vig ) is represented by a ribbon graph in a handle body obtained by\ngluing M[Xg , A, T ] to MgUi . Represent the morphisms PAl and PAl (Ui ) as eCl (A)≺A ◦ rCl (A)≺A\nand eEAl (Ui )≺A ◦ rEAl (Ui )≺A respectively, and slide the corresponding coupons towards the\n15\n\n\fl (U )\nEA\ni\n\nl (U )\nEA\ni\n\nCl (A)\n\n(15)\n\nvertices of the ribbon graph. For g = 1, this leaves a single ribbon labelled by EAl (Ui )\nwith the endomorphism rEAl (Ui )≺A ◦ eEAl (Ui )≺A = idEAl (Ui ) , and we have P1 (vi1 ) = vE1 l (Ui )\nA\nwhich by assumption is not proportional to vi1 .\nFor g > 1 we get a ribbon graph where all but one of the ribbons are labelled by the left\ncenter Cl (A), and all but one of the coupons are labelled by either the multiplication mCl (A)\nor comultiplication ∆Cl (A) . The remaining ribbon and coupon are labelled by the object\nEAl (Ui ) resp. the morphism (15). Decompose Cl (A) in simple subobjects, and mCl (A)\nand ∆Cl (A) into the corresponding components. Since A is haploid, so is Cl (A), and the\ndecomposition therefore contains a unique component where all but one of the objects is\n11, and all but one of the morphisms are either (mCl (A) )000 id11 or (∆Cl (A) )000 id11 . According\nto (11), both of these morphisms are exactly id11 . The corresponding component of the\nmorphism (15) reduces to\nl (U )\nEA\ni\n\n11\n\nl (U )\nEA\ni\n\n(16)\nSince both A and Cl (A) are haploid, it follows that eCl (A)≺A ◦ e11≺Cl (A) = ξη for some\nξ ∈ C× . Left unitality of A, together with the identity rEAl (Ui )≺A ◦ eEAl (Ui )≺A = idEAl (Ui ) ,\nimplies that (16) is just ξidEAl (Ui ) . The induced decomposition of Pg (vig ) thus contains\na term ξvEg l (Ui ) , which by assumption is not proportional to vig . The uniqueness of the\nA\ncomponent considered above in the decomposition implies that Pg (vig ) − ξvEg l (Ui ) is either\nA\nzero or linearly independent of {vEg l (Ui ) , vig }, and Pg (vig ) is therefore not proportional to\nA\nvig . We have thus shown that Pg is not proportional to the identity. ✷\n\n16\n\n\f2.2\n\nExamples\n\nThere is a rather extensive list of known modular invariants (coefficients Zij related to\nsome modular category) in the litterature, so there is potentially a similar list of TQFT's\nwith reducible mapping class group representations according to theorem 1. One aspect,\nhowever, keeps us from immediately drawing this conclusion. The theorem states that\nthe modular invariant Zij must arise from a symmetric special Frobenius algebra, which\naccording to [FjFRS1, FjFRS2] is equivalent to saying that the coefficients Zij arise as the\ncoefficients of the torus partition function in some (open/closed) rational conformal field\ntheory. This is certainly not known for a large set of modular invariants. As mentioned\nin the introduction, there is a large class of modular invariants that are known to be\nrealised in terms of symmetric special Frobenius algebras, the simple curent invariants.\nIt's important to point out that there are slightly different notions of simple current\ninvariants in the litterature, and the relevant notion for this discussion is that presented\n(and completely classified) in [KrS]. It was shown in [FRS3] that there is a symmetric\nspecial Frobenius algebra realising every such simple current invariant. We briefly discuss\nthe cases listed in the corollary to theorem 1.\nFor the SU(2) theories we refer to the next section. For SU(3), Ocneanu has announced [Oc] that all modular invariants (which are completely classified) have been\nrealised in terms of Q-systems in the subfactor language. It is interesting to note that\nthere exist non-trivial torus partition functions for all levels greater than or equal to 3\nin the SU(3) case [G]. The series of SU(N) models appear in the corollary due to the\nappearance of simple current invariants and the result discussed above. In addition Qsystems have been constructed corresponding to simple current invariants for SU(N),\nsee [BE2].\nApart from these examples one should mention that all modular invariants of the unitary\nminimal models have been realised [BE2], as have those for the rational extended U(1)\ntheories [FRS1]. In addition, a number of modular invariants in theories corresponding\nto quantum doubles of the finite groups S3 and Z/nZ are realised in [EP].\nApart from the models listed above, all modular invariants have been found for the (A1 +\n(1)\n(1)\n(1)\nA1 )(1) series, the (U(1) + . . . + U(1))(1) series, and for Ar , Br , and Dr for all ranks\nand levels k ≤ 3. In the light of theorem 1, quantum representations in TQFT's based on\nthese affine algebras are expected to be generically reducible for all genus.\n\n2.3\n\nThe su(2) Case\n\nThe structures that allow us to efficiently investigate how the representations decompose\nin explicit examples are those of direct sum and tensor product of algebras in C.\nDefinition 4 Let A ≡ (A, mA , ηA ) and B ≡ (B, mm , ηB ) be algebras in C.\n• The tensor product A ⊠ B of A and B is the algebra (A ⊗ B, (mA ⊗ mB ) ◦ (idA ⊗\ncB,A ⊗ idB ), ηA ⊗ ηB )\n• The direct sum A ⊞ B of A and B is the algebra (A ⊞ B, mA⊕B , ηA⊞B ), where\nmA⊞B = eA≺A⊕B ◦ mA ◦ (rA≺A⊕B ⊗ rA≺A⊕B ) + eB≺A⊕B ◦ mB ◦ (rB≺A⊕B ⊗ rB≺A⊕B )\nand ηA⊞B = eA≺A⊕B ◦ ηA ◦ rA≺A⊕B + eB≺A⊕B ◦ ηB ◦ rB≺A⊕B\n17\n\n\fIt is straightforward to check that the morphisms satisfy the required properties of associativity and unitality. The corresponding definitions for coalgebras are analogous, with\nthe coproduct of A ⊠ B being (idA ⊗ c−1\nA,B ⊗ idB ) ◦ (∆A ⊗ ∆B ). With these definitions\nfor algebras and coalgebras, the tensor product and direct sum of two Frobenius algebras is again Frobenius, and the same holds for the properties (normalized) special and\nsymmetric.\nRemark 4 Note that the braiding gives two possible structures of multiplication and comultiplication on the object A ⊗ B, we have simply chosen one for each such that the\nFrobenius and special properties are preserved.\nThe following proposition follows from a straightforward generalisation of proposition 5.3\nof [FRS1].\nProposition 5\na) Pg [A ⊠ B] = Pg [A] ◦ Pg [B]\nb) Pg [A ⊞ B] = Pg [A] + Pg [B]\nEquation 3.37 of [FrFRS2] can be specialized to the following\nProposition 6 Let A and B be two Morita equivalent symmetric special Frobenius algebras in C, then\nPg [A] = γ −χ(Xg )/2 Pg [B]\nwhere γ = dim(B)/ dim(A). In particular we have Zij (A) = Zij (B).\nThe next result has been announced in [FRS1].\nProposition 7 Let ∼ denote Morita equivalence, and let A, A′ , B, B ′ be algebras in C\nsuch that A ∼ A′ , B ∼ B ′ . Then\na) A ⊠ B ∼ A′ ⊠ B ′\nb) A ⊞ B ∼ A′ ⊞ B ′\nProof. Follows straightforwardly from the definition of a Morita context in terms of\ninterpolating bimodules.\nIf [A] indicates the Morita class of A we have in other words that [A ⊠ B] = [A′ ⊠ B ′ ] and\n[A ⊞ B] = [A′ ⊞ B ′ ]. The properties simple, special, symmetric and Frobenius are stable\nunder Morita equivalence, as stated in\nProposition 8 Let A be a simple symmetric special Frobenius algebra in C, then any\nalgebra in [A] is also simple symmetric special Frobenius.\nProof.\n\nFollows from Proposition 2.13 in [FRS2]\n\nFinally, we recall a corollary from [Os]\n\n18\n\n\fProposition 9 Any simple symmetric special Frobenius algebra in C is Morita equivalent\nto a Haploid algebra.\nUsing these results we introduce a structure of a unital rig on the set of Morita classes\nof symmetric special Frobenius algebras in C.\nDefinition 5 The Frobenius rig FC of C is the rig generated by the set\n{[A]|A is a simple special Frobenius algebra}\nwith\n• addition: [A] + [B] ≡ [A ⊞ B]\n• multiplication: [A] × [B] ≡ [A ⊠ B]\n• unit: [11]\nRemark 5\n(i) A closely related concept for subfactors was introduced in [EP] under the name fusion\nof modular invariants. The name makes sense since, as we shall see later, at least\nin the su(2) case, all the information of this rig can be found in the coefficients Zij .\n(ii) Checking the necessary properties of the addition and multiplication requires checking\nthat the bicategory Bim(C) of symmetric special Frobenius algebras, with morphism\ncategories the categories of bimodules, is a monoidal semisimple bicategory. We\nrefer to a later publication for the proof [FjS].\n(iii) By the Grothendieck construction, the rig FC becomes a ring. This ring has some\nright to be called the Grothendieck ring of Bim(C), although that notion for a bicategory has been used for a different structure.\nIf it happens that the modular invariant torus partition functions, Zij (A), with Z00 (A) = 1\nare in bijection with the Morita classes of simple symmetric Frobenius algebras in C, then\nfrom the propositions above it follows that the matrices Zij (A) for different A form a\nfaithful matrix representation of FC .\nBy classifying module categories over the categories Ck , the Morita classes of simple symmetric special Frobenius algebras were classified in [KiO, Os]. The result is in precise\nagreement with the ADE classification of modular invariant torus partition functions in\n[CIZ], so FCk can be determined from Zij (A) for different A. Denote the Morita classes\nof algebras of types A, D, E by [A], [D], [E]. The rig FCk is then commutative, has [A]\nas unit, and takes the following form [EP].\n\n• k = 0 mod 4: [D] × [D] = 2[D]\n• k = 2 mod 4: [D] × [D] = [A]\n19\n\n\f• k = 10: [D] × [E] = [E], [E] × [E] = 2[E]\n• k = 16: [D] × [E] = 2[E], [E] × [E] = [D] + [E]\n• k = 28: [D] × [E] = 2[E], [E] × [E] = 4[E]\nThe propositions above, together with the structure of FCk , prove the following\nProposition 10 In the category Ck , let Dand E denote the simple symmetric special\nFrobenius algebras corresponding to the D-type resp. E-type modular invariant torus partition functions as given in table 1. Let dD and dE be the (non-zero) quantum dimensions\nof the underlying objects. For any genus g, the endomorphisms Pg satisfy\n\u0001−χ(Xg )/2\nPg [D] ◦ Pg [D] = 2d−1\n2Pg [D]\nfor k = 0 mod 4\n(17)\nD\nχ(Xg )\n\nPg [D] ◦ Pg [D] = dD\n\nidH(Xg )\n\nfor k = 2 mod 4\n\n(18)\n\nfor k = 10\n\n(19)\n\nfor k = 16\n\n(20)\n\nfor k = 28\n\n(21)\n\nχ(Xg )/2\n\nPg [D] ◦ Pg [E] = dD\n\nPg [E]\n\u0001\n−1 −χ(Xg )/2\n\nPg [E] ◦ Pg [E] = 2dE\n\n2Pg [E]\n\n\u0001−χ(Xg )/2\nPg [D] ◦ Pg [E] = 2d−1\n2Pg [E]\nD\n\u0003\n\u0002\n−χ(Xg )/2\n(Pg [D] + Pg [E])\nPg [E] ◦ Pg [E] = (dD + dE )d−2\nE\n\u0001\n−χ(Xg )/2\nPg [D] ◦ Pg [E] = 2d−1\n2Pg [E]\nE\n\u0001\n−χ(X\n)/2\ng\n4Pg [E]\nPg [E] ◦ Pg [E] = 4d−1\nE\nWhen k = 0 mod 4, the endomorphisms\nΠg,k,D\n+\nΠg,k,D\n−\n\n≡\n\n2d−1\nD\n\n\u0001χ(Xg )/2\n2\n\n≡ idH(Xg ) −\n\nPg [D]\n\n(22)\n\nPgD+\n\nare idempotent. For k = 2 mod 4, corresponding idempotents are defined by\n\u0011\n1\u0010\n−χ(Xg )/2\nΠg,k,D\n≡\nid\n±\nd\nP\n[D]\n.\ng\nH(Xg )\n±\nD\n2\n\n(23)\n\nFurthermore, since Pg [D] is not proportional to the identity, the rank of Πg,k,D\ndoes not\n±\nvanish for any g ≥ 1 and k ∈ 2Z+ .\nFor k = 10, 16, 28 there are additional idempotents given by\n\u0001χ(Xg )/2\n2d−1\ng,10,E\nE\nΠ+\n≡\nPg [E]\nfor k = 10\n(24)\n2\ng,10,E\ng,10,E\nΠ−\n≡ idH(Xg ) − Π+\n\u0001χ(Xg )/2 \u0010\u0010\n\u0011\n\u0011\np\n2d−1\nD\ng,16,E\n16γ + γ 2 − γ/4 Πg,16,D\n+\nP\n[E]\nΠ+\n≡ p\ng\n+\nfor k = 16\n(25)\n16γ + γ 2\nΠg,16,E\n≡ idH(Xg ) − Πg,16,E\n−\n+\n\u0001\n−1 χ(Xg )/2\n4dE\nPg [E]\nΠg,28,E\n≡\n+\n4\nΠg,28,E\n≡ idH(Xg ) − Πg,28,E\n−\n+\n\nfor k = 28\n\n20\n\n(26)\n\n\f\u0003−χ(Xg )/2\n\u0002\n. Similarly as above we conclude that Πg,10,E\nand Πg,28,E\nwhere γ = (dD + dE )d−2\n±\n±\nE\ndo not have vanishing rank. An explicit check confirms that also the ranks of Πg,16,E\nare\n±\nnon-vanishing. Using proposition 10 it is easily shown that\nΠg,k,D\nΠg,k,E\n= Πg,k,E\n+\n+\n\n(27)\n\nfor k = 10, 16, 28. Furthermore, explicit calculations confirm that Πg,k,D\nΠg,k,E\nhas non+\n−\nvanishing rank for the same values of k.\nCombining these results, we have shown theorem 2.\nRemark 6 It is true that theorem 1 and the methods used in the proof already imply\nthat the representations considered in theorem 2 decompose in direct sums of two subrepresentations. Theorem 2 contains more information than this, however. First, it shows\nthe non-trivial decomposition in three sub-representations in the presence of the exceptional\nseries of algebras. Second, the projectors allow us to determine the dimensions of the\nsubrepresentations. It is for instance straightforward to determine the dimensions of the\nsub-representations. As a simple example we get dim(V+1,4n,D ) = n+1, dim(V−1,4n,D ) = 3n,\ndim(V+1,4n+2,D ) = n + 1, dim(V+1,4n,D ) = 3n + 2, dim(V−1,10,E ) = 5, dim(W 1,10 ) = 3.\n\nReferences\n[A1] J. E. Andersen. Asymptotic faithfulness of the quantum SU(n) representations of\nthe mapping class groups. Ann. of Math. (2), 163(1):347–368, 2006.\n[A2] J. E. Andersen. Mapping class groups do not have Kazhdan's property (T).\narXiv:math.QA/0706.2184.\n[A3] J. E. Andersen. Toeplitz operators and Hitchin's connection. In The many facets of\ngeometry: A tribute to Nigel Hitchin. Oxford University Press. To appear (2008).\n[ADW] S. Axelrod, S. Della Pietra and E. Witten, Geometric quantization of Chern\nSimons gauge theory, J.Diff.Geom. 33 (1991) 787–902.\n[AM] J. E. Andersen & G. Masbaum, Involutions on moduli spaces and refinements of\nthe Verlinde formula, Math. Ann. 314(2), 291–326 (1999).\n[At] M. Atiyah, Topological Quantum Field Theories, Inst. Hautes Etudes Sci. Publ.\nMath. 68 (1989) 175.\n[Ba] P. Bantay, The kernel of the modular representation and the Galois action in RCFT,\nCommun. Math. Phys. 233 (2003) 423 [arXiv:math/0102149].\n[Bl] C. Blanchet, A spin decomposition of the Verlinde formulas for type A modular categories, Comm. Math. Phys. 257 (2005), no. 1, 1–28.\n[BE1] J. Böckenhauer and D. E. Evans, Modular invariants, graphs and alphainduction for nets of subfactors. II, Commun. Math. Phys. 200 (1999) 57\n[arXiv:hep-th/9805023].\n\n21\n\n\f[BE2] J. Böckenhauer and D. E. Evans, Modular invariants, graphs and alphainduction for nets of subfactors. III, Commun. Math. Phys. 205 (1999) 183\n[arXiv:hep-th/9812110].\n[BHMV1] C. Blanchet, N. Habegger, G. Masbaum & P. Vogel, \"Three-manifold invariants\nderived from the Kauffman Bracket.\" Topology 31 (1992), 685-699.\n[BHMV2] C. Blanchet, N. Habegger, G. Masbaum & P. Vogel, \"Topological Quantum\nField Theories derived from the Kauffman bracket.\" Topology 34 (1995), 883-927.\n[CG] A. Coste and T. Gannon, Congruence subgroups and rational conformal field theory,\n[arXiv:math/9909080].\n[CK] Q. Chen and T. Kerler, Higher Rank TQFT Representations of SL(2, Z) are Reducible, [arXiv:0706.3734].\n[CIZ] A. Cappelli, C. Itzykson and J. B. Zuber, The ADE Classification of Minimal and\nA1(1) Conformal Invariant Theories, Commun. Math. Phys. 113 (1987) 1.\n[EP] D. E. Evans and P. R. Pinto, Subfactor realisation of modular invariants, Commun.\nMath. Phys. 237 (2003) 309, [arXiv:math/0309174].\n[FRS1] J. Fuchs, I. Runkel and C. Schweigert, TFT construction of RCFT correlators. I:\nPartition functions, Nucl. Phys. B 646 (2002) 353 [arXiv:hep-th/0204148].\n[FRS2] J. Fuchs, I. Runkel and C. Schweigert, TFT construction of RCFT correlators.\nII: Unoriented world sheets, Nucl. Phys. B 678 (2004) 511 [arXiv:hep-th/0306164].\n[FRS3] J. Fuchs, I. Runkel and C. Schweigert, TFT construction of RCFT correlators.\nIII: Simple currents, Nucl. Phys. B 694 (2004) 277 [arXiv:hep-th/0403157].\n[FjFRS1] J. Fjelstad, J. Fuchs, I. Runkel and C. Schweigert, TFT construction of RCFT\ncorrelators. V: Proof of modular invariance and factorisation, Theor. Appl. Categor.\n16 (2006) 342 [arXiv:hep-th/0503194].\n[FjFRS2] J. Fjelstad, J. Fuchs, I. Runkel and C. Schweigert, Uniqueness of open/closed\nrational CFT with given algebra of open states, to appear in Adv.Theor.Math.Phys.\nvol.12, issue 6, 2008, [arXiv:hep-th/0612306].\n[FrFRS1] J. Fröhlich, J. Fuchs, I. Runkel and C. Schweigert, Correspondences of ribbon\ncategories, Adv. Math. 199 (2006) 192 [arXiv:math/0309465].\n[FrFRS2] J. Fröhlich, J. Fuchs, I. Runkel and C. Schweigert, Duality and defects in rational conformal field theory, Nucl. Phys. B 763 (2007) 354 [arXiv:hep-th/0607247].\n[FjS] J. Fjelstad and U. Schreiber, work in progress.\n[FrS] D. Friedan and S. H. Shenker, The Analytic Geometry of Two-Dimensional Conformal Field Theory, Nucl. Phys. B 281 (1987) 509.\n[FuS] J. Fuchs and C. Schweigert, Category theory for conformal boundary conditions,\n[arXiv:math/0106050].\n22\n\n\f[G] T. Gannon, The Classification of affine SU(3) modular invariant partition functions,\nCommun. Math. Phys. 161 (1994) 233 [arXiv:hep-th/9212060].\n[GQ] D. Gepner and Z. a. Qiu, Modular Invariant Partition Functions for Parafermionic\nField Theories, Nucl. Phys. B 285 (1987) 423.\n[H] N. Hitchin, Flat connections and geometric quantization, Comm.Math.Phys., 131\n(1990) 347–380.\n[KrS] M. Kreuzer and A. N. Schellekens, Simple currents versus orbifolds with discrete torsion: A Complete classification, Nucl. Phys. B 411 (1994) 97 [arXiv:hep-th/9306145].\n[KiO] A. J. Kirillov and V. Ostrik, On q-analog of McKay correspondence and ADE\nclassification of sl(2) conformal field theories, [arXiv:math/0101219].\n[MS] G. Moore and N. Seiberg, Classical and quantum conformal field theory, Comm.\nMath. Phys. 123 (1989), 177 – 254.\n[Oc] A. Ocneanu, The classification of subgroups of quantum SU(N).\n[Os] V. Ostrik, Module categories, weak Hopf algebras and modular invariants\n[arXiv:math/0111139].\n[R] J. Roberts, Irreducibility of some quantum representations of mapping class groups,\n[arXiv:math/9909128v1]\n[RT1] N. Reshetikhin and V. Turaev, Ribbon graphs and their invariants derived fron\nquantum groups, Comm. Math. Phys. 127 (1990), 1–26.\n[RT2] N. Reshetikhin and V. Turaev, Invariants of 3-manifolds via link polynomials and\nquantum groups, Invent. Math. 103 (1991), 547–597.\n[S] G. B. Segal, The Definition of Conformal Field Theory, In COMO 1987, proceedings,\nDifferential Geometrical Methods in Theoretical Physics 165-171.\n[T] V. G. Turaev, Quantum invariants of knots and three manifolds, De Gruyter Stud.\nMath. 18 (1994) 1.\n[V] E. Verlinde, Fusion rules and modular transformations in 2D conformal field theory,\nNuclear Phys. B 300 (1988), no. 3, 360–376.\n[W] E. Witten, Quantum field theory and the Jones polynomial., Commun. Math. Phys\n121 (1989) 351–98.\n\n23\n\n\f"}