{"id": "http://arxiv.org/abs/1007.2571v2", "guidislink": true, "updated": "2010-11-29T14:29:21Z", "updated_parsed": [2010, 11, 29, 14, 29, 21, 0, 333, 0], "published": "2010-07-15T14:25:18Z", "published_parsed": [2010, 7, 15, 14, 25, 18, 3, 196, 0], "title": "Perturbations in Matter Bounce with Non-minimal Coupling", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1007.1157%2C1007.0109%2C1007.3424%2C1007.1996%2C1007.1019%2C1007.0198%2C1007.0865%2C1007.4655%2C1007.0740%2C1007.0202%2C1007.5222%2C1007.2001%2C1007.0288%2C1007.2614%2C1007.0354%2C1007.1169%2C1007.4787%2C1007.2556%2C1007.1417%2C1007.0264%2C1007.2488%2C1007.3085%2C1007.3089%2C1007.2520%2C1007.1462%2C1007.2297%2C1007.2418%2C1007.4933%2C1007.1298%2C1007.4628%2C1007.4259%2C1007.2901%2C1007.3428%2C1007.1385%2C1007.3762%2C1007.2551%2C1007.4412%2C1007.2365%2C1007.5400%2C1007.3025%2C1007.2098%2C1007.0287%2C1007.1457%2C1007.0995%2C1007.4543%2C1007.3660%2C1007.2655%2C1007.2320%2C1007.1056%2C1007.1386%2C1007.2516%2C1007.1382%2C1007.1838%2C1007.4495%2C1007.0460%2C1007.3363%2C1007.0142%2C1007.4285%2C1007.3030%2C1007.1196%2C1007.1699%2C1007.4736%2C1007.1793%2C1007.0104%2C1007.3659%2C1007.1739%2C1007.2276%2C1007.4481%2C1007.2991%2C1007.0979%2C1007.1203%2C1007.1631%2C1007.4312%2C1007.3422%2C1007.1992%2C1007.1253%2C1007.4043%2C1007.0725%2C1007.0384%2C1007.1811%2C1007.2424%2C1007.2255%2C1007.2972%2C1007.1557%2C1007.1013%2C1007.2755%2C1007.1044%2C1007.1980%2C1007.4716%2C1007.3977%2C1007.1571%2C1007.5297%2C1007.5244%2C1007.0904%2C1007.0732%2C1007.0840%2C1007.0720%2C1007.0275%2C1007.2571%2C1007.3520%2C1007.0189&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Perturbations in Matter Bounce with Non-minimal Coupling"}, "summary": "In this paper, we investigate the perturbations in matter bounce induced from\nLee-Wick lagrangian with the involvement of non-minimal coupling to the\nEinstein Gravity. We find that this extra non-minimal coupling term can cause a\nred-tilt on the primordial metric perturbation at extremely large scales. It\ncan also lead to large enhancement of reheating of the normal field particles\ncompared to the usual minimal coupling models.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1007.1157%2C1007.0109%2C1007.3424%2C1007.1996%2C1007.1019%2C1007.0198%2C1007.0865%2C1007.4655%2C1007.0740%2C1007.0202%2C1007.5222%2C1007.2001%2C1007.0288%2C1007.2614%2C1007.0354%2C1007.1169%2C1007.4787%2C1007.2556%2C1007.1417%2C1007.0264%2C1007.2488%2C1007.3085%2C1007.3089%2C1007.2520%2C1007.1462%2C1007.2297%2C1007.2418%2C1007.4933%2C1007.1298%2C1007.4628%2C1007.4259%2C1007.2901%2C1007.3428%2C1007.1385%2C1007.3762%2C1007.2551%2C1007.4412%2C1007.2365%2C1007.5400%2C1007.3025%2C1007.2098%2C1007.0287%2C1007.1457%2C1007.0995%2C1007.4543%2C1007.3660%2C1007.2655%2C1007.2320%2C1007.1056%2C1007.1386%2C1007.2516%2C1007.1382%2C1007.1838%2C1007.4495%2C1007.0460%2C1007.3363%2C1007.0142%2C1007.4285%2C1007.3030%2C1007.1196%2C1007.1699%2C1007.4736%2C1007.1793%2C1007.0104%2C1007.3659%2C1007.1739%2C1007.2276%2C1007.4481%2C1007.2991%2C1007.0979%2C1007.1203%2C1007.1631%2C1007.4312%2C1007.3422%2C1007.1992%2C1007.1253%2C1007.4043%2C1007.0725%2C1007.0384%2C1007.1811%2C1007.2424%2C1007.2255%2C1007.2972%2C1007.1557%2C1007.1013%2C1007.2755%2C1007.1044%2C1007.1980%2C1007.4716%2C1007.3977%2C1007.1571%2C1007.5297%2C1007.5244%2C1007.0904%2C1007.0732%2C1007.0840%2C1007.0720%2C1007.0275%2C1007.2571%2C1007.3520%2C1007.0189&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this paper, we investigate the perturbations in matter bounce induced from\nLee-Wick lagrangian with the involvement of non-minimal coupling to the\nEinstein Gravity. We find that this extra non-minimal coupling term can cause a\nred-tilt on the primordial metric perturbation at extremely large scales. It\ncan also lead to large enhancement of reheating of the normal field particles\ncompared to the usual minimal coupling models."}, "authors": ["Taotao Qiu", "Kwei-Chou Yang"], "author_detail": {"name": "Kwei-Chou Yang"}, "author": "Kwei-Chou Yang", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1475-7516/2010/11/012", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1007.2571v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1007.2571v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "15 pages, 4 figures", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1007.2571v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1007.2571v2", "journal_reference": "JCAP 1011:012,2010", "doi": "10.1088/1475-7516/2010/11/012", "fulltext": "Perturbations in Matter Bounce with Non-minimal Coupling\nTaotao Qiu∗ and Kwei-Chou Yang\nDepartment of Physics, Chung-Yuan Christian University, Chung-li, Taiwan 320\n\narXiv:1007.2571v2 [astro-ph.CO] 29 Nov 2010\n\nIn this paper, we investigate the perturbations in matter bounce induced from Lee-Wick lagrangian\nwith the involvement of non-minimal coupling to the Einstein Gravity. We find that this extra nonminimal coupling term can cause a red-tilt on the primordial metric perturbation at extremely large\nscales. It can also lead to large enhancement of reheating of the normal field particles compared to\nthe usual minimal coupling models.\nPACS numbers:\n\nI.\n\nINTRODUCTION\n\nNon-singular bouncing cosmology [1] has become one of the important alternative scenarios of inflation [2] as a\ndescription of the early universe. In terms of a bounce scenario, the universe travels from a contracting phase to an\nexpanding phase through a non-vanishing minimal size, avoiding the singularity problem which plagues the Standard\nBig Bang theory [3] or inflationary theory [4]. Moreover, a bounce can occur much below the Planck scale, eliminating\nthe \"Transplanckian\" problem of which the wavelength of the fluctuation mode we see today will be even smaller than\nPlanck scale and thus in \"the zone of ignorance\" where high energy effects are robust and Einstein equations might\nbe invalid [5]. In bounce models, fluctuations were generated in contracting phase and transferred into expanding\nphase through bouncing point, which can give rise to a scale invariant power spectrum as expected by the current\nobservational data [6]. In order to connect the perturbations in contracting phase and expanding phase at the crossing\npoint, the joint condition of Hwang-Vishniac [7] (Deruelle-Mukhanov [8]) can be applied. Besides, bouncing scenario\ncan also be originated from non-relativistic gravity theories [9] and give rise to gravitational waves with running\nsignature and large non-Gaussianities [10].\nIn the previous studies, a kind of \"matter bounce\" has been proposed where before and after the bounce, the universe\ncould behave as non-relativistic matter. This scenario can be realized by a kind of \"Lee-Wick\" (LW) Lagrangian which\ncontains higher derivatives of the field, or equivalently by two scalar fields with an opposite sign of potential. This\nscenario can give rise to scale invariant power spectrum at large scales, which is consistent with the data [11]. However,\none may expect that there are some non-minimal couplings of the matter in the universe to Einstein Gravity in the\nearly universe [33]. In fact, it is argued that the existence of the non-minimal coupling term is required by the quantum\ncorrections and renormalization [12] in quantum gravity in curved space-time. This effect may, by means of modifying\nEinstein equations, alter the previous result and leave some signals on the power spectrum that can be detected by\nobservations such as CMB analysis. The non-minimal coupling can also be reduced from higher dimensional theories\nsuch as brane theory and can get rid of the Big Bang Singularity, which lead to a bouncing universe [18], or lead to\nthe cosmic acceleration, which can be utilized as inflaton in the early time [19] and dark energy at current epoch [20].\nThis paper aims at investigating the perturbations in the matter bounce model involving the non-minimal coupling.\nThe paper is organized as follows: we first review the model of matter bounce in Sec. II. After that, in Sec. III we\ntake the non-minimal coupling term into account. We investigate the perturbation through the process in detail, and\nshow the solutions for each stage. We also analyze the particle production due to the resonance. All the analytical\ncalculations are done with help of numerical computations. Finally Sec. IV contains conclusions and discussions.\nII.\n\nREVIEW OF THE MATTER BOUNCE MODEL\n\nIn this section, we will start with the matter bounce model carried out in [11]. This model consists of a single scalar\nfield with a high derivative term of a minus sign. Due to this term, the equation of state (EoS) w is possible to go down\nbelow −1 and violates the null energy condition, which behaves as a \"Quintom\" matter [21] and makes it possible to\nrealize a bounce. It is useful to have such a term added in the lagrangian. For example, in the well known Lee-Wick\ntheory which was constructed by T.D. Lee and G. C. Wick [22] (see also [23] for the extensive \"Lee-Wick standard\nmodel\" ), the higher derivative term is used to cancel the quadratic divergence of the Higgs mass and thus address the\n\n∗\n\nqiutt@mail.ihep.ac.cn\n\n\fCYCU-HEP-10-07\n\n2\n\n\"hierarchy problem\". It is also possible to construct an ultraviolet complete theory which preserves Lorentz invariance\nand unitarity in terms of Lee-Wick theory [24].\nWe begin with the Lagrangian in our model to be in the form:\nL=\n\n1\n1\n1\n(∂ 2 φ̂)2 − m2 φ̂2 − V (φ̂) ,\n∂μ φ̂∂ μ φ̂ −\n2\n2M 2\n2\n\n(1)\n\nwhere m is the mass of the scalar field φ̂ and V (φ̂) is the potential. A higher derivative term with minus sign is\nintroduced with some new mass scale M . For the Higgs sector of Lee-Wick theory, the hierarchy problem is solved if\nwe require that M ≫ m. After some field rotations, one can write down the effective Lagrangian:\nL=\n\n1\n1\n1\n1\n∂μ φ∂ μ φ − ∂μ φ̃∂ μ φ̃ + M 2 φ̃2 − m2 φ2 − V (φ, φ̃) ,\n2\n2\n2\n2\n\n(2)\n\nwhere φ̃ is some auxiliary field and φ is defined as φ ≡ φ̂ + φ̃ [34]. Here the mass matrix of the fields has been\ndiagonalized due to the rotation. Usually there may be some interaction terms between the two fields, or some higher\norder self-interaction terms like φ4 , φ̃4 , φ2 φ̃2 and so on, but here for simplicity and without losing generality, we will\nhave all of them ignored by setting V (φ, φ̃) = 0. In framework of Friedmann-Robertson-Walker (FRW) metric,\nds2 = dt2 − a(t)2 dx2 ,\n\n(3)\n\nit is easy to get the Friedmann equation as:\nH2 =\n\nκ2 \u0002 1 2 1  ̇ 2 1 2 2 1 2 2 \u0003\nφ̇ − φ̃ + m φ − M φ̃ ,\n3 2\n2\n2\n2\n\n(4)\n\nwhere κ2 ≡ 8πG, and the equations of motion of the two fields are\n\nφ̈ + 3H φ̇ + m2 φ = 0 ,\nφ̃ ̈ + 3H φ̃ ̇ + M 2 φ̃ = 0 ,\n\n(5)\n\nrespectively.\nLet us now take a close look at how the model works to give rise to a bouncing scenario. The bounce happens by\nthe conditions H = 0 and Ḣ > 0, which requires that the total energy density vanish at some point in the universe\nevolution. Starting off in the contracting phase, both the two fields φ and φ̃ oscillate around the extrema of their\npotential with a growing amplitude due to the anti-friction of the negative Hubble parameter. Therefore, the energy\ndensities of both fields will grow as a−3 (t), which behaves like non-relativistic matter. Note that the energy density\nof φ̃ is negative and its growth will cancel that of the total energy density of the universe. At the beginning, we\nassume that it is subdominant than that of φ, but as M ≫ m, it will grow faster and eventually catch up, canceling\nall the positive energy density with its kinetic energy overwhelming that of φ, which makes Ḣ > 0 and cause bounce\nto happen. Thus we can see that before and after the bounce, the universe can be viewed as \"matter domination\"\nwith the effective equation of state w = 0, while in the neighborhood of the bounce point, the equation of state goes\ndown to −∞ [35]. It is a good approximation to parameterize w in such a way for the following calculations.\nIn the following section, we will reinvestigate the scenario by taking into account the coupling of the field to Einstein\nGravity. We assume that the normal scalar couples to the curvature through some non-minimal coupling term such\nas 12 ξRφ2 . We will analyze in detail the evolution of the perturbations in presence of this term, including the metric\nperturbations as well as the effects on particle production. To support our analytical calculations, we will also perform\nthe numerical investigations.\nIII.\n\nADDING NON-MINIMAL COUPLING TERM TO THE LW BOUNCE\nA.\n\nbackground\n\nIn this section, we investigate the system with the inclusion of the non-minimally coupled term. Generally, we can\nmodify Lagrangian (1) in a very general form such as:\nL=\n\n1\n1\n1\n(∂ 2 φ̂)2 − m2 φ̂2 − V (φ̂) − f (R)h(φ̂) ,\n∂μ φ̂∂ μ φ̂ −\n2\n2M 2\n2\n\n(6)\n\n\fCYCU-HEP-10-07\n\n3\n\nwhere f (R) and h(φ̂) are functions of the Ricci scalar R and scalar field φ̂, respectively. By writing it in terms of φ\nand φ̃ in analogy to (2), we can always have:\nL=\n\n1\n1\n1\n1\n∂μ φ∂ μ φ − ∂μ φ̃∂ μ φ̃ + M 2 φ̃2 − m2 φ2 − V (φ, φ̃) − f1 (R)h1 (φ) − f2 (R)h2 (φ̃) ,\n2\n2\n2\n2\n\n(7)\n\nwhere f1 (R), f2 (R), h1 (φ) and h2 (φ̃) are inherited from f (R)h(φ̂) in the original Lagrangian. Usually, these functions\nare very complicated and difficult to analyze. For the sake of simplicity, we adopt a kind of parametrization form in\nwhich the coupling of φ has a very simple form such as 21 ξRφ2 with a coefficient ξ, while that of φ̃ vanishes. The\nparameterized Lagrangian is:\nZ\n\u0003\n√ \u0002 R\n1\n1\n1\n1\n1\n+ ∂μ φ∂ μ φ − ∂μ φ̃∂ μ φ̃ + M 2 φ̃2 − m2 φ2 − ξRφ2 .\n(8)\nS = d4 x −g\n2\n2κ\n2\n2\n2\n2\n2\nFrom this Lagrangian, we obtain the Einstein Equations as:\n\n\u0003\n1 − κ2 ξφ2\n1\n1 2 1\n1\nGμν = gμν [ φ̇2 − φ̃ ̇ + m2 φ2 − M 2 φ̃2 −∇μ φ∇ν φ+∇μ φ̃∇ν φ̃−2ξgμν (φ̇2 +φ✷φ)+2ξ(∇μ φ∇ν φ+φ∇μ ∇ν φ) ,\n2\nκ\n2\n2\n2\n2\n(9)\nand the equations of motion of φ and φ̃:\nφ̈ + 3H φ̇ + m2 φ + ξRφ = 0 ,\n ̈\n ̇\nφ̃ + 3H φ̃ + M 2 φ̃ = 0 ,\n\n(10)\n\nrespectively. In deriving these equations we have made use of the definition R ≡ g μν Rμν = 6(Ḣ + 2H 2 ).\nEq. (9) yields equation for Hubble parameter straightforwardly, which is:\nH2 =\nand the Ricci scalar is:\nR=\n\n\u0003\nκ2\n1 2 1  ̇2 1 2 2 1 2 2\nφ̇ − φ̃ + m φ − M φ̃ + 6ξHφφ̇ ,\n[\n3(1 − κ2 ξφ2 ) 2\n2\n2\n2\n\n\u0002\nκ2\n ̇ 2 − 2M 2 φ̃2 \u0003 .\n2\n2 2\n−(1\n−\n6ξ)\nφ̇\n+\n2(1\n−\n3ξ)m\nφ\n+\nφ̃\n1 − κ2 ξφ2 (1 − 6ξ)\n\n(11)\n\n(12)\n\nGenerally, the additional term will affect the background evolution by modifying the field equations. This may\nmake the analysis sophisticated and undoable. Moreover, if the modification is too large, the bounce may even be\nprevented. However, for the case of weak coupling, it is still suitable for us to preserve the bounce and take assumption\nthat the background evolution is hardly affected. Thus it will be safe to use all the results obtained in the above\nsection without losing fidelity.\nTo be more accurate, we test the background evolution numerically. We choose the parameters and initial conditions\nto be the same as in [11]. We find that up to |ξ| ∼ 0.05, the background evolution will not be affected very much\nand a bounce can still happen. But there may be a little difference, where the universe may enter into a small stage\nwith w ≃ −1 before bounce, as have been shown in Fig. 1. This is easy to understand from the field equation. In\nthe additional term, ξR can be viewed as an effective correction to the original mass squared m2 . At the initial stage\nwhere R is not very large, the correction is negligible, and the field evolves as it does without the additional term.\nBut as the universe evolves like pressureless matter, R will get larger and larger. When the Hubble parameter is\nabout to its maximal value, H ∼ m, the second scalar φ̃ will begin to dominate the universe where Ḣ transfers from\nnegative to positive. At this moment, from the definition of R, we can see that it suddenly jumps by the amount\nof 2|Ḣ|. This behavior makes the energy density dominate the universe again for a short while, leading to w ≃ −1\nin this period. As the energy density of φ̃ grows up and totally dominates the universe, the equation of state goes\ndown to be below −1 and drives the bounce to happen. At the bouncing point where the total energy density of the\nuniverse vanishes, one can see from Fig. 1 that the equation of state goes down to negative infinity, and as stated\nbefore (in the footnote), it is not a real divergence. After the bounce, the EoS will come up to above −1 again as the\ntime reversal of the pre-bounce process.\nB.\n\nperturbation\n\nIn this section we will focus on the perturbation evolution of our model. We begin with the perturbed metric,\nds2 = a(η)2 [(1 + 2Φ)dη 2 − (1 − 2Ψ)dx2 ] ,\n\n(13)\n\n\fCYCU-HEP-10-07\n\n4\n\n0\n\n2\n\n10\n\n-1\n\n10\n1\n\n-2\n\n10\n\n-3\n\n0\n\n10\n\n-4\n\n10\n-1\n\n-5\n\nw\n\na\n-2\n\n10\n\n-6\n\n10\n\n-7\n\n10\n-3\n\n-8\n\n10\n\n-9\n\n-4\n\n10\n\n-10\n\n10\n-5\n\n-11\n\n10\n\n-12\n\n-6\n-20\n\n10\n-15\n\n-10\n\n-5\n\n0\n\n5\n\n10\n\n15\n\n20\n\n-20\n\n-15\n\n-10\n\n-5\n\n0\n\n5\n\n10\n\n15\n\n20\n\nt\n\nt\n\nFIG. 1: (Color online) Evolution of the background equation of state parameter w and scale factor a(t) in a non-minimal coupling\nmatter bounce model as a function of cosmic time t (horizontal axis). The background fields are plotted in dimensionless units\n−1\nby normalizing by the mass Mrec = 10−6 mpl , and the time axis is displayed in units of Mrec\n. The mass parameters m and\n2\nM are chosen to be m = 5.0Mrec and M = 10.0Mrec . The initial conditions are φi = −370.514Mrec , φ̇i = −6752.791Mrec\n,\n ̇\n−11\n−11\n2\nφ̃i = −4.818 × 10\nMrec , φ̃i = −8.837 × 10\nMrec .\n\nR\nin the conformal form. Here η ≡ dt\na is the conformal time, and Φ and Ψ are scalar perturbations of the metric. Note\nthat with existence of the non-minimal coupling term, Φ and Ψ are no longer equivalent. Similarly, the fields can be\nrepresented as homogeneous and fluctuation parts as:\nφ = φ0 + δφ ,\nφ̃ = φ̃0 + δ φ̃ .\n\n(14)\n\nIn the following, we will neglect the subscript \"0\" and take φ and φ̃ as background components. Then we will solve\nthe perturbed Einstein Equations to see their evolutions.\n1.\n\ngeneral solution\n\nFrom the perturbed Einstein Equation,\nδGμν = −κ2 δTμν ,\n\n(15)\n\nwe obtain the following equations for perturbation variables:\nδF\n,\nF\n\n(16)\n\n ̇\nḞ\nκ2\nHδF\n ̇ φ̃) + δF\n)Φ =\n(−φ̇δφ + φ̃δ\n+\n,\n2F\n2F\n2F\n2F\n\n(17)\n\nΦ=Ψ−\nΨ̇ + (H −\n\n)\n(\n\u0003\nκ2 m2 φ2\nF̈\nκ2 \u0002 2\nḞ\n2\n2\nΨ\n(φ̇ + 12ξHφφ̇) + 2ξ φ̇ − (2Ḣ + 3H ) −\n)Ψ̇ +\n−\nΨ̈ + 3(H +\n2F\nF\n2F\nF\n(\n)\n ̈\n ̇\n\u0003\nδF\nk2\nḞ 2\nκ2 \u0002 φ̇2\nḞ δF\nδF 3\n2\n2\n+\n(\n(2Ḣ + 3H ) −\n+ 6ξHφφ̇) + 2ξ φ̇ + 2 +\n+\n=\n2\nF\n2\nF\n2\n2a\n2F\n2F\n2F 2\n\nκ2 m2 φ 3κ2 H φ̇\nκ2 φ̇\n ̇ ,\n+\n)δφ − ( + 2Hξφ)δφ\n(18)\nF\nF\nF 2\n\u001b\n\u001a\nk \u00012\n ̈ + 3H δφ\n ̇ +\n+ m2 + 6ξ(Ḣ + 2H 2 ) δφ\nδφ\na\n\u0002\n4ξk 2 φΨ\nk \u00012 \u0003\nΦ − 2(m2 φ + ξRφ)Φ , (19)\n= 6ξφΨ̈ + 24ξHφΨ̇ + 3φ̇Ψ̇ + 6ξHφΦ̇ + φ̇Φ̇ +\n+ 2ξφ 6(Ḣ + 2H 2 ) −\n2\na\na\n+ (\n\n\fCYCU-HEP-10-07\n\n5\n\nwhere we have defined F ≡ 1 − κ2 ξφ2 .\nSince the equations are too sophisticated and there is no hope to solve it directly, we resort to the Einstein frame\nby a conformal transformation of the metric [27]:\nĝμν = F gμν .\n\n(20)\n\nThe action (8) is then transformed into the form:\nS=\n\nZ\n\np \u0002 R̂\n\u0003\n1 1\n1 − (1 − 6ξ)κ2 ξφ2 ˆ ˆμ\n1 ˆ ˆμ\n1\n+\n∂μ φ∂ φ −\n∂μ φ̃∂ φ̃ + 2 ( M 2 φ̃2 − m2 φ2 ) .\nd4 x −ĝ\n2\n2\n2κ\n2F\n2F\nF 2\n2\n\nWe introduce two new variables, χ and χ̃, which are defined as:\nZ p\n1 − (1 − 6ξ)κ2 ξφ2\nχ ≡\ndφ ,\nF\nZ\n1\ndφ̃ ,\nχ̃ ≡\nF\n\nand rewrite the above action as:\nZ\np \u0002 R̂\n\u0003\n1\n1\n1 1\n1\nS = d4 x −ĝ\n+ ∂ˆμ χ∂ˆμ χ − ∂ˆμ χ̃∂ˆμ χ̃ + 2 ( M 2 φ̃(χ̃)2 − m2 φ(χ)2 ) .\n2κ2\n2\n2\nF 2\n2\n\n(21)\n\n(22)\n\n(23)\n\nThe perturbed metric will be:\n\nds2 = â2 (η)[(1 + 2Φ̂)dη 2 − (1 − 2Ψ̂)dx2 ] ,\n\n√\n\n(24)\n\nwhere â(η) = F a(η).\nFor the perturbed metric in Einstein Frame where the off-diagonal components of the perturbed Einstein equations\nvanishes, we have Φ̂ = Ψ̂. This can also be obtained when we consider up to the first order approximation of the\nδF\nδF\nperturbed metric, which gives Φ̂ = Φ + 2F\n, and Ψ̂ = Ψ − 2F\nwhere relation between Φ and Ψ has already been given\nin Eq. (16). Moreover, Eq. (17) gives the direct relationship between Φ̂ and the field perturbation,\n√\n3\n2F 2 (a F Φ̂)′\n′\n′\n,\n(25)\nφ δφ − φ̃ δ φ̃ = 2\nκ a[1 − (1 − 6ξ)κ2 ξφ2 ]\nwhich is convenient for us to calculate Φ̂ in Einstein frame and then transform into the original Jordan frame.\nThe equation for Φ̂ is:\nΦ̂′′ + 2 Ĥ −\n\nχ′′ \u0001 ′\nχ′′ \u0001 ′\nχ′′ \u0001\n′\n2\n2\n2\nĤ\n+\nΦ̂\n+\n2\nĤ\n−\nĤ\nΦ̂\n+\nk\nΦ̂\n=\nκ\nχ̃ δ χ̃ ,\nχ′\nχ′\nχ′\n\n(26)\n\nwhere Ĥ = â′ /â. The right-hand side (r.h.s.) of the equation is assumed to be small and negligible except at the\nbounce point. Moreover, it is also convenient to define the curvature perturbation ζ̂ in terms of Φ̂:\nζ̂ = Φ̂ +\n\nĤ2\n\nĤ\n\n− Ĥ′\n\n(Φ̂′ + ĤΦ̂) ,\n\n(27)\n\nwhich is expected to be conserved on super-Hubble scales in the inflationary universe by the condition that the entropy\nperturbations are small and (1 + w) 6= 0:\n(1 + w)ζ̂ ′ = 0 .\n\n(28)\n\nAt the next step we will solve Eq. (26) for each stage to get the perturbations Φ, Ψ and δφ, and see how it is\neffected by the non-minimal coupling term.\n\n\fCYCU-HEP-10-07\n\n6\n2.\n\ncontracting phase\n\nIn contracting phase, the universe is dominated by the normal scalar φ. Since F deos not vary significantly, we\nroughly have χ̃ ∼ φ̃ which does not play an important role in the evolution. Then by neglecting the r.h.s. of Eq. (26),\nwe consider it as a homogeneous equation. It is useful to define a new variable u ≡ âΦ̂/χ′ and rewrite Eq. (26) as:\nu′′ + (k 2 −\n\nθ′′\n)u = 0 ,\nθ\n\n(29)\n\nwhere θ = Ĥ/(âχ′ ). The solution can be split into two limits: short-wavelength (k 2 ≫ θ′′ /θ) and long-wavelength\n(k 2 ≪ θ′′ /θ) where θ′′ /θ is the potential. For the short-wavelength perturbations where the potential term can be\nneglected, we have:\nu = Ceikη + c.c. ,\n\n(30)\n\nwhere C is a constant and c.c. stands for the complex conjugate. For long-wavelength perturbations, one gets:\nZ\ndη\n).\n(31)\nu = θ(S + D\nθ2\nFrom the above argument of Φ and Ψ as well as the definition of u, one can find the solutions for perturbation variables\nin terms of u which are:\nΦ =\nΨ =\nδφ =\n\nuĤ\nuĤ ′\nF′\n(\n−\n) ,\nâ2 θ 2âF (Ĥ2 − Ĥ′ ) âθ\nuĤ ′\nF′\nuĤ\n(\n+\n) ,\nâ2 θ 2âF (Ĥ2 − Ĥ′ ) âθ\nφ′\n\nuĤ ′\n) ,\n(\nâ(Ĥ2 − Ĥ′ ) âθ\n\n(32)\n(33)\n(34)\n\nwhere in the last formula we have neglected the contribution arising from δ φ̃ in (25), and we have used the approximation χ′2 ≃ 2(Ĥ2 − Ĥ′ )/κ2 . Substituting (30) or (31) to (32), (33) and (34), we get these variables in Jordan\nframe:\n\n\n◦◦\nr\n◦\n\n ◦\nikη \n2 e\nik \u0001\nĤ\nF\nq\n+ c.c. ,\n(35)\nĤ + ◦ +\nΦ = C\n− Ĥ −\n◦ \nκ2\n2F\nâ \n\n\n2\nĤ\n− Ĥ\n\n\n◦◦\nr\n◦\n\n ◦\nikη \n2 e\nik \u0001\nĤ\nF\nq\nΨ = C\n+ c.c. ,\n(36)\nĤ + ◦ +\n− Ĥ +\n◦ \nκ2\n2F\nâ \n\n\n2 Ĥ\n− Ĥ\n◦◦\nr\n◦\nik \u0001\n2 eikη\nĤ\nq\n+ c.c.\n(37)\nδφ = C φ\nĤ + ◦ +\n2\n◦\nκ\nâ\n2 Ĥ\n− Ĥ\n\nfor the short-wavelength case, where Ĥ is the Hubble parameter in Einstein Frame and the symbol \"◦′′ denotes cosmic\ntime derivative in Einstein frame (for details see Appendix A), or\nZ\nZ\n\u0003\nH\nḞ\n2 \u00021 1\nḞ\nΦ = (\n)S + 2 D (\n+\naF dt) ̇−\naF dt ,\naF\naF 2\nκ\nF a\naF 2\nZ\n\u0003\n2 \u00021 1\nH\nS + 2D (\naF dt) ̇ ,\nΨ =\naF\nκ\nF a\nZ\n2\nφ̇\n(S − 2 D aF dt)\nδφ = −\naF\nκ\nfor the long-wavelength case. The sketch plot of fluctuation modes compared to θ′′ /θ are shown in Fig. 2.\n\n(38)\n(39)\n(40)\n\n\fCYCU-HEP-10-07\n\n7\n\n0.20\n\n0.18\n\n''\n0.16\n\n0.14\n\n0.12\n\nlarge k\n0.10\n\n0.08\n\nsmall k\n\n0.06\n\n0.04\n\n0.02\n\n0.00\n9\n\n10\n\n8.0x10\n\n1.0x10\n\n10\n\n1.2x10\n\nFIG. 2: (Color online) A sketch of the evolution of fluctuation modes compared to the potential θ′′ /θ in a bouncing universe.\nThe vertical axis is co-moving spatial coordinate, and the horizontal axis is the conformal time. The orange line denotes the\nfluctuations with small comoving wavenumber k while the blue line is for those with large k.\n\nFor the case that the universe evolves with some constant equation of state w, the scale factor can be parameterized\nas:\na(t) ∼ tp ,\n\n(41)\n\nwhere p is defined as p ≡ 2/[3(1 + w)]. This will be the case in the whole process except for the bouncing point.\nDuring the contracting phase before the non-minimal term dominates the universe, the fields oscillate around their\nextrema which made the universe behave like non-relativistic matter. The average value of the equation of state of\nthe universe is < w >= 0 (see from Fig. 1), and the scale factor a(t) scales as t2/3 . Since in this period the factor F\ndoes not evolve significantly, it can be approximately viewed as a constant. Therefore the scaling of Φ, Ψ and δφ are\ngiven as:\nr\n4 1 −i ak t 31\n(42)\nΦ ≃ Ψ≃C\ne 0 + c.c. ,\n3κ2 t\n1\n2C\nik\n1\n−i ak t 3\n0\n√ (− +\nδφ ≃\n+ c.c.\n(43)\n2 )e\n2\n3t a0 t 3\nκ F\nfor short-wavelength case, and\nΦ ≃ Ψ≃\n\n2Sc−\n5\n3\n\n+\n\n6Dc−\n,\n5κ2\n\n(44)\n\n3a0 F t\nr\nr\n−\n4 −5\n4\nSc\n6Dc−\nδφ ≃ −\nt 3+\na0 F 3κ2\n5κ2\n3κ2\n\n(45)\n\nfor long-wavelength case, where a0 is some normalization constant. Here the subscript \"c\" denotes the contracting\nphase and superscript \" − \" means the matter-like region which happens earlier. Note that Φ, Ψ and δφ have\nmagnitudes of the same order which should be much less than mpl , so the difference between Φ and Ψ (proportional\nto δφ) will be severely suppressed.\nHowever, when the non-minimal term begins to dominate the universe, the equation of state approaches to −1.\nDuring this period one could define a slow roll parameter ǫ ≡ −Ḣ/H 2 which should be very small.\nThus we\nq\ncan have a = a1 t1/ǫ and H = (ǫt)−1 . Moreover, we have from the Einstein Equations that φ̇ ∼\n\n1\n4\n3κ2 (t−t∗ )\n\nand\n\n\fCYCU-HEP-10-07\nφ∼\n\nq\n\n4\n3κ2\n\n8\n\nln (t − t∗ ), which results in F = 1 −\n\u0010\n\n4ξφ0\n3 (ln (t\n\n1\n\n− t∗ ))2 , where φ0 is some constant. From this we can have:\n8ξφ0 ln (t − t∗ )\n1\n0\nt∗ )1+ ǫ [1 − 4ξφ\n3 (ln (t\n\n\u0011\n\nSc+\n− t∗ ))2 ] 3a1 (t −\n− t∗ ))2 ]2\na1 ǫ(t − t∗\n−\n2 \u0010 1\n8ξφ0 [ǫ − (1 + ǫ) ln (t − t∗ )] \u0011\n+ 2 {ǫ\n+\n0\n2\nκ\n1 + ǫ 3(1 + ǫ)3 [1 − 4ξφ\n3 (ln (t − t∗ )) ]\n\u0010\n1\n8ǫξφ0 [ǫ + (1 + ǫ) ln (t − t∗ )] \u0011 +\n8ǫξφ0 ln (t − t∗ )\n}Dc ,\n−\n+\n0\n0\n2\n2\n1 + ǫ 3(1 + ǫ)3 [1 − 4ξφ\n3[1 − 4ξφ\n3 (ln t) ]\n3 (ln (t − t∗ )) ]\n2ǫ \u0010 1\nSc+\n8ξφ0 [ǫ − (1 + ǫ) ln (t − t∗ )] \u0011 +\n+\nΨ ≃\nDc ,\n+\n1\n0\n0\n2\n2\nκ2 1 + ǫ 3(1 + ǫ)3 [1 − 4ξφ\na1 ǫ(t − t∗ )1+ ǫ [1 − 4ξφ\n3 (ln (t − t∗ )) ]\n3 (ln (t − t∗ )) ]\nq\nΦ ≃\n\nδφ ≃ −\n\n(\n\n1\n)1+ ǫ [1\n\n1\n\na1 (t − t∗ )1+ ǫ [1\n\n−\n\n4ξφ0\n3 (ln (t\n\n4\n3κ2\n0\n− 4ξφ\n3 (ln (t\n1+ 1ǫ\n\n2a1 ǫ(t − t∗ )\nSc+ −\nκ2 (1 + ǫ)3\n\n\u0010\n\n− t∗ ))2 ]\n\n\u0011\n4ξφ0\n8ǫξφ0\n(1 + ǫ)2 [1 −\n(ln (t − t∗ ))2 ] −\n[ǫ + (1 + ǫ) ln (t − t∗ )] Dc+\n3\n3\n\n(46)\n(47)\n\n)\n\n(48)\n\nfor long-wavelength case, where the superscript \" + \" stands for the deflationary region which comes later.\n3.\n\nbouncing phase\n\nWhen the universe is dominated by the auxiliary scalar φ̃, the equation of state drops down to below −1, and\nthe total energy density of the unverse turns to decrease. When it goes to zero a bounce will happen. It is rather\ncomplicated to solve the equation (26) directly, however, we can make some modeling of the evolution to have it\nsimplified without losing fidelity. Generalizing the parametrization method in [11] (see also [28]), we parameterize the\nHubble parameter near the bouncing point of the form:\nH = α1 t + β1 t3 + ... ,\n\n(49)\n\nwith positive constants α1 and β1 of proper dimensions whose magnitudes are determined by the microphysics of the\nbounce. Note that it is unnecessary to contain terms with even power-laws of t. In our case, it can be estimated that\nα1 ∼ m2 . From the relations of variables between Jordan and Einstein frames, we can also obtain the approximate\nvalue of Ĥ with respect to t̂ up to first order of t:\nĤ = αt̂ + higher order terms ,\n\n(50)\n\nwhere α ≃ 4α1 /9. Since this parametrization is only valid during bounce phase where we can neglect the higher order\nterms of |η − ηB | with ηB being the comoving time at the bounce point, we obtain the equation for Φ̂ of this phase as:\n2y\n)Φ̂ ≃ 0 ,\n3\nwhere y ≡ 12αa2B /π and aB is the scale factor at the bounce point. The solution is:\n\u001b\n\u001a\n\u0001\n√\nl 1\n2\n−y(η−ηB )2\n,\nEHl ( y(η − ηB )) + F1 F1 − , , y(η − ηB )\nΦ̂ = e\n2 2\nΦ̂′′ + 2y(η − ηB )Φ̂′ + (k 2 +\n\n(51)\n\n(52)\n\nwhere Hl and 1 F1 denotes the l-th Hermite polynomial and confluent hypergeometric function respectively, with\n2 k2\nl≡− +\n.\n3 2y\n\n(53)\n\nThe short- and long-wavelength limits of the solution are quite different. For short wavelength (k 2 ≫ y), it reads:\nΦ̂ = e−\n\ny(η−ηB )2\n2\n\nÊ\n{ √ sin [k(η − ηB )] + F̂ cos [k(η − ηB )]} ,\n2l\n\nwhile for long wavelength (k 2 ≪ y), it is:\n√\nΦ̂ = F̂ + Ê y(η − ηB ) − (1 + l)F̂ (η − ηB )2 + O((η − ηB )3 ) ,\n√\n√\nwhere Ê ≡ −21+l πE/Γ(− 2l ) and F̂ ≡ F + 2l πE/Γ( 1−l\n2 ).\n\n(54)\n\n(55)\n\n\fCYCU-HEP-10-07\n\n9\n4.\n\nexpanding phase\n\nThe expanding phase can be viewed as time reversal process of the contracting phase. In this period, both the two\nfields will roll down along their potentials and begin to oscillate with a decaying amplitude and redshifted energy\ndensity. Similar to the case of contracting phase, at the beginning of expansion of the universe, the non-minimal\ncoupling term still remains large and dominate over the mass term of the φ field, and thus φ can be approximated as a\nslow-rolling field. This drives the total equation of state w to approach −1, and lead to a short period of inflation. But\nsoon, when the non-minimal coupling term becomes less important, both fields will oscillate around their minimum,\nbehaving like non-relativistic matter again.\nOne can also get the short and long wavelength solutions of the metric and field perturbations Φ, Ψ and δφ for the\nexpanding phase. We only care about the long-wavelength case which make sense for observation today. As similar\nto the contracting case just except for replacing the scripts, one gets:\n1\n\n\u0010\n\n8ξφ0 ln (t − t† )\n\n\u0011\n\nSe−\n4ξφ0\n0\n2]\n2 ]2\na2 ǫ(t − t† )\n3a\n(t\n−\nt\n)\n[1 − 4ξφ\n[1\n−\n(ln\n(t\n−\nt\n))\n(ln\n(t\n−\nt\n))\n2\n†\n†\n†\n3\n3\n8ξφ0 [ǫ − (1 + ǫ) ln (t − t† )] \u0011\n2 \u0010 1\n+\n+ 2 {ǫ\n0\n2\nκ\n1 + ǫ 3(1 + ǫ)3 [1 − 4ξφ\n3 (ln (t − t† )) ]\n\u0010\n8ǫξφ0 [ǫ + (1 + ǫ) ln (t − t† )] \u0011 −\n1\n8ǫξφ0 ln (t − t† )\n}De ,\n−\n+\n0\n0\n2\n2\n1 + ǫ 3(1 + ǫ)3 [1 − 4ξφ\n3[1 − 4ξφ\n3 (ln (t − t† )) ]\n3 (ln (t − t† )) ]\nSe−\n2ǫ \u0010 1\n8ξφ0 [ǫ − (1 + ǫ) ln (t − t† )] \u0011 −\nΨ ≃\nDe ,\n+\n+\n1\n4ξφ\n2\n0\n2\na2 ǫ(t − t† )1+ ǫ [1 − 3 0 (ln (t − t† ))2 ] κ 1 + ǫ 3(1 + ǫ)3 [1 − 4ξφ\n3 (ln (t − t† )) ]\nq\nΦ ≃\n\n−\n\n1+ 1ǫ\n\nδφ ≃ −\n\n1\n\n(\n\na2 (t − t† )1+ ǫ [1\n\nSe−\n\n4\n3κ2\n0\n− 4ξφ\n3 (ln (t\n\n1+ 1ǫ\n\n− t† ))2 ]\n\n1\n\u0011\n2a2 ǫ(t − t† )1+ ǫ \u0010\n8ǫξφ0\n4ξφ0\n2\n2\n−\n(ln\n(t\n−\nt\n))\n]\n−\n[ǫ\n+\n(1\n+\nǫ)\nln\n(t\n−\nt\n)]\nDe−\n(1\n+\nǫ)\n[1\n−\n†\n†\nκ2 (1 + ǫ)3\n3\n3\n\n(56)\n(57)\n\n)\n\n(58)\n\nfor the short inflationary period, and\nΦ ≃ Ψ≃\n\n2Se+\n5\n3\n\n+\n\n6De+\n,\n5κ2\n\n3a3 F (t − t† )\nr\nr\n+\n6De+\n4\n4\nSe\n− 35\n(t − t† ) +\nδφ ≃ −\na3 F 3κ2\n5κ2\n3κ2\n\n(59)\n(60)\n\nfor the matter-like expanding phase. Here the subscript \"e\" denotes expanding phase and superscripts \" − \" and \" + \"\nstand for inflationary and matter-like regions separately.\n5.\n\nspectrum\n\nHaving in hand the solutions in the above sections which stand for different phases, now it is time to connect all of\nthem using matching conditions. According to [7] and [8], we can require that for each point which joins two phases\ntogether, the three-metric as well as its extrinsic curvature should be continuous. In conformal Newtonian gauge\nwhich is used in this paper, this indicates that\nΨ\n\n±\n\n=0,\n\n∇2 Ψ − 3H(Ψ′ + HΦ)\n3H(H′ − H2 )\n\n±\n\n=0,\n\n(61)\n\nwhere ± means the difference before and after the transition point. Substituting solutions for perturbations of each\nperiod into (61) we can get the final results for them. From the last paragraph we can see that at last the solution is\ndivided by two parts, one is constant (De+ mode) and the other is decaying (Se+ mode). We are only interested in the\nfirst mode, which dominates over the other one. Since the calculation is rather straightforward and tedious, we only\n\n\fCYCU-HEP-10-07\n\n10\n\nlist the final result as follows:\n(0)\nDe+ = Sc− ((0) G+\nMe+ + (0) Mc+ (0) Ne+ ) + Dc− ((0) Kc+ (0) Me+ − (0) Nc+ (0) Ne+ )\nc\n2\nk\n(0)\n(1)\nMe+ − (0) G+\nMe+ )\n+ 2 [(Sc− ((1) Mc+ (0) Ne+ − (0) Mc+ (1) Ne+ − (1) G+\nc\nc\na\n+ Dc− ((1) Nc+ (0) Ne+ − (1) Kc+ (0) Me+ − (0) Kc+ (1) Me+ + (0) Nc+ (1) Ne+ )]\nk4\n+ O( 4 ) .\na\n\n(62)\n\nFor all the coefficients that appear above, we refer the readers to Appendix B. These coefficients are all the specific\nvalue at the joint point, so they are independent on k. Moreover, the mode in contracting phase Dc− and Sc− can be\n3\neasily read from the initial conditions. If we set up with the Bunch-Davies vacuum which implies Ψ ∼ k − 2 t−1 , we can\n3\n7\nobtain that Dc− ∼ k 2 and Sc− ∼ k − 2 . Substituting them into (62), we can see that at large scales Dc− vanishes. The\ncontributions of Sc− in the first order in k 2 will be blue-tilted by exactly the right amount to yield a scale invariant\nspectrum. This is the same behavior as the normal case of matter bounce without non-minimal coupling.\nHowever, different from the normal case, we find that the Sc− mode also has contributions in the zeroth order in k 2\nto the final spectrum. As we know, in the standard case of minimal coupling, the constant mode after the transfer\npoint cannot be inherited from the running mode before the transfer. Actually, one may find that the coefficients\n(0)\nMe+ and (0) Mc+ vanish except for those terms containing ξ (information from non-minimal coupling term), which\nis consistent with its minimal coupling limit ξ → 0, but when non-minimal coupling terms are introduced, a mixing\nbetween the two will happen. In our case, since the remaining terms cannot be very large due to the small ξ, the\namplitude of Sc− will be suppressed, and in a considerable region of large scales, we can also obtain a scale-invariant\nspectrum [36]. Nevertheless, for extremely large scales, the contribution of Sc− of zeroth order in k will become\nnon-negligible, and the spectrum will have a red-tilt.\n6.\n\nnumerical results\n\nIn order to support our analysis above, we also perform the numerical calculation for the perturbations. Fig. 3 is\nthe numerical results for the dependence of the metric power spectrum PΨ on the cosmic time t for different comoving\nk modes, where we use the normal definition of power spectrum as:\nPΨ (k) ≡\n\nk3\nk3\n2\n|Ψ|\n≃\n|D+ |2 .\n2π 2\n2π 2 e\n\n(63)\n\nWe choose the zero point on the horizontal axis to be the bouncing point, and set the initial conditions to be BunchDavies vacuum. One can see from our plot that before the bounce point, the perturbation is dominated by their\ngrowing modes, and after the bounce, it is dominated by the constant modes, which fits the analytical results very\nwell. As for the k dependence, we see that for medium k modes, the power spectrum takes on scale invariance while\nin the extremely small k modes where k . 10−6 mpl , the spectrum will present a slightly red tilt. This is because the\nnon trivial inheritance of the growing mode in contracting phase to the constant mode in expanding phase at zeroth\norder of k due to the non-minimal coupling effects. Since the scale variance happens only in extreme large scales, we\nexpect that it could be tested in the future observational data.\nFurthermore, we calculate numerically the evolution of the particle production δφ with respect to t and plot the\nresult in Fig. 4. Particle production is expected in the region where the squared value of momentum scales of the\nperturbation modes are larger than the potential so that the WKB approximation becomes valid, such as the reheating\nprocess at the end of inflation [29]. Here at the bouncing point crossing, there is also possibilities to produce particles.\n3\nIn the usual case, we can define another variable φ ≡ a 2 δφ, which satisfies equation of motion as:\nφ̈ + ωk2 φ = ...,\n\n(64)\n\n2\n\nwhere ωk2 = a2k(t) + m2 − 32 Ḣ − 49 H 2 . From above we can see that, although the first two terms are positive-determined,\nthere will remain some additional terms due to the geometry of the universe, which would cause ωk2 to be less than\nzero. If this is the case, the field will have tachyonic behavior and will blow up with particle production (which can\nbe called as tachyonic reheating [30]). However, if there is a non-minimal coupling term with a negative coupling\nconstant ξ, this effect will get larger since ωk2 gets a more negative value. This can be seen from the modified equation\nof motion which becomes:\nφ̈ + [\n\nk2\n3\n9\n+ m2 − Ḣ − H 2 − ξR]φ = ...\na2 (t)\n2\n4\n\n(65)\n\n\fCYCU-HEP-10-07\n\n11\n\n10\n\n10\n\n0\n\n10\n\n-10\n\n10\n\n-20\n\n10\n\n-30\n\n10\n\nk=1\n\n-40\n\nk=10\n\n10\n\nP\n\nk=10\n\n-50\n\n10\n\nk=10\n\n-60\n\n10\n\nk=10\n\n-3\n\n-6\n\n-9\n\n-12\n\n-70\n\n10\n\n-80\n\n10\n\n-90\n\n10\n\n-4\n\n-2\n\n0\n\n2\n\n4\n\n6\n\n8\n\nt\n\nFIG. 3: (Color online) Results of the numerical evolutions of the curvature perturbations with different comoving wavenumbers\nk in non-minimal coupling matter bounce as function of cosmic time t. The initial values of the background parameters are\n−1\nthe same as in Figure 1. The units of the time axis are Mrec\n, the comoving wavenumber k is unity for k = mpl .\n\nThis is usually called geometric reheating [31]. In Fig. 4 we can see that indeed the particle production gets much\nenhancement in the non-minimal coupling case than its minimal coupling counterparts. This is another interesting\nresult in our case which are expected to be tested by the future experiments.\n\n10\n\n10\n\n0\n\n10\n\n-10\n\n10\n\n-20\n\n10\n\n-30\n\n10\n3\n\na <\n\n>\n\n-40\n\n10\n\n-50\n\n10\n\n-60\n\n10\n\n-70\n\n10\n\n-80\n\n10\n\n-40\n\n-20\n\n0\n\n20\n\n40\n\nt\n\nFIG. 4: (Color online) Results of the numerical evolutions of the field particle production with and without non-minimal\ncoupling term for matter bounce. The initial values of the background parameters are the same as in Figure 1.\n\nIV.\n\nCONCLUSIONS AND DISCUSSIONS\n\nNon-minimal coupling is a very popular subject in cosmology and has been widely studied in the literature. In this\npaper, we have investigated the possibility of generating a matter bounce by the Lee-Wick type scalar field with a\nnon-minimal coupling term involved, and studied its perturbations. As in the previous work done in [11], a bounce was\nobtained when the non-minimal coupling is not too large to have unexpected effects. However, as it gives correction\nto the effective mass of the field, a short period of deflation/inflation before/after the bounce will happen.\nUsing the standard techniques of calculating perturbations of bounce developed from previous works, we have\ncalculated the perturbations of the model in detail. One of the big differences from previous one for minimal coupling\nis that the non-minimal coupling to gravity causes the difference between the two scalar perturbations Φ and Ψ, which\nwill cause very interesting consequences. We have obtained the solution for each stage of evolution and compiled them\ntogether using proper matching conditions. We have found that the final dominant mode can be inherited nontrivially\n\n\fCYCU-HEP-10-07\n\n12\n\nfrom the subdominant mode in the zero-th order of wave number k due to this difference. This will lead to the red-tilt\nof the power spectrum at very large scales, which can be justified in future observation [37].\nAnother result we obtained is that due to the non-minimal coupling, the particle production of the scalar will get\ngreatly enhanced. In the region of validity of the WKB approximation when the quantum effects become significant,\nthe field will get excited and produce particles. This is very common in reheating process. When there is a negative\neffective mass squared term in the field equation, the particle production will get enhanced due to tachyonic resonance.\nIn usual cases, the averaged value of perturbations of the scalar field will get an enhancement through bounce time\ndue to geometrical effects. When a non-minimal coupling term is involved in the field equation, the mass of the field\nwill be corrected. In the case of negative coupling coefficient, the field will get a more negative effective mass squared,\nand the particle production will get more efficiently enlarged. This is also very interesting phenomenon and can be\ntested by experiments on particle physics.\nFinally we would like to close with some remarks on future works. The bounce with non-minimal coupling is very\ninteresting topic since in the early epoch, Einstein's gravity is likely to be modified, which can give some valuable\neffects to the evolution of our universe. It is deserved to pay attention to this project both from the theoretical\nside such as the perturbation, non-Gaussianity, effects on CMB and so on, and from observational side, such as the\nconstraints, confirmation or even exclusion from experimental data. All these works are expected to take on in the\nfuture.\nAcknowledgments\n\nOne of us (T.Q.) thanks Prof. Robert Brandenberger, Prof. Yunsong Piao, Prof. Shinji Tsujikawa, Yifu Cai and\nJun Zhang for useful suggestions at the beginning of the work. This research is supported in parts by the National\nScience Council of R.O.C. under Grant No. NSC96-2112-M-033-004-MY3 and No. NSC97-2811-033-003 and by the\nNational Center for Theoretical Science.\nAppendix A: Hubble parameter in Jordan and Einstein frames\n\nThis appendix is set to claim the relation between Hubble parameter in the two frames used in the text. As is\nwell known, the differentiations of √\ncomoving time dη are the same in the two frames, while that of cosmic time dt are\nnot. By definition, we have dt̂ = F dt where t̂ denotes the cosmic time in Einstein frame. Due to this difference,\none should be careful when using variables with derivatives in terms of t such as Hubble parameter H. As is already\nmentioned in the previous sections, the Hubble parameter defined in Jordan frame is:\nH≡\n\nda\nȧ\n=\n.\na\nadt\n\n(A1)\n\nHowever, we can also define a Hubble parameter in Einstein frame, which is:\n◦\n\nâ\ndâ\nĤ ≡ =\n,\nâ\nâdt̂\n\n(A2)\n2\n\nwhere we have introduced the symbol \" ◦′′ to represent the cosmic time derivative in Einstein frame: ◦= ddt̂ , ◦◦= ddt̂2 ,\netc. We can see from the definitions that the two Hubble parameters have the same type of√relation to the comoving\nHubble parameters in their frames: H = aH and Ĥ = âĤ. Reminding the relation â = a F , it is easy to find the\ndescription of Ĥ in terms of H and F :\n√\nd(a F )\nĤ =\naF dt\n1\nH\n(A3)\n= √ − ( √ ) ̇ .\nF\nF\nFurthermore, we can derive its derivatives with respect to cosmic time t̂ which are:\n◦\n\nḢ\n1\n1\n1\n+ H(\n) ̇− √ ( √ ) ̈,\nF\n2F\nF\nF\n◦◦\nH 1\n1\n1\n1 1 ...\n1\nḦ\n) ̈− ( √ ) − (\n) ̇( √ ) ̈.\nĤ = √ + Ḣ( √ ) ̇+ √ (\n2F\nF\n2F\nF\nF\nF F\nF F\nF\nĤ =\n\n(A4)\n(A5)\n\n\fCYCU-HEP-10-07\n\n13\nAppendix B: coefficients for the perturbation modes\n\nThis appendix indicates all the coefficients that appear in (62). These are calculated using the Hwang-Vishniac\n(Dueruelle-Mukhanov) matching conditions [7, 8]:\nq\n ̇+\n4Cc+\n2\n2\n4ǫ\n+ Bc+ F [( 20ǫ 8 + 2A5c + )H + (16 13 ǫκξφ\n)H 2 ]\n5\n5 +\n5 −\n5 −\n5\n+\n3aF t 3 Ac\n9aF t 3\naF t 3 Ac\naF 2 t 3\naF t 3\n3aF t 3\naF 2 t 3 A+\n(0) +\nc\nGc =\n,\n(B1)\n+  ̇+\n+ + 2\n+ + 2\ntc\n(−3Bc+ A ̇+\nc F H + 3Ac Bc F H + 6Bc Cc H − 6Ac Ec H )\n(0)\n\nKc+\n\n(1)\n\n(1)\n\n(0)\n\nMc+\n\n=\n\n(1)\n\n(0)\n\n=\n\nNe+ =\n\nc\n\n18\n5κ2\n\n−\n\n36Cc+\n5κ2 A+\nc F\n\n)H 2 ]\n\nG+\nc =\n\nKc+ =\n\n4ǫ\n\nBc+ F (\n\n(−3Bc+ A ̇+\nc FH +\n\n5\n\n−\n\n9aF t 3\n+  ̇+\n3Ac Bc F H +\n\n2\n\n+\n\n8\n9aF t 3\n\n ̇\n2A+\nc\n\n5\naF t 3\n\n)H + (16\n+\n\nAc\n\nq\n\n1 ǫκξφ\n3 aF 2 t 35\n\n,\n\nNc+\n\n+\n\nMc+\n\n=\n\n=\n\nNc+ =\n\n√ ǫξφ\n ̇\n18A+\nǫ\nc H\nA+\nc F [ 5κ2 A+ − (2.4 κ2 + 6.4 3 F κ −\nc\n\n+ 2\n− 6A+\nc Ec H )\n\n2\n\n−\n\n5\n\naF t 3\n\n4ǫ\n\n5\n\n3aF t 3\n\n−\n\ntc\n\ntc\n\n4Cc+\n\n5\n\naF t 3\n\n18\n5κ2\n\n+\n\n36Cc+\n5κ2 A+\nc F\n\n,\n\n(B3)\n\n,\n\n(B4)\n\n)H 2 ]\n\n4ǫ\n\n(−3Bc+ A ̇+\nc FH +\n\n5\n\n−\n\n9aF t 3\n+  ̇+\n3Ac Bc F H +\n\n2\n\n5\n\n+ 2\n− 6A+\nc Ec H )\n\n8\n8\nκ2 (2B ̇e− F t 3 − 4Ee− Ht 3 +\n\n8\n\n20 53\n−\n9 t ǫAe F\n\ntc\n\n(B5)\n\n,\n\n(B6)\n\ntc\n\n,\n\n(B7)\n\ntc\n\n,\n\n(B8)\n\n8\n\n8\n\n4\n− 2\n−\n3\n3\n3\n+ 2A−\ne HF t − 3 ǫAe HF t + 8Ae κ ξφHt ǫ\nq\n8\n5\nǫ( 83 F t 3 + 16κ2 ξφHt 3 3κ4 2 )\n8\n\n20 35\n−\n9 t ǫBe F\n\n,\n\n)\n\n3aF t 3\n6Bc+ Cc+ H 2\n\n4ǫ\n6\nA+\nc F ( 5κ2 − 5κ2 )\n+  ̇+\n+ + 2\n+ + 2\n(−3Bc+ A ̇+\nc F H + 3Ac Bc F H + 6Bc Cc H − 6Ac Ec H )\n\n8\n8\n−\nκ2 (2A ̇−\ne F t 3 − 4Ce Ht 3 +\n\ntc\n\n)H 2 ]\n\n+  ̇+\n+ + 2\n+ + 2\n(−3Bc+ A ̇+\nc F H + 3Ac Bc F H + 6Bc Cc H − 6Ac Ec H )\n\nA+\nc F(\n\n(B2)\n\n)\n\n5\n\n3aF t 3\n6Bc+ Cc+ H 2\n\n6\n4ǫ\nBc+ F ( 5κ\n2 − 5κ2 )\n+  ̇+\n+ + 2\n+ + 2\n(−3Bc+ A ̇+\nc F H + 3Ac Bc F H + 6Bc Cc H − 6Ac Ec H )\n20ǫ\n\ntc\n\n+  ̇+\n+ + 2\n+ + 2\n(−3Bc+ A ̇+\nc F H + 3Ac Bc F H + 6Bc Cc H − 6Ac Ec H )\n\n(1)\n\nMe+\n\n√\n ̇\nA+\nc H\n− Bc+ F [ 18\n+ (2.4 κǫ2 + 6.4 3 ǫξφ\nFκ +\n5κ2 A+\n\n+  ̇+\n+ + 2\n+ + 2\n(−3Bc+ A ̇+\nc F H + 3Ac Bc F H + 6Bc Cc H − 6Ac Ec H )\n\n−A+\nc F [(\n\n(0)\n\n(0)\n\n=\n\n6\n5κ2 A+\nc\n\n8\n\n8\n\n+ 2Be− HF t 3 − 34 ǫBe− HF t 3 + 8Be− κ2 ξφHt 3 ǫ\nq\n5\n8\nǫ( 83 F t 3 + 16κ2 ξφHt 3 3κ4 2 )\n\nq\n\nq\n\n4\n3κ2 )\nte\n\n4\n3κ2 )\nte\n\n,\n\n(B9)\n\n,\n\n(B10)\n\n8\n\n(1)\n\nMe+ =\n\nκ2 F t 3 (− 23 + 94 ǫ)A−\ne\nq\n5\n8\n8\n2\nHǫ( 3 F t 3 + 16κ ξφHt 3 3κ4 2 )\n\nte\n\n,\n\n(B11)\n\n,\n\n(B12)\n\n8\n\n(1)\n\nNe+\n\nκ2 F t 3 (− 23 + 94 ǫ)Be−\nq\n=\n8\n5\nHǫ( 83 F t 3 + 16κ2 ξφHt 3 3κ4 2 )\n\nte\n\n\fCYCU-HEP-10-07\n\n14\n\nwhere\nA+\nc =\n\n1\n1\n\na1 ǫ(t − t∗ )1+ ǫ [1 −\n\n4ξφ0\n3 (ln (t\n\n− t∗ ))2 ]\n\nCc+ =\n\nEc+ = −\n\nA−\ne =\n\na1 (t −\n\na2 ǫ(t − t† )\n\n[1 −\n\n4ξφ0\n3 (ln (t\n\n− t† ))2 ]\n\nCe− =\n\nEe− = −\n\n8ξφ0 [ǫ − (1 + ǫ) ln (t − t∗ )] \u0011\n2ǫ \u0010 1\n,\n+\n0\n2\nκ2 1 + ǫ 3(1 + ǫ)3 [1 − 4ξφ\n3 (ln (t − t∗ )) ]\n\n√ 4 κ2 ξφ\n3κ2\n1\n1+\n0\nt∗ ) ǫ [1 − 4ξφ\n3 (ln (t\n\n− t∗ ))2 ]\n\n,\n\n0\n0\n8ǫξφ{(1 + ǫ)2 [1 − 4ξφ\n(ln (t − t∗ ))2 ] − 8ǫξφ\n3 [ǫ + (1 + ǫ) ln (t − t∗ )]}\n√ 3\n,\n0\n2\n3κ2 (1 + ǫ)3 [1 − 4ξφ\n3 (ln (t − t∗ )) ]\n\n1\n1+ 1ǫ\n\n, Bc+ =\n\n, Be− =\n\n1+ 1ǫ\n\na2 (t − t† )\n\n2ǫ \u0010 1\n8ξφ0 [ǫ − (1 + ǫ) ln (t − t† )] \u0011\n,\n+\n0\n2\nκ2 1 + ǫ 3(1 + ǫ)3 [1 − 4ξφ\n3 (ln (t − t† )) ]\n\n√ 4 κ2 ξφ\n3κ2\n0\n[1 − 4ξφ\n3 (ln (t\n\n− t† ))2 ]\n\n,\n\n0\n0\n8ǫξφ{(1 + ǫ)2 [1 − 4ξφ\n(ln (t − t† ))2 ] − 8ǫξφ\n3 [ǫ + (1 + ǫ) ln (t − t† )]}\n√ 3\n.\n0\n2\n3κ2 (1 + ǫ)3 [1 − 4ξφ\n3 (ln (t − t† )) ]\n\n(B13)\n\n(B14)\n\n(B15)\n\n(B16)\n\n(B17)\n\n(B18)\n\nThe constants t∗ and t† are set to guarantee the continuity of H at the joint point tc and te , and one can straightforwardly check that in the limit of ξ = 0, we have (0) Mc+ and (0) Me+ =0, and a scale-invariant power spectrum can be\nobtained for the whole region of large scales.\n\n[1] V. F. Mukhanov and R. H. Brandenberger, Phys. Rev. Lett. 68, 1969 (1992); R. H. Brandenberger, V. F. Mukhanov and\nA. Sornborger, Phys. Rev. D 48, 1629 (1993); For recent review see M. Novello and S. E. P. Bergliaffa, Phys. Rept. 463,\n127 (2008).\n[2] A. H. Guth, Phys. Rev. D 23, 347 (1981); A. Albrecht and P. J. Steinhardt, Phys. Rev. Lett. 48, 1220 (1982); A. D. Linde,\nPhys. Lett. B 108, 389 (1982).\n[3] S. W. Hawking, and G. F. R. Ellis, The large scale structure of space-time, Cambridge University Press (1973); A. Borde\nand A. Vilenkin, Phys. Rev. Lett. 72, 3305 (1994).\n[4] A. Borde and A. Vilenkin, Phys. Rev. Lett. 72, 3305 (1994).\n[5] J. Martin and R. H. Brandenberger, Phys. Rev. D 63, 123501 (2001); R. H. Brandenberger and J. Martin, Mod. Phys.\nLett. A 16, 999 (2001).\n[6] For calculations of perturbations in a bounce scenario, we draw readers' attentions to e. g. D. Wands, Phys. Rev. D 60,\n023507 (1999); P. Peter and N. Pinto-Neto, Phys. Rev. D 66, 063509 (2002); F. Finelli, JCAP 0310, 011 (2003); L. E. Allen\nand D. Wands, Phys. Rev. D 70, 063515 (2004); F. Finelli, P. Peter and N. Pinto-Neto, Phys. Rev. D 77, 103508 (2008);\nA. Cardoso and D. Wands, Phys. Rev. D 77, 123538 (2008).\n[7] J. c. Hwang and E. T. Vishniac, Astrophys. J. 382, 363 (1991).\n[8] N. Deruelle and V. F. Mukhanov, Phys. Rev. D 52, 5549 (1995).\n[9] Y. F. Cai and E. N. Saridakis, JCAP 0910, 020 (2009); K. i. I. Maeda, Y. Misonoh and T. Kobayashi, arXiv:1006.2739\n[hep-th].\n[10] Y. F. Cai and X. Zhang, JCAP 0906, 003 (2009); Y. F. Cai, W. Xue, R. Brandenberger and X. Zhang, JCAP 0905, 011\n(2009).\n[11] Y. F. Cai, T. t. Qiu, R. Brandenberger and X. m. Zhang, Phys. Rev. D 80, 023511 (2009).\n[12] N. A. Chernikov and E. A. Tagirov, Annales Poincare Phys. Theor. A 9 (1968) 109; C. G. . Callan, S. R. Coleman and\nR. Jackiw, Annals Phys. 59 (1970) 42; N. D. Birrell and P. C. W. Davies, Quantum Fields In Curved Space, Cambridge\nUniversity Press (1982).\n[13] Y. Fujii and K. Maeda, The Scalar-Tensor Theory of Gravitation,\" Cambridge University Press (2003); B. Boisseau,\nG. Esposito-Farese, D. Polarski and A. A. Starobinsky, Phys. Rev. Lett. 85, 2236 (2000).\n[14] C. Brans and R. H. Dicke, Phys. Rev. 124, 925 (1961).\n[15] M. Gasperini and G. Veneziano, Astropart. Phys. 1, 317 (1993); M. Gasperini and G. Veneziano, Phys. Rept. 373, 1\n(2003).\n\n\fCYCU-HEP-10-07\n\n15\n\n[16] S. Nojiri, S. D. Odintsov and M. Sasaki, Phys. Rev. D 71, 123509 (2005) and the following literature.\n[17] T. P. Sotiriou and V. Faraoni, Rev. Mod. Phys. 82, 451 (2010); A. De Felice and S. Tsujikawa, Living Rev. Rel. 13, 3\n(2010); A. De Felice and S. Tsujikawa, arXiv:1005.0868 [astro-ph.CO].\n[18] M. R. Setare, J. Sadeghi and A. Banijamali, Phys. Lett. B 669, 9 (2008); J. Sadeghi, M. R. Setare, A. R. Amani and\nS. M. Noorbakhsh, Phys. Lett. B 685, 229 (2010); T. Qiu, arXiv:1007.2929 [hep-ph].\n[19] V. Faraoni, Phys. Rev. D 53, 6813 (1996).\n[20] V. Faraoni, Phys. Rev. D 62, 023504 (2000); S. Nojiri and S. D. Odintsov, eConf C0602061, 06 (2006) [Int. J. Geom.\nMeth. Mod. Phys. 4, 115 (2007)]; M. R. Setare and E. N. Saridakis, Phys. Lett. B 671, 331 (2009).\n[21] B. Feng, X. L. Wang and X. M. Zhang, Phys. Lett. B 607, 35 (2005); M. z. Li, B. Feng and X. m. Zhang, JCAP 0512,\n002 (2005). See also Y. F. Cai, E. N. Saridakis, M. R. Setare and J. Q. Xia, arXiv:0909.2776 [hep-th]; T. Qiu, Mod. Phys.\nLett. A 25, 909 (2010) for reviews.\n[22] T. D. Lee and G. C. Wick, Nucl. Phys. B 9, 209 (1969); T. D. Lee and G. C. Wick, Phys. Rev. D 2, 1033 (1970).\n[23] B. Grinstein, D. O'Connell and M. B. Wise, Phys. Rev. D 77, 025012 (2008).\n[24] A. van Tonder, arXiv:0810.1928 [hep-th].\n[25] S. M. Carroll, M. Hoffman and M. Trodden, Phys. Rev. D 68, 023509 (2003); J. M. Cline, S. Jeon and G. D. Moore, Phys.\nRev. D 70, 043543 (2004).\n[26] J. Karouby and R. Brandenberger, arXiv:1004.4947 [hep-th].\n[27] V. F. Mukhanov, H. A. Feldman and R. H. Brandenberger, Phys. Rept. 215, 203 (1992).\n[28] Y. F. Cai, T. Qiu, R. Brandenberger, Y. S. Piao and X. Zhang, JCAP 0803, 013 (2008).\n[29] A. Albrecht, P. J. Steinhardt, M. S. Turner and F. Wilczek, Phys. Rev. Lett. 48, 1437 (1982); A. D. Dolgov and A. D. Linde,\nPhys. Lett. B 116, 329 (1982); L. F. Abbott, E. Farhi and M. B. Wise, Phys. Lett. B 117, 29 (1982); J. H. Traschen and\nR. H. Brandenberger, Phys. Rev. D 42, 2491 (1990); L. Kofman, A. D. Linde and A. A. Starobinsky, Phys. Rev. Lett. 73,\n3195 (1994); Y. Shtanov, J. H. Traschen and R. H. Brandenberger, Phys. Rev. D 51, 5438 (1995); L. Kofman, A. D. Linde\nand A. A. Starobinsky, Phys. Rev. D 56, 3258 (1997). For comprehensive reviews see B. A. Bassett, S. Tsujikawa and\nD. Wands, Rev. Mod. Phys. 78, 537 (2006); R. Allahverdi, R. Brandenberger, F. Y. Cyr-Racine and A. Mazumdar,\narXiv:1001.2600 [hep-th].\n[30] P. B. Greene, L. Kofman and A. A. Starobinsky, Nucl. Phys. B 543, 423 (1999); G. N. Felder, J. Garcia-Bellido,\nP. B. Greene, L. Kofman, A. D. Linde and I. Tkachev, Phys. Rev. Lett. 87, 011601 (2001).\n[31] B. A. Bassett and S. Liberati, Phys. Rev. D 58, 021302 (1998) [Erratum-ibid. D 60, 049902 (1999)]; S. Tsujikawa,\nK. i. Maeda and T. Torii, Phys. Rev. D 61, 103501 (2000); S. Tsujikawa and B. A. Bassett, Phys. Rev. D 62, 043510\n(2000); B. A. Bassett, S. Tsujikawa and D. Wands, Rev. Mod. Phys. 78, 537 (2006).\n[32] J. Martin and P. Peter, Phys. Rev. Lett. 92, 061301 (2004).\n[33] There are plenty of non-minimal coupling theories in the literature, such as scalar-tensor theories [13], Brans-Dicke theory\n[14] or dilaton theory [15]. See [16] for Gauss-Bonnet type of non-minimal couplings. For comprehensive reviews see [17].\n[34] People may worry about the \"ghost\" behavior of the field φ̃, which may cause some instability problems [25]. That is true\nbut it is not the focus of our paper. Note that we are only interested in the general picture of the bounce, and the auxiliary\nfield is only used as an explicit example for the bounce to happen. A more general analysis will be taken into consideration\nin the future work.\n[35] Remark 1: As is obvious, the divergent of EoS is due to the vanishment of the total energy density of the universe and is\nthus not avoidable. Fortunately,since EoS is not a physical quantity, it is safe and will not cause any real instabilities.\nRemark 2: Recently a paper [26] pointed out that this kind of model cannot be stable with the addition of regular radiation\nin the contracting phase. Possible keys to this issue is being under investigation.\n[36] Actually, there may exist some fine-tuning between the amplitude of Sc− and k2 Sc− , and if the former is too large, we might\nnot get a scale-invariant power spectrum. Although one may think from naive intuition that it will not be that severe\nbecause of the small ξ, a careful comparison should be needed in order to have a safe theory. We would investigate this\npoint in detail in a future work.\n[37] Another interesting case of tilting the spectrum would be to consider closed universe and have slow bounce of which Ḣ → 0\nat the bounce point while higher time derivatives of H drive the bounce, in which case the perturbations will transfer\nthrough the bounce via a scale-dependent way. Such works were discussed in e.g. [32]. We thank the anonymous referee\nfor point this to us.\n\n\f"}