{"id": "http://arxiv.org/abs/0907.0071v1", "guidislink": true, "updated": "2009-07-01T06:34:30Z", "updated_parsed": [2009, 7, 1, 6, 34, 30, 2, 182, 0], "published": "2009-07-01T06:34:30Z", "published_parsed": [2009, 7, 1, 6, 34, 30, 2, 182, 0], "title": "Energy functional based on natural orbitals and occupancies for static\n  properties of nuclei", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.3159%2C0907.3595%2C0907.1548%2C0907.0258%2C0907.0957%2C0907.1418%2C0907.1224%2C0907.3849%2C0907.5290%2C0907.1028%2C0907.2120%2C0907.5605%2C0907.2612%2C0907.2494%2C0907.0071%2C0907.5150%2C0907.5227%2C0907.2205%2C0907.1172%2C0907.5413%2C0907.1186%2C0907.4714%2C0907.4043%2C0907.3778%2C0907.4978%2C0907.0890%2C0907.4750%2C0907.0799%2C0907.5040%2C0907.2920%2C0907.0807%2C0907.0638%2C0907.4155%2C0907.0679%2C0907.3270%2C0907.4197%2C0907.1935%2C0907.1976%2C0907.4060%2C0907.2255%2C0907.0952%2C0907.2385%2C0907.2595%2C0907.2419%2C0907.3587%2C0907.2091%2C0907.3098%2C0907.0039%2C0907.4744%2C0907.0631%2C0907.1008%2C0907.1082%2C0907.3885%2C0907.1941%2C0907.4789%2C0907.3850%2C0907.2038%2C0907.5508%2C0907.4398%2C0907.4638%2C0907.1138%2C0907.0891%2C0907.3548%2C0907.0846%2C0907.0815%2C0907.0528%2C0907.5499%2C0907.0818%2C0907.3079%2C0907.3368%2C0907.2931%2C0907.3214%2C0907.0875%2C0907.1756%2C0907.2508%2C0907.2974%2C0907.0879%2C0907.4759%2C0907.3266%2C0907.5351%2C0907.1056%2C0907.2944%2C0907.2832%2C0907.1168%2C0907.0804%2C0907.2116%2C0907.4839%2C0907.1409%2C0907.0899%2C0907.2943%2C0907.4854%2C0907.0279%2C0907.3831%2C0907.1391%2C0907.4504%2C0907.2516%2C0907.5183%2C0907.2708%2C0907.3739%2C0907.2245%2C0907.4173&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Energy functional based on natural orbitals and occupancies for static\n  properties of nuclei"}, "summary": "The possibility to use functionals of occupation numbers and natural orbitals\nfor interacting fermions is discussed as an alternative to multi-reference\nenergy density functional method. An illustration based on the two-level Lipkin\nmodel is discussed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.3159%2C0907.3595%2C0907.1548%2C0907.0258%2C0907.0957%2C0907.1418%2C0907.1224%2C0907.3849%2C0907.5290%2C0907.1028%2C0907.2120%2C0907.5605%2C0907.2612%2C0907.2494%2C0907.0071%2C0907.5150%2C0907.5227%2C0907.2205%2C0907.1172%2C0907.5413%2C0907.1186%2C0907.4714%2C0907.4043%2C0907.3778%2C0907.4978%2C0907.0890%2C0907.4750%2C0907.0799%2C0907.5040%2C0907.2920%2C0907.0807%2C0907.0638%2C0907.4155%2C0907.0679%2C0907.3270%2C0907.4197%2C0907.1935%2C0907.1976%2C0907.4060%2C0907.2255%2C0907.0952%2C0907.2385%2C0907.2595%2C0907.2419%2C0907.3587%2C0907.2091%2C0907.3098%2C0907.0039%2C0907.4744%2C0907.0631%2C0907.1008%2C0907.1082%2C0907.3885%2C0907.1941%2C0907.4789%2C0907.3850%2C0907.2038%2C0907.5508%2C0907.4398%2C0907.4638%2C0907.1138%2C0907.0891%2C0907.3548%2C0907.0846%2C0907.0815%2C0907.0528%2C0907.5499%2C0907.0818%2C0907.3079%2C0907.3368%2C0907.2931%2C0907.3214%2C0907.0875%2C0907.1756%2C0907.2508%2C0907.2974%2C0907.0879%2C0907.4759%2C0907.3266%2C0907.5351%2C0907.1056%2C0907.2944%2C0907.2832%2C0907.1168%2C0907.0804%2C0907.2116%2C0907.4839%2C0907.1409%2C0907.0899%2C0907.2943%2C0907.4854%2C0907.0279%2C0907.3831%2C0907.1391%2C0907.4504%2C0907.2516%2C0907.5183%2C0907.2708%2C0907.3739%2C0907.2245%2C0907.4173&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The possibility to use functionals of occupation numbers and natural orbitals\nfor interacting fermions is discussed as an alternative to multi-reference\nenergy density functional method. An illustration based on the two-level Lipkin\nmodel is discussed."}, "authors": ["Denis Lacroix"], "author_detail": {"name": "Denis Lacroix"}, "author": "Denis Lacroix", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.3232085", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0907.0071v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0907.0071v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Proceeding of the conference \"Nuclear Structure and Dynamics\",\n  Dubrovnik, Croatia, 4-8 May, 2009", "arxiv_primary_category": {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0907.0071v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0907.0071v1", "journal_reference": null, "doi": "10.1063/1.3232085", "fulltext": "Energy functional based on natural orbitals and\noccupancies for static properties of nuclei.\nDenis Lacroix\n\narXiv:0907.0071v1 [nucl-th] 1 Jul 2009\n\nGANIL, CEA and IN2P3, Boîte Postale 5027, 14076 Caen Cedex, France\nAbstract. The possibility to use functionals of occupation numbers and natural orbitals for interacting fermions is discussed as an alternative to multi-reference energy density functional method.\nAn illustration based on the two-level Lipkin model is discussed.\nKeywords: Energy Density Functional, Density Matrix Functional Theory\nPACS: <21.60.Jz, 21.10.Dr\n\nINTRODUCTION\nThe nuclear many-body problem of N interacting nucleons can be solved exactly only\nin very specific cases or for very small particle numbers. This is due to the large number\nof degrees of freedom involved in such a complex system. Let us for instance consider\nparticles interacting through n Hamiltonian written as\nH = ∑ t i j a+\ni aj +\nij\n\n1\n+\nṽi jkl a+\ni a j al ak + * * *\n4 i∑\njkl\n\n(1)\n\nThen the exact ground state energy can be written as\nEExact (γ (1) , γ (2) , ...) = ∑ ti j γ ji +\n(1)\n\nij\n\n(1)\n\n(2)\n\n1\n(2)\nṽi jkl γkl, i j + * * * ,\n∑\n4 i jkl\n\n(2)\n\n+ +\nwhere γ ji ≡ ha+\ni a j i, γkl, i j ≡ hai a j al ak i, ... denote the one-, two-, ... body density\nmatrices that contain all the information on the one-, two-...body degrees of freedom\nrespectively. A natural way to reduce the complexity of this problem is to assume that\nat a given level, the k−body (and higher-order) density matrices becomes a functional\nof the lower-order ones. This is what is done for instance in the Hartree-Fock (HF)\napproximation where all k-body density matrices (with k ≥ 2) become a functional of\nγ (1) . Unfortunately, the HF theory applied to the nuclear many-body problem in terms of\nthe vacuum Hamiltonian is a poor approximation and Many-Body theories beyond HF\nare necessary.\nThe introduction of Energy Density Functional (EDF) approaches in the 70's was a\nmajor breakthrough (see for instance [1] for a recent review). In its simplest form, the\nEDF formalism starts with an energy postulated as a functional of γ (1) , the latter being\nbuilt out of a Slater Determinant. Then the ground state energy is obtained by minimizing\n\n\fthe energy with respect to γ (1) , i.e.\nEExact ≃ EMF (γ (1) )\n\n(3)\n\nParameters are generally adjusted on specific experimental observations and therefore\nencompass directly many-body correlations. Current EDF uses a generalization of eq.\n(3) obtained by considering quasi-particle vacua as trial states. By making explicit use\nof symmetry breaking, such a functional called hereafter Single-Reference (SR-) EDF\nis able to account for static correlation associated with pairing and deformation. Actual\nSR-EDF takes the form 1 :\nEExact ≃ EMF (γ (1) ) + ECor (κ .κ ∗)\n\n(4)\n\nwhere κ denotes the anomalous density. To restore symmetries and/or incorporate dynamical correlations, guided by the Generator Coordinate Method (GCM), a second\nlevel of EDF implementation, namely Multi-Reference (MR-) EDF is introduced. Recently, difficulties with the formulation and implementation of have been encountered in\nMR-EDF. A minimal solution has been proposed in ref. [2, 3, 4]. Besides these problems,\nthe authors of ref. [2] have pointed out the absence of a rigorous theoretical framework\nfor the MR EDF approach. At the heart of the problem is the possibility to break symmetries in functional theories and then restore them using configuration mixing. This\nissue needs to be thoroughly addressed in the future.\nIn this context, it is interesting to see if extensions of the functional used at the SREDF level can grasp part of the effects that for standard functionals require the MR level.\nIt is worth realizing that, in the canonical basis for which γ (1) = ∑i |φi ini hφi |, we have\nECor (κ .κ ∗) = ECor [{φi , ni }] =\n\nq\np\n1\nκκ\nv̄\nn\n(1\n−\nn\n)\nn j (1 − n j ),\ni\ni\niī j j ̄\n4∑\ni, j\n\n(5)\n\nand therefore, the energy can be regarded as a functional of natural orbitals φi and occupation numbers ni . As a matter of fact, for electronic systems, Gilbert has generalized\nthe Kohn-Sham theory and shown that the exact energy of a system can be obtained\nby minimizing such a functional [5] leading to the so-called Density Matrix Functional\nTheory (DMFT). The possibility to consider occupation numbers as building blocks of\nthe nuclear energy functional has recently been discussed in ref. [6, 7]. Two levels of\ntheory can be developed along the line of Gilbert's idea (i) either, functionals in the\nstrict Gilbert framework can be designed. In that case, since the density identify with the\nexact density at the minimum, it should respect all symmetries of the bare Hamiltonian.\n(ii) or we exploit the concept of symmetry breaking. In the latter case, similarly to the\nSR-EDF, strictly speaking we cannot anymore rely on the theorem, but we may gain\nbetter physical insight with relatively simple functionals.\n1\n\nNote that the denomination \"mean-field\" or the separation into a \"mean-field\" like and \"correlation\" like\nis completely arbitrary since, as we mention previously, the so-called \"mean-field\" part already contains\ncorrelation much beyond a pure Hartree-Fock approach.\n\n\fAPPLICATION TO THE LIPKIN MODEL AND DISCUSSION\nThe descriptive power of DMFT is illustrated here in the two-level Lipkin model [10].\nIn this model, the Hartree-Fock (HF) theory fails to reproduce the ground state energy whereas configuration mixing like Generator Coordinate Method (GCM) provides a suitable tool [8, 9]. Therefore, the two-level Lipkin model is perfectly suited\nboth to illustrate that DMFT could be a valuable tool and to provide an example of\na functional for system with a \"shape\" like phase-transition. In this model, one considers N particles distributed in two N-fold degenerated shells separated by an energy ε . The associated Hamiltonian is given by H = ε J0 − V2 (J+ J+ + J−J− ) where V\ndenotes the interaction strength while J0 , J± are the quasi-spin operators defined as\n†\n. c†+,p and c†−,p are\nJ0 = 12 ∑Np=1 (c†+,p c+,p − c†−,p c−,p ), J+ = ∑Np=1 c†+,p c−,p and J− = J+\ncreation operators associated with the upper and lower levels respectively. Due to the\nspecific formn of the Lipkin Hamiltonian , γo(1) simply writes in the natural basis as\nγ (1) = ∑Np=1 |φ0,p in0hφ0,p | + |φ1,p in1 hφ1,p | with n1 = (1 − n0 ). Introducing the angle α between the state |−, pi and |φ0 , pi, leads to the following mean-field functional\n[11]\no\nε n\nχ\nEMF ({φi,p, ni }) = EMF (α , n0 ) = − N cos(2α )(2n0 − 1) + sin2 (2α )(2n0 − 1)2 . (6)\n2\n2\nwhere χ = V (N − 1)/ε . This expression is easily obtained by generalizing the HartreeFock case (recovered here if n0 = 1). The main challenge of the method is to obtain an\naccurate expression for ECor . To get the functional, clearly identified cases from which\nproperties of the functional could be inferred have been used[11], namely the N = 2 case\nand the large N limit. In the two-particles case, the correlation energy can be analytically\nobtained and reads\nn\no\n\u0001p\nN=2\nECor (α , n0) = −2V sin2 (2α )n0 (1 − n0 ) + sin4 (α ) + cos4 (α )\nn0 (1 − n0 ) (.7)\nA simple extension of the N = 2 case for larger number of particles is to assume that each\nN = [N(N − 1)/2] E N=2 .\npair contributes independently from the others leading to ECor\nCor\nHowever, such a simple assumption leads to a wrong scaling behavior in the large\nN ∝ N 2 as N tends to infinity while a N 4/3 scaling\nN limit. Indeed, in this case, ECor\nis expected [12]. To obtain the correct limit, a semi-empirical factor η (N) can be\nintroduced such that\nN≥3\n\nECor (α , n0 ) = η (N)\n\nN(N − 1) N=2\nECor (α , n0 ),\n2\n\n(8)\n\nwith η (N) = cN −2/3 . The value c = 1.5 has been retained using a fitting procedure.\nExamples of results obtained by minimizing the functional given by Eqs. (6) and (8) are\nshown in Fig. 1 for different particle numbers and interaction strengths. In all cases, a\nvery good agreement, much better than the HF case is found.\nThe Lipkin example suggests that DMFT can be a valuable tool for describing ground\nstate of a many-body system when symmetry breaking plays a significant role. The\n\n\f-2.5\n\n-5\n\n-7.5\n\n-10\n\n-12.5\n0\n\n1\n\n2\n\n3\n\nFIGURE 1. Exact ground state energy (solid lines) displayed as a function of χ for N = 5 to 20 resp.\nfrom top to bottom. In each case, the corresponding HF (dashed line) and DMFT (filled circle) minimum\nenergy are shown. The DMFT calculation is performed using the mean-field and correlation energy resp.\ngiven by Eq. (6) and Eq. (8) with η (N) = 1.5 N −2/3 (Adapted from [11]).\n\nfunctional designed here is exact only in the N = 2. Note that the functional proposed\nhere breaks signature symmetry and therefore enters into the level (ii) of functional\ndiscussed in the introduction. The Lipkin model is however rather schematic and cannot\nbe used as a guidance for realistic situations. The possibility to design a new accurate\nfunctional for nuclei remains a challenging problem.\n\nACKNOWLEDGMENTS\nThe author thanks M. Assié, B. Avez, M. Bender, T. Duguet, C. Simenel, O. Sorlin\nand P. Van Isacker for enlightening discussions at different stages of this work and T.\nPapenbrock for useful remarks on the scaling behavior in the Lipkin model.\n\nREFERENCES\n1. M. Bender, P.-H. Heenen, and P.-G. Reinhard, Rev. Mod. Phys. 75, 121 (2003).\n2. D. Lacroix, T. Duguet, and M. Bender, Phys. Rev. C79, 044318 (2009).\n3. M. Bender, T. Duguet, and D. Lacroix, Phys. Rev. C79, 044319 (2009).\n4. T. Duguet, M. Bender, K. Bennaceur, D. Lacroix, and T. Lesinski, Phys. Rev. C79, 044320(2009).\n5. T. L. Gilbert, Phys. Rev. B 12, 2111 (1975).\n6. T. Papenbrock and A. Bhattacharyya, Phys. Rev. C75, 014304 (2007).\n7. M. G. Bertolli and T. Papenbrock, Phys. Rev. C78, 064310 (2008).\n8. P. Ring and P. Schuck, The Nuclear Many-Body Problem (Springer-Verlag, New-York, 1980).\n9. A. P. Severyukhin, M. Bender, P.-H. Heenen Phys. Rev. C 74, 024311 (2006).\n10. H. J. Lipkin, and N. Meshkov, Nucl. Phys. A62, 188 (1965).\n11. D. Lacroix, Phys. Rev. C79, 014301 (2009).\n12. S. Dusuel and J. Vidal, Phys. Rev. Lett. 93, 237204 (2004).\n\n\f"}