{"id": "http://arxiv.org/abs/1003.1833v1", "guidislink": true, "updated": "2010-03-09T09:08:06Z", "updated_parsed": [2010, 3, 9, 9, 8, 6, 1, 68, 0], "published": "2010-03-09T09:08:06Z", "published_parsed": [2010, 3, 9, 9, 8, 6, 1, 68, 0], "title": "Localization Technologies for Indoor Human Tracking", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.0494%2C1003.0541%2C1003.1930%2C1003.6042%2C1003.4979%2C1003.4948%2C1003.0407%2C1003.0809%2C1003.5979%2C1003.2173%2C1003.2654%2C1003.5514%2C1003.3817%2C1003.1446%2C1003.1210%2C1003.5402%2C1003.5227%2C1003.1656%2C1003.4379%2C1003.4271%2C1003.2804%2C1003.2443%2C1003.5555%2C1003.2751%2C1003.5040%2C1003.4663%2C1003.5047%2C1003.4042%2C1003.1010%2C1003.0447%2C1003.1441%2C1003.0049%2C1003.1538%2C1003.3780%2C1003.0653%2C1003.1743%2C1003.5199%2C1003.1587%2C1003.5119%2C1003.1648%2C1003.2247%2C1003.3961%2C1003.5734%2C1003.5977%2C1003.5611%2C1003.3335%2C1003.1356%2C1003.5661%2C1003.0916%2C1003.1026%2C1003.2618%2C1003.0449%2C1003.3699%2C1003.5482%2C1003.4930%2C1003.2693%2C1003.0907%2C1003.3539%2C1003.5343%2C1003.3503%2C1003.1399%2C1003.1706%2C1003.3426%2C1003.2267%2C1003.4653%2C1003.0830%2C1003.5132%2C1003.2856%2C1003.5353%2C1003.2269%2C1003.2874%2C1003.2085%2C1003.2057%2C1003.5066%2C1003.2917%2C1003.1009%2C1003.5914%2C1003.2843%2C1003.4439%2C1003.4286%2C1003.4430%2C1003.1864%2C1003.2271%2C1003.3914%2C1003.1692%2C1003.2685%2C1003.1860%2C1003.4370%2C1003.2648%2C1003.5596%2C1003.1256%2C1003.5249%2C1003.5841%2C1003.3161%2C1003.0804%2C1003.5992%2C1003.1833%2C1003.1878%2C1003.4279%2C1003.5428%2C1003.4613&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Localization Technologies for Indoor Human Tracking"}, "summary": "The proliferation of wireless localization technologies provides a promising\nfuture for serving human beings in indoor scenarios. Their applications include\nreal-time tracking, activity recognition, health care, navigation, emergence\ndetection, and target-of-interest monitoring, among others. Additionally,\nindoor localization technologies address the inefficiency of GPS (Global\nPositioning System) inside buildings. Since people spend most of their time in\nindoor environments, indoor tracking service is in great public demand. Based\non this observation, this paper aims to provide a better understanding of\nstate-of-the-art technologies and stimulate new research efforts in this field.\nFor these purposes, existing localization technologies that can be used for\ntracking individuals in indoor environments are reviewed, along with some\nfurther discussions.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.0494%2C1003.0541%2C1003.1930%2C1003.6042%2C1003.4979%2C1003.4948%2C1003.0407%2C1003.0809%2C1003.5979%2C1003.2173%2C1003.2654%2C1003.5514%2C1003.3817%2C1003.1446%2C1003.1210%2C1003.5402%2C1003.5227%2C1003.1656%2C1003.4379%2C1003.4271%2C1003.2804%2C1003.2443%2C1003.5555%2C1003.2751%2C1003.5040%2C1003.4663%2C1003.5047%2C1003.4042%2C1003.1010%2C1003.0447%2C1003.1441%2C1003.0049%2C1003.1538%2C1003.3780%2C1003.0653%2C1003.1743%2C1003.5199%2C1003.1587%2C1003.5119%2C1003.1648%2C1003.2247%2C1003.3961%2C1003.5734%2C1003.5977%2C1003.5611%2C1003.3335%2C1003.1356%2C1003.5661%2C1003.0916%2C1003.1026%2C1003.2618%2C1003.0449%2C1003.3699%2C1003.5482%2C1003.4930%2C1003.2693%2C1003.0907%2C1003.3539%2C1003.5343%2C1003.3503%2C1003.1399%2C1003.1706%2C1003.3426%2C1003.2267%2C1003.4653%2C1003.0830%2C1003.5132%2C1003.2856%2C1003.5353%2C1003.2269%2C1003.2874%2C1003.2085%2C1003.2057%2C1003.5066%2C1003.2917%2C1003.1009%2C1003.5914%2C1003.2843%2C1003.4439%2C1003.4286%2C1003.4430%2C1003.1864%2C1003.2271%2C1003.3914%2C1003.1692%2C1003.2685%2C1003.1860%2C1003.4370%2C1003.2648%2C1003.5596%2C1003.1256%2C1003.5249%2C1003.5841%2C1003.3161%2C1003.0804%2C1003.5992%2C1003.1833%2C1003.1878%2C1003.4279%2C1003.5428%2C1003.4613&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The proliferation of wireless localization technologies provides a promising\nfuture for serving human beings in indoor scenarios. Their applications include\nreal-time tracking, activity recognition, health care, navigation, emergence\ndetection, and target-of-interest monitoring, among others. Additionally,\nindoor localization technologies address the inefficiency of GPS (Global\nPositioning System) inside buildings. Since people spend most of their time in\nindoor environments, indoor tracking service is in great public demand. Based\non this observation, this paper aims to provide a better understanding of\nstate-of-the-art technologies and stimulate new research efforts in this field.\nFor these purposes, existing localization technologies that can be used for\ntracking individuals in indoor environments are reviewed, along with some\nfurther discussions."}, "authors": ["Da Zhang", "Feng Xia", "Zhuo Yang", "Lin Yao", "Wenhong Zhao"], "author_detail": {"name": "Wenhong Zhao"}, "author": "Wenhong Zhao", "arxiv_comment": "To appear in The 5th International Conference on Future Information\n  Technology (FutureTech), May 2010, Busan, Korea.", "links": [{"href": "http://arxiv.org/abs/1003.1833v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1003.1833v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cs.NI", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cs.NI", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cs.DC", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "68M10", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "C.2.4", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1003.1833v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1003.1833v1", "journal_reference": null, "doi": null, "fulltext": "Localization Technologies for Indoor Human\nTracking\nDa Zhang, Feng Xia, Zhuo Yang, Lin Yao\n\nWenhong Zhao\n\nSchool of Software\nDalian University of Technology\nDalian 116620, China\nf.xia@ieee.org\n\nCollege of Mechanical Engineering\nZhejiang University of Technology\nHangzhou 310032, China\nzwh2010@sina.com\n\nAbstract-The proliferation of wireless localization technologies\nprovides a promising future for serving human beings in indoor\nscenarios. Their applications include real-time tracking, activity\nrecognition, health care, navigation, emergence detection, and\ntarget-of-interest monitoring, among others. Additionally, indoor\nlocalization technologies address the inefficiency of GPS (Global\nPositioning System) inside buildings. Since people spend most of\ntheir time in indoor environments, indoor tracking service is in\ngreat public demand. Based on this observation, this paper aims\nto provide a better understanding of state-of-the-art technologies\nand stimulate new research efforts in this field. For these\npurposes, existing localization technologies that can be used for\ntracking individuals in indoor environments are reviewed, along\nwith some further discussions.\nKeywords-indoor localization; human tracking;\nmeasurement; positioning algorithms; wireless networking\n\nI.\n\nsignal\n\nINTRODUCTION\n\nIn the past decades, wireless localization technologies have\nundergone considerable progress. They gradually play an\nimportant role in all aspects of people's daily lives [1],\nincluding e.g. living assistant, navigation, emergency detection,\nsurveillance/tracking of target-of-interest, and many other\nlocation-based services. Reliable, accurate, and real-time\nindoor tracking services are required by people even more\nstrongly than ever. For example, with the severely increasing\nnumber of elder people, the aging population has become a\nburning issue for all modern societies around the world. It has\nconsequently become an urgent problem how to monitor those\nold people effectively when they are at home or inside other\nbuildings [2]. In addition, more and more attention has been\npaid to context-aware applications which can make our life\neasier and convenient [3]. The realization of these applications\nis essentially based on location information.\nFor outdoor environments, GPS (Global Positioning\nSystem) plays a dominant role in localization [4]. However, it\ndoes not work well in indoor scenarios. This inefficiency is due\nto the weakness of signals emitted by GPS and their disability\nto penetrate most building materials. Therefore, GPS does not\nfit well in indoor environments where people spend most of\ntheir time. Even though GPS devices are becoming more and\nThis work is partially supported by Natural Science Foundation of China\nunder Grant No. 60903153 and Zhejiang Provincial Natural Science\nFoundation of China under Grant No. Y108685.\n\nmore promising and ponderable in the future and are able to\nprovide sufficient precision for outdoor use, other effective\ntechnologies are demanded for indoor human/object tracking.\nTo fulfill this requirement, various indoor localization\ntechnologies have been developed in the literature [5].\nHowever, due to the complexity of indoor environments,\nthe development of an indoor localization technique is always\naccompanied with a set of challenges, e.g. NLOS (none line of\nsight), multipath effect, and noise interference. These\nchallenges result mainly from the influence of obstacles (e.g.\nwalls, equipments, and human beings) on the propagation of\nelectromagnetic waves. For instance, the mobility of people\nincurs changes in physical conditions of the environment,\nwhich might significantly affect the behavior of wireless radio\npropagation. Although these negative effects can not be\neliminated completely, in recent years researches are constantly\ngoing on to improve the performance of indoor (human/object)\ntracking. There are several survey papers in the literature of\nindoor localization, e.g. [1,3,6]. To inspire new research efforts\nin the field, there is still a need of better understanding of\nstate-of-the-art localization technologies. This paper is an\nattempt to serve for this purpose. We present a brief overview\nof existing localization techniques and methods, including\nsignal measurement methods, positioning algorithms,\nnetworking techniques and systems, which can be used for\nindoor human tracking.\nThe rest of this paper is organized as follows. Section II\nwill first illustrate basic concepts in indoor localization. The\nwhole localization process is divided into two phases, i.e.\nsignal measurement and position calculation. State-of-the-art\nlocalization methods and algorithms used in these two phases\nare reviewed in Sections III and IV respectively. In Section V,\nseveral popular network techniques used in the filed are\ndiscussed. Some well-known existing localization systems are\nalso compared. Section VI concludes the paper with a\ndiscussion on open issues.\nII.\n\nPROBLEM STATEMENT\n\nIndoor localization system, as Dempsey [7] defined, is a\nsystem that can determine the position of something or\nsomeone in a physical space such as in a hospital, a\ngymnasium, a school, etc. continuously and in real time. Based\non this concept, consider a typical scenario of indoor human\ntracking. First, each reference sensor node (with known\n\n\fposition) sends a ranging request to the compatible mobile\ndevice attached to the target (i.e. people to be located). This\ndevice could be for example a cell phone or a PDA. Then the\nmobile device perceives the request signals and issues a\nranging reply to the reference sensor. To this end, the sensor\ncould calculate the transmission time between the sensor and\nthe mobile device. Next, the sensor forwards the calculated\ntime to a calculation center. Usually the calculation center\ncould be a base station (BS) or a personal computer (PC). With\npowerful computational capability, the calculation center\nprocesses the received data using some positioning algorithm to\nobtain the position of the target.\nFrom the above description, we can see that in order to\nobtain the physical position of the target-of-interest in indoor\nenvironments, two steps are usually needed [3,8]: first, some\nposition-related signal parameters corresponding to wireless\ncommunications between the target and the sensor are\nmeasured; and then, the physical position of the target is\ncalculated based on these signal parameters.\nSecond Phase\n\nFirst Phase\n\nSignals\n\nSignal\nParameters\nSignal\nMeasurement\n\nPosition\nCalculation\n\nPosition of\nthe Target\n\nCoordinates of\nReference Nodes\n\nFigure 1. Two phases in localization\n\nAs shown in Fig. 1, the whole localization process can\ngenerally be divided into two phases: signal measurement and\nposition calculation. In the first phase, some signals are\ntransmitted between the target node (representing the\ncommunication entity attached to the people) and a number of\nreference (sensor) nodes. During this process, some properties\nof these signals, such as arrival time, signal strength, and\ndirection, are captured by the receivers. As such, certain signal\nparameters, such as TOA (Time of Arrival), TDOA (Time\ndifference of Arrival), RSS (Received Signal Strength), and\nAOA (Angle of Arrival), will be extracted. Various methods\nused in this phase will be covered in the next section.\nIn the second phase, the physical position of the target node\nwill be determined based on the signal parameters obtained in\nthe first phase. The most common technique used here is based\non ranging, whereby distance or angle approximations are\nobtained [3]. In this context, geometric approaches will be\nemployed to calculate the position of the target node as the\nintersection of position lines obtained from the position-related\nparameters at reference nodes. Trilateration and triangulation\nare two most popular geometric approaches, which will be\nintroduced in Section IV. In addition, since signal\nmeasurements in real systems are only accurate to some extent\n(especially in indoor environments), optimization-based\nstatistical techniques are often used to filter measurement noise\nand improve accuracy of the result.\n\nIII.\n\nSIGNAL MEASUREMENT\n\nIn this section, we elaborate on various measurement\nmethods involved in the first phase of localization (see Fig. 1).\nMore specifically, our focus is on the three most popular\ncategories of methods for this phase: one category is time based\nmethods; another is the angle based method (i.e. AOA); the\nthird is the received signal strength based method (i.e. RSS). In\nthe following, we describe relevant technologies belonging to\neach of these categories, with some related work reviewed.\nA. Time-based Methods\n1) Time-of-Arrival (TOA)\nWith TOA, the distance between the transmitting node and\nthe receiving node is deduced from the transmission time delay\nand the corresponding speed of signal as follows:\nR = time × speed\n\n(1)\n\nwhere speed denotes the traveling speed of the signal, time the\namount of time spent by the signal travelling from the\ntransmitting to the receiving node, and R the distance between\nthe transmitting node and the receiving node. Since speed can\nbe regarded as a known constant, R can be computed by\nobserving time.\nOne of the most widespread techniques uses TOA jointly\nwith UWB technology to achieve higher precision [9]. An\noverview of this combination has been given in [10]. It has\nbeen recognized that TOA technique can best deal with fine\ntime resolution with the help of UWB technology [11]. While\nTOA technique has a restrict requirement for synchronization,\nthis inefficiency can be compensated by UWB due to its nature\nof sensitivity to time. UWB technology uses short pulse\nduration to filter out the signals caused by reflection to improve\nthe overall performance. As a consequence, the combination of\nthese two technologies is predominant in the indoor\nlocalization field at present.\n2) Time Difference-of-Arrival (TDOA)\nThis technology uses two different kinds of transmitting\nsignals. The time difference between these two kinds of signals\nis used to reconstruct the transmitting node's position. The\ncalculation is based on the following equation:\n\nR R\n− = t1 − t2\nc1 c2\n\n(2)\n\nIn (2), c1 denotes the speed of one kind of signal, c2 the\nspeed of another kind of signal, t1 and t2 the time for these two\nsignals travelling from one node to the other respectively, and\nR still the distance between the transmitting node and the\nreceiving node.\nA considerable number of works have explored\nTDOA-based methods. For instance, Takabayashi et al. [12]\nemploy TDOA technique to realize target tracking. This\ntechnology is based on EKF (Extended Kalman Filter), FDOA\n(Frequency Difference of Arrival) and TDOA technologies.\nUnlike conventional methods which require enough sensors to\nestimate the position of target, the authors only use utilizable\nsensors to calculate the position. Therefore, the approach is\n\n\fpretty suitable in environments where the number of sensors is\nnot sufficient.\n\nnode by introducing the concept of super nodes which are\nactually virtual AOA-capable nodes.\n\n3) Round Trip Time (RTT)\nThis measurement method emerges with the goal of solving\nthe problem of synchronization incurred by TOA. With RTT,\nthe distance is calculated as follows:\n\nUnsurprisingly, AOA-based techniques have their\nlimitations. Since AOA-based methods are highly sensitive to\nmulti-path and NLOS, it is not suitable for indoor localization\nsometimes. As the distance increases, the localization precision\nwill decrease. In addition, technologies based on AOA require\nadditional antennas with the capacity to measure the angles.\nThis increases the cost of the whole system.\n\nR=\n\n(tRT − Δt ) × speed\n2\n\n(3)\n\nwhere tRT denotes the amount of time needed for a signal to\ntravel from one node to the other and back again, Δt the\npredetermined time delay required by the hardware device to\noperate at the receiving node, and speed the speed of the\ntransmitting signal. It is clear that RTT is a reciprocal\ntechnology [13,14]. Instead of using two local clocks in both\nnodes to calculate the delay (as TOA technology does), it uses\nonly one node to record the transmitting and arrival time.\nTherefore, to some extent, this technology solves the problem\nof synchronization.\n\nC. Received Signal Strength (RSS)\nFor the RSS based techniques, the distance is measured\nbased on the attenuation introduced by the propagation of the\nsignal from the transmitting node to the receiving node. An\nempirical mathematical model to calculate the distance\naccording to signal propagation is as follows [19,20]:\n\nAlthough time-based measurement methods are now in\nwidespread use, they are limited by restrict requirement of\nsynchronization [15]. That means it is necessary to set\nsynchronized clocks to both the transmitting nodes and the\nreceiving nodes. A consequence is that it would be very costly\nin order to install the system and maintain the accuracy at\nruntime. The RTT based techniques are able to solve the\nproblem of synchronization to a certain extent. However, they\nincrease the complexity of the whole (reference) sensor system\nto O(n2). In a sensor system consisting of n nodes, it takes\nevery node n times to locate its position through message\nexchanging. Additionally, with the RTT technology, other\nuncertain factors (e.g. noise) coexist during the process of time\nmeasurement. Therefore, the problem of synchronization\ndeserves further investigation.\n\nThe attenuation formula can be expressed in (4), where R\ndenotes the distance between the transmitter and the receiver,\nR0 a reference distance, p(R) and p(R0) the signal strength\nreceived at R and R0 respectively, nW the number of obstacles\nbetween the transmitter and the receiver, WAF the attenuation\nfactor of the wall, C the maximum number of obstacles\nbetween the transmitter and the receiver, and n the routing\nattenuation factor which could be determined by both\ntheoretical and empirical calculations.\n\nB. Angle-of-Arrival (AOA)\nWith respect to AOA-based techniques [5,6,8,16], the\nreference nodes or the target node has the capability of\nmeasuring the angle of arrival based on information obtained.\nFor this purpose, techniques like angle diversity may be\nutilized in order to exploit the directionality of the receiver.\nUsually, direction finding can be accomplished by either with\ndirectional antennas or with an array of antennas. The main\nprinciple behind the AOA measurement via antenna arrays\nconsists in that differences in arrival times of an incoming\nsignal at different antenna elements include the angle\ninformation given that the array geometry is known. With\nAOA, no time synchronization between nodes is required.\n\nAOA-based techniques have been widely used in the\nliterature. For example, Yang et al. [17] combine the AOA\ntechnology with another TOA-based technique, i.e. TDOA, to\nachieve higher accuracy. In [18], based on the basic AOA\nconcept, the authors develop a localization technique using\ncooperative AOA approach. Instead of requiring sets of\nacoustic model arrays and antenna arrays in each node like\nother conventional AOA based techniques, the approach only\nneeds one set of acoustic model array and antenna array in each\n\np( R ) = p( R0 ) − 10n log(\n\n⎧ nW × WAF (nW < C )\nR\n)−⎨\nR0 ⎩C × WAF (nW ≥ C )\n\n(4)\n\nBased on the RSS technology, several methods have been\nproposed to estimate the position of the target-of-interest. For\nexample, the fingerprint-based solution [21] for target\npositioning is the most typical application of RSS technology.\nIn general, we can divide the fingerprint methodology into two\nsteps: sampling (offline) and matching (online). In the\nsampling step, a database is created offline to store the radio\nsignal map consisting of the geographical positions and the\ncorresponding signal strengths. These signals may be e.g.\nsound, light, color, and human movement, among others. In the\nmatching step, the relevant signals collected for the target\n(node) are compared against the pre-stored records of the\ngeographic-signal map. By doing so, it will be able to\ndetermine where the target is, as long as any record in the\ndatabase is matched.\nIV.\n\nPOSITION CALCULATION\n\nBased on the signal parameters measured in the first phase\nand the known coordinates of reference nodes, it is then\npossible to calculate the physical position (i.e. coordinates) of\nthe target in the second phase of localization (Fig. 1). To do\nthis, the trilateration and triangulation techniques are\ncommonly used. In addition, statistical techniques could be\nemployed to improve the solution accuracy by coping with\nmeasurement noise. In this regard, we will introduce a very\npopular parametric approach: maximum likelihood estimation,\nthough there are many other approaches in the literature.\n\n\fA. Trilateration\nAs illustrated in Fig. 2, the trilateration based positioning\nalgorithm uses three fixed non-collinear reference nodes to\ncalculate the physical position of a target node (in 2D).\n\nC. Maximum Likelihood Estimation (MLE)\nMLE is a popular statistical method used for addressing the\nproblem of measurement uncertainty in localization. In this\nsubsection, we will describe MLE in the context of\ntrilateration-based positioning. Suppose the MLE method [20]\nuses n reference nodes to calculate the target node's\ncoordinates (generally n ≥ 3 ). The relevant equations are\ngiven below:\n\nB\n\nA\nR2\n\nR1\n\ndirection lines [6]. As shown in Fig. 3 where A and B represent\nreference nodes, after obtaining the angles θ1 , and θ2 , the\nphysical position of T (representing the target to be located)\ncould then be calculated based on the predetermined\ncoordinates of the reference nodes.\n\nT\nR3\n\nC\n\n⎧( x1 − x )2 + ( y1 − y )2 = R12\n⎪\n2\n2\n2\n⎪( x2 − x ) + ( y2 − y ) = R2\n⎨\n#\n⎪\n⎪( x − x ) 2 + ( y − y ) 2 = R 2\n⎩ n\nn\nn\n\nFigure 2. Trilateration-based positioning\n\nBased on the coordinates of three reference nodes: A(x1, y1),\nB(x2, y2), and C(x3, y3), and the corresponding distances from\neach reference node to the target node: R1, R2, and R3, we can\nobtain the following equations:\n\n⎧( x1 − x ) + ( y1 − y ) = R\n⎪\n2\n2\n2\n(5)\n⎨( x2 − x ) + ( y2 − y ) = R2\n⎪\n2\n2\n2\n⎩( x3 − x ) + ( y3 − y ) = R3\nwhere (x, y) denotes the (unknown) coordinates of the target T.\n2\n\n2\n\n2\n1\n\nBased on the trilateration algorithm, Han et al. [22] further\nimprove localization performance by taking into account the\nlayout of the three reference nodes. The work has approved that\nthe trilateration algorithm can best demonstrate its advantages\nwhen the three reference nodes are deployed in the vertices of\nequilateral triangles. Yang and Liu [23] consider the effect of\nnoisy environments, and use different confidence coefficients\nfor three nodes to guarantee the quality of trilateration.\nB. Triangulation\nWhen AOA measurements are available, triangulation can\nbe used to determine the position of the target node. Instead of\nmeasuring distances between nodes as trilateration does,\ntriangulation-based positioning is based on the measurement of\nangles, though they work in a similar manner. In most\nsituations, triangulation can be transformed to trilateration\nsince the distance between nodes can be reconstructed from the\nbearings between them. However, compared to trilateration,\nonly two reference nodes are needed for triangulation (in 2D),\ninstead of three.\nA\n\nθ1\nT\n\nB\n\nθ2\n\nFigure 3. Triangulation-based positioning\n\nWith triangulation, the position of the target node can be\ndetermined by the intersection of several pairs of angle\n\n(6)\n\nIn (6), using every equation to subtract the subsequent one,\nwe will get:\n⎧ x12 − xn2 − 2( x1 − xn ) x + y12 − yn2 − 2( y1 − yn ) y = R12 − Rn2\n⎪\n#\n⎨\n⎪ x 2 − x 2 − 2( x − x ) x + y 2 − y 2 − 2( y − y ) y = R 2 − R 2\nn −1\nn\nn −1\nn\nn −1\nn\nn −1\nn\n⎩ n −1 n\n\n2( y1 − yn ) ⎤\n⎡ 2( x1 − xn )\n⎢\n⎥,\nLet A = ⎢ #\n#\n⎥\n⎢⎣ 2( xn −1 − xn ) 2( yn −1 − yn ) ⎥⎦\n⎡ x12 − xn 2 + y12 − yn 2 + Rn 2 − R12\n⎤\n⎡x ⎤\n⎢\n⎥\nb=⎢\n#\n⎥ , and X = ⎢ y ⎥ ,\n⎣ ⎦\n⎢x 2 − x 2 + y 2 − y 2 + R 2 − R 2 ⎥\nn\nn −1\nn\nn −1\nn ⎦\n⎣ n −1\nthen we have AX = b .\nBy adopting the minimum variance estimation method, the\ncoordinates (x, y) of the target can be calculated based on the\nfollowing equation:\nX = ( AT A) −1 AT b\n(7)\nBesides estimating the coordinates of the target, the authors\nof [24] and [25] also use MLE to solve the problem of\nsynchronization by predicting the uncertain parameters in time\nbias. Particularly, Tian et al. [24] thoroughly analyzed the\nsource factors causing time bias in different transmission stages.\nThis analysis contributes to further research on resolving\ndifferent aspects of the synchronization problem.\nV.\n\nNETWORKING TECHNIQUES AND SYSTEMS\n\nIn this section, we first outline the signal technologies that\nare commonly used, discussing their pros and cons; then\nclassify existing systems into several groups and make a\ncomparison amongst them. It is worthy to note that not only the\nmeasurement method and positioning algorithm but also the\nsignal technology of a localization system can have a heavy\nimpact on the accuracy of localization.\n\n\fTABLE I.\n\nLOCALIZATION SYSTEMS\n\nSystem\n\nNetwork\n\nAccuracy\n\nMethod\n\nOverall Evaluation (A: Advantage; D: Disadvantage)\n\nWhereNet [31]\n\nRFID\n\n2m to 3m\n\nTDOA\n\nA: Uniquely identify equipment and person.\nD: Need numerous infrastructure components\n\nRADAR [32]\n\nWLAN\n\n2.26m out of Triangulation\n312m2\n\nA: Reuse the existing WLAN infrastructure.\nD: Low level accuracy, no consideration of privacy\n\nEKAHAU [33]\n\nWLAN\n\n1m\n\nA: Low cost and power level of the battery.\nD: Low level accuracy and only provide 2D location information.\n\nCOMPASS [34]\n\nWLAN\n\n1.65m out of Fingerprint\n312m2\n\nA: Consider the orientation impact of the user.\nD: Only consider single user.\n\nUbisense [35]\n\nUWB\n\nTens\nof\ncentimeters\n\nTDOA and AOA\n\nActive Badge [26]\n\nInfrared\n\nRoom level\n\nRSS\n\nFirefly [27]\n\nInfrared\n\n3.0mm\n\nNot available\n\nA: No requirement of line-of-sight; large coverage area; 3D\nlocation; high accuracy\nD: The price of the system is high.\nA: Address privacy\nD: Low accuracy; long transmission period; influenced by\nfluorescent light and sunlight\nA: High level accuracy; small measurement delay of 3 ms\nD: Use wire to connect tags and the coverage area is limited to 7m.\n\nOPTOTRAK [28]\n\nInfrared\n\n0.1mm\n0.5mm\n\nto Not available\n\nSonitor [36]\n\nUltrasound\n\nRoom level\n\nNot available\n\nIRIS_LPS [37]\n\nInfrared\n\n16cm out\n100m2\n\nof Triangulation\n\nActive Bat [29]\n\nUltrasound\n\n3cm out\n1000m2\n\nof Multilateration\n\nCricket [30]\n\nUltrasound, RF\n\n10cm\n\nRSSI\n\nA: High accuracy; able to measure relative motions on the different\nparts of one object.\nD: Limited by line-of-sight requirement.\nA: Energy efficient\nD: Low level accuracy\nA: Larger covered area\nD: Subject to interference from florescent light and sunlight\n\nA: Cover large area; provide 3-D position.\nD: Subject to reflections of obstacles; use a large number of\ntransmitters on the ceiling.\nTOA\nand A: Address privacy; low cost, decentralized administration.\ntriangulation\nD: More energy consumption\n\nA. Infrared (IR) Based Systems\nThe most prominent advantage of IR is its wide availability\nsince many devices are equipped with IR sources, such as\nmobile phones, TV, printer, PDAs, and so forth. In addition,\nsince the whole infrastructure is very simple, it does not need\ncostly installation and maintenance. However, due to its\nrequirement of line-of-sight and its inability to penetrate\nopaque obstacles, it can not be applied to some kinds of indoor\nscenarios in which the environment is pretty complex. Besides,\nit is subject to interference of other sources of IR devices.\nSeveral systems are based on this technology, including Active\nBadge [26], Firefly [27], and OPTOTRAK [28], for example.\nB. Radio Frequency (RF) Based Systems\nSystems designed based on RF can cover larger distance\nsince it uses electromagnetic transmission, which is able to\npenetrate opaque objects such as people and walls. Besides, a\nRF system can uniquely identify people or objects tracked in\nthe system. In the literature, triangulation and fingerprint\ntechniques are widespread used in RF based systems. Based on\nthis technology, RFID (Radio Frequency Identification),\nWLAN (Wireless Local Area Network), Bluetooth, wireless\nsensor networks, UWB (Ultra Wide Band) are created. In\naddition, RF based technologies are further divided into narrow\nband based technologies (RFID, Bluetooth and WLAN) and\nwide band based technologies (UWB). Amongst these\ntechnologies, UWB is the most accurate and fault-tolerant\nsystem that has a widespread usage in indoor localization.\n\nC. Ultrasound Based Systems\nAlthough the systems based on ultrasound technology is\nrelatively cheap, the precision is lower in comparison with\nIR-based systems due to the reflect influence. Additionally, this\nkind of systems is always associated with RF technology to\nfulfill the synchronization requirement, which may increase the\ncost of the whole system. Active Bat [29] and Cricket [30] are\nexample applications of ultrasound technology.\nIn Table I [1,5,6], we make a comparison between some\nmajor localization systems in various aspects, including\naccuracy, advantages and disadvantages, networking\ntechnologies and localization methods.\nVI.\n\nCONCLUSION\n\nIn this paper, we presented a brief overview of\nstate-of-the-art localization technologies for tracking\nindividuals in indoor environments. Some related works are\nreviewed. Despite the great progress made in recent years,\nthere are a number of open issues that need to be addressed.\nExamples include e.g. continuously tracking people travelling\nbetween indoor and outdoor environments, solving\nsynchronization problems, reducing the impact of noise\ninterference, and improving energy efficiency. Although some\nprevious technologies are concerned with these issues, they\nmight suffer from various limitations, e.g. increase in the cost\nof the whole system, precision deficiency, and severe\ncomputational overhead. Innovative research efforts are\nexpected to tackle these issues in the near future.\n\n\fREFERENCES\n[1]\n\n[2]\n\n[3]\n\n[4]\n[5]\n[6]\n\n[7]\n[8]\n[9]\n\n[10]\n\n[11]\n\n[12]\n\n[13]\n\n[14]\n\n[15]\n[16]\n[17]\n\nYanying Gu, Anthony Lo, Ignas Niemegeers, \"A Survey of Indoor\nPositioning Systems for Wireless Personal Networks\", IEEE\nCommunications Surveys & Tutorials, vol. 11, no. 1, 2009, Pages:13-32\nJason W.P. Ng, \"Ubiquitous Healthcare Localisation Schemes\", 7th\nInternational Workshop on Enterprise networking and Computing in\nHealthcare Industry, HEALTHCOM, June 2005, Page(s):156 - 161\nIsaac Amundson and Xenofon D. Koutsoukos, \"A Survey on\nLocalization for Mobile Wireless Sensor Networks\", R. Fuller and X.D.\nKoutsoukos (Eds.): MELT 2009, LNCS 5801, 2009, Pages: 235-254\nC. Fritsche, A. Klein, \"On the Performance of Hybrid GPS/GSM Mobile\nTerminal Tracking\", IEEE ICC Workshops, June 2009 Page(s):1- 5\nHolger Linde, \"On Aspects of Indoor Localization\", Thesis, University\nof Dortmund, August 2006\nHui Liu, H. Darabi, P. Banerjee, Jing Liu, \"Survey of Wireless Indoor\nPositioning Techniques and Systems,\" IEEE Trans. Systems, Man, and\nCybernetics, Part C: Applications and Reviews, Vol.37, No.6, October\n2007, pp. 1067-1080.\nM. Depsey, \"Indoor Positioning Systems in Healthcare\", Radianse\nInc.White Paper, 2003.\nS. Gezici, \"A survey on wireless position estimation\", Wireless Personal\nCommunications, vol. 44, no. 3, pp. 263-282, Feb. 2008\nC. Falsi, D. Dardari, L. Mucchi, M. Z.Win, \"Time of Arrival Estimation\nfor UWB Localizers in Realistic Environments\", EURASIP Journal on\nApplied Signal Processing, 2006, Article ID 32082, 13 pages\nI. Guvenc, C.-C. Chong, \"A Survey on TOA Based Wireless\nLocalization and NLOS Mitigation Techniques\", IEEE Communications\nSurveys and Tutorials, vol. 11, no. 3, 2009, Pages: 107-124.\nP. Cheong, A. Rabbachin, J.-P. Montillet, K. Yu and I. Oppermann,\n\"Synchronization, TOA and Position Estimationfor Low-complexity\nLDR UWB Devices\", IEEE International Conference on\nUltra-Wideband (ICU), Sept.2005, Pages: 480-484\nY. Takabayashi, T. Matsuzaki, H. Kameda, and M. Ito, \"Target Tracking\nUsing TDOA/FDOA Measurements in the Distributed Sensor Network\",\nSICE Annual Conference, August 2008 , Japan. Pages: 3441-3446\nS. Bartelmaos , K. Abed-Meraim, R. Leyman, \"General selection criteria\nto mitigate the impact of NLoS errors in RTT measurements for mobile\npositioning.\", IEEE ICC, June 2007, Pages: 4674-4679.\nAmgad Zeitoun Zhiheng Wang Sugih Jamin, \"RTTometer: Measuring\nPath Minimum RTT with Confidence\" IEEE Workshop on IP\nOperations and Management (IPOM), 2003, Pages:127-134\nLaurence Mailaender, \"Comparing Geolocation Bounds for TOA,\nTDOA and. Round-Trip TOA\", IEEE PIMRC, 2007, Pages:1-5.\nDragos ̧ Niculescu and Badri Nath, \"Ad Hoc Positioning System (APS)\nUsing AOA\", IEEE INFOCOM, March 2003, Pages: 1734-1743\nChunhua Yang, Yi Huang, Xu Zhu, \"Hybrid TDOA/AOA method for\nindoor positioning systems\", IET Seminar on Location Technologies,\nDec.2007, Pages:1-5\n\n[18] Hui Tian, Shuang Wang, Huaiyao Xie, \"Localization using Cooperative\nAOA Approach\", IEEE WiCOM'07, Sept. 2007, Pages: 2416-19\n[19] S.Y. Seidel and T.S. Rapport, \"914 MHz path loss prediction Model for\nIndoor Wireless Communications in Multi-floored buildings\", IEEE\nTrans. on Antennas & Propagation, Feb.1992, 40(2): 207-217.\n[20] Jun Zhao, Zero-Configuration Indoor Positioning System Based on RF\nSignal Strength, Master Thesis, Zhejiang University, May 2007.\n[21] Martin Azizyan, Ionut Constandache, Romit Roy Choudhury,\n\"SurroundSense: mobile phone localization\nvia ambiance\nfingerprinting\", ACM MobiCom, September 2009, Pages: 261-272\n[22] G. Han, D. Choi, W. Lim, \"A Novel Reference Node Selection\nAlgorithm Based on Trilateration for Indoor Sensor Networks\", IEEE\nIntl Conf. on Computer and Information Technology, 2007,\nPages:1003-1008\n[23] Zheng Yang, Yunhao Liu, \"Quality of Trilateration: Confidence based\nIterative Localization\", IEEE ICDCS, June 2008, Pages: 446-453.\n[24] Xianzhong Tian, Yonggang Miao, Tongsen Hu, Bojie Fan, Jian Pan,\nWei Xu, \"Maximum Likelihood Estimation Based on Time\nSynchronization Algorithm for Wireless Sensor Networks\", ISECS\nInternational Colloquium on Computing, Communication, Control, and\nManagement (CCCM), August 2009, Pages: 416-420.\n[25] Pau Closas, Carles Fernández-Prades, and Juan A. Fernández-Rubio,\n\"Maximum Likelihood Estimation of Position in GNSS\", IEEE Signal\nProcessing Letters, vol. 14, no. 5, May 2007, Pages:359-362.\n[26] Roy Want, Andy Hopper, Veronica Falcao, Jonathan Gibbons, \"The\nActive Badge Location System\", ACM Transactions on Information\nSystems (TOIS) , vol.10, no.1, January 1992, Pages:92-102.\n[27] Firefly\nMotion\nTracking\nSystem\nUser's\nguide,\n1999,\nhttp://www.gesturecentral.com/firefly/FireflyUserGuide.pdf.\n[28] Northen Digital Inc., Optotrak, http://www.ndigital.com/\n[29] The Bat Ultrasonic Location System, Cambridge University Computer\nLaboratory, http://www.cl.cam.ac.uk/research/dtg/attarchive/bat/\n[30] N. Priyantha, A. Chakraborty, and H. Balakrishnan, \"The cricket\nlocation-support system\", ACM MobiCom, 2000.\n[31] Zebra Technology Company, http://www.wherenet.com/\n[32] P. Bahl and V. Padmanabhan, \"RADAR: An in-building RF based user\nlocation and tracking system\", IEEE INFOCOM, vol. 2, March 2000,\npp. 775-784.\n[33] Ekahau, http://www.ekahau.com/\n[34] T. King, S. Kopf, T. Haenselmann, C. Lubberger and W. Effelsberg,\n\"COMPASS: A Probabilistic Indoor Positioning System Based on\n802.11 and Digital Compasses\", ACM WiNTECH, Los Angeles, USA,\nSept. 2006, Pages: 34-40.\n[35] Ubisense, http://www.ubisense.net/en\n[36] Sonitor, http://www.sonitor.com/\n[37] E. Aitenbichler, M. Mühlhäuser, \"An IR Local Positioning System for\nSmart Items and Devices\", IEEE ICDCS Workshops, May 2003,\nPages:334-339.\n\n\f"}