{"id": "http://arxiv.org/abs/0708.3939v1", "guidislink": true, "updated": "2007-08-29T11:51:56Z", "updated_parsed": [2007, 8, 29, 11, 51, 56, 2, 241, 0], "published": "2007-08-29T11:51:56Z", "published_parsed": [2007, 8, 29, 11, 51, 56, 2, 241, 0], "title": "Epidemics on random graphs with tunable clustering", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0708.2671%2C0708.4165%2C0708.0256%2C0708.1219%2C0708.2424%2C0708.3529%2C0708.1187%2C0708.0022%2C0708.1672%2C0708.1724%2C0708.2184%2C0708.0088%2C0708.0989%2C0708.1920%2C0708.4255%2C0708.0758%2C0708.1454%2C0708.2292%2C0708.1707%2C0708.2132%2C0708.1381%2C0708.2643%2C0708.2483%2C0708.3380%2C0708.1446%2C0708.3576%2C0708.3285%2C0708.4251%2C0708.4277%2C0708.2629%2C0708.2139%2C0708.0617%2C0708.0369%2C0708.1963%2C0708.2321%2C0708.3971%2C0708.3286%2C0708.0442%2C0708.2728%2C0708.1425%2C0708.3496%2C0708.1943%2C0708.0784%2C0708.1793%2C0708.3108%2C0708.2154%2C0708.1108%2C0708.3267%2C0708.2544%2C0708.0295%2C0708.3939%2C0708.3786%2C0708.2504%2C0708.2181%2C0708.1846%2C0708.0711%2C0708.3838%2C0708.3091%2C0708.1643%2C0708.0981%2C0708.1399%2C0708.4379%2C0708.2053%2C0708.4200%2C0708.0928%2C0708.3888%2C0708.2406%2C0708.3291%2C0708.2646%2C0708.3884%2C0708.0985%2C0708.0887%2C0708.3241%2C0708.0382%2C0708.3349%2C0708.2146%2C0708.3645%2C0708.3083%2C0708.1445%2C0708.2153%2C0708.2574%2C0708.3124%2C0708.0932%2C0708.0581%2C0708.1814%2C0708.1025%2C0708.1587%2C0708.3563%2C0708.2868%2C0708.0679%2C0708.3587%2C0708.4132%2C0708.1423%2C0708.1891%2C0708.3948%2C0708.4391%2C0708.3378%2C0708.3040%2C0708.2417%2C0708.3394%2C0708.0340&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Epidemics on random graphs with tunable clustering"}, "summary": "In this paper, a branching process approximation for the spread of a\nReed-Frost epidemic on a network with tunable clustering is derived. The\napproximation gives rise to expressions for the epidemic threshold and the\nprobability of a large outbreak in the epidemic. It is investigated how these\nquantities varies with the clustering in the graph and it turns out for\ninstance that, as the clustering increases, the epidemic threshold decreases.\nThe network is modelled by a random intersection graph, in which individuals\nare independently members of a number of groups and two individuals are linked\nto each other if and only if they share at least one group.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0708.2671%2C0708.4165%2C0708.0256%2C0708.1219%2C0708.2424%2C0708.3529%2C0708.1187%2C0708.0022%2C0708.1672%2C0708.1724%2C0708.2184%2C0708.0088%2C0708.0989%2C0708.1920%2C0708.4255%2C0708.0758%2C0708.1454%2C0708.2292%2C0708.1707%2C0708.2132%2C0708.1381%2C0708.2643%2C0708.2483%2C0708.3380%2C0708.1446%2C0708.3576%2C0708.3285%2C0708.4251%2C0708.4277%2C0708.2629%2C0708.2139%2C0708.0617%2C0708.0369%2C0708.1963%2C0708.2321%2C0708.3971%2C0708.3286%2C0708.0442%2C0708.2728%2C0708.1425%2C0708.3496%2C0708.1943%2C0708.0784%2C0708.1793%2C0708.3108%2C0708.2154%2C0708.1108%2C0708.3267%2C0708.2544%2C0708.0295%2C0708.3939%2C0708.3786%2C0708.2504%2C0708.2181%2C0708.1846%2C0708.0711%2C0708.3838%2C0708.3091%2C0708.1643%2C0708.0981%2C0708.1399%2C0708.4379%2C0708.2053%2C0708.4200%2C0708.0928%2C0708.3888%2C0708.2406%2C0708.3291%2C0708.2646%2C0708.3884%2C0708.0985%2C0708.0887%2C0708.3241%2C0708.0382%2C0708.3349%2C0708.2146%2C0708.3645%2C0708.3083%2C0708.1445%2C0708.2153%2C0708.2574%2C0708.3124%2C0708.0932%2C0708.0581%2C0708.1814%2C0708.1025%2C0708.1587%2C0708.3563%2C0708.2868%2C0708.0679%2C0708.3587%2C0708.4132%2C0708.1423%2C0708.1891%2C0708.3948%2C0708.4391%2C0708.3378%2C0708.3040%2C0708.2417%2C0708.3394%2C0708.0340&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this paper, a branching process approximation for the spread of a\nReed-Frost epidemic on a network with tunable clustering is derived. The\napproximation gives rise to expressions for the epidemic threshold and the\nprobability of a large outbreak in the epidemic. It is investigated how these\nquantities varies with the clustering in the graph and it turns out for\ninstance that, as the clustering increases, the epidemic threshold decreases.\nThe network is modelled by a random intersection graph, in which individuals\nare independently members of a number of groups and two individuals are linked\nto each other if and only if they share at least one group."}, "authors": ["Tom Britton", "Maria Deijfen", "Andreas Nordvall Lagerås", "Mathias Lindholm"], "author_detail": {"name": "Mathias Lindholm"}, "author": "Mathias Lindholm", "arxiv_comment": "17 pages, 1 figure", "links": [{"href": "http://arxiv.org/abs/0708.3939v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0708.3939v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.PR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.PR", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "92D30, 05C80", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0708.3939v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0708.3939v1", "journal_reference": null, "doi": null, "fulltext": "arXiv:0708.3939v1 [math.PR] 29 Aug 2007\n\nEpidemics on random graphs with tunable clustering\nTom Britton\n\n∗\n\nMaria Deijfen∗\nAndreas N. Lagerås∗\n∗\nMathias Lindholm\nJuly 2007\n\nAbstract\nIn this paper, a branching process approximation for the spread of a\nReed-Frost epidemic on a network with tunable clustering is derived.\nThe approximation gives rise to expressions for the epidemic threshold\nand the probability of a large outbreak in the epidemic. It is investigated\nhow these quantities varies with the clustering in the graph and it turns\nout for instance that, as the clustering increases, the epidemic threshold\ndecreases. The network is modelled by a random intersection graph, in\nwhich individuals are independently members of a number of groups and\ntwo individuals are linked to each other if and only if they share at least\none group.\nKeywords: Epidemics, random graphs, clustering, branching process, epidemic threshold.\nAMS 2000 Subject Classification: 92D30, 05C80.\n\n1\n\nIntroduction\n\nThis paper is concerned with Reed-Frost epidemics modified to take place\non random networks. Introduced in 1928 by two medical researchers, Lowell\nReed and Wade Frost, the Reed-Frost model is one of the simplest stochastic epidemic models. The spread of the infection takes place in generations:\nEach individual that is infective at time t (t = 0, 1, . . .) independently makes\ncontacts with all other individuals in the population with some probability p,\nand if a contacted individual is susceptible, it becomes infected at time t + 1.\nAlso at time t + 1, the infective individuals from time t are removed from the\nepidemic process.\nThe behavior of the Reed-Frost model is well understood, see e.g. von Bahr\nand Martin-Löf (1980). A crucial assumption which simplifies the analysis of\n∗\nDepartment of Mathematics, Stockholm University, 106 91 Stockholm, Sweden. E-mail:\ntomb@math.su.se, mia@math.su.se, andreas@math.su.se, lindholm@math.su.se\n\n\fthe model is that the population in which the epidemic takes place is taken\nto be homogeneously mixing, that is, an infective individual is assumed to\nmake contacts with all other individuals in the population with the same\nprobability. This assumption is of course very unrealistic, since, in a real-life\nepidemic, an infective individual is much more likely to infect individuals with\nwhom he/she has some kind of social connection. The Reed-Frost model can\neasily be adapted to incorporate this type of heterogeneity by introducing a\ngraph to represent the social structure in the population and then stipulating\nthat infective individuals can only infect their neighbors in the social network;\nsee Section 3. This modification makes the analysis of the model two-fold.\nFirstly, one wants to find a realistic model for the underlying social network,\nand, secondly, one wants to study the behavior of the epidemic on this graph.\nLarge complex networks such as social contact structures, the internet and\nvarious types of collaboration networks have received a lot of attention during\nthe last few years; see e.g. Dorogovtsev and Mendes (2003) and Newman et\nal. (2006) and the references therein. As for social networks, one of their most\nstriking features is that they are highly clustered, meaning roughly that there\nis a large number of triangles and other short cycles; see e.g. Newman (2003).\nThis is a consequence of the fact that friendship circles are typically strongly\noverlapping so that many of our friends are also friends of each other. A\nmodel that captures this in a natural way is the so called random intersection\ngraph, which is described in Section 2. Roughly, the idea of the model is that\npeople are members of groups - families, schools, workplaces etc. - and an\nedge is drawn between two individuals if they share at least one group. If\nthe relation between the number of individuals and the number of groups is\nchosen appropriately, this leads to a graph where the amount of clustering can\nbe tuned by adjusting the parameters of the model.\nAn important goal of network modelling is to investigate how the structure\nof the network affects the behavior of various types of dynamic processes on\nthe network; see Durrett (2006) for an overview. When it comes to epidemics,\nAndersson (1999) is a comprehensible introduction, in which expressions for\nthe epidemic threshold, the probability of a large outbreak and the final size\nof the epidemic are derived in a heuristic way for a number of underlying\ngraphs. Here, the epidemic threshold, commonly denoted by R0 , is defined as\na function of the parameters of the model such that a large outbreak in the\nepidemic has positive probability if and only if R0 > 1. In epidemic modelling,\na common technique for deriving expressions for the epidemic threshold and\nthe probability of a large outbreak is to use branching process approximations\nof the early stages of the epidemic. However, when studying epidemics on\nnetworks, dependencies between the edges in the graph tend to make branching\nprocess approximations more complicated. Results for epidemics on graphs\nwith arbitrary degree distribution can be found in Andersson (1998), and\nErdős-Rényi graphs and some extensions thereof are dealt with in Neal (2004,\n2006). There is however very little work done on more complicated graph\n2\n\n\fstructures.\nThe aim of this paper is to give a rigorous analysis of how clustering in a\nnetwork affects the spread of an epidemic. The network is modelled by a random intersection graph with tunable clustering and we then let a Reed-Frost\nepidemic propagate on this graph. Comparing the epidemic with a certain\nbranching process yields (implicit) expressions for the epidemic threshold and\nthe probability of a large outbreak. Numerical evaluations reveal that, as the\nclustering increases, the epidemic threshold decreases - that is, large outbreaks are possible for larger parts of the parameter space - but also that the\nactual value of the probability of a large outbreak decreases as the clustering\napproaches its maximal value. To our knowledge, this is the first rigorous\ninvestigation of how the spread of an epidemic is affected by clustering.\nIn Newman (2003:2), the effect of clustering on epidemics is studied by\nheuristic means, and calculations therein indicate that indeed the epidemic\nthreshold should decrease as the clustering increase. Furthermore, Trapman\n(2007) studies epidemics on graphs with a given expected number of triangles,\nbut the construction of the graph is more involved there. We mention also the\nwork by Ball et al. (1997) on the so called household model, which describes the\nspread of an epidemic in a population with group structure. The model there\nhowever is not formulated in terms of an underlying graph and the concept of\nclustering is not considered.\nThe paper is organized as follows. In Section 2, random intersection graphs\nand their properties are described in more detail. Section 3 contains the main\nresult - a comparison of a Reed-Frost epidemic on a random intersection\ngraph with a branching process - and its proof. In Section 4, the final size\nof the epidemic is commented on. It is observed that a thinned random intersection graph is in fact not a random intersection graph, implying that\nresults concerning the component structure in a random intersection graph\ncannot be used to draw conclusions about the final size of the epidemic. In\nSection 5, numerical results are presented and, finally, Section 6 contains a\nshort discussion.\n\n2\n\nRandom intersection graphs\n\nRandom intersection graphs were introduced in Singer (1995) and Karoński\net al. (1999). In its simplest form, the model is defined as follows: Given a\nset V of n vertices and a set A of m auxiliary vertices, construct a bipartite\ngraph Bn,m,r by letting each edge between vertices v ∈ V and a ∈ A exist\nindependently with probability r. The random intersection graph Gn,m,r with\nvertex set V is obtained by connecting two vertices v, w ∈ V if and only if\nthere is a vertex a ∈ A such that a is linked to both v and w in Bn,m,r . This\nconstruction can be generalized in various ways - see e.g. Godehardt and\nJaworski (2002) and Deijfen and Kets (2007) - but in this paper we will stick\n\n3\n\n\fto the above formulation. We will also specialize to the case when m = ⌊βnα ⌋\nfor some constants α, β > 0; see Karoński et al. (1999) for a motivation of this\nchoice of m. In fact, to get a graph with tunable clustering, we will soon take\nα = 1.\nIf the vertices in V and A are thought of as individuals and groups respectively, then the random intersection graph provides a model for a social\nnetwork where individuals are connected if there is at least one group where\nthey are both members. The probability that two individuals do not share\nany group is (1 − r 2 )m , implying that the edge probability in the random intersection graph is 1 − (1 − r 2 )m , and hence the expected degree of a fixed\nvertex is\n(n − 1)(1 − (1 − r 2 )m ) = βr 2 n1+α + O(r 4 n1+2α ).\n\nTo keep this expression bounded as n → ∞, we let r = γn−(1+α)/2 for some\nγ > 0. The expected degree then tends to βγ 2 as n → ∞.\nAs for the asymptotic distribution of the vertex degree with the above\nchoices of m and r, it is shown in Stark (2004) to be a point mass at 0\nfor α < 1, a compound Poisson distribution, describing the law of a sum\nof a Poisson(βγ) distributed number of independent Poisson(γ) variables for\nα = 1, and a Poisson(βγ 2 ) distribution for α > 1. To see this, note that the\nnumber of groups that an individual belongs to is binomially distributed with\nmean mr = βγn(α−1)/2 . For α < 1, this goes to 0 as n → ∞, explaining the\npoint mass at 0. For α = 1, the number of group memberships per individual\nis asymptotically Poisson(βγ) distributed, and the sizes of the groups are\nPoisson(γ), with overlaps between groups being very unlikely if n is large,\nindicating that the degree distribution should indeed be compound Poisson.\nWhen α > 1, each individual belongs to infinitely many groups as n → ∞.\nThis means that the edge indicators are asymptotically independent, which\nsuggests a Poisson distribution for the vertex degree. In fact, for α > 1,\nthe random intersection graph is similar to the standard Erdős-Rényi random\ngraph; see Fill et al. (2000).\nMoving on to the clustering in the graph, for two vertices v, w ∈ V, let Ivw\ndenote the edge indicator for the edge between v and w in Gn,m,r , and write\nPn for the probability measure of Gn,m,r . We then define the clustering as\nc = cα,β,γ := lim Pn (Ivw = 1|Ivu Iwu = 1),\nn→∞\n\nthat is, c is the limiting conditional probability that there is an edge between\ntwo vertices v and w, given that they have a common neighbor u. The expected\nnumber of groups that individual u belongs to is βγn(α−1)/2 , which goes to 0,\nβγ or infinity, depending on whether α < 1, α = 1 or α > 1. As a consequence,\nthe limiting probability that two individuals v and w who both share a group\nwith u in fact share the same group with u - thus being connected to each\nother - will behave differently depending on the value of α. More specifically,\n\n4\n\n\fit is shown in Deijfen and Kets (2007) that\n\nif α < 1;\n 1\n−1\ncα,β,γ =\n(1 + βγ)\nif α = 1;\n\n0\nif α > 1.\n\nIn view of the result from Stark (2004) concerning the degree distribution\nand the characterization of the clustering from Deijfen and Kets (2007), the\nbest choice if we want to use a random intersection graph to describe a social\nnetwork seems to be α = 1. This gives rise to a model where both the mean\ndegree and the clustering can be tuned by adjusting the parameters β and γ.\nMore precisely, with D denoting the limiting degree of a fixed vertex, we have\nthat\nE[D] = βγ 2 and c = (1 + βγ)−1 .\n(n)\n\nFor the remainder of this paper we fix α = 1 and write Gβ,γ = G (n) and\n(n)\n\nBβ,γ = B (n) for the corresponding random intersection graph and its underlying bipartite graph (omitting the subscripts when the dependence on β and γ\ndoes not need to be emphasized).\n\n3\n\nThe epidemic model and an approximating branching process\n\nConsider a closed homogeneous population consisting of n individuals, labelled v1 , . . . , vn , with a social structure represented by a random intersection\ngraph G (n) . We will use the Reed-Frost dynamics to describe the spread of\nan infection in this population. The social graph G (n) is assumed to be fixed\nthroughout the spread of the infection. Furthermore, for simplicity, we start\nwith one single randomly selected infective individual at time 0, the rest of the\npopulation being susceptible. Without loss of generality, we assume that the\ninitial infective, which will be referred to as the index case, is individual v1 .\nAn individual that is infective at time t (t = 0, 1, . . .) contacts each one of its\nneighbors in G (n) independently with some probability p, and if a contacted\nneighbor is susceptible, it becomes infective at time t + 1. The individuals\nthat were infective at time t are removed from the epidemic process at time\nt + 1 (by immunity or death) and take no further part in the spread of the\ninfection.\nWe will be concerned with the set E (n) of individuals that are ultimately\naffected by the above epidemic. More precisely, we will construct a branching\nprocess that can be used to determine whether E (n) is finite or infinite in the\nlimit as n → ∞. To this end, first note that E (n) can be identified with the\ncluster containing the index case in an edge percolation process on G (n) in\nwhich each edge is open independently with probability p. Open edges in\nthe percolation process are interpreted as possible transmission links for the\n5\n\n\fdisease, that is, if one of the vertices of an edge is infective at time t and\nthe other one is not, then the uninfected vertex becomes infective at time\nt + 1. Furthermore, if we consider the percolation cluster of a particular\nvertex restricted to a subgraph of G (n) , then the size of this cluster has the\nsame distribution as the final size of a Reed-Frost epidemic on the subgraph. In\nparticular, if Rk is the size of the percolation cluster of a given vertex belonging\nto a complete subgraph with k nodes, then the distribution of Rk , denoted\nby Fk , is that of a Reed-Frost epidemic initiated by one single individual in\na homogeneously mixing population of size k. The distribution Fk can be\ncomputed recursively; see Andersson and Britton (2000: Section 1.2).\nWe now define the branching process that will be used to approximate the\nepidemic process. To begin with, note that the groups in a random intersection graph generate complete subgraphs with sizes that are asymptotically\nPoisson(γ) distributed. Hence, in the limit as n → ∞, the size of an outbreak\nstarted by a given individual in a given group is\nR ∼ F :=\n\n∞\nX\nk=0\n\nFk\n\nγ k −γ\ne .\nk!\n\n(1)\n\nRecall that the number of groups that a given individual is a member of is\nasymptotically Poisson(βγ) distributed. Let f be the generating function of a\nsum of a Poisson(βγ) number of i.i.d. variables R1 , R2 , . . . , all distributed as\nR, that is,\n\b\nf (s) = exp βγ(E[sR ] − 1) ,\n\n(2)\n\nand let {Z(t) : t ≥ 0} be a discrete time branching process with offspring\ngenerating function f , that is, E[sZ(1) ] = f (s). Finally, write E for the total\nprogeny in such a process, that is,\nE=\n\n∞\nX\n\nZ(t).\n\nt=0\n\nLet E (n) = |E (n) | denote the final size of a Reed-Frost epidemic on a random\nintersection graph G (n) . Our main result is the following theorem, which will\nbe proved by relating the initial phases of the epidemic to a branching process\nwith the same distribution as {Z(t) : t ≥ 0} as n → ∞.\nTheorem 3.1 As n → ∞, we have that E (n) → E in distribution.\nDefine ρ to be the smallest non-negative root of the equation f (ρ) = ρ.\nIt follows from standard results in branching processes theory that P (E =\n∞) = 1 − ρ and that ρ < 1 if and only if E[Z(1)] > 1; see e.g. Athreya and\nNey (1972). Combining this with Theorem 3.1 gives the following corollary\nconcerning the asymptotic behavior of the epidemic.\n6\n\n\fCorollary 3.2 Define R0 := E[Z(1)] = βγE[R] and write π = 1 − ρ. As\nn → ∞, we have that\n(a) E (n) → ∞ with probability π;\n(b) π > 0 if and only if R0 > 1.\nBefore we continue with the proof of the theorem, we will state and prove\na lemma concerning the bipartite graph B (n) . To this end, for an arbitrary\ngraph G with vertex set W, the subgraph of G induced by some subset W ′ ⊂ W\nis defined to be the subgraph consisting the vertices in W ′ together with all\nedges in G that run between vertices in W ′ . Let C (n) (t) be the vertices of B (n)\nat distance t from vertex v1 . Note that a vertex in B (n) may be either an\nindividual (that is, a vertex v ∈ V) or a group (that is, an auxiliary vertex\na ∈ A ), and that vertices at odd distance from v1 correspond to groups and\nvertices at even distance to individuals.\nLemma 3.3 Let κ > 0 be such that 1/κ > 2 log(βγ 2 ). As n → ∞, the\nprobability that the subgraph of B (n) induced by C (n) (⌊κ log n⌋), is a tree, tends\nto 1.\nProof of Lemma 3.3 We will build up C (n) (t) by a sequence {D (n) (t) : t ≥\n0}, constructed in such a way that C (n) (t) = ∪0≤s≤t D (n) (s). For odd t, the\nset D (n) (t) will consist of groups and for even t by individuals. To begin\nwith, by definition, we have C (n) (0) = {v1 }, so necessarily D (n) (0) = C (n) (0).\nFor odd t, the set D (n) (t) is then constructed by choosing, independently\nfor each individual in D (n) (t − 1), a Binomial(m, γ/n) distributed number of\ndistinct groups in A, and, likewise, for even t, we construct D (n) (t) by choosing,\nindependently for each group in D (n) (t − 1), a Binomial(n, γ/n) distributed\nnumber of distinct individuals in V. Let X (n) be a compound binomial random\nvariable with generating function\nh (n) i \u0010\nγ\nγ\u0010\nγ \u0011n \u0011m\nγ\n1− + s\n,\n= 1− +\ng(s) = E sX\nn n\nn n\nand let {X (n) (t) : t ≥ 0} be a branching\nprocess with offspring distribution\nP\nX (n) . Furthermore, write Y (n) (t) = ts=0 X (n) (s) for the total progeny of the\nbranching process at time t. Then, for even t, the number of individuals (not\nnecessarily distinct) that have been chosen in the construction of the process\nC (n) (t), has the same distribution as Y (n) (t/2), and the number of groups (not\nnecessarily distinct) that have been chosen is (stochastically) strictly smaller\nthan Y (n) (t/2).\nDefine μn := E[X (n) ] = γ 2 m/n and note that βγ 2 (1 − n1 ) ≤ μn ≤ βγ 2 ,\nso μn → μ := βγ 2 as n → ∞. By a well known result in branching process\n(n) (t) → W (n) almost surely as t → ∞, where W (n)\ntheory, we have that μ−t\nn X\nis a random variable with W (n) ≡ 0 if and only if μn ≤ 1; see Athreya and Ney\n7\n\n\f(1972). Furthermore, W (n) → W in distribution as n → ∞, where W is the\ncorresponding limiting random variable for the branching process {X(t) : t ≥\n0} with offspring generating function E[sX(1) ] = exp{βγ(eγ(s−1) − 1)}. Thus\nX (n) (t) = μtn (W (n) + ot (1)) = μtn (W + on (1) + ot (1)) ≤ μt (On (1) + Ot (1)),\nwhere ox (*) and Ox (*) is the usual order notation when x → ∞. It follows\nthat Y (n) (t) ≤ μt (On (1) + Ot (t)), and, when we set t = ⌊κ log n⌋ with 1/κ >\nmax{2 log μ, 0}, we get\n√\nY (n) (⌊κ log n⌋) ≤ elog μ⌊κ log n⌋ On (log n) = on ( n).\nNow note that, if all individuals and groups that have been chosen in the\nconstruction of C (n) (t) are distinct, then clearly the subgraph of B (n) induced\nby C (n) (t) is a tree. Thus the probability in the statement of the lemma is\ngreater than\nY (n) (⌊κ log n⌋) \u0012\n\nY\n\nk=1\n\nk\n1−\nn\n\n\u0013\u0012\n\nk\n1−\nm\n\n\u0013\n\n=\n\n= exp\n\n√\n\u001a o(X\nn) \u0012\n\n= exp\n\n\u001a\n\nk=1\n\n\u0012\n\nk\nlog 1 −\nn\n\n\u0012\n\n1\n− 1+\nβ\n\n\u0013\n\n√\n\u0013 o(X\nn) \u0012\nk=1\n\n\u0012\n\nk\n+ log 1 −\nm\n\nk\n+O\nn\n\n\u0012\n\nk2\nn2\n\n\u0013\u0013 \u001b\n\n\u0013\u0013 \u001b\n\n= exp{o(1)} → 1,\nand the lemma is proved.\n\n✷\n\nProof of Theorem 3.1 The idea of the proof is to construct a branching\nprocess {Z (n) (t) : t ≥ 0} that counts the number of individuals infected by\nthe epidemic in its initial stage, though not necessarily in chronological order.\nThe branching process will be defined in such a way that, if it goes extinct,\nthen its total progeny will be equal to the final size of the epidemic, while, if\nit explodes, the epidemic will have infected a number of individuals which is\nincreasing polynomially in n. As n → ∞, we will have Z (n) → Z - where Z\nis the branching process in the formulation of the theorem - and the theorem\nthus follows.\nFirst, we describe the initial spread of the disease among the individuals/groups in the set C (n) (⌊κ log n⌋) with a process {E (n) (t) : 0 ≤ t ≤ ⌊κ log n⌋}.\nWe only consider the case when the subgraph of B (n) induced by C (n) (⌊κ log n⌋)\nis a tree. By Lemma 3.3, the probability of the complimentary set tends to\nzero as n → ∞, so we can disregard it. Furthermore, our construction will\nbe such that E (n) (t) ⊆ C (n) (t) for all t, implying that nodes of E (n) (⌊κ log n⌋)\nconstitute a tree itself if seen as a subgraph of B (n) .\n8\n\n\fThe construction of E (n) (t) is similar to the construction of C (n) (t) described in Lemma 3.3. Namely, we will define a sequence {F (n) (t) : 0 ≤ t ≤\n⌊κ log n⌋} and then set E (n) (t) = ∪0≤s≤t F (n) (s). To this end, first let F (n) (0)\nconsist of the initial infective, that is F (n) (0) = {v1 }. Then, for odd t, let\nF (n) (t) consist of the groups of the individuals in F (n) (t − 1) that are at\ndistance t from v1 , that is,\nF (n) (t) = {a ∈ D (n) (t) : ∃v ∈ F (n) (t − 1) such that v ∈ a}.\nTo define F (n) (t) for even t, recall the percolation representation of the set\nof ultimately infected individuals in G (n) described before the theorem. For\na\ntwo vertices v, w belonging to a group a, write v ↔ w for the event that there\nexists a path of open edges - that is, edges that can be used for disease\ntransmission - connecting v and w, with the additional property that the\na\nwhole path is contained in group a. Furthermore, let Ka,v = {w ∈ a : v ↔ w}.\nThis is to be thought of as the local outbreak in group a caused by individual\nv, if v itself becomes infected from outside of group a. As pointed out before\nthe formulation of the theorem, given that |a| = k, we have that |Ka,v | ∼ Fk ,\nwhere Fk is the distribution of the final size of of a homogeneous Reed-Frost\nepidemic initiated by a single individual in a population of size k. Note that\n|a| ∼ Binomial(n,P\nγ/n), and, for future use, let R(n) be a random variable\nwith distribution k Fk P (|a| = k), that is, the size of a local outbreak in a\ngroup, not conditioning on the group size. Now, for even t, define F (n) (t) to\nbe the individuals infected in the local outbreaks caused by the individuals in\nF (n) (t − 2), that is,\nF (n) (t) = {w ∈ Ka,v : a ∈ F (n) (t − 1), v ∈ F (n) (t − 2)}.\nWe will now study the growth of |E (n) (t)|. To this end, for 0 ≤ t ≤ 21 ⌊κ log n⌋,\ndefine Z (n) (t) = |F (n) (2t)|. Then, since the subgraph of B (n) induced by\nC (n) (2t) is a tree for t ≤ 12 ⌊κ log n⌋, by construction, Z (n) (t) is a branching\nprocess with a compound binomial offspring distribution. The generating\nfunction of the offspring distribution is\nh (n) i \u0010\nγ h (n) i\u0011m\nγ\n.\n(3)\nfn (s) = E sZ (1) = 1 − + E sR\nn n\nFor t ≥ 12 ⌊κ log n⌋ we let Z (n) (t) evolve by the same branching mechanism,\nthat is, as a discrete time branching process with offspring distribution defined\nby (3). For t ≥ 21 ⌊κ log n⌋ however, Z (n) (t) is no longer related to the epidemic\nprocess.\nLet ρn be the smallest non-negative root of ρn = fn (ρn ), and define An =\n{limt→∞ Z (n) (t) = 0} (the extinction set) and Tn = inf{t : Z (n) (t) = 0} (the\nextinction time). Then P(An ) = P\nρn , and, since Tn is finite on An , the total\nn\nZ (n) (t), is finite on An . As n → ∞, we\nprogeny of the branching process, Tt=0\nhave that Z (n) → Z in distribution and ρn → ρ, where Z(t) is the branching\n9\n\n\fprocess appearing in the theorem and ρ the equivalent of ρn in this process.\nFurthermore, T (n)P\n→ T in distribution, where T = inf{t : Z(t) = 0}. It\nfollows that E = ∞\nt=0 Z(t) is finite on the event A = {limt→∞ Z(t) = 0}.\nThis implies that, on An , the final size E (n) of the epidemic converges to\nE as n → ∞. On the complementary sets Acn , the process Z (n) (t) grows\nexponentially in t. More precisely,\nZ (n) (⌊κ log n⌋) = nκ log R0 (W ′ + o(1)),\nwhere W ′ > 0 due to the conditioning on explosion (recall the proof of Lemma\n3.3). Furthermore, we have that Z (n) (⌊κ log n⌋) ≤ E (n) on Acn , and thus\nE (n) → ∞ on Acn . This proves the theorem.\n✷\n\n4\n\nThe final outcome of the epidemic\n\nThe branching process approach from the previous section gives basically no\ninformation on the behavior of the epidemic in the case of explosion. In this\nsection we will elaborate a bit on this problem.\nAs already described, one way of getting a grip of the final outcome of the\nepidemic, is to consider an edge percolation process on the underlying graph,\nwhere each edge in the graph is independently removed with probability 1 − p\nand kept with probability p. The vertices that belong to the component of the\ninitial infective in the graph so obtained correspond to the individuals that\nhave experienced the infection at the end of the epidemic. If the structure\nof the thinned graph is known, then this observation might be useful in investigating the final size of the epidemic. For instance, if there is a unique\ngiant component in the thinned graph - that is, if the outcome of the percolation process contains a unique cluster of order n - then the relative size\nof this component gives the probability of an outbreak of order n in the epidemic. Such an outbreak is often referred to as a major outbreak, and, in\nmost epidemic models, the probability of such an outbreak coincides with the\nprobability of explosion in the branching process describing the initial stages\nof the epidemic (denoted by π in this paper). This however require additional\narguments.\nIn our case, the social network is a random intersection graph with α = 1.\nUnfortunately, to date there are no rigorous results concerning the component\nstructure in a random intersection graph with α = 1, but see Behrisch (2007)\nfor results when α 6= 1. Also, in Newman (2003:2), (implicit) expressions\nfor the size of the largest component in a random graph construction which\nis similar to the random intersection graph are derived by heuristic means\nand it is observed that the relative final size of the giant component seems to\ndecrease as the clustering in the graph increases. An argument in support of\nthe claim that high clustering in a graph causes the components to be small is\nthe following: Consider an arbitrary graph with n vertices and k = O(n) edges\n10\n\n\fand assume that the clustering equals 1. This implies that all subgraphs are\ncomplete. Hence, with nmax denoting the size of the largest subgraph,\nwe have\n\u0001\nthat the number of edges in the maximal subgraph is nmax\n.\nIt\nfollows\nthat\n2\n√\n√\nnmax ≤ O( k) = O( n), that is, the relative size of the largest component\ntends to zero,\nIndeed, the lack of rigorous results concerning the components in a random\nintersection graph with α = 1 makes it harder to study the final size of an\nepidemic on such a graph. A second complicating circumstance is that thinning\na random intersection graph gives rise to a graph that no longer belongs to the\nclass of random intersection graphs; see the below proposition. This means\nthat, even if there would be results for the component structure, these would\nnot be applicable to a thinned graph. Hence it remains an open problem to\nquantify the final outcome of the epidemic.\n(n)\n\nProposition 4.1 Let Θp (Gβ,γ ) denote the graph generated by removing edges\n(n)\n\nin Gβ,γ independently with probability 1 − p. It does not exist β ′ = β ′ (β, γ, p)\n(n)\n\nd\n\n(n)\n\nand γ ′ = γ ′ (β, γ, p) such that Θp (Gβ,γ ) = Gβ ′ ,γ ′ for every n.\n\nProof. The idea of the proof is to observe that certain types of subgraphs\n(n)\n(n)\nwill appear with different frequency in Θp (Gβ,γ ) as compared to Gβ,γ . The\nsubgraph that we will consider consists of four vertices and five edges:\n•@\n\n•\n\n•\n\n•\n\n@@\n@@\n@@\n\nWrite K4′ for this graph type, and note that it can be obtained for instance by\nremoving one edge from a complete subgraph with four vertices, a graph type\nthat we denote by K4 . Furthermore, we introduce the term vertex-induced\nsubgraph, for a subgraph of some given graph such that the subgraph consists\nof a subset of the vertices in the original graph together with all edges between\nthese vertices that are present in the original graph.\nThe number X4 of vertex-induced subgraphs of type K4 in the random\n(n)\nintersection graph Gβ,γ dominates the number of groups of size four in the\nconstruction of the random intersection graph. Since the size of a fixed\ngroup is Binomial(n,\n\u0001 γ/n) distributed, the number of groups of size four is\nBinomial(⌊βn⌋, n4 (γ/n)4 (1 − γ/n)n−4 ) distributed, and hence E[X4 ] ≥ O(n).\nIt follows that the number X4′ (p) of vertex-induced subgraphs of type K4′ in\n(n)\nthe thinned graph Θp (Gβ,γ ) is also at least of the order n, since, as mentioned,\none way of obtaining graphs of type K4′ is to remove one edge in graphs of\ntype K4 , that is, E[X4′ (p)] ≥ (1 − p)p5 E[X4 ] ≥ O(n).\nNow consider the number X4′ of vertex-induced subgraphs of type K4′ in\n(n)\nthe random intersection graph Gβ,γ . This number is related to the number\n11\n\n\fof ways that four individuals v1 , . . . , v4 can be assigned to different groups so\nthat a graph of type K4′ is obtained. Consider for instance the following graph\nof type K4′ :\nv1 •\n•v2\n>\nv3 •\n\n>>\n>>\n>>\n>\n\n•v4\n\nWrite {(vi1 , vi2 )(vj1 , vj2 )(vk1 , vk2 )} for the event that vi1 and vi2 share a group,\nthat vj1 and vj2 share another group and that vk1 and vk2 share yet another\ngroup. Then, for the above graph to arise, the individuals v2 and v3 cannot\nshare any group - the probability that they avoid doing so goes to 1 as n → ∞\n- and, in addition, one of the following events must occur:\n{(v1 , v2 , v4 )(v1 , v3 , v4 )}\n{(v1 , v2 , v4 )(v1 , v3 )(v3 , v4 )}\n{(v1 , v3 , v4 )(v1 , v2 )(v2 , v4 )}\n{(v1 , v2 )(v1 , v4 )(v2 , v4 )(v1 , v3 )(v3 , v4 )}.\nIt follows that\nE[X4′ ]\n\n\u0012\n\n\u0013\n\u0012\n\u0013\n⌊βn⌋\n6\n4 ⌊βn⌋\n≤n\n(γ/n) + 2n\n(γ/n)7\n2\n3\n\u0012\n\u0013\n4 ⌊βn⌋\n+n\n(γ/n)10 = O(1).\n5\n4\n\nThe number of vertex-induced subgraphs of type K4′ in a random intersection graph is hence finite, while, in a thinned random intersection graph, it is\nof order n. This proves the proposition.\n✷\n\n5\n\nNumerical results\n\nIn this section, we investigate numerically the epidemic threshold R0 and the\nprobability π of explosion in the epidemic - recall Corollary 3.2. We have\nR0 = βγE[R], where the distribution of R is specified in (1), and π := 1 − ρ,\nwhere ρ is the smallest non-negative root of the equation f (ρ) = ρ and f\nis the generating function specified in (2). Using the recursive formulas for\nthe distribution Fk of the final size a Reed-Frost epidemic in a homogeneous\npopulation of size k - see e.g. Andersson and Britton (2000: Section 1.2) -\nnumerical values of R0 and π are easily obtained for fixed values of β and γ.\nWe are particularly interested in how ρ and R0 are affected when the\n(asymptotic) clustering c = (1 + βγ)−1 is varied, and, to be able to compare\nresults for different values of c, the mean degree μ = βγ 2 in the graph is kept\nfixed. In Figure 1, the parameters R0 and π are plotted against c for three\ndifferent values of the infection probability p. Let us comment a bit on these\nplots.\n12\n\n\f4.5\n\n4\n\n3.5\n\nR0\n\n3\n\n2.5\n\n2\n\n1.5\n\n1\n\n0.5\n\n0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n0.5\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1\n\n0.6\n\n0.7\n\n0.8\n\n0.9\n\n1\n\nc\n\n0.8\n\n0.7\n\n0.6\n\nπ\n\n0.5\n\n0.4\n\n0.3\n\n0.2\n\n0.1\n\n0\n\n0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n0.5\n\nc\n\nFigure 1: In the top figure, R0 is plotted against c for fixed μ = 4 and for\nthree choices of p : p = 0.2 (--), 0.3 (– – –), and 0.5 (– * –). The bottom\nfigure shows how the probability π of explosion in the epidemic varies with c,\nfor fixed μ = 4, and the same choices of p as above.\n13\n\n\fFirst we investigate the value of R0 in the limit as c → 0. Since μ is fixed,\nwe have that c = (1 + μ/γ)−1 → 0 implies that γ → 0 as well. Asymptotically,\nthe degree distribution in our random intersection graph is compound Poisson\nwith generating function\ng(s) = eβγ (e\n\n)\n\nγ(s−1) −1\n\nwhich converges to eμ(s−1) as γ → 0. The limiting degree distribution as\nc → 0 is hence Poisson(μ), and, after thinning the graph, removing each edge\nindependently with probability 1 − p, the degrees are Poisson distributed with\nmean pμ. Since the graph obtained by such a thinning can be thought of\nas representing the outcome of the epidemic, it is reasonable to suspect that\nR0 = pμ in the limit as c → 0. Indeed, it can be seen in the top plot in Figure\n1 that R0 → pμ as c → 0.\nIn the top plot in Figure 1, it can also be seen that R0 increases with c,\nthat is, higher clustering makes it easier for epidemics to take off. This is in\nline with findings in Newman (2003:2). Let us give a heuristic explanation of\nwhy this should be the case: First note that, since the mean degree μ in the\ngraph is fixed, an increase in c = (1 + μ/γ)−1 is equivalent to an increase in\nγ and a decrease in β of the order γ −2 . Also, recall that the mean number of\ngroups that an individual is a member of is βγ and the mean group size is γ.\nHence, increased clustering with fixed mean degree means that individuals are\nmembers of fewer but larger groups. Combining this with the observation that\nthe probability for an individual to avoid infection from some index case with\nwhom he/she shares a group decreases geometrically with the group size, it\nfollows that it should be easier for an epidemic to take off when the clustering\nis large. In fact, we have that R0 → μ as c → 1, that is, in the limit of large\nclustering, the infection probability p does not matter (as long as it is positive)\nfor the value of R0 .\nThe bottom plot in Figure 1 shows how the probability π of explosion in\nthe epidemic varies with c. For instance, it can be seen that π → 0 as c → 1.\nIn Section 4, we argued that the relative size of the largest component in a\ngraph with maximal clustering is 0 in the limit of large graph size. If the\nprobability of explosion in the epidemic coincides with the relative size of the\nlargest component in the graph representing the outcome of the epidemic, then\nindeed it follows from this that π → 0 as c → 1. Furthermore, it is interesting\nto note that the decrease of π towards 0 is not monotone for all values of p.\nClearly, if a low value of c prevents explosion, while explosion is possible for a\nlarger value of c - this is the case for instance for p = 0.2 - then we will see\nan increase in π from 0 to a positive value when the threshold is passed. But,\nas the curve for p = 0.3 reveals, even if π is positive already at c = 0, it can be\nthe case that it increases with c in some interval before it starts to decrease.\n\n14\n\n\f6\n\nDiscussion\n\nIn the present paper, we have analyzed how the clustering in a random network affects how an infectious disease propagates in the network, assuming\nthe size of the network to be large. In particular, using a random intersection graph construction, we have rigorously derived the limiting probability\nof an explosion in the epidemic and a threshold parameter indicating if this\nprobability is 0 or positive.\nThe motivation for analyzing an epidemic on a random network with positive clustering is of course that most empirical social networks manifest positive clustering, so predictions based on epidemic models neglecting such clustering, i.e. most epidemic models, must be interpreted with caution. There\nare of course several other features in empirical networks, not considered in\nthe present paper, that should also be taken into account for predictions to be\nreliable. One such feature is the degree distribution, which in many social networks has been observed to follow a power-law distribution. The graph model\nused in this paper gives compound Poisson distributions for the degrees, but\nthe model is generalized in Deijfen and Kets (2007) to allow for power-law\ndegree distributions. It would be interesting to study how an epidemic on\nsuch a generalized graph is affected by the exponent in the power-law. Another feature that has been observed in many social networks is positive degree\ncorrelation, that is, individuals with high (low) degree tend to be connected\nto other individuals with high (low) degree. Because of the group structure,\nthis is likely to be the case in a random intersection graph, but it remains to\nquantify the correlation.\nA possible generalization of the studied model would be to distinguish\nbetween different types of individuals, and to assume that both network characteristics as well as transmission probabilities depend on the type of an individual; see e.g. Ball and Clancy (1993). Another extension, motivated by\nreal-world epidemics, is to leave the Reed-Frost paradigm, in which the events\nthat different neighbors of a given infective becomes infected are independent.\nIf for example the infectious period is taken to be random, then these events\nare positively correlated; see e.g. Andersson and Britton (2000). Unfortunately, by relaxing the independence assumption the analysis of the model\nbecomes much more complicated.\nPerhaps the most obvious continuation of the present work is however to\nderive fully rigorous results about the final size of the epidemic in case of\nexplosion. The (relative) final size of the epidemic then most likely coincides\nwith the probability of explosion, a quantity derived in the present paper, but\na proof of this is still missing.\n\n15\n\n\fReferences\nAndersson, H. (1998): Limit theorems for a random graph epidemic model,\nAnnals of Applied Probability 8, 1331–1349.\nAndersson, H. (1999): Epidemic models and social networks, The Mathematical Scientist 24, 128–147.\nAndersson, H. and Britton, T. (2000): Epidemic models and their statistical\nanalysis, Springer.\nAthreya, K. B. and Ney, P. E. (1972): Branching processes, Springer.\nvon Bahr, B. and Martin-Löf, A. (1980): Threshold limit theorems for some\nepidemic processes, Advances in Applied Probability 12, 319–349.\nBall, F. and Clancy, D. (1993): The final size and severity of a generalized\nstochastic multi-type epidemic model, Advances in Applied Probability 25,\n721–736.\nBall, F., Mollison, D. and Scalia-Tomba, G. (1997): Epidemics with two levels\nof mixing, Annals of Applied Probability 7, 46–89.\nBehrisch, M. (2007): Component evolution in random intersection graphs,\nElectronic Journal of Combinatorics 14.\nDeijfen, M. and Kets, W. (2007): Random intersection graphs with tunable degree distribution and clustering, preprint, available at www.math.su.se/∼mia.\nDorogovtsev, S. and Mendes, J. (2003): Evolution of Networks, from Biological\nNets to the Internet and WWW, Oxford University Press.\nDurrett, R. (2006): Random graph dynamics, Cambridge University Press.\nFill, J., Scheinerman, E. and Singer-Cohen, K. (2000): Random intersection\ngraphs when m = ω(n): an equivalence theorem relating the evolution of the\nG(n, m, p) and G(n, p) models, Random Structures & Algorithms 16, 156–176.\nGodehardt, E. and Jaworski, J. (2002): Two models of random intersection\ngraphs for classification, in Exploratory data analysis in empirical research,\neds Schwaiger M. and Opitz, O., Springer, 67–81.\nKaroński, M., Scheinerman, E. and Singer-Cohen, K. (1999): On random intersection graphs: the subgraphs problem, Combinatorics Probability & Computing 8, 131–159.\nNeal, P. (2004): SIR epidemics on Bernoulli graphs, Journal of Applied Probability, 40, 779–782.\nNeal, P. (2006): Multitype randomized Reed-Frost epidemics and epidemics\nupon graphs, Annals of Applied Probability 16, 1166–1189.\nNewman, M. (2003:1): The structure and function of complex networks, SIAM\nReviews 45, 167–256.\n16\n\n\fNewman, M. (2003:2): Properties of highly clustered networks, Physical Review E 68, 026121.\nNewman, M., Barabási, A. and Watts, D. (2006): The structure and dynamics\nof networks, Princeton University Press.\nSinger, K. (1995): Random intersection graphs, PhD thesis, Johns Hopkins\nUniversity.\nStark, D. (2004): The vertex degree distribution of random intersection graphs,\nRandom Structures & Algorithms 24, 249–258.\nTrapman, P. (2007): On analytical approaches to epidemics on networks, Theoretical Population Biology 71, 160–173.\n\n17\n\n\f"}