{"id": "http://arxiv.org/abs/1106.4816v1", "guidislink": true, "updated": "2011-06-23T20:00:05Z", "updated_parsed": [2011, 6, 23, 20, 0, 5, 3, 174, 0], "published": "2011-06-23T20:00:05Z", "published_parsed": [2011, 6, 23, 20, 0, 5, 3, 174, 0], "title": "Thermal Instability & the Feedback Regulation of Hot Halos in Clusters,\n  Groups, and Galaxies", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.0343%2C1106.3760%2C1106.3750%2C1106.1919%2C1106.4757%2C1106.4089%2C1106.3068%2C1106.5152%2C1106.2884%2C1106.5629%2C1106.2616%2C1106.0756%2C1106.1372%2C1106.3991%2C1106.4938%2C1106.5264%2C1106.0989%2C1106.4600%2C1106.2174%2C1106.3329%2C1106.3453%2C1106.3320%2C1106.6186%2C1106.0012%2C1106.1719%2C1106.2347%2C1106.1139%2C1106.1857%2C1106.1379%2C1106.0242%2C1106.0154%2C1106.1061%2C1106.4816%2C1106.0984%2C1106.2904%2C1106.2049%2C1106.0755%2C1106.6231%2C1106.5347%2C1106.3289%2C1106.2660%2C1106.1034%2C1106.0826%2C1106.5492%2C1106.2939%2C1106.0681%2C1106.4324%2C1106.3277%2C1106.0226%2C1106.1677%2C1106.0911%2C1106.5761%2C1106.5105%2C1106.4737%2C1106.1553%2C1106.6192%2C1106.2873%2C1106.5314%2C1106.4561%2C1106.1511%2C1106.2615%2C1106.5807%2C1106.3523%2C1106.0545%2C1106.0302%2C1106.1828%2C1106.6044%2C1106.5366%2C1106.3554%2C1106.4384%2C1106.4551%2C1106.5428%2C1106.2856%2C1106.2168%2C1106.5240%2C1106.4176%2C1106.2830%2C1106.5808%2C1106.5954%2C1106.3659%2C1106.1319%2C1106.0720%2C1106.3634%2C1106.2759%2C1106.2078%2C1106.2243%2C1106.1752%2C1106.2319%2C1106.1313%2C1106.4773%2C1106.4094%2C1106.6321%2C1106.0783%2C1106.3186%2C1106.4631%2C1106.3506%2C1106.3248%2C1106.5075%2C1106.5467%2C1106.0336%2C1106.3899&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Thermal Instability & the Feedback Regulation of Hot Halos in Clusters,\n  Groups, and Galaxies"}, "summary": "Observations of clusters and groups imply that such halos are roughly in\nglobal thermal equilibrium, with heating balancing cooling when averaged over\nsufficiently long time- and length-scales; the ICM is, however, very likely to\nbe locally thermally unstable. Using simple observationally-motivated heating\nprescriptions, we show that local thermal instability (TI) can produce a\nmulti-phase medium---with ~ 10000 K cold filaments condensing out of the hot\nICM---only when the ratio of the TI timescale in the hot plasma (t_{TI}) to the\nfree-fall timescale (t_{ff}) satisfies t_{TI}/t_{ff} <~ 10. This criterion\nquantitatively explains why cold gas and star formation are preferentially\nobserved in low-entropy clusters and groups. In addition, the interplay among\nheating, cooling, and TI reduces the net cooling rate and the mass accretion\nrate at small radii by factors of ~ 100 relative to cooling-flow models. This\ndramatic reduction is in line with observations. The feedback efficiency\nrequired to prevent a cooling-flow is ~ 0.001 for clusters and decreases for\nlower mass halos; supernova heating may be energetically sufficient to balance\ncooling in galactic halos. We further argue that the ICM self-adjusts so that\nt_{TI}/t_{ff} >~ 10 at all radii. When this criterion is not satisfied, cold\nfilaments condense out of the hot phase and reduce the density of the ICM.\nThese cold filaments can power the black hole and/or stellar feedback required\nfor global thermal balance, which drives t_{TI}/t_{ff} >~ 10. In comparison to\nclusters, groups have central cores with lower densities and larger radii. This\ncan account for the deviations from self-similarity in the X-ray\nluminosity-temperature (L_X-T_X) relation. The high-velocity clouds observed in\nthe Galactic halo can also be due to local TI producing multi-phase gas close\nto the virial radius.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.0343%2C1106.3760%2C1106.3750%2C1106.1919%2C1106.4757%2C1106.4089%2C1106.3068%2C1106.5152%2C1106.2884%2C1106.5629%2C1106.2616%2C1106.0756%2C1106.1372%2C1106.3991%2C1106.4938%2C1106.5264%2C1106.0989%2C1106.4600%2C1106.2174%2C1106.3329%2C1106.3453%2C1106.3320%2C1106.6186%2C1106.0012%2C1106.1719%2C1106.2347%2C1106.1139%2C1106.1857%2C1106.1379%2C1106.0242%2C1106.0154%2C1106.1061%2C1106.4816%2C1106.0984%2C1106.2904%2C1106.2049%2C1106.0755%2C1106.6231%2C1106.5347%2C1106.3289%2C1106.2660%2C1106.1034%2C1106.0826%2C1106.5492%2C1106.2939%2C1106.0681%2C1106.4324%2C1106.3277%2C1106.0226%2C1106.1677%2C1106.0911%2C1106.5761%2C1106.5105%2C1106.4737%2C1106.1553%2C1106.6192%2C1106.2873%2C1106.5314%2C1106.4561%2C1106.1511%2C1106.2615%2C1106.5807%2C1106.3523%2C1106.0545%2C1106.0302%2C1106.1828%2C1106.6044%2C1106.5366%2C1106.3554%2C1106.4384%2C1106.4551%2C1106.5428%2C1106.2856%2C1106.2168%2C1106.5240%2C1106.4176%2C1106.2830%2C1106.5808%2C1106.5954%2C1106.3659%2C1106.1319%2C1106.0720%2C1106.3634%2C1106.2759%2C1106.2078%2C1106.2243%2C1106.1752%2C1106.2319%2C1106.1313%2C1106.4773%2C1106.4094%2C1106.6321%2C1106.0783%2C1106.3186%2C1106.4631%2C1106.3506%2C1106.3248%2C1106.5075%2C1106.5467%2C1106.0336%2C1106.3899&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Observations of clusters and groups imply that such halos are roughly in\nglobal thermal equilibrium, with heating balancing cooling when averaged over\nsufficiently long time- and length-scales; the ICM is, however, very likely to\nbe locally thermally unstable. Using simple observationally-motivated heating\nprescriptions, we show that local thermal instability (TI) can produce a\nmulti-phase medium---with ~ 10000 K cold filaments condensing out of the hot\nICM---only when the ratio of the TI timescale in the hot plasma (t_{TI}) to the\nfree-fall timescale (t_{ff}) satisfies t_{TI}/t_{ff} <~ 10. This criterion\nquantitatively explains why cold gas and star formation are preferentially\nobserved in low-entropy clusters and groups. In addition, the interplay among\nheating, cooling, and TI reduces the net cooling rate and the mass accretion\nrate at small radii by factors of ~ 100 relative to cooling-flow models. This\ndramatic reduction is in line with observations. The feedback efficiency\nrequired to prevent a cooling-flow is ~ 0.001 for clusters and decreases for\nlower mass halos; supernova heating may be energetically sufficient to balance\ncooling in galactic halos. We further argue that the ICM self-adjusts so that\nt_{TI}/t_{ff} >~ 10 at all radii. When this criterion is not satisfied, cold\nfilaments condense out of the hot phase and reduce the density of the ICM.\nThese cold filaments can power the black hole and/or stellar feedback required\nfor global thermal balance, which drives t_{TI}/t_{ff} >~ 10. In comparison to\nclusters, groups have central cores with lower densities and larger radii. This\ncan account for the deviations from self-similarity in the X-ray\nluminosity-temperature (L_X-T_X) relation. The high-velocity clouds observed in\nthe Galactic halo can also be due to local TI producing multi-phase gas close\nto the virial radius."}, "authors": ["Prateek Sharma", "Michael McCourt", "Eliot Quataert", "Ian J. Parrish"], "author_detail": {"name": "Ian J. Parrish"}, "author": "Ian J. Parrish", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1111/j.1365-2966.2011.20246.x", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1106.4816v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1106.4816v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "26 pages, 18 figures; abstract abridged; to be submitted to MNRAS", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1106.4816v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1106.4816v1", "journal_reference": null, "doi": "10.1111/j.1365-2966.2011.20246.x", "fulltext": "Mon. Not. R. Astron. Soc. 000, 1–26 (2011)\n\nPrinted 13 July 2018\n\n(MN LATEX style file v2.2)\n\narXiv:1106.4816v1 [astro-ph.CO] 23 Jun 2011\n\nThermal Instability & the Feedback Regulation of Hot\nHalos in Clusters, Groups, and Galaxies\nPrateek Sharma⋆, Michael McCourt, Eliot Quataert, & Ian J. Parrish\nAstronomy Department and Theoretical Astrophysics Center, 601 Campbell Hall, University of California, Berkeley, CA 94720, USA\n\n13 July 2018\n\nABSTRACT\n\nWe present global multi-dimensional numerical simulations of the plasma that pervades the dark matter halos of clusters, groups, and massive galaxies (the 'intracluster\nmedium;' ICM). Observations of clusters and groups imply that such halos are roughly\nin global thermal equilibrium, with heating balancing cooling when averaged over sufficiently long time- and length-scales; the ICM is, however, very likely to be locally thermally unstable. Using simple observationally-motivated heating prescriptions, we show\nthat local thermal instability (TI) can produce a multi-phase medium-with ∼ 104 K\ncold filaments condensing out of the hot ICM-only when the ratio of the TI timescale\nin the hot plasma (tTI ) to the free-fall timescale (tff ) satisfies tTI /tff <\n∼ 10. This criterion\nquantitatively explains why cold gas and star formation are preferentially observed in\nlow-entropy clusters and groups. In addition, the interplay among heating, cooling, and\nTI reduces the net cooling rate and the mass accretion rate at small radii by factors of\n∼ 100 relative to cooling-flow models. This dramatic reduction is in line with observations. The feedback efficiency required to prevent a cooling-flow is ∼ 10−3 for clusters\nand decreases for lower mass halos; supernova heating may be energetically sufficient\nto balance cooling in galactic halos. We further argue that the ICM self-adjusts so that\ntTI /tff >\n∼ 10 at all radii. When this criterion is not satisfied, cold filaments condense out\nof the hot phase and reduce the density of the ICM. These cold filaments can power\nthe black hole and/or stellar feedback required for global thermal balance, which drives\ntTI /tff >\n∼ 10. In comparison to clusters, groups have central cores with lower densities\nand larger radii. This can account for the deviations from self-similarity in the X-ray\nluminosity-temperature (LX − TX ) relation. The high-velocity clouds observed in the\nGalactic halo can be due to local TI producing multi-phase gas close to the virial radius\n−5\n−3\nif the density of the hot plasma in the Galactic halo is >\n∼ 10 cm at large radii.\nKey words: galaxies: clusters: intracluster medium; galaxies: halos.\n\n1\n\nINTRODUCTION\n\nThe cooling of baryons in dark matter halos is a critical driver\nof galaxy formation on large scales (e.g., Hoyle 1953; Rees &\nOstriker 1977; White & Rees 1978). If the cooling time at the\nvirial radius is shorter than the free-fall time, most of the gas\ndoes not virialize at large radii and instead remains cold and\nflows into the halo along cosmological filaments (Birnboim &\nDekel 2003; Kereš et al. 2005). For halo masses larger than\n∼ 1012 M⊙ (roughly the halo mass of the Milky Way; Xue et\n\n⋆\n\nEinstein Fellow (psharma@astro.berkeley.edu)\n\nc 2011 RAS\n\nal. 2008), however, most of the baryons undergo a virial shock\nand produce a pressure-supported intracluster medium (ICM;\nfor simplicity, we refer to the virialized plasma at all halo\nmasses as the ICM).\nEven when cooling is negligible near the virial radius, it\ncan become important at smaller radii where the gas density is higher. Indeed, the cooling time of the hot plasma at\nthe centers of groups and clusters is often observed to be\nmuch shorter than the age of the system (e.g., Cavagnolo et\nal. 2008). In the absence of heating, the ICM would lose\npressure support on a cooling timescale, leading to a massive cooling-flow (e.g., Fabian 1994). However, the absence\n\n\f2\n\nP. Sharma, M. McCourt, E. Quataert, I. J. Parrish\n\nof lower energy X-ray lines (e.g., Tamura et al. 2001; Molendi\n& Pizzolato 2001; Peterson et al. 2003) and the lack of prodigious star formation in cluster cores (e.g., O'Dea et al. 2008;\nRafferty, McNamara, & Nulsen 2008) suggest that cooling\nis approximately balanced by some form of heating, at least\nwhen averaged over a cooling timescale. Heating is also required to explain the high mass cutoff in the galaxy mass\nfunction relative to the dark matter halo mass function (e.g.,\nCroton et al. 2006; Bower et al. 2006).\nEnergetically, there are a number of heating sources that\ncan in principle balance cooling in hot halos: e.g., thermal\nconduction in clusters (e.g., Zakamska & Narayan 2003), the\nkinetic energy of galaxies and mini-halos (e.g., Kim, El-Zant,\n& Kamionkowski 2005; Dekel & Birnboim 2008), and the\nenergy produced by a central active galactic nucleus (AGN)\nin the form of jets and bubbles of relativistic plasma (e.g.,\nBı̂rzan et al. 2004). However, most non-feedback mechanisms\nare globally thermally unstable (e.g., Kim & Narayan 2003;\nParrish, Quataert, & Sharma 2009). That is, even if heating\nbalances cooling at a given time, small perturbations about\nthat equilibrium will cause run-away heating/cooling of the\ncore. AGN feedback, however, can be globally thermally stable\nif the efficiency of feedback is sufficiently large (e.g., Guo et\nal. 2008). Physically, this is because the accretion rate onto\nthe central black hole increases as the cooling rate in the\nhalo increases, providing the necessary feedback loop. It is\nplausible that supernova heating can provide a similar source\nof globally stable heating in galactic halos with ongoing star\nformation.\nAlthough AGN feedback can plausibly ensure global thermal stability of cluster cores, the ICM is very likely to be locally thermally unstable because of the strong density dependence of the cooling rate (Field 1965). The situation is analogous to the hot phase of the interstellar medium (ISM) which\nis thermally unstable but is maintained by supernova heating\n(McKee & Ostriker 1977). While the thermal instability (TI)\nhas been invoked to explain a number of observations of coolcore clusters in the past, previous treatments have typically\nfocused on models without heating (e.g., Nulsen 1986; Kaufmann et al. 2009). Other studies, very similar in spirit to\nours, have emphasized the importance of AGN feedback due\nto accretion of cold gas, but have focused on the survival\nof dense, cool blobs once they form, rather than their origin\n(e.g., Pizzolato & Soker 2005). Here we focus on how local\nTI produces cold filaments condensing out of the hot phase\nfor virialized halos in rough thermal balance.\nObservationally there is a sharp threshold in central entropy/cooling time below which cold gas is observed in groups\nand clusters (e.g., Cavagnolo et al. 2008; Heckman et al.\n1989; Hu, Cowie, & Wang 1985; McDonald et al. 2010).\nThese cool-core clusters also preferentially show evidence for\nAGN feedback and star formation (e.g., Rafferty, McNamara,\n& Nulsen 2008; Hicks, Mushotzky, & Donahue 2010). The\nstrong correlation between cold gas indicators and the properties of the hot ICM motivates a model in which TI is the\nsource of much of the cold gas in groups and clusters. The condensation of cold gas in hot halos has also been invoked (e.g.,\n\nMaller & Bullock 2004; Sommer-Larsen 2006; Peek, Putman, & Sommer-Larsen 2008) as a source of the high velocity\nclouds (HVCs) of neutral hydrogen observed in the Galactic\nhalo (e.g., Wakker & van Woerden 1997) and in the halo of\nM31 (Thilker et al. 2004).\nIn a previous paper (McCourt et al. 2011; hereafter Paper I) we studied the physics of local TI in gravitationally\nstratified plasmas, including observationally-motivated heating prescriptions, anisotropic thermal conduction, and magnetic fields. We used local Cartesian numerical simulations to\nisolate the key physics. The unusual feature of the TI in the\nICM (relative to, say, the molecular/atomic phase of the ISM)\nis that the growth time of the TI in the hot plasma (tTI ) can\nbe comparable to, or longer than, the free-fall time in the cluster potential (tff ). In Paper I, we showed that the ratio of these\ntwo key timescales determines whether cold gas can condense\nout of the hot ICM. If the cooling time is short (tTI <\n∼ tff ), initially small density perturbations become nonlinear and cool\nblobs reach the thermally stable state at ∼ 104 K. These dense\ngas-rich filaments then fall through the hot ICM at roughly\nthe free-fall rate (as in Pizzolato & Soker 2005); they may\ncool further, forming stars, and/or powering a central AGN.\nOn the other hand, if the TI growth time is longer than the\nfree-fall time (tTI >\n∼ tff ), the TI saturates before the perturbations become nonlinear and the TI cannot produce a multiphase medium starting from small initial perturbations. Note\nthat this criterion for TI to produce a multi-phase medium is\nanalogous to the criterion for cosmological accretion to proceed via cold streams rather than virialized plasma. However,\nour TI criterion applies at all radii in hot halos, not just at\nthe virial shock.\nIn this paper, we extend the calculations of Paper I to\nmore realistic (but still non-cosmological) global models of\nthe ICM in dark matter halos. The most uncertain input into\nthese calculations is our treatment of the heating of the ICM.\nObservations of groups and clusters imply that there is an\napproximate balance between heating and cooling in cluster cores. Motivated by this, we explore two different heating models; both assume that the heating is isotropic, thus\nsidestepping the very important but difficult problem of how\nenergy is redistributed throughout the ICM. Our first model\ndetermines the heating rate from the average cooling rate at\neach radius in the halo (see also Paper I). We refer to these\nsimulations as our 'idealized heating' simulations. Our second\nmodel assumes that the heating of the ICM is proportional to\nthe mass accretion rate at small radii. We refer to these simulations as our 'feedback' heating simulations (though they\nare also very idealized!). Fortunately, these two models give\nsimilar results. This implies that there are robust properties\nof hot halos that arise primarily from the interplay between\nlocal TI and global thermal equilibrium, and which are not\nvery sensitive to the details of how global thermal equilibrium\nis maintained.\nOur calculations do not include the physics necessary to\nmodel the detailed properties of the gas-rich filaments produced by TI. In reality magnetic fields, cosmic rays, and thermal conduction along magnetic field lines strongly influence\nc 2011 RAS, MNRAS 000, 1–26\n\n\fFeedback Regulation of Hot Halos\nthe geometry and energy balance in filaments (e.g., Ferland et\nal. 2009; Sharma, Parrish, & Quataert 2010). Star formation\nneeds to be incorporated as an excitation mechanism for the\nobserved Hα emission in at least some filaments (e.g., McDonald et al. 2011). Moreover, the physics of turbulent heating/mixing and non-radiative cooling are probably required\nto explain the absence of some of the lower energy X-ray\nlines (Werner et al. 2010; Sanders et al. 2010); this physics is\nnot well-resolved in our simulations. A detailed study of these\nprocesses is important, but beyond the scope of the present\npaper. Nonetheless, the simulations presented in this paper\ndo accurately describe the conditions under which gas-rich\nfilaments form out of the hot ICM; they also provide insight\ninto the role of TI in determining the observed density and\nentropy profiles of hot halos, and in maintaining such halos\nin global thermal equilibrium.\nIn Paper I we showed that magnetic fields and anisotropic\nthermal conduction do not significantly alter the evolution of\nthe TI for halos in thermal balance. More specifically, conduction changes the morphology of the resulting cold gas (turning\nblobs into filaments along magnetic field lines), but not the\namount of cold gas produced by TI. As a result, we do not\ninclude magnetic fields and conduction in this paper.\nThe interplay between local TI and gravity in a globally\nstable cluster cannot be captured in a one-dimensional model\nbecause the physics of cool overdense blobs falling in a hot\npressure-supported atmosphere is absent in 1-D. Moreover,\nmaintaining the pressure support of the hot ICM is critical to\npreventing a massive cooling-flow. The TI also evolves very\ndifferently in the presence of heating than it does in coolingflows (Balbus & Soker 1989; see also Appendix A where we\ndiscuss the formation of multi-phase structure in cooling-flows\nin detail). These considerations imply that numerical studies of hot halos should use multidimensional simulations and\nshould include heating. Such simulations are the focus of this\npaper.\nThe remainder of this paper is organized as follows. We\ndescribe the properties of our multi-dimensional simulations\nin section 2. Section 3 presents the results of our 'idealized'\nheating simulations. Simulations with simplified models of\n'feedback' heating are presented in section 4. We discuss important astrophysical implications of our work in section 5.\nWe conclude with a detailed summary of our paper in section\n6. Readers not interested in simulation details may skip to\nsection 5.\n\n2\n\nSIMULATION SETUP\n\nIn this section we detail the equations that we solve numerically, and the initial and boundary conditions. We also describe the cooling and heating prescriptions that we use.\nc 2011 RAS, MNRAS 000, 1–26\n\n2.1\n\n3\n\nGoverning Equations\n\nWe solve the standard hydrodynamic Euler equations with\nheating, cooling, and external gravity:\ndρ\n= −ρ∇ * v,\ndt\n\n(1)\n\ndv\n= −∇p + ρg,\ndt\n\n(2)\n\nd\nln (p/ργ ) = −q − (n, T ) + q + (r, t),\ndt\n\n(3)\n\nρ\n\ne\n\nwhere d/dt ≡ ∂/∂t + v * ∇ is the Lagrangian derivative, ρ\nis the mass density, v is the fluid velocity, p is the thermal\npressure, e = p/(γ − 1) (we use γ = 5/3, valid for an ideal\nnon-relativistic gas) is the internal energy per unit volume,\ng is the acceleration due to gravity, q + is the heating rate\nper unit volume, q − ≡ ne ni Λ(T ) is the cooling rate per unit\nvolume, ne (ni ) is the electron (ion) number density, and Λ(T )\nis the cooling function. We use a third of the solar metallicity,\ncorresponding to a mean molecular weight per particle μ ≡\nρ/(nmp ) = 0.62 and a mean molecular weight per electron\nμe ≡ ρ/(ne mp ) = 1.18, where n = ne + ni is the total number\ndensity and mp is the proton mass.\nWe model the ICM in spherical (r, θ, φ) geometry using\nthe ZEUS-MP code (Hayes et al. 2006). We model the dark\nmatter halo as a fixed gravitational potential with an NFW\nprofile:\nΦ=−\n\n2GM0 ln (1 + r/rs )\n,\nrs\nr/rs\n\n(4)\n\nwhere M0 is the characteristic dark matter mass and rs is the\nscale radius (Navarro, Frenk, & White 1997). The acceleration due to gravity\ng≡−\n\ndΦ\nr̂\ndr\n\nis directed toward the center of the dark matter halo. For\nsimplicity we do not include the contribution of the ICM or\nthe galaxies to the gravitational potential. For our fiducial\ncluster model C10, we take M0 = 3.8 × 1014 M⊙ and rs =\n390 kpc. We scale the radii according to the self-similar scaling\n1/3\nfor different halo masses; {r, rs } ∝ M0 . The concentration\nparameter c ≡ r200 /rs (where r200 is the virial radius within\nwhich the mean dark matter density is 200 times the critical\ndensity of the universe) is fixed to be c = 3.3 for all halo\nmasses. With this choice the virial mass is M200 = 1.38M0 .\nThe equations are solved using operator (and directional)\nsplitting into source and transport steps (Stone & Norman\n1992). We combine the heating and cooling rates at each grid\ncell and subcycle the internal energy equation. Cooling for\nsimulations without heating (i.e., for cooling-flows with q + =\n0) is not subcycled but is treated semi-implicitly (see Eq. 7 in\nPaper I); an explicit treatment would lead to computationally\nprohibitive subcycling at almost all timesteps because of short\ncooling times. This less accurate treatment of cooling does\nnot affect the results much. All of the simulations are run for\n\n\f4\n\nP. Sharma, M. McCourt, E. Quataert, I. J. Parrish\n\n5 Gyr, roughly the time between major mergers of halos at\nthe current epoch.\n\n2.1.1\n\nInitial and Boundary Conditions\n\nWe initialize the ICM in hydrostatic equilibrium with an entropy profile1\n\u0012\n\u0013α\nr\nTkeV\nK(r) ≡ 2/3 = K0 + K100\n,\n(5)\nr100\nne\nwhere r100 = 100 kpc for our fiducial run (C10) and scales\n1/3\nwith M0 for other halo masses (Cavagnolo et al. 2009).\nThe entropy profiles that we use cover the range observed in\nclusters. We seed initial density perturbations such that the\nmaximum δρ/hρi ≈ 0.3, where δρ = ρ − hρi and hρi is the\nangle-averaged density as a function of r. The density fluctuations (δρ/hρi) are isotropic and homogeneous (in the threedimensional Cartesian sense), and have a one-dimensional\npower spectrum ∝ k3/2 for 4 <\n∼ krout /2π <\n∼ 10, where rout\nis the outer radius (200 kpc for the fiducial run). Though\nsomewhat arbitrary, this choice for the initial perturbations is\nfairly general and enables us to initialize all of our simulations\nidentically. For simulations with heating, the resulting quasisteady state does not depend strongly on the initial density\nperturbations. By contrast, the properties of the multi-phase\ngas in cooling-flows do depend on the initial density perturbations (see Appendix A-this is because TI does not grow\nexponentially in cooling-flows; Balbus & Soker 1989).\nWe perform our simulations in spherical (r, θ, φ) coordinates, where 1 kpc 6 r 6 200 kpc for the fiducial run C10,\n0 6 θ 6 π, and 0 6 φ 6 2π. Again, we adjust the radial\n1/3\nrange for different halo masses such that r ∝ M0 . We use a\nlogarithmic grid in the radial direction and a uniform grid in\nother coordinate directions. We fix the outer electron number density to be ne,out = 0.0015 cm−3 for all halo masses,\na value observed for Abell 2199 at 200 kpc (see Johnstone\net al. 2002; see also Sharma et al. 2009 for details of the\nsetup). The outer radius is close to the scale radius of Abell\n2199, such that the initial temperature increases monotonically with radius. We apply inflow (outflow) boundary conditions at the outer (inner) radial boundary, such that a steady\ninflow may develop; mass is not allowed to flow out of (in\nto) the computational domain at the outer (inner) boundary.\nSince the cooling time at the outer boundary is much longer\nthan 5 Gyr, we do not expect our results to change significantly with a different outer boundary condition.2 We apply\n\n1\n\nreflective boundary conditions in the θ direction and periodic\nboundary conditions in the φ direction.\n\nAlthough an entropy core provides a good fit for most clusters,\nsome non-cool-core clusters have a high-density/low-temperature\n'corona' around the central BCG at < 5 kpc (see Sun 2009). We\n∼\ndo not address these systems in this paper.\n2 The outer boundary conditions do not affect the results for our\nsimulations with heating, in which a hot pressure-supported ICM\nis maintained. However, the cooling-flow simulations without heating do depend on the outer boundary conditions, as we discuss in\nAppendix A.\n\n2.2\n\nCooling & Heating\n\nWe use the cooling function Λ(T ) given by Eq. (12) in\nSharma, Parrish, & Quataert (2010) (corresponding to the\nsolid line in their Fig. 1), which is a fit to the equilibrium\ncooling curve of Sutherland & Dopita (1993) for 0.3 solar\nmetallicity (see their Fig. 8). Hydrogen starts to recombine\nbelow ∼ 104 K; this abruptly reduces the cooling rate and creates a thermally stable \"cold\" phase. The ICM is locally thermally unstable at all temperatures above 104 K, but we show\nlater (Fig. 3) that the combined effect of cooling, heating,\nand gravity results in a strongly bimodal temperature distribution in the plasma. We therefore speak of distinct \"hot\"\nand \"cold\" phases.\nWhile the cooling function for the ICM is fairly wellknown, the heating of the ICM is not yet understood. For\nconcreteness we choose a heating rate such that the energy\ndeposited per unit volume is constant (q + ∝ ρ0 ). The simulations in Paper I demonstrate that the results are not sensitive to this choice, as long as time is normalized to the\nthermal instability timescale. Note that, while the cooling\nrate (q − ≡ ne ni Λ) is a thermodynamic state function, the\nheating rate q + (r, t) explicitly depends on radius and time.\nOur idealized heating prescription and our feedback heating\nprescription differ in the form of q + (r, t); i.e., the two models\nrepresent different assumptions about how the feedback energy is distributed in the ICM. In our idealized simulations,\nwe distribute the heating to instantaneously balance cooling\nat all radii in the plasma and in our feedback simulations we\nmake the heating proportional to the mass accretion rate at\nsmall radii.\n\n2.2.1\n\nIdealized Heating\n\nFor simulations with idealized heating (Tables 1 & 2) the\nheating rate at any point in the plasma (in erg cm−3 s−1 ) is\nequal to to the angle-averaged cooling at that radius:\nq + (r, t) =\n\n1\n4π\n\nZ\n\nπ\nθ=0\n\nZ\n\n2π\n\nq − [n(r, t), T (r, t)] sin θdθdφ.\n\n(6)\n\nφ=0\n\nThis imposes perfect thermal equilibrium at all radii and at\nall times. Although at first Eq. 6 appears overly idealized,\nit provides a useful framework for studying the thermal instability. Furthermore, the results of Paper I and section 3.5\nshow that introducing even large (∼ 100% or more) fluctuations about the heating rate in Eq. 6 does not significantly\nchange the resulting properties of the hot halo (so long as\nglobal thermal equilibrium is approximately maintained over\na few cooling timescales).\nc 2011 RAS, MNRAS 000, 1–26\n\n\fFeedback Regulation of Hot Halos\n\n5\n\nFigure 1. Mass accretion rate (in M⊙ yr−1 ) through the inner boundary (at 1 kpc) for different initial entropy profiles as a function of\ntime for our cluster runs with idealized heating (left panel) and without heating (i.e., cooling-flows; right panel). In the simulation labels\nthe number following 'C' is the initial core entropy (K0 in keV cm2 ). For simulations with heating the mass accretion rate at late times\nis reduced because the cold filaments are accreted and a hot ICM with tTI /tff >\n∼ 10 is maintained by heating. All of the low entropy\n2\ncooling-flow runs look similar at late times and reach a cooling catastrophe. The cooling time for runs with K0 >\n∼ 100 keV cm is long\nenough that a catastrophic cooling-flow does not occur within 5 Gyr even without heating.\n\n2.2.2\n\nfluid elements cooler and denser than average will cool further; though the plasma is globally in thermal equilibrium, it\nis locally thermally unstable.\n\nFeedback Heating\n\nIn our feedback simulations we set the heating rate\nq + (r, t) =\n\n(r/rcf )α\nKn\nǫfb Ṁin c2 ,\n3\n4πrcf [1 + (r/rcf )β ]\n\n(7)\n\nwhere Kn is a normalization constant such that\nR the integral\nof the heating rate over the whole volume q + 4πr 2 dr =\nǫfb Ṁin c2 , ǫfb is the feedback heating efficiency, Ṁin is the\ninstantaneous mass accretion rate through the inner radius,\nc is the speed of light, rcf is a cutoff radius for heating,\nand α and β are parameters determining the heating profile. We set the cutoff radius equal to the cooling radius\nwhere the cooling time is 5 Gyr; this gives rcf = 100 kpc\nfor clusters (M0 = 3.8 × 1014 M⊙ ) and rcf = 70 kpc for\ngroups (M0 = 3.8 × 1013 M⊙ ). The cutoff radius must be\nlarger than the cooling radius to prevent a cooling catastrophe at late times due to cooling beyond the cutoff radius. If\nthe cutoff radius is too much larger than the cooling radius,\nhowever, we require a higher feedback efficiency to balance\ncooling in the core because the feedback deposits a lot of energy beyond the cooling radius, where it is not required. The\nparameters α = −1.5 and β = 3.5 are chosen such that most\nof the energy is deposited near rcf . The choice α = −1.5 ensures that a relatively flat density/entropy core is obtained,\nas observed; for a heating profile steeper (shallower) than this\nwe obtain an inner density profile which increases (decreases)\nwith radius. The results are not very sensitive to the exact\nchoice of the parameters α, β, and rcf . We discuss the dependence on ǫfb in detail in section 4.\nSince the heating rate in both models (Eqs. 6 & 7) is constant at all angles for a fixed radius and time (q + ∝ ρ0 ), and\nsince cooling is sensitively dependent on density (∝ ρ2 Λ[T ]),\nc 2011 RAS, MNRAS 000, 1–26\n\n2.3\n\nImportant Timescales\n\nIn this section we define the most important timescales in\nour analysis. The TI growth time (inverse of the exponential growth rate) in the isobaric regime is (e.g., see Eq. 8 in\nSharma, Parrish, & Quataert 2010)\ntTI =\n\n5\ntcool\n,\n3 (2 − d ln Λ/d ln T )\n\n(8)\n\n3 nkB T\n.\n2 ne ni Λ\n\n(9)\n\nwhere\ntcool ≡\n\nIn Eq. 8 we have assumed volumetric heating (q + ∝ ρ0 ) and\nwe have ignored thermal conduction which suppresses the instability at small scales (Field 1965). This approximation is\njustified because thermal conduction is anisotropic with respect to the magnetic field (see Paper I for more details).\nFor free-free cooling (with Λ ∝ T 1/2 ) relevant for clusters,\ntTI = (10/9)tcool . This timescale depends on how the feedback energy is thermalized in the ICM: if instead q + ∝ ρ,\nthe TI timescale is longer, tTI = (10/3)tcool , because heating\npartially compensates cooling for an overdense blob. We also\ndefine the free-fall time\n\u0012 \u00131/2\n2r\n,\n(10)\ntff ≡\ng\nwhere g ≡ dΦ/dr is the acceleration due to gravity. As we\ndiscuss later, the ratio tTI /tff plays a crucial role in the physics\n\n\f6\n\nP. Sharma, M. McCourt, E. Quataert, I. J. Parrish\n\nof the ICM-if this ratio is small cold filaments condense out\nof the hot phase, resulting in an abrupt rise in the accretion\nrate and in the associated feedback heating.\n\n3\n\nSIMULATIONS WITH IDEALIZED HEATING\n\nIn this section, we describe the numerical results from simulations with our idealized heating prescription. These idealized heating runs, in which heating at each radius balances\nangle-averaged cooling, are motivated by the observed thermal equilibrium in cluster cores. The identification that cold\nfilaments are due to TI in a globally stable ICM is easily motivated in this setup: the ICM evolves only because we seed\nthe local TI with density perturbations. Although this idealized heating function appears to be finely tuned, we find that\nthe results are quite insensitive to large temporal and spatial perturbations in heating on top of this exact balance (see\nsection 3.5 & Paper I). Moreover, the more realistic feedback\nsimulations discussed in section 4 reach a quasi-steady state\nsimilar to these idealized simulations.\nIn section 3.1 we discuss the effects of our heating ansatz\non the mass accretion rate and the cooling to sub-virial temperatures; we also compare our results to a cooling-flow. In\n3.2 we discuss our fiducial run C10 in detail. Section 3.3 shows\nthat TI and heating leads to a lower limit on tTI /tff and the\ncore entropy. In section 3.4 we show that TI affects larger\nradii in lower mass halos, and that there is a significant lack\nof plasma below ∼ 1/2−1/3 of the virial temperature in simulations with heating. We end this section with a discussion of\nthe robustness of our results to large variations in heating on\ntop of our thermal balance and to changes in resolution (section 3.5). Table 1 lists the two-dimensional simulations with\nidealized heating (see Eq. 6). Table 2 lists simulations with\ntemporal and spatial heating fluctuations, three-dimensional\nsimulations, and simulations at different resolutions.\n3.1\n\nEffect of Heating on Cooling & Accretion\n\nTo assess the effect of heating on the structure of the cooling\ncore we also carried out a few runs without heating (q + = 0;\ni.e., cooling-flows). In this section we compare the results of\nsimulations with idealized heating to cooling-flow simulations.\nThe properties of the cooling-flow simulations are discussed\nin more detail in Appendix A.\n3.1.1\n\nSuppression of the Mass Accretion Rate via Heating\n\nFigure 1 compares the mass accretion rate through the inner\nradius for cluster simulations (M0 = 3.8 × 1014 M⊙ ; prefixed with C in Table 1) with idealized heating (left panel)\nand without heating (right panel) for different initial entropy\nprofiles. The idealized heating runs with initial core entropy\nK0 > 30 keV cm2 have a mass accretion rate < 1 M⊙ yr−1 at\nall times. Runs with lower core entropies (C10 and C1) have\nmuch larger instantaneous mass accretion rates (up to 100s\nof M⊙ yr−1 ), but only for short times; more typically they\n\nshow accretion rates between 1 and 10 M⊙ yr−1 , in broad\nagreement with accretion rates inferred from X-ray spectral\nmodeling (see Peterson & Fabian 2006 for a review on X-ray\nspectroscopy of clusters) and from the star formation rates\nin the central galaxy (e.g., O'Dea et al. 2008). The coolingflow runs are qualitatively different from the idealized heating simulations. After a few cooling times the mass accretion\nrate for the cooling-flow runs is consistently larger than 100\nM⊙ yr−1 . Only when the central cooling time is longer than\n5 Gyr (as is the case for K0 = 100 keV cm2 ) does one escape\nthis conclusion. Thus, as intended, our idealized heating prescription prevents a cooling catastrophe even for runs with\nshort cooling times.\nFigure 2 shows an alternate view of the fundamental difference between cooling-flows and clusters in global thermal\nbalance. Here we show the time spent at a given Ṁ for simulations with and without heating. While the mass accretion\nrate is ∼ 100 M⊙ yr−1 at most times for cooling-flows, simula−1\ntions with idealized heating primarily accrete at <\n∼ 1 M⊙ yr .\n−1\nEven for the heating runs that show Ṁ >\n∼ 100 M⊙ yr instantaneously, the time spent in such a phase is only 10 Myr.3\nThis high accretion rate arises only in low entropy simulations (see Table 1) and represents cold filaments which condense out of the hot phase and cross the inner boundary.\nSimulations with intermediate entropies (such as the run C30)\ndo not develop multi-phase gas (see Table 1) and never have\n−1\nlarge accretion rates; Ṁ <\nat all times. Thus,\n∼ 1 M⊙ yr\nlarge accretion rates in simulations with our idealized heating prescription only occurs via cold gas. We show later that\nthis result is not sensitive to our choice for the heating.\nThe absence of cold filaments in our idealized heating\n2\nsimulations with K0 >\n∼ 30 keV cm appears surprising at first\nbecause the cooling time in these clusters (≈ 1 Gyr) is shorter\nthan the run-time-since we initialized the ICM with large\ndensity perturbations, one might expect the TI to become\nstrongly nonlinear and to produce multi-phase gas. The cooling time in these simulations is much longer than the free-fall\ntime, however, and gravity significantly alters the saturation\nof the TI in this limit.The density perturbations saturate at\na small amplitude (δρ/ρ < 1) because the effective gravity\nfelt by slightly overdense blobs (gδρ/ρ) produces strong shear\nwhich mixes the overdense blobs with the hot phase within a\ncooling time. Thus, overdense fluid elements do not cool all\nthe way to the thermally stable phase. By contrast, when the\nTI timescale is shorter than the free-fall time (tTI /tff < 1)\ngravity has essentially no effect on the TI. The TI develops\nand saturates over a few cooling times, and only after a freefall time do the cold filaments fall in toward the center (see\nPaper I for a more detailed discussion of the physics of TI in\n3\n\nThe Eddington rate for a 109 M⊙ black hole is ∼ 10 M⊙ yr−1 (assuming a radiative efficiency of 0.1). Thus, if most of the mass\naccreted in form of cold filaments with Ṁ >\n∼ 1mpy can reach the\nsupermassive black hole, it can power a luminous quasar for a short\nduration (e.g., see Ciotti & Ostriker 1997). Since our simulations\ndo not include star formation and accretion physics we cannot explore this possibility in detail.\nc 2011 RAS, MNRAS 000, 1–26\n\n\fFeedback Regulation of Hot Halos\n\nFigure 2. The mass accretion rate through the inner radius (e.g.,\nin Fig. 1) shows large variations as a function of time, especially\nwhen cold filaments cross the inner boundary. This plot represents the same information as Fig. 1, but shows the time interval spent accreting with a given mass accretion rate; we use 50\nlogarithmically spaced bins in the total mass accretion rate (Ṁ )\nfrom 10−5 to 105 M⊙ yr−1 . While cooling-flows accrete at large\nrates (∼ 100 M⊙ yr−1 ) in the cold phase, simulations with heating (even the low entropy run C1; not shown in this Figure) spend\n−1\nmost of their time accreting in the hot phase with Ṁ <\n∼ 1 M⊙ yr .\nThe results for our idealized heating model and the feedback heating simulations are very similar for both clusters and groups.\nWhile the mass accretion rate in the hot phase is smaller for\nsmaller mass halos, the mass accretion rate is similar whenever\n−1\n−1 is mainly\nṀ >\n∼ few M⊙ yr ; accretion with Ṁ >\n∼ few M⊙ yr\ndue to the infalling cold gas.\n\nthe presence of gravity). In our setup, cold filaments condense\nout from the hot phase, only if the ratio tTI /tff <\n∼ 10 locally;\nwe discuss this more quantitatively below.\n\n3.1.2\n\nCooling to Sub-Virial Temperatures\n\nThe effect of heating is also manifest in the temperature structure of the plasma. Figure 3 shows the luminosity per logarithmic temperature bin for simulations with (C10) and without (C10-cf) heating. We show the simulation with heating\nat two times, one at which there is significant cold gas via\nTI (1–2 Gyr) and one at which there is not (4–5 Gyr). Even\nwhen filaments are present, the luminosity between ∼ 104 K\nand 107 K is a factor of 10–100 times smaller for the run\nwith heating than for a cooling-flow. This is consistent with\nobservations that find a striking absence of the low-energy Xray lines expected in a cooling-flow (e.g., Peterson & Fabian\n2006). The luminosity at ≈ 104 K (below which the plasma\nc 2011 RAS, MNRAS 000, 1–26\n\n7\n\nFigure\n3.\nLuminosity\nper\nlogarithmic\ntemperature\nbin (dL/Log 10 T ; such that the total luminosity is given by\nthe area under the curve) as a function of Log10 TkeV for the\ncooling-flow run (C10-cf) in the quasi-steady state, for the\nidealized heating run C10 averaged from 1–2 Gyr (during\nwhich it shows cold filaments), and for C10 averaged from\n4–5 Gyr (when the filaments are absent). We use 1000 bins in\nLog10 TkeV , and the simulation data are averaged in time and fit\nby a high-order polynomial. The results expected from steady\ncooling-flows (dL/dT = [5/2]kB T Ṁ /μmp ; e.g., Fabian 1994)\nwith Ṁ = 250 M⊙ yr−1 and 2.5 M⊙ yr−1 (long dashed lines) are\nshown for comparison.\n\nbecomes thermally stable) is also smaller for simulation with\nheating, but only by a factor ∼ 3. There is a significant lack\nof plasma at the intermediate temperatures (0.001–1 keV)\nfor simulations in thermal balance because gas blobs at intermediate temperatures are thermally unstable and run away\neither to the hot or the cold phase. Figure 3 also shows that\nthe heating simulations do not show any gas below ≈ 1 keV\nform 4–5 Gyr (when tTI /tff >\n∼ 10) because there is no cold\ngas produced by TI.\nThe luminosity vs. temperature for our cooling-flow simulation in Figure 3 closely matches the analytic cooling-flow\nmodel between 0.1 to 1 keV (dL/dT = [5/2]kB T Ṁ /μmp ;\ne.g., Fabian 1994), with a cooling rate Ṁ = 250 M⊙ yr−1 (a\nvalue similar to the accretion rate in cooling-flow simulations;\nsee Table 1). Without a heat source, the plasma cools almost monolithically; our cooling-flow simulations thus possess\nroughly equal mass per cooling time interval. When heating\nbalances cooling, however, the ICM does not cool monolithically. Slightly overdense cool blobs are therefore able to mix\nwith the hotter ambient plasma as they fall in. Thus cooling\nfrom 1 to 0.1 keV follows a random walk in cooling/heating\nrather than cooling monolithically (Soker & David 2003 en-\n\n\f8\n\nP. Sharma, M. McCourt, E. Quataert, I. J. Parrish\n1.63 Gyr\n\n1.615 Gyr\n\n1.645 Gyr\n\n1.66 Gyr\n\nLog n\n\n10 e\n\n0\n\nz(kpc)\n\n5\n0\n\n−0.5\n−5\n−10\n2.1 Gyr\n\n1.765 Gyr\n\n1.72 Gyr\n\n−1\n\n2.15 Gyr\n\nsmoother (see Appendix A for more details); second, our resolution is not high enough to obtain robust statistics for plasma\nat ∼ 105 − 106 K. A plasma blob cooling isobarically from\n107 K shrinks by a factor ∼ 108 in volume by the time it\nreaches the stable phase.5 Thus cold filaments are not spatially well-resolved even in our highest resolution simulations!\nHowever, we are able to get reasonable statistics by combining\nsimulation data over a long time interval. Very high resolution\nsimulations of the core to quantitatively calculate emission in\ndifferent temperature bins will be carried out in the future.\n\nz(kpc)\n\n5\n−1.5\n0\n−5\n−10\n0\n\n−2\n5\nx(kpc)\n\n10\n\n5\nx(kpc)\n\n10\n\n5\nx(kpc)\n\n10\n\n5\nx(kpc)\n\n10\n\nFigure 4. Snapshots of the electron number density in the inner\n10 kpc for the fiducial simulation (C10) at different times around\nwhen cold filaments condense out of the hot phase. The limits on\nthe electron density contour plots only go from 0.01 to 1 cm−3\nbut the coolest/densest plasma is extremely cold (∼ 104 K) and\ndense (∼ 100 cm−3 ). Cold filaments condense out of the hot phase\nand eventually fall in toward the center; however, the cold gas does\nnot just free-fall radially inwards and can even move outwards in\nradius for some time.\n\nvisage a similar mechanism of a 'moderate cooling-flow') and\nthe slope of the luminosity function is much steeper. Moreover, the amount of gas cooling through lower X-ray temperatures is smaller, as observed, because of reheating. Therefore,\nin simulations with heating the net cooling rate below 1 keV,\nwhich is approximately equal to the average mass accretion\nrate in the cold phase at small radii, is 10–100 times smaller\nthan a cooling-flow.4 However, even in the presence of heating, once gas manages to cool below ∼ 1 keV, it runs away\nall the way to 104 K. Thus our idealized heating run resembles a much-reduced cooling-flow below ∼ 1 keV (cooling is\nreduced by ∼ 100; compare with the cooling-flow prediction\nfor Ṁ = 2.5 M⊙ yr−1 ).\nThe cooling-flow prediction using Ṁ = 250 M⊙ yr−1\nin Figure 3 matches our cooling only simulation for temperatures above 0.1 keV. However, the results deviate at\nlower temperatures for two reasons: first, a cooling-flow with\nlarge density perturbations, as is the case in our simulations,\ncan give rise to blobs at ∼ 104 K cooling out of the soft\nX-ray emitting gas, whereas a steady cooling-flow is much\n\n4\n\nThe exact suppression of luminosity relative to a cooling-flow\ndepends on the ratio tTI /tff . For a small tTI /tff , e.g., at early times\nin the low entropy run C1 the luminosity below 1 keV is closer\nto the cooling-flow value. For larger tTI /tff , the luminosity below\n1 keV can be vanishingly small, as shown by the C10 results at\n4–5 Gyr in Figure 3.\n\n3.2\n\nCool-Core Clusters in Thermal Balance\n\nFigure 4 shows snapshots of the inner radii in our fiducial\nidealized heating run (C10) at times when cold filaments condense out of the hot phase. The top-left panel shows a snapshot right before the condensation of a cold 'filament.' Once\nthe over-dense blob cools below ∼ 1 keV, the cooling rate\nbecomes faster than the turbulent mixing rate and the blob\nquickly cools to the thermally stable temperature. This newly\nborn cold filament has a non-zero velocity because of the motion of the overdense blob from which it formed; cold filaments\ncan thus have instantaneous velocities directed away from\nthe center of the potential. Further cooling of the hot phase\nclose to the cold filament seeds condensation of secondary filaments. Since filaments are born with non-zero velocity, they\nmove through the ICM core before leaving through the inner\nboundary after ∼ few free-fall times. The cold blobs at the\nthermally stable temperature (∼ 104 K) are in rough pressure equilibrium with the hot phase. The dramatic difference\nin density (and temperature) of the cold and hot phases, and\nthe lack of plasma at intermediate densities (temperatures)\nclearly points to local TI as the origin of these cold filaments.\nThe production of cold filaments ceases once the density of\nthe hot phase is depleted such that tTI /tff >\n∼ 10; the bottomright panel of Figure 4 shows the core in a quasi-steady state\nwithout filaments.\nMultiphase structure also develops in cooling-flows with\nlarge density perturbations because of a faster cooling rate\nin overdense blobs (see Appendix A for a detailed analysis).\nWhereas the formation of multi-phase gas in our simulations\nwith idealized heating depends only on the ratio tTI /tff , production of multi-phase gas in cooling-flows depends also on\nthe amplitude of the density perturbations.\nFigure 5 shows the time-(over 1 Gyr intervals) and\nangle-averaged profiles of entropy (left panel) and the ratio\ntTI /tff (right panel) for the fiducial run from 0 to 5 Gyr. The\ncold filaments of the kind seen in Figure 4 show up as troughs\nin the entropy and tTI /tff profiles at 1–2 and 2–3 Gyr. Having condensed from the hot phase, these dense filaments fall\nthrough the inner boundary at roughly the free-fall rate. By\n3 Gyr the hot ICM has both been heated and lost sufficient\n5 For a steadily cooling blob M/t\ncool ≈ constant, irrespective of\nthe temperature bin, where M is the mass in a given temperature\nbin. Thus, the volume occupied by a cooling blob in an isobaric\ncooling-flow is reduced by ∼ T 3 /Λ.\n\nc 2011 RAS, MNRAS 000, 1–26\n\n\fFeedback Regulation of Hot Halos\n\n9\n\nFigure 5. Time- and angle-averaged entropy (left; hne T i/hne i5/3 , where hi represents averaging in θ and φ) in keV cm2 and tTI /tff (right)\nas a function of radius for the fiducial run C10. Solid black line represents the initial profile. The other lines are the profiles averaged over\na 1 Gyr timescale at different times. Sharp low entropy (and low tTI /tff ) troughs seen from 1–2 Gyr and 2–3 Gyr are because of infalling\ncold gas filaments, which are also responsible for the large accretion rates seen in Figures 1 & 6 during the same time intervals.\n\nmass due to \"drop-out\" of cold filaments that tTI /tff > 10\neverywhere. There are no more cold filaments produced once\ntTI /tff > 10, even though the cooling time in the core is less\nthan 1 Gyr. This is also reflected in the entropy profile as a\nrise in the central entropy to K0 ≈ 20 keV cm2 in the final\nstate. As mentioned already, cold filaments condense out of\nthe hot phase only when the ratio tTI /tff <\n∼ 10, or equivalently\n2\n< 20 keV cm .\nwhen the core entropy K0 ∼\nThe cold filaments falling toward the center cause a sudden increase in the mass accretion rate at small radii. Figure 6 shows the mass accretion rate through the inner radius (1 kpc) in different phases for the fiducial run: cold\nphase with T < 0.01 keV, intermediate phase with 0.01 keV\n< T < 0.1 keV, and hot phase with T > 0.1 keV. These\ntemperature ranges are chosen somewhat arbitrarily, but the\nresults do not depend sensitively on the exact temperature\nvalues because there is very little plasma between the stable\nphase (at ∼ 104 K) and about one-third of the virial temperature (see section 4.3). The big spikes in Ṁ for the fiducial run\nC10 in Figure 1 coincide with cold filaments (seen in Fig. 4)\nfalling through the inner boundary. The mass accretion rate\nin the hot and intermediate phases is < 10 M⊙ yr−1 at all\ntimes. However, the mass accretion rate in the cold phase can\nreach up to 1000 M⊙ yr−1 for short times due to cold dense\nfilaments crossing the inner boundary. The infalling cold filaments have a sheath of plasma at intermediate temperatures\nwhich contributes to the small mass flux at intermediate temperatures during the infall of cold filaments.\n\n3.3\n\nSelf-Regulation of the ICM core\n\nHaving discussed how the timescale ratio tTI /tff influences\nthe accretion rate and the amount of cold gas in the ICM,\nwe now discuss how these effects in turn influence the ratio\nc 2011 RAS, MNRAS 000, 1–26\n\nFigure 6. Mass accretion rate through the inner boundary (1 kpc)\nfor the fiducial run (C10) as a function of time. The accretion\nrate in different temperature phases is indicated by different colors/styles. The instantaneous accretion rate in the cold (T <\n−1\n0.01 keV) phase can be large, reaching >\n∼ 100 M⊙ yr , but lasts\nonly for short bursts (see Fig. 2). Most of the time accretion occurs\nin the hot (T >0.1 keV) phase. Accretion of plasma at intermediate\ntemperatures (0.01 keV < T < 0.1 keV) coincides with the infalling\ncold filaments, but is subdominant. The green short-dashed line indicating accretion at intermediate temperatures is obscured by the\nblue long-dashed line showing accretion in the cold phase.\n\n\f10\n\nP. Sharma, M. McCourt, E. Quataert, I. J. Parrish\n\nFigure 7. Time- and angle-averaged entropy (left; hne T i/hne i5/3 ) in keV cm2 and tTI /tff (right) as a function of radius for the run C1.\nSolid black line represents the initial profile. The other lines are the profiles averaged over a 1 Gyr timescale at different times.\n\ntTI /tff in the cool-core of the ICM. We show in this section\nthat the local TI tends to maintain clusters close to the critical\nthreshold for forming filaments such that tTI /tff ∼ 10. The\ncondition for forming cold filaments (tTI /tff <\n∼ 10) can be\nexpressed in terms of entropy and the free-fall time as\n\u0012\n\u0014\n\u0013\u00152/3\ntff\n1/2\n2\nK<\n20\nkeV\ncm\nT\nΛ\n,\n(11)\nkeV −23\n∼\n30 Myr\nwhere we have assumed a heating rate which is constant per\nunit volume (q + ∝ ρ0 ). Thus our thermal instability model\ncan explain the observational lack of cold gas indicators in\nclusters with K0 > 30 keV cm2 and the observed overabundance of cool-core clusters at K0 ∼ 10 keV cm2 (e.g.,\nFig. 1 in Cavagnolo et al. 2008).\nFigure 7 shows the entropy and tTI /tff profiles at different times for a cluster with an initially low entropy core\nC1 (K0 = 1 keV cm2 ). Cold filaments quickly condense out of\nthe hot phase since the ratio tTI /tff < 10 everywhere within\n20 kpc. The infalling cold filaments leave the inner boundary\nafter roughly a free-fall time. The entropy of the remaining\nplasma, maintained in hydrostatic equilibrium by our idealized heating prescription, thus increases. For extremely lowentropy initial conditions the central entropy increases very\nquickly because of a short cooling time; this happens in less\nthan 1 Gyr for the run C1 (see Fig. 8). After a few TI times,\nthe density profile (and the entropy profile as well) adjusts\nsuch that the ratio tTI /tff is close to the critical value of ≈ 10.\nThis adjustment of the inner ICM because of TI and infalling\ncold filaments plays a very important role in determining the\ndensity profile of the hot plasma in halos of different masses,\nas we discuss further in section 3.4.\nThe average entropy at small radii from 4–5 Gyr for\nthe run C1 is slightly lower than the inner entropy at late\ntimes for the fiducial run (see Fig. 5). This slightly lower entropy (and tTI /tff smaller than the critical value) results in\nanother episode of filaments forming and falling through the\ninner boundary at 4 Gyr, as seen in the left panel of Figure 1.\n\nThus, tTI /tff <\n∼ 10 is a robust criterion for the presence of\nfilaments, irrespective of the initial conditions. Moreover, the\ncritical ratio tTI /tff is self-regulated to be >\n∼ 5 − 10 because of\nheating and mass drop-out in the form of cold filaments. Also\nnotice that the inner core at late times does not have a flat\nentropy profile, though the profile is shallower compared to\nthe larger radii. While the exact entropy profile at small radii\ndepends on the details of heating and cooling, an isentropic\ncore appears to be a good approximation because the cool\nlow-entropy plasma blobs leave from the inner boundary and\nthe hot plasma is mixed throughout the core.\nFigure 8 shows the minimum of the ratio tTI /tff as a\nfunction of time for the cluster runs C1, C10, and C30 (and\nthe group run G50 discussed in section 3.4). As can be seen in\nFigures 5 & 7, the minimum in tTI /tff increases due to mass\ndrop-out in the form of cold filaments for runs C1 and C10.\nWhenever tTI /tff <\n∼ 10 in Figure 8, cold filaments condense\nout of the hot phase and fall in through the inner boundary, and are seen as spikes in the mass accretion rate in\nthe left panel of Figure 1. The minimum of the ratio tTI /tff\nis larger than the critical value (10) for the run C30 (with\nK0 = 30 keV cm2 ) and there are no cold filaments (e.g., see\nTable 1). Figure 8 shows that this ratio (and the core entropy\nK0 ) does not evolve much with time, even though the cooling\ntime is ≈ 1 Gyr. The mass accretion rate for this run is much\nsmaller than for the cooler clusters because massive cold filaments cannot condense out of the hot phase (see left panel\nof Fig. 1). Although the cooling time is less than the cluster\nage for run C30 there is no cooling-flow because of our heating prescription (compare C30 and C30-cf in Fig. 1). Thus,\neven clusters which are unlikely to show cold filaments (since\ntTI /tff > 10), but which have cooling times shorter than the\ncluster age, require heating roughly balancing cooling to prevent a massive cooling-flow.\nThe rapid adjustment of cool-core clusters to tTI /tff >\n∼ 10\nvia mass drop-out and heating, and the suppression of Ṁ (and\nc 2011 RAS, MNRAS 000, 1–26\n\n\fFeedback Regulation of Hot Halos\n\nFigure 8. The minimum of the ratio tTI /tff as a function of time\nfor various runs (evaluated from angle-averaged radial profiles of\nplasma with temperature > 0.1 keV sampled every 50 Myr). Cold\nfilaments condense out and result in large accretion rates whenever\nthe ratio tTI /tff <\n∼ 10 (compare with the left panel of Fig. 1). This\nin turn leads to significant heating, driving tTI /tff to be >\n∼ 10.\n\nhence feedback) if tTI /tff >\n∼ 10 suggest that cool-core clusters will spend most of their time close to the threshold\nfor forming cold filaments, so long as heating is related to\nthe amount of cold gas produced by TI (as is the case for\nAGN/supernova feedback). This physics can quantitatively\naccount for the observed excess of clusters with central entropies around 10 keV cm2 (e.g., Cavagnolo et al. 2008;\nPratt et al. 2010). In addition to cool-core clusters affected\nby cooling and feedback, there are also non-cool-core clusters\nwhich have high entropies because of strong feedback heating\nand/or mergers. These non-cool-core clusters, relatively unaffected by cooling, maintain their high entropies and form a\nclass distinct from the cool-core clusters.\n3.4\n\nComparison of Different Halo Masses\n\nWe have also carried out simulations with our idealized heating prescription in lower mass, group-sized halos (M0 =\n3.8×1013 M⊙ ), in massive groups with M0 = 1014 M⊙ , and in\nmore massive cluster halos (M0 = 1015 )-these appear in Table 1 with the prefixes 'G,' 'MG,' and 'MC,' respectively. The\nnumber after the prefix represents the entropy of the equivalent fiducial-mass halo, assuming self-similar scaling. Thus,\nruns G300 and C300 have identical density profiles, but the\ntemperature in run G300 is lower by a factor of 102/3 and the\ncore entropy in G300 is K0 = 300/102/3 = 64.6 keV cm2 .\nAt a given scaled entropy, cooling becomes stronger in\nc 2011 RAS, MNRAS 000, 1–26\n\n11\n\nlower mass halos because of the corresponding decrease in\nthe virial temperature (tcool ∝ T 1/2 /n ∝ M 1/3 ). On the other\nhand, the free-fall time (tff ∝ [r 3 /Menc ]1/2 ) at a given (scaled)\nradius is roughly independent of the halo mass because dark\nmatter, which dominates gravity, is self-similar. Consequently,\ngroups develop multi-phase gas at a higher scaled entropy\nthan do clusters; e.g., while cold filaments do not condense\nfrom the hot phase in the cluster run C30, filaments are seen\nin the group run G50.\nThe group run G50 is, in fact, initially very close to the\nthreshold for forming multi-phase gas. Figure 8 shows the\nminimum of the ratio tTI /tff as a function of time for this\nsimulation. It does not show cold filaments from 0–1 Gyr, but\nbecause of slightly low entropy material falling in from larger\nradii, it crosses the threshold for forming cold filaments after\n1 Gyr. The group also undergoes a second, stronger episode of\nthermal instability and again forms filaments after ≈ 3 Gyr;\nthis depletes the core of much of its gas and raises the entropy\nin the hot phase much beyond the critical threshold.\nFigure 2 shows that the mass accretion rate in the hot\nphase is smaller in groups than in clusters by a factor of ∼\n10 (their mass ratio; see also Table 1), but that the mass\naccretion rate in the cold phase (which accounts for any Ṁ >\n∼\nfew M⊙ yr−1 ) is nearly independent of the halo mass. Thus,\nthe amount of gas which reaches the cold phase is similar in\nour group- and cluster-mass halos and these halos therefore\nreceive similar amounts of feedback energy. The mass of the\nhot phase is lower in groups than in clusters, however, and the\neffect of this feedback is therefore much stronger. Thus, even\nin our idealized heating model, heating of the hot phase can\noverwhelm cooling in lower mass halos, resulting in a much\nlower density (and larger tTI /tff ) than the critical threshold\nfor filament formation. The last 2 Gyr in Figure 8 illustrate\nthis overshoot.\n3.4.1\n\nBigger Cool-Cores for Lower Mass Halos\n\nFigure 9 shows the angle averaged entropy and electron number density in the hot phase (T > 0.1 keV; time averaged from\n4–5 Gyr) as a function of radius (scaled to the virial radius)\nfor simulations with different halo masses; only halos prone\nto the formation of cold filaments according to our tTI /tff criterion (runs MC1, C10, MG10, & G50) are shown. The ICM\nwith tTI /tff <\n∼ 10 develops cold filaments which remove mass,\nand bring tTI /tff , entropy, and density in the core close to the\ncritical value. Thus, the core density (entropy) for each halo\nin Figure 9 represents a limit below (above) which cold filaments cannot condense out for a given halo mass. While the\ntemperature decreases with a decreasing halo mass, the core\nradius (where the ratio tTI /tff ∝ T 1/2 /(ntff ) is the smallest)\nincreases, assuming a similar density profile outside the core\nradius. Thus the free-fall time tff ∝ (r/r200 )1/2 at the core\nradius increases with a decreasing halo mass. These trends in\ntemperature and tff at the core radius roughly cancel, leading to an entropy threshold for filament formation (Eq. 11)\nthat is similar for groups and clusters. This can be verified\nfrom Figure 9 which shows a relatively constant entropy for\n\n\f12\n\nP. Sharma, M. McCourt, E. Quataert, I. J. Parrish\n\nFigure 9. The angle- and time-averaged (4–5 Gyr) electron number density (ne incm−3 ) and entropy (keV cm2 ) as a function\nof radius (scaled by the virial radius) for the idealized heating\nruns (MC1, C10, MG10, & G50; solid lines) and for the runs with\nfeedback heating (C10-fb-2em3 with ǫfb = 2×10−3 & G50-fb-7em5\nwith ǫfb = 7 × 10−5 ; dotted lines). Only the hot X-ray emitting\nplasma with T > 0.1 keV is used to calculate the average radial\nprofiles. Both the core density and temperature decrease with a\ndecreasing halo mass; therefore the core entropy is relatively independent of the halo mass.\n\ndifferent halo masses; as a result, the core entropy for groups\n2/3\nis larger than the self-similar prediction K ∝ M0 , as is observed (e.g., Ponman, Cannon, & Navarro 1999; Sun et al.\n2009).\n\nFigure\n10.\nLuminosity\nper\nlogarithmic\ntemperature\nbin (dL/Log10 T ) as a function of temperature for different\nhalo masses; the data are averaged over a 1 Gyr interval when\nthe models have cold filaments. The axes are scaled according to\n4/3\nthe self-similar prediction for luminosity (∝ M0 ) and tempera2/3\n\nture (∝ M0 ). The normalization of both axes is relative to the\ncluster mass halo (MC = 3.8 × 1014 M⊙ ).\n\ncorresponding to the group G50 in Figure 10 shows a small\nbump at double the ambient temperature because some of the\ngas is heated above the virial temperature; this is consistent\nwith the late-time rise in the ratio tTI /tff for G50 in Figure 8.\n\n3.4.3\n3.4.2\n\nLack of Gas below T0 /3\n\nIn section 3.1.2 we showed that for our cluster model in thermal balance only a tiny fraction of the plasma cools below\n≈ 1 keV. Here we discuss the cooling of the hot gas in different\nhalo masses. Figure 10 shows the luminosity (dL/d log10 T ) as\na function of temperature for simulations with different halo\nmasses which show cool filaments (MC1, C10, MG10, & G50;\nthese are all 'cool-core' halos). The axes are scaled according to the self-similar prediction. The profiles are obtained\nby averaging over 1 Gyr coinciding with the last episode of\ncondensation due to TI. For all halos the luminosity drops\nquite abruptly below the temperature corresponding to the\npeak luminosity. Moreover, the shape of dL/dLog10 T vs. temperature below the peak temperature is quite similar, and is\nconsistent with the observational fact that there is negligible\nluminosity below 1/2 − 1/3 of the ambient cluster temperature (e.g., Peterson et al. 2003; Sanders et al. 2010). The line\n\nThe Required Heating Efficiency\n\nThe last columns of Tables 1 & 2 list the required average\nheating efficiency ǫ = Q+ /RṀ c2 corresponding to our heating\nr\nprescription, where Q+ = r cool q + (r)4πr 2 dr (q + is given by\nin\nEq. 6), rin is the inner radius, rcool is the cooling radius where\nthe angle-averaged cooling time is ≈ 5 Gyr, and Ṁ is the average accretion rate through the inner radius. In calculating\nthe efficiency we do not integrate over the whole domain, although we do apply our heating prescription at all radii, because the radii where the cooling time is longer than 5 Gyr do\nnot require heating to maintain the pressure support. Thus,\nthe efficiency is zero for the high entropy runs with cooling\ntimes longer than 5 Gyr. Among cluster runs (prefixed by C),\nthe required efficiency (ǫ) peaks at ≈ 5 × 10−3 for the lowest core entropy run which does not show cold filaments (run\nC30). Even for other halo masses, the required heating efficiency roughly peaks for the lowest entropy run not showing\nfilaments. The required efficiency is smaller once cold filaments can condense because while the global cooling rate is\nc 2011 RAS, MNRAS 000, 1–26\n\n\fFeedback Regulation of Hot Halos\nsimilar to the higher entropy runs with no filaments, the mass\naccretion rate is dramatically larger.\nThe required heating efficiency for runs at the threshold\nfor forming cold filaments (MC1, C10, MG10, and G50) decreases with a decreasing halo mass; e.g., while ǫ for the run\nC10 is 10−3 , it is 7.4 × 10−5 for G50, more than ten times\nsmaller. This is because the mass in the hot phase decreases\nby ≈ 10 from C10 to G50, but the mass accretion rate (primarily in the cold phase) is about the same (Fig. 2; see also\nTable 1). Thus, a smaller feedback efficiency is sufficient to\nbalance cooling for a smaller mass halo. For a realistic feedback scenario this means that while AGN feedback is required\nfor group and cluster mass halos (supernova feedback is quite\n−5\ninefficient, ǫ <\n∼ 10 ), supernova feedback may be sufficient\nfor Galactic scale halos that have an even smaller mass in the\nhot phase. A similar conclusion is reached for our simulations\nwith feedback heating discussed in section 4. One implication\nof this result is that, if AGN heating with a fixed feedback\nefficiency is responsible for heating cool cores, the lower mass\nhalos can be heated much more than more massive ones.\n\n3.5\n3.5.1\n\n3.5.2\n\n13\n\nThree-Dimensional Runs & Convergence Studies\n\nTable 2 lists three-dimensional (256 × 128 × 32) simulations\nof clusters C10 and C30. The two- and three-dimensional\nsimulations agree in that the runs C30 and C30-3D with\ntTI /tff > 10 do not show cold filaments but the runs with the\nratio tTI /tff < 10 (C10 and C10-3D) show filaments. The mass\nin the cold phase, mass accretion rate, etc. are not identical in\ntwo and three dimensions because there are non-axisymmetric\ninitial perturbations in the three-dimensional simulations.\nTable 2 also lists two-dimensional simulations but with\nhigher and lower resolution than the fiducial case. The lower\ncore entropy (C10, C10-hlf, C10-dbl) cases show cold filaments for all resolutions. Similarly, the higher core entropy\nruns (C30, C30-hlf, C30-dbl) do not show cold filaments for\nany resolution. The threshold for forming multi-phase gas and\nthe integrated quantities such as the average mass accretion\nrate are roughly independent of the resolution. We showed in\nSharma, Parrish, & Quataert (2010) that thermal conduction must be included in order to achieve strict convergence.\nSince we cannot resolve the Field length in the cold phase\nwith a realistic cooling function using present computational\nresources, we necessarily sacrifice strict convergence.\n\nRobustness of the Idealized Heating Ansatz\nSpatial & Temporal Perturbations on Heating\n\nTo test the robustness of our results we also carried out simulations with spatial and temporal perturbations in heating\non top of thermal balance at every radius. Simulations with\nrather large variations about this balance are qualitatively\nsimilar to the idealized simulations (Table 2; see also Paper I). The run C10-p10 is similar to the fiducial case but\nwith temporal perturbations in the heating rate of a factor\nof ≈ 10 at each grid cell (on top of q + given by Eq. 6). The\nperturbations, chosen from a uniform distribution centered\nat zero, have a correlation time of 100 Myr (the results do\nnot depend sensitively on the correlation time). The entropy\nand tTI /tff profiles are similar to those for the fiducial run in\nFigure 5. Table 2 also shows that the higher entropy run with\nperturbations C30-p10 does not show cold filaments, consistent with our idealized run C30. Thus, our picture of TI holds\neven with large perturbations in the heating rate because on\naverage the plasma is still in thermal equilibrium.\nWe also carried out simulations (C10-nz1, C10-nz4, etc.)\nin which the balance of heating and cooling is imposed on\nlarger scales, rather than at every radius as is the case in the\nidealized simulations we have focused on; e.g., in run C10nz16 the heating rate in each of 16 logarithmically spaced radial zones is calculated by averaging cooling over each zone.\nFrom these simulations we find that if heating balances cooling on scales smaller than the cooling scale height (the scale\nover which the cooling rate changes significantly) then the\nresults are similar to the idealized heating runs. We thus conclude that, as argued in Paper I, many of the details of heating are not important for the thermal evolution of the halo,\nas long as the heating stabilizes the ICM against a cooling\ncatastrophe.\nc 2011 RAS, MNRAS 000, 1–26\n\n4\n\nSIMULATIONS WITH FEEDBACK HEATING\n\nIn this section we describe the feedback simulations in which\nthe integrated (isotropic) heating rate is proportional to the\ninstantaneous mass accretion rate at the innermost radius.\nThis feedback model is clearly only a rough approximation\nto heating by a central AGN, but as we shall show, it provides a useful demonstration that many of the results in the\nprevious section are robust and do not depend sensitively on\nthe precise details of the heating. Although the exact mechanisms which heat the ICM are not fully understood, possible\nscenarios involve jets and bubbles launched by the central\nAGN. These processes are ultimately fed by accretion, however, and their power is likely to be proportional to the mass\naccretion rate. Feedback heating by jets, bubbles, or star formation likely lags the instantaneous accretion rate by up to\n∼ 100 Myr, the dynamical time at the core radius. Moreover,\nthe feedback efficiency is likely to be time variable and may\ndepend on the mass accretion rate. More realistic modeling\nof accretion and launching of jets is outside the scope of this\npaper and will be investigated in the future.\nOur feedback simulations are initialized far from equilibrium, with the heating rate q + = 0 but the cooling rate\nq − > 0. Nonetheless, after a transient phase, they are able\nto reach an approximate thermal equilibrium where average\nheating in the core roughly balances average cooling. Thus,\nthe results from our idealized heating simulations carry over\nto these more realistic feedback simulations. Table 3 lists the\nruns with feedback heating using q + in Eq. 7. In section 4.1 we\ndescribe the feedback simulations for clusters. In section 4.2\nwe show that feedback simulations for groups require lower\nfeedback efficiency to achieve thermal balance. Section 4.3\n\n\f14\n\nP. Sharma, M. McCourt, E. Quataert, I. J. Parrish\n\nFigure 11. Total mass accretion rate (in M⊙ yr−1 ) through the\ninner radius (1 kpc) for the cluster runs with feedback heating.\nDifferent feedback efficiencies are labeled. Large spikes in the accretion rate correspond to infalling cold filaments crossing the inner\nboundary. The duty cycle for cold filaments and AGN feedback is\nshorter for a smaller feedback efficiency.\n\ncompares the results from our idealized heating simulations\ndiscussed in the previous section with the feedback runs.\n\nments drive strong feedback and can overheat the ICM, as\nwe discuss below. The feedback efficiency sets the duty cycle\nfor the production of the multi-phase gas and for feedback\nheating (the duty cycle is shorter for a smaller feedback efficiency), but not the critical threshold for the TI. The excursions about the critical threshold can be large, however, and\ndepend on the feedback efficiency. The results are not sensitive to the initial core entropy and the initial transients are\nwiped out on the core cooling timescale.\nFigure 12 shows profiles of entropy and of the ratio\ntTI /tff for a simulation with an intermediate efficiency ǫfb =\n0.002 (C10-fb-2em3). Cooling initially dominates heating and\ncauses the ratio tTI /tff to drop below the critical threshold of\n∼ 10; the TI thus creates cold filaments which reach the\ncenter around 0.2 Gyr and lead to feedback heating. Heating\ncontinues until tTI /tff > 10 everywhere and, by 1–2 Gyr, the\ncore entropy has significantly increased. With this intermediate efficiency, however, the hot-phase accretion is too small\nfor the feedback to completely balance cooling. The core cools\nslowly but secularly and again crosses the tTI /tff <\n∼ 10 threshold after another 1–2 Gyr. This leads to a second episode of\naccretion and heating. This pattern-with the ICM maintaining rough thermal balance and producing multiphase gas\nwhenever tTI <\n∼ 5 − 10 tff -would likely continue if we ran the\nsimulation further.\nThe bump around 60 kpc in the profiles in Figure 12\nresult from the particular choice of the heating parameters in\nEq. 7. Our aim here is not to produce a profile which perfectly\nmatches observations by varying all the parameters in the\nheating function, but rather to obtain something reasonable\nwithout much fine tuning.\n\n4.2\n4.1\n\nFeedback Heating in Clusters\n\nFigure 11 shows the mass accretion rate as a function of time\nfor the cluster simulation C10 with our feedback heating prescription. We show simulations with feedback efficiencies ǫfb\n= 0.007, 0.004, 0.002, 7×10−4 (see Eq. 7). As discussed above,\nall simulations are initially out of thermal equilibrium and the\naccretion rates spike around 0.2 Gyr, or roughly the cooling\ntime in the core. If the feedback efficiency is large enough (e.g.,\nǫfb = 0.007), the ICM approaches a steady-state with a low\nṀ and a low core density. The ratio of the crucial time-scales\ntTI /tff is greater than 10 at all radii in this state, and cold\nfilaments therefore do not form at later times. If the efficiency\nis too low (e.g., ǫfb = 7 × 10−4 ), however, a larger mass flux\nis required to maintain thermal equilibrium in the core; such\nhigh accretion rates can only be supplied by cold filaments.\nThe evolution of these simulations is therefore sporadic, punctuated by episodes of strong cooling or heating. For intermediate feedback efficiencies (ǫfb = 0.002, 0.004), the ratio of\ntime-scales tTI /tff is typically larger than 10, but occasionally drifts to lower values. Filaments in these simulations are\na rare, transient phenomenon.\nIn all cases, cold gas condenses from the ICM when (and\nonly when) the ratio tTI /tff <\n∼ 10. These infalling cold fila-\n\nFeedback Heating in Groups\n\nFigure 13 shows the mass accretion rate through the inner\nradius as a function of time for group mass halos (M0 =\n3.8 × 1013 M⊙ ) with different feedback efficiencies. The cutoff\nradius (rcf ) in Eq. 7 is chosen to be 70 kpc. Other parameters in the heating function (Eq. 7) are chosen to be the\nsame as before (α = −1.5 and β = 3.5). The qualitative behavior of Ṁ as a function of time is similar to the clusters in\nFigure 11 in that accretion in the cold phase becomes progressively more important as the feedback efficiency is reduced.\nNotice, however, that the transition from a large accretion\nrate in the cold phase to a state with accretion primarily in\nthe hot phase takes place at a lower feedback efficiency. For\nclusters this transition happens around ǫfb ≈ 0.002 but in\ngroups it occurs for ǫfb ≈ 7 × 10−5 . This conclusion was also\nreached for simulations with idealized heating and has implications for possible sources of feedback in groups/clusters\nand galactic halos.\nFigure 14 shows the entropy and tTI /tff profiles for the\ngroup run with ǫfb = 7 × 10−5 (G50-fb-7em5). The qualitative behavior is very similar to the cluster simulations with\nintermediate feedback. There is an initial spike in accretion\nbecause heating is small at early times. After an early episode\nof filament condensation and heating the critical ratio tTI /tff\nc 2011 RAS, MNRAS 000, 1–26\n\n\fFeedback Regulation of Hot Halos\n\n15\n\nFigure 12. Time- and angle-averaged entropy (left; hne T i/hne i5/3 ) in keV cm2 and tTI /tff (right) as a function of radius for the cluster\nrun with feedback heating (ǫfb = 0.002; run C10-fb-2em3 in Table 3). Solid black line represents the initial profile. The other lines represent\nthe profiles averaged over a 1 Gyr timescale at different times.\n\n4.3\n\nFigure 13. Total mass accretion rate (in M⊙ yr−1 ) through the\ninner radius for group models (G50) with feedback heating. Different feedback efficiencies are labeled. Large spikes in accretion\ncorrespond to infalling cold filaments crossing the inner boundary.\n\nbecomes > 10 and there is a period of ≈ 1.5 Gyr (from 1.5\nto 3 Gyr) without multi-phase gas. There is a second episode\nof filaments at ≈ 3.5 Gyr. One important difference from the\ncluster runs is that the relative size of the core affected by\ncooling and feedback is much larger for groups than for clusters (see also Fig. 9).\nc 2011 RAS, MNRAS 000, 1–26\n\nComparison to Idealized Heating Simulations\n\nFigure 15 illustrates the feedback regulation process under\neach of our heating prescriptions. Here we plot the minimum\nof the angle-averaged tTI /tff as a function of time, taking\nonly the X-ray emitting plasma into account; this quantity\ndetermines whether the ICM develops multi-phase structure,\nand its temporal evolution depends qualitatively on the heating mechanism. With our 'idealized' heating prescription, the\nheating responds both locally and instantaneously to cooling\nand it keeps the ICM very close to the threshold for filament\nformation, tTI /tff ∼ 10. Our 'feedback' heating prescription is\nnot so tailored and it, by contrast, only balances cooling in an\naverage sense. Consequently, the departures from the critical\nvalue of tTI /tff are much larger in our feedback simulations\nthan in our idealized simulations; this leads to the episodic\ncondensation of cold filaments discussed in section 4.1.\nThough simulations with our idealized heating prescription are always in global thermal equilibrium, our feedback\nsimulations are initialized very far from equilibrium. As discussed above (section 4.1), this leads to a period of rapid,\ncold-mode accretion (around 0.2 Gyr in Figs. 11 & 13), followed by a strong feedback event.6 This is seen as a sudden\nincrease in min(tTI /tff ), after which heating is suppressed because mass accretion occurs only through the much slower\nhot-mode (see Figs. 11 and 13). As the core slowly cools, the\nratio tTI /tff again falls below the threshold of ∼ 10, leading again to a period of cold-mode accretion and a strong\n\n6\n\nThe delay between condensation of cold filaments and large energy injection due to feedback is of order the free-fall time of filaments from the radius at which they form. Also notice that the\nsecular cooling time in the state without filaments is longer for\ngroups than for clusters because of a longer cooling/free-fall time\nin a bigger core (see Fig. 9).\n\n\f16\n\nP. Sharma, M. McCourt, E. Quataert, I. J. Parrish\n\nFigure 14. Time- and angle-averaged entropy (left; hne T i/hne i5/3 ) in keV cm2 and tTI /tff (right) as a function of radius for the group\nrun with feedback heating (ǫfb = 7 × 10−5 ; run G50-fb-7em5 in Table 3). Solid black line represents the initial profile. The other lines are\nthe profiles averaged over a 1 Gyr timescale at different times. Cooling and feedback affect a larger radius in lower mass halos because of\nthe shorter cooling time (e.g., compare this Figure with Figs. 5 & 12).\n\nfeedback event. Eventually the feedback simulations settle in\nrough thermal balance similar to the idealized heating runs.\nThere are several additional similarities between our idealized heating simulations and the feedback simulations. The\nluminosity at sub-virial temperatures (as in Fig. 3) for feedback simulations looks very similar to the idealized heating\nsimulations. In both cases cooler gas exists only when the\nratio tTI /tff <\n∼ 10, and cooling to sub-virial temperatures is\nsuppressed by a factor of ∼ 100 as compared to the coolingflow simulations, in agreement with observations of cool-core\nclusters (e.g., Peterson & Fabian 2006). Figure 2 shows that\nthe time spent accreting at a given Ṁ is very similar for our\nidealized heating simulations and our feedback simulations,\nfor both groups and clusters. The fact that the more realistic\nfeedback heating runs are much closer to our idealized heating runs than to a cooling flow and consistency with several\ncluster observations strongly suggest that our models with\nidealized/feedback heating capture the key thermal physics\nof cool-core clusters.\n\n5\n\nADDITIONAL ASTROPHYSICAL\nIMPLICATIONS\n\nOur work on local thermal instability in global thermal equilibrium is relevant to several other puzzles related to the hot\ngas in massive halos. Here we discuss three applications in\ndetail.\n5.1\n\nAGN Fueling: Hot or Cold Gas?\n\nFor massive elliptical galaxies, Allen et al. (2006) argued that\nthe observed jet power (calculated from estimating the energy\nand inflation timescale for X-ray cavities/radio-bubbles) is\nwell correlated with the estimated Bondi accretion rate of\n\nthe hot ICM (see Narayan & Fabian 2011 for models of this\nphysics). The estimate of the Bondi accretion rate is quite\nuncertain because it requires extrapolating the density and\ntemperature from large radii to the radius of influence of the\nsupermassive black hole. Nonetheless, the possible correlation\nof the Bondi accretion rate and the jet power suggests that\nthe supermassive black hole may be fed by the hot ICM. In\nour calculations, we indeed find that systems spend most of\ntheir time accreting primarily via the hot phase (Fig. 2).\nFor several reasons, however, it is not clear whether the\nconnection between the Bondi accretion rate and the true\nAGN accretion rate is that robust. The Bondi accretion rate is\n∝ K −3/2 (where K is the entropy at the Bondi radius). Thus\nlower entropy implies a larger Bondi accretion rate. However,\nlower entropy also implies smaller tcool /tff (see Eqs. 8-10 for\nthe definition of different important timescales) and thus a\nhigher accretion rate via cold gas formed by local TI. Cavagnolo et al. (2008) showed that clusters with the central\n2\nentropy <\n∼ 30 keV cm (or equivalently, tTI /tff <\n∼ 10; see Eq.\n11) show a large Hα luminosity and a large radio luminosity (a proxy for jet power), suggesting a connection between\ncold gas, AGN feedback, and the state of the hot gas. Indeed,\nour TI model predicts that the mass accretion rate, and hence\nfeedback, increases dramatically whenever tcool /tff <\n∼ 10. By\ncontrast, the dependence of AGN accretion and feedback on\nthe thermal state of the ICM is not expected to be as abrupt\nif accretion proceeds primarily via hot gas.\nFor the specific systems in Allen et al. (2006), the cen−3\ntral gas densities are >\n∼ 0.1 cm . Thus, these systems are\nin fact prone to forming cold filaments at small radii according to our tcool /tff criterion. Future observations with\ndensity/temperature measurements close to the black hole's\nsphere of influence are required to ascertain if the Bondi scaling of the jet power is robust, or if it is by product of the correc 2011 RAS, MNRAS 000, 1–26\n\n\fFeedback Regulation of Hot Halos\n\n17\n\nprofile of a given halo is isothermal.7 In this case\nZ c\nLX = 4πrs3 Λ0 (T /T0 )1/2\nn(x)2 x2 dx,\n0\n\nFigure 15. The minimum of the ratio tTI /tff for the fiducial run\nand the feedback heating simulations sampled every 50 Myr as a\nfunction of time (tTI /tff is evaluated from angle averaged radial\nprofiles of plasma with T > 0.1 keV; the results do not depend\nsensitively on the cutoff temperature as long as it is < 1/3 the\nambient temperature). Filaments condense out of the hot phase\nwhenever tTI /tff <\n∼ 10 for both idealized and feedback heating runs.\nThis can be seen by comparing this plot with the mass accretion\nrate as a function of time (Figs. 1, 11, & 13). The spike in the mass\naccretion rate corresponds to infalling cold filaments; it is preceded\nby a drop in min(tTI /tff ) to less than the critical value (≈ 10) and\nfollowed by an increase in min(tTI /tff ) as the ambient plasma is\nheated and cold matter drops out of the hot phase.\n\nlation between entropy (or, better, tcool /tff ) and the presence\nof cold gas via local TI.\n\n5.2\n\nLX − TX Relation\n\nThe observed relationship between the X-ray luminosity\nand the X-ray emissivity-weighted temperature of groups\n3\n) than the self-similar scaling predicis steeper (LX ∝ TX\n2\ntion (LX ∝ TX ; e.g., Evrard & Henry 1991; Bryan 2000 and\nreferences therein). Here we argue that the non-self similarity\nintroduced by the requirement tcool /tff >\n∼ 10 can qualitatively\naccount for these observations.\nThe total X-ray luminosity produced by a hot halo is\nZ r200\nLX =\nne ni Λd3 r,\n0\n\nwhere r200 is the virial radius. For simplicity, assume that\nthe plasma in groups and clusters emits via thermal freefree emission, such that Λ ∝ T 1/2 , and that the temperature\nc 2011 RAS, MNRAS 000, 1–26\n\nwhere Λ0 ∼ 10−23 erg cm3 s−1 is the emissivity at T0 ≈\n107 K, rs = r200 /c is the scale radius, c is the concentration\nparameter, and x = r/rs . The integrated X-ray luminosity is\ndominated by the core radius rc , at which the density profile\ntransitions from being relatively shallow to steep; the X-ray\nluminosity then scales as LX ∝ rc3 T 1/2 n2c , where nc is the gas\nnumber density in the core.\nFor self-similar evolution of baryons following the dark\nmatter (Kaiser 1986) the gas number density is indepen3\ndent of the halo mass; thus, LX ∝ r200\nT 1/2 ∝ T 2 , since\n1/3\n2/3\nr200 ∝ M\nand T ∝ M/r200 ∝ M . However, the assumption of a constant core density irrespective of the halo\nmass is not consistent with our results, especially for low halo\nmasses where cooling is very important. In our calculations,\nthe X-ray emitting plasma in the core of groups and clusters\nhas a lower density for a lower mass halo (e.g., see Fig. 9).\nThis is because tcool /tff >\n∼ 10 irrespective of the halo mass im1/2\nplies that tcool /tff ∝ T /nc ≈ constant for all halo masses,\ni.e., nc ∝ T 1/2 . Assuming for simplicity that the core radius\nfollows the self-similar scaling rc ∝ M 1/3 (which is similar to\nwhat is observed but not likely to be correct in detail) we find\nthat\nLX ∝ n2c T 1/2 rc3 ∝ T 3 ,\nor, more precisely, that the maximum X-ray luminosity at\na given halo mass is ∝ T 3 . This result is tantalizingly similar to that observed, but a more detailed one-dimensional\nmodel (e.g., Voit et al. 2002) is required to quantitatively\ncompare our predictions with observations. Such a model will\nbe presented in the near future (Sharma et al., in prep.).\n5.3\n\nHVCs, TI, & Density of the Galactic Halo\n\nMuch of the gas falling into the Galactic halo is expected to\nvirialize because the halo mass ≈ 1012 M⊙ (e.g., Xue et al.\n2008) is larger than the critical halo mass required to form a\nvirial shock (e.g., Kereš et al. 2009). Local TI, however, can\ngenerate cold gas if the halo density is high enough. Indeed,\nsome fraction of the high velocity clouds (HVCs) of neutral\nHydrogen observed in the Galactic halo may result from local\nTI (e.g., Maller & Bullock 2004).\nFigure 9 shows that for our models of hot halos, a smaller\nhalo mass implies that the size of the density core increases\n(relative to the virial radius) and the core density decreases.\nWe can generalize this result to Galactic halo masses (with\ntemperatures ∼ few × 106 K) in which free-free emission is\nsub-dominant relative to cooling by lines, resulting in an even\nshorter cooling time. Our one-dimensional models of hot halos based on a tTI /tff threshold (Sharma et al., in prep.)\n7\n\nThese assumptions are not strictly correct but do not qualitatively affect our argument.\n\n\f18\n\nP. Sharma, M. McCourt, E. Quataert, I. J. Parrish\n\nshow that the core radius for a Galactic-mass halo is close\nto the virial radius (≈ 100 kpc) and the core density is\nne ∼ 10−4 cm−3 . This is consistent with the currently poor\nconstraints on the properties of the Galactic halo (e.g., Anderson & Bregman 2010).\nGiven these parameters, local TI can produce cold\ngas (e.g., HVCs in the Galactic context) at ∼ 100 kpc, where\nthe ratio tcool /tff is smallest and close to our threshold for\nforming nonlinear structure. Although the gas condenses at\nlarge radii it falls inward because of gravity and may be observed at much smaller radii. Observations in M31, where the\nHVC distances are easier to measure, have found HVCs as far\nout as 50 kpc (and perhaps even farther; Thilker et al. 2004).\nIf the HVCs are in pressure balance with the hot halo their\nemissivity is expected to be smaller at large radii where the\npressures are lower. The distribution of cold gas as a function of radius is difficult to predict with certainty because\nof uncertainties in the destruction of the cold filaments by\nconduction, ram pressure stripping, etc.\nBinney, Nipoti, & Fraternali (2009) argued that the\nGalactic HVCs cannot form due to local TI. As we discuss\nin the Appendix, Binney, Nipoti, & Fraternali (2009)'s arguments are appropriate for homogeneous cooling-flows with\nvery small amplitude density perturbations. For halos in approximate global thermal equilibrium, however, TI can generate multi-phase structure (and thus potentially HVCs) if\ntTI /tff <\n∼ 10. Even cooling-flows can lead to multi-phase gas\nif both tTI /tff is small enough and there are large amplitude\ninitial density perturbations (see Appendix A for details). We\ndiscuss the differences between our results and those of Binney, Nipoti, & Fraternali (2009) in more detail in Paper I.\nAlthough cooling-flow models can, under some circumstances, produce multi-phase structure analogous to HVCs,\nwe have shown that the presence of approximate global thermal equilibrium in hot halos makes the formation of multiphase structure far more generic, e.g., even with very small\ndensity perturbations. This is true even if there are substantial (order unity) fluctuations in heating and cooling about\nthe global equilibrium (see Paper I and section 3.5).\n\n6\n\nSUMMARY\n\nThe primary source of baryons in galaxies is the smooth accretion of intergalactic gas into dark matter halos (as opposed to\nmergers; this is particularly true at the current redshift; e.g.,\nsee Dekel et al. 2009; Kereš et al. 2009). For halo masses\n11.5\n<\nM⊙ (such that the cooling time is <\n∼ 10\n∼ the free-fall\ntime at the virial radius; e.g., Rees & Ostriker 1977) the accreted baryons remain cold inside the virial radius of the halo.\nFor more massive halos, the cooling time at the virial radius\nis longer than the free-fall time and the virial shock creates\npressure-supported hot plasma that fills the dark matter halo.\nThe focus of this paper is on this latter mode of accretion,\nrelevant for clusters, groups, and massive galaxies. Although\nthe cooling time is longer than the free-fall time at the virial\nradius, the cooling time can be significantly shorter than the\n\nHubble-time (and in principle even shorter than the free-fall\ntime) at small radii if the gas density profile were to approximately follow the dark matter halo density profile. Thus,\ncooling has a profound impact on the hot ICM in massive\nhalos.\nIf the cooling time is shorter than the 'age' of a\nhalo (which is approximately the time since the last major\nmerger in a realistic cosmological context), a massive coolingflow will develop absent additional heating. Thus, the observational absence of cooling-flows (e.g., Peterson & Fabian\n2006) and the lack of star formation rates of the order of the\nexpected cooling rates (e.g., Rafferty, McNamara, & Nulsen\n2008) imply that there is an additional heat source roughly\nbalancing cooling in the hot halos of groups and clusters.\nOther proposals such as a uniform preheating (e.g., Tozzi\n& Norman 2001) may be important for systems with high\ncentral entropies and long central cooling times, but cannot\nexplain the presence of long-lived cool-core clusters (e.g., McCarthy et al. 2008).\nWhile there are many potential sources of energy that\ncan maintain approximate thermal equilibrium, the particularly attractive feature of heating by star formation and/or\nan AGN is that it can be globally thermally stable (e.g., see\nGuo et al. 2008 for a specific realization of this): the increasing feedback due to the cooling and inflow of gas provides a thermostat which prevents the ICM core from runaway cooling. In this paper we have addressed a previously\nunder-appreciated aspect of this scenario: even if heating can\nbalance cooling in a globally stable manner, and even if the\nheating can be distributed over the full volume of the ICM (a\ndifficult problem; Vernaleo & Reynolds 2006; Scannapieco &\nBrüggen 2008; Dubois et al. 2010; Gaspari et al. 2011),\nthe cooling of the ICM is very likely to generate local thermal\ninstability (TI).\nWe have addressed a number of key science questions associated with local TI in hot halos. The first is the condition\nunder which local TI in a globally stable ICM produces a\nmulti-phase medium with cold gas co-spatial with the hot\nICM. We find that the criterion for TI to produce multiphase gas in global spherical numerical simulations is that the\nthermal instability growth time tTI satisfy tTI <\n∼ 10 tff (see\nFig. 8 & the left panel of Fig. 1), where tff is the local free-fall\ntime (note that this criterion is derived from global simulations but it applies at each location within a hot halo; see Eqs.\n8-10 for the definition of these timescales). When tTI >\n∼ 10 tff ,\nthe TI leads to density and temperature fluctuations but they\ndo not become nonlinear and so multi-phase gas cannot generically be produced from arbitrary initial conditions.\nIn Paper I, we presented a closely related study of local\nTI in globally stable systems using analytic theory and local\nCartesian simulations. A more comprehensive discussion of\nthe key physics is given there. In the local simulations, the\ncriterion for TI to produce multi-phase gas is that tTI <\n∼ tff\n10\nt\nas\nwe\nfind\nhere).\nThus\nit\nis\neasier\n(rather than tTI <\nff\n∼\nfor cold gas to condense out of the ICM in spherical geometry than in Cartesian geometry. Our interpretation is that\nthis difference is because in spherical geometry a slightly overc 2011 RAS, MNRAS 000, 1–26\n\n\fFeedback Regulation of Hot Halos\ndense fluid element is compressed as it falls; this increases the\ndensity and reduces the cooling time, aiding the development\nof the TI.8 Our criterion for the production of multi-phase\ngas via TI does not depend sensitively on how we implement\nthe uncertain heating of the ICM. We have studied two different models: an 'idealized' heating model in which the heating\nin a given radial shell is equal to the average cooling within\nthat shell (Eq. 6) and a 'feedback' heating model in which\nthe heating is set by the mass accretion rate at the smallest radii (Eq. 7). Both heating models produce similar results\noverall and quantitatively similar criterion for the production\nof multi-phase gas via TI.\nFigure 12 in Paper I shows the observed radial profiles of\ntcool /tff for a number of clusters, some of which show spatially\nextended Hα emission and some of which do not. The transition between clusters with and without this observational\nsignature of intracluster cold gas occurs at tcool /tff ∼ 5 − 10,\nconsistent with our results on the origin of multi-phase gas\nvia TI in the ICM.\nThe formation of multi-phase gas via TI in hot halos\nmakes a number of other predictions about the observed properties of the ICM that are in reasonable agreement with observations. We highlight several of the key ones here. First, the\nnet cooling rate to low temperatures (and the mass accretion\nrate at small radii) for models in global thermal balance is\n102−3 times smaller than for cooling-flow models, consistent\nwith observations (e.g., Peterson et al. 2003; O'Dea et al.\n2008). The net cooling rate is the largest when tTI /tff <\n∼ 10\nand cold gas is condensing out of the hot phase. Even for models with tTI ∼ 10 tff , however, which is typical of cool-core\nclusters, the net cooling rate is a factor of ∼ 100 smaller than\nthe cooling-flow value for that cluster (e.g., Fig. 3). This is a\nnontrivial result that is a consequence of both global thermal\nbalance and the physics of local TI in gravitationally stratified plasmas. A corollary of this result is that in a given halo\nthe observed X-ray emission is produced almost entirely by\ngas within a factor of a few of the virial temperature (Fig. 10).\nThis is consistent with observational results from X-ray spectroscopy (e.g., Peterson et al. 2003; Sanders et al. 2010). Previous authors have searched for heating mechanisms that can\nself-adjust to reproduce this narrow range in temperatures in\na given halo (e.g., Kim, El-Zant, & Kamionkowski 2005). Our\nresults suggest that these observations are instead a natural\nconsequence of the approximate isothermality of halo potentials, together with the physics of local TI for tTI >\n∼ 5 − 10 tff ,\nwhich results in only a very small fraction of the gas at any\ntime cooling to sub-virial temperatures.\nA second key consequence of the formation of multi-phase\ngas via TI is related to how the global thermal balance of hot\nhalos is maintained in the first place. Figure 1 shows that\nthe accretion rate at small radii increases dramatically, by\nup to ∼ 3 orders of magnitude, when tTI <\n∼ 10 tff and cold\n\n19\n\ngas condenses out of the hot ICM. In any model in which\nthe heating of the hot halo is related to this inflow rate (e.g.,\nheating via an AGN or star formation), the heating of the\nICM will increase dramatically if tTI <\n∼ 10 tff . This will in turn\ndrive tTI /tff >\n∼ 10. As a result hot halos will tend to self-adjust\nsuch that min(tTI /tff ) >\n∼ 10. Both our 'idealized' heating and\n'feedback' heating models demonstrate this explicitly (Figs. 8\n& 15). We suggest that this physics is responsible for the\nsignificant fraction of clusters that have central cooling times\n∼ 3×108 yrs (e.g., Cavagnolo et al. 2009), which corresponds\nto a minimum value of tcool ∼ 10 tff in cluster cores (see\nFig. 12 of Paper I).\nThe net heating efficiency required to maintain approximate global thermal equilibrium in clusters is ∼ 1 − 3 ×\n10−3 (we define the efficiency as the heating integrated over\nthe region with a cooling time < 5 Gyr divided by the\nrest mass energy accreted through our inner boundary at\n<\n∼ 1 kpc). This efficiency can plausibly be provided by a central AGN. For lower mass halos, the efficiency required for\nthermal equilibrium is lower. Extrapolating to halo masses\n−5\n∼ 1012 M⊙ , an efficiency of <\n∼ 10 would be more than sufficient for global thermal equilibrium with min(tTI /tff ) >\n∼ 10\n(Sharma et al., in prep.). This is comparable to the efficiency\nof energy injection by core-collapse supernovae, implying that\nsupernovae venting from galactic disks may be sufficient to\nmaintain global thermal equilibrium in halos like that of the\nMilky Way.\nIn this paper we have focused on how cold gas-rich\nfilaments condense out of a hot halo; we have not, however, addressed important questions about the structure and\nstability of the cold gas. High-resolution numerical simulations with magnetic fields and anisotropic thermal conduction are required to study the survival of the filaments as\nthey fall through the hot gas. Arguments based on mixing\ndue to Kelvin-Helmholz instability suggest that once a largeenough (>\n∼ 100 pc) blob cools out of the hot phase it survives\nits passage through the hot medium (e.g., see Murray et al.\n1993; Pizzolato & Soker 2005). Magnetic fields further stabilize the cold blobs against mixing so we expect the cold\nfilaments to survive as they fall toward the center, as is observed in many cases.\nIn section 5 we briefly summarized the implications of\nour results for other problems related to the astrophysics of\nhot halos, specifically the relative importance of hot and cold\ngas for AGN fueling in clusters (5.1), the non self-similarity of\nthe relationship between X-ray luminosity and temperature\nfor groups and clusters (5.2), and the possible origin of high\nvelocity clouds of neutral Hydrogen in the local group via TI\nin hot halos (5.3). These applications will all be studied in\nmore detail in future work.\n\nACKNOWLEDGMENTS\n8\n\nIn addition to spherical compression, the background entropy\nstratification (e.g., Paper I) and the size distribution of cool\n'blobs' (e.g., Pizzolato & Soker 2005) may also affect the formation\nof cold filaments.\nc 2011 RAS, MNRAS 000, 1–26\n\nWe thank Dušan Kereš, Leo Blitz, and Arif Babul for useful discussions. Support for P. S. was provided by NASA\nthrough Chandra Postdoctoral Fellowship grant PF8-90054\n\n\f20\n\nP. Sharma, M. McCourt, E. Quataert, I. J. Parrish\n\nawarded by the Chandra X-Ray Center, which is operated by\nthe Smithsonian Astrophysical Observatory for NASA under\ncontract NAS8-03060. M. M., I. P. and E. Q. were supported\nin part by NASA Grant NNX10AC95G, NSF-DOE Grant\nPHY-0812811, and the David and Lucile Packard Foundation. Computing time was provided by the National Science\nFoundation through the Teragrid resources located at Purdue\nUniversity and NCSA. Some of the runs were carried out on\nHenyey, the theoretical astrophysics computing cluster at UC\nBerkeley supported by NSF AST Grant 0905801. We are also\nthankful for the hospitality of the Kavli Institute for Theoretical Physics (KITP) at UC Santa Barbara, where part of\nthis work was performed.\n\nREFERENCES\nAllen, S. W. et al. 2006, MNRAS, 372, 21\nAnderson, M. E. & Bregman, J. N. 2010, ApJ, 714, 320\nBalbus, S. A. & Soker, N. 1989, ApJ, 341, 611\nBinney, J., Nipoti, C., & Fraternali, F. 2009, MNRAS, 397,\n1804\nBirnboim, Y. & Dekel, A. 2003, MNRAS, 245, 349\nBı̂rzan, L. et al. 2004, ApJ, 607, 800\nBower, R. G. 2006, MNRAS, 370, 645\nBryan, G. 2000, ApJL, 544, L1\nCavagnolo, K. W. et al. 2008, ApJL, L107\nCavagnolo, K. W. et al., 2009, ApJS, 182, 12\nCiotti, L. & Ostriker, J. P. 1997, ApJL, 487, L105\nCroton, D. J. et al. 2006, MNRAS, 365, 11\nDekel, A. & Birnboim, Y. 2008, MNRAS, 383, 119\nDekel, A. et al. 2009, Nature, 2009, 457, 451\nDubois, Y., Devriendt, J., Slyz, A., & Teyssier, R. 2010,\nMNRAS, 409, 985\nEvrard, A. E. & Henry, J. P. 1991, ApJ, 383, 95\nFabian, A. C. 1994, Ann. Rev. Astr. Astr., 32, 277\nFerland, G. J. et al. 2009, MNRAS, 392, 1475\nField, G. B. 1965, ApJ, 142, 531\nGaspari, M., Melioli, C., Brighenti, F., & D'Ercole, A. D.\n2011, MNRAS, 411, 349\nGuo, F., Peng Oh, S., & Ruszkowski, M. 2008, ApJ, 688, 859\nHayes, J. et al. 2006, ApJ, 165, 188\nHeckman, T. M., Baum, S. A., van Breugel, W. J. M., &\nMcCarthy, P. 1989, ApJ, 338, 44\nHicks, A. K., Mushotzky, R., & Donahue, M. 2010, ApJ, 719,\n1844\nHoyle, F. 1953, ApJ, 118, 513\nHu, E. M., Cowie, L. L., & Wang, Z. 1985, ApJS, 59, 447\nJohnstone, R. M., Allen, S. W., Fabian, A. C., & Sanders,\nJ. S. 2002, MNRAS, 336, 299\nKaiser, N. 1986, MNRAS, 1986, 222, 323\nKaufmann, T. et al. 2009, MNRAS, 396, 191\nKereš, D., Katz, N., Weinberg, D. H., & Davé, R. 2005,\nMNRAS, 363, 2\nKereš, D., Katz, N., Fardal, M., Davé, & Weinberg, D. H.,\n& Davé, R. 2009, MNRAS, 395, 160\n\nKim, W., El-Zant, A., & Kamionkowski, M. 2005, ApJ, 632,\n157\nKim, W. & Narayan, R. 2003, ApJ, 596, 889\nMaller, A. H. & Bullock, J. S. 2004, MNRAS, 355, 694\nMcCarthy, I. G., Babul, A., Bower, R. G., & Balogh, M. L.\n2008, MNRAS, 386, 1309\nMcCourt, M., Sharma, P., Quataert, E., & Parrish, I. J.\n2011, arXiv:1105.2563 (Paper I)\nMcDonald, M., Veilleux, S., Rupke, D. S. N., & Mushotzky,\nR. 2010, ApJ, 721, 1262\nMcDonald, M., Veilleux, S., Rupke, D. S. N., Mushotzky, R.,\n& Reynolds, C. S. 2011, ApJ, 734, 95\nMcKee, C. F. & Ostriker, J. P. 1977, ApJ, 218, 148\nMolendi, S. & Pizzolato, F. 2001, ApJ, 560, 194\nMurray, S. D., White, S. D. M., Blondin, J. M., & Lin, D.\nN. C. 1993, ApJ, 407, 588\nNarayan, R., & Fabian, A. C. 2011, arXiv:1105.0594\nNavarro, J. F., Frenk, C. S., & White, S. D. M. 1997, ApJ,\n490, 493\nNulsen, P. E. J. 1985, MNRAS, 221, 377\nO'Dea, C. P. et al. 2008, ApJ, 681, 1035\nParrish, I. J., Quataert, E., & Sharma, P. 2009, ApJ, 703,\n96\nPeek, J. E. G., Putman, M. E., & Sommer-Larsen, J. 2008,\n674, 227\nPeterson, J. R. et al. 2003, ApJ, 590, 207\nPeterson, J. R. & Fabian, A. C. 2006, Phys. Rep., 427, 1\nPizzolato, F. & Soker, N. 2005, ApJ, 632, 821\nPonman, T. J., Cannon, D. B., & Navarro, J. F. 1999, Nature, 397, 135\nPratt, G. W. et al. 2010, A&A, 511, A85\nRafferty, D. A., McNamara, B. R., & Nulsen, P. E. J. 2008,\nApJ, 687, 899\nRees, M. J. & Ostriker, J. P. 1977, MNRAS, 179, 541\nSanders, J. S., Fabian, A. C., Frank, K. A., Peterson, J. R.,\n& Russell, H. R. 2010, MNRAS, 402, 127\nScannapieco, E. & Brüggen, M. 2008, ApJ, 686, 927\nSharma, P., Chandran, B. D. G., Quataert, E., & Parrish, I.\nJ. 2009, ApJ, 699, 348\nSharma, P., Parrish, I. J., & Quataert, E. 2010, ApJ, 720,\n652\nSoker, N. & David, L. P. 2003, ApJ, 589, 770\nSommer-Larsen, J. 2006, ApJL, 644, L1\nStone, J. M. & Norman, M. L. 1992, ApJS, 80, 753\nSun, M. 2009, ApJ, 704, 1586\nSun, M. et al. 2009, ApJ, 693, 1142\nSutherland, R. S. & Dopita, M. A. 1993, ApJS, 88, 253\nTamura, T. et al. 2001, å, 365, L87\nThilker, D. A. et al. 2004, ApJL, 601, L39\nTozzi, P. & Norman, C. 2001, ApJ, 546, 63\nVernaleo, J. C. & Reynolds, C. S. 2006, ApJ, 645, 83\nVoit, G. M., Bryan, G. L., Balogh, M. L., & Bower, R. G.\n2002, ApJ, 576, 601\nWakker, B. P. & van Woerden, H. 1997, Ann. Rev. Astr.\nAstr., 1997, 35, 217\nWerner, N. et al. 2010, MNRAS, 407, 2063\nWhite, S. D. M. & Rees, M. J. 1978, MNRAS, 183, 341\nc 2011 RAS, MNRAS 000, 1–26\n\n\fFeedback Regulation of Hot Halos\nXue, X. X. et al. 2008, ApJ, 684, 1143\nZakamska, N. L. & Narayan, R. 2003, ApJ, 582, 162\n\nc 2011 RAS, MNRAS 000, 1–26\n\n21\n\n\f22\n\nP. Sharma, M. McCourt, E. Quataert, I. J. Parrish\n\nTable 1. Runs with Idealized Heating\nLabel†\nMC1\nMC10\nMC30\nMC100\nMC300\nC1\nC10⋆\nC30\nC100\nC300\nMG1\nMG10\nMG30\nMG100\nMG300\nG5\nG50\nG75\nG150\nG300\n\nK0∗\n1.91\n19.1\n57.2\n190.6\n571.8\n1\n10\n30\n100\n300\n0.5\n5.3\n15.7\n52.5\n157.4\n1.1\n10.8\n16.2\n32.3\n64.6\n\n∗\nK100\n\n209.7\n209.7\n209.7\n285.9\n152.5\n110\n110\n110\n150\n80\n57.7\n57.7\n57.7\n78.7\n42\n23.7\n23.7\n23.7\n17.2\n17.2\n\nα∗\n1.4\n1.4\n1.4\n0.8\n0.8\n1.4\n1.4\n1.4\n0.8\n0.8\n1.4\n1.4\n1.4\n0.8\n0.8\n1.4\n1.4\n1.4\n0.8\n0.8\n\ntTI /t‡ff\n2.9 (2.3)\n32.5 (12.5)\n111.4 (32.5)\n477 (128.5)\n1495 (191)\n1.6 (1.4)\n20.2 (8.2)\n71 (21.6)\n314.4 (85)\n1001 (126.4)\n0.52 (0.46)\n9.9 (3.8)\n37.1 (10.7)\n169.1 (45.8)\n557.4 (68.7)\n1.8 (0.9)\n39.7 (10.4)\n65.8 (16.2)\n158.6 (26.4)\n350.3 (42.3)\n\n††\nṀ>0.1\n\n7.3 (70.3)\n2.6 (41.4)\n0.8 (21.1)\n0.3 (0.4)\n0.2 (0.5)\n2.8 (13.7)\n1.2 (11.4)\n0.4 (7.7)\n0.1 (0.3)\n0.1 (0.2)\n0.4 (2.7)\n0.3 (2.4)\n0.2 (1.9)\n0.04 (0.6)\n0.02 (0.02)\n0.07 (0.5)\n0.05 (0.4)\n0.03 (0.13)\n0.01 (0.12)\n0.006 (0.05)\n\n††\nṀ0.01−0.1\n\n0.02 (1)\n0 (0.5)\n0 (1.2)\n0 (0)\n0 (0)\n0.03 (3.7)\n0.003 (3.04)\n0 (1.2)\n0 (0)\n0 (0)\n0.02 (0.3)\n0.02 (0.2)\n0 (0.1)\n0 (0.02)\n0 (0)\n0.004 (0.07)\n0.003 (0.05)\n0 (0.4)\n0 (0.2)\n0 (0.04)\n\n††\nṀ<0.01\n\n12.5 (470.6)\n0 (348.3)\n0 (169)\n0 (0)\n0 (0)\n9.1 (285.6)\n2.3 (230.3)\n0 (144.6)\n0 (0)\n0 (0)\n16.2 (130.4)\n4.7 (113.9)\n0 (89.5)\n0 (27.4)\n0 (0)\n8.6 (73.7)\n2.3 (48.9)\n0 (40.9)\n0 (41.6)\n0 (3.9)\n\n1012\n\n††\nM<0.01\n\n††\nM0.01−0.1\n\n††\nM>0.1\n\n1012 )\n\n9.4 ×\n(9 ×\n8.8 × 1012 (8.9 × 1012 )\n8 × 1012 (8.4 × 109 )\n6 × 1012 (6.3 × 1012 )\n5.1 × 1012 (5.2 × 1012 )\n3.5 × 1012 (3.4 × 1012 )\n3.3 ×1012 (3.3 × 1012 )\n3×1012 (3.2 × 1012 )\n2.3×1012 (2.5 × 1012 )\n2 × 1012 (2 × 1012 )\n8.9 ×1011 (8.6 × 1011 )\n8.6 × 1011 (8.4 × 1011 )\n7.9 × 1011 (8.2 × 1011 )\n6 × 1011 (7.3 × 1011 )\n5.2 × 1011 (5.9 × 1011 )\n3.2 × 1011 (3.1 × 1011 )\n2.7 × 1011 (3 × 1011 )\n2.6 × 1011 (2.9 × 1011 )\n2.3 × 1011 (2.9 × 1011 )\n2 × 1011 (2.3 × 1011 )\n\n106\n\n107 )\n\n4.3 ×\n(3.8 ×\n0 (3.5 × 107 )\n0 (1.5 × 108 )\n0 (0)\n0 (0)\n4.3 × 106 (4.3 × 108 )\n2.6 × 106 (3.6 × 108 )\n0 (2.5 × 108 )\n0 (0)\n0 (0)\n3.9 × 107 (3.2 × 107 )\n2 × 107 (2.8 × 107 )\n0 (2.2 × 107 )\n0 (1.7 × 107 )\n0 (0)\n2 × 107 (3.8 × 107 )\n1.2 × 107 (2.3 × 107 )\n0 (1.1 × 109 )\n0 (9.7 × 108 )\n0 (6 × 107 )\n\n108\n\nǫ‡‡ = Q+ /Ṁ c2\n109 )\n\n4.3 ×\n(8.1 ×\n0 (6.7 × 109 )\n0 (4 × 109 )\n0 (0)\n0 (0)\n3.5 × 108 (5.6 × 109 )\n1.3 × 108 (4.9 × 109 )\n0 (4 × 109 )\n0 (0)\n0 (0)\n1.3 × 109 (3.3 × 109 )\n2.91 × 108 (2.9 × 109 )\n0 (2.4 × 109 )\n0 (1.4 × 109 )\n0 (0)\n8.8 × 108 (2.5 × 109 )\n2 × 108 (1.6 × 109 )\n0 (1.3 × 109 )\n0 (1.5 × 109 )\n0 (7.8 × 107 )\n\n8.2 × 10−4\n3.7 × 10−3\n4.3 × 10−3\n0\n0\n4.5 × 10−4\n10−3\n5 × 10−3\n5.4 × 10−5\n0\n7 × 10−5\n1.8 × 10−4\n3.2 × 10−3\n1.2 × 10−3\n0\n4 × 10−5\n7.4 × 10−5\n4.7 × 10−3\n5.3 × 10−3\n1.5 × 10−4\n\n⋆ C10 is the fiducial run.\n2/3\n∗ The entropy K (TkeV /ne ) is initialized via Eq. 5.\n† C1 is the label for a cluster (M0 = 3.8 × 1014 M⊙ ) with K0 = 1 keV cm2 . MC1 stands for a massive cluster with M0 = 1015 M⊙ and\n2/3\na core entropy K0 scaled according to self-similarity, K ∝ M0 , from the cluster model with K0 = 1 keV cm2 . MG stands for a massive\ngroup with M0 = 1014 M⊙ and G stands for a group with M0 = 3.8 × 1013 M⊙ . Initial conditions for all halo masses are scaled with M0\naccording to self-similarity. Self-similarity is broken with time because of cooling and feedback.\n‡ initial value of the ratio tTI /tff evaluated at the inner boundary (value in the parenthesis is the minimum value over all radii). tff at the\ninner boundary is ≈ 0.014 Gyr for all cases.\n†† Ṁ>0.1 represents the average (over the whole run for 5 Gyr) mass accretion rate (in M⊙ yr−1 ) through the inner boundary for plasma\nwith T > 0.1 keV, Ṁ0.01−0.1 for 0.01 keV < T < 0.1 keV, and Ṁ<0.01 for T < 0.01 keV. Values in parentheses correspond to 'cooling-flow'\nmodels with no external heating. Similarly, M>0.1 is the gas mass (in M⊙ ) in the hot phase, and likewise for M0.01−0.1 and M<0.01 ; values\nin parentheses correspond to cooling-flow models.\n‡‡ ǫ represents the time-averaged efficiency required\nto balance cooling: ǫ ≡ Q+ /Ṁ c2 , where Ṁ is the time-averaged total mass accretion\nR\nrate through the inner boundary, and Q+ = ne ni Λ(T )dV and the integral is over all radii where the angle-averaged cooling time is\n< 5 Gyr.\n\nc 2011 RAS, MNRAS 000, 1–26\n\n\fFeedback Regulation of Hot Halos\n\n23\n\nTable 2. Additional Cluster Runs\n\nLabel†\n\nNr × Nθ × Nφ\n\nṀ>0.1\n\nṀ0.01−0.1\n\nṀ<0.01\n\nM>0.1\n\nM0.01−0.1\n\nM<0.01\n\nǫ = Q+ /Ṁ c2\n\nC10-p1\nC10-p10\nC10-nz1\nC10-nz4\nC10-nz8\nC10-nz16\nC10-3D\nC10-hlf\nC10\nC10-dbl\nC30-p1\nC30-p10\nC30-3D\nC30-hlf\nC30\nC30-dbl\n\n512 × 256 × 1\n512 × 256 × 1\n512 × 256 × 1\n512 × 256 × 1\n512 × 256 × 1\n512 × 256 × 1\n256 × 128 × 32\n256 × 128 × 1\n512 × 256 × 1\n1024 × 512 × 1\n512 × 256 × 1\n512 × 256 × 1\n256 × 128 × 32\n256 × 128 × 1\n512 × 256 × 1\n1024 × 512 × 1\n\n1.1\n1.7\n0.3\n1.1\n1.3\n1.4\n0.77\n1.3\n1.2\n1.4\n0.38\n0.58\n0.24\n0.28\n0.4\n0.36\n\n0.01\n0.001\n0.0009\n0.004\n0.02\n0.001\n0.018\n0.004\n0.003\n0.002\n0\n0\n0\n0\n0\n0\n\n1.7\n0.24\n0.089\n2.6\n2.5\n0.44\n0.95\n1.1\n2.3\n0.85\n0\n0\n0\n0\n0\n0\n\n3.3 × 1012\n3.3 × 1012\n4.2 × 1011\n2.7 × 1012\n3.1 × 1012\n3.3 × 1012\n3.5 × 1012\n3.5 × 1012\n3.3 ×1012\n2.6 × 1012\n3 × 1012\n2.9 × 1012\n3.2 ×1012\n3.2 ×1012\n3×1012\n3 × 1012\n\n1.7 × 106\n3.5 × 104\n6.1 × 103\n2.9 × 106\n2.6 × 106\n1.3 × 105\n9.1 × 105\n4.8 × 105\n2.6 × 106\n5.4 × 105\n0\n0\n0\n0\n0\n0\n\n6.2 × 107\n4.8 × 106\n1.1 × 106\n1.9 × 108\n108\n1.2 × 107\n1.6 × 108\n3.5 × 107\n1.3 × 108\n2.6 × 107\n0\n0\n0\n0\n0\n0\n\n1.3 × 10−3\n2 × 10−3\n3.8 × 10−4\n4.1 × 10−4\n7.1 × 10−4\n2 × 10−3\n2.4 × 10−3\n3 × 10−3\n10−3\n7 × 10−4\n4.9 × 10−3\n2.8 × 10−3\n8.6 × 10−3\n7.6 × 10−3\n5 × 10−3\n1.5 × 10−3\n\n†C10-p10 is a cluster run with random perturbations ≈ 10 (drawn from a uniform distribution) in the heating rate on top of the balance\nof cooling and heating in each shell; the random perturbations are changed every 100 Myr. C10-nz4 corresponds to a run where the\nbalance of heating and cooling is applied over 4 logarithmically spaced radial zones (i.e., H/r = 1/4, where H is the scale over which\nheating is applied uniformly). C10-3D is a three-dimensional run with the same parameters as the fiducial run C10. C10-dbl (C10-hlf) has\ndouble (half) the fiducial resolution. All remaining quantities are defined in the same way as Table 1.\n\nTable 3. Cluster and Group Runs with Feedback Heating\n\nLabel†\n\nǫfb\n\nṀ>0.1\n\nṀ0.01−0.1\n\nṀ<0.01\n\nM>0.1\n\nM0.01−0.1\n\nM<0.01\n\nǫ = Q+ /Ṁ c2\n\nC10-fb-7em3\nC10-fb-4em3\nC10-fb-2em3\nC10-fb-7em4\nG50-fb-4em3\nG50-fb-2em3\nG50-fb-7em4\nG50-fb-7em5\n\n7 × 10−3\n4 × 10−3\n2 × 10−3\n7 × 10−4\n4 × 10−3\n2 × 10−3\n7 × 10−4\n7 × 10−5\n\n0.15\n0.46\n0.77\n1.67\n0.022\n0.029\n0.026\n0.051\n\n0.0017\n0.006\n0.0055\n0.019\n0.00042\n0.00041\n0.00046\n0.0058\n\n0.6\n2.74\n2.34\n4.9\n0.079\n0.19\n0.22\n3.23\n\n2.84 × 1012\n2.74 × 1012\n3.18 × 1012\n3.22 × 1012\n1.8 × 1011\n1.76 × 1011\n2.54 × 1011\n2.99 × 1011\n\n8.28 × 104\n2.02 × 106\n1.17 × 106\n3.5 × 106\n1.88 × 105\n1.25 × 105\n4.3 × 105\n7.83 × 106\n\n1.07 × 107\n1.3 × 108\n1.05 × 108\n2 × 108\n5.79 × 106\n7.24 × 106\n1.09 × 107\n2.18 × 108\n\n1.4 × 10−3\n5.8 × 10−4\n7.2 × 10−4\n3.7 × 10−4\n2.9 × 10−4\n1.1 × 10−4\n5.3 × 10−4\n7.5 × 10−5\n\n†C10-fb-7em3 stands for a run with the same initial profile as C10 (the fiducial run) but using a feedback heating model with ǫfb =\n7 × 10−3 (see Eq. 7). The group runs (with the same initial conditions as G50) with feedback heating are also included. All remaining\nquantities are defined in the same way as Table 1.\n\nc 2011 RAS, MNRAS 000, 1–26\n\n\f24\n\nP. Sharma, M. McCourt, E. Quataert, I. J. Parrish\n\nAPPENDIX A: INHOMOGENEOUS COOLING\nFLOWS\nIn this Appendix we discuss the nature of hot halos in the\nabsence of external heating-in this case the halo plasma settles into a cooling-flow. We consider both steady homogeneous\ncooling-flows and cooling-flows with large initial density perturbations that can develop multi-phase structure. Although\nobservations imply that hot, virialized halos are in approximate thermal equilibrium, the results in this Appendix are\nuseful for comparison to other results in the literature and for\ncomparison to the simulations with heating described in the\nmain text.\n\nA1\n\nSteady Homogeneous Cooling Flows\n\nIn a steady (∂/∂t = 0) cooling-flow the equations of conservation of mass, momentum, and energy can be expressed as\n4πr 2 ρv = Ṁ ,\n1 d ln v\n1 d ln p\n2\n− 2\n= 2\n+ 2,\ntin d ln r\ntsnd d ln r\ntff\n1 d ln (p/ργ )\n1\n=\n,\ntin\nd ln r\ntcool\n\n(A1)\n(A2)\n(A3)\n\nwhere v (> 0) is the radial infall velocity, Ṁ is the steady mass\ninflow rate, tin ≡ r/v is the infall time, tsnd ≡ r/(p/ρ)1/2\nis the isothermal sound-crossing time, tff is the free-fall\ntime (Eq. 10), and tcool is the cooling time (Eq. 9). We use\nEqs. A1-A3 to interpret our cooling-flow results discussed\nshortly.\nFor our homogeneous cooling-flow simulations we start\nwith an initial hydrostatic profile identical to the fiducial simulation described in the main text (C10), but without density/temperature perturbations. As in our simulations with\nheating, we use cosmologically realistic inflow boundary conditions. Since the cooling time is the shortest at the center (but tcool ≫ tsnd ∼ tff in the initial state), gas starts\nto cool and flow in subsonically (eq A3). The left panel of\nFigure A1 shows the key timescales in the resulting steady\ncooling-flow. As the gas cools and flows in to small radii, the\ncooling time becomes less than the free-fall time at r <\n∼ 5 kpc.\nThe gas then abruptly cools to low temperatures and the inflow becomes supersonic; this corresponds to the rapid increase (decrease) in the sound-crossing (cooling) time in the\nleft panel of Figure A1 at ∼ 1.5 kpc. For a given gravitational\npotential, the radius at which the steady cooling-flow becomes\nsupersonic is determined primarily by the density at the outer\nboundary; for a larger density at large radii the sonic radius\nmoves out, while for a lower density at large radii, the sonic\nradius decreases and the flow may never become supersonic.\n\nA2\n\nMultiphase Gas in a Cooling Flow\n\nSmall amplitude density perturbations do not grow significantly via thermal instability in a cooling-flow because the\nperturbations are advected inwards on the same timescale\n\nthat the thermal instability would nominally develop (Balbus & Soker 1989). This is a critical difference between\ncooling-flows and the plasmas in approximate global thermal\nequilibrium considered in the main text. One implication of\nthis result is that cooling-flows with small amplitude density\nperturbations cannot, in general, develop multi-phase structure. With sufficiently large density perturbations, however,\na cooling-flow can produce multi-phase gas (e.g., Pizzolato &\nSoker 2005). The resulting structure is very different from\nthe homogeneous cooling-flows described in the previous section. A rough criterion for whether a cooling-flow becomes\nmulti-phase can be derived as follows. Multiphase gas will\nresult if the effective cooling rate of an overdense blob (the\ncooling rate of the blob minus the cooling rate of the background cooling-flow) is larger than the effective free-fall rate.\nThe effective free-fall rate is\n\u0012\n\u00131/2\n1\nδ\n1\n∼\n,\n(A4)\ntff,eff\n1+δ\ntff\nwhere δ ≡ |δρ/ρ| ∼ |δT /T | is the overdensity of the blob\nrelative to the ambient density. The effective cooling rate of\nan overdense blob is\n1\n1\n1\n=\n−\n,\n(A5)\ntcool,eff\ntcool,b\ntcool,a\nwhere tcool,b is the cooling rate of the blob and tcool,a is the\ncooling rate of the ambient medium. For small overdensities,\nand in the isobaric limit, the effective cooling rate can be\nsimplified to\n\u0013\n\u0012\n∂\n5 δ\n−1\n1\n,\n∼δ\n∼\ntcool,eff\n∂ ln T tcool p\n3 tTI\nwhere tTI is the isobaric TI timescale given by Eq. 8. The\neffective free-fall rate for small overdensities is 1/tff,eff ∼\nδ 1/2 /tff , so that a cooling flow can become multi-phase if\n5 1/2\ntTI <\n∼ 3 δ tff\n\n(A6)\n\n(again assuming δ <\n∼ 1). Note also that a cooling-flow can\nbecome multi-phase only if the cooling curve is thermally unstable in the isobaric regime; i.e., if d ln Λ/d ln T < 2; when\nthis condition is not met, the slightly overdense blobs are\nheated relative to the background and hence cannot become\ndenser/cooler.\nThe right panel of Figure A1 shows the angle averaged\ntimescales in the quasi-steady state for a cooling-flow simulation with density perturbations identical to the fiducial\nrun (δmax ≈ 0.3); these timescales are calculated using the\nproperties of the hot plasma only (T > 0.1 keV). The sound\ncrossing time for the hot plasma is <\n∼ the free-fall time at all\nradii, implying that the hot plasma is in approximate hydrostatic equilibrium at all radii. Within r <\n∼ 7 kpc, however, the\ncooling time in the hot plasma, which is of order the infall\ntime (see Eq. A3), is also of order the free-fall time. While\nthe conservation laws of momentum and energy (eqs. A2 &\nA3) are roughly valid when applied solely to the hot phase,\nthe mass conservation equation (Eq. A1) is not. Specifically,\nmass is not conserved for the hot plasma within r <\n∼ 7 kpc\nc 2011 RAS, MNRAS 000, 1–26\n\n\fFeedback Regulation of Hot Halos\n\n25\n\nFigure A1. Key timescales in a steady homogeneous cooling-flow (left panel) and a quasi-steady multi-phase cooling-flow with large density\nperturbations (right panel; see eqs. A1-A3 for the precise definition of the different timescales). Only the plasma in the hot (T > 0.1 keV)\nphase has been used to calculate the relevant timescales for the multi-phase cooling-flow simulation. In the right panel the sound crossing\ntime (tsnd ) and the infall time (tin ) are only shown for our fiducial density perturbations (δmax = 0.3).\n\nbecause mass \"drops out\" via thermal instability to the cold\nphase: the mass accretion rate in the hot plasma thus decreases with a decreasing radius for r <\n∼ 7 kpc. This is shown\nexplicitly in Figure A2 which shows the average mass accretion rate in the hot phase (T > 0.1 keV) as a function of\nradius for the cooling-flow simulations with different initial\ndensity perturbations.\nThe right panel of Figure A1 also shows the cooling\ntimescale in the hot plasma in the quasi-steady state for the\ncooling flow simulations initialized with density perturbations\n3 times bigger (δmax = 1) and 10 times smaller (δmax = 0.03)\nthan our fiducial case. The ratio of the cooling time to the\nfree-fall time at the radius where the cooling-flow becomes\nmulti-phase increases with larger density perturbations and\nthe multi-phase cooling flow sets in at larger radii (see Eq.\nA6).\nFigure A3 shows the electron number density in the inner 10 kpc for the quasi-steady state of cooling-flow simulations with different initial density perturbations. Figure A3\nshows the qualitative difference between a cooling-flow with\nand without significant initial density perturbations: coolingflows without significant density perturbations do not show\ndense multi-phase gas (consistent with the analytic arguments\nof Balbus & Soker 1989); instead, the plasma just monolithically cools to low temperatures at radii where the cooling time\nis less than the free-fall time (see Fig. A1). Figure A3 also\nvisually demonstrates that the multi-phase structure that develops in cooling-flows with large initial density perturbations\ndepends strongly on the magnitude of the density perturbations: the models with larger density perturbations develop\nmore pronounced multi-phase structure out to larger radii.\nThis is a critical difference between cooling-flow models and\nmodels in which the plasma in hot halos is in approximate\nglobal thermal equilibrium. In the latter, the thermal instac 2011 RAS, MNRAS 000, 1–26\n\nFigure A2. Mass accretion rate in the hot phase (T > 0.1 keV) as\na function of radius averaged from 4 to 5 Gyr. The total accretion\nrate is relatively independent of both radius and the magnitude\nof the density perturbations (parameterized by δmax ; see Fig A1).\nHowever, the mass accretion rate in the hot phase decreases at\nsmall radii by an amount that depends on the amplitude of the\ndensity perturbations: larger density perturbations imply more gas\ncooling to low temperatures and thus a lower mass accretion rate\nin the hot phase.\n\nbility grows exponentially and the multi-phase structure that\ndevelops is essentially independent of the initial density perturbations. Thus the development of multi-phase structure\nis far more generic and robust if the virialized plasma is in\napproximate global thermal equilibrium.\nCooling-flow simulations are quite sensitive to the bound-\n\n\f26\n\nP. Sharma, M. McCourt, E. Quataert, I. J. Parrish\nδ\n\nδ\n\n=0\n\nmax\n\nδ\n\n=0.03\n\nδ\n\n=0.3\n\nmax\n\nmax\n\n=1\n\nmax\n\nLog n\n10 e\n1\n\n10\n\nz(kpc)\n\n5\n\n0.5\n0\n\n0\n−0.5\n−5\n\n−1\n−1.5\n\n−10\n0\n\n5\nx(kpc)\n\n10\n\n5\nx(kpc)\n\n10\n\n5\nx(kpc)\n\n10\n\n5\nx(kpc)\n\n10\n\nFigure A3. Snapshots of the electron number density in the inner\n10 kpc for the cooling-flow simulations with different fractional\ndensity perturbations δ ≡ |δρ/ρ|. The simulations are initialized\nwith a distribution of δ identical to our fiducial run but rescaled\nsuch that δ < δmax . This Figure demonstrates that a cooling-flow\nbecomes multi-phase only when the cooling time is short and the\ndensity perturbations are sufficiently large (see Eq. A6). The color\nscale for the electron density goes from 10−1.75 to 10 cm−3 but\nthe cold (∼ 104 K) gas in δ 6= 0 simulations is actually much\ndenser (∼ 100 − 1000 cm−3 ).\n\nary condition at the outer radius because the free-fall time at\nthe outer boundary is shorter than the Hubble time. A cosmologically realistic boundary condition should allow mass\ninflow at the outer boundary. Cooling-flow simulations which\ndo not allow inflow, e.g., the isolated halo simulations of Kaufmann et al. (2009), evolve qualitatively differently from simulations with inflow such as ours. Without mass supply at\nthe outer boundary all the gas with cooling time shorter than\nthe age cools and accumulates at the center. Multiphase gas\nin such simulations occurs only for a short time comparable\nto the cooling time. In contrast, our cooling-flow simulations\nwhich allow inflow at the outer boundary reach a quasi-steady\nstate with multiphase gas if density perturbations are large\nenough.\n\nc 2011 RAS, MNRAS 000, 1–26\n\n\f"}