{"id": "http://arxiv.org/abs/0705.2405v2", "guidislink": true, "updated": "2007-10-10T10:21:14Z", "updated_parsed": [2007, 10, 10, 10, 21, 14, 2, 283, 0], "published": "2007-05-16T18:02:03Z", "published_parsed": [2007, 5, 16, 18, 2, 3, 2, 136, 0], "title": "Qubit-portraits of qudit states and quantum correlations", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0705.1003%2C0705.4355%2C0705.3063%2C0705.1909%2C0705.3137%2C0705.0536%2C0705.2186%2C0705.2996%2C0705.2172%2C0705.3428%2C0705.4002%2C0705.0082%2C0705.0021%2C0705.2734%2C0705.3519%2C0705.3420%2C0705.1707%2C0705.2297%2C0705.2376%2C0705.1245%2C0705.2278%2C0705.2006%2C0705.0202%2C0705.0618%2C0705.2070%2C0705.4439%2C0705.0541%2C0705.3697%2C0705.2744%2C0705.0278%2C0705.3296%2C0705.0105%2C0705.0729%2C0705.3316%2C0705.0765%2C0705.0750%2C0705.3875%2C0705.3342%2C0705.3456%2C0705.0902%2C0705.0981%2C0705.4553%2C0705.2403%2C0705.1638%2C0705.3030%2C0705.1183%2C0705.3405%2C0705.0540%2C0705.2794%2C0705.3974%2C0705.1486%2C0705.1368%2C0705.2342%2C0705.1095%2C0705.2114%2C0705.2475%2C0705.2305%2C0705.1570%2C0705.1810%2C0705.1477%2C0705.1792%2C0705.3508%2C0705.1880%2C0705.0643%2C0705.3313%2C0705.4235%2C0705.0490%2C0705.2916%2C0705.3207%2C0705.0813%2C0705.3174%2C0705.1955%2C0705.3999%2C0705.0832%2C0705.4174%2C0705.1099%2C0705.1251%2C0705.2595%2C0705.0510%2C0705.4448%2C0705.4678%2C0705.0181%2C0705.1646%2C0705.0429%2C0705.2673%2C0705.3418%2C0705.1746%2C0705.0862%2C0705.4370%2C0705.2405%2C0705.0936%2C0705.1458%2C0705.2210%2C0705.3154%2C0705.1176%2C0705.0709%2C0705.3986%2C0705.2967%2C0705.3566%2C0705.0941%2C0705.2614&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Qubit-portraits of qudit states and quantum correlations"}, "summary": "The machinery of qubit-portraits of qudit states, recently presented, is\nconsider here in more details in order to characterize the presence of quantum\ncorrelations in bipartite qudit states. In the tomographic representation of\nquantum mechanics, Bell-like inequalities are interpreted as peculiar\nproperties of a family of classical joint probability distributions which\ndescribe the quantum state of two qudits. By means of the qubit-portraits\nmachinery a semigroup of stochastic matrices can be associated to a given\nquantum state. The violation of the CHSH inequalities is discussed in this\nframework with some examples, we found that quantum correlations in qutrit\nisotropic states can be detected by the suggested method while it cannot in the\ncase of qutrit Werner states.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0705.1003%2C0705.4355%2C0705.3063%2C0705.1909%2C0705.3137%2C0705.0536%2C0705.2186%2C0705.2996%2C0705.2172%2C0705.3428%2C0705.4002%2C0705.0082%2C0705.0021%2C0705.2734%2C0705.3519%2C0705.3420%2C0705.1707%2C0705.2297%2C0705.2376%2C0705.1245%2C0705.2278%2C0705.2006%2C0705.0202%2C0705.0618%2C0705.2070%2C0705.4439%2C0705.0541%2C0705.3697%2C0705.2744%2C0705.0278%2C0705.3296%2C0705.0105%2C0705.0729%2C0705.3316%2C0705.0765%2C0705.0750%2C0705.3875%2C0705.3342%2C0705.3456%2C0705.0902%2C0705.0981%2C0705.4553%2C0705.2403%2C0705.1638%2C0705.3030%2C0705.1183%2C0705.3405%2C0705.0540%2C0705.2794%2C0705.3974%2C0705.1486%2C0705.1368%2C0705.2342%2C0705.1095%2C0705.2114%2C0705.2475%2C0705.2305%2C0705.1570%2C0705.1810%2C0705.1477%2C0705.1792%2C0705.3508%2C0705.1880%2C0705.0643%2C0705.3313%2C0705.4235%2C0705.0490%2C0705.2916%2C0705.3207%2C0705.0813%2C0705.3174%2C0705.1955%2C0705.3999%2C0705.0832%2C0705.4174%2C0705.1099%2C0705.1251%2C0705.2595%2C0705.0510%2C0705.4448%2C0705.4678%2C0705.0181%2C0705.1646%2C0705.0429%2C0705.2673%2C0705.3418%2C0705.1746%2C0705.0862%2C0705.4370%2C0705.2405%2C0705.0936%2C0705.1458%2C0705.2210%2C0705.3154%2C0705.1176%2C0705.0709%2C0705.3986%2C0705.2967%2C0705.3566%2C0705.0941%2C0705.2614&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The machinery of qubit-portraits of qudit states, recently presented, is\nconsider here in more details in order to characterize the presence of quantum\ncorrelations in bipartite qudit states. In the tomographic representation of\nquantum mechanics, Bell-like inequalities are interpreted as peculiar\nproperties of a family of classical joint probability distributions which\ndescribe the quantum state of two qudits. By means of the qubit-portraits\nmachinery a semigroup of stochastic matrices can be associated to a given\nquantum state. The violation of the CHSH inequalities is discussed in this\nframework with some examples, we found that quantum correlations in qutrit\nisotropic states can be detected by the suggested method while it cannot in the\ncase of qutrit Werner states."}, "authors": ["C. Lupo", "V. I. Man'ko", "G. Marmo"], "author_detail": {"name": "G. Marmo"}, "author": "G. Marmo", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1751-8113/40/43/016", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0705.2405v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0705.2405v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "12 pages, 4 figures", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0705.2405v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0705.2405v2", "journal_reference": "J.Phys.A40:13091-13100,2007", "doi": "10.1088/1751-8113/40/43/016", "fulltext": "arXiv:0705.2405v2 [quant-ph] 10 Oct 2007\n\nQubit-portraits of qudit states and quantum correlations\nC. Lupo1 , V. I. Man'ko2 , G. Marmo1\n1\n\nDipartimento di Fisica dell'Università di Napoli 'Federico II' and Istituto Nazionale di\nFisica Nucleare (INFN) Sezione di Napoli, Complesso Universitario di Monte Sant'Angelo,\nvia Cintia, Napoli, I-80126, Italy\n2\nP. N. Lebedev Physical Institute, Leninskii Prospect 53, Moscow 119991, Russia\nE-mail: lupo@na.infn.it, manko@sci.lebedev.ru, marmo@na.infn.it\nAbstract.\nThe machinery of qubit-portraits of qudit states, recently presented, is consider here in\nmore details in order to characterize the presence of quantum correlations in bipartite qudit\nstates. In the tomographic representation of quantum mechanics, Bell-like inequalities are\ninterpreted as peculiar properties of a family of classical joint probability distributions which\ndescribe the quantum state of two qudits. By means of the qubit-portraits machinery a\nsemigroup of stochastic matrices can be associated to a given quantum state. The violation\nof the CHSH inequalities is discussed in this framework with some examples, we found that\nquantum correlations in qutrit isotropic states can be detected by the suggested method while\nit cannot in the case of qutrit Werner states.\n\nPACS numbers: 03.65.-w, 03.67.-a\n\n1. Introduction\nEntanglement is probably one of the most intriguing and fascinating characteristic of quantum\nmechanics [1], its importance lies at the heart of the physical interpretation of the theory. The\nscientific interest and efforts towards the understanding and a complete characterization of\nentanglement is motivated both by its role in the conceptual foundation of quantum theory\nand by all the recent proposals and applications which lead to consider entanglement as a\nresource for quantum information and computation tasks [2].\nAlthough the two concepts are not equivalent, the presence of entanglement is strongly\nrelated to quantum non-locality. The fundamental tools to study quantum non-locality, i.e.\nquantum correlations, are the Bell-like inequalities. A violation of a Bell-like inequality is an\nevidence of the presence of non-local correlations in the quantum state. It is well known that\nonly entangled states can violate Bell-like inequalities. In the present paper we study bipartite\nmixed states entanglement by looking at violations of a Bell-like inequality, to do this we\nexploit the point of view given by the tomographic description of quantum mechanics [3].\nThe main goal of the present contribution is to further analyze the linear map which\ndefines the qubit-portraits of qudit state introduced in [4]. In particular we consider how this\nmap can be used to describe quantum correlation in a bipartite quantum system. This paper\n\n\fQubit-portraits of qudit states and quantum correlations\n\n2\n\nhas two main ingredients: the first is the tomographic description of quantum mechanics,\nthe second is related to the CHSH inequalities [5, 6]. The tomographic approach is known\nto be mathematically equivalent to the other descriptions of quantum mechanics based, for\ninstance, on density matrices or Wigner functions. Nevertheless there are two conceptually\nrelevant differences: the first one is that in the tomographic approach one deals only with\nwell defined (classical) probability distributions which are directly related to experimentally\naccessible relative frequencies of measurement outcomes; the second one is that, in order\nto define a tomogram, one needs additional information about the observables related to a\ngiven experimental setup. From these considerations it can be argued that the tomographic\napproach can be viewed as a rather natural framework to study Bell-like inequalities. In the\npresent paper we study the well known CHSH inequalities in this framework. Although the\ntomographic description of quantum mechanics can be defined in full generality [7], here we\nconcentrate our attention on quantum systems with finite levels.\nAmong a plethora of proposed criteria to detect entanglement, a prominent position\nis held by a family of methods which are based on the action of special linear maps on\nthe set of separable quantum states. Examples are the criteria based on positive but not\ncompletely positive maps [8] (like the criterion of the positive partial transpose [9]) and the\nrealignment criterion [10] which can be understood from a unique point of view based on\nlinear contractions [11]. Another example is given by the criterion based on partial scaling\ntransform [12] which is a linear map that is neither completely positive nor positive. In the\npresent paper we make use of the qubit-portraits of a qudit state [4] which is again a linear\nmap but is defined in the tomographic description of quantum mechanics.\nThe paper is organized in the following way. In section 2 we briefly recall some\ndefinitions and basic properties about tomograms. In section 3 the CHSH inequalities are\npresented in the framework of the tomographic approach to quantum mechanics. In section 4\nthe machinery of qubit-portraits of a qudit system is considered in order to deal with higher\ndimensional systems, examples for qubit and qutrit Werner and isotropic states are presented.\nThe paper ends with final remarks and conclusions in section 6.\n2. Introduction to quantum tomograms\nLet us consider a d-level quantum system with the associated Hilbert space H ∼\n= C d and\na chosen basis {|mi}m=1,...,d . Given a state of a system expressed by means of a density\noperator ρ, there are several ways to define a corresponding tomogram; let us first consider\nthe definition of unitary tomogram. The diagonal elements hm|ρ|mi of the density operator\nare the populations in the given basis, they constitute a well defined probability distribution.\nThe knowledge of the populations in a given basis is in general not sufficient to reconstruct\nthe off diagonal elements of the density operator, on the other hand the knowledge of the\npopulations in all possible bases gives complete information about the quantum state of the\nsystem. As the unitary group acts transitively on the family of bases, a generic basis {|m′ i}\ncan be identified with a special unitary transformation u ∈ SU(d) with |m′ i = u|mi. These\n\n\fQubit-portraits of qudit states and quantum correlations\n\n3\n\nconsiderations yield to the definition of the unitary tomogram as follows:\nωρ (m, u) ≡ hm|u† ρu|mi.\n\n(1)\n\nThe tomogram is thus a family of well defined probability distributions over d possible\nmeasurement outcomes, which depends on the d2 − 1 parameters defining a special-unitary\ntransformation. It is thus apparent that the tomogram explicitly gives the probability\ndistributions for the outcomes of all the possible projective measurements allowed by the\nprinciples of quantum mechanics. As a matter of fact this is a redundant description, a lower\nnumber of bases would be sufficient as long as they constitute a tomographic set [7].\nLet us now consider a special case, in which the d-level system is indeed a spin-j particle,\nwith d = 2j + 1, and the state vectors belonging to the basis are eigenstates of the angular\nmomentum along a quantization axis, say ẑ. In this case, one can be mostly interested in\nmeasurements of polarization along a generic direction n̂. Hence one is led to define the spin\ntomogram ad follows:\nωρj (m, D) ≡ hm|D † ρD|mi,\n\n(2)\n\nwhere D belongs to a spin-j irreducible representation of the group SU(2) and has the\nfollowing expression (see [14], for instance):\nhm′ |D|mi = e−im φ djm′ m (θ)e−imγ ,\n′\n\n(3)\n\nwhere\ndjm′ m (θ)\n\n\u0014\n\n(j + m)!(j − m)!\n=\n(j + m′ )!(j − m′ )!\n\n\u00151/2 \u0012\n\u0013m−m′ \u0012\n\u0013m+m′\nθ\nθ\n(m−m′ ,m+m′ )\nPj−m\n(cos θ)\nsin\ncos\n2\n2\n\n(4)\n\n(m−m′ ,m+m′ )\n\nis the Wigner matrix and Pj−m\nare the Jacobi polynomials. An unitary operator\nD is uniquely identified by the three Euler angles, nevertheless since only the diagonal\nelements of the (rotated) density operator appear in the definition, the tomogram depends\nonly on two Euler angles, say θ and φ, or equivalently on a point on the Bloch sphere\nn̂ ≡ (sin θ cos φ, sin θ sin φ, cos θ). Notice that both kinds of tomograms are mathematically\nequivalent to the density matrix description of the quantum states. In the case of spin\ntomography an additional physical information is added, this information allows to restrict\nto bases generated by an irreducible representation of SU(2) acting on a properly chosen\nfiducial one.\nLet us study quantum entanglement in the tomographic picture (see also some aspects of\nthis approach in [13]). In order to set properly the problem of separability of a quantum state,\none needs primarily to identify a partition of the whole system into a number of subsystems\neach of dimension dk . This can be done mathematically with the only constraint that Πdk = d,\nnevertheless the definition of subsystems is in general physically determined and depends on\nthe experimentally achievable observables and operations. To fix the ideas, let us for instance\nconsider the case of a spin-j particle which turns to be a bipartite system composed of a\nspin-j1 and spin-j2 , with dk = 2jk + 1 and d1 d2 = d. It is natural to define another kind of\ntomogram, which we call local spin tomogram, as follows:\nωρj1j2 (m1 , m2 , D1 , D2 ) ≡ hm1 m2 |D1† ⊗ D2† ρD1 ⊗ D2 |m1 m2 i,\n\n(5)\n\n\fQubit-portraits of qudit states and quantum correlations\n\n4\n\nwhere mk = −jk , −jk + 1, . . . , jk , and Dk are unitary irreducible representations of SU(2).\nAn analogous construction can be made for local unitary tomography, which yields to the\ndefinition:\nωρ (m1 , m2 , u1 , u2) ≡ hm1 m2 |u†1 ⊗ u†2 ρu1 ⊗ u2 |m1 m2 i.\n\n(6)\n\nThese definitions may be immediately extended to the multi-partite case. Notice that, while\nin the density matrix description the information about the internal structure of the system\nhas to be inserted as an additional information, in the tomographic approach it is included in\nthe chosen kind of tomogram from the very beginning. In the case of local spin tomography\n(5) the tomogram is a family of probability distributions depending on the two pairs of Euler\nangles (θk , φk ) which determine the directions of polarization n̂1 and n̂2 for the first and\nsecond particle respectively.\nSince the tomogram is a family of well defined probability distributions we find that\nthe tomographic approach to quantum mechanics can be a natural candidate to deal with\nquantum probabilities and correlations and also to study violation of Bell-like inequalities.\nLet us consider an observable X, it identifies a preferred basis |m̄i = ū|mi in terms of its\neigenstates, then the expectation value is simply written as\nX\nhXiρ =\nxm ωρ (m, ū),\n(7)\nm\n\nwhere xm are the corresponding eigenvalues. Let us consider the case of a bipartite system\nwith a couple of local observables X1 and X2 with corresponding eigenstates |m̄k i = ūk |mk i\nand eigenvalues xm,k . In the tomographic picture the correlation Cρ (X1 , X2 ) = hX1 X2 iρ is\nwritten as follows:\nX\nxm1 ,1 xm2 ,2 ωρ (m1 , m2 , ū1, ū2 ).\n(8)\nCρ (X1 , X2 ) =\nm1 ,m2\n\nGiven a bipartite system with simply separable density operator ρ = ρ1 ⊗ ρ2 it follows from\nthe definitions (5) or (6) that\nωρ (m1 , m2 , u1 , u2) = ωρ1 (m1 , u1)ωρ2 (m2 , u2),\n\n(9)\n\nthat is, the tomogram itself is the product of two tomograms and, in particular, it defines a\nfamily of uncorrelated joint probability distributions. By linearity, it follows that a generic\nP\nseparable state with density matrix ρ = k pk ρk1 ⊗ ρk2 has a tomogram of the form\nX\nωρ (m1 , m2 , u1 , u2) =\npk ωρk1 (m1 , u1 )ωρk2 (m2 , u2),\n(10)\nk\n\nwhich corresponds to a family of probability distributions with (classical) correlations. Notice\nthat the tomogram is a family of well defined classical probability distributions in any case,\nfor separable states the decomposition (10) exists with constant pk ≥ 0 and ωρk1 (m1 , u1 ) and\nωρk2 (m2 , u2) which are well defined tomograms.\n\n\fQubit-portraits of qudit states and quantum correlations\n\n5\n\n3. CHSH inequalities in the tomographic picture\nIn this section we review the CHSH inequalities exploiting the tomographic description of\nquantum mechanics and quantum correlations. In order to do this, we introduce a stochastic\nmatrix which is determined by a given tomogram whose structure is related to the form of\nthe CHSH inequalities. These inequalities were introduced in [6] as a generalization of the\noriginal Bell's inequalities [5] in order to relax some experimentally unfeasible assumptions.\nThe setting in which the inequalities are formulated is made by an ensemble of pairs of\ncorrelated particles moving in opposite directions and entering respectively two measurement\napparatus, say Ia and IIb , where a and b are adjustable parameters defining the apparatus\nconfiguration. At each side of the experiment a dichotomic observable is measured, say A(a)\nfor the apparatus Ia and B(b) for the apparatus IIb . The choice of the observables depends\non the value of the local parameters a and b, each of the local observable is taken to have\nas possible outcomes +1 and −1. The correlation function between the two observables is\nCρ (a, b) = hA(a)B(b)iρ , in the hypothesis of local realism the following inequalities hold\nB = |Cρ (a, b) + Cρ (a, c) + Cρ (d, b) − Cρ (d, c)| ≤ 2\n\n(11)\n\nfor any value of the parameters a, b, c, d and any ρ.\nIn order to describe these inequalities from the point of view of the tomographic\nrepresentation, we define an associated matrix in terms of which the inequalities (11) can\nbe written, eventually this matrix will turn to be a stochastic matrix. Let us first consider the\nsimplest case of a bipartite system composed by two two-level systems. In order to deal with\nthe generic case, we consider the unitary tomogram corresponding to the density matrix ρ:\nωρ (m1 , m2 , a, b)\n\n(12)\n\nwhere a and b are short hand notations for u1 (a) and u2 (b). Putting m = 1 and m = −1\nrespectively for polarization parallel and anti-parallel to the quantization direction we can\ndefine the following matrix:\n\n\nω(1, 1, a, b)\nω(1, 1, a, c)\nω(1, 1, d, b)\nω(1, 1, d, c)\n\n\nω(1, −1, a, c)\nω(1, −1, d, b)\nω(1, −1, d, c) \n ω(1, −1, a, b)\nMρ = \n(13)\n\nω(−1, 1, a, c)\nω(−1, 1, d, b)\nω(−1, 1, d, c) \n ω(−1, 1, a, b)\nω(−1, −1, a, b) ω(−1, −1, a, c) ω(−1, −1, d, b) ω(−1, −1, d, c)\n\nNotice that each column of this matrix is a well defined probability distribution which\ncorresponds to the tomogram with particular values of the parameters, hence M is a stochastic\nmatrix. Thus a stochastic matrix is associated to a quantum tomogram in a way which is\nsomehow analogous to the relation between density matrices and quantum maps [15, 16, 17].\nAlso notice that the order in which the columns are organized with respect to the parameters\na, b, c, d resembles the structure of a direct product. It is easy to check that for simply\nseparable states the associated stochastic matrix factorizes as the direct product of two\nstochastic matrices each one corresponding to one-particle tomogram:\n\"\n# \"\n#\nω1 (1, a)\nω1 (1, d)\nω2 (1, b)\nω2 (1, c)\nρ = ρ1 ⊗ ρ2 ⇒ M =\n⊗\n.\n(14)\nω1 (−1, a) ω1 (−1, d)\nω2 (−1, b) ω2 (−1, c)\n\n\fQubit-portraits of qudit states and quantum correlations\n\n6\n\nThat is, a simply separable state corresponds to a factorized stochastic matrix. Analogously,\na separable state corresponds to a stochastic matrix which is the convex sum of factorized\nstochastic matrices.\nWith the labeling m = −1, 1 the discrete index in the tomogram is just the value of\nthe relevant observable, so the expectation value for the correlation is simply written as\nP\nC(u1 , u2) = m1 ,m2 m1 m2 ω(m1 , m2 , u1 , u2 ). Introducing the matrix\n\n\n1 −1 −1 1\n 1 −1 −1 1 \n\n\nI=\n(15)\n\n 1 −1 −1 1 \n−1 1\n1 −1\nthe CHSH inequalities (11) can be written in the following way:\nB = |tr(IM)| ≤ 2.\n\n(16)\n\nThis expression will be used in the following sections where we define, by means of the\nmachinery of the qubit-portraits introduced in [4], a stochastic matrix in the case of a bipartite system composed of two qudits.\n4. Qubit-portraits of qudit systems\nIn this section we consider the CHSH inequalities in the case of a system composed of two\nqudits. In order to do this one needs to define a couple of dichotomic observables and to study\nthe correlations between them. This discussion belongs to a general setting made of a system\ncomposed of 2 (d-dimensional) subsystems; in each of one, 2 local observables are measured\nand each measurement has 2 possible outcomes. While in the qubit case any non trivial\nobservable can be associated with a dichotomic observable with outcomes +1 and −1, this is\nnot the case for qudit systems in which dichotomic observables do not represent the generic\ncase. This kind of problem was already considered in [18], in the present work we exploit the\nmachinery introduced in [4] which allows one to define a family of probability distributions\nwhich mimic a qubit tomogram and give a complete description of a qudit system, this kind\nof representation is called qubit-portrait.\nAs we have already recalled, the tomogram of a quantum state is a family of\nprobability distributions over all possible measurement outcomes in a given basis, where each\nmeasurement outcome corresponds to a one-dimensional projector P (m) = |mihm|. In the\nsame way one can consider a two-dimensional or in general a n-dimensional projector defined\nPn−1\nas P (m0 , m1 , . . . , mn−1 ) =\nk=0 |mk ihmk | and consider the corresponding probability.\nSince the projectors on the basis vectors are orthogonal to each other, in the tomographic\nP\nrepresentation this probability is given by the sum over independent events k ω(mk , u). As\nan examples, let us consider the case of a qutrit system. In this case we have an unitary\ntomogram ω(m, u) where m = 0, 1, 2 and u ∈ SU(3). Identifying the events m = 0\nand m = 1, we can define a qubit-portrait of the qutrit state as the family of probability\ndistribution ω ′ (m′ , u), with m′ = 0, 1 and ω ′ (0, u) = ω(0, u)+ω(1, u) and ω ′ (1, u) = ω(2, u).\nAnalogously, one can define other two qubit-portraits of the qutrit state. In the same way\n\n\fQubit-portraits of qudit states and quantum correlations\n\n7\n\nwe can reduce any qudit tomogram to a family of probability distribution over a dichotomic\nvariable and so define a qubit-portraits representation for any qudit tomogram. The same\nconsiderations can be extended to the case of spin tomography and to the case of multipartite\nsystems: for instance, a tomogram for the state of a system composed of two qutrits can\nbe reduced to a family of probability distributions over two dichotomic variables, which\ncorresponds to a two-qubit portrait of the two-qutrit system. In this fashion one can define, as\nin the previous section, a (square) stochastic matrix using the qubits portraits of a qudit-qudit\nsystem.\n5. Qubit-portraits of qutrit states and CHSH inequalities\nIn this section we study the CHSH inequalities applied to the case of qutrit-qutrit system,\nin particular we focalize our attention onto the families of Werner states [19] and isotropic\nstates [20]. In order to define a dichotomic variable, we reduce the qudit states to a family of\nprobability distributions which are the corresponding qubit-portraits. This yields to identify a\nstochastic matrix, analogous to the one presented in section 3, which is defined by means of\nthe qubit-portrait. Having reduced the qudit-qudit system to an effective qubit-qubit system,\nwe can consider the inequalities (16). In principle one can write several inequalities (not\nall independent) which correspond to all the possible qubit-portraits that can be defined\nstarting from the given qudits tomogram. In the case of qubit-qubit system, the CHSH\ninequalities have been already considered in the tomographic picture in [18], now we consider\nthe inequalities (16) defined with the help of qubit-portraits machinery.\nThe first family is given by the qudit-qudit Werner states, which is a one parameter family\nof quantum states defined as:\n\nI\n\nV\n\nW = (d3 − d)−1 [(d − φ) + (dφ − 1) ]\n\nI\n\n(17)\n\nV\n\nfor φ ∈ [−1, 1], where is the identity operator in the two-qudit space and\nis the flip\noperator defined as |ψ1 i|ψ2 i = |ψ2 i|ψ1 i. The state (17) is separable for φ ≥ 0 and\nentangled otherwise. The second family is given by the isotropic states:\n\u0003\n\u0002\n(18)\nS = (d2 − 1)−1 (1 − p) + (pd2 − 1)|ψihψ|\nP\nfor p ∈ [0, 1], where |ψi = √1d di=1 |iii is a maximally entangled states. The state (18) is\nseparable for p ≤ d−1 and entangled otherwise. Notice that, for d = 2 and p ≥ 0, the two\nfamilies are related by a re-parametrization and a partial transposition.\nWe also need to specify what kind of tomogram we want to use, for the sake of simplicity\nwe restrict our discussion to the case of polarization measurements, this is the case in which\nwe take the subgroup of the unitary group U(d) given by an irreducible representation of\nSU(2) and consider the local spin tomogram. In this case the parameters defining the local\nobservables are just the pair of Euler angles which identify the direction of polarization. In the\ntwo-qubit case, the local group is SU(2) ⊗ SU(2) acting on 2 ⊗ 2 , when the qubit portraits\narise from qutrit one should use SU(2) ⊂ SU(3) acting irreducibly.\nFirst of all, let us consider the case of qubits. In this case the construction of the\nqubit portraits is redundant and our discussion is just a different way to deal with CHSH\n\nV\n\nI\n\nC C\n\n\fQubit-portraits of qudit states and quantum correlations\n\n8\n\n3\n\n(a)\n\nB\n\n*\n\n2\n1\n\nπ\n\n0\n−1\n1\n0.5\n0\n−1\n\n−0.5\n\n0\nφ\n\n0.5\n\n1\n(b)\n\n−0.5\n\n0\nφ\n\n0.5\n\n1\n\nFigure 1. (a) Maximum value of the Bell number (16) for a two qubit Werner state (17) as\na function of the state parameter (solid line) compared with the maximum value allowed by\nlocal hidden variables theories (dot-dashed line). (b) Purity of the two qubit Werner state.\n\n3\n\n(a)\n\nB\n\n*\n\n2\n1\n0\n0\n\n0.5\np\n\n1\n\nπ\n\n1\n\n(b)\n\n0.5\n0\n0\n\n0.5\np\n\n1\n\nFigure 2. (a) Maximum value of the Bell number (16) for a two qubit isotropic state (18) as\na function of the state parameter (solid line) compared with the maximum value allowed by\nlocal hidden variables theories (dot-dashed line). (b) Purity of the two qubit isotropic state.\n\ninequalities, nevertheless this example can be an useful term of comparison with respect\nto higher dimensional non trivial configurations. We have computed the spin tomogram of\nthe two qubit Werner states and computed the maximum of the quantity (16), denoted B ∗ .\nNotice that the maximum is taken with respect to all the possible choices of local observables\nwhich in the case of spin tomography are identified by four unit vectors on the Bloch sphere\nn̂a , n̂b , n̂c , n̂d . The results are shown in figure 1a. The same calculation has been done for the\ncase of two-qubit isotropic states and the corresponding results are plotted in figure 2b. The\nplots 1b and 2b show the purity π = tr ρ2 as a function of the parameter of the corresponding\nstates.\n\n\fQubit-portraits of qudit states and quantum correlations\n\n9\n\n2\n\n(a)\n\nB*\n\n1.5\n1\n\n0.5\n\nπ\n\n0\n−1\n0.4\n0.2\n0\n−1\n\n−0.5\n\n0\nφ\n\n0.5\n\n1\n(b)\n\n−0.5\n\n0\nφ\n\n0.5\n\n1\n\nFigure 3. (a) Maximum value of the Bell number (16) for a two qutrit Werner state (17) as\na function of the state parameter (solid line) compared with the maximum value of I3 from\nequation (19) (dashed line) and the maximum value allowed by local hidden variables theories\n(dot-dashed line). (b) Purity of the two qutrit Werner state.\n\nFor the case of two qutrit state, we have compared the results obtained with the qubitportrait method with the qutrit-qutrit Bell's inequalities presented in [21] which generalize the\nCHSH inequalities. In our notation we can write them as:\nI3 = {P [A(a) = B(b)] + P [A(c) = B(b) − 1]+\nP [A(c) = B(d)] + P [A(a) = B(d)]} +\n− {P [A(a) = B(b) − 1] + P [A(c) = B(b)] +\nP [A(c) = B(d) − 1] + P [A(a) = B(d) + 1]} ≤ 2,\n\n(19)\n\nwhere\nP ([A(a) = B(b) + k] ≡\n\nX\n\nω(j + k, j, a, b),\n\n(20)\n\nj\n\nand the sum j + k is modulo 3. Notice that, also in this case, the inequalities can be written\nusing the language of tomograms in a natural way.\nFor the two-qutrit Werner states, we have first considered all the possible two-qubit\nportraits which are computed by means of the procedure described in section (4). The\nmaximum of the Bell number (16) is determined with respect to both polarization vectors\nwhich define the set of local observables and the different qubit-portraits of the two qutrit\nsystem. The results are plotted in figure 3a together with the maximum value of the analogous\nquantity I3 from equation (19). The plot shows that the qubit-portraits method cannot\nreveal quantum correlations in two qutrit Werner states. Analogously we have computed\nthe maximum of (16) for the two-qutrit isotropic states, in this case, as shown in figure 4a, the\nqubit-portrait method is able to witness the presence of quantum correlations. The results are\nplotted together with the maximum value of I3 from equation (19).\n\n\fQubit-portraits of qudit states and quantum correlations\n\n10\n\n3\n\n(a)\n\nB\n\n*\n\n2\n1\n\nπ\n\n0\n0\n1\n0.5\n0\n0\n\n0.5\np\n\n1\n(b)\n\n0.5\np\n\n1\n\nFigure 4. (a) Maximum value of the Bell number (16) for a two qutrit isotropic state (18) as\na function of the state parameter (solid line) compared with the maximum value of I3 from\nequation (19) (dashed line) and the maximum value allowed by local hidden variables theories\n(dot-dashed line). (b) Purity of the two qutrit isotropic state.\n\nThe different capability of the CHSH inequalities approached with the machinery of the\nqubit-portraits to recognize quantum correlations in Werner and isotropic state for d = 2, 3\ncan be related to the different value of the purity of the corresponding states which are plotted\nin figure 3b and 4b.\nFor the case of the two-qutrit isotropic states, the minimal value of the state parameter,\narising from our method, that yields to a violation of the Bell's inequalities is pB\nmin ≃ 0.7893\nI3\nfor the CHSH inequalities and pmin ≃ 0.8139 for the inequalities (19). In our notation, the\nI3\nB\nsinglet fraction is q = (9p−1)/8, yielding to qmin\n≃ 0.7630 and qmin\n≃ 0.7906. A comparison\nwith the results presented in [21, 22] yields to the observation that the local spin tomography,\nalthough based on an irreducible action of the group SU(2), cannot give complete information\nabout violation of Bell inequalities. In other words, even though a tomographic set gives\ncomplete information about the quantum state and allows the reconstruction of the density\noperator, the local spin tomogram cannot necessary reach the configuration corresponding to\nthe maximal violation of a Bell-like inequality.\n6. Conclusions and outlook\nIn this paper we have further investigated the method of qubit-portraits of qudit states\nfirst discussed in [4]. This method arises in a natural way in the tomographic description\nof quantum mechanics, it allows to map a qudit tomogram onto a family of probability\ndistributions which mimic a family of qubit tomograms. The method is applied in relation\nto the study of non-classical correlations in quantum systems, it allows a study of the CHSH\ninequalities for generic bipartite qudit systems.\nExploiting the tomographic approach to quantum mechanics, it is possible to associate a\n\n\fQubit-portraits of qudit states and quantum correlations\n\n11\n\nstochastic matrix to any bipartite quantum system with a finite number of levels, its structure\nis related to the structure of the CHSH inequalities and in term of it the presence of quantum\ncorrelations can be studied. Some examples have been presented regarding two special classes\nof bipartite states, namely Werner and isotropic states. The results show that performing\nthe operation of the qubit-portraits can lead to some loss of information about quantum\ncorrelations , as it is witnessed by the absence of violations of the CHSH inequalities in\nthe case of the qubit-portraits of two qutrits Werner states. On the other hand, the study of\nother two-qutrit Bell's inequalities with the framework of quantum tomography, leads to the\nconclusion that even though the spin tomogram allows the reconstruction of the quantum state,\nit does not necessary provide the maximal violation of a Bell-like inequalities.\nFollowing [7, 17] in future publications we will consider possible extensions of the\npresent work to the case of systems with higher dimensions and continuous variables.\nOther possible applications of the qubit-portraits method can be the study of other Bell-like\ninequalities which involve more than two choices of local observables per part.\nAcknowledgments\nV. I. Man'ko thanks the University of Napoli 'Federico II' and I.N.F.N. sezione di Napoli for\nkind hospitality.\nReferences\n[1] Schrödinger E 1935 Naturwissenschaften 23 807, 823, 844\n[2] Nielsen M A and Chuang I L 2000 Quantum Computation and Quantum Information (Cambridge:\nCambridge University Press)\n[3] Mancini S, Man'ko V I and Tombesi P 1996 Phys. Lett. A 213 1; Dodonov V V and Man'ko V I 1997 ibid.\n229 335; Man'ko V I and Man'ko O V 1997 J. Exp. Ther. Phys. 85 430\n[4] Chernega V N, Man'ko V I 2007 J. Russ. Laser Res. 28 2\n[5] Bell J S 1965 Phys. 1 195\n[6] Clauser J F, Horne M A, Shimony A, Holt R A 1969 Phys. Rev. Lett. 23 880\n[7] Man'ko V I, Marmo G, Simoni A, Stern A, Sudarshan E C G and Ventriglia F 2005 Phys. Lett. A 351 1;\nMan'ko V I, Marmo G, Simoni A, Ventriglia F 2006 Open Sys. Inf. Dyn. 13 239\n[8] Horodecki M, Horodecki P and Horodecki R 1996 Phys. Lett. A 223 1\n[9] Peres A 1996 Phys. Rev. Lett. 77 1413\n[10] Chen K, Wu L -A 2003 Quant. Inf. Comp. 3 193; Rudolph O 2002 Further results on the cross norm\ncriterion for separability Preprint quant-ph/0202121\n[11] Horodecki M, Horodecki P and Horodecki R 2006 Open Sys. Inf. Dyn. 13 103\n[12] Man'ko O V, Man'ko V I, Sudarshan E C G, Zaccaria F 2006 Phys. Lett. A 357 255; Man'ko O V, Man'ko\nV I, Marmo G, Shaji A, Sudarshan E C G, Zaccaria F 2005 ibid. 339 194; Lupo C, Man'ko V I, Marmo\nG, Sudarshan E C G 2005 J. Phys. A: Math. Gen. 38 10377\n[13] Andreev V A, Man'ko V I, Man'ko O V, Shchukin E V 2006 Theor. Math. Phys. 146 172\n[14] Landau L D, Lifshitz E M 1977 Quantum Mechanics: Non-Relativistic Theory (Oxford: Pergamon Press)\n3rd edition\n[15] Sudarshan E C G, Mathews P M and Rau J 1961 Phys. Rev. 121 920; Jamiolkowski A 1972\nRep. Math. Phys. 3 275\n[16] Alicki R, Lendi K 1987 Quantum Dynamical Semigroups and applications (Berlin: Springer Verlag)\n[17] Marmo G, Asorey M, Kossakowski A, Sudarshan E C G 2005 Open Sys. Inf. Dyn. 12 319\n\n\fQubit-portraits of qudit states and quantum correlations\n[18]\n[19]\n[20]\n[21]\n[22]\n\n12\n\nLupo C, Man'ko V I, Marmo G 2006 J. Phys. A: Math. Gen. 39 12515\nWerner R F 1989 Phys. Rev. A 40 4277\nHorodecki M, Horodecki P 1999 Phys. Rev. A 59 4206; Vollbrecht K G H, Werner R F 2001 ibid. 64 062307\nCollins D, Gisin N, Linden N, Massar S, Popescu S 2002 Phys. Rev. Lett. 88 040404\nChen J- L, Kaszlikowski D, Kwek L C, Zukowski M and Oh C H 2002 Phys. Rev. A 64 052109;\nKaszlikowski D, Gnacinski P, Zukowski M, Miklaszewski W, Zeilinger A 2000 Phys. Rev. Lett. 85\n4418\n\n\f"}