{"id": "http://arxiv.org/abs/1003.3263v2", "guidislink": true, "updated": "2010-05-07T14:09:18Z", "updated_parsed": [2010, 5, 7, 14, 9, 18, 4, 127, 0], "published": "2010-03-16T22:08:13Z", "published_parsed": [2010, 3, 16, 22, 8, 13, 1, 75, 0], "title": "Thermalisation and hard X-ray bremsstrahlung efficiency of\n  self-interacting solar flare fast electrons", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.2825%2C1003.2816%2C1003.2611%2C1003.3024%2C1003.3629%2C1003.0728%2C1003.0513%2C1003.1014%2C1003.0732%2C1003.5907%2C1003.4701%2C1003.2339%2C1003.4378%2C1003.1485%2C1003.4955%2C1003.3868%2C1003.3556%2C1003.1120%2C1003.3096%2C1003.0247%2C1003.3545%2C1003.6066%2C1003.4634%2C1003.2947%2C1003.1190%2C1003.4825%2C1003.5294%2C1003.3226%2C1003.0604%2C1003.0155%2C1003.0781%2C1003.5016%2C1003.2397%2C1003.4867%2C1003.3434%2C1003.5964%2C1003.2260%2C1003.3933%2C1003.3120%2C1003.1925%2C1003.0336%2C1003.4043%2C1003.3263%2C1003.4019%2C1003.1029%2C1003.3740%2C1003.4178%2C1003.4015%2C1003.3788%2C1003.1298%2C1003.4362%2C1003.4143%2C1003.0574%2C1003.1012%2C1003.1832%2C1003.5808%2C1003.3542%2C1003.4906%2C1003.5096%2C1003.2458%2C1003.4696%2C1003.0850%2C1003.5665%2C1003.4640%2C1003.0497%2C1003.5521%2C1003.0404%2C1003.3765%2C1003.3452%2C1003.2500%2C1003.1523%2C1003.5968%2C1003.3224%2C1003.1848%2C1003.1112%2C1003.2945%2C1003.5102%2C1003.6036%2C1003.1790%2C1003.4421%2C1003.1713%2C1003.6107%2C1003.5345%2C1003.4534%2C1003.2158%2C1003.2349%2C1003.5679%2C1003.0594%2C1003.4512%2C1003.3286%2C1003.1571%2C1003.5014%2C1003.4770%2C1003.2748%2C1003.2286%2C1003.0698%2C1003.1213%2C1003.5856%2C1003.5526%2C1003.2295%2C1003.5575&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Thermalisation and hard X-ray bremsstrahlung efficiency of\n  self-interacting solar flare fast electrons"}, "summary": "Most theoretical descriptions of the production of solar flare bremsstrahlung\nradiation assume the collision of dilute accelerated particles with a cold,\ndense target plasma, neglecting interactions of the fast particles with each\nother. This is inadequate for situations where collisions with this background\nplasma are not completely dominant, as may be the case in, for example,\nlow-density coronal sources. We aim to formulate a model of a self-interacting,\nentirely fast electron population in the absence of a dense background plasma,\nto investigate its implications for observed bremsstrahlung spectra and the\nflare energy budget. We derive approximate expressions for the time-dependent\ndistribution function of the fast electrons using a Fokker-Planck approach. We\nuse these expressions to generate synthetic bremsstrahlung X-ray spectra as\nwould be seen from a corresponding coronal source. We find that our model\nqualitatively reproduces the observed behaviour of some flares. As the flare\nprogresses, the model's initial power-law spectrum is joined by a lower energy,\nthermal component. The power-law component diminishes, and the growing thermal\ncomponent proceeds to dominate the total emission over timescales consistent\nwith flare observations. The power-law exhibits progressive spectral hardening,\nas is seen in some flare coronal sources. We also find that our model requires\na factor of 7 - 10 fewer accelerated electrons than the cold, thick target\nmodel to generate an equivalent hard X-ray flux. This model forms the basis of\na treatment of self-interactions among flare fast electrons, a process which\naffords a more efficient means to produce bremsstrahlung photons and so may\nreduce the efficiency requirements placed on the particle acceleration\nmechanism. It also provides a useful description of the thermalisation of fast\nelectrons in coronal sources.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.2825%2C1003.2816%2C1003.2611%2C1003.3024%2C1003.3629%2C1003.0728%2C1003.0513%2C1003.1014%2C1003.0732%2C1003.5907%2C1003.4701%2C1003.2339%2C1003.4378%2C1003.1485%2C1003.4955%2C1003.3868%2C1003.3556%2C1003.1120%2C1003.3096%2C1003.0247%2C1003.3545%2C1003.6066%2C1003.4634%2C1003.2947%2C1003.1190%2C1003.4825%2C1003.5294%2C1003.3226%2C1003.0604%2C1003.0155%2C1003.0781%2C1003.5016%2C1003.2397%2C1003.4867%2C1003.3434%2C1003.5964%2C1003.2260%2C1003.3933%2C1003.3120%2C1003.1925%2C1003.0336%2C1003.4043%2C1003.3263%2C1003.4019%2C1003.1029%2C1003.3740%2C1003.4178%2C1003.4015%2C1003.3788%2C1003.1298%2C1003.4362%2C1003.4143%2C1003.0574%2C1003.1012%2C1003.1832%2C1003.5808%2C1003.3542%2C1003.4906%2C1003.5096%2C1003.2458%2C1003.4696%2C1003.0850%2C1003.5665%2C1003.4640%2C1003.0497%2C1003.5521%2C1003.0404%2C1003.3765%2C1003.3452%2C1003.2500%2C1003.1523%2C1003.5968%2C1003.3224%2C1003.1848%2C1003.1112%2C1003.2945%2C1003.5102%2C1003.6036%2C1003.1790%2C1003.4421%2C1003.1713%2C1003.6107%2C1003.5345%2C1003.4534%2C1003.2158%2C1003.2349%2C1003.5679%2C1003.0594%2C1003.4512%2C1003.3286%2C1003.1571%2C1003.5014%2C1003.4770%2C1003.2748%2C1003.2286%2C1003.0698%2C1003.1213%2C1003.5856%2C1003.5526%2C1003.2295%2C1003.5575&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Most theoretical descriptions of the production of solar flare bremsstrahlung\nradiation assume the collision of dilute accelerated particles with a cold,\ndense target plasma, neglecting interactions of the fast particles with each\nother. This is inadequate for situations where collisions with this background\nplasma are not completely dominant, as may be the case in, for example,\nlow-density coronal sources. We aim to formulate a model of a self-interacting,\nentirely fast electron population in the absence of a dense background plasma,\nto investigate its implications for observed bremsstrahlung spectra and the\nflare energy budget. We derive approximate expressions for the time-dependent\ndistribution function of the fast electrons using a Fokker-Planck approach. We\nuse these expressions to generate synthetic bremsstrahlung X-ray spectra as\nwould be seen from a corresponding coronal source. We find that our model\nqualitatively reproduces the observed behaviour of some flares. As the flare\nprogresses, the model's initial power-law spectrum is joined by a lower energy,\nthermal component. The power-law component diminishes, and the growing thermal\ncomponent proceeds to dominate the total emission over timescales consistent\nwith flare observations. The power-law exhibits progressive spectral hardening,\nas is seen in some flare coronal sources. We also find that our model requires\na factor of 7 - 10 fewer accelerated electrons than the cold, thick target\nmodel to generate an equivalent hard X-ray flux. This model forms the basis of\na treatment of self-interactions among flare fast electrons, a process which\naffords a more efficient means to produce bremsstrahlung photons and so may\nreduce the efficiency requirements placed on the particle acceleration\nmechanism. It also provides a useful description of the thermalisation of fast\nelectrons in coronal sources."}, "authors": ["R. K. Galloway", "P. Helander", "A. L. MacKinnon", "J. C. Brown"], "author_detail": {"name": "J. C. Brown"}, "author": "J. C. Brown", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361/201014077", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1003.3263v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1003.3263v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "9 pages, 7 figures, accepted for Astronomy & Astrophysics; this\n  version clarifies arguments around Eqs. (11) and (20)", "arxiv_primary_category": {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1003.3263v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1003.3263v2", "journal_reference": null, "doi": "10.1051/0004-6361/201014077", "fulltext": "c ESO 2010\n\nAstronomy & Astrophysics manuscript no. ms ̇accepted\nMay 7, 2010\n\nThermalisation and hard X-ray bremsstrahlung efficiency of\nself-interacting solar flare fast electrons\nR. K. Galloway1⋆ , P. Helander2 , A. L. MacKinnon1 , and J. C. Brown1\n1\n2\n\nDepartment of Physics and Astronomy, Kelvin Building, University of Glasgow, Glasgow G12 8QQ, U.K.\ne-mail: ross@astro.gla.ac.uk,a.mackinnon@educ.gla.ac.uk,john@astro.gla.ac.uk\nMax Planck Institute for Plasma Physics, Wendelsteinstrasse 1, 17491 Greifswald, Germany\ne-mail: per.helander@ipp.mpg.de\n\nReceived date / Accepted date\nABSTRACT\n\nContext. Most theoretical descriptions of the production of solar flare bremsstrahlung radiation assume the collision of dilute accelerated particles with a cold, dense target plasma, neglecting interactions of the fast particles with each other. This is inadequate for\nsituations where collisions with this background plasma are not completely dominant, as may be the case in, for example, low-density\ncoronal sources.\nAims. We aim to formulate a model of a self-interacting, entirely fast electron population in the absence of a dense background\nplasma, to investigate its implications for observed bremsstrahlung spectra and the flare energy budget.\nMethods. We derive approximate expressions for the time-dependent distribution function of the fast electrons using a Fokker-Planck\napproach. We use these expressions to generate synthetic bremsstrahlung X-ray spectra as would be seen from a corresponding coronal source.\nResults. We find that our model qualitatively reproduces the observed behaviour of some flares. As the flare progresses, the model's\ninitial power-law spectrum is joined by a lower energy, thermal component. The power-law component diminishes, and the growing\nthermal component proceeds to dominate the total emission over timescales consistent with flare observations. The power-law exhibits\nprogressive spectral hardening, as is seen in some flare coronal sources. We also find that our model requires a factor of 7 - 10 fewer\naccelerated electrons than the cold, thick target model to generate an equivalent hard X-ray flux.\nConclusions. This model forms the basis of a treatment of self-interactions among flare fast electrons, a process which affords a more\nefficient means to produce bremsstrahlung photons and so may reduce the efficiency requirements placed on the particle acceleration\nmechanism. It also provides a useful description of the thermalisation of fast electrons in coronal sources.\nKey words. Sun: corona – Sun: flares – Sun: X-rays, gamma rays – plasmas\n\n1. Introduction\nMost studies of the behaviour of fast electron populations in solar flares have assumed the presence of an ambient cold background plasma of sufficient density that it dominates the evolution of the fast electrons. In this case, self-interactions between\nthe members of the fast electron population may be neglected,\nand only interactions between the fast electrons and members\nof the background plasma are considered. Analytic treatments\nof this kind include Brown's (1971) original formulation of the\ncold, thick target problem, and other analytic approaches such\nas those of Vilmer et al. (1986), which considers the spatial\nand temporal evolution of fast electrons in a region of inhomogeneous magnetic field and plasma density, and Conway et al.\n(1998), which gives analytic expressions for the moments of the\nelectron distribution function.\nGalloway et al. (2005) detailed a treatment which also assumed a dominant background plasma, but which relaxed the\ntraditional cold target assumption. However, they also revealed a\nsituation where observations implied that the fast electron population might not be insignificant in comparison to the ambient\nSend offprint requests to: A. L. MacKinnon\n⋆\nPresent address: School of Physics and Astronomy, University of\nEdinburgh, James Clerk Maxwell Building, EDINBURGH EH9 3JZ,\nUK.\n\nplasma, i.e. the local density of the fast electrons is not small\ncompared to the density of the background plasma electrons.\nKrucker et al. (2009) have reported a coronal hard X-ray (HXR)\nsource in which the fast particle density approaches the plasma\ndensity. In this case, it would be desirable to consider also the\nself-interactions between the members of the fast electron population. As well as being an interesting modelling problem, such\nan approach will have some bearing on a central problem in flare\nphysics. The existing cold, thick target flare paradigm envisages\nthe flare hard X-ray yield being generated principally by interactions between fast electrons and an essentially stationary (i.e.\nlow thermal speed) background. Such encounters between particles of substantially different speed are highly inefficient in generating bremsstrahlung radiation: the fast electrons lose around\n104 –105 times more energy through long-range Coulomb collisions than through bremsstrahlung emission of X-rays by shortrange interactions (e.g. Brown 1971).\nComparison of the energy emitted in the form of X-rays with\nthe total flare energy release reveals that, under the cold, thick\ntarget approximation, a substantial fraction of the total flare energy (possibly as much as 50%) is manifested in accelerated\nelectrons (e.g. Brown 1971; Lin & Hudson 1976; Saint-Hilaire\n& Benz 2005). This has immediate, important implications for\nthe particle acceleration mechanism: as many as 1036 electrons\nmust be accelerated to energies greater than 20 keV each second\n\n\f2\n\nR. K. Galloway et al.: Thermalisation of self-interacting solar flare fast electrons\n\n(Hoyng et al. 1976). If the acceleration mechanism is some form\nof magnetic reconnection in a single site, the acceleration region\nis limited to very restricted spatial scales, with current sheets\nonly a few kilometres wide or thinner. The very great flux of accelerated electrons then constitutes a number and density problem: accelerating such a large number of electrons in sub-second\ntimescales in such a small region requires a highly effective and\nefficient accelerating mechanism, which at this time remains theoretically elusive. One proposed solution is that the acceleration\ndoes not occur in a single or a few sites, but is distributed over\na large number of small reconnection sites throughout the flaring volume (e.g. Turkmani et al. 2005). This somewhat relaxes\nthe constraint of very small acceleration region volume, and so\nlowers the implied density of fast particles in the accelerating region. However, the overall number problem remains formidable\n– essentially, the acceleration mechanism is required to accelerate almost all the electrons present in the corona above an active\nregion to energies above 20 keV every second for the duration of\nthe impulsive phase of the flare.\nAn alternative solution would be to reduce the total quantity of energetic electrons required to produce the observed\nbremsstrahlung X-ray yield. This might be done by re-cycling\nelectrons repeatedly through the accelerator, so that each electron could produce many high energy photons (e.g. Brown et al.\n2009). Alternatively, fewer electrons would be required if the\nbremsstrahlung emission process was more efficient than that\nenvisaged in the cold target scenario. Since the fast electron population is assumed to be 'dilute' in the cold target case, the fast\nelectrons only undergo electron-electron collisions with target\nplasma electrons of much lower energy. Thus, the fast electrons\nrapidly lose energy to the target, preventing them from generating further high energy photons through bremsstrahlung emission during interactions with the ions. However, if the high energy particles collide with each other, the collisions merely exchange energy between the fast particles, giving less systematic\ncollisional energy loss from the energetic electron population.\nThe fast electrons can therefore continue to generate high energy\nphotons. Consequently, a population of fast particles thermalising through self-interactions would constitute a more efficient\nbremsstrahlung source, allowing the observed flare hard X-ray\noutput to be reconciled with a smaller accelerated electron population. This in turn relaxes the stringent requirements on the\neffectiveness of the acceleration mechanism.\nIn view of this, we now examine an approach to obtaining\nan approximate analytic solution for the time evolution of a population of self-interacting fast particles. To render the problem\nmore tractable, and to afford a completely analytic solution, we\nconsider a situation with no background plasma electrons and\nonly Coulomb collision interactions exchanging energy between\nthe fast electrons, and with electron-ion encounters giving rise\nto bremsstrahlung emission. In doing so, we consider a situation\nmore closely analogous to a coronal or loop-top source than a\nfootpoint source. Masuda et al. (1994) first identified a distinct\nflare hard X-ray source at high altitude in the more tenuous coronal plasma, in addition to the usual footpoint sources located in\nthe denser chromospheric plasma. A study by Petrosian et al.\n(2002) of loop-top emission in limb flares suggested that coronal HXR sources may be a common feature in all flares, and such\nsources have recently been reviewed by Krucker et al. (2008).\nIn neglecting the dense chromospheric background plasma, our\nmodel is not intended to describe the fast electron behaviour at\nthe footpoint sources, nor the sort of high ambient density coronal source described by Veronig & Brown (2004). However, it\ncan be considered to approximately describe the evolution of a\n\nfast electron population in a low-density coronal source, where\ninteractions with the background plasma will be less significant since the background density is several orders of magnitude lower than in the chromosphere, but the intensity of the\nfast electron beam remains unchanged. Recently, Krucker et al.\n(2009) have identified in RHESSI data a coronal HXR source\nthat appears to have this character.\nIn Section 2 we outline the derivation of the time-dependent\nelectron distribution function we obtain for this problem. In\nSection 3 we give some numerical illustrations of the behaviour\nof this solution, and in Section 4 we compare it to some observations of corresponding solar events. In Section 5 we compare\nthe efficiency of our model to that of the traditional cold, thick\ntarget model for the production of hard X-ray photons. Our conclusions are summarised in Section 6.\n\n2. Development of the distribution function for\nthermalising electrons\nWe consider a plasma with an initial power-law distribution\nof electron energies and cold (effectively stationary) ions, and\nstudy the evolution of the electrons towards a Maxwellian due\nto Coulomb collisions. The plasma is spatially homogeneous\nand thermally insulated (i.e. experiences no particle or conductive energy losses), and we neglect energy loss through radiation (justified below). For simplicity we consider only the electrons since the ions will remain cold throughout, and electronion collisions affect mainly the pitch angle of the electrons without substantially altering their energy (e.g. Trubnikov 1965). We\nassume that the distribution is initially isotropic so that it remains isotropic for all time and that almost all electrons are nonrelativistic.\nWe will not attempt to construct an exact, self-consistent\nsolution. Instead, we seek an approximate distribution function\nwhich is analytically accessible but still behaves correctly in the\nhigh and low energy regimes. The evolution of the parameters\nof the distribution and the relative magnitudes of its components\nwill be constrained by the relevant conservation laws. More precisely, we will aim to describe the distribution f (v, t) produced\nat time t as a population of electrons evolves under binary collisions, given an initial distribution\nf (v, t = 0) =\n\nv3p−3\n3(p − 1)\nntot \u0010 0 \u0011 p\n4π\nv3 + v3\n\n(1)\n\n0\n\nThe distribution function f (v, t) has normalisation\nZ\nf (v′ , t)d3 v′ = ntot ,\n\n(2)\n\nfor all times t. Here ntot is the total electron number density.\nEquation (1) ensures that this normalisation is satisfied at t = 0.\nBecause of its isotropy, the value of f depends only on speed v.\nThe initial condition (1) resembles the kappa distributions\nfound commonly in space plasmas (e.g. Maksimovic et al. 1997)\nin that it includes a 'core' with characteristic speed v0 playing the\nrole of a thermal speed, combined with a power-law tail at high\nenergies. The kappa distribution in turn has been found to be\nconsistent with the electron distributions present in coronal HXR\nsources (Kašparová & Karlický 2009). Its precise form allows us\nto carry out the subsequent discussion mostly analytically. As already noted for the kappa distribution by Kašparová & Karlický\n(2009), it posesses a maximum when rewritten as a distribution\nper unit energy and thus needs no independent invocation of a\n\n\fR. K. Galloway et al.: Thermalisation of self-interacting solar flare fast electrons\n\n\"low-energy cutoff\". The power-law index p we require to be\ngreater than 5/3 for finite total energy. v0 acts as a lower 'turnover', ensuring the distribution remains well behaved at v = 0\n(cf. Brown & Emslie 1988).\nWe employ the Fokker-Planck formalism for particle evolution under binary collisions (e.g. Rosenbluth et al. 1957;\nMontgomery & Tidman 1964; Helander & Sigmar 2002). The\nkinetic equation is\n\"\n!#\n∂f\nL ∂ 2 ′\n′′ ∂ f\nv φ f −ψ\n,\n(3)\n= 2\n∂t\n∂v\nv ∂v\nwhere\nL=\n\ne4 ln Λ\n,\nm2e ǫ02\n\nand f = f (v, t) is the electron velocity distribution function. The\nright hand side of Eq. (3) is the Fokker-Planck representation of\nthe effect of electron-electron collisions.\nThe coefficients for drift (φ′ ) and diffusion (ψ′′ ) may be expressed in terms of the Rosenbluth potentials (Rosenbluth et al.\n1957):\nZ\n1\nf (v′ ) 3 ′\nφ(v) = −\nd v,\n4π\n|v − v′ |\nZ\n1\n|v − v′ | f (v′ )d3 v′ .\nψ(v) = −\n8π\nFor suprathermal particles (i.e. v ≫ v′ ), we make the approximation that |v − v′ | ≈ v and take it out of the integral. For any\nmonotonically decreasing f (such as the power-laws we consider), this approximation will always become adequate for sufficiently large v: the integrand of φ does not diverge as v′ → v\nbecause the surrounding volume element simultaneously tends\nto zero more rapidly than the term in the denominator (see also\ne.g. Spitzer 1956; Trubnikov 1965).\nUsing Eq. (2), the Rosenbluth potentials then reduce to\nφ(v) ≈ −\n\nntot\n,\n4πv\n\nψ(v) ≈ −\n\nntot v\n.\n8π\n\nSince here the second derivative of ψ(v) is zero, the suprathermal particles experience no velocity diffusion (second term in\nEq. 3) and undergo only systematic velocity change (first term\nin Eq. 3). The kinetic equation now takes the form\n∂ f ̃∞\n1 ∂ f ̃∞\n= 2\n,\n∂s\nu ∂u\n\n(4)\n\nτ=\n\nntot e4 ln Λ\n\n.\n\n(5)\n\nand we have introduced dimensionless time s = t/τ and speed\nu = v/v0 . We have also made f non-dimensional by defining\nf ̃(u, s) =\n\nbe evaluated for any speed; the appearance of v0 in the initial\ncondition (1) makes this the natural choice.\nIt is easy to show that any function solely of the combination\n\u0010\n\u00111/3\nu3 + 3s\n\nis a solution of Eq. (4). Thus, with initial condition (1), the distribution at high energies at some time s > 0 will be\n\u0011−p\n3(p − 1) \u0010\n1 + u3 + 3s ,\n(6)\nf ̃∞ (u, s) =\n4π\nEmploying this solution for f (v) in the full form of the\nRosenbluth potentials does not result in an identically zero ψ′′\nas we have assumed. However, for realistic p values, ψ′′ (v) is\nproportional to a large negative power of v, and so will be small\nin the high v regime of interest to us here. We therefore consider\nthis solution to be adequate for our approximate treatment.\nThe distribution f ̃∞ given by Eq. (6) is also the one that\nwould develop from our initial condition in the limit of zero ambient temperature if there was background plasma present in the\nsystem. For X-ray bremsstrahlung purposes, fast electron evolution is normally calculated in exactly this limit (e.g. Brown\n1971; Melrose & Brown 1976; see also Takakura & Kai 1966).\nf ̃ will be very close to f ̃∞ for large u but the differences will become more and more significant as u becomes comparable to the\nmean speed of the whole distribution. Ideally we would determine the exact form of f ̃ from Eq. (3) but we know nonetheless\nthat collisions drive the whole distribution towards an isothermal, Maxwell-Boltzmann form and that f ̃ will attain this form\nmore and more closely as s → ∞. f ̃∞ conserves neither electron\nenergy, since all electrons lose energy monotonically, nor number, since it implies an unphysical, non-zero flux of electrons out\nof the system at u = 0. In view of all this we should capture most\nof the essential physics of f ̃ by adding a Maxwell-Boltzmann\ncomponent to f ̃∞ , writing\nf ̃(u, s) = f ̃∞ (u, s) + f ̃MB (u, s)\n\u0011−p\n3(p − 1) \u0010\n=\n1 + u3 + 3s\n4π\nñ M (s) −u2 /T̃ (s)\n+ \u0010\n\u00113/2 e\nπT̃ (s)\n\n(7)\n\nHere ñ M (s) and T̃ (s) are the density and temperature of the\nMaxwellian component at time s, normalised to ntot and to\nmv20 /(2k) respectively. Clearly ñ M (0) = 0. ñ M (s) and T̃ (s) will\nbe determined for s > 0 by appealing to conservation of electron\nnumber and energy, as follows.\nWe rewrite Eq. (2) in dimensionless units:\nZ ∞\n4π\nf ̃(u, s)u2 du = 1\n(8)\n0\n\nEq. (7) in Eq. (8) immediately implies ñ M (s):\n\nwhere τ is a collision time, defined by\n4πǫ02 m2e v30\n\n3\n\nv30\nf (u, s)\nntot\n\nand added the subscript ∞ to emphasise that this solution holds\nstrictly in the high-velocity limit. The characteristic time τ could\n\nñ M (s) = 1 − (1 + 3s)1−p\n\n(9)\n\nEquation (9) describes the evolution over time of the density of\nthe thermal component of the overall distribution: as electrons\nare removed from the high-energy component they are added\nthe Maxwellian component, increasing its density, such that the\ntotal density of the system is conserved.\nFor this thermally insulated system, in which radiation and\nelectron-ion equilibration are neglected, the total energy density\nZ ∞\nme v 2\nE = 4π\nf (v, t)v2 dv\n2\n0\n\n\f4\n\nR. K. Galloway et al.: Thermalisation of self-interacting solar flare fast electrons\n\nmust also be constant. We introduce\nZ ∞\n2E\nẼ =\nu4 f ̃(u, s)du\n=\n4π\nme v20 ntot\n0\n\n0.01\n\n(10)\n\nThe last equality follows because E is constant so it may be evaluated at s = 0 using the initial condition (1).\nUsing (7) we can write the total energy in terms of T̃ (s):\nZ ∞\nẼ = 4π\nu4 f ̃(u, s)du\n0\nZ ∞ \u0010\n\u0011\nu4 f ̃∞ (u, s) + f ̃MB (u, s) du\n= 4π\n0\n\n3\n= (1 + 3s)5/3−p Ẽ + ñ M (s)T̃ (s)\n2\nSubstituting (9) in (11) and rearranging we find\n\"\n#\n2Ẽ 1 − (1 + 3s)5/3−p\nT̃ (s) =\n3 1 − (1 + 3s)1−p\n\n(11)\n\n1.  ́ 10-6\n1.  ́ 10-8\n\n0.1\n\n0.5\n\n1\n\n5\n\n10\n\nu\n\nFig. 1. Time evolution of the overall distribution function resulting from\nan initial power-law distribution with p = 2. Normalised evolution\ntimes of s = 0.1, 10, 100, 1 000, and 10 000 are shown with progressively heavier lines.\n\n(12)\n3.8\n\nFor early times, i.e. s ≪ 1,\n2Ẽ p − 5/3\nT̃ (s) ≈\n3 p−1\n\n0.0001\n\n(13)\n\nEntropy Η\n\n−\nΓ(p)\n\n5\n3)\n\n\u008e\nfHuL\n\n= (p − 1)\n\nΓ( 35 )Γ(p\n\n1\n\n3.7\n\n3.6\n\nso for p > 5/3 the temperature is well-behaved at t = 0, justifying our earlier disregard of its initial behaviour. Note that\nthe initial temperature of the Maxwellian component is determined completely by the parameters of the initial power-law,\nnamely its energy and number densities and power-law index.\nWe are not free to specify T̃ (0) independently. Electrons join\nthe Maxwellian component only as they slow down to u = 0.\nEnergy is being lost from all electrons included in f∞ , however,\nso T̃ needs to take a finite value as soon as s > 0, for energy to\nbe conserved.\nFor late times, i.e. s ≫ 1,\n\nFig. 2. Time evolution of the entropy of the overall distribution resulting\nfrom an initial power-law distribution with p = 2.\n\n2Ẽ\nT̃ (s) ≈\n(14)\n3\nso all the energy resides in the Maxwellian part of the distribution, i.e. the plasma has completely thermalised. From (12), (13)\nand (14) we see that the temperature of the Maxwellian component will increase monotonically as the plasma evolves, but only\nby a factor of order unity for any plausible value of p.\nThus, the overall, evolving plasma distribution is described\nby Eq. (7), with ñ M (s) given by Eq. (9) and T̃ (s) given by\nEq. (12). The initial distribution is a power-law with a lower\nturn-over. This thermalises, passing through intermediate stages\nwith a modified power-law and growing thermal component.\nEventually the power-law component diminishes completely,\nand the plasma is described by a purely thermal distribution.\nAlthough not a complete description, this approximate treatment\nwill be correct at high velocities and late times and clearly includes, at least qualitatively, the essential physics of the situation.\n\n3.2. Entropy\n\n3. Numerical illustrations; bremsstrahlung radiation\nIn this section we show numerical examples of the complete distribution function f ̃(u, s) and the resulting bremsstrahlung photon spectra, check numerically that entropy increases monotonically with time and address the neglect of radiation losses.\n\n3.5\n\n0\n\n2000\n\n4000\n\n6000\n\n8000\n\n10000\n\ns\n\n3.1. Distribution time evolution\n\nThe time evolution of the combined, overall distribution is\nshown in Fig. 1. As may be seen, the distribution begins as a\npower-law, flattening at low velocities. As time advances and the\nelectrons in the power-law begin to thermalise, the distribution\nat lower energies takes on Maxwellian form, and the power-law\ntail diminishes. At late times, the Maxwellian is dominant and\nonly a small power-law population remains, with a smooth intermediate transition to this regime from the initial condition.\n\nFor Eq. (7) to be a valid solution, we have to check that the entropy increases with time. The entropy of the distribution is given\nby\nZ ∞\nZ\n3\n ̃\n ̃\nf ln f d u = −\nf ̃(u, s) ln f ̃(u, s)4πu2du.\n(15)\nη(s) = −\n0\n\nFigure 2 shows a plot of the entropy of the electron population\nas a function of time for our example initial population with a\npower-law index of 2. As may be seen, the entropy does increase monotonically with time. Similar investigations of the\ntime-dependence of the entropy for power-laws ranging from\njust greater than 5/3 (the boundary of validity of the solution) to\n10 (steep), show that the entropy increase is smooth and monotonic over a range of appropriate power-law indices. Thus the\nsolution does satisfy the increasing entropy criterion.\n\n\fR. K. Galloway et al.: Thermalisation of self-interacting solar flare fast electrons\n\n3.3. Photon spectrum\n\nThe initial impetus for this work came from considerations of Xray production efficiency. Is the temporal evolution of hard X-ray\nemission in this scenario consistent with observations? We consider now the bremsstrahlung spectrum which would be emitted\nby our evolving electron population.\nLet ǫ denote photon energy and write\nǫ̃ =\n\n2ǫ\nme v20\n\nZ\n\n∞\n\ndσ\nv f (v, t) v2 dv,\n√\ndǫ\n2ǫ/me\n\n(16)\n\nwhere dσ/dǫ is the cross-section differential in photon energy\n(e.g. Koch & Motz 1959). Writing photon energy ǫ in units of\nme v20 /2 and\n2re2 σ̃0 (ǫ̃, u)\ndσ\n=\ndǫ\nǫ̃\nme v20\nwhere re is the classical electron radius, we find\nZ\n4π  ̃ ∞ 3  ̃\nj̃(ǫ̃) =\nJ √ u f (u, s)σ̃0 (ǫ̃, u)du\nǫ̃\nǫ̃\n\n0.01\n0.0001\n\nΕ\n1\n\n2\n\n5\n\n10\n\n20\n\n50\n\n100\n\nFig. 3. Time evolution of the emitted bremsstrahlung photon spectrum\nresulting from the thermalisation of an initial power-law distribution\nwith p = 2. Normalised evolution times of s = 0.1, 10, 100, 1 000 and\n10 000 are shown with progressively heavier lines.\n\n3.4. Neglect of radiation losses\n\nWith Eq. (17) we may also check the neglect of radiation losses\nin this discussion. In dimensionless units, the total energy loss\nrate R(s) to bremsstrahlung is\nZ ∞\nR(s) =\nǫ̃ j̃(ǫ̃)dǫ̃\n= 4π J ̃\n\n(17)\n\nJ ̃ = re2 v0 τntot\nand\nτ\nj\nntot\n\nNumerically, J ̃ = 6.1 × 10\nwhere E0 is the energy in keV of\nan electron of speed v0 .\nFigure 3 shows a plot of bremsstrahlung spectra from our\nelectron population with power-law index p = 2 (corresponding to a power-law in electron energy with a spectral index of\nδ = 2.5), plotted for photon energies 1 < ǫ̃ < 100, and for various values of s. We used the non-relativistic Bethe-Heitler crosssection (Koch & Motz 1959, expression 3BN(a)), for which\n\n\n√\n!2\n u + u2 − ǫ̃ \n1\n16 1 c\nlog \nσ̃0 (ǫ̃, u) =\n\n√\n3 137 v0 u2\nu − u2 − ǫ̃\n\n\n√\n!\n u + u2 − ǫ̃ \n9.95 1\n\n(18)\n=\nlog \n√\nE 0 u2\nu − u2 − ǫ̃\n−8\n\n1.  ́ 10-8\n\n0\n\nwhere the dimensionless combination\n\nj̃ =\n\nPhoton Emission Rate\n1\n\n1.  ́ 10-6\n\nFollowing the usual (thin target) formalism (e.g. Brown 1971)\nwe find that the rate of photon emission is per second per unit\nphoton energy per unit volume of the source region is\nj(ǫ) = 4πntot\n\n5\n\nE02\n\nThis cross-section yields at least the shape of the spectrum adequately in the 10s of keV regime.\nThe photon spectra reflect the distribution function behaviour shown in Fig. 1, displaying a smooth temporal and spectral transition from the initial condition, with a straight, powerlaw spectrum, to late times, where the Maxwellian dominates the\nspectrum and the power-law component is minimal. The powerlaw component hardens progressively with time.\n\nZ\n\n0\n\n∞\n\nu f ̃(u, s)\n3\n\nZ\n\nu2\n\nσ0 (ǫ̃, u)dǫ̃du\n\n(19)\n\n0\n\nwhere the last equality follows after substituting (17) and changing the order of integration. With cross-section (18) we may use\nthe integral\n\n\n√\nZ u2\n u + u2 − ǫ̃ \nlog \n dǫ̃ = 2u2\n√\n0\nu − u2 − ǫ̃\nto find that (19) becomes\n!Z ∞\n9.95\n ̃\nR(s) = 8π J\nu3 f ̃(u, s)du\nE0\n0\n\n(20)\n\nThe integral in (20) gives the mean speed. It can be evaluated\nexplicitly but it is enough to note that it varies only by a factor\nof order unity and is always O(1) (just as T̃ is, as shown in Eqs.\n(12) - (14). The total dimensionless electron energy content (10)\nis also O(1). If we take E0 = 10 keV, J ̃ = 5×10−6 and we can see\nimmediately, without any detailed time integration, that radiation\nlosses will only become cumulatively significant on times s of\norder 105 .\nFor low enough final temperatures atomic spectral lines will\ncontribute substantially to radiation. If the final temperature is in\nthe range 106 − 107 K the total radiation loss could be up to an\norder of magnitude greater, depending on source chemical abundances (Sutherland & Dopita 1993). Even in this case radiation\nlosses may be neglected at least up to s = 104 (independent of\ndensity, because s is expressed in collision times).\nClearly a significant increase in HXR production efficiency\nis possible. In the next section we look more closely at whether\nthe associated photon spectrum can reproduce observations.\n\n4. Comparison with observations\nIn the previous section we see the characteristic spectral behaviour of the kind of source we model here: high-energy spec-\n\n\f6\n\nR. K. Galloway et al.: Thermalisation of self-interacting solar flare fast electrons\n\nFig. 4. Reproduction of Fig. 3 from Lin et al. (1981). Hard X-ray spectra\nfrom a range of time intervals during the flare of 27 June 1980. The\nabsolute vertical scale corresponds to the uppermost spectrum in each\npanel. Each successive spectrum has been displaced downwards by two\ndecades to enhance its visibility. However, the relative scalings of the\nspectra have been preserved. The solid lines are fits by Lin et al., and\naid visual interpretation of the spectra. (Reproduced by permission of\nthe AAS.)\n\ntral hardening accompanied by the emergence of an isothermal spectrum at low photon energies. High-energy hardening\n(\"soft-hard-harder\" spectral behaviour) has been observed in\na significant minority of flares (Frost & Dennis 1971; Cliver\net al. 1986; Bai & Sturrock 1989; Hudson & Fárnı́k 2002).\nKiplinger (1995) found that around 15% of all flares display a\nsoft-hard-harder spectral progression. Observations also exist of\nflares in which incoherent gyrosynchrotron emission (Melnikov\n& Magun 1998; MacKinnon 2006) is consistent with high energy electrons undergoing progressive hardening, but X-ray detectors lacked the required sensitivity at the relevant high energies to provide corresponding hard X-ray data for these events.\nThis hardening is interpreted in terms of trapping of fast electrons in a low density, coronal region (e.g. Takakura & Kai 1966;\nBai & Ramaty 1979). It occurs in our model for exactly the same\nreason and on its own would give no decisive test. The simultaneous emergence of the late phase, high temperature component\n(Fig. 3) would be much more suggestive, however.\nLin et al. (1981) discovered a 'super-hot' (∼ 34 MK) thermal component of the hard X-ray spectrum emerging late in the\nimpulsive phase of the 27 June 1980 flare. These observations\nwere made with balloon-borne germanium detectors with 1 keV\nFWHM spectral response, which may be considered as precursors of the RHESSI detectors. The signature of such a superhot thermal source had been seen before as a slowly-decaying\nemission component at ∼ 20–25 keV in scintillation counter detectors, but their spectral resolution was too low to confirm its\nidentity as a thermal source. No imaging information was available for this event but such sources now appear to be a sub-class\nof coronal hard X-ray source (Krucker et al. 2008).\nFigure 4 shows a summary of the observed X-ray spectra\nfrom this event for a set of 15 time intervals over the duration of\nthe flare. These intervals are marked on Fig. 5, which shows the\nX-ray lightcurves for the event in a number of energy channels,\nas recorded by a scintillation counter also flown on the balloon.\nAs may be seen, the spectra initially have a power-law form, appearing as a straight line in the log-log plots from 10 to 100 keV.\nAs the event progresses, a departure from the straight powerlaw form may be seen, beginning in the lowest energies at interval 5. This departure grows increasingly prominent in later\nintervals, taking on a form which is well fitted by a Maxwellian\ncomponent (Lin et al. 1981), and by interval 10 it is clearly the\n\nFig. 5. Reproduction of Fig. 2 from Lin et al. (1981). Hard X-ray\nlightcurves for a range of energy channels during the flare of 27 June\n1980. The marked time intervals correspond to those in the spectral\nplots in Fig. 4. (Reproduced by permission of the AAS.)\n\ndominant component below 40 keV in the photon spectrum. The\nphoton energy at which the spectrum departs from the straight\npower-law into the Maxwellian form increases with advancing\ntime, rising from ∼ 20 keV at interval 5 to over 40 keV by interval 15.\nOverall these observations show similar behaviour to the\npredicted bremsstrahlung spectra from our model, as shown in\nFig. 3, with an initially power-law spectrum giving way to a\ngrowing Maxwellian component at low, but increasing, photon\nenergies as the flare progresses. Given the approximate character\nof our treatment, we do not attempt detailed spectral fitting; but\nthe qualitatively similar behaviour is clear.\nIn the model spectra, the mean intensity of the power-law,\nnon-thermal component decreases with time. In addition, variation in its gradient (spectral hardness) may be seen. Taken over\nthe whole spectrum, a broad characterisation of spectral hardness (as would be measured by low spectral resolution, preRHESSI instruments) would suggest that the spectrum softens, since the intensity at low energies is approximately constant but the intensity at high energies decreases. However, the\nportion of the spectrum which remains power-law in character\n(i.e. above ǫ ≈ 20) actually hardens, since lower energy electrons thermalise more readily. In a detector with sufficiently high\nspectral resolution, the power-law type portion of the spectrum\ncould be separately identified and it would be seen to progressively harden. Such behaviour appears consistent with the recent\nRHESSI study of Shao & Huang (2009), for instance.\nThe intensity of the non-thermal component for the 27 June\n1980 flare also decreases with time. However, the behaviour of\nits spectral hardness is less clear. As may be seen from Fig. 5, the\noverall flare event featured a number of hard X-ray bursts. (We\nmay consider each burst as a separate instance of the electron\nthermalisation process we explore in this paper.) Lin & Schwartz\n(1987) conducted a detailed study of the power-law spectra from\nthese bursts. They found that many displayed the more common\nsoft-hard-soft spectral progression (e.g. Hudson & Fárnı́k 2002;\nGrigis & Benz 2004), but some showed a progressive hardening.\nA \"super-hot\" component is not seen so cleanly in many flare\nspectra. Krucker et al. (2008), however, identify such phenom-\n\n\fR. K. Galloway et al.: Thermalisation of self-interacting solar flare fast electrons\n\nena with coronal hard X-ray sources, consistent with the picture\nwe develop here. Alexander & Metcalf (1997) conducted a detailed study of the Masuda et al. (1994) event as observed by the\nHXT instrument on the Yohkoh spacecraft (Kosugi et al. 1991).\nThey characterise this coronal event as also showing the emergence of a high temperature (∼ 40 MK) thermal component from\nan initially non-thermal source.\nFigure 6 shows an example of four RHESSI spectra of a\ncoronal source from various intervals over the duration of the\nocculted-footpoint flare of 4 April 2002 (Jiang et al. 2006). The\ntwo spectra in the upper panel of Fig. 6 show the initial powerlaw nature of the emission in the rise, or preheating, and impulsive phases of the flare. The lower panel shows the spectrum\nfrom approximately one minute after the impulsive phase observation, exhibiting a clear thermal component joining the hardening power-law. The lower panel also shows a spectrum from\napproximately two minutes later, in which the emission appears\nentirely thermal, with any remaining power-law component being lost in noise. The power-law spectral index undergoes progressive hardening over the duration of the first three intervals\nshown in Fig. 6, before showing an apparent abrupt softening\nbetween the third and fourth intervals (Jiang et al. 2006, Fig. 11).\nThe temperature of the fitted thermal component rises between\nthe second and third intervals, reaching a peak of approximately\n25 MK (Jiang et al. 2006, Fig. 11), before beginning to cool over\nthe remainder of the flare (by a cooling process which we do\nnot attempt to model). Thus, these observations also show qualitative similarity to our model. Jiang et al. 2006 also discuss 5\nother coronal sources in detail. All show the emergence of a thermal component from an initial power-law. The evolutions of the\nspectral indices of some of these flares are less clear: however,\nsome are clearly soft-hard-soft in nature.\nThe observations of the 27 June 1980 flare shown in Fig. 4\nspan a period of approximately 12 minutes. Around 3 minutes\nelapse between interval 1, in which the spectrum appears purely\npower-law in nature, and interval 10, by which time the thermal\ncomponent has become the dominant spectral feature. The coronal sources in the study of Jiang et al. (2006) feature an elapsed\ntime of 2 to 3 minutes between the onset of the flare and observations showing the presence of a distinct thermal component.\nAs may be seen from Fig. 3, the model bremsstrahlung spectra\nshow a clearly defined thermal component after a typical elapsed\n(normalised) time of s = 100. On selecting a coronal density of\nntot = 1010 cm−3 (Jiang et al. 2006), and v0 consistent with lowenergy cutoffs of 6–12 keV (in line with the values employed in\nGalloway et al. 2005; see also Kane et al. 1992), a value of 100\nfor s corresponds to real times of approximately 1 to 3 minutes,\nwhich are comparable to the evolution times of the observed flare\nelectrons.\n\n5. Efficiency of bremsstrahlung production\nAs noted above, the low radiative efficiency of the traditional,\ncold, thick target model leads directly to the high total energy\ncontent of flare nonthermal electrons. How much more efficient\nan X-ray source is the contained, self-interacting electron population? The previous section gives us some guidance as to the\nrelevant parameter regime.\nIn the cold, thick target model the high-energy form f ̃∞ ,\ngiven by Eq. (6) is assumed to hold exactly at all energies. The\nphoton flux with this assumption is given by\nZ\n4π  ̃ ∞ 3  ̃\nj̃tt (ǫ̃) =\n(21)\nJ √ u f∞ (u, s)σ̃0 (ǫ̃, u)du\nǫ̃\nǫ̃\n\n7\n\nFig. 6. Reproduction of Fig. 8 from Jiang et al. (2006). Hard X-ray spectra of the coronal source from four time intervals during the flare of 4\nApril 2002. The upper main panel shows the rise phase and the impulsive phase at the peak of HXR production. The lower main panel shows\nearly and late decay phases. The smaller panels show the residuals (in\nunits of the standard deviation) for thermal plus power-law model fits\nto the peak and early decay phase spectra. (Reproduced by permission\nof the AAS.)\n\nIn Figure 7 we compare the evolution in time of\nd j̃tt\ndǫ̃\n\nd j̃\ndǫ̃\n\nand\n\nfor photon energies ǫ̃ =4.5, 6.75 and 9. Again we use the\nnon-relativistic Bethe-Heitler cross-section. Multiplicative scaling constants depending on v0 have been neglected since we\nwish only to compare the time behaviour in the two cases, at different photon energies. This temporal behaviour underlines the\nfollowing findings.\nIntegrating d j̃tt /dǫ̃ over time, from s = 0 to ∞, gives a finite\nresult, the total thick target yield of photons at energy ǫ̃ (Brown\n1971). The relative efficiency of the self-interacting population\n\n\f8\n\nR. K. Galloway et al.: Thermalisation of self-interacting solar flare fast electrons\n\u008e\nΕ = 4.5`\n0.00003\n0.000025\n\n\u008e \u008e\ndj\u0090dΕ\n\n0.00002\n0.000015\n0.00001\n5  ́ 10-6\n0\n0\n\n50\n\n100\ns\n\u008e\nΕ = 6.75`\n\n150\n\n200\n\n\u008e \u008e\ndj\u0090dΕ\n\n8  ́ 10-6\n6  ́ 10-6\n4  ́ 10-6\n2  ́ 10-6\n\n6. Conclusions\n0\n\n50\n\n100\ns\n\u008e\nΕ = 9\n\n150\n\n200\n\n0\n\n50\n\n100\ns\n\n150\n\n200\n\n4  ́ 10-6\n\n3  ́ 10-6\n\u008e \u008e\ndj\u0090dΕ\n\nñ MB and T̃ and thus j̃ MB tend to finite values as s → ∞,\nso the total photon flux in any photon energy range may become\narbitrarily large if we integrate over longer and longer times. The\nidealisation of a thermally isolated system thus complicates the\ncomparison with the cold, thick target model.\nWith an appropriately chosen time interval, we can evaluate\nthe relative X-ray efficiency of the self-interacting electron population by numerical evaluation of Eq. (22) (We used the Kramers\ncross-section σ̃0 ∼ u−2 here because the triple integrals in the numerator and denominator of (22) may then be simplifed to single\nor double integrals, speeding up numerical evaluation. Since we\nonly evaluate ratios of fluxes this should not result in any serious error). Taking the flare of 24 June 1980 (Lin et al. 1981) as\na guide, we adopt p = 2 and fix v0 by demanding that the final temperature is 24 MK, in agreement with observations. Then\nme v20 /2 = 2.7 keV. If we adopt for illustration ntot = 1010 cm−3\nthen τ = 0.14 s. If we then compare the fluxes over a period of\n20 s, characteristic of impulsive phase hard X-rays (i.e. until s =\n140), and over a photon energy range between ǫ1 =10 keV and\nǫ2 = 100 keV, then we find R = 7. Extending the comparison to\n30 s leads to R = 10. The number of electrons needed would be\nsmaller than that demanded by the cold thick target by a similar\nfactor.\n\n2  ́ 10-6\n\n1  ́ 10-6\n\nd j̃\nFig. 7. Time evolution of the photon emission rates dǫ̃\n(self-interacting\nd j̃tt\nelectrons: solid line) and dǫ̃ (cold, thick target: dashed line) for photon\nenergies of (top to bottom) ǫ̃ = 4.5, 6.75 and 9.\n\nas an X-ray source may be described numerically by\nR s R ǫ̃2\nj̃(ǫ̃, s′ )dǫ̃ds′\n0 ǫ̃\nR(ǫ̃1 , ǫ̃2 , s) = R s R ǫ̃12\nj̃ (ǫ̃, s′ )dǫ̃ds′\n0 ǫ̃1 tt\nR s R ǫ̃2\nj̃ MB (ǫ̃, s′ )dǫ̃ds′\n0 ǫ̃\n= 1 + R s R1 ǫ̃2\nj̃tt (ǫ̃, s′ )dǫ̃ds′\n0 ǫ̃\n1\n\n(22)\n\nwhere we have introduced j̃ MB to stand for the photon flux from\nthe Maxwell-Boltzmann component of f ̃ on its own. From the\nsecond line of (22) we see immediately that the photon flux from\nthe self-interacting electron population is always greater, in any\nphoton energy range, than from the cold thick target.\n\nWe have developed an approximate treatment of the thermalisation of a power-law population of electrons as a result of selfinteractions in the absence of an ambient background plasma.\nThe growth of the resulting thermal population is governed by\nthe conditions of particle and energy conservation for the isolated plasma we consider. We have seen that our solution for\nthe overall electron distribution function, as given by Eq. (7),\nsatisfies the basic stipulations of the problem, i.e. a smooth transition from initial power-law to Maxwellian-dominated regimes,\nwith relaxation occurring by collisions between the fast particles, and with monotonically increasing entropy. This solution\ncorresponds to an evolving electron population which is more\nefficient in producing hard X-rays than the cold, thick target\nmodel. While a precise evaluation of the specific efficiency enhancement afforded by this process is hampered by some of the\nassumptions made in this treatment, we may nevertheless make\nan approximate comparison to the cold, thick target situation.\nWe find that our model requires approximately a factor of 7 - 10\nfewer accelerated electrons than the cold, thick target model to\ngenerate an equivalent hard X-ray photon flux. Thus, our model\nmay alleviate some of the existing heavy requirements on the\nflare fast electron acceleration mechanism.\nEq. (10) predicts a simple relationship between the initial\nspectral index, measured at early times before the spectrum has\nthermalised, and the temperature of the thermal component that\nbecomes dominant late in the evolution of the source. Both quantities measure the mean energy per particle and only conservation of total energy is needed for this relationship to be satisfied.\nWith a large enough sample of sources this would provide a very\ngood test of this picture.\nMore generally, many properties of the model are fixed by p\nand v0 . The density is only needed to normalise to a given, total\nemission measure, and to determine the (dimensional) timescale\nfor evolution.\nThe self-interacting source population's efficiency is limited\nin practice by the timescales for radiative or conductive energy\nloss, and by the validity of our assumption of perfect trapping.\nThe latter may not be quite as unrealistic as it appears. Krucker\n\n\fR. K. Galloway et al.: Thermalisation of self-interacting solar flare fast electrons\n\net al. (2009) report the observation of an apparently contained\nsource in which nonthermal electrons are dominant. A detailed\ncomparison of our model with at least the decay phase of this\nevent will be carried out in future work. Electrons accelerated at\nor near a magnetic null or region of very low field strength might\nbe naturally contained near the acceleration site by the inevitably\nvery high mirror ratios (Fletcher & Martens 1998).\nA full evaluation of the validity of this approximate analytical treatment would depend on comparisons with a numerical\nsolution using the complete expressions for the Rosenbluth potentials, which would be a non-linear problem. However, the\nsuggestive similarity of the predictions of this initial model to\nsome aspects of observed spectra indicates that a more complete\ntreatment, in company with corresponding flare models, would\nbe worth pursuing. Such an approach, incorporating additional\nproperties such as energy losses from the thermal component,\nwould facilitate a detailed, quantitative comparison between this\nmodel and the cold, thick target model. The consequences for\nthe flare energy budget could then be investigated more fully.\nSuch enhancements notwithstanding, these initial results nevertheless qualitatively reproduce the growth of a thermal component from a non-thermal, power-law HXR source over comparable timescales to those seen in some flare observations. Thus,\nthey may provide useful insight into the evolution of flare electrons, particularly in coronal sources and those featuring a softhard-harder spectral progression.\nAcknowledgements. During this work, R.K.G. was supported by a U.K. Particle\nPhysics and Astronomy Research Council CASE Award and grant number\nPP/C000234/1. The work by P.H. was funded by the U.K. Engineering and\nPhysical Sciences Research Council. Figures 4 & 5 and Fig. 6 by kind permission\nof R. P. Lin and Y. W. Jiang respectively and by the AAS. We thank Christina\nBurge for a careful reading of the manuscript and the referee for comments that\nresulted in improved presentation.\n\nReferences\nAlexander, D. & Metcalf, T. R. 1997, ApJ, 489, 442\nBai, T. & Ramaty, R. 1979, ApJ, 227, 1072\nBai, T. & Sturrock, P. A. 1989, ARA&A, 27, 421\nBattaglia, M. & Benz, A. O. 2006, A&A, 456, 751\nBattaglia, M. & Benz, A. O. 2007, A&A, 466, 713\nBrown, J. C. 1971, Sol. Phys., 18, 489\nBrown, J. C. & Emslie, A. G. 1988, ApJ, 331, 554\nBrown, J. C., Turkmani, R., Kontar, E. P., MacKinnon, A. L., Vlahos, L. 2009,\nA&A, 508, 993\nCargill, P. J., Mariska, J. T., & Antiochos, S. K. 1995, ApJ, 439, 1034\nCliver, E. W., Dennis, B. R., Kiplinger, A. L., et al. 1986, ApJ, 305, 920\nConway, A. J., MacKinnon, A. L., Brown, J. C., & McArthur, G. 1998, A&A,\n331, 1103\nFletcher, L. & Martens, P. 1998, ApJ, 505, 418\nFrost, K. J. & Dennis, B. R. 1971, ApJ, 165, 655\nGalloway, R. K., MacKinnon, A. L., Kontar, E. P., & Helander, P. 2005, A&A,\n438, 1107\nGrigis, P. C. & Benz, A. O. 2004, A&A, 426, 1093\nHelander, P. & Sigmar, D. J. 2002, Collisional Transport in Magnetized Plasmas\n(Cambridge University Press)\nHoyng, P., Brown, J. C., van Beek, H. F. 1976, Sol. Phys., 48, 197\nHudson, H. S. & Fárnı́k, F. 2002, in ESA SP-506: Solar Variability: From Core\nto Outer Frontiers, 261–264\nJiang, Y. W., Liu, S., Liu, W., & Petrosian, V. 2006, ApJ, 638, 1140\nKane, S. R., McTiernan, J., Loran, J., et al. 1992, ApJ, 390, 687\nKašparová, J. & Karlický, M. 2009 A&A, 497, L13\nKiplinger, A. L. 1995, ApJ, 453, 973\nKoch, H. W. & Motz, J. W. 1959, Reviews of Modern Physics, 31, 920\nKosugi, T., Masuda, S., Makishima, K., et al. 1991, Sol. Phys., 136, 17\nKrucker, S., Battaglia, M., Cargill, P. J., et al. 2008, A&A Rev., 16, 155\nKrucker,S., Hudson, H. S., Glesener, L., White, S. M., Masuda, S., Wuelser, J.-P.,\nLin, R. P. 2009, ApJ, submitted\nLin, R. P., Dennis, B. R., Hurford, G. J., et al. 2002, Sol. Phys., 210, 3\nLin, R. P. & Hudson, H. S. 1976, Sol. Phys., 50, 153\n\n9\n\nLin, R. P. & Schwartz, R. A. 1987, ApJ, 312, 462\nLin, R. P., Schwartz, R. A., Pelling, R. M., & Hurley, K. C. 1981, ApJ, 251, L109\nMacKinnon, A. L. 2006, Washington DC American Geophysical Union\nGeophysical Monograph Series, 165, 157\nMaksimovic, M., Pierrard, V., Riley, P. 1997, Geophys. Res. Lett.24, 1151\nMasuda, S., Kosugi, T., Hara, H., Tsuneta, S., & Ogawara, Y. 1994, Nature, 371,\n495\nMelnikov, V. F. & Magun, A. 1998, Sol. Phys., 178, 153\nMelrose, D. B. & Brown, J. C. 1976, MNRAS, 176, 15\nMontgomery, D. C. & Tidman, D. A. 1964, Plasma Kinetic Theory (McGrawHill)\nOhki, K., Takakura, T., Tsuneta, S., & Nitta, N. 1983, Sol. Phys., 86, 301\nPetrosian, V., Donaghy, T. Q., & McTiernan, J. M. 2002, ApJ, 569, 459\nRosenbluth, M. N., MacDonald, W. M., & Judd, D. L. 1957, Phys. Rev., 107\nSaint-Hilaire, P. & Benz, A. O. 2005, A&A, 435, 743\nShao, C. & Huang, G., ApJ694, L162\nSpitzer, L., 1956, Physics of Fully Ionized Gases, (Interscience, New York)\nSutherland, R. S. & Dopita, M. A., ApJS88, 253\nTakakura, T. & Kai, K. 1966, PASJ, 18, 57\nTrubnikov, B. A. 1965, in Reviews of Plasma Physics, ed. M. A. Leontovich\n(Consultants Bureau, New York)\nTsuneta, S., Takakura, T., Nitta, N., et al. 1983, Sol. Phys., 86, 313\nTurkmani, R., Vlahos, L., Galsgaard, K., Cargill, P. J., & Isliker, H. 2005, ApJ,\n620, L59\nVeronig, A. M. & Brown, J. C. 2004, ApJ, 603, L117\nVilmer, N., Trottet, G., & MacKinnon, A. L. 1986, A&A, 156, 64\nWheatland, M. S. & Melrose, D. B. 1995, Sol. Phys., 185, 283\n\n\f"}