{"id": "http://arxiv.org/abs/0905.4440v1", "guidislink": true, "updated": "2009-05-27T14:38:28Z", "updated_parsed": [2009, 5, 27, 14, 38, 28, 2, 147, 0], "published": "2009-05-27T14:38:28Z", "published_parsed": [2009, 5, 27, 14, 38, 28, 2, 147, 0], "title": "Accretion of a massive magnetized torus on a rotating black hole", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0905.4695%2C0905.3668%2C0905.4643%2C0905.2710%2C0905.3066%2C0905.0602%2C0905.1492%2C0905.0841%2C0905.1835%2C0905.3867%2C0905.1510%2C0905.3578%2C0905.4322%2C0905.2897%2C0905.0817%2C0905.4377%2C0905.2154%2C0905.2253%2C0905.3966%2C0905.3613%2C0905.4281%2C0905.3135%2C0905.0901%2C0905.4130%2C0905.2807%2C0905.0139%2C0905.4939%2C0905.0474%2C0905.4611%2C0905.3553%2C0905.2569%2C0905.0319%2C0905.1538%2C0905.4198%2C0905.3563%2C0905.0904%2C0905.4720%2C0905.1398%2C0905.2236%2C0905.3054%2C0905.2646%2C0905.1136%2C0905.4462%2C0905.4186%2C0905.4117%2C0905.2494%2C0905.0443%2C0905.1563%2C0905.0185%2C0905.2963%2C0905.2759%2C0905.1545%2C0905.3574%2C0905.1268%2C0905.3306%2C0905.1294%2C0905.0614%2C0905.0832%2C0905.1809%2C0905.1801%2C0905.1631%2C0905.3917%2C0905.2291%2C0905.0176%2C0905.4015%2C0905.4827%2C0905.3228%2C0905.0316%2C0905.4211%2C0905.3661%2C0905.4722%2C0905.4440%2C0905.1336%2C0905.0441%2C0905.1104%2C0905.3057%2C0905.2454%2C0905.4534%2C0905.4370%2C0905.0824%2C0905.0042%2C0905.1710%2C0905.3521%2C0905.1913%2C0905.4764%2C0905.2031%2C0905.4236%2C0905.0691%2C0905.1722%2C0905.2791%2C0905.4011%2C0905.1875%2C0905.3186%2C0905.2270%2C0905.1292%2C0905.0905%2C0905.0716%2C0905.1736%2C0905.0770%2C0905.4494%2C0905.4311&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Accretion of a massive magnetized torus on a rotating black hole"}, "summary": "We present numerical simulations of the axisymmetric accretion of a massive\nmagnetized plasma torus on a rotating black hole. We use a realistic equation\nof state, which takes into account neutrino cooling and energy loss due to\nnucleus dissociations. We simulated various magnetic field configurations and\ntorus models, both optically thick and thin for neutrinos. It is shown that the\nneutrino cooling does not significantly change either the structure of the\naccretion flow or the total energy release of the system. The calculations\nevidence heating of the wind surrounding the collapsar by the shock waves\ngenerated at the jet-wind border. This mechanism can give rise to a hot corona\naround the binary system like SS433.\n  Angular momentum of the accreting matter defines the time scale of the\naccretion. Due to the absence of the magnetic dynamo in our calculations, the\ninitial strength and topology of the magnetic field determines magnetization of\nthe black hole, jet formation properties and the total energy yield. We\nestimated the total energy transformed to jets as $1.3\\times 10^{52}$ {ergs}\nwhich was sufficient to explain hypernova explosions like GRB 980425 or GRB\n030329.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0905.4695%2C0905.3668%2C0905.4643%2C0905.2710%2C0905.3066%2C0905.0602%2C0905.1492%2C0905.0841%2C0905.1835%2C0905.3867%2C0905.1510%2C0905.3578%2C0905.4322%2C0905.2897%2C0905.0817%2C0905.4377%2C0905.2154%2C0905.2253%2C0905.3966%2C0905.3613%2C0905.4281%2C0905.3135%2C0905.0901%2C0905.4130%2C0905.2807%2C0905.0139%2C0905.4939%2C0905.0474%2C0905.4611%2C0905.3553%2C0905.2569%2C0905.0319%2C0905.1538%2C0905.4198%2C0905.3563%2C0905.0904%2C0905.4720%2C0905.1398%2C0905.2236%2C0905.3054%2C0905.2646%2C0905.1136%2C0905.4462%2C0905.4186%2C0905.4117%2C0905.2494%2C0905.0443%2C0905.1563%2C0905.0185%2C0905.2963%2C0905.2759%2C0905.1545%2C0905.3574%2C0905.1268%2C0905.3306%2C0905.1294%2C0905.0614%2C0905.0832%2C0905.1809%2C0905.1801%2C0905.1631%2C0905.3917%2C0905.2291%2C0905.0176%2C0905.4015%2C0905.4827%2C0905.3228%2C0905.0316%2C0905.4211%2C0905.3661%2C0905.4722%2C0905.4440%2C0905.1336%2C0905.0441%2C0905.1104%2C0905.3057%2C0905.2454%2C0905.4534%2C0905.4370%2C0905.0824%2C0905.0042%2C0905.1710%2C0905.3521%2C0905.1913%2C0905.4764%2C0905.2031%2C0905.4236%2C0905.0691%2C0905.1722%2C0905.2791%2C0905.4011%2C0905.1875%2C0905.3186%2C0905.2270%2C0905.1292%2C0905.0905%2C0905.0716%2C0905.1736%2C0905.0770%2C0905.4494%2C0905.4311&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present numerical simulations of the axisymmetric accretion of a massive\nmagnetized plasma torus on a rotating black hole. We use a realistic equation\nof state, which takes into account neutrino cooling and energy loss due to\nnucleus dissociations. We simulated various magnetic field configurations and\ntorus models, both optically thick and thin for neutrinos. It is shown that the\nneutrino cooling does not significantly change either the structure of the\naccretion flow or the total energy release of the system. The calculations\nevidence heating of the wind surrounding the collapsar by the shock waves\ngenerated at the jet-wind border. This mechanism can give rise to a hot corona\naround the binary system like SS433.\n  Angular momentum of the accreting matter defines the time scale of the\naccretion. Due to the absence of the magnetic dynamo in our calculations, the\ninitial strength and topology of the magnetic field determines magnetization of\nthe black hole, jet formation properties and the total energy yield. We\nestimated the total energy transformed to jets as $1.3\\times 10^{52}$ {ergs}\nwhich was sufficient to explain hypernova explosions like GRB 980425 or GRB\n030329."}, "authors": ["Maxim V. Barkov", "Anton N. Baushev"], "author_detail": {"name": "Anton N. Baushev"}, "author": "Anton N. Baushev", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.newast.2010.07.001", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0905.4440v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0905.4440v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "11 pages, 9 figures, submitted to MNRAS", "arxiv_primary_category": {"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0905.4440v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0905.4440v1", "journal_reference": "New Astron.16:46-56,2011", "doi": "10.1016/j.newast.2010.07.001", "fulltext": "Mon. Not. R. Astron. Soc. 000, 000–000 (0000)\n\nPrinted 13 November 2018\n\n(MN LATEX style file v2.2)\n\narXiv:0905.4440v1 [astro-ph.HE] 27 May 2009\n\nAccretion of a massive magnetized torus on a rotating\nblack hole\nMaxim V. Barkov1,2 , Anton N. Baushev3?\n1 Department\n\nof Applied Mathematics, The University of Leeds, Leeds, LS2 9GT\nResearch Institute, 84/32 Profsoyuznaya Street, Moscow 117997, Russia\n3 Bogoliubov Laboratory of Theoretical Physics, Joint Institute for Nuclear Research\n141980 Dubna, Moscow Region, Russia\n2 Space\n\nReceived/Accepted\n\nABSTRACT\n\nWe present numerical simulations of the axisymmetric accretion of a massive magnetized plasma torus on a rotating black hole. We use a realistic equation of state,\nwhich takes into account neutrino cooling and energy loss due to nucleus dissociations.\nWe simulated various magnetic field configurations and torus models, both optically\nthick and thin for neutrinos. It is shown that the neutrino cooling does not significantly change either the structure of the accretion flow or the total energy release of\nthe system. The calculations evidence heating of the wind surrounding the collapsar\nby the shock waves generated at the jet-wind border. This mechanism can give rise to\na hot corona around the binary system like SS433.\nAngular momentum of the accreting matter defines the time scale of the accretion.\nDue to the absence of the magnetic dynamo in our calculations, the initial strength\nand topology of the magnetic field determines magnetization of the black hole, jet\nformation properties and the total energy yield. We estimated the total energy transformed to jets as 1.3 × 1052 ergs which was sufficient to explain hypernova explosions\nlike GRB 980425 or GRB 030329.\nKey words: gamma-rays: bursts, methods: numerical, (magnetohydrodynamics)\nMHD, black hole physics.\n\n1\n\nINTRODUCTION\n\nIn spite of significant progress in recent years, the nature of\ngamma-ray bursts (GRB), discovered by Klebesadel et al.\n(1973) more than 30 years ago, is still enigmatic. Although\nthe light curves and emission spectra of GRBs are very diverse, they seem to split into two groups of possibly different origin: long bursts (∆t > 2 s) with a softer spectrum and short bursts (∆t < 2 s) with a harder spectrum\n(Mazets & Golenetskii 1981; Kouveliotou et al. 1993; Fishman & Meegan 1995). The long GRBs are often believed\nto be associated with star-formation regions (Bloom et al.\n2002; Fruchter et al. 2006; Blinnikov et al. 2005). Only these\nregions can host massive stars that have astronomically very\nshort lifetime and die soon after the birth. In fact, recent observations have provided strong arguments in favour of the\nconnection of GRBs with the deaths of massive stars. Light\ncurves of many GRB optical afterglows show features inher-\n\n?\n\nE-Mail: bmv@maths.leeds.ac.uk (MVB); baushev@gmail.com\n(ANB)\n\nent in the supernovae events; moreover, several long GRBs\nhave been firmly associated with particular supernovae, the\nmost popular examples being GRB 980425 and SN 1998bw\n(Soffitta 1998; Galama et al. 1998; Pian et al. 2000). Even\nmore convincing evidence exists in the case of the low red\nshift GRB 030329 (z = 0.1685; Greiner et al. (2003)) and\nits associated supernova, SN 2003dh (Matheson et al. 2003;\nHjorth et al. 2003; Sokolov et al. 2003). The spectra of these\nsupernovae show exceptionally broad emission lines indicating abnormally high velocity of the ejecta, typical of the\nrecently proposed \"hypernovae\" class objects.\nThe most popular model of the central engine of these\nsources is based on the \"failed supernova\" stellar collapse\nscenario implying that the iron core of the progenitor star\nforms a black hole (Woosley 1993). If the progenitor does\nnot rotate, its collapse is likely to happen 'silently' until\nall the star has been swallowed up by the black hole. If,\nhowever, the specific angular momentum of the equatorial\npart of the stellar envelope exceeds that of the last stable\norbit of the black hole, then the collapse becomes highly\nanisotropic. While in the polar region it may proceed more\n\n\f2\n\nM. V. Barkov & A. N. Baushev\n\nor less uninhibited, the equatorial layers form a dense and\nmassive accretion disk. Then the collapse of the layers is delayed, and the gravitational energy released in the disk can\nbe very large and drive GRB outflows, predominantly in the\npolar directions where mass density of the accreting matter\ncan be much lower (MacFadyen & Woosley 1999). However, the actual process responsible for the GRB outflows\nis not established and remains a subject of ongoing investigations. The main mechanisms proposed to explain GRB\noutflows are neutrino pair annihilation heating (Popham\net al. 1999; MacFadyen & Woosley 1999; Aloy et al. 2000),\nmagnetized disk wind (Blandford & Payne 1982; Uzdensky\n& MacFadyen 2006), and magnetic braking of the central\nblack hole rotation (Blandford & Znajek 1977; Barkov &\nKomissarov 2008a).\nHigh-precision self-consistent models of disk dynamics\nand neutrino propagation are required in order to obtain\nreliable results in the neutrino-driven supernova explosion\ntheory. By now only relatively crude calculations have been\ncarried out, and they show that the neutrino heating need\nnot have a dominant role. Birkl et al. (2007) studied the\nheating rate due to annihilation of neutrinos emitted by neutrinospheres of various prescribed geometries and temperatures. The energy deposition rates obtained in this paper\nlie in the range (0.07 − 27) × 1049 / erg/s, and the typical\nannihilation efficiency seems to be rather low, about 10−3 .\nNeutrino heating from a geometrically thin standard accretion disk (Shakura & Sunyaev 1973) is calculated in a recent\narticle by Zalamea & Beloborodov (2008). It is shown that\nthe process efficiency strongly depends on the rotation parameters of the black hole and rapidly decreases with the\ndistance as r−4.7 . Other aspects of the collapsar model were\nconsidered in Baushev & Chardonnet (2009). Shibata et al.\n(2007) carried out general relativistic MHD simulations of\naccretion disks with the masses (0.1 − 0.4)M . They found\nthat the disk opacity for neutrinos was high, resulting in low\n(' 0.01 − 0.02) efficiency of neutrino emission itself, as most\nneutrinos generated in the disk could not escape from it and\naccreted in the black hole. Nagataki et al. (2007) considered both neutrino heating and cooling in their Newtonian\nsimulations of collapsars. They concluded that the neutrino\nenergy deposition was insufficient to drive GRB explosions\nand that the magnetic mechanism was more promising.\nIn the last few years the role of magnetic field in driving\nthe black hole accretion and relativistic outflows has been\na subject of active investigations via numerical simulations,\nthat produced numerous interesting and important results\n(Proga et al. 2003; De Villiers et al. 2003; Hawley et al.\n2006; McKinney & Gammie 2004; McKinney 2005, 2006;\nMcKinney & Narayan 2007; Beckwith et al. 2008a,b; Nagataki 2009; McKinney & Blandford 2009). In these studies\nthe initial distribution described a keplerian disk or equilibrium torus threaded with a relatively weak poloidal field,\nwhose lines followed the iso-density or iso-pressure contours\nof the disk. The disk accretion was found to be driven by\nmagnetic stresses via development of magneto-rotational instability (MRI) (Velikhov 1959; Chandrasekhar 1960; Balbus & Hawley 1991). In addition to the disk, the numerical\nsolution considered two other generic structures - the magnetized disk corona and the highly magnetized polar funnel that hosted the relativistic outflow from the black hole.\nThese studies applied simple adiabatic equations of state\n\nand did not take into account effects of radiative cooling\nthat may be small for some types of Active Galactic Nuclei,\nbut not for disks of collapsing stars.\nRecently Shibata et al. (2007) have carried out twodimensional general relativistic MHD simulations in Kerr\nmetrics with a realistic equation of state and taking into\naccount the neutrino cooling, but the physical time span of\ntheir computations was rather short, only ' 0.06 s.\nIn this article, we model the situation (similar to Beckwith et al. (2008a)) when a massive stellar core collapses and\nthe outer envelop forms a massive accreting torus. In section\n2, we consider physical processes, in section 3 - initial conditions, in section 4 - results, section 5 is the discussion.\n\n2\n2.1\n\nPHYSICAL PROCESSES\nEquation of state.\n\nFor the simulations we use the equation of state\nσT 4\n,\n(1)\n3\nwhere k is the Boltzmann constant, σ is the radiation energy\ndensity constant, nb = ρ/mp is concentration of baryons,\nmp is the mass of proton, P is the pressure, ρ is the density\nand T is the temperature; P0 (ρ) describes the ground level\nfor the cold degenerate matter, the expression for P0 (ρ) is\nan approximation of the table function from Baym et al.\n(1971b,a); Malone et al. (1975).\nThe specific energy (per mass unit) was defined thermodynamically as\nPg ≡ P (ρ, T ) = P0 (ρ) + nb kT +\n\n\u000f = \u000f0 (ρ) +\n\nσT 4\n3kT\n+\n.\n2mp\nρ\n\n(2)\n\nThe value of \u000f0 (ρ) was taken from Bisnovatyi-Kogan\n(2001). This equation of state allows us to deal with highdensity matter. A more accurate EOS is significantly more\nexpensive in calculations, while the disregarding of the\ne+ e− -pair component in the plasma, for instance, can give\na relative error in definition of the temperature less than 0.3\nat high temperatures (Bisnovatyi-Kogan 2001).\n2.2\n\nNeutrino cooling\n\nOn the grounds discussed in the introduction we ignore effects of neutrino heating in our simulations and take into\naccount only the energy loss due to emission of neutrinos.\nApproximation formulas for the cooling rates due to e+ e−\npair annihilation Qp , neutrino photo-production Qph , and\nplasma mechanism Qpl are taken from Schinder et al. (1987),\nthe cooling rate due to URCA processes Qu - from Ivanova\net al. (1969), and the cooling rate due to synchrotron neutrino emission Qs - from Bezchastnov et al. (1997):\nFν (ρ, T ) = Qp + Qph + Qpl + Qu + Qs .\n\n(3)\n\nThe neutrino cooling is introduced by the source term in the\nenergy-momentum equation\n√\n√\n(4)\n∂ν ( −gTμν ) = −gSuμ ,\nwhere uν is the plasma four-velocity, g is the determinant of\nthe metric tensor, and S is the cooling rate as measured in\nthe fluid frame.\n\n\fAccretion of a massive magnetized torus on a rotating black hole\n\n3\n\nFigure 1. Initial conditions for the Low torus momentum (upper left panel), Quadrupole 1 (upper right panel), and Quadrupole 2 (lower\npanels) models. Initial distribution of the density logarithm and the initial magnetic field are shown by colours and lines, respectively.\n\nOne of the aims of our research was the investigation of\nsensitivity of the torus accretion model to the neutrino cooling processes. We compare two cases: with no cooling at all\nand the optically thin case with neutrino cooling. The first\ninstance is the most popular (Gammie et al. 2004; McKinney & Gammie 2004; McKinney & Narayan 2007; Hawley\net al. 2006; Beckwith et al. 2008b) and less realistic. The\nsecond instance well suits for a light torus with the mass\nof a few per cent of the solar. It could be realized when\ntwo neutron stars or a neutron star and a black hole merge.\nThe intermediate optical depth case is considered in Barkov\n(2008) and can be suitable for a collapsar model when the\ndisk mass reaches several solar masses.\n\n3\n\n3.1\n\nSIMULATION SETUP AND THE\nDESCRIPTION OF CALCULATIONAL\nMODELS\nGeneral consideration\n\nWe make our calculation in the ideal relativistic MHD approximation using an upwind conservative scheme that is\nbased on a linear Riemann solver and the constrained transport method to evolve the magnetic field. The details of\nthis numerical method and its testing results are expounded\nin Komissarov (1999); Komissarov (2004b); Komissarov\n(2006).\nThe gravitational attraction of the black hole is introduced via Kerr metric in the Kerr-Schild coordinates,\n{φ, r, θ}. We set the black hole mass as MBH = 10M which\ncorresponds to rg = 14.847 km (we define rg ≡ GMBH /c2 ).\n\n\f4\n\nM. V. Barkov & A. N. Baushev\n\nFigure 2. Time evolution of the magnetic flux Ψ through the sphere of radius r = 4.7rg (left panel) and through the horizon (right\npanel) in the case of the Low torus momentum. The fluxes at the moments t = 4.96 * 10−4 s., t = 0.0248 s., t = 0.0495 s., t = 0.0991 s.,\nt = 0.346 s. are represented by solid, dashed, dot-dashed, dotted, and three-dots-dashed lines, respectively.\n\nThe two-dimensional axisymmetric computational\n√ domain is\n(rin < r < rout , 0 ≤ θ ≤ π), where rin ≡ (1 + 1 − a2 /2) rg ,\n2\nis the dimensionless angular momentum\na ≡ cJBH /GMBH\nof the black hole (JBH is the black hole angular momentum), and rout ≡ 200rg ' 2969 km. We adopt free-outflow\nas the outer and the inner boundary conditions. The inner\nboundary is located just inside the event horizon and adopts\nthe free-flow boundary conditions. It is worthy of notice that\nthe inner boundary is inside of the outer event horizon - this\nchoice is possible since the horizon coordinate singularity is\nabsent in the Kerr-Schild coordinates. The total mass within\nthe domain is small (less than 25%) as compared with the\nmass of the black hole, which allows us to ignore its selfgravity. The grid is uniform over θ, where it has 320 cells,\nand is almost uniform over log(r), where it has 459 cells, the\nlinear size of each cell being the same in both directions.\nAs the initial distribution we consider an equilibrium\ntorus (Fishbone & Moncrief 1976; Abramowicz et al. 1978;\nKomissarov 2006) which is a \"torus\" of plasma with the\nblack hole in the centre. The value of the specific angular\nmomentum l0 determines the total effective potential which\ncan be written as\n ̨  ̨\n1  ̨ ̨ L  ̨ ̨\nln  ̨  ̨ ,\n2\nA\n\n(5)\n\nL = gtφ gtφ − gtt gφφ\n\n(6)\n\nA = gφφ + 2l0 gtφ + l02 gtt\n\n(7)\n\nW (r, θ) =\nwhere\n\nand\n\nOur numerical scheme cannot operate with vacuum. To\navoid this difficulty, we have to introduce minimum pos-\n\nFigure 5. Time evolution of the maximum of the magnetic flux\nΨ through the horizon for the models: Low torus momentum\n(dashed line), Neutrino cooling (solid line), and Quadrupole 2\n(dot-dashed-line)\n\nsible values of the density and pressure that limit how small\nthey can be. We also check the magnetic field and do not\nallow it to drop below the value defined by the equations\n1 B2\n1 B2\nρmin ≤\nand pmin ≤\n. For the magnetization\n2\n6 8πc\n100 8π\ntypical of the task considered these inequalities are usually\nsatisfied with a margin of three orders. The magnetic field\nstrength is limited by the pair production by the neutrinoantineutrino annihilation and the Compton up scattering\npair production (Beskin et al. 1992).\n\n\fAccretion of a massive magnetized torus on a rotating black hole\n\n5\n\nFigure 3. Distribution of sign(Br )(|Br |/1016 G)1/4 (Br is the radial component of the magnetic field). The upper panel represents the\ndistribution at the moment t = 0.208 s. for the central part of the Low torus momentum model (left picture), general view of the Low\ntorus momentum model (central picture), and Quadrupole 1 model (right picture). The lower panel represents the distribution for the\nQuadrupole 2 model at the moments t = 0.1288 s., t = 0.2278 s., and t = 0.4259 s.\n\nFigure 4. Time evolution of the magnetic flux Ψ through the horizon for the Quadrupole 2 model. The left panel represents the time\nsections at t = 4.96 × 10−4 s., t = 0.0248 s., t = 0.1238 s., and t = 0.4452 s. (solid, dashed, dotted, and three-dots-dished lines,\nrespectively)\n\n3.2\n\nModel choice\n\nThe parameter we are most interested in is the energy release\neffectiveness\nRT\n\nĖ tot dt\nη ≡ R T0\nṀBH c2 dt\n0\n\n(8)\n\nwhere Ė tot is the total energy flux at radius 180rg and ṀBH\nis the accretion rate on the horizon of the black hole. In\norder to test the effectiveness dependence on the accretion\nconditions, we introduce several models with various initial\nmagnetic fields and other parameters.\nThe initial magnetic field structure in the disk is mainly\n\n\f6\n\nM. V. Barkov & A. N. Baushev\n\ndetermined by the dynamo effect. Dynamo in accretion disks\nwas investigated by many authors (Torkelsson & Branderburg 1994; Arlt & Rüdiger 1999; Bardou et al. 2001) in\nthe context of α-Ω model. Depending on the dynamo parameters, stationary dipole or quadrupole magnetic fields\nwere obtained. Some models showed time oscillations. The\ncalculations gave only a rough estimation of the magnetic\nfield strength. To reproduce this simulations, we have chosen three different topologies of the initial magnetic field\n(similar to Beckwith et al. (2008a)).\nDue to a strong dependence of the toroidal field component on the poloidal one, we initially introduce a purely\npoloidal magnetic field. This field can be described by a vector potential with a single nonzero component Aφ . In our\ncalculations we use\n8\nW (r, θ)3\"\ndipole field\n>\n>\n\"\n<\nθ−π/2\n3\n−W\n(r,\nθ)\ntanh\nQuadrupole\n1 model\nAφ ∝\n\" wθ \"\n>\n>\n3\nr−r\nc\n: −W (r, θ) tanh\nQuadrupole 2 model\nwr rc\n\n(9)\nwhere wθ = 0.05 and wr = 0.1 are the parameters of the\nvector potential. We adopt a dipole initial magnetic field\nfor Low torus momentum, High torus momentum, Neutrino\ncooling, Schwarzschild, and Low magnetized models. Model\nQuadrupole 1 possesses a quadrupole-like field generated by\ntwo dipoles: one is above and the second is below the equatorial plane. Quadrupole 2 model also has a quadrupole field,\nbut the two dipoles are situated closer and farther from the\nblack hole, which reproduces time oscillating magnetic field\nin the accretion disk. The topology of magnetic field is presented in Fig. 1. In all the cases the initial field is normalized\nso that the maximum of the magnetic to gas pressure ratio\nβ = Pm /Pg does not exceed 3*10−2 , except for the Low magnetized model, where β ≤ 3 * 10−4 . We have chosen the small\nvalue of β in order to avoid strong influence of the magnetic\npressure on the initial hydrodynamical equilibrium of the\nconfiguration.\nThe dimensionless angular momentum of the black hole\nis a = 0.9 for all the models except for the Schwarzschild\none, where a = 0. The collapsing torus specific angular\nmomentum and mass are equal to l = 2.8 * rg c = 1.247 *\n1017 cm2 sec−1 , Mtor = 2.55M for Low torus momentum,\nNeutrino cooling, Quadrupole 1, Quadrupole 2 models and\nl = 4.0*rg c = 1.782*1017 cm2 sec−1 , Mtor = 1.87M for High\ntorus momentum, Schwarzschild, Low magnetized models. In\nall the models, except for Neutrino cooling, we neglect the\nneutrino cooling. The summary of the model parameters see\nin tab. 1.\n\nstability (MRI) defines the accretion rate and could be the\nsource of the magnetic dynamo mechanism in the disk. Due\nto the 2D approach MRI cannot lead to the magnetic dynamo appearance in our calculations. It is easy to see that\nby the magnetic flux\nZ θ\nBp *dS\n(10)\nΨ(θ) =\n0\n\ndecreases with time (Fig. 2, Low torus momentum model).\nFirst of all, we investigate the influence on our system of\nvarious magnetic field topologies.\nA dipole-type Low torus momentum model exhibits a\nfast MRI growth in the disk. At first, we can see a powerful\nburst of energy extraction. It seems to be an effect of switching, after a while the flux becomes stationary. The accretion\nruns actively. Magnetosphere of the black hole is dipole-like\n(see Fig. 2). The magnetic flux through the horizon is of the\nsame order as the initial one; the effectiveness of the total\nenergy extraction η is ∼ 7.4 × 10−4 .\nQuadrupole 1 model shows a slower growth of MRI. The\nmagnetosphere of the black hole is monopole-like (see Fig. 3)\nand does not significantly change with time. The magnetic\nflux through the horizon is ten times reduced, compare to\nthe initial one that results in a low energy extraction rate:\nη is 1.1 × 10−5 .\nThe magnetic field structure of the Quadrupole 2 model\nactually represents a configuration of two current frames on\nthe different radii in the equatorial plane. In this case, the\nmagnetosphere is dipole-like, but time variant. One can see\non Fig. 3 that initially the magnetic lines near the black hole\nare predominantly oriented upward. As the inner currant\nframe is falling under the horizon, the magnetic field lines\nget the opposite direction. The mean magnetic flux is also\nten times less than the initial one. The efficiency coefficient\nη of the jet is 2.2 * 10−5 .\nIn our calculations the accretion rate to the black hole\nis proportional to the maximum value of the magnetic flux\nmodule in the torus. On the other hand, the energy release\nin both the quadrupole cases drops down dramatically (up\nto 250 times, see tab. 2).\nIn the case of the Low magnetized model, the MRI grows\nvery slowly. Accretion starts after a long (0.6 sec) phase of\nthe field linear amplification in the torus up to (Pm /Pg ) ∼ 1.\nWhen the accretion starts, the system takes on the standard\nappearance: a jet, an accretion disk and the wind from it.\nThe energy release and the accretion rate are very low (see\ntab. 2). The efficiency η of the wind is 2.0 × 10−5 and of the\njet is 4.9 × 10−7 .\n4.2\n\n4\n\nRESULTS\n\nAll the models (except the Schwarzschild) after the first\nrelaxation gave rise to the same standard configuration: a\nhighly magnetized jet, a thick disk and the wind from it.\nLet us discuss the influence of various parameters of the\nsystem on the accretion rate and energy yield.\n4.1\n\nMagnetic field topology\n\nPoloidal magnetic field plays a crucial role in the evolution\nand dynamics of the accretion disks. Magneto-rotational in-\n\nAngular momenta of the torus and of the\nblack hole\n\nIn the models Low torus momentum, Quadrupole 1, and\nQuadrupole 2 we put the torus angular momentum l =\n2.8 * rg c which is very close to the limit configuration, and\neven small perturbations lead to accretion. If the initial momentum is augmented to l = 4.0*rg c (High torus momentum\nmodel), it decreases the accretion rate thirty times but the\nenergy release does not drop so strongly (see tab. 2), since a\nsignificant part of the field accretes on the black hole increasing the magnetic flux near it. As a result, the effectiveness\nof energy extraction in this case is high η = 3.0 × 10−3 .\n\n\fAccretion of a massive magnetized torus on a rotating black hole\n\n7\n\nTable 1. The list of model initial parameters.\nmodel name\nQuadrupole 1\nQuadrupole 2\nLow torus momentum\nNeutrino cooling\nHigh torus momentum\nSchwarzschild\nLow magnetized\n\nl/(rg c)\n\na\n\nMtor\n\nNeutrino cooling\n\nMagnetic field type\n\nmax(Pm /Pg )\n\n2.8\n2.8\n2.8\n2.8\n4.0\n4.0\n4.0\n\n0.9\n0.9\n0.9\n0.9\n0.9\n0.0\n0.9\n\n2.55\n2.55\n2.55\n2.55\n1.87\n1.87\n1.87\n\nNo\nNo\nNo\nYes\nNo\nNo\nNo\n\nUp-down Quadrupole\nFarther-closer Quadrupole\nDipole\nDipole\nDipole\nDipole\nDipole\n\n0.03\n0.03\n0.03\n0.03\n0.03\n0.03\n0.0003\n\nFigure 6. Dependence on θ and time of the matter (Ė M A , left panels) and electromagnetic (Ė EM , right panels) energy fluxes per unit\nangle at the radius R = 180rg for the Schwarzschild (upper row) and High torus momentum (lower row) models.\n\nAnother important parameter is the angular momentum of the black hole a. Detailed investigations of its influence on the jet formation has been made in Gammie et al.\n(2004); McKinney & Gammie (2004); McKinney (2005);\nHawley et al. (2006). The structure of the solution significantly changes if a = 0 (Schwarzschild model, see tab. 2).\nThe central highly magnetized jet does not appear at all,\nthe energy is released through the subrelativistic magnetized wind. The total energy flux of the system jet-wind is\nalmost the same for the Schwarzschild and the High torus\nmomentum models, whereas the accretion rate in the former\ncase is 27 times higher.\nLet us consider the time-space evolution of the energy\n\nflux at the distance R = 180 * rg . The total flux can be divided in two parts: electromagnetic Ė EM and carried out by\nmatter Ė M A . In the case of High torus momentum (Fig. 6,\nthe lower row), it is easy to see that the flux is predominantly electromagnetic in the jets and matter-dominated\nin the wind. The maximal electromagnetic flux propagates\nnear (not on) the axes. The maxima of the matter energy\nflux are strongly correlated with the electromagnetic maxima, as the main part of matter energy flux is driven by\nshock waves appearing at the boundary between the relativistic jets and the non-relativistic wind (the lines going\nup from the jet to the equatorial region). The jets very ef-\n\n\f8\n\nM. V. Barkov & A. N. Baushev\n\nfectively heat the surrounding wind and can produce a hot\ncorona around the disk.\nIn the case of Schwarzschild model, the situation is different (fig.6, the upper row): electromagnetic and matter energy fluxes have much wider angular distribution. A highly\nmagnetized zone does not appear, and we can see a matter dominated magnetized outflow. Magnetic braking of the\nblack hole produces the wind that carries out the magnetic\nfield.\n\n4.3\n\nNeutrino cooling\n\nIn the initial torus configuration radiation and degenerated\nmatter produce 80% and 20% of the total pressure, respectively. Therefore, neutrino cooling becomes very important.\nIntensive neutrino cooling in the Neutrino cooling model\n(where the system is not opaque for neutrino propagation)\nleads to a significant disbalance in the initial distribution.\nThe originally stable torus collapses to a new configuration\nwith negligible thermal pressure. One can see the influence\nof neutrino cooling on the structure of the torus in Fig. 7.\nThe torus without cooling keeps the initial size and shape.\nThe cooling leads to a collapse of the initial configuration.\nThe maximum density increases up to ten times and reaches\nthe value 1013 g/cm3 .\nThe structure of the accretion flow does not change significantly: the Neutrino cooling model flow is similar to High\ntorus momentum (Fig. 7) and thinner than in Low torus\nmomentum model. The Low torus momentum model has a\nmuch smaller and less stable highly magnetized jet region\nthan in the Neutrino cooling case (Fig. 8). Despite the fact\nthat the Neutrino cooling accretion rate is two times lower\nthan the Low torus momentum one (tab. 2), the energy release and the magnetic flux through the horizon are even\nslightly higher in the Neutrino cooling model (Fig. 5). So\nNeutrino cooling and High torus momentum models have\nthe same effectiveness coefficient η ∼ 0.003 that is 2 − 4\ntimes greater than for the Low torus momentum model.\nAt the inception of the calculations the central region\nof the torus rapidly cools down and falls to the potential\nhollow, while the outer parts do not cool at first. Intensive neutrino cooling leads to a disbalance in the accretion\ntorus. Due to asymmetry of the potential well, uncompensated gravitational forces give rise to oscillations (Fig. 9,\nsimilar results were obtained by Zanotti et al. (2005); Montero et al. (2007)). So the cooling produces intensive radiative shock waves, that (as well as the poloidal magnetic\nfield) strongly increases the effective viscosity. When we neglect the cooling, the oscillations do not appear, the mean\nradius increases due to the strong wind outflow. In the optically thin case, the oscillations\nthe amplitude\nR appear with\nR\n∆rm /rm = 0.05, where rm = M |r|dm/ M dm is the mean\nmass radius, and quickly degrade due to the high viscosity.\nWe can estimate the relaxation time as trelax = tosc × Q,\nm\nm\nwhere Q = |(∆rim + ∆ri+1\n)/2(∆rim − ∆ri+1\n)| ' 3.8 and\n∆rim is the maximal deviation from the equilibrium of the\ni-th oscillation. In our case trelax ≈ 0.027 sec. The same oscillations were obtained in the case of intermediate neutrino\noptical depth (Barkov 2008).\n\nFigure 9. Mean radius rm evolution for Low torus momentum\n(dashed line) and Neutrino cooling (solid line) models.\n\n5\n\nDISCUSSION\n\nTopology and strength of the magnetic field play a crucial\nrole in the process of accretion on a black hole. In our simulations the energy release effectiveness varies over two orders\nof magnitude when we change the magnetic field topology\nfrom the dipole (Neutrino cooling, High torus momentum\nmodels) to the quadrupole one(Quadrupole 1, Quadrupole 2\nmodels). Due to the 2D approach we cannot consider the dynamo effect. However, we can see temporal increases of the\nmagnetic field intensity owing to the MRI-driven turbulence\ngrowth and magnetic line twist.\nThe Blandford-Znajek mechanism plays a leading role\nin accreting black hole energy release. For a force-free\nmonopole magnetosphere the Blandford-Znajek power is\ngiven by\n„\n«2\n1 ΩΨ\n,\n(11)\nĖBZ =\n6c 4π\n√\nWe assume Ω = Ωh /2, were Ωh = a/2(1 + 1 − a2 ) is the\nangular velocity of the black hole and Ψ is the magnetic flux\n(10) threading the black hole.\nOur estimations of the energy release effectiveness differ\nby a factor of 3 from McKinney (2005) and by a factor of\nup to 25 from Barkov & Komissarov (2008b); Komissarov\n& Barkov (2009). We explain it by distinctions between the\ninitial magnetic fields: in Komissarov & Barkov (2009), for\ninstance, the magnetic field flux was 4.8 times higher.\nNeutrino cooling processes significantly suppress the\nwind from the accretion disk, but do not diminish appreciably the energy release; moreover, sometimes they can stabilize the outflow. The neutrino driven oscillations (Fig. 9)\nlook like an artificial effect of turning on the initial conditions: more realistic conditions like MacFadyen et al. (1999);\nBarkov & Komissarov (2008a) do not lead to significant radial oscillations. But even if the effect is real, the oscillations\n(MacFadyen et al. 1999) can scarcely be observed by gravitational wave detectors.\nHighly magnetized jets appear in all the models considered, where the black hole possesses angular momentum.\n\n\fAccretion of a massive magnetized torus on a rotating black hole\n\n9\n\nFigure 7. Distribution of log10 (ρ) and magnetic lines. Left panel represents the initial distribution. Central and right panels represent\nthe distributions after 0.2075 s. of evolution for the Low torus momentum and Neutrino cooling models are shown on the central and\nright panel, respectively.\n\nFigure 8. Lorenz factor distribution for t = 0.2075 s. Left panel represents the Low torus momentum model with no cooling, the right\none - Neutrino cooling model.\n\nTable 2. Main results.\nmodel\nLow torus momentum\nNeutrino cooling\nQuadrupole 1\nQuadrupole 2\nHigh torus momentum\nSchwarzschild model\nLow magnetized\n\nl\n\na\n\nṀBH\n\nṀw\n\nEM\nĖ51\n\nMA\nĖ51\n\ntot\nĖ51\n\nη\n\n2.8\n2.8\n2.8\n2.8\n4.0\n4.0\n4.0\n\n0.9\n0.9\n0.9\n0.9\n0.9\n0.0\n0.9\n\n1.3937\n0.8588\n0.3976\n0.2126\n0.053\n1.411\n0.0023\n\n0.0189\n0.0134\n0.00023\n0.00034\n0.0026\n0.0086\n5.5 × 10−6\n\n0.777\n1.5024\n0.0022\n0.0019\n0.1283\n0.0216\n2.0 × 10−6\n\n1.076\n1.4014\n0.0058\n0.0065\n0.1541\n0.2320\n8.16 × 10−5\n\n1.8530\n2.9039\n0.0080\n0.0083\n0.2824\n0.2536\n8.36 × 10−5\n\n7.4 × 10−4\n1.9 × 10−3\n1.1 × 10−5\n2.2 × 10−5\n3.0 × 10−3\n1.0 × 10−4\n2.0/0.049 × 10−5\n\nHere l is the dimensionless angular momentum of the accreting matter; ṀBH - accretion rate M s−1 ; Ṁw – wind mass loss rate\nEM , Ė M A , Ė tot are electromagnetic energy, matter energy, and the total energy fluxes at radius 180r ,\nM s−1 at radius 180rg ; Ė51\ng\n51\n51\n1051 erg s−1 ; η - accretion effectiveness (8) (for the Low magnetized model we present separately the effectiveness of the\nelectromagnetic energy extraction). Notice that in the case of the Low magnetized model the accretion starts only after 0.75 s., while\nthe calculation ends at 0.99 s.\n\n\f10\n\nM. V. Barkov & A. N. Baushev\n\nThe obtained parameters of the plasma acceleration in the\njets (Fig. 8) are in good agreement with Komissarov et al.\n(2007a); Barkov & Komissarov (2008b); Komissarov et al.\n(2009).\nThe boundary between the jet and the wind is unstable (the perturbation growth is most pronounced in Fig. 8,\nNeutrino cooling case, in the south hemisphere in the radius interval 100 − 150rg . McKinney (2006) reported about\na similar effect). The jet speed is much higher than the sound\nspeed in the wind, and the boundary perturbations generate\nstrong shock waves propagating to the wind region (Fig.6).\nThe shocks effectively heat the wind and can produce a hot\ncorona around the accretion disks like in the SS433 system\n(Cherepashchuk et al. 2006).\nIf we adopt the effectiveness coefficient η ∼ 0.003 of\nthe models Neutrino cooling and High torus momentum, it\nallows us to estimate the total energy release of the torus\naccretion as Etot ≈ ηMtorus c2 ≈ 1.3 * 1052 erg. This value\nof η however, need not to be universal: as we saw, other\nmagnetic field topologies can have a significantly different\nefficiency.\nThe scenario considered in this article is a possible alternative to the magnetar-driven hypernova scheme (Komissarov & Barkov 2007b). Both the scenarios predict the appearance of collimated jets energetic enough to explain GRB\nas well as hypernovae phenomena. Accurate calculations are\nneeded to find characteristic features and distinguish these\ntwo schemes. By now we can say that the chemical composition of matter in the jets should be different. In the\ncollapsar scenario we expect a highly Poynting-dominated\njet (\u000ff ield /\u000fmatt ∼ 1000, where \u000ff ield and \u000fmatt are the field\nand the matter energy flux densities, respectively), mainly\nmade up of e+ e− -pairs, while in the magnetar-driven scenario the jet is baryon-dominated and intermediately magnetized (\u000ff ield /\u000fmatt ∼ 1 − 100).\nThe effect of the magnetic field sign change found in\nthe jet of the Quadrupole 2 model, may be the key to understanding of the \"surprising evolution of the parsec-scale\nFaraday rotation gradients in the jet of the BL Lac object\nB1802+784\" (Mahmud et al. 2009). Complicated topology\nof the magnetic field in the accretion disk can lead to variations of the magnetic field direction in the jet. In this case,\nthe jet constitutes a chain of regions with various magnetic\nfield orientations.\n\n6\n\nCONCLUSION\n\nThe accretion rate and energy release are governed by four\nmain parameters: magnetic field structure, angular momentum of the black hole, specific angular momentum of the\naccreting matter, accretion disk mass or accreting part of\nthe star envelop. To have a long-time accretion, angular momentum of the accreting matter should be high enough to\nform an accretion disk around the black hole. As it has been\ndemonstrated by the Schwarzschild model, if the black hole\nhas deficient angular momentum, the powerful magnetized\njet does not appear at all, which totally changes the picture\nof the accretion. Moreover, a comparison of the Low and\nHigh torus momentum models shows us that a respectively\nsmall variation of the angular momentum of the accreting\nmatter leads to a change of the accretion efficiency. Neutrino\n\nlosses do not prevent energy release and can even stabilize\nthe magnetized jet outflow.\nThe least understood and a very important factor defining the accretion efficiency is the disk magnetic field structure. As we could see from the calculations, a mere replacing\nof the dipole field by the quadrupole one decreases the energy release by two orders of magnitude. The magnetic flux\nΨ governs the energy extraction from ergosphere (11), while\nthe black hole magnetosphere is formed and supported by\nthe disk. In our calculations we preset the initial magnetic\nfield in the torus. It is clear, however, that self-consistent\nnumerical calculations of the magnetic dynamo in the disk\nare necessary in order to elucidate the problem.\nNevertheless, our calculations show that a very intensive electromagnetic and matter energy flux can be evolved\nduring massive torus accretion on a rotating black hole\nwith mass ∼ 10M . The total energy budget is quite sufficient to explain hypernova explosions like GRB 980425 or\nGRB 030329. The magnetized matter accretion on a rotating black hole is a very promising model of the central engine\nof these phenomena.\nIn addition, we have found that the instability of the\nboundary between the jet and the wind generates shock\nwaves propagating to the wind region and heating it. This\neffect can give rise to a hot corona around the binary system\nsimilar to SS433.\n\nACKNOWLEDGMENTS\nWe would like to express our deep gratitude to Prof.\nS. S. Komissarov for helping in the computational code\ncreation, and for very fruitful discussions. We thank Prof.\nG. S. Bisnovatyi-Kogan for helpful discussions.\nThe calculations were fulfilled at the St. Andrews UK\nMHD cluster and at the White Rose Grid facilities (Everest cluster). This work was supported by the PPARC\n(grant \"Theoretical Astrophysics in Leeds\") and by the\nRFBR (Russian Foundation for Basic Research, Grant 0802-00856).\n\nREFERENCES\nAbramowicz M., Jaroszynski M., Sikora M., 1978, A&A,\n63, 221\nAloy M.A., Müller E., Abner J.M., Marti J.M., MacFadyen\nA.I., 2000, ApJ, 531, L119\nArdeljan N.V., Bisnovatyi-Kogan G.S., Moiseenko S.G.,\n2005, MNRAS, 359, 333\nArlt R., Rüdiger G., 1999, A&A, 349, 334\nBahcall J.N., 1964, Phys. Rev. B, 136, 1164\nBardou A., von Rekowski B., Dobler W. , Brandenburg A.,\nShukurov A., 2001, A&A, 370, 635\nBalbus S.A., Hawley J.F., 1991, ApJ, 376, 214\nBarkov M.V., 2008, in COOL DISCS, HOT FLOWS, AIP\nConference Proceedings, v. 1054, p. 79\nBarkov M.V., Komissarov S.S., 2008a, MNRAS, 385, L28\nBarkov M.V., Komissarov S.S., 2008b, IJMP D, 17, 1669\nBarkov M.V., Komissarov S.S., 2009, in preparation\nBaushev A.N., Chardonnet P., 2009, in press\n(arXiv:0905.4071)\n\n\fAccretion of a massive magnetized torus on a rotating black hole\nBaym G., Bethe H., Pethick Ch., 1971, NP, A175, 255\nBaym G., Pethick Ch., Sutherland P., 1971, ApJ, 170, 306\nBeckwith K., Hawley J., Krolik J., 2008, ApJ, 678, 1180\nBeckwith K., Hawley J., Krolik J., 2008, MNRAS, 390, 21\nBeskin V.S., Istomin Ya.N., Par'ev V.I., 1992, SvA, 36, 642\nBezchastnov V.G., Haensel P., Kaminker A.D., Yakovlev\nD.G., 1997, A&A, 328, 409\nBirkl R., Aloy M.A., Janka H.Th., Müller E., 2007, A&A,\n463, 51\nBisnovatyi-Kogan G.S., 2001, Springer, Stellar physics.\nVol.1\nBlandford R.D. and Znajek R.L.,1977,MNRAS,179,433\nBlandford R.D., Payne D.G.,1982,MNRAS,199,883\nBlinnikov S.I., Postnov K.A., Kosenko D.I., Bartunov O.S.,\n2005, Astron. Lett., 31, 6, 365\nBloom J.S., Kulkarni S.R., Djorgovski S.G., 2002, AJ, 123,\n1111\nChandrasekhar S., 1960, Proc. Nat. Acad. Sci. USA, 46,\n253\nCherepashchuk A.M., Sunyaev R.A., Seifina E.V., Antokhina E.A., Kosenko D.I., Molkov S. V., Shakura N.\nI., Postnov K. A. et al., 2006, astro-ph/0610235\nDe Villiers J.P., Hawley J.F., Krolik J.H., 2003, ApJ, 599,\n1238\nFishbone L.G., Moncrief V., 1976, ApJ, 207, 962\nFishman G.J., Meegan C.A., 1995, Ann. Rev. Astron. Ap.,\n333, 415\nFruchter A.S., Levan A.J., Strogler L., Vreeswijk P.M.,\nThorsett S.E., Bersier D., Burud I., Castro Cern J.M.\net al., 2006, Nature, 441, 7092, 463\nGalama T.J., Vreeswijk P.M., van Paradijs J., Kouveliotou\nC., Augusteijn T., Böhnhardt H., Brewer J.P., Doublier\nV. et al., 1998, Nature, 395, 6703, 670\nGreiner J., Peimbert M., Estaban C., Kaufer A., Jaunsen\nA., Smoke J., Klose S., Reimer O., 2003, GCN 2020\nGammie C.F., McKinney J.C., 2004, ApJ, 602, 312\nHawley J.F., Krolik J.H., 2006, ApJ, 641, 103\nHjorth J., Sollerman J., Møller P., Fynbo J.P.U., Woosley\nS.E., Kouveliotou C., Tanvir N.R., Greiner J. et al., 2003,\nNature, 423, 6942, 847\nIvanova L.N., Imshennik V.S., Nadezhin D.K., 1969, NI,\n13, 3\nKlebesadel R.W., Strong I.B., Olson R.A., 1973, ApJL,\n182, L85\nKouveliotou C., Meegan C.A., Fishman G.J., Bhat N.P.,\nBriggs M.S., Koshut T.M., Paciesas W.S., Pendleton G.N.\n, 1993, ApJL, 413, L101\nKomissarov S.S., 1999, MNRAS, 303, 343\nKomissarov S.S., 2004b, MNRAS, 350, 1431\nKomissarov S.S., 2006, MNRAS, 368, 993\nKomissarov S.S., Barkov M.V., 2007, MNRAS, 382, 1029\nKomissarov S.S., Barkov M.V., Vlahakis N., Königl A.,\n2007b, MNRAS, 380, 51\nKomissarov S.S., Vlahakis N., Königl A., Barkov M.V.,\n2009, MNRAS, 394, 1182\nKomissarov S.S., Barkov M.V., 2009, arXiv:0902.2881, accepted by MNRAS\nMacFadyen A.I., Woosley S.E., 1999, ApJ, 524, 262\nMalone R.C., Johnson M.B., Bethe H.A., 1975, ApJ, 199,\n741\nMatheson T., Garnavich P.M., Stanek K.Z., Bersier D.,\nHolland S.T., Krisciunas K., Caldwell N., Berlind P. et al.,\n\n11\n\n2003, ApJ, 599, 394\nMazets E.P. and Golenetskii S.V., 1981, Ap&SS, 75, 1, 47\nMacFadyen A.I., Woosley S.E, 1999, ApJ,524, 262\nMahmud M., Gabuzda D.C., Bezrukovs V., 2009,\narXiv:0905.2368\nMcKinney J.C., Gammie C.F., 2004, ApJ, 611, 977\nMcKinney J.C., ApJL, 630, L5\nMcKinney J.C., MNRAS, 368, 1561\nMcKinney J.C., Narayan R., 2007, MNRAS, 375, 513\nMcKinney J.C., Blandford R.D., 2009, MNRAS, 394, L126\nMontero P.J., Zanotti O., Font J.A., Rezzolla L., 2007, MNRAS, 378, 1101\nNagataki S., Takahashi R., Mizuta A., Takiwaki T., 2007,\nApJ, 659, 512\nNagataki S., 2009, arXiv:0902.1908\nPian E., Amati L., Antonelli L.A., Butler R.C., Costa E.,\nCusumano G., Danziger J., Feroci M. et al., 2000, ApJ,\n536, 778\nPopham R., Woosley S.E., Fryer C., 1999, ApJ, 518, 356\nProga D., MacFadyen A.I., Armitage P.J., Begelman M.C.,\n2003, ApJ, 629, 397\nShakura N.I., Sunyaev R.A., 1973, A&A, 24, 337\nSchinder P. J., Schramm D. N., Wiita P. J., Margolis S. H.,\nTubbs D. L., 1987, ApJ, 313, 531\nShibata M., Sekiguchi Yu, Takahashi R., 2007, PThPh, 118,\n2, 257\nSoffitta P., Feroci M., Piro L., in 't Zand J., Heise J., di\nCiolo L., Muller J.M., Palazzi E. et al., 1998, IAU Circular\nNo. 6884\nSokolov V.V., Fatkhullin T.A., Komarova V.N., Kurt V.G.,\nLebedev V.S., Castro-Tirado A.J., Guziy S., Gorosabel J.\net al., 2003, BSAO, 56, 5\nThompson T.A., Burrows A., Meyer B.S., 2001, ApJ, 562,\n887\nTorkelsson U., Brandenburg A., 1994, A&A, 283, 677\nTubbs D.L., Schramm D.N., 1975, ApJ, 201, 467\nUzdensky D.A., MacFadyen A.I., 2006,ApJ,647,1192\nVelikhov E.P., 1959, Sov. Phys. JETP, 36, 995\nWoosley S.E., 1993,ApJ,405,273\nZalamea I., Beloborodov A.M., 2008, arXiv:0812.4041\nZanotti O., Font J.A., Rezzolla L., Montero P.J., 2005, MNRAS, 356, 1371\n\n\f"}