{"id": "http://arxiv.org/abs/0704.2024v1", "guidislink": true, "updated": "2007-04-16T14:25:05Z", "updated_parsed": [2007, 4, 16, 14, 25, 5, 0, 106, 0], "published": "2007-04-16T14:25:05Z", "published_parsed": [2007, 4, 16, 14, 25, 5, 0, 106, 0], "title": "A Tight-Binding Grand Canonical Monte Carlo Study of the Catalytic\n  Growth of Carbon Nanotubes", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0704.3316%2C0704.2238%2C0704.3062%2C0704.3739%2C0704.0365%2C0704.0260%2C0704.1769%2C0704.1046%2C0704.3618%2C0704.0907%2C0704.0578%2C0704.1235%2C0704.0543%2C0704.3892%2C0704.3964%2C0704.0328%2C0704.2456%2C0704.0986%2C0704.3813%2C0704.3802%2C0704.3293%2C0704.0135%2C0704.0928%2C0704.1074%2C0704.1553%2C0704.3626%2C0704.0616%2C0704.1299%2C0704.0786%2C0704.0931%2C0704.0730%2C0704.3486%2C0704.2057%2C0704.0458%2C0704.2818%2C0704.3909%2C0704.2270%2C0704.0619%2C0704.2121%2C0704.1133%2C0704.3404%2C0704.3922%2C0704.3825%2C0704.1621%2C0704.0154%2C0704.3277%2C0704.1173%2C0704.2944%2C0704.0850%2C0704.1504%2C0704.0462%2C0704.3407%2C0704.3401%2C0704.2424%2C0704.0561%2C0704.0443%2C0704.0091%2C0704.3751%2C0704.3875%2C0704.0714%2C0704.2726%2C0704.2458%2C0704.2149%2C0704.3175%2C0704.3051%2C0704.1319%2C0704.0621%2C0704.3832%2C0704.1610%2C0704.0372%2C0704.2359%2C0704.0572%2C0704.1996%2C0704.1250%2C0704.1400%2C0704.0803%2C0704.1125%2C0704.3037%2C0704.3007%2C0704.2966%2C0704.2555%2C0704.1369%2C0704.0108%2C0704.3333%2C0704.2493%2C0704.1144%2C0704.1672%2C0704.1663%2C0704.0622%2C0704.0611%2C0704.2024%2C0704.1414%2C0704.0609%2C0704.1578%2C0704.0089%2C0704.0558%2C0704.2698%2C0704.2985%2C0704.2700%2C0704.2207%2C0704.3621&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A Tight-Binding Grand Canonical Monte Carlo Study of the Catalytic\n  Growth of Carbon Nanotubes"}, "summary": "The nucleation of carbon nanotubes on small nickel clusters is studied using\na tight binding model coupled to grand canonical Monte Carlo simulations. This\ntechnique closely follows the conditions of the synthesis of carbon nanotubes\nby chemical vapor deposition. The possible formation of a carbon cap on the\ncatalyst particle is studied as a function of the carbon chemical potential,\nfor particles of different size, either crystalline or disordered. We show that\nthese parameters strongly influence the structure of the cap/particle interface\nwhich in turn will have a strong effect on the control of the structure of the\nnanotube. In particular, we discuss the presence of carbon on surface or in\nsubsurface layers.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0704.3316%2C0704.2238%2C0704.3062%2C0704.3739%2C0704.0365%2C0704.0260%2C0704.1769%2C0704.1046%2C0704.3618%2C0704.0907%2C0704.0578%2C0704.1235%2C0704.0543%2C0704.3892%2C0704.3964%2C0704.0328%2C0704.2456%2C0704.0986%2C0704.3813%2C0704.3802%2C0704.3293%2C0704.0135%2C0704.0928%2C0704.1074%2C0704.1553%2C0704.3626%2C0704.0616%2C0704.1299%2C0704.0786%2C0704.0931%2C0704.0730%2C0704.3486%2C0704.2057%2C0704.0458%2C0704.2818%2C0704.3909%2C0704.2270%2C0704.0619%2C0704.2121%2C0704.1133%2C0704.3404%2C0704.3922%2C0704.3825%2C0704.1621%2C0704.0154%2C0704.3277%2C0704.1173%2C0704.2944%2C0704.0850%2C0704.1504%2C0704.0462%2C0704.3407%2C0704.3401%2C0704.2424%2C0704.0561%2C0704.0443%2C0704.0091%2C0704.3751%2C0704.3875%2C0704.0714%2C0704.2726%2C0704.2458%2C0704.2149%2C0704.3175%2C0704.3051%2C0704.1319%2C0704.0621%2C0704.3832%2C0704.1610%2C0704.0372%2C0704.2359%2C0704.0572%2C0704.1996%2C0704.1250%2C0704.1400%2C0704.0803%2C0704.1125%2C0704.3037%2C0704.3007%2C0704.2966%2C0704.2555%2C0704.1369%2C0704.0108%2C0704.3333%2C0704.2493%2C0704.1144%2C0704.1672%2C0704.1663%2C0704.0622%2C0704.0611%2C0704.2024%2C0704.1414%2C0704.0609%2C0704.1578%2C0704.0089%2C0704.0558%2C0704.2698%2C0704.2985%2C0704.2700%2C0704.2207%2C0704.3621&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The nucleation of carbon nanotubes on small nickel clusters is studied using\na tight binding model coupled to grand canonical Monte Carlo simulations. This\ntechnique closely follows the conditions of the synthesis of carbon nanotubes\nby chemical vapor deposition. The possible formation of a carbon cap on the\ncatalyst particle is studied as a function of the carbon chemical potential,\nfor particles of different size, either crystalline or disordered. We show that\nthese parameters strongly influence the structure of the cap/particle interface\nwhich in turn will have a strong effect on the control of the structure of the\nnanotube. In particular, we discuss the presence of carbon on surface or in\nsubsurface layers."}, "authors": ["Hakim Amara", "Christophe Bichara", "François Ducastelle"], "author_detail": {"name": "François Ducastelle"}, "author": "François Ducastelle", "links": [{"href": "http://arxiv.org/abs/0704.2024v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0704.2024v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0704.2024v1", "affiliation": "LEM", "arxiv_url": "http://arxiv.org/abs/0704.2024v1", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "A Tight-Binding Grand Canonical Monte Carlo Study of the\nCatalytic Growth of Carbon Nanotubes\n\narXiv:0704.2024v1 [cond-mat.mtrl-sci] 16 Apr 2007\n\nH. Amara,1, 2 C. Bichara,3 and F. Ducastelle4\n1\n\nLaboratoire de Physique du Solide,\n\nFacultés Universitaires Notre-Dame de la Paix,\n61 Rue de Bruxelles, 5000 Namur, Belgique\n2\n\nPCPM and CERMIN, Université Catholique de Louvain,\nPlace Croix du Sud 1, 1348 Louvain-la Neuve, Belgique\n3\n\nCRMCN-CNRS, Campus de Luminy,\n\nCase 913, 13288 Marseille Cedex 09, France.\n4\n\nLaboratoire d'Etude des Microstructures,\n\nONERA-CNRS, BP 72, 92322 Châtillon Cedex, France.\n(Dated: November 18, 2018)\n\nAbstract\nThe nucleation of carbon nanotubes on small nickel clusters is studied using a tight binding model\ncoupled to grand canonical Monte Carlo simulations. This technique closely follows the conditions\nof the synthesis of carbon nanotubes by chemical vapor deposition. The possible formation of a\ncarbon cap on the catalyst particle is studied as a function of the carbon chemical potential, for\nparticles of different size, either crystalline or disordered. We show that these parameters strongly\ninfluence the structure of the cap/particle interface which in turn will have a strong effect on the\ncontrol of the structure of the nanotube. In particular, we discuss the presence of carbon on surface\nor in subsurface layers.\nPACS numbers: 68.55.Ac, 61.46.Fg, 82.65.+r\n\n1\n\n\fAccurately controlling the location, diameter, chirality and length of single wall carbon\nnanotubes elaborated by chemical vapor deposition (CVD) is one of the critical issues for\nan effective use of the unique properties of these nanoobjects in many applications such\nas electronic devices1 . According to Nasibulin et al.2 and Bachilo et al.,3 the diameter of\nthe tubes produced by CVD is related to the diameter of the catalyst particle from which\nthey originate. One important step is therefore to control the size distribution and the\nlocation of the catalyst particle. Chirality may result from either thermodynamic stability\ndifferences between the initial tube caps4 or from difference in the growth kinetics.5 The\ntube length can be limited by the poisoning of the catalyst resulting from uncontrolled\ngrowth parameters.\n\nThe very large number of parameters controlling the CVD reaction makes it necessary\nto rationalize the approach by an understanding of nucleation and growth mechanisms\nat the atomic level. Experimental investigations at this level are usually done by Transmission Electron Microscopy (TEM) performed post mortem outside the CVD reactor.\nRemarkable progress has recently been made in the in situ observation of the growth of\nnanotubes,6,7,8 but the atomic resolution is not obtained under the actual growth conditions.\nComputer simulation techniques are an alternative way to gain an insight at the\natomic level.\n\nHowever, they have to face the very difficult challenge of requiring an\n\naccurate description of the interatomic interactions, as typically provided by first principles\ncalculations, and to address the size and time scales relevant to the experimental situation.\nEfficient catalyst particles for CVD reactions are in the 1–10 nm diameter range (some\nthousands of atoms) and, according to Lin et al.,9 the time scale for the nucleation and\ngrowth of tubes is in the 10–100 seconds range.\n\nSuch scales are largely beyond the\n\ncapabilities of Molecular Dynamics (MD) techniques, even with the most simple interatomic\ninteraction models. This means that only some elementary steps can be studied, or that the\ngrowth conditions imposed in the simulations are orders of magnitude too fast, resulting\nin very defective structures as compared to the almost perfect tubes obtained experimentally.\nStatic ab initio calculations have been used to calculate the total energies of atomic\nconfigurations considered as representative of the nucleation of carbon caps on a catalyst.10\n2\n\n\fHofmann et al.11 proposed a schematic growth model and calculated the relevant activation\nbarriers. Abild-Pedersen et al.12 showed that carbon surface or subsurface diffusion on\nNi correspond to almost equal diffusion barriers.\n\nFirst principles Molecular Dynamics\n\nsimulations were used to study the root incorporation of C atoms on a Co catalyst13\nand the nucleation of a carbon cap on a Fe droplet was described by Raty et al..14 As\nargued by these latter authors the absence of diffusion inside the Fe particle is due to its\nvery small size (55 atoms). This is at odds with the findings of Ding and Bolton15 who\nargued that highly supersaturated carbon concentrations are required for nucleating carbon\nislands on the Fe particle surface. This difference might be due to the FeC interaction\n(empirical versus ab initio) model used or to the very short physical time of the first\nprinciples simulations. The same group studied the roles of the particle size and of a\npossible temperature gradient on the nanotube growth.16 Based on their empirical MD\nsimulations, Shibuta and Maruyama17 found hexagonal carbon networks formed within a\nsmall Ni cluster of 108 atoms, in complete contradiction with the ab initio calculations of\nZhang et al.18 showing that, at 0 K, the most stable position for one C atom on a small\nNi38 hexagonal cluster is adsorbed on the surface rather than in the central interstitial site.\nStudying the growth of nanotubes on small (Ni48 and Ni80 ) clusters by empirical MD, Zhao\net al.19 found almost the same mechanism as in our previous calculations on a semi infinite\nsystem (slab geometry)20 based on a tight binding model. In both studies, four steps can be\nidentified: C dissolution, the formation of C chains on the surface followed by the formation\nof sp2 C sites that gradually detach from the catalyst surface.\n\nSummarizing the computer simulations results, it seems that the question of the presence\nof carbon dissolved in the catalyst remains quite controversial.\n\nFirst principles static\n\nor dynamic calculations tend to show that no C is dissolved in the very small particles\nstudied, while empirical simulations tend to find a larger amount of C dissolved. Besides\nthe questions of the accuracy of the interatomic force model and of the time scale of the\nsimulations, another aspect is completely neglected in the MD calculations used. Molecular\nDynamics works by construction in a microcanonical or canonical ensemble with a fixed\nnumber of particles. Growth sequences are obtained either by adding particles \"by hand\"\nor by putting the catalyst particle in a box, with a fixed number of C atoms in a vapor\nphase.\n\nSuch a process completely ignores the chemical potential gradient that is the\n3\n\n\fthermodynamic driving force for the growth.\n\nIn this paper, using a carefully tested tight binding model we show that the solubility of\ncarbon and the possibility to grow tube embryos at the surface of small Ni cluster critically\ndepend on the carbon chemical potential. Moreover, we show that, at 1000 K, the solubility\nof carbon also depends on the structure of the small metallic cluster considered : disordered,\nliquid-like clusters incorporate more C atoms, while they tend to remain adsorbed on the\nsurface of crystalline structures.\n\nThe tight binding model we used for C and Ni interactions has already been used by\nAmara et al.20 and is described in detail in reference 21. The total energy is taken as a\nsum of a band structure term and an empirical repulsive term. The s and p electrons of\nC and d electrons of Ni are included. Calculations are performed in the grand canonical\nensemble, with fixed volume, temperature (T), number of Ni atoms and C chemical\npotential (μC ). In order to be efficiently implemented in the grand canonical Monte Carlo\n(GCMC) code, the total energy has to be taken as a sum of local terms, avoiding to\nrecalculate the total energy of the whole box at each step of the Monte Carlo process.\nThis is achieved by calculating local densities of electronic states using the recursion\nmethod.22 To keep the model as simple and fast to compute as possible, we neglect the Ni\ns electrons and calculate only the first four moments of the local densities of states. The\nlocal energy of each atom therefore depends only on the positions and chemical identities of\nits first and second neighbors, as defined by a cut off distance set at 3.20 Å for first neighbors.\n\nThe GCMC calculations presented here compare the adsorption of carbon atoms on\nsmall Ni clusters, either \"crystalline\", in their face centered cubic equilibrium Wulff shape,\nwith 201, 405, or 807 atoms, or disordered, resulting from the quench of liquid droplets\nwith 50 or 108 atoms. These calculations were done at 1000 K, a typical temperature\nfor the CVD synthesis of single wall nanotubes. We analyze the influence of the carbon\nchemical potential on the carbon nanostructure grown on the Ni cluster, on the structure\nof the nickel carbon interface and on the solubility, if any, of carbon in the Ni cluster.\nThe decomposition reaction of the carbon rich feedstock under specific partial pressure\nconditions is not taken into account explicitly in our calculations. However, the result of\n4\n\n\fthis reaction is to provide atomic carbon with a given chemical potential that is able to\nadsorb and diffuse on, or in, the nickel surface. As explained in e.g. Lolli et al.,5 this\ncarbon chemical potential is experimentally controlled through the thermochemistry of the\ndecomposition reaction. To achieve this in the computer experiments, we use Monte Carlo\nsimulations in the grand canonical ensemble.23\n\nThe grand canonical algorithm used consists in a series of Monte Carlo macrosteps.\nEach macrostep randomly alternates displacement moves for Ni or C atoms, attempts to\nincorporate carbon in a previously defined active zone and attempts to remove existing\ncarbon atoms. Within each macrostep, we systematically performed four times the number\nof atom attempted displacement steps. To incorporate carbon atoms in the structure, 1000\nattempts were made and ended as soon as one successful incorporation has occurred. The\nnumber of attempted carbon removal steps was equal to twice the number of C atoms\npresent in the structure. We typically performed up to 5000 macrosteps. We will see below\nthat this number of macrosteps is large enough to reach equilibrium when the chemical\npotential conditions are such that no carbon nanostructure grows. Of course, under growth\nconditions, no equilibrium is ever reached and the number of adsorbed C atoms keeps\nincreasing. The maximum amplitude of the attempted displacements of Ni or C atoms is\nadjusted during the run in order to have a rejection rate around 50%, ensuring an optimal\nuse of the computer resources to sample the configurational space of the system.23 On\naverage, the maximum amplitude of the displacements of Ni atoms turns out to be twice\nas large as that of C atoms, meaning that the mobility of Ni atoms is larger. In order\nto mimic the CVD process, the active zone for inserting or extracting carbon atoms is\ndefined as a region of space at less than 3 Å above and 3 Å below the surface of the Ni\ncluster. Moreover, to avoid the encapsulation of the Ni cluster with carbon and to account\nfor the fact that, in the experiments, the catalytic particles are supported, the active zone\nis limited to the topmost (60%) part of the cluster. We stress that this is a very crude\napproximation that neglects the modifications of the cluster structure that can be induced\nby the substrate.24 In the case of the largest fcc Wulff-shaped clusters, this zone is smaller:\n50% for the 405 atoms cluster and 40% for the 807 atoms cluster. A first reason for this is\nto limit the CPU time of the calculations, since the fourth moment tight binding model for\nNi and C atoms is replaced by a much simpler second moment approximation model for Ni\n5\n\n\fatoms only, as soon as they are far enough from any C atom (i. e.: at a distance larger than\n6.4 Å ). A second reason is that these fractions of the clusters volume roughly correspond\nto the same number of Ni atoms (151 for the 201 atom cluster, 231 for the 405 atoms one\nand 267 for the 807 atoms one), which will be used to calculate the mole fraction of carbon\natoms dissolved in the Ni structure.\n\nTo analyze the results of the calculations, we will have to discriminate between carbon\natoms that are outside the Ni cluster, generally forming sp (small chains) or sp2 (layered)\nstructures and individual carbon atoms that are adsorbed on the surface or incorporated in\nsubsurface or bulk. A convenient way to do this is to calculate the distance between the\ncarbon atom of interest and its nearest carbon neighbor. If this distance is smaller than\n1.7 Å , the atom is defined as an \"outer\" C atom, because C–C bond lengths in sp or sp2\nbonding states are smaller than this. If it is longer, the carbon atom is either adsorbed\non the Ni surface, with Ni neighbors in the 1.85–1.95 Å distance range, or incorporated in\ninterstitial sites: such carbon atoms are denoted as \"inner\" carbon atoms in the following.\nThis criterion stems from the analysis of the carbon carbon pair correlation function that\nclearly shows distinctive features for each type of atoms. It can be easily checked by a\nvisual inspection of the structures formed.\n\nWe first study the effect of the carbon chemical potential on the structures formed\noutside the particle. Starting with the same Ni50 disordered droplet, we performed GCMC\nruns with μC varying between -6.00 and -4.50 eV/atom, by steps of 0.75 eV/atom. The\ncarbon chemical potential is referred to a fictitious ideal monoatomic gas, explaining its\nvalues that are of the order of the cohesive energies of the various carbon phases (e.g.:\n-7.41 eV/atom for a graphene layer in our model). Figure 1 shows a series of typical\nconfigurations obtained under these conditions. At low chemical potential, no outer carbon\nstructure is formed. Carbon atoms land on the surface and tend to diffuse on the surface or\ntowards subsurface sites. They sometimes form carbon dimers, but no twofold coordinated\nlong chain structure is ever formed. An equilibrium situation is quickly reached, with\nabout 25 C atoms adsorbed. On the contrary, when the chemical potential is much larger\n(-4.5 eV/atom), a disordered and thick carbon layer is formed outside the cluster. This\namorphous layer is formed by carbon atoms with 3 or 4 carbon neighbors. This can be\n6\n\n\finterpreted as the growth of an amorphous carbon fiber. A much more interesting situation,\nas far as the formation of a carbon nanotube is concerned, is observed at intermediate\nchemical potential values.\n\nFIG. 1: Typical configurations resulting from GCMC simulations of the growth of C on a 50 Ni\natom disordered droplet at 1000 K. Left panel, μC = -6.00eV/atom, central panel μC = -5.25\neV/atom, right panel μC = -4.50 eV/atom. 5000, 4000 and 2500 Monte Carlo macrosteps were\nperformed, respectively. Nickel atoms are represented in orange, inner carbon atoms are in green\nand outer carbon atoms are in grey. See text for the definition of \"inner\" and \"outer\" carbon\natoms.\n\nAt μC = -5.25 eV/atom and 1000 K, a cap of carbon atoms is formed. It encapsulates\nthe topmost part of the Ni droplet. Figure 2 presents a series of configurations characteristic\nof the formation of the cap. At the very beginning of the GCMC run, carbon atoms \"land\"\non the available surface of the Ni particle. Then, instead of diffusing towards subsurface\nsites as observed at lower chemical potentials, they tend to form dimers and short chains\nat the surface of the droplet. Because μC is larger, the flux of incoming atoms is larger\nand C atoms quickly find another C to form a C–C bond that stabilizes it on the surface.\nAlthough no time scale is included in the grand canonical Monte Carlo scheme, we can\nsee that this step is very fast: in less than 50 Monte Carlo macrosteps, carbon chains are\nalready formed on the surface. As observed in our previous calculations on Ni slabs,20 the\nchains grow, cross each other to form threefold coordinated sp2 carbon sites that act as\nnucleation centers to grow sp2 layers. These sp2 carbon atoms interact weakly with the\nNi surface and the cap formed can gradually detach from the droplet. The difference with\n7\n\n\fcalculations performed on flat surfaces is that the curvature of the Ni droplet induces a\ncurvature of the carbon cap. The cap diameter and curvature are determined by the Ni\nparticle shape at the moment when the cap is formed. However, since Ni atoms are more\nmobile than C atoms, the shape of the Ni droplet can be modified later in the process. As\ncompared to the almost perfect graphene like layer, mostly formed with hexagons, obtained\non a flat Ni surface, the curvature and growth conditions impose a larger number of defects\nsuch as pentagons, heptagons, etc. The cap structure shown in figure 1 is formed by 13\npentagons, 28 hexagons, 7 heptagons, 5 octogons and 7 9-membered rings. The cap is very\ndefective as compared to ideal nanotube terminations that require only a small number\nof pentagons to be formed.25 The larger number of defects observed here results from the\ngrowth conditions: the carbon chemical potential chosen to obtain realistic structures in\na reasonable, although long, CPU time is probably too high. Under such conditions, the\ngrowth is too fast and the defects formed have a very small probability to be healed.\n\nThe GCMC calculations presented above indicate that there is an optimal carbon\nchemical potential to grow sp2 carbon caps on a very small Ni droplet. When the carbon\nchemical potential is large enough, carbon nanostructures are formed outside the Ni droplet,\nwhile some carbon atoms remain adsorbed on the surface, in close contact with Ni atoms,\nor even diffuse inside the particle. The mole fraction of these inner C atoms depends on\nthe carbon chemical potential and on the temperature, as indicated by comparing with our\nprevious calculations at 1500 K.20 We note here that it also depends on the particle size\nand on the structural state of the Ni cluster. In order to analyze these latter points, we\nperformed the same calculations on a larger disordered droplet with 108 Ni atoms and on\nface centered cubic clusters with a truncated octahedron shape that minimizes their total\n(surface + volume) energy. These so called Wulff-shaped clusters have only (111) and (100)\nfacets. Three sizes were considered: 201, 405 and 807 Ni atoms. At 1000 K and μC = -5.25\neV/atom, the results are qualitatively the same, as far as the cap formation is concerned.\nAs shown in figure 3, more or less defective carbon layers are formed on the cluster surface.\nTheir shape is imposed by the cluster geometry. In order to allow them to detach from the\nsurface, much longer runs should be performed, as has been done for the Ni50 disordered\ncluster. It is interesting to notice that the crystalline structure of the cluster is preserved,\nalthough the Ni atoms on the edges are less stable than the others and can be strongly\n8\n\n\fFIG. 2: Typical growth sequence during a GCMC simulation of the adsorption of C on a 50 Ni atom\ndisordered droplet at 1000 K and μC = -5.25 eV/atom. From left to right and top to bottom: 1)\ncarbon atoms or diatoms adsorbed; 2) chains growing; 3 and 4) cap formed; 5 and 6) cap detaches\nfrom the Ni droplet. Nickel atoms are represented in orange, inner carbon atoms are in green and\nouter carbon atoms are in grey. See text for the definition of \"inner\" and 'outer\" carbon atoms.\n\ndisplaced, as shown on the right hand image in figure 3.\n\nA visual inspection of the structures obtained seems to indicate that the number of\ndissolved C atoms is smaller in the case of crystalline structures than in the disordered ones.\nThis is confirmed by the analysis of the mole fraction of inner carbon atoms as a function\nof the number of Monte Carlo macrosteps, plotted in figures 4 and 5. For the disordered\nstructures, the mole fraction of inner C atoms is calculated with respect to the total number\nof Ni atoms (respectively 50 and 108), because the particles are small and C atoms tend to\ndiffuse in the whole structure. As mentioned above, for the fcc clusters, the mole fraction of\ninner C atoms is calculated with respect to a smaller number of Ni atoms. These different\n9\n\n\fFIG. 3: Typical configurations resulting from GCMC simulations of the growth of C on nickel\nfcc Wulff-shaped clusters at 1000 K and μC = -5.25 eV/atom. Left: 201, center: 405 and right:\n807 Ni atoms. The active zones for the GCMC calculations were the topmost 60%, 50% and 40%\nrespectively (see text). Nickel atoms are represented in orange, \"inner\" carbon atoms are in green\nand \"outer\" carbon atoms are in grey. See text for the definition of \"inner\" and \"outer\" carbon\natoms.\n\nways of calculating the mole fractions tend to minimize the differences between the carbon\nsolubilities in crystalline or disordered clusters. At 1000 K and μC = -6.00 eV/atom (see\nfigure 4), the difference is quite clear, with about 40% C adsorbed on, or dissolved in, the\ndisordered cluster and about 15% C atoms, mostly adsorbed on the surface or subsurface\nsites of the crystalline clusters. The same holds for the runs at μC = -5.25 eV/atom. However, a striking difference can be noticed between the two situations. At μC = -6.00 eV/atom\nthe mole fraction of inner carbon atoms gently rises during the course of the Monte Carlo\nrun to reach an equilibrium value. At μC = -5.25 eV/atom, the number of carbon atoms\nadsorbed on the cluster surface increases very rapidly at the beginning of the process, then\ndecreases and rises again. During this process the total number of carbon atoms constantly\nincreases. The sharp peak observed in the inner carbon concentration at the beginning of\nthe adsorption process corresponds to the adsorption of individual C atoms on the cluster\nsurface. As soon as the concentration of surface C atoms is large enough, they tend to\nform chains and then sp2 structures that detach from the surface, explaining the depletion\nof C at the surface. At lower chemical potential, this surface concentration threshold is\nnever reached and the C atoms gradually diffuse towards subsurface or bulk interstitial sites.\n\n10\n\n\fFIG. 4: Mole fractions of surface and subsurface carbon atoms, \"inner\" carbon atoms in the text,\nas a function of the number of outer Monte Carlo loops (macrosteps), calculated at 1000 K and\nμC = -6.00 eV/atom. Black circles: Ni50 liquid droplet. Pink squares: Ni108 liquid droplet. Red\nup-pointing triangles: fcc 201 Ni cluster. Green down-pointing triangle: fcc 405 Ni cluster. Blue\ndiamond: fcc 807 Ni cluster.\n\nSummarizing this paper, we study the early stages of the formation of carbon nanostructures on small nickel clusters. The GCMC method used enables us to emphasize the\ncritical role of the carbon chemical potential on the resulting structure. We show that an\noptimal chemical potential value exists to nucleate nanotube caps. Because of the short\ntime scale spanned by the computer simulations as compared to the hundreds of seconds of\nthe experiments, the cap structures obtained are much more defective than what is assumed\n11\n\n\fFIG. 5: Mole fractions of surface and subsurface carbon atoms, \"inner\" carbon atoms in the text,\nas a function of the number of outer Monte Carlo loops (macrosteps), calculated at 1000 K and μC\n= -5.25 eV/atom. Black circles: Ni50 liquid droplet. Red up-pointing triangles: fcc 201 Ni cluster.\nGreen down-pointing triangle: fcc 405 Ni cluster. Blue diamond: fcc 807 Ni cluster.\n\nfor the experimental ones. The coarse sampling of the chemical potential values by steps\nof 0.75 eV/atom also plays a role: less defective caps could probably be grown with μC\ncloser to -6.00 eV/atom, but this would require longer simulation times. Under suitable\ncarbon chemical potential and temperature conditions, the early stages of the growth\nare quite similar to what has been observed on flat surfaces,20 with the difference that\nthe curvature is imposed by the catalyst particle's size at the moment of the nucleation.\nThe atomistic growth mechanism is more or less in agreement with most of the previous\ncomputer simulation studies.14,15,16,19 However these authors do not take into account the\n\n12\n\n\fcarbon chemical potential that plays a critical role on the outer nanostructure formed,\nbut also on the surface state of the catalyst. In addition, we show that the presence of\ncarbon in surface, or interstitial subsurface or bulk sites depends on a second parameter\nthat is the structure of the catalyst particle. As in the case of the bulk phase diagram\nthat exhibits a low solubility of carbon in crystalline nickel, but a larger one in the liquid\nphase, we show that the carbon solubility is larger in disordered clusters.\n\nOur study\n\nis not yet complete since we should compare liquid and solid structures with the same\nnumber of atoms. This work is in progress. However, this is an important finding because\nthe surface state of the catalyst is of fundamental importance if one wishes to understand the origin of the chiral selectivity that has been reported for instance by Bachilo et al..3\n\nAcknowledgments\n\nPart of this work is supported by the Belgian Program on Interuniversity Attraction Poles\n(PAI6) on \"Quantum Effects in Clusters and Nanowires\". H. A. acknowledges the use of\nthe Interuniversity Namur Scientific Computing Facility (Namur-ISCF), a common project\nbetween FNRS, SUN Microsystems, and Les Facultés Universitaires Notre-Dame de la Paix\n(FUNDP) and the LEMAITRE computer of UCL.\n\n1\n\nCarbon Nanotubes: Synthesis, Structure, Properties and Applications, edited by M. S. Dresselhaus, G. Dresselhaus, and P. Avouris (Springer, Berlin, 2001).\n\n2\n\nA. G. Nasibulin, P. V. Pikhitsa, and Hua Jiang, E. I. Kauppinen, Carbon 43, 2251–2257 (2005).\n\n3\n\nS.M. Bachilo, L. Balzano, J. E. Herrera, F. Pompeo, D. E. Resasco, and R. B. Weisman, J. Am.\nChem. Soc., 125, 11186–7 (2003).\n\n4\n\nS. Reich, L. Li, and J. Robertson, Chem. Phys. Lett. 421, 469–72 (2006).\n\n5\n\nG. Lolli, L. Zhang, L. Balzano, N. Sakulchaicharoen, Y. Tan, and D. E. Resasco, J. Phys. Chem.\nB, 110, 2108–2115 (2006).\n\n6\n\nS. Helveg, C. Lopez-Cartes, J. Sehested, P. L. Hansen, B. S. Clausen, J. R. Rostrup-Nielsen, F.\nAbild-Pedersen, and J. K. Nørskov, Nature, 427, 6973, 426–9 (2004).\n\n13\n\n\f7\n\nH. Zhu, K. Suenaga, A. Hashimoto, K. Urita, K. Hata, and S. Iijima, Small 1, 12, 1180–3\n(2005).\n\n8\n\nS. Hofmann, R. Sharma, C. Ducati, G. Du, C. Mattevi, C. Cepek, M. Cantoro, S. Pisana,\nA. Parvez, F. Cervantes-Sodi, A. C. Ferrari, R. Dunin-Borkowski, S. Lizzit, L. Petaccia, A.\nGoldoni, and J. Robertson, Nano Letters, 7, 602–8 (2007).\n\n9\n\nM. Lin, J. Pei Ying Tan, C. Boothroyd, Kian Ping Loh, Eng Soon Tok, and Yong-Lim Foo,\nNano Letters, 6, 449–52 (2006).\n\n10\n\nX. Fan, R. Buczko, A. A. Puretzky, D. B. Geohegan, J.Y. Howe, S.T. Pantelides, and S. J.\nPennycook, Phys. Rev. Lett. 90, 145501 (2003).\n\n11\n\nS. Hofmann, G. Csanyi, A. C. Ferrari, M. C. Payne, and J. Robertson, Phys. Rev. Lett. 95,\n036101 (2005).\n\n12\n\nF. Abild-Pedersen, J. K. Norskov, J. R. Rostrup-Nielsen, J. Sehested, and S. Helveg, Phys. Rev.\nB 73, 115419 (2006)\n\n13\n\nJ. Gavillet, A. Loiseau, C. Journet, F. Willaime, F. Ducastelle, and J.-Ch. Charlier, Phys. Rev.\nLett. 87, 275504 (2001).\n\n14\n\nJ. Y. Raty, F. Gygi, and G. Galli, Phys. Rev. Lett. 95, 096103 (2005).\n\n15\n\nF. Ding and K. Bolton, Nanotechnology 17, 543–8 (2006).\n\n16\n\nF. Ding and K. Bolton, and A. Rosén, J. Phys. Chem. B 121, 2775 (2004); Chem. Phys. Lett.\n393, 309 (2004); J. Chem. Phys. 121, 2775 (2004).\n\n17\n\nY. Shibuta and S. Maruyama, Chem. Phys. Lett. 382, 381 (2003).\n\n18\n\nQ.-M. Zhang, J. C. Wells, X. G. Gong, and Z. Zhang, Phys. Rev. B 69, 205413 (2004).\n\n19\n\nJ. Zhao, A. Martinez-Limia, and P. B. Balbuena, Nanotechnology 16, S575–81 (2005).\n\n20\n\nH. Amara, Ch. Bichara, and F. Ducastelle, Phys. Rev. B 73, 11304(2006).\n\n21\n\nH.\n\nAmara,\n\nThèse\n\nde\n\nDoctorat,\n\nUniv.\n\nParis\n\nVI\n\n(2005);\n\navailable\n\nat\n\nhttp://lem.onera.fr/Theses.html.\n22\n\nThe Recursion Method and Its Applications, R. Haydock ed., Springer Series in Solid State\nSciences, 58 (1984); see also the contributions to Solid State Physics 35 (1980).\n\n23\n\nD. Frenkel and B. Smit, Understanding Computer Simulation, (Academic Press, London, 1996).\n\n24\n\nW. Vervisch, C. Mottet, and J. Goniakowski, Phys. Rev B 65, 245411 (2002).\n\n25\n\nG. Brinkmann, P. W. Fowler, and D. E. Manolopoulos, A. H. R. Palser, Chem. Phys. Lett. 315,\n335–47 (1999).\n\n14\n\n\f"}