{"id": "http://arxiv.org/abs/1112.5208v1", "guidislink": true, "updated": "2011-12-22T00:09:17Z", "updated_parsed": [2011, 12, 22, 0, 9, 17, 3, 356, 0], "published": "2011-12-22T00:09:17Z", "published_parsed": [2011, 12, 22, 0, 9, 17, 3, 356, 0], "title": "Magneto-quantum-nanomechanics: ultra-high Q levitated mechanical\n  oscillators", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1112.1250%2C1112.0202%2C1112.0867%2C1112.4276%2C1112.3308%2C1112.5522%2C1112.6166%2C1112.4981%2C1112.5449%2C1112.5103%2C1112.0067%2C1112.1594%2C1112.5487%2C1112.5200%2C1112.2393%2C1112.1847%2C1112.0933%2C1112.0235%2C1112.4412%2C1112.1497%2C1112.4780%2C1112.2879%2C1112.5125%2C1112.0687%2C1112.5814%2C1112.2830%2C1112.1275%2C1112.4850%2C1112.0824%2C1112.2156%2C1112.2531%2C1112.1701%2C1112.2818%2C1112.4242%2C1112.5399%2C1112.2491%2C1112.0613%2C1112.1836%2C1112.5587%2C1112.0127%2C1112.4685%2C1112.3707%2C1112.1409%2C1112.4065%2C1112.1641%2C1112.2963%2C1112.2291%2C1112.5166%2C1112.3089%2C1112.5713%2C1112.4675%2C1112.5484%2C1112.6357%2C1112.0422%2C1112.4063%2C1112.2813%2C1112.1819%2C1112.2532%2C1112.2210%2C1112.4041%2C1112.3802%2C1112.5289%2C1112.1101%2C1112.4365%2C1112.2783%2C1112.4848%2C1112.3601%2C1112.3347%2C1112.3160%2C1112.5288%2C1112.0087%2C1112.5261%2C1112.3421%2C1112.0393%2C1112.0875%2C1112.4241%2C1112.1633%2C1112.2911%2C1112.5445%2C1112.1027%2C1112.0949%2C1112.3456%2C1112.1459%2C1112.2163%2C1112.0975%2C1112.4717%2C1112.3508%2C1112.1059%2C1112.5693%2C1112.0485%2C1112.6261%2C1112.5633%2C1112.4399%2C1112.3048%2C1112.4652%2C1112.4487%2C1112.5208%2C1112.4453%2C1112.2657%2C1112.3800%2C1112.4814&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Magneto-quantum-nanomechanics: ultra-high Q levitated mechanical\n  oscillators"}, "summary": "Engineering nano-mechanical quantum systems possessing ultra-long motional\ncoherence times allow for applications in ultra-sensitive quantum sensing,\nmotional quantum memories and motional interfaces between other carriers of\nquantum information such as photons, quantum dots and superconducting systems.\nTo achieve ultra-high motional Q one must work hard to remove all forms of\nmotional noise and heating. We examine a magneto-nanomechanical quantum system\nthat consists of a 3D arrangement of miniature superconducting loops which is\nstably levitated in a static inhomogenous magnetic field. The resulting\nmotional Q is limited by the tiny decay of the supercurrent in the loops and\nmay reach up to Q~10^(10). We examine the classical and quantum dynamics of the\nlevitating superconducting system and prove that it is stably trapped and can\nachieve motional oscillation frequencies of several tens of MHz. By inductively\ncoupling this levitating object to a nearby flux qubit we further show that by\ndriving the qubit one can cool the motion of the levitated object and in the\ncase of resonance, this can cool the vertical motion of the object close to\nit's ground state.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1112.1250%2C1112.0202%2C1112.0867%2C1112.4276%2C1112.3308%2C1112.5522%2C1112.6166%2C1112.4981%2C1112.5449%2C1112.5103%2C1112.0067%2C1112.1594%2C1112.5487%2C1112.5200%2C1112.2393%2C1112.1847%2C1112.0933%2C1112.0235%2C1112.4412%2C1112.1497%2C1112.4780%2C1112.2879%2C1112.5125%2C1112.0687%2C1112.5814%2C1112.2830%2C1112.1275%2C1112.4850%2C1112.0824%2C1112.2156%2C1112.2531%2C1112.1701%2C1112.2818%2C1112.4242%2C1112.5399%2C1112.2491%2C1112.0613%2C1112.1836%2C1112.5587%2C1112.0127%2C1112.4685%2C1112.3707%2C1112.1409%2C1112.4065%2C1112.1641%2C1112.2963%2C1112.2291%2C1112.5166%2C1112.3089%2C1112.5713%2C1112.4675%2C1112.5484%2C1112.6357%2C1112.0422%2C1112.4063%2C1112.2813%2C1112.1819%2C1112.2532%2C1112.2210%2C1112.4041%2C1112.3802%2C1112.5289%2C1112.1101%2C1112.4365%2C1112.2783%2C1112.4848%2C1112.3601%2C1112.3347%2C1112.3160%2C1112.5288%2C1112.0087%2C1112.5261%2C1112.3421%2C1112.0393%2C1112.0875%2C1112.4241%2C1112.1633%2C1112.2911%2C1112.5445%2C1112.1027%2C1112.0949%2C1112.3456%2C1112.1459%2C1112.2163%2C1112.0975%2C1112.4717%2C1112.3508%2C1112.1059%2C1112.5693%2C1112.0485%2C1112.6261%2C1112.5633%2C1112.4399%2C1112.3048%2C1112.4652%2C1112.4487%2C1112.5208%2C1112.4453%2C1112.2657%2C1112.3800%2C1112.4814&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Engineering nano-mechanical quantum systems possessing ultra-long motional\ncoherence times allow for applications in ultra-sensitive quantum sensing,\nmotional quantum memories and motional interfaces between other carriers of\nquantum information such as photons, quantum dots and superconducting systems.\nTo achieve ultra-high motional Q one must work hard to remove all forms of\nmotional noise and heating. We examine a magneto-nanomechanical quantum system\nthat consists of a 3D arrangement of miniature superconducting loops which is\nstably levitated in a static inhomogenous magnetic field. The resulting\nmotional Q is limited by the tiny decay of the supercurrent in the loops and\nmay reach up to Q~10^(10). We examine the classical and quantum dynamics of the\nlevitating superconducting system and prove that it is stably trapped and can\nachieve motional oscillation frequencies of several tens of MHz. By inductively\ncoupling this levitating object to a nearby flux qubit we further show that by\ndriving the qubit one can cool the motion of the levitated object and in the\ncase of resonance, this can cool the vertical motion of the object close to\nit's ground state."}, "authors": ["M. Cirio", "J. Twamley", "G. K. Brennen"], "author_detail": {"name": "G. K. Brennen"}, "author": "G. K. Brennen", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.109.147206", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1112.5208v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1112.5208v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "24 pages, 13 figures", "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1112.5208v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1112.5208v1", "journal_reference": "Phys. Rev. Lett. 109, 147206 (2012)", "doi": "10.1103/PhysRevLett.109.147206", "fulltext": "Magneto-quantum-nanomechanics: ultra-high Q\nlevitated mechanical oscillators\n\narXiv:1112.5208v1 [quant-ph] 22 Dec 2011\n\nM. Cirio1,† , J. Twamley1 , G.K. Brennen1 .\n1\n\nCentre for Engineered Quantum Systems, Department of Physics and Astronomy,\nMacquarie University, North Ryde, NSW 2109, Australia\nE-mail: mauro.cirio@students.mq.edu.au\nAbstract. Engineering nano-mechanical quantum systems possessing\nultra-long motional coherence times allow for applications in ultra-sensitive\nquantum sensing, motional quantum memories and motional interfaces\nbetween other carriers of quantum information such as photons, quantum\ndots and superconducting systems. To achieve ultra-high motional Q one\nmust work hard to remove all forms of motional noise and heating. We\nexamine a magneto-nanomechanical quantum system that consists of a 3D\narrangement of miniature superconducting loops which is stably levitated in\na static inhomogenous magnetic field. The resulting motional Q is limited\nby the tiny decay of the supercurrent in the loops and may reach up to\nQ ∼ 1010 . We examine the classical and quantum dynamics of the levitating\nsuperconducting system and prove that it is stably trapped and can achieve\nmotional oscillation frequencies of several tens of MHz. By inductively\ncoupling this levitating object to a nearby flux qubit we further show that\nby driving the qubit one can cool the motion of the levitated object and in\nthe case of resonance, this can cool the vertical motion of the object close\nto its ground state.\n\n†\n\nAuthor to whom any correspondence should be addressed.\n\n\f2\nContents\n1 Introduction\n\n2\n\n2 Toy Model\n\n3\n\n3 Model\n3.1 Resonator . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n3.2 Qubit . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n3.3 Interaction . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n\n4\n5\n8\n8\n\n4 Cooling\n4.1 Cooling scheme A: Introduction .\n4.1.1 Low Temperature Regime\n4.1.2 High Temperature Regime\n4.2 Cooling scheme B . . . . . . . . .\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n5 Results\n5.1 Classical Motion . . . . . . . . . . . . . . . . . . .\n5.2 Superconductivity and Dissipation . . . . . . . . . .\n5.3 Coupling between the resonator and the flux qubit.\n5.4 Cooling of the motional resonator. . . . . . . . . . .\n5.4.1 Cooling scheme A. . . . . . . . . . . . . . .\n5.4.2 Cooling scheme B. . . . . . . . . . . . . . .\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n\n9\n9\n10\n11\n11\n\n.\n.\n.\n.\n.\n.\n\n12\n12\n14\n15\n15\n15\n18\n\n6 Conclusions\n\n19\n\n7 Acknowledgements\n\n20\n\n8 Parameter Table\n\n21\n\nAppendix\nHigh temperature\nA\nregime final occupation number\n\n21\n\nReferences\n\n24\n\n1. Introduction\nRecently there has been considerable effort towards mapping the boundary between the\nclassical and the quantum world by exploring the physics of mesoscopic and macroscopic\nmechanical systems. From an applications point of view, as precision measurement\nof position and acceleration generally involve some kind of motion, the necessity of\nbuilding smaller and more sensitive devices has required a more careful exploration of\nthe classical-quantum limit.\nThe possibility to couple, control and measure micro-mechanical motion in a wide\nrange of different physical systems leads to new experimental applications in different\n\n\f3\nfields such as measuring forces between individual biomolecules [1, 2, 3], magnetic\nforces from single spins [4], perturbations due to the mass fluctuations involving single\natoms and molecules [5], pressure [6] and acceleration [6], fundamental constants\n[7], small changes in electrical charge [8], gravitational wave detection [9], as well as\napplications in quantum computation [10], quantum optics [11] and condensed matter\nphysics [12, 13].\nObserving any quantum properties of a mechanical system is a challenge. Under\ntypical conditions, energy losses, thermal noise and decoherence processes make it\nimpossible to observe any motional quantum effects. To observe quantum mechanical\nmotional effects the system has to be close enough to its ground state and it has to\npreserve this quantum coherence for a reasonable amount of time. This leads to the\nnecessity of engineering ultra-low dissipative systems (which, in oscillating systems, is\nmeasured by the quality factor Q representing the energy lost per cycle). To achieve\nthis one must engineer a system which is mechanically isolated from it's surroundings\nto an extreme level. On the other hand one must also find a way to cool down the\nmotion close to its motional ground state which necessities coupling that system to\nanother in order to dump entropy. Numerous nano-mechanical oscillating systems have\nbeen recently studied such as cavity optomechanical experiments employing cantilevers\n[14], micro-mirrors [15, 16], micro-cavities [17, 18], nano-membranes [19], macroscopic\nmirror modes [20] and optically levitated nanospheres [21] (see [22]). As shown in\nRef. [23], it has been possible to create and control quantum states but, except in a\nfew cases, reaching large Q for nano to microscopic sized motional devices is still an\nopen problem. In fact, a mechanical oscillator usually involves many degrees of freedom\ncoupled together while we are interested in the quantum behaviour of one of them: the\ncentre of mass motion.\nIn our work, we present a theoretical model for a mesoscopic mechanical oscillator.\nIt is inherently non-dissipative (with a estimated Q ∼ 1010 ). It consists of a cluster\nof superconducting loops levitating in vacuum and its motion can be completely\ncharacterized by the six degrees of freedom of a rigid body. Controlling the system\nis possible through an interaction with a nearby flux qubit which is tuned and driven\nto allow the levitated structure to be cooled close to it's motional ground state.\nWe will show how to cool the center of mass motion along one degree of freedom to the\nground state in an efficient way by coupling the loop inductively to a flux qubit.\n2. Toy Model\nIn order to achieve a qualitative understanding of the dynamics of the levitated system\npresented here we will start by studying a simple 2-dimensional toy model [24] which\ndescribes how it is possible to take advantage of the Meissner effect to obtain a stable\nmagnetically levitated mechanical system. For this toy model, we consider a wire loop\nof superconducting material oriented in a vertical plane (Fig. 1) and threaded by a\ndiscontinuous horizontal magnetic field which is uniform and non-zero above a certain\n\n\f4\n\nFigure 1. A metallic wire loop in a discontinuous magnetic field. When released to\nfall under gravity the change in flux caused by the loops' motion will induce current\nflow in the wires which will oppose the downwards motion and the loop's height will\nundergo harmonic oscillation. For wires made from normal metals the oscillations\nare damped due to resistance within the wires and the loop will eventually fall but\nfor superconducting wires the oscillations will continue for many periods yielding a\nmotional oscillator with extremely high motional Q factor.\n\nheight and which vanishes below. Initially the loop is at rest at a position where it\ncrosses the magnetic field discontinuity line.\nWhen the loop falls under the force of gravity, the changing magnetic flux within\nthe loop will induce circulating currents which generate Lorentz forces that counteract\nthe downwards motion of the loop. If the loop is made up of normal conducting material\nthe loop will undergo harmonic motion in the vertical plane which will be damped (due\nto resistances within the wire). The currents generating the Lorentz forces will dissipate\nand the loop will eventually fall down. However, let's consider the wires to be fashioned\nfrom superconducting material. In this case things change due to the Meissner effect\nwhich induces currents such that the flux φ through the loop remains constant at all\ntimes. With reference to the notation set up in Fig. 1, the flux at loop position x\nis given by φ(x) = wBx. The flux due to the induced current I(x) is given by the\nusual formula LI, where L is the loop inductance. Thus, the Meissner effect tells us\nthat: LI(x) = wBx. Using this result and noting that the loop's potential energy is\nV (x) = 21 LI 2 (x) − mgx, one can see that this system corresponds to a gravitationally\ndriven harmonic oscillator.\n3. Model\nThe above 2D toy model is obviously not completely trapped if naively generalised to\n3D. To achieve stable three dimensional trapping we must generalise the above toy\n\n\f5\nmodel in a more sophisticated manner. Let us now consider the system sketched in\nFig. 2. We consider a spatially strongly inhomogeneous magnetic field generated by a\nfixed magnetized sphere placed above a cluster (the motional resonator) of three nonintersecting loops oriented along mutually orthogonal planes. This particular shape will\nallow the potential energy of the system to have a stable minimum and also leads to\na diagonal inductance matrix, so that the current flowing in one loop does not induce\nany currents in the other loops. A flux qubit is placed at a certain distance from the\ncenter of the cluster of loops. The inductive coupling between the flux qubit and the\ncluster will provide us with the control required to establish motional cooling of the\nlevitated cluster. In the following we first study the system classically to establish full\n3D trapping, translation/rotation oscillation frequencies at the trap minimum, before\nstudying the quantum mechanics and motional cooling protocols to cool the vertical\ntranslational degree of freedom towards the ground state.\nThe total Hamiltonian H is the sum of terms involving the motional resonator (Hr ),\nthe qubit (Hq ) and the interaction (HI ):\nH = Hr + Hq + HI ,\n\n(1)\n\nand in the following sections we develop each of these individual Hamiltonians.\n3.1. Resonator\nThe Hamiltonian of the cluster of loops (which we will now denote as the motional\nresonator or simply resonator), can be written in the following form:\nHr = KCM + Krot + V ,\n\n(2)\n\nwhere KCM is the kinetic energy due to the translational motion of the center of\nmass, Krot is the rotational kinetic energy and V is the effective potential energy as a\nfunction of the translational and rotational degrees of freedom. We will now define some\nnotation used in the following.\n• m: mass of the resonator.\n~ vector position of the various part of the resonator in a co-rotating reference\n• X:\nframe with origin at the center of mass.\n~ coordinates of the center of mass in the laboratory reference frame.\n• R:\n• ~ ̃r: vector position of the various part of the resonator in the laboratory frame.\n~\n• ~r = ~ ̃r − R\nNote that the origin of the laboratory frame is taken to be at the center of the magnetic\nsphere (see Fig. 2).\n~ t) and\nBecause of the rigid body properties, the only P\nallowed relation between r(X,\n~ is given by r(X,\n~ t) = O(t)X,\n~ where O = e i αi (t)Ti (with (Ti )jk = \u000fijk ) is a roX\ntation matrix and αi ∈ [−π, π]. We can then define the angular velocity vectors as:\nΩi = O(t)−1 Ȯ(t) = α̇i Ti . The motion of the rigid body is thus completely determined\n\n\f6\n\nFigure 2. Cluster of three insulated superconducting loops levitating in a magnetic\nfield generated by a magnetized sphere with magnetization vector directed towards the\npositive î direction. (A) In the laboratory frame the axes are labeled {x̂j }3j=1 . For each\naxes we have angular coordinates αi (labeled accordingly) corresponding to rotation\naround that axes in a counterclockwise sense. The reference system has the center\nof the sphere as origin. The loops are considered non-intersecting (i.e. no electrical\nconduction between the loops). The dimensions of the sides of the cluster of loops\nparallel to axis xi we take to be hi . We depict the magnetic vector field generated\nby the spherical magnet and the nearby flux qubit (which we take to be a 3-junction\nphase qubit), sitting under the cluster on a yellow substrate. (B) More detailed view\nof the cluster of loops.\n\n~ α\nby the set of variables (R,\n~ ).\n\u0010\n\u0011\nR\n2\n~\n~\n~\n~\nGiven these definitions, the inertia tensor of the resonator is Iij = dVr ρ(X) X δij − Xi * Xj .\nThe kinetic energies are defined with respect to the reference system in Fig. 2 as:\n1 X 2\nṘi ,\nKCM = m\n2\ni\n1X\nKrot =\nIij Ωi Ωj ,\n2 i,j\n\n(3)\n(4)\n\n\f7\nThe potential V is just the sum of the flux energy due to the current flowing in the\nloops and the gravitational potential energy:\n3\n\n1X\nLa Ia2 − mgR1 ,\nV =\n2 a=1\n\n(5)\n\nwhere the index a = 1, 2, 3 labels the loops accordingly to the direction\nperpendicular to the plane of the loop (where 1 → î, 2 → ĵ, 3 → k̂), La is the inductance\nof the loop a and Ia is the current flowing in the loop a. By the symmetry of the resonator\nthe mutual inductances between the loops is zero. The currents are just functions of the\nsix degrees of freedom (translations, rotations), describing the motion of the resonator\nvia equations originating from the Meissner effect:\n~ α\n~ α\n∆φa (R,\n~ ) + La Ia (R,\n~) = 0 ,\n\n(6)\n\n~ α\n~ α\n~\nwhere ∆φa (R,\n~ ) = φa (R,\n~ )−φa (R(0),\nα\n~ (0)) is the difference in magnetic flux threading\n~ α\nloop a when the system is in the configuration labeled by (R,\n~ ) and when the system\n~\nis in its initial configuration (R(0),\nα\n~ (0)). Any infinitesimal change in flux due to an\ninfinitesimal displacement/rotation induces a supercurrent whose action is to restore the\nloop's position/orientation. The stronger this restoring force is the higher the oscillation\nfrequency will be. We now compute the dependence of the magnetic flux on the system's\nconfiguration.\nWe start by calculating the magnetic flux threading the loops. The vector potential\n~ generated by a sphere with homogeneous magnetization vector M\n~ calculated at the\nA\n~ (where R\n~ is the center of mass position vector referenced from the centre\npoint ~r + R\nof our coordinate system - the centre of the sphere), is just:\n1\n~ r; M\n~ , R)\n~ = μ0\n~ ∧ (~r + R)\n~ .\nA(~\nM\n~ 3\n4π |~r + R|\n\n(7)\n\n~ a the area vector of loop a, then the flux through this loop can\nIf we denote with Σ\nbe expressed as:\nZ\nZ\n~\n~\n~\n~ * d~r .\nφa (R, α\n~) =\nB * dΣa =\nA\n(8)\nΣ\n\n∂Σa\n\nIn a first order approximation and by supposing that the initial position of the\nresonator is such that αi = 0, we have:\n∆φa =\n\nμ0 ~\n~\n~ a * [M\n~ ∧α\n(Ka * [~r − R(0)\n∧α\n~] + Q\n~ ]) ,\n4π\n\n(9)\n\n~ a and Q\n~ a are easily calculated from the magnetic field and the sphere\nwhere the vectors K\nmagnetization. By using Eq. (5) and Eq. (6) we can expand the potential energy to\nsecond order in spatial and angular coordinates as:\n1\nE = Eij ζ i ζ j ,\n2\n\n(10)\n\n\f8\nwhere ζ~ = {x, y, z, αx , αy , αz }, is a vector whose components are all the parameters\ndescribing the motion and where the matrix elements Eij depend on the vectors defined\njust above.\nIn Section 5 we will show how certain choices of the parameters of our system can\nlead to a decoupled degree of freedom (the vertical direction with associated variable\nR1 ), with a quite high oscillating frequency ωr . This frequency is also well resolved\nwith respect to the frequencies of the other modes (the difference between frequencies\nis bigger than the linewidth of the resonator), hence it can be well resolved by the qubit\ncoupling. Note however, that this mode is strictly decoupled from other rotational and\nmotional modes only to second order in perturbation theory hence it is important that\nthe system be initialized not too far from equilibrium. We will consider the quantized\nvariable corresponding to small deviations from the initial position along the î axis:\n~ 0 ), whose quantum operator we\nx ≡ R1 − x0 (x0 being the x component of the vector R\ndefine as:\nr\n~\n)(â + â† ) .\n(11)\nx̂ = (\n2mωr\nThe dynamics of this variable is governed by an harmonic Hamiltonian whose frequency\nωr can be obtained through the energy given above in Eq. (10).\n3.2. Qubit\nThe flux qubit is considered to have characteristic frequency ωq and to be driven by\na classical field of frequency ωd slightly detuned by ωq . The detuning parameter is\nδ = ωd − ωq . The field drives the qubit with Rabi frequency Ω. The Hamiltonian in the\nrotating frame with frequency ωd is:\nδ\nΩ\nĤq = − σ̂z + σ̂x .\n2\n2\n\n(12)\n\n3.3. Interaction\nThe classical interaction Hamiltonian for the inductive coupling between the loops of\nthe cluster and the loop of the flux qubit is given by:\nHI = Mrq Ir Iq ,\n\n(13)\n\nwhere Mrq is the mutual inductance between the qubit and the loop of the resonator\nwhich is horizontal in the initial position and Ir = I1 and Iq are the currents flowing\nin that loop and in the qubit. Because we are considering small deviations from the\nequilibrium initial position, we neglect the mutual interactions between the other loops\nor due to the angular motion of the object. We will consider the dependence of the\ncoupling in the vertical direction by performing a first order expansion. We expand Ir\nto first order in small deviations from the initial position using (9). In the quantized\n\n\f9\nversion we also replace Iq with Iq σ̂z (see for example [25]). Denoting DI (0) =\n\n∂Ir\n∂x ~\nR(0)\n\nas\n\nthe derivative of the current evaluated at the initial cluster position and remembering\n(11) we write the quantized interaction Hamiltonian as:\nĤI = ~\n\nλ\n(â + â† )σ̂z ,\n2\n\n(14)\n\nwith:\n\u0012r\nλ=\n\n2\nm~ωr\n\n\u0013\nM DIl (0)Iq .\n\n(15)\n\nThe mutual inductance is simply calculated as:\nZ\nμ0\nd~sd~s 0\nM=\n,\n(16)\n4π\nR\nwhere d~s and d~s0 are vectors tangent to the two loops and R is the distance between\nthe infinitesimal part of each loop and the integration is along each of the two loops.\nThe final quantized expression for the Hamiltonian describing the motion of the\ncluster in the vertical direction and its interaction with the qubit is (setting ~ = 1):\nΩ\nλ\nδ\nĤ = − σ̂z + σ̂x + ωr â† â + (â + â† )σ̂z .\n2\n2\n2\n\n(17)\n\nIn order to be in the motional quantum regime we must devise cooling schemes to bring\nthe resonator close to its motional ground state as described in the next section.\n4. Cooling\n4.1. Cooling scheme A: Introduction\nFollowing [26] we will consider the resonator and the qubit coupled to separate thermal\nbaths and interacting with each through the coupling HI (see Fig. 3).\nThe system's quantum motional state, ρ̂ evolves under the following master\nequation:\nρ̂ ̇ = −i[Ĥ, ρ̂] + L̂Γ (ρ̂) + L̂γ (ρ̂) .\n\n(18)\n\nThe qubit Liouville operator contains decay and dephasing with rates Γ⊥ and Γ|| :\nL̂Γ (ρ̂) =\n\nΓ⊥\n(Nq + 1)(2σ̂− ρ̂σ̂+ − σ̂+ σ̂− ρ̂ − ρ̂σ̂+ σ̂− ) +\n2\nΓ⊥\n+\n(Nq )(2σ̂+ ρ̂σ̂− − σ̂− σ̂+ ρ̂ − ρ̂σ̂− σ̂+ ) +\n2\nΓ||\n+ (σ̂z ρ̂σ̂z − ρ̂) ,\n2\n\n(19)\n\n\f10\n~ωq\n\nwhere Nq = (e kB T − 1)−1 , and where T is the temperature of the qubit bath. The\nLioville operator for the motional resonator is:\nγ\nL̂γ (ρ̂) = (Nth + 1)(2âρ̂â† − â† âρ̂ − ρ̂â† a) +\n2\nγ\n+ (Nth )(2â† ρ̂â − ââ† ρ̂ − ρ̂ââ† ) ,\n(20)\n2\nwhere the mechanical dissipation factor γ has been introduced, and the equilibrium\n~ωr\nphonon occupation number is Nth = (e kB T − 1)−1 .\nWe now trace out the qubit to find an effective equation of motion for the resonator.\nFrom this we will see that under certain cases we can obtain a motional cooling process\nbringing the cluster towards its motional ground state. We will consider the two different\ntemperature regimes studied in [26].\n\nFigure 3. Motional Cooling Scheme: we inductively couple (with strength λ), the\nmotion of the levitated resonator with a nearby flux qubit. The resonator looses\nenergy at rate γ due to coupling to a local phonon bath while the qubit experiences\nboth decay and dephasing at rates Γ⊥ and Γ|| . In addition we drive transitions in the\nqubit at rate Ω.\n\np\n4.1.1. Low Temperature Regime Here we consider a regime where λ Nth + 1/2 \u001c\nΓ⊥ , ωr , which is equivalent to the Lamb-Dicke regime in laser cooling (see [26] and references within). The first condition tells us that the qubit damps much faster than\nenergy can be transferred to it from the resonator. By observing that the parameter λ\ndescribes the position displacement kick of the resonator when the qubit undergoes a\nspin flip (see [26]), the second approximation essentially says that the back-reaction on\n\n\f11\nthe resonator following a qubit flip is small relative to the oscillator energy.\nThanks to these assumptions one can write the full density matrix as ρ̂(t) '\n⊗ ρ̂r (t) where ρ̂0q is the qubit steady state density matrix. In this way one can obtain\nan effective master equation for the resonator after having traced out the qubit. The\nresult can be encoded in a new effective mechanical damping factor given by Γ = ΓC + γ\nwith ΓC = S(ωr ) − S(−ωr ) where S(ω) denotes the qubit fluctuation spectrum:\nZ ∞\n\b\nλ2\neiωτ dτ hσ̂z (τ )σ̂z (0)i0 − hσ̂z i20 ,\n(21)\nS(ω) = Re\n2\n0\nρ̂0q\n\nand where h*i0 denotes the steady state expectation [26]. What interests us is the\nfinal motional occupation number which is given by:\nnLD =\n\nγNth\n+ N0 ,\nΓC\n\n(22)\n\nwhere N0 = S(−ωr )/ΓC , and the subscript stresses the Lamb-Dicke regime we are\nsupposing.\n4.1.2. High Temperature Regime As one can see from (22), for low enough Nth the final\noccupation number is given by N0 . Increasing the temperature of the motional bath we\nsee that the final occupation number\np grows linearly with Nth . However, when Nth is\nso large the previous assumptions λ Nth + 1/2 \u001c Γ⊥ , ωr do not hold true anymore it\nturns out [26] that, under the temperature independent assumptions (λ \u001c Γ⊥ , ωr ), one\ncan study situations in which the final occupation number is given by the more general\nformula:\n\u0013\n\u0012\n1−ζ\nnf = Nth ζ +\n,\n(23)\n1 + ζeI1 /(Nth ζη2 )\nwith parameters defined in Appendix A. As described in that section, in order to obtain\nthis formula one must consider the resonator's initial quantum state is given by the\ncoherent state |αihα| with |α|2 ∼ Nth a coherent state labeled by the parameter α as\ninitial condition. Given this assumption the \"renormalized\" cooling rate ΓC is an α\ndependent quantity.\n4.2. Cooling scheme B\nRather than use the scheme depicted in Fig 3, one can also cool the motion of the\nresonator (at least in the case of near resonance with the qubit) by performing a sequence\nof repeated measurements on the flux qubit inductively coupled to the resonator's\nposition [27].\nUsing a flux qubit made out of three superconducting loops with four Josephson\njunctions one [28, 29] can tune the magnetic energy bias ~δ to zero. We also assume\nthat the inductive coupling strength is much smaller than the qubit frequency (λ \u001c ωr ).\nThis will allow us to perform a rotating wave approximation on the Hamiltonian of the\n\n\f12\nfull system. We consider the system to be initially prepared in the separable state\ne−nβ~ωr\nρ0 = |gihg| ⊗ ρr with the resonator in the thermal state ρnr = hn|ρr |ni = 1−e\n−β~ωr . Then,\none performs N measurements on the qubit (with associated operator given by |gihg|\nand |eihe| where g (e) is the ground (excited) state) at times tj = jτ where τ is short\ntime interval. One finds that, provided the measurement outcome is always |gihg|, at\nthe conclusion of these N measurements the state of the resonator is [27]:\nX |μn |2N ρn |nihn|\nr\n,\n(24)\nρr (N ) =\nP\n(N\n)\nn≥0\ni∆τ /2\n, μn = e−i(n−1/2)ωr τ (cos Ωn τ + i sin Ωn τ cos 2θn ), Ωn =\np where μ0 = e\n√\n(∆ − ωr )2 /4 + g 2 n (n ≥ 1), tan 2θn = 2g n/(∆ − ωn ) (n ≥ 1) and where N indicates\nthe number of measurements. P (N ) is the probability this sequence of measurement\noutcomes occurs.\n\n5. Results\nHere we consider our 3D model in a more realistic setting and adopt physical parameters\nin the table shown in section 8. Using this physically realistic set of parameters we now\nexamine in more concrete detail the classical and quantum mechanics of the resonator\nand the levels of cooling achieved by the above outlined methods.\n\n5.1. Classical Motion\nWe now examine the classical motion of the resonator by focusing in particular on its\nstability and its frequency of oscillation.\nThe effect of the gravity in the potential energy V (x) causes a small and negligible shift\nof the potential minimum.\nBy considering the magnetization of the sphere to be aligned along the vertical x direction and expanding to second order the potential energy around its minimum, one finds\nthat the x-motion decouples from the other directions. One finds further the existence\nof three degrees of freedom which are \"zero modes\", i.e. do not contribute to the energy\nup to third order. One zero-mode is related to the rotational symmetry around the\nvertical axes. The other two are due to the coupling between the variables y(z) and\nαz (αy ). however, if one considers these contributions to higher orders these degrees of\nfreedom contribute to the energy value to give overall stability as shown in Fig. 5. For a\ncluster of loops of \"typical \"dimensions (as defined below) of (1, 10, 10) μm and with a\nwire thickness of 0.1 μm the root mean square thermal motion of the cluster at 15 mK\nis ∼ 10−12 m along the spatial directions and 10−6 radians along the αy and αz angular\ndirections (while there is symmetry along the other angular direction).\nThe frequency of the translational motions depends on the physical dimensions of\nthe cluster of loops. In Fig. 6 the frequency in the x and y-direction is plotted as a\n\n\f13\n\nFigure 4. Exact numerical evaluation of the potential energy (in units of E0 = ~ωr )\nas a function of the vertical\nq translational degree of freedom x (with origin the stable\n\npoint and in unit of x0 =\n\n~\nmωr ).\n\nFigure 5. Exact numerical evaluation of the potential energy as a function of the\nhorizontal translational degree of freedom y (with origin the stable point) and the\nangular degree of freedom αz . Because the potential is confining to third order in\nthese degrees of freedom the overall system is stable.\n\nfunction of a scaling factor k for the system. The values for all the parameters are\nexplicitly shown in the table in section 8.\nThe frequencies decrease as the scaling grows, showing that the trapping in the translational degrees of freedom is becoming less tight, but still present for a large range of size\nscales. In regards of the rotational degrees of freedom, even when the system is scaled\nup with a factor 10 with respect to the typical parameters, numerically we find that the\ntrapping is still achieved in the small oscillation regime (see section 3.1).\nIn summary, using the parameters shown the table in section 8, for small loops\nand very high magnetic field inhomogeneities the cluster of loops experiences stable,\nlevitated magnetic trapping. The frequency of oscillation along the x-direction is larger\nthan in the other directions making it easier to cool. For these reasons, in the following\nwe quantize the x-translational motion.\n\n\f14\n\nFigure 6. Translational mode frequency as a function of system size. The frequency\nalong the x̂ direction (blue line) and ŷ (and for symmetry reasons ẑ) direction (red\nline) are plotted as a function of the scaling factor k which defines the dimension of\nthe system. The radius of the magnetized sphere is defined as Rsp = k μm. The\ndimension of the parallelepiped enveloping the cluster of loops is k × (0.1, 1, 1)μm and\nthe thickness of the wires is k × 0.01 μm. The cluster mass scales as k 3 . When\nconsidering different values for the scale factor, the initial position of the center of\nthe cluster of loops is chosen to keep the distance between the center of the sphere to\nthe top of the cluster fixed at ∼ 1.1 Rsp where Rsp is the radius of the sphere. The\nfrequencies are higher for smaller sizes of the system. As \"typical\" parameters for the\nsystem we will consider the ones given by a scaling factor k = 10.\n\n5.2. Superconductivity and Dissipation\nThe superconducting loops are considered as made out of Niobium-Tin (NbSn) which, in\nnormal conditions, has very high critical magnetic field strength (∼ 30 T ), although, in\nour case, the situation is more critical due to the small thickness of the superconducting\nwires.\nWe now examine two types of motional decay mechanisms and estimate the resulting\nmotional Q for the resonator's motion. We first consider the loss in energy from the\nmoving resonator due to its action as a dipole emitter of radiation.\nIn Fig. 7 the intensity of the magnetic field (in Tesla) is plotted as a function of distance\nfrom the center of the magnetized sphere (radius 10μ m).\nAs we saw above, the motion of the cluster of loops is trapped in all three directions.\nDue to the Messnier effect, the greater the spatial excursion from its equilibrium position\nthe greater the current density inside the wires. Considering the physical parameters\ngiven in the table in section 8 we find typical current densities of ∼ (108 , 108 , 107 )A/m2\n(respectively in the loops perpendicular to the x̂, ŷ, ẑ directions).Considering each\ncurrent to be described by I = I0 e−iωt , where ω is the top frequency in each direction,\nby approximating the loops to be circular we can calculate the power dissipated by the\n\n\f15\n\nFigure 7. Magnetic field intensity along the vertical x̂.\n\noscillating currents as electromagnetic radiation as (see for example [30]):\nPrad =\n\n1 π 4π 2πr I0\n,\n26 c λ 2\n\n(25)\n\nwhere r is the radius of the loop and λ = c/ν (where c is the speed of light). From\nthis we observe that the power radiated is absolutely negligible.\nHowever, the main source of dissipation is the viscous drag of flux lines oscillating inside\nthe pinning wells inside the superconducting wires [7]. One can estimate the motional\nquality factor Q = ωγr for a system similar to (the two dimensional version of) the one\npresented here to be Q ≈ 1011 . In our calculations we will consider Q ≈ 1010 . Such\nan enormously high motional quality factor is already known in levitating systems [31]\n(Q ∼ 1012 ), although typically one finds motional Q values in the range ∼ 103 /106 for\ncavity optomechanical experiments [22]. The prospect for ultra-large motional Q is one\nof the primary benefits of our scheme.\n5.3. Coupling between the resonator and the flux qubit.\nIn this section we will study the coupling between the resonator and the flux qubit. The\npossibility to tune this coupling arises from the (distance dependent) inductive nature\nof the coupling.\nFig. 8 shows the value of the coupling strength between the qubit and the resonator as\na function of the distance d between the center of mass of the resonator and the center\nof the loop of the flux qubit the latter taken to be a circle of radius 5μm.\nWe observe that the coupling strength can be adjusted over quite a large range by\nfixing the distance between the qubit and the resonator.\n5.4. Cooling of the motional resonator.\n5.4.1. Cooling scheme A. In this cooling scheme the motional energy of the resonator\nis damped away thanks to the faster decay of the flux qubit.\nWe will start by studying the low temperature limit. This means that the Nth of the\n\n\f16\n\nFigure 8. Coupling constant between the qubit and the resonator. The coupling arise\nfrom the mutual inductance between the loops of the resonator and the qubit loop.\nBy supposing the loop of the qubit to be placed in a plance orthogonal to the vertical\ndirection, the contribution to the coupling comes, in a good approximation, from the\nloop of the resonator perpendicular to the x direction. The distance d is defined as the\ndistance between the center of mass of the resonator and the center of the qubit loop.\nThe qubit loop is supposed to have a 5μm long radius.\n\nq\nbath connected to the resonator must be such that λ Nth + 12 \u001c Γ⊥ , ωr is fulfilled.\nIn Fig. 9 we plot the final motional average Fock number as a function of the qubit\nresonance frequency ωq and Rabi frequency Ω, while in Fig. 10 we plot the same final\noccupation number as a function of ωq after fixing Ω to an optimal value. In particular,\n√\nwe chose the Rabi frequency Ω and the detuning δ to fulfill the relation ωq = Ω2 + δ 2 .\nFor comparison, the dashed line in Fig. 9 shows the equilibrium phonon number if the\nresonator is in equilibrium with a 15 mK thermal bath. The cooling happens in the\nregion defined by the dashed line. Fig. 10, which is a section of Fig. 9 obtained by fixing\nΩ.\nNow we move to a regime where no constraints on the temperature of the bath\nconnected to the resonator are imposed so that the only relations to be fulfilled are\nλ \u001c Γ⊥ , ωr . This will allow us to use an higher coupling constant with respect to the\nlow (but still non-zero) temperature limit, previously considered.\nFig. 11 shows the final expected cooled final motional Fock number nr in the case where\nthere exist a large frequency mismatch between the qubit and the resonator. As expected\nthe cooling is quite poor. For comparison, we also plot the dashed line labeled as nLD\nobtained from the low temperature theory extrapolated to high temperature (as given\nby Eq. (22)). One can see that in the low temperature regime the two theories agree\nwhile at high temperatures they disagree. Above a certain bath temperature cooling is\n\n\f17\n\nFigure 9. Contour plot representing the final occupation number (blue corrsponding\nto zero phonon and red corresponding to 200\nq phonons) versus the qubit parameters Ω\n\nand ωq with δ fixed by the constraint δ = ωq2 − Ω2 . The dashed line represents the\nphonon equilibrium number if the system is in equilibrium with a thermal bath with\ntemperature 15 mK. Cooling takes place for parameters inside the dashed line. The\nfrequency of the resonator has been taken to be such that ωr = 2π107 . The coupling\nbetween resonator and qubit has been set to 104 . With this value, the low temperature\napproximation is a good one for qubit frequencies such that ωq ≥ 109 .\n\nno longer possible. Below this bath temperature cooling is possible though in the far\noff-resonant case the degree of cooling is poor.\nIn Fig 11 we consider the case where the qubit and the resonator are vastly off resonance\nand this gives very poor cooling performance. One can expect the cooling to be far better\nwhen they are both on resonance. To achieve this, one must either reduce the qubit\nfrequency or increase the resonator frequency, possibly via new flux qubit designs [32] or\nby replacing the magnetized sphere with a magnetic tip [33] with much larger magnetic\nfield gradients.\nIn Fig. 12 we consider the same cooling process as in Fig. 12 but with the resonator\nnow resonant with the qubit. In this case the system shows a significant enhancement\nin the cooling rate which scales from γ = 0.1 (off-resonance) to γ + ΓC ∈ (5 × 102 , 102 )\n(resonant) for the regime where the cooling is still possible. The net result is that, even\nif the resonantor is connected to a very hot thermal bath (Nth ∼ 104 ), one can cool the\nsystem to a final average phonon number around nf ∼ 1.\nWe showed that the interaction between the qubit and the resonator leads to\nan increase of the cooling rate. Cooling is possible even when the initial effective\ntemperature is quite high. Cooling efficiency increases significantly when the resonator\n\n\f18\n\nFigure 10. Plot of the final occupation number as\nq a function of ωq with qubit\nparameters fixed as follows: Ω = 0.95ωq and δ =\nωq2 − Ω2 . This graph is just\nthe cross section of fig. 9 obtained by fixing Ω. The dashed line is the same as in fig.\n9 and represents the phonon equilibrium number if the system is in equilibrium with a\nthermal bath with temperature 15 mK. The frequency of the resonator has been taken\nto be such that ωr = 2π107 . The coupling between resonator and qubit has been set\nto 104 . With this value, the low temperature approximation is a good one for qubit\nfrequencies such that ωq ≥ 109 .\n\nFigure 11. Plot of the final occupation number as a function of the initial occupation\nnumber. The dashed line labeled as nLD represents the low temperature limit. The\nother dashed line represents the identity line. For this plot ωr = 2π107 , ωq = 109 ,\nλ = 105 .\n\nand the qubit are in resonance.\n5.4.2. Cooling scheme B. This scheme cools down the motion of the qubit using\nrepetited measurements on the qubit inductively coupled to the resonator. The cooling\nis achieved in the case in which the outcomes of the measurements always tell us that\n\n\f19\n\nFigure 12. Plot of the final occupation number as a function of the initial occupation\nnumber. The dashed line labeled as nLD represents the low temperature limit. The\nother dashed line represents the identity line. Here ωr = 109 , ωq = 109 , and λ = 105 .\nThe result is that cooling is possible in this resonance situation even if the bath\nconnected to the resonator is very hot (T ∼ 100 K).\n\nthe qubit is in the ground state. This \"lucky\" sequence happens with probability\nthat decays exponentially with the number of measurement but which, in the limit\nof infinite measurement does not vanish, but rather converges to the initial ground state\nprobability.\nHenceforth we suppose the qubit and the resonator are in resonance. The value of the\nfrequency has been fixed so to maximize the results given a maximum value for the\ncoupling λ = 5 MHz. Fig. 13 shows the final occupation number as a function of the\nnumber of measurements on the qubit. In this way it is possible to reach the ground\nstate after a quite limited number of measurements. As explained in [27], requiring equal\ntimes between measurements (which would be a technical difficulty) is not important\nand can be relaxed by introducing random time deviations. The situation would even\nimprove in this case.\n6. Conclusions\nWe presented here a mechanical oscillating system that is inherently non-dissipative\nthat utilizes superconducting material levitated in a vacuum via the Meissner effect.\nWe showed that the cluster of loops is trapped in a potential well given by a magnetic\nfield generated by a nearby magnetized sphere. Among the total of 6 degrees of freedom\nof the resonator we quantized the variable associated with the vertical direction as,\nin a second order approximation, it is decoupled from the other degrees of freedom\nand it possess the largest oscillating frequency. We also showed how to cool down the\nmotion of the system in the low temperature regime as well as in the high temperature\nregime through coupling to a qubit. The system allowed us to consider two different\n\n\f20\n\nFigure 13. Plot about the cooling by mean of measurements on the qubit. The blue\nline represents the plot of the final occupation number nf as a function of the number\nof measurements on the qubit. The red line represents the survival probabilty P (N )\nwhich, for N → ∞, goes to the initial probability to find the system in the ground\nstate. For this plot the resonator is interacting with a T = 15mK thermal bath and\nwe consider a resonant situation with ωr = ωq = 2.5 × 108 Hz, λ = 5 × 106 Hz and\nτ = ω10r s.\n\ncooling schemes which work very well in the case resonator and qubit are resonant. The\nsystem can be improved by considering stronger or higher gradient magnetic fields, which\ncould be achieved by replacing the magnetized sphere with other geometric magnetized\nobjects. This is not the only direction for further studies. In fact a complete analysis\nwould quantize all the degrees of freedom and would find a way to cool all of them (for\nexample by introducing other inductive couplings with other flux qubit).\n7. Acknowledgements\nWe thank Gerald Milburn for many helpful comments and discussions. This research\nwas supported by the ARC via the Centre of Excellence in Engineered Quantum Systems\n(EQuS), project number CE110001013.\n\n\f21\n8. Parameter Table\nVariable\n\nReference Value\n\nMeaning\n\nR\nR0\nM\nM̂\nρ\nr\nh1\nh2\nh3\nd\nΩ\nδ\nT1\nT2\nΓ⊥\nΓ||\nλ\nT\nQ\nωr\nγ\n\n10 μm\n110% R + 12 h1\n3.7\nm−3\nμ0\nx̂\n6.6 × 103 kg m−3\n50 nm\n1μm\n10μm\n10μm\n> 1μm\n(0.3 − 10) GHz\n−(1 − 100)%Ω\n0.5μs\n1μs\n\nωr\nQ\n\nRadius of the Sphere\nInitial distance from center of sphere\nMagnetization density\nMagnetization vector\nSuperconductor mass density (close to Nb3 Sn density)\nWires radius\nWires length along x\nWires length along y\nWires length along z\nDistance between qubit and cluster\nDriving Field Frequency\nDephasing\nQubit Decay Time\nQubit Dephasing TIme\nQubit Decay Rate\nQubit Dephasing Time\nInteraction between qubit and cluster\nTemperature\nEstimated Quality Factor\nMechanical Angular Velocity\nMechanical Energy-Damping Rate\n\nNq,r\nIq0\nm\nDIz (0)\n\n(e kB T − 1)−1\n10 nA\n4 × 10−15 kg\n≈ 7 × 105 A/m\n\nThermal Equilibrium Occupation Number\nQubit current\nCluster of loop mass\nCurrent derivative calculated at Origin\n\n1\n1\nT1 2NTLS+1\nT2−1 − 21 T1−1\n4\n5\n\n(10 , 10 )Hz\n15 mK\n1010\n2π10 MHz\n~ωq,r\n\nAppendix A. High temperature regime final occupation number\nBy supposing the initial state of the resonator to be a coherent state parametrized by\nthe complex variable α, and by supposing the time scale of the interaction to be much\nlonger than the time scale with which the resonator interacts with its bath (λT1 \u001c 1)\none can obtain, from the master equation of the system, the bloch equation given by:\n~ ̇ >= A < S\n~ > −iλ(e−iωr t α + eiωr t α∗ )A < S\n~ > −Γ⊥ V~z ,\n<S\n\n(A.1)\n\n\f22\n~ = {σ− , σ+, , σz } represents the pauli operators acting on the qubit space and\nwhere S\nwhere A and V~ are given by:\n\n\n0\ni Ω2\niδ − T12\n\n\n0\n−iδ − T12 −i Ω2  ,\n(A.2)\nA=\n1\niΩ\n−iΩ\n− T1\nand:\n\n\n\n0\n \nV~z =  0  .\n1\nBy writing the solution in the following representation:\n~ > (t) =\n<S\n\n+∞\nX\n\n~n (t)e−inωr t\nS\n\n(A.3)\n\nn=−∞\n\n~n (t) = S\n~n (no time dependence), one can write the steady state\nand by supposing that S\nbloch equation in the following way:\n~n−1 + Bn S\n~ n − T∗ S\n~n+1 = V~n ,\n− TS\n\n(A.4)\n\nT = αλA ,\n\n(A.5)\n\nBn = A + iωr n ,\n\n(A.6)\n\nV~n = δn 0 Γ⊥ V~z .\n\n(A.7)\n\nwith:\n\nand:\n\nTo this equation introduce a parameter m ∈ N and solve iteratively in m supposing,\n~i = 0 for i > m. For what follows we are interested in the solution\nat each step, that S\n~ z and S\n~ z . They are given by the following continuous fractions:\nfor the terms S\n1\n−1\n1\n~0 ,\nT∗ S\nK−1\n1\n~0 ,\n=\nTS\nK+1\n\n~−1 =\nS\n\n(A.8)\n\n~+1\nS\n\n(A.9)\n\nwith:\n~0 = 1 V~0\nS\nR\nand:\n\n(A.10)\n\n\f23\n\n1\nT∗ + B−1 ,\n* |−2\n1\n= −T∗ ∗\nT + B+1 ,\n* |+2\n= K−1 + B0 + K+1 ,\n\nK−1 = −T\n\n(A.11)\n\nK+1\n\n(A.12)\n\nR\n\n(A.13)\n\nwhere * and *∗ are defined recursively as:\n1\nT∗ + B−2 ,\n* |−3\n1\n= −T∗ ∗\nT + B+2 .\n* |+3\n\n*|−2 = −T\n\n(A.14)\n\n*∗ |+2\n\n(A.15)\n\nOne can stop after a certain amount of iteration by simply substituting, instead of\nthe previous recursive relation, the ending one:\n*|−n = B−n ,\n∗\n\n*\n\n|+n\n\n(A.16)\n\n= B+n .\n\n(A.17)\n\nBy following [26] the final occupation number is given by:\n\n\n1\n1− ζ \n1\nnf = Nth  +\n ,\nI1 ζ\nζ\n2\ne Nth η\n1+ ζ\n\n(A.18)\n\nwhere the cooling rate Γ(α) is given by:\n\nΓ(α) = iλ\n\n~z\n~z S\nS\n1\n− −1\nα\nα∗\n\n!\n,\n\n(A.19)\n\nz\n~1z and S\n~−1\nwith S\nare given by the solutions A.8 and the other terms are given by:\n\nΓc (0)\n,\nγ\n\u0012\n\u0013\nZ ∞\nα\nI1 = 2\ndα αΓ̃c r =\n,\nη\n0\nΓc (α)\nΓ̃c =\n,\nΓc (0)\nλ\nη =\n.\nωr\nζ =\n\n(A.20)\n(A.21)\n(A.22)\n(A.23)\n\n\f24\nReferences\n[1] Bustamante C, Chemla Y, Forde N and Izhaky D 2004 Annu. Rev. Biochem. 73 705–748 ISSN\n0066-4154\n[2] Friedsam C, Wehle A K, Khner F and Gaub H E 2003 J. Phys.-Condens. Mat. 15 S1709\n[3] Benoit M G H 2002 Cells Tissues Organs 172 174\n[4] Rugar D, Budakian R, Mamin H J and Chui B W 2004 Nature 430 329–332\n[5] K L Ekinci Y T Yang M L R 2004 J. Appl. Phys. 95\n[6] Burns D, Zook J, Horning R, Herb W and Guckel H 1995 Sensor. actuat. A-Phys. 48 179 – 186\nISSN 0924-4247\n[7] Schilling O F 2007 Braz. J. Phys. 37(2A) 425–428\n[8] Cleland A N and Roukes M L 1998 Nature 392 160–162\n[9] Bocko M F and Onofrio R 1996 Rev. Mod. Phys. 68 755–799\n[10] Nakamura Y, Pashkin Y A and Tsai J S 1999 Nature 398 786–788\n[11] Brune M, Hagley E, Dreyer J, Maı̂tre X, Maali A, Wunderlich C, Raimond J M and Haroche S\n1996 Phys. Rev. Lett. 77 4887–4890\n[12] Clarke J, Cleland A N, Devoret M H, Esteve D and Martinis J M 1988 Science 239 992–997\n[13] Silvestrini P, Palmieri V G, Ruggiero B and Russo M 1997 Phys. Rev. Lett. 79 3046–3049\n[14] Kleckner D and Bouwmeester D 2006 Nature 444 75–78\n[15] Arcizet O, Cohadon P F, Briant T, Pinard M and Heidmann A 2006 Nature 444 71–74\n[16] Gigan S, Bohm H R, Paternostro M, Blaser F, Langer G, Hertzberg J B, Schwab K C, Bauerle D,\nAspelmeyer M and Zeilinger A 2006 Nature 444 67–70\n[17] Kippenberg T J, Rokhsari H, Carmon T, Scherer A and Vahala K J 2005 Physical Review Letters\n95 033901\n[18] Schliesser A, Del'Haye P, Nooshi N, Vahala K J and Kippenberg T J 2006 Physical Review Letters\n97 243905\n[19] Thompson J D, Zwickl B M, Yarich A M, Marquardt F, Girvin S M and Harris J 2007\narXiv:0707.1724\n[20] Corbitt Tand Chen Y B, Innerhofer E, Muller-Ebhardt H, Ottaway D, Rehbein H, Sigg D,\nWhitcomb S, Wipf C and Mavalvala N 2007 Physical Review Letters 98 150802\n[21] Chang D E, Regal C A, Papp S B, Wilson D J, Ye J, Painter O, Kimble H J and Zoller P 2010\nProceedings of the National Academy of Sciences 107 1005–1010\n[22] Kippenberg T J and Vahala K J 2007 Opt. Express 15 17172–17205\n[23] O'Connell A D, Hofheinz M, Ansmann M, Bialczak R C, Lenander M, Lucero E, Neeley M, Sank\nD, Wang H, Weides M, Wenner J, Martinis J M and Cleland A N 2010 Nature 464 697–703\n[24] Romer R H 1990 Eur. J. Phys. 11 103\n[25] Jaehne K, Hammerer K and Wallquist M 2008 New J. Phys. 10 095019\n[26] Rabl P 2010 Phys. Rev. B 82 165320\n[27] Li Y, Wu L A, Wang Y D and Yang L P 2011 arXiv:1103.4197\n[28] Paauw F G, Fedorov A, Harmans C J P M and Mooij J E 2009 Phys. Rev. Lett. 102(9) 090501\nURL http://link.aps.org/doi/10.1103/PhysRevLett.102.090501\n[29] Fedorov A, Feofanov A K, Macha P, Forn-D P, Harmans C J P M and Mooij J E 2010 Phys. Rev.\nLett. 105(6) 060503 URL http://link.aps.org/doi/10.1103/PhysRevLett.105.060503\n[30] McDonald K T 2010 Fitzgerald's calculation of the radiation of an oscillating magnetic dipole URL\nhttp://www.physics.princeton.edu/~mcdonald/examples/fitzgerald.pdf\n[31] Chang D E, Regal C A, Papp S B, Wilson D J, Ye J, Painter O, Kimble H J and Zoller P 2010\nPNAS 107 1005–1010\n[32] Gustavsson S 2011 arXiv:1104.5212v2\n[33] Mamin H J, Poggio M, Degen C L and Rugar D 2007 Nature 2 301–306\n\n\f"}