{"id": "http://arxiv.org/abs/0902.4185v3", "guidislink": true, "updated": "2010-07-29T00:10:46Z", "updated_parsed": [2010, 7, 29, 0, 10, 46, 3, 210, 0], "published": "2009-02-24T16:45:07Z", "published_parsed": [2009, 2, 24, 16, 45, 7, 1, 55, 0], "title": "Quiet Planting in the Locked Constraint Satisfaction Problems", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0902.1475%2C0902.1793%2C0902.3609%2C0902.0057%2C0902.2565%2C0902.1024%2C0902.4722%2C0902.1652%2C0902.0888%2C0902.1184%2C0902.0027%2C0902.0645%2C0902.3360%2C0902.2992%2C0902.3827%2C0902.4406%2C0902.1266%2C0902.1515%2C0902.2753%2C0902.2447%2C0902.2872%2C0902.0510%2C0902.4037%2C0902.1463%2C0902.4367%2C0902.2804%2C0902.3313%2C0902.0877%2C0902.2138%2C0902.3421%2C0902.4185%2C0902.1120%2C0902.0752%2C0902.2842%2C0902.4389%2C0902.4210%2C0902.0708%2C0902.2674%2C0902.2480%2C0902.0670%2C0902.0531%2C0902.1890%2C0902.3824%2C0902.3218%2C0902.3213%2C0902.0852%2C0902.4644%2C0902.4675%2C0902.0146%2C0902.2519%2C0902.0217%2C0902.3538%2C0902.0042%2C0902.2048%2C0902.2584%2C0902.2298%2C0902.1294%2C0902.4720%2C0902.1210%2C0902.1193%2C0902.4267%2C0902.2026%2C0902.1012%2C0902.4816%2C0902.4549%2C0902.3930%2C0902.1483%2C0902.4540%2C0902.0255%2C0902.2911%2C0902.3658%2C0902.0047%2C0902.2660%2C0902.1311%2C0902.4158%2C0902.1374%2C0902.2197%2C0902.0220%2C0902.2176%2C0902.3804%2C0902.1260%2C0902.2119%2C0902.1238%2C0902.0551%2C0902.2300%2C0902.1787%2C0902.3987%2C0902.4818%2C0902.3566%2C0902.1903%2C0902.3739%2C0902.3097%2C0902.1698%2C0902.1237%2C0902.2408%2C0902.1527%2C0902.2696%2C0902.1423%2C0902.3696%2C0902.2236%2C0902.0804&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quiet Planting in the Locked Constraint Satisfaction Problems"}, "summary": "We study the planted ensemble of locked constraint satisfaction problems. We\ndescribe the connection between the random and planted ensembles. The use of\nthe cavity method is combined with arguments from reconstruction on trees and\nfirst and second moment considerations; in particular the connection with the\nreconstruction on trees appears to be crucial. Our main result is the location\nof the hard region in the planted ensemble. In a part of that hard region\ninstances have with high probability a single satisfying assignment.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0902.1475%2C0902.1793%2C0902.3609%2C0902.0057%2C0902.2565%2C0902.1024%2C0902.4722%2C0902.1652%2C0902.0888%2C0902.1184%2C0902.0027%2C0902.0645%2C0902.3360%2C0902.2992%2C0902.3827%2C0902.4406%2C0902.1266%2C0902.1515%2C0902.2753%2C0902.2447%2C0902.2872%2C0902.0510%2C0902.4037%2C0902.1463%2C0902.4367%2C0902.2804%2C0902.3313%2C0902.0877%2C0902.2138%2C0902.3421%2C0902.4185%2C0902.1120%2C0902.0752%2C0902.2842%2C0902.4389%2C0902.4210%2C0902.0708%2C0902.2674%2C0902.2480%2C0902.0670%2C0902.0531%2C0902.1890%2C0902.3824%2C0902.3218%2C0902.3213%2C0902.0852%2C0902.4644%2C0902.4675%2C0902.0146%2C0902.2519%2C0902.0217%2C0902.3538%2C0902.0042%2C0902.2048%2C0902.2584%2C0902.2298%2C0902.1294%2C0902.4720%2C0902.1210%2C0902.1193%2C0902.4267%2C0902.2026%2C0902.1012%2C0902.4816%2C0902.4549%2C0902.3930%2C0902.1483%2C0902.4540%2C0902.0255%2C0902.2911%2C0902.3658%2C0902.0047%2C0902.2660%2C0902.1311%2C0902.4158%2C0902.1374%2C0902.2197%2C0902.0220%2C0902.2176%2C0902.3804%2C0902.1260%2C0902.2119%2C0902.1238%2C0902.0551%2C0902.2300%2C0902.1787%2C0902.3987%2C0902.4818%2C0902.3566%2C0902.1903%2C0902.3739%2C0902.3097%2C0902.1698%2C0902.1237%2C0902.2408%2C0902.1527%2C0902.2696%2C0902.1423%2C0902.3696%2C0902.2236%2C0902.0804&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study the planted ensemble of locked constraint satisfaction problems. We\ndescribe the connection between the random and planted ensembles. The use of\nthe cavity method is combined with arguments from reconstruction on trees and\nfirst and second moment considerations; in particular the connection with the\nreconstruction on trees appears to be crucial. Our main result is the location\nof the hard region in the planted ensemble. In a part of that hard region\ninstances have with high probability a single satisfying assignment."}, "authors": ["Lenka Zdeborová", "Florent Krzakala"], "author_detail": {"name": "Florent Krzakala"}, "author": "Florent Krzakala", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1137/090750755", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0902.4185v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0902.4185v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "21 pages, revised version", "arxiv_primary_category": {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cs.CC", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0902.4185v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0902.4185v3", "journal_reference": "SIAM J. Discrete Math. 25, 750-770 (2011)", "doi": "10.1137/090750755", "fulltext": "QUIET PLANTING IN THE LOCKED CONSTRAINT\nSATISFACTION PROBLEMS\n\narXiv:0902.4185v3 [cond-mat.stat-mech] 29 Jul 2010\n\nLENKA ZDEBOROVÁ∗ AND FLORENT KRZAKALA†\nAbstract. We study the planted ensemble of locked constraint satisfaction problems. We\ndescribe the connection between the random and planted ensembles. The use of the cavity method\nis combined with arguments from reconstruction on trees and the first and the second moment\nconsiderations. Our main result is the location of the hard region in the planted ensemble. In a part\nof that hard region instances have with high probability a single satisfying assignment.\nKey words. Constraint Satisfaction Problems, Planted Random Ensemble, Belief Propagation,\nReconstruction on Trees, Instances with a Unique Satisfying Assignment.\nAMS subject classifications. 90C27 68Q25 05C80\n\nConstraint Satisfaction Problems (CSPs) are very general in their nature: Consider a set of N discrete variables and a set of M Boolean constraints; the problem\nconsists in finding a configuration of variables that satisfies all the constraints or in\nproving that no such configuration exists. As such, CSPs are a subject of interest in\nmany different fields such as computer science, discrete mathematics, physics, engineering and computational biology. Random ensembles of CSPs are a fertile source\nof research activity; as hard benchmarks they serve for testing new algorithmic ideas\n[5, 31], they are used to create efficient coding schemes [14, 15], to model complex glass\nforming liquids [4, 23], or to understand the origin of average computational hardness\n[30, 43]. Combining know-how from many branches of mathematics, computer science\nand statistical physics seems to be a fruitful strategy for the understanding of these\nstunning objects and of their very rich behavior.\nThe most commonly studied random ensembles of CSPs are created by choosing\nthe graph of variables and constraints as a random bipartite graph with a certain left\nand right degree distribution. Another natural way of creating a random instance,\ncalled planting, is to first assign a configuration to all variables, and then to choose\nonly constraints compatible with this configuration. Both these ensembles can be\nuseful to mimic instances created in some practical applications, as e.g. the low\ndensity parity check codes [14]. In particular planted instances may be created in\nadaptive situations when only constraints satisfied by the current state of variables\ncan be added.\nBy planting, we create by definition a satisfiable instance. Such instances are particularly useful as benchmarks to evaluate the performance of incomplete solvers, such\nas stochastic local search [38]. Based on the example of the planted K-satisfiability\nproblem it is, however, often anticipated that the planted ensemble is algorithmically\neasier than the random one because a bias towards the planted assignment is created\nin the graph. Also, for most of the studied problems, it was proven that at large\ndensity of constraints is it indeed easy to find a satisfying assignment near to the\nplanted one, see e.g. [3, 7, 13]. On the other hand if the planted ensemble would be\nalgorithmically hard in some region of parameters than these instances could serve\n∗ Theoretical Division and Center for Nonlinear Studies, Los Alamos National Laboratory, NM\n87545 USA (lenka@lanl.org).\n† CNRS and ESPCI ParisTech, 10 rue Vauquelin, UMR 7083 Gulliver, Paris 75000 France\n(fk@espci.fr). Theoretical Division and Center for Nonlinear Studies, Los Alamos National Laboratory, NM 87545 USA.\n\n1\n\n\f2\n\nL. ZDEBOROVÁ AND F. KRZAKALA\n\nas one-way functions and have applications in cryptography. Yet, compared to the\nrandom ensemble, relatively little is known about the existence, size and properties\nof algorithmically hard regions in the planted ensemble.\nIn this paper we study a way of planting an assignment which changes only in a\nminimal way the properties of the random ensemble. We call this a quiet planting.\nAlthough the concept of quiet planting was introduced in [24], many result were actually first demonstrated and used as a tool for proofs in [2]. Both these works, however,\nwere mainly concentrated on the coloring problem (and on hyper-graph bi-coloring).\nIn the present work we generalize this idea and we will focus on quiet planting in\nthe so-called locked CSPs, introduced recently in [43, 42]. On one hand, the locked\nCSPs have a very interesting phase diagram which description-wise is much simpler\nthan the one of the graph coloring or K-satisfiability. On the other hand they are\nmuch harder algorithmically and the boundaries between the easy and hard regions\nare, unlike in the coloring or K-satisfiability, relatively well understood (at least on\nthe heuristic level of the cavity method [43, 42]). This special behavior stems from\nthe fact that in the locked problems the space of solutions consists of points separated\nby an extensive (i.e. Θ(N )) Hamming distance instead of clusters of solutions.\nHere, we combine the idea of quiet planting with the special behavior of the locked\nCSPs and obtain random CSPs ensembles with many interesting properties that are\nsummarized in Sec. 1 in the context of related works. In Sec. 2 we introduce the\nnecessary definitions and notations, and in Sec. 3 we summarize the phase diagram\nof the locked problems derived in [43, 42]. In Sec. 4 we argue about the equivalence\nbetween the random and the planted ensemble based on heuristic considerations and\non a second moment computation. In Sec. 5 we describe the interesting phase where\ninstances of our problems have with large probability a single solution. Finally, in\nSec. 6 we discuss the algorithmic hardness of the planted instances, and compute the\ncritical degree beyond which instances become easy to solve. We conclude the paper\nwith a list of open problems in Sec. 7.\n1. Main results and related works. The results of this paper apply to the\nfactorized locked CSPs, see Defs. 2.2, 2.4. We list in six points the most important\ncontributions of the present article:\n(i) The planted configuration is equivalent to randomly sampled satisfying assignment: The idea of quiet planting is to plant a configuration\nthat in many important properties does not differ from a satisfying assignment sampled uniformly at random on the resulting graph. Such a problem\nis closely related to the reconstruction on trees [10, 34, 26] where we consider an assignment taken uniformly at random from all the satisfying ones.\nConstructing such an assignment on a tree is always possible in polynomial\ntime, as the exact marginal probabilities can be obtained via the belief propagation (BP) algorithm. On random graphs, uniform sampling is in general\nexponentially costly. However, the quiet planting can be achieved asymptotically on the factorized CSPs, see Def. 2.4. In a statistical physics language\nquiet planting is possible whenever the quenched entropy equals the annealed\none, see condition (4.2). The possibility of quiet planting and its relation to\na concentration property (4.2) was previously discussed for other constraint\nsatisfaction problems in [32, 2, 24].\n(ii) Equivalence between the planted and the random ensemble in the\nsatisfiable phase: Many properties of the planted ensemble created via quiet\nplanting can be deduced from the properties of the purely random ensemble.\n\n\fQUIET PLANTING IN THE LOCKED CONSTRAINT SATISFACTION PROBLEMS\n\n(iii)\n\n(iv)\n\n(v)\n\n(vi)\n\n3\n\nAmong others, in the satisfiable phase the random and planted ensembles\nare asymptotically equivalent, see Def. 4.2. Such equivalence can also be\nestablished rigorously based on a second moment argument, as in [2]. In the\nfactorized locked problems treated in this article the second moment is able\nto pin the satisfiability threshold sharply and hence the equivalence between\nthe planted and the random ensemble holds in the whole satisfiable phase.\nEquivalence between planted and satisfiable ensembles: Based on\nheuristic (cavity) arguments we conjecture that the planted ensemble is in\nthe factorized locked problems asymptotically equivalent to the ensemble of\nsatisfiable instances in the whole range of Θ(1) constraint densities. In particular, this means that one can recognize easily almost all the rare satisfiable\ninstances above the robust reconstruction threshold by using belief propagation. We stress here that we do not expect this equivalence to be true in the\nnon-locked CSPs, such as graph coloring or K-satisfiability.\nEasy-hard-easy transition: Next to the interesting conceptual results, the\nmost important practical result is the identification and the location of the\nregion where the instances from the planted ensemble of the factorized locked\nproblems are on average computationally hard. We show that an easy-hardeasy pattern for finding a solution appears in the planted ensemble as the\nconstraint density is increased, where easy means that an on-average polynomial algorithm is known, while hard means that no on-average polynomial\nalgorithm is known (and maybe does not exist). We conjecture that the\ntwo boundaries of the hard phase correspond to two different reconstruction\nthresholds – the onset of hardness coincides with the small noise reconstruction threshold [42], called the dynamical transition in the physics literature\n[22], and the end of the hard region is given by the threshold for the robust\nreconstruction [16]. This last point also corresponds to the Kesten-Stigum\nbound for the canonical reconstruction on trees [19, 20], and to the spin glass\nlocal instability in the purely random ensemble [29]. We also show that outside the hard region algorithms based on belief propagation are able to find\nsolutions efficiently. In particular in the high average degree easy region, the\nbelief propagation algorithm converges directly to the planted solution.\nHard satisfiable benchmarks: Given we have located the values of parameters where the instances of the planted ensemble are hard, these can serve as\nvery challenging satisfiable benchmarks. Such benchmarks are in particular\ninteresting for the evaluation of regions in which incomplete solvers work -or\ndo not work- in polynomial (linear) time. Note that for complete exhaustive solvers the locked problems are not necessarily harder than the canonical\nK-satisfiability. On the contrary, locked constraints produce more implications when a variable is fixed, hence exhaustive branch-and-bound techniques\nmight come to a decision relatively faster than in the random K-satisfiability.\nInstances with unique satisfying assignment (USA): We show that beyond the threshold corresponding to the satisfiability threshold in the random\nensemble the planted instances have with high probability a single satisfying\nassignment (or a pair of them in case a global symmetry is present). Moreover\ndepending on the constraint density these USA instances can be found in the\nhard or in the easy region. Some USA instances are extensively used in evaluation of quantum algorithms, see e.g. [40, 12]. In these previous works these\ninstances are, however, generated with exponential cost, and their classical\n\n\f4\n\nL. ZDEBOROVÁ AND F. KRZAKALA\n\ntypical computational hardness has not been evaluated.\nA large part of our results is based on the heuristic cavity method approach [28].\nWe were also able to prove part of our results for the R-in-K SAT problem on random\nregular graphs using computations of the second moment and the expander property.\nThis includes some results about the equivalence between the planted and random\nensembles in the satisfiable phase, and the uniqueness of the satisfying assignment in\nthe unsatisfiable phase. Completing and extending these proofs to the other locked\nfactorized CSPs should be possible although more involved.\nTable 1.1\nSketchy summary of the properties of the different phases in the random ensemble of the factorized locked problems, the parameter l is the average number of constraints in which a variable\nappears. The three thresholds ld , ls and ll are defined in detail later in the paper.\n\nRANDOM\nBP, random init.\nBP fixed point\n# of solutions\nfinding solution\nreconstruction\n\nl < ld\nconverges\nuniform\nexponential\neasy\nnot possible\n\nld < l < ls\nconverges\nuniform\nexponential\nhard\npossible\n\nls < l < ll\nconverges\nuniform\nnone\n×\n×\n\nll < l\ndoes not\n×\nnone\n×\n×\n\nTable 1.2\nThe same as Tab. 1.1 for the random planted ensemble, its definition is given in Sec. 4.\n\nPLANTED\nBP, random init.\nBP fixed point\nBP, planted init.\nBP fixed point\n# of solutions\nfinding solution\nreconstruction\nrobust recons.\n\nl < ld\nconverges\nuniform\nconverges\nuniform\nexponential\neasy\nnot possible\nnot possible\n\nld < l < ls\nconverges\nuniform\nconverges\nplanted\nexponential\nhard\npossible\nnot possible\n\nls < l < ll\nconverges\nuniform\nconverges\nplanted\none/two\nhard\npossible\nnot possible\n\nll < l\nconverges\nplanted\nconverges\nplanted\none/two\neasy\npossible\npossible\n\n2. Definitions and notations. In this section we specify the class of constraint\nsatisfaction problems to which our results apply. The crucial notions will be the\ndefinition of a locked [43] and factorized constraint satisfaction problem. It is only on\nthe factorized problems where there is a very close relation between the usual random\nand the planted ensemble, as discussed in [24]. It is also the fact that in the locked\nproblems solutions (i.e. satisfying assignments) are mutually far from each other in\nterms of their Hamming distance [43] that makes them particularly interesting for\nconsiderations in this context.\nDefinition 2.1. A constraint a containing K variables, the domain of each\nvariable being X, is a function from X K to {0, 1}. If the function evaluates to 1 (0)\nwe say that constraint a is satisfied (not satisfied). A constraint is locked if and only\nif there are no two satisfying assignments of variables which would differ in a single\nvalue (out of the K ones). In this paper we will consider for concreteness binary\nvariables, that is X = {0, 1}, but the results are generalizable to larger domain sizes.\n\n\fQUIET PLANTING IN THE LOCKED CONSTRAINT SATISFACTION PROBLEMS\n\n5\n\nDefinition 2.2. A constraint satisfaction problem consists in deciding if there\nexists a configuration of N variables which satisfies simultaneously a set of M constraints. A constraint satisfaction problem is called locked if and only if all the M\nconstraint are locked and each of the N variables belongs to at least two different constraints. Thus anytime we speak about a locked problem we implicitly suppose that\nthe corresponding factor-graph does not have any leaves (variables of degree one).\nThe degree of a variable is defined as the number of constraints to which the variable\nbelongs, while the degree of a constraint is the number of variables it contains.\nWe shall illustrate our findings on the so called occupation constraint satisfaction\nproblems [33, 42].\nDefinition 2.3. In occupation problems every constraint a depends only on\nthe sum of the variables it contains. Thus every occupation constraint containing Ka\nvariables can be characterized by a binary Ka + 1 component vector Aa such that\nthe constraint is satisfied if and only if the sum r of the Ka variables is such that\nAa (r) = 1.\nAn occupation constraint a is locked if and only if for all i = 0, . . . , Ka −1 we have\nAa (i)Aa (i + 1) = 0. We will consider occupation problems where every constraint\ncontains K variables and is given by the same vector A. To give an example of this\nnotation, the vector A = 0100 corresponds to the 1-in-3 SAT problem (also called\nexact cover), which is indeed locked. The vector A = 0110 corresponds to the hypergraph bi-coloring problem, which is not locked (since there are two neighboring 1s).\nMany other examples can be found in [42]. For problems which do not have other\nname established in the literature, we will use the notation i-or-j-...-in-K SAT for a\nvector A with non-zero components A(i),A(j), etc.\nLet us now write the belief propagation (BP) equations [35, 25, 27] for the occupation constraint satisfaction problems. The basic quantities in BP are messages.\nas the probability (over all satisfying assignments) that the variable i\nWe define μa→i\nsi\nhas value si given that i belong only to constraint a. The BP equations approximate\nby assuming that the factor graph [25]\nby messages ψsa→i\nthese probabilities μa→i\nsi\ni\nunderlying the CSP is a tree\nY\nY\n1 X\n,\n(2.1)\nψsb→j\nδA(si +Pj sj ),1\n= a→i\nψsa→i\nj\ni\nZ\n{sj }\n\nj∈∂a−i b∈∂j−a\n\nwhere Z a→i is a normalization constant assuring ψ1a→i + ψ0a→i = 1, ∂a is the set of\nneighbors of a, ∂a − i are neighbors of a except i, and the sum over {sj } is over\nall values variables sj can take. Fig. 2.1 shows the corresponding part of the factor\ngraph.\nWe define ν i to be the probability (over all satisfying assignments) that a variable\ni is occupied. The BP estimate of the probability that a variables i is occupied is\nQ\na→i\na∈∂i ψ1\ni\nQ\nQ\n,\n(2.2)\nχ =\na→i\n+ a∈∂i ψ0a→i\na∈∂i ψ1\n= 1,\nNote that if an assignment {σ} is a solution of the locked problem, then ψσa→i\ni\na→i\n=\n0\nis\na\nfixed\npoint\nof\nthe\nBP\nequations\n(2.1).\nIf\nthe\nunderlying\nfactor-graph\nis a\nψ¬σ\ni\ni\ni\na→i\nand\nν\n=\nχ\nin\n=\nψ\ntree then the fixed point of the BP equations is unique and μa→i\nsi\nsi\nthe fixed point (note that on a tree the problem is not locked). On a graph with cycles\nthis is not the case in general. We will call a BP fixed point asymptotically (N → ∞)\n+ o(1) and ν i = χi + o(1) for\n= ψsa→i\nexact on a random ensemble of graphs if μa→i\nsi\ni\nalmost all a and i with high probability, where N is the number of nodes in the graph.\n\n\f6\n\nL. ZDEBOROVÁ AND F. KRZAKALA\n\n11\n00\n00\n11\n00\n11\n00\n11\n\n11\n00\n00\n11\n00\n11\n00\n11\n\n11\n00\n00\n11\n00\n11\n00\n11\n\nb\n\nj\n\na\n11\n00\n00\n11\n00i\n11\n\nFig. 2.1. Part of the factor graph to illustrate the meaning of indices in the belief propagation\nequations (2.1).\n\nAll our results are restricted to ensembles of constraint satisfaction problems\nwhere at least one BP fixed point is asymptotically exact. We define such ensembles\nin the remaining of this section. A graph ensemble is locally tree-like if the shortest\nloop going trough a random node has w.h.p. length diverging as N → ∞. Families of\nsparse random graphs, i.e. the degree distribution of variables Q(l) does not depend\non N , are locally tree-like as long as the mean of Q(l) is finite. The variable degree\ndistributions we will be using mostly are:\n• Regular Q(l) = δL,l .\n• Truncated Poisson Q(0) = Q(1) = 0, Q(l) = cl /[(ec − 1 − c)l!] for l ≥ 3. The\naverage degree in this case is l = c(1 − e−c )/[1 − (1 + c)e−c ].\nIn order to generate random graphs with a given variable degree distribution, one can\napply the following algorithm:\nPN\n• Repeat until KM = i=1 li : Draw N random numbers li from distribution\nQ(l).\n• Consider K legs going from every constraint, order them arbitrarily and index them from 1 to KM , consider li legs from every variable i, order them\narbitrarily and index them from 1 to KM .\n• Repeat until there are no double edges: Draw a random permutation π of\nKM numbers and connect i-th leg from constraints with π(i)-th leg from\nvariables.\nWe define an iteration of the belief propagation algorithm as taking all the KM\naccording to eq. (2.1).\nedges ai in a random order and updating the message ψsa→i\ni\nDefinition 2.4. A given instance of a constraint satisfaction problem is factorized if and only if the belief propagation equations initialized randomly converge\nalmost surely (with probability approaching one as the number of variables N → ∞)\nto a uniform fixed point, i.e., the value of ψ a→i is the same for almost all edges ai.\nNote that it is a non-trivial task to provably decide if a problem satisfies this\ndefinition, and the answer depends on the degree distribution. In practice we generate\na large random instance of the problem, initialize BP randomly and iterate. We\nobserve that the result (i.e. if the condition in def. 2.4 is satisfied or not) is the same\non almost all large random instances. The condition of def. 2.4 can hence be checked\ncomputationally with a small computer-time effort.\nDefinition 2.5. Let NG be the number of satisfying assignments of an instance\nof the constraint satisfaction problem G. We define the annealed entropy sann to be\nsann = lim\n\nN →∞\n\n1\nlog E(NG ) ,\nN\n\n(2.3)\n\n\fQUIET PLANTING IN THE LOCKED CONSTRAINT SATISFACTION PROBLEMS\n\n7\n\nwhere the expectation is over the graph ensemble. The quenched entropy is defined as\nsquen = lim\n\nN →∞\n\n1\nE[log (NG + 1)] .\nN\n\n(2.4)\n\nDefinition 2.6. Let us also define the Bethe entropy [25, 27] that is associated\nto any BP fixed point as\ns=\n\n1 X\n1 X\n(li − 1) log (Z i ) .\nlog (Z a ) −\nN a\nN\n\n(2.5)\n\ni\n\nwhere\na\n\nZ =\n\nX\n\nδAPi si ,1\n\ni∈∂a\n\n{si }\n\nZi =\n\nY\n\na∈∂i\n\nY\n\nψ0a→i +\n\nY\n\nY\n\nb∈∂i−a\n\nψsb→i\ni\n\n!\n\n,\n\nψ1a→i .\n\n(2.6a)\n(2.6b)\n\na∈∂i\n\nThe following statement stands on the basis of the cavity method: If a BP fixed\npoint is asymptotically exact (for a given random graph ensemble) then the Bethe\nentropy (2.5) is equal to the quenched entropy (2.4).\nThe following result was obtained in [33] (section 5.1.2) for the occupation constraint satisfaction problems, and we conjecture it is general: The annealed entropy\n(2.3) is equal to the Bethe entropy evaluated in the uniform BP fixed point (when\nmore than one uniform BP fixed point exists then consider the maximum of the Bethe\nentropy over the uniform fixed points).\nIf the problem is factorized and the uniform BP fixed point is asymptotically\nexact then the annealed entropy is equal to the quenched entropy, sann = squen .\nOur results in the remaining of this paper apply to random constraint satisfaction\nproblems where indeed sann = squen (at least in some region of constraint densities).\nThis condition is sometimes amenable to a rigorous proof, as it is in general weaker\nthan E(NG2 ) < C [E(NG )]2 , see [2]. If we are, however, interested in a fast heuristic\ncheck, then checking if the random constraint satisfaction problem is factorized may\nbe more suitable.\n3. Basic properties of the random factorized locked problems. For the\nlocked problems, a detailed empirical analysis was done in [43, 42]. In this section\nwe summarize the most relevant results (heuristically reasoned conjectures) of those\nworks. It was found that a locked CSP is factorized in (at least) the two following\ncases:\n(a) Any locked problem on random regular graphs, that is when every\nvariable is contained in L constraints. On regular graphs, the uniform fixed\npoint of the BP equations then satisfies\n\u0012\n\u0013\nK−1\n1 X\nK − 1 (L−1)r (L−1)(K−1−r)\nδA(r),1\nψ1\nψ0\n,\nZ r=0\nr\n\u0012\n\u0013\nK−1\n1 X\nK − 1 (L−1)r (L−1)(K−1−r)\nδA(r+1),1\nψ1 =\nψ1\nψ0\n,\nZ r=0\nr\nψ0 =\n\n(3.1)\n(3.2)\n\n\f8\n\nL. ZDEBOROVÁ AND F. KRZAKALA\n\nwhere Z is the normalization. For the probability that a variable in occupied\none has in this case in the N → ∞ limit\nχ=\n\nψ1L\n\nψ1L\n,\n+ ψ0L\n\n(3.3)\n\nLet us call xr the probability that a constraint contains r occupied variables.\nThen\n\u0001\nr(L−1) (K−r)(L−1)\nK\nψ0\nr δA(r),1 ψ1\nxr = PK K \u0001\n.\n(3.4)\nt(L−1) (K−t)(L−1)\nψ0\nt=0 t δA(t),1 ψ1\n\n(b) The balanced locked problems [42], are problems where the vector A\nis symmetric, A(i) = A(K − i) for all i = 0, . . . , K and this 0-1 symmetry\nis not spontaneously broken (that is when a satisfying assignment chosen\nuniformly at random has the same number of 0's and 1's up to a o(N ) factor).\nNote that the absence of the symmetry breaking might depend on the degree\ndistribution Q(l). In the balanced locked problems the uniform BP fixed\npoint ψ1 = ψ0 = χ = 1/2. For the probability that a constraint contains r\noccupied variables we have here\n\u0001\nK\nr δA(r),1\nxr = PK K \u0001\n.\n(3.5)\nt=0 t δA(t),1\n\nA particularly simple case of (a) is the R-in-K SAT where 1 ≤ R ≤ K/2. If every\nvariable has L connections and every constraint has to contain exactly R occupied\nvariables, then the number of occupied variables is exactly M R/L, and thus ν = R/K.\nThe authors of [43, 42] conjectured that when the N → ∞ limit of the Bethe entropy for a locked problem is positive, then the Bethe entropy is equal to the quenched\nentropy, and the BP fixed point reached from random initialization is asymptotically\nexact. If the Bethe entropy is negative then no satisfying assignment exists with high\nprobability.\nThe Bethe entropy for all the balanced locked problems reads\n\"\n\u0012 \u0013#\nK\nX\n\u0001\nl\nK\nlog 2−K\nδA(r),1\n,\n(3.6)\ns l = log 2 +\nK\nr\nr=0\nwhere l is the average degree of a variable (as we speak only about locked problems,\nthe degree distribution has to have a zero weight on variables of degree zero and one).\nFor all the locked problems on random regular (degree fixed to L) graphs the entropy\nreads\n\"K\n#\n\u0012 \u0013\nX\n\u0002\n\u0003\nL\nK (L−1)r (L−1)(K−r)\ns(L) =\nlog\n− (L − 1) log ψ0L + ψ1L , (3.7)\nδA(r),1\nψ1\nψ0\nK\nr\nr=0\nwhere ψ1 , ψ0 is the fixed point of eqs. (3.1-3.2). This entropy simplifies further for\nthe R-in-K SAT on regular graphs (where the values of the ψs obey the simple form\ndiscussed previously) where we get an explicit formula\n\u0012 \u0013\n\u0012 \u0013\nK\nR\nL\n,\n(3.8)\nlog\n− (L − 1) H\ns(L) =\nK\nK\nR\n\n\fQUIET PLANTING IN THE LOCKED CONSTRAINT SATISFACTION PROBLEMS\n\n9\n\nwhere H(x) = −x log x − (1 − x) log (1 − x) is the entropy function.\nThe satisfiability transition ls is then defined by\nsatisfiability threshold ls :\n\ns(ls ) = 0\n\n(3.9)\n\nfor the corresponding entropy function. For l < ls the problem has almost surely\nexponentially many solutions (the exponent being given by s(l)) whereas for l > ls\nthe problem almost surely does not have any solution.\nThe authors of [43, 42] also argued about the existence of a second phase transition in the locked problems, ld < ls , traditionally called in the physics literature\nthe dynamical transition because of its connection to dynamics of glasses [32]. This\ncritical point separates a region where for {σ} being a typical satisfying assignment\na→i\n= 0 defines a stable fixed point of the BP equations (2.1), from\n= 1, ψ¬σ\nthe ψσa→i\ni\ni\na region where this does not hold anymore. In other words, if an infinitesimal perturbation is introduced to these messages, the iteration of (2.1) goes back to the\nsolution-related fixed point for l > ld , but not for l < ld . The authors of [43, 42]\nalso conjectured that for l > ld a typical solution does not have solutions up to an\nextensive (i.e. Θ(N )) Hamming distance, whereas for l < ld there are other solutions\nat sub-extensive (i.e. o(N )) Hamming distance. Let us call the phase corresponding\nto l > ld the separated phase, and the one corresponding to l < ld the non-separated\nphase.\nFor the locked problems on regular graphs, the following inequality always holds:\n2 < ld < 3. In other words at L = 2 the system is in the non-separated phase while for\nL ≥ 3 the solutions are always separated and the solution-corresponding fixed points\nare stable. For the balanced locked problems whenever the degree of every variable\nis larger or equal to three the system is in the phase where solutions are separated.\nWhen the fraction of variables of degree two is positive, Q(2) > 0, then the expression\nfor ld follows [42]:\nld\n= 2(K − 1) − 2\nQ(2)\n\nPK−2\nr=1\n\nr\n\nK−1\nδA(r+1),1 δA(r),0 δA(r−1),0\nr\n\u0001\nPK−2\nK−1\nr=0 δA(r+1),1\nr\n\n\u0001\n\n.\n\n(3.10)\n\nThere is a deep connection between this dynamical threshold ld and the reconstruction problem [10, 34, 26]. In the reconstruction problem one creates a tree with\nthe same degree properties as the random graph. Then one considers a satisfying\nassignment chosen uniformly at random from all the possible ones. The reconstruction problem finally consists in deciding whether this assignment on the leaves of the\ntree contains some information about the value assigned to the root. In the locked\nproblems the value of the root is always uniquely implied by the values of the leaves,\nas follows from the very definition of these problems. However, if an infinitesimal\nnoise is introduced on the leaves then there is no information left if and only if l < ld .\nThis value ld was called the small noise reconstruction threshold in [42].\nTo summarize, the random locked factorized problems are in the non-separated\nphase for l ≤ ld , which was shown to be algorithmically easy in [43, 42]. For ld ≤ l ≤ ls\nthe space of solutions is separated and it is then hard to find any solution. For l ≥ ls\nno solution exists anymore.\n4. Equivalence of the random and planted ensembles. The planted ensemble of graphs, which is the main subject of the present paper, is created in the\nfollowing way:\n\n\f10\n\nL. ZDEBOROVÁ AND F. KRZAKALA\n\nTable 3.1\nThe critical values for all the balanced locked problems up to K = 8 on the regular and truncated\nPoissonian ensembles. We remind here that the vector A codes for what are the allowed sums of\nvariables around a constraint. We consider only problems where A(0) = A(K) = 0, that do not have\na trivial all true or all false satisfying assignment. The integer value Ls (resp. Ll ) is defined as the\nfirst larger or equal to ls (resp. ll ), the stars denote that Ls = ls (resp. Ll = ll ). For definition of\nthe threshold ll see Sec. 6. The corresponding values of c are the coefficients that in the truncated\nPoisson distribution correspond to the average degree l. The sign '×' means that the problem ceases\nto be balanced before the instability arises.\n\nA\n00100\n0001000\n000010000\n5-in-10\n6-in-12\n01010\n0101010\n010101010\n0010100\n000101000\n001010100\n010010010\n\nLs\n3\n4\n5\n5\n6\n4*\n6*\n8*\n6\n7\n8\n6\n\nLl\n4*\n6*\n8*\n10*\n12*\n∞\n∞\n∞\n46*\n29*\n> 100\nx\n\ncd\n1.256\n1.904\n2.337\n2.660\n2.918\n1.904\n2.660\n3.132\n2.561\n2.975\n3.110\n2.173\n\ncs\n1.853\n3.023\n3.942\n4.794\n5.455\n3.594\n5.903\n7.978\n5.349\n6.650\n7.797\n4.896\n\ncl\n2.821\n4.965\n6.994\n8.999\n11.00\n∞\n∞\n∞\n45.00\n28.00\n> 100\nx\n\nld\n2.513\n2.856\n3.116\n3.325\n3.502\n2.856\n3.325\n3.654\n3.260\n3.542\n3.638\n3.014\n\nls\n2.827\n3.576\n4.276\n4.944\n5.586\n4\n6\n8\n5.489\n6.708\n7.822\n5.083\n\nll\n3.434\n5.144\n7.039\n9.009\n11.00\n∞\n∞\n∞\n45.00\n28.00\n> 100\nx\n\nTable 3.2\nThe critical values for all the regular (non-balanced) locked problems up to K = 6. The integer\nvalue Ls (resp. Ll ) is defined as the first larger or equal to ls (resp. ll ), the stars denote that\nLs = ls (resp. Ll = ll ).\n\nA\n0100\n01000\n010000\n0100000\n001000\n0010000\n\nLs\n3\n3\n3\n3\n4\n4\n\nLl\n3*\n4*\n5*\n6*\n5*\n6*\n\nA\n010100\n0101000\n010010\n0100100\n0100010\n\nLs\n5\n6\n4\n4\n4\n\nLl\n> 50\n> 50\n10\n14\n7\n\n(i) Make each of the N variables occupied with probability χ (3.3), call the\nnumber of occupied variables N1 .\n(ii) Choose a degree sequence from the probability distribution Q(l) in such a\nPN\nway that KM = i=1 li .\n(iii) For each constraint, and according to the probabilities xr (3.4), choose the\nnumber ra of\noccupied variables to which it is connected. Repeat until\nPN\nP\nM\n1\nr\n=\na\ni=1 li . Here i are the indexes of the occupied variables. If\na=1\nthis condition cannot be achieved go back to step (i) and repeat it until the\ncondition is achievable.\n(iv) Now consider the ra legs going out of every constraint a, order them arbitrarily\nPM\nand index them by i going from 1 to a=1 ra . Consider li legs going out from\nevery occupied variable and index them. Choose a random permutation π of\nP\nM\na=1 ra numbers, and connect the leg with index i going out from occupied\nvariables to the leg with index π(i) going out from constraints. Do the same\n\n\fQUIET PLANTING IN THE LOCKED CONSTRAINT SATISFACTION PROBLEMS\n\n11\n\nwith the empty variables and the remaining K − ra legs going out from the\nconstraints. Repeat until there are no double edges.\nNote that there are several other models how to plant a solution (e.g. choose exactly\nthe integer value of χN occupied variables in the step (i)), we could have chosen any\nother which is equivalent (for typical properties) to the above one in the N → ∞\nlimit.\nDefinition 4.1. Call a property of a large random graph drawn from a given\nrandom ensemble a thermodynamic property if and only if in the N → ∞ limit the\nprobability that this property holds is smaller than 1 − exp(−cN ), where c is some\nΘ(1) constant. In statistical physics of random systems it is often the case that large\ndeviations are exponentially rare and hence all usually considered properties are thermodynamic in this sense. Without attempting a rigorous proof, in statistical physics\nthe following examples are often assumed to be thermodynamic properties: The degree distribution, the entropy density, the fraction of occupied variables in a random\nsatisfying assignment, the distance between two random satisfying assignments, etc.\nProperties that are not thermodynamic are all those relying on the behavior of exponentially rare instances, e.g. moments of some exponentially large quantities, as for\ninstance the number of satisfying assignments.\nDefinition 4.2. Consider two ensembles of random graphs A and B, we call the\ntwo ensembles asymptotically equivalent if and only if every property that is thermodynamic in ensemble A is thermodynamic in ensemble B, and vice versa.\nDefinition 4.3. The planting is called quiet if the corresponding planted and\nrandom ensembles are asymptotically equivalent.\nQuiet planting intuitively means that if one is given a large random graph, one\nis not able to tell if that graph was drawn from the random or from the planted\nensemble. This is because properties that are usually measured to distinguish the two\ngraphs ensembles are thermodynamic (even if proving they are thermodynamic might\nbe in general difficult).\nThe close relation between the random and the planted ensemble was explored\nin [2] for the random graph coloring and bi-coloring problems, see Theorem 6 and\nTheorem 7 in the appendix A of [2]. In statistical physics the quiet planting for graph\ncoloring was discussed in [24].\nProposition 4.4. Denote NG the number of satisfying assignments of an instance G drawn from the random ensemble. If E[log (NG + 1)]/N is a thermodynamic\nproperty, i.e.\n∃c > 0 : ∀ǫ > 0 lim P (| log NG − E[log (N G + 1)]| > ǫN ) < e−cN\nN →∞\n\n(4.1)\n\nand if the annealed entropy is equal to the quenched one, i.e.\nlog E(NG ) = E[log (N G + 1)] + o(N ).\n\n(4.2)\n\nthen the planted ensemble and the random ensemble are asymptotically equivalent.\nProof. [of Prop. 4.4] In the random ensemble we are drawing graphs uniformly\nfrom all the graphs with a given degree distribution. In the planted ensemble we\nare drawing from the same set of graphs but with probability proportional to NG .\nSince (4.1) and (4.2) hold by assumption for the random ensemble, relation (4.1)\nholds for some c′ also for the planted ensemble. Indeed, if (4.1) holds and if there\nwould be larger than exponentially small probability that planting draws instances\nwith | log NG − E[log (N G + 1)]| > ǫN then (4.2) could not hold. For every other\n\n\f12\n\nL. ZDEBOROVÁ AND F. KRZAKALA\n\nthermodynamic property, i.e. such that large deviations are exponentially rare, the\nthe same argument applies.\nStatements equivalent to Prop. 4.4 first appeared in eq. (4) and Theorem 6 in [2].\nNote that when the concentration condition (4.2) can be proven in a stronger form,\nthen the condition on the exponentially rare large deviation can be weakened.\nIn statistical physics, using the cavity method arguments, the condition (4.2) can\nbe evaluated. As we state at the end of sec. 2, when the Bethe entropy is asymptotically exact then the factorization and the equality of the quenched and annealed\nentropies are equivalent. Hence quiet planting is possible in all the factorized problems as long as the Bethe entropy is asymptotically exact. In the non-locked factorized\nproblems, such as the random graph coloring, condition (4.2) ceases to be true strictly\nbefore the satisfiability threshold, as discussed in [24].\nIn the next section we argue that in the factorized locked problems (4.2) holds\nup to the satisfiability threshold, and hence the planted and the random ensembles\nare asymptotically equivalent for the factorized locked problems in the whole range\nof parameters corresponding to the satisfiable phase on the random ensemble.\n4.1. Second moment argument. Relation (4.2) is in general rather hard to\nprove rigorously. Achlioptas and Coja-Oghlan [2] used instead a stronger condition\nE(NG2 ) < C [E(NG )]2 which they proved for the coloring and the bi-coloring of factorgraphs problem for sufficiently sparse graphs.\nFor the factorized locked problems we conjecture that the relation E(NG2 ) <\nC [E(NG )]2 holds in all the factorized locked problems on the purely random ensemble\nas long as l ≤ ls .\nThe first and second moment of the number of solutions in the occupation problems has been computed for a general degree distribution in [42]. Based on numerical\nresults it has been also argued non-rigorously in [42] that the above conjecture holds\nin the balanced locked problems. Here we illustrate that it also holds in the R-in-K\nSAT on random L-regular graphs for L < ls . The first moment entropy, defined by\n(2.3), is in the R-in-K SAT on random L-regular graphs given by eq. (3.8). The\nsecond moment entropy s2nd = limN →∞ log E(NG2 )/N is given by s2dn = maxt s2nd (t)\nwhere [42]\n\n\u0014\niK−2R+s \u00151− L1 \n\u0001s h (1−t)R i2(R−s) h\n\n\n(t−2)R\n\n\ntR\n\n\n1+ K\nR\n X\n\nK\nK\nL\nlog K!\n. (4.3)\ns2nd (t) =\n\n\nK\n(R − s)! (R − s)! s! (K − 2R − s)!\n\n\ns=0\n\n\n\n\nThe interpretation of the parameter 0 ≤ t ≤ 1 follows from expression\nX\nP (σ1 SAT, σ2 SAT ) ,\nE(NG2 ) =\n\n(4.4)\n\nσ1 ,σ2\n\nwhere σ1 and σ2 are configurations and P (*) is a probability over the graph ensemble.\nThe parameter t in (4.3) is then the number of sites occupied in both σ1 and σ2\ndivided by number of sites occupied in one of the solutions, RN/K. We remind that\nin the R-in-K SAT the satisfiability threshold is given by cancellation of the entropy\n(3.8)\n\"\n\u0001 #−1\nlog K\nR \u0001\nls = 1 −\n.\n(4.5)\nR\nKH K\n\n\f13\n\nQUIET PLANTING IN THE LOCKED CONSTRAINT SATISFACTION PROBLEMS\n\nAs s2nd is a maximum of a function of a single variable t, we plot s2nd (t) at L = ls\nin Fig. 4.1. Evaluation of the polynomial function (4.3) for many values of R and K\nin Mathematica shows that for L < ls we have 2sann = s2nd ≥ 0, and for L > ls we\nhave sann = s2nd ≤ 0.\n0\n\n0\n\n-0.01\n-0.02\ns2nd at ls\n\ns2nd at ls\n\n-0.02\n-0.04\nK=1\nK=2\nK=3\nK=4\n\n-0.06\n-0.08\n\n-0.03\nK=2\nK=3\nK=4\nK=5\n\n-0.04\n-0.05\n-0.06\n\n-0.1\n\n-0.07\n0\n\n0.2\n\n0.4\n\n0.6\nt\n\n0.8\n\n1\n\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nt\n\nFig. 4.1. The second moment entropy function s2nd (t) (4.3) at ls for several values of K, in\nthe K-in-2K SAT problem on the left, and 1-in-K SAT on the right.\n\nWe also investigated numerically general formulas for the second moment presented in [42] and concluded that 2sann = s2nd for l < ls , and sann = s2nd ≤ 0 for\nl > ls , holds also for all the other locked factorized problems.\n4.2. Satisfiable factorized locked problems equivalent to the planted\nones. We also conjecture that in the factorized locked models the planted ensemble\nis asymptotically equivalent to the ensemble of satisfiable instances in the whole region\nof l.\nFor a general (non necessarily locked) constraint satisfaction problem the space of\nsatisfying assignments is separated into clusters. We define the entropy s of a cluster as\nthe logarithm of the number of assignments that belong to this cluster. We also define\nthe complexity Σ(s) as the logarithm of the number of clusters of a given entropy s.\nThe function Σ(s) is well defined even in the unsatisfiable region: when Σ(s) < 0 it\nthen corresponds to the large deviation function for the existence of a cluster of a given\nsize [36]. It was argued in [24] that the cluster containing the planted configuration\nhas a size s∗ such that s∗ = argmax[Σ(s) + s]. On the other hand from the large\ndeviation interpretation of the Σ(s) function, most of the rare satisfiable instances in\nthe unsatisfiable region will have one cluster of size s′ = argmax Σ(s) ≤ s∗ .\nIn the locked problems, all clusters contain a single satisfying assignments, hence\ns = 0 for all clusters. Keeping in mind the large deviation interpretation of the\ncomplexity Σ [36], the rare satisfiable instances have a single solution and should be\nasymptotically equivalent to planted instances. And hence the satisfiable and planted\nensembles are asymptotically equivalent in the whole range of l in the factorized locked\nproblems.\n5. Single solution instances. As discussed in the introduction, it is of practical\nimportance to be able to create hard instances which have a single solution with a\nlarge probability. Based on the heuristic cavity method results of [24] we conjecture\nthat in the region l > ls with high probability there is a single solution on large planted\ninstances of the factorized locked problems (or a couple in case of balanced problems).\nIn this section we prove (assuming the properties of the 1st and 2nd moment from\nthe previous section) this statement for the R-in-K SAT on random regular graphs.\n\n\f14\n\nL. ZDEBOROVÁ AND F. KRZAKALA\n\nWe believe that the generalization of the proof is possible also for the other factorized\nlocked problems.\nFirst note that the first moment in the planted R-in-K SAT sann,pl = maxt sann,pl (t)\nis related in a simple way to the first and second moment in the purely random ensemble. It holds for the entropies\nsann,pl(t) = s2nd (t) − sann .\n\n(5.1)\n\nSee an example of the function sann,pl(t) in Fig. 5.1.\nL=2\nL=3\nL=4\nL=5\n\n0.5\n\ns1st for planted\n\n0.4\n0.3\n0.2\n0.1\n0\n-0.1\n-0.2\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nt\n\nFig. 5.1. The first moment entropy in the 4-in-8 SAT on L regular planted ensemble.\n\nFrom the previous section it follows that for L > ls the first moment entropy in\nthe planted ensemble is a negative function for all 0 < t < 1. The parameter t is in the\nplanted ensemble interpreted as the distance from the planted solution. Therefore, for\nL > ls there are no solutions at an extensive (i.e. Θ(N )) distance from the planted\nsolution (except the solution at distance one in the balanced problems).\nTheorem 5.1. Consider a large instance of the R-in-K SAT problem drawn from\nthe planted ensemble, the degree of variables be L > 2. Then there exists an ǫ > 0\nsuch that with high probability there is no solution at distance smaller than ǫN from\nthe planted solution We will use the expander properties of regular bipartite graphs.\nThe following theorem is well known in the theory of expanders [39].\nTheorem 5.2. [Sipser and Spielman [39]] Consider a random factor-graph with\ndegree of variables L and degree of constraints K. Then, for any δ < L−1, there exists\na constant ǫ > 0, such that with high probability for every set of Ñ ≤ ǫN variables the\nnumber of neighboring constraints is larger than δ Ñ . In other words the factor graph\nis a (ǫ, δ) expander.\nProof. [of Theorem 5.1] Let us prove the statement by contradiction. Suppose\nthat as N → ∞ for every ǫ > 0 there is a solution at distance smaller that ǫN\nfrom the planted solution. Denote the distance between the planted and this nearby\nsolution N1 = ǫ′ N . Now consider the factor-graph and the planted solution, N1 of\nvariables have to be changed to reach the nearby solution. Since ǫ′ can be arbitrarily\nsmall Theorem 5.2 implies that there is at least δN1 constraints in which at least\none variable has been changed. The property defining a locked constraint is that if a\nvariable is changed then at least one other has to be changed in order to satisfy the\nconstraint again. Hence each of the at least δN1 constraints have to be connected by\nat least two edges to the N1 changed variables. There is hence at least 2δN1 edges\nconnected to changed variables. The total degree of changed variables is LN1 , hence\nLN1 > 2δN1 . But as δ can be as near to L − 1 as we wish this inequality cannot\n\n\fQUIET PLANTING IN THE LOCKED CONSTRAINT SATISFACTION PROBLEMS\n\n15\n\n1\n\n0.07\naverage entropy per variable\n\nprobability to have only two solutions\n\nhold and we hence reached a contradiction. This proofs that there exists ǫ > 0 such\nthat with high probability there is no solution at distance smaller than ǫN from the\nplanted one.\nProperties of the first moment in the planted ensemble together with Theorem\n5.1 imply that in the planted R-in-K SAT on random regular graphs there is almost\nsurely a single solution (or a pair of solutions for R = K/2).\n\n0.8\n0.6\n0.4\n0.2\nls\n0\n2.6\n\n2.7\n\n2.8\n2.9\n3\naverage degree\n\nM=40\nM=60\nM=80\nM=100\nM=120\n3.1\n\nls\n\n0.06\n0.05\n\nM=40\nM=60\nM=80\nM=100\nM=120\nasymptotic value\n\n0.04\n0.03\n0.02\n0.01\n0\n\n3.2\n\n2.6\n\n2.7\n\n2.8\n2.9\n3\naverage degree\n\n3.1\n\n3.2\n\nFig. 5.2. Left: Probability (over 5000 instances) that there is a single pair of solutions in the\n2-in-4 SAT as a function of the average degree and the size of the graph. Right: Data are the\naverage entropy density (logarithm of the number of solutions per variables) of the instances. The\nline represents the entropy density in the N → ∞ limit, eq. (3.7). The data are obtained with the\nrelsat algorithm [18]. In both parts we marked the threshold ls = 2.827.\n\n6. Average computational hardness. One of the most interesting aspects of\nthe study of random constraint satisfaction problems is the average computational\nhardness of a given ensemble. This has been discussed extensively in both the computer science and the physics literature, in particular for the K-satisfiability and coloring problems. It has been shown empirically that the hardest instances lie very near to\nthe satisfiability threshold ls , and an easy-hard-easy pattern is often described [5, 31].\nLater works focused on predicting up to which connectivity polynomial algorithms\nare able to find solutions, see e.g. [30, 41, 37]. Instances with a very large density\nof constraints are typically unsatisfiable. In some problems, e.g. K-satisfiability, no\non average polynomial algorithms are known to show unsatisfiability for arbitrary\nlarge but constant density of constraints [6]. In other, more constraint, problems unit\nclause propagation based schemes were shown to be efficient [1]. In the planted instances, which are always satisfiable, it is known that for sufficiently large density of\nconstraints solutions can be found in polynomial time, see e.g. [21, 8]. The situation\nin the planted factorized locked problems is very interesting: on top of the easy low\nand high constraint density phases we show that there also exists an intermediate\nhard phase, and we locate both the boundary thresholds.\nWe argued that in the satisfiable phase l < ls the planted and random ensembles\nare asymptotically equivalent, this includes the average behavior of algorithms. It was\nargued in [43, 42] that for average degree l < ld the locked problems are algorithmically\neasy whereas for ld < l < ls they are on average hard.\nThe second hard-easy transition is particular to the planted ensemble and happens\nin the unsatisfiable phase l > ls . We will study the behavior of the BP equations\ninitialized randomly to locate this transition.\n\n\f16\n\nL. ZDEBOROVÁ AND F. KRZAKALA\n\n6.1. The spinodal point. By definition of the factorized locked problems the\nbelief propagation equations (2.1) initialized randomly converge to a uniform fixed\npoint. But as the average degree is growing this ceases to be true. In the problems\nthat we are studying here, there actually exists a critical average degree ll beyond\nwhich belief propagation converges spontaneously towards the planted solution. This\nyields a clear hard-easy transition in the algorithmic complexity. In statistical physics\nterms this threshold ll corresponds to a spinodal point of the liquid state [24]. The\nspinodal point also corresponds to the Kesten-Stigum bound [19, 20], and to the\nrobust reconstruction threshold on trees [16]. This is yet another important connection\nbetween the reconstruction problem and the planted ensemble.\nIn order to compute the spinodal point let us first define matrix z(s′ |s). Consider\na variable and one of its neighbors, z(s′ |s) is then the probability that in the planted\nconfiguration the variable was assigned s′ given that its neighbors was s. In the terms\non reconstruction on trees z(s′ |s) is the probability that in the broadcasting a variable\nwas assigned s′ given its parent was s. Components of z(s′ |s) can be computed as\nK \u0012\nX\n1−\nz(0|0) =\nr=0\n\nz(1|1) =\n\nr\nK −1\n\n\u0013\n\nyr (0) ,\n\nK\nX\nr−1\nyr (1) ,\nK\n−1\nr=0\n\nz(1|0) = 1 − z(0|0) ,\n\n(6.1)\n\nz(0|1) = 1 − z(1|1) .\n\n(6.2)\n\nwhere\n(K − r) xr\nyr (0) = PK\n,\nt=0 (K − t) xt\n\nr xr\nyr (1) = PK\n,\nt=0 t xt\n\n(6.3)\n\nwhere xr is given by (3.4) or (3.5). Explicit formulas for the regular problems are\nPK−2 K−2\u0001\nr(L−1) (K−r−1)(L−1)\nδA(r),1 ψ1\nψ0\nr=0\nr\n,\n(6.4)\nz(0|0) = PK−1\n\u0001\nr(L−1) (K−r−1)(L−1)\nK−1\nδA(r),1 ψ1\nψ0\nr=0\nr\nPK K−2\u0001\n(r−1)(L−1) (K−r)(L−1)\nψ0\nr=2 r−2 δA(r),1 ψ1\nz(1|1) = PK K−1\u0001\n.\n(6.5)\n(r−1)(L−1) (K−r)(L−1)\nψ0\nr=1 r−1 δA(r),1 ψ1\n\nThe first eigenvalue of this matrix is equal to one, and is associated with a trivial\nhomogeneous eigenvector. The second eigenvalue of the matrix z is given by\nλ = z(0|0) + z(1|1) − 1 .\n\n(6.6)\n\nA well-known property of the reconstruction on a tree is that reconstruction is\nalways possible beyond the so called Kesten-Stigum (KS) threshold [19, 20]. In our\nnotation the KS condition says that if (L − 1)(K − 1)λ2 > 1 then the reconstruction\nis possible, i.e., the leaves asymptotically contain some information about the value\nsent by the root. In statistical physics the Kesten-Stigum condition is equivalent to\nthe de Almeida-Thouless instability of the paramagnetic phase towards a spin-glass\nphase [9, 26, 22], that is for (L − 1)(K − 1)λ2 > 1 the belief propagation equations\n(2.1) do not converge. This can be seen from the fact that\nλ=\n\n∂ψ1a→i\n∂ψ1b→j\n\n,\n\n(6.7)\n\n\fQUIET PLANTING IN THE LOCKED CONSTRAINT SATISFACTION PROBLEMS\n\n17\n\nwhere j ∈ ∂a \\ i, and b ∈ ∂j \\ a.\nThe eigenvalue λ and the condition for reconstructibility (L − 1)(K − 1)λ2 > 1\nalso appear in the problem of robust reconstruction on trees [16]. In the problem\nof robust reconstruction it is required that even if an arbitrary large fraction of the\nvalues on the leaves is erased there is still information about the root left.\nThe analysis of the instability of the uniform BP fixed point towards the planted\nsolution then goes as follows. Consider a part of the factor-graph as depicted in\nFig. 2.1. Denote the values of the messages in the uniform fixed BP fixed point by\nover-bars. Consider the incoming message to be perturbed from the uniform value as\n\u0012 b→j\n\u0013\nψ1 = ψ1 + ǫ\n.\n(6.8)\nψ0b→j = ψ0 − ǫ\nNote that ǫ can be both negative or positive. The equation (6.7) then implies that\nthe outgoing message will be\n\u0012 a→i\n\u0013\nψ1 = ψ1 + λǫ\n.\n(6.9)\nψ0a→i = ψ0 − λǫ\nIn other words, any infinitesimal noise in one of the incoming message is multiplied\nby λ in the recursion.\nWe call the perturbation of the incoming message ǫ+ if j was occupied in the\nplanted configuration, and ǫ− otherwise. If the variable i was planted in the occupied\nstate, then j was planted occupied with probability z(1|1), and empty with probability z(0|1). Similarly, if the variable i was planted in the empty state, then j was\nplanted empty with probability z(0|0) and occupied with probability z(1|0). Thus the\nevolution of the perturbation is governed by the equation:\n\u0012 a→i \u0013\n\u0012\n\u0013 \u0012 b→j \u0013\nǫ+\nz(1|1) z(0|1)\nǫ+\n=\nλ\n.\n(6.10)\nǫa→i\nz(1|0) z(0|0)\nǫb→j\n−\n−\nMoreover there are (K − 1)(L − 1) possible incoming messages in the regular\ngraph, thus the criterion (K − 1)(L − 1)λ2 = 1. If (K − 1)(L − 1)λ2 < 1 then the\nperturbation decreases and we find only the uniform BP fixed point, if on the contrary\n(K−1)(L−1)λ2 > 1 the uniform BP fixed point is unstable and a perturbation towards\nthe planted configuration amplifies exponentially.\nAs the planted configuration corresponds to a stable BP fixed point1 the BP\niterations converge instead to the planted solution. Fig. 6.1 confirms that this is true\neven on rather small graphs. On the balanced locked problems, where we are not\nrestricted to regular graphs, the correct condition is (K − 1)γλ2 = 1, where γ is the\nmean of the excess degree distribution q(l) = (l + 1)Q(l + 1)/l. The spinodal point ll ,\nsee Tabs. 3.1,3.2, is then defined by\n(K − 1)(ll − 1)λ2 = 1\n\n(6.11)\n\n1 − e−cl\ncl\n\n(6.12)\n\nfor the regular graphs, and\n(K − 1)λ2 =\n\n1 Note that in the above calculation we considered the stability around the uniform BP fixed\npoint, if we consider the BP fixed point corresponding to the planted solution the perturbation does\nnot amplify.\n\n\f18\n\nL. ZDEBOROVÁ AND F. KRZAKALA\n\nfor the truncated Poissonian distribution.\nThe existence of this spinodal point, together with the conjecture about equivalence between the planted ensemble and the ensemble of satisfiable instances from\nthe random ensemble, Sec. 4, implies that for l > ll it is easy to recognize almost\nall satisfiable instances of the locked problems. Similar conclusions, without a sharp\nthreshold, were established for the coloring and satisfiability problems in [7, 11].\n6.2. Belief propagation as a solver. Belief propagation reinforcement is a\ngood solver in the region l < ld as shown empirically in [43, 42] in the random\nensemble. Since the two ensembles are equivalent in that region, nothing changes for\nthe planted ensemble. We have indeed verified this numerically.\nBased on the above arguments, belief propagation equations converge to the uniform fixed point for l < ll and directly to the planted solution for l > ll . In order\nto verify that on finite size instances, we have performed the following numerical experiment: we have generated many planted instances for different sizes and average\ndegrees (5000 instances for each set of parameters). We then iterated the BP equations (2.1) starting from random initial conditions. For numerical stability reasons we\nused dumping in the iterations, i.e. each time we computed a new message we kept\none half of the sum of the new and old message. As a convergence criterion we used\nthat the messages should not change more that 2.10−3 per message (we checked that\na smaller criterion does not change the quality of results, and only slows down the\ncomputation). This way every iteration converged either to a configuration where the\nbias of each variable pointed towards the planted solution (or to its negation) or to a\npoint very near to the uniform fixed point. Fig. 6.1 shows in what fraction of the runs\nwe were able to find the planted solution and in particular it confirms that for l > ll\nit is easy to find it in linear time. On the right of the same figure we plot the average\nconvergence time (given the criterion 2.10−3 per message). We see that around the\nspinodal point ll the convergence time diverges from both the sides (slightly faster\nfrom the large degree side).\n3500\naverage number of rounds\n\nproportion of instances solved\n\n1\n0.9\n0.8\n0.7\n0.6\n0.5\n0.4\n0.3\n0.2\nll\n\n0.1\n0\n2.8\n\n3\n\n3.2\n\nM=64\nM=256\nM=1024\nM=4096\n\n3.4\n3.6\n3.8\naverage degree\n\n4\n\nM=64\nM=256\nM=1024\nM=4096\n\n3000\n2500\n2000\n1500\n1000\n500\nll\n\n0\n4.2\n\n4.4\n\n2.8\n\n3\n\n3.2\n\n3.4 3.6 3.8\naverage degree\n\n4\n\n4.2\n\n4.4\n\nFig. 6.1. Belief propagation on the 2-in-4 SAT problem. Left: Probability that the belief\npropagation algorithm finds the planted configuration when initialized randomly plotted as a function\nof the average degree for several system sizes. Right: The convergence time dependence on the\naverage degree. In both cases, we have stopped the BP iterations when the average change per\nmessage was less than 2.10−3 . In both parts we marked the spinodal threshold ll = 3.434.\n\n7. Conclusions and perspectives. In this work we have studied a class of\nconstraint satisfaction problems on a planted ensemble. The solution is planted in a\nquiet way, i.e. the planted configuration is one of the typical solutions of the resulting\n\n\fQUIET PLANTING IN THE LOCKED CONSTRAINT SATISFACTION PROBLEMS\n\n19\n\ninstance. So far we know how to realize such plantings only on the factorized problems. We describe several connections between this quiet planting and the problem\nof reconstruction on trees.\nWe study the locked problems because of the simple structure on the space of\ntheir solutions - solutions are isolated points instead of clusters. This property\nmakes the locked problems, however, very hard algorithmically. We focused on the\nclass of occupation locked problems in this manuscript, all our results generalize easily\nto any factorized locked problem, on non-binary variables for example.\nOn non-locked but factorized problems, as e.g. graph coloring, the concept of\nquiet planting stays valid [24], however, the random and planted ensembles are not\nequivalent up to the satisfiability threshold. Moreover, in the unsatisfiable phase the\nplanted ensemble has exponentially many solutions, instead of a single one as is the\ncase in the locked problems. The non-locked problems are also much less friendly for\nfirst and second moment considerations. The phase diagram of the locked but nonfactorized problem will not be very different from the one presented here. However,\nthe thresholds will be different in the planted and random ensembles and the two\nensembles are not equivalent.\nOne of the most important results of our work is the location of the algorithmically\nhard region, between ld ≤ l ≤ ll , in the problems under investigation. It would be\nin particular interesting to design an algorithm which would provably find solutions\nin the region l > ll , as we have only heuristic and numerical arguments. This is also\nchallenging in the non-locked problems, as e.g. graph coloring, where we predicted\nthe planted Poisson ensemble to be easy above ll = (q −1)2 (on planted regular graphs\nLl = (q − 1)2 + 1), where q is the number of colors. Results establishing that the\nplanted ensemble on coloring is easy above Cq 2 , where C is some constant quite larger\nthat one, are already known [21, 8].\nFinally, another consequence of our work worth discussing is that we know how to\ngenerate unique satisfying assignment instances - both in the hard and easy regions.\nSuch instances are often used for evaluating the performance of the quantum annealing algorithm, but so far they have been generated with an exponential cost from an\nensemble with unknown classical average computational complexity [40, 12]. In our\nopinion, these works should be repeated on instances of the locked problems. We\nconjecture that in the classically hard region also the quantum annealing will be exponential (this is because we anticipate a first order phase transition in the transverse\nmagnetic field, as in [17]).\nAcknowledgments. We thank to Dimitris Achlioptas, Amin Coja-Oghlan, Matti\nJarvisalo, Andrea Montanari, Cris Moore and Guilhem Semerjian for fruitful discussions and suggestions.\nREFERENCES\n[1] Dimitris Achlioptas, Arthur Chtcherba, Gabriel Istrate, and Cristopher Moore, The\nphase transition in 1-in-k sat and nae 3-sat, in SODA '01: Proceedings of the twelfth annual ACM-SIAM symposium on Discrete algorithms, Philadelphia, PA, USA, 2001, SIAM,\npp. 721–722.\n[2] Dimitris Achlioptas and Amin Coja-Oghlan, Algorithmic barriers from phase transitions.\narXiv:0803.2122v2, 2008.\n[3] S. Ben-Shimon and D. Vilenchik, Message passing for the coloring problem: Gallager meets\nalon and kahale, in Proceedings of the 13th International Conference on Analysis of Algorithms, DMTCS proc., 2007, pp. 217–226.\n[4] G. Biroli and M. Mézard, Lattice glass models, Phys. Rev. Lett., 88 (2002), p. 025501.\n\n\f20\n\nL. ZDEBOROVÁ AND F. KRZAKALA\n\n[5] Peter Cheeseman, Bob Kanefsky, and William M. Taylor, Where the Really Hard Problems Are, in Proc. 12th IJCAI, San Mateo, CA, USA, 1991, Morgan Kaufmann, pp. 331–\n337.\n[6] Vašek Chvtal and Endre Szemerdi, Many hard examples for resolution, J. ACM, 35 (1988),\npp. 759–768.\n[7] A. Coja-Oghlan, M. Krivelevich, and D. Vilenchik, Why almost all k-colorable graphs are\neasy to color, in Proceedings of the 24th International Symposium on Theoretical Aspects\nof Computer Science (STACS), LNCS 4393, 2007, pp. 121–132.\n[8] Amin Coja-Oghlan, Elchanan Mossel, and Dan Vilenchik, A spectral approach to analyzing belief propagation for 3-coloring, Combinatorics, Probability and Computing, 18\n(2009), pp. 881–912.\n[9] J. R. L. de Almeida and D. J. Thouless, Stability of the Sherrington-Kirkpatrick solution of\na spin-glass model, J. Phys. A, 11 (1978), pp. 983–990.\n[10] William Evans, Claire Kenyon, Yuval Peres, and Leonard J. Schulman, Broadcasting\non trees and the Ising model, Ann. Appl. Probab., 10 (2000), pp. 410–433.\n[11] R. Monasson F. Altarelli and F. Zamponi, Can rare sat formulas be easily recognized? on\nthe efficiency of message passing algorithms for k-sat at large clause-to-variable ratios, J.\nPhys. A: Math. Theor., 40 (2007), pp. 867–886.\n[12] E. Farhi, J. Goldstone, S. Gutmann, J. Lapan, A. Lundgren, and D. Preda, A quantum\nadiabatic evolution algorithm applied to random instances of an np-complete problem,\nScience, 292 (2001), p. 472.\n[13] U. Feige, E. Mossel, and D. Vilenchik, Complete convergence of message passing algorithms\nfor some satisfiability problems, in Proc. of Random 2006, LNCS 4410, 2006, p. 339350.\n[14] Robert G. Gallager, Low-density parity check codes, IEEE Trans. Inform. Theory, 8 (1962),\npp. 21–28.\n[15] R. G. Gallager, Information theory and reliable communication, John Wiley and Sons, New\nYork, 1968.\n[16] Svante Janson and Elchanan Mossel, Robust reconstruction on trees is determined by the\nsecond eigenvalue, Ann. Probab., 32 (2004), pp. 2630–2649.\n[17] Thomas Joerg, Florent Krzakala, Jorge Kurchan, and A. C. Maggs, Simple glass models and their quantum annealing, Phys. Rev. Lett., 101 (2008), p. 147204.\n[18] R. J. Bayardo Jr. and J. D. Pehousek, Counting models using connected components, in\nProc. 17th AAAI, Menlo Park, California, 2000, AAAI Press, pp. 157–162.\n[19] H. Kesten and B. P. Stigum, Additional limit theorems for indecomposable multidimensional\ngalton-watson processes, The Annals of Mathematical Statistics, 37 (1966), p. 1463.\n[20]\n, Limit theorems for decomposable multi-dimensional galton-watson processes, J. Math.\nAnal. Appl., 17 (1966), p. 309.\n[21] M. Krivelevich and D. Vilenchik, Semi-random models as benchmarks for coloring algorithms, in Proceedings of the Third Workshop on Analytic Algorithmics and Combinatorics\n(ANALCO), 2006, pp. 211–221.\n[22] Florent Krzakala, Andrea Montanari, Federico Ricci-Tersenghi, Guilhem Semerjian,\nand Lenka Zdeborová, Gibbs states and the set of solutions of random constraint satisfaction problems, Proc. Natl. Acad. Sci. U.S.A, 104 (2007), p. 10318.\n[23] F. Krzakala, M. Tarzia, and L. Zdeborová, A Lattice Model for Colloidal Gels and Glasses,\nPhys. Rev. Lett., 101 (2008), p. 165702.\n[24] Florent Krzakala and Lenka Zdeborová, Hiding quiet solutions in random constraint\nsatisfaction problems, Phys. Rev. Lett., 102 (2009), p. 238701.\n[25] F. R. Kschischang, B. Frey, and H.-A. Loeliger, Factor graphs and the sum-product algorithm, IEEE Trans. Inform. Theory, 47 (2001), pp. 498–519.\n[26] Marc Mézard and Andrea Montanari, Reconstruction on trees and spin glass transition,\nJ. Stat. Phys., 124 (2006), pp. 1317–1350.\n[27] M. Mézard and A. Montanari, Information, Physics, Computation, Oxford University Press,\nOxford, 2009.\n[28] M. Mézard and G. Parisi, The bethe lattice spin glass revisited, Eur. Phys. J. B, 20 (2001),\np. 217.\n[29] M. Mézard, G. Parisi, and M. A. Virasoro, Spin-Glass Theory and Beyond, vol. 9 of Lecture\nNotes in Physics, World Scientific, Singapore, 1987.\n[30] M. Mézard, G. Parisi, and R. Zecchina, Analytic and algorithmic solution of random satisfiability problems, Science, 297 (2002), pp. 812–815.\n[31] David G. Mitchell, Bart Selman, and Hector J. Levesque, Hard and easy distributions\nfor SAT problems, in Proc. 10th AAAI, Menlo Park, California, 1992, AAAI Press, pp. 459–\n465.\n\n\fQUIET PLANTING IN THE LOCKED CONSTRAINT SATISFACTION PROBLEMS\n\n21\n\n[32] A. Montanari and G. Semerjian, On the dynamics of the glass transition on bethe lattices,\nJ. Stat. Phys., 124 (2006), pp. 103–189.\n[33] T. Mora, Géométrie et inférence dans l'optimisation et en théorie de l'information, PhD\nthesis, Université Paris-Sud, 2007. http://tel.archives-ouvertes.fr/tel-00175221/en/.\n[34] Elchanan Mossel, Reconstruction on trees: Beating the second eigenvalue, Ann. Appl.\nProbab., 11 (2001), pp. 285–300.\n[35] J. Pearl, Reverend bayes on inference engines: A distributed hierarchical approach, in Proceedings American Association of Artificial Intelligence National Conference on AI, Pittsburgh, PA, USA, 1982, pp. 133–136.\n[36] O. Rivoire, The cavity method for large deviations, J. Stat. Mech., (2005), p. P07004.\n[37] Sakari Seitz, Mikko Alava, and Pekka Orponen, Focused local search for random 3satisfiability, J. Stat. Mech., (2005), p. P06006.\n[38] Bart Selman, Henry A. Kautz, and Bram Cohen, Local search strategies for satisfiability testing, in Proceedings of the Second DIMACS Challange on Cliques, Coloring, and\nSatisfiability, Michael Trick and David Stifler Johnson, eds., Providence RI, 1996.\n[39] Michael Sipser and Daniel A. Spielman, Expander codes, IEEE Transactions on Information\nTheory, 42 (1996), pp. 1710–1722.\n[40] A. P. Young, S. Knysh., and V.N. Smelyanskiy, Size dependence of the minimum excitation\ngap in the quantum adiabatic algorithm, Phys. Rev. Lett., 101 (2008), p. 170503.\n[41] L. Zdeborová and F. Krzakala, Phase transitions in the coloring of random graphs, Phys.\nRev. E, 76 (2007), p. 031131.\n[42] L. Zdeborová and M. Mézard, Constraint satisfaction problems with isolated solutions are\nhard, J. Stat. Mech., (2008), p. P12004.\n[43]\n, Locked constraint satisfaction problems, Phys. Rev. Lett., 101 (2008), p. 078702.\n\n\f"}