{"id": "http://arxiv.org/abs/0708.3644v1", "guidislink": true, "updated": "2007-08-27T17:10:12Z", "updated_parsed": [2007, 8, 27, 17, 10, 12, 0, 239, 0], "published": "2007-08-27T17:10:12Z", "published_parsed": [2007, 8, 27, 17, 10, 12, 0, 239, 0], "title": "Inflation from IIB Superstrings with Fluxes", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0708.2876%2C0708.1221%2C0708.4169%2C0708.0188%2C0708.0328%2C0708.0307%2C0708.1599%2C0708.3215%2C0708.4003%2C0708.0462%2C0708.4053%2C0708.2449%2C0708.0354%2C0708.2869%2C0708.3353%2C0708.0741%2C0708.2822%2C0708.0450%2C0708.3440%2C0708.2592%2C0708.0364%2C0708.2155%2C0708.3028%2C0708.2202%2C0708.0216%2C0708.2120%2C0708.1156%2C0708.0860%2C0708.2438%2C0708.2387%2C0708.2341%2C0708.1712%2C0708.2082%2C0708.3767%2C0708.3644%2C0708.1169%2C0708.3729%2C0708.3771%2C0708.2403%2C0708.3129%2C0708.1677%2C0708.3595%2C0708.1593%2C0708.2581%2C0708.3295%2C0708.3142%2C0708.2289%2C0708.2628%2C0708.0864%2C0708.3180%2C0708.2432%2C0708.3247%2C0708.1977%2C0708.1198%2C0708.2884%2C0708.0435%2C0708.4394%2C0708.0937%2C0708.4047%2C0708.0785%2C0708.1984%2C0708.0027%2C0708.0626%2C0708.0336%2C0708.1495%2C0708.3270%2C0708.3801%2C0708.0298%2C0708.2198%2C0708.3160%2C0708.1600%2C0708.0329%2C0708.0772%2C0708.3969%2C0708.2021%2C0708.2094%2C0708.2138%2C0708.2844%2C0708.3889%2C0708.0356%2C0708.0691%2C0708.2760%2C0708.3903%2C0708.1875%2C0708.0906%2C0708.0905%2C0708.0528%2C0708.0566%2C0708.3695%2C0708.2398%2C0708.1964%2C0708.3935%2C0708.4356%2C0708.1118%2C0708.4354%2C0708.1026%2C0708.3807%2C0708.3294%2C0708.2303%2C0708.2189%2C0708.1955&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Inflation from IIB Superstrings with Fluxes"}, "summary": "We study the conditions needed to have an early epoch of inflationary\nexpansion with a potential coming from IIB superstring theory with fluxes\ninvolving two moduli fields. The phenomenology of this potential is different\nfrom the usual hybrid inflation scenario and we analize the possibility that\nthe system of field equations undergo a period of inflation in three different\nregimes with the dynamics modified by a Randall-Sundrum II term in the\nFriedmann equation. We find that the system can produce inflation and due to\nthe modification of the dynamics, a period of accelerated contraction can\nfollow or preceed this inflationary stage depending on the sign of one of the\nparameters of the potential. We discuss on the viability of this model in a\ncosmological context.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0708.2876%2C0708.1221%2C0708.4169%2C0708.0188%2C0708.0328%2C0708.0307%2C0708.1599%2C0708.3215%2C0708.4003%2C0708.0462%2C0708.4053%2C0708.2449%2C0708.0354%2C0708.2869%2C0708.3353%2C0708.0741%2C0708.2822%2C0708.0450%2C0708.3440%2C0708.2592%2C0708.0364%2C0708.2155%2C0708.3028%2C0708.2202%2C0708.0216%2C0708.2120%2C0708.1156%2C0708.0860%2C0708.2438%2C0708.2387%2C0708.2341%2C0708.1712%2C0708.2082%2C0708.3767%2C0708.3644%2C0708.1169%2C0708.3729%2C0708.3771%2C0708.2403%2C0708.3129%2C0708.1677%2C0708.3595%2C0708.1593%2C0708.2581%2C0708.3295%2C0708.3142%2C0708.2289%2C0708.2628%2C0708.0864%2C0708.3180%2C0708.2432%2C0708.3247%2C0708.1977%2C0708.1198%2C0708.2884%2C0708.0435%2C0708.4394%2C0708.0937%2C0708.4047%2C0708.0785%2C0708.1984%2C0708.0027%2C0708.0626%2C0708.0336%2C0708.1495%2C0708.3270%2C0708.3801%2C0708.0298%2C0708.2198%2C0708.3160%2C0708.1600%2C0708.0329%2C0708.0772%2C0708.3969%2C0708.2021%2C0708.2094%2C0708.2138%2C0708.2844%2C0708.3889%2C0708.0356%2C0708.0691%2C0708.2760%2C0708.3903%2C0708.1875%2C0708.0906%2C0708.0905%2C0708.0528%2C0708.0566%2C0708.3695%2C0708.2398%2C0708.1964%2C0708.3935%2C0708.4356%2C0708.1118%2C0708.4354%2C0708.1026%2C0708.3807%2C0708.3294%2C0708.2303%2C0708.2189%2C0708.1955&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study the conditions needed to have an early epoch of inflationary\nexpansion with a potential coming from IIB superstring theory with fluxes\ninvolving two moduli fields. The phenomenology of this potential is different\nfrom the usual hybrid inflation scenario and we analize the possibility that\nthe system of field equations undergo a period of inflation in three different\nregimes with the dynamics modified by a Randall-Sundrum II term in the\nFriedmann equation. We find that the system can produce inflation and due to\nthe modification of the dynamics, a period of accelerated contraction can\nfollow or preceed this inflationary stage depending on the sign of one of the\nparameters of the potential. We discuss on the viability of this model in a\ncosmological context."}, "authors": ["Erandy Ramirez", "Tonatiuh Matos"], "author_detail": {"name": "Tonatiuh Matos"}, "author": "Tonatiuh Matos", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1142/S0217751X09043237", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0708.3644v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0708.3644v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages, 6 figures", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0708.3644v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0708.3644v1", "journal_reference": "Int.J.Mod.Phys.A24:2431-2452,2009", "doi": "10.1142/S0217751X09043237", "fulltext": "Inflation from IIB Superstrings with Fluxes\nErandy Ramı́rez∗ and Tonatiuh Matos†‡\n\narXiv:0708.3644v1 [astro-ph] 27 Aug 2007\n\nDepartamento de Fı́sica, Centro de Investigación y de Estudios Avanzados del IPN, A.P. 14-740, 07000 México D.F., México.\n(Dated: December 10, 2018)\nWe study the conditions needed to have an early epoch of inflationary expansion with a potential\ncoming from IIB superstring theory with fluxes involving two moduli fields. The phenomenology of\nthis potential is different from the usual hybrid inflation scenario and we analyze the possibility that\nthe system of field equations undergo a period of inflation in three different regimes with the dynamics modified by a Randall-Sundrum II term in the Friedmann equation. We find that the system can\nproduce inflation and due to the modification of the dynamics, a period of accelerated contraction\ncan follow or preceed this inflationary stage depending on the sign of one of the parameters of the\npotential. We discuss on the viability of this model in a cosmological context.\nPACS numbers: 98.80.-k,98.80.Cq\n\nI.\n\nINTRODUCTION\n\nis given by [1]\n\u0010\n\u0011\nMP4 2 −2Σi σi h −Φ(0)\n(0)\nh\ne\ne\ncosh\nΦ\n−\nΦ\n4(8π)3\n\u0015\n1 Φ\n+\ne (C − C (0) )2 − 1 ,\n(1)\n2\n\nVdil =\nThe last 50 years have been one of the most fruitful\nones in the life of physics, the standard model of particles\nand the standard model of cosmology (SMC) essentially\ndeveloped in this period, are now able to explain a great\nnumber of observations in laboratories and cosmological\nobservatories as never before. In only 50 years great steps\nhave been given in the understanding of the origin and\ndevelopment of the universe. Nevertheless, many questions are still open, for example the SMC contains two\nperiods, inflation and structure formation. For the understanding of the structure formation epoch we need to\npostulate the existence of two kind of substances, the\ndark matter and the dark energy. Without them, it is\nimpossible to explain the formation of galaxies and cluster of galaxies, or the observed accelerated expansion of\nthe universe. On the other side, it has been postulated\na period of inflation in order to give an explanation for\nseveral observations as the homogeneity of the universe,\nthe close value of the density of the universe to the critical density or the formation of the seeds which formed\nthe galaxies. However, there is not a theory that unify\nthis two periods, essentially they are disconnected from\neach other.\nIn this work we study the possibility that superstring\ntheory could account for the unification between inflation\nand the structure formation using a specific example. Recently, Frey and Mazumdar [1], were able to compactify\nthe IIB superstrings including 32 fluxes. In the context of\nthe type IIB supergravity theory on the T6 /Z2 orientifold\nwith a self-dual three-form fluxes, it has been shown that\nafter compactifaying the effective dilaton-axion potential\n\n† IAC\n∗ Electronic\n‡ Electronic\n\naddress: erandy@fis.cinvestav.mx\naddress: tmatos@fis.cinvestav.mx\n\nwhere h2 = 61 hmnp hqrs δ mq δ nr δ ps . Here hmnp are the\nNS-NS integral fluxes, the superscript (0) in the fields\nstands for the fields in the vacuum configuration and finally σi with i = 1, 2, 3 are the overall size of each factor\nT2 of the T6 /Z2 orientifold. This potential contains two\nmain scalar fields (moduli fields), the dilaton Φ and the\naxion C. In [2], the dilaton was interpreted as dark matter and under certain conditions the model reproduces\nthe observed universe, i.e., the structure formation. In\nthis work we investigate if the same theory could give an\ninflationary period in order to obtain a unified picture\nbetween these two epochs. In other words, in this paper\nwe search if it is possible that the same low energy Lagrangian of IIB superstrings with the scalar and axion\npotential (1) can give an acceptable inflationary period.\nTo deal with the fluxes, we work in the brane representation of space-time, working with a RS-II modification\nin the equations. Due to the presence of the fluxes during this period, these models have the phenomenology of\nthe Randall-Sundum models [7],[8],[1] and we have chosen to work with the RS-II one, but the same type of\nanalysis could be done for the other model. The paper\nis organized as follows. In section II we introduce an appropriate parametrization of potential (1) in order to give\nunities to the physical quantities and to study the cosmology of the low energy Lagrangian and give the field\nequation to be solved. In section III we solve the equations in the different regimes and conditions. In section\nIV we give the main results and in section V we discuss\nsome conclusions and perspectives.\n\n\f2\nII.\n\nTHE POTENTIAL\n\nIn order to study the cosmology of this model, it is\nconvenient to define the following quantities\n√\nλ κφ = Φ − Φ(0) ,\nMP4 2 −2Σi σi −Φ(0)\ne\n,\nh e\nV0 =\n4(8π)3\n√\nC − C (0) = κψ,\nψ0 = e\n\nΦ(0)\n\n,\n\n√\n\u0001 1\n√ \u0001\n= V0 cosh λ κφ − 1 + V0 eλ κφ ψ0 2 κψ 2 + L\n2\n= V + L.\n(3)\n\nwhere L is interpreted as the cosmological constant,\nwhich we will take as subdominant during the inflationary period. In what follows we want to study the behaviour of this potential at early times when the scalar\nfield φ takes large values and study the conditions that\nthe parameters λ and V0 need to meet in order to have\ninflation. Thus expressing the cosh function in terms of\nexponentials and taking the limit φ big, we arrive to the\nfollowing expression for the potential:\n√\n1\nV0 eλ κφ (1 + κψ02 ψ 2 ) − V0 ,\n2\n\n-2\n\n0.8\n0\n\n0.6\n\nλκ1/2φ\n\n2\n\n0.4\n4\n\n0.2\n\nMany thanks to Anupam Mazumdar for this suggestion\n\nψ0κ1/2ψ\n\n6\n\nFIG. 1: Potential\n\nconcerning the evolution of ψ is erased by the expansion\nled by the φ field if inflation is to happen. Thus we can\nwork with the following expression for the potential:\nV (φ) =\n\n√\n1\nV0 eλ κφ − V0\n2\n\n(5)\n\nWe will follow closely the analysis done by Copeland et al.\n[4] and Mendes and Liddle [5] in order to obtain the conditions for this potential to undergo inflation in the cases\nwhen the scalar field or the V0 term dominate the dynamics as well as in the intermediate stage. Our calculations\nare performed in the high-energy regime within the slowroll approximation since a potential slow-roll formalism\nhas already been provided for this scenario [10].\n\n(4)\n\nwhere we have taken into account that the cosmological constant is much smaller than the coefficient of the\npotential, L << V0 , nevertheless, it remains a term V0\nacting during the inflationary period like an extra \"cosmological constant\" and that we will address as a free\nparameter of the model. In contrast with the usual hybrid inflation scenario [3], there is no critical value for\nwhich this potential exhibits a phase transition triggering the end of inflation (if any such process occurs). The\npotential follows an exponential behaviour in the φ field\nthat prevents it from staying at a fixed value from the\nstart, i.e. it cannot relax at φ = 0 or at any other different value (apart from infinity). A plot of the potential\nillustrates this behaviour, see Fig. 1. We have checked\nthat there are no saddle points for this potential Eq. (4)\nand also for potentials (1) and (3) 1 , but a global minimum at ψ = 0. Therefore, we will assume that there is\nsome mechanism by which the ψ field rolls down to its\nminimum at ψ = 0 oscillating around it at the very early\nstages of evolution and that any processes such as inflation took place afterwards. In this way, any information\n\n1\n\n-6\n-4\n\n1\n\n(2)\n\n√\nwhere λ is the string coupling λ = ehΦi , and κ = 1/Mp\nwith Mp = (8πG)−1/2 the reduced Planck mass. With\nthis new variables, the dilaton potential transforms into\n\nV (φ, ψ) =\n\n50\n45\n40\n35\n30\n25\n20\n15\n10\n5\n0\n-5\n\n0\n\n(0)\n\nL = V0 (1 − eΦ ),\n\nVdil\n\nV/V0\n\nA.\n\nField equations\n\nIn the presence of branes, particularly in the RS-II\nscenario, the Friedmann equation changes from its usual\nexpression to [8]:\n\u0013\n\u0012\nρ\nκ\n2\n,\n(6)\nH = ρ 1+\n3\nρ0\nwhere H ≡ ȧ/a, a is the scale factor of the Universe, a dot\nmeans derivative with respect to time and ρ0 is the brane\ntension. The total density ρ as well as the equations of\nmotion for the fields in the standard cosmology case are\ndeduced in [9]:\nρ=\n\n√\n1 2 1 2 λ√κφ\nφ̇ + ψ̇ e\n+ Vφ + Vψ eλ κφ .\n2\n2\n\n(7)\n\n√\n1\nV0 eλ κφ − V0 ,\n2\n\n(8)\n\nIn our case,\nVφ =\n\nVψ =\n\n1\nV0 κψ02 ψ 2\n2\n\nwhich in the slow-roll approximation can be written as\n\u0010\n\n√ \u0011\n\u0010\nVφ + Vψ eλ κφ\n√ \u0011\nκ\n (9)\nVφ + Vψ eλ κφ 1 +\nH2 ≃\n3\nρ0\n\n\f3\nThe equations of motion for both fields are given considering only the presence of both scalar fields with no\nradiation fluid, they are [9]\n\u0013\n\u0012\n√ λ√κφ 1 2\n∂Vφ\nψ̇ − Vψ\n= λ κe\nφ̈ + 3H φ̇ +\n∂φ\n2\n√\n∂Vψ\n(10)\nψ̈ + 3H ψ̇ +\n= −λ κφ̇ψ̇.\n∂ψ\nWhich in the slow-roll approximation are\n√\n√\n∂Vφ\n≃ −λ κeλ κφ Vψ\n∂φ\n∂Vψ\n3H ψ̇ +\n≃ 0.\n∂ψ\n\nThe expressions for the potential slow-roll parameters\nfor the RS-II cosmology having the inflaton field confined\nto the brane were deduced by Maartens et al. [10]. For\nthe high-energy limit they are:\n\u0012 \u00132\n\u0012\n\u0013\n1 V′\nρ0\n1 V ′′ ρ0\nǫ≃\n;\nη≃\n(13)\nκ V\nV\nκ V\nV\nwhere primes indicate derivatives with respect to the φ\nfield. The slow-roll approximation is satisfied as long as\nthe slow-roll parameters defined previously accomplish\nthe following conditions :\n\n3H φ̇ +\n\nǫ ≪ 1,\n(11)\n\nsince the right-hand side of the second equation in (10)\ncan be taken as a kinetic term to the square.\nThere is an important consequence in the fact that we\nare considering the ψ field in the value corresponding\nto the minimum of its potential at ψ = 0. This leads\nto a system of equations that do not have source terms\nand couplings of the fields and we end up with the same\nsystem as for the usual RS-II modification. Otherwise,\nin order to do a proper inflationary analysis, we would\nhave to define new expressions for the potential slow-roll\nparameters considering not only the modification due to\nthe RS-II term, but also to the couplings between the\nψ-potential and the φ in the Friedmann equation (9) and\nthe source term in the first of equations (11).\nThis procedure simplifies considerably the equations\nbut avoids having a realistic analysis of the evolution of\nboth fields including source terms and couplings, something that clearly must have an impact on the conditions\nto have inflation. Although a full analysis is undoubtedly\nrequired, we address the problem with these simplifications as a first insight before more general assumptions\nare considered.\n\nIII.\n\nINFLATIONARY PHENOMENOLOGY OF\nTHE MODEL\n\nThe analysis that follows will be confined to the highenergy limit of this model, which simplifies calculations\nfurther. Consenquently, we have the following system\nof equations within the slow-roll approximation and the\nhigh-energy limit:\nr\nκ\nH≃\nV;\n3ρ0\n∂Vφ\n3H φ̇ +\n≃0\n(12)\n∂φ\nwhich can be solved analitically. In this work we take\nthe convention φ̇ < 0, hence the φ field is a decreasing\nfunction of time. The solutions of the field equations will\nbe given in section III F.\n\n|η| ≪ 1.\n\n(14)\n\nThe number of e-foldings of inflation in terms of the potential for this model is given in our notation by [10]:\nZ\nκ φe V 2\ndφ,\n(15)\nN ≃−\nρ0 φ N V ′\nwhere φN represents the value of φ N e-foldings of expansion before the end of inflation and φe is the value of\nthe field at the end of inflation.\nFor the potential (5) we have\n√\nκφ\n\nǫ=\n\nλ2 ρ0\ne2λ\n\u0010 √\n4V0 eλ κφ\n2\n\n−1\n\n√\nκφ\n\neλ\nλ2 ρ0\nη=\n\u0010 √\n2V0 eλ κφ\n2\n\nN≃\n\n\u00113\n\n−1\n\n\u00112\n\n(16)\n\n(17)\n\n\u0014\n\u0011\n√\n1 \u0010 λ√κφe\n2V0\nλ κφN\ne\n−\n−\ne\nλ2 ρ0\n4\ni\n\u0011\n\u0010\n√\n√\n√\n−λ κφe\n− e−λ κφN + λ κ(φe − φN ) . (18)\n+ e\n\nThe only way by which inflation can be ended in our\nmodel is by violation of the slow-roll approximation with\nǫ exceeding unity.\nThe value of φ at which ǫ becomes equal to unity is\n\u001a\u0014 2 \u0015 \u0014 1/3 1/3\n√\n1\n4 B\n2λ ρ0\nκφe = ln\nλ\n3V0\n2λ2 ρ0\n\u0015\u001b\n2\n2/3\n(3V0 + λ2 ρ0 )\n(6V0 + λ ρ0 )4\n+\n+\n(19)\nλ2 ρ0\n2B 1/3\nwith\n\u0002\nB = λ2 ρ0 27V02 + 18V0 λ2 ρ0 + 2λ4 ρ20\ni\np\n+(3V0 )3/2 4λ2 ρ0 + 27V0 .\n\n(20)\n\nWe can rearrange the previous expression so that\n\u001a\u0014 2 \u0015 \u0014\n√\n3V0\n22/3 B 1/3\n2λ ρ0\n1\n1+ 2 +\nκφe = ln\nλ\n3V0\nλ ρ0\n2λ2 ρ0\n\u0015\u001b\n(6V0 + λ2 ρ0 )21/3\n(21)\n+\nB 1/3\n\n\f4\nSo we have that if\nB 1/3\n21/3 (6V0 + λ2 ρ0 )\n3V0\n+\n+\n≪ 1,\nλ2 ρ0\n21/3 λ2 ρ0\nB 1/3\n\n(22)\n\nthe φ field dominates the potential Eq. (5) and we will\nhave an exponential potential, which in the standard cosmology case corresponds to power-law inflation, but not\nfor the RS-II modification.\nThe bound found before depends on the choice of values for λ and V0 . As we shall see in section III B, λ is\nfixed once the value of the brane tension is given. So actually Eq. (22) depends only on the choice of V0 . We use\nthe computing packages Mathematica and Maple to find\nnumerically the values of V0 ensuring the l.h.s. is real.\nThis happens if:\n4 2\nλ ρ0\n27\n1\nV0 ≤ − λ2 ρ0\n6\n\nλ2 ρ0 < 0, =⇒\n\nV0 ≥\n\nλ2 ρ0 > 0, =⇒\n\n(23)\n(24)\n\nAlthough both intervales guarantee a real value in the\nroots of condition (22), this is not equivalent to have this\ncondition satisfied in order to have a field dominated region as we shall see later. From these expressions, the\nsecond case satisfies having a brane tension with no incompatibilities with nucleosynthesis [5],[13], and we will\nrestrict further calculations to this posibility only.\n\nA.\n\nDensity perturbations\n\nThe field responsible for inflation produces perturbations which can be of three types: scalar, vector and tensor. Vector perturbations decay in an expanding universe\nand tensor perturbations do not lead to gravitational instabilities producing structure formation. The adiabatic\nscalar or density perturbations can produce these type of\ninstabilities through the vacuum fluctuations of the field\ndriving the inflationary expansion. So they are usually\nthought to be the seeds of the large scale structures of\nthe universe [14]. One of the quantities that determines\nthe spectrum of the density perturbations is δH which\ngives the density contrast at horizon crossing (if evaluated at that scale). For the RS-II modification and in\nour notation, this quantity is [5],[11]\nδ(k)2H ≃\n\n3\n\n3\n\n3\n\nκ V V\n.\n75π 2 V ′2 ρ30\n\n(25)\n\nEvaluated at the scale k = aH. The slow-roll approximation guarantees that δH is nearly independent of\nscale when scales of cosmological interest are crossing the\nhorizon, satisfying the new COBE constrain updated to\nWMAP3 [16] as δH = 1.9 × 10−5 [15]. Here we take 60\ne-foldings before the end of inflation to find the scales of\ncosmological interest.\n\nWe use equation (18),provided we know the value of\nφe given by equation (19), to find the value φN corresponding to N = 60, that is 60 e-foldings before the end\nof inflation and evaluate δH as\n!6\n√\n4κ2 V04 −2λ√κφ60 eλ κφ60\n2\nδH ≃\ne\n−1\n(26)\n75π 2 λ2 ρ30\n2\nThe results are given in table II of section IV\nB.\n\nField-dominated region\n\nConsidering the case when the ψ field plays no role\nand φ governs the dynamics of the expansion alone,\nfrom Eq. (5), we have a potential of exponential type\nresembling that of power-law inflation in the standard\ncosmology[12]. The first term of Eq. (5) dominates giving an exponential expansion but not to power-law because the dynamics of RS-II changes this condition. The\nslow-roll parameters are given by:\nǫ=η≃\n\n2ρ0 λ2\n√\n.\nV0 eλ κφ\n\n(27)\n\nIn contrast with the standard cosmology where they are\nnot only the same but constant. The fact that the dynamics is modified due to the Randall-Sundrum cosmology, allows the existence of a value of φ that finishes\ninflation, since as we just saw, the parameters show a\ndependence on φ and therefore, an evolution.\nWe have that in this regime, the value of φe corresponding to the end of inflation is given by ǫ ≃ 1. The ≃\nis used because we are in the potential slow-roll approximation not the Hubble one [6].\n√\n1\nκφe ≃ ln\nλ\n\n\u0012\n\n2λ2 ρ0\nV0\n\n\u0013\n\n(28)\n\nInserting this value in the expression for the number of\ne-foldings (15) for this regime and evaluating, we obtain\nthat φN with N = 60 is\n\u0013\n\u0012\n√\n1\nλ2 ρ0\nκφ60 ≃ ln 122\n,\n(29)\nλ\nV0\nand we can evaluate the density contrast Eq (25):\n2\nδH\n≃\n\n614 κ2 λ6 ρ0\n.\n75π 2\n\n(30)\n\nOne can obseve from this equation that given the value\nof δH from observations, it is possible to completely constrain λ as\nλ6 ≃\n\n2\n75π 2 δH\n614 κ2 ρ0\n\n(31)\n\nWe have a dimensionles number that fixes one of the parameters of the potential and can be contrasted with the\n\n\f5\nvalue predicted by this supergravity model when interpreted as Dark Matter [2].\nIf we substitute the last equation into Eq. (22), we get\nin principle a set of values for the constant V0 that satisfy\nthe field domination condition.\nC.\n\nVacuum energy-dominated regime\n\nWe consider now the regime in which the second term\nof Eq. (5) dominates the dynamics. In this case the slow\n-roll parameters Eqns. (13) are:\n√\n\nǫ≃−\n\nλ2 ρ0 e2λ\n4V0\n\nκφ\n\nfrom the first of equations (32) a value of φ corresponding\nto this;\n\u0013\n\u0012\n√\n1\n4V0\nκφe =\n.\n(35)\nln\nǫ = −1 ⇒\n2λ\nλ2 ρ0\nWhere this time, the subscript \"e\", indicates the end of\ndeflation. This value, as we can see, depends on V0 and\nλ.\nThe choice of V0 parameter will be given in section IV\nwhere we give different values acording to the conditions\nwe find in the following. We shall see whether or not an\ninflationary stage takes place under the value of λ found\nin the previous analysis.\n\n(32)\nD.\n\n√\nλ κφ\n\nη≃\n\nλ2 ρ0 e\n2V0\n\n.\n\n(33)\n\nWe find ourselves here with the fact that ǫ is negative,\nthat is, with a period of deflation [17]. Such behviour has\nalready been predicted for these models before [1].\nIt is necessary to point out that this is a consequence\nof the modification of the dynamics. The definition of ǫ\nfor the Randall–Sundrum II cosmology in the high-energy\nlimit is not positive definite as in the standard cosmology\ncase. Thus a stage of accelerated contraction for this\nregime on the potential is only a result of the modification\nin the field equations.\nFollowing the evolution of the dynamics with the potential Eq. (5), from a region where φ dominates, to a\nstage in which the energy V0 drives the behaviour of the\nexpansion, we observe a primordial inflationary expansion that erases all information concerning any process\nthat the ψ field might have undergone under the influence of the potential Eq. (4). The intermediate regime,\nin which both terms in Eq. (5) are of the same order,\nproduces further expansion. Finally the field φ reaches\na value on the potential that comences a stage of accelerated contraction. This value is obtained when the\ndenominator in Eq. (16) changes sign:\n√\n\nln 2\nκφd =\n,\nλ\n\n(34)\n\ncorresponding to the value of the vacuum-dominated\nregime. Such√process takes place when the field φ takes\nvalues below κφd . Eq. (34) is equivalent to V (φd ) = 0.\nThus the balance of the terms in Eq. (5) and the sign\nof V0 determine the place where deflation starts as the\npoint where the potential crosses the φ axis.\nIn principle, there would not be a physical reason that\ncould prevent this deflationary stage to stop. But the argument mentioned before, concerning the modification of\nthe dynamics applies again . We observe ǫ has a dependence on the field and therefore undergoes an evolution\naccordingly. The condition to end deflation is ǫ = −1, in\noposition to inflation. In consequence, we can also find\n\nIntermediate Regime\n\nThe intermediate regime corresponds to the region\nwhere both terms in Eq (5) are of the same order. In\norder to obtain a bound on the values of V0 that satisfy the COBE constrain (26), we need to solve numerically Eqs. (18) and (19).Since we have that both terms\nin Eq. (5) are important, this means that the exponential is √\nof O(1), thus√we can expand it in Taylor series as\nexp(λ κφ) ≃ 1 + λ κφ and arrive to a value of φe equal\nto\n\u0013\n\u0012\nλ2 ρ0 λρ0 42/3\n(4B)1/3\n+ 2+\nφe =\n3λV0\n3V0\nκB 1/3\n1\n2λρ0\n+ √\n(36)\n+ √\n3 κV0\nλ κ\nwhere B now is given by\nB=\n\nλ2 ρ0\n18λ2 ρ0 V0 + 27V02 + 2λ4 ρ20\nκ3/2\n\u0011\np\n+ (3V0 )3 (4λ2 ρ0 + 27V0 )\n\n(37)\n\nIn order to have a real scalar field, we find two bounds\nfor the values that V0 can take on following from the roots\nin the previous expressions:\n1\nV0 < − λ2 ρ0 ,\n6\n\nV0 > −\n\n4 2\nλ ρ0\n27\n\nV0 > 0. (38)\n\nThe first bound coincides with the value given by Eq (24)\nneeded to have real values in condition (22). It is an upper bound for the allowed values of V0 in expression (19).\nOn the other hand, we have from Eqns. (19) and (20) that\npositive values of V0 also satisfy that there exists a real\nvalue of φe in the intermediate regime. But V0 cannot be\n0 otherwise many of the equations we have been looking\nat would be undefined. So we have an interval of allowed\nvalues of V0 as:\n1\nV0 < − λ2 ρ0 ,\n6\n\nV0 > 0.\n\n(39)\n\nIf V0 > 0, Eq. (32) is negative and we have the period of\ndeflation mentioned before. But V0 < −1/6λ2ρ0 means\n\n\f6\nthat even in the region of vacuum domination ǫ can be\npositive and we return to the usual picture of inflation.\nHowever, having chosen a value of V0 below this bound,\nEqns. (16) and (27) become negative, thus giving a period\nof deflation translated to the epochs of field domination\nand the intermediate regime.\nWe can then choose values for V0 below −1/6λ2 ρ0 being in a period of deflation for the first two regimes ending with a stage of inflation for the V0 dominated region.\nEqns. (20) and (19) still have real values because the approximation made in this section to find the upper limits\nof V0 , is a lower bound on Eqns. (19) and (20). This is in\nfact redundant since we have also said that both terms in\nthe potential (5) are of the same order, so the expansion\nis valid for the general case.\nOnce the choice of V0 is done, we can solve numerically\nto find a value for φN in Eq. (18), then it is introduced\ninto Eq. (25) and can be accepted or rejected depending\non whether or not it fullfils the left-hand side. This value\ndepends on ρ0 , the brane tension, and we present the results for different values of it considering that in order to\nhave no incompatibilities with nucleosynthesis the brane\ntension must satisfy ρ0 ≥ 2MeV4 [5], the authors take the\nnumber 1MeV4 , the difference arises due to the change\nof notation. We also check that the choice on ρ0 satisfies\nthe COBE constrain.\nThe results are shown in table II.\nE.\n\nVacuum-dominated region revisited\n\nFollowing the argument in the preceeding paragraph,\nit would be possible to continue with the usual analysis to\nfind the value of φ that finishes inflation, in the vacuumdominated region provided V0 is negative and calculate\nthe number of e-foldings and the use Eq. (25) in the region of vacuum domination to find a constrain on V0 . We\nfind from equation (32) that\n\u0013\n\u0012\n√\n1\n4V0\nκφe =\n,\n(40)\nln − 2\n2λ\nλ ρ0\nand from Eq (15) that\n#\n\"\u0012\n\u00131/2\n√\n1\nλ2 ρ0\n30λ2 ρ0\nκφ60 ≃ − ln −\n.\n−\nλ\n4V0\n2V0\n\n(41)\n\nAnd finally from (25):\n3/2\n\n(−V0 )\n\n−\n\n1/2\n60λρ0 V0\n\n√\n75πδH ρ0\n=\nκ\n\n(42)\n\nThis equation can be solved numerically to give a value\nof V0 that is in accordance with the COBE constrain for\nthe perturbations. As we shall see later, this process will\nnot be applied to the case of vacuum domination, since\nwe find ǫ to be a decreasing function of time, therefore\nfor this case inflation never ends. Therefore it is not\npossible to find a value of the parameter V0 satisfying\n\nthis condition in the case of vacuum domination hence\nthe values of V0 coresponding to this regime are ruled out\nby observations. So in fact, the value of ǫ corresponding\nto 1 indicates in this case the place where inflation starts\nto take place as from there onwards we will have that\nǫ<1\n\nF.\n\nField Equations\n\nIn this subsection we solve the system of field equations. The numeric results are presented in the next section. Integrating Eqns.(12) for the potential (5) yields:\n\"\n#\nV0\n4\n2\n−2\np\na(t) = a0 exp −\n(λ κρ0 t + 24e )\n(43)\nλ4 t 3κρ30\nand\n\n√\n2\n1\nκφ(t) = − + ln\nλ λ\n\n\u0012\n\n48\nλ4 κρ0 t2\n\n\u0013\n\n.\n\n(44)\n\nOne can immediately see that the behaviour of the field\ndoes not depend on the value of the parameter V0 , but\nonly on λ whose value is given by Eq. (31). From this\nsolution and its plot, one can check that indeed the field is\na decreasing function of time, having the same bahaviour\nregardless of the regime it is in. The scale factor shows\nlittle dependance on the value of V0 as shown in the plots.\nFollowing an increasing behaviour for V0 > 0. Figures\n3, 4, 5 show that for V0 > 0, ǫ is a growing positive\nfunction which corresponds to an inflationary stage as\nexpected from the analysis of the previous sections. The\nacceleration factor is also shown, and one can observe\nthat for the range used in the plots ä/a changes sign\nbefore ǫ reaches 1 in the same interval.\nWe have plotted for completeness the scale and acceleration factors as well as ǫ in Fig.6 for a negative value\nof V0 . The scale and acceleration factors change the sign\nof their slope at λ2 (κρ0 )1/2 t = 1.8 which is the same\nvalue as that from Eq. (34) indicating the start of the\nvacuum-dominated regime. So one ends with a stage of\ninflation after deflation in the other two regimes. We find\nthat ǫ is a positive decreasing function of time according\nwith what was found. This means that although there\nis a period of inflation, after deflation, it will never end\nand there is no meaning in calculating the value of the\npotential from Eq. (42) satisfying the COBE constrain\nsince there is no value of the field corresponding to 60\ne-folds before the end of inflation. The case of vacuum\ndomination with a negative potential is not realistic for\nthis model with our approximations.\nThe bounds that the field needs to meet in order to\nhave inflation for the intermediate regime are presented\nin table III. The value of the parameter V0 in the region\nof vacuum domination remains unsconstrained, therefore\nit is not possible to give a bound on the value of the field\nfor the beginning of inflation.\n\n\f7\n\n12\n10\n8\n0.02\n\n0.04 0.06\nλ2 (κρ0 )1/2t\n\n0.08\n\n0.1\n\nFIG. 2: The behaviour for the scalar field during inflation.\n\nIV.\n\nRESULTS\n\nBefore starting with the numeric results for the three\nregions just analized, we summarize what we have found\nso far. They are shown schematically in table I.\nDespite the fact that V0 > 0 gives a positive value for\n\n0.4\n0.2\n0\n\nTable II shows 3 values of the potential that are in good\nagreement with the value of the density contrast δH . The\nnumbers that appear in the third column conrrespond to\n1/100λ2ρ0 , 1/120λ2 ρ0 and 1/150λ2ρ0 respectively. Bigger values in the denominators seem to lead the decimals\nin the density contrast closer to 1.9 × 10−5. We keep only\nthese level of accuracy as a good approximation to the\nideal value of the potential [15].\n\nV0=1/100λ2ρ0\n\n..\na(t)/a0(λ4κρ0)-1\n\na(t)/a0\n\nV0=1/100λ2ρ0\n\nWe solved numerically the corresponding equations in\nthe intermediate regime and found the values shown in\ntable II. For this, we have taken that κ ≃ 25/m2P l [5].\n\nV0=1/100λ2ρ0\n\n5000\n\n∈(t)\n\nλκ1/2φ\n\n14\n\nEq. (27), it does not correspond to the region of field\ndomination. So one has to employ the value of V0 > 0\nin Eqns. (16) and (19) not in (28). That is, in the intermediate regime. We have checked that V0 > 0 does not\nmeet the condition (22) even for very small values of V0\ncompared to unity. Instead, the smaller this parameter\nis, the closer to 2 is Eq. (22). So we are left with only\ntwo regions where we have inflation. The intermediate\nregime for V0 > 0, and the region of vacuum domination\nfor V0 < −1/6λ2 ρ20 .\n\n3000\n1000\n-1000\n\n0.01 0.02 0.03\nλ2 (κρ0 )1/2t\n\n0.01 0.02\nλ2 (κρ0 )1/2t\n\n0.035\n\n1\n0.8\n0.6\n0.4\n0.2\n0.006\n0.02\n0.035\nλ2 (κρ0 )1/2t\n\nFIG. 3: On the left hand side the scale factor shows an inflationary behaviour but the acceleration factor, on the center, grows\nand decreases in the same interval. On the right hand side we plot the inflationary parameter ǫ.\n\nV.\n\nCONCLUSIONS\n\nIn this work we have seen the conditions that the parameters of potential (5) have to fulfill in order to have\n\nearly universe inflation, using the same scalar field potential as in [2] in order to have a unified picture between\n\n\f8\n\n0.2\n0\n\nV0=1/120λ2ρ0\n\n7000\n\n∈(t)\n\na(t)/a0\n\n0.4\n\nV0=1/120λ2ρ0\n\n..\na(t)/a0(λ4κρ0)-1\n\nV0=1/120λ2ρ0\n0.6\n\n3000\n-1000\n\n0.01 0.02 0.03\nλ2 (κρ0 )1/2t\n\n0.01 0.02\nλ2 (κρ0 )1/2t\n\n1\n0.8\n0.6\n0.4\n0.2\n\n0.035\n\n0.006\n0.02\nλ2 (κρ0 )1/2t\n\n0.03\n\nFIG. 4: In this case the scale factor (lhs) increases more rapidly than the previous case and the acceleration factor (center)\nreaches higher numbers within the same interval. On the rhs, again we plot the ǫ parameter.\n\nV0=1/150λ2ρ0\n\na(t)/a0\n\n0.6\n0.4\n0.2\n0\n0.01 0.02 0.03\nλ2 (κρ0 )1/2t\n\n11000\n7000\n3000\n-1000\n\nV0=1/150λ2ρ0\n\n∈(t)\n\n..\na(t)/a0(λ4κρ0)-1\n\nV0=1/150λ2ρ0\n\n0.01\n\n0.02\nλ2 (κρ0 )1/2t\n\n0.035\n\n1\n0.8\n0.6\n0.4\n0.2\n0.006 0.015\n\n0.025\n\nλ2 (κρ0 )1/2t\n\nFIG. 5: Again in this case the scale factor (lhs) increases more rapidly than in the first case and the acceleration factor (center)\nreaches much higher numbers within the same interval. On the rhs, again we plot the ǫ parameter.\n\n\f9\n\nTABLE I: Results for the sign of the first slow-roll parameter ǫ according to the choice of V0 for the three different regions of\npotential (5).\nRegion\nV0 > 0\nφ-dominated\nǫ > 0, φe real\nIntermediate\nǫ > 0, φe real\nVacuum-dominated\nǫ<0\n\ndynamics V0 < − 61 λ2 ρ0\ninflation\nǫ<0\ninflation\nǫ<0\ndeflation ǫ > 0, φe real\n\ndynamics\ndeflation\ndeflation\ninflation\n\nTABLE II: Results for V0 in the intermediate regime, for three different values of ρ0 .\n`\n ́\nρ0 × 106 , (eV4 ) λ × 1014 V0 × 1034 , eV4 φe × 1013 , (eV) φ60 × 1013 , (eV) δH , ×10−5\n1.4\n1.5\n2.7\n1.9\n2\n8.2\n1.1\n1.6\n2.8\n1.9\n0.9\n1.6\n2.8\n1.9\n2.2\n1.7\n3.1\n1.9\n4\n7.4\n1.8\n1.8\n3.1\n1.9\n1.4\n1.9\n3.2\n1.9\n2.8\n1.9\n3.3\n1.9\n6\n6.9\n2.4\n1.9\n3.3\n1.9\n1.9\n1.9\n3.4\n1.9\n\nTABLE III: Bounds for the scalar field φ multiplied by the Planck mass, for V0 positive in eV units.\n`\n ́\nρ0 × 106 , (eV4 ) λ × 1014 V0 , eV4 φ > ×10−15 × mP l , (eV)\n1\n1.3\nλ2 ρ 0\n100\n2\n1\n2\n8.2\nλ\nρ\n1.3\n0\n120\n2\n1\nλ\nρ\n1.4\n0\n150\n2\n1\nλ\nρ\n1.4\n0\n100\n2\n1\n4\n7.4\n1.5\nλ ρ0\n120\n2\n1\nλ\nρ\n1.5\n0\n150\n2\n1\nλ\nρ\n1.5\n0\n100\n2\n1\n6\n6.9\n1.6\nλ\nρ\n0\n120\n2\n1\nλ ρ0\n1.7\n150\n\n1.2\n\n145\n135\n125\n\n1\n\n155\n\n0.8\n\n145\n\n∈(t)\n\n..\n4\n-1\nln(a(t)/a0)(λ κρ0)\n\nln(a(t)/a0)\n\n155\n\n135\n\n0.6\n0.4\n0.2\n\n125\n\n0\n1 1.5 2 2.5 3 3.5 4\nλ2 (κρ0 )1/2t\n\n1 1.5 2 2.5 3 3.5 4\nλ2 (κρ0 )1/2t\n\n0.5 1 1.5 2 2.5 3 3.5 4\nλ2 (κρ0 )1/2t\n\nFIG. 6: The plot of the scale factor, the acceleration factor and ǫ for V0 negative, here we use V0 = −56λ2 ρ0\n\n\f10\ninflation and structure formation. We find that the value\nof the parameter λ can be fixed in the region of field domination and that there can be two possibilities for the sign\nof the parameter V0 . Each of them determine different\ndynamics in the evolution of the field equations. A positive sign leads to a period of inflation followed by one of\ndeflation, whereas the opposite sign implies the contrary.\nIn the first case, the values of V0 we have found as viable\nto meet the COBE constrain, are not in agreement with\nthose found in [2] by several orders of magnitude. This\nbehaviour seems to be generic in superstrings theory, implying that if we would like to relate the moduli fields\nwith the inflaton, dark energy or dark matter, the model\ncould fit observations either during the inflationary epoch\nor during the structure formation, but the challenge is to\nderive a model which fit our observing universe during\nthe whole history of the universe. Otherwise, superstring\ntheory have to give alternative candidates for these fields\nand explain why we do not see the moduli fields in our\nobservations. Two important points to notice are that\nthe analysis employed in this work has been made with\nthe assumption that the field ψ or axion does not play\na significant role in the dynamics and the slow-roll approximation has simplified the equations further. This\nbehaviour is observed in the analysis carry out in [2],\nwhere it is shown that the axion field could remain as\n\na subdominant field. Nevertheless, even when this behaviour remains so until redshifts beyond 106 , the axion\ncould have a different behaviour beyond this redshifts.\nThis is indeed a very strong assumption which is not\nwell justified completely, but our work is a first approximation to solve the problem and we are aware that a\nmore general analysis including the axion field needs to\nbe done.\nThe second case corresponding to vacuum domination\nhas proved unrealistic to have a viable model of inflation\nsince this process does not end and we do not have other\nmechanism to finish it as in the usual hybrid inflation\nscenario. It would follow from this that a more general\nanalysis is needed in order to determine whether the consequences of our assumptions are important or not.\n\n[1] A.R. Frey, A. Mazumdar, \"Three Form Induced Potentials, Dilaton Stabilization, and Running Moduli\". Phys.\nRev. D 67:046006,2003 e-Print Archive: hep-th/0210254\n[2] T. Matos, J.-R. Luévano, H. Garcı́a-Compeán, A.\nVázquez. e-print arXiv:hep-th/0511098.\n[3] A. Linde, Phys. Rev. D 62, 103511, (1993). e-print\narXiv:astro-ph 9307002.\n[4] E. J. Copeland, A. R. Liddle, D. H. Lyth, E. D. Stewart,\nD. Wands, Phys. Rev. D 49, 12, 6410 (1994). e-print\narXiv:astro-ph:9401011.\n[5] L. E. Mendes, A. R. Liddle, Phys. Rev. D 62, 103511-1\n(2000).e-print arXiv:astro-ph/0006020.\n[6] A. R. Liddle, P. Parsons, J. D. Barrow, Phys. Rev. D50,\n7222 (1994) e-print arXiv:astro-ph/9408015.\n[7] L. Randall, R. Sundrum, Phys. Rev. Lett. 83, 3370\n(1999).\n[8] L. Randall, R. Sundrum, Phys. Rev. Lett. 83, 4690\n(1999).\n\n[9] T. Matos, J.-R. Luévano, L. A. Ureña-López, \"Dynamics\nof a scalar field dark matter with a cosh potential\" in\nprogress.\n[10] R. Maartens, D. Wands, B. A. Bassett, I. P. C. Heard.,\nPhys. Rev. D 62, 041301 (2000). e-print arXiv:astro-ph\n[11] A. R. Liddle, D. H. Lyth, Phys. Rep. 231,1 (1993).\n[12] F. Lucchin, S. Matarrese, Phys. Rev. D 32, 1316 (1985).\n[13] J. M. Cline, C. Grojean, G. Servant, Phys. Rev. Lett. 83,\n4245 (1999).\n[14] V. F. Mukhanov, H. A Feldman, R. H. Brandenberger,\nPhys. Rep. 215, 5 & 6, 203-233 (1992).\n[15] A. R. Liddle, D. Parkinson, S. Leach, P. Mukherjee, Phys. Rev. D 74, 083512 (2006), e-print\narXiv:astro-ph/0607275.\n[16] D. N. Spergel et al., arXiv:astro-ph/0603449, ApJ in\npress (2007).\n[17] B. Spokoiny, Phys. Lett.B315, 40-45, (1993).\n\nVI.\n\nACKNOWLEDMENTS\n\nWe are very thankful to Andrew Liddle and Anupam\nMazumdar for helpful comments and revision of the paper. Many thanks to Abdel Pérez-Lorenzana and Jorge\nLuis Cervantes-Cota for discussions. ER was supported\nby conacyt postdoctoral grant 54865.\n\n\f"}