{"id": "http://arxiv.org/abs/1103.1194v1", "guidislink": true, "updated": "2011-03-07T05:09:16Z", "updated_parsed": [2011, 3, 7, 5, 9, 16, 0, 66, 0], "published": "2011-03-07T05:09:16Z", "published_parsed": [2011, 3, 7, 5, 9, 16, 0, 66, 0], "title": "Magnetic Susceptibility of the Quark Condensate and Polarization from\n  Chiral Models", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1103.0565%2C1103.3577%2C1103.2826%2C1103.6094%2C1103.6083%2C1103.0648%2C1103.4593%2C1103.2269%2C1103.3531%2C1103.4496%2C1103.1293%2C1103.6084%2C1103.1857%2C1103.5574%2C1103.1194%2C1103.0116%2C1103.5895%2C1103.6233%2C1103.4454%2C1103.4817%2C1103.5430%2C1103.3783%2C1103.3142%2C1103.2317%2C1103.4577%2C1103.2944%2C1103.3543%2C1103.2642%2C1103.4226%2C1103.2259%2C1103.6013%2C1103.3347%2C1103.2941%2C1103.2418%2C1103.0421%2C1103.0551%2C1103.5735%2C1103.1154%2C1103.4867%2C1103.4021%2C1103.1850%2C1103.3095%2C1103.3623%2C1103.4490%2C1103.1688%2C1103.4020%2C1103.1204%2C1103.5902%2C1103.2016%2C1103.4585%2C1103.2492%2C1103.0385%2C1103.2823%2C1103.1677%2C1103.4580%2C1103.0613%2C1103.0814%2C1103.1953%2C1103.3925%2C1103.2979%2C1103.4368%2C1103.5698%2C1103.4786%2C1103.0698%2C1103.6019%2C1103.3221%2C1103.1767%2C1103.2801%2C1103.3905%2C1103.6242%2C1103.3558%2C1103.6039%2C1103.3960%2C1103.4938%2C1103.1115%2C1103.5302%2C1103.6036%2C1103.5055%2C1103.3684%2C1103.5081%2C1103.4305%2C1103.2585%2C1103.1421%2C1103.1546%2C1103.1835%2C1103.0798%2C1103.5981%2C1103.4756%2C1103.6061%2C1103.1242%2C1103.3913%2C1103.0726%2C1103.1313%2C1103.3416%2C1103.0586%2C1103.0460%2C1103.3390%2C1103.3922%2C1103.2838%2C1103.3985%2C1103.3126&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Magnetic Susceptibility of the Quark Condensate and Polarization from\n  Chiral Models"}, "summary": "We compute the magnetic susceptibility of the quark condensate and the\npolarization of quarks at zero temperature and in a uniform magnetic\nbackground. Our theoretical framework consists of two chiral models that allow\nto treat self-consistently the spontaneous breaking of chiral symmetry: the\nlinear $\\sigma-$model coupled to quarks, dubbed quark-meson model, and the\nNambu-Jona-Lasinio model. We also perform analytic estimates of the same\nquantities within the renormalized quark-meson model, both in the regimes of\nweak and strong fields. Our numerical results are in agreement with the recent\nliterature; moreover, we confirm previous Lattice findings, related to the\nsaturation of the polarization at large fields.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1103.0565%2C1103.3577%2C1103.2826%2C1103.6094%2C1103.6083%2C1103.0648%2C1103.4593%2C1103.2269%2C1103.3531%2C1103.4496%2C1103.1293%2C1103.6084%2C1103.1857%2C1103.5574%2C1103.1194%2C1103.0116%2C1103.5895%2C1103.6233%2C1103.4454%2C1103.4817%2C1103.5430%2C1103.3783%2C1103.3142%2C1103.2317%2C1103.4577%2C1103.2944%2C1103.3543%2C1103.2642%2C1103.4226%2C1103.2259%2C1103.6013%2C1103.3347%2C1103.2941%2C1103.2418%2C1103.0421%2C1103.0551%2C1103.5735%2C1103.1154%2C1103.4867%2C1103.4021%2C1103.1850%2C1103.3095%2C1103.3623%2C1103.4490%2C1103.1688%2C1103.4020%2C1103.1204%2C1103.5902%2C1103.2016%2C1103.4585%2C1103.2492%2C1103.0385%2C1103.2823%2C1103.1677%2C1103.4580%2C1103.0613%2C1103.0814%2C1103.1953%2C1103.3925%2C1103.2979%2C1103.4368%2C1103.5698%2C1103.4786%2C1103.0698%2C1103.6019%2C1103.3221%2C1103.1767%2C1103.2801%2C1103.3905%2C1103.6242%2C1103.3558%2C1103.6039%2C1103.3960%2C1103.4938%2C1103.1115%2C1103.5302%2C1103.6036%2C1103.5055%2C1103.3684%2C1103.5081%2C1103.4305%2C1103.2585%2C1103.1421%2C1103.1546%2C1103.1835%2C1103.0798%2C1103.5981%2C1103.4756%2C1103.6061%2C1103.1242%2C1103.3913%2C1103.0726%2C1103.1313%2C1103.3416%2C1103.0586%2C1103.0460%2C1103.3390%2C1103.3922%2C1103.2838%2C1103.3985%2C1103.3126&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We compute the magnetic susceptibility of the quark condensate and the\npolarization of quarks at zero temperature and in a uniform magnetic\nbackground. Our theoretical framework consists of two chiral models that allow\nto treat self-consistently the spontaneous breaking of chiral symmetry: the\nlinear $\\sigma-$model coupled to quarks, dubbed quark-meson model, and the\nNambu-Jona-Lasinio model. We also perform analytic estimates of the same\nquantities within the renormalized quark-meson model, both in the regimes of\nweak and strong fields. Our numerical results are in agreement with the recent\nliterature; moreover, we confirm previous Lattice findings, related to the\nsaturation of the polarization at large fields."}, "authors": ["Marco Frasca", "Marco Ruggieri"], "author_detail": {"name": "Marco Ruggieri"}, "author": "Marco Ruggieri", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.83.094024", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1103.1194v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1103.1194v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "13 pages, 4 figures", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-lat", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1103.1194v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1103.1194v1", "journal_reference": "Phys.Rev.D83:094024,2011", "doi": "10.1103/PhysRevD.83.094024", "fulltext": "YITP-11-28\n\nMagnetic Susceptibility of the Quark Condensate and Polarization from Chiral Models\nMarco Frasca1, ∗ and Marco Ruggieri2, †\n1\nvia Erasmo Gattamelata, 3, 00176 Roma, Italy\nYukawa Institute for Theoretical Physics, Kyoto University,\nKitashirakawa Oiwake-cho, Sakyo-ku, Kyoto 606-8502, Japan\n2\n\narXiv:1103.1194v1 [hep-ph] 7 Mar 2011\n\nWe compute the magnetic susceptibility of the quark condensate and the polarization of quarks\nat zero temperature and in a uniform magnetic background. Our theoretical framework consists of\ntwo chiral models that allow to treat self-consistently the spontaneous breaking of chiral symmetry:\nthe linear σ−model coupled to quarks, dubbed quark-meson model, and the Nambu-Jona-Lasinio\nmodel. We also perform analytic estimates of the same quantities within the renormalized quarkmeson model, both in the regimes of weak and strong fields. Our numerical results are in agreement\nwith the recent literature; moreover, we confirm previous Lattice findings, related to the saturation\nof the polarization at large fields.\nPACS numbers: 12.38.Aw,12.38.Mh\nKeywords: Magnetic Susceptibility of the Quark Condensate, Effective Chiral Models, QCD in Strong Magnetic Background.\n\nI.\n\nINTRODUCTION\n\nOne of the most attractive aspects of the vacuum of\nQuantum Chromodynamics (QCD), the theory of strong\ninteractions, is its non-perturbative nature. Mainly by\nmeans of Lattice QCD simulations at zero quark chemical potential [1–5] it is established that two crossovers\ntake place in a narrow range of temperature; one for\nquark deconfinement, and another one for the (approximate) restoration of chiral symmetry. Besides, powerful analytic and semi-analytic techniques have been developed to understand the coupling between chiral symmetry restoration and deconfinement, see [6, 7] and references therein. Moreover, Lattice QCD and Operator\nProduct Expansion (OPE in the following) of the correlators of hadronic currents show that the QCD vacuum\ncan be characterized by several quark, gluon and mixed\ncondensates [8].\nA fruitful theoretical approach to the physics of strong\ninteractions, which is capable to capture some of the nonperturbative properties of the QCD vacuum, is the use\nof effective chiral models. One of them is the NambuJona-Lasinio (NJL) model [9] (see Refs. [10] for reviews),\nin which the QCD gluon-mediated interactions are replaced by effective interactions among quarks, which are\nbuilt in order to respect the global symmetries of QCD.\nUnder some approximations, it is possible to derive the\nNJL model effective interaction kernel from first principles QCD, see [11, 12]. Besides, a linear σ−model augmented with a Yukawa-type coupling to quarks, named\nQuark-Meson model (QM model in the following), has\nbeen developed as an effective model of QCD [13, 14]. In\nthis model, quartic meson self-couplings allow to absorb\nthe cutoff dependence of the coupling constants; moreover, following an idea by Weinberg [15], tree level prop-\n\n∗\n†\n\nmarcofrasca@mclink.it\nruggieri@yukawa.kyoto-u.ac.jp\n\nagating mesons are sufficient to avoid triviality of the\nNJL model in 3 + 1 dimensions in the one-loop approximation [16] (see [14] for an excellent discussion about\nthese points).\nThe chiral models are widely used to map qualitatively,\nand to some extent also quantitatively, the phase diagram\nof strongly interacting matter along several directions like\ntemperature, chemical potential, isospin chemical potential and external fields [17–30]. It is thus interesting to\nuse these models to compute other quantities, which are\nrelated to the QCD vacuum condensates. As a matter of\nfact, the chiral models allow for a self-consistent treatment of the spontaneous chiral symmetry breaking in\nthe vacuum. Therefore, after the ground state properties\n(i.e., the chiral condensate in the NJL model, or the expectation value of the σ-field in the quark-meson model)\nunder external factors are computed, it is straightforward\nto estimate numerical values of other condensates, using\nthe one-loop propagators of the theory.\nIt has been realized that external fields can induce\nQCD condensates that are absent otherwise [31]. Of\nparticular interest for this article is magnetic moment,\nhf ̄Σμν f i where f denotes the fermion field of the flavor\nf −th, and Σμν = −i(γ μ γ ν − γ ν γ μ )/2. At small fields\none can write, according to [31],\nhf ̄Σμν f i = χhf ̄f iQf |eB| ,\n\n(1)\n\nand χ is a constant independent on flavor, which is\ndubbed magnetic susceptibility of the quark condensate.\nIn [31] it is proved that the role of the condensate (1)\nto QCD sum rules in external fields is significant, and it\ncannot be ignored. The quantity χ has been computed\nby means of special sum rules [31–35], OPE combined\nwith Pion Dominance [36], holography [37, 38], instanton vacuum model [39], analytically from the zero mode\nof the Dirac operator in the background of a SU (2) instanton [40], and on the Lattice in two color quenched\nsimulations at zero and finite temperature [41]. It has\nalso been suggested that in the photoproduction of lep-\n\n\f2\nton pairs, the interference of the Drell-Yan amplitude\nwith the amplitude of a process where the photon couples\nto quarks through its chiral-odd distribution amplitude,\nwhich is normalized to the magnetic susceptibility of the\nQCD vacuum, is possible [42]. This interference allows\nin principle to access the chiral odd transversity parton\ndistribution in the proton. Therefore, this quantity is interesting both theoretically and phenomenologically. The\nseveral estimates, that we briefly review in Section III,\nlead to the numerical value of χ as follows:\nχhf ̄f i = 40 − 70 MeV .\n\n(2)\n\nA second quantity, which embeds non-linear effects at\nlarge fields, is the polarization, μf , defined as\nμf =\n\nΣf\n,\nhf ̄f i\n\nΣf = hf ̄Σ12 f i ,\n\n(3)\n\nwhich has been computed on the Lattice in [41] for a\nwide range of magnetic fields, in the framework of twocolor QCD with quenched fermions. At small fields\nμf = |χQf eB| naturally; at large fields, non-linear effects dominate and an interesting saturation of μf to the\nasymptotic value μ∞ = 1 is measured. According to [41]\nthe behavior of the polarization as a function of eB in\nthe whole range examined, can be described by a simple inverse tangent function. Besides, magnetization of\nthe QCD vacuum has been computed in the strong field\nlimit in [43] using perturbative QCD, where it is found\nit grows as B log B.\nIn this article, we compute the magnetic susceptibility of the quark condensate by means of the NJL and\nthe QM models. This study is interesting because in the\nchiral models, it is possible to compute self-consistently\nthe numerical values of the condensates as a function\nof eB, once the parameters are fixed to reproduce some\ncharacteristic of the QCD vacuum. We firstly perform a\nnumerical study of the problem, which is then complemented by some analytic estimate of the same quantity\nwithin the renormalized QM model. Moreover, we compute the polarization of quarks at small as well as large\nfields, both numerically and analytically. In agreement\nwith the Lattice results [41], we also measure a saturation of μf to one at large fields, in the case of the effective\nmodels. Our results push towards the interpretation of\nthe saturation as a non-artifact of the Lattice. On the\ncontrary, we can offer a simple physical understanding of\nthis behavior, in terms of lowest Landau level dominance\nof the chiral condensate. As a matter of fact, using the\nsimple equations of the models for the chiral condensate\nand for the magnetic moment, we can show that at large\nmagnetic field μf has to saturate to one, because in this\nlimit the higher Landau levels are expelled from the chiral condensate; as a consequence, the ratio of the two\napproaches one asymptotically.\nWe also obtain a saturation of the polarization within\nthe renormalized QM model. There are some differences, however, in comparison with the results of the nonrenormalized models. In the former case, the asymptotic\n\nvalue of μf is charge-dependent; moreover, the interpretation of the saturation as a lowest Landau level (LLL)\ndominance is not straightforward, because the renormalized contribution of the higher Landau levels is important\nin the chiral condensate, even in the limit of very strong\nfields. It is possible that the results obtained within the\nrenormalized model are a little bit far from true QCD.\nAs a matter of fact, in the renormalized model we assume that the quark self-energy is independent on momentum; thus, when we take the limit of infinite quark\nmomentum in the gap equation, and absorb the ultraviolet divergences by means of counterterms and renormalization conditions, we implicitly assume that that quark\nmass at large momenta is equal to its value at zero momentum. We know that this is not true, see for example [44, 45]: even in the renormalized theory, the quark\nself-energy naturally cuts off the large momenta, leading to LLL dominance in the traces of quark propagator\nwhich are relevant for our study. Nevertheless, it is worth\nto study this problem within the renormalized QM model\nin its simplest version, because it helps to understand the\nstructure of this theory under the influence of a strong\nmagnetic field.\n\nIn our calculations we neglect, for simplicity, the possible condensation of ρ−mesons at strong fields [46,\n47]. Vector meson dominance [46] and Sakai-Sugimoto\nmodel [48] suggest for the condensation a critical value\nof eBc ≈ m2ρ ≈ 0.57 GeV2 , where mρ is the ρ−meson\nmass in the vacuum. Beside these, a NJL-based calculation within the lowest Landau level (LLL) approximation [47] predicts ρ−meson condensation at strong fields\nas well, even if in the latter case it is hard to estimate\nexactly eBc , mainly because of the uncertainty of the\nparameters of the model. It would certainly be interesting to address this problem within our calculations, in\nwhich not only the LLL but also the higher Landau levels are considered, and in which the spontaneous breaking\nof chiral symmetry is kept into account self-consistently.\nHowever, this would complicate significantly the calculational setup. Therefore, for simplicity we leave this issue\nto a future project.\n\nThe plan of the article is as follows. In Section II we\ndescribe the QM and NJL models and fix our notation.\nIn Section III we discuss our numerical results for the\npolarization of quarks, and compute the magnetic susceptibility of the quark condensate. In Section IV we\ncompute the renormalized Quantum Effective Potential\n(QEP) of the QM model in a magnetic background, in\nthe one-loop approximation, and compute analytically\nthe solution of the gap equation in the weak field case,\nand semi-analytically in the strong field limit. We then\nuse the results to estimate μf and χ. Finally, in Section\nV we draw our conclusions.\n\n\f3\nII.\n\nCHIRAL MODELS COUPLED TO A\nMAGNETIC FIELD\n\nIn the first part of this article, we derive numerical\nresults for the spin polarization of quarks in a magnetic\nfield, and for the magnetic susceptibility of the quark condensate, using two effective chiral models: the NambuJona-Lasinio (NJL) model, and the Quark-Meson (QM)\nmodel. We describe the two models in some detail in\nthis Section. We work in the Landau gauge and take the\nmagnetic field along the z−axis, B = (0, 0, B).\n\nA.\n\nQuark-Meson model\n\nIn the QM model, a meson sector described by the linear sigma model lagrangian, is coupled to quarks via a\nYukawa-type interaction. The model is renormalizable in\nD = 3+1 dimensions. However, since we adopt the point\nof view of it as an effective description of QCD, it is not\nnecessary to use the renormalized version of the model\nitself. On the contrary, it is enough to fix an ultraviolet scale to cutoff the divergent expectation values; the\nUV scale is then chosen phenomenologically, by requiring\nthat the numerical value of the chiral condensate in the\nvacuum obtained within the model, is consistent with the\nresults obtained from the sum rules [49]. This is a rough\napproximation of the QCD effective quark mass, which\nsmoothly decays at large momenta [44, 45]. In Section\nIV we will use a renormalized version of the model, to\nderive semi-analytically some results in the two regimes\nof weak and strong fields.\nThe lagrangian density of the model is given by\nμ\n\nL = q̄ [iDμ γ − g(σ + iγ5 τ * π)] q\n1\n1\n2\n2\n+ (∂μ σ) + (∂μ π) − U (σ, π) .\n2\n2\n\n(4)\n\nIn the above equation, q corresponds to a quark field\nin the fundamental representation of color group SU (3)\nand flavor group SU (2); the covariant derivative, Dμ =\n∂μ − Qf eAμ , describes the coupling to the background\nmagnetic field, where Qf denotes the charge of the flavor\nf . Besides, σ, π correspond to the scalar singlet and the\npseudo-scalar iso-triplet fields, respectively. The potential U describes tree-level interactions among the meson\nfields. In this article, we take its analytic form as\nU (σ, π) =\n\n\u00012\nλ 2\nσ + π 2 − v 2 − hσ ,\n4\n\n(5)\n\nwhere the first addendum is chiral invariant; the second\none describes a soft explicit breaking of chiral symmetry,\nand it is thus responsible for the non-zero value of the\npion mass. For h = 0, the interaction terms of the model\nare invariant under SU (2)V ⊗ SU (2)A ⊗ U (1)V . This\ngroup is broken explicitly to U (1)3V ⊗ U (1)3A ⊗ U (1)V if\nthe magnetic field is coupled to the quarks, because of\nthe different electric charge of u and d quarks. Here, the\n\nsuperscript 3 in the V and A groups denotes the transformations generated by τ3 , τ3 γ5 respectively. Therefore, the chiral group in presence of a magnetic field is\nU (1)3V ⊗ U (1)3A . This group is then explicitly broken by\nh-term to U (1)3V .\nIn this article, we restrict ourselves to the large-Nc\n(that is, one-loop) approximation, which amounts to consider mesons as classical fields, and integrate only over\nfermions in the generating functional of the theory to obtain the Quantum Effective Potential (QEP). As a matter\nof fact, quantum corrections arising from meson bubbles\nare suppressed of a factor 1/Nc with respect to case of\nthe fermion bubble. In the integration process, the meson fields are fixed to their classical expectation value,\nhπi = 0 and hσi =\n6 0 (in particular, σ has the quantum\nnumbers of the chiral condensate, hq̄qi). The physical\nvalue of hσi will be then determined by minimization of\nthe QEP.\nTo compute QEP in presence of a magnetic background, we use the Leung-Ritus-Wang method [50] which\nallows to write down the quark propagator for the flavor\nf in terms of Landau levels,\n∞ Z\nX\ndp0 dp2 dp3\ni\nEP (x)Λk\nĒP (y) ,\n(2π)4\nP *γ−M\nk=0\n(6)\nwhere EP (x) corresponds to the eigenfunction of a\ncharged fermion in magnetic field, and ĒP (x) ≡\nγ0 (EP (x))† γ0 . In the above equation,\nq\n(7)\nP = (p0 , 0, Q 2k|Qf eB|, p3 ) ,\n\nSf (x, y) =\n\nwhere k = 0, 1, 2, . . . labels the k th Landau\nQ ≡ sign(Qf ), with Qf denoting the charge\nvor f ; Λk is a projector in Dirac space which\naccount the degeneracy of the Landau levels;\nby\n\nlevel, and\nof the flakeeps into\nit is given\n\nΛk = δk0 [P+ δQ,+1 + P− δQ,−1 ] + (1 − δk0 )I ,\n\n(8)\n\nwhere P± are spin projectors and I is the identity matrix\nin Dirac spinor indices. At the one-loop level, the QEP\nthen reads\n\u00012\nλ 2\nV =\nσ − v 2 − hσ\n4\nX |Qf eB| X Z dp3\nωk (p3 ) .\n(9)\nβk\n−Nc\n2π\n2π\nf\n\nk\n\nIn the above equation we have defined\nq\nωk (p3 ) = p23 + 2k|Qf eB| + m2q ,\n\n(10)\n\nwith mq = gσ; βk = 2 − δk0 counts the degeneracy of the\nLandau levels.\nThe one-loop fermion contribution, which corresponds\nto the last addendum in the r.h.s. of Eq. (9), is divergent\nin the ultraviolet. In order to regularize it, we adopt a\n\n\f4\nsmooth regulator UΛ as in [26], which is more suitable,\nfrom the numerical point of view, in our model calculation with respect to the hard-cutoff which is used in\nanalogous calculations without magnetic field. In this\narticle we chose\nUΛ =\n\nΛ2N\n\nΛ2N\n,\n+ (p2z + 2|Qf eB|k)N\n\nN =5.\n\n(11)\n\nThe (more usual) 3-momentum cutoff regularization\nscheme is recovered in the limit N → ∞; we notice that,\neven if the choice N = 5 may seem arbitrary to some\nextent, it is not more arbitrary than the choice of the\nhard cutoff scheme, that is, of a regularization scheme.\nIn effective models, the choice of a regularization scheme\nis a part of the definition of the model itself. Momentum\nintegrals are understood as follows:\nX Z dp\nX Z dp\nβn\n→\nUΛ .\n(12)\nβn\n2π\n2π\nn\nn\nOnce the expectation value of σ is computed as a function of eB by a procedure of minimization of V , we compute the expectation values that are relevant to the context. To begin with, we consider the chiral condensate\nfor the flavor f , hf ̄f i = −Tr[Sf (x, x)], with Sf given by\nEq. (6). It is straightforward to derive the relation\n∞\n\nhf ̄f i = −Nc\n\n|Qf eB| X\nβk\n2π\nk=0\n\nZ\n\ndp3 mq\n,\n2π ωk (p3 )\n\n(13)\n\nwhere the divergent integral on the r.h.s. of the above\nequation has to be understood regularized as in (12).\nFrom Eq. (13) we notice that the prescription (12) is almost equivalent to the introduction of a running effective\nquark mass,\n\u0001\nmq = gσΘ Λ2 − p23 − 2k|Qf eB| ,\n(14)\nthat can be considered as a rough approximation to the\neffective running quark mass in QCD [45] which decays\nat large quark momenta, see also the discussion in [44].\nOnce the scale Λ is fixed, the Landau levels with n ≥ 1\nare removed from the chiral condensate if eB ≫ Λ2 .\nNext we turn to the magnetic moment for the flavor f ,\nhf ̄Σμν f i = −Tr[Σμν Sf (x, x)] ,\n\n(15)\n\nwhere\nΣμν =\n\n1 μ ν\n(γ γ − γ ν γ μ ) ,\n2i\n\n(16)\n\nis the relativistic spin operator. We take B = (0, 0, B);\nin this case, only Σ12 ≡ Σf is non-vanishing. Using the\nproperties of γ−matrices it is easy to show that only\nthe Lowest Landau Level (LLL) gives a non-vanishing\ncontribution to the trace:\nZ\ndp3 mq\nQf |eB|\n,\n(17)\nΣf = N c\n2π\n2π ω0 (p3 )\n\nwhere ω0 = ωk=0 . Once again, the divergent integral on\nthe r.h.s. of the above equation has to be understood\nregularized following the prescription in Eq. (12).\nFor the QM model, the parameters are tuned as follows. We fix the constituent quark mass in the vacuum to\na phenomenological value, mq = 335 MeV; furthermore,\nwe require that in the vacuum the following condition\nholds:\n∂V (σ, B = 0)\n∂σ\n\n=0,\n\n(18)\n\nσ=fπ\n\nwhich implies that hσi = fπ in the vacuum, thus mq =\ngfπ . As a consequence we find g = 3.62. The parameter\nh is fixed by the condition h = fπ m2π , where mπ is the\naverage value of the pion mass in the vacuum and fπ =\n92.4 MeV. We have then h = 0.047m3q . To determine v\nand λ we solve simultaneously Eq. (18) and\nm2σ =\n\n∂2V\n∂σ 2\n\n,\n\n(19)\n\nσ=fπ\n\nwith mσ = 700 MeV. The divergences in these two\nequations are cured with the prescription (12). In the\nUV regulator we chose Λ = 560 MeV which implies\nhūui = (−231 MeV)3 . This results in the values λ = 4.67\nand v 2 = −1.8m2q . Before going ahead, we notice that\nin the non-renormalized model, the 1-loop fermion contribution regularized at the scale Λ is included into the\nconditions (18) and (19).\nB.\n\nNambu-Jona-Lasinio model\n\nThe quark lagrangian density of the NJL model is given\nby\ni\nh\n2\n2\nL = q̄ (iγ μ Dμ − m0 ) q + G (q̄q) + (iq̄γ5 τ q) ; (20)\n\nhere q is the quark Dirac spinor in the fundamental representation of the flavor SU (2) and the color group; τ correspond to the Pauli matrices in flavor space. A sum over\ncolor and flavor is understood. Once again, the covariant\nderivative embeds the QED coupling of the quarks with\nthe external magnetic field. The explicit soft breaking of\nchiral symmetry in this model is achieved by introducing\na current quark mass, m0 , whose numerical value is fixed\nby fitting the vacuum pion mass. The NJL model is not\nrenormalizable in the usual sense for D > 2 space-time\ndimensions; it is renormalizable in D < 4 in the one-loop\napproximation. At D = 4 it might represent a trivial\ntheory of non-interacting bosons if the ultraviolet cutoff is allowed to be infinite [14, 16]. However, adopting\nthe point of view of the NJL model as an effective (and\nrough) description of low-energy QCD, it is not necessary\nto require the cutoff to be infinite: the cutoff can be interpreted as a physical quantity which makes the effective\nquark mass to be constant at small quark momenta, and\nvanishing at large momenta, thus mimicking roughly the\n\n\f5\n\n3.5\n3\nCondensates\n\nrunning effective mass of real QCD [45]. It is worth to\nnotice that a non-local interaction among quarks with the\nsame quantum numbers of the four-fermion local term in\nEq. (20) can be derived by the QCD action under some\napproximation, taking the low energy limit of the latter [7, 11]. For simplicity, we treat here only the case of\nlocal interaction.\nOnce again, the one-loop fermion contribution can be\nobtained within the Leung-Ritus-Wang method:\nX |Qf eB| X Z +∞ dp\nV = GΣ2 − Nc\nωn (p) ,\nβn\n2π\n−∞ 2π\nn\n\n2.5\n2\n1.5\n1\n0.2\n\n0.4\n0.6\neB HGeV2 L\n\n0.2\n\n0.4\n0.6\neB HGeV2 L\n\nf =u,d\n\nIII.\n\n1\n\n60\n40\nSf \u0090fΠ 3\n\n(21)\nq\n2\n2\nwith ωn (p) = p + 2n|Qf eB| + Mq , and Mq = m0 −\n ̄\n2GΣ with Σ = hūu + ddi.\nEquations (13) and (15) are\nstill valid in the NJL model, with the replacement mq →\nMq . A comparison of the QEPs of the QM model and\nof the NJL model shows that at the one-loop level, the\ntwo models differ only for the classic part of the effective\nmeson potential, and for the definition of the constituent\nquark mass.\nThe parameters in the NJL model are fixed as follows.\nThe bare quark mass is computed by virtue of the GellMann-Oakes-Renner relation, m2π fπ2 = −2m0 hūui, which\nis satisfied in the NJL model [10]. Then, two equations\nare solved simultaneously: one for fπ and one for the\nchiral condensate in the vacuum at zero magnetic field\nstrength. Requiring that fπ = 92.4 MeV and hūui =\n(−253 MeV)3 , this procedure gives the numerical values\nof G and Λ. Thus we find Λ = 626.76 MeV, G = 2.02/Λ2\nand m0 = 5 MeV.\n\n0.8\n\n20\n0\n-20\n0.8\n\n1\n\nFIG. 1. Upper panel. Chiral condensates of u-quarks (red)\nand d-quarks (blue), in units of the same quantities at zero\nmagnetic field, as a function of the magnetic field. Lower\npanel. Expectation value of the magnetic moment operator,\nin units of fπ3 , as a function of eB. Data correspond to the\nQM model.\n\nNUMERICAL RESULTS\n\nIn this Section, we collect our numerical results which\nare relevant for the computation of the magnetic susceptibility of the chiral condensate, and of the spin polarization. From the numerical point of view, it is more\nconvenient to compute firstly the latter; then, a fit of the\npolarization data at small fields will enable to extract the\nvalue of the magnetic susceptibility of the quark condensate. For what concerns data about chiral condensate,\nmagnetic moment and polarization, we plot results only\nfor the QM model, since the results obtained within the\nNJL model are qualitatively very similar to those obtained within the former model. Then, we will give the\nfinal result for the chiral magnetization for the two models considered here.\nA.\n\nPolarization\n\nThe physical value of the (total) chiral condensate Σ\nfor the NJL model, and of σ for the QM model, are obtained numerically by a minimization procedure of the\nQEP (21) for any value of eB. Then, we make use of\n\nEqs. (13) and (15), with the replacement (12), to compute the chiral condensate and the magnetic moment for\neach flavor.\nIn the upper panel of Fig. 1, we plot the chiral condensates for u and d quarks, as a function of eB, for the\nQM model. The magnetic field splits the two quantities\nbecause of the different charge for the two quarks. The\nsmall oscillations, which are more evident for the case of\nthe u-quark, are an artifact of the regularization scheme,\nand disappear if smoother regulators are used, see the\ndiscussion in [29]. In the regime of weak fields, our data\nare consistent with the scaling hf ̄f i ∝ |eB|2 /M where\nM denotes some mass scale; in the strong field limit we\nfind instead hf ̄f i ∝ |eB|3/2 . The behavior of the quark\ncondensate as a function of magnetic field is in agreement\nwith the magnetic catalysis scenario [27, 51].\nIn the lower panel of Fig. 1 we plot our data for the\nexpectation value of the magnetic moment. Data correspond to the QM model (for the NJL model we obtain\nsimilar results). At weak fields, Σf ∝ |eB| as expected\nfrom Eq. (15). In the strong field limit, non-linearity\narise because of the scaling of quark mass (or chiral con-\n\n\f1\n\n1\n\n0.8\n\n0.8\n\n0.6\n\n0.6\n\nΜf\n\nΜf\n\n6\n\n0.4\n\nu-quark\n\nTrig\n\n0.4\n\nClas\n\nu-quark\n\n0.2\n\n0.2\n\nQuan\n\nd-quark\n0.2\n\n0.4\n0.6\neB HGeV2 L\n\n0.8\n\n1\n\n0.2\n1\n\nFIG. 2. Polarization of u-quarks (red) and d−quarks (blue)\nas a function the magnetic field strength, for the QM model.\n\nThe saturation to the asymptotic value μ∞ = 1 of polarization is naturally understood within the models we\ninvestigate, as a LLL dominance in the chiral condensate\n(i.e., full polarization). As a matter of fact, Σf and hf ̄f i\nturn to be proportional in the strong field limit, since\nonly the LLL gives a contribution to the the latter, compare Eq. (13) and (17) which imply\nhf ̄f iHLL\n,\nhf ̄f i\n\n(22)\n\nwhere hf ̄f iHLL corresponds to the higher Landau levels contribution to the chiral condensate. In the strong\nfield limit hf ̄f iHLL → 0 because of Eq. (12) which is a\nrough approximation to the QCD effective quark mass,\nas depicted in Eq. (14); hence, μf has to approach the\nasymptotic value μ∞ = 1. On the other hand, in the\nweak field limit hf ̄f iHLL → hf ̄f i and the proportionality\namong Σf and hf ̄f i is lost.\nIn Ref. [41], data of polarization are fit by means of\n\n1\n\n0.8\nΜf\n\nIn Fig. 2 we plot our results for the polarization.\nData are obtained by the previous ones, using the definition (3). At small fields, the polarization clearly grows\nlinearly with the magnetic field. This is a natural consequence of the linear behavior of the magnetic moment as\na function of eB for small fields, see Fig. 1. On the other\nhand, within the chiral models we measure a saturation of\nμf at large values of eB, to an asymptotic value μ∞ = 1.\nThis conclusion remains unchanged if we consider the\nNJL model, and it is in agreement with the recent Lattice findings [41]. It should be noticed that, at least for\nthe u−quark, saturation is achieved before the expected\nthreshold for ρ−meson condensation [46–48]. Therefore,\nour expectation is that our result is stable also if vector\nmeson condensation is considered.\n\n0.8\n\nd-quark\n\n0.6\nTrig\n\n0.4\n\ndensate); we find Σf ∝ |eB|3/2 in this limit.\n\nμf = 1 −\n\n0.4\n0.6\neB HGeV2 L\n\nClas\n0.2\n\nQuan\n0.2\n\n0.4\n0.6\neB HGeV2 L\n\n0.8\n\n1\n\nFIG. 3. Upper panel. Polarization data for u−quark (grey\ndots) and fitting curves. See the text for details. Lower panel.\nPolarization data and fitting functions for d−quark. Results\ncorrespond to the QM model.\n\nthree different functions, namely\nμ∞\n3χQf eB\n−\n,\nμ∞\n3χQf eB\n2χQf eB\nχQf eB\n= μ∞ 2 coth\n− coth\nμ∞\nμ∞\nπχQf eB\n2μ∞\n.\narctan\n=\nπ\n2μ∞\n\nμclas\n= μ∞ coth\nf\nμquan\nf\nμtrig\nf\n\n(23)\n, (24)\n(25)\n\nThe three functions above share the behavior at the origin, μf ≈ |χQf eB|, and the asymptotic one, μf ≈ μ∞ .\nIn [41] a two-parameter fit on χ and μ∞ is performed; the\nmodel with the lowest chi-squared per degrees of freedom\nis represented by the trigonometric one, Eq. (25). Inspired by these results we have tried to fit our data using\nthe same functions (23)-(25). In our model calculation,\nthe asymptotic value μ∞ = 1 is achieved straightforwardly, therefore it is enough to perform a one-parameter\nfit leaving χ as a free parameter. The results of this procedure are collected in Fig. 3, where we plot our data\nof quark's polarization as a function of eB (gray dots)\nand the three fitting functions with μ∞ = 1. From Fig. 3\nwe read that both the trigonometric and the classic functions do not adapt well to our data (for the NJL model we\nobtain similar results). In particular, both of the afore-\n\n\f7\nmentioned functions overestimate χ, and reach slowly the\nasymptotic value. On the other hand, the quantum function in Eq. (24) offers a better description of our data in\nthe whole range of eB examined here. We have checked\nthat the value of χ obtained within this fit overestimates\nthe value obtained by a weak-field linear fit only of the\n10%, see below. Moreover, the fit functions smoothly follow the large eB data to the asymptotic value μf = 1.\nWe conclude that within our model, the quantum fitting\nfunction is a more faithful representation of data. The\ndifference with Lattice data is probably due to the fact\nthat the latter ones are obtained with quenched (hence,\nnon-dynamical) fermions, while in our case dynamical\nfermions are considered. It will be interesting, therefore,\nto compare the model predictions with Lattice data obtained with other kinds of fermions in the near future.\nBefore going ahead, it is interesting that our data on\npolarization, and our interpretation of the saturation of\nthe latter at large fields, gives a quantitative estimate of\nthe goodness of the LLL approximation for the models at\nhand. In particular, at eBc ≈ 0.6 GeV2 , which in turns\nis the estimated critical value for vector meson condensation [46, 48], the LLL almost dominates the chiral condensate of the u−quark; on the other hand, at this value\nof eB the LLL dominance has not yet been achieved for\nthe d−quark condensate; but the higher Landau levels at\nthis value of eB give a contribution almost to the 20%\nof the chiral condensate. This is an indirect check of the\nconsistence of the LLL approximation used in [47], which\nin turn should be good within a 20% accuracy.\nB.\n\nMagnetic susceptibility of the quark condensate\n\nAt small fields μf = |χQf eB| from Eq. (1). Hence,\nwe use the data on polarization at small fields, to obtain\nthe numerical value of the magnetic susceptibility of the\nchiral condensate. Our results are as follows:\nχ ≈ −4.3 GeV−2 , NJL\nχ ≈ −5.25 GeV−2 , QM\n\n(26)\n(27)\n\nrespectively for the NJL model and the QM model. To\nobtain the numerical values above we have used data for\neB up to 5m2π ≈ 0.1 GeV2 , which are then fit using\na linear law. Using the numerical values of the chiral\ncondensate in the two models, we obtain\nχhf ̄f i ≈ 69 MeV , NJL\n(28)\n ̄\nχhf f i ≈ 65 MeV , QM\n(29)\nThe numerical values of χ that we obtain within the effective models are in fair agreement with recent results,\nsee Table I. In our model calculations, the role of the\nrenormalization scale is played approximately by the ultraviolet cutoff, that is Λ in Eq. (11), which is equal to\n0.560 GeV in the QM model, and 0.627 GeV in the NJL\nmodel.\nTo facilitate the comparison with previous estimates,\nwe review briefly the frameworks in which the results in\n\nTable I are obtained. In [36] the following result is found,\nwithin OPE combined with Pion Dominance (we follow\nwhen possible the notation used in [41]):\nχP D = −cχ\n\nNc\n,\n8π 2 Fπ2\n\nPion Dominance\n\n(30)\n\n√\nwith Fπ = 2fπ = 130.7 MeV and cχ = 2; the estimate\nof [36] is done at a renormalization point M = 0.5 GeV.\nIt is remarkable that Eq. (30) has been reproduced recently within AdS/QCD approach in [38]. Probably, this\nis the result more comparable to our estimate, because\nthe reference scales in [36] and in this article are very\nJL\nclose. Within our model calculations we find cN\n= 1.93\nχ\nQM\nand cχ = 2.36. Using the numerical value of Fπ and\ncχ we get χP D = −4.45 GeV−2 , which agrees within 3%\nwith our NJL model result, and within 18% with our QM\nmodel result.\nIn [37] the authors find cχ = 2.15 within hard-wall\nholographic approach, at the scale M ≪ 1 GeV. The\nresults of [37] are thus in very good parametric agreement with [36]; on the other hand, the numerical value\nof Fπ in the holographic model is smaller than the one\nused in [36], pushing the holographic prediction for χ to\nslightly higher values than in [36]. However, the scale at\nwhich the result of [37] is valid should be much smaller\nthan M = 1 GeV, thus some quantitative disagreement\nwith [36] is expected. As the authors have explained, it\nmight be possible to tune the parameters of the holographic model, mainly the chiral condensate, to reproduce the correct value of Fπ ; their numerical tests suggest that by changing the ratio hf ̄f i/mρ of a factor of\n8, then the numerical value of cχ is influenced only by\na 5%. It is therefore plausible that a best tuning makes\nthe quantitative prediction of [37] much closer to the estimate of [36].\nIn [39] an estimate of χ within the instanton vacuum\nmodel has been performed beyond the chiral limit, both\nfor light and for strange quarks (the result quoted in Table I corresponds to the light quarks; for the strange\nquark, χs /χu,d ≈ 0.15 is found). Taking into account\nthe numerical value of the chiral condensate in the instanton vacuum, the numerical estimate of [39] leads to\nχ = −2.5 ± 0.15 GeV−2 at the scale M = 1 GeV. An\nanalytic estimate within a similar framework has been\nobtained in [40], in which the zero-mode of the Dirac operator in the background of a SU (2) instanton is used\nto compute the relevant expectation values. The result\nof [31] gives χ = −3.52 GeV−2 at M ≈ 1 GeV.\nIn [41] the result χ = −1.547 GeV−2 is achieved\nwithin a two-color simulation with quenched fermions.\nIt is interesting that in [41] the same quantity has been\ncomputed also at finite temperature in the confinement\nphase, at T = 0.82Tc, and the result seems to be independent on temperature. The reference scale of [41],\ndetermined by the inverse lattice spacing, is M ≈ 2 GeV.\nTherefore the lattice results are not quantitatively comparable with our model calculation. However, they share\n\n\f8\nan important feature with the results presented here,\nnamely the saturation of the polarization at large values\nof the magnetic field. Finally, estimates of the magnetic\nsusceptibility of the chiral condensate by means of several QCD sum rules there exist [31–35]. The results are\ncollected in Table I.\n\nA.\n\nTo begin with, we need to regularize the one-loop\nfermion contribution in Eq. (9) namely\nfermion\nV1−loop\n= −Nc\n\n×\nIV.\n\nRENORMALIZED QM MODEL\n\nIn this Section, we make semi-analytic estimates of the\npolarization and the magnetic susceptibility of the quark\ncondensate, as well as for the chiral condensate in magnetic background, within the renormalized QM model.\nThis is done with the scope to compare the predictions of\nthe renormalized model with those of the effective models, in which an ultraviolet cutoff is introduced to mimic\nthe QCD effective quark mass.\nIn the renormalized model, we allow the effective quark\nmass to be a constant in the whole range of momenta,\nwhich is different from what happens in QCD [45]. Thus,\nthe higher Landau levels give a finite contribution to the\nvacuum chiral condensate even at very strong fields. This\nis easy to understand: the ultraviolet cutoff, Λ, in the\nrenormalized model can be taken larger than any other\nmass scale, in particular Λ ≫ |eB|1/2 ; as a consequence,\nthe condition p23 + 2n|eB| < Λ2 is satisfied taking into\naccount many Landau levels even at very large eB. The\ncontribution of the higher Landau levels, once renormalized, appears in the physical quantities to which we are\ninterested here, in particular in the chiral condensate.\nSince the computation is a little bit lengthy, it is useful\nto anticipate its several steps: firstly we perform regularization, and then renormalization, of the QEP at zero\nmagnetic field (the corrections due to the magnetic field\nturn out to be free of ultraviolet divergences). Secondly,\nwe solve analytically the gap equation for the σ condensate in the limit of weak fields, and semi-analytically\nin the opposite limit. The field-induced corrections to\nthe QEP and to the solution of the gap equation are\ndivergence-free in agreement with [27], and are therefore independent on the renormalization scheme adopted.\nThen, we compute the renormalized and self-consistent\nvalues of the chiral condensate and of the magnetic moment, as a function of eB, using the results for the\ngap equation. Within this theoretical framework, it is\nmuch more convenient to compute hf ̄f i and Σf by taking derivatives of the renormalized potential; in fact, the\ncomputation of the traces of the propagator in the renormalized model is much more involved if compared to the\nsituation of the non-renormalized models, since in the former a non-perturbative (and non-trivial) renormalization\nprocedure of composite local operators is required [54].\nFinally, we estimate χ, as well as the behavior of the\npolarization as a function of eB.\n\nRenormalization of the QEP\n\nX |Qf eB|\n2π\n\nf\n\n∞\nX\n\nβn\n\nZ\n\n+∞\n\n−∞\n\nn=0\n\n\u00011/2\ndk 2\n.\nk + 2n|Qf eB| + m2q\n2π\n\n(31)\n\nTo this end, we define the function, V(s), of a complex\nvariable, s, as\nX |Qf eB|\nV(s) = −Nc\n2π\nf\nZ +∞\n∞\nX\n\u0001 1−s\ndk 2\n×\nβn\nk + 2n|Qf eB| + m2q 2 .\n−∞ 2π\nn=0\n\n(32)\n\nThe function V(s) can be analytically continued to\nfermion\ns = 0. We define then V1−loop\n= lims→0+ V(s). After elementary integration over k, summation over n and\ntaking the limit s → 0+ , we obtain the result\n\u0013\nX (Qf eB)2 \u0012 2\nfermion\nV1−loop = Nc\n− log(2|Qf eB|) + a B2 (q)\n4π 2\ns\nf\n\n−Nc\n\nX (Qf eB)2\nf\n\n2π 2\n\nζ ′ (−1, q)\n\n\u0013\nX |Qf eB|m2q \u0012 2\n2\n− log(mq ) + a , (33)\n−Nc\n8π 2\ns\nf\n\nwhere we have subtracted terms which do not depend explicitly on the condensate. In the above equation, ζ (t, q)\nis the Hurwitz zeta function; for Re(t)P> 1 and Re(q) > 0,\n∞\nit is defined by the series ζ (t, q) = n=0 (n + q)−t ; the\nseries can be analytically continued to a meromorphic\nfunction defined in the complex plane t 6= 1. Moreover we\nhave defined q = (m2q + 2|Qf eB|)/2|Qf eB|; furthermore,\na = 1−γE −ψ(−1/2), where γE is the Eulero-Mascheroni\nnumber and ψ is the digamma function. The derivative\nζ ′ (−1, q) = dζ(t, q)/dt is understood to be computed at\nt = −1.\nThe first two addenda in Eq. (33) arise from the higher\nLandau levels; on the other hand, the last addendum is\nthe contribution of the LLL. The function B2 is the second Bernoulli polynomial; using its explicit form, it is\neasy to show that the divergence in the LLL term in\nEq. (33) is canceled by the analogous divergence in the\nfirst addendum of the same equation. It is interesting\nthat the LLL contribution, which is in principle divergent, combines with a part of the contribution of the\nhigher Landau levels, leading to a finite result. This can\nbe interpreted as a renormalization of the LLL contribution. On the other hand, the remaining part arising\n\n\f9\nχ (GeV−2 )\n\nMethod\n\nRen. Point (GeV)\n\nRef.\n\n1\n0.5\n1\n1\n1\n0.5\n≪1\n≪1\n1\n1\n2\n0.63\n0.56\n\n[31]\n[32]\n[33]\n[34]\n[35]\n[36]\n[37]\n[38]\n[39]\n[40]\n[41]\nThis work\nThis work\n\nSum rules\n−8.6 ± 0.24\nSum rules\n-5.7\nSum rules\n−4.4 ± 0.4\nSum rules\n−3.15 ± 0.3\nSum rules\n−2.85 ± 0.5\nOPE + Pion Dominance\n−Nc /(4π 2 Fπ2 )\nHolography\n−1.075Nc /(4π 2 Fπ2 )\nHolography\n−Nc /(4π 2 Fπ2 )\nInstanton vacuum\n−2.5 ± 0.15\nZero mode of Dirac Operator\n-3.52\nLattice\n−1.547(3)\nNJL model\n-4.3\nQM model\n-5.25\n\nTABLE I. Magnetic susceptibility of the quark condensate obtained within several theoretical approaches. In the table,\nFπ = 130.7 MeV. See the text for more details.\n\nfrom the higher Landau levels is still divergent; this divergence survives in the B → 0 limit, and is due to the\nusual divergence of the vacuum contribution. We then\nhave\n\u0013\nX m4q \u0012 2\nfermion\n− log(2|Qf eB|) + a\nV1−loop = Nc\n16π 2 s\n\nfermion\n2/s is cancelled in the difference V1 ≡ V1−loop\n− V0 ,\n!\nX m4q\n|Qf eB|m2q\n2|Qf eB|\nlog\nV1 = −Nc\n+\n2\n2\n16π\n8π\nm2q\nf\n\n−Nc\n\nf\n\n+Nc\n\nX\nf\n\n−Nc\n\n|Qf eB|m2q\n8π 2\n\nX (Qf eB)2\nf\n\n2π 2\n\nlog\n\nm2q\n\n2|Qf eB|\n\nζ ′ (−1, q) .\n\n(34)\n\nThe divergence of the vacuum energy is made explicit\nin the expression in the square brackets in Eq. (34). The\nmathematical structure of the divergence, namely a pole\nin s = 0 and a logarithm with a dimensional argument,\nis similar to that obtained within the dimensional regularization scheme. The scale of the logarithm is hidden\nin the 1/s term, and appears explicitly when the divergence is subtracted. Such a divergence affects only the\nB = 0 effective potential; the corrections due to the magnetic field are either finite or independent on the condensate. As a matter of fact, in the zero magnetic field limit\nq → ∞, the fermion bubble becomes\nNc Nf\n\nm4q\n16π 2\n\n\u0012\n\n2\n1\n− log m2q + a +\ns\n2\n\n\u0013\n\n≡ V0 ,\n\nwhere we have used the relation\n\u0012\n\u0013\n1\nB2 (q)\nq2\n′\nζ (−1, q) ≈\n+ log(q)\n−\n,\n12\n4\n2\n\n(35)\n\nX |Qf eB|2\nf\n\n2π 2\n\nζ ′ (−1, q) − Nc Nf\n\nm4q\n. (37)\n32π 2\n\nTo remove the divergence of the vacuum term, we\nfollow Ref. [27] and adopt the renormalization conditions that at zero magnetic field, the quantum corrections do not shift the classical expectation value of the\nσ field in the vacuum, hσi = fπ , as well as the classical value m2σ . To fulfill these conditions, two counterterms have to be added to the effective potential,\nV c.t. = δλ × σ 4 /4 + δv × σ 2 /2. This amounts to require\n∂(V0 + V c.t. )\n∂σ\n\n=\nσ=fπ\n\n∂ 2 (V0 + V c.t. )\n∂σ 2\n\n= 0 . (38)\nσ=fπ\n\nTaking into account the one-loop divergent contribution and the condition (38), we can write the renormalized potential at zero field as\nV =\n\n\u00012\nNc Nf m4q\nm2q\nλ̃ 2\nσ − ṽ 2 − hσ −\nlog\n, (39)\n4\n16π 2\ng 2 fπ2\n\nwhere λ̃ and ṽ are the renormalized parameters, whose\nexpression is not needed here. Equation (39) is in agreement with the textbook result for the one-loop effective\npotential of a linear sigma model coupled to fermions by\nmeans of a Yuwaka-type interaction [52]. This is a consistency check of our regularization and renormalization\nprocedures.\n\n(36)\n\nwith B2 corresponding to the second Bernoulli polynomial. Using Eqs. (35) and (34) we notice that the pole\n\nB.\n\nApproximate solutions of the gap equation\n\nWeak fields. We now restore the magnetic field, and\n\n\f10\nfirstly take the weak field limit. In this context, small\nfield means eB ≪ m2q . Using again Eq. (36) we notice\nthat the derivative of the ζ−function cancels the other\naddenda in Eq. (37), and the remaining contribution is\nV1 ≈ −Nc\n= −Nc\n\nX (Qf eB)2\nf\n\n24π 2\n\nX (Qf eB)2\nf\n\n24π 2\n\nlog\nlog\n\nm2q\n2|Qf eB|\nm2q\n,\nμ2\n\n(40)\n\nwhich is in agreement with the result of [27]. In the above\nequation we have followed the notation of [43] introducing an infrared scale μ, isolating and then subtracting\nthe term which does not depend on the condensate. The\nscale μ is arbitrary, and we cannot determine it from\nfirst principles; on the other hand, it is irrelevant for the\ndetermination of the σ−condensate. We expect μ ≈ fπ\nsince this is the typical scale of chiral symmetry breaking\nin the model for the σ field. The correction (40) lowers\nthe effective potential of the broken phase, thus favoring the spontaneous breaking of chiral symmetry. The\nresult in Eq. (40) is UV divergence-free as anticipated;\nthus, it is independent on the particular procedure used\nto regularize the QEP.\nIn this limit, it is easy to obtain analytically the behavior of the constituent quark mass as a function of eB. As\na matter of fact, we can expand the derivative of the QEP\nwith respect to σ, around the solution at B = 0, writing\nhσi = fπ + δσ. Then, a straightforward evaluation leads\nto\n\u0012\n\u0013\n5\nNc\n2\nmq = gfπ 1 +\n.\n(41)\n(eB)\n9 12π 2 fπ2 m2σ\nAs anticipated, the scale μ is absent in the solution of\nthe gap equation.\nStrong fields. In the limit eB ≫ m2q , we can find an\nasymptotic representation of V1 by using the expansion\nζ ′ (−1, q) = c0 + c1 (q − 1) valid for q ≈ 1, with c0 = −0.17\nand c1 = −0.42. Then we find\n!\nX m2q m2q\n2|Qf eB|\n+ |Qf eB| log\nV1 ≈ −Nc\n8π 2\n2\nm2q\nf\n\n−Nc\n\nX |Qf eB|m2q\nf\n\n2π 2\n\nc1 ,\n\n(42)\n\nwhere we have subtracted condensate-independent terms.\nIn the strong field limit it is not easy to find analytically an asymptotic representation for the sigma condensate as a function of eB; therefore we solve the gap\nequation numerically, and then fit data with a convenient\nanalytic form as follows:\nmq = b|eB|1/2 +\n\ncfπ3\n,\n|eB|\n\nC.\n\nEvaluation of chiral condensate and magnetic\nmoment\n\nChiral condensate. To compute the chiral condensate\nwe follow a standard procedure: we introduce source\nterm for f ̄f , namely a bare quark mass mf , then take\nderivative of the effective potential with respect to mf\nevaluated at mf = 0. This amounts to derive only\nfermion\n, since both the classic potential and countertV1−loop\nerms do not have a dependence on mf . According to\nEq. (37) we find\nhf ̄f i =\n\n∂V0\n∂mf\n\n+\nmf =0\n\n∂V1\n∂mf\n\n.\n\n(44)\n\nmf =0\n\nThe first and second addenda on the r.h.s. of Eq. (44)\nrepresent the vacuum and the field-induced contributions\nto the chiral condensate respectively. The vacuum contribution is divergent, and can be renormalized according\nto the procedure of renormalization of composite local\noperators [54]. It is not necessary to perform this procedure here, because the numerical value of the vacuum\ncondensate is not necessary in our discussion1 . Therefore, it is enough to compute only the contribution at\nB 6= 0 arising from V1 , which is finite.\nIn particular, for the weak field case we obtain\nhf ̄f i = hf ̄f i0 −\n\nNc |Qf eB|2\n.\n12π 2 mq\n\n(45)\n\nOn the other hand, in the strong field limit we have\nhf ̄f i = −\n\n\u0001\nN c mq\n2|Qf eB|\n.\n|Qf eB| + m2q log\n2\n4π\nm2q\n\n(46)\n\nUsing Equations (41) and (43), we show that the chiral\ncondensate scales as a + b(eB)2 for small fields, and as\n|eB|3/2 for large fields.\nMagnetic moment. Next we turn to the computation\nof the expectation value of the magnetic moment. The\nexpression in terms of Landau levels is given by Eq. (17),\nwhich clearly shows that this quantity has a log-type divergence. In order to avoid a complicated renormalization procedure of a local composite operator, we notice\nthat it is enough to take the minus derivative of V1 with\nrespect to B to get magnetization, M [43], then multiply\nby 2m/Qf to get the magnetic moment. This procedure\nis very cheap, since the B−dependent contributions to\nthe effective potential are finite, and the resulting expectation value will turn out to be finite as well (that is,\nalready renormalized).\n\n(43)\n\nwhere b = 0.32 and c = 32.78. At large fields the quark\nmass grows as |eB|1/2 as expected by dimensional analysis; this is a check of the equations that we use.\n\n1\n\nIn principle, in the renormalization program of the composite\noperator hq̄qi one can impose, as a renormalization condition,\nthat the chiral condensate in the vacuum is consistent with the\nresults of [49] at the renormalization point M = 1 GeV.\n\n\f11\nIn the case of weak fields, from Eq. (40) we find\nm2q\nQf |eB|mq\nlog\n.\n6π 2\nμ2\n\n(47)\n\nOn the other hand, in the strong field limit we get from\nEq. (42)\nΣf = N c\n\nm3q\n2|Qf eB|\nlog\n.\n2\n4π\nm2q\n\n(48)\n\nThe above result is in parametric agreement with the\nestimate of magnetization in [43]. In fact, m2q ≈ |eB|\nin the strong field limit, which leads to a magnetization\nM ≈ B log B.\nUsing the expansions for the sigma condensate at small\nand large values of the magnetic field strength, we argue\nthat Σf ≈ |eB| in a weak field, and Σf ≈ |eB|3/2 in a\nstrong field.\nD.\n\nComputation of chiral magnetization and\npolarization\n\nWe can now estimate the magnetic susceptibility of the\nquark condensate and the polarization as a function of\neB. For the former, we need to know the behavior of\nthe magnetic moment for weak fields. From Eq. (47) and\nfrom the definition (1) we read\nχhf ̄f i =\n\nm2q\nN c mq\nlog\n≡ f (μ) .\n6π 2\nμ2\n\n(49)\n\nThe presence of the infrared scale μ makes the numerical\nestimate of χ uncertain; however, taking for it a value μ ≈\nfπ , which is the typical scale of chiral symmetry breaking,\nwe have χhf ̄f i ≈ 44 MeV, which is in agreement with\nthe expected value, see Eq. (2). In Fig. 4 we plot f (μ)\nas a function of μ. The interval on the μ-axis delimited\nby the green and the blue vertical lines is the range in\nwhich we obtain a value of χ which is consistent with\nphenomenology.\nNext we turn to the polarization. For weak fields we\nfind trivially a linear dependence of μf on |Qf eB|, with\nslope given by the absolute value of χ in Eq. (49). On the\nother hand, in the strong field limit we find, according to\nEq. (48),\nμf ≈\n\nm2q\n|Qf |\n≈1−\n,\nm2q + |Qf eB|\nb + |Qf |\n\n(50)\n\nwhere we have used Eq. (43). This result shows that\nthe polarization saturates at large values of eB, but the\nasymptotic value depends on the flavor charge.\nIt is interesting to compare the result of the renormalized model with that of the effective models considered\nin the previous Section. In the former, the asymptotic\nvalue of μf is flavor-dependent; in the latter, μf → 1\nindependently on the value of the electric charge. Our\n\n80\nfHΜL HMeVL\n\nΣf = N c\n\n100\n\n60\n40\n20\n0.4\n\n0.6\n\n0.8\n1\nΜ\u0090fΠ\n\n1.2\n\n1.4\n\nFIG. 4. Magnetic susceptibility of the quark condensate multiplied by the chiral condensate, in MeV, as a function of the\ninfrared scale μ, as given by Eq. (49). The interval on the\nμ-axis delimited by the green and the blue vertical lines is\nthe range in which we obtain a value of χ which is consistent\nwith phenomenology.\n\ninterpretation of this difference is as follows: comparing\nEq. (50) with the general model expectation, Eq. (22), we\nrecognize in the factor |Qf |/(b + |Qf |) the contribution\nof the higher Landau levels at zero temperature, which\nturns out to be finite and non-zero after the renormalization procedure. This contribution is then transmitted to the physical quantities that we have computed.\nThe trace of the higher Landau levels is implicit in the\nsolution of the gap equation in the strong field limit,\nnamely the factor b in Eq. (43), and explicit in the additional |Qf | dependence in Eq. (50). A posteriori, this\nconclusion seems quite natural, because in the renormalization procedure we assume that the effective quark\nmass is independent on quark momentum, thus there is\nno cut of the large momenta in the gap equation (and\nin the equation for polarization as well). In the effective models considered in the first part of this article,\non the other hand, the cutoff procedure is equivalent\nto have a momentum-dependent effective quark mass,\nmq = gσΘ(Λ2 − p23 − 2n|Qf eB|), which naturally cuts\noff higher Landau levels when eB ≫ Λ2 . At the end\nof the days, the expulsion of the higher Landau levels\nfrom the chiral condensate makes μf → 1 in the strong\nfield limit. Our expectation is that if we allow the quark\nmass to run with momentum and decay rapidly at large\nmomenta, mimicking the effective quark mass of QCD,\nhigher Landau levels would be suppressed in the strong\nfield limit, and the result (50) would tend to the result\nin Fig. 2.\n\nV.\n\nCONCLUSIONS\n\nIn this article, we have computed the magnetic susceptibility of the quark condensate, χ, and the polarization,\nμf , in a background of a magnetic field, B, by means of\n\n\f12\n\nWithin the renormalized model we find a saturation of\nμf at large B, in qualitative agreement with our findings\nwithin the effective models in Section III and quenched\n\nQCD [41]. In the renormalized model, the asymptotic\nvalue of μf is flavor-dependent; in the effective models\nand quenched QCD, μf → 1 independently on the value\nof the electric charge. We attribute this difference to the\npresence, in the theory, of the renormalized contribution\nof the higher Landau levels: in the renormalized model,\nthe higher Landau levels give a finite contribution to the\nchiral condensate at zero temperature, even in the case of\nvery strong fields. After renormalization of the QEP, this\ncontribution is finite and non-zero, and is transmitted to\nthe physical quantities that we have computed.\nThe results we obtained are quite encouraging, and\nsuggest that a systematic study of external field induced\ncondensates at zero, as well as finite, temperature within\nchiral models is worth to be done. As a natural continuation of this study, it would be interesting to add the\nstrange quark, following the work [39]. Moreover, Lattice\nsimulations have shown that χ is almost insensitive to the\ntemperature, at least in the confinement phase [41]. This\nresult is achieved with quenched fermions. On the other\nhand, the chiral model handle with dynamical fermions;\nit would be therefore of interest to address the question\nof the behavior of χ as a function of temperature using\nchiral models. Furthermore, it has been shown [53] that\nlocal fluctuations of topological charge induce a quark\nelectric dipole moment along the direction of a strong\nmagnetic field. This problem can be studied easily within\nthe chiral models, introducing a pseudo-chemical potential μ5 conjugated to chirality imbalance as already done\nin [24, 30].\nAcknowledgements. We acknowledge M. Chernodub, T. Cohen, A. Flachi, R. Gatto, A. Ohnishi for\nseveral discussions and correspondence. Moreover, we\nthank H. Suganuma for valuable and numerous discussions on the renormalization of the quark-meson model\nand for a careful reading of the manuscript. The Laboratoire de Matematique et Physique Teorique of Tours University, as well as the Physics Department of Jyvaskyla\nUniversity, where part of this work was completed, are\nacknowledged for the kind hospitality. The work of M. R.\nis supported by JSPS under contract number P09028.\n\n[1] P. de Forcrand and O. Philipsen, JHEP 0701, 077 (2007);\nJHEP 0811, 012 (2008); PoS LATTICE2008, 208\n(2008).\n[2] Y. Aoki et al., Nature 443, 675 (2006); Y. Aoki, S. Borsanyi, S. Durr, Z. Fodor, S. D. Katz, S. Krieg and\nK. K. Szabo, JHEP 0906, 088 (2009); S. Borsanyi et\nal., S. Borsanyi et al., JHEP 1009 (2010) 073;\n[3] A. Bazavov et al., Phys. Rev. D 80, 014504 (2009).\n[4] M. Cheng et al., Phys. Rev. D 81, 054510 (2010).\n[5] F. Karsch, E. Laermann and A. Peikert, Nucl. Phys. B\n605, 579 (2001); F. Karsch, Lect. Notes Phys. 583, 209\n(2002); O. Kaczmarek and F. Zantow, Phys. Rev. D 71,\n114510 (2005).\n[6] C. S. Fischer, Phys. Rev. Lett. 103, 052003 (2009);\nC. S. Fischer and J. A. Mueller, Phys. Rev. D 80, 074029\n\n(2009); C. S. Fischer, A. Maas and J. A. Muller; Eur.\nPhys. J. C 68, 165 (2010). A. C. Aguilar and J. Papavassiliou, arXiv:1010.5815 [hep-ph]; C. Feuchter and\nH. Reinhardt, Phys. Rev. D 70, 105021 (2004); Phys.\nRev. D 71, 105002 (2005). M. Leder, J. M. Pawlowski,\nH. Reinhardt and A. Weber, arXiv:1006.5710 [hep-th];\nJ. Braun, Eur. Phys. J. C 64, 459 (2009); J. Braun,\nL. M. Haas, F. Marhauser and J. M. Pawlowski,\narXiv:0908.0008 [hep-ph]; J. Braun and A. Janot,\narXiv:1102.4841 [hep-ph].\n[7] M. Frasca, Phys. Lett. B 670, 73 (2008); Mod. Phys.\nLett. A 24 (2009) 2425; arXiv:1007.4479 [hep-ph].\n[8] M. A. Shifman, A. I. Vainshtein and V. I. Zakharov, Nucl.\nPhys. B 147, 385 (1979); Nucl. Phys. B 147, 448 (1979).\n[9] Y. Nambu and G. Jona-Lasinio, Phys. Rev. 122, 345\n\ntwo chiral models of QCD: the quark-meson model and\nthe Nambu-Jona-Lasinio model. The knowledge of these\nquantities is relevant both theoretically and phenomenologically. Indeed, the magnetic susceptibility of the quark\ncondensate might lead, in the photoproduction of lepton\npairs, to an interference between the Drell-Yan process\nand the photon-quark coupling, the latter induced by the\nchiral-odd distrubution amplitude of the quark [42]. The\ntwo models are widely used to study the phase diagram\nof QCD in several regimes; it has been proved in different contexts, that they offer a good theoretical tool to\ncompute low-energy QCD properties. It is thus interesting to compute, within these models, quantities which\ncharacterize the QCD vacuum in a magnetic background,\nand compare the results with those obtained within different theoretical frameworks, both analytically and numerically.\nIn the first part of this article, we have reported our\nresults about χ and μf obtained within a numerical selfconsistent solution of the model, in the one-loop approximation. Our results on χ are summarized in Table I, and\nare in fair agreement with previous estimates. Besides,\nour data on polarization are collected in Fig. 3. For the\nlatter, we obtain a saturation to the asymptotic value\nμ∞ = 1 at large values of eB, which is understood as a\nlowest Landau level dominance in the quark condensate.\nThis is in agreement with recent results obtained within\nLattice QCD simulations with two colors and quenched\nfermions [41].\nIn the second part of the article, we have estimated χ\nand μf within a renormalized version of the QM model.\nThe numerical value of χ in this case is quite uncertain\nbecause of the presence, in the final result, of an unknown\ninfrared scale μ. However, as shown in Fig. 4, taking for\nμ a numerical value around fπ , which is the typical scale\nof chiral symmetry breaking in this model, we obtain a\nvalue of χ which is consistent with phenomenology.\n\n\f13\n\n[10]\n\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n\n[17]\n\n[18]\n\n[19]\n[20]\n\n[21]\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n[29]\n[30]\n[31]\n[32]\n\n(1961); Y. Nambu and G. Jona-Lasinio, Phys. Rev. 124,\n246 (1961).\nU. Vogl and W. Weise, Prog. Part. Nucl. Phys. 27,\n195 (1991); S. P. Klevansky, Rev. Mod. Phys. 64, 649\n(1992); T. Hatsuda and T. Kunihiro, Phys. Rept. 247,\n221 (1994); M. Buballa, Phys. Rept. 407, 205 (2005).\nK. I. Kondo, Phys. Rev. D 82, 065024 (2010).\nM. Frasca, Nucl. Phys. Proc. Suppl. 207-208, 196 (2010);\nInt. J. Mod. Phys. E 18, 693 (2009).\nJ. L. Gervais and B. W. Lee, Nucl. Phys. B 12, 627\n(1969).\nA. L. Mota, M. C. Nemes, B. Hiller and H. Walliser, Nucl.\nPhys. A 652, 73 (1999).\nS. Weinberg, Phys. Rev. D 56, 2303 (1997).\nK. G. Wilson, Phys. Rev. D 7, 2911 (1973); T. Eguchi,\nPhys. Rev. D 17, 611 (1978); S. Kim, A. Kocic and\nJ. B. Kogut, Nucl. Phys. B 429, 407 (1994).\nS. Roessner, C. Ratti and W. Weise, Phys. Rev.\nD 75, 034007 (2007); C. Sasaki, B. Friman and\nK. Redlich, Phys. Rev. D 75, 074013 (2007); S. K. Ghosh,\nT. K. Mukherjee, M. G. Mustafa and R. Ray, Phys.\nRev. D 77, 094024 (2008); A. Bhattacharyya, P. Deb,\nS. K. Ghosh and R. Ray, Phys. Rev. D 82, 014021 (2010).\nK. Fukushima, Phys. Rev. D 77, 114028 (2008)\n[Erratum-ibid. D 78, 039902 (2008)]; M. Ciminale,\nR. Gatto, N. D. Ippolito, G. Nardulli and M. Ruggieri,\nPhys. Rev. D 77, 054023 (2008); W. j. Fu, Z. Zhang\nand Y. x. Liu, Phys. Rev. D 77, 014006 (2008); T. Hell,\nS. Rossner, M. Cristoforetti and W. Weise, Phys. Rev. D\n81, 074034 (2010).\nH. Abuki, R. Anglani, R. Gatto, G. Nardulli and M. Ruggieri, Phys. Rev. D 78, 034034 (2008).\nK. Kashiwa, H. Kouno, M. Matsuzaki and M. Yahiro,\nPhys. Lett. B 662, 26 (2008); Y. Sakai, T. Sasaki,\nH. Kouno and M. Yahiro, Phys. Rev. D 82, 076003\n(2010).\nT. K. Herbst, J. M. Pawlowski and B. J. Schaefer,\narXiv:1008.0081 [hep-ph].\nV. Skokov, B. Friman, E. Nakano, K. Redlich and\nB. J. Schaefer, Phys. Rev. D 82, 034029 (2010).\nT. Kahara and K. Tuominen, Phys. Rev. D 78, 034015\n(2008); Phys. Rev. D 80, 114022 (2009); arXiv:1006.3931\n[hep-ph].\nK. Fukushima, M. Ruggieri and R. Gatto, Phys. Rev. D\n81, 114031 (2010).\nA. J. Mizher, M. N. Chernodub and E. S. Fraga, Phys.\nRev. D 82, 105016 (2010).\nR. Gatto and M. Ruggieri, Phys. Rev. D 83, 034016\n(2011); Phys. Rev. D 82, 054027 (2010).\nH. Suganuma and T. Tatsumi, Annals Phys. 208, 470\n(1991).\nE. S. Fraga and A. J. Mizher, Phys. Rev. D 78, 025016\n(2008).\nL. Campanelli and M. Ruggieri, Phys. Rev. D 80, 034014\n(2009).\nM. N. Chernodub and A. S. Nedelin, arXiv:1102.0188\n[hep-ph].\nB. L. Ioffe and A. V. Smilga, Nucl. Phys. B 232, 109\n(1984).\nV. M. Belyaev and Y. I. Kogan, Yad. Fiz. 40, 1035\n\n(1984).\n[33] I. I. Balitsky, A. V. Kolesnichenko and A. V. Yung, Sov.\nJ. Nucl. Phys. 41, 178 (1985) [Yad. Fiz. 41, 282 (1985)].\n[34] P. Ball, V. M. Braun and N. Kivel, Nucl. Phys. B 649,\n263 (2003)\n[35] J. Rohrwild, JHEP 0709, 073 (2007)\n[36] A. Vainshtein, Phys. Lett. B 569, 187 (2003).\n[37] A. Gorsky and A. Krikun, Phys. Rev. D 79, 086015\n(2009).\n[38] D. T. Son and N. Yamamoto, arXiv:1010.0718 [hep-ph].\n[39] H. C. Kim, M. Musakhanov and M. Siddikov, Phys. Lett.\nB 608, 95 (2005)\n[40] B. L. Ioffe, Phys. Lett. B 678, 512 (2009).\n[41] P. V. Buividovich, M. N. Chernodub, E. V. Luschevskaya\nand M. I. Polikarpov, Nucl. Phys. B 826, 313 (2010).\n[42] B. Pire and L. Szymanowski, Phys. Rev. Lett. 103,\n072002 (2009).\n[43] T. D. Cohen and E. S. Werbos, Phys. Rev. C 80, 015203\n(2009).\n[44] K. Langfeld, C. Kettner and H. Reinhardt, Nucl. Phys.\nA 608, 331 (1996).\n[45] H. D. Politzer, Nucl. Phys. B 117, 397 (1976); Phys.\nLett. B 116, 171 (1982).\n[46] M. N. Chernodub, Phys. Rev. D 82, 085011 (2010).\n[47] M. N. Chernodub, arXiv:1101.0117 [hep-ph].\n[48] N. Callebaut,\nD. Dudal and H. Verschelde,\narXiv:1102.3103 [hep-ph].\n[49] H. G. Dosch and S. Narison, Phys. Lett. B 417, 173\n(1998); S. Narison, Phys. Rev. D 74, 034013 (2006).\n[50] V. I. Ritus, Annals Phys. 69, 555 (1972); C. N. Leung\nand S. Y. Wang, Nucl. Phys. B 747, 266 (2006).\n[51] S. P. Klevansky and R. H. Lemmer, Phys. Rev. D 39,\n3478 (1989); I. A. Shushpanov and A. V. Smilga, Phys.\nLett. B 402, 351 (1997); D. N. Kabat, K. M. Lee\nand E. J. Weinberg, Phys. Rev. D 66, 014004 (2002);\nT. Inagaki, D. Kimura and T. Murata, Prog. Theor.\nPhys. 111, 371 (2004); T. D. Cohen, D. A. McGady\nand E. S. Werbos, Phys. Rev. C 76, 055201 (2007);\nV. P. Gusynin, V. A. Miransky and I. A. Shovkovy, Nucl.\nPhys. B 462, 249 (1996); Nucl. Phys. B 563, 361 (1999);\nG. W. Semenoff, I. A. Shovkovy and L. C. R. Wijewardhana, Phys. Rev. D 60, 105024 (1999); V. A. Miransky and I. A. Shovkovy, Phys. Rev. D 66, 045006\n(2002); K. G. Klimenko, Theor. Math. Phys. 89, 1161\n(1992) [Teor. Mat. Fiz. 89, 211 (1991)]; K. G. Klimenko,\nZ. Phys. C 54, 323 (1992); K. G. Klimenko, Theor.\nMath. Phys. 90, 1 (1992) [Teor. Mat. Fiz. 90, 3 (1992)];\nB. Hiller, A. A. Osipov, A. H. Blin and J. da Providencia,\nSIGMA 4, 024 (2008); A. Goyal and M. Dahiya, Phys.\nRev. D 62, 025022 (2000).\n[52] S. Weinberg, The Quantum Theory of Fields: Modern\nApplications, Cambridge University Press, ISBN 978-0521-67054-8.\n[53] P. V. Buividovich, M. N. Chernodub, E. V. Luschevskaya\nand M. I. Polikarpov, Phys. Rev. D 81, 036007 (2010).\n[54] J. C. Collins, Renormalization. An Introduction To\nRenormalization, The Renormalization Group, And The\nOperator Product Expansion, Cambridge, Uk: Univ. Pr.\n(1984).\n\n\f"}