{"id": "http://arxiv.org/abs/0707.2644v1", "guidislink": true, "updated": "2007-07-18T06:31:27Z", "updated_parsed": [2007, 7, 18, 6, 31, 27, 2, 199, 0], "published": "2007-07-18T06:31:27Z", "published_parsed": [2007, 7, 18, 6, 31, 27, 2, 199, 0], "title": "Oscillation of spin polarization in a two-dimensional hole gas under a\n  perpendicular magnetic field", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0707.3140%2C0707.0646%2C0707.1146%2C0707.0876%2C0707.4373%2C0707.3027%2C0707.1820%2C0707.1872%2C0707.4424%2C0707.2281%2C0707.1868%2C0707.4677%2C0707.1193%2C0707.0295%2C0707.4496%2C0707.0990%2C0707.3356%2C0707.1650%2C0707.2008%2C0707.0391%2C0707.3665%2C0707.0329%2C0707.3801%2C0707.3442%2C0707.4258%2C0707.1805%2C0707.1738%2C0707.4076%2C0707.2075%2C0707.3723%2C0707.2644%2C0707.0887%2C0707.0151%2C0707.0196%2C0707.2842%2C0707.0194%2C0707.2359%2C0707.1733%2C0707.2006%2C0707.4078%2C0707.0529%2C0707.4552%2C0707.2408%2C0707.0632%2C0707.0140%2C0707.1403%2C0707.4574%2C0707.1762%2C0707.1155%2C0707.4120%2C0707.2341%2C0707.1954%2C0707.3218%2C0707.0270%2C0707.2265%2C0707.0269%2C0707.3762%2C0707.2554%2C0707.4159%2C0707.1209%2C0707.3754%2C0707.0592%2C0707.2398%2C0707.3480%2C0707.4298%2C0707.4658%2C0707.4322%2C0707.0829%2C0707.1228%2C0707.4164%2C0707.4336%2C0707.3418%2C0707.0181%2C0707.2038%2C0707.4627%2C0707.0890%2C0707.2167%2C0707.0401%2C0707.1355%2C0707.3532%2C0707.0038%2C0707.1138%2C0707.4295%2C0707.1744%2C0707.3077%2C0707.0412%2C0707.4458%2C0707.4615%2C0707.3253%2C0707.1177%2C0707.0851%2C0707.1150%2C0707.4312%2C0707.3092%2C0707.1158%2C0707.2224%2C0707.3415%2C0707.0496%2C0707.3968%2C0707.2567%2C0707.4470&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Oscillation of spin polarization in a two-dimensional hole gas under a\n  perpendicular magnetic field"}, "summary": "Spin-charge coupling is studied for a strongly confined two-dimensional hole\ngas subject to a perpendicular magnetic field. The study is based on\nspin-charge coupled drift-diffusion equations derived from quantum-kinetic\nequations in an exact manner. The spin-orbit interaction induces an extra\nout-of-plane spin polarization. This contribution exhibits a persistent\noscillatory pattern in the strong-coupling regime.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0707.3140%2C0707.0646%2C0707.1146%2C0707.0876%2C0707.4373%2C0707.3027%2C0707.1820%2C0707.1872%2C0707.4424%2C0707.2281%2C0707.1868%2C0707.4677%2C0707.1193%2C0707.0295%2C0707.4496%2C0707.0990%2C0707.3356%2C0707.1650%2C0707.2008%2C0707.0391%2C0707.3665%2C0707.0329%2C0707.3801%2C0707.3442%2C0707.4258%2C0707.1805%2C0707.1738%2C0707.4076%2C0707.2075%2C0707.3723%2C0707.2644%2C0707.0887%2C0707.0151%2C0707.0196%2C0707.2842%2C0707.0194%2C0707.2359%2C0707.1733%2C0707.2006%2C0707.4078%2C0707.0529%2C0707.4552%2C0707.2408%2C0707.0632%2C0707.0140%2C0707.1403%2C0707.4574%2C0707.1762%2C0707.1155%2C0707.4120%2C0707.2341%2C0707.1954%2C0707.3218%2C0707.0270%2C0707.2265%2C0707.0269%2C0707.3762%2C0707.2554%2C0707.4159%2C0707.1209%2C0707.3754%2C0707.0592%2C0707.2398%2C0707.3480%2C0707.4298%2C0707.4658%2C0707.4322%2C0707.0829%2C0707.1228%2C0707.4164%2C0707.4336%2C0707.3418%2C0707.0181%2C0707.2038%2C0707.4627%2C0707.0890%2C0707.2167%2C0707.0401%2C0707.1355%2C0707.3532%2C0707.0038%2C0707.1138%2C0707.4295%2C0707.1744%2C0707.3077%2C0707.0412%2C0707.4458%2C0707.4615%2C0707.3253%2C0707.1177%2C0707.0851%2C0707.1150%2C0707.4312%2C0707.3092%2C0707.1158%2C0707.2224%2C0707.3415%2C0707.0496%2C0707.3968%2C0707.2567%2C0707.4470&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Spin-charge coupling is studied for a strongly confined two-dimensional hole\ngas subject to a perpendicular magnetic field. The study is based on\nspin-charge coupled drift-diffusion equations derived from quantum-kinetic\nequations in an exact manner. The spin-orbit interaction induces an extra\nout-of-plane spin polarization. This contribution exhibits a persistent\noscillatory pattern in the strong-coupling regime."}, "authors": ["P. Kleinert", "V. V. Bryksin"], "author_detail": {"name": "V. V. Bryksin"}, "author": "V. V. Bryksin", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0953-8984/19/47/476205", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0707.2644v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0707.2644v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "11 pages and 1 figure", "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0707.2644v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0707.2644v1", "journal_reference": null, "doi": "10.1088/0953-8984/19/47/476205", "fulltext": "Oscillation of spin polarization in a two-dimensional hole gas\nunder a perpendicular magnetic field\n\narXiv:0707.2644v1 [cond-mat.mes-hall] 18 Jul 2007\n\nP. Kleinert1 and V.V. Bryksin2\n1\n\nPaul-Drude-Institut für Festkörperelektronik,\n\nHausvogteiplatz 5-7, 10117 Berlin, Germany\n2\n\nA.F. Ioffe Physical Technical Institute,\n\nPolitekhnicheskaya 26, 194021 St. Petersburg, Russia\n\nAbstract\nSpin-charge coupling is studied for a strongly confined two-dimensional hole gas subject to a\nperpendicular magnetic field. The study is based on spin-charge coupled drift-diffusion equations\nderived from quantum-kinetic equations in an exact manner. The spin-orbit interaction induces\nan extra out-of-plane spin polarization. This contribution exhibits a persistent oscillatory pattern\nin the strong-coupling regime.\nPACS numbers: 72.25.Dc, 73.63.Hs, 85.75.-d\n\n1\n\n\fINTRODUCTION\n\nRecently, the study of spin-polarized transport in semiconductors has received much attention because of its potential applications in the field of semiconductor spintronics. Many\nauthors have focused on spin-orbit interaction (SOI) that allows for purely electric manipulation of spin polarization in semiconductors. Beside this useful feature, SOI brings also into\nplay the undesired spin relaxation due to the coupling between the momentum of charge\ncarriers and their spin (c.f., for instance, Ref. [1]). Owing to this inhomogeneous broadening, each elastic and inelastic scattering mechanism opens up a spin dephasing channel [2].\nThe character of spin relaxation is quite different in systems with weak and strong SOI [3].\nIn the latter case, the magnetization can oscillate even in the absence of external fields. In\ncontrast, for weakly spin-orbit coupled systems, the spin polarization decays exponentially\nunless it is permanently stimulated by external fields.\nThe decay of spin polarization seems to be unavoidable because of the non-conservation of\nthe total spin. Nevertheless, a special persistent spin-precession pattern has been identified\nrecently [4]. The infinite spin lifetime of this persistent spin helix occurs in a combined\nRashba-Dresselhaus model at a certain wave vector that gives rise to a special spin rotation\nsymmetry. Furthermore, oscillations of the nonequilibrium spin density in real space, which\nis induced by the Rashba SOI, have been reported in a number of recent papers [5, 6,\n7]. These results on robust spin oscillations certainly encourage further experimental and\ntheoretical studies of long-lived spin coherence states [8] in semiconductors with SOI.\nIn this paper, we focus on a strongly confined two-dimensional hole gas (2DHG) and\nstudy the mutual influence of SOI and a perpendicular external magnetic field. It is well\nknown that a quantizing perpendicular magnetic field appreciably changes the transport\nproperties of a two-dimensional electron gas (2DEG). The quantized energy spectrum manifests in Shubnikov-de Haas oscillations of the resistivity and may lead to the quantum-Hall\neffect. Due to the SOI-induced splitting and crossing of Landau levels, a beating pattern\narises in Shubnikov-de Haas oscillations [9], which is used to determine the SOI strength\nfrom the measured magnetoresistivity. Similar quantum oscillations have been identified in\nthe spin-relaxation rate [10]. Other studies [11, 12, 13] deal with the combined effects of\nRashba and Dresselhaus SOI on the magnetotransport in a 2DEG. Unfortunately, comparable investigations of a 2DHG are limited although the SOI is much stronger in such systems.\n2\n\n\fWe mention the analysis of transport equations for the 2DHG at zero magnetic field [14],\nthe study of spin dephasing in p-type semiconductor quantum wells [15], and the treatment\nof the spin-Hall effect [16].\nOur work is aimed to study the spin-charge coupled motion of holes in narrow quantum wells subject to a perpendicular magnetic field. Based on a rigorous density-matrix\napproach, spin-charge coupled drift-diffusion equations are derived for the 2DHG. In order\nto focus on general physical properties of the SOI in semiconductors, we adopt the simple\ncubic Rashba model that has been used in the literature [17, 18, 19, 20, 21] to simulate the\nSOI in a 2DHG. This model has the striking peculiarity that there is no coupling between\nthe spin and charge components of the density matrix. One should contrast this finding\nwith the linear Rashba model, which is used to study effects of SOI in a 2DEG. In this\nmodel, the SOI leads to a coupling between spin and charge degrees of freedom. For a\n2DHG such a coupling is exclusively induced by external fields. Here, we treat a magnetic\nfield applied perpendicular to the layer. Due to this field, the charge density and out-ofplane spin polarization couple to each other in the 2DHG. Consequently, an inhomogeneous\nspin polarization induces charge gradients, which are accompanied by an induced internal\nelectric field calculated via Poisson's equation. The most interesting feature of our approach\nis, however, the observation that the character of the magnetic-field-induced spin-charge\ncoupling differs qualitatively in the weak and strong coupling regime. For weak SOI, the\ndephasing time becomes much larger than the momentum-relaxation time so that the dominating mechanism is spin diffusion. In this regime, the field-induced magnetization exhibits\nonly a smooth exponential dependence on spatial coordinates. Conversely, for strong SOI,\nthe ballistic spin-transport regime is established, in which oscillations of the out-of-plane\nmagnetization can occur. An experimental verification of this prediction would facilitate\nthe technological exploitation of these long-lived spin states for the fabrication of logical\ngates.\n\nBASIC THEORY\n\nWe treat coupled spin-charge excitations on the basis of an effective-mass Hamiltonian,\nwhich refers to the heavy-hole band of thin p-type quantum wells and which has been\nadopted in the literature [17, 18, 19, 20, 21] as an acceptable simple approximation. Our\n3\n\n\fmodel includes short-range spin-independent elastic scattering on impurities and a constant\nperpendicular magnetic field B, from which only the Zeeman splitting is considered. The\nrelated heavy-hole Hamiltonian of the cubic Rashba model has the second-quantized form\nH=\n\nX\nk,λ\n\na†kλ [εk − εF ] akλ −\n\nX\n\nk,λ,λ′\n\n~ λλ′ ) a†kλ akλ′ + u\n(~~\nωk * σ\n\nXX\nk,k′\n\na†kλ ak′ λ ,\n\n(1)\n\nλ\n\nwhere a†kλ (akλ ) denote the creation (annihilation) operators with in-plane quasi-momentum\nk = (kx , ky , 0) and spin λ. In Eq. (1), we introduced the Fermi energy εF , the vector of\n~ , and the strength u of the 'white-noise' elastic impurity scattering, which\nPauli matrices σ\ngives rise to the momentum relaxation time τ . The heavy-hole band is described by the\ndispersion relation εk = ~2 k2 /(2m). The coupling of spin states as described by\nh α\ni\nα 3\n3\n3\n3\n~~\nωk = i (k+\n− k−\n), (k+\n+ k−\n), ~ωc ,\n2\n2\n\n(2)\n\nis due to the Zeeman splitting ~ωc = g ∗ μB B/2 and the SOI, the strength of which is\ndenoted by α. In Eq. (2), we have k± = kx ± iky , kx = k cos(φ), ky = k sin(φ), and\n\n~ωk = αk 3 . Within the Born approximation with respect to elastic impurity scattering, the\nP\nP\nfour components (f, f~) = ( λ fλλ , λ,λ′ fλλ′ ~σλλ′ ) of the spin-density matrix fλλ′ satisfy the\n\nfollowing Laplace-transformed quantum-kinetic equations [22, 23]\nsf −\n\n1\ni~\n(κ * k)f + i~\nωκ(k) * f~ = (f − f ) + f0 ,\nm\nτ\n\ni~\nωκ(k)f\nsf~ + 2(~\nωk × f~) − (κ * k)f~ + i~\nm\n1\n1 ∂\n~~\nωk ∂\n= (f~ − f~) +\nf ~~\nωk −\nf + f~0 ,\nτ\nτ ∂εk\nτ ∂εk\n\n(3)\n\n(4)\n\nin which the SOI-dependent vector\n\u0002\n\u0003\n~~\nωκ(k) = 3α (ky2 − kx2 )κy − 2kx ky κx , (kx2 − ky2 )κx − 2kx ky κy , 0\n\n(5)\n\ncouples the spin and charge degrees of freedom to each other. The wave vector κ refers to the\ncenter-of-mass motion and disappears in models that refer to homogeneous spin and charge\ndistributions. Initial charge and spin densities are denoted by f0 = n and f~0 , respectively.\nThe cross line over k-dependent functions indicates an integration over the polar angle φ of\nthe in-plane vector k. s denotes the variable of the Laplace transformation and takes over\nthe role of the time parameter t.\n4\n\n\fBy treating the kinetic Eqs. (3) and (4) in the long-wavelength limit, coupled spincharge drift-diffusion equations are derived for the angle-averaged spin-density matrix (f , f~).\nThe method has already been applied to a 2DEG without any external fields [23]. In this\napproach, it is assumed that carriers quickly reestablish thermal equilibrium. This fact\njustifies the ansatz f (εk, κ | s) = n(εk)F (κ | s), where n(εk) denotes the Fermi distribution\nfunction. Expanding the solution of Eqs. (3) and (4) up to second order in κ and calculating\nthe integral over the angle φ, we obtain our main theoretical result namely the following\nspin-charge coupled drift-diffusion equations\n(s + D0 κ2 )f − Γz κ2 f z = n,\n\n(6)\n\n1\n+ Dz κ2 )f z + Γ0 f = fz0 ,\nτsz\n2\n2\ne κ2 )f y = (σ 2 + 2Ω2 )τ fx,0 ,\n(σ0 sτ + 2Ω (2sτ + 1))f x + Dx τ κ2 f x − 2σ0 ωc τ (1 + Dτ\n0\n(s +\n\ne κ2 )f x = (σ 2 + 2Ω2 )τ fy,0 ,\n(σ02 sτ + 2Ω2 (2sτ + 1))f y + Dx τ κ2 f y + 2σ0 ωc τ (1 + Dτ\n0\n\n(7)\n(8)\n(9)\n\nwhere we used the abbreviations σ0 = sτ + 1 and Ω = ωk τ . The k-dependent coefficients in\nthis set of equations have the form\nD\nD0 = 2 ,\nσ0\n1\n4Ω2\n=\n,\nτsz\nσ0 τ\nDx = D\n\n~ωc τ 2 σ02 + 2Ω2\nΓz = 24\nΩ 2 2\n,\nm\nσ0 (σ0 + 4Ω2 )2\n\nDz = D\n\nσ02 − 12Ω2\n,\n(σ02 + 4Ω2 )2\n\nσ06 + 24σ02 Ω4 + 32Ω6\n,\nσ02 (σ02 + 4Ω2 )2\n\nΓ0 = −\n\nχH\n,\nσ0 μB τsz\n\n2\n2\ne = D 4Ω − 3σ0 ,\nD\n(σ02 + 4Ω2 )2\n\n(10)\n(11)\n(12)\n\nwhere we introduced the diffusion coefficient D = v 2 τ /2, the Bohr magneton μB , and magnetic susceptibility χ. The Eqs. (6) to (9) completely decouple in the absence of the external\nmagnetic field, when Γz = Γ0 = ωc = 0. This is a peculiarity of the cubic Rashba model.\nWhen a perpendicular magnetic field is applied to the 2DHG, a steady-state out-of-plane\nspin polarization arises\nfz(0) = −~ωc n′ =\n\nχH\n,\nμB\n\n(13)\n\nwhich couples to the charge density. For a 2DEG the situation is different. In this case,\nthe out-of-plane spin polarization couples to the in-plane spin components [23]. The most\nsurprising feature of our solution exhibits the spin-diffusion coefficient Dz in Eq. (11), the\nform of which agrees with a recently published result [14, 23] derived by an alternative ap√\nproach. This particular diffusion coefficient becomes negative for strong SOI (Ω > σ0 / 12)\n5\n\n\findicating an instability of the spin system. In this regime, spin diffusion has the tendency\nto strengthen initial spin fluctuations. The competition between this self-strengthening and\nspin relaxation leads to undamped spin oscillations that are characteristic for ballistic spin\ntransport. Such spin oscillations result from the coupling between the charge density and the\nout-of-plane spin polarization expressed by Eqs. (6) and (7). What is interesting is that this\nunusual result for Dz can only be obtained by taking into account the off-diagonal elements\nof the density matrix. (In fact, neglecting fx and fy in Eq. (4), we obtain simply Dz = D).\nTherefore, the oscillations in the strong SOI regime have a pure quantum-mechanical origin\nthat is manifested in the quasi-classical Eqs. (6) and (7). Strictly speaking, this result arises\nbeyond the applicability of the drift-diffusion approach [23, 24].\nThe time dependence of the in-plane spin polarization as described by Eqs. (8) and (9) is\ngoverned by characteristic poles [22, 25] that are calculated from σ02 sτ + 2Ω2 (2sτ + 1) = 0.\nLet us treat the strong-coupling regime Ω ≫ 1 for the in-plane spin polarization that is\ndetermined by poles at sτ = −3/4 ± 2iΩ. Performing the inverse Laplace and Fourier\ntransformations, we obtain for the spectral spin polarization the result\n\u0015\n\u0014\no\n3t n cos(2ωk t)\nωc τ\nr2\n−\nfx0 −\nsin(2ωk t)fy0 /(32πD),\n(14)\nf x (r, k | t) = exp −\n16Dt 4τ\nt/τ\n2Ω\n\u0014\n\u0015\no\nr2\n3t n cos(2ωk t)\nωc τ\nf y (r, k | t) = exp −\n−\nfy0 +\nsin(2ωk t)fx0 /(32πD),\n(15)\n16Dt 4τ\nt/τ\n2Ω\nwhich describes damped oscillations of an initially at r = 0 injected spin packet. The\nexternal magnetic field couples initial nonvanishing in-plane spin components to each other.\nA spot like initial in-plane spin polarization could be produced in experiment by a short\nlaser pule. The evolution of this initial inhomogeneous spin distribution is described by\nEqs. (14) and (15).\n\nSPIN POLARIZATION FOR A STRIPE GEOMETRY\n\nIn this Section, the magnetic-field-induced coupling between the charge distribution f\nand the out-of-plane spin polarization f z in a 2DHG is treated in more detail for a stripe of\nwidth 2L oriented along the x axis. To this end, the steady-state solution (s = 0, σ0 = 1)\nof Eqs. (6) and (7) is transformed back to the representation in spatial coordinates x and\ny. Due to the considered stripe geometry, the densities are independent of x. The variation\nof the charge density f (k, y) induces a self-consistent internal electric field Ey (k, y) that is\n6\n\n\fcalculated from the Poisson equation. This internal in-plane electric field is a by-product of\nthe spin-charge coupling. Its reaction on the spin is accounted for by drift terms in Eqs. (6)\nand (7). Its phenomenological consideration in Eq. (6) for the carrier density is ruled by\nthe concept of effective chemical potential [22]. Motivated by studies of electric-field effects\non spin transport, we introduce a similar contribution in Eq. (7) for the out-of-plane spin\npolarization. Putting all together, the following set of coupled equations for spin-charge\nexcitations are obtained\n′\n\n′\n\nD(k)f (k, y) − μEy (k, y)f (k, y) − Γz (k)f z (k, y) = 0,\n′′\n\n′\n\nDz (k)f z (k, y) − μEy (k, y)f z (k, y) −\nEy′ (k, y) =\n\n1\nf (k, y) − Γ0 (k)f (k, y) = 0,\nτsz (k) z\n\n4πe\n(f (k, y) − n(k)),\nε\n\n(16)\n(17)\n(18)\n\nin which μ = eτ /m denotes the mobility and ε is the dielectric constant. Primes indicate\nderivatives with respect to y. We derive an analytical solution of these equations by calculating the lowest-order contributions in the induced electric field Ey . Within this perturbational\n(0)\n\nschema, we make the ansatz f = n + ∆f and f z = fz + ∆f z , where the corrections result\nfrom the spin-charge coupling ∆f , ∆f z ∼ Ey . In addition, hard-wall boundary conditions\n∆f z (±L) = 0 and the existence of interface charges Ey (±L) = ±E0 are assumed. We obtain\nthe analytic solution\n∆f z =\n\nλ1 λ2 E0 Γ0 cosh(λ2 L) cosh(λ1 y) − cosh(λ1 L) cosh(λ2 y) Ey\nN(y)\n=\n,\n,\n4πe/ε\nN(L)\nE0\nN(L)\n\nwhere λ1,2 are calculated from the secular equation\n\u0013\n\u0013\u0012\n\u0012\n1\n4πe\n2\n2\n− λ2 Γ0 Γz = 0.\nμn\nDz λ −\nDλ −\nε\nτsz\n\n(19)\n\n(20)\n\nIn Eq. (19), the abbreviation\n\u0013\n\u0012\n\u0013\n\u0012\n1\n1\n2\n2\ncosh(λ2 L) sinh(λ1 y)−λ1 Dz λ2 −\ncosh(λ1 L) sinh(λ2 y) (21)\nN(y) = λ2 Dz λ1 −\nτsz\nτsz\nwas introduced. For weak magnetic fields ωc τ ≪ 1, we obtain the final result\n∆fz (εk, y) = −\nwith\n\nn cosh(y/L )\neE0 χHλ21 L3D\ncosh(λ1 y) o dn(εk)\nD\ncoth(L/L\n)\n−\n,\nD\nμB (1 − (λ1 LD )2 )\ncosh(L/LD ) cosh(λ1 L)\ndεk\np\nλ1 = 1/ Dz τsz ,\n\nλ2 =\n7\n\np\n4πeμn/(Dε) = L−1\nD ,\n\n(22)\n\n(23)\n\n\f>\n< ∆f z > / < fz\n\n(0)\n\n0.04\n\n0.02\n\n0\n\n−0.02\n\n−0.04\n−20\n\n−10\n\n0\n\n10\n\n20\n\nkF y\nFIG. 1: SOI-induced out-of-plane spin polarization obtained from Eq. (22) by integrating over εk\n(indicated by < . . . >). At zero temperature, all quantities are calculated at the Fermi momentum\nkF . Parameters used in the calculation are: kF = 0.1 nm−1 , mα/~2 = 2 nm, E0 = 100 V/cm,\nand n = 1015 /cm3 . The thick and thin lines refer to weak (Ω = 0.173, τ = 0.05 ps) and strong\n(Ω = 0.34, τ = 0.1 ps) spin-orbit coupling, respectively.\n\nwhere LD denotes the Debye screening length. Again, we meet a peculiarity of the cubic\nRashba model for a 2DHG. The final integral over the energy εk is easily calculated at low\ntemperatures. Due to the factor dn(εk)/dεk, the field-induced spin polarization is exclusively\ndetermined by energies at the Fermi surface for a degenerate hole gas. Therefore, the recently\nstudied inhomogeneous broadening [15] due to elastic scattering is ineffective in this regime.\nHowever, inelastic scattering, which we disregarded in this work, may play an essential role\nfor the formation of a persistent oscillatory spin pattern at strong SOI.\nThe character of the solution for the out-of-plane spin polarization mainly depends on the\n√\nstrength of the SOI. In weakly coupled systems (Ω < 1/ 12, Dz > 0), the spin polarization\nexhibits an exponential dependence as shown by the thick line in Fig. 1. The self-consistent\ncoupling between spin and charge degrees of freedom leads to an excess magnetization at the\nboundaries of the stripe. The picture changes dramatically, when we consider the strong√\ncoupling regime (Ω > 1/ 12, Dz < 0). In this case, the wave number λ1 becomes imaginary\ngiving rise to spin-coherent oscillations. An example for this persistent spin pattern is\nshown by the thin line in Fig. 1. Despite the included elastic scattering on impurities,\n\n8\n\n\fthe spin lifetime of these oscillations is infinite in the strong-coupling regime. Moreover,\nthe oscillation amplitude is considerably enhanced at the resonance λ1 L = (2n + 1)π/2\nwith n being any integer. A similar enhancement has been predicted for the SOI-induced\nzitterbewegung [26]. This observation also remind of a Fabry-Perot interferometer in optics.\nLike the finesse of the interferometer diverges for perfect reflective mirrors, the amplitude of\nthe spin oscillations becomes infinite for the above mentioned particular values of the spinorbit coupling and the width of the stripe. This idealized behavior indicates that beside\nelastic scattering on impurities also other spin-relaxation mechanisms have to be taken into\naccount for a more realistic description of spin excitations at strong SOI. The experimental\nobservation of the interesting persistent oscillatory spin structure is certainly challenging.\nIt requires a spin detection set up with a high spatial resolution (the typical wavelength of\nthe oscillations is of the order of 100 nm). As the magnetic field leads to a coupling between\nthe out-of-plane spin polarization and the charge density, both the induced internal electric\nfield and the charge density exhibit similar oscillations in the strong coupling regime.\n\nSUMMARY\n\nWe studied a 2DHG with SOI and elastic impurity scattering under the influence of a perpendicular magnetic field. Applying an exact procedure, spin-charge coupled drift-diffusion\nequations were derived from quantum-kinetic equations for the spin-density matrix. The\nmagnetic field mainly causes a coupling between the out-of-plane spin polarization and the\ncharge density. The character of effects that result from this coupling strongly depend on\n√\nthe strength of the SOI. For weak SOI (Ω < 1/ 12), spin diffusion gives rise to an exponential decay of an initial spin polarization. In contrast, for strong SOI, the spin transport\nexhibits ballistic character so that oscillations of the magnetization can occur. This general\nconclusion was illustrated by a treatment of the spin polarization in a stripe composed of\na 2DHG. The magnetic field induces a background magnetization that is superimposed by\na contribution stemming from the SOI. The excess magnetization, which results from the\nspin-charge coupling, exhibits a persistent oscillatory spin pattern for systems with strong\nspin-orbit coupling. Similar standing and propagating spin oscillations with wavelength\ndown to several nanometers have been treated for thin magnetic film samples [27]. The application of this mechanism for spin-wave logic gates depends on whether short-wavelength\n9\n\n\fspin oscillations can be manipulated and detected by a suitable experimental set up.\nThis work was supported by the Deutsche Forschungsgemeinschaft and the Russian Foundation of Basic Research.\n\nReferences\n\n[1] W. Xu, P. Vasilopoulos, and X. F. Wang, Semicond. Sci. Technol. 19, 224 (2004).\n[2] M. W. Wu and H. Metiu, Phys. Rev. B 61, 2945 (2000).\n[3] O. Bleibaum, Phys. Rev. B 71, 195329 (2005).\n[4] B. A. Bernevig, J. Orenstein, and S. C. Zhang, Phys. Rev. Lett. 97, 236601 (2006).\n[5] J. Wang, K. S. Chan, and D. Y. Xing, Phys. Rev. B 73, 033316 (2006).\n[6] Y. Jiang, Phys. Rev. B 74, 195308 (2006).\n[7] P. Brusheim and H. Q. Xu, Phys. Rev. B 74, 205307 (2006).\n[8] Y. V. Pershin, Phys. Rev. B 71, 155317 (2005).\n[9] X. F. Wang and P. Vasilopoulos, Phys. Rev. B 67, 085313 (2003).\n[10] A. A. Burkov and L. Balents, Phys. Rev. B 69, 245312 (2004).\n[11] J. Schliemann, J. C. Egues, and D. Loss, Phys. Rev. B 67, 085302 (2003).\n[12] W. Yang and K. Chang, Phys. Rev. B 73, 045303 (2006).\n[13] D. Zhang, J. Phys. A: Math. Gen. 39, (2006).\n[14] T. L. Hughes, Y. B. Bazaliy, and B. A. Bernevig, Phys. Rev. B 74, 193316 (2006).\n[15] C. Lü, J. L. Cheng, and M. W. Wu, Phys. Rev. B 73, 125314 (2006).\n[16] M. W. Wu and J. Zhou, Phys. Rev. B 72, 115333 (2005).\n[17] L. G. Gerchikov and A. V. Subashiev, Sov. Phys. Semicon. 26, 73 (1992).\n[18] R. Winkler, H. Noh, E. Tutuc, and M. Shayegan, Phys. Rev. B 65, 155302 (2002).\n[19] B. Habib, E. Tutuc, S. Melinte, M. Shayegan, D. Wassermann, and S. A. Lyon, Appl. Phys.\nLett. 85, 3151 (2004).\n[20] J. Schliemann and D. Loss, Phys. Rev. B 71, 085308 (2005).\n[21] S. Y. Liu and X. L. Lei, Phys. Rev. B 72, 155314 (2005).\n[22] V. V. Bryksin and P. Kleinert, Phys. Rev. B 73, 165313 (2006).\n\n10\n\n\f[23] V. V. Bryksin and P. Kleinert, Phys. Rev. B 75, 205317 (2007).\n[24] T. D. Stanescu and V. Galitski, Phys. Rev. B 75, 125307 (2007).\n[25] E. G. Mishchenko, A. V. Shytov, and B. I. Halperin, Phys. Rev. Lett. 93, 226602 (2004).\n[26] J. Schliemann, D. Loss, and R. M. Westervelt, Phys. Rev. Lett. 94, 206801 (2005).\n[27] V. V. Kruglyak and R. J. Hicken, J. Magn. Magn. Mater. 306, 191 (2006).\n\n11\n\n\f"}