{"id": "http://arxiv.org/abs/1005.5565v1", "guidislink": true, "updated": "2010-05-30T23:23:38Z", "updated_parsed": [2010, 5, 30, 23, 23, 38, 6, 150, 0], "published": "2010-05-30T23:23:38Z", "published_parsed": [2010, 5, 30, 23, 23, 38, 6, 150, 0], "title": "Loop quantum cosmology of Bianchi type IX models", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.0387%2C1005.0060%2C1005.4007%2C1005.5150%2C1005.5161%2C1005.3746%2C1005.4515%2C1005.4210%2C1005.0138%2C1005.0424%2C1005.2489%2C1005.0146%2C1005.1473%2C1005.5429%2C1005.1465%2C1005.2292%2C1005.5050%2C1005.1919%2C1005.4451%2C1005.0784%2C1005.5375%2C1005.1732%2C1005.1316%2C1005.0098%2C1005.4169%2C1005.3064%2C1005.5489%2C1005.3476%2C1005.1370%2C1005.2160%2C1005.4620%2C1005.5155%2C1005.0892%2C1005.0456%2C1005.2617%2C1005.0795%2C1005.2627%2C1005.3508%2C1005.3740%2C1005.4110%2C1005.1756%2C1005.1045%2C1005.1894%2C1005.5565%2C1005.0884%2C1005.1970%2C1005.0865%2C1005.3334%2C1005.0906%2C1005.3715%2C1005.2982%2C1005.3375%2C1005.4302%2C1005.2829%2C1005.2446%2C1005.2101%2C1005.2562%2C1005.1981%2C1005.4744%2C1005.3442%2C1005.5443%2C1005.3984%2C1005.1363%2C1005.3563%2C1005.3158%2C1005.1068%2C1005.2544%2C1005.1038%2C1005.1659%2C1005.2515%2C1005.4168%2C1005.1510%2C1005.4001%2C1005.0967%2C1005.3180%2C1005.2783%2C1005.0256%2C1005.1726%2C1005.3936%2C1005.2356%2C1005.0074%2C1005.1787%2C1005.1013%2C1005.0593%2C1005.4114%2C1005.3004%2C1005.1516%2C1005.2260%2C1005.5254%2C1005.1685%2C1005.2186%2C1005.4715%2C1005.4625%2C1005.0452%2C1005.3430%2C1005.1927%2C1005.3756%2C1005.0536%2C1005.3603%2C1005.4559%2C1005.4141&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Loop quantum cosmology of Bianchi type IX models"}, "summary": "The loop quantum cosmology \"improved dynamics\" of the Bianchi type IX model\nare studied. The action of the Hamiltonian constraint operator is obtained via\ntechniques developed for the Bianchi type I and type II models, no new input is\nrequired. It is shown that the big bang and big crunch singularities are\nresolved by quantum gravity effects. We also present the effective equations\nwhich provide modifications to the classical equations of motion due to quantum\ngeometry effects.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.0387%2C1005.0060%2C1005.4007%2C1005.5150%2C1005.5161%2C1005.3746%2C1005.4515%2C1005.4210%2C1005.0138%2C1005.0424%2C1005.2489%2C1005.0146%2C1005.1473%2C1005.5429%2C1005.1465%2C1005.2292%2C1005.5050%2C1005.1919%2C1005.4451%2C1005.0784%2C1005.5375%2C1005.1732%2C1005.1316%2C1005.0098%2C1005.4169%2C1005.3064%2C1005.5489%2C1005.3476%2C1005.1370%2C1005.2160%2C1005.4620%2C1005.5155%2C1005.0892%2C1005.0456%2C1005.2617%2C1005.0795%2C1005.2627%2C1005.3508%2C1005.3740%2C1005.4110%2C1005.1756%2C1005.1045%2C1005.1894%2C1005.5565%2C1005.0884%2C1005.1970%2C1005.0865%2C1005.3334%2C1005.0906%2C1005.3715%2C1005.2982%2C1005.3375%2C1005.4302%2C1005.2829%2C1005.2446%2C1005.2101%2C1005.2562%2C1005.1981%2C1005.4744%2C1005.3442%2C1005.5443%2C1005.3984%2C1005.1363%2C1005.3563%2C1005.3158%2C1005.1068%2C1005.2544%2C1005.1038%2C1005.1659%2C1005.2515%2C1005.4168%2C1005.1510%2C1005.4001%2C1005.0967%2C1005.3180%2C1005.2783%2C1005.0256%2C1005.1726%2C1005.3936%2C1005.2356%2C1005.0074%2C1005.1787%2C1005.1013%2C1005.0593%2C1005.4114%2C1005.3004%2C1005.1516%2C1005.2260%2C1005.5254%2C1005.1685%2C1005.2186%2C1005.4715%2C1005.4625%2C1005.0452%2C1005.3430%2C1005.1927%2C1005.3756%2C1005.0536%2C1005.3603%2C1005.4559%2C1005.4141&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The loop quantum cosmology \"improved dynamics\" of the Bianchi type IX model\nare studied. The action of the Hamiltonian constraint operator is obtained via\ntechniques developed for the Bianchi type I and type II models, no new input is\nrequired. It is shown that the big bang and big crunch singularities are\nresolved by quantum gravity effects. We also present the effective equations\nwhich provide modifications to the classical equations of motion due to quantum\ngeometry effects."}, "authors": ["Edward Wilson-Ewing"], "author_detail": {"name": "Edward Wilson-Ewing"}, "author": "Edward Wilson-Ewing", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.82.043508", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1005.5565v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1005.5565v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "20 pages", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1005.5565v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1005.5565v1", "journal_reference": "Phys.Rev.D82:043508,2010", "doi": "10.1103/PhysRevD.82.043508", "fulltext": "Loop quantum cosmology of Bianchi type IX models\nEdward Wilson-Ewing∗\n\narXiv:1005.5565v1 [gr-qc] 30 May 2010\n\nInstitute for Gravitation and the Cosmos, Physics Department,\nThe Pennsylvania State University, University Park, PA 16802, USA\nThe loop quantum cosmology \"improved dynamics\" of the Bianchi type IX model\nare studied. The action of the Hamiltonian constraint operator is obtained via\ntechniques developed for the Bianchi type I and type II models, no new input is\nrequired. It is shown that the big bang and big crunch singularities are resolved\nby quantum gravity effects. We also present the effective equations which provide\nmodifications to the classical equations of motion due to quantum geometry effects.\nPACS numbers: 98.80.Qc,04.60.Pp,04.60.-m\n\nI.\n\nINTRODUCTION\n\nLoop quantum cosmology (LQC) [1, 2] is an approach to quantum cosmology following\nthe ideas of loop quantum gravity (LQG) [3–5]. One of the major results of LQC in the\nhomogeneous and isotropic Friedmann-Robertson-Walker (FRW) models is that, while general relativity approximates the dynamics very well in the low (with respect to the Planck\nscale) curvature regime, the classical big bang singularity is avoided: when the matter energy density approaches the Planck energy density, deviations from general relativity become\nsignificant and a \"quantum bounce\" due to quantum gravity effects occurs when the matter\nenergy density reaches a critical energy density of the order of the the Planck density [6–14].\nMore recently, it has been shown that the singularity is also resolved in the improved dynamics approach of loop quantum cosmology in the anisotropic Bianchi type I and type II\ncosmological models [15, 16] and in the hybrid loop-Fock quantization of the inhomogeneous\nGowdy model [17]. The goal of this paper is to extend the LQC improved dynamics analysis\nof the Bianchi type I and type II models to the more complicated Bianchi type IX models.\nAt the classical level, the Bianchi IX model has a much richer phenomenology than\nBianchi I and II models as it displays Mixmaster dynamics as the singularity is approached\n[18]. In essence, a space-time which exhibits Mixmaster dynamics is one which can be described for long periods of time (known as epochs) as a Bianchi I space-time characterized\nby three anisotropic expansion rates. Such a space-time will occasionally undergo a \"Mixmaster bounce\" from one epoch to another where the three expansion rates change in a\nspecific manner. Bianchi I models approach the singularity in a rather straightforward way\nas they do not undergo any Mixmaster bounces while Bianchi II models may undergo a\nsingle Mixmaster bounce between two epochs as the singularity is approached (see [18] and\nreferences therein). The Bianchi IX model, on the other hand, undergoes many Mixmaster\nbounces and this behaviour is chaotic [18, 19]. Since much of this behaviour occurs when\nthe curvature is of the Planck scale, quantum gravity effects cannot be neglected and the\nMixmaster behaviour may be significantly modified when they are taken into account.\n∗\n\nElectronic address: wilsonewing@gravity.psu.edu\n\n\f2\nBianchi IX models are also thought to play an important role near generic singularities\nin classical general relativity. The Belinskii, Khalatnikov, Lifshitz (BKL) conjecture suggests that as a generic space-like singularity is approached, time derivatives dominate over\nspatial derivatives whence physical fields at each point evolve independently from those at\nneighbouring points. Dynamics can therefore be approximated by the ODE's used in homogeneous space-times, most generally a Bianchi IX solution with a massless scalar field\n[20, 21]. Since other matter fields do not contribute to the dynamics as the singularity is\napproached, we will only consider the case of a massless scalar field in this work. There has\nrecently been a considerable amount of numerical work supporting this paradigm (see, e.g.,\n[18]) and the conjecture has also been rewritten in terms of variables suitable to a loop quantization [22]. If the BKL conjecture is indeed correct, it follows that a good understanding\nof the quantum dynamics of the Bianchi IX model in the deep quantum regime could lead\nto major insights into the behaviour of generic space-times in regions where the curvature\nreaches the Planck scale.\nBecause of the Bianchi IX model's importance, it has already been the subject of studies\nwithin the framework of loop quantum cosmology, both in a pre-μo -type Hamiltonian framework [23, 24] and in a spin-foam-inspired dipole cosmology model (first introduced for the\nisotropic case in [12]) which also allows inhomogeneities [25]. However, it is important to\nstudy the improved μ̄i -type dynamics of LQC since it has been shown that the predictions\nof the pre-μo approach are unphysical in the infrared limit. In particular, in isotropic cosmological models quantum gravity effects can become important at energy densities arbitrarily\nbelow the Planck scale in this scheme. To ensure that quantum gravity effects only become\nimportant at the Planck scale, one must instead use the improved dynamics approach in the\nHamiltonian framework1 . On the other hand, since the dipole cosmology model presented\nin [25] is inspired by spin foam models, that approach is complementary to ours and it will\nbe interesting to compare the results of these two frameworks.\nAs pointed out above, chaotic behaviour appears as the singularity is approached in\nclassical Bianchi IX space-times. It has been argued in the pre-μo LQC treatment of the\nmodel that this behaviour is avoided in LQC due to quantum gravity effects [24]. In essence,\nthe argument is that quantum gravity effects become important before a significant number\nof Mixmaster bounces occur. Since the quantum gravity effects are repulsive, the space-time\nwill exit the Planck regime having only undergone a small number of Mixmaster bounces\nand hence the dynamics are not chaotic. In this paper, we see that in some cases this occurs\nalready in the effective theory which incorporates the quantum geometry effects into the\ndynamics. However, we cannot yet show that this is a generic result. We will go into more\ndetail in Sec. IV.\nThe outline of the paper is as follows. In Sec. II, we will briefly review the necessary\nclassical properties of the Bianchi type IX model in order to proceed with the quantization.\nIn Sec. III we will study the quantum properties of the model, first recalling the kinematics\nwhich are the same as for the Bianchi type I and type II models studied in [15, 16]. We will\nthen study the Hamiltonian constraint operator for the Bianchi IX model with a massless\nscalar field as the matter field. The Hamiltonian constraint operator gives an evolution\nequation where the scalar field acts as a relational time parameter. The dynamics of the\nmodel are obtained by using the same technology that was developed during the study of the\n1\n\nIt is possible that once the curvature reaches the Planck scale a scheme other than μ̄i may be the correct\none but we will only consider the μ̄i scheme here.\n\n\f3\nimproved LQC dynamics of the Bianchi type I and type II models [15, 16]; there is no need\nto introduce any new operators. In Sec. IV we will derive effective equations which provide\nthe first order quantum corrections to the classical equations of motion and in Sec. V we\nsummarize our results and discuss open issues.\nII.\n\nCLASSICAL THEORY\n\nIn Bianchi models [26–28], one restricts oneself to those phase space variables which admit\na 3-dimensional group of symmetries which act simply and transitively. The symmetries\nallowed in the Bianchi IX group are the three spatial rotations on S 3 . It follows that the\nthree Killing (left invariant) vector fields  ̊\nξia satisfy2\n2\n[ ̊\nξi ,  ̊\nξj ] = ǫ̊k ij  ̊\nξk ,\nro\n\n(2.1)\n\nwhere the structure constants are given by the completely antisymmetric tensor ǫ̊ijk times\n2/ro where ro is the radius of the 3-sphere with respect to the fiducial metric. ǫ̊ijk is defined\nsuch that ǫ̊123 = 1, note that the internal indices i, j, k, . . . can always be freely raised and\nlowered. There is also a canonical triad e̊ai -the right invariant vector fields- which is Lie\ndragged by  ̊\nξia . It is convenient to use e̊ai and its dual co-triad ω̊ai as fiducial frames and\nco-frames. They satisfy:\n[e̊i , e̊j ] = −\n\n2 k\nǫ̊ ij e̊k ,\nro\n\nd ω̊ k =\n\n1 k i\nǫ̊ ij ω̊ ∧ ω̊ j .\nro\n\n(2.2)\n\nThe form of the equations above indicates that M admits global coordinates α ∈\n[0, 2π), β ∈ [0, π) and γ ∈ [0, 4π) such that for ro = 2 the Bianchi IX co-triads have the form\nω̊a1 = sin β sin γ(dα)a + cos γ(dβ)a ,\nω̊a2 = − sin β cos γ(dα)a + sin γ(dβ)a ,\nω̊a3 = cos β(dα)a + (dγ).\n\n(2.3)\n\nThe fiducial co-triads determine a fiducial 3-metric q̊ab := ω̊ai ω̊bi ,\nq̊ab dxa dxb = dα2 + dβ 2 + dγ 2 + 2 cos βdαdγ.\n\n(2.4)\n\n√\nIt follows that q̊ = sin β and one can see that q̊ab is the metric of a 3-sphere with a volume\nVo = 16π 2 , this agrees with Vo = 2π 2 ro3 for ro = 2 as specified above. Finally, we introduce\n1/3\nthe length-scale lo = Vo for later convenience.\nIn diagonal Bianchi models, the physical triads eai are related to the fiducial ones by3\nωai = ai (τ )ω̊ai\n2\n\n3\n\nand\n\nai (τ )eai = e̊ai ,\n\n(2.5)\n\nHere we are following the convenctions used in [25]. A different, although equivalent, choice is used in\n[10, 23, 24] where the structure constants differ by an overall sign.\nThere is no sum if repeated indices are both covariant or contravariant. As usual, the Einstein summation\nconvention holds if a covariant index is contracted with a contravariant index.\n\n\f4\nwhere the ai are the three directional scale factors.\nFor later use, let us calculate the spin connection determined by physical triads eai . Since\nΓia is given by\n\u0013\n\u0012\n1 c l\ni\nijk b\n(2.6)\nΓa = −ǫ ej ∂[a ωb]k + ek ωa ∂[c ωb]l ,\n2\nit follows that\n\nΓ1a\n\nε\n=\nro\n\n\u0012\n\na21\na2 a3\n−\n−\na2 a3 a3 a2\n\n\u0013\n\nω̊a1 ,\n\n(2.7)\n\nwhere ε := ǫ123 is +1 for right-handed physical triads and −1 for left-handed physical triads.\nNote that while the ǫ̊ijk appearing in the Bianchi IX structure constants are not affected\nby the handedness of the physical triads, ǫijk and ε on the other hand are affected by the\nhandedness of eai . Γ2a and Γ3a can be obtained by permutations of Eq. (2.7).\nAs is usual in LQC, we will now use the fiducial triads and co-triads in order to introduce\na convenient parametrization of the phase space variables Eia and Aia . Because we have\nrestricted ourselves to the diagonal model and these fields are symmetric under the Bianchi\nIX group, from each equivalence class of gauge related phase space variables we can choose\na pair of the form\npi p\nci\nEia = 2 q̊ e̊ai\nand\nAia = ω̊ai ,\n(2.8)\nlo\nlo\nwhere, as spelled out in footnote 3, there is no sum over i. Note that the length lo plays a\nsimilar role to that of the lengths of the fiducial cell in noncompact space-times in terms of\nthe form of the basic variables (A, E). In this case the manifold is compact and there is no\nfiducial cell.\nIt is straightforward to relate the scale factors ai to the pi :\n\np1 = sgn(a1 )|a2 a3 |l2o ,\np2 = sgn(a2 )|a1 a3 |l2o ,\np3 = sgn(a3 )|a1 a2 |l2o ,\n(2.9)\np\np\n√\nit follows that |q| = |p1 p2 p3 |Vo−1 q̊.\nThus, a point in the phase space is now coordinatized by six real numbers (pi , ci ). One\ncan use the symplectic structure in full general relativity to induce a symplectic structure\non the six-dimensional phase space. The non-zero Poisson brackets are given by\n{ci , pj } = 8πGγ δij ,\n\n(2.10)\n\nwhere γ is the Barbero-Immirzi parameter.\nOur choice (2.8) of physical triads and connections has fixed the internal gauge as well\nas the diffeomorphism freedom. Furthermore, it is easy to explicitly verify that the Gauss\nand the diffeomorphism constraints are automatically satisfied due to Eq. (2.8). Thus we\nare left with the Hamiltonian constraint\nZ h\n\u0011\ni\n−NEia Ejb ij \u0010 k\np ǫ k Fab − (1 + γ 2 )Ωab k + NHmatt d3 x ≈ 0,\nCH =\n(2.11)\n2\n|q|\nM 16πGγ\n\nwhere Fab k and Ωab k are the curvature of Aia and Γia respectively, while Hmatt is the matter\nHamiltonian density. The ≈ 0 indicates that CH is a constraint and must vanish for physical\nsolutions. Since we are most interested in the gravitational sector, our matter field will\nconsist only of a massless scalar field T which will later serve as a relational time variable\n\n\f5\nà la Liebniz. (Additional matter fields can be incorporated in a straightforward manner,\nmodulo possible intricacies of essential self-adjointness.) Thus,\nHmatt =\n\n1 p2T\np .\n2 |q|\n\n(2.12)\n\nSince we want to use the massless scalar field as relational time, it is convenient to\nuse a harmonic-time gauge, i.e., assume\np that the time coordinate τ satisfies \u0003τ = 0. The\ncorresponding lapse function is N = |p1 p2 p3 |. With this choice, the Hamiltonian constraint\nsimplifies considerably.\nIn terms of pi , the first component of the spin connection is given by\n\u0012\n\u0013\nε p2 p3 p2 p3\n1\nΓa =\n−\nω̊a1,\n(2.13)\n−\nro\np21\np3 p2\nthe other two spin connection components can be obtained via permutations. The curvature\nof Γia is in turn\nΩab 1 = 2∂[a Γ1b] + ǫ1 jk Γja Γkb\n\u0013\n\u0012\n2ε\np2 p3\np2\np3 p21 p2 p21 p3\np21\n2 3\n= 2 3 2 +2\nω̊b] ,\n− 2 − 2 − 3 − 3 ω̊[a\nro\np1\np2 p3\np3\np2\np3\np2\n\n(2.14)\n\nthe other components of Ωab k can again be obtained via permutations.\nFinally, it is straightforward to calculate the curvature of Aia . For example,\nFab 1 = 2∂[a A1b] + ǫ1 jk Aja Akb\n\u0012\n\u0013\n2c1\nεc2 c3\n2 3\n= 2\nω̊[a\nω̊b] .\n+ 2\nl o ro\nlo\n\n(2.15)\n\nUsing these results, one finds that the Hamiltonian constraint (2.11) is given by\nCH = −\n\n\u0001\n1\n2lo ε\np 1 p 2 c1 c2 + p 2 p 3 c2 c3 + p 3 p 1 c3 c1 +\np 1 p 2 c3 + p 2 p 3 c1 + p 3 p 1 c2\n2\n8πGγ\nro\n!\n\u0014\n\u0010 p p \u00112 \u0010 p p \u00112 \u0010 p p \u00112 \u0015\nl2o\n1\n2\n2\n3\n3\n1\n−\n−\n+ 2 (1 + γ 2 ) 2p21 + 2p22 + 2p23 −\nro\np3\np1\np2\n1\n+ p2T ≈ 0.\n2\n\n(2.16)\n\nNote that the constraint for the closed isotropic case is recovered for p1 = p2 = p3 while\nthe Bianchi I constraint is recovered in the limit ro → ∞ or, equivalently, lo → 0. We will\ntake advantage of this correspondence and set ro = 2 for the remainder of the paper. The\nBianchi I limit can be obtained by taking lo → 0.\nOne can now derive the time evolution of any classical observable O by taking its Poisson\nbracket with CH :\nȮ = {O, CH } ,\n(2.17)\n\nwhere the 'dot' stands for derivative with respect to the harmonic time τ . This gives\n\u0012\n\u0013\np1\np2 p3\np ̇1 =\np 2 c2 + p 3 c3 + l o ε\n,\n(2.18)\nγ\np1\n\n\f6\n\u0013!\n\u0012\np22 p23 p1 p22 p1 p23\n1\n2\n2\n. (2.19)\np2 c1 c2 + p3 c1 c3 + lo ε(p2 c3 + p3 c2 ) + lo (1 + γ ) p1 + 3 − 2 − 2\nc ̇1 = −\nγ\n2p1\n2p3\n2p3\nAs usual, the other equations of motion can be obtained by permutations. Any initial data\nsatisfying the Hamiltonian constraint can be evolved by these equations of motion. It is\nparticularly interesting to study the Hubble rates Hi which are given by\nHi =\n\n1 dai\n,\nai dt\n\n(2.20)\n\nwhere t is the proper time and is related to the harmonic time τ (which is the time coordinate\nused until now) by\nd\nd\n1\n=p\n.\n(2.21)\ndt\n|p1 p2 p3 | dτ\nIt follows that the Hubble rates are related to the (ci , pi ) by, e.g.,\n\u0012\n\u0013\np\nl o p2 p3 p1 p2 p1 p3\n−\n−\n.\nc1 p1 = γ |p1 p2 p3 |H1 +\n2\np1\np3\np2\n\n(2.22)\n\nThe mean Hubble rate H of the mean scale factor a = (a1 a2 a3 )1/3 is given by\nH=\n\n1 da\n1\n= (H1 + H2 + H3 ),\na dt\n3\n\n(2.23)\n\n1\nl2\n8πG\nρ + σ 2 − o V (p),\n3\n6\n12\n\n(2.24)\n\nand the Friedmann equation is\nH2 =\n\nwhere the energy density of the scalar field is ρ = p2T /2|p1 p2 p3 |, the shear term is given by\n1\nσ 2 = [(H1 − H2 )2 + (H2 − H3 )2 + (H3 − H1 )2 ],\n3\n\n(2.25)\n\nand the potential is\n\"\n\u0012\n\u00132 \u0012\n\u00132 \u0012\n\u00132 #\n1\np\np\np\np\np\np\n2\n3\n3\n1\n1\n2\nV (p) =\n2(p21 + p22 + p23 ) −\n.\n−\n−\np1 p2 p3\np1\np2\np3\n\n(2.26)\n\nClearly, these dynamics are quite complex already at the classical level and, as mentioned\nin the introduction, become chaotic as a singularity is approached. The one exception is the\ncase when the matter field is a massless scalar field which is precisely what is considered\nhere. In this case, as the singularity is approached, the Friedmann equation is asymptotically\nvelocity term dominated (AVTD) which means that the potential can be safely neglected [18].\nThus, as the singularity is approached, the dynamics are the same as those of the Bianchi I\nspace-time with a massless scalar field. This behaviour will be important for the study of the\neffective equations later. However, the quantum Hamiltonian constraint operator derived in\nthe following section will hold everywhere and it will be relatively straightforward to extend\nit for other types of matter fields which classically allow the full Mixmaster dynamics.\n\n\f7\nFinally, before moving on to the quantum theory, let us consider the parity transformation\nΠk which flips the kth physical triad vector eak . (Keep in mind that this transformation does\nnot act on any of the fiducial quantities which carry the label o.) These correspond to\nresidual discrete gauge transformations. Under this map, we have: qab → qab , ǫabc → ǫabc\nbut ǫijk → −ǫijk , ε → −ε. The canonical variables ci , pi transform as proper internal vectors\nand co-vectors. For example,\nΠ1 (c1 , c2 , c3 ) → (−c1 , c2 , c3 )\n\nand\n\nΠ1 (p1 , p2 , p3 ) → (−p1 , p2 , p3 ) .\n\n(2.27)\n\nConsequently, both the symplectic structure and the Hamiltonian constraint are left invariant under any of the parity maps Πk .\nThe Hamiltonian description given in this section will serve as the starting point for the\nloop quantization in the next section.\nIII.\n\nQUANTUM THEORY\n\nThis section is divided into three parts. In the first, we discuss the kinematics of the\nmodel and in the second we introduce the Hamiltonian constraint operator and describe its\naction on physical states. Finally, in the third subsection we show that the dynamics of a\nwave function sharply peaked around an isotropic geometry are well approximated by the\nLQC dynamics of the closed FRW model.\nA.\n\nLQC Kinematics\n\nThe kinematics for the LQC of Bianchi IX models is identical to that of the Bianchi II\nmodels [16], but we will briefly present the kinematics here as well for the sake of completeness.\nThe elementary functions on the classical phase space that have unambiguous analogs in\n(μ)\nthe quantum theory are the momenta pi and holonomies hk of the gravitational connection\nAia along the integral curves of e̊ak of length μlo with respect to the fiducial metric q̊ab . These\nholonomies are given by\n(μ)\n\nhk (c1 , c2 , c3 ) = exp (μck τk ) = cos\n\nμck\nμck\nI + 2 sin\nτk ,\n2\n2\n\n(3.1)\n\nwhere the τk are −i/2 times the Pauli matrices. This family of holonomies is completely\ndetermined by the almost periodic functions exp(iμck ) of the connection. These almost\nperiodic functions will be the elementary configuration variables which will be promoted\nunambiguously to operators in the quantum theory.\ngrav\nIt is simplest to use the p-representation to specify the gravitational sector Hkin\nof the\nkinematic Hilbert space. The basis is orthonormal in the sense that\nhp1 , p2 , p3 |p′1 , p′2 , p′3 i = δp1 p′1 δp2 p′2 δp3 p′3 ,\n\n(3.2)\n\nwhere the right side features Kronecker delta symbols rather than Dirac delta distributions.\nKinematical states consist of countable linear combinations\nX\nΨ(p1 , p2 , p3 )|p1 , p2 , p3 i\n(3.3)\n|Ψi =\np1 ,p2 ,p3\n\n\f8\nof these basis states for which the norm\n||Ψ||2 =\n\nX\n\np1 ,p2 ,p3\n\n|Ψ(p1 , p2 , p3 )|2\n\n(3.4)\n\nis finite.\nNext, recall that on the classical phase space the three reflections Πi : eai → −eai are\nlarge gauge transformations under which physics does not change since both the metric and\nthe extrinsic curvature are left invariant. These large gauge transformations have a natural\ninduced action, denoted by Π̂i , on the space of wave functions Ψ(p1 , p2 , p3 ). For example,\nΠ̂1 Ψ(p1 , p2 , p3 ) = Ψ(−p1 , p2 , p3 ).\n\n(3.5)\n\nSince Π̂2i is the identity, for each i the group of these large gauge transformations is simply\nZ2 . As in Yang-Mills theory, physical states belong to its irreducible representation. For\ndefiniteness, as in the isotropic and the Bianchi type I and type II models, we will work\ngrav\nwith the symmetric representation. It then follows that Hkin\nis spanned by wave functions\nΨ(p1 , p2 , p3 ) which satisfy\nΨ(p1 , p2 , p3 ) = Ψ(|p1 |, |p2 |, |p3|)\n(3.6)\n\nand have a finite norm.\ngrav\nThe action of the elementary operators on Hkin\nis as follows: the momenta act by multiplication whereas the almost periodic functions in ci shift the ith argument. For example,\nh\ni\n\\ 1 )Ψ (p1 , p2 , p3 ) = Ψ(p1 −8πγG~μ, p2 , p3 ) .\n[p̂1 Ψ](p1 , p2 , p3 ) = p1 Ψ(p1 , p2 , p3 ) and\nexp(iμc\n(3.7)\n\\\n\\\nThe expressions for p̂2 , exp(iμc2 ), p̂3 and exp(iμc3 ) are analogous. Finally, we must define\nthe operator ε̂ since ε features in the expression of the Hamiltonian constraint. Following\n[16], we define\n(\n|p1 , p2 , p3 i if p1 p2 p3 ≥ 0,\nε̂ |p1 , p2 , p3 i :=\n(3.8)\n− |p1 , p2 , p3 i if p1 p2 p3 < 0.\ngrav\nFinally, the full kinematical Hilbert space Hkin will be the tensor product Hkin = Hkin\n⊗\nmatt\nmatt\n2\nHkin , where Hkin = L (R, dT ) is the matter kinematical Hilbert space for the homogematt\n, T̂ will act by multiplication and p̂T := −i~dT will act by\nneous scalar field. On Hkin\ndifferentiation.\n\nB.\n\nThe Quantum Hamiltonian Constraint\n\nTo define the quantum Hamiltonian constraint, we must express the Hamiltonian constraint in terms of almost periodic functions of the connection which can be directly promoted to operators. For isotropic and/or spatially flat space-times, this can be done by\nexpressing the field strength Fab k in terms of holonomies and this is what is done for the\nμ̄i approach in LQC in [8, 10, 11, 15]. However, this is not possible for space-times which\nare both anisotropic and spatially curved such as the Bianchi type II and type IX models.\nIn this case we need to extend the strategy: the connection itself -rather than the field\n\n\f9\nstrength- has to be expressed in terms of holonomies. This task was carried out in [16].\nThe connection operator is given by\nĉk =\nwhere\nμ̄1 =\n\ns\n\n|p1 |∆ l2Pl\n|p2 p3 |\n\n,\n\nμ̄2 =\n\n\\\nsin(μ̄\nk ck )\n,\nμ̄k\n\ns\n\n|p2 |∆ l2Pl\n|p1 p3 |\n\n(3.9)\n\n,\n\nμ̄3 =\n\ns\n\n|p3 |∆ l2Pl\n,\n|p1 p2 |\n\n(3.10)\n\n√\nand ∆ l2Pl = 4 3πγ l2Pl is the 'area gap'. Note that the choice for this operator is motivated\nby LQG: it is obtained in [16] by expressing the connection in terms of holonomies, a\nprocedure commonly used in LQG, and then ensuring that this approach is equivalent to\nwhat is done for simpler cosmological models. Although the precise value of the area gap\nmay change as the relation between LQG and LQC is better understood, the form of μ̄i in\nterms of the pi is necessary in order to obtain the correct infrared, low curvature behaviour.\nUsing the connection operator, it is possible to promote the classical Hamiltonian constraint in Eq. (2.16) to an operator. Ignoring factor ordering ambiguities and inverse triad\noperators for the moment, CˆH is given by\n\"\n1\nCˆH = −\np1 p2 |p3 | sin μ̄1 c1 sin μ̄2 c2 + |p1 |p2 p3 sin μ̄2 c2 sin μ̄3 c3\n8πGγ 2 ∆l2Pl\ns\n\"\n#\n|p1 p2 |\nlo ε̂\n√\np1 p2\nsin μ̄3 c3\n+ p1 |p2 |p3 sin μ̄3 c3 sin μ̄1 c1 −\n2\n|p3 |\n8πGγ ∆lPl\ns\ns\n\"\n#\n\u0001\n|p2 p3 |\n|p3 p1 |\nl2o (1 + γ 2 )\n2\n2\n2\n2\np\n+\np\n+\np\n+ p2 p3\nsin μ̄1 c1 + p3 p1\nsin μ̄2 c2 −\n1\n2\n3\n|p1 |\n|p2 |\n32πGγ 2\n\u00132 \u0012\n\u00132 \u0012\n\u00132 #\n\u0012\n1\np2 p3\np3 p1\np1 p2\n+ p̂2T ,\n−\n−\n(3.11)\n−\np3\np1\np2\n2\nwhere for simplicity of notation here and in what follows we have dropped the hats on the\npi and sin μ̄i ci operators.\nTo obtain the action of the sin μ̄i ci operators (or, equivalently, the exp(iμ̄i ci ) operators)\nwe will use the same strategy as in [15]. As shown there, it is simplest to introduce the\ndimensionless variables\np\nsgn(pi ) |pi |\n√\nλi =\n.\n(3.12)\n(4πγ ∆l3Pl )1/3\nThen the kets |λ1 , λ2 , λ3 i constitute an orthonormal basis in which the operators pk are\ndiagonal\n√\npk |λ1 , λ2 , λ3 i = [sgn(λk )(4πγ ∆l3Pl )2/3 λ2k ] |λ1 , λ2 , λ3 i ,\n(3.13)\n\nand quantum states are represented by functions Ψ(λ1 , λ2 , λ3 ). Then the operator eiμ̄1 c1 acts\nby shifting the wavefunction,\n\u0002 iμ̄1 c1 \u0003\n1\n, λ2 , λ3 )\ne\nΨ (λ1 , λ2 , λ3 ) = Ψ(λ1 −\n|λ2 λ3 |\nv − 2sgn(λ2 λ3 )\n= Ψ(\n* λ1 , λ2 , λ3 ),\n(3.14)\nv\n\n\f10\nwhere we have introduced the variable v = 2λ1 λ2 λ3 which is proportional to the volume V\nof the space-time:\n√\n(3.15)\nV̂ Ψ(λ1 , λ2 , λ3 ) = [2πγ ∆ |v| l3Pl ] Ψ(λ1, λ2 , λ3 ).\nThe action of the operators eiμ̄2 c2 and eiμ̄3 c3 is analogous.\nWe are now ready to write the Hamiltonian constraint explicitly in the λi -representation,\nagain ignoring factor-ordering issues for the time being:\nCˆH = Cˆ1 + Cˆ2 + Cˆ3 + Cˆ4 + 21 p̂2T ,\n\n(3.16)\n\nwhere\nh\n2 2\n1\nˆ\nC1 = − 2 π~lPl v sgn(λ1 λ2 ) sin μ̄1 c1 sin μ̄2 c2 + sgn(λ2 λ3 ) sin μ̄2 c2 sin μ̄3 c3\ni\n+ sgn(λ3 λ1 ) sin μ̄3 c3 sin μ̄1 c1 ;\nh\n√\n1\n1\nCˆ2 = −2π ∆~l3Pl lo ε̂ (λ1 λ2 )3 p\nsin μ̄3 c3 + (λ2 λ3 )3 p\nsin μ̄1 c1\n|p3 |\n|p1 |\ni\n1\n+ (λ3 λ1 )3 p\nsin μ̄2 c2 ;\n|p2 |\n√ 1/3 √\ni\nh\n∆~l2Pl 2\n(4πγ ∆)\nlo (1 + γ 2 ) λ41 + λ42 + λ43 ;\nCˆ3 = −\n4γ\nh\n1\n1i\n1\nCˆ4 = 21 (16π 2 γ 2 ∆)1/3 π∆~l6Pl l2o (1 + γ 2 ) (λ1 λ2 )4 2 + (λ2 λ3 )4 2 + (λ3 λ1 )4 2 .\np3\np1\np2\n\n(3.17)\n\n(3.18)\n(3.19)\n(3.20)\n\nIt will be straightforward to deal with CˆH since the terms in Cˆ1 are the exact terms that\nappear in the Bianchi I model and have already been studied in [15] while the terms in Cˆ2\nand Cˆ4 are of the same form as some of the terms in the Bianchi II model [16]. Finally, the\nonly new terms -those in Cˆ3 - act by multiplication and will not cause any difficulty.\nAll of the terms will be factor-ordered in a symmetric manner. For example, the first\nterm in Cˆ1 will be factor-ordered as\n\"\np\n1\n− π~l2Pl |v| (sin μ̄1 c1 sgnλ1 + sgnλ1 sin μ̄1 c1 )|v|(sin μ̄2 c2 sgnλ2 + sgnλ2 sin μ̄2 c2 )\n16\n#\np\n+(sin μ̄2 c2 sgnλ2 + sgnλ2 sin μ̄2 c2 )|v|(sin μ̄1 c1 sgnλ1 + sgnλ1 sin μ̄1 c1 )\n|v|, (3.21)\nwhile the first term in Cˆ2 will be\n\n√\n−π ∆~l3Pl lo (λ1 λ2 )3\n\ni 1\n1 h\nε̂\nsin\nμ̄\nc\n+\nsin\nμ̄\nc\nε̂\n.\n3\n3\n3\n3\n|p3 |1/4\n|p3 |1/4\n\n(3.22)\n\nSince all of the components in each term in Cˆ3 and Cˆ4 commute, there are no factor-ordering\nchoices to be made for these terms.\nThe factor ordering given in Eq. (3.21) was first introduced in [17] for the study of the\nGowdy model. It is a particularly nice choice as it causes the octants to decouple from each\n\n\f11\nother, one can then focus on the dynamics of a single octant and then derive the behaviour\nof the other octants via the parity properties of the wave function.\nThe only operators that remain to be defined are the inverse volume operators. Using a\nvariation on the Thiemann inverse triad identities [29], one obtains the operator [16]\np\n√\n\u0011\np\n2sgn(λ1 ) |λ2 λ3 | \u0010p\n\\\n−1/4\n√\n|v\n+\nsgn(λ\nλ\n)|\n−\n|v\n−\nsgn(λ\nλ\n)|\n|λ1 , λ2 , λ3 i.\n|p1 |\n|λ1 , λ2 , λ3 i =\n2 3\n2 3\n(4πγ ∆l3Pl )1/6\n(3.23)\nThis operator is diagonal in the eigenbasis |λ1 , λ2 , λ3 i and, on eigenkets with large volume,\nthe eigenvalue is indeed well approximated by |p1 |−1/4 , whence on semi-classical states it\nbehaves as the inverse of |p̂|1/4 , just as one would hope. Nonetheless, there are interesting\nnontrivialities in the Planck regime, the most important one being that the inverse triad\noperator annihilates states |λ1 , λ2 , λ3 i where v = 2λ1 λ2 λ3 = 0.\nFinally, the other inverse triad operator which is necessary for the study of Bianchi IX\nmodels can be defined by\n\u0010\n\u00118\n−2\n−1/4\npc\n:= |p\\\n|\n.\n(3.24)\ni\ni\n\nNote that both of these operators were already introduced for the study of the Bianchi II\nmodel in [16].\nAs in the Bianchi I model, the action simplifies if we replace (λi , λj , λk ) by (λi , λj , v)4.\nBecause of the high symmetry of the Bianchi IX model, it does not matter which of the\nλi is replaced; we will choose to replace λ3 by v here. This change of variables would be\nnontrivial if, as in the Wheeler-DeWitt theory, we had used the Lesbegue measure in the\ngravitational sector. However, it is quite tame here because the norms are defined using a\ngrav\ndiscrete measure. The inner product on Hkin\nis now given by\nX\nhΨ1 |Ψ2 ikin =\nΨ̄1 (λ1 , λ2 , v) Ψ2 (λ1 , λ2 , v)\n(3.25)\nλ1 ,λ2 ,v\n\nand states are symmetric under the action of Π̂k . In the Appendix of [16], it is shown that\nunder the action of the Π̂i , the operators sin μ̄i ci have the same transformation properties\nas ci under the reflections Πi in the classical theory. As a consequence, CˆH is also reflection\ngrav ˆ\nsymmetric5 . Therefore, its action is well defined on Hkin\n: CH is a densely defined, symmetric\noperator on this Hilbert space. In the isotropic and Bianchi I cases, its analog has been shown\nto be essentially self-adjoint [30, 31]. In what follows we will assume that (3.16) is essentially\ngrav\nself-adjoint on Hkin\nand work with its self-adjoint extension.\nWe can now study the action of CˆH on a wavefunction. For a complete derivation of the\naction of each term in the constraint, see [15, 16].\ngrav\nIt is straightforward to write down the full Hamiltonian constraint on Hkin\n:\n−~2 ∂T2 Ψ(λ2 , λ3 , v; T ) = Θ Ψ(λ2, λ3 , v; T ),\n4\n\n5\n\nwhere Θ = −2Cˆgrav .\n\n(3.26)\n\nThis cannot be done for states where λ1 λ2 λ3 = 0 but since these states decouple under the action of CˆH ,\nwe can restrict our attention solely to states where λ1 λ2 λ3 6= 0.\nNote that although Π̂i ε̂Π̂i = −ε̂ (recall that classically ε → −ε under a parity transformation) only when\nv 6= 0, in the v = 0 case the wavefunction is annihilated by the gravitational part of the Hamiltonian\nconstraint Cˆgrav and therefore Π̂i Cˆgrav Π̂i |Ψsing i = 0 = Cˆgrav |Ψsing i where |Ψsing i is a state that only has\nsupport on v = 0. It is then straightforward to show that Π̂i CˆH Π̂i |Ψi = CˆH |Ψi for all wavefunctions.\n\n\f12\nAs in the isotropic case [32], one can obtain the physical Hilbert space Hphy by a group\naveraging procedure and the final result is completely analogous. Elements of Hphy consist\nof 'positive frequency' solutions to (3.26), i.e., solutions to\np\n(3.27)\n−i~∂T Ψ(λ1 , λ2 , v; T ) = |Θ| Ψ(λ1 , λ2 , v; T ) ,\nwhich are symmetric under the three reflection maps Π̂i :\n\nΨ(λ1 , λ2 , v; T ) = Ψ(|λ1 |, |λ2 |, |v|; T ) .\n\n(3.28)\n\nThe scalar product is simply given by\nhΨ1 |Ψ2 iphys = hΨ1 (λ1 , λ2 , v; To)|Ψ2 (λ1 , λ2 , v; To )ikin\nX\n=\nΨ̄1 (λ1 , λ2 , v; To) Ψ2 (λ1 , λ2 , v; To),\n\n(3.29)\n\nλ1 ,λ2 ,v\n\nwhere To is any \"instant\" of internal time T .\ngrav\nSince elements of Hkin\nare invariant under the three parity maps Π̂k and the Hamiltonian\nˆ\nconstraint satisfies Π̂k Cgrav Π̂k = Cˆgrav , knowledge of the restriction of the image Cˆgrav Ψ of Ψ\nto the positive octant suffices to determine Cˆgrav Ψ completely. Therefore, in the remainder\nof this section we will restrict the argument of CˆH Ψ to the positive octant. The full action\nis simply given by\n\u0001\n\u0001\nCˆgrav Ψ (λ1 , λ2 , v) = Cˆgrav Ψ (|λ1 |, |λ2|, |v|).\n(3.30)\nSince all states with v = 0 are annihilated by Cˆgrav , their evolution is trivial:\n∂T2 Ψ(λ1 , λ2 , v = 0; T ) = 0 .\n\n(3.31)\n\nSuch states correspond to classical geometries which are singular and therefore we will call\nthese states 'singular', even though they are well defined in the quantum theory. Nonsingular states on the other hand are physically much more interesting. On them, the\nexplicit form of the full constraint is given by:\n\"√ \u0012\n√\n√ +\nv\n∂T2 Ψ(λ1 , λ2 , v; T ) =πG\n(v + 2) v + 4 Ψ+\n4 (λ1 , λ2 , v; T ) − (v + 2) v Ψ0 (λ1 , λ2 , v; T )\n8\n\u0013\np\n√ −\n−\n− θv−2 (v − 2) v Ψ0 (λ1 , λ2 , v; T ) + θv−4 (v − 2) |v − 4| Ψ4 (λ1 , λ2 , v; T )\n√\n\u0013\n\u0011\u0012\np\n2ilo ∆ \u0010√\n+\n−\n√\n−\nv + 1 − |v − 1| Φ − θv−2 Φ (λ1 , λ2 , v; T )\n(4πγ ∆)1/3\n\u0012\ni\nh\np\n8∆l2o (1 + γ 2 ) √\n√\n( v + 1 − |v − 1|)8 (λ1 λ2 )8 + (λ2 λ3 )8 + (λ3 λ1 )8\n+\n(4πγ ∆)2/3\n#\n\u0013\n\u0001\n1 4\n(3.32)\n− λ1 + λ42 + λ43 Ψ(λ1 , λ2 , v; T ) ,\n8\nwhere θx is the step function\nθx =\n\n\u001a\n\n1 if x > 0,\n0 if x < 0.\n\n(3.33)\n\n\f13\nNote that the step function kills any terms that would allow the positive octant to interact\nwith any of the other ones, this is a direct consequence of the factor ordering choices made\nearlier.\nThe Ψ±\n0,4 are defined as follows:\n\u0012\n\u0013\n\u0012\n\u0013\nv±4\nv±2\nv±4\n±\nΨ4 (λ1 , λ2 , v; T ) = Ψ\n* λ1 ,\n* λ2 , v ± 4; T + Ψ\n* λ1 , λ2 , v ± 4; T\nv±2\nv\nv±2\n\u0013\n\u0012\n\u0013\n\u0012\nv±4\nv±2\nv±2\n* λ1 ,\n* λ2 , v ± 4; T + Ψ\n* λ1 , λ2 , v ± 4; T\n+Ψ\nv\nv±2\nv\n\u0012\n\u0013\n\u0012\n\u0013\nv±2\nv±4\n+ Ψ λ1 ,\n* λ2 , v ± 4; T + Ψ λ1 ,\n* λ2 , v ± 4; T , (3.34)\nv\nv±2\nand\nΨ±\n0 (λ1 , λ2 , v; T )\n\n\u0013\n\u0012\n\u0013\nv\nv±2\nv±2\n* λ1 ,\n* λ2 , v; T + Ψ\n* λ1 , λ2 , v; T\n=Ψ\nv\nv±2\nv\n\u0012\n\u0013\n\u0012\n\u0013\nv\nv±2\nv\n+Ψ\n* λ1 ,\n* λ2 , v; T + Ψ\n* λ1 , λ2 , v; T\nv±2\nv\nv±2\n\u0013\n\u0012\n\u0013\n\u0012\nv±2\nv\n* λ2 , v; T + Ψ λ1 ,\n* λ2 , v; T ,\n(3.35)\n+ Ψ λ1 ,\nv±2\nv\n\u0012\n\nwhile Φ± are given by\n±\n\nΦ (λ1 , λ2 , v; T ) =\n\np\n\np\n\n\u0001\n\n\u0014\n\n4\n\n\u0010v ± 2\n\n\u0011\n\n* λ1 , λ2 , v ± 2; T\nv\n\u0011\n\u0010\n\u0011\u0015\n\u0010\nv±2\n4\n4\n* λ2 , v ± 2; T + (λ1 λ2 ) Ψ λ1 , λ2 , v ± 2; T .\n+ (λ3 λ1 ) Ψ λ1 ,\nv\n(3.36)\n|v ± 2 + 1| −\n\n|v ± 2 − 1| × (λ2 λ3 ) Ψ\n\nAs expected, the quantum dynamics of the Bianchi IX model reduces to that of the\nBianchi I model discussed in [15] in the limit lo → 0 in Eq. (3.32).\nEq. (3.32) also immediately implies that the steps in v are uniform: the argument of the\nwave function only involves v − 4, v − 2, v, v + 2 and v + 4. Thus, there is a superselection\nin v. For each ǫ ∈ [0, 2), we can introduce a lattice Lǫ of points v = 2n + ǫ. Then the\nquantum evolution -and the action of the Dirac observables p̂T and V̂ |T commonly used in\nǫ\nLQC- preserves the subspaces Hphy\nconsisting of states with support in v on Lǫ . The most\ninteresting lattice is the one corresponding to ǫ = 0 since it includes the classically singular\npoints v = 0.\nThe form of the action of the Hamailtonian constraint operator also shows that the\nclassical singularity is resolved. Using the scalar field T as time, we find that if one starts\nwith a wavefunction which only has support on singular states, that wavefunction does not\nevolve in T and therefore will always only have support on singular states.\nOn the other hand, a state which does not have any support on the singular subspace\nwill never have support on it. Restricting our argument to the positive octant for the sake\nof simplicity (it can easily be generalized to the other octants), it is easy to see that to go\nfrom λ1 , λ2 , v > 0 to v = 0, one must either have v = 2 and then Φ− will give a term with\nv = 0 or have v = 4 and then Ψ−\n4 will give a term with v = 0. However, the prefactors in\n\n\f14\nfront of Φ− vanish for v = 2 just as the prefactors in front of Ψ−\n4 vanish for v = 4. Because\nof this, it is impossible for a wavefunction with no support on singular states to ever gain\nsupport on a singular state.\nThis shows that singular states decouple from nonsingular states under the relational T\ndynamics given by Eqs. (3.31) and (3.32). In other words, if one starts with a nonsingular\nstate at some 'time' To , it will remain nonsingular throughout its evolution. It is in this\n(rather strong) sense that the singularity is resolved.\nIV.\n\nEFFECTIVE EQUATIONS\n\nIn the isotropic models, effective equations have been introduced via two different approaches -the embedding [33, 34] and the moment expansion [35] methods- in order to\nstudy the first order quantum-corrected equations of motion. In the isotropic case the effective equations following from the embedding approach provide an excellent approximation\nto the full quantum evolution of states which are Gaussians at late times, even in the Λ 6= 0\nas well as k=±1 cases where the models are not exactly soluble. However, the truncation\nmethod is more systematic and also more general in the sense that it is applicable to a wide\nvariety of states. Nonetheless, in this section we will use the first method (although we\nwill ignore the effect of fluctutations in this work) in order to gain qualitative insights into\nmodifications of the equations of motion due to quantum geometry effects.\nTo obtain the effective equations we can restrict our attention to the positive octant of the\nclassical phase space (where ε = 1) without loss of generality. Then the quantum corrected\nHamiltonian constraint is given by the classical analogue of (3.11):\np2T\neff\n+ Cgrav\n= 0,\n2\n\n(4.1)\n\nwhere6\neff\nCgrav\n=−\n\n\"\n\n#\n\np1 p2 p3\nsin μ̄1 c1 sin μ̄2 c2 + sin μ̄2 c2 sin μ̄3 c3 + sin μ̄3 c3 sin μ̄1 c1\n8πGγ 2 ∆l2Pl\n\"\n#\n3/2\n3/2\n3/2\nlo\n(p1 p2 )\n(p2 p3 )\n(p3 p1 )\n√\n−\nsin μ̄3 c3 + √\nsin μ̄1 c1 + √\nsin μ̄2 c2\n√\n2\np3\np1\np2\n8πGγ ∆lPl\n\"\n\u00132 \u0012\n\u00132 \u0012\n\u00132 #\n\u0012\nl2o\np\np\np\np\np\np\n1 2\n2 3\n3 1\n−\n. (4.2)\n(1 + γ 2 ) 2(p21 + p22 + p23 ) −\n−\n−\n2\n32πGγ\np3\np1\np2\n\nUsing the expressions (3.10) of μ̄k , it is easy to verify that far away from the classical\nsingularity -more precisely in the regime in which the Hubbles rates Hi are well below\nthe Planck scale- the effective Hamiltonian constraint (4.1) is well-approximated by the\nclassical one given in Eq. (2.16).\n6\n\nRecall that every lo which appears in the constraint is divided by ro which has been set to 2. As lo /ro is\ndimensionless, we must ignore lo when counting units.\n\n\f15\nThe effective dynamics are obtained by taking Poisson brackets with the effective Hamiltonian constraint. This gives\n\u0013\n\u0012 2\np1\n−1\n(sin μ̄2 c2 + sin μ̄3 c3 ) + lo p2 p3 cos μ̄1 c1 ;\n(4.3)\np ̇1 = γ\nμ̄1\n\"\n\u0012\n1 p2 p3\nsin μ̄1 c1 sin μ̄2 c2 + sin μ̄1 c1 sin μ̄3 c3 + sin μ̄2 c2 sin μ̄3 c3\nc ̇1 = −\nγ ∆l2Pl\nμ̄1 c1\nμ̄2 c2\n+\ncos μ̄1 c1 (sin μ̄2 c2 + sin μ̄3 c3 ) −\ncos μ̄2 c2 (sin μ̄1 c1 + sin μ̄3 c3 )\n2\n\u0014\n\u0013 2\u0012\nμ̄3 c3\np1 p3\n3 p1 p2\n−\ncos μ̄3 c3 (sin μ̄1 c1 + sin μ̄2 c2 ) + lo\nsin μ̄3 c3 +\nsin μ̄2 c2\n2\n2μ̄1 p3\np2\n\u0015\n\u0013\np2 p3\n1 p2 p3\n1\n1\n−\nsin μ̄1 c1 +\nc1 cos μ̄1 c1 − p2 c3 cos μ̄3 c3 − p3 c2 cos μ̄2 c2\n3p1\n2 p1\n2\n2\n#\n\u0013\n\u0013\n\u0012\n\u0012\np22 p23\np22 p23\nl2\n+\n+\n2\n.\n(4.4)\n+ o (1 + γ 2 ) 4p1 − 2p1\n4\np23 p22\np31\nThe equations for p ̇2 , p ̇3 , c ̇2 and c ̇3 are the same modulo the appropriate permutations. Note\nthat it is easy to extend this for other matter fields and also to the vacuum case simply by\nappropriately modifying the matter part of the effective Hamiltonian constraint.\nIn the embedding approach these effective equations provide quantum geometry corrections to the classical equations of motion Eqs. (2.18) and (2.19) due to the area gap. However,\ncareful numerical work comparing the full quantum dynamics to the effective dynamics is\nnecessary to determine whether the effective equations are accurate beyond first order in ~.\nNow, it is well known that classical Bianchi IX space-times with a massless scalar field as a\nmatter source behave in an asymptotically velocity term dominated (AVTD) manner7 , that\nis to say that the potential term is negligible (see [18] and references therein). For certain\nregions of phase space, this will occur before quantum gravity effects become important and\nwe will assume that in this case only quantum gravity corrections to the velocity terms are\nrelevant.\nIt then follows that this behaviour is identical to that of the Bianchi I model and therefore\nthe effective Friedmann equation for the Planck regime to first order in ~ is given by [36]\n\u0013\n\u0012\n8πG\nΣ2 Σ2 ρ\nρ\n(Σ2 )2\n2\nH =\n+\nρ 1−\n−\n−\n+ O(l4Pl ),\n(4.5)\n3\nρc\n6\n2ρc\n32πGρc\n√\nwhere ρc = 3/8πγ 2 ∆Gl2Pl ≈ 0.41ρPl (recall that ∆ = 4 3πγ and γ ≈ 0.2375 due to black\nhole entropy calculations [37]). The expression for Σ2 is given by\nΣ2 =\n\ni\n1 h\n2\n2\n2\n,\n(p\nc\n−\np\nc\n)\n+\n(p\nc\n−\np\nc\n)\n+\n(p\nc\n−\np\nc\n)\n1 1\n2 2\n2 2\n3 3\n3 3\n1 1\n3γ 2 p3\n\n(4.6)\n\nand one can show that p3 Σ2 is a constant in the AVTD limit [36].\n7\n\nThis is true so long as the constant of motion p2T is large enough so that the three scale factors are all\ndecreasing as the singularity is approached.\n\n\f16\nIt is clear that there is a bounce (H 2 = 0) when the matter energy density reaches\ns\u0012\n\"\n\u0013\u0012\n\u0013#\n3Σ2\n3Σ2\nΣ2\n1\nρc −\nρc −\nρc −\n,\n(4.7)\n+\nρbounce =\n2\n16πG\n16πG\n16πG\nat which point the energy density and curvature will both decrease and leave the Planck\nregime and the classical dynamics will once again become a good approximation. It follows\nthat the matter energy density is always bounded above by the critical energy density\nρc = 0.41ρPl . This is only an upper bound as the matter density at the bounce depends\nquite strongly on Σ2 which is a measure of the strength of the gravitational waves: the\nstronger the gravitational waves are, the lower ρbounce will be.\nThe scenario described above relies on the AVTD behaviour of the Bianchi IX cosmology\nwith a massless scalar field occuring before quantum gravity effects become important. In\nthis case, the true Friedmann equation can then be well approximated by Eq. (2.24) in the\nclassical regime and by Eq. (4.5) in the AVTD limit. However, this scenario will not be\nvalid for all regions of phase space, in particular where the scalar field momentum pT is\nsmall enough for the chaotic Mixmaster behaviour to appear.\nIt has been suggested that, by bounding the strength of the potential terms due to inverse\ntriad effects, quantum gravity effects could play an important role in Bianchi IX dynamics\nand that the chaotic Mixmaster behaviour would be avoided as a result of this for all types\nof matter fields [24]. In the effective equations presented above, we have ignored the effect\nof inverse volume corrections (which for the inverse volume operator used in this paper are\nonly important for v < 4) and have only considered the effect of holonomy corrections. If\nthe chaotic behaviour is to be generically avoided in this effective theory, it will be because\nthe repulsive quantum gravity effects will ensure that the Bianchi IX space-time will not\nremain in high curvature regions for long enough for there to occur a sufficient number of\nMixmaster bounces for chaos to appear.\nFor now, this remains a conjecture and one would have to study the Bianchi IX effective\nequations of motion more carefully, using both analytic and numerical methods, in order to\ndetermine whether the bounce is generic and also to see if chaotic behaviour is avoided or\nnot in the effective theory for small p2T .\nV.\n\nDISCUSSION\n\nIn this paper we have studied the improved LQC dynamics for Bianchi IX cosmologies\nwhere the matter content is a massless scalar field which is used as a relational time parameter. We have shown that the singularities in the classical theory are resolved by quantum\ngravity effects in the usual manner in LQC as the singular states decouple from the regular\nones under the relational dynamics given by the Hamiltonian constraint operator.\nIt is important to point out that all of the tools necessary for the task of deriving the LQC\ndynamics for Bianchi IX models were already available. First, the form of μ̄i was introduced\nin the study of Bianchi I models [15], as were the variables λi which greatly simplify the form\nof the action of the Hamiltonian constraint operator. The other two necessary ingredients\nto the results for this work are the connection operator and the inverse triad operators, both\nof which were introduced for the study of Bianchi II models in [16]. In addition, even the\nfactor-ordering choices necessary in the Hamiltonian constraint operator had been made in\n[15–17]. Because of this, it is reasonable to expect that no additional machinery should\n\n\f17\nbe necessary in order to complete the study of the loop quantum cosmology of the other\nBianchi models of type A.\nFinally, in addition to obtaining a well-defined LQC Hamiltonian constraint operator for\nBianchi IX space-times and studying some of its properties, we also derived some effective\nequations which provide modifications to the classical equations of motion due to the area\ngap which is a manifestation of quantum geometry in LQG. Although all of the results\npresented in this paper were derived for the particular case of a massless scalar field as the\nmatter field, it will be easy to extend the results presented here for other types of matter\nfields (as well as the vacuum case) for both the quantum and effective theories.\nOf course, it is not enough to know the form of the equations of motion given in Eq. (3.32)\nin order to understand the full dynamics of the loop quantum cosmology of Bianchi IX\nmodels. Numerical studies will be particularly useful and help us understand how the\nquantum state of a Bianchi IX cosmology evolves with time. Most interesting would be a\nstudy of states which are sharply peaked around a semi-classical state at late times and to\nthen evolve them back in time to see what happens as the curvature increases. Based upon\nprevious experience with isotropic models, one might expect to see one or several bounces\nas the curvature reaches the Planck scale but careful numerical studies are needed to check\nthis.\nIf the BKL conjecture is correct a good understanding of the quantum dynamics of Bianchi\nIX cosmologies will lead to a better understanding of the behaviour of generic space-times as\ntheir curvature reaches the Planck scale. If Bianchi IX models are sufficiently rich in order\nto understand the approach to such regions, it would appear that no singularities would\nform since an initially nonsingular Bianchi IX wave function must remain nonsingular as\nshown in Sec. III. It is therefore possible that a careful study of the BKL conjecture at the\nlevel of the quantum dynamics could provide a no-singularity theorem, a first step in this\ndirection is provided by [22].\nA simpler avenue to study quantum gravity effects in Bianchi IX models would be to\nstudy the effective dynamics presented in Sec. IV. In isotropic models it turns out that the\neffective dynamics are surprisingly accurate even in the deep Planck regime: the effective\nequations accurately predict the quantum trajectory throughout the quantum bounce for\nsharply peaked wave functions. Because of this, it would be interesting to study the dynamics\ngiven by the effective equations for Bianchi IX space-times. However, it is essential to see\nwhere the effective equations break down, if they do at all. This can be done by including\nhigher order corrections to the effective equations via the moment expansion method and\nalso by comparing the predictions of the effective equations to full numerical solutions of\nthe Hamiltonian constraint operator.\nAn analysis of the effective equations of motion in the case where the asymptotically\nvelocity term dominated behaviour begins before quantum gravity effects become important\nshows that there is a bounce when the curvature reaches the Planck scale and that the\nmatter energy density is bounded above by the critical energy density ρc ≈ 0.41ρPl . This\nresult relies on the AVTD behaviour and is not generic. Therefore, one must also examine\nother areas in the phase space in order to fully understand the predictions of the effective\ntheory, particularly near Planck scales. As the Mixmaster behaviour appears for small p2T\nduring the approach to the singularity in the classical theory, the effective equations can\nprovide a better understanding of how quantum gravity effects may modify the Mixmaster\nbehaviour as well. In particular it is possible that, as for simpler isotropic models and\nin AVTD case here, these quantum gravity effects will be repulsive and cause a quantum\n\n\f18\nbounce. This would limit the amount of time that the Mixmaster behaviour occurs and the\nchaos which arises in the classical theory might be avoided due to the short time span of\nthe Mixmaster dynamics. However, this remains a conjecture and much more work, both\nanalytic and numerical, is needed in order to resolve this question.\nFinally, it has been pointed out that the dipole cosmology model can be used in order to\nstudy the Bianchi IX model [25]. Although that paper studies the Euclidean theory, it would\nnonetheless be interesting to compare the model presented in [25] with the one developed\nin this paper. In particular, [25] suggests two possible approaches in order to obtain the\nHamiltonian constraint operator for their model. Comparing the quantum dynamics resulting from these two possibilities to those derived in this paper could help determine which of\nthe two approaches is the correct one and hence give some insight into the dipole cosmology\nmodels and also spin foam models in general. It is also possible to further probe the relation\nbetween the canonical and the covariant approaches to LQG via LQC by extending the\nFeynman path integral construction given in [38] for the flat FRW model to the Bianchi IX\nmodel; this extension would be nontrivial due to the additional degrees of freedom present\nin Bianchi IX space-times, but it could also improve our understanding of the connection\nbetween the canonical and covariant approaches to LQG as well as the relation between full\nLQG and the symmetry-reduced models of LQC.\nAcknowledgements:\n\nThe author would like to thank Abhay Ashtekar and Martin Bojowald for helpful discussions. This research was supported in part by NSF grant PHY0854743, the George A. and\nMargaret M. Downsbrough Endowment, the Eberly research funds of Penn State, Le Fonds\nquébécois de la recherche sur la nature et les technologies and the Edward A. and Rosemary\nA. Mebus funds.\n\n[1] M. Bojowald, Loop quantum cosmology, Liv. Rev. Rel. 11, 4 (2008).\n[2] A. Ashtekar, An introduction to loop quantum gravity through cosmology, Nuovo Cimento\nB122, 135 (2007), arXiv:gr-qc/0702030.\n[3] A. Ashtekar and J. Lewandowski, Background independent quantum gravity: A status report,\nClass. Quant. Grav. 21, R53 (2004).\n[4] C. Rovelli, Quantum Gravity (Cambridge University Press, Cambridge (2004)).\n[5] T. Thiemann, Introduction to Modern Canonical Quantum General Relativity (Cambridge\nUniversity Press, Cambridge, (2007)).\n[6] M. Bojowald, Absence of singularity in loop quantum cosmology, Phys. Rev. Lett. 86, 5227\n(2001).\n[7] A. Ashtekar, M. Bojowald and J. Lewandowski, Mathematical structure of loop quantum\ncosmology, Adv. Theo. Math. Phys. 7, 233 (2003).\n[8] A. Ashtekar, T. Pawlowski and P. Singh, Quantum nature of the big bang: Improved dynamics,\nPhys. Rev. D74, 084003 (2006).\n[9] A. Ashtekar, A. Corichi and P. Singh, Robustness of predictions of loop quantum cosmology,\nPhys. Rev. D77, 024046 (2008).\n\n\f19\n[10] A. Ashtekar, T. Pawlowski, P. Singh and K. Vandersloot, Loop quantum cosmology of k=1\nFRW models, Phys. Rev. D75, 024035 (2007).\n[11] L. Szulc, W. Kamiński and J. Lewandowski, Closed FRW model in loop quantum cosmology,\nClass. Quant. Grav. 24, 2621 (2007).\n[12] C. Rovelli and F. Vidotto, Stepping out of Homogeneity in Loop Quantum Cosmology, Class.\nQuant. Grav. 25, 225024 (2008).\n[13] K. Vandersloot, Loop quantum cosmology and the k= -1 RW model, Phys. Rev. D75, 023523\n(2007).\n[14] L. Szulc, Open FRW model in Loop Quantum Cosmology, Class. Quant. Grav. 24, 6191\n(2007).\n[15] A. Ashtekar and E. Wilson-Ewing, Loop quantum cosmology of Bianchi type I models, Phys.\nRev. D79, 083535 (2009).\n[16] A. Ashtekar and E. Wilson-Ewing, Loop quantum cosmology of Bianchi type II models, Phys.\nRev. D80, 123532 (2009).\n[17] M. Martı́n-Benito, L. J. Garay and G. A. Mena Marugán, Hybrid quantum Gowdy cosmology:\ncombining loop and Fock quantizations, Phys. Rev. D78, 083516 (2008).\nInhomogeneous Loop Quantum Cosmology: Hybrid Quantization of the Gowdy Model, unpublished.\nM. Martı́n-Benito, G. A. Mena Marugán and E. Wilson-Ewing, unpublished.\n[18] B. Berger, Numerical Approaches to Spacetime, Liv. Rev. Rel. 5, 1 (2002).\n[19] T. Damour, H. Henneaux and H. Nicolai, Cosmological Billiards, Class. Quant. Grav. 20,\nR145 (2003).\n[20] V. A. Belinskii, I. M. Khalatnikov, and E. M. Lifshitz, Oscillatory approach to a singular\npoint in relativistic cosmology, Adv. Phys. 19, 525 (1970).\n[21] V. A. Belinskii, I. M. Khalatnikov, and E. M. Lifshitz, A general solution of the Einstein\nequations with a time singularity, Adv. Phys. 31, 639 (1982).\n[22] A. Ashtekar, A. Henderson and D. Sloan, Hamiltonian General Relativity and the Belinskii,\nKhalatnikov, Lifshitz Conjecture, Class. Quant. Grav. 26, 052001 (2009).\n[23] M. Bojowald, G. Date and K. Vandersloot, Homogeneous Loop Quantum Cosmology: The\nRole of the Spin Connection, Class. Quant. Grav. 21, 1253 (2004).\n[24] M. Bojowald and G. Date, Quantum suppression of the generic chaotic behavior close to\ncosmological singularities, Phys. Rev. Lett. 92, 071302 (2004).\nM. Bojowald, G. Date and G. M. Hossain, The Bianchi IX model in Loop Quantum Cosmology,\nClass. Quant. Grav. 21, 3541 (2004).\n[25] M. V. Battisti, A. Marciano and C. Rovelli, Triangulated loop quantum cosmology: Bianchi\nIX and inhomogeneous perturbations, arXiv:0911.2653 (2009).\n[26] A. H. Taub, Empty space-times admitting a three parameter group of motions, Ann. of Math.\n53, 472 (1951).\n[27] M. P. Ryan, Jr. and L. C. Shepley, Homogeneous Relativistic Cosmologies, (Princeton University Press, Princeton (1975)).\n[28] A. Ashtekar, R. S. Tate and C. Uggla, Minisuperspaces: Observables and Quantization, Int.\nJ. Mod. Phys. D2, 15 (1993).\n[29] T. Thiemann, Anomaly-free formulation of non-perturbative, four-dimensional Lorentzian\nquantum gravity, Phys. Lett. B380, 257 (1996).\nT. Thiemann, Quantum Spin Dynamics (QSD), Class. Quant. Grav. 15, 1207 (1998).\n[30] W. Kamiński and J. Lewandowski, The flat FRW model in LQC: the self-adjointness, Class.\n\n\f20\n\n[31]\n[32]\n[33]\n[34]\n[35]\n[36]\n[37]\n\n[38]\n\nQuant. Grav. 25, 035001 (2008).\nW. Kamiński and T. Pawlowski, Cosmic recall and the scattering picture of Loop Quantum\nCosmology, arXiv:1001.2663 (2010).\nA. Ashtekar, T. Pawlowski and P. Singh, Quantum nature of the big bang: An analytical and\nnumerical investigation I, Phys. Rev. D73, 124038 (2006).\nJ. Willis, On the low energy ramifications and a mathematical extension of loop quantum\ngravity, Ph.D. Dissertation, The Pennsylvaina State University (2004).\nV. Taveras, LQC corrections to the Friedmann equations for a universe with a free scalar field,\nPhys. Rev. D78, 064072 (2008).\nM. Bojowald and A. Skirzewski, Effective Equations of Motion for Quantum Systems, Rev.\nMath. Phys. 18, 713 (2006).\nD. Chiou and K. Vandersloot, The behavior of non-linear anisotropies in bouncing Bianchi I\nmodels of loop quantum cosmology, Phys. Rev. D76, 084015 (2007).\nM. Domagala and J. Lewandowski, Black hole entropy from Quantum Geometry, Class. Quant.\nGrav. 21, 5233 (2004).\nK. A. Meissner, Black hole entropy in Loop Quantum Gravity, Class. Quant. Grav. 21, 5245\n(2004).\nA. Ashtekar, M. Campiglia and A. Henderson, Loop Quantum Cosmology and Spin Foams,\nPhys. Lett. B681, 347 (2009).\nCasting Loop Quantum Cosmology in the Spin Foam Paradigm, arXiv:1001.5147 (2010).\n\n\f"}