{"id": "http://arxiv.org/abs/0711.1732v1", "guidislink": true, "updated": "2007-11-12T20:32:58Z", "updated_parsed": [2007, 11, 12, 20, 32, 58, 0, 316, 0], "published": "2007-11-12T20:32:58Z", "published_parsed": [2007, 11, 12, 20, 32, 58, 0, 316, 0], "title": "Polaron Coherence Condensation as the Mechanism for Colossal\n  Magnetoresistance in Layered Manganites", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0711.4362%2C0711.0906%2C0711.3523%2C0711.0119%2C0711.4330%2C0711.3826%2C0711.0157%2C0711.0693%2C0711.0057%2C0711.0566%2C0711.4846%2C0711.1890%2C0711.1586%2C0711.2389%2C0711.2408%2C0711.4637%2C0711.0354%2C0711.1507%2C0711.4705%2C0711.4180%2C0711.2576%2C0711.1732%2C0711.0685%2C0711.1988%2C0711.4339%2C0711.3766%2C0711.1502%2C0711.2846%2C0711.1957%2C0711.3414%2C0711.3824%2C0711.0904%2C0711.3774%2C0711.3008%2C0711.1273%2C0711.0473%2C0711.2964%2C0711.1801%2C0711.0376%2C0711.4544%2C0711.1248%2C0711.3654%2C0711.0282%2C0711.3587%2C0711.2076%2C0711.1221%2C0711.2409%2C0711.4805%2C0711.3187%2C0711.3883%2C0711.0229%2C0711.1712%2C0711.4509%2C0711.3986%2C0711.1579%2C0711.2872%2C0711.1282%2C0711.0435%2C0711.0079%2C0711.0564%2C0711.2243%2C0711.0718%2C0711.4607%2C0711.1074%2C0711.1086%2C0711.4816%2C0711.3479%2C0711.2303%2C0711.1923%2C0711.3964%2C0711.0414%2C0711.1604%2C0711.4054%2C0711.3681%2C0711.2819%2C0711.0798%2C0711.1357%2C0711.4352%2C0711.2906%2C0711.2159%2C0711.2542%2C0711.1257%2C0711.4364%2C0711.1519%2C0711.1043%2C0711.1719%2C0711.4100%2C0711.4867%2C0711.1076%2C0711.3002%2C0711.1563%2C0711.2922%2C0711.1119%2C0711.1753%2C0711.4150%2C0711.3773%2C0711.4438%2C0711.0212%2C0711.3707%2C0711.1299%2C0711.4646&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Polaron Coherence Condensation as the Mechanism for Colossal\n  Magnetoresistance in Layered Manganites"}, "summary": "Angle-resolved photoemission spectroscopy data for the bilayer manganite\nLa1.2Sr1.8Mn2O7 show that, upon lowering the temperature below the Curie point,\na coherent polaronic metallic groundstate emerges very rapidly with well\ndefined quasiparticles which track remarkably well the electrical conductivity,\nconsistent with macroscopic transport properties. Our data suggest that the\nmechanism leading to the insulator-to-metal transition in La1.2Sr1.8Mn2O7 can\nbe regarded as a polaron coherence condensation process acting in concert with\nthe Double Exchange interaction.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0711.4362%2C0711.0906%2C0711.3523%2C0711.0119%2C0711.4330%2C0711.3826%2C0711.0157%2C0711.0693%2C0711.0057%2C0711.0566%2C0711.4846%2C0711.1890%2C0711.1586%2C0711.2389%2C0711.2408%2C0711.4637%2C0711.0354%2C0711.1507%2C0711.4705%2C0711.4180%2C0711.2576%2C0711.1732%2C0711.0685%2C0711.1988%2C0711.4339%2C0711.3766%2C0711.1502%2C0711.2846%2C0711.1957%2C0711.3414%2C0711.3824%2C0711.0904%2C0711.3774%2C0711.3008%2C0711.1273%2C0711.0473%2C0711.2964%2C0711.1801%2C0711.0376%2C0711.4544%2C0711.1248%2C0711.3654%2C0711.0282%2C0711.3587%2C0711.2076%2C0711.1221%2C0711.2409%2C0711.4805%2C0711.3187%2C0711.3883%2C0711.0229%2C0711.1712%2C0711.4509%2C0711.3986%2C0711.1579%2C0711.2872%2C0711.1282%2C0711.0435%2C0711.0079%2C0711.0564%2C0711.2243%2C0711.0718%2C0711.4607%2C0711.1074%2C0711.1086%2C0711.4816%2C0711.3479%2C0711.2303%2C0711.1923%2C0711.3964%2C0711.0414%2C0711.1604%2C0711.4054%2C0711.3681%2C0711.2819%2C0711.0798%2C0711.1357%2C0711.4352%2C0711.2906%2C0711.2159%2C0711.2542%2C0711.1257%2C0711.4364%2C0711.1519%2C0711.1043%2C0711.1719%2C0711.4100%2C0711.4867%2C0711.1076%2C0711.3002%2C0711.1563%2C0711.2922%2C0711.1119%2C0711.1753%2C0711.4150%2C0711.3773%2C0711.4438%2C0711.0212%2C0711.3707%2C0711.1299%2C0711.4646&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Angle-resolved photoemission spectroscopy data for the bilayer manganite\nLa1.2Sr1.8Mn2O7 show that, upon lowering the temperature below the Curie point,\na coherent polaronic metallic groundstate emerges very rapidly with well\ndefined quasiparticles which track remarkably well the electrical conductivity,\nconsistent with macroscopic transport properties. Our data suggest that the\nmechanism leading to the insulator-to-metal transition in La1.2Sr1.8Mn2O7 can\nbe regarded as a polaron coherence condensation process acting in concert with\nthe Double Exchange interaction."}, "authors": ["N. Mannella", "W. L. Yang", "K. Tanaka", "X. J. Zhou", "H. Zheng", "J. F. Mitchell", "J. Zaanen", "T. P. Devereaux", "N. Nagaosa", "Z. Hussain", "Z. -X. Shen"], "author_detail": {"name": "Z. -X. Shen"}, "author": "Z. -X. Shen", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.76.233102", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0711.1732v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0711.1732v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 3 figures, in press", "arxiv_primary_category": {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0711.1732v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0711.1732v1", "journal_reference": "Phys. Rev. B 76, 233102 (2007)", "doi": "10.1103/PhysRevB.76.233102", "fulltext": "Polaron Coherence Condensation as the Mechanism for\nColossal Magnetoresistance in Layered Manganites\nN. Mannella1,2,*, W. L. Yang1,2, K. Tanaka1,2, X. J. Zhou1,2, H. Zheng3, J. F. Mitchell3,\nJ. Zaanen4, T. P. Devereaux5, N. Nagaosa6, Z. Hussain2 and Z.-X. Shen1,#\n1\nDepartments of Physics, Applied Physics, Stanford University, Stanford, California 94305, USA\nAdvanced Light Source, Lawrence Berkeley National Laboratory, Berkeley, California 94720, USA\n3\nMaterials Science Division, Argonne National Laboratory, Argonne, Illinois 60439, USA\n4\nInstituut Lorentz for Theoretical Physics, Leiden University, POB 9506, 2300 RA Leiden, The Netherlands\n5\nDepartment of Physics, University of Waterloo, Waterloo, Ontario, Canada N2L 3G1\n6\nCREST, Department of Applied Physics, University of Tokyo, Bunkyo-ku, Tokyo 113, Japan\n2\n\nABSTRACT\nAngle-resolved photoemission spectroscopy data for the bilayer manganite La1.2Sr1.8Mn2O7 show\nthat, upon lowering the temperature below the Curie point, a coherent polaronic metallic groundstate\nemerges very rapidly with well defined quasiparticles which track remarkably well the electrical\nconductivity, consistent with macroscopic transport properties. Our data suggest that the mechanism\nleading to the insulator-to-metal transition in La1.2Sr1.8Mn2O7 can be regarded as a polaron coherence\ncondensation process acting in concert with the Double Exchange interaction.\nprofound analogies to the case of underdoped HTSC,\nwhere the superconducting transition is controlled by the\nphase coherence of the Cooper pairs.\nHigh-quality single crystals were grown with the floating\nzone method [10]. The ARPES measurements were carried\nout on beamline 10.0.1 at the Berkeley Advanced Light\nSource using a Scienta R4000 electron analyzer in the 14°\nangle mode, , with an angular resolutions of ± 0.15° ( ≈ 8.3\n× 10-3 Å-1 in momentum space). The samples were cleaved\nin ultrahigh vacuum (ca. 1-2 x 10-11 torr) at 30 K and\nmeasured with a total instrumental energy resolution of 20\nmeV.\nFig. 1 shows two Energy Distribution Curves (EDC) data\nsets collected below and above TC. The polaron spectral\nfunction consists of a low energy QP peak representing the\nphase coherence of the dressed electrons, and a high energy\nincoherent peak (the hump, H) which tracks closely the\nbare dispersion, in essence reflecting the rapid motion of\nundressed carriers in a frozen lattice configuration [11].\nUpon increasing temperature above TC, the QP peak\ndisappears as a result of the loss of coherence [8. On the\ncontrary, the high energy branch does not show dramatic\nchanges, although we note a shift towards higher binding\nenergies (BE) of the hump peak position in the spectra\ncorresponding to momenta k approaching the Fermi\nmomentum kF, a phenomenology that we discuss in more\ndetail below.\nThe temperature dependent evolution of the QP peak at\nkF is rather abrupt close to TC, showing a collapse when\nthe temperature is raised from T = 86 K to T = 124 K, a\nbehaviour which can not be accounted by thermal\nbroadening effects, but rather suggests a relationship to\nthe macroscopic properties of LSMO (Fig. 2a).\nSurprisingly, the temperature dependence of the\nintegrated spectral weight of the QP peak at kF, which is\ndirectly proportional to Z [12], tracks extremely well the\nDC conductivity curve σDC as measured on samples\n\nLa1.2Sr1.8Mn2O7 (x = 0.4, LSMO) is a prototypical\nbilayer manganite which exhibits the colossal\nmagnetoresistive (CMR) effect by exploiting a transition\nfrom a ferromagnetic metallic (FM) groundstate to a\nparamagnetic insulating (PI) state above the Curie\ntemperature TC = 120 K. Scattering measurements have\nprovided direct evidence for the presence in the PI state\nof small lattice polarons with pronounced short ranged\ncorrelations forming a polaron glass phase as temperature\napproaches TC from above [1,2,3]. The mechanism\nresponsible for the melting of the polaron glass into the\nFM state below TC remains unclear. Experimental and\ntheoretical evidence has already suggested that the FM\nphase in the manganites is not a conventional metal as\npredicted by the Double Exchange (DE) model [4], but\nrather a polaronic conductor [5,6,7]. In the particular case\nof LSMO, recent Angle Resolved Photoemission\n(ARPES) experiment revealed that the FM phase is a\npolaronic metal with a strong anisotropic character of the\nelectronic excitations, strikingly similar to the pseudogap\nphase in heavily underdoped cuprate high temperature\nsuperconductors (HTSC) [8]. Despite a strong mass\nenhancement and a small renormalization factor or pole\nstrength Z ≈ 0.1, the small but well-defined quasiparticle\n(QP) along the [110] or \"nodal\" direction is found to\naccount for the metallic properties [8,9].\nIn this Letter, we present detailed ARPES\nmeasurements of the temperature dependent evolution of\nthe QP excitations across the PI-to-FM transition. The\ncoherent, polaronic FM groundstate emerges with well\ndefined QPs which, despite a very small pole strength Z,\ntrack remarkably well the DC conductivity, consistent\nwith the macroscopic transport properties. The onset of\nthe FM groundstate is attained in a collective fashion by a\nkinetic energy-driven polaron condensation that\ndramatically enhances the spin DE interaction. This\ncoherence-driven insulator-to-metal transition exhibits\n1\n\n\fgrown in the same laboratory [13], thus yielding an\nempirical \"σDC ∝ Z\" law (Fig. 2b). It is indeed remarkable\nthat there exist such a net correspondence between DC\nconductivity data and an angle-resolved single particle\nexcitation spectrum. To our knowledge, there is no theory\nof transport which can provide an explanation as to why\nσDC should be entirely set by the QP pole strength Z. [14].\nOn the contrary, our data suggest a profound link between\ntransport properties and QP coherence.\n\nIntensity (arb. units)\n\ncrossover from a low temperature coherent metallic state\nto a high temperature PI phase with diffusive, incoherent\nmotion of small polarons.\n33 K\n48 K\n68 K\n86 K\n\n106 K\n124 K\n132 K\n149 K\n168 K\n\na)\n\n-0.4\n\n-0.3\n\n-0.2\n\n-0.1\n\n0.0\n\n0.1\n\nE – EF (eV)\n1.0\n0.8\n\n0.6\n\n0.6\n\n0.4\n\n0.4\n\nσab/σab30K\n\n0.8\n\n0.2\n\n0.2\n\nb)\n\n0.0\n\n0.0\n30\n\n60\n\n90\n\n120\n\nTemperature (K)\n\n150\n\nQP weight / Qp weight 30K\n\nTC\n\n1.0\n\nFig. 2 (color online). (a) Temperature dependences of the\nQP peak at kF along the (0,0) to (π,π) \"nodal\" direction. (b)\nIntegrated QP spectral weight and in-plane DC conductivity\nσab (from13). Both the QP weight and σab have been\nnormalized to their value at 30 K. Open and filled squares\ndenote warm up and cooling down cycles, respectively.\n\nFig. 1 (color online). Comparison between the eg band\ndispersions (a) below and (b) above TC. The data have been\ncollected along the [110] direction ((0,0) to (π,π), \"nodal\") with\nphoton energy hν = 42 eV and light polarization vector laying\nin the sample plane. The blue lines denote the spectra\ncorresponding to kF ≈ 0.37 Å-1, while the spectra highlighted in\nblack correspond to k ≈ 0.20 Å-1. The inset shows the\ndispersions of the hump peak positions.\n\nIn general, the transition between the coherent and\nhopping polaronic regimes is expected to take place at a\ntemperature of the order of some fraction of =ω0/kB,\nwhere ω0 denotes a fundamental phonon frequency\n[17,18]. In the case of LSMO, however, a mechanism is\nclearly at work which links intimately the degree of\nelectron localization to the onset of ferromagnetism\nsince the coherent-to-incoherent polaron crossover takes\nplace at the Curie temperature TC. The mechanism\nleading to the PI-to-FM transition in LSMO can be\nregarded as a polaron coherence condensation process\nacting in concert with the DE interaction. As the\ntemperature is lowered below TC, a complex many body\nwavefunction is attained in a dynamical percolation\nprocess due to the overlap of the small polarons\nwavefunctions as a result of the increase of their DeBroglie thermal wavelengths, thus transforming the\nclassical insulating liquid of small polarons into a\nquantum-coherent, degenerate metal. The driving force\nfor this transition is the sudden reduction of kinetic\nenergy induced by the synergy of polaron condensation\nand the DE interaction. This synergistic interaction is\ncharacterized by a regenerative aspect of carriers\ndelocalization: the polaron condensation fosters metallic\nconductivity by considerably increasing the overlap of\nthe polaron wavefunctions on adjacent sites, thus\nenhancing the DE interaction and leading to\n\nThis state of affairs resembles closely the temperature\ndependence of the QP intensity in the underdoped HTSC\nBi2Sr2CaCu2O8+d (Bi2212) at (π,0) [15]. Rather than at\nT*, the temperature at which the gap opens in the\nunderdoped regime, the QP peak in underdoped Bi2212\nexhibits an abrupt behavior at the superconducting\ntransition temperature at which the phase coherence of the\nCooper pairs sets in. Remarkably, the temperature\ndependence of the QP peak shows a resemblance to\ncollective properties related to the superfluid density,\nwhich characterizes the phase coherence of the Cooper\npairs [15,16].\nThe data here reported for LSMO and the analogies\nwith the case of Bi2212 raise an intriguing and\nfundamental question: is there a common origin for the\nunexpected manifestation of collective effects in the\nsingle-particle excitation spectra in systems as different\nas manganites and underdoped HTSC? Our findings\nindicate that the commonality between LSMO and\nunderdoped Bi2212 has to be identified in the coherencedriven nature of the MIT and superconducting transitions\nin LSMO and HTSC, respectively. While in HTSC the\ntransition temperature TC denotes the onset of phase\ncoherence of the Cooper pairs, in LSMO it marks the\n2\n\n\fbetween the value of Z and the ratio mLDA/m* is far from\nbeing trivial [20]. It indeed suggests that the polarons in\nthe FM phase are almost on-site and not extended to the\nnearest neighbor sites. It is the overlap of the small\npolarons wavefunctions resulting from the increase of\ntheir De-Broglie thermal wavelengths that provides the\ncoherence of the polaronic metal as the temperature is\nlowered.\nFurther insights about the peculiar nature of the\npolaronic metal are provided by the temperature\ndependence of the hump peak position. As already\nindicated in Fig. 1, while the spectra corresponding to\nmomenta lower than k ≈ 0.24 Å-1 do not show any shift\nwith temperature (Fig. 3a), the temperature dependence of\nthe hump peak positions is very pronounced for the spectra\nat kF (Fig. 3b). The variation with temperature of the\ndispersions of the hump peak position is non-monotonic,\nand exhibits an abrupt shift close to TC for the spectra at kF\n(Fig. 3c), suggesting a relationship of this phenomenology\nto the macroscopic properties of LSMO. Surprisingly, the\ntemperature dependence of the hump peak position at kF\ntracks σDC extremely well (Fig. 3d).\nThe temperature dependence of the hump peak position\nat kF can be compared with that of the incoherent\nabsorption (polaron) peak as measured by optical\nconductivity measurements [21,22]. We stress how\nremarkable is the energy scale (hundreds of meV) at\nwhich the spectral weight changes due to modest\ntemperature variations in both ARPES and optics\nexperiments. The hump peak position in ARPES is\ncommonly identified with the polaron BE, thus providing\na rationale for the large energy scale involved in the\nphenomenology described above [23]. At high\ntemperatures, as expected in the case of strong coupling\nlimit where the overlap of the polaron wavefunctions can\nbe neglected (small polarons), the incoherent absorption\npeak measured by optics is found at roughly twice the BE\nof the hump peak in ARPES, indicating that the latter\ndenotes indeed the polaron BE EP. At low temperatures,\nhowever, the ARPES hump peak and the incoherent\nabsorption peak in optics are not any more related in a\nsimple way, most likely as a result of polaron\nwavefunctions overlap, suggesting that a full\nunderstanding of the polaron metal poses a much more\ncomplex many body problem than that of an isolated\nelectron interacting with the lattice (small polaron). More\nimportantly, the correspondence between the temperature\ndependences of the hump peak position at kF and the QP\nspectral weight at EF indicates that Z and EP are related by\na linear dependence like Z ∝ EP/=ω0, whereas\nconventional polaron theories predict a much stronger\ndependence of the form Z ∝ exp (-EP/=ω0), thus providing\nanother distinctive characteristic of the coherent polaronic\nmetal [17]. Our data suggest that the low (QP) and the\nhigh (Hump) energy scale physics are related: the loss of\npolaron quantum coherence, signaled as a collapse of the\nQP peak at very low energy, involves major\nrearrangements on a much higher energy scale visible as a\nconsiderable transfer of spectral weight from the QP peak\nto higher BE resulting in the shift of the hump peak\nposition close to kF. This shift is possibly related to the\nfact that the small JT polarons exhibit larger degrees of\n\na)\n\nk = 0.20 Å-1\n-1.0\n\n-0.5\n\n0.0\n\nT (K) =\n33\n48\n68\n86\n106\n124\n132\n149\n168\n\nb)\n\nk = kF = 0.37 Å-1\n-1.0\n\nE – EF (eV)\n\n-0.5\n\n0.0\n\nE – EF (eV)\n1.5\n\nc)\n0.30\n\nTC\n\n1.2\n\nσab (103 S cm-1)\n\n0.24\n\n0.9\n\n-0.30\n\nd)\n\n-0.50\n-0.55\n\n0.3\n\n-0.8\n\n-0.60\n-0.65\n\n0.0\n\nkF\n\n-0.6\n\nE – EF (eV)\n\n-0.4\n\n-0.40\n-0.45\n\n0.6\n\n0.36\n\n-0.35\n\n30\n\n60\n\n90\n\n120\n\n150\n\nTemperature (K)\n\nHump peak position at kF (eV)\n\nMomentum (Å-1)\n\nIntensity (arb. units)\n\nferromagnetism, while the DE interaction in turn\nenhances the carriers mobility and accelerates the\npolaron coherence condensation. We stress that both the\npolaron condensation and DE interaction are necessary\nfor the MIT in LSMO. While the DE alone would not be\nsufficient to drive the MIT, it stills plays a crucial role in\ntipping the balance between the competing tendencies\ntowards localization and delocalization.\nThe \"σDC ∝ Z\" relation can be qualitatively\nrationalized by considering the metallic state as yielded\nby a superposition of a coherent quantum state, which\nwe refer to as polaron groundstate, and a highly\ndegenerate classical state at higher energy formed by\nsmall Jahn-Teller (JT) polarons, which we refer to as\nsmall polaron state. While the polaron groundstate is\nunique, the small polaron state is highly degenerate\nbecause the number of possibilities of forming a small\nJT polaron is of the order of the number of lattice sites.\nAs the temperature is increased, the polaron groundstate\nis easily excited to the small polaron state with larger\nentropy. The fraction of polaron groundstate is thus a\ndecreasing function of temperature, like σDC in the\nmetallic state, with the loss of polaron quantum\ncoherence being signalled by the progressive\ndisappearance of the QP peak.\n\nFig. 3 (color online). Temperature dependence of the hump\npeak corresponding to (a) k ≈ 0.20 Å-1 and (b) kF ≈ 0.37 Å-1. (c)\nDispersions of the hump peak position at kF as a function of\ntemperature. (d) Comparison between the variation with\ntemperature of the hump peak position at kF and σab (from 13).\nOpen and filled squares denote warm up and cooling down\ncycles, respectively.\n\nWe emphasize that by \"polaron groundstate\" we\ndesignate a distinctive state which is not to be identified\nwith the canonical large polaron, but rather a state\nwherein all the particles in the system are locked in a\ncomplicated many body wavefunction whose expansion\non a basis of single particle states yields the QP pole\nstrength Z ≈ 0.10. This estimate of Z is in good\nagreement with the value determined from the ratio of\nthe QP effective mass m* and the bare band mass mLDA,\nnamely Z = mLDA/m*≈ 0.16, a legitimate estimate when a\npossible momentum dependence of the self energy is\nneglected [19]. However, this direct correspondence\n3\n\n\flattice distortions and a larger number of phonons than in\nthe coherent polaron state below TC.\nIn summary, we provide experimental evidence that the\ntemperature variation of σDC in LSMO is intimately\nrelated to that of the coherent QP weight Z, a quantity in\nessence representing the coherent fraction of the polaronic\nmetallic groundstate. Our data suggest that the mechanism\nleading to the insulator-to-metal transition in LSMO can\nbe regarded as a polaron coherence condensation process\nacting in concert with the DE interaction. The driving\nforce for this transition is the sudden onset of coherence\nand concomitant reduction of kinetic energy induced by\n\nthe synergistic and regenerative interaction between the\npolarons condensation and the DE interaction. The\nanalogy of this effect to the case of underdoped Bi2212\nsuggests that coherence-driven transitions are a common\ndenominator for the high temperature quantum\nphenomena in transition metal oxides.\nThe work at the ALS is supported by the DOE Office of\nBasic Energy Science, Division of Material Science, under\ncontracts DE-FG03-01ER45929-A001 and DE-AC03765F00515. The work at Stanford is supported by NSF\ngrant DMR-0304981 and ONR grant N00014-04-1-0048P00002.\n\n* NMannella@lbl.gov, # zxshen@stanford.edu\n\n[1] L. Vasiliu-Doloc, S. Rosenkranz, R. Osborn, S. K.\nSinha, J. W. Lynn, J. Mesot, O. H. Seeck, G. Preosti, A. J.\nFedro, and J. F. Mitchell, Phys. Rev. Lett. 83, 4393 (1999).\n[2] B. J. Campbell, R. Osborn, D. N. Argyriou, L. VasiliuDoloc, J. F. Mitchell, S. K. Sinha, U. Ruett, C. D. Ling, Z.\nIslam, and J. W. Lynn, Phys. Rev. B 65, 014427 (2001).\n[3] D. N Argyriou, J. W. Lynn, R. Osborn, B. Campbell, J.\nF. Mitchell, U. Ruett, H. N. Bordallo, A. Wildes, and C. D.\nLing, Phys. Rev. Lett. 89, 036401 (2002).\n[4] C. Zener, Phys. Rev. 82, 403 (1951).\n[5] A. S. Alexandrov and A.M. Bratkovsky, Phys. Rev.\nLett. 82, 141 (1999); A.S. Alexandrov, Guo-meng Zhao, H.\nKeller, B. Lorenz, Y. S. Wang, and C. W. Chu, Phys. Rev.\nB 64, 140404(R) (2001); A.S. Alexandrov, A.M.\nBratkovsky and V.V. Kabanov, Phys. Rev. Lett. 96, 117003\n(2006).\n[6] G. Zhao, V. Smolyaninova , W. Prellier and H. Keller,\nPhys. Rev. Lett. 84, 6086 (2000); G. Zhao, D. J. Kang, W.\nPrellier, M. Rajeswari, H. Keller, T. Venkatesan, and R. L.\nGreene, Phys. Rev. B 63, 060402(R) (2000).\n[7] V.M. Pereira, J.M. Lopes dos Santos, A.H. Catro Neto,\nCond-mat/0505741\n[8] N. Mannella, W. Yang, X. J. Zhou, H. Zheng, J. F.\nMitchell, J. Zaanen, T. P. Devereaux, N. Nagaosa, Z.\nHussain and Z.-X. Shen, Nature 438, 474 (2005).\n[9] We extracted the value Z ≈ 0.10 in the FM groundstate\nby first considering the spectrum corresponding to kF ≈ 0.37\nÅ-1 at 30 K and then fitting the QP peak with a resolutionbroadened lorentzian curve. Z is the ratio of the areas of the\nlorentzian curve and the peak-dip-hump structure after\nsubtracting its inelastic background.\n[10] J. F. Mitchell, D. N. Argyriou, J. D. Jorgensen, D. G.\nHinks, C. D. Potter, and S. D. Bader, Phys. Rev. B 55, 63\n(1997).\n[11] V. Perebeinos and P.B. Allen, Phys. Rev. Lett. 85,\n5178 (2000).\n\n4\n\n[12] The QP weight has been integrated in a ± 30 meV\nwindow around EF after subtracting a constant offset.\nReducing or increasing the window size up to ≈ 60 meV,\na value comparable to the QP peak width, results in the\nsame QP weight variation with temperature. Since the\nsame temperature dependence is obtained when the QP\nweight is normalized with respect to the intensity of the\nentire peak-dip-hump structure after subtracting a Shirley\nbackground, the temperature dependence of the QP\nweight can unambiguously be identified with that of Z.\n[13] Q.A. Li, K.E. Gray, J.F. Mitchell, Phys. Rev. B 63,\n024417 (2000).\n[14] In a Fermi liquid the scattering rate and the QP mass\nare both renormalized, and these renormalizations cancel\neach other in the expression for σDC. See A.J. Millis and\nP.A. Lee, Phys. Rev. B 35, 3394 (1987).\n[15] D. L. Feng, D. H. Lu, K. M. Shen, C. Kim, H. Eisaki,\nA. Damascelli, R. Yoshizaki, J.-i. Shimoyama, K. Kishio,\nG. D. Gu, S. Oh, A. Andrus, J. O'Donnell, J. N. Eckstein,\nZ.-X. Shen, Science 289, 277 (2000).\n[16] H. Ding J. R. Engelbrecht, Z. Wang, J. C.\nCampuzano, S.-C. Wang, H.-B. Yang, R. Rogan, T.\nTakahashi, K. Kadowaki, and D. G. Hinkset, Phys. Rev.\nLett. 87, 227001 (2001).\n[17] A. S. Alexandrov and S. N. Mott, Polarons and\nBipolarons, World Scientific (1995).\n[18] S. Fratini and S. Ciuchi, Phys. Rev. Lett. 91, 256403\n(2003).\n[19] J. W.Negele and H. Orland, Quantum many-particle\nsystems, Perseus Books, 1988.\n[20] Z and the ratio mLDA/m* are in general different\nfactors: while Z is determined by the overlap of the many\nbody wavefunctions with and without an electron, the\neffective mass is sensitive to the wavefunctions overlap\nwith electrons occupying neighboring sites.\n[21] T. Ishikawa, T. Kimura, T. Katsufuji, Y. Tokura,\nPhys. Rev. B 57, R8079 (1998).\n[22] Myung Whun Kim, H. J. Lee, B. J. Yang, K. H. Kim,\nY. Moritomo, Jaejun Yu, and T. W. Noh, Phys. Rev. Lett.\n98, 187201 (2007).\n[23] The hump peak in ARPES represents the envelope of\nthe Poissonian distribution of the phonon sidebands. See\nfor example A.S. Alexandrov and J. Ranninger, Phys.\nRev. B 45, 13109(R) (1992); S. Ciuchi, F. de Pasquale, S.\nFratini, D. Feinberg, Phys. Rev. B 56, 4494 (1997).\n\n\f"}