{"id": "http://arxiv.org/abs/1104.1241v3", "guidislink": true, "updated": "2011-06-28T05:30:48Z", "updated_parsed": [2011, 6, 28, 5, 30, 48, 1, 179, 0], "published": "2011-04-07T05:12:06Z", "published_parsed": [2011, 4, 7, 5, 12, 6, 3, 97, 0], "title": "Thermally-Limited Current Carrying Ability of Graphene Nanoribbons", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1104.4432%2C1104.5129%2C1104.1542%2C1104.2318%2C1104.4115%2C1104.5253%2C1104.4396%2C1104.1187%2C1104.1878%2C1104.0273%2C1104.0058%2C1104.4456%2C1104.5203%2C1104.4620%2C1104.4837%2C1104.0731%2C1104.4580%2C1104.1984%2C1104.2719%2C1104.2236%2C1104.2774%2C1104.1734%2C1104.4364%2C1104.0323%2C1104.5197%2C1104.1075%2C1104.0855%2C1104.4519%2C1104.0439%2C1104.5076%2C1104.3855%2C1104.0814%2C1104.3037%2C1104.0475%2C1104.1241%2C1104.5472%2C1104.1888%2C1104.4730%2C1104.2792%2C1104.5083%2C1104.3660%2C1104.0209%2C1104.5478%2C1104.3486%2C1104.0756%2C1104.1736%2C1104.4860%2C1104.2351%2C1104.1844%2C1104.3898%2C1104.5101%2C1104.4784%2C1104.4539%2C1104.0274%2C1104.3632%2C1104.4124%2C1104.3615%2C1104.5013%2C1104.4548%2C1104.4882%2C1104.3044%2C1104.1826%2C1104.2925%2C1104.3613%2C1104.4293%2C1104.4206%2C1104.1010%2C1104.1457%2C1104.3170%2C1104.1897%2C1104.4703%2C1104.4241%2C1104.3634%2C1104.4381%2C1104.0874%2C1104.1812%2C1104.2436%2C1104.1442%2C1104.1393%2C1104.5186%2C1104.4641%2C1104.1675%2C1104.2433%2C1104.4735%2C1104.1533%2C1104.1905%2C1104.1559%2C1104.4522%2C1104.1255%2C1104.1419%2C1104.2039%2C1104.0796%2C1104.5092%2C1104.1696%2C1104.0084%2C1104.2306%2C1104.1224%2C1104.3032%2C1104.4995%2C1104.3853%2C1104.2688&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Thermally-Limited Current Carrying Ability of Graphene Nanoribbons"}, "summary": "We investigate high-field transport in graphene nanoribbons (GNRs) on SiO2,\nup to breakdown. The maximum current density is limited by self-heating, but\ncan reach >3 mA/um for GNRs ~15 nm wide. Comparison with larger, micron-sized\ngraphene devices reveals that narrow GNRs benefit from 3D heat spreading into\nthe SiO2, which enables their higher current density. GNRs also benefit from\nlateral heat flow to the contacts in short devices (< ~0.3 um), which allows\nextraction of a median GNR thermal conductivity (TC), ~80 W/m/K at 20 C across\nour samples, dominated by phonons. The TC of GNRs is an order of magnitude\nlower than that of micron-sized graphene on SiO2, suggesting strong roles of\nedge and defect scattering, and the importance of thermal dissipation in small\nGNR devices.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1104.4432%2C1104.5129%2C1104.1542%2C1104.2318%2C1104.4115%2C1104.5253%2C1104.4396%2C1104.1187%2C1104.1878%2C1104.0273%2C1104.0058%2C1104.4456%2C1104.5203%2C1104.4620%2C1104.4837%2C1104.0731%2C1104.4580%2C1104.1984%2C1104.2719%2C1104.2236%2C1104.2774%2C1104.1734%2C1104.4364%2C1104.0323%2C1104.5197%2C1104.1075%2C1104.0855%2C1104.4519%2C1104.0439%2C1104.5076%2C1104.3855%2C1104.0814%2C1104.3037%2C1104.0475%2C1104.1241%2C1104.5472%2C1104.1888%2C1104.4730%2C1104.2792%2C1104.5083%2C1104.3660%2C1104.0209%2C1104.5478%2C1104.3486%2C1104.0756%2C1104.1736%2C1104.4860%2C1104.2351%2C1104.1844%2C1104.3898%2C1104.5101%2C1104.4784%2C1104.4539%2C1104.0274%2C1104.3632%2C1104.4124%2C1104.3615%2C1104.5013%2C1104.4548%2C1104.4882%2C1104.3044%2C1104.1826%2C1104.2925%2C1104.3613%2C1104.4293%2C1104.4206%2C1104.1010%2C1104.1457%2C1104.3170%2C1104.1897%2C1104.4703%2C1104.4241%2C1104.3634%2C1104.4381%2C1104.0874%2C1104.1812%2C1104.2436%2C1104.1442%2C1104.1393%2C1104.5186%2C1104.4641%2C1104.1675%2C1104.2433%2C1104.4735%2C1104.1533%2C1104.1905%2C1104.1559%2C1104.4522%2C1104.1255%2C1104.1419%2C1104.2039%2C1104.0796%2C1104.5092%2C1104.1696%2C1104.0084%2C1104.2306%2C1104.1224%2C1104.3032%2C1104.4995%2C1104.3853%2C1104.2688&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We investigate high-field transport in graphene nanoribbons (GNRs) on SiO2,\nup to breakdown. The maximum current density is limited by self-heating, but\ncan reach >3 mA/um for GNRs ~15 nm wide. Comparison with larger, micron-sized\ngraphene devices reveals that narrow GNRs benefit from 3D heat spreading into\nthe SiO2, which enables their higher current density. GNRs also benefit from\nlateral heat flow to the contacts in short devices (< ~0.3 um), which allows\nextraction of a median GNR thermal conductivity (TC), ~80 W/m/K at 20 C across\nour samples, dominated by phonons. The TC of GNRs is an order of magnitude\nlower than that of micron-sized graphene on SiO2, suggesting strong roles of\nedge and defect scattering, and the importance of thermal dissipation in small\nGNR devices."}, "authors": ["Albert D. Liao", "Justin Z. Wu", "Xinran Wang", "Kristof Tahy", "Debdeep Jena", "Hongjie Dai", "Eric Pop"], "author_detail": {"name": "Eric Pop"}, "author": "Eric Pop", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.106.256801", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1104.1241v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1104.1241v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "this version (v3) is very similar to that ultimately published in PRL", "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1104.1241v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1104.1241v3", "journal_reference": "Phys. Rev. Letters 106, 256801 (2011)", "doi": "10.1103/PhysRevLett.106.256801", "fulltext": "1\n\nThermally-Limited Current Carrying Ability of\nGraphene Nanoribbons\nAlbert D. Liao1,2,†, Justin Z. Wu3,4,†, Xinran Wang4, Kristof Tahy5, Debdeep Jena5, Hongjie\nDai4,*, Eric Pop1,2,6,*\n1\n\nDept. of Electrical & Computer Eng., Univ. Illinois at Urbana-Champaign, Urbana IL 61801\nMicro and Nanotechnology Lab, Univ. Illinois at Urbana-Champaign, Urbana IL 61801\n3\nDept. of Electrical Engineering, Stanford Univ., Stanford, CA 94305\n4\nDept. of Chemistry & Laboratory for Advanced Materials, Stanford Univ., Stanford, CA 94305\n5\nDept. of Electrical Engineering, University of Notre Dame, Notre Dame, IN 46556, USA\n6\nBeckman Institute, Univ. Illinois at Urbana-Champaign, Urbana IL 61801\n2\n\nWe investigate high-field transport in graphene nanoribbons (GNRs) on SiO2, up to breakdown.\nThe peak current density is limited by self-heating and scales inversely with width, but can reach\n>3 mA/μm for GNRs ~15 nm wide. Dissipation from larger devices is limited by the SiO2, but in\nshort GNRs (<~0.3 μm) it also depends on heat flow along the graphene. This allows extraction\nof a median GNR thermal conductivity (TC), ~80 (130) Wm-1K-1 at 20 (600) oC across our samples, dominated by phonons, with estimated <10% electronic contribution. The TC of GNRs is\nan order of magnitude lower than that of micron-sized graphene on SiO2, suggesting strong roles\nof edge and defect scattering, and the importance of thermal dissipation in small GNR devices.\n\nThis manuscript was published as Phys. Rev. Letters 106, 256801 (2011)\n\n†\n*\n\nThese authors contributed equally to this work.\nContact: epop@illinois.edu and hdai@stanford.edu\n\n\f2\nGraphene nanoribbons (GNRs) are promising materials for nanoelectronics [1, 2], however\nmany unknowns persist about their electrical and thermal properties. Among these, the maximum\ncurrent density of GNRs is important both for fundamental and practical reasons: it is relevant to\nknow what its limiting mechanisms are, how it compares to carbon nanotubes (CNTs), and to\ndetermine the maximum load a GNR transistor could drive within a circuit. By comparison, the\ncurrent in single-wall CNTs is limited to tens of microamperes in diffusive transport due to selfheating and optical phonon scattering [3, 4], although larger currents can be achieved in short\nquasi-ballistic samples [5], under ambipolar transport [6], or under avalanche conditions [7].\nHowever, GNRs differ from CNTs in two key aspects: first, they have edges which can cause\nsignificant scattering, affecting both electrical and thermal transport [1, 8]. Second, they lie flat\non the substrate, which increases their heat dissipation compared to CNTs [9, 10] and can lead to\nlesser heat-limited current degradation. Nevertheless, to date no studies exist on the maximum\ncurrent density of GNRs, or their dissipative behavior under high-field transport.\nHere, we study the current carrying ability of GNRs on SiO2 up to breakdown, and uncover\nkey roles of heat dissipation both along and perpendicular to the device. We measure current\ndensities up to ~3 mA/μm in ~15 nm wide GNRs, exceeding those typically available in silicon\ndevices. However, the maximum current of GNRs is limited by the high temperature they\nachieve through Joule self-heating. The high-field behavior and breakdown of GNRs is also sensitive to their thermal conductivity (TC), which enables an extraction of this key parameter.\nGNR devices as shown in Fig. 1 were fabricated from solution-deposited GNRs [11], with\nmore details given in the supplement [12]. For comparison, larger exfoliated graphene (XG)\nsamples were also created, with dimensions defined by oxygen plasma pattering. Both types of\nsamples were placed on SiO2 (tox = 300 nm)/Si substrates, with Si also serving as the back-gate\n(G). Source (S) and drain (D) electrodes were made with Pd (20 nm) for GNRs and Cr/Au\n(2/200 nm) for XG devices. GNRs had widths ranging from W = 16-90 nm and lengths L = 0.20.7 μm. XG devices had W = 0.1-2.6 μm and lengths L = 3.9-9.7 μm.\nTo study the upper limits of high-field transport, we measure ID–VDS until devices break\nfrom Joule self-heating, as shown in Fig. 1(b). This is similar to the breakdown thermometry\ntechnique previously applied to CNTs [10, 13] and nanowires [14]. Like with CNTs, the current\ndrops sharply to zero, creating a small gap in the GNR as imaged in Fig. 1(c). Measurements\n\n\f3\nwere made in ambient air, where breakdown (BD) occurs by oxidation at TBD ≈ 600 oC [10]. By\ncomparison, breakdown of control samples in vacuum (~7×10-6 Torr) occurred at six times higher power [Fig. 2(a)], suggesting other failure mechanisms such as defect formation, SiO2 damage\n[10], or even GNR melting (known to occur at ~3600 oC). An existing graphene model [15, 16]\nwas adapted for GNRs [12], calculating ID as a function of applied VGS, VDS and temperature T\nunder diffusive transport conditions:\n\nL\n\nFx\nI D  qWVDS  \ndx \n 0 n VGx , Tx   vd  Fx , Tx  \n\n1\n\n(1)\n\nwhere q is the elementary charge, x is the coordinate along the graphene channel, n is the total\ncarrier density at location x, VGx = VG – Vx is the potential between gate and location x, Fx =\n-dVx/dx is the electric field, and vd is the drift velocity including saturation and temperature effects as in Ref. [16]. The current in eq. (1) is solved self-consistently with the Poisson equation\nand the heat equation along the GNR [15], both including 3-dimensional (3D) fringing effects in\nthe capacitance [12] and substrate heat dissipation [g in eq. (3) below]. Simulated ID–VDS curves\nand breakdown voltages in Fig. 1(b) are in good agreement with the experimental data when selfheating (SH) is enabled in the model (solid lines). Without SH the simulated currents are much\nhigher and breakdown is not observed as the temperature remains unchanged.\nTo gain more physical insight into the scaling of SH in such devices, we consider the power\ndissipation at breakdown, PBD = IBD(VBD – IBDRC) [10], where RC is the electrical contact resistance [12], and IBD and VBD are the current and voltage at breakdown, respectively. We plot PBD\nvs. the square root of the device channel area in Fig. 2(a). To understand the scaling trend observed, we compare the experimental results with the analytic solution of the heat equation along\nthe graphene devices, similar to CNTs [17]:\n cosh  L / 2 LH   gLH RT sinh  L / 2 LH  \nPBD  gL TBD  T0  \n\n cosh  L / 2 LH   gLH RT sinh  L / 2 LH   1 \n\n(2)\n\nwhere T0 is the ambient temperature, LH is the thermal healing length along the device and g is\nthe thermal conductance to substrate per unit length [eq. (3) below]. The thermal resistance at the\nmetal contacts is RT = LHm/[kmtm(W + 2LHm)]. Here tm is the thickness and km ≈ 22 Wm-1K-1 is the\nTC of the metal electrodes (estimated with the Wiedemann-Franz law [18] using their measured\n\n\f4\nresistivity), and LHm is the thermal healing length of heat spreading into the metal contacts. The\ntwo healing lengths are LH = (kWt/g)1/2 and LHm = [km/(koxtmtox)]1/2, both of the order ~0.1 μm\nhere. The TC of SiO2 kox = 1.3 Wm-1K-1, while t is the thickness and k the TC of the graphene.\nThe heat loss coefficient into the substrate is written as [12]:\n1\n\n\n\n kox\nk\nR\n\n\ng \n ox W   Cox ,\nW\n\n ln 6  tox W  1  tox \n\n1\n\n(3)\n\nand consists of the series combination of the thermal resistance at the graphene/SiO2 interface,\nRCox [9, 19, 20], and the 3D spreading thermal resistance into the SiO2 written here as an analytic\nfit to detailed finite element simulations [12].\nThe two dashed lines in Fig. 2(a) show the predictions of the model for k = 50 and 500\nWm-1K-1. We note that for device dimensions (WL)1/2 ≫ 0.3 μm, or approximately three times\nthe healing length, heat dissipation is essentially independent of heat flow along the graphene,\nand thus on its TC. As a result, dissipation in larger devices made with exfoliated graphene (XG)\nin Fig. 2 can also be estimated with the simplified approach in Ref. [16]. However for GNRs\nwith dimensions ≤ 3LH, heat dissipation occurs in part along the GNR, and this observation is\nused below to extract their TC. In Fig. 2(b) we plot the maximum current density IBD per width\nW at the breakdown point (temperature ~TBD), and find it can reach over 3 mA/μm for the narrowest GNRs. This current density appears to scale inversely with width which, at first sight, is a\ncounterintuitive finding compared to silicon devices. This also appears at odds with the present\nunderstanding that GNRs have significantly lower mobility than large-area graphene [2].\nWe suggest that GNRs can dissipate more power and thus carry higher current density at a\ngiven temperature (here, breakdown temperature TBD), consistent with a significant role of 3D\nheat spreading [9]. Figures 3(a-b) display the total device thermal conductance per unit area G\"\n= PBD/(TBD – T0)/(WL) obtained from the experiments (symbols) and the analytic model from eq.\n(2) (solid lines). We note that for a given device the maximum power (and current) at breakdown\nare proportional to G\". Similar to Fig. 2(b), we find that both the experimental data and our\nmodel scale inversely with the GNR width. To gain a physical understanding of these trends, we\nconsider the heat spreading schematics in Figs. 3(c-e). For „large‟ graphene in Fig. 3(c) dissipation occurs mainly „down‟ into the oxide. Thus, G\" = 1/(RCox + tox/kox) is independent of device\ndimensions when L,W → ∞ [in practice (LW)1/2 ≫ 3LH], as shown with dash-dotted line in Figs.\n\n\f5\n3(a-b). In general, this expression may include a small heat spreading term into the Si wafer [9,\n16], which was negligible here [12]. For large graphene devices the constant expression is also\nrecovered as G\" = g/W when taking the limit W → ∞ of eq. (3).\nIn contrast, for „narrow‟ GNRs the lateral 3D heat spreading into the SiO2 becomes a significant component of the overall thermal conductance of a device [Fig. 3(d)]. In addition, for\n„short‟ devices some heat is conducted along the graphene and into the contacts as well [Fig.\n3(e)]. The amount of heat carried out in this manner will depend on the TC and length of the device. The three solid lines in Fig. 3(a) show what the modeled G\" predicts for k = 50, 250, and\n500 Wm-1K-1. As the TC increases, heat is carried more efficiently along the GNR. The device\nlength also matters for „short‟ GNRs with L ≤ 3LH, when heat generated within the graphene\nchannel is sunk more effectively into the contacts [12, 17]. As a result, the thermal conductance\nG\" increases as L decreases in Fig. 3(b) (also see [12]). In both cases, as the heat dissipation increases, we also see an increase in device current density as plotted in Fig. 2(b), thus confirming\nthat Joule self-heating is a key current limiter in GNR devices.\nSince heat dissipation is sensitive to heat flow along „short‟ GNRs, it is possible to extract\ntheir TC, as shown in Fig. 4. To accomplish this, we iteratively vary k within LH in eq. (2) until\nthe predicted breakdown power matches the measurements, for each device (we assume a unique\nk for each GNR). To estimate the confidence intervals of extracted TC for our GNRs, we consider a range RCox = 1–5 × 10-8 m2K/W for the graphene/SiO2 interface thermal resistance [19-21],\nand an uncertainty of ±1 layer in the GNR thickness [12]. The extracted TC along with data from\nthe literature on „large‟ graphene [22-24] are displayed in Fig. 4(a). We find a TC range k = 63450 Wm-1K-1 for our GNRs, as summarized in the histogram of Fig. 4(b), with a median\n~130 Wm-1K-1 (at the TBD = 600 oC), or ~80 Wm-1K-1 at 20 oC, nearly an order of magnitude\nlower than the TC of exfoliated graphene on SiO2 [23]. The room temperature estimate is done\nby assuming a mean free path that is independent of temperature (limited by edge or defect scattering), and considering only the temperature variation of graphene heat capacity [10]. Given that\nwe observe no clear dependence of TC on GNR size (i.e. no size effect) in Fig. 4(a), we surmise\nthat here the TC is limited by edge roughness and defect or impurity scattering. However, the\nrange of values extracted can be attributed to variations in edge roughness and defect or impurity density between samples [12]. For instance, recent scanning tunneling microscopy (STM) studies [25] have found that edges of such GNRs vary from atomically smooth to ~1 nm edge\n\n\f6\nroughness. Simulations [8, 26] suggest that edge disorder could nearly account for the variation\nin TC observed in Fig. 4, while different impurity or defect density between samples will only\nserve to broaden the observed distribution.\nBefore concluding, we examine if the thermal and electrical properties of the GNRs are related, and plot the extracted TC vs. the inverse sheet resistance in the Fig. 4(b) inset. Also plotted\nis the electronic contribution to TC (ke), estimated with the Wiedemann-Franz law [18] to be\nnearly always an order magnitude lower (< 10 Wm-1K-1). This estimate is likely an upper limit,\nas the Lorenz number (L0 = 2.45×10-8 WΩK-2) in graphite is unchanged [27], but in nanostructures where edge scattering dominates it is slightly lower than the bulk value [28]. This simple\nanalysis suggests that TC of GNRs is dominated by phonons at room temperature and above.\nHowever, TC and electrical conductance follow similar trends here, indicating that similar scattering mechanisms limit both phonon and electron transport. These scatterers include edges, impurities and defects in GNRs [2, 8, 26, 29].\nIn conclusion, we have shown that high-field transport in GNRs on SiO2 is limited by selfheating. The maximum current density at a given temperature scales inversely with GNR width\nand reaches >3 mA/μm in ~15 nm wide devices. Dissipation in „large‟ graphene (≫0.3 μm, or\nthree times the thermal healing length) is limited primarily by the SiO2 thickness, but dissipation\nin „small‟ GNRs improves from 3D heat spreading into the SiO2 and heat flow along the GNR to\nthe contacts. Taking advantage of this sensitivity we found a median TC ~ 80 Wm-1K-1 for GNRs\nat room temperature, with less than 10% electronic contribution. We acknowledge funding from\nthe Marco MSD Center, the ONR, AFOSR (EP), the NRI and the NRI Coufal fellowship (AL).\n\n\f7\nReferences:\n[1] A. Cresti et al., Nano Research 1, 361 (2008).\n[2] X. Wang et al., Physical Review Letters 100, 206803 (2008).\n[3] M. Lazzeri, and F. Mauri, Physical Review B 73, 165419 (2006).\n[4] E. Pop et al., Journal of Applied Physics 101, 093710 (2007).\n[5] A. Javey et al., Physical Review Letters 92, 106804 (2004).\n[6] Y. F. Chen, and M. S. Fuhrer, Physical Review Letters 95, 236803 (2005).\n[7] A. Liao, Y. Zhao, and E. Pop, Physical Review Letters 101, 256804 (2008).\n[8] W. Li et al., Physical Review B 82, 041410 (2010).\n[9] E. Pop, Nano Research 3, 147 (2010).\n[10] A. Liao et al., Physical Review B 82, 205406 (2010).\n[11] L. Jiao et al., Nature Nanotechnology 5, 321 (2010).\n[12] Please see supplementary information provided separately.\n[13] H. Y. Chiu et al., Physical Review Letters 95, 226101 (2005).\n[14] A. M. Katzenmeyer et al., IEEE Transactions on Nanotechnology 10, 92 (2011).\n[15] M.-H. Bae et al., Nano Letters 10, 4787 (2010).\n[16] V. E. Dorgan, M.-H. Bae, and E. Pop, Applied Physics Letters 97, 082112 (2010).\n[17] E. Pop, Nanotechnology 19, 295202 (2008).\n[18] C. Kittel, Introduction to Solid State Physics (John Wiley & Sons, Hoboken, NJ, 2005).\n[19] Z. Chen et al., Applied Physics Letters 95, 161910 (2009).\n[20] K. F. Mak, C. H. Lui, and T. F. Heinz, Applied Physics Letters 97, 221904 (2010).\n[21] Y. K. Koh et al., Nano Letters 10, 4363 (2010).\n[22] W. Cai et al., Nano Letters 10, 1645 (2010).\n[23] J. H. Seol et al., Science 328, 213 (2010).\n[24] S. Ghosh et al., Nature Materials 9, 555 (2010).\n[25] C. Tao et al., http://arxiv.org/abs/1101.1141 (2011).\n[26] A. V. Savin, Y. S. Kivshar, and B. Hu, Physical Review B 82, 195422 (2010).\n[27] M. G. Holland, C. A. Klein, and W. D. Straub, J. Phys. Chem. Solids 27, 903 (1966).\n[28] F. Völklein et al., Nanotechnology 20, 325706 (2009).\n[29] T. Fang et al., Physical Review B 78, 205403 (2008).\n\n\f8\nFigure captions:\nFIG. 1 (color online). (a) Schematic of graphene devices used in this work. (b) Measured (symbols) and simulated (lines) current-voltage up to breakdown of GNRs in air. Solid lines are model with self-heating (SH) and breakdown when max(T) > TBD = 873 K, dashed lines are isothermal model without SH (see text and supplement [12]). Dimensions are L/W = 510/20 nm for D1,\nand L/W = 390/38 nm for D2. VGS = -40 V to limit hysteresis effects. (c) Atomic force microscopy (AFM) image of D1 after high-current sweep; arrow shows breakdown location.\nFIG. 2 (color online). (a) Scaling of GNR and XG breakdown power with square root of device\nfootprint, (WL)1/2. Dashed lines are thermal model with k = 50 and 500 Wm-1K-1, RCox = 5×10-8\nm2KW-1 and L/W = 15. Lateral heat sinking and in-plane GNR thermal conductivity begin to\nplay a role in devices < ~0.3 μm (also see Fig. 3). A few devices were broken in vacuum as a\ncontrol group. (b) Scaling of peak current at breakdown vs. device width, demonstrating greater\ncurrent density in narrower GNRs that benefit from 3D heat spreading and lateral heat flow\nalong the GNR. Dashed line drawn to guide the eye.\nFIG. 3 (color online). Thermal conductance of device per unit area (G\") vs. width for graphene\nof varying (a) thermal conductivity and (b) length. Both parameters affect heat sinking along\nGNRs < ~0.3 μm. Symbols follow the notation of Fig. 2. Horizontal dash-dotted line is the limit\nW → ∞ which applies to the case in (c), only \"vertical\" heat sinking through the oxide. The significance of lateral heat spreading from GNRs is shown in (d) and (e), both mechanisms partly\nleading to higher current density in Fig. 2.\nFIG. 4 (color online). (a) Thermal conductivity (TC) of GNRs from this work, compared to\nlarge-area graphene measurements from the literature [22-24]. (b) Histogram of TC for our\nGNRs shows a range 63–450 Wm-1K-1 with a median of 130 Wm-1K-1 at the breakdown temperature (600 oC). The median TC at room temperature is ~40% lower, or ~80 Wm-1K-1, nearly an\norder of magnitude lower than „large‟ exfoliated graphene (XG) on SiO2 [23]. The inset shows\napproximate scaling between TC and electrical sheet conductance, suggesting scattering mechanisms common to both electrons and phonons. The electronic contribution to thermal conductivity\n(ke) is estimated with the Wiedemann-Franz law to be typically <10 Wm-1K-1 or <10%. Dashed\nlines show trends to guide the eye.\n\n\f9\n\nFigure 1:\n\nA\n\n100\n\nL\n\nW\n\nmodel (no SH)\nmodel (SH)\n+x meas.\n\nB\n\nID (A)\n\n80\n60\n\n(D2)\n\n40\n\nC\n\nPd\n(D1)\n\n(D1)\n\n20\n\nVGS = -40 V\n\nPd\n\n250 nm\n\n0\n0\n\n1\n\n2\n3\nVDS (V)\n\n4\n\n\f10\n\nFigure 2:\n\n2\n\n10 2\n10\n\nA\n\ndata1\n\n0\n\n1\n\n10\n\n-1\n10 -1\n\n4 in airdata2\ndata3\n\nIBD/W (mA/m)\nIBD/W (mA/m)\n\nPBD (mW)\n\n10 0\n10\n\nGNR\ndata4\n\n3\n10\nXG\n2\ndata5\n10 0\n-1\n0\ndata6\n10 10\n-1\n0\ndata1\n10\n0.1\n21\n10\n10\ndata7\n1/2 4\ndata2\n(Area) 1/2 (m)\n1\n(Area)\n(\n\nm)\ndata8\n4\n4 -1\ndata3\n10\ndata9\n10B\n1\nGNR\n-1\n0 data4\n3\ndata10\n10\n10 XG\ndata5\n3\n30\n1/2\ndata11\n(Area)\n(\n\nm)\ndata6\n10\n0\n2 -2 data12\ndata7\n10\n2\n2\ndata13\ndata8\nWidth (m)\n-1\ndata14\ndata9\n10\n1\n-1\n0 data15\n1\n1\n10\n10 data10\ndata16\n(Area)1/2 (m) data11\n0\ndata17\ndata12\n-2\n0\n0 1\ndata18\n10\n2\n3\n1\n2\n3\ndata13\n10\n100\n1000\n10\n10\n10\n10\n10\n10\nWidth (m)\ndata19\ndata14\nWidth (nm)\ndata20\ndata15\n\nBD\n\n(mA/\n/W (mA/\nm)\nIIBD\n/W\n(mW)\nPm)\nBD\n\n(mW)\nPBD(mW)\nPBD\n\n1\n\n10 1 in vacuum\n10\n2 (control)\n10\n\ndata16\ndata17\ndata18\ndata19\ndata20\n\n0\n\n10\n\n0\n\n10\n\n\f11\n\nFigure 3:\n\nL=0.5 μm\n\nA\n\nk=500 Wm -1K -1\n\n40\n\n30\n\nk=250 Wm -1K -1 30\nk=50 Wm-1K -1\n\n20\n\n20\n\nG\"(MW K-1m-2)\n\nG\"(MW K-1m-2)\n\n40\n\n10\n0\n1\n10\n10\n\nW∞\n2\n\n100\n10\n\nWidth (nm)\n\nC\nW (wide graphene)\n\nB\n\nk=250 Wm -1K-1\n\nL=0.5 μm\nL=0.75 μm\nL=1 μm\n\n10\n\n0\n1000\n101\n10\n10\n\nW∞\n\n3\n\nD\nW (GNR)\n\n2\n100\n10\n\nWidth (nm)\n\n3\n1000\n10\n\nE\nL\nPd\n\ntox\ntsi\n\nOx\nSi\n\n\f12\n\nFigure 4:\n4\n\n10\n\nk (Wm-1K-1)\n\nXG (suspended) [24]\n3\n\n10\n\nXG (on SiO2) [23]\n\nCVD-G (on SiO2) [22]\n\n2\n\n10\n\n1\n\nA\n\n10\n0.05\n\nGNR (this work)\n\n0.1\n0.15\n0.2\n1/2\n(Area)\n(m)\n\n0.25\n\n3\n\ncounts\n\n6\n4\n\nk (Wm-1K-1)\n\n10\n\nk\n\n2\n\n10\n\n1\n\n10\n\nke\n\n0\n\n10\n\n2\n\n0\n\n1\n\n2 3 4 5 6 7\n-4\n-4 -1\n1/R\n1/RSS(10\n(10 -4 x)-110\n)\n\nB\n0\n0 100 200 300 400 500\nk (Wm-1K-1)\n\n\fSupp-1\n\nSupplementary Information\nfor \"Thermally-Limited Current Carrying Ability of Graphene Nanoribbons\" by Albert Liao,\nJustin Wu, Xinran Wang, Kristof Tahy, Debdeep Jena, Hongjie Dai and Eric Pop\n1. Fabrication Details\nGraphene nanoribbon (GNR) devices were obtained from a 1,2-dichloroethane organic solution of poly(m-phenylenevinylene-co-2,5-dioctoxy-p-phenylenevinylene) (PmPV) by sonication\nof pristine multi-wall nanotubes (MWNTs) that had been calcined at 650 oC [1]. An ultracentrifuge step was performed to remove the remaining nanotubes, following the method described by\nJiao et al [1]. The solution was spin coated onto ~300 nm SiO2 substrates on highly doped silicon\nwafers. After calcination of the coated substrate at 275 oC for 20 minutes to remove the remaining PmPV, an array of 20 nm thick Pd electrodes and pads were defined by e-beam evaporation\nand lift-off. The contacts were annealed in Ar at 200 oC after which the devices were then annealed electrically. Samples were characterized by atomic force microscopy (AFM) and electrical testing to determine which of electrode pairs correspond to valid devices. Such devices consist\nprimarily of non-AB stacked 2-layer GNRs, however some layer variation is seen in Fig. S1 and\nis characterized in Section 2 below.\nFor comparison, micron-sized exfoliated graphene (XG) devices from Graphene Industries\nwere deposited on heavily n-type doped silicon wafers, also with ~300 nm thermal oxide. XG\ndevices were identified using optical and Raman microscopy. The wafers were backsidemetalized after oxide removal in HF to form back-gate contacts. The graphene flakes were then\npatterned using an O2 plasma reactive ion etch with PMMA masks. E-beam evaporated Cr/Au\n(2/200 nm) was used to define the drain and source contacts by e-beam lithography. After metal\ndeposition and lift-off, the samples were annealed in forming gas at ~400 °C for ~2 hours to remove the e-beam resist residue.\n2. Thickness of GNRs:\nAs the graphene nanoribbons (GNRs) are fabricated from multi-walled carbon nanotubes\n[1], the layer stacking orientation is random unlike bulk graphite. Thus we cannot use Raman\nspectroscopy to count the number of layers. Instead we rely on the measured thickness from\nAFM scans to distinguish the number of layers of graphene, as shown in Figure S1. We note that\n\n\fSupp-2\n3.5\n\nonly for counting layers and not in our calculations,\nbecause they are not an accurate measurement of the\nreal thickness. The actual thickness that is used in calculations is the number of layers times the inter-atomic\n\nAFM thickness (nm)\n\nnumerical values from AFM scans (Fig. S1) are used\n\n3\n2.5\n2\n1.5\n\nspacing between graphene sheets (0.34 nm). We also\n\n3. Contact Resistance:\nWe subtract the power dissipated at the contacts\n\nRef. [1]\n\n1\n0\n\nnote that AFM images of ribbons and sheets show similar heights for similar layer numbers.\n\nthis study\n\n1\n\n2\n3\nnumber of layers\n\n4\n\n5\n\nFigure S1. Measured AFM thickness of\nGNR samples vs. number of layers assigned.\nGNRs that correspond to this study are\nrepresented with open circles and ones from\nRef. [1] in filled diamonds.\n\n(I2RC, where RC is the contact resistance) from the total power measured, to obtain only the power dissipated within the graphene. Because the GNR test structures had two terminals, an indirect\nmethod of extracting RC was employed. Measuring the low bias (LB) resistance, which depends\ngeometrically on the sheet and contact resistance [2], we fit the following expression to our data:\n\nRLB \n\nC\nW\n\n\n\nS L\nWt\n\n.\n\n(E1)\n\nHere RLB is the low bias resistance taken from the linear region of the ID-VDS measurement, ρC is\nthe contact resistivity, ρS is the sheet resistivity of graphene, L is the length, W is the width, and t\nis the thickness of the sample. All measurements were performed at VGS = -40 V back-gate bias,\nwhich eliminates hysteresis effects. We find that variations arising from fabrication have a notable impact on the values extracted when comparing two\n1400\n\ndifferent batches of devices shown in Fig. S2. A fit to the\n\n1200\n\nlines) and an average contact resistance is extracted. The\naverage contact resistivity for batch 1 is ρC = RCW\n~ 630 Ω⋅μm and for batch 2 ρC = RCW ~ 250 Ω⋅μm,\nwhich are both typical for graphene-Pd contacts, and\nwithin experimental variation observed by us and other\ngroups. From this, we also obtain the sheet resistance\n(ρS/t) for the inset of Fig. 4(b) in the main text.\n\nRLBW (m)\n\ndata from a given batch is made using eq. E1 (dashed\n\n1000\n800\n600\n400\n\nρC\n\n200\n0\n0\n\n200\n400\n600\nLength/Thickness\n\n800\n\nFigure S2. Measured low-bias resistance\n(RLB) times width vs. length/thickness ratio\nof the GNRs. The y-intercept is the average\ncontact resistance times width. Two fabrication batches yielded different contacts.\n\n\fSupp-3\n\n4. Spreading Thermal Resistance of GNRs:\nWe have calculated the thermal spreading resistance of GNRs on SiO2 by finite element\n(FE) simulations, and then obtained a simple analytic model that matches the FE calculations\nover a wide range of parameters. We note that for „large‟ graphene devices of dimensions\n(WL)1/2 ≫ 3LH (typically ≫ 0.3 μm) the heat sinking occurs simply „vertically‟ through the underlying SiO2, and a simple expression for the overall thermal resistance given by Ref. [3] holds,\nRth = 1/(hA) + tox/(koxA) + 1/(2kSiA1/2) with A = LW the area of the channel, h ≈ 108 Wm-2K-1 the\nthermal conductance of the graphene-SiO2 boundary [4], kox and kSi the thermal conductivities of\nSiO2 and of the doped Si wafer. However, for GNRs there is significant lateral heat spreading\ninto the SiO2 and along the GNR. In Fig. S3 we show results of a few FE simulations of GNRs\ndissipating heat into SiO2; it is clear that a simple model of vertical heat flow is inadequate.\nWe then define the heat dissipation coefficient from GNR into substrate per unit length (g).\nTo understand its physical meaning, consider that in steady-state, for a long GNR (far from the\ncontacts), the temperature at location x along the ribbon is simply given by T(x) = T0 + p'(x)/g\nwhere p'(x) is the power dissipated per unit length (in units of W/m) at location x [5]. We numerically calculate the coefficient g for a variety of graphene device widths, from 10 nm to 6 μm and\nshow the results as symbols in Fig. S4, both for oxide thickness tox = 90 and 300 nm. Here the\nlines are the results of a fit with the simple expression:\n1\n\ng\n\n1\n\n\n\nk ox\nk\nR\n\n ox W   Cox ,\nW\n ln6t ox W  1 t ox \n\n(E2)\n\nwhich (as in the main text) consists of the series combination of the thermal boundary resistance\nat the graphene/SiO2 interface, RCox (see main text) and the spreading thermal resistance into the\nSiO2 written here as an analytic fit to the detailed FE simulations. The simple expression applies\nto both wide and narrow graphene ribbons, and includes both the graphene/SiO2 interface and the\nGNR, w = 20 nm\n0\n\nx 10\n\nw = 30 nm\n\n-7\n\n0\n\n-1\n\n15\n\n-2\n\nSiO2\n\n10\n5\n\n-5\n\nSi\n-2\n\n0\n\nx 10\n\n-7\n\n25\n\n-1\n\n20\n\n-2\n\n15\n\n-4\n-5\n\n2\n\nw = 40 nm\n\n-7\n\n-3\n\n-3\n-4\n\nx 10\n\n-2\n\n0\n\n-7\n\nw = 50 nm\n\n-7\n\n30\n\n0\n\n-1\n\n25\n\n-1\n\n-2\n\n20\n\n-2\n\n10\n\n-3\n\n5\n\n-4\n\n15\n10\n\n-5\n\n2\nx 10\n\n0\n\nx 10\n\n5\n-2\n\n0\n\nx 10\n\n-7\n\n-7\n\n35\n30\n25\n20\n\n-3\n\n15\n10\n\n-4\n\n5\n-5\n\n2\n\nx 10\n\n-2\n\n0\n\n2\nx 10\n\n-7\n\nFigure S3. Finite-element (FE) simulation cross-section of heat spreading from GNRs with width from W = 20-50\nnm on SiO2 with thickness tox = 300 nm.\n\n\fSupp-4\n\n35\n\n(a)\n\n(b)\n\ng (W/K/m)\n\n30\n25\n\nFigure S4. Heat spreading coefficient per unit\nlength from graphene device into substrate, for\nSiO2 thicknesses, tox = 90 and 300 nm. Analytic\nmodel from eq. E2 (lines) shows excellent agreement with finite-element simulations (symbols).\nPanels (a) and (b) display the same results, with\nlinear and logarithmic scales.\n\n10\n\n20\n15\n10\n1\n\n5\n0\n0\n\n1\n\n2\n\n3 4 5\nW (m)\n\n6\n\n7\n\n0.01\n\n0.1\n1\nW (m)\n\n10\n\nthermal conductivity of the SiO2. The thermal conductivity of the underlying Si wafer is not included as it was found (from the FE simulations) that it plays a very minimal role.\nNote that by comparison, the thermal dissipation per length from carbon nanotubes (CNTs)\non SiO2 is of the order gCNT ~ 0.2 WK-1m-1 [5] and thus much lower than in GNRs which are always wider. This value for CNTs was incorrectly applied to GNRs in a previous study [6], leading to an over-estimate of the thermal conductivity of GNRs.\n\n5. Graphene Model Extended to GNRs:\nTo obtain the current-voltage calculations displayed in Fig. 1(b), we extended a previously\ndeveloped graphene finite-element simulation [3, 7]. Modifications include a lower mobility, as\nis typical of such GNRs [8], μ0,1 = 160 cm2V-1s-1 for D1 and μ0,2 = 280 cm2V-1s-1 for D2. A contact resistance RCW = 250 Ω⋅μm was used for both devices in accord with Section #1 above. Together, these parameters were sufficient to model the low-field behavior in Fig. 1(b).\nTo model the high-field and temperature-dependent behavior we used the velocity saturation\nmodel in [3]. The temperature dependence of mobility used was μ(T) = μ0(300/T)1/2, similar to\ncarbon nanotubes [9], but slightly weaker than in „large‟ graphene on SiO2 [3]. We note that decisive temperature-dependent mobility data are not yet available for GNRs, and it is likely these\nwould change from sample to sample due to variation in impurity and edge scattering. However,\nweaker temperature dependence of mobility in GNRs is reasonably expected, as similarly observed in metal nanowires vs. bulk metals [10]. Regardless, as it turns out, the specific mobility\nmodel has less impact on the high-field behavior of GNRs, which is dominated by the high-field\nsaturation velocity, including its carrier density and temperature dependence [3].\n\n\fSupp-5\n\nTo calculate the charge density along the GNR we use the approach in Ref. [3], but here we\nmust include fringing effects in the capacitance of the GNR above the Si back-gate. The GNR\ncapacitance per unit area is modeled similarly to the spreading heat effect in Section #3 above:\n\n\n\n1\nCox   ox 0 \n ,\n ln6tox W  1W tox \n\n(E3)\n\nwhere the first term represents the fringing capacitance and the second term is the parallel plate\ncapacitance of the GNR. The expression reduces to the familiar Cox = εoxε0/tox (in Farads per unit\narea) in the limit W → ∞ as expected for large graphene, and is in good agreement with finiteelement simulations [11].\nThe temperature along the GNR was computed iteratively with the finite-element method\ndescribed in Ref. [7], using k1 = 100 Wm-1K-1 and k2 = 175 Wm-1K-1, scaled consistently with the\nmobility of the two GNRs [note Fig. 4(b) inset in main text], and consistent with thermal conductivity values extracted in the overall study. The heat loss coefficient from GNR to substrate was\nmodeled using the heat spreading expression from eq. E2 above.\n6. Length Dependence on Total Thermal Conductance:\nThe length dependence on the total ther40\n\nG\" and the width as shown in Fig S5. However, the reason for the inverse relation with\nlength is different. As the length of the GNR\ndecreases to the point where it is on the order\nof a few healing lengths (LH), more heat can be\ndissipated into the contacts. It is this dependence on length that allows us to extract the\nthermal conductivity of our samples as indicated in Fig. 4 and Fig. S5.\n\nG\" (MWK-1m-2)\n\nmal conductance G\" is similar to that between\n\n30\n20\n10\n0\n\nW = 25 nm\nW = 50 nm\nW = 100 nm\n\n0\n\n10\nLength (m)\n\n1\n\n10\n\nFigure S5. Length dependence on G\" plotted for 3\ndifferent widths, with k = 100 Wm-1K-1. The length\nof most of our GNR samples falls in the range where\nG\" is sensitive to k, i.e. ~3 healing lengths long.\n\nSupplementary References:\n[1] L. Jiao et al., Nature Nanotechnology 5, 321 (2010).\n[2] A. Venugopal, L. Colombo, and E. M. Vogel, Applied Physics Letters 96, 013512 (2010).\n[3] V. E. Dorgan, M.-H. Bae, and E. Pop, Applied Physics Letters 97, 082112 (2010).\n\n\fSupp-6\n\n[4] Z. Chen et al., Applied Physics Letters 95, 161910 (2009).\n[5] E. Pop et al., Journal of Applied Physics 101, 093710 (2007).\n[6] R. Murali et al., Applied Physics Letters 94, 243114 (2009).\n[7] M.-H. Bae et al., Nano Letters 10, 4787 (2010).\n[8] X. Wang et al., Physical Review Letters 100, 206803 (2008).\n[9] Y. Zhao, A. Liao, and E. Pop, IEEE Electron Device Letters 30, 1078 (2009).\n[10] W. Steinhögl et al., Journal of Applied Physics 97, 023706 (2005).\n[11] C. Lian et al., Applied Physics Letters 96, 103109 (2010).\n\n\f"}