{"id": "http://arxiv.org/abs/1112.4471v1", "guidislink": true, "updated": "2011-12-18T00:22:46Z", "updated_parsed": [2011, 12, 18, 0, 22, 46, 6, 352, 0], "published": "2011-12-18T00:22:46Z", "published_parsed": [2011, 12, 18, 0, 22, 46, 6, 352, 0], "title": "Sub-diffraction thin-film sensing with planar terahertz metamaterials", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1112.4146%2C1112.3684%2C1112.0952%2C1112.5648%2C1112.3409%2C1112.2846%2C1112.1930%2C1112.3709%2C1112.0833%2C1112.4508%2C1112.2436%2C1112.3846%2C1112.4525%2C1112.2787%2C1112.0670%2C1112.3842%2C1112.4257%2C1112.1821%2C1112.3247%2C1112.0107%2C1112.0016%2C1112.6347%2C1112.5832%2C1112.0483%2C1112.5961%2C1112.3916%2C1112.3729%2C1112.5023%2C1112.5888%2C1112.3935%2C1112.2458%2C1112.5051%2C1112.2863%2C1112.3730%2C1112.4820%2C1112.0103%2C1112.2311%2C1112.4135%2C1112.0310%2C1112.3808%2C1112.1651%2C1112.1460%2C1112.4853%2C1112.2666%2C1112.5828%2C1112.1756%2C1112.4265%2C1112.4198%2C1112.2899%2C1112.2456%2C1112.2368%2C1112.6396%2C1112.5897%2C1112.6159%2C1112.6152%2C1112.2254%2C1112.5346%2C1112.4130%2C1112.3403%2C1112.0729%2C1112.1219%2C1112.2723%2C1112.4377%2C1112.4571%2C1112.5665%2C1112.3826%2C1112.2977%2C1112.4870%2C1112.2927%2C1112.3819%2C1112.4746%2C1112.5800%2C1112.4934%2C1112.0850%2C1112.2457%2C1112.6073%2C1112.1664%2C1112.4471%2C1112.1703%2C1112.0089%2C1112.0413%2C1112.2165%2C1112.2057%2C1112.0588%2C1112.2493%2C1112.4230%2C1112.1340%2C1112.1528%2C1112.4470%2C1112.6195%2C1112.0119%2C1112.6320%2C1112.4513%2C1112.6197%2C1112.6338%2C1112.2396%2C1112.5939%2C1112.2485%2C1112.6065%2C1112.0385%2C1112.6198&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Sub-diffraction thin-film sensing with planar terahertz metamaterials"}, "summary": "Planar metamaterials have been recently proposed for thin dielectric film\nsensing in the terahertz frequency range. Although the thickness of the\ndielectric film can be very small compared with the wavelength, the required\narea of sensed material is still determined by the diffraction-limited spot\nsize of the terahertz beam excitation. In this article, terahertz near-field\nsensing is utilized to reduce the spot size. By positioning the metamaterial\nsensing platform close to the sub-diffraction terahertz source, the number of\nexcited resonators, and hence minimal film area, are significantly reduced. As\nan additional advantage, a reduction in the number of excited resonators\ndecreases the inter-cell coupling strength, and consequently the resonance Q\nfactor is remarkably increased. The experimental results show that the\nresonance Q factor is improved by 113%. Moreover, for a film with a thickness\nof \\lambda/375 the minimal area can be as small as 0.2\\lambda by 0.2\\lambda.\nThe success of this work provides a platform for future metamaterial-based\nsensors for biomolecular detection.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1112.4146%2C1112.3684%2C1112.0952%2C1112.5648%2C1112.3409%2C1112.2846%2C1112.1930%2C1112.3709%2C1112.0833%2C1112.4508%2C1112.2436%2C1112.3846%2C1112.4525%2C1112.2787%2C1112.0670%2C1112.3842%2C1112.4257%2C1112.1821%2C1112.3247%2C1112.0107%2C1112.0016%2C1112.6347%2C1112.5832%2C1112.0483%2C1112.5961%2C1112.3916%2C1112.3729%2C1112.5023%2C1112.5888%2C1112.3935%2C1112.2458%2C1112.5051%2C1112.2863%2C1112.3730%2C1112.4820%2C1112.0103%2C1112.2311%2C1112.4135%2C1112.0310%2C1112.3808%2C1112.1651%2C1112.1460%2C1112.4853%2C1112.2666%2C1112.5828%2C1112.1756%2C1112.4265%2C1112.4198%2C1112.2899%2C1112.2456%2C1112.2368%2C1112.6396%2C1112.5897%2C1112.6159%2C1112.6152%2C1112.2254%2C1112.5346%2C1112.4130%2C1112.3403%2C1112.0729%2C1112.1219%2C1112.2723%2C1112.4377%2C1112.4571%2C1112.5665%2C1112.3826%2C1112.2977%2C1112.4870%2C1112.2927%2C1112.3819%2C1112.4746%2C1112.5800%2C1112.4934%2C1112.0850%2C1112.2457%2C1112.6073%2C1112.1664%2C1112.4471%2C1112.1703%2C1112.0089%2C1112.0413%2C1112.2165%2C1112.2057%2C1112.0588%2C1112.2493%2C1112.4230%2C1112.1340%2C1112.1528%2C1112.4470%2C1112.6195%2C1112.0119%2C1112.6320%2C1112.4513%2C1112.6197%2C1112.6338%2C1112.2396%2C1112.5939%2C1112.2485%2C1112.6065%2C1112.0385%2C1112.6198&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Planar metamaterials have been recently proposed for thin dielectric film\nsensing in the terahertz frequency range. Although the thickness of the\ndielectric film can be very small compared with the wavelength, the required\narea of sensed material is still determined by the diffraction-limited spot\nsize of the terahertz beam excitation. In this article, terahertz near-field\nsensing is utilized to reduce the spot size. By positioning the metamaterial\nsensing platform close to the sub-diffraction terahertz source, the number of\nexcited resonators, and hence minimal film area, are significantly reduced. As\nan additional advantage, a reduction in the number of excited resonators\ndecreases the inter-cell coupling strength, and consequently the resonance Q\nfactor is remarkably increased. The experimental results show that the\nresonance Q factor is improved by 113%. Moreover, for a film with a thickness\nof \\lambda/375 the minimal area can be as small as 0.2\\lambda by 0.2\\lambda.\nThe success of this work provides a platform for future metamaterial-based\nsensors for biomolecular detection."}, "authors": ["Withawat Withayachumnankul", "Hungyen Lin", "Kazunori Serita", "Charan M. Shah", "Sharath Sriram", "Madhu Bhaskaran", "Masayoshi Tonouchi", "Christophe Fumeaux", "Derek Abbott"], "author_detail": {"name": "Derek Abbott"}, "author": "Derek Abbott", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1364/OE.20.003345", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1112.4471v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1112.4471v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "8 pages, 6 figures", "arxiv_primary_category": {"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.optics", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1112.4471v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1112.4471v1", "journal_reference": null, "doi": "10.1364/OE.20.003345", "fulltext": "arXiv:1112.4471v1 [physics.optics] 18 Dec 2011\n\nSub-diffraction thin-film sensing with\nplanar terahertz metamaterials\nWithawat Withayachumnankul1,2, Hungyen Lin1 , Kazunori Serita3 ,\nCharan M. Shah4 , Sharath Sriram4 , Madhu Bhaskaran4 ,\nMasayoshi Tonouchi3 , Christophe Fumeaux1 , and Derek Abbott1\n1 School of Electrical & Electronic Engineering,\nThe University of Adelaide, Adelaide, SA 5005, Australia\n2 Faculty of Engineering,\nKing Mongkut's Institute of Technology Ladkrabang, Bangkok 10240, Thailand\n3 Institute of Laser Engineering,\nOsaka University, 2-6 Yamadaoka, Suita, Osaka 565-0871, Japan\n4 Functional Materials and Microsystems Research Group,\nSchool of Electrical and Computer Engineering,\nRMIT University, Melbourne, VIC 3001, Australia\nwithawat@eleceng.adelaide.edu.au\n\nAbstract:\nPlanar metamaterials have been recently proposed for thin\ndielectric film sensing in the terahertz frequency range. Although the\nthickness of the dielectric film can be very small compared with the\nwavelength, the required area of sensed material is still determined by\nthe diffraction-limited spot size of the terahertz beam excitation. In this\narticle, terahertz near-field sensing is utilized to reduce the spot size. By\npositioning the metamaterial sensing platform close to the sub-diffraction\nterahertz source, the number of excited resonators, and hence minimal film\narea, are significantly reduced. As an additional advantage, a reduction in\nthe number of excited resonators decreases the inter-cell coupling strength,\nand consequently the resonance Q factor is remarkably increased. The\nexperimental results show that the resonance Q factor is improved by 113%.\nMoreover, for a film with a thickness of λ /375 the minimal area can be\nas small as 0.2λ × 0.2λ . The success of this work provides a platform for\nfuture metamaterial-based sensors for biomolecular detection.\n© 2018 Optical Society of America\nOCIS codes: (160.3918) Metamaterials; (300.6495) Spectroscopy, terahertz\n\nReferences and links\n1. M. van Exter and D. Grischkowsky, \"Carrier dynamics of electrons and holes in moderately doped silicon,\"\nPhysical Review B 41, 12140–12149 (1990).\n2. B. M. Fischer, H. Helm, and P. U. Jepsen, \"Chemical recognition with broadband THz spectroscopy,\" Proceedings\nof the IEEE 95, 1592–1604 (2007).\n3. W. Withayachumnankul, B. M. Fischer, and D. Abbott, \"Material thickness optimization for transmission-mode\nterahertz time-domain spectroscopy,\" Optics Express 16, 7382–7396 (2008).\n4. W. Withayachumnankul, B. M. Fischer, H. Lin, and D. Abbott, \"Uncertainty in terahertz time-domain spectroscopy measurement,\" Journal of the Optical Society of America B: Optical Physics 25, 1059–1072 (2008).\n5. W. Withayachumnankul, \"Limitation in thin-film detection with transmission-mode terahertz time-domain spectroscopy,\" Arxiv preprint arXiv:1111.3498 (2011).\n6. J. F. O'Hara, W. Withayachumnankul, and I. A. I. Al-Naib, \"A review on thin-film sensing with terahertz waves,\"\nInternational Journal on Infrared, Millimeter Waves and Terahertz (2012). (Invited; To be published).\n\n\f7. T. Driscoll, G. O. Andreev, D. N. Basov, S. Palit, S. Y. Cho, N. M. Jokerst, and D. R. Smith, \"Tuned permeability\nin terahertz split-ring resonators for devices and sensors,\" Applied Physics Letters 91, 062511 (2007).\n8. W. Withayachumnankul and D. Abbott, \"Metamaterials in the terahertz regime,\" IEEE Photonics Journal 1, 99–\n118 (2009).\n9. I. E. Khodasevych, C. M. Shah, S. Sriram, M. Bhaskaran, W. Withayachumnankul, B. S. Y. Ung, H. Lin, W. S. T.\nRowe, D. Abbott, and A. Mitchell, \"Elastomeric silicone substrates for terahertz fishnet metamaterials,\" Applied\nPhysics Letters (2012). (Accepted; In press).\n10. C. Debus and P. H. Bolivar, \"Frequency selective surfaces for high sensitivity terahertz sensing,\" Applied Physics\nLetters 91, 184102 (2007).\n11. J. F. O'Hara, R. Singh, I. Brener, E. Smirnova, J. Han, A. J. Taylor, and W. Zhang, \"Thin-film sensing with planar\nterahertz metamaterials: sensitivity and limitations,\" Optics Express 16, 1786–1795 (2008).\n12. R. Singh, I. A. I. Al-Naib, M. Koch, and W. Zhang, \"Sharp Fano resonances in THz metamaterials,\" Optics\nExpress 19, 6312–6319 (2011).\n13. H. Tao, L. R. Chieffo, M. A. Brenckle, S. M. Siebert, M. Liu, A. C. Strikwerda, K. Fan, D. L. Kaplan, X. Zhang,\nR. D. Averitt, and F. G. Omenetto, \"Metamaterials on paper as a sensing platform,\" Advanced Materials 23,\n3197–3201 (2011).\n14. C. Jansen, I. A. I. Al-Naib, N. Born, and M. Koch, \"Terahertz metasurfaces with high Q-factors,\" Applied Physics\nLetters 98, 051109 (2011).\n15. I. Sersic, M. Frimmer, E. Verhagen, and A. Koenderink, \"Electric and magnetic dipole coupling in near-infrared\nsplit-ring metamaterial arrays,\" Physical Review Letters 103, 213902 (2009).\n16. W. Withayachumnankul, K. Jaruwongrungsee, C. Fumeaux, and D. Abbott, \"Metamaterial-inspired multichannel\nthin-film sensor,\" IEEE Sensors Journal (2012). (Accepted; In press).\n17. W. Withayachumnankul, G. M. Png, X. X. Yin, S. Atakaramians, I. Jones, H. Lin, B. S.-Y. Ung, J. Balakrishnan,\nB. W.-H. Ng, B. Ferguson, S. P. Mickan, B. M. Fischer, and D. Abbott, \"T-ray sensing and imaging,\" Proceedings\nof the IEEE 95, 1528–1558 (2007).\n18. J. B. Pendry, A. J. Holden, D. J. Robbins, and W. J. Stewart, \"Magnetism from conductors and enhanced nonlinear\nphenomena,\" IEEE Transactions on Microwave Theory and Techniques 47, 2075–2084 (1999).\n19. A. Schneider, M. Neis, M. Stillhart, B. Ruiz, R. U. A. Khan, and P. Günter, \"Generation of terahertz pulses\nthrough optical rectification in organic DAST crystals: theory and experiment,\" Journal of the Optical Society of\nAmerica B 23, 1822–1835 (2006).\n20. K. Serita, S. Mizuno, H. Murakami, I. Kawayama, M. Tonouchi, Y. Takahashi, M. Yoshimura, Y. Kitaoka, and\nY. Mori, \"Development of laser scanning terahertz imaging system using organic nonlinear optical crystal,\"\nin \"35th International Conference on Infrared, Millimeter, and Terahertz Waves,\" (Rome, Italy, 2010). DOI:\n10.1109/ICIMW.2010.5612990.\n21. H. Lin, C. Fumeaux, B. M. Fischer, and D. Abbott, \"Modelling of sub-wavelength THz sources as Gaussian\napertures,\" Optics Express 18, 17672–17683 (2010).\n22. H. Lin, C. Fumeaux, B. S.-Y. Ung, and D. Abbott, \"Comprehensive modeling of THz microscope with a subwavelength source,\" Optics Express 19, 5327–5338 (2011).\n23. M. Walther, K. Jensby, S. R. Keiding, H. Takahashi, and H. Ito, \"Far-infrared properties of DAST,\" Optics Letters\n25, 911–913 (2000).\n24. F. Pan, G. Knöpfle, C. Bosshard, S. Follonier, R. Spreiter, M. S. Wong, and P. Günter, \"Electro-optic properties of\nthe organic salt 4-N, N-dimethylamino-4'-N'-methyl-stilbazolium tosylate,\" Applied Physics Letters 69, 13–15\n(1996).\n25. S. Y. Chiam, R. Singh, J. Gu, J. Han, W. Zhang, and A. A. Bettiol, \"Increased frequency shifts in high aspect\nratio terahertz split ring resonators,\" Applied Physics Letters 94, 064102 (2009).\n26. H. Tao, A. C. Strikwerda, M. Liu, J. P. Mondia, E. Ekmekci, K. Fan, D. L. Kaplan, W. J. Padilla, X. Zhang, R. D.\nAveritt, and F. G. Omenetto, \"Performance enhancement of terahertz metamaterials on ultrathin substrates for\nsensing applications,\" Applied Physics Letters 97, 261909 (2010).\n\n1.\n\nIntroduction\n\nMany significant microscopic mechanisms in materials have strong resonant oscillations at terahertz frequencies. These include, e.g., plasma oscillation, damping in moderately doped semiconductors [1] and intermolecular motions in biomolecules [2]. Conventional terahertz timedomain spectroscopy (THz-TDS) therefore becomes a valuable tool in assessing the static and\ndynamic functions of these substances. However, a number of substances are present or can\nbe produced only in the form of thin films. This condition implies a short interaction length\nbetween the interrogating terahertz wave and the sample, and consequently, a small change in\nthe measured terahertz signal [3]. In any realistic system, this small change can be easily over-\n\n\fb\nda\n\nE\nk\n\nH\n\ng\n5 μm\n\n(a)\n\n(b)\n\nFig. 1. Split-ring resonators. (a) Schematic of a single unit cell. The polarization for operation is indicated inside the split ring. The dimensions are as follows: a = 55 μ m, d = 45\nμ m, b = 5 μ m, and g = 5 μ m. (b) Partial view of the fabricated metamaterial under an\noptical microscope.\n\nwhelmed by measurement uncertainty [4], which ultimately limits the system sensitivity [5].\nAs a solution for thin-film sensing, multiple approaches that augment conventional THz-TDS\nhave been established using different concepts [6].\nPlanar metamaterials or metasurfaces are among several approaches utilized for thin-film\nsensing at the terahertz frequency range [7]. A metamaterial is typically made of a periodic array\nof subwavelength metallic resonators that are collectively coupled to the free space excitation\n[8, 9]. The array's effective response is determined from the geometry and dimensions of the\nresonators, together with the mutual coupling between them. On resonance, each resonator\ndevelops a strong electric field typically confined in a small capacitive gap region. When the\nresonator is covered by a loading thin film, the effective permittivity at the gap is increased.\nIn effect, the gap undergoes a significant change in the charge distribution and capacitance,\nwhich can be indirectly observed via a frequency shift in the transmission resonance. This\nmetamaterial-based approach has been successfully applied to a range of thin-films with various\ndesigns and configurations [10, 11, 12, 13, 14].\nNevertheless, observing the resonance by using a far-field terahertz excitation imposes a limitation on the minimal area of a thin film deposited on a metamaterial. Fundamentally restricted\nby diffraction, the smallest possible beam waist in free space is approximately λ /2. In practice\nthe beam waist is usually even larger due to imperfection in optical components, aberrations,\nand limitation in alignment accuracy. This large beam spot necessitates a relatively large volume\nof substance to cover the full area of excited resonators. Even worse, exciting a large number\nof densely coupled resonators causes resonance broadening due to enhanced scattering [15].\nThis results in a decreased Q factor, which is detrimental to the sensitivity of a resonance-based\nsensor. Although possible, employing a transmission line for resonator excitation similar to that\ncarried out at the microwave band [16] raises the issues of terminal coupling and propagation\nloss.\nThis article proposes a combination of metamaterial-based thin-film sensing with a focusedbeam terahertz near-field technique. Such a contactless near-field approach is essential for this\ninvestigation and is advantageous in terms of simplicity [17]. In principle, a terahertz beam with\na diameter far below λ /2 can be observed in the near-field region of a nonlinear crystal used\nfor electro-optical terahertz generation. By introducing a metamaterial into this sub-diffraction\nterahertz beam, only a small number of constituent resonators are activated. The implications\nare a reduction in the required sample volume and an increase in the sensitivity through an\nimproved Q factor. The concept is validated through experiment with support from rigorous\nnumerical modelling of the sub-wavelength terahertz source.\n\n\f2.\n\nMetamaterial design and fabrication\n\nA split-ring resonator (SRR), typically used to achieve negative permeability [18], is chosen\nas a primitive for a metamaterial-based thin-film sensor. As shown in Fig. 1(a), a single SRR\nis composed of an inductive ring with a capacitive gap. An electric field with polarization perpendicular to the gap excites an oscillating current in the loop and an accumulation of charges\nat the gap. The resonance occurs when the magnetic energy stored around the loop is equal to\nthe electric energy stored at the gap. As discussed earlier, this gap region is highly sensitive to\na change in the surrounding dielectric permittivity. Depositing an analyte onto the gap causes\na shift in the resonance. The dimensions of a SRR for this work are specified in Fig. 1(a).\nThese parameters are selected so that the metamaterial composed of these resonators exhibits a\nfirst-order resonance, so-called LC resonance, at approximately 0.4 THz.\nThe metamaterial comprising a periodic array of such SRRs has been defined by microfabrication techniques. A float-zone intrinsic silicon substrate with a resistivity greater than\n20,000 Ω*cm and thickness of 380 μ m was cleaned with acetone and isopropyl alcohol. Photolithography with a chlorobenzene dip was performed to define an inverse pattern through a\nlift-off profile. The substrate was subsequently coated with a film of metal by electron beam\nevaporation after pumping down to a base pressure of 1×10−7 Torr. A 20 nm chromium adhesion layer was deposited followed by a 200 nm thick layer of gold. Lift-off was performed with\nultrasonic agitation in acetone and isopropyl alcohol. The wafer defined with the periodic SRR\narray was sectioned into 10×10 mm2 dies with a rotary diamond dicing saw. An example of\nthe resulting SRR is shown in Fig. 1(b).\n3.\n\nTerahertz near-field system and numerical model\n\nThe terahertz near-field system employed in this work is based on the focused-beam technique.\nA fiber-coupled ultrafast laser, operating at a center wavelength of 1.56 μ m, emits the pump\nbeam that is modulated and then focused onto the 200 μ m thick nonlinear crystal, DAST [19].\nThe terahertz beam is generated through the optical rectification process. To reduce the spot size\nof the terahertz beam, the optical beam is first expanded by means of two convex lenses, then\nfocused onto the nonlinear crystal with a beam waist of 25 μ m. Photoconductive sampling,\nwhich is used for far-field detection of the terahertz wave, is gated by the optical beam with\na center wavelength of 780 nm. Details of the terahertz near-field system employed in this\ninvestigation can be found elsewhere [20].\nThe electric-field distribution of the near-field terahertz beam at a given frequency and distance from the crystal surface has been computed through full-wave electromagnetic simulations employing Gaussian aperture sources, which were implemented based on the techniques\npresented in [21, 22]. The parameters of DAST at terahertz and infrared frequency ranges are\nobtained from [23, 24], respectively. The details of the simulations and its thorough validation\nwill be presented elsewhere. An illustration of the beam profiles at 0.4 THz at a distance of 25\nand 50 μ m from the output surface of the DAST crystal is displayed in Fig. 2. Only the Ey component, which excites the metamaterial in the sensing process, is shown. The spot sizes at the\ntwo distances illustrate the rapid widening of the beam with distance from the sub-wavelength\nelectro-optical source as a result of diffraction.\n4.\n\nExperiment\n\nPhotoresist S1818G with n − jκ = 1.6 − 0.02 j at 0.4 THz is selected as an analyte, owing to\nits readily controllable patterning through photolithography. To evaluate the performance of\nthe proposed near-field detection scheme, the thickness of the fabricated photoresist film is\nchosen to be 2 μ m, and the area of the film varies from 150×150, 450×450, 700×700 μ m2 ,\n\n\f1.0\n\n−400\n\ny (μm)\n\n−200\n0\n\ni\nii\n\n200\n\niii\n400\n−400\n\n0.0\n−200\n\n0\n\n200\n\n400 −400 −200\n\nx (μm)\n(a)\n\n0\n\n200\n\n400\n\nx (μm)\n(b)\n\nFig. 2. Modelled cross sections of terahertz beam, showing the normalized Ey component\n(a) at a distance of 25 μ m, and (b) at a distance of 50 μ m from the crystal surface. The farfield electric-field polarization is in the y-axis. The cross sections are registered at 0.4 THz.\nThe red lines define the 1/e spot size. The rectangular boxes in (b) illustrate the area of test\nsamples from (i) 150×150 μ m2 , (ii) 450×450 μ m2 , to (iii) 700×700 μ m2 .\n\nto full plane. A comparison between these film areas and the near-field spot size can be seen in\nFig. 2(b). Noticeably, the 150×150 μ m2 film is much smaller than the 1/e cross section of the\nbeam, whilst the 300×300 μ m2 film is comparable in size to the cross section. In terms of the\nenergy, the 150×150, 450×450, and 700×700 μ m2 samples are exposed to about 30, 84, and\n97% of the total beam energy, respectively.\nFig. 3(a) shows the sample film deposited on the fabricated metamaterial. Depicted in\nFig. 3(b), the coated metamaterial is placed in the near-field at a distance of approximately\n50 μ m from the crystal surface. The sub-diffraction terahertz beam generated from the nonlinear crystal interacts with only a fraction of the SRRs on the metamaterial. Afterwards, the propagating wave is temporally resolved in the far-field. In order to remove the fringe effect caused\nby reflections in the substrate, the time-resolved waveform is cropped and zero-padded prior to\nFourier transform. The sample transmission is then normalized by the reference transmission\nmeasured from a bare silicon substrate under the same condition. For the sake of comparison,\na conventional far-field THz-TDS system is used to measure the identical metamaterial that is\nplaced at the focal plane.\n5.\n\nResults & discussion\n\nThe results from the far-field measurement are shown in Fig. 4. In order to characterize the\nsystem uncertainty, the measurement of the uncoated metamaterial is repeated five times. The\nsubstrate\nthin-film\nS1818\n\nDAST\ncrystal\n\ninfrared\nbeam\nphotoresist\n\n(a)\n\nterahertz beam\n\nspacer\n\nSRRs\n\n(b)\n\nFig. 3. Sample and its placement in near-field. (a) Metamaterial coated with photoresist\nS1818G with an area of 450×450 μ m2 and a thickness of 2 μ m. (b) Schematic (not to scale)\nshowing the location of the sample under measurement by terahertz near-field system.\n\n\ftransmission magnitude\n\n1.0\n0.8\n0.6\n0.4\n0.2\n0\n0.3\n\nΔf\nreference\n150x150 μm2\n450x450 μm2\n700x700 μm2\nfull-plane\n0.34\n\nf0\n0.38\n\n0.42\n\n0.46\n\n0.5\n\nfrequency (THz)\n\nFig. 4. Far-field measurement results. The transmission of the uncoated metamaterial is\naccompanied by the error bars with one standard deviation. The transmission profiles for the\nmetamaterial with photoresist films with an area of 700×700, 450×450, and 150×150 μ m2\nare mostly masked by the error bars. The Q factor is calculated from f0 /∆ f .\n\ntransmission magnitude\n\n1.0\n0.8\n0.6\n0.4\n0.2\n0\n0.3\n\nreference\n150x150 μm2\n450x450 μm2\n700x700 μm2\n0.34\n\n0.38\n\n0.42\n\n0.46\n\n0.5\n\nfrequency (THz)\n\nFig. 5. Near-field measurement results. The transmission of the uncoated metamaterial is\naccompanied by the error bars with one standard deviation. The resonance frequency of the\nuncoated metamaterial is 0.427 THz, and the resonance frequencies in the case of 700×700,\n450×450, 150×150 μ m2 films are 0.404, 0.414, and 0.420 THz, respectively.\n\ntransmission of the uncoated metamaterial reveals its resonance frequency at 0.407 THz with\na Q factor of 4.0. On resonance, the effective extinction cross section of the uncoated sensor,\ndefined as a2 (1 − T ), is 2586 μ m2 . This result is in accordance with numerical simulation (not\nshown here). For the full-plane photoresist film, the resonance shifts to 0.394 THz, or equivalently -3.2% from the base frequency, with a small additional damping due to the sample absorption. This can be converted to the sensitivty of 8.1 GHz/RIU (RIU denotes refractive index\nunit). For the 700×700 μ m2 film and smaller, a change in the transmission profile compared to\nthe reference is not distinguishable from the measurement uncertainty.\nFig. 5 shows the transmission results from the near-field measurement. The uncoated metamaterial, measured five times successively, exhibits its resonance centered at 0.427 THz with a\nQ factor of 8.54 and an extinction cross section of 2946 μ m2 . Compared with the resonance of\nthe identical sample measured in the far-field, the near-field resonance undergoes 5% blueshift,\n113% increase in the Q factor, and 14% increase in the effective extinction cross section. This\ndrastic change in the resonance properties can be ascribed to a reduction in the interactions between the resonators. In the far-field measurement, the large beam spot excites a large number\nof resonators, resulting in reinforced inter-cell coupling. By contrast, the sub-diffraction beam\nspot in the near-field excites a much smaller number of the resonators. As a result, intercell-\n\n\f10\n\n4\n\n8\n\n2\n\n6\n\n0\n0\n\n100\n\n200\n\n300\n\n400\n\n500\n\n600\n\nQ factor\n\nfrequency shift (%)\n\n6\n\n4\n700\n\nfilm width (μm)\n\nFig. 6. Near-field resonance characteristics. The frequency shift and Q factor are plotted\nas a function of the film width. The frequency shift is with respect to the resonance frequency of the uncoated metamaterial (zero film width). The dotted lines are merely for\nvisual guidance.\n\ncouplings become relatively weak. Although not exactly identical, this situation is similar to the\nresonance change following a modification in the lattice density [15]. As the density increases,\nthe inter-resonator coupling becomes stronger, leading to a broadened resonance and a reduced\nextinction cross section. A quantitative analysis of the metamaterial response dependency on\nthe excitation pattern is out of the scope of this work and being investigated separately.\nIn Fig. 5, a change in the resonance in comparison to the reference can be clearly observed\nfor all of the samples. The analyte as small as 150×150 μ m2 , equivalent to 3×3 resonators\nor 0.2λ × 0.2λ at 0.4 THz, can be unambiguously detected as a clear measurable redshift in\nthe resonance. It is worth noting that the irregularities of the transmission amplitude below\n0.35 THz and above 0.48 THz are due to early truncation and zero padding of the time-domain\nsignals to remove the unwanted reflections. This problem can be easily resolved by using a\nthicker substrate for supporting the resonators. Fig. 6 elucidates the resonance characteristics\nas a function of the sample size. As the film area becomes larger, the resonance frequency\nredshifts almost in a linear fashion, whilst the Q factor initially decreases and slightly increases\nfor the 700×700 μ m2 film.\nThe resonance behaviour under partial dielectric loading can be explained by the interaction\nbetween two competing resonator groups, one with and the other without the loading sample.\nIn the case where the sample area is smaller than the beam spot, both groups of the resonators\nare excited. The analyte-loaded resonators clustering in the beam center locally resonate at\na lower frequency, whilst the unloaded resonators away from the center resonate at a higher\nfrequency. The two local resonances contribute to the far-field resonance broadening, or the\nlowered Q factor, as is observed with the 150×150 and 450×450 μ m2 samples. This effect\nis analogous to inhomogeneous broadening in molecular and atomic transitions. It is expected\nthat by removing the uncovered resonators, the Q factor will be restored. As discussed earlier,\nthe 700×700 μ m2 film covers most of the excited resonators. Hence, the observed resonance\nis homogeneous, resulting in the increased Q factor.\n6.\n\nConclusion\n\nThis article presents enhanced-sensitivity thin-film detection utilizing a planar metamaterial in\nconjunction with a sub-diffraction terahertz source. Exposing the metamaterial to the near-field\nsource results in a significant decrease in the number of excited resonators. The benefits are\ntwofold: a decrease in the sample volume and an increase in the resonance Q factor. Since only\n\n\fa small number of resonators are activated, the film area required to cover the resonators can\nbe reduced. At the same time, the Q factor of the metamaterial is improved because of weak\nnear-field interactions among a small group of the resonators. The experiment shows that the\nsystem can unambiguously sense the λ /375-thick dielectric film with an area of 3×3 resonators\nor 0.2λ × 0.2λ . This level of sensitivity is not achievable with a far-field probing technique.\nIn addition, the uncoated metamaterial measured in the near-field exhibits the fundamental\nresonance with a Q factor of 8.54, which is 113% improvement in comparison to far-field\nprobing.\nFurther improvement in the sensitivity is possible on the basis of this proposed near-field\nsensing scheme. The number of excited resonators can be additionally reduced by bringing the\nmetamaterial-based sensor closer to the near-field source or, even better, by fabricating subwavelength resonators directly onto the nonlinear crystal. Another possibility is to substitute\nSRRs by asymmetric resonators that essentially possess a sharp Fano resonance owing to the\ndark mode [10, 12]. Other sensitivity improvement techniques such as increasing the metal\nthickness [25] or reducing the permittivity of the substrate [26] can also be realized under this\nnear-field sensing approach.\nAcknowledgement\nWW, SS, and MB acknowledge Australian Post-Doctoral Fellowships from the Australian Research Council (ARC) through Discovery Projects DP1095151, DP110100262, and\nDP1092717, respectively. WW acknowledges a travel grant from Australian Nanotechnology\nNetwork. HL acknowledges the Prime Ministers Australia Asia Endeavour Award for research\ncollaboration with Japan. CF acknowledges the ARC Future Fellowship funding scheme under\nFT100100585. MT acknowledges fundings by Grant-in-Aid A22246043, JSPS, and IndustryAcademia Collaborative R&D, JST. DA acknowledges funding via the Australian Research\nCouncil (ARC) Discovery Projects DP0881445 and DP1097281.\n\n\f"}