{"id": "http://arxiv.org/abs/0711.3468v3", "guidislink": true, "updated": "2008-12-25T21:34:04Z", "updated_parsed": [2008, 12, 25, 21, 34, 4, 3, 360, 0], "published": "2007-11-21T21:55:17Z", "published_parsed": [2007, 11, 21, 21, 55, 17, 2, 325, 0], "title": "The sphericity of the complex of non-degenerate subspaces", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0711.0246%2C0711.1578%2C0711.2676%2C0711.1405%2C0711.4811%2C0711.1930%2C0711.2207%2C0711.2632%2C0711.2777%2C0711.0204%2C0711.0915%2C0711.0558%2C0711.0733%2C0711.0941%2C0711.2005%2C0711.2421%2C0711.3449%2C0711.0655%2C0711.0391%2C0711.2974%2C0711.3667%2C0711.1625%2C0711.1743%2C0711.2334%2C0711.4513%2C0711.1608%2C0711.2524%2C0711.1433%2C0711.4478%2C0711.4143%2C0711.4090%2C0711.4545%2C0711.4660%2C0711.3171%2C0711.4001%2C0711.2561%2C0711.3080%2C0711.3377%2C0711.3548%2C0711.3126%2C0711.4692%2C0711.4708%2C0711.2246%2C0711.3223%2C0711.4406%2C0711.3090%2C0711.4992%2C0711.0520%2C0711.1067%2C0711.4127%2C0711.4407%2C0711.0541%2C0711.3496%2C0711.2366%2C0711.0318%2C0711.3695%2C0711.0910%2C0711.3524%2C0711.3164%2C0711.3111%2C0711.3516%2C0711.1217%2C0711.4430%2C0711.3451%2C0711.1903%2C0711.0375%2C0711.4913%2C0711.0618%2C0711.4450%2C0711.0342%2C0711.3408%2C0711.1198%2C0711.2062%2C0711.2971%2C0711.1190%2C0711.2945%2C0711.4057%2C0711.3324%2C0711.4808%2C0711.0747%2C0711.4028%2C0711.2221%2C0711.4223%2C0711.1536%2C0711.3716%2C0711.3468%2C0711.0785%2C0711.0177%2C0711.4665%2C0711.2936%2C0711.3713%2C0711.0803%2C0711.2772%2C0711.0312%2C0711.3521%2C0711.1394%2C0711.0474%2C0711.3326%2C0711.3611%2C0711.2558%2C0711.2854&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The sphericity of the complex of non-degenerate subspaces"}, "summary": "We prove that the complex of proper non-trivial non-degenerate subspaces of a\nfinite-dimensional vector space endowed with a non-degenerate sesquilinear form\nis homotopy equivalent to a wedge of spheres. Additionally, we show that the\nsame is true for a slight generalization, the so-called generalized Phan\ngeometries of type A_n. These generalized Phan geometries occur as relative\nlinks of certain filtrations. Their sphericity implies finiteness properties of\nsuitable arithmetic groups and allows for a revision of Phan's\ngroup-theoretical local recognition of suitable finite groups of Lie type with\nsimply laced diagram.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0711.0246%2C0711.1578%2C0711.2676%2C0711.1405%2C0711.4811%2C0711.1930%2C0711.2207%2C0711.2632%2C0711.2777%2C0711.0204%2C0711.0915%2C0711.0558%2C0711.0733%2C0711.0941%2C0711.2005%2C0711.2421%2C0711.3449%2C0711.0655%2C0711.0391%2C0711.2974%2C0711.3667%2C0711.1625%2C0711.1743%2C0711.2334%2C0711.4513%2C0711.1608%2C0711.2524%2C0711.1433%2C0711.4478%2C0711.4143%2C0711.4090%2C0711.4545%2C0711.4660%2C0711.3171%2C0711.4001%2C0711.2561%2C0711.3080%2C0711.3377%2C0711.3548%2C0711.3126%2C0711.4692%2C0711.4708%2C0711.2246%2C0711.3223%2C0711.4406%2C0711.3090%2C0711.4992%2C0711.0520%2C0711.1067%2C0711.4127%2C0711.4407%2C0711.0541%2C0711.3496%2C0711.2366%2C0711.0318%2C0711.3695%2C0711.0910%2C0711.3524%2C0711.3164%2C0711.3111%2C0711.3516%2C0711.1217%2C0711.4430%2C0711.3451%2C0711.1903%2C0711.0375%2C0711.4913%2C0711.0618%2C0711.4450%2C0711.0342%2C0711.3408%2C0711.1198%2C0711.2062%2C0711.2971%2C0711.1190%2C0711.2945%2C0711.4057%2C0711.3324%2C0711.4808%2C0711.0747%2C0711.4028%2C0711.2221%2C0711.4223%2C0711.1536%2C0711.3716%2C0711.3468%2C0711.0785%2C0711.0177%2C0711.4665%2C0711.2936%2C0711.3713%2C0711.0803%2C0711.2772%2C0711.0312%2C0711.3521%2C0711.1394%2C0711.0474%2C0711.3326%2C0711.3611%2C0711.2558%2C0711.2854&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We prove that the complex of proper non-trivial non-degenerate subspaces of a\nfinite-dimensional vector space endowed with a non-degenerate sesquilinear form\nis homotopy equivalent to a wedge of spheres. Additionally, we show that the\nsame is true for a slight generalization, the so-called generalized Phan\ngeometries of type A_n. These generalized Phan geometries occur as relative\nlinks of certain filtrations. Their sphericity implies finiteness properties of\nsuitable arithmetic groups and allows for a revision of Phan's\ngroup-theoretical local recognition of suitable finite groups of Lie type with\nsimply laced diagram."}, "authors": ["Alice Devillers", "Ralf Köhl", "Bernhard Muhlherr"], "author_detail": {"name": "Bernhard Muhlherr"}, "author": "Bernhard Muhlherr", "links": [{"href": "http://arxiv.org/abs/0711.3468v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0711.3468v3", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.GR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0711.3468v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0711.3468v3", "arxiv_comment": null, "journal_reference": "J. Lond. Math. Soc. (2) 79 (2009), no. 3, 684-700", "doi": null, "fulltext": "arXiv:0711.3468v3 [math.CO] 25 Dec 2008\n\nThe sphericity of the complex of non-degenerate\nsubspaces\nAlice Devillers∗ 1 , Ralf Gramlich†\n\n2,3\n\n, and Bernhard Mühlherr4\n\nNovember 14, 2018\n1: University of Western Australia, School of Mathematics and Statistics, 35 Stirling Highway, Crawley\n6009, Western Australia, e-mail: adevil@maths.uwa.edu.au\n2: TU Darmstadt, FB Mathematik, Schlossgartenstrasse 7, 64289 Darmstadt, Germany,\ne-mail: gramlich@mathematik.tu-darmstadt.de\n3: The University of Birmingham, School of Mathematics, Edgbaston, Birmingham, B15 2TT, United\nKingdom, e-mail: ralfg@maths.bham.ac.uk\n4: Universität Giessen, Mathematisches Institut, Arndtstrasse 2, 35392 Giessen, Germany\ne-mail: muhlherr@math.uni-giessen.de\n\nAbstract\nWe prove that the complex of proper non-trivial non-degenerate subspaces of a finitedimensional vector space endowed with a non-degenerate sesquilinear form is homotopy equivalent to a wedge of spheres. Additionally, we show that the same is true\nfor a slightly wider class of simplicial complexes, the so-called generalized Phan geometries of type An . These generalized Phan geometries occur as relative links of the\nfiltration studied in [14], whose sphericity implies topological finiteness properties of\nsuitable arithmetic groups and allows for a revision of Phan's group-theoretical local\nrecognition [21], [22] of suitable finite groups of Lie type with simply laced diagrams.\n\n1\n\nIntroduction\n\nIn this paper we prove the following result.\nMain Theorem\nLet K be an arbitrary field, let σ be an automorphism of K of order one or two and\n∗\n\nThe first author was a Collaborateur Scientifique F.R.S.-FNRS during the time when most of the work\nfor this article was done.\n†\nThe second author gratefully acknowledges a Heisenberg fellowship of the Deutsche Forschungsgemeinschaft.\n\n1\n\n\flet V be an (n + 1)-dimensional vector space over K endowed with a non-degenerate σhermitian form h. Moreover, let Γ be the simplicial complex whose vertices are the nontrivial subspaces which are non-degenerate with respect to h and where incidence is defined\n√\nby inclusion. If K is a finite field of order q, assume 2n < q in case σ = id and 2n−1 ( q +\n1) < q in case σ 6= id.\nThen Γ is Cohen-Macaulay. In particular, |Γ| is homotopy equivalent to a wedge of\n(n − 1)-spheres.\n\nFor K = Fq2 , q ≥ 4, n ≥ 3, and h hermitian, the above simplicial complex Γ is known\nto be simply connected by [6], [13], [10]. Using standard arguments from geometric group\ntheory this implies Phan's theorem [21], which states that the group SUn+1 (q 2 ) equals the\nuniversal enveloping group of the amalgam of its fundamental subgroups of rank one and\ntwo. Because of this prominent role in the revision of Phan's results, the geometry of\nnon-degenerate subspaces described above is called the Phan geometry associated to the\npair (V, h).\nIn fact, there is a canonical way to associate a Phan geometry to any flip of a spherical\nbuilding (see [8]). A flip is an involutory automorphism of the spherical building that acts\nvia conjugation with the longest word of the Weyl group on the Weyl distance and maps\nsome chamber to an opposite chamber. In other words, a flip is an involutory isometry of\nthe associated spherical twin building (see [26]) such that there exists a chamber that is\nopposite its image under that involution. It was observed in [14] that a Phan geometry\ninduced by a flip shares a lot of properties with the geometry far away from a chamber. In\na sense, our work underlines this observation, because we successfully adapted the strategy\nof proof of the analogue of the Main Theorem for the far-away geometries in An buildings\nobtained by Abels and Abramenko in [2] (see also [3]) to the situation of Phan geometries.\nThe sphericity of the far-away geometries turns out to be important in the work by\nAbels and Abramenko on topological finiteness properties of the group SLn+1 (Fq [t]). The\nmain motivation for our investigations was to obtain a similar tool for proving topological\nfiniteness properties for centralizers of flips in split Kac-Moody groups over finite fields,\nsuch as for the group\nSUn+1 (Fq2 [t, t−1 ], θ) = {A ∈ SLn+1 (Fq2 [t, t−1 ]) | (A−1 )θ = AT }\n\nwhere θ is the involution of the field Fq2 (t) mapping t to t−1 and acting as the Frobenius\ninvolution on Fq2 . However, it turned out that the statement of the Main Theorem is\nnot sufficient for this purpose. The reason is that the relative links in the filtration of\n[14] are slightly more general than the Phan geometries. This lead us to the definition\nof generalized Phan geometries, see Section 3, which is quite technical. Fortunately, while\nmodifying an earlier version of the proof of the Main Theorem in order to make it work\nfor the generalized Phan geometries, we observed that the arguments became much more\nnatural in this wider context and some technicalities just disappeared. In fact, the class of\ngeneralized Phan geometries contains both the class of Phan geometries and the class of\ngeometries far from a chamber.\nAs we have already indicated, the result of the present paper is meant to provide a tool\nto determine the finiteness lengths of unitary forms of split Kac-Moody groups over finite\n2\n\n\ffields along the lines of [3]. Apart from this application we would like to mention that the\ncases of small dimension n ∈ {2, 3} of our result are precisely what is needed in the revision\nof Phan's result for the finite Chevalley groups with simply laced diagram (see [17]; see\n[22] for Phan's original result). Our proof provides a more systematic approach than the\none given in [17], which is based on a case by case distinction. However, the proof in [17]\ncovers q = 4, which the proof presented in this paper does not.\nThe methods needed in order to obtain the Main Theorem are quite elementary and\nconsist of linear algebra and basic homology theory. Our approach is based on a combination of the strategy of the sphericity proof for far-away geometries given in [3] and several\ntechniques used in the revision of Phan's presentation [8]. The necessary material from\ntopology is discussed in Section 2, while in Section 3 we study some examples of generalized Phan geometries of type An . Section 4 concentrates on proving that generalized Phan\ngeometries of type An are spherical over sufficiently large fields. This goal is achieved in\nTheorem 4.6 and its Corollary 4.7. The Main Theorem stated above is just a special case.\nFinally, in Section 5 we outline in more detail the two applications of this sphericity result\nto group theory mentioned above. While Sections 2, 3 and 4 are largely self-contained, the\ncharacter of Section 5 is that of a survey. The final section is intended to serve as a motivation for our interest in generalized Phan geometries of type An , so that our arguments\ngiven there should only be considered as sketches. The content of Section 5 is based on\nFact 5.1, which has already been proved in special situations in the literature, cf. [11]. We\nintend to a give a general building-theoretic proof in a separate publication.\nAcknowledgement: The research resulting in this paper has been initiated during an\nRiP stay at Oberwolfach in summer 2006. The authors express their gratitude for the hospitality of the Mathematisches Forschungsinstitut Oberwolfach. The authors thank Peter\nAbramenko, Kai-Uwe Bux, Max Horn, William Kantor, Linus Kramer, Sergey Shpectorov,\nand Stefan Witzel for several helpful remarks and comments. The authors also thank the\nanonymous referee for an excellent report that lead to a considerable improvement of this\narticle.\n\n2\n\nBasics\n\nDefinition 2.1 (Simplicial complex) A simplicial complex K consists of a set V of\nvertices and a set S of finite non-empty subsets of V called simplices such that\n1. any set consisting of exactly one vertex is a simplex, and\n2. any non-empty subset of a simplex is a simplex.\nA simplicial complex K is called pure if each simplex is contained in a maximal simplex\nand if, moreover, all maximal simplices have the same cardinality n; in this case we say\nthat the simplicial complex K has dimension n − 1. The join of two simplicial complexes\nK1 = (V1 , S1 ) and K2 = (V2 , S2 ), in symbols K1 ∗ K2 , equals the simplicial complex with\n3\n\n\fvertex set equal to the disjoint union V1 ⊔ V2 and set of simplices equal to {v ∪ w ∈ V1 ⊔ V2 |\nv ∈ S1 , w ∈ S2 }.\nFurthermore, let |K|, called realization of K, be the set of all functions α from the set of\nvertices of K to thePreal unit interval I such that, for any α, the set {v ∈ K | α(v) 6= 0} is a\nsimplex of K, and v∈K α(v) = 1, i.e., |K| is obtained from K via barycentric coordinates.\nIn this article we consider the weak (coherent) topology on |K|, cf. [24, 3.1.14]. By [24,\n7.6.4] the realization |K| of a simplicial complex K is a CW complex.\n\nDefinition 2.2 (Realization) A poset X gives rise to a simplicial complex with the nonempty finite chains of X as simplices. Endowed with the weak topology, this simplicial\ncomplex is called the realization of X and denoted by |X|.\nIn analogy to simplicial complexes, the join of two posets X and Y , also denoted by\nX ∗ Y , is the disjoint union X ⊔ Y endowed with the partial order which agrees with the\ngiven partial orders on X and on Y and which is such that any element of X is less than\nany element of Y .\nDefinition 2.3 (Closed simplex, open simplex, star, link) Let K be a simplicial complex and let s be a simplex of K. The closed simplex |s| equals {α ∈ |K| | α(v) 6=\n0 =⇒ v ∈ s}. Hence, if s is a q-simplex, then\nP |s| is naturally homeomorphic to the\nq+1\nstandard simplex {x ∈ R\n| 0 ≤ xi ≤ 1, xi = 1}. The open simplex hsi equals\n{α ∈ |K| | α(v) 6= 0 ⇐⇒ v ∈ s}. The open simplex hsi is open in |s|, but not necessarily\nin |K|.\nFor a vertex v ∈ K, the (open) star StK (v) equals {α ∈ |K| | α(v) 6= 0}. The link of x\nis defined as LkK (x) := StK (x)\\StK (x).\nS\nWe have StK (x) = {hsi | x is vertex of s}, cf. [24, 3.1.24].\nDefinition 2.4 (Wedge sum) Let X and Y be pointed spaces, i.e., topological spaces\nwith distinguished base points x0 and y0 . Then the wedge sum X ∨ Y of X and Y is the\nquotient of the disjoint union X ⊔ Y by the identification x0 ∼ y0 , i.e.,\nX ∨ Y := (X ⊔ Y )/{x0 ∼ y0 }.\nIn general, if (Xi )i∈I is a family of pointed spaces with base points (xi )i∈I and if x is a\none-point space, then the wedge sum of this family is given by\nG\n_\nXi :=\nXi /{xi ∼ x}.\ni∈I\n\ni∈I\n\nThe wedge sum of a family of spheres each of which is homeomorphic to the standard\nsphere Sn = {x ∈ Rn+1 | kxk = 1} is called a wedge of spheres or, if one wants to specify\nthe dimension, a wedge of n-spheres.\nThe following topological observations are crucial for the proof of our main result. A\nCW complex of dimension at most m is called m-spherical if it has the homotopy type of\na wedge m-spheres.\n4\n\n\fLemma 2.5\nA connected 1-dimensional CW complex X has the homotopy type of a wedge of 1-spheres.\nProof: Let T ⊆ X be a maximal subtree. Then T is contractible and contains all\nvertices (see [24, Lemmas 3.7.1 and 3.7.2]), whence by the homotopy extension property\nX is homotopy equivalent to X/T (see [24, Corollary 3.2.5]). This quotient is a connected\n1-dimensional complex with exactly one vertex, i.e. a wedge of 1-spheres.\n✷\nLemma 2.6\nS\nLet X be a CW complex of dimension at most m which is a union X = B ∪ i Ai of\nsubcomplexes B, Ai , where i ranges over some (possibly infinite) index set I. Suppose that\nB is m-spherical, that the Ai are contractible, that Ai ∩ Aj ⊆ B for i 6= j, and that Ai ∩ B\nis m − 1-spherical, for every i. Then X is m-spherical.\nProof: If X is 1-dimensional, the result is true by Lemma 2.5.\nAssume now that m ≥ 2. Let Y = B ∪ Ai . The Mayer-Vietoris sequence in reduced\nhomology is\n0 → H̃m (B) ⊕ H̃m (Ai ) → H̃m (Y ) → H̃m−1 (B ∩ Ai ) → 0\nso Y has the same homology as a wedge of m-spheres. By Van Kampen's Theorem, B ∩ Ai\nis 1-connected. W\nIt follows from Hurewicz' Theorem [24, 7.5.4] that π∗ (Y ) ∼\n= H∗ (Y ) for\nm\n∗ ≤ m. Let f : J S → Y be a map sending each sphere summand to a free generator\nof πm (Y ). Then f is a homology equivalence and therefore a homotopy equivalence [24,\n7.5.9, 7.6.24]. It follows by induction that B ∪ Ai1 ∪ * * * ∪ Air has the homotopy type of a\nwedge of m-spheres. Since every compact set C ⊆ X is contained in such a finite union,\nX is m − 1-connected and has the same homology asWa wedge of m-spheres. By the same\nargument as before, we find a homotopy equivalence K S m → X.\n✷\n\nWe close this section by specifying the characterizing property of Cohen-Macaulayness\nthat we are going to use in this article; cf. [23, Section 8].\n\nDefinition 2.7 (Cohen-Macaulay) A d-dimensional simplicial complex K is called CohenMacaulay, if it is d-spherical, and if in addition the link of each p-simplex is (d − p − 1)spherical.\n\n3\n\nGeneralized Phan geometries of type An\n\nDefinition 3.1 Let V be a vector space. Two subspaces A and B of V are opposite when\nV = A ⊕ B. A flag is a chain of incident subspaces. A subspace A is transversal or in\ngeneral position to a flag F , denoted by A ⋔V F , if for any subspace B of F we have\nA ∩ B = {0} or V = A + B.\nNotice that A ⋔V F if and only if there is a subspace C of V incident with F such that A\nand C are opposite.\n5\n\n\fDefinition 3.2 Let K be a field, let σ be an automorphism of K of order one or two, let V\nbe an (n + 1)-dimensional K-vector space, let 0 ≤ t ≤ n, let F = {Vi | 0 ≤ i ≤ t + 1} with\n0 = V0 V1 * * * Vt Vt+1 = V be a flag of subspaces of V , and let ωi : Vi+1 ×Vi+1 → K,\n0 ≤ i ≤ t, be σ-hermitian forms which admit non-isotropic vectors and satisfy\nRad (ωi ) = Vi .\nThe generalized Phan geometry of type An of V with respect to F and (ωi )0≤i≤t consists\nof all proper non-trivial vector subspaces U of V transversal to F with U ∩ VkU +1 nondegenerate with respect to ωkU where kU = min{i ∈ {0, . . . , t} | U ∩ Vi+1 6= {0}}.\nExample 3.3 For t = 0 the generalized Phan geometry on V equals the complex of proper\nnon-trivial non-degenerate subspaces of V with respect to a non-degenerate σ-hermitian\nform. For σ of order one and the field K of characteristic distinct from two, this complex\nis simply connected by [4], [5]. For K = Fq2 and σ the Frobenius involution, this complex\nhas been studied in [6], [13] and in [10] in order to re-prove Phan's characterization [21] of\nthe group SUn+1 (q 2 ) via combinatorial topology.\nExample 3.4 For t = n, the generalized Phan geometry on V equals the geometry opposite a chamber in a building of type An (whose sphericity has been established in [2],\nsee also [3]). Indeed, the flag F is a chamber and each ωi has rank one with radical Vi .\nTherefore any vector v ∈ Vi+1 \\Vi is non-degenerate with respect to ωi , so that any subspace U of V with U ⊕ Vi = V intersects Vi+1 in a non-degenerate (with respect to ωi )\none-dimensional subspace.\nJust like the geometries opposite a chamber occur as relative links in filtrations used\nto establish finiteness properties of certain arithmetic groups (cf. [1], [3]), so do the generalized Phan geometries. The following series of examples illustrates how generalized Phan\ngeometries occur as relative links.\nExample 3.5 Let V be a vector space and consider a generalized Phan geometry on V\nwith t = 0, i.e., the geometry of non-degenerate subspaces of V with respect to a form\nω0 : V × V → K. Let H be a hyperplane of V with radical R of dimension zero or one.\nThen the intersection of the link of H (in the complex of proper non-trivial subspaces of\nV ) with the subcomplex of proper non-trivial ω0 -non-degenerate subspaces of V , equals\nall proper non-trivial subspaces of H which are non-degenerate with respect to ω0|H×H .\nEach of these subspaces is transversal to the flag {{0}, R, H}, so that this relative link is\na generalized Phan geometry. (Notice that the form on R does not play any role for this\ngeneralized Phan geometry.)\nIn Lemma 4.2 we prove that the relative link of an arbitrary element of a generalized\nPhan geometry is isomorphic to a generalized Phan geometry or the direct sum (i.e., join)\nof two generalized Phan geometries.\n\n6\n\n\fExample 3.6 Let B be a building of type An , let R be a residue of B, and let π be a\npolarity of B. Using the notation from [14], the chamber system Aπ (R) consists of all those\nchambers of R with maximal possible distance (i.e., minimal possible codistance) from their\nimage under π. This chamber system plays a crucial role in the filtration studied in [14]\nand yields a direct sum of generalized Phan geometries, cf. Fact 5.1. When dealing with\npolarities of projective spaces (buildings of type An ), this distance of a chamber c from its\nimage under π can be measured by the grade of nondegeneracy of the elements contained\nin the chamber c.\nFor instance, let V be a six-dimensional vector space (which corresponds to a building of\ntype A5 ) endowed with a non-degenerate unitary form h (which corresponds to a polarity\nπ). Consider the residue of V with respect to the flag consisting of an h-singular onedimensional subspace p and an incident five-dimensional subspace H with one-dimensional\nh-radical x. Fixing a four-dimensional complement C of p not containing x, we can identify\nthe set of chambers of V containing p and H with the set of chambers of C by taking the\nintersection. The set of chambers in the residue of (p, H) which are mapped by π to\na chamber as far away as possible, correspond in C to maximal flags of subspaces of the\nfollowing types: (i) one-dimensional subspaces of C opposite to p⊥ ∩C, (ii) two-dimensional\nsubspaces of C transversal to p⊥ ∩ C which intersect p⊥ ∩ C in an h-non-degenerate onedimensional subspace, and (iii) three-dimensional subspaces of C transversal to p⊥ ∩ C\nwhich intersect p⊥ ∩ C in an h-non-degenerate two-dimensional subspace. This description\nshows that this residue is isomorphic to a generalized Phan geometry of C with respect to\nthe flag {{0}, C ∩ p⊥ , C} and the form h|(C∩p⊥ )×(C∩p⊥ ) and an arbitrary sesquilinear form\nf : C × C → K of rank one with radical C ∩ p⊥ .\n\n4\n\nSphericity of generalized Phan geometries\n\nIn this section we prove the Main Theorem from the introduction in the guise of Theorem\n4.6 and Corollary 4.7. We achieve this by using a filtration method similar to the one\ndescribed in [2, Theorem 1.1], [3, Chapter II, Proposition 12]. Our incarnation of that\nstrategy, as described in the proof of Theorem 4.6 below, requires that there is a canonical\nway to extend each form ωi of a generalized Phan geometry to the whole ambient vector\nspace. The following lemma takes care of this issue.\nLemma 4.1\nLet Γ be a generalized Phan geometry of V with respect to a flag F = {Vi | 0 ≤ i ≤ t + 1}\nwith forms (ωi )0≤i≤t . Let p be a one-dimensional space in V that is ωt -non-degenerate and\nsatisfies p ∩ Vt = {0}. Then, for 0 ≤ i ≤ t, there exist σ-hermitian forms ω i : V × V → K\nwith the properties\n• ω i |Vi+1 ×Vi+1 = ωi ,\n• Rad (ω i ) = Rad (ωi ) = Vi ,\n• p is ω i -non-degenerate (0 ≤ i ≤ t) and satisfies p⊥ωi = p⊥ωj for all 0 ≤ i, j ≤ t.\n7\n\n\fProof: Let p be a ωt -non-degenerate one-dimensional subspace of V , which necessarily\nsatisfies p ∩ Vt = {0}. Then\nV\n\n= C1 ⊕ C2 ⊕ C3 ⊕ * * * ⊕ Ct ⊕ Ct+1 ⊕ p\n∼\n= V1 ⊕ (V2 /V1 ) ⊕ (V3 /V2 ) ⊕ * * * ⊕ (Vt /Vt−1 ) ⊕ (p⊥ωt /Vt ) ⊕ p,\n\nwhere Ci is a complement of Vi−1 in Vi for 1 ≤ i ≤ t and Ct+1 is a complement of Vt in\np⊥ωt . The definition ω i : V × V → K via\n!\n\u0010\n\u0011\nX\n\u0001\nω i (x, y) :=\nωj prCj+1 (x), prCj+1 (y)\n+ ωt prp (x), prp (y)\ni≤j≤t\n\nfinishes the proof, where prA denotes the projection on A in the above direct decomposition\nof V .\n✷\nThe purpose of the following lemma is two-fold. On one hand it allows us to make use\nof an induction on the dimension when studying the homotopy type of a generalized Phan\ngeometry in Theorem 4.6. On the other hand it provides us with the local information required for the Cohen-Macaulayness of a generalized Phan geometry addressed in Corollary\n4.7.\nLemma 4.2\nLet Γ be a generalized Phan geometry of V with respect to a flag F = {Vi | 0 ≤ i ≤ t + 1}\nwith forms (ωi )0≤i≤t , and let U ∈ Γ be an element of Γ.\nThen the geometries Γ<U := {x ∈ Γ | x ( U} and Γ>U := {x ∈ Γ | x ) U} are\nisomorphic to generalized Phan geometries of U, respectively, V /U. In particular, the link\nof U in |Γ| is isomorphic to the join |Γ<U ∗ Γ>U | of a generalized Phan geometry of U and\nof a generalized Phan geometry of V /U.\nProof: The first claim is immediate: The geometry Γ<U is isomorphic to the generalized\nPhan geometry of \u0001U with respect to the flag {Vi ∩ U | kU ≤ i ≤ t + 1} and forms\nωi|(U ∩Vi+1 )×(U ∩Vi+1 ) k ≤i≤t where kU = min{i ∈ {0, . . . , t} | U ∩ Vi+1 6= {0}}.\nU\n\nIn order to establish the isomorphism type of Γ>U , consider the vector space V = V /U.\nDefine F := {Vi + U | 0 ≤ i ≤ kU + 1}. This is a flag of V with V0 + U = 0 + U and\nVkU +1 + U = V , so that any element of V can be written as x + U with x ∈ VkU +1 . In\n⊥\nfact, every element of V can be uniquely written as x + U with x ∈ (U ∩ VkU +1 ) ωkU =: W .\nNotice that VkU is contained in W , and therefore so are all subspaces Vi for 0 ≤ i ≤ kU . In\nthis specified interval for i define σ-hermitian forms\nω i : (Vi+1 + U) × (Vi+1 + U) → K : (x + U, y + U) 7→ ω i (x + U, y + U) := ωi (x, y)\nwhere x, y ∈ Vi+1 ∩ W . With this definition, certainly Rad (ω i ) = Vi + U for all 0 ≤ i ≤ kU ,\nso that we have defined a generalized Phan geometry in V .\n8\n\n\fIt remains to prove that this generalized Phan geometry is isomorphic to Γ>U . Let S be a\nsubspace of V containing U and let kS = min{i ∈ {0, . . . , t} | S ∩ Vi+1 6= {0}} be defined as\nabove. Then it is easily seen that we have S ⋔V F if and only if (S + U) ⋔V F . Moreover,\nkS = min{i ∈ {0, . . . , kU } | (S + U) ∩ (Vi+1 + U) 6= U}. Furthermore, the intersection\nS ∩ VkS +1 is ωkS -non-degenerate if and only if the intersection S ∩ VkS +1 ∩ W is ωkS -nondegenerate. Indeed, in case kS < kU , there is nothing to show, because VkS +1 ∩ W = VkS +1 ,\nwhile in case kS = kU the claim follows from the observation that U ∩ VkU +1 is ωkU -nondegenerate and W is ωkU -orthogonal to U ∩ VkU +1 . The lemma now follows from the fact\nthat, for x ∈ S ∩ VkS +1 ∩ W , by definition, x is ωkS -orthogonal to y ∈ S ∩ VkS +1 ∩ W if and\n✷\nonly if x + U is ω kS -orthogonal to y + U.\nThe following is an immediate consequence of Lemma 4.2.\nLemma 4.3\nT\nLet (Γj )j be a finite family of m generalized Phan geometries of V and let U ∈ j Γj .\nT\nT\nT\nT\nThen the geometries ( j Γj )<U := {x ∈ j Γj | x ( U} and ( j Γj )>U := {x ∈ j Γj |\nT\nT >U\nx ) U} are isomorphic to intersections j Γ<U\nofT\nm generalized Phan\nj , respectively,\nj Γj\ngeometries of U, respectively, V /U. In particular, the link of U in | j Γj | is isomorphic\nT\nT >U\nto the join |( j Γ<U\nΓj )| of the intersection of m generalized Phan geometries of U\nj )∗(\nand of the intersection of m generalized Phan geometries of V /U.\nT\nT\nT\nT\nand ( j Γj )>U = j Γ>U\nProof: It is obvious that ( j Γj )<U = j Γ<U\nj . Hence all claims\nj\nfollows from Lemma 4.2.\n✷\nNow we have almost everything in place in order to prove the Main Theorem. It\nremains to provide the following geometric existence results which help us to determine\nthe homotopy type of a generalized Phan geometry of a two-dimensional vector space. This\ntwo-dimensional case will serve as the basis of the induction on the dimension used in the\nproof of Theorem 4.6 below.\nLemma 4.4\nLet m ∈ N, let F ≤ K be fields, let V be a vector space of dimension at least two over F,\nand for 1 ≤ i ≤ m let φi : V × V → K be an F-bilinear map which admits a non-isotropic\nvector. If 2m < |F|, then there exist two F-linearly independent vectors of V which are\nnon-isotropic with respect to all maps φi .\nProof: We proceed by induction on the number of maps. For m = 0 there is nothing\nto prove. Assuming the theorem is true for m maps, let v be a vector which is nonisotropic with respect to m maps and let w be a vector that is non-isotropic with respect\nto a (m + 1)st map. Considering linear combinations of v and w we obtain finitely many\nquadratic equations in K whose F-rational zeros have to be avoided in order to find a\nvector which is non-isotropic with respect to all m + 1 forms. Since a two-dimensional\nF-vector space contains |F| + 1 one-dimensional subspaces, two vectors of V satisfying the\nconclusion of the lemma exist, if 2(m + 1) < |F|.\n✷\n9\n\n\fThe same proof works in the setting of hermitian forms of vector spaces over a finite\n√\nfield of square order q. The only difference is that there are at most q + 1 isotropic\none-dimensional subspaces per form in a two-dimensional Fq -vector space instead of two.\nLemma 4.5\nLet V be a vector space of dimension at least two over a finite field Fq of square order\nendowed with m < ∞ hermitian forms each of which admits a non-isotropic vector. If\n√\n( q + 1)m < q, then there exist two Fq -linearly independent vectors of V which are nonisotropic with respect to all forms.\nFinally we can state and prove our main result. Its proof has been strongly influenced\nby the proof of [2, Theorem 1.1], [3, Chapter II, Proposition 12].\nTheorem 4.6\nLet V be an (n + 1)-dimensional vector space over a field K. Let σ be an automorphism\nof K of order one or two.\nT Let (Γj )1≤j≤m be a finite family of generalized Phan geometries\nof V . Finally, let Γ = j Γj . In case K = Fq assume 2n m < q, if σ has order one, and\n√\n2n−1 ( q + 1)m < q, if σ has order two.\nThen |Γ| is homotopy equivalent to a (non-trivial) wedge of (n − 1)-spheres.\nProof: We proceed by induction on n.\n\nT\nFor n = 1, the vector space V is two-dimensional. The geometry Γ = 1≤j≤m Γj consists\nof all those one-dimensional subspaces of V that are non-degenerate with respect to each\nof the m hermitian forms of rank one or two induced by the Γj on V . In case K finite and\nσ 6= id, apply Lemma 4.5. Otherwise apply Lemma 4.4 to the FixK (σ)-span of a K-basis of\nV . In both cases we find two K-linearly independent vectors of V which are non-isotropic\nwith respect to all forms. Hence |Γ| is a wedge of 0-spheres.\n\nAssume now that the theorem is true for any family of size m of generalized Phan geometries\n√\ninside a vector space of dimension k < n + 1 satisfying 2k−1m < q, resp. 2k−2 ( q + 1)m < q\nin case K is a finite field of order q.\nLet p be a one-dimensional subspace of V which for each of the generalized Phan geometries\nΓj is non-degenerate with respect to the unique hermitian form defined on the whole vector\nspace V . Such a one-dimensional space p exists by Lemmas 4.4 and 4.5 via an argument\nas above. Define\nY0 := {W ∈ Γ | hp, W i ∈ Γ}.\n\nNote that Y0 contains all subspaces of V which contain p and which are contained in Γ.\nMoreover, define\nYi = Yi−1 ∪ {W ∈ Γ | dim W = n + 1 − i}\n\nfor i = 1, 2, . . . , n. Obviously, we have Y0 ⊆ Y1 ⊆ * * * ⊆ Yn = Γ. Each set Yi together with\nthe inclusion relation inside V forms a poset, so that it makes sense to use the symbols | * |\nand ∗ in this context.\n\nWe are going to use Lemma 2.6 and an induction on i to prove that |Yi | is homotopy\nequivalent to a wedge of (n − 1)-spheres for 1 ≤ i ≤ n.\n10\n\n\fi = 0: Y0 is contractible, because U 7→ hU, pi 7→ hpi, U ∈ Y0 , is a chain of deformation\nretractions.\ni − 1 → i: Apply Lemma 2.6 with Z = |Yi | and Z ′ = |Yi−1| and Aj = StYi (Uj ) for\nUj ∈ Yi \\Yi−1 . The topological space Z ′ is by induction contractible (i = 1) or a wedge\nof (n − 1)-spheres (otherwise).\nTo prove Aj1 ∩ Aj2 ⊆ Z ′ , let Uj1 6= Uj2 ∈ Yi \\Yi−1 . An element in StYi (Uj1 ) ∩ StYi (Uj2 )\nis in Yi and is incident with both Uj1 and Uj2 . Hence its dimension is not n + 1 − i\nand so it lies in Yi−1 .\nTo prove that Aj is contractible and that Aj ∩ Z ′ is (n − 2)-spherical, let U = Uj ∈\nYi \\Yi−1 . Note that dim U = n + 1 − i and hp, Ui ∈\n/ Γ, so p 6⊆ U. Then\n<U\n>U\nAj = StYi (U) = |Yi−1\n∗ U ∗ Yi−1\n|\n\nand\n<U\n>U\nAj ∩ Z ′ = StYi−1 (U) = |Yi−1\n∗ Yi−1\n|\n\n<U\n>U\nwhere Yi−1\n= {W ∈ Yi−1 | W ( U} and Yi−1\n= {W ∈ Yi−1 | W ) U}. The\n<U\n>U\n<U\ntopological space StYi (U) = |Yi−1 ∗ U ∗ Yi−1 | is homeomorphic to a cone over |Yi−1\n∗\n>U\nYi−1\n|, whence contractible.\n\n<U\n>U\nIn order to prove that the topological space Aj ∩ Z ′ = StYi−1 (U) = |Yi−1\n∗ Yi−1\n|\n<U\n>U\nis a wedge of spheres, it suffices to prove that both |Yi−1 | and |Yi−1 | are wedges of\nspheres. As Yi−1 contains each element of Γ whose dimension is greater than dim(U),\nthe equality\n>U\nYi−1\n= Γ>U = {W ∈ Γ | W ) U}\n\nholds. By Lemma 4.3 this complex is isomorphic to the intersection of m generalized\nPhan geometries of V /U (which has dimension i), so that by the hypothesis of the\n>U\ninduction on n the topological space |Yi−1\n| is a wedge of (i − 2)-spheres.\nAs the dimension of each element of Yi−1 \\Y0 is greater than dim(U), one easily sees\nthat\n<U\nYi−1\n= Y0<U = {W ∈ Γ | W ( U, hW, pi ∈ Γ}.\nBy Lemma 4.12 below the latter is isomorphic to the intersection of at most 2m\ngeneralized Phan geometries of U (which has dimension n + 1 − i). Since, in case\nK = Fq ,\n2dim U −2 C2m = 2dim U −1 Cm\n≤ 2n−1 Cm\n< q,\n√\n<U\nwhere C equals 2 or q + 1 respectively, we can apply the theorem to Yi−1\n= Y0<U =\n<U\n{W ∈ Γ | W ( U, hW, pi ∈ Γ} by hypothesis of the induction on n. Therefore |Yi−1\n|\nis a wedge of (n − 1 − i)-spheres.\n11\n\n\f<U\n>U\nIn conclusion Aj ∩ Z ′ = StYi−1 (U) = |Yi−1\n∗ Yi−1\n| is a wedge of (n − 2)-spheres, and\nso by Lemma 2.6 the topological space Z = |Yi | is homotopy equivalent to a wedge of\n(n − 1)-spheres.\n\nConsequently, |Γ| = |Yn | is a wedge of (n − 1)-spheres.\n\n✷\n\nA combination of the statement of the theorem with Lemma 4.3 implies the CohenMacaulayness of Γ.\nCorollary 4.7\nLet V be an (n + 1)-dimensional vector space over a field K. Let σ be an automorphism\nof K of order one or two.\nT Let (Γj )1≤j≤m be a finite familyn of generalized Phan geometries\nof V . Finally, let Γ = j Γj . In case K = Fq assume 2 m < q, if σ has order one, and\n√\n2n−1 ( q + 1)m < q, if σ has order two.\nThen |Γ| is Cohen-Macaulay.\nProof: Let s be a simplex of |Γ|. By an iteration of Lemma 4.3 the link Lk|Γ| (s) is a join of\nintersections of generalized Phan geometries. By Theorem 4.6 the link Lk|Γ| (s) is homotopy\nequivalent to a wedge of dim(Lk|Γ| (s))-spheres, whence for each p < dim(Lk|Γ| (s)) the\nreduced homology group H̃p (Lk|Γ| (s)) is trivial. Therefore |Γ| is Cohen-Macaulay.\n✷\nWe pointed out in Example 3.3 that for t = 0 and K finite of square order the generalized\nPhan geometry on a K-vector space equals the complex studied in [10] to re-prove Phan's\nfirst theorem [21]. One crucial step in [10] is the proof of simple connectedness of that\ngeometry. Theorem 4.6 yields more information about the homotopy type of that geometry,\nhowever only with an exponential instead of a constant bound on the size of the field.\nThe constant m is replaced by 1, because we are interested in the homotopy type of one\ngeneralized Phan geometry, not the intersection of several generalized Phan geometries.\nCorollary 4.8\nLet K be a field, let σ be an automorphism of K of order one or two, let V be an (n + 1)dimensional vector space over K endowed with a non-degenerate σ-hermitian form, and\nlet Γ be the complex of proper non-trivial non-degenerate subspaces of V . In case K = Fq\n√\nassume 2n < q, if σ has order one, and 2n−1 ( q + 1) < q, if σ has order two.\nThen |Γ| is Cohen-Macaulay. In particular, |Γ| is homotopy equivalent to a wedge of\n(n − 1)-spheres.\nThe sphericity of the geometry opposite a chamber is also obtained as a corollary of\nTheorem 4.6 for a generalized Phan geometry with t = n, cf. Example 3.4. As all σhermitian forms ωi have rank one and hence the zeros form a hyperplane, we can replace\n√\nq + 1, resp. 2 by 1 in the bound (cf. the proofs of Lemmas 4.4 and 4.5) and achieve\nexactly the same bound as in [3, Chapter II, Theorem B].\n\n12\n\n\fCorollary 4.9\nLet K be a field, let V be an (n + 1)-dimensional vector space over K, and let Γ be the\ngeometry opposite a chamber of V . In case K = Fq assume 2n−1 < q.\nThen |Γ| is Cohen-Macaulay. In particular, |Γ| is homotopy equivalent to a wedge of\n(n − 1)-spheres.\nWe still need to provide statement and proof of Lemma 4.12 which we used for proving\nTheorem 4.6. For this endeavour projections as used in [9] and [18] turn out to be useful.\nRecall the following fact from linear algebra.\nLemma 4.10\nLet K be a field, let σ be an automorphism of K of order one or two, let V be an (n + 1)dimensional vector space over K, and let ω : V × V → K be a σ-hermitian form. Moreover,\nlet W be an arbitrary subspace of V and let p be a one-dimensional subspace of V which\nis non-degenerate with respect to ω and which intersects W trivially.\nThen\n\u0001\nω p : V × V → K : (v, w) 7→ ω p (v, w) := ω prp⊥ω (v), prp⊥ω (w)\n\nwhere prp⊥ω denotes the projection onto the second summand of the direct decomposition\nV = p ⊕ p⊥ω , is a σ-hermitian form with\n\u0001\u0001\n\u0001\nprW Rad ω|hW,pi×hW,pi = Rad ω p |W ×W\n\nwhere prW denotes the projection onto the second summand of the direct decomposition\nhW, pi = p ⊕ W .\n\nProof: Let t ∈ Rad(ω|hW,pi×hW,pi), i.e. t ∈ hW, pi and ω(t, x) = 0 for all x ∈ hW, pi,\nin particular ω(t, p) = 0, i.e. t ∈ p⊥ω . Write t = w + v for w ∈ W and v ∈ p, so that\nprW (t) = w. Notice that, if x ∈ W , then prp⊥ω (x) ∈ hW, pi. For all x ∈ W we have\n\u0001\n\u0001\nω p (t, x) = ω prp⊥ω (t), prp⊥ω (x) = ω t, prp⊥ω (x) = 0,\n\nwhence\n\n0 = ω p (t, x) = ω p (w, x) + ω p (v, x) = ω p (w, x) + ω(0, prp⊥ω (x)) = ω p (w, x)\nfor all x ∈ W , so that w ∈ Rad(ω p |W ×W ).\n\nConversely, let w ∈ Rad(ω p |W ×W ), i.e. w ∈ W and\n\n\u0001\nω p (w, x) = ω prp⊥ω (w), prp⊥ω (x) = 0\n\nfor all x ∈ W . For arbitrary x ∈ W decomposed as x = prp⊥ω (x) + v for v ∈ p we have\n\u0001\n\u0001\n\u0001\n\u0001\nω prp⊥ω (w), x = ω prp⊥ω (w), prp⊥ω (x) + ω prp⊥ω (w), v = ω prp⊥ω (w), prp⊥ω (x) = 0.\n\u0001\n\u0001\nOn the other hand, ω prp⊥ω (w), p = \u00010. Hence ω prp⊥ω (w), x = 0 for all x ∈ hW, pi.\nTherefore prp⊥ω (w) ∈ Rad ω|hW,pi×hW,pi , implying\n\u0001\n\u0001\u0001\nw = prW ◦ prp⊥ω (w) ∈ prW Rad ω|hW,pi×hW,pi .\n\n✷\n\n13\n\n\fWe finish this section with the two final lemmas. Their proofs consist of elementary\nbut extremely technical arguments from linear algebra.\nLemma 4.11\nLet Γ be a generalized Phan geometry of an (n + 1)-dimensional K-vector space V with\nrespect to a flag F = {Vi | 0 ≤ i ≤ t + 1} with forms (ωi )0≤i≤t . Let p be an ωt -nondegenerate one-dimensional subspace of V and let U ∈ Γ be an element of Γ not containing\np. Furthermore, let\n∆ := {x ∈ Γ | hx, pi ∈ Γ}.\nIf Γ<U = {x ∈ Γ | x ( U} is non-empty, then Γ<U ∩ ∆ is an intersection of at most two\ngeneralized Phan geometries of U.\n\nProof: The geometry Γ<U is isomorphic to the generalized Phan geometry\u0001of U with\nrespect to the flag {Vi ∩ U | kU ≤ i ≤ t + 1} and forms ωi|(U ∩Vi+1 )×(U ∩Vi+1 ) k ≤i≤t , cf.\nU\nLemma 4.2 and its proof. To determine the isomorphism type of the intersection Γ<U ∩ ∆,\nlet W\nU be an element of Γ<U . The vector space W is contained in Γ<U ∩ ∆ if\nand only if hp, W i is an element of Γ. By definition, we have hp, W i ∈ Γ if and only if\nhp, W i ⋔V F with hp, W i∩Vkhp,W i+1 non-degenerate with respect to ωkhp,W i where, as before,\nkhp,W i := min{i ∈ {0, . . . , t} | hp, W i ∩ Vi+1 6= {0}}.\nClearly, hp, W i ⋔V F if and only if W ⋔U FUp where FUp := {hVi , pi ∩ U | 0 ≤ i ≤ lU } with\nlU := min{0 ≤ i ≤ t + 1 | hVi , pi ∩ U = U}. Note that lU is always equal to t + 1, except\nwhen Vt is a hyperplane of V , in which case lU = t.\n\nUsing notations from Lemma 4.10, we define\n\nfor 0 ≤ i ≤ lU .\n\n\u0010\n\u0011\nω pi : V × V → K : (v, w) 7→ ω i prp⊥ωi (v), prp⊥ωi (w)\n\nWe have khp,W i = min{i ∈ {0, . . . , lU } | W ∩ hVi , pi ∩ U 6= {0}} =: j. Moreover, we claim\nthat hp, W i ∩ Vj+1 is non-degenerate with respect to ωj if and only if W ∩ (hVj+1, pi ∩ U)\nis non-degenerate with respect to ω pj |(hV ,pi∩U )×(hV ,pi∩U ) . The intersection hp, W i ∩ Vj+1\nj+1\nj+1\nis non-degenerate with respect to ωj if and only if hhp, W i ∩ Vj+1, pi = hW, pi ∩ hVj+1, pi =\nhW ∩ hVj+1 , pi, pi is non-degenerate with respect to ω j (this is obvious for j = t and follows\nfrom the fact that p ⊥ω j Vj+1 by Lemma 4.1 for j < t). Since p is non-degenerate with\nrespect to ω j and p 6⊆ W ∩ hVj+1 , pi, we can apply Lemma 4.10 and obtain\n\u0011\u0011\n\u0010\n\u0010\n\u0010\n\u0011\np\n= Rad ω j |(W ∩hV ,pi)×(W ∩hV ,pi) .\nprW ∩hVj+1 ,pi Rad ω j |hW ∩hV ,pi,pi×hW ∩hV ,pi,pi\nj+1\n\nj+1\n\nj+1\n\nj+1\n\nTherefore hW ∩hVj+1 , pi, pi is non-degenerate with respect to ω j if and only if hVj+1, pi∩W\nis non-degenerate with respect to ω pj , because p is non-degenerate with respect to ω j . Since\nhVj+1, pi ∩ W ⊂ U, the above claim is proved.\n\nNotice that the family (hVi , pi ∩ U)0≤i≤lU may contain some subspace of U more than once.\nSince dim(hVi , pi ∩ U) = dim(Vi ∩ U) + 1 if and only if p ⊆ hVi , Ui and i 6= t + 1, and\n14\n\n\fsince the subspaces Vi form a flag, the only subspaces of U that can occur more than once\nin that family are zero-dimensional or one-dimensional. Notice that there is at least one\none-dimensional subspace in FUp exactly when p ⊆ hVkU , Ui. Since the σ-hermitian form on\nthe one-dimensional subspace of the flag of a generalized Phan geometry does not really\nplay any role - none of the transversal spaces have a non-trivial intersection with this\nspace - we can choose an arbitrary non-degenerate σ-hermitian form ω on that subspace\n(which will be the first form of the generalized Phan geometry).\nIt remains to check the radical property\n\u0011\n\u0010\nRad ω pi |(hVi+1 ,pi∩U )×(hVi+1 ,pi∩U ) = hVi , pi ∩ U\n\nfor the relevant incides i. Let us start with kU + 1 ≤ i ≤ t. By Lemma 4.10, we have\n\u0010\n\u0010\n\u0011\u0011\n\u0010\n\u0011\np\nprhVi+1 ,pi∩U Rad ω i|hhVi+1 ,pi∩U,pi×hhVi+1 ,pi∩U,pi\n= Rad ω i |(hVi+1 ,pi∩U )×(hVi+1 ,pi∩U ) .\n\nSince hhVi+1 , pi∩U, pi = hVi+1 , pi∩hU, pi, it suffices to determine the ω i -radical of hVi+1 , pi∩\nhU, pi - which is Vi ∩ hU, pi - and to project it onto hVi+1 , pi ∩ U - which results in\nhVi , pi ∩ U.\n\nIn view of our comments on the spaces Vi with hVi , pi ∩ U one-dimensional, the only\nremaining relevant index is i = kU . In case hVkU , pi ∩ U one-dimensional, we deduce\nthat p is contained in the span of VkU and U, so that by symmetry VkU ∩ hU, pi is onedimensional as well. Since VkU +1 ∩ hU, pi = (U ∩ VkU +1 ) ⊕ (VkU ∩ hU, pi), this implies that\nVkU ∩ hU, pi is the ω kU -radical of hVkU +1 , pi ∩ hU, pi and, thus, its projection hVkU , pi ∩\nU onto hVkU +1 , pi ∩ U is the ω pkU -radical, so that the arguments from above apply. In\nthis case,\nFUp is in fact {{0}} ∪ {hVi , pi ∩ U\u0013 | kU ≤ i ≤ lU }, to which we associate the\n\u0012 \u0010\n\u0011\nforms ω, ω pi |(hVi+1 ,pi∩U )×(hVi+1 ,pi∩U )\n. We just showed that they satisfy the radical\nkU ≤i≤lU\n\nproperty.\n\nIn case hVkU , pi ∩ U zero-dimensional, however, the space hVkU +1 , pi ∩ hU, pi may be ω kU non-degenerate or may have a one-dimensional ω kU -radical, and so hVkU +1 , pi ∩ U may be\nω pkU -non-degenerate or may have a one-dimensional ω pkU -radical R.\n\u0011\n\u0010\n= {0} = hVkU , pi ∩ U, and FUp\nIn the first case R = Rad ω pkU |(hV\n,pi∩U )×(hV\n,pi∩U )\nkU +1\n\nkU +1\n\nis in fact {{0}} ∪ {hVi , pi ∩ U | kU +\u00131 ≤ i ≤ lU }, to which we associate the forms\n\u0012\n\u0010\n\u0011\nω, ω pi |(hVi+1 ,pi∩U )×(hVi+1 ,pi∩U )\n. We just showed that they satisfy the radical\nproperty.\n\nkU +1≤i≤lU\n\nIn the second case, notice that FUp does not contain a one-dimensional space and so we can\n+\ndefine a slightly modified flag FUp := FUp ∪ {R}, which is in fact {{0}, R} ∪ {hVi , pi ∩ U |\nkU + 1 ≤ i ≤ lU }. Define also an arbitrary non-degenerate σ-hermitian form\nω+ : R × R → K.\n15\n\n\fWe then associate to\n\nFUp +\n\nthe forms\n\n\u0012\n\nω+ ,\n\n\u0010\n\nω pi |(hVi+1 ,pi∩U )×(hVi+1 ,pi∩U )\n\n\u0011\n\nkU +1≤i≤lU\n\n\u0013\n. Now FUp +\n\nand these forms satisfy the radical property. Since we changed the flag, there are still\na few things to be checked in order to show that hp, W i ∈ Γ if and only if W is in\nthe generalized Phan geometry of U with respect to the flag FUp + and forms as described.\np\nAssume hp, W i ∈ Γ. We already proved that W is transversal\n\u0011\n\u0010 to FU , so we just need to show\n\nthat W ∩ R = {0}. This intersection is contained in Rad ω pkU |(hV\n\nkU +1 ,pi∩W )×(hVkU +1 ,pi∩W )\n\n.\n\nIf hVkU +1 , pi ∩ W = {0} we are done. If hVkU +1 , pi ∩ W 6= {0}, then hW, pi ∩ VkU +1 6= {0},\nand so khp,W i = kU (since hW, pi ∩ VkU = {0}). Therefore by hypothesis hW, pi ∩ VkU +1\nis non-degenerate with respect to ωkU , and so, as shown above, W ∩ hVkU +1 , pi is nondegenerate with respect to ω pkU |(hV\n. Hence W ∩ R = {0}. Finally, we\n,pi∩U )×(hV\n,pi∩U )\nkU +1\n\nkU +1\n\nhave that khp,W i = min{i ∈ {kU + 1, . . . , lU } | W ∩ (hVi , pi ∩ U) 6= {0}}, and so we can\nconclude by the same argument as above. Since W ⋔U FUp + implies W ⋔U FUp and W ∩ R\nmust be trivial, the reverse implication is immediate.\n\nIn conclusion, the intersection Γ<U ∩ ∆ is isomorphic to the intersection of the generalized\n\u0001\nPhan geometry of U with respect to the flag (Vi ∩U)kU ≤i≤t+1 and forms ωi|(Vi+1 ∩U )×(Vi+1 ∩U ) k\n+\n\nand the generalized Phan geometry of U with respect to the flag FUp (respectively, FUp )\nand forms as described above.\n✷\nSimilar to Lemma 4.3 the following is immediate from Lemma 4.11.\n\nLemma 4.12\nLet (Γj )j be a finite family of m generalized Phan geometries of V with respect to flags\nF j = {Vij | 0 ≤ i ≤ tj + 1} with forms (ωij )0≤i≤tj . Let p be a one-dimensional subspace\nT\nT\nof V which for each j is ωtjj -non-degenerate. Let U ∈ j Γj be an element of j Γj not\ncontaining p. Furthermore, let\n\\\n\\\n∆ := {x ∈\nΓj | hx, pi ∈\nΓj }.\nj\n\nj\n\nT\nIf each Γ<U\n= {x ∈ Γj | x ( U} is non-empty, then j Γ<U\n∩ ∆ is an intersection of at\nj\nj\nmost 2m generalized Phan geometries of U.\nT\nT <U\nProof: This follows from Lemma 4.11, because ( j Γ<U\n∩ ∆j ) where\nj ) ∩ ∆ =\nj (Γj\n∆j := {x ∈ Γj | hx, pi ∈ Γj }.\n✷\n\n5\n\nOutline of applications\n\nIn this section we sketch two sets of applications of Theorem 4.6 to geometric group theory.\nA thorough treatment of these applications requires the language of (twin) buildings which\nwe do not want to develop here. For more details and background information we refer the\nreader to [14] and [16].\n16\n\nU ≤i≤t\n\n\fOur applications depend on the following fact. Example 3.6 indicates how to prove its\ncorrectness for a (twin) building B of type An . A special case is treated in [11].\nFact 5.1\nLet B be a twin building with a Phan involution τ . Let R be a spherical residue of type\nL\ni∈I Ani of B. Then the geometry associated to the chamber system Aτ (R) is a direct\nsum of generalized Phan geometries of type Ani .\nA Phan involution τ is an involution interchanging both parts of a twin building isometrically and satisfying an additional technical condition. The chamber system Aτ (R)\nconsists of all those chambers of R with minimal possible codistance from their image\nunder τ , cf. Example 3.6. Detailed discussions can be found in [14] and [16].\nThe first set of applications of Theorem 4.6 deals with the revision program of Phan's\nresults [21], [22].\nTheorem 5.2\nLet K be a field containing sufficiently many elements, let σ be an automorphism of K of\norder one or two, let ∆ be a graph without triangles, and let B be a twin building of type\n∆ over K with a Phan involution τ that induces σ on K.\nThen the Phan geometry Bτ , i.e., the subsystem of chambers of the positive half of B\nmapped onto an opposite one by τ , is 2-simply connected.\nSketch of proof: By the criterion of simple connectedness from [14] it remains to prove\nthat for residues R of rank two, resp. three the chamber system Aτ (R) is connected, resp.\nsimply connected. Since therefore one only has to deal with the connectedness properties of\nchambers systems of rank two or three, by [25] one can equivalently study connectedness\nproperties of the corresponding geometries. By Fact 5.1 it suffices to study generalized\nPhan geometries of type A2 and A3 or direct sums of generalized Phan geometries. By\nTheorem 4.6 the generalized Phan geometries of type A2 are connected and the generalized\nPhan geometries of type A3 are simply connected, if the field K contains sufficiently many\nelements. A direct sum of two rank one geometries is always connected and a direct sum\nof a rank one and a connected rank two geometry is always simply connected. Hence the\nclaim follows.\n✷\nThe following result is implied by Theorem 5.2. It has first been stated in [22] and then\nre-proven via a direct computation based on [14] by Hoffman, Shpectorov and two of the\nauthors during an RiP stay in Oberwolfach in summer 2005. For the definition of a group\nwith a weak Phan system, we refer the reader to the survey [8], the thesis [15], and the\nresearch paper [10].\nCorollary 5.3\nLet n ≥ 3, let q ≥ 5, let ∆ ∈ {An , Dn , E6 , E7 , E8 }, and let K be a group with a weak Phan\nsystem of type ∆ over Fq2 . Then K is a central quotient of SUn+1 (q 2 ), Spin±\n2n (q), or the\nsimply connected version of 2 E6 (q 2 ), E7 (q), E8 (q), respectively.\n17\n\n\fSketch of proof: Since q ≥ 5, the inequalities 2(q+1) < q 2 and 22 (q+1) < q 2 are satisfied,\nso that by Theorem 4.6 and Theorem 5.2 the Phan geometry Bτ with respect to the building\nof type ∆ over Fq2 and the unique semilinear Phan involution τ , is simply connected. By\n[8], [10], [15] the simple connectedness of Bτ implies that K is the universal enveloping\ngroup of the Phan amalgam contained in K. The claim follows from the classification of\nunambiguous noncollapsing Phan amalgams in [10], [15], by which there exists a unique\nPhan amalgam up to passing to quotients.\n✷\nAs for the second set of applications the Main Theorem can be used in order to establish\ntopological finiteness properties of so-called unitary forms of Kac-Moody groups over finite\nfields. The following statement is a first rough attempt.\nCorollary 5.4\nLet n ≥ 3, let q ≥ 5, let ∆ be a graph without triangles, and let G be a Kac-Moody group\nof type ∆ over Fq2 . Let τ be the product of the Chevalley involution of G and the field\ninvolution.\nThen the group K := FixG (τ ) is finitely presented.\nSketch of proof: As in the sketch of Corollary 5.3, the Phan geometry Bτ with respect\nto the twin building of type ∆ over Fq2 is simply connected. Again as before the simple\nconnectedness of Bτ implies that K is the universal enveloping group of the Phan amalgam\ncontained in K. Since this Phan amalgam consists of finite groups, the group K is finitely\npresented.\n✷\nMore sophisticated statements are possible if one uses the existing machinery for topological finiteness properties, notably Brown's criteria [12]. The following theorem deals\nwith the topological finiteness length of the unitary form of a Kac-Moody group of type\nÃn over the field Fq2 .\nTheorem 5.5\nLet n ≥ 2, let q be be a prime power satisfying 2n−1 (q + 1) < q 2 , and let σ be the involution\nof the field Fq2 (t) mapping t to t−1 and acting as the field involution on Fq2 . Then the\ngroup\nK := SUn+1 (Fq2 [t, t−1 ], σ) = {A ∈ SLn+1 (Fq2 [t, t−1 ]) | (A−1 )σ = AT }\nis of type Fn−1 and not of type Fn .\nSketch of proof: This follows by Brown's criterion [12, Corollary 3.3] applied to the\nen for\nfiltration (Cn )n∈N from [14] of the positive half B+ of the twin building of type A\n−1\nthe Kac-Moody group SLn+1 (Fq2 [t, t ]). The relative links again are generalized Phan\ngeometries by Fact 5.1, which are spherical by Theorem 4.6. The group K is a subgroup of\nthe locally compact group SLn+1 (Fq2 ((t))) and since σ interchanges t and t−1 it is necessarily\ndiscrete. As the cell stabilisers of the action of SLn+1 (Fq2 ((t))) on B+ are compact, the cell\nstabilisers in its discrete subgroup K have to be finite. Therefore the cell stabilisers in K\nare of type F∞ . Finally, using the surjectivity of the norm map Fq2 → Fq one can prove\n18\n\n\fthat for each n ∈ N the group K acts transitively on the layer Cn \\Cn−1 of the filtration,\nso that the filtration is cocompact.\n✷\nRemark 5.6 It is elementary but not straightforward to see that the group SUn+1 (Fq2 [t, t−1 ], σ)\nfrom Theorem 5.5 is an arithmetic subgroup of SLn+1 (Fq2 (t)). Hence, for the sake of brevity\nof this remark, we allow ourselves the liberty to use some very heavy machinery in order to\nestablish this arithmeticity: By [19] the group SUn+1 (Fq2 [t, t−1 ], σ) is a lattice in the locally\ncompact group SLn+1 (Fq2 ((t))). Therefore by [20, Chapter IX] it is an arithmetic subgroup\nof SLn+1 (Fq2 (t)). This means that Theorem 5.5 states that the topological finiteness length\nof SUn+1 (Fq2 [t, t−1 ], σ) equals its local rank minus one, which is another piece of evidence\nin favour of the rank conjecture on the finiteness lengths of S-arithmetic groups; cf. [7].\n\nReferences\n[1] Herbert Abels, Finiteness properties of certain arithmetic groups in the function field\ncase, Israel J. Math. 76 (1991), 113–128.\n[2] Herbert Abels, Peter Abramenko, On the homotopy type of subcomplexes of Tits\nbuildings, Adv. Math. 101 (1993), 78–86.\n[3] Peter Abramenko, Twin buildings and applications to S-arithmetic groups, Springer,\nBerlin 1996.\n[4] Kristina Altmann, The geometry of non degenerate subspaces of complex orthogonal\nspace, Diplomarbeit, TU Darmstadt 2003.\n[5] Kristina Altmann, Ralf Gramlich, On the geometry of the nondegenerate subspaces\nof orthogonal space, Bull. Math. Soc. Belg. Simon Stevin 13 (2006), 167–179.\n[6] Michael Aschbacher, Notes on the Curtis-Tits-Phan Theorems, unpublished note.\n[7] Helmut Behr, Arithmetic groups over function fields. I. A complete characterization\nof finitely generated and finitely presented arithmetic subgroups of reductive algebraic\ngroups, J. Reine Angew. Math. 495 (1998), 79–118.\n[8] Curtis D. Bennett, Ralf Gramlich, Corneliu Hoffman, Sergey Shpectorov, CurtisPhan-Tits theory. In: Groups, Combinatorics and Geometry, Proceedings of the\nDurham Conference on Groups and Geometry 2001 (edited by Ivanov, Liebeck, Saxl),\nWorld Scientific, New Jersey 2003, 13–29.\n[9] Curtis D. Bennett, Ralf Gramlich, Corneliu Hoffman, Sergey Shpectorov, Odddimensional orthogonal groups as amalgams of unitary groups, part 1: general simple\nconnectedness, J. Algebra 312 (2007), 426–444.\n[10] Curtis D. Bennett, Sergey Shpectorov, A new proof of Phan's theorem, J. Group\nTheory 7 (2004), 287–310.\n19\n\n\f[11] Rieuwert Blok, Corneliu Hoffman, A Curtis-Tits-Phan theorem for the twin building\nen−1 , submitted.\nof type A\n\n[12] Kenneth S. Brown, Finiteness properties of groups, J. Pure. Appl. Algebra 44 (1987),\n45–75.\n\n[13] Kaustuv M. Das, Homotopy and homology of p-subgroup complexes, PhD thesis, Caltech 1994.\n[14] Alice Devillers, Bernhard Mühlherr, On the simple connectedness of certain subsets\nof buildings, Forum Math. 19 (2007), 955–970.\n[15] Ralf Gramlich, Phan theory, Habilitationsschrift, TU Darmstadt 2004.\n[16] Ralf Gramlich, Developments in finite Phan theory, Innov. Incidence Geom., to appear. See http://www.mathematik.tu-darmstadt.de/∼gramlich\n[17] Ralf Gramlich, Corneliu Hoffman, Bernhard Mühlherr, Sergey Shpectorov, Simple\nconnectedness of generalized flipflop geometries of type B3 and C3 , preprint.\n[18] Ralf Gramlich, Corneliu Hoffman, Sergey Shpectorov, A Phan-type theorem for\nSp(2n, q), J. Algebra 264 (2003), 358–384.\n[19] Ralf Gramlich, Bernhard Mühlherr, Lattices from involutions of Kac-Moody groups,\npreprint; see Oberwolfach report 3/2008, 139–140.\n[20] Gregori Margulis, Discrete subgroups of semisimple Lie groups, Springer, Berlin 1991.\n[21] Kok-Wee Phan, On groups generated by three-dimensional special unitary groups, I.\nJ. Austral. Math. Soc. Ser. A 23 (1977), 67–77.\n[22] Kok-Wee Phan, On groups generated by three-dimensional special unitary groups. II,\nJ. Austral. Math. Soc. Ser. A 23 (1977), 129–146.\n[23] Daniel Quillen, Homotopy properties of the poset of nontrivial p-subgroups of a group,\nAdv. Math. 28 (1978), 101–128.\n[24] Edwin H. Spanier, Algebraic Topology, McGraw-Hill, New York 1966.\n[25] Jacques Tits, A local approach to buildings, in: The Geometric Vein – The Coxeter\nFestschrift (edited by Chandler Davis, Branko Grünbaum, F. Arthur Sherk), Springer,\nBerlin 1981, 519–547.\n[26] Jacques Tits, Twin buildings and groups of Kac-Moody type, in: Groups, Combinatorics and Geometry (edited by Martin W. Liebeck and Jan Saxl), Cambridge University Press, Cambridge 1992, 249–286.\n\n20\n\n\f"}