{"id": "http://arxiv.org/abs/0805.1376v2", "guidislink": true, "updated": "2008-09-01T21:33:24Z", "updated_parsed": [2008, 9, 1, 21, 33, 24, 0, 245, 0], "published": "2008-05-09T15:55:20Z", "published_parsed": [2008, 5, 9, 15, 55, 20, 4, 130, 0], "title": "Positive and negative streamers in ambient air: measuring diameter,\n  velocity and dissipated energy", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0805.3370%2C0805.0343%2C0805.3533%2C0805.4411%2C0805.4342%2C0805.0489%2C0805.0491%2C0805.2044%2C0805.1868%2C0805.0432%2C0805.0727%2C0805.2419%2C0805.2686%2C0805.3895%2C0805.2341%2C0805.1620%2C0805.3476%2C0805.2868%2C0805.2802%2C0805.1404%2C0805.1742%2C0805.2340%2C0805.1592%2C0805.0857%2C0805.0070%2C0805.4685%2C0805.0167%2C0805.3801%2C0805.2881%2C0805.0905%2C0805.4565%2C0805.0205%2C0805.0040%2C0805.2664%2C0805.4425%2C0805.3038%2C0805.0328%2C0805.1174%2C0805.3491%2C0805.4670%2C0805.0502%2C0805.3429%2C0805.3064%2C0805.2641%2C0805.2500%2C0805.1613%2C0805.3020%2C0805.2620%2C0805.2018%2C0805.0964%2C0805.1184%2C0805.4016%2C0805.3331%2C0805.0073%2C0805.2339%2C0805.4469%2C0805.3965%2C0805.2836%2C0805.4515%2C0805.0787%2C0805.3734%2C0805.1578%2C0805.2642%2C0805.1093%2C0805.0273%2C0805.3078%2C0805.2346%2C0805.1426%2C0805.4699%2C0805.1951%2C0805.0689%2C0805.4017%2C0805.3576%2C0805.1650%2C0805.2604%2C0805.3998%2C0805.1376%2C0805.3466%2C0805.4799%2C0805.0412%2C0805.2176%2C0805.3419%2C0805.0644%2C0805.2050%2C0805.0781%2C0805.4747%2C0805.4514%2C0805.3134%2C0805.3999%2C0805.0518%2C0805.2832%2C0805.1902%2C0805.2865%2C0805.2336%2C0805.1894%2C0805.0075%2C0805.0407%2C0805.4038%2C0805.1872%2C0805.1257%2C0805.0800&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Positive and negative streamers in ambient air: measuring diameter,\n  velocity and dissipated energy"}, "summary": "Positive and negative streamers are studied in ambient air at 1 bar; they\nemerge from a needle electrode placed 40 mm above a planar electrode. The\namplitudes of the applied voltage pulses range from 5 to 96 kV; most pulses\nhave rise times of 30 ns or shorter. Diameters, velocities and energies of the\nstreamers are measured. Two regimes are identified; a low voltage regime where\nonly positive streamers appear and a high voltage regime where both positive\nand negative streamers exist. Below 5 kV, no streamers emerge. In the range\nfrom 5 to 40 kV, positive streamers form, while the negative discharges only\nform a glowing cloud at the electrode tip, but no streamers. For 5 to 20 kV,\ndiameters and velocities of the positive streamers have the minimal values of\nd=0.2 mm and v \\approx 10^5 m/s. For 20 to 40 kV, their diameters increase by a\nfactor 6 while the voltage increases only by a factor 2. Above the transition\nvalue of 40 kV, streamers of both polarities form; they strongly resemble each\nother, though the positive ones propagate further; their diameters continue to\nincrease with applied voltage. For 96 kV, positive streamers attain diameters\nof 3 mm and velocities of 4*10^6 m/s, negative streamers are about 20 % slower\nand thinner. An empirical fit formula for the relation between velocity v and\ndiameter d is v=0.5 d^2/(mm ns) for both polarities. Streamers of both\npolarities dissipate energies of the order of several mJ per streamer while\ncrossing the gap.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0805.3370%2C0805.0343%2C0805.3533%2C0805.4411%2C0805.4342%2C0805.0489%2C0805.0491%2C0805.2044%2C0805.1868%2C0805.0432%2C0805.0727%2C0805.2419%2C0805.2686%2C0805.3895%2C0805.2341%2C0805.1620%2C0805.3476%2C0805.2868%2C0805.2802%2C0805.1404%2C0805.1742%2C0805.2340%2C0805.1592%2C0805.0857%2C0805.0070%2C0805.4685%2C0805.0167%2C0805.3801%2C0805.2881%2C0805.0905%2C0805.4565%2C0805.0205%2C0805.0040%2C0805.2664%2C0805.4425%2C0805.3038%2C0805.0328%2C0805.1174%2C0805.3491%2C0805.4670%2C0805.0502%2C0805.3429%2C0805.3064%2C0805.2641%2C0805.2500%2C0805.1613%2C0805.3020%2C0805.2620%2C0805.2018%2C0805.0964%2C0805.1184%2C0805.4016%2C0805.3331%2C0805.0073%2C0805.2339%2C0805.4469%2C0805.3965%2C0805.2836%2C0805.4515%2C0805.0787%2C0805.3734%2C0805.1578%2C0805.2642%2C0805.1093%2C0805.0273%2C0805.3078%2C0805.2346%2C0805.1426%2C0805.4699%2C0805.1951%2C0805.0689%2C0805.4017%2C0805.3576%2C0805.1650%2C0805.2604%2C0805.3998%2C0805.1376%2C0805.3466%2C0805.4799%2C0805.0412%2C0805.2176%2C0805.3419%2C0805.0644%2C0805.2050%2C0805.0781%2C0805.4747%2C0805.4514%2C0805.3134%2C0805.3999%2C0805.0518%2C0805.2832%2C0805.1902%2C0805.2865%2C0805.2336%2C0805.1894%2C0805.0075%2C0805.0407%2C0805.4038%2C0805.1872%2C0805.1257%2C0805.0800&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Positive and negative streamers are studied in ambient air at 1 bar; they\nemerge from a needle electrode placed 40 mm above a planar electrode. The\namplitudes of the applied voltage pulses range from 5 to 96 kV; most pulses\nhave rise times of 30 ns or shorter. Diameters, velocities and energies of the\nstreamers are measured. Two regimes are identified; a low voltage regime where\nonly positive streamers appear and a high voltage regime where both positive\nand negative streamers exist. Below 5 kV, no streamers emerge. In the range\nfrom 5 to 40 kV, positive streamers form, while the negative discharges only\nform a glowing cloud at the electrode tip, but no streamers. For 5 to 20 kV,\ndiameters and velocities of the positive streamers have the minimal values of\nd=0.2 mm and v \\approx 10^5 m/s. For 20 to 40 kV, their diameters increase by a\nfactor 6 while the voltage increases only by a factor 2. Above the transition\nvalue of 40 kV, streamers of both polarities form; they strongly resemble each\nother, though the positive ones propagate further; their diameters continue to\nincrease with applied voltage. For 96 kV, positive streamers attain diameters\nof 3 mm and velocities of 4*10^6 m/s, negative streamers are about 20 % slower\nand thinner. An empirical fit formula for the relation between velocity v and\ndiameter d is v=0.5 d^2/(mm ns) for both polarities. Streamers of both\npolarities dissipate energies of the order of several mJ per streamer while\ncrossing the gap."}, "authors": ["T. M. P. Briels", "J. Kos", "G. J. J. Winands", "E. M. van Veldhuizen", "Ute Ebert"], "author_detail": {"name": "Ute Ebert"}, "author": "Ute Ebert", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0022-3727/41/23/234004", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0805.1376v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0805.1376v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "20 pages, 9 figures, accepted for J. Phys. D", "arxiv_primary_category": {"term": "physics.plasm-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.plasm-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.geo-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0805.1376v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0805.1376v2", "journal_reference": "J. Phys. D: Appl. Phys. 41 (2008) 234004", "doi": "10.1088/0022-3727/41/23/234004", "fulltext": "arXiv:0805.1376v2 [physics.plasm-ph] 1 Sep 2008\n\nPositive and negative streamers in ambient air:\nmeasuring diameter, velocity and dissipated energy\nT M P Briels1 , J Kos1 , G J J Winands2 , E M van Veldhuizen1\nand U Ebert1,3\n1\n\nDepartment of Applied Physics and 2 Department of Electrical Engineering,\nTechnische Universiteit Eindhoven, P O Box 513, 5600 MB Eindhoven, The\nNetherlands,\n3\nCentrum voor Wiskunde en Informatica (CWI), P O Box 94079, 1090 GB\nAmsterdam, The Netherlands\nE-mail: e.m.v.veldhuizen@tue.nl, ebert@cwi.nl\nAbstract. Positive and negative streamers are studied in ambient air at 1 bar; they\nemerge from a needle electrode placed 40 mm above a planar electrode. The amplitudes\nof the applied voltage pulses range from 5 to 96 kV; most pulses have rise times of 30\nns or shorter. Diameters, velocities and energies of the streamers are measured. Two\nregimes are identified; a low voltage regime where only positive streamers appear and\na high voltage regime where both positive and negative streamers exist. Below 5 kV,\nno streamers emerge. In the range from 5 to 40 kV, positive streamers form, while the\nnegative discharges only form a glowing cloud at the electrode tip, but no streamers.\nFor 5 to 20 kV, diameters and velocities of the positive streamers have the minimal\nvalues of d = 0.2 mm and v ≈ 105 m/s. For 20 to 40 kV, their diameters increase by\na factor 6 while the voltage increases only by a factor 2. Above the transition value\nof 40 kV, streamers of both polarities form; they strongly resemble each other, though\nthe positive ones propagate further; their diameters continue to increase with applied\nvoltage. For 96 kV, positive streamers attain diameters of 3 mm and velocities of 4*106\nm/s, negative streamers are about 20% slower and thinner. An empirical fit formula\nfor the relation between velocity v and diameter d is v = 0.5 d2 /(mm ns) for both\npolarities. Streamers of both polarities dissipate energies of the order of several mJ\nper streamer while crossing the gap.\n\nPACS numbers: 52.80.-s, 52.80.Hc\n\nSubmitted to: The paper is accepted for publication in the cluster issue on \"Streamers, Sprites\nand Lightning\" in J. Phys. D: Appl. Phys.\n\n\fPositive and negative streamers in ambient air: measurements\n\n2\n\n1. Introduction\nStreamers of both polarities appear in many phenomena in nature [1, 2, 3]. Industrial\napplications, on the other hand, have largely focussed on positive (cathode directed)\nstreamers [4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21] as they are easier\nto create around sharp tips than negative (anode directed) ones [1]. This even has lead\nto a tendency in the applied physics and electrical engineering literature to use the term\n\"streamer\" as equivalent to \"positive streamer\". Positive streamer coronas are used in\ngas cleaning and ozone production since they were long thought to have a higher energy\nefficiency than negative streamer coronas [22]. However, recent investigations with a\nnew generation of pulsed power supplies have shown that negative streamers at voltages\nof 50 to 80 kV can convert pulsed electric energy into ozone with an unequalled efficiency\nof 100 g/kWh in ambient air [23, 24]. Furthermore, negative DC-corona is used in dust\nprecipitators to charge small particles that then can be drawn out of a gas stream by\nan electric field. The properties of these negative streamers at voltages above 50 kV\nlargely resemble those of positive ones [23, 24, 25, 26, 27, 28]. A qualitative similarity\nbetween positive and negative streamers in nitrogen with varying oxygen concentration\nis also found in experiments in a 13 cm gap in protrusion-plane electrode geometry at\nvoltages of 82 to 125 kV [29] while other authors emphasize their difference [30].\nUp to now, studies have explored limited parameter regimes, seeing either positive\nstreamers only, or both positive and negative streamers. Here we present a systematic\nstudy over a wide parameter regime where actually two regimes are seen, one with\npositive streamers only and another one with positive and negative streamers. We\ninvestigate streamers in ambient laboratory air between a needle and a planar electrode\nat a distance of 4 cm. We investigate a voltage range from 5 to 96 kV with three different\nvoltage-supplies that were previously used either in the studies of positive streamers\nat the physics department [31, 32, 33, 34, 35, 36], or for both positive and negative\nstreamers at the electrical engineering department [23, 24, 25, 26, 27, 28] of Eindhoven\nUniversity of Technology. We attribute similarity or major differences between positive\nand negative streamers to different voltage ranges. For low voltages, thin positive\nstreamers ignite and propagate easily, while negative discharges require much higher\nignition voltages, they form thick and short streamers if at all. For voltages above\n60 kV, positive and negative streamers become more and more alike.\nTheoretical investigations of the difference between positive and negative streamers\nin three spatial dimensions (using the cylindrical symmetry of a streamer to calculate\neffectively in the two dimensions r and z) and including the photo-ionization effect in\nair are quite rare [37, 38, 39, 40], a thorough discussion and new results that closely\ncorrespond to the experimental results of the present paper are presented in [41].\nFor readers from the geophysical community, a short reminder is in place why\nwe discuss the dependence on applied voltage rather than on applied field. To\ncreate streamers efficiently, and to photograph them with high spatial and temporal\nresolution, streamers in experiments and applications are typically emitted from needle\n\n\fPositive and negative streamers in ambient air: measurements\n\n3\n\nor wire electrodes that create strong electric fields in their neighborhood.‡ As a short\nconsideration - e.g., of the example for a charged sphere - shows, the electric field\nclose to the strongly curved electrode is mostly determined by voltage and electrode\ngeometry and rather independent of the distance to some distant grounded electrode.\nIt is therefore physically evident and has been confirmed by experiments [31, 32],\nthat streamer inception and initial propagation is determined by applied voltage and\nelectrode geometry, and not by some hypothetical average field within the complete\ndischarge gap. The streamers start in a high field region and consecutively expand into\na region with decreasing field.\nAll streamers presented in this paper are created in a 40 mm gap in a needle\nto plane electrode geometry in ambient air at atmospheric pressure. We have chosen\nto investigate the streamers in this gap length because in longer gaps the streamers\ncan branch and form thinner ones [32], and at high voltages in wire-plane electrode\ngeometries they also have been seen to become thicker while propagating [28]; in smaller\ngaps the streamers have not enough space to develop completely [33, 35], and it is\ndifficult to measure their velocities.\nIn [35] we concentrated on the investigation of the thinnest positive streamers at\nvarying pressure and gas composition and used voltage supplies with \"slow\" rise times.\nIn contrast, we here use three voltage supplies with fast rise time to create the thickest\nstreamers possible at the particular peak voltage. The three supplies together cover the\nvoltage range from 5 to 96 kV, their ranges overlap and we find the resulting streamer\nproperties to depend continuously on the voltage, independently of the used supply. We\nalso perform control experiments with one slower voltage supply to further confirm the\nstatement in [32] that power supplies will create similar streamer patterns only if their\nvoltage rise time, peak voltage and internal resistance are similar.\nThe paper is organized as follows. The experimental setups are described in\nsection 2. The evaluation procedure of photographs and the results are described in\nsection 3; the section is ordered into a general overview, dependence on the voltage\nsupply, stability field, streamer diameters, streamer velocities, an empirical relation\nbetween diameter and velocity, and current and energy. Section 4 contains summary\nand conclusions.\n2. Experimental setup\n2.1. Voltage pulse generation\nA pulsed power supply consists of three parts: (i) charge storage, (ii) switch, and\n(iii) load. (i) The charge is conventionally stored in a capacitor, these are readily\navailable for voltages up to 100 kV. (ii) The switch is the crucial part when rise times in\nthe nanosecond range are required. The prevailing choice still is the spark gap, modern\n‡ We remark that similar mechanisms can take place next to charged droplets or ice particles in\nthunderclouds.\n\n\fPositive and negative streamers in ambient air: measurements\n\n4\n\na)\n\nb)\n\nc)\nFigure 1. a) C-supply, b) TLT-supply and c) PM-supply. C-supply and TLT-supply\nwere used in the experiments at the physics department and already described in [32];\na detailed drawing of the discharge chamber in these supplies including the current and\nvoltage measurements is provided in Fig. 2 of [35]. The PM-supply was used in the\nexperiments at the electrical engineering department and already discussed in [45]; the\npanel indicates the location of current and voltage measurements. Different diagnostics\nwas used at the two locations as described in the text.\n\n\f5\n\nPositive and negative streamers in ambient air: measurements\nname\nC1\nC2\nTLT\nPM\n\nR1\n(kΩ)\n0\n2\n1\n-\n\nR2\n(MΩ)\n0.004\n1\n-\n-\n\nR3\nC\nTrise\n(Ω)\n(nF)\n(ns)\n2.75\n0.250\n30\n2.75\n1\n150\n-\n1\n25\n- 2 (PFL) 15\n\nTduration\n(μs)\n1\n1000\n0.05\n0.1\n\nrange of U\n(kV)\n1 – 60\n1 – 60\n30 – 60\n40 – 96\n\npolarity\n+\n+ and −\n+\n+ and −\n\nTable 1. Characterization of the electric power supplies in the present experiments.\nThe resistor R1 influences the rise time of the pulse. The combination of R2 and C\ndetermines the decay time of the voltage pulse. R3 is a series resistance to determine\nthe discharge current.\n\nversions combine robustness, high efficiency and long life time [42, 43]. Alternatives\nsuch as semiconductors, whether or not in combination with magnetic compression,\noffer in principle longer life time, but are vulnerable, have lower efficiency and are very\nexpensive. (iii) The load is basically the corona discharge, but impedance matching is\na major issue for large systems [44]. The three supplies used in the current study are\nsketched in Fig. 1; their properties are listed in table 1. In general, the voltage pulse\nduration is kept short since long pulses at high voltages may allow the initial streamer to\ndevelop into a much brighter arc or spark discharge which forms a risk for overexposure\nof the intensifier of the CCD camera.\nThe simplest supply is called the C-supply; it was thoroughly described in [32] and\nit is sketched in Fig. 1(a). In a C-supply, a capacitor first is charged and subsequently\ndischarged over the needle plate gap when the spark gap is closed. It gives the\npulse exponential rise and decay times that can be adapted with resistors R1 and\nR2 . Therefore this supply is very versatile and easy to build. Two versions of the\nC-supply were used as listed in table 1. The C1 -supply has the advantage of a short\nrise time Trise = 30 ns and quite short duration Tduration = 1 μs, but this limits the\npulse amplitude. The C2 -supply has a longer rise time Trise = 150 ns and a longer pulse\nduration Tduration = 1 ms. It is used to confirm that the streamer structure changes when\nthe rise time becomes too long [32]; the long pulse duration might allow the transition\nto arc or spark. The C-supplies deliver up to 60 kV.\nThe pulse amplitude can be increased through a transmission line transformer\n(TLT) as shown in Fig. 1(b). In a TLT several coaxial cables are connected in series or\nin parallel at the input or the output side in such a way that either voltage or current\nis multiplied. A TLT can also be used as impedance matching network between the\npower source and the corona discharge reactor [44]. The second advantage is that the\npulse width and the decay time are very short. This system is further referred to as\nTLT-supply, it was thoroughly described in [32] as well. Its main characteristics are also\nlisted in table 1; the voltage rise time is 25 ns, and the pulse duration is 50 ns. The\nvoltage range is 30 to 60 kV.\nThe third supply charges and discharges using coaxial cables. This supply is called\n\n\fPositive and negative streamers in ambient air: measurements\n\n6\n\nthe Power Modulator (PM) supply and will be abbreviated as PM-supply, it is shown\nin Fig. 1(c). Its output pulses have the same characteristics as the TLT-supply. For\ncharging it uses a pulse forming line (PFL) which leads to a very high wall-plug efficiency\n(95%). The supply is discussed in more detail in [23, 45]. The rise time of the PMsupply is shorter than that of the TLT-supply, namely 15 ns, probably due to the lower\ninductance of the load; the pulse duration is 100 ns. This supply has a range from 40\nto 96 kV.\n2.2. Electrical measurements\nWith the C-supplies, the voltage is measured by a resistive-capacitive divider (Tektronix\nP6015 for C1 or Northstar PVM4 for C2 ) at the positions indicated in Fig. 2 of [35].\nThe current through the gap is measured with a Pearson current monitor (6585) for C1\nor via the voltage across a small series resistor Rs = 2.75Ω between cathode and ground\nfor C2 . The outer ring across the cathode ensures a well defined, low stray capacity and\ntherefore a fast rise time of the current measurement [46].\nWith the TLT-supply the voltage and current are measured with the Tektronix\nhigh voltage probe (P6015) and a Pearson current monitor (6585), respectively, at the\nlocations indicated in Fig. 1(b). For all three supplies the signals are digitized on an\noscilloscope using 0.2 ns sampling time (LeCroy Waverunner 6100A).\nThe PM-supply at the electrical engineering department uses a differentiatingintegrating system to measure the fast high amplitude voltage and current waveforms\n[47]. In this case a LeCroy Waverunner 2 is used which has the same sampling time.\nThe locations of the measurements are indicated in Fig. 1(c).\n2.3. Corona enclosure and electrodes\nMost measurements – actually those with the C-supplies and the TLT-supply at the\nphysics department – were carried out with the electrodes mounted in a large stainless\nsteel vessel as drawn in Fig. 2 of [35]. This vessel can be evacuated and filled with\ndifferent gases with pressures in the range of 0.013 to 1 bar, as thoroughly described in\n[35]. In the present paper, only measurements at standard temperature and pressure in\nambient air are presented, and a large window is taken off the sidewall to ensure the\nrefreshment of the air in the vessel. With the PM-supply at the electrical engineering\ndepartement, that generates voltages up to 96 kV, the streamers propagate in the open\nair without surrounding vacuum vessel. No significant differences were observed between\nstreamers in open air and in the stainless steel vessel when similar voltage pulses were\napplied.\nAll measurements presented in this paper are performed in a 40 mm gap with pointto-plane electrode geometry. We have selected this gap length because in longer gaps,\nthe streamers typically branch and consecutively form thinner and slower streamers [32],\nwhile in a 40 mm gap, their diameter and velocity is rather constant. In shorter gaps\nthe streamers don't have enough space to develop fully.\n\n\fPositive and negative streamers in ambient air: measurements\n\n7\n\nThe electrodes are as follows. The needle electrode is made from thoriated tungsten\nin C1 - and TLT-supply or from pure tungsten in C2 - and PM-supply. No differences\nin streamer pattern are observed between these two needles. The tip is spherical with\nradius ≈15 μm, a cone of height 2 mm connects the tip to a cylinder with radius\n0.5 mm; these shapes are not perfect, the surface has microscopic scratches from the\ngrinding process; even a dropped and misformed asymmetric needle does not create\nvisibly different discharge structures. Furthermore, for the C-supplies and the TLTsupply, the plate electrode is made from stainless steel, while for the PM-supply, it is\nfrom aluminum.\n2.4. CCD-cameras and image data evaluation\nAt the physics department, the discharges generated with the C-supplies and the\nTLT-supply are photographed with a 4QuikE intensified CCD camera from Stanford\nComputer Optics as described in [35]. The camera has 1360×1024 pixels and a minimal\nexposure time of 2 ns. In the wave length range of 200 - 800 nm, it has a quantum\nefficiency of ≈0.3 on average. Each pixel has 12 bit, and different gains can be chosen.\nThe discharges generated with the PM-supply in the electrical engineering department\nare photographed with a Princeton Instruments 576G/RB intensified CCD-camera as\ndescribed in [45]. It should be noted that if the initial streamer channels later evolve into\narcs, the intensifier of the cameras could be damaged even after exposure. Therefore a\ntransition into an arc is carefully avoided by keeping the voltage pulse sufficiently short.\nA number of pictures are shown in our articles. However, it must be noted that the\nactual pictures depend on the chosen representation of the raw data; this is demonstrated\nin panels a and b of Fig. A2 of [35]. An example of the actual data together with a\npicture is shown in Fig. 5 of [32]; profile bars of the real data along two sections through\nthe image are shown on the margin. Streamer diameters are evaluated as the full width\nat half maximum (FWHM) from this original data. The further evaluation procedure\nis described in section 3.4.\n3. Measurements and results\n3.1. Streamer structures as function of voltage and polarity - an overview\nAs a first overview, Figure 2 shows representative pictures of the discharges as a function\nof voltage and polarity. The panels show the complete streamer evolution in a 40\nmm point-plane gap in air at 1 bar, i.e., with a sufficiently long exposure time of the\nphotograph. In panels a and b, the slow C2 -supply with the long pulse duration is\nused together with the equipment at the physics department. No secondary streamers\nor return strokes appear after the primary streamers at voltages as low as 20 kV,\nand the panels just show the primary discharge. In panels c to f, the PM-supply\nwith a voltage pulse duration of 100 ns is used together with the equipment at the\nelectrical engineering department; the images show the streamers during the complete\n\n\fPositive and negative streamers in ambient air: measurements\n\n8\n\nFigure 2. Time integrated photographs of positive (left column) and negative (right\ncolumn) streamers in a 40 mm gap in air at 1 bar. The applied voltages are indicated in\nthe upper right corner of each panel, they are ≈ ±20 kV in the upper row, ≈ ±46 kV in\nthe middle row, and ≈ ±80 kV in the lower row. The discharges in panels a and b were\nmade with the C2 -supply at the physics department, and those in panels c - f with the\nPM-supply at the electrical engineering department; therefore different cameras etc.\nwere used. The white dotted lines indicate the position of the plate electrode below\nand the height of the needle electrode tip above.\n\n\f9\n\nPositive and negative streamers in ambient air: measurements\n\n40\n\nC\n\n2\n\n40\n\nneg\n\nPM neg\nC\n\npos, day 1\n\nC\n\npos, day 2\n\nC\n\npos\n\nstreamer channel length (mm)\n\n2\n\n2\n\n30\n\n1\n\n30\n\n20\n\n20\n\n10\n\n10\n\n0\n\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\n0\n\npulse amplitude (kV)\n\nFigure 3. Maximal streamer channel length as a function of voltage and polarity. The\nlengths are limited by the distance between electrodes which is 40 mm. The longest\nstreamers in each image are evaluated, they typically move straight downward. Power\nsupplies C1 , C2 or PM are used as indicated in the figure. For positive streamers\ncreated by the C2 -supply, the data for two different measurement days are shown,\nthey indicate a typical variation between days. Discharges below an extension of 10\nmm are mostly cloud shaped and will not be called streamers.\n\npulse duration. Streamers similar to those in panels c and d have also been generated\nwith the C1 - or the C2 -supply in the physics department; in particular, the temporal\nevolution of positive discharges similar to panel c are described in detail in [32]. The\ninitial evolution of negative streamers similar to panel d is shown in Fig. 4 below. The\nwhite dotted lines indicate the approximate position of the plate electrode below and\nthe height of the needle electrode tip above. It can be seen that at high voltages,\nstreamers are emitted from the complete needle electrode, not only from its tip. Below\nthe electrode spots in panels c, e and f, mirror images can be seen; they are reflected\nfrom the planar electrode. The white lines do not precisely intersect with the foot points\nof all streamers as the camera slightly looks down onto the electrode and the discharge\nis a three-dimensional structure. This 3D structure can be resolved with stereographic\nimaging, for first results, we refer to [36].\nFigure 3 complements figure 2, it shows the maximal length of the streamer channels\nas a function of voltage and polarity. The figures illustrate our statement that there\nare two regimes with a smooth transition zone, a regime of voltages below 40 kV where\npositive and negative discharges can be clearly distinguished, and a regime above 60 kV\nwhere they are quite similar. This will now be elaborated in more detail.\n\n\fPositive and negative streamers in ambient air: measurements\n\n10\n\nBelow 40 kV, positive and negative discharges are remarkably different. Positive\ndischarges ignite above 5 kV, while negative discharges are only seen above 15 kV.\nWhen the voltage on the positive discharges increases from 5 to 20 kV, thin streamers\nof increasing lengths form that branch frequently (for a further characterization of\nbranching, we refer to [32, 35, 36]); their lengths as a function of voltage are shown in\nfigure 3. They bridge the gap above 20 kV as shown in figure 2a. At this same voltage,\nthe negative discharge only forms a small cloud around the tip and no streamer, as can\nbe seen in figure 2b§. Negative streamers form above 30 kV, but they are then still\ntoo short to determine their diameters. Whenever their diameter can be determined,\nthey are much thicker than the 0.2 mm diameter observed for the thinnest positive\nstreamers. Negative streamers bridge the complete 40 mm gap only at voltages above\n50 kV as shown in figure 3. Panels c and d in figure 2 show positive and negative\nstreamers at 46 kV where both are 1 to 2 mm thick but the negative ones do not reach\nthe plate electrode and hardly branch while the positive steamers cross the gap and\nform many branches. In both cases, the discharge emerges not only from the needle tip,\nbut also above it, most likely at sharp edges.\nAbove 60 kV, positive and negative streamers become increasingly more alike. The\nnegative streamers cross the electrode gap at 56 kV (figure 4). At voltages above 75\nkV, streamers of both polarities are 2 to 3 mm thick, bridge the gap and hardly branch.\nThe positive streamers still branch a little more than the negative ones (see panels e\nand f in figure 2).\nWe remark that figure 2f shows an overexposed streamer region in the middle of\nthe gap while the regions near the tip and near the plate are darker. The length of this\nregion increases with increasing voltage from 16 mm through 18 mm to 23 mm at 64\nkV, 75 kV and 82 kV, respectively. It arises after the primary streamers have bridged\nthe electrode gap (where \"primary streamer\" denotes the first group of streamers after\nthe voltage has been applied [48]). It is not known why this large region forms in the\nmiddle of the gap; usually such a region stretches out from the tip and is interpreted as\na secondary streamer or as a glow developing along the trails of the primary streamers\n(as in figure 2e). Striated or subdivided secondary streamers are also reported in [48],\nhowever, without photographs. The spots on the plate electrodes also appear after the\nstreamer has crossed the gap; the cathode spots appear more or less spherical, whereas\nanode spots are contracted at the plate but become broader and diffuser above the\nsurface; they continue into the streamer more gradually.\n3.2. Dependence on the voltage supply\nIt should be noted that the streamers in figure 2 are created with the C2 -supply at 20\nkV and with the PM-supply at higher voltages. For positive streamers at voltages of\nat least 30 kV, we have shown in [32] that the slow voltage rise time of the C2 -supply\n§ The positive streamers also start from a cloud [33, 35] although this cloud is not always visible,\nespecially at atmospheric pressure.\n\n\fPositive and negative streamers in ambient air: measurements\n\n11\n\ncreates thinner channels than the other supplies as the streamers start to propagate\nbefore the voltage has reached its maximal value; this observation is also confirmed in\nthe present measurements as demonstrated in panels b and c in figure 6; these panels\nshow positive streamer discharges at the same peak voltage of ≈40 kV, but for voltage\nrise times of 30 or 150 ns, respectively. However, at 20 kV positive streamers do not\nshow this supply dependence as the streamer inception seems to be sufficiently slow at\nsuch low voltages.\nOne might wonder whether a similar supply dependence holds for negative\nstreamers, but we have no evidence for it. Furthermore, one can speculate whether\nthe negative streamers in figure 2(d) do not cross the gap because the voltage pulse\nduration in the PM-supply is only 100 ns; if the streamer inception time would be\nseveral tens of nanoseconds, the remaining pulse duration could be insufficient to let\nthe streamers cross the gap. To test these hypotheses, we have plotted the measured\nlengths of negative streamers as a function voltage in figure 3. The streamers at 15 and\n20 kV are created with the C2 -supply, and for voltages of 30 kV and larger with the\nPM-supply. The figure shows that the data follow a smooth curve across the change of\nsupplies; this suggests that the negative streamers are more robust against changes of\nthe power supplies than the positive ones, and that the negative streamers in figure 2\nhave reached their maximal length during the 100 ns duration of the voltage pulse of\nthe PM-supply.\n3.3. Stability field\nA common hypothesis is that there is a stability field, i.e., a minimal field that the\nstreamer needs to propagate; this field would also be the characteristic field inside the\nstreamer [1, 49]. This hypothesis is guided by the empirical observation, that the ratio\nof applied voltage over maximal streamer length is approximately constant for a given\ngas and polarity; this ratio has the dimension of an electric field. (The role of some\nhypothetical average background field is discussed in the introduction.) For positive\nstreamers in point-plane and plane-plane gaps in air, a value of 4.4 to 5 kV/cm is fitted\nto experiments in [1, 49] and references therein. The data for positive streamers in\nfigure 3 is fitted by U/L = 6 ± 1 kV/cm, which is in agreement with the above values\nwithin the error bar. For negative streamers, typical field values in the literature are\na factor 2 or 3 higher [1, 37]. Such values can also be fitted to our data for negative\nstreamer in figure 3; however, it should be noted that the length is certainly not a linear\nfunction of the voltage in this curve, also because there are no negative streamers below\n40 kV, and that the approximation of a constant stability field for negative streamers is\nquestionable in view of this data.\n3.4. Streamer head diameters\nThe streamer head diameters are determined from iCCD-images such as in figure 4d; for\nthe evaluation of the raw data imaged in such figures, we refer to section 2.4. The full\n\n\f12\n\nPositive and negative streamers in ambient air: measurements\npoint\n\ndl\ndy\n\ndx\n\n40 mm\n\nplate\n\na\n\nb\n\nc\n\nd\n\ne\n\nFigure 4. Negative streamers at -56 kV generated with the PM-supply. The exposure\ntime of each picture is about 5 ns. The gate delay is (a) 4.4 ns, (b) 9.3 ns, (c) 14.3 ns,\n(d) 19.6 ns, (e) 28.8 ns. The white lines indicate the position of the electrodes as in\nFig. 2. The light at the bottom of figure (e) is a reflection of the streamer light on the\nanode plate. How velocities are determined from such data, is described in Section 3.5.\n\nwidth dx at half maximum (FWHM) is measured and averaged over the dy-direction\nfor as long as the streamer channel is straight to suppress the stochastic single photon\nfluctuations within the pixels of the camera. The same definition of the diameter was\nalso used in [32, 33, 35]. Only single in-focus streamers at a place without return\nstroke or electrode effects are evaluated, typically in the middle of the electrode gap.\nDepending on voltage and polarity, typically three to ten streamers per photograph were\nevaluated, and the diameters were furthermore averaged over three to five photographs\nper voltage. In the measurements with the PM-supply, secondary streamers can appear\nafter the primary streamers have crossed the gap, and occasionally secondary streamers\nare evaluated instead of primary streamers when there are not sufficiently many suitable\nprimary streamer channels. However, primary or secondary streamer diameter show no\nsignificant difference with the PM-supply with its high voltages, as also reported in\n[27, 28].\nThe diameters of positive and negative streamers as a function of applied voltage\nare shown in figure 5. The different power supplies and polarities are indicated with\nsymbols. The measurements of positive streamers with supplies C1 , TLT and PM\ntogether span a continuous curve within the error bars, consistently with what we found\nin [32]. The positive streamers created with the C2 -supply remain thin when the peak\nvoltage increases, as is illustrated in panel b of figure 6; this is also consistent with [32].\nIn this case, the streamers already start to propagate while the voltage is still below its\nsaturation value; furthermore their current is limited by the large series resistance R3 .\nFor negative streamers, diameters are only measured for experiments performed with\nthe PM-supply.\nPositive streamers ignite above 5 kV. As shown in figure 5, their diameter then is\n\n\f13\n\nPositive and negative streamers in ambient air: measurements\n4\n\n4\nPM neg\nPM pos\nTLT pos\n\n3\n\nC\n\ndiameter (mm)\n\nC\n\n1\n\n2\n\n3\n\npos\n\nD\n\npos\n\n2\n\n2\n\nC\n\n1\n\nA\n0\n\n0\n\n10\n\n1\n\nB\n20\n\n30\n\n40\n\n50\n\n60\n\n70\n\n80\n\n90\n\n0\n100\n\nvoltage (kV)\n\nFigure 5. Diameters of positive and negative streamers as a function of applied\nvoltage. The symbols indicate the different voltage supplies and polarities. The letters\nA, B, C, and D indicate where photographs of positive streamers are included; they\nare shown in panels a, b, and c of figure 6 for A, B and C, and in figure 2e for D.\n\nFigure 6. Typical photographs of positive streamers for parameter values indicated\nby A, B, C in figure 5. Panels a and b are made with the slow C2 -supply, panel c with\nthe fast C1 -supply. The maximal voltage is a) +10 kV, b) +41 kV, and c) +40 kV. The\nwhite dotted lines indicate the electrode positions as in Figs. 2 and 4. The streamers\nin panel a at 10 kV have reached their maximal length; the streamers in panels b and\nc at ≈40 kV are still propagating. Panels b and c demonstrate how strongly positive\nstreamers at a voltage saturation value of 40 kV depend on the voltage rise time of the\nsupply, as discussed in [32].\n\n0.2 mm, i.e., the minimal diameter [32, 35]. For 20 kV, their diameter is 0.4 mm, and\nthe streamers bridge the 40 mm gap for the first time. Then the diameter increases\nby a factor of 10 (i.e., from 0.2 to 2 mm) when the applied voltage increases only by\na factor of ≈2 (from 25 to 55 kV). Above 55 kV, the diameter continues to increase,\nbut less rapidly; it reaches 3 mm at 96 kV. Whether for higher voltages, the diameter\ncan become even higher, or whether it saturates eventually, is an open question. We\nobserved that at very high voltages, e.g. at +82 kV in figure 8a, the voltage rise time\nof the PM-supply again becomes comparable to the streamer inception time as the\n\n\f14\n\nPositive and negative streamers in ambient air: measurements\n5\n\n5\n\nneg. PM\n\n5\n\npos. PM\n\npos. TLT\npos. C\n\npos. C\nvelocity (mm/ns)\n\n4\n\npos. C\n\n3\n\n2\n\n2\n\n1\n\n0\n10\n\npos. C\n\n2\n\n3\n\n0\n\npos. TLT\n\n4\n\n1\n\n20\n\n30\n\n40\n\n50\n\n60\n\nvoltage (kV)\n\na)\n\n70\n\n80\n\n90\n\nvelocity (mm/ns)\n\n4\n\n5\n\nneg. PM\n\npos. PM\n\n3\n\n4\n\n1\n\n2\n\nv = 0.5 d\n\n2\n\n-1\n\n-1\n\n3\n\nmm ns\n\n2\n\n2\n\n1\n\n1\n\n1\n\n0\n\n0\n\n100\n\n0\n0\n\n1\n\n2\n\n3\n\n4\n\ndiameter (mm)\n\nb)\n\nFigure 7. a) Velocity of positive and negative streamers in air at standard temperature\nand pressure as a function of voltage in a 4 cm gap. b) Velocity plotted as function of\ndiameter. The line indicates a fit with v = 0.5 d2 /(mm ns).\n\ninception time decreases with increasing voltage; this entails that at high voltages the\nstreamers start before the voltage has saturated. This is also observed in [28] with the\nsame PM-supply at +74 kV, while it is not observed at -72 kV, in agreement with the\ndiscussion in Section 3.2.\nThe negative discharge becomes visible at 15 kV, but does not yet form streamers.\nThe diameter of the negative streamers can be measured at voltages of 40 kV or higher.\nFor 40 kV the diameter is 1.2 mm. The negative streamers bridge the gap for the first\ntime at ≈ 56 kV (figure 4) with a diameter of 1.5 mm. Their diameter increases with\napplied voltage to ≈2.3 mm for voltages between 76 and 82 kV. On average, the positive\nstreamers are about 10% thicker than the negative ones, but this difference is within\nthe error margins.\n3.5. Streamer velocities\nIn the experiments at the physics department with the C-supplies and the TLT-supply,\nthe light trace on the photographs can be interpreted as the path that the streamer\nhead has followed during the exposure time of the camera [50]; therefore the streamer\nvelocities are measured as the full width at half maximum (FWHM) of the length dy in\nthe propagation direction, divided by the exposure time ∆t of the camera; the procedure\nis illustrated in figure 4. To minimize the error, sufficiently long exposure times are used\nsuch that the streamer head crosses 1/4th to 1/8th of the electrode gap; these times are\n10 to 100 ns; the method is further described in [35]. The velocities are evaluated at\nsome distance from the electrodes; typically three to ten streamers per photograph and\nthree to five photographs per voltage are evaluated. In the presently investigated 40\nmm gap, the streamer velocity and diameter are approximately constant. In contrast,\nin the case of a 160 mm electrode gap the streamer velocity does depend on the position\n\n\fPositive and negative streamers in ambient air: measurements\n\n15\n\nand diminishes after branching [35].\nIn the experiments at the electrical engineering department with the PM-supply,\nthe velocities are measured as the propagation distance between photographs (dl in\nfigure 4a,b) divided by the difference in delay time T of the photographs, where\neach photograph is taken during a different discharge pulse. The streamers that have\npropagated furthest are evaluated in each picture, they predominantly move straight\ndownward. This method can be used since the jitter in streamer inception at high\nvoltages is as small as about 1 ns [23, 27]. Five to ten photographs with different delays\n(e.g., the five pictures in figure 4) are taken per voltage, depending on the gap transit\ntime of the streamer. Position is plotted as a function of time for each photograph\nand an average velocity is determined graphically. One or two propagation sequences\nper voltage are evaluated. Only the fastest streamers are used since they propagate\nmost parallel to the camera's focal plane. Again the velocity is found to be constant\nthroughout the gap [23, 27].\nWe remark that the ambiguity of the two-dimensional images of the threedimensional discharge can lead to an underestimation of the velocities that is\ncounteracted by evaluating only the fastest streamers. Velocity measurements with\nthe stereographic imaging method introduced in [36] are currently under way.\nFigure 7a shows the resulting velocities of positive and negative streamers as a\nfunction of voltage. The velocities of streamers of both polarities increase almost linearly\nwith voltage. Velocities of negative streamers at voltages lower than 56 kV could not be\nmeasured because the streamers did not propagate far enough to measure them reliably.\nNote that the velocity of positive streamers increases rapidly in this range, from 0.2\nmm/ns at 20 kV to ≈ 1.5 mm/ns at 56 kV. Figure 7a shows that the negative streamers\nare about 25% slower than the positive ones when their velocities can be measured.\n3.6. An empirical relation between diameter and velocity\nIn figure 7b the velocity is plotted as a function of the diameter; the data is extracted\nfrom figures 5 and 7a. The figure shows that the velocity v increases with increasing\ndiameter d; it can be fitted quite well by the empirical equation v = 0.5 d2 /(mm ns)\nwhere v and d are measured in their natural units. The approximation also works well for\nstreamers of intermediate radius as measured in [23, 27, 28]. However, streamers with a\nminimal diameter of about 0.2 mm [32, 35] are a factor 5 too slow in this approximation.\nThe velocities of the thin streamers with diameters less than 0.5 mm in [30, 51, 17] are\nalso underestimated by a factor of about 4.\n3.7. Current and energy\nA typical evolution of current and voltage for positive and negative streamers with the\nPM-supply is shown in Fig. 8, the generated discharges are shown in panels e and f of\nFig. 2. The voltage pulse reaches approximately ±80 kV and lasts for about 100 ns.\nWhile the voltage U rises, it creates a capacitive current Icapacitive = Cgeom dU/dt in the\n\n\f16\n\nPositive and negative streamers in ambient air: measurements\n80\n\n100\nvoltage\n\n0\n\n60\n\n80\n\n80\n\n40\n60\n\nprimary\n\nt\n\nsecondary\n\n0\n\n20\n\n-20\n\n0\n-40\n-20\n\ncurrent\n-40\n\n-60\n\n-60\n\ncapacitive\n\nvoltage\n\n0\n\ncurrents\n\n-40\n\nCurrent (A)\n\n40\n\n20\n\nt\n\n-20\n\n20\n\ncurrent\n\n40\n\nVoltage (kV)\n\nCurrent (A)\n\ndischarge\n\n-80\n-50\n\n0\n\nt=11\n\nt=23\n\n50\n\nt=85\n\n100\n\nTime (ns)\n\n150\n\n200\n\n-80\n\n-100\n-50\n\n0\n\n50\n\n100\n\n150\n\n200\n\nTime (ns)\n\na)\n\nb)\n\nFigure 8. Evolution of current and voltage for ≈ 82 kV for a) positive and b) negative\nstreamers generated with the PM-supply. The generated discharges are shown in\npanels e and f of fig. 2. The current and voltage lines are smoothed by averaging\nover 5 adjacent points. In panel a, characteristic times and capacitive versus discharge\ncurrents are indicated, as discussed in the text.\n\ncircuit; Cgeom is the capacitance of the discharge vessel in the absence of a discharge.\nThe capacitive currents are indicated in panel a of Fig. 8. After approximately 11 ns\n(as indicated in the figure), the current is mainly the discharge current; its maximum is\napproximately 45 A for both polarities. The positive discharge current remains at this\nlevel for the duration of the voltage pulse (a plateau of duration ≈80 ns); the oscillations\nare due to imperfect matching with the external circuit. The negative discharge current\ndoes not have this plateau but slowly decreases to 10 A before the voltage pulse drops\nback to zero.\nEstimates for the dissipated energies within the complete discharge are shown in\nfigure 9; they are calculated by integrating the product of voltage and current over time,\nafter the capacitive part of the total current is subtracted [30]. The total energy of the\ndischarge is calculated by integrating to 200 ns when the voltage pulse certainly has\nfinished.\nFig. 4 illustrates that the first group of streamers, the so-called primary\nstreamers [48], cross the gap within 27 ns for −56 kV. This gap crossing time varies\nfrom 80 ns for 30 kV to 10 ns for 96 kV for positive streamers, and from 27 ns for 56\nkV to 15 ns for 83 kV for negative ones. At a later time, secondary processes occur\nas described elsewhere, see e.g. [23, 28, 32]. The energy of the primary streamers is\ncalculated by integrating from 11 ns (when the total current becomes larger than the\ncapacitive current, i.e., when the particle current begins to flow) to the time when\nthe primary streamers have bridged the gap. This arrival time is estimated from the\nstreamer velocity according to section 3.5. For 82 kV, it is 12 ns, therefore duration\nof the primary streamers tprimary is assumed to last from t = 11 ns to t = 23 ns, as\n\nVoltage (kV)\n\n60\n\n\f17\n\nPositive and negative streamers in ambient air: measurements\n600\n\n600\n\nE total, pos.\nE total, neg.\n\n500\n\n500\n\nE prim. pos.\n\nenergy (mJ)\n\nE prim. neg.\n\n400\n\n400\n\n300\n\n300\n\n200\n\n200\n\n100\n\n100\n0\n\n0\n30\n\n40\n\n50\n\n60\n\n70\n\n80\n\n90\n\n100\n\nvoltage (kV)\n\nFigure 9. Dissipated energy of the total discharge and of the primary positive and\nnegative streamers only as a function of voltage. The PM-supply was used.\n\nindicated in panel a of Fig. 8.\nFigure 9 shows that the total energy of positive discharges is higher than for negative\ndischarges. This is because the current persists longer in the positive discharge while\nit decreases for the negative ones (figure 8). The energy of the primary streamers is\nalso shown in figure 9. Though these values must be regarded as an estimate, the data\nare similar for positive and negative streamers. These energies are never higher than 50\nmJ and thus are considerably lower than the total energy which is maximally 400 mJ\nfor a positive discharge and 220 mJ for a negative one at 90 kV. Our observation that\npositive and negative streamers have similar energies, is consistent with [23, 27, 28].\n4. Summary and conclusions\nOur measurements indicate that the inception and propagation processes of positive\nand negative streamers in ambient air are quite different. Positive streamers emerge\nwhen a voltage of at least 5 kV is applied to a needle electrode at 4 cm distance from a\nplanar grounded electrode, while negative streamers only propagate above 40 kV (which\nis around the DC-breakdown voltage of the gap). Two regimes have to be distinguished.\n1) 5 kV < U < 40 kV: Positive streamers propagate. Their diameters increase from\n0.2 mm at 5 kV to 1 mm at 40 kV, they bridge the complete electrode gap above\n20 kV and they branch. Their velocity ranges from 105 m/s at 5 kV to 106 m/s at\n40 kV. A negative discharge is only visible above 20 kV as a glowing cloud near the\nelectrode tip; no negative streamers are formed.\n2) U > 40 kV: Negative streamers appear, but they do not cross the gap for voltage\nbelow 56 kV. Positive and negative streamers have a similar diameter of 1 mm at\n\n\fPositive and negative streamers in ambient air: measurements\n\n18\n\n40 kV that increases up to 3 mm for 96 kV. The positive streamer velocity increases\nfrom 106 m/s at 40 kV to 4 * 106 m/s at 96 kV. The velocity of negative streamers\ncan only be measured for voltages higher than 56 kV which is then about 25% lower\nthan for positive ones. The energy of the primary positive and negative streamers\nare similar; it ranges from 20 to 50 mJ for voltages from 74 to 90 kV.\nWe also find the completely empirical fit v = 0.5d2 /(mm ns) for the relation between\nvelocity v and diameter d of positive and negative streamers.\nAs a counterpart to the present experimental investigation of streamers of both\npolarities, a theoretical investigation is presented in [41]. In that paper, the low\nvoltage regime is investigated, and a strong asymmetry between short positive and\nnegative streamers is found, in agreement with the present experiments. In particular,\npositive simulation streamers next to needle electrodes easily evolve out of some initial\nionization seed; they have small diameters comparable to experiments and a strong field\nenhancement at the streamer tip; this field enhancement allows them to propagate into\nthe regions with lower background fields further away from the needle electrode. In\nthese simulations, we find approximately the same empirical relation between velocity\nand diameter for short positive streamers as in panel b of Fig. 7. On the other hand,\nnegative simulation streamers evolve as well out of some initial ionization seed in the\nhigh field region next to the electrode needle; but then their diameter increases when\npenetrating the regions with lower fields; therefore the field is less enhanced and they\neasily extinguish. We conclude that the simulations presented in [41] do allow to\nunderstand essential physical features of the low voltage regime of the experiments\npresented here.\nAcknowledgments\nThis work is financially supported by STW under contract number 06501 and by NWO\nunder contract number 047.016.017.\nReferences\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n\nRaizer Yu P 1991, Gas Discharge Physics, Berlin: Springer\nBazelyan E M, Raizer Yu P 1998, Spark Discharge (CRC Press, Boca Raton, Florida)\nWilliams E R 2006, Plasma Sources Sci. Technol. 15 S91\nWagner K H 1966, Z. Physik 189 465\nPhelps C T, and R F Griffiths 1976, J. Appl. Phys. 47, 2929-2934\nMarode E 1975, J. Appl. Phys. 46 2005-2015\nBastien F, and E Marode 1979, J. Phys. D: Appl. Phys. 12 249-263\nSpyrou N, and C Manassis 1989, J. Phys. D: Appl. Phys. 22 120-128\nTajalli H, D W Lamb, and G A Woolsey 1989, J. Phys. D: Appl. Phys. 22 1497-1503\nCreyghton Y L M 1994, Pulsed Positive Corona Discharges: Fundamental Study and Application\nto Flue Gas Treatment, PhD thesis, Eindhoven University of Technology, The Netherlands.\nAvailable on http://alexandria.tue.nl/extra3/proefschrift/PRF10A/9402886.pdf\n[11] Allen N L, and A Ghaffar 1995, J. Phys. D: Appl. Phys. 28 331\n\n\fPositive and negative streamers in ambient air: measurements\n\n19\n\n[12] Alexandrov N L, and E M Bazelyan 1996, J. Phys. D: Appl. Phys. 29 2873\n[13] Pancheshnyi S, S Sobakin, S Starikovskaia, and A Starikovskii 2000, Plasma Physics Reports 26\n1054-1065\n[14] Pancheshnyi S, S M Starikovskaia, and A Y Starikovskii 2001, J. Phys. D: Appl. Phys. 34 105-115\n[15] Pancheshnyi S and A Starikovskii 2003, J. Phys. D: Appl. Phys. 36 2683-2691\n[16] Pancheshnyi S and A Starikovskii 2004, Plasma Sources Sci. Technol. 13 B1-B5\n[17] Pancheshnyi S, M Nudnova, and A Starikovskii 2005, Phys. Rev. E 71 016407\n[18] Pancheshnyi S 2005, Plasma Sources Sci. Techn. 14 645-653\n[19] Ono R, and Oda T 2003, J. Phys. D: Appl. Phys. 36 1952-1958\n[20] Ono R, and Oda T 2005, J. Phys. D: Appl. Phys. 37 730-735\n[21] Ono R, and Oda T 2008, J. Phys. D: Appl. Phys. 41 035204\n[22] van Veldhuizen E M (ed.) 2000, Electrical Discharges for Environmental Purposes: Fundamentals\nand Applications, Huntington: Nova Science Publishers\n[23] Winands G J J 2007, Efficient streamer plasma generation, PhD thesis, Eindhoven University of\nTechnology, The Netherlands. Available on http://alexandria.tue.nl/extra2/200710708.pdf\n[24] van Heesch E J M, G J J Winands, and A J M Pemen, Evaluation of pulsed streamer corona\nexperiments to determine the O∗ radical yield, submitted to J. Phys. D: Appl. Phys. , cluster\nissue on \"Streamers, Sprites and Lightning\"\n[25] Blom P P M, Smit C, Lemmens R H P and van Heesch E J M 1994, Combined optical and electrical\nmeasurements on pulsed corona discharges Gaseous Dielectrics, vol VII, ed: Christophorou L G\nand James D R (New York: Plenum)\n[26] Blom P P M 1994, High-Power Pulsed Corona, PhD thesis, Eindhoven University of Technology,\nThe Netherlands. Available on http://alexandria.tue.nl/extra1/PRF14A/9702338.pdf\n[27] Winands G J J, Liu Z, van Heesch E J M, Pemen A J M and Yan K 2008, ADS and CDS streamer\ngeneration as function of pulse parameters, IEEE Trans. Plasma Sci. [to appear]\n[28] Winands G J J, Liu Z, Pemen A J M, van Heesch E J M, Yan K, Analysis of streamer properties in\nair as function of pulse and reactor parameters by ICCD photography, J. Phys. D: Appl. Phys.\n[accepted for special issue on \"Streamers, Sprites and Lightning\"]\n[29] Yi W J and Williams P F 2002, J. Phys. D: Appl. Phys. 35 205\n[30] van Veldhuizen E M and Rutgers W R 2002, J. Phys. D: Appl. Phys. 35 2169\n[31] Briels T M P, van Veldhuizen E M and Ebert U 2004, Experiments on propagating and\nbranching streamers in air, proceedings XV Int. Conf. on Gas Discharges and Applications http://gd2004.ups.tlse.fr , available through http://homepages.cwi.nl/∼ebert/GD2004Corona.pdf\n[32] Briels T M P, Kos J, van Veldhuizen E M and Ebert U 2006, J. Phys. D: Appl. Phys. 39 5201\n[33] Briels T M P, van Veldhuizen E M and Ebert U 2008, Time resolved measurements of streamer\ninception in air, IEEE Trans. Plasma Sci. [in print]\n[34] Briels T M P, van Veldhuizen E M, Ebert U 2008, Positive sreamers in ambient air and a N2 :O2 mixture (99.8:0.2), IEEE Trans. Plasma Sci. [in print]\n[35] Briels T M P, van Veldhuizen E M and Ebert U 2008, Positive streamers in air and nitrogen\nof varying density: experiments on similarity laws, cluster issue on \"Streamers, Sprites and\nLightning\" in J. Phys. D: Appl. Phys. [to appear] ArXiv.org e-prints: 0805.1364\n[36] Nijdam S, Moerman J S, Briels T M P, van Veldhuizen E M, Ebert U 2008, Appl. Phys. Lett. 92\n101502\n[37] Babaeva N Y and Naidis G V 1997, IEEE Trans. Plasma Sci. 25 375\n[38] Liu N, Pasko V P 2004, J. Geophys. Res. 109 A04301\n[39] Luque A, Ebert U, Montijn C, Hundsdorfer W 2007, Appl. Phys. Lett. 90, 1501\n[40] Luque A, Ebert U, Hundsdorfer W 2007, ArXiv.org e-prints: 0712.2774.\n[41] Luque A, Ratushnaya V, Ebert U 2008, Positive and negative streamers in ambient air: modeling\nevolution and velocities, revised for the cluster issue on \"Streamers, Sprites and Lightning\" in\nJ. Phys. D: Appl. Phys. , ArXiv.org e-prints: 0804.3539\n\n\fPositive and negative streamers in ambient air: measurements\n\n20\n\n[42] Winands G J J, Liu Z, Pemen A J M, van Heesch E J M, and Yan K 2005, Rev. Sci. Instrum. 76\n085107\n[43] Liu Z, Yan K, Winands G J J, Pemen A J M, van Heesch E J M, and Pawelek D B 2006, Rev.\nSci. Instrum. 77 073501\n[44] Yan K 2001 Corona plasma generation PhD Thesis Technische Universiteit Eindhoven, available\nthrough http://alexandria.tue.nl/extra2/200142096.pdf\n[45] Winands G J J, Liu Z, Pemen A J M, van Heesch E J M, Yan K and van Veldhuizen E M 2006,\nJ. Phys. D: Appl. Phys. 39 3010-3017\n[46] Gravendeel B 1987, Negative corona discharges:\nA fundamental study, PhD thesis, Eindhoven University of Technology, The Netherlands. Available through\nhttp://alexandria.tue.nl/extra3/proefschrift/PRF5A/8612916.pdf .\n[47] van Houten M A, Electromagnetic compatibility in high voltage engineering, Ph.D. thesis,\nEindhoven University of Technology, the Netherlands (1990). Available on www.tue.nl/bib.\n[48] Sigmond R S 1984, J. Appl. Phys. 56 1355\n[49] Allen N L and Ghaffar A 1995, J. Phys. D: Appl. Phys. 28 331\n[50] Ebert U, Montijn C, Briels T M P, Hundsdorfer W, Meulenbroek B, Rocco A and van Veldhuizen\nE M 2006, Plasma Sources Sci. Technol. 15 S118\n[51] van Veldhuizen E M and Rutgers W R, J. Phys. D: Appl. Phys. 36 (2003) 2692.\n\n\f"}