{"id": "http://arxiv.org/abs/1204.2962v2", "guidislink": true, "updated": "2012-05-07T11:30:39Z", "updated_parsed": [2012, 5, 7, 11, 30, 39, 0, 128, 0], "published": "2012-04-13T11:53:43Z", "published_parsed": [2012, 4, 13, 11, 53, 43, 4, 104, 0], "title": "Synthesis dependent characteristics of Sr1-xMnxTiO3 (x=0.03, 0.05, 0.07\n  and 0.09)", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1204.6409%2C1204.6645%2C1204.5691%2C1204.0924%2C1204.6125%2C1204.0975%2C1204.6698%2C1204.3667%2C1204.3282%2C1204.5062%2C1204.1296%2C1204.1397%2C1204.3893%2C1204.5769%2C1204.3982%2C1204.5450%2C1204.5548%2C1204.5323%2C1204.4945%2C1204.0270%2C1204.6159%2C1204.4045%2C1204.0717%2C1204.6462%2C1204.1421%2C1204.4961%2C1204.2962%2C1204.3897%2C1204.0091%2C1204.0956%2C1204.0807%2C1204.1400%2C1204.0523%2C1204.2902%2C1204.6445%2C1204.2893%2C1204.3340%2C1204.5928%2C1204.0871%2C1204.4335%2C1204.5298%2C1204.4214%2C1204.4379%2C1204.0254%2C1204.0986%2C1204.5468%2C1204.4058%2C1204.1091%2C1204.1748%2C1204.5869%2C1204.6306%2C1204.3664%2C1204.6258%2C1204.6395%2C1204.4916%2C1204.1957%2C1204.4483%2C1204.1682%2C1204.2808%2C1204.2743%2C1204.1799%2C1204.3768%2C1204.1960%2C1204.3995%2C1204.3781%2C1204.4259%2C1204.1210%2C1204.3750%2C1204.3816%2C1204.6738%2C1204.6472%2C1204.2948%2C1204.3076%2C1204.4260%2C1204.6092%2C1204.0971%2C1204.1787%2C1204.4779%2C1204.5670%2C1204.2731%2C1204.3437%2C1204.0677%2C1204.4776%2C1204.2815%2C1204.1629%2C1204.2618%2C1204.4966%2C1204.4973%2C1204.2220%2C1204.2003%2C1204.3862%2C1204.0543%2C1204.4649%2C1204.0817%2C1204.0556%2C1204.0197%2C1204.2356%2C1204.6610%2C1204.5186%2C1204.6313%2C1204.6380&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Synthesis dependent characteristics of Sr1-xMnxTiO3 (x=0.03, 0.05, 0.07\n  and 0.09)"}, "summary": "Sr1-xMnxTiO3 (where x = 0.03, 0.05, 0.07 and 0.09) was synthesized via\ndifferent routes that include solid-state, oxalate precipitation and freeze\ndrying. In oxalate precipitation technique, compositions corresponding to 3 and\n5 mol % doping of Mn were monophasic whereas the higher compositions revealed\nthe presence of the secondary phases such as MnO, Mn3O4 etc., as confirmed by\nhigh resolution X-ray diffraction (XRD) studies. The decomposition behavior of\nthe precursors prepared using oxalate precipitation method corresponding to the\nabove mentioned compositions was studied. Nanopowders of compositions\npertaining to 5 to 9 mol % of Mn doping were obtained using freeze-drying\ntechnique. The average crystallite size of these nanopowders was found to be in\nthe 35 to 65 nm range. The microstructural studies carried out on the sintered\nceramics, fabricated using powders synthesized by different routes established\nthe fine grained nature (< 1 microm) of the one obtained by freeze drying\nmethod. Raman scattering studies were carried out in order to complement the\nobservations made from XRD regarding the phase purity. The dielectric\nproperties of the ceramics obtained by different synthesis routes were studied\nin the 80 - 300 K temperature range at 100 kHz and the effect of grain size has\nbeen discussed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1204.6409%2C1204.6645%2C1204.5691%2C1204.0924%2C1204.6125%2C1204.0975%2C1204.6698%2C1204.3667%2C1204.3282%2C1204.5062%2C1204.1296%2C1204.1397%2C1204.3893%2C1204.5769%2C1204.3982%2C1204.5450%2C1204.5548%2C1204.5323%2C1204.4945%2C1204.0270%2C1204.6159%2C1204.4045%2C1204.0717%2C1204.6462%2C1204.1421%2C1204.4961%2C1204.2962%2C1204.3897%2C1204.0091%2C1204.0956%2C1204.0807%2C1204.1400%2C1204.0523%2C1204.2902%2C1204.6445%2C1204.2893%2C1204.3340%2C1204.5928%2C1204.0871%2C1204.4335%2C1204.5298%2C1204.4214%2C1204.4379%2C1204.0254%2C1204.0986%2C1204.5468%2C1204.4058%2C1204.1091%2C1204.1748%2C1204.5869%2C1204.6306%2C1204.3664%2C1204.6258%2C1204.6395%2C1204.4916%2C1204.1957%2C1204.4483%2C1204.1682%2C1204.2808%2C1204.2743%2C1204.1799%2C1204.3768%2C1204.1960%2C1204.3995%2C1204.3781%2C1204.4259%2C1204.1210%2C1204.3750%2C1204.3816%2C1204.6738%2C1204.6472%2C1204.2948%2C1204.3076%2C1204.4260%2C1204.6092%2C1204.0971%2C1204.1787%2C1204.4779%2C1204.5670%2C1204.2731%2C1204.3437%2C1204.0677%2C1204.4776%2C1204.2815%2C1204.1629%2C1204.2618%2C1204.4966%2C1204.4973%2C1204.2220%2C1204.2003%2C1204.3862%2C1204.0543%2C1204.4649%2C1204.0817%2C1204.0556%2C1204.0197%2C1204.2356%2C1204.6610%2C1204.5186%2C1204.6313%2C1204.6380&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Sr1-xMnxTiO3 (where x = 0.03, 0.05, 0.07 and 0.09) was synthesized via\ndifferent routes that include solid-state, oxalate precipitation and freeze\ndrying. In oxalate precipitation technique, compositions corresponding to 3 and\n5 mol % doping of Mn were monophasic whereas the higher compositions revealed\nthe presence of the secondary phases such as MnO, Mn3O4 etc., as confirmed by\nhigh resolution X-ray diffraction (XRD) studies. The decomposition behavior of\nthe precursors prepared using oxalate precipitation method corresponding to the\nabove mentioned compositions was studied. Nanopowders of compositions\npertaining to 5 to 9 mol % of Mn doping were obtained using freeze-drying\ntechnique. The average crystallite size of these nanopowders was found to be in\nthe 35 to 65 nm range. The microstructural studies carried out on the sintered\nceramics, fabricated using powders synthesized by different routes established\nthe fine grained nature (< 1 microm) of the one obtained by freeze drying\nmethod. Raman scattering studies were carried out in order to complement the\nobservations made from XRD regarding the phase purity. The dielectric\nproperties of the ceramics obtained by different synthesis routes were studied\nin the 80 - 300 K temperature range at 100 kHz and the effect of grain size has\nbeen discussed."}, "authors": ["K. R. S. Preethi Meher", "C. Bogicevic", "Pierre-Eymeric Janolin", "K. B. R. Varma"], "author_detail": {"name": "K. B. R. Varma"}, "author": "K. B. R. Varma", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.jssc.2012.04.013", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1204.2962v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1204.2962v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "38 pages, 4 tables, 13 figures", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1204.2962v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1204.2962v2", "journal_reference": null, "doi": "10.1016/j.jssc.2012.04.013", "fulltext": "Synthesis dependent characteristics of Sr1-xMnxTiO3 (x=0.03, 0.05, 0.07 and 0.09)\nK.R.S.Preethi Meher1, C. Bogicevic2, Pierre-Eymeric Janolin2 and K.B.R.Varma1*\n1\nMaterials Research Centre, Indian Institute of Science, Bangalore 560012\n2\nLaboratoire Structures, Proprietes et Modelisation des Solides, Ecole Centrale Paris,\nCNRS-UMR8580, Grande Voie des Vignes, 92295 Chatenay-Malabry Cedex, France\n*Corresponding author, Email: kbrvarma@mrc.iisc.ernet.in ;\nFax: 91-80-23600683 Tel No: 91-80-22932914\n\n1\n\n\fAbstract\nSr1-xMnxTiO3 (where x = 0.03, 0.05, 0.07 and 0.09) was synthesized via different routes\nthat include solid-state, oxalate precipitation and freeze drying. In oxalate precipitation\ntechnique, compositions corresponding to 3 and 5 mol % doping of Mn were monophasic\nwhereas the higher compositions revealed the presence of the secondary phases such as\nMnO, Mn3O4 etc., as confirmed by high resolution X-ray diffraction (XRD) studies. The\ndecomposition behavior of the precursors prepared using oxalate precipitation method\ncorresponding to the above mentioned compositions was studied. Nanopowders of\ncompositions pertaining to 5 to 9 mol % of Mn doping were obtained using freeze-drying\ntechnique. The average crystallite size of these nanopowders was found to be in the 35 to\n65 nm range. The microstructural studies carried out on the sintered ceramics, fabricated\nusing powders synthesized by different routes established the fine grained nature (< 1\nμm) of the one obtained by freeze drying method. Raman scattering studies were carried\nout in order to complement the observations made from XRD regarding the phase purity.\nThe dielectric properties of the ceramics obtained by different synthesis routes were\nstudied in the 80 – 300 K temperature range at 100 kHz and the effect of grain size has\nbeen discussed.\n\nKeywords: SrTiO3, chemical synthesis, Raman spectroscopy, dielectric constant\n\n2\n\n\f1. Introduction\nSrTiO3 (STO) ceramics were known for their promising applications in the design and\nfabrication of multilayer capacitors and varistors 1 while the thin films of STO have been\nstudied extensively for their possible use in microwave filters 2. Recently there has been\nrenewed interest concerning the study of the physical properties of STO with different\ncation doping (Mn, Fe, Cr, Co etc) in view of its importance for magnetoelectric effect\nbased applications. Shravatsman et al\n\n3\n\nreported that Sr0.98Mn0.02TiO3 behaves like a\n\ndipolar glass and a spin glass with their corresponding transitions lying around 38 K and\n34 K respectively, which has drawn the attention of many researchers. At this juncture, it\nis worth mentioning that Smolenskii 4 encountered with a dielectric anomaly in the 20-30\nK temperature range in STO. However this observation was in complete contrast with\nthat of of Hulm et al 5 where no such anomaly was observed for STO down to 1.3 K with\nthe dielectric constant values saturating at ~ 1300 below 4 K. This discrepancy was later\naddressed to by Smolenskii\n\n6\n\nand attributed it to the presence of impurities and the\n\nmethod via which the samples are synthesized. Later, low temperature dielectric\nmeasurements carried out on STO single crystals showing a rise in the dielectric constant\nvalues from 370 (at RT) to ~18000 (1.4 K) was reported by Weaver 7. Also, ferroelectric\nhysteresis loops were recorded for STO single crystals below 35 K indicating the\nswitching of spontaneous polarization though the observed values were as low as 1.5\nμC/cm2 at 1.4 K 7. In order to unravel this mystery, Smolenskii 8 carried out a systematic\ninvestigation into the influence of various levels of Bi-doping on the dielectric behavior\nof STO. This was followed by many similar studies\n\n9, 10\n\nwhich revealed the role of Bi\n\nsubstitution in inducing strong and multiple relaxation modes. Notable results were also\n\n3\n\n\fobtained for Ca doped STO where low temperature ferroelectric-like phase transitions\ncould be induced by random field interactions between Ca off-centered polar clusters\n\n11\n\n.\n\nThe effect of dopants and various oxygen partial pressures (maintained during the\nsynthesis) in altering the onset of phase transition temperatures in STO along with its\noverall dielectric behavior have become a topic of current interest 12-17.\nIndeed interesting magnetic characteristics such as spin glass behavior that was reported\nfor Sr0.98Mn0.02TiO3 has provided enough motivation for a systematic study on magnetic\nordering with various levels of Mn doping in STO\n\n18, 19\n\n. Keeping the observations and\n\ncontradictions in view, we felt that it was important to synthesize phase pure STO doped\nwith Mn. A survey of the earlier work demonstrates that SrTiO3 could be prepared by\nvarious physical and chemical routes that include conventional solid-state reaction route,\nchemical-coprecipitation method, sol-gel, hydrothermal and electrochemical\net al\n\n26\n\n20-25\n\n. Bera\n\nreported a simple technique for the formation of SrTiO3 where the strontium\n\noxalate is precipitated over the fine TiO2 particles (which facilitate seeding for\nheterogenous nucleation) followed by subsequent heat treatment at appropriate\ntemperatures. Apart from these methods, oxides which are prepared by freeze drying has\na reduced probability of the formation of secondary phase usually resulting from the\ninhomogeneity of the starting powders and also have better sinterability compared to that\nof the other methods. Many known complex oxides have been prepared using this method\nin which the resultant powders could be obtained in an amorphous state\n\n27\n\n. For the\n\npresent investigation, STO powders doped with different amounts of Mn were\nsynthesized by three different routes. We illustrate the details of the synthesis and\ncharacterization of Sr1-xMnxTiO3 (x= 3, 5, 7 and 9 mol % abbreviated as SMTO3,\n\n4\n\n\fSMTO5 SMTO7 and SMTO9 respectively) powders obtained via solid-state reaction\nroute, chemical co-precipitation of oxalates and freeze drying methods.\n2. Experimental procedure\n2.1 Solid-state reaction method\nThe polycrystalline powders of the composition SMTO3 were prepared by conventional\nsolid-state synthesis route as the current interest is to visualize the influence of higher\ncontents of Mn doping on the physical properties of SMTO. For this, SrCO3, MnO and\nTiO2 were mixed homogeneously by subjecting them to ball milling for 12 hours. The\nball milled powders were heated at 1073 K for several hours in order to ensure the\ndecomposition of carbonates and subsequently calcined at 1273 K for 5 h. Later the\ncalcined powders were pressed into pellets and sintered at 1623 K for 24 h ambient\natmospheres.\n2.2 Co-precipitation of oxalates\nThe starting precursors used for the synthesis were Strontium Chloride hexahydrate\n(SrCl2).6H2O\n\n(>99%\n\nassay\n\nfrom\n\nAldrich),\n\nManganous\n\nchloride\n\ntetrahydrate\n\n(MnCl2.4H2O) (> 99% assay from Merck) and TiO2 (<1 μm and >99% assay from\nMerck). An aqueous solution was obtained by dissolving stoichiometric amounts of\nSrCl2.6H2O and MnCl2.4H2O in deionized water. Subsequently the required TiO2 powder\n(such that Sr/Ti=1.0) was added to the aqueous solution under constant stirring. Vigorous\nstirring and ultrasonication of the solution was carried out to break the bigger TiO2\nagglomerates into fine particles in the solution. The required amount of oxalic acid\n(C2H2O4; Analytical Grade) to obtain 0.1 M standard solution was dissolved in water and\nthe solution was added drop by drop to the aqueous solution. This led to the precipitation\n\n5\n\n\fof Strontium and Manganous oxalate onto the fine TiO2 particles suspended in the\nsolution. The precipitate was washed with deionized water for several times until all the\nchlorides were removed and was recovered and dried in an electric oven maintained at\n423 K. The dried powders were collected from the beaker for further characterization.\nThe powders were subsequently calcined in air in the 1073 to 1373 K temperature range\nwith intermittent grinding to ensure homogenization. XRD studies were carried out on\nthe calcined powders in order to assess the desired phase formation. The procedure for\nsynthesizing SMTO powders using oxalate precipitate method is illustrated in the form of\na block diagram in Fig. 1.\n2.3. Freeze-drying method\nThe principle of freeze-drying method is based on the removal of water by sublimation of\nthe frozen solution containing the cations in the stoichiometric ratio. The factors that have\nto be taken care of during freeze drying are (a) chemical compatibility between the salts\nused in order to avoid precipitation after their dissolution and (b) determination of\nsolution freezing point, which depends on the type of solvent (such as water, alcohol etc)\nused for synthesis other than the molar concentration of the solute\n\n27\n\n. In order to\n\nsynthesize SMTO, Strontium acetate (Sr(C2H3O2)2.0.5H2O, > 99.5 % from Aldrich),\nTitanium isopropoxide (Ti{OCH(C4 )} >99.5 % from Aldrich) and Manganese acetate\n(Mn(CH3COO)2. 4 H2O , >99.5% from Aldrich) were used. Stoichiometric amounts of\nStrontium acetate and Manganese acetate were dissolved together in 200 ml of deionized\nwater. Titanium isopropoxide was poured into a beaker containing a mixture of isopropyl\nalcohol (C3H8O, 99.5 % from Prolabo) and acetic acid (99.8% from Prolabo) in 1:3\nvolumetric proportions to avoid hydrolysis. This solution was then added to that\n\n6\n\n\fcontaining the other two dissolved salts. The resulting solution was mixed thoroughly\nusing a magnetic stirrer and maintained at a temperature of 373 to 423 K. The clear\nboiling solution is then sprayed into a liquid nitrogen bath. The frozen mass was\nrecovered from the bath and dried on a plate kept inside a freeze-drier (ALPHA 2-4,\nChrist) under vaccum (3.5 Pa). Initially the temperature of the powder was maintained at\n253 K under a low vaccum for 24 h where the water is removed by sublimation and then\nthe temperature was gradually increased upto 343 K till the powders became devoid of\nmoisture. The fluffy recovered powders were then calcined in the 973 K to 1173 K\ntemperature range and the phase formation was investigated by XRD studies. The\nprocedure adopted to synthesize SMTO by freeze drying method has been presented in\nthe form of a block diagram in Fig. 2.\nThe powders that were obtained by both the above synthesis methods were isostatically\ncold-pressed upto 750 MPa and the compacted pellets were sintered in the temperature\nrange of 1473 to 1623 K. The density of the pellets, measured by employing Archimedes\nmethod, was in the range of 91-95 %.\n2.4 Characterization methods\nThe decomposition behavior of the precursor powder obtained from oxalate precipitation\nmethod was studied by subjecting it to differential thermal analysis (DTA) and Thermo\ngravitometric analysis (TGA, Thermofisher Scientific) at a heating rate of 10oC/min in air\nin the 323 to 1473 K temperature range. X-ray diffraction studies were carried out using\na high resolution diffractometer set in Bragg-Breneto geometry and operated with a\nrotating anode generator (Rigaku RU300 operated at 18 kW) using Cu Kα radiation\nalong with Siemens detector.\n\nScanning Electron Microscopy associated with\n\n7\n\n\fbackscattering mode and Energy dispersive X-ray analysis (EDAX) (SEM, Quanta\nESEM) of the above samples have been done in order to shed more light on their\nmicrostructure and local chemical composition. Raman measurements were carried out\nusing Micro-Raman spectrometer (LanRAM HR800, Horiba Jobin Yvon) with an Ar ion\nlaser excitation source (excitation wavelength of 514.5 nm) and the illuminated spot size\nwas kept at 0.5-0.7 μm. Dielectric measurements were carried out using Agilent 4210\nhigh precision impedence analyzer, on the cylindrical sintered pellets sputtered with gold\nelectrodes down to 80 K in the 100 Hz – 1 MHz frequency range at an applied voltage of\n0.5 V (Vr.m.s).\n3. Results and Discussion\n3.1 Structural, Microstructural and Thermal decomposition studies\nThe high resolution X-ray diffraction (HXRD) pattern of the powders derived from the\nbulk ceramics of SMTO3 (sintered at 1623 K for 12 h) obtained by solid-state reaction\nroute is shown in Fig. 3. The peaks were indexed based on the space group Pm-3m\nconfirming the formation of the cubic perovskite phase. However the extra peaks present\n(inset of Fig. 3) along with the peaks corresponding to the major phase could be indexed\nto Mn3O4. The amount of Mn3O4 was quantified to be roughly upto 0.5 % based on the\nXRD peak intensity ratio. In order to bring down the sintering temperatures which were\nthought to be linked up with phase purity, we directed our efforts to synthesize the\npresent compound with varied Mn contents (3 to 9 mol %) by oxalate precipitation\ntechnique.\nDTA and TGA traces obtained for the precursor powders of SMTO in the oxalate\nprecipitate method are depicted in Fig. 4. As this synthesis method involves the co-\n\n8\n\n\fprecipitation of the Strontium oxalate and Manganese oxalate on to the TiO2 powders, the\ndistinct thermal decomposition steps corresponding to each of these precursors could be\nobserved in TGA. The small weight loss initially observed at less than 373 K and the\ncorresponding endothermic peak in DTA curve is due to the removal of moisture from\nthe sample. The steps I and II involve a total weight loss of ∆m ~ 7 % and the two\ncorresponding endothermic peaks occurring in the temperature range of 373 – 473 K are\ndue to the removal of water molecules from Strontium oxalate (SrC2O4.H2O) and\nManganese oxalate (MnC2O4.2H2O). As the decomposition peaks of Manganese oxalate\noverlap with that of Strontium oxalate, only the total weight loss could be considered\nduring the analysis. The next weight loss step (step III) corresponding to the exothermic\npeak in DTA is due to the decomposition of Strontium oxalate and Manganese oxalate to\ntheir respective carbonates with the evolution of CO molecules\n\n28\n\n. The final weight loss\n\nstep (step IV) corresponding to the weak endothermic peak is due to the liberation of CO2\nand subsequently the residues i.e., respective oxides left back react with TiO2 resulting in\nthe formation of the desired phase. The general equations representing the above\nreactions and the respective ∆m are given below.\nStep I & II:\n\n473 K / endo\nSrC 2 O4 .H 2 O 373\n−\n → SrC 2 O4 + H 2 O\n473 K / endo\nMnC 2 O4 .2H 2 O 373\n−\n → MnC 2 O4 + 2H 2 O\n\nTotal ∆m~7.2 -8.3 %\n843 K\nSrC 2 O4 573\n−\n→ SrCO3 + CO\n843 K\nStep III: MnC 2 O4. 573\n−\n→ MnCO3 + CO\n2 / exo\nCO + 1 / 2O 2 O\n→ CO 2 ↑\n\nTotal ∆m~7.2 -8 %\n−1353 K / endo\nStep IV: ( 1 − x)SrCO3 + xMnCO3 + TiO 2 1123\n\n → Sr1− x Mn x TiO3 + CO2 ↑\n\n9\n\n\fTotal ∆m~10 – 11.2 %\nThe formation of phases, synthesized using the oxalate precipitate technique, was\nconfirmed later by high resolution X-ray diffraction technique. XRD powder patterns of\nthe sintered samples of SMTO are depicted in Fig. 5 (a-f). The XRD patterns of the first\ntwo compositions such as SMTO3 and SMTO5 confirmed the formation of a pure\nperovskite phase associated with the space group Pm-3m. However, symptoms of the\npresence of the secondary phases such as MnO and Mn3O4 were found for x > 5 mol. The\nX-ray peak positions reported in the literature 29, 30 for MnO and Mn3O4 have been given\nfor the purpose of comparison in Fig. 5(a) and 5(b) respectively. Fig.5(c-f) shows the\nhigh resolution XRD powder patterns obtained for sintered samples of SMTO3, SMTO5,\nSMTO7 and SMTO9 respectively. The high intensity peak of MnO at 2θ=40.54° is close\nto that of the extra peak (though not very evident in Fig. 5(e)) occurring in the XRD\npattern of SMTO7 case confirming its presence as a secondary phase (Fig. 5 (d)). In the\ncase of SMTO9 along with MnO and Mn3O4, TiO2 peaks (JCPDS No.118875) were also\nfound to be present. In order to have better illustration of the phase purity of SMTO3 and\nSMTO5 prepared using the oxalate precipitate method, their indexed XRD patterns have\nbeen plotted in logscale as shown in Fig 6 (a-b). In order to enhance the solid solubility\nlimit and to achieve mono phasic compounds devoid of impurities, it is essential to\ncontrol the homogeneity of the starting powders. One of the alternate synthesis methods\nto obtain homogeneous compositions was thought to be freeze drying. We have adopted\nthis method to synthesize STO doped with various levels of Mn.\n\n10\n\n\fThe amorphous nature of the as-synthesized powders obtained from freeze drying method\nis directly evident from recorded XRD pattern given in the inset of Fig. 7. The as\nsynthesized powders have been subjected to calcination and the XRD patterns recorded\nfor the calcined powders of SMTO5 ( 1073 K for 3 h), SMTO7 (1073 K for 3 h and\nSMTO9 (1103 K for 3 h) compositions are shown in Fig. 7(a-c)\nThe\nformula D=\n\ncrystallite\n0. 9λ\n\nsize\n\nwas\n\ncalculated\n\nusing\n\nthe\n\nwell\n\nknown\n\nScherrer\n\nβ cos θ , where D is the particle size, λ is the wavelength of the X-rays,\n\nβ is the full width at half maximum which is corrected for the instrumental error using a\nstandard sample of LaB6 and θ is the angle at which the diffraction peak occurs. The\ncrystallite sizes calculated using XRD data of calcined powders of STMO are listed in\nTable 1.\nThe calcined powders were sintered in order to obtain bulk ceramics suitable for further\ncharacterization. The sintering was carried out in the temperature range of 1073 K to\n1546 K. Detailed XRD studies of the STMO5, STMO7 and STMO9 ceramics sintered at\ndifferent temperatures have been carried out and the results obtained are shown in Fig\n8(a-c) respectively. Though traces of secondary phase corresponding to Mn3O4 was found\nto be present in both SMTO5 and SMTO7, the sintering temperatures could be optimized\nsuch that the bulk samples were devoid of any secondary phases as shown in the Figs.8(a)\nand (b). In the case of SMTO5, sample sintered at 1473 K was found to have Mn3O4 as\nan impurity phase. Interestingly, on increasing the sintering temperature up to 1523 K\nthere is a decrease in the content of Mn3O4. While in the case of SMTO7, the samples\nsintered at 1473 K was found to be monophasic with no detectable traces of Mn3O4 and\nwith increasing sintering temperature, the traces of Mn3O4 started appearing. In the case\n\n11\n\n\fof SMTO9, significant amount of secondary phases such as Mn3O4 and MnO were found\nto exist in the bulk samples in spite of annealing over a range of high temperatures. We\ndid not find significant changes in the formation of the impurity phases such as MnO and\nMn3O4 with a change in annealing time. Tkach et al\nxMnxTiO3\n\n31\n\nreported the XRD patterns of Sr1-\n\nwhere x=0.02, 0.03, 0.05, 0.1, 0.15 and 1 prepared by solid-state reaction route\n\nand reported the formation of MnTiO3 impurity phase for the compositions x ≥ 0.1. But\nin the present work, irrespective of the synthesis routes that were adopted, we always\nencountered with Mn3O4 as the impurity phase although MnO could also be found in the\ncase of SMTO9. In fact the Electron Paramagnetic Resonance (EPR) studies carried out\non Sr1-xMnxTiO3, where x is up to 3 mol %, by Badalyan et al\n\n32\n\nshowed that the\n\nformation of Manganese oxide nanoparticles was favored before the incorporation of Mn\ninto the STO lattice. In fact, the broader X-ray peaks corresponding to Mn3O4 corroborate\ntheir EPR studies.\nMicrostructural aspects of the sintered samples fabricated using both the oxalate\nprecipitate and freeze drying methods have been studied in detail. Fig. 9 (a to c) shows\nthe microstructures of the sintered samples of SMTO3, SMTO5 and SMTO7 prepared\nusing the oxalate precipitate method. The average grain size associated with these\nsamples is in the range of 1-2 μm. In the case of SMTO9, the grains of different\nmorphologies were found and a spot EDAX on them clearly indicate phase segregation of\na Ti rich secondary phase consistent with XRD data (inset of Fig.9 (d)). This is evident\nfrom the quantitative analysis of the elements present in the segregated and the major\nphase in SMTO9 as presented in Table 2. The homogeneity of the sample was also\nverified by carrying out EDAX analysis on the different regions of the sample. The\n\n12\n\n\fquantitative estimation of the elements in regions 1 and 2 has also been listed in Table 2.\nThe difference in the compositions of Mn in both the regions 1 and 2 is evident of the\ncomposition fluctuations present in these systems. The microstructures of the pellets\nfabricated using the powders obtained by freeze drying method was investigated using\nSEM. Fig. 10 (a and b) shows the high magnification images of SMTO5 and SMTO7\nrespectively. The observation of grains < 1 μm in size despite high synthesis\ntemperatures involved points towards obtaining fine grained ceramics in the case of\nfreeze-drying method as compared to that of the other methods. Fig. 10 (c) shows the\nmicrostructure of SMTO9 and the contrast in the corresponding back scattering image\n(given in Fig 10 (d)) clearly shows the presence of a secondary phase as envisaged in the\nXRD data.\n3.2 Micro-Raman spectroscopic studies\n\nMicro Raman studies carried out by earlier workers on the 0.1 at % of Mn doped STO at\nroom temperature facilitated the identification of the presence of secondary phases such\nas Mn3O4 and MnO2\n\n14\n\n. Pure STO has a cubic phase at room temperature (space group\n\nPm-3m) and therefore there could be no first-order Raman active modes except the\nsignature of second order scattering. However Rabuffetti et al reported first order modes\nin SrTiO3 nanocubes that arise from loss of crystal structure symmetry caused by surface\ndefects or impurities\n\n33\n\n. Therefore it might be interesting to investigate into the local\n\nstructure of SMTO by using a powerful tool like Raman scattering. Fig. 11 shows the\nmicro Raman spectra recorded for SMTO3, SMTO5, SMTO7 and SMTO9 compositions\nprepared by oxalate method. The overall spectra have mostly features from second order\nscattering similar to that of STO. The multiple phonon modes that give to rise to the\n\n13\n\n\fsecond order scattering in STO around room temperature have been clearly identified and\nlisted in the literature\n\n34-36\n\n. In the present work, the Raman spectra obtained for different\n\ncompositions of STMO (synthesized by oxalate method) were corrected for the\nbackground and the peaks in the range of 100 cm-1 to 900 cm-1 was fit with Lorentzian\nfunction. The exact peak positions (the ten different modes identified are marked with\nalphabets from A-I in Fig. 11) were obtained and tabulated in Table 3 for all the\ncompositions along with that of pure STO\n\n34\n\nfor comparison. Further, Raman spectra\n\nobtained for SMTO5, SMTO7 and SMTO9 compositions (as shown in Fig. 12)\nsynthesized using freeze drying method were also similarly analyzed and the peak\npositions have been listed in Table 3.\nRaman spectra corresponding to SMTO3 and SMTO5, prepared by oxalate\nprecipitation method, did not indicate any additional peaks arising due to impurities\nconfirming our earlier observation of its phase purity based on X-ray diffraction studies.\nHowever the asymmetric character of the modes and their deconvolution (specifically for\nthe modes C and D as reported in Table 3) into multiple peaks are interesting to ponder.\nThe splitting of the first order scattering modes further with the appearance of sharp\nsecond order modes due to the breaking of crystal structure symmetry could be observed\nonly at lower temperatures for STO 34. However in the case of SMTO, weak splitting of\nmodes could be observed even around room temperature that might indicate the local\nstructural distortion induced by Mn substitution. The Raman spectra belonging to\nSMTO9 sample as shown in Fig. 11 has signatures of the impurity phase in the form of\nweak lattice mode of TiO2 (strong intensity Eg mode at 143 cm-1 for pure TiO2\n\n37\n\n)\n\nobserved at 141 cm-1. The other dominating lattice mode observed at 433 cm-1 could not\n\n14\n\n\fbe assigned to any known entity. In the case of ceramics fabricated by freeze drying\nmethod, SMTO9 has strong signature of the presence of Mn3O4 38 (marked in Fig. 12(c))\nas revealed by a weak second order mode observed at 661cm-1. Similar observation of the\nasymmetric multiphonon scattering modes which might indicate the local structural\ndistortion holds good for the samples prepared by freeze drying method also. In order to\nhave further insight into this, one needs to carry out temperature dependent Raman\nscattering studies as in the case of pure STO.\n3.3 The effect of grain size on the dielectric behavior of SMTO\n\nThe dielectric relaxation of the bulk ceramics of SMTO, synthesized by oxalate\nprecipitation technique and the freeze drying method, have been studied in the (100 Hz –\n1MHz) frequency range from 300 K down to 80 K. Variation of dielectric relaxation\ncharacteristics with various levels of Mn doping have been discussed elsewhere in detail\n39\n\n. In the present work, we focus on the dielectric characteristics of SMTO ceramics\n\nobtained by different syntheses routes. As no dispersion was observed in the dielectric\nconstant values recorded in the 100 Hz – 1 MHz frequency range, the dielectric constant\n(εr′) and the loss (D) values obtained for 100 kHz have been listed for all the\ncompositions fabricated by solid-state reaction, oxalate precipitation and the freeze\ndrying methods (Table 4). The dielectric constant (εr′) values of the ceramics obtained by\nfreeze drying method were observed to be almost half of that observed for the ceramics\nobtained by the solid-state reaction and the oxalate precipitation routes. These results\nevidently demonstrate the microstructure dependent dielectric property.\n\nIt is to be\n\nnoticed that the ceramics obtained by freeze drying consists of fine grains (with grain\nsizes lower than 1 μm) as compared to that (around 1-2 μm) obtained by the other routes.\n\n15\n\n\fThis is further illustrated by the direct comparison of the temperature dependent dielectric\nconstant behavior for different compositions prepared by oxalate precipitation (CG –\ncoarse grained) and freeze drying (FG - fine grained) as given in Fig.13 . In fact, a similar\ntrend has been observed consistently in undoped STO by Petzelt et al\n\n40\n\nwhen dielectric\n\ncharacteristics were studied for ceramics consisting of different grain sizes ranging from\nsubmicron to a few micrometers. The significant decrease in the observed dielectric\nconstant values with decrease in the grain size was attributed to the dead layer effect. The\nthin grain boundary layer of very low dielectric constant acts as a dead layer and when its\nvolume becomes comparable to that of the grains, the effective dielectric constant\ndrastically decreases. In addition, it might be worth recalling that the bulk grain\ncomposition exhibits certain degree of fluctuation due to the inhomogeneous distribution\nof Mn (Table 2). This factor directly influences the pattern in the local distortion induced\nby the substitution of Mn in the Ti-site. Therefore the contribution of bulk composition\nfluctuations to the variation in dielectric behavior of SMTO ceramics synthesized by both\noxalate precipitation and freeze-drying methods cannot be ruled out.\n4. Conclusions\n\nSMTO phase with 3 mol % Mn doping on the Strontium site could not be obtained phase\npure when the solid state synthesis method was adopted. The oxalate precipitate method\nresulted in monophasic SMTO3 and SMTO5 while it was not useful for obtaining higher\ncompositions of Mn (> 5 mol %). The freeze drying method was successfully used to\nsynthesize high Mn containing compositions such as 5, 7, 9 mol % wherein amorphous\nstarting powders were synthesized and heat treated to obtain bulk samples. Though, it\nwas possible to achieve fine grained ceramics using the powders synthesized by freeze\n\n16\n\n\fdrying technique, the dielectric constants are lower than those obtained by the other\nmethods. The temperature dependent dielectric behavior (from 80 K to 300 K) of the\ncoarse grained and the fine grained ceramics fabricated from the different synthesis\nmethods, was compared. A comparison of the multiphonon Raman scattering modes\nobserved in the case of Sr1-xMnxTiO3 with that of pure SrTiO3 seemed to uphold the\npossibility of local structural distortion.\n5. Acknowledgement\n\nOne of the authors K.R.S.P would like to thank the European commission – External\ncooperation window for offering Erasmus Mundus fellowship and CNRS-SPMS, Ecole\nCentrale Paris, France for hosting her as visiting student.\n6. References\n\n1. T.R.N. Kutty and Sam Phillip, Materials Science and Engg. B33 (1995)58.\n2. Peter Kr. Petrov, E.F. Carlsson, P. Larsson, M. Friesel, Z. G. Ivanov, J. Appl.\nPhys. 84 (1998) 3134.\n3. W. Kleemann, V. V. Shvartsman, S. Bedanta, P. Borisov, A. Tkach and P. M.\nVilarinho, Journal of Physics Condensed Matter 20, (2008) 434216.\n4. G.A Smolenskii, Doklady Akad. Nauk. S.S.S.R. 70 (1950) 405.\n5. J.K. Hulm, Proc. Phys. Soc. (London) 63 (1950) 1184.\n6. G.A. Smolenskii, Zhur. Tekh. Fiz. 20 (1950) 137.\n7. H.E. Weaver, J. Phys. Chem. Solids 11 (1959) 274.\n8. G.A. Smolenskii, Soviet Physics-solid state 2 (1959) 2584.\n9. A.N. Gubkin, A.M. Kashtanova and G.I. Skanavi, Soviet physics-solid state 3,\n(1961) 807.\n10. Cheng Ang, Zhi Yu, J. Hemberger, P. Lunkenheimer and A. Loidl, Phys. Rev. B,\n59 (1999) 6665.\n11. Lei Zhang, W. Kleemann and Wei-Lie Zhong, Phys. Rev. B 66 (2002) 104105.\n12. A. Tkach, P.M. Vilarinho, A.L. Kholkin, I.M. Reany, J. Pokorny and J. Petzelt,\nChem. Mater. 19 (2007) 6471\n13. I. V. Kondakova, R. O. Kuzian, L. Raymond, R. Hayn and V. V. Laguta, Physical\nReview B - Condensed Matter and Materials Physics 79, (2009)134117.\n14. M. Savinov, V. A. Trepakov, P. P. Syrnikov, V. Železný, J. Pokorný, A. Dejneka,\nL. Jastrabík and P. Galinetto, Journal of Physics Condensed Matter 20 (2008)\n095221.\n15. A. Tkach, P. M. Vilarinho and A. L. Kholkin, Journal of Applied Physics 101,\n(2007) 084110.\n\n17\n\n\f16. A. Tkach, P. M. Vilarinho, A. L. Kholkin, A. Pashkin, S. Veljko and J. Petzelt,\nPhysical Review B 73 (2006) 104113.\n17. A. Tkach, P. M. Vilarinho, D. Nuzhnyy and J. Petzelt, Acta Materialia 58, (2010)\n577-582.\n18. R. O. Kuzian, V. V. Laguta, A. M. Daré, I. V. Kondakova, M. Marysko, L.\nRaymond, E. P. Garmash, V. N. Pavlikov, A. Tkach, P. M. Vilarinho and R.\nHayn, Europhysics Letters 92 (2010) 17007.\n19. V. V. Shvartsman, S. Bedanta, P. Borisov, W. Kleemann, A. Tkach and P. M.\nVilarinho, Journal of Applied Physics 107, (2010) 103926.\n20. P. E. C. Franken, M. P. A. Viegers and A. P. Gehring, Journal of the American\nCeramic Society 64 (1981) 687-690.\n21. A. F. Demirors and A. Imhof, Chemistry of Materials 21 (2009) 3002-3007\n22. Y. S. Malghe, Journal of Thermal Analysis and Calorimetry 102 (2010) 831-836\n23. J. Tao, M. Junfeng, Y. Wang, X. Zhu, J. Liu, X. Jiang, B. Lin and Y. Ren, Journal\nof the American Ceramic Society 89 (2006) 3554-3556\n24. X. Wei, G. Xu, Z. Ren, Y. Wang, G. Shen and G. Han, Journal of the American\nCeramic Society 91, (2008) 299-302.\n25. N. George, J. K. Thomas, R. Jose, H. P. Kumar, M. K. Suresh, V. R. Kumar, P. R.\nS. Wariar and J. Koshy, Journal of Alloys and Compounds 486 (2009) 711-715\n26. P. K. Roy and J. Bera, Materials Research Bulletin 40 (2005) 599-604\n27. CY. Rabinovitch, C. Bogicevic, F. Karolak, D. Tétard and H. Dammak, Journal of\nMaterials Processing Technology 199 (2008) 314-320\n28. E. Knaepen, J.Mullens, J.Yperman, L.C. Van Poucke, Thermochimica Acta 284\n(1996) 213.\n29. J. Zhang, Phys. Chem. Minerals 26 (1999) 644.\n30. G. Aminoff, Z. Krist, 64 (1927) 475.\n31. A. Tkach, P. M. Vilarinho and A. L. Kholkin, Acta Materialia 53 (2005) 5061.\n32. A. G. Badalyan, P.P. Syrnikov, C. B. Azzoni, P. Galinetto, M. C. Mozzati, J.\nRosa, V. A. Trepakov, and L. Jastrabik, J. Appl. Phys., 104 (2008) 033917.\n33. F.A. Rabuffetti, Hack-Sung Kim, J.A. Enterkin, Y. Wang, Courtney H. Lanier,\nL.D. Marks, K.R. Poeppelmeier and P.C.Stair, Chem. Mater 20 (2008) 5628.\n34. U. Balachandran and N.G.Eror, J. Amer. Ceram. Society, C-54, 1982\n35. W. Tailor and A.F.Murray, Solid state commun. 31 (1979) 937.\n36. R.F. Schaufele, M.J.Weber, Journal of Chemical Physics 46 (1967) 2859.\n37. H.C. Choi, Y.M. Jung, S. B. Kim, J. Vibrational Spectroscopy 37 (2005) 33.\n38. M.C. Bernard, Anne Hugot-LeGoff and Bich Vu Thi and Susanna Cardoba de\nToressi, J. Electrochemical Soc.140 (1993) 3065.\n39. K.R.S. Preethi Meher, K.B.R.Varma, Nicolas Guiblin and Pierre-Eymeric Janolin,\nUnpublished results (2011).\n40. J. Petzelt, Ferroelectrics 400 (2010) 117.\n\n18\n\n\fTable 1 The calculated particle size of the SMTO powders synthesized by freeze-drying\nmethod\n\nCompositions\n\ncrystallite size (nm)\n\nSMTO5\n\n65.2±0.1\n\nSMTO7\n\n42.7±0.1\n\nSMTO9\n\n35.9±0.1\n\n19\n\n\fTable 2 Quantification analysis of various elements present in SMTO9 ceramics\nfabricated using oxalate precipitation method\n\nSegregated\nphase(secondary\nphase)\n\nMajor\n(region 1)\n\nMajor\n(region 2)\n\nElement\n\nWt (%)\n\nAt (%)\n\nO (K)\n\n36.1\n\n64.13\n\nSr (L)\n\n7.29\n\n2.36\n\nTi (K)\n\n55.51\n\n32.93\n\nMn (K)\n\n1.1\n\n0.57\n\nphase O (K)\n\n20.85\n\n53.15\n\nSr (L)\n\n53.11\n\n24.73\n\nTi (K)\n\n25.43\n\n21.66\n\nMn (K)\n\n0.61\n\n0.46\n\nphase O (K)\n\n13.56\n\n40.23\n\nSr (L)\n\n57.36\n\n31.08\n\nTi (K)\n\n28.05\n\n27.8\n\nMn (K)\n\n1.03\n\n0.89\n\n20\n\n\fTable 3 List of scattering modes (marked in Figs. 11 and 12) and the corresponding\nwavenumber values obtained from the multipeak fit for SMTO\n\nMultiphonon\nscattering\nmodes\nas\nmarked in\nFig. 11 and\n12\n\nFrequency shift (cm-1) for SMTO Frequency shift (cm-1) for\nfabricated by oxalate precipitation\nSMTO fabricated by freeze\nObserved\ndrying method\nbands in\nSrTiO3\n(from\nSMTO3 SMTO5 SMTO7 SMTO9 SMTO5 SMTO7 SMTO9\nRef. (22)\n\nA\n\n83\n\n85\n\n84\n\n85\n\n84\n\n86\n\n83\n\n85\n\nB\n\n170\n\n172\n\n177\n\n188\n\n203\n\n177\n\n184\n\n179\n\nC\n\n252\n\n237\n251\n288\n\n236\n251\n280\n\n239\n246\n290\n\n244\n283\n\n235\n249\n278\n\n235\n250\n286\n\n236\n251\n294\n\nD\n\n316\n\n324\n\n310\n347\n\n321\n\n315\n\n323\n\n341\n\n300\n321\n\nE\n\n380\n\n374\n\n384\n\n384\n\n386\n\n365\n\n374\n\n366\n\n620\n\n619\n\n617\n\n620\n\n612\n\n610\n\n625\n\n616\n\n678\n\n671\n\n683\n\n686\n\n688\n\n695\n\n683\n\n687\n\n725\n\n722\n751\n\n727\n749\n\n715\n752\n\n747\n\n731\n753\n\n726\n755\n\n723\n751\n\n795\n\n793\n\n795\n\n806\n\n796\n\n794\n\n794\n\nF\nG\nH\nI\n\n21\n\n\fTable 4 List of dielectric constant values (εr′) and loss (D) at 100 kHz of SMTO bulk\nceramics fabricated by different synthesis routes\n\nComposition\n\nεr′ (300 K)\n\nD (300 K)\n\nεr′ (80 K)\n\nD (80 K)\n\n261\n\n0.0015\n\n1582\n\n0.011\n\nSMTO3\n\n220\n\n0.005\n\n1110\n\n0.01\n\nSMTO5\n\n231\n\n0.009\n\n1069\n\n0.008\n\nSMTO7\n\n248\n\n0.002\n\n1371\n\n0.006\n\nSMTO5\n\n90\n\n0.0014\n\n240\n\n0.002\n\nSMTO7\n\n122\n\n0.002\n\n418\n\n0.0021\n\nSMTO9\n\n107\n\n0.002\n\n308\n\n0.0025\n\nsolid-state method\nSMTO3\nOxalate precipitation method:\n\nFreeze-drying method\n\n22\n\n\fFig.1 Block diagram illustrating the steps followed during the oxalate precipitation\n\nsynthesis of SMTO\n\n23\n\n\fFig.2 Block diagram illustrating the methods followed during the freeze-drying synthesis\n\nof SMTO\n\n24\n\n\fFig. 3 HXRD pattern for SMTO powders of the bulk ceramics sintered at 1623 K/ 12 h\n\n25\n\n\fFig. 4 DTA and TGA curves of the as-synthesized starting powders corresponding to the\n\ncompositions (a) SMTO3 (b) SMTO5 and (c) STMO7\n\n26\n\n\fFig. 5 Peak positions of (a) MnO (filled squares) and (b) Mn3O4 (filled diamond) from\n\nstandard data and XRD patterns of (c) SMTO3 (d) SMTO5 (e) SMTO7 (f) SMTO9\nprepared from oxalate precipitation method. The dashed lines and the dash dot lines\nindicate the matching of peak positions of MnO and Mn3O4 respectively to the XRD data\nin (c) to (f)\n\n27\n\n\fFig 6 High resolution XRD patterns of (a) SMTO3 and (b) SMTO5 plotted in logscale\n\n28\n\n\fFig 7 XRD patterns of (a) SMTO5 (b) SMTO7 and (c) SMTO9 obtained after calcination\n\nand the inset shows the as synthesized powders obtained immediately after freezedrying\nprocedure.\n\n29\n\n\fFig. 8 High resolution XRD patterns of bulk ceramic samples of (a) SMTO5 (b) SMTO7\n\nand (c) SMTO9 sintered at various temperatures.\n\n30\n\n\fFig.9 SEM micrographs of (a) SMTO3 (b) SMTO5 sintered at 1540 K (c) SMTO7 and\n\n(d) SMTO9 sintered at 1523 K. The inset shows the EDAX spectra recorded from 2\ndifferent spots of the sample.\n\n31\n\n\fFig.10 SEM images of (a) SMTO5 (b) SMTO7 (c) SMTO9 sintered at 1473 K and (d)\n\nthe corresponding back scattering image of SMTO9 which indicates the segregation of\nsecondary phases.\n\n32\n\n\fFig. 11 Room temperature Micro-Raman spectra of (a) SMTO3 (b) SMTO5 (c) SMTO7\n\nand (d) SMTO9 synthesized using oxalate precipitation technique.\n\n33\n\n\fFig. 12 Room temperature Micro-Raman spectra of (a) SMTO5 (b) SMTO7 and (c)\n\nSMTO9 synthesized using freeze drying method.\n\n34\n\n\fFig. 13 Variation of dielectric constant with temperature (80 K to 300 K) at 100 KHz for\n\n(a) SMTO5 (b) SMTO7 (c) SMTO9 where open squares represents the ceramics\nfabricated from oxalate precipitation method (CG) and the open triangles represents the\nceramics prepared by freeze drying (FG).\n\n35\n\n\f"}