{"id": "http://arxiv.org/abs/0812.4751v2", "guidislink": true, "updated": "2009-05-17T22:29:21Z", "updated_parsed": [2009, 5, 17, 22, 29, 21, 6, 137, 0], "published": "2008-12-27T22:11:36Z", "published_parsed": [2008, 12, 27, 22, 11, 36, 5, 362, 0], "title": "Reversal of the amplitude difference of kHz QPOs in six atoll sources", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0812.0441%2C0812.0294%2C0812.1559%2C0812.3337%2C0812.4122%2C0812.1484%2C0812.5029%2C0812.3090%2C0812.1347%2C0812.3242%2C0812.0244%2C0812.0752%2C0812.4891%2C0812.0352%2C0812.2275%2C0812.3821%2C0812.4041%2C0812.3900%2C0812.1079%2C0812.2648%2C0812.0571%2C0812.4167%2C0812.0180%2C0812.2752%2C0812.1671%2C0812.5100%2C0812.3014%2C0812.4751%2C0812.0179%2C0812.0381%2C0812.0484%2C0812.3901%2C0812.4242%2C0812.4685%2C0812.2539%2C0812.3062%2C0812.2530%2C0812.2844%2C0812.4954%2C0812.4791%2C0812.4385%2C0812.1293%2C0812.0071%2C0812.3940%2C0812.1995%2C0812.4286%2C0812.3963%2C0812.2504%2C0812.4292%2C0812.3909%2C0812.4243%2C0812.3916%2C0812.0266%2C0812.0742%2C0812.1534%2C0812.4661%2C0812.0019%2C0812.5009%2C0812.3375%2C0812.4653%2C0812.1640%2C0812.2298%2C0812.2939%2C0812.3799%2C0812.1573%2C0812.5018%2C0812.1054%2C0812.3585%2C0812.2340%2C0812.3841%2C0812.5046%2C0812.3570%2C0812.1467%2C0812.1897%2C0812.0300%2C0812.0841%2C0812.5024%2C0812.2437%2C0812.3004%2C0812.4742%2C0812.5102%2C0812.4260%2C0812.1120%2C0812.4992%2C0812.3045%2C0812.3430%2C0812.1888%2C0812.4278%2C0812.3928%2C0812.2653%2C0812.1066%2C0812.3838%2C0812.1394%2C0812.0367%2C0812.5011%2C0812.2029%2C0812.5073%2C0812.2521%2C0812.3721%2C0812.4588%2C0812.1981&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Reversal of the amplitude difference of kHz QPOs in six atoll sources"}, "summary": "AIMS: For six neutron-star atoll sources (4U 1608-52, 4U 1636-53, 4U 0614+09,\n4U 1728-34, 4U 1820-30 and 4U 1735-44) we investigate the relationship between\nthe observed fractional rms amplitudes of the twin kHz QPOs. We discuss whether\nthis displays features that could have a physical meaning in terms of the\nproposed QPO models. METHOD: We consider the difference in rms amplitude\nbetween the upper and lower kHz QPOs, as a function of the frequency ratio R.\nWe compare two data sets. Set I is a collection taken from published data. Set\nII has rms amplitude values obtained by automatic fitting of continuous\nsegments of RXTE-PCA observations. RESULTS: For each of the six sources, we\nfind that there is a point in the R domain around which the amplitudes of the\ntwo twin kHz QPOs are the same. We find such a point located inside a narrow\ninterval R=1.5 +-3%. Further investigation is needed in the case of two sources\nto explore this finding, since we have not determined this point in Set II.\nThere is evidence of a similar point close to R = 1.33 or R = 1.25 in the four\nsources. We suggest that some of these points may correspond to the documented\nclustering of the twin kHz QPO frequency ratios. CONCLUSIONS: For the sources\nstudied, the rms amplitudes of the two kHz peaks become equal when the\nfrequencies of the oscillations pass through a certain ratio R, which is\nroughly the same for each of the sources. In terms of the orbital QPO models,\nwith some assumptions concerning the QPO modulation, this finding implies the\nexistence of a specific orbit at a common value of the dimensionless radius, at\nwhich the oscillations corresponding to the two peaks come into balance. In a\nmore general context, the amplitude difference behaviour suggests the possible\nexistence of an energy interchange between the upper and lower QPO modes.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0812.0441%2C0812.0294%2C0812.1559%2C0812.3337%2C0812.4122%2C0812.1484%2C0812.5029%2C0812.3090%2C0812.1347%2C0812.3242%2C0812.0244%2C0812.0752%2C0812.4891%2C0812.0352%2C0812.2275%2C0812.3821%2C0812.4041%2C0812.3900%2C0812.1079%2C0812.2648%2C0812.0571%2C0812.4167%2C0812.0180%2C0812.2752%2C0812.1671%2C0812.5100%2C0812.3014%2C0812.4751%2C0812.0179%2C0812.0381%2C0812.0484%2C0812.3901%2C0812.4242%2C0812.4685%2C0812.2539%2C0812.3062%2C0812.2530%2C0812.2844%2C0812.4954%2C0812.4791%2C0812.4385%2C0812.1293%2C0812.0071%2C0812.3940%2C0812.1995%2C0812.4286%2C0812.3963%2C0812.2504%2C0812.4292%2C0812.3909%2C0812.4243%2C0812.3916%2C0812.0266%2C0812.0742%2C0812.1534%2C0812.4661%2C0812.0019%2C0812.5009%2C0812.3375%2C0812.4653%2C0812.1640%2C0812.2298%2C0812.2939%2C0812.3799%2C0812.1573%2C0812.5018%2C0812.1054%2C0812.3585%2C0812.2340%2C0812.3841%2C0812.5046%2C0812.3570%2C0812.1467%2C0812.1897%2C0812.0300%2C0812.0841%2C0812.5024%2C0812.2437%2C0812.3004%2C0812.4742%2C0812.5102%2C0812.4260%2C0812.1120%2C0812.4992%2C0812.3045%2C0812.3430%2C0812.1888%2C0812.4278%2C0812.3928%2C0812.2653%2C0812.1066%2C0812.3838%2C0812.1394%2C0812.0367%2C0812.5011%2C0812.2029%2C0812.5073%2C0812.2521%2C0812.3721%2C0812.4588%2C0812.1981&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "AIMS: For six neutron-star atoll sources (4U 1608-52, 4U 1636-53, 4U 0614+09,\n4U 1728-34, 4U 1820-30 and 4U 1735-44) we investigate the relationship between\nthe observed fractional rms amplitudes of the twin kHz QPOs. We discuss whether\nthis displays features that could have a physical meaning in terms of the\nproposed QPO models. METHOD: We consider the difference in rms amplitude\nbetween the upper and lower kHz QPOs, as a function of the frequency ratio R.\nWe compare two data sets. Set I is a collection taken from published data. Set\nII has rms amplitude values obtained by automatic fitting of continuous\nsegments of RXTE-PCA observations. RESULTS: For each of the six sources, we\nfind that there is a point in the R domain around which the amplitudes of the\ntwo twin kHz QPOs are the same. We find such a point located inside a narrow\ninterval R=1.5 +-3%. Further investigation is needed in the case of two sources\nto explore this finding, since we have not determined this point in Set II.\nThere is evidence of a similar point close to R = 1.33 or R = 1.25 in the four\nsources. We suggest that some of these points may correspond to the documented\nclustering of the twin kHz QPO frequency ratios. CONCLUSIONS: For the sources\nstudied, the rms amplitudes of the two kHz peaks become equal when the\nfrequencies of the oscillations pass through a certain ratio R, which is\nroughly the same for each of the sources. In terms of the orbital QPO models,\nwith some assumptions concerning the QPO modulation, this finding implies the\nexistence of a specific orbit at a common value of the dimensionless radius, at\nwhich the oscillations corresponding to the two peaks come into balance. In a\nmore general context, the amplitude difference behaviour suggests the possible\nexistence of an energy interchange between the upper and lower QPO modes."}, "authors": ["Gabriel Torok"], "author_detail": {"name": "Gabriel Torok"}, "author": "Gabriel Torok", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361/20079026", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0812.4751v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0812.4751v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "5 pages, 2 figures, proofreaded version", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0812.4751v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0812.4751v2", "journal_reference": "Astron.Astrophys.497:661-665,2009", "doi": "10.1051/0004-6361/20079026", "fulltext": "c ESO 2018\n\nAstronomy & Astrophysics manuscript no. 9026\nSeptember 19, 2018\n\nReversal of the amplitude difference of kHz QPOs in six atoll\nsources\n\narXiv:0812.4751v2 [astro-ph] 17 May 2009\n\nGabriel Török\nInstitute of Physics, Faculty of Philosophy and Science, Silesian University in Opava, Bezručovo nám. 13,CZ-74601 Opava, Czech\nRepublic\nReceived / Accepted\nABSTRACT\n\nContext. Several models have been proposed to explain the twin kilohertz quasi-periodic oscillations (kHz QPOs) detected in neutronstar low-mass X-ray binaries; but when confronting theory with observations, not much attention has been paid so far to the relation\nbetween their amplitudes.\nAims. For six neutron-star atoll sources (namely 4U 1608-52, 4U 1636-53, 4U 0614+09, 4U 1728-34, 4U 1820-30, and 4U 173544,) we investigate the relationship between the observed fractional rms amplitudes of the twin kHz QPOs. We discuss whether this\nrelationship displays features that could have a physical meaning in terms of the proposed QPO models.\nMethods. We consider the difference in rms amplitude between the upper and lower kHz QPOs as a function of the frequency ratio\nR = νU /νL . We compared two data sets. Set I is a collection taken from published data. Set II has values for the rms amplitudes\nobtained by automatic fitting of all RXTE-PCA observations available up to the end of 2004, corresponding to continuous segments\nof observation.\nResults. For each of the six sources, we find that there is a point in the R domain around which the amplitudes of the two twin kilohertz\nQPOs are the same. We find such a point located inside a narrow interval R = 1.5 ± 3%. Further investigation is needed in the case of\n4U 1820-30 and 4U 1735-44 to explore this finding, since we have not determined this point in Set II. There is evidence of a similar\npoint close to R = 1.33 or R = 1.25 in the four sources 4U 1820-30, 4U 1735-44, 4U 1608-52, and 4U 1636-53. We suggest that some\nof these special points may correspond to the documented clustering of the twin kHz QPO frequency ratios.\nConclusions. For the sources studied, the rms amplitudes of the two twin peaks become equal when the frequencies of the oscillations\npass through a certain ratio R, which is roughly the same for each of the sources. In terms of the orbital QPO models (of both the\nhot-spot and disc-oscillation types), with some assumptions concerning the QPO modulation mechanism, this finding implies the\nexistence of a specific orbit at a particular common value of the dimensionless radius, at which the oscillations corresponding to\nthe two twin peaks come into balance. In a more general context, the amplitude difference behaviour suggests a possible energy\ninterchange between the upper and lower QPO modes.\nKey words. X-rays:binaries - Stars:neutron - Accretion, accretion disks\n\n1. Introduction\nA number of black-hole and neutron-star sources in low-mass Xray binaries (LMXBs) show quasi-periodic oscillations (QPOs)\nin their observed X-ray fluxes, i.e., narrow features (peaks) in\ntheir power density spectra (hereafter PDS). The frequencies of\nthese QPOs range from ∼ 10−2 Hz to ∼ 103 Hz. Here we restrict\nour attention to the so-called kHz (or high-frequency; HF) QPOs,\nwhich have frequencies in the range 200 - 1300 Hz, i.e., of the\nsame order as the frequencies of orbital motion close to the compact object (see van der Klis 2006, for a review).\nIn black-hole systems HF QPO peaks are typically detected at constant frequencies characteristic of a given source.\nWhen two or more HF QPO frequencies are detected, they\nusually come in small-number ratios, typically in a 3 : 2 ratio (Abramowicz & Kluźniak 2001; McClintock & Remillard\n2003). For neutron-star sources, on the other hand, kHz QPOs\noften arise as two simultaneously observed1 peaks with frequenSend offprint requests to: G. Török, terek@volny.cz\n1\nThe term \"simultaneously observed\" is here applied to continuous\nobservations (or their subsegments) displaying both modes. The integration time needed for these detections ranges from a few seconds to a\nfew dozen minutes.\n\ncies that change over time. This paper focuses on these kHz PDS\nfeatures, referred to as twin kHz QPOs.\nFrom here on, we adopt the convention of calling the two\npeaks forming twin kHz QPOs the lower and upper QPO and\ndenote their frequencies as νL < νU . The twin kHz QPOs span a\nwide frequency range and follow a nearly linear νU –νL relation\nfor each source (Belloni et al. 2005; Abramowicz et al. 2005b;\nBursa 2006).\nIn this paper we use the twin kHz QPO data obtained with the\nProportional Counting Array (PCA; Jahoda et al. 1986) on board\nthe Rossi X-ray Timing Explorer (RXTE; Bradt et al. 1993).\n1.1. Orbital models of kHz QPOs and frequency ratio\n\nSeveral models have been proposed to explain kHz QPOs, and\nmost of them involve orbital motion in the inner regions of the\naccretion disc (see van der Klis 2006; Lamb & Boutloukos 2007,\nfor a recent review).\nAmong others, two frequently discussed models are based\non strong-gravity properties. Stella & Vietri (1999) introduced\nthe \"relativistic precession model\" (which we will refer to as\nthe RP model) in which the QPOs are associated with the motion of blobs of matter in the inner parts of the accretion disc.\n\n\f2\n\nG. Török: Reversal of the amplitude difference of kHz QPOs in six atoll sources\n\nThe upper and lower QPO frequencies νU , νL are identified\nwith the Keplerian frequency and the relativistic periastron precession frequency, respectively. Slightly after this, Kluźniak &\nAbramowicz (2001) suggested a model in which the twin kHz\nQPOs arise from non-linear resonance between two modes of\naccretion disc oscillation. We will refer to this as the resonance\nmodel. In the basic version of the resonance model, the upper\nand lower QPO frequencies, when in a resonant ratio, coincide\nwith the resonant frequencies given by specific combinations\nof epicyclic frequencies of geodesic test particle orbital motion\n(see Abramowicz & Kluźniak 2001; Abramowicz et al. 2003;\nRebusco 2004; Horák & Karas 2006; Abramowicz et al. 2006;\nFogelström et al. 2008).\nFrequencies of geodesic motion at a given orbit, scale inversely with the mass M of the central compact object when\nthe dimensionless forms of the neutron star angular momentum j and quadrupole moment q are held fixed. Therefore, within\nthe framework of the above models, if the absolute differences\nbetween the squares of angular momenta are small among the\nsources being considered, the ratio R = νU /νL between the twin\nkHz QPO frequencies represents a rough measure of the radial\nposition of the QPO excitation, which is independent of the mass\nof the neutron star (Török et al. 2008). The frequency ratio R also\nhas genuine importance for the resonance model.\n1.2. Strength of the signal\n\nBecause of the expected links to the orbital motion, most discussions of neutron star twin kHz QPOs have for a long time\nbeen concentrated mainly on the frequencies νL , νU , and on their\nrelations and evolution.\nThe other QPO properties, namely the quality factor Q and\nfractional root-mean-squared (rms) amplitude r have also been\nstudied, but have not attracted such wide attention. We recall that\nthe quality factor Q characterises the coherence time of a QPO,\nbeing defined as the QPO centroid frequency over the full-width\nof the peak at its half-maximum, while the fractional root-meansquared amplitude r represents a measure of the signal strength,\nwhich is proportional to the square root of the peak power contribution to the PDS. In the past few years, both the quality factor\nand the rms amplitude have been studied systematically for several sources, and possible consequences for various QPO models\nhave been outlined (see, e.g., Méndez 2006; Barret et al. 2006,\nfor further information and references).\nHowever, most attention has been focussed on the quality\nfactor and the rms amplitude as separate functions of frequency.\nLittle attention has been paid to the mutual relations between the\n(correlated) QPO amplitudes.\nIn the present work we study the difference in strength between the twin kHz QPOs, ∆r = rL − rU , defined as the difference\nbetween the fractional rms amplitudes of the lower and upper\nkHz QPOs (rL , rU ).\n\n2. Data analysis\nHere we focus on six well-studied atoll sources (namely\n4U 1608−52, 4U 1636−53, 4U 0614+09, 4U 1728−34,\n4U 1820−30, and 4U 1735−44) spanning a wide range of\nfrequencies.\n\n2.1. Published data (Set I)\n\nWe benefit from existing studies and use published results\non rms amplitude correlations from the large collection made\nby Méndez (2006). We refer to this data as Set I. The main\nreferences to the original papers are as follows: 4U 160852 (Méndez et al. 2001), 4U 1636-53 (Barret et al. 2005a),\n4U 0614+09 (van Straaten et al. 2002), 4U 1728-34 (Méndez\net al. 2001), 4U 1820-30 (Barret et al. 2006), 4U 1735-44 (Barret\net al. 2006). Although obtained in different studies (using different approaches), the data are comparable since they are measured over the whole RXTE-PCA energy band (2 - 60 keV).\nThe data of Set I do not always correspond directly to simultaneous twin kHz QPO measurements. Moreover, the range\nwhere the properties of either one of the QPO frequencies is\nwell-investigated often extends far from the region of joint coverage, and then the identification of a particular significantlydetected peak as belonging to the upper or lower group comes\nfrom an extensive investigation of its properties (especially its\nquality factor) and also its correlations with the low-frequency\nQPOs (see Méndez et al. 2001; Olive et al. 2003; Barret et al.\n2005a,b, 2006; Belloni et al. 2007; van der Klis 2006). It is relevant in this context that both QPOs become weak broad features\nwhen their frequencies are lower than ∼ 500 Hz (see Olive et al.\n2003).\nFor the purposes of this paper, we interpolate the amplitude\ndata of Set I for each source using the best fits for both amplitudes made in terms of a sum of three exponentials\nri =\n\n3 h\nX\n\ni\n\u0011\n\u0010\n(3)\n(2)\nexp P(1)\ni, j + νi Pi, j + Pi, j ,\n\ni ∈ {U , L} ,\n\n(1)\n\nj=1\n\nwith the P(k)\ni, j being free parameters.\nAs noticed in several studies, the frequency correlations in\nthe six sources considered in this paper are well-fitted by linear relations (Abramowicz et al. 2005a; Belloni et al. 2005;\nBursa 2006; Zhang et al. 2006). We use this property to connect both amplitude-frequency relations (1), with the assumption\nthat the frequency correlations are linear in the range above\nνL = 500 Hz, and follow the relations found in Abramowicz\net al. (2005a,b). These relations were determined from the wellinvestigated twin QPO data above νL = 500 Hz , i.e., below\nR ≃ 1.7. The highest frequency ratio detections in the atoll\nsources being considered are around R ∼ 2.5 - 3.2 However,\nthe detections above R ∼ 2 are rare and an extension to the related range νL ∼ 200 - 400 Hz is subject to errors in determining\nthe above relations.\n2.2. Data processed in a uniform way (Set II)\n\nFollowing Barret et al. (2005a, 2006), we use all public archival\nRXTE-PCA data available up to the end of 2004 (for the full\nenergy band from 2 - 60 keV) for the six atoll sources that we\nare considering. Segments of the temporally continuous collection of data from a single pointing are processed using a shiftadd procedure. For each segment, a set of 8-second leahy normalized PDS is produced, and an averaged PDS is then calcu2\nSee Zhang et al. (2006) who study frequency correlations in a large\ngroup of sources using for the atoll sources the data from works of\nBelloni et al. (2002, 2005), Psaltis et al. (1999a,b), van der Klis (2000,\n2006), Méndez et al. (1998a,b,c), Méndez and van der Klis (1999), van\nStraaten et al. (2000, 2002, 2003), Di Salvo et al. (2003), Jonker et al.\n(2002), Markwardt et al. (1999), Migliari et al. (2003).\n\n\fG. Török: Reversal of the amplitude difference of kHz QPOs in six atoll sources\n\n3\n\nFig. 1. Amplitudes of the lower and upper oscillations plotted against the two QPO frequencies (published data). Above νL ∼ 500 Hz (i.e.,\nbelow R & 1.7), the frequency correlations are approximated well by the linear relations that we use. The shadow indicates the frequency range\ncorresponding to R = 1.5 ± 3%. For the lower QPO in 4U 0614+09 the high-frequency part contains two datapoints that do not indicate a clear\ntrend.\n\nlated for each set. The averaged PDS is searched for QPOs using a scanning technique that looks for peak excess (assumed\nto have a Lorentzian profile) above the Poisson counting noise\nlevel (see Boirin et al. 2000). To minimize the effects of longterm frequency drift, the QPO frequencies are estimated on the\nshortest statistically permitted timescales, applying a recursive\nsearch algorithm seeking over the set of 8-second PDS. If there\nare two QPO peaks present in the segment-averaged PDS, the\npeak with the highest significance S (defined as the integral of\nthe Lorentzian fitting of the peak divided by its error) is considered for further tracking. The tracked QPO is searched for within\na window with a width not greater than 20% of the QPO frequency. The present frequency-ratio detections in the sources being considered are above R = 1.2. Because the relative frequency\nchange within a single observation is small, the algorithm cannot switch between the two peaks within the tracking. After the\ntracking, the segment splits into several averaged subsegments\n(each of them corresponding to about 50 - 500 sec) to which\nthe shift-add is applied. The PDS obtained is then searched for\nthe final QPOs. For later analysis, we retain the resulting peaks\ndetected above the threshold S ≥ 2.5σ. We refer to these data,\nrepresenting a coherent set processed in a uniform way, as Set II.\n\n3. Results\nIt can be seen from Fig. 1 that the rms amplitudes of the two\npeaks are comparable over a frequency range that is rather narrow with respect to the total frequency range spanned by the six\nsources. Moreover, for all of the six sources, the rms amplitudes\n\nare comparable in a range around the frequency where the 3 : 2\nratio occurs. We mark this frequency and those for other relevant\nratios in Fig. 1.\nConsideration of individual frequency correlations implies\nthat lower and upper QPO datapoints overlaps in Fig. 1 do fall\nmostly within the range R ∼ 1.2 - 1.7. In Fig. 2 we show the behaviour of the amplitude difference ∆r in this range, as inferred\nfrom the interpolated curves in Fig. 1. In the same figure we also\nplot values of ∆r from Set II. We detected only three significant datapoints outside this range in Set II. Each of these three\ndatapoints falls into the range R ∈ [2.2, 2.7] and corresponds to\nnegative values of ∆r.\n3.1. Roots of ∆r\n\nThe values of ∆r at the intersection with the R axis are shown\nin Table 1. We refer to the intersections as \"roots R1 , R2 \", corresponding to the higher and lower frequency ratios.\nIn the four sources (4U 1608-52, 4U 1636-53, 4U 0614+09,\n4U 1728-34) where we detected enough datapoints in Set II between R = 1.4 - 1.6, the values of ∆r are well-approximated\nby linear functions of R in that range. We then fit these datapoints by straight lines (see Table 1 for the corresponding χ2 ).\nFor 4U 1636-53 and 4U 1608-52, which display in the Set II\ndata a clear increase in amplitude difference between R = 1.2 -\n1.4, we join the straight-line fit to an increasing exponential fit.\nAll of the resulting curves for Set II are included in Figure 2.\nFor the four sources 4U 1608-52, 4U 1636-53, 4U 0614+09,\nand 4U 1728-34, the roots R1 for the Set II data given in Table 1\n\n\f4\n\nG. Török: Reversal of the amplitude difference of kHz QPOs in six atoll sources\n\nFig. 2. The dependence of the amplitude difference on the frequency ratio, with detailed view shown of the range R = 1.2 - 1.7. The dashed black\ncurves correspond to Set I (with exponential interpolation), while the individual points correspond to Set II. When there are asymmetric errors, we\nalways use the larger one. The open points are above the 2.5σ threshold; the filled points have significance greater than 3σ. The solid blue curves\nuse linear interpolation in the decreasing part of curve joined to an exponential in the increasing part (see text). The vertical lines labelled with\nQmax denote the frequency ratio corresponding to the maximum of the lower QPO quality factor (see Section 4 for a comment on this).\n\nare determined from the fits described above. In principle, the fits\ncan enable us also to determine the roots R2 from the Set II data\nfor 4U 1636-53 and 4U 1608-52. These are close to R ∼ 1.25 but\nare difficult to quantify precisely. Clearly, as can be seen from\nFig. 2, more investigation is needed in order to make more precise statements about these two roots. In 4U 1608-52 there are\nonly three relevant datapoints, while in 4U 1636-53 the datapoints give a rather high χ2 for the increasing part of ∆r curve.\nFor 4U 1820-30 and 4U 1735-44, there is a lack of twin kHz\nQPO detections around R ∼ 1.5 from Set II, and we were not\nable to determine their roots R1 , although the Set I data indicate\nthat they should exist. For the increasing part of the ∆r curve, we\nuse the same fitting procedure as for 4U 1608-52 and 4U 163653, but we only expect the existence of the linear decaying part\nbetween R = 1.4 - 1.6, which we determined from the Set I data.\nIn this way, we find the two roots R2 close to 1.33. For 4U 182030, the datapoints close to R2 are scattered around the R-axis,\ngiving a rather poor χ2 for all of the fits, and the value of R2\nvaries with small changes of χ2 . For 4U 1735-44, the location of\nR2 seems to be well-determined.\nWe note that for 4U 1820-30 and 4U 1735-44 (R2 ∼ 1.33),\nas well as for 4U 1608-52 and 4U 1636-53 (R2 ∼ 1.25), the\ntermination of the available data nearly seems to coincide with\nthe position of R2 , which makes the exact determination of R2\ndifficult.\n\n4. Discussion and conclusions\nIn five of the six atoll sources that we have considered\n(4U 1728−34, 4U 1608−52, 4U 1636−53, 4U 0614+09, and\n4U 1820−30), the upper kHz QPO dominates the lower one for\nhigh values of the twin kHz QPO ratio (R > 1.5) corresponding to\nlow QPO frequencies. The issue of the upper QPO dominance at\nlow QPO frequencies in 4U 1735−44 remains an open question\n\ndue to the lack of the relevant datapoints in both Sets I and II.\nThe four sources 4U 1728−34, 4U 1608−52, 4U 1636−53, and\n4U 0614+09 clearly exhibit the R1 root close to R = 1.5. Because\nof the lack of datapoints in Set II, however, more investigation\nis needed to fully confirm a similar statement about R1 for the\nsources 4U 1820-30 and 4U 1735-44. For ratios decreasing from\nthe value R ≃ 1.5, the difference between the QPO amplitudes\nreaches its maximum within a narrow interval of R ∈ [1.3, 1.45].3\nAfter this, as the ratio decreases further (but not for 4U 0614+09\nwhere the available data terminates), the lower QPO starts to lose\nits dominance again. Notably, all of the determined values of the\nroot R1 lie inside the ∼ 3% interval around R = 1.5, which corresponds to less than 10% of the range R ∈ (1.2, 2.5). For the four\nsources (4U 1608-52, 4U 1636-53, 4U 1820-30, 4U 1735-44),\nand marginally also for 4U 1728-34, there is evidence for of another root (close to R = 1.33 or 1.25) where the available data\nterminate. Most of datapoints in Fig. 2 appear close to the roots\nR1 or / and R2 . We therefore suggest that there could be a link between the previously reported ratio clustering and the existence\nof R1,2 , which requires further investigation.\nWithin the framework of the QPO resonance models, the behaviour of the amplitude difference may indicate an energy interchange between the lower and upper QPO modes, typical of\nnon-linear resonances (e.g., Horák & Karas 2006). In this context, it is also rather noticeable that the roots R1, 2 are close to the\nvalues 3/2 and 4/3 or 5/4 (which we denoted by dashed vertical lines in the above figures). Nevertheless, in order to take this\nindication seriously, it is necessary to have a model that gives a\ndetailed explanation of the effect.\n3\nBarret et al. (2005a,b, 2006) determined the frequencies corresponding to maxima of the lower QPO quality factor in the discussed\nsources. Interestingly, the relevant ratios are close or coincide with those\nrelated to the maxima of ∆r (see Fig. 2).\n\n\fG. Török: Reversal of the amplitude difference of kHz QPOs in six atoll sources\n\n5\n\nTable 1. The roots R1 , R2 of the function ∆r(R).\nSource\n\nSet I\nSet II\nχL2 /d.o. f χU2 /d.o. f R1 (∆r = 0)† R2 (∆r = 0) χ2 /d.o. f\nR1 (∆r = 0)\nR2 (∆r = 0)\n4U 1608-52\n17/38\n15/9\n1.48 ± 0.01\n–\n13/8 ∗\n1.51 ± 0.01 1.25 ± 0.01\n4U 1636-53\n1.7/11\n40/23\n1.49 ± 0.01\n–\n18/15 ∗\n1.49 ± 0.01 1.25 ± 0.01\n4U 0614+09\n59/15\n16/4\n1.45 ± 0.01\n–\n3.8/10 ∗\n1.48 ± 0.01\n–\n4U 1728-34\n40/36\n6.3/7\n1.48 ± 0.01\n–\n21/23 ∗\n1.50 ± 0.01\n–\n4U 1820-30\n23/35\n15/7\n1.46 ± 0.01 1.31 ± 0.02\n32/15\n–\n1.34 ± 0.02\n4U 1735-44\n2.6/4\n2.5/2\n1.53 ± 0.02 1.34 ± 0.01\n4.1/8\n–\n1.33 ± 0.01\n†\nthe errors shown correspond to a unit variation of χ2 ; for asymmetric errors, we use the larger one.\n∗\ncorresponds to the linear part of curve between R= 1.4 - 1.6.\n\nWithin the scope of the other orbital QPO models, there\nshould also be an explanation for why the roots R1, 2 appear. For\ninstance, in the case of the relativistic precession model, one can\nsolve equations relating the upper and lower QPO with respect\nto the radial coordinate ρ, for the particular form of the expressions for the orbital frequencies in Schwarzschild geometry, obtaining the relation ρ = 6MR2 /(2R − 1), see Török et al. (2008).\nAccording to this formula, the R = 1.5 frequency ratio would correspond to an orbital radius ρ = 6.75 M, which is about 14 kilometres for a neutron star with the \"canonical\" mass M = 1.4 M⊙ .\nThe 3 % scatter around R = 1.5 would be projected onto an interval of only about ±1.5 % in ρ, i.e., onto ∼ ±0.1 M \u0011 ±200 m. It\nis then a question not only of why the observed amplitudes corresponding to oscillations at this radius should be equal, but also\nwhy they are equal for several sources at the same radius with a\nscatter of less than 250 m.\nAcknowledgements. I would like to thank Didier Barret for all his personal, scientific, and technical help, for his patience and for providing the data and analysis\nsoftware on which this paper builds. Then I thank Marek Abramowicz, Michal\nBursa, Jiřı́ Horák, Włodek Kluźniak, Zdeněk Stuchlı́k, and Eva Šrámková for\ndiscussions and help with the paper. I am especially grateful to Pavel Bakala and\nPetr Čermák for many debates and technical advice, and John Miller for the time\nspent on a detailed discussion of the paper and its wording. I also express sincere\nthanks to the anonymous referee for his/her critical comments and suggestions\nthat greatly improved the quality of the paper. This work was supported by the\nCzech grant MSM 4781305903.\n\nReferences\nAbramowicz, M.A., Karas, V., Kluzniak, W, Lee, W. H., Rebusco, P., 2003,\nPASJ, 55, 466-467\nAbramowicz, M. A., & Kluźniak, W., 2001, A&A 374L,19A, astro-ph/0105077\nAbramowicz, M. A., Barret, D., Bursa, M., et al. 2005b, Astronomical Notes,\n326, 864\nAbramowicz, M. A., Barret, D., Bursa, M., et al. 2005a, in Proceedings of\nRAGtime 6/7: Workshops on black holes and neutron stars, Opava, 16–\n18/18–20 September 2004/2005, ed. S. Hledı́k & Z. Stuchlı́k (Opava: Silesian\nUniversity in Opava), 1–9\nAbramowicz, M. A., Blaes, O. M., Horák, J., Kluzniak, W., Rebusco, P.,\nClassical and Quantum Gravity, 2006, vol. 23, 5, pp. 1689-1696\nBarret, D., Olive, J.-F., & Miller, M. C. 2005a, MNRAS, 361, 855\nBarret, D., Olive, J.-F., & Miller, M. C. 2005b, Astronomical Notes, 326, 9, 808\nBarret, D., Olive, J., & Miller, M. C. 2006, MNRAS, 370, 1140\nBelloni,T., Psaltis, D., van der Klis, M., 2002, ApJ, 572, 392\nBelloni, T., Méndez, M., & Homan, J. 2005, A&A, 437, 209\nBelloni, T., Méndez, M., Homan, J., 2007, MNRAS, 379, 1, 247, e-print\narXiv:0705.0793\nBoirin, L., Barret, D., Olive, J., Bloser, P. F., & Grindlay, J. E. 2000\nBradt, H. V., Rothschild, R. E., & Swank, J. H. 1993, A&AS, 97, 355\nBursa, M. 2006, PhD thesis, Astronomical Institute, Charles University in Prague\nDi Salvo, T., Méndez, M., van der Klis, M. 2003, A&A, 406, 177\nFogelström, S., Levin, L., Slapak, R., 2008, PASJ Vol. 60 No. 3\nHorák, J. & Karas, V. 2006, A&A, 451, 377\nJahoda, K., Swank, J. H., Giles, A. B., Stark, M. J., Strohmayer, T., Zhang,\nW., & Morgan, E. H. 1996, Proc. SPIE 2808: EUV, X-ray, and Gamma-ray\nInstrumentation for Astronomy VII, p. 59.\n\nJonker, P. G., Méndez, M., van der Klis, M. 2002, MNRAS, 336, L1\nvan der Klis, M. 2000, ARA&A, 38, 717, astro-ph/0001167\nvan der Klis, M. 2006, in Compact Stellar X-Ray Sources, ed. W. H. G. Lewin &\nM. van der Klis (Cambridge: Cambridge University Press), 39–112; see also\nastro-ph/0410551\nKluźniak, W. & Abramowicz, M. A. 2001, submitted in Phys. Rev. Lett., astroph/0105057; see also W. Kluźniak, M. A. Abramowicz, 2001, Acta Physica\nPolonica B 32, 3605 [http://th-www.if.uj.edu.pl/acta/vol32/t11.htm]\nLamb, F. K. & Boutloukos, S. 2007, in Astrophysics and Space Science Library,\nVol. 352, Short-Period Binary Stars: Observations, Analyses, and Results, ed.\nE. F. Milone, D. A. Leahy, & D. Hobill (Dordrecht: Springer)\nMarkwardt, C.B., Strohmayer, T.E., Swank, J.H. 1999, ApJ, 512, L125\nMcClintock, J. E, & Remillard, R. A., 2003, astro-ph/0306213\nMéndez, M., van der Klis, M., Wijnands, R., Ford, E. C., van Paradijs, J.,\nVaughan, B. A., 1998a, ApJ, 505, L23\nMéndez, M., van der Klis,M., van Paradijs, J. 1998b, ApJ, 506, L117\nMéndez, M., van der Klis, M., van Paradijs, J., Lewin, W.H.G., Vaughan, B.A.\n1998c, ApJ, 494, L65\nMéndez, M., van der Klis, M. 1999, ApJ, 517, L51\nMéndez, M., van der Klis, M., Wijnands, R., Ford, E. C., van Paradijs, J., 1999,\nApJ, 511, L49\nMéndez, M., van der Klis, M., & Ford, E. C. 2001, Astrophys. J., 561, 1016\nMéndez, M. 2006, MNRAS, 371, 1925\nMigliari, S., van der Klis, M., Fender, R. 2003, MNRAS, 345, L35\nOlive, J., Barret, D., Gierlinski M., 2003, ApJ, 583, 416\nPsaltis, D., Mendez, M., Wijnands, R., et al. 1998, Astrophys. J. Lett., 501, L95\nPsaltis, D., Wijnands, R., Homan, J., Jonker, P., van der Klis, M., Miller,M.C.,\nLamb, F.K., Kuulkers, E., van Paradijs, J., Lewin, W.H.G. 1999a, ApJ, 520,\n763\nPsaltis, D., Belloni, T. van der Klis, M. 1999b, ApJ, 520, 262\nRebusco, P., PASJ, 56, 553\nvan Straaten, S., Ford, E. C., van der Klis, M., Méndez, M., Kaaret, P. 2000, ApJ,\n540, 1049\nvan Straaten, S., van der Klis, M., Di Salvo, T., & Belloni, T. 2002, Astrophys.\nJ., 568, 912\nvan Straaten, S., van der Klis, M., Méndez, M. 2003, ApJ, 596, 1155\nStella, L. & Vietri, M. 1999, Phys. Rev. Lett., 82, 17\nTörök, G., Bakala, P., Stuchlı́k, Z., Čech, P., 2008, Acta Astronomica, 58/1, pp.\n1–14\nZhang, C. M., Yin, H. X., Zhao, Y. H., Zhang, F., & Song, L. M. 2006, MNRAS,\n366, 1373\n\n\f"}