{"id": "http://arxiv.org/abs/0807.2493v1", "guidislink": true, "updated": "2008-07-16T14:47:41Z", "updated_parsed": [2008, 7, 16, 14, 47, 41, 2, 198, 0], "published": "2008-07-16T14:47:41Z", "published_parsed": [2008, 7, 16, 14, 47, 41, 2, 198, 0], "title": "Relativity of musical mood", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.0648%2C0807.1763%2C0807.2932%2C0807.3524%2C0807.4142%2C0807.2493%2C0807.5076%2C0807.1752%2C0807.0009%2C0807.0240%2C0807.1560%2C0807.3394%2C0807.5016%2C0807.3767%2C0807.4804%2C0807.1064%2C0807.1076%2C0807.3249%2C0807.1600%2C0807.1907%2C0807.3575%2C0807.4616%2C0807.3100%2C0807.0746%2C0807.4590%2C0807.4633%2C0807.3250%2C0807.0050%2C0807.2783%2C0807.3733%2C0807.3742%2C0807.4236%2C0807.4525%2C0807.0755%2C0807.2034%2C0807.3604%2C0807.0402%2C0807.4955%2C0807.2108%2C0807.1651%2C0807.1414%2C0807.0160%2C0807.3894%2C0807.3954%2C0807.2921%2C0807.3743%2C0807.2669%2C0807.4198%2C0807.2520%2C0807.1714%2C0807.3676%2C0807.3296%2C0807.0366%2C0807.4245%2C0807.1219%2C0807.3076%2C0807.2837%2C0807.2426%2C0807.3423%2C0807.3950%2C0807.2462%2C0807.2197%2C0807.4886%2C0807.2184%2C0807.3720%2C0807.0135%2C0807.4576%2C0807.1946%2C0807.4056%2C0807.2041%2C0807.2412%2C0807.0974%2C0807.0881%2C0807.1515%2C0807.3368%2C0807.2257%2C0807.4844%2C0807.3971%2C0807.0130%2C0807.3209%2C0807.1524%2C0807.1496%2C0807.3356%2C0807.0563%2C0807.1111%2C0807.4637%2C0807.3157%2C0807.4601%2C0807.5040%2C0807.2983%2C0807.0945%2C0807.4476%2C0807.1932%2C0807.2429%2C0807.4723%2C0807.1393%2C0807.3319%2C0807.0499%2C0807.2628%2C0807.5086%2C0807.4684&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Relativity of musical mood"}, "summary": "A combination of three or more tones played together is called a chord. In\nthe chromatic scale, chords which are consonant are of particular interest and\ncan be divided into several groups, two main ones being the major and minor\nchords. This paper shows that if three sounds are produced by three spatially\nseparated sources, a \"happy\" sounding major chord can be observed as its \"sad\"\nsounding counterpart depending on the observer's velocity - a consequence of\nthe well known Doppler effect. The analysis is further extended to show that\nalmost any triad may be observed by choosing an appropriate frame of reference,\nand several interesting symmetries, asymmetries and features of the system are\ndiscussed. Finally, the possibility of applications of this effect in the music\nperformance and creation in the context of \"interactive listener\" is discussed\nand suggestions for overcoming some technical difficulties are proposed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.0648%2C0807.1763%2C0807.2932%2C0807.3524%2C0807.4142%2C0807.2493%2C0807.5076%2C0807.1752%2C0807.0009%2C0807.0240%2C0807.1560%2C0807.3394%2C0807.5016%2C0807.3767%2C0807.4804%2C0807.1064%2C0807.1076%2C0807.3249%2C0807.1600%2C0807.1907%2C0807.3575%2C0807.4616%2C0807.3100%2C0807.0746%2C0807.4590%2C0807.4633%2C0807.3250%2C0807.0050%2C0807.2783%2C0807.3733%2C0807.3742%2C0807.4236%2C0807.4525%2C0807.0755%2C0807.2034%2C0807.3604%2C0807.0402%2C0807.4955%2C0807.2108%2C0807.1651%2C0807.1414%2C0807.0160%2C0807.3894%2C0807.3954%2C0807.2921%2C0807.3743%2C0807.2669%2C0807.4198%2C0807.2520%2C0807.1714%2C0807.3676%2C0807.3296%2C0807.0366%2C0807.4245%2C0807.1219%2C0807.3076%2C0807.2837%2C0807.2426%2C0807.3423%2C0807.3950%2C0807.2462%2C0807.2197%2C0807.4886%2C0807.2184%2C0807.3720%2C0807.0135%2C0807.4576%2C0807.1946%2C0807.4056%2C0807.2041%2C0807.2412%2C0807.0974%2C0807.0881%2C0807.1515%2C0807.3368%2C0807.2257%2C0807.4844%2C0807.3971%2C0807.0130%2C0807.3209%2C0807.1524%2C0807.1496%2C0807.3356%2C0807.0563%2C0807.1111%2C0807.4637%2C0807.3157%2C0807.4601%2C0807.5040%2C0807.2983%2C0807.0945%2C0807.4476%2C0807.1932%2C0807.2429%2C0807.4723%2C0807.1393%2C0807.3319%2C0807.0499%2C0807.2628%2C0807.5086%2C0807.4684&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A combination of three or more tones played together is called a chord. In\nthe chromatic scale, chords which are consonant are of particular interest and\ncan be divided into several groups, two main ones being the major and minor\nchords. This paper shows that if three sounds are produced by three spatially\nseparated sources, a \"happy\" sounding major chord can be observed as its \"sad\"\nsounding counterpart depending on the observer's velocity - a consequence of\nthe well known Doppler effect. The analysis is further extended to show that\nalmost any triad may be observed by choosing an appropriate frame of reference,\nand several interesting symmetries, asymmetries and features of the system are\ndiscussed. Finally, the possibility of applications of this effect in the music\nperformance and creation in the context of \"interactive listener\" is discussed\nand suggestions for overcoming some technical difficulties are proposed."}, "authors": ["Kaca Bradonjic"], "author_detail": {"name": "Kaca Bradonjic"}, "author": "Kaca Bradonjic", "arxiv_comment": "14 pages, 5 figures, revetex4, an earlier version has been submitted\n  to the American Journal of Physics on July 8, 2008", "links": [{"href": "http://arxiv.org/abs/0807.2493v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0807.2493v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.pop-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.pop-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "physics.gen-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0807.2493v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0807.2493v1", "journal_reference": null, "doi": null, "fulltext": "Relativity of musical mood\nKaća Bradonjić∗\nBoston University, Department of Physics, Boston, MA 02215\n(Dated: July 15, 2008)\n\narXiv:0807.2493v1 [physics.pop-ph] 16 Jul 2008\n\nAbstract\nA combination of three or more tones played together is called a chord. In the chromatic scale, chords\nwhich are consonant are of particular interest and can be divided into several groups, two main ones being\nthe major and minor chords. This paper shows that if three sounds are produced by three spatially separated\nsources, a \"happy\" sounding major chord can be observed as its \"sad\" sounding counterpart depending on\nthe observer's velocity - a consequence of the well known Doppler effect. The analysis is further extended\nto show that almost any triad may be observed by choosing an appropriate frame of reference, and several\ninteresting symmetries, asymmetries and features of the system are discussed. Finally, the possibility of\napplications of this effect in the music performance and creation in the context of \"interactive listener\" is\ndiscussed and suggestions for overcoming some technical difficulties are proposed.\nPACS numbers: 47.35.Rs, 43.75.+a, 43.28.-g\n\n1\n\n\fI.\n\nINTRODUCTION\n\nLast 30 years have seen a rich development of the theory of music. Numerous books and\npapers have been published aiming to classify musical objects, their relations and transformations,\nsometimes in very mathematically complex ways. Some of that work focusing specifically on groups\nof three tones, or triads, deals with what are called triadic transformation and is part of a larger\ntransformational theory 1,2 . For a simple treatment of some such transformations one can consult\nHarkleroad3 . The aim of this paper is comparatively modest. Although a rich theory of triad\ntransformations has been developed, and the Doppler effect has been taught to high-school students\nfor decades, no one has attempted to put the two together in an applicable way. A lone paper by\nA. T. Wilson4 relates relativistic rapidity to an analogue of musical pitch in the case of electromagnetic radiation with a formalism somewhat similar to ours. However, no thorough attempt has\nbeen made to investigate the three-dimensional Doppler effect in presence of multiple sources and\nits application to music. It is known that certain triads sound \"happy\", while others sound \"sad\".\nWhy this is so has been a question on minds of many musicologists, composers, musicians and\nmusic lovers for a very long time and theories have been put forward. References to some works in\nthis area can be found in the recent book by Loy5 . But the question of \"Why?\" is beyond the scope\nof this work. In this paper, we simply show that under specific physical conditions, a chord sounds\nhappy or sad depending not only on the observer's subjective interpretation, but also on his frame\nof reference. In other words, the musical \"mood\" depends on the observer's state of motion. In\nthe second section, we review sound and the Doppler effect in one and two dimensions. The third\nsection contains an overview of the definitions and properties of tones used in the Western music,\n(which is the type we are considering), and some general mathematical features of the chromatic\nscale. Chords and their classifications are also introduced in this section. In section IV , we develop\na formalism, including a notion of a triad space and transformations in this space necessary for\nour analysis of how the Doppler effect affects the observation of a triad. Finally, in sections V and\nV I we show how the \"mood\" of the detected chord depends on frame of reference of the observer\nand how in fact any chord can be detected in an appropriate frame. Some interesting frames of\nreference as well as their symmetries are also discussed. The paper concludes with a discussion of\npossibilities this effect opens for musical performance and listening.\nII.\n\nSOUND AND THE DOPPLER EFFECT\n\nSound waves are essentially pressure waves traveling through an elastic medium. A sound\nproduced by a single source travels in all directions. Point sources produce spherical wavefronts.\nA sound wave is characterized by three key quantities: wavelength λ, frequency f , and the speed\nof propagation vs . These three quantities are related by the expression\nvs = λf.\n\n(1)\n\nWhile the speed and wavelength of a sound wave depend on the medium through which the\nwave travels, the frequency depends exclusively on the rate of vibration of the source which is\nproducing the sound.\nIn the late 1842, Christian Doppler6 suggested that the observed frequency of a wave depends\non the motion of the source and the observer relative to a stationary medium. This effect, which\n2\n\n\fapplies to both sound and light waves, was named the \"Doppler effect\" and was soon experimentally\nconfirmed in the case of sound. We imagine that the observer carries a coordinate system with\nhim wherever he goes, and we call this coordinate system observer's frame of reference. We will\nconsider only inertial frames of reference which are moving at constant velocities. If a sound of\nfrequency fe is emitted by a source moving at speed ve and the observer is moving at speed vo ,\nboth relative to the stationary medium, the observed frequency fo depends on ve and vo according\nto5\nfo = fe\n\nvs + vo\n,\nvs − ve\n\n(2)\n\nwhere vs is speed of sound, and signs of vo and ve both depend on their directions: positive if the\nobserver (source) is approaching the source (observer), and negative otherwise. Note that if ~vo = ~ve\nand the observer is \"chasing\" the source, then the source is \"running away\" from the observer so\nvo and ve in Eq. (2) have opposite signs. As a result, the fraction multiplying fe is equal to unity\nand there is no shift in the observed frequency, just as we would expect. For a source at rest, which\nis the case we shall consider, ve = 0 and the Eq. (2) becomes\nfo = fe\n\nvs ± vo\n.\nvs\n\n(3)\n\nThe plus (minus) sign is used if the observer is moving towards (away) from the source. This is the\none-dimensional form of the Doppler effect - the source is moving along a straight line connecting\nhim to the source. In two dimensions, things are a bit more complicated. If the observer is moving\nin an arbitrary direction, only the velocity component that is perpendicular to the wave front of\nthe sound wave will cause a shift in the observed frequency. For a plane wave, such as the one\ndepicted in Fig. 1, the Doppler effect has form\nfo = fe\n\nvs − vo cosφ\n,\nvs\n\n(4)\n\nwhere φ is the angle between observer's velocity and the direction of propagation of the sound.\nIf the wave fronts are indeed spherical and the motion is not along a straight line connecting the\nsource and the observer, then the angle will be time dependent. In a case where both the observer\nand the source are moving, Eq. (4) has an even more general form.\nIII.\n\nMUSICAL MATH AND VOCABULARY\n\nTwo references that contain thorough reviews of musical objects and their mathematical relations are the famous book by Helmholtz7 , as well as the recent book by Loy5 and most of what\nis in this section was found there. Here, we only review what is needed for the purpose of our\ndiscussion.\nA.\n\nScales and tones\n\nIn the Western common music notation system, a tone is characterized by its pitch, musical\nloudness, and timbre. Whilefrequency is a measure of number of vibrations per second, pitch\n3\n\n\fFIG. 1: Only vo cos(φ), the velocity component perpendicular to the wavefront, contributes to the Doppler\neffect in two dimensions.\n\nis the corresponding perceptual experience of frequency5 . Since our goal is to show that observed\nshifts in frequency result in the perception of a modified musical object, it is crucial for our purpose\nthat frequency and pitch be directly related. So we shall use the two terms interchangeably. A\nsequence of pitches and a formula for specifying their frequencies is called a scale. A scale is\nusually divided into octaves which contain specific pitches called degrees. An interval is the\nratio between frequencies of two tones. We consider the tones of so called chromatic scale. The\n1\nchromatic scale consists of tones whose neighboring frequencies differ by a power of 2 12 , or a\nsemitone. The tones of this scale are grouped into octaves of 12 degrees. Frequency f = 440Hz\nis chosen as a reference, and all the other frequencies are found by multiplying 440Hz by a power\n1\nof 2 12 ,\nn\n\nf = 440 * 2 12 Hz,\n\nn = 0, ±1, ±2, ±3, ...\n\n(5)\n\nTones of the chromatic scale are labeled by the letters of the alphabet A through G and symbols\n1\n♯ and ♭. Symbol \"♯\" denotes a power of 2 12 increase in frequency from the letter it follows, while\n1\n\"♭\" indicates a power of 2 12 decrease in frequency from the letter it follows. Hence, in this notation\nC♯ is the same as D♭. Octaves of the chromatic scale traditionally begin at C, and each tone is\nlabeled with a number that indicates which octave it belongs to. The tones in Table I belong to\nthe 4th octave and C is more specifically called C4 or middle C. However, as this is the most\ncommonly used octave, its tones are for simplicity denoted without the label \"4\". The next octave\nup begins with C5 , and so on.\nTone\nC\nC♯\nD\nD♯\nE\nF\nF♯\nf (Hz) 264.626 277.183 293.665 311.127 329.628 349.228 369.994\nTone\nG\nG♯\nA\nA♯\nB\nC5\nC5♯\nf (Hz) 391.995 415.305\n440\n466.164 493.883 523.251 554.365\nTABLE I: Some tones and their frequencies in the chromatic scale with fA = 440Hz picked as a reference\nfrequency.\n\nAn alternative representation of the order of tones in the chromatic scale is the commonly used\n\"wheel\" pictured in Fig. 2. One should not be thrown off by the fact that F and C in Fig. 2 and\n4\n\n\fTable I are in the places where one would expect E♯ and B♯. This is just a question of notation.\nThe important part is that the neighboring tones of the chromatic scale are a semitone apart,\nregardless of their labeling.\n\nFIG. 2: The wheel of the chromatic scale is divided into 12 slices, two neighboring slices differing in frequency\n1\nby a power of 2 12 . Chromatic scale progresses in the clockwise direction on the wheel.\n\nOther common kinds of scales are the diatonic major and diatonic minor. They both contain\neight pitches, and their relation to each other and the chromatic scale within a single octave can\nbe found in Table II. A scale is said to be in the key of the tone it begins with. Table II shows\nNo. of 21 -tones above the initial 0 1\nChromatic\nC C♯\nDiatonic C major\nC\nDiatonic C minor\nC\n\n2 3 4 5 6 7 8 9 10 11 12\nD D♯ E F F ♯ G G♯ A A♯ B C5\nD\nE F\nG\nA\nB C5\nD D♯\nF\nG G♯\nA♯\nC5\n\nTABLE II: The chromatic, diatonic major and diatonic minor scales in the key of C.\n\nthe diatonic major and minor scales in the key of C, also called the C major and C minor scales.\nAs one can see, the tones of the C major scale are all labeled only by letters, and no ♯'s and ♭'s.\nThis is where the somewhat confusing notation in the chromatic scale originates from.\nB.\n\nChords\n\nThree or more tones played simultaneously is called a chord. We will deal with chords consisting\nof three tones, or triads. The lowest tone in a triad is called a bass tone. An interval of two pitches\nis said to be consonant if the two pitches sound pleasant when played together. Otherwise, it is\ncalled dissonant. A chord is said to be concord if the intervals of all the tones in that chord are\nconsonant. There are several types of triads, only two of which we will consider: major and minor.\nOne should not confuse the major and minor triads with the major and minor scales, although\nthere is a relation between the two. For that reason, \"major\" and \"minor\" will be italicized when\nthey refer to a chord, unless it is obvious what is being talked about.\n\n5\n\n\fTo get a triad within a single octave, one starts from any one tone, called the root of a triad,\nand picks two others. To obtain a major triad, one starts at the root and picks tones that are\n4 and 7 semitones above the root (clockwise in Fig. 2). A minor chord consists of the root, and\ntones 3 and 7 semitones above the root. If in the process one reaches the end of the octave and\nfinds the third tone after completing a circle, then the root of the triad is not the the same as the\nbass of the triad, and the chord is said to be an inversion. For instance, EGC and GCE are the\ninversions of CEG (note the cyclic order.) The chord is named after its root and it is indicated\nwhether it is a major or a minor, depending on the separation of its constituent tones (0-4-7 or\n0-3-7 semitones apart). Typically, a major chord is labeled simply by the symbol of its root, while\na minor chord by the symbol of its root and the letter \"m\". Additional notation can be added to\nindicate whether the chord is an inversion.\nWe look at some examples. The chords of the C major scale can be found by consulting Table II.\nBeginning with C, we move 4 semitones to the right, where sits E, and then 3 more semitones\nover to G. CEG is a hence a C major (simply denoted by C). If one starts at D, there is nothing\n4 semitones to the right, but there is a tone 3 semitones away, namely F , followed by A which\nis 4 semitones further. So we get DF A by picking a tone at 0, 3, and 7 semitones away from D,\nwhich makes DF A a D minor (or just Dm). One can continue on like this for all the tones of the\nC major scale and the same procedure can be done within the C minor scale. Furthermore, one\ncan consider all other major and minor scales, those beginning with C♯, D, D♯, etc. During this\nprocess, one finds that not all the roots will yield a major or a minor triad, but that other kinds\nof triads have to be considered, such as, for example, diminished triad whose elements are 0-3-6\nsemitones apart from the root. A list of triads acquired by this procedure from C major and C\nminor scales can be found in Table III.\nC major scale\nCEG(C)\nDF A (Dm)\nEGB (Em)\nF AC (F )\nGBD (G)\nACE (Am)\nBDF (B dim.)\n\nC minor scale\nCE♭G (Cm)\nDF A♭ (D dim.)\nD♯GA♯ (D♯)\nF G♯C (F m)\nGA♯D (Gm)\nG♯CD♯ (G♯)\nA♯DF (A♯)\n\nTABLE III: All the triads and inversions found within a single octave of the C major and C minor scales.\n\nMajor and minor chords are all concord. Needless to say, consonance is somewhat of a subjective\nquality, perhaps rooted in our biology. There are theories on why some combinations of tones sound\nbetter, more pleasing, than the others, details of which are beyond the scope of this paper. It is\nworthy of mention that consonance of two tones seems to be related to the ratio of their frequencies.\nFor a nice physical explanation, reader can consult Feynman8 . In addition, major chords have been\ntermed happy and minor chords sad for their perceived emotional character. We will see that in the\ncase where three sound waves are traveling in different directions, the \"mood\" of a consonant chord,\nand even consonance itself, depends not only on the subjective perception and interpretation of the\nobserver, but also on his motion relative to the source. Next, we develop the formalism necessary\nfor our analysis.\n6\n\n\fIV.\n\nTHE TRIAD SPACE\n\nLet there be three sources of sound Sx , Sy , and Sz located on the negative halves of the x, y,\nand z axes of the Cartesian coordinate system respectively. We require that the sources are far\nenough from the origin so that the the three sound waves in the region around (0, 0, 0) look like\nplane waves propagating in x̂, ŷ, and ẑ directions, in that order. Figure 3 shows the region of\ninterest in two dimensions.\n\nFIG. 3: In two dimensions, radially propagating waves produced by sources situated on the negative sides of\nx and y axes far enough from the origin, can be approximated by plane waves in the neighborhood of (0, 0).\nThe same approximation can be made in three dimensions, where we add one more source on the negative\nz axis.\n\nWe take the speed of sound to be vs = 343 ms , an approximate value of its speed in air under\nthe STP conditions. An \"observer\" O is a person, or a recording instrument, located in the small\nregion near the origin, and capable of detecting sounds coming from all three spatial directions.\nThe observer O can be either at rest, or moving relative to the sources with velocity ~v .\nNext, we define a three-dimensional triad space T , points of which are all possible triads f\nlabeled by three frequencies f1 , f2 , and f3 . Points of T are denoted by bold letters, while their\ncomponents with the regular font. Each point f ∈ T can be represented by a matrix\n \nf1\n \nf = f2  .\n(6)\nf3\nSince an observer hears three tones of a triad played simultaneously, he has no way of telling\nwhether he is hearing a particular triad, its inversion, or any other combination of the same three\ntones. As a result, our formalism allows for multiple matrices representing the same triad and its\ninversions. The consequences of this multiplicity will become apparent in the upcoming analysis.\nIf we pick a single reference triad fe , then all the other points in T can be found from the\nrelation\n    n1 \n n1\nfe1\n2 12 fe1\n0\n2 12 0\nn2\n    n2 \n\nni ∈ R,\n(7)\nf = Λfe =  0 2 12 0  fe2  = 2 12 fe2 \nn3\nn3\nfe3\n0\n0 2 12\n2 12 fe3\n7\n\n\f1\n\nwhere factor of 2 12 was chosen for a later convenience, and i = 1, 2, 3 for the rest of the paper.\nThe 3 × 3 matrix Λ is a transformation which takes us from the reference triad fe to any other\npoint in T . It is completely specified by three values ni . Since values of ni 's are real numbers, we\nhave a continuous spectrum of triads.\nIf we identify the reference triad (fe1 , fe2 , fe3 ) with the triad of tones emitted by the sources\nSx , Sy , and Sz , in that order, then taking into account the Doppler effect, the observed triad can\npresumably be found in T . Which f it will be, depends on the observer's velocity ~v . Adapting\nEq. (3) to three dimensions, we find that the observed triad is related to the emitted triad by\n\u0011 \n\u0010\n\n \n~v*x̂\n1\n−\n~\nv *x̂\nvs \u0011 fe1 \n0\n0\n1 − vs\nfe1\n\u0010\n\n\n\n\n\n\n(8)\nf = Dfe =  0\n1 − ~vv*ŷs\n0  fe2  =  1 − ~vv*ŷs fe2  .\n\u0011 \n\u0010\n~v *ẑ\nfe3\n0\n0\n1 − vs\n1 − ~vv*ẑs fe3\nThe 3 × 3 matrix D is a transformation specified by three components of the observer O's velocity\n~v . When acting on the reference triad (which we identified as triad emitted by the sources), D\ntakes fe into a triad whose elements are equal to those observed by O. Comparing Eqs. (7) and\n(8), we see that the Λ and D are equivalent if\nni\n\nvi = (1 − 2 12 )vs .\n\n(9)\n\nThe velocity components take on label i whose values 1, 2, and 3 correspond to the x, y and z\ncomponents, in that order.\nAs it is defined, our space is continuous. But we are only interested in frequencies of the\nchromatic scale, so we chose fe such that its elements are members of this scale. Since the smallest\n1\nratio of two frequencies in the chromatic scale is 2 12 , only triads we want to consider are those\n1\nwhose elements differ from elements of fe by the integer power of 2 12 . In our formalism, that\nis equivalent to restricting ni 's in Eq. (7) to integer values. This restriction on frequencies also\nrestricts the velocities at which observers can move and still detect frequencies of the chromatic\nscale. We call these velocities \"allowed\" velocities, and they are given by Eq. (9), with ni 's now\nrestricted to integer values. Equation (9) takes care of the direction of the observer's velocity as\nwell. If, for example, f1 > fe1 , then n1 > 0 and we expect O to be moving towards the stationary\n1\nsource (in the negative x direction). Since 2 12 > 1, we see from Eq. (9) that this corresponds\nto a negative velocity component, just as we expect. Figure 4 shows the plot of vi vs. ni for\nboth the continuous and the discrete spectrum of ni . We see that vi asymptotically approaches\nvs as ni → −∞. Curiously enough, going in the other direction vi reaches the speed of sound at\nexactly ni = 12, or an octave up. There are physical limitations on the range of the ni 's. Only a\nsmall range of frequencies is audible to the human ear, and we want to consider only those audible\nfrequencies. Values of ni 's depend on these limits, as well as the choice of the reference triad.\nV.\n\nRELATIVITY OF THE MUSICAL CONSONANCE AND MOOD\n\nWe begin by showing that a happy triad can be detected as its sad counterpart. Suppose that\nour three sources are simultaneously emitting C, E, and G, tones of the happy C major, so that\nthe reference triad has components with the corresponding frequencies fC , fE , and fG in that\n8\n\n\f\u0001\non parameter ni for both continuous and the discrete\nFIG. 4: Dependence of a velocity component vi m\ns\nspectrum of ni . vi asymptotically approaches vs as ni decreases and is equal to −vs at ni = 12.\n\norder. Now we ask a question: at what velocity ~v does the observer O have to move so that he\ndetects C, E♭ and G, elements of the sad sounding Cm? The simplest answer is found by solving\nthe following equation for ni 's and then finding the appropriate velocity components:\n   n1 \nfC\n2 12 fC\n   n2 \n(10)\nfE♭  = 2 12 fE  .\nn3\nfG\n2 12 fG\nWe see that n1 and n3 are obviously zero, as those frequencies remain the same. Since fE♭ is half a\ntone bellow fE , n2 =-1. Plugging these values into Eq. (9), we find that the corresponding velocity\nis ~v = 19.251 ms ŷ. So if the sources are emitting C, E, and G, an observer O0 situated around the\norigin and at rest with respect to the origin will detect or hear a C major. An observer O moving\nwith velocity ~v = 19.251 ms ŷ will observe a C minor. This ~v , however, is not the only solution. We\ncould also pick an observer O′ who is moving with the velocity ~v ′ leading to the transformation\n ′ \nn1\n \nfG\n2 12′ fC \n   n2 \n(11)\nfE♭  = 2 12 fE  .\n n′ \n3\nfC\n2 12 fG\nNote the swap of C and G on the left hand side. Consulting Table II, we see that the solution is\nn′1 = 7, n′2 = −1 and n′3 = −7. Looking at all the combinations which give the elements of Cm, we\nsee that there are 3! in all, equal to the number of permutations of the three values. Table IV shows\nall the values of ni 's for which the observer hears the same triad. While the first, the third and\nthe fifth triad in Table IV are the Cm and its inversions, the rest are remaining permutations of\nthe tones. If the observer is capable of distinguishing which direction individual tones are coming\n9\n\n\ffrom, then he is capable in distinguishing between all six combinations. For simplicity, we assume\nthat is not the case.\nIt is interesting to note that the ni 's in each row of Table IV add up to the net number of powers\n1\nof 2 12 by which the two chords differ. A similar procedure will show that if C m triad is emitted,\nObserved triad n1 n2 n3 n1 +n2 +n3\nCE♭G\n0 -1 0\n-1\nCGE♭\n0 3 -4\n-1\nE♭GC\n3 3 -7\n-1\nE♭CG\n3 -4 0\n-1\nGCE♭\n7 -4 -4\n-1\nGE♭C\n7 -1 -7\n-1\nTABLE IV: Values of ni 's for which the same chord is observed if CEG is played, with fe1 = fC , fe2 = fE ,\nand fe3 = fG .\n\nthe observer will detect C major if he is in a frame of reference which moves with ~v = −20.396 ms ŷ\nrelative to the origin. So it also the case that a sad chord can be detected as its emitted happy\ncounterpart. One can say that there is a relativity of the musical \"mood.\"\nVI.\n\nOBSERVER DEPENDENT CHORDS\n\nIt is clear now that, by picking a \"right\" frame of reference, any chord can be detected, within\nthe limits imposed on the integers ni . To investigate this possibility further, suppose that the\nsources are emitting identical tones A of frequency fA = 440Hz. Since we are interested in the\nrange of the chromatic scale, and the lower limit of the audible spectrum is around 20Hz, we\nchoose the lower limit of the scale at A0 of frequency fA0 = 27.5Hz. This gives us a lower bound\non values of ni 's of ni(min) = −48, corresponding to a shift of four octaves down from A. We chose\nthe upper limit to be C8 of frequency fC8 = 4186.01Hz, which is equivalent to the ni(max) = 87.\nHowever, a problem arises. As it can be seen in Fig. 4, the observer reaches speed of sound at\nni = 12. If we want to avoid sonic booms, we had better limit the positive values of ni 's to 12 or\nless (even though there may be some issues at n = 12). This means that possible observable tones\nwill be one ore more octaves bellow and only one octave above the emitted frequency, whatever fe\nmay be. The asymmetry in the lower and the upper bounds on ni 's comes from the power law on\nwhich the chromatic scale is built. Figure 5 shows how velocities are related to the frequencies of\nthe chromatic scale for the case of fe1 = fA .\nValues of ni 's and the corresponding velocities leading to the observation of the specific tones\nin this physical situation are listed in Table V. Since the audibility of a tone depends also on\nthe intensity, and the intensity differs widely for a range of frequencies such as the one we are\nconsidering, it is important to assume that the intensity of the emitted sounds is high enough or\ncan be adjusted so that all the tones between A0 and A5 can, in principle, be either directly heard,\nor recorded and listened to at some later time. Also, due to the interference of the three waves,\nthere will be locations where the sounds destructively interfere. We assume that O is located only\nin those regions where all three tones can be heard.\n10\n\n\fFIG. 5: Velocity component magnitudes necessary for the observation of a frequency of the chromatic scale\nfor emitted frequency fA .\n\nTone\nA0\nA1\nA2\nA3\nC\nC♯\nD\nD♯\nE\n\nni\n-48\n-36\n-24\n-12\n-9\n-8\n-7\n-6\n-5\n\nvi /vs Tone ni vi /vs Tone ni vi /vs\n0.938 F\n-4 0.206 C5♯ 5 -0.335\n0.875 F ♯ -3 0.159 D5♯ 6 -0.414\n-2 0.109 D5 7 -0.498\n0.750 G\n0.500 G♯ -1 0.056 E5 8 -0.587\n0\n0\nF 5 9 -0.682\n0.405 A\n1 -0.059 F 5♯ 10 -0.782\n0.370 A♯\n2 -0.123 G5 11 -0.888\n0.333 B\n-1\n0.293 C5 3 -0.189 A5 12\n0.251 C5♯ 4 -0.260\n\nTABLE V: Tones, corresponding ni values, and velocities needed to observe the respective tones when the\nemitted frequency is fA = 440Hz. The velocities are given in units of speed of sound vs = 343 m\ns .\n\nThe list of ni 's and vi 's leading to observation of various triads is shown in Table VI. We see\nthat in order for the observer to detect the triad C, he has to be moving at the velocity specified\nby numbers n1 = −9, n2 = −5, and n3 = −2. Similarly, the observer will detect Cm if in a\nframe specified by n1 = −9, n2 = −6, and n3 = −2. The multiplicity in possible values of ni 's\nTriad\nC\nCm\nF\nFm\nG\nGm\n\nn1\n-9\n-9\n-4\n-4\n-2\n-2\n\nn2\n-5\n-6\n0\n-1\n2\n1\n\nn3\n-2\n-2\n-9\n-9\n-7\n-7\n\nv1 ( m\ns )\n139.05\n139.05\n70.761\n70.761\n37.42\n37.42\n\nv2 ( m\ns )\n86.04\n100.46\n0\n19.25\n-42.00\n-20.40\n\nv3 ( m\ns )\n37.42\n37.42\n139.05\n139.05\n114.08\n114.08\n\nTABLE VI: One of six combinations of ni 's and the respective, approximate vi 's necessary for the observer\nto detect the major and minor triads of the C major and C minor scales when all the emitted frequencies\nare fA .\n\nwhich transform fe into a same triad is still present, though a bit simpler. Since the three emitted\ntones have the same frequency, swapping any two values of ni , or components of ~v , gives the same\n11\n\n\ftriad. We still have 3! combinations of ni 's that lead to the same observation, but now the values\nof ni 's do not change for different combinations - they are only swapped around. In terms of our\ncoordinate system, this means that any transformation of the coordinate axes into each other,\nwhile preserving their positive directions, leaves our formalism the same.\nAn interesting frame of reference is the one whose velocity ~vT has all components of the same\nmagnitude. In this frame, observer OT detects all the frequencies shifted by the same amount,\nwhich is in theory of music known as a transposition. If numbers ni specifying ~vT are integer\nmultiples of 12, ni = 12m, m = 0, ±1, −2, −3, ... then the observers in those frames detect triads\nthat are octave equivalent of the emitted triad. For example, if m = −1, the three emitted\nA's would be detected as A3's. The trajectory of such an observer is any path parallel to a line\ndescribed by\n~r = t(x̂ + ŷ + ẑ),\n\nfor − ∞ < t < ∞,\n\n(12)\n\nso as long as it remains in the region in which the plane wave approximation holds. (Note that\ndue to our limitation on ni 's, one would need emitted frequencies to be higher than A in order to\nbe able to detect anything higher than A5.)\nAt first sight it may seem that adding ~vT to the velocity ~v of an observer would result in O\ndetecting the allowed transposition of the triad detected at ~v . That, however is not the case. Since\nvi 's depend non-linearly on ni 's, adding two allowed velocities does not in general result in an\nallowed velocity because\nn′i\n\nni\n\nmi\n\nvi + vi′ = vs (1 − 2 12 + 1 − 2 12 ) 6= vs (1 − 2 12 ), for mi = 0, ±1, ±2, ...\n\n(13)\n\nComponents of a velocity that can be added to ~v in any one, or all directions, are\npi\n\nni\n\nui = (1 − 2 12 )2 12 ,\n\nfor − (48 + ni ) ≤ pi ≤ (12 − ni ),\n\n(14)\n\nwhere given lower limits on pi 's apply to the case when the elements of fe are all fA . In general,\nthey depend on the emitted frequencies and the audibility threshold. In a vector notation, we have\np1\n\nn1\n\np2\n\nn2\n\np3\n\nn3\n\n~u = (1 − 2 12 )(2 12 )x̂ + (1 − 2 12 )(2 12 )ŷ + (1 − 2 12 )(2 12 )ẑ.\n\n(15)\n\nOne can check that a sum of any velocity of form specified in Eq. (9) (with ni 's restricted to\nintegers) and ~u is itself an allowed velocity. Note that what this operation essentially does is\n\"cancel\" the effects specified by ni and replaces them with effects specified by (pi + ni ). Depending\non ni , given value of pi will either increase or decrease the observed fi , so there is no need to\nsubtract ui from vi . In fact, if we did that, we would find that it can be meaningfully done only in\nthe case of pi = 12 in which case the frequency is shifted up by an octave and ~v ′ = −vs . The value\npi = 0 corresponds to adding a zero velocity.\nIf an observer O moving with velocity ~v observes a triad f , then the observer O′ moving at\n′\n~v = ~v + ~u will observe f ′ that is a transposition of f by p semitones if p1 = p2 = p3 = p. In the\ncase of p1 + n1 = p2 + n2 = p3 + n3 = l, the observed triad will be a transposition of the emitted\ntriad fe by l semitones. Otherwise, the addition will result in the observation of a non-transposition\nof either f or fe , and its elements will depend on pi 's.\n\n12\n\n\fVII.\n\nCONCLUSIONS AND SOME THOUGHTS ON A CREATIVE OBSERVER\n\nWe saw that if three tones of a major chord are played from three different locations, the\nperception or observation of the chord depends on the observer's frame of reference. In order that\nfrequencies of the chromatic scale be observed, certain restrictions were placed on observer's velocity\nand a framework within which one can determine what velocities are allowed was developed. We\nhave shown that there is sort of a relativity of the musical mood and how to go from a happy\nreference frame to a sad one by choosing appropriate velocity for the observer. The physical\nsituation described in section IV and the subsequent analysis is a rough approximation and it holds\nonly in the region where the three sound waves can be approximated by plane waves traveling in\nx̂, ŷ, and ẑ directions. A more general analysis could be done where one takes into account the\nspherical nature of the waves. In this case, the observer is free to move anywhere in space, and\nallowed velocities are position dependent and determined by the location of the sources.\nBesides being a neat application of the Doppler effect, the triad dependence on the observer's\nframe of reference yields some interesting possibilities in the realm of musical performance and\nlistening. Doppler shifts have been used in practice by creating musical pieces with sound-emitting\nmobile phones swung on strings9 . The Doppler effect was also noted in a massive \"concert on bicycles\" where an audience of riding cyclists was listening to a radio broadcast from units positioned\non moving bikes10 . Although these cases involved a moving source rather than a moving observer,\nthe principle is the same.\nIdea of interactive music in video games, where the audio content of a game depends on the\nactions of the player has drawn a lot of attention in recent years and some work has been done on\nthe subject11 . Reference frame dependence of the triad can take the possibility of the interactive\nlistener out of the virtual world and into the physical reality. Multiple projects in the realm of\ninteractive observer/listener/composer are being conducted at the MIT Media Lab by Machover12 ,\nParadiso13,14 , as well as others15 . Our analysis deals with observers in different reference frames.\nHowever, if the observer were allowed to change his velocity and was able to do that in a short\nenough time, he would observe a sequence of shifts of the emitted triads, hence actively participating\nin his listening experience of a simple chord or a more complex musical piece. A technical problem\nwith the applicability of the triad frame dependence arises due to the high velocities necessary to\nachieve a wide enough spectrum of observed sounds. One alternative is to leave the listener at rest,\nbut give him a control over the motion of the sources along the axes on which they are situated.\nHowever, as it can be seen from Eq. (2), this would require a different formalism than the one\npresented because the Doppler effect for sound is different depending on whether the observer is\nmoving while the source is at rest, or it is the other way around16 .\nAlso, an intermediary recording instrument capable of moving at high speeds could be constructed so that it can be controlled by the listener. The listener could then change the motion\nof the intermediary device in real time, hence actively participating in his listening experience.\nAnother interesting option is to place the intermediary device in an isolated environment in which\ndensity, temperature and pressure of air could be adjusted during the listening so that the speed\nof sound, and hence all the allowed speeds, would be lower.\nSince the Doppler effects have been used in the computer generated music, the first step in\ndevelopment of something of this kind would be a creation of a computer simulation which models\nthe situation we analyzed using the presented parameters, and enables the listener to control the\nmotion of an intermediary virtual device relative to the virtual sources.\n13\n\n\fAs for the application to the musical composition, one could write \"path dependent\" pieces,\nexperience of which varies with the composer-prescribed paths that are to be traveled by the\nobserver who is, over the course of the performance, moving at non-zero velocity and occasionally\nbriefly accelerates in order to switch to different reference frames.\nAcknowledgments\n\nI'd like to thank Kipton Barros and John Swain for reading the earlier drafts of this paper, as\nwell as their insightful comments.\n\n∗\n1\n2\n\n3\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n11\n\n12\n13\n\n14\n15\n\n16\n\nElectronic address: kacha@physics.bu.edu\nJulian Hook, \"Uniform Triadic Transformations,\" J. of Music Theory, 46(1), 57-126 (2002).\nRichard Cohn, \"Neo-Riemannian Operations, Parsimonious Trichords, and Their 'Tonnetz' Representations,\" J. of Music Theory, 41(1), 1-66 (1997).\nLeon Harkleroad, The Math Behind the Music (Cambridge University Press, New York, NY, 2007), p.33.\nAlma T. Wilson, \"Relativistic rapidity as change in musical pitch,\"\n<http://lanl.arxiv.org/pdf/0706.3247>.\nGareth Loy, Musimathics: The Mathematical Foundations of Music, Volume 1, (MIT Press: Cambridge,\nMA, 2006).\nPeter M. Schuster, Moving the Stars: His Life, His Works and Principle; Christian Doppler and the\nWorld After, Tran. by Wilmes, L. (Pöllauberg, Austria: Living Edition, 2005).\nHermann Helmholtz, On the Sensations of Tone as a Physiological Basis for the Theory of Music (Dover\nPublications, New York, NY 1954).\nRichard P. Feynman, Robert B. Leighton and Matthew L. Sands, The Feynman Lectures of Physics,\nVolume 1, (Addison-Wesley Publishing Company: Reading, MA, 1989).\nGreg Schiemer and Mark Havryliv, \"Pocket Gamelan: interactive mobile music performance,\" in Proceedings of Mobility Conference 2007: The 4th International Conference on Mobile Technology, Applications\nand Systems: IS-CHI 2007, edited by A.D. Cheok, P. H. Chong, W. Sheah, and S. Ping, S. (Research\nPublishing, Singapore, 2007), p. 716-719.\nGreg Schiemer, \"Interactive Radio,\" Leonardo Music Journal, 4, 17-22 (1994).\nDavid Lieberman, \"Game enhanced music manuscript,\" in Proceedings of the 4th international Conference on Computer Graphics and interactive Techniques in Australasia and Southeast Asia GRAPHITE\n'06(ACM, New York, NY, 2006), p. 245-498.\nResearch web page of Tod Machover, <http://www.media.mit.edu/research/35>.\nMark Feldmeier and Joseph A. Paradiso, \"An Interactive Environment For Large Groups With Giveaway\nWireless Motion Sensors,\" Computer Music Journal, 31(1), 68-93 (2007).\nResearch web page of Joseph A. Paradiso, <http://www.media.mit.edu/resenv/>.\nHenry Newton-Dunn, Hiroaki Nakano, and James Gibson, \"Block Jam: A Tangible Interface for Interactive Music\" Proceedings of the 2003 Conference on New Interfaces for Musical Expression (NIME-03),\nMontreal, Canada, 170-177.\nKevin Brown, Reflections on Relativity (Mathpages.com, 1999), WWW Document,\n<http://www.mathpages.com/rr/rrtoc.htm>.\n\n14\n\n\f"}