{"id": "http://arxiv.org/abs/0805.3459v2", "guidislink": true, "updated": "2009-05-01T11:39:18Z", "updated_parsed": [2009, 5, 1, 11, 39, 18, 4, 121, 0], "published": "2008-05-22T13:24:43Z", "published_parsed": [2008, 5, 22, 13, 24, 43, 3, 143, 0], "title": "Relative clustering and the joint halo occupation distribution of\n  red-sequence and blue-cloud galaxies in COMBO-17", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0805.3534%2C0805.4166%2C0805.4115%2C0805.0676%2C0805.2180%2C0805.3740%2C0805.0945%2C0805.0643%2C0805.3820%2C0805.1514%2C0805.0032%2C0805.0625%2C0805.4225%2C0805.4572%2C0805.0808%2C0805.4091%2C0805.4642%2C0805.2876%2C0805.0251%2C0805.1481%2C0805.0629%2C0805.4480%2C0805.1330%2C0805.4482%2C0805.1589%2C0805.3045%2C0805.0372%2C0805.4457%2C0805.4297%2C0805.3894%2C0805.1799%2C0805.1476%2C0805.0481%2C0805.1031%2C0805.2560%2C0805.2539%2C0805.3424%2C0805.2185%2C0805.1130%2C0805.0195%2C0805.2958%2C0805.1635%2C0805.4217%2C0805.2376%2C0805.1595%2C0805.3940%2C0805.2619%2C0805.4164%2C0805.1418%2C0805.1930%2C0805.4527%2C0805.3427%2C0805.1653%2C0805.3455%2C0805.4332%2C0805.4001%2C0805.3459%2C0805.2400%2C0805.0510%2C0805.0801%2C0805.4536%2C0805.0428%2C0805.3009%2C0805.3146%2C0805.3189%2C0805.0744%2C0805.4834%2C0805.4444%2C0805.1797%2C0805.4470%2C0805.1759%2C0805.0189%2C0805.3490%2C0805.2994%2C0805.3353%2C0805.4129%2C0805.1881%2C0805.2932%2C0805.3480%2C0805.3125%2C0805.0826%2C0805.2555%2C0805.1380%2C0805.1030%2C0805.1683%2C0805.2119%2C0805.1657%2C0805.1744%2C0805.4128%2C0805.3512%2C0805.0538%2C0805.4282%2C0805.1100%2C0805.1096%2C0805.3970%2C0805.4591%2C0805.4415%2C0805.2699%2C0805.1948%2C0805.1214%2C0805.3697&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Relative clustering and the joint halo occupation distribution of\n  red-sequence and blue-cloud galaxies in COMBO-17"}, "summary": "This paper studies the relative spatial distribution of red-sequence and\nblue-cloud galaxies, and their relation to the dark matter distribution in the\nCOMBO-17 survey as function of scale down to z~1. We measure the 2nd-order\nauto- and cross-correlation functions of galaxy clustering and express the\nrelative biasing by using aperture statistics. Also estimated is the relation\nbetween the galaxies and the dark matter distribution exploiting galaxy-galaxy\nlensing (GGL). All observables are further interpreted in terms of a halo\nmodel. To fully explain the galaxy clustering cross-correlation function with a\nhalo model, we need to introduce a new parameter,R, that describes the\nstatistical relation between numbers of red and blue galaxies within the same\nhalo. We find that red and blue galaxies are clearly differently clustered, a\nsignificant evolution of the relative clustering with redshift was not found.\nThere is evidence for a scale-dependence of relative biasing. The relative\nclustering, the GGL and, with some tension, the galaxy numbers can be explained\nconsistently within a halo model. For the cross-correlation function one\nrequires a HOD variance that becomes Poisson even for relatively small\noccupancy numbers. For our sample, this rules out with high confidence a\n\"Poisson satellite\" scenario as found in semi-analytical models. Red galaxies\nhave to be concentrated towards the halo centre, either by a central red galaxy\nor by a concentration parameter above that for dark matter.The value of R\ndepends on the presence or absence of central galaxies: If no central galaxies\nor only red central galaxies are allowed, R is consistent with zero, whereas a\npositive correlation $R=+0.5\\pm0.2$ is needed if both blue and red galaxies can\nhave central galaxies.[ABRIDGED]", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0805.3534%2C0805.4166%2C0805.4115%2C0805.0676%2C0805.2180%2C0805.3740%2C0805.0945%2C0805.0643%2C0805.3820%2C0805.1514%2C0805.0032%2C0805.0625%2C0805.4225%2C0805.4572%2C0805.0808%2C0805.4091%2C0805.4642%2C0805.2876%2C0805.0251%2C0805.1481%2C0805.0629%2C0805.4480%2C0805.1330%2C0805.4482%2C0805.1589%2C0805.3045%2C0805.0372%2C0805.4457%2C0805.4297%2C0805.3894%2C0805.1799%2C0805.1476%2C0805.0481%2C0805.1031%2C0805.2560%2C0805.2539%2C0805.3424%2C0805.2185%2C0805.1130%2C0805.0195%2C0805.2958%2C0805.1635%2C0805.4217%2C0805.2376%2C0805.1595%2C0805.3940%2C0805.2619%2C0805.4164%2C0805.1418%2C0805.1930%2C0805.4527%2C0805.3427%2C0805.1653%2C0805.3455%2C0805.4332%2C0805.4001%2C0805.3459%2C0805.2400%2C0805.0510%2C0805.0801%2C0805.4536%2C0805.0428%2C0805.3009%2C0805.3146%2C0805.3189%2C0805.0744%2C0805.4834%2C0805.4444%2C0805.1797%2C0805.4470%2C0805.1759%2C0805.0189%2C0805.3490%2C0805.2994%2C0805.3353%2C0805.4129%2C0805.1881%2C0805.2932%2C0805.3480%2C0805.3125%2C0805.0826%2C0805.2555%2C0805.1380%2C0805.1030%2C0805.1683%2C0805.2119%2C0805.1657%2C0805.1744%2C0805.4128%2C0805.3512%2C0805.0538%2C0805.4282%2C0805.1100%2C0805.1096%2C0805.3970%2C0805.4591%2C0805.4415%2C0805.2699%2C0805.1948%2C0805.1214%2C0805.3697&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "This paper studies the relative spatial distribution of red-sequence and\nblue-cloud galaxies, and their relation to the dark matter distribution in the\nCOMBO-17 survey as function of scale down to z~1. We measure the 2nd-order\nauto- and cross-correlation functions of galaxy clustering and express the\nrelative biasing by using aperture statistics. Also estimated is the relation\nbetween the galaxies and the dark matter distribution exploiting galaxy-galaxy\nlensing (GGL). All observables are further interpreted in terms of a halo\nmodel. To fully explain the galaxy clustering cross-correlation function with a\nhalo model, we need to introduce a new parameter,R, that describes the\nstatistical relation between numbers of red and blue galaxies within the same\nhalo. We find that red and blue galaxies are clearly differently clustered, a\nsignificant evolution of the relative clustering with redshift was not found.\nThere is evidence for a scale-dependence of relative biasing. The relative\nclustering, the GGL and, with some tension, the galaxy numbers can be explained\nconsistently within a halo model. For the cross-correlation function one\nrequires a HOD variance that becomes Poisson even for relatively small\noccupancy numbers. For our sample, this rules out with high confidence a\n\"Poisson satellite\" scenario as found in semi-analytical models. Red galaxies\nhave to be concentrated towards the halo centre, either by a central red galaxy\nor by a concentration parameter above that for dark matter.The value of R\ndepends on the presence or absence of central galaxies: If no central galaxies\nor only red central galaxies are allowed, R is consistent with zero, whereas a\npositive correlation $R=+0.5\\pm0.2$ is needed if both blue and red galaxies can\nhave central galaxies.[ABRIDGED]"}, "authors": ["P. Simon", "M. Hetterscheidt", "C. Wolf", "K. Meisenheimer", "H. Hildebrandt", "P. Schneider", "M. Schirmer", "T. Erben"], "author_detail": {"name": "T. Erben"}, "author": "T. Erben", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1111/j.1365-2966.2009.14973.x", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0805.3459v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0805.3459v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "30 pages, 13 figures, accepted by MNRAS, major changes: improved\n  redshift distributions of samples, now comoving number densities of galaxy\n  samples are estimated and fitted by halo-model, correction of wrong\n  confidence limits in Table 2, new figure with Mb-magnitudes of samples", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0805.3459v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0805.3459v2", "journal_reference": null, "doi": "10.1111/j.1365-2966.2009.14973.x", "fulltext": "Mon. Not. R. Astron. Soc. 000, 1–30 (2007)\n\nPrinted 2 November 2018\n\n(MN LaTEX style file v2.2)\n\narXiv:0805.3459v2 [astro-ph] 1 May 2009\n\nRelative clustering and the joint halo occupation\ndistribution of red-sequence and blue-cloud galaxies in\nCOMBO-17\nP. Simon1⋆, M. Hetterscheidt2, C. Wolf3, K. Meisenheimer4, H. Hildebrandt5,2,\nP. Schneider2, M. Schirmer2 and T. Erben2\n1 The Scottish Universities Physics Alliance (SUPA), Institute for Astronomy, School of Physics, University of Edinburgh,\nRoyal Observatory, Blackford Hill, Edinburgh EH9 3HJ, UK\n2 Argelander-Institut für Astronomie, Auf dem Hügel 71, 53121 Bonn, Germany\n3 Department of Physics, Denys Wilkinson Bldg., University of Oxford, Keble Road, Oxford OX1 3RH, UK\n4 Max-Planck-Institut für Astronomie, Königsstuhl 17, 69117 Heidelberg, Germany\n5 Leiden Observatory, Leiden University, Niels Bohrweg 2, 2333 CA Leiden , The Netherlands\n\nReleased 2007 Xxxxx XX\n\nABSTRACT\n\nThis paper studies the relative spatial distribution of red-sequence and blue-cloud\ngalaxies, and their relation to the dark matter distribution in the COMBO-17 survey as\nfunction of scale down to z ∼ 1. We measure the 2nd -order auto- and cross-correlation\nfunctions of galaxy clustering and express the relative biasing by using aperture statistics. Also estimated is the relation between the galaxies and the dark matter distribution exploiting galaxy-galaxy lensing (GGL). All observables are further interpreted in\nterms of a halo model. To fully explain the galaxy clustering cross-correlation function\nwith a halo model, we introduce a new parameter, R, that describes the statistical\ncorrelation between numbers of red and blue galaxies within the same halo.\nWe find that red and blue galaxies are clearly differently clustered, a significant\nevolution of the relative clustering with redshift is not found. There is evidence for\na scale-dependence of relative biasing: The linear relative bias factor varies slightly\nbetween b ∼ 1.7 ± 0.5 and b ∼ 2.2 ± 0.1 on spatial scales between roughly 100 h−1kpc\nand 7 h−1 Mpc, respectively. The linear correlation coefficient of galaxy number densities drops from a value near unity on large scales to r ∼ 0.6 ± 0.15. Both biasing\ntrends, the GGL and with some tension the galaxy numbers can be explained consistently within a halo model. Red galaxies typically start to populate haloes with\nmasses starting from & 1012.1±0.2 h−1 M⊙ , blue galaxies from & 1011.2±0.1 h−1 M⊙ . For\nthe cross-correlation function one requires a HOD variance that becomes Poisson even\nfor relatively small occupancy numbers. This rules out for our samples with high confidence a \"Poisson satellite\" scenario, as found in semi-analytical models. We compare\ndifferent model flavours, with and without galaxies at the halo centres, using Bayesian\nevidence. The result is inconclusive. However, red galaxies have to be concentrated\ntowards the halo centre, either by a red central galaxy or by a concentration parameter above that of dark matter. The value of R depends on the presence or absence\nof central galaxies: If no central galaxies or only red central galaxies are allowed, R is\nconsistent with zero, whereas a positive correlation R = +0.5 ± 0.2 is needed if both\nblue and red galaxies can have central galaxies.\nKey words: galaxies: statistics - dark matter - large-scale structure of Universe cosmology: theory - cosmology: observations - gravitational lensing\n\n1\n\n⋆\n\nE-mail: psimon@roe.ac.uk\n\nINTRODUCTION\n\nToday a confusing wealth of different galaxy populations is\nknown, which yet is thought to have arisen from a fairly\nsimple early Universe. Morphologically, local galaxies fall\n\n\f2\n\nP. Simon et al.\n\ninto two broad classes: early-type galaxies, with almost\nspheroidal appearance and none or only a very small disk\ncomponent, and late-type galaxies, with a small central\nbulge and a dominating stellar disk exhibiting different degrees of spiral structure and star formation. Within the context of the cold dark matter paradigm for cosmological structure formation (Croft et al. 2008; Springel et al. 2005) galaxies merge, grow and interact with the ambient intergalactic\nmedium by participating in a hierarchical merging process\n(Cole et al. 2000). The ongoing research is trying to test\nwhether the today's known variety of galaxies can indeed be\nexplained within this paradigm.\nTo trace the evolution of galaxy populations with time,\na morphological identification of a large sample of galaxies down to higher redshifts has proven to be difficult. The\nmost practical solution to this problem is to exploit the bimodal distribution of galaxies in a colour-magnitude diagram (CMD). In such a diagram early- and late-type galaxies can roughly be separated down to redshifts of z ∼ 1,\npossibly even beyond that (see e.g. Lin et al. 2008; Faber\net al. 2007; Bell et al. 2004, and references therein). The red\nmode in the CMD is the well-known colour-magnitude relation (CMR), or red-sequence, of early-type galaxies. The\nblue mode is often referred to as the blue cloud galaxies. To\ndistinguish between a red and a blue galaxy population we\nproceed according to Bell et al. (2004), using a (rest-frame)\nU − V vs. MV CMD and cut the galaxy sample along the\nCMR to obtain a red-sequence and blue-cloud sample. In\nadopting this division line about 80% of the selected red\ngalaxies have morphologies earlier than or equal Hubble\ntype Sa, while the blue-cloud galaxies are mainly late-type,\nstar forming galaxies. A better morphological separation of\ngalaxies, not pursued for this paper though, may be achieved\nby applying inclination corrections as discussed in Maller\net al. (2008) that have been tested for low-z galaxies from\nSDSS and 2dF.\nThe so far strongest observational clues about the emergence of the red-sequence from the blue cloud come from\ncareful number counts in CMDs and estimates of the galaxy\nluminosity functions for different redshifts. Faber et al.\n(2007) have found strong evidence that the red-sequence\nhas been built up by a mixture of dry mergers between redsequence galaxies, wet mergers between blue-cloud galaxies\nand quenching of star formation with subsequent aging of\nthe stellar populations of blue-cloud galaxies.\nAnother important source of information hinting to the\nnature of galaxies is their spatial distribution. For example,\nearly-type galaxies are preferentially found in the cores of\nrich galaxy clusters where their fraction is about 90 percent, whereas outside of galaxy clusters about 70 percent of\nthe field galaxies are late-type galaxies (Dressler 1980). As\nanother example, it has also been found by modelling stellar populations of local early-types that the star-formation\nhistory of early-type galaxies depends on the galaxy density\nof the environment (Thomas et al. 2005).\nOne traditional way to study the spatial distribution\nof galaxies is to look at correlations in the galaxy distribution, in particular the two-point correlation function (Peebles 1980; Totsuji & Kihara 1969). Analyses revealed that\ngalaxy clustering depends on the properties of the galaxy\npopulation like morphology, colour, luminosity or spectral\ntype (e.g. Coil et al. 2008; Zehavi et al. 2005; Madgwick et al.\n\n2003, and references therein). Therefore, different galaxy\npopulations are differently clustered – biased – with respect to the total matter component and with respect to\neach other. The detailed dependence of spatial clustering on\ngalaxy characteristics, scale and redshift is a opportunity\nto learn more about the formation and evolution history\nof galaxies, see for example White et al. (2007) or Simon\n(2005a).\nAlong with this motivation, one aim of this paper is to\nmeasure the relative clustering of red (early-type) and blue\n(late-type) galaxies for different epochs in terms of the linear\nstochastic biasing parameters. These biasing parameters require 2nd -order clustering statistics (Dekel & Lahav 1999).\nThat parametrisation is a completely model-independent,\nalbeit in a statistical sense for non-Gaussian random fields\nincomplete, measure for comparing two random distributions. It quantifies as function of angular scale the relative\nclustering strength of two galaxy types and the correlation\nof their number densities.\nThe machinery that is applied here to study galaxy biasing is the aperture statistics as formalised in Schneider\net al. (1998) and van Waerbeke (1998). It is convenient for\nanalysing weak lensing data and, in particular, to measure\nthe linear stochastic galaxy bias as a function of scale (Simon et al. 2007; Hoekstra et al. 2002). In order to have a\ncompatible statistical measure that quantifies the relative\nbias between red and blue galaxies the formalism is slightly\nextended.\nAnother aim of this paper is to give a physical interpretation of the relative clustering. For that purpose, we\nuse the measurements for setting constraints on parameters\nof galaxies within the framework of a halo model (van den\nBosch et al. 2007; Zheng et al. 2005; Berlind & Weinberg\n2002; Scoccimarro et al. 2001; Seljak 2000; Peacock & Smith\n2000). In this context, we introduce and discuss a new parameter – the correlation factor of the joint HOD – that\nregulates the likelihood to find a certain number of red and\nblue galaxies within the same halo. This allows us to investigate whether two galaxy populations avoid or attract each\nother inside/inside the same dark matter halo. In Scranton\n(2003, 2002) a similar modelling is carried out to explain the\nrelative clustering of red and blue galaxy samples, however\nassuming for simplicity uncorrelated galaxy numbers inside\nsame haloes. In Collister & Lahav (2005) also the clustering of red and blue galaxies was studied by looking at the\nprojected galaxy density profiles of groups.\nFor the scope of this analysis, the COMBO-17 Survey\n(Wolf et al. 2004, 2001) offers an unique opportunity. It provides one of the so far largest deep galaxy samples in the redshift regime 0.2 6 z 6 1.1 covering an area of ∼ 0.78 deg2 ,\nobserved in five broad-band and twelve narrow-band filters.\nBased on the photometry, photometric redshifts of galaxies brighter than R 6 24 mag have been derived within a\nfew percent accuracy as well as absolute rest-frame luminosities and colours. We are analysing the data from three\nCOMBO-17 patches which are known as S11, A901 and\nCDFS (also known as AXAF).\nThe survey has also been designed to fit the requirements of gravitational lensing applications (Kleinheinrich\net al. 2006; Brown et al. 2003; Gray et al. 2002). The coherent shear distortions of images of background galaxies\ncan therefore be used to infer the relation between galaxy\n\n\fClustering and joint HOD of red and blue galaxies in COMBO-17\nand matter distribution as well (Bartelmann & Schneider\n2001). We use this additional piece of information to further\nconstrain parameters of the halo-model by cross-correlating\nthe COMBO-17 galaxies with the corresponding shear catalogues taken from the Garching-Bonn Deep Survey (GaBoDS) (Hetterscheidt et al. 2007; Erben et al. 2005).\nThe structure of this paper is as follows. Sect. 2 outlines\nthe quantities that are used to measure the angular galaxy\nclustering, the aperture N -statistics. Sect. 3 introduces the\nCOMBO-17-survey and GaBoDS which are the sources of\nthe galaxy samples, red and blue galaxies, and shear catalogues for this study, respectively. Sect. 4 is the place where\nwe describe and present the details of our clustering analysis and compare the results to the literature. The cosmic\nshear information is harnessed for the GGL, Sect. 5, quantifying the typical matter distribution about the galaxies in\nour COMBO-17 samples. Sect. 6 outlines the halo model\nwhich is then used to interpret the (relative) clustering and\nthe GGL signal of the blue and red galaxy samples. In particular, we introduce and discuss the correlation factor of\nthe joint HOD of two galaxy populations. We finish with a\nsummary in the last section.\nUnless stated otherwise we use as fiducial cosmology\na ΛCDM model (adiabatic fluctuations) with Ωm = 0.24,\nΩb = 0.0416, ΩΛ = 1 − Ωm and H0 = h 100 km s−1 Mpc−1\nwith h = 0.732. The normalisation of the matter fluctuations\nwithin a sphere of radius 8 h−1 Mpc at redshift zero is assumed to be σ8 = 0.76. For the spectral index of the primordial matter power spectrum we use ns = 0.96. These values\nare consistent with the third-year WMAP results (Spergel\net al. 2007).\n\n2\n2.1\n\nCLUSTERING QUANTIFIERS\nAperture statistics\n\nThe statistics used in this paper to quantify galaxy clustering is the so-called aperture number count statistics. It\noriginally stems from the gravitational lensing literature. As\nshown in Simon et al. (2007) the aperture number count\nstatistics is useful for studying galaxy clustering even outside the context of gravitational lensing. Its advantage is\nthat no correction for the integral-constraint of the angular\ncorrelation function (Peebles 1980) is needed.\nThe aperture number count, N (θ, θap ), measures the\nfluctuations, excluding shot-noise from discrete galaxies, of\nthe galaxy number densityR by smoothing the density with a\ncompensated filter u, i.e. dx x u(x) = 0:\n«\n„\nZ\n1\n|θ − θ ′ |\nN (θ, θap ) = 2\nη(θ ′ ) ,\n(1)\nd2 θ ′ u\nη̄θap\nθap\nwhere η(θ) and η̄ denote the (projected) number density of\ngalaxies in some direction θ and the mean number density of\ngalaxies, respectively. The variable θap defines the smoothing\nradius of the aperture.\nOne focus of our analysis is the 2nd -order statistics of\ngalaxy clustering. All information on the 2nd -order statistics\nis comprised by second moments of the aperture number\ncounts as function of θap :\nZ ∞\nD\nE\nNi (θap ) Nj (θap ) = 2π\ndl l Pij (l) [I (lθap )]2 ,\n(2)\n0\n\nwhere I(x) is a filter kernel\nZ ∞\nI (x) ≡\nds s u (s) J0 (s x)\n\n3\n\n(3)\n\n0\n\nto the angular power spectrum Pij (l) defined by\nD\nE\nη̃i (l1 )η̃j (l2 )\n= (2π)2 Pij (|l|)δD (l1 + l2 ) .\nη̄i η̄j\n\n(4)\n\nIn this equation, η̄i is the mean number density of galaxies\non the sky, for possibly different galaxy samples. We use\nJ0 (x) for the 0th -order Bessel function of the first kind and\nδD (x) for the Delta-function. The tilde on top of the galaxy\nnumber density η̃ denotes the angular Fourier transform of\nη assuming a flat sky with Cartesian coordinates which we\ndo throughout this paper:\nZ\nZ\nd2 l\nη̃(l) = d2 θ η(θ) e+iθ*l ; η(θ) =\nη̃(l) e−iθ*l . (5)\n(2π)2\nFor i = j, Pij (l) is an auto-correlation power spectrum, a\ncross-power spectrum otherwise.\nTo weigh density fluctuations inside apertures we use a\ncompensated polynomial filter (Schneider 1998)\n«\n„\n ́ 1\n9`\nu (x) =\n− x2 H(1 − x) ,\n(6)\n1 − x2\nπ\n3\n\nwhich by definition vanishes for x > 1; H(x) denotes the\nHeaviside step function. The filter has the effect that only\ngalaxy number density fluctuations from a small range of angular scales contribute to the signal; it acts as a narrow-band\nfilter for the angular modes, l, with highest sensitivity to\n′\nlc ≈ 1.5 × 104 θ1ap . Therefore, the 2nd -order N -statistics are\nessentially a probe for the (band) power spectrum Pij (lc ).\nIn practice, the N -statistics are easily derived from the\ntwo-point correlation functions, ω(θ), of galaxy clustering\n(e.g. Simon 2005b) by a weighted integral. As an aside, this\nis very similar to the approach recently advocated in Padmanabhan et al. (2007) which points out that weighting ω(θ)\nwith a compensated filter can also be useful for deprojecting\nω(θ) to obtain the 3D-correlation function on small cosmological scales.\n2.2\n\nLinear stochastic biasing parameters\n\nThe linear stochastic biasing parameters (Dekel & Lahav\n1999; Tegmark & Peebles 1998), expressed here in terms\nof the N -statistics, quantify the relative clustering of two\nrandom fields, which are in our case the number density of\nblue and red galaxies:\nvD\nE\nu\n2\nu Nred\n(θap )\nu\nE ,\nb(θap ) = t D\n(7)\n2\nNblue\n(θap )\nD\nE\nNred (θap )Nblue (θap )\n(8)\nr(θap ) = rD\nED\nE .\n2\n2\nNred (θap ) Nblue (θap )\n\nNote that the aperture number count vanishes on average, hN i = 0, due to the compensated filter used.\nGalaxy samples unbiased with respect to each other have\nr(θap ) = b(θap ) = 1. The parameters are complete for Gaussian random fields, which is only approximately true for\n\n\f4\n\nP. Simon et al.\n\nlarge scales but clearly wrong for non-linear scales, effective scale smaller than ∼ 8Mpc/h. Owing to the incomplete picture those biasing parameters convey for the nonGaussian regime, one is unable to distinguish stochasticity\nfrom non-linearity in the relation between the two random\nfields. Therefore a bias factor r 6= 1 can mean a stochastic scatter between galaxy number densities or a non-linear\nbut deterministic mapping (Fry & Gaztanaga 1993) between\nnumber densities – or both. Higher-order statistics or nonGaussian models for the clustering are required to make this\ndistinction (Wild et al. 2005; Blanton 2000; Dekel & Lahav\n1999).\nNote that the parameter r(θap ) can be larger than unity\nbecause shot-noise contributions to the variances in the\naperture galaxy number count are subtracted, or put another way, spatial shot-noise in the fluctuation power of the\ngalaxy number density fields is automatically subtracted as\nin Guzik & Seljak (2001) or Seljak (2000). The underlying\nassumption is that galaxies trace a general galaxy number\ndensity field by a Poisson sampling process (Poisson shotnoise), which is widely assumed in large-scale structure studies and, in fact, in the definition of the clustering correlation\nfunction ω(θ).\nWe employ the linear stochastic biasing parameters here\nin order to quantify, without too many assumptions, the\nrelative biasing of our blue and red sample as function of\nscale, θap . A more sophisticated and physical, albeit very\nmodel-dependent, interpretation of the relative biasing is\ngiven within the framework of the halo-model, see Sect. 6.\n\n3\n\nDATA SET\n\nThis study is based on three fields: the S11, A901 and CDFS.\nThe observations of the fields were obtained with the Wide\nField Imager (WFI) of the MPG/ESO 2.2m telescope on La\nSilla, Chile. The camera consists of eight 2 k×4 k CCDs with\na pixel size of 15 μm, corresponding to a pixel scale of 0.′′ 238\nin the sky. The field-of-view in the sky is 34′ × 33′ .\nThe data from two surveys, carried out with the same\ninstrument, are used. We select blue and red galaxies, possessing photometric redshifts, from the COMBO-17-survey.\nThese data sets are further subdivided into four redshifts\nbins covering the range between z = 0.2 and z = 1.0. Shear\ncatalogues from another survey, GaBoDS, covering the same\npatches on the sky as COMBO-17, are utilised to quantify\nthe relation between the total (dark) matter density and\nthe galaxy positions by using the gravitational lensing technique. The following sections describe the details of the two\nsurveys and the extracted galaxy and shear catalogues.\n3.1\n\nRed and blue galaxy samples: COMBO-17\n\nThe observations and data reduction of the COMBO-17 survey are described in detail in Wolf et al. (2001) and Wolf\net al. (2003). Overall the total survey consists of four different, non-contiguous fields observed in 17 optical filters1 .\nThe photometric information was used to derive photometric redshifts of galaxies with mR . 24 mag, based on\n1\n\nThe filters include UBVRI and 12 medium-band filters.\n\nFigure 2. Histogram (arbitrary normalisation) of photometric\nredshifts of galaxies with mR 6 24 mag in COMBO-17 (solid\nline). The mean photometric redshift is z̄ = 0.68. The sample\nis split into four distinct photo-z bins. The photo-z distribution\ninside the bins is further convolved with the photo-z error of the\nindividual galaxies to estimate the true redshift distribution inside\nthe photo-z bins (dashed: z̄ = 0.3; dashed-dotted: z̄ = 0.5; dotted:\nz̄ = 0.7; dashed-dotted-dotted: z̄ = 0.9).\n\na set of galaxy spectrum templates (see references in Wolf\net al. 2004). The quality of the estimate depends primarily\non the apparent magnitude of the object. As estimator for\nthe redshift uncertainty we use Eq. (5) of Wolf et al. (2004):\np\nσz = 0.007(1 + z) 1 + 100.8(mR −21.6 mag) ,\n(9)\n\nwhere σz is the 1-σ standard deviation of the object redshift.\nFig. 2 shows the frequency distribution of the photometric\nredshifts (solid line) of the full sample.\nBased on photometry, rest-frame colours with accuracy\nδm ∼ 0.1 mag and absolute luminosities with accuracies\nδm ∼ 0.1 mag (0.2 mag) for redshifts z & 0.5 (∼ 0.3) were\ncalculated.\nOur object catalogue consists of galaxies with reliable\nphotometric redshifts. Galaxies are only contained in the object catalogue if both spectral classification and estimation\nof the photometric redshift has been successful. Therefore\nthere is a certain probability with which a galaxy of some\nabsolute magnitude, redshift and template spectrum (SED)\ncannot be identified. This means that the galaxy sample\nis incomplete. The completeness of COMBO-17 has been\nstudied using extensive Monte Carlo simulations (Wolf et al.\n2003) and has been found to be a complex function of galaxy\ntype and redshift. Roughly, the completeness is about 90%\nfor mR . 23 mag and about 50% near mR ≈ 23.8 mag (blue,\nlate-type galaxies) or near mR ≈ 23.5 mag (red, early-type\ngalaxies).\nWe split the total object catalogue into four distinct\nphoto-z bins, namely a) 0.2 6 z < 0.4, b) 0.4 6 z < 0.6, c)\n0.6 6 z < 0.8 and d) 0.8 6 z < 1.0. The mean redshifts of\ngalaxies belonging to a)-d) are z̄ = 0.3, 0.5, 0.7, 0.9, respectively. The sizes of the samples are listed in Table 1.\nIn order to have a better estimate for the true redshift distribution, the photo-z distribution of every bin is\nconvolved with the photo-z error (Gaussian errors) of the\nindividual galaxies, Eq. (9). The average redshift uncertain-\n\n\fClustering and joint HOD of red and blue galaxies in COMBO-17\n\nU-V (rest-frame)\n\nU-V (rest-frame)\n\n1.5\n\nRS\n\n1\n0.5\n0\n-0.5\n\n2.5\n\n2.5\n\n2\n\n2\n\n2\n\n1.5\n\n1.5\n\n1.5\n\n1\n0.5\n0\n-0.5\n\n-1\n-24\n\n-22\n\n-20\n\n-18\n\n-16\n\n1\n0.5\n0\n-0.5\n\n-1\n-24\n\n-14\n\nU-V (rest-frame)\n\nCUT\n\n2\n\n2.5\n\nU-V (rest-frame)\n\n2.5\n\n-22\n\nMv-5 log10 h\n\n-20\n\n-18\n\n-16\n\n-14\n\n1\n0.5\n0\n-0.5\n\n-1\n-24\n\n-22\n\nMv-5 log10 h\n\nz=0.2...0.4\n\n5\n\n-20\n\n-18\n\n-16\n\n-14\n\n-1\n-24\n\n-22\n\nMv-5 log10 h\n\n0.4...0.6\n\n-20\n\n-18\n\n-16\n\n-14\n\nMv-5 log10 h\n\n0.6...0.8\n\n0.8...1.0\n\nFigure 1. Rest-frame U-V colour vs. absolute magnitude in V-band for the S11 galaxies inside four different redshift ranges (numbers\nat bottom). Analogous colour-magnitude diagrams for the fields CDFS and A901 look similar. The galaxy sample is split into a red and\nblue-cloud population by the red-sequence division line \"RS\". The steep line \"CUT\" is an additional cut applied to obtain comparable\nabsolute magnitude-limits in all bins.\n\nTable 1. Number of galaxies for all redshift bins and survey fields. Only the mean redshifts of the redshift bins 0.2 6 z < 0.4, 0.4 6 z < 0.6,\n0.6 6 z < 0.8 and 0.8 6 z < 1.0 are quoted. The quoted fractions are red and blue galaxies (from COMBO-17) relative to the total\nnumber of galaxies in the corresponding redshift bin. The comoving number densities derived from the galaxy numbers and the estimated\ncomoving volume of a z-bin and field are corrected for incompleteness. The statistical errors for the individual fields (2σ) are estimates\nassuming (uncorrelated) Poisson errors for the absolute galaxy numbers; errors do hence not include cosmic variance for individual fields.\nThe last column contains the number of galaxies (sources) in the shear catalogue (from GaBoDS), with 21.5 6 R < 24.5 mag, used for\nthe lensing analysis. The source galaxies have a mean redshift of z̄ = 0.78. The bottom block of the table contains values averaged over\nall three fields. The errors (1σ) are now Jackknife-estimates, reflecting cosmic variance derived from the field-to-field variances.\nField\n\nz̄\n\n#RED\n\nFraction\n\ndensity\n[10−3 h3 Mpc−3 ]\n\n#BLUE\n\nFraction\n\ndensity\n[10−3 h3 Mpc−3 ]\n\n#Sources\n(GaBoDS)\n\nA901\n\n0.31\n0.50\n0.71\n0.89\n\n297\n397\n413\n376\n\n0.22 ± 0.02\n0.24 ± 0.02\n0.17 ± 0.01\n0.13 ± 0.01\n\n10.7 ± 0.6\n6.2 ± 0.3\n3.5 ± 0.2\n2.1 ± 0.1\n\n1045\n1264\n2046\n2421\n\n0.78 ± 0.02\n0.76 ± 0.02\n0.83 ± 0.01\n0.87 ± 0.01\n\n38.3 ± 1.2\n20.0 ± 0.6\n18.2 ± 0.4\n12.8 ± 0.3\n\n17084\n\nCDFS\n\n0.31\n0.50\n0.71\n0.89\n\n118\n338\n433\n154\n\n0.16 ± 0.02\n0.18 ± 0.01\n0.16 ± 0.01\n0.11 ± 0.01\n\n4.5 ± 0.4\n5.2 ± 0.3\n3.8 ± 0.2\n0.8 ± 0.1\n\n621\n1516\n2323\n1263\n\n0.84 ± 0.02\n0.82 ± 0.01\n0.84 ± 0.01\n0.89 ± 0.01\n\n22.4 ± 0.9\n23.5 ± 0.6\n20.5 ± 0.4\n6.8 ± 0.2\n\n20487\n\nS11\n\n0.31\n0.50\n0.71\n0.89\n\n280\n402\n393\n367\n\n0.25 ± 0.02\n0.21 ± 0.01\n0.18 ± 0.01\n0.14 ± 0.01\n\n10.4 ± 0.6\n6.4 ± 0.3\n3.5 ± 0.2\n2.0 ± 0.1\n\n843\n1518\n1832\n2334\n\n0.75 ± 0.02\n0.79 ± 0.01\n0.82 ± 0.01\n0.86 ± 0.01\n\n30.3 ± 1.1\n23.7 ± 0.6\n16.3 ± 0.4\n12.4 ± 0.3\n\n18996\n\nCOMBINED\n\n0.31\n0.50\n0.70\n0.89\n\n.\n.\n.\n.\n\n0.21 ± 0.08\n0.21 ± 0.05\n0.17 ± 0.02\n0.13 ± 0.03\n\n8.5 ± 3.0\n5.9 ± 0.6\n3.6 ± 0.2\n1.6 ± 0.6\n\n.\n.\n.\n.\n\n0.79 ± 0.08\n0.79 ± 0.05\n0.83 ± 0.02\n0.87 ± 0.03\n\n30.3 ± 6.9\n22.4 ± 1.8\n18.3 ± 2.8\n10.7 ± 2.9\n\nties are σz = 0.02, 0.04, 0.06, 0.08 for the samples a)-d), respectively. See Fig. 2 for the resulting distributions. Obviously, the true redshift distribution is wider than the photoz distribution. Ignoring this effect would lead to a systematic under-estimation of the galaxy clustering amplitude by\n∼ 20% (Brown et al. 2008).\nThe galaxy samples are further subdivided by applying\n\na cut in the rest-frame U − V vs. MV − 5 log 10 h CMD\n(Johnson filter) along the line\n(U − V )(MV , z) =\n\n(10)\n\n1.15 − 0.31 z − 0.08(MV − 5 log 10 h + 20) .\n\nThis model-independent, empirical cut has been chosen by\nBell et al. (2004) to study red galaxies near the galaxy red-\n\n\f6\n\nP. Simon et al.\n\nsequence. It slices the bimodal distribution of galaxies in\nthe CMD between the two modes. Galaxies redder than\n(U − V )(MV , z) are dubbed \"red galaxies\", \"blue galaxies\" otherwise. For the redshifts considered here, most of the\nred galaxies selected this way are morphologically early-type\nwith dominant old stellar populations, while blue galaxies\nare mainly late-type, star-forming galaxies.\nThe redshift dependence of the CMR zero-point, in\nEq. (10), was fitted to match the colour evolution of\nCOMBO-17 early-type galaxies and to be consistent with\nthe SDSS CMR zero-point at low redshift. From the viewpoint of the COMBO-17 early-types the zero-point for redshifts z . 0.2 is slightly too low, giving a small contamination of the red sample with blue cloud galaxies. Since we\nconsider only galaxies starting from z > 0.2, this contamination is negligible for this study, though.\nAs we took only galaxies with reliable photometric redshifts, we have as further selection rule mR 6 24 mag. The\ndistribution of our samples in a rest-frame CMD is plotted\nin Fig. 1. Obviously, in the lowest redshift bin CMD galaxies populate faint regions in the diagram that are excluded\nin the other redshift bins due to the survey flux-limit. We\nestimate that in the three deeper redshift bins galaxies have\nroughly to be brighter than (rest-frame)\nMV − 5 log10 h ≈ −17 mag − (U − V)\n\n(11)\n\nin order to be included (see steep black lines in Fig. 1).\nTo acquire comparable galaxy samples at all redshifts we\nartificially apply this limit as cut to all redshift bins. After\napplying this cut, the galaxy samples of all redshift bins\nhave comparable absolute rest-frame MV luminosities. The\nred sample has an average of hMV i = −20.0 ± 0.1 mag, the\nblue sample hMV i = −18.8 ± 0.3 mag (for h = 1).\nIn contrast to the red-sequence cut, this luminosity cut\ndoes not take into account the colour/luminosity evolution\nof the samples but is placed at the same position of the restframe CMD-diagram at all redshifts. We therefore expect\nthe selected galaxy populations of all redshifts not to be\ntotally equivalent at the faint end. For an easier comparison\nwith the literature, e.g. Brown et al. (2008), Fig. 3 shows\nalso the distribution of rest-frame MB -magnitudes of the\nvarious samples. The samples become bluer with increasing\nredshift which is, at least partially, explained by the passive\nevolution of the stellar populations.\nWe determine the absolute number density, φtype , of\nour galaxy samples by using the Vmax -estimator (e.g. Fried\net al. 2001). This estimator needs to be slightly modified\nsince we are not selecting the galaxies from a top-hat redshift range. Instead we are selecting, for every photo-z bin,\ngalaxies in redshift with a probability proportional to p(z),\nwhich is the aforementioned photo-z distribution convolved\nwith the photo-z error; p(z) resembles only for the lowest\nz-bin roughly a top-hat selection window, see Fig. 2. Due\nto the uncertainty in redshift we also select galaxies from\na redshift range (volume) larger than the photo-z window\nwould imply. Not taking this effect into account would mean\nto over-estimate the galaxy number density. Assuming that\nwe are selecting, apart from the incompleteness expressed\nby the incompleteness function C(z, SED, U − V, R) (Wolf\net al. 2003), all galaxies at the redshift of maximum p(z),\n\npmax say, the Vmax -estimator is:\nNgal\n\nφtype =\n\nNgal\nX 1\nX 1\n; σ 2 (φtype ) =\n,\nV\nVi2\ni\ni=1\ni=1\n\n(12)\n\nVi ≡\nZ ∞\nΩ\ndV\nC(z, type, Ui − Vi , Ri ) .\ndz p(z)\npmax 0\ndΩdz\n\n(13)\n(14)\n\nTherefore, p(z) is used here to correct the incompleteness\nfunction C for our additional galaxy redshift selection criterion. By Ω we denote the survey area of a COMBO-17-patch\nwhich is Ω = f × (39.7 arcmin)2 with a filling factor f , estimated from the patch masks, of f = 0.56, 0.54, 0.55 for\nA901, CDFS and S11, respectively. The estimator σ 2 (φtype )\nis used for the Poisson shot-noise error of φtype . For a top-hat\nselection function p(z), one obtains the estimator mentioned\nin Fried et al.\n\n3.2\n\nCosmic shear data: GaBoDS\n\nThe data reduction of GaBoDS was performed with a nearly\nfully automatic, stand-alone pipeline which we had developed to reduce optical and near infrared images, especially\nthose taken with multi-chip cameras. Since weak gravitational lensing was our main science driver, the pipeline algorithms were optimised to produce deep co-added mosaics\nfrom individual exposures obtained from empty field observations. Special care was taken to achieve an accurate astrometry to reduce possible artificial PSF patterns in the\nfinal co-added images. For the co-addition we used the programme EISdrizzle. A detailed description of the pipeline\ncan be found in Erben et al. (2005).2\nThe shape of galaxies is influenced by the anisotropic\nPSF. In order to obtain unbiased shear estimates from observed source galaxy ellipticities we use the so-called KSB\nalgorithm (Kaiser et al. 1995). For a detailed description\nof our implementation of the KSB-algorithm and catalogue\ncreation we refer the reader to Hetterscheidt et al. (2007).\nOur KSB-algorithm pipeline was blind-tested with simulated data within the STEP project (Massey et al. 2007;\nHeymans et al. 2006).\nFor the PSF-anisotropy correction we utilise stars which\nare point-like and unaffected by lensing. By using a sample\nof bright, unsaturated stars, we measure the anisotropic PSF\nwith a Gaussian filter scale matched to the size of the galaxy\nimage to be corrected (Hoekstra et al. 1998). In the case of\nthe WFI@2.2m instrument the PSF of the co-added images\nvaries smoothly over the total field-of-view. Therefore we\nperform a third-order two-dimensional polynomial fit to the\nPSF anisotropy with 3.5 σ-clipping as a function of position\nover the entire field-of-view. With this fit it is possible to\nestimate the PSF anisotropy at the position of the galaxies.\nAll objects for which problems concerning the determination of shape or centroid position occur are rejected\n(e.g. objects near the border, with negative total flux, with\nnegative semi major and/or semi major axis). In addition,\nwe only use those objects with a half-light radius which is\n\n2 The\nTHELI\npipeline\nis\nfreely\nftp://ftp.ing.iac.es/mischa/THELI.\n\navailable\n\nunder\n\n\fClustering and joint HOD of red and blue galaxies in COMBO-17\n\nred\n\n7\n\nblue\n\nFigure 3. Frequency distribution of (rest-frame) B-band magnitudes, separated for red (left) and blue (right) galaxies, for the four\ndifferent photo-z bins (dashed lines: z̄ = 0.3; dashed-dotted: z̄ = 0.5; dotted: z̄ = 0.7; dashed-dotted-dotted: z̄ = 0.9). The corresponding\nmean magnitudes and standard deviations in order of increasing mean redshifts are (h = 1): hMB i = −19.20 ± 0.94 mag, −19.56 ±\n0.91 mag, −20.06 ± 0.84 mag, −20.49 ± 0.68 mag (red) and hMB i = −18.34 ± 0.88 mag, −18.96 ± 0.94 mag, −19.46 ± 0.83 mag, −19.83 ±\n0.69 mag (blue).\n\nlarger than that measured for stars and an ellipticity (after PSF correction) of less than 1.0. Additionally, we only\nuse those galaxies with a signal-to-noise ratio larger than\nfive, since a comparison of ground- and space-based data\nshowed that galaxies with a lower S/N do not contain any\nshear information (Hetterscheidt et al., in prep.). We adopt\nthe scheme in Erben et al. (2001) and Hetterscheidt et al.\n(2005) to estimate uncertainties for each galaxy ellipticities.\nIn the following lensing analysis galaxies are weighted with\nthe inverse of the square of the estimates variances.\nA powerful way to reveal possible systematic errors in\nthe PSF-correction is the application of the aperture mass\nstatistics as it provides an unambiguous splitting of E- and\nB-modes:\nD\nE\n2\nMap,⊥\n(θap ) =\n(15)\n„\n„\n«\n«–\n»\nZ 2θap\n1\nθ\nθ\ndθ θ\n± ξ− (θ) T−\n.\nξ+ (θ) T+\n2\n2 0\nθap\nθap\nθap\nThe Map -statistics quantify the fluctuations of the shear signal (E-mode: plus sign on r.h.s, B-mode: minus sign) within\nan aperture of radius θap . They can be obtained by transforming the shear-shear correlation functions ξ± (e.g. Hetterscheidt et al. 2007). We use T± as derived in Schneider\net al. (2002). The presence of non-vanishing B-modes is a\ngood indicator for systematics arising, for instance, from an\nimperfect anisotropy correction.\nHowever, there are several possible astronomical sources\nof B-modes, like the intrinsic alignment of galaxies (e.g.\nHeavens et al. 2000; Heymans & Heavens 2003), the intrinsic\nshape-shear correlation (e.g. Hirata & Seljak 2004; Heymans\net al. 2006) and the redshift clustering of source galaxies\n(Schneider et al. 2002). Furthermore, Kilbinger et al. (2006)\nfound in their work a mixing of E- and B-modes due to a cut\noff in ξ± on small angular scales. However, all those B-mode\nsources are expected to be much smaller than the statistical\n\nE\nB\n\nFigure 4. Various measurements of the aperture mass statistics of the three COMBO-17-fields in R-band (≈ 0.75 deg2 ). All\ngalaxies in the magnitude range R ∈ [21.5, 24.5] are used for the\ncosmic shear analysis. The effective number density of galaxies\nis 16 arcmin−2 . The error-bars denote the field-to-field variance\nbetween the three fields. Upper panel: E- and B-mode decomposition of the Map -signal. Lower panel: Cross-correlation between\nuncorrected stars- and corrected galaxies for E- and B-modes.\n\nerrors of the three fields and are therefore irrelevant in the\nfollowing analyses.\nA further method to check for systematics is the crosscorrelation between PSF-uncorrected stars and anisotropy\ncorrected galaxies (e.g. Bacon et al. 2003). For that purpose,\nshear-shear cross-correlations, ξ± , between star-ellipticities\nand galaxy-ellipticities are computed and transformed ac-\n\n\f8\n\nP. Simon et al.\n\ncording to Eq. (15). We denote the thereby obtained Map variances as Mcross;E and Mcross;B for the E- and B-modes,\nrespectively.\nIn Fig. 4 the average E- and B-mode signal and the\naverage signal of the cross-correlation between anisotropycorrected stars and uncorrected galaxies, Mcross;E and\nMcross;B , are displayed (further details on Mcross;E and\nMcross;B are given in Hetterscheidt et al. 2007). The measured B-mode signal is consistent with zero within the 1 σrange for θ0 > 2′ , and the cross-correlation between uncorrected stars and corrected galaxies, Mcross;B , is consistent\nwith, or close to zero. Hence the B-mode signal does not indicate an imperfect anisotropy correction. Additionally, the\ncross-correlation signal, Mcross;E is consistent with zero.\nTaking the B-modes and the cross-correlation signals\nMcross;E and Mcross;B into account we conclude that the influence of systematics on the calculated E-mode signal is\nnegligible compared to statistical errors.\n\n4\n\nRELATIVE BIASING OF RED AND BLUE\nGALAXIES\n\n4.1\n\nCombining measurements\n\nWe outline here how measurements of the same quantity\nin the Np = 3 different fields were combined, and how the\ncovariance of the combined value was estimated.\nThe quantities estimated from the data, as function of\ngalaxy-galaxy separation on the sky, are the angular clustering of the galaxy samples, in terms of the aperture statistics\n(auto- and cross-correlations), and later on the mean tangential shear around the galaxies. The measurements are\nbinned into five logarithmic angular bins and compiled as a\ndata vector di , where i = 1 . . . 3 is an index for the survey\nfield (either A901, S11 or CDFS).\nA commonly applied technique for combining all measurements and estimating the covariance of the combination is by looking at the field-to-field variance of di (e.g.\nHetterscheidt et al. 2007). Applying this technique to mere\nthree fields, however, poses problems that are unsolved so\nfar (Hartlap et al. 2007) and would bias the final results. We\ntherefore use a different approach here.\nFor each field i individually, the measurement is repeated Nb = 100 times on bootstrapped data, which is acquired by randomly drawing galaxies (with replacement)\nfrom the original samples. The size of the bootstrap samples\nequals the the size of the original sample. For a recent paper on this and related statistical tools for error estimation\nsee Norberg et al. (2008), which points bootstrapping out as\nappropriate, albeit conservative (errors are overestimated by\n∼ 40%), method for uncertainties in two-point correlation\nfunctions.. The data vector of the j-th bootstrapped sample\nof the i-th field is denoted by dij . The variance of di among\nthe bootstrap samples yields an estimate for the covariance\nof the statistical errors in di due to galaxy shot noise:\nCi =\n\nNb\nX\n1\n(dij − di ) (dij − di )t .\nNb − 1 j=1\n\n(16)\n\nThe most likely value of a combined d of all fields, constrained by all individual di and their covariances Ci , is\n\nd=C\n\nNp\nX\ni=1\n\n3−1\n2\nNp\nX\n(Ci )−1 5\n[Ci ]−1 di ; C ≡ 4\n,\n\n(17)\n\ni=1\n\nobtained by finding the minimum of d in the negative loglikelihood (assuming Gaussian errors):\nNp\n\nX\n∂χ2 (d)\n= 0 ; χ2 (d) ≡\n(di − d)t [Ci ]−1 (di − d) .\n∂d\ni=1\n\n(18)\n\nThis is the generalisation of the well-known rule to combine\nmeasurements by inversely weighting with their statistical\nerror. We consider the assumption of Gaussian statistics for\nthe likelihood function as valid approximation for the following reasons:\n• The statistical errors of the angular clustering estimator, outlined below, are known to be Poisson, hence closely\nGaussian for a not too small number of galaxy pairs inside\na bin (Landy & Szalay 1993). Since we linearly combine\ndifferent, little correlated, angular bins of the clustering estimator to obtain the N -statistics, the N -estimates are even\nmore Gaussianly distributed according to the central limit\ntheorem of statistics.\n• As for GGL, the complex ellipticities of the lensed\nsources obey roughly a bivariate Gaussian distribution\nwhich makes the estimate for GGL inside an angular bin\nalso approximately Gaussianly distributed.\nEven if the noise in the data does not obey Gaussian statistics, the l.h.s. estimator Eq. (17) yields an unbiased however\nnot optimal (maximum likelihood) estimate of d, with C as\ncovariance, as any weighted average of unbiased estimates\ndi is itself an unbiased estimator.\nAs pointed out by Hartlap et al. (2007) taking the inverse of the (bootstrapped) Ci gives a biased estimate of the\ninverse. To obtain an unbiased estimator of the inverse we\nmultiply Ci in Eq. (16) by the factor:\nNb\n,\nNb − p − 1\n\n(19)\n\nwhere p is the size of the vector d (here: p = 15, five an2\n2\ngular bins for hNred\ni, hNblue\ni, hNred Nblue i, respectively; for\nthe halo-model fit later on we will extend di by ten more\ncomponents comprising the GGL signal of the samples).\nThe covariance of the combined mean d is simply\nhddt i − hdihdit = C .\n\n(20)\n\nThis covariance does not contain an estimate of the cosmic\nvariance, though, because it is solely based on bootstrapping using individual fields (galaxy shot-noise) and does not\ninclude a field-to-field variance between the fields.\nThis can be seen by considering a toy example which\nhas just one bin, di , for the field data vectors and equal\n(co)variance for all fields, Ci = σ 2 say. The above equations\ntell us for that case that d is the arithmetic mean of all di ,\nand the combined variance is C = σ 2 Np−1 . Based on this, if\nwe had an infinite number of galaxies within each field, i.e.\nbootstrapped σ → 0, we would expect a \"perfect\" measurement with C = 0. Hence, C completely ignores the possibility that di 6= dj for i 6= j even with a hypothetically infinite\nnumber of galaxies inside each patch (cosmic variance).\nWe expect the actual uncertainty therefore to be somewhat higher than expressed by C, especially for the larger\n\n\fClustering and joint HOD of red and blue galaxies in COMBO-17\n<N^2>\nblue\n\n< γt >\nblue\n\n<N^2>\nred\n\n<NN>\nblue/red\n\n< γt >\nred\n\n<N^2>\nblue\n<NN>\nblue/red\n<N^2>\nred\n< γt >\nblue\n< γt >\nred\n\n-0.2\n\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nFigure 5. Correlation of statistical errors of the aperture number\n2 i for five aper2\ni, hNblue Nred i and hNred\ncount statistics – hNblue\nture radii each – and the GGL signal – hγt i for the blue and red\nsample – for a mean redshift of z = 0.7 as obtained from bootstrapping the data. The correlation matrix for the other redshift\nbins look similar.\n\nseparation bins (larger aperture radii) where cosmic variance errors are becoming larger with respect to shot-noise\nerrors. The fact that the bootstrap variances overestimate\nthe covariance presumably compensates this deficit to some\nextend.\n4.2\n4.2.1\n\nClustering of red and blue galaxies\nMethod\n\nThe N -statistics is derived from the angular clustering of\nthe galaxy samples, ω(θ) (Peebles 1980), by a linear transformation (Simon et al. 2007)\nZ 2\nhNi (θap )Nj (θap )i =\ndx x ωij (θap x) T+ (x) ,\n(21)\n0\n\nwhere\n\nT+ (x) ≡ (2π)\n\n2\n\nZ\n\n∞\n2\n\nds s [I (s)] J0 (sx) .\n\n(22)\n\n0\n\nThe indices i and j are used to denote the different galaxy\nsamples. For estimating the angular clustering of a single\nsample, i = j, we use the standard method of counting the\nnumber of galaxy pair within a certain separation, namely\npairs of galaxies from the same sample, hDDi, pairs of galaxies from a random mock sample and the COMBO-sample,\nhDRi, and pairs between galaxies from the same mock sample, hRRi (Landy & Szalay 1993). The number of pairs involving random mock samples is averaged over 50 mock realisations for each correlation function.\n\n9\n\nFor the random catalogue, we assume that the completeness of the galaxies inside a redshift is homogeneous,\nso that the only relevant parameters for the random mocks\nis the number of galaxies and the masking, which is applied\nfor all galaxies equally.\nThe cross-correlation function, i 6= j, is computed implementing the estimator (Szapudi & Szalay 1997):\nωij (θ) =\n\nhDi Dj i\nhDi Rj i + hDj Ri i\n−\n+1,\nhRi Rj i\nhRi Rj i\n\n(23)\n\nfor which counting the number of pairs between different\ngalaxy samples, Di/j , and different mock samples, Ri/j , is\nrequired. For example, hRi Dj i denotes the number of pairs\nbetween galaxies from a i-mock catalogue and galaxies j\nwithin a certain θ separation interval. Note that the size of\nthe mock sample Rk is the same as the size of the galaxy\nsample Dk .\nTraditionally, galaxy clustering is studied using the angular correlation function ω(θ). For a comparison of our\nresults for the two-point statistics of galaxy clustering in\nCOMBO-17 with the literature, we infer the angular correlation function from the N -statistics by applying the method\noutlined in Simon et al. (2007). This method allows us to be\nignorant about the integral constraint which offsets the estimates of ω(θ) obtained from the aforementioned estimators.\nWe parameterise ω(θ) as a simple power-law\n„ «−δ\nθ\nω(θ) = Aω\n;\n(24)\n1′\nAω and δ are constants. Moreover, we deproject ω(θ) in\norder to obtain an average 3D-correlation function for the\nclustering of the samples,\n„ «−δ−1\nr\nξ(r) =\n,\n(25)\nr0\nafter having made sure that the Limber approximation (Peebles 1980; Limber 1953) was valid here (Simon 2007); the\nconstant r0 is the correlation length.\nAs the 2D-correlation functions are not exactly powerlaws (Zehavi et al. 2004), the foregoing procedure will yield\nparameters for the 3D-clustering which are biased to some\nextent. We do not discuss this effect further but point out\nhere that this bias could, in principle, be estimated from\nthe halo-model fit, which also predicts the 3D-correlation\nfunction.\n\n4.2.2\n\nResults\n\nThe combined measurements of the 2nd -order N -statistics\nfor blue and red galaxies can be found in Fig. 6. The\nN -statistics is binned between 0′ .1 6 θap < 23′ using five\nlogarithmic bins. The statistical errors are somewhat correlated which can be seen in Fig.5. The best fits of the\nangular clustering and 3D-clustering parameters are listed\nin Table 2. Averaging over all redshift bins, we find for\nthe red sample Aω = 0.35 ± 0.06, δ = 0.85 ± 0.10 and\nr0 = 5.5 ± 0.9 h−1 Mpc. The corresponding values of the\nblue sample are Aω = 0.08 ± 0.02, δ = 0.65 ± 0.08 and\nr0 = 3.0 ± 0.4 h−1 Mpc. If we combine the red and blue\nsample, we find as average over all redshifts for all galaxies\nAω = 0.11±0.01, δ = 0.79±0.03 and r0 = 3.8±0.3 h−1 Mpc.\n\n\f10\n\nP. Simon et al.\n\n2 i and hN 2\nFigure 6. Variance of the aperture number count, hNred\nblue i, for red (filled circles) and blue (filled stars) galaxies. The straight\nlines are the best-fitting power laws to the measurements. The thick solid line denotes the theoretical variance for galaxies unbiased to\nthe dark matter (as in Smith et al. 2003). Also plotted is the aperture number count cross-correlation, hNred Nblue i, between blue and\nred galaxies (open stars). The data points are slightly shifted along the abscissa to increase the visibility.\n\nIn the following, we would like to compare the best-fit\nparameters for the galaxy clustering to the results of other\npapers. Since the data sample selections between different\nsurveys are in general not equal, we can only make a crude\ncomparison to other results. Typical values for the clustering of galaxies, regardless of their colour, at low redshifts are\nr0 = 4 − 6 h−1 Mpc and δ = 0.6 − 0.9 (cf. McCracken et al.\n2008; Hawkins et al. 2003; Zehavi et al. 2005; Norberg et al.\n2002; Zehavi et al. 2002). Compared to these values our results are compatible, although we may have somewhat lower\nvalues for r0 . A lower clustering amplitude may be explained\nby a different mean luminosity of our sample, though. See\nin particular Coil et al. (2008) for the dependence of galaxy\nclustering parameters on absolute luminosity.\nSubdividing the galaxy sample of COMBO-17 into red\nand blue galaxies yields different clustering properties: red\ngalaxies are more strongly clustered than blue galaxies and\nred galaxies have steeper slopes γ than blue galaxies. Similar cuts have been done in McCracken et al. (2008) and Coil\net al. (2008) who find clustering properties in good agree-\n\nment with our measurements up to redshifts of z ∼ 1. Beyond the statistical uncertainties of our measurements we\ndo not find a change in clustering of our samples as, for example, reported by the more accurate measurements of Coil\net al.\n\nPhleps et al. (2006) measured the clustering of red and\nblue galaxies, examining the clustering in redshift space\nwithin the range of 0.4 6 z 6 0.8, with the same data set\nas we do and applying the same red-sequence cut. They\nquote values for the red sample which are comparable to\nour result. The blue sample is somewhat different, though,\nwith a marginally higher r0 = 3.65 ± 0.25 h−1 Mpc and a\nshallower δ = 0.45 ± 0.03. We suspect that the difference\nis due to a different magnitude cut in addition to the redsequence cut: Phleps et al. selected only galaxies brighter\nthan MB = −18, whereas our magnitude limits are colour\ndependent, Eq. (11).\n\n\fClustering and joint HOD of red and blue galaxies in COMBO-17\n\n11\n\nTable 2. The results are for Ωm = 0.3, ΩΛ = 0.7. Upper half of table: summary of results (median and 68% confidence levels) obtained\nconsidering values for hN 2 i out of θ ∈ [0.1′ , 23′ ] for red and blue galaxies for different mean redshifts, z̄. Note that the statistical errors\nof δ and Aω are strongly anti-correlated with a correlation coefficient of about −0.6. Lower half of table: the fit for ω(θ) has been\ntransformed into the 3D-galaxy clustering function ξ(r) = (r/r0 )−γ using Limber's equation. The clustering length r0 is in units of\nh−1 Mpc; ξ1Mpc denotes ξ(r) at a comoving length of r = 1 h−1 Mpc. Parameters with a \"|δ\"-suffix are fits for a fixed slope: δ = 0.85, 0.65\nfor red and blue, respectively.\nz̄\n\n0.31\n0.50\n0.70\n0.90\nz̄\n0.31\n0.50\n0.70\n0.90\n\n4.3\n4.3.1\n\nRED SAMPLE\nχ2 /n\nAω |δ\n\nBLUE SAMPLE\nχ2 /n\nAω |δ\n\nχ2 /n]\n\n[Aω\n\nδ\n\n0.47+0.12\n−0.12\n0.29+0.06\n−0.06\n0.45+0.07\n−0.07\n0.28+0.08\n−0.08\n\n0.2\n3.0\n0.6\n0.4\n\n0.11+0.20\n−0.04\n0.08+0.02\n−0.02\n0.08+0.02\n−0.02\n0.08+0.27\n−0.03\n\n0.49+0.35\n−0.39\n0.76+0.12\n−0.13\n0.67+0.12\n−0.14\n0.33+0.30\n−0.27\n\n1.2\n3.8\n2.3\n1.3\n\n0.09+0.02\n−0.02\n0.09+0.02\n−0.02\n0.08+0.01\n−0.01\n0.05+0.01\n−0.01\n\n0.8\n4.5\n2.3\n0.8\n\nξ1Mpc\n\nr0 |δ\n\nξ1Mpc |δ]\n\n[r0\n\nγ\n\nξ1Mpc\n\nr0 |δ\n\nξ1Mpc |δ]\n\n20.6+7.4\n−6.9\n17.8+4.9\n−4.7\n40.3+7.9\n−7.7\n+10.3\n28.7−9.25\n\n5.19+0.67\n−0.74\n5.04+0.56\n−0.62\n7.51+0.66\n−0.71\n6.58+0.94\n−1.07\n\n21.0+5.3\n−5.2\n19.9+4.3\n−4.3\n41.7+7.0\n−7.0\n32.7+9.19\n−9.17\n\n2.98+2.74\n−1.12\n2.66+0.57\n−0.51\n3.20+0.59\n−0.51\n3.52+1.82\n−0.97\n\n1.49+0.35\n−0.39\n1.76+0.12\n−0.13\n1.67+0.12\n−0.14\n1.33+0.30\n−0.27\n\n5.0+2.5\n−2.0\n5.6+1.5\n−1.4\n6.9+1.3\n−0.6\n5.5+1.4\n−1.4\n\n2.50+0.38\n−0.42\n3.08+0.35\n−0.38\n3.30+0.29\n−0.31\n2.70+0.33\n−0.36\n\n4.6+1.2\n−1.2\n6.4+1.2\n−1.2\n7.2+1.1\n−1.1\n5.1+1.1\n−1.1\n\n[Aω\n\nδ\n\n0.46+0.15\n−0.14\n0.27+0.07\n−0.07\n0.44+0.09\n−0.09\n0.31+0.16\n−0.11\n\n0.81+0.19\n−0.27\n0.97+0.13\n−0.16\n0.85+0.14\n−0.17\n0.69+0.31\n−0.44\n\n0.3\n2.4\n0.6\n0.7\n\n[r0\n\nγ\n\n5.37+2.72\n−1.54\n4.37+1.06\n−0.86\n7.43+2.00\n−1.42\n7.60+5.20\n−2.41\n\n1.81+0.19\n−0.27\n1.97+0.13\n−0.16\n1.85+0.14\n−0.17\n1.69+0.31\n−0.44\n\nχ2 /n]\n\nto the data d, is:\n\nRelative linear stochastic bias\nMethod\n\nm(p) =\n„\n2\n2\nb2 (θ1 )hNblue\n(θ1 )|true i, b2 (θ2 )hNblue\n(θ2 )|true i, . . . ,\n\nThe aim of this section is to constrain the relative linear\nstochastic bias of the red and blue galaxy sample using the\nmeasurements of the aperture number count statistics. Simply applying the definitions, Eq. (7) and (8), to the measurements would probably result in a biased estimate of the\nbias parameters due to the relatively large uncertainty in\nthe aperture statistics. A more reliable, but also more elaborate, approach consists in employing Bayesian statistics,\nsee Appendix C.\nOur combined measurement of the aperture statistics\nfor different aperture radii, θi , is compiled inside the vector:\n„\n2\n2\n2\nd =\nhNred\n(θ1 )i, hNred\n(θ2 )i, . . . , hNred\n(θi )i, . . .\n\nThe N -statistics involving the red galaxy population is expressed in terms of the blue population statistics and the\nlinear stochastic bias parameters.\nNow, the likelihood of the parameters p given the data\nd is for Gaussian errors:\n„\n«\n1\nP (d|p) ∝ exp − [d − m(p)]t C−1 [d − m(p)] .\n(29)\n2\n\n(26)\n\nThe posterior likelihood, up to a constant factor, of b(θi )\n2\nand r(θi ) given d and marginalised over hNblue\n(θi )|true i is\n\nhNred (θ1 )Nblue (θ1 )i, hNred (θ2 )Nblue (θ2 )i, . . . ,\n«t\n2\n2\nhNblue\n(θ1 )i, hNblue\n(θ2 )i, . . .\n.\n\nThe covariance of d, C, is worked out according to what\nhas been outlined in Sect. 4.1. The measurement d is an\nestimate of the true, underlying aperture statistics. Let\n2\nhNblue\n(θi )|true i be the true aperture number count dispersion of blue galaxies.3 For given linear stochastic bias parameters and the true aperture number count dispersion of\nblue galaxies,\n`\n ́t\n2\np ≡ . . . , hNblue\n(θi )|true i, . . . , b(θi ), . . . , r(θi ), . . . ,\n(27)\nthe expected N -statistics of blue and red galaxies, \"fitted\"\n\n3\n\nWithout further assumptions, the best estimate for the true\n2\n(θ)i itself. By putting constraints on the\nN -dispersion is hNblue\nrelation between the aperture statistics of red and blue galaxies, as we are doing by constraining the parameters of the linear\nstochastic biasing, this can change.\n\nr(θ1 )b(θ1 )hNblue (θ1 )|true i, r(θ2 )b(θ2 )hNblue (θ2 )|true i, . . . ,\n«t\n2\n2\n.\n(28)\nhNblue\n(θ1 )|true i, hNblue\n(θ2 )|true i, . . .\n\nP (b(θi ), r(θi )|d) ∝\n(30)\n#\nZ \"NY\nbin\n2\ndhNblue\n(θi )|true i P (b(θi )) P (r(θi )) P (d|p) .\ni=1\n\nThe probabilities P (b(θi )) and P (r(θi )) are priors on\nthe bias parameters which we chose to be flat within\nb(θi ) ∈ [0, 4], r(θi ) ∈ [0, 1.3] and zero otherwise. The upper\nlimits of the priors were chosen to be well above crude estimates for b and r, obtained by blindly applying Eqs. (7)\nand (8) to the data. The number of aperture angular radii\nbins is Nbin .\nThe marginalised posterior likelihood P (b(θi ), r(θi )|d)\nof the overall ten variables (ten bias parameters for five\naperture radii) is most conveniently sampled employing the\nMonte-Carlo Markov Chain (MCMC) technique (e.g. Tereno\net al. 2005). Especially, the marginalisation is trivial within\nthis framework. Remember that the size of the data vector\nis p = 15.\n\n\f12\n\nP. Simon et al.\n\nFigure 7. Relative linear stochastic bias between the red and blue galaxy sample for four mean redshifts, b(θap ) is in the left panel and\nr(θap ) in the right right panel. The shaded area denotes the 1σ-confidence region about the mean of all redshifts taken together. The\neffective proper spatial scale for an aperture radius of 10′ at redshift z = 0.3, 0.5, 0.7, 0.9 is 2.8, 3.8, 4.5, 4.8 h−1 Mpc. The lines show the\nbest-fitting models for z̄ = 0.7 discussed later on in Sect. 6.3 (solid: no central galaxies, dot-dashed: red central galaxies, dotted: red and\nblue central galaxies). The data points are slightly shifted to increase the visibility.\n\n4.3.2\n\nResults\n\nThe Fig. 7 shows the inferred constraints on the relative linear stochastic bias of red and blue galaxies. Owing to relatively large remaining statistical uncertainties, which makes\nall redshift bins indistinguishable, we have combined the signal from all redshift bins (shaded areas).\nAs already seen in Fig. 6, red and blue galaxies are\ndifferently clustered with respect to the dark matter and\ntherefore have also to be biased relative to each other. This\ndifference is equivalent to a relative bias factor of about b ∼\n1.7−2.2 with some evidence for a rise towards radii of about\nθap ∼ 2′ and a subsequent decline for even smaller radii.\nThe evidence for this scale-dependence is, however, weak. A\nrise is expected, though, because of the different power-law\nslopes of hN 2 i for the two samples.\nFor the lowest redshift bin, this is in good agreement\nwith Madgwick et al. (2003), their Fig. 4. Furthermore, the\nobserved scale-dependence explains why we find an overall\nlarger value for the red/blue bias than other authors who\ndetermined the relative bias with various different methods on larger scales, e.g. Conway et al. (2005), b ≈ 1.3\nat 15 h−1 Mpc, Wild et al. (2005), b ≈ 1.8 at 10 h−1 Mpc,\nWillmer et al. (1998), b ≈ 1.2 at 8 h−1 Mpc, Guzzo et al.\n(1997), b ≈ 1.7. According to our halo model (Fig. 12), which\nwill be discussed in the following sections, we should expect\na steep decline of the bias factor down to b ∼ 1.5 beyond our\nlargest aperture radius which would reconcile our b ∼ 2 − 3\nwith other studies.\nWithin the errors we do not see an evolution of the\nrelative bias with redshift as, for example, has been reported\nby Le Fevre et al. (1996). This would support the finding of\nPhleps & Meisenheimer (2003).\nRecently, Coil et al. (2008) have reported for DEEP2 a\n\nrelative bias of b ∼ 1.28 averaged over spatial scales between\n1 − 15 h−1 Mpc and b ∼ 1.44 for 0.1 − 15 h−1 Mpc which implies an increase of the bias for scales smaller than 1 h−1 Mpc.\nThis also agrees with our finding.\nFor the bias parameter r(θap ) we can make out a\ntrend of decorrelation, r 6= 1, between the two samples\ntowards small scales starting from about 10′ , which corresponds to (proper) ∼ 3 − 5 h−1 Mpc depending on the mean\nredshift. We estimate that the correlation factor drops to\nr ∼ 0.60 ± 0.15 on the smallest measured scale. An evolution\nwith redshift exceeding the statistical errors is not visible.\nTherefore, as other authors, we find a correlation close\nto unity on large scales (e.g. Wild et al. 2005; Conway et al.\n2005; Blanton 2000; Tegmark & Bromley 1999) that is decreasing towards smaller scales. We expect our data points\nto become eventually consistent with r ∼ 1 not far beyond\nθap & 20′ . Note, again, that we are probing smaller scales\nthan the cited authors due to different methods.\nWang et al. (2007) studied the cross-correlation statistics of galaxy samples with different luminosities and colours\nin SDSS. Their results for the cross-correlation between the\nfaint red and faint blue sample is consistent with our results. In particular, they also find a decrease of r(θap ) towards smaller scales (see their Fig. 16, bottom panels).4 Coil\net al. (2008) pointed out that below a scale of 1 h−1 Mpc the\ncross-correlation function of their blue and red sample drops\nbelow the geometric mean of the separate auto-correlation\nfunctions. This is to say that their correlation factor becomes\nless than unity on these scales. In this context, see also Fig.\n11 of Swanson et al. (2008) where a decorrelation towards\n\n4\n\nNote that Wang et al. are essentially plotting r −2 (θap ).\n\n\fClustering and joint HOD of red and blue galaxies in COMBO-17\n\n13\n\nsmaller scales is found for splitting the data set into red and\nblue galaxies.\n\n5\n\nGALAXY-GALAXY LENSING\n\n5.1\n\nMethod\n\nTo impose further constraints on the following halo-model\nanalysis, we additionally measure the mean tangential shear\nof source galaxies (GaBoDS), hγt i, as function of separation\nθ about the red and blue lens-galaxies (COMBO-17) for different redshifts, i.e.\nD\nE\nhγt (θ)i = − ǫ(θ 1 )e−2i∠θ 1 ,θ 2 ,\n(31)\n\nwhere the average tangential ellipticity over all source-lens\npairs with separation θ = |θ 1 − θ 2 | has to be taken (cf.\nKleinheinrich et al. 2006); ∠θ 1 , θ 2 is the angle that is\nspanned by θ 2 − θ 1 , the difference vector between source\nand lens position, and the x-axis.\nThe mean tangential shear about lenses can be related to the differential projected matter over-density about\nlenses, in excess to the cosmic mean (e.g. McKay et al. 2001),\n∆Σ(θ) ≡ Σ(< θ) − Σ(θ) =\n\nhγt i(θ)\nΣ−1\ncrit\n\n(32)\n\nwith\nΣ−1\ncrit\n\n4πG\n= 2\nc\n\nfi\n\nfk (wl )fk (ws − wl )\nfk (ws )\n\nfl\n\n,\n\n(33)\n\nif we specify a fiducial cosmology and the distribution of\nsources (lenses) in distance from the observer, ws (wl ); h. . .i\ndenotes the average over the lens and source distribution.\nThe function fk (w) is the comoving angular diameter distance as function of the comoving radial distance w and the\ncurvature, k, of the fiducial cosmological model. By Σ(< θ)\nwe denote the average line-of-sight over-density within a radius of θ, the lens is at the disk centre, whereas Σ(θ) is\nthe average over-density over an annulus with radius θ. We\nrescale our measurements of hγt i with Σcrit in order to get\nrid of the influence of the lensing efficiency. This gives us\ncomparable quantities for lenses of all redshift bins.\nFor the redshift distribution of the sources we use the\nfit of Hetterscheidt et al. (2007) to the empirical distribution\nof photometric redshifts as seen in the Deep-Public Survey\n(DPS) (Hildebrandt et al. 2006), see Fig. 9. Our shear catalogue is a sub-sample of the shear catalogue used in that\nstudy.\nA representative example for the correlation of statistical errors in the GGL estimate, and the cross-correlation\nbetween N -statistics errors and GGL errors, is given by Fig.\n5.\n5.2\n\nFigure 9. Distribution of sources belonging to the cosmic shear\ncatalogue, as estimated by the photometric redshifts of galaxies\ninside the magnitude interval R ∈ [21.5, 24.5] in the DPS. The\nblack histogram shows the empirical distribution, the red histogram is the fit to the data. The empirical data points around\nz = 1.1 (dip) are down-weighted in the fit due to systematics in\nthe photometric redshifts. The error bars denote the field-to-field\nvariance. The mean redshift of the sources is z̄ = 0.78. The figure\nis taken from Hetterscheidt et al. (2007).\n\nResults\n\nOur measurements for of ∆Σ(θ) are shown in Fig. 8. The\ndata is binned between 6′′ 6 θ < 3′ into five logarithmic bins\nin angular separation. The remaining statistical uncertainties are high so that almost all measurements are at 1σ\nconsistent with zero. However, when combining all redshifts\nbins, we find a slight signal for both the red and the blue\ngalaxy sample. The combined red signal is higher than the\n\nblue signal, roughly by a factor of two or three. This is consistent with what was found by Kleinheinrich et al. (2006),\nusing the same data, Sheldon et al. (2004), McKay et al.\n(2001) and Guzik & Seljak (2001). It implies that the environment of red galaxies (or the galaxy itself) contains more\nmass than the environment of a typical blue galaxy, or that\nthe typical size of a blue lens halo is smaller than that of a\nred lens, although it might have the same mass than the red\nlens halo.\nWhen fitting HOD parameters to the data, we use the\nGGL signal of the different redshift bins to constrain the\nallowed regime of lensing predictions by our model. Due to\nthe large statistical uncertainties of the measurement, the\nGGL mainly serves as an upper limit.\n\n6\n\nINTERPRETATION WITHIN A HALO\nMODEL FRAMEWORK\n\nIn this section, we translate the clustering statistics and\nGGL-signal of the galaxy samples into halo-model parameters. The halo-model description is utilised to describe\nthe 3D-distribution of galaxies and dark matter. We only\nbriefly summarise the halo-model formalism here and refer\nthe reader to the literature for the details. How the 3Ddistributions, expressed by the halo-model, relates to the\nobserved projected angular distribution on the sky is discussed later on in Sect. 6.3. The reader may find the details\non the dark matter halo properties used for this paper in\nAppendix A. Note that the notation used therein is introduced in this section. The Fourier transform of a function\nf (r), denoted by a tilde f ̃(k), is defined in analogy to Eq.\n(5) but now for three dimensions.\n\n\f14\n\nP. Simon et al.\n\nFigure 8. Differential surface mass density, ∆Σ, as function of angular separation about lenses from the red (left panel) and blue (right\npanel) galaxy samples as inferred from GGL. The shaded area denotes the 1σ-confidence region about the mean of all redshifts taken\ntogether. The data points are slightly shifted to increase the visibility. From the lowest to the highest redshift, a separation of 0′.5\ncorresponds to a projected comoving distance of 125 h−1 kpc, 195 h−1 kpc, 265 h−1 kpc or 320 h−1 kpc, respectively.\n\n6.1\n\nHalo-model description\n\n6.1.1\n\nni (r) =\n\nGeneral halo-model formalism\n\nj=1\n\nThe halo model is an analytical prescription for the clustering of dark matter that was motivated by N-body simulations of the cosmic structure formation (for a review: Cooray\n& Sheth 2002). All matter is enclosed inside typical haloes\nwith a given mass spectrum. Galaxy mock catalogues can\nbe generated within this framework by populating virialised\ndark matter haloes with galaxies according to a prescription\ntaken directly from semi-analytic models of galaxy formation or hydrodynamic simulation that include recipes for\nthe formation (evolution) of galaxies (Berlind & Weinberg\n2002; Benson et al. 2000). The parameters for populating\nthe haloes with galaxies depend solely on the halo mass.\nThe halo-model description has been quite successful in describing or fitting observational data, although doubts about\nthe strict validity of the basic model assumptions have been\ncast recently by Gao & White (2007) and Sheth & Tormen\n(2004) (assembly bias).\nOne key assumption of the halo model is that the dark\nmatter density or galaxy number density are linear superpositions of in total Nh haloes with a typical radial profile5 :\n\n5\n\nActually, this expansion assumes that galaxies or dark matter\nare smoothly spread out over the halo. This is a good approximation if the number of particles is large. For discrete particles,\nlike galaxies, that are only on average distributed according to\nthe halo profile, the more accurate expansion would be:\nni (r) =\n\nNh Ni (mk )\nX\nX\n\nk=1\n\nδD (r − rk − ∆rkl ) ,\n\nNh\nX\n\n(34)\n\nl=1\n\nwhere ∆rkl is the position of the l-th galaxy relative to the k-th\n\nNi (mj )ui (r − r j , mj ) .\n\n(35)\n\nThe halo profiles, ui , describe the spatial distribution of\ngalaxies, i > 0, or dark matter, i = 0, within haloes. All profiles considered here are normalised to unity.\nThe profiles depend on an additional parameter, m,\nwhich is the total mass of the dark matter halo, r is a position within the comoving frame and r i is the centre of the\ni-th halo. By Ni (mj ) we denote either the number of galaxies, type i, populating the j-th halo (if i > 0), or if i = 0\nthe dark matter mass, mj , that is attached to the j-th halo.\nIn the latter case, n0 (r) is simply the dark matter density\nas function of position. In particular, N0 and Ni with i > 0\nhave, for convenience within the formalism, different units6\n(halo mass versus number of galaxies).\nIn general, the halo-occupation number Ni (mj ) and\nthe halo centre, r j , are random numbers. The conditional\nprobability distribution of the halo-occupation number,\nP (Ni |mj ), is a function of the halo mass only. In the case\nof dark matter, i = 0, one has simply N0 (mj ) ≡ mj , i.e.\nP (N0 |mj ) = δD (N0 − mj ), thus the mass associated with a\n\"dark matter halo mi \" is always mi , whereas the number\nof galaxies living inside haloes of same mass may vary from\nhalo to halo.\nBoth Ni (mj ) and ui (r, mj ) depend solely on mj and\nnot on the mass or position of any other halo. Moreover, the\nposition of a halo, r j , and its mass, mj , are postulated to\nbe statistically independent. However, the halo-occupation\nnumbers of different galaxies i and j inside the same halo\n\nhalo centre. The discreteness makes a difference for the one-halo\nterm, which is taken into account for the following results.\n6 The proper normalisation for the power spectra is done by N .\ni\n\n\fClustering and joint HOD of red and blue galaxies in COMBO-17\nmay be statistically dependent on each other. For example,\ninside the same halo the number of red galaxies may be\nrelated to the number of blue galaxies and vice versa. This\nis the idea behind the concept of the joint halo-occupation\ndistribution.\nBased on these assumptions, the halo model predicts\nthe 3D-power spectra of galaxy number density correlations, galaxy-mass density correlations and mass-mass correlations, Pij (k), as function of a halo mass spectrum, halo\nbias parameters, typical density profiles and a HOD of galaxies:\nD\nE\nñi (k)ñj (k′ )\n= (2π)3 Pij (|k|)δD (k + k ′ ) .\n(36)\nn̄i n̄j\nHere and in the following, h. . .i is the statistical average\nover all possible haloes, and n̄i means the average number of\ngalaxies per unit volume. This paper only considers isotropic\nhalo density profiles ui (r, m) independent of the direction of\nr, so that:\nR∞\ndr rk−1 ui (r, m) sin (kr)\nũi (k, m) = 0 R ∞\n.\n(37)\ndr r 2 ui (r, m)\n0\nThis equation includes a normalisation of the density profile.\nFollowing the calculations of Scherrer & Bertschinger\n(1991) one finds for the power spectra (k > 0 and Nh ≫ 1):\nPij (k) = Pij1h (k) + Pij2h (k) ,\n\n(38)\n\nwhere the so-called one-halo term is\nZ ∞\nm\n1h\ndm n(m)Kij\n(k, m) ,\nPij1h (k) =\nρ̄N i N j 0\n\n(39)\n\nthe two-halo term\nPij2h (k)\n\n=\n\n1\nN iN j\n\nZ\n\n∞\n\ndm1 n(m1 )\n0\n\nZ\n\n∞\n\ndm2 n(m2 ) ×\n\n0\n\n(40)\n\ncross-power spectra) give different results for the above integrals. To save space, all variants are encapsulated into the\nintegral kernels7\n1h\nKij\n(k, m)\n\n=\n\ni (m)\nD NX\n\nNj (m)\n(q)\n\nX\n\nũi (k, m)\n\nr=1\n\nq=1\n\nK\n−δij\n\n2h\nKij\n(k, m)\n\n=\n\nD Nj (m)\nX\nq=1\n\ni (m)\nD NX\n\nq=1\n\nE\n(r)\nũj (k, m) − (43)\n\nE\n(q)\n[ũj (k, m)]2 ,\n\n(q)\nũi (k, m)\n\nj (m)\nED NX\n\nr=1\n\nE\n(r)\nũj (k, m) ,(44)\n\nwhere h. . .i denotes the average over all haloes of mass m\n(q)\nand ũi (k, m) expresses the spatial probability distribution\nof the q-th, out of q ∈ [1, Ni (m)], galaxies belonging to the\nsample i and a particular halo of mass m.\nWe need this further distinction into various spatial\ndistributions since we may split a galaxy sample into one\ncentral galaxy – sitting at the halo centre hence having\nũ(k, m) = 1 – and (Ni (m) − 1) satellite galaxies with a different distribution. The term with the Kronecker pre-factor,\nK\nδij\n, in Eq. (43) is only applied if both samples i and j are\ndiscrete (galaxies). It accounts for the subtraction of white\nshot-noise contribution, 1/n̄i , to the clustering power that\nis not measured due to the definition of the clustering correlation function, ω(θ) (excess of pairs over a uniform distribution), and the aperture statistics. For the smooth dark\nmatter, i = 0, one has to substitute in the Eqs. (43) and (44)\nPNi (m) (q)\nũi (k, m) ≡ m ũ0 (k, m), which simplifies the equaq=1\ntions.\nAs an example, if all galaxies of a same sample i have\nidentical spatial distributions, ũi (k, m), one will find for i 6=\nj and i, j > 0:\nNi (m)\n\n2h\nP (k, m1 , m2 )Kij\n(k, m1 , m2 )\n\nX\n\n(q)\n\nũi (k, m)\n\n= Ni (m)ũi (k, m) ,\n\n(45)\n\nq=1\n\nand\nNi =\n\n15\n\nZ\n\n∞\n\nD\n\nE\n\ndm n(m) Ni (m) ; m =\n0\n\nZ\n\n∞\n\ndm n(m) m . (41)\n\n2h\nKij\n(k, m) =\n\n0\n\nThe mean number density of galaxies is\nD\nE\nρ̄\nNi .\nn̄i = ni (r) =\nm\n\n1h\nKij\n(k, m) =\n\n(42)\n\nThe function n(m)dm is usually the mean number density of haloes within the mass interval [m, m + dm]. Note,\nhowever, that in the above equations, and for the following\nn̄i , n(m) may be rescaled by any arbitrary\nconstant\nwithD\nE\n\nout changing the results. The average Ni (m) is the mean\n\nnumber of galaxies found within a halo of mass m (for i > 0),\nor the mass of the halo itself, if i = 0. Notice that after the\nstatistical average performed for the power spectra we have\nshifted the notation from Ni (mk ) (number of i-galaxies inside halo k) to Ni (m) (number of i-galaxies inside a halo of\nmass m).\nBy ρ̄ = ρcrit Ωm we denote the mean comoving matter\ndensity of the dark matter that is included inside the dark\nmatter haloes. The constant Ωm is the matter density parameter and ρcrit the critical density.\nThe different cases of power spectra (galaxy auto-power\nspectra, galaxy cross-power spectra, dark matter/galaxy\n\nD\nE\nũi (k, m)ũj (k, m) Ni (m)Nj (m) ,\nD\nED\nE\nũi (k, m)ũj (k, m) Ni (m) Nj (m) .\n\nA galaxy sample with Nicen (m) ∈ {0, 1} central galaxies and\nNisat (m) satellites of same in-halo distribution ũi (k, m) has\nNi (m)\n\nX\n\n(q)\n\nũi (k, m) = Nicen (m) + Nisat (m)ũi (k, m) .\n\n(46)\n\nq=1\n\nFrom Eq. (45) and (46) all kernels relevant for this paper\nfollow. They are listed in Table 3.\nThe function P (k, m1 , m2 ) means the cross-power spectrum of the number densities of haloes with masses m1 and\nm2 . It is common practice to assume a linear deterministic\nbiasing between the halo number density and the linear dark\nmatter density (Cooray & Sheth 2002):\nP (k, m1 , m2 ) ≈ Plin (k) b(m1 ) b(m2 )\n\n(47)\n\nwith b(m) being the linear bias factor of haloes with mass\n7 The spatial distributions of galaxies inside the same halo are\npostulated to be statistically independent, the kernels follow from\nEq. (34).\n\n\f16\n\nP. Simon et al.\n\nTable 3. Integration kernels for the one- and two-halo term, Eqs. (39) and (40). In the simple model, all galaxies of same type are\ndistributed over the halo the same way. For the central-galaxy scenario, the halo occupation, Ni (m) = Nicen (m) + Nisat (m), of every\ngalaxy type, i, is split into a central galaxy and satellite galaxies. Here, it is explicitly assumed that Nisat (m) > 0 requires Nicen (m) = 1,\ni.e. hNicen (m)Nisat (m)i = hNisat (m)i. The mixed model assumes one type of galaxies, i, to possess a central galaxy and another, j,\nhaving no central galaxy as in the simple model. For that case, i is described by the central model, j by the simple model; only for the\ncross-correlation of both a new kernel is needed. Note that N0 (m) ≡ m, dark matter is always \"simple\".\ni\n\nj\n\n1h (k, m)\nintegral kernel Kij\n\n0\n\n0\n\n[ũ0 (k, m)]2 m2\n\ni>0\n\nj=i\n\nD\nE\n[ũi (k, m)]2 Ni (m) (Ni (m) − 1)\n\ni>0\n\nj 6= i\n\nD\nE\nũi (k, m)ũj (k, m) Ni (m)Nj (m)\n\ni>0\n\n0\n\nD\nE\nD\nE\nũ0 (k, m)m Nicen (m) + ũi (k, m)ũ0 (k, m)m Nisat (m)\n\nj=i\n\nD\nE\nD\n`\n ́E\n2ũi (k, m) Nisat (m) + [ũi (k, m)]2 Nisat (m) Nisat (m) − 1\n\n.\n\nj 6= i > 0\n\nD\nE\nD\nE\nũi (k, m) Nisat (m)Njcen (m) + ũj (k, m) Njsat (m)Nicen (m) +\n\n.\n\nmodel type\n\nsimple\n.\n.\n.\n.\n\ncentral\n.\n\ni>0\ni>0\n\n.\n.\n\nD\nE D\nE\nũi (k, m)ũj (k, m) Nisat (m)Njsat (m) + Nicen (m)Njcen (m)\n\ni>0\n\nj 6= i\n\nD\nE\nD\nE\nũj (k, m) Nicen (m)Nj (m) + ũi (k, m)ũj (k, m) Nisat (m)Nj (m)\n\ni\n\nj\n\n2h (k, m , m )\nintegral kernel Kij\n1\n2\n\ni\n\nj\n\nD\nED\nE\nũi (k, m1 )ũj (k, m2 ) Ni (m1 ) Nj (m2 )\n\ni>0\n\n0\n\nũ0 (k, m2 )m2\n\ni>0\n\nj>0\n\nh\nD\nE\nD\nEi\nũj (k, m1 ) Nicen (m1 ) + ũi (k, m1 )ũj (k, m1 ) Nisat (m1 ) ×\n\n.\n\nmixed\n\nmodel type\n\nsimple\n\nhD\nE\nD\nEi\nNicen (m1 ) + ũi (k, m1 ) Nisat (m1 )\n\ncentral\n.\n.\n.\n\nh\nD\nE\nD\nEi\nũi (k, m2 ) Njcen (m2 ) + ũi (k, m2 )ũj (k, m2 ) Njsat (m2 )\n\ni>0\n\nj 6= i\n\nD\nE hD\nE\nD\nEi\nũj (k, m2 ) Nj (m2 )\nNicen (m1 ) + ũi (k, m1 ) Nisat (m1 )\n\nm and Plin (k) the linear dark matter power spectrum. This\nreduces the 2D-integral in Eq. (40) to a simpler product of\n1D-integrals.\n\n6.1.2\n\n.\n\nJoint halo-occupation distribution\n\nWithin the framework of the halo model (see Eqs. (39) and\n(40)), one works out the clustering statistics of galaxies by\nspecifying the mean number of galaxies for a halo of certain mass m, hNi (m)i, and the mean number of galaxy\npairs, either pairs of the same galaxy type (auto-power),\nhNi (m)(Ni (m) − 1)i, or pairs between different galaxy types\n(cross-power), hNi (m)Nj (m)i. Things become slightly more\n\nmixed\n\ndifficult, though, if we distinguish between central galaxies\nand satellite galaxies as can be seen in Table 3.\nIn general, the number of galaxies or galaxy pairs for a\nfixed halo mass are first and 2nd -order moments of a joint\nhalo occupation distribution (JHOD) of two galaxy populations i and j. The JHOD, P (Ni , Nj |m), determines the probability to find a certain number of \"galaxies i\" and \"galaxies\nj\" inside the same halo of mass m. The 2nd -order moment,\nhNi (m)Nj (m)i =\n\n∞\nX\n\nNi ,Nj =0\n\nP (Ni , Nj |m) Ni Nj ,\n\n(48)\n\nof the JHOD can conveniently be parameterised in terms of\nthe mean halo-occupation number,\n\n\fClustering and joint HOD of red and blue galaxies in COMBO-17\nAnti−correlated joint HOD\n\nUncorrelated joint HOD\n\nR=−1\n\n17\n\nCorrelated joint HOD\n\nR=+1\n\nR=0\n\nFigure 10. Simplified illustration of the concept of the joint halo occupation distribution for three cases. Left panel: the dark matter\nhaloes (shady disks) are filled with different galaxy types that tend to avoid each other. If the number of red, elliptical, galaxies is\nincreased for a halo of given size, the number of blue spiral, galaxies decreases. Right panel: over- and under densities of the two galaxy\npopulations are highly correlated. If the number of red galaxies for a halo of a given size increases, the number of blue galaxies increases\nas well. Middle panel: the halo-occupation numbers are not correlated.\n\nD\n\nE\nNi (m) =\n\n∞\nX\n\nNi ,Nj =0\n\nP (Ni , Nj |m) Ni ,\n\n(49)\n\nthe (central) variance of the HOD,\nσi (m) ≡\n\nrD\n\nE D\nE2\nNi2 (m) − Ni (m) ,\n\n(50)\n\nand the JHOD-correlation factor:\n\nRij (m) ≡\n\nD\nE D\nED\nE\nNi (m)Nj (m) − Ni (m) Nj (m)\nσi (m)σj (m)\n\n.\n\n(51)\n\nThe JHOD correlation factor expresses the tendency of\ntwo populations to avoid or attract each other inside the\nsame halo. See Fig. 10 for a simplified illustration. This tendency, however, can only be seen in the one-halo term of the\ncross-power spectrum, Eq. (39), which is observable when\nconsidering the cross-power (cross-correlation function) of\ntwo galaxy populations for small separations.\nThe effect of the JHOD correlation factor Rij (m) on\nthe cross-moments becomes negligible, i.e.\nD\n\nE D\nED\nE\nNi (m)Nj (m) ≈ Ni (m) Nj (m) ,\n\n(52)\n\nif the relative fluctuations in\nD galaxy\nE numbers inside haloes\nbecome small, i.e. if σi (m)/ Ni (m) ≪ 1. Since haloes with\nmean galaxy occupation numbers of more than roughly\none are expected to have a Poisson variance, one can expect that the JHOD correlation factor loses significance for\nmassive\np haloes. For large m the relative variance becomes\n∝ 1/ hNi (m)i.\nIn order to avoid confusion, we would like to stress again\nthat Rij expresses the correlation of galaxy numbers inside\nsingle haloes, whereas r(θap ) is a correlation of galaxy number densities as seen in the angular clustering of galaxies.\n\n6.2\n\nAdopted model for JHOD of red and blue\ngalaxies\n\nIn the following we describe the details of the HOD of the red\nand blue galaxy sample. A galaxy sample (blue or red) can\neither have a central galaxy and satellites or solely consists\nof satellites. Satellites are distributed according to the dark\nmatter in a halo, but possibly with a different concentration\nparameters. Central galaxies sit at or close to the centre\nof a halo, for the latter of which our \"central models\" are\nan approximation. We will distinguish three different model\nflavours:\n(i) A scenario in which we have only red and blue satellites populating a dark matter halo.\n(ii) A scenario in which red galaxies are both central and\nsatellite galaxies, blue galaxies are only satellites.\n(iii) A scenario in which we have red and blue central\ngalaxies and red and blue satellites.\nCase ii) is motivated by the observation that galaxy\nclusters often have red galaxies as central galaxies. Case iii)\nis motivated by the possibility that the observed galaxygalaxy lensing signal of the blue galaxies and the power-law\nclustering may also require a central blue galaxy.\nWe start off with the description of the HOD of a single\nsample. The interconnection of the red and blue sample is\ndiscussed later on where we address the problem of red/blue\ngalaxy pairs.\nFor modelling the HOD of our red and blue galaxy sample we use, with some minor modifications, the parametrisations that were discussed in Zheng et al. (2007), Zheng &\nWeinberg (2007) and Zheng et al. (2005).\n\n6.2.1\n\nMean galaxy numbers and distribution inside haloes\n\nThe HOD (red and blue) for haloes with mass m,\nN (m) = N cen (m) + N sat (m) ,\n\n(53)\n\n\f18\n\nP. Simon et al.\n\nis split into one central galaxy, N cen (m) ∈ {0, 1}, and satellite galaxies, N sat (m). A central galaxy is placed at the centre of the halo. If there is a galaxy inhabiting a halo, there is\nalways one central galaxy. This is used in the following relations. Satellite galaxies are distributed according to a NFW\nprofile with concentration parameter c′ = f c, where c is the\nconcentration of the dark matter (Appendix A). For f > 1\ngalaxies populating the haloes are more concentrated than\nthe dark matter, while for f < 1 galaxies are less concentrated than the dark matter.\nThe halo mass dependence of the mean HOD is assumed\nto be\nD\nE\nD\nE D\nE\nN (m)\n=\nN cen (m) + N sat (m) ,\n(54)\n«–\n»\n„\nD\nE\n1\nlog m − log mmin\nN cen (m)\n=\n,\n(55)\n1 + erf\n2\nσlog m\nD\nE\nD\nE \" m − m \"ǫ\n0\nN sat (m)\n=\nN cen (m)\nH(m − m0 ) , (56)\nm′\nwhere\n\n2\nerf(x) = √\nπ\n\nZ\n\nx\n\ndt e−t\n\n2\n\n(57)\n\n0\n\nis the error function.\nWe would like to keep the number of parameters, required to explain the data, as small as possible. For that\nreason, we set m0 = mmin because we found that a free\nmmin does not significantly improve our fits. An additional\nparameter f 6= 1, on the other hand, that gives some freedom in the shape of the density profiles of blue and red\ngalaxies yields improved fits and is therefore included.\nNote that due to the previous definition of hN (m)i\nwe can still have (central) galaxies for m 6 mmin , as\n1 + erf(x) 6= 0 for x < 0. Other authors prefer to define a\nhard cut-off for N (m), as for instance in Phleps et al. (2006).\n\nwhere hN (N − 1)i is the mean number of galaxy pairs, regardless of whether they are central galaxies or satellites.\nThe variance (or number of galaxy pairs, see Eq. (58)) becomes Poisson for haloes m with α = 1, sub-Poisson for\nα < 1 and super-Poisson for α > 1. In the \"Poisson satellite\" model α is a function increasing slowly from zero near\nm = mmin to unity for large hN (m)i. See the dashed line in\nright panel of Fig. 11.\nWe found, however, that this mean number of galaxy\npairs per halo hardly reproduces the deep decrease in the\nbias parameter r(θap ) of our red and blue galaxy sample\n(see Section 4.3), presumably because it becomes Poisson at\ntoo large m.\nFor that reason, we relax the assumption of the \"Poisson\nsatellite\" model by introducing another model parameter, λ,\nthat delays the onset of a Poisson variance in N (m), λ < 1,\nor accelerates it, λ > 1. We achieve this by keeping the shape\nof α(m) as in the \"Poisson satellite\" model, Eq. (60), but\nrescaling the (log)mass scale, giving us a new α′ (m):\n\"\n\"\nα′ (m) ≡ α m × [m/mmin ]λ−1 .\n(61)\n\nThus, for λ = 1 our model uses exactly the same HOD\nvariance that is postulated in the original satellite model.\nCompare this to the parametrisation of Scoccimarro et al.\n(2001), where α(m) is postulated to increase linearly with\nln m from mmin onwards.\nThe number of satellite pairs, needed for the power\nspectra integrals, is then calculated from α′ (m) via\nhN sat (N sat − 1)i = [α′ ]2 hN i2 − 2hN sat i ,\n\ninvoking the relation between α(m), now substituted by the\nrescaled α′ (m), and the mean number of galaxy pairs. Following from this, the variance of the number of satellites is\nconsequently\nσ 2 (N sat ) = [α′ ]2 hN i2 − hN sat i(hN sat i + 1) .\n\n6.2.2\n\nIn the original model, the fluctuation in the number of\nsatellites is assumed to be Poisson (referred to as \"Poisson satellite\" model hereafter; Kravtsov et al. 2004), i.e.\nh[N sat ]2 i = hN sat i2 + hN sat i. Their assumption completely\nfixes the variance of the total number of galaxies inside a\nhalo to (we skip in the following the arguments \"(m)\" to\nsave space):\n\n=\n=\n\nhN 2 i − hN i2\n\nhN (N − 1)i + hN i(1 − hN i)\n(58)\n`\n ́\nsat\ncen\nsat\ncen 2\n3hN i + hN i 1 − 2hN i − hN i ,\n\nbecause the variance of the number of central galaxies is\nalways\nσ 2 (N cen ) = hN cen i[1 − hN cen i] ,\n\n(59)\n\nowing to the fact that N cen is only zero or one (Bernoulli\ndistribution). In particular we have h[N cen ]2 i = hN cen i.\nThe HOD variance or number of galaxy pairs of the\n\"Poisson satellite\" model can, using the notation of Scoccimarro et al. (2001), be written as\nhN (N − 1)i = α2 hN i2 ; α2 ≡\n\nhN sat i(hN sat i + 2)\n,\n(hN cen i + hN sat i)2\n\n(63)\n\nThe variance of the total number of galaxies, required for\nmodels lacking central galaxies, is simply\n\nNumber of galaxy pairs of same sample\n\nσ 2 (N ) =\n\n(62)\n\n(60)\n\nσ 2 (N ) = [α′ ]2 hN i2 + hN i(1 − hN i) .\n\n(64)\n\nThe variance parameter α(m) cannot be reduced arbitrarily, though, as a too small variance (too sub-Poisson)\nmay be in conflict with the mean number of galaxies. Put\nin other words, the number of pairs, Eqs. (60) and (62), and\nthe variances, Eqs. (63) and (64), have to be larger or equal\nthan zero, i.e.\n\nff\n2hN sat i hN sat i(1 + hN sat i)\n1\n[α′ ]2 > max\n,\n,\n1\n−\n. (65)\nhN i2\nhN i2\nhN i\n\nIf [α′ ]2 is smaller than the r.h.s., we set [α′ ]2 equal to the\nr.h.s. As α′ is usually an increasing function with halo mass\nm, this resetting is not necessary for λ > 1 but may be\nimportant if we try to delay Poisson statistics compared to\nthe \"Poisson satellite\" model.\nThe effect of λ on the bias parameter r(θap ) is demonstrated in Fig. 11 for some particular examples. It is remarkable to see that an early (low m) Poisson variance in the\ngalaxy number suppresses the cross-power towards smaller\nr(θap ) . 1, while a late Poisson variance (higher m) yields\nhigher values for r(θap ) & 1 on small scales. Therefore, the\nbias parameter r(θap ) promises to be a probe for the variance in the HOD.\n\n\fClustering and joint HOD of red and blue galaxies in COMBO-17\n\n19\n\n1.0\n1.2\n1.4\n10.0\n\n1.6\n1.8\n2.0\n\n5.0\n\n2.0\n\n1.0\n\n0.5\n\n3.0\n4.0\n5.0\n6.0\n7.0\n10.0\n\nFigure 11. Effect of the HOD variance parameter λ (for both populations equally) on the cross-correlation function of two hypothetical\npopulations of galaxies. The parameters for the galaxy populations were chosen arbitrarily from Zheng et al. (2005). As model parameters red galaxies have {1012.69 M⊙ , 0.15, 1012.94 M⊙ , 1013.82 M⊙ , 1.08}, blue galaxies have {1011.68 M⊙ , 0.15, 1011.86 M⊙ , 1013 M⊙ , 1.02}\nfor {mmin , σlog m , m0 , m′ , ǫ} (see text for details). The galaxy concentration is set f = 1 in both cases, both populations have no central galaxy component. The JHOD correlation factor is set to R = +1. Galaxies are uniformly distributed within the redshift range\nz ∈ [0.2, 0.4]. Left panel: Different lines correspond to a bias parameter r(θap ) for different λ (numbers attached to solid lines). Top line:\na variance of the HOD according to the \"Poisson satellite\" model, λ = 1. Bottom line: a variance almost Poisson for all haloes, λ = 10.\nRight panel: The corresponding HOD variance parameter, [α′ (m)]2 , of the blue galaxies for some of the lines in the left panel.\n\nFinally, with this parametrisation each galaxy sample has six, {mmin , σlog m , m′ , ǫ, f, λ}, different parameters.\nMoreover, we have one more additional parameter which\nexpresses the correlation within the JHOD of blue and red\ngalaxies.\n\nBased on this, we consider three different flavours of the\nmodel – detailed in the following sections – which permit\nred or/and blue galaxies as central galaxies and always have\nred and blue satellites. If a sample has no central galaxy,\nwe still use hN (m)i as in Eq. (54) and hN (N − 1)i as in\nEq. (60) (with rescaled α) but distribute all N (m) galaxies\nlike \"satellites\" over the halo; hN (m)i is the HOD of all\ngalaxies in that case. This tests the idea – no central galaxy\nfor a galaxy population but everything else in the model\nunchanged – if the data really requires a galaxy sample to\nhave a central galaxy.\n\nIn Fig. 12 we show a few examples for the linear\nstochastic bias between two galaxy populations based on\nthe three scenarios, detailed below. By splitting the contributions to the cross-power spectrum, stemming from\nthe one- and two-halo terms, the figure shows in which\nregime we can expect the two different terms to dominate. The transition is roughly at an aperture radius of\n20 arcmin for a mean redshift of z ∼ 0.3. This corresponds\nto an effective projected (proper) scale of 5.6 h−1 Mpc.\nFor comparison, the (comoving) virial radius of a NFW\nhalo with m ≈ 1.4 × 1014 h−1 M⊙ is rvir ≈ 0.8 h−1 Mpc, or\nrvir ≈ 0.64 h−1 Mpc (m/1014 h−1 M⊙ )0.33 . Also shown is the\nclear impact of the JHOD correlation factor. Galaxies with\ntendency of avoidance have a smaller cross-power.\n\n6.2.3\n\nNumber of cross-pairs for red and blue central\ngalaxies\n\nThe statistical cross-moments for a central galaxy scenario (central galaxies for both or just one population)\nrequires generally more information on the JHOD than\njust first- and 2nd -order moments of P (Ni , Nj |m). The\ncorrelations between satellite numbers and central galaxy\nnumbers have to be specified as well. Namely, required\nare also hNi (m)|Nj (m) = 0i, the mean number of igalaxies for haloes which do not contain any j-galaxy, and\nP (Ni (m)Nj (m) = 0), which is the probability to find either\nno i-galaxy or no j-galaxy inside a halo of mass m. We show\nthis in Appendix B.\nTo not unnecessarily increase the number of free model\nparameters in a central-satellite galaxy scenario, we can\nmake a reasonable approximation, though. For every galaxy\npopulation having central galaxies, we set N cen = 1 for halo\nmasses m where the mean number of galaxies is hN (m)i > 1,\nand N sat = 0 otherwise. This means that if the mean number of galaxies belonging to a population is less or equal\none, it is essentially only the central galaxy we can find in\nthose haloes. On the other hand, if the mean galaxy number\nis larger than one, then there is always at least a central\ngalaxy.\nApplying this approximation allows us to express the\ncross-moments of the HOD entirely in terms of known variances, means and the JHOD correlation factor Rij (m). In a\nscenario with blue and red central galaxies, we hence distinguish four cases:\n(i) Case: hNi i < 1, hNj i < 1\nHere, we have\nhNisat Njcen i\n\n=\n\nhNjsat Nicen i = hNisat Njsat i = 0 .\n\n(ii) Case: hNi i > 1, hNj i < 1\n\n(66)\n\n\f20\n\nP. Simon et al.\nno central galaxy\n\ncentral galaxy\n\nno central galaxy\n\ncentral galaxy\nonly red centrals\n\nR=+1\n\nR=+1\n\nblue and red centrals\nR=−1\n\nR=−1\n2h\n\n2h\n\n2h\n\n1h\n\n1h\n\n2h\n\n1h\n\n1h\n\nFigure 12. Example predictions for the relative linear stochastic bias of red and blue galaxies for three different scenarios (with/without\ncentral galaxy component, only red galaxies have a central component). The model parameters are chosen as in Fig. 11 except that we fix\nλ = 3.0 for both blue and red galaxies and we vary the JHOD parameter R. Left figure: The bias parameter r(θap ) is plotted (solid lines)\nfor two different JHOD-correlation factors (halo-mass invariant), R = ±1. To separate contributions to the cross-power originating from\nthe one-halo (1h; dashed line) and two-halo (2h; dotted line) term, the cross-power was recalculated for R = +1 considering only one\ncontribution at a time. The solid thick line in the right panel assumes a model where the blue and red samples have a central component,\nwhereas the thick dashed-dotted line is for a model where only the red sample has a central component (no one-halo/two-halo term\nsplitting). Right figure: Linear bias factor, b(θap ) (solid lines; red galaxies are more strongly clustered). The JHOD-correlation factor\nhas no impact here. To estimate the importance of the one- and two-halo terms, b(θap ) was also recalculated with the red galaxy power\nspectrum consisting of only either the one- or two-halo term. The thick dashed-dotted line in the right panel corresponds to the model\nwhere only the red sample has a central component(no one-halo/two-halo term splitting).\n\nWe will use:\nD\nE\nNisat Njsat\nD\nE\nNisat Njcen\n\n=\n=\n\nD\n\nD\n\nNicen Njsat\n\nNisat\n\nED\n\nE\n\nNjcen\n\n=0,\n(67)\nE\nsat\ncen\n+ Rij σ(Ni )σ(Nj ) .\n\n(iii) Case: hNi i > 1, hNj i > 1\nFinally for richly populated haloes, we will have:\nD\nE\nD\nE D\nE D\nE\nNicen Njsat\n=\nNjsat ; Nisat Njcen = Nisat , (68)\nD\nE\nD\nED\nE\nNisat Njsat\n= Nisat Njsat + Rij σ(Nisat )σ(Njsat ) .\n\nFor the sake of simplicity, this model unrealistically also\nassumes that red and blue galaxies have central galaxies\nsimultaneously, which would mean for haloes hosting red and\nblue galaxies that we would find a red and blue galaxy at, or\nvery close, to the centre. A more realistic model would add\nanother rule that decides when (and with what probability)\nwe have a red or a blue central galaxy, but never both at\nthe same time.\nHowever, our approximation is fair as long as we rarely\nfind haloes with one red and one blue galaxies. As seen later\non, our galaxy samples start to populate haloes at different\nmass-thresholds, blue galaxies from ∼ 1011 M⊙ h−1 and red\ngalaxies from ∼ 1012 M⊙ h−1 . This means a) haloes that have\none red galaxy have typically more than one blue galaxy and\nb) haloes with one blue galaxy have typically no red galaxy.\nIn the first case a), the auto-power spectrum of blue galaxies\nis dominated by the satellite terms so that placing one blue\ngalaxy at the centre does not make much of a difference. The\nsame is true for the red/blue cross-power. In the second case\nb), we have no red galaxy that could be placed at the centre\ntogether with a blue galaxy so that the problem does not\n\narise in the first place. To further improve the approximation, we also set for the cross-power kernel K 1h (k, m), Table\n3, the cross-correlation hNicen Njcen i = 0 which has to vanish\nif there is always only one central galaxy inside a halo.\n\n6.2.4\n\nNumber of cross-pairs for no central galaxies\n\nWe also explore the possibility that neither the red nor the\nblue sample of galaxies have central galaxies. We do this by\ndistributing the central galaxies of the previously described\nmodel with the same density profile as the satellite galaxies. Therefore, we have a mean galaxy number according to\nEq. (54) with a variance as in Eq. (64). The mean number of galaxy pairs is expressed by [α′ ]2 hN i2 . Moreover, for\nthis scenario the factorial cross- moments are straightforward, the approximation described in the forgoing section is\nnot necessary. The cross-correlation moment of the JHOD\nis thus:\nD\nE D ED E\nNi Nj = Ni Nj + Rij σ(Ni )σ(Nj ) .\n(69)\n6.2.5\n\nNumber of cross-pairs for mixed model with only red\ncentral galaxies\n\nAs last scenario we consider the possibility that only the red\nsample has central galaxies, while blue galaxies are always\nsatellites. Within this model, blue galaxies are described according to the \"no central galaxy\" scenario and red galaxies\naccording to the previous \"central galaxy\" scenario.\nAgain, for cross-moments in principle we also needed\nto specify hNj (m)|Ni (m) = 0i, j denotes blue galaxies and\ni the red galaxies (Appendix B). One finds by using the\n\n\fClustering and joint HOD of red and blue galaxies in COMBO-17\naforementioned approximation:\nE\nD\nED E\nD\n=\nNicen Nj + Rij σ(Nicen )σ(Nj ) ,\nNicen Nj\nD\nE\nNisat Nj\n= 0\nfor hNi i < 1, and\nD\nE\nD E\nNicen Nj\n=\nNj ,\nD\nE\nD\nED E\nNisat Nj\n=\nNisat Nj + Rij σ(Nisat )σ(Nj )\n\n(70)\n\nTable 4. Quality of the halo model fits and a Bayesian comparison of the three different models describing the same data.\nThe χ2 /dof per degree of freedom (dof = 26 − 13 = 13) is for\nthe maximum-likelihood fit to the data. By ∆ ln E we mean the\ndifference of the Bayesian (log)evidence for a particular scenario\nrelative to the scenario with the highest evidence at the same\nredshift.\n\n(71)\n\notherwise.\n\n6.3\n\nFitting the halo model to the data\n\n6.3.1\n\nMethod\n\nWe now use all the results on the clustering of the red and\nblue galaxy sample and their correlation to the dark matter\ndensity, gathered on the foregoing pages, to constrain the\nparameters of our halo model, see Sect. 6.2. The number\ndensities of blue and red galaxies for each redshift bin is\nadded as additional information (Table 1, bottom) to be\nfitted by the model as well (Eq. 42).\nHow can we relate the halo model 3D-power spectra to\nthe observables, which are projections onto the sky? The\nmean tangential shear about the lenses is, for the i-th redshift bin, related to the angular cross-power spectrum between the lens number density and lensing convergence,\nPigκ (l), by (e.g. Simon et al. 2007)\nD\nE Z ∞ dll\nPigκ (l)J2 (lθ) .\n(72)\nγt,i (θ) =\n2π\n0\n\nA similar relation connects the N -statistics to the angular\npower spectrum of galaxy clustering, Pij (l), see Eq. (2).\nTo translate the 3D-model power spectra, Eq. (38), to\nthe projected angular power spectra for a given redshift distribution of lens galaxies, pl (w), and source galaxies, ps (w),\nwe use Limber's equation in Fourier space (Bartelmann &\nSchneider 2001):\n„\n«\n«2\n„\nZ ∞\npl (w)\nl\nPij (l) =\ndw\n,w\n(73)\nPij\nfk (w)\nfk (w)\n0\nand\nPigκ (l)\n\n=\n\nW (w)\n\n≡\n\n„\n«\nZ ∞\nl\npl (w)W (w)\n3H02\ndw\nΩ\nP\n,\nw\n,\nm\ni,j=0\n2c2\na(w)fk (w)\nfk (w)\n0\nZ ∞\nfk (w′ − w)\ndw′ ps (w′ )\n.\n(74)\nfk (w′ )\nw\n\nWe denote the Hubble constant, the vacuum speed of light,\nthe cosmological scale factor by H0 , c and a(w), respectively. The second argument w in the 3D-power spectrum,\nPij (k, w), is used to express a possible time-evolution of the\npower as function of comoving radial distance.\nWe expect the evolution of the 3D-power spectra within\nthe lens galaxy redshift bins to be moderate so that we neglect the time-evolution over the range of a redshift bin.\nThe 3D-power spectra are computed for a radial distance\nw = (w1 + w2 )/2, where w1 and w2 are the distance limits of the redshift bin. This particular w is justified by the\nredshift probability distributions inside the z-bins, Fig. 2,\nwhich are relatively symmetric about the mean.\n\n21\n\nz̄\n\nχ2 /dof\n\n∆ ln E\n\n0.3\n0.3\n0.3\n\n0.51\n0.56\n0.45\n\n0.00\n0.44\n0.57\n\nno central galaxies\nred central galaxies\nblue and red centrals\n\n0.5\n0.5\n0.5\n\n1.25\n1.20\n1.24\n\n0.00\n0.86\n0.88\n\nno central galaxies\nred central galaxies\nblue and red centrals\n\n0.7\n0.7\n0.7\n\n0.57\n0.50\n0.60\n\n0.00\n1.02\n1.19\n\nno central galaxies\nred central galaxies\nblue and red centrals\n\n0.9\n0.9\n0.9\n\n0.59\n0.55\n0.62\n\n0.00\n0.07\n0.31\n\nred central galaxies\nblue and red centrals\nno central galaxies\n\nmodel type\n\nAgain, we employ the MCMC-method to trace out the\nposterior likelihood function of our halo-model parameters.\nThe N -statistics and the GGL signal are put together to\nconstrain the model. In general, the JHOD correlation factor R(m) (we have just one: between the red and blue sample) is a function of the halo mass. As the effect of R(m)\nbecomes negligible for small relative fluctuations in the halo\noccupation number of galaxies (large m), we assume the\nsame correlation parameter for all m, which is, consequently,\nmainly constrained by haloes with a small number of galaxies (m ∼ mmin ). For the scope of this paper, where we have\nrelatively small galaxy samples and relatively large uncertainties in the clustering statistics (compared to SDSS, for\nexample) this is an acceptable approximation. For future\nstudies investigating a mass-dependence of the JHOD correlation parameter may be interesting and feasible.\nWe confine the parameter space of the model (flat priors) to 106 M⊙ 6 (mmin , m′ ) 6 1016 M⊙ , 10−3 6 σlogm 6 1,\n0 6 ǫ 6 2, |R| 6 1, 10−1 6 f 6 3 and 0.9 6 λ 6 10. Three\nmodel scenarios are fitted separately: i) both the blue and\nred populations have central galaxies, ii) no central galaxies,\nand iii) only the red sample has central galaxies.\nIn order to possibly discriminate between the three scenarios we estimate the Bayesian evidence for each scenario in\nevery redshift bin (Appendix C). This method is a more sophisticated approach for model discrimination than a \"simple\" χ2 comparison of a best-fit because, rather than looking\nmerely at the height of the (posterior) likelihood function,\nthe width of the likelihood function is taken into account as\nwell.\n6.3.2\n\nResults\n\nFig. 13 shows the model fits to the data belonging to the\nredshift bin z̄ = 0.7. This redshift bin was chosen since it\nhas the best signal-to-noise in our data.\nNote that the points (model prediction) in this figure\nare the model averages along the MCMC tracks and not the\nbest-fitting models (minimum χ2 ). The 1σ-standard devia-\n\n\f22\n\nP. Simon et al.\n\nno central\n\nred central\n\ncentrals\n\nFigure 13. Average fit, compared to the observation, of the N -statistics (first row ; points: variance of red galaxies, filled stars: variance\nof blue galaxies, open stars: cross-correlation) and GGL (second row ; filled stars: blue galaxies, points: red galaxies) as predicted by\nthe three different halo-model scenarios (first column: no central galaxies, second column: red central galaxies, third column: blue and\nred central galaxies) for the redshift bin z̄ = 0.7. The model fits (average over the MCMC tracks) and their 1σ-variance are denoted\nby points and errorbars, the shaded areas bracket the 1σ-range in COMBO-17. For the GGL panels shaded areas are the combined\nconstraints from all redshift bins. The corresponding model predictions for the number density of red galaxies are (in units of h3 Mpc−3 )\n11 ± 8 × 10−3 (no central), 8 ± 4 × 10−3 (red central), 9 ± 6 × 10−3 (red and blue centrals) and for blue galaxies 51 ± 15 × 10−3 (no\ncentral), 57 ± 18 × 10−3 (red central), 65 ± 21 × 10−3 (red and blue centrals).\n\ntion of the fits is denoted by error bars. The MCMC-average\nis useful to study how well a model fits the data in general\nand where the main problems of the model in describing the\ndata are located.\nWe gather from this figure that, in general, qualitatively all three model scenarios appear to provide a pretty\ngood description of the data. The main differences appear\n′\nfor θap . 1′ (N -statistics) and θ . 0.5\n(GGL); the differences in the N -statistics are small, though. The scenario\nwith no central galaxies at all is bound to systematically\nsmaller values for the N -statistics and, thus, has small difficulties in explaining the clustering statistics of red galaxies\nfor smaller scales. Since statistical uncertainties grow large\nfor small scales, those difficulties are not too significant for\nour data.\nThree other issues can be identified:\n• Although the galaxy clustering and the GGL is well\ndescribed by the models, there is only moderate agreement\nbetween the predicted and observed mean number densities of blue galaxies: the predicted numbers are higher. The\nmeasured value (Table 1) is, however, still within the 2σscatter of n̄blue of the Markov chains. For example, for\n\nz̄ = 0.7 the model predicts consistently for all scenarios\nn̄blue ∼ (57 ± 18) × 10−3 h3 Mpc−3 , whereas the data estimate is n̄blue = (18 ± 3) × 10−3 h3 Mpc−3 . This could point\ntowards an inaccuracy of the halo model or/and to a systematic underestimate of n̄blue provided by the Vmax -estimator.\nThe observed numbers of red galaxies are always within\nthe 1σ-scatter of the Markov chains although the means\nof the chains are always larger than the observed values,\nwhich again could be indicative of an overprediction by our\nhalo-model. Tensions between the halo model predictions for\ngalaxy clustering and number densities were also noticed by\nother studies, such as Quadri et al. (2008).\n• The GGL-signal of the blue galaxies always conflicts\nthe data beyond θ & 0′.5 (too high) because the observed\n∆Σ quickly drops to essentially negative in that regime (if\nthe GGL of all redshift bins is combined). Considering that\nmost of the other model predictions fit quite well and that,\nto the knowledge of the authors, no negative GGL-signal for\nthese galaxy separations has been found in the literature,\nthis conflict could very well be a hint towards systematics\nin the lensing data undiscovered so far.\n• The model without red central galaxies is in mild con-\n\n\fClustering and joint HOD of red and blue galaxies in COMBO-17\nflict with the GGL measurement for the smallest separations: a galaxy centred on the halo centre boosts the GGL\nsignal, which is arguably favoured by the data (when the\nGGL-signal of all redshift bins is combined).\nTable 4 lists the (reduced) χ2 of the maximum likelihood fits and the estimated Bayesian evidence of the three\ndifferent model scenarios. All scenarios at all redshifts give\ngood fits to the data. The worst fits, χ2 /dof ∼ 1.25, are for\nthe redshift bin z̄ = 0.5 which may be related to the sudden\ndrop of the N -statistics for the largest aperture radius (upper right panel in Fig. 6). Since this χ2 still has a probability\nof ∼ 20%, we can consider it as a statistical fluke.\nExcept for z̄ = 0.7, where we find weak evidence for a\nmodel without central galaxies, the Bayesian model discrimination does not prefer any particular model. Combining the\nevidence of all redshift bins (the Bayesian evidence just sums\nup), assuming independent statistical information, however\nyields substantial evidence (∆ ln E ≈ 2) for a model without central galaxies. On the other hand, by looking at Fig.\n13 we concluded that a model without central galaxies has\nsome problems describing the data on the smallest scales.\nMoreover, our central galaxy models have always, except\nfor z̄ = 0.3, a better χ2 . All of which taken together makes\nus suspicious, if the Laplacian approximation that is used\nto compute the Bayesian evidence is really accurate enough\nfor our work. Our model comparison therefore seems to be\ninconclusive and an improved statistical analysis or a larger\ndata set will have to revisit this question in the future.\nTable 5 (after the bibliography) lists the constraints on\nthe halo-model parameters for all redshifts and all scenarios.\nFor an parameter average over all redshifts (bottom block\nof table), we combine the 1D-probability density functions\n(PDFs), Pi (pj ), as estimated from the MCMCs, of all parameters, pj , for all redshifts i to obtain a total 1D-posterior\nof pj :\nY\nPi (pj ) .\n(75)\nP (pj ) =\ni\n\nFrom this total posterior we derive the mean and r.m.s.variance of every parameter. Note that for top-hat and equal\nPi 's one has P = Pi , meaning combining information does\nnot improve anything in this case.\nFirst of all, we find that the fits seem to be robust with\nrespect to the three different model scenarios, with R, f and\nmaybe m′ being the only possible exceptions.\nFor all aforementioned parameters, we do not see a clear\ntrend with redshift, maybe with mmin being an exception\nwhich (the median) is increasing slightly in z̄ = 0.9 but\nstill is consistent with the rest. The redshift-combined result of this parameter is mmin = 1012.1±0.2 h−1 M⊙ for red\nand mmin = 1011.2±0.1 h−1 M⊙ for blue galaxies. Therefore,\nblue-cloud galaxies clearly populate smaller haloes than redsequence galaxies. In fact, this is the halo-model explanation\nfor the different clustering strengths of red and blue galaxies.\nThe combined result for the parameter pair m′ and ǫ,\ndescribing the galaxy occupancy as function of halo mass\nbeyond mmin , is roughly for both red and blue galaxies\nm′ = 1013.0±0.4 h−1 M⊙ and ǫ = 1.1 ± 0.2, 1.3 ± 0.2 for red\nand blue galaxies, respectively.\nThe least constrained parameter in our analysis is\nclearly σlog m which has for all redshifts 0.5 ± 0.2. This is\n\n23\n\nessentially what one would expect from a top-hat PDF, nonvanishing between 0 . . . 1. Therefore, our data does not add\ninformation that significantly improves our prior. Combining\nall redshifts shrinks the 1σ-confidences somewhat, though,\nbecause the individual 1D-PDFs are not completely flat.\nApparently only little more information is added to λ,\nthe HOD variance parameter, by the data. With a top-hat\nprior between 0.9 . . . 10 we would expect as constraint λ =\n5.5 ± 2.5, which is roughly what we find for the individual\nredshift bins, excluding λ of blue galaxies for the model with\nred central galaxies only. However, the 1D-PDFs are not\ncompletely flat preferring some regions in parameter space,\ntoo. In particular, they exclude values near λ ∼ 1 which\nis the HOD variance in the \"Poisson satellite\" model. As\ndiscussed earlier, this is because λ = 1 cannot explain the\nobserved deep drop in r(θap ) for small scales. Quantitatively,\nwe infer from the redshift-combined PDF of λ that we can\ndecisively exclude values less than λ = 2 for red galaxies\nand λ = 3 for blue galaxies with 95% confidence. This fits\nto the findings of Collister & Lahav (2005) that found no\nindications of a sub-Poissonian variance, α(m) < 1, in their\nanalysis of red and blue galaxies.\nFor the combined concentration parameter of red and\nblue galaxies we find values that depend slightly on the\nadopted scenario. In a model with no central galaxies, red\ngalaxies require a concentration larger than that of dark\nmatter, fred = 1.9 ± 0.5, which, however drops to fred ≈\n1.3 ± 0.5 if a central red galaxy is allowed. Our conclusion\nis that the data demands a centrally concentrated spatial\ndistribution of red galaxies either by a larger fred or by a\ncentral galaxy. Conversely, for blue galaxies we find for no\ncentral galaxies, fblue = 1.0 ± 0.4, consistent with the dark\nmatter distribution, but distributions flatter than dark matter, fblue = 0.6 ± 0.3, if central galaxies are present.\nThe JHOD correlation factor, R, turns out to be hard\nto measure. For the individual redshift bins we find little\nimprovement compared to the flat prior. For all z-bins combined, we find R = +0.1 ± 0.2 (no central galaxies/only red\ncentral galaxies) and R = +0.5 ± 0.2 (blue and red central galaxies). This implies that the number of red and blue\ngalaxies are uncorrelated in the first case and slightly positively correlated in the latter case.\nInside Fig. 7 we plotted the bestfit solutions to the\nrelative linear stochastic bias of the red and blue population found along the MCMC tracks for a mean redshift of\nz̄ = 0.7. The halo model reproduces the scale-dependence of\nbias factor and correlation factor at that redshift well (note\nthat the shaded confidence regions are combinations of all\nredshift bins). All three scenarios reveal very similar trends\nwith most differences for very small scales which, however\ndue to measurement noise (galaxy shot noise), are not well\nconstrained. If we use the halo model and bestfit parameters\nto extrapolate the bias parameters to large scales we find a\nbias factor between b ∼ 1.46 − 1.58 depending on the particular scenario. Those values reconcile our measurements at\nrelatively small scales with results from various other studies that measured galaxy biasing on larger scales (see Sect.\n4.3). Furthermore, it underlines the need for both small and\nlarge scale measurements of galaxy clustering in order to\ndiscriminate different halo-model scenarios. In that context,\nwe also would like to point to Fig. 13, lower row. Here we\ncan easily see that the three halo-model scenarios predict\n\n\f24\n\nP. Simon et al.\n\nclearly different GGL for galaxy separations smaller than\n∼ 12′′, corresponding to a physical scale of ∼ 60 h−1 kpc.\nThis shows that GGL has an important model discriminating power on those scales. However, the halo model outlined\nhere may be inaccurate on exactly those scales as it does not\ninclude the effect of lenses hosting individual haloes inside\ntheir parent halo (Sheth & Jain 2003). Unfortunately, the\nstatistical uncertainties in our GGL measurements do not\nallow to fully exploit this potential.\n\n7\n\nSUMMARY\n\nFor this paper we studied the clustering and, in particular,\nthe relative clustering of red sequence galaxies and bluecloud galaxies in COMBO-17 (fields: S11, A901, CDFS)\ninside four redshift bins up to a redshift of z ∼ 1. The two\nsamples were separated by applying a redshift-dependent\ncut along the red-sequence. An additional cut was applied\nto assure that red and blue galaxies at all redshifts have\nroughly the same colour-dependent MV -limits. The red\nsample has hMV i = −20.0 ± 0.1 mag, the blue sample has\nhMV i = −18.8 ± 0.1 mag (h = 1.0).\nBy looking at the spatial correlation function of the\nsamples, we found for all redshifts combined a correlation length of r0 = 5.5 ± 0.9, 3.0 ± 0.4 h−1 Mpc for the\nred and blue galaxies, respectively. The corresponding\npower-law indices of the spatial correlation function were\nδ = 0.85 ± 0.10, 0.65 ± 0.08. A significant evolution of these\nparameters with redshift was not found.\nParameterising the relative biasing of the red and blue\nsample in terms of the linear stochastic bias, we measured\nfor all redshifts combined that the bias factor, b(θap ), is\nslightly scale-dependent within a range of aperture radii of\nθap = 6′′ − 20′ , varying between b ∼ 1.7 − 2.2. We found\nthat the second parameter, r(θap ) – quantifying the correlation of galaxy number density fluctuations as function of\nscale –, is scale-dependent, too. It drops from a value close\nto unity at larger scales of θap ∼ 20′ to r ∼ 0.6 ± 0.15 at\nθap ∼ 6′′. An aperture radius of θap = 10′ corresponds to a\nproper spatial scale of 2.8, 3.8, 4.5, 4.8 h−1 Mpc at the redshifts z = 0.3, 0.5, 0.7, 0.9, respectively. The measurements\nemphasise the different clustering of the red and blue sample at all redshifts, but do not exhibit a clear evolution with\nredshift beyond the statistical uncertainties.\nWe also looked at the mean tangential ellipticity of\na population of faint background galaxies as function of\nseparation from red and blue galaxies (GGL). For this\nanalysis, shear catalogues with a mean source redshift of\nz̄ = 0.78 from the GaBoDS were taken. The GGL-signal\ndetected corresponds to a projected differential surface\nmass density of ∆Σ = 35 ± 25 hM⊙ pc−2 , red galaxies, and\n∆Σ = 16 ± 10 hM⊙ pc−2 , blue galaxies, at a galaxy-galaxy\nseparation of ∼ 12′′ (roughly ∼ 60 h−1 kpc). This indicates\nthat the red galaxies are either typically more massive than\nblue galaxies, or are residing inside a matter richer environment than the blue galaxies.\nA large part of the paper discussed a dark-matter halo\nbased model that was employed to describe the angular clustering, including the cross-correlation function of clustering,\nthe GGL-signal and the (ratio of) number densities of the\nred and blue galaxy sample simultaneously. Due to large sta-\n\ntistical errors for the GGL, the GGL-signal mainly served\nas an upper limit for a model predicted signal.\nWe used three different variants of our halo-model, all\nhaving the same number of free parameters, to fit the data:\ni) neither the red nor the blue population have central galaxies, ii) only the red sample has central galaxies, and iii)\nboth the red and blue sample can have central galaxies and\nthere is always one central galaxy. A Bayesian method of\nmodel discrimination was performed to decide which model\nat which redshift may be most suitable in explaining the\ndata. The model discrimination was inconclusive, a more\naccurate treatment or a larger data set is required. In this\ncontext, we pointed out that GGL at small separations is\nmost sensitive to the presence or absence of a central galaxy.\nDescribing the cross-correlation function required the\nextension of the halo-model descriptions currently available\nin the literature by at least one additional parameter (see\nScranton (2003, 2002) which is equivalent to our approach\nonly if R(m) = 0). The extension is necessary for a full\nparametrisation of the 2nd -order joint HOD of two galaxy\npopulations. We called this parameter the correlation factor\nof the joint HOD of two galaxy populations, R(m). It expresses the tendency of different galaxy types to avoid (R(m)\nclose to minus unity) or attract each other (R(m) close to\nplus unity) inside/into a same dark matter halo of mass m.\nA vanishing R(m) indicates uncorrelated halo-occupation\nnumbers. The 2nd -order cross-correlation function of two\ngalaxy samples, or equivalently r(θap ), is most sensitive to\nR(m) for small separations where the one-halo term is dominating (θap . 20′ for z̄ = 0.3). In principle, R(m) is halomass dependent but its impact on the cross-correlation function becomes negligible for haloes with large galaxy occupation numbers (large m). Therefore, observations mainly\nconstrain R(m) for smaller haloes. The measurements of\nR for the individual z-bins yielded only little constraints.\nCombining all redshifts we found R = +0.5 ± 0.2 (positive\ncorrelation of galaxy numbers) for iii) and R = +0.1 ± 0.2\nfor i) and ii) (no correlation).\nWe found it necessary to add another new degree of\nfreedom, λ, to the model in order to explain the observed,\ntowards smaller scales declining sub-unity bias parameter\nr(θap ). The parameter λ regulates how quickly a HOD of\ngalaxy numbers populating a dark-matter halo assumes a\nPoisson variance, see Sect. 6.2.2 for an explanation. We\ndemonstrated that the cross-correlation function of galaxy\nclustering is quite sensitive to λ: r(θap ) seems to reach values substantially smaller than unity only for λ > 1. With all\nmodels i)-iii) we decisively excluded, for red and blue galaxies, a value of λ . 2 (red) and λ . 3 (blue) with 95% confidence. This rules out with high confidence, at least for our\nred and blue galaxy samples, a model like that of Kravtsov\net al. (2004) (\"Poisson satellites\") for the mean number of\ngalaxy pairs inside a halo.\nThe halo model parameters of the red and blue sample\nmostly differ for mmin . We concluded that the average of the\nmass-scale for z = 0 . . . 1 is mmin = 1012.1±0.2 h−1 M⊙ for red\nand mmin = 1011.2±0.1 h−1 M⊙ for blue galaxies.\nFinally, we presented evidence that red galaxies are\nmore concentrated towards the halo centre than the dark\nmatter, which either has to be achieved by a central red\ngalaxy or a larger concentration parameter fred = 1.9 ± 0.5.\nThe distribution of blue galaxies is consistent with the dark\n\n\fClustering and joint HOD of red and blue galaxies in COMBO-17\nmatter distribution inside a halo for i), but flatter with\nfblue = 0.6 ± 0.3 for ii) or iii).\nAs an outlook, we would like to mention that the joint\nHOD of two galaxy populations is also probed by a new\nstatistics, third-order galaxy-galaxy lensing (red and blue\ngalaxies as lenses), that are outlined in Schneider & Watts\n(2005) and have been recently detected for the first time\nin Simon et al. (2008). Combining those statistics with the\nsecond-order cross-correlation function in forthcoming surveys promises to set better constraints on the JHOD correlation factor.\n\nACKNOWLEDGEMENTS\nWe would like to thank Michael J.I. Brown, Peder Norberg and Alan Heavens for very helpful discussions. We are\nalso grateful to the anonymous referee of this paper for\nhis many useful suggestions. This work was supported by\nthe European DUEL Research-Training Network (MRTNCT-2006-036133). Patrick Simon further acknowledges support by PPARC, Hendrik Hildebrandt also received funding from the Deutsche-Forschungsgemeinschaft (DFG) under the project ERB327/2-1. This work was further supported by the DFG under the project SCHN 342/6–1 and\nby the Priority Programme SPP 1177 'Galaxy evolution'\nof the Deutsche Forschungsgemeinschaft under the project\nSCHN 342/7–1.\n\nREFERENCES\nBacon D., Massey R. J., Refregier A., Ellis R., 2003, MNRAS, 344, 673\nBartelmann M., Schneider P., 2001, Phys. Rep., 340, 291\nBell E. F., Wolf C., Meisenheimer K., Rix H.-W., Borch A.,\nDye S., Kleinheinrich M., Wisotzki L., McIntosh D. H.,\n2004, ApJ, 608, 752\nBenson A. J., Cole S., Frenk C. S., Baugh C. M., Lacey\nC. G., 2000, MNRAS, 311, 793\nBerlind A. A., Weinberg D. H., 2002, ApJ, 575, 587\nBlanton M., 2000, ApJ, 544, 63\nBrown M. J. I., Zheng Z., White M., Dey A., Jannuzi B. T.,\nBenson A. J., Brand K., Brodwin M., Croton D. J., 2008,\nArXiv/0804.2293, 804\nBrown M. L., Taylor A. N., Bacon D. J., Gray M. E., et al.,\n2003, MNRAS, 341, 100\nBullock J. S., Kolatt T. S., Sigad Y., Somerville R. S.,\nKravtsov A. V., Klypin A. A., Primack J. R., Dekel A.,\n2001, MNRAS, 321, 559\nCoil A. L., Newman J. A., Croton D., Cooper M. C., Davis\nM., Faber S. M., Gerke B. F., Koo D. C., Padmanabhan\nN., Wechsler R. H., Weiner B. J., 2008, ApJ, 672, 153\nCole S., Lacey C. G., Baugh C. M., Frenk C. S., 2000,\nMNRAS, 319, 168\nCollister A. A., Lahav O., 2005, MNRAS, 361, 415\nConway E., Maddox S., Wild V., Peacock J. A., Hawkins\nE., Norberg P., Madgwick D. S., Baldry I. K., Baugh\nC. M., Bland-Hawthorn J., Bridges T., Cannon R., Cole\nS., Colless M., Collins C., Couch W., Dalton G., De Propris R., Driver S. P., Efstathiou G., Ellis R. S., Frenk C. S.,\nGlazebrook K., Jackson C., Jones B., Lahav O., Lewis I.,\n\n25\n\nLumsden S., Percival W., Peterson B. A., Sutherland W.,\nTaylor K., 2005, MNRAS, 356, 456\nCooray A., Sheth R., 2002, Phys. Rep., 372, 1\nCroft R. A. C., Di Matteo T., Springel V., Hernquist L.,\n2008, arXiv:astro-ph/0803.4003\nDekel A., Lahav O., 1999, ApJ, 520, 24\nDressler A., 1980, ApJ, 236, 351\nEisenstein D. J., Hu W., 1998, ApJ, 496, 605\nErben T., Schirmer M., Dietrich J. P., Cordes O.,\nHaberzettl L., Hetterscheidt M., et al., 2005, AN, 326,\n432\nErben T., van Waerbeke L., Bertin E., Mellier Y., Schneider\nP., 2001, A&A, 366, 717\nFaber S. M., Willmer C. N. A., Wolf C., Koo D. C., Weiner\nB. J., Newman J. A., Im M., Coil A. L., Conroy C., Cooper\nM. C., Davis M., Finkbeiner D. P., Gerke B. F., Gebhardt\nK., Groth E. J., Guhathakurta P., Harker J., Kaiser N.,\nKassin S., Kleinheinrich M., Konidaris N. P., Kron R. G.,\nLin L., Luppino G., Madgwick D. S., Meisenheimer K.,\nNoeske K. G., Phillips A. C., Sarajedini V. L., Schiavon\nR. P., Simard L., Szalay A. S., Vogt N. P., Yan R., 2007,\nApJ, 665, 265\nFried J. W., von Kuhlmann B., Meisenheimer K., Rix H.W., Wolf C., Hippelein H. H., Kümmel M., Phleps S.,\nRöser H. J., Thierring I., Maier C., 2001, A&A, 367, 788\nFry J. N., Gaztanaga E., 1993, ApJ, 413, 447\nGao L., White S. D. M., 2007, MNRAS, 377, L5\nGray M. E., Taylor A. N., Meisenheimer K., Dye S., Wolf\nC., Thommes E., 2002, ApJ, 568, 141\nGuzik J., Seljak U., 2001, MNRAS, 321, 439\nGuzzo L., Strauss M. A., Fisher K. B., Giovanelli R.,\nHaynes M. P., 1997, ApJ, 489, 37\nHartlap J., Simon P., Schneider P., 2007, A&A, 464, 399\nHawkins E., Maddox S., Cole S., Lahav O., Madgwick D. S.,\nNorberg P., Peacock J. A., Baldry I. K., Baugh C. M.,\nBland-Hawthorn J., Bridges T., Cannon R., Colless M.,\nCollins C., Couch W., Dalton G., De Propris R., Driver\nS. P., Efstathiou G., Ellis R. S., Frenk C. S., Glazebrook\nK., Jackson C., Jones B., Lewis I., Lumsden S., Percival W., Peterson B. A., Sutherland W., Taylor K., 2003,\nMNRAS, 346, 78\nHeavens A., Refregier A., Heymans C., 2000, MNRAS, 319,\n649\nHeavens A. F., Kitching T. D., Verde L., 2007, MNRAS,\n380, 1029\nHetterscheidt M., Erben T., Schneider P., Maoli R.,\nVan Waerbeke L., Mellier Y., 2005, A&A, 442, 43\nHetterscheidt M., Simon P., Schirmer M., Hildebrandt H.,\nSchrabback T., Erben T., Schneider P., 2007, A&A, 468,\n859\nHeymans C., Heavens A., 2003, MNRAS, 339, 711\nHeymans C., Van Waerbeke L., Bacon D., et al., 2006, MNRAS, 368, 1323\nHeymans C., White M., Heavens A., Vale C., van Waerbeke\nL., 2006, MNRAS, 371, 750\nHildebrandt H., Erben T., Dietrich J. P., Cordes O.,\nHaberzettl L., Hetterscheidt M., Schirmer M., Schmithuesen O., Schneider P., Simon P., Trachternach C., 2006,\nA&A, 452, 1121\nHirata C. M., Seljak U., 2004, Phys. Rev. D, 70, 063526\nHoekstra H., Franx M., Kuijken K., Squires G., 1998, ApJ,\n504, 636\n\n\f26\n\nP. Simon et al.\n\nHoekstra H., Van Waerbeke L., Gladders M. D., 2002, ApJ,\n577, 604\nJeffreys H., 1961, Theory of Probability. Oxford University\nPress, Oxford, UK\nKaiser N., Squires G., Broadhurst T., 1995, ApJ, 449, 460\nKilbinger M., Schneider P., Eifler T., 2006, A&A, 457, 15\nKleinheinrich M., Schneider P., Rix H.-W., Erben T., Wolf\nC., Schirmer M., Meisenheimer K., Borch A., Dye S., Kovacs Z., Wisotzki L., 2006, A&A, 455, 441\nKravtsov A. V., Berlind A. A., Wechsler R. H., Klypin\nA. A., Gottlöber S., Allgood B., Primack J. R., 2004, ApJ,\n609, 35\nLandy S. D., Szalay A. S., 1993, ApJ, 412, 64\nLe Fevre O., Hudon D., Lilly S. J., Crampton D., Hammer\nF., Tresse L., 1996, ApJ, 461, 534\nLimber D. N., 1953, ApJ, 117, 134\nLin L., Patton D. R., Koo D. C., Casteels K., Conselice\nC. J., Faber S. M., Lotz J., Willmer C. N. A., Hsieh B. C.,\nChiueh T., Newman J. A., Novak G. S., Weiner B. J.,\nCooper M. C., 2008, arXiv:astro-ph/0802.3004\nMacKay J. D., 2003, Information Theory, Inference, and\nLearning Algorithms. Cambridge University Press, Cambridge, UK\nMadgwick D. S., Hawkins E., Lahav O., Maddox S., Norberg P., Peacock J. A., Baldry I. K., Baugh C. M., BlandHawthorn J., Bridges T., Cannon R., Cole S., Colless M.,\nCollins C., Couch W., Dalton G., De Propris R., Driver\nS. P., Efstathiou G., Ellis R. S., Frenk C. S., Glazebrook\nK., Jackson C., Lewis I., Lumsden S., Peterson B. A.,\nSutherland W., Taylor K., 2003, MNRAS, 344, 847\nMaller A. H., Berlind A. A., Blanton M. R., Hogg D. W.,\n2008, arXiv:0801.3286\nMandelbaum R., Tasitsiomi A., Seljak U., Kravtsov A. V.,\nWechsler R. H., 2005, MNRAS, 362, 1451\nMassey R., Heymans C., Bergé J., Bernstein G., Bridle S.,\nClowe D., Dahle H., Ellis R., Erben T., Hetterscheidt M.,\nHigh F. W., Hirata C., Hoekstra H., Hudelot P., Jarvis\nM., Johnston D., Kuijken K., Margoniner V., Mandelbaum R., Mellier Y., Nakajima R., Paulin-Henriksson S.,\nPeeples M., Roat C., Refregier A., Rhodes J., Schrabback\nT., Schirmer M., Seljak U., Semboloni E., van Waerbeke\nL., 2007, MNRAS, 376, 13\nMcCracken H. J., Ilbert O., Mellier Y., Bertin E., Guzzo\nL., Arnouts S., Le Fèvre O., Zamorani G., 2008, A&A,\n479, 321\nMcKay T. A., Sheldon E. S., Racusin J., Fischer P., Seljak U., Stebbins A., Johnston D., Frieman J. A., Bahcall N., Brinkmann J., Csabai I., Fukugita M., Hennessy\nG. S., Ivezic Z., Lamb D. Q., Loveday J., Lupton R. H.,\nMunn J. A., Nichol R. C., Pier J. R., York D. G., 2001,\narXiv:astro-ph/0108013\nNakamura T. T., Suto Y., 1997, Progress of Theoretical\nPhysics, 97, 49\nNavarro J. F., Frenk C. S., White S. D. M., 1996, ApJ, 462,\n563\nNorberg P., Baugh C. M., Gaztanaga E., Croton D. J.,\n2008, arXiv:0810.1885\nNorberg P., Baugh C. M., Hawkins E., Maddox S., Madgwick D., Lahav O., Cole S., Frenk C. S., Baldry I., BlandHawthorn J., Bridges T., Cannon R., Colless M., Collins\nC., Couch W., Dalton G., De Propris R., Driver S. P., Efstathiou G., Ellis R. S., Glazebrook K., Jackson C., Lewis\n\nI., Lumsden S., Peacock J. A., Peterson B. A., Sutherland\nW., Taylor K., 2002, MNRAS, 332, 827\nPadmanabhan N., White M., Eisenstein D. J., 2007, MNRAS, 376, 1702\nPeacock J. A., Smith R. E., 2000, MNRAS, 318, 1144\nPeebles P. J. E., 1980, The large-scale structure of the universe. Princeton University Press, USA\nPhleps S., Meisenheimer K., 2003, A&A, 407, 855\nPhleps S., Peacock J. A., Meisenheimer K., Wolf C., 2006,\nA&A, 457, 145\nQuadri R. F., Williams R. J., Lee K.-S., Franx M., van\nDokkum P., Brammer G. B., 2008, ApJ, 685, L1\nScherrer R. J., Bertschinger E., 1991, ApJ, 381, 349\nSchneider P., 1998, ApJ, 498, 43\nSchneider P., van Waerbeke L., Jain B., Kruse G., 1998,\nMNRAS, 296, 873\nSchneider P., van Waerbeke L., Kilbinger M., Mellier Y.,\n2002, A&A, 396, 1\nSchneider P., Van Waerbeke L., Mellier Y., 2002, A&A,\n389, 729\nSchneider P., Watts P., 2005, A&A, 432, 783\nScoccimarro R., Sheth R. K., Hui L., Jain B., 2001, ApJ,\n546, 20\nScranton R., 2002, MNRAS, 332, 697\n-, 2003, MNRAS, 339, 410\nSeljak U., 2000, MNRAS, 318, 203\nSheldon E. S., Johnston D. E., Frieman J. A., Scranton\nR., McKay T. A., Connolly A. J., Budavári T., Zehavi I.,\nBahcall N. A., Brinkmann J., Fukugita M., 2004, AJ, 127,\n2544\nSheth R. K., Jain B., 2003, MNRAS, 345, 529\nSheth R. K., Mo H. J., Tormen G., 2001, MNRAS, 323, 1\nSheth R. K., Tormen G., 1999, MNRAS, 308, 119\n-, 2004, MNRAS, 350, 1385\nSimon P., 2005a, A&A, 430, 827\n-, 2005b, PhD thesis, Rheinische Friedrich-Wilhelms Universitaet Bonn, Germany\n-, 2007, A&A, 473, 711\nSimon P., Hetterscheidt M., Schirmer M., Erben T., Schneider P., Wolf C., Meisenheimer K., 2007, A&A, 461, 861\nSimon P., Watts P., Schneider P., Hoekstra H., Gladders\nM. D., Yee H. K. C., Hsieh B. C., Lin H., 2008, A&A, 479,\n655\nSmith R. E., Peacock J. A., Jenkins A., White S. D. M.,\nFrenk C. S., Pearce F. R., Thomas P. A., Efstathiou G.,\nCouchman H. M. P., 2003, MNRAS, 341, 1311\nSpergel D. N., Bean R., Doré O., Nolta M. R., Bennett\nC. L., Dunkley J., Hinshaw G., Jarosik N., Komatsu E.,\nPage L., Peiris H. V., Verde L., Halpern M., Hill R. S.,\nKogut A., Limon M., Meyer S. S., Odegard N., Tucker\nG. S., Weiland J. L., Wollack E., Wright E. L., 2007, ApJS,\n170, 377\nSpringel V., White S. D. M., Jenkins A., Frenk C. S.,\nYoshida N., Gao L., Navarro J., Thacker R., Croton D.,\nHelly J., Peacock J. A., Cole S., Thomas P., Couchman\nH., Evrard A., Colberg J., Pearce F., 2005, Nature, 435,\n629\nSwanson M. E. C., Tegmark M., Blanton M., Zehavi I.,\n2008, MNRAS, 385, 1635\nSzapudi I., Szalay A. S., 1997, arXiv:astro-ph/9704241\nTegmark M., Bromley B. C., 1999, ApJ, 518, L69\nTegmark M., Peebles P. J. E., 1998, ApJ, 500, L79\n\n\fClustering and joint HOD of red and blue galaxies in COMBO-17\nTereno I., Doré O., van Waerbeke L., Mellier Y., 2005,\nA&A, 429, 383\nThomas D., Maraston C., Bender R., Mendes de Oliveira\nC., 2005, ApJ, 621, 673\nTinker J. L., Weinberg D. H., Zheng Z., Zehavi I., 2005,\nApJ, 631, 41\nTotsuji H., Kihara T., 1969, PASJ, 21, 221\nvan den Bosch F. C., Yang X., Mo H. J., Weinmann S. M.,\nMacciò A. V., More S., Cacciato M., Skibba R., Kang X.,\n2007, MNRAS, 376, 841\nvan Waerbeke L., 1998, A&A, 334, 1\nWang Y., Yang X., Mo H. J., van den Bosch F. C., 2007,\nApJ, 664, 608\nWhite M., Zheng Z., Brown M. J. I., Dey A., Jannuzi B. T.,\n2007, ApJ, 655, L69\nWild V., Peacock J. A., Lahav O., Conway E., Maddox S.,\nBaldry I. K., Baugh C. M., Bland-Hawthorn J., Bridges\nT., Cannon R., Cole S., Colless M., Collins C., Couch W.,\nDalton G., De Propris R., Driver S. P., Efstathiou G., Ellis\nR. S., Frenk C. S., Glazebrook K., Jackson C., Lewis I.,\nLumsden S., Madgwick D., Norberg P., Peterson B. A.,\nSutherland W., Taylor K., 2005, MNRAS, 356, 247\nWillmer C. N. A., da Costa L. N., Pellegrini P. S., 1998,\nAJ, 115, 869\nWolf C., Dye S., Kleinheinrich M., Meisenheimer K., Rix\nH.-W., Wisotzki L., 2001, A&A, 377, 442\nWolf C., Meisenheimer K., Kleinheinrich M., Borch A., Dye\nS., Gray M., Wisotzki L., Bell E. F., Rix H.-W., Cimatti\nA., Hasinger G., Szokoly G., 2004, A&A, 421, 913\nWolf C., Meisenheimer K., Rix H.-W., Borch A., Dye S.,\nKleinheinrich M., 2003, A&A, 401, 73\nZehavi I., Blanton M. R., Frieman J. A., Weinberg D. H.,\nMo H. J., Strauss M. A., Anderson S. F., Annis J., Bahcall\nN. A., Bernardi M., Briggs J. W., Brinkmann J., Burles\nS., Carey L., Castander F. J., Connolly A. J., Csabai I.,\nDalcanton J. J., Dodelson S., Doi M., Eisenstein D., Evans\nM. L., Finkbeiner D. P., Friedman S., Fukugita M., Gunn\nJ. E., Hennessy G. S., Hindsley R. B., Ivezić Ž., Kent S.,\nKnapp G. R., Kron R., Kunszt P., Lamb D. Q., Leger\nR. F., Long D. C., Loveday J., Lupton R. H., McKay\nT., Meiksin A., Merrelli A., Munn J. A., Narayanan V.,\nNewcomb M., Nichol R. C., Owen R., Peoples J., Pope A.,\nRockosi C. M., Schlegel D., Schneider D. P., Scoccimarro\nR., Sheth R. K., Siegmund W., Smee S., Snir Y., Stebbins\nA., Stoughton C., SubbaRao M., Szalay A. S., Szapudi I.,\nTegmark M., Tucker D. L., Uomoto A., Vanden Berk D.,\nVogeley M. S., Waddell P., Yanny B., York D. G., 2002,\nApJ, 571, 172\nZehavi I., Weinberg D. H., Zheng Z., Berlind A. A., Frieman J. A., Scoccimarro R., Sheth R. K., Blanton M. R.,\nTegmark M., Mo H. J., Bahcall N. A., Brinkmann J.,\nBurles S., Csabai I., Fukugita M., Gunn J. E., Lamb D. Q.,\nLoveday J., Lupton R. H., Meiksin A., Munn J. A., Nichol\nR. C., Schlegel D., Schneider D. P., SubbaRao M., Szalay\nA. S., Uomoto A., York D. G., 2004, ApJ, 608, 16\nZehavi I., Zheng Z., Weinberg D. H., Frieman J. A., Berlind\nA. A., Blanton M. R., Scoccimarro R., Sheth R. K.,\nStrauss M. A., Kayo I., Suto Y., Fukugita M., Nakamura\nO., Bahcall N. A., Brinkmann J., Gunn J. E., Hennessy\nG. S., Ivezić Ž., Knapp G. R., Loveday J., Meiksin A.,\nSchlegel D. J., Schneider D. P., Szapudi I., Tegmark M.,\nVogeley M. S., York D. G., 2005, ApJ, 630, 1\n\n27\n\nZheng Z., Berlind A. A., Weinberg D. H., Benson A. J.,\nBaugh C. M., Cole S., Davé R., Frenk C. S., Katz N.,\nLacey C. G., 2005, ApJ, 633, 791\nZheng Z., Coil A. L., Zehavi I., 2007, ApJ, 667, 760\nZheng Z., Weinberg D. H., 2007, ApJ, 659, 1\n\n\f28\n\nRED SAMPLE\nlog10 m′\nǫ\n\nz̄\n\n[log10 mmin\n\nσlogm\n\n0.3\n0.3\n∗0.3\n\n12.1+0.5\n−0.4\n11.9+0.3\n−0.2\n11.8+0.3\n−0.3\n\n0.5+0.3\n−0.3\n0.5+0.3\n−0.3\n0.5+0.3\n−0.3\n\n13.9+1.5\n−1.5\n12.6+1.6\n−1.4\n12.9+0.9\n−0.8\n\n0.5\n0.5\n0.5\n\n12.2+0.2\n−0.2\n12.0+0.2\n−0.2\n12.0+0.2\n−0.2\n\n0.5+0.3\n−0.3\n0.5+0.3\n−0.3\n0.5+0.3\n−0.3\n\n0.7\n0.7\n0.7\n\n12.0+0.3\n−0.2\n12.0+0.2\n−0.2\n12.1+0.2\n−0.2\n\n0.9\n0.9\n0.9\n\nALL\nALL\nALL\n\nBLUE SAMPLE\nlog10 m′\nǫ\n\nf\n\nλ]\n\n[log10 mmin\n\nσlogm\n\nf\n\nλ]\n\nR\n\ntype\n\n1.0+0.5\n−0.4\n0.8+0.5\n−0.4\n1.0+0.4\n−0.3\n\n1.7+0.9\n−0.9\n1.3+1.0\n−0.8\n1.4+0.9\n−0.9\n\n4.3+2.9\n−2.0\n5.0+3.1\n−2.7\n5.3+3.0\n−2.8\n\n11.0+0.3\n−0.3\n10.9+0.2\n−0.2\n10.8+0.3\n−0.2\n\n0.5+0.3\n−0.3\n0.5+0.3\n−0.3\n0.5+0.3\n−0.3\n\n13.6+1.6\n−0.9\n13.0+1.7\n−0.6\n12.8+0.7\n−0.5\n\n1.1+0.5\n−0.5\n1.1+0.4\n−0.5\n1.2+0.4\n−0.3\n\n1.5+1.0\n−0.9\n0.6+0.8\n−0.4\n1.2+1.0\n−0.8\n\n4.5+2.6\n−2.0\n5.5+2.8\n−2.5\n3.9+3.0\n−2.0\n\n+0.0+0.6\n−0.6\n+0.0+0.5\n−0.5\n+0.3+0.5\n−0.6\n\nS\nM\nC\n\n13.9+1.3\n−1.7\n12.3+1.5\n−1.0\n12.6+1.0\n−0.8\n\n0.7+0.6\n−0.4\n0.6+0.3\n−0.3\n0.7+0.3\n−0.3\n\n1.9+0.7\n−0.9\n1.3+0.9\n−0.7\n1.4+0.9\n−0.8\n\n5.5+2.6\n−2.6\n5.2+2.9\n−2.7\n5.2+2.9\n−2.7\n\n11.3+0.2\n−0.2\n11.2+0.2\n−0.1\n11.2+0.2\n−0.2\n\n0.5+0.3\n−0.3\n0.5+0.3\n−0.3\n0.5+0.3\n−0.3\n\n13.1+1.8\n−0.8\n12.7+1.0\n−0.6\n12.6+0.7\n−0.5\n\n1.0+0.4\n−0.4\n0.9+0.4\n−0.4\n1.0+0.3\n−0.3\n\n0.9+0.8\n−0.5\n0.5+0.4\n−0.2\n0.4+0.5\n−0.2\n\n4.9+3.0\n−2.4\n6.0+2.4\n−2.6\n4.7+3.2\n−2.2\n\n+0.2+0.5\n−0.5\n+0.2+0.5\n−0.5\n+0.6+0.3\n−0.5\n\nS\nM\nC\n\n0.5+0.3\n−0.3\n0.5+0.3\n−0.3\n0.5+0.3\n−0.3\n\n13.2+0.3\n−0.3\n13.1+0.3\n−0.4\n13.1+0.3\n−0.4\n\n1.6+0.3\n−0.3\n1.5+0.3\n−0.3\n1.5+0.3\n−0.2\n\n1.8+0.8\n−0.8\n1.6+0.8\n−0.8\n1.5+0.9\n−0.8\n\n5.3+2.8\n−2.7\n5.3+2.7\n−2.8\n5.1+3.1\n−3.1\n\n11.1+0.1\n−0.1\n11.1+0.1\n−0.1\n11.1+0.1\n−0.1\n\n0.5+0.3\n−0.3\n0.5+0.3\n−0.3\n0.5+0.3\n−0.3\n\n13.0+0.2\n−0.3\n12.9+0.2\n−0.2\n12.7+0.3\n−0.3\n\n1.7+0.2\n−0.3\n1.6+0.2\n−0.2\n1.4+0.2\n−0.2\n\n1.2+0.8\n−0.5\n0.8+0.6\n−0.4\n0.9+0.7\n−0.5\n\n6.9+1.9\n−2.1\n7.7+1.5\n−1.9\n6.5+2.2\n−2.3\n\n+0.1+0.5\n−0.5\n−0.2+0.5\n−0.4\n+0.3+0.5\n−0.6\n\nS\nM\nC\n\n12.5+0.3\n−0.3\n12.5+0.3\n−0.3\n12.5+0.3\n−0.3\n\n0.5+0.3\n−0.3\n0.5+0.3\n−0.3\n0.4+0.3\n−0.3\n\n14.5+1.0\n−1.8\n14.4+1.1\n−2.1\n14.2+1.2\n−1.6\n\n0.9+0.6\n−0.5\n0.9+0.6\n−0.5\n0.8+0.6\n−0.5\n\n1.7+0.8\n−0.9\n1.5+0.9\n−0.9\n1.1+1.2\n−0.9\n\n4.5+3.0\n−2.2\n4.4+3.3\n−2.3\n4.7+2.9\n−2.4\n\n11.5+0.2\n−0.2\n11.4+0.2\n−0.2\n11.7+0.2\n−0.3\n\n0.5+0.3\n−0.3\n0.5+0.3\n−0.3\n0.5+0.3\n−0.3\n\n14.5+1.0\n−1.2\n14.4+1.0\n−1.2\n14.5+1.1\n−1.4\n\n1.2+0.5\n−0.5\n1.1+0.5\n−0.6\n1.2+0.5\n−0.5\n\n1.2+1.0\n−0.7\n0.6+0.7\n−0.4\n1.0+1.1\n−0.7\n\n4.5+2.3\n−1.9\n5.7+2.3\n−2.2\n3.9+2.1\n−1.7\n\n−0.1+0.6\n−0.5\n+0.1+0.6\n−0.6\n+0.5+0.3\n−0.6\n\nS\nM\nC\n\n12.2+0.2\n−0.2\n12.1+0.1\n−0.1\n12.1+0.1\n−0.1\n\n0.5+0.2\n−0.2\n0.5+0.2\n−0.2\n0.5+0.2\n−0.2\n\n13.4+0.7\n−0.7\n12.9+0.4\n−0.4\n13.1+0.3\n−0.3\n\n1.3+0.3\n−0.3\n1.1+0.2\n−0.2\n1.1+0.2\n−0.2\n\n1.9+0.5\n−0.5\n1.3+0.5\n−0.5\n1.4+0.5\n−0.5\n\n4.3+1.6\n−1.6\n4.4+1.9\n−1.9\n5.1+1.4\n−1.4\n\n11.2+0.1\n−0.1\n11.2+0.1\n−0.1\n11.1+0.1\n−0.1\n\n0.5+0.2\n−0.2\n0.5+0.2\n−0.2\n0.5+0.2\n−0.2\n\n13.0+0.2\n−0.2\n12.9+0.2\n−0.2\n12.8+0.2\n−0.2\n\n1.4+0.2\n−0.2\n1.4+0.2\n−0.2\n1.3+0.2\n−0.2\n\n1.0+0.4\n−0.4\n0.5+0.2\n−0.2\n0.6+0.3\n−0.3\n\n5.3+1.4\n−1.4\n7.0+1.3\n−1.3\n4.8+1.2\n−1.2\n\n+0.1+0.2\n−0.2\n+0.1+0.2\n−0.2\n+0.5+0.2\n−0.2\n\nS\nM\nC\n\nP. Simon et al.\n\nTable 5. Compilation of MCMC results for the halo model parameters (see Section 6.2), obtained from fitting three different model scenarios to the N -statistics, relative galaxy\nnumbers and GGL-signal. The three scenarios are denoted by \"S\" (simple, no central galaxies), \"M\" (mixed, only red central galaxies) and \"C\" (central, red and blue central galaxies),\nrespectively. The parameters of mmin and m′ are in units of solar masses, h−1 M⊙ , the parameter R represents the JHOD correlation factor between the red and blue sample. Quoted\nparameter values stand for median and 1σ confidence limits as derived from the MCMCs. The last block of values at the bottom of the table contains constraints (mean and r.m.s.\nvariance) from all redshifts combined. The fiducial cosmological model uses WMAP3 parameters.\n\n\fClustering and joint HOD of red and blue galaxies in COMBO-17\nAPPENDIX A: DARK MATTER HALO\nPROPERTIES OF MODEL\nFor n(m), we use the semi-analytical peak-background split\nprescription of Sheth & Tormen (1999):\n√\n2\naν 2 d ln ν\naν\n1\ne− 2\n(A1)\nn(m) ∝ 2\n2\n−p\nm 1 + [aν ]\nd ln m\nwith ν = δc /(D(z)σ(m)), a = 0.707 and p = 0.3. The expression\nZ ∞\n2\n9\n2 [sin (rk) − rk cos (rk)]\nσ(m) =\nPlin (k) (A2)\ndkk\n2π 2 0\n(rk)6\ndenotes the top-hat variance of the linear dark matter fluc\"\n\"1/3\ntuations, within spheres of radius r = 4πρ3m\n. The\nΩ\ncrit m\n\nfunction D(z) denotes the linear growth factor, to be normalised to one for z = 0 (Peebles 1980):\nZ (1+z)−1\n1\n,\n(A3)\nD(z) ∝ H(a(z))\nda\n3\n[aH(a)]\n0\n\nwhere a(z) = (1 + z)−1 is the cosmological scale factor\nand H(a) the Hubble parameter. The constant δc , the overdensity of virialised haloes undergoing linear spherical collapse at z = 0, is chosen according to Nakamura & Suto\n(1997):\n\n3(12π)2/3\n[1 + 0.0123 log10 Ωm ] .\n(A4)\n20\nFor the cosmology adopted in this paper, one finds\nδc = 1.674. For the linear dark matter power spectrum the\nprescription of Eisenstein & Hu (1998) is employed. It is\nevolved to redshift z using the linear growth factor D(z).\nThe halo bias function we implemented into our model\nis from Tinker et al. (2005) which is a modification of the\noriginal function of Sheth et al. (2001):\nδc =\n\n1\nb(m) = 1 + √\n×\naδc\n»\n√\n√\na(aν 2 ) + ab(aν 2 )1−c −\n\n(aν 2 )c\n\n(A5)\n–\n\n(aν 2 )c\n+ b(1 − c)(1 − c/2)\n\nwith a = 0.707, b = 0.35, c = 0.8 and ν as previously defined. To guarantee that, when using this prescription for\nb(m), the two-halo term asymptotically fits the linear dark\nmatter power spectrum Plin (k) on large-scales (small k) we\nartificially normalise all Pij2h (k) in Eq. (40) by (see e.g. Mandelbaum et al. 2005)\n–2\n» Z\n1\n(A6)\ndm n(m) b(m) .\nb̄2 ≡\nm\nThis normalisation is b̄ = 1.02, 1.08 for z = 0.0, 1.0.\nThe dark matter density profile of haloes is in our model\na truncated NFW (Navarro et al. 1996):\n(\n1\n\"\n\"\nfor r 6 rvir\nr 1+ r 2\nr\nrs\nu0 (r, m) ∝\n,\n(A7)\ns\n0\notherwise\nrvir\nc(m,z)\n\n3\nrvir\n\n3m\n4πρcrit Ωm ∆vir (z)\n\nwith\n=\nand c(m, z) bewith rs ≡\ning the so-called viral radius and concentration parameter,\nrespectively. For the over-density within the virial radius we\nuse (Bullock et al. 2001):\n∆vir (z) =\n\n18π 2 + 82(Ωm (z) − 1) − 39(Ωm (z) − 1)2\n,\nΩm (z)\n\nρcrit (at redshift z = 0) and Ωm (z) are the critical matter density and matter density parameter, respectively;\nΩm ≡ Ωm (z = 0). The concentration parameter is calculated\naccording to Seljak (2000):\n«−0.20\n„\n10\nm\nc(m, z) =\n,\n(A9)\n1 + z m∗\nwhere the present day non-linear mass scale, m∗ , is defined by δc = σ(m∗ ). For our adopted cosmology we find\nm∗ = 1.9 × 1012 h−1 M⊙ .\n\nAPPENDIX B: EXACT STATISTICAL\nMOMENTS FOR CENTRAL GALAXY MODELS\nAs can be seen in Table 3, in a scenario where we split the\nhalo occupation number of one population (mixed scenario)\nor both populations (pure central scenario) into one central\ngalaxy and satellite galaxies one has to specify hNisat Njcen i,\nhNisat Njsat i or hNisat Nj i, hNicen Nj i as function of halo mass\nm, respectively. Here, we give general expressions in terms\nof the JHOD, P (Ni , Nj |m), of these moments. A detailed\nderivation for one of the moments is given, the others can\nbe obtained in a similar manner. Note that we skip the arguments \"(m)\" and \"|m\" in the JHOD for the derivation;\nall following equations are for haloes of a fixed mass.\nThe central galaxy-satellite splitting is done in such a\nway that we always have N cen = 1 if N > 1, N cen = 0 for\nN = 0, N sat = N − 1 for N > 1 and N sat = 0 for N 6 1.\nThis is to say that (H(x) is the Heaviside step function):\nNisat\n\n=\n\nNicen\n\n=\n\nH (Ni − 1) (Ni − 1) ,\n\n(B1)\n\nH (Ni − 1) .\n\n(B2)\n\nWe focus on hNisat Njcen i. Let us substitute the previous\nexpressions and write down explicitly the ensemble average\nin the statistical moment as sum over the JHOD (the states,\nhalo occupation numbers, are integers), taking into account\nthe Heaviside step functions:\nD\n=\n\n∞\n∞\nE\nX\nX\nNisat Njcen =\n(Ni − 1) P (Ni , Nj )\nNi =1 Nj =1\n\n∞\nX\n\n∞\nX\n\n(Ni − 1) P (Ni , Nj )\n\n∞\n0\nX\nX\n\n(Ni − 1) P (Ni , Nj )\n\n0\n∞\nX\nX\n\n(Ni − 1) P (Ni , Nj )\n\n0\n0\nX\nX\n\n(Ni − 1) P (Ni , Nj )\n\nNi =0 Nj =0\n\n−\n−\n+\n\nNi =0 Nj =0\n\nNi =0 Nj =0\n\nNi =0 Nj =0\n\n=\n\n+\n\nD\n\n∞\nE\nX\n(Ni − 1) P (Ni |Nj = 0)\nNi − 1 −\nNi =0\n\n∞\nX\n\nNj =0\n\n(A8)\n\n29\n\n=\n\nD\n\nP (Nj |Ni = 0) −\n\n0\nX\n\nP (Ni , Nj )\n\nNi ,Nj =0\n\nE\nD\nE\nNi − 1 − Ni |Nj = 0 + P (Nj = 0)\n\n\f30\n+\n=\n\nP. Simon et al.\nP (Ni = 0) − P (Ni = 0, Nj = 0)\nD\nE\nD E\nNi − 1 − Ni |Nj = 0 + P (Ni Nj = 0) ,\n\n(B3)\n\nwhere we denote by\nD\n\n∞\nE\nX\nNi |Nj = 0 ≡\nNi P (Ni , Nj = 0)\n\n(B4)\n\nNi =0\n\n∞\nX\n\nP (Ni , Nj ) ,\n\n(B5)\n\nNj =0\n\nP (Ni Nj = 0) = P (Ni = 0) + P (Nj = 0) − P (Ni = 0, Nj = 0)\nand\n0\n∞\nX\nX\n\nNi P (Ni , Nj ) = 0 .\n\n(B6)\n\nNi =0 Nj =0\n\nAnalogues to this little exercise in probability theory,\nwe find:\nD\nE\nNisat Njsat =\n(B7)\nhD E\ni hD E\ni\n=\nNi − 1\nNj − 1 + Rij σ(Ni )σ(Nj )\nD\nE D\nE\n+\nNi |Nj = 0 + Nj |Ni = 0 − P (Ni Nj = 0) ,\n\nand for the mixed scenario:\nE\nE D E D\nD\nNicen Nj = Nj − Nj |Ni = 0 ,\n\nIn applying Bayesian statistics to the problem of model fitting (MacKay 2003) one assesses the posterior probability\nfunction of the model parameters given the observed data,\nd:\nP (p|d) =\n\nthe conditional halo-average of Ni for which Nj = 0, whereas\nP (Ni Nj = 0) denotes the probability to find a halo which\nhas either Ni = 0 or Nj = 0. The conditional mean is\nzero, if all haloes have at least one j-galaxy. We have used\nin the foregoing calculus the relations (also with i and j\ninterchanged)\nP (Ni ) =\n\nAPPENDIX C: ESTIMATION OF BAYESIAN\nEVIDENCE\n\n(B8)\n\nand\nD\nE\nNisat Nj =\n(B9)\nhD E\niD E\nD\nE\nNi − 1 Nj + Rij σ(Ni )σ(Nj ) + Nj |Ni = 0 .\n\nIn conclusion, we find that the statistical moments for\nthe 2nd -order clustering statistics are surprisingly complex\nin a central galaxy scenario. Only in very simple cases, such\nas no correlation between distinct galaxy populations, i.e.\nfor the pure central scenario\nD\nE\nD\nED\nE\nNisat Njsat\n=\nNisat Njsat and\n(B10)\nD\nE\nD\nED\nE\nNicen Njsat\n=\nNicen Njsat ,\n(B11)\n\nwe find simple statistical cross-moments. Another trivial\ncase is given, if the haloes, for a fixed mass, always contain\n\"i\"- and \"j\"-galaxies: the conditional means and P (Ni Nj =\n0) in the foregoing equations vanish. Simply providing the\nfluctuations in the satellite number, the mean number of\nsatellites and central galaxies, and the JHOD correlation\nfactor, Rij , does not suffice in general, though. We have to\nmake additional assumptions about the JHOD in order to\nwork out all factorial moments of second order.\n\nP (d|p)P (p)\n∝ P (d|p)P (p) ;\nP (d)\n\n(C1)\n\nP (p) is a prior on the model parameters, possibly obtained\nfrom other observations, or motivated theoretically. P (d|p)\nis the probability of the data given a set of model parameters\n(likelihood function); this involves essentially the specification of a PDF for the noise in the observation. In this paper,\nwe tackle the problem of estimating the posterior likelihood,\nP (p|d), by using the MCMC technique.\nFor the mere constraints in model parameter space the\nprobability of the observed data, P (d), is unimportant because it is just some constant. It can be used in statistics,\nhowever, to discriminate between a set of models trying to\nexplain the data simultaneously, since P (d) is actually the\nprobability to obtain the data under the assumption that a\ncertain model is correct and taking into account the remaining uncertainties in p. As PDFs are normalised to one, one\nfinds for a particular model that\nZ\nP (d) = dp P (d|p)P (p) ,\n(C2)\nwhere the integral is over the full parameter space.\nEvaluating this integral requires, compared to the posterior, its own way of treatment (e.g. Heavens et al. 2007).\nWe will not go into that here. Instead, we are using the approximation mentioned in MacKay (2003), by saying that\nthe posterior likelihood around the maximum-likelihood\npoint can satisfyingly well described by a multivariate Gaussian; the inverse covariance of the parameter estimates – the\nHessian of the (log)posterior – at this point is the Fisher\nmatrix (MacKay 2003), F, which can be estimated from the\nMCMC tracks:\nln E ≡ ln P (d)\n(C3)\n ̃\n1ˆ\n2\n= − ln det (2πC) + χ + ln det (F/2π) − 2 ln P (pml ) ,\n2\n\nwhere P (pml ) is the prior likelihood of the maximumlikelihood parameters pml of the model, C is the covariance of the data noise (Gaussian) and χ2 is evaluated at the\nmaximum-likelihood point. By ln E we mean the Bayesian\nevidence of the data for a given model.\nA model \"A\" with larger ln Ea is more likely to reproduce the observed data than a model \"B\" with smaller\nevidence ln Eb . Depending on the ratio of evidence probabilities, or difference ∆ ln E = ln Ea − ln Eb , we would favour\nmodel \"A\" over model \"B\" (∆ ln E = 1 is a relative probability of 37%). Jeffreys (1961) suggests that the difference of\ntwo models is \"substantial\" for 1 6 ∆ ln E < 2.5, \"strong\"\nfor 2.5 6 ∆ ln E < 5 and \"decisive\" otherwise.\nThis paper has been typeset from a TEX/ LaTEX file prepared\nby the author.\n\n\f"}