{"id": "http://arxiv.org/abs/0804.4697v1", "guidislink": true, "updated": "2008-04-29T21:29:27Z", "updated_parsed": [2008, 4, 29, 21, 29, 27, 1, 120, 0], "published": "2008-04-29T21:29:27Z", "published_parsed": [2008, 4, 29, 21, 29, 27, 1, 120, 0], "title": "Convergence of all-order many-body methods: coupled-cluster study for Li", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0804.1995%2C0804.3444%2C0804.3618%2C0804.0396%2C0804.3103%2C0804.2356%2C0804.4252%2C0804.0257%2C0804.1051%2C0804.0997%2C0804.3057%2C0804.2352%2C0804.4746%2C0804.3488%2C0804.0244%2C0804.2406%2C0804.2693%2C0804.3093%2C0804.3042%2C0804.3181%2C0804.2848%2C0804.4328%2C0804.1746%2C0804.2775%2C0804.3418%2C0804.4697%2C0804.3151%2C0804.0574%2C0804.4476%2C0804.0183%2C0804.3322%2C0804.1140%2C0804.1683%2C0804.0488%2C0804.2722%2C0804.4599%2C0804.1789%2C0804.1537%2C0804.4066%2C0804.1444%2C0804.0788%2C0804.2531%2C0804.1395%2C0804.1145%2C0804.1176%2C0804.3654%2C0804.4674%2C0804.0135%2C0804.0266%2C0804.2163%2C0804.4106%2C0804.3534%2C0804.3073%2C0804.1704%2C0804.0893%2C0804.0998%2C0804.4361%2C0804.1271%2C0804.3064%2C0804.3502%2C0804.1487%2C0804.1398%2C0804.3716%2C0804.4858%2C0804.0387%2C0804.0937%2C0804.2654%2C0804.1310%2C0804.3423%2C0804.0617%2C0804.3445%2C0804.2327%2C0804.2885%2C0804.4289%2C0804.0802%2C0804.1560%2C0804.0495%2C0804.2501%2C0804.4393%2C0804.2047%2C0804.1922%2C0804.3455%2C0804.1335%2C0804.0258%2C0804.0913%2C0804.3727%2C0804.0419%2C0804.1282%2C0804.0901%2C0804.4247%2C0804.3836%2C0804.1657%2C0804.2703%2C0804.4513%2C0804.0859%2C0804.2135%2C0804.2382%2C0804.2964%2C0804.4358%2C0804.3485%2C0804.0444&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Convergence of all-order many-body methods: coupled-cluster study for Li"}, "summary": "We present and analyze results of the relativistic coupled-cluster\ncalculation of energies, hyperfine constants, and dipole matrix elements for\nthe $2s$, $2p_{1/2}$, and $2p_{3/2}$ states of Li atom. The calculations are\ncomplete through the fourth order of many-body perturbation theory for energies\nand through the fifth order for matrix elements and subsume certain chains of\ndiagrams in all orders. A nearly complete many-body calculation allows us to\ndraw conclusions on the convergence pattern of the coupled-cluster method. Our\nanalysis suggests that the high-order many-body contributions to energies and\nmatrix elements scale proportionally and provides a quantitative ground for\nsemi-empirical fits of {\\em ab inito} matrix elements to experimental energies.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0804.1995%2C0804.3444%2C0804.3618%2C0804.0396%2C0804.3103%2C0804.2356%2C0804.4252%2C0804.0257%2C0804.1051%2C0804.0997%2C0804.3057%2C0804.2352%2C0804.4746%2C0804.3488%2C0804.0244%2C0804.2406%2C0804.2693%2C0804.3093%2C0804.3042%2C0804.3181%2C0804.2848%2C0804.4328%2C0804.1746%2C0804.2775%2C0804.3418%2C0804.4697%2C0804.3151%2C0804.0574%2C0804.4476%2C0804.0183%2C0804.3322%2C0804.1140%2C0804.1683%2C0804.0488%2C0804.2722%2C0804.4599%2C0804.1789%2C0804.1537%2C0804.4066%2C0804.1444%2C0804.0788%2C0804.2531%2C0804.1395%2C0804.1145%2C0804.1176%2C0804.3654%2C0804.4674%2C0804.0135%2C0804.0266%2C0804.2163%2C0804.4106%2C0804.3534%2C0804.3073%2C0804.1704%2C0804.0893%2C0804.0998%2C0804.4361%2C0804.1271%2C0804.3064%2C0804.3502%2C0804.1487%2C0804.1398%2C0804.3716%2C0804.4858%2C0804.0387%2C0804.0937%2C0804.2654%2C0804.1310%2C0804.3423%2C0804.0617%2C0804.3445%2C0804.2327%2C0804.2885%2C0804.4289%2C0804.0802%2C0804.1560%2C0804.0495%2C0804.2501%2C0804.4393%2C0804.2047%2C0804.1922%2C0804.3455%2C0804.1335%2C0804.0258%2C0804.0913%2C0804.3727%2C0804.0419%2C0804.1282%2C0804.0901%2C0804.4247%2C0804.3836%2C0804.1657%2C0804.2703%2C0804.4513%2C0804.0859%2C0804.2135%2C0804.2382%2C0804.2964%2C0804.4358%2C0804.3485%2C0804.0444&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present and analyze results of the relativistic coupled-cluster\ncalculation of energies, hyperfine constants, and dipole matrix elements for\nthe $2s$, $2p_{1/2}$, and $2p_{3/2}$ states of Li atom. The calculations are\ncomplete through the fourth order of many-body perturbation theory for energies\nand through the fifth order for matrix elements and subsume certain chains of\ndiagrams in all orders. A nearly complete many-body calculation allows us to\ndraw conclusions on the convergence pattern of the coupled-cluster method. Our\nanalysis suggests that the high-order many-body contributions to energies and\nmatrix elements scale proportionally and provides a quantitative ground for\nsemi-empirical fits of {\\em ab inito} matrix elements to experimental energies."}, "authors": ["A. Derevianko", "S. G. Porsev", "K. Beloy"], "author_detail": {"name": "K. Beloy"}, "author": "K. Beloy", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevA.78.010503", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0804.4697v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0804.4697v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 3 figures", "arxiv_primary_category": {"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.atom-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0804.4697v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0804.4697v1", "journal_reference": "Phys. Rev. A 78, 010503 (2008)", "doi": "10.1103/PhysRevA.78.010503", "fulltext": "Convergence of all-order many-body methods: coupled-cluster study for Li\nA. Derevianko,1 S. G. Porsev,1, 2 and K. Beloy1\n\narXiv:0804.4697v1 [physics.atom-ph] 29 Apr 2008\n\n2\n\n1\nPhysics Department, University of Nevada, Reno, Nevada 89557, USA\nPetersburg Nuclear Physics Institute, Gatchina, Leningrad district, 188300, Russia\n(Dated: November 20, 2018)\n\nWe present and analyze results of the relativistic coupled-cluster calculation of energies, hyperfine\nconstants, and dipole matrix elements for the 2s, 2p1/2 , and 2p3/2 states of Li atom. The calculations\nare complete through the fourth order of many-body perturbation theory for energies and through\nthe fifth order for matrix elements and subsume certain chains of diagrams in all orders. A nearly\ncomplete many-body calculation allows us to draw conclusions on the convergence pattern of the\ncoupled-cluster method. Our analysis suggests that the high-order many-body contributions to\nenergies and matrix elements scale proportionally and provides a quantitative ground for semiempirical fits of ab inito matrix elements to experimental energies.\nPACS numbers: 31.15.ac, 31.15.am, 32.10.Fn, 32.70.Cs\n\nMany-body perturbation theory (MBPT) is a ubiquitous tool in atomic and nuclear physics and quantum\nchemistry. Yet its order-by-order convergence has been\nfound to fail in several systems (see, e.g., [1]). To circumvent this drawback, one usually employs all-order methods which implicitly sum most important classes (chains)\nof diagrams to all orders of MBPT. Even in this case, as\nwe illustrate here with a nearly-complete solution of the\nmany-body problem for Li, the saturation with respect to\na systematic addition of the all-order chains may reveal\na non-monotonic convergence. In other words, including\nincreasingly complex (and computationally more expensive) chains does not necessarily translate into a better\naccuracy.\nWhile such a convergence pattern may seem discouraging, we find that the high-order many-body contributions to energies and matrix elements vary proportionally\nas the all-order formalism is augmented with increasingly\ncomplex chains of diagrams. We explain this dependence\nby the similarity of self-energy contributions to both energies and matrix elements and provide a quantitative\nground for semi-empirical fits. This is especially valuable\nfor atomic systems, where high-accuracy experimental\ndata for energies are available, while the matrix elements\nhave a relatively poor accuracy. In some cases, e.g., in\nparity violation, the matrix elements of the weak interaction are not known experimentally at all, while they need\nto be computed to a high precision [2, 3]. Although the\nsemi-empirical fits have been used before [3, 4], the validity of such scaling has not been rigorously established.\nHere, based on a nearly complete many-body calculation,\nwe are able to address this question.\nWe solve the many-body problem for the three-electron\nLi atom. Here the availability of both high-accuracy\nvariational Hylleraas and experimental data makes the\nanalysis of minute high-order MBPT effects plausible.\nOur calculations are complete through the fourth order\nof MBPT for energies and through the fifth order for matrix elements. Additionally certain classes of diagrams\nare summed to all orders using the coupled cluster (CC)\nmethod. The previous CC-type formulations for Li [5, 6]\n\nwere complete only through the second order for energies\nand the third order for matrix elements.\nWe consider Li as a univalent atom and choose the\nlowest-order Hamiltonian to include the relativistic kinetic energy operator of electrons and their interactions with the nucleus and the V N −1 Dirac-Hartree-Fock\n(DHF) potential. The single-particle orbitals and energies εi are found from the set of the frozen-core DHF\nequations. Using the DHF basis, the Hamiltonian reads\n(up to an energy offset)\nH = H0 + G =\n\nX\ni\n\nεi N [a†i ai ] +\n\n1X\ngijkl N [a†i a†j al ak ] .\n2\nijkl\n\n(1)\nHere H0 is the one-electron lowest-order Hamiltonian, G\nis the residual Coulomb interaction, a†i and ai are the creation and annihilation operators, and N [* * * ] is the normal product of operators with respect to the core quasivacuum state |0c i. Indices i, j, k and l range over all possible single-particle orbitals, and gijkl are the Coulomb\nmatrix elements.\nWe are interested in obtaining the exact many-body\nstate |Ψv i that is seeded from the lowest-order DHF state\n(0)\n|Ψv i = a†v |0c i:\n|Ψv i = Ω |Ψ(0)\nv i,\n\n(2)\n\nwhere Ω (yet to be found) is the so-called wave operator [7]. In the CC method the MBPT diagrams are resummed to all orders and one introduces the exponential\nansatz for the wave operator\nΩ = N [exp(K)] = 1 + K +\n\n1\nN [K 2 ] + . . . ,\n2!\n\n(3)\n\nwhere the cluster operator K is expressed in terms of connected diagrams of the wave operator Ω. The operator\nK is decomposed into cluster operators (K)n combining\nn simultaneous excitations of core and valence electrons\n(0)\nfrom the reference state |Ψv i to all orders of MBPT. For\n\n\f2\nthe three-electron Li, the exact cluster operator reads\nK ≡ Sc + D c + Sv + D v + T v =\n\n+\n\n+\n\n+\n\n(4)\n\n+\n,\n\nthe double-headed arrow representing the valence state.\nSv and Dv (Sc , Dc ) are the valence (core) singles and\ndoubles, and Tv are the valence triples. This exhausts\nthe entire excitation basis for the three-electron Li (e.g.,\nthere are no core triples).\nIn the previous CC work for Li [5] the expansion (4)\nwas truncated at the S and D excitations and the CC\nequations contained only terms linear in the CC amplitudes (SD method). The full CC study involving S and\nD excitations was carried out in [8]; we will refer to it as\nthe CCSD approximation. Our present treatment is naturally labeled as CCSDvT to emphasize our additional\ninclusion of the valence triple excitations.\n\nBelow we present a topological structure of the CC\nequations for the cluster amplitudes in the CCSDvT approximation. The resulting equations for the core cluster\namplitudes Sc and Dc are the same as in the CCSD approximation [10] and we do not repeat them here. Representative diagrams involving triples are shown in Fig. 1.\nThe structure of the valence singles equation is\n− [H0 , Sv ] + δEv Sv = CCSD + Sv [Tv ] ,\n\n(7)\n\nwhere notation like Sv [Tv ] stands for the effect of the valence triples (Tv ) on the r.h.s. of the equation for valence\nsingles (Sv ). Here [H0 , Sv ] is a commutator, and δEv is\nthe valence correlation energy,\nδEv = δECCSD + δEv [Tv ] ,\n\n(8)\n\nwhere δECCSD is obtained within the CCSD approach\nand δEv [Tv ] is due to the valence triples. The equation\nfor the valence doubles reads\n−[H0 , Dv ] + δEv Dv ≈ CCSD + Dv [Tv ] .\nHere we discarded contribution Dv [Sc ⊗ Tv ] which stands\nfor a nonlinear contribution resulting from a product of\nclusters Sc and Tv . For the valence triples we obtain\n−[H0 , Tv ] + δEv Tv ≈ Tv [Dc ] + Tv [Dv ] + Tv [Tv ] +\nTv [Dc ⊗ Dv ] + Tv [Dc ⊗ Dc ] + Tv [Sv ⊗ Dc ] ,\n\nFIG. 1: Representative diagrams for various classes of contributions of the valence triples. The wavy lines represent\nthe residual Coulomb interaction and those capped with the\nheavy square represent a one-body interaction (e.g., hyperfine\ninteraction).\n\nA set of coupled equations for the cluster operators\n(K)n ( (Kc )1 = Sc , (Kv )1 = Sv , etc.) may be found\nfrom the Bloch equation [7] specialized for univalent systems [9]\n(εv − H0 ) (Kc )n = {Q G Ω}connected,n ,\n(εv + δEv − H0 ) (Kv )n = {Q G Ω}connected,n , (5)\nwhere the valence correlation energy\n(0)\nδEv = hΨ(0)\nv |GΩ|Ψv i\n(0)\n\n(0)\n\nand Q = 1 − |Ψv ihΨv | is the projection operator.\n\n(6)\n\nwith the discarded terms of higher order in G. Our approximation subsumes the entire set of fourth order diagrams for δEv . This is a substantial improvement over\nboth the SD and the CCSD method which are complete\nonly through the second order of MBPT.\nSolution of the CCSDvT equations provides us with\nthe wavefunctions and the correlation energies. With\nthe obtained wavefunctions we compute the matrix elements. The relevant CCSDvT formalism is presented\nin Refs. [10, 11]. In addition to the well-explored SD\ncontributions [5], our formalism includes contributions\nfrom the valence triples and also \"dressing\" of matrix\nelements. The dressing arises from re-summing nonlinear contributions to the atomic wavefunctions (2)\nin expressions for matrix elements and, in particular,\nguarantees that the important chain of random-phaseapproximation diagrams is fully recovered in all orders\nof MBPT [11]. In addition we incorporated all contributions that are quadratic in valence triples. Overall the\ncalculations of matrix elements are complete through the\nfifth order of MBPT and incorporate certain classes of diagrams summed to all orders.\nOur numerical calculations are based on our previous CCSDvT code [10], with the addition of the entire\nset of the non-linear CCSD contributions documented in\nRef. [8]. The important new additions are the effects\nof triples on triples Tv [Tv ] and the leading-order nonlinear terms on the r.h.s. of the triples equations. We also\nemployed efficient dual-kinetic-balance basis sets, as described in Ref. [12]. The basis set included partial waves\n\n\f3\nl = 0 − 6 for the S and D amplitudes and l = 0 − 4 for the\nTv amplitudes. Our final results include extrapolation for\nan infinitely large basis. Since the hyperfine interaction\noccurs at small distances, due to the uncertainty relation,\none has to keep orbitals with high excitation energies in\nthe basis.\nTABLE I: Contributions to removal energies of 2s, 2p1/2 , and\n2p3/2 states for 7 Li in cm−1 in various approximations.\n2s1/2\n2p1/2\n43087.3\n28232.9\n405.8\n352.0\n−6.8\n−5.0\n2.8\n2.6\n2.8\n3.3\n−1.1\n−1.1\n−3.3(5)\n−0.7(5)\n43487.5\n28584.1\n43487.2\n28583.5\nOther CC works\nSD+MBPT-III [6] 43487.5\n28581.9\nCCSD [14]\n43483\n28567\n\nDHF\n∆SD\n∆CCSD\n∆(Tv [Dv + Dc ])a\n∆(Tv [Tv ])\n∆(Tv [NL])a\ncorrectionsb\nTotal\nExperiment [13]\n\n2p3/2\n28232.3\n351.9\n−5.0\n2.6\n3.3\n−1.1\n−0.4(5)\n28583.7\n28583.2\n\nFIG. 2: (Color online) Convergence pattern of the CCSDvT\nmethod as a function of MBPT complexity for the HFS constant of the ground state of Li. Breit, QED, recoil and basis\nset corrections are included in all theoretical values.\n\n28581.5\nvT[vT]\n\na\nTv [Dv + Dc ] = Tv [Dv ] + Tv [Dc ],\nTv [NL] = Tv [Dc ⊗ Dv ] + Tv [Dc ⊗ Dc ] + Tv [Sv ⊗ Dc ]\nb\nincludes basis set, recoil, Breit, and QED corrections. Error\nbar is due to basis extrapolation\n\nTABLE II: Contributions to the magnetic-dipole hyperfine\nstructure constants A of 2s, 2p1/2 , and 2p3/2 states for 7 Li\n(I = 3/2, μ = 3.256427(2)) in MHz in various approximations.\nDHF\n∆SD\n∆CCSD\n∆ dressing\n∆(Tv [Dv + Dc ])\n∆(Tv [Tv ])\n∆(Tv [NL])\ncorrectionsa\nTotal\nExperiment\nExperiment\n\n2s1/2\n284.35\n117.68\n−1.79\n−0.40\n1.25\n0.28\n−0.04\n0.33(3)\n401.66\n401.75..b\n\n2p1/2\n2p3/2\n32.295\n6.457\n13.622\n-9.474\n−0.233\n0.176\n−0.039\n0.031\n0.218\n-0.175\n0.058\n-0.031\n−0.010\n0.002\n0.046(6)\n-0.026(1)\n45.958\n-3.041\n45.914(25)c -3.055(14)c\n46.010(25)d\n\na\n\nincludes basis set, recoil, Breit, and QED corrections. Error\nbar is due to the basis extrapolation.\nb\n401.7520433(5) Schlecht and McColm [15]; c Orth et al. [16]\nd\nWalls et al. [17];\n\nIn Tables I and II we present calculated energies and\nmagnetic-dipole hyperfine structure (HFS) constants A.\nIn these tables the entries are ordered by increasing\nMBPT complexity of the calculations. ∆ denotes a difference from the preceding entry due to extra classes of\nthe diagrams included at that level of approximation.\nFor example, the entry ∆CCSD is obtained by taking\na difference between the CCSD and the SD results. We\ninclude Breit, QED, and recoil corrections in our final\n\nSD\n\nvT[Dc+Dv]\n\nCCSD\n\nFIG. 3: (Color online) Variations from the the final CCSDvT values of A2s and E2s in different approximations, e.g.,\n∆XSD = XSD −XCCSDvT . The variations in matrix elements\nand energies are correlated and exhibit linear dependence.\n\nresult. For energies they were adopted from Ref. [6], for\nA2s from [18], and for A2pj from [19]. The basis set extrapolation was carried out in the conventional manner\n(see, e.g., [6]). The error bar is estimated as a half of the\nbasis-set extrapolation correction. The HFS constants\nwere computed using finite nucleus and uniform magnetization.\nThe correlation contributions follow a similar pattern\nin all these cases. We illustrate the convergence of the\nall-order method in the case of the HFS constant for\nthe ground state in Fig. 2. Here the experimental uncertainty is about 1 ppb so that the deviation from the\nexperimental value is an indication of the theoretical accuracy. The dominant correlations are recovered at the\nSD level, which captures all third-order diagrams and results in a 0.2% theoretical accuracy. The inclusion of the\nCCSD non-linear effects and the dressing leads to a worse\nagreement with the experiment (-0.4%). An inclusion of\nthe leading valence triples returns the agreement to the\n0.1% level. The addition of the higher-order Tv [Tv ] effect\n\n\f4\nresults in an almost perfect agreement with the experiment. Finally, Tv [NL] diagrams provide only a minor\ncorrection. The final result is complete through the fifth\norder and agrees with the experiment at the 0.02% level.\nFinally, we present the computed reduced matrix elements of the electric-dipole operator.\nWe\nobtain in the CCSDvT approximation with the\ndressing h2s1/2 ||D||2p1/2 i = 3.31633(7)|e|a0 and\nh2s1/2 ||D||2p3/2 i = 4.6901(1)|e|a0. These values also include basis extrapolation and are complete through the\nfifth order of MBPT. The error bars here correspond to a\nhalf of the basis extrapolation correction. Again, the convergence with respect to the addition of higher-order diagrams follows the same pattern as for the HFS constants\n(Fig. 2) and energies. To facilitate a comparison with\nthe previous high-accuracy variational studies we form\nthe oscillator strength f for the 2s − 2p transition. Our\nresult, f = 0.74686, is smaller than the non-relativistic\nvariational value [20] by 0.01%. The size and the sign of\nthe difference is consistent with the expected difference\ndue to relativistic effects.\nThe accuracy and the completeness of our calculations\nallow us to make the following observations.\nAccuracy. The CCSDvT method improves the accuracy over the previous less complete CC-type calculations. For example, for energies the overall agreement\nstands at a few 0.1 cm−1 while the SD method is accurate to a few cm−1 . Similarly, there is an order of magnitude improvement in the accuracy of computing A2s over\nthat of the SD approximation. The remaining differences\nwith the experiment are likely due to higher-order diagrams discarded in our scheme; these are consistent with\nthe size of the Tv [NL] effect.\nConvergence. In the absence of general theorems on\nconvergence of MBPT, the present work provides an empirical proof that the CC method converges for Li. For\n\n[1] M. L. Leininger, W. D. Allen, H. F. Schaefer III, and\nC. D. Sherrill, J. Chem. Phys. 112, 9213 (2000).\n[2] A. Derevianko and S. G. Porsev, Eur. Phys. J. A 32, 517\n(2007).\n[3] V. Dzuba, V. Flambaum, and J. Ginges, Phys. Rev. D\n66, 076013/1 (2002).\n[4] W. R. Johnson, Z. W. Liu, and J. Sapirstein, At. Data\nNucl. Data Tables 64, 279 (1996).\n[5] S. A. Blundell, W. R. Johnson, Z. W. Liu, and\nJ. Sapirstein, Phys. Rev. A 40, 2233 (1989).\n[6] W. R. Johnson, U. I. Safronova, A. Derevianko, and M. S.\nSafronova, Phys. Rev. A 77, 022510 (2008).\n[7] I. Lindgren and J. Morrison, Atomic Many–Body Theory\n(Springer–Verlag, Berlin, 1986), 2nd ed.\n[8] R. Pal, M. S. Safronova, W. R. Johnson, A. Derevianko,\nand S. G. Porsev, Phys. Rev. A 75, 042515 (2007).\n[9] A. Derevianko and E. D. Emmons, Phys. Rev. A 66,\n012503 (2002).\n[10] S. G. Porsev and A. Derevianko, Phys. Rev. A 73, 012501\n(2006).\n[11] A. Derevianko and S. G. Porsev, Phys. Rev. A 71, 032509\n\nall the computed properties the saturation of the method\nwith respect to adding increasingly complex classes of diagrams is not monotonic, as illustrated in Fig. 2. The\nempirical conclusion for other, more complex, univalent\natoms is that both the non-linear CCSD effects and the\nvalence triples have to be treated simultaneously [2].\nCorrelation between corrections to the energy and to\nthe matrix elements. There is a strong link between\nthe convergence patterns for energies and for matrix elements. This is illustrated in Fig. 3: the deviations of\nthe A2s and E2s from the final CCSDvT values follow\nroughly a linear law. The data for matrix elements does\nnot include dressing. A similar pattern is observed for\nother matrix elements as well. Such a linear dependence\nis due to the effect of self-energy (Brueckner) correction.\nThis dominant chain of diagrams is presented in both\nmatrix elements and energies. For example, for triple excitations, the corrections Sv [Tv ] and δEv [Tv ] arise from\nthe same diagram and the modification of singles due to\ntriples propagates into the calculation of the matrix element. Similar scaling ideas were used earlier [3, 4] to fit\nlow-order results to higher orders, but never rigorously\ntested. Of course, as apparent from Fig. 3, the linear\nscaling is only approximate and can be used in the semiempirical fits only to a certain accuracy. For example, the\nself-energy corrections do not affect \"dressing\" of matrix\nelements which contributes at a sizable 0.1% level to the\nA2s constant. Neither can it capture the distinctivelydifferent QED corrections to the energies and matrix elements.\nWe would like to thank V. Dzuba and V. Yerokhin\nfor discussions. This work was supported in part by the\nNational Science Foundation. S.G.P. was supported in\npart by the RFBR under grants No. 07-02-00210-a and\n08-02-00460-a.\n\n(2005).\n[12] K. Beloy and A. Derevianko, Comp. Phys. Comm.\n(2008), doi:10.1016/j.cpc.2008.03.004.\n[13] Y. Ralchenko, A. E. Kramida, J. Reader, and NIST\nASD Team, NIST atomic spectra database (version 3.1.4)\n(2008), URL http://physics.nist.gov/asd3.\n[14] E. Eliav, U. Kaldor, and Y. Ishikawa, Phys. Rev. A 50,\n1121 (1994).\n[15] R. G. Schlecht and D. W. McColm, Phys. Rev. 142, 11\n(1966).\n[16] H. Orth, H. Ackermann, and E. W. Otten, Z. Phys. A\n273, 221 (1975).\n[17] J. Walls, R. Ashby, J. Clarke, B. Lu, and W. A. van\nWijngaarden, Eur. Phys. J. D 22, 159 (2003).\n[18] V. A. Yerokhin, Phys. Rev. A 77, 020501 (2008).\n[19] J. Bieroń, P. Jönsson, and C. Froese Fischer, Phys. Rev.\nA 53, 2181 (1996).\n[20] Z.-C. Yan and G. W. F. Drake, Phys. Rev. A 52, 3711\n(1995).\n\n\f"}