{"id": "http://arxiv.org/abs/1101.0822v2", "guidislink": true, "updated": "2011-01-23T21:02:09Z", "updated_parsed": [2011, 1, 23, 21, 2, 9, 6, 23, 0], "published": "2011-01-04T21:11:35Z", "published_parsed": [2011, 1, 4, 21, 11, 35, 1, 4, 0], "title": "The Matter Bounce Curvaton Scenario", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.3690%2C1101.3890%2C1101.5126%2C1101.4094%2C1101.3704%2C1101.3020%2C1101.2571%2C1101.2030%2C1101.2622%2C1101.4940%2C1101.2210%2C1101.4353%2C1101.4171%2C1101.3646%2C1101.5840%2C1101.3444%2C1101.3879%2C1101.5182%2C1101.0904%2C1101.3781%2C1101.3280%2C1101.0244%2C1101.4184%2C1101.3014%2C1101.3053%2C1101.4273%2C1101.4887%2C1101.3428%2C1101.1608%2C1101.1861%2C1101.1849%2C1101.1974%2C1101.0605%2C1101.3639%2C1101.4511%2C1101.5833%2C1101.1987%2C1101.3138%2C1101.3427%2C1101.0144%2C1101.0568%2C1101.2901%2C1101.0641%2C1101.0338%2C1101.3484%2C1101.5353%2C1101.5422%2C1101.3862%2C1101.1897%2C1101.2855%2C1101.3993%2C1101.0612%2C1101.5354%2C1101.1911%2C1101.0879%2C1101.0822%2C1101.1778%2C1101.2390%2C1101.5287%2C1101.4078%2C1101.0288%2C1101.3154%2C1101.4136%2C1101.2054%2C1101.2114%2C1101.4362%2C1101.2100%2C1101.2966%2C1101.0770%2C1101.5588%2C1101.0200%2C1101.1871%2C1101.1115%2C1101.0599%2C1101.6023%2C1101.4275%2C1101.3292%2C1101.2562%2C1101.6024%2C1101.3388%2C1101.0355%2C1101.2842%2C1101.2010%2C1101.3903%2C1101.2491%2C1101.5061%2C1101.2222%2C1101.1645%2C1101.5230%2C1101.2074%2C1101.3327%2C1101.0380%2C1101.2611%2C1101.4383%2C1101.2046%2C1101.1758%2C1101.5886%2C1101.1442%2C1101.4117%2C1101.4214%2C1101.2682&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Matter Bounce Curvaton Scenario"}, "summary": "Massless scalar fields originating in a quantum vacuum state acquire a\nscale-invariant spectrum of fluctuations in a matter-dominated contracting\nuniverse. We show that these isocurvature fluctuations transfer to a\nscale-invariant spectrum of curvature fluctuations during a non-singular bounce\nphase. This provides a mechanism for enhancing the primordial adiabatic\nfluctuations and suppressing the ratio of tensor to scalar perturbations.\nMoreover, this mechanism leads to new sources of non-Gaussianity of curvature\nperturbations.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.3690%2C1101.3890%2C1101.5126%2C1101.4094%2C1101.3704%2C1101.3020%2C1101.2571%2C1101.2030%2C1101.2622%2C1101.4940%2C1101.2210%2C1101.4353%2C1101.4171%2C1101.3646%2C1101.5840%2C1101.3444%2C1101.3879%2C1101.5182%2C1101.0904%2C1101.3781%2C1101.3280%2C1101.0244%2C1101.4184%2C1101.3014%2C1101.3053%2C1101.4273%2C1101.4887%2C1101.3428%2C1101.1608%2C1101.1861%2C1101.1849%2C1101.1974%2C1101.0605%2C1101.3639%2C1101.4511%2C1101.5833%2C1101.1987%2C1101.3138%2C1101.3427%2C1101.0144%2C1101.0568%2C1101.2901%2C1101.0641%2C1101.0338%2C1101.3484%2C1101.5353%2C1101.5422%2C1101.3862%2C1101.1897%2C1101.2855%2C1101.3993%2C1101.0612%2C1101.5354%2C1101.1911%2C1101.0879%2C1101.0822%2C1101.1778%2C1101.2390%2C1101.5287%2C1101.4078%2C1101.0288%2C1101.3154%2C1101.4136%2C1101.2054%2C1101.2114%2C1101.4362%2C1101.2100%2C1101.2966%2C1101.0770%2C1101.5588%2C1101.0200%2C1101.1871%2C1101.1115%2C1101.0599%2C1101.6023%2C1101.4275%2C1101.3292%2C1101.2562%2C1101.6024%2C1101.3388%2C1101.0355%2C1101.2842%2C1101.2010%2C1101.3903%2C1101.2491%2C1101.5061%2C1101.2222%2C1101.1645%2C1101.5230%2C1101.2074%2C1101.3327%2C1101.0380%2C1101.2611%2C1101.4383%2C1101.2046%2C1101.1758%2C1101.5886%2C1101.1442%2C1101.4117%2C1101.4214%2C1101.2682&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Massless scalar fields originating in a quantum vacuum state acquire a\nscale-invariant spectrum of fluctuations in a matter-dominated contracting\nuniverse. We show that these isocurvature fluctuations transfer to a\nscale-invariant spectrum of curvature fluctuations during a non-singular bounce\nphase. This provides a mechanism for enhancing the primordial adiabatic\nfluctuations and suppressing the ratio of tensor to scalar perturbations.\nMoreover, this mechanism leads to new sources of non-Gaussianity of curvature\nperturbations."}, "authors": ["Yi-Fu Cai", "Robert Brandenberger", "Xinmin Zhang"], "author_detail": {"name": "Xinmin Zhang"}, "author": "Xinmin Zhang", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1475-7516/2011/03/003", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1101.0822v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1101.0822v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "15 pages, 4 figs; a few references added", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1101.0822v2", "affiliation": "Arizona State, McGill and IHEP Beijing", "arxiv_url": "http://arxiv.org/abs/1101.0822v2", "journal_reference": "JCAP 1103:003,2011", "doi": "10.1088/1475-7516/2011/03/003", "fulltext": "The Matter Bounce Curvaton Scenario\nYi-Fu Caia,b , Robert Brandenbergerc,b and Xinmin Zhangb,d\n\narXiv:1101.0822v2 [hep-th] 23 Jan 2011\n\na Department of Physics, Arizona State University, Tempe, AZ 85287, USA\nb Institute of High Energy Physics, Chinese Academy of Sciences, P.O. Box 918-4, Beijing 100049, P.R. China\nc Department of Physics, McGill University, Montréal, QC, H3A 2T8, Canada and\nd Theoretical Physics Center for Science Facilities (TPCSF), Chinese Academy of Sciences, P.R. China\nMassless scalar fields originating in a quantum vacuum state acquire a scale-invariant spectrum\nof fluctuations in a matter-dominated contracting universe. We show that these isocurvature fluctuations transfer to a scale-invariant spectrum of curvature fluctuations during a non-singular bounce\nphase. This provides a mechanism for enhancing the primordial adiabatic fluctuations and suppressing the ratio of tensor to scalar perturbations. Moreover, this mechanism leads to new sources\nof non-Gaussianity of curvature perturbations.\nPACS numbers: 98.80.Cq\n\nI.\n\nINTRODUCTION\n\nA successful resolution of the hot Big Bang singularity may lead to a non-singular bounce cosmology. Nonsingular bounces were proposed a long time ago [1].\nThey were studied in models motivated by approaches to\nquantum gravity such as modified gravity models [2, 3],\nhigher derivative gravity actions (see e.g. [4–6]), nonrelativistic gravitational actions [7–10], brane world scenarios [11, 12], \"Pre-Big-Bang\" [13] and Ekpyrotic [14]\ncosmology 1 , or loop quantum cosmology [18]. Bouncing\ncosmologies can also be obtained using arguments from\nsuperstring theory. For example, the string gas cosmology scenario [19, 20] may be embedded in a bouncing\nuniverse as realized in [21]. Non-singular bounces may\nalso be studied using effective field theory techniques by\nintroducing matter fields violating certain energy conditions, for example non-conventional fluids [22, 23], quintom matter [24–28], or ghost condensates [16, 17, 29]. A\nspecific realization of a quintom bounce occurs in the LeeWick cosmology studied in [30]. Various original bounce\nmodels were reviewed in Ref. [31].\nIn the context of studies of bouncing cosmologies it\nhas been realized that fluctuations which are generated\nas quantum vacuum perturbations and exit the Hubble\nradius during a matter-dominated contracting phase lead\nto a scale-invariant spectrum of cosmological fluctuations\ntoday [32, 33] (see also [34] for an earlier discussion).\nThis yields an alternative to inflation for explaining the\ncurrent observational data, which is dubbed as the matter\nbounce (see e.g. [35] for a recent review). However, in\nthis scenario there are still unclear issues. For example,\nsince scalar and tensor modes grow at the same rate in\na matter-dominated phase of contraction, the tensor-toscalar ratio is typically too large to be consistent with\ncurrent observational data. Also, the possible generation\nof entropy during the non-singular bounce phase needs\n\n1\n\nSome versions are non-singular, see e.g. [15] in the case of the\nPre-Big-Bang scenario, or the \"New Ekpyrotic scenario\" [16, 17].\n\nto be studied in detail. In this paper, we will focus on\nthe first question, leaving the second for a followup paper\n[36].\nTo date, entropy fluctuations have not been considered\nin matter bounce models. However, realistic matter theories will contain many entropy modes. In the context of\ninflationary cosmology, it has been realized that entropy\nfluctuations can lead to an additional source of curvature\nfluctuations, a source which may in fact dominate [37–\n41]. This is now know as the \"curvaton mechanism\" for\ngenerating fluctuations. Entropy fluctuations also play\nan important role in the Ekpyrotic scenario [16, 17, 42–\n44]. In that scenario, the primordial adiabatic fluctuations in the contracting phase acquire a steep blue spectrum, whereas the entropy modes induced by light scalar\nfields will be scale-invariant.\nIn this paper, we will consider the fluctuations induced\nby a light spectator field χ and see that they acquire\na scale-invariant spectrum of fluctuations in a matterdominated phase of contraction if they originate in their\nvacuum state on sub-Hubble scales. We will show that\nthese entropy fluctuations induce a scale-invariant spectrum of curvature perturbations after the bounce. The\ntransfer of entropy to adiabatic perturbations occurs during the bounce phase. We can easily find parameter values for which these secondary curvature perturbations\nare larger in magnitude than the primordial ones. This\nwill lead to a suppression of the tensor to scalar ratio.\nAs a simple example, we consider a two-field model\nwith potential\nV (φ, χ) =\n\n1 2 2 1 2 2 2\nm φ + g φ χ ,\n2\n2\n\n(1)\n\nwhere in our model φ is the background scalar field in the\nnonsingular bounce cosmology, and χ is a second scalar\nmatter field, the so-called entropy field 2 .\n\n2\n\nThe non-singular bounce is induced by adding another matter\nfield violating the null energy condition to the system, or by\n\n\f2\nIn the context of a matter bounce background, we\nstudy the cosmological evolution for both background\nand perturbations. We study the specific model given\nby the potential (1). We find that the entropy field χ\nevolves as a tracking solution in the contracting phase\ndue to the coupling to the background scalar φ, and may\nbecome dominant during a short deflationary phase before the bounce. The fluctuations of the entropy field\nare nearly scale-invariant provided the coupling parameter g is small enough. A controllable amplification on\nthe entropy modes due to the kinetic term of the entropy\nfield can be obtained in the bouncing phase, and these\nentropy modes will be converted to curvature perturbations during the bounce. Therefore, we can obtain an\nenhancement of the primordial curvature spectrum and\nhence a suppression of the tensor-to-scalar ratio. This is\nthe main message of this work. Another interesting fact\nis that the conversion of entropy fluctuations to curvature perturbation provides a sizable non-Gaussianity for\ncurvature perturbations for which the sign tends to be\nnegative.\nThe paper is organized as follows. In section II we\nprovide the basic equations of the theory. In section III\nwe study the generation of isocurvature fluctuations in\nthe contracting phase. In section IV we analyze the conversion of the isocurvature perturbations into curvature\nfluctuations during the bounce and show that a reasonable amplitude of the primordial power spectrum can be\nobtained. Section V presents a summary and discussions\nof related works.\n√\nWe use the convention mpl = 1/ G in this paper.\n\nII.\n\nSETUP AND BASIC EQUATIONS\n\nTo be specific, we will be considering the background\nspace-time which emerges from a quintom bounce (see for\nexample [30]) scenario in which regular matter is modelled by a scalar field φ with mass m and the non-singular\nbounce is induced by adding a ghost scalar field ψg with\na much larger mass M to the system. Fig. 1 is a sketch of\nthe evolution of scales in our matter bounce model. The\nvertical axis represents conformal time, the horizontal\naxis comoving distance. Initially, both the regular matter\nfield and the ghost field are oscillating, with amplitudes\nwhich are increasing since the universe is contracting.\nDuring this period, the Hubble radius is decreasing lin-\n\nconsidering the matter Lagrangian containing the regular fields\nφ and χ in the presence of a gravitational action leading to a\nbounce. Note that in a successful bouncing cosmology the usual\nenergy conditions need to be recovered after the bounce so that\nthe universe is able to evolve smoothly into the radiation and\nmatter dominated periods. This feature exactly coincides with\nwhat occurs in the quintom dark energy model[45], in which the\ndark energy equation of state crosses the cosmological constant\nboundary.\n\nearly and Ḣ < 0. We assume that the energy density is\ndominated by the regular field φ. Once the amplitude of\nthe regular field φ reaches the value mpl , the field will\ncease to oscillate. This happens at conformal time τm .\nA short deflationary \"slow climb\" phase will begin during which the Hubble radius |H|−1 is nearly constant. In\nthis period the ghost field continues to oscillate. Hence,\nthe (negative) energy density of the ghost field catches\nup to the (positive) energy density of the field φ and a\nshort non-singular bounce period will result during which\nḢ > 0. The conformal time τd is the transition between\nthe deflationary phase and the bounce period. After the\nbouncing phase there is a short period of inflation lasting\nuntil τR , after which the universe enters the expanding\nphase with a normal thermal history. We denote the\nbounce time by τB .\nΤ\n\nτ\n\nτR\n|H|- 1\n\nτB\n\nXx\n\nτd\nτm\n\nλ= 1/k\nFIG. 1: A sketch of the evolution of scales in a nonsingular\nbouncing universe. The horizontal axis is comoving spatial\ncoordinate, the vertical axis is conformal time. Plotted are\nthe Hubble radius |H|−1 and the wavelength λ of a fluctuation\nwith comoving wavenumber k.\n\nIn Fig. 1 we plot the evolution of the length corresponding to a fixed comoving scale. This scale is the\nwavelength of the fluctuation mode k (k standing for the\ncomoving wavenumber) which we want to follow. The\nwavelength begins in the contracting phase inside the\nHubble radius, exits the Hubble radius during this phase\nand re-enters the Hubble radius during the normal expanding phase.\nIt is important that scales of interest exit the Hubble radius in the matter-dominated phase of contraction.\nThis is required to obtain a scale-invariant spectrum of\ncosmological perturbations. Important is also that there\nis a phase during which the energy density in the entropy\nfield grows relative to the energy density in the field φ.\nThis condition is easily satisfied in the quintom bounce\nscenario. It is required in order that the conversion of\nthe entropy fluctuations to curvature perturbations is ef-\n\n\f3\nficient 3 . The efficiency of our transfer mechanism will\ndepend on whether the initial energy density of the entropy field χ is larger than the (absolute value of) the\nenergy density in the ghost field ψg . We shall see that\nour mechanism is more efficient if χ dominates 4 .\nThe key goal of our paper is to understand how entropy\nperturbations are generated in the contracting phase,\nthen pass through the bounce, and finally convert into\ncurvature perturbations after the bounce. In the following, we will study cosmological perturbation theory in the\nnonsingular bouncing cosmological background described\nabove.\nWe shall work in longitudinal gauge in which the linearized scalar metric fluctuations appear in the metric in\nthe following way:\nds2 = (1 + 2Φ)dt2 − a2 (t)(1 − 2Ψ)d~x2 ,\n\n(2)\n\nwhere t is cosmic time and xi are the comoving spatial\ncoordinates. The scalar metric fluctuations are characterized by two functions Φ and Ψ which depend both on\nspace and time. We take matter to consist of a set of\nscalar fields φi . If the gravitational action is the usual\none, then in the absence of linearized anisotropic stress 5\nthe off-diagonal components of the perturbative Einstein\nequations imply Ψ = Φ (see [47] for a comprehensive discussion of the theory of cosmological perturbations). By\nexpanding the Einstein and matter equations to first order, we obtain the following perturbation equations [48–\n50]:\nδ φ̈i + 3Hδ φ̇i + [−\n\nX\n∇2\nV,ij δφj ]\nδφ\n+\ni\na2\nj\n\n= 4φ̇i Φ̇ − 2V,i Φ ,\n\n∇2\n− 3H 2 )Φ\na2 X\n[φ̇i δ φ̇i − φ̇2i Φ + V,i δφi ] ,\n= 4πG\n\n(3)\n\n−3H Φ̇ + (\n\n(4)\n\ni\n\nΦ̇ + HΦ = 4πG\n\nX\n\nφ̇i δφi ,\n\n(5)\n\ni\n\nwhere H = ȧ/a is the Hubble parameter, and V,i denotes\nthe derivative of the scalar field potential with respect to\nφi .\n\n3\n4\n\n5\n\nThis is similar to the requirement in inflationary cosmology for\nthe curvaton mechanism to be efficient.\nIt would be of great interest to study to what extent the conversion of entropy fluctuations to curvature perturbations is efficient\nin other bounce models such as the ghost condensate scenario of\n[29] which is (unlike the quintom bounce [46]) free of ghosts at\nthe perturbative level, and stable against the addition of radiation and anisotropic stress.\nThis will be the case if matter is described by a set of scalar\nfields.\n\nWe can recast the above equations in terms of the\nSasaki-Mukhanov variables [51, 52] which are defined as\nQi ≡ δφi +\n\nφ̇i\nΦ,\nH\n\n(6)\n\nand in terms of which the equations of motion are given\nby\nQ̈i + 3H Q̇i −\n\nX\n∇2\n8πG a3\n[V\n−\nQ\n+\n( φ̇i φ̇j ). ]Qj = 0 .\n,ij\ni\n3\na2\na\nH\nj\n\n(7)\nTo combine the above equations, we usually define the\nquantity ζ which is the curvature perturbation on the\nuniform density slice, and which is given by\nP\nφ̇i Qi\n(8)\nζ = H Pi 2 .\nj φ̇j\n\nThis quantity is conserved on super-Hubble scales in an\nexpanding universe if there are only adiabatic fluctuations. However, the presence of entropy fluctuations on\nlarge scales will lead to a growth of ζ which corresponds\nto the seeding of an adiabatic fluctuation mode by the\nentropy mode.\nAt linear order, the general equation for the time\nderivative of ζ is (see Appendix)\nζ̇ = −\n\nX Qi φ̇2\nH 2\n( i ). .\n∇ Φ − 4πGH\nḢ\nφ̇\ni Ḣ\ni\n\n(9)\n\nOn large scales, the first term of the r.h.s of Eq. (9) is\nnegligible. In a two field model, this equation reduces to\nthe following expression for the time derivative of ζ on\nlarge scales:\nQχ d φ̇2 − χ̇2\nφ̇2 + χ̇2 Qφ\n−\n) , (10)\n[\n] (\n(1 + w)ζ ̇ = 4πG\n3H\nχ̇ dt φ̇2 + χ̇2\nφ̇\nwhere w = p/ρ is the equation of state, with p and ρ being\npressure and energy density respectively. Note, however,\nthat in our case we have three fields, the regular matter\nfield φ, the isocurvature field χ and the ghost matter\nfield ψg which is responsible for yielding the non-singular\nbounce.\nIn the following we will study how in our non-singular\nbouncing cosmology the presence of primordial isocurvature fluctuations induces via (9) a contribution to the\ncurvature perturbations. We will consider two cases: the\nfirst where the isocurvature field χ initially contributes\nmore to the density than the ghost field, the second case\nwhere χ is sub-dominant at the background level to the\nghost field.\nIII.\n\nISOCURVATURE PERTURBATIONS IN\nTHE CONTRACTING PHASE\n\nIn this section we show that the isocurvature mode acquires a scale-invariant spectrum of fluctuations on scales\n\n\f4\nwhich exit the Hubble radius in the matter-dominated\nphase of contraction, provided the initial conditions are\ntaken to be vacuum. We will consider the model of (1),\nwhere the entropy mode corresponds to the scalar field χ\nwhich is taken to be massless. Note that since the ghost\nfield ψg has a large mass, its spectrum will not be scaleinvariant. It will be highly suppressed in the infrared.\nHence, ψg cannot play the role of the entropy field for\nour purpose.\nWe consider a matter bounce background evolution of\na FRW universe in which the matter-dominated phase\nof contraction is realized by the oscillations of a massive scalar field φ around it vacuum state (see Refs.\n[32, 33, 53, 54] for other realizations). Hence, the Hubble\nparameter can be approximately expressed by\nhH(t)i =\n\n2\n,\n3t\n\n(11)\n\nwhere the angular brackets stand for averaging over time.\nThe solution for the scalar field φ can be asymptotically\nexpressed as\nφ(t) ≃ φ̃(t) sin mt ,\n\nacquire a scale-invariant spectrum in the matter bounce\nscenario is based on assuming that the canonically normalized curvature fluctuation variable starts out in its\nvacuum state early in the contracting phase. It is hence\nreasonable to assume that also the fluctuations of χ start\nout in their vacuum state on scales smaller than the\nHubble radius early in the contracting phase. We focus on scale which exit the Hubble radius in the matterdominated phase of contraction and will show that due\nto the growth of fluctuations on super-Hubble scales a\nflat spectrum of isocurvature perturbations results 6 .\nWe are interested in the scalar perturbation δχ, where\nwe write\nχ(t, ~x) = χ(t) + δχ(t, ~x) .\n\nIt is important to focus on the canonically normalized\nperturbation variable v = aδχ in terms of which quantum vacuum initial conditions can be imposed. We work\non the spatially-flat slice where the metric fluctuation\nΦ vanishes. On this slice, the scalar field perturbations\nsatisfy the Klein-Gordon equation[61]\n\n(12)\n\nvk′′ + (k 2 + a2 m2χ −\n\nwith a time dependent amplitude,\nmpl\n,\nφ̃(t) ≡ √\n3πm|t|\n\n(13)\n\nwhich yields an equation of state which has vanishing\npressure after averaging over an oscillation period of the\nfield.\nSince the entropy field χ is much lighter than the background scalar φ and we assume that it does not have a\nlarge initial homogeneous mode, it has nothing to do with\nthe background evolution before the bounce phase. Its\nevolution is determined by the equation of motion\n1\nχ̈ + 3H χ̇ + g 2 φ̃2 χ ≃ 0 ,\n2\n\n(14)\n\nwhere we have averaged the coherent oscillations of the\nbackground scalar in the mass term and inserted a factor\n1/2 instead (parametric resonance instabilities resulting\nas a consequence of the oscillatory nature of φ [55–58] see [59] for a recent review - will be studied in a subsequent paper). This equation yields the following solution\nfor χ:\nχ(t) ∝ t\n\n−1+\n\ng 2 m2\npl\n3πm2\n\n,\n\n(15)\n\nwhich evolves at the same rate as the amplitude of the\nbackground scalar if gmpl ≪ m. In this case it is convenient to define a parameter d1 ≡ χφii (where the subscripts\n\"i\" indicate the initial value of the corresponding fields),\nand then in the matter-dominated contracting phase we\nhave χ ≃ d1 φ.\nLet us now turn to the fluctuations of χ. Let us recall [32, 33] that the finding that curvature fluctuations\n\n(16)\n\na′′\n)vk = 0 ,\na\n\n(17)\n\nwhere we have defined the effective mass term of the entropy field m2χ = V,χχ and made use of the conformal\ntime dη = adt. A prime indicates a derivative with respect to η. Comparing the above equation of motion with\nthe basic perturbation equation (7), one may notice that\nthe effective mass originating from the kinetic term of χ\nand the coupling between the isocurvaure and adiabatic\nperturbations has been neglected. This is justified since\nit is subdominant in the matter-dominated contracting\nphase.\nInitially, the k 2 term dominates Eq. (17), and so we\ncan neglect the mass term and gravitational term. Thus,\nthe dynamics corresponds to a free scalar propagating in\na flat spacetime, and the initial condition takes the form\nof the Bunch-Davies vacuum:\ne−ikτ\nvk ≃ √\n.\n2k\n\n(18)\n\nDuring the phase of background contraction, the quantum fluctuations exit the Hubble radius and become classical perturbations (see [62, 63] for an analysis of the\nclassicalization). For a ∝ τ 2 and |m2χ | ≪ H 2 , Eq. (17)\nbecomes\nvk′′ + (k 2 −\n\n6\n\n2\n)vk ≃ 0 .\nτ2\n\n(19)\n\nAs discussed in [60], the spectrum has a break at the scale which\nexits the Hubble radius at the time of the transition between the\nmatter-dominated phase of contraction and the following phase\n(most likely a radiation-dominated phase). On smaller scales the\nspectrum will be blue.\n\n\f5\nThe second term inside the parentheses on the left hand\nside of this equation is the term which leads to the squeezing of the fluctuations, and the coefficient and time dependence is exactly that required to transform a blue vacuum spectrum into a scale-invariant spectrum [32, 33].\nWe can see this explicitly as follows: Making use of the\nvacuum initial condition, we obtain an exact solution to\n(19):\ne−ikτ\ni\n).\nvk = √ (1 −\nkτ\n2k\n\n(20)\n\nNote that, in contracting phase these perturbations are\nable to grow outside the Hubble radius. Their amplitudes will keep increasing until the universe enters the\ncontracting phase ends. Thus, from (20) it follows that\non scales larger than the Hubble radius, the amplitude of\nthe spectrum of δχ in the contracting phase is given by\n1\n\nδχ(t) = Pχ2 (t) =\n\n|H(t)|\n,\n4π\n\n(21)\n\nobservations on the value of r, it is necessary that there\nbe a mechanism to amplify the size of the scalar metric perturbations. In the following we will show that the\nentropy mode studied in this paper can provide an efficient mechanism to enhance the spectrum of curvature\nfluctuations.\nThe basic idea is as follows: We expect that the entropy field will rapidly grow during the final instances of\nthe contracting phase. In this case, isocurvature perturbations can be converted into curvature perturbations as\ndescribed by (10) 7 . After the bounce, the evolution of\nthe universe will enter the normal thermal history. In\ncontrast to the bounce scenario without entropy modes,\nin the current model the energy scale for the bounce is\nable to be lowered and so the amplitude of tensor spectrum can be suppressed. Therefore, our model can solve\nthe problem of large tensor-to-scalar ratio which generally exists in nonsingular bounce cosmologies [30, 61].\nMoreover, if the energy scale can be lowered to the TeV\nlevel, our scenario may lead to a window to test a bounce\nin particle physics.\n\nwhich is a function of cosmic time. From Eq. (17), we\nare able to calculate the spectral tilt nχ of the primordial\nperturbations\nnχ ≡\n\n2m2χ\nd ln Pχ\n,\n=\nd ln k\n3H 2\n\n(22)\n\nwhere mχ is the effective mass of the χ field induced by\nthe coupling to φ. In the specific model given by (1), we\napply the amplitude of the background scalar φ̃ and the\nratio d, and then obtain the spectral tilt\nnχ ≃\n\ng 2 m2pl\n.\n2πm2\n\n(23)\n\nFrom this result, we find that in order to ensure that the\nisocurvature perturbation\n√ are nearly scale-invariant, one\nhas to require |gmpl | ≪ 2πm.\nOne can also estimate the amplitude of tensor perturbations h. It is well known that the tensor fluctuation\namplitude satisfies the same equation of motion as a free\nscalar field in the given cosmological background. Hence,\nfollowing the analysis done above for the fluctuations in\nthe scalar field χ, we obtain a scale-invariant spectrum\nof tensor modes (again assuming that they start out in\ntheir vacuum state), and an amplitude of the spectrum\ngiven by\nh ∼ H/mpl .\n\nIV. EVOLUTION OF ISOCURVATURE\nPERTURBATIONS THROUGH THE BOUNCE\n\nAs the universe contracts in the matter-dominated\nphase, the Hubble parameter increases. When it catches\nup to the mass m of the background field φ, the oscillations of this field will freeze out. After freeze-out, φ will\nslowly climb up the potential. As long as the total energy density is dominated by φ, the equation of state will\ndecrease from w = 0 to w ≃ −1. Therefore, the universe\nwill enter a contracting deflationary period and then approach the bouncing point. During this phase, both the\nisocurvature field χ and the ghost field ψg will increase\nexponentially in amplitude. Thus, after a brief deflationary phase either χ or ψg will come to dominate. If the\nenergy density of ψg is larger, then the bounce point is\nreached when the energy densities of φ and ψg become\nequal. We will denote this case as \"Case 2\". In the\nother case (\"Case 1\") there will be another brief phase of\ncontraction driven by χ, followed by another brief deflationary phase and a bounce when ρχ = |ρψg |. Note that\nthe deflationary phases can be understood as the time\nreversal of a period of slow-roll inflation.\n\n(24)\n\nThe tensor perturbation amplitude has the same order\nof magnitude as that of the adiabatic scalar metric perturbations. Thus (in terms of the usual ratio r ≡ PT /Pζ\nof the tensor to scalar metric power spectrum), the matter bounce usually leads to a dangerously large value of\nr. From current observational CMB data [64], this ratio\nis required to be less than 0.2. Consequently, in order\nthat a matter bounce scenario be consistent with current\n\nA.\n\nDeflationary period\n\nWe first study the evolution of the entropy scalar χ\nin the deflationary period. From studies of chaotic type\n\n7\n\nAs we discuss in our companion paper [36], they can also be\nparametrically amplified when they pass through the bouncing\nphase.\n\n\f6\ninflation models, it is well known that the background\nfield φ freezes out when its amplitude φ̃ becomes of the\norder of the Planck mass, more specifically when\n2mpl\n.\nφ̃ ≡ φ̃m = √\n3π 3\n\n(25)\n\nThis leads to a nearly constant Hubble parameter\nHm = −\n\n4m\n3π\n\n(26)\n\nand an almost exponentially decreasing scale factor for\nthe universe. In this period, the scalars χ and ψg will\ngrow exponentially and the density in one of them will\nsoon catch up to the density of background field. The\nbackground equation of motion (14) yields\n\u0015\n\u0014\n4m\n(t − tm ) ,\n(27)\nχ ≃ χm exp\nπ\nwhich evolves proportional to a−3 . Here, the time tm is\nthe end of the matter-dominated epoch of contraction,\nand the subscripts \"m\" on the fields φ and χ indicate the\nvalues of those field at the time tm .\nWe will write\nχm ≡ d1 φm\n(ψg )m ≡ d2 φm ,\n\n(28)\n\ntd − tm ≃\n\nπ\nπ\nln\n4m 4d1\n\n(29)\n\ntd − tm ≃\n\nπ\nm\nln\n2m d2 M\n\n(30)\n\nin Case 1 and\n\nin Case 2. The difference between the two cases is due to\nthe fact that ψg is oscillating in the deflationary phase,\nbut χ is not. Hence, the expressions for the energy density of the two fields take a different form.\nLet us now turn to the evolution of the entropy fluctuations which is given by Eq. (17). In a de Sitter phase\nof contraction the dominant solution is\nvk ∼ a−2\n\n(31)\n\nδχk ∼ a−3 .\n\n(32)\n\nwhich corresponds to\n\nHence, it follows that the power spectrum of δχ gets enhanced during the deflationary phase by a factor\nπ 2\n)\n4d1\n\nC = (\n\n(33)\n\nm 4\n)\nd2 M\n\n(34)\n\nin Case 2.\nNote, however, that this amplification does not lead to\na suppression of the tensor to scalar ratio since the tensor modes at the same rate during the deflationary phase.\nIt is only due to matter couplings that a difference between scalar and tensor modes will result. Below, we will\nsee that such an amplification mechanism affecting only\nthe scalar modes results in the post-deflationary phase,\na phase driven by the kinetics of the fields.\nWe do need to worry about the absolute magnitude of\nthe fluctuations. There is the danger that the amplification in the deflationary phase cause the perturbations\nbecome nonlinear. Then, we would lose perturbative control of the analysis. Presumably, this would also imply\nthat space fragments into a gas of black holes rather than\nundergoing a smooth bounce. However, from (33) and\nfrom the fact that the fluctuations start out as quantum\nvacuum perturbations, it appears that this constraint on\nthe parameters is a fairly mild one.\nB.\n\nwhere the values of the coefficients d1 and d2 (both much\nsmaller than 1) depend on the initial conditions. We will\ndenote the larger of the two numbers d1 and d2 by d.\nThe deflationary phase will end when the energy of one\nof the fields χ and ψg catches up to that in φ. This will\noccur at the moment td given by\n\nC = (\n\nin Case 1 and\n\nPassing through the bouncing phase\n\nIn this subsection we will give a rough analysis of how\nthe fluctuations in χ pass through the bouncing phase.\nWe will discover that the coupling between the matter\nfields due to the kinetic terms results in a growth of the\nentropy fluctuations without corresponding growth of the\ntensor modes. We call this process kinetic amplification.\nAfter the period of deflation, the scalar χ continues to\nroll fast, and may even dominate over the background\nscalar φ (in Case 1 - see the beginning of this section\nfor the definition of what the Cases are). In this case,\nthe universe evolves with a background equation of state\nwhich varies from w ≃ −1 during deflation to w ≃ 1\nduring χ domination. In this case, the dominant term in\nthe background Friedmann equation is the kinetic term\nof the scalar χ, and leads to a nearly conserved quantity\nχ̇/H ≃ χ̇d /Hd ≃ χ̇d /Hm ,\n\n(35)\n\nduring this short period. In addition, from Eq. (27) we\nsee that\n4m\n4m\nχ̇d =\nφ̃m .\n(36)\nχd ≃\nπ\nπ\nAs discussed earlier, eventually the energy density in\nthe ghost field ψg catches up and the bounce phase will\nbe triggered. Thus, the universe will exit the contraction\nphase and the equation of state of the universe will cross\n−1 and fall to negative infinity. In order to study the\nevolution of perturbations through the bouncing phase\nanalytically, it is convenient to model the evolution of\nthe Hubble parameter in the following form:\nH = αt ,\n\n(37)\n\n\f7\nwith some positive coefficient α which has dimensions of\nk 2 and whose magnitude is set by the microphysics of the\nbounce. For example, α ≃ m2 in the model of Lee-Wick\nCosmology[30], while in Loop Quantum Cosmology α is\ndetermined by a regularized Planck mass[65, 66]. Note\nthat in the above parametrization we have chosen the\ntime of the bounce to be zero.\nTo study the perturbation of the χ field, it is necessary\nto go back to the complete form of the perturbation equations given by (7). We will focus on the evolution of Qχ .\nFrom (7) we see that there is a mixing with Qφ . However,\nsince the frequency of δφ is dominated by its mass m, δφ\nkeeps oscillating even outside the Hubble radius. Hence,\nits amplitude is much smaller than that of δχ and therefore we neglect its contribution in the equation of motion\nfor δχ. Thus, Qχ effectively decouples from Qφ . Focusing now on the mass term in the equation of motion for\nQχ , we notice that since χ evolves as a stiff fluid with an\neffective equation of state w = 1, the contribution of its\nkinetic term in the perturbation equation must be taken\ninto account. This contribution is given by the following\nterm:\n\u0012 3 2 \u0013.\n8π\na χ̇\n72π φ̃2m\n− 3 2\n≃ −\n(α + 3α2 t2 ) , (38)\na mpl\nH\nm2pl\nwhere we have used the relations (35), (36) and (37).\nConsequently, we obtain the following equation of motion for the Fourier modes of the gauge invariant perturbation variable Qχ ,\nk2\nQ̈χ + 3H Q̇χ + 2 Qχ + m2χ,eff Qχ ≃ 0 .\na\n\n=\n\n(39)\n\n72παφ̃2m\n(1 + 3αt2 )\nm2pl\n\n4g 2 m2pl\n96α\n− 2 (1 + 3αt2 ) .\n3\n3π\nπ\n\n(40)\n\nThus, we find that in the bouncing phase the contribution\nof the kinetic term to the perturbations of the χ field\nyields a tachyonic mass term. This results in an increase\nin the magnitude of the fluctuations, a process which we\ncall kinetic amplification. Note that this amplification\ndoes not affect the tensor modes.\nIn analogy with the theory of preheating (see e.g. [59]\nfor a recent review), we suggest that the investigation of\nthe perturbation Qχ can be simplified by redefining the\nfluctuation variable\nδXk ≡ a3/2 Qχ k .\n\n(41)\n\nThen, we obtain a simpler form of the equation of motion\nfor the fluctuations. Instead of Eq. (39) we now have\nδ Ẍk + ωk2 δXk = 0 ,\n\nωk2 ≡\n\nk2\n3\n3\n+ m2χ,eff + H 2 − Ḣ ,\na2\n4\n2\n\n(42)\n\n(43)\n\nis the frequency for the k'th mode of the isocurvature\nperturbations.\nConsequently, if\nα ≫ g 2 m2pl ,\n\n(44)\n\nthere exists a period −tb < t < tb with\ntb ≃ |Hm |/α = 4m/3απ\n\n(45)\n\nnear the bounce point during which the adiabaticity condition is violated and the dispersion relation of the χ perturbation is unstable in the infrared limit. In this case\nthe evolution of the χ perturbation can be approximately\nexpressed as [67]\nZ\nδX ∝ exp[| dtω(t)|]\n(46)\nin which the integral runs from −tb to tb if α ≫ g 2 m2pl .\nAs a consequence, we find that the amplitude of the\nentropy fluctuations obtains a tachyonic amplification\naround the bounce point. Since this instability arises\nfrom the kinetic term of the entropy field, we call this\nprocess kinetic amplification. One can describe the amplification of the infrared modes of isocurvature perturbations in this resonance stage as follows:\nδχb = F δχd ,\n\nIn the bouncing phase the effective mass term is given by\nm2χ,eff = g 2 φ̃2m −\n\nwhere\n\nwith an amplification factor\nZ tb\nF = exp[|\ndtw(t)|]\n−tb\n√\n√\n2 y\ny(2+y)+ √32 sinh−1 ( 3 )\n≃ e\n.\n\n(47)\n\n(48)\n\nIn the above calculation, we have introduced a variable\n2\ny = mα which characterizes how fast the bouncing phase\noccurs.\nTo understand the exponent appearing in the amplification factor F , we plot its evolution as a function of\nthe variable y in Fig. 2. One can see that in the limit\nof a fast bounce y → 0 (which corresponds to α ≫ m2 )\nthe contribution of kinetic amplification is quite limited\nsince the duration of the bouncing phase is very short.\nIn the case of the Lee-Wick cosmology α ≃ m2 and thus\ngives y ≃ 1, and correspondingly we obtain a value of the\namplification factor F ≃ 21.3 which is quite sizable.\nOne interesting issue which should be noticed that, if\nwe choose the value of the coefficient α to be between\ng 2 m2pl and m2 , the amplitude of the isocurvature perturbation will be distinctly amplified. This case corresponds\nto a slow bouncing phase. This amplification becomes\nmore efficient if we take the coupling parameter g 2 to be\nslightly negative which provides a flat tachyonic potential\nfor the entropy field.\n\n\f8\nA.\n\nWe first study the linear curvature fluctuations induced\nby the isocurvature fluctuation. To do this, we return to\nthe general formula (9) which describes the transfer of\nisocurvature to curvature fluctuations. Making use of\nthe fact that\n\n20\n\n15\n\nln\n\n10\n\nḢ = −\n\n5\n\n0\n\n4π X  ̇2\nφ ,\nm2pl i i\n\n(50)\n\nand inserting the definition of Qi we find that on large\nscales (9) reduces to\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\n12\n\n14\n\n16\n\nζ̇ = −4πm−2\npl\n\ny\n\nFIG. 2: Plot of the exponent in the amplification factor ln F\nas a function of the variable y in the bouncing phase. The\n2\npermitted range of y runs from 0 to g2mm2 , and we specifically\npl\n\nchoose g 2 m2pl = m2 /16.\n\nC.\n\nLinear fluctuations\n\nThe χ power spectrum in the expanding phase\n\nAfter the bounce, the universe will eventually reemerge into a matter-dominated phase, this time a phase\nof cosmological expansion. Since the dominant mode\nof both scalar and tensor fluctuations on super-Hubble\nscales is constant, no further amplification of the entropy\nfluctuations results, nor do scalar and tensor perturbations evolve asymmetrically.\nNow let us take into account both of the amplification\neffects on the χ fluctuations discussed in the two previous\nsubsections. Combining the relations (33) and (47) and\napplying the relation (21) at the beginning of the period\nof deflation at the time tm , we eventually obtain the following amplitude of the isocurvature perturbations after\nthe bounce\nδχf ≃\n\nm 1\nC2F ,\n3π 2\n\n(49)\n\non super-Hubble scales.\n\nV.\n\nGENERATION OF METRIC\nPERTURBATIONS\n\nIn the above section we have studied the dynamics of\nisocurvature perturbations in a particular implementation of the matter bounce scenario. Next, we will study\nthe induced curvature fluctuations, the \"matter bounce\ncurvaton\" mechanism. The transfer takes place in the\ndeflationary phase and in the bouncing phase when the\nequation of state of the background is changing because\nof the contribution of the entropy field.\n\nX Hδφi φ̇2\n( i ). .\nφ̇i Ḣ\ni\n\n(51)\n\nSince the spectrum of the ghost field ψg has a blue\nspectrum due to the large mass of the ghost, the ghost\nfield contribution to (51) can be neglected, and only two\nterms remain in the sum, the one due to φ and the one\ndue to the entropy field. Since in our realization of the\nbounce scenario the regular matter field φ is massive, its\ncontribution to (51) is also negligible. A second way to\nsee that the term proportional to δφ gives a negligible\ncontribution to (51) is to realize that until the entropy\nfield χ begins to dominate the background, the factor\nφ̇2 /Ḣ is approximately constant and thus the coefficient\nof the δφ term vanishes. Thus, (51) can be approximated\nby\nζ̇ ≃ −4πm−2\npl\n\nHδχ χ̇2 .\n( ) .\nχ̇ Ḣ\n\n(52)\n\nThe right hand side of this expression vanishes at the\nbeginning of the deflationary phase and gradually grows\nuntil the bounce phase is reached. We can approximately\nintegrate the equation to obtain\n∆ζ ≃ −4πm−2\npl\n\nH\nχ̇δχ .\nḢ\n\n(53)\n\nLet us first evaluate the magnitude of the induced curvature fluctuations in Case 1, when ρχ > |ρψg |. In this\ncase the contribution of the ghost condensate field to Ḣ\nat the time when the deflationary period ends can be\nneglected and\n\u0001\n2\n2\nḢ ≃ −4πm−2\n.\n(54)\npl φ̇ + χ̇\nWhen the χ field starts to dominate the energy density,\nthe magnitudes of χ̇ and φ̇ are comparable, and hence\n∆ζ ≃\n\nH\nδχ .\nχ̇\n\n(55)\n\nMaking use of the background solution for the scalar χ\nand the amplification of the amplitude of the isocurvature perturbation δχf before and during the bounce, we\n\n\f9\nfinally obtain the following estimate for the induced curvature perturbation\n∆ζ ≃\n\n1\nm\n√\nC2F ,\n6 3πmpl\n\n(56)\n\nwhere we have used relation (35) which is approximately\nvalid during the deflationary and bounce periods.\nNext, let us turn to Case 2. Now, Ḣ is dominated by\nψ̇g instead of by χ̇ in the bounce region. The numerator in (53) remains the same as for Case 1. Hence, the\noverall amplitude of the induced curvature fluctuations\nis suppressed by a factor S, where\nS = (\n\nχ̇ 2\n) ,\nψ̇g\n\n(57)\n\ncompared to what happens in Case 1.\nThe tensor modes are also amplified during the deflationary phase, as mentioned earlier. Thus, they also\nobtain the amplification factor C. Their overall amplitude is hence the same as that of the induced curvature\nfluctuations, except for the factor F due to kinetic amplification. Hence, the predicted tensor to scalar ratio r\nin Case 1 is\nr ≃ F −2 .\n\nm ≃ 9.02 × 10\n\nF\n\n−1\n\nmpl .\n\n(59)\n\nFor completeness, let us mention (as was already used\nabove in (58)) that in our model the amplitude of tensor\nperturbation is about h ∼ H/mp . Specifically, following\nthe calculations in Ref. [30], one obtains the following\nprimordial power spectrum for the tensor perturbations\nat the end of the matter dominated phase of contraction\nPT (k) ≡\n\nWe first numerically study the evolution of two scalars.\nAs demonstrated in Fig. 3, in the era of contraction, the\nheavy field φ keeps oscillating with an increasing amplitude and dominates the background evolution, while the\nlight field χ tracks the evolution of φ. When the amplitude of φ grows up to of Planck mass, χ rolls rapidly\nand finally catch up to φ near by the bounce. This numerical result is consistent with the analytic estimates\nappeared in Eqs. (15), (27). However, in our numerical\ncalculations the background evolution ceases around the\nmoment of χ domination which is before the big bounce.\nSince in the current paper we wish to discuss the dynamics of isocurvature perturbations in a general case,\nwe did not concentrate on a detailed mechanism leading\nto a bouncing phase but take a parametrization of the\nHubble parameter H = αt instead.\n\n(58)\n\nIts magnitude is determined by two parameters, namely\nthe mass of the heavy field m and the slope of the bouncing phase α.\nAccording to the latest observations from the Wilkinson Microwave Anisotropy Probe 7-year data (WMAP7)\n[64], the amplitude of curvature perturbation is ζ ≃\n4.92 × 10−5 and the spectral tilt is |nχ | . 0.03. Thus,\nthe observed amplitude of the curvature perturbations\ncan be obtained in our scenario if we require\n−4\n\nOur analytical calculations involve some approximations. Specifically, in the deflationary phase the Hubble\nparameter is not exactly a constant and the background\nscalar φ is still rolling slowly, but in our analytical analysis we have taken their values at the freeze-out time. As\na consequence, it is important to confirm the results by\na numerical integration of the full equations.\n\n32k 3\n16H 2\n|hk |2 =\n,\n2\nπmpl\n9πm2pl\n\n(60)\n\nDuring the deflationary phase, there is an enhancement\nby a factor of C. The tensor-to-scalar ratio is given by\nr ≃ 35F −2 .\n\n(61)\n\nThis ratio can be greatly suppressed by a large value of\nthe factor F . In the specific model of Lee-Wick cosmology, α ≃ m2 so that r ≃ 0.08. With the WMAP7 data\ncombined with BAO and SN, the current limit on the\ntensor-to-scalar ratio is given by r < 0.2.\n\n0\n\n10\n\n-1\n\n10\n\n-2\n\n10\n\n-3\n\n10\n\n-4\n\n10\n\n-5\n\n10\n\n-6\n\n10\n\n6\n\n-6x10\n\n6\n\n-5x10\n\n6\n\n-4x10\n\n6\n\n-3x10\n\n6\n\n-2x10\n\n6\n\n-1x10\n\n0\n\nt\n\nFIG. 3: Evolution of the background fields φ and χ before\nthe bounce as a function of cosmic time (horizontal axis).\nThe background fields are plotted in dimensionless units by\nnormalizing by mpl . Similarly, the time axis is displayed in\nunits of m−1\npl . The parameters m and g appearing in the\npotential were chosen to be m = 10−5 mpl , g = 2.5 × 10−6 ,\nand we assume initially d = 10−4 . The initial conditions for φ\nwere taken to be φi = 1.19×10−5 mpl , φ̇i = −1.24×10−9 mpl 2 .\n\nBased on the background solution obtained above, we\nthen solve the equations of motion (7) numerically. We\nshow the evolution of the gauge-invariant scalar perturbation variables Qφ and Qχ in Fig. 4. In the numerical calculations, we consider these perturbation modes\nto originate from vacuum fluctuations inside the Hubble\n\n\f10\nradius 8 . One can see from Fig. 4 that the perturbation\nof the heavy field (the adiabatic mode after the bounce)\ncatches up to the amplitude of the entropy field perturbation. This demonstrates the effectiveness of the \"matter\nbounce curvaton\" mechanism discussed here. Note that\nQφ keeps oscillating through the whole evolution. The\namplitude of the fluctuation Qχ grows before the bounce,\nhowever, with a different slope than the growth of Qφ .\nThis difference in slope is due to the transfer of isocurvature to curvature fluctuation. Overall, the numerical\nresults are consistent with the analytic calculations.\n\n-1\n\n10\n\n-2\n\n10\n\nln Q\n\n-3\n\n10\n\nln Q\n\n-4\n\n10\n\n-5\n\n10\n\n-6\n\n10\n\n-7\n\n10\n\n-8\n\n10\n\n-9\n\n10\n\ndue to the fact that what corresponds to the inflationary slow-roll parameter is now a constant of order one.\nA distinctive feature of this source of non-linearity is a\nparticular shape of the bispectrum. The shape is different than the one which appears in simple inflationary\nmodels since in the contracting phase ζ is not constant\nand hence terms depending on ζ̇ which vanish in inflationary cosmology contribute in an important way to the\nbispectrum.\nThe second effect is a contribution to the bispectrum of\nlocal form which results from the curvaton mechanism. It\nis due to the transformation of entropy perturbations into\ncurvature fluctuations which happens around the bounce\npoint. Here, we focus on the second effect.\nA naive way to investigate the non-Gaussianity is to\nstudy the cosmological fluctuations to second order[76]\n9\n. Recalling the time evolution of the curvature perturbation given in Eq. (10) and taking the next-to-leading\norder corrections into account, we are able to decompose\nthe curvature perturbation into a Gaussian part and a\nnon-linear one, where the second part evolves according\nto the following equation[83–86]:\nH\nH\n(V,ss + 4θ̇2 )δs2 − 3 V,σ δsδ̇s ,\n(62)\nσ̇ 2\nσ̇\non long wavelengths. In the above\nR formula,1 we have introduced the adabatic field σ = (φ̇2 + χ̇2 ) 2 dt, the isocurvature field s = (φ̇χ − χ̇φ)/σ, and the trajectory angle θ\nsatisfying cos θ = φ̇/σ̇ and sin θ = χ̇/σ̇.\nAs usual, we define a nonlinearity parameter fN L to\nmeasure the amplitude of non-Gaussian perturbations.\nThis parameter is defined by the relation\nζ̇N L =\n\n-10\n\n10\n\n-11\n\n10\n\n6\n\n-6.0x10\n\n6\n\n-4.0x10\n\n6\n\n-2.0x10\n\n0.0\n\n6\n\n2.0x10\n\nt\n\nFIG. 4: Evolution of the gauge-invariant scalar perturbations\nQφ and Qχ for super-Hubble mode k = 2×10−6 in our model.\nThe horizontal axis is cosmic time. The scalar perturbations\nare plotted in dimensionless units by normalizing by mpl . In\nthe parametrization function α = 10−6 m2pl is chosen. The\nbackground parameters are the same as in Fig. 3.\n\nB.\n\nLocal non-Gaussian fluctuations\n\nNext we take a first look at an important byproduct of\nthe \"matter bounce curvaton\" scenario, namely a contribution to the induced non-Gaussian distribution of metric fluctuations which will be of local form.\nThere are two important periods for generating a large\nnon-Gaussianity in a bouncing universe. The first is the\nevolution of metric perturbations on super-Hubble scales\nin the contracting phase which at leading non-linear order\ngenerates non-Gaussianities as studied in Refs. [74, 75].\nThis generates an effective value of the non-linearity parameter fnl which is of order one, the largeness being\n\n3\nζ = ζL + fN L ζL2 ,\n(63)\n5\nwhere ζL is the linear order value of curvature perturbation. As analyzed in the previous section, we consider\nthe leading non-Gaussianity when modes are at superHubble scales, and thus the non-Gaussianity is of the\nlocal type[77, 87].\nWe follow the time evolution of the curvature perturbations and use the solution (21), and then obtain the\nnon-linear part of the curvature perturbation,\n\u0014\n\u0015\nZ f\n4m2 φ2\nm2 φ̇2 2\n2\n)δχ − φφ̇δχδ χ̇ dt\nζN L ≃\nH 6 χ̇ (1 +\nσ̇\nσ̇ 2\nm\n32m\n8d2 Cmpl\n≃\n(1 −\n)δχ2f ,\n(64)\n3\nπmpl\nπ2 m\nwhere the main contribution is provided by the integral\nfrom tm to td during which the scalar χ comes to dominate. Moreover, combined with the linear form of the\n\n9\n8\n\nNumerical analyses of inflationary preheating were performed\nwith a massive scalar [68–70] and a massless scalar [71, 72] (see\nalso [73]) respectively.\n\nThe issue of inflationary non-Gaussianities has been studied in\ndetail e.g. in Refs. [77, 78] and comprehensively reviewed by\n[79]. Moreover, the non-Gaussian fluctuations during inflationary preheating have been analyzed in [67]; see also [80–82].\n\n\f11\ncurvature perturbation (56), we obtain the leading term\nof the nonlinearity parameter\nfN L ≃ −\n\n5120 2\nd C.\nπ6\n\n(65)\n\nAs discussed in the previous sections, there are two\ncases for the choice of d and C parameters depending on\nhow the scalar field χ becomes dominant. For Case 1, we\nget\nfN L ≃ −3.3 ,\n\n(66)\n\nby making use of C = (π/4d)2 ; for Case 2, we obtain\nfN L ≃ −5.3\n\nm4\nd2 M 4\n\n.\n\n(67)\n\nIn both two cases, we see that it is possible to generate\na sizable non-Gaussianity in our model by this mechanism. Specifically, a large non-Gaussianity of local type\ncan be obtained for a small value of d in Case 2. For\nexample, taking the value of the parameters to be such\nthat M = 100m which satisfies the theoretical bound\ndiscussed at the end of the Appendix, we find that with\nm\none gets fN L ≃ −5.3, a value which is cond = 10−2 M\nsistent with current observational constraints which give\n−36 < fN L < 100 at the 2σ level, but a value which is\nnot too small to be detectable in upcoming experiments.\nAlthough the mechanism discussed above is quite efficient to generate a sizable non-Gaussianity, there are\nother sources which could potentially also give a large\nvalue of fN L . For example, we expect that preheating\neffects will lead to a major contribution. In particular,\nthey will affect the shape of the non-Gaussianities, a topic\nwe did not study here. We will leave the detailed study\nof this issue to a future publication.\n\nbounce, a scenario in which the violation of the null energy condition which is required to obtain a non-singular\nbounce is obtained via the addition of a ghost field. However, the mechanism will also be effective in other realizations of the matter bounce.\nAs we have shown here, just before and during the\nbounce, the entropy fluctuations are amplified by an effective tachyonic mass due to a kinetic resonance. We\nhave called this process \"kinetic amplification\". Whereas\nthe scalar modes are amplified by this mechanism, the\ngravitational waves are not. Thus, our scenario leads to\na suppression of the tensor to scalar ratio r. The kinetic\namplification mechanism is more effective if the bounce\nis slower, since then the time interval during which the\nentropy fluctuations see an effective tachyonic mass is\nlonger. The kinetic amplification mechanism is also more\neffective if the energy density in the entropy field initially\ndominates over the absolute value of the energy density\nin the ghost field.\nWe also have taken a first look at non-Gaussianities\nfrom our mechanism. Specifically, we have discussed\none source of local type non-Gaussianity generated in\nour curvaton mechanism. We find, for typical parameter values, the predicted amplitude is quite sizable to be\nobservationally relevant. There are other sources, however, which are expected to lead to even larger effects.\nNote that there have recently been some attempts to\nseed sizable non-Gaussianity in the framework of inflationary preheating[88–91]. The distinguishing difference\nbetween their models and ours is that in our case the\nnon-Gaussian fluctuations arise even for modes in the far\ninfrared, modes relevant for current cosmological observations. However, those in inflation are contributed by\na narrow resonance which puts an upper bound on their\nwavelength [92].\n\nAcknowledgments\nVI.\n\nCONCLUSIONS AND DISCUSSION\n\nIn this paper we introduced the \"matter bounce curvaton\" scenario, a new mechanism to generate a scaleinvariant primordial spectrum of cosmological perturbations in the framework of a nonsingular bounce cosmology with a matter-dominated phase of contraction. This\nmodel is able to solve the \"large r problem\" from which\nmany bouncing cosmologies suffer, while preserving the\nscale-invariance of the power spectrum. Our scenario is\nbased on taking into account the contributions of light\nfields to the curvature fluctuations. The light fields act\nas curvatons. They acquire a scale-invariant spectrum of\nfluctuations on super-Hubble scales during the contracting phase. As we have shown, the change in the equation\nof state immediately before and during the bounce phase\nleads to the transfer of the fluctuations to the adiabatic\nmode, maintaining the scale-invariance of the spectrum.\nWe have studied our mechanism in a concrete realization of the matter bounce scenario, namely the quintom\n\nY.F.C. is supported by funds from the Department\nof Physics at Arizona State University. Y.F.C thanks\nMcGill University for hospitality while this work was finalized. The research of R.B. is supported in part by\nan NSERC Discovery Grant at McGill University and by\nfunds from the Canada Research Chairs program. The\nresearch of X.Z. is supported in part by the National\nNatural Science Foundation of China under Grants No.\n10975142, 10821063 and 11033005, by the 973 program\nNo. 1J2007CB81540002, and by the Chinese Academy of\nSciences under Grant No. KJCX3-SYW-N2.\n\nVII.\n\nAPPENDICES\n\nThe the first part of this Appendix we study the evolution equation for ζ, in the second we look at the evolution\nof the entropy fluctuations in the deflationary phase.\n\n\f12\nConsequently, its time derivative is given by\n\nGeneral Analysis of ζ\n\nA.\n\nAs in the main text, we assume that matter is described by a collection of scalar fields. In this case, at\nlinear order, the generic form of the equation for the time\nderivative of ζ is\nζ̇ = −\n\nX Qi φ̇2\nH 2\n( i ). .\n∇ Φ − 4πGH\nḢ\nḢ\nφ̇\ni\ni\n\n(68)\n\nOn large scales, the first term of the r.h.s of Eq. (68)\nis negligible. The second term describes the transfer of\nentropy to adiabatic fluctuations, the term we are interested in.\nAt first, let us see how the above multi-field formula\napplies to the double field case which is usually analyzed\nin the literature. For a model with two fields φ1 and φ2 ,\nwe get\nζ̇ = −\n\nH 2\nφ̇2\nφ̇2\nQ1\nQ2\n∇ Φ+H\n( 2 1 2 ). + H\n( 2 2 2 ). (. 69)\nḢ\nφ̇1 φ̇1 + φ̇2\nφ̇2 φ̇1 + φ̇2\n\nOne notices that\n(\n\nφ̇21\n\nφ̇22\n\n.\n\n) +(\n\nφ̇21 + φ̇22\n\n.\n\nφ̇21 + φ̇22\n\n) =0,\n\n(70)\n\nand thus one obtains\nζ̇ = −\n\nφ̇21\n\n1\nQ1 1\nH 2\n[ (\n). − ( 2\n). ]\n∇ Φ+H\n2 φ̇1 + φ̇22\nḢ\nφ̇1 2 φ̇21 + φ̇22\n\n+H\n= −\n\nφ̇22\n\nφ̇22\n\nφ̇21\n\nQ2 1\n1\n[ ( 2\n). − ( 2\n). ]\n2\n2 φ̇1 + φ̇22\nφ̇2 2 φ̇1 + φ̇2\n\nH 2\nQ2 φ̇21 − φ̇22 .\nH Q1\n−\n)(\n) ,\n∇ Φ+ (\n2 φ̇1\nḢ\nφ̇2 φ̇21 + φ̇22\n\nΦ̈ + 4H Φ̇ + (2Ḣ + 3H 2 )Φ = 4πGδp ,\n\n(72)\n\nΦ̇ + HΦ = 4πGδq ,\n\n(73)\n\n−3H(Φ̇ + HΦ) + ∇2 Φ = 4πGδρ ,\n\n(74)\n\nwhere\nX\n[φ̇i (δ φ̇i − φ̇i Φ) − V,i δφi ] ,\n\n(75)\n\nX\n\n(76)\n\ni\n\nδq =\n\nφ̇i δφi ,\n\ni\n\nδρ =\n\nX\n[φ̇i (δ φ̇i − φ̇i Φ) + V,i δφi ] .\n\n(77)\n\ni\n\nRecall that the gauge-invariant curvature perturbation\nvariable ζ can be expressed as\nζ =Φ−\n\nH\n(Φ̇ + HΦ) .\nḢ\n\nH Ḧ X\nφ̇i δφi\nḢ 2 i\nX\nH X\nH\nφ̇i (δ φ̇i + 3Hδφi )\nφ̇i δ φ̇i −\n= − ∇2 Φ − 8πG [\nḢ\nḢ i\ni\n+4πG\n\n−\n\nX\ni\n\nV,i δφi ] + 4πG\n\nH Ḧ X\nφ̇i δφi\nḢ 2 i\n\n= −\n\nH 2\nH Ḧ X\nHX\nφ̈i δφi + 4πG\nφ̇i δφi\n∇ Φ − 8πG\nḢ\nḢ i\nḢ 2 i\n\n= −\n\nX δφi φ̇i φ̈i\nφ̇2 Ḧ\nH 2\n(−\n∇ Φ + 8πGH\n+ i )\nḢ\nḢ\n2Ḣ 2\nφ̇i\ni\n\n= −\n\nX δφi φ̇2\nH 2\n( i ). .\n∇ Φ − 4πGH\nḢ\nḢ\nφ̇\ni\ni\n\n(79)\n\nIn the above calculation, we have used the background\nequation\nX\nφ̇2i\n(80)\nḢ = −4πG\ni\n\n(71)\n\nwhich is exactly what is obtained in the usual literature.\nIn the following, we provide the detailed derivation of\nthe equation (68) for the time derivative of ζ in the multiple field model. We start with the standard perturbed\nEinstein equations,\n\nδp =\n\nH\n[4πGδp − ḢΦ\nḢ\nH Ḧ\n(Φ̇ + HΦ)\n−3H(Φ̇ + HΦ)] +\nḢ 2\nH\nH Ḧ\n= − [4πGδp + 4πGδρ − ∇2 Φ] +\nδq\nḢ\n2Ḣ 2\nX\nH\nφ̇i δ φ̇i + 2ḢΦ − 2∇2 Φ + ∇2 Φ]\n= − [8πG\nḢ\ni\n\nζ̇ = Φ̇ − (Φ̇ + HΦ) −\n\n(78)\n\na number of times. Moreover, it is convenient to introduce the Sasaki-Mukhanov variables as defined in the\nSection II, Qi ≡ δφi + φ̇Hi Φ. Then we precisely obtain\nEq. (9).\nB.\n\nFluctuations in the Deflationary Phase\n\nNow we study the evolution of the entropy scalar χ in\nthe deflationary process. From studies of chaotic type\ninflation models, it is well known that the background\nfield φ freezes out when the amplitude φ̃ becomes of\nthe order of the Planck mass, more specifically when\n2m\nφ̃m = √3πpl3 . This leads to a nearly constant Hubble\nparameter Hm = − 4m\n3π and an almost exponentially decreasing scalar factor for the universe. This phase is crucial to achieving a nonsingular bounce, since the matter\ncomponent, which effectively carries the negative energy\ndensity (namely, the Lee-Wick partner field or a ghost\ncondensate), will grow rapidly and soon catch up to the\ndensity of φ.\nAssuming that the Lee-Wick partner ψ satisfies the\nfollowing background equation of motion,\nψ̈ + 3H ψ̇ + M 2 ψ = 0 ,\n\n(81)\n\n\f13\nit is always oscillating around the stable point of its potential throughout the whole evolution of the universe.\nBefore the deflationary phase, both the amplitudes ψ̃ and\nφ̃ are growing in the same rate. Therefore, it is convenient to define a ratio\nd2 ≡\n\nψ̃\n,\nφ̃\n\n(82)\n\nwhich is almost constant until the moment tm , the end of\nthe matter-dominated phase of contraction. Afterwards,\nsolving the background equation of motion (81), one obtains\n\u0014\n\u0015\n2m\nψ̃ ≃ ψ̃m exp\n(t − tm ) ,\n(83)\nπ\nwhich evolves proportional to a−3/2 . One can compute\nthat the contribution of ψ catches up to that of φ at the\nmoment\nm\nπ\nln\n(84)\ntd = tm +\n2m d2 M\n\nwhere we have introduced an amplification factor C,\nwhich is determined by\n\nC=(\n\nm 4\n) ,\nd2 M\n\n(86)\n\nindicating that the amplification on the isocurvature perturbation in deflationary process is depressed by the ratio\nm/M but manifestly amplified by d2 . The coefficient d2\nis determined by the the ratio of two background scalar\nfields at low energy scale which is far away before the\nbouncing point. At that moment, the excitation of ψ is\nstrongly suppressed by the mass scale M as illustrated in\nthe Lee-Wick model and the ghost condensate, and thus\nd2 < m/M is satisfied commonly.\n\n(85)\n\nNote that, the above analysis involves an important\nrequirement that the coupling between the background\nscalar φ and the entropy field χ is enough week, i.e.,\ng < m/mpl . It is possible to choose a large value of the\ncoupling constant which breaks this bound. This case\ncorresponds to a stochastic resonance for the isocurvature\nperturbation before the bouncing phase, but would spoil\nthe feature of scale-invariance as observed by current experiments. A detailed analysis of stochastic resonance on\nentropy field around the bounce will be performed in an\naccompanied paper in a following up project.\n\n[1] R. C. Tolman, \"On the Problem of the Entropy of the\nUniverse as a Whole,\" Phys. Rev. 37, 1639 (1931).\n[2] R. Brustein and R. Madden, \"A model of graceful exit\nin string cosmology,\" Phys. Rev. D 57, 712 (1998)\n[arXiv:hep-th/9708046].\n[3] C. Cartier, E. J. Copeland and R. Madden, \"The graceful exit in string cosmology,\" JHEP 0001, 035 (2000)\n[arXiv:hep-th/9910169].\n[4] V. F. Mukhanov and R. H. Brandenberger, \"A Nonsingular universe,\" Phys. Rev. Lett. 68, 1969 (1992).\n[5] S. Tsujikawa, R. Brandenberger and F. Finelli, \"On the\nconstruction of nonsingular pre-big-bang and ekpyrotic\ncosmologies and the resulting density perturbations,\"\nPhys. Rev. D 66, 083513 (2002) [arXiv:hep-th/0207228].\n[6] T. Biswas, A. Mazumdar and W. Siegel, \"Bouncing universes in string-inspired gravity,\" JCAP 0603, 009 (2006)\n[arXiv:hep-th/0508194].\n[7] R. Brandenberger, \"Matter Bounce in HoravaLifshitz Cosmology,\" Phys. Rev. D 80, 043516 (2009)\n[arXiv:0904.2835 [hep-th]].\n[8] Y. F. Cai and E. N. Saridakis, \"Non-singular cosmology\nin a model of non-relativistic gravity,\" JCAP 0910, 020\n(2009) [arXiv:0906.1789 [hep-th]].\n\n[9] T. Suyama, \"Notes on Matter in Horava-Lifshitz Gravity,\" arXiv:0909.4833 [hep-th].\n[10] X. Gao, Y. Wang, W. Xue and R. Brandenberger,\n\"Fluctuations in a Hořava-Lifshitz Bouncing Cosmology,\" JCAP 1002, 020 (2010) [arXiv:0911.3196 [hep-th]].\n[11] A. Kehagias and E. Kiritsis, \"Mirage cosmology,\" JHEP\n9911, 022 (1999) [arXiv:hep-th/9910174].\n[12] Y. Shtanov and V. Sahni, \"Bouncing braneworlds,\" Phys.\nLett. B 557, 1 (2003) [arXiv:gr-qc/0208047].\n[13] M. Gasperini and G. Veneziano, \"Pre - big bang\nin string cosmology,\" Astropart. Phys. 1, 317 (1993)\n[arXiv:hep-th/9211021];\nM. Gasperini and G. Veneziano, \"The pre-big bang scenario in string cosmology,\" Phys. Rept. 373, 1 (2003)\n[arXiv:hep-th/0207130].\n[14] J. Khoury, B. A. Ovrut, P. J. Steinhardt and N. Turok,\n\"The ekpyrotic universe: Colliding branes and the origin\nof the hot big bang,\" Phys. Rev. D 64, 123522 (2001)\n[arXiv:hep-th/0103239];\nJ. Khoury, B. A. Ovrut, N. Seiberg, P. J. Steinhardt and\nN. Turok, \"From big crunch to big bang,\" Phys. Rev. D\n65, 086007 (2002) [arXiv:hep-th/0108187].\n[15] M. Gasperini, M. Maggiore and G. Veneziano, \"Towards\n\n2mm\n\nwhen ψ̃d ≃ 9M pl .\nWe are able to compute the solution to the entropy\nfield χ as well. This yields χ ∝ a−3 . Then we continue\nto solve the perturbation equation in the infrared limit\nk → 0, and obtain the amplitude of the isocurvature\nperturbation at the moment td as follows,\n\u0015\n\u0014\n4m\n(td − tm )\nδχd ≃ δχm exp\nπ\n≃ C 1/2 δχm ,\n\n\f14\n\n[16]\n[17]\n\n[18]\n\n[19]\n[20]\n[21]\n\n[22]\n[23]\n\n[24]\n[25]\n\n[26]\n[27]\n\n[28]\n\n[29]\n[30]\n\n[31]\n[32]\n\n[33]\n\n[34]\n\na non-singular pre-big bang cosmology,\" Nucl. Phys. B\n494, 315 (1997) [arXiv:hep-th/9611039];\nM. Gasperini, M. Giovannini and G. Veneziano, \"Perturbations in a non-singular bouncing universe,\" Phys. Lett.\nB 569, 113 (2003) [arXiv:hep-th/0306113].\nE. I. Buchbinder, J. Khoury and B. A. Ovrut, \"New\nEkpyrotic Cosmology,\" Phys. Rev. D 76, 123503 (2007)\n[arXiv:hep-th/0702154].\nP. Creminelli and L. Senatore, \"A smooth bouncing cosmology with scale invariant spectrum,\" JCAP 0711, 010\n(2007) [arXiv:hep-th/0702165].\nM. Bojowald, \"Absence of singularity in loop quantum cosmology,\" Phys. Rev. Lett. 86, 5227 (2001)\n[arXiv:gr-qc/0102069].\nR. H. Brandenberger and C. Vafa, \"Superstrings in the\nEarly Universe,\" Nucl. Phys. B 316, 391 (1989).\nR. H. Brandenberger, \"String Gas Cosmology,\"\narXiv:0808.0746 [hep-th].\nT. Biswas, R. Brandenberger, A. Mazumdar and\nW. Siegel, \"Non-perturbative gravity, Hagedorn\nbounce and CMB,\" JCAP 0712, 011 (2007)\n[arXiv:hep-th/0610274].\nV. Bozza and G. Veneziano, \"Scalar perturbations in regular two-component bouncing cosmologies,\" Phys. Lett.\nB 625, 177 (2005) [arXiv:hep-th/0502047].\nP. Peter and N. Pinto-Neto, \"Primordial perturbations\nin a non singular bouncing universe model,\" Phys. Rev.\nD 66, 063509 (2002) [arXiv:hep-th/0203013].\nY. F. Cai, T. Qiu, Y. S. Piao, M. Li and X. Zhang,\n\"Bouncing Universe with Quintom Matter,\" JHEP 0710,\n071 (2007) [arXiv:0704.1090 [gr-qc]].\nY. F. Cai, T. Qiu, R. Brandenberger, Y. S. Piao and\nX. Zhang, \"On Perturbations of Quintom Bounce,\"\nJCAP 0803, 013 (2008) [arXiv:0711.2187 [hep-th]].\nY. F. Cai, T. t. Qiu, J. Q. Xia and X. Zhang, \"A Model\nOf Inflationary Cosmology Without Singularity,\" Phys.\nRev. D 79, 021303 (2009) [arXiv:0808.0819 [astro-ph]].\nY. F. Cai and X. Zhang, \"Evolution of Metric Perturbations in Quintom Bounce model,\" JCAP 0906, 003\n(2009) [arXiv:0808.2551 [astro-ph]].\nY. F. Cai, E. N. Saridakis, M. R. Setare and J. Q. Xia,\n\"Quintom Cosmology: theoretical implications and observations,\" arXiv:0909.2776 [hep-th].\nC. Lin, R. H. Brandenberger, L. P. Levasseur, \"A\nMatter Bounce By Means of Ghost Condensation,\"\n[arXiv:1007.2654 [hep-th]].\nY. F. Cai, T. T. Qiu, R. Brandenberger and X. m. Zhang,\n\"A Nonsingular Cosmology with a Scale-Invariant Spectrum of Cosmological Perturbations from Lee-Wick Theory,\" Phys. Rev. D 80, 023511 (2009) [arXiv:0810.4677\n[hep-th]].\nM. Novello and S. E. P. Bergliaffa, \"Bouncing Cosmologies,\" Phys. Rept. 463, 127 (2008) [arXiv:0802.1634\n[astro-ph]].\nD. Wands, \"Duality invariance of cosmological perturbation spectra,\" Phys. Rev. D 60, 023507 (1999)\n[arXiv:gr-qc/9809062].\nF. Finelli and R. Brandenberger, \"On the generation of a\nscale-invariant spectrum of adiabatic fluctuations in cosmological models with a contracting phase,\" Phys. Rev.\nD 65, 103522 (2002) [arXiv:hep-th/0112249].\nA. A. Starobinsky, \"Spectrum of relict gravitational radiation and the early state of the universe,\" JETP Lett. 30\n(1979) 682 [Pisma Zh. Eksp. Teor. Fiz. 30 (1979) 719].\n\n[35] R. H. Brandenberger, \"Cosmology of the Very Early\nUniverse,\" AIP Conf. Proc. 1268, 3-70 (2010).\n[arXiv:1003.1745 [hep-th]].\n[36] Y. Cai, R. Brandenberger and X. Zhang, in preparation\n(2011).\n[37] S. Mollerach, \"Isocurvature Baryon Perturbations And\nInflation,\" Phys. Rev. D42, 313-325 (1990).\n[38] A. D. Linde and V. F. Mukhanov, \"Nongaussian isocurvature perturbations from inflation,\" Phys. Rev. D 56,\n535 (1997) [arXiv:astro-ph/9610219].\n[39] D. H. Lyth and D. Wands, \"Generating the curvature\nperturbation without an inflaton,\" Phys. Lett. B 524, 5\n(2002) [arXiv:hep-ph/0110002].\n[40] T. Moroi and T. Takahashi, \"Effects of cosmological\nmoduli fields on cosmic microwave background,\" Phys.\nLett. B 522, 215 (2001) [Erratum-ibid. B 539, 303\n(2002)] [arXiv:hep-ph/0110096].\n[41] K. Enqvist and M. S. Sloth, \"Adiabatic CMB perturbations in pre big bang string cosmology,\" Nucl. Phys. B\n626, 395 (2002) [arXiv:hep-ph/0109214].\n[42] F. Finelli, \"Assisted contraction,\" Phys. Lett. B 545, 1\n(2002) [arXiv:hep-th/0206112].\n[43] A. Notari and A. Riotto, \"Isocurvature perturbations in\nthe ekpyrotic universe,\" Nucl. Phys. B 644, 371 (2002)\n[arXiv:hep-th/0205019].\n[44] J. L. Lehners, P. McFadden, N. Turok and P. J. Steinhardt, \"Generating ekpyrotic curvature perturbations\nbefore the big bang,\" Phys. Rev. D 76, 103501 (2007)\n[arXiv:hep-th/0702153].\n[45] B. Feng, X. L. Wang and X. M. Zhang, Phys. Lett. B\n607, 35 (2005) [arXiv:astro-ph/0404224].\n[46] J. Karouby and R. Brandenberger, \"A Radiation Bounce\nfrom the Lee-Wick Construction?,\" Phys. Rev. D 82,\n063532 (2010) [arXiv:1004.4947 [hep-th]].\n[47] V. F. Mukhanov, H. A. Feldman and R. H. Brandenberger, \"Theory of cosmological perturbations. Part 1.\nClassical perturbations. Part 2. Quantum theory of perturbations. Part 3. Extensions,\" Phys. Rept. 215, 203\n(1992).\n[48] M. Sasaki and E. D. Stewart, \"A General Analytic Formula For The Spectral Index Of The Density Perturbations Produced During Inflation,\" Prog. Theor. Phys. 95,\n71 (1996) [arXiv:astro-ph/9507001].\n[49] D. Langlois, \"Correlated adiabatic and isocurvature perturbations from double inflation,\" Phys. Rev. D 59,\n123512 (1999) [arXiv:astro-ph/9906080].\n[50] C. Gordon, D. Wands, B. A. Bassett and\nR. Maartens, \"Adiabatic and entropy perturbations\nfrom inflation,\" Phys. Rev. D 63, 023506 (2001)\n[arXiv:astro-ph/0009131].\n[51] M. Sasaki, \"Large Scale Quantum Fluctuations in the Inflationary Universe,\" Prog. Theor. Phys. 76, 1036 (1986).\n[52] V. F. Mukhanov, \"Quantum Theory of Gauge Invariant\nCosmological Perturbations,\" Sov. Phys. JETP 67, 1297\n(1988) [Zh. Eksp. Teor. Fiz. 94N7, 1 (1988)].\n[53] L. E. Allen and D. Wands, \"Cosmological perturbations\nthrough a simple bounce,\" Phys. Rev. D 70, 063515\n(2004) [arXiv:astro-ph/0404441].\n[54] P. Peter and N. Pinto-Neto, \"Cosmology without inflation,\" Phys. Rev. D 78, 063506 (2008) [arXiv:0809.2022\n[gr-qc]].\n[55] J. H. Traschen and R. H. Brandenberger, \"PARTICLE\nPRODUCTION DURING OUT-OF-EQUILIBRIUM\nPHASE TRANSITIONS,\" Phys. Rev. D 42, 2491 (1990).\n\n\f15\n[56] L. Kofman, A. D. Linde and A. A. Starobinsky, \"Reheating after inflation,\" Phys. Rev. Lett. 73, 3195 (1994)\n[arXiv:hep-th/9405187].\n[57] Y. Shtanov, J. H. Traschen and R. H. Brandenberger,\n\"Universe reheating after inflation,\" Phys. Rev. D 51,\n5438 (1995) [arXiv:hep-ph/9407247].\n[58] L. Kofman, A. D. Linde and A. A. Starobinsky, \"Towards\nthe theory of reheating after inflation,\" Phys. Rev. D 56,\n3258 (1997) [arXiv:hep-ph/9704452].\n[59] R. Allahverdi, R. Brandenberger, F. Y. Cyr-Racine and\nA. Mazumdar, \"Reheating in Inflationary Cosmology:\nTheory and Applications,\" arXiv:1001.2600 [hep-th].\n[60] H. Li, J. Q. Xia, R. Brandenberger and X. Zhang,\n\"Constraints on Models with a Break in the Primordial Power Spectrum,\" Phys. Lett. B 690, 451 (2010)\n[arXiv:0903.3725 [astro-ph.CO]].\n[61] D. Wands, \"Cosmological perturbations through the big\nbang,\" arXiv:0809.4556 [astro-ph].\n[62] P. Martineau, \"On the decoherence of primordial fluctuations during inflation,\" Class. Quant. Grav. 24, 5817\n(2007) [arXiv:astro-ph/0601134].\n[63] C. Kiefer, I. Lohmar, D. Polarski and A. A. Starobinsky, \"Pointer states for primordial fluctuations in inflationary cosmology,\" Class. Quant. Grav. 24, 1699 (2007)\n[arXiv:astro-ph/0610700].\n[64] E. Komatsu et al., \"Seven-Year Wilkinson Microwave\nAnisotropy Probe (WMAP) Observations: Cosmological\nInterpretation,\" arXiv:1001.4538 [astro-ph.CO].\n[65] M. Bojowald, \"Loop quantum cosmology,\" Living Rev.\nRel. 11, 4 (2008).\n[66] J. Mielczarek, \"The Observational Implications of Loop\nQuantum Cosmology,\" arXiv:0908.4329 [gr-qc].\n[67] K. Enqvist, A. Jokinen, A. Mazumdar, T. Multamaki and A. Vaihkonen, \"Non-Gaussianity from\nPreheating,\" Phys. Rev. Lett. 94, 161301 (2005)\n[arXiv:astro-ph/0411394].\n[68] B. A. Bassett, F. Tamburini, D. I. Kaiser and\nR. Maartens, \"Metric preheating and limitations of linearized gravity. II,\" Nucl. Phys. B 561, 188 (1999)\n[arXiv:hep-ph/9901319].\n[69] B. A. Bassett, D. I. Kaiser and R. Maartens, \"General\nrelativistic preheating after inflation,\" Phys. Lett. B 455,\n84 (1999) [arXiv:hep-ph/9808404].\n[70] F. Finelli and R. H. Brandenberger, \"Parametric amplification of gravitational fluctuations during reheating,\" Phys. Rev. Lett. 82, 1362 (1999)\n[arXiv:hep-ph/9809490].\n[71] B. A. Bassett and F. Viniegra, \"Massless metric preheating,\" Phys. Rev. D 62, 043507 (2000)\n[arXiv:hep-ph/9909353].\n[72] F. Finelli and R. H. Brandenberger, \"Parametric amplification of metric fluctuations during reheating in\ntwo field models,\" Phys. Rev. D 62, 083502 (2000)\n[arXiv:hep-ph/0003172].\n[73] A. Taruya and Y. Nambu, \"Cosmological perturbation\nwith two scalar fields in reheating after inflation,\" Phys.\nLett. B 428, 37 (1998) [arXiv:gr-qc/9709035].\n[74] Y. F. Cai, W. Xue, R. Brandenberger and X. Zhang,\n\"Non-Gaussianity in a Matter Bounce,\" JCAP 0905, 011\n(2009) [arXiv:0903.0631 [astro-ph.CO]].\n[75] Y. F. Cai, W. Xue, R. Brandenberger and X. m. Zhang,\n\"Thermal Fluctuations and Bouncing Cosmologies,\"\nJCAP 0906, 037 (2009) [arXiv:0903.4938 [hep-th]].\n\n[76] V. Acquaviva, N. Bartolo, S. Matarrese and A. Riotto,\n\"Second-order\ncosmological\nperturbations\nfrom inflation,\" Nucl. Phys. B 667, 119 (2003)\n[arXiv:astro-ph/0209156].\n[77] J. M. Maldacena, \"Non-Gaussian features of primordial\nfluctuations in single field inflationary models,\" JHEP\n0305, 013 (2003) [arXiv:astro-ph/0210603].\n[78] X. Chen, M. x. Huang, S. Kachru and G. Shiu, \"Observational signatures and non-Gaussianities of general single field inflation,\" JCAP 0701, 002 (2007)\n[arXiv:hep-th/0605045].\n[79] N. Bartolo, E. Komatsu, S. Matarrese and A. Riotto, \"Non-Gaussianity from inflation:\nTheory\nand observations,\" Phys. Rept. 402, 103 (2004)\n[arXiv:astro-ph/0406398].\n[80] F. Vernizzi and D. Wands, \"Non-Gaussianities\nin two-field inflation,\" JCAP 0605, 019 (2006)\n[arXiv:astro-ph/0603799].\n[81] A. Jokinen and A. Mazumdar, \"Very Large Primordial Non-Gaussianity from multi-field: Application to Massless Preheating,\" JCAP 0604, 003 (2006)\n[arXiv:astro-ph/0512368].\n[82] N. Barnaby and J. M. Cline, \"Nongaussian and nonscaleinvariant perturbations from tachyonic preheating in\nhybrid inflation,\" Phys. Rev. D 73, 106012 (2006)\n[arXiv:astro-ph/0601481].\n[83] D. Langlois and F. Vernizzi, \"Nonlinear perturbations\nof cosmological scalar fields,\" JCAP 0702, 017 (2007)\n[arXiv:astro-ph/0610064].\n[84] K. Koyama, S. Mizuno, F. Vernizzi and D. Wands,\n\"Non-Gaussianities from ekpyrotic collapse with multiple\nfields,\" JCAP 0711, 024 (2007) [arXiv:0708.4321 [hepth]].\n[85] E. I. Buchbinder, J. Khoury and B. A. Ovrut, \"NonGaussianities in New Ekpyrotic Cosmology,\" Phys. Rev.\nLett. 100, 171302 (2008) [arXiv:0710.5172 [hep-th]].\n[86] J. L. Lehners and P. J. Steinhardt, \"Non-Gaussian Density Fluctuations from Entropically Generated Curvature Perturbations in Ekpyrotic Models,\" Phys. Rev. D\n77, 063533 (2008) [Erratum-ibid. D 79, 129903 (2009)]\n[arXiv:0712.3779 [hep-th]].\n[87] D. Babich, P. Creminelli and M. Zaldarriaga, \"The\nshape of non-Gaussianities,\" JCAP 0408, 009 (2004)\n[arXiv:astro-ph/0405356].\n[88] G. Dvali, A. Gruzinov and M. Zaldarriaga, \"A\nnew mechanism for generating density perturbations\nfrom inflation,\" Phys. Rev. D 69, 023505 (2004)\n[arXiv:astro-ph/0303591].\n[89] N. Barnaby and J. M. Cline, \"Nongaussianity from\nTachyonic Preheating in Hybrid Inflation,\" Phys. Rev.\nD 75, 086004 (2007) [arXiv:astro-ph/0611750].\n[90] A. Chambers and A. Rajantie, \"Lattice calculation\nof non-Gaussianity from preheating,\" Phys. Rev. Lett.\n100, 041302 (2008) [Erratum-ibid. 101, 149903 (2008)]\n[arXiv:0710.4133 [astro-ph]].\n[91] Q. G. Huang, \"A geometric description of the nonGaussianity generated at the end of multi-field inflation,\"\nJCAP 0906, 035 (2009) [arXiv:0904.2649 [hep-th]].\n[92] C. T. Byrnes, \"Constraints on generating the primordial\ncurvature perturbation and non-Gaussianity from instant\npreheating,\" JCAP 0901, 011 (2009) [arXiv:0810.3913\n[astro-ph]].\n\n\f"}