{"id": "http://arxiv.org/abs/0710.5486v1", "guidislink": true, "updated": "2007-10-29T19:18:05Z", "updated_parsed": [2007, 10, 29, 19, 18, 5, 0, 302, 0], "published": "2007-10-29T19:18:05Z", "published_parsed": [2007, 10, 29, 19, 18, 5, 0, 302, 0], "title": "Double-detonation supernovae of sub-Chandrasekhar mass white dwarfs", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.2085%2C0710.4493%2C0710.0346%2C0710.4708%2C0710.3683%2C0710.1500%2C0710.0651%2C0710.1899%2C0710.0182%2C0710.4908%2C0710.0364%2C0710.1412%2C0710.1644%2C0710.2972%2C0710.5507%2C0710.5547%2C0710.0992%2C0710.1606%2C0710.4072%2C0710.3782%2C0710.0271%2C0710.3267%2C0710.2476%2C0710.5788%2C0710.5582%2C0710.5486%2C0710.3786%2C0710.3517%2C0710.4330%2C0710.3101%2C0710.5068%2C0710.5914%2C0710.1355%2C0710.0342%2C0710.3745%2C0710.0414%2C0710.0246%2C0908.1903%2C0908.2923%2C0908.1251%2C0908.1762%2C0908.4325%2C0908.1464%2C0908.0756%2C0908.0516%2C0908.1191%2C0908.0704%2C0908.4577%2C0908.3224%2C0908.1978%2C0908.2507%2C0908.4312%2C0908.2496%2C0908.2897%2C0908.0770%2C0908.4569%2C0908.0885%2C0908.4106%2C0908.2086%2C0908.3058%2C0908.0625%2C0908.0585%2C0908.2087%2C0908.1381%2C0908.2469%2C0908.3673%2C0908.3986%2C0908.3781%2C0908.3440%2C0908.1496%2C0908.0789%2C0908.2721%2C0908.0484%2C0908.2582%2C0908.3173%2C0908.3039%2C0908.2627%2C0908.0650%2C0908.2409%2C0908.2459%2C0908.2792%2C0908.2514%2C0908.3927%2C0908.0075%2C0908.4251%2C0908.3639%2C0908.1204%2C0908.3064%2C0908.2296%2C0908.1016%2C0908.3241%2C0908.4044%2C0908.4514%2C0908.0238%2C0908.2088%2C0908.3330%2C0908.1526%2C0908.3978%2C0908.2959%2C0908.2309%2C0908.2521&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Double-detonation supernovae of sub-Chandrasekhar mass white dwarfs"}, "summary": "In the \"double-detonation sub-Chandrasekhar\" model for type Ia supernovae, a\ncarbon-oxygen (C + O) white dwarf accumulates sufficient amounts of helium such\nthat a detonation ignites in that layer before the Chandrasekhar mass is\nreached. This detonation is thought to trigger a secondary detonation in the C\n+ O core. By means of one- and two-dimensional hydrodynamic simulations, we\ninvestigate the robustness of this explosion mechanism for generic 1-M_sun\nmodels and analyze its observable predictions. Also a resolution dependence in\nnumerical simulations is analyzed. The propagation of thermonuclear detonation\nfronts, both in helium and in the carbon-oxygen mixture, is computed by means\nof both a level-set function and a simplified description for nuclear\nreactions. The decision whether a secondary detonation is triggered in the\nwhite dwarf's core or not is made based on criteria given in the literature. In\na parameter study involving different initial flame geometries for He-shell\nmasses of 0.2 and 0.1 M_sun, we find that a secondary detonation ignition is a\nvery robust process. Converging shock waves originating from the detonation in\nthe He shell generate the conditions for a detonation near the center of the\nwhite dwarf in most of the cases considered. Finally, we follow the complete\nevolution of three selected models with 0.2 M_sun of He through the\nC/O-detonation phase and obtain nickel-masses of about 0.40 to 0.45 M_sun.\nAlthough we have not done a complete scan of the possible parameter space, our\nresults show that sub-Chandrasekhar models are not good candidates for normal\nor sub-luminous type Ia supernovae. The chemical composition of the ejecta\nfeatures significant amounts of nickel in the outer layers at high expansion\nvelocities, which is inconsistent with near-maximum spectra. (abbreviated)", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.2085%2C0710.4493%2C0710.0346%2C0710.4708%2C0710.3683%2C0710.1500%2C0710.0651%2C0710.1899%2C0710.0182%2C0710.4908%2C0710.0364%2C0710.1412%2C0710.1644%2C0710.2972%2C0710.5507%2C0710.5547%2C0710.0992%2C0710.1606%2C0710.4072%2C0710.3782%2C0710.0271%2C0710.3267%2C0710.2476%2C0710.5788%2C0710.5582%2C0710.5486%2C0710.3786%2C0710.3517%2C0710.4330%2C0710.3101%2C0710.5068%2C0710.5914%2C0710.1355%2C0710.0342%2C0710.3745%2C0710.0414%2C0710.0246%2C0908.1903%2C0908.2923%2C0908.1251%2C0908.1762%2C0908.4325%2C0908.1464%2C0908.0756%2C0908.0516%2C0908.1191%2C0908.0704%2C0908.4577%2C0908.3224%2C0908.1978%2C0908.2507%2C0908.4312%2C0908.2496%2C0908.2897%2C0908.0770%2C0908.4569%2C0908.0885%2C0908.4106%2C0908.2086%2C0908.3058%2C0908.0625%2C0908.0585%2C0908.2087%2C0908.1381%2C0908.2469%2C0908.3673%2C0908.3986%2C0908.3781%2C0908.3440%2C0908.1496%2C0908.0789%2C0908.2721%2C0908.0484%2C0908.2582%2C0908.3173%2C0908.3039%2C0908.2627%2C0908.0650%2C0908.2409%2C0908.2459%2C0908.2792%2C0908.2514%2C0908.3927%2C0908.0075%2C0908.4251%2C0908.3639%2C0908.1204%2C0908.3064%2C0908.2296%2C0908.1016%2C0908.3241%2C0908.4044%2C0908.4514%2C0908.0238%2C0908.2088%2C0908.3330%2C0908.1526%2C0908.3978%2C0908.2959%2C0908.2309%2C0908.2521&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In the \"double-detonation sub-Chandrasekhar\" model for type Ia supernovae, a\ncarbon-oxygen (C + O) white dwarf accumulates sufficient amounts of helium such\nthat a detonation ignites in that layer before the Chandrasekhar mass is\nreached. This detonation is thought to trigger a secondary detonation in the C\n+ O core. By means of one- and two-dimensional hydrodynamic simulations, we\ninvestigate the robustness of this explosion mechanism for generic 1-M_sun\nmodels and analyze its observable predictions. Also a resolution dependence in\nnumerical simulations is analyzed. The propagation of thermonuclear detonation\nfronts, both in helium and in the carbon-oxygen mixture, is computed by means\nof both a level-set function and a simplified description for nuclear\nreactions. The decision whether a secondary detonation is triggered in the\nwhite dwarf's core or not is made based on criteria given in the literature. In\na parameter study involving different initial flame geometries for He-shell\nmasses of 0.2 and 0.1 M_sun, we find that a secondary detonation ignition is a\nvery robust process. Converging shock waves originating from the detonation in\nthe He shell generate the conditions for a detonation near the center of the\nwhite dwarf in most of the cases considered. Finally, we follow the complete\nevolution of three selected models with 0.2 M_sun of He through the\nC/O-detonation phase and obtain nickel-masses of about 0.40 to 0.45 M_sun.\nAlthough we have not done a complete scan of the possible parameter space, our\nresults show that sub-Chandrasekhar models are not good candidates for normal\nor sub-luminous type Ia supernovae. The chemical composition of the ejecta\nfeatures significant amounts of nickel in the outer layers at high expansion\nvelocities, which is inconsistent with near-maximum spectra. (abbreviated)"}, "authors": ["M. Fink", "W. Hillebrandt", "F. K. Roepke"], "author_detail": {"name": "F. K. Roepke"}, "author": "F. K. Roepke", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361:20078438", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0710.5486v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0710.5486v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "11 pages, 10 figures, PDFLaTeX, accepted for publication in A&A", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0710.5486v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0710.5486v1", "journal_reference": null, "doi": "10.1051/0004-6361:20078438", "fulltext": "c ESO 2018\n\nAstronomy & Astrophysics manuscript no. main\nNovember 19, 2018\n\nDouble-detonation supernovae of sub-Chandrasekhar mass white\ndwarfs\nM. Fink, W. Hillebrandt, and F. K. Röpke\nMax-Planck-Institut für Astrophysik, Karl-Schwarzschild-Str. 1, D-85741 Garching, Germany\nReceived 7 August 2007 / Accepted 3 October 2007\n\narXiv:0710.5486v1 [astro-ph] 29 Oct 2007\n\nABSTRACT\n\nType Ia supernovae are believed to be white dwarfs disrupted by a thermonuclear explosion. Here we investigate the scenario in\nwhich a rather low-mass, carbon-oxygen (C + O) white dwarf accumulates helium on its surface in a sufficient amount for igniting a\ndetonation in the helium shell before the Chandrasekhar mass is reached. In principle, this can happen on white dwarfs accreting from\na non-degenerate companion or by merging a C + O white dwarf with a low-mass helium one. In this scenario, the helium detonation\nis thought to trigger a secondary detonation in the C + O core. It is therefore called the \"double-detonation sub-Chandrasekhar\"\nsupernova model.\nBy means of a set of numerical simulations, we investigate the robustness of this explosion mechanism for generic 1-M models and\nanalyze its observable predictions. Also a resolution dependence in numerical simulations is analyzed.\nHydrodynamic simulations of the double-detonation sub-Chandrasekhar scenario are conducted in two and three spatial dimensions.\nThe propagation of thermonuclear detonation fronts, both in helium and in the carbon-oxygen mixture, is computed by means of both\na level-set function and a simplified description for nuclear reactions. The decision whether a secondary detonation is triggered in the\nwhite dwarf's core or not is made based on criteria given in the literature.\nIn a parameter study involving different initial flame geometries for He-shell masses of 0.2 and 0.1 M (and thus 0.8 and 0.9 M of\nC + O), we find that a secondary detonation ignition is a very robust process. Converging shock waves originating from the detonation\nin the He shell generate the conditions for a detonation near the center of the white dwarf in most of the cases considered. Finally, we\nfollow the complete evolution of three selected models with 0.2 M of He through the C/O-detonation phase and obtain 56 Ni-masses\nof about 0.40 to 0.45 M .\nAlthough we have not done a complete scan of the possible parameter space, our results show that sub-Chandrasekhar models are not\ngood candidates for normal or sub-luminous type Ia supernovae. The chemical composition of the ejecta features significant amounts\nof 56 Ni in the outer layers at high expansion velocities, which is inconsistent with near-maximum spectra.\nKey words. supernovae: general – nuclear reactions, nucleosynthesis, abundances – hydrodynamics – methods: numerical\n\n1. Introduction\nOne of the major uncertainties in modeling type Ia supernovae\n(SN Ia) originates from the unknown nature of the progenitor\nsystems because neither observations nor theoretical models are\nyet conclusive (Branch et al. 1995; Ruiz-Lapuente et al. 2000;\nLivio 2000; Nomoto et al. 2003; Han & Podsiadlowski 2004;\nNapiwotzki et al. 2005; Stritzinger et al. 2006; Parthasarathy\net al. 2007). Over the past years, most studies of thermonuclear supernova explosions focused on models in which a thermonuclear flame is formed by a runaway near the center of a\nwhite dwarf (WD), composed of carbon and oxygen, once it\nhas reached the Chandrasekhar mass (MCh ∼ 1.4 M ) by accretion from a non-degenerate companion. Starting out in the\nsub-sonic deflagration mode of flame propagation, these models were shown to give rise to energetic explosions either in\npure turbulence-boosted deflagrations (Reinecke et al. 2002b;\nGamezo et al. 2003; Röpke & Hillebrandt 2005; Röpke et al.\n2006; Schmidt & Niemeyer 2006; Schmidt et al. 2006; Röpke\net al. 2007a) or with a delayed triggering of a supersonic detonation phase (Gamezo et al. 2004; Plewa et al. 2004; Röpke\n& Niemeyer 2007). There seems to be reasonable agreement of\nsuch models with the gross features of observed SNe Ia (Röpke\net al. 2007a; Mazzali et al. 2007). However, it remains unclear\nwhether the Chandrasekhar mass model can account for the full\n\nrange of SN Ia observations. In particular, the mechanism of the\nsub-luminous events (SN 1991bg being a prototypical example)\nremains a puzzle (Mazzali et al. 2007). Stritzinger et al. (2006)\neven claim typical ejecta masses below MCh for a sample of well\nobserved SNe Ia, with the trend that the low-luminosity explosions eject less mass.\nTherefore, a long standing question is whether other progenitor channels contribute to the observed SN Ia sample, and\ntwo alternatives have been suggested: the WD merger or double degenerate scenario (in contrast to single degenerate models, which consist of binaries with only one WD) and the subChandrasekhar model. In the present work we explore the latter.\nThe basic idea of the sub-Chandrasekhar model is that if the\naccretion rate onto a WD is lower than about 1 - 4 * 10−8 M yr−1\nthe accreted He (or the H processed to He) is not fused steadily\ninto C and O. Instead, after reaching a critical amount of He\nat relatively low densities, the He shell becomes unstable and\ndetonates (cf. Woosley et al. 1986, and references therein). The\ndetonation ignites most likely close to the bottom of the He\nshell, produces almost pure 56 Ni, and can occur long before the\nWD reaches the Chandrasekhar limit. A second detonation may\nbe triggered spontaneously when the He shell detonation shock\nwave hits the C + O core or with some delay after the shock has\nconverged near the center of the WD (double detonation models). This way, in the sub-Chandrasekhar mass models the condi-\n\n\f2\n\nM. Fink et al.: Double-detonation supernovae of sub-Chandrasekhar mass white dwarfs\n\ntions for thermonuclear runaway are caused by the compression\nin the shock wave and not by the high degree of degeneracy as\nin the Chandrasekhar mass models.\nDelayed double detonations have been studied extensively\nbefore. Woosley & Weaver (1994), and Livne (1990) carried out\none-dimensional (1D) simulations and Livne & Glasner (1990,\n1991) considered two-dimensional (2D) setups. In 1D the He\ndetonation ignites synchronously in a layer close to the bottom\nof the He shell and due to the spherical symmetry constraint the\nshock converges perfectly in the center. However, this is not a\nvery realistic model. According to Livne (1990) an ignition most\nlikely happens in a single point leading to an off-center convergence of oblique shock waves in the core.\nSeveral other simulations predict successful directly ignited\ndouble detonations in two dimensions (Livne 1997; Arnett 1997;\nWiggins & Falle 1997; Wiggins et al. 1998). The smoothed particle hydrodynamics simulations by Benz (1997) and Garcı́a-Senz\net al. (1999) were carried out in 3D. Livne & Glasner (1990)\nfirst reported an increased probability of the direct core ignition\nif the He detonation does not happen directly at the core–shell\ninterface but at a certain distance above it. This way, the pressure\njump can grow large enough before hitting the core.\nIn this work, the results of a (restricted) parameter study are\npresented investigating the possibility of triggering the second\ndetonation in two and three dimensions. In all our models the\nWD has a total mass of 1 M , but the (C + O)-core and the Heshell masses differ. We compute sequences of models with very\ndifferent initial flame geometries in order to test the robustness of\nthis explosion mechanism. Since this latter question is the main\nfocus of our paper, most of the simulations are stopped once\nthe conditions for a detonation are matched. However, for a few\nsuccessful cases the energetics and nucleosynthesis of complete\ndouble detonations are computed. In the following chapter the\nmodel details will be described. Section 3 shows the simulation\nresults, which are summarized and discussed in the last part of\nthe paper.\n\n2. Explosion model\n2.1. General setup\n\nThe numerical scheme used in our simulations is a modified version of the code described by Reinecke et al. (1999a, 2002a),\nRöpke & Hillebrandt (2005), Golombek & Niemeyer (2005),\nand Röpke & Niemeyer (2007). The main difference is the burning physics which accounts for He detonations and the propagation of two detonation waves.\nOur hydrodynamic simulations were carried out on a uniform Eulerian grid with a finite volume scheme based on the\nPROMETHEUS implementation (Fryxell et al. 1989) of the\n\"piecewise parabolic method\" (PPM) (Colella & Woodward\n1984). Thus, discontinuities like shocks were automatically and\naccurately captured but, nonetheless, smeared out over several\ngrid cells. A potential concern is the overheating effect observed in Godunov-type schemes when shocks hit walls or collide. Following the suggestion of Donat & Marquina (1996),\nan approximate Riemann solver (the so-called Marquina solver)\nwas implemented but this did not lead to noticeable differences.\nThus, all simulations presented in the following are based on the\nexact Riemann solver of Colella & Glaz (1985).\nWhile the parameter study testing the possibility of igniting\na detonation in the C + O core was carried out on a static grid,\nthe complete double detonation models presented at the end of\nSect. 3 employed a co-expanding grid as in Röpke & Hillebrandt\n\n(2005) in order to account for the expansion of the WD. The\ncoordinates were (r, z)-cylindrical in 2D and cartesian in 3D.\nThe equation of state we used includes contributions from an\narbitrarily degenerate and arbitrarily relativistic electron gas, a\nphoton gas, electron–positron pairs and nuclei with a MaxwellBoltzmann distribution. The initial WD was assumed to be in\nhydrostatic equilibrium. Therefore its structure is uniquely determined once the density at the center and at the core–shell interface and the temperature profile are fixed. For simplicity a\nconstant temperature of 5 * 105 K was assumed throughout the\nstar. Of course, this is an unrealistic choice, but because of the\nhigh degree of degeneracy the exact temperature has almost no\neffect on the state of the matter. Another simplifying assumption\nis the approximation of the gravitational potential in spherical\nsymmetry. Only the monopole moment of the density distribution averaged over all angles was calculated at every time step.\n2.2. Nuclear reactions\n\nAs we are mostly interested in the hydrodynamic evolution\nof the explosion, it is appropriate to use a strongly simplified\nscheme for nuclear reactions as in Reinecke et al. (2002a). On\nour numerical grid the structure of the flame cannot be resolved.\nTherefore in our simulations the detonation flame is approximated as a discontinuity propagating at an appropriate speed (see\nSect. 2.3) with the fast reactions happening spontaneously at its\npassage and only the density dependent products, but no reaction rates being calculated. In order to approximate the energy\nrelease in the fast reactions and the correct molecular weight of\nfuel and ashes, it is sufficient to consider only one representative\nspecies for each group of elements involved which has a binding energy and mass typical for the group. Our scheme includes\nfour species, namely 4 He, a mixture of 12 C and 16 O with equal\nmass fractions, 28 Si as a representative for the intermediate mass\nelements, and 56 Ni as an iron group element. The following reactions are included in the model, depending on the density at\nthe front:\n– The 4 He detonation in the shell produces pure 56 Ni. Flame\nextinction is assumed to occur at ρ = 105 g cm−3 .\n– A detonation in the 12 C/16 O core produces 56 Ni in nuclear\nstatistic equilibrium (NSE) (represented by a temperature\nand density dependent mixture of 56 Ni and 4 He) above ρ =\n3 * 107 g cm−3 and 28 Si below.1 At densities smaller than\n106 g cm−3 burning is assumed to cease.\nSince the transition density to NSE affects the 56 Ni-mass and\nthus the total explosion energy, its exact value should be investigated further in the future.\nIn order to distinguish the 4 He in the shell from that produced\nin NSE with 56 Ni both are treated as different species in the code.\nWith decreasing densities the 4 He in NSE finally recombines to\n56\nNi. This is the only slow reaction included in our simulations.\nThe propagation of the detonation flame is modeled with the\n\"level set technique\" (Osher & Sethian 1988) in the implementation of Golombek & Niemeyer (2005), which in turn is based\non the deflagration flame model of Reinecke et al. (1999b). The\nzero level set of a signed distance function G represents the flame\n1\nAccording to Imshennik & Khokhlov (1984), at densities lower\nthan about 107 g cm−3 the timescale for NSE formation becomes so\nlarge that the flame width would be bigger than the extent of the whole\ncore. Since it can be assumed that NSE is no longer reached even before\nthe flame width gets close to the extension of the core, 3 * 107 g cm−3\ninstead of 107 g cm−3 is used as the transition density.\n\n\fM. Fink et al.: Double-detonation supernovae of sub-Chandrasekhar mass white dwarfs\n\nfront. Information on whether matter has already been burnt is\nencoded in its sign. It is negative in the fuel and positive in the\nashes. Most important, the location of the flame can be calculated at every time step simply by finding the roots of G. The\npropagation of the zero level set of G consists of two parts: the\nadvection with the flow and self-propagation by burning, respectively. By means of an operator splitting, the advection of G can\nbe treated in the same way as that of a passive scalar in the hydrodynamic scheme (Mulder et al. 1992; Reinecke et al. 1999a,b).\nBurning is accounted for by (Reinecke 2001)\n!\n∂G\n= s |∇G| .\n∂t burn\nThus the velocity s of the flame relative to the flux has to be determined at every time step from the quantities on the grid. In the\nstate-of-the-art deflagration codes this is done by an appropriate\nsub-grid turbulence model. For detonations, as occurring in our\nmodels, turbulence effects can be neglected and the propagation\nspeed s can be determined easily as a function of the density ρ\nonly, as will be described in the next section.\nThe changes in the mass fractions are calculated depending\non ρ, when the flame front passes a cell. Here and also in the\ncase of the velocity s we have the problem that in general the\nstate in such a cell is a mixture of a burnt and an unburnt matter.\nSo we have e.g.2 :\nρ = αρ1 + (1 − α)ρ2 ,\nwhere α is the volume fraction of the cell occupied by the unburnt state. With the so called \"complete coupling\" scheme the\ntwo partial states could be reconstructed from the mixed state\n(Smiljanovski et al. 1997). This enables flux splitting that avoids\nnumerical mixing of fuel and ashes. While such a scheme has\nbeen implemented for 2D small-scale deflagration flame simulations in WD matter (Röpke et al. 2003, 2004a,b), numerical obstacles prevent its application in full star simulations up to now.\nHere, we apply the \"passive implementation\" of Reinecke et al.\n(1999b) and use the mixed state to advect G and also to calculate\nthe burning velocity s and to determine the reaction products.3\nThe scheme described here is not in general appropriate to\nsimulate detonations as, e.g., the burning speed s depends on the\ndetailed geometry of the detonation front. The burning speed s is\nin general a function of Rδ , where δ is the width of the detonation\nfront and R is its curvature radius. In our case, however, the front\ncan be approximated as thin and planar in the density range that\nis relevant for the explosion dynamics.\n2.3. Detonation physics\n\nA detonation wave consists of a shock wave that compresses\nand heats the matter behind it so strongly that it is ignited. The\nshock wave, in turn, is maintained by the energy released due\nto burning. Depending on the properties of the reactions taking\nplace, there exist different types of detonations. A very important case is the Chapman-Jouguet detonation, which propagates\ninto the fuel at the lowest possible speed. According to Landau\n& Lifschitz (1991) a detonation that is created spontaneously by\nthe combustion itself is a Chapman-Jouguet detonation in many\n2\nHere and in the following indices 1 and 2 refer to quantities on the\nunburnt and the burnt side of the front, respectively.\n3\nCorrectly, one would have to use burning and flow velocities on\neither the burnt or the unburnt side of the flame to update G due to\nburning and advection.\n\n3\n\nTable 1. Critical masses for detonations at given density and\ntemperature according to Niemeyer & Woosley (1997).\nρ [g cm−3 ]\n2 * 109\n108\n3 * 107\n\nT c [109 K]\n2.8\n3.2\n3.2\n\nM [g]\n2.0 * 1015\n2.0 * 1015\n2.0 * 1019\n\nR [m]\n0.7\n2\n50\n\nTable 2. Critical temperatures for detonations at given density\nand mass according to Röpke et al. (2007b). Detonation is impossible for ρ ≤ 1 * 106 g cm−3 .\nρ [g cm−3 ]\n107\n107\n107\n3 * 106\n\nT c [109 K]\n2.8\n2.0\n1.9\n2.3\n\nM [g]\n2.5 * 1023\n2.0 * 1025\n1.5 * 1027\n2.0 * 1028\n\nR [km]\n2\n8\n30\n120\n\ncases. Therefore, in our simulations we assumed this type of detonation for the He burning. In the Chapman-Jouguet case there\nexists a simple law for the velocity of the burning front relative\nto the ashes, which is just equal to the sound speed there:\ns\n!\n∂p2\ns2,He = γ2\n.\n∂ρ2 T\nc\n\nHere γ = cVp is the ratio of the specific heat at constant pressure\nand the specific heat at constant volume.\nAccording to Sharpe (1999), self supporting detonations in\ndegenerate carbon/oxygen mixtures at densities between 2 * 107\nand 1*109 g cm−3 are of pathological type. These arise in general\nfrom a non-monotonic heat release in the reactions. For them the\nfront velocity cannot be determined independent of the reaction\nrates. Therefore, for the C/O detonations in this work, we used\nthe values calculated by Sharpe (1999) in numerical simulations\nas a function of density:\ns1,C/O = fSharpe (ρ).4\n\n2.4. Ignition conditions in the C + O core\n\nAs our code lacks a detailed nuclear network and reaction rates\nare not calculated, the onset of a C/O detonation can not be followed. Apart from that, in our full star simulations it would not\nbe feasible to resolve the scales of the detonator (where the shock\nthat supports the detonation is built up). Therefore, the decision\non whether a detonation is triggered is made upon critical conditions given by Niemeyer & Woosley (1997) and Röpke et al.\n(2007b) (see Tables 1 and 2). They are based on the following arguments. If there is a sufficiently large region of supersonic spontaneous burning, a strong pressure wave must form\nand will synchronize with the burning wave if the compression\nand heating is strong enough to burn the material in the sound\ncrossing time of the region under consideration (Blinnikov &\nKhokhlov 1986; Woosley 1990; Khokhlov 1991). Therefore a\ndetonation wave is born if that region is big enough or, equivalently, provided that it consists of enough mass at a given density.\n4\n\nWe neglect here that over-driven detonations powered by shock\nwaves entering the core due to the He shell detonation could also play a\nrole.\n\n\f4\n\nM. Fink et al.: Double-detonation supernovae of sub-Chandrasekhar mass white dwarfs\n\nNiemeyer & Woosley (1997) empirically determined those critical masses from hydrodynamic simulations for different densities and for a given linear5 radial temperature gradient across that\nmass.6 Röpke et al. (2007b) used the same code and setup, but\ndetermined the critical temperature at a given mass for different\ndensities. They focussed on the low end of possible densities.\n\n3. Simulations\nWith the numerical scheme described above, several simulations\nwere performed. In Sect. 3.1, the results of a parameter study\non the influence of the initial flame geometry for two different\ncore and He-shell masses are presented, followed by a resolution\nstudy in Sect. 3.2 and, finally, the determination of explosion\nenergies and nucleosynthesis yields in three successful double\ndetonation simulations. We stress again that the main intension\nof the parameter study is not to scan the entire parameter space\nof possible WD properties but rather to investigate the conditions\nwhich may lead to a double detonation.\n3.1. Initial flame geometry\n\nThe accretion of matter from the companion star onto the WD is\na very complex process, and the formation and ignition of a He\nshell is still afflicted with large uncertainties. As many different\ninitial flame geometries in the shell seem possible, their influence on the possibility and the properties of a double detonation\nis explored first.\nThe different initial flame models, which were treated in this\nstudy, are shown in Fig. 1 and the nomenclature of the simulations is as follows: The first letter in each model's name denotes the geometry, and the following number specifies it further. \"s4.10\" means an ignition in a whole layer of the He shell\nat a radius of 4100 km. \"bn\" stands for an ignition in n separate\n\"bubbles\" (which are, of course, tori in 2D if located off the zaxis). Two special cases of the latter type, for n = 1, are \"z5.00\"\nand \"r5.00\", where the initial \"bubble\" is located at the z- or the\nr-axis, respectively, at a distance of 5000 km from the origin.\nFinally the capital letters \"A\" or \"B\", which follow the above\nnames, indicate the initial masses which were used:\n– Model A:\n– Model B:\n\nMC/O = 0.8 M ,\nMC/O = 0.9 M ,\n\nMHe = 0.2 M ,\nMHe = 0.1 M .\n\nThe results of the study are given in Table 3. There the dimensionality and the number of grid cells along the side of one\nquadrant are added to the model names. Throughout the study\na resolution of 256 cells was used. \"2dq\" means that only the\nfirst quadrant has been simulated assuming equatorial symmetry, whereas \"2d\" denotes full two dimensional simulations of\nthe whole z-range, capturing the entire WD star.\nThe most symmetric case with the simplest hydrodynamic\nflow pattern is the ignition in a whole layer of the He shell. In\nmodel s4.10A 2dq 256 starting with the initial flame geometry\nshown at the top left of Fig. 1, the inner and the outer spherical\ndetonation front start to propagate inwards and outwards, respectively. While the combustion stops close to the border of the WD\ndue to the low densities, it ceases at the core–shell interface because of the depletion of the He fuel. To investigate the chances\n5\n\nwith respect to inner mass\nIn Table 1 only the results for a mixture of equal mass fractions of\nC and O are shown. In their work Niemeyer & Woosley (1997) additionally investigated the dependence on the mass fraction.\n6\n\nTable 3. Results of the parameter study about the initial flame\ngeometry. The last column states if the ignition conditions of a\ncore detonation have been reached.\nModel\ns3.60A 2dq 256\ns4.10A 2dq 256\ns5.00A 2dq 256\nr4.24A 2dq 256\nr5.00A 2dq 256\nz4.24A 2dq 256\nz5.00A 2dq 256\nb1A 2dq 256\nb2A 2dq 256\nb3A 2dq 256\nb5iA 2dq 256\nb5iiA 2dq 256\nb5iiiA 2dq 256\nz4.24A 2d 256\ns4.30B 2dq 256\ns4.80B 2dq 256\nr4.50B 2dq 256\nr5.00B 2dq 256\nz4.50B 2dq 256\nz5.00B 2dq 256\nb2B 2dq 256\nb5iB 2dq 256\nz4.50B 2d 256\n\nt/s\n0.627\n0.575\n0.609\n0.699\n0.718\n0.989\n1.03\n0.767\n0.678\n0.674\n0.629\n0.648\n0.648\n1.08\n0.791\n0.745\n0.892\n0.885\n1.21\n1.24\n0.855\n0.806\n1.31\n\nT 9, max\n9.09\n10.2\n12.1\n5.62\n6.00\n3.27\n3.20\n4.43\n8.61\n7.94\n9.53\n9.00\n9.03\n8.53\n6.82\n8.17\n3.96\n4.49\n2.42\n2.39\n6.72\n7.63\n6.50\n\nρ8, max\n6.14\n7.37\n9.05\n1.54\n1.69\n1.03\n0.981\n1.32\n4.85\n4.57\n6.68\n6.13\n6.37\n4.52\n4.69\n5.99\n1.15\n1.23\n0.808\n0.768\n4.34\n5.47\n3.38\n\nCore ignition\nyes\nyes\nyes\nyes\nyes\nno\nno\nyes\nyes\nyes\nyes\nyes\nyes\nyes\nyes\nyes\nno\nyes\nno\nno\nyes\nyes\nyes\n\nof a core ignition, only the hydrodynamic evolution was considered afterwards and all the reactions taking place were stopped.\nThe shock wave that was formerly driving the inner detonation\nfront continues to propagate inwards until it converges at the\ncenter. There (at t = 0.575 s) a strong shock collision takes place\nthat causes a maximum temperature of 10.2 * 109 K and densities\nup to 7.37 * 108 g cm−3 .\nAccording to Table 1 these maximum values suffice for a\nC/O ignition, if there is at least a mass of about 2.0 * 1015 g\nwith the same temperature and density or, more accurately, with\na sufficiently small temperature decrease from the above mentioned value. A mass of 2.0 * 1015 g at this density corresponds\nto a spherical volume with a radius of the order of 1 km. This\nlength was not resolved in this simulation, where one cell has\na diameter of 23.2 km. But as the high temperatures and densities in our simulations are not confined to one single cell, but\ndistributed over several (which means that the region of interest\nis resolved), the ignition conditions seem to be clearly fulfilled.\nConsequently, a C/O detonation will occur at the center of the\ncore. There is, however, the possibility that a detonation of the\nC/O material is triggered already when the shock wave enters at\nthe edge of the core. About 0.1 s after the start of the simulation, temperatures of about 1 to 2 * 109 K and densities of about\n107 g cm−3 are reached. According to Table 2, this is within the\nrange of conditions where a detonation might occur. But as the\ntemperature gradient might possibly be too large across a radius\nof about 30 km, this question remains open here. As was already\nmentioned, other authors (Livne 1997; Arnett 1997; Benz 1997;\nWiggins & Falle 1997; Wiggins et al. 1998; Garcı́a-Senz et al.\n1999) found successful direct ignitions and an increasing probability for the latter with increasing distance of the He ignition\npoint from the C/O core (cf. Livne & Glasner 1990).\nOur simulations confirm the earlier results. Helium shell detonations were ignited at smaller (s3.60A 2dq 256) and larger\n(s5.00A 2dq 256) radii than in the case described above. As was\nexpected, the shock wave propagating through the core is weaker\n\n\fM. Fink et al.: Double-detonation supernovae of sub-Chandrasekhar mass white dwarfs\n\ns4.10A\n\nz [1000 km]\n\nHe\n\nz4.24A\n\nHe\n\n5\n\nr4.24A\n\nHe\n\n4\n\n2\n\nC+O\n\nC+O\n\nC+O\n\n0\n\nb1A\n\nHe\n\nz [1000 km]\n\nplacements\n\nb2A\n\nHe\n\nb3A\n\nHe\n\n4\n\n2\n\nC+O\n\nC+O\n\nC+O\n\n0\n\nb5iA\n\nz [1000 km]\n\nHe\n\nb5iiA\n\nHe\n\nb5iiiA\n\nHe\n\n4\n\n2\n\nC+O\n\nC+O\n\nC+O\n\n0\n0\n\n2\n\n4\n\nr [1000 km]\n\n0\n\n2\n\n4\n\nr [1000 km]\n\n0\n\n2\n\n4\n\nr [1000 km]\n\nFig. 1. Initial flame models. The He detonation flame fronts start at the borders of the black regions that already contain hot ashes at\nthe beginning.\nin the case of smaller ignition radii and stronger in the case of\nshocks starting further out. Accordingly the maximum temperatures and densities that are reached in the center are lower in the\nformer and higher in the latter case (see Table 3).\nDue to the high degree of symmetry, the models with shell\nignition are the ones that can trigger a second detonation most\neasily. To test multi-dimensional configurations, the complete ignition layer was replaced by single spots (which effectively are\ntori in 2D) distributed over the He shell. Although this is probably not a realistic scenario, it is considered here as a numerical\nexperiment. As far as their maximum densities and temperatures\nare concerned, the models with five initially ignited bubbles in\nthe first quadrant differ only slightly from the complete shell ignition model (see Table 3). The values of T max and ρmax are only\nslightly lower than for the ignition of a shell, starting at the same\nradius, and they still match the conditions for a detonation. If\nthe number of initially burning bubbles is reduced to three, peak\ntemperature and density decrease further.\nThe evolution of simulation b3A 2dq 256 is shown in Fig. 2.\nDue to the coalescence of the parts of the detonation fronts moving inwards, an almost spherically symmetric shock front is entering the core. This resemblance of the dominant hydrodynamic\nprocesses is the reason for the similarity of the results given in\nTable 3.\nIn between the bubbles interactions of the detonation shocks\ntake place. The collision process of two radial shocks can be\ndescribed as a reflection at the plane of symmetry between the\nwaves (see e.g. Courant & Friedrichs 1948). Generally, in this\n\nframe the incidence angle may differ from the angle of reflection.\nThis can be seen best at t = 0.15 s in Fig. 2. The reflected waves\nare again reflected at the waves coming from the opposite side of\nthe initial bubble. The repetition of this process should also have\nsome influence on the geometry of the innermost shock front and\nthus on the conditions given in Table 3.\nThis can be seen in model b2A 2dq 256, which is similar to model b3A 2dq 256, but with the bubble on the z-axis\nremoved. It starts with only two initially ignited bubbles but\nreaches greater maximum densities and temperatures in the core.\nThe reason may be a focusing effect on the z-axis in 2D cylindrical symmetry and the bigger density and pressure jump that can\nbuild up until the burning reaches the axis.\nAn analogous focusing effect in the plane of equatorial symmetry (the xy-plane) is not observed. On the contrary, removing the initial burning bubble from the r-axis (i.e. going from\nb2A 2dq 256 to b1A 2dq 256) leads to a strong decrease of the\nmaximum values of density and temperature.\nConsidering models with only a single initially burning bubble, the exact geometry of the appearing shock waves is of great\nimportance. After the He detonation has reached the border of\nthe core, it spreads around it in a wave propagating almost perpendicular to the core–shell interface. The detailed hydrodynamic structure has been analyzed in Livne & Glasner (1990),\nfrom which Fig. 3 is taken. An oblique shock wave that propagates into the core (tilted by an angle δ with respect to the interface) is associated with the detonation wave moving along the\nsurface of the core. After the shock passage the core–shell inter-\n\n\f6\n\nM. Fink et al.: Double-detonation supernovae of sub-Chandrasekhar mass white dwarfs\nt = 0.40 s\n\nt = 0.15 s\n5\n\n5\n\n4\n\n3\n3\n\nHe\n\n2\n\nρ [107 g cm−3 ]\n\nz [1000 km]\n\n4\n\n2\n\nplacements\n\nC+O\n\n1\n\n1\n\n0\n\n0\n\nt = 0.60 s\n\nt = 0.65 s\n\n5\n\nz [1000 km]\n\n4\n\n3\n\n2\n\n1\n\n0\n\n0\n\n1\n\n2\n\n3\n\nr [1000 km]\n\n4\n\n5\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\nr [1000 km]\n\nFig. 2. Time evolution of the model b3A 2dq 256. Here and in the following figures the density is color coded and lines of constant\npressure are drawn in blue. In cyan the solid line is the location of the He detonation flame (the zero level of G) and the dashed lines\nare at the border of the He shell.\n\nFig. 3. Structure of a detonation propagating at the core–shell\ninterface in the rest frame of the detonation front from Livne &\nGlasner (1990). (Here the core consists of carbon only, not of\nC/O like in our case.)\n\nface is also tilted inwards by an angle β. Thus in-flowing matter\nfollows the oblique shock. The detonation wave is followed by\na rarefaction wave. The angles β and δ can be determined by\n\napplying the Rankine-Hugoniot conditions and depend on the\nstrength of the detonation shock.\nThis structure can clearly be seen at t = 0.40 s in model\nr4.24A 2dq 256, which is the detonation of a torus in the z = 0\nplane (see Fig. 4). Starting from the \"equatorial\" plane the detonation wave propagates around the core until it reaches the\n\"polar\" z-axis. There a collision of the waves coming from all\nazimuthal directions takes place. Equivalently, each wave is reflected at the wave coming from the opposite side of the star.\nThis causes the shock wave visible in the last two snapshots of\nFig. 4 to propagate to the lower right. In the following the oval\ninner shock front moves towards the center. At t = 0.70 s, even\nbefore the center is reached, the maximum density and temperature values are attained on the z-axis at about 850 km away from\nthe center (fourth plot in Fig. 4). The density and temperature\nvalues of 1.54*108 g cm−3 and 5.62*109 K are significantly lower\nthan those in the spherically symmetric models, but according to\nTable 1 they still suffice for the ignition of an off-center core\ndetonation.\nIn the following simulations, the symmetry of the first detonation was further reduced by departing from equatorial symmetry and simulating a whole rotationally symmetric star, i.e. now\nthe negative z-range was considered too. Fig. 5 shows the example simulation z4.24A 2d 256. Here the He detonation starts in a\npoint on the z-axis and then spreads around the whole WD until\nit reaches the negative z-axis (see Fig. 5). In this sense, the setup\nis maximally asymmetric. The processes now taking place are\nanalogous to the simulation r4.24A 2dq 256 described above.\nBut here the maximum density and temperature are reached\n\n\fM. Fink et al.: Double-detonation supernovae of sub-Chandrasekhar mass white dwarfs\nt = 0.40 s\n\nt = 0.15 s\n5\n\n7\n\n5\n\n4\n\n3\n\nHe\n\n3\n\n2\n\nρ [107 g cm−3 ]\n\nz [1000 km]\n\n4\n\n2\n\nplacements\n\nC+O\n\n1\n\n1\n\n0\n\n0\n\nt = 0.70 s\n\nt = 0.60 s\n5\n\nz [1000 km]\n\n4\n\n3\n\n2\n\n1\n\n0\n\n0\n\n1\n\n2\n\n3\n\n4\n\n5\n\n0\n\n1\n\nr [1000 km]\n\n2\n\n3\n\n4\n\n5\n\nr [1000 km]\n\nFig. 4. Time evolution of the model r4.24A 2dq 256.\nwhen the oval inner shock front converges almost perfectly in\na \"point\" on the negative z-axis at z ≈ −1500 km. Thus at a time\nof 1.08 s, ρmax = 4.52 * 108 g cm−3 and T max = 8.53 * 109 K\nare reached. These maximum values are comparable with the\nspherically symmetric case discussed at the beginning of this\nsection. The reason for this is the high degree of symmetry of\nthe colliding shock fronts. Astoundingly those maximum values\nare reached comparatively far away from the center in a region\nof relatively low initial density.\nThe initial condition considered in the last paragraph seems\nmore realistic than the more symmetric cases. Thus, this model\nwas studied also in simulations with higher numerical resolution.\nHere, a resolution dependence of the peak temperatures and densities became apparent – an effect that is discussed in Sect. 3.2\nbelow.\nFinally, a series of models with a different initial mass distribution was investigated. Sequence \"B\" corresponds to models with 0.9 M of C/O and 0.1 M of He and the parameters\ngiven in Table 3. They support the generality of the results discussed above. The dependence on the initial flame geometry is\nanalogous to case \"A\", but maximum densities and temperatures\nachieved are generally lower. This is consistent with the fact that\nthe shock waves originating from the He shell have to cross a\nlarger pressure gradient before they reach the center in model\n\"B\".7 Still, most of the models reach the conditions for core ignition described in Sect. 2.4 (the \"zr\" models did not ignite with\nmass distribution \"A\" either).\n7\nGeometrical amplification effects do not play a role at such big\nradii.\n\n3.2. A resolution study\n\nThe numerical resolution of the parameter study presented above\nwas relatively low with a spatial resolution of 23.2 km only.\nHence, for one of the most interesting models, z4.24A 2d 256,\nwe performed a resolution study. Globally, we found a good\nagreement of the temporal evolution of the state variables. But\nthe maximum densities and temperatures at the central shocks\ncollision showed a significant dependence on the numerical resolution of the simulation (see Fig. 6). With decreasing cell size\nthe maximum values increase almost exponentially. This trend\ncontinues down to the smallest tested cell width (7.4 km) and\nno indication for numerical convergence is found. Given that\nthe shock collision is an almost perfect spherically symmetric\nproblem, we reduced to one dimension in order to facilitate even\nhigher resolutions. The state variables on the r-axis of simulation s4.10A 2dq 256 at t = 0.25 s linearly interpolated to higher\nresolutions were taken as initial condition. The results of the corresponding one-dimensional runs with increasing resolution are\npresented in Fig. 7. It shows an analogous exponential increase\nof the temperature and density maxima down to a cell width of\n0.72 km. Below that value, however, the temperatures exceeded\nthe limits of our equation of state. Here, more micro-physical\nprocesses would have to be taken into account and could restrict\nfurther growth of density and temperature.\nBut even without this restriction, from analytical considerations it is clear that the density growth ratio must be limited, although it can get very big. In the idealized case of infinitely strong shock reflection at the origin in spherical geometry (and constant initial conditions of ρ0 (r) = 1, u0 (r) = −1,\n\n\f8\n\nM. Fink et al.: Double-detonation supernovae of sub-Chandrasekhar mass white dwarfs\nt = 0.40 s\n\nt = 0.70 s\n\n20\n\n5\n\nT 9 [K]\nρ8 [g cm−3 ]\n\nPSfrag replacements\n15\n\n4\n\nz [1000 km]\n\n3\n\nC+O\n\n0\n\nHe\n2\n\nρ [107 g cm−3 ]\n\n2\n\nmaximum value\n\n4\n\n10\n\n5\n\n-2\n\n0\n104\ncell width [m]\n\n103\n1\n-4\n\nplacements\n\n105\n\nFig. 6. Resolution study of the maxima in the central shock collision of model z4.24A 2d.\n\n-6\n\nPSfrag replacements\n0\n\n5\n\nt = 1.09 s\n\nt = 1.00 s\n\nT 10 [K]\nρ10 [g cm−3 ]\n\n4\n\nmaximum value\n\n4\n\nz [1000 km]\n\n2\n\n0\n\n3\n\n2\n\n1\n\n0\n\n-2\n\n102\n\n103\n\n104\n\n105\n\ncell width [m]\n\nFig. 7. One-dimensional resolution study of the maxima in the\ncentral shock collision of model s4.10A.\n\n-4\n\n-6\n0\n\n1\n\n2\n\n3\n\nr [1000 km]\n\n4\n\n5\n\n0\n\n1\n\n2\n\n3\n\nr [1000 km]\n\n4\n\n5\n\nFig. 5. Time evolution of the model z4.24A 2d 256.\n\u0010 \u00113\nand p0 (r) = 0), its value is γ+1\nafter the reflected shock\nγ−1\n(cf. Glaister 1988).8 Another problem that can be solved semianalytically is that of a spherical shock wave that starts from infinity, converges to the origin, and is reflected there (cf. Guderley\n1942; Landau & Lifschitz 1991; Ponchaut et al. 2006). While\nthe shock is moving inwards it grows in strength because of\nits surface decrease. Close enough to the center for the strong\n2(1−n)\nshock approximation to hold, it can be shown that p ∼ r− n ,\n1−n\nρ = const, and |u| ∼ r− n with n being a constant between 0\nand 1 that has to be numerically determined and depends only\non the ratio of specific heats γ. According to Landau & Lifschitz\n(1991), at the time of perfect focusing the density has increased\nby a factor of 20.1 for γ = 75 and the reflection is accompanied\n8\n\nFor an ultra-relativistic degenerate gas like in a WD's center γ =\n\u0010 \u00113\nholds in good approximation and thus γ+1\n= 73 = 343.\nγ−1\n\n4\n3\n\nby another increase by about a factor of 145. Thus a maximum\ncompression of about 2,900 can be achieved and in the case of\nγ = 34 , relevant in our case, those numbers are even bigger.\nIn our simulations the shock that propagates inwards into the\nWD due to the He detonation is followed by an extended wave of\nmatter that is also flowing inwards. Therefore the case might lie\nsomewhere in between these two idealized situations: The shock\nis amplified by the geometrical focusing effect and thus compresses a significant part of the core that is then burned at higher\ndensities. On the other hand the matter succeeding the in-flowing\nshock leads to even higher densities after the shock is reflected.\nTaking all those properties into account, it becomes clear why\nthe ignition conditions for a core detonation can be fulfilled so\nwell in our simulations. Provided that the shock is symmetric\nenough also an off-center ignition at a point with much smaller\ninitial density like in model z4.24A 2d 256 is possible in this\nscenario.\nAs the minimum shock surface that we can reach depends\non the grid resolution, the maximum temperature and density\nvalues that are achieved through the geometric amplification in\nthe shock implosion naturally also do so. In our simulations a\nsuccessful second detonation ignition thus depends on the reso-\n\n\fM. Fink et al.: Double-detonation supernovae of sub-Chandrasekhar mass white dwarfs\n\nTable 4. Results of three complete double detonation simulations. All nucleosynthetic abundances are given in solar masses.\nplacementsMloss is the mass loss over the grid boundaries.\n\n24A 2d 128\n\nModel\nz4.24A 2d 128\nz4.24A 3d 128\ns4.10A 2dq 128\n\n12\n\nC+16 O\n0.01\n0.01\n0.02\n\n56\n\nNi\n0.40\n0.45\n0.41\n\n28\n\nSi\n0.51\n0.50\n0.50\n\nMloss\n0.08\n0.05\n0.08\n\n1.0\n\nM [M ]\n\n0.8\n\nC/O\nNi\nHeNSE\nSi\nHeshell\nMtot\n\n0.6\n\n0.4\n\n0.2\n\n0.0\n0.0\n\n0.5\n\n1.0\n\n1.5\n\n2.0\n\nt [s]\n\nFig. 8. Time evolution of the mass fractions of model\nz4.24A 2d 128.\nlution and it seems likely that all the models in Table 3 would\nexplode provided that they were well enough resolved.\nTherefore, the results given in Table 3 have to be interpreted\nas a conservative estimate of the possibility of a detonation ignition. If at a certain grid resolution the ignition conditions are\nfulfilled, a second core detonation must happen. However, if the\nignition conditions are not fulfilled a core detonation can still not\nbe excluded and might be achieved with increasing resolution9 .\n3.3. Three double-detonation supernova simulations\n\nAs a first step to compare the simulations of sub-Chandrasekhar\nmass models with actual SN Ia observations, measurable quantities like the nucleosynthetic abundances of an explosion have to\nbe determined. To this end, two complete double detonations of\nmodel z4.24A until t = 2.0 s have been simulated. One of them\nwas set up in 3D with 2563 cells for the full WD. For comparison with previous results, the second, 2D rotationally symmetric\nsimulation was also done with this low resolution (128 × 256\ncells).\nIn order to test the influence of symmetry in the initial flame\nconfiguration in the He shell on the explosion abundances, besides these maximally asymmetric cases a 2D double detonation of the spherically symmetric model s4.10A was also simulated. The results of all three simulations are given in Table 4.\nFor model z4.24A 2d 128 also the time evolution of the mass\nfractions of the species is plotted in Fig. 8 and will be discussed\nin the following.\nAt first, the 4 He in the shell is burnt completely to 56 Ni. But\nthe mass of the latter is somewhat reduced due to some mass\nloss through the boundaries of the computational domain. This is\nclearly visible also in the decrease of the total mass. The reason\nfor this is that the co-expanding grid was set up to track a mass\nshell at 0.85 M . Since the matter above this shell expands with a\n9\nNote that in this case the minimum detonator volume may be the\nlimiting constraint.\n\n9\n\nlarger velocity, some of it leaves the numerical grid. The tracking\nof a bigger mass shell would reduce this mass loss, but it would\nalso reduce the resolution of the colliding shocks in the core.\nAfter about 1.2 s the collision of the shock waves resulting\nfrom the He detonation gives rise to conditions for a detonation\nin the C + O core. In the corresponding grid zones, this detonation was artificially triggered by setting up a second level set. At\nthe high densities near the center the C/O mixture is burnt completely to 56 Ni in NSE with a small amount of 4 He. But the 4 He\nrecombines to 56 Ni after a short time due to the density decrease\ncaused by expansion. Farther away from the center at smaller\ndensities the burning product is 28 Si and some low-density matter at the border of the core remains unburnt. In this way 0.40 M\nof 56 Ni and 0.51 M of 28 Si are produced after about 1.5 s and\n0.01 M of C/O remain unburnt.\nThe results of the 3D case z4.24A 3d 128 are very similar to\nthe 2D one. However, 0.05 M more 56 Ni were produced. The\nmain reason for this difference is the loss of different amounts of\nmass over the boundaries of the computational domain, which\namounted to 0.08 M in 2D and only 0.05 M in 3D. The explanation for the smaller mass loss is a simple geometric effect: In\n3D cartesian coordinates there is more volume outside the star\nthat lies on the numerical grid than in 2D cylinder coordinates.\nFor example, the largest\n√ distance from the center is the length of\nthe space diagonal ( 3 a, when a is the side length),\n√ whereas in\n2D it is the length of the diagonal in the rz-plane ( 2 a).\nDue to the spherical symmetry in the model s4.10A 2dq 128\nHe burning and shock convergence are faster. Therefore all the\nreactions finish already after about one second, but according to\nTable 4, almost the same nucleosynthetic abundances are produced. This indicates that the density distribution in the core in\ncase of shocks converging asymmetric to the density distribution\ndiffers only slightly from the perfect spherical symmetric case.\nAs the now following core detonation propagates supersonic, the\nfinal abundances are independent of the position of the ignition\npoint.\nIn all three cases considered the 56 Ni-mass and with it the\nexplosion energy are rather large. In fact, they reach the range\nof (weaker) normal SNe Ia. However, these numbers have to be\ntaken with care since the density limit of 3 * 107 g cm−3 adopted\nhere for separating burning of C/O to 56 Ni and 28 Si, respectively,\nis quite uncertain, but will have an impact on the final abundances.\nWe could not calculate synthetic spectra or light curves of\nour simulations yet. First order spectra and light curves are\ngiven, e.g., in Livne & Arnett (1995) for models very similar to our z4.24A case. For comparison with their results\nthe distributions of the species of models z4.24A 2d 128 and\ns4.10A 2dq 128 in radial velocity space (averaged over all angles) are presented in Fig. 9. Both are very similar except for a\nminor difference in the unburnt C/O, which is more abundant in\nthe spherically symmetric case. The velocity ranges are comparable to model 6 of Livne & Arnett (1995), which had a similar\nsetup (MC/O = 0.8 M , MHe = 0.17 M ), but resulted in a larger\n56\nNi mass (0.648 M ). Also, the maximum velocity of 56 Ni and\nthe minimum velocity of 28 Si from core burning are shifted to\nsignificantly larger values. This could be caused by a difference\nin the transition density to NSE that might also be responsible\nfor the difference in 56 Ni mass.\nIn order to test possible asphericities of the ejecta in model\nz4.24A 2d 128 the abundances are plotted separately for the z-,\nr-, and −z-directions in Fig. 10. Despite the off-center explosion,\nthe differences in the velocity distribution are minor. Only in −z-\n\n\f10\n\nM. Fink et al.: Double-detonation supernovae of sub-Chandrasekhar mass white dwarfs\n1.0\nNi\n\nXi\n\n0.8\n\nNi\n\nSi\n\n0.6\n0.4\n0.2\n0.0\n\nC/O\n0\n\n10\n\n20\n\n30\n\nvrad [1000 km s−1 ]\n\nXi,−z\n\nXi,r\n\nXi,z\n\nlacements\n\nFig. 9. Mass fractions of the species (averaged over all angles) of\nmodels z4.24A 2d 128 (solid line) and s4.10A 2dq 128 (dashed\nline) in radial velocity space at t = 10 s.\n1.0\n0.8\n0.6\n0.4\n0.2\n0.0\n\nNi\n\nNi\n\nSi\n\nC/O\n\n1.0\n0.8\n0.6\n0.4\n0.2\n0.0\n\nNi\n\nNi\n\nSi\n\nC/O\n\n1.0\n0.8\n0.6\n0.4\n0.2\n0.0\n\nNi\n\nSi\n\nNi\n\nC/O\n0\n\n10\n\n20\n\n30\n\nv [1000 km s−1 ]\n\nFig. 10. Mass fractions of the species of model z4.24A 2d 128\nin velocity space along the z-, r-, and negative z-direction at t =\n10 s.\ndirection a shift in the maximum velocities of the 56 Ni from the\ncore detonation and of the 28 Si is visible.\n\n4. Summary and conclusions\nWe have studied the sub-Chandrasekhar model of SNe Ia\nby means of a series of two-dimensional and a few threedimensional simulations with different initial conditions. The\nnumerical scheme used is based on the PPM algorithm, and\nthe propagation of the detonation front is modeled applying\nthe level set technique. This novel implementation allowed for\nan accurate treatment of the hydrodynamic features of the subChandrasekhar model (such as shock waves and thin detonation\nfronts) in multiple dimensions.\nWith our generic 1-M model we performed a parameter\nstudy involving different He masses and ignition geometries of\nthe initial He detonation. We find that a detonation in the He\nshell can clearly trigger a second detonation in the core and at\nleast for the mass configurations studied, the double detonation\nseems to be a very robust process, which works without any\n\"fine-tuning\" of our model parameters. In almost all of the simulations performed, the ignition conditions for a core detonation\nwere reached at or near the center of the WD as a result of the\nconvergence of the shock from the He shell detonation and in\nthe few other cases the failure is likely a result of the finite nu-\n\nmerical resolution. The high maximum densities and temperatures that are needed for detonation ignition and the fact that the\nshock is not diluted too much when propagating inwards against\nthe pressure gradient are made possible through a geometrical\nshock amplification effect that appears in spherical symmetry:\nAs the surface of the shock decreases its strength has to increase.\nThe high compression that can be achieved theoretically in this\nway, especially if full convergence is reached and the shock is\nreflected (cf. Sect. 3.2), could even allow successful double detonations with considerably smaller He masses. The shock amplification that is reached, however, turns out to be resolution\ndependent on the numerical grid as it is coupled to the smallest resolvable shock surface. Taking this into account it is very\nlikely that all our models would explode, if they were simulated\nwith sufficiently high resolution.\nThe question of whether an incineration could also happen\ndirectly at the core–shell interface, was not addressed here. This\ncould of course prevent the spherical shock convergence mechanism from playing a role, at least in parts of the parameter space.\nTherefore, edge-lit detonations are postponed to a separate study.\nThe complete double detonation simulations that were performed for the models z4.24A and s4.10A resulted in 56 Nimasses of about 0.40 to 0.45 M . Are the studied events thus\ngood candidates for normal SNe Ia? Most likely not. Starting\nwith a He-shell detonation, all of our models show a significant amount of rapidly expanding 56 Ni in the outer layers. In the\nobserved spectra of normal and sub-luminous events, however,\nthis has never been observed (cf. Branch et al. (1982); Branch\n(1984); Woosley et al. (1986); Arnett (1997) and also the discussion in Livne & Arnett (1995)). The only exception is the superluminous SN 1991T. Thus our solar-mass models most likely\nwill not be able to explain normal or sub-luminous SNe Ia and,\ngiven the robustness of the explosion mechanism of the model,\nthe only conceivable explanation for the lack of observations of\ncorresponding SN Ia events is that the progenitors are not realized in nature – or are very rare.\nFor a better agreement with observations a reduction of the\nHe-shell mass would be the most obvious choice. However, then\na significantly larger core mass would most likely be required,\nbecause otherwise the He would not detonate. In this case the\ncore density would be much higher resulting in a very large Ni\nmass. This would again not be a candidate for normal SNe Ia,\nbut it might be a promising candidate for objects like SN 1991T.\nFurther work could cover model improvements like a more\nrealistic treatment of nuclear reactions including the calculation\nof real reaction rates depending on the actual thermodynamic\nstate of the burnt matter. This would make an investigation of the\nonset and the explosion dynamics of the core detonation possible. Also, more extended parameter studies, especially towards\nthe lower end of possible He masses, would be interesting. For a\ncomparison with observations the calculation of synthetic light\ncurves and spectra would also be desirable.\nAcknowledgements. We want to thank Konstantinos Kifonidis who helped with\nthe implementation of the Marquina solver and Ewald Müller for many helpful\ndiscussions. Moreover we want to thank Eli Livne for very constructive comments on the first version of this paper. The simulations presented here were carried out at the Computer Center of the Max Planck Society, Garching, Germany.\nThis work was supported by the Deutsche Forschungsgemeinschaft via the\nTransregional Collaborative Research Center TRR 33 \"The Dark Universe\".\n\nReferences\nArnett, D. 1997, in NATO ASIC Proc. 486: Thermonuclear Supernovae, ed.\nP. Ruiz-Lapuente, R. Canal, & J. Isern, 405\n\n\fM. Fink et al.: Double-detonation supernovae of sub-Chandrasekhar mass white dwarfs\nBenz, W. 1997, in NATO ASIC Proc. 486: Thermonuclear Supernovae, ed.\nP. Ruiz-Lapuente, R. Canal, & J. Isern, 457\nBlinnikov, S. I. & Khokhlov, A. M. 1986, Soviet Astronomy Letters, 12, 131\nBranch, D. 1984, New York Academy Sciences Annals, 422, 186\nBranch, D., Buta, R., Falk, S. W., et al. 1982, ApJ, 252, L61\nBranch, D., Livio, M., Yungelson, L. R., Boffi, F. R., & Baron, E. 1995, PASP,\n107, 1019\nColella, P. & Glaz, H. M. 1985, Journal of Computational Physics, 59, 264\nColella, P. & Woodward, P. R. 1984, Journal of Computational Physics, 54, 174\nCourant, R. & Friedrichs, K. O. 1948, Supersonic flow and shock waves (Pure\nand Applied Mathematics, New York: Interscience, 1948)\nDonat, R. & Marquina, A. 1996, Journal of Computational Physics, 125, 42\nFryxell, B. A., Müller, E., & Arnett, W. D. 1989, MPA Preprint, 449\nGamezo, V. N., Khokhlov, A. M., & Oran, E. S. 2004, Physical Review Letters,\n92, 211102\nGamezo, V. N., Khokhlov, A. M., Oran, E. S., Chtchelkanova, A. Y., &\nRosenberg, R. O. 2003, Science, 299, 77\nGarcı́a-Senz, D., Bravo, E., & Woosley, S. E. 1999, A&A, 349, 177\nGlaister, P. 1988, International Journal for Numerical Methods in Fluids, 8, 97\nGolombek, I. & Niemeyer, J. C. 2005, A&A, 438, 611\nGuderley, G. 1942, Luftfahrtforschung, 19, 302\nHan, Z. & Podsiadlowski, P. 2004, MNRAS, 350, 1301\nImshennik, V. S. & Khokhlov, A. M. 1984, Soviet Astronomy Letters, 10, 262\nKhokhlov, A. M. 1991, A&A, 246, 383\nLandau, L. D. & Lifschitz, E. M. 1991, Hydrodynamik (Lehrbuch der theoretischen Physik, Akademie-Verlag, 1991)\nLivio, M. 2000, in Type Ia Supernovae, Theory and Cosmology. Edited by J. C.\nNiemeyer and J. W. Truran. Published by Cambridge University Press, 2000.,\np.33, ed. J. C. Niemeyer & J. W. Truran, 33\nLivne, E. 1990, ApJ, 354, L53\nLivne, E. 1997, in NATO ASIC Proc. 486: Thermonuclear Supernovae, ed.\nP. Ruiz-Lapuente, R. Canal, & J. Isern, 425\nLivne, E. & Arnett, D. 1995, ApJ, 452, 62\nLivne, E. & Glasner, A. S. 1990, ApJ, 361, 244\nLivne, E. & Glasner, A. S. 1991, ApJ, 370, 272\nMazzali, P. A., Röpke, F. K., Benetti, S., & Hillebrandt, W. 2007, Science, 315,\n825\nMulder, W., Osher, S., & Sethian, J. A. 1992, Journal of Computational Physics,\n100, 209\nNapiwotzki, R., Karl, C. A., Nelemans, G., et al. 2005, in Astronomical Society\nof the Pacific Conference Series, Vol. 334, 14th European Workshop on White\nDwarfs, ed. D. Koester & S. Moehler, 375\nNiemeyer, J. C. & Woosley, S. E. 1997, ApJ, 475, 740\nNomoto, K., Uenishi, T., Kobayashi, C., et al. 2003, in From Twilight to\nHighlight: The Physics of Supernovae, ed. W. Hillebrandt & B. Leibundgut,\n115\nOsher, S. & Sethian, J. A. 1988, Journal of Computational Physics, 79, 12\nParthasarathy, M., Branch, D., Jeffery, D. J., & Baron, E. 2007, New Astronomy\nReview, 51, 524\nPlewa, T., Calder, A. C., & Lamb, D. Q. 2004, ApJ, 612, L37\nPonchaut, N. F., Hornung, H. G., Pullin, D. I., & Mouton, C. A. 2006, Journal of\nFluid Mechanics, 560, 103\nReinecke, M., Hillebrandt, W., & Niemeyer, J. C. 1999a, A&A, 347, 739\nReinecke, M., Hillebrandt, W., & Niemeyer, J. C. 2002a, A&A, 386, 936\nReinecke, M., Hillebrandt, W., & Niemeyer, J. C. 2002b, A&A, 391, 1167\nReinecke, M., Hillebrandt, W., Niemeyer, J. C., Klein, R., & Gröbl, A. 1999b,\nA&A, 347, 724\nReinecke, M. A. 2001, PhD thesis, Technical University of Munich\nRöpke, F. K. & Hillebrandt, W. 2005, A&A, 431, 635\nRöpke, F. K., Hillebrandt, W., & Niemeyer, J. C. 2004a, A&A, 420, 411\nRöpke, F. K., Hillebrandt, W., & Niemeyer, J. C. 2004b, A&A, 421, 783\nRöpke, F. K., Hillebrandt, W., Niemeyer, J. C., & Woosley, S. E. 2006, A&A,\n448, 1\nRöpke, F. K., Hillebrandt, W., Schmidt, W., et al. 2007a, ArXiv Astrophysics\ne-prints, 707\nRöpke, F. K. & Niemeyer, J. C. 2007, A&A, 464, 683\nRöpke, F. K., Niemeyer, J. C., & Hillebrandt, W. 2003, ApJ, 588, 952\nRöpke, F. K., Woosley, S. E., & Hillebrandt, W. 2007b, ApJ, 660, 1344\nRuiz-Lapuente, P., Blinnikov, S., Canal, R., et al. 2000, Memorie della Societa\nAstronomica Italiana, 71, 435\nSchmidt, W. & Niemeyer, J. C. 2006, A&A, 446, 627\nSchmidt, W., Niemeyer, J. C., Hillebrandt, W., & Röpke, F. K. 2006, A&A, 450,\n283\nSharpe, G. J. 1999, MNRAS, 310, 1039\nSmiljanovski, V., Moser, V., & Klein, R. 1997, Combustion Theory Modelling,\n1, 183\nStritzinger, M., Leibundgut, B., Walch, S., & Contardo, G. 2006, A&A, 450, 241\nWiggins, D. J. R. & Falle, S. A. E. G. 1997, MNRAS, 287, 575\n\n11\n\nWiggins, D. J. R., Sharpe, G. J., & Falle, S. A. E. G. 1998, MNRAS, 301, 405\nWoosley, S. E. 1990, Type I Supernovae: Carbon Deflagration and Detonation,\ned. A. G. Petschek (New York: Springer-Verlag), 182\nWoosley, S. E., Taam, R. E., & Weaver, T. A. 1986, ApJ, 301, 601\nWoosley, S. E. & Weaver, T. A. 1994, ApJ, 423, 371\n\nList of Objects\n'SN 1991bg' on page 1\n'SN 1991T' on page 10\n'SN 1991T' on page 10\n\n\f"}