{"id": "http://arxiv.org/abs/1006.3570v3", "guidislink": true, "updated": "2010-10-19T00:27:15Z", "updated_parsed": [2010, 10, 19, 0, 27, 15, 1, 292, 0], "published": "2010-06-17T21:16:05Z", "published_parsed": [2010, 6, 17, 21, 16, 5, 3, 168, 0], "title": "Electroweak Symmetry Breaking from Gauge/Gravity Duality", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1006.1770%2C1006.1217%2C1006.4916%2C1006.2604%2C1006.3112%2C1006.3570%2C1006.0948%2C1006.0258%2C1006.1124%2C1006.2578%2C1006.5152%2C1006.1651%2C1006.5564%2C1006.1301%2C1006.2686%2C1006.0494%2C1006.4434%2C1006.5931%2C1006.4248%2C1006.5179%2C1006.0455%2C1006.4591%2C1006.3564%2C1006.0139%2C1006.4231%2C1006.4325%2C1006.3785%2C1006.1497%2C1006.3241%2C1006.1452%2C1006.0655%2C1006.2174%2C1006.0573%2C1006.5382%2C1006.4554%2C1006.0752%2C1006.3594%2C1006.1964%2C1006.3129%2C1006.1853%2C1006.0311%2C1006.4860%2C1006.1701%2C1006.2480%2C1006.2404%2C1006.3454%2C1006.2503%2C1006.4945%2C1006.5451%2C1006.2428%2C1006.4433%2C1006.1082%2C1006.3602%2C1006.5777%2C1006.3623%2C1006.2525%2C1006.4938%2C1006.0891%2C1006.3946%2C1006.3634%2C1006.1777%2C1006.3155%2C1006.2443%2C1006.2104%2C1006.2841%2C1006.0873%2C1006.0946%2C1006.1881%2C1006.0951%2C1006.3482%2C1006.4007%2C1006.5117%2C1006.3961%2C1006.4148%2C1006.5792%2C1006.4996%2C1006.0360%2C1006.1245%2C1006.3771%2C1006.1506%2C1006.3156%2C1006.5180%2C1006.4160%2C1006.3558%2C1006.4275%2C1006.0344%2C1006.5695%2C1006.3670%2C1006.0389%2C1006.1180%2C1006.5942%2C1006.0226%2C1006.4305%2C1006.5791%2C1006.3325%2C1006.2645%2C1006.1304%2C1006.1210%2C1006.2438%2C1006.4616%2C1006.2633&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Electroweak Symmetry Breaking from Gauge/Gravity Duality"}, "summary": "We use the gauge/gravity duality to study a model of walking technicolor. The\nlatter is a phenomenologically promising framework for dynamical electroweak\nsymmetry breaking. A traditional problem for technicolor models has been the\nneed to address gauge theories at strong coupling. Recent developments in\ngauge/gravity duality provide a powerful tool for handling this problem. First,\nwe revisit previously considered holographic models of QCD-like technicolor\nfrom D-branes. In particular, we develop analytical understanding of earlier\nnumerical computations of the Peskin-Takeuchi S-parameter. Then we apply this\nmethod to the investigation of a model of walking technicolor, obtained by\nembedding D7 - anti-D7 probe branes in a recently discovered type IIB\nbackground dual to walking behaviour. As a necessary step, we also show that\nthere is an embedding of the techniflavor branes, that realizes chiral symmetry\nbreaking. Finally, we show that the divergences that appear in the S-parameter\ncan be removed by using holographic renormalization.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1006.1770%2C1006.1217%2C1006.4916%2C1006.2604%2C1006.3112%2C1006.3570%2C1006.0948%2C1006.0258%2C1006.1124%2C1006.2578%2C1006.5152%2C1006.1651%2C1006.5564%2C1006.1301%2C1006.2686%2C1006.0494%2C1006.4434%2C1006.5931%2C1006.4248%2C1006.5179%2C1006.0455%2C1006.4591%2C1006.3564%2C1006.0139%2C1006.4231%2C1006.4325%2C1006.3785%2C1006.1497%2C1006.3241%2C1006.1452%2C1006.0655%2C1006.2174%2C1006.0573%2C1006.5382%2C1006.4554%2C1006.0752%2C1006.3594%2C1006.1964%2C1006.3129%2C1006.1853%2C1006.0311%2C1006.4860%2C1006.1701%2C1006.2480%2C1006.2404%2C1006.3454%2C1006.2503%2C1006.4945%2C1006.5451%2C1006.2428%2C1006.4433%2C1006.1082%2C1006.3602%2C1006.5777%2C1006.3623%2C1006.2525%2C1006.4938%2C1006.0891%2C1006.3946%2C1006.3634%2C1006.1777%2C1006.3155%2C1006.2443%2C1006.2104%2C1006.2841%2C1006.0873%2C1006.0946%2C1006.1881%2C1006.0951%2C1006.3482%2C1006.4007%2C1006.5117%2C1006.3961%2C1006.4148%2C1006.5792%2C1006.4996%2C1006.0360%2C1006.1245%2C1006.3771%2C1006.1506%2C1006.3156%2C1006.5180%2C1006.4160%2C1006.3558%2C1006.4275%2C1006.0344%2C1006.5695%2C1006.3670%2C1006.0389%2C1006.1180%2C1006.5942%2C1006.0226%2C1006.4305%2C1006.5791%2C1006.3325%2C1006.2645%2C1006.1304%2C1006.1210%2C1006.2438%2C1006.4616%2C1006.2633&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We use the gauge/gravity duality to study a model of walking technicolor. The\nlatter is a phenomenologically promising framework for dynamical electroweak\nsymmetry breaking. A traditional problem for technicolor models has been the\nneed to address gauge theories at strong coupling. Recent developments in\ngauge/gravity duality provide a powerful tool for handling this problem. First,\nwe revisit previously considered holographic models of QCD-like technicolor\nfrom D-branes. In particular, we develop analytical understanding of earlier\nnumerical computations of the Peskin-Takeuchi S-parameter. Then we apply this\nmethod to the investigation of a model of walking technicolor, obtained by\nembedding D7 - anti-D7 probe branes in a recently discovered type IIB\nbackground dual to walking behaviour. As a necessary step, we also show that\nthere is an embedding of the techniflavor branes, that realizes chiral symmetry\nbreaking. Finally, we show that the divergences that appear in the S-parameter\ncan be removed by using holographic renormalization."}, "authors": ["Lilia Anguelova"], "author_detail": {"name": "Lilia Anguelova"}, "author": "Lilia Anguelova", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.nuclphysb.2010.10.007", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1006.3570v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1006.3570v3", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "33 pages; minor clarification, references added, journal version", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1006.3570v3", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1006.3570v3", "journal_reference": "Nucl.Phys.B843:429-454,2011", "doi": "10.1016/j.nuclphysb.2010.10.007", "fulltext": "arXiv:1006.3570v3 [hep-th] 19 Oct 2010\n\nElectroweak Symmetry Breaking from\nGauge/Gravity Duality\nLilia Anguelova\nDepartment of Physics\nUniversity of Cincinnati, Cincinnati OH 45221, USA\nanguella@ucmail.uc.edu\n\nAbstract\nWe use the gauge/gravity duality to study a model of walking technicolor.\nThe latter is a phenomenologically promising framework for dynamical electroweak symmetry breaking. A traditional problem for technicolor models has\nbeen the need to address gauge theories at strong coupling. Recent developments in gauge/gravity duality provide a powerful tool for handling this problem. First, we revisit previously considered holographic models of QCD-like\ntechnicolor from D-branes. In particular, we develop analytical understanding\nof earlier numerical computations of the Peskin-Takeuchi S-parameter. Then\nwe apply this method to the investigation of a model of walking technicolor,\nobtained by embedding D7-D7 probe branes in a recently discovered type IIB\nbackground dual to walking behaviour. As a necessary step, we also show\nthat there is an embedding of the techniflavor branes, that realizes chiral symmetry breaking. Finally, we show that the divergences that appear in the\nS-parameter can be removed by using holographic renormalization.\n\n\fContents\n1 Introduction\n\n1\n\n2 Technicolor from holography\n\n3\n\n2.1 S-parameter: generalities . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n\n4\n\n2.2 Holographic S-parameter formula . . . . . . . . . . . . . . . . . . . . . . .\n\n6\n\n3 Regular technicolor: example\n\n8\n\n3.1 D-brane set-up . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n\n9\n\n3.2 S-parameter . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 10\n4 Walking technicolor\n\n14\n\n4.1 Gravity background . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 14\n4.2 D7-brane probes\n\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 15\n\n4.3 S-parameter . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 18\n4.3.1\n\nV vs A modes . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 19\n\n4.3.2\n\nSmall q 2 solution . . . . . . . . . . . . . . . . . . . . . . . . . . . . 20\n\n4.3.3\n\nRelation to general solution . . . . . . . . . . . . . . . . . . . . . . 23\n\n4.4 Renormalization . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 25\n5 Discussion\n\n1\n\n28\n\nIntroduction\n\nUnderstanding electroweak symmetry breaking (EWSB), or equivalently the origin of\nmass, is a great challenge for phenomenology. In the Standard Model, EWSB is achieved\nvia a fundamental scalar, the Higgs boson. Although conceptually simple, this possibility\nleads to well-known problems. More precisely, the masses of scalar fields are destabilized\nby quantum corrections and, even when stabilization is achieved via supersymmetry, there\nis an unnaturally large hierarchy between the electroweak and Planck scales. An appealing\nalternative to the Higgs boson is provided by the possibility of dynamical chiral symmetry\nbreaking [1]; models that explore that idea are known as technicolor models.\nThe original technicolor proposals were simply scaled-up versions of QCD and so were\nincompatible with electroweak precision measurements [2]. However, later models [3],\ncalled walking technicolor as the relevant gauge couplings run slower than in QCD, are\n\n1\n\n\fconsidered phenomenologically viable; for a pedagogical recent review, see [4].1 A common\nproblem, though, for all kinds of technicolor models is that the relevant physics occurs\nat strong coupling. Therefore, a direct field theory computation of various quantities\nof interest is not possible and so the present experimental bounds are insufficient to\ndistinguish between a Higgs boson and a walking technicolor sector. Here we will address\nthis problem by using a powerful recently-developed tool for studying gauge theories at\nstrong coupling. Namely, we will utilize the gauge/gravity duality to study a model of\nwalking technicolor.\nHolographic models of regular technicolor2 have been considered in [6]. These authors\nuse D-brane configurations, very similar to the one giving the holographic QCD model\nof Sakai and Sugimoto [7, 8], in order to realize chiral symmetry breaking.3 This is then\ntranslated to electroweak symmetry breaking via an appropriate embedding of the electroweak SU(2) × U(1) group into the techniflavor one. In this class of models one can\n\ncompute the Peskin-Takeuchi S-parameter [2], that is an important electroweak observ-\n\nable. In [6], this computation was performed numerically. Before turning to walking\ntechnicolor, we will first revisit the above regular technicolor considerations with a more\nanalytical approach. This will enable us to gain a better understanding of the situation.\nAnd also, it will be a useful preparation for the more involved new case.\nTo obtain a gravity dual of walking technicolor in the vein of [6], we need, first, a\ngravitational background that is dual to a walking gauge theory and, second, a U-shaped\nD-brane embedding as in [7], in order to achieve geometrical realization of chiral symmetry\nbreaking. Fortunately, it was shown recently [10] that a suitable background is provided\nby one of the type IIB solutions found in [11]. The latter are deformations of the original\nMaldacena-Nunez background [12], which still arise from D5 branes wrapping an S 2 . In\nthis gravity dual of walking behaviour [10], we will consider D7-D7 probes and show that\nthere is an embedding of a U-shape type a la Sakai-Sugimoto. Using this set-up as our\nmodel of walking technicolor, we will then compute the S-parameter with the methods\nwe developed for the regular technicolor case.\nIn the walking case, it will turn out that the answer for the S-parameter needs to be\nrenormalized. This is, perhaps, not surprising since the Maldacena-Nunez background\nhas long been known to lead to divergences. The novelty, however, is that, due to recent\n1\n\nWe should note the important role of [5] in the recent renewal of interest in walking technicolor.\nBy 'regular' we mean the original QCD-like version, and not walking technicolor.\n3\nWe should note that there is a large amount of work on a class of holographic technicolor models\n2\n\n(loosely) inspired by AdS/CFT [9], which however cannot be consistently embedded in string theory.\n\n2\n\n\fadvances [13] in the program of holographic renormalization [14], the background of interest for us can be renormalized. More importantly, we will renormalize the probe D7\nbrane action, that we need, by adding an appropriate counterterm. This will then enable\nus to extract a finite answer for the renormalized S-parameter. Our analytical result gives\nus interesting insights. However, a numerical prediction for the value of S is hindered by\nthe presence of a set of constants, that can only be fixed by numerical methods. The\ndetermination of those constants is work in progress [15].\nThe present paper is organized as follows. In Section 2, we give a brief overview of\nthe holographic construction of technicolor models from D-brane configurations in string\ntheory. Furthermore, we review and slightly revise the computation of the S-parameter in\nthis class of models. In Section 3, we consider a model of regular technicolor, obtained by\nplacing D7-D7 probes in the conifold. We develop an analytical approach to solving the\nequations that determine the S-parameter, which gives us better insight into the numerical\nresults of [6]. In Section 4, we study a walking technicolor model obtained by embedding\nD7-D7 probes in the background of [10]. We use our new approach to extract an analytical\nanswer for S. However, the latter turns out to contain IR divergences, that are the gravity\ndual of field theory UV divergences. So we add an appropriate counterterm and compute\nthe renormalized S-parameter. Finally, in Section 5 we discuss open issues and future\nresearch directions.\n\n2\n\nTechnicolor from holography\n\nThe basic idea is the following. Let us consider a type II gravity background created by a\ncertain number NT C of Dq-branes and embed in it NT F probe Dp-Dp branes. If there is an\nembedding of the probe branes of a U-shape form, like in the Sakai-Sugimoto holographic\nQCD model [7], then one has a geometric realization of chiral symmetry breaking. Namely,\nthe techniflavor group UL (NT F ) × UR (NT F ), corresponding to separate Dp and Dp branes,\n\nis broken to the diagonal subgroup U(NT F ) because of the joining of the Dp and Dp at a\ncertain position along the radial direction. Now, upon an appropriate embedding of the\nelectroweak SU(2) × U(1) into UL (NT F ) × UR (NT F ), the above chiral symmetry breaking\n\ntranslates into electroweak symmetry breaking. In the first two references of [6], the\ntechnicolor branes were D4-branes and the techniflavor probes were D8-D8 as in [7]. The\n\nlast reference in [6] considered several set-ups in both type IIA and type IIB.4 To obtain\n4\n\nAlthough such models, being dual descriptions of regular technicolor, naturally lead to unrealistically\n\nlarge values of the S-parameter, see [16] for recent progress in the direction of reducing somewhat the\n\n3\n\n\fa model of walking technicolor, we will embed D7-D7 probes in the background of [10].\nSince our main concern will be the S-parameter, let us now recall its holographic\ncomputation. We will mostly follow the last reference in [6], whose general treatment\nencompasses the rest of the references there. However, we will be a bit more careful than\n[6] and so will obtain a slightly different formula.\n\n2.1\n\nS-parameter: generalities\n\nThe Peskin-Takeuchi S-parameter [2] is defined as:\nS = −4π\n\nd\n(ΠV − ΠA )\ndq 2\n\nq 2 =0\n\n,\n\n(2.1)\n\nwhere ΠV and ΠA are the vector and axial-vector current two-point functions. It is wellknown that the above expression can be rewritten as the following sum over vector and\naxial-vector resonances:\nS = 4π\n\nX \u0012 gV2\n\nn\n\nn\n\nm4Vn\n\ng2\n− A4n\nmAn\n\n\u0013\n\n.\n\n(2.2)\n\nLet us assume that we have found a U-shape embedding of probe Dp-Dp branes into the\nbackground created by the technicolor ones. To compute the masses and decay constants\nin (2.2), consider the DBI action of the probe Dp-branes:\nZ\np\nSDBI = −T d4 x dρ dΩp−4 e−φ − det(gab + 2πα′ Fab ) ,\n\n(2.3)\n\nwhere a, b = 0, 1, ..., p; gab is the induced metric, Fab is the world-volume (for us, techni-\n\nflavor) field strength, ρ is the radial direction, Ωp−4 are the compact internal directions\nwrapped by the Dp brane and, finally, φ is the dilaton. To leading (i.e., quadratic) order\nin Fab this action is:\nSDBI = −T\n\nZ\n\nd4 x dρ dΩp−4 e−φ\n\nq\n\n− det(gp+1) Trg ab g cdFac Fbd .\n\n(2.4)\n\nUsing the solution for the Dp profile and integrating over the world volume directions\nparametrized by Ωp−4 , we obtain an action of the form:\nZ\nκ\nSDBI = −\nd4 x dρ [a(ρ)Fμν F μν + 2b(ρ)Fμρ F μ ρ ] ,\n4\n\n(2.5)\n\nwhere μ, ν = 0, 1, 2, 3 and we assume (−, +, +, ...) space-time signature. Furthermore,\nκ=\n\nT (2πα′ )2 Vp−4\ngs\n\nwith Vp−4 being the volume of the compact cycle wrapped by the Dp probe\n\nS-parameter value within the context of the Sakai-Sigimoto-like D4/D8 brane set-up.\n\n4\n\n\fbrane and the functions a(ρ) and b(ρ) arise from the ρ-dependence of the determinant\nand of the inverse of the induced metric in (2.4).\nNow, we want to solve the field equations that follow from the action (2.5). For\nconvenience, we will use the gauge Aρ (x, ρ) = 0. Let us Fourier transform the gauge\npotential Aμ (x, ρ) in the coordinates xμ and expand:\nAμ (q, ρ) = Vμ (q)ψV0 (q 2 , ρ) + Aμ (q)ψA0 (q 2 , ρ) +\n\nX\nn\n\n\u0001\nVμn (q)ψVn (ρ) + Anμ (q)ψAn (ρ) , (2.6)\n\nwhere the terms containing ψV0 and ψA0 are non-normalizable modes, that correspond to\nsources for the vector and axial-vector boundary currents respectively, whereas the terms\nin the sum over n are the normalizable modes that correspond to the bulk gauge fields.\nWe have divided these terms into vector and axial-vector ones in the following manner.\nAs in the Sakai-Sugimoto model [7], parity in the field theory is related to reflection\non the flavor-brane embedding about the point ρ = ρ0 at which the Dp and Dp stacks\njoin. Hence the vector modes, ψVn , are those that are symmetric w.r.t. reflection around\nρ0 and the axial-vector modes, ψAn , are those that are anti-symmetric. In order for\nthe four-dimensional action to be canonically normalized, the modes have to satisfy the\nnormalization condition:\nκ\n\nZ\n\ndρ a(ρ) ψVn ψVm = δnm\n\n(2.7)\n\nand similarly for ψAn . The boundary conditions for the normalizable modes, as ρ → ∞,\nare ψVn , ψAn → 0 on both branches of the U-shaped Dp-Dp world-volume. Also, by\n\ndefinition the symmetric modes satisfy ∂ρ ψVn (ρ)|ρ=ρ0 = 0, whereas the antisymmetric\n\nones satisfy ψAn (ρ0 ) = 0. On the other hand, for the non-normalizable modes one has\nψV0 (q 2 , ∞) = 1 on both branches of the U-shape embedding (i.e., both on the stack of Dp's\nand on the stack of Dp's), whereas ψA0 (q 2 , ∞) = 1 on the Dp branes and ψA0 (q 2 , ∞) = −1\n\non the Dp branes.\n\nSubstituting the decomposition (2.6), one finds that the equations of motion (both for\nthe vector and for the axial-vector modes) that follow from (2.5) are:\n1\n∂ρ [b(ρ)∂ρ ψn (ρ)] = −m2n ψn (ρ) ,\na(ρ)\n\n(2.8)\n\nwhere we have used that5\n∂ ν ∂ν Vμn = m2n Vμn\n\nand\n\n5\n\n∂ μ Vμn = 0 .\n\n(2.9)\n\nThe condition ∂ μ Vμn = 0 follows from varying the action (2.5) with respect to the radial component\nAρ and then imposing the Aρ = 0 gauge.\n\n5\n\n\fFor the non-normalizable modes, one has the same equations of motion except for the\nchange m2n → q 2 :\n\n1\n0\n0\n∂ρ [b(ρ)∂ρ ψV,A\n(q 2 , ρ)] = −q 2 ψV,A\n(q 2 , ρ) .\na(ρ)\n\n(2.10)\n\nAt first sight, it might seem that summing over only the first several resonances in\n(2.2) would give a reasonable estimate for the S-parameter. This intuition turns out to\nbe incorrect: It was shown in [6] that restricting the infinite sum over resonances to a\nfinite number of the lowest lying ones is, generically, an inaccurate approximation because\nof non-decoupling of KK modes.6 However, in the large-NT C limit one can compute the\nS-parameter exactly by using the non-normalizable modes. We will go over the derivation\nof this result in the next subsection and, by being a little more careful than [6], we will\nend up with a slightly different formula.\n\n2.2\n\nHolographic S-parameter formula\n\nLet us start by recalling that the two-point functions ΠV and ΠA in (2.1) are related to\nthe vector JμV and axial-vector JμA current correlators in the following manner:\n\u0012\n\u0013\nZ\nqμ qν\nâb̂\n2\ni gμν − 2 δ ΠV (q ) =\nd4 x e−iq.x hJμâV (x)Jνb̂V (0)i ,\nq\n\u0012\n\u0013\nZ\nqμ qν\nâb̂\n2\ni gμν − 2 δ ΠA (q ) =\nd4 x e−iq.x hJμâA (x)Jνb̂A (0)i ,\nq\n\n(2.11)\n\nwhere â, b̂ = 1, ..., NT2 F − 1 are labeling the techniflavor currents. Now, according to the\n\ndecomposition (2.6), the sources for JμV and JμA are Vμ and Aμ , respectively. Hence, using\n\nthe gauge/gravity duality (more precisely, the statement that the generating functional\nof the field theory correlators is given by the dual gravity action), we can compute ΠV\nby:\nΠV (q 2 ) = hJμV (q 2 )JνV (0)i = −\n\nδ δ\nSDBI\nδVμ δVν\n\nV=0\n\n(2.12)\n\nand similarly for ΠA .\nTo utilize (2.12), let us now consider in more detail the action SDBI in (2.5) with (2.6)\n6\n\nThis is also consistent with the conclusions of [17].\n\n6\n\n\fsubstituted. After Fourier transforming to momentum space xμ → q μ , we find:\n\u001a\n\u0012X\nZ\n\u0002 Vn\nκ\n4\nAn\nd q dρ Tr a(ρ)\n|Fμν (q)|2 ψV2n(ρ) + |Fμν\n(q)|2 ψA2 n(ρ)\nSDBI = −\n4\nn\n\u0003\nμν\nV\nA\n0\n+ 2Fμν (q)FVn (−q) ψV(ρ) ψVn(ρ) + 2Fμν\n(q)FAμνn (−q) ψA0(ρ) ψAn(ρ)\n\u0013\n\u0012\nV\n2\n0\n2\nA\n2\n0\n2\n+ |Fμν (q)| (ψV (ρ)) + |Fμν (q)| (ψA (ρ)) + 2b(ρ) |Vμ (q)|2(∂ρ ψV0 )2\nX\u0002\n+ |Aμ (q)|2 (∂ρ ψA0 )2 +\n|Vμn (q)|2 (∂ρ ψVn )2 + |Anμ (q)|2 (∂ρ ψAn )2\nn\n\n2Vμ Vnμ (∂ρ ψV0\n\n+\n\n)(∂ρ ψVn ) +\n\n2Aμ Aμn (∂ρ ψA0 )(∂ρ ψAn )\n\n\u0003\n\n\u0013\u001b\n\n.\n\n(2.13)\n\nNow let us use (2.7) in the first line of (2.13). In addition, let us substitute ψVn ,An in\nthe second line with the corresponding expression from (2.8), i.e. ψn = − m12 a1 ∂ρ (b∂ρ ψn ).\nn\n\nAlso, let us partially integrate the ∂ρ ψVn ,An terms inside the bracket multiplying b(ρ) and\n\nthen use (2.8), (2.10). As a result of these manipulations, we obtain:\nZ\nX \u00121\n1\n1 An\n1\nVn\n4\n|Fμν\n(q)|2 + |Fμν\n(q)|2 + m2Vn |Vμn (q)|2 + m2An |Anμ (q)|2\nSDBI = −Tr d q\n4\n4\n2\n2\nn\n\u0013\nV\nA\n(q)FVμνn (q) + aAn Fμν\n(q)FAμνn (q) + Ssource ,\n+ aVn Fμν\n(2.14)\nwhere\naVn\n\nκ\n=− 2\nmVn\n\nZ\n\ndρ\n\nψV0\n\n(ρ) ∂ρ [b(ρ)ψVn(ρ)]\n\n,\n\naAn\n\nκ\n=− 2\nmAn\n\nZ\n\ndρ ψA0 ∂ρ [b(ρ)ψAn(ρ)]\n\nand Ssource is the term that contains only the sources. More precisely, we have:\n\u0015\n\u0012\n\u0014\nZ\nκ\n4\n2\n0 2\n2\n0 2\nSsource = −\nd q dρ Tr 2b(ρ) |Vμ (q)| (∂ρ ψV ) + |Aμ (q)| (∂ρ ψA )\n4\n\u0015\u0013\n\u0014\nV\n2\n0\n2\nA\n2\n0\n2\n+ a(ρ) |Fμν (q)| (ψV (ρ)) + |Fμν (q)| (ψA (ρ))\n\u0013\n\u0012\nZ\n1\n4\n0\n2\n0\n2\n= − Tr d q aV (q)|Vμ (q)| + aA (q)|Aμ(q)| ,\n2\n\n(2.15)\n\n(2.16)\n\nwhere\n\u0002\n\u0003\na0V (q 2 ) = 2κ b(ρ) ψV0 (q 2 , ρ) ∂ρ ψV0 (q 2 , ρ) ρ=∞ ,\n\u0002\n\u0003\na0A (q 2 ) = 2κ b(ρ) ψA0 (q 2 , ρ) ∂ρ ψA0 (q 2 , ρ) ρ=∞\n\n(2.17)\n\nwith the factor of 2 being due to the two branches of the D7-D7 and, also, to obtain the\n0\nlast line in (2.16) we have integrated by parts the (∂ρ ψV,A\n)2 terms on the first line there.\n\n7\n\n\fV\nTo cancel the second line in Ssource we have also used that |Fμν\n(q)|2 = −2q 2 |Vμ (q)|2, which\n\nis due to the Fourier mapping ∂μ → iqμ . As in [6, 8], one can diagonalize the kinetic terms\nin (2.14) by introducing:\n\nÃnμ = Anμ + aAn Aμ .\n\nṼμn = Vμn + aVn Vμ ,\n\n(2.18)\n\nThen, from the coupling of the new fields Ṽμn and Ãnμ with the sources, one can read off\nthe decay constants:\ngVn =\n\nm2Vn aVn\n\n=κ\n\nZ\n\ndρ ψV0\n\nψVn ,\n\ng An =\n\nm2An aAn\n\nNow, using (2.12) we obtain:\n\n=κ\n\nZ\n\ndρ ψA0 ψAn .\n\n\u0002\n\u0003\nΠV (q 2 ) = a0V (q 2 ) = 2 κ b(ρ) ψV0 (q 2 , ρ) ∂ρ ψV0 (q 2 , ρ) ρ=∞ ,\n\u0002\n\u0003\nΠA (q 2 ) = a0A (q 2 ) = 2 κ b(ρ) ψA0 (q 2 , ρ) ∂ρ ψA0 (q 2 , ρ) ρ=∞ .\n\n(2.19)\n\n(2.20)\n\nTherefore, (2.1) implies that\n\n\u0015\n\u0014\n\u0001\n∂\n0\n0\n0\n0\n.\nS = −8πκ b(ρ) 2 ψV ∂ρ ψV − ψA ∂ρ ψA\n∂q\nρ=∞, q 2 =0\n\n(2.21)\n\nNote that this hexpression is slightly different\nfrom the one derived and used in [6], which\ni\n. The reason for the discrepancy (other\nis S = −4πκ b(ρ) ∂q∂2 (∂ρ ψV0 − ∂ρ ψA0 )\nρ=∞, q 2 =0\n\nthan the overall factor of two) is that the authors of [6] have substituted the boundary\n\n0\ncondition ψV,A\n(ρ = ∞) = 1 in the intermediate steps of the computation. However, on\n\ngeneral grounds it should be clear that, by performing this substitution before taking the\n\nlimit ρ → ∞, one can miss some of the contributions to S. Indeed, we will see below that\nthis is precisely what happens in the holographic technicolor models.\n\nBefore concluding this section, let us make one more remark. Clearly, a rescaling\n0\n0\nψV,A\n→ CψV,A\n, with C an arbitrary constant, does not spoil the solution of (2.10). As in\n\n[8], under such a rescaling the decay constants rescale as gn → Cgn , according to (2.19).\nThis then implies, due to (2.2), that the S-parameter rescales as S → C 2 S, which is also\n\nconsistent with (2.21). In our context, this freedom of rescaling is fixed by imposing that\nΠA (0) = Fπ2 , where Fπ = 250 GeV is the technipion decay constant.7\n\n3\n\nRegular technicolor: example\n\nIn [6], the expression for the S-parameter, whose derivation we reviewed above, was eval0\nuated numerically by solving numerically the field equations for ψV,A\n. Instead of doing\n7\n\nRecall that 250 GeV is roughly the electroweak scale.\n\n8\n\n\fthat for our improved formula, we will try to gain more insight by analyzing things analytically. Before turning to the walking background of [10], let us first reconsider one of\nthe regular technicolor models of the last reference in [6] as an example of our approach.\nNamely, we will look at the model obtained by placing D7-D7 probes in the conifold.\n\n3.1\n\nD-brane set-up\n\nAs shown in [18], one can have a geometric realization of chiral symmetry breaking by\nembedding D7-D7 flavor branes in the conifold, as that embedding has the characteristic\nU-shape profile. To be able to be more precise, let us first briefly recall a few things about\nthe conifold geometry. The 10d metric is given by\nds210 =\n\nr 2 2 R2 2\ndx + 2 ds6 ,\nR2\nr\n\nwhere xμ are 4d coordinates and\n\u0012\n\u0013\n1 2\n1 2\nr2 1 2\n2\n2\n2\n2\n(f + f2 ) + f3 + (dθ − f2 ) + (sin θdφ − f1 )\nds6 = dr +\n3 4 1\n2\n2\n\n(3.1)\n\n(3.2)\n\nwith the one-forms fi parameterizing a three-sphere. Now, let us choose a D7 embedding\nsuch that the transverse space is the two-sphere parameterized by the angular coordinates θ and φ. In other words, the D7-brane worldvolume is spanned by {xμ }, r and\n\n{fi }. To specify completely the embedding of the eight-dimensional worldvolume into\n\nthe ten-dimensional space-time, we also need an ansatz for the position of the brane in\nthe transverse space. So let us assume that θ and φ depend only on the radial variable\nr. Then, substituting θ = θ(r) and φ = φ(r) into (3.1) in order to obtain the metric g8\ninduced on the worldvolume, the D7-brane DBI action\nZ\np\nSDBI = −μ7 e−φ − det(g8 )\n\n(3.3)\n\nleads to the Lagrangian [18]:\n\n−φ\n\nL = −μ7 e\n\n\u0012\n\u0013\n\u0001 1/2\nr2 2\nr3\n2\n2\n1+\nθ + sin θφr\n,\n18\n6 r\n\n(3.4)\n\nwhere we have denoted θr ≡ ∂θ/∂r and φr ≡ ∂φ/∂r. Note also that in this background\n\nthe dilaton φ is constant. So, as shown in [18], the field equations that follow from (3.4)\nare solved for θ = π/2 and φ(r) satisfying\n\u0013 \u0010 \u0011\n\u0012\nr0 4\n4\n,\ncos √ φ(r) =\nr\n6\n9\n\n(3.5)\n\n\fwhere r0 is an integration constant and the other integration constant has been set to\nzero. One can easily see that for generic r > r0 the solution represents two points on the\nequator of the S 2 parameterized by (θ, φ); this corresponds to the two separate stacks of\nD7 and D7 branes. At r = r0 these two points coincide, which corresponds to the merging\nof the D7s and anti-D7s.\nThis model of chiral symmetry breaking was used in Section 9 of the last reference\nin [6], in order to obtain a technicolor model according to the general discussion in our\nSection 2. Using the embedding (3.5), one can compute that the coefficient functions a\nand b in (2.5) acquire the form:\na(z) = q\n\n1\nz2\n\n+\n\n\u0001\nr0 8\nR\n\n\u0012\n\u0010 r \u00118 \u00133/2\n0\n2\n,\nb(z) = 16 z +\nR\n\nand\n\n(3.6)\n\nwhere z ∈ (−∞, +∞) is a suitably chosen worldvolume variable, such that z > 0 runs\n\nalong the D7 branch and z < 0 runs along the D7 branch, unlike the space-time radial\nvariable \u0010r ∈ (r0 ,\u0011∞) that does not distinguish between the two branches. More precisely,\nz2 =\n\nr2\nR2\n\n1−\n\nr08\nr8\n\n; see [18].\n\nNow, instead of solving numerically the field equations\n\n\u0002\n\u0003\n1\n0\n0\n∂z b(z)∂z ψV,A\n(q 2 , z) = −q 2 ψV,A\n(q 2 , z) ,\na(z)\n\n(3.7)\n\n0\nas done in [6], we will try to determine analytically the behaviour of the functions ψV,A\n\nin order to evaluate the S-parameter. Although we will be left with several undetermined\nintegration constants, whose values can only be fixed by a numerical computation, our\nconsiderations will illuminate some interesting/important points.\n\n3.2\n\nS-parameter\n\nAlthough equation (3.7) cannot be solved analytically in the whole domain of variation\nof z, it can be solved analytically for z >>\n\nr0\n,\nR\n\nwhich is precisely the region of interest in\n\nthe evaluation of the S-parameter formula (2.21). Namely, for large z (3.7) acquires the\nform:8\n16z 4\n8\n\n∂2 0\n∂ 0\n0\nψV,A + 48z 3 ψV,A\n+ q 2 ψV,A\n= 0.\n2\n∂z\n∂z\n\n(3.8)\n\nHere we also take z > 0. Since (2.21) already takes into account that the contribution of the two\n\nbranches is equal to twice the contribution of only one of them, in the following we will concentrate only\non the D7 branch.\n\n10\n\n\fThe latter equation is solved by\n0\nψV,A\n\n=\n\nC1V,A\n\n\u0010q\u0011\n1 \u0010q\u0011\nV,A 1\n+ C2\n,\nJ1\nY1\nz\n4z\nz\n4z\n\n(3.9)\n\nwhere J and Y are the Bessel functions of the first and second kind respectively. Note\nV,A\nalso that the integration constants C1,2\ncan, in principle, depend on q as the latter is just\n\na parameter in the differential equation (3.8).\nNow, it may seem that one can just plug the solution (3.9) in the formula (2.21) and\nobtain a finite answer. However, a direct substitution leads to either zero or infinity,\ndepending on whether one takes the J1 or the Y1 term in the solution. Furthermore, since\n\u0001\nin the region of interest for us, namely for z → ∞ and q → 0, we have that z1 J1 4zq → 0\n\u0001\nand z1 Y1 4zq → ∞, none of the terms in (3.9) tends to a constant and so the boundary\n\ncondition ψ 0 (z = ∞) = 1, used in [6], cannot be imposed. To overcome all of these\n\nproblems, we need to somehow 'regulate' the terms in the solution (3.9). In other words,\nwe need to find the analogue of more suitable ('regular') \"coordinates\" for the present\ncase.\nThe idea for how to achieve the desired 'regulation' comes from the original AdS/CFT\ncorrespondence. Recall that, as noticed in [19], generic 2-point correlation functions for\nscalars in AdS do not approach a constant as one goes toward the boundary. Instead, they\ntend to zero or infinity. In particular, the solution of the wave equation (∇2 − m2 )φ = 0\n\nfor a scalar with mass m is given by the modified Bessel function of the second kind. More\nprecisely, in momentum space one has:\nd\n\nφ ∼ z 2 Kν (qz)φ0 (q) ,\n\n(3.10)\n\nwhere z is the radial variable for the AdSd+1 metric in Poincaré coordinates, i.e. ds2 =\nR2\n(dz 2\nz2\n\n− dt2 + dx2d−1 ) so that the boundary is reached for z → 0 and the deep interior for\nq\n2\nz large; φ0 (q) is a function of the boundary momentum q and ν = d4 + m2 . Now, for\nd\n\nz → 0 the expression z 2 Kν (qz) diverges.9 To regulate it, the authors of [19] introduced a\n\ncut-off ǫ > 0 and rescaled the solution in the following manner:\nd\n\nφ=\n\nz 2 Kν (qz)\nd\n\nǫ 2 Kν (qǫ)\n\nφ0 (q) ,\n\n(3.11)\n\nso that φ → φ0 (q) for z → ǫ. As shown in [19], using this bulk solution in the supergravity\n\naction and performing the computation of the CFT correlators at z = ǫ, before taking the\n9\n\nThis statement applies for m2 > 0. Recall that in AdS stability does not require positive m2 , just\nthat the latter satisfy the Breitenlohner-Freedman bound.\n\n11\n\n\fǫ → 0 limit, is the appropriate procedure to extract the correct field theory correlation\n\nfunctions from the gravity dual.\n\nWe would like to adopt the above procedure for our case, in order to obtain finite limits\nfrom the J1 and Y1 terms as q → 0. However, there is an important subtlety. Namely,\n\nin the above paragraph the divergence was occurring in a limit of the variable of the\ndifferential equation one is solving. In our case, on the other hand, q is just a parameter\nin the differential equation of interest and the variable is z. So we cannot simply rescale,\n\u0001\n\u0001\n\u0001\nq\n→ Y1 4zq /Y1 4zǫ without spoiling the solution of our differential equation.\nsay, Y1 4z\nHowever, we are allowed to do the following rescaling:\n\u0001\nq\n1\nY\n1 \u0010q\u0011\n1\n→ z \u0010 4z \u0011 ,\nY1\n1\nz\n4z\nY ǫ\nz∗ 1 4z∗\n\n(3.12)\n\nwhere z∗ is some finite fixed value. In fact, it is not even necessary to introduce a lower\n\nbound on the range of variation of q, since the right-hand side of (3.12) with ǫ = q is\n\nwell-behaved in the limit q → 0. Namely, using the small argument expansion of the Y1\nBessel function, we find:\n\n1\nz\n1\nz∗\n\nwhere\n\n\u0001\nY1 4zq\nq2\n\u0010 \u0011 = 1 + CY1 q 2 − CY2 2 + O(q 4 ) ,\nz\nY1 4zq∗\n\n\u0012\n\u0013\n2γ − 1\n1\n2γ − 1\nq\n1 \u0010q\u0011\n2\n=\n+\nln\n,\nC\n=\n.\n+\nln\nY\n64z∗2\n32z∗2\n8z∗\n64\n32\n8z\nSimilarly, we can compute:\n\u0001\n\u0012\n\u0013\nq\n1\nJ\nz∗2\nq2\nz∗2\n1\nz\n4z\n\u0010 \u0011= 2+\n1 − 2 + O(q 4 ) .\n2\n1\nz\n128z\nz\nJ q\nz∗ 1 4z∗\nCY1\n\n(3.13)\n\n(3.14)\n\n(3.15)\n\nHence, the solution we are looking for is a linear combination of (3.13) and (3.15) with\ncoefficients that may still depend on q. We will fix this dependence by finding the small\nq solution of (3.8) in yet another, more direct, manner.\nNamely, a more direct way of solving (3.8) for small q is the following. Let us first\nconsider the equation:\n\n∂\n∂2 0\nψ + 48z 3 ψ 0 = 0 .\n(3.16)\n2\n∂z\n∂z\nIts most general solution is f1 (q) + f2(q)/z 2 , where f1 (q) and f2 (q) are arbitrary functions\n16z 4\n\nof q. Now, let us recall that we are looking for a solution that is an expansion in small q 2\nand tends to 1. Then the above general solution reduces to:\nψh0 = 1 + C̃1 q 2 +\n\n(C̃2 + C̃3 q 2 )\n+ O(q 4 ) ,\nz2\n12\n\n(3.17)\n\n\fwhere C̃1 , C̃2 and C̃3 are constants and we have stopped at O(q 2 ) since terms of O(q 4 ) and\n\nhigher do not contribute to the expression for the S-parameter (2.21). Now, we can solve\n\n(3.8) to order q 2 by adding to ψh0 a particular solution of the inhomogeneous equation,\nobtained by substituting in the last term of (3.8) the zeroth order of ψh0 . Namely, the\ninhomogeneous equation of interest is:\n∂2\n∂\nC̃2\n16z 4 2 ψ 0 + 48z 3 ψ 0 + q 2 1 + 2\n∂z\n∂z\nz\n\n!\n\n= 0.\n\n(3.18)\n\nIt is solved by:\nq 2 ln z\nq2\nq 2 C̃2\n+\n−\n,\n(3.19)\n32z 2\n64z 2 128z 4\nwhere the integration constants have been set to zero since their non-vanishing contribuψi0 =\n\ntions are already taken into account within the constants in ψh0 . Hence the solution of\n(3.8) to order q 2 is:\n0\nψV,A\n\n=\n\nψh0 +ψi0\n\n=\n\nV,A\nV,A 2 (C̃2\n1+ C̃1 q +\n\n!\nq2\n1 C̃2V,A\n+ C̃3V,A q 2 )\n+\nln z + −\n+O(q 4 ) . (3.20)\n2\n2\n2\nz\n32z\n2\n4z\n\nUsing the above solution, together with (3.6) for large z, we can compute that:\n!\n\u0010\n\u0011 C̃\n\u0001\n3\nC̃\n2\n2\n= − ln z − 32 C̃3 + C̃1 C̃2 − 2 64C̃3 + 2 ln z − 2 . (3.21)\nb(z) ∂q2 ψ 0 ∂z ψ 0\nq 2 =0\nz\n4z\nTherefore, from (2.21) we find:\n\u0011\n\u0010\nV\nV V\nA\nA A\nS = 256 πκ C̃3 + C̃1 C̃2 − C̃3 − C̃1 C̃2 .\n\n(3.22)\n\nDespite still having to determine the values of the constants C̃1,2,3 numerically, our\nconsiderations so far enable us to make several important observations. First of all,\nnote that the leading term in (3.21), namely ln z, is divergent for z → ∞.\n\nHow-\n\never, it is the same for V and A modes and thus cancels in the S-parameter expression. Hence, the S-parameter results from very small differences between large V and\nA contributions.\nAnother important\npoint is that, if instead of (2.21) we had used\ni\nh\n∂\n0\n0\nS = −4πκ b(ρ) ∂q2 (∂ρ ψV − ∂ρ ψA )\nas in [6], we would have missed the C̃1 C̃2\nρ=∞, q 2 =0\n\ncontribution.10 It is also worth noting that the initial intuition one might have had,\nnamely to drop the Y1 term in the solution (3.9) as it diverges for q → 0, is actually\nincorrect. Indeed, comparing (3.20) with (3.13) and (3.15), one can see that the Y1 term\nhas an essential contribution to the final answer.\n10\n\nIn fact, only the C̃1A C̃2A term in C̃1V C̃2V − C̃1A C̃2A will contribute, since ΠV (0) = 0 implies that C̃2V = 0.\n\n13\n\n\fTo compare in more detail the small q 2 solution (3.20) with the regulated version of\nthe general q solution C1 J1 /z + C2 Y2 /z, let us note that there is no reason to have the\nsame value z∗ in the regulation of both the J1 and the Y1 terms. In other words, we can\nhave z∗J 6= z∗Y . This is important, since the small q solution (3.20) has three independent\n\nconstants C̃1,2,3 . Therefore, the small q expansion of C1 J1 /z + C2 Y2 /z should have three\n\nconstants as well. Since the constant piece in (3.20) has been normalized to 1, then from\n(3.13) it follows that C2 = 1. Hence the three independent constants are actually C1 , z∗J\n\nand z∗Y . Note also that, unlike (3.20), the expansion in (3.13) has terms of the form q 2 ln q.\nWe can cancel the q 2 ln q term in CY1 by multiplying (3.13) by (1 −\n\nq 2 ln q term in CY2 by multiplying (3.15) by (1 +\n2\n\n1\nq2\nC1 32(z∗J )2\n\n1\nq2\n32(z∗Y )2\n\nln q) and the\n\nln q); these manipulations do\n\nnot affect the rest of the O(q ) expansions. To recapitulate, the small q solution (3.20)\n\narises from the small q expansion of the solution (3.9) for the following choice of the\nintegration constants:\n\u0010\n\u0011\n\u0011\n\u0010\nq 2 ln q\nq 2 ln q\nC1 1 + 32C1 (z J )2 1 \u0010 q \u0011\n1 − 32(z Y )2 1 \u0010 q \u0011\n\u0010 \u0011∗\n\u0010 ∗ \u0011\nψ 0 (q 2 , z) =\n+\n.\nJ1\nY1\nq\nq\n1\n1\nz\n4z\nz\n4z\nJ\nY\nJ\n1\nJ\nY\n1\nY\nz\n4z\nz\n4z\n∗\n\n4\n\n∗\n\n∗\n\n(3.23)\n\n∗\n\nWalking technicolor\n\nIn this section we study our model of walking technicolor. First, we review briefly the\nbackground of [10], that is dual to walking behaviour. Then we show that one can realize\ngeometrically chiral symmetry breaking in it, i.e. that there is a U-shape embedding a la\nSakai-Sugimoto of D7-D7 probes in this background. Using that result, we then compute\nthe S-parameter with the method, illustrated in the previous section. The answer turns\nout to have divergences, which we remove by adding an appropriate counterterm. It is,\nperhaps, interesting to note that the counterterm also gives a finite contribution to the\nrenormalized S-parameter.\n\n4.1\n\nGravity background\n\nThe gravitational background that we will consider is given in eq. (6) of [10]. Namely,\nthe ten-dimensional string frame metric is:\n\u0014 2\ndx1,3\n2\n′\nφ(ρ)\n+ e2k(ρ) dρ2 + e2h(ρ) (dθ2 + sin2 θdφ2 )\nds = α gs e\nα ′ gs\n\u0015\ne2g(ρ)\ne2k(ρ)\n2\n2\n2\n+\n{(ω̃1 + a(ρ)dθ) + (ω̃2 − a(ρ) sin θdφ) } +\n(ω̃3 + cos θdφ) , (4.1)\n4\n4\n14\n\n\fwhere\nω̃1 = cos ψdθ̃ + sin ψ sin θ̃dφ̃\nω̃2 = − sin ψdθ̃ + cos ψ sin θ̃dφ̃\nω̃3 = dψ + cos θ̃dφ̃\n\n(4.2)\n\nand the functions φ(ρ), k(ρ), h(ρ), g(ρ), and a(ρ) are determined by the type IIB equations\nof motion.11 Note that there is also a nonzero F3 flux. However, its explicit form will not\nbe of importance for us in the following. As in [10], we will take from now on α′ gs = 1.\nFinally, an important property of this IIB solution is that the dilaton φ(ρ) = const [10].\nIn [10] it was shown that there is an intermediate region for the radial variable ρ, such\nthat the metric simplifies to:\n√\n\u0014\n\u0012\n\u0013\u0015\n\u0001\n3\nc cos α tan3 α e4ρ\n2\n2\n2\n2\n2\n2\ndx1,3 +\n4dρ + (ω3 + ω̃3 ) + dΩ2 + dΩ̃2 ,\nds ≈\n4\n3\nc3/2 sin3/2 α\n(4.3)\nwhere c and α are constants, whereas dΩ22 = ω12 + ω22 and dΩ̃22 = ω̃12 + ω̃22 , and finally\nω1 = dθ ,\n\nω2 = sin θdφ ,\n\nω3 = cos θdφ .\n\n(4.4)\n\nThis region corresponds in the dual field theory to the intermidiate energy range, in which\nthe gauge coupling is approximately constant. In other words, it corresponds exactly to\nthe walking regime we are interested in.\nAnother useful limit, in which (4.1) simplifies significantly, is the UV region. In this\ncase, the metric is [10]:\n√\n\u0013\u0015\n\u0012\n\u0014\n\u0001\n3\n2−1/3 c sin α 4ρ/3 2\n2\n2\n2\n2\n2\n2\nds ≈\n4dρ + (ω3 + ω̃3 ) + dΩ2 + dΩ̃2 .\ne\ndx1,3 +\n4\n3\nc3/2 sin3/2 α\n(4.5)\n\n4.2\n\nD7-brane probes\n\nWe will introduce techniflavors in the above background via D7 probes. Our goal will\nbe to find a geometric realization of chiral symmetry breaking a la Sakai-Sugimoto [7].\nThen one could realize the holographic description of walking technicolor in the manner\nwe reviewed in Section 2.\n11\n\nThere are no nice analytic expressions for those functions in general. However, they can all be\n\nexpressed via the BPS conditions in a compact way in terms of a single function, that satisfies certain\nsecond order differential equation; see [20] for details.\n\n15\n\n\fWe take the D7 branes to span the dimensions parametrized by the following coordinates: the four space-time directions xμ , the radial direction ρ and the triplet (ψ, θ̃,\nφ̃), which parameterizes a 3-sphere. Hence, the transverse space is the two-sphere parameterized by (θ, φ). As reviewed in Section 3, this embedding is of the same kind as\nthe embedding of D7 probes in the conifold, considered in [18]. Following that paper,\nwe assume that θ and φ depend only on ρ. Therefore, the induced metric on the D7\nworld-volume is given by (4.1) with dθ =\n\n∂θ\ndρ\n∂ρ\n\nand dφ =\n\n∂φ\ndρ\n∂ρ\n\nsubstituted.\n\nNow, the DBI action is:\nSD7 = −μ7\n\nZ\n\ne−φ\n\np\n\n− det(g8 ) ,\n\n(4.6)\n\nwhere g8 is the induced metric on the 8-dimensional world-volume. Note that the ChernSimons term does not contribute since the only background flux is F3 . Taking θ = θ(ρ)\nand φ = φ(ρ) into account in (4.1), we can compute that\ndet(g8 ) = −\n\n\u0001\n\u0003\ne8φ+4g+2k \u0002 2h 2\ne θρ + sin2 θφ2ρ + e2k ,\n64\n\n(4.7)\n\nwhere θρ ≡ ∂θ/∂ρ and φρ ≡ ∂φ/∂ρ. Hence we have the following Lagrangian:\nL=\n\n\u00011/2\nμ7 3φ(ρ)+2g(ρ)+k(ρ) 2k(ρ)\ne\ne\n+ e2h(ρ) (θρ2 + sin2 θφ2ρ )\n.\n8\n\n(4.8)\n\nIn principle, one can find the allowed D7 embeddings by finding the solutions of the\nequations of motion for θ(ρ) and φ(ρ), that follow from (4.8). In practice, however, the\nexplicit functions φ(ρ), g(ρ), k(ρ) and h(ρ) are rather involved and at this point it is not\nclear whether one can find a solution in full generality.\nSo let us now consider in turn the two simplified metrics (4.3) and (4.5). We start\nwith the intermediate region, i.e. with (4.3). In this case we find:\n\u0001\ndet(g8 ) = −A8 C 4 B e4ρ 4Be4ρ + θρ2 + sin2 θφ2ρ ,\n\nwhere for convenience we have denoted C =\n\nc cos α\n,\n4\n\nB=\n\ntan3 α\n3\n\nand A =\n\n(4.9)\n√\n\n3\n.\nc3/2 sin3/2 α\n\nSince\n\nthe dilaton φ(ρ) is constant [10], (4.9) implies that the resulting Lagrangian is:\nL = const × e2ρ 4Be4ρ + θρ2 + sin2 θφ2ρ\n\n\u00011/2\n\n.\n\n(4.10)\n\nAs in [18], one can easily verify that the θ equation of motion is identically satisfied for\nθ = π/2. In fact, any of θ = 0 , ±π/2 , π is a solution, since\n\n∂L\n∂θρ\n\n∼ θρ and\n\n∂L\n∂θ\n\n∼ sin θ cos θ.\n\nFor convenience, we will take θ = π/2. Then the φ equation of motion becomes:\nφ3ρ + 2Be4ρ φρρ = 0 .\n16\n\n(4.11)\n\n\fThis is solved by\ntanh\n\n\u0012\n\nφ(ρ)\n√\nBe2ρ0\n\n\u0013\n\nr\n\n=± 1−\n\ne4ρ0\n,\ne4ρ\n\n(4.12)\n\nwhere we have taken one of the two integration constants to be zero and the other one (up\nto a constant containing B) is denoted by ρ0 . Clearly, for a generic value of ρ, satisfying\nρ > ρ0 , there are two solutions of (4.12), which represent two points on the equator of the\ntwo-sphere parametrized by (θ, φ). At ρ = ρ0 these two points coincide as the equation\ntanh φ = 0 has the single solution φ = 0. So we see that the D7-D7 embedding is of the\n\"U-shape\" kind that gives the geometric realization of the UL (Nf ) × UR (Nf ) → U(Nf )\n\nchiral symmetry breaking. The latter is exactly what will translate into EWSB once an\nappropriate embedding of the EW SU(2) × U(1) into UL (Nf ) × UR (Nf ) is chosen.\nNow let us look at the UV region. The metric (4.5) implies that:\n\u0012\n\u0013\n2 8 4 16ρ/3 8\n2\n2\n2\n+ θρ + sin θφρ ,\ndet(g8 ) = − A H e\n3\n3\n\nwhere H =\n\n2−1/3 c sin α\n.\n4\n\n(4.13)\n\nThe resulting Lagrangian is:12\n8ρ/3\n\nL = const × e\n\n\u0012\n\n8\n+ θρ2 + sin2 θφ2ρ\n3\n\n\u00131/2\n\n.\n\n(4.14)\n\nAgain, any of θ = 0 , ±π/2 , π is a solution of the θ equation of motion. Choosing as before\nθ = π/2, we find that the φ equation of motion is:\n\n8\nφ3ρ + φρ + φρρ = 0 .\n3\nThe last equation is solved by:\n\u0013\n\u0012\n\u00011/2\n4φ(ρ)\n√ − C2 = ± C1 e16ρ/3 − 1\n,\ntan\n6\n\n(4.15)\n\n(4.16)\n\nwhere C1 and C2 are integration constants.\n\nIn moving from the UV to the lower-energy intermediate region, the shape of the\nsolution changes from (4.16) to (4.12). In principle, we can write C1 as C1−1 = e16ρ∗ /3 ,\nwhere the integration constant ρ∗ is some radial value below the lower end of the range\n\nof validity of the metric (4.5), so that in the whole UV region there are two separate\nbranches, one for D7 and the other for D7. Note, however, that both constants C1,2 will\ndrop out of the computation of the S-parameter, as we will see in the following.\n12\n\nRecall that the dilaton is constant.\n\n17\n\n\f4.3\n\nS-parameter\n\nAccording to Section 2, in order to compute the S-parameter we first need to calculate the\ncoefficient functions a and b in (2.5). For the intermediate region, using the embedding\n(4.12), we find that these functions are:\n\u00131/2\ne4ρ0\n,\ne4ρ − e4ρ0\n\u0013−1/2\n\u0012\n1 2\ne4ρ0\nb(ρ) = A ĈC 1 + 4ρ\n,\n2\ne − e4ρ0\n\n\u0012\n1+\na(ρ) = 2A ĈC B e\n2\n\n2\n\n4ρ\n\n(4.17)\n(4.18)\n\nwhere Ĉ = e−φ and we have used that from (4.12) one has:13\n√\ndφ\n1\n= ±2 Be2ρ0 q\ndρ\n1−\n\nand therefore (4Be4ρ + θρ2 + sin2 θφ2ρ ) = 4Be4ρ (1 +\n\n(4.19)\n\ne4ρ0\ne4ρ\n\ne4ρ0\n)\ne4ρ −e4ρ0\n\nfor θ = π/2. On the other\n\nhand, the embedding solution (4.16) implies:\nr\n8\ndφ\n1\np\n=±\n.\ndρ\n3 C1 e16ρ/3 − 1\n\n(4.20)\n\nUsing this and the corresponding induced metric, one can compute that in the UV region:\n\u0012\n\u00131/2\n1\n4\n2 2 8ρ/3\n1+\n,\n(4.21)\na(ρ) = ĈA H e\n3\nC1 e16ρ/3 − 1\n\u0012\n\u0013−1/2\n1\n1\n2\n4ρ/3\n1+\n.\n(4.22)\nb(ρ) = ĈA He\n2\nC1 e16ρ/3 − 1\n\nNow, in order to evaluate (2.21), we need the solution of (2.10) in the UV region.\n\nIn this region, upon substituting (4.21) and (4.22), the field equation (2.10) acquires the\nform:\n\n20ρ/3\n4 (C1 e16ρ/3 + 1) ∂ 0\n∂2 0\n2 P C1 e\nψ\n+\nψ\n+\nq\nψ0 = 0 ,\n∂ρ2 V,A 3 (C1 e16ρ/3 − 1) ∂ρ V,A\nC1 e16ρ/3 − 1 V,A\n\n(4.23)\n\nwhere P = 38 H. This equation cannot be solved analytically for every ρ. However, for\nρ → ∞ things simplify considerably. Namely, since for large enough ρ we have that\n\nC1 e16ρ/3 >> 1 regardless of the value of the still undetermined constant C1 , we find that\n(4.23) reduces to:\n∂2 0\n4 ∂ 0\n0\nψV,A +\nψ + q 2 P e4ρ/3 ψV,A\n= 0.\n2\n∂ρ\n3 ∂ρ V,A\n13\n\n(4.24)\n\nThe ± in (4.19) corresponds to the ± in (4.12). Note also that the expressions, that determine a(ρ)\nand b(ρ), depend on φρ only via φ2ρ and so are independent of the sign of φρ .\n\n18\n\n\fThe last equation can be solved analytically and the solution is:\n\u0013\n\u0012\n\u0013\n\u0012\n3 √ 2ρ/3\n3 √ 2ρ/3\n−2ρ/3\n0\n2\n−2ρ/3\n+ const2 e\nY1 q P e\n,\nψV,A (q , ρ) = const1 e\nJ1 q P e\n2\n2\n\n(4.25)\n\nwhere J and Y are the Bessel functions of the first and second kind respectively. Note\nthat, as in Section 3, the constants of integration can actually depend on q, since the latter\nis just a parameter in the differential equation (4.24). This point will be of significance\nlater on.\n4.3.1\n\nV vs A modes\n\nBefore analyzing the implications of the above solution, let us first comment on the issue\nof V vs A modes. Recall that ρ is the background radial variable and so, when ρ runs\nin the interval (ρ0 , ∞), it does not distinguish between the two branches of the D7-\n\nD7 embedding. To distinguish between them, one needs to change variables from ρ to a\n\nworldvolume coordinate z that runs only over the \"U-shape\" embedding, i.e. z ∈ (−∞, ∞)\n\nwith z positive being the brane and z negative being the antibrane branch. In terms of\nsuch a variable, the vector modes are defined as the ones that are symmetric under\nz → −z, whereas the axial-vector modes are those that are antisymmetric under this\ntransformation. Let us define this worldvolume variable as:\nz 2 = ρ2 − ρ20 .\n\n(4.26)\n\n0\nTo see how the equation of motion for ψV,A\n(q 2 , z) looks like, let us perform a change of\n\nvariables ρ → ρ(z) in the action (2.5). We see that\nZ\nZ\nh\ni\nμν\nμ\ndρ [a(ρ)Fμν F + 2b(ρ)Fμρ F ρ ] = dz â(z)Fμν F μν + 2b̂(z)Fμz F μ z ,\nwhere\nâ(z) = a(ρ) ∂z ρ\n\nand\n\nb̂(z) =\n\nb(ρ)\n.\n∂z ρ\n\nTherefore, the field equation is:\nh\ni\n1\n0\n2\n0\n∂z b̂(z) ∂z ψV,A (q , z) = −q 2 ψV,A\n(q 2 , z) .\nâ(z)\n\n(4.27)\n\n(4.28)\n\n(4.29)\n\nFor the change of variables (4.26) and in the large z limit this gives:\n∂2 0\n4 z ∂ 0\n0\nψ\n+\nψ + q 2 P e4|z|/3ψV,A\n= 0.\nV,A\n∂z 2\n3 |z| ∂z V,A\n19\n\n(4.30)\n\n\fClearly, for z > 0 (the D7 branch) this equation is exactly the same as (4.24). On the\nother hand, for z < 0 (the D7 branch) one has:\n4 ∂ 0\n∂2 0\n0\nψ\n−\nψ + q 2 P e−4z/3 ψV,A\n= 0.\nV,A\n∂z 2\n3 ∂z V,A\nHence, at large negative z the symmetric solutions have the form\n\u0013\n\u0012\n\u0013\n\u0012\n3 √ −2z/3\n3 √ −2z/3\nV 2z/3\n0\n2\nV 2z/3\n+ Ĉ2 e\nY1 q P e\n,\nψV (q , z)|z<0 = Ĉ1 e\nJ1 q P e\n2\n2\n\n(4.31)\n\n(4.32)\n\nwhere the constants Ĉ1V , Ĉ2V are the same as those in the large positive z limit, in which\n\u0012\n\u0013\n\u0012\n\u0013\n3 √ 2z/3\n3 √ 2z/3\n0\n2\nV −2z/3\nV −2z/3\nψV (q , z)|z>0 = Ĉ1 e\nJ1 q P e\n+ Ĉ2 e\nY1 q P e\n.\n(4.33)\n2\n2\nSimilarly, at large z the antisymmetric modes ψA0 (q 2 , z) have the same form as (4.32) and\n(4.33), with the only difference that if we denote the constants entering the positive z\nasymptotics by Ĉ1A and Ĉ2A , then those appearing in the negative z asymptotics are −Ĉ1A\nand −Ĉ2A respectively.\n\nThe introduction of the variable z is crucial for the study of the solutions around\n\nz ≈ 0, in order to impose the conditions ψA0 (q 2 , 0) = 0 and ∂z ψV0 (q 2 , z)|z=0 = 0 that\ndefine the symmetric and antisymmetric modes respectively. However, for the present\n\nconsiderations of the large distance region it is not significant, as the derivation of the\nformula (2.21) already used that the contribution of both branches is equal to twice the\ncontribution of just one of them. In particular, the modes in (2.21) are only those on one\nof the two branches. So in the present section we will concentrate only on one (the D7)\nbranch and will continue using the variable ρ, in order not to deal with more cumbersome\nexpressions involving |z|.\n4.3.2\n\nSmall q 2 solution\n\nLet us now get back to the computation of the S-parameter. To understand the behaviour\nof the solution (4.25) in the limits of interest for us, let us first recall the asymptotic\nbehaviour of the Bessel functions at large and at small argument. For large argument\n(i.e., y >> 1), one has:\nr\n\u0010\nαπ π \u0011\n2π\nJα (y) ≈\n,\ncos y −\n−\ny\n2\n4\n\nYα (y) ≈\n\nr\n\n\u0010\nαπ π \u0011\n2π\n,\nsin y −\n−\ny\n2\n4\n\n(4.34)\n\nwhereas for small argument (i.e., y << 1) the asymptotic behaviour is:\n1\n1\nJ1 (y) = y − y 3 + O(y 5) ,\n2\n16\n\nY1 (y) = −\n\n2 1 2 ln(y/2) + 2γ − 1\n+\ny + O(y 3 ln y) . (4.35)\nπy\nπ\n20\n\n\fNow, at first sight it is not clear which of this two limits, if any, is relevant for us,\nsince we are interested in taking both q → 0 and ρ → ∞, in which case the argument\n\nof the Bessel functions in (4.25) is of the form 0 × ∞. To resolve this ambiguity, recall\n\nthat we are looking for the small-q 2 behaviour of the non-normalizable modes. Whether\nR∞\na function ψ(ρ) is normalizable or not is determined by whether 0 dρ gρρ ψ 2 is finite or\nnot. Reading off the UV behaviour of gρρ from the metric (4.5), we see that for finite\nq functions of the form (4.34) are normalizable. To understand the significance of this,\nrecall that the normalizable modes satisfy the same field equation as the non-normalizable\nones, only with the substitution q 2 → m2 ; see (2.8), (2.10). Hence the solution for them is\nalso (4.25), where q is substituted by the finite mass parameter m. The discrete spectrum\n\nmn , n = 1, 2, ... arises because only for discrete values one can match the asymptotic\nsolutions with those that satisfy the appropriate boundary conditions around ρ0 (i.e., are\neither symmetric or antisymmetric w.r.t. reflection around ρ0 on the worldvolume of the\n\"U-shaped\" D7-D7). Hence, we have identified (4.34) as the asymptotic behaviour of the\nnormalizable modes. This leaves us with (4.35) as the candidate for the large distance\nasymptotics of the non-normalizable modes for small q; we will confirm this below in a\ndifferent manner.\nIn the above paragraph we have treated q as finite, whereas ρ was taken to be infinitly\nlarge. This is justified because normalizability is a generic question about the behaviour\nat large distance. However, now we want to turn to the small-q behaviour of the nonnormalizable modes. So let us introduce an upper limit (a UV cut-off from the field theory\nperspective) for ρ, i.e. take ρ ∈ (0, ρΛ ) with ρΛ large but finite, and treat q as infinitesimal.\n\nOf course, at the end, the S-parameter should not depend on the value of ρΛ . Now, in the\nlimit q → 0 and ρ → ρΛ the argument of the Bessel functions in (4.25) is small and we have\n\nthe expansions (4.35). In principle, plugging those expressions in (2.21) should give the\nvalue of the S-parameter. In practice however, just as in the regular techinicolor example\nof Section 3, one obtains either zero or infinity, depending on whether one takes only one\nor both Bessel functions in (4.25). As we saw in the previous section, this problem can\nbe overcome by regulating the solution (4.25) in a manner that results in a solution at\nsmall q, which tends to a constant at large distance, rather than to 0 or ∞. As in [6], we\n\nwill take this constant to be 1.\n\nSo we want to find a solution of (4.24), which tends to 1 and is an expansion in powers\nof small q 2 with the variable ρ satisfying ρ ≤ ρΛ . Since we are looking for a solution of\n\n21\n\n\f(4.24) valid at small q, let us first consider the equation\n4 ∂ 0 2\n∂2 0 2\nψ\n(q\n,\nρ)\n+\nψ (q , ρ) = 0 .\n∂ρ2\n3 ∂ρ\n\n(4.36)\n\nIts most general solution is f1 (q 2 ) + f2 (q 2 )e−4ρ/3 , where f1 (q 2 ) and f2 (q 2 ) are independent\nof ρ but can be any functions of q. Since we want a solution that is an expansion in small\nq 2 and tends to 1, this freedom is reduced for us to the following:\nψh0 = 1 + C̃1 q 2 + (C̃2 + C̃3 q 2 )e−4ρ/3 + O(q 4 ) ,\n\n(4.37)\n\nwhere C̃1 , C̃2 and C̃3 are constants and, as before, we have stopped at O(q 2 ) since the\n\nhigher order terms do not contribute in the expression for the S-parameter (2.21). Clearly,\nwe can solve (4.24) to order q 2 by adding to ψh0 a particular solution of the following\ninhomogeneous equation:\n∂2 0 2\n4 ∂ 0 2\nψ (q , ρ) +\nψ (q , ρ) + q 2 P e4ρ/3 + q 2 P C̃2 = 0 ,\n2\n∂ρ\n3 ∂ρ\n\n(4.38)\n\nwhere the inhomogeneous terms are the zeroth order contribution in the q 2 expansion of\nψh0 in (4.37) multiplied by the coefficient of the last term in (4.24). It is easily seen that\na particular solution of the inhomogeneous equation (4.38) is given by\n9 2 4ρ/3 3\nq Pe\n− C̃2 q 2 P ρ .\n32\n4\n0\n0\nHence, adding ψh and ψi , we obtain:\nψi0 = −\n\n(4.39)\n\n9 2 4ρ/3 3 V,A 2\nq Pe\n− C̃2 q P ρ + O(q 4 ) . (4.40)\n32\n4\nSubstituting these solutions in the formula for the S-parameter, we find that:\n\u0014\n\u0015\n\u0001\n∂\n0\n0\n0\n0\nS = −8πκ b(ρ) 2 ψV ∂ρ ψV − ψA ∂ρ ψA\n∂q\nρ=ρΛ , q 2 =0\n\u0014\n3\n4\n= −8πκ B̂ − (C̃3V + C̃1V C̃2V − C̃3A − C̃1A C̃2A ) − P (C̃2V 2 − C̃2A 2 )\n3\n4\n\u0015\n8 V V\n3\nV\nA 4ρΛ /3\nV 2\nA2\nA A −4ρΛ /3\n, (4.41)\n+ P (C̃2 − C̃2 )ρΛ − (C̃2 C̃3 − C̃2 C̃3 )e\n− P (C̃2 − C̃2 )e\n4\n3\n0\nψV,A\n= 1 + C̃1V,A q 2 + (C̃2V,A + C̃3V,A q 2 )e−4ρ/3 −\n\nwhere B̂ = 12 ĈA2 H is the constant coefficient of b(ρ) in (4.22).\nClearly, the above answer for the S-parameter diverges in the limit ρΛ → ∞, unless\n\neither C̃2V = C̃2A or both C̃2V,A vanish. However, neither of those two options is possible\nfor the following reason. Recall from (2.20) that:\n\u0002\n\u0003\nΠV (q 2 ) = 2κ b(ρ) ψV0 (q 2 , ρ) ∂ρ ψV0 (q 2 , ρ) ρ=∞ ,\n\u0002\n\u0003\nΠA (q 2 ) = 2κ b(ρ) ψA0 (q 2 , ρ) ∂ρ ψA0 (q 2 , ρ) ρ=∞ .\n22\n\n(4.42)\n\n\fUsing (4.40), this implies that ΠV (q 2 = 0) = const × C̃2V and ΠA (q 2 = 0) = const′ × C̃2A .\n\nOn the other hand, as is well-known, ΠA (0) = Fπ2 with Fπ = 250 GeV being the technipion\ndecay constant, whereas ΠV (0) = 0. Hence we must always have C̃2A 6= C̃2V = 0.14\n\nTherefore, to obtain a finite answer for the S-parameter, we need to renormalize the\n\ngravity action. We will do that in Section 4.4. At this point, let us make the following\ninteresting observation. The leading divergence, arising from the V and A contributions,\nis in fact ∼ e8ρΛ /3 . However, just as in the example of Section 3, it is the same for both V\n\nand A modes and thus cancels in the difference. Another important observation follows\n\nfrom understanding the relation between the small q 2 solution (4.40) and the general\nsolution for any q in (4.25). So let us now turn to that issue.\n4.3.3\n\nRelation to general solution\n\nWe argued earlier that the small q behaviour of the terms in the general solution (4.25)\nshould be given by (4.35).15 According to those expansions, in the q → 0 limit one has\n√\n√\nJ1 ( 32 q P e2ρ/3 ) → 0 and Y1 ( 32 q P e2ρ/3 ) → ∞. We will regulate these solutions in the\n\nsame manner as in Section 3.\n\nMore precisely, we will consider the following rescaling:\n\u0010 √\n\u0011\n3\n\u0012\n−2ρ/3\n\u0013\n2ρ/3\ne\nJ1 2 q P e\n3 √\n\u0011 ,\n\u0010 √\ne−2ρ/3 J1 q P e2ρ/3 →\n2\ne−2ρ• /3 J 3 q P e2ρ• /3\n1\n\n(4.43)\n\n2\n\nwhere ρ• is some finite fixed value completely unrelated to the cut-off ρΛ . Using the\nexpansion (4.35) and expanding the whole ratio in (4.43) in small q, we find:\n\u0010 √\n\u0011\ne−2ρ/3 J1 23 q P e2ρ/3\n9P 4ρ/3\n9P\n\u0011 = 1 + q 2 e4ρ• /3 − q 2\n\u0010 √\ne\n+ O(q 4 ) .\n3\n32\n32\n−2ρ\n/3\n2ρ\n/3\ne • J1 2 q P e •\n\n(4.44)\n\nClearly, each of the terms in (4.44) corresponds to a term in (4.40). However, the latter\nhas additional terms that did not appear in the regulated J1 solution. It is easy to see\nthat those come from regulating the Y1 term in (4.25). Indeed, we find:\n\u0010 √\n\u0011\ne−2ρ/3 Y1 23 q P e2ρ/3\n\u0001 3\n3\n\u0011 = e4ρ• /3 e−4ρ/3 − q 2 P e4ρ• /3 CY1 + CY2 e−4ρ/3 − q 2 P e4ρ• /3 ρ+O(q 4 ) ,\n\u0010 √\n4\n4\ne−2ρ• /3 Y1 23 q P e2ρ• /3\n(4.45)\n14\n\nDespite that, we will keep writing C̃2V in the following, in order to maintain explicit symmetry between\n\nV and A modes.\n15\nWe are again keeping in mind the cut-off ρΛ . So we view ρ as finite, no matter how large, and q as\ninfinitesimal.\n\n23\n\n\fwhere\nCY1\nCY2\n\n√ !\n3\n3q P\n3\n,\n(2γ − 1) + ln\n=\n4\n2\n4\n\"\n√ 2ρ /3 !#\n3\n3\nPe •\n3q\n= e4ρ• /3 (2γ − 1) + ln\n.\n4\n2\n4\n\n(4.46)\n\nNote however, that unlike (4.40), the expression (4.45) contains terms of the form q 2 ln q.\nThe latter can be canceled by additional multiplication by q-dependent expressions that\nare constant w.r.t. to ρ. Namely, multiplying (4.45) by (1 + 89 P e4ρ• /3 q 2 ln q) cancels the\nq 2 ln q term in CY2 , without affecting the rest of the expansion to order q 2 . Similarly, in\norder to cancel the q 2 ln q term in CY1 , we multiply (4.44) by (1 + 89 P e4ρ• /3 q 2 ln q).\nAs in Section 3, note that, in general, we can have different values of ρ• for the J1 and\n\nY1 solutions. I.e. ρJ• 6= ρY• , which is rather important for the matching of the number of\n\nconstants in the small q solution (4.40) and the small q expansion of the general solution\n\nĈ1 e−2ρ/3 J1 + Ĉ2 e−2ρ/3 Y1 . Since the constant piece in (4.40) is normalized to 1, then (4.44)\nimplies that Ĉ1 = 1. Hence the three independent constants, corresponding to C̃1,2,3 , are\nĈ2 , ρJ• and ρY• . To recapitulate, the solution\n\u0012\n\u0013\n4ρY\n•\n9\n\u0012\n\u0013\n1 + 8 Ĉ2 P e 3 q 2 ln q\n3 √ 2ρ/3\n0 2\n−2ρ/3\n\u0013 e\n\u0012\nψ (q , ρ) =\nJ1 q P e\n√\n2ρJ\n2ρJ\n2\n•\n•\n3\n− 3\n3\nJ1 2 q P e\ne\n\u0012\n\n−\n\ne\n\n2ρY\n•\n3\n\n4ρY\n•\n3\n\n2\n\n\u0013\n\n\u0013\n\u0012\nq ln q\n3 √ 2ρ/3\n−2ρ/3\n\u0012\n\u0013 e\nY1 q P e\n√ 2ρY•\n2\n3\nY1 2 q P e 3\n\nĈ2 1 +\n+\n\n9\nPe\n8\n\nhas small q expansion exactly of the form (4.40) with\n\"\n9\n3\n3\n3\nJ\nY\nC̃1 =\nP e4ρ• /3 − P e4ρ• /3 Ĉ2 (2γ − 1) + ln\n32\n4\n4\n2\n\n(4.47)\n\n√ !#\n3 P\n,\n4\n\nY\n\nC̃2 = e4ρ• /3 Ĉ2 ,\nC̃3\n\n\"\n3\n3 8ρY• /3\n3\nĈ2 (2γ − 1) + ln\n= − Pe\n4\n4\n2\n\n!#\n√\nY\n3 P e2ρ• /3\n.\n4\n\n(4.48)\n\nWe have thus understood how (4.40) arises from the general solution (4.25) in the limit\nof small q and for a particular choice of the integration constants.\nNotice that (4.48) implies that the coefficient C̃1 receives contributions from both the\nJ1 and the Y1 terms, whereas each of the coefficients C̃2 and C̃3 comes entirely from the\n24\n\n\fY1 term. This again underscores the observation we made in Section 3, that the intuition\nto disregard the diverging in the q → 0 limit Y1 solution is incorrect. In fact, dropping\n\nthe Y1 solution would have led to an identical zero as each of the terms in the result (4.41)\n\nis proportional to either C̃2 or C̃3 . It is also worth noting that each of the constants C̃1\nand C̃3 is proportional to P .\n\n4.4\n\nRenormalization\n\nHolographic renormalization [14] was developed in the context of the AdS/CFT correspondence as an intrinsic way of taming infrared (IR) divergences that occur in gravitational\nbackgrounds. Recall that large distances on the gravity side correspond to high energies on the dual field theory side. So the gravitational IR divergences are the natural\ncounterpart of the field theoretic UV divergences.\nPrior to holographic renormalization, IR divergences were removed from gravitational\nactions by so called background subtraction [21]. Namely, by choosing a particular reference background and subtracting the action for this reference space-time from the action\nfor the space-time of interest. However, this procedure is ambiguous (as there may be\nmore then one candidate for a reference background) and not always applicable (as in\nsome cases there is no isometric embedding of the regulating boundary into the reference\nspace-time). On the other hand, holographic renormalization is a well-defined intrinsic\nprocedure, that consists of adding new terms on the regulating boundary of the background of interest. These, so called, counterterms can be deduced from the requirement\nthat the total gravitational action be finite, but they also follow from requiring that the\nvariational principle be well-defined.\nInitially, holographic renormalization was developed for a very limited class of gravitational backgrounds, namely asymptotically AdS ones; see [22]. However, recent works\nhave extended the classes of backgrounds, to which this method can be applied, in interesting directions. Most relevant for us, asymptotically linear dilaton (ALD) gravity\nbackgrounds, of which the background in our Section 4.1 is a special case, can be renormalized by adding appropriate counterterms [13]. The reason the background of interest\nfor us falls within this class is that ALD backgrounds occur as near-horizon limits of stacks\nof D5 or NS5 branes in string theory. Recall that the background of [10] is a deformation\nof the original Maldacena-Nunez (MN) solution [12] and both solutions (i.e. the familiar\nMN background and the deformated one) arise from stacks of 5-branes wrapping an S 2 .\nLet us also note that linear dilaton asymptotics, i.e. φ ∼ ρ at large ρ, actually refers to\n25\n\n\fthe asymptotic behaviour of the dilaton in a coordinate system (in string frame) that is\ndifferent from the one used in [13].16 In the conventions of [13], at large ρ in an ALD\nbackground the dilaton behaves as φ ∼ c1 log ρ + c2 + ... with c1,2 constants. Clearly, an\nasymptotically constant dilaton (which is the case of interest for us) is a special case of\nthis behaviour for vanishing coefficient of the log ρ term.\nWithout going into details, let us just state here the essence of the result of [13]. A\ngravitational theory with an (Einstein frame) action of the form:\n\u0012\n\u0013\nZ\n4\n1 2αφ μ1 ...μp\nd+1 √\nμ\nI=\nd x g R−\n∇ φ∇μ φ −\ne F\nFμ1 ...μp ,\nd−1\n2p!\nM\n\n(4.49)\n\nwhere φ is a scalar field and F is a p-form, and with ALD asymptotics for the fields17 can\nbe renormalized by adding a counterterm of the form:\n\u0014\n\u0012\n\u0013\u0015\nZ\n√\nα\nα\n1\n− p−1\nφ\nd\n2αφ\n2\n+ c2 e p−1 R −\nICT =\nd x h c1 e\n,\ne F\n2p!\n∂M\n\n(4.50)\n\nwhere c1 and c2 are constants determined by the finiteness of the total action I +ICT .18 To\nspecialize these general considerations to our case, one needs to take α = 1/2 and p = 3\nand, further, to identify φ with the dilaton and F3 with the RR 3-form field strength of\ntype IIB.\nIn fact, all we need to take away from the above paragraph is that the background\nof interest for us is renormalizable and so it is sensible to study probes in it and their\nimplications for the dual field theory. What we actually need to understand in detail is\nhow to renormalize the action of a probe brane in that background. To do that, let us\nfirst look at the DBI action of a D7 probe with no world-volume gauge fields turned on:\nZ\nZ\np\np\n8\n(4.51)\nSDBI = −T7 d x −detg = −T7 Ω3 d4 x dρ −detg ,\n\nwhere we have absorbed the constant (for us) factor e−φ into the brane tension T7 and, in\n\nthe second equality, we have integrated over the compact directions wrapped by the D7\nbrane. This action can be renormalized by adding a counterterm of the form\nZ\np\nCT\nSDBI = −T7 Ω3 d4 x −detγ × c ,\n\n(4.52)\n\nwhere γ is the metric induced on a regulating surface defined by constant ρ, in the\nnotation of our Section 4.3.2 this surface is given by ρ = ρΛ , and c is an appropriately\n16\n\nFor comparison of the two coordinate systems, see for example [23].\nFor details on the required asymptotic behaviour of the fields, that plays the role of boundary\nconditions, see [13]\n18\nAlternatively, ICT follows from requiring a well-defined variational principle, as mentioned above.\n17\n\n26\n\n\fchosen constant that depends on ρΛ . The counterterm (4.52) has been used recently in\n[24]. It is easy to see that in our case the large ρ divergence of (4.51) is canceled by taking\nc = − 12 A2 H 2 e\n\n8ρΛ\n3\n\n.\n\nFinally, we are ready to turn to the case of interest, namely the DBI action (2.4):\nZ\np\nκ\n(4.53)\nd4 x dρ −detg g ab g cdFac Fbd ,\nSDBI = −\n4\n\nwhere the indices a, b, c, d run over the coordinates xμ and ρ. In view of (4.52), it is natural\nto expect that the action (4.53) can be renormalized by the addition of a counterterm of\nthe form:\n\nZ\np\nκ\n′ ′\n= −c\n(4.54)\nd4 x −detγ γ μν γ μ ν Fμμ′ Fνν ′ ,\n4\nwhere c is an appropriately chosen constant that depends on ρΛ . Indeed, we will show\nCT\nSDBI\n\nnow that this is exactly what happens. Using the decomposition (2.6) for ρ = ρΛ and the\nboundary conditions ψVn ,An (ρΛ ) = 0 and repeating the same kind of considerations as in\nSection 2, it is easy to see that the counterterm (4.54) gives:\nZ\nn\n\u00012\n\u00012 o\nκ\nCT\nV\nA\nSDBI = − c\nd4 x |Fμν\n(q)|2 ψV0 (ρΛ ) + |Fμν\n(q)|2 ψA0 (ρΛ )\n4\nZ\nn\n\u00012\n\u00012 o\nκ\n= −c\nd4 x 2q 2 |Vμ |2 ψV0 (ρΛ ) + 2q 2 |Aμ |2 ψA0 (ρΛ )\n.\n4\n\n(4.55)\n\nNow, the renormalized probe-brane action should give finite S-parameter. Since the latter is what we are really interested in and, furthermore, we have already computed its\ndivergences explicitly (see (4.41)), let us fix the constant c directly at the level of the\nS-parameter. The renormalized S-parameter is obtained from\n2\nΠren\nV (q ) = −\n\n\u0001\nδ δ\nCT\nSDBI + SDBI\nδVμ δVν\n\nV=0\n\n(4.56)\n\nand similarly for Πren\nA . So the contribution to the S-parameter that is due to (4.55) is:\n\u0002\n\u0003\nS CT = 8πκ c (ψV0 )2 − (ψA0 )2 ρ=ρ\n\nΛ ,q\n\n2 =0\n\n,\n\n(4.57)\n\nwhere the numerical coefficient is 8, instead of 4, because of the two branches D7 and D7.\nNow, using the solutions (4.40), we can see that:\n\u0010\n\u0011 4ρΛ\n\u0010\n\u0011 8ρΛ\n\u0002 0 2\n\u0003\n(ψV ) − (ψA0 )2 ρ=ρ ,q2 =0 = C̃2V 2 − C̃2A 2 e− 3 + 2 C̃2V − C̃2A e− 3 .\nΛ\n\nHence the e\nc1 e\n\n8ρΛ\n3\n\n4ρΛ\n3\n\n(4.58)\n\ndivergence in (4.41) can be canceled by a counterterm of the form:\n\u0010\n\u0011\n\u0010\n\u0011 4ρΛ\n\u0002 0 2\n\u0003\n(ψV ) − (ψA0 )2 ρ=ρ ,q2 =0 = c1 C̃2V 2 − C̃2A 2 + 2c1 C̃2V − C̃2A e 3 ,\n(4.59)\nΛ\n\n27\n\n\fwhere c1 = − 83 P B̂. On the other hand, the ρΛ divergence in (4.41) can be canceled by\n\u0010\n\u0011\n\u0010\n\u0011\n\u0003\n4ρΛ \u0002\n4ρ\n0 2\n0 2\nV 2\nA2\n− 3Λ\nV\nA\n3\nc2 ρΛ e\n(ψV ) − (ψA ) ρ=ρ ,q2 =0 = c2 C̃2 − C̃2\nρΛ e\n+ 2c2 C̃2 − C̃2 ρΛ\nΛ\n\n(4.60)\n\nwith c2 =\n\n1\n(C̃2V\n2\n\n+ C̃2A )P B̂. From (4.59) and (4.60), we conclude that to cancel all\n\ndivergences we have to take the constant c in (4.57) to be:\n\u0013\n\u0012\n4ρΛ\n1 V\n3 8ρΛ\nA\ne 3 − (C̃2 + C̃2 )ρΛ e 3 .\nc = −B̂P\n8\n2\n\n(4.61)\n\nNote that, not surprisingly, the leading term in c is of the same form as the coefficient\nneeded to renormalize the action (4.51).\nTo recapitulate, the renormalized S-parameter is obtained by adding (4.41) and (4.57),\nwith c given by (4.61), and taking the limit ρΛ → ∞. Note that, due to the first term on\n\nthe right hand side of (4.59), the counterterm S CT adds a finite contribution to the final\nanswer:\nSfCT\ninite = −8πκB̂P\nHence the renormalized S-parameter is:\n\n\u0011\n3\u0010 V2\nC̃2 − C̃2A 2 .\n8\n\n(4.62)\n\n\u0001\nS + S CT ρ →∞\n\u0015\n\u0014 Λ\n3\n4 V\nV V\nA\nA A\nV 2\nA2\n= −8πκ B̂ − (C̃3 + C̃1 C̃2 − C̃3 − C̃1 C̃2 ) − P (C̃2 − C̃2 ) . (4.63)\n3\n8\n\nSren =\n\nSo far, we kept C̃2V explicitly in order to maintain symmetry between V and A modes.\nHowever, as already pointed out at the end of Section 4.3.2, we should actually set C̃2V = 0.\nSo, the final result is:\nSren\n\n\u0014\n\u0015\n4 V\n3\nA\nA A\nA 2\n= −8πκ B̂ − (C̃3 − C̃3 − C̃1 C̃2 ) + P (C̃2 ) .\n3\n8\n\n(4.64)\n\nNote, again, that we would have missed the term C̃1A C̃2A , had we substituted the boundary\ncondition ψ 0 = 1 in (2.21) before taking the limit ρ → ∞.\n\n5\n\nDiscussion\n\nWe studied a model of walking technicolor, obtained by embedding D7-D7 probes in the\nbackground of [10]. We were able to show that one can extract a finite answer for the\nS-parameter by using holographic renormalization. However, we could not determine\n\n28\n\n\fanalytically the numerical constants C̃1,3 above. Since the latter will depend on the parameters of the gravity background, at this stage it is premature to make conclusions\nabout the value of Sren or its dependence on the length of the walking region. Calculating\nnumerically C̃1,3 and exploring their dependence on background parameters is work in\nprogress [15]. It is worth noting that [25] considered a type IIB background, which is a\nmodification of the one in [10] with a similar walking region but a different UV one. It\nwould be interesting to apply the methods we used here, in order to investigate that modified background and to see whether this would produce a finite (after renormalization)\nS-parameter. If yes, then it could be instructive to explore the differences and similarities\nwith the case studied here.\nFinally, here we have only concentrated on the technicolor sector. However, in order\nto obtain a complete picture, one would have to include the Standard Model fields, presumably via other probe branes embedded in the same background. It would be very\ninteresting to explore this and related issues. In particular, one such issue is the contribution of extended technicolor [26] gauge bosons to the S-parameter. It was argued in\n[27], that the latter would be a rather small effect. It would, clearly, be interesting to\nreproduce that from the gravity side. Also, it would be worth verifying with our methods\nthe lower bound for the S-parameter, that was suggested in [28] based on purely field\ntheoretic arguments.\n\nAcknowledgements\nI would like to thank L. C. R. Wijewardhana for many illuminating discussions and for\nreading the draft. I am also grateful to B. Acharya, P. Argyres, A. Buchel, M. Kruczenski,\nD. Minic, A. Parnachev, R. Shrock and T. Takeuchi for useful conversations and J. Erlich,\nO. Mintakevich, M. Piai and C. Nunez for correspondence. In addition, I thank the Aspen\nCenter for Physics and the Simons workshop in Mathematics and Physics, Stony Brook\n2009, for hospitality during the initial stages of this work. My research is supported by\nDOE grant FG02-84-ER40153.\n\nReferences\n[1] S. Weinberg, Implications of Dynamical Symmetry Breaking, Phys. Rev. D13 (1976)\n974; Implications of Dynamical Symmetry Breaking: An Addendum, Phys. Rev.\n\n29\n\n\fD19 (1979) 1277; L. Susskind, Dynamics of Spontaneous Symmetry Breaking in the\nWeinberg-Salam Theory, Phys. Rev. D20 (1979) 2619.\n[2] M. Peskin and T. Takeuchi, Estimation of Oblique Electroweak Corrections, Phys.\nRev. D46 (1992) 381.\n[3] B. Holdom, Techniodor, Phys. Lett. B150 (1985) 301; K. Yamawaki, M. Bando\nand K. Matumoto, Scale Invariant Technicolor Model and a Technidilaton, Phys.\nRev. Lett. 56 (1986) 1335; T. W. Appelquist, D. Karabali and L. C. R. Wijewardhana, Chiral Hierarchies and the Flavor Changing Neutral Current Problem in\nTechnicolor, Phys. Rev. Lett. 57 (1986) 957.\n[4] M. Piai, Lectures on Walking Technicolor, Holography and Gauge/Gravity Dualities,\narXiv:1004.0176 [hep-ph].\n[5] T. Appelquist and F. Sannino, The Physical Spectrum of Conformal SU(N) Gauge\nTheories, Phys. Rev. D59 (1999) 067702, hep-ph/9806409.\n[6] C. Carone, J. Erlich and M. Sher, Holographic Electroweak Symmetry Breaking\nfrom D-branes, Phys. Rev. D76 (2007) 015015, arXiv:0704.3084 [hep-th]; T. Hirayama and K. Yoshioka, Holographic Construction of Technicolor Theory, JHEP\n0710 (2007) 002, arXiv:0705.3533 [hep-ph]; O. Mintakevich and J. Sonnenschein,\nHolographic Technicolor Models and their S-parameter, JHEP 0907 (2009) 032,\narXiv:0905.3284 [hep-th].\n[7] T. Sakai and S. Sugimoto, Low Energy Hadron Physics in Holographic QCD, Prog.\nTheor. Phys. 113 (2005) 843, hep-th/0412141.\n[8] T. Sakai and S. Sugimoto, More on a Holographic Dual of QCD, Prog. Theor. Phys.\n114 (2005) 1083, hep-th/0507073.\n[9] J. Hirn and V. Sanz, A Negative S Parameter from Holographic Technicolor,\nPhys. Rev. Lett. 97 (2006) 121803, hep-ph/0606086; The Fifth Dimension as an\nAnalogue Computer for Strong Interactions at the LHC, JHEP 0703 (2007) 100,\nhep-ph/0612239; D. Hong and H. Yee, Holographic Estimate of Oblique Corrections\nfor Technicolor, Phys. Rev. D74 (2006) 015011, hep-ph/0602177; M. Piai, Precision Electro-weak Parameters from AdS(5), Localized Kinetic Terms and Anomalous\nDimensions, hep-ph/0608241; Walking in the Third Millennium, hep-ph/0609104;\nVector Mesons from AdS/TC to the LHC arXiv:0704.2205 [hep-ph]; C. Carone, J.\n30\n\n\fErlich and J. Tan, Holographic Bosonic Technicolor, Phys. Rev. D75 (2007) 075005,\nhep-ph/0612242; M. Fabbrichesi, M. Piai and L. Vecchi, Dynamical Electro-weak\nSymmetry Breaking from Deformed AdS: Vector Mesons and Effective Couplings,\nPhys. Rev. D78 (2008) 045009, arXiv:0804.0124 [hep-ph]; K. Haba, S. Matsuzaki\nand K. Yamawaki, S Parameter in the Holographic Walking/Conformal Technicolor, Prog. Theor. Phys. 120 (2008) 691, arXiv:0804.3668 [hep-ph]; J. Hirn, A.\nMartin and V. Sanz, Describing Viable Technicolor Scenarios, Phys. Rev. D78\n(2008) 075026, arXiv:0807.2465 [hep-ph]; D. Dietrich and C. Kouvaris, Generalised\nBottom-up Holography and Walking Technicolour, Phys. Rev. D79 (2009) 075004,\narXiv:0809.1324 [hep-ph].\n[10] C. Nunez, I. Papadimitriou and M. Piai, Walking Dynamics from String Duals, Int.\nJ. Mod. Phys. A25 (2010) 2837, arXiv:0812.3655 [hep-th].\n[11] R. Casero, C. Nunez and A. Paredes, Towards the String Dual of N = 1 SQCD-like\nTheories, Phys. Rev. D73 (2006) 086005, hep-th/0602027.\n\n[12] J. Maldacena and C. Nunez, Towards the Large N Limit of Pure N = 1 Super Yang\nMills, Phys. Rev. Lett. 86 (2001) 588, hep-th/0008001.\n\n[13] R. Mann and R. McNees, Boundary Terms Unbound! Holographic Renormalization\nof Asymptotically Linear Dilaton Gravity, Class. Quant. Grav. 27 (2010) 065015,\narXiv:0905.3848 [hep-th].\n[14] M. Henningson and K. Skenderis, The Holographic Weyl Anomaly, JHEP 9807\n(1998) 023, hep-th/9806087; V. Balasubramanian and P. Karuse, A Stress Tensor\nfor Anti-de Sitter Gravity, Commun. Math. Phys. 208 (1999) 413, hep-th/9902121;\nR. Emparan, C. Johnson and R. Myers, Surface Terms as Counterterms in the\nAdS/CFT Correspondence, Phys. Rev. D60 (1999) 104001, hep-th/9903238; J. de\nBoer, E. Verlinde, H. Verlinde, On the Holographic Renormalization Group, JHEP\n0008 (2000) 003, hep-th/9912012; S. de Haro, K. Skenderis and S. Solodukhin, Holographic Reconstruction of Spacetime and Renormalization in the AdS/CFT Correspondence, Commun. Math. Phys. 217 (2001) 595, hep-th/0002230; M. Bianchi, D.\nFreedman and K. Skenderis, Holographic Renormalization, Nucl.Phys. B631 (2002)\n159, hep-th/0112119; I. Papadimitriou and K. Skenderis, AdS/CFT Correspondence\nand Geometry, hep-th/0404176 .\n[15] L. Anguelova, P. Suranyi and L. C. R. Wijewardhana, work in progress.\n31\n\n\f[16] A. Belitsky, Dual Technicolor with Hidden Local Symmetry, arXiv:1003.0062 [hepph].\n[17] S. Hong, S. Yoon and M. Strassler, On the Couplings of Vector Mesons in AdS/QCD,\nJHEP 0604 (2006) 003, hep-th/0409118.\n[18] S. Kuperstein and J. Sonnenschein, A New Holographic Model of Chiral Symmetry\nBreaking, JHEP 0809 (2008) 012, arXiv:0807.2897 [hep-th].\n[19] D. Freedman, S. Mathur, A. Matusis and Rastelli, Correlation Functions in the\nCFTd /AdSd+1 Correspondence, Nucl. Phys. B546 (1999) 96, hep-th/9804058.\n[20] C. Hoyos-Badajoz, C. Nunez and I. Papadimitriou, Comments on the String Dual\nto N = 1 SQCD, Phys. Rev. D78 (2008) 086005, arXiv:0807.3039 [hep-th].\n[21] G. Gibbons and S. Hawking, Action Integrals and Partition Functions in Quantum\nGravity, Phys. Rev. D15 (1977) 2752.\n[22] K. Skenderis, Lecture Notes on Holographic Renormalization, Class. Quant. Grav.\n19 (2002) 5849, hep-th/0209067.\n[23] D. Marolf and A. Virmani, Holographic Renormalization of Gravity in Little String\nTheory Duals, JHEP 0706 (2007) 042, hep-th/0703251.\n[24] T. Hirayama, P. Kao, S. Kawamoto and F. Lin, Unruh Effect and Holography,\narXiv:1001.1289 [hep-th].\n[25] D. Elander, C. Nunez and M. Piai, A Light Scalar from Walking Solutions in GaugeString Duality, Phys. Lett. B686 (2010) 64, arXiv:0908.2808 [hep-th]; C. Nunez, M.\nPiai and A. Rago, Wilson Loops in String Duals of Walking and Flavored Systems,\nPhys. Rev. D81 (2010) 086001, arXiv:0909.0748 [hep-th].\n[26] S. Dimopoulos and L. Susskind, Mass Without Scalars, Nucl. Phys. B155 (1979)\n237; E. Eichten and K. Lane, Dynamical Breaking of Weak Interaction Symmetries,\nPhys. Lett. B90 (1980) 125.\n[27] M. Kurachi, R. Shrock and K. Yamawaki, Z Boson Propagator Correction in\nTechnicolor Theories with ETC Effects Included, Phys. Rev. D76 (2007) 035003,\narXiv:0704.3481 [hep-ph].\n\n32\n\n\f[28] F. Sannino,\n\nMass Deformed Exact S-parameter in Conformal Theories,\n\narXiv:1006.0207 [hep-lat].\n\n33\n\n\f"}