{"id": "http://arxiv.org/abs/1103.5395v1", "guidislink": true, "updated": "2011-03-28T15:47:59Z", "updated_parsed": [2011, 3, 28, 15, 47, 59, 0, 87, 0], "published": "2011-03-28T15:47:59Z", "published_parsed": [2011, 3, 28, 15, 47, 59, 0, 87, 0], "title": "Implications of the Babinet Principle for Casimir Interactions", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1103.1443%2C1103.0115%2C1103.4486%2C1103.4980%2C1103.1715%2C1103.3892%2C1103.4674%2C1103.6001%2C1103.5276%2C1103.3930%2C1103.1431%2C1103.4379%2C1103.0638%2C1103.5539%2C1103.1316%2C1103.5452%2C1103.3080%2C1103.6104%2C1103.5107%2C1103.0214%2C1103.5699%2C1103.1131%2C1103.3089%2C1103.3056%2C1103.5862%2C1103.2064%2C1103.0891%2C1103.1818%2C1103.2757%2C1103.4427%2C1103.5289%2C1103.0141%2C1103.3949%2C1103.0799%2C1103.1611%2C1103.1712%2C1103.2399%2C1103.3414%2C1103.1584%2C1103.6221%2C1103.2466%2C1103.2188%2C1103.2586%2C1103.4735%2C1103.6190%2C1103.3044%2C1103.5395%2C1103.4270%2C1103.2043%2C1103.4239%2C1103.0688%2C1103.4348%2C1103.3661%2C1103.0709%2C1103.4187%2C1103.3810%2C1103.0190%2C1103.0943%2C1103.3802%2C1103.3345%2C1103.0260%2C1103.4242%2C1103.2098%2C1103.2736%2C1103.5030%2C1103.5304%2C1103.4135%2C1103.4175%2C1103.4855%2C1103.2321%2C1103.3478%2C1103.1120%2C1103.0248%2C1103.6058%2C1103.0049%2C1103.0627%2C1103.1107%2C1103.4752%2C1103.2906%2C1103.6010%2C1103.3319%2C1103.5169%2C1103.0206%2C1103.1604%2C1103.1998%2C1103.3630%2C1103.5661%2C1103.1658%2C1103.4095%2C1103.4088%2C1103.1368%2C1103.3524%2C1103.5713%2C1103.0781%2C1103.2218%2C1103.3507%2C1103.1389%2C1103.3342%2C1103.0292%2C1103.2635%2C1103.0658&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Implications of the Babinet Principle for Casimir Interactions"}, "summary": "We formulate the Babinet Principle (BP) as a relation between the scattering\namplitudes for electromagnetic waves, and combine it with multiple scattering\ntechniques to derive new properties of Casimir forces. We show that the Casimir\nforce exerted by a planar conductor or dielectric on a self- complementary\nperforated planar mirror is approximately half that on a uniform mirror\nindependent of the distance between them. The BP suggests that Casimir edge\neffects are anomalously small, supporting results obtained earlier in special\ncases. Finally, we illustrate how the BP can be used to estimate Casimir forces\nbetween perforated planar mirrors.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1103.1443%2C1103.0115%2C1103.4486%2C1103.4980%2C1103.1715%2C1103.3892%2C1103.4674%2C1103.6001%2C1103.5276%2C1103.3930%2C1103.1431%2C1103.4379%2C1103.0638%2C1103.5539%2C1103.1316%2C1103.5452%2C1103.3080%2C1103.6104%2C1103.5107%2C1103.0214%2C1103.5699%2C1103.1131%2C1103.3089%2C1103.3056%2C1103.5862%2C1103.2064%2C1103.0891%2C1103.1818%2C1103.2757%2C1103.4427%2C1103.5289%2C1103.0141%2C1103.3949%2C1103.0799%2C1103.1611%2C1103.1712%2C1103.2399%2C1103.3414%2C1103.1584%2C1103.6221%2C1103.2466%2C1103.2188%2C1103.2586%2C1103.4735%2C1103.6190%2C1103.3044%2C1103.5395%2C1103.4270%2C1103.2043%2C1103.4239%2C1103.0688%2C1103.4348%2C1103.3661%2C1103.0709%2C1103.4187%2C1103.3810%2C1103.0190%2C1103.0943%2C1103.3802%2C1103.3345%2C1103.0260%2C1103.4242%2C1103.2098%2C1103.2736%2C1103.5030%2C1103.5304%2C1103.4135%2C1103.4175%2C1103.4855%2C1103.2321%2C1103.3478%2C1103.1120%2C1103.0248%2C1103.6058%2C1103.0049%2C1103.0627%2C1103.1107%2C1103.4752%2C1103.2906%2C1103.6010%2C1103.3319%2C1103.5169%2C1103.0206%2C1103.1604%2C1103.1998%2C1103.3630%2C1103.5661%2C1103.1658%2C1103.4095%2C1103.4088%2C1103.1368%2C1103.3524%2C1103.5713%2C1103.0781%2C1103.2218%2C1103.3507%2C1103.1389%2C1103.3342%2C1103.0292%2C1103.2635%2C1103.0658&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We formulate the Babinet Principle (BP) as a relation between the scattering\namplitudes for electromagnetic waves, and combine it with multiple scattering\ntechniques to derive new properties of Casimir forces. We show that the Casimir\nforce exerted by a planar conductor or dielectric on a self- complementary\nperforated planar mirror is approximately half that on a uniform mirror\nindependent of the distance between them. The BP suggests that Casimir edge\neffects are anomalously small, supporting results obtained earlier in special\ncases. Finally, we illustrate how the BP can be used to estimate Casimir forces\nbetween perforated planar mirrors."}, "authors": ["Mohammad F. Maghrebi", "Ronen Abravanel", "Robert L. Jaffe"], "author_detail": {"name": "Robert L. Jaffe"}, "author": "Robert L. Jaffe", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevD.84.061701", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1103.5395v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1103.5395v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1103.5395v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1103.5395v1", "arxiv_comment": null, "journal_reference": "Phys. Rev. D 84, 061701(R) (2011)", "doi": "10.1103/PhysRevD.84.061701", "fulltext": "Implications of the Babinet Principle for Casimir Interactions\nMohammad F. Maghrebi and Robert L. Jaffe\nCenter for Theoretical Physics, and Department of Physics,\nMassachusetts Institute of Technology, Cambridge, MA 02139, USA\n\nRonen Abravanel\n\narXiv:1103.5395v1 [quant-ph] 28 Mar 2011\n\nDepartment of Physics, Technion, Haifa 32000, Israel\nWe formulate the Babinet Principle (BP) as a relation between the scattering amplitudes for\nelectromagnetic waves, and combine it with multiple scattering techniques to derive new properties of\nCasimir forces. We show that the Casimir force exerted by a planar conductor or dielectric on a selfcomplementary perforated planar mirror is approximately half that on a uniform mirror independent\nof the distance between them. The BP suggests that Casimir edge effects are anomalously small,\nsupporting results obtained earlier in special cases. Finally, we illustrate how the BP can be used\nto estimate Casimir forces between perforated planar mirrors.\n\nIn 1948, Casimir predicted an attractive force between\nmetal plates arising from vacuum fluctuations of the electromagnetic field [1]. A systematic understanding of the\nCasimir effect is important for a vast range of physical\nproblems from high energy physics to condensed matter\nsystems [2]. The advent of precision experimental measurements of Casimir forces [3–6] and the possibility of\napplications to micron- and nano-scale electromechanical devices has stimulated interest in developing efficient\nways to compute these forces both analytically [2, 7–9]\nand numerically [10–12]. In particular, a multipole scattering method has been developed and used to compute\nCasimir forces among multiple objects of various shapes\nand electromagnetic properties [8, 13]. The essential ingredient in this formalism is the amplitude, expressed in\na convenient basis, for electromagnetic waves to scatter\nfrom the individual objects. While the conceptual foundations of the method harken back to earlier formalisms\n[14], the successful implementation is quite recent.\nThe classical Babinet Principle relates the diffraction\npatterns of waves scattering from two complementary\nscreens, taken to be flat surfaces, the holes in one being filled in the other and vice versa. The screens are assumed to have negligible thickness and to enforce boundary conditions on the scattering field, either Dirichlet\n(D), or Neumann (N) for scalar fields, or perfectly conducting (EM) for electromagnetic waves. The conflicting\nassumptions of perfect conductivity and negligible thickness place restrictions on the conditions where the BP\ncan be applied. At the end we estimate these conditions\nfor a good conductor like gold.\nWe first state the Babinet Principle in a form suited\nto our purposes, as a relation between scattering amplitudes. Then we show how the BP can be combined\nwith the scattering theory approach to Casimir forces\nto make predictions for physically interesting configurations. We start with self-complementary geometries in\ne are identical\nwhich the screen Σ and its complement, Σ,\nup to a translation or rotation. In this case we use the\nBP to show that the electromagnetic Casimir force between such a screen and a perfect mirror is approximately\n\nhalf the force between two perfect mirrors. Subject to a\nproviso about the locality of Casimir forces, we suggest\nthat Casimir edge effects are anomalously small in electromagnetism. Finally we show how the BP can be used\nto compute the Casimir force between perforated screens.\nThe scattering of waves from a screen is described in\nterms of a scattering amplitude, F, related to the unitary\nS-matrix by F = 12 (S − I). In the absence of the screen\nF vanishes. It is convenient to distinguish the contribution to F corresponding to transmission of waves across a\nscreen, denoted by T, from the contribution corresponding to waves that are reflected, denoted by R. Thus, a\nwave |φinc i incident from the left on a screen Σ gives\nrise to a reflected wave R|φinc i and a transmitted wave,\nT|φinc i, a situation displayed in Fig. 1.\n\nR|ki\n\nT|ki\n\n|ki\nFigure 1: The two different channels of the scattering matrix. R characterizes the scattering back to the same side as\nthe incident field while T gives the forward scattering to the\nopposite side of the screen.\n\nFor the sake of simplicity and clarity, we discuss the\ncase of a scalar field and then quote the generalization to\nelectromagnetism. Without loss of generality, we assume\na planar incident wave |ki impinging on the screen from\nthe left side, kz > 0. The scattering off the screen Σ is\ndefined by the ansatz\n(\nP\n|ki + k0 R k0 ,k |k0 i\non the left ,\nP\n|φi =\n(1)\n|ki + k0 T k0 ,k |k0 i\non the right .\nNote that the trivial forward scattering is separated out\nfrom the diffraction described by R and T. If the same\n\n\f2\nincident wave, |ki, shines on the complementary screen,\ne the scattering can be described by a similar ansatz\nΣ,\nwith the corresponding scattering amplitudes denoted by\ne and T.\ne The scattering is determined by the boundR\nary conditions that the scalar field obeys on the screen,\nwhich we take to be either Dirichlet or Neumann. Applied to scalar fields, the BP relates the diffraction of a\nfield that obeys a Dirichlet boundary condition on Σ, to\nthe diffraction experienced by a field that obeys a Neue and vice versa.\nmann boundary condition on Σ,\nThe proof of the Babinet Principle is discussed in many\ntextbooks where it is usually assumed that one screen has\ncompact support, while its complement extends to infinity. We have extended the BP for both scalar and electromagnetic fields to the case where neither screen has\ncompact support, e.g. each is a half-plate. The proof\nis inspired by an argument in Ref. [15], and is based\non the fact that a general solution to the wave equation can be cast as a sum of terms even or odd in z. In\nthe Dirichlet (Neumann) case the odd (even) solution is\ntrivial. It is not hard to show that an odd solution in the\nNeumann case for screen Σ can be constructed from the\ne in the Dirichlet case and vice versa.\neven solution for Σ\nUniqueness of solutions to the Helmholtz equation fixes\nthe correspondence of solutions to be one-to-one. A linear\ncombination of even and odd terms sets up the scattering ansatz with incoming wave only on the left side of\nthe screen, and is the unique solution of the scattering\nproblem. The result is a relation between transmission\nand reflection matrices for the screen and its complement.\nFor the scalar case,\nD/N\ne N/D\n0\nR k0 ,k − R\nk0 ,k = ∓Ik ,k .\n\n(2)\n\nwhere Ik0 ,k ≡ (2π)\n− kk ) with kk being the component of the planar wave parallel to the screen. As a\ne\ncheck, if the screen Σ is the entire plane so the screen Σ\nD/N\nis the null set, then Rk0 ,k = ∓Ik0 ,k as expected. For the\nother channel, the BP dictates\n2\n\nδ(k0k\n\nD/N\n\nN/D\n\ne 0 = −Ik0 ,k .\nT k0 ,k + T\nk ,k\n\n(3)\n\nOnce again this can be checked in the limiting case where\nΣ is either a full screen or the null set. For example in the\nD/N\nformer case Tk0 ,k = −Ik0 ,k , which cancels the incident\nwave on the left side of the screen.\nSimilar equations hold for electromagnetism. However,\na slight complication arises since the scattering from a\nscreen generally mixes electric (E) and magnetic (M) polarizations. The Babinet Principle must then be cast in\na matrix form,\n MM\n\n!\ne EE RM E + R\ne EM\nR\n−R\n−1\n0\n\n=I\n,\n(4)\n0\n1\nEM\nME\nEE\nMM\ne\ne\nR\n+R\nR\n−R\n MM\n\n!\nEE\nME\ne\ne EM\nT\n+T\nT\n−T\n\n = I −1 0 , (5)\n0 −1\ne M E TEE + T\neM M\nTEM − T\n\nwhere the labels {k, k0 } have been suppressed.\nThe Babinet Principle can be used to learn electromagnetic properties of new geometries based on their complementary partners. We can exploit this for geometries\nwhere we understand one side of the complementarity,\nbut it can be used even when the scattering properties\nof neither side are known, namely when the screens are\ne up to a translation or roself-complementary, i.e. Σ = Σ,\ntation. An example of such a geometry is a semi-infinite\nplate, whose complement is also a half-plate, infinitely\nextended in the opposite direction. Other examples include a regular array of strips (with their size being the\nsame as the gap between the strips), a checkerboard (an\narray of diagonally placed squares), and various angular\nsubdivisions of the plane, see Fig. 2. Since these geometries are self-complementary, their scattering matrices are\nequal to their complement's.\n\nd\n\na\n\na\n\nd\n\nd\n\nd\nFigure 2: Self-complementary geometries, each facing an infinite plate.\n\nTo incorporate the BP into the Casimir interaction,\nwe take advantage of an expansion of the energy in\nmultiple scatterings between objects [26]. The Casimir\ninteraction\nenergy of two objects is given by E =\nR\n~c ∞\ndκ\ntr\nln\n(I − F1 U12 F2 U21 ) where the Fs are scat2π 0\ntering amplitudes and the Us are translation matrices\nwhich capture the appropriate translations and rotations\nbetween the scattering bases for each object [7, 8]. When\nexpanded in F1 U12 F2 U21 , this expression gives a series\nin multiple reflections which converges very rapidly in all\ncases that have been studied [16–18]. In the case of parallel plates, for example, the first reflection captures about\n93% of the total energy, and in other cases like sphereplate, it does even better. RWe therefore focus on the first\n~c ∞\nreflection term, E1 ≡ − 2π\ndκ tr (F1 U12 F2 U21 ), where\n0\nwe can directly apply the BP. Below we argue that corrections due to higher reflections are at most a few percent.\nLet us consider an infinite plate, either dielectric or\nconductor, opposite a conducting, self-complementary\nscreen, some examples of which are given in Fig. 2. Only\nthe reflection amplitudes come into play in this config-\n\n\f3\n0\n\nP\nuration. Reflection from an infinite plate, RP\n, is di0\nP 0P\nPP\nagonal in polarization, hence R0\n= R0 δP 0 P . So are\n0\nthe translation matrices UP P = UP P δP 0 P . The Casimir\nenergy in the first reflection then becomes\nZ ∞\n\u0011\n\u0010\n~c X\nP PP PP PP †\n(6)\ndκ tr RP\nU\nR\nU\nE1 = −\n0\n2π\n0\nP =E,M\n\nwhere R is the reflection amplitude for the selfcomplementary geometry. Equation (4) relates the reflece EE = −I\ntion matrices of opposite polarizations, RM M −R\nEE\nMM\ne\nand R − R\n= I. Using this, one can show that the\nsum E1 + Ẽ1 is equal to the energy of two infinite plates\nin the first reflection. However, for a self-complementary\ne up to a trivial translation or rotation\ngeometry R = R\nmatrix. E1 and Ee1 are therefore equal and both equal\nto half the interaction of two infinite plates in the first\nreflection approximation. For a perfect conductor, this\nreads\nE1 =\n\n1\n~cA\nE1 (parallel-plates) = −\n.\n2\n16π 2\n\n(7)\n\nThis result is independent of any internal length scale\nthat characterizes the self-complementary geometry.\nThus, for example, the size of the strips, the squares,\nor the wedges in Fig. 2 does not enter the expression for\nthe energy in the first reflection.\nThe higher-reflection corrections to Eq. (7) are no\nworse than the case of two parallel plates, where they are\nless than 8%. This is because the higher reflection terms\ninvolve higher powers of the R of the self-complementary\ngeometry. The absolute value of the eigenvalues of R are\nall less than (or equal to) unity (whereas those of an infinite reflecting plate, are all unity), so higher reflections'\ncontributions are further suppressed.\nIf the separation between Σ and the reflecting plate is\nmuch smaller than the length scale of the structure on\nthe screen (e.g. d \u001c a in Fig. 2), then our result follows from the proximity force approximation (PFA) and\nis not surprising [19]. This approximation treats the objects locally as parallel plates and is exact in the limit of\nclose proximity. When the separation is comparable to\nor larger than the length scales of Σ, then our result is by\nno means obvious. In fact, one might have thought that\na mesh like the checkerboard completely reflects electromagnetic waves with wavelength ∼ d, when d \u001d a leading to E1 → E1 (parallel-plates) as is the case, for example,\nfor corrugated or pitted conductor when d is large compared to the length scale of the corrugations or pitting\n[20].\nAn interesting special case is a half-plate. On dimensional grounds the energy can be separated into two contributions, E = Earea + Eedge , the first proportional to\nthe area and the second proportional to the edge length.\nThe former is given by Earea = −π 2 ~cA/720d3 where A\nis the area and d is the separation distance. Equation (7)\nrules out the edge term in the first reflection, Eedge 1 = 0,\n\nsince the energy differs from parallel plates only by a trivial factor of one-half - which accounts for the area of\nthe half-plate. A similar argument shows that for scalar\nfields, the Dirichlet and Neumann edge terms are equal\nin magnitude and opposite in sign in the first reflection\napproximation. The absence of the edge term in the first\nreflection for a half-plate geometry was first observed in\nRef. [17], as a limiting case of a wedge with zero opening\nangle.\nWe believe this argument can be generalized further.\nConsider a screen Σ with structure characterized by a\nminimum length scale, a. Then as the separation from a\nreflecting plate, d, goes to zero, the leading contribution\nto the Casimir interaction energy, proportional to A/d3 ,\nis captured by the PFA, because the set up is locally\nindistinguishable from segments of parallel plates. If the\nnext term in the expansion in 1/d is also determined\nlocally, then it must be proportional to the perimeter\nof the screen Σ,\n\u0012\n\u0013\nA\nP\nE ∼ −~c αA 3 + αP 2 + * * * .\n(8)\nd→0\nd\nd\nThe coefficient of the first term is set by the PFA,\nαA = π 2 /720. Locally as d → 0 any edge looks like a\nhalf-plate so we can conclude that αP is zero in first reflection, which in turn implies that the edge effects are\nvery small. More precisely, if edge effects are local, for\nelectromagnetism |αP | \u001c αA , while for Dirichlet and\nNeumann boundary conditions (for which, the edge term\nis not absent in the first reflection), we have |αP | ∼ αA\n[17, 21]. The absence of an edge term in the electromagnetic Casimir energy for a piston geometry [22] supports\nthis conjecture.\nFinally we consider a screen with small apertures.\nThe classical application of the BP in optics is to relate\ndiffraction by an aperture to diffraction by its complement. If the aperture is small, then its complement is a\nsmall object whose Casimir interactions can be computed\nin the Casimir-Polder limit [23]. The exact relation involves interchanging polarizations as given in Eqs. (4)\nand (5). For a screen with a small hole opposite an infinite reflecting plate it is easy to show that in the first\nreflection approximation, the energy is given by the interaction of two infinite plates minus the interaction of the\ncomplementary object with the infinite plate. This gives\na small correction to the force between parallel plates.\nAn interesting case is the lateral force between two\nscreens with perforations. The energy can be written as\nthe sum of the interaction between parallel plates (without the holes), the hole-plate and plate-hole interactions,\nand the hole-hole interaction, plus higher reflections,\nE = Eplates + Eplate−hole + Ehole−plate + Ehole−hole + * * * .\nOnly the interaction between the holes can give rise to a\nlateral force between the two plates and Ehole−hole is given\nby the electromagnetic interaction between two objects\nof the same size and position as the holes. If the holes are\nsmall compared to the interscreen separation the higher\nreflections are negligible.\n\n\f4\n8π∆10 F\n~cα2 A\n0.015 d\n\n∆\n\nd = 2∆\n\n0.010\n0.005\n-0.005\n\nδ\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1.0\n\nδ\n∆\n\n-0.010\n-0.015\nFigure 3: The lateral force per area as a function of the displacement δ. For this graph, we chose d = 2∆. The point\nδ = 0 is an stable equilibrium of this configuration.\n\nAs an application of this, we consider two perforated\nplates, each with a square array of small circular holes\nof radius R and center-to-center separation ∆; the two\nplates are placed in parallel separated by a distance d.\nAccording to the BP and in leading order in R/d and\nR/∆, the lateral force between the two plates is identical\nto the lateral force between two arrays of discs with the\nsame size and spacing as the holes. The Casimir interaction between two objects with electric polarizability [27]\nmatrices α1 and α2 is given by [24, 25]\n\nIn this equation, Ω = n̂n̂T with n̂ being the unit vector connecting the two dipoles separated by a distance\nr. The force between the two arrays of dipoles can be\ncomputed easily. For a perfect conductor α1 = α2 =\ndiag {α, α, 0} where α = 4R3 /3π; only the polarizability\ncomponents parallel to the disk are nonzero. Figure 3\nshows the lateral force as a function of the lateral displacement δ.\nFinally we comment on the physical conditions that\nmust be satisfied for the BP to apply to a screen made of\na good conductor like gold. On the one hand the screen\nmust be a good conductor . On the other hand, it should\nbe thin enough to be considered as a screen of negligible\nthickness. So the thickness t should satisfy δ \u001c t \u001c d\nwhere δ is the skin depth and d is the separation distance.\nThe\np skin depth is determined from the frequency by δ =\n2/μ0 ωσ. For separation d, the relevantpfrequency is\nω ∼ 2πc/d, and the inequalities become d/πcμ0 σ \u001c\nt \u001c d. For gold the skin depth√is δ ≈ 5nm at d ≈ 1μm\nand decreases proportional to d as d decreases. For\nmeasurements in the d ∼ 0.5 − 1.0μm range a thickness\nof 100nm should suffice while for d ∼ 0.1 − 0.5μm, it\nshould be reduced to t ∼30nm.\n\nWe thank T. Emig, N. Graham, M. Kardar and\nM. Krüger for helpful conversations. This work was supported in part by the U. S. Department of Energy under\ncooperative research agreement #DF-FC02-94ER40818\n~c\nE =−\n(13 tr(α1 α2 ) − 56 tr(α1 α2 Ω) + 63 tr(Ωα1 Ωα2 )) . (RLJ and MFM) and the NSF Grant No. DMR-088πr7\n03315, DARPA contract No. S-000354 (MFM).\n(9)\n\n[1] H. B. G. Casimir, Proc. K. Ned. Akad. Wet. 51, 793\n(1948).\n[2] K. A. Milton, The Casimir Effect: Physical Manifestations of Zero-Point Energy, World Scientific, Singapore,\n2001.\n[3] S. K. Lamoreaux, Phys. Rev. Lett. 78, 5 (1997).\n[4] U. Mohideen and A. Roy, Phys. Rev. Lett. 81, 4549\n(1998).\n[5] B. W. Harris, F. Chen, and U. Mohideen, Phys. Rev. A\n62, 052109 (2000).\n[6] G. Bressi, G. Carugno, R. Onofrio, and G. Ruoso, Phys.\nRev. Lett. 88, 041804 (2002).\n[7] O. Kenneth and I. Klich, Phys. Rev. Lett. 97, 160401\n(2006).\n[8] T. Emig, N. Graham, R. L. Jaffe, and M. Kardar, Phys.\nRev. Lett. 99, 170403 (2007).\n[9] M. Bordag, G. L. Klimchitskaya, U. Mohideen, and V. M.\nMostepanenko, Advances in the Casimir effect, Oxford\nUniversity Press, Oxford, 2009.\n[10] H. Gies and K. Klingmüller, Phys. Rev. D 74, 045002\n(2006).\n[11] M. T. H. Reid, A. W. Rodriguez, J. White, and S. G.\nJohnson, Phys. Rev. Lett. 103, 040401 (2009).\n[12] S. Pasquali and A. C. Maggs, J. Chem. Phys. 129, 014703\n(2008).\n[13] S. J. Rahi, T. Emig, N. Graham, R. L. Jaffe, and M. Kardar, Phys. Rev. D 80, 085021 (2009).\n\n[14] R. Balian and B. Duplantier, Ann. Phys. (N.Y.) 104,\n300 (1977); Ann. Phys. (N.Y.) 112, 165 (1978).\n[15] E. M. Lifshitz and L. P. Pitaevskii, The electrodynamics\nof continuous media, Pergamon Press, Oxford, 2 edition,\n1984.\n[16] A. Scardicchio and R. L. Jaffe, Nucl. Phys. B 704, 552\n(2005).\n[17] M. F. Maghrebi, S. J. Rahi, T. Emig, N. Graham, R. L.\nJaffe, and M. Kardar, to be published in the PNAS.\n[18] M. F. Maghrebi, Phys. Rev. D 83, 045004 (2011).\n[19] B. V. Derjaguin, I. I. Abrikosova, and E. M. Lifshitz, Q.\nRev. Chem. Soc. 10, 295 (1956).\n[20] T. Emig, A. Hanke, R. Golestanian, and M. Kardar,\nPhys. Rev. Lett. 87, 260402 (2001).\n[21] N. Graham et al., Phys. Rev. D 81, 061701(R) (2010).\n[22] M. P. Hertzberg, R. L. Jaffe, M. Kardar, and A. Scardicchio, Phys. Rev. Lett. 95, 250402 (2005).\n[23] H. B. G. Casimir and D. Polder, Phys. Rev. 73, 360\n(1948).\n[24] G. Feinberg and J. Sucher, Phys. Rev. A 2, 2395 (1970).\n[25] T. Emig, N. Graham, R. L. Jaffe, and M. Kardar, Phys.\nRev. A 79, 054901 (2009).\n[26] The BP was used to relate the Casimir energy of an isolated screen to its complement in N. Graham and K. D.\nOlum, Phys. Rev. D 72, 025013 (2005).\n[27] For simplicity we ignore magnetic response.\n\n\f"}