{"id": "http://arxiv.org/abs/0706.3697v1", "guidislink": true, "updated": "2007-06-25T19:18:21Z", "updated_parsed": [2007, 6, 25, 19, 18, 21, 0, 176, 0], "published": "2007-06-25T19:18:21Z", "published_parsed": [2007, 6, 25, 19, 18, 21, 0, 176, 0], "title": "Thermal electric effects and heat generation in polypyrrole coated PET\n  fabrics", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.0361%2C0706.0125%2C0706.2135%2C0706.2627%2C0706.3099%2C0706.4103%2C0706.3383%2C0706.0588%2C0706.3825%2C0706.3540%2C0706.2451%2C0706.0970%2C0706.2795%2C0706.0308%2C0706.0732%2C0706.0771%2C0706.0660%2C0706.2972%2C0706.2468%2C0706.0127%2C0706.0130%2C0706.3215%2C0706.2251%2C0706.2685%2C0706.0177%2C0706.0570%2C0706.0479%2C0706.1636%2C0706.3967%2C0706.1572%2C0706.0119%2C0706.3817%2C0706.0492%2C0706.4480%2C0706.2985%2C0706.2096%2C0706.2821%2C0706.3697%2C0706.0074%2C0706.0809%2C0706.0635%2C0706.0532%2C0706.4376%2C0706.2383%2C0706.2741%2C0706.4408%2C0706.4369%2C0706.3504%2C0706.2483%2C0706.3196%2C0706.2436%2C0706.2889%2C0706.4189%2C0706.3723%2C0706.0046%2C0706.2355%2C0706.2651%2C0706.4168%2C0706.0392%2C0706.1305%2C0706.2095%2C0706.1513%2C0706.1499%2C0706.0462%2C0706.3576%2C0706.0012%2C0706.0005%2C0706.3672%2C0706.1852%2C0706.0276%2C0706.0403%2C0706.1623%2C0706.4409%2C0706.2305%2C0706.4014%2C0706.2716%2C0706.3623%2C0706.0609%2C0706.4429%2C0706.2033%2C0706.3281%2C0706.0933%2C0706.1797%2C0706.0123%2C0706.3733%2C0706.1879%2C0706.2732%2C0706.1972%2C0706.3232%2C0706.4320%2C0706.2136%2C0706.0613%2C0706.0200%2C0706.2758%2C0706.1671%2C0706.1818%2C0706.1988%2C0706.1022%2C0706.2398%2C0706.2093%2C0706.3297&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Thermal electric effects and heat generation in polypyrrole coated PET\n  fabrics"}, "summary": "Polypyrrole chemically synthesized on PET gives rise to textiles with a high\nelectric conductivity, suitable for several applications from antistatics to\nelectromagnetic interference shielding devices. Here, we discuss investigations\non thermal electric performances of the polypyrrole coated PET in a wide range\nof temperatures above room temperature. The Seebeck coefficient turns out to be\ncomparable with that of metal thermocouple materials. Since polypyrrole shows\nextremely low thermal diffusivities regardless of the electrical conductivity,\nthe low thermal conductivity gives significant advantage to the thermoelectric\nfigure-of-merit ZT, comparable with that of some traditional inorganic\nthermoelectric materials. The heat generation is also investigated for possible\nheating textile devices.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.0361%2C0706.0125%2C0706.2135%2C0706.2627%2C0706.3099%2C0706.4103%2C0706.3383%2C0706.0588%2C0706.3825%2C0706.3540%2C0706.2451%2C0706.0970%2C0706.2795%2C0706.0308%2C0706.0732%2C0706.0771%2C0706.0660%2C0706.2972%2C0706.2468%2C0706.0127%2C0706.0130%2C0706.3215%2C0706.2251%2C0706.2685%2C0706.0177%2C0706.0570%2C0706.0479%2C0706.1636%2C0706.3967%2C0706.1572%2C0706.0119%2C0706.3817%2C0706.0492%2C0706.4480%2C0706.2985%2C0706.2096%2C0706.2821%2C0706.3697%2C0706.0074%2C0706.0809%2C0706.0635%2C0706.0532%2C0706.4376%2C0706.2383%2C0706.2741%2C0706.4408%2C0706.4369%2C0706.3504%2C0706.2483%2C0706.3196%2C0706.2436%2C0706.2889%2C0706.4189%2C0706.3723%2C0706.0046%2C0706.2355%2C0706.2651%2C0706.4168%2C0706.0392%2C0706.1305%2C0706.2095%2C0706.1513%2C0706.1499%2C0706.0462%2C0706.3576%2C0706.0012%2C0706.0005%2C0706.3672%2C0706.1852%2C0706.0276%2C0706.0403%2C0706.1623%2C0706.4409%2C0706.2305%2C0706.4014%2C0706.2716%2C0706.3623%2C0706.0609%2C0706.4429%2C0706.2033%2C0706.3281%2C0706.0933%2C0706.1797%2C0706.0123%2C0706.3733%2C0706.1879%2C0706.2732%2C0706.1972%2C0706.3232%2C0706.4320%2C0706.2136%2C0706.0613%2C0706.0200%2C0706.2758%2C0706.1671%2C0706.1818%2C0706.1988%2C0706.1022%2C0706.2398%2C0706.2093%2C0706.3297&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Polypyrrole chemically synthesized on PET gives rise to textiles with a high\nelectric conductivity, suitable for several applications from antistatics to\nelectromagnetic interference shielding devices. Here, we discuss investigations\non thermal electric performances of the polypyrrole coated PET in a wide range\nof temperatures above room temperature. The Seebeck coefficient turns out to be\ncomparable with that of metal thermocouple materials. Since polypyrrole shows\nextremely low thermal diffusivities regardless of the electrical conductivity,\nthe low thermal conductivity gives significant advantage to the thermoelectric\nfigure-of-merit ZT, comparable with that of some traditional inorganic\nthermoelectric materials. The heat generation is also investigated for possible\nheating textile devices."}, "authors": ["J. Avloni", "L. Florio", "A. R. Henn", "A. Sparavigna"], "author_detail": {"name": "A. Sparavigna"}, "author": "A. Sparavigna", "links": [{"title": "doi", "href": "http://dx.doi.org/10.4236/msa.2010.14037", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0706.3697v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0706.3697v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "12 pages and 9 figures", "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0706.3697v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0706.3697v1", "journal_reference": "Materials Sciences and Applications, Vol. 1 No. 4, 2010, pp.\n  253-259", "doi": "10.4236/msa.2010.14037", "fulltext": "Thermal electric effects and heat generation in polypyrrole coated\nPET fabrics.\nJ. Avloni(1), L. Florio(2), A.R. Henn(3) and A. Sparavigna(4)\n(1)\n\nEeonyx Corporation, 750 Belmont Way, Pinole, CA 94564, USA\nLaboratorio Tessili Innovativi, V. Rosselli 2 , 13900 Biella, Italy\n(3)\nMarktek Inc.,13621 Riverway Dr., Suite H, Chesterfield, MO 63017, USA\n(4)\nPhysics Department, Politecnico di Torino,C.so Duca degli Abruzzi 24, 10129 Torino,\nItaly\n(2)\n\n* Author for correspondence: E-mail: amelia.sparavigna@polito.it\n\nAbstract\nPolypyrrole chemically synthesized on PET gives rise to textiles with a high electric conductivity,\nsuitable for several applications from antistatics to electromagnetic interference shielding devices. Here,\nwe discuss investigations on thermal electric performances of the polypyrrole coated PET in a wide range\nof temperatures above room temperature. The Seebeck coefficient turns out to be comparable with that of\nmetal thermocouple materials. Since polypyrrole shows extremely low thermal diffusivities regardless of\nthe electrical conductivity, the low thermal conductivity gives significant advantage to the thermoelectric\nfigure-of-merit ZT, comparable with that of some traditional inorganic thermoelectric materials. The heat\ngeneration is also investigated for possible heating textile devices.\nKeywords: conductive polymer, polypyrrole, thermoelectric materials\n\nIntroduction\nTill recently, the route to mimic metallic conductivity was either to insert into a inherently\ninsulating resin a conductive filler or to coat a plastic substrate with a conductive metal solution\n[1]. In this way, conductive fibers can be prepared to obtain conductive fabrics, or fabrics\nalready produced, can be metallized with conductive coatings. Metal coated textiles are very\ninteresting materials because they generally show a high electromagnetic interference shielding\neffectiveness EMI-SE [2,3].\nActually, rather innovative textile materials can be obtained when produced with intrinsically\nconducting polymers (ICPs). These textiles are able to absorb as well as reflect electromagnetic\nwaves, and then can exhibit certain advantages over metallic materials. ICPs are conjugated\npolymers, with alternating single and double bonds in the polymer backbone, a necessary\ncondition for charge carriers to move freely along the chain when doping is provided. The most\nprominent ICPs in EMI-SE are polypyrrole and polyaniline, where electrical conductivity can\nhave values comparable to those observed for poorly conducting metals and alloy [2].\n\n1\n\n\fIn the mid-1970s, the first polymer capable of conducting electricity was discovered in a new\nform of polyacetilene. The announcement of this discovery quickly reverberated around\nscientific community, and the intensity of the search for others magnified dramatically [4,5,6].\nAmong the first commercial products incorporating conductive polymers there was Contex®, a\nline of conductive textile products originally manufactured by Milliken [7], starting around 1990,\nand now produced by Eeonyx Corp., under the tradename of EeonTex TM. Polyester fibers are\ncoated with a conjugate conductive polymer, the polypyrrole, and woven to create an antistatic\nfabric.\nHere, we will shown the results of measurements of thermal electric properties of a polypyrrole\ncoated fabrics, in particular the Seebeck coefficient, which turns out to be comparable with that\nof metal thermocouple materials. Because polypyrrole shows extremely low thermal diffusivity,\na significant advantage in the thermoelectric figure-of-merit is obtained. The value of the figureof-merit is comparable with that of some traditional inorganic thermoelectric materials [8]. We\nwill also discuss the heat generation of the fabrics for applications in textile heating systems.\n\nSamples\nPolypyrrole is one of the intrinsic conducting polymers very promising for wide thermoelectric\napplications because of it several attractive properties, such as easy preparation with low costs.\nActually, considerable attention is paid to obtain thermoelectric effects from advanced coating\ntechnologies, for low weight but high reliability systems. The thermoelectric cooling is\nconsidered as a good strategy in the semiconductor electronic chips operating at very high\nfrequencies, where the thermal management becomes crucial.\nA proper polypyrrole coated textile device could represent a possible solution for heating and\ncooling and for temperature monitoring. As previously told, one of the first commercial textile\nproducts incorporating conductive polypyrrole (PPy) was the Contex conductive textile. More\nrecently, Contex-like textiles, with a modified PPy coating have been commercially developed\nthat are more conductive and thermally stable. While imparting electrical conductivity and a dark\ncolour to the substrates, the coating process barely affects the strength, drape, flexibility, and\nporosity of the starting substrates.\nFor the measurements discussed in this paper, we use a polypyrrole coated PET fabric which was\nprepared similarly as described previously in [9,10], with raw chemicals purchased from SigmaAldrich and used without further purification. Stochiometric molar ratio of organic acid dopant,\nanthraquinone-2-sulfonic acid to pyrrole-monomer (i.e., 0.33:1) was used to ensure complete\ndoping level. The molar ratio of polymerisation catalyst, iron(III) nitrate, to monomer (pyrrole)\nequal to 2.3 mol/mol was used for all reactions. The macroscopic texture of this Contex-like\nfabric is shown in Fig. 1, a net useful for application in heating systems, as we shall demonstrate\nin following discussion. In Fig.1, a commercial metallized fabric (Leno Ni/Ag coated Nylon) is\nshown for comparison. Simultaneous in-situ polymerisation and deposition of conductive\npolypyrrole leads to production of conductive, smooth and uniform coating with thickness under\n1 μm , according to transmission electronic microscope measurements (see Fig.2 and 3). The\nelectrical DC surface resistance was measured by using a four-in-line point probe in combination\nwith computerised Loresta-AP meter from Mitsubishi Petrochemical Co., LTD. Surface\nresistivity at room temperature of conductive fabrics. The PPy/PET fabric has a DC surface\nresistivity of 306.0 Ω / sq and the Leno of 0.22 Ω / sq .\n\n2\n\n\fAs observed in Ref.11, it is possible a formation of insoluble polymers in the bulk solution and\non the surface of the substrate simultaneously. The bulk polymerization produces dendritic\npolymer particles in the solution and the surface polymerization forms a polymer film on the\nsubstrate surface. Some of the bulk polymer precipitates on the surface of the substrate and then\nthe SEM analysis shows these particles on the fibers.\n\nThermal electric effects.\nFew researches on organic materials for thermoelectric applications have been reported,\nprobably because of their unattractive electronic transporting characters. But recently electrically\nconducting organic polymers with aromatic structures have attracted a great attention because of\nelectrical properties and considerable thermal stability. Among them, polyaniline and\npolypyrrole are well studied due to feasible background for wide application to electronic\ndevices and sensors [12,13,14]. The experimental results of systematic investigations on\nthermoelectric performances of polyaniline and polypyrrole films in a wide temperature range\nabove room temperature have been reported.\nSupposing for polymeric compounds a low thermal conductivity, we can obtain significant\nadvantage of the thermoelectric figure-of-merit. Let us remember that figure-of-merit is defined\nas ZT = S 2σ κ T , where S , σ , κ and T are Seebeck coefficient, electric conductivity,\nthermal conductivity, and absolute temperature respectively. The value of ZT for polypyrrole is\ncomparable with that of some traditional inorganic thermoelectric materials, for instance FeSi 2\n[7]: in polypyrrole films, the maximum value is 10 −2 at 423 K [15].\nWe investigated the behaviour of resistivity as a function of temperature. Starting from room\ntemperature, the resistance of a PPy/PET sample placed in a thermostage, was checked till a\ntemperature of 70°C. The resistance behaviour with temperature is typical of a semiconductor\nwith the resistance decreasing linearly as the temperature increases. At room temperature, the\nresistance was of 172 Ω in a sample with a length of 4 cm , composed by 10 yarns, each yarn\nwith a diameter of 0.05 cm. At 70°C, the resistance of the sample was of 145 Ω . Assuming a\nthickness in polypyrrole coating of around 1 μm\n\n(\n\n)\n\n10 4 Ω −1 m −1 . This estimation is in good agreement with the value of 1.7 × 10 4 Ω −1 m −1 , given\nin Ref.16.\nThermoelectric Seebeck coefficient ( S ) and its temperature dependence were determined by\nconnecting a stripe of PPy/PET fabric 0.5 cm wide with a copper wire. The two materials are\nelectrically connected by the pressure of a very small silver clip, insulated from the junction. The\nhot junction was placed in the thermostage with a reference Chromel/Alumel thermocouple and\nthe cold junction between the PPy/PET stripe and copper was thermally anchored at room\ntemperature (26 °C). The same anchoring was used for the cold junction of the Chromel-Alumel\nthermocouple (a diagram of the experimental set-up in Fig.4). Variations in monitored room\ntemperature during measurements were negligible (around 5%).\nIn Figure 5, the behaviour of the electro-motive force measured for two such PPy/Copper\nthermocouples is given as a function of temperature difference ∆T between the actual hot\njunction temperature and the room temperature. Assuming a value of Copper e.m.f. vs. Platinum\nof 0.0076 mV/°C [17], we can estimate a value of 0.0133 mV/°C for the PPy vs. Platinum e.m.f.\nand positive.\nTo obtain the figure of merit ( ZT ), we estimate the PPy thermal conductivity in the following\n3\n\n\fmanner. Thermal diffusivity of polypyrrole films was measured by a laser flash method in Ref.\n[18]. Polypyrrole films exhibit extremely low thermal diffusivity of 1.3 × 10 −2 cm 2 s −1 at room\ntemperature. The very low thermal diffusivity of polypyrrole films is originated in the lattice\nstructure, in particular from a dominant amorphous character of the chain structure. An\namorphous structure strongly reduces the thermal phonon transport, because strong phonon\nscattering mechanisms appear [19,20]. Specific heat capacity of the polypyrrole film is\n0.4 J g −1 K −1 , which is higher than those of inorganic materials but still in the range of those of\norganic polymers, with a positive temperature dependence [18]. The thermal conductivity of\npolypyrrole film turns out to be 0.2 Wm −1K −1 . This low thermal conductivity is at least in one\norder of magnitude lower than that of the best inorganic thermoelectric materials. With the\nestimates σ = 10 4 Ω −1 m −1 , κ = 0.2 Wm −1 K −1 , T = 300 K , our measurements on PPy give\nZT = 3. × 10 −3 in agreement with data on polypyrrole films [15].\nThe Seebeck electromotive force of Leno Ni/Ag coated Nylon connected with Cu was also\nmeasured and the behaviour is shown in Fig. 5 (curve b). The same figure shows that a\nthermocouple built with Ni/Ag/Nylon and PPy/PET can give the higher electromotive force\n(curve a). We have also prepared a thermocouple with PPy/PET and a yarn composed of\ncommercial carbon fibers (curve c).\nAs shown by the measurements here reported, PPy coating can be successfully used with other\nconductive yarns, for instance Copper, Ni/Ag coated yarns or carbon fibers, obtaining stable\ntextile thermopiles, providing significant thermopowers. Seebeck effect of PPy with Aluminum\nis repoterd in Ref.[21]. Contex, or other polypyrrole coated textiles, can then represent a valid\nsolution to the problem of exhausted heat, generated from engines and in power plants, to avoid\nenvironment thermal pollution. A challenging strategy for textile industry can then be\ndevelopment of new textiles for a partial recover of heat in electric energy.\n\nHeat generation.\nAn adjustable Variac power supply was used to generate an AC current/voltage over the fabric.\nVoltage and current were monitored by Keithley voltmeter and amperometer. A square shape\nfabric ( 6 cm × 6 cm ) was positioned between two pressed electric contacts (a diagram of the\narrangement in Fig.7). The temperature rise was measured using an Omega infrared\nthermometer, placed to control the center of the sample. In Fig.8, the behaviour of the\ntemperature as a function of the current is given, with the rise of the voltage. According to the\npower law, the maximum theoretical power achieved from the fabrics is: P = V I , where P is\nthe power developed and V , I the voltage and current. The AC current frequency is 50 Hz. In\nFig.9, the power and the impedance as a function of current are shown.\nIn Ref.10, the power density per unit area is assumed to be: P = V 2 / RS l 2 , where RS is the\nsurface resistance and l the size of the sample. Our highest value is 370 W / m 2 in agreement\nwith the value obtained in Ref.10.\nAs the studies demonstrate, a Seebeck effects can be achieved by using a PPy conducting\ncoating a PET fabric. According to the Kelvin relation between the Seebeck S and the Peltier\nΠ coefficients, Π = S T , we can also imagine application in cooling devices of polypyrrole\ncoated fabrics. In fact, the effect is strongly dependent on the design of the cooling cell and in\n4\n\n\fthe number of junctions utilized in it. With the PPy coated PET fabric, it is possible to easily\nmake heating fabrics. Since the coating with polypyrrole is possible on many different fibers\n[22], the potential applications of polypyrrole in the building of heating pads is relevant. We\nsuggest that the PPy-coated fabric used in this study may be practically useful for many\napplications, including flexible, portable surface-heating elements for medical or other\napplications.\nAknowledgement\nThe authors are indebted with Angelica Chiodoni for the SEM analysis.\n\nReferences\n1. J. Edenbaum editor, Plastics Additives and Modifiers Handbook, Van Nostrand Reinhold,\nNew York 1992.\n2. J. Avloni, M. Ouyang, L. Florio, A.R. Henn, A. Sparavigna, Journal of Thermoplastic\nComposite Materials 20(3), 241 (2007)\n3. A.R. Henn, R.M. Cribb, Modelling the shielding effectiveness of metallized fabrics,\nInterference Technology Engineering Master (ITEM) Update, p. 49-57 (1993)\n4. C.K. Chiang, C.R. Fincher, Y.W. Park, A. J. Heeger, H. Shirakawa, E.J. Louis, S.C. Gau, and\nA.G. MacDiarmid, Phys. Rev. Lett. 39, 1098 (1997)\n5. A.G. MacDiarmid, Synthetic Metals 84, 27 (1997)\n6. Y.Cao, P. Smith and A.J. Heeger, Synthetic Metals 55, 3614 (1993)\n7. Milliken and Co., http://www.milliken.com\n8. A.F. Ioffe, Semiconductor Thermoelements and Thermoelectric Cooling, Infosearch, London\n1957.\n9. H.H. Kuhn, A. D. Child, Handbook of Conducting Polymers, Marcel Dekker, New York,\n1998, pp.993-1013.\n10. H.H. Kuhn, A. D. Child, W.C. Kimbrell, Toward real applications of conductive polymers,\nSynthetic Metals 71, 2139 (1995)\n11. E. Hakansson, A. Kaynak, T. Lin, S. Nahavandi, T. Jones and E. Hu, Synthetic Metals\n144(1), 21 (2004)\n12. D. Kumar and R.C. Sharma, European Polymer Journal 34, 1053 (1998)\n13. D. Braun, Materials Today 5, 32 (2002)\n14. J.V. Hatfield, P. Neaves, K. Persaud and P. Travers, Sensors and actuators B 18-19, 221\n(1994)\n15. Hu Yan, T. Ishida, and Naoki Toshima,. XX International Conference on Thermoelectrics,\nProceedings ICT 2001, p. 310\n16. A.R. Henn, Calculating the surface resistivity of conductive fabrics, Interference Technology\nEngineering Master (ITEM) Update, 1996, p. 66-72.\n17. D.E. Gray, American institute of physics handbook, McGraw- Hill, New York 1963\n18. Hu Yan, N. Sada and N. Toshima, J. of Thermal Analysis and Calorimetry 69, 881 (1992)\n19. M.Omini and A.Sparavigna, Phys. Rev. B 61, 6677 (2000)\n20. A. Sparavigna, M. Omini, A. Pasquarelli and A. Strigazzi, Int. J Thermophys. 13, 351\n(1992)\n21. Eric Hu, Akif Kaynak, Yuncang Li, Synthetic metals 150, 139 (2005)\n\n5\n\n\f22. D.T. Seshadri and N.V. Bhat, Synthesis and properties of cotton fabrics modified with\npolypyrrole, Sen'I Gakkaishi 61(4), 103 (2005)\n\nFigure captions\nFig.1 Polypyrrole coated PET net and the Leno Ni/Ag coated nylon fabric. The image sizes are\n4.3 cm × 5 cm .\nFig.2 Scanning electron microscope SEM images of the samples with polypyrrole coated\nfibers. The dust is due to polymer particles in solution, deposited on the net.\nFig.3 SEM images of PPy coated fibers.\nFig.4 The diagram of the experimental set–up for measuring the Seebeck effect. The\nelectromotive force of two thermocouples are compared: a thermocouple is used as a reference to\ndetermine the temperature in the thermostage, the other to determine the unknown electromotive\nforce of the material.\nFig. 5 Electromotive force measured for a PPy-PET/Copper thermocouple as a function of the\ntemperature difference ∆T between the actual hot junction temperature and the room\ntemperature.\nFig. 6 Electromotive force measured for Ni/Ag/Nylon/Contex (a), for Ni/Ag/Nylon/Copper (b),\nand for PPy/PET/Carbon Fibers as a function of the temperature difference ∆T between the\nactual hot junction temperature and cold junction at room temperature.\nFig.7 The diagram of the experimental set-up for measuring the heating effect of a textile.\nCurrent and voltage across the sample must be monitored.\nFig.8 Behaviour of the voltage and temperature of the PPy coated sample as a function of the\ncurrent, measured with voltmeter and thermometer.\nFig.9 Behaviour of the impedance and power developed by the PPy coated sample as a function\nof the current. The values of impedance and power are estimated from data of Fig.8.\n\n6\n\n\fFIG.1\n\n7\n\n\fFig.2\n\nFig.3\n\n8\n\n\fFig.4\n\n9\n\n\fFig.5\n\nFig.6\n\n10\n\n\fFig.7\n\nFig.8\n11\n\n\fFig.9\n\n12\n\n\f"}