{"id": "http://arxiv.org/abs/0811.4345v1", "guidislink": true, "updated": "2008-11-26T15:30:15Z", "updated_parsed": [2008, 11, 26, 15, 30, 15, 2, 331, 0], "published": "2008-11-26T15:30:15Z", "published_parsed": [2008, 11, 26, 15, 30, 15, 2, 331, 0], "title": "The Megamaser Cosmology Project: I. VLBI observations of UGC 3789", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0811.0438%2C0811.4699%2C0811.0067%2C0811.2026%2C0811.4167%2C0811.2849%2C0811.1237%2C0811.0177%2C0811.1299%2C0811.4754%2C0811.2678%2C0811.1826%2C0811.4005%2C0811.1605%2C0811.3233%2C0811.0771%2C0811.1327%2C0811.1038%2C0811.4533%2C0811.0781%2C0811.3908%2C0811.2974%2C0811.2374%2C0811.2736%2C0811.2780%2C0811.0769%2C0811.3893%2C0811.2032%2C0811.2268%2C0811.4090%2C0811.1984%2C0811.3931%2C0811.0190%2C0811.1212%2C0811.1307%2C0811.4250%2C0811.1374%2C0811.4561%2C0811.2602%2C0811.0353%2C0811.4710%2C0811.0898%2C0811.1608%2C0811.3561%2C0811.4584%2C0811.0920%2C0811.1863%2C0811.1467%2C0811.1120%2C0811.4406%2C0811.0493%2C0811.3874%2C0811.3520%2C0811.0700%2C0811.2650%2C0811.2481%2C0811.2557%2C0811.0937%2C0811.4648%2C0811.3268%2C0811.2265%2C0811.1750%2C0811.3022%2C0811.1002%2C0811.2042%2C0811.0527%2C0811.1699%2C0811.2941%2C0811.4684%2C0811.2257%2C0811.0452%2C0811.0555%2C0811.2356%2C0811.0680%2C0811.2626%2C0811.1852%2C0811.4574%2C0811.0816%2C0811.4494%2C0811.3155%2C0811.2832%2C0811.3301%2C0811.0880%2C0811.2004%2C0811.2660%2C0811.3960%2C0811.2757%2C0811.3683%2C0811.0660%2C0811.3543%2C0811.0327%2C0811.4120%2C0811.4179%2C0811.3713%2C0811.4587%2C0811.0350%2C0811.3684%2C0811.1037%2C0811.2593%2C0811.4646%2C0811.4345&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Megamaser Cosmology Project: I. VLBI observations of UGC 3789"}, "summary": "The Megamaser Cosmology Project (MCP) seeks to measure the Hubble Constant\n(Ho) in order to improve the extragalactic distance scale and constrain the\nnature of dark energy. We are searching for sources of water maser emission\nfrom AGN with sub-pc accretion disks, as in NGC 4258, and following up these\ndiscoveries with Very Long Baseline Interferometric (VLBI) imaging and spectral\nmonitoring. Here we present a VLBI map of the water masers toward UGC 3789, a\ngalaxy well into the Hubble Flow. We have observed masers moving at rotational\nspeeds up to 800 km/s at radii as small as 0.08 pc. Our map reveals masers in a\nnearly edge-on disk in Keplerian rotation about a 10^7 Msun supermassive black\nhole. When combined with centripetal accelerations, obtained by observing\nspectral drifts of maser features (to be presented in Paper II), the UGC 3789\nmasers may provide an accurate determination of Ho, independent of luminosities\nand metallicity and extinction corrections.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0811.0438%2C0811.4699%2C0811.0067%2C0811.2026%2C0811.4167%2C0811.2849%2C0811.1237%2C0811.0177%2C0811.1299%2C0811.4754%2C0811.2678%2C0811.1826%2C0811.4005%2C0811.1605%2C0811.3233%2C0811.0771%2C0811.1327%2C0811.1038%2C0811.4533%2C0811.0781%2C0811.3908%2C0811.2974%2C0811.2374%2C0811.2736%2C0811.2780%2C0811.0769%2C0811.3893%2C0811.2032%2C0811.2268%2C0811.4090%2C0811.1984%2C0811.3931%2C0811.0190%2C0811.1212%2C0811.1307%2C0811.4250%2C0811.1374%2C0811.4561%2C0811.2602%2C0811.0353%2C0811.4710%2C0811.0898%2C0811.1608%2C0811.3561%2C0811.4584%2C0811.0920%2C0811.1863%2C0811.1467%2C0811.1120%2C0811.4406%2C0811.0493%2C0811.3874%2C0811.3520%2C0811.0700%2C0811.2650%2C0811.2481%2C0811.2557%2C0811.0937%2C0811.4648%2C0811.3268%2C0811.2265%2C0811.1750%2C0811.3022%2C0811.1002%2C0811.2042%2C0811.0527%2C0811.1699%2C0811.2941%2C0811.4684%2C0811.2257%2C0811.0452%2C0811.0555%2C0811.2356%2C0811.0680%2C0811.2626%2C0811.1852%2C0811.4574%2C0811.0816%2C0811.4494%2C0811.3155%2C0811.2832%2C0811.3301%2C0811.0880%2C0811.2004%2C0811.2660%2C0811.3960%2C0811.2757%2C0811.3683%2C0811.0660%2C0811.3543%2C0811.0327%2C0811.4120%2C0811.4179%2C0811.3713%2C0811.4587%2C0811.0350%2C0811.3684%2C0811.1037%2C0811.2593%2C0811.4646%2C0811.4345&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Megamaser Cosmology Project (MCP) seeks to measure the Hubble Constant\n(Ho) in order to improve the extragalactic distance scale and constrain the\nnature of dark energy. We are searching for sources of water maser emission\nfrom AGN with sub-pc accretion disks, as in NGC 4258, and following up these\ndiscoveries with Very Long Baseline Interferometric (VLBI) imaging and spectral\nmonitoring. Here we present a VLBI map of the water masers toward UGC 3789, a\ngalaxy well into the Hubble Flow. We have observed masers moving at rotational\nspeeds up to 800 km/s at radii as small as 0.08 pc. Our map reveals masers in a\nnearly edge-on disk in Keplerian rotation about a 10^7 Msun supermassive black\nhole. When combined with centripetal accelerations, obtained by observing\nspectral drifts of maser features (to be presented in Paper II), the UGC 3789\nmasers may provide an accurate determination of Ho, independent of luminosities\nand metallicity and extinction corrections."}, "authors": ["M. J. Reid", "J. A. Braatz", "J. J. Condon", "L. J. Greenhill", "C. Henkel", "K. Y. Lo"], "author_detail": {"name": "K. Y. Lo"}, "author": "K. Y. Lo", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0004-637X/695/1/287", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0811.4345v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0811.4345v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "18 pages, 3 figures, 4 tables", "arxiv_primary_category": {"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0811.4345v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0811.4345v1", "journal_reference": "Astrophys.J.695:287-291,2009", "doi": "10.1088/0004-637X/695/1/287", "fulltext": "Version: 2008 November 21\n\narXiv:0811.4345v1 [astro-ph] 26 Nov 2008\n\nThe Megamaser Cosmology Project: I.\nVLBI observations of UGC 3789\nM. J. Reid1 , J. A. Braatz2 , J. J. Condon2 , L. J. Greenhill1 , C. Henkel3 , K. Y. Lo2\nABSTRACT\nThe Megamaser Cosmology Project (MCP) seeks to measure the Hubble Constant (H0 ) in order to improve the extragalactic distance scale and constrain the\nnature of dark energy. We are searching for sources of H2 O maser emission from\nAGN with sub-pc accretion disks, as in NGC 4258, and following up these discoveries with Very Long Baseline Interferometric (VLBI) imaging and spectral\nmonitoring. Here we present a VLBI map of the H2 O masers toward UGC 3789, a\ngalaxy well into the Hubble Flow. We have observed masers moving at rotational\nspeeds up to 800 km s−1 at radii as small as 0.08 pc. Our map reveals masers in\na nearly edge-on disk in Keplerian rotation about a 107 M⊙ supermassive black\nhole. When combined with centripetal accelerations, obtained by observing spectral drifts of maser features (to be presented in Paper II), the UGC 3789 masers\nmay provide an accurate determination of H0 , independent of luminosities and\nmetallicity and extinction corrections.\nSubject headings: Hubble Constant - Cosmology - Dark Energy - General\nRelativity - distances - individual sources (UGC 3789)\n\n1.\n\nIntroduction\n\nThe current \"concordance\" cosmological model assumes a flat ΛCDM universe composed of baryons, cold dark matter, and \"dark energy\" that accelerates the expansion of the\nuniverse (Spergel et al. 2003). The location of the first peak in the angular power spectrum\n1\n\nHarvard-Smithsonian Center for Astrophysics, 60 Garden Street, Cambridge, MA 02138, USA\n\n2\n\nNational Radio Astronomy Observatory, 520 Edgemont Road, Charlottesville, VA 22903\n\n3\n\nMax-Planck-Institut für Radioastronomie, Auf dem Hügel 69, 53121 Bonn, Germany\n\n\f–2–\nof the cosmic microwave background (CMB) radiation determines the angular-size distance\nto the surface of last scattering. This distance depends on the amount of dark energy and\nthe geometry and current expansion rate of the universe, H0 . If one does not assume that\nthe universe is flat, the CMB data alone are consistent with a wide range of values of H0 .\nThus, independent measurements of H0 are needed to justify the flatness assumption and\nto determine whether dark energy is the cosmological constant, Λ, of General Relativity,\na variable \"quintessence\" (Wetterich 1988; Ratra & Peebles 1988), or possibly something\nelse. Hu (2005) concludes that the most important single complement to CMB data would\nbe a precise (e.g. ∼ 1% uncertainty) measurement of H0 .\nThe current \"best value\" for the Hubble Constant, H0 = 72 ± 7 km s−1 Mpc−1 from the\nHST Key Project (Freedman et al. 2001), is based on luminosity distance measurements to\nextragalactic Cepheid variables treated as \"standard candles.\" The 10% uncertainty in H0\nis dominated by systematic errors that cannot easily be reduced by observations of more\ngalaxies.\nVery Long Baseline Array (VLBA) observations of the H2 O megamaser in the nearby\nSeyfert 2 galaxy NGC 4258 have provided an accurate, angular-diameter distance to the\ngalaxy (Herrnstein et al. 1999), bypassing the problems of standard candles. The H2 O\nmasers in NGC 4258 arise in a thin (annular) disk viewed nearly edge-on (Greenhill et al.\n1995a) and appear at galactocentric radii R ≈ 0.14 to 0.28 pc. Maser lines near the systemic\nvelocity of the galaxy come from gas moving across the sky on the near side of the disk, and\n\"high-velocity lines,\" with relative velocities of up to V ≈ ±1100 km s−1 , come from gas\nmoving along the line of sight at the disk tangent points. The high-velocity lines display a\nKeplerian rotation curve, implying a central mass of ≈ 4 × 107 M⊙ , presumably in the form\nof a supermassive black hole (SMBH) (Miyoshi et al. 1995).\nFor NGC 4258, the velocities of individual systemic features are observed to increase\nby ≈ 9 km s−1 yr−1 (Haschick, Baan & Peng 1994; Greenhill et al. 1995b), allowing a\ndirect measurement of the centripetal acceleration (a = V 2 /R) of clouds moving across our\nline of sight near the nucleus (Watson & Wallin 1994). Conceptually, the angular-diameter\ndistance, Dθ , to NGC 4258 can be determined geometrically by dividing the linear radius\nof masers, measured from Doppler shifts and accelerations (R ≈ V 2 /a), by their angular\nradius, measured from a Very Long Baseline Interferometric (VLBI) image (θR ). Maser\nproper motions can be also be used to measure distance, but generally yield less accurate\ndistances than using accelerations. Observations with the VLBA of the H2 O masers in\nNGC 4258 have been carefully modeled, yielding the most accurate distance (Dθ = 7.2 ± 0.5\nMpc) to date for a galaxy (Herrnstein et al. 1999).\nUnfortunately, NGC 4258 is too close to determine H0 directly (i.e. by dividing its reces-\n\n\f–3–\nsional velocity of 475 km s−1 by its distance), since the galaxy's deviation from the Hubbleflow could be a significant fraction of its recessional velocity. Instead, the measured distance\nto NGC 4258 has been used to anchor the zero point of the Cepheid period-luminosity relation (Newman et al. 2001; Macri et al. 2006; Argon et al. 2007; Humphreys et al. 2008).\nHowever, galaxies with edge-on, disk-like H2 O masers, similar to those in NGC 4258, that\nare distant enough to be in the Hubble flow (D > 30 Mpc) could be used to measure H0\ndirectly (Greenhill 2004).\nSurveys of galaxies for nuclear H2 O masers have been quite successful and have identified\nmore than 100 extragalactic nuclear H2 O masers (Claussen & Lo 1986; Braatz, Wilson & Henkel\n1996; Greenhill et al. 2002; Henkel et al. 2002; Greenhill et al. 2003; Braatz et al. 2004;\nKondratko et al. 2006; Kondratko, Greenhill & Moran 2006; Braatz & Gugliucci 2008). In\norder to coordinate efforts to find and image new sources of nuclear H2 O masers, we formed\na team of scientists active in this area of research from the Harvard-Smithsonian Center for\nAstrophysics, the National Radio Astronomy Observatory (NRAO), and the Max-PlanckInstitut für Radioastronomie (MPIfR). This effort, called the Megamaser Cosmology Project\n(MCP), is aimed at measuring H0 directly, with ≈ 3% accuracy, using a combination of\nVLBI imaging and single-dish monitoring of nuclear H2 O masers toward ∼ 10 galaxies.\nRecently Braatz & Gugliucci (2008) discovered a relatively strong H2 O maser (Sν ≈\n0.1 Jy) toward the Seyfert 2 nucleus of UGC 3789. The H2 O maser spectrum has the\ncharacteristics of an edge-on disk similar to NGC 4258. The UGC 3789 masers span ≈\n1500 km s−1 in Doppler shift and the systemic masers were observed to accelerate by up to\n8.1 km s−1 yr−1 , suggesting an origin in a sub-pc disk about a ∼ 107 M⊙ black hole.\nIn this paper, and in Braatz et al. (2008) (hereafter Paper II), we report results leading\nto the first MCP measurement of H0 . Sensitive VLBI observations and images of the\nnuclear H2 O masers toward UGC 3789 are presented in this paper. In Paper II, we present\nmonitoring observations with large single-dish telescopes, which yield accelerations of H2 O\nmasers. The combination of the VLBI imaging and the single-dish acceleration data may\nyield a measurement of H0 with an accuracy comparable to that of the Hubble Key Project.\n\n\f–4–\n2.\n\nObservations, Calibration, and Imaging\n\nWe observed UGC 3789 on 2006 December 10 for a total of 12 hours, with the 10 NRAO 1\nVLBA antennas (under program BB227A), augmented by the Green Bank Telescope (GBT)\nand the Effelsberg 100-m telescope 2 . The coordinates of the sources observed are listed in\nTable 1. We alternated between two observing modes: (1) a 60-min block of continuous\ntracking of UGC 3789 (self-calibration mode) and (2) a 45-min block of rapid switching\nbetween UGC 3789 and a nearby compact continuum source J0728+5907 (phase-referencing\nmode). The phase-referencing blocks were a \"back-up\" in the event that the UGC 3789 maser\nsignal was not strong enough for self-calibration. Both observing modes were successful.\nHowever, since the self-calibration mode produced a much higher on-source duty cycle and\nbetter phase calibration than the phase-referencing mode, we only report results from the\ntotal of ≈ 5 hr of self-calibration mode observations.\nWith a maximum recording rate of 512 Mbits s−1 , we could cover the entire range of\ndetectable UGC 3789 H2 O maser emission, but not with dual-polarization for all frequency\nbands. We centered 16-MHz bands at LSR velocities (optical definition) as follows: left\ncircularly polarized (LCP) bands at 3880, 3710, 3265, 2670 and 2500 km s−1 and right\ncircularly polarized (RCP) at 3880, 3265 and 2670 km s−1 . The signals were sampled at the\nNyquist rate (32 Mbits s−1 ) and with 2 bits per sample.\nWe placed \"geodetic\" blocks at the start and end of our observations, in order to solve\nfor atmospheric and clock delay residuals for each antenna (Reid & Brunthaler 2004). In\nthese blocks we rapidly cycled among 14 compact radio sources that spanned a wide range\nof zenith angles at all antennas. These data were taken in left circular polarization with\neight 16-MHz bands that spanned 492 MHz of bandwidth between 22.00 and 22.49 GHz; the\nbands were spaced in a \"minimum redundancy\" manner to sample, as uniformly as possible,\nall frequency differences. The data were correlated, corrected for ionospheric delays using\ntotal electron content measurements (Walker & Chatterjee 2000), and residual multi-band\ndelays and fringe rates were determined for all sources. The multi-band delays and fringe\nrates were modeled as owing to a vertical atmospheric delay and delay-rate, as well as a\nclock offset and clock drift rate, at each antenna. Using a least-squares fitting program, we\nestimated zenith atmospheric path-delays and clock errors with accuracies typically ≈ 0.5 cm\nand ≈ 0.03 nsec, respectively.\n1\n\nThe National Radio Astronomy Observatory is operated by Associated Universities, Inc., under a cooperative agreement with the National Science Foundation.\n2\n\nThe Effelsberg 100-m telescope is a facility of the Max-Planck-Institut für Radioastronomie\n\n\f–5–\nWe observed the strong continuum source, J0753+5352, hourly in order to monitor\ndelay and electronic phase differences among and across the IF bands. Generally, variations\nof phase across the VLBA bandpasses are small (< 5◦ ) across the central 90% of the band\nand thus we needed no bandpass corrections. We tested the effect of bandpass corrections,\nusing the J0753+5352 data, and found position differences of ≈ 0.002 mas for maser features\nmid-way between the band center and band edge.\nThe raw data recorded at each antenna were cross-correlated with an integration time\nof 1.05 sec at the VLBA correlation facility in Socorro, NM. For this short integration time\nwe had to correlate the data in two passes in order to achieve sufficient spectral resolution\n(128 spectral channels for each IF band) without exceeding the maximum correlator output\nrate. Before calibration, the two correlation data sets were \"glued\" together.\nWe calibrated the data using the NRAO Astronomical Image Processing System (AIPS).\nFirst, we corrected interferometer delays and phases for the effects of diurnal feed rotation\n(parallactic angle) and for small errors in the values of the Earth's orientation parameters\nused at the time of correlation. By analyzing the data taken in phase-referencing mode, we\ndetermined that the strong maser feature at VLSR = 2689 km s−1 , which we later used as the\nphase reference for the self-calibration mode data, was offset from the position of UGC 3789\nused in the VLBA correlator by (−1, −15) mas toward (east,north), respectively, relative to\nJ0728+5907.\nSince the VLBA correlator model includes no ionospheric delays, we used global total\nelectron content models to remove ionospheric effects. We then corrected the data for residual\nzenith atmospheric delays and clock drifts, as determined from the geodetic block data.\nWhile we obtained good atmospheric/clock corrections for most antennas, insufficient data\nwere obtained for the Effelsberg (EB) and Mauna Kea (MK) antennas for this task. Thus,\nwe later used the data from the hourly observations of J0753+5352 to determine final delay\ncorrections for the UGC 3789 data.\nWe corrected the interferometer visibility amplitudes for the few percent effects of biases in the threshold levels of the data samplers at each antenna. We also entered system\ntemperature and antenna gain curve information into calibration tables. These tables were\nused later to convert correlation coefficients to flux densities. Next, we performed a \"manual phase-calibration\" to remove delay and phase differences among all bands. This was\naccomplished with data from one scan on a strong calibrator, 4C 39.25. We did not shift\nthe frequency axes of the maser interferometer spectra to compensate for the Doppler shift\nchanges during the ±5 hr UGC 3789 observing track, as these effects were less than our\nvelocity resolution of 1.7 km s−1 .\n\n\f–6–\nThe final calibration involved selecting a maser feature as the interferometer phasereference. The strongest maser feature in the spectrum peaked at ≈ 0.07 Jy and was\nfairly broad. We found that using 5 channels spanning an LSR velocity range of 2685\nto 2692 km s−1 (i.e. channels 52 to 56 from the blue-shifted high velocity band centered at\nVLSR = 2670 km s−1 ), adding together both polarizations, and fitting fringes over a 1 min\nperiod gave optimum results. The St. Croix (SC) antenna failed to produce phase-reference\nsolutions and data from that antenna were discarded. For most antennas at most times the\nphases could be easily interpolated between solutions. However, when the differences between\nadjacent reference phases exceeded 60◦ , the data between those times were discarded. This\nediting was done on baseline (not antenna) data, since correlated phases between antennas\ndo not affect interferometer coherence.\nAfter calibration, we Fourier transformed the gridded (u,v)-data to make images of the\nmaser emission in all spectral channels for each of the five IF bands. The point-source\nresponse function had FWHM of 0.35 × 0.22 mas elongated along a position angle of −17◦\neast of north. The images were deconvolved with the point-source response using the CLEAN\nalgorithm and restored with a circular Gaussian beam with a 0.30 mas FWHM. All images\nappeared to contain single, point-like maser spots. We then fitted each spectral channel\nimage with an elliptical Gaussian brightness distribution in order to obtain positions and\nflux densities.\n\n3.\n\nResults & Discussion\n\nChannel maps typically had rms noise levels of ≈ 0.9 mJy for the dual-polarized IF bands\nand ≈ 1.2 mJy for the single-polarization IF bands. The flux densities from the Gaussian fits\nfor all spectral channels in all IF bands were used to generate the interferometer spectrum\nshown in Fig. 1. When little signal was detected in a spectral channel, as evidenced by a\nfailed fit or a spot size greater than 1 mas, we assigned that channel zero flux density.\nThe flux densities and positions determined by Gaussian fitting each spectral channel\nimage are reported in Tables 2, 3 and 4 for maser spots stronger than 10 mJy. The positions\nof these spots are plotted in Fig. 2. The nearly linear arrangement of the maser spots on the\nsky is striking. The red- and blue-shifted high-velocity spots straddle the systemic emission\ncomplex. This spatial-velocity arrangement is characteristic of a nearly edge-on disk, as is\nwell documented for NGC 4258 (Herrnstein et al. 2005).\nWe calculated the position along the spot distribution (i.e. an impact parameter along\nposition angle of 41◦ east of north) and show a position-velocity plot in Fig. 3. The high-\n\n\f–7–\n\nFig. 1.- Interferometer spectrum of the 22 GHz H2 O masers toward UGC 3789 constructed\nfrom VLBI data using the VLBA, the GBT and the Effelsberg antennas. The systemic\nvelocity of the galaxy of 3325 ± 24 km s−1 , as determined from HI observations, is within\nthe systemic velocity components shown in green colors. High velocity components, shifted\nby up to 800 km s−1 from the systemic velocity, are shown in blue and red colors. Broadband spectra taken with the GBT before the VLBI observations showed almost no detectable\nmaser features outside our observing bands, indicated by horizontal lines below the spectrum.\n\n\f–8–\n\nFig. 2.- Map of the relative positions of individual maser spots toward UGC 3789. High\nvelocity blue-shifted (blue) and red-shifted (red) masers straddle the systemic masers (green\nand expanded view inset) and the linear arrangement of spots suggests that we are viewing\na nearly edge-on rotating disk, similar to that seen in NGC 4258. The ≈ 2 mas extent of the\nmaser spots in UGC 3789 is approximately seven times smaller than for NGC 4258, which\nis consistent with UGC 3789 being at approximately seven times greater distance. Formal\nfitting uncertainties are given in Tables 2, 3 and 4 and are typically < 0.010 mas.\n\n\f–9–\n√\nvelocity masers display a Keplerian velocity (V ∝ 1/ R) versus impact parameter (or\nradius), suggesting that the gravitational potential is dominated by a SMBH. The Keplerian\nvelocity pattern is centered at VLSR ≈ 3265 km s−1 . This is slightly offset from the central\nvelocity of HI emission from the galaxy at VHelio ≈ 3325 ± 24 km s−1 (Theureau et al.\n1998). (Note: VLSR − VHelio = 0.3 km s−1 for UGC 3789.) Correcting the maser velocity\nto the CMB reference frame (i.e. VCMB ≈ VLSR + 60 km s−1 ), yields a recessional velocity of\n3325 km s−1 . Thus, for H0 = 72 km s−1 Mpc−1 , UGC 3789's distance would be expected\nto be ≈ 46 Mpc.\nThe detected blue-shifted high velocity masers sample disk radii between 0.35 and\n0.70 mas (0.08 to 0.16 pc) and achieve rotation speeds as high as 792 km s−1 , with respect to a central systemic velocity of 3265 km s−1 . The detected red-shifted masers sample\nradii of 0.50 to 1.33 mas (0.11 to 0.30 pc) and achieve rotation speeds up to 647 km s−1 . Also\nshown by the straight dotted lines in Fig. 3 is the position-velocity distribution expected for\nsystemic maser spots that lie at a radius of 0.43 mas from the central mass, whose assumed\nlocation is indicated by the plus-sign (+) in the figure. These spatial-kinematic parameters\nare comparable to those of the H2 O masers in NGC 4258, which sample radii of ≈ 0.14 to\n0.28 pc and achieve rotation speeds of ≈ 1100 km s−1 . The moderately lower rotation speed\nat a slightly smaller radius suggests that the SMBH at the center of UGC 3789 is less massive\nthan the 3.9 × 107 M⊙ SMBH in NGC 4258. At a distance of 46 Mpc, the high-velocity data\nfor UGC 3789 can be well fit by gas in circular orbit about a central mass of 1.1 × 107 M⊙ ,\nas shown by the blue and red dotted lines in Fig. 3.\nAs can be seen in Fig. 2, the systemic features lie between the high velocity features\nbut are distributed along a position angle of roughly 10◦ (east of north). Thus, they are\nmisaligned by approximately 30◦ with respect to the 41◦ position angle of the disk, obtained\nby drawing a line through the high velocity masers. This suggests that the UGC 3789 disk\nmay be slightly inclined and warped and/or that the systemic masers are not all at the same\nradius. (Note that the NGC 4258 disk is both inclined by 8◦ with respect to our line of\nsight and warped (Herrnstein et al. 2005).) Deviation from a perfectly flat, edge-on disk\nfor UGC 3789 can also be seen in the position-velocity plot (Fig. 3) as a slight bending of\nthe systemic maser spots and in the variation in accelerations seen by Braatz & Gugliucci\n(2008). Modeling of the disk will need to accommodate these complications.\nWe searched for continuum emission from the vicinity of the SMBH (i.e. near the\nposition of the systemic velocity masers) by summing channels 5 through 120 of the (red\nshifted) dual-circularly polarized band centered at VLSR = 3380 km s−1 . We maximized\nthe detection sensitivity by natural weighting of the data when imaging. The masers were\ndetected at the expected position, offset by ≈ 1 mas from the position of the SMBH, but no\n\n\f– 10 –\n\nFig. 3.- Position-Velocity plot of the maser spots toward UGC 3789.\nThe high velocity\n√\nblue-shifted (blue) and red-shifted (red) spots display a Keplerian 1/ R rotation curve, indicated by the curved dotted lines. The systemic masers (green) are consistent with projected\npositions and velocities for gas in Keplerian orbit at R ≈ 0.43 mas, indicated by the straight\ndotted line, but small deviations from a linear distribution are apparent. Impact parameter\nis defined as distance along a position angle of 41◦ east of north from an (east,north) offset\nof (−0.4, −0.5) mas; the plus sign (+) at (−0.03 mas, 3265 km s−1 ) indicates the assumed\ncenter of the SMBH.\n\n\f– 11 –\ncontinuum emission was detected at a 2σ limit of < 0.14 mJy.\n\n4.\n\nConclusions\n\nThe discovery of H2 O masers emanating from a sub-pc disk in the Seyfert 2 galaxy\nNGC 4258 more than two decades ago has led to detailed imaging of an AGN accretion disk.\nGeometric modeling of the Keplerian orbits of the masers yielded the most accurate distance\nto any galaxy, allowing recalibration of the extragalactic distance scale. Now, the recent\ndiscovery by Braatz & Gugliucci (2008) of H2 O masers in UGC 3789 offers the opportunity\nto extend this technique to a galaxy seven times more distant.\nIn this paper we presented VLBI images of the UGC 3789 H2 O masers, which showed\nthat these masers are remarkably similar to those in NGC 4258. In both sources, the spatial\ndistribution is nearly linear, with high velocity masers on both sides (both spatially and\nspectrally) of systemic velocity masers. The masers trace gas in Keplerian orbits with rotation speeds of ∼ 1000 km s−1 at radii of ∼ 0.1 pc, presumably moving under the influence\nof a ∼ 107 M⊙ SMBH.\nUGC 3789 has a recessional velocity of ≈ 3325 km s−1 and is well into the Hubble flow.\nThe VLBI results presented in this paper will be followed by detailed spectral monitoring\ndata and disk modeling in Paper II to determine the distance to UGC 3789. This angulardiameter distance, when combined with its recessional velocity, should yield a direct and\naccurate estimate of H0 .\nFacilities: VLBA, GBT, Effelsberg\n\nREFERENCES\nArgon, A. L., Greenhill, L. J., Reid, M. J., Moran, J. M. & Humphreys, E. M. L. 2007, ApJ,\n659, 1040\nBraatz, J. A., Wilson, A. S. & Henkel, C. 1996, ApJS, 106, 51\nBraatz, J. A., Henkel, C., Greenhill, L., Moran, J. & Wilson, A. 2004, ApJ, 617, L29\nBraatz, J. A. & Gugliucci, N. 2008, ApJ, 678, 96\nBraatz et al. 2008 (Paper II), in preparation\n\n\f– 12 –\nClaussen, M. J. & Lo, K.-Y. 1986, ApJ, 308, 592\nFreedman, W. et al. 2001, ApJ, 553, 47\nGreenhill, L. J., Jiang, D. R., Moran, J. M., Reid, M. J., Lo, K. Y. & Claussen, M. J. 1995a,\nApJ, 440, 619\nGreenhill, L. J., Henkel, C., Becker, R., Wilson, T. L. & Wouterloot, J. G. A. 1995b, A&A,\n304, 21\nGreenhill et al. 2002, ApJ, 565, 836\nGreenhill, L. J., Kondratko, P. T., Lovell, J. E. J., Kuiper, T. B. H., Moran, J. M., Jauncey,\nD. L. & Baines, G. P. 2003, ApJ, 582, L11\nGreenhill, L. J. 2004, NewAR, 48, 1079\nHaschick, A. D., Baan, W. A. & Peng, E. W. 1994, ApJ, 437, L35\nHenkel, C., Braatz, J. A., Greenhill, L. J. & Wilson, A. S. 2002, A&A, 394, L23\nHerrnstein et al. 1999, Nature, 400, 539\nHerrnstein, J. R., Moran, J. M., Greenhill, L. J. and Trotter, A. S. 2005, ApJ, 629, 719\nHu, W. 2005, ASP Conf Series Vol 339, Observing Dark Energy, eds. S.C. Wolff & T.R.\nLauer (San Francisco: ASP), 215\nHumphreys, E. M. L., Reid, M. J., Greenhill, L. J., Moran, J. M. & Argon, A. L. 2008, ApJ,\n672, 800\nKondratko, P. T. et al. 2006, ApJ, 638, 100\nKondratko, P. T., Greenhill, L. J. & Moran, J. M. 2006, ApJ, 652, 136\nMacri, L. M., Stanek, K. Z., Bersier, D., Greenhill, L. J. & Reid, M. J. 2006, ApJ, 652, 1133\nMiyoshi, M., Moran, J., Herrnstein, J., Greenhill, L., Nakai, N., Diamond, P. & Inoue, M.\n1995, Nature, 373, 127\nNewman, J. A. et al. 2001, ApJ, 553, 562\nRatra, B. & Peebles, P. J. E. 1988, Phys. Rev. D, 37, 3406\nReid, M. J. & Brunthaler, A. 2004, ApJ, 616, 872\n\n\f– 13 –\nSpergel, D. N. et al. 2003, ApJS, 148, 175\nTheureau et al. 1998, A&AS, 130, 333\nWalker,\nC.\n&\nChatterjee,\nS.,\n2000,\nVLBA\nhttp://www.nrao.edu/memos/sci/gps ion.html\nWatson, W. & Wallin, B. 1994, ApJ, 432, L35\nWetterich, C. 1988, Nucl. Phys. B, 302, 668\n\nThis preprint was prepared with the AAS LATEX macros v5.2.\n\nScientific\n\nMemo\n\n23,\n\n\f– 14 –\n\nTable 1. Source Positions\nSource\n\nUGC 3789 ...........\nJ0728+5907 .........\nJ0753+5352 .........\n\nR.A. (J2000)\n(h m s)\n\nDec. (J2000)\n(d ' \")\n\n07 19 30.9566 59 21 18.330\n07 28 47.2170 59 07 34.128\n07 53 01.3846 53 52 59.637\n\nNote. - Positions used for data correlation. Imaging the UGC 3789 maser spot at VLSR = 2689 km s−1\n, by phase-referencing to J0728+5907, we found the\nmaser spot offset by (−1, −15) mas (east,north) from\nthe correlation position.\n\n\f– 15 –\n\nTable 2. UGC 3789 Red-shifted High-velocity Spots\nVLSR\nFlux Density\n−1\n(km s )\n(mJy)\n\nΘx\n(mas)\n\nσΘx\n(mas)\n\nΘy\n(mas)\n\nσΘy\n(mas)\n\n3912.3.....\n3910.6.....\n3908.9.....\n3881.7.....\n3880.0.....\n3868.1.....\n3866.4.....\n3864.7.....\n3863.0.....\n3861.3.....\n\n11.5\n13.3\n12.0\n10.5\n11.0\n10.8\n13.3\n14.0\n13.6\n13.8\n\n−0.737\n−0.719\n−0.725\n−0.744\n−0.760\n−0.755\n−0.757\n−0.760\n−0.765\n−0.767\n\n0.009\n0.008\n0.009\n0.010\n0.010\n0.010\n0.008\n0.008\n0.008\n0.008\n\n−0.827\n−0.829\n−0.834\n−0.863\n−0.868\n−0.868\n−0.874\n−0.876\n−0.884\n−0.866\n\n0.013\n0.012\n0.013\n0.015\n0.014\n0.014\n0.012\n0.011\n0.011\n0.011\n\n3761.0.....\n3759.3.....\n3757.6.....\n3755.9.....\n3754.2.....\n3738.9.....\n3737.2.....\n3735.5.....\n3660.7.....\n\n13.2\n15.0\n18.1\n14.8\n10.3\n10.6\n10.0\n13.0\n12.0\n\n−0.940\n−0.944\n−0.947\n−0.939\n−0.959\n−1.002\n−0.986\n−0.970\n−1.197\n\n0.011\n0.009\n0.008\n0.009\n0.014\n0.013\n0.014\n0.011\n0.012\n\n−1.098\n−1.103\n−1.098\n−1.088\n−1.101\n−1.138\n−1.132\n−1.139\n−1.516\n\n0.015\n0.014\n0.011\n0.014\n0.020\n0.019\n0.020\n0.016\n0.017\n\nNote. - Columns 1 and 2 give the LSR velocity and flux density\nof maser spots in individual spectral channels. Columns 3 (5) and\n4 (6) give the east (north) offsets and their uncertainties. Offsets\nare with respect to the phase reference obtained by summing the\nemission between velocities 2685 and 2692 km s−1 .\n\n\f– 16 –\nTable 3. UGC 3789 Systemic Velocity Spots\nVLSR\nFlux Density\n−1\n(km s )\n(mJy)\n\nΘx\n(mas)\n\nσΘx\n(mas)\n\nΘy\n(mas)\n\nσΘy\n(mas)\n\n3316.0.....\n3312.6.....\n3310.9.....\n3309.2.....\n3307.5.....\n3305.8.....\n3304.1.....\n3302.4.....\n3300.7.....\n3299.0.....\n3297.3.....\n3295.6.....\n3293.9.....\n3292.2.....\n3290.5.....\n3288.8.....\n3287.1.....\n3273.5.....\n3271.8.....\n3270.1.....\n3268.4.....\n3266.7.....\n3263.3.....\n3261.6.....\n3259.9.....\n3258.2.....\n3256.5.....\n3253.1.....\n3251.4.....\n3249.7.....\n3248.0.....\n3246.3.....\n3244.6.....\n3242.9.....\n3239.5.....\n3234.4.....\n\n−0.412\n−0.405\n−0.413\n−0.404\n−0.409\n−0.402\n−0.404\n−0.412\n−0.406\n−0.406\n−0.404\n−0.400\n−0.402\n−0.403\n−0.404\n−0.404\n−0.400\n−0.403\n−0.402\n−0.398\n−0.405\n−0.400\n−0.402\n−0.403\n−0.404\n−0.411\n−0.424\n−0.404\n−0.403\n−0.403\n−0.399\n−0.397\n−0.387\n−0.393\n−0.396\n−0.402\n\n0.010\n0.008\n0.004\n0.003\n0.003\n0.004\n0.003\n0.002\n0.002\n0.003\n0.003\n0.002\n0.003\n0.004\n0.006\n0.007\n0.010\n0.003\n0.003\n0.006\n0.009\n0.007\n0.009\n0.007\n0.008\n0.008\n0.009\n0.009\n0.010\n0.005\n0.005\n0.006\n0.005\n0.006\n0.008\n0.009\n\n−0.502\n−0.504\n−0.488\n−0.497\n−0.498\n−0.501\n−0.496\n−0.486\n−0.489\n−0.486\n−0.489\n−0.494\n−0.483\n−0.491\n−0.505\n−0.473\n−0.487\n−0.476\n−0.477\n−0.477\n−0.487\n−0.453\n−0.483\n−0.447\n−0.442\n−0.441\n−0.436\n−0.443\n−0.447\n−0.445\n−0.426\n−0.436\n−0.429\n−0.432\n−0.430\n−0.405\n\n0.015\n0.011\n0.006\n0.004\n0.005\n0.006\n0.005\n0.004\n0.003\n0.004\n0.004\n0.003\n0.004\n0.005\n0.009\n0.010\n0.014\n0.004\n0.004\n0.008\n0.014\n0.011\n0.013\n0.010\n0.011\n0.012\n0.014\n0.013\n0.014\n0.007\n0.007\n0.008\n0.007\n0.008\n0.012\n0.013\n\n10.1\n13.7\n24.1\n34.2\n31.6\n25.9\n31.1\n42.3\n56.4\n41.8\n35.7\n45.9\n36.4\n29.4\n17.7\n14.9\n10.8\n36.2\n40.1\n18.5\n11.2\n14.4\n12.2\n15.5\n13.9\n12.8\n11.3\n11.6\n10.9\n21.4\n21.3\n18.3\n21.9\n18.6\n12.8\n11.8\n\n\f– 17 –\nTable 4. UGC 3789 Blue-shifted High-velocity Spots\nVLSR\nFlux Density\n−1\n(km s )\n(mJy)\n\nΘx\n(mas)\n\nσΘx\n(mas)\n\nΘy\n(mas)\n\nσΘy\n(mas)\n\n2741.4.....\n2739.7.....\n2738.0.....\n2736.3.....\n2734.6.....\n2721.0.....\n2719.3.....\n2717.6.....\n2714.2.....\n2712.5.....\n2710.8.....\n2709.1.....\n2707.4.....\n2705.7.....\n2704.0.....\n2702.3.....\n2700.6.....\n2698.9.....\n2697.2.....\n2695.5.....\n2693.8.....\n2692.1.....\n2690.4.....\n2688.7.....\n2687.0.....\n2685.3.....\n2683.6.....\n2681.9.....\n2680.2.....\n2678.5.....\n2634.3.....\n2632.6.....\n2630.9.....\n\n0.050\n0.036\n0.036\n0.032\n0.048\n0.072\n0.063\n0.057\n0.051\n0.055\n0.047\n0.027\n0.020\n0.018\n0.011\n0.009\n0.014\n0.016\n0.014\n0.009\n0.008\n0.002\n0.007\n0.000\n0.001\n−0.003\n−0.005\n−0.004\n−0.015\n−0.005\n−0.044\n−0.047\n−0.041\n\n0.005\n0.007\n0.008\n0.005\n0.004\n0.007\n0.006\n0.008\n0.010\n0.010\n0.010\n0.009\n0.006\n0.004\n0.004\n0.003\n0.003\n0.002\n0.002\n0.002\n0.002\n0.002\n0.002\n0.002\n0.002\n0.002\n0.003\n0.004\n0.005\n0.008\n0.008\n0.007\n0.008\n\n0.048\n0.043\n0.046\n0.024\n0.049\n0.055\n0.061\n0.043\n0.052\n0.039\n0.040\n0.008\n0.039\n0.028\n0.005\n0.014\n0.012\n0.011\n0.011\n0.015\n0.006\n0.008\n0.003\n0.003\n0.000\n−0.010\n−0.004\n−0.011\n−0.010\n−0.025\n−0.076\n−0.058\n−0.053\n\n0.007\n0.010\n0.011\n0.007\n0.006\n0.011\n0.009\n0.011\n0.015\n0.015\n0.015\n0.014\n0.009\n0.006\n0.006\n0.005\n0.004\n0.003\n0.003\n0.004\n0.003\n0.003\n0.003\n0.002\n0.003\n0.003\n0.004\n0.006\n0.007\n0.012\n0.011\n0.010\n0.011\n\n21.5\n15.2\n13.8\n22.8\n26.6\n14.2\n16.2\n13.4\n10.5\n10.4\n10.4\n11.2\n16.9\n24.1\n27.3\n31.1\n40.7\n50.7\n48.7\n42.7\n48.5\n55.8\n61.3\n68.8\n60.4\n48.4\n37.5\n27.5\n21.8\n13.3\n13.5\n15.1\n13.4\n\n\f– 18 –\n\nTable 4-Continued\nVLSR\nFlux Density\n−1\n(km s )\n(mJy)\n\nΘx\n(mas)\n\nσΘx\n(mas)\n\nΘy\n(mas)\n\nσΘy\n(mas)\n\n2617.3.....\n2615.6.....\n2613.9.....\n2612.2.....\n2610.5.....\n2608.8.....\n2607.1.....\n2605.4.....\n2603.7.....\n\n29.0\n32.3\n34.4\n33.6\n23.9\n23.0\n12.6\n23.5\n13.0\n\n−0.071\n−0.069\n−0.080\n−0.075\n−0.065\n−0.074\n−0.068\n−0.079\n−0.080\n\n0.004\n0.003\n0.003\n0.003\n0.004\n0.005\n0.008\n0.004\n0.008\n\n−0.084\n−0.079\n−0.086\n−0.082\n−0.084\n−0.088\n−0.100\n−0.099\n−0.112\n\n0.005\n0.005\n0.004\n0.005\n0.006\n0.007\n0.012\n0.007\n0.012\n\n2602.0.....\n2590.1.....\n2588.4.....\n2586.7.....\n2569.7.....\n2568.0.....\n2566.3.....\n2564.6.....\n2474.5.....\n2472.8.....\n\n13.6\n10.4\n20.9\n12.8\n10.7\n20.2\n28.0\n23.7\n15.7\n23.7\n\n−0.065\n−0.074\n−0.090\n−0.103\n−0.122\n−0.120\n−0.121\n−0.116\n−0.176\n−0.182\n\n0.010\n0.013\n0.007\n0.011\n0.013\n0.007\n0.005\n0.006\n0.009\n0.006\n\n−0.105\n−0.089\n−0.118\n−0.136\n−0.130\n−0.141\n−0.148\n−0.157\n−0.164\n−0.189\n\n0.015\n0.020\n0.010\n0.016\n0.019\n0.010\n0.007\n0.009\n0.013\n0.009\n\nNote. - See Table 2\n\n\f"}