{"id": "http://arxiv.org/abs/0805.0142v2", "guidislink": true, "updated": "2009-01-11T19:44:23Z", "updated_parsed": [2009, 1, 11, 19, 44, 23, 6, 11, 0], "published": "2008-05-01T20:07:43Z", "published_parsed": [2008, 5, 1, 20, 7, 43, 3, 122, 0], "title": "Absence of a consistent classical equation of motion for a\n  mass-renormalized point charge", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0805.2725%2C0805.3034%2C0805.3632%2C0805.1634%2C0805.3705%2C0805.1569%2C0805.4431%2C0805.0142%2C0805.3784%2C0805.2254%2C0805.4259%2C0805.4681%2C0805.0488%2C0805.1504%2C0805.3280%2C0805.4509%2C0805.2634%2C0805.0452%2C0805.3406%2C0805.3993%2C0805.2053%2C0805.0814%2C0805.2216%2C0805.3776%2C0805.2972%2C0805.1149%2C0805.4569%2C0805.2030%2C0805.0657%2C0805.3929%2C0805.1980%2C0805.0191%2C0805.0889%2C0805.0437%2C0805.3927%2C0805.3907%2C0805.3859%2C0805.0212%2C0805.1814%2C0805.2700%2C0805.2005%2C0805.1964%2C0805.1840%2C0805.1201%2C0805.0221%2C0805.0340%2C0805.1488%2C0805.1178%2C0805.4741%2C0805.3574%2C0805.0326%2C0805.1861%2C0805.0789%2C0805.0568%2C0805.4592%2C0805.2565%2C0805.0756%2C0805.3327%2C0805.2846%2C0805.2770%2C0805.2428%2C0805.1152%2C0805.0612%2C0805.3652%2C0805.0827%2C0805.0060%2C0805.0055%2C0805.3382%2C0805.2838%2C0805.3270%2C0805.3457%2C0805.2519%2C0805.1801%2C0805.3098%2C0805.2954%2C0805.1754%2C0805.4516%2C0805.2474%2C0805.2199%2C0805.3118%2C0805.3436%2C0805.0112%2C0805.2632%2C0805.0156%2C0805.4145%2C0805.1386%2C0805.1787%2C0805.3601%2C0805.1287%2C0805.0541%2C0805.2014%2C0805.1629%2C0805.3821%2C0805.0778%2C0805.4488%2C0805.4525%2C0805.0829%2C0805.0939%2C0805.0285%2C0805.1614%2C0805.3344&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Absence of a consistent classical equation of motion for a\n  mass-renormalized point charge"}, "summary": "The restrictions of analyticity, relativistic (Born) rigidity, and negligible\nO(a) terms involved in the evaluation of the self electromagnetic force on an\nextended charged sphere of radius \"a\" are explicitly revealed and taken into\naccount in order to obtain a classical equation of motion of the extended\ncharge that is both causal and conserves momentum-energy. Because the\npower-series expansion used in the evaluation of the self force becomes invalid\nduring transition time intervals immediately following the application and\ntermination of an otherwise analytic externally applied force, transition\nforces must be included during these transition time intervals to remove the\nnoncausal pre-acceleration and pre-deceleration from the solutions to the\nequation of motion without the transition forces. For the extended charged\nsphere, the transition forces can be chosen to maintain conservation of\nmomentum-energy in the causal solutions to the equation of motion within the\nrestrictions of relativistic rigidity and negligible O(a) terms under which the\nequation of motion is derived. However, it is shown that renormalization of the\nelectrostatic mass to a finite value as the radius of the charge approaches\nzero introduces a violation of momentum-energy conservation into the causal\nsolutions to the equation of motion of the point charge if the magnitude of the\nexternal force becomes too large. That is, the causal classical equation of\nmotion of a point charge with renormalized mass experiences a high acceleration\ncatastrophe.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0805.2725%2C0805.3034%2C0805.3632%2C0805.1634%2C0805.3705%2C0805.1569%2C0805.4431%2C0805.0142%2C0805.3784%2C0805.2254%2C0805.4259%2C0805.4681%2C0805.0488%2C0805.1504%2C0805.3280%2C0805.4509%2C0805.2634%2C0805.0452%2C0805.3406%2C0805.3993%2C0805.2053%2C0805.0814%2C0805.2216%2C0805.3776%2C0805.2972%2C0805.1149%2C0805.4569%2C0805.2030%2C0805.0657%2C0805.3929%2C0805.1980%2C0805.0191%2C0805.0889%2C0805.0437%2C0805.3927%2C0805.3907%2C0805.3859%2C0805.0212%2C0805.1814%2C0805.2700%2C0805.2005%2C0805.1964%2C0805.1840%2C0805.1201%2C0805.0221%2C0805.0340%2C0805.1488%2C0805.1178%2C0805.4741%2C0805.3574%2C0805.0326%2C0805.1861%2C0805.0789%2C0805.0568%2C0805.4592%2C0805.2565%2C0805.0756%2C0805.3327%2C0805.2846%2C0805.2770%2C0805.2428%2C0805.1152%2C0805.0612%2C0805.3652%2C0805.0827%2C0805.0060%2C0805.0055%2C0805.3382%2C0805.2838%2C0805.3270%2C0805.3457%2C0805.2519%2C0805.1801%2C0805.3098%2C0805.2954%2C0805.1754%2C0805.4516%2C0805.2474%2C0805.2199%2C0805.3118%2C0805.3436%2C0805.0112%2C0805.2632%2C0805.0156%2C0805.4145%2C0805.1386%2C0805.1787%2C0805.3601%2C0805.1287%2C0805.0541%2C0805.2014%2C0805.1629%2C0805.3821%2C0805.0778%2C0805.4488%2C0805.4525%2C0805.0829%2C0805.0939%2C0805.0285%2C0805.1614%2C0805.3344&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The restrictions of analyticity, relativistic (Born) rigidity, and negligible\nO(a) terms involved in the evaluation of the self electromagnetic force on an\nextended charged sphere of radius \"a\" are explicitly revealed and taken into\naccount in order to obtain a classical equation of motion of the extended\ncharge that is both causal and conserves momentum-energy. Because the\npower-series expansion used in the evaluation of the self force becomes invalid\nduring transition time intervals immediately following the application and\ntermination of an otherwise analytic externally applied force, transition\nforces must be included during these transition time intervals to remove the\nnoncausal pre-acceleration and pre-deceleration from the solutions to the\nequation of motion without the transition forces. For the extended charged\nsphere, the transition forces can be chosen to maintain conservation of\nmomentum-energy in the causal solutions to the equation of motion within the\nrestrictions of relativistic rigidity and negligible O(a) terms under which the\nequation of motion is derived. However, it is shown that renormalization of the\nelectrostatic mass to a finite value as the radius of the charge approaches\nzero introduces a violation of momentum-energy conservation into the causal\nsolutions to the equation of motion of the point charge if the magnitude of the\nexternal force becomes too large. That is, the causal classical equation of\nmotion of a point charge with renormalized mass experiences a high acceleration\ncatastrophe."}, "authors": ["Arthur D. Yaghjian"], "author_detail": {"name": "Arthur D. Yaghjian"}, "author": "Arthur D. Yaghjian", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevE.78.046606", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0805.0142v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0805.0142v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "13 pages, No figures", "arxiv_primary_category": {"term": "physics.class-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.class-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0805.0142v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0805.0142v2", "journal_reference": "Published in Physical Review E 78, 046606 (2008)", "doi": "10.1103/PhysRevE.78.046606", "fulltext": "Absence of a Consistent Classical Equation of Motion for a Mass-Renormalized Point Charge\n\narXiv:0805.0142v2 [physics.class-ph] 11 Jan 2009\n\nArthur D. Yaghjian\nThe restrictions of analyticity, relativistic (Born) rigidity, and negligible O(a) terms involved\nin the evaluation of the self electromagnetic force on an extended charged sphere of radius a are\nexplicitly revealed and taken into account in order to obtain a classical equation of motion of the\nextended charge that is both causal and conserves momentum-energy. Because the power-series\nexpansion used in the evaluation of the self-force becomes invalid during transition time intervals\nimmediately following the application and termination of an otherwise analytic externally applied\nforce, a transition force must be included during each of these two transition time intervals to\nremove the noncausal pre-acceleration and pre-deceleration from the solution to the equation of\nmotion without the transition forces. Although the exact time dependence of each transition force\nis not known, the effect of each transition force on the solution to the equation of motion can be\ndetermined to within a single unknown constant, the change in velocity of the charge across the\ntransition interval. For the extended charged sphere, the changes in velocity across the transition\nintervals can be chosen to maintain conservation of momentum-energy in the causal solutions to\nthe equation of motion within the restrictions of relativistic rigidity and negligible O(a) terms\nunder which the equation of motion is derived. However, regardless of the values chosen for the\nchanges in the velocity across the transition intervals, renormalization of the electrostatic mass to a\nfinite value as the radius of the charge approaches zero introduces a violation of momentum-energy\nconservation into the causal solutions to the equation of motion of the point charge if the magnitude\nof the external force becomes too large. That is, the causal classical equation of motion of a point\ncharge with renormalized mass experiences a high acceleration catastrophe.\nI.\n\nINTRODUCTION\n\nThe purpose of this paper is twofold: first, to explain\nwhy a fully consistent classical equation of motion for\na point charge, unlike that of an extended charge, does\nnot exist and, second, to show that this inconsistency is\ncaused by the renormalization of the electrostatic mass\nof the charge as its radius is allowed to approach zero.\nThe proof of these results for the mass-renormalized point\ncharge depends critically upon proving the closely related\nresult that the classical equation of motion of the extended charged particle without renormalized mass can\nbe properly modified at its nonanalytic points of time\n(where the traditional derivation fails) to yield an equation of motion that is causal (free of pre-acceleration and\npre-deceleration) and consistent with momentum-energy\nconservation to within the conditions imposed by the assumptions of relativistic (Born) rigidity and negligible\nO(a) terms involved in the evaluation of the radiation\nreaction of the extended charged particle.\nAlthough the relativistic version of Newton's second\nlaw of motion for uncharged particles, and the MaxwellLorentz equations for moving charges, are part of the\nfundamental assumptions of classical physics, it remains\nuncertain as to how to combine the self electromagnetic\nforce on a moving charge determined from the MaxwellLorentz equations with Newton's second law of motion to\nobtain an equation of motion for a charged particle that\nobeys both causality and conservation of momentumenergy. The difficulty lies not only in the impossibility of\nevaluating the integrals for the self electromagnetic force\nexactly for all time (because the velocity of the particle is not known a priori) but also in not knowing what\nintegral equation, if any, the velocity should satisfy for\n\nall time. The challenge is much greater than solving a\nknown complicated equation of motion. It is to examine the self electromagnetic force on a moving charge in\nhopes of extracting a reasonable classical equation of motion for charged particles that does not violate fundamental principles of classical physics, namely, causality and\nconservation of momentum-energy.\nThe motivation behind the purely classical approach\ntaken throughout this paper is not to find the equation\nof motion of an actual fundamental charged particle such\nas the electron or to find a realistic model for one of\nthese fundamental particles. The limitations of classical physics imposed by quantum mechanics and quantum electrodynamics are well-known. However, we can\ndivorce the classical pursuit of a consistent equation of\nmotion from the question of whether or not the idealized\nmodel we use for the charge (whose radius may approach\nzero) approximates an electron (for example) or whether\nthe resultant equation of motion is consistent with quantum physics (even though a robust classical equation of\nmotion may provide insight for its analogue in quantum\nphysics). We assume that if we could enter an idealized\nclassical laboratory, distribute surface charge uniformly\non a perfectly insulating sphere (a continuous medium\nin which the speed of light is assumed to remain equal\nto c), and apply an external electromagnetic field to the\nsphere, we would observe a motion that is consistent with\ncausality and momentum-energy conservation and that is\npredictable by the equations of classical physics. Unfortunately, if extremely large values of the externally applied force are allowed, no classical equation of motion\nfound to date predicts such a fully consistent motion for\na charged particle with renormalized mass as the radius\napproaches zero - as will be explained.\n\n\f2\nII.\n\nEXTENDED CHARGED SPHERE\n\nUltimately, our goal is to obtain a classical equation\nof motion of a point charge, but since the electrostatic\nenergy of formation and thus the electrostatic mass of a\npoint charge is infinite, it is reasonable to begin with\nan extended model of a charged particle, namely, an\nideal, relativistically rigid, charged insulating sphere (the\nLorentz model [1], [2]). Moreover, the textbook expression for the power radiated by a charge [3, sec. 14.2] becomes invalid if the velocity or the time derivatives of the\nvelocity of the charge change abruptly with time (such\nas when the external force is first applied or terminated).\nThus, one begins with an extended charge in hopes of\ndetermining an expression for its radiation reaction that\nremains valid for unrestricted values of the velocity and\nits time derivatives as the radius of the charge approaches\nzero.\nIt is assumed throughout that the sphere is not rotating. This assumption is justified by the work of Nodvik, who shows that the effect of a finite angular velocity of rotation on the self force and self power of the\nLorentz model in arbitrary motion is of O(a) (the order\nof the terms neglected in the equation of motion of the\nextended charge), which approaches zero as the radius of\nthe charge approaches zero [4, eq. (7.28)]. Also, since\nrotational effects are of O(a) and thus become negligible\nif a is small enough, the sphere can be assumed to translate without rotation in each instantaneous rest frame.\nThus, the result of von Laue [Phys. Zeit., 12, 85 (1911)]\nthat a relativistic body generally has an infinite number\nof degrees of freedom does not apply to the translating\nrelativistically rigid model [18]. Also, as Pauli [Theory of\nRelativity, p. 132] explains, although \"a rigid body has\nno place in relativistic mechanics, it is nevertheless useful\nand natural to introduce the concept of rigid motion of\na body....for which Born's condition is satisfied.\"\nOne can immediately postulate an expression for the\nequation of motion of an extended charge and, in particular, for that of the charged sphere with small radius a\nand total charge e, in the form of the relativistic version\nof Newton's second law of motion with an added electromagnetic radiation reaction force Frad (t) on the charge\nmoving with center velocity u(t) (written as just u)[23]\nFext (t) + Frad (t) = (mes + mins )\n1\n\nγ = (1 − u2 /c2 )− 2\n\nd\n(γu)\ndt\n\n(1a)\n\n(1b)\n\nwhere Fext (t) is the external force applied to the charged\nsphere at the time t, mins is the mass of the uncharged\ninsulator,[24] and mes is the electrostatic mass equal to\nthe formation energy (needed to bring the charge from\ninfinity to the surface of the sphere) divided by c2\nmes =\n\ne2\n8πǫ0 ac2\n\n(2)\n\nwith ǫ0 the permittivity of free space.\nThe problem that remains is to determine an expression for the radiation reaction force Frad (t) that leads\nto a consistent equation of motion in (1a). In the following subsection, this problem is addressed by evaluating the self electromagnetic force Fem (t) on the moving charged sphere of radius a. Although the self electromagnetic force Fem (t) includes the force needed to\nchange the electromagnetic momentum of the charged\nsphere in addition to the radiation reaction force Frad (t),\nthis electromagnetic-momentum force can be subtracted\nat the end of the derivation to yield an expression for\nFrad (t) in terms of the time derivatives of the velocity of\nthe center of the charged sphere.\nA.\n\nEvaluation of the self electromagnetic force\n\nIn an instantaneous rest frame of the sphere, every point on the sphere moves with the center velocity\nu(t) = 0 and the self electromagnetic force can be written as a double integral over the charge distribution of\nthe electric-field force between all the differential charge\nelements on the surface of the sphere [7, chs. 20–21], [8,\neq. (A.1)]\nZZ\nFem (t) =\nE[r(t), r′ (t′ ), u′ (t′ ), u̇′ (t′ )] de′ de\n(3a)\ncharge\n\nwith u(t) = 0 and u′ (t) = 0, where de and de′ are two differential elements of the surface charge whose positions\nas a function of time are given by r(t) and r′ (t), respectively. E[r(t), r′ (t′ ), u′ (t′ ), u̇′ (t′ )] is the electric field per\nunit source charge exerted on de at the present position\nr(t) due to the source charge de′ at its retarded-time position r′ (t′ ) as measured in the reference frame in which\nthe charged sphere is at rest at the time t. It is given by\n[7, chs. 20–21], [8, eq. (A.2)]\n(\n1\nR̂′\n′\n′\n′\nE[r, r , u , u̇ ] =\n×\nh\ni3\nR ′ c2\n4πǫ0 1 − R̂′ * u′ (t′ )/c\n\u0013\n\u0015\n\u0014\u0012\nu′ (t′ )\n× u̇′ (t′ )]\nR̂′ −\nc\n\u0015)\n\u0014\n\u0015\u0014\n1\nu′2 (t′ )\nu′ (t′ )\n′\n+ ′2 1 −\n(3b)\nR̂ −\nR\nc2\nc\nwhere u′ (t′ ) = dr′ (t′ )/dt′ and u̇′ (t′ ) = d2 r′ (t′ )/dt′2 refer\nto the velocity and acceleration of the source charge de′\nat the retarded time\nt′ = t − R′ /c\n\n(3c)\n\nand the vector R′ is the difference between the position\nr(t) of de and the position r′ (t′ ) of de′ at the retarded\ntime t′\nR′ = r(t) − r′ (t′ ) ,\n\nR′ = |R′ | .\n\n(3d)\n\n\f3\nThe integral equation obtained by inserting Fem (t)\n[minus the electromagnetic momentum force, 4mes u̇/3;\nsee (11) and (16) below] from (3a) into (1a) cannot be\nsolved for the center velocity of the sphere because R′ ,\nu′ (t′ ), and u̇′ (t′ ) are functions of the position of the\ncharge elements at the retarded time t′ , for which there is\nnot an explicit expression in terms of the present time t.\nMoreover, during the time, just after the external force\nis first applied, that it takes light to traverse the charge\ndistribution, the elecromagnetic momentum force, which\nmust be subtracted from the total self electromagnetic\nforce to get the radiation reaction force, has an unknown\nvalue not necessarily equal to 4mes u̇/3. Consequently,\nthe usual approach for obtaining a classical equation of\nmotion for a charged particle is to follow the original\nidea of Lorentz [1], [2] and derive a power series expansion for the self electromagnetic force with respect to the\nsmall radius a of the charged sphere. For example, in\nthe instantaneous rest frame of time t, the derivatives of\nvelocity expand in a Taylor series as\nu′ (t′ ) = −u̇′ (t)\n\nR′2 (t′ )\nR′ (t′ )\n+ ***\n+ ü′ (t)\nc\n2c2\n\nu̇′ (t′ ) = u̇′ (t) − ü′ (t)\n\nR′ (t′ )\n+ ***\nc\n\n(4a)\n\n(4b)\n\nwhere the distance R′ (t′ ) has the Taylor series expansion\nR′ (t′ ) = R(t) −\n\n1.\n\nR(t)R * u̇′ (t)\n+ *** .\n2c2\n\n(4c)\n\nValidity of the Taylor series expansions\n\nThese Taylor series expansions in (4) are valid provided the velocity function u′ (t′ ) is an analytic function\nof complex time t′ for\n|t′ − t| ≤ [R′ (t′ )/c]max .\n\n(5)\n\n(Analyticity of u′ (t′ ) implies the analyticity of R′ (t′ )\nand u̇′ (t′ ) through integration and differentiation, respectively.) For the self-force calculation in the rest frame,\nR′ (t′ ) does not exceed a value of about 2a (assuming\nthe velocity does not change rapidly between t′ and t;\nin other words, assuming the velocity change is a small\nfraction of the speed of light during the time it takes light\nto traverse the charge distribution), and thus (5) can be\nrewritten as\n|t′ − t| ≤ ∆ta\n\n(6a)\n\nwhere ∆ta ≈ 2a/c. Even if the magnitude of the velocity\nchange (∆u) during the time 2a/c is a significant fraction\nof the speed of light, we have\n∆ta ≈\n\n1\n2a\n= O(a/c) .\nc 1 − |∆u|/c\n\n(6b)\n\nSuppose, for example, that an externally applied force\nthat is zero for t < t1 turns on at t = t1 and is an analytic\nfunction of time in a complex neighborhood of the real\nt axis until it turns off at t = t2 , after which time it\nremains zero. Then the Taylor series in (4) hold for all\n−∞ < t < +∞ except in the intervals\nt ∈ [t1 , t1 + ∆ta1 ] and t ∈ [t2 , t2 + ∆ta2 ]\n\n(7)\n\nwhere ∆ta1 and ∆ta2 are transition time intervals of\nO(a/c). Physically, ∆ta1 and ∆ta2 are the times it takes\nimmediately after the external force is first applied and\nimmediately after the external force is removed, respectively, for the abrupt change in radiation from each element of charge to communicate itself to all the other\nelements of charge on the sphere. (The ∆ta 's given in\n(6b) and (7) are for the instantaneous rest frames just\nbefore the changes in external forces occur. However,\nsince they remain of O(a/c) in every other inertial frame\nincluding the laboratory frame, throughout the paper we\nshall denote these transition time intervals by the same\nsymbol, ∆ta , for all inertial reference frames.)\nAbraham realized that the traditional series representation of the self electromagnetic force became invalid for\n\"discontinuous movements\" of the charge. In [9, sec. 23]\nhe states, \"These two forces [electromagnetic momentum\nterm plus radiation reaction] are basically nothing other\nthan the first two terms of a progression which increases\nin accordance with increasing powers of the electron's radius a. . . . Because the internal force is determined by\nthe velocity and acceleration existing in a finite interval\npreceding the affected point in time, such a progression\nis always possible when the movement is continuous and\nits velocity is less than the speed of light. . . . The series will converge more poorly the closer the movement\napproaches a discontinuous movement and the velocity\napproaches the speed of light . . . . It fails completely\nfor discontinuous movements. . . . Here, other methods\nmust be employed when computing the internal force.\"\nAbraham goes on to derive the radiated energy and momentum of a charged sphere with discontinuous velocity\n[9, sec. 25], [10]. He also derives Sommerfeld's general integral formulas for the internal electromagnetic force [11].\nNeither he nor Sommerfeld, however, evaluates or interprets these general integrals except to show they yield\na null result for a charged sphere moving with constant\nvelocity.\nSchott [12], [13, p. 283] also concludes that \"the approximation [used to obtain the Lorentz-Abraham equation of motion] fails during an interval of time, which is\ncomparable with the time required by an electromagnetic\nwave to pass across the electron and includes the instant\nat which the discontinuity occurs.\"\nMore recently, Valentini [14] observes that \"the usual\nderivations of the Lorentz-[Abraham-]Dirac equation are\nonly valid at times such that [the position of and force\napplied to the particle] are analytic functions [of time],\"\nand that nonanalyticity of these functions is responsible\nfor the noncausal pre-acceleration in the solution to the\n\n\f4\nLorentz-Abraham-Dirac equation of motion. However,\nthe modified solution proposed by Valentini did not take\ninto account changes in velocity across the transition intervals (see Section III.A below) and thus violated conservation of energy [15].\n2. Surface-charge accelerations in terms of center\nacceleration of sphere (requirements of relativistic rigidity)\n\nin the instantaneous rest frame, it becomes impossible to\ndescribe the motion of all the charge on the sphere by the\nmotion of the center of the sphere (or by the motion of\nany other single point of the sphere).\nSubstituting (8) into (4), the resulting equations into\n(3b), then E[r, r′ , u′ , u̇′ ] into (3a) yields [8, eq. (A.10)]\n\u0014 ′\n\u0015\nZZ (\n1\nr * u̇\n1\nR̂\nFem (t) =\n+\n−\n1\n4πǫ0\nR2\n2c2 R\nc2\ncharge\n\nThe acceleration u̇′ (t) and its derivatives in (4) at the\npresent time t are those of the charge elements de′ on\nthe surface of the sphere in the instantaneous inertial\nrest frame of the charged sphere at time t. Because of\nthe Lorentz contraction of the sphere, the values of these\naccelerations and their time derivatives on the surface of\nthe sphere are different from the corresponding values for\nthe center of the sphere. Therefore, before substituting\nfrom (4) into (3b), we need to determine the values of\nu̇′ (t) and ü′ (t) in terms of the center values denoted by\nu̇(t) = u̇ and ü(t) = ü.\nThe charged sphere is assumed to be relativistically\nrigid in the sense that the relative position of each material point of the nonrotating sphere remains the same\nin every instantaneous inertial rest frame. Thus, the\nproblem of finding the velocity, acceleration, and higher\nderivatives of velocity of each point of the surface of the\nsphere in terms of the corresponding values of the center\nof the sphere is identical to the problem of relativistic\nrigidity first proposed and studied by Born [16]. Specifically, as the radius a of the sphere gets small, it can be\nshown (see [17, eq. (A.3)])[25] that in the instantaneous\nrest frame (u(t) = 0) [8, eqs. (A.8) and (A.9)]\nu̇′ (t) = u̇(t) −\n\n\u0001\nr′ (t) * u̇(t)\nu̇(t) + O a2\nc2\n\nü′ (t) = ü(t) + O(a)\n\n(8a)\n(8b)\n\nwhere r′ (t) is the position (measured from the center\nof the sphere) of de′ on the surface of the sphere in\nm\nthe\nP∞ rest framen at time t. The symbol O(a ) means\nn=m αn (u)a where the αn (u) are finite functions of\nvelocity (and its time derivatives) but not functions of\na. By applying the results derived in [18], it is found\nin Appendix A that the relations in (8) hold under the\nrestriction that\nc2\n|u̇| ≪\n.\na\n\n(9)\n\nMoreover, it is shown in Appendix A that if the center\nacceleration is as large as |u̇| = c2 /a, then the acceleration of the end of the sphere in the direction opposite\nthe acceleration becomes infinite while the acceleration of\nthe other end of the sphere has an acceleration equal to\none half the center acceleration. The velocity across the\nsphere also varies greatly and nonlinearly from its center value. Thus, unless the inequality in (9) is satisfied\n\ni\nh\ni 3 R̂ h\n2\n2\n(\nR̂\n*\nu̇)\n−\n|\nu̇|\n* (R̂ * u̇)R̂ + u̇ +\n8 c4\n)\n3(R̂ * u̇)u̇\n2ü\n+\n+ 3 + O(a) de′ de (10)\n4c4\n3c\nwith R = r(t)−r′ (t), and u(t) = 0. All the terms with an\nodd number of products of R̂ or r′ integrate to zero and\nthe remaining even product terms integrate to give the\nwell-known expression for the self electromagnetic force\nin the instantaneous rest frame\nFem (t) = −\n\ne2\ne2\nu̇\n+\nü + O(a), u = 0 . (11)\n6πǫ0 ac2\n6πǫ0 c3\n\nBy carefully going through the derivation, however, we\nhave revealed two important restrictions on the validity\nof (11). First, as explained in Section II.A.1, the derivation of (11) requires local analyticity with time of the\nvelocity and thus of the externally applied force. For an\nexternal force that is an analytic function of time in a\nneighborhood of the real time axis, except for when it\nturns on at t = t1 and when it turns off at t = t2 , (11)\nholds for all time t except during the O(a/c) transition\nintervals that occur immediately after t1 and t2 and that\nare given in (7). Second, as explained above in this section, the requirement of relativistic rigidity invalidates\nthe derivation of (11) if the limitation on the magnitude\nof the acceleration in (9) is not satisfied. Consequently,\n(11) must be qualified by the rest-frame conditions\nt∈\n/ [t1 , t1 + ∆ta1 ] ,\n\nt∈\n/ [t2 , t2 + ∆ta1 ]\n\n(12)\n\nand\n|u̇| ≪\n\nc2\n,\na\n\n−∞ < t < +∞.\n\n(13a)\n\nIntegrating the inequality in (13a) over a transition interval ∆ta given in (6b) for a rest frame at the beginning of\nthe transition interval shows that |∆u|(1 − |∆u|/c) ≪ 2c\nor\n|∆u|\n≪1\nc\n\n(13b)\n\nwhere ∆u is the velocity change across the rest-frame\ntransition interval.\nIt can also be shown that for the O(a) terms in (11) to\nbe negligible, the following conditions must be satisfied in\n\n\f5\nthe rest frame for t outside the transition intervals given\nin (12) [8, p. 74]\n|u̇| ≪\n\nc2\na\n\n(14a)\n\n\u0013n\n\u0013\n\u0012\n∞ \u0012\nc X −2a\n1 dn u\ndu c2\n.\n≪\n,\na n=2\nc\nn! dtn\ndt a\n\n(14b)\n\nThe electromagnetic momentum of a charged sphere\nof small radius a moving with speed u ≪ c is given by\nmem u, where the \"electromagnetic mass\" is given by [7,\nsecs. 21-4 and 21-5][26]\nmem =\n\n4\ne2\n.\nmes =\n3\n6πǫ0 ac2\n\n(15)\n\nThus, the u̇ term in (11) is the force in the rest frame\nrequired to change the electromagnetic momentum of the\ncharged sphere. It must be removed from the self electromagnetic force to obtain the radiation reaction force;\nthat is\nFrad (t) =\n\ne2\nü + O(a),\n6πǫ0 c3\n\nu = 0.\n\n(16)\n\nInsertion of the radiation reaction force from (16) into\n(1a) produces the following equation of motion in the\ninstantaneous rest frame\nFext (t) = (mes + mins )u̇ −\n\ne2\nü + O(a), u = 0 (17)\n6πǫ0 c3\n\nunder the restrictions given in (12) and (13).\nIII.\n\nCAUSAL EQUATION OF MOTION\nHOLDING FOR ALL TIME\n\nFor an external force that is an analytic function of\ntime between the time it turns on at t = t1 and turns\noff at t = t2 , the rest-frame equation of motion in (17)\nholds for all −∞ < t < +∞ except in the time intervals\ngiven in (12) just after the external force turns on and\njust after it turns off. During these transition time intervals, we cannot evaluate the self electromagnetic force in\n(3a) because the velocity of the charged sphere is an unknown, possibly rapidly varying function of time during\nthese short time intervals. Also, the electromagnetic self\nforce may contain delta-like functions and their derivatives in these short time intervals because the highly singular 1/R′2 fields in (3b) contribute to the integral in\n(3a) during these intervals.\nAlthough we do not know the form of the equation of\nmotion during these transition intervals, if an equation\nof motion exists for all time, it must equal some function\nduring these time intervals. That is, assuming a consistent classical equation of motion exists for the center\n\nvelocity of the charged sphere at all times, we can express\nit as [8, sec. 8.2.2]\ne2\nü+O(a)\n6πǫ0 c3\n(18)\nwhere fa1 (t) and fa2 (t) are unknown transition self forces\nthat are zero outside their respective intervals given in\n(12) and that may contain delta functions and their\nderivatives as a → 0. The equation of motion in (18)\nholds for all −∞ < t < +∞ under the restrictions in\n(13) imposed by relativistic rigidity on the magnitude of\nthe acceleration and on the velocity changes across the\ntransition intervals.\nIf the conditions in (14) for neglecting the O(a) terms\nare satisfied, the rest-frame equation of motion in (18)\nbecomes\nFext (t)+fa1 (t)+fa2 (t) = (mes +mins )u̇−\n\n[Fext (t) + fa1 (t) + fa2 (t)]/m = u̇ − τe ü\n\n(19)\n\nm = mes + mins\n\n(20)\n\ne2\n.\n6πǫ0 mc3\n\n(21)\n\nwith\n\nand\nτe =\n\nThe rest-frame equation of motion in (19) transforms to\nan arbitrary inertial frame of reference as [8, eq. (8.45a)]\n\u001a \u0014\n\u0015\nFext (t) + fa1 (t) + fa2 (t)\nd\nd\nd(γu)\nγ (γu)\n=\n− τe\nm\ndt\ndt\ndt\n\u0014\n\u0015 \u001b\n2\n4\nγ\nγ\n(22a)\n− 2 |u̇|2 + 2 (u * u̇)2 u\nc\nc\nor in four-vector notation [8, eq. (8.168)]\n\u0012 2 i\n\u0013\nj\ni\ni\ni\nFext\n+fa1\n+fa2\nd u\ndui\ni duj du\n(22b)\n=\n+u\n− τe\nmc2\nds\nds2\nds ds\nprovided the conditions in (14) for neglecting the O(a)\nterms are satisfied outside the transition intervals in (12)\nand the relativistic rigidity condition in (13a) is satisfied for all t, including times within the transition intervals, so that (13b) is satisfied across each transition\ninterval. Herein, the dimensionless four-vector notation\nof Panofsky and Phillips [7] is used, where ui = γ(u/c, 1),\nui = γ(−u/c, 1), and ds = c dt/γ.\nA.\n\nCausal solutions to the equation of motion:\nelimination of the pre-acceleration and\npre-deceleration\n\nAlthough the exact values of the transitional self forces\nfa1 (t) and fa2 (t) are unknown (because of the unknown\n\n\f6\ntime dependence of the velocity across the transition intervals), remarkably, they can be chosen to completely\neliminate the pre-acceleration and pre-deceleration from\nthe solutions to the original equation of motion without\nthese transitional self forces. This result is proven in [8,\nsec. 8.2.2] for the general equation of motion in (22), but\nhere we shall concentrate on rectilinear motion for which\n(22a) simplifies to\n\u001a \u0014\n\u0015\nd\nd\nd(γu)\nFext (t) + fa1 (t) + fa2 (t)\nγ (γu)\n=\n− τe\nm\ndt\ndt\ndt\n\u001b\nγ6 2\n(23)\n− 2 u̇ u .\nc\nThe substitutions dt = γdτ and γu/c = sinh(V/c) convert this nonlinear equation of rectilinear motion to the\nlinear equation of motion\nFext (τ ) + fa1 (τ ) + fa2 (τ )\n= V 8 (τ ) − τe V 88 (τ )\nm\n\n(24)\n\nwhere the backprimes indicate differentiation with respect to the proper time τ and it is assumed that the\nconditions in (14) are satisfied so that the O(a) terms\nare negligible.\nIt is shown in [8, sec. 8.2.3] that the transition self\nforces for the rectilinear equation of motion in (24) can\nbe expressed as\nfan (τ )\n= [∆Vn − τe ∆Vn8 ] δ(τ − τn+ ) − τe ∆Vn δ 8 (τ − τn+ )\nm\nn = 1, 2\n(25)\nwhere ∆Vn and ∆Vn8 are the jumps in V and V 8 across the\ntwo short transition intervals of duration ∆tan for small\na and τn , n = 1, 2, are the proper times at which the\nexternal force turns on and off, respectively. The superscript + on τn+ indicates a time between τn and τn +∆tan ,\nand for a finite (nonzero) value of a, the delta functions\ncan be considered to be finite in height and spread out\nacross the transition intervals. ∆Vn8 is determined solely\nby the externally applied force and is independent of\nfan (τ ). Thus, it is a parameter whose value cannot be\nchanged in (25). However, fan (τ ) alone determines ∆Vn\nand thus we are free to decide the value of ∆Vn in (25).\nChoosing ∆Vn = 0 leaves only the delta function in (25)\nand makes the velocity function continuous. Choosing\n∆Vn = τe ∆Vn8 leaves only the doublet function in (25)\nand produces a jump in velocity approximately equal to\nthe change in velocity produced by the pre-acceleration\nor pre-deceleration in the equation of motion without the\ntransition self forces. (In Section III.B below, it is shown\nthat the jumps in velocity across the transition intervals\ncannot be chosen arbitrarily if energy-momentum is to\nbe conserved and, moreover, that these jumps in velocity\nare determined simply in terms of the jumps in acceleration across the transition intervals if the charged sphere\nmoves to minimize the energy radiated during the transition intervals.)\n\nThe delta-like and doublet-like functions in (25) allow the magnitude and direction of a transition force to\nchange dramatically over its transition interval. Such\ndramatic changes are compatible with contributions from\nthe self-force integral in (10) when the velocity and its\ntime derivatives are changing rapidly during the transition intervals following nonanalytic points in time of the\nexternally applied force.\nThe solution to (24) with the transition forces in (25)\nand with the velocity of the sphere zero before τ1 = 0 is\ngiven outside the transition intervals by [8, eqs. (8.56)\nand (8.72b)]\n1\nV 8 (τ ) =\nmτe\n\n0\n, τ <0\n\n\n R∞\nF1 (τ0 ) exp[−(τ0 − τ )/τe ]dτ0 , ∆ta1 < τ < τ2 (26a)\n*\n\n\nτ\n0\n, τ2 + ∆ta2 < τ\n8\n\nV(τ ) = τe V (τ ) +\n\n2\nX\n\nh(τ − τn )(∆Vn − τe ∆Vn8 )\n\nn=1\n\n1\n+\nm\n\nZτ\n\nFext (τ0 )dτ0 , τ ∈\n/ {[0, ∆ta1 ], [τ2 , τ2 + ∆ta2 ]} (26b)\n\n0\n\nwhere h(τ ) is the unit step function and F1 (τ ) in (26a)\nis the analytic continuation of the external force Fext (τ )\nfrom τ < τ2 to τ ≥ τ2 . The jumps ∆Vn8 in (26b) across\nthe two transition intervals can be found in terms of F1 (τ )\nfrom (26a).\nAlthough the solution in (26a) is free of preacceleration and pre-deceleration, it may be bothersome\nthat for ∆ta1 < τ < τ2 the solution in (26a) to the equation of motion depends on the values of the analytically\ncontinued external force at all future times. This result\nbecomes understandable if it is remembered that (26a)\nis the solution to an equation of motion obtained under\nthe restriction that the analytically continued externally\napplied force function F1 (τ ) be an analytic function of\ntime about the real τ axis for all τ > 0, because the\nvalues of an analytic function on an interval of a singly\nconnected domain of analyticity determine uniquely the\nfunction over the rest of the domain. For example, assume that for τ > 0 the external force F1 (τ0 ) in (26a) can\nbe expanded in a power series about τ to recast (26a) in\nthe form\n∞\n\n1 X\ndk Fn (τ )\nV (τ ) =\n,\n(τe )k\nm\ndτ k\n8\n\n∆ta1 < τ < τ2\n\n(27)\n\nk=0\n\nwhich simply states that the acceleration at any one time\n(∆ta < τ < τ2 ) depends on the time derivatives of the\napplied force as well as the applied force itself at that\ntime. (Note that (27) is not a valid representation for\nV 8 (τ ) in the transition interval 0 < τ < ∆ta1 containing\n\n\f7\nthe transition force in addition to the externally applied\nforce.)\nIf the restriction that the analytically continued external force F1 (τ ) be an analytic function of τ for all τ > 0\nis ignored, and F1 (τ ) is allowed to attain a strong enough\ninfinite singularity at some future point in time, as in the\ncase of the charged sphere being attracted to the center\nof a Coulomb field (1/r2 singularity), the integration in\n(26a) may not converge for all values of τ before the\nsphere reaches the singularity [20].\n1.\n\nCharge in a uniform electric field for finite time\n\nThe rectilinear solution in (26) takes an especially simple form if the charged sphere is accelerated by a uniform\nelectrostatic field E0 for a finite time from t1 = τ1 = 0\nto t = t2 (τ = τ2 ). For example, the charge could be\naccelerated between two infinitesimally thin plates of a\nparallel-plate capacitor charged to produce the electric\nfield E0 . It could be released at time t = 0 from one\nplate of the capacitor and leave through a small hole in\nthe second plate at time t = t2 . Then (26) become\n\n0 , τ <0\neE0 \n8\n1 , ∆ta1 < τ < τ2\nV (τ ) =\n(28a)\nm \n\n0 , τ2 + ∆ta2 < τ\n\nB.\n\n\n0\n,\n\n\nV(τ ) = ∆V1 + eE0 τ /m ,\n\n\n∆V21 + eE0 τ2 /m ,\n\nτ <0\n\n\n0\n,\n\n\nγu = ∆(γu)1 + eE0 t/m ,\n\n\n∆(γu)21 + eE0 t2 /m ,\n\nt<0\n\n∆ta1 < τ < τ2\n\n(28b)\n\nτ2 + ∆ta2 < τ\n\nwith ∆V21 = ∆V2 +∆V1 . These equations recast in terms\nof u(t) as\n\n0 , t<0\neE0 \nd(γu)\n3\n1 , ∆ta1 < t < t2\n= γ u̇ =\n(29a)\ndt\nm \n\n0 , t2 + ∆ta2 < t\n∆ta1 < t < t2\n\n(29b)\n\nwith γ found from γu by the relation\n1/2\n\nConservation of momentum-energy in the\ncausal equation of motion\n\nThe transition forces ensure that the solutions to the\nequation of motion in (22) or (23)–(24) obey causality\nwhile remaining free of runaway motion. However, these\ntransition forces, in general, change the momentum and\nenergy of the charged particle. Consider, for example, the\npower equation of rectilinear motion obtained by multiplying (23) by u\n\u0014 \u0012\n\u0013\n[Fext (t) + fa1 (t) + fa2 (t)]u\ndγ\nd\ndγ\n=\n−\nτ\nγ\ne\nmc2\ndt\ndt\ndt\n\u0015\nγ6 2\n(31)\n− 2 u̇ .\nc\nIntegrating this power equation of motion from the time\nt = t1 = 0 before the external force is first applied and\nthe velocity of the charge is zero to a time t > t1 gives\n\nt2 + ∆ta2 < t\n\n\b\nγ(t) = 1 + [γ(t)u(t)/c]2\n\nexample, the solution to (24) without the transition self\nforces for the charge moving through the uniform electric\nfield of a parallel-plate capacitor is given by\n\n\u0001\n\n1 − e−τ2 /τe eτ /τe , τ ≤ 0\n\n\n\u0001\neE0\n8\nVpre\n(τ ) =\n, 0 ≤ τ ≤ τ2\n1 − e(τ −τ2 )/τe\nm \n\n\n0\n, τ2 ≤ τ\n(30a)\n\n\u0001\n\nτe 1 − e−τ2 /τe eτ /τe , τ ≤ 0\n\n\n\u0001\neE0\nVpre (τ ) =\nτe 1 − e(τ −τ2 )/τe + τ , 0 ≤ τ ≤ τ2\nm \n\n\nτ2\n, τ2 ≤ τ .\n(30b)\nOne sees from this example of the motion of a charge\nthrough a parallel-plate capacitor that the transition\nforces fan (t), which are nonzero only during the short\ntime intervals following the points in time where the externally applied force is discontinuous, remove both the\nnoncausal pre-acceleration and pre-deceleration from the\nsolution to the equation of motion. However, the transition forces fan (t) in the equation of motion change, in\ngeneral, the momentum and energy of the charged sphere\n[21]. The next section determines conditions under which\nthis change in momentum-energy is consistent with the\nconservation of momentum-energy and a non-negative radiated energy during the transition intervals.\n\n(29c)\n\nand ∆(γu)21 = ∆(γu)2 + ∆(γu)1 , where ∆(γu)1 and\n∆(γu)2 are the jumps in γ(t)u(t) across the transition\nintervals at t = t1 = 0 and t = t2 .\nIn contrast to these causal solutions to the equation of\nmotion in (23)–(24) with the transition self forces, the solution to the equation of motion without these transition\nforces exhibit pre-acceleration and pre-deceleration. For\n\n1\nmc2\n\nZt\n\nFext u dt = [γ(t) − 1] − τe γ(t)γ̇(t)\n\n0\n\n1\n+ 2\nmc\n\nZt\n0\n\n1\nmτe γ u̇ dt −\nmc2\n6 2\n\nZt\n\n[fa1 + fa2 ] u dt.\n\n(32)\n\n0\n\nBetween the time t = 0 and the time t = t+\n2 = t2 +\n∆ta2 , a time ∆ta2 after the external force has turned\n\n\f8\noff, there appears to be no reason why the energy from\nthe transition forces cannot contain both reversible and\nirreversible (radiated energy) contributions. After the\ntime t = t+\n2 that the external force is turned off, (32)\nbecomes\n+\n\n1\nmc2\n\nZt2\n\n\u0002\n\u0003\nFext u dt = γ(t+\n2)−1\n\n0\n\n+\n\n1\n+ 2\nmc\n\nZt2\n0\n\n\u0002\n\n\u0003\nmτe γ 6 u̇2 − (fa1 + fa2 ) u dt.\n\n(33)\n\nThe integral on the left-hand side of (33) is the total work\ndone by the external force and the first term (in square\nbrackets) on the right-hand side of (33) is the kinetic energy (divided by mc2 ) of the nonradiating charged sphere\nmoving with constant velocity after the external force\nhas been turned off. By the Einstein mass-energy relationship, this kinetic energy of the nonradiating charged\nsphere moving with constant velocity is its total change\nin energy from its original rest energy. Thus, the integral\non the right-hand side of (33) is the total energy radiated\nby the charged sphere. (Recall that the energy radiated\nby an extended charge whose velocity changes abruptly\nduring the time it takes light to traverse the charge, that\nis, during the transition time intervals, is not given by\njust the integral of mτe γ 6 u̇2 .)\nIf |Fext (t)|∆tan /(mc) ≪ 1 for t ∈ [tan , tan + ∆tan ], n =\n1, 2 (conditions that are always satisfied by finite external\nforces as a → 0), the integral of the external force over the\ntransition intervals is negligible and (33) can be rewritten\nas\n1\nmc2\n\nZt2\n\nt+\n1\n\n\u0002\n\u0003\nFext u dt = γ(t+\n2)−1\n+\n\n1\n+ 2\nmc\n\nZt2\n0\n\n\u0002\n\n\u0003\nmτe γ 6 u̇2 − (fa1 + fa2 ) u dt\n\n(34)\n\nwhere t+\n1 = ∆ta1 . With the integral of Fext u in (34) over\nthe time between the two transition intervals given from\n(31) as\n\n1\nmc2\n\nZt2\n\nt+\n1\n\n\u0002\n\u0003\n+\nFext u dt = −τe γ(t2 )γ̇(t2 ) − γ(t+\n1 )γ̇(t1 )\n\n\u0002\n\u0003\n1\n+ γ(t2 ) − γ(t+\n1) +\nmc2\n\nZt2\n\nt+\n1\n\nmτe γ 6 u̇2 dt\n\n(35)\n\n(34) yields\nZ\n\u0002\n\u0003\n1\nWT I\n=\nmτe γ 6 u̇2 − (fa1 + fa2 ) u dt\n2\n2\nmc\nmc\nTIs\n\u0002\n\u0003\n+\n= −τe γ(t2 )γ̇(t2 ) − γ(t+\n1 )γ̇(t1 )\n\u0003\n\u0002\n+\n− γ(t+\n(36)\n2 ) − γ(t2 ) + γ(t1 ) − 1\n\nwhere the abbreviation \"TIs\" on the integral sign stands\nfor \"transition intervals.\" Since this integral on the lefthand side of (36) is the energy radiated (WT I ) by the\ncharged sphere during the two transition intervals, it\nmust be equal to or greater than zero. Thus, the rectilinear equation of motion in (23) is consistent with energy conservation only if the jumps in velocity across the\ntransition intervals can be chosen to make the right-hand\nside of (36) equal to or greater than zero.\nThe jumps in velocity across the transition intervals\nalso have to be consistent with the relativistic rigidity\ncondition in (13b) for the instantaneous rest frame at the\nbeginning of each transition interval. With this condition\n(|∆u|/c ≪ 1), the right-hand side of (36) simplifies to\nZ\n\u0002\n\u0003\n1\nWT I\n=\nmτe γ 6 u̇2 − (fa1 + fa2 ) u dt\nmc2\nmc2\nTIs\n\u0014\nτe ∆u1 +\nγ(t2 )u(t2 ) τe 3\n=\nu̇(t1 ) −\nγ (t2 )u̇(t2 )\nc c\nc\nc\n\u0015\n\u0002\n\u0003\n∆u(t2 )\n+ O (∆u/c)2\n(37)\n+ γ 2 (t2 )\nc\n\nwhere ∆u(t2 ) denotes the jump in velocity of the center of the charged sphere across the second transition\ninterval as measured in the laboratory inertial reference\nframe, which is the rest frame of the sphere before the\nexternal force is applied, that is, the rest frame of the\nsphere at the beginning of the first transition interval\n(t = t1 = 0). The ∆u1 denotes the jump in velocity\nacross the first transition interval as measured in the rest\nframe of the sphere at the beginning of the first transition\ninterval (the laboratory frame). Relativistic transformations of acceleration and velocity show that γ 3 (t2 )u̇(t2 )\nand γ 2 (t2 )∆u(t2 ) are equal, respectively, to u̇2 and approximately to ∆u2 for |∆u2 |/c ≪ 1, where u̇2 is the\nacceleration of the sphere in the rest frame at the beginning of the second transition interval (moving with\nvelocity u(t2 ) with respect to the laboratory frame), and\n∆u2 is the jump in velocity across the second transition\ninterval as measured in this rest frame at the beginning of\nthe second transition interval. Thus, (37) can be rewritten as\nZ\n\u0002\n\u0003\nWT I\n1\n=\nmτe γ 6 u̇2 − (fa1 + fa2 ) u dt\nmc2\nmc2\nTIs\n\u0014\n\u0015\nτe ∆u1 + γ(t2 )u(t2 ) τe u̇2\n∆u2\n=\nu̇1 −\n+\nc c\nc\nc\nc\n\u0003\n\u0002\n2\n(38)\n+ O (∆u/c)\n\n\f9\n+\nwhere u̇+\n1 = u̇(t1 ).\nIf we assume that, like the change in velocity caused by\nthe pre-acceleration and pre-deceleration in the original\nequation of motion, the change in velocity ∆u across a\ntransition interval will have the same sign as the change\nin acceleration (u̇+ − u̇) across the transition interval,[27]\nthen ∆u1 will have the same sign as u̇+\n1 and ∆u2 will have\nthe opposite sign as u̇2 . Consequently, ∆u1 u̇+\n1 ≥ 0 and\nunder the assumption that\n\nτe |u̇2 |\n≪1\nc\n\n(39)\n\nfor times outside the transition intervals, one can choose\na value of |∆u2 |/c ≪ 1 that is slightly less than or slightly\ngreater than τe |u̇2 |/c to ensure that the energy radiated\nacross the transition intervals is equal to or greater than\nzero regardless of the sign of u(t2 ) or u̇2 . With τe |u̇+\n1 |/c\non the order of |∆u1 |/c ≪ 1, the first\nterm\nafter\nthe\n\u0002\n\u0003\nsecond equal sign in (38) becomes O (∆u/c)2 .\nIf the external force possesses nonanalytic points in\ntime, in addition to when it is first applied and terminated, such that there are a total of N nonanalytic points\nin time, the total energy radiated across all the transition\nintervals is given by\nWT I\n1\n=\nmc2\nmc2\n\n#\nZ \"\nN\nX\nfan dt\nmτe γ 6 u̇2 − u\nn=1\n\nTIs\n\n=\n\n1\nc2\n\nN\nX\n\nn=1\n\n\u0002\n\u0003\nγ(tn )u(tn ) τe (u̇+\nn − u̇n ) − ∆un\n\u0003\n\u0002\n+ O (∆u/c)2\n\n(40)\n\nwith τe |u̇n |/c and τe |u̇+\nn |/c on the order of |∆un |/c ≪\n1, where u̇n and u̇+\nare\nthe accelerations of the center\nn\nof the charged sphere at the beginning and end of the\nnth transition interval as measured in the rest frame of\nthe beginning of the transition interval, and ∆un is the\njump in velocity of the center of the charged sphere as\nmeasured in this same rest frame. The ∆un can be chosen\nto have the same sign as (u̇+\nn − u̇n ) and slightly less than\nor greater than τe (u̇+\nn − u̇n ) (depending on the signs of\n(u̇+\nn − u̇n ) and u(tn )) to keep each term in the second\nsummation of (40) equal to or greater than zero, under\nthe rest-frame conditions\nτe |u̇n |\n≪ 1,\nc\n\nn = 1, 2, * * * N\n\n(41)\n\nor, more generally, because the tn may take on any values\nτe |u̇(t)|\n≪1\nc\n\n(42)\n\nin the instantaneous rest frames.\nSimilarly, it can be shown by integrating (23) that under the inequality in (42), the total momentum (GT I )\n\nradiated across all the transition intervals is given by\n#\nZ \"\nN\nX\n1\nGT I\n=\nmτe γ 6 u̇2 u/c2 −\nfan dt\nmc\nmc\nn=1\nTIs\n\n=\n\nN\nX\n\n\u0003\n\u0002\n1\nγ(tn ) τe (u̇+\nn − u̇n ) − ∆un\nc n=1\n\u0002\n\u0003\n+ O (∆u/c)2 .\n\n(43)\n\nThe ratio of each of the terms of the radiated energy and\nradiated momentum in (40) and (43) is equal to u(tn ),\nthe velocity of the center of the charged sphere at the\nbeginning of each transition interval - a result that is\nphysically reasonable for |∆un |/c ≪ 1.\nInserting mes from (2) into (20) shows that as the\nradius a of the sphere becomes small, m ≈ mes =\ne2 /(8πǫ0 ac2 ) if the mass is not renormalized with an increasingly negative mins , and thus from (21) we have that\nτe ≈ 4a/(3c). Then the inequality in (42) becomes identical to the one in (14a), the inequality needed to ensure\nthat the O(a) terms are negligible in the equation of motion. Consequently, for an extended charged sphere in\nwhich the mass is not renormalized as the charge radius\nis made small, the equation of motion in (23) or more\ngenerally (22) is a causal equation of motion for which\nthe jumps in velocity across the transition intervals can\nbe chosen to satisfy the relativistic rigidity requirements\nin (13) and to conserve momentum-energy with a nonnegative radiated energy during the transition intervals\n- provided the conditions in (14) are satisfied to ensure\nthat the O(a) terms are negligible.\nThe second summations in (40) and (43) reveal that\nthe momentum-energy radiated during the transition intervals is negligible (for |∆un |/c ≪ 1) if the jumps in\nvelocity (∆un ) across the transition intervals are chosen\nsuch that\n\u0001\n∆un = τe u̇+\nn = 1, 2, * * * N\n(44a)\nn − u̇n ,\n\nin the rest frame of the beginning of each transition interval. In the laboratory frame (the rest frame of the\ncharged sphere before the external force is applied), (44a)\nbecomes\n\u0002\n\u0003\n∆u(tn ) = τe γ(tn ) u̇(t+\nn ) − u̇(tn ) , n = 1, 2, * * * N.\n(44b)\nIf one assumes that the charged sphere will move in a\nway to minimize the energy radiated across each transition interval (that is, reduce it to O[(∆un /c)2 ] for\n|∆un |/c ≪ 1), then the changes in velocity across the\ntransition intervals given in (44) are mandatory under\nthe conditions in (13) and (14) for which the equation of\nmotion is derived. (Recall that u̇(tn ) and u̇(t+\nn ) are determined solely by the externally applied force and not\nby the transition forces or the jumps in velocity across\nthe transition intervals.) Despite the elegance of choosing ∆u(tn ) in (44b) to make the momentum-energy radiated across each transition interval negligible, such a\n\n\f10\nchoice is merely based on the conjecture that the charge\nmoves across each transition interval with a change in\nmomentum-energy that becomes reversible as its radius\nshrinks to a small enough value. It doesn't appear to be\na necessary choice.\nIV. EQUATION OF MOTION OF A POINT\nCHARGE WITH RENORMALIZED MASS\n\nWe have shown that the solutions to the equation of\nmotion in (22)–(23) of a charged sphere of radius a and\nrest mass m ≈ mes = e2 /(8πǫ0 ac2 ) are both causal and\nconsistent with conservation of momentum-energy under\nthe conditions on the velocity and its time derivatives\ngiven in (13) and (14) required to derive the equation of\nmotion. Although these inequalities in (13) and (14) are\nsatisfied for all values of the velocity and its derivatives\nas a → 0, the value of the resst mass m = mes + mins\nbecomes infinite because the value of mes becomes infinite\nas a → 0. It thus seems natural to follow the suggestion\nof Dirac [22] and simply renormalize the rest mass of\nthe charged sphere as a → 0 to a value m equal to the\nmeasured mass of the resulting point charge. The result\nof this renormalization of the mass to a finite value as\na → 0 takes the same form as the equation of motion in\n(22), namely, in four-vector notation\n\u0012 2 i\n\u0013\ni\ni\ni\nj\n+fa1\n+fa2\nFext\nd u\ndui\ni duj du\n. (45)\n=\n+u\n− τe\nmc2\nds\nds2\nds ds\nThe O(a) terms are now perfectly zero because a → 0\nand (14) are satisfied for all values of the velocity and\nits derivatives. In addition, the relativistic rigidity conditions in (13) are satisfied. However, because of the\nrenormalization of the mass m, the value of the time\nconstant τe is no longer given by 4a/(3c) as a → 0\nbut by e2 /(6πǫ0 mc3 ) in (21) with the value of m equal\nto the renormalized mass. This means that the restframe condition in (42) required for the conservation of\nmomentum-energy with a non-negative radiated energy\nacross the transition intervals is no longer equivalent to\nthe condition in (14a) but must be written as\ne2\n|u̇| ≪ 1\n6πǫ0 mc4\n\n(46a)\n\nfor times outside the transition intervals or, equivalently\ne2\n|Fext | ≪ 1\n6πǫ0 m2 c4\n\n(46b)\n\nin the instantaneous rest frames, where now m is the\nrenormalized mass.\nThe inequality in (46a) or (46b) is an extra condition\nthat the mass-renormalized charged sphere must obey as\na → 0 in order for the energy in (40) radiated across\nthe transition intervals to be greater than zero for all\npossible values of the velocity at the beginning of each\n\ntransition interval and all possible values of the accelerations just before and just after each transition interval.\nThese inequalities in (46) imply from (40) that the solutions to the renormalized equation of motion in (45) for\na point charge do not, in general, remain both causal and\nconsistent with conservation of momentum-energy if the\nacceleration outside the transition intervals or, equivalently, the applied external force gets too large. In other\nwords, the mass-renormalized causal classical equation of\nmotion of a point charge encounters a high acceleration\ncatastrophe. (One can confirm that such a failure occurs in the solution (28)–(29) to the causal equation of\nmotion of a point charge with renormalized mass m moving through the uniform electric field of a parallel-plate\ncapacitor.)\nThere is some justification, even in classical physics,\nfor renormalizing the mass mes + mins to a finite value\nm as a → 0 and mes = e2 /(8πǫ0 ac2 ) → ∞ to obtain the\nequation of motion of a point charge. It was mentioned\nin Footnote 2 that mins may be negative because it can\ninclude gravitational and other attractive formation energies. Thus, as a → 0 it is conceivable that mins → −∞\nand that lima→∞ (mes + mins ) = m, the measured rest\nmass. It is especially noteworthy, therefore, that for the\npoint-charge renormalized causal equation of motion in\n(45), the restriction in (46a) on the magnitude of the acceleration, or in (46b) on the magnitude of the externally\napplied force, is needed to ensure this equation of motion\nsatisfies conservation of momentum-energy while keeping\nthe value of the energy radiated during the transition intervals equal to or greater than zero.[28]\nFor an electron in an external electric field E, the inequality in (46b) is satisfied unless E 6≪ 6πǫ0 m2 c4 /e3 =\n2.7 × 1020 Volts/meter, an enormously high electric\nfield. Nonetheless, an equation of motion of a massrenormalized point charge that is both causal and conserves momentum-energy while avoiding a negative radiated energy during the transition intervals no matter\nhow large the value of the externally applied force does\nnot result by simply equating the sum of the point-charge\nradiation reaction force and the externally applied force\nto the relativistic Newtonian acceleration force (renormalized mass multiplied by the relativistic acceleration)\nand inserting generalized point-function transition forces\nat the nonanalytic points in time of the external force\nto obtain (45). A fully satisfactory classical equation\nof motion of a point charge does not result from the\ntransition-interval-corrected equation of motion for an\nextended charged particle (an equation that is consistent\nwith causality and conservation of momentum-energy) by\nsimply renormalizing the diverging electrostatic mass to\na finite value as the radius of the charge is allowed to\napproach zero.\nUltimately, a fully satisfactory equation of motion of\na mass-renormalized point charge may require a unified\ntheory of inertial and electromagnetic forces as well as the\nintroduction of quantum effects. Renormalization of the\nmass of the charged sphere as its radius shrinks to zero is\n\n\f11\nan attempt to extract the equation of motion of the point\n\"electron\" from the classical self electromagnetic forces\nof an extended charge distribution. Such attempts, as\nDirac wrote [22], \"bring one up against the problem of\nthe structure of the electron, which has not yet received\nany satisfactory solution.\"\nAPPENDIX A: REQUIREMENTS OF\nRELATIVISTIC (BORN) RIGIDITY\n\nIn accordance with the approach used in [16]–[18], consider the points on the diameter of a relativistically rigid\nsphere of radius a along the x0 axis of any instantaneous\ninertial rest frame K0 whose origin lies at the center of\nthe sphere. Denote the position in any K0 frame of each\nof the points on the diameter (which can be viewed as\na rigid rod) by ξ0 , so that −a ≤ ξ0 ≤ +a with ξ0 independent of time. Assume that the diameter of the sphere\nis moving rectilinearly along the x axis of a laboratory\ninertial frame K. (The x axis of the K frame is collinear\nwith the x0 axis of any of the K0 frames.) Let ξ(t) denote the position of any point at time t on the diameter\nof the sphere in the K frame corresponding to the instantaneous rest-frame point ξ0 . The K frame position\nξ(t) is a function of ξ0 and thus can be rewritten more\nprecisely as\nξ(t) = f(ξ0 , t) .\n\n∂f(ξ0 , t)\n.\n∂t\n\n(A2)\n\nThe differential separation distance dξ(t) between two\npoints in the K frame at the time t in the K frame is\ngiven in terms of the differential separation distance dξ0\nbetween the same two points in the instantaneous rest\nframe by\ndξ(t) = f(ξ0 + dξ0 , t) − f(ξ0 , t) =\n\nAssume that the sphere is at rest in the K frame until\nt = 0 when it begins to move such that the point ξ on\nthe diameter of the sphere has a relativistic acceleration\ngiven by\n\u0014\n\u0015\n\u0014\n\u0015\nd\ndξ\n∂\n∂f(ξ0 , t)\nγ\n=\nγ\n= A(ξ0 ) ≥ 0\n(A8)\ndt\ndt\n∂t\n∂t\nwhere A(ξ0 ) is independent of time t. (Such a uniform\nacceleration in the K frame characterizes an arbitrary\nacceleration of the center of the sphere as the radius a of\nthe sphere approaches zero.)[29]\nThe solution to (A8) compatible with (A7) is\np\nf(ξ0 , t) = −ξs + (ξ0 + ξs )2 + c2 t2 , t ≥ 0 (A9a)\n\nwith\n\nA(ξ0 ) =\n\n∂f(ξ0 , t)\ndξ0 .\n∂ξ0\n\nc2\nξ0 + ξs\n\n(A9b)\n\nwhere ξs is a constant independent of ξ0 and t. The\ninequality given in (A6) applied to (A9a) shows that\nξ0 + ξs ≥ 0 ,\n\n(A1)\n\nThus, the velocity of each point on the diameter of the\nsphere in the K frame is\nu(ξ0 , t) =\n\nInsertion of u(ξ0 , t) from (A2) into (A5) yields the nonlinear differential equation for f(ξ0 , t)\n\u00152\n\u0014\n\u00152\n\u0014\n1 ∂f(ξ0 , t)\n∂f(ξ0 , t)\n= 1.\n(A7)\n+ 2\n∂ξ0\nc\n∂t\n\n−a ≤ ξ0 ≤ +a\n\n(A10)\n\nwhich implies that ξs ≥ a and confirms that the solution\nin (A9a) is for A(ξ0 ) ≥ 0. The velocity of a point ξ(t) in\nthe K frame is given by\nc2 t\n∂f(ξ0 , t)\n=p\n≥ 0, t ≥ 0\n∂t\n(ξ0 + ξs )2 + c2 t2\n(A11)\nwhich confirms that the velocity of every point on the\ndiameter of the sphere is zero at t = 0.\nThe acceleration of the center of the sphere (ξ0 = 0) is\ngiven from (A9b) as\nu(ξ0 , t) =\n\n(A3)\n\nA(0) =\n\nc2\nξs\n\n(A12)\n\nHowever, dξ(t) is also related to dξ0 in the rest frame\nthrough the Lorentz relativistic contraction\nr\nu2 (ξ0 , t)\ndξ0\n(A4)\ndξ(t) = 1 −\nc2\n\nso that the acceleration in (A9b) of any other point on\nthe diameter of the sphere can be written as\n\nso that from (A3)\n\nThe left end of the diameter of the sphere will have acceleration equal to\n\n∂f(ξ0 , t)\n=\n∂ξ0\n\nr\n\n1−\n\nu2 (ξ0 , t)\nc2\n\n(A5)\n\nwhich implies that\n\nA(ξ0 ) =\n\nA(0)\n.\n1 + ξ0 A(0)/c2\n\n(A13)\n\nA(0)\n1 − aA(0)/c2\n\n(A14)\n\nA(0)\n.\n1 + aA(0)/c2\n\n(A15)\n\nA(−a) =\nand the right end\n\n∂f(ξ0 , t)\n≥ 0.\n∂ξ0\n\n(A6)\n\nA(a) =\n\n\f12\nTherefore, only if the acceleration A(0) of the center of\nthe sphere is much smaller than c2 /a can the acceleration of the entire sphere be accurately described by the\nacceleration of its center. For example, if the acceleration\nof the center of the sphere is equal to c2 /a, the acceleration of the left end of the sphere will be infinite and\nthe acceleration of the right end will equal one half the\ncenter value. The velocity in (A11) for t > 0 will also\nvary rapidly over the sphere unless A(0) ≪ c2 /a. For\nsmall values of t, the velocity of the center of the sphere\nis much less than c (γ → 1 as t → 0) and the restriction\non the magnitude of the acceleration also applies to the\nacceleration in the instantaneous rest frame, as given in\n(9), since t = 0 in this Appendix can be chosen as the\ntime t in (8) and (9).\nExpanding (A13) about the center of the sphere (ξ0 =\n0) produces\n\u0014\n\u0015\n\u0003\n\u0002\nξ0 A(0)\n2 2\nA(ξ0 ) = A(0) 1 −\n(A16)\n+ O (ξ0 A(0)/c )\nc2\n\nwhich agrees with [17, eq. (A.3)] and leads to (8a).\n\n[1] H.A. Lorentz, Archives Neerlandaises des Sciences Exactes et Naturelles 25, 363 (1892); English summary in\napp. 7 of J.Z. Buchwald, From Maxwell to Microphysics\n(University of Chicago Press, Chicago, 1985).\n[2] H.A. Lorentz: The Theory of Electrons (Teubner,\nLeipzig, 1909; 2nd ed., 1916).\n[3] J.D. Jackson: Classical Electrodynamics, 3rd ed. (Wiley,\nNew York, 1999).\n[4] J.S. Nodvik, Ann. Phys. 28, 225 (1964).\n[5] A. Arnowitt, S. Deser, and C.W. Misner, Phys. Review\n120, 313 (1960).\n[6] A.D. Yaghjian, Proc. URSI Symp. on Electromagnetic\nTheory, Stockholm, Sweden, 324 (1989).\n[7] W.K.H. Panofsky and M. Phillips: Classical Electricity\nand Magnetism, 2nd ed. (Addison-Wesley, Reading MA,\n1962).\n[8] A.D. Yaghjian, Relativistic Dynamics of a Charged\nSphere: Updating the Lorentz-Abraham Model, 2nd ed.\n(Springer, New York, 2006).\n[9] M. Abraham, Theorie der Elektrizitat, Vol II: Elektromagnetische Theorie der Strahlung (Teubner, Leipzig,\n1905).\n[10] P. Hertz, Physikalische Zeitschrift 4, 848 (1903).\n[11] A. Sommerfeld, Akad. van Wetensch. te Amsterdam 13\n(1904); English translation, 7, 346 (1905).\n[12] G.A. Schott, Annalen der Physik 25, 63 (1908).\n[13] G.A. Schott, Electromagnetic Radiation (Cambridge University Press, Cambridge, 1912) ch. 11 and app. D.\n[14] A. Valentini, Phys. Rev. Lett. 61, 1903 (1988).\n[15] C.J. Goebel, Phys. Rev. Lett. 62, 3010 (1989).\n[16] M. Born, Ann. Physik 30, 1 (1909).\n[17] E.T. Newman and A.I. Janis, Phys. Rev. 116, 1610\n(1959).\n[18] E. Eriksen, M. Mehlen, and J.M. Leinaas, Physica\nScripta 25, 905 (1982).\n[19] J. Schwinger, Foundations of Physics 13, 373 (1983).\n[20] W.E. Baylis and J. Huschilt, Phys. Rev. D 13, 3262\n(1976).\n\n[21] W.E. Baylis and J. Huschilt, Phys. Lett. A 301, 7 (2002).\n[22] P.A.M. Dirac, Proc. Roy. Soc. Lond. A 167, 148 (1938).\n[23] Symbols for velocity or its time derivatives written with\nno explicit functional dependence (for example, u, u̇, ü)\nrefer to the velocity or its time derivatives of the center\nof the spherical particle.\n[24] Conceivably, the mass mins can be negative if it includes\nthe negative formation energies of gravitational or any\nattractive short-range forces holding the charge together\nand in place on the insulator [5], [6].\n[25] There is a factor of f ̈(t) (equal to our u̇(t)) missing in\nthe third term on the right-hand side of (A.3) in [17].\n[26] The 4/3 factor in the electromagnetic mass has been the\nsubject of discussion in many publications since the time\nof Lorentz and Abraham, although Lorentz and Abraham were unconcerned with this factor in their original\nwork because it was done before Einstein's 1905 papers\non relativistic electrodynamics and the mass-energy relation. (They were concerned, however, with the self electromagnetic power expression corresponding to (11) not\nagreeing in the first term with the result of taking the dot\nproduct of u with (11) - a discrepancy that was removed\nby Poincare's determination of the power contributed by\nthe forces that bond the charge to the sphere [8].) From a\nfundamental perspective, the electromagnetic mass need\nnot equal the electrostatic mass because the electromagnetic stress-momentum-energy tensor is not divergenceless in the presence of charge-current and thus the associated electromagnetic momentum-energy will not generally transform as a relativistic four-vector [19].\n[27] One can see that this is the only consistent way to choose\n∆u by noting that the acceleration across any transition\ninterval can be written as the sum of an analytic acceleration formed by analytically continuing the acceleration\nfrom its values before the transition interval (for which\nthere is no change in velocity) and an acceleration that\njumps from a value of zero to (u̇+ − u̇) at the beginning\nof the transition interval (for which there is a change in\n\nACKNOWLEDGMENTS\n\nThis work benefitted from discussions with Professor\nEmeritus F. Rohrlich of Syracuse University, Professor\nT.T. Wu and Dr. J.M. Myers of Harvard University,\nand Professor W.E. Baylis of the University of Windsor,\nCanada, and from the comments and suggestions of an\nanonymous reviewer. The research was supported in part\nthrough Dr. A. Nachman of the U.S. Air Force Office of\nScientific Research (AFOSR).\n\n\f13\nvelocity in the direction of (u̇+ − u̇) across the transition\ninterval); see (26)–(30) and [8, pp. 85–89].\n[28] It may be helpful to restate the reason for this restriction\non the magnitude of the externally applied force as the\nscale factor (τe ), which is set by the fixed physical mass\n(m), remaining a nonzero constant rather than approaching zero along with the transition intervals as a → 0. Still,\nas a → 0, the electrostatic mass approaches an infinite\nvalue and, regardless of the justification, replacing this infinite value by the finite value m that sets the scale factor\nto a nonzero constant is generally referred to as \"renormalization.\" A simple way to understand the difference in\nbehavior between the unrenormalized and renormalized\nsolutions is to first note that the equation of motion in\neither case has the identical form if the O(a) terms are neglected in the unrenormalized case; compare (22b) with\n(45). Then for a given left-hand side, (22b) and (45) are\nidentical except for the fact that τe = 4a/(3c) in (22b),\n\nthe unrenormalized case, and τe = e2 /(6πǫ0 mc3 ) with\nm fixed in (45) for the renormalized case. Thus, in the\nunrenormalized equation of motion, unlike the renormalized equation of motion, the contribution of the radiation\nreaction term (the term multiplied by τe ) in the equation\nof motion approaches zero as the radius a of the charge\napproaches zero.\n[29] Although relativistic rigidity requires, in general, that\nA be a function of (ξ0 , t), the function A(ξ0 , t) can\nbe expanded in a Taylor series about t = 0 to give\nA(ξ0 , t) = A(ξ0 , 0) + O(t). Carrying through the derivation with O(t) included adds O(t3 ) to the function f(ξ0 , t)\ngiven in (A9a) with A(ξ0 , 0) replacing A(ξ0 ) and A(0, 0)\nreplacing A(0) in (A9b)–(A16). Thus, as t → 0, the results in (A13)–(A16) hold in the instantaneous rest frame\nwith A(ξ0 , t → 0) replacing A(ξ0 ), again leading to (8)\nand (9).\n\n\f"}