{"id": "http://arxiv.org/abs/0710.4030v1", "guidislink": true, "updated": "2007-10-22T12:01:37Z", "updated_parsed": [2007, 10, 22, 12, 1, 37, 0, 295, 0], "published": "2007-10-22T12:01:37Z", "published_parsed": [2007, 10, 22, 12, 1, 37, 0, 295, 0], "title": "From DNA sequence analysis to modeling replication in the human genome", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.2221%2C0710.1060%2C0710.1777%2C0710.3282%2C0710.5904%2C0710.3662%2C0710.4945%2C0710.5660%2C0710.3530%2C0710.3664%2C0710.5505%2C0710.3700%2C0710.1498%2C0710.1554%2C0710.0023%2C0710.1949%2C0710.1632%2C0710.5107%2C0710.3648%2C0710.1635%2C0710.3148%2C0710.2585%2C0710.4521%2C0710.4064%2C0710.1577%2C0710.5362%2C0710.4899%2C0710.3100%2C0710.2005%2C0710.3352%2C0710.3876%2C0710.2755%2C0710.4116%2C0710.5874%2C0710.1113%2C0710.4030%2C0710.1420%2C0710.3369%2C0710.4421%2C0710.0068%2C0710.5677%2C0710.1439%2C0710.1683%2C0710.0541%2C0710.0232%2C0710.1012%2C0710.5792%2C0710.4081%2C0710.5199%2C0710.0255%2C0710.5377%2C0710.2766%2C0710.0042%2C0710.2680%2C0710.2861%2C0710.3796%2C0710.1245%2C0710.0441%2C0710.1396%2C0710.4507%2C0710.5577%2C0710.3056%2C0710.4898%2C0710.0965%2C0710.3804%2C0710.4729%2C0710.0234%2C0710.5557%2C0710.5161%2C0710.2556%2C0710.3175%2C0710.1724%2C0710.0351%2C0710.3093%2C0710.5248%2C0710.1214%2C0710.1279%2C0710.0085%2C0710.3997%2C0710.5726%2C0710.3933%2C0710.3518%2C0710.0693%2C0710.3485%2C0710.3004%2C0710.1927%2C0710.5269%2C0710.1866%2C0710.5924%2C0710.5707%2C0710.3794%2C0710.5344%2C0710.0007%2C0710.5315%2C0710.4865%2C0710.0127%2C0710.1014%2C0710.2334%2C0710.1001%2C0710.2576%2C0710.0391&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "From DNA sequence analysis to modeling replication in the human genome"}, "summary": "We explore the large-scale behavior of nucleotide compositional strand\nasymmetries along human chromosomes. As we observe for 7 of 9 origins of\nreplication experimentally identified so far, the (TA+GC) skew displays rather\nsharp upward jumps, with a linear decreasing profile in between two successive\njumps. We present a model of replication with well positioned replication\norigins and random terminations that accounts for the observed characteristic\nserrated skew profiles. We succeed in identifying 287 pairs of putative\nadjacent replication origins with an origin spacing approximately 1-2 Mbp that\nare likely to correspond to replication foci observed in interphase nuclei and\nrecognized as stable structures that persist throughout subsequent cell\ngenerations.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0710.2221%2C0710.1060%2C0710.1777%2C0710.3282%2C0710.5904%2C0710.3662%2C0710.4945%2C0710.5660%2C0710.3530%2C0710.3664%2C0710.5505%2C0710.3700%2C0710.1498%2C0710.1554%2C0710.0023%2C0710.1949%2C0710.1632%2C0710.5107%2C0710.3648%2C0710.1635%2C0710.3148%2C0710.2585%2C0710.4521%2C0710.4064%2C0710.1577%2C0710.5362%2C0710.4899%2C0710.3100%2C0710.2005%2C0710.3352%2C0710.3876%2C0710.2755%2C0710.4116%2C0710.5874%2C0710.1113%2C0710.4030%2C0710.1420%2C0710.3369%2C0710.4421%2C0710.0068%2C0710.5677%2C0710.1439%2C0710.1683%2C0710.0541%2C0710.0232%2C0710.1012%2C0710.5792%2C0710.4081%2C0710.5199%2C0710.0255%2C0710.5377%2C0710.2766%2C0710.0042%2C0710.2680%2C0710.2861%2C0710.3796%2C0710.1245%2C0710.0441%2C0710.1396%2C0710.4507%2C0710.5577%2C0710.3056%2C0710.4898%2C0710.0965%2C0710.3804%2C0710.4729%2C0710.0234%2C0710.5557%2C0710.5161%2C0710.2556%2C0710.3175%2C0710.1724%2C0710.0351%2C0710.3093%2C0710.5248%2C0710.1214%2C0710.1279%2C0710.0085%2C0710.3997%2C0710.5726%2C0710.3933%2C0710.3518%2C0710.0693%2C0710.3485%2C0710.3004%2C0710.1927%2C0710.5269%2C0710.1866%2C0710.5924%2C0710.5707%2C0710.3794%2C0710.5344%2C0710.0007%2C0710.5315%2C0710.4865%2C0710.0127%2C0710.1014%2C0710.2334%2C0710.1001%2C0710.2576%2C0710.0391&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We explore the large-scale behavior of nucleotide compositional strand\nasymmetries along human chromosomes. As we observe for 7 of 9 origins of\nreplication experimentally identified so far, the (TA+GC) skew displays rather\nsharp upward jumps, with a linear decreasing profile in between two successive\njumps. We present a model of replication with well positioned replication\norigins and random terminations that accounts for the observed characteristic\nserrated skew profiles. We succeed in identifying 287 pairs of putative\nadjacent replication origins with an origin spacing approximately 1-2 Mbp that\nare likely to correspond to replication foci observed in interphase nuclei and\nrecognized as stable structures that persist throughout subsequent cell\ngenerations."}, "authors": ["Edward-Benedict Brodie", "Samuel Nicolay", "Marie Touchon", "Benjamin Audit", "Yves D'Aubenton-Carafa", "Claude Thermes", "Alain Arneodo"], "author_detail": {"name": "Alain Arneodo"}, "author": "Alain Arneodo", "links": [{"href": "http://arxiv.org/abs/0710.4030v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0710.4030v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "q-bio.GN", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "q-bio.GN", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0710.4030v1", "affiliation": "Phys-ENS", "arxiv_url": "http://arxiv.org/abs/0710.4030v1", "arxiv_comment": null, "journal_reference": "Physical Review Letters 94, 24 (2005) 248103", "doi": null, "fulltext": "From DNA sequence analysis to modelling replication in the human genome\nE.B. Brodie of Brodie1 , S. Nicolay1 , M. Touchon2 , B. Audit1 , Y. d'Aubenton-Carafa2 , C. Thermes2 , and A. Arneodo1\n\narXiv:0710.4030v1 [q-bio.GN] 22 Oct 2007\n\n1\n\nLaboratoire Joliot Curie, Ecole Normale Supérieure de Lyon, 46 Allée d'Italie, 69364 Lyon Cedex 07, France\n2\nCentre de Génétique Moléculaire (CNRS), Allée de la Terrasse, 91198 Gif-sur-Yvette, France\n(Dated: November 10, 2018)\nWe explore the large-scale behavior of nucleotide compositional strand asymmetries along human\nchromosomes. As we observe for 7 of 9 origins of replication experimentally identified so far, the\n(T A + GC) skew displays rather sharp upward jumps, with a linear decreasing profile in between\ntwo successive jumps. We present a model of replication with well positioned replication origins\nand random terminations that accounts for the observed characteristic serrated skew profiles. We\nsucceed in identifying 287 pairs of putative adjacent replication origins with an origin spacing ∼ 1–\n2M bp, that are likely to correspond to replication foci observed in interphase nuclei and recognized\nas stable structures that persist throughout subsequent cell generations.\nPACS numbers: 87.15.Cc, 87.16.Sr, 87.15.Aa\n\nDNA replication is an essential genomic function responsible for the accurate transmission of genetic information through successive cell generations. According\nto the \"replicon\" paradigm derived from prokaryotes [1],\nthis process starts with the binding of some \"initiator\"\nprotein to a specific \"replicator\" DNA sequence called\norigin of replication (ori). The recruitement of additional factors initiates the bidirectional progression of two\ndivergent replication forks along the chromosome. One\nstrand is replicated continuously from the origin (leading strand), while the other strand is replicated in discrete steps towards the origin (lagging strand). In eukaryotic cells, this event is initiated at a number of ori\nand propagates until two converging forks collide at a\nterminus of replication (ter ) [2]. The initiation of different ori is coupled to the cell cycle but there is a definite\nflexibility in the usage of the ori at different developmental stages [3, 4]. Also, it can be strongly influenced\nby the distance and timing of activation of neighbouring ori, by the transcriptional activity and by the local\nchromatin structure [3]. Actually, sequence requirements\nfor an ori vary significantly between different eukaryotic\norganisms. In the unicellular eukaryote Saccharomyces\ncerevisiae, the ori spread over 100–150 bp and present\nsome highly conserved motifs [2]. In the fission yeast\nSchizosaccharomyces pombe, there is no clear consensus\nsequence and the ori spread over at least 800 to 1000\nbp [2]. In multi–cellular organisms, the ori are rather\npoorly defined and initiation may occur at multiple sites\ndistributed over thousands of base pairs [5]. Actually, cell\ndiversification may have led higher eukaryotes to develop\nvarious epigenetic controls over the ori selection rather\nthan to conserve specific replicator sequences [6]. This\nmight explain that only very few ori have been identified\nso far in multi–cellular eukaryotes, namely around 20 in\nmetazoa and only about 10 in human [7]. The aim of the\npresent work is to show that with an appropriate coding\nand an adequate methodology, one can challenge the issue of detecting putative ori directly from the genomic\nsequences.\nAccording to the second parity rule [8], under no–\n\nstrand bias conditions, each genomic DNA strand should\npresent equimolarities of A and T and of G and C. Deviations from intrastrand equimolarities have been extensively studied in prokaryotic, organelle and viral genomes\nfor which they have been used to detect the ori [9]. Indeed the GC and TA skews abruptly switch sign at the\nori and ter displaying step like profiles, such that the\nleading strand is generally richer in G than in C, and to\na lesser extent in T than in A. During replication, mutational events can affect the leading and lagging strands\ndifferently, and an asymmetry can result if one strand incorporates more mutations of a particular type or if one\nstrand is more efficiently repaired [9]. In eukaryotes, the\nexistence of compositional biases has been debated and\nmost attempts to detect the ori from strand compositional asymmetry have been inconclusive. In primates,\na comparative study of the β–globin ori has failed to\nreveal the existence of a replication–coupled mutational\nbias [10]. Other studies have led to rather opposite results. The analysis of the yeast genome presents clear\nreplication–coupled strand asymmetries in subtelomeric\nchromosomal regions [11]. A recent space–scale analysis\n[12] of the GC and TA skews in M bp long human contigs\nhas revealed the existence of compositional strand asymmetries in intergenic regions, suggesting the existence of a\nreplication bias. Here, we show that the (T A+ GC) skew\nprofiles of the 22 human autosomal chromosomes, display\na remarkable serrated \"factory roof\" like behavior that\ndiffers from the crenelated \"castle rampart\" like profiles\nresulting from the prokaryotic replicon model [9]. This\nobservation will lead us to propose an alternative model\nof replication in higher eukaryotes.\nSequences and gene annotation data were downloaded\nfrom the UCSC Genome Bioinformatics site and correspond to the assembly of July 2003 of the human genome.\nTo exclude repetitive elements that might have been\ninserted recently and would not reflect long–term evolutionary patterns, we used the repeat-masked version\nof the genome leading to a homogeneous reduction of\n∼ 40 − 50% of sequence length. All analyses were carried\nout using \"knowngene\" gene annotations. The TA and\n\n\f2\n\nFIG. 1: S = ST A + SGC vs the position n in the repeat–\nmasked sequences, in regions surrounding 3 known human\nori (vertical bars): (a) MCM4 (native position 48.9 M bp in\nchr. 8 [7(b)]); (b) c–myc (nat. pos. 128.7 M bp in chr. 8\n[7(a)]); (c) TOP1 (nat. pos. 40.3 M bp in chr. 20 [7(c)]).\nThe values of ST A and SGC were calculated in adjacent\n1 kbp windows. The dark (light) grey dots refer to \"sense\"\n(\"antisense\") genes with coding strand identical (opposed)\nto the sequence; black dots correspond to intergenes.\n\nGC skews were calculated as ST A = (T − A)/(T + A) and\nSGC = (G − C)/(G + C). Here, we will mainly consider\nS = ST A +SGC , since by adding the two skews, the sharp\ntransitions of interest are significantly amplified.\nIn Fig. 1 are shown the skew S profiles of 3 fragments of chromosomes 8 and 20 that contain 3 experimentally identified ori. As commonly observed for eubacterial genomes [9], these 3 ori correspond to rather sharp\n(over several kbp) transitions from negative to positive\nS values that clearly emerge from the noisy background.\nThe leading strand is relatively enriched in T over A and\nin G over C. The investigation of 6 other known human\nori [7] confirms the above observation for at least 4 of\nthem (the 2 exceptions, namely the Lamin B2 and β–\nglobin ori, might well be inactive in germline cells or\nless frequently used than the adjacent ori). According\nto the gene environment, the amplitude of the jump can\nbe more or less important and its position more or less\nlocalized (from a few kbp to a few tens kbp). Indeed, it\nis known that transcription generates positive TA and\nGC skews on the coding strand [13, 14], which explains\nthat larger jumps are observed when the sense genes are\non the leading strand and/or the antisense genes on the\nlagging strand, so that replication and transcription biases add to each other. On the contrary to the replicon\ncharacteristic step like profile observed for eubacteria [9],\nS is definitely not constant on each side of the ori location making quite elusive the detection of the ter since\nno corresponding downward jumps of similar amplitude\ncan be found in Fig. 1.\nIn Fig. 2 are shown the S profiles of long fragments of\nchromosomes 9, 14 and 21, that are typical of a fair proportion of the S profiles observed for each chromosome.\nSharp upward jumps of amplitude (∆S ∼ 0.2) similar to\nthe ones observed for the known ori in Fig. 1, seem to\nexist also at many other locations along the human chro-\n\nFIG. 2: S = ST A +SGC skew profiles in 9 M bp repeat-masked\nfragments in the human chromosomes 9 (a), 14 (b) and 21\n(c). Qualitatively similar but less spectacular serrated S\nprofiles are obtained with the native human sequences.\n\nmosomes. But the most striking feature is the fact that\nin between two neighboring major upward jumps, not\nonly the noisy S profile does not present any comparable\ndownward sharp transition, but it displays a remarkable\ndecreasing linear behavior. At chromosome scale, one\nthus gets jagged S profiles that have the aspects of \"factory roofs\" rather than \"castle rampart\" step like profiles as expected for the prokaryotic replicon model [9].\nThe S profiles in Fig. 2 look somehow disordered because\nof the extreme variability in the distance between two\nsuccessive upward jumps, from spacings ∼ 50–100 kbp\n(∼ 100–200 kbp for the native sequences) up to 2–3 M bp\n(∼ 4–5 M bp for the native sequences) in agreement with\nrecent experimental studies that have shown that mammalian replicons are heterogeneous in size with an average size ∼ 500 kbp, the largest ones being as large\nas a few M bp [15]. We report in Fig. 3 the results of\na systematic detection of upward and downward jumps\nusing the wavelet–transform (WT) based methodology\ndescribed in Ref. [12(b)]. The selection criterium was\nto retain only the jumps corresponding to discontinuities in the S profile that can still be detected with the\nWT microscope up to the scale 200 kbp which is smaller\nthan the typical replicon size and larger than the typical gene size. In this way, we reduce the contribution\nof jumps associated with transcription only and maintain a good sensitivity to replication induced jumps. A\nset of 5100 jumps was detected (with as generally expected an almost equal proportion of upward and downward jumps). In Fig. 3(a) are reported the histograms of\nthe amplitude |∆S| of the so–identified upward (∆S > 0)\nand downward (∆S < 0) jumps respectively, for the\nrepeat–masked sequences. These histograms do not superimpose, the former being significantly shifted to larger\n|∆S| values. When plotting N (|∆S| > ∆S ∗ ) vs ∆S ∗ in\nFig. 3(b), one can see that the number of large amplitude\nupward jumps overexceeds the number of large amplitude\ndownward jumps. These results confirm that most of the\nsharp upward transitions in the S profiles in Figs 1 and\n2, have no sharp downward transition counterpart. This\n\n\f3\n\nFIG. 3: Statistical analysis of the sharp jumps detected in\nthe S profiles of the 22 human autosomal chromosomes by\nthe WT microscope at scale a = 200 kbp for repeat–masked\nsequences [12(b)]. |∆S| = |S(3′ ) − S(5′ )|, where the averages\nwere computed over the two adjacent 20 kbp windows\nrespectively in the 3' and 5' direction from the detected\njump location. (a) Histograms N (|∆S|) of |∆S| values. (b)\nN (|∆S| > ∆S ∗ ) vs ∆S ∗ . In (a) and (b), the solid (resp.\nthin) line corresponds to downward ∆S < 0 (resp. upward\n∆S > 0) jumps.\n\ndemonstrates that these jagged S profiles are likely to be\nrepresentative of a general asymmetry in the skew profile\nbehavior along the human chromosomes.\nAs reported in a previous work [14], the analysis of a\ncomplete set of human genes revealed that most of them\npresent TA and GC skews and that these biases are correlated to each other and are specific to gene sequences.\nOne can thus wonder to which extent the transcription\nmachinery can account for the jagged S profiles shown\nin Figs 1 and 2. According to the estimates obtained\nin Ref. [14], the mean jump amplitudes observed at the\ntransition between transcribed and non–transcribed regions are |∆ST A | ∼ 0.05 and |∆SGC | ∼ 0.03 respectively.\nThe characteristic amplitude of a transcription induced\ntransition |∆S| ∼ 0.08 is thus significantly smaller than\nthe amplitude ∆S ∼ 0.20 of the main upward jumps\nin Fig. 2. Hence, it is possible that, at the transition\nbetween an antisense gene and a sense gene, the overall jump from negative to positive S values may reach\nsizes ∆S ∼ 0.16 that can be comparable to the ones\nof the upward jumps in Fig. 2. However, if some co–\norientation of the transcription and replication processes\nmay account for some of the sharp upward transitions\nin the skew profiles, the systematic observation of \"factory roof\" skew scenery in intergenic regions as well as in\ntranscribed regions, strongly suggests that this peculiar\nstrand bias is likely to originate from the replication machinery. To further examine if intergenic regions present\ntypical \"factory roof\" skew profiles, we report in Fig. 4\nthe results of the statistical analysis of 287 pairs of putative adjacent ori that actually correspond to 486 putative ori almost equally distributed among the 22 autosomal chromosomes. These putative ori were identified\nby (i) selecting pairs of successive jumps of amplitude\n∆S ≥ 0.12, and (ii) checking that none of these upward\njumps could be explained by an antisense gene - sense\ngene transition. In Fig. 4(a) is shown the S profile obtained after rescaling the putative ori spacing l to 1 prior\n\nFIG. 4: Statistical analysis of the skew profiles of the 287\npairs of ori selected as explained in the text. The ori spacing\nl was rescaled to 1 prior to computing the mean S values in\nwindows of width 1/10, excluding from the analysis the first\nand last half intervals. (a) Mean S profile (•) over windows\nthat are more than 90% intergenic. (b) Mean S profile (•)\nover windows that are more than 90% genic; the symbols (N)\n(resp. (\u0003)) correspond to the percentage of sense (antisense)\ngenes located at that position among the 287 putative ori\npairs. (c) Histogram of the slope s of the skew profiles\nafter rescaling l to 1. (d) Histogram of the mean absolute\ndeviation of the S profiles from a linear profile.\n\nto computing the average S values in windows of width\n1/10 that contain more than 90% of intergenic sequences.\nThis average profile is linear and crosses zero at the median position n/l = 1/2, with an overall upward jump\n∆S ≃ 0.17. The corresponding average S profile over\nwindows that are now more than 90% genic is shown in\nFig. 4(b). A similar linear profile is obtained but with\na jump of larger mean amplitude ∆S ≃ 0.28. This is a\ndirect consequence of the gene content of the selected regions. As shown in Fig. 4(b), sense (antisense) genes are\npreferentially on the left (right) side of the 287 selected\nsequences, which implies that the replication and – when\npresent – transcription biases tend to add up. In Fig. 4(c)\nis shown the histogram of the linear slope values of the\n287 selected skew profiles after rescaling their length to\n1. The histogram of mean absolute deviation from a linear decreasing profile reported in Fig. 4(d), confirms the\nlinearity of each selected skew profiles.\nFollowing these observations, we propose in Fig. 5 a\nrather crude model for replication that relies on the hypothesis that the ori are quite well positioned while the\nter are randomly distributed. In other words, replication\nwould proceed in a bi–directional manner from well defined initiation positions, whereas the termination would\noccur at different positions from cell cycle to cell cycle\n[16]. Then if one assumes that (i) the ori are identi-\n\n\f4\n\nFIG. 5: A model for replication in the human genome.\n(a) Theoretical skew profiles obtained when assuming that\ntwo equally active adjacent ori are located at n/l = 0 and\n1, where l is the ori spacing; the 3 profiles in thin, thick\nand normal lines, correspond to different ter positions. (b)\nTheoretical mean S profile obtained by summing step–like\nprofiles as in (a), under the assumption of a uniform random\npositioning of the ter in between the two ori.\n\ncally active and (ii) any location in between two adjacent ori has an equal probability of being a ter, the continuous superposition of step–like profiles like those in\nFig. 5(a) leads to the anti–symmetric skew pattern shown\nin Fig. 5(b), i.e. a linear decreasing S profile that crosses\nzero at middle distance from the two ori. This model is\nin good agreement with the overall properties of the skew\nprofiles observed in the human genome and sustains the\nhypothesis that each detected upward jump corresponds\nto an ori.\nTo summarize, we have proposed a simple model for\nreplication in the human genome whose key features are\n(i) well positioned ori and (ii) a stochastic positioning of\nthe ter. This model predicts jagged skew profiles as observed around most of the experimentally identified ori\nas well as along the 22 human autosomal chromosomes.\n\n[1] F. Jacob, S. Brenner and F.Cuzin, Cold Spring Harb.\nSymp. Quant. Biol. 28, 329 (1964).\n[2] S.P. Bell and A. Dutta, Annu. Rev. Biochem. 71, 333\n(2002).\n[3] S.A. Gerbi and A.K. Bielinsky, Curr. Opin. Genet. Dev.\n12, 243 (2002); D. Schubeler et al., Nat. Genet. 32, 438\n(2002); D. Fisher and M. Mechali, EMBO J. 22, 3737\n(2003); M. Anglana et al., Cell 114, 385 (2003).\n[4] O. Hyrien and M. Mechali, EMBO J. 12, 4511 (1993).\n[5] D.M. Gilbert, Science 294, 96 (2001).\n[6] J.A. Bogan, D.A. Natale and M.L. Depamphilis, J. Cell.\nPhysiol. 184, 139 (2000); M. Méchali, Nat. Rev. Genet.\n2, 640 (2001); C. Demeret, Y. Vassetzky and M. Méchali,\nOncogene 20, 3086 (2001); A.J. McNairn and D.M.\nGilbert, Bioessays 25, 647 (2003); D.M. Gilbert, Nat.\nRev. Cell. Biol. 5, 1 (2004).\n[7] (a) V. Todorovic, A. Falaschi and M. Giacca, Front\nBiosci. 4, D859 (1999); (b) E.M. Ladenburger, C. Keller\nand R. Knippers, Mol. Cell. Biol. 22, 1036 (2002); (c)\nC. Keller et al., J. Biol. Chem. 277, 31430 (2002); (d)\nS.M. Cohen et al., J. Cell. Biochem. 85, 346 (2002); (e)\nL. Hu, X. Xu and M.S. Valenzuela, Biochem. Biophys.\n\nUsing this model as a guide, we have selected 287 domains delimited by pairs of successive upward jumps in\nthe S profile and covering 24% of the genome. The 486\ncorresponding jumps are likely to mark 486 ori active in\nthe germ line cells. As regards to the rather large size of\nthe selected sequences (∼ 2 M bp on the native sequence),\nthese putative ori are likely to correspond to the large\nreplicons that require most of the S–phase to be replicated [15]. Another possibility is that these ori might\ncorrespond to the so–called replication foci observed in\ninterphase nuclei [15]. These stable structures persist\nthroughout the cell cycle and subsequent cell generations,\nand likely represent a fundamental unit of chromatin organization. Although the prediction of 486 ori seems a\nsignificant achievement as regards to the very small number of experimentally identified ori, one can reasonably\nhope to do much better relatively to the large number\n(probably several tens of thousands) of ori. Actually\nwhat makes the analysis quite difficult is the extreme\nvariability of the ori spacing from 100 kbp to several M bp,\ntogether with the necessity of disentangling the part of\nthe strand asymmetry coming from replication from that\ninduced by transcription, a task which is rather delicate\nin regions with high gene density. To overcome these\ndifficulties, we plan to use the WT with the theoretical\nskew profile in Fig. 5(b) as an adapted analyzing wavelet.\nThe identification of a few thousand putative ori in the\nhuman genome would be a very promising methodological step towards the study of replication in mammalian\ngenomes.\nThis work was supported by the Action Concertée Incitative IMPbio 2004, the Centre National de la Recherche\nScientifique, the French Ministère de la Recherche and\nthe Région Rhône-Alpes.\n\nRes. Commun. 313, 1058 (2004).\n[8] J.W. Fickett, D.C. Torney and D.R. Wolf, Genomics 13,\n1056 (1992); J.R. Lobry, J. Mol. Evol. 40, 326 (1995).\n[9] J. Mrazek and S. Karlin, Proc. Natl. Acad. Sci. USA\n95, 3720 (1998); A.C. Frank and J.R. Lobry, Gene 238,\n65 (1999); E.P. Rocha, A. Danchin and A. Viari, Mol.\nMicrobiol. 32, 11 (1999); E.R. Tillier and R.A. Collins,\nJ. Mol. Evol. 50, 249 (2000).\n[10] M.P. Francino and H. Ochman, Mol. Biol. Evol. 17, 416\n(2000).\n[11] A. Gierlik et al., J. Theor. Biol. 202, 305 (2000).\n[12] (a) S. Nicolay et al., Phys. Rev. Lett. 93, 108101 (2004);\n(b) S. Nicolay et al., Physica A. 342, 270 (2004).\n[13] E. Louis, J. Ott and J. Majewski, Genome Res. 13, 2594\n(2003).\n[14] M. Touchon et al., FEBS Lett. 555, 579 (2003); M. Touchon et al., Nucleic Acids Res. 32, 4969 (2004).\n[15] R. Berezney, D.D. Dubey and J.A. Huberman, Chromosoma 108, 471 (2000).\n[16] D. Santamaria et al., Nucleic Acids Res. 28, 2099 (2000).\n\n\f"}