{"id": "http://arxiv.org/abs/1004.3846v1", "guidislink": true, "updated": "2010-04-22T06:31:49Z", "updated_parsed": [2010, 4, 22, 6, 31, 49, 3, 112, 0], "published": "2010-04-22T06:31:49Z", "published_parsed": [2010, 4, 22, 6, 31, 49, 3, 112, 0], "title": "Superconducting order parameter in nonmagnetic borocarbides\n  RNi$_{2}$B$_{2}$C (R=Y, Lu) probed by point-contact Andreev reflection\n  spectroscopy", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.5242%2C1004.5454%2C1004.1273%2C1004.2669%2C1004.3990%2C1004.1126%2C1004.3562%2C1004.4981%2C1004.1794%2C1004.1987%2C1004.0442%2C1004.1665%2C1004.1674%2C1004.4478%2C1004.0203%2C1004.0380%2C1004.4619%2C1004.0344%2C1004.1742%2C1004.1181%2C1004.0464%2C1004.5103%2C1004.0365%2C1004.1353%2C1004.4079%2C1004.2606%2C1004.4771%2C1004.5205%2C1004.1396%2C1004.2437%2C1004.3889%2C1004.5062%2C1004.5511%2C1004.4357%2C1004.4808%2C1004.2550%2C1004.0144%2C1004.5547%2C1004.0296%2C1004.5247%2C1004.1473%2C1004.1421%2C1004.0460%2C1004.3109%2C1004.0837%2C1004.3639%2C1004.0359%2C1004.5340%2C1004.3448%2C1004.5260%2C1004.4978%2C1004.4927%2C1004.3557%2C1004.1048%2C1004.2175%2C1004.2700%2C1004.3035%2C1004.4631%2C1004.5367%2C1004.4433%2C1004.2677%2C1004.3533%2C1004.3846%2C1004.2902%2C1004.2452%2C1004.4630%2C1004.0295%2C1004.1787%2C1004.2025%2C1004.2841%2C1004.3222%2C1004.4550%2C1004.0922%2C1004.1386%2C1004.5168%2C1004.5078%2C1004.5298%2C1004.5361%2C1004.0373%2C1004.3239%2C1004.2082%2C1004.3866%2C1004.0524%2C1004.0494%2C1004.2901%2C1004.3471%2C1004.3595%2C1004.4977%2C1004.0943%2C1004.2898%2C1004.3576%2C1004.4911%2C1004.1590%2C1004.0470%2C1004.1572%2C1004.0939%2C1004.0364%2C1004.1124%2C1004.2361%2C1004.5332%2C1004.1077&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Superconducting order parameter in nonmagnetic borocarbides\n  RNi$_{2}$B$_{2}$C (R=Y, Lu) probed by point-contact Andreev reflection\n  spectroscopy"}, "summary": "We report on the measurements of the superconducting order parameter in the\nnonmagnetic borocarbides LuNi$_2$B$_2$C and YNi$_2$B$_2$C. Andreev conductance\nspectra are obtained from nanoscale metallic junctions on single crystal\nsurfaces prepared along three major crystallographic orientations: [001],\n[110], and [100]. The gap values extracted by the single-gap\nBlonder-Tinkham-Klapwijk model follow the BCS predictions as a function of\ntemperature and magnetic field and exhibit a small anisotropy. These\nobservations are robust and reproducible among all the measurements on two\ndifferent sets of LuNi$_2$B$_2$C crystals and one set of YNi$_2$B$_2$C\ncrystals. We suggest possible explanations for the small gap anisotropy based\non the recent detailed gap measurements by angle-resolved photoemission\nspectroscopy and the tunneling cone effect. Our results provide a consistent\npicture of the superconducting gap structure in these materials, addressing the\ncontroversy particularly in the reported results of point-contact Andreev\nreflection spectroscopy.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1004.5242%2C1004.5454%2C1004.1273%2C1004.2669%2C1004.3990%2C1004.1126%2C1004.3562%2C1004.4981%2C1004.1794%2C1004.1987%2C1004.0442%2C1004.1665%2C1004.1674%2C1004.4478%2C1004.0203%2C1004.0380%2C1004.4619%2C1004.0344%2C1004.1742%2C1004.1181%2C1004.0464%2C1004.5103%2C1004.0365%2C1004.1353%2C1004.4079%2C1004.2606%2C1004.4771%2C1004.5205%2C1004.1396%2C1004.2437%2C1004.3889%2C1004.5062%2C1004.5511%2C1004.4357%2C1004.4808%2C1004.2550%2C1004.0144%2C1004.5547%2C1004.0296%2C1004.5247%2C1004.1473%2C1004.1421%2C1004.0460%2C1004.3109%2C1004.0837%2C1004.3639%2C1004.0359%2C1004.5340%2C1004.3448%2C1004.5260%2C1004.4978%2C1004.4927%2C1004.3557%2C1004.1048%2C1004.2175%2C1004.2700%2C1004.3035%2C1004.4631%2C1004.5367%2C1004.4433%2C1004.2677%2C1004.3533%2C1004.3846%2C1004.2902%2C1004.2452%2C1004.4630%2C1004.0295%2C1004.1787%2C1004.2025%2C1004.2841%2C1004.3222%2C1004.4550%2C1004.0922%2C1004.1386%2C1004.5168%2C1004.5078%2C1004.5298%2C1004.5361%2C1004.0373%2C1004.3239%2C1004.2082%2C1004.3866%2C1004.0524%2C1004.0494%2C1004.2901%2C1004.3471%2C1004.3595%2C1004.4977%2C1004.0943%2C1004.2898%2C1004.3576%2C1004.4911%2C1004.1590%2C1004.0470%2C1004.1572%2C1004.0939%2C1004.0364%2C1004.1124%2C1004.2361%2C1004.5332%2C1004.1077&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report on the measurements of the superconducting order parameter in the\nnonmagnetic borocarbides LuNi$_2$B$_2$C and YNi$_2$B$_2$C. Andreev conductance\nspectra are obtained from nanoscale metallic junctions on single crystal\nsurfaces prepared along three major crystallographic orientations: [001],\n[110], and [100]. The gap values extracted by the single-gap\nBlonder-Tinkham-Klapwijk model follow the BCS predictions as a function of\ntemperature and magnetic field and exhibit a small anisotropy. These\nobservations are robust and reproducible among all the measurements on two\ndifferent sets of LuNi$_2$B$_2$C crystals and one set of YNi$_2$B$_2$C\ncrystals. We suggest possible explanations for the small gap anisotropy based\non the recent detailed gap measurements by angle-resolved photoemission\nspectroscopy and the tunneling cone effect. Our results provide a consistent\npicture of the superconducting gap structure in these materials, addressing the\ncontroversy particularly in the reported results of point-contact Andreev\nreflection spectroscopy."}, "authors": ["X. Lu", "W. K. Park", "S. Yeo", "K. -H. Oh", "S. -I. Lee", "S. L. Bud'ko", "P. C. Canfield", "L. H. Greene"], "author_detail": {"name": "L. H. Greene"}, "author": "L. H. Greene", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.83.104519", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1004.3846v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1004.3846v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages, 8 figures, submitted to Phys. Rev. B", "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1004.3846v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1004.3846v1", "journal_reference": "Phys. Rev. B 83, 104519 (2011)", "doi": "10.1103/PhysRevB.83.104519", "fulltext": "Superconducting order parameter in nonmagnetic borocarbides RNi2B2 C (R=Y, Lu)\nprobed by point-contact Andreev reflection spectroscopy\nX. Lu,1, ∗ W. K. Park,1, † S. Yeo,2, ‡ K.-H. Oh,2 S.-I. Lee,2, § S. L. Bud'ko,3 P. C. Canfield,3 and L. H. Greene1\n\narXiv:1004.3846v1 [cond-mat.supr-con] 22 Apr 2010\n\n1\n\nDepartment of Physics and the Frederick Seitz Material Research Laboratory,\nUniversity of Illinois at Urbana-Champaign, Urbana, Illinois 61801, USA\n2\nNational Creative Research Initiative Center for Superconductivity and Department of Physics,\nPohang University of Science and Technology, Pohang 790-784, Republic of Korea\n3\nAmes Laboratory and Department of Physics and Astronomy, Iowa State University, Ames, Iowa 50011, USA\n(Dated: June 8, 2018)\nWe report on the measurements of the superconducting order parameter in the nonmagnetic\nborocarbides LuNi2 B2 C and YNi2 B2 C. Andreev conductance spectra are obtained from nanoscale\nmetallic junctions on single crystal surfaces prepared along three major crystallographic orientations:\n[001], [110], and [100]. The gap values extracted by the single-gap Blonder-Tinkham-Klapwijk model\nfollow the BCS predictions as a function of temperature and magnetic field and exhibit a small\nanisotropy. These observations are robust and reproducible among all the measurements on two\ndifferent sets of LuNi2 B2 C crystals and one set of YNi2 B2 C crystals. We suggest possible explanations for the small gap anisotropy based on the recent detailed gap measurements by angle-resolved\nphotoemission spectroscopy and the tunneling cone effect. Our results provide a consistent picture\nof the superconducting gap structure in these materials, addressing the controversy particularly in\nthe reported results of point-contact Andreev reflection spectroscopy.\nPACS numbers: 74.20.Rp, 74.45.+c, 74.50.+r, 74.70.Dd\n\nI.\n\nINTRODUCTION\n\nDiscovered more than fifteen years ago,1,2 the family of\nquaternary intermetallic compounds, RNi2 B2 C (R = rare\nearth elements), have attracted great attention.3–5 They\nprovide a unique opportunity for the investigation of the\ninterplay between superconductivity and magnetism in a\nhomologous series of compounds. They can be classified\ninto four subgroups: magnetic members (R = Pr, Nd,\nGd, Tb), superconductors (R = Sc, Y, Lu), coexisting\nmaterials (R = Dy, Ho, Er, Tm), and heavy fermions\n(R = Yb).3–5 The non-magnetic superconducting borocarbides, LuNi2 B2 C and YNi2 B2 C, a pristine model to\nstudy the superconductivity in this family, have the highest superconducting transition temperature: Tc ∼ 16.5\nK and 15.5 K, respectively. Despite intensive studies\nover the past decade, there is no consensus on their detailed gap structures. How magnetism and superconductivity coexist or compete in the coexisting members remains a topic of considerable research interest since a\nsystematic evolution of both phase transitions is observed\nover a comparable temperature range (1 − 20 K). On a\nbroader context, the interplay between superconductivity\nand magnetism has become a central theme in the studies of novel and unconventional superconductors including heavy fermions, cuprates, and the recently discovered iron-based superconductors. The magnetic and superconducting orders in RNi2 B2 C have different origins,\narising from the localized 4f electrons on R3+ ions coupled via the Ruderman-Kittel-Kasuya-Yosida (RKKY)\ninteraction,3,5 whereas the superconducting condensation\nis associated with the itinerant electron bands residing on\nthe Ni2 B2 layers.4\nComplex Fermi surface (FS) structures with multi-\n\nple sheets have been predicted from band structure\ncalculations6,7 and confirmed by several experimental\ntechniques.8–11 There are three bands crossing the Fermi\nlevel, all having electron-like character.7,11 While the\nsmall ellipsoidal FS from the 19th band is known to contribute very little to the electronic density of states, both\nthe 17th and 18th bands have been observed to comprise\nthe major FS sheets although their topology is quite different from each other. For the magnetic borocarbides,\nthe 'cushion'-like FS from the 18th band, coming exclusively from the Ni 3dx2 −y2 and 3dxy derived states, is\nnot affected by the magnetic moments of the rare earth\nions and, thus, the superconductivity originating from\nthis band can survive under the development of magnetic\norder.11,12\nThe superconductivity in the non-magnetic borocarbides RNi2 B2 C (R = Y, Lu) has been associated with\nboth the 17th and 18th bands.11 Thus, a fundamental question to be addressed is comprised of two parts:\n(i) whether the superconducting order parameter consists of multiple components in these bands; and (ii)\nwhat is the order parameter symmetry and anisotropy\nin momentum space. Early on, Shulga et al.13 reported on the evidence for a multi-band nature of the superconductivity from the temperature dependence measurements of the upper critical field in YNi2 B2 C and\nLuNi2 B2 C. A variety of experimental investigations such\nas photoemission spectroscopy14 , Raman scattering15 ,\nthermal conductivity16 , specific heat17 , and ultrasound\nattenuation18 point to a large anisotropy in the superconducting gap functions. More detailed information on\nthe gap anisotropy is reported from the measurements\nof thermal conductivity19,20 and specific heat21,22 as a\nfunction of magnetic field orientation. Clear four-fold\n\n\f2\noscillations are observed in both kinds of measurements\nand interpreted as strong evidence for an anisotropic gap\nstructure with gap minima located along the [100] and\n[010] directions. In particular, Izawa et al.19,20 report\nthe possible existence of point-like nodes from the observation of diminishing oscillation amplitude as the field direction changes from the ab-plane to the c-axis. This may\nbe consistent with an extremely large gap anisotropy:\nmax\nγgap ≡ ∆\n∆min ≥100. It is noted that these measurements can be obscured by the anisotropy in properties\nother than the superconducting order parameter, making\ntheir interpretations non-trivial.23,24 This can be an issue\nparticularly relevant to the borocabide superconductors\nsince many properties are known to be anisotropic such\nas the FS,8–11 upper critical field,25 and vortex lattice\nstructure.26–29\nMaki and coworkers30,31 propose a hybrid s+g wave order parameter, in which the g-wave component is added\nas an ansatz to simulate the point-node structure implied\nby experimental observations. Kontani32 point out that\npoint-like nodes can be formed in a phonon-mediated swave superconducting order parameter if antiferromagnetic fluctuations exist on some parts of the FS connected by a nesting vector. Earlier, band structure calculations based on local density approximation predicted\na nesting feature on the FS with nesting vectors Q ≈\n2π(0.5/a, 0) and 2π(0, 0.5/a) in the basal plane.33 This\nis directly observed from two-dimensional angular correlation measurements on LuNi2 B2 C using the electronpositron annihilation radiation technique.8 Interestingly,\nan antiferromagnetic order in the magnetic borocabide\ncompounds is observed to have an ordering wave vector Qm ≈ 2π(0.55/a, 0, 0),34–36 very close to the nesting vector. The phonon-mediated pairing has long been\nattributed to the superconductivity in the borocarbide\nfamily.37,38 For instance, Martinez-Samper et al.39 report on scanning tunneling spectroscopy measurements,\nin which features due to strong electron-phonon coupling reminiscent of a Pb tunnel junction are observed.\nTheir extracted coupling constant is highly anisotropic\ndue to soft phonon modes as observed in inelastic neutron scattering experiments.40–42 According to the theoretical arguments by Kontani,32 the nesting feature in\nthe FS would generally weaken the electron-phonon coupling along Q. Thus, this scenario can explain the experimentally observed anisotropic gap structure in the\nnonmagnetic borocarbide superconductors.\nSpectroscopy based on the measurement of Andreev\nreflection conductance has been adopted frequently as\na measure to investigate superconducting order parameters (see refs. 43 and 44 and references therein). Called\npoint-contact Andreev reflection spectroscopy (PCARS),\nit is a simple and versatile technique, with which two\ngroups have reported results on the nonmagnetic borocarbide family. Disparate claims are made from measurements using virtually the same technique. Raychaudhuri et al.45 observe a large anisotropy (γgap ≈ 5) between the gap values along the [100] and [001] direc-\n\ntions. They interpret this as evidence for the s+g order parameter with point nodes as suggested by Maki\net al.30 Later, they interpret this as evidence for multiband superconductivity.46 Naidyuk and coworkers do\nnot report such large anisotropy.47–51 Between these\ntwo groups, the temperature dependences of the gap\nvalue along the [100] direction are strongly contradictory. Thus, our motivation for this work was, in part,\nto address this controversy with our own detailed gap\nstructure measurement in the non-magnetic borocarbide\nsuperconductors.52\n\nII.\n\nEXPERIMENTS\n\nThe working principle behind point-contact spectroscopy is that the energy dependence of quasiparticle\nscattering at an interface between two metallic electrodes\nis reflected as a non-linearity in the current-voltage characteristics. Analysis of such nonlinearity provides important information on the scattering sources. When applied to a superconductor, the most relevant scattering\nprocess is Andreev reflection, which is essentially a scattering off the pair potential. Thus, PCARS relies on the\nstrong energy dependence of this scattering at a normalmetal/superconductor interface. In order to avoid complications due to other scattering processes (elastic or\ninelastic), a point-contact junction must fulfill requirements for the ballisticity. Ideally, its size needs to be\nsmaller than the electronic mean free paths of the electrodes. In practice, nanoscale metallic junctions can be\nmade by bringing a sharpened metal tip into contact with\na superconductor using fine mechanical adjustments.\nWe perform systematic investigations of the gap structures in the nonmagnetic borocabide superconductors\nYNi2 B2 C and LuNi2 B2 C. Differential conductance spectra along three major crystallographic directions are\ntaken from two sets of LuNi2 B2 C single crystals of different sources and one set of YNi2 B2 C single crystals.\nCrystals from different batches are used for each direction in the set LuNi2 B2 C #1. For the sets LuNi2 B2 C\n#2 and YNi2 B2 C, crystals for all three directions are\nprepared from same batches. These single crystals are\ngrown by flux method using Ni2 B flux.53,54 Bulk resistivity and magnetization measurements show that they\nare of high quality, as summarized in Table I.\nFor a point-contact junction oriented along the caxis, the as-grown surface of a single crystal is used,\nsince its normal is along that direction. For in-plane\njunctions along [100] and [110] directions, crystals are\nembedded into low-temperature epoxy, cut, and polished until atomic smoothness (rms roughness ∼10 Å)\nis achieved.44,52,55 The desired crystallographic orientations of the exposed surfaces are identified by X-ray\ndiffraction, with 5 degree accuracy with the intended\ndirections obtained. Since pristine crystals may contain a degraded surface layer where superconductivity\nis strongly suppressed, which is not favorable to PCARS\n\n\f3\nTABLE I: Summary of sample characteristics and PCARS results. RRR (residual resistance ratio) ≡ R(300K)/R(Tc,on ), (Tc,on\n= onset transition temperature); Tc,zero : zero-resistance transition temperature; ∆Tc ≡ Tc,on − Tc,zero ; ∆0 : gap energy at\nzero-temperature; γgap ≡ ∆max /∆min : maximum gap anisotropy; ω ≡ 1 − ∆001 /∆110 : weight for g-wave component (see text).\nCrystal\n\nOrientation\n[001]\n[110]\n[100]\n\nRRR\n21\n21\n20\n\nTc,zero (K)\n16.0\n16.1\n15.0\n\n∆Tc (K)\n0.7\n0.6\n0.5\n\n∆0 (meV)\n2.4\n2.6\n2.3\n\n2∆0 /kB Tc γgap\n3.48\n3.75\n1.13\n3.56\n\nLuNi2 B2 C #2\n\n[001]\n[110]\n[100]\n\n26\n\n16.1\n\n0.7\n\n2.5\n2.8\n2.7\n\n3.60\n4.04\n3.89\n\n1.12\n\n0.107\n\nYNi2 B2 C\n\n[001]\n[110]\n[100]\n\n24\n\n15.5\n\n0.3\n\n2.0\n2.1\n2.5\n\n3.00\n3.15\n4.04\n\n1.25\n\n0.048\n\nLuNi2 B2 C #1\n\ndue to its surface-sensitive nature, the crystals are etched\nslightly in aqua-regia for about 20 seconds to expose fresh\nsurfaces prior to making point-contact junctions. For the\nPCARS measurement, a crystal is cooled down to about\n2 K in the liquid helium cryostat, and then a sharp gold\ntip is moved to engage onto the crystal surface by a fine\ndifferential micrometer until a reasonable junction resistance is reached.\nThe junction resistance, RJ , usually ranges from several ohms to tens of ohms. Applying the Wexler's\nformula56 using these RJ values along with known materials parameters for borocarbides (ρ0 ∼ 1.30 μΩ*cm\nand l ∼ 500 Å as reported in ref. 16), we infer that the\njunctions are in the ballistic limit. What is more important to ensure the spectroscopic nature is that our measured conductance spectra are reproducible as shown below and free from non-spectroscopic effects such as local\nheating. The differential conductance (G ≡ dI/dV ) as a\nfunction of voltage (V ) is directly recorded by the standard four-probe lock-in technique over wide temperature\n(1.6 − Tc ) and magnetic field (0 − 9 T) ranges covering\nthe whole phase space for the superconductivity in these\nmaterials. The local critical temperature in the junction\narea, Tcj , is determined by the temperature dependence of\nthe zero-bias conductance. The measured Tcj is in good\nagreement with the bulk Tc determined by four-probe\nresistance measurement. This is an indication that the\nproperties of the bulk rather than a possible degraded\nsurface layer are measured in our PCARS experiments.\nFor brevity, we simply refer to Tcj as Tc in the following.\n\nIII.\n\nSUPERCONDUCTING ENERGY GAP\nA.\n\nLuNi2 B2 C\n\nFigure 1 shows one set of G(V ) curves for LuNi2 B2 C\n#1 crystals, taken as a function of temperature along the\nthree major crystallographic orientations: [001], [110],\nand [100]. Note that at the lowest temperatures the Andreev reflection amplitude and peak positions in the three\n\nω\n0.077\n\ndirections are comparable. The data are analyzed using the Blonder-Tinkham-Klapwijk (BTK) model57,58 assuming a single isotropic s-wave gap. In this BTK model,\nthere are three parameters: the superconducting gap (∆)\nextracted from the BTK fit, the barrier strength (Z) between the normal metal and superconductor, and the\nquasiparticle scattering parameter (Γ), which accounts\nfor the smearing of a conductance curve due to shortened quasiparticle lifetime or depairing effect caused by\ninelastic scattering or magnetic field. Here, we focus on\nthe extracted superconducting gap and its temperature\ndependence.\nFigure 2 shows the temperature dependence of the superconducting gap, ∆, in the [001], [110], and [100] direction, respectively. As shown, they all follow the standard\nBCS-like curve, yielding 2∆0 /kB Tc ∼ 3.5, 3.8 and 3.6 in\nthe weak-coupling limit. This is in good agreement with\nthe results obtained from break junction experiments.59\nAt the lowest measurement temperatures (∼ 2 K), the\n[001] and [110] junctions show comparable superconducting gap values with ∆001 = 2.4 meV and ∆110 = 2.6\nmeV, respectively. The extracted gap value along the\n[100] direction is ∼ 2.3 meV, giving a small anisotropy\nwith the other directions (γgap ∼1.13). As shown in Table I, the bulk Tc of this crystal is lower than those for\nthe others. Its origin is not clear yet but the 2∆0 /kB Tc\nvalue is consistent within the LuNi2 B2 C #1 set. Our\ngap values are similar to those reported by Bobrov et\nal.,49 where the c-axis and ab-plane gap sizes from onegap BTK fit are 2.25 and 2.55 meV, respectively. We\nnote that their samples for ab-plane junctions are prepared without well-defined orientations. In our study,\ndozens of point-contact junctions have been measured\nand their conductance spectra are quite reproducible as\ndemonstrated by the histograms in Fig. 3, which counts\nthe occurrences for different gap values at the lowest measurement temperatures. ∆100 exhibits a bit scattered distribution although the most frequently observed value is\n2.3 meV. This behavior might be indicative of the tunneling cone effect, which is most pronounced along the\nminimum gap direction, as discussed later.\nThe superconducting energy gaps obtained from a\n\n\f4\n\nFIG. 1: (Color online) Temperature dependence of the differential conductance spectra for the point-contact junctions on\nLuNi2 B2 C #1 along (a) [001], (b) [110] and (c) [100] directions. These G(V ) curves are obtained from junctions showing the\nmost frequent gap values in Fig. 3. The data are normalized by the conductance at the negative maximum bias voltage in (a),\n(b), and (c).\n\nFIG. 3: (Color online) Histograms plotting the frequencies of\nthe superconducting gap values measured from point-contact\njunctions on LuNi2 B2 C #1 along (a) [001], (b) [110], and (c)\n[100] direction.\nFIG. 2: (Color online) Temperature dependence of the superconducting gap in LuNi2 B2 C #1 extracted from an analysis\nusing the single-gap BTK model along (a) [001], (b) [110] and\n(c) [100] directions. The symbols are experimental data and\nthe solid lines represent the BCS prediction.\n\nsingle-band BTK analysis show slight deviations from the\nBCS curve in the low temperature region, as seen in Fig.\n2(b) and in other data in the following. We also note that\nin the low temperature region the best-fit curves are not\nas satisfactory as for a known isotropic single-band superconductor such as Nb. Bobrov et al.49 have reported\nsimilar observations in their PCARS on LuNi2 B2 C crystals and demonstrated that their G(V ) curves can be\nbetter fit by assuming a continuous distribution of the\n\ngap function with double maxima. They interpreted this\nas evidence for an anisotropic gap structure or multiband\nsuperconductivity in LuNi2 B2 C. Although such an analysis is not an unreasonable approach considering recent\ndevelopments in the field, we view it as marginal since it\ndoes not provide corroborative evidence for multiple order parameters. Note that strong evidence for multiband\nsuperconductivity in MgB2 does not come from improved\nconductance fitting but from clear features due to multiple gaps as observed in the original data.60,61\nThe magnetic field dependence of the superconducting\ngap was studied at the lowest temperatures around 2 K,\nas shown in Fig. 4. The G(V ) curves were taken with\n\n\f5\n\nFIG. 4: (Color online) Magnetic field dependence of the\ndifferential conductance for the point-contact junctions on\nLuNi2 B2 C #1 along (a) [001], (b) [110] and (c) [100] directions. The data are normalized by the conductance at the\nnegative maximum bias voltage in (a), (b), and (c). The\ngap ∆ extracted from a single-gap BTK analysis is plotted\nin (d) and the quasiparticle broadening factor Γ in (e), as a\nfunction of the magnetic field. The solid lines in (d) and (e)\nrepresent best-fit\ncurves using ∆ = ∆0 (1 − H/Hc2 )1/2 and\n√\nΓ = Γ0 + c0 H, respectively. Here, Γ0 = 0.23 meV for all\nthree junctions; c0 = 0.60 meV * T−1/2 for the [001] and [110]\njunctions, and c0 = 0.45 meV * T−1/2 for the [100] junction.\n\nthe field applied along the corresponding crystallographic\ndirection. With increasing field, the conductance peak is\nsuppressed and broadened with its position moving toward the zero bias. As shown in Fig.4 (d), the superconducting gap decreases with increasing field, roughly\nfollowing the BCS behavior, ∆ = ∆0 (1 − H/Hc2 )1/2 . No\nfield-dependent signatures for multiple\ngaps are observed.\n√\nThe Γ parameter increases with H dependence, as plotted in Fig.4 (e).\nAnother set of LuNi2 B2 C crystals from a different\nsource are prepared in the same way in order to check\nsample dependence. The G(V ) curves and the extracted\ngap values are displayed in Fig. 5 as a function of temperature. Similar behaviors in the gap function to the previous data set are observed, following the BCS prediction\nand showing a small anisotropy. We note that 2∆0 /kB Tc\nvalues for these samples are systematically larger than\nthose in the first set by ∼ (3 − 9)% although their Tc\nvalues are comparable, as listed in Table. This means\nthat they are in the intermediate coupling regime. What\ncauses this difference between the two sets of LuNi2 B2 C\ncrystals is not clear.\n\nFIG. 5: (Color online) Temperature dependence of the superconducting gap extracted from a single-gap BTK analysis\nfor point-contact junctions on LuNi2 B2 C #2 along (a) [001],\n(b) [110] and (c) [100] directions in comparison with the standard BCS curve. The insets plot the conductance data as a\nfunction of temperature.\n\nB.\n\nYNi2 B2 C\n\nIn terms of electronic structure, there is not much difference between YNi2 B2 C and LuNi2 B2 C.7,11 Although\nthe maximum bulk Tc differs by 1 K, this can be accounted for by a small difference in the electron-phonon\ncoupling constant or the density of states at the Fermi\nlevel. The superconducting gap has been reported to be\nanisotropic in both compounds. Nonetheless, we have\ncarried out PCARS measurements on YNi2 B2 C single\ncrystals in order to rule out the possibility that the gap\nanisotropy may be somehow enhanced in this compound\nthan in LuNi2 B2 C. As shown in Table I, the RRR values\nof these crystals are comparable to those of LuNi2 B2 C\ncrystals.\nThe temperature evolution of the conductance spectra and the gap energy from point-contact junctions on\nYNi2 B2 C are shown in Fig. 6 and Fig. 7, respectively.\nAgain, these data are analyzed with the single-gap BTK\nmodel to extract the gap values. They all follow the\n\n\f6\n\nFIG. 7: (Color online) Temperature dependence of the superconducting gap in YNi2 B2 C along (a) [001], (b) [110] and (c)\n[100] directions in comparison with the standard BCS curve.\n\nIV.\nFIG. 6: (Color online) Temperature dependence of the normalized differential conductance for the point-contact junctions on YNi2 B2 C along (a) [001], (b) [110] and (c) [100] directions. The data are normalized with respect to the negative\nmaximum bias voltage.\n\nBCS curve although some deviations are observed in\nthe low temperature region, similarly to those observed\nin LuNi2 B2 C. The averaged gap values obtained from\ndozens of contacts at the lowest measurement temperatures of ∼ 2 K are given in Table I. The maximum gap\nanisotropy γgap is 1.25, larger than in LuNi2 B2 C, but\nthe gap is maximum along the [100] direction. This is\nin contrast to the case of LuNi2 B2 C, where the gap is\nmaximum along the [110] direction.\nAs in the case of LuNi2 B2 C, the extracted energy gap\ncloses at the bulk resistive Tc in all three directions. This\nis a strong indication that our PCARS results represent\nbulk properties instead of a possible surface layer that\nis degraded during experiments. Theoretically, it is possible that the small gap anisotropy may be caused by\nthe averaging effect due to microscopic surface facets. In\norder to check for this possibility, we took conductance\ndata on crystals with and without undergoing the chemical etching process after polishing. Similar results are\nobtained from both cases, ruling out such possibility.\n\nDISCUSSIONS\n\nAs presented above and summarized in Table I, we\nhave observed a small gap anisotropy from both nonmagnetic superconductors LuNi2 B2 C and YNi2 B2 C. Maximum gap anisotropy ranges between 1.12 and 1.25. This\nobservation is reproducible and robust among different\nsets of samples and measurements. Our results are apparently contradictory with many recent reports in the\nliterature claiming for a strong anisotropy in the gap\nstructure, as discussed in Sec. I.14–22 Below, we put forward possible explanations for this discrepancy, based on\nthe Fermi surface topology and tunneling cone effect. We\nnote that, by nature, thermal conductivity and specific\nheat in the superconducting state are sensitive to the\ngap minimum, whereas inherently anisotropic gap features could be smeared out in PCARS since the momentum of an injected electron can distribute over a wide\nrange of angle with respect to the nominal surface normal. We begin by reviewing the Fermi surface topology revealed by band structure calculations and recent\nangle-resolved photoemission spectroscopy (ARPES),62\nand quantum oscillation experiments.11\nThe claimed nesting structure on the 17th band\nFS has been observed by different experiments\nsuch as ARPES,10 and electron-positron annihilation\nmeasurements9 , where the nested part only occupies\na small portion of the Fermi surface.12 According to\nKontani,32 antiferromagnetic fluctuations on the nested\n\n\f7\nparts of the FS could induce a point-node-like gap minimum along the nesting wave vector. Recently, Baba\net al.62 have reported on the detailed gap structures in\nYNi2 B2 C measured by high-resolution ARPES. Their results show that the superconducting gap is observed on\nmultiple bands (the 17th and 18th) with very different\nmomentum dependences. More specifically, it is revealed\nthat the gap is highly anisotropic on the 17th band with\ntwo minima, whereas the 18th band has a nearly constant\ngap. The two minima are 1.5 and 2.3 meV on different\nparts of the 17th band FS. Their momentum directions\nare identified as [100], consistent with other reports.19–22\nIt was claimed that the points on the FS where the gap\nshows a minimum of 1.5 meV can be connected by the\nnesting vector Q ∼ 2π/a(0.55, 0, 0), implying an intimate\nconnection between the minimal gap and the FS nesting.\nIt was also argued that the reason why the gap minimum\nhas a non-zero value is because their ARPES data were\ntaken off the basal plane with kz ∼ 0.5 2π\nc .\nBased on these observations from ARPES, it is naturally understood that the node-like gap minimum along\n[100] cannot be observed in PCARS since the shape of\na conductance curve will be dominated by the other gap\nminimum (2.3 meV) which is located along the same direction. Indeed, this gap value is close to those we observed in this study (see Table I.), explaining why we\nobserve only a small gap anisotropy in both LuNi2 B2 C\nand YNi2 B2 C.\nOur experimental results are in strong contradiction\nwith those reported by Raychaudhuri and coworkers.45,46\nFrom PCARS measurements on YNi2 B2 C, they reported\na gap anisotropy of γgap ∼ 4.5, much larger than ours\n(1.12 − 1.25). This discrepancy is mainly associated with\ntheir extremely small gap value along [100] (∼ 0.415\nmeV) since their gap value along [001] (∼ 1.8 meV) is not\nmuch different from ours. Moreover, they observed that\n∆100 closes at ∼ (7 − 9) K, much lower than the bulk Tc .\nThis is in strong contrast with our observation of ∆100\nclosing at the bulk Tc . We note that Naidyuk et al.47 also\nreported similar temperature dependences to ours. Raychaudhuri et al. originally interpreted their results as evidence for s+g gap structure with point nodes,45 and later\non claimed for the multiband nature of the superconductivity in borocarbides.46 We think this is an unlikely\ninterpretation considering the recent ARPES measurements discussed above since there is no way for PCARS,\nwhich doesn't have such high momentum resolution as\nin ARPES, to probe only an extremely small gap value\n(∼ 0.415 meV) while there exists another but sizable gap\nminimum (∼ 2.3 meV) along [100]. Rather, it is more\nnatural to attribute the exotic behavior of their measured\n∆100 to non-intrinsic effects such as suppressed superconductivity on the sample surface, as was also pointed out\nby Naidyuk et al.47\nNext, we discuss the tunneling cone effect on the conductance spectra. In the original BTK model,57 the integration is carried out only over the energy, assuming\nan isotropic gap structure. Thus, it is inaccurate for the\n\nanalysis if the energy gap has substantial dependence on\nmomentum. A straightforward way to deal with this situation is to include an integration with respect to momentum. Here sets in the tunneling cone effect.63,64 If we\nconsider a planar tunnel junction with a potential barrier\nof finite thickness, the transmission probability varies depending on the momentum direction, being maximal for\na direction normal to the barrier. Assuming a Gaussian distribution for the probability, the tunneling cone\nangle can be as small as 5 − 10 degrees in typical tunnel junctions.64 This angle is expected to increase with\ndecreasing barrier strength. Therefore, its effects are\nnot negligible in PCARS due to inherently small barrier\nstrength as well as small junction size (uncertainty principle). Here, we simulate conductance spectra in order\nto study the effect of tunneling cone on the gap structure\nwith large anisotropy. Namely, we calculate conductance\ncurves that are obtained from a given gap function with\na varying cone angle, and then determine the gap values\nfrom the peak positions.\nIn order to simulate conductance curves, we adopt\nthe extended BTK model for a d-wave superconductor,\nformulated by Tanaka and Kashiwaya,65 but only consider gap functions without a sign change since there is\nsubstantial evidence in these materials for this premise.\nThen, the conductance kernel σS (E) for a given θN , angle of incidence in the normal-metal electrode, can be\nwritten as:\n1 + σN |Γ+ |2 + (σN − 1)|Γ+ Γ− |2\n,\n(1)\n|1 + (σN − 1)Γ+ Γ− |2\n√\nE− E 2 −|∆± |2\nZ0\n1\n.\nwhere σN = 1+Z 2 , Z = cos θN and Γ± =\n|∆± |\nHere Z0 is the barrier strength, and ∆± represent the\npairing potentials for the transmitted electron-like quasiparticles or hole-like quasiparticles, respectively. Thus,\nfor a normal-metal/superconductor junction, the total\nconductance σT (E) is given by the integration of σS (E)\nwith respect to a solid angle Ω,\nR\ndΩσS (E) cos θN P (θN )\nσT (E) = R\n,\n(2)\ndΩσN cos θN P (θN )\nσS (E) = σN\n\nwhere P (θN ) is the transmission probability for a given\nθN . As an approximation, we assume a Gaussian-type\ndistribution:\nθ\n\nP (θN ) ∝ e\n\n−( ΘN )2\nD\n\n.\n\n(3)\n\nThe parameter ΘD is a variable characterizing the tunneling cone for a given junction. We consider two\ngap functions: s+g wave as proposed by Maki et al.30\nand anisotropic s-wave gap, both having four-fold pointnodes. The s+g gap function can be written as ∆(k) =\n4\n1\n2 ∆0 [1 − sin θ cos(4φ)] and for an anisotropic gap we assume ∆(k) = ∆0 [1 − sin4 θ cos2 (2φ)] for simplicity. In\nthe zero-temperature limit, the peak position of a conductance curve can be taken as the energy gap. Figure 8 plots thus obtained ∆ along three major directions\n\n\f8\n\nFIG. 8: (Color online) Dependence of the peak position,\n∆P eak /∆0 , of the conductance curve simulated by the extended BTK model on the tunneling cone angle, ΘD , assuming a nodal gap structure of (a) s+g wave and (b) anisotropic\ns-wave, respectively.\n\nRRR and γgap is observed, as summarized in Table I. We\nnote that the ∆100 value of a LuNi2 B2 C #2 single crystal changes very little after annealing although its RRR\nincreases to 34.3 (not shown here). Moreover, the specific heat results reported in refs. 21 and 22 which were\nobtained using single crystals from the same sources as\nours, have shown clear four-fold oscillations under magnetic field. Thus, the possibility of impurity scattering\nbeing an intrinsic origin for the small gap anisotropy can\nbe excluded in our PCARS study.\nConsidering our experimental observations in relation\nto the discussions presented above, we predict that the\nanisotropic gap structure can be better probed by thinfilm based tunneling spectroscopy. In particular, the two\ngap minima along the [100] direction as seen in the recent APRES study62 should also be discernible in the\ntunneling conductance data.\n\nV.\n\nas a function of the tunneling cone angle, ΘD . An assumption is made that the tunneling cone ΘD does not\ndepend on the surface orientations. The inherently large\nanisotropy is observed for a narrow tunneling cone. However, the anisotropy becomes smaller as the cone angle\nincreases. ∆100 = ∆001 at ΘD =25 and 35 deg., for\nthe s+g and anisotropic s-wave case, respectively. Although qualitatively similar, there is difference between\nthe two gap functions in their response to the tunneling cone. That is, the calculated gap values do not\nmerge in the s+g case, whereas they merge into one\nfor large tunneling cone in the anisotropic s-wave case.\nThis indicates that the anisotropic s-wave with ΘD ≥ 30\ndeg., rather than the s+g, agrees with the small gap\nanisotropy we have observed constantly. If we consider\nmore general case of the s+g gap function, written as\n∆ = ∆0 [(1 − ω) − ω sin4 θ cos(4φ)], we can estimate the\nweight for the g-wave component. It turns out that ω is\nvery small in all our measurements as listed in Table I.\nThus, we argue that the s+g wave is unlikely as a candidate gap function in borocarbides, in contrast to several\nreports in the literature.19,20,45\nOur simulation based on tunneling cone effect is essentially similar to the BTK fitting with a distribution of\ngap values as reported by Bobrov et al.49 in that contributions from different gap values are added in both cases.\nAs we do not claim for an anisotropic gap structure in\nthe borocarbide superconductors from our tunneling cone\nsimulation, we don't view their arguments as corroborative evidence for the multiband superconductivity, either.\nStudies on the thermal conductivity66 and specific\nheat67 in doped single crystals of Y(Ni1−x Ptx )2 B2 C have\nshown that the gap anisotropy is washed out as the\ndoping level increases. This was interpreted as due to\ngap opening induced by the nonmagnetic impurity, in\nagreement with theoretical calculations.66,68 Our transport measurements indicate that the samples used in our\nPCARS are of high quality and no correlation between\n\nCONCLUSIONS\n\nWe have carried out PCARS measurements on the nonmagnetic borocarbide superconductors LuNi2 B2 C and\nYNi2 B2 C in order to investigate their detailed gap structures. Conductance spectra as a function of crystallographic orientation, temperature, and magnetic field are\ntaken from two different sets of LuNi2 B2 C crystals and\none set of YNi2 B2 C crystals. Analysis based on the\nsingle-gap BTK model shows that the superconducting\ngap follows the BCS predictions as a function of temperature and magnetic field, closing at bulk superconducting transitions, albeit a slight deviation is sometimes\nobserved. The measured superconducting gaps exhibit a\nsmall anisotropy among the three major directions: [001],\n[110], and [100]. Any clear evidence for multiple gaps is\nnot observed. These results are completely reproducible\nand robust in all our measurements. In order to explain\nour observations, two possible scenarios are considered in\nterms of the recent ARPES studies and tunneling cone\neffect. We argue that these two effects may render it impossible to observe the inherently large gap anisotropy\nusing PCARS. Thin-film tunneling spectroscopy on the\n[100] surface should better detect the gap minima, which\nthen can serve as a confirmation of the anisotropic structure and multiband nature of the superconducting order parameter in these compounds. Our study addresses\nthe controversy over the gap structure in the nonmagnetic borocarbides, particularly among the studies using\nPCARS techniques.\n\nAcknowledgments\n\nWe acknowledge experimental help by undergraduate\nresearch assistants, A. S. Ahmed, V. Jacome, and Y.-H.\nLin. The work at the University of Illinois at UrbanaChampaign was supported by the National Science Foundation under Award No. DMR 07-06013 (X.L.) and by\n\n\f9\nthe Department of Energy under Award No. DE-FG0207ER46453 (W.K.P.) through the Frederick Seitz Materials Research Laboratory and the Center for Microanal-\n\n∗\n\n†\n‡\n\n§\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\n13\n\n14\n\n15\n\n16\n\n17\n\n18\n\n19\n\nPresent address: Los Alamos National Laboratory, Los\nAlamos, NM, USA.\nCorresponding author: wkpark@illinois.edu\nPresent address: Korea Atomic Energy Research Institute,\nDaejeon 305-353, Republic of Korea.\nDeceased.\nR. J. Cava, H. Tagaki, H. W. Zandbergen, J. J. Krajewski,\nW. F. Peck Jr, T. Siegrist, B. Batlogg, R. B. van Dover,\nR. J. Felder, K. Mizuhashi, et al., Nature (London) 367,\n252 (1994).\nR. Nagarajan, C. Mazumda, Z. Hossain, S. K. Dhar, K. V.\nGopalakrishnan, L. C. Gupta, C. Godart, B. D. Padalia,\nand R. Vijayaraghavan, Phys. Rev. Lett. 72, 274 (1994).\nK.-H. Müller and V. N. Narozhnyi, Rep. Prog. Phys. 64,\n943 (2001).\nP. Thalmeier and G. Zwicknagl, arXiv:cond-mat/0312540\n(2003).\nP. C. Canfield, P. L. Gammel, and D. J. Bishop, Phys.\nToday, Oct. pp. 40–46 (1998).\nS.-L. Drechsler, H. Rosner, S. Shulga, I. Opahle, H. Eschrig, J. Freudenberger, G. Fuchs, K. Nenkov, K.-H.\nMuller, H. Bitterlich, et al., Physica C (Amsterdam) 364365, 31 (2001).\nK. Yamauchi, H. Katayama-Yoshida, A. Yanase, and\nH. Harima, Physica C (Amsterdam) 412-414, 225 (2004).\nS. B. Dugdale, M. A. Alam, I. Wilkinson, R. J. Hughes,\nI. R. Fisher, P. C. Canfield, T. Jarlborg, and G. Santi,\nPhys. Rev. Lett. 83, 4824 (1999).\nS. B. Dugdale, C. Utfeld, I. Wilkinson, J. Laverock, Z. Major, M. A. Alam, and P. C. Canfield, Supercond. Sci. Technol. 22, 014002 (2009).\nP. Starowicz, C. Liu, R. Khasanov, T. Kondo,\nG. Samolyuk, D. Gardenghi, Y. Lee, T. Ohta, B. Harmon,\nP. Canfield, et al., Phys. Rev. B 77, 134520 (2008).\nB. Bergk, V. Petzold, H. Rosner, S.-L. Drechsler,\nM. Bartkowiak, O. Ignatchik, A. D. Bianchi, I. Sheikin,\nP. C. Canfield, and J. Wosnitza, Phys. Rev. Lett. 100,\n257004 (2008).\nS. L. Drechsler, H. Rosner, I. Opahle, S. V. Shulga, and\nH. Eschrig, Physica C (Amsterdam) 408-410, 104 (2004).\nS. V. Shulga, S.-L. Drechsler, G. Fuchs, K.-H. Müller,\nK. Winzer, M. Heinecke, and K. Krug, Phys. Rev. Lett.\n80, 1730 (1998).\nT. Yokoya, T. Kiss, T. Watanabe, S. Shin, M. Nohara,\nH. Takagi, and T. Oguchi, Phys. Rev. Lett. 85, 4952\n(2000).\nI.-S. Yang, M. V. Klein, S. L. Cooper, P. C. Canfield, B. K.\nCho, and S.-I. Lee, Phys. Rev. B 62, 1291 (2000).\nE. Boaknin, R. W. Hill, C. Proust, C. Lupien, L. Taillefer,\nand P. C. Canfield, Phys. Rev. Lett. 87, 237001 (2001).\nK. Izawa, A. Shibata, Y. Matsuda, Y. Kato, H. Takeya,\nK. Hirata, C. J. van der Beek, and M. Konczykowski, Phys.\nRev. Lett. 86, 1327 (2001).\nT. Watanabe, M. Nohara, T. Hanaguri, and H. Takagi,\nPhys. Rev. Lett. 92, 147002 (2004).\nK. Izawa, K. Kamata, Y. Nakajima, Y. Matsuda,\n\nysis of Materials. The work at the Ames Laboratory was\nsupported by the Department of Energy, Basic Energy\nSciences under Contract No. DE-AC02-07CH11358.\n\n20\n\n21\n\n22\n\n23\n\n24\n\n25\n\n26\n\n27\n\n28\n\n29\n\n30\n\n31\n\n32\n33\n\n34\n\n35\n\n36\n\n37\n\n38\n\n39\n\n40\n\n41\n\nT. Watanabe, M. Nohara, H. Takagi, P. Thalmeier, and\nK. Maki, Phys. Rev. Lett. 89, 137006 (2002).\nY. Matsuda, K. Izawa, and I. Vekhter, J. Phys.: Condens.\nMatter 18, R705 (2006).\nT. Park, M. B. Salamon, E. M. Choi, H. J. Kim, and S.-I.\nLee, Phys. Rev. Lett. 90, 177001 (2003).\nT. Park, E. E. M. Chia, M. B. Salamon, E. D. Bauer,\nI. Vekhter, J. D. Thompson, E. M. Choi, H. J. Kim, S.I. Lee, and P. C. Canfield, Phys. Rev. Lett. 92, 237002\n(2004).\nM. Udagawa, Y. Yanase, and M. Ogata, Phys. Rev. B 71,\n024511 (2005).\nA. Vorontsov and I. Vekhter, Phys. Rev. Lett. 96, 237001\n(2006).\nV. Metlushko, U. Welp, A. Koshelev, I. Aranson, and\nG. W. Crabtree, Phys. Rev. Lett. 79, 1738 (1997).\nY. DeWilde, M. Iavarone, U. Welp, V. Metlushko, A. E.\nKoshelev, I. Aranson, G. W. Crabtree, and P. C. Canfield,\nPhys. Rev. Lett. 78, 4273 (1997).\nM. R. Eskildsen, P. L. Gammel, B. P. Barber, A. P.\nRamirez, D. J. Bishop, N. H. Andersen, K. Mortensen,\nC. A. Bolle, C. M. Lieber, and P. C. Canfield, Phys. Rev.\nLett. 79, 487 (1997).\nN. Nakai, P. Miranovic, M. Ichioka, and K. Machida, Phys.\nRev. Lett. 89, 237004 (2002).\nH. Nishimori, K. Uchiyama, S. Kaneko, A. Tokura,\nH. Takeya, K. Hirata, and N. Nishida, J. Phys. Soc. Jpn.\n73, 3247 (2004).\nK. Maki, P. Thalmeier, and H. Won, Phys. Rev. B 65,\n140502 (2002).\nQ. Yuan and P. Thalmeier, Phys. Rev. B 68, 174501\n(2003).\nH. Kontani, Phys. Rev. B 70, 054507 (2004).\nJ. Y. Rhee, X. Wang, and B. N. Harmon, Phys. Rev. B\n51, 15585 (1995).\nA. I. Goldman, C. Stassis, P. C. Canfield, J. Zarestky,\nP. Dervenagas, B. K. Cho, D. C. Johnston, and B. Sternlieb, Phys. Rev. B 50, 9668 (1994).\nT. E. Grigereit, J. W. Lynn, Q. Huang, A. Santoro, R. J.\nCava, J. J. Krajewski, and W. F. Peck, Phys. Rev. Lett.\n73, 2756 (1994).\nJ. Zarestky, C. Stassis, A. I. Goldman, P. C. Canfield,\nP. Dervenagas, B. K. Cho, and D. C. Johnston, Phys. Rev.\nB 51, 678 (1995).\nD. D. Lawrie and J. P. Franck, Physica C (Amsterdam)\n245, 159 (1995).\nK. O. Cheon, I. R. Fisher, and P. C. Canfield, Physica C\n(Amsterdam) 312, 35 (1995).\nP. Martı́nez-Samper, H. Suderow, S. Vieira, J. P. Brison,\nN. Luchier, P. Lejay, and P. C. Canfield, Phys. Rev. B 67,\n014526 (2003).\nP. Dervenagas, M. Bullock, J. Zarestky, P. Canfield, B. K.\nCho, B. Harmon, A. I. Goldman, and C. Stassis, Phys.\nRev. B 52, R9839 (1995).\nM. Bullock, J. Zarestky, C. Stassis, A. Goldman, P. Canfield, Z. Honda, G. Shirane, and S. M. Shapiro, Phys. Rev.\n\n\f10\n\n42\n\n43\n\n44\n\n45\n\n46\n\n47\n\n48\n\n49\n\n50\n\n51\n\n52\n\n53\n\nB 57, 7916 (1998).\nJ. Zarestky, C. Stassis, A. Goldman, P. Canfield, G. Shirane, and S. Shapiro, Phys. Rev. B 60, 11932 (1999).\nW. K. Park and L. H. Greene, J. Phys.: Condens. Matter\n21, 103203 (2009).\nW. K. Park, J. L. Sarrao, J. D. Thompson, and L. H.\nGreene, Phys. Rev. Lett. 100, 177001 (2008).\nP. Raychaudhuri, D. Jaiswal-Nagar, G. Sheet, S. Ramakrishnan, and H. Takeya, Phys. Rev. Lett. 93, 156802 (2004).\nS. Mukhopadhyay, G. Sheet, P. Raychaudhuri, and\nH. Takeya, Phys. Rev. B 72, 014545 (2005).\nY. G. Naidyuk, D. L. Bashlakov, I. K. Yanson, G. Fuchs,\nG. Behr, D. Souptel, and S. L. Drechsler, Physica C (Amsterdam) 460-462, 103 (2007).\nY. G. Naidyuk, D. L. Bashlakov, N. L. Bobrov, V. N. Chernobay, O. E. Kvitnitskaya, I. K. Yanson, G. Behr, S. L. sler,\nG. Fuchs, D. Souptel, et al., Physica C (Amsterdam) 460,\n107 (2007).\nN. L. Bobrov, S. I. Beloborod'ko, L. V. Tyutrina, I. K.\nYanson, D. G. Naugle, and K. D. D. Rathnayaka, Phys.\nRev. B 71, 014512 (2005).\nD. L. Bashlakov, Y. G. Naidyuk, I. K. Yanson, S. C. Wimbush, B. Holzapfel, G. Fuchs, and S. L. Drechsler, Supercond. Sci. Technol. 18, 1094 (2005).\nD. L. Bashlakov, Y. G. Naidyuk, I. K. Yanson, G. Behr,\nS. L. Drechsler, G. Fuchs, L. Schultz, and D. Souptel, J.\nLow Temp. Phys. 147, 335 (2007).\nX. Lu, W. K. Park, J. D. Kim, S. Yeo, S. I. Lee, and L. H.\nGreene, Physica B (Amsterdam) 403, 1098 (2008).\nM. Xu, P. C. Canfield, J. E. Ostenson, D. K. Finnemore,\nB. K. Cho, Z. R. Wang, and D. C. Johnston, Physica C\n\n54\n\n55\n\n56\n57\n\n58\n\n59\n\n60\n\n61\n\n62\n\n63\n64\n\n65\n\n66\n67\n\n68\n\n(Amsterdam) 227, 321 (1994).\nP. C. Canfield and I. R. Fisher, J. Cryst. Growth 225, 155\n(2001).\nW. K. Park, L. H. Greene, J. L. Sarrao, and J. D. Thompson, Physica C (Amsterdam) 460-462, 206 (2007).\nG. Wexler, Proc. Phys. Soc. London 89, 927 (1966).\nG. E. Blonder, M. Tinkham, and T. M. Klapwijk, Phys.\nRev. B 25, 4515 (1982).\nA. Plecenı́k, M. Grajcar, i. c. v. Beňačka, P. Seidel, and\nA. Pfuch, Phys. Rev. B 49, 10016 (1994).\nT. Ekino, H. Fujii, M. Kosugi, Y. Zenitani, and J. Akimitsu, Phys. Rev. B 53, 5640 (1996).\nP. Szabo, P. Samuely, J. Kacmarcik, T. Klein, J. Marcus, D. Fruchart, S. Miraglia, C. Marcenat, and A. G. M.\nJansen, Phys. Rev. Lett. 87, 137005 (2001).\nW. K. Park and L. H. Greene, Rev. Sci. Instrum. 77,\n023905 (2006).\nT. Baba, T. Yokoya, S. Tsuda, T. Watanabe, M. Nohara,\nH. T. T. Oguchi, and S. Shin, arXiv:0812.0406 (2008).\nG. Beuermann, Z. Phys. B 44, 29 (1981).\nE. L. Wolf, Principles of electron tunneling spectroscopy\n(1985).\nS. Kashiwaya, Y. Tanaka, M. Koyanagi, and K. Kajimura,\nPhys. Rev. B 53, 2667 (1996).\nK. Kamata, Master thesis, University of Tokyo (2003).\nM. Nohara, M. Isshiki, F. Sakai, and H. Takagi, J. Phys.\nSoc. Jpn. 68, 1078 (1999).\nQ. Yuan, H.-Y. Chen, H. Won, S. Lee, K. Maki,\nP. Thalmeier, and C. S. Ting, Phys. Rev. B 68, 174510\n(2003).\n\n\f"}