{"id": "http://arxiv.org/abs/1008.3405v1", "guidislink": true, "updated": "2010-08-19T22:24:51Z", "updated_parsed": [2010, 8, 19, 22, 24, 51, 3, 231, 0], "published": "2010-08-19T22:24:51Z", "published_parsed": [2010, 8, 19, 22, 24, 51, 3, 231, 0], "title": "Duality-based Asymptotic-Preserving method for highly anisotropic\n  diffusion equations", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1008.0694%2C1008.2450%2C1008.4892%2C1008.1514%2C1008.5256%2C1008.0352%2C1008.1998%2C1008.3112%2C1008.4570%2C1008.4849%2C1008.1553%2C1008.4497%2C1008.2472%2C1008.3115%2C1008.4948%2C1008.1564%2C1008.0473%2C1008.5365%2C1008.2194%2C1008.1757%2C1008.1801%2C1008.4225%2C1008.0860%2C1008.3323%2C1008.2861%2C1008.3728%2C1008.3827%2C1008.5178%2C1008.4845%2C1008.0748%2C1008.0669%2C1008.2500%2C1008.1537%2C1008.2582%2C1008.0229%2C1008.0240%2C1008.3885%2C1008.0183%2C1008.2552%2C1008.3667%2C1008.2513%2C1008.4930%2C1008.1956%2C1008.1852%2C1008.2504%2C1008.0681%2C1008.3999%2C1008.4136%2C1008.0739%2C1008.0074%2C1008.1337%2C1008.1145%2C1008.4781%2C1008.5175%2C1008.1803%2C1008.4011%2C1008.1013%2C1008.2865%2C1008.3381%2C1008.2289%2C1008.1079%2C1008.4544%2C1008.0277%2C1008.4633%2C1008.4330%2C1008.0717%2C1008.4341%2C1008.2096%2C1008.0008%2C1008.0060%2C1008.1539%2C1008.4828%2C1008.1452%2C1008.3675%2C1008.4578%2C1008.1347%2C1008.4902%2C1008.1567%2C1008.3305%2C1008.2553%2C1008.3760%2C1008.0128%2C1008.3918%2C1008.4620%2C1008.3070%2C1008.4605%2C1008.3532%2C1008.1228%2C1008.1426%2C1008.1797%2C1008.4493%2C1008.1903%2C1008.2044%2C1008.4188%2C1008.0852%2C1008.1008%2C1008.3405%2C1008.0807%2C1008.4220%2C1008.1219%2C1008.2580&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Duality-based Asymptotic-Preserving method for highly anisotropic\n  diffusion equations"}, "summary": "The present paper introduces an efficient and accurate numerical scheme for\nthe solution of a highly anisotropic elliptic equation, the anisotropy\ndirection being given by a variable vector field. This scheme is based on an\nasymptotic preserving reformulation of the original system, permitting an\naccurate resolution independently of the anisotropy strength and without the\nneed of a mesh adapted to this anisotropy. The counterpart of this original\nprocedure is the larger system size, enlarged by adding auxiliary variables and\nLagrange multipliers. This Asymptotic-Preserving method generalizes the method\ninvestigated in a previous paper [arXiv:0903.4984v2] to the case of an\narbitrary anisotropy direction field.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1008.0694%2C1008.2450%2C1008.4892%2C1008.1514%2C1008.5256%2C1008.0352%2C1008.1998%2C1008.3112%2C1008.4570%2C1008.4849%2C1008.1553%2C1008.4497%2C1008.2472%2C1008.3115%2C1008.4948%2C1008.1564%2C1008.0473%2C1008.5365%2C1008.2194%2C1008.1757%2C1008.1801%2C1008.4225%2C1008.0860%2C1008.3323%2C1008.2861%2C1008.3728%2C1008.3827%2C1008.5178%2C1008.4845%2C1008.0748%2C1008.0669%2C1008.2500%2C1008.1537%2C1008.2582%2C1008.0229%2C1008.0240%2C1008.3885%2C1008.0183%2C1008.2552%2C1008.3667%2C1008.2513%2C1008.4930%2C1008.1956%2C1008.1852%2C1008.2504%2C1008.0681%2C1008.3999%2C1008.4136%2C1008.0739%2C1008.0074%2C1008.1337%2C1008.1145%2C1008.4781%2C1008.5175%2C1008.1803%2C1008.4011%2C1008.1013%2C1008.2865%2C1008.3381%2C1008.2289%2C1008.1079%2C1008.4544%2C1008.0277%2C1008.4633%2C1008.4330%2C1008.0717%2C1008.4341%2C1008.2096%2C1008.0008%2C1008.0060%2C1008.1539%2C1008.4828%2C1008.1452%2C1008.3675%2C1008.4578%2C1008.1347%2C1008.4902%2C1008.1567%2C1008.3305%2C1008.2553%2C1008.3760%2C1008.0128%2C1008.3918%2C1008.4620%2C1008.3070%2C1008.4605%2C1008.3532%2C1008.1228%2C1008.1426%2C1008.1797%2C1008.4493%2C1008.1903%2C1008.2044%2C1008.4188%2C1008.0852%2C1008.1008%2C1008.3405%2C1008.0807%2C1008.4220%2C1008.1219%2C1008.2580&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The present paper introduces an efficient and accurate numerical scheme for\nthe solution of a highly anisotropic elliptic equation, the anisotropy\ndirection being given by a variable vector field. This scheme is based on an\nasymptotic preserving reformulation of the original system, permitting an\naccurate resolution independently of the anisotropy strength and without the\nneed of a mesh adapted to this anisotropy. The counterpart of this original\nprocedure is the larger system size, enlarged by adding auxiliary variables and\nLagrange multipliers. This Asymptotic-Preserving method generalizes the method\ninvestigated in a previous paper [arXiv:0903.4984v2] to the case of an\narbitrary anisotropy direction field."}, "authors": ["Pierre Degond", "Fabrice Deluzet", "Alexei Lozinski", "Jacek Narski", "Claudia Negulescu"], "author_detail": {"name": "Claudia Negulescu"}, "author": "Claudia Negulescu", "links": [{"title": "doi", "href": "http://dx.doi.org/10.4310/CMS.2012.v10.n1.a2", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1008.3405v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1008.3405v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.NA", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.NA", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1008.3405v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1008.3405v1", "arxiv_comment": null, "journal_reference": "Communications in Mathematical Sciences, 10 (2012), pp. 1-31", "doi": "10.4310/CMS.2012.v10.n1.a2", "fulltext": "DUALITY-BASED ASYMPTOTIC-PRESERVING METHOD FOR HIGHLY\nANISOTROPIC DIFFUSION EQUATIONS\nPIERRE DEGOND† ‡ , FABRICE DELUZET† ‡ , ALEXEI LOZINSKI† , JACEK NARSKI† , AND CLAUDIA\n\narXiv:1008.3405v1 [math.NA] 19 Aug 2010\n\nNEGULESCU§\nAbstract. The present paper introduces an efficient and accurate numerical scheme for the solution of a highly\nanisotropic elliptic equation, the anisotropy direction being given by a variable vector field. This scheme is based on\nan asymptotic preserving reformulation of the original system, permitting an accurate resolution independently of the\nanisotropy strength and without the need of a mesh adapted to this anisotropy. The counterpart of this original procedure\nis the larger system size, enlarged by adding auxiliary variables and Lagrange multipliers. This Asymptotic-Preserving\nmethod generalizes the method investigated in a previous paper [11] to the case of an arbitrary anisotropy direction field.\n\n1. Introduction\nAnisotropic problems are common in mathematical modeling of physical problems. They occur in\nvarious fields of applications such as flows in porous media [3, 20], semiconductor modeling [29], quasineutral plasma simulations [10], image processing [37, 38], atmospheric or oceanic flows [36] and so on,\nthe list being not exhaustive. The initial motivation for this work is closely related to magnetized plasma\nsimulations such as atmospheric plasma [24, 26], internal fusion plasma [4, 12] or plasma thrusters [1].\nIn this context, the media is structured by the magnetic field, which may be strong in some regions and\nweak in others. Indeed, the gyration of the charged particles around magnetic field lines dominates the\nmotion in the plane perpendicular to magnetic field. This explains the large number of collisions in the\nperpendicular plane while the motion along the field lines is rather undisturbed. As a consequence the\nmobility of particles in different directions differs by many orders of magnitude. This ratio can be as\nhuge as 1010 . On the other hand, when the magnetic field is weak the anisotropy is much smaller. As\nthe regions with weak and strong magnetic field can coexist in the same computational domain, one\nneeds a numerical scheme which gives accurate results for a large range of anisotropy strengths. The\nrelevant boundary conditions in many fields of application are periodic (for instance in simulations of\nthe tokamak plasmas on a torus) or Neumann boundary conditions (atmospheric plasma for example\n[5]). For these reasons we propose a strongly anisotropic model problem for wich we wish to introduce\nan efficient and accurate numerical scheme. This model problem reads\n\n−∇ * A∇φε = f in Ω,\n\n\n\n\nn * A∇φε = 0\non ∂ΩN ,\n(1.1)\n\n\n\n φε = 0\non ∂ΩD ,\n\nwhere Ω ⊂ R2 or Ω ⊂ R3 is a bounded domain with boundary ∂Ω = ∂ΩD ∪ ∂ΩN and outward normal n.\nThe direction of the anisotropy is defined by a vector field B, where we suppose divB = 0 and B 6= 0.\nThe direction of B is given by a vector field b = B/|B|. The anisotropy matrix is then defined as\n1\nA = Ak b ⊗ b + (Id − b ⊗ b)A⊥ (Id − b ⊗ b)\nε\n\n(1.2)\n\nand ∂ΩD = {x ∈ ∂Ω | b(x) * n = 0}. The scalar field Ak > 0 and the symmetric positive definite matrix\nfield A⊥ are of order one while the parameter 0 < ε < 1 can be very small, provoking thus the high\nanisotropy of the problem. This work extends the results of [11], where the special case of a vector field\nb, aligned with the z-axis, was studied. An extension of this approach is proposed in [6] to handle more\n† Université\n\nde Toulouse, UPS, INSA, UT1, UTM, Institut de Mathématiques de Toulouse, F-31062 Toulouse, France\nInstitut de Mathématiques de Toulouse UMR 5219, F-31062 Toulouse, France\n§ CMI/LATP, Université de Provence, 39 rue Frédéric Joliot-Curie 13453 Marseille cedex 13\n‡ CNRS,\n\n1\n\n\frealistic anisotropy topologies. It relies on the introduction of a curvilinear coordinate system with one\ncoordinate aligned with the anisotropy direction. Adapted coordinates are widely used in the framework\nof plasma simulation (see for instance [4, 14, 31]), coordinate systems being either developped to fit\nparticular magnetic field geometry or plasma equilibrium (Euler potentials [35], toroidal and poloidal\n[18, 23], quasiballooning [15], Hamada [19] and Boozer [7] coordinates). Note that the study of certain\nplasma regions in a tokamak have motivated the use of non-orthogonal coordinates systems [21]. In\ncontrast with all these methods, we propose here a numerical scheme that uses coordinates and meshes\nindependent of the anisotropy direction, like in [33]. This feature offers the capability to easily treat time\nevolving anisotropy directions. This is very important in the context of tokamak plasma simulation,\nthe anisotropy being driven by the magnetic field which is time dependent.\nOne of the difficulties associated with the numerical solution of problem (1.1) lies in the fact that\nthis problem becomes very ill-conditioned for small 0 < ε ≪ 1. Indeed, replacing ε by zero yields an\nill-posed problem as it has an infinite number of solutions (any function constant along the b field\nsolves the problem with ε = 0). In the discrete case the problem translates into a linear system which\nis ill-conditioned, as it mixes the terms of different orders of magnitude for ε ≪ 1. As a consequence\nthe numerical algorithm for solving this linear system gives unacceptable errors (in the case of direct\nsolvers) or fails to converge in a reasonable time (in the case of iterative methods).\nThis difficulty arises when the boundary conditions supplied to the dominant O(1/ε) operator\nlead to an ill-posed problem. This is the case for Neumann boundary conditions imposed on the part\nof the boundary with b * n 6= 0 as well as for periodic boundary conditions. If instead, the boundary\nconditions are such that the dominant operator gives a well-posed problem, the numerical difficulty\nvanishes. One can resort to standard methods, as the dominant operator is sufficient to determine the\nlimit solution. This is the case for Dirichlet and Robin boundary conditions. The problem addressed\nin this paper arises therefore only with specific boundary conditions. It has however a considerable\nimpact in numerous physical problems concerning plasmas, geophysical flows, plates and shells as an\nexample. In this paper, we will focus on Neumann boundary condition since they represent a larger\nrange of physical applications. The periodic boundary conditions can be addressed in a very similar\nway.\nNumerical methods for anisotropic problems have been extensively studied in the literature. Distinct methods have been developed. Domain decomposition techniques using multiple coarse grid\ncorrections are adapted to the anisotropic equations in [17, 27]. Multigrid methods have been studied\nin [16, 32]. For anisotropy aligned with one or two directions, point or plane smoothers are shown to\nbe very efficient [28]. The hp-finite element method is also known to give good results for singular perturbation problems [30]. All these methods have in common that they try to discretize the anisotropic\nPDE as it is written and then to apply purely numerical tricks to circumvent the problems related to\nlack of accuracy of the discrete solution or to the slow convergence of iterative algorithms. This leads\nto methods which are rather difficult to implement.\nThe approach that we pursue in this paper is entirely different: we reformulate first the original\nPDE in such a way that the resulting problem can be efficiently and accurately discretized by straightforward and easily implementable numerical methods for any anisotropy strength. Our scheme is related\nto the Asymptotic Preserving method introduced in [22]. These techniques are designed to give a precise\nsolution in the various regimes with no restrictions on the computational meshes and with additional\nproperty of converging to the limit solution when ε → 0. The derivation of the Asymptotic Preserving\nmethod requires identification of the limit model. In the case of Singular Perturbation problems, the\noriginal problem is reformulated in such a way that the obtained set of equations contain both the limit\nmodel and the original problem with a continuous transition between them, according to the values\nof ε. This reformulated system of equation sets the foundation of the AP-scheme. These Asymptotic\nPreserving techniques have been explored in previous studies, for instance quasi-neutral or gyro-fluid\nlimits [9, 12], as well as anisotropic elliptic problems of the form (1.1) with vector b aligned with a\n2\n\n\fcoordinate axis [11, 6].\nIn this paper, we present a new algorithm which extends the results of [11]. The originality of\nthis algorithm consists in the fact, that it is applicable for variable anisotropy directions b, without\nadditional work. The discretization mesh has not to be adapted to the field direction b, but is simply a\nCartesian grid, whose mesh-size is governed by the desired accuracy, independently on the anisotropy\nstrength ε. All this is possible by a well-adapted mathematical framework (optimally chosen spaces,\nintroduction of Lagrange multipliers). The key idea, as in [11], is to decompose the solution φ into\ntwo parts: a mean part p which is constant along the field lines and the fluctuation part q consisting\nof a correction to the mean part needed to recover the full solution. Both parts p and q are solutions\nto well-posed problems for any ε > 0. In the limit of ε → 0 the AP-reformulation reduces to the so\ncalled Limit model (L-model), whose solution is an acceptable approximation of the P-model solution\nfor ε ≪ 1 (see Theorem 2.2). In [11] the Asymptotic Preserving reformulation of the original problem\nwas obtained in two steps. Firstly, the original problem was integrated along the field lines (z-axis)\nleading to an ε-independent elliptic problem for the mean part p. Secondly, the mean equation was\nsubtracted from the original problem and the ε-dependent elliptic problem for the fluctuating part\nq was obtained. This approach however is not applicable if the field b is arbitrary. In this paper we\npresent a new approach. Instead of integrating the original problem along the arbitrary field lines, we\nchoose to force the mean part p to lie in the Hilbert space of functions constant along the field lines\nand the fluctuating part q to be orthogonal (in L2 sense) to this space. This is done by a Lagrange\nmultiplier technique and requires introduction of additional variables thus enlarging the linear system\nto be solved. This method allows to treat the arbitrary b field case, regardless of the field topology\nand thus eliminates the limitations of the algorithm presented in [11]. We note that an alternative\nmethod, bypassing the need in Lagrange multipliers, is proposed in [8]. It is based on a reformulation\nof the original problem as a fourth order equation.\nThe outline of this paper is the following. Section 2 introduces the original anisotropic elliptic\nproblem. The original problem will be referred to as the Singular-Perturbation model (P-model). The\nmathematical framework is introduced and the Asymptotic Preserving reformulation (AP-model) is\nthen derived. Section 3 is devoted to the numerical implementation of the AP-formulation. Numerical\nresults are presented for 2D and 3D test cases, for constant and variable fields b. Three methods are\ncompared (AP-formulation, P-model and L-model) according to their precision for different values of ε.\nThe rigorous numerical analysis of this new algorithm will be the subject of a forthcoming publication.\n2. Problem definition\nWe consider a two or three dimensional anisotropic problem, given on a sufficiently smooth, bounded\ndomain Ω ⊂ Rd, d = 2,3 with boundary ∂Ω. The direction of the anisotropy is defined by the vector\nfield b ∈ (C ∞ (Ω))d , satisfying |b(x)| = 1 for all x ∈ Ω.\nGiven this vector field b, one can decompose now vectors v ∈ Rd , gradients ∇φ, with φ(x) a scalar\nfunction, and divergences ∇ * v, with v(x) a vector field, into a part parallel to the anisotropy direction\nand a part perpendicular to it. These parts are defined as follows:\nv|| := (v * b)b,\n\nv⊥ := (Id − b ⊗ b)v ,\n\nsuch that v = v|| + v⊥ ,\n\n∇|| φ := (b * ∇φ)b, ∇⊥ φ := (Id − b ⊗ b)∇φ, such that ∇φ = ∇|| φ + ∇⊥ φ,\n∇|| * v := ∇ * v|| ,\n\n∇⊥ * v := ∇ * v⊥ ,\n\n(2.1)\n\nsuch that ∇ * v = ∇|| * v + ∇⊥ * v ,\n\nwhere we denoted by ⊗ the vector tensor product. With these notations we can now introduce the\nmathematical problem, the so-called Singular Perturbation problem, whose numerical solution is the\nmain concern of this paper.\n3\n\n\f2.1. The Singular Perturbation problem (P-model) We consider the following Singular\nPerturbation problem\n 1\n\u0001\n− ε ∇k * Ak ∇k φε − ∇⊥ * (A⊥ ∇⊥ φε ) = f in Ω,\n\n\n\n\n\u0001\non ∂ΩN ,\n(2.2)\n(P ) 1ε nk * Ak ∇k φε + n⊥ * (A⊥ ∇⊥ φε ) = 0\n\n\n\n ε\nφ =0\non ∂ΩD ,\nwhere n is the outward normal to Ω and the boundaries are defined by\n∂ΩD = {x ∈ ∂Ω | b(x) * n = 0},\n\n∂ΩN = ∂Ω \\ ∂ΩD .\n\n(2.3)\n\nThe parameter 0 < ε < 1 can be very small and is responsible for the high anisotropy of the problem.\nThe aim is to introduce a numerical scheme, whose computational costs (simulation time and memory),\nfor fixed precision, are independent of ε.\nWe shall assume in the rest of this paper the following hypothesis on the diffusion coefficients and the\nsource terms\n◦\n\nHypothesis A Let f ∈ L2 (Ω) and ∂ΩD 6= ∅.\nMd×d (L∞ (Ω)) are supposed to satisfy\n\nThe diffusion coefficients Ak ∈ L∞ (Ω) and A⊥ ∈\n\n0 < A0 ≤ Ak (x) ≤ A1 ,\nA0 ||v||2 ≤ v t A⊥ (x)v ≤ A1 ||v||2 ,\n\nf.a.a. x ∈ Ω,\n∀v ∈ Rd and f.a.a. x ∈ Ω.\n\n(2.4)\n(2.5)\n\nAs we intend to use the finite element method for the numerical solution of the P-problem, let us put\n(2.2) under variational form. For this let V be the Hilbert space\nV := {φ ∈ H 1 (Ω) / φ|∂ΩD = 0},\n\n(φ,ψ)V := (∇|| φ,∇|| ψ)L2 + ε(∇⊥ φ,∇⊥ ψ)L2 .\n\nThus, we are seaking for φε ∈ V, the solution of\na|| (φε ,ψ) + εa⊥ (φε ,ψ) = ε(f,ψ),\n\n∀ψ ∈ V ,\n\n(2.6)\n\nwhere (*,*) stands for the standard L2 inner product and the continuous bilinear forms a|| : V × V → R\nand a⊥ : V × V → R are given by\nZ\nZ\nA|| ∇|| φ * ∇|| ψ dx, a⊥ (φ,ψ) := (A⊥ ∇⊥ φ) * ∇⊥ ψ dx.\na|| (φ,ψ) :=\n(2.7)\nΩ\n\nΩ\n\nThanks to Hypothesis A and the Lax-Milgram theorem, problem (2.2) admits a unique solution φε ∈ V\nfor all fixed ε > 0.\n2.2. The Limit problem (L-model)\nThe direct numerical solution of (2.2) may be very\ninaccurate for ε ≪ 1. Indeed, when ε tends to zero, the system reduces to\n\n\u0001\n−∇k * Ak ∇k φ = 0 in Ω,\n\n\n\n\n\u0001\nnk * Ak ∇k φ = 0\non ∂ΩN ,\n(2.8)\n\n\n\n\nφ=0\non ∂ΩD .\n4\n\n\fThis is an ill-posed problem as it has an infinite number of solutions φ ∈ G, where\nG = {φ ∈ V | ∇k φ = 0},\n\n(2.9)\n\nis the Hilbert space of functions, which are constant along the field lines of b. This shows that the\ncondition number of the system obtained by discretizing (2.2) tends to ∞ as ε → 0 so that its solution\nwill suffer from round-off errors.\nFor this reason, we should approximate (2.2) in the limit ε → 0 differently. Supposing that φε → φ0\nas ε → 0 we identify (at first formally) the problem satisfied by φ0 . From the above arguments we know\nthat φ0 ∈ G. Taking now test functions ψ ∈ G in (2.6), we obtain\nZ\nZ\n(2.10)\nA⊥ ∇⊥ φε * ∇⊥ ψ dx = f ψ dx.\nΩ\n\nΩ\n\nPassing to the limit ε → 0 into this equation yields the variational formulation of the problem satisfied\nby φ0 (Limit problem): find φ0 ∈ G, the solution of\nZ\nZ\n0\n(2.11)\nA⊥ ∇⊥ φ * ∇⊥ ψ dx = f ψ dx , ∀ψ ∈ G ,\n(L)\nΩ\n\nΩ\n\nwhich is a well posed problem. Indeed, the space G ⊂ V is a Hilbert space, associated with the inner\nproduct\n(φ,ψ)G := (∇⊥ φ,∇⊥ ψ)L2 ,\n\n∀φ,ψ ∈ G ,\n\n(2.12)\n\nand the norm || * ||G is equivalent to the H 1 norm. This is due to the Poincaré inequality, as\n||φ||2L2 ≤ C||∇φ||2L2 = C||∇|| φ||2L2 + C||∇⊥ φ||2L2 = C||∇⊥ φ||2L2 ,\n\n∀φ ∈ G .\n\nHypothesis A and the Lax-Milgram lemma imply the existence and uniqueness of a solution φ0 ∈ G of\nthe Limit problem (2.11).\nRemark 2.1. Let us restrict ourselves for the moment to the simple special case (considered in a previous paper [11]) of the two dimensional domain Ω = (0,Lx) × (0,Lz ) in the (x,z) plane with a constant\nb-field aligned with the Z-axis:\n\u0012 \u0013\n0\nb=\n.\n(2.13)\n1\nThe functions in the space G are independent of z so that G can be identified to H01 (0,Lx ). The limit\nproblem (2.11) now reads: Find φ0 in H01 (0,Lx ) verifying\nZ\n\n0\n\nLx\n\n0\n\nĀ⊥ (x)∂x φ (x)∂x ψ(x)dx =\n\nZ\n\nLx\n\n0\n\nf ̄(x)ψ(x)dx,\n\n∀ψ ∈ H01 (0,Lx ),\n\nRL\nRL\nwhere Ā⊥ (x) = (1/Lz ) 0 z A⊥,11 (x,z)dz and f ̄(x) = (1/Lz ) 0 z f (x,z)dz are the mean values of A⊥ and\nf along the field lines. The limit solution φ0 thus verifies a one-dimensional elliptic equation whose\ncoefficients are integrated along the anisotropy direction:\n\u0010\n\u0011\n− ∂x Ā⊥ (x)∂x φ0 (x) = f ̄(x) on (0,Lx ),\n(2.14)\nφ0 (0) = φ0 (Lx ) = 0.\n5\n\n\fWe see now that φ0 (x) is a solution to the one dimensional elliptic problem so that it belongs to\nH (0,Lx ) provided f ∈ L2 (Ω). Since φ0 as a function of (x,z) does not depend on z, we have also\nφ0 ∈ H 2 (Ω). This conclusion (φ0 ∈ H 2 (Ω)) remains valid in the case of a cylindrical three dimensional\ndomain Ω = Ωxy × (0,Lz ) in the (x,y,z) space with any sufficiently smooth Ωxy in the (x,y) plane and the\nfield b aligned with the Z-axis, b = (0,0,1)t. Indeed, it is easy to see that φ0 = φ0 (x,y) solves in this case\nan elliptic two dimensional problem in Ωxy similar to (2.14) so that we can apply the standard regularity\nresults for the elliptic problems. These examples show that it is reasonable to suppose φ0 ∈ H 2 (Ω) also\nin more general geometries of Ω and b. This can be indeed proved under the hypotheses in Appendix\nA by specifying the (d − 1) dimensional elliptic problem for φ0 . The proof being rather lengthy and\ntechnical, we prefer to postpone it to a forthcoming work [13].\n2\n\n2.3. The Asymptotic Preserving approach (AP-model) In this section we introduce the\nAP-formulation, which is a reformulation of the Singular Perturbation problem (2.2), permitting a\n\"continuous\" transition from the (P)-problem (2.2) to the (L)-problem (2.11), as ε → 0. For this purpose,\neach function is decomposed into its mean part along the anisotropy direction (lying in the subspace G\nof V) and a fluctuating part (cf. [11]) lying in the L2 -orthogonal complement A of G in V, defined by\nA := {φ ∈ V |(φ,ψ) = 0 , ∀ψ ∈ G}.\n\n(2.15)\n\nNote that (*,*) denote here and elsewhere the inner product of L2 (Ω).\nIn what follows, we need the following\nHypothesis B The Hilbert-space V admits the decomposition\nV = G ⊕⊥ A,\n\n(2.16)\n\nwith G given by (2.9) and A given by (2.15) and where the orthogonality of the direct sum is taken with\nrespect to the L2 -norm. Denoting by P the orthogonal projection on G with respect to the L2 inner\nproduct:\nP : V → G such that (P φ,ψ) = (φ,ψ) ∀φ ∈ V, ψ ∈ G ,\n\n(2.17)\n\nwe shall suppose that this mapping is continuous and that we have the Poincaré-Wirtinger inequality\n||φ − P φ||L2 (Ω) ≤ C||∇|| φ||L2 (Ω) ,\n\n∀φ ∈ V .\n\n(2.18)\n\nApplying the projection P to a function φ is nothing but a weighted average of φ along the anisotropy\nfield lines of b. The space G is the space of averaged functions (the parallel Gradient of these averaged\nfunctions being equal to zero), whereas the space A is the space of the fluctuations (the Average of the\nfluctuations being equal to zero). Note that the decomposition (2.16) is not self evident and it may in\nfact fail on some \"pathological\" domains Ω. Indeed, although one can always define an L2 -orthogonal\nprojection P̃ φ on the space of functions constant along each field line, for any φ with square-integrable\n∇|| φ, one cannot assure in general that P̃ φ belongs to V for φ ∈ V since one may lose control of the\nperpendicular part of the gradient of P̃ φ. Fortunately however, Hypothesis B is typically satisfied for\nthe domains of practical interest. The interested reader is referred to Appendix A for an example of a set\nof assumptions on Ω and b which entail Hypothesis B and which resume essentially to the requirement\nfor the field b to intersect ∂ΩN in a uniformly non-tangential manner and for the boundary components\n∂ΩN and ∂ΩD to be sufficiently smooth.\nLet us also define the operator\nQ : V → A,\n\nQ = I −P .\n6\n\n(2.19)\n\n\fEach function φ ∈ V can be decomposed uniquely as φ = p + q, where p = P φ ∈ G and q = Qφ ∈ A. Using\nthis decomposition, we reformulate the Singular-Perturbation problem (2.2). Indeed, replacing φε :=\npε + q ε in problem (2.2) and taking test functions η ∈ G and ξ ∈ A leads to an asymptotic preserving\nformulation of the original problem: Find (pε ,q ε ) ∈ G × A such that\n(\n\na⊥ (pε ,η) + a⊥ (q ε ,η) = (f,η)\n\n∀η ∈ G,\n\na|| (q ε ,ξ) + εa⊥ (q ε ,ξ) + εa⊥ (pε ,ξ) = ε(f,ξ) ∀ξ ∈ A.\n\n(2.20)\n\nContrary to the Singular Perturbation problem (2.2), setting formally ε = 0 in (2.20) yields the system\n(\n\na⊥ (p0 ,η) + a⊥ (q 0 ,η) = (f,η),\na|| (q 0 ,ξ)\n\n= 0,\n\n∀η ∈ G\n(2.21)\n\n∀ξ ∈ A,\n\nwhich has a unique solution (p0 ,q 0 ) ∈ G × A, where p0 is the unique solution of the L-problem (2.11) and\nq 0 ≡ 0. Indeed, taking ξ = q 0 as test function in the second equation of (2.21) yields ∇|| q 0 = 0, which\nmeans q 0 ∈ G. But at the same time, q 0 ∈ A, so that q 0 ∈ G ∩ A = {0}. Setting then q 0 ≡ 0 in the first\nequation of (2.21), shows that p0 is the unique solution of the L-problem.\nTheorem 2.2. For every ε > 0 the Asymptotic Preserving formulation (2.20), under Hypotheses A\nand B, admits a unique solution (pε ,q ε ) ∈ G × A, where φε := pε + q ε is the unique solution in V of the\nSingular Perturbation model (2.2).\nThese solutions satisfy the bounds\n||φε ||H 1 (Ω) ≤ C||f ||L2 (Ω) ,\n\n||q ε ||H 1 (Ω) ≤ C||f ||L2 (Ω) ,\n\n||pε ||H 1 (Ω) ≤ C||f ||L2 (Ω) ,\n\n(2.22)\n\nwith an ε-independent constant C > 0. Moreover, we have\nφε → φ0 , pε → φ0 and\n\nqε → 0\n\nin\n\nH 1 (Ω) as ε → 0,\n\n(2.23)\n\nwhere φ0 ∈ G is the unique solution of the Limit model (2.11).\nProof. The existence and uniqueness of a solution for the P-problem as well as L-problem are\nconsequences of the Lax-Milgram theorem. The existence and uniqueness of a solution of (2.20) is then\nimmediate by construction, remarking that the decomposition φε = pε + q ε is unique.\nThe bound ||φε ||H 1 (Ω) ≤ C||f ||L2 (Ω) is obtained by a standard elliptic argument. Furthermore, pε = P φε\nwhere P is the L2 -orthogonal projector on G, which is a bounded operator in V by (1.4). This implies\nthe estimates for pε and q ε in (2.22). Since pε ∈ G and q ε ∈ A are bounded, there exist subsequences\npεn and q εn that weakly converge for εn → 0 to some p0 ∈ G and q 0 ∈ A. Taking ε = εn in (2.20) and\npassing to the limit εn → 0 we identify (p0 ,q 0 ) with the unique solution of (2.21), i.e. p0 = φ0 is the\nunique solution of (2.11) and q 0 ≡ 0. Since the limit does not depend on the choice of the subsequence,\nwe have the weak convergence as ε → 0, i.e.\npε ⇀ε→0 p0\n\nin H 1 (Ω),\n\nq ε ⇀ε→0 0\n\nin H 1 (Ω).\n\nWe shall prove now that these convergences are actually strong. Introducing eε = pε − p0 , we have\na⊥ (eε ,η) + a⊥ (q ε ,η) = 0, ∀η ∈ G .\nTaking now η = eε in this relation and adding it to the second equation in (2.20), where we put ξ = q ε /ε,\nyields\n1\na|| (q ε ,q ε ) + a⊥ (q ε + eε ,q ε + eε ) = (f,q ε ) − a⊥ (p0 ,q ε ).\nε\n7\n\n(2.24)\n\n\fDue to the Poincaré-Wirtinger equation (2.18), there exist a constant C > 0 such that\n||q||L2 (Ω) ≤ Ca|| (q,q)1/2 ,\n\n∀q ∈ A.\n\n(2.25)\n2\n\n1\na|| (q ǫ ,q ǫ ). UsIn combination with a Young inequality this gives (f,q ε ) ≤ ||f ||L2 ||q ε ||L2 ≤ ε C2 ||f ||2L2 + 2ε\ning this in the right hand side of (2.24), we arrive at\n\n1\nC2\na|| (q ε ,q ε ) + a⊥ (q ε + eε ,q ε + eε ) ≤ ε ||f ||2L2 − a⊥ (p0 ,q ε ).\n2ε\n2\nNoting that q ε + eε = φε − p0 and ∇k eε = 0 we can rewrite this last inequality as\n1\nC2\na|| (φε − p0 ,φε − p0 ) + a⊥ (φε − p0 ,φε − p0 ) ≤ ε ||f ||2L2 − a⊥ (p0 ,q ε ).\n2ε\n2\nSince a⊥ (p0 ,q ε ) → 0 as ε → 0 (thanks to the weak convergence q ε ⇀ 0) we observe that φε → p0 strongly\nin H 1 (Ω). Reminding again that pε = P φε and P is bounded in the norm of H 1 (Ω), we obtain also\npε → P p0 = p0 , which entails q ε → 0.\nRemark 2.3. Let us return to the simple special case discussed in remark 2.1, i.e. Ω = (0,Lx) × (0,Lz )\nand the b-field given by (2.13). Remind that the space G can be identified in this case with the space\nof functions constant along the Z-axis, which means G := {φ ∈ V / ∂z φ = 0}. The space A is orthogonal\n(with respect to the L2 -norm) to G and thus contains the functions that have zero mean value along\nRL\nthe Z-axis, i.e. A := {φ ∈ V / 0 z φ(x,z)dz = 0}. Therefore, for φε = pε + q ε ∈ V, the function pε is the\nmean value of φε in the direction of the field b:\npε =\n\n1\nLz\n\nZ\n\nLz\n\nφε dz ,\n\n(2.26)\n\n0\n\nand q ε is the fluctuating part with zero mean value:\nq ε = φε −\n\n1\nLz\n\nZ\n\nLz\n\nφε dz.\n\n(2.27)\n\n0\n\nHypothesis B is thus easily verified. The results obtained in this special case were presented in a previous\npaper [11]. In the case of an arbitrary b-field, formula (2.26) is generalized as (1.2) in Appendix A,\nwhere the length element along the b-field line is weighted by the infinitesimal cross-sectional area of\nthe field tube around the considered b-field-line. This formula can be thus interpreted as a consequence\nof the co-area formula. Note that in the special case of a uniform anisotropy direction, the limit\nproblem can easily be formulated as an elliptic problem depending on the only transverse coordinates\n(see equation (2.14)). The size of the problem is thus significantly smaller than that of the initial one.\nThis feature still occurs for non-uniform b-fields as long as adapted coordinates and meshes are used.\nIn our case, aligned and transverse coordinates are not at our disposal and the solution of the limit\nproblem must be searched as a function of the whole set of coordinates.\n2.4. Lagrange multiplier space The objective of this work is the numerical solution of system\n(2.20) and the comparison of the obtained results with those obtained by directly solving the original\nproblem (2.2). In a general case, when the field b is not necessarily constant, the discretization of\nthe subspaces G and A, is not straightforward, as in the simpler case [11]. In order to overcome this\ndifficulty a Lagrange multiplier technique will be used.\n8\n\n\f2.4.1. The A space To avoid the use of the constrained space A, we can remark that A can\nbe characterized as being the orthogonal complement (in the L2 sense) of the G-space. Thus, instead\nof (2.20), the slightly changed system will be solved: find (pε ,q ε ,lε ) ∈ G × V × G such that\n\na⊥ (pε ,η) + a⊥ (q ε ,η) = (f,η)\n∀η ∈ G,\n\n\n\n\na|| (q ε ,ξ) + εa⊥ (q ε ,ξ) + εa⊥ (pε ,ξ) + (lε ,ξ) = ε(f,ξ) ∀ξ ∈ V,\n(2.28)\n\n\n\n (q ε ,χ) = 0\n∀χ ∈ G.\n\nThe constraint (q ε ,χ) = 0, ∀χ ∈ G is forcing the solution q ε to belong to A, and this property is carried\nover to the limit ε → 0. We have thus circumvented the difficulty of discretizing A by introducing a\nnew variable and enlarging the linear system.\nProposition 2.4. Problems (2.20) and (2.28) are equivalent. Indeed, (pε ,q ε ) ∈ G × A is the unique\nsolution of (2.20) if and only if (pε ,q ε ,lε ) ∈ G × V × G with lε ≡ 0 is the unique solution of (2.28).\nProof. Let (pε ,q ε ) ∈ G × A be the unique solution of (2.20). Then, it is immediate to show that\nε ε\n(p ,q ,0) solves (2.28). Let now (pε ,q ε ,lε ) ∈ G × V × G be a solution of (2.28). Then, the last equation\nof (2.28) implies that q ε ∈ A. Choosing in the second equation as test function ξ ∈ G, one gets\nεa⊥ (q ε ,ξ) + εa⊥ (pε ,ξ) + (lε ,ξ) = ε(f,ξ),\n\n∀ξ ∈ G ,\n\nwhich because of the first equation in (2.28), yields (lε ,ξ) = 0 for all ξ ∈ G. Thus lε ≡ 0.\n2.4.2. The G space\nIn order to eliminate the problems that arise when dealing with the\ndiscretization of G, the Lagrange multiplier method will again be used. First note that\nZ\n(\n A ∇ p * ∇ λdx = a (p,λ) = 0, ∀λ ∈ L\n∇|| p = 0\n|| ||\n||\n||\np∈G ⇔\n⇔\n(2.29)\nΩ\n\np∈V\np∈V,\n\nwhere L is a functional space that should be chosen large enough so that one could find for any p ∈ V a\nλ ∈ L with ∇|| λ = ∇|| p. On the other hand, the space L should be not too large in order to ensure the\nuniqueness of the Lagrange multipliers in the unconstrained system. A space that satisfies these two\nrequirements under some quite general assumptions to be detailed later, can be defined as\nL := {λ ∈ L2(Ω) / ∇|| λ ∈ L2 (Ω), λ|∂Ωin = 0},\n\nwith\n\n∂Ωin := {x ∈ ∂Ω / b(x) * n < 0}.\n\n(2.30)\n\nUsing the characterization (2.29) of the constrained space G, we shall now reformulate the system\n(2.28) as follows: Find (pε , λε , q ε , lε , με ) ∈ V × L × V × V × L such that\n\na⊥ (pε ,η) + a⊥ (q ε ,η) + a|| (η,λε ) = (f,η) , ∀η ∈ V ,\n\n\n\n\n\n\na|| (pε ,κ) = 0, ∀κ ∈ L,\n\n\n\n\n(AP ) a|| (q ε ,ξ) + εa⊥ (q ε ,ξ) + εa⊥ (pε ,ξ) + (lε ,ξ) = ε(f,ξ) ,\n\n\n ε\n\n\n(q ,χ) + a|| (χ,με ) = 0, ∀χ ∈ V ,\n\n\n\n\n\na|| (lε ,τ ) = 0, ∀τ ∈ L.\n\n∀ξ ∈ V ,\n\n(2.31)\n\nThe advantage of the above formulation, as compared to (2.20), is that we only have to discretize the\nspaces V and L (at the price of the introduction of three additional variables), which is much easier than\nthe discretization of the constrained spaces G and A. More importantly, the dual formulation (2.31)\ndoes not require any change of coordinates to express the fact that pε is constant along the b-field lines\n9\n\n\fand that q ε averages to zero along these lines. Therefore this formulation is particularly well adapted\nto time-dependent b-fields, as it does not require any operation which would have to be reinitiated as\nb evolves. The system (2.31) will be called the Asymptotic-Preserving formulation in the sequel.\nTo analyse this Asymptotic-Preserving formulation, we need the following\nHypothesis B' The trace λ|∂Ωin is well defined for any λ ∈ Ṽ as an element of L2 (∂Ωin ), with continuous dependence of the trace norm in L2 (∂Ωin ) on ||λ||Ṽ . Moreover, the Hilbert space\nṼ = {φ ∈ L2(Ω) / ∇|| φ ∈ L2 (Ω)},\n\n(φ,ψ)Ṽ := (φ,ψ) + (∇|| φ,∇|| ψ),\n\n(2.32)\n\nadmits the decomposition\nṼ = G̃ ⊕ L,\n\n(2.33)\n\nG̃ := {φ ∈ Ṽ / ∇|| φ = 0},\n\n(2.34)\n\nwhere G̃ is given by\n\nand L\nR is given by (2.30). The spaces G̃ and G = G̃ ∩ V are related in the following way: if g ∈ G̃ is such\nthat ∂Ωin ηgdσ = 0 for all η ∈ G, then g = 0.\n\nThe decomposition (2.33) is quite natural. It tells simply that any function φ can be decomposed on\neach field line as a sum of a function that vanishes at one given point on this line and a constant (which\nis therefore the value of φ at this point). Hypothesis B' will be thus normally satisfied in cases of\npractical interest. For example, we prove in Appendix A that the set of assumptions on the domain Ω\nand the b-field which can be used to verify Hypothesis B, is also sufficient (but far from necessary) for\nHypothesis B'. We are now able to show the relation between systems (2.28) and (2.31).\nProposition 2.5. Assuming Hypotheses A, B and B', problem (2.31) admits a unique solution\n(pε , λε , q ε , lε , με ) ∈ V × L × V × V × L, where (pε ,q ε ,lε ) ∈ G × V × G is the unique solution of (2.28).\nThe proof of Proposition 2.5 is based on the following two lemmas\nLemma 2.6. Assume Hypothesis B' and let p ∈ Ṽ be such that a|| (p,λ) = 0, ∀λ ∈ L. Then p ∈ G̃.\nProof. Take any η ∈ Ṽ and decompose η = λ + g with λ ∈ L and g ∈ G̃. We have a|| (p,g) = 0, hence\na|| (p,η) = 0 for all η ∈ Ṽ. This entails ∇|| p = 0, hence p ∈ G̃.\nLemma 2.7. Assume Hypothesis B' and let F ∈ Ṽ ∗ be such that F (η) = 0 for all η ∈ G. Then the problem\nof finding λ ∈ L such that\na|| (η,λ) = F (η),\n\n∀η ∈ Ṽ ,\n\n(2.35)\n\nhas a unique solution.\nProof. Consider the bilinear form b on Ṽ × Ṽ\nb(u,v) = a||(u,v) +\n\nZ\n\nuvdσ\n\n∂Ωin\n\nBy Hypothesis B', this is an inner product on Ṽ. Indeed, if b(u,u) = 0 then u ∈ G̃ ∩ L so that u = 0.\nRiesz representation theorem implies that the problem of finding μ ∈ Ṽ such that\nb(η,μ) = F (η),\n\n∀η ∈ Ṽ ,\n\nhas a unique solution. We can now decompose μ = λ + g with λ ∈ L and g ∈ G̃. This yields\nZ\nηgdσ = F (η), ∀η ∈ Ṽ ,\na|| (η,λ) +\n∂Ωin\n\n10\n\n\fR\nso that, in particular, ∂Ωin ηgdσ = 0 for all η ∈ G which implies g = 0. We see now that λ is a solution\nto (2.35). The uniqueness follows easily.\nLet us now prove Proposition 2.5.\nProof of existence in Proposition 2.5. Take (pε ,q ε ,lε ) ∈ G × V × G as the unique solution of (2.28).\nThen, equations 2,3,5 in (2.31) are immediately satisfied. It remains to choose properly the Lagrange\nmultipliers λε ,με ∈ L to satisfy equations 1,4 in (2.31). For this, let us define F1 ,F2 ∈ Ṽ ∗ by\n1\nF1 (η) := a|| (q ε ,η),\nε\n\nF2 (η) := −(q ε ,η),\n\n∀η ∈ Ṽ .\n\n(2.36)\n\nThese functionals are indeed continuous in the norm of Ṽ since their definitions do not contain the\nderivatives in directions perpendicular to b. Since F1 (η) = F2 (η) = 0 for all η ∈ G, Lemma 2.7 implies\nthe existence of λε ∈ L and με ∈ L, such that\na|| (η,λε ) = F1 (η),\n\na|| (χ,με ) = F2 (χ),\n\n∀η,χ ∈ Ṽ .\n\n(2.37)\n\nTaking η,χ ∈ V ⊂ Ṽ we observe (cf. the second line in (2.28) where lε = 0)\n1\na|| (η,λε ) = a|| (q ε ,η) = (f,η) − a⊥ (pε ,η) − a⊥ (q ε ,η),\nε\na|| (χ,με ) = −(q ε ,χ),\n\n∀η ∈ V ,\n\n∀χ ∈ V ,\n\nwhich coincides with equations 1,4 in (2.31).\nProof of uniqueness in Proposition 2.5. Consider the solution to system (2.31) with f = 0. Lemma\n2.6 implies then that pε ,lε ∈ G̃ ∩ V = G and (pε ,q ε ,lε ) ∈ G × V × G verifies (2.28) with f = 0 so that pε =\nq ε = lε = 0 by Proposition 2.4. Equations 1,4 in (2.31) now tell us that λε ,με ∈ G̃, but G̃ ∩ L = {0}, hence\nλε = με = 0.\n✷\nThe presence of 1/ε in the formulas (2.36), (2.37) defining λε indicates at a first sight that λε may\ntend to ∞ as ε → 0 which would be disastrous for an AP numerical method based on (2.31) at very\nsmall ε. Fortunately λε remains bounded uniformly in ε in the cases of practical interest. It suffices to\nsuppose that the limit solution φ0 is in H 2 (Ω) which is a reasonable assumption as discussed in Remark\n2.1.\nProposition 2.8. Assume Hypotheses A, B, B' and φ0 ∈ H 2 (Ω) where φ0 is the solution to (2.11).\nThen λε introduced in (2.31) satisfies\n||∇|| λε ||L2 ≤ C max(||f ||L2 ,||φ0 ||H 2 )\n\n(2.38)\n\nwith a constant C independent of ε.\nProof. We will denote all the ε-independent constants by C in this proof. We start from relation\n(2.24) in the proof of Theorem 2.2. Dropping the positive term a⊥ (q ε + eε ,q ε + eε ) it can be rewritten\nas\n1\na|| (q ε ,q ε ) ≤ (f,q ε ) − a⊥ (φ0 ,q ε ).\nε\nSince φ0 ∈ H 2 (Ω) we can integrate by parts in the integral defining a⊥ (φ0 ,q ε ):\nZ\n0 ε\n−a⊥ (φ ,q ) = − A⊥ ∇⊥ φ0 * ∇⊥ q ε dx\nZ\nZΩ\nt\n0\nε\n(Id − bb )A⊥ ∇⊥ φ * nq dσ + (∇⊥ * A⊥ ∇⊥ φ0 )q ε dx\n=−\nΩ\n∂ΩN\n\u0001\n≤ C||φ0 ||H 2 ||q ε ||L2 (∂ΩN ) + ||q ε ||L2 (Ω)\n11\n\n\fsince ∇φ0 has a trace on ∂Ω and its norm in L2 (∂ΩN ) is bounded by C||φ0 ||H 2 . Thus,\n\u0001\n1\nC\n||∇|| q ε ||2L2 ≤ a|| (q ε ,q ε ) ≤ C||f ||L2 ||q ε ||L2 (Ω) + C||φ0 ||H 2 ||q ε ||L2 (∂ΩN ) + ||q ε ||L2 (Ω) .\nε\nε\n\nBy Poincaré-Wirtinger inequality (2.18) (note that P q ε = 0) and by Hypothesis B' we have\nmax(||q ε ||L2 (Ω) ,||q ε ||L2 (∂ΩN ) ) ≤ C||∇|| q ε ||L2\nso that\n1\n||∇|| q ε ||L2 ≤ C max(||f ||L2 ,||φ0 ||H 2 ).\nε\nThis is the same as (2.38) since ∇|| λε = 1ε ∇|| q ε according to (2.36) and (2.37).\n\nRemark 2.9. The Limit model (2.11), reformulated using the Lagrange multiplier technique, now\nreads: Find (φ0 , λ0 ) ∈ V × L such that\nZ\nZ\nZ\n\n0\n0\n\nf ψ dx ∀ψ ∈ V\nA\n∇\nψ\n*\n∇\nλ\ndx\n=\nA\n∇\nφ\n*\n∇\nψ\ndx\n+\n⊥ ⊥\n⊥\n\n|| ||\n||\nΩ\nΩ\n(L′ ) ZΩ\n(2.39)\n\n0\n\n A|| ∇|| φ * ∇|| κdx = 0\n∀κ ∈ L.\nΩ\n\nProblem (2.39) is also well posed assuming Hypotheses A, B, B' and φ0 ∈ H 2 (Ω). Indeed, the uniqueness\nof the solution to (2.39) can be proved in exactly the same manner as in the proof of Proposition 2.5\nabove. To prove the existence of a solution, it suffices to take the limit ε → 0 in the first two lines of\n(2.31). Indeed, we know by Theorem 2.2 that pε → φ0 , the solution to (2.11), and q ε → 0 in H 1 (Ω).\nMoreover, the family {∇|| λε } is bounded in the norm of L2 (Ω) by Proposition 2.8. We can take therefore\na weakly convergence subsequence {∇|| λεn } and identify its limit with {∇|| λ0 } with some λ0 ∈ L (cf.\nLemma 2.7) to see that (φ0 ,λ0 ) ∈ V × L solves (2.39).\n\n3. Numerical method\nThis section concerns the discretization of the Asymptotic Preserving formulation (2.31), based\non a finite element method, and the detailed study of the obtained numerical results. The numerical\nanalysis of the present scheme is investigated in a forthcoming work [13], in particular we are interested\nin the convergence of the scheme, independently of the parameter ε > 0.\nLet us denote by Vh ⊂ V and Lh ⊂ L the finite dimensional approximation spaces, constructed by\nmeans of appropriate numerical discretizations (see Section 3.1 and Appendix B). We are thus looking\nfor a discrete solution (pεh , λεh , qhε , lhε , μεh ) ∈ Vh × Lh × Vh × Vh × Lh of the following system\n\na (pε ,η) + a⊥ (qhε ,η) + a|| (η,λεh ) = (f,η) , ∀η ∈ Vh ,\n\n ⊥ h\n\n\n\n\na|| (pεh ,κ) = 0, ∀κ ∈ Lh ,\n\n\n\n\na|| (qhε ,ξ) + εa⊥ (qhε ,ξ) + εa⊥ (pεh ,ξ) + (lhε ,ξ) = ε(f,ξ) ,\n\n\n ε\n\nε\n\n\n (qh ,χ) + a|| (χ,μh ) = 0, ∀χ ∈ Vh ,\n\n\n\na|| (lhε ,τ ) = 0, ∀τ ∈ Lh .\n\n∀ξ ∈ Vh ,\n\n(3.1)\n\nOur numerical experiments indicate that the spaces Vh and Lh can be always taken of the same\ntype and on the same mesh. The only difference between these two finite element spaces lies thus in\n12\n\n\fthe incorporation of boundary conditions. In general, let Xh denote the complete finite element space\n(without any restrictions on the boundary) which should be H 1 conforming but otherwise arbitrarily\nchosen. We define then\nVh = {vh ∈ Xh /vh |∂ΩD = 0},\n\n(3.2)\n\nLh = {λh ∈ Xh /λh |∂Ωin ∪∂ΩD = 0}.\n\n(3.3)\n\nWhile this choice of Vh is straight forward, the boundary conditions in Lh require special attention.\nIndeed, nothing in the definition (2.30) of space L on the continuous level indicates that its elements\nshould vanish on ∂ΩD . However, this liberty on ∂ΩD is somewhat counter-intuitive. Indeed, the\nLagrange multiplier λε ∈ L serves to impose ∇|| pε = 0 for some function pε taken from the space V. But,\nfor p ∈ V the trace on ∂ΩD is zero so that ∇|| pε = 0 there without the help of a Lagrange multiplier.\nOf course, this argument is not valid on the continuous level since the trace of functions in L does not\neven necessarily exist. However, this may become very important on the finite element level. Indeed,\nwe provide in Appendix B an example of a finite element setting without incorporating λh |∂ΩD = 0 into\nthe definition of Lh , which leads to an ill-posed system (3.1). To avoid this difficulty, we choose Lh as\nin (3.3) in all our experiments, thus obtaining well-posed problems.\n3.1. Discretization Let us present the discretization in a 2D case, the 3D case being a simple\ngeneralization. The here considered computational domain Ω is a square Ω = [0,1] × [0,1]. All simulations are performed on structured meshes. Let us introduce the Cartesian, homogeneous grid\nxi = i/Nx , 0 ≤ i ≤ Nx ,\n\nyj = j/Ny , 0 ≤ j ≤ Ny ,\n\n(3.4)\n\nwhere Nx and Ny are positive even constants, corresponding to the number of discretization intervals\nin the x- resp. y-direction. The corresponding mesh-sizes are denoted by hx > 0 resp. hy > 0. Choosing\na Q2 finite element method (Q2 -FEM), based on the following quadratic base functions\n (x−x )(x−x )\ni−2\ni−1\n\nx ∈ [xi−2 ,xi ],\n\n2h2x\n−x)(x\n−x)\n(x\ni+2\ni+1\nθx i =\nx ∈ [xi ,xi+2 ], ,\n2h2x\n\n\n0\nelse\n\nfor even i,j and\n(\nθx i =\n\n(xi+1 −x)(x−xi−1 )\nh2x\n\n0\n\nx ∈ [xi−1 ,xi+1 ],\n,\nelse\n\n (y−yj−2 )(y−yj−1 )\ny ∈ [yj−2 ,yj ],\n\n\n2h2y\n(y\n−y)(y\n−y)\nj+2\nj+1\nθy j =\ny ∈ [yj ,yj+2 ],\n2h2y\n\n\n0\nelse\nθy j =\n\n(\n\n(yj+1 −y)(y−yj−1 )\nh2y\n\n0\n\ny ∈ [yj−1 ,yj+1 ],\nelse\n\n(3.5)\n\n(3.6)\n\nfor odd i,j, we define\nXh := {vh =\n\nX\n\nvij θxi (x)θyj (y)},\n\ni,j\n\nWe then search for discrete solutions (pεh , qhε , lhε ) ∈ Vh × Vh × Vh and (λεh , μεh ) ∈ Lh × Lh with Vh and Lh\ndefined by (3.2) and (3.3). This leads to the inversion of a linear system, the corresponding matrix\nbeing non-symmetric and given by\n\n\nA1 A0\nA1\n0 0\n A0 0\n0\n0 0 \n\n\nεA\n0\nA\n+\nεA\nC\n0 \nA=\n(3.7)\n0\n1\n 1\n.\n 0 0\nC\n0 A0 \n0 0\n0\nA0 0\n13\n\n\fε\n10\n1\n10−1\n10−4\n10−6\n10−10\n10−15\n\nAP scheme\nL error\nH 1 error\n\nLimit model\nL error\nH 1 error\n\n2\n\n7.2 × 10−6\n7.3 × 10−7\n1.47 × 10−7\n1.28 × 10−7\n1.28 × 10−7\n1.28 × 10−7\n1.28 × 10−7\n\n2\n\n4.7 × 10−3\n4.7 × 10−4\n9.6 × 10−5\n8.3 × 10−5\n8.3 × 10−5\n8.3 × 10−5\n8.3 × 10−5\n\n5.0 × 100\n5.0 × 10−1\n5.0 × 10−2\n5.0 × 10−5\n5.2 × 10−7\n1.28 × 10−7\n1.28 × 10−7\n\n3.51 × 101\n3.51 × 100\n3.51 × 10−1\n3.61 × 10−4\n8.4 × 10−5\n8.3 × 10−5\n8.3 × 10−5\n\nSingular Perturbation scheme\nL2 error\nH 1 error\n7.2 × 10−6\n7.3 × 10−7\n1.45 × 10−7\n1.26 × 10−7\n5.9 × 10−7\n9.9 × 10−3\n7.1 × 10−1\n\n4.7 × 10−3\n4.7 × 10−4\n9.4 × 10−5\n8.2 × 10−5\n8.2 × 10−5\n3.12 × 10−2\n2.23 × 100\n\nTable 3.1 – Comparison between the Asymptotic Preserving scheme, the Limit model and the\nSingular Perturbation model for h = 0.005 (200 mesh points in each direction) and constant b:\nabsolute L2 -error and H 1 -error, for different ε-values.\n\nThe sub-matrices A0 , A1 resp. C correspond to the bilinear forms a|| (*,*), a⊥ (*,*) resp. (*,*), used in\nequations (2.31) and belong to R(Nx +1)(Ny +1)×(Nx +1)(Ny +1) . The matrix elements are computed using\nthe 2D Gauss quadrature formula, with 3 points in the x and y direction:\nZ\n\n1\n\nq\n\n3\n5,\n\nZ\n\n1\n\n−1 −1\n\nwhere x0 = y0 = 0, x±1 = y±1 = ±\n5.\n\nf (x,y) =\n\n1\nX\n\nωi ωj f (xi ,yj ),\n\n(3.8)\n\ni,j=−1\n\nω0 = 8/9 and ω±1 = 5/9, which is exact for polynomials of degree\n\n3.2. Numerical Results\n3.2.1. 2D test case, uniform and aligned b-field In this section we compare the numerical\nresults obtained via the Q2 -FEM, by discretizing the Singular Perturbation model (2.2), the Limit model\n(2.11) and the Asymptotic Preserving reformulation (2.31). In all numerical tests we set A⊥ = Id and\nAk = 1. We start with a simple test case, where the analytical solution is known. Let the source term\nf be given by\nf = (4 + ε)π 2 cos(2πx)sin(πy) + π 2 sin(πy)\n\n(3.9)\n\nand the b field be aligned with the x-axis. Hence, the solution φε of (2.2) and its decomposition\nφε = pε + q ε write\nφε = sin(πy) + εcos(2πx)sin(πy),\npε = sin(πy) , q ε = εcos(2πx)sin(πy).\n\n(3.10)\n(3.11)\n\nWe denote by φP , φL , φA the numerical solution of the Singular Perturbation model (2.2), the\nLimit model (2.11) and the Asymptotic Preserving reformulation (2.31) respectively. The comparison\nwill be done in the L2 -norm as well as the H 1 -norm. The linear systems obtained after discretization\nof the three methods are solved using the same numerical algorithm - LU decomposition implemented\nin a solver MUMPS[2].\nIn Figure 3.1 we plotted the absolute errors (in the L2 resp. H 1 -norms) between the numerical\nsolutions obtained with one of the three methods and the exact solution, and this, as a function of\n14\n\n\f10\n\n100\n(P)\n(L)\n(AP)\n\n(P)\n(L)\n(AP)\n\n1\n\n10\n\n0.1\n1\n0.01\n0.1\n0.001\n0.01\n0.0001\n0.001\n1e-05\n\n0.0001\n\n1e-06\n\n1e-07\n\n1e-05\n1e-15\n\n(a)\n\nL2\n\n1e-10\n\n1e-05\n\n1\n\n1e-15\n\n1e-10\n\n1e-05\n\n1\n\n(b) H 1 error for a grid with 50 × 50 points.\n\nerror for a grid with 50 × 50 points.\n\n10\n\n100\n(P)\n(L)\n(AP)\n\n(P)\n(L)\n(AP)\n\n1\n\n10\n\n0.1\n1\n0.01\n0.1\n0.001\n0.01\n0.0001\n0.001\n1e-05\n\n0.0001\n\n1e-06\n\n1e-07\n\n1e-05\n1e-15\n\n(c)\n\nL2\n\n1e-10\n\n1e-05\n\n1\n\n1e-15\n\n1e-10\n\n1e-05\n\n1\n\n(d) H 1 error for a grid with 100 × 100 points.\n\nerror for a grid with 100 × 100 points.\n\n10\n\n100\n(P)\n(L)\n(AP)\n\n(P)\n(L)\n(AP)\n\n1\n\n10\n\n0.1\n1\n0.01\n0.1\n0.001\n0.01\n0.0001\n0.001\n1e-05\n\n0.0001\n\n1e-06\n\n1e-07\n\n1e-05\n1e-15\n\n(e)\n\nL2\n\n1e-10\n\n1e-05\n\n1\n\n1e-15\n\n1e-10\n\n1e-05\n\n1\n\n(f) H 1 error for a grid with 200 × 200 points.\n\nerror for a grid with 200 × 200 points.\n\nFigure 3.1 – Absolute L2 (left column) and H 1 (right column) errors between the exact solution\nφε and the computed numerical solution φA (AP), φL (L), φP (P) for the test case with constant\nb. The error is plotted as a function of the parameter ε and for three different mesh-sizes.\n\nthe parameter ε and for several mesh-sizes. In Table 3.1, we specified the error values for one fixed\ngrid and several ε-values. One observes that the Singular Perturbation finite element approximation\nis accurate only for ε bigger than some critical value εP , the Limit model gives reliable results for ε\n15\n\n\fmethod\n\n# rows\n\n# non zero\n\ntime\n\nL2 -error\n\nH 1 -error\n\nAP\nL\nP\n\n50 × 103\n20 × 103\n10 × 103\n\n1563 × 103\n469 × 103\n157 × 103\n\n13.212 s\n5.227 s\n3.707 s\n\n1.02 × 10−6\n1.14 × 10−6\n1.02 × 10−6\n\n3.34 × 10−4\n3.34 × 10−4\n3.27 × 10−4\n\nTable 3.2 – Comparison between the Asymptotic Preserving scheme (AP), the Limit model (L)\nand the Singular Perturbation model (P) for h = 0.01 (100 mesh points in each direction) and\nfixed ε = 10−6 : matrix size, number of nonzero elements, average computational time and error\nin L2 and H 1 norms.\n\nsmaller than εL , whereas the AP-scheme is accurate independently on ε. The order of convergence for\nall three methods is three in the L2 -norm and two in the H 1 -norm, which is an optimal result for Q2\nfinite elements. When designing a robust numerical method one has therefore two options. The first\none is to use an Asymptotic Preserving scheme, which is accurate independently on ε, but requires the\nsolution of a bigger linear system. The second one is to design a coupling strategy that involves the\nsolution of the Singular Perturbation formulation and the Limit problem in their respective validity\ndomains. This is however a very delicate problem, since we observe that the critical values εP and εL\nare mesh dependent, namely εP inversely proportional to h and εL proportional to h. Therefore for\nsmall meshes there may exist a range of ε-values, where neither the Singular Perturbation nor the Limit\nmodel finite element approximation give accurate results. For our test case, this is even the case for\nmeshes as big as 200 × 200 points, if one regards the L2 -norm. This mesh-size is generally insufficient\nin the case of real physical applications.\nAnother interesting aspect with respect to which the three methods must be compared, is the\ncomputational time and the size of the matrices involved in the linear systems. Table 3.2 shows that\nthe Asymptotic Preserving scheme is expensive in computational time and memory requirements, as\ncompared to the other methods. Indeed, the computational time required to solve the problem is almost\nfour times bigger than that of the Singular Perturbation scheme. Moreover, the Asymptotic Preserving\nmethod involves matrices that have five times more rows and ten times more nonzero elements than\nthe matrices obtained with the Singular Perturbation approximation. It is however the only scheme\nthat provides the h-convergence regardless of ε. In order to reduce the computational costs, a coupling\nstrategy for problems with variable ε will be proposed in a forthcoming paper. In sub-domains where\nε > εP the Singular Perturbation problem will be solved, in sub-domains where ε < εL the Limit problem\nwill be solved and only in the remaining part, where neither the Limit nor the Singular Perturbation\nmodel are valid, the Asymptotic Preserving formulation will be solved.\n3.2.2. 2D test case, non-uniform and non-aligned b-field We now focus our attention on\nthe original feature of the here introduced numerical method, namely its ability to treat nonuniform b\nfields. In this section we present numerical simulations performed for a variable field b.\nFirst, let us construct a numerical test case. Finding an analytical solution for an arbitrary b\npresents a considerable difficulty. We have therefore chosen a different approach. First, we choose a\nlimit solution\n\u0001\nφ0 = sin πy + α(y 2 − y)cos(πx) ,\n\n(3.12)\n\nwhere α is a numerical constant aimed at controlling the variations of b. For α = 0, the limit solution\nof the previous section is obtained. The limit solution for α = 2 is shown in Figure 3.2. We set α = 2\nin what follows. Since φ0 is a limit solution, it is constant along the b field lines. Therefore we can\n16\n\n\fFigure 3.2 – The limit solution for the test case with variable b.\n\ndetermine the b field using the following implication\n∇k φ0 = 0\n\n⇒\n\nbx\n\n∂φ0\n∂φ0\n+ by\n= 0,\n∂x\n∂y\n\n(3.13)\n\nwhich yields for example\nB\n,\nb=\n|B|\n\nB=\n\n\u0012\n\nα(2y − 1)cos(πx) + π\nπα(y 2 − y)sin(πx)\n\n\u0013\n\n.\n\n(3.14)\n\nNote that the field B, constructed in this way, satisfies divB = 0, which is an important property in the\nframework of plasma simulation. Furthermore, we have B 6= 0 in the computational domain. Now, we\nchoose φε to be a function that converges, as ε → 0, to the limit solution φ0 :\n\u0001\nφε = sin πy + α(y 2 − y)cos(πx) + εcos(2πx)sin(πy).\n(3.15)\nFinally, the force term is calculated, using the equation, i.e.\n\n1\nf = −∇⊥ * (A⊥ ∇⊥ φε ) − ∇k * (Ak ∇k φε ).\nε\nAs in the previous section, we shall compare here the numerical solution of the Singular Perturbation\nmodel (2.2), the Limit model (2.11) and the Asymptotic Preserving reformulation (2.31), i.e. φP , φL ,\nφA with the exact solution (3.15) . The L2 and H 1 -errors are reported on Figure 3.3 and Table 3.3.\nOnce again the Asymptotic Preserving scheme proves to be valid for all values of ε, contrary to the\nother schemes. There is however a difference compared to the constant-b case. For a variable b , the\nthreshold value εP seems to be independent on the mesh size and is much larger than that of the\nuniform b test case. This observation limits further the possible choice of coupling strategies, since\neven for coarse meshes there exists a range of ε-values, where neither the Singular Perturbation nor the\nLimit model are valid. The coupling strategy, involving all three models, remains however interesting\nto investigate.\n17\n\n\fAP scheme\nL error\nH 1 error\n\nε\n\n2\n\n7.2 × 10−6\n7.1 × 10−7\n2.05 × 10−7\n2.12 × 10−7\n2.17 × 10−7\n2.17 × 10−7\n2.17 × 10−7\n\n10\n1\n10−2\n10−4\n10−7\n10−10\n10−15\n\n4.6 × 10−3\n4.6 × 10−4\n1.33 × 10−4\n1.38 × 10−4\n1.41 × 10−4\n1.41 × 10−4\n1.41 × 10−4\n\nLimit model\nL error\nH 1 error\n2\n\n5.0 × 100\n5.0 × 10−1\n5.0 × 10−3\n5.0 × 10−5\n2.22 × 10−7\n2.17 × 10−7\n2.17 × 10−7\n\n3.50 × 101\n3.50 × 100\n3.50 × 10−2\n3.77 × 10−4\n1.41 × 10−4\n1.41 × 10−4\n1.41 × 10−4\n\nSingular Perturbation scheme\nL2 error\nH 1 error\n7.2 × 10−6\n7.1 × 10−7\n2.05 × 10−7\n1.74 × 10−6\n1.68 × 10−3\n3.93 × 10−1\n6.7 × 10−1\n\n4.6 × 10−3\n4.6 × 10−4\n1.33 × 10−4\n1.43 × 10−4\n1.26 × 10−2\n1.35 × 100\n2.32 × 100\n\nTable 3.3 – Comparison between the Asymptotic preserving scheme, the Limit model and the\nSingular Perturbation model for h = 0.005 (200 mesh points in each direction) and variable b:\nabsolute L2 -error and H 1 -error.\n\nIn the next test case we investigate the influence of the variations of the b field on the accuracy of\nthe solution. We would like to answer the following question: what is the minimal number of points per\ncharacteristic length of b variations required to obtain an acceptable solution. For this, let us modify\nthe previous test case. Let b = B/|B|, with\n\u0012\n\u0013\nα(2y − 1)cos(mπx) + π\nB=\n,\n(3.16)\nmπα(y 2 − y)sin(mπx)\nm being an integer. The limit solution and φε are chosen to be\n\n\u0001\nφ0 = sin πy + α(y 2 − y)cos(mπx) ,\n\u0001\nφε = sin πy + α(y 2 − y)cos(mπx) + εcos(2πx)sin(πy).\n\n(3.17)\n(3.18)\n\nWe perform two tests: first, we fix the mesh size and vary m to find the minimal period of b for which\nthe Asymptotic Preserving method yields still acceptable results. We define a result to be acceptable\nwhen the relative error is less then 0.01. In the second test m remains fixed and the convergence of the\nscheme is studied. The results are presented on Figures 3.4 and 3.5.\nFor ε = 1 and 400 mesh points in each direction (h = 0.0025) the relative error in the L2 -norm,\ndefined as\nε\n\n||φε −φA ||L2 (Ω)\n||φA ||L2 (Ω) ,\n\nis below 0.01 for all tested values of 1 ≤ m ≤ 50. The relative H 1 -error\n\n||φ −φA ||H 1 (Ω)\n||φA ||H 1 (Ω)\n\nexceeds the critical value for m > 25. For ε = 10−20 the maximal m for which the error is acceptable in both norms is 20. The minimal number of mesh points per period of b variations is\n40 in the worst case, in order to obtain an 1% relative error.\nFigure 3.5 and Table 3.4 show the convergence of the Asymptotic Preserving scheme with respect\nto h for m = 10 and ε = 10−10. We observe that for big values of h the error does not diminish with h.\nThen, for h < 0.025 the scheme converges at a better rate then 2 for H 1 -error and 3 for L2 -error. For\nh < 0.00625 (160 points) the optimal convergence rate in the H 1 -norm is obtained (which is 32 mesh\npoints per period of b). The method is super-convergent in the whole tested range for the L2 -error.\nThese results are reassuring, as they prove that the Asymptotic Preserving scheme is precise even\nfor strongly varying fields for relatively small mesh sizes, which was not evident. Indeed, the optimal\nconvergence rate in the H 1 -norm is obtained for 32 mesh points per b period, and an 1% relative error\nfor 40 points. It shows that accurate results can be obtained in more complex simulations, such as\ntokamak plasma for example. The application of the method to bigger scale problems is the subject of\nan ongoing work.\n18\n\n\f10\n\n100\n(P)\n(L)\n(AP)\n\n(P)\n(L)\n(AP)\n\n1\n\n10\n\n0.1\n1\n0.01\n0.1\n0.001\n0.01\n0.0001\n0.001\n1e-05\n\n0.0001\n\n1e-06\n\n1e-07\n\n1e-05\n1e-15\n\n(a)\n\nL2\n\n1e-10\n\n1e-05\n\n1\n\n1e-15\n\n1e-10\n\n1e-05\n\n1\n\n(b) H 1 error for a grid with 50 × 50 points.\n\nerror for a grid with 50 × 50 points.\n\n10\n\n100\n(P)\n(L)\n(AP)\n\n(P)\n(L)\n(AP)\n\n1\n\n10\n\n0.1\n1\n0.01\n0.1\n0.001\n0.01\n0.0001\n0.001\n1e-05\n\n0.0001\n\n1e-06\n\n1e-07\n\n1e-05\n1e-15\n\n(c)\n\nL2\n\n1e-10\n\n1e-05\n\n1\n\n1e-15\n\n1e-10\n\n1e-05\n\n1\n\n(d) H 1 error for a grid with 100 × 100 points.\n\nerror for a grid with 100 × 100 points.\n\n10\n\n100\n(P)\n(L)\n(AP)\n\n(P)\n(L)\n(AP)\n\n1\n\n10\n\n0.1\n1\n0.01\n0.1\n0.001\n0.01\n0.0001\n0.001\n1e-05\n\n0.0001\n\n1e-06\n\n1e-07\n\n1e-05\n1e-15\n\n(e)\n\nL2\n\n1e-10\n\n1e-05\n\n1\n\n1e-15\n\n1e-10\n\n1e-05\n\n1\n\n(f) H 1 error for a grid with 200 × 200 points.\n\nerror for a grid with 200 × 200 points.\n\nFigure 3.3 – Absolute L2 (left column) and H 1 (right column) errors between the exact solution\nφε and the computed solution φA (AP), φL (L), φP (P) for the test case with variable b. Plotted\nare the errors as a function of the small parameter ε, for three different meshes.\n\n19\n\n\f1\n\n1\nL2 error\nH1 error\n\nL2 error\nH1 error\n\n0.1\n\n0.1\n\n0.01\n\n0.01\n\n0.001\n\n0.001\n\n0.0001\n\n0.0001\n\n1e-05\n\n1e-05\n\n1e-06\n\n1e-06\n\n1e-07\n\n1e-07\n\n1e-08\n\n1e-08\n5\n\n10\n\n15\n\n20\n\n25\n\n30\n\n35\n\n40\n\n45\n\n50\n\n5\n\n10\n\n15\n\n20\n\n25\n\n30\n\n35\n\n40\n\n45\n\n50\n\n(b) ε = 10−20\n\n(a) ε = 1\n\nFigure 3.4 – Relative L2 and H 1 errors between the exact solution φε and the computed solution\nφA (AP) for h = 0.0025 (400 points in each direction) as a function of m and for ε = 1 respectively\n10−20 .\n\n10\nL2 error\nH1 error\n1\n\n0.1\n\n0.01\n\n0.001\n\n0.0001\n\n1e-05\n\n1e-06\n0.001\n\n0.01\n\n0.1\n\nFigure 3.5 – Relative L2 and H 1 errors between the exact solution φε and the computed solution\nφA (AP) for m = 10 and ε = 10−10 as a function of h.\n\n3.2.3. 3D test case, uniform and aligned b-field\n3D test case. Let the field b be aligned with the X-axis:\n \n1\nb =  0 .\n0\n\nFinally, we test our method on a simple\n\n(3.19)\n\nLet Ω = [0,1] × [0,1] × [0,1], and the source term f is such that the solution is given by\nφε = sin(πy)sin(πz) + εcos(2πx)sin(πy)sin(πz),\npε = sin(πy)sin(πz) , q ε = εcos(2πx)sin(πy)sin(πz).\n\n(3.20)\n(3.21)\n\nNumerical simulations were performed on a 30 × 30 × 30 grid. Once again all three methods are compared. The L2 and H 1 -errors are given on Figure 3.6. The numerical results are equivalent with those\nobtained in the 2D test with constant b. Note that it is difficult to perform 3D simulations with more\n20\n\n\fh\n\n# points per period\n\nL2 -error\n\nH 1 -error\n\n0.1\n0.05\n0.025\n0.0125\n0.00625\n0.0003125\n0.0015625\n0.00078125\n\n2\n4\n8\n16\n32\n64\n128\n256\n\n4.7 × 10−1\n5.2 × 10−1\n1.82 × 10−1\n1.89 × 10−2\n1.41 × 10−3\n9.3 × 10−5\n6.1 × 10−6\n4.6 × 10−7\n\n1.05\n1.29\n4.3 × 10−1\n6.4 × 10−2\n1.00 × 10−2\n2.21 × 10−3\n5.5 × 10−4\n1.36 × 10−4\n\nTable 3.4 – Relative L2 and H 1 errors between the exact solution φε and the computed solution\nφA (AP) for m = 10 and ε = 10−10 as a function of h.\n\nrefined grids, due to memory requirements on standard desktop equipment as we are doing now. Every\nrow in the matrix constructed for the Singular Perturbation model, can contain up to 125 non zero\nentries (for Q2 finite elements), while matrices associated with the Asymptotic Preserving reformulation\nhave rows with up to 375 non zero entries. Furthermore the dimension of the latter is five times bigger.\nThe memory requirements of the direct solver used in our simulations grow rapidly. The remedy could\nbe to use an iterative solver with suitable preconditioner. Finding the most efficient method to inverse\nthese matrices is however beyond the scope of this paper. In future work we will address this problem\nas well as a parallelization of this method.\n10\n\n100\n(P)\n(L)\n(AP)\n\n(P)\n(L)\n(AP)\n\n1\n10\n\n0.1\n1\n0.01\n0.1\n0.001\n\n0.01\n0.0001\n\n1e-05\n\n0.001\n1e-15\n\n1e-10\n\n1e-05\n\n1\n\n1e-15\n\n(a) L2 error for a grid with 30 × 30 × 30 points.\n\n1e-10\n\n1e-05\n\n1\n\n(b) H 1 error for a grid with 30 × 30 × 30 points.\n\nFigure 3.6 – Absolute L2 (left column) and H 1 (right column) errors between the exact solution\nφε and the computed solution φA (AP), φL (L), φP (P) for the 3D test case. The errors are\nplotted as a function of the anisotropy ratio ε.\n\n4. Conclusions\nThe asymptotic preserving method presented in this paper is shown to be very efficient for the\nsolution of highly anisotropic elliptic equations, where the anisotropy direction is given by an arbitrary,\nbut smooth vector field b with non-adapted coordinates and meshes. The results presented here generalize the procedure used in [11] and have the important advantage to permit the use of Cartesian grids,\n21\n\n\findependently on the shape of the anisotropy. Moreover, the scheme is equally accurate, independently\non the anisotropy strength, avoiding thus the use of coupling methods. The numerical study of this\nAP-scheme shall be investigated in a forthcoming paper, in particular the ε-independent convergence\nresults shall be stated.\nAnother important related work consists in extending our methods to the case of anisotropy ratios\nε, which are variable in Ω from moderate to very small values. This is important, for example, in plasma\nphysics simulations as already noted in the introduction. An alternative strategy to the Asymptotic\nPreserving schemes whould be to couple a standard discretization in subregions with moderate ε with\na limit (ε → 0) model in subregions with small ε as suggested, for example, in [5, 25]. However, the\nlimit model is only valid for ε ≪ 1 and cannot be applied for weak anisotropies. Thus, the coupling\nstrategy requires existence of a range of anisotropy strength where both methods are valid. This is\nrather undesirable since this range may not exist at all, as illustrated by our results in Fig. 3.1.\nAppendix A. Decompositions V = G ⊕⊥ A, Ṽ = G̃ ⊕ L and related estimates.\nWe shall show in this Appendix that all the statements in Hypotheses B and B' can be rigorously\nderived under some assumptions on the domain boundary ∂Ω and on the manner in which it is intersected by the field b. We assume essentially that b is tangential to ∂Ω on ∂ΩD and that b penetrates\nthe remaining part of the boundary ∂ΩN at an angle that stays away from 0 on ∂ΩN . We assume also\nthat ∂ΩN consists of two disjoint components for which there exist global and smooth parametrizations.\nThis last assumption can be weakened (existence of an atlas of local smooth parametrizations should be\nsufficient) at the expense of lengthening the proofs. The precise set of our assumptions is the following:\nHypothesis C The boundary of Ω is the union of three components: ∂ΩD where b * n = 0, ∂Ωin\nwhere b * n ≤ −α and ∂Ωout where b * n ≥ α with some constant α > 0. Moreover, there is a smooth\nsystem of coordinates ξ1 ,...,ξd−1 on ∂Ωin meaning that there is a bounded domain Γin ∈ Rd−1 and\na one-to-one map hin : Γin → Rd such that hin ∈ C 2 (Γin ) and ∂Ωin is the image of hin (ξ1 ,...,ξd−1 ) as\n(ξ1 ,...,ξd−1 ) goes over Γin . The matrix formed by the vectors (∂hin /∂ξ1 ,...,∂hin /∂ξ1 ,n) is invertible\nfor all (ξ1 ,...,ξd−1 ) ∈ Γin . Similar assumptions hold also for ∂Ωout (changing Γin to Γout and hin to hout ).\n\nUsing this hypothesis we can introduce a system of coordinates in Ω such that the field lines of\nb coincide with the coordinate lines. To do this consider the initial value problem for a parametrized\nordinary differential equation (ODE):\n∂X ′\n(ξ ,ξd ) = b(X(ξ ′ ,ξd )), X(ξ ′ ,0) = hin (ξ ′ ).\n∂ξd\n\n(1.1)\n\nHere X(ξ ′ ,ξd ) is Rd -valued and ξ ′ stands for (ξ1 ,...,ξd−1 ). For any fixed ξ ′ ∈ Γin , equation (1.1) should\nbe understood as an ODE for a function of ξd . Its solution X(ξ ′ ,ξd ) goes then over the field line of b\nstarting (as ξd = 0) at the point on the inflow boundary ∂Ωin , parametrized by ξ ′ . This field line hits\nthe outflow boundary ∂Ωout somewhere. In other words, for any ξ ′ ∈ Γin there exists L(ξ ′ ) > 0 such\nthat X(ξ ′ ,L(ξ ′ )) ∈ ∂Ωout . The domain of definition of X is thus\nD = {(ξ ′ ,ξd ) ∈ Rd / ξ ′ ∈ Γin and 0 < ξd < L(ξ ′ )}.\nGathering the results on parametrized ODEs, from for instance [34], we conclude that X(ξ ′ ,ξd ) =\nX(ξ1 ,...,ξd ) is a smooth function of all its d parameters, more precisely X ∈ C 2 (D). Evidently, the\nmap X is one-to-one from D to Ω and thus ξ1 ,...,ξd provide a system of coordinates for Ω. Moreover this\nsystem is not degenerate in the sense that the vectors ∂X/∂ξ1 ,...,∂X/∂ξd are linearly independent at\neach point of Ω. Indeed, if this was not the case, then there would exist a non trivial linear combination\n22\n\n\fλ1 ∂X/∂ξ + ***+ λd ∂X/∂ξd that would vanish at some point in Ω. But, ODE (1.1) implies\nd\nd\nX\n∂X ′\n∂ X ∂X ′\nλi\nλi\n(ξ ,ξd ) = ∇b(X(ξ ′ ,ξd )) *\n(ξ ,ξd )\n∂ξd i=1 ∂ξi\n∂ξi\ni=1\n\nPd\nso that, the unique solution of this ODE, i.e. the linear combination i=1 λi ∂X\n∂ξi , would vanish on the\n∂hin\n∂X\nwhole field line, in particular on the inflow. But this is impossible since ∂ξi = ∂ξi , i = 1,...,d − 1 on the\n\u0010\n\u0011\n∂hin\n∂hin\n∂X\ninflow, while ∂ξ\n=\nb\nand\nthe\nvectors\n,b\nare linearly independent for all (ξ1 ,...,ξd−1 ) ∈\n,...,\n∂ξ1\n∂ξd−1\nd\n\nΓin . We see thus that the Jacobian J = det(∂Xj /∂ξi ) does not vanish on Ω so that we can assume that\nm < J < M everywhere on Ω with some positive constants m and M (assuming that J is positive does\nnot prevent the generality since if J is negative in Ω than one can replace ξ1 by −ξ1 ). Since X ∈ C 2 (Ω),\nwe have also that J ∈ C 1 (Ω).\nOne also sees easily that the top of D is given by a smooth function L(ξ ′ ). Indeed, L(ξ ′ ) is\ndetermined for each ξ ′ ∈ Γin from the equation X(ξ ′ ,L(ξ ′ )) = hout (η) with some η = (η1 ,...,ηd−1 ) ∈ Γout .\nWe know already that this equation is solvable for ξd = L(ξ ′ ), η1 ,...,ηd−1 for any ξ ′ ∈ Γin . To conclude\nthat the solution depends smoothly on ξ ′ we can apply the implicit function theorem to the equation\nF (ξ ′ ;ξd ,η1 ,...,ηd−1 ) = X(ξ ′ ,ξd ) − hout (η1 ,...,ηd−1 ) = 0.\n\nIndeed, the Rd -valued function F is smooth and the matrix of its partial derivatives with respect to\nξd ,η1 ,...,ηd−1 is invertible since ∂F/∂ξd = b and ∂F/∂ηi = −∂hout/∂ηi at some point at the outflow\nand the vectors ∂hout /∂ηi lie in the tangent plane to ∂Ωout while b is nowhere in this plane. We have\nmoreover that L ∈ C 1 (Γin ). Indeed, we can prove that all the derivatives of L are bounded. In order to\ndo it, let us remark that the differential of X(ξ ′ ,L(ξ ′ )) represents a vector in the tangent plane at some\npoint on ∂Ωout so that it is perpendicular to the outward normal n. We have thus for any i = 1,...,d − 1\n\u0013\n\u0012\n\u0013\n\u0012\n∂X ′\n∂X ′\n∂X ′\n′\n′ ∂L ′\n′\n′\n′ ∂L ′\n(ξ ,L(ξ )) +\n(ξ ,L(ξ ))\n(ξ ) = n *\n(ξ ,L(ξ )) + b(ξ ,L(ξ ))\n(ξ )\n0 = n*\n∂ξi\n∂ξd\n∂ξi\n∂ξi\n∂ξi\nso that\n′\n′\nn * ∂X\n∂L ′\n∂ξi (ξ ,L(ξ ))\n(ξ ) = −\n∂ξi\nn * b(ξ ′ ,L(ξ ′ ))\n\nand this is bounded since X has bounded partial derivatives and n * b ≥ α by the hypothesis. Note also\nthat L is strictly positive.\n• We can now establish the decomposition V = G ⊕⊥ A. Take any φ ∈ V ∩C 1 (Ω) and introduce\np ∈ L2 (Ω) by\nR L(ξ′ )\nφ(ξ ′ ,t)J(ξ ′ ,t)dt\n′\n′\np(x) = p(ξ ,ξd ) = p(ξ ) = 0 R L(ξ′ )\n.\n(1.2)\nJ(ξ ′ ,t)dt\n0\n(from now on we switch back and forth between the Cartesian coordinates x = (x1 ,...,xd ) and\nthe new ones (ξ ′ ,ξd ) = (ξ1 ,...,ξd )). Evidently, p is constant along each field line. Moreover, p is\nthe L2 -orthogonal projection of φ on the space of such functions. Indeed, if ψ = ψ(ξ ′ ) ∈ L2 (Ω)\nis any function constant along each field line then\nZ L(ξ′ )\nZ\nZ\nZ\np(ξ ′ )ψ(ξ ′ )\nJ(ξ ′ ,ξd )dξd dξ ′\npψdx =\npψJdξ =\nΩ\n\nD\n\n=\n\nZ\n\nΓin\n\n0\n\nΓin\n\nZ\n\nL(ξ ′ )\n\n′\n\n′\n\n′\n\n′\n\nφ(ξ ,ξd )ψ(ξ )J(ξ ,ξd )dξd dξ =\n\n0\n\nZ\n\nΩ\n\n23\n\nφψdx.\n\n\fLet us prove that p ∈ V, i.e. that its derivatives are square integrable. The change of variable\nt = L(ξ ′ )s yields the function\nR1\nφ(ξ ′ ,L(ξ ′ )s)J(ξ ′ ,L(ξ ′ )s)ds\n′\n.\np(ξ ) = 0\nR1\n′\n′\n0 J(ξ ,L(ξ )s)ds\nR1\nNow we have ∂p/∂ξd = 0 and for all ∂p/∂ξi,i=1,...,d−1 denoting a = a(ξ ′ ) = ( 0 J(ξ ′ ,L(ξ ′ )s)ds)−1 ,\nφ = φ(ξ ′ ,L(ξ ′ )s) and same for J we obtain\nZ 1\nZ 1\nZ\n∂p\n∂a 1\n∂φ ∂L\n∂φ\n=\nJds + a\nsJ ds\nφJds + a\n∂ξi\n∂ξi 0\n0 ∂ξd ∂ξi\n0 ∂ξi\n(1.3)\nZ 1\nZ 1\n∂J\n∂J ∂L\nφ\n+a\nφ\nds + a\nsds\n∂ξi\n∂ξd ∂ξi\n0\n0\nUsing all the previous bounds on the functions L and J and skipping the details of somewhat\ntedious calculations, we arrive at\n\u00132\n\u00132\nZ Z L(ξ′ ) \u0012\nZ \u0012\n∂p\n∂p\ndx =\nJdξd dξ ′\n∂ξi\nΓin 0\nΩ ∂ξi\n\u00132 \u0012\n\u00132 !\n\u0012\nZ Z L(ξ′ )\n∂φ\n∂φ\n2\nJdξd dξ ′\n+\nφ +\n≤C\n∂ξi\n∂ξd\nΓin 0\nimplying\n∂p\n∂ξi\n\n2\n\n≤C\nL2 (Ω)\n\n2\nkφkL2 (Ω) +\n\n∂φ\n∂ξi\n\n2\n\n∂φ\n+\n∂ξd\nL2 (Ω)\n\n2\nL2 (Ω)\n\n!\n\n2\n\n≤ C kφkH 1 (Ω) .\n\nThus p ∈ H 1 (Ω), hence p ∈ G and q = φ − p ∈ A. Since the dependence of p on φ is continuous\nin the norm of H 1 (Ω), a density argument shows that the decomposition φ = p + q with p ∈ G\nand q ∈ A exists for any φ ∈ V.\n• Let us now introduce the operator P as the L2 -orthogonal projector on G, that means\nP :V →G,\n\nφ ∈ V 7−→ P φ ∈ G\n\ngiven by\n\n(1.2).\n\nThen, the estimates in the preceding paragraph show that the operator P is continuous in the\nnorm of H 1 (Ω):\n||∇⊥ (P φ)||L2 (Ω) ≤ C||∇φ||L2 (Ω) ,\n\n∀φ ∈ V\n\n(1.4)\n\n∀φ ∈ V .\n\n(1.5)\n\n• We have also the following Poincaré-Wirtinger inequality:\n||φ − P φ||L2 (Ω) ≤ C||∇|| φ||L2 (Ω) ,\n\nTo prove this, it is sufficient to establish that ||q||L2 (Ω) ≤ C||∇|| q||L2 (Ω) for all q ∈ A. We observe\nthat\nZ Z L(ξ′ )\n2\n||q||L2 (Ω) =\nq 2 (ξ ′ ,ξd )J(ξ ′ ,ξd )dξd dξ ′\nΓin\n\n0\n\nand\n||∇|| φ||2L2 (Ω) =\n\nZ\n\nΓin\n\nZ\n\n0\n\nL(ξ ′ ) \u0012\n\n24\n\n∂q\n∂ξd\n\n\u00132\n\n(ξ ′ ,ξd )J(ξ ′ ,ξd )dξd dξ ′ .\n\n\fThe requirement q ∈ A is equivalent to\nZ\n\nL(ξ ′ )\n\nq(ξ ′ ,ξd )J(ξ ′ ,ξd )dξd = 0 f.a.a. ξ ′ ∈ Γin .\n\n(1.6)\n\n0\n\nWe have thus to prove for every ξ ′\nZ\n\nL(ξ ′ )\n\n2\n\n′\n\n′\n\nq (ξ ,ξd )J(ξ ,ξd )dξd ≤ C\n\n2\n\n0\n\nZ\n\n0\n\nL(ξ ′ ) \u0012\n\n∂q\n∂ξd\n\n\u00132\n\n(ξ ′ ,ξd )J(ξ ′ ,ξd )dξd\n\nprovided (1.6). Fixing any ξ ′ , making the change of integration variable ξd = L(ξ ′ )t and introducing the functions u(t) = q(ξ ′ ,L(ξ ′ )t)J(ξ ′ ,L(ξ ′ )t) and J(t) = J(ξ ′ ,L(ξ ′ )t), we rewrite the last\ninequality as\nZ\n\n0\n\nSince\n\nR1\n0\n\n1\n\nu2 (t)\nC2\ndt ≤ 2 ′\nJ(t)\nL (ξ )\n\nZ 1\u0012\n0\n\n\u00132\nu(t)\nu′ (t)\n− 2 J ′ (t) J(t)dt.\nJ(t) J (t)\n\n(1.7)\n\nu(t)dt = 0 we have by the standard Poincaré inequality\nZ\n\n0\n\n1\n\nu2 (t)dt ≤ CP2\n\nZ\n\n1\n\n2\n\n(u′ (t)) dt.\n\n(1.8)\n\n0\n\n• Let us turn to the verification of Hypothesis B'. Take any u ∈ Ṽ. We want to prove that one can\ndecompose u = p + q with p ∈ G̃ and q ∈ L and the trace of u on ∂Ωin (denoted g) is in L2 (∂Ωin ).\nIn the ξ-coordinates we can write a surface element of ∂Ωin as dσ = S(ξ ′ )dξ ′ with a function S\nsmoothly depending on ξ ′ . We see now that for u suffuciently smooth\nZ\ng 2 (ξ ′ )S(ξ ′ )dξ ′\n||g||2L2 (∂Ωin ) =\nΓin\n#\n\u0012\n\u00132\nZ 1Z \"\n∂u\n1\n2 ′\n′\n′\n′\nu (ξ ,L(ξ )s) +\n(ξ ,L(ξ )s) S(ξ ′ )dξ ′ ds\n≤C\nL(ξ ′ ) ∂ξd\n0\nΓin\n(by a one-dimensional trace inequlity)\n≤ C||u||2Ṽ\nBy density, the trace g is thus defined for any u ∈ Ṽ with ||g||L2 (∂Ωin ) ≤ C||u||Ṽ . Taking p =\np(ξ ′ ) = g(ξ ′ ) we observe by a similar calculation that ||p||L2 (Ω) ≤ C||u||Ṽ so that p ∈ G̃. By\ndefinition q = u − p ∈ L.\nAppendix B. On the choice of the finite element space Lh .\nLet Ω be the rectangle (0,Lx ) × (0,Ly ) and the anisotropy direction be constant and aligned with\nthe y-axis: b = (0,1). Let us use the Qk finite elements on a Cartesian grid, i.e. take some basis function\nθxi (x), i = 0,...,Nx and θyj (y), j = 0,...,Ny and define the complete finite element space Xh (without\nany restrictions on the boundary) as span{θxi (x)θyj (y) 0 ≤ i ≤ Nx, 0 ≤ j ≤ Ny }. The following subspace\nis then used for the approximation of the unknowns p,q,l ∈ V\nVh = {vh ∈ Xh /vh |∂ΩD = 0}.\nWe want to prove that taking for the approximation of λ,μ ∈ L the space Lh under the form\nLh = {λh ∈ Xh /λh |∂Ωin = 0},\n25\n\n(2.1)\n\n\fleads to an ill posed problem (3.1).\nClaim There exist λh ∈ Lh , λh 6= 0, such that a|| (λh ,ph ) = 0 for all ph ∈ Vh . In fact there are exactly\n2Ny linearly independent functions having this property.\nRemark B.1. In the continuous case, the equation\na|| (p,λ) = 0,\n\n∀p ∈ V ,\n\nimplies λ = 0 by density arguments. These density arguments are lost when discretizing the spaces V\nresp. L.\nProof of the Claim. We can suppose that the basis functions θij (x,y)\nP := θxi (x)θyj (y) are enumerated\nso that θij (0,y) = 0 for all i ≥ 1 and θ0j (0,y) 6= 0. Hence for all ph = pij θij ∈ Vh , the coefficients satisfy\np0j = 0 since the part of the\nR boundary {x = 0} is in ∂ΩD . Let M = (mik )0≤i,k≤Nx be the mass matrix\nin the x-direction: mik = θxi (x)θxk (x)dx. This matrix is invertible, hence there is a vector a ∈ RNx +1\nNx +1\nt\nthat solves M a =\n, e = (1,0,...,0)\n. Take any fixed integer j, 1 ≤ j ≤ Ny and define\nPe with e ∈ R\nP\nλh ∈ Lh as λh = ai θij . Then, for all ph = pkl θkl ∈ Vh we have\nZ\nX\n∂θij ∂θkl\ndxdy\na|| (λh ,ph ) =\nai pkl\nΩ ∂y ∂y\ni,k,l\nZ Ly\nZ Lx\nX\nθy′ j (y)θy′ l (y)dy\n=\nθxi (x)θxk (x)dx\nai pkl\n=\n\nX\nk,l\n\n0\n\n0\n\ni,k,l\n\nδk0 pkl\n\nZ\n\n0\n\nLy\n\nθy′ j (y)θy′ l (y)dy = 0.\n\nAs we can do this for all (i,j), i = 0, 1 ≤ j ≤ Ny and in the same manner for all (i,j), i = Nx, 1 ≤ j ≤ Ny ,\nthere are 2Ny linearly independent functions with the property a|| (λh ,ph ) = 0 for all ph ∈ Vh .\nWe see now that the system (3.1) with zero right hand side f = 0 possesses non-zero solutions\n(pεh , λεh , qhε , lhε , μεh ) = (0,λjh ,0,0,0) where λjh is any of the functions constructed in the preceding paragraph. It means that (3.1) is ill posed, i.e. the corresponding matrix is singular.\nAcknowledgement. This work has been supported by the Marie Curie Actions of the European Commission under the contract DEASE (MEST-CT-2005-021122), by the French 'Commissariat\nà l'Energie Atomique (CEA)' under contracts ELMAG (CEA-Cesta 4600156289), and GYRO-AP\n(Euratom-CEA V 3629.001), by the Agence Nationale de la Recherche (ANR) under contract IODISEE\n(ANR-09-COSI-007-02), by the 'Fondation Sciences et Technologies pour l'Aéronautique et l'Espace\n(STAE)' under contract PLASMAX (RTRA-STAE/2007/PF/002) and by the Scientific Council of the\nUniversité Paul Sabatier, under contract MOSITER. Support from the French magnetic fusion programme 'fédération de recherche sur la fusion par confinement magnétique' is also acknowledged. The\nauthors would like to express their gratitude to G. Gallice and C. Tessieras from CEA-Cesta for bringing their attention to this problem, to G. Falchetto, X. Garbet and M. Ottaviani from CEA-Cadarache,\nfor their constant support to this research programme.\nREFERENCES\n[1] J. Adam, J. Boeuf, N. Dubuit, M. Dudeck, L. Garrigues, D. Gresillon, A. Heron, G. Hagelaar, V. Kulaev, N. Lemoine,\net al. Physics, simulation and diagnostics of Hall effect thrusters. Plasma Physics and Controlled Fusion,\n50:124041, 2008.\n[2] P. R. Amestoy, I. S. Duff, J.-Y. L'Excellent, and J. Koster. A fully asynchronous multifrontal solver using distributed\ndynamic scheduling. SIAM J. Matrix Anal. Appl., 23(1):15–41, 2001.\n26\n\n\f[3] S. F. Ashby, W. J. Bosl, R. D. Falgout, S. G. Smith, A. F. Tompson, and T. J. Williams. A Numerical Simulation\nof Groundwater Flow and Contaminant Transport on the CRAY T3D and C90 Supercomputers. International\nJournal of High Performance Computing Applications, 13(1):80–93, 1999.\n[4] M. Beer, S. Cowley, and G. Hammett. Field-aligned coordinates for nonlinear simulations of tokamak turbulence.\nPhysics of Plasmas, 2(7):2687, 1995.\n[5] C. Besse, P. Degond, F. Deluzet, J. Claudel, G. Gallice, and C. Tessieras. A model hierarchy for ionospheric plasma\nmodeling. Math. Models Methods Appl. Sci., 14(3):393–415, 2004.\n[6] C. Besse, F. Deluzet, C. Negulescu, and C. Yang. Three dimensional simulation of ionsphoric plasma disturbences.\nin preparation.\n[7] A. H. Boozer. Establishment of magnetic coordinates for a given magnetic field. Physics of Fluids, 25(3):520–521,\n1982.\n[8] S. Brull, P. Degond, and F. Deluzet. Numerical degenerate elliptic problems and their applications to magnetized\nplasma simulations. in preparation.\n[9] P. Crispel, P. Degond, and M.-H. Vignal. An asymptotic preserving scheme for the two-fluid Euler-Poisson model\nin the quasineutral limit. J. Comput. Phys., 223(1):208–234, 2007.\n[10] P. Degond, F. Deluzet, L. Navoret, A.-B. Sun, and M.-H. Vignal. Asymptotic-preserving particle-in-cell method for\nthe vlasov-poisson system near quasineutrality. J. Comput. Phys., 229(16):5630–5652, 2010.\n[11] P. Degond, F. Deluzet, and C. Negulescu. An asymptotic preserving scheme for strongly anisotropic elliptic problems.\nMultiscale Model. Simul., 8(2):645–666, 2009/10.\n[12] P. Degond, F. Deluzet, A. Sangam, and M.-H. Vignal. An asymptotic preserving scheme for the Euler equations in\na strong magnetic field. J. Comput. Phys., 228(10):3540–3558, 2009.\n[13] F. Deluzet, A. Lozinski, J. Narski, and C. Negulescu. Error estimates for an asymptotic-preserving method for\nhighly anisotropic diffusion equations. in preparation.\n[14] W. D. D'haeseleer, W. N. G. Hitchon, J. D. Callen, and J. L. Shohet. Flux coordinates and magnetic field structure.\nA guide to a fundamental tool of plasma theory. Springer Series in Computational Physics. Springer-Verlag,\nBerlin, 1991.\n[15] A. M. Dimits. Fluid simulations of tokamak turbulence in quasiballooning coordinates. Phys. Rev. E, 48(5):4070–\n4079, Nov 1993.\n[16] M. W. Gee, J. J. Hu, and R. S. Tuminaro. A new smoothed aggregation multigrid method for anisotropic problems.\nNumer. Linear Algebra Appl., 16(1):19–37, 2009.\n[17] L. Giraud and R. S. Tuminaro. Schur complement preconditioners for anisotropic problems. IMA J. Numer. Anal.,\n19(1):1–18, 1999.\n[18] V. Grandgirard, Y. Sarazin, X. Garbet, G. Dif-Pradalier, P. Ghendrih, N. Crouseilles, G. Latu, E. Sonnendrücker,\nN. Besse, and P. Bertrand. Computing ITG turbulence with a full-f semi-lagrangian code. Communications in\nNonlinear Science and Numerical Simulation, 13(1):81 – 87, 2008.\n[19] S. Hamada. Hydromagnetic equilibria and their proper coordinates. Nucl. Fusion, 2:23–37, 1962.\n[20] T. Y. Hou and X.-H. Wu. A multiscale finite element method for elliptic problems in composite materials and\nporous media. J. Comput. Phys., 134(1):169–189, 1997.\n[21] Y. Igitkhanov, M. Mikhailov, and W. Feneberg. Fluid Description of Edge Plasma Transport in a Non-Orthogonal\nCoordinate System. Contributions to Plasma Physics, 34(2-3):398–403, 1994.\n[22] S. Jin. Efficient asymptotic-preserving (AP) schemes for some multiscale kinetic equations. SIAM J. Sci. Comput.,\n21(2):441–454, 1999.\n[23] E. Kaveeva and V. Rozhansky. Poloidal and toroidal flows in tokamak plasma near magnetic islands. Technical\nphysics letters, 30(7):538–540, 2004.\n[24] M. Kelley, W. Swartz, and J. Makela. Mid-latitude ionospheric fluctuation spectra due to secondary EŨB instabilities. Journal of Atmospheric and Solar-Terrestrial Physics, 66(17):1559–1565, 2004.\n[25] M. Keskinen. Nonlinear theory of the E× B instability with an inhomogeneous electric field. Journal of Geophysical\nResearch, 89(A6):3913–3920, 1984.\n[26] M. Keskinen, S. Ossakow, and B. Fejer. Three-dimensional nonlinear evolution of equatorial ionospheric spread-F\nbubbles. Geophys. Res. Lett, 30(16):4–1–4–4, 2003.\n[27] B. N. Khoromskij and G. Wittum. Robust Schur complement method for strongly anisotropic elliptic equations.\nNumer. Linear Algebra Appl., 6(8):621–653, 1999.\n[28] I. Llorente and N. Melson. Robust multigrid smoothers for three dimensional elliptic equations with strong\nanisotropies. ICASE Technical Report: TR-98-37, 1998.\n[29] T. Manku and A. Nathan. Electrical properties of silicon under nonuniform stress. Journal of Applied Physics,\n74(3):1832–1837, 1993.\n[30] J. M. Melenk. hp-finite element methods for singular perturbations, volume 1796 of Lecture Notes in Mathematics.\nSpringer-Verlag, Berlin, 2002.\n[31] K. Miyamoto. Controlled fusion and plasma physics. Chapman & Hall, 2007.\n[32] Y. Notay. An aggregation-based algebraic multigrid method. Report GANMN 08-02, Université Libre de Bruxelles,\nBrussels, Belgium, 2008.\n[33] M. A. Ottaviani. An alternative approach to field-aligned coordinates for plasma turbulence simulations.\n27\n\n\farXiv:1002.0748, 2010.\n[34] L. S. Pontryagin. Ordinary differential equations. Addison-Wesley Publishing Co., Inc., Reading, Mass.-Palo Alto,\nCalif.-London, 1962.\n[35] D. Stern. Geomagnetic Euler potentials. J. geophys. Res, 72(15):3995–4005, 1967.\n[36] A. M. Tréguier. Modélisation numérique pour l'océanographie physique. Ann. Math. Blaise Pascal, 9(2):345–361,\n2002.\n[37] W.-W. Wang and X.-C. Feng. Anisotropic diffusion with nonlinear structure tensor. Multiscale Model. Simul.,\n7(2):963–977, 2008.\n[38] J. Weickert. Anisotropic diffusion in image processing. European Consortium for Mathematics in Industry. B. G.\nTeubner, Stuttgart, 1998.\n\n28\n\n\f"}