{"id": "http://arxiv.org/abs/0810.2968v2", "guidislink": true, "updated": "2008-10-31T16:27:08Z", "updated_parsed": [2008, 10, 31, 16, 27, 8, 4, 305, 0], "published": "2008-10-16T17:28:09Z", "published_parsed": [2008, 10, 16, 17, 28, 9, 3, 290, 0], "title": "Integrability and Chaos - algebraic and geometric approach", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0810.1907%2C0810.1021%2C0810.4304%2C0810.1917%2C0810.2713%2C0810.1108%2C0810.4951%2C0810.5006%2C0810.5414%2C0810.4388%2C0810.1277%2C0810.5060%2C0810.3355%2C0810.1706%2C0810.3633%2C0810.1467%2C0810.3761%2C0810.2295%2C0810.0403%2C0810.3847%2C0810.2057%2C0810.2843%2C0810.5017%2C0810.2589%2C0810.3501%2C0810.4726%2C0810.2968%2C0810.0810%2C0810.3976%2C0810.0249%2C0810.3829%2C0810.3405%2C0810.2193%2C0810.2153%2C0810.1331%2C0810.5130%2C0810.4170%2C0810.4930%2C0810.4345%2C0810.5048%2C0810.1728%2C0810.5040%2C0810.5731%2C0810.3217%2C0810.1092%2C0810.0595%2C0810.1251%2C0810.2478%2C0810.2473%2C0810.0527%2C0810.1062%2C0810.4941%2C0810.3059%2C0810.0189%2C0810.1678%2C0810.0099%2C0810.1138%2C0810.5063%2C0810.5230%2C0810.2672%2C0810.5100%2C0810.3085%2C0810.4982%2C0810.1358%2C0810.0453%2C0810.2502%2C0810.0233%2C0810.4108%2C0810.2268%2C0810.0979%2C0810.0161%2C0810.4823%2C0810.5102%2C0810.3646%2C0810.1886%2C0810.4998%2C0810.0229%2C0810.4706%2C0810.5598%2C0810.1183%2C0810.1690%2C0810.2567%2C0810.4403%2C0810.3770%2C0810.0954%2C0810.0928%2C0810.2364%2C0810.4651%2C0810.2824%2C0810.3678%2C0810.3538%2C0810.5218%2C0810.5463%2C0810.2084%2C0810.0011%2C0810.5766%2C0810.4500%2C0810.3902%2C0810.4157%2C0810.2197%2C0810.3005&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Integrability and Chaos - algebraic and geometric approach"}, "summary": "This thesis presents two descriptions of complexity in dynamical systems. The\nalgebraic approach deals with the differential Galois group theory and its\nrestrictions on integrability. The geometric part is a formulation of dynamics\nin the language of differential geometry with particular application to\nLyapunov exponents and variational equations. The algorithm for calculating the\nLyapunov spectrum is illustrated with three examples.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0810.1907%2C0810.1021%2C0810.4304%2C0810.1917%2C0810.2713%2C0810.1108%2C0810.4951%2C0810.5006%2C0810.5414%2C0810.4388%2C0810.1277%2C0810.5060%2C0810.3355%2C0810.1706%2C0810.3633%2C0810.1467%2C0810.3761%2C0810.2295%2C0810.0403%2C0810.3847%2C0810.2057%2C0810.2843%2C0810.5017%2C0810.2589%2C0810.3501%2C0810.4726%2C0810.2968%2C0810.0810%2C0810.3976%2C0810.0249%2C0810.3829%2C0810.3405%2C0810.2193%2C0810.2153%2C0810.1331%2C0810.5130%2C0810.4170%2C0810.4930%2C0810.4345%2C0810.5048%2C0810.1728%2C0810.5040%2C0810.5731%2C0810.3217%2C0810.1092%2C0810.0595%2C0810.1251%2C0810.2478%2C0810.2473%2C0810.0527%2C0810.1062%2C0810.4941%2C0810.3059%2C0810.0189%2C0810.1678%2C0810.0099%2C0810.1138%2C0810.5063%2C0810.5230%2C0810.2672%2C0810.5100%2C0810.3085%2C0810.4982%2C0810.1358%2C0810.0453%2C0810.2502%2C0810.0233%2C0810.4108%2C0810.2268%2C0810.0979%2C0810.0161%2C0810.4823%2C0810.5102%2C0810.3646%2C0810.1886%2C0810.4998%2C0810.0229%2C0810.4706%2C0810.5598%2C0810.1183%2C0810.1690%2C0810.2567%2C0810.4403%2C0810.3770%2C0810.0954%2C0810.0928%2C0810.2364%2C0810.4651%2C0810.2824%2C0810.3678%2C0810.3538%2C0810.5218%2C0810.5463%2C0810.2084%2C0810.0011%2C0810.5766%2C0810.4500%2C0810.3902%2C0810.4157%2C0810.2197%2C0810.3005&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "This thesis presents two descriptions of complexity in dynamical systems. The\nalgebraic approach deals with the differential Galois group theory and its\nrestrictions on integrability. The geometric part is a formulation of dynamics\nin the language of differential geometry with particular application to\nLyapunov exponents and variational equations. The algorithm for calculating the\nLyapunov spectrum is illustrated with three examples."}, "authors": ["Tomasz Stachowiak"], "author_detail": {"name": "Tomasz Stachowiak"}, "author": "Tomasz Stachowiak", "arxiv_comment": "PhD thesis. 41 pages, 9 figures", "links": [{"href": "http://arxiv.org/abs/0810.2968v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0810.2968v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.MP", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "nlin.CD", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0810.2968v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0810.2968v2", "journal_reference": null, "doi": null, "fulltext": "arXiv:0810.2968v2 [math-ph] 31 Oct 2008\n\nIntegrability and Chaos – algebraic and\ngeometric approach\n\nTomasz Stachowiak\n\nDoctoral thesis written under the supervision of\nprofessor Marek Szydłowski\n\nJagiellonian University, Kraków\nOctober 1st, 2008\n\n\f\fContents\n1 Introduction\n\n5\n\n2 Algebraic Approach to Integrability\n2.1 Differential Galois theory . . . . . . . . . . . . . . . . . . . . .\n\n7\n8\n\n3 Geometric View\n3.1 The variational equations . . . . . . . . . . . .\n3.2 Projected variational and deviation equations .\n3.3 The Raychaudhuri equation . . . . . . . . . . .\n3.4 Higher order variational equations . . . . . . .\n3.5 First integrals . . . . . . . . . . . . . . . . . . .\n3.6 Normal variational equations . . . . . . . . . .\n3.7 Lyapunov exponents . . . . . . . . . . . . . . .\n3.8 On some additional properties . . . . . . . . . .\n\n.\n.\n.\n.\n.\n.\n.\n.\n\n12\n13\n14\n16\n19\n21\n23\n24\n27\n\n4 Examples\n4.1 Arnold-Beltrami-Childress flow . . . . . . . . . . . . . . . . . .\n4.2 so(5) Gross-Neveu system . . . . . . . . . . . . . . . . . . . . .\n4.3 Friedmann-Robertson-Walker cosmology . . . . . . . . . . . .\n\n30\n30\n32\n35\n\n5 Final Matters\n\n38\n\n3\n\n.\n.\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\n.\n.\n.\n.\n\n\f\fChapter 1\n\nIntroduction\nThe aim of the present work is to show how the algebraic approach to the\nquestion of integrability can be given geometric foundations. The notion of\nfirst integrals for dynamical systems (Hamiltonian in particular) is almost\nalways formulated with the tacit assumptions that the underlying phase\nspace is Euclidean (or given the additional symplectic structure). The concept of the metric structure, crucial for Manifolds, is usually omitted – and\nno wonder, since there is no clear way to introduce a distinguished norm for\na general system.\nFor Lagrangian mechanics there is an equivalent description by means\nof the Jacobi or Eisenhart metric with which the flow of the system can be\nmade geodesic with respect to precisely determined notion of length [21, 5].\nHowever, this only takes into account the configuration space of the system,\nnot the whole phase space, which means that for a Hamiltonian system one\nonly considers the coordinate subspace with second order equations on it\nand nothing is said about momenta. This is unacceptable when the characteristic exponents, or chaos is to be investigated – the possibly exponential\ndivergence of the trajectories has to be analysed in the full phase space.\nInstead of trying to find one canonical structure, this work presents the\ngeneral view that differential geometry has to offer in that topic. A dynamical system is analysed on a Riemannian manifold, to show how the\nwell-known equations and definitions have to be modified, with a special\nview to the questions of integrability and Lyapunov exponents. The latter\nare examined in detail to obtain a differential equation whose solutions are\nthe so called \"time-dependent\" exponents, which tend to the standard ones\nin infinite time.\nThe integrability chosen for study here is generally understood to be the\nexistence of enough first integrals (in involution for the Hamiltonian systems), which are meromorphic functions over the complexified phase space.\nOn the one hand, this bears clear consequences on the geometric picture\nand is easily translated into the language of differential geometry. On the\nother, the question of proving such existence leads to the deeply algebraic\nproperties of the system such as the analytic continuation of the solutions\nin complex time, the differential Galois group and solvability of linear differential equations by quadratures.\nThe group-theoretic approach relies on particular solutions and com5\n\n\fputations of explicit equations in some coordinate systems. As mentioned\nbefore, it is usually silently assumed from the beginning that the manifold is Euclidean which leads to significant simplifications when it comes to\nderivations, vectors and matrices. Differential geometry requires that we\nuse covariant derivatives, tensors and distinguish between 1-forms and vectors. It seems like an unnecessary complication to add but as it turns out,\nmany theorems are much more straightforward to prove (like the existence\nof integrals of higher variational equations for example), some concepts like\nself-adjoint operators appear naturally and allow for applications of known\ntheorems from other branches of mathematics and last but not least, it is\npossible to identify which structures are in fact of geometric origin, which\ncan be defined as coordinate invariant and which are only justified by the\nefficiency of calculation.\nThe main body of this thesis is divided into two parts. In Chapter 2 the\ndifferential Galois group fundamentals are explained, and the basic definitions and steps in investigating integrability are described. Next, Chapter\n3 deals with the geometric approach, showing how the concepts introduced\nearlier need to be changed, how general dynamical systems are described\nin this language and finally showing how Lyapunov exponents can be consistently introduced in a covariant way and how this leads directly into an\neasily applicable numerical routine. Since the notation is index-free (stressing the independence from coordinate systems or even coordinate bases) almost all derivations are given in detail. The reason for this is first to make\nit possible to follow exactly the flow of exposition if the reader so wishes,\nand second the fact that there seem to be very few practical applications of\nthe notation. Hopefully, the successful formulation of the basics of phase\nspace dynamics presented here will prove it is not reserved for pure mathematics only.\nThe third part of this work contains three examples on applying the\nLyapunov exponents formula or algorithm, and simple comparison of the\nalgebraic formulation of the normal variational equations versus the same\nequations as obtained for the simplest Euclidean manifold with the LeviCivita connection.\n\n6\n\n\fChapter 2\n\nAlgebraic Approach to\nIntegrability\nIntegrability is mostly synonymous with existence of first integrals – functions that are constant along the solution. However, for some classes of\ndynamical systems there are additional, specific requirements.\nConsider a general autonomous system\nẋi =\n\ndxi\n= vi (x),\nds\n\ni = 1, . . . , N.\n\n(2.1)\n\nIt is said to be integrable in the Euler sense if there exist N −1 first integrals\nJi , which means that for i = 1, . . . , N − 1\n∂Ji\nvk = 0.\nJ ̇i =\n∂xk\n\n(2.2)\n\nNote that only N − 1 integrals are required, since they formally reduce\nthe system to a one dimensional one, which can be solved by a quadrature.\nThat last step gives rise to another constant, which can be considered as\nthe N -th first integral. In the case of autonomous systems this reflects the\nfreedom of translating the solution \"in time\", or along the trajectory.\nMost physical systems posses additional structure of being Hamiltonian.\nThe dimension is then necessarily even N = 2K, with the first K coordinates customarily denoted qi , and the other K – called momenta – denoted\npi . The system then has the following form\n∂H\n,\n∂pi\n∂H\np ̇i = −\n,\n∂qi\nq ̇i =\n\n(2.3)\ni = 1, . . . , K,\n\nwhere H is called the Hamiltonian of the system.\nWhile the first integrals are defined exactly as above, these systems are\nsuch a restricted class, that much less is needed for integrability. We say\nthat s Hamiltonian system is integrable in the Liouville sense when it has K\n\n7\n\n\ffirst integrals which are in involution. The additional requirement means\nthat for any two Ji and Jk\n[Ji , Jk ] :=\n\nK \u0012\nX\n∂Ji ∂Jk\nj=1\n\n∂qj ∂pj\n\n−\n\n∂Ji ∂Jk\n∂pj ∂qj\n\n\u0013\n\n= 0.\n\n(2.4)\n\nBy construction the Hamiltonian is itself a first integral, and is in involution with any other additional first integral, as\n ̇\n[J, H] = J.\n\n(2.5)\n\nThese are only the basic facts and notation needed here, and a complete exposition of the topic can be found in [1, 6]. The aspect of algebraic\nformulation of integrability that is of main interest in this work is the existence of first integrals and the criteria or tests of this property. There are\nno general algorithms for finding constants of motion explicitly, which goes\nhand in hand with the fact that solvable systems are a rare exception (zero\nmeasure set) among all dynamical systems. There are however conditions\nwhich integrable systems must satisfy (i.e. necessary conditions) and that\nallows of excluding most systems so that only a few particular cases potentially solvable are left. They can then be subject to a more detailed analysis\nnot possible for a whole general class of systems. The method described in\nthe next section deals with necessary conditions of existence of first integrals and is one of the most restrictive. It has been successfully applied to\nmany systems, determining completely the cases which are non-integrable.\nFor example, it has been proven that a Hamiltonian system with a homogeneous polynomial potential and natural kinetic part of any dimension is\nonly integrable in at most finite number of cases [17]. For other examples\nof application see [16, 19, 15], and [14, 2] for a detailed introduction.\n\n2.1 Differential Galois theory\nThe first step required for this approach is to linearise the general equations (2.1) around a particular, non-constant solution ψ(s) so that\n(1)\n\nxi (s) = ψi (s) + εxi\n\n(2)\n\n+ ε2 xi\n\n+ ...,\n\n(2.6)\n\nwhere ǫ is some small parameter, and each x(n) is called the n-th variation.\nThe original equation then yields in each order of ε the n-th variational\nequation\n∂vi\n(n)\n(n)\n(n)\n(2.7)\nx + fi (ψ, x(1) , . . . , x(n−1) ),\nẋi =\n∂xj ψ j\nwith f (1) identically zero, and in general polynomial in the variations. It\nis the first variational equation (VE) that will be of most interest, although\nthe higher ones are also influenced by integrability providing further necessary conditions [14].\nAs the VE is linear it has N linearly independent solutions, and one of\nthem is simply ψ̇. If one imagines that the components of x(1) represent\nseparation of two nearby trajectories of the full system then this trivial\n8\n\n\fsolution corresponds to the displacement relative to the same trajectory\ntranslated in the independent variable s. It is called the tangential part of\nthe VE. Although it is easily solvable on its own, the complete VE might\nstill as a whole indicate non-integrability. However, there are N of them,\nand for the sake of practicality, one is almost often forced to work with the\ncomponents left after discarding the tangential part. This fact gives rise to\nthe normal variational equations.\nFormally, the normal bundle is defined to be Nψ M := Tψ M/Tψ, where\nfor brevity ψ also denotes the trajectory associated with the particular solution ψ(s), and M is the base manifold of the original system. The projection\nπ : Tψ M → Nψ M is then used to construct the normal variational equations\n\u0013\n\u0012\n∂v\n−1\n◦ π (y) , y ∈ Nψ M.\n(2.8)\nẏ = π\n∂x\nIn this approach, there is no metric structure so, strictly speaking, there is\nno orthogonality of the normal components to the tangent ones. Usually,\nthe particular solution appears when the first N − 1 dependent variables x\nare equal to some constants and ψ is determined by 1 differential equation.\nAssuming the Euclidean structure (of both the base manifold M and thus\nalso of the fibre of TM ), the tangential part of VE is associated with the\ndirection xN and the remaining directions are treated as normal.\nWith Hamiltonian systems, the reduction involves one more step, as\nthere is the first integral H, which can also be used. One more degree\nof freedom is eliminated by considering the system (2.8) on the constant\nenergy hyper-surface. In terms of the linear variations this means\ndH ◦ π −1 (y) = 0.\n\n(2.9)\n\nThis time the particular solution is sought for so that N − 2 variables are\n(e.g.) zero and a pair of qK and pK are left to provide a second order equation\nfor ψ. The above reduction by 2 degrees of freedom then gives the NVE\ninvolving only qi and pi for i = 1, . . . , K − 1 (where, as before, N = 2K).\nIn any case what is left is a set of (non-autonomous) linear differential\nequations\nẏ = A(s)y,\n(2.10)\nfor which it is possible to define the monodromy group M. When the independent variable is considered as complex, one can ask how the fundamental matrix of solution changes after analytic continuation of the solutions\nin closed loops around a point s0 . Since it must be a linear function of the\ninitial fundamental matrix, a matrix multiplier is obtained, and after considering all loops, one ends up with a whole group. This subgroup of GL(C)\nwill be an image of the fundamental group π1 (Ψ, s0 ) of the Riemann surface\nΨ defined by the solution ψ.\nThe existence of a first integrals J of the main system implies there is\nalso a first integrals of the (normal) variational equations\n∂J\n∂xi\n\n(1)\n\nxi\n\n= const,\n\n(2.11)\n\nψ\n\nprovided the gradient does not vanish on the trajectory ψ, but even then\nthe higher derivatives yield a first integral (they cannot all vanish for then\n9\n\n\fJ would trivially be zero). This will be presented in more detail in the next\nchapter, as at present it is enough to notice that the above formula gives a\nfunction f such that\nf (x(1) ) = f (g(x(1) )),\n(2.12)\nfor all g in M. Such f is called a first integral of the group and it was shown\nby Ziglin [23] that if the main system has a meromorphic first integral then\nthe monodromy group has a rational first integral. That fact alone can be\nused for the study of integrability, but since the above can be refined still,\nlet us pass to the Galois theory itself.\nFor a linear system (2.10), with the coefficients in some differential field\nK ∋ A(s) (for example the rational functions of s, C(s), with the standard\nderivation of d/ds), the solution almost never lies in K but in a larger field\nF ⊃ K. If the field extension is generated by all the linearly independent\nsolutions of the given equation, the field F is called a Piccard-Vessiot extension of K. It is (up to an isomorphism) unique, and allows to define the\ndifferential Galois group G of (2.10), as the group of automorphisms of F\nthat leave elements of K fixed and commute with the derivation.\nThe Galois group is bigger than the monodromy group, and in the special\ncase of the equations being Fuchsian, M is dense in G. It is still an algebraic\nsubgroup of GL(K ′ ), where K ′ is the field of constants of K (C in most\napplications). It is still the case that there exist integrals of the Galois\ngroup, when there are integrals of the dynamical system. This leads to two\nimportant properties.\n1. When the system is integrable in the Euler sense with meromorphic\nfirst integrals, the Galois group of the normal variational equations is\nfinite.\n2. For Hamiltonian systems which are integrable in the Liouville sense\nwith meromorphic first integrals in involution, the identity component of the Galois group of the (normal) variational equations is abelian.\nThe above are fundamental theorems of the theory, but for practical applications one is usually interested in the consequences for the solutions of\nthe NVE. In the former case the solutions lie in an algebraic extension of\nthe field K, and in the latter in a (generalised) Liouvillian extension. Such\nan extension is a formally defined concept of a solution in a \"closed form\"\nand arises from K after finitely many steps each of which consists of including one of three types of a new element: one that is algebraic over K, its\nderivative lies in K or the derivative of its logarithm lies in K.\nIn physical applications, the NVE are usually of the order two, and there\nis a general tool for checking the above property: the Kovacic algorithm\n[10]. There are also particular results for special families of equations like\nthe Riemann P-equation [8] or Lamé equation [4], which give explicit conditions on the equations' parameters for their solution to be Liouvillian. The\nexamples cited in the previous section show how effective the method is –\nreducing a general problem of the existence of first integrals to the question\nof solvability of linear differential equations.\nBefore the other (geometric) description is presented, one remark is in\norder. Although the Galois group approach is applied to physical systems,\n\n10\n\n\ffor which one naturally considers the variables to be real, the mathematical\n\"workshop\" is located in the complex domain. This means that not only\nthe dependent variables but also the time itself can be imaginary, and this\nhas several implications. First of all, for all physical systems where one\nassumes sufficient smoothness, the lack of complex integrals implies the\nlack of real ones (as a special case). However, there are systems for which\nthere exist real smooth integrals, that are not even real-analytic [7]. Thus,\nintegrability is always depends on the domain considered, and the family\nof functions considered \"good enough\" to be first integrals.\nSecondly, some systems although non-integrable behave chaotically in\nthe imaginary phase space and not in the real one. A particular example\nof that is the Gross-Neveu system analysed in [12], which will also be studied here with the help of Lyapunov exponents. Since the algebraic theory\nis usually studied without much input of differential geometry (as there is\nusually no need for metric structure) the exact connection between integrability and geometric concepts like exponential separation of trajectories\nor topological chaos remains elusive. The next chapter is thus devoted to\ntreating dynamical system with more detailed differential geometry and, as\nan example, giving a new formulation of the Lyapunov exponents together\nwith some implications that first integrals enforce and practical results.\n\n11\n\n\fChapter 3\n\nGeometric View\nThroughout this chapter the index-free, operator notation will be used, and\nthe convention is mostly that of [18] or [9] – the reader can find in depth\nintroduction to the subject in those two books.\nVectors and 1-forms will be denoted by bold symbols, and A, B, X, X 1 ,\nX 2 and so on will mean arbitrary vectors and φ will signify any 1-form\n(usually used to define an operator or prove an equality). Vectors will be\nconsidered to act on functions as differential operators so that in a coordinate map u\nN\nX\n∂f\nX(f ) =\nXi i ,\n(3.1)\n∂u\ni=1\n\nwhere N is the dimension of the base manifold.\u0001\nThe covariant derivative ∇ is defined for k1 type tensors (the exterior\ntangent bundle strictly speaking) by the property\n∇(β ⊗ X) = dβ ⊗ X + (−1)k β ∧ ∇X,\n\n(3.2)\n\nwith β being a k-form (or a function for k = 0). And the connection itself is\nfully characterised by its action on any basis {E i }\nX\nΩij ⊗ E j ,\n(3.3)\n∇Ei =\nj\n\nwhere Ω is a matrix of 1-forms (not a tensor). It allows to define the torsion\ntensor, the curvature endomorphism and the Ricci tensor as\nT (X 1 , X 2 ) := ∇X 1 X 2 − ∇X 2 X 1 − [X 1 , X 2 ],\nR(X1 , X2 )A := (∇X 1 ∇X 2 − ∇X 2 ∇X 1 − ∇[X 1 ,X 2 ] )A\n\n(3.4)\n\nR(A, B) := tr(X → R(A, X)B).\n\nWith the introduction of the metric structure (a symmetric tensor) g\ng(X 1 , X 2 ) → hX 1 , X 2 i ∈ R,\n\n(3.5)\n\nthe Levi-Civita (torsionless and Riemannian) connection can be introduced\nby taking\nT = 0,\n(3.6)\nd hX 1 , X 2 i = h∇X 1 , X 2 i + hX 1 , ∇X 2 i .\n12\n\n\fThe second requirement implies also\nX\nη(X 1 , . . . , ∇X j , . . . , X N ),\ndη(X 1 , . . . , X N ) =\n\n(3.7)\n\nj\n\nfor the volume form η. The metric also allows to define the Riemann tensor\nR(X 1 , X 2 , A, B) = hR(X 1 , X 2 )A, Bi .\n\n(3.8)\n\nThe interior product ι is defined as\n(ιX ζ)(X 1 , . . . , X k ) := ζ(X, X 1 , . . . , X k ),\n\n(3.9)\n\nwhere ζ is some (k + 1)-form. The following property of the Lie derivative\n£ will also be useful at some point\n£X ζ = d(ιX ζ) + ιX (dζ).\n\n(3.10)\n\n3.1 The variational equations\nConsider now the following construction (Figure 3.1). Given the field V and\na curve γ(0, l) (not being one of the field's integral curves), we can construct\nthe image of γ(l) under the flow of V with s = s1 . The image curve will be\ndenoted by γ(s1 , l), and by using the same l we understand, that each point\nof the new curve is the image of a point of the original curve for that value\nof l. Thus, the parameter l, which needs not be the natural parameter, gives\n∂\ntangent to family of transformed curves\nrise to a new vector field Z := ∂l\n(along with the original one).\n\nZr\n\nVr\n\nVx\n\ngs1 HpL=r\n\nx=gs1 HqL=h{1 HrL\n\nZx\nΓHs1 ,{L\nΓHs,{L\n\nVp\n\nZp\np\n\nVq\nΓHs,0L\n\nh{1 HpL=q\n\nZq\n\nΓH0,{L\n\nFigure 3.1: A visualisation of the family of curves γ(s, l) generated by the\nfields V and Z (with their dependence on the point indicated).\n\n13\n\n\fBy construction, for any two points p and q on γ(0, l) carried into r and x\non γ(s1 , l) the differences of their l values are the same. Or, in other words,\nthat the flows generated by V and Z (g and h respectively) commute\ngs1 (hl1 (p)) = hl1 (gs1 (p)) ⇐⇒ [V , Z] = 0.\n\n(3.11)\n\nTaking into account that the connection is torsion-free, this will allow us to\ntransform the derivative of Z along γ(s).\nT (V , Z) − [V , Z] = ∇V Z − ∇Z V = 0\n\n⇒\n\nD\nZ := ∇V Z = ∇Z V , (3.12)\n∂s\n\nwhich is, in fact, the first variational equation (VE)\nŻ = (∇V )(Z),\n\n(3.13)\n\nwhere the dot will, from now on, denote the covariant derivative along the\nfield V .\n\n3.2 Projected variational and deviation equations\nLet us introduce the operator h projecting a vector field on the normal (with\nrespect to V ) bundle NM\nh=1−υ⊗V,\n(3.14)\nwhere υ is a one-form dual to V given by\nυ(X) =\n\nhV , Xi\n,\nhV , V i\n\n(3.15)\n\nso that υ(V ) = 1. Obviously we have\nh2 = h,\n\nh(V ) = 0,\n\n(3.16)\n\nand for constant norm of V\nh∇V , V i = 0 ⇒ υ(∇V ) = 0.\n\n(3.17)\n\nThe norm will also be written shortly as 1/N := hV , V i, and will be included\nexplicitly in calculations so that all the formulae hold also in the Lorentzian\ncase N = −1. For brevity, a projected vector will also be denoted by\n⊥Z\n\n:= h(Z).\n\nConsider now the derivative of the projection along the curve γ(s)\nD\n⊥Z = ∇V (Z − υ(Z)V )\n∂s\n= ∇Z V − υ(Z)∇V V − (∇V υ(Z))V\n= ∇(Z−υ(Z)V ) V − (∇V υ(Z))V\n= ∇⊥Z V − V (υ(Z))V ,\n14\n\n(3.18)\n\n\fwhere we have used the commutation property (3.12). Acting with h on\nboth sides of the above equality we obtain\n⊥\n\nD\n⊥Z = ⊥∇⊥Z V .\n∂s\n\n(3.19)\n\nTo obtain the deviation equation we differentiate again\nD D\n⊥\n⊥Z = ∇V ⊥∇⊥Z V\n∂s ∂s\n= ∇V ∇⊥Z V − ∇V (υ(∇⊥Z V )V )\n\n(3.20)\n\n= R(V , ⊥Z)V + ∇⊥Z V̇ + ∇[V ,⊥Z] V ,\n\nand project onto NM\n⊥\n\nD D\n⊥\n⊥Z = h (R(V , ⊥Z)V ) + ⊥∇⊥Z V̇ + ⊥∇[V ,⊥Z] V\n∂s ∂s\n= R(V , ⊥Z)V − N hV , R(V , ⊥Z)V i + ⊥∇⊥Z V̇ + ⊥∇[V ,⊥Z] V\n= R(V , ⊥Z)V + ⊥∇⊥Z V̇ + ⊥∇[V ,⊥Z] V .\n\n(3.21)\n\nThe commutator can be further simplified\n[V , ⊥Z] = [V , Z − υ(Z)V ]\n\n= [V , −υ(Z)V ]\n= −V (υ(Z)) V − υ(Z)[V , V ]\n\n= −N V (hV , Zi) V\n\u0010D\nE\n\u0011\n= −N\nV̇ , Z + hV , ∇Z V i V\nD\nE\n= −N V̇ , ⊥Z V ,\n\n(3.22)\n\nthe scalar coefficient above is\nD\nE\nD\nE D\nE\nV (υ(Z)) = N ( V̇ , Z + V , Ż ) − 2N 2 V , V̇ hV , Zi\n\u0010D\nE D\nE\nD\nE\n\u0011\n=N\nV̇ , ⊥Z + V̇ , V υ(Z) + hV , ∇Z V i − 2 V , V̇ υ(Z)\nE\nD\nE\u0011\nE D\n\u0010D\nV̇ , ⊥Z − V̇ , V υ(Z) + hV , ∇⊥Z V i + υ(Z) V , V̇\n=N\nD\nE\n= N ( V̇ , ⊥Z + hV , ∇⊥Z V i).\n(3.23)\nSubstituting the above, the second derivative becomes\nD\nE\nD D\n(3.24)\n⊥\n⊥Z = R(V , ⊥Z)V + ⊥∇⊥Z V̇ − N ⊥V̇ , ⊥Z ⊥V̇ .\n⊥\n∂s ∂s\n\nThis can be written in a shorter form, which allows further analysis\nto be simpler, upon introducing the Fermi derivative. Since V does not\nnecessarily define a geodesic flow, we want to define a new derivation along\nγ(s) which would satisfy the following properties:\n1.\n\nDF\nV = 0.\n∂s\n15\n\n\f2.\n\nD\nDF\nX=\nX, for geodesic V .\n∂s\n∂s\n\n3. If\n4.\n\nDF\nDF\nd\nX =0=\nU , then\nhX, U i = 0.\n∂s\n∂s\nds\n\nD\nDF\nX = ⊥ X, for X orthogonal to V .\n∂s\n∂s\n\nThe last property allows us to find the explicit form of the Fermi derivative\nD\nE\nDF\nD\nX=\nX − N hV , Xi V̇ + N V̇ , X V .\n(3.25)\n∂s\n∂s\nEquations (3.19) and (3.24) now read\n\nDF\n⊥Z = ⊥∇⊥Z V =: ⊥A(⊥Z),\n∂s\nE\nD\n2\nDF\nV̇\nZ,\nV̇\n−\nN\nZ\n=\nR(V\n,\nZ)V\n+\n∇\n⊥V̇ =: Φ(⊥Z).\n⊥\n⊥\n⊥\n⊥\n⊥\nZ\n⊥\n∂s2\n\n(3.26)\n\nThese can be called the projected variational and deviation equation respectively. For both operators introduced here we have\n⊥A,\n\nΦ : TM → NM,\n\n(3.27)\n\nwhere the normal bundle is taken with respect to V , so that the matrix\nof components of ⊥A explicitly only has non-zero elements for directions\northogonal to V , and is effectively a (N −1) × (N −1) matrix (when acting\non NM ).\n\n3.3 The Raychaudhuri equation\nUsually one decomposes A into its symmetric and antisymmetric parts using the corresponding index notation\nVμ;ν = V(μ;ν) + V[μ;ν] .\n\n(3.28)\n\nHowever, with the\u0001assumed definition of the covariant derivative, A is not\n\u0001\na tensor of type 02 , but can rather be identified with a tensor of type 11 .\nThe question of \"transposing\" such an operator can be dealt with naturally,\nwhen one recalls that the metric tensor defines the musical isomorphism,\nso that the following diagram commutes\ng\n\nA −−−−→\n\n\n†y\n−1\n\ng\n\n♭A\n\n\nyT ,\n\n(3.29)\n\nA† ←−−−− (♭A)T\n\nwhere the new symbols above are defined as\n(♭A)(X, U ) = hA(X), U i,\n\n(φT )(X, U ) = φ(U , X),\n\nh(♯φ)(X), U i = φ(X, U ),\n16\n\n(3.30)\n\n\fIt is, of course, possible to only define the Hermitian adjoint operator of A\nas\nhA† (X), U i := hX, A(U )i,\n(3.31)\nbut then the analogy with simple transposition is not as clearly visible.\nAs can be seen the adjoint is really a transposition of arguments in the 2form φ canonically isomorphic to the given endomorphism A. In the index\nnotation the above operations take the form\n(♭A)μν = gμσ Aσ ν , (φT )μν = φνμ ,\n(♯φ)μν = gμσ φσν ,\n\n(A† )μν = Aν μ .\n\n(3.32)\n\nThe adjoint is especially simple for operators of the form φ ⊗ X as can\nbe directly checked\nhA, (φ ⊗ X)(B)i = hA, φ(B)Xi\n= φ(B) hA, Xi\n\n= ♭X(A) h♯φ, Bi\n= h(♭X ⊗ ♯φ)(A), Bi ,\n\n(3.33)\n\nor (φ ⊗ X)† = (♭X) ⊗ (♯φ).\nWe are now ready to decompose ⊥∇V into its self-adjoint (Hermitian)\nand anti-self-adjoint (anti-Hermitian) parts. This is essentially the symmetric splitting of the associated 2-form φ. The reason for carrying out\nthis procedure in the operator approach is that we are dealing with linear differential equations and any eigenvalue problem will be much more\nstraightforward. We will be able to use all the standard theorems regarding\nHermitian operators.\nDecomposing now with regard to † we have\n\nwith\n\nDF\n⊥Z = θ(⊥Z) + ω(⊥Z),\n∂s\n\n(3.34)\n\n1\n(⊥A + ⊥A† ),\n2\n1\nω = ⊥AA := (⊥A − ⊥A† ),\n2\n\n(3.35)\n\nθ = ⊥AH :=\n\nso that\nθ† = θ,\n\nω † = −ω.\n\n(3.36)\n\nOne could think of θ and ω as generating the flow's expansion and rotation\nrespectively.\nWe turn next to the deviation equation to obtain the derivative of ⊥A\n\u0012\n\u0013\nDF\nDF ⊥A\nDF\nDF2\n(⊥A(Z)) =:\n(⊥Z) + ⊥A\n(3.37)\n⊥Z = Φ(⊥Z) =\n⊥Z ,\n∂s2\n∂s\n∂s\n∂s\nwhich we rewrite as\nDF θ DF ω\nDF ⊥A\n=\n+\n= Φ − ⊥A2 ,\n∂s\n∂s\n∂s\n= Φ − θ2 − ω 2 − {θ, ω},\n17\n\n(3.38)\n\n\fwhere {, } stand for the anti-commutator. It is straightforward to construct the Hermitian decomposition of the left-hand side of the above equation, but one must ask if the derivatives of θ and ω are themselves the\n(anti-)Hermitian parts of the left-hand side. Or, in other words, if\n\u0013†\n\u0012\nDF A† ? DF A\n=\n.\n(3.39)\n∂s\n∂s\nFirst we prove this holds for the covariant derivative (which is expected for\na Riemannian connection)\n+ \u001c\n*\u0012\n\u0013†\n\u001d\nDA\nDA\nX, U = X,\n(U )\n∂s\n∂s\n\u001c\n\u0013\u001d\n\u001d \u001c\n\u0012\nD\nDU\n= X, A(U ) − X, A\n∂s\n∂s\n\u001d\n\u001d \u001c\n\u001c\nDU\nDX\n, A(U ) − A† (X),\n= V (hX, A(U )i) −\n∂s\n∂s\n\u001c \u0012\n\u0013\n\u001d\nDX\n= V ( A† (X), U ) − A†\n,U\n∂s\n\u001d\n\u001c\nD †\nA (X), U\n− V ( A† (X), U ) +\n∂s\n\u001c\n\u0013\n\u001d\n\u0012\nD †\nDX\n=\n,U\nA (X) − A†\n∂s\n∂s\n\u001d\n\u001c\n†\nDA\nX, U .\n=\n∂s\n(3.40)\nFor the Fermi derivative it thus suffices to check the behaviour of the last\ntwo terms, which are all of the form (3.33). They can be written as\nW1 = −N (♭V ⊗ V̇ − ♭V̇ ⊗ V ),\nso one immediately has W1† = −W1 . The question (3.39) can now be rephrased\nas\n?\n(3.41)\n(W1 ◦ A − A ◦ W1 )† = W1 ◦ A† − A† ◦ W1 .\nAs (A ◦ B)† = B † ◦ A† , the above is identically satisfied for this particular\nW1 .\nAs we assume zero torsion, and the connection to be Riemannian, we\nhave for the Riemann tensor\nR(A, B, X, Y ) = R(X, Y, A, B)\nso that using an auxiliary operator\nWR (X) = R(V , X)V\nit is possible to obtain the adjoint of R as a function of its second argument\nhWR (X), U i = R(V , U , V X) := hR(V , U )V , Xi\n= hX, R(V , U )V i\n=\n\nhX, WR† (U )i\n18\n\n= hX, WR (U )i,\n\n(3.42)\n\n\fand it turns out to be self-adjoint. This allows us to write\nΦ† = WR + (⊥∇V̇ )† − N ♭⊥V̇ ⊗ ⊥V̇ ,\nor\n\nΦH = WR + (⊥∇V̇ )H − N (♭⊥V̇ ) ⊗ ⊥V̇ ,\nΦA = (⊥∇V̇ )A .\n\n(3.43)\n\n(3.44)\n\nTogether with equation (3.38) this gives\nDF θ\n= WR + (⊥∇V̇ )H − N (♭⊥V̇ ) ⊗ ⊥V̇ − θ2 − ω 2 ,\n∂s\nDF ω\n= (⊥∇V̇ )A − {θ, ω}.\n∂s\n\n(3.45)\n\nWe introduce here a new quantity θ = tr θ\ntr\n\nDF\nDF θ\n=\n(tr θ) = θ̇,\n∂s\n∂s\n\n(3.46)\n\nsince the Fermi derivative of a scalar function is just the derivative with\nrespect to s. Taking the trace of the right-hand side of the first of equations\n(3.45) yields\ntr\n\nD\nE\nDF θ\n= R(V , V ) + tr(⊥∇V̇ ) − N V̇ , V̇ − tr(θ2 + ω 2 )\n∂s\nD\nE\nD\n\nE\n= R(V , V ) + tr(∇V̇ − N ∇V̇ , V ⊗ V ) − N V̇ , V̇ − tr(θ2 + ω 2 )\nE\nE\nD\nD\n= R(V , V ) + tr(∇V̇ ) + N V̇ , ∇V V − N V̇ , V̇ − tr(θ2 + ω 2 )\n\n= R(V , V ) + tr(∇V̇ ) − tr(θ2 + ω 2 ),\n\n(3.47)\n\nwhere we have used the fact that\nE\nD\n∇ V̇ , V = 0\nand that\n\ntr(φ ⊗ X) = φ(X).\nWriting conventionally\nθ=σ+\n\nθ\n1\nN −1\n\nto separate the trace-free part σ, one finally arrives at the Raychaudhuri\nequation\nd\n1\nθ = R(V , V ) − tr ω 2 − tr σ 2 −\nθ2 + tr(∇V̇ ).\nds\nN −1\n\n(3.48)\n\n3.4 Higher order variational equations\nLet us turn now to the flows generated by the fields V and Z as shown\non Figure 3.1. Let u : M → RN denote a local set of coordinates, and\n19\n\n\fconsider a function f at point r = gs (p), where the local diffeomorphism gs\nis associated to the vector field V so that\nd\nu(gs (p)) =: V r (u) = fr .\n(3.49)\nds\nThese are simply the field's components in the coordinate basis associated\nwith u (not that the subscript indicates the point, not a vector component).\nTaking their derivative with respect to s we write\n\nor\n\nd\nfr = V r (f ),\nds\n\n(3.50)\n\nd2\nu(gs (p)) = V r (V r (u)) ,\nds2\n\n(3.51)\n\nso that\n\ndn\nu(gs (p)) = V (n)\n(3.52)\nr (u).\ndsn\nTake now another point q = hl (p), generated with the flow of Z, and expand\nits coordinates, as is always possible in a local map\n\u0015\n∞ n \u0014 n\nX\nl\nd\nu(q) = u(hl (p)) =\nu(h\n(p))\nl\nn! dln\nl=0\nn=0\n∞ n h\ni\nX\nl\n(n)\nZ hl (p) u(hl (p))\n=\nn!\np\nn=0\n\n=\n\n(3.53)\n\n∞ n\nX\nl\nZ (n)\np (u) = exp(lZ)p (u).\nn!\nn=0\n\nWe define the sequence of displacements un to be Z (n)\np (u), and call it variations of the\nn-th\norder.\nThe\npartial\nsums\ncorrespond\nto points pn such that\nP\nu(pn ) = i≤n ui , and the n-th variation is then a vector in RN (coordinate\nspace) connecting the point pn−1 to pn .\nThus, only one vector field is needed to describe all the variations, although we can formally write the higher order equation (HVE) as\n\u0010\n\u0011\nd\nun = V Z (n) (u) = Z (n) (V (u)) ,\n(3.54)\nds\nby analogy to the original dynamical system\nu̇ = V (u) ⇐⇒ u̇μ = V μ .\nFor example, the first VE equation is\nd\n(Z(uμ )) = Z(V (uμ )) = Z(V μ ),\nds\n∂V μ\nŻ μ = Z ν\n,\n∂uν\n\n(3.55)\n\nd\n(Z(Z(uμ ))) = Z(Z(V μ )),\nds\n\u0012\n\u0013\nμ\n2 μ\nμ\nλ\nd\nν ∂Z\nν λ ∂ V\nν ∂Z ∂V\nZ\n=\nZ\nZ\n+\nZ\n,\nds\n∂uν\n∂uν ∂uλ\n∂uν ∂uλ\n\n(3.56)\n\nand the second\n\n20\n\n\for, in the usual notation,\nu̇μ1 = uν1 ∂ν V μ\n2\nu̇μ2 = uν1 uλ1 ∂νλ\nV μ + uν2 ∂ν V μ .\n\n(3.57)\n\nThe whole construction is evidently coordinate-dependent, as the chart\nu enters explicitly into the definitions,\nand although the first variation can\nP\nbe made into a single vector Z = μ uμ1 ∂μ , the same cannot be done for the\nhigher variations. It follows from the fact that a single field Z is enough to\ndefine the diffeomorphism hl which gives the full transformation of one trajectory onto another, for a small but finite separation l. In practise however,\nwe only know the values of Z on the particular trajectory γ, and not its dependence on the coordinates u, and we cannot construct the derivatives of\nZ (except in the V direction). That is why the Taylor series of (3.53) is analysed term by term, each with its own equation. Note that a HVE of a given\norder n requires the knowledge of the solutions of all the lower HVE's up to\nn − 1, which makes the equations non-homogeneous (and non-autonomous).\n\n3.5 First integrals\nWith the present notation, a first integral of the system is a function J :\nM → R such that\nd\nJ = V (J) = dJ(V ) = 0.\n(3.58)\nds\nA key fact regarding these quantities is that, if there exists a first integral J of the original system then there also exist first integrals Jn of the\nvariational equations of all orders\nJn := Z (n) (J).\n\n(3.59)\n\nTo see that these are in fact first integrals of the VE, we make use of the\ncommutation property again\nd\nJn = V (Z (n) (Jn )) = Z (n) (V (J)) = 0.\nds\n\n(3.60)\n\nJust as the HVE, the integral explicitly involves the solutions of the HVE's\nof lower order.\nHowever, it can so happen, when taking a particular trajectory γ(s) of\nV along which the variations are considered, that\ndJ|γ(s) ≡ 0\nor in general that\n∂ j J|γ(s) ≡ 0,\n\nfor j < m,\n\n(3.61)\n\nwhere m must necessarily be finite or the whole first integral would be a\nconstant function, and is taken to be the smallest integer with the\n\u0001 above\n0\nproperty. Note first that ∂ m J is a well defined tensor of type m\nbecause\nall the partial derivatives of orders lower than m vanish so that only the\nhighest derivative is left\n(∂ m J)γ(s) (Z, . . . , Z ) = Z(. . . Z (J) . . .)|γ(s) .\n| {z }\n| {z }\nm\n\nm\n\n21\n\n(3.62)\n\n\fThe reason to choose ∂ to denote this derivative is that ∇ is understood to\nact on the (possible exterior) tangent bundle, while for d one has d2 = 0. It\nis to be remembered, though, that we do not associate ∂ with derivation in\nany particular coordinate system, as can be seen in (3.62).\nLet us take now a VE of n-th order with ∂ n J ≡ 0, and a following function of the n-th variation\n′\n\nZ (n) Z (n ) J = Z (n) Jn′\n\n(3.63)\n\nwhere n′ is such that n + n′ = m constructed as above. Then (∂ n Jn′ )γ(s) is a\nfirst integral, expressed explicitly as a function of the n-th variation.\nImagine now, that the system has N functionally independent first integrals in a neighbourhood of γ(s). This means that there are N independent\nfirst integrals of the first variational equation (insert Ziglin Lemma), and\nif the original integrals are independent on γ(s) itself, this means they all\nhave non-vanishing associated 1-forms dJi . Consequently we have N independent vectors\nY i = ♯(dJi ),\n(3.64)\nwith which the integrals of the variational equation can be written as\nJi,1 = Z(Ji ) = dJi (Z) = hY i , Zi .\n\n(3.65)\n\nSince that expression is constant\n\nor\n\n0 = h∇V Y i , Zi + hY i , ∇V Zi\nE\nD\n= Ẏ i , Z + hY i , ∇Z V i\nD\nE\n= Ẏ i , Z + (∇V )† Y i , Z ,\n\n(3.66)\n\nD\nY i = −(∇V )† Y i ,\n(3.67)\n∂s\nand we say that Y i satisfied the adjoint equation to the variational equation. In fact, we have just shown that N first integrals give us a basis of\nsolutions of the adjoint equation. From them, the solution of the VE can be\nobtained by means of the fundamental matrix (or rather operator).\nLet F be the fundamental operator of the VE and the adjoint equation\nrespectively, defined as follows\nF =\n\nN\nX\ni=1\n\nZ ∗i0 ⊗ Z i ,\n\n(3.68)\n\nwhere Z i0 are the initial conditions of a basis of solutions {Z i }, and {Z ∗i }\nis the dual basis. The above operator acts on a constant vector to yield\na solution of the variational equation with the constant vector as the initial value. When the constant vector is prolonged (along the trajectory γ)\nwith the equation ∇V Z i0 = 0 (which is not the same as the VE), then the\nderivative of the above operator is simply\nD\nF = AF.\n∂s\n22\n\n(3.69)\n\n\fAnother way of making the initial values global is to require that the field\n{Z i } is, at some point, equal to a basis {E i } which is globally parallel:\n∇E i = 0. This is the usual case with the impilcit assumption of the base\nmanifold (and connection) being Euclidean.\nDefine now P to be the fundamental operator of the adjoint equation,\nand Y i0 be the initial conditions of the appropriate vector fields; then\ncij = hY i , Z j i = hF Y i0 , P Z j0 i\n\n= P † F Y i0 , Z j0 = hY i0 , Z j0 i ,\n\n(3.70)\n\nwhere the last equality is the consequence of this scalar product being conserved as the first integral. As the initial conditions are arbitrary, this\nmeans that\n\u0001−1\n.\n(3.71)\nP = F†\n\n3.6 Normal variational equations\nAs was mentioned in the chapter on algebraic theory, the variational equation can be reduced in order by 2, when a first integral is known. We have\nalready seen how the first part of this reduction works – by projecting the\nvariational equation on the subspace orthogonal to the trajectory (tangent\nvector). The second step is carried out almost identically, only this time the\nvector used for projecting is\nY = ♯dJ,\n(3.72)\nwhere J is the known constant of motion. By definition Y is orthogonal to\nV\nhY , V i = dJ(V ) = 0.\n(3.73)\nThus ⊥Z can be further decomposed as\n⊥Z\n\n=\n\nhY , ⊥Zi\nY + ⊥⊥Z.\nhY , Y i\n\n(3.74)\n\nThe last vector ⊥⊥Z is tangent to the hyper-surface of constant J and orthogonal to V . Just as Z(J) is the first integral of variational equations ⊥Z(J)\nis a first integral of the projected equations because (3.73) implies\nhY , Zi = hY , ⊥Zi .\n\n(3.75)\n\nThe reduced variational equation can be obtained from (3.74) by taking the covariant derivative ∇V and projecting on the subspace orthogonal\nto both V and Y or, which amounts to the same, by applying the Fermi\nderivative\n\u0012\n\u0013\nDF\nDF hY , ⊥Zi\nDF\nZ\n=\nZ\n−\nY\n⊥\n⊥\n⊥\n∂s\n∂s\n∂s\nhY , Y i\n(3.76)\n\u0001\nhY , ⊥Zi\n†\n†\n= ⊥A(⊥Z) −\n2\nA\n(Y\n),\nY\nY\n−\nhY\n,\nY\ni\nA\n(Y\n)\n,\n⊥\n⊥\n2\nhY , Y i\n\nand projecting with respect to Y\n\u0012\n\u0013\nD\nhY , ⊥Zi\nhY , ⊥Zi\nY + ⊥⊥A† (Y )\n,\n⊥\n⊥Z = ⊥\n⊥A ⊥\n⊥Z +\n⊥\n⊥\n∂s\nhY , Y i\nhY , Y i\n23\n\n(3.77)\n\n\fwhere the Fermi derivative of Y is known from (3.67), so that finally one\ngets a familiar looking equation\n⊥\n⊥\n\nhY , ⊥Zi\nD\n.\n⊥\n⊥Z = ⊥\n⊥A(⊥\n⊥Z) + 2⊥\n⊥θ(Y )\n∂s\nhY , Y i\n\n(3.78)\n\nIn contrast with the (once) projected equation, the above contains an additional term, which means it is coupled with the degree of freedom parallel\nto Y , albeit the \"coupling\" hY , ⊥Zi is constant, as it is the first integral.\nWhen it comes to the normal variational equation, one is interested in\nthe full derivative of the variations, not only its transverse value, so that it\nis necessary to go back to equation (3.18) and change it to\nD\n⊥Z = A(⊥Z) − N V (hV , Zi)V\n∂s\n\u0010D\nE\n\n\u0011\nV̇ , Z + hV , ∇Z V i V\nE\nD\n= A(⊥Z) − N V̇ , ⊥Z V .\n= A(⊥Z) − N\n\n(3.79)\n\nThe normal part is by definition the variation tangent to the hyper-surface\nof the first integral, so that hY , ⊥Zi = 0, and one can simply write the\nnormal variational equation as\nD\nE\nD\n⊥\n⊥Z = A(⊥\n⊥Z) − N V̇ , ⊥\n⊥Z V .\n∂s\n\n(3.80)\n\n3.7 Lyapunov exponents\nDefine new operators L and Λ\n\nso that\n\nL = F † F = e2(s+1)Λ(s) ,\n\n(3.81)\n\n√\nlog(L)\nlog F † F\nΛ=\n=\n.\n2(s + 1)\ns+1\n\n(3.82)\n\nThe Lyapunov exponents are then defined as the eigenvalues of\nΛ0 = lim Λ.\ns→∞\n\n(3.83)\n\nBy construction L is self-adjoint, and has positive eigenvalues, so that Λ is\nwell defined. Clearly, the operator Λ0 depends on the particular solution\none uses for s tending to infinity. Or, in terms of F , it depends on the points\nin the phase space of the variational flow. There is also a slight difference\nfrom the usual notation, where s is present instead of s + 1. This change is\nintroduced to make Λ well defined for s = 0 by formula (3.81).\nThe above formulae require the knowledge of the fundamental matrix\nF in order to be able to determine the values of the exponents. In practise\none uses various algorithms [22, 3] to reconstruct the spectrum, and they\nmostly rely on integration of the variational equation and, if the system is\nnonlinear, the original equation as well.\n\n24\n\n\fThe following considerations provide a differential equation for the Lyapunov spectrum, or, strictly speaking, an equation determining a operator\nwhose eigenvalues are the same as those of Λ and accordingly tend to the\nLyapunov exponents with s → ∞. This is achieved through a similarity\ntransformation\nF LF −1 = F F † = e2(s+1)F ΛF\n\n−1\n\n=: e2(s+1)L .\n\n(3.84)\n\nLet us turn next to the formula for the derivative of matrix (or operator)\nexponential\nZ 1\nd\ne−M eM =\ne−αM Ṁ eαM dα.\n(3.85)\nds\n0\nIt is directly applicable to the covariant derivative (or Fermi derivative)\nthanks to formula (3.37), which could be rewritten as\n\u0014\n\u0015\nDF\nDF M\n=\n,M ,\n(3.86)\n∂s\n∂s\nwith each side of the above understood as acting on some vector. The standard derivation now gives\n\u0014\n\u0012\n\u0013\n\u0015\nd\nDF αM\nDF\nDF M αM\ne−αM\n= e−αM\ne\n, M eαM = e−αM\ne ,\n(3.87)\ndα\nds\n∂s\n∂s\nwhich, when integrated over α leads to (3.85).\nApplying the above for M = 2(s + 1)L\n† −1\n\n(F F )\n\n†\n\n†\n\n(Ḟ F + F Ḟ ) =\n\nZ\n\n1\n\n0\n\nF\n\n−†\n\nF\n\n−1\n\n†\n\n†\n\n†\n\ne−2α(s+1)L (2L + 2(s + 1)L̇)e2α(s+1)L dα,\n\n(AF F + F F A ) = 2L + 2\n\nZ\n\n1\n\n0\n\ne−2α(s+1)L (s + 1)L̇e2α(s+1)Λ dα,\n\ne−2(s+1)AdL A + A† = 2L + 2(s + 1)\n\nZ\n\n1\n\n0\n\ne−2α(s+1)AdL L̇dα,\n\n(3.88)\nwhere the adjoint (not to be confused with the other adjoint, which will be\nexplicitly denoted as \"Hermitian adjoint\" throughout this section) operator\nhas been introduced as\n(AdW )(U ) := [W, U ]\n(3.89)\nand satisfies\neW U e−W = eAdW U.\n\n(3.90)\n\nThe integral can now be evaluated symbolically (treating the exponent as\na scalar), which is justified by the direct computation of the exponential\nseries. It gives\n(e−2(s+1)AdL −1)A + A + A† = 2L −\n[L, A] +\n\n2AdL\n\ne−2(s+1)AdL − 1\n\nθ=−\n\n25\n\ne−2(s+1)AdL − 1\nL̇,\nAdL\n\n1\nL − L̇,\ns+1\n\n(3.91)\n\n\for, upon defining\nψ(x) =\nwe finally obtain\nL̇ =\n\nx\n,\n1 − e−x\n\n\u0001\n1\n1\nψ 2(s + 1)AdL (θ) + [A, L] −\nL.\ns+1\ns+1\n\n(3.92)\n\n(3.93)\n\nEquivalently, by including the (s + 1) factor into the operator Le = (s + 1)L,\nwe have\n\u0001\ne\nLė = ψ 2AdLe (θ) + [A, L].\n(3.94)\n\nThis equation appears to be much simpler than the preceding one, but one\nhas to remember that Le diverges at infinity for non-zero Lyapunov exponents.\nThe above derivation requires a few crucial remarks. First of all, the\nadjoint operator, trivially has a zero eigenvalue, as any operator commutes\nwith itself. AdL is thus not invertible. Thus, it is important to remember that the fraction notation is meant as symbolic - the \"division\" by an\noperator is used to write the infinite series obtained by integration as a\nsimple function. On the other hand, the behaviour of the fraction at \"zero\"\n(a non-invertible operator) is regular because the function 1/ψ(x) has a removable singularity at x = 0 and is taken to be equal to its limit there:\n1/ψ(0) = ψ(0) = 1. This also makes clear, that neither ψ nor 1/ψ is zero on\nthe real axis.\nAlthough 1/ψ, when viewed as a series, has infinite radius of convergence, the same is not true for the other fraction, which is represented by\nψ (the radius at zero is 2π). The function is, however, well defined for all\nreal values of the argument because its singularities lie on the imaginary\naxis. That is why one first replaces the well-behaved series by 1/ψ and then\nconsequently uses only ψ.\nFinally, the adjoint operator is also Hermitian as L is, by definition,\nHermitian. To see this, let us define a natural metric in the vector space of\noperators\nhA, Bi = tr(A† B),\n(3.95)\nso that\n\ntr(A† AdLB) = tr(A† LB − A† BL)\n\n= tr((LA)† B − (AL)† B)\n\n= tr([L, A]† B)\n\n(3.96)\n\n= hAdLA, Bi ,\nwhich means that AdL has real eigenvalues and ψ is well behaved on its\nspectrum.\nEquation (3.93) is thus a matrix differential equation with the initial\ncondition L(0) = 1, and involving an operator on the space of operators\nψ(AdL). Since Ad is linear, the adjoint can be considered as an N 2 × N 2\nmatrix acting on an N 2 × 1 vector (representing a N × N matrix). The equation is solved for the derivative which means it is easily implementable numerically. It only requires the knowledge of a particular solution γ around\nwhich the linear approximation is considered. And although the operator\n26\n\n\fL is defined with the use of the fundamental matrix, there is no need of\nobtaining the basis of linear solutions to solve for Λ because their spectra\nare the same.\nThe dimension of the equation seems to complicate matters a lot because, for example, a Hamiltonian system of two spatial degrees of freedom, which requires a four dimensional phase space, gives rise to a 16 × 16\nadjoint matrix. Evaluating ψ on such a matrix cannot be achieved by a series, as mentioned earlier, and requires an eigenvalue decomposition, which\nwould make the calculations cumbersome. Fortunately, this is not a general\nN 2 × N 2 operator, and the knowledge of L is all we need.\nTake any Hermitian operator A with an orthonormal basis of eigenvectors {U i } such that A(U i ) = λi U i , another operator B, constructed from\nthose eigenvectors, and forms of the dual basis\nB = U ∗k ⊗ U l ,\n\n(3.97)\n\nfor given k and l. The action of the adjoint of A on B is as follows\nAB = U ∗k ⊗ A(U l ) = λl U ∗k ⊗ U l ,\n\n(BA)† = AB † = U ∗l ⊗ A(U k ) = λk U ∗l ⊗ U k ,\n\n(3.98)\n\nso that BA = λk U ∗k ⊗ U l and\nAdA(B) = (λl − λk )B,\n\n(3.99)\n\nwhere the previously obtained properties of Hermitian adjoint of a simple\ntensor product of orthonormal bases were used.\nWe thus have constructed a full set of eigenvectors and eigenvalues, of\nwhich N are identically zero. This knowledge makes the practical computation of ψ(AdL) much faster and, in theory, allows of writing all terms of\nequation (3.93) explicitly when the characteristic polynomial is soluble.\n\n3.8 On some additional properties\nThis section is devoted to describing how the Lyapunov exponents, and the\nsystem in general, behave when there are special constraints present. The\nfirst is simply the Hamiltonian structure, and the second is the more general conserved integral invariant of the flow.\nThe Hamiltonian structure is usually introduced by means of a symplectic form ωS , but here, since\n\u0001 there is already a distinguished metric\nstructure, a new operator I ( 11 tensor) can be used to create symplectic\nstructure. We have\nωS (X, U ) = hIX, U i ,\n(3.100)\nso that for the Hamiltonian H the associated vector field is\nV = I(♯dH) ⇐⇒ ωS (V , U ) = dH(U ).\n\n(3.101)\n\nThis will also mean that there is a particular coordinate system {q, p} for\nwhich the coordinate basis is orthonormal and, consequently, in which the\n\n27\n\n\fconnection is Euclidean, i.e. ∇∂q = ∇∂p = 0, so that\nI=\n\nK\nX\ni=1\n\n(dpi ⊗ ∂qi − dqi ⊗ ∂pi ),\n\n(3.102)\n\nwhere as before 2K = N is the dimension of the manifold. By definition the\noperator is anti-Hermitian I † = −I, anti-involutive I 2 = −1 and, because\nthe connection is euclidean, it is also parallel ∇I = 0.\nAs follows from previous sections h♯dH, Zi = const and h♯dH, V i = 0.\nConsider next two solutions of the variational equation Z 1 and Z 2 and the\nquestion of conservation\nV (hZ 1 , IZ 2 i) = hAZ 1 , IZ 2 i + hZ 1 , IAZ 2 i\n= hI∇Z 1 (♯dH), IZ 2 i − hZ 1 , ∇Z 2 (♯dH)i\n= h♯dH, ∇Z 1 Z 2 i − h∇Z 2 Z 1 , ♯dHi\n\n(3.103)\n\n= dH([Z 1 , Z 2 ])\n= Z 1 (const) − Z 2 (const) = 0,\n\nwhere the appearance of the commutator follows from the zero torsion condition. The above product is thus conserved, and this means the following\nfor the fundamental operator\nhF Z 10 , IF Z 20 i = hZ 10 , IZ 20 i ,\nF † IF = I,\n\nF F † = −F IF −1 I,\n\n(3.104)\n\n(F F † )−1 = −IF IF −1 = I(F F † )I −1 ,\nso that the operator L defined in the previous section has the same eigenvalues as its inverse, which means the Lyapunov matrix L has pairs of eigenvalues of opposite signs {λ, −λ}. This also implies the flow conserves the\nphase space volume, as the sum of all such eigenvalues is zero. It should be\nstressed, that although the symplectic structure is enough to define volume\nas η = ωS∧K , it does not give a metric structure and the respective LeviCivitta connection. This is the reason for the introduction of the particular\ncanonical basis {∂q , ∂p } defined as orthonormal.\nThis brings us to the next property, which is preserving the integral of\nan N -form, only this time it needs not be the volume form η. Because the\nspace of N -forms is one dimensional the new quantity is a multiple of η, say\nαη. Let us assume that\nZ\nZ\ngs∗ (αη) = const,\n(3.105)\nαη =\nD(s)\n\nD0\n\nwhere D(s) is the image of some region D0 through the diffeomorphism gs .\n\n28\n\n\fDifferentiating one gets\nZ\nZ\nd(ιV (αη)) + ιV d(αη)\n£V (αη) =\nD0\nZD0\nd(ιαV η)\n=\nD\nZ 0\n£αV η\n=\nD\nZ0\ndiv(αV )η.\n=:\n\n(3.106)\n\nD0\n\nThe usual notion of divergence-free flows is just a special case when α = 1.\nTo see how this definition of divergence works with the volume, and the how\nto compute with the covariant derivative, recall first an identity for the Lie\nderivative\nN\nX\nη(E 1 , . . . , [V , E i ], . . . , E N ),\n(£V η)(E 1 , . . . , E N ) = V (η(E 1 , . . . , E N )) −\ni=1\n\n(3.107)\nfor any basis {E i }. Together with the equality (3.7), and the fact that the\ntorsion is zero, the above amounts to\n(£V η)(E 1 , . . . , E N ) =\n\nN\nX\ni=1\n\ndiv(V )η(E 1 , . . . , E N ) =\n\nN\nX\n\nη(E 1 , . . . , ∇E i V , . . . , E N ),\nη(E 1 , . . . , E ∗i (∇E i V )E i , . . . , E N ),\n\n(3.108)\n\ni=1\n\ndivV = tr(∇V ),\nwhere the middle line is a direct consequence of the volume form being\ncompletely anti-symmetric and {E i } constituting a basis. To put it shortly,\na invariant measure exists when there exists what is called the last multiplier α such that\ntr(∇(αV )) = 0.\n(3.109)\nThe special case of α = 1 (which holds for Hamiltonian systems, but not\nonly), means simply that the flow conserves volume, as can be seen from\nthe integral formulation above. This has a straightforward consequence on\nthe Lyapunov exponents, since\nη(Z 1 , . . . , Z N ) = (det F )η(Z 10 , . . . , Z N 0 ),\n\n(3.110)\n\nwhich holds for any N -form. The determinant changes according to\nV (η(Z 1 , . . . , Z N )) =\n\nN\nX\ni=1\n\nη(Z 1 , . . . , AZ i , . . . , Z N ),\n\nd\n(3.111)\n(det F )η(Z 10 , . . . , Z N 0 ) = tr(A)η(Z 1 , . . . , Z N ),\nds\nd\n(det F ) = tr(A) det F.\nds\nSince 2tr(L) = ln det(F F † ) = 2 ln | det F |, the exponents add up to zero when\nthe divergence of V vanishes.\n29\n\n\fChapter 4\n\nExamples\nThe following dynamical systems will be used to show how the Lyapunov\nexponents equation (3.93) can be used in practise, and also how the normal variational equations are computed in the geometric context versus\nthe algebraic one. Only the geometric considerations are in fact new, as the\nGaloisian obstructions to integrability of these systems were all analysed\nin details in the papers cited in each respective section.\nIn practise, the evolution of the exponents is considered in the time t\nwhich is not the natural parameter, so that the results coincide with the\nstandard ones. This does not change any of the formulae, as the requirement that the vector field V be normalised only matters when the projections are introduced, while the exponents are calculated for the full N\ndimensional system. The equation (3.93) itself is then integrated using the\nRunge-Kutta method of the fourth order.\n\n4.1 Arnold-Beltrami-Childress flow\nThe system is given by\n  \n\nẋ\nA sin z + C cos y\nW = ẏ  = B sin x + A cos z  .\nż\nC sin y + B cos x\n\n(4.1)\n\nWe consider A2 = B 2 and ABC 6= 0. By shifting the variables, all parameters can be made positive, and as was shown in [11] the system is not integrable in the sense that there is no meromorphic first integral on the complex torus TC3 which is the system's phase space and if μ2 := C 2 /(2A2 ) ≤ 1\nthere are no real integrals either. Only one first integral is needed for integrability, because the flow has also zero divergence and accordingly has\na trivial last multiplier. For a three dimensional system that is enough to\nprove there must also exist two additional integrals [6]. Obviously for μ = 0\nthe system is separable, and solvable, and this facts allows for testing how\nthe Lyapunov exponents behave.\nFirst, the integrable case with initial conditions x(0) = y(0) = 0 and\nz(0) = 0.001. Using formula (3.93) the exponents are evolved in time t, and\n\n30\n\n\fcan be plotted as functions of 1/t – so that the origin of the horizontal axis\ncorresponds to t → ∞. The results are presented in figures 4.1 and 4.2.\nΛ\n0.4\n\n0.2\n\n1\u0090t\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\n-0.2\n\n-0.4\n\nFigure 4.1: The Lyapunov exponents for the ABC flow in the integrable case\nμ = 0.\nThe maximal value of t was 10000, and the values of the exponents at\nthat point are\nλ = (−9.173 × 10−4 , 9.099 × 10−4 , 7.404 × 10−7 ).\nTaking now the value of μ = 1/2 to investigate a non-integrable scenario,\nand the same initial conditions, the exponents can be seen to no longer all\nbe zero, there is one tending to zero and two non zero of opposite signs, as it\nto be expected for a flow with conserved volume. Their values at t = 10000\nare\nλ = (5.9 × 10−2 , −5.886 × 10−2 , −1.385 × 10−4 ),\n\nand their time dependence is shown in figures 4.3 and 4.4.\nWhen it comes to the variational equation, since there are no known\nfirst integral (a priori), we can only go as far as projecting it with respect\nto the trajectory. As shown in [11] there is a particular solution for which\ny = π/4, z = x + π/2, so that the trajectory is described by a single equation\nin x(t) and gives as the projected VE\nξ ̇ = ξ sin(x) − 2μη\nη̇ = ξ cos(x),\n\n(4.2)\n\nwhere ξ and η are the variations.\nIn the other approach, taking the coordinate basis (∂x , ∂y ∂z ) to be orthonormal, equation (3.79) becomes\nd\nβ\nβ\nβ  ̇\nν\n⊥Z = (Aν − V Vν )⊥Z .\nds\n31\n\n(4.3)\n\n\fΛ\n0.2\n\n0.15\n\n0.1\n\n0.05\n\n1\u0090t\n0.01\n\n0.02\n\n0.03\n\n0.04\n\n0.05\n\n-0.05\n\n-0.1\n\n-0.15\n\n-0.2\n\nFigure 4.2: The Lyapunov exponents for the ABC flow in the integrable case\n(μ = 0) - a magnification of the 1/t = 0 vicinity.\nwhich we want to change to involve time t, to compare it with the equations\nobtained above. Since the relation between the vectors is W = hW , W i V ,\nthe required derivations are rather\ncumbersome, but using the particular\np\nsolution and the relation ds = hW , W idt, the above is finally reduced to\n⊥Ż\n\nwith\n\n\n\nβ\n\n= Ãβν ⊥Z ν ,\n\nsin(x)\nA\nÃ =  2 cos(x)\n2 − sin(x)\n\n\n−2μ − sin(x)\n0\n−2 cos(x) .\n2μ\nsin(x)\n\n(4.4)\n\n(4.5)\n\nThis is in fact the same equation as before, when one defines ξ to be ⊥Z x − ⊥Z z\nand η = ⊥Z y (in the cited paper the coefficient A was taken to be 1). Obviously only two degrees of freedom are needed after the projection.\nThe geometric thus gives the same \"starting\" equation for further investigation. Its details – the determination of the differential Galois group can\nbe found in the cited article.\n\n4.2 so(5) Gross-Neveu system\nThe Hamiltonian reads\nH=\n\n1 2\n(p + p22 ) − 2 cos(q1 ) − 2 cos(q2 ) − 4 cos(q1 ) cos(q2 ),\n2 1\n\n32\n\n(4.6)\n\n\fΛ\n0.4\n\n0.2\n\n1\u0090t\n0.025\n\n0.05\n\n0.075\n\n0.1\n\n0.125\n\n0.15\n\n0.175\n\n0.2\n\n-0.2\n\n-0.4\n\nFigure 4.3: The Lyapunov exponents for the ABC flow in a non-integrable\ncase μ = 1/2.\nwhich translates into the appropriate vector W\n  \n\nq1\np1\n \n\nd \np2\nq2  = \n.\n\n\n\n−2 sin(q1 ) − 4 sin(q1 ) cos(q2 )\ndt p1\np2\n−2 sin(q2 ) − 4 cos(q1 ) sin(q2 )\n\n(4.7)\n\nAs mentioned before, this system is never integrable meromorphically\nin the Liouville sense as shown it [12]. As the cited paper indicates, it has\nthe interesting feature of appearing regular in the original variables, and\nclearly chaotic when a complex canonical transformation q → iq, p → −ip is\nperformed. The equations presented above are those after the transformation. In both cases the \"effective\" coordinates remain real, that is, when the\ninitial conditions are real the variables remain real, and when they start as\nimaginary, they remain purely imaginary.\nThe first set of Lyapunov exponents was obtained for the imaginary domain (explicitly the above Hamiltonian) for the initial conditions of q1 (0) =\n0.01, q2 (0) = 0, p1 (0) = 0.01 and p2 (0) positive, determined by the condition\nH = 3. At the maximal time of 10000 the spectrum was\nλ = (0.2169, −0.2169, −2.64 × 10−3 , 2.64 × 10−3 ).\nIt is clear that two of the exponents remain non zero as depicted in figure\n4.5.\nFor the real domain, where the Hamiltonian becomes\n1\nH = − (p21 + p22 ) − 2 cosh(q1 ) − 2 cosh(q2 ) − 4 cosh(q1 ) cosh(q2 ),\n2\n\n33\n\n(4.8)\n\n\fΛ\n0.2\n\n0.15\n\n0.1\n\n0.05\n\n1\u0090t\n0.0025\n\n0.005\n\n0.0075\n\n0.01\n\n0.0125\n\n0.015\n\n0.0175\n\n0.02\n\n-0.05\n\n-0.1\n\n-0.15\n\n-0.2\n\nFigure 4.4: The Lyapunov exponents for the ABC flow in a non-integrable\ncase (μ = 1/2) - a magnification of the 1/t = 0 vicinity.\ntaking the initial conditions of q1 (0) = 0.01, q2 (0) = 0, p1 (0) = 0.01 and p2 (0)\npositive such that H = −3, the exponents all tend to zero with\nλ = (1.753 × 10−3 , −1.753 × 10−3 , −3.651 × 10−4 , 3.651 × 10−4 )\nat t = 10000. The results for this case is shown in figure 4.6.\nLet us see now how the double projection works to produce the normal\nvariational equations in this case. In the algebraic approach the invariant\nplane q2 = p2 = 0 is used to find a particular solution (q1 (t), p1 (t)), for which\nthe Jacobian matrix of W is\n\n\n0\n0\n1 0\n\n0\n0\n0 1\n.\nA=\n(4.9)\n−6 cos(q1 (t))\n0\n0 0\n0\n−2 − 4 cos(q1 (t)) 0 0\n\nTaking now only the variations in the directions q2 and p2 we get the NVE\nξ̇ = η\nη̇ = −2 − 4 cos(q1 (t)),\n\n(4.10)\n\nwhere ξ and η, as before, are the variations.\nThe geometric procedure is essentially the same as for the ABC flow, in\nthat it consists of normalising the field W , and the appropriate equation\n(3.80) is now\n\n\n−36f sin2 (q1 )\n0\n−6f p1 sin(q1) 0\n\n0\n0\n0\n1\n\n Z,\n(4.11)\n⊥\n⊥Ż = \n−6f p1 sin(q1 )\n0\n−6f p21\n0 ⊥⊥\n0\n−2 − 4 cos(q1 )\n0\n0\n34\n\n\fΛ\n0.4\n\n0.3\n\n0.2\n\n0.1\n\n1\u0090t\n0.01\n\n0.02\n\n0.03\n\n0.04\n\n0.05\n\n-0.1\n\n-0.2\n\n-0.3\n\n-0.4\n\nFigure 4.5: The Lyapunov exponents for the Gross-Neveu system in the\nimaginary domain.\nwith\nf=\n\n6p1 (6 cos(q1 ) − 1) sin(q1 )\n.\n(p21 + 36 sin2 (q1 ))2\n\n(4.12)\n\nThis is, again, the same as the algebraic NVE, when two of the degrees of\nfreedom corresponding to p1 and q1 are suppressed. Alternatively one can\ncheck that the two vectors with respect to which the projection takes place,\nspan the p1 , q1 subspace, because on the trajectory\nW = (p1, 0, −6 sin(q1 ), 0),\n\nY = ♯dH = (6 sin(q1 ), 0, p1, 0).\n\n(4.13)\n\nThe above means that the next steps – checking if the NVE are soluble\nin the Liouvillian sense – is the same in both approaches. The proof that\nthere are no such solutions can be found in the paper cited at the beginiing\nof this section.\n\n4.3 Friedmann-Robertson-Walker cosmology\nThe last example is a cosmological system obtained for the FRW universe\nwith a scalar field conformally coupled to gravity. It was analysed in great\ndetail in [13], and includes both integrable and non-integrable sub-cases.\nThe particular Hamiltonian taken here is\nH=\n\n1 2\n1\n1\n(p1 + p22 ) − m2 q12 q22 + (Λq14 + λq24 ).\n2\n2\n4\n\nWhen\nΛ = λ = −m2\n35\n\n(4.14)\n\n\fΛ\n0.2\n\n0.15\n\n0.1\n\n0.05\n\n1\u0090t\n0.01\n\n0.02\n\n0.03\n\n0.04\n\n0.05\n\n-0.05\n\n-0.1\n\n-0.15\n\n-0.2\n\nFigure 4.6: The Lyapunov exponents for the Gross-Neveu system in the\nreal domain.\nthere is another first integral\nJ = q1 p2 − q2 p1 ,\n\n(4.15)\n\nand no additional integral exists if the parameters are varied slightly. It is\nthus convenient to substitute m2 = −λǫ, so that the vector V is\n\n  \np1\nq1\n\n \nd \np2\n.\nq2 = \n(4.16)\ndt p1 −λq1 (q12 + q22 (1 + ǫ))\n2\n2\n−λq2 (q2 + q1 (1 + ǫ))\np2\n\nThis example is used to show, that even though the system is integrable\nonly when ǫ = 0, the Lyapunov exponents remain zero until the \"perturbation\" is big enough. Specifically, when ǫ = −1, the spectrum at t = 10000\nis\nλ = (−8.461 × 10−4 , 8.461 × 10−4 , −7.909 × 10−4 , 7.909 × 10−4 ).\nIts time evolution is presented in figure 4.7. The initial conditions were\nq1 (0) = 0.01, q2 (0) = 0, p1 (0) = 0.01 and p2 (0) positive, determined by H =\n0.01.\nChanging the value of ǫ to −1.9, with the same initial conditions gives a\ncompletely different picture. The exponents now read\nλ = (−0.1388, 0.1388, −8.078 × 10−4 , 8.078 × 10−4 ).\nThis is to be expected for a Hamiltonian system – that the chaos becomes\nvisible only for sufficient perturbation.\n\n36\n\n\fΛ\n0.2\n\n0.15\n\n0.1\n\n0.05\n\n1\u0090t\n0.01\n\n0.02\n\n0.03\n\n0.04\n\n0.05\n\n-0.05\n\n-0.1\n\n-0.15\n\n-0.2\n\nFigure 4.7: The Lyapunov exponents for the FRW system for ǫ = −1.\n\nΛ\n\n0.2\n\n0.1\n\n1\u0090t\n0.01\n\n0.02\n\n0.03\n\n0.04\n\n0.05\n\n-0.1\n\n-0.2\n\nFigure 4.8: The Lyapunov exponents for the FRW system for ǫ = −1.9.\n\n37\n\n\fChapter 5\n\nFinal Matters\nThe study presented here can only be considered a beginning of further\nexploration of the subject, but it can be definitely said, that the two approaches – geometric and algebraic – can be successfully conflated to yield\na better insight into integrability. Also, which is not to be underestimated,\ntrying to use both descriptions immediately shows that some objects are\nill-defined and some can be defined in many non-equivalent ways.\nTo be more concrete, the variations or small perturbations to a given dynamical system are an example of an object that reveals more when looked\nat from the geometric point of view. It is fundamentally different from the\noriginal system itself, as it really a vector on the tangent bundle of the\nmain trajectory. It also turns out that it should commute with the vector\nfield defining the system, as only then the transition to a nearby trajectory\nmakes sense. It is also the only additional field we need to reconstruct the\ncongruence of solutions if we can obtained the (first) variation as a function\nof the point on the manifold. As it is usually not the case, and we only solve\nan equation that gives the values of the variation on a particular trajectory,\nhigher variations are needed.\nHere also the basic notions of differential geometry are helpful to prove\nthe existence of first integrals of the higher variational equations when the\nmain system has a first integral. Unfortunately it appears, that higher\nvariations, when defined to agree with the algebraic definitions, are not\ncoordinate independent. A fact hard to notice when analysing the equation\nonly in the coordinates in which it is introduced or obtained from physical\nconsiderations.\nAnother example of clear formulation is the Lyapunov matrix and the\nLyapunov exponents. By definition they are constructed in a covariant way,\nbut there is a price to pay for that. Namely the additional metric structure is required. Lyapunov exponents are usually computed using the time\nparameter that is naturally present in system of physical origin, but in general relativistic problems or those whose formulation admits the freedom of\ntime reparametrisation it is not clear which variable is the real time. And\nit is obvious that a simple exponential change of that variable could make\npositive exponents zero [20].\nThe calculations presented here do not require any particular choice of\nmetric, so that they can be applied to any case and guarantee consistency.\n38\n\n\fOn the other hand, without any particular choice it is impossible to obtain\nany results. That is why the examples included are treated as is usually\nthe case – with the tacit assumption that the coordinates in which the system is defined are orthonormal. Until a distinguished metric structure can\nbe canonically defined for dynamical systems (or at least the physical systems), this freedom of choice will remain unresolved.\nAs mentioned in the introduction there are attempts to geometrise the\nsystem by finding some metric which would make the equations be the\ngeodesic equations on a suitable manifold, but so far this has been done for\na small class of systems with natural kinetic energy. It also immediately\ncollides with the problem of the base space – in the case of Jacobi metric for\nexample, only the configuration space is taken into account, instead of the\nwhole phase space.\nThis is best visible for Hamiltonian mechanics where we end up with\nanalysing second order equations in the coordinates and the momenta (although also formally included in the solutions) do not play any role in the\nbehaviour of neighbouring trajectories. Because the Jacobi geometrisation\nhinges heavily on the natural form of the kinetic energy, it is even impossible to obtain an analogous picture with a space of half the dimension involving only the momenta and suppressing the coordinates. The present work\nalso shows that the symplectic structure of such systems requires some serious additional metric assumptions to speak about volume conservation.\nEven with the freedom that differential geometry gives, Hamiltonian systems become highly structured in this context.\nFinally, among the still open problems, there is the question of studying\nmore than just the Levi-Civita connection for which the results reduce to\nthe algebraic ones. Introducing non-Riemannian (non-metric) connection or\ntorsion, complicates the equations considerably, but has, seemingly, nothing\nto do with the question of integrability. This could hopefully give the possibility of investigating the system on many different manifolds and in fact\nobtaining different restrictions on integrability of the same basic equations.\nAlso, the algebraic tools are deeply rooted in the complex analysis of\nmeromorphic functions, Riemann surfaces and analytic continuation. Thus,\nbeing integrable in the real sense is only understood indirectly. Here also\nlie new possibilities of extending the work to complex or Kähler manifolds,\nor developing the algebraic theory to treat the real-analytic case with more\ndetail.\n\n39\n\n\fBibliography\n[1] V. I. Arnold \"Mathematical Methods of Classical Mechanics,\" SpringerVerlag, New York, 1989.\n[2] M. Audin \"Les Systèmes Hamiltoniens et leur Intégrabilité,\" Cours\nSpécialisés, SMF et EDP-Sciences, 2001.\n[3] G. Benettin, L. Galgani, A. Giorgilli and J. M. Strelcyn \"Lyapunov Characteristic Exponents for smooth dynamical systems and\nfor hamiltonian systems; a method for computing all of them. Part 1:\nTheory,\" Meccanica, 15, 1:9–20, 1980.\n[4] F. Beukers and A. van der Waall \"Lamé equations with algebraic solutions.\" J. Differential Equations, 197, 1–25, 2004.\n[5] M. Szydlowski \" The Eisenhart Geometry as an Alternative Description of Dynamics in Terms of Geodesics,\" Gen. Rel. Grav., 30, 6:887–\n914, 1998.\n[6] A. Goriely \"Integrability and Nonintegrability of Dynamical Systems,\"\nWorld Scientific Publishing, Singapore, 2001.\n[7] G. Gorni and G. Zampieri \"Analytic non-integrability of an integrable\nanalytic Hamiltonian system,\" Differ. Geom. Appl., 22, 3:287–296,\n2005.\n[8] T. Kimura \"On Riemann's equations which are solvable by quadratures,\" Funkcial. Ekvac., 12, 269–281, 1969.\n[9] S. Kobayashi and K. Nomizu \"Foundations of Differential Geometry.\nVolume I,\" Interscience Publishers, New York, 1963\n[10] J. J. Kovacic \"An algorithm for solving second order linear homogeneous differential equations.\" J. Symbolic Comput., 2, 1:3–34, 1986.\n[11] A. J. Maciejewski and M. Przybylska \"Non-integrability of ABC flow,\"\nPhys. Lett. A, 303, 4:265–272, 2002.\n[12] A. J. Maciejewski, M. Przybylska and T. Stachowiak \"Non-integrability\nof Gross-Neveu systems,\" Physica D, 201, 249–267, 2005.\n[13] A. J. Maciejewski, M. Przybylska, T. Stachowiak and M. Szydlowski\n\"Global integrability of cosmological scalar fields,\" arXiv:0803.2318, to\nappear in Journ. Phys. A\n40\n\n\f[14] J. J. Morales-Ruiz \"Differential Galois theory and non-integrability of\nHamiltonian systems,\" Birkhäuser Verlag, Basel, 1999.\n[15] J. J. Morales-Ruiz and J. P. Ramis \"Integrability of Dynamical Systems\nthrough Differential Galois Theory: a practical guide,\" preprint, 2007.\n[16] M. Przybylska \"Differential Galois obstructions for integrability of homogeneous Newton equations,\" Journ. Math. Phys., 49, 022701, 2008.\n[17] M. Przybylska \"Finiteness of integrable n-dimensional homogeneous\npolynomial potentials,\" Phys. Lett. A, 369, 180–187, 2007.\n[18] M. Skwarczynski\nWarszawa, 1993.\n\n\"Geometria rozmaitosci Riemanna,\"\n\nPWN,\n\n[19] T. Stachowiak, A. J. Maciejewski and M. Szydlowski\n\"Nonintegrability of density perturbations in the FRW universe,\" Journ.\nMath. Phys., 47, 032502, 2006.\n[20] M. Szydlowski \"Toward an invariant measure of chaotic behaviour in\ngeneral relativity,\" Phys. Lett. A, 176, 1/2:22–32, 1993.\n[21] M. Szydlowski, M. Heller and W. Sasin \"Geometry of spaces with the\nJacobi metric,\" J. Math. Phys., 37, 346, 1996.\n[22] A. Wolf, J. B. Swift, H. L. Swinney and J. A. Vastano \"Determining Lyapunov exponents from a time series,\" Physica D, 16, 285–315, 1985.\n[23] S. L. Ziglin \"Branching of solutions and nonexistence of first integrals\nin Hamiltonian mechanics. I,\" Funct. Anal. Appl., 16, 181–189, 1982.\n\n41\n\n\f"}