{"id": "http://arxiv.org/abs/1204.3211v3", "guidislink": true, "updated": "2012-05-08T18:58:14Z", "updated_parsed": [2012, 5, 8, 18, 58, 14, 1, 129, 0], "published": "2012-04-14T20:28:02Z", "published_parsed": [2012, 4, 14, 20, 28, 2, 5, 105, 0], "title": "Monoids of O-type, subword reversing, and ordered groups", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1204.0482%2C1204.4978%2C1204.1344%2C1204.3211%2C1204.0233%2C1204.2276%2C1204.2859%2C1204.3764%2C1204.1571%2C1204.5294%2C1204.3860%2C1204.4293%2C1204.3395%2C1204.1776%2C1204.2282%2C1204.3662%2C1204.0376%2C1204.3745%2C1204.1414%2C1204.1094%2C1204.2817%2C1204.2332%2C1204.3808%2C1204.1707%2C1204.1250%2C1204.2735%2C1204.4048%2C1204.2703%2C1204.2521%2C1204.3064%2C1204.4561%2C1204.2078%2C1204.3446%2C1204.4584%2C1204.5595%2C1204.5722%2C1204.3232%2C1204.6171%2C1204.3527%2C1204.6225%2C1204.0126%2C1204.2961%2C1204.5746%2C1204.4886%2C1204.1212%2C1204.3360%2C1204.4143%2C1204.4626%2C1204.2492%2C1204.5466%2C1204.2725%2C1204.2053%2C1204.5966%2C1204.5580%2C1204.0709%2C1204.6420%2C1204.6356%2C1204.4588%2C1204.1728%2C1204.5364%2C1204.0469%2C1204.0500%2C1204.2097%2C1204.4404%2C1204.4915%2C1204.5937%2C1204.3804%2C1204.2200%2C1204.2643%2C1204.5489%2C1204.5217%2C1204.4134%2C1204.2099%2C1204.6447%2C1204.1939%2C1204.0879%2C1204.5824%2C1204.2531%2C1204.1714%2C1204.5732%2C1204.5173%2C1204.3397%2C1204.6324%2C1204.0253%2C1204.5977%2C1204.1448%2C1204.5688%2C1204.6316%2C1204.2778%2C1204.0071%2C1204.2470%2C1204.1733%2C1204.1200%2C1204.5528%2C1204.2647%2C1204.4100%2C1204.0306%2C1204.5092%2C1204.6616%2C1204.1218%2C1204.2932&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Monoids of O-type, subword reversing, and ordered groups"}, "summary": "We describe a simple scheme for constructing finitely generated monoids in\nwhich left-divisibility is a linear ordering and for practically investigating\nthese monoids. The approach is based on subword reversing, a general method of\ncombinatorial group theory, and connected with Garside theory, here in a\nnon-Noetherian context. As an application we describe several families of\nordered groups whose space of left-invariant orderings has an isolated point,\nincluding torus knot groups and some of their amalgamated products.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1204.0482%2C1204.4978%2C1204.1344%2C1204.3211%2C1204.0233%2C1204.2276%2C1204.2859%2C1204.3764%2C1204.1571%2C1204.5294%2C1204.3860%2C1204.4293%2C1204.3395%2C1204.1776%2C1204.2282%2C1204.3662%2C1204.0376%2C1204.3745%2C1204.1414%2C1204.1094%2C1204.2817%2C1204.2332%2C1204.3808%2C1204.1707%2C1204.1250%2C1204.2735%2C1204.4048%2C1204.2703%2C1204.2521%2C1204.3064%2C1204.4561%2C1204.2078%2C1204.3446%2C1204.4584%2C1204.5595%2C1204.5722%2C1204.3232%2C1204.6171%2C1204.3527%2C1204.6225%2C1204.0126%2C1204.2961%2C1204.5746%2C1204.4886%2C1204.1212%2C1204.3360%2C1204.4143%2C1204.4626%2C1204.2492%2C1204.5466%2C1204.2725%2C1204.2053%2C1204.5966%2C1204.5580%2C1204.0709%2C1204.6420%2C1204.6356%2C1204.4588%2C1204.1728%2C1204.5364%2C1204.0469%2C1204.0500%2C1204.2097%2C1204.4404%2C1204.4915%2C1204.5937%2C1204.3804%2C1204.2200%2C1204.2643%2C1204.5489%2C1204.5217%2C1204.4134%2C1204.2099%2C1204.6447%2C1204.1939%2C1204.0879%2C1204.5824%2C1204.2531%2C1204.1714%2C1204.5732%2C1204.5173%2C1204.3397%2C1204.6324%2C1204.0253%2C1204.5977%2C1204.1448%2C1204.5688%2C1204.6316%2C1204.2778%2C1204.0071%2C1204.2470%2C1204.1733%2C1204.1200%2C1204.5528%2C1204.2647%2C1204.4100%2C1204.0306%2C1204.5092%2C1204.6616%2C1204.1218%2C1204.2932&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We describe a simple scheme for constructing finitely generated monoids in\nwhich left-divisibility is a linear ordering and for practically investigating\nthese monoids. The approach is based on subword reversing, a general method of\ncombinatorial group theory, and connected with Garside theory, here in a\nnon-Noetherian context. As an application we describe several families of\nordered groups whose space of left-invariant orderings has an isolated point,\nincluding torus knot groups and some of their amalgamated products."}, "authors": ["Patrick Dehornoy"], "author_detail": {"name": "Patrick Dehornoy"}, "author": "Patrick Dehornoy", "arxiv_comment": "updated version with new results", "links": [{"href": "http://arxiv.org/abs/1204.3211v3", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1204.3211v3", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.GR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.GR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1204.3211v3", "affiliation": "LMNO", "arxiv_url": "http://arxiv.org/abs/1204.3211v3", "journal_reference": null, "doi": null, "fulltext": "1\n\nMONOIDS OF O-TYPE, SUBWORD REVERSING, AND ORDERED\nGROUPS\n\narXiv:1204.3211v3 [math.GR] 8 May 2012\n\nPATRICK DEHORNOY\nAbstract. We describe a simple scheme for constructing finitely generated monoids in\nwhich left-divisibility is a linear ordering and for practically investigating these monoids.\nThe approach is based on subword reversing, a general method of combinatorial group\ntheory, and connected with Garside theory, here in a non-Noetherian context. As an\napplication we describe several families of ordered groups whose space of left-invariant\norderings has an isolated point, including torus knot groups and some of their amalgamated products.\n\nA group G is left-orderable if there exists a linear ordering on G that is left-invariant,\ni.e., g < g ′ implies hg < hg ′ for every h in G. Viewing an ordering on G as a subset\nof G × G, one equips the family LO(G) of all left-invariant orderings of G with a topology\ninduced by the product topology of P(G×G). Then LO(G) is a compact space and, in many\ncases, in particular when G is a countable non-abelian free group, LO(G) has no isolated\npoints and it is a Cantor set [21, 4]. By contrast, apart from the cases when LO(G) is\nfinite and therefore discrete, as is the case for the Klein bottle group and, more generally,\nfor the Tararin groups [22, 15], not so many examples are known when LO(G) contains\nisolated points. By the results of [12], this happens when G is an Artin braid group (see also\n[16]), and, by those of [17, 13], when G is a torus knot group, i.e., a group of presentation\nhx, y | xm = yn i with m, n > 2. These results, as well as the further results of [14], use\nnon-elementary techniques.\nThe aim of this paper is to observe that a number of ordered groups with similar properties, including the above ones, can be constructed easily using a monoid approach. A\nnecessary and sufficient condition for a submonoid M of a group G to be, when 1 is removed, the positive cone of a left-invariant ordering on G is that M is what will be called\nof O-type, namely it is cancellative, has no nontrivial invertible element, and its left-and\nright-divisibility relations (see Definition 1.1) are linear orderings. Moreover, the involved\nordering is isolated in the corresponding space LO(G) whenever M is finitely generated.\nWe are thus naturally led to the question of recognizing which (finite) presentations define\nmonoids of O-type.\nHere we focus on presentations of a certain syntactical type called triangular. Although\nno complete decidability result can probably be expected, the situation is that, in practice,\nmany cases can be successfully addressed, actually all cases in the samples we tried. The\nmain tool we use here is subword reversing [5, 6, 7, 8], a general method of combinatorial\ngroup theory that is especially suitable for investigating divisibility in a presented monoid\nand provides efficient algorithms that make experiments easy. Both in the positive case\n(when the defined monoid is of O-type) and in the negative one (when it is not), the approach\nleads to sufficient Σ11 -conditions, i.e., provides effective procedures returning a result when\nthe conditions are met but possibly running forever otherwise. At a technical level, the\n\n1\n\nWork partially supported by the ANR grant ANR-08-BLAN-0269-02\n1991 Mathematics Subject Classification. 06F15, 20M05, 20F60.\nKey words and phrases. monoid presentation, subword reversing, divisibility, quasi-central element, ordered group, space of orderings, Garside theory.\n1\n\n\f2\n\nPATRICK DEHORNOY\n\nmain new observation is that subword reversing can be useful even in a context where the\ntraditional Noetherianity assumptions fail.\nThe outcome is the construction of families of finitely generated monoids of O-type,\nhence of ordered groups with isolated points in the space of left-orderings, together with\nalgorithmic tools for analysing these structures. There is a close connection with Garside\ntheory [9] as most of the mentioned examples admit a Garside element. The scheme can be\nsummarized as follows (see Theorem 6.5 for a more general version):\nTheorem 1. A sufficient condition for a group G to be orderable is that\nG admits a (finite or infinite) presentation\n(∗)\n(a1 , a2 , ... ; a1 = a2 w2 a2 , a2 = a3 w3 a3 , ...)\nwhere w2 , w3 , ... are words in {a1 , a2 , ...} (no a−1\ni ) and there exists in the\nmonoid presented by (∗) an element ∆ such that there exist g1 , g1′ , g2 , g2′ ,...\nsatisfying a1 g1 = ∆ = g1′ a1 and ai ∆ = ∆gi and ∆ai = gi′ ∆ for i > 2.\nThen, the subsemigroup of G generated by a1 , a2 ,... is the positive cone of a left-invariant\nordering on G. If (∗) is finite, this ordering is isolated in the space LO(G). If (∗) is finite\nor recursive, the word problem of G and the decision problem of the ordering are decidable.\nAmong others, the approach applies to the above mentioned torus knot groups, providing\na short construction of an isolated ordering, and in particular to the group B3 of 3-strand\nbraids, providing one more proof of its orderability. More examples are listed in Table 1 and\nin Section 8 below.\n1:\n\nhx, y | xp+1 =yq+1 i\n\n2:\n\nhx, y, z | xp+1 = yq+1 , yr+1 = zs+1 i\n\n3:\n\nhx, y | xp+1 = (y(xr−p y)s )q+1 i\n\n4:\n\nhx, y | xr+1 = (yx2 y)q+1 i\nwith r = 0 or r = 1\n\n(a, b ; a = b(ap b)q )\n∆ = ap+1 central (Proposition 8.1);\n(a, b, c ; a = b(ap b)q , b = c((ap b)r ap c)s )\n∆ = a(p+1)(r+1) central (Proposition 8.4);\n(a, b ; a = b(ar b)s (ap b(ar b)s )q ) with r > p\nδ = a dominating (Proposition 8.7);\nis also ha, b, c | a = b(ap b)q , b = c(ar c)s i;\n(a, b, c ; a = ba2 (b2 a2 )q c, b = c(ba2 )r ba)\n∆ = (ba2 )2q+r+3 central (Proposition 8.9).\n\nTable 1. Some groups eligible for the current approach, hence ordered with an\nisolated point in the space of orderings: on the right, a presentation eligible for\nTheorem 1 or its extensions and the involved distinguished element ∆.\n\nThe paper is organized as follows. In Section 1, we introduce the notion of a monoid of\nO-type and describe its connection with ordered groups. In Section 2, we define triangular\npresentations, raise the central question, namely recognizing when a (right)-triangular presentation defines a monoid of (right)-O-type (and therefore leads to an ordered group), and\nstate without proof the main technical result (\"Main Lemma\"), which reduces the central\nquestion to the existence of common right-multiples. Section 3 contains a brief introduction\nto subword reversing, with observations about the particular form it takes in the context of\nright-triangular presentations. In Section 4, we establish that every right-triangular presentation is what we call complete for right-reversing, and deduce a proof of the Main Lemma.\nNext, we investigate in Section 5 the notions of a dominating and a quasi-central element\nin a monoid and, putting things together, we obtain the expected sufficient conditions for\na presentation to define a monoid of O-type. The proof of Theorem 1 is then completed\nin Section 6. Then, we report in Section 7 about some computer investigations and, in\nSection 8, we describe some examples, in particular those mentioned in Table 1. Finally, in\n\n\fMONOIDS OF O-TYPE, SUBWORD REVERSING, AND ORDERED GROUPS\n\n3\n\nSection 9, we establish some negative results about the existence of triangular presentations,\nand gather some open questions in Section 10.\nThe author thanks A. Navas, L. Paris, C. Rivas, and D. Rolfsen for discussions about the\nsubject of the paper.\n1. Monoids of O-type\nIf G is an orderable group and < is a left-invariant ordering of G, the positive cone P<\nof <, i.e., the set {g ∈ G | g > 1}, is a subsemigroup of G satisfying G = P< ∐ P< −1 ∐ {1}.\nConversely, if P is a subsemigroup of G satisfying G = P ∐ P −1 ∐ {1}, then the relation\ng −1 h ∈ P defines a left-invariant ordering on G and P is the associated positive cone.\nIn the sequel, the notions of divisors and multiples will play a central role. It is convenient\nto consider them in the context of monoids, i.e., semigroups with a unit.\nDefinition 1.1. Assume that M is a monoid. For g, h in M , we say that g is a left-divisor\nof h, or, equivalently, h is a right-multiple of g, denoted g 4 h, if there exists h′ in M\nsatisfying gh′ = h. Symmetrically, we say that g is a right-divisor of h, or, equivalently, h\ne g, if there exists h′ in M satisfying h = h′ g.\nis a left-multiple of g, denoted h <\n\nFor every monoid M , left- and right-divisibility are partial preorders on M , and they are\npartial orders whenever 1 is the only invertible element of M . Note that the right-divisibility\nf, i.e., the\nrelation of a monoid M is the left-divisibility relation of the opposite monoid M\nmonoid with the same domain equipped with the operation defined by g e* h = hg.\nIt is easy to translate the existence of an invariant ordering in a group into the language\nof monoids and divisibility. We recall that a monoid is called left-cancellative (resp. rightcancellative), for all g, g ′ , h in the monoid, hg = hg ′ (resp. gh = g ′ h) implies g = g ′ .\nA monoid is cancellative if it is both left- and right-cancellative. The monoids we shall\ninvestigate are as follows.\nDefinition 1.2. A monoid M is said to be of right-O-type (resp. left-O-type) if M is leftcancellative (resp. right-cancellative), 1 is the only invertible element in M , and, for all g, h\ne h, h <\ne g) holds. A monoid is of O-type if it is\nin M , at least one of g 4 h, h 4 g (resp. g <\nboth of right- and left-O-type.\n\nIn other words, a monoid M is of right-O-type if it is left-cancellative and left-divisibility\nis a linear ordering on M , and it is of O-type if it is cancellative and left- and rightdivisibility are linear orderings on M . The letter O stands for \"order\"; it may seem strange\nthat the notion connected with left-divisibility is called \"right-O-type\", but this option is\nnatural when one thinks in terms of multiples and it is more coherent with the forthcoming\nterminology. The connection with ordered groups is easy.\nLemma 1.3. For G a group and M a submonoid of G, the following are equivalent:\n(i) The group G admits a left-invariant ordering whose positive cone is M \\{1};\n(ii) The monoid M is of O-type.\n\nProof. Assume (i). Put P = M \\{1}. First, by assumption, M is included in a group,\nhence it must be cancellative. Next, assume that g is an invertible element of M , i.e., there\nexists h in M satisfying gh = 1. If g belongs to P , then so does h and, therefore, g belongs\nto P ∩ P −1 , contradicting the assumption that P is a positive cone. So 1 must be the only\ninvertible element of M . Now, let g, h be distinct elements of M . Then one of g −1 h, h−1 g\nbelongs to P , hence to M : in the first case, g 4 h holds, in the second, h 4 g. Symmetrically,\ne h or h <\ne g. So any two\none of gh−1 , hg −1 belongs to P , hence to M , now implying g <\ne Hence M is of O-type, and (i)\nelements of M are comparable with respect to 4 and <.\nimplies (ii).\n\n\f4\n\nPATRICK DEHORNOY\n\nConversely, assume that M is of O-type. Put P = M \\{1} again. Then P is a subsemigroup of G. The assumption that 1 is the only invertible element in M implies P ∩ P −1 = ∅.\nNext, the assumption that any two elements of M are comparable with respect to 4 implies\na fortiori that any two of its elements admit a common right-multiple. By Ore's theorem [3],\nthis implies that G is a group of right-fractions for M , i.e., every element of G admits an\nexpression of the form gh−1 with g, h in M . Now, let f be an element of G. As said above,\ne h, h <\ne g\nthere exist g, h in M satisfying f = gh−1 . By assumption, at least one of g <\nholds in M . This means that at least one of f ∈ M , f ∈ M −1 holds. Therefore, we have\nG = M ∪ M −1 , which is also G = P ∪ P −1 ∪ {1}. So P is a positive cone on G, and (ii)\nimplies (i).\n\u0003\nIt will be convenient to restate the orderability criterion of Lemma 1.3 in terms of presentations. A group presentation (S ; R) is called positive [7] if R a family of relations of\nthe form u = v, where u, v are nonempty words in the alphabet S (no empty word, and\nno letter s−1 ). Every positive presentation (S ; R) gives rise to two structures, namely a\nmonoid, here denoted hS | Ri+ , and a group, denoted hS | Ri. Note that a monoid admits a\npositive presentation if and only if 1 is the only invertible element. Also remember that, in\ngeneral, the monoid hS | Ri+ need not embed in the group hS | Ri.\nProposition 1.4. A necessary and sufficient condition for a group G to be orderable is that\nG admits a positive presentation (S ; R) such that the monoid hS | Ri+ is of O-type.\nIn this case, the subsemigroup of G generated by S is the positive cone of a left-invariant\nordering on G. If S is finite, this ordering is an isolated point in the space LO(G).\nProof. Assume that G is an orderable group. Let P be the positive cone of a left-invariant\nordering on G, and let M = P ∪ {1}. By the implication (i) ⇒ (ii) of Lemma 1.3, the\nmonoid M is of O-type. As 1 is the only invertible element in M , the latter admits a\npositive presentation (S ; R). As G = M ∪ M −1 holds, G is a group of right-fractions for M .\nBy standard arguments, this implies that (S ; R) is also a presentation of G.\nConversely, assume that G admits a positive presentation (S ; R) such that the monoid\nhS | Ri+ is of O-type. Let M be the submonoid of G generated by S, and let P = M \\{1}. As\nobserved in the proof of Lemma 1.3, Ore's theorem implies that hS | Ri+ embeds in a group of\nfractions, and the latter admits the presentation (S; R), hence is isomorphic to G. Hence, the\nidentity mapping on S induces an embedding ι of hS | Ri+ into G. Therefore, the image of ι,\nwhich is the submonoid of G generated by S, hence is M , admits the presentation (S ; R).\nSo the assumption implies that M is of O-type. Then, by the implication (ii) ⇒ (i) of\nLemma 1.3, P is the positive cone of a left-invariant ordering on G.\nAs for the last point, the definition of the topology on the space LO(G) [21] implies that,\nif the positive cone of a left-ordering on the group G is generated, as a semigroup, by a finite\nset S, then the ordering is an isolated point in the space LO(G) because this ordering is the\nonly one in which S is positive and the set of all such orderings is open.\n\u0003\n2. Triangular presentations\nWe are thus led to looking for monoids of O-type and, more specifically, for recognizing\nwhich presentations define monoids of O-type. Owing to the symmetry of the definition, we\nshall mainly focus on recognizing monoids of right-O-type and then use the criteria for the\nopposite presentation. Now, if a monoid M is of right-O-type and it is generated by some\nsubset S, then, for all s, s′ in S, the elements s and s′ are comparable with respect to 4,\ni.e., s′ = sg holds for some g, or vice versa. In other words, some relation of the particular\nform s′ = sw must be satisfied in M . We shall consider presentations in which all relations\nhave this form (see Section 9 for a discussion about the relevance of this approach).\n\n\fMONOIDS OF O-TYPE, SUBWORD REVERSING, AND ORDERED GROUPS\n\n5\n\nDefinition 2.1. A semigroup relation u = v is called triangular if either u or v consists of\na single letter.\nSo, a triangular relation has the generic form s′ = sw, where s, s′ belong to the reference\nalphabet. For instance, a = bab and b = c2 ba are typical triangular relations in the alphabet\n{a, b, c}. The problem we shall address now is\nQuestion 2.2. Assume that (S ; R) is a presentation consisting of triangular relations. Is\nthe associated monoid necessarily of right-O-type?\nThe following counter-example shows that a uniform positive answer is impossible.\nExample 2.3. The presentation (a, b, c; c = ab, c = ba) consists of two triangular relations.\nThe associated monoid M is a rank 2 free Abelian monoid based on a and b, and neither\nof a, b is a right-multiple of the other. So M is not of right-O-type.\nClearly, the problem in Example 2.3 is the existence of several relations c = ... simultaneously. We are thus led to restricting to particular families of triangular relations. If S is\na nonempty set, we denote by S ∗ the free monoid of all words in the alphabet S. We use ε\nfor the empty word.\nDefinition 2.4. A positive presentation (S; R) is called right-triangular if there exist S ′ ⊆ S\nand maps N (\"next\") : S ′ → S and C (\"complement\") : S ′ → S ∗ \\{ε} such that N is injective\nwith no fixpoint and R consists of the relations N (s) = sC(s) for s in S ′ . We write C i (s)\nb for R ∪ {N i (s) = sC i (s) | i >\nfor C(s)C(N (s))***C(N i−1 (s)) when N i (s) is defined, and R\ne (s) = C(s)s.\ne\n2}. A left-triangular presentation is defined symmetrically by relations N\nA\npresentation is triangular if it is both right- and left-triangular.\n\nExample 2.5. Assume S = {a, b, c} and R = {a = bac, b = cba}. Then (S ; R) is a righttriangular presentation. The associated maps N and C are given by N (b) = a, C(b) = ac,\nb = R ∪ {a = cba2 c}. The presentation (S ; R) is also\nN (c) = b, C(c) = ba, and we have R\ne\ne\ne (a) = b, C(a)\ne\ne (c) = a, C(c)\ne\nleft-triangular, with N and C defined by N\n= cb, N\n= ba.\n\nb is a sort of transitive closure\nIf (S ; R) is a right-triangular presentation, the family R\nb\nof R, and the presentations (S ; R) and (S ; R) define the same monoid and the same group.\nTriangular presentations can be described in terms of the left- and right-graphs [1, 19]. The\nleft-graph (resp. right-graph) of (S ; R) is the unoriented graph with vertex set S such that\n{s, s′ } is an edge if and only if there exists a relation s... = s′... (resp. ...s = ...s′ ) in R.\nThen a presentation (S ; R) is right-triangular if it consists of triangular relations and, in\naddition, the left-graph of (S ; R) is a union of discrete chains. In practice, we shall be\nmostly interested in the case when there is only one (countable) chain, in which case there\nexists a (finite or infinite) subset I of Z such that S is {ai | i ∈ I} and R consists of one\nrelation ai−1 = ai wi for each i in I that is not minimal.\nOur main technical result will be a criterion for recognizing which right-triangular presentations give rise to a monoid of right-O-type.\nProposition 2.6 (Main Lemma). Assume that (S ; R) is a right-triangular presentation.\nThen the following are equivalent:\n(i) The monoid hS | Ri+ is of right-O-type;\n(ii) Any two elements of hS | Ri+ admit a common right-multiple.\nThe proof of the Main Lemma will be completed at the end of Section 4 below. Merging\nthe result with Proposition 1.4 immediately provides the following sufficient condition of\norderability.\nCorollary 2.7. A sufficient condition for a group G to be orderable is that\n\n\f6\n\nPATRICK DEHORNOY\n\nG admits a triangular presentation (S ; R) such that any two elements of the\nmonoid hS | Ri+ have a common right-multiple and a common left-multiple.\nIn this case, the subsemigroup of G generated by S is the positive cone of a left-invariant\nordering on G. If S is finite, this ordering is an isolated point in the space LO(G).\nProof. By the Main Lemma, the monoid hS | Ri+ , which admits a right-triangular presentation is of right-O-type, and so is the opposite monoid. Hence hS | Ri+ is also of left-O-type,\nand therefore it is of O-type. Then Proposition 1.4 implies that G is orderable, with the\nexpected explicit ordering.\n\u0003\n3. Subword reversing\nWe shall prove the Main Lemma by using subword reversing. In essence, subword reversing is a strategy for constructing van Kampen diagrams in a context of monoids, i.e.,\nequivalently, for finding derivations between words, and we shall see that it is especially\nrelevant for investigating triangular presentations (due to the special form of triangular\npresentations, it might well be that alternative arguments using rewrite systems or other\napproaches also exist, but this is not clear).\nThe description given below is sketchy, as we only mention the definition and the needed\ntechnical results. We refer to [7, 8] for additional motivation and explanation.\nAs is usual with presented groups, if S is an alphabet, we introduce a formal copy S −1\nof S consisting of one letter s−1 for each letter of S. The letters of S are then called positive,\nwhereas those of S −1 are called negative. Accordingly, a word in the alphabet S ∪ S −1 will\nbe called a signed S-word, whereas a word in the alphabet S is called an S-word, or a positive\nS-word if we wish to insist that there is no negative letter. If w is a signed S-word, w−1\ndenotes the word obtained from w by exchanging s and s−1 everywhere and reversing the\norder of the letters. A word of the form u−1 v with u, v positive is called negative–positive.\nDefinition 3.1. Assume that (S ; R) a positive presentation and w, w′ are signed S-words.\n(1)\nWe say that w is right-R-reversible to w′ in one step, denoted w yR w′ , if either there exist\ns, s′ in S, a relation sv ′ = s′ v of R, and signed words w1 , w2 satisfying\n(3.1)\n\nw = w1 s−1 s′ w2\n\nand\n\nw′ = w1 v ′ v −1 w2 ,\n\nor there exist s in S and signed S-words w1 , w2 satisfying\n(3.2)\n\nw = w1 s−1 s w2\n\nand\n\nw′ = w1 w2 .\n(n)\n\nWe say that w is right-R-reversible to w′ in n steps, denoted w yR w′ , if there exist\n(1)\nw0 , ..., wn satisfying w0 = w, wn = w′ and wi yR wi+1 for each i. We write w yR w′ if\n(n)\nw yR w′ holds for some n.\nNote that (3.2) becomes an instance of (3.1) if, for every s in S, the trivial relation s = s\nis considered to belong to R. Right-reversing consists in replacing a negative–positive length\ntwo subword with a positive–negative word, hence somehow reversing the signs, whence the\nterminology. We shall often write \"reversing\" for \"right-reversing\" (except at the end of\nSection 5 where left-reversing, the symmetric counterpart of right-reversing, occurs).\nExample 3.2. Assume S = {a, b, c} and R = {a = bab, b = cbc, a = cbcab}. Starting for\ninstance with w = a−1 c−1 a, we find\n(1)\n\n(1)\n\nw = a−1 c−1 a yR a−1 bcab yR b−1 a−1 cab,\nwhere, at each step, the reversed subword is underlined. Observe that the word obtained\n(4n)\nafter two reversing steps is b−1 w−1 b, so that w yR b−2n wb2n holds for every n.\n\n\fMONOIDS OF O-TYPE, SUBWORD REVERSING, AND ORDERED GROUPS\n\n7\n\nIt is useful to associate with every sequence of reversing steps a rectangular grid diagram\nthat illustrates it (see [8] for full details). Assume that w0 , w1 , ... is an R-reversing sequence,\n(1)\ni.e., wi yR wi+1 holds for every i. The diagram is analogous to a van Kampen diagram, and\nit is constructed inductively. First we associate with w0 a path shaped like an ascending\nstaircase by reading w0 from left to right and iteratively appending a horizontal rightoriented edge labeled s for each letter s, and a vertical down-oriented edge labeled s for\neach letter s−1 . Then, assume that the diagram for w0 , ..., wi has been constructed, and\nwi+1 is obtained from wi by reversing some subword s−1 s′ into v ′ v −1 . Inductively, the\ns′\nsubword s−1 s′ corresponds to an open pattern s\n\nin the diagram, and we complete\ns′\n\nit by appending new arrows forming the closed pattern s\n\nyR v . If the length l of v is\n\nv′\nmore than one, the arrow labeled v consists of l concatenated arrows. If v is empty, we\ns′\nappend a equality sign, as in s\n\nyR\n\n. It then follows from the inductive definition that\n\nv′\nall words wi can be read in the diagram by following the paths that connect the bottom-left\ncorner to the top-right corner, see Figure 1.\na\nyR\n\nc\nb\na\n\nyR\n\nc\n\na\n\nb\n\na\nb\n\nFigure 1. Reversing diagram associated with the reversing sequence of Example 3.2: starting from the signed word a−1 c−1 a, which corresponds to the left and\ntop arrows, we successively reverse c−1 a into bcab, and a−1 b into b−1 a−1 , thus\nobtaining the final word b−1 a−1 cab.\n\nIf (S ; R) is a positive presentation, and u, v are S-words, applying iterated subword\nreversing to the signed word u−1 v may lead to three different behaviours:\n- either the process continues for ever (as in the case of Example 3.2),\n- or one gets stuck with a factor s−1 s′ such that R contains no relation s... = s′...,\n- or the process leads in finitely many steps to a positive–negative word v ′ u′−1 where u′\nand v ′ are S-words (no letter s−1 ): then the sequence cannot be extended since the last\nword contains no subword of the form s−1 s′ ; this case corresponds to a reversing diagram\nv\nof the form u\n\nyR\n\nu′, and we shall then say that the reversing of u−1 v is terminating.\n\nv′\nWe shall use without proof two (elementary) results about reversing. The first one connects R-reversing with R-equivalence and it expresses that a reversing diagram projects to\na van Kampen diagram when the vertices connected with equality signs are identified.\nNotation 3.3. For (S ; R) a positive presentation, we denote by ≡+\nR the smallest congruence\n+\non S ∗ that includes R, so that hS | Ri+ is S ∗/≡+\nR . For w an S-word, we denote by [w] the\n+\n+\n≡R -class of w, i.e., the element of the monoid hS | Ri represented by w.\n\n\f8\n\nPATRICK DEHORNOY\n\nLemma 3.4. [7, Proposition 1.9] Assume that (S; R) is a positive presentation, and u, v, u′ , v ′\n′\n−1\nare S-words satisfying u−1 v yR v ′ u′−1 . Then uv ′ ≡+\nv yR ε\nR vu holds. In particular, u\nimplies u ≡+\nv.\nR\nv\nIn other words, the existence of a reversing diagram u\n\nyR\n\n′\nu′ implies uv ′ ≡+\nR vu ,\n\nv′\nwhich also reads [u]+ [v ′ ]+ = [v]+ [u′ ]+ : the element represented by uv ′ and vu′ is a common\nright-multiple of [u]+ and [v]+ in the associated monoid. Thus subword reversing can be\nseen as a tool for constructing common right-multiples in presented monoids.\nThe second basic result says that, when the reversing of a compound word u−1 v1 v2\nterminates, the reversing steps involving v1 and v2 can be separated.\nLemma 3.5. [7, Lemma 1.8] Assume that (S ; R) is a positive presentation and u, v, u′ , v ′\n(n)\nare S-words satisfying u−1 v yR v ′ u′−1 . Then, for every decomposition v = v1 v2 , there exist\n(n )\nan S-word u0 and decompositions v ′ = v1′ v2′ and n = n1 + n2 such that u−1 v1 yR 1 v1′ u−1\n0\n(n2 ) ′ ′−1\nand u−1\nv\ny\nv\nu\nhold.\n2\n2\n0\nR\nv1\nv2\nv1\nv2\nIn other words, every diagram u\n\n(n)\n\nyR\n\nu′ splits into u\n\n(n )\n\nyR 1\n\n(n )\n\nu0 yR 2 u′ .\n\nv′\nv1′\nv2′\nHere comes the first specific observation about reversing with triangular relations.\nLemma 3.6. If (S ; R) is a positive presentation consisting of triangular relations, and\nu, v, u′ , v ′ are S-words satisfying u−1 v yR v ′ u′−1 , then at least one of u′ , v ′ is empty.\nProof. We use induction on the number of reversing steps, i.e., the number n such that\n(n)\nu−1 v yR v ′ u′−1 holds. For n = 0, the only possibility is that u, v, u′ , v ′ all are empty and\nthe result is trivial. For n = 1, the only possibility is that u or v consists of one letter, say\nfor instance u = s ∈ S. Write v = s′ w with s′ in S. If the (unique) reversing step is of the\ntype s−1 s y ε, we obtain u′ = ε (and v ′ = w). Otherwise, the reversing step is either of the\ntype s−1 s′ y w′ with sw′ = s′ a relation of R, or of the type s−1 s′ y w′−1 with s′ w′ = s\na relation of R. In the first case, we obtain u′ = ε (and v ′ = w′ w); in the second case, the\nfinal word w′−1 w is positive–negative only if w is empty, and, in this case, we have v ′ = ε\n(and u′ = w′ ). The argument is similar if v, instead of u, has length one.\nAssume now n > 2. Then at least one of the words u, v has length two or more. Assume\nthat v does, and write it as v1 v2 with v1 , v2 nonempty. By Lemma 3.5, the assumption\nthat u−1 v1 v2 reverses to v ′ u′−1 in n steps implies the existence of S-words v1′ , v2′ , u0 and of\nnumbers n1 , n2 satisfying\nv ′ = v1′ v2′ ,\n\nn = n1 + n2 ,\n\n(n )\n\nu−1 v1 yR 1\n\nv1′ u−1\n0 ,\n\n(n )\n\n2\nand u−1\n0 v2 yR\n\nv1′ u′−1 .\n\nTwo cases are possible. Assume first n1 = n, whence n2 = 0. As, by assumption, v2 is\nnonempty, the hypothesis that u−1\n0 v2 is a positive–negative word implies that u0 is empty,\nand so is u′ . Assume now n1 < n. The value n1 = 0 is impossible as it would imply that u\nor v1 is empty, contrary to the assumption. Hence we also have n2 < n. Now assume that\nu′ is nonempty. Then, as we have n2 < n, the induction hypothesis implies that v2′ is empty.\nNext, u′ can be nonempty only if u0 is nonempty. Then, as we have n1 < n, the induction\nhypothesis implies that v1′ is empty as well, and we conclude that v ′ , which is v1′ v2′ , is empty.\nSee Figure 2.\n\u0003\nSo, in the context of triangular relations, when reversing is terminating, it shows not\nonly that the elements of the monoid represented by the initial words admit a common\n\n\fMONOIDS OF O-TYPE, SUBWORD REVERSING, AND ORDERED GROUPS\n\n9\n\nFigure 2. The three possible ways of concatenating two reversing diagrams in\nwhich one of the output words is empty: in each case, one of the final output words\nhas to be empty.\nright-multiple, but also that these elements are comparable with respect to left-divisibility.\nIndeed, by Lemma 3.4, if we have u−1 v yR v ′ with v ′ a (positive) S-word, we deduce\n[u]+ [v ′ ]+ = [v]+ , whence [u]+ 4 [v]+ in the monoid hS | Ri+ and, symmetrically, if we have\nu−1 v yR u′−1 with u′ an S-word, we deduce [v]+ [u′ ]+ = [u]+ , whence [v]+ 4 [u]+ .\n4. Completeness of subword reversing\nOwing to Lemma 3.6, if (S ; R) is a positive presentation that consists of triangular\nrelations, in order to prove that any two elements of the monoid hS | Ri+ are comparable\nwith respect to left-divisibility, it is enough to show that, for all S-words u, v, there exists\nat least one reversing sequence from u−1 v that is terminating, i.e., is finite and finishes with\na positive–negative word.\nA natural situation in which reversing is guaranteed to be terminating is the case when,\nfor every pair of letters s, s′ , there exists at least one relation s... = s′... in R (so that one\nnever gets stuck) and all relations u = v of R involve words u, v of length at most two, so that\nreversing does not increase the length of words. More generally, termination is guaranteed\nb there exist u′ , v ′\nwhen one can identify a set of S-words Sb including S so that, for all u, v in S,\n−1\n′ ′−1\nb\nin S satisfying u v yR v u\n(which amounts to meet the above conditions with respect\nb However, except in a few trivial examples, this approach\nto the extended alphabet S).\nfails when applied to presentations with triangular relations: usually, the closure Sb of S\nunder reversing is infinite and difficult to work with. Therefore, we must use a more subtle\napproach in two steps, namely showing that\n(i) if two elements represented by words u, v admit a common right-multiple, then the\nreversing of u−1 v terminates, and\n(ii) any two elements of the considered monoids admit a common right-multiple.\nWhen this is done, Lemma 3.6 can be applied and one is close to concluding that the\nconsidered monoid is of right-O-type. In this section, we address point (i). Here comes the\nsecond, more important observation of the paper, namely that (i) is always true for a righttriangular presentation. Technically, the proof relies on what is known as the completeness\ncondition.\nIf (S ; R) is any positive presentation, then, by Lemma 3.4, u−1 v yR ε, i.e., the existence\nv\nof a diagram u\n\nyR\n\n, implies u ≡+\nR v. We consider now the converse implication.\n\nDefinition 4.1 (complete). A positive presentation (S ; R) is called complete for rightreversing if, for all S-words u, v,\n(4.1)\n\nu ≡+\nR v\n\nimplies\n\nu−1 v yR ε.\n\nAs the converse of (4.1) is always true, if (S ; R) is complete, (4.1) is an equivalence.\nRemark 4.2. If there exist two letters s, s′ of S such that, in the presentation R, there\nis more than one relation of the type s... = s′... (including the case when there exists\na relation s... = s... different from the implicit trivial relation s = s), then R-reversing\nneed not be a deterministic process and, starting from some words u, v, there may exist\n\n\f10\n\nPATRICK DEHORNOY\n\nseveral pairs u′ , v ′ satisfying u−1 v yR v ′ u′−1 . According to our definitions, the condition\nu−1 v yR ε involved in (4.1) means that there exists at least one way of obtaining the empty\nword starting from u−1 v. However, this type of non-determinism never occurs with a rightb by definition, R\nb contains at most\ntriangular presentation (S ; R) or its completion (S, R):\n′\nb\none relation s... = s ... for each pair of letters, so R- and R-reversings are deterministic.\n\nThe intuition behind completeness is that, when a presentation is complete for rightreversing, the a priori complicated relation ≡+\nR can be replaced with the more simple relation yR . As explained in [8], this makes recognizing some properties of the associated\nmonoid and group easy. In our current context, in order to address point (i) above, we are\ninterested in connecting the existence of common multiples and termination of reversing.\nWhen the completeness condition is satisfied, this is easy.\nLemma 4.3. Assume that (S ; R) is a positive presentation that is complete for rightreversing. Then, for all g, h in hS | Ri+ , the following are equivalent:\n(i) The elements g and h admit a common right-multiple;\n(ii) For some S-words u, v representing g and h, the reversing of u−1 v is terminating;\n(iii) For all S-words u, v representing g and h, the reversing of u−1 v is terminating.\nProof. Assume that g and h admit a common right-multiple f . By definition, there exist\ng ′ , h′ satisfying f = gh′ = hg ′ . Let u, v, u′ , v ′ be arbitrary S-words representing g, h, g ′ ,\n′\n′ −1\n(vu′ ) yR ε, i.e., v ′−1 u−1 vu′ yR ε since\nand h′ . Then we have uv ′ ≡+\nR vu , whence (uv )\n(S ; R) is complete for right-reversing. Applying Lemma 3.5 twice, we split the reversing\ndiagram of (uv ′ )−1 (vu′ ) into four diagrams:\nv\n\nu′\n\nu\n\nyR\n\nyR\n\nv′\n\nyR\n\nyR\n.\n\nEach of the four diagrams above necessarily corresponds to a terminating reversing and, in\nparticular, the reversing of u−1 v must terminate. So (i) implies (iii).\nOn the other hand, it is obvious that (iii) implies (ii). Finally, by Lemma 3.4, any relation\nu−1 v yR v ′ u′−1 implies that the element of hS | Ri+ both represented by uv ′ and vu′ is a\ncommon right-multiple of the elements represented by u and v, so (ii) implies (i).\n\u0003\nOwing to Lemmas 3.6 and 4.3, we are led to wondering whether a presentation consisting\nof triangular relations is necessarily complete for right-reversing. A priori, the question may\nseem hopeless as the only method known so far for establishing that a presentation (S ; R)\nis complete for right-reversing [6, 7] consists in establishing a certain combinatorial condition (the \"cube condition\") using an induction that is possible only when the associated\nmonoid M satisfies some Noetherianity condition, namely that, for every g in M ,\n(4.2)\n\nthere is no infinite sequence g0 , g1 , ... satisfying g0 ≺ g1 ≺ g2 ≺ *** 4 g,\n\nwhere g ≺ h means g 4 h with g 6= h. Now, (4.2) turns out to fail whenever R contains a\nrelation of the form s = ...s..., hence in most of the cases we are interested in. However, righttriangular presentations turn out to be eligible for an alternative completeness argument.\nProposition 4.4. For every right-triangular presentation (S ; R), the associated presentab is complete for right-reversing.\ntion (S, R)\n\nThe proof will be split into several steps. Until the end of the proof, we assume that\n(S ; R) is a fixed right-triangular presentation, with associated functions N and C. We\n\n\fMONOIDS OF O-TYPE, SUBWORD REVERSING, AND ORDERED GROUPS\n\n11\n\nrecall that this means that R consists of the relations N (s) = sC(s) with s in S. We recall\nalso that C i (s) stands for C(s)C(N (s))***C(N i−1 (s)) whenever N i (s) is defined.\nBy definition, if u, v are S-words, then u ≡+\nR v holds, i.e., u and v represent the same\nelement in hS | Ri+ , if and only if there exists an R-derivation from u to v, i.e., a sequence\nw0 = u, w1 , ..., wn = v such that each word wk is obtained from wk−1 by applying exactly\n+(n)\none relation of R. We write u ≡R v when there exists a length n derivation from u to v.\nDefinition 4.5. Assume that w is a nonempty S-word. We denote by I(w) the initial\nletter of w, and by T (w) (like \"tail\") the subword satisfying w = I(w)T (w). We say that\na letter s of S underlies w if I(w) = N i (s) holds for some i > 0. In this case, we put\nEs (w) = sC i (s)T (w); otherwise, we put Es (w) = w.\ni\nA straightforward induction on i gives N i (s) ≡+\nR sC (s) whenever defined, and we deduce\ni\nw = N i (s)T (w) ≡+\nsC\n(s)T\n(w)\n=\nE\n(w)\nwhenever\nI(w)\n= N i (s) holds.\ns\nR\nWe begin with a direct consequence of the definition of a right-triangular presentation.\n\nLemma 4.6. Assume that (w0 , ..., wn ) is a sequence of S-words such that, for every k, some\nletter of S underlies wk and wk+1 . Then some letter underlies all of w0 , ..., wn .\nProof. We use induction on n. The result is obvious for n 6 1. Assume n > 2. By induction\nhypothesis, there exists s underlying w0 and w1 , and s′ underlying w1 , ..., wn . So there\nexist i, j such that I(w1 ) is both N i (s) and N j (s′ ). Assume first i 6 j. The injectivity of\nthe map N implies s = N j−i (s′ ). Hence s′ underlies w0 as well, and, therefore, s′ underlies\nall of w0 , ..., wn . The argument is similar in the case i > j, with now s′ = N i−j (s′ ) and s\nunderlying all of w0 , ..., wn .\n\u0003\n+(1)\n\nv. Then there\nLemma 4.7. Assume that u, v are nonempty S-words satisfying u ≡R\n+(61)\nexists s underlying u and v and, for every s in S, we have Es (u) ≡R\nEs (v). Moreover,\nexactly one of the following holds:\n+(1)\n(i) we have I(u) = I(v) and T (u) ≡R T (v);\n(ii) we have I(u) 6= I(v) and Es (u) = Es (v) for all s underlying u and v.\n+(1)\n\nProof. The assumption that u ≡R v holds means that there exist a number p > 1 and\na relation of R such that v is obtained from u by applying that relation to its subword\nstarting at position p. Assume first p > 2. In this case, the initial letter is not changed, i.e.,\nwe have I(u) = I(v), whereas T (v) is obtained from T (u) by applying a relation of R at\n+(1)\nposition p − 1, and T (u) ≡R T (v) holds. Next, underlying a word w depends on the initial\nletter of w only, hence, as u and v have the same initial letter, the letters underlying u\nand v coincide. Finally, let s belong to S. Assume first that I(u), which is also I(v),\nis N i (s). Then, by definition, we have Es (u) = sC i (s)T (u) and Es (v) = sC i (s)T (v), so that\n+(1)\n+(1)\nT (u) ≡R T (v) implies Es (u) ≡R Es (v). Otherwise, we have Es (u) = u and Es (v) = v,\n+(1)\n+(1)\nwhence Es (u) ≡R Es (v) again. Hence Es (u) ≡R Es (v) holds for every s in this case.\nAssume now p = 1. This means that there exists s and w satisfying u = sC(s)w and\nv = N (s)w, or vice versa. In this case, we have I(u) = s 6= N (s) = I(v) and, by definition, s\nunderlies both u and v. Now, assume that s′ is any element of S that underlies u. This means\nthat we have I(u) = s = N i (s′ ) for some i > 0, and we then have I(v) = N (s) = N i+1 (s′ ),\nso s′ underlies v as well. Then we find\nEs′ (u) = s′ C i (s′ )T (u) = s′ C i (s′ )C(s)w = s′ C i+1 (s′ )w = Es′ (v).\nOn the other hand, assume that s′ is an element of S that does not underlie u. Then\nwe have Es′ (u) = u. If s′ underlies v, owing to the fact that I(v) is N (I(u)) and N is\ninjective, the only possibility is s′ = N (s) and, in this case, we have Es′ (v) = v. If s′ does\n\n\f12\n\nPATRICK DEHORNOY\n\nnot underlie v, by definition we have Es′ (v) = v as well. So, in every such case, we find\n+(1)\nEs′ (u) = u ≡R v = Es′ (v).\nThe case u = N (s)w, v = sC(s)w is of course similar. Then the proof is complete since\n+(61)\nthe relation Es (u) ≡R\nEs (v) has been established for every s in every case.\n\u0003\n+(n)\n\nLemma 4.8. Assume that u, v are nonempty S-words satisfying u ≡R\nv. Then at least\none of the following holds:\n+(n)\n- we have I(u) = I(v) and T (u) ≡R T (v);\n+(<n)\nEs (v).\n- there exists s underlying u and v and satisfying Es (u) ≡R\nProof. Let (w0 , ..., wn ) be an R-derivation from u to v. Two cases are possible. Assume first\nthat the initial letter never changes in the considered derivation, i.e., I(wk ) = I(u) holds for\nevery k. Then all one step derivations (wk , wk+1 ) correspond to case (i) in Lemma 4.7. The\n+(1)\nlatter implies I(wk ) = I(wk+1 ) and T (wk ) ≡R T (wk+1 ) for every k, whence I(u) = I(v)\n+(n)\nand T (u) ≡R T (v).\nAssume now that the initial letter changes at least once in (w0 , ..., wn ), say I(wi ) 6= I(wi+1 ).\nFirst, Lemma 4.7 together with Lemma 4.6 implies the existence of s in S that underlies wk\nfor every k. Next, each one step derivation (wi , wi+1 ) corresponds to case (ii) in Lemma 4.7.\nSo, as s underlies wi and wi+1 , we have Es (wi ) = Es (wi+1 ). On the other hand, by\n+(61)\nEs (wk+1 ) for k 6= i, so, summing up, we obtain\nLemma 4.7 again, we have Es (wk ) ≡R\n+(<n)\nEs (u) ≡R\nEs (v) for this particular choice of s.\n\u0003\nb is complete\nWe can now complete the argument establishing that the presentation (S, R)\nfor right-reversing. We denote by |w| the length (number of letters) of a word w.\n\nProof of Proposition 4.4. We show using induction on n > 0 and, for a given value of n, on\n+(n)\nmax(|u|, |v|), that u ≡R v implies u−1 v yRb ε.\nAssume first n = 0. Then the assumption implies u = v, in which case u−1 v reverses to\nthe empty word by |u| successive deletions of subwords s−1 s.\nAssume now n > 1. Then u and v must be nonempty. Assume first that I(u) = I(v) and\n+(n)\nT (u) ≡R T (v) hold. By definition, we have\nmax(|T (u)|, |T (v)|) = max(|u|, |v|) − 1,\nso the induction hypothesis implies T (u)−1 T (v) yRb ε. On the other hand, as I(u) and I(v)\nare equal, we have\n(1)\n\nu−1 v = T (u)−1 I(u)−1 I(v)T (v) yRb T (u)−1 T (v).\nBy transitivity of reversing, we deduce u−1 v yRb ε.\n+(n)\nT (v) do not hold. Then, by Lemma 4.8,\nAssume now that I(u) = I(v) and T (u) ≡R\n+(n′ )\nEs (v) holds for some n′ < n.\nthere must exist s such that s underlies u and v and Es (u) ≡R\n−1\nThen the induction hypothesis implies Es (u) Es (v) yRb ε. Write sk for N k (s). As s underlies u and v, there exist i, j satisfying I(u) = si and I(v) = sj . Assume for instance i 6 j.\nBy definition, we have Es (u) = sC i (s)T (u) and Es (v) = sC j (s)T (v) = sC i (s)C j−i (si )T (v),\nso that, if l is the length of the word sC i (s), the first l steps in any reversing sequence\nstarting from Es (u)−1 Es (v) must be\nEs (u)−1 Es (v) = T (u)−1 C i (s)−1 s−1 sC i (s)C j−i (si )T (v)\n(l)\nR\n\nyb T (u)−1 C j−i (si )T (v).\n\n\fMONOIDS OF O-TYPE, SUBWORD REVERSING, AND ORDERED GROUPS\n\n13\n\nIt follows that the relation Es (u)−1 Es (v) yRb ε deduced above from the induction hypothesis\nimplies\n(4.3)\n\nT (u)−1 C j−i (si )T (v) yRb ε.\n\nb\nNow, let us consider the R-reversing\nof u−1 v, i.e., of T (u)−1 s−1\ni sj T (v). By definition, the\nb\nonly relation of R of the form si ... = sj ... is si C j−i (si ) = sj , so the first step in the reversing\n−1 j−i\nmust be T (u)−1 s−1\nC (si )T (v). Concatenating this with (4.3), we\nb T (u)\ni sj T (v) yR\n−1\ndeduce u v yRb ε again, which completes the induction.\n\u0003\nWith the above completeness at hand, we are now ready for assembling pieces and establishing the Main Lemma (Proposition 2.6).\nProof of the Main Lemma. Put M = hS | Ri+ . If M is of right-O-type, any two elements\nof M are comparable with respect to left-divisibility, hence they certainly admit a common\nright-multiple, namely the larger of them. So (i) trivially implies (ii).\nConversely, assume that any two elements of M admit a common right-multiple. First,\nas M admits a right-triangular presentation, hence a positive presentation, 1 is the only\ninvertible element in M .\nNext, M must be left-cancellative. Indeed, the point is to prove that, if s belongs to S\n+\nand u, v are S-words satisfying su ≡+\nR sv, then u ≡R v holds. By Proposition 4.4, the\nb is complete for right-reversing. Hence su ≡+ sv implies (su)−1 (sv) yb ε,\npresentation (S, R)\nR\nR\n−1 −1\ni.e., u s sv yRb ε. Now, the first step in any reversing sequence from u−1 s−1 sv is\nu−1 s−1 sv yRb u−1 v, so the assumption implies u−1 v yRb ε, whence u ≡+\nR v.\nb is\nFinally, let g, h be two elements of M . Hence, by Lemma 4.3, which is relevant as (S, R)\ncomplete for right-reversing, there exist S-words u, v representing g and h and such that the\nb\nR-reversing\nof u−1 v is terminating, i.e., there exist S-words u′ , v ′ satisfying u−1 v yRb v ′ u′−1 .\nb consists of triangular relations so, by Lemma 3.6, at least one\nBy construction, the family R\n′ ′\nof the words u , v is empty. This means that at least one of g 4 h or h 4 g holds in M , i.e.,\ng and h are comparable with respect to left-divisibility. So M is a monoid of right-O-type,\nand (ii) implies (i).\n\u0003\nTo conclude this section, we observe in view of future examples that the triangular presentations defining monoids admitting common right-multiples must be of some simple type.\nLemma 4.9. Assume that (S ; R) is a right-triangular presentation defining a monoid in\nwhich any two elements admit a common right-multiple. Then there exists a (finite or infinite) interval I of Z such that S is {ai | i ∈ I} and R consists of one relation ai−1 = ai C(ai )\nfor each non-minimal i in I.\nProof. Let s, s′ belong to S. As s and s′ admit a common right-multiple, Lemma 4.3 implies\nb\nb contains at least\nthat the R-reversing\nof s−1 s′ terminates, which in turn requires that R\n′\none relation of the form s... = s ... . Hence the left-graph of (S ; R) consists of a unique\nchain, which, by definition of a right-triangular presentation, means that (S ; R) has the\nform stated in the lemma.\n\u0003\n5. Existence of common multiples\nOwing to the Main Lemma (Proposition 2.6), the point for establishing that a monoid\nspecified by a right-triangular presentation is of right-O-type is to prove that any two elements admit a common right-multiple. We now establish several sufficient conditions in this\ndirection.\n\n\f14\n\nPATRICK DEHORNOY\n\nTop words and ceiling. The first criterion deals with the existence of what will be called\ntop words. We recall that, for w a word, |w| denotes the length of w.\nDefinition 5.1. Assume that M is a monoid generated by a set S. An S-word w is called\na right-top word in M if g 4 [w]+ holds for every g in S |w| . A right-S-ceiling for M is a\nleft-infinite S-word ...s2 s1 such that, for every n, the word sn ***s1 is a right-top S-word.\nThe criterion we obtain is as follows.\nProposition 5.2. Assume that M is a monoid that admits a triangular presentation based\non a finite set S. Then the following are equivalent:\n(i) The monoid M is of right-O-type;\n(ii) The monoid M admits a right-S-ceiling;\n(iii) There exist s1 , s2 , ... in S satisfying\n(5.1)\n\n∀n ∀s∈S (s sn−1 ***s1 4 sn sn−1 ***s1 );\n\n(iv) The monoid M admits right-top S-words of unbounded length.\nWe naturally say that a presentation is based on S if it has the form (S ; R) for some R.\nBefore proving Proposition 5.2, we begin with easy preliminary observations about top words\nand ceilings.\nLemma 5.3. Assume that M is a left-cancellative monoid generated by a set S.\n(i) If w is a right-top S-word in M , then g 4 [w]+ holds for every g in S 6|w| .\n(ii) A final fragment of a right-top word is a right-top word.\n(iii) A left-infinite S-word ...s2 s1 is a right-S-ceiling in M if and only (5.1) is satisfied.\nProof. (i) Assume that w is a right-top word and we have g ∈ S n with n 6 |w|. Let s be\nan arbitrary element of S. Then gs|w|−n belongs to S |w| , and we have g 4 gs|w|−n 4 [w]+ ,\nwhence g 4 [w]+ .\n(ii) Assume that w is a right-top word and v is a final fragment of w, say w = uv. Let\nh belong to S |v| . By construction, [u]+ h belongs to S |w| , so [u]+ h 4 [w]+ holds. As M is\nleft-cancellative and [w]+ = [u]+ [v]+ holds, we deduce h 4 [v]+ , so v is a right-top word.\n(iii) Assume that ...s2 s1 is a right-S-ceiling in M . Then, for all n and s in S, the element\nssn−1 ***s1 belongs to S n hence, by definition, ssn−1 ***s1 4 sn sn−1 ***s1 holds, whence (5.1).\nConversely, assume that s1 , s2 , ... satisfy (5.1). We prove using induction on n that g ∈ S n\nimplies g 4 sn ***s1 . For n = 1, (5.1) directly gives s 4 s1 for every s in S. Assume n > 2\nand g ∈ S n . Write g = sh with s ∈ S and h ∈ S n−1 . The induction hypothesis gives\nh 4 sn−1 ***s1 , and then (5.1) implies g = sh 4 ssn−1 ***s1 4 sn sn−1 ***s1 .\n\u0003\nLemma 5.4. Assume that M is a cancellative monoid with no nontrivial invertible element,\nand S generates M . Then, for every l, there exists at most one right-top S-word of length l,\nand there exists at most one right-S-ceiling in M ; when the latter exists, every right-top\nword is a final fragment of it.\nProof. First, if w, w′ are right-top S-words of the same length, then, by definition, we have\n[w]+ 4 [w′ ]+ and [w′ ]+ 4 [w]+ , whence [w]+ = [w′ ]+ owing to the assumption that there is\nno nontrivial invertible element in M .\nNow, we prove the uniqueness of a right-top word of length l using induction on l. For\nl = 0, the empty word is the unique word of length l. For l = 1, if s and s′ are distinct\nelements of S, then [s]+ = [s′ ]+ is impossible by hypothesis. Assume now that w, w′ are\nright-top words of length l with l > 2. Write w = sv, w′ = s′ v ′ . By Lemma 5.3(ii), v and v ′\nare right-top words, so, by induction hypothesis, v = v ′ holds. By the above observation,\nwe have [w]+ = [w′ ]+ . Then the assumption that M is right-cancellative implies [s]+ = [s′ ]+ ,\nhence s = s′ , and, finally, w = w′ .\n\n\fMONOIDS OF O-TYPE, SUBWORD REVERSING, AND ORDERED GROUPS\n\n15\n\nNext, assume that W, W ′ are right-S-ceilings in M . Then, for every n, the length n final\nfragments of W and W ′ are right-top words of length n, and, therefore, by the above result,\nthey coincide. As this holds for every n, so do W and W ′ . By the same argument, if w is a\nlength n right-top word and W is a right-S-ceiling, then the length n final fragment of W\nis a right-top word, hence it coincides with w. So, w is a final fragment of W .\n\u0003\nProof of Proposition 5.2. First, (ii), (iii), and (iv) are equivalent. Indeed, the equivalence\nof (ii) and (iii) directly follows from Lemma 5.3(iii). Next, (ii) implies (iv) by definition.\nConversely, the assumption that M admits a triangular presentation implies that M is\ncancellative and admits no nontrivial invertible element. If M admits right-top S-words of\nunbounded length, then, by Lemma 5.4(i), there exists a well defined left-infinite word W\nsuch that the latter all are final fragments of W . Then W is a right-S-ceiling, and (iv)\nimplies (ii).\nAssume now that M is of right-O-type. By assumption, the relation 4 is a linear ordering\non M . Hence, as S is finite, we can inductively select elements s1 , s2 , ... in S such that\nsn (sn−1 ***s1 ) is the upper bound of the elements s (sn−1 ***s1 ) with s in S. Then (5.1) holds,\nand (i) implies (iii), hence (ii) and (iv).\nConversely, assume that M admits right-top words of unbounded length. Let g, h be\ntwo elements of M . As S generates M , there exist n, p such that g lies in S n and h lies\nin S p . Let w be a right-top word of length at least equal to n and p. By Lemma 5.3(i),\n[w]+ is a common right-multiple of g and h. So any two elements of M admit a common\nright-multiple and, therefore, by the Main Lemma (Proposition 2.6), M is of right-O-type.\nSo (iv) implies (i).\n\u0003\nNote that, in the above proof, the hypothesis that the monoid admits a triangular presentation is not used to establish the existence of the ceiling: in every cancellative monoid of\nright-O-type, hence in particular in every monoid of O-type, generated by a finite set, there\nexists a unique ceiling. However, for the converse direction (the one we are mainly interested\nin), the existence of a ceiling is sufficient to guarantee that 4 is a linear ordering only when\nthe Main Lemma is valid, hence, in practice, for monoids that admit a (right)-triangular\npresentation.\nDominating elements. The approach of Proposition 5.2 is concrete and makes experiments easy (see Section 7). However, it is in general not easy to prove the existence of a\nceiling explicitly, and it is often more convenient to use the following notion.\nDefinition 5.5. Assume that M is a monoid. For δ, g in M , we say that δ right-dominates g\nif we have\n(5.2)\n\n∀n>0 ( gδ n 4 δ n+1 )\n\nFor S ⊆ M , we say that δ right-dominates S if it right-dominates every element of S.\nNote that an element always dominates oneself. The counterpart of Proposition 5.2 is\nnow an implication, not an equivalence.\nProposition 5.6. Assume that M is a monoid that admits a right-triangular presentation\nbased on a set S, and there exists in M an element that right-dominates S. Then M is of\nright-O-type.\nThe result will directly follow from\nLemma 5.7. Assume that M is a monoid and δ is an element of M that right-dominates\nsome subset S of M . Then g 4 δ n holds for every n and every g in S n , and any two elements\nin the submonoid of M generated by S admit a common right-multiple. In particular, if S\ngenerates M , any two elements of M admit a common right-multiple.\n\n\f16\n\nPATRICK DEHORNOY\n\nProof. We prove using induction on n that g ∈ S n implies g 4 δ n . For n = 0, i.e., for\ng = 1, the property is obvious and, for n = 1, it is (5.2). Assume n > 2 and g ∈ S n . Write\ng = sh with s ∈ S and h ∈ S n−1 . By induction hypothesis, we have h 4 δ n−1 , whence\ng = sh 4 sδ n−1 , whence g 4 δ n by (5.2).\nNow, let M ′ be the submonoid of M generated by S, i.e., the union of {1} and all S n for\nn > 1. Let g, h belong to M ′ \\{1}. There exist n, p such that g belongs to S n and h belongs\nto S p . Then δ max(n,p) is a common right-multiple of f and g.\n\u0003\nProof of Proposition 5.6. By hypothesis, the set S generates M . So Lemma 5.7 implies that\nany two elements of M admit a common right-multiple, and the Main Lemma (Proposition 2.6 then implies that M is of right-O-type.\n\u0003\nWe add two observations. The first one says that, in order to establish that an element\ndominates another one, it can be enough to consider exponents lying in an arithmetic series.\nLemma 5.8. For δ, g in a monoid M , a necessary and sufficient condition for δ to rightdominate g is that there exist m > 1 satisfying\n(5.3)\n\n∀k>0 ( gδ km+m−1 4 δ km+1 ).\n\nProof. If δ right-dominates g, then, by definition, (5.3) holds with m = 1.\nConversely, assume (5.3). Let n be a nonnegative integer. Let k be maximal with km 6 n.\nThen we have n 6 km + m − 1, and (5.3) implies gδ n 4 gδ km+m−1 4 δ km+1 4 δ n+1 , so δ\nright-dominates s.\n\u0003\nThe second observation is a connection between ceiling and dominating element.\nLemma 5.9. Assume that M is a cancellative monoid that admits no nontrivial invertible\nelement and is generated by a set S. Then the following are equivalent:\n(i) The monoid M admits a right-S-ceiling that is periodic with period sl ***s1 ;\n(ii) The element sl ***s1 right-dominates S l in M .\nProof. Assume (i). Put δ = sl ***s1 . For all n and g in S l , the element gδ n belongs to S l(n+1) ,\nso, by definition, we have gδ n 4 sl(n+1) ***s1 = (sl ***s1 )n+1 = δ n+1 . So δ right-dominates S l ,\nand (i) implies (ii).\nConversely, assume that sl ***s1 right-dominates S l , and let g belong to S nl . As g belongs\nto (S l )n , Lemma 5.7 implies g 4 δ n , i.e., g 4 [(sl ***s1 )n ]+ . This shows that, for every n,\nthe S-word (sl ***s1 )n is a right-top word. By Proposition 5.2, we deduce that there exists a\nright-S-ceiling in M and, by Lemma 5.4(ii), that this sequence is ∞(sl ***s1 ).\n\u0003\nAn important special case of Lemma 5.9 is when some element s of S dominates S, i.e.,\nwhen the top generator of S dominates S. By Lemma 5.9, this is equivalent to the existence\nof a constant ceiling ∞s. We shall see in Sections 7 and 8 that this situation often occurs.\nHowever, there are also cases when the ceiling is not constant, corresponding to a dominating\nelement δ that belongs to S l for some l > 2. In that case, by Lemma 5.7, the condition\nthat δ dominates S, and not S l as in Lemma 5.9, is sufficient to establish the existence of\ncommon multiples.\nQuasi-central elements. Checking that an element is possibly dominating requires considering unbounded exponents. We consider now a notion that is stronger, but easier to\nestablish.\nDefinition 5.10. An element ∆ of a monoid M is called right-quasi-central if there exists\nan endomorphism φ of M such that, for every g in M , we have\n(5.4)\n\ng∆ = ∆φ(g).\n\n\fMONOIDS OF O-TYPE, SUBWORD REVERSING, AND ORDERED GROUPS\n\n17\n\nWhen φ is the identity, we recover the standard notion of a central element, i.e., one that\ncommutes with every element. Once again, we obtain a sufficient condition for a monoid to\nbe of right-O-type.\nProposition 5.11. Assume that M is a monoid that admits a right-triangular presentation based on a set S, and there exists in M a right-quasi-central element ∆ satisfying\n∀s∈S (s 4 ∆). Then M is of right-O-type.\nThe proof will relie on the following connection with dominating elements.\nLemma 5.12. Assume that M is a left-cancellative monoid generated by a set S and δ m is\nright-quasi-central in M . Then δ right-dominates every element g that satisfies gδ m−1 4 δ.\nProof. Put ∆ = δ m , and let φ be the (necessarily unique) endomorphism of M witnessing\nthat ∆ is right-quasi-central. First, (5.4) applied with g = ∆ gives δ∆ = δ m+1 = ∆φ(δ),\nwhence φ(δ) = δ since M is left-cancellative.\nNext, we claim that g 4 h implies φ(g) 4 φ(h). Indeed, by definition, g 4 h implies the\nexistence of h′ satisfying gh′ = h, whence φ(g)φ(h′ ) = φ(h) since φ is an endomorphism.\nThis shows that φ(g) 4 φ(h) is satisfied. So, in particular, and owing to the above equality,\ng 4 δ implies φ(g) 4 δ.\nNow assume gδ m−1 4 δ. Then, for every k, we find\ngδ km+m−1 = gδ m−1 ∆k = ∆k φk (gδ m−1 ) 4 ∆k φk (δ) = ∆k δ = δ km+1 ,\nand, by Lemma 5.8, we conclude that δ right-dominates g.\n\n\u0003\n\nProof of Proposition 5.11. Under the hypotheses, by Lemma 5.12, the element ∆ rightdominates S. Then Proposition 5.6 implies that M is of right-O-type.\n\u0003\nThe main interest of considering quasi-central elements here is that, due to the following\ncharacterization, establishing that an element is quasi-central is easy, involving in particular\nfinitely many verifications only.\nLemma 5.13. Assume that M is a left-cancellative monoid generated by a set S. Then,\nfor every ∆ in M , the following are equivalent:\n(i) The element ∆ is right-quasi-central and satisfies s 4 ∆ for every s in S,\n(ii) The relation ∀s∈S (s 4 ∆ 4 s∆) holds.\nProof. Assume (i) and let φ be the witnessing endomorphism. Let s belong to S. By\nassumption, s 4 ∆ is true. Let g be the element satisfying sg = ∆. Then (5.4) implies\ns∆ = ∆φ(s), whence s∆ = sgφ(s), and ∆ = gφ(s) since M is left-cancellative. We deduce\n∆ = sg 4 sgφ(s) = s∆, and (i) implies (ii).\nConversely, assume (ii). We shall define an endomorphism φ witnessing that ∆ is rightquasi-central in M . First, for s in S, we define φ(s) to be the unique element satisfying\n(5.5)\n\ns∆ = ∆φ(s),\n\nwhich exists since, by assumption, ∆ 4 s∆ holds. Now, assume that s1 , ..., sn , s′1 , ..., s′p\nbelong to S and s1 ***sn = s′1 ***s′p holds in M . By applying (5.5) repeatedly, we obtain\n∆φ(s1 )***φ(sn ) = s1 ***sn ∆ = s′1 ***s′p ∆ = ∆φ(s′1 )***φ(s′p ),\nwhence φ(s1 )***φ(sn ) = φ(s′1 )***φ(s′p ) since M is left-cancellative. It follows that, for every g\nin M \\{1}, we can define φ(g) to be the common value of φ(s1 )***φ(sn ) for all expressions\nof g as a product of elements of S. We complete with φ(1) = 1. Then, by construction, φ is\nan endomorphism of M and (5.4) is satisfied for every g in M .\n\u0003\nWe conclude the section with a connection between central element and ceiling.\n\n\f18\n\nPATRICK DEHORNOY\n\nLemma 5.14. Assume that M is a cancellative monoid of right-O-type, and that sl ***s1\nis a right-top S-word in M such that [sl ***s1 ]+ is central in M . Then we have si = s1 for\nevery i, and ∞s1 is the right-S-ceiling in M .\nProof. Let ∆ = sl ***s1 . First, we have g 4 ∆ for every g in S l . Then Lemma 5.12 implies\nthat ∆ right-dominates S l . Hence, by Lemma 5.9, the right-S-ceiling is periodic with\nperiod sl ***s1 . Now consider its length l + 1 final fragment s1 sl ***s1 . Then, in M , we have\ns1 sl ***s1 = sl ***s1 s1 , so s1 sl ***s1 and sl ***s1 s1 are two right-top S-words of length l + 1. By\nLemma 5.4, these words must coincide, which is possible only for s1 = ... = sl .\n\u0003\nThus the only situation when a right-top word can be central is when it is a power of the\ntop generator. Note that Lemma 5.14 says nothing about central elements that admit no\nexpression as a right-top word.\n6. Back to ordered groups\nIn Section 5, we established several sufficient conditions for a monoid to be of rightO-type. Returning to the context of ordered groups, we immediately deduce orderability\ne is the opposite\nconditions. We recall that, if (S ; R) is a positive group presentation, (S ; R)\npresentation (same generators, reversed relations).\n\nProposition 6.1. A sufficient condition for a group G to be orderable is that\nG admits a triangular presentation (S ; R) such that the monoids hS | Ri+\ne + are eligible for at least one of Propositions 5.2, 5.6, or 5.11.\nand hS | Ri\nIn this case, the subsemigroup of G generated by S is the positive cone of a left-invariant\nordering on G. If S is finite, this ordering is an isolated point in the space LO(G).\n\nProof. Whenever the monoid hS | Ri+ is eligible for one of the mentioned results, it is of\ne + is of right-O-type, hence hS | Ri+ is\nright-O-type. For a similar reason, the monoid hS | Ri\n+\nof left-O-type. Therefore, hS | Ri is of O-type, and then we apply Corollary 2.7.\n\u0003\n\nLet us now address the solvability of the decision problem for the ordering involved in\nProposition 6.1. We shall establish the correctness of Algorithm 6.2 below. The latter\nsimultaneously appeals to right-reversing as defined in Section 3 and to left-reversing y,\ne\nthe symmetric procedure that replaces s′ s−1 with v −1 v ′ such that vs′ = v ′ s is a relation.\nThe properties of left-reversing are of course symmetric to those of right-reversing: formally,\nusing w\ne for the mirror-image of w (same letters in reserved order), w y\ne R w′ is equivalent\n′\ne is the family of all relations u\nto w\ne yRe w\ne where, as usual, R\ne = ve for u = v in R. We\ne i (s) = C\ne i (s)s with i > 2\ndenote by R the family obtained by adding to R the relations N\nb If w is a signed S-word,\n(the left-completion of R, symmetric to the right-completion R).\nwe denote by [w] the element of the group hS | Ri represented by w.\nb\n\nAlgorithm 6.2 (decision problem of the ordering).\n• Data: A finite (or recursive) triangular presentation (S ; R);\n• Input: A signed S-word w;\n• Procedure:\nb\n- Right-R-reverse\nw into vu−1 with u, v in S ∗ ;\n- Left-R-reverse vu−1 into u′−1 v ′ with u′ , v ′ in S ∗ ;\n• Output:\n- For u′ 6= ε and v ′ = ε, return \" [w] < 1\";\n- For u′ = v ′ = ε, return \" [w] = 1\";\n- For u′ = ε and v ′ 6= ε, return \" [w] > 1\".\nb\n\nProposition 6.3. Under the hypotheses of Proposition 6.1, if (S ; R) is finite or recursive,\nAlgorithm 6.2 solves the decision problem for the ordering, and the word problem of G.\n\n\fMONOIDS OF O-TYPE, SUBWORD REVERSING, AND ORDERED GROUPS\n\n19\n\nProof. Put M = hS | Ri+ . First, as (S ; R) is finite or, at least, recursive, the relations yRb\nb\nand y\ne R are recursive, so Algorithm 6.2 is indeed effective. Next, as the presentation (S, R)\nis complete for right-reversing and, by Proposition 6.1, any two elements of the monoid M\nb\nadmit a common right-multiple, every right-R-reversing\nsequence is terminating: for every\nsigned S-word w, there exist positive S-words u, v satisfying w yRb uv −1 . Similarly, as (S, R)\nis complete for left-reversing and any two elements of M admit a common left-multiple,\nevery R-reversing sequence is terminating and, therefore, there exist positive S-words u′ , v ′\nsatisfying uv −1 y\ne R u′−1 v ′ . Hence Algorithm 6.2 always terminates. Moreover, by (the\ncounterpart of) Lemma 3.6, at least one of the words u′ , v ′ is empty.\nBy construction, w yRb uv −1 y\ne R u′−1 v ′ implies [w] = [u′−1 v ′ ] in hS | Ri. If u′ is nonempty\n′\nand v is empty, we deduce [w] = [u′−1 ] ∈ M −1 \\{1}, whence [w] < 1 for the ordering whose\npositive cone is M −1 \\{1}. If u′ and v ′ are empty, we deduce [w] = [ε] = 1. Finally, if u′ is\nempty and v ′ is nonempty, we obtain [w] = [v ′ ] ∈ M \\{1}, whence [w] > 1. So Algorithm 6.2\ndecides the relation <. As < is a strict linear ordering, the algorithm also solves the word\nproblem as [w] 6= 1 is equivalent to the disjunction of [w] < 1 and [w] > 1.\n\u0003\nb\n\nb\n\nb\n\nb\n\nb\n\nRemark 6.4. Algorithm 6.2 does not only give a YES/NO answer: for every initial signed\nS-word w, the method provides a positive S-word w′ such that w is equivalent either to w′ or\nor to w′−1 . In other words, it gives for every element g of the group hS | Ri an explicit positive\nor negative decomposition of g in terms of the distinguished generators of the positive cone.\nThe proof of Theorem 1 can now be completed. We state the results in a more general\nform that avoids unnecessary symmetries and corresponds to the case of dominating or quasicentral elements; a similar statement involving right-ceilings and (5.1) exists of course.\nTheorem 6.5. A sufficient condition for a group G to be orderable is that\nG admits a triangular presentation (S ; R) and, in the monoid hS | Ri+ , there\ne satisfying ∀s∈S (s 4 ∆ 4 s∆) or ∀s∈S ∀n (s∆n 4 ∆n+1 ), and\nexist ∆, ∆\ne <\ne<\ne n+1 <\ne n s).\ne∆\ne s) or ∀s∈S ∀n (∆\ne∆\n∀s∈S (∆s\nIn this case, the subsemigroup of G generated by S is the positive cone of a left-invariant\nordering on G. If S is finite, this ordering is isolated in the space LO(G). If (S ; R) is finite\nor recursive, the word problem of G and the decision problem of the ordering are decidable.\nProof. Owing to Lemmas 5.12 and 5.13, the element ∆ right-dominates S in hS | Ri+ , so\ne +,\ne right-dominates S in hS | Ri\nthe latter is eligible for Proposition 5.6. Symmetrically, ∆\n+\ne is eligible for Proposition 5.6 as well. Then the hypotheses of Propositions 6.1\nand hS | Ri\nand 6.3 are satisfied, and the latter give the results.\n\u0003\n\nWe add two more observations. The first one involves monoids that are of right-O-type\nbut not necessarily of O-type. In this case, the termination of left-reversing is not guaranteed,\nand the monoid need not be connected with a left-invariant ordering in the group. However,\nthe group is still a group of right-fractions for the monoid, and we can solve its word problem\nby appealing to right-reversing only.\nAlgorithm 6.6 (word problem).\n• Data: A finite (or recursive) right-triangular presentation (S ; R);\n• Input: A signed S-word w;\n• Procedure:\nb\n- Right-R-reverse\nw into vu−1 with u, v in S ∗ ;\nb\n- Right-R-reverse u−1 v into v ′ u′−1 with u′ , v ′ in S ∗ ;\n• Output:\n- For u′ = v ′ = ε, return \" [w] = 1\";\n- For u′ 6= ε or v ′ 6= ε, return \" [w] 6= 1\".\n\n\f20\n\nPATRICK DEHORNOY\n\nProposition 6.7. Assume that (S ; R) is a right-triangular presentation and there exists\nan element ∆ in hS | Ri+ satisfying ∀s∈S (s 4 ∆ 4 s∆) or ∀s∈S ∀n (s∆n 4 ∆n+1 ). Then\nAlgorithm 6.6 solves the word problem of the group hS | Ri.\nb is complete for right-reversing and, by\nProof. By Proposition 4.4, the presentation (S, R)\nProposition 6.1, any two elements of the monoid hS | Ri+ admit a common right-multiple,\nb\nhence every R-reversing\nsequence is terminating: for every signed S-word w, there exist\npositive S-words u, v satisfying w yRb uv −1 . Hence Algorithm 6.6, which consists of two\nconcatenated reversings, always terminates.\nThen, by construction, w yRb uv −1 implies [w] = [uv −1 ] in hS | Ri. Hence [w] = 1\nholds if and only if we have [uv −1 ] = 1, or, equivalently, [u] = [v]. By Ores's theorem,\nthe monoid hS | Ri+ embeds in the group hS | Ri, so the latter condition is equivalent to\nb\n[u]+ = [v]+ , i.e., to u ≡+\nR v. As (S, R) is complete for right-reversing, the latter condition is\n−1\nequivalent to u v yRb ε, i.e., with the notation of Algorithm 6.6, to u′ = v ′ = ε.\n\u0003\nThe second observation is a connection with Garside theory [9]. Say that an element ∆\nf.\nis left-quasi-central in a monoid M if it is right-quasi-central in the opposite monoid M\n\nProposition 6.8. Assume that M is a monoid of right-O-type and ∆ is right-quasi-central\n(resp. simultaneously right- and left-quasi-central) in M and its left-divisors generate M .\nThen ∆ is a right-Garside element (resp. a Garside element) in M in the sense of [9,\nDefinitions VI.1.36 and 2.29].\nProof. By assumption, the monoid M is left-cancellative and the left-divisors of ∆ generate M . As ∆ is right-quasi-central, every right-divisor of ∆ is left-divides ∆ since, as noted\nin the proof of Lemma 5.12, ∆ = g ′ g implies gφ(g ′ ) = ∆. Finally, for every g in M , the\nelements g and ∆ admit a greatest common left-divisor (left-gcd), namely the smaller of\nthem with respect to 4. Hence, by definition, ∆ is a right-Garside element in M .\nIf ∆ is also left-quasi-central, then, by symmetry, the left-divisors of ∆ must be included\nin its right-divisors, and, therefore, the left- and right-divisors of ∆ coincide. Then ∆ is a\nGarside element in M .\n\u0003\nIt follows that, under the hypotheses of Proposition 6.8, the left-divisors of ∆ in M\nform what is called a Garside family [9, Definition I.1.34] and every element of M admits\na distinguished decomposition in terms of these elements. However, as left-divisibility is\na linear ordering in this case, this decomposition is rather trivial: every element is leftdivisible by some maximal power of ∆, and the normal decompositions all have the simple\nform (∆, ..., ∆, g) with g 4 ∆.\n7. Experimental approach\nSubword reversing is easily implemented, allowing for computer experiments. Thus we can\nconsider arbitrary (right)-triangular presentations and investigate whether the associated\nmonoids are of (right)-O-type. Owing to Lemma 4.9, we consider presentations of form\n(7.1)\n\n(a1 , ..., an ; a1 = a2 C(a2 ), ..., an−1 = an C(an ))\n\nwhere C(a2 ), ..., C(an ) are words in the alphabet {a1 , ..., an }. Then the first natural step in\nthe investigation consists in (trying to) compute (a final fragment of) the right-ceiling, if it\nexists. The principle is as follows.\nLemma 7.1. Assume that (S ; R) is a presentation of the form (7.1). Starting from s1 = a1 ,\ninductively find sn in S so that, for every i,\nb\n(7.2)\n(ai sn−1 ***s1 )−1 (sn sn−1 ***s1 ) is R-reversible\nto a positive word.\nThen hS | Ri+ is of right-O-type if and only if the construction never stops.\n\n\fMONOIDS OF O-TYPE, SUBWORD REVERSING, AND ORDERED GROUPS\n\n21\n\nProof. By Lemma 3.6, and by completeness of the presentation (S ; R) for subword reversing,\nthe only possibilities, when a negative–positive word u−1 v is reversed are\n- either the reversing terminates in finitely many steps with a word that is either positive\nor negative, in which case [u]+ 4 [v]+ or [v]+ 4 [u]+ holds in hS | Ri+ ,\n- or the reversing never terminates, in which case [u]+ and [v]+ have no common rightmultiple in hS | Ri+ .\nSo, assuming that s1 , ..., sn−1 have been found, two cases may occur in the search of sn\nsatisfying (7.2):\n- either all reversings terminate in finitely many steps, sn is found, and the process\ncontinues; then (5.1) is satisfied, sn ***s1 is a right-top S-word, and, if this continues for\nevery n, then, by Proposition 5.2, hS | Ri+ is of right-O-type,\n- or some reversing does not terminate, and the process stops; then two elements ssn−1 ***s1\nand s′ sn−1 ***s1 admit no common right-multiple, and hS | Ri+ cannot be of right-O-type. \u0003\nNote that, for an alphabet S of size m, determining the final l + 1 letters in the rightceiling requires only l(n − 1) word reversings and, in particular, only l reversing are required\nin the case of two generators.\nAlthough easy, the previous step can lead to suspicions, and not to a proven conclusion:\non the positive side, one obtains a finite fragment of the ceiling, from which it is a priori\nimpossible to deduce the existence of the ceiling; symmetrically, on the negative side, a\nlong finite reversing sequence is not a proof of a non-terminating reversing. However, so\nfar, the suspicions provided by Lemma 7.1 never turned to be wrong: although ad hoc\nexamples could certainly be constructed, we know of no monoid containing a right-top word\nof length 20 that eventually turned to be not of O-type, and of no reversing sequence of\nlength 10, 000 that eventually turned to be terminating.\nNow, the good point is that, in some cases, proven conclusions can be obtained. Let us\nbegin with the negative case, i.e., establishing that a monoid is not of O-type. The following\nresult shows that some syntactic conditions a priori discard certain presentations.\nLemma 7.2. Assume that (S ; R) is a triangular presentation.\nb has the form s = w with |w| > 1 and w finishing with s, then hS | Ri+\n(i) If a relation of R\nis not right-cancellative and, therefore, hS | Ri+ is not of right-O-type.\nb has the form s = w with w beginning with (uv)r us with r > 1,\n(ii) If a relation of R\nu nonempty, and v such that v −1 s reverses to a word beginning with s, hence in particular if\nv is empty or it can be decomposed as u1 , ..., um where uk s is a prefix of w for every k, then\nthe elements s and [u]+ s have no common right-multiple in hS | Ri+ and, therefore, hS | Ri+\nis not of right-O-type.\nProof. (i) If R contains a relation s = us with u nonempty, s = [u]+ s holds in hS | Ri+ ,\nwhereas 1 = [u]+ fails. So hS | Ri+ is not right-cancellative.\nb\n(ii) We claim that the right-R-reversing\nof s−1 us cannot be terminating, see Figure 3.\nIndeed, writing the involved relation s = (uv)r usw1 with v −1 s yRb sw2 , we find\ns−1 us yRb w1−1 s−1 (vu)−(r−1) u−1 v −1 s\nyRb w1−1 s−1 (vu)−(r−1) u−1 sw2\nyRb w1−1 s−1 (vu)−(r−1) (vu)r−1 vusw1 w2\nyRb w1−1 s−1 vusw1 w2\nyRb w1−1 w2−1 * s−1 us * w1 w2 .\nWe deduce that s−1 us yRb (w1−1 w2−1 )n * s−1 us * (w1 w2 )n holds for every n and, therefore, it\nis impossible that s−1 us leads in finitely many steps to a positive–negative word. Then, by\n\n\f22\n\nPATRICK DEHORNOY\n\nb is complete for right-reversing,\nLemma 4.3, which is relevant since, by Proposition 4.4, (S, R)\ns and [u]+ s admit no common right-multiple in hS | Ri+ .\n\u0003\nu\n\ns\nv\nu (vu)r−1\n\ns\n\nw2\n\ns\nv\n\nu\n\n(vu)r−1\n\ns\n\ns\n\nw2\n\ns\n\nw1\n\nw1\nFigure 3. Proof of Lemma 7.2(ii): in a positive number of steps, the word s−1 us\nreverses to a word that includes it and, therefore, the reversing cannot be terminating.\n\nFor instance, a relation a = babab3a2 ... is impossible in a right-triangular presentation\nfor a monoid of right-O-type: indeed, the right-hand side of the relation can be written as\n(ba)bab2 (ba)a..., which is eligible for Lemma 7.2(ii) with u = ba and v = bab * b, a product\nof two words u1 , u2 such that ui a is a prefix of the right-hand term of the relation.\nSymmetrically, on the positive side, i.e., for establishing that a monoid is of right-O-type,\nthe existence of a quasi-central element is can be checked in finite time.\nLemma 7.3. Assume that (S ; R) is a presentation of the form (7.1), and w is an S-word\nbeginning with a1 and such that, for 2 6 i 6 n,\n(7.3)\n\nb\nw−1 ai w is R-reversible\nto a positive word.\n\nThen [w]+ is right-quasi-central in hS | Ri+ and the latter is a monoid of right-O-type.\nProof. That [w]+ is right-quasi-central in hS | Ri+ directly follows from Lemma 5.13, since\n(7.3) implies [w]+ 4 ai [w]+ . Moreover, by construction, we have an 4 *** 4 a1 4 [w]+ ,\nwhence ai 4 [w]+ for every i. Hence, by Proposition 5.11, hS | Ri+ is of right-O-type.\n\u0003\nThus, the generic program for investigating a right-triangular presentation (S ; R) is\n(i) check if (S ; R) is eligible for Lemma 7.2-in which case hS | Ri+ is not of right-O-type;\n(ii) if not, compute the right-ceiling using Lemma 7.1 with escape conditions on the length\nof the reversing sequences and of the ceiling;\n(iii) if some reversing in step (ii) seems to be non-terminating, try to extract a cyclic reversing\n(n)\npattern, i.e., finding an S-word u satisfying u yRb ...u... for some n > 0-in which case\nhS | Ri+ is not of right-O-type;\n(iv) otherwise try to find a right-quasi-central element-in which case hS | Ri+ is of right-Otype; if the ceiling seems to be periodic with period w, then [w]+ is a natural candidate.\nIt turns out that the above program works well, at least for presentations that are short\nenough. In the case of two generators, almost all presentations we tried are either discarded\nby Lemma 7.3 or contain a quasi-central element that is a power of the top generator.\nFact 7.4. Among the 1,023 presentations (a, b; a = bw) with w of length 6 9 in {a, b}∗,\n- 854 are eligible for Lemma 7.2, yielding a monoid not of right-O-type.\n- 3 lead to a cyclic reversing, yielding a monoid not of right-O-type.\n- 166 are eligible for Lemma 7.3, yielding a monoid of right-O-type (33 are of O-type).\n\n\fMONOIDS OF O-TYPE, SUBWORD REVERSING, AND ORDERED GROUPS\n\nright-O\n\nleft-O\n\na = bababab\na = ba2 babab\n\nYES\nYES\n\nYES\n\na = baba2 bab\na = ba3 babab\n\nNO\nYES\n\na = bab3 ab\na = ba2 baba2 b\n\nYES\nYES\n\nNO\nYES\nYES\n\na = ba2 b3 a2 b\n\nNO\n\nNO\n\na = ba2 bab2 a2 b\n\nYES\n\nNO\nNO\n\nNO\na = ba2 b4 a2 b\n\nNO\n\nNO\n\n23\n\n∆ = a2 central;\n∆ = a3 right-quasi-central, φ(a) = a, φ(b) = (babab)3\nf with u = (ab), v = ε\na = ...a(ab)(ab)(ab): Lemma 7.2\na = (ba)(ba)a...: Lemma 7.2 with u = ba and v = ε\n∆ = a4 right-quasi-central, φ(a) = a, φ(b) = b(ab)8\nf with u = (ab) and v = ε\na = ...a(ab)(ab): Lemma 7.2\n∆ = (ab)3 = (ba)3 central\n∆ = (a2 b)2 = (ba2 )2 right- and left-quasi-central,\ne\ne\nφ(a) = a(ba2 b)2 , φ(a)\n= (ba2 b)2 a, φ(b) = φ(b)\n=b\nnon-terminating right-reversing: u y(10) v−1 uv\nfor u = a−2 ba2 ba and v = ba2 b3\n2\n∆ = (a b)2 right-quasi-central, φ(a) = (ab2 a)2 ab, φ(b) = (ba2 b2 )2\nnon-terminating left-reversing: u y\ne (26) vuv−1\nfor u = a2 b2 a2 bab3 a2 ba−1 and v = b\nnon-terminating right-reversing: u y(12) v−1 uv\nfor u = b−1 a−2 ba2 ba and v = b4 a2 bab4 a2 b\n\nTable 2. Examples of two-generator monoids with a triangular presentation: in\nall cases that are not a priori discarded by Lemma 7.2 or its symmetric counterf \" , one can either find a (quasi)-central element or identify a nonpart \"Lemma 7.2\nterminating reversing, hence decide whether the associated monoid is of right- or\nleft-O-type.\n\nSee Table 2 for some typical examples. Results are entirely similar in the case of three\ngenerators or more. Again, most of the cases that are not discarded by Lemma 7.2 or its\ncounterpart turn out to be eligible for Lemma 7.3, and the exceptions can be successfully\naddressed directly. It is probably useless to give more details here.\n8. Some families of monoids of O-type\nWe shall now describe five infinite families for which we can exhibit central, quasi-central,\nor dominating elements and which therefore are of right-O-type or of O-type. We begin with\nthe simplest case, namely when some power of the top generator is central or quasi-central.\nProposition 8.1. For p, q, r > 1, let M be the monoid defined by\n(8.1)\n\n(a, b ; a = b(ap br )q ).\n\n(i) The element ap+1 is right-quasi-central in M and M is of right-O-type.\n(ii) For r = 1, the element ap+1 is central in M and M is of O-type.\nProof. (i) Applying (8.1), we first find\na = b(ap br )q = b * a * (ap−1 br )(ap br )q−1 ,\nwhence, repeating the operation r times and moving the brackets,\na = br * a * ((ap−1 br )(ap br )q−1 )r = br (ap br )q * ((ap−1 br )(ap br )q−1 )r−1 .\nLet ∆ = ap+1 . Substituting the above value of a at the underlined position, moving the\nbrackets, and applying the relation once in the contracting direction, we find\nb * ∆ = bap a = bap * br (ap br )q * ((ap−1 br )(ap br )q−1 )r−1\n= b(ap br )q * ap br ((ap−1 br )(ap br )q−1 )r−1\n= a * ap * br ((ap−1 br )(ap br )q−1 )r−1 = ∆ * br ((ap−1 br )(ap br )q−1 )r−1 .\n\n\f24\n\nPATRICK DEHORNOY\n\nNow, we have b 4 a 4 ap+1 = ∆ in M . Next, as ∆ is a power of a, it commutes with a. So,\nby Lemma 5.13, ∆ is right-quasi-central in M , with associated endomorphism defined by\n(8.2)\n\nφ(a) = a,\n\nφ(b) = br ((ap−1 br )(ap br )q−1 )r−1 .\n\nBy Proposition 5.11, M is of right-O-type.\n(ii) Assume now r = 1. By (i), M is of right-O-type. Now (8.1) reduces here to\nf is of right-O-type,\na = b(ap b)q , which is symmetric. Hence, by (i), the opposite monoid M\nso M is of left-O-type, and, therefore, of O-type. Finally, by (8.2), the endomorphism φ is\nthe identity here, so that ∆ is central.\n\u0003\nBy Proposition 1.4, every monoid of O-type gives rise to an ordered group. The groups\noccurring in connection with the monoids of Proposition 8.1 are the torus knot groups.\nCorollary 8.2. For p, q > 1, let G be the torus knot group hx, y | xp+1 = yq+1 i. Then\nG is orderable, the subsemigroup of G generated by x and x−p y is the positive cone of a\nleft-invariant ordering on G which is isolated in LO(G).\nProof. In view of Propositions 1.4 and 8.1, it is sufficient to prove that (8.1) is a presentation\nof G in terms of the mentioned elements. Now, put a = x and b = x−p y in G. We find\nap+1 = b(ap b)q ap , whence a = b(ap b)q , so, if G′ is the group defined by the presentation (8.1),\nthere exists a well defined homomorphism Φ of G′ to G mapping a to a and b to b. Moreover Φ\nis surjective as a and b generate G. Conversely, put x = a and y = ap b in G′ . We obtain now\nxp+1 = aap = b(ap b)q b = (bap )q+1 = y q+1 , and there exists a surjective homomorphism Φ′\nof G to G′ mapping x to x and y to y. By construction, Φ′ ◦ Φ is the identity, so Φ is an\nisomorphism, and (8.1) is a presentation of G.\n\u0003\nRemark 8.3. Once noted that the group ha, b | a = b(ap b)q i is isomorphic to the group\nhx, y | xp+1 = yq+1 i, it is obvious that xp+1 , i.e., ap+1 , is central in the group. However,\nthis is not sufficient to deduce that ap+1 is central in the monoid ha, b | a = b(ap b)q i+ as\nthe latter is not a priori known to embed in the group. So, in order to apply the scheme\nof Theorem 6.5, it is crucial to make all verifications inside the monoid, i.e., without using\ninverses except possibly those provided by cancellativity.\nFor p = q = 1, the group G of Corollary 8.2 is the Klein bottle group ha, b | a = babi. For\np = 2 and q = 1, the group G, i.e., ha, b | a = ba2 bi, is Artin's braid group B3 . In terms of\nthe standard Artin generators σi , the elements a and b can be realized as σ1 σ2 and σ2−1 , and\nthe associated ordering is the isolated ordering described by Dubrovina–Dubrovin in [12] (see\nalso [18]). The braid group B3 is also obtained for p = 1 and q = 2, i.e., for ha, b | a = bababi,\nwith a and b now realizable as σ1 σ2 σ1 and σ2−1 . Note that, when realized as above, the\nassociated submonoids of B3 coincide as, using a in the case p = 2, q = 1 and a′ in the\ncase p = 1, q = 2, we find a = a′ b and a′ = ba2 . Therefore the associated (isolated)\norderings of B3 coincide.\nFor r > 2, the monoid M of Proposition 8.1 embeds in a group of right-fractions G.\nf implies that a and ab have no\nHowever, the left counterpart of Lemma 7.2 (\"Lemma 7.2\")\ncommon left-multiple in M . Hence M is not of left-O-type, and the group G is not a group\nof left-fractions for M : the right-fraction aba−1 is an element of G that cannot be expressed\nas a left-fraction. As a consequence, the semigroup M \\{1} defines a partial left-invariant\nordering on G only: for instance, the elements b−1 a−1 and a−1 are not comparable as their\nquotient aba−1 belongs neither to M nor to M −1 . Note that, for p = q = 1, the group G,\ni.e., ha, b | a = babr+1 i, is the Baumslag–Solitar group BS(r + 1, −1), whereas the opposite\ngroup ha, b | a = br+1 abi is BS(−1, q + 1). Besides these examples, the case p = r = 2, q = 1,\ni.e., ha, b | a = ba2 b2 i, is the first non-classical example in the family. In this case, a3 is a\nright-quasi-central element that is not central, and the associated endomorphism is given by\nφ(a) = a and φ(b) = b2 ab2 .\n\n\fMONOIDS OF O-TYPE, SUBWORD REVERSING, AND ORDERED GROUPS\n\n25\n\nWe now describe a family involving an arbitrarily large family of generators.\nProposition 8.4. Assume l > 2 and m2 , n2 , m3 , n3 , ..., ml , nl > 1. Let M the be monoid\ndefined by\n(a1 , ..., al ; a1 = a2 w2n2 , ..., al−1 = al wlnl ),\n\n(8.3)\n\nmi\n***w2m3 w1m2 ai . Then M is of O-type.\nwith w1 = a1 and wi inductively defined by wi = wi−1\n\nProof. First, the presentation (8.3) is triangular (and symmetric). Now put gi = [wi ]+ in M .\nFor i > 2, we obtain\nm\n\nmi\nmi\nmi +1\ni−1\n***g1m2 ai−1 ,\ngi−2\n* gi−1 = gi−1\n= gi−1\ngi−1\nmi\n***g1m2 ai * gini .\ngini +1 = gi * gini = gi−1\n\nThe relations of (8.3) are valid in M , so, in particular, we have ai−1 = ai * gini . It follows\nmi +1\nthat gi−1\n= gini +1 holds for i = 2, ..., l.\nPut ∆ = am\n1 where m is such that m(n2 + 1)***(ni + 1) is a multiple of (m2 + 1)***(mi + 1)\nfor each i-which, for instance, is the case if m is a common multiple of m2 + 1, ..., ml + 1-\nsay m(n2 + 1)***(ni + 1) = ei (m2 + 1)***(mi + 1). Then, for every i, we have ∆ = giei , and,\ntherefore, ∆ commutes with every gi . Then an induction on i shows that ∆ commutes with\nevery ai : for i = 1, the result is obvious as ∆ is a power of a1 , for i > 1, we have ai−1 = ai gi ,\nwhence, using the induction hypothesis,\n∆ai gi = ∆ai−1 = ai−1 ∆ = ai−1 gi ∆ = ai ∆gi ,\nand ∆ai = ai ∆ by right-cancelling gi , which is legitimate as M , which admits a lefttriangular presentation, must be right-cancellative. As a1 , ..., al generate M , the element ∆\nis central in M , and, by Proposition 5.11, M is of O-type.\n\u0003\nThe corresponding groups turn out to be amalgamated products of torus knot groups.\nCorollary 8.5. For l > 2 and m2 , n2 , m3 , n3 , ..., ml , nl > 1, let G be a group\n(8.4)\n\nml +1\n2 +1\n3 +1\n(x1 , x2 , ..., xl ; xm\n= x2n2 +1 , xm\n= x3n3 +1 , ..., xl−1\n= xnl l +1 ).\n1\n2\n\n2\n2\ni\nThen G is orderable, the subsemigroup of G generated by x1 , x−m\nx2 , ..., x−m\n***x−m\n1\n1\ni−1 xi is\nthe positive cone of a left-invariant ordering on G which is isolated in LO(G).\n\nProof. We just have to show that G admits the presentation (8.3) with respect to the\n2\ni\nspecified generators. Now, in G, put a1 = x1 and, inductively, ai = x−m\n***x−m\n1\ni−1 xi . An\nimmediate induction gives xi = [wi ] for each i, where [wi ] means the evaluation of the\nword wi when the letter ai is given the value ai . Then (as above) we obtain\nm2\nmi +1\nm2\nni\ni\ni\nxm\n= xni i +1 = xm\ni1 ***x1 ai−1 = xi−1\ni1 ***x1 ai xi ,\n\nwhence ai−1 = ai [wi ]ni . This shows that the relations of (8.3) are satisfied by a1 , ..., al in G,\nyielding an homomorphism Φ of the group G′ presented by (8.3) to G that maps ai to ai .\nConversely, in G′ , define x1 to be a1 and xi to be [wi ] for i > 2. Then the same\ni +1\ncomputation as above in the monoid M shows that xm\n= xini +1 holds for every i in G′ ,\ni−1\n′\nleading to an homomorphism of G to G that is the inverse of Φ. So G admits (8.3) as a\npresentation.\n\u0003\nExample 8.6. Assume m2 = n2 = *** = ml = nl = p. Then G admits the presentation\n(x1 , ..., xl ; xp+1\n= xp+1\n= *** = xp+1\n), and the result applies with ∆ = xp+1\n. The positive\n1\n2\n1\nl\ncone of the associated isolated ordering is defined by the presentation (8.3), whose relations,\nin the current case, take the form (as usual, we write a, b, ... for a1 , a2 , ...)\na = b(ap b)p ,\n\nb = c((ap b)p ap c)p ,\n\nc = d(((ap b)p ap c)p (ap b)p ap d)p , etc.\n\nSee Table 1 (row 2) for other particular cases.\n\n\f26\n\nPATRICK DEHORNOY\n\nWe now turn to a family of a different type, where the verification of the O-type relies not\non the existence of a quasi-central element as in the previous examples, but on the existence\nof a dominating element-hence an infinitary condition.\nProposition 8.7. For p, q, r, s > 0, let M be the monoid defined by\n(a, b, c ; a = b(ap b)q , b = c(ar c)s ),\n\n(8.5)\n\nFor r > p or q = 0, the element a dominates a, b, c in M , and M is of O-type; for r < p\nwith q > 1, it is not.\nProof. As a preliminary remark, we note that the case q = 0 is trivial, as (8.5) then reduces\nto a = b and M is isomorphic to ha, b | a = b(ar b)s i+ , in which, by Proposition 8.1, ar+1 is\ncentral, hence it right-dominates a, b, c by Lemma 5.12, and M is of O-type. So, from now\non, we assume q > 1.\nb\nAssume first p < r. Then the relation a = c(ar c)s (ap b)q belongs to the completion R\nof the presentation, and it can be written as a = (car )s+1 a.... Hence, by Lemma 7.2 with\nu = car , the monoid M cannot be of O-type.\nFrom now on, we assume r > p. As a preliminary remark, we compute\n(8.6)\n\nap+1 * b = aap b = (b(ap b)q )ap b = b(ap b)q+1 = bap (b(ap b)q ) = bap a = b * ap+1 ,\n\nwhich shows that ap+1 commutes with a and b. Moreover, as bap 4 a holds, applying\nLemma 5.12 in the submonoid of M generated by a and b shows that a right-dominates b.\nNext, let us write r = m + p′ with p + 1 | m and 0 6 p′ 6 p. Then am is a power of ap+1 ,\nhence it commutes with a and b. From here, we separate two cases.\nAssume first that p + 1 does not divide r + 1, i.e., p′ < p holds. Put c′ = cap , and let M ′\nbe the submonoid of M generated by a, b, and c′ . Let ∆ = am . We shall prove that ∆ is\nright-quasi-central in M ′ . First, we can write a * am−1 = ∆ and ∆ * a = a∆ both in M and\nin M ′ , so a 4 ∆ 4 a∆ holds in M ′ as it does in M . Next, we have b * (ap b)q am−1 = ∆ and\n∆ * b = b∆ in M and M ′ , so b 4 ∆ 4 b∆ holds in M ′ . It remains to treat c′ . One the one\nhand, starting from a = c(ar c)s (ap b)q , which we re-arrange into a = c′ * (ar−p c′ )s (bap )q−1 b\nby moving brackets, we see that c′ 4 a holds in M ′ , whence a fortiori c′ 4 ∆. On the other\nhand, in M , we find\n(8.7)\n\n′\n\nc′ * ∆ = car * a * ap−p −1\n\nby r = m + p′ with p′ < p\n′\n\n= car * b(ap b)q * ap−p −1\nr\n\nr\n\ns\n\np\n\nq\n\nby (8.5) for a\n\n= ca * c(a c) * (a b) * a\n\np−p′ −1\n\nby (8.5) for b\n′\n\n= c(ar c)s * ar c * ap * (bap )q−1 bap−p −1\nr\n\np\n\np q−1\n\n= b * a * ca * (ba )\n\nba\n\np−p′ −1\n\n′\n\n′\n\n= b * ∆ * ap * c′ * (bap )q−1 bap−p −1\n′\n\n′\n\n= ∆ * bap * c′ * (bap )q−1 bap−p −1\n\nby moving brackets\nby (8.5) for b\nby r = m + p′\nby (8.6),\n\nwhich shows that ∆ 4 c′ ∆ holds in M ′ . Being a submonoid of a cancellative monoid, the\nmonoid M ′ is cancellative, so, by Lemma 5.12, ∆, i.e., am , is right-quasi-central in M ′ .\nMoreover, in M , we have a = cap * (ar−p cap )s (bap )q−1 b, which we can re-arrange as\na = cap (ar−p cap )s (bap )q−1 b, i.e., a = c′ (ar−p c′ )s (bap )q−1 b, a relation that makes sense\nin M ′ . So, in M ′ , we have c′ ar−p 4 a. Applying Lemma 5.12 in M ′ is not sufficient, but,\nrepeating its proof, we obtain, writing φ′ for the endomorphism of M ′ associated with ∆,\nc′ ar−p ∆k = ∆k φ′k (c′ ar−p ) 4 ∆k φ′k (a) = ∆k a,\n\n\fMONOIDS OF O-TYPE, SUBWORD REVERSING, AND ORDERED GROUPS\n\n27\n\nwhich implies in M the relation cakm+r 4 akm+1 for every k. As m − 1 6 r is true by\ndefinition, Lemma 5.8 implies that a right-dominates c in M . We saw above that a rightdominates b, hence a right-dominates all of a, b, c. By Proposition 5.6, M is of right-O-type,\nhence of O-type by symmetry.\nAssume now that p + 1 divides r + 1, i.e., We have p′ = p holds. Then, starting from\na = b(ap )q , we obtain aqm+1 = b(ap b)q (am )q = b(ap am b)q = b(ar b)q , whence, substituting\nb with c(ar c)s ,\naqm+1 = c(ar c)q (ar c(ar c)s = c(ar c)(s+1)q+s = (car )(s+1)q+s c,\nand, now putting ∆ = aqm+r+1 (not the same value as above),\nc * ∆ = car * aqm+1 = car * (car )(s+1)q+s c = (car )(s+1)q+s c * ar c = aqm+1 * ar c = ∆ * c,\nso ∆ commutes with c. As it is a power of ap+1 , it commutes with b, and with a, so ∆ is\ncentral in M , and M is of right-O-type, hence of O-type by symmetry.\nTo complete the study of M , we shall check that a is dominating in all cases. We already\nproved that a right-dominates a and b, and the point is to show that a right-dominates c in\nthe case p + 1 | r + 1. Above we proved that aqm+r+1 is central in this case. Now, we only\nhave car 4 a so, unless in the degenerated case q = 0, we are not in position for applying\nLemma 5.12 directly. Instead we shall prove car+km 4 a1+km for k = 0, ..., q. As m 6 r\nholds (we have r = m + p by definition), we deduce can 4 an+1 for 0 6 n 6 qm + r using\nthe argument of Lemma 5.12. Now, as aqm+r+1 is central, the same relations then repeat\nperiodically, and can 4 an+1 holds for every n. What we shall do is to prove\na1+km = car+km * (bap )k c(ar c)s−1 (ap b)q−k\n\n(8.8)\n\nusing induction on k. For k = 0, we have a = b(ap b)q = car a(ar c)s−1 (ap b)q , which is (8.8).\nAssume q > k > 0. We find\na1+km = a1+(k−1)m * am\n= car+(k−1)m * (bap )k−1 c(ar c)s−1 (ap b)q−k+1 * am\n\nby induction hyp.\n\n= car+(k−1)m * (bap )k−1 c(ar c)s−1 am (ap b)q−k+1\n\nby am b = b am\n\n= car+(k−1)m * (bap )k−1 c(ar c)s−1 ar b(ap b)q−k\n\nby r = m + p\n\n= car+(k−1)m * (bap )k−1 c(ar c)s−1 ar b(ap b)q−k\n= ca\n\nr+(k−1)m\n\n= ca\n\nr+(k−1)m\n\np k−1\n\n* (ba )\n\np k−1\n\n* (ba )\n\nr\n\ns−1 r\n\nr\n\ns r\n\nc(a c)\n\nr\n\ns−1\n\na c(a c)\nr\n\ns−1\n\nc(a c) a c(a c)\n\nby r = m + p\np\n\n(a b)\n\nby (8.5) for b\n\np\n\nby moving brackets\n\nq−k\n\n(a b)\n\n= car+(k−1)m * (bap )k−1 bar c(ar c)s−1 (ap b)q−k\n= ca\n\nr+(k−1)m\n\np k−1\n\n* (ba )\n\n= ca\n\nr+(k−1)m\n\nm\n\nm p\n\n* a (ba )\n\np\n\nby (8.5) for b\n\nr\n\ns−1\n\np\n\nq−k\n\n(a b)\n\nby r = m + p\n\nr\n\ns−1\n\np\n\nq−k\n\nby by am b = b am\n\nba a c(a c)\n\np k−1\n\nq−k\n\nba c(a c)\n\n= car+km * (bap )k c(ar c)s−1 (ap b)q−k\n\n(a b)\n\nwhich is (8.8).\n\nSo the argument is complete and, even in the case p + 1 | r + 1, the element a dominates\neach of a, b, and c.\n\u0003\nNote that the monoid of Proposition 8.7 is generated by a and c alone and admits the\ncorresponding (less readable) presentation (a, c ; a = c(ar c)s (ap c(ar c)s )q ). The 4-parameter\nfamily of Proposition 8.7 contains in particular all presentations (a, b ; a = bar bap bar b), and\nall presentations (a, b ; a = (b(ar b)s )q ). In terms of orderable groups, we deduce\n\n\f28\n\nPATRICK DEHORNOY\n\nCorollary 8.8. For p, q, s > 0 and r > p, let G be the group hx, y | xp+1 = (y(xr−p y)s )q+1 i.\nThen G is orderable, the subsemigroup of G generated by x and yx−p is the positive cone of\na left-invariant ordering on G which is isolated in LO(G).\nProof. Once more, it suffices to show that G admits the presentation (8.5) in terms of the\nmentioned elements. Put a = x, c = yx−p , and b = c(ar c)s in G. The second relation\nof (8.5) is automatically satisfied; on the other hand, we find\nap+1 = (y(xr−p y)s )q+1 = (cap (ar−p cap )s )q+1 = (c(ar c)s ap )q+1 = (bap )q+1 = b(ap b)q ap ,\nwhence the first relation of (8.5) by right-cancelling ap , yielding an homomorphism of the\ngroup G′ defined by (8.5) to G. Conversely, put x = a and y = cap in G′ . Then x and y\ngenerate G′ and satisfy xp+1 = (y(xr−p y)s )q+1 , whence an homomorphism of G to G′ , and,\nfinally, an isomorphism. So G admits the expected presentation.\n\u0003\nWe finish with a family of still another type, namely one where the third generator is used\nto split an initially not triangular relation into two triangular relations, by observing that\na two-generator relation au = bvb defines the same group as the two triangular relations\na = bvc, b = cu. The example we choose is interesting as it corresponds to groups that are\nnot torus knot groups.\nProposition 8.9. For p, q, r > 0, let M be the monoid defined by\n(8.9)\n\n(a, b, c ; a = bap+2 (bap bap+2 )q c, b = c(bap+2 )r ba),\n\nThen, for r = 0 and for r = 1, the monoid M is of O-type.\nProof (sketch). The presentation (8.9) is triangular. Put ∆ = (ap+2 b)2q+r+3 . Then ∆\nis central in M and a 4 ∆ holds. Hence, by Proposition 5.11, M is of right-O-type,\nhence of O-type as the opposite relations also are triangular (with the ordering of a and b\nexchanged).\n\u0003\nCorollary 8.10. For q, r > 0, let G be the group hx, y | xr+1 = (yx2 y)q+1 i. Then, for r = 0\nand 1, the group G is orderable and, for every p, the subsemigroup of G generated by x−1 ,\nxyp+2 , and xyx−(r+1) is the positive cone of a left-invariant ordering on G which is isolated\nin LO(G).\nProof. According to the principle stated before Proposition 8.9, the group defined by (8.9)\nadmits the presentation ha, b | a(bap+2)r ba = bap+2 (bap bap+2 )q bi. Introducing x = bap+2 ,\nthis becomes ha, b, x | axr ba = x(xa−2 x)q b, x = bap+2 i, whence ha, x | axr+1a = x(xa−2 x)q xi.\nPutting y = a−1 , this becomes hx, y | xr+1 = yx(xy2x)q xyi, whence hx, y | xr+1 = (yx2 y)q+1 i\nby arranging the brackets. The result then follows from the converse relations a = x−1 ,\nb = xyp+2 , and c = xyx−(r+1) .\n\u0003\nFor r > 2, it seems that the monoid M of Proposition 8.9 is still of O-type: experiments\nsuggest that, for p = 0 and r = 2, the right-ceiling of M is the periodic word ∞(b2 a3 ) for\nevery q but, as no central or quasi-central element seems to exist, this remains a conjecture.\nA few further families are displayed in Table 3. We skip the verifications.\n9. Limits of the approach\nSo far, we did not discuss the range of our approach, namely the question of whether many\nmonoids of (right)-O-type admit (right)-triangular presentations. Owing to the positive\nresults of Sections 7 and 8, which provide a number of such monoids of O-type, it would\neven be conceivable that all monoids of O-type could admit a triangular presentation. In this\nsection, we show that this is not the case, and give a simple criterion discarding a number\nof such monoids, in particular the n-strand Dubrovina–Dubrovin braid monoids for n > 4.\nSo our starting point is\n\n\fMONOIDS OF O-TYPE, SUBWORD REVERSING, AND ORDERED GROUPS\n\n1:\n2:\n\n(a, b ; a = b(abp )q ab)\n(a, b ; a = bar bap bar b)\nwith p + 1 | r\n\n3:\n\n(a, b, c ; a = bap b, b = cbar c)\nwith p + 1 | r + 1\np\n(a, b, c ; a = ba b, b = cbar c)\nwith p + 1 | r\n\n4:\n\n5:\n\n(a, b, c ; a = b(ab)p , b = cb(ar b)p c)\nwith r odd\n\n6:\n\n(a, b, c ; a = bap+1 (bap bap+1 )q c, ...\nb = c(bap+1 )r ba)\n\n29\n\n∆ = (abp−1 )2 central\nhx, y | xq+2 =y2 i\n∆ = (ar b)2 right-quasi-central\nwith φ(a) = ap (bar b)2 , φ(b) = b\nhx, y | xp = (yxr−p y)2 i\n∆ = ap(r−p)+1 central\nhx, y, z | xp+1 = y2 , y = zyxr−p zi\n∆ = ar b2 quasi-central\nwith φ(a) = ap bap−1 b3 , φ(b) = b, φ(c) = c;\nhx, y, z | xp+1 = y2 , y = zyxr−p zi\np(p+1)(r−1)+2\n∆=a\ncentral\nhx, y, z | x2 = (xy)p+1 , zyz = y(xr y)q i\n∆ = (ap+1 b)r+3 central\nhx, y | yr+3 = xq+2 i\n\nTable 3. More examples of monoids of O-type, with the justification and an alternative presentation of the associated group; in 1, two-generator symmetric presentations with central elements that are not a power of a; in 2 (a special case of\nProposition 8.4), two-generators symmetric presentations with quasi-central elements\nthat are not central (for p > 1); in 6, an example similar to Proposition 8.9 (which\ncorresponds to replacing p + 1 with p + 2).\n\nQuestion 9.1. Assume that M is a monoid of right-O-type and S is a generating subfamily\nof M . Does M admit a right-triangular presentation based on S?\nWhat is significant in a right-triangular presentation is not the fact that it consists of\ntriangular relations, but the condition that there is at most one letter N (s) and one relation\nN (s) = sC(s) for every s: every positive presentation can be trivially transformed into a\npresentation of the same monoid consisting of triangular relations by introducing, for every\nrelation u = v, a new letter s and replacing u = v with the triangular relations s = u, s = v.\nThe following result, which is a special case of a result of [11] for monoids in which any\ntwo elements admit a least common right-multiple, may appear relevant for Question 9.1.\nFact 9.2. Assume that M is a monoid of right-O-type that satisfies Condition (4.2), and S\nis any generating subfamily of M . For all s, s′ in S with s 4 s′ , choose an S-word w such\nthat sw represents s′ . Let R be the family of all relations sw = s′ so obtained. Then (S ; R)\nis a presentation of M .\nProof (sketch). We wish to prove for all S-words u, v that [u]+ = [v]+ is equivalent to u ≡+\nR v.\nBy construction, R consists of relations that are valid in M , hence u ≡+\nv\nalways\nimplies\nR\n[u]+ = [v]+ , and the problem is the converse implication. Standard arguments show that\n(4.2) is equivalent to the existence of a map λ from M to the ordinals such that s 6= 1\nimplies λ(sg) > λ(g). Then one proves that [u]+ = [v]+ with λ([u]+ ) = α implies u ≡+\nR v\nusing induction on α. For α = 0, we have λ([u]+ ) = λ([v]+ ) = 0, hence [u]+ is minimum\nwith respect to proper right-divisibility in M , implying [u]+ = [v]+ = 1, whence u = v = ε.\nAssume now α > 0. Then u and v cannot be empty. Write u = su0 , v = s′ v0 with s, s′ in S.\nThen, by definition, we have (*) λ([u0 ]+ ) < λ([u]+ ) and λ([v0 ]+ ) < λ([v]+ ). Assume first\ns′ = s. By assumption, we have [u]+ = [v]+ , i.e., s[u0 ]+ = s[v0 ]+ . As M is left-cancellative,\nwe deduce [u0 ]+ = [v0 ]+ . By (*) and the induction hypothesis, this implies u0 ≡+\nR v0 ,\n′\nwhence a fortiori u = su0 ≡+\nsv\n=\nv.\nFinally,\nassume\ns\n=\n6\ns.\nIn\nM\n,\nthe\nelements\ns\n0\nR\nand s′ are comparable for 4, say for instance s 4 s′ . Then, by construction, there exists\nin R one relation sw = s′ such that s[w]+ = s′ holds in M . We deduce s[u0 ]+ = s′ [v0 ]+ =\n\n\f30\n\nPATRICK DEHORNOY\n\ns[w]+ [v0 ]+ = s[wv0 ]+ , whence [u0 ]+ = [wv0 ]+ since M is left-cancellative. By (*) and the\n+\n+\n′\ninduction hypothesis, this implies u0 ≡+\nR wv0 , whence u = su0 ≡R swv0 ≡R s v0 = v. So\nthe induction is complete.\n\u0003\nThe above positive result is misleading. The range of Fact 9.2 is nonempty since it applies\nat least to the monoid (N, +), but, as already mentioned, the Noetherianity condition (4.2)\nfails in almost all monoids that admit triangular presentations, and the following example\nshows that, when (4.2) fails, we cannot hope for a result similar to Fact 9.2.\nExample 9.3. Let M be the Klein bottle monoid ha, b | a = babi+. Then M is of rightO-type, and it is generated by a and b. Now, in M , we have a = b2 ab2 , so, if Fact 9.2\nwere valid here, (a, b ; a = b2 ab2 ) would be an alternative presentation of M . This is not\nthe case: by Lemma 7.2 applied with u = b and v = ε, monoid ha, b | a = b2 ab2 i+ is not of\nright-O-type and, therefore, it is not isomorphic to M .\nActually, we shall establish a rather general negative answer to Question 9.1 in the case\nof generating families with at least three elements.\nDefinition 9.4. Assume that M is a monoid and S is included in M . An element s of S is\ncalled preponderant in S if g 4 hs holds for all g, h in the submonoid generated by S\\{s}.\nProposition 9.5. Assume that M is a monoid of right-O-type and S is a generating subfamily of M that contains a preponderant element and has at least three elements. Then M\nadmits no right-triangular presentation based on S.\nProof. We assume that M admits a right-triangular presentation (S ; R) and shall derive a\ncontradiction by exhibiting two elements of M that cannot admit a common right-multiple.\nAs M is of right-O-type, owing to Lemma 4.9, we can enumerate S as {ai | i ∈ I} so that\nall relations in R have the form ai−1 = ai C(ai ). Assume that ai is preponderant in S. Then\ni must be minimal in I as aj ≺ ai holds for every j 6= i. So we may assume I = {1, 2, ...}\n(finite or infinite), and that a1 is preponderant in S.\nAs a1 is preponderant in S, it may occur in no word C(ai ) with i > 3 for, otherwise,\nwriting C(ai ) = ua1 v with no a1 in u, applying the definition of preponderance with g = a2i−1\nand h = [ai u]+ would lead to the contradiction\nai−1 ≺ a2i−1 4 [ai ua1 ]+ 4 [ai C(ai )]+ = ai−1 .\nOn the other hand, a1 must occur in C(a2 ) for, otherwise, we would obtain similarly the\ncontradiction [a2 C(a2 )]+ ≺ [a2 C(a2 )a2 ]+ 4 a1 = [a2 C(a2 )]+ . Write a2 C(a2 ) = u0 a1 v0 with\nno a1 in u0 .\nClaim. Assume that w is an S-word that is ≡+\nR -equivalent to a word beginning with a1 . Then\nw contains at least one letter a1 and, if u is the initial fragment of w that goes up to the\nr\nfirst letter a1 , there exists r > 0 satisfying u ≡+\nR u0 .\nWe prove the claim using induction on the combinatorial distance n of w to a word\nbeginning with a1 , i.e., on the length of an R-derivation from w to such a word. For n = 0,\ni.e., if w begins with a1 , the word u is empty, and we have u = ε = u00 . Assume n > 0. Let\nw′ be a word obtained from w by applying one relation of R that lies at distance n − 1 from\na word beginning with a1 . By induction hypothesis, w′ contains at least one letter a1 , and\nr′\n′\nwe have w′ = u′ a1 v ′ with no a1 in u′ and u′ ≡+\nR u0 for some r . We consider the various\n′\nways w can be obtained from w . First, if one relation of R is applied inside v ′ , we have\n′\n′\n′\nw = u′ a1 v with v ≡+\nR v and the result is clear with u = u and r = r . Next, assume that\nthe distinguished letter a1 is involved. By hypothesis, N (a1 ) is not defined, so there is no\nrelation s = a1 C(a1 ) in R. On the other hand, u′ contains no a1 and, therefore, a1 occurs\nin no relation s = ... for s occurring in u′ . So the only ways a1 may be involved is either\n\n\fMONOIDS OF O-TYPE, SUBWORD REVERSING, AND ORDERED GROUPS\n\n31\n\na1 being replaced with a2 C(a2 ), or a2 C(a2 ) (which contains at least one a1 ) being replaced\nwith a1 . In the first case, we obtain u = u′ u0 a1 v0 v ′ , which shows that w contains a letter a1\nr ′ +1\nand gives u = u′ u0 , whence u ≡+\n, the expected result with r = r′ + 1. In the second\nR u0\n′\ncase, there must exist decompositions u = uu0 and v ′ = v0 v so that we have w′ = uu0 a1 v0 v\n+\n+\nr−1\n′\nr′\nand w = ua1 v. Again w contains a1 , and we find now uu0 ≡+\nR u ≡R u0 , whence u ≡R u0\nbecause, by assumption, M is right-cancellative. This is again the expected result, this time\nwith r = r′ − 1. Finally, it remains the case when one relation of R is applied inside u′ . In\n+\n+\n′\n′\nr′\nthis case, we obtain w = ua1 v ′ with u ≡+\nR u , whence u ≡R u ≡R u0 , and the result is clear\nwith r = r′ . So the proof of the claim is complete.\nWe shall now easily obtain a contradiction. Indeed, by construction, the word u0 begins\nwith the letter a2 , so a2 4 [u0 ]+ holds. By assumption, a2 and a3 are distinct, so C(a3 )\nis nonempty, and we obtain 1 ≺ a3 ≺ a3 [C(a3 )]+ = a2 4 [u0 ]+ , so that a3 = [ur0 ]+ fails\nfor every r. Then the above claim implies that no S-word beginning with a3 a1 may be\n≡+\nR -equivalent to an S-word beginning with a1 . In other words, the elements a1 and a3 a1\ncannot admit a common right-multiple in M , contrary to the assumption that M is of\nright-O-type.\n\u0003\nProposition 9.5 prevents a number of monoids of right-O-type from admitting a righttriangular presentation.\nCorollary 9.6. Assume that M is a monoid of right-O-type that is generated by a, b, c with\na ≻ b ≻ c and b, c satisfying some relation b = cv with no a in v. Then, unless M is\ngenerated by b and c, there is no way to complete b = cv with a relation a = bu so as to\nobtain a presentation of M .\nProof. For a contradiction, assume that (a, b, c; a = bu, b = cv) is a presentation of M . If\nthere is no a in u, the assumption that a = bu is valid in M implies that a belongs to the\nsubmonoid generated by b and c, so M must be generated by b and c.\nAssume now that there is at least one a in u. As a does not occur in b = cv, a word\ncontaining a cannot be equivalent to a word not containing a. This implies that a is preponderant in {a, b, c}. Indeed, assume that g, h belong to the submonoid of M generated by b\nand c. By the above remark, hag ′ = g is impossible, hence so is ha 4 g. As, by assumption,\nM is of right-O-type, we deduce g 4 ha. Then Proposition 9.5 gives the result.\n\u0003\nSo, for instance, no right-triangular presentation made of b = cbc (Klein bottle relation)\nor b = cb2 c (Dubrovina–Dubrovin braid relation) plus a relation of the form a = b... may\ndefine a monoid of right-O-type. In the case of braids, we obtain the following general result.\nCorollary 9.7. Let Bn⊕ be the submonoid of the braid group Bn generated by s1 = σ1 ***σn−1 ,\n(−1)n\ns2 = (σ2 ***σn−1 )−1 , s3 = σ3 ***σn−1 , ..., sn−1 = σn−1 . Then Bn⊕ is a monoid of O-type that\nadmits no right-triangular presentation based on {s1 , ..., sn−1 } for n > 4.\nProof. That Bn⊕ is of O-type was established by Dubrovina–Dubrovin in [12]. Now, as a braid\nthat admits an expression containing at least one σ1 and no σ1−1 cannot admit an expression\nwith no σ1±1 [10], the generator s1 is preponderant in {s1 , ..., sn−1 }. Proposition 9.5 implies\nthat Bn⊕ admits no triangular presentation based on {s1 , ..., sn−1 } for n > 4.\n\u0003\nOne can indeed convert the standard presentation of the braid group Bn into a presentation in terms of the generators s1 , ..., sn−1 of Corollary 9.7. For instance, writing a, b, ...\nfor s1 , s2 , ..., one can check that B4⊕ admits the presentation\n(9.1)\n\n(a, b, c ; a = b2 a2 baba2b2 , b = cb2 c, abc = cab),\n\na triangular presentation augmented with a third, additional relation. But the triangular\npresentation made of the first two relations in (9.1) is not a presentation of B4⊕ , nor of any\nmonoid of O-type either.\n\n\f32\n\nPATRICK DEHORNOY\n\n10. Further questions\nAlthough triangular presentations may seem to be extremely particular, it turns out that\na number of monoids of O-type with such presentations exist-much more than was expected\nfirst. So the main question is to further explore the range of the approach and understand\nwhich ordered groups are eligible. In particular, we started here from a monoid viewpoint\nand did not address the question of starting from an (ordered) group and possibly finding\na relevant monoid with a triangular presentation. We now mention a few more specific\nproblems.\nTwo-generator monoids of O-type. Whereas describing all monoids of O-type is certainly out of reach, the particular case of two-generator monoids seems more accessible, and\nseveral natural questions arise.\nFirst, we saw in Section 9 that some monoids of O-type admit no triangular presentation,\nbut the argument of Proposition 9.5 requires the existence of at least three generators.\nQuestion 10.1. Does every two-generator monoid of right-O-type admit a right-triangular\npresentation?\nIf M is a monoid of right-O-type generated by a ≻ b, some triangular relation a = bw\nis satisfied in M . However, the word w is not unique and Question 10.1 asks in particular\nfor a preferred choice of w. Here is a negative observation about what could be a natural\napproach. Let (wn )n>1 be the shortlex-enumeration of {a, b}∗. Using induction on n, we can\nconstruct a triangular presentation (w1 , ..., wn ; Rn ) that specifies the 4-adjacent elements in\n{[wi ]+ | i 6 n} in M : assuming that the evaluation [wn ]+ of wn lies between [wi ]+ and [wj ]+\nin {[w1 ]+ , ..., [wn ]+ }, we obtain Rn from Rn−1 by removing the former relation wj = wi * ...\nand adding two new relations wn = wi * u, wj = wn * v with u, v (say) shortlex-minimal. We\ncould expect that, at least if a central element exists, the process converges and leads to a\ntriangular presentation of M . Let M = ha, b | a = babi+. Then R3 specifies ε < b < a and\ncontains the relation a = b * ab, whereas R4 corresponds to inserting b2 between b and a, so\nwe remove a = b * ab and add b2 = b * b and a = b2 * ab2 . Now we observed in Example 9.3\nthat a = b*ab is not a consequence of the latter two relations, so the process cannot converge\nto a presentation of M , and Question 10.1 remains open.\nNext, all identified monoids of O-type with two generators share some properties.\nQuestion 10.2. Is every two-generator triangular presentation defining a monoid of O-type\nnecessarily palindromic, i.e., the relation is invariant under reversing the order of letters?\nIs the right-ceiling necessarily equal to ∞s, where s is the top generator?\nAt the moment, we have no counter-example.\nMore generally, we can wonder whether a complete description of all monoids of O-type\nthat admit a two-generator triangular presentation could be possible. When stated in terms\nof two-generator presentation, Proposition 8.7 may appear promising, but a complete solution still seems out of reach. The general form of the relation in a two-generator triangular\npresentation is a = bae1 bae2 b.... Proposition 8.1 corresponds to the case when all exponents ei are equal, whereas Proposition 8.7 corresponds to the case when two exponents p, r\noccur with a periodic distribution a = b(ar b)s (ap b)(ar b)s (ap b)... . Inductively extending\nProposition 8.7 seems doable-the next case would be that of three relations a = b(ap b)q ,\nb = c(ar c)s , c = d(at d)u involving three exponents p, r, t-even finding methods that cover\nall cases with two exponents seems problematic. We give below an example of such a monoid\nthat is indeed of O-type but enters no identified family.\nExample 10.3. Let M be the monoid defined by (a, b ; a = babab2ab2 abab), which is\nalso defined by (a, b, c ; a = bcacb, b = cacac). Working with the second presentation and\n\n\fMONOIDS OF O-TYPE, SUBWORD REVERSING, AND ORDERED GROUPS\n\n33\n\nputting δ = b2 , one can establish the formulas\naδ n * cacbc(bc)2n = bδ n * b = cδ n * acacb = δ n+1 .\nIt follows that δ dominates a, b, and c in M . Hence, by Proposition 5.6, M is of Otype. Experiments suggest that the right-ceiling is ∞a, so that, by Lemma 5.9, a should\ndominate a, b, c as well, but we have no proof.\nPeriodicity of the right-ceiling. Many of the monoids mentioned in Sections 7 and 8\nadmit a central or a quasi-central element that is a power of the top generator, and we could\nwonder whether this is always the case. It is not.\nExample 10.4. Consider the monoid M of Proposition 8.7 with r > 2 and p + 1 6 | r + 1. We\nhave seen in the proof that the relation cakm+r 4 akm+1 holds for every k. As m 6 r holds\nby definition, we deduce ca(k+1)m 4 akm+1 for each k, which in turns implies can ≺ an for\nevery n. So an 4 can is always impossible, and an is not quasi-central for any n.\nThis however says nothing about quasi-central elements that are not a power of the top\ngenerator, and we can raise\nQuestion 10.5. Does every monoid of O-type that admits a triangular presentation contain\na quasi-central element?\nA positive answer seems unlikely but, on the other hand, it is uneasy to a priori discard\nthe existence of exotic quasi-central elements. In particular, looking at the right-ceiling is\nirrelevant in general: a quasi-central element ∆ dominates all generators but, if ∆ admits\nno expression that is a right-top word, Lemma 5.9 cannot be used. For instance, for the\npresentation (ab ; a = bab3 ab) (row 5 in Table 2), the right-ceiling ∞a does not discard\nthe existence of the central element (ab)3 . Owing to the explicit formulas in the proof\nof Proposition 8.7, we think it might be possible to prove that no nontrivial quasi-central\nelement exists in the case of (a, b, c ; a = ba2 b, b = ca4 c).\nThe situation is also open for dominating elements. As for the top generator to necessarily\ndominate the other generators, the answer is negative. Indeed, according to Lemma 5.9, the\ntop generator s dominates the other generators if and only if the right-ceiling is ∞s. So, to\ndiscard a positive answer, it suffices to exhibit one presentation where the right-ceiling has\na different form. The following example does, and, in addition, it shows that not only the\ntop generator, but even any power of it need not dominate the other generators.\nExample 10.6. Let M be defined by the presentation\n(10.1)\n\nha, b, c | a = bac, b = cbai+\n\n(case p = q = r = 0 in row 6 of Table 3). One easily checks that b2 a2 is right-quasicentral in M , with φ(a) = aba2 cac3 , φ(b) = ba2 c2 , and φ(c) = c, and that b2 a2 dominates\n{a, b, c}4. By Lemma 5.9, it follows that the right-ceiling is the periodic word ∞(b2 a2 )\nand, therefore, a cannot dominate b and c in M . Moreover, we find ba2 = a3 * ba2 c3 , and\nb(an ) = (an )2 * ba2 c2n an−2 for n > 2. This shows that an does not dominate b for any n.\nNow, as in the case of quasi-central elements, this says nothing about dominating elements\nthat are not powers of the top generator and leaves the following natural questions open:\nQuestion 10.7. Does every monoid of O-type that admits a triangular presentation based\non a set S contain an element that dominates S? Is the right-ceiling necessarily periodic in\na monoid of O-type that admits a finite triangular presentation?\nBy Lemma 5.9, a positive answer to the second question means the existence of an element\nof S n that dominates all of S n for some n > 1, hence a fortiori S, so it implies a positive\n\n\f34\n\nPATRICK DEHORNOY\n\nanswer to the first question. Owing to the examples known so far, we conjecture a positive\nanswer to both questions, but we have no clue toward a proof.\nWe add two more related examples. The first one shows that a power of the top generator\nmay dominate the other generators although the top generator does not.\nExample 10.8. Let M be defined by (a, b, c ; a = bcb, b = cbabc). Then M is generated\nby b and c, with the presentation (b, c ; b = cb2 cb2 c). So, by Proposition 8.1, b3 is central\nand M is of O-type. Now a3 = b3 happens to hold and, therefore, a3 dominates b and c.\nOn the other hand, we find ba = a2 * bc2 b, whence ba 64 a2 , and a does not dominate b.\nThe second one shows that the period of the right-ceiling can be arbitrarily large.\nExample 10.9. Let Mn be defined by the cycling presentation\n(a1 , ..., an ; a1 = a2 ***an , a2 = a3 ***an a1 , ..., an−1 = an a1 ***an−1 ).\nThen\n\na21\n\nis central in Mn , and the right-ceiling is\n\n∞\n\n(an−1 ***a1 ), hence it has period n − 1.\n\nA similar behaviour can be found with three generators in the family of row 6 in Table 3.\nComplexity of reversing. In the context of a presentation that is complete for rightreversing, the existence of common right-multiples implies the termination of every rightreversing. However, the argument gives no complexity bound, at least no polynomial bound.\nExample 10.10. Consider the presentation (a, b ; a = babr+1 ) of the Baumslag-Solitar\nn\ngroup BS(r + 1, −1). For every n, the signed word a−n ban reverses to the word b(r+1) ,\nwhose length is exponential in n. As every reversing step adds at most r letters, the number\nof steps needed to reverse the length 2n + 1 word a−n ban must be exponential in n.\nAn exponential complexity may occur whenever there exists a right-quasi-central element such that the associated endomorphism duplicates some letter. Now, in all examples,\nthe monoid is not of left-O-type: this is the case in Example 10.10 or, for instance, for\n(a, b, c ; a = bacb, b = cac), where a2 is right-quasi-central with φ(c) = (cb)2 but the opposite presentation leads to the non-terminating reversing u y(12) v −1 uv for u = b−1 c2 ab and\nv = c2 . By contrast, such behaviours could not be found for monoids of O-type.\nQuestion 10.11. If a triangular presentation defines a monoid of O-type, does the associated reversing necessarily have a polynomial (quadratic?) complexity?\nNote that the existence of a quasi-central element that is not central need not imply an\nexponential complexity. For instance, for the presentation (a, b ; a = ba2 baba2b) (row 2\nof Table 3) with ∆ = (a2 b)2 quasi-central, we have φ(a) = a(ba2 b)2 , and the shortest\nexpression of φ(a) is longer by 8 letters than that of a. However, φ(a2 ) = a2 holds in the\nmonoid, and reversing ∆−n a∆n leads to a word of length linear in n in a quadratic number\nof steps. The monoid of Example 10.3 is a good test-case for Question 10.11. It turns out\nthat reversing the length 2n word a−(n−1) b−1 an leads to a word of length (2n)2 in a number\nof steps that is cubic in n: this is compatible with a positive answer to Question 10.11, but\ndiscards a uniform quadratic upper bound.\nConnection with rewrite systems. Triangular presentations are simple in many respects,\nand they could be eligible for alternative approaches, in particular rewrite systems.\nExample 10.12. Consider the presentation (a, b ; a = bab) of the Klein bottle group. To\nobtain Noetherianity, we orientate the relation as bab → a. Then there is a critical pair as\nbabab rewrites into a2 b and ba2 . Adding ba2 → a2 b yields a system that is locally confluent\nand Noetherian (the rules diminish the length or replace a word with a word of the same\nlength and lexicographically smaller), hence confluent. Then every word rewrites in finitely\nmany steps into a unique, well defined terminal word, providing a unique normal form for\nthe elements of the monoid.\n\n\fMONOIDS OF O-TYPE, SUBWORD REVERSING, AND ORDERED GROUPS\n\n35\n\nThe existence of a normal form as above gives an easy solution to the word problem of\nthe monoid, and can in turn be extended to the group. However recognizing divisibility\nproperties is not clear.\nQuestion 10.13. Can one use the rewrite system approach to investigate the existence of\ncommon multiples in the associated monoid?\nWe have no answer. Let us also observe that using (as above) the lexicographical ordering\nto solve critical pairs need not lead to a Noetherian system in general.\nExample 10.14. Consider the triangular presentation (a, b, c ; a = bc, b = cb2 ). Starting\nwith the two rules bc → a, cb2 → b, a critical pair comes from rewriting bcb2 into ab2\nand b2 . Using the lexicographical ordering would lead to adding the rule b2 → ab2 , which\nclearly contradicts Noetherianity.\nIsolated points in the case of a direct limit. Theorems 1 and 6.5 are valid in the case of\nan infinite presentation, thus leading to orderable groups with an explicit positive cone. But\nthe argument showing that the involved ordering is isolated in its space of orderings is valid\nonly when the presentation is finite. However, as observed by C. Rivas [20], a non-finitely\ngenerated monoid may give rise to an isolated ordering, so it makes sense to raise\nQuestion 10.15. If (S, R) is an infinite triangular presentation defining a monoid of Otype, may the associated ordering be isolated in the space LO(hS | Ri)?\nIn the direction of a positive answer, it would be natural to address Question 10.15 in the\ncontext of a direct limit of finitely generated monoids. The properties of subword reversing\nmake this situation easy to analyze.\nProposition 10.16. Assume that (S ; R) is an infinite triangular presentation\n(10.2)\n\n(a1 , a2 , ... ; a1 = a2 w2 a2 , a2 = a3 w3 a3 , ...)\n\nwith wi in {a1 , ..., ai }∗ and, putting Sn = {a1 , ..., an } and Rn = {ai−1 = ai wi ai | i 6 n},\nthat the monoid hSn | Rn i+ is of O-type for every n (or, at least, for unboundedly many n).\nThen hS | Ri+ is a direct limit of the monoids hSn | Rn i+ , it is of O-type, and hS | Ri+ \\{1} is\nthe positive cone of a left-invariant ordering on the group hS | Ri.\nProof. Assume n < m. Owing to the assumption about wi , the presentations (Sn ; Rn )\nand (Sm ; Rm ) are well defined and, by definition, they are right-triangular, so that, by\ncn ) and (Sm ; R\nd\nProposition 4.4, (Sn ; R\nm ) are complete for right-reversing. Now assume\nthat u, v are Sn -words. Then u and v represent the same element in hSn | Rn i+ (resp. in\ncn -reversible (resp. R\nd\nhSm | Rm i+ ) if and only if u−1 v is R\nm -reversible) to the empty word. By\ndefinition of reversing, the relations in Rm \\ Rn are never involved in the reversing of u−1 v,\nso the latter two relations are both equivalent to u−1 v being R-reversible to ε. It follows\nthat the identity on Sn induces an embedding of hSn | Rn i+ into hSm | Rm i+ . So hSn | Rn i+\nidentifies with the submonoid of hSm | Rm i+ generated by Sn and hS | Ri+ is then the direct\nlimit, here the union, of all monoids hSn | Rn i+ .\nIt follows that hS | Ri+ is of O-type. Indeed, a direct limit of monoids of right-O-type is of\nright-O-type: any two elements of the limit belong to some monoid of the considered direct\nsystem, hence are comparable with respect to left-divisibility in that monoid, and therefore\nin the limit.\n\u0003\nThe interest of Proposition 10.16 is to provide local conditions for recognizing a monoid\nof O-type: in order to show that the monoid hS | Ri+ is, say, of right-O-type, it is sufficient\nto consider the finite type monoids hSn | Rn i+ . A typical example is the group\n(10.3)\n\nhx1 , x2 ... | x21 = xq2 , x22 = xq3 , ...i\n\n\f36\n\nPATRICK DEHORNOY\n\nconsidered in Proposition 8.4. For q = 2, the element ∆ = x21 is central in hS | Ri+ , and\nn−2\nTheorem 1 implies that hS | Ri+ is of O-type. By contrast, for q odd, the element ∆n = x21\nis central in hSn | Rn i+ , but not in in hSn+1 | Rn+1 i+ . It follows that hSn | Rn i+ is of O-type\nfor every n, and hS | Ri+ is of O-type by Proposition 10.16, but, in this case, no power of x1\nis central in hS | Ri+ . The multi-toric groups (10.3) are natural test-cases for Question 10.15.\nThe specific case of braids. The braid group B3 is eligible for our current approach, as\nthe submonoid B3⊕ generated by σ1 σ2 and σ2−1 turns out to be a monoid of O-type with the\ntriangular presentation (a, b; a = ba2 b). By contrast, we saw in Section 9 that, for n > 4, the\nsubmonoid Bn⊕ of Bn generated by the Dubrovina-Dubrovin generators s1 , ..., sn−1 admits no\ntriangular presentation based on {s1 , ..., sn−1 }. This however does not discard the possibility\nthat Bn⊕ admits a triangular presentation based on other generators.\nQuestion 10.17. Does the monoid Bn⊕ admit a (finite) triangular presentation for n > 4?\nNatural candidates could be the Birman–Ko-Lee band generators [2]. For 1 6 i < j 6 n,\n−1\nput ai,j = σi ***σj−2 σj−1 σj−2\n***σi−1 , whence in particular σi = ai,i+1 . Then the family\n(ai,j )16i<j6n generates Bn , and the submonoid of Bn generated by the ai,j 's, which is\nknown as the dual braid monoid, has many nice properties. Now there exists a simple\nconnection between the monoid Bn⊕ and the elements ai,j .\n(−1)i+1\n\nProposition 10.18. Put bi,j = ai,j\nby the elements bi,j .\n\n. Then, for every n, the monoid Bn⊕ is generated\n\nProof. We recall from [10] that a braid is called σi -positive (resp. negative) if it admits a\ndecomposition in terms of the generators σk that contains no letter σk±1 with k < i, and\ncontains at least one letter σi and no letter σi−1 (resp. at least one letter σi−1 and no letter σi ).\nThen an element of Bn belongs to Bn⊕ if and only if it is either σi -positive for some odd i\n−1\n−1\nor σi -negative for some even i. The braid relations imply ai,j = σj−1 ***σi+1 σi σi+1\n***σj−1\nfor\ni < j, hence ai,j is σi -positive, and bi,j is σi -positive for odd i and σi -negative for even i.\nTherefore, bi,j belongs to Bn⊕ for all i, j. Conversely, in Bn , we have\n−1\n−1\nσi ***σn−1 = (σi ***σn−2 σn−1 σn−2\n***σi−1 )(σi ***σn−3 σn−2 σn−3\n***σi−1 )***(σi σi+1 σi−1 )(σi ),\n(\nbi,n bi,n−1 ***bi,i+1 for odd i,\n(−1)i+1\nwhence si = (σi ***σn−1 )\n=\nHence si belongs to the\nbi,i+1 ***bi,n−1 bi,n for even i.\n\u0003\nsubmonoid of Bn generated by the bi,j 's and, finally, Bn⊕ coincides with the latter.\n\nProposition 10.18 makes it natural to wonder whether Bn⊕ admit a triangular presentation based on the elements bi,j , or on connected elements. The answer is positive for\nn = 3. Indeed, starting from the standard presentation of B3 in terms of the ai,j 's, here\nσ1 σ2 = σ2 a1,3 = a1,3 σ1 , one deduces that B3⊕ admits the presentation hb1,2 , b2,3 , b1,3 | b1,2 =\nb1,3 b1,2 b2,3 , b1,3 = b2,3 b1,3 b1,2 i+ , which is (10.1) with a, b, c interpreted as σ1 , a1,3 , and σ2−1 .\nThe quasi-central element is then σ1 σ22 σ1 and the associated endomorphism is defined by\nφ(σ1 ) = σ22 σ1 σ2−2 and φ(σ2 ) = σ2 .\nFor n > 4, the question remains open. It might be natural to replace, for even i, the\n−1\n***σj−1 σj−1 ***σi , i.e., to put the negative\ngenerators a−1\ni,j with the symmetric versions σi\nfactors first. Then relations similar to those for B3⊕ arise, typically a = bac, b = cba,\nc = dce, d = edc for B4⊕ , but the associated monoid is not B4⊕ because ae = ea is missing.\nWe conclude with an amusing application. For small values of n, the connection of Proposition 10.18 between the Dubrovina–Dubrovin ordering and the Birman–Ko–Lee generators\nof braid groups implies the existence of a braid ordering on Bn that is isolated (contrary\nto the Dehornoy ordering) and, at the same time, includes the positive braid monoid Bn+\n(contrary to the Dubrovina–Dubrovina ordering).\n\n\fMONOIDS OF O-TYPE, SUBWORD REVERSING, AND ORDERED GROUPS\n\n37\n\nCorollary 10.19. The subsemigroup generated by σ1 , σ2 , and σ1 σ2−1 σ1−1 is the positive cone\nof an isolated left-invariant ordering on the braid group B3 . The subsemigroup generated\nby σ1 , σ2 , σ3 , σ1 σ2 σ1−1 , σ2 σ3−1 σ2−1 , and σ1 σ2 σ3−1 σ2−1 σ1−1 is the positive cone of an isolated\nleft-invariant ordering on the braid group B4 .\nProof. Conjugation by σ1 ***σn defines an order n automorphism φn of Bn that rotates the\nBirman–Ko–Lee generators [10]. For n = 3, one has φ3 : σ1 7→ σ2 7→ a1,3 7→ σ1 . By Proposition 10.18, B3⊕ is generated by σ1 , a1,3 , σ2−1 . Hence the monoid φ3 (B3⊕ ) is generated by σ2 ,\nσ1 , a−1\n1,3 , and it is (when 1 is removed) the positive cone of a left-invariant ordering on B3 .\nSimilarly, for n = 4, we have φ4 : σ1 7→ σ2 7→ σ3 7→ a1,4 7→ σ1 and a1,3 ↔ a2,4 . By\nProposition 10.18, the monoid B4⊕ is generated by σ1 , a1,3 , a1,4 , σ2−1 , a−1\n2,4 , σ3 . Hence\n−1\nφ24 (B4⊕ ) is generated by σ3 , a1,3 , σ2 , σ3 , a−1\n,\na\n,\nσ\n,\nand\nit\nis\n(with\n1\nremoved)\nthe positive\n1\n1,4\n2,4\ncone of a left-invariant ordering.\n\u0003\nBy the above remarks, the monoid φ3 (B3⊕ ) admits the presentation (10.1) with a = σ2 ,\n−1 −1\nb = σ1 , c = a−1\n1,3 = σ1 σ2 σ1 . The construction does not extend to n > 5, because the\n−1\nnegative entries σ2 and σ4−1 cannot be eliminated simultaneously.\nReferences\n[1] S.I. Adyan, Defining relations and algorithmic problems for groups and semigroups, Proc. Steklov Inst.\nMath., 85 (1966).\n[2] J. Birman, K.H. Ko & S.J. Lee, A new approach to the word problem in the braid groups, Advances in\nMath. 139-2 (1998) 322-353.\n[3] A.H. Clifford & G.B. Preston, The algebraic Theory of Semigroups, vol. 1, Amer. Math. Soc. Surveys\n7, (1961).\n[4] M. Dabkovska, M. Dabkowski, V. Harizanov, J. Przytycki, and M. Veve, Compactness of the space of\nleft orders, J. Knot Theory Ramifications 16 (2007) 267–256.\n[5] P. Dehornoy, Deux propriétés des groupes de tresses, C. R. Acad. Sci. Paris 315 (1992) 633–638.\n[6] P. Dehornoy, Groups with a complemented presentation, J. Pure Appl. Algebra 116 (1997) 115–137.\n[7] P. Dehornoy, Complete positive group presentations, J. Algebra 268 (2003) 156–197.\n[8] P. Dehornoy, The subword reversing method, Intern. J. Alg. and Comput. 21 (2011) 71–118\n[9] P. Dehornoy, with F. Digne, E. Godelle, D. Krammer, J. Michel, Garside Theory, in progress;\nhttp://www.math.unicaen.fr/∼garside/Garside.pdf.\n[10] P. Dehornoy, with I. Dynnikov, D. Rolfsen, B. Wiest, Ordering Braids, Mathematical Surveys and Monographs vol. 148, Amer. Math. Soc. (2008).\n[11] P. Dehornoy & L. Paris, Gaussian groups and Garside groups, two generalizations of Artin groups,\nProc. London Math. Soc. 79-3 (1999) 569–604.\n[12] T. Dubrovina and N. Dubrovin, On braid groups, Sb. Math. 192 (2001) 693-703.\n[13] T. Ito, Dehornoy-like left-orderings and isolated left-orderings, arXiv:1103.4669.\n[14] T. Ito, Construction of isolated left-orderings via partially central cyclic amalgamation,\narXiv:1107.0545.\n[15] A.I. Kokorin, V.M. Kopyutov, and N.Ya. Medvedev, Right-Ordered Groups, Plenum Publishing Corporation (1996).\n[16] A. Navas, On the dynamics of (left) orderable groups, Ann. Inst. Fourier 60 (2010) 1685–1740.\n[17] A. Navas, A remarkable family of left-ordered groups: central extensions of Hecke groups, J. Algebra\n328 (2011) 31-42.\n[18] M. Picantin, Petits groupes gaussiens, Thèse de doctorat, Université de Caen (2000).\n[19] J.H. Remmers, On the geometry of positive presentations, Advances in Math. 36 (1980) 283–296.\n[20] C. Rivas, Left-orderings on free products of groups, J. Algebra; 350; 2012; 318–329.\n[21] A.S. Sikora, Ceilingology on the spaces of orderings of groups, Bull. London Math. Soc. 36 (2004)\n519–526.\n[22] V. Tararin, On the theory of right orderable groups, Matem. Zametki 54 (1993) 96–98. Translation to\nenglish in Math. Notes 54 (1994), 833–834.\nLaboratoire de Mathématiques Nicolas Oresme, UMR 6139 CNRS, Université de Caen, 14032\nCaen, France\nE-mail address: dehornoy@math.unicaen.fr\nURL: //www.math.unicaen.fr/∼dehornoy\n\n\f"}