{"id": "http://arxiv.org/abs/0708.2237v1", "guidislink": true, "updated": "2007-08-16T16:09:29Z", "updated_parsed": [2007, 8, 16, 16, 9, 29, 3, 228, 0], "published": "2007-08-16T16:09:29Z", "published_parsed": [2007, 8, 16, 16, 9, 29, 3, 228, 0], "title": "A generation-based particle-hole density-matrix renormalization group\n  study of interacting quantum dots", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0708.2660%2C0708.3449%2C0708.1177%2C0708.0925%2C0708.3244%2C0708.3966%2C0708.2597%2C0708.3790%2C0708.3852%2C0708.2434%2C0708.1391%2C0708.2072%2C0708.1293%2C0708.0407%2C0708.2100%2C0708.2980%2C0708.0780%2C0708.0300%2C0708.0783%2C0708.3351%2C0708.3024%2C0708.1925%2C0708.0707%2C0708.3769%2C0708.2607%2C0708.4109%2C0708.0527%2C0708.2237%2C0708.3324%2C0708.2484%2C0708.2657%2C0708.3661%2C0708.0162%2C0708.0066%2C0708.1919%2C0708.1513%2C0708.2616%2C0708.2746%2C0708.2849%2C0708.3636%2C0708.4135%2C0708.3721%2C0708.0078%2C0708.1954%2C0708.4381%2C0708.0871%2C0708.2604%2C0708.3746%2C0708.1483%2C0708.2386%2C0708.1466%2C0708.1155%2C0708.3588%2C0708.0632%2C0708.3482%2C0708.1063%2C0708.1596%2C0708.3340%2C0708.2867%2C0708.2173%2C0708.3372%2C0708.2656%2C0708.0951%2C0708.3787%2C0708.0151%2C0708.3891%2C0708.3655%2C0708.3379%2C0708.3988%2C0708.2280%2C0708.0754%2C0708.3504%2C0708.2996%2C0708.1880%2C0708.0635%2C0708.0246%2C0708.1345%2C0708.1289%2C0708.0594%2C0708.0693%2C0708.2692%2C0708.0444%2C0708.0636%2C0708.4302%2C0708.3844%2C0708.0001%2C0708.3073%2C0708.3811%2C0708.0268%2C0708.2872%2C0708.1138%2C0708.3116%2C0708.0952%2C0708.2926%2C0708.0588%2C0708.0079%2C0708.0274%2C0708.4156%2C0708.3483%2C0708.3941%2C0708.3936&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A generation-based particle-hole density-matrix renormalization group\n  study of interacting quantum dots"}, "summary": "The particle-hole version of the density-matrix renormalization-group method\n(PH-DMRG) is utilized to calculate the ground-state energy of an interacting\ntwo-dimensional quantum dot. We show that a modification of the method, termed\ngeneration-based PH-DMRG, leads to significant improvement of the results, and\ndiscuss its feasibility for the treatment of large systems. As another\napplication we calculate the addition spectrum.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0708.2660%2C0708.3449%2C0708.1177%2C0708.0925%2C0708.3244%2C0708.3966%2C0708.2597%2C0708.3790%2C0708.3852%2C0708.2434%2C0708.1391%2C0708.2072%2C0708.1293%2C0708.0407%2C0708.2100%2C0708.2980%2C0708.0780%2C0708.0300%2C0708.0783%2C0708.3351%2C0708.3024%2C0708.1925%2C0708.0707%2C0708.3769%2C0708.2607%2C0708.4109%2C0708.0527%2C0708.2237%2C0708.3324%2C0708.2484%2C0708.2657%2C0708.3661%2C0708.0162%2C0708.0066%2C0708.1919%2C0708.1513%2C0708.2616%2C0708.2746%2C0708.2849%2C0708.3636%2C0708.4135%2C0708.3721%2C0708.0078%2C0708.1954%2C0708.4381%2C0708.0871%2C0708.2604%2C0708.3746%2C0708.1483%2C0708.2386%2C0708.1466%2C0708.1155%2C0708.3588%2C0708.0632%2C0708.3482%2C0708.1063%2C0708.1596%2C0708.3340%2C0708.2867%2C0708.2173%2C0708.3372%2C0708.2656%2C0708.0951%2C0708.3787%2C0708.0151%2C0708.3891%2C0708.3655%2C0708.3379%2C0708.3988%2C0708.2280%2C0708.0754%2C0708.3504%2C0708.2996%2C0708.1880%2C0708.0635%2C0708.0246%2C0708.1345%2C0708.1289%2C0708.0594%2C0708.0693%2C0708.2692%2C0708.0444%2C0708.0636%2C0708.4302%2C0708.3844%2C0708.0001%2C0708.3073%2C0708.3811%2C0708.0268%2C0708.2872%2C0708.1138%2C0708.3116%2C0708.0952%2C0708.2926%2C0708.0588%2C0708.0079%2C0708.0274%2C0708.4156%2C0708.3483%2C0708.3941%2C0708.3936&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The particle-hole version of the density-matrix renormalization-group method\n(PH-DMRG) is utilized to calculate the ground-state energy of an interacting\ntwo-dimensional quantum dot. We show that a modification of the method, termed\ngeneration-based PH-DMRG, leads to significant improvement of the results, and\ndiscuss its feasibility for the treatment of large systems. As another\napplication we calculate the addition spectrum."}, "authors": ["Yuval Weiss", "Richard Berkovits"], "author_detail": {"name": "Richard Berkovits"}, "author": "Richard Berkovits", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.ssc.2007.12.031", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0708.2237v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0708.2237v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "6 pages, 6 figures and a table", "arxiv_primary_category": {"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0708.2237v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0708.2237v1", "journal_reference": "Solid State Commun. 145, 585 (2008)", "doi": "10.1016/j.ssc.2007.12.031", "fulltext": "arXiv:0708.2237v1 [cond-mat.dis-nn] 16 Aug 2007\n\nA generation-based particle-hole density-matrix renormalization\ngroup study of interacting quantum dots\nYuval Weiss ∗ Richard Berkovits\nThe Minerva Center, Department of Physics, Bar-Ilan University, Ramat-Gan 52900, Israel\n\nAbstract\nThe particle-hole version of the density-matrix renormalization-group method (PH-DMRG) is utilized to calculate\nthe ground-state energy of an interacting two-dimensional quantum dot. We show that a modification of the method,\ntermed generation-based PH-DMRG, leads to significant improvement of the results, and discuss its feasibility for\nthe treatment of large systems. As another application we calculate the addition spectrum.\nKey words: A. Quantum dots; A. Disordered systems; D. Electron-electron interactions\nPACS: 71.55.Jv; 72.15.Rn; 71.10.Fd\n\n1. Introduction\nRecently there is a growing interest in the lowtemperature physics of disordered many-particle\nsystems, such as electron dephasing due to interactions [1] and the two-dimensional (2D) 'metalinsulator' transition [2]. Transport properties\nthrough quantum dots (QDs) have also been recently investigated and shown to exhibit interesting behavior in the presence of both interactions\nand disorder [3]. An analytical treatment of these\nproblems is unfortunately difficult, since both the\ndisorder and the interactions cannot be considered\nas a small perturbation. Exact numerical methods\nfor these problems are restricted to small systems,\nsince the size of the many-particle Hilbert space\ngrows exponentially with the system size.\nDuring recent years, several methods were used to\ndecrease the Hilbert space to a size which is computationally feasible. One way is to define an iterative\norder in which the system is treated, and use a smart\n∗ Corresponding author\nEmail address: weissy@mail.biu.ac.il (Yuval Weiss).\nPreprint submitted to Elsevier\n\ntruncation method between the iterations to reduce\nthe space size. This is the idea behind the ensemble of renormalization group methods, such as the\nnumerical renormalization group (NRG) [4] and the\ndensity-matrix renormalization group (DMRG) [5].\nA different approach uses a predefined constraint\nin order to truncate. Thus, the entire system may\nbe treated at once, yet not all the system states\nare taken into account. Therefore, the matrix size\none needs to diagonalize is smaller than the entire Hilbert space dimension, and hopefully small\nenough to be exactly solved. For example, one can\napproximate the ground state (GS) energy of a\nsystem by considering only part of the single-level\neigenstates. A sorted list of the eigenstates can be\nobtained by performing a self-consistent HartreeFock (HF) calculation, after which the eigenvectors\nwith the highest eigenvalues are neglected [6]. Such\nstates should, intuitively, have the smallest contribution to the many-particle GS energy.\nAnother suggestion is based on the localization\nof the Fock space. Since the interaction term is a\ntwo-body operator, only many-body states which\ndiffer by at most two electron-hole pairs are cou18 November 2018\n\n\fand t is the hopping matrix element between NNs\nwhich is conventionally taken as the energy unit.\nIn the interaction terms, V is the NN interaction\nstrength, Vc is the Coulomb interaction in a distance\nof one lattice unit, and |rm − rn | is the distance between sites m and n, measured in lattice units.\nThe GS energy of the system is calculated using\nthe PH-DMRG method [8]. A detailed description\nof the specific implementation can be found elsewhere [9]. The general idea of the method is to divide the HF single-particle energy levels to those\nabove (particle-states) and below (hole-states) EF ,\nand then treat these states iteratively. Starting from\nthe vacuum state, in which all levels below EF are\nfilled, and all the others are empty, in each iteration one particle-state and one hole-state are added,\nstarting from EF and proceeding in both directions.\nThe superblock is composed of the states already\nadded, by maintaining the number of particles constant. The superblock diagonalization is followed by\na truncation of the Hilbert space of both the particle\nblock and the hole block, using their corresponding\ndensity matrices. The iteration ends, and a new couple of states can be added again. The process stops\nafter all of the states were added.\nThe accuracy of the PH-DMRG method depends\nmostly on the number of states, p, that are kept between successive iterations. In other words, in each\niteration, p eigenvectors of the density matrix are\ntaken, while all the others are neglected. Except\nthe accuracy, p influences dramatically the computational resources required during the process.\nIn order to compare the PH-DMRG method to\nother approximations we define the error rate, or the\ndiscrepancy, as D(x) = |x′ − x|/|x|, where x is an\nexact quantity and x′ is an approximation for x. By\ncalculating D̄(EGS ), averaging over different realizations of the disorder, one thus has a good estimate\nabout the accuracy of the approximation method.\n\npled by the Hamiltonian. It was shown [7] that\nthe average contribution of a state containing k\nelectron-hole pairs to the exact GS is proportional\nto exp(−k/ξF ), where ξF is the Fock space localization length. Considering also the number of \u0001states\n\u0001\nne\ne\nin the k-th electron-hole generation, N −n\nk\nk ,\nwhere ne is the number of electrons and N is the\nnumber of single-particle states, one finds [6] that\nthe weight of generations falls off exponentially as\nlong as ξF−1 > ln[(N − ne )ne /(k + 1)2 ]. Thus one\ncan consider in the approximated Hamiltonian only\nstates with a small number of particle-hole (PH)\npairs.\nIn the following we denote these global truncation\nmethods as energy-truncation (ET) and generationtruncation (GT). For a full discussion of both see\nRef. [6].\nUnfortunately, one cannot simply implement\nthese global truncation methods for larger systems.\nAs the size of the system increases, the number of\nenergy states or PH generations, for a given cutoff,\nincreases, and thus the matrix size increases exponentially, and it soon becomes too large to be solved\nexactly. Therefore, an alternative method is needed,\nwhich can give an accurate approximation to the\nGS energy, yet can be extended to larger systems.\nIn the following we show that a generation-based\nPH-DMRG method is suitable for that task.\n\n2. Model\nWe model the QD as a 2D disordered lattice occupied by ne spinless electrons. Hopping between\nnearest neighbors (NNs), and either NN or Coulomb\ninteractions are considered. Therefore, the Hamiltonian can be written as Ĥ = Ĥ0 + Ĥint , where\nX\nX\n(â†m ân + H.c.),\n(1)\nĤ0 =\nǫm â†m âm − t\nm\n\nhm,ni\n\nand Ĥint is one of the terms\nX\n(NN)\nâ†m â†n ân âm ;\nĤint = V\n\n3. Ground-State Energy Calculation\n(2)\n\nIn order to examine the accuracy of the PHDMRG method we investigate the case of a 4 × 6\nlattice with a disorder strength W = 5t, with the\nsame disorder ensemble used in Ref. [6]. In this\nsection we restrict ourselves to the case of NN interactions, with strength V = 3t, and use ne = 10.\nTypical results, for a specific realization, are\nshown in Fig. 1(a) (circles), as a function of p, the\nnumber of block states kept. The results are com-\n\nhm,ni\n\n(C)\n\nĤint =\n\nVc\n1 X\nâ† â† ân âm .\n2\n|rm − rn | m n\nm6=n\n\nHere, â†m and âm denote creation and annihilation\noperators of an electron in lattice site m, h* * * i represents NNs, ǫm is the on-site energy of site m, chosen\nrandomly from a uniform distribution [−W/2, W/2],\n2\n\n\fpared to the HF results, to the results of the ET\nmethod, in which the lowest 18 HF states were\nused, and to those of the GT method, in which up\nto 3 PH generations were kept. The exact results\nare also drawn. As p increases, the PH-DMRG\napproximation improves.\nAveraging over realizations (Fig. 1(b) (circles))\nshows that the average accuracy of the PH-DMRG\ncalculation improves very slowly by increasing p.\nThe best PH-DMRG results shown (for keeping 80\nstates) gets closer to the exact GS than the ET\nmethod, yet the GT method is much more accurate.\n\nPH-DMRG truncation method. In essence, the main\ndifference between the DMRG and NRG methods,\nis the truncation algorithm. In the NRG method,\nthe truncation of states is based on their energies,\nwhile in the DMRG it is based on the density-matrix\neigenvalues. The density-matrix eigenvectors with\nthe highest eigenvalues are considered as the most\nimportant, and the rest of the states are neglected.\nNevertheless, this difference is not the main reason for the DMRG success. This success originates\nfrom the fact that while the NRG truncation method\nis based only on the sites which were already iteratively added, the DMRG algorithm is influenced by\nadditional sites included in the superblock. The superblock is composed of a \"system\" coupled to an\n\"environment\", which represents all the sites which\nwere not yet included in the iteration process, and\nthus the truncation is based on extrapolation, which\nleads to better results.\nOn the other hand, the superblock in the PHDMRG does not consider any \"future\" states.\nThe PH-DMRG process couples only the current\nparticle-states and hole-states, but other states are\nnot part of the superblock. Therefore, the truncation does not take them into account, and this\nlimits its success.\nIn order to improve the truncation decision we\nsuggest to improve the PH-DMRG method by taking into account the number of PH generations as an\nextra condition taken during the truncation step. As\nwe have discussed above, the idea of the Fock space\nlocalization indicates that the weight of successive\nPH generations decreases exponentially. Therefore,\none expects that among states belonging to a given\niteration, those with a smaller number of PH generations are more important.\nIn order to incorporate this criterion into the\ndensity-matrix truncation process, we retain all\nstates which contain less than k PH generations in\nthe first round. If there are too many such states,\nwe use the density-matrix eigenvalues, and take\nthe states with the highest eigenvalues. After this\nfirst round, if there is still a room for more states,\nwe retain also states with f > k, according to\ntheir density-matrix eigenvalues, until the maximal\nnumber of states p is reached.\nFor the 4 × 6 system with 10 electrons, we've executed the suggested truncation method for k =\n0, 1, 2, 3, 4, and for each realization picked the lowest energy. It turns out, however, that in 95 percents\nof the samples the k = 2 case is the most accurate,\nso that using a constant k = 2 would lead to sim-\n\n-12.9\n\nHartree-Fock\n-13.07\n-12.95\n\n-13.08\n\nEGS\n\n-13.09\n-13\n\n-13.1\n\n80\n\n60\n\n100\n\n120\n\n140\n\nEnergy-Truncation\n-13.05\n\nGeneration-Truncation\n-13.1\n\nExact GS Energy\n0\n\n50\n\np\n\n100\n\n150\n\n0.05\n\nHartree-Fock\n\nD(EGS)\n\n0.04\n\nPH-DMRG\nGPH-DMRG\n\n0.03\n\nEnergy-Truncation\n0.02\n\nGeneration-Truncation\n0.01\n\n0\n\n0\n\n50\n\np\n\n100\n\nFig. 1. PH-DMRG results for the GS energy calculation as\na function of p (regular version - circles, generation-based\nversion - crosses), compared to various approximated results\n(see text). (a) The GS energy of a specific realization. Inset: zoom into the region of p ≥ 60. (b) The discrepancy\n′\nD̄(EGS ) = h|EGS\n−EGS |/|EGS |i averaged over an ensemble\nof 100 realizations.\n\nThe comparison between the PH-DMRG results\nand those of the GT method raise the following question: Can one improve the PH-DMRG process without increasing p? In the following we present such\nan improvement, motivated by an analysis of the\n3\n\n\f0.1\n\nD(EGS)\n\nilar results. These results are also shown in Fig. 1\n(crosses). As can be clearly seen, the results obtained\nby the improved method, termed generation-based\nPH-DMRG (GPH-DMRG), are better by almost 30\npercents than the regular PH-DMRG results, and\nare comparable to the results of the GT method of\nRef. [6].\n\n0.01\n\nShort Range\n\n0.001\n\nD(EGS)\n\n0.01\n\n0.001\n\n4. Long-range interactions; Strong\ninteractions\n\nLong Range\n0.0001\n\nThe results of the previous section were obtained\nfor short-range interactions. In the framework of the\nreal-space DMRG method there is a huge impact\nwhen the interaction range increases. The DMRG iterations add subsequent sites one after another, and\nif long-range interactions are considered, much more\ndata should be stored from previous steps. Practically, therefore, real-space DMRG applications traditionally consider only short-range interactions.\nOn the other hand, the interactions range does\nnot affect the GPH-DMRG method almost at all. It\ndoes of course change the self consistent HF stage,\nhowever, the entire iterations process, which is the\nmost taxing stage of the GPH-DMRG algorithm,\nremains the same. Thus, one may ask what effect\ndoes the interactions range have on the GPH-DMRG\naccuracy. A related question is how the accuracy is\nchanged when the interactions become stronger.\nIn Fig. 2 we present the discrepancy between the\nexact GS and the one obtained by the GPH-DMRG\nfor short-range (upper panel) and long-range (lower\npanel) interactions. Both strong (filled symbols) and\nintermediate (empty symbols) interaction strengths\nare considered. Since these results were obtained for\nlattices with 6 electrons, i.e., the number of holestates is small, the accuracy of both the HF approximation and the GPH-DMRG method is better than\nin the previous section. However, the results show\nthat for both interaction types the GPH-DMRG accuracy is reduced when the interaction strength is\nenhanced.\nA striking feature is the difference in the discrepancy between the short-range and the long-range interactions. For small values of p, the improvement\nin accuracy of the long-range case is explained by\nthe fact that the HF approximation is better. Nevertheless, the improvement of the long-range results\nby the GPH-DMRG method is fascinating (D̄ for\nVc = 3t is reduced by two orders of magnitude), and\nthe averaged discrepancy (for Vc = 3t with p = 90\n\n0\n\n20\n\n40\n\np\n\n60\n\n80\n\nFig. 2. The discrepancy D̄(EGS ) obtained by the\nGPH-DMRG calculation as a function of the number of\nstates kept, for an ensemble of 4 × 6 disordered lattices\noccupied by 6 electrons. The accuracy is compared between short-range (upper panel) and long-range (lower\npanel) interactions, and between intermediate interactions\nstrength (V = Vc = 3t, empty symbols) and a strong one\n(V = Vc = 10t, filled symbols). The solid (dashed) lines\nshow the results of the HF approximation for strong (intermediate) interactions. Note the semi-log scale.\n\nstates) is ∼ 10−4 , more than an order of magnitude\nbetter than the accuracy in the short-range case.\n5. Addition Spectrum Calculation\nAs a useful application of the GPH-DMRG we calculate the addition spectrum of a QD, and compare\nthe discrepancy to that of the HF approximation.\nThe addition spectrum can be defined by\n∆2 = EGS (ne ) − 2EGS (ne − 1) + EGS (ne − 2). (3)\nTherefore, for a calculation of ∆2 one needs the GS\nenergies of 3 successive electron numbers for each\nrealization, and we choose the ensemble of 4×6 samples used in the previous sections, occupied by 4, 5\nand 6 electrons, with NN or Coulomb interactions.\nIn general, the results are better in the Coulombic\ncase, because of a higher accuracy for each energy\ncalculation.\nIn Fig. 3 the results for the averaged discrepancy\nof ∆2 are presented. The HF approximation obtains,\nfor Coulomb interactions, D̄(∆2 ) ≈ 1.7 percents.\nThe GPH-DMRG method, even with a very small\nnumber of states (p ≥ 30), exhibits an improvement\nof the error rate by more than an order of magnitude,\nto a level of ∼ 0.13 percents.\nHowever, in the NN case the results are quite\npoor. The starting point of the GPH-DMRG algorithm, i.e., the HF results, give an average error of\nalmost 20 percents. The GPH-DMRG improves it\n4\n\n\fsummarized in Table 1. The ratio between the HF\ndiscrepancy and that of the GPH-DMRG is shown\nin parentheses.\n0.1\n\n0.1\n\nNN\n\nD(∆2)\n\nShort Range\n\n0.01\n\nD̄(∆2 )\n\n0.01\n\nLong Range\n\nCoulomb\n\n0.054314 (3.6) 0.001330 (12.6)\n\nD(h∆2 i) 0.000965 (55.1) 0.000352 (16.0)\n0.001\n\n0.001\n0\n\n10\n\n20\n\n30\n\n40\n\np\n\n50\n\nD(δ∆2 ) 0.055554 (3.4) 0.007794 (9.2)\n\n60\n\nTable 1\nGPH-DMRG error rates for ∆2 calculation\n\nFig. 3. The averaged discrepancy D̄(∆2 ) obtained by the\nGPH-DMRG calculation, for NN (dashed line and circles)\nand Coulomb (solid line and diamonds) interactions. The\nGPH-DMRG results are shown in a semi-log scale as a function of p (symbols), together with the HF results (lines).\n\nIt is easy to see that for Coulomb interactions the\nGPH-DMRG improves all results related to the addition spectrum by an order of magnitude, and leads\nto error rates of less than 1 percent for all cases. However, for the NN interactions, a small error rate and\na significant improvement are seen only for h∆2 i,\nwhile modest factors are obtained for D̄(∆2 ) and\nδ∆2 , with error rates larger than 5 percents.\n\nby a factor of 4, to the order of 5 percent, which is\nstill a very high error rate. It is thus interesting to\ncheck whether the calculation of h∆2 i and δ∆2 =\nq\n\u00012\n∆2 − ∆2 are more accurate. These results are\nshown in Fig. 4.\n\n6. Discussion\n0.01\n\n0.01\n\n0.001\n\n0.001\n\n0.0001\n\nD(<∆2>)\n\n0.1\n\n0.0001\n\n0\n\n10\n\n20\n\n30\n\np\n\n40\n\n50\n\n60\n\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\n60\n\n0\n\n10\n\n20\n\n30\n\n40\n\n50\n\n60\n\np\n\n0.1\n0.07\n\n0.2\n\nD(δ∆2)\n\n1e-05\n\nIn the previous sections we have seen that with an\nimprovement of the truncation algorithm, the GPHDMRG method can be used for an accurate approximation of the GS energy in disordered systems with\ninteractions. In each of the cases we have checked,\nthe GPH-DMRG led to a significant improvement\nof the HF results. A comparison to the two methods\nof Ref. [6] shows that the GPH-DMRG error rate is\nbetter than that of the ET method, and is similar\nto that of the GT one.\nNevertheless, for a full comparison one must also\nconsider the feasibility of these methods when larger\nsystems are treated. To understand the difference\nbetween the methods, we compare the matrix sizes\nfor the case considered in section 3. The ET, based\non 18 energy levels, and the GT, with up to 3 PH\ngenerations, require the diagonalization of matrices\nof sizes 43, 758 and 47, 916, respectively. The largest\nsuperblock Hamiltonian in the GPH-DMRG process, for p = 120, is of size 13, 494.\nWhen a larger lattice is studied, and in order to\nget the same accuracy as for the small system, the\nET and GT methods must include more levels and\ngenerations. Even was it sufficient to take the same\nnumber of levels and generations as in the small case,\nthe size of matrices would have grown exponentially\n\n0.1\n0.01\n\n0.05\n0.03\n\n0\n\n10\n\n20\n\n30\n\np\n\n40\n\n50\n\n60\n\n0.004\n\np\n\nFig. 4. The GPH-DMRG results for the discrepancy of h∆2 i\n(filled symbols) and δ∆2 (empty symbols) of the 4×6 systems\noccupied by 4, 5 and 6 electrons with either NN (circles) or\nCoulomb (squares) interactions. The lines correspond to the\nHF results.\n\nAs can be seen, the results for h∆2 i are very accurate for both interaction types, even for very small p.\nNotice that the results continue to fluctuate around\nthe exact result, since the approximation for ∆2 is\ndone using 3 different GS approximations, which\nhave different convergence rates. However, for p ≥\n30, the error is less than 0.1 percent in both cases.\nThe results of δ∆2 , on the other hand, show slow\nconvergence. The error rates obtained by the GPHDMRG (using p = 60) for the different cases are\n5\n\n\fwith the lattice size. Therefore, these methods become infeasible even for modest lattice sizes. In the\nGPH-DMRG method, on the other hand, the size\nof the matrix depends on the block size, and not on\nthe system size. Nevertheless, for larger systems, the\nnumber of single-particle states is larger, and the\ndiscrepancy of the GPH-DMRG is expected to increase, unless p is increased. Therefore, the matrix\nsize being diagonalized is expected to increase in the\nGPH-DMRG method as well.\nThe dependence of the largest matrix size needed\nto be diagonalized in the GPH-DMRG process,\nMmax , on p, is shown in Fig. 5. Although for large\nvalues of p, a linear dependence was proposed [10],\nfrom our results a power law Mmax ∼ p1.89 seems\nmore appropriate. In any case, it is clear that the\nmatrix size is less than quadratic in p. Furthermore, since the largest matrix size used in our\ncurrent GPH-DMRG application is still much below the technology limit, its increase should not\nbe impossible. It is thus clear that in principle the\nGPH-DMRG is capable of treating larger systems.\n\nReferences\n[1] I. L. Aleiner, B. L. Altshuler and M. E. Gershenson,\nWaves Random Media 9, 201 (1999).\n[2] E. Abrahams, S. V. Kravchenko and M. P. Sarachik,\nRev. Mod. Phys. 73, 251 (2001).\n[3] Y. Alhassid, Rev. Mod. Phys. 72, 895 (2000).\n[4] K. G. Wilson, Rev. Mod. Phys. 47 773 (1975).\n[5] S. R. White, Phys. Rev. B 48, 10345 (1993); U.\nSchollwöck, Rev. Mod. Phys. 77, 259 (2005).\n[6] R. Berkovits, Solid State Commun. 127, 725 (2003).\n[7] B. L. Altshuler, Y. Gefen, A. Kamanev and L. S. Levitov,\nPhys. Rev. Lett. 78, 2803 (1997).\n[8] J. Dukelsky, S. Pittel, S. S. dimitrova and M. V. Stoitsov,\nPhys. Rev. C 65, 054319 (2002); J. Dukelsky and S.\nPittel, Rep. Prog. Phys. 67, 513 (2004).\n[9] Y. Weiss, Ph.D. dissertation, Bar-Ilan University, Israel\n(2007).\n[10] S. S. Dimitrova, S. Pittel, J. Dukelsky and M. V.\nStoitsov, in The DMRG method for realistic large-scale\nnuclear shell-model calculations, Proceedings of the 21st\nworkshop on nuclear theory, edited by V. Nikolaev\n(Heron Press, 2002); arXiv:nucl-th/0207025.\n[11] P. N. Walker, G. Montambaux and Y. Gefen, Phys. Rev.\nB 60, 2541 (1999).\n\n15000\n\nMmax\n\n10000\n\n5000\n\n0\n\n0\n\n50\n\np\n\n100\n\n150\n\nFig. 5. The maximal size of the superblock Hamiltonian\nneeded to be diagonalized, for the case of section 3. The\ndashed line is a linear fit of the p > 80 points, while the solid\nline is a power law fit in the entire range.\n\nAs a final remark we note that the addition spectrum of disordered QDs with interactions is a longstanding question in mesoscopic physics. Specifically, the behavior of δ∆2 for strong interactions is\nnot completely understood. A comprehensive study\nof this question was performed a few years ago using the self-consistent HF method [11]. Based on\nour results, it may thus be relevant to re-examine\nthat question using the GPH-DMRG method.\nSupport from the Israel Academy of Science\n(Grant 877/04) is gratefully acknowledged.\n6\n\n\f"}