{"id": "http://arxiv.org/abs/1103.3905v2", "guidislink": true, "updated": "2011-03-31T16:15:32Z", "updated_parsed": [2011, 3, 31, 16, 15, 32, 3, 90, 0], "published": "2011-03-21T00:17:52Z", "published_parsed": [2011, 3, 21, 0, 17, 52, 0, 80, 0], "title": "Herschel-ATLAS: The link between accretion luminosity and star formation\n  in quasar host galaxies", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1103.0565%2C1103.3577%2C1103.2826%2C1103.6094%2C1103.6083%2C1103.0648%2C1103.4593%2C1103.2269%2C1103.3531%2C1103.4496%2C1103.1293%2C1103.6084%2C1103.1857%2C1103.5574%2C1103.1194%2C1103.0116%2C1103.5895%2C1103.6233%2C1103.4454%2C1103.4817%2C1103.5430%2C1103.3783%2C1103.3142%2C1103.2317%2C1103.4577%2C1103.2944%2C1103.3543%2C1103.2642%2C1103.4226%2C1103.2259%2C1103.6013%2C1103.3347%2C1103.2941%2C1103.2418%2C1103.0421%2C1103.0551%2C1103.5735%2C1103.1154%2C1103.4867%2C1103.4021%2C1103.1850%2C1103.3095%2C1103.3623%2C1103.4490%2C1103.1688%2C1103.4020%2C1103.1204%2C1103.5902%2C1103.2016%2C1103.4585%2C1103.2492%2C1103.0385%2C1103.2823%2C1103.1677%2C1103.4580%2C1103.0613%2C1103.0814%2C1103.1953%2C1103.3925%2C1103.2979%2C1103.4368%2C1103.5698%2C1103.4786%2C1103.0698%2C1103.6019%2C1103.3221%2C1103.1767%2C1103.2801%2C1103.3905%2C1103.6242%2C1103.3558%2C1103.6039%2C1103.3960%2C1103.4938%2C1103.1115%2C1103.5302%2C1103.6036%2C1103.5055%2C1103.3684%2C1103.5081%2C1103.4305%2C1103.2585%2C1103.1421%2C1103.1546%2C1103.1835%2C1103.0798%2C1103.5981%2C1103.4756%2C1103.6061%2C1103.1242%2C1103.3913%2C1103.0726%2C1103.1313%2C1103.3416%2C1103.0586%2C1103.0460%2C1103.3390%2C1103.3922%2C1103.2838%2C1103.3985%2C1103.3126&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Herschel-ATLAS: The link between accretion luminosity and star formation\n  in quasar host galaxies"}, "summary": "We use the science demonstration field data of the Herschel-ATLAS to study\nhow star formation, traced by the far-infrared Herschel data, is related to\nboth the accretion luminosity and redshift of quasars selected from the Sloan\nDigital Sky Survey and the 2SLAQ survey. By developing a maximum likelihood\nestimator to investigate the presence of correlations between the far-infrared\nand optical luminosities we find evidence that the star-formation in quasar\nhosts is correlated with both redshift and quasar accretion luminosity.\nAssuming a relationship of the form L_IR \\propto L_QSO^{\\theta} (1 +\nz)^{\\zeta}, we find {\\theta} = 0.22 +/- 0.08 and {\\zeta} = 1.6 +/- 0.4,\nalthough there is substantial additional uncertainty in {\\zeta} of order +/- 1,\ndue to uncertainties in the host galaxy dust temperature. We find evidence for\na large intrinsic dispersion in the redshift dependence, but no evidence for\nintrinsic dispersion in the correlation between L_QSO and L_IR, suggesting that\nthe latter may be due to a direct physical connection between star formation\nand black hole accretion. This is consistent with the idea that both the quasar\nactivity and star formation are dependent on the same reservoir of cold gas, so\nthat they are both affected by the influx of cold gas during mergers or heating\nof gas via feedback processes.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1103.0565%2C1103.3577%2C1103.2826%2C1103.6094%2C1103.6083%2C1103.0648%2C1103.4593%2C1103.2269%2C1103.3531%2C1103.4496%2C1103.1293%2C1103.6084%2C1103.1857%2C1103.5574%2C1103.1194%2C1103.0116%2C1103.5895%2C1103.6233%2C1103.4454%2C1103.4817%2C1103.5430%2C1103.3783%2C1103.3142%2C1103.2317%2C1103.4577%2C1103.2944%2C1103.3543%2C1103.2642%2C1103.4226%2C1103.2259%2C1103.6013%2C1103.3347%2C1103.2941%2C1103.2418%2C1103.0421%2C1103.0551%2C1103.5735%2C1103.1154%2C1103.4867%2C1103.4021%2C1103.1850%2C1103.3095%2C1103.3623%2C1103.4490%2C1103.1688%2C1103.4020%2C1103.1204%2C1103.5902%2C1103.2016%2C1103.4585%2C1103.2492%2C1103.0385%2C1103.2823%2C1103.1677%2C1103.4580%2C1103.0613%2C1103.0814%2C1103.1953%2C1103.3925%2C1103.2979%2C1103.4368%2C1103.5698%2C1103.4786%2C1103.0698%2C1103.6019%2C1103.3221%2C1103.1767%2C1103.2801%2C1103.3905%2C1103.6242%2C1103.3558%2C1103.6039%2C1103.3960%2C1103.4938%2C1103.1115%2C1103.5302%2C1103.6036%2C1103.5055%2C1103.3684%2C1103.5081%2C1103.4305%2C1103.2585%2C1103.1421%2C1103.1546%2C1103.1835%2C1103.0798%2C1103.5981%2C1103.4756%2C1103.6061%2C1103.1242%2C1103.3913%2C1103.0726%2C1103.1313%2C1103.3416%2C1103.0586%2C1103.0460%2C1103.3390%2C1103.3922%2C1103.2838%2C1103.3985%2C1103.3126&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We use the science demonstration field data of the Herschel-ATLAS to study\nhow star formation, traced by the far-infrared Herschel data, is related to\nboth the accretion luminosity and redshift of quasars selected from the Sloan\nDigital Sky Survey and the 2SLAQ survey. By developing a maximum likelihood\nestimator to investigate the presence of correlations between the far-infrared\nand optical luminosities we find evidence that the star-formation in quasar\nhosts is correlated with both redshift and quasar accretion luminosity.\nAssuming a relationship of the form L_IR \\propto L_QSO^{\\theta} (1 +\nz)^{\\zeta}, we find {\\theta} = 0.22 +/- 0.08 and {\\zeta} = 1.6 +/- 0.4,\nalthough there is substantial additional uncertainty in {\\zeta} of order +/- 1,\ndue to uncertainties in the host galaxy dust temperature. We find evidence for\na large intrinsic dispersion in the redshift dependence, but no evidence for\nintrinsic dispersion in the correlation between L_QSO and L_IR, suggesting that\nthe latter may be due to a direct physical connection between star formation\nand black hole accretion. This is consistent with the idea that both the quasar\nactivity and star formation are dependent on the same reservoir of cold gas, so\nthat they are both affected by the influx of cold gas during mergers or heating\nof gas via feedback processes."}, "authors": ["D. G. Bonfield", "M. J. Jarvis", "M. J. Hardcastle", "A. Cooray", "E. Hatziminaoglou", "R. J. Ivison", "M. J. Page", "J. A. Stevens", "G. de Zotti", "R. Auld", "M. Baes", "S. Buttiglione", "A. Cava", "A. Dariush", "J. S. Dunlop", "L. Dunne", "S. Dye", "S. Eales", "J. Fritz", "R. Hopwood", "E. Ibar", "S. J. Maddox", "M. J. Michałowski", "E. Pascale", "M. Pohlen", "E. E. Rigby", "G. Rodighiero", "S. Serjeant", "D. J. B. Smith", "P. Temi", "P. van der Werf"], "author_detail": {"name": "P. van der Werf"}, "author": "P. van der Werf", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1111/j.1365-2966.2011.18826.x", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1103.3905v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1103.3905v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "10 pages, accepted for publication in MNRAS (compared with v1, this\n  version has a very slightly expanded discussion of the comparison to other\n  work)", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1103.3905v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1103.3905v2", "journal_reference": null, "doi": "10.1111/j.1365-2966.2011.18826.x", "fulltext": "Mon. Not. R. Astron. Soc. 000, 1–10 (2010)\n\nPrinted 1 March 2018\n\n(MN LATEX style file v2.2)\n\narXiv:1103.3905v2 [astro-ph.CO] 31 Mar 2011\n\nHerschel -ATLAS: The link between accretion\nluminosity and star formation in quasar host galaxies⋆\nD. G. Bonfield1†, M. J. Jarvis1, M. J. Hardcastle1, A. Cooray2, E. Hatziminaoglou3,\nR. J. Ivison4,5, M. J. Page6, J. A. Stevens1, G. de Zotti7,8, R. Auld9, M. Baes10,\nS. Buttiglione7, A. Cava11, A. Dariush9,12, J. S. Dunlop5, L. Dunne13 , S. Dye9 ,\nS. Eales9, J. Fritz10, R. Hopwood14, E. Ibar4, S. J. Maddox13, M. J. Michalowski5,\nE. Pascale9, M. Pohlen9, E. E. Rigby13, G. Rodighiero7, S. Serjeant14,\nD. J. B. Smith13, P. Temi15, P. van der Werf5,16\n1 Centre\n\nfor Astrophysics Research, Science & Technology Research Institute, University of Hertfordshire, Hatfield, AL10 9AB, UK\nof Physics & Astronomy, University of California, Irvine, CA 92697, USA\n3 ESO, Karl-Schwarzschild-Str. 2, 85748 Garching bei München, Germany\n4 UK Astronomy Technology Centre, Royal Observatory, Edinburgh, EH9 3HJ, UK\n5 Scottish Universities Physics Alliance, Institute for Astronomy, University of Edinburgh, Royal Observatory, Edinburgh, EH9 3HJ, UK\n6 Mullard Space Science Laboratory, University College London, Holmbury St. Mary, Dorking, Surrey RH5 6NT, UK\n7 INAF – Osservatorio Astronomico di Padova, Vicolo Osservatorio 5, I-35122, Padova, Italy\n8 SISSA, Via Bonomea 265, I-34136 Trieste, Italy\n9 School of Physics & Astronomy, Cardiff University, Queen's Buildings, The Parade, Cardiff, CF24 3AA, UK\n10 Sterrenkundig Observatorium, Universiteit Gent, Krijgslaan 281 S9, B-9000 Gent, Belgium\n11 Instituto de Astrofı́sica de Canarias (IAC) and Departamento de Astrofı́sica de La Laguna (ULL), La Laguna, Tenerife, Spain\n12 School of Astronomy, Institute for Research in Fundamental Sciences (IPM), PO Box 19395-5746, Tehran, Iran\n13 Centre for Astronomy and Particle Theory, The School of Physics & Astronomy, Nottingham University, University Park Campus,\nNottingham, NG7 1HR, UK\n14 Department of Physics & Astronomy, The Open University, Walton Hall, Milton Keynes, MK7 6AA, UK\n15 Astrophysics Branch, NASA/Ames Research Center, MS 245-6, Moffett Field, CA 94035, USA\n16 Leiden Observatory, Leiden University, P.O. Box 9513, NL-2300 RA Leiden, The Netherlands\n2 Dept.\n\nReceived Month dd, yyyy; accepted Month dd, yyyy\n\nABSTRACT\n\nWe use the science demonstration field data of the Herschel-ATLAS to study how\nstar formation, traced by the far-infrared Herschel data, is related to both the\naccretion luminosity and redshift of quasars selected from the Sloan Digital Sky\nSurvey and the 2SLAQ survey. By developing a maximum likelihood estimator\nto investigate the presence of correlations between the far-infrared and optical\nluminosities we find evidence that the star-formation in quasar hosts is correlated\nwith both redshift and quasar accretion luminosity. Assuming a relationship\nof the form LIR ∝ LθQSO (1 + z)ζ , we find θ = 0.22 ± 0.08 and ζ = 1.6 ±\n0.4, although there is substantial additional uncertainty in ζ of order ±1, due\nto uncertainties in the host galaxy dust temperature. We find evidence for a\nlarge intrinsic dispersion in the redshift dependence, but no evidence for intrinsic\ndispersion in the correlation between LQSO and LIR , suggesting that the latter\nmay be due to a direct physical connection between star formation and black\nhole accretion. This is consistent with the idea that both the quasar activity\nand star formation are dependent on the same reservoir of cold gas, so that they\nare both affected by the influx of cold gas during mergers or heating of gas via\nfeedback processes.\nKey words: galaxies: active – galaxies: high-redshift – quasars: general\n\n⋆c\n\n2010 RAS\nHerschel is an ESA space observatory with science instru-\n\nments provided by European-led Principal Investigator consortia and with important participation from NASA\n\n\f2\n\nBonfield et al.\n1\n\n† Email (DGB): d.bonfield@herts.ac.uk\n\nINTRODUCTION\n\nAGN activity is now widely believed to be an important\nphase in the evolution of every massive galaxy in the\nUniverse. This belief stems firstly from the discovery of a\nrelatively tight correlation between the mass of a galaxy's\nbulge and the mass of its central supermassive black hole\n(SMBH; e.g. Magorrian et al. 1998; Ferrarese & Merritt\n2000; Gebhardt et al. 2000), which implies that buildup of the stellar mass and the SMBH mass are causally\nconnected (although see also Jahnke & Macciò 2010, who\nshow that averaging of parameters by mergers can also\nproduce such a correlation).\nFrom a more theoretical perspective, AGN have\nbecome a key ingredient for semi-analytic models of\ngalaxy formation (e.g. Benson et al. 2003; Cole et al.\n2000; Guiderdoni et al. 1998; Granato et al. 2001). The\nover-production of stars at the bright end of the galaxy\nluminosity function by these models has led to the inclusion of an extra source of heating or \"AGN feedback\" (see\ne.g. Bower et al. 2006; Croton et al. 2006; Granato et al.\n2004). However, it is still unclear what kind of AGNdriven feedback is the most important, e.g. two complementary mechanisms are described by Croton et al.\n(2006): \"quasar-mode\" feedback, proposed to be effective during episodes of efficient accretion of cold gas, and\n\"radio-mode\" feedback, caused by the relatively inefficient accretion of hot gas (in the absence of cold gas)\nwhen an AGN would have lower optical luminosity, but\nwould also be generating radio jets. Thus, it is now clear\nthat if we are to understand galaxy formation and evolution, we must also obtain a clear picture of AGN, their\nenvironments and the co-evolution of SMBHs and their\nhost galaxies.\nIt is difficult to study the host galaxies of distant quasars, due to the nuclear quasar emission overwhelming the stellar emission at optical and nearinfrared wavelengths. However, Hubble Space Telescope\nand high spatial-resolution ground-based imaging have\nenabled the investigation of the stellar populations of\nquasar hosts (e.g. Bahcall et al. 1994; McLure et al. 1999;\nDunlop et al. 2003; Kotilainen et al. 2009), demonstrating that most luminous quasars reside in massive elliptical galaxies. A number of studies have attempted\nto determine the star-formation properties of quasar\nhost galaxies, with some using optical colours (e.g.\nSánchez et al. 2004) or spectroscopy (e.g. Nolan et al.\n2001; Silverman et al. 2009; Trichas et al. 2010). Some\ninformation on the host galaxies of AGN has been\ngleaned from powerful radio galaxies, where the quasar\nnucleus is obscured due to the putative dusty torus (e.g.\nAntonucci 1993). Again these studies show that powerful AGN reside in massive galaxies (e.g. Jarvis et al.\n2001; McLure et al. 2004; Seymour et al. 2007) and there\nappears to be a trend where the most powerful exhibit\nsigns of recent star formation (e.g. Baldi & Capetti 2008;\nHerbert et al. 2010). However, optical colours and emission lines can be contaminated by the quasar, so that\nits contribution must be modelled to estimate the starformation rate, and all of these studies suffer from the\nuncertainty arising from having very little information\nabout how much star formation is obscured by dust, and\nc 2010 RAS, MNRAS 000, 1–10\n\n\fH-ATLAS: quasar hosts with Herschel\nthus how much of the emission due to young stars is reprocessed to far-infrared and sub-millimetre wavelengths.\nSpectroscopy with the Spitzer Space Telescope has\nenabled the determination of star-formation rates in individual AGN via mid-infrared emission lines, which\nare much less susceptible to dust, (e.g. Schweitzer et al.\n2006; Netzer et al. 2007; Martı́nez-Sansigre et al. 2008;\nLutz et al. 2008; Shi et al. 2009; Trichas et al. 2009;\nLutz et al. 2010). However, the relatively low sensitivity\nof Spitzer's infrared spectrograph (IRS) has meant that\nonly small, severely flux-limited samples of objects could\nbe investigated, making the precise relationship between\nstar-formation rate and quasar luminosity difficult to robustly determine.\n(Sub)millimetre instruments such as SCUBA and\nMAMBO have provided important information on reprocessed emission from star formation in distant quasars\nand radio galaxies, e.g. photometric surveys revealing luminous (∼ 1013 L⊙ ) far-infrared emission from a number\nof radio galaxies and quasar hosts, making it clear that\nmajor (SFR ∼ 1000M⊙ yr−1 ) episodes of star formation\ncan coexist with powerful AGN (e.g. Archibald et al.\n2001; Priddey et al. 2003; Omont et al. 2003; Page et al.\n2004; Martı́nez-Sansigre et al. 2009). Furthermore, submm imaging has revealed overdensities of sources in the\nvicinity of individual high-z AGN, plausibly belonging\nto the same large-scale structures (Stevens et al. 2003;\nPriddey et al. 2007; Stevens et al. 2010). Conversely,\ncross-correlating SCUBA data with deep X-ray surveys,\nAlexander et al. (2005) also show a large fraction of\nsub-mm galaxies contain buried AGN, while Laird et al.\n(2010) find that the X-ray AGN fraction in sub-mm\ngalaxies is 20–29 %.\nThe main drawback of the sub-mm studies to date\nis that, due to the high background associated with\nground-based observing and the small number of pixels in existing instruments, it has not been possible to\nobtain very large samples of objects. A recent study by\nSerjeant & Hatziminaoglou (2009, hereafter SH09) attempted to overcome this shortfall by combining data\nfrom a wealth of Spitzer and ISO observations at midand far-infrared wavelengths to investigate how obscured\nstar formation in the hosts of quasars evolved over cosmic time and also how this may be related to the bolometric output of the AGN. They found evidence for an\nincrease in far-infrared luminosity as a function of both\ncosmic epoch and quasar luminosity. However, they measured the correlation between far-infrared and quasar luminosity using wide redshift bins, which can potentially\nconfuse the effect of redshift with that of quasar luminosity, since the latter evolves strongly with redshift in fluxdensity-limited samples. In addition, their work extrapolated the far-infrared flux from mid-infrared wavelengths\nusing SED templates, and it would clearly be preferable\nto measure the far-infrared flux directly.\nThe recently-launched ESA Herschel space observatory (Pilbratt 2010) offers an unprecedented combination\nof sensitive detectors, large (3.5-metre diameter) collecting area, and low background, which makes it possible,\nfor the first time, to conduct deep surveys of large areas\nof the sky at far-infrared/sub-mm wavelengths.\nIn this paper we present a study of the far-infrared\nc 2010 RAS, MNRAS 000, 1–10\n\n3\n\nfluxes of known quasars in science demonstration observations of the Herschel Astrophysical Terahertz Large\nArea Survey (H-ATLAS; Eales et al. 2010). This is the\nfirst single sample of quasars measured in the sub-mm\nwhich is large and diverse enough to directly determine a\nrelationship between far-infrared (cool dust) luminosity\nand optical (quasar) luminosity, without using infrared\ninformation at wavelengths short enough to be possibly\ncontaminated by warm dust in the AGN torus. While\nSerjeant et al. (2010) determine a relationship between\noptical and far-infrared luminosity using this data in combination with infrared luminosities derived from shorterwavelength Spitzer and ISO data, here we use only the\nH-ATLAS data.\nSection 2 describes the H-ATLAS observations used.\nSection 3 explains how we construct our quasar sample, determine far-infrared fluxes for them, and find a\nmaximum-likelihood fit to the relationship between farinfrared luminosity, optical luminosity, and redshift. The\nresults of this fitting are discussed in Section 4 and conclusions are presented in Section5.\n\n2\n\nOBSERVATIONS\n\nWhen completed, H-ATLAS will provide photometry for\n550 square degrees of the sky in five far-infrared/submm bands. The 5-σ depths at wavelengths of 100, 160,\n250, 350, and 500 μm are 132, 126, 32, 36 and 45 mJy\nrespectively.\nIn this paper, we use only data from Herschel 's\nSPIRE instrument (Griffin et al. 2010), at 250, 350,\nand 500 μm, since the PACS 100 and 160 μm data\n(Poglitsch et al. 2010) are not deep enough to provide\nuseful constraints on the infrared luminosities of the\nquasars we are studying (Ibar et al. 2010). The longer\nSPIRE wavelengths are also less likely to be contaminated by direct emission from the warm dust of the AGN\ntorus. This means that the emission can be more reliably attributed to cool dust heated by star-formation\nprocesses, and its spectral energy distribution (SED) approximated by a simple greybody.\nThis paper is also restricted in area to the H-ATLAS\nscience demonstration (SD) field, which covers approximately 16 square degrees – around 3 per cent of the total\nsurvey area. This SD data has been publicly released, and\nboth the maps and catalogues can be retrieved from the\nH-ATLAS webpage1 .\n\n3\n\nMETHOD\n\nOur quasar sample consists of all objects in the field\nwhich are identified as quasars in the seventh data release of the SDSS Quasar Catalog (Schneider et al. 2010),\nor the 2dF-SDSS LRG (luminous red galaxy) and Quasar\nspectroscopic catalogue (2SLAQ; Croom et al. 2009). After removing the known blazar HB0906+015, since its\nfar-infrared emission will not be dominated by star formation (see e.g. González-Nuevo et al. 2010), we find 372\n1\n\nhttp://www.h-atlas.org\n\n\f4\n\nBonfield et al.\n\nquasars in the whole SV field, with a reasonably conservative cut on the area (by eye) to avoid using the noisier\ndata at the edges of the field.\nOf the 372 quasars, only 29 have matches to objects in the 5-σ H-ATLAS catalogue (Rigby et al. 2010;\nSmith et al. 2010). To improve our statistics, we measure fluxes directly from the SPIRE maps described by\nPascale et al. (2010) at the position of each quasar. To\ndo this, we take a point measurement of the flux in the\nnearest pixel to the SDSS position on each PSF-filtered\nand background-subtracted map.\nTo account for source confusion, the most likely flux\nfrom the object (which is used to produce Figure 2) is obtained by subtracting the mean pixel value in the map.\nHowever, when we perform a maximum-likelihood fit for\nthe coefficients of Equation 2, as described below, there\nis an implicit assumption that the measurement noise is\nsymmetric about zero. The confusion noise is very significantly skewed, and can cause false correlations to be\nfound in random data, so for the fluxes used in these fits\nwe symmetrise the noise distribution by subtracting the\nflux in a different randomly selected pixel from each flux\nmeasurement. This increases the overall noise level, so we\naverage the likelihoods from a number of random background realisations in order to reduce the noise level in\nthe final result.\nWe also construct a comparison sample of fluxes\ndrawn from random positions in the maps, with their\nbackgrounds subtracted in precisely the same way as\nthe real fluxes, and are then used to produce maximumlikelihood estimates in the same way as the real data.\nComparing these estimates with those from the real data\nallows us to increase our confidence that any trend detected in the data is due to the influence of the quasars,\nand not merely a result of the noise properties of the\nmaps, which have a significant impact due to our inclusion of individual noisy objects instead of using binned\ndata.\nTo compare the AGN luminosity of the quasars with\nthat from star formation, we make the assumption that\nthe optical light is dominated by the AGN, while the farinfrared/sub-mm is dominated by the cool dust heated\nby star formation. This latter assumption is consistent\nwith the results of Hatziminaoglou et al. (2010), who\nfit models with AGN and star-formation contributions\nto the mid- and far-infrared emission from AGN hosts\nand find that star formation dominates the far-infrared\nfluxes. Their result depends on the assumption that the\ndusty torus heated directly by an AGN has a fairly simple, approximately toroidal geometry, as described by\nFritz et al. (2006). The infrared SEDs of AGN can, however, be fully reproduced by more complex clumpy torus\nmodels (e.g. Nenkova et al. 2008), so, at least until these\nmodels are tested by high-spatial-resolution imaging of\nAGN tori, we cannot completely rule out the possibility of a contribution to far-infrared fluxes from dust\nheated directly by the AGN. However, the fact that\nHatziminaoglou et al. (2010) find that the SPIRE colours\nof AGN are indistinguishable from those of normal galaxies suggests that the AGN does not make a strong direct\ncontribution at these wavelengths.\nAll of the quasars have spectroscopic redshifts from\n\nFigure 1. Absolute i-band magnitudes (calculated as described in the text) for our sample of spectroscopically confirmed quasars, plotted as a function of redshift. Objects with\nspectra from SDSS are shown as black diamonds; those with\n2SLAQ spectra have red squares.\n\ntheir respective surveys, and optical photometry in the\nugriz bands from the SDSS (York et al. 2000). We use\nthese data to estimate the quasar luminosity, following Schneider et al. and others in using the absolute iband magnitude, Mi , as a proxy for the luminosity of\nthe central engine. This is calculated from the observed\ni magnitude (after the subtraction of Galactic extinction) and the redshift, by assuming a power-law SED\n(Sν ∝ ν α ) with spectral index α = −0.5 and assuming a ΛCDM cosmology with Ωm = 0.3, ΩΛ = 0.7, and\nH0 = 70 km s−1 Mpc−1 . Figure 1 shows the distribution\nof optical luminosities of our sample as a function of\nredshift, indicating the source of the spectroscopic redshift (SDSS or 2SLAQ, or both). From this we can see\nthat the 2SLAQ measurements in this field allow the\ninclusion of quasars at least one magnitude fainter (at\nz < 3) than the SDSS spectroscopic survey probes. This\ngreater range in optical luminosity is crucial for decoupling optical luminosity and redshift, and gives our study\nan advantage over similar work by Hatziminaoglou et al.\n(2010). We note, however, that the range of bolometric\nluminosities spanned by our quasar sample is 1045 erg\ns−1 < Lbol < 1048 erg s−1 , so all of the objects are firmly\nin the quasar (as opposed to Seyfert) regime. Thus, if\nthere are two \"modes\" of accretion with different feedback properties, this study will only be relevant to understanding the \"quasar mode\", making it usefully complementary to the work of Shao et al. (2010), which uses\ndifferent Herschel data to probe the star-formation rates\nin lower-luminosity X-ray-selected AGN.\nAs mentioned earlier, the SPIRE photometry at 250,\n350, and 500 μm is unlikely to be contaminated by the\nAGN directly for even the higher redshift quasars in the\nsample, and is deeper than the H-ATLAS PACS photomc 2010 RAS, MNRAS 000, 1–10\n\n\fH-ATLAS: quasar hosts with Herschel\n\nFigure 2. Estimated total infrared luminosities (calculated\nby integrating the best-fitting greybody with T = 30 K and\nβ = 1.5 over the 8–1000 μm wavelength range) for our sample\nof spectroscopically confirmed quasars, plotted as a function of\nredshift. Objects with spectra from SDSS are shown as black\ndiamonds; those with 2SLAQ spectra have red squares. Error\nbars are plotted where LIR is greater than the uncertainty\nin the estimate, otherwise 1-σ upper limits are shown using\narrows.\n\netry (Ibar et al. 2010), so we use only the SPIRE fluxes to\nconstrain the overall infrared luminosity. To make the results directly comparable with each other, we fit a simple\nisothermal grey dust model, with flux density\nSν ∝ ν (3+β) /(ehν/kT ) − 1)\n\n(1)\n\nwhere h and k are Planck's and Boltzmann's constants,\nν is rest-frame frequency, and where we assume fixed values for both temperature T = 30 K and β = 1.5. We then\nintegrate the greybody curve between rest-frame wavelengths of 8 and 1000 μm to obtain an estimate of LIR .\n(This wavelength range is chosen for convenience and for\ncomparison with other studies, and is not intended to\nimply that the cold dust represented by the greybody\ndominates the SED at wavelengths as short as 8 μm.)\nWe estimate the uncertainty on LIR by increasing it until the χ2 value for the fit to the data increases by unity.\nSince we include far-infrared flux measurements at\nour quasar positions regardless of whether there is a significant detection in the far-infrared, fitting the normalisation of a fixed template is the only robust measurement\npossible. This procedure does not account for the possibility of dust temperature or emissivity evolution either\nwith redshift or quasar luminosity, which may well be important effects to consider. However, we are able to use\nthe well-detected objects in our sample to address the\nsuitability of our choice of T and β.\nTo check our choice of greybody temperature, we fit\ngreybody SEDs to the SPIRE fluxes of individual quasars\nwith good detections (signal-to-noise > 3) in all three\nc 2010 RAS, MNRAS 000, 1–10\n\n5\n\nSPIRE bands, with β fixed at 1.5 and T allowed to vary.\nThe best-fitting temperatures for eight out of the nine\nwell-detected quasars were very similar, with mean 32.4\nK and a standard deviation of 2.8 K, while one outlier\n+14.0\nK. The eight quasars span\nfits a temperature of 58.5−7.5\na redshift range of 1.1 < z < 2.3 and a range in infrared\nluminosity (estimated by integrating the greybody between 8 and 1000 μm) of 6 × 1012 < LIR /L⊙ < 2 × 1013 .\nThey are consistent with the temperatures of galaxies as\na whole as determined by Amblard et al. (2010), who find\na mean temperature of 28 ± 8 K for galaxies detected at\na significance of 3-σ in the H-ATLAS SDP field, and a\nmean temperature of 30 ± 9 K for a compilation of galaxies in H-ATLAS and a number of other far-infrared surveys. This consistency is unsurprising, since Elbaz et al.\n(2010) also found (using deeper data from Herschel ) that\nthe dust temperatures of radio-quiet AGN hosts were not\nsignificantly different from the normal galaxy population.\nThus we consider that a temperature T = 30 K is likely\nto be a reasonable choice for our quasar sample, but is\nnot completely certain, and we return to this point later.\nThe outlying object has substantial uncertainties\non its temperature, so we do not consider it an indication of a serious problem with our use of a single\ntemperature for all objects. However, the fact that it\nis at a higher redshift (z = 3.4) and slightly higher\nluminosity (LIR /L⊙ = 3 × 1013 ) than the other objects means that it is broadly consistent with the evolution of dust temperature, to higher temperatures at\nhigher redshifts and luminosities, seen in several previous studies (Chapman et al. 2005; Kovács et al. 2006;\nMichalowski et al. 2010; Amblard et al. 2010) and others.\nWe do not attempt to use a luminosity- or redshiftdependent dust temperature in this work. Increasing the\ndust temperature serves to shift the greybody peak to\nshorter wavelengths, which would result in a higher luminosity fit to our data (which are mostly longward of\nthe peak). Thus, if the temperature of the dust in quasar\nhosts does increase with redshift and/or luminosity, then\nwe will systematically underestimate LIR for objects at\nhigh redshift and LIR . However, since the trend in mean\ntemperature found by Amblard et al. is weak compared\nwith the dispersion around the relation, we do not expect\nthis to be a very significant effect.\nTo get an indication of the effect of temperature (and\nits uncertainty) on the parameters we derive, we perform\nfits to all objects using both T = 30 K and T = 45 K,\nwhere we have selected 45 K because it has a similar peak\nwavelength to the average z > 4 quasar SED constructed\nby Priddey & McMahon (2001) (who find parameters of\nT = 41 ± 5 with β = 1.95 ± 0.3). We also note that,\nwhile β may not in fact be 1.5, the luminosity estimates\nobtained using β = 2 (using the best-fitting temperature\nat this β) differ by less than 1 per cent, so we consider\nthat the selection of a value of β is broadly degenerate\nwith the choice of T , at least for the purpose of estimating\ninfrared luminosity from SPIRE fluxes.\nFollowing SH09, we assume that the dependence of\nthe infrared luminosity on the optical quasar luminosity\nand redshift can be expressed as power laws, i.e.:\nLIR,model = A LθQSO (1 + z)ζ\n\n(2)\n\n\f6\n\nBonfield et al.\n\nwith intrinsic (Gaussian) dispersion in θ and ζ of ∆θ and\n∆ζ respectively.\nUnlike Serjeant & Hatziminaoglou, who stack infrared data to look for trends in bins of redshift and\noptical luminosity, we fit for the power law coefficients\nof equation (2), and the normalisation A, by finding the\npeak in the likelihood distribution calculated over all data\nsimultaneously. Our approach has the substantial disadvantage that variations in the power laws as a function\nof redshift or luminosity will be hidden from us. However, under the assumption that the values of ζ and θ are\nthe same at all redshifts and luminosities, our method\nenables us to make the most sensitive possible determination of these parameters, since we do not lose information through binning. Additionally, we are immune to the\npotentially confusing effects of correlations within bins.\nWe incorporate the dispersions ∆θ and ∆ζ by combining them with the uncertainty σi on each datapoint. The likelihood, Prob(data|θ, ζ, ∆θ, ∆ζ, A) at a\ngiven point in parameter space is then given by\n2\n\nProb(data|θ, ζ, ∆θ, ∆ζ, A) =\n\nY\ni\n\ne−χi /2\n(3)\n2\n2\n2π(σi2 + σθ,i\n+ σζ,i\n)\n\np\n\nwhere\nχ2i =\n\n(LIR,data,i − LIR,model,i )2\n,\n2\n2\nσi2 + σθ,i\n+ σζ,i\n\n(4)\n\nσθ,i = LIR,model,i ln LQSO,i ∆θ , and\n\n(5)\n\nσζ,i = LIR,model,i ln(1 + z) ∆ζ .\n\n(6)\n\nThe prior space on the parameters θ, ζ, ∆θ, ∆ζ, and\nA, over which the likelihood was evaluated, was chosen\niteratively to enclose more than 99.999 per cent of the\nlikelihood. The priors were linear in θ, ζ, ∆θ, and ∆ζ,\nand logarithmic in A, with the limits ∆θ > 0 and ∆ζ > 0.\n\n4\n\nRESULTS AND DISCUSSION\n\nFigure 3 shows the results of the likelihood evaluations,\nmarginalised over all parameters except the two shown in\neach panel. This is the result of averaging the likelihoods\nobtained in 17 random realisations of the background, as\ndescribed in Section 2. Contours labelled 1-σ, 2-σ, 3-σ,\nand 4-σ enclose 68.3, 95.4, 99.73, and 99.994 per cent of\nthe total likelihood. We show the results of fits assuming\nboth T = 30 K and T = 45 K to give an indication of\nthe way in which our uncertainty in T should contribute\nto the uncertainty in the derived parameters.\nThis figure shows that, assuming the dust in quasars\nhas a temperature T = 30 K, there is good evidence for\ncorrelations of LIR with both LQSO and z, since the maximum likelihood values of both θ and ζ are significantly\nnon-zero, and that while higher temperatures can mimic\nthe effect of the correlation with z, the correlation with\nLQSO is robust to simple changes in the overall dust temperature. For the T = 30 K case, the best-fitting values of\neach parameter, with their 68.3 per cent confidence limits (marginalising over all other parameters in each case)\nare:\n\nθ\n\n=\n\n0.22 ± 0.08\n\n(7)\n\nζ\n\n=\n\n1.6 ± 0.4\n\n(8)\n\n∆θ\n\n=\n\n∆ζ\n\n=\n\n0.08 ± 0.48\n0.08\n3.4 ± 0.9\n0.7\n\n(9)\n(10)\n\nAlthough, as can be seen in the lower left panel of\nFigure 3, there is some degeneracy between θ and ζ, our\ndata exclude θ = 0 at approximately the 2.5-σ level. The\n(flat) prior on θ allowed it to take values between -1.5\nand 1 (i.e. a much larger range than we show in Figure\n3), so we are confident that this is not simply an artefact\nof reaching the edge of the prior range.\nThe other panels of Figure 3 show that there is not\na strong degeneracy between any other parameters, so\nit is not possible to reproduce the effect of a correlation\nof LIR with either LQSO or z by simply increasing the\nintrinsic dispersion in the other parameter; indeed these\npanels suggest that approximately the same result would\nbe obtained if dispersion in the power law indices was\nignored altogether.\nWhile the figure shows that the detected evolution\nof LIR with redshift is very strongly dependent on the\nassumed value of T (although a temperature as high as\n45 K for the whole sample seems unlikely), the correlation\nwith LQSO seems to be robust to this uncertainty. We find\na slightly weaker index, θ, for the correlation with LQSO\nthan found by SH09, whose average result (θ = 0.44 ±\n0.07) is shown in figure 3 as the point with errorbars.\nThis may in part be due to the relatively large redshift\nbins (e.g. 0.5 < z < 1, 1 < z < 2) which were used in\nSH09, since, because of the strong degeneracy between\nθ and ζ, these could allow trends with redshift to affect\nobjects within a single bin. However, the disagreement is\nnot very significant.\nIn contrast, performing the same maximumlikelihood fit to data with far-infrared fluxes drawn from\nrandom positions in the maps (with the same position\nused at each wavelength, and the dust-fitting performed\nassuming a temperature of 30 K) we obtain the results\nshown in Figure 4. The important thing to note is that\nthe best-fitting value of θ is zero for the random flux case,\nindicating that the result we have obtained is not simply\ndue to the noise properties of the far-infrared maps, but\nrather is due to far-infrared flux genuinely associated with\nthe quasars. (Note that the non-zero value for ζ derived\nfrom the fit to random data is not unexpected, since the\nreal quasar luminosities and redshifts were still used in\nthis case, and these are themselves correlated.)\nUsing deeper far-infrared data from Herschel, but\nwith a narrower range in optical luminosity (because\nonly SDSS, and not 2SLAQ, quasars are available in\nthe field), Hatziminaoglou et al. (2010) find a very similar result, θ = 0.35, for objects at redshifts z > 2.\nSerjeant et al. (2010) use a compilation of H-ATLAS\nand other data to find a weakly declining correlation\nbetween LIR and quasar luminosity, parametrised as\nθ = (0.5875 ± 0.045) − (0.09275 ± 0.012) z for redshifts\n0 < z < 4, which is a slightly higher value of θ than we\nfind, but broadly consistent within the errors and at the\nredshifts we are sensitive to. Our value of θ is also consisc 2010 RAS, MNRAS 000, 1–10\n\n\fH-ATLAS: quasar hosts with Herschel\n\n7\n\nFigure 3. Likelihood contours for pairs of the parameters θ and ζ (from equation 2) and their intrinsic dispersions ∆θ and ∆ζ,\nmarginalised over the parameters not displayed in each panel. Contours labelled 1-σ, 2-σ, 3-σ, and 4-σ enclose 68.3, 95.4, 99.73,\nand 99.994 per cent of the total likelihood. The point with error bars in the lower left-hand panel shows the average values of\nθ and ζ, and their 1-σ uncertainties, determined by SH09 via stacking in the mid-infrared. Solid contours show a fit to objects\nassuming T = 30 K; dotted contours show a fit to the objects assuming T = 45 K.\n\ntent with the work by Silverman et al. (2009), who find\nθ = 0.28 ± 0.22 for the slope of the power law relating\n[Oii] luminosity (tracing star formation after correcting\nfor AGN contamination) to X-ray luminosity (tracing the\nAGN). Silverman et al. study a sample of AGN over a\nnarrower range of redshifts (0.5 < z < 1) and with somewhat lower luminosities than most of our sample (1044.3\n45.8\n<\nerg s−1 <\nerg s−1 , assuming a bolometric cor∼ Lbol ∼ 10\nrection Lbol /L2−10keV ∼ 30); the consistency of their\nresult with ours suggests that the relationship between\nLIR and LQSO may not vary with LQSO as suggested by\nLutz et al. (2010) and Shao et al. (2010). Their steeper\npower law, with a slope of 0.8, for luminous quasars is\nc 2010 RAS, MNRAS 000, 1–10\n\nnot directly comparable with our result as it does not\nseparate out the independent effect of redshift on LIR .\nHowever, we would also note that the quasar part of\nthis relationship is based on samples presented by Netzer\n(2009, and earlier works), which ignore AGN without detections in the far-infrared or mm, so that the observed\ncorrelation may be partly due to far-infrared flux limits.\nTo investigate whether our fit could be affected by a\nredshift-dependence in θ, we perform the maximum likelihood fitting again, using objects in restricted redshift\nranges where we have enough objects to make a robust\nmeasurement, and marginalise over all parameters except\nθ. The results of this are shown in Figure 5; the derived\n\n\f8\n\nBonfield et al.\n\nFigure 4. As Figure 3 but with infrared fluxes drawn from random positions in the maps rather than from the quasar positions,\nas a check that the noise properties in the maps are not responsible for the correlation we detect between LIR and LQSO .\n\nvalues of θ are not significantly different from each other\nfor redshifts 0.5 < z < 2.5, although the small number\nof objects in the redshift bins means we cannot make a\nstrong statement for or against evolution of θ as a function of redshift. However, the 0.5 < z < 1 range shows a\ndetection of non-zero θ at better than the 2-σ level, which\nis complementary to the result of Hatziminaoglou et al.\n(2010). While we do not have enough data to detect any\nsignificant decline in θ as a function of redshift, the datapoints in Figure 5 are consistent with the relation found\nby Serjeant et al. (2010), and with our smaller H-ATLASonly dataset we cannot rule out the existence of such a\nweak redshift dependence.\nSince the far-infrared luminosity LIR has been shown\nto be due to star formation (Hatziminaoglou et al. 2010),\nthe physical interpretation of these results is that star-\n\nformation rate is higher both as redshift increases and\nas quasar luminosity increases. As was also suggested by\nSH09, and as has been incorporated into the \"quasarmode\" feedback recipes of semi-analytic models (e.g.\nCroton et al. 2006), one of the simplest ways to interpret this is if both black hole accretion and star formation depend on a common supply of cold gas, as\nmight be supplied during a galaxy–galaxy merger or coldaccretion event (Dekel et al. 2009; Dijkstra & Loeb 2009;\nSmith & Jarvis 2007; Smith et al. 2008). The implication of the non-unity-slope is that the dependence of either star-formation or accretion luminosity (or both) on\nthe gas supply cannot simply be linear with gas mass, as\none might naı̈vely suppose, but is instead more complex.\nFor both star formation and black-hole accretion,\nsuch gas must be sufficiently cool that pressure support\nc 2010 RAS, MNRAS 000, 1–10\n\n\fH-ATLAS: quasar hosts with Herschel\n\n9\n\nduring mergers or cold accretion, or heating of gas via\nfeedback processes.\nWith the full 550 square degrees of the H-ATLAS\nsurvey, we will be able to substantially increase the sample of quasars and improve these constraints. The larger\narea will allow us to obtain representative samples of the\nobjects with the lowest density on the sky, i.e. quasars\nwith high luminosities at low redshift, which will increase\nthe sensitivity of our test at low redshifts and permit us to\nremove the assumption of power-law correlations and test\nmore general models. More importantly, a larger sample\nof objects at all redshifts will make it possible to measure\nthe temperatures of dust in quasar hosts as a function of\nLqso and redshift by stacking the far-infrared fluxes; this\nin turn will remove the largest source of uncertainty in\nthe relationship between LIR and z.\n\nACKNOWLEDGEMENTS\n\nFigure 5. Best-fitting values of θ based on maximumlikelihood fits using data in the redshift ranges denoted by\nthe widths of the errorbars. Black, solid errorbars are 68.3 per\ncent confidence limits; blue, dashed errorbars are 95.4 per cent\nconfidence limits.\n\ndoes not prevent it from being accreted by the AGN or\nfrom collapsing under its own gravity to form stars, so an\nalternative way to make this connection is via a mechanism (such as AGN or supernova feedback) which is capable of heating gas at all scales within a galaxy.\n\n5\n\nCONCLUSIONS\n\nUsing far-infrared measurements (at 250, 350 and\n500 μm) of SDSS and 2SLAQ quasars in the H-ATLAS\nscience demonstration field, we find evidence for correlations between the infrared luminosities of quasar hosts\nwith both redshift and quasar luminosity. While the bestfit power-law index for the correlation with redshift can\nvary significantly depending on the assumed temperature of the dust in the quasar hosts, the correlation with\nquasar luminosity is robust to this effect, and is nonzero at the 2.5-σ level when we combine all objects in a\nmaximum-likelihood fit.\nWe find a power-law index θ = 0.22 ± 0.08 for the\nrelationship between LIR and Lqso . Our data show that\nθ is non-zero at the 2-σ level in the 0.5 < z < 1 redshift\nrange alone, but we have too few objects to find evidence\nfor evolution in θ over the range 0.5 < z < 2.5.\nWe find evidence for a large intrinsic dispersion in the\nredshift dependence, but no evidence for intrinsic dispersion in the correlation between LQSO and LIR , suggesting\nthat the latter is due to a direct physical connection between star formation and black hole accretion. One possible interpretation of this is that both the quasar activity\nand star formation are dependent on the same reservoir\nof cold gas, and are thus both affected by influx of gas\nc 2010 RAS, MNRAS 000, 1–10\n\nMJJ acknowledges support from an RCUK fellowship.\nMJH thanks the Royal Society for a Research Fellowship.\nThe Herschel -ATLAS is a project with Herschel,\nwhich is an ESA space observatory with science instruments provided by European-led Principal Investigator\nconsortia and with important participation from NASA.\nThe H-ATLAS website is http://www.h-atlas.org/.\nFunding for the SDSS and SDSS-II has been provided by the Alfred P. Sloan Foundation, the Participating Institutions, the National Science Foundation,\nthe U.S. Department of Energy, the National Aeronautics and Space Administration, the Japanese Monbukagakusho, the Max Planck Society, and the Higher Education Funding Council for England. The SDSS Web Site\nis http://www.sdss.org/.\nThe SDSS is managed by the Astrophysical Research\nConsortium for the Participating Institutions. The Participating Institutions are the American Museum of Natural History, Astrophysical Institute Potsdam, University of Basel, University of Cambridge, Case Western\nReserve University, University of Chicago, Drexel University, Fermilab, the Institute for Advanced Study, the\nJapan Participation Group, Johns Hopkins University,\nthe Joint Institute for Nuclear Astrophysics, the Kavli\nInstitute for Particle Astrophysics and Cosmology, the\nKorean Scientist Group, the Chinese Academy of Sciences (LAMOST), Los Alamos National Laboratory, the\nMax-Planck-Institute for Astronomy (MPIA), the MaxPlanck-Institute for Astrophysics (MPA), New Mexico\nState University, Ohio State University, University of\nPittsburgh, University of Portsmouth, Princeton University, the United States Naval Observatory, and the University of Washington.\n\nREFERENCES\nAlexander D. M., et al., 2005, ApJ, 632, 736\nAmblard A., et al., 2010, A&A, 518, L9+\nAntonucci R., 1993, ARA&A, 31, 473\nArchibald E. N., Dunlop J. S., Hughes D. H., Rawlings\nS., Eales S. A., Ivison R. J., 2001, MNRAS, 323, 417\n\n\f10\n\nBonfield et al.\n\nBahcall J. N., Kirhakos S., Schneider D. P., 1994, ApJ,\n435, L11\nBaldi R. D., Capetti A., 2008, A&A, 489, 989\nBenson A. J., Bower R. G., Frenk C. S., Lacey C. G.,\nBaugh C. M., Cole S., 2003, ApJ, 599, 38\nBower R. G., et al., 2006, MNRAS, 370, 645\nChapman S. C., Blain A. W., Smail I., Ivison R. J.,\n2005, ApJ, 622, 772\nCole S., Lacey C. G., Baugh C. M., Frenk C. S., 2000,\nMNRAS, 319, 168\nCroom S. M., et al., 2009, MNRAS, 392, 19\nCroton D. J., et al., 2006, MNRAS, 365, 11\nDekel A., et al., 2009, Nature, 457, 451\nDijkstra M., Loeb A., 2009, MNRAS, 400, 1109\nDunlop J. S., McLure R. J., Kukula M. J., Baum S. A.,\nO'Dea C. P., Hughes D. H., 2003, MNRAS, 340, 1095\nEales S., et al., 2010, PASP, 122, 499\nElbaz D., et al., 2010, A&A, 518, L29+\nFerrarese L., Merritt D., 2000, ApJ, 539, L9\nFritz J., Franceschini A., Hatziminaoglou E., 2006, MNRAS, 366, 767\nGebhardt K., et al., 2000, ApJ, 539, L13\nGonzález-Nuevo J., et al., 2010, A&A, 518, L38+\nGranato G. L., De Zotti G., Silva L., Bressan A., Danese\nL., 2004, ApJ, 600, 580\nGranato G. L., et al., 2001, MNRAS, 324, 757\nGriffin M. J., et al., 2010, A&A, 518, L3+\nGuiderdoni B., Hivon E., Bouchet F. R., Maffei B., 1998,\nMNRAS, 295, 877\nHatziminaoglou E., et al., 2010, A&A, 518, L33+\nHerbert P. D., et al., 2010, MNRAS, 406, 1841\nIbar E., et al., 2010, MNRAS, accepted, arXiv:1009.0262\nJahnke K., Macciò A., 2010, ApJL, submitted,\narXiv:1006.0482\nJarvis M. J., et al., 2001, MNRAS, 326, 1585\nKotilainen J. K., Falomo R., Decarli R., Treves A.,\nUslenghi M., Scarpa R., 2009, ApJ, 703, 1663\nKovács A., et al., 2006, ApJ, 650, 592\nLaird E. S., Nandra K., Pope A., Scott D., 2010, MNRAS, 401, 2763\nLutz D., et al., 2008, ApJ, 684, 853\n-, 2010, ApJ, 712, 1287\nMagorrian J., et al., 1998, AJ, 115, 2285\nMartı́nez-Sansigre A., Lacy M., Sajina A., Rawlings S.,\n2008, ApJ, 674, 676\nMartı́nez-Sansigre A., et al., 2009, ApJ, 706, 184\nMcLure R. J., Kukula M. J., Dunlop J. S., Baum S. A.,\nO'Dea C. P., Hughes D. H., 1999, MNRAS, 308, 377\nMcLure R. J., et al., 2004, MNRAS, 351, 347\nMichalowski M., Hjorth J., Watson D., 2010, A&A, 514,\nA67+\nNenkova M., Sirocky M. M., Nikutta R., Ivezić Ž.,\nElitzur M., 2008, ApJ, 685, 160\nNetzer H., 2009, MNRAS, 399, 1907\nNetzer H., et al., 2007, ApJ, 666, 806\nNolan L. A., Dunlop J. S., Kukula M. J., Hughes D. H.,\nBoroson T., Jimenez R., 2001, MNRAS, 323, 308\nOmont A., et al., 2003, A&A, 398, 857\nPage M. J., Stevens J. A., Ivison R. J., Carrera F. J.,\n2004, ApJ, 611, L85\nPascale E., et al., 2010, MNRAS, submitted\nPilbratt G. L. a., 2010, A&A, 518, L1+\n\nPoglitsch A., et al., 2010, A&A, 518, L2+\nPriddey R. S., Gallagher S. C., Isaak K. G., Sharp R. G.,\nMcMahon R. G., Butner H. M., 2007, MNRAS, 374,\n867\nPriddey R. S., Isaak K. G., McMahon R. G., Robson\nE. I., Pearson C. P., 2003, MNRAS, 344, L74\nPriddey R. S., McMahon R. G., 2001, MNRAS, 324, L17\nRigby E., et al., 2010, MNRAS, submitted\nSánchez S. F., et al., 2004, ApJ, 614, 586\nSchneider D. P., et al., 2010, AJ, 139, 2360\nSchweitzer M., et al., 2006, ApJ, 649, 79\nSerjeant S., Hatziminaoglou E., 2009, MNRAS, 397, 265\nSerjeant S., et al., 2010, A&A, 518, L7+\nSeymour N., et al., 2007, ApJS, 171, 353\nShao L., et al., 2010, A&A, 518, L26+\nShi Y., Rieke G. H., Ogle P., Jiang L., Diamond-Stanic\nA. M., 2009, ApJ, 703, 1107\nSilverman J. D., et al., 2009, ApJ, 696, 396\nSmith D., et al., 2010, MNRAS, submitted,\narXiv:1007.5260\nSmith D. J. B., Jarvis M. J., 2007, MNRAS, 378, L49\nSmith D. J. B., Jarvis M. J., Lacy M., Martı́nez-Sansigre\nA., 2008, MNRAS, 389, 799\nStevens J. A., et al., 2003, Nature, 425, 264\n-, 2010, MNRAS, 405, 2623\nTrichas M., Georgakak is A., Rowan-Robinson M., Nandra K., Clements D., Vaccari M., 2009, MNRAS, 399,\n663\nTrichas M., et al., 2010, MNRAS, 405, 2243\nYork D. G., et al., 2000, AJ, 120, 1579\nThis paper has been typeset from a TEX/ LATEX file prepared by the author.\n\nc 2010 RAS, MNRAS 000, 1–10\n\n\f"}