{"id": "http://arxiv.org/abs/1203.1514v1", "guidislink": true, "updated": "2012-03-05T09:44:29Z", "updated_parsed": [2012, 3, 5, 9, 44, 29, 0, 65, 0], "published": "2012-03-05T09:44:29Z", "published_parsed": [2012, 3, 5, 9, 44, 29, 0, 65, 0], "title": "Strong interactions between g- and p-modes in the hybrid gamma\n  Doradus-delta Scuti CoRoT star ID105733033", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1203.3106%2C1203.3997%2C1203.2472%2C1203.6631%2C1203.3194%2C1203.1722%2C1203.5483%2C1203.0046%2C1203.5726%2C1203.4884%2C1203.1560%2C1203.2599%2C1203.2151%2C1203.2692%2C1203.6759%2C1203.3136%2C1203.0680%2C1203.4741%2C1203.4939%2C1203.4271%2C1203.1281%2C1203.2683%2C1203.5402%2C1203.5047%2C1203.2700%2C1203.6873%2C1203.3689%2C1203.2136%2C1203.6443%2C1203.6460%2C1203.1084%2C1203.3485%2C1203.1514%2C1203.4125%2C1203.2719%2C1203.6477%2C1203.0059%2C1203.4160%2C1203.2453%2C1203.1183%2C1203.4357%2C1203.5712%2C1203.2445%2C1203.0167%2C1203.5079%2C1203.0951%2C1203.2142%2C1203.5930%2C1203.0316%2C1203.5130%2C1203.2008%2C1203.1897%2C1203.1525%2C1203.4004%2C1203.0552%2C1203.6885%2C1203.5491%2C1203.5358%2C1203.5875%2C1203.6651%2C1203.6708%2C1203.0671%2C1203.6713%2C1203.3202%2C1203.0699%2C1203.6812%2C1203.2921%2C1203.1735%2C1203.3071%2C1203.1333%2C1203.2839%2C1203.6124%2C1203.0793%2C1203.6160%2C1203.1304%2C1203.4098%2C1203.3722%2C1203.4537%2C1203.3658%2C1203.4611%2C1203.3857%2C1203.1908%2C1203.1376%2C1203.5405%2C1203.5272%2C1203.2556%2C1203.1773%2C1203.0939%2C1203.2589%2C1203.4438%2C1203.4466%2C1203.5167%2C1203.3395%2C1203.0751%2C1203.4411%2C1203.4993%2C1203.0031%2C1203.3961%2C1203.6265%2C1203.5970%2C1203.0969&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Strong interactions between g- and p-modes in the hybrid gamma\n  Doradus-delta Scuti CoRoT star ID105733033"}, "summary": "CoRoT ID 105733033 is an excellent example of hybrid pulsators as it shows g-\nand p-modes with almost similar amplitudes in two clearly distinct frequency\ndomains.\n  Classical Fourier analysis allows the dectection of frequencies with an\namplitude as small as 0.1 mmag up to 50c/d. The frequency spectrum of CoRoT ID\n105733033 clearly consists of two distinct ranges, which are typical of gamma\nDoradus and delta Scuti pulsation. Focus was placed on the identification of\nlinear combinations and frequencies due to the coupling between gamma Doradus\nand delta Scuti modes.\n  We detect 198 gamma Doradus type frequencies in the range [0.25;4]c/d, of\nwhich 180 are not combination frequencies, and 24 of them are separated by a\nconstant period-interval Delta P=0.03074d. According to the asymptotic theory,\nthese 24 frequencies correspond to a series of g-modes of the same ell-degree\nand different radial orders n. We also detect 246 delta Scuti type frequencies\nin the range [10.1;63.4]c/d. The dominant frequency F=12.6759c/d was identified\nas the fundamental radial mode. Our most noteworthy result is that all the main\ngamma Doradus frequencies f_i are also detected in the delta Scuti domain as F\n+- f_i with four times smaller amplitudes. Once these frequencies were removed,\nonly 59 can be considered as individual delta Scuti frequencies.\n  A coupling between g- and p-modes is proposed to be a tool for detecting\ng-modes in the Sun, but this coupling has never yet been observed. Our present\nstudy may be valuable input to theoretical studies, addressing the mutual\ninfluence of g- and p-mode cavities and the deviation from classical theory.\nFurthermore, we identify a sequence of g-modes belonging to the same ell but\nwith consecutive orders n.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1203.3106%2C1203.3997%2C1203.2472%2C1203.6631%2C1203.3194%2C1203.1722%2C1203.5483%2C1203.0046%2C1203.5726%2C1203.4884%2C1203.1560%2C1203.2599%2C1203.2151%2C1203.2692%2C1203.6759%2C1203.3136%2C1203.0680%2C1203.4741%2C1203.4939%2C1203.4271%2C1203.1281%2C1203.2683%2C1203.5402%2C1203.5047%2C1203.2700%2C1203.6873%2C1203.3689%2C1203.2136%2C1203.6443%2C1203.6460%2C1203.1084%2C1203.3485%2C1203.1514%2C1203.4125%2C1203.2719%2C1203.6477%2C1203.0059%2C1203.4160%2C1203.2453%2C1203.1183%2C1203.4357%2C1203.5712%2C1203.2445%2C1203.0167%2C1203.5079%2C1203.0951%2C1203.2142%2C1203.5930%2C1203.0316%2C1203.5130%2C1203.2008%2C1203.1897%2C1203.1525%2C1203.4004%2C1203.0552%2C1203.6885%2C1203.5491%2C1203.5358%2C1203.5875%2C1203.6651%2C1203.6708%2C1203.0671%2C1203.6713%2C1203.3202%2C1203.0699%2C1203.6812%2C1203.2921%2C1203.1735%2C1203.3071%2C1203.1333%2C1203.2839%2C1203.6124%2C1203.0793%2C1203.6160%2C1203.1304%2C1203.4098%2C1203.3722%2C1203.4537%2C1203.3658%2C1203.4611%2C1203.3857%2C1203.1908%2C1203.1376%2C1203.5405%2C1203.5272%2C1203.2556%2C1203.1773%2C1203.0939%2C1203.2589%2C1203.4438%2C1203.4466%2C1203.5167%2C1203.3395%2C1203.0751%2C1203.4411%2C1203.4993%2C1203.0031%2C1203.3961%2C1203.6265%2C1203.5970%2C1203.0969&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "CoRoT ID 105733033 is an excellent example of hybrid pulsators as it shows g-\nand p-modes with almost similar amplitudes in two clearly distinct frequency\ndomains.\n  Classical Fourier analysis allows the dectection of frequencies with an\namplitude as small as 0.1 mmag up to 50c/d. The frequency spectrum of CoRoT ID\n105733033 clearly consists of two distinct ranges, which are typical of gamma\nDoradus and delta Scuti pulsation. Focus was placed on the identification of\nlinear combinations and frequencies due to the coupling between gamma Doradus\nand delta Scuti modes.\n  We detect 198 gamma Doradus type frequencies in the range [0.25;4]c/d, of\nwhich 180 are not combination frequencies, and 24 of them are separated by a\nconstant period-interval Delta P=0.03074d. According to the asymptotic theory,\nthese 24 frequencies correspond to a series of g-modes of the same ell-degree\nand different radial orders n. We also detect 246 delta Scuti type frequencies\nin the range [10.1;63.4]c/d. The dominant frequency F=12.6759c/d was identified\nas the fundamental radial mode. Our most noteworthy result is that all the main\ngamma Doradus frequencies f_i are also detected in the delta Scuti domain as F\n+- f_i with four times smaller amplitudes. Once these frequencies were removed,\nonly 59 can be considered as individual delta Scuti frequencies.\n  A coupling between g- and p-modes is proposed to be a tool for detecting\ng-modes in the Sun, but this coupling has never yet been observed. Our present\nstudy may be valuable input to theoretical studies, addressing the mutual\ninfluence of g- and p-mode cavities and the deviation from classical theory.\nFurthermore, we identify a sequence of g-modes belonging to the same ell but\nwith consecutive orders n."}, "authors": ["E. Chapellier", "P. Mathias", "W. W. Weiss", "D. Le Contel", "J. Debosscher"], "author_detail": {"name": "J. Debosscher"}, "author": "J. Debosscher", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361/201117540", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1203.1514v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1203.1514v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1203.1514v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1203.1514v1", "arxiv_comment": null, "journal_reference": null, "doi": "10.1051/0004-6361/201117540", "fulltext": "c ESO 2018\n\nAstronomy & Astrophysics manuscript no. article_fin\nNovember 10, 2018\n\nStrong interactions between g- and p-modes in the hybrid\nγ Doradus-δ Scuti CoRoT star ID 105733033 ⋆\nE. Chapellier1 , P. Mathias2,3 , W.W. Weiss4 , D. Le Contel1 , J. Debosscher5\n1\n\n2\n3\n\narXiv:1203.1514v1 [astro-ph.SR] 5 Mar 2012\n\n4\n5\n\nLaboratoire Lagrange, UMR7293, Université de Nice Sophia-Antipolis, CNRS, Observatoire de la Côte d'Azur, 06300\nNice, France\nUniversité de Toulouse; UPS-OMP; IRAP; F-65000 Tarbes, France\nCNRS; IRAP; 57, Avenue d'Azereix, BP 826, F-65008 Tarbes, France\nUniversity of Vienna, Institute for Astronomy, Türkenschanzstrasse 17, A-1180 Vienna, Austria\nInstituut voor Sterrenkunde, KU Leuven, Celestijnenlaan 200D, B-3001 Leuven, Belgium\n\nReceived date; accepted date\nABSTRACT\nContext. The presence of stellar p- and g-modes allows us to test stellar structure models in great detail from the core\nto the envelope. As the driving mechanisms are not yet fully understood, the first important step is to provide clear\nevidence of these pulsation modes.\nAims. Recent space missions have confirmed that the γ Doradus and the δ Scuti observational instability strips overlap\nand consequently that many stars may be hybrids. CoRoT ID 105733033 is an excellent example of these hybrid pulsators as it shows g- and p-modes with almost similar amplitudes in two clearly distinct frequency domains. We present\na detailed frequency analysis of the CoRoT star ID 105733033, which is obtained with a classical Fourier analysis.\nMethods. After removing residual instrumental effects from the CoRoT light curve of N2 level, frequencies with an\namplitude as small as 0.1 mmag were determined with Period04 and SigSpec up to 50 d−1 , although if deemed necessary lower amplitudes and higher frequencies were also investigated. The frequency spectrum of CoRoT ID 105733033\nclearly consists of two distinct ranges, which are typical of γ Doradus and δ Scuti pulsation. Focus was placed on the\nidentification of linear combinations and frequencies due to the coupling between γ Doradus and δ Scuti modes.\nResults. We detect 198 γ Doradus type frequencies in the range [0.25; 4] d−1 , of which 180 are not combination frequencies, and 24 of them are separated by a constant period-interval ∆P = 0.03074 d. According to the asymptotic theory,\nthese 24 frequencies correspond to a series of g-modes of the same l-degree and different radial orders n. We also detect\n246 δ Scuti type frequencies in the range [10.1; 63.4] d−1 . The dominant frequency F = 12.6759 d−1 was identified as the\nfundamental radial mode. Our most noteworthy result is that all the main γ Doradus frequencies fi are also detected\nin the δ Scuti domain as F ± fi with four times smaller amplitudes. Once these frequencies were removed, only 59 can\nbe considered as individual δ Scuti frequencies.\nConclusions. A coupling between g- and p-modes is proposed to be a tool for detecting g-modes in the Sun, but this\ncoupling has never yet been observed. Our present study may be valuable input to theoretical studies, addressing the\nmutual influence of g- and p-mode cavities and the deviation from classical theory. Furthermore, we identify a sequence\nof g-modes belonging to the same l but with consecutive orders n.\nKey words. stars: variables: γ Doradus – stars: variables: δ Scuti – asteroseismoloy – stars: oscillations – techniques:\nphotometric\n\n1. Introduction\nThe knowledge of solar and stellar interiors has improved tremendously in the past few decades due to both\ntheoretical work such as new opacity tables (Cox et al.,\n1992) for the destabilisation of β Cephei and SPB stars\nand the convection/pulsation coupling for γ Doradus stars\n(Guzik et al., 2000; Dupret et al., 2004), and new observing facilities such as the space missions CoRoT\n(Baglin et al., 2006), MOST (Walker et al., 2003), and\nKepler (Borucki et al., 1997; Christensen-Dalsgaard et al.,\n2008).\n⋆\nThe CoRoT space mission was developed and is operated by the French space agency CNES, with participation of\nESA's RSSD and Science Programmes, Austria, Belgium, Brazil,\nGermany, and Spain.\n\nUntil recently, δ Scuti and γ Doradus stars seemed to be\nclearly distinct, even if their respective instability strips\noverlap within a small region. A few hybrid star candidates have been identified e.g. by Henry & Fekel (2005),\nRowe et al. (2006), and Handler (2009). The hybrid stars\nhave become extremely interesting targets because p- and\ng-modes probe different regions of the stellar interiors. The\npresence of both types of modes in a same star provides\ncomplementary model constraints.\nWith the availability of space observations, considerably\nlower-amplitude pulsation modes have become detectable\ncompared with ground observations. The instability strips\n(IS) of δ Scuti and γ Doradus stars have been found to overlap and their respective hot and cool borders have become\nseemingly less well-defined. In addition, many CoRoT and\nKepler stars do not show in their pulsation spectra a clear\n1\n\n\fE. Chapellier et al.: interactions between g- and p-modes\n\ndistinction between their γ Doradus and δ Scuti-frequency\nregions.\nIn this paper, we discuss the very interesting case of\na star being unambiguously hybrid, with a frequency gap\nbetween 4 d−1 and 10 d−1 , and indications of strong interactions between the p- and g-modes. The data are described\nin Sect. 2, and the frequency analysis is presented in Sect. 3.\nThe frequency spectrum is discussed in Sect. 4 for the lowfrequency region (γ Doradus domain) and in Sect. 5 for the\nhigh-frequency region (δ Scuti domain). A theoretical interpretation of the interaction of the γ Doradus-δ Scuti modes\nis given in Sect. 5. The effects of the rotation are discussed\nin Sect. 6 and some conclusions are provided in Sect. 7.\n\n2. The CoRoT data\nThe observations of CoRoT ID 105733033 were collected\nduring CoRoT's second long run, LRc02, which targeted\nthe Galactic center. We used the reduced N2 light curves\n(Auvergne et al., 2009) throughout this paper. The observations lasted 145 days, from 2008, April 15th to September\n7th . Among the 388950 measurements obtained with a temporal resolution of 32 s, we retained only the 345908 points\nflagged '0' by the CoRoT pipeline, the other measurements\nbeing affected by instrumental effects such as straylight,\ncosmic rays, and perturbation by Earth eclipses.\nThe light curve is recorded in \"chromatic\" light i.e., in\nthree non-calibrated bands unevenly spanning the wavelength interval 370-950 nm, obtained by the insertion of a\nprism just in front of the exo-planet CCD. To increase the\nsignal-to-noise ratio (S/N), we added the three components\nof the colour bands to a \"white\" light curve. Unless specified otherwise, we refer in the following to the \"white\" light\ncurve.\nCoRoT data are known to be affected by several instrumental effects, such as long-term trends and jumps due to\ncosmic rays (Auvergne et al., 2009). In addition, many individual measurements can be considered as outliers. The\ndata of the most significant outliers (mainly high-flux data\npoints caused by cosmic ray impacts) were removed by an\niterative procedure during the Fourier analysis. Jumps were\ncorrected by applying simple vertical shifts to the data. The\nresulting light curve is represented at different timescales\nin Fig. 1 and clearly contains both low and high frequency\ncomponents. As noted by Balona et al. (2011) for other\nhigh amplitude γ Doradus stars, the light curve displays\nsometimes a Blazhko-like behaviour: the maxima vary far\nmore than the minima. This effect can also be observed for\nour star. In the following, the timescale is labeled in units\nof the CoRoT Julian day (JD), where the starting CoRoT\nJD corresponds to HJD 2445545.0 (2000, January 1st at UT\n12:00:00).\nInformation provided by the EXODAT database\n(Deleuil et al., 2009) indicates that the star has an A5V\nspectral type and magnitude V = 12.8. The conversion\nof the flux values to magnitudes of CoRoT ID 105733033\nis calibrated to a CoRoT magnitude of C = 12.543. The\nBEST survey of the LRc02 field classifies the star as a\npulsating star of SX Phoenicis type (Kabath et al., 2009)\nand 2MASS provides (J=11.445, H=11.205, K=11.094).\nThe CoRoT contamination factor is very small (1.7 %),\nhence we assume that the signal originates entirely from\nCoRoT ID 105733033.\n2\n\nFig. 1. Light curve of the star CoRoT ID 105733033 corrected for long-term trends, jumps, and outliers (see text)\nwith different timescales. From top to bottom, the complete\nlight curve over 145 d, then a subset over 22 d and finally a\nzoom into a 3.5 d subset.\n\n3. Frequency analysis of the CoRoT dataset\nThe frequency analysis was performed on the filtered data\nusing two independent methods: Period04 (Lenz & Breger,\n2005) and SigSpec (Reegen, 2007). We first used the\nPeriod04 package and searched the interval [0; 100] d−1 i.e.,\nwell below the Nyquist frequency. However, since the computations were very time-consuming, we limited our search\nmostly to the interval [0; 50] d−1, and explored the second\npart of the interval only every 50 newly detected frequencies. For each detected frequency, the amplitude and phase\nwere calculated by a least-squares sine fit. The data were\nthen prewhitened and a new analysis was performed on the\nresiduals. We did not use the option improve all, available\nin the Period04 package, which computes a multi-sine fit.\nFrom experience, it is known that the frequency differences\nderived from an individual least-squares sine fit relative to a\nmulti-sine fit, depend largely on the quality of the spectral\nwindow, which in our case of CoRoT is characterized by a\nvery high duty cycle. Tests have confirmed that differences\nsmaller than 0.001 d−1 are typical in our case of frequencies\nhigher than 0.05 d−1 , except in cases of a small-amplitude\nfrequency within a 1/∆T -bin close to a large amplitude one.\nOur analysis was conducted until a S/N=3.9 was reached,\nslightly below the usual S/N=4 value (Breger et al., 1993;\nKuschnig et al., 1997) and corresponding to an amplitude\nof about 0.1 mmag, which resulted in a detection of 559\nfrequencies.\n\n\fE. Chapellier et al.: interactions between g- and p-modes\n\nThe uncertainties in the frequencies, amplitudes, and\nphases were computed with the formulae proposed by\nMontgomery & O'Donoghue (1999) providing a 3σ estimate. However, as we used a step size of 1/20∆T in the\nFourier analysis, and since the accuracies of the frequencies were not improved by a multi-sine fit, the uncertainties\nin the frequencies are certainly no smaller than 1/40∆T .\nTherefore, the frequency uncertainties are 1/40∆T when\nthe aforementioned formal 3σ estimate is smaller. Some\nof the lowest frequencies are actually linked to instrumental fluctuations, which were not corrected by the reduction\npipeline. Once the 559 frequencies are removed, the periodogram of the residuals shows that some signal is still\npresent (Fig. 2) but mainly located in high-density peak\nregions, and many of the peaks are actually residuals of\npreviously detected frequencies.\nIn a next step, the frequency analysis was repeated by\napplying SigSpec to the data filtered with a cubic spline\nfunction to get rid of the main CCD variations. However,\nthis procedure also eliminated possible low-frequency pulsations. To be consistent with the Period04 results, the\nprogram was stopped after detecting 600 frequencies. The\nthreshold magnitude turned out to be about 0.08 mmag.\nThe results of the two methods agree fairly well. With\nSigSpec, we detected fewer low-frequencies since the data\nwere prewhitenened with a cubic spline, but some additional frequencies emerged with marginal amplitudes between 0.08 and 0.1 mmag. The main difference concerns the\nfrequency values derived by the two techniques, which can\namount sometimes to 0.004 d−1, but remains well within\nthe Rayleigh criterion of 0.007 d−1. As we needed consistency to detect couplings, we used Period04 in the following.\nThe next step consisted in the sorting of stellar and\nnon-stellar frequencies. As usual for CoRoT data, we eliminated both the frequencies corresponding to the orbital\nfrequency forb = 13.97 d−1 and its harmonics, and the\n2fsid = 2.0054 d−1 value due to the passage over the South\nAtlantic Anomaly, which occurs twice each sidereal day\n(Auvergne et al., 2009). Small-amplitude frequencies separated by 1/∆T from a large-amplitude frequency were ignored in the following as the effects of the spectral window\n(data set length).\nAs usual in the CoRoT data, variations in the properties of the CCD perturb the lowest part of the periodogram, so we decided to analyze only frequencies higher\nthan 0.25 d−1 . We made an exception of the low amplitude\nfrequency F144 = 0.2482 d−1 as it corresponds to the coupling f1 − f4 . We tested our 0.25d−1 limit in Sect. 5 and\nfound that it is realistic.\nAs a result, 444 frequencies were retained that have\nno clear instrumental origin (in Table 1, only the first\n25 frequencies are given here and the full table is only\navailable electronically, and in Fig 2). These frequencies can be divided into two main groups: 198 in the\ninterval [0.2483; 3.9936] d−1, corresponding to the typical γ Doradus frequency domain, and 246 in the interval [10.1038; 63.3800] d−1, which is typical of the δ Scuti\ndomain. No frequency with an amplitude larger than\n0.1 mmag was detected in the interval [4; 10] d−1 , except\nperhaps an isolated frequency f = 5.6038 d−1 with an amplitude of 0.09 mmag.\nThis clear distinction between low- and high-frequency\nregions may be the consequence of a quite low angular rota-\n\nFig. 2. Amplitude spectra computed with Period04 for the\n444 retained frequencies. From top to bottom: the amplitudes in μmag, and the same with a logarithmic scale, the\nFourier spectrum computed from the residuals, and the\nspectral window normalized to unity, but plotted only to\n0.1 in amplitude.\ntion velocity Ω. Following the rotation perturbation theory,\nthe observed frequencies are indeed shifted from the comoving frame ones by a quantity that is, to first order, proportional to Ω. Hence, in the case of rapid rotators, the \"observed\" frequency spectrum might differ significantly from\nthose measured in a \"co-rotating\" frame and the two frequency regions might even overlap. It is thus imperative to\nobtain a spectrum of this star, which allows us to measure\nv sini and estimate the rotation velocity Ω. Unfortunately,\nno spectroscopy is yet available for CoRoT ID 105733033.\nHowever, the clear gap between rather compact low- and\nhigh-frequency regions strongly argues in favor of a slow angular rotation, which we therefore predict. A low Ω would\nalso be consistent with a rotation period of 20.57 d, which\nis proposed by us in Sect. 6. In the following, we therefore\nassume that the observed frequencies do not differ significantly from the co-rotating ones.\n\n4. The γ Doradus domain\nFrom the Fourier analysis, we found 198 frequencies in the\nrange [0.2483; 3.9936] d−1, of which 176 were detected between 0.25 and 2.6 d−1 (Fig. 3). In the following, we renumbered the 198 frequencies in order of decreasing amplitude, starting from f1 . The main frequency is f1 =\n0.7428 d−1 with an amplitude A1 = 111.46 mmag. Data\nphased with this frequency are represented in Fig. 4. The\nshape of the curve is nearly sinusoidal, hence only 2f1 is\ndetected with an amplitude of 0.77 mmag.\n3\n\n\fE. Chapellier et al.: interactions between g- and p-modes\n\nTable 1. The first 25 stellar frequencies (the complete table is available electronically). The successive columns respectively correspond to the frequency detection order, its value and related S/N , amplitude, and phase. We also indicate\nthe new identification, the eventual linear combination, and finally the eventual n radial order (relative to f1 ) of the\nasymptotic g-modes.\nFrequency\nd−1\nF1\n12.6759\nF3\n0.7428\nF4\n0.6952\nF5\n25.3521\nF6\n0.9345\nF7\n0.9907\nF8\n0.9083\nF9\n0.9624\nF11\n0.7979\nF12\n0.8390\nF13 11.9335\nF14 13.4186\nF15\n1.1656\nF16 11.9807\nF17 13.3714\nF18 38.0279\nF19\n0.5279\nF20\n0.7262\nF22 11.7417\nF23\n0.8835\nF25\n0.6655\nF26 13.6104\nF28\n1.4380\nF29\n0.6786\nF30\n0.3659\n\nS/N\n1100.7\n453.1\n310.7\n298.7\n239.7\n167.8\n167.4\n165.4\n162.1\n145.0\n113.5\n108.3\n86.8\n76.2\n73.4\n70.8\n69.0\n65.2\n60.6\n60.3\n59.1\n56.0\n54.3\n54.3\n54.2\n\nA\nmmag\n27.077\n11.146\n7.642\n7.349\n5.896\n4.127\n4.118\n4.068\n3.988\n3.566\n2.792\n2.663\n2.136\n1.875\n1.805\n1.742\n1.697\n1.605\n1.491\n1.483\n1.454\n1.378\n1.335\n1.335\n1.333\n\nWe identified 17 cases in which a linear combination\nof detected γ Doradus frequencies coincide to within ∆ =\n0.001 d−1 with 17 other detected frequency (Table 2). This\n∆ refers to the uncertainty in the lowest amplitude frequencies (see Table 1).\nAnother interesting finding is the presence of coupling\nbetween p- and g-modes (see Sect. 5), where we found for\n82 % of the 50 candidates with the largest amplitudes a\nfrequency difference between coupled modes and observed\nfrequencies of less than 0.001 d−1 . On the other hand, in\nthe case of the 100 lowest amplitude g-modes (for which no\ncoupling is expected) we found in only 1.5 % of the possibilities a difference smaller than 0.001 d−1. We interpret this\nfinding as support of the chosen value of ∆=0.001 d−1. A\nfew expected combinations were not detected, e.g. f1 + f5 ,\nas they were masked by pulsation frequencies with higher\namplitudes (within a distance smaller than 1/∆T ). After\nelimination of harmonics and coupled frequencies, 180 independent frequencies of γ Doradus type were retained.\nIn the case of large radial numbers n, the first order\nasymptotic theory (Tassoul, 1980) predicts for g-modes of\nthe same degree l, a constant period spacing between consecutive radial orders n. Searching in Table 1 for equidistant γ Doradus periods, we found a series of 24 asymptotic\nones with a mean separation of ∆P = 0.03074 ± 0.00005 d\n(Fig. 5). The periods extend from 0.693 d to 1.593 d with the\nhighest concentration being between 1.009 d and 1.439 d. In\nthis region, we detected 15 consecutive and equidistant periods among the 18 possible. Most of them have relatively\nlarge amplitudes, and are indeed among the largest amplitude g-mode frequencies detected. Further away from the\n4\n\nΦ\nrad\n2.259\n0.564\n1.752\n0.277\n3.932\n3.319\n1.604\n3.683\n3.713\n6.123\n5.642\n4.104\n1.735\n4.814\n3.970\n4.804\n0.657\n3.151\n2.099\n6.217\n0.456\n1.123\n3.424\n2.761\n4.255\n\nIdent.\nF\nf1\nf2\n2F\nf3\nf4\nf5\nf6\nf7\nf8\nF − f1\nF + f1\nf9\nF − f2\nF + f2\n3F\nf10\nf11\nF − f3\nf12\nf13\nF + f3\nf14\nf15\nf16\n\nLinear\ncomb.\n–\n–\n–\n–\n–\n–\n–\n–\n–\n–\n–\n–\n–\n–\n–\n–\n–\n–\n–\n–\n–\n–\nf1 + f2\n–\n–\n\nn\n–\n0\n3\n–\n-9\n-11\n-8\n-10\n-3\n-5\n–\n–\n–\n–\n–\n–\n–\n1\n–\n-7\n5\n–\n–\n–\n–\n\nTable 2. Linear combinations of frequencies detected in the\nγ Doradus domain. Columns are respectively the label of\nthe frequency from Table 1 together with its new label, the\nlinear combination, and the differences between the linear\ncombination and the actually measured values for Period04\nand SigSpec [×10−5 d−1 ].\nFrequency\nF28\nF40\nF47\nF55\nF89\nF110\nF256\nF57\nF470\nF358\nF218\nF346\nF83\nF286\nF134\nF412\nF122\nF144\n\nf14\nf20\nf23\nf27\nf51\nf58\nf112\nf28\nf175\nf149\nf97\nf146\nf47\nf123\nf68\nf165\nf62\nf71\n\nCombination\nf1 + f2\nf1 + f3\nf1 + f4\nf1 + f7\nf1 + f8\nf1 + f10\nf1 + 2f3\n2f1\n2f1 + f2\n2f1 + f5\n2f1 + f7\n2f1 + f9\nf2 + f5\nf2 + f9\nf2 + f10\n2f2 + f3\nf3 + f4\nf4 − f1\n\n∆ Period04\n[10−5 d−1 ]\n4\n39\n73\n-31\n66\n-35\n70\n-31\n-64\n4\n5\n66\n73\n33\n68\n75\n2\n35\n\n∆ SigSpec\n[10−5 d−1 ]\n13\n372\n-26\n30\nnot detected\n88\n123\n157\n19\n194\n-194\n127\n17\n377\n-48\n-36\n68\n343\n\ncentral region, the amplitudes decrease, but we detected 9\nother periods fitting the sequence. Several values are missing in the asymptotic series probably owing to their low\n\n\fE. Chapellier et al.: interactions between g- and p-modes\n\nFig. 3. Enlargement of Fig. 2 [second] showing the detected\nfrequencies in the γ Doradus domain. The ordinates are on\na logarithmic scale.\n\nFig. 5. Plot of the frequencies detected in the interval\n[0.4;1.8] d−1. \"Positive\" amplitude frequencies represent the\nidentified asymptotic frequency series, while the \"negative\"\nones are the other detected frequencies in this interval.\nTable 3. List of the asymptotic frequencies. Columns are\nrespectively the label of the frequency from Table 1 together\nwith its γ Doradus label, the corresponding period value\n[d], the related amplitude [mmag], and the order n of the\npulsation mode (arbitrarily shifted to n = 0 for the main\nfrequency f1 ).\n\nFig. 4. Data phased with the main γ Doradus frequency\nf1 = 0.7428 d−1.\n\namplitudes. The 24 retained periods correspond to n-values\nranging from −23 to +8, with the largest amplitude period\nP1 = 1.3470 d (f1 = 0.7428 d−1) being arbitrarily taken as\norder zero. The sequence is listed in Table 3 and illustrated\nin Fig. 6.\n\nFrequency\nF163 f79\nF313 f130\nF191 f88\nF365 f150\nF339 f144\nF296 f126\nF70\nf36\nF7\nf4\nF9\nf6\nF6\nf3\nF8\nf5\nF23\nf12\nF207 f93\nF12\nf8\nF42\nf22\nF11\nf7\nF82\nf46\nF54\nf26\nF3\nf1\nF20\nf11\nF80\nf44\nF4\nf2\nF25\nf13\nF86\nf48\n\nPeriod\n0.6393\n0.7001\n0.7325\n0.7627\n0.7943\n0.8877\n0.9483\n1.0094\n1.0391\n1.0701\n1.1010\n1.1319\n1.1604\n1.1919\n1.2231\n1.2532\n1.2843\n1.3176\n1.3463\n1.3770\n1.4098\n1.4385\n1.5026\n1.5925\n\nAmplitude\n0.32\n0.18\n0.28\n0.15\n0.16\n0.19\n0.64\n4.13\n1.07\n5.90\n4.12\n1.48\n0.26\n3.57\n1.07\n3.99\n0.56\n0.87\n11.15\n1.61\n0.58\n7.64\n1.45\n0.55\n\nn\n-23\n-21\n-20\n-19\n-18\n-15\n-13\n-11\n-10\n-9\n-8\n-7\n-6\n-5\n-4\n-3\n-2\n-1\n0\n1\n2\n3\n5\n8\n\n5\n\n\fE. Chapellier et al.: interactions between g- and p-modes\n\nFig. 7. Data phased with the main δ Scuti frequency F =\n12.6759 d−1.\n\nFig. 6. γ Doradus periods that obey the asymptotic period\nspacing law as a function of radial order n with an arbitrary\nzero point [top]. The bottom part shows the residuals of this\nperiod spacing; a straight line has been added for better\nvisibility.\n\n5. The δ Scuti domain\nIn the δ Scuti frequency domain, we retained 246 frequencies in the interval [10.1038; 63.3800] d−1 (Table 1,\nFig. 7). One frequency clearly dominates the spectrum,\nF = 12.6759 d−1, with an amplitude A1 = 27.08 mmag.\nFigure 7 represents a light curve that has been phased with\nfrequency F . The curve is very asymmetric and unsurprisingly harmonics up to 5F were detected. The Fourier\nparameters φ21 = 4.03 rad (phase difference of first overtone and twice the phase of fundamental frequency) and\nR21 = 0.26 (the amplitude ratio of first overtone to fundamental frequency) were in perfect agreement with those\nof fundamental radial pulsators (Poretti, 2001). Hence, we\ncan conclude that F is a radial mode.\nTo corroborate the identification of this pulsation mode,\nwe have only the measurements provided by the EXODAT\ndatabase (Deleuil et al., 2009), which are indicative of an\nA5V spectral type. On the basis of this classification,\nthe star would have an absolute magnitude of MV =\n+2.0 mag and an effective temperature of Teff = 8000 K.\nThe period-luminosity relation given by Templeton et al.\n(2002) supports the identification of the main frequency F\nas a radial fundamental mode. Likewise, using the equation given by Poretti et al. (2008) MV = −1.83(±0.08) −\n3.65(±0.07) log P , we also obtain for the absolute magnitude: MV = +2.20(±0.16) mag.\nThe most remarkable property of CoRoT ID 105733033\nis the coupling of most of the δ Scuti frequencies with\nγ Doradus ones: the first tens of γ Doradus frequencies fi\n6\n\nFig. 8. Top: Enlargement of Fig. 2 [second] showing\nthe detected frequencies in the δ Scuti domain. Bottom:\nthe δ Scuti frequencies without linear combinations with\nγ Doradus frequencies. The ordinates are on a logarithmic\nscale.\nare present in the δ Scuti domain as F ±fi . We also detected\n2F ± fi and 3F ± fi for the γ Doradus frequencies with the\nlargest amplitudes. For the 40 first γ Doradus frequencies\nfi , both F − fi and F + fi frequencies are present except\nfor a few ambiguous cases. Coupling with lower amplitude\nγ Doradus frequencies (up to f100 ) were also detected as\nF − fi or F + fi , but not so regularly. We were able to detect 146 couplings within the limit of ∆f = 0.001 d−1: 110\n\n\fE. Chapellier et al.: interactions between g- and p-modes\n\nTable 4. List of the first three groups of coupled γ Doradus\nand δ Scuti frequencies. Columns are respectively the frequency label of the first column of Table 1, the related coupling, ∆ = |F ± f − Fmeasured| in units of 10−5 d−1 , and the\namplitude ratio Afi /(AkF ±fi ). We recall that the Rayleigh\nfrequency resolution (1/∆ T) corresponds to 70 * 10−5 d−1 .\nFrequency\nF13\nF14\nF16\nF17\nF22\nF26\nF59\nF64\nF94\nF104\nF119\nF121\nF233\nF284\nF355\nF378\nF555\nF490\n\nCoupling\nF − f1\nF + f1\nF − f2\nF + f2\nF − f3\nF + f3\n2F − f1\n2F + f1\n2F − f2\n2F + f2\n2F − f3\n2F + f3\n3F − f1\n3F + f1\n3F − f2\n3F + f2\n3F − f3\n3F + f3\n\n∆\n34.5\n0.3\n0.4\n38.9\n35.1\n0.6\n11.2\n34.2\n4.0\n40.4\n0.1\n34.9\n18.1\n0.0\n34.9\n68.6\n0.1\n43.8\n\nRatio\n4.00\n4.19\n4.09\n4.22\n3.96\n4.28\n14.93\n16.40\n15.08\n16.97\n14.46\n14.69\n48.73\n57.52\n49.32\n52.04\n58.95\n51.98\n\nfor F ± fi , 30 for 2F ± fi , and 6 for 3F ± fi . The three first\ngroups of coupling are presented in Table 4, the complete\nlist being presented in Table 1.\nThe amplitude ratios of the γ Doradus frequencies to\nthe associated high frequencies of δ Scuti characteristics are\nremarkably constant, being 4.1 ± 0.1 (Afi /(AF ±fi )), 15 ± 1\n(Afi /(A2F ±fi )), and 53±4 (Afi /(A3F ±fi )). The amplitudes\nof the F − fi frequencies were slightly larger (1.3 %) than\nthose of F + fi . We also note that the beatings of F ± fi\nfrequencies are in phase with the fi frequencies i.e., the\nhighest amplitude of the beating of F and F ± fi occurs\nwhen the light curve of fi reaches a maximum.\nThus, it appears that a fundamental property of this\nstar is the coupling between g- and p-modes. This coupling was previously predicted for the Sun (Kennedy et al.,\n1993). Following this study, the low-frequency g-modes,\ntrapped in the stellar interior, induce slow periodic thermodynamic perturbations in the envelope, leading to a frequency modulation of the outer p-modes. This causes the\nformation of a pair of spectral sidelobes (not to be confused\nwith sidelobes caused by the spectral window!) that are\nsymmetric relative to the unperturbed p-mode frequency.\nThis is exactly what we see for our F ± fi peaks. A complementary study (Lou, 2001) shows that, in principle, a\nspectrum of sidelobes would appear to be centered on each\np-mode frequency and that the spectral structure may be\ncomplicated by the presence of several g-modes. The predicted amplitude ratio of the first sidelobe As to the central\nA ±A\nAs\n= 12 FAf fi ≈ 0.125, but this ratio was\np-mode Ap is A\np\ni\nnot measured by us.\nOn the other hand, measured sidelobe amplitudes are\ndirectly linked to the amplitude of the respective \"parent\" gand p-modes. The first non-radial mode of δ Scuti-type (p1 )\nalso contains sidelobes. The amplitude ratio of F to p1 is 23,\nwhere the sidelobes of the p1 ±fi peaks are \"only\" nine times\nsmaller than those corresponding to F ± fi . Hence, the re-\n\nlationship does not seem to be linear. In conclusion, except\nfor the influence of the amplitudes of the concerned modes,\nthe coupling mechanism proposed by Kennedy et al. (1993)\nand Lou (2001) operates in this star. Initiated first as a help\nto the detection of g-modes in the Sun, there is no obvious\nreason for not assuming that this mechanism operates in\nother stars.\nWithout all the coupling frequencies 100, δ Scuti-type\nfrequencies remained. For a list of \"pure\" δ Scuti frequencies,\nwe also discarded frequencies with |kF ± fi − Fmeasured | ≤\n∆ = 0.0015 d−1(instead of our standard ∆ = 0.0010 d−1),\nif their amplitude ratio was compatible with the value of\nthree obtained in our \"standard\" case. We derived 25 of\nthese possible couplings, which are all of F ± fi type.\nWe used this interaction mechanism in order to test\nthe low frequency region. If γ Doradus-type frequencies,\nfi , lower than 0.25 d−1 and with amplitudes larger than\n0.4 mmag were to exist, we should detect them as F ± fi .\nNo such frequencies were detected, so we conclude that\nthe lower limit for γ Doradus frequencies really is about\n0.25 d−1 .\nThe physical characteristics of the star (mass, effective temperature, radius, evolutionary state. . . ), are uncertain, as was previously mentioned at the beginning of\nthis section. Using the values computed by Fitch (1981),\nthe frequencies associated with the first overtones 1O, 2O,\nand 3O should be close to respectively 16.55, 20.66, and\n24.85 d−1. Values associated with the 1O and 2O modes\nare located in regions that have a low density of frequencies,\nand the frequencies F98 = 16.4019 d−1(A98 = 0.49 mmag)\nand F215 = 20.7007 d−1(A215 = 0.25 mmag) could correspond to these modes. As neither the fundamental stellar\nparameters, nor the true errors of the models, are known\nwith sufficient accuracy, we can only speculate that the\novertones are a correct interpretation.\nThe non-radial δ Scuti frequencies were renamed in order of decreasing amplitude starting from p1 ≡ F33 (see\nalso Table 1). They are presented in the lower part of Fig 8.\nThese frequencies are dominated by p1 = 13.8566 d−1 with\nan amplitude of 1.18 mmag and all the others have amplitudes smaller than 0.5 mmag. We detected three couplings\nbetween p1 and the γ Doradus frequencies f3 , f5 , and f6 according to p1 + fi . The mean amplitude ratio Ap1 /(Ap1 +fi )\nis 35 i.e., about nine times larger than the corresponding\nratio associated to F .\nWe also detected 9 couplings between F and other\nδ Scuti type frequencies. Therefore, we end up with 59 independent δ Scuti frequencies, three of which are probably\nassociated with radial modes, and the 56 others with nonradial modes.\n\n6. Rotation\nWe searched for equidistant frequencies that could be related to rotational splitting. The only possibilities we found\nwere quadruplet components formed by p31 ≡ F381 =\n12.5776 d−1, p29 ≡ F360 = 12.6276 d−1, F = 12.6759 d−1\nand p41 ≡ F444 = 12.7231 d−1. The separations are respectively 0.0500, 0.0483, and 0.0473 d−1. The radial fundamental mode F cannot of course lead to any rotational splitting, but its high amplitude may conceal a non-radial l = 2\nmode that could be responsible for the aforementioned detected quadruplet. Another interpretation is that the star\nbelongs to a binary system, and that the equidistant peaks\n7\n\n\fE. Chapellier et al.: interactions between g- and p-modes\n\nFig. 9. Binned data phased with the candidate rotation\nfrequency f = 0.0486 d−1, corresponding to a rotation period of 20.57 d. Different symbols refer to different rotation\ncycles and data averaged in steps of 0.1 in phase.\nare actually orbital sidelobes to the central pulsation frequency modulated by the Doppler effect, as proposed by\nShibahashi & Kurtz (2012).\nAmong the frequencies below 0.25 d−1 (see Sec. 3) was\na frequency at 0.04862 d−1 that has an amplitude of A =\n1.46 mmag, which is close to the separation values mentioned in the previous paragraph.\nA possible interpretation of this low frequency could\nbe the rotation of the star with a period of 20.57 d causing\nlight variations associated for instance with surface inhomogeneities. We note that a phase plot (Fig. 9) of the residuals after prewhitening with the pulsation frequencies, when\nusing the candidate rotation period looks reasonable. This\nrotation period would also be long enough to account for\nthe two clearly distinct groups of γ Doradus and δ Scuti frequencies because the observed frequency spectrum should\nnot differ significantly from the co-rotating one. Our speculations concerning a rotation period of course have to be\ntaken with the utmost caution as the very low frequency\nrange is populated by signal caused by instrumental effects, imperfect data reduction, g-modes, and combination\nfrequencies. A dedicated spectroscopic observing program\nfocused on the detection of rotation and eventual binarity\neffects in this star would be needed to resolve the ambiguities. However, the evidence presented in this paper is both\nconsistent and plausible.\n\n7. Summary\nThe star CoRoT ID 105733033 appears to be a very powerful test case for hybrid star studies. First, its frequency\nspectrum is quite rich. Second, two separate domains are\nclearly detected, with 198 frequencies in the range of\n[0.2483; 3.9936] d−1, which is typical for g-modes, and 246\nfrequencies in the range of [10.1038; 63.3800] d−1, typical of\n8\n\np-modes. Among these frequencies, 180 and 59 are respectively neither combination frequencies nor caused by coupling between g and p-modes, hence seem to represent pure\nγ Doradus and δ Scuti pulsation modes. The sole exception\nis the frequency f = 5.6038 d−1, but with an amplitude\nslightly smaller than 0.1 mmag, which is our chosen lower\nmagnitude limit. This gap between the two domains is a\nstrong indication of slow rotation, since the modes in the\nobserver's frame are not mixed.\nWe found 17 linear combinations among the γ Doradus\nfrequencies. More are probably present, but the time coverage of our data may not be sufficiently long to detect them.\nThe asymptotic theory is very well-illustrated by this star,\nwhich has 24 periods that are equidistant at intervals of\n∆P = 0.03074 d.\nThe high-frequency region shows a dominant peak F\nthat could be identified with the radial fundamental mode.\nIt is most remarkable that of the 246 δ Scuti frequencies, only about 70 (≈ 30 %) seem really independent of\na γ Doradus frequency. Twice as many (146) couplings of\nthe form kF ± fi were detected. Depending on ∆, which is\nthe minimum frequency difference to allow for a clear determination of neighbouring frequencies, this number could\nincrease to 171 and more. Additional coupled frequencies\nare certainly present, but hidden in the noise or too close\nto a frequency of larger amplitude.\nKallinger & Matthews (2010) claimed that the several\nhundreds of δ Scuti-type frequencies detected in A-F type\nstars observed by CoRoT and Kepler could not all be attributed to pulsation. Since the observable amplitudes of\nmodes with l larger than 4, which are required to explain\nthe large number of pulsation modes, suffer strong cancellation effects when integrated over the stellar disk, only some\ntens of frequencies should be detected. The authors demonstrated that many low amplitude frequencies could alternatively be the signature of non-white granulation background\nnoise and that fewer than about 100 of the frequencies of\nthe investigated stars are actually stellar p-modes. In our\ncase, we detected \"only\" 59 independent modes. Therefore,\nonly l-values up to 5 are necessary to attribute the frequencies to p-modes, but significantly higher l values are\ndiscussed nowadays for Kepler data. However, as the granulation level is not known for CoRoT ID 105733033, we cannot be entirely sure that all the 59 δ Scuti- type frequencies\nare really associated with pulsation.\nWe also detected equidistant frequencies very close to\nF that could be interpreted as a signature of rotational\nsplitting or Doppler effect modulation. If this were indeed\ntrue, the rotation or binary period of the star would be\n20.57 d.\nWe have clearly established the influence of the\nγ Doradus variations on the δ Scuti behaviour, and convincingly confirmed the thermodynamical and mechanical\ninteractions between the two p- and g-mode cavities, as predicted many years ago as a tool for detecting g-modes in\nthe Sun (Kennedy et al., 1993; Lou, 2001).\nWe now know that the instability strips of γ Doradus\nand δ Scuti stars are not as clearly defined as previously thought (Uytterhoeven et al., 2011), and the star\nCoRoT ID 105733033 might be the Rosetta stone for hybrid stars, where coupling similar to those detected in the\npresent paper should be systematically searched for. We are\npresently studying other candidates in the CoRoT exofield\n(see e.g. Mathias et al., 2009; Hareter et al., 2010).\n\n\fE. Chapellier et al.: interactions between g- and p-modes\nAcknowledgements. The authors wish to thank E. Poretti and F.X. Schmider for useful comments. W.W. Weiss is supported by the\nAustrian Research Fond (project P22691-N16). The authors thank\ntheir anonymous referee for his helpful suggestions.\n\nReferences\nAuvergne, M., Bodin, P., Boisnard, L., et al. 2009, A&A, 506, 411\nBaglin, A., Michel, E., Auvergne, M., et al. 2006, ESASP, 624, 34\nBalona, L.A., Guzik, J.A., Uytterhoeven, K., et al., 2011, MNRAS,\n415, 3531\nBorucki, W.J., Koch, D.G., Dunham, E.W., & Jenkins, J.M. 1997,\nASP Conf. 119, 153\nBreger, M., Stich, J., Garrido, R., et al., 1993, A&A, 271, 482\nChapellier, E., Rodriguez, E., Auvergne, M., et al., 2011, A&A, 525,\n23\nChristensen-Dalsgaard, J., Arentoft, T., Brown, T.M., et al., 2008,\nJournal of Physics Conference Series, 118, 2039\nCox, A.N., Morgan S.M., Rogers, F.J., et al., 1992, ApJ, 393, 272\nCuypers, J., Aerts, C., De Cat, P., et al., 2009, A&A, 499, 967\nDeleuil, M., Meunier, J. C., Moutou, C., et al. 2009, AJ, 138, 649\nDupret, M.-A., Grigahcéne, A., Garrido, R., et al., 2004, A&A, 414,\n17\nFitch, W.S., 1981, ApJ, 249, 218\nGuzik, J.A., Kaye, A.B., Bradley, P.A., et al., 2000, ApJ, 542, 57\nHandler, G., 2009, MNRAS, 398, 1339\nHareter, M., Reegen, P., Miglio, A. et al., 2010, ArXiv, 1001, 3076\nHenry, G.W., Fekel, F.C., 2005, AJ, 129, 2026\nKabath, P., Fruth, T., Rauer, H., et al., 2009, AJ, 137, 3911\nKallinger, T, Matthews,J.M., 2010, ApJ, 711, L35\nKennedy, J.R., Jefferies, S.M., Hill, F., 1993, ASP Conf. Ser., 42, 273\nKuschnig, R., Weiss, W.W., Gruber, R., et al. 1997, A&A, 328, 544\nLenz, P., & Breger, M. 2005, CoAst, 146, 53\nLou, Y.-Q., 2001, ApJ, 556, L121\nMathias, P., Chapellier, E., Bouabid, M., et al., 2009, AIP Conf. Ser.,\n1170, 486\nMontgomery, M.H., O'Donoghue, D., 1999, DSSN, 13,28\nPoretti, E., 2001, A&A, 371, 986\nPoretti, E., Clementini, G. Held, E.V., et al., 2008, ApJ, 685, 947\nReegen, P. 2007, A&A, 467, 1353\nRowe, J.F., Matthews, J.M., Cameron, C., 2006, Commun.\nAsteroseismol., 148, 34\nShibahashi, H., Kurtz, D.W., 2012, arXiv, 1202, 0105S\nTassoul, M., 1980, ApJS, 43, 469\nTempleton, M., Basu, S, Demarque, P., 2002, ApJ, 576, 963\nUytterhoeven, K., Moya, A., Grigahcène, A., et al., 2011, A&A, submitted\nWalker, G., Matthews, J.M., Kuschnig, R., et al., 2003, PASP, 115,\n1023\n\n9\n\n\f"}