{"id": "http://arxiv.org/abs/0805.0890v1", "guidislink": true, "updated": "2008-05-07T09:14:25Z", "updated_parsed": [2008, 5, 7, 9, 14, 25, 2, 128, 0], "published": "2008-05-07T09:14:25Z", "published_parsed": [2008, 5, 7, 9, 14, 25, 2, 128, 0], "title": "RF-MEMS Switched Varactors for Medium Power Applications", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0805.1217%2C0805.3463%2C0805.2369%2C0805.0033%2C0805.2242%2C0805.4729%2C0805.3183%2C0805.1233%2C0805.2104%2C0805.2823%2C0805.2798%2C0805.0793%2C0805.1066%2C0805.1408%2C0805.2327%2C0805.0018%2C0805.4071%2C0805.2937%2C0805.3625%2C0805.4233%2C0805.0487%2C0805.3926%2C0805.3111%2C0805.0717%2C0805.0088%2C0805.4550%2C0805.4697%2C0805.1110%2C0805.2169%2C0805.2890%2C0805.4417%2C0805.4788%2C0805.0319%2C0805.1274%2C0805.4311%2C0805.1169%2C0805.2105%2C0805.3274%2C0805.2720%2C0805.1713%2C0805.1530%2C0805.1170%2C0805.3507%2C0805.1351%2C0805.3488%2C0805.1517%2C0805.2667%2C0805.3503%2C0805.2252%2C0805.1487%2C0805.4575%2C0805.1698%2C0805.1724%2C0805.2325%2C0805.4072%2C0805.3812%2C0805.0447%2C0805.0586%2C0805.4049%2C0805.3081%2C0805.4510%2C0805.0573%2C0805.2059%2C0805.3097%2C0805.4562%2C0805.4490%2C0805.3366%2C0805.4568%2C0805.2829%2C0805.4619%2C0805.0890%2C0805.4244%2C0805.2210%2C0805.3530%2C0805.1286%2C0805.4011%2C0805.4815%2C0805.0360%2C0805.3263%2C0805.3718%2C0805.2052%2C0805.0672%2C0805.3635%2C0805.0589%2C0805.0402%2C0805.1250%2C0805.2556%2C0805.2320%2C0805.1513%2C0805.0638%2C0805.1673%2C0805.0002%2C0805.0832%2C0805.1245%2C0805.3465%2C0805.3271%2C0805.4015%2C0805.3215%2C0805.0031%2C0805.0526%2C0805.0175&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "RF-MEMS Switched Varactors for Medium Power Applications"}, "summary": "In RF (Radio Frequency) domain, one of the limitations of using MEMS (Micro\nElectromechanical Systems) switching devices for medium power applications is\nRF power. Failure phenomena appear even for 500 mW. A design of MEMS switched\ncapacitors with an enhanced topology is presented in this paper to prevent it.\nThis kind of device and its promising performances will serve to fabricate a\nMEMS based phase shifter able to work under several watts.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0805.1217%2C0805.3463%2C0805.2369%2C0805.0033%2C0805.2242%2C0805.4729%2C0805.3183%2C0805.1233%2C0805.2104%2C0805.2823%2C0805.2798%2C0805.0793%2C0805.1066%2C0805.1408%2C0805.2327%2C0805.0018%2C0805.4071%2C0805.2937%2C0805.3625%2C0805.4233%2C0805.0487%2C0805.3926%2C0805.3111%2C0805.0717%2C0805.0088%2C0805.4550%2C0805.4697%2C0805.1110%2C0805.2169%2C0805.2890%2C0805.4417%2C0805.4788%2C0805.0319%2C0805.1274%2C0805.4311%2C0805.1169%2C0805.2105%2C0805.3274%2C0805.2720%2C0805.1713%2C0805.1530%2C0805.1170%2C0805.3507%2C0805.1351%2C0805.3488%2C0805.1517%2C0805.2667%2C0805.3503%2C0805.2252%2C0805.1487%2C0805.4575%2C0805.1698%2C0805.1724%2C0805.2325%2C0805.4072%2C0805.3812%2C0805.0447%2C0805.0586%2C0805.4049%2C0805.3081%2C0805.4510%2C0805.0573%2C0805.2059%2C0805.3097%2C0805.4562%2C0805.4490%2C0805.3366%2C0805.4568%2C0805.2829%2C0805.4619%2C0805.0890%2C0805.4244%2C0805.2210%2C0805.3530%2C0805.1286%2C0805.4011%2C0805.4815%2C0805.0360%2C0805.3263%2C0805.3718%2C0805.2052%2C0805.0672%2C0805.3635%2C0805.0589%2C0805.0402%2C0805.1250%2C0805.2556%2C0805.2320%2C0805.1513%2C0805.0638%2C0805.1673%2C0805.0002%2C0805.0832%2C0805.1245%2C0805.3465%2C0805.3271%2C0805.4015%2C0805.3215%2C0805.0031%2C0805.0526%2C0805.0175&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In RF (Radio Frequency) domain, one of the limitations of using MEMS (Micro\nElectromechanical Systems) switching devices for medium power applications is\nRF power. Failure phenomena appear even for 500 mW. A design of MEMS switched\ncapacitors with an enhanced topology is presented in this paper to prevent it.\nThis kind of device and its promising performances will serve to fabricate a\nMEMS based phase shifter able to work under several watts."}, "authors": ["F. Maury", "A. Pothier", "A. Crunteanu", "F. Conseil", "P. Blondy"], "author_detail": {"name": "P. Blondy"}, "author": "P. Blondy", "arxiv_comment": "Submitted on behalf of EDA Publishing Association\n  (http://irevues.inist.fr/handle/2042/16838)", "links": [{"href": "http://arxiv.org/abs/0805.0890v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0805.0890v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cs.OH", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cs.OH", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0805.0890v1", "affiliation": "XLIM", "arxiv_url": "http://arxiv.org/abs/0805.0890v1", "journal_reference": "Dans Symposium on Design, Test, Integration and Packaging of\n  MEMS/MOEMS - DTIP 2008, Nice : France (2008)", "doi": null, "fulltext": "9-11 April 2008\n\nRF-MEMS Switched Varactors\nfor Medium Power Applications\nF. Maury1, A. Pothier1, A. Crunteanu1, F. Conseil2et P. Blondy1\n1\n\nXLIM UMR 6172\n123 avenue Albert Thomas, 87060 Limoges cedex\n2\nMBDA France\n20 Rue Grange Dame Rose BP150, 78141 Vélizy-Villacoublay cedex\n\nAbstract- In RF (Radio Frequency) domain, one of the limitations\nof using MEMS (Micro Electromechanical Systems) switching\ndevices for medium power applications is RF power. Failure\nphenomena appear even for 500 mW. A design of MEMS\nswitched capacitors with an enhanced topology is presented in this\npaper to prevent it. This kind of device and its promising\nperformances will serve to fabricate a MEMS based phase shifter\nable to work under several watts.\n\nI.\n\nINTRODUCTION\n\nMany researches about MEMS trend to exploit their wellknown and large advantages. Cost and size reduction enables\nMEMS sensors to be focus on. Some of them have\ndemonstrated their mass production feasibility thanks to their\nCMOS compatibility. Nowadays, micro actuators are studied to\nfollow the same way in telecommunication domain. Those\nwhich are driven by electrostatic actuation are the most\ninvestigated. This kind of structures has an easy way to build; a\nsimple difference of potential between two metallic layers is\nenough to create an attraction force for actuation. The most\nmature of them have been already commercialized, only tens of\nvolts enable them to switch [1]. Their interesting performances\npromise to be very suitable for a large kind of control circuits.\nFor example, MEMS switched capacitors are used for their\nlow series resistances and low-drive power requirements. For\nwireless communication and particularly radar applications,\nswitched-line phase shifters using MEMS fixed-fixed beams\nhave demonstrated good degree/ loss ratios. Nevertheless, the\nchoice of these MEMS structures is compromised for high and\neven medium power applications. For microwave signals\nbeyond 1 Watt, most of MEMS switched capacitors fail in hot\nswitching operation. In this operating way, the RF signal is\napplied continually and, contrary to cold switching, it is not\ninterrupted when the MEMS beams are activated. This is a\nbetter manner of working for users who don't have to care\nabout RF signal source control.\nThe most critical power failure phenomenon appears by this\nway is called RF latching. In down state position, the\nelectrostatic pressure generated by RF power prevents the\nbeam to recover the up state when the DC actuation signal is\nstopped. To avoid this event, the mobile structure must have a\nbetter stiffness to lead to a restoring force capable of frustrate\nthis electrostatic force [2].\n\n©EDA Publishing/DTIP 2008\n\nII.\n\nDEVICE DESIGN\n\nIn the research institute XLIM in Limoges, we have\nproposed a design of MEMS switched capacitors with an\nenhanced topology offering a better opposition to RF power\nforces compared to traditional architecture [3]. This geometry\nhas been especially studied to consider electrostatic pressures\ngenerated by high RF power signal. The actuation part of\ncantilevers and their contact area are well separated and have\nbeen designed to be almost fully independent. That's why, the\narchitecture of the beam consists in two different areas: a large\nactuation part and a smaller contact tip as shown on Fig.1.\nElectrostatic\nRF power\npressure\nDielectric\nlayer\nRF signal\nActuation\nforce\nUp state\nrecover\n\nRestoring force\n\nRestrictive\ncontact area\n\nWeaker\nelectrostatic RF\npower pressure\nRF signal\n\nFig. 1. Principle of proposed cantilever based switched varactor.\n\nISBN: 978-2-35500-006-5\n\n\fHence, when a RF signal is applied across the component,\ndue to its electric field, a static attractive electrostatic pressure\nis induced on the movable beam. In fact, this pressure mainly\ndepends both on the RF signal magnitude, on the localized area\ngeometry of the beam where this field is concentrated (the\nbeam tip in our case) and also on the distance separating this\narea from the RF line where the signal propagates.\nTo recover up state position, when the actuation command is\ninterrupted, the beam must have a restoring force greater than\nthe electrostatic RF power attraction force. Designing a\nrestricted beam tip area allows to reduce the effect of\nelectrostatic pressure induced by the RF signal which is really\ncritical in down state position when the tip is put into contact\nwith RF line. Indeed, contrary to the up state position, the\ninduced RF electric field is much higher in down state since the\nair gap is almost reduced to zero, only a thin dielectric layer\nisolates the beam tip from the RF line. That is why hot\nswitching operation is the operating mode where power failure\nfirst appears. Thanks to this specific tip geometry, the power\nhandling of the component could be highly improved up to\nseveral Watts on 50 Ohms impedance.\nThe other particularity of the proposed beam geometry is the\ndifference of gaps between the actuation area and the contact\ntip. Hence in the beam down state position, a higher air gap on\nthe actuation area allows improving the contact force on the tip\nand avoiding in the same way some collapse phenomenon\nbetween the beam and its pull-down electrode after the tip has\nmade contact on the RF line. Thus, the component reliability\ncould be grandly improved since dielectric charging troubles\ngenerally observed in contact mode electrostatic actuators is\nstrongly reduced.\nIII.\n\n40\n38\n36\n34\n32\n30\n28\n26\n24\n22\n20\n0\n\n2\n\n4\n\n6\n\n8\n\n10 12 14 16 18\n\nRF Power (W)\nFig. 3. Measures of DC actuation release voltages.\n\nTo our knowledge, there is no MEMS based phase shifter in\nliterature able to operate under several Watts in hot switching\nconditions. The presented switched capacitor concept could be\nimplemented in a DMTL (Distributed MEMS Transmission\nLine) to reach such power handling. To design such phase\nshifter a high impedance microwave transmission line is\ngenerally used periodically loaded with tens or more of\nvaractors, the principle of a DMTL phase shifter topology is\nshown Fig.4 and a fabricated testing cell is presented Fig.5.\n\nTEST CELLS\n\nSeveral switched capacitors geometries have been designed\nand analytical calculus have predicted that most of them should\nbe able to handle RF signal power of 4 Watts at least. To\nevaluate the real power handling capabilities under hot\nswitching conditions, fabricated devices have been tested for\ndifferent level of RF power monitoring their minimum DC\nrelease voltages before recovering the cantilever up state. An\nexample of cell which have been tested is shown Fig.2 and\nFig.3 presents there is no significant voltage change up to 18\nWatts under 50 Ohms revealing no failure phenomenon occurs\nat least until this RF power level.\n\nFig. 2. Testing cell.\n\n©EDA Publishing/DTIP 2008\n\nRelease Voltage (V)\n\n9-11 April 2008\n\nFig. 4. Principle of a DMTL phase shifter topology.\n\nThe phase shift is achieved by turning on several of the\nswitched capacitors distributed along the line allowing a\ndecrease of the line impedance and so meaningful change on\nthe RF signal velocity. Actually, the available phase shift\nincreases with the number of cantilevers placed along the line.\n\nFig. 5. Picture of a fabricated phase shifting cell.\n\nISBN: 978-2-35500-006-5\n\n\f9-11 April 2008\nThus several switched capacitors can be actuated in the\nsame time as a single element (a bit) in order to reach well\ndefined phase shift value: 0°, 90°, 180°, 270° as example on a 2\nbit phase shifter. Compared to analog phase shifters, this\napproach guarantees a very low sensitivity to phase noise and\nbetter performance reproducibility.\nIV.\n\nCONCLUSION\n\nFor instance, several elementary phase shifting cells (1-bit\ntopology) have been fabricated. Each cell is based on a\ncoplanar waveguide loaded with 2 cantilevers symmetrically\nplaced at each side. The RF performances and the power\nhandling of these structures are currently under test. The last\nresults will be presented during the conference.\nREFERENCES\n[1]\n[2]\n[3]\n\nG. M. Rebeiz, RF MEMS: Theory, Design and Technology.\nHoboken, NJ: John Wiley and Sons, 2003.\nD. Peroulis, S. P. Pacheco, and L. P. B. Katehi, \"RF MEMS\nswitches with enhanced power-handling capabilities, \"IEE Trans.\nMicrowave Theory Tech., vol. 52, pp. 59-68, Jan. 2004.\nC. Palego and al \"RF-MEMS Switched Varactor for High Power\nApplications\", IEEE MTT-S Int. Microwave Symp. Dig, San\nFrancisco, June 2006.\n\n©EDA Publishing/DTIP 2008\n\nISBN: 978-2-35500-006-5\n\n\f"}