{"id": "http://arxiv.org/abs/0812.3788v2", "guidislink": true, "updated": "2009-01-26T12:52:36Z", "updated_parsed": [2009, 1, 26, 12, 52, 36, 0, 26, 0], "published": "2008-12-19T13:51:57Z", "published_parsed": [2008, 12, 19, 13, 51, 57, 4, 354, 0], "title": "Foundations of SPARQL Query Optimization", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0812.3882%2C0812.0357%2C0812.1814%2C0812.4676%2C0812.2802%2C0812.2514%2C0812.3915%2C0812.3523%2C0812.0695%2C0812.0473%2C0812.2650%2C0812.4743%2C0812.2358%2C0812.5006%2C0812.0768%2C0812.1399%2C0812.0824%2C0812.0783%2C0812.4973%2C0812.4376%2C0812.1041%2C0812.1895%2C0812.2252%2C0812.3741%2C0812.4795%2C0812.4528%2C0812.4907%2C0812.1690%2C0812.4509%2C0812.0418%2C0812.1914%2C0812.2550%2C0812.5039%2C0812.4051%2C0812.2852%2C0812.3017%2C0812.3673%2C0812.1088%2C0812.4901%2C0812.4403%2C0812.0674%2C0812.1896%2C0812.1432%2C0812.0920%2C0812.2727%2C0812.3788%2C0812.1775%2C0812.0956%2C0812.0886%2C0812.0747%2C0812.0275%2C0812.0141%2C0812.1156%2C0812.3280%2C0812.2477%2C0812.0249%2C0812.2982%2C0812.3463%2C0812.3880%2C0812.0611%2C0812.1695%2C0812.3135%2C0812.3694%2C0812.3922%2C0812.4156%2C0812.3035%2C0812.3737%2C0812.2014%2C0812.2856%2C0812.3518%2C0812.1268%2C0812.2751%2C0812.3272%2C0812.2872%2C0812.3751%2C0812.2121%2C0812.2081%2C0812.2049%2C0812.0560%2C0812.3285%2C0812.1031%2C0812.1855%2C0812.2634%2C0812.4919%2C0812.0989%2C0812.4565%2C0812.4808%2C0812.1016%2C0812.3366%2C0812.4671%2C0812.4600%2C0812.0624%2C0812.4740%2C0812.3225%2C0812.3988%2C0812.1520%2C0812.3047%2C0812.2670%2C0812.2628%2C0812.2265%2C0812.3642&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Foundations of SPARQL Query Optimization"}, "summary": "The SPARQL query language is a recent W3C standard for processing RDF data, a\nformat that has been developed to encode information in a machine-readable way.\nWe investigate the foundations of SPARQL query optimization and (a) provide\nnovel complexity results for the SPARQL evaluation problem, showing that the\nmain source of complexity is operator OPTIONAL alone; (b) propose a\ncomprehensive set of algebraic query rewriting rules; (c) present a framework\nfor constraint-based SPARQL optimization based upon the well-known chase\nprocedure for Conjunctive Query minimization. In this line, we develop two\nnovel termination conditions for the chase. They subsume the strongest\nconditions known so far and do not increase the complexity of the recognition\nproblem, thus making a larger class of both Conjunctive and SPARQL queries\namenable to constraint-based optimization. Our results are of immediate\npractical interest and might empower any SPARQL query optimizer.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0812.3882%2C0812.0357%2C0812.1814%2C0812.4676%2C0812.2802%2C0812.2514%2C0812.3915%2C0812.3523%2C0812.0695%2C0812.0473%2C0812.2650%2C0812.4743%2C0812.2358%2C0812.5006%2C0812.0768%2C0812.1399%2C0812.0824%2C0812.0783%2C0812.4973%2C0812.4376%2C0812.1041%2C0812.1895%2C0812.2252%2C0812.3741%2C0812.4795%2C0812.4528%2C0812.4907%2C0812.1690%2C0812.4509%2C0812.0418%2C0812.1914%2C0812.2550%2C0812.5039%2C0812.4051%2C0812.2852%2C0812.3017%2C0812.3673%2C0812.1088%2C0812.4901%2C0812.4403%2C0812.0674%2C0812.1896%2C0812.1432%2C0812.0920%2C0812.2727%2C0812.3788%2C0812.1775%2C0812.0956%2C0812.0886%2C0812.0747%2C0812.0275%2C0812.0141%2C0812.1156%2C0812.3280%2C0812.2477%2C0812.0249%2C0812.2982%2C0812.3463%2C0812.3880%2C0812.0611%2C0812.1695%2C0812.3135%2C0812.3694%2C0812.3922%2C0812.4156%2C0812.3035%2C0812.3737%2C0812.2014%2C0812.2856%2C0812.3518%2C0812.1268%2C0812.2751%2C0812.3272%2C0812.2872%2C0812.3751%2C0812.2121%2C0812.2081%2C0812.2049%2C0812.0560%2C0812.3285%2C0812.1031%2C0812.1855%2C0812.2634%2C0812.4919%2C0812.0989%2C0812.4565%2C0812.4808%2C0812.1016%2C0812.3366%2C0812.4671%2C0812.4600%2C0812.0624%2C0812.4740%2C0812.3225%2C0812.3988%2C0812.1520%2C0812.3047%2C0812.2670%2C0812.2628%2C0812.2265%2C0812.3642&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The SPARQL query language is a recent W3C standard for processing RDF data, a\nformat that has been developed to encode information in a machine-readable way.\nWe investigate the foundations of SPARQL query optimization and (a) provide\nnovel complexity results for the SPARQL evaluation problem, showing that the\nmain source of complexity is operator OPTIONAL alone; (b) propose a\ncomprehensive set of algebraic query rewriting rules; (c) present a framework\nfor constraint-based SPARQL optimization based upon the well-known chase\nprocedure for Conjunctive Query minimization. In this line, we develop two\nnovel termination conditions for the chase. They subsume the strongest\nconditions known so far and do not increase the complexity of the recognition\nproblem, thus making a larger class of both Conjunctive and SPARQL queries\namenable to constraint-based optimization. Our results are of immediate\npractical interest and might empower any SPARQL query optimizer."}, "authors": ["Michael Schmidt", "Michael Meier", "Georg Lausen"], "author_detail": {"name": "Georg Lausen"}, "author": "Georg Lausen", "links": [{"href": "http://arxiv.org/abs/0812.3788v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0812.3788v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cs.DB", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cs.DB", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0812.3788v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0812.3788v2", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "Foundations of SPARQL Query Optimization\nMichael Meier∗\nGeorg Lausen\nInstitut für Informatik\nGeorges-Köhler-Allee, Gebäude 051\n79110 Freiburg i. Br., Germany\n{mschmidt, meierm, lausen}@informatik.uni-freiburg.de\n\narXiv:0812.3788v2 [cs.DB] 26 Jan 2009\n\nMichael Schmidt∗\n\nABSTRACT\nThe SPARQL query language is a recent W3C standard for\nprocessing RDF data, a format that has been developed to\nencode information in a machine-readable way. We investigate the foundations of SPARQL query optimization and\n(a) provide novel complexity results for the SPARQL evaluation problem, showing that the main source of complexity\nis operator Optional alone; (b) propose a comprehensive\nset of algebraic query rewriting rules; (c) present a framework for constraint-based SPARQL optimization based upon\nthe well-known chase procedure for Conjunctive Query minimization. In this line, we develop two novel termination\nconditions for the chase. They subsume the strongest conditions known so far and do not increase the complexity of the\nrecognition problem, thus making a larger class of both Conjunctive and SPARQL queries amenable to constraint-based\noptimization. Our results are of immediate practical interest\nand might empower any SPARQL query optimizer.\n\n1.\n\nIntroduction\n\nThe SPARQL Protocol and Query Language is a recent\nW3C recommendation that has been developed to extract\ninformation from data encoded using the Resource Description Framework (RDF) [14]. From a technical point of view,\nRDF databases are collections of (subject,predicate,object)\ntriples. Each triple encodes the binary relation predicate between subject and object, i.e. represents a single knowledge\nfact. Due to their homogeneous structure, RDF databases can\nbe seen as labeled directed graphs, where each triple defines\nan edge from the subject to the object node under label predicate. While originally designed to encode knowledge in the\nSemantic Web in a machine-readable format, RDF has found\nits way out of the Semantic Web community and entered the\nwider discourse of Computer Science. Coming along with\nits application in other areas, such as bio informatics, data\npublishing, or data integration, large RDF repositories have\nbeen created (cf. [29]). It has repeatedly been observed that\nthe database community is facing new challenges to cope\nwith the specifics of the RDF data format [7, 18, 21, 31].\n∗\nThe work of this author was funded by Deutsche\nForschungsgemeinschaft grant GRK 806/03.\n\nWith SPARQL, the W3C has recommended a declarative\nquery language that allows to extract data from RDF graphs.\nSPARQL comes with a powerful graph matching facility,\nwhose basic construct are so-called triple patterns. During\nquery evaluation, variables inside these patterns are matched\nagainst the RDF input graph. The solution of the evaluation\nprocess is then described by a set of mappings, where each\nmapping associates a set of variables with RDF graph components. SPARQL additionally provides a set of operators\n(namely And, Filter, Optional, Select, and Union),\nwhich can be used to compose more expressive queries.\nOne key contribution in this paper is a comprehensive complexity analysis for fragments of SPARQL. We follow previous approaches [26] and use the complexity of the Evaluation problem as a yardstick: given query Q, data set D,\nand candidate solution S as input, check if S is contained in\nthe result of evaluating Q on D. In [26] it has been shown\nthat full SPARQL is PSpace-complete, which is bad news\nfrom a complexity point of view. We show that yet operator Optional alone makes the Evaluation problem\nPSpace-hard. Motivated by this result, we further refine our\nanalysis and prove better complexity bounds for fragments\nwith restricted nesting depth of Optional expressions.\nHaving established this theoretical background, we turn\ntowards SPARQL query optimization. The semantics of\nSPARQL is formally defined on top of a compact algebra\nover mapping sets. In the evaluation process, the SPARQL\noperators are first translated into algebraic operations, which\nare then directly evaluated on the data set. The SPARQL\nAlgebra (SA) comprises operations such as join, union, left\nouter join, difference, projection, and selection, akin to the\noperators defined in Relational Algebra (RA). At first glance,\nthere are many parallels between SA and RA; in fact, the\nstudy in [1] reveals that SA and RA have exactly the same\nexpressive power. Though, the technically involved proof\nin [1] indicates that a semantics-preserving SA-to-RA translation is far from being trivial (cf. [6]). Hence, although both\nalgebras provide similar operators, there are still very fundamental differences between both. One of the most striking\ndiscrepancies, as also argued in [26], is that joins in RA are\nrejecting over null-values, but in SA, where the schema is\nloose in the sense that mappings may bind an arbitrary set\nof variables, joins over unbound variables (essentially the\nequivalent of RA null-values) are always accepting.\n\n\ftion problem for constraints. Further, they apply to the core\nchase introduced in [8] (there it was proven that the termination of the chase implies termination of the core chase).\n\nOne direct implication is that not all equivalences that hold\nin RA also hold in SA, and vice versa, which calls for a study\nof SA by its own. In response, we present an elaborate study\nof SA in the second part of the paper. We survey existing and develop new algebraic equivalences, covering various SA operators, their interaction, and their relation to the\nRA counterparts. When interpreted as rewriting rules, these\nequivalences form the theoretical foundations for transferring\nestablished RA optimization techniques, such as filter pushing, into the SPARQL context. Going beyond the adaption\nof existing techniques, we also address SPARQL-specific issues, e.g. provide rules for simplifying expressions involving\n(closed-world) negation, which can be expressed in SPARQL\nsyntax using a combination of Optional and Filter.\n\nIn order to optimize SPARQL queries, we translate Andblocks of the query into CQs, optimize them using the C&Balgorithm, and translate the outcome back into SPARQL. Additionally, we provide optimization rules that go beyond such\nsimple queries, showing that in some cases Optional- and\nFilter-queries can be simplified. With respect to chase termination, we introduce two alternate SPARQL-to-CQ translation schemes. They differ w.r.t. the termination conditions\nthat they exhibit for the subsequent chase, i.e. our sufficient\nchase termination conditions might guarantee termination for\nthe first but not for the second translation, and vice versa.\n\nWe note that in the past much research effort has been\nspent in processing RDF data with traditional systems, such\nas relational DBMSs or datalog engines [7, 18, 31, 25, 12, 21,\n27], thus falling back on established optimization strategies.\nSome of them (e.g. [31, 12]) work well in practice, but are\nlimited to small fragments, such as And-only queries. More\ncomplete approaches (e.g. [7]) suffer from performance bottlenecks for complex queries, often caused by poor optimization results (cf. [18, 21, 22]). For instance, [21] identifies\ndeficiencies of existing schemes for queries involving negation, a problem that we tackle in our analysis. This also\nshows that traditional approaches are not laid out for the specific challenges that come along with SPARQL processing\nand urges the need for a thorough investigation of SA.\n\nOur key contributions can be summarized as follows.\n• We present previously unknown complexity results for\nfragments of the SPARQL query language, showing that\nthe main source of complexity is operator Optional\nalone. Moreover, we prove there are better bounds when\nrestricting the nesting depth of Optional expressions.\n• We summarize existent and establish new equivalences\nover SPARQL Algebra. Our extensive study characterizes the algebraic operators and their interaction, and\nmight empower any SPARQL query optimizer. We also\nindicate an erratum in [26] and discuss its implications.\n• Our novel SQO scheme for SPARQL can be used to\noptimize And-only queries under a set of constraints.\nFurther, we provide rules for semantic optimization of\nqueries involving operators Optional and Filter.\n• We present two novel sufficient termination conditions\nfor the chase, which strictly generalize previous conditions. This improvement empowers the practicability of\nmany important research areas, like e.g. [28, 20, 15, 9].\n\nIn the final part of the paper we study constraint-based\nquery optimization in the context of SPARQL, also known\nas Semantic Query Optimization (SQO). SQO has been applied successfully in other contexts before, such as Conjunctive Query (CQ) optimization (e.g., [3]), relational databases\n(e.g., [17]), and deductive databases (e.g., [5]). We demonstrated the prospects of SQO for SPARQL in [19], and in\nthis work we lay the foundations for a schematic semantic\noptimization approach. Our SQO scheme builds upon the\nChase & Backchase (C&B) algorithm [9], an extension of\nthe well-known chase procedure for CQ optimization [24, 3,\n16]. One key problem with the chase is that it might not always terminate. Even worse, it has recently been shown that\nfor an arbitrary set of constraints it is undecidable if it terminates or not [8]. There exist, however, sufficient conditions\nfor the termination of the chase; the best condition known so\nfar is that of stratified constraints [8]. The definition of stratification uses a former termination condition for the chase,\nnamely weak acyclicity [28]. In this paper, we present two\nprovably stronger termination conditions, making a larger\nclass of CQs amenable to the semantic optimization process\nand generalizing the methods introduced in [28, 8].\n\nStructure. We start with some preliminaries in Section 2\nand present the complexity results for SPARQL fragments in\nSection 3. The subsequent discussion of query optimization\ndivides into algebraic optimization (Section 4) and semantic optimization (Section 5). The latter discussion is complemented by the chase termination conditions presented in\nSection 6. Finally, Section 7 contains some closing remarks.\n\n2. Preliminaries\nRDF. We follow the notation from [26]. We consider\nthree disjoint sets B (blank nodes), I (IRIs), and L (literals)\nand use the shortcut BIL to denote the union of the sets\nB, I, and L. By convention, we indicate literals by quoted\nstrings (e.g.\"Joe\", \"30\") and prefix blank nodes with \" :\". An\nRDF triple (v1 ,v2 ,v3 ) ∈ BI × I × BIL connects subject\nv1 through predicate v2 to object v3 . An RDF database,\nalso called document, is a finite set of triples. We refer the\ninterested reader to [14] for an elaborate discussion of RDF.\n\nOur first condition, called safety, strictly subsumes weak\nacyclicity and the second, safe restriction, strictly subsumes\nstratification. They do not increase the complexity of the\nrecognition problem, i.e. safety is checkable in polynomial\ntime (like weak acyclicity) and safe restriction by a coNPalgorithm (like stratification). We emphasize that our results\nimmediately carry over to data exchange [28] and integration [20], query answering using views [15], and the implica-\n\nSPARQL Syntax. Let V be an infinite set of variables\ndisjoint from BIL. We start with an abstract syntax for\nSPARQL, where we abbreviate operator Optional as Opt.\n2\n\n\fDefinition 1. We define SPARQL expressions recursively\nas follows. (1) A triple pattern t ∈ BIV × IV × BILV\nis an expression. (2) Let Q1 , Q2 be expressions and R\na filter condition. Then Q1 Filter R, Q1 Union Q2 ,\nQ1 Opt Q2 , and Q1 And Q2 are expressions.\n✷\n\nWe follow the compositional, set-based semantics proposed in [26] and define the result of evaluating SPARQL\nquery Q on document D using operator J.KD defined below.\nDefinition 4. Let t be a triple pattern, Q1 , Q2 SPARQL\nexpressions, R a filter condition, and S ⊂ V a finite set\nof variables. The semantics of SPARQL evaluation over\ndocument D is defined as follows.\n\nIn the remainder of the paper we restrict our discussion\nto safe filter expressions Q Filter R, where the variables\noccurring in R form a subset of the variables in Q. As shown\nin [1], this restriction does not compromise expressiveness.\n\nJtKD := {μ | dom(μ) = vars(t) and μ(t) ∈ D}\nJQ1 And Q2 KD\n:= JQ1 KD ✶ JQ2 KD\nJQ1 Opt Q2 KD\n:= JQ1 KD\nJQ2 KD\nJQ1 Union Q2 KD := JQ1 KD ∪ JQ2 KD\nJQ1 Filter RKD := σR (JQ1 KD )\nJSelectS (Q1 )KD := πS (JQ1 KD )\n\n1\n\nNext, we define SPARQL queries on top of expressions.1\nDefinition 2. Let Q be a SPARQL expression and let\nS ⊂ V a finite set of variables. A SPARQL query is an\nexpression of the form SelectS (Q).\n✷\n\nFinally, we extend the definition of function vars. Let Q\nbe a SPARQL expression, A a SPARQL Algebra expression,\nand R a filter condition. By vars(A), vars(Q), and vars(R)\nwe denote the set of variables in A, Q, and R, respectively.\nFurther, we define function safeVars(A), which denotes the\nsubset of variables in vars(A) that are inevitably bound when\nevaluating A on any document D.\n\nSPARQL Semantics. A mapping is a partial function\nV → BIL from a subset of variables V to RDF terms BIL.\nThe domain of a mapping μ, written dom(μ), is defined as the\nsubset of V for which μ is defined. As a naming convention,\nwe distinguish variables from elements in BIL through a\nleading question mark symbol. Given two mappings μ1 , μ2 ,\nwe say μ1 is compatible with μ2 if μ1 (?x) = μ2 (?x) for\nall ?x ∈ dom(μ1 ) ∩ dom(μ2 ). We write μ1 ∼ μ2 if μ1\nand μ2 are compatible, and μ1 6∼ μ2 otherwise. Further, we\nwrite vars(t) to denote all variables in triple pattern t and by\nμ(t) we denote the triple pattern obtained when replacing all\nvariables ?x ∈ dom(μ) ∩ vars(t) in t by μ(?x).\n\nDefinition 5. Let A be a SPARQL Algebra expression,\nS ⊂ V a finite set of variables, and R a filter condition. We define function safeVars(A) recursively on\nthe structure of expression A as follows.\nsafeVars(JtKD )\n:=\nsafeVars(A1 ✶ A2 ) :=\nsafeVars(A1 ∪ A2 ) :=\nsafeVars(A1 \\ A2 ) :=\nsafeVars(A1\nA2 ) :=\nsafeVars(πS (A1 )) :=\nsafeVars(σR (A1 )) :=\n\nGiven variables ?x, ?y and constants c, d, a filter condition\nR is either an atomic filter condition of the form bound(?x)\n(abbreviated as bnd(?x)), ?x = c, ?x =?y, or a combination\nof atomic conditions using connectives ¬, ∧, ∨. Condition\nbnd(?x) applied to a mapping set Ω returns all mappings in\nΩ for which ?x is bound, i.e. {μ ∈ Ω |?x ∈ dom(μ)}. The\nconditions ?x = c and ?x =?y are equality checks, comparing the values of ?x with c and ?y, respectively. These\nchecks fail whenever one of the variables is not bound. We\nwrite μ |= R if mapping μ satisfies filter condition R (see\nDefinition 16 in Appendix B.2 for a formal definition). The\nsemantics of SPARQL is then formally defined using a compact algebra over mapping sets (cf. [26]). The definition of\nthe algebraic operators join ✶, union ∪, set minus \\, left\nouter join\n, projection π, and selection σ is given below.\n\n1\n\nDefinition 3. Let Ω, Ωl , Ωr denote mapping sets, R a\nfilter condition, and S ⊂ V a finite set of variables. We\n, π, and σ:\ndefine the algebraic operations ✶, ∪, \\,\n\n1\n\n{μl ∪ μr | μl ∈ Ωl , μr ∈ Ωr : μl ∼ μr }\n{μ | μ ∈ Ωl or μ ∈ Ωr }\n{μl ∈ Ωl | for all μr ∈ Ωr : μl 6∼ μr }\n(Ωl ✶ Ωr ) ∪ (Ωl \\ Ωr )\n{μ1 | ∃μ2 : μ1 ∪ μ2 ∈ Ω ∧ dom(μ1 ) ⊆ S\n∧ dom(μ2 ) ∩ S = ∅}\n:= {μ ∈ Ω | μ |= R}\n✷\n\nΩl ✶ Ωr :=\nΩl ∪ Ωr :=\nΩl \\ Ωr :=\nΩr:=\nΩl\nπS (Ω) :=\nσR (Ω)\n\nvars(t)\nsafeVars(A1 ) ∪ safeVars(A2 )\nsafeVars(A1 ) ∩ safeVars(A2 )\nsafeVars(A1 )\nsafeVars(A1 )\nsafeVars(A1 ) ∩ S\nsafeVars(A1 )\n✷\n\nRelational Databases, Constraints and Chase.\nWe assume that the reader is familiar with first-order logic\nand relational databases. We denote by dom(I) the domain of the relational database instance I, i.e. the set of\nconstants and null values that occur in I. The constraints\nwe consider, are tuple-generating dependencies (TGD) and\nequality-generating dependencies (EGD). TGDs have the\nform ∀x(φ(x) → ∃yψ(x, y)) and EGDs have the form\n∀x(φ(x) → xi = xj ). A more exact definition of these\ntypes of constraints can be found in Appendix D.1. In the\nrest of the paper Σ stands for a fixed set of TGDs and EGDs.\nIf an instance I is not a model of some constraint α, then we\nwrite I 2 α.\n\n1\n\n1\n\n✷\n\nWe now introduce the chase as defined in [8]. A chase\nα,a\nstep I → J takes a relational database instance I such that\nI 2 α(a) and adds tuples (in case of TGDs) or collapses some\nelements (in case of EGDs) such that the resulting relational\ndatabase J is a model of α(a). If J was obtained from I in\nthat kind, we sometimes also write Ia ⊕ Cα instead of J. A\nchase sequence is a sequence of relational database instances\nI0 , I1 , ... such that Is+1 is obtained from Is by a chase step.\n\n1\nWe do not consider the remaining SPARQL query forms\nAsk, Construct, and Describe in this paper.\n\n3\n\n\f3. SPARQL Complexity\n\nA chase sequence I0 , ..., In is terminating if In |= Σ. In\nthis case, we set I Σ := In as the result (I Σ is defined only\nunique up to homomorphic equivalence, but this will suffice).\nOtherwise, I Σ is undefined. I Σ is also undefined in case the\nchase fails. More details can be found in Appendix D.1.\nThe chase does not always terminate and there has been\ndifferent work on sufficient termination conditions. In [28]\nthe following condition, based on the notion of dependency\ngraph, was introduced. The dependency graph dep(Σ) :=\n(V, E) of a set of constraints Σ is the directed graph defined\nas follows. V is the set of positions that occur in Σ. There\nare two kind of edges in E. Add them as follows: for every\nTGD ∀x(φ(x) → ∃yψ(x, y)) ∈ Σ and for every x in x that\noccurs in ψ and every occurrence of x in φ in position π1\n\nWe introduce operator shortcuts A := And, F := Filter,\nO := Opt, U := Union, and denote the class of expressions that can be constructed using a set of operators by\nconcatenating their shortcuts. Further, by E we denote the\nwhole class of SPARQL expressions, i.e. E := AF OU. The\nterms class and fragment are used interchangeably.\nWe first present a complete complexity study for all possible expression classes, which complements the study in [26].\nWe assume the reader to be familiar with basics of complexity theory, yet summarize the background in Appendix A.1,\nto be self-contained. We follow [26] and take the combined\ncomplexity of the Evaluation problem as a yardstick:\n\n• for every occurrence of x in ψ in position π2 , add an edge\nπ1 → π2 (if it does not already exist).\n• for every existentially quantified variable y and for every\noccurrence of y in a position π2 , add a special edge\n∗\nπ1 → π2 (if it does not already exist).\n\nEvaluation: given a mapping μ, a document D, and an\nexpression/query Q as input: is μ ∈ JQKD ?\nThe theorem below summarizes previous results from [26].\nTheorem 1. [26] The Evaluation problem is\n• in PTime for class AF ; membership in PTime for\nclasses A and F follows immediately,\n• NP-complete for class AF U, and\n✷\n• PSpace-complete for classes AOU and E.\n\nA set Σ of TGDs and EGDs is called weakly acyclic iff\ndep(Σ) has no cycles through a special edge. In [8] weak\nacyclicity was lifted to stratification. Given two TGDs or\nEGDs α = ∀x1 φ, β = ∀x2 ψ, we define α ≺ β (meaning\nthat firing α may cause β to fire) iff there exist relational\ndatabase instances I, J and a ∈ dom(I), b ∈ dom(J) s.t.\n\nOur first goal is to establish a more precise characterization\nof the Union operator. As also noted in [26], its design was\nsubject to controversial discussions in the SPARQL working\ngroup2, and we pursue the goal to improve the understanding\nof the operator and its relation to others, beyond the known\nNP-completeness result for class AF U. The following theorem gives the results for all missing Opt-free fragments.\n\n• I 2 ψ(b) (possibly b is not in dom(I)),\nα,a\n\n• I −→ J, and\n• J 2 ψ(b).\nThe chase graph G(Σ) = (Σ, E) of a set of constraints Σ\ncontains a directed edge (α, β) between two constraints iff\nα ≺ β. We call Σ stratified iff the set of constraints in every\ncycle of G(Σ) are weakly acyclic. It is immediate that weak\nacyclicity implies stratification; further, it was proven in [8]\nthat the chase always terminates for stratified constraint sets.\n\nTheorem 2. The Evaluation problem is\n• in PTime for classes U and F U, and\n• NP-complete for class AU.\n\n✷\n\nThe hardness part of the NP-completeness proof for fragment AU is a reduction from SetCover. The interested\nreader will find details and other technical results of this\nsection in Appendix A. Theorems 1 and 2 clarify that the\nsource of complexity in Opt-free fragments is the combination of And and Union. In particular, adding or removing\nFilter-expressions in no case affects the complexity.\n\nA Conjunctive Query (CQ) is an expression of the form\nans(x) ← φ(x, z), where φ is a CQ of relational atoms and\nx, z are tuples of variables and constants. Every variable in\nx must also occur in φ. The semantics of such a query on a\ndatabase instance I is q(I) := { a | I |= ∃zφ(a, z) }.\nLet q, q ′ be CQs and Σ be a set of constraints. We write\nq ⊑Σ q ′ if for all database instances I such that I |= Σ it\nholds that q(I) ⊆ q ′ (I) and say that q and q ′ are Σ-equivalent\n(q ≡Σ q ′ ) if q ⊑Σ q ′ and q ′ ⊑Σ q. In [9] an algorithm was\npresented that, given q and Σ, lists all Σ-equivalent minimal\n(with respect to the number of atoms in the body) rewritings\n(up to isomorphism) of q. This algorithm, called Chase &\nBackchase, uses the chase and therefore does not necessarily\nterminate. We denote its output by cbΣ (q) (if it terminates).\n\nWe now turn towards an investigation of the complexity of\noperator Opt and its interaction with other operators. The\nPSpace-completeness results for classes AOU and AF OU\nstated in Theorem 1 give only partial answers to the questions.\nOne of the main results in this section is the following.\nTheorem 3. Evaluation is PSpace-complete for O.✷\nThis result shows that already operator Opt alone makes\nthe Evaluation problem really hard. Even more, it upgrades the claim in [26] that \"the main source of complexity\nin SPARQL comes from the combination of Union and\n\nGeneral mathematical notation. The natural numbers N do not include 0; N0 is used as a shortcut for N ∪ {0}.\nFor n ∈ N, we denote by [n] the set {1, ..., n}. Further, for\na set M , we denote by 2M its powerset.\n\n2\nSee the discussion of disjunction in Section 6.1 in\nhttp://www.w3.org/TR/2005/WD-rdf-sparql-query-20050217/.\n\n4\n\n\f4. SPARQL Algebra\n\nOpt operators\", by showing that Union (and And) are not\nnecessary to obtain PSpace-hardness. The intuition of this\n(which is the algebraic\nresult is that the algebra operator\ncounterpart of operator Opt) is defined using operators ✶,\n∪, and \\; the mix of these algebraic operations compensates\nfor missing And and Union operators at syntax level. The\ncorollary below follows from Theorems 1 and 3 and makes\nthe complexity study of the expression fragments complete.\n\n1\n\nWe next present a rich set of algebraic equivalences for\nSPARQL Algebra. In the interest of a complete survey we\ninclude equivalences that have been stated before in [26].3\nOur main contributions in this section are (a) a systematic\nextension of previous rewriting rules, (b) a correction of an\nerratum in [26], and (c) the development and discussion of\nrewriting rules for SPARQL expressions involving negation.\n\nCorollary 1. The Evaluation problem for any expression fragment involving Opt is PSpace-complete. ✷\n\nWe focus on two fragments of SPARQL algebra, namely\nthe full class of algebra expressions A (i.e., algebra expressions build using operators ∪, ✶, \\,\n, π, and σ) and the\nunion- and projection-free expressions A− (build using only\noperator ✶, \\,\n, and σ). We start with a property that\nseparates A− from A, called incompatibility property.4\n\nDue to the high complexity of Opt, an interesting question\nis whether we can find natural syntactic conditions that lower\nthe complexity of fragments involving Opt. In fact, a restriction of the nesting depth of Opt expressions constitutes such\na condition. We define the Opt-rank r of an expression as its\ndeepest nesting of Opt expressions: for triple pattern t, expressions Q, and condition R, we define r (Q) recursively on\nthe structure of Q as r(t) := 0, r(Q1 Filter R) := r (Q1 ),\nr(Q1 And Q2 )=r (Q1 Union Q2 ) := max (r (Q1 ), r (Q2 )),\nand r(Q1 Opt Q2 ) := max (r (Q1 ), r (Q2 )) + 1.\n\n1\n\n1\n\nProposition 1. Let Ω be the mapping set obtained from\nevaluating an A− -expression on any document D. All\npairs of distinct mappings in Ω are incompatible. ✷\nFigure 1(I-IV) surveys rewriting rules that hold with respect to common algebraic laws (we write A ≡ B if A is\nequivalent to B on any document D). Group I contains\nresults obtained when combining an expression with itself\nusing the different operators. It is interesting to see that (JIdem) and (LIdem) hold only for fragment A− ; in fact, it\nis the incompatibility property that makes the equivalences\nvalid. The associativity and commutativity rules were introduced in [26] and we list them for completeness. Most\ninteresting is distributivity. We observe that ✶, \\,\nare\nright-distributive over ∪, and ✶ is also left-distributive over\n∪. The listing in Figure 1 is complete in the following sense:\n\nBy E ≤n we denote the class of expressions Q ∈ E with\nr(Q) ≤ n. The following theorem shows that, when restricting the Opt-rank of expressions, the Evaluation problem\nfalls into a class in the polynomial hierarchy.\nTheorem 4. For any n ∈ N0 , the Evaluation problem\nis ΣP\n✷\nn+1 -complete for the SPARQL fragment E ≤n .\n\n1\n\nObserve that Evaluation for class E ≤0 is complete for\nΣP\n1 =NP, thus obtaining the result for Opt-free expressions\n(cf. Theorem 1). With increasing nesting-depth of Opt expressions we climb up the polynomial hierarchy (PH). This is\nreminiscent of the Validity-problem for quantified boolean\nformulae, where the number of quantifier alternations fixes\nthe complexity class in the PH. In fact, the hardness proof\n(see Appendix A.3) makes these similarities explicit.\n\n1\n\nLemma 1. Let O1 := { ✶, \\,\n} and O2 := O1 ∪ {∪}.\n• The two equivalences (JIdem) and (LIdem) in general do not hold for fragments larger than A− .\n• Associativity and Commutativity do not hold for\noperators \\ and\n.\n• Neither \\ nor\nare left-distributive over ∪.\n• Let o1 ∈ O1 , o2 ∈ O2 , and o1 6= o2 . Then o2 is\nneither left- nor right-commutative over o1 .\n✷\n\n1\n\nWe finally extend our study to SPARQL queries, i.e. fragments involving top-level projection in the form of a Select-operator (see Def. 2). We extend the notation for\nclasses as follows. Let F be an expression fragment. We\ndenote by F+ the class of queries of the form SelectS (Q),\nwhere S ⊂ V is a finite set of variables and Q ∈ F is an expression. The next theorem shows that we obtain (top-level)\nprojection for free in fragments that are at least NP-complete.\n\n1\n\nCases (3) and (4) rule out distributivity for all operator\ncombinations different from those listed in Figure 1. This\nresult implies that Proposition 1(3) in [26] is wrong:\nExample 1. We show that the SPARQL equivalence\n\nTheorem 5. Let C be a complexity class and F a class\nof expressions. If Evaluation is C-complete for F and\nC ⊇ NP then Evaluation is also C-complete for F+ .✷\n\nA1 Opt (A2 Union A3 ) ≡ (A1 Opt A2 ) Union (A1 Opt A3 )\n\nstated in Proposition 1(3) in [26] does not hold in\nthe general case. We choose database D={(0, c, 1)} and\nset A1 =(0, c, ?a), A2 =(?a, c, 1), and A3 =(0, c, ?b). Then\nJA1 Opt (A2 Union A3 )KD = {{?a 7→ 1, ?b 7→ 1}},\nbut J(A1 Opt A2 ) Union (A1 Opt A3 )KD evaluates to\n{{?a 7→ 1}, {?a 7→ 1, ?b 7→ 1}}. The results differ.\n✷\n\nIn combination with Corollary 1 we immediately obtain\nPSpace-completeness for query classes involving operator Opt. Similarly, all Opt-free query fragments involving both And and Union are NP-complete. We conclude\nour complexity analysis with the following theorem, which\nshows that top-level projection makes the Evaluation\nproblem for And-only expressions considerably harder.\n\n3\nMost equivalences in [26] were established at the syntactic\nlevel. In summary, rule (MJ) in Proposition 2 and about\nhalf of the equivalences in Figure 1 are borrowed from [26].\nWe indicate these rules in the proofs in Appendix B.\n4\nLemma 2 in [26] also builds on this observation.\n\nTheorem 6. Evaluation is NP-complete for A+ . ✷\n5\n\n\fI. Idempotence and Inverse\nA∪A\n≡A\nA− ✶ A− ≡ A−\nA− ≡ A−\nA−\nA\\A\n≡∅\n\nV. Filter Decomposition and Elimination\nσR (A1 ∪ A2 ) ≡ σR (A1 ) ∪ σR (A2 )\nσR1 ∧R2 (A)\n≡ σR1 (σR2 (A))\nσR1 ∨R2 (A)\n≡ σR1 (A) ∪ σR2 (A)\nσR1 (σR2 (A)) ≡ σR2 (σR1 (A))\n\n(UIdem)\n(JIdem)\n(LIdem)\n(Inv)\n\n1\n\nσbnd(?x) (A1 )\nσbnd(?x) (A1 )\nσ¬bnd(?x) (A1 )\nσ¬bnd(?x) (A1 )\n\nII. Associativity\n(A1 ∪ A2 ) ∪ A3 ≡ A1 ∪ (A2 ∪ A3 )\n(A1 ✶ A2 ) ✶ A3 ≡ A1 ✶ (A2 ✶ A3 )\n\n(UAss)\n(JAss)\n\nIII. Commutativity\nA1 ∪ A2 ≡ A2 ∪ A1\nA1 ✶ A2 ≡ A2 ✶ A1\n\n(UComm)\n(JComm)\n\nIV. Distributivity\n(A1 ∪ A2 ) ✶ A3 ≡ (A1 ✶ A3 ) ∪ (A2 ✶ A3 )\nA1 ✶ (A2 ∪ A3 ) ≡ (A1 ✶ A2 ) ∪ (A1 ✶ A3 )\n(A1 ∪ A2 ) \\ A3 ≡ (A1 \\ A3 ) ∪ (A2 \\ A3 )\n(A1 ∪ A2 )\nA3 ≡ (A1\nA3 ) ∪ (A2\nA3 )\n\n(JUDistR)\n(JUDistL)\n(MUDistR)\n(LUDistR)\n\n1\n\n1\n\n1\n\n≡\n≡\n≡\n≡\n\n(SUPush)\n(SDecompI)\n(SDecompII)\n(SReord)\n\nA1 , if ?x ∈ safeVars(A1 )\n∅, if ?x 6∈ vars(A1 )\n∅, if ?x ∈ safeVars(A1 )\nA1 , if ?x 6∈ vars(A1 )\n\n(BndI)\n(BndII)\n(BndIII)\n(BndIV)\n\n1\n\nIf ?x ∈ safeVars(A2 ) \\ vars(A1 ), then\nσbnd(?x) (A1\nA2 ) ≡ A1 ✶ A2\n\n(BndV)\n\nVI. Filter Pushing\nThe following rules hold if vars(R) ⊆ safeVars(A1 ).\nσR (A1 ✶ A2 ) ≡ σR (A1 ) ✶ A2\nσR (A1 \\ A2 )\n≡ σR (A1 ) \\ A2\nσR (A1\nA2 ) ≡ σR (A1 )\nA2\n\n1\n\n(SJPush)\n(SMPush)\n(SLPush)\n\n1\n\nFigure 1: SA equivalences for A-expr. A, A1 , A2 , A3 ; A− -expr. A− ; filter condition R; variable ?x.\nWe pass on a detailed discussion of operator π, also because – when translating SPARQL queries into algebra expression – this operator appears only at the top-level. Still,\nwe emphasize that also for this operator rewriting rules exist,\ne.g. allowing to project away unneeded variables at an early\nstage. Instead, in the remainder of this section we will present\na thorough discussion of operator \\. The latter, in contrast\nto the other algebraic operations, has no direct counterpart at\nthe syntactic level. This complicates the encoding of queries\ninvolving negation and, as we will see, poses specific challenges to the optimization scheme. We start with the remark\nthat, as shown in [1], operator \\ can always be encoded at\nthe syntactic level through a combination of operators Opt,\nFilter, and bnd. We illustrate the idea by example.\n\nRemark 1. This erratum calls the existence of the union\nnormal form stated in Proposition 1 in [26] into question, as it builds upon the invalid equivalence. We actually do not see how to fix or compensate for this rule,\nso it remains an open question if such a union normal\nform exists or not. The non-existence would put different results into perspective, since – based on the claim\nthat Union can always be pulled to the top – the authors restrict the subsequent discussion to Union-free\nexpressions. For instance, results on well-defined patterns, normalization, and equivalence between compositional and operational semantics are applicable only\nto queries that can be brought into union normal form.\nArguably, this class may comprise most of the SPARQL\nqueries that arise in practice (queries without union or\nwith union only at the top-level also constitute very frequent patterns in other query languages, such as SQL).\nStill, a careful reinvestigation would be necessary to extend the results to queries beyond that class.\n✷\n\nExample 2. The following SPARQL expression Q1 and\nthe corresponding algebra expression A1 select all persons for which no name is specified in the data set.\nQ1 = Filter¬bnd(?n) ((?p, type, P erson) Opt\n((?p, type, P erson) And (?p, name, ?n)))\nA1 = σ¬bnd(?n) (J(?p, type, P erson)K\n(J(?p, type, P erson)K ✶ J(?p, name, ?n)K))\n\n1\n\nFigure 1(V-VI) presents rules for decomposing, eliminating, and rearranging (parts of) filter conditions. In combination with rewriting rules I-IV they provide a powerful framework for manipulating filter expressions in the style of RA filter rewriting and pushing. Most interesting is the use of safeVars as a sufficient precondition for (SJPush), (SMPush),\nand (SLPush).5 The need for this precondition arises from\nthe fact that joins over mappings are accepting for unbound\nvariables. In RA, where joins over null values are rejecting,\nthe situation is less complicated. For instance, given two RA\nrelations A1 , A2 and a (relational) filter R, (SJPush) is applicable whenever the schema of A1 contains all attributes in R.\nWe conclude this discussion with the remark that, for smaller\nfragments of SPARQL conditions, weaker preconditions for\nthe rules in group VI exist. For instance, if R = e1 ∧ * * * ∧ en\nis a conjunction of atomic equalities e1 , . . . , en , then the\nequivalences in group VI follow from the (weaker) condition\nvars(R) ⊆ vars(A) ∧ vars(B) ∩ vars(R) ⊆ safeVars(A).\n\n✷\n\nFrom an optimization point of view it would be desirable to\nhave a clean translation of this constellation using operator \\,\nbut the semantics maps Q1 into A1 , which contains operators\n, ✶, and predicate bnd, rather than \\. In fact, a better\nσ,\ntranslation (based on \\) exists for a class of practical queries\nand we will provide rewriting rules for such a transformation.\n\n1\n\nProposition 2. Let A1 , A2 be A-expressions and A−\n1 ,\n−\nA−\n1 be A -expressions. The following equivalences hold.\n(A1 \\ A2 ) \\ A3\n(A1 \\ A2 ) \\ A3\nA1 \\ A2\nA−\nA−\n2\n1\n\n1\n\n≡\n≡\n≡\n≡\n\n(A1 \\ A3 ) \\ A2\nA1 \\ (A2 ∪ A3 )\nA1 \\ (A1 ✶ A2 )\n−\nA−\n(A−\n1\n1 ✶ A2 )\n\n1\n\n(MReord)\n(MMUCorr)\n(MJ)\n(LJ)\n\n✷\n\nRules (MReord) and (MMUCorr) are general-purpose\nrewriting rules, listed for completeness. Most important in\nour context is rule (LJ). It allows to eliminate redundant\nsubexpressions in the right side of\n-expressions (for A−\n\n1\n\n5\nA variant of rule (SJPush), restricted to And-only queries,\nhas been stated (at syntax level) in Lemma 1(2) in [26].\n\n6\n\n\f1\n\nWe define the translation C1 (Q) := q, where\n\nexpressions), e.g. the application of (LJ) simplifies A1 to\nJ(?p, name, ?n)K).\nA′1 = σ¬bnd(?n) (J(?p, type, P erson)K\nThe following lemma allows for further simplification.\n\nq : ans(s) ← T (s1 , p1 , o1 ), . . . , T (sn , pn , on ),\nand s is a vector of variables containing exactly the\nvariables in S. We define C1−1 (q) as follows. It takes a\nCQ in the form of q as input and returns Q if it is a valid\nSPARQL query, i.e. if si ∈ BIV , pi ∈ IV , oi ∈ BILV\nfor all i ∈ [n]; otherwise, C1−1 (q) is undefined.\n✷\n\n−\n−\nLemma 2. Let A−\n1 , A2 be A -expressions, R a filter\ncondition, and ?x ∈ safeVars(A2 ) \\ vars(A1 ) a variable.\n−\n−\nThen σ¬bnd (?x) (A−\nA−\n✷\n1\n2 ) ≡ A1 \\ A2 holds.\n\n1\n\nThe application of the lemma to query A′1 yields the expression A′′1 = J(?p, type, P erson)K \\ J(?p, name, ?n)K. Combined with rule (LJ), we have established a powerful mechanism that often allows to make simulated negation explicit.\n\n5.\n\nDefinition 7. Let Σ be a set of RDF constraints, D an\nRDF database, and α = ∀x(φ(x) → ∃yψ(x, y)) ∈ Σ.\nWe use h(T (a1 , a2 , a3 )) := a2 (a1 , a3 ) if a2 is not a variable, otherwise\nVn we set it to the empty string.\nVn For a conT\n(a\njunction\n)\nof\natoms,\nwe\nset\nh(\ni\ni=1\ni=1 T (ai )) :=\nVn\nh(T\n(a\n)).\nThen,\nwe\ndefine\nthe\nconstraint\nα′ as\ni\ni=1\n′\n′\n∀x(h(φ(x)) → ∃yh(ψ(x, y))). We set Σ := {α | α ∈ Σ}\nif all α′ are constraints, otherwise Σ′ := ∅.\n\nSemantic SPARQL Query Optimization\n\nThis chapter complements the discussion of algebraic optimization with constraint-based, semantic query optimization\n(SQO). The key idea of SQO is to find semantically equivalent queries over a database that satisfies a set of integrity\nconstraints. These constraints might have been specified by\nthe user, extracted from the underlying database, or hold implicitly when SPARQL is evaluated on RDFS data coupled\nwith an RDFS inference system.6 More precisely, given a\nquery Q and a set of constraints Σ over an RDF database\nD s.t. D |= Σ, we want to enumerate (all) queries Q′ that\ncompute the same result on D. We write Q ≡Σ Q′ if Q\nis equivalent to Q′ on each database D s.t. D |= Σ. Following previous approaches [9], we focus on TGDs and\nEGDs, which cover a broad range of practical constraints\nover RDF, such as functional and inclusion dependencies.\nWhen talking about constraints in the following we always\nmean TGDs or EGDs. We refer the interested reader to [19]\nfor motivating examples and a study of constraints for RDF.\nWe represent each constraint α ∈ Σ by a first-order logic\nformula over a ternary relation TD (s, p, o) that stores all\ntriples contained in RDF database D and use T as the corresponding relation symbol. For instance, the constraint\n∀x1 , x2 (T (x1 , p1 , x2 ) → ∃y1 T (x1 , p2 , y1 )) states that each\nRDF resource with property p1 also has property p2 . Like in\nthe case of conjunctive queries we call a A+ query minimal\nif there is no equivalent A+ query with fewer triple patterns.\n\nLet S ⊂ V be a set of variables, Q ∈ A+ defined as\nQ = SelectS ((s1 , p1 , o1 ) And ... And (sn , pn , on )),\nand assume that pi is never a variable. We define the\ntranslation C2 (Q) := ans(s) ← p1 (s1 , o1 ), ..., pn (sn , on ),\nwhere vector s contains exactly the variables in S. For\na CQ q: ans(s) ← R1 (x11 , x12 ), ..., Rn (xn1 , xn2 ), we denote by C2−1 (q) the expression\nSelectS ((x11 , R1 , x12 ) And ... And (xn1 , Rn , xn2 ))\nif it is a SPARQL query, else C2−1 (q) is undefined. ✷\nC1 (Q) and C1−1 (Q) constitute straightforward translations\nfrom SPARQL And-only queries to CQs and back. The definition of C2 (Q) and C2−1 (Q) was inspired by the work in [13]\nand is motivated by the observation that in many real-world\nSPARQL queries variables do not occur in predicate position;\nit is applicable only in this context. Given that the second\ntranslation scheme is not always applicable, the reader may\nwonder why we introduced it. The reason is that the translation schemes are different w.r.t. the termination conditions\nfor the subsequent chase that they exhibit. We will come\nback to this issue when discussing termination conditions for\nthe chase in the next section (see Proposition 4).\n\nOur approach relies on the Chase & Backchase (C&B)\nalgorithm for semantic optimization of CQs proposed in [9].\nGiven a CQ q and a set Σ of constraints as input, the algorithm\noutputs all semantically equivalent and minimal q ′ ≡Σ q\nwhenever the underlying chase algorithm terminates. We\ndefer the discussion of chase termination to the subsequent\nsection and use the C&B algorithm as a black box with\nthe above properties. Our basic idea is as follows. First, we\ntranslate And-only blocks (or queries), so-called basic graph\npatterns (BGPs), into CQs and then apply C&B to optimize\nthem. We introduce two alternate translation schemes below.\n\nThe translation schemes, although defined for A+ queries,\ndirectly carry over to A-expressions, i.e. each expression\nQ ∈ A can be rewritten into the equivalent A+ -expression\nSelectvars(Q) (Q). Coupled with the C&B algorithm, they\nprovide a sound approach to semantic query optimization for\nAnd-only queries whenever the underlying chase algorithm\nterminates, as stated by the following lemma.\nLemma 3. Let Q an A+ -expression, D a database, and\nΣ a set of EGDs and TGDs.\n• If cbΣ (C1 (Q)) terminates then ∀Q′ ∈ A+ :\nQ′ ∈ C1−1 (cbΣ (C1 (Q))) ⇒ Q′ ≡Σ Q and Q′ minimal.\n• If C2 (Q) is defined, |Σ′ | = |Σ| and cbΣ′ (C2 (Q)) terminates then so does cbΣ (C1 (Q)).\n• If C2 (Q) is defined, |Σ′ | = |Σ| and cbΣ′ (C2 (Q)) terminates then ∀Q′ ∈ A+ :\nQ′ ∈ C1−1 (cbΣ (C1 (Q))) ⇒ Q′ ≡Σ Q.\n✷\n\nDefinition 6. Let S ⊂ V be a finite set of variables and\nQ ∈ A+ be a SPARQL query defined as\nQ = SelectS ((s1 , p1 , o1 ) And . . . And (sn , pn , on )).\n6\nNote that the SPARQL semantics disregards RDFS inference, but assumes that it is realized in a separate layer.\n\n7\n\n\f• If Q1 ≡Σ Selectvars(Q1 ) (Q1 And Q2 ) then\nJFilter¬bnd(?x) (Q1 Opt Q2 )KD = ∅.\n\nThe converse direction in bullets one and three does not\nhold in general, i.e. the scheme is not complete. Before we\naddress this issue, we illustrate the problem by example.\n\n• If SelectS (Q2 ) ≡Σ SelectS (Q2 ?x\n?y ) then\nSelectS (Filter?x=?y (Q2 )) ≡Σ SelectS (Q2 ?x\n?y ).\n\n′ ′\n\nExample 3. Let the two expressions Q1 := (?x, b, l ),\nQ2 := (?x, b,′ l′ ) And (?x, a, c), and let the constraint\n∀x1 , x2 , x3 (T (x1 , x2 , x3 ) → T (x3 , x2 , x1 )) be given. By\ndefinition, there are no RDF databases that contain a\nliteral in a predicate position because, according to the\nconstraint, such a literal would also occur in the subject\nposition, which is not allowed. Therefore, the answer\nto both expressions Q1 and Q2 is always the empty set,\nwhich implies Q1 ≡Σ Q2 . But it is easy to verify that\nC1 (Q1 ) ≡Σ C1 (Q2 ) does not hold. The reason for this\ndiscrepancy is that the universal plan [9] of the queries\nis not a valid SPARQL query.\n✷\n\n• If SelectS (Q2 ) ≡Σ SelectS (Q2 ?x\n?y ) then\nJFilter¬?x=?y (Q2 )KD = ∅.\n\n✷\n\nWe conclude this section with some final remarks. First,\nwe note that semantic optimization strategies are basically\northogonal to algebraic optimizations,hence both approaches\ncan be coupled with each other. For instance, we might\nget better optimization results when combining the rules for\nfilter decomposition and pushing in Figure 1(V-VI) with the\nsemantic rewriting rules for filter expressions in the lemma\nabove. Second, as discussed in [9], the C&B algorithm can\nbe enhanced by a cost function, which makes it easy to factor\nin cost-based query optimization approaches for SPARQL,\ne.g. in the style of [23]. This flexibility strengthens the\nprospectives and practicability of our semantic optimization\nscheme. The study of rewriting heuristics and the integration\nof a cost function, though, is beyond the scope of this paper.\n\nWe formalize this observation in the next lemma, i.e. provide a precondition that guarantees completeness.7 For a\nCQ q, we denote by U (q) its universal plan [9], namely the\nconjunctive query q ′ obtained from q by chasing its body.\nLemma 4. Let D be a database and Q an A+ -expression\nsuch that C1−1 (U (C1 (Q))) ∈ A+ .\n• If cbΣ (C1 (Q)) terminates then ∀Q′ ∈ A+ such that\nC1−1 (U (C1 (Q′ ))) ∈ A+ :\nQ′ ∈ C1−1 (cbΣ (C1 (Q))) ⇔ Q′ ≡Σ Q and Q′ minimal.\n• If C2 (Q) is defined, |Σ′ | = |Σ| and cbΣ′ (C2 (Q)) terminates then ∀Q′ ∈A+ s.t. C1−1 (U (C1 (Q′ ))) ∈ A+ :\nQ′ ∈ C1−1 (cbΣ (C1 (Q))) ⇔ Q′ ≡Σ Q and Q′ minimal.✷\n\n6. Chase Termination\nThe applicability of the C&B algorithm, and hence of our\nSQO scheme presented in the previous section, depends on\nthe termination of the underlying chase algorithm. Given\nan arbitrary set of constraints it is in general undecidable if\nthe chase terminates for every database instance [8]; still, in\nthe past several sufficient termination conditions have been\npostulated [16, 10, 9, 28, 8]. The strongest sufficient conditions known so far are weak acyclicity [28], which was\nstrictly generalized to stratification in [8], raising the recognition problem from P to coNP. Our SQO approach on top\nof the C&B algorithm motivated a reinvestigation of these\ntermination conditions, and as a key result we present two\nnovel chase termination conditions for the classical framework of relational databases, which empower virtually all\napplications that rely on the chase. Whenever we mention a database or a database instance in this section, we\nmean a relational database. We will start our discussion\nwith a small example run of the chase algorithm. The basic idea is simple: given a database and a set of constraints\nas input, it fixes constraint violations in the database instance. Consider for example database {R(a, b)} and constraint ∀x1 , x2 (R(x1 , x2 ) → ∃yR(x2 , y)). The chase first\nadds R(b, y1 ) to the instance, where y1 is a fresh null value.\nThe constraint is still violated, because y1 does not occur\nin the first position of an R-tuple. So, the chase will add\nR(y1 , y2 ), R(y2 , y3 ), R(y3 , y4 ), . . . in subsequent steps,\nwhere y2 , y3 , y4 , . . . are fresh null values. Obviously, the\nchase algorithm will never terminate in this toy example.\n\nBy now we have established a mechanism that allows us to\nenumerate equivalent queries of SPARQL And-only queries,\nor BGPs inside queries. Next, we provide extensions that go\nbeyond And-only queries. The first rule in the following\nlemma shows that sometimes Opt can be replaced by And;\ninformally spoken, it applies when the expression in the Opt\nclause is implied by the constraints. The second rule can be\nused to eliminate redundant BGPs in Opt-subexpressions.\nLemma 5. Let Q1 , Q2 , Q3 ∈ A and S ⊂ V a finite set\nof variables.\n• If Q1 ≡Σ Selectvars(Q1 ) (Q1 And Q2 ) then\nQ1 Opt Q2 ≡Σ Q1 And Q2 .\n• If Q1 ≡Σ Q1 And Q2 then\n(Q1 Opt (Q2 And Q3 )) ≡Σ Q1 Opt Q3 .\n✷\nNote that the preconditions are always expressed in terms\nof And-only queries and projection, thus can be checked\nusing our translation schemes and the C&B algorithm. We\nconclude our discussion of SQO with a lemma that gives\nrules for the elimination of redundant filter expressions.\nLemma 6. Let Q1 , Q2 ∈ A, S ⊂ V \\{?y} a set of variables, ?x, ?y ∈ vars(Q2 ), Σ a set of constraints, and D\na documents s.t. D |= Σ. Further let Q2 ?x\n?y be obtained\nfrom Q2 by replacing each occurrence of ?y by ?x.\n\nFigure 2 summarizes the results of this section and puts\nthem into context. First, we will introduce the novel class\nof safe constraints, which guarantees the termination of the\nchase. It strictly subsumes weak acyclicity, but is different\nfrom stratification. Building upon the definition of safety, we\n\n7\n\nWe might expect that situations as the one sketched in Example 3 occur rarely in practice, so the condition in Lemma 4\nmay guarantee completeness in most practical scenarios.\n\n8\n\n\fFigure 3: Left: Dependency graph. Right: Corresponding propagation graph (it has no edges).\nFigure 2: Chase termination conditions.\nsubsumes [4] nor the other way around. Like in the case of\nweak acyclicity, we define the safety condition with the help\nof the absence of cycles containing special edges in some\ngraph. We call this graph propagation graph.\n\nthen present safely restricted constraints as a consequent advancement of our ideas. The latter class strictly subsumes all\nremaining termination conditions known so far. Finally, we\nwill show that, based on our framework, we can easily define\nanother class called safely stratified constraints, which is\nstrictly contained in the class of safely restricted constraints,\nbut also subsumes weak acyclicity and safeness.\n\nDefinition 9. Given a set of TGDs Σ, the propagation\ngraph prop(Σ) := (aff(Σ), E) is the directed graph defined as follows. There are two kinds of edges in E. Add\nthem as follows: for every TGD ∀x(φ(x) → ∃yψ(x, y)) ∈\nΣ and for every x in x that occurs in ψ and every occurrence of x in φ in position π1\n• if x occurs only in affected positions in φ then, for\nevery occurrence of x in ψ in position π2 , add an\nedge π1 → π2 (if it does not already exist).\n• if x occurs only in affected positions in φ then, for\nevery existentially quantified variable y and for every occurrence of y in a position π2 , add a special\n∗\n✷\nedge π1 → π2 (if it does not already exist).\n\nSafe Constraints. The basic idea of the first termination condition is to keep track of positions a newly introduced\nlabeled null may be copied to. Consider for instance constraint R(x1 , x2 , x3 ), S(x2 ) → ∃yR(x2 , y, x1 ), which is not\nweakly acyclic. Its dependency graph is depicted in Figure\n3 (left). As illustrated in the toy example in the beginning\nof this section, a cascading of labeled nulls (i.e. new labeled\nnull values that are created over and over again) may cause a\nnon-terminating chase sequence. However, we can observe\nthat for the constraint above such a cascading of fresh labeled\nnulls cannot occur, i.e. no fresh labeled null can repeatedly\ncreate new labeled nulls in position R2 while copying itself\nto position R1 . The reason is that the constraint cannot be\nviolated with a fresh labeled null in R2 , i.e. if R(a1 , a2 , a3 )\nand S(a2 ) hold, but ∃yR(a2 , y, a1 ) does not, then a2 is never\na newly created labeled null. This is due to the fact that a2\nmust also occur in relation S, which is not modified when\nchasing only with this single constraint. Consequently, the\nchase sequence always terminates. We will later see that this\nis not a mere coincidence: the constraint is safe.\n\nDefinition 10. A set Σ of constraints is called safe iff\nprop(Σ) has no cycles going through a special edge. ✷\n\nDefinition 8. [4] Let Σ be a set of TGDs. The set of\naffected positions aff(Σ) of Σ is defined inductively as\nfollows. Let π be a position in the head of an α ∈ Σ.\n\nThe intuition of these definitions is that we forbid an unrestricted cascading of null values, i.e. with the help of the\npropagation graph we impose a partial order on the affected\npositions such that any newly introduced null value can only\nbe created in a position that has a higher rank in that partial\norder in comparison to null values that may occur in the body\nof a TGD. To state this more precisely, assume a TGD of the\nform ∀x(φ(x) → ∃yψ(x, y)) is violated. Then, I |= φ(a)\nand I 2 ∃yψ(a, y)) must hold. The safety condition ensures\nthat any position in the body that has a newly created labeled\nnull from a in itself and also occurs in the head of the TGD\nhas a strictly lower rank in our partial order than any position\nin which some element from y occurs. The main difference\nin comparison to weak acyclicity is that we look in a refined\nway (see affected positions) on where a labeled null can be\npropagated to. We note that given a set of constraints it can\nbe decided in polynomial time whether it is safe.\n\n• If an existentially quantified variable appears in π,\nthen π ∈ aff(Σ).\n• If the same universally quantified variable X appears both in position π, and only in affected positions in the body of α, then π ∈ aff(Σ).\n✷\n\nExample 4. Consider the TGD R(x1 , x2 , x3 ), S(x2 ) →\n∃yR(x2 , y, x1 ) from before. The dependency graph is\ndepicted in Figure 3 on the left side and its propagation\ngraph on the right side. The only affected position is\nR2 . From the respective definitions it follows that this\nconstraint is safe, but not weakly acyclic.\n✷\n\nAlthough we borrow this definition from [4] our focus is\ndifferent. We extend known classes of constraints for which\nthe chase terminates. The focus in [4] is on query answering\nin cases the chase may not terminate. Our work neither\n\nNote that if Σ is safe, then every subset of Σ is safe, too.\nWe will now compare safety to other termination conditions.\nIn the example, the propagation graph is a subgraph of the\ndependency graph. This is not a mere coincidence.\n\nTo formally define safety, we first introduce the notion of\naffected positions. Intuitively, a position is affected if, during\nthe application of the chase, a newly introduced labeled null\ncan be copied or created in it. Thus, the set of affected\npositions is an overestimation of the positions in which a\nnull value that was introduced during the chase may occur.\n\n9\n\n\fDefinition 13. A restriction system is a pair (G′ (Σ), f ),\nwhere G′ (Σ) := (Σ, E) is a directed graph and f : Σ →\n2pos(Σ) is a function such that\n• forall TGDs α and forall (α, β) ∈ E:\naff-cl(α, f (α)) ∩ pos({β}) ⊆ f (β),\n• forall EGDs α and forall (α, β) ∈ E:\nf (α) ∩ pos({β}) ⊆ f (β), and\n• forall α, β ∈ Σ: α ≺f (α) β =⇒ (α, β) ∈ E.\n✷\n\nTheorem 7. Let Σ be a set of constraints.\n• Then, prop(Σ) is a subgraph of dep(Σ). It holds\nthat if Σ is weakly acyclic, then it is also safe.\n• There is some Σ that is safe, but not stratified.\n• There is some Σ that is stratified, but not safe. ✷\nThe next result shows that safety guarantees termination\nwhile retaining polynomial time data complexity.\nTheorem 8. Let Σ be a fixed set of safe constraints.\nThen, there exists a polynomial Q ∈ N[X] such that for\nany database instance I, the length of every chase sequence is bounded by Q(||I||), where ||I|| is the number\nof distinct values in I.\n✷\n\nWe illustrate this definition by an example. It also shows\nthat restriction systems always exist.\nExample 5. Let Σ a set of constraints. Then, (G(Σ), f ),\nwhere f (α) := pos({α}) for all α ∈ Σ is a restriction\nsystem for Σ.\n✷\n\nSafely Restricted Constraints. In this section we\ngeneralize the method of stratification from [8] to a condition\nwhich we call safe restriction. The chase graph from [8]\nwill be a special case of our new notion. We then define\nthe notion of safe restriction and show that the chase always\nterminates for constraints obeying it.\n\nBased on the novel technical notion of restriction systems\nwe can easily define a new class of constraints.\nDefinition 14. Σ is called safely restricted if and only if\nthere is a restriction system (G′ (Σ), f ) for Σ such that\nevery strongly connected component in G′ (Σ) is safe. ✷\n\nLet α := S(x2 , x3 ), R(x1 , x2 , x3 ) → ∃yR(x2 , y, x1 ) and\nβ := R(x1 , x2 , x3 ) → S(x1 , x3 ). It can be seen that α ≺ β\nand β ≺ α. Further, {α, β} is not weakly acyclic, so it\nfollows that {α, β} is not stratified. Still, the chase will\nalways terminate: A firing of α may cause a null value to\nappear in position R2 , but a firing of β will never introduce\nnull values in the head of β although β ≺ α holds. This is\nthe key observation for the upcoming definitions. First, we\nwill refine the relation ≺ from [8]. This refinement helps us\nto detect if during the chase null values might be copied to\nthe head of some constraint. Let pos(Σ) denote the set of\npositions that occur in the body of some constraint in Σ.\n\nThe next theorem shows that safe restriction strictly extends the notion of stratification and safety.\nTheorem 9. If Σ is stratified or safe, then it is also safely\nrestricted. There is some Σ that is safely restricted but\nneither safe nor stratified.\n✷\nDefinition 14 implies that safely restricted constraints can\nbe recognized by a ΣP\n2 -algorithm. However, with the help\nof a canonical restriction system, we can show that safe\nrestriction can be decided in coNP (like stratification).\nTheorem 10. Given constraint set Σ it can be checked\nby a coNP-algorithm whether Σ is safely restricted. ✷\n\nDefinition 11. Let Σ a set of constraints and P ⊆ pos(Σ).\nFor all α, β ∈ Σ, we define α ≺P β iff there are tuples\na, b and a database instance I s.t.\n• I 2 α(a),\n• β is not applicable on b and I,\n• Ia ⊕ Cα 2 β(b),\n• null values in I occur only in positions from P , and\n• the firing of β in the case of bullet three copies some\n✷\nnull value from Ia ⊕ Cα to the head of β.\n\nThe next theorem is the main contribution of this section.\nIt states that the chase will always terminate in polynomial\ntime data complexity for safely restricted constraints.\nTheorem 11. Let Σ be a fixed set of safely restricted\nconstraints. Then, there exists a polynomial Q ∈ N[X]\nsuch that for any database instance I, the length of\nevery chase sequence is bounded by Q(||I||), where ||I||\nis the number of distinct values in I.\n✷\n\nWe next introduce a notion for affected positions relative\nto a constraint and a set of positions.\n\nTo the best of our knowledge safe restriction is the most\ngeneral sufficient termination condition for TGDs and EGDs.\nWe finally compare the chase graph to restriction systems.\nThe reader might wonder what happens if we substitute weak\nacyclicity with safety in the definition of stratification (in the\npreliminaries).\n\nDefinition 12. For any set of positions P and tgd α let\naff-cl(α, P ) be the set of positions π from the head of α\nsuch that either\n• the variable in π occurs in the body of α only in\npositions from P or\n• π contains an existentially quantified variable.\n✷\n\nDefinition 15. We call Σ safely stratified iff the constraints in every cycle of G(Σ) are safe.\n✷\n\nThe latter definition and the refinement of ≺ will help us\nto define the notion of a restriction system, which is a strict\ngeneralization of the chase graph introduced in [8].\n\nWe obtain the following result, showing that with the help\nof restriction systems, we strictly extended the method of the\nchase graph from [8].\n10\n\n\f8. References\n\nTheorem 12. Let Σ be a set of constraints.\n• If Σ is weakly acyclic or safe, then it is safely stratified.\n• If Σ is safely stratified, then it is safely restricted.\n• There is some set of constraints that is safely restricted, but not safely stratified.\n✷\n\n[1] R. Angles and C. Gutiérrez. The Expressive Power of\nSPARQL. In ISWC, pages 114–129, 2008.\n[2] S. Arora and B. Barak. Computational Complexity: A\nModern Approach. Cambridge University Press, 2007.\n[3] C. Beeri and M. Y. Vardi. A Proof Procedure for Data\nDependencies. J. ACM, 31(4):718–741, 1984.\n\nNote that we used safety instead of safe stratification in\nthe definition of safe restrictedness although safely stratified\nconstraints are the provably larger class. This is due to the\nfact that safety is easily checkable and would not change the\nclass of constraints. The next proposition clarifies this issue.\n\n[4] A. Calı̀, G. Gottlob, and M. Kifer. Taming the Infinite\nChase: Query Answering under Expressive Relational\nConstraints. In Descr. Logics, volume 353, 2008.\n[5] U. S. Chakravarthy, J. Grant, and J. Minker. Logic-based\nApproach to Semantic Query Optimization. TODS,\n15(2):162–207, 1990.\n\nProposition 3. Σ is safely restricted iff there is a restriction system (G′ (Σ), f ) for Σ such that every strongly\nconnected component in G′ (Σ) is safely stratified. ✷\n\n[6] R. Cyganiac. A relational algebra for SPARQL. Technical\nReport, HP Laboratories Bristol, 2005.\n[7] D. Abadi et al. Scalable Semantic Web Data Management\nUsing Vertical Partitioning. In VLDB, pages 411–422, 2007.\n\nIn the previous section we proposed two SPARQL translation schemes and it is left to explain why we introduced two\nalternative schemes. The next proposition states that the two\nschemes behave differently with respect to safe restriction.\n\n[8] A. Deutsch, A. Nash, and J. Remmel. The Chase Revisited.\nIn PODS, pages 149–158, 2008.\n[9] A. Deutsch, L. Popa, and V. Tannen. Query Reformulation\nwith Constraints. SIGMOD Record, 35(1):65–73, 2006.\n[10] A. Deutsch and V. Tannen. XML queries and constraints,\ncontainment and reformulation. Theor. Comput. Sci.,\n336(1):57–87, 2005.\n\nProposition 4. Let Σ be a non-empty set of constraint\nset over a ternary relation symbol T .\n• There is some Σ that is safely restricted, but Σ′ = ∅,\ni.e. the second translation scheme is not applicable.\n• There is some Σ such that |Σ| = |Σ′ | and Σ′ is safely\nrestricted, but Σ is not.\n✷\n\n[11] F. Bry et al. Foundations of Rule-based Query Answering.\nIn Reasoning Web, pages 1–153, 2007.\n[12] G. H. L. Fletcher and P. W. Beck. A Role-free Approach to\nIndexing Large RDF Data Sets in Secondary Memory for\nEfficient SPARQL Evaluation. CoRR, abs/0811.1083, 2008.\n\nReferring back to Lemma 3, this means we might check\nboth Σ or Σ′ for safe restrictedness, and can guarantee termination of the chase if at least one of them is safely restricted.\n\n[13] G. Serfiotis et al. Containment and Minimization of RDF/S\nQuery Patterns. In ISWC, pages 607–623, 2005.\n\n7.\n\n[15] A. Y. Halevy. Answering Queries Using Views: A Survey.\nVLDB Journal, pages 270–294, 2001.\n\n[14] C. Gutiérrez, C. A. Hurtado, and A. O. Mendelzon.\nFoundations of Semantic Web Databases. In PODS, pages\n95–106, 2004.\n\nConclusion\n\n[16] D. S. Johnson and A. Klug. Testing Containment of\nConjunctive Queries under Functional and Inclusion\nDependencies. In PODS, pages 164–169, 1982.\n\nWe have discussed several facets of the SPARQL query\nlanguage. Our complexity analysis extends prior investigations [26] and (a) shows that the combination of And\nand Union is the main source of complexity in Opt-free\nSPARQL fragments and (b) clarifies that yet operator Opt\nalone makes SPARQL evaluation PSpace-complete. We\nalso show that, when restricting the nesting depth of Optexpressions, we obtain better complexity bounds.\n\n[17] J. J. King. QUIST: a system for semantic query\noptimization in relational databases. In VLDB, pages\n510–517, 1981.\n[18] L. Sidirourgos et al. Column-store Support for RDF Data\nManagement: not all swans are white. In VLDB, pages\n1553–1563, 2008.\n[19] G. Lausen, M. Meier, and M. Schmidt. SPARQLing\nConstraints for RDF. In EDBT, pages 499–509, 2008.\n\nThe subsequent study of SPARQL Algebra lays the foundations for transferring established Relational Algebra optimization techniques into the context of SPARQL. Additionally, we considered specifics of the SPARQL query language,\nsuch as rewriting of SPARQL queries involving negation.\nThe algebraic optimization approach is complemented by a\npowerful framework for semantic query optimization. We\nargue that a combination of both algebraic and semantic\noptimization will push the limits of existing SPARQL implementations and leave the study of a schematic rewriting\napproach and good rewriting heuristics as future work.\n\n[20] M. Lenzerini. Data Integration: A Theoretical Perspective.\nIn PODS, pages 233–246, 2002.\n[21] M. Schmidt et al. An Experimental Comparison of RDF\nData Management Approaches in a SPARQL Benchmark\nScenario. In ISWC, pages 82–97, 2008.\n[22] M. Schmidt et al. SP2 Bench: A SPARQL Performance\nBenchmark. In ISWC, 2009.\n[23] M. Stocker et al. SPARQL Basic Graph Pattern\nOptimization Using Selectivity Estimation. In WWW, 2008.\n[24] D. Maier, A. Mendelzon, and Y. Sagiv. Testing Implications\nof Data Dependencies. In SIGMOD, pages 152–152, 1979.\n\nFinally, our results on chase termination empower the practicability of SPARQL query optimization in the presence of\nconstraints and directly carry over to other applications that\nrely on the chase, such as [28, 20, 15, 9].\n\n[25] T. Neumann and G. Weikum. RDF-3X: a RISC-style\nengine for RDF. PVLDB, 1(1):647–659, 2008.\n[26] J. Pérez, M. Arenas, and C. Gutiérrez. Semantics and\nComplexity of SPARQL. CoRR, cs/0605124, 2006.\n\n11\n\n\f[27] A. Polleres. From SPARQL to Rules (and back). In WWW,\npages 787–796, 2007.\n\nAPPENDIX\n\n[28] R. Fagin et al. Data Exchange: Semantics and Query\nAnswering. Theor. Comput. Sci., 336(1):89–124, 2005.\n\nA.\n\n[29] Semantic Web Challenge. Billion triples dataset.\nhttp://www.cs.vu.nl/~ pmika/swc/btc.html.\n[30] L. J. Stockmeyer. The polynomial-time hierarchy. Theor.\nComput. Sci., 3:1–22, 1976.\n\nProofs of the Complexity Results\n\nThis section contains the complexity proofs of the Evaluation problem for the fragments studied in Section 3. We\nrefer the interested reader to [26] for the proof of Theorem 1.\nWe start with some basics from complexity theory.\n\n[31] C. Weiss, P. Karras, and A. Bernstein. Hexastore: Sextuple\nIndexing for Semantic Web Data Management. In VLDB,\npages 1008–1019, 2008.\n\nA.1 Background from Complexity Theory\nComplexity Classes. As usual, we denote by PTime\n(or P, for short) the complexity class comprising all problems\nthat can be decided by a deterministic Turing Machine (TM)\nin polynomial time, by NP the set of problems that can be\ndecided by a non-deterministic TM in polynomial time, and\nby PSpace the class of problems that can be decided by a\ndeterministic TM within polynomial space bounds.\nThe Polynomial Hierarchy\nGiven a complexity class C we denote by coC the set of\ndecision problems whose complement can be decided by a\nTM in class C. Given complexity classes C1 and C2 , the\n2\nclass CC\n1 captures all problems that can be decided by a TM\nM1 in class C1 enhanced by an oracle TM M2 for solving\nproblems in class C2 . Informally, engine M1 can use M2\nto obtain a yes/no-answer for a problem in C2 in a single\nstep. We refer the interested reader to [2] for a more formal\ndiscussion of oracle machines. Finally, we define the classes\nP\nΣP\ni and Πi recursively as\nP\n\nΣn\nP\nP\n, and put\nΣP\n0 = Π0 :=P and Σn+1 :=NP\nΣP\nP\nΠn+1 :=coNP n .\n\nThe polynomial hierarchy PH [30] is then defined as\nPH =\n\nS\n\ni∈N0\n\nΣP\ni\n\nP\nP\nP\nIt is folklore that ΣP\ni = coΠi , and that Σi ⊆ Πi+1\nP\nP\nand Πi ⊆ Σi+1 holds. Moreover, the following inclusion\nP\nhierarchies for ΣP\ni and Πi are known.\nP\nP\nP = ΣP\n0 ⊆ NP = Σ1 ⊆ Σ2 ⊆ * * * ⊆ PSPACE, and\nP\nP\nP = Π0 ⊆ coNP = Π1 ⊆ ΠP\n2 ⊆ * * * ⊆ PSPACE.\n\nComplete Problems\nWe consider completeness only with respect to polynomialtime many-one reductions. QBF, the tautology test for quantified boolean formulas, is known to be PSpace-complete\n[2]. Forms of QBF with restricted quantifier alternation are\nP\ncomplete for classes ΠP\ni or Σi depending on the question if\nthe first quantified of the formula is ∀ or ∃. A more thorough\nintroduction to complete problems in the polynomial hierarchy can be found in [2]. Finally, the NP-completeness of\nthe SetCover-problem and the 3Sat-problem is folklore.\n12\n\n\fA.2\n\nFinally we define the SPARQL expression\n\nOPT-free Fragments (Theorem 2)\n\nP := PS And . . . And PS ,\nwhere PS appears exactly k times.\n\nFragment U: UNION (Theorem 2(1))\nFor a Union-only expression P and data set D it suffices\nto check if μ ∈ JtKD for any triple pattern t in P . This can\neasily be achieved in polynomial time.✷\n\nIt is straightforward to show that SetCover is true if\nand only if μ = {?U1 7→ 1, . . . , ?Uk 7→ 1} ∈ JP KD . The\nintuition of the encoding is as follows. PS encodes all subsets\nSi . A set element, say x, is represented in SPARQL by a\nmapping from variable ?X to value 1. The encoding of P\nallows us to merge (at most) k arbitrary sets Si . We finally\ncheck if the universe U can be constructed this way.✷\n\nFragment F U: FILTER + UNION (Theorem 2(1))\nWe present a PTime-algorithm that solves the Evaluation\nproblem for this fragment. It is defined on the structure of\nthe input expression P and returns true if μ ∈ JP KD , false\notherwise. We distinguish three cases. (a) If P = t is\na triple pattern, we return true if and only if μ ∈ JtKD .\n(b) If P = P1 Union P2 we (recursively) check if μ ∈\nJP1 KD ∨ μ ∈ JP2 KD holds. (c) If P = P1 Filter R for\nany filter condition R we return true if and only if μ ∈\nJP1 KD ∧ R |= μ. It is easy to see that the above algorithm\nruns in polynomial time. Its correctness follows from the\ndefinition of the algebraic operators ∪ and σ.✷\n\nRemark 2. The proof above relies on the fact that mapping μ is part of the input of the Evaluation problem.\nIn fact, when fixing μ the resulting (modified) version\nof the Evaluation problem can be solved in PTime.✷\nA.3 Fragments Including Operator OPT\nWe now discuss several fragments including Opt. One\ngoal here is to show that fragment O is PSpace-complete\n(c.f. Theorem 3); PSpace-completeness for all fragments\ninvolving Opt then follows (cf. Corollary 1). Given the\nPSpace-completeness results for fragment E = AF OU , it\nsuffices to prove hardness for all smaller fragments; membership is implicit. Our road map is as follows.\n\nFragment AU: AND + UNION (Theorem 2(2))\nIn order to show that Evaluation for this fragment is NPcomplete we have to show membership and hardness.\nMembership in NP. Let P be a SPARQL expression\ncomposed of operators And and Union, D a document,\nand μ a mapping. We provide an NP-algorithm that returns\ntrue if μ ∈ JP KD , and false otherwise. Our algorithm is\ndefined on the structure of P . (a) If P = t return true if\nμ ∈ JtKD , false otherwise. (b) If P = P1 Union P2 , we\nreturn the truth value of μ ∈ JP1 KD ∨ μ ∈ JP2 KD . (c) If\nP = P1 And P2 , we guess a decomposition μ = μ1 ∪ μ2\nand return the truth value of μ1 ∈ JP1 KD ∧ μ2 ∈ JP2 KD .\nCorrectness of the algorithm follows from the definition of\nthe algebraic operators ✶ and ∪. It can easily be realized by\na non-deterministic TM that runs in polynomial time, which\nproves membership in NP.\n\n1. We first show PSpace-hardness for fragment AF O.\n2. We then show PSpace-hardness for fragment AO.\n3. Next, a rewriting of operator And by Opt is presented,\nwhich can be used to eliminate all And operators in\nthe proof of (2). PSpace-completeness for O then is\nshown using this rewriting rule.\n4. Finally, we prove Theorem 4, i.e. show that fragment\nE ≤n is ΣP\nn+1 -complete, making use of part (1).\nFragment AF O: AND + FILTER + OPT\n\nNP-Hardness. We reduce the SetCover problem to the\nEvaluation problem for SPARQL (in polynomial time).\nSetCover is known to be NP-complete, so the reduction\ngives us the desired hardness result.\n\nWe present a (polynomial-time) reduction from QBF to\nEvaluation for fragment AF O. The QBF problem is\nknown to be PSpace-complete, so this reduction gives us the\ndesired PSpace-hardness result. Membership in PSpace,\nand hence PSpace-completeness, then follows from Theorem 1(3). QBF is defined as follows.\n\nThe decision version of SetCover is defined as follows.\nLet U = {u1 , . . . , uk } be a universe, S1 , . . . Sn ⊆ U be\nsets over U , and let k be positiveSinteger. Is there a set\nI ⊆ {1, . . . , n} of size | I |≤ k s.t. i∈I Si = U ?\n\nQBF: given a quantified boolean formula of the form\n\nWe use the fixed database D := {(a, b, 1)} for our encoding and represent each set Si = {x1 , x2 , . . . , xm } by a\nSPARQL expression of the form\n\nφ = ∀x1 ∃y1 ∀x2 ∃y2 . . . ∀xm ∃ym ψ,\nwhere ψ is a quantifier-free boolean formula,\nas input: is φ valid?\n\nPSi := (a, b, ?X1 ) And . . . And (a, b, ?Xm ).\nThe following proof was inspired by the proof of Theorem 3 in [26]: we encode the inner formula ψ using And\nand Filter, and then adopt the translation scheme for the\nquantifier sequence ∀∃∀∃ . . . proposed in [26].\n\nThe set S = {S1 , . . . , Sn } of all Si is then encoded as\nPS := PS1 Union . . . Union PSn .\n13\n\n\fIt can be shown that μ = {?B0 7→ 1} ∈ JPφ KD iff φ is\nvalid, which completes the reduction. We refer the reader to\nthe proof of Theorem 3 in [26] for this part of the proof.✷\n\nFirst note that, according to the problem statement, ψ is a\nquantifier-free boolean formula. We assume w.l.o.g. that ψ\nis composed of ∧, ∨ and ¬.8 We use the fixed database\n\nRemark 3. The proof for this fragment (AF O) is subsumed by the subsequent proof, which shows PSpacehardness for a smaller fragment. It was included to\nillustrate how to encode quantifier-free boolean formulas that are not in CNF. Some of the following proofs\nbuild upon this construction.\n✷\n\nD := {(a, tv, 0), (a, tv, 1), (a, false, 0), (a, true, 1)}\nand denote by V = {v1 , . . . vl } the set of variables appearing in ψ. Formula ψ then is encoded as\nPψ :=((a, tv, ?V1 ) And (a, tv, ?V2 ) And . . .\nAnd (a, tv, ?Vl )) Filter f (ψ),\n\nFragment AO: AND + OPT\nWe reduce the QBF problem to Evaluation for class AO.\nWe encode a quantified boolean formula of the form\n\nwhere f (ψ) is a function that generates a SPARQL condition that mirrors the boolean formula ψ. More precisely, f is\ndefined recursively on the structure of ψ as\nf(vi )\nf(ψ1 ∧ ψ2 )\nf(ψ1 ∨ ψ2 )\nf(¬ψ1 )\n\n:=\n:=\n:=\n:=\n\nφ = ∀x1 ∃y1 ∀x2 ∃y2 . . . ∀xm ∃ym ψ,\n\n?Vi = 1\nf(ψ1 ) ∧ f(ψ2 )\nf(ψ1 ) ∨ f(ψ2 )\n¬ f(ψ1 )\n\nwhere ψ is a quantifier-free formula in conjunctive normal\nform (CNF), i.e. ψ is a conjunction of clauses\nψ = C1 ∧ * * * ∧ Cn ,\n\nIn our encoding Pψ , the And-block generates all possible\nvaluations for the variables, while the Filter-expression\nretains exactly those valuations that satisfy formula ψ. It is\nstraightforward to show that ψ is satisfiable if and only if\nthere exists a mapping μ ∈ JPψ KD and, moreover, for each\nmapping μ ∈ JPψ KD there is a truth assignment ρμ defined\nas ρμ (x) = μ(?X) for all variables ?Xi , ?Yi ∈ dom(μ)\nsuch that μ ∈ JPψ KD if and only if ρμ satisfies ψ. Given\nPψ , we can encode the quantifier-sequence using a series of\nnested Opt statements as shown in [26]. To make the proof\nself-contained, we shortly summarize this construction.\n\nwhere the Ci , 1 ≤ i ≤ n, are disjunctions of literals.9\nBy V we denote the variables in ψ and by VCi the variables\nappearing in clause Ci (either as positive of negative literals).\nWe use the following database, which is polynomial in the\nsize of the query.\nD :={(a, tv, 0), (a, tv, 1), (a, false, 0), (a, true, 1)} ∪\n{(a, vari , v) | v ∈ VCi } ∪ {(a, v, v) | v ∈ V }\nFor each Ci = v1 ∨ * * * ∨ vj ∨ ¬vj+1 ∨ * * * ∨ ¬vk , where the\nv1 . . . vj are positive and the vj+1 . . . vk are negated variables\n(contained in VCi ), we define a separate SPARQL expression\n\nSPARQL variables ?X1 , . . . , ?Xm and ?Y1 , . . . Ym are\nused to represent variables x1 , . . . xm and y1 , . . . , ym , respectively. In addition to these variables, we use fresh variables ?A0 , . . .?Am , ?B0 , . . .?Bm , and operators And and\nOpt to encode the quantifier sequence ∀x1 ∃y1 . . . ∀xm ∃ym .\nFor each i ∈ [m] we define two expressions Pi and Qi\n\nPCi :=(. . . ((. . . (\n(a, vari , ?vari )\nOpt ((a, v1 , ?vari ) And (a, true, ?V1 )))\n...\nOpt ((a, vj , ?vari ) And (a, true, ?Vj )))\nOpt ((a, vj+1 , ?vari ) And (a, f alse, ?Vj+1 )))\n...\nOpt ((a, vk , ?vari ) And (a, f alse, ?Vk )))\n\nPi := ((a, tv, ?X1 ) And . . . And (a, tv, ?Xi ) And\n(a, tv, ?Y1 ) And . . . And (a, tv, ?Yi−1 ) And\n(a, false, ?Ai−1 ) And (a, true, ?Ai )),\nQi := ((a, tv, ?X1 ) And . . . And (a, tv, ?Xi ) And\n(a, tv, ?Y1 ) And . . . And (a, tv, ?Yi ) And\n(a, false, ?Bi−1 ) And (a, true, ?Bi )),\n\nand encode formula ψ as\n\nand encode Pφ as\n\nPψ := PC1 And . . . And PCn .\n\nPφ := ((a, true, ?B0 )\nOpt (P1 Opt (Q1\nOpt (P2 Opt (Q2\n...\nOpt (Pm Opt (Qm And Pψ )) . . . )))))\n\nIt is straightforward to verify that ψ is satisfiable if and\nonly if there is a mapping μ ∈ JPψ KD and, moreover, for\neach μ ∈ JPψ KD there is a truth assignment ρμ defined as\nρμ (x) = μ(?X) for all variables ?Xi , ?Yi ∈ dom(μ) such\nthat μ ∈ JPψ KD if and only if ρμ satisfies ψ. Now, given\n9\n\nIn the previous proof (for fragment AFO) there was no\nsuch restriction for formula ψ. Still, it is known that QBF is\nalso PSpace-complete when restricting to formulae in CNF.\n\n8\n\nIn [26] ψ was additionally restricted to be in CNF. We relax\nthis restriction here.\n\n14\n\n\fFragment O: OPT-only (Theorem 3)\n\nPψ , we encode the quantifier-sequence using only operators\nOpt and And, as shown in the previous proof for fragment\nAF O. For the resulting encoding Pφ , it analogously holds\nthat μ = {?B0 7→ 1} ∈ JPφ KD iff φ is valid.✷\n\nWe start with a transformation rule for operator And; it\nessentially expresses the key idea of the subsequent proof.\nLemma 7. Let\n• Q, Q1 , Q2 , . . . , Qn (n ≥ 2) be SPARQL expressions,\n• S = vars(Q )∪vars(Q1 )∪vars(Q2 )∪* * *∪vars(Qn ),\ndenote the set of variables in Q, Q1 , Q2 , . . . , Qn\n• D = {(a, true, 1), (a, f alse, 0), (a, tv, 0), (a, tv, 1)}\nbe a fixed database,\n• ?V2 , ?V3 , . . . , ?Vn be a set of n − 1 fresh variables,\ni.e. S ∩ {?V2 , ?V3 , . . . , ?Vn } = ∅ holds.\nFurther, we define\n\nWe provide a small example that illustrates the translation\nscheme for QBF presented in in the proof above.\nExample 6. We show how to encode the QBF\nφ = ∀x1 ∃y1 (x1 ⇔ y1 )\n= ∀x1 ∃y1 ((x1 ∨ ¬y1 ) ∧ (¬x1 ∨ y1 )),\nwhere ψ = ((x1 ∨ ¬y1 ) ∧ (¬x1 ∨ y1 )) is in CNF. It\nis easy to see that the QBF formula φ is a tautology.\nThe variables in ψ are V = {x1 , y1 }; further, we have\nC1 = x1 ∨ ¬y1 , C2 = ¬x1 ∨ y1 , and VC1 = VC2 = V =\n{x1 , y1 }. Following the construction in the proof we set\nup the database\n\nQ′ :=((. . . ((Q Opt V2 ) Opt V3 ) . . . ) Opt Vn ),\nQ′′ :=((. . . ((Q1 Opt (Q2 Opt V2 ))\nOpt (Q3 Opt V3 ))\n...\nOpt (Qn Opt Vn ))),\nVi :=(a, true, ?Vi ), and\nV i :=(a, f alse, ?Vi ).\n\nD := {(a, tv, 0), (a, tv, 1), (a, false, 0), (a, true, 1),\n(a, var1 , x1 ), (a, var1 , y1 ), (a, var2 , x1 ),\n(a, var2 , y1 ), (a, x1 , x1 ), (a, y1 , y1 )}\nand define expression Pψ = PC1 And PC2 , where\n\nThe following claims hold.\n\nPC1 :=((a, var1 , ?var1 )\nOpt ((a, x1 , ?var1 ) And (a, true, ?X1 )))\nOpt ((a, y1 , ?var1 ) And (a, f alse, ?Y1 ))\nPC2 :=((a, var2 , ?var2 )\nOpt ((a, y1 , ?var2 ) And (a, true, ?Y1 )))\nOpt ((a, x1 , ?var2 ) And (a, f alse, ?X1 )).\n\n(1) JQ′ KD = {μ ∪ {?V2 7→ 1, . . . , ?Vn 7→ 1} | μ ∈ JQKD },\n(2) JQ′ Opt (Q1 And Q2 And . . . And Qn )KD\n= JQ′ Opt (. . . ((Q′′ Opt V 2 )\nOpt V 3 )\n...\nOpt V n )KD\n✷\n\nWhen evaluating these expressions we get:\n\n1\n\nThe second part of the lemma provides a way to rewrite an\nAnd-only expression that is encapsulated in the right side\nof an Opt-expression by means of an Opt-only expression.\nBefore proving the lemma, we illustrate the construction by\nmeans of a small example.\n\nJPC1 KD = ({{?var1 7→ x1 }, {?var1 7→ y1 }}\n{{?var1 7→ x1 , ?X1 7→ 1}})\n{{?var1 7→ y1 , ?Y1 7→ 0}}\n= {{?var1 7→ x1 , ?X1 7→ 1}, {?var1 7→ y1 , ?Y1 7→ 0}}\n\n1\n\n1\n\nJPC2 KD = {{?var2 7→ x1 }, {?var2 7→ y1 }}\n{{?var2 7→ y1 , ?Y1 7→ 1}}\n{{?var2 7→ x1 , ?X1 7→ 0}}\n= {{?var2 7→ x1 , ?X1 7→ 0}, {?var2 7→ y2 , ?Y2 7→ 1}}\n\nExample 7. Let D be the database given in the previous\nlemma and consider the expressions\n\n1\n\nQ := (a, tv, ?a)\n,i.e. JQKD = {{?a 7→ 0}, {?a 7→ 1}}\nQ1 := (a, true, ?a) ,i.e. JQ1 KD= {{?a 7→ 1}}\nQ2 := (a, f alse, ?b) ,i.e. JQ2 KD= {{?b 7→ 0}}\n\nJPψ KD = JPC1 And PC2 KD\n= {{?var1 7→ x1 , ?var2 7→ y1 , ?X1 7→ 1, ?Y1 7→ 1},\n{?var1 7→ y1 , ?var2 7→ x1 , ?X1 7→ 0, ?Y1 7→ 0}}\n\nAs for the part (1) of the lemma we observe that\nJQ′ KD = JQ Opt V2 KD\n= JQ Opt (a, true, ?V2 )KD\n= {{?a 7→ 0, ?V2 7→ 1}, {?a 7→ 1, ?V2 7→ 1}}.\n\nFinally, we set up the expressions P1 and Q1 , as described in the proof for fragment AOF\nP1 := ((a, tv, ?X1 ) And (a, false, ?A0 )\nAnd (a, true, ?A1 ))\nQ1 := ((a, tv, ?X1 ) And (a, tv, ?Y1 )\nAnd (a, false, ?B0 ) And (a, true, ?B1 ))\n\nConcerning part (2) it holds that the left side\nJQ′ Opt (Q1 And Q2 )KD\n= JQ′ KD\n{{?a 7→ 1, ?b 7→ 0}}\n= {{?a 7→ 0, ?V2 7→ 1}, {?a 7→ 1, ?b 7→ 0, ?V2 7→ 1}}\n\n1\n\nand encode the quantified boolean formula φ as\n\nis equal to the right side\n\nPφ := (a, true, ?B0 ) Opt (P1 Opt (Q1 And Pψ ))\n\nJQ′ Opt ((Q1 Opt (Q2 Opt V2 )) Opt V2 )KD\n= JQ′ KD\n({{?a 7→ 1, ?b 7→ 0, ?V2 7→ 1}}\nJV2 KD )\n= JQ′ KD\n{{?a 7→ 1, ?b 7→ 0, ?V2 7→ 1}}\n= {{?a 7→ 0, ?V2 7→ 1}, {?a 7→ 1, ?b 7→ 0, ?V2 7→ 1}}.✷\n\n1\n1\n\nWe leave it as an exercise to verify that the mapping\nμ = {?B0 7→ 1} is contained in JPφ KD . This result\nconfirms that the original formula ψ is valid.\n✷\n15\n\n1\n\n\fJQ′ Opt RKD\n= JQ′ Opt (Q1 And QV2 And QV3 And . . . And QVn )KD\n= JQ′ Opt (Q1 And Q2 And Q3 And . . . And Qn )KD\n\nProof of Lemma 7. We omit some technical details,\nbut instead give the intuition of the encoding. (1) The first\nclaim follows trivially from the definition of Q′ , the observations that each Vi evaluates to {{?Vi 7→ 1}}, and the\nfact that all ?Vi are unbound in Q′ (recall that, by assumption, the ?Vi are fresh variables). To prove (2), we consider the evaluation of the right side expression, in order to\nshow that it yields the same result as the left side. First\nconsider subexpression Q′′ and observe that the result of\nevaluating Qi Opt Vi is exactly the result of evaluating Qi\nextended by the binding ?Vi 7→ 1. In the sequel, we use\nQVi as an abbreviation for Qi Opt Vi , i.e. we denote Q′′ as\n((. . . ((Q1 Opt QV2 ) Opt QV3 ) Opt . . . ) Opt QVn ). Applying semantics, we can rewrite JQ′′ KD into the form\n\nThus, we have shown that the equivalence holds. This\ncompletes the proof. ✷\nGiven Lemma 7 we are now in the position to prove\nPSpace-completeness for fragment O. As in previous\nproofs it suffices to show hardness; membership follows as\nbefore from the PSpace-completeness of fragment E.\n\nJQ′′ KD\n= J((. . . ((Q1 Opt QV2 ) Opt QV3 ) Opt . . . ) Opt QVn )KD\n= J(Q1 And QV2 And QV3 And . . . And QVn )KD ∪ PD ,\n\nThe proof idea is the following. We show that, in the\nprevious reduction from QBF to Evaluation for fragment\nAO, each And expression can be rewritten using only Opt\noperators. We start with a QBF of the form\nφ = ∀x1 ∃y1 ∀x2 ∃y2 . . . ∀xm ∃ym ψ,\nwhere ψ is a quantifier-free formula in conjunctive normal\nform (CNF), i.e. ψ is a conjunction of clauses\n\nwhere we call the left subexpression of the union join\npart, and PD at the right side is an algebra expression (over\ndatabase D) with the following property: for each mapping\nμ ∈ PD there is at least one ?Vi (2 ≤ i ≤ n) s.t. ?Vi 6∈\ndom(μ). We observe that, in contrast, for each mapping\nin the join part dom(μ) ⊇ {?V2 , . . . , ?Vn } holds and, even\nmore, μ(?Vi ) = 1, for 2 ≤ i ≤ n. Hence, the mappings in\nthe result of the join part are identified by the property that\n?V2 , ?V3 , . . . , ?Vn are all bound to 1.\n\nψ = C1 ∧ * * * ∧ Cn ,\nwhere the Ci , 1 ≤ i ≤ n, are disjunctions of literals.\nBy V we denote the set of variables inside ψ and by VCi\nthe variables appearing in clause Ci (either in positive of\nnegative form) and use the same database as in the proof for\nfragment AO, namely\n\nLet us next consider the evaluation of the larger expression\n(on the right side of the original equation)\n\nD :={(a, tv, 0), (a, tv, 1), (a, false, 0), (a, true, 1)} ∪\n{(a, vari , v) | v ∈ VCi } ∪ {(a, v, v) | v ∈ V }\n\nR := ((. . . ((Q′′ Opt V 2 ) Opt V 3 ) Opt . . . ) Opt V n )).\n\nThe first modification of the proof for class AO concerns\nthe encoding of clauses Ci = v1 ∨* * *∨vj ∨¬vj+1 ∨* * *∨¬vk ,\nwhere the v1 . . . vj are positive and vj+1 . . . vk are negated\nvariables. In the prior encoding we used both And and Opt\noperators to encode them. It is easy to see that we can simply replace each And operator there through Opt without\nchanging semantics. The reason is that, for all subexpressions A Opt B in the encoding, it holds that vars(A) ∩\nvars(B) = ∅ and JBKD 6= ∅; hence, all mappings in A are\ncompatible with all mappings in B and there is at least one\nmapping in B. When applying this modification, we obtain\nthe following O-encoding for clauses Ci .\n\nWhen evaluating R, we obtain exactly the mappings from\nJQ′′ KD , but each mapping μ ∈ JQ′′ KD is extended by bindings ?Vi 7→ 0 for all ?Vi 6∈ dom(μ) (cf. the argumentation\nin for claim (1)). As argued before, all mappings in the join\npart of Q′′ are complete in the sense that all ?Vi are bound,\nso these mappings will not be affected. The remaining mappings (i.e. those originating from PD ) will be extended by\nbindings ?Vi 7→ 0 for at least one ?Vi . The resulting situation\ncan be summarized as follows: all mappings resulting from\nthe join part of Q′′ bind all variables ?Vi to 1; all mappings\nin PD bind all ?Vi , but at least one of them is bound to 0.\n\nPCi :=(. . . ((. . . (\n(a, vari , ?vari )\nOpt ((a, v1 , ?vari ) Opt (a, true, ?V1 )))\n...\nOpt ((a, vj , ?vari ) Opt (a, true, ?Vj )))\nOpt ((a, vj+1 , ?vari ) Opt (a, f alse, ?Vj+1 )))\n...\nOpt ((a, vk , ?vari ) Opt (a, f alse, ?Vk ))),\n\nFrom part (1) we know that each mapping in JQ′ KD maps\nall ?Vi to 1. Hence, when computing JQ′ Opt RKD =\nJQ′ KD\nJRKD , the bindings ?Vi 7→ 1 for all μ ∈ JQ′ KD\nserves as a filter that removes the mappings in JRKD originating from PD . This means\n\n1\n\nJQ′ Opt RKD\nJRKD\n= JQ′ KD\n= JQ′ KD\nJ(Q1 And QV2 And QV3 And . . . And QVn )KD\nLet us next consider the Pi and Qi used for simulating\n′\n= JQ Opt (Q1 And QV2 And QV3 And . . . And QVn )KD . the quantifier alternations. The original definition of these\nexpression was given in the proof for fragment AF O. With\na similar argumentation as before we can replace each ocEven more, we observe that all ?Vi are already bound in\ncurrence of operator And through Opt without changing\nQ′ (all of them to 1), so the following rewriting is valid.\n\n1\n1\n\n16\n\n\fbe an RDF database and F = ∀x1 ∃y1 . . . ∀xm ∃ym ψ\n(m ≥ 1) be a QBF, where ψ is a quantifier-free boolean\nformula. There is an E ≤2m encoding enc(F ) of F s.t.\n1. F is valid exactly if {?B0 7→ 1} ∈ Jenc(F )KD\n2. F is invalid exactly if all mappings μ′ ∈ Jenc(F )KD\nare of the form μ′ = μ′1 ∪ μ′2 , where μ′1 ∼ μ′2 and\n✷\nμ′1 = {?B0 7→ 1, ?A1 7→ 1}.\n\nthe semantics of the whole expression. This results in the\nfollowing O encodings for Pi and Qi , i ∈ [m].\nPi := ((a, tv, ?X1 ) Opt . . . Opt (a, tv, ?Xi ) Opt\n(a, tv, ?Y1 ) Opt . . . Opt (a, tv, ?Yi−1 ) Opt\n(a, false, ?Ai−1 ) Opt (a, true, ?Ai ))\nQi := ((a, tv, ?X1 ) Opt . . . Opt (a, tv, ?Xi ) Opt\n(a, tv, ?Y1 ) Opt . . . Opt (a, tv, ?Yi ) Opt\n(a, false, ?Bi−1 ) Opt (a, true, ?Bi )),\n\nProof: The lemma follows from the PSpace-hardness\nproof for fragment AF O, where we have shown how to\nencode QBF for a (possibly non-CNF) inner formula ψ.✷\nLemma 9. Let A and B SPARQL expressions for which\nthe evaluation problem is in ΣP\ni , i ≥ 1, and let R a\nFilter condition. The following claims hold.\n1. The Evaluation problem for the SPARQL expression A Union B is in ΣP\ni .\n2. The Evaluation problem for the SPARQL expression A And B is in ΣP\ni .\n3. The Evaluation problem for the SPARQL expression A Filter R is in ΣP\n✷\ni .\n\nIn the underlying proof for AO, the conjunction ψ is\nencoded as PC1 And . . . And PCn , thus we have not yet\neliminated all And-operators. We shortly summarize what\nwe have achieved so far:\nPφ := ((a, true, ?B0 )\nOpt (P1 Opt (Q1\n...\nOpt (Pm−1 Opt (Qm−1\nOpt (P ′ ))) . . . ))), where\nP ′ = Pm Opt (Qm And (Pψ ))\n= Pm Opt (Qm And PC1 And . . . And PCn )\n\nProof: 1. According to the SPARQL semantics we have\nthat μ ∈ JA Union BK if and only if μ ∈ JAK or μ ∈ JBK.\nBy assumption, both conditions can be checked individually\nin ΣP\ni , and so can both checks in sequence.\n\nNote that P ′ is the only expression that still contains And\noperators (where Qm , PC1 , . . . , PCn are already And-free).\nWe now exploit the rewriting given in Lemma 7. In particular,\nwe replace P ′ in Pφ by the expression P∗′ defined as\nP∗′ := Q′ Opt\n((. . . ((Q′′ Opt V 2 ) Opt V 3 ) Opt . . . ) Opt V n+1 )),\nwhere\nQ′ :=((. . . ((Pm Opt V2 ) Opt V3 ) . . . ) Opt Vn+1 ),\nQ′′ :=((. . . ((Qm Opt (PC1 Opt V2 ))\nOpt (PC2 Opt V3 ))\n...\nOpt (PCn Opt Vn+1 ))),\nVi :=(a, true, ?Vi ),\nV i :=(a, f alse, ?Vi ),\nand the ?Vi (i ∈ {2, . . . , n + 1}) are fresh variables.\n\n2. It is easy to see that μ ∈ JA And BK iff μ can\nbe decomposed into two compatible mappings μ1 and μ2\ns.t. μ = μ1 ∪ μ2 and μ1 ∈ JAK and μ2 ∈ JBK. By assumption, testing μ1 ∈ JAK (μ2 ∈ JBK) is in ΣP\ni . Since i ≥ 1,\nthis complexity class is at least ΣP\n1 = NP. So we can guess\na decomposition μ = μ1 ∪ μ2 and test for the two conditions\none after the other. Hence, the whole procedure is in ΣP\ni .\n3. μ ∈ JA Filter RK holds iff μ ∈ JAK, which can be\ntested in ΣP\n1 by assumption, and R satisfies μ, which can be\ntested in polynomial time. Since ΣP\ni ⊇ NP ⊇ P for i ≥ 1,\nthe whole procedure is still in ΣP\n.✷\ni\nWe are now ready to prove Theorem 4. The proof divides\ninto two parts, i.e. hardness and membership. The hardness proof is a reduction from QBF with a fixed number of\nquantifier alternations. Second, we prove by induction on\nthe Opt-rank that there exists a ΣP\nn+1 -algorithm to solve the\nEvaluation problem for E ≤n expressions.\n\nThe resulting Pφ is now an O-expression. From Lemma 7\nit follows that the result of evaluating P∗′ is obtained from\nthe result of P ′ by extending each mapping in P ′ by additional variables, more precisely by {?V2 7→ 1, ?V3 7→\n1, . . . , ?Vn+1 7→ 1}, i.e. the results are identical modulo\nthis extension. It is straightforward to verify that these additional bindings do not harm the construction, i.e. it holds\nthat {?B0 7→ 1} ∈ JPφ KD iff φ is valid.✷\n\nHardness. We consider a QBF of the form\nφ = ∃x0 ∀x1 ∃x2 . . . Qxn ψ,\nwhere n ≥ 1, Q = ∃ if n is even, Q = ∀ if n is odd,\nand ψ is a quantifier-free boolean formula. It is known that\nthe Validity problem for such formulae is ΣP\nn+1 -complete.\nWe now present a (polynomial-time) reduction from the Validity problem for these quantified boolean formulae to\nthe Evaluation problem for the E ≤n fragment, to prove\nΣP\nn+1 -hardness. We distinguish two cases.\n\nΣP\nn+1 -completeness of Fragment E ≤n (Theorem 4)\nWe start with two lemmas that will be used in the proof.\nLemma 8. Let\n\nCase 1: Let Q = ∃, so the formula is of the form\n\nD = {(a, tv, 0), (a, tv, 1), (a, true, 1), (a, f alse, 0)}\n17\n\n\fvalid (since otherwise, there is a compatible mapping for μ′ ,\nnamely {?B0 7→ 1} in Jenc(F1 ) Union enc(F2 )KD ). In\nsummary, this means μ′ ∈ JQKD if and only if ¬(F1′ ∨ F2′ ) =\nF ′ holds. Since both enc(F1 ) and enc(F2 ) are E ≤2m expressions, Q is contained in E ≤2m+1 , so (*) holds.\n\nF = ∃y0 ∀x1 ∃y1 . . . ∀xm ∃ym ψ.\nThe formula F has 2m + 1 quantifier alternations, so we\nneed to find an E ≤2m encoding for this expressions. We\nrewrite F into an equivalent formula F = F1 ∨ F2 , where\n\nMembership. We next prove membership of E ≤n expressions in ΣP\nn+1 by induction on the Opt-rank. Let us assume\nthat for each E ≤n expression (n ∈ N0 ) Evaluation is in\nP\nΣP\nn+1 . As stated in Theorem 1(2), Evaluation is Σ1 =\nNP-complete for Opt-free expressions, so the hypothesis\nholds for the basic case. In the induction step we increase\nthe Opt-rank from n to n + 1.\n\nF1 = ∀x1 ∃y1 . . . ∀xm ∃ym (ψ ∧ y0 ), and\nF2 = ∀x1 ∃y1 . . . ∀xm ∃ym (ψ ∧ ¬y0 ).\nAccording to Lemma 8 there is a fixed document D and\nE ≤2m encodings enc(F1 ) and enc(F2 ) (for F1 and F2 , respectively) s.t. Jenc(F1 )KD (Jenc(F2 )KD ) contains the mapping μ = {?B0 7→ 1} if and only if F1 (F2 ) is valid. Then the\nexpression enc(F ) = enc(F1 ) Union enc(F2 ) contains μ\nif and only if F1 or F2 is valid, i.e. iff F is valid. Clearly,\nenc(F ) is an E ≤2m expression, so enc(F ) constitutes the\ndesired E ≤2m encoding of the Evaluation problem.\n\nWe distinguish several cases, depending on the structure\nof the expression, say A, with Opt-rank n + 1.\nCase 1: Checking if μ ∈ JA Opt BK. First note that\nA Opt B is in E ≤n+1 , and from the definition of Opt-rank\nr it follows immediately that both A and B are in E ≤n .\nHence, by induction hypothesis, both A and B can be evaluated in ΣP\nn+1 . By semantics, we have that JA Opt BK =\nJA And BK ∪ (JAK \\ JBK), so μ is in JA Opt BK iff it is\ngenerated by the (a) left or (b) right side of the union. Following Lemma 9, part (a) can be checked in ΣP\nn+1 . (b) The\nmore interesting part is to check if μ ∈ JAK \\ JBK. According to the semantics of operator \\, this check can be\nformulated as C = C1 ∧ C2 , where C1 = μ ∈ JAK and\nC2 = ¬∃μ′ ∈ JBK : μ and μ′ are compatible. By induction hypothesis, C1 can be checked in ΣP\nn+1 . We argue that\nalso ¬C2 = ∃μ′ ∈ JBK : μ and μ′ are compatible can be\n′\nevaluated in ΣP\nn+1 : we can guess a mapping μ (in NP), then\nP\ncheck if μ ∈ JBK (in Σn+1 ), and finally check if μ and μ′ are\ncompatible (in polynomial time). Since P ⊆ N P ⊆ ΣP\nn+1 ,\nall these checks in sequence can be done in ΣP\n.\nCheckn+1\ning if the inverse problem, i.e. C2 , holds is then possible in\nP\ncoΣP\nn+1 = Πn+1 . Summarizing cases (a) and (b) we obP\nP\nserve that (a) ΣP\nn+1 and (b) Πn+1 are contained in Σn+2 ,\nP\nso both checks in sequence can be executed in Σn+2 , which\ncompletes case 1.\n\nCase 2: Let Q = ∀, so the formula is of the form\nF = ∃x0 ∀y0 ∃x1 ∀x1 . . . ∃xm ∀ym ψ.\nF has 2m+2 quantifier alternations, so we need to provide\na reduction into the E ≤2m+1 fragment. We eliminate the\nouter ∃-quantifier by rewriting F as F = F1 ∨ F2 , where\nF1 = ∀y0 ∃x1 ∀y1 . . . ∃xm ∀ym (ψ ∧ y0 ), and\nF2 = ∀y0 ∃x1 ∀y1 . . . ∃xm ∀ym (ψ ∧ ¬y0 ).\nAbstracting from the details of the inner formula, both F1\nand F2 are of the form\nF ′ = ∀y0 ∃x1 ∀y1 . . . ∃xm ∀ym ψ ′ ,\nwhere ψ ′ is a quantifier-free boolean formula. We now\nshow (*) that we can encode F ′ by E ≤2m+1 expressions\nenc(F ′ ) that, evaluated on a fixed document D, yields a fixed\nmapping μ exactly if F ′ is valid. This is sufficient, because\nthen the expression enc(F1 ) Union enc(F2 ) is an E ≤2m+1\nthat contains μ exactly if the original formula F = F1 ∨ F2\nis valid. We again start by rewriting F ′ :\nF′ =\n=\n=\nF1′ =\nF2′ =\n\nCase 2: Checking if μ ∈ JA And BK. Figure 4(a) shows\nthe structure of a sample And expression, where the • symbols represent non-Opt operators (i.e. And,Union, or Filter), and t stands for triple patterns. There is an arbitrary\nnumber of Opt-subexpression (which might, of course, contain Opt subexpression themselves). Each of these subexpressions has Opt-rank ≤ n + 1. Using the same argumentation as in case (1), the evaluation problem for all of\nthem is in ΣP\nn+2 . Moreover, there might be triple leaf nodes;\nthe evaluation problem for such patterns is in PTime, and\nclearly P ⊇ ΣP\nn+2 . Figure 4(b) illustrates the situation when\nall Opt-expressions and triple patterns have been replaced\nby the complexity of their Evaluation problem.\n\n∀y0 ∃x1 ∀y1 . . . ∃xm ∀ym ψ ′\n¬∃y0 ∀x1 ∃y1 . . . ∀xm ∃ym ¬ψ ′\n¬(F1′ ∨ F2′ ), where\n∀x1 ∃y1 . . . ∀xm ∃ym (¬ψ ′ ∧ y0 ), and\n∀x1 ∃y1 . . . ∀xm ∃ym (¬ψ ′ ∧ ¬y0 ).\n\nAccording to Lemma 8, each Fi′ can be encoded by an\nE ≤2m expressions enc(Fi′ ) s.t., on the fixed database D\ngiven there, (1) μ = {?B0 7→ 1} ∈ JFi′ KD iff Fi′ is valid\nand (2) if Fi′ is not valid, then all mappings Jenc(Fi′ )KD\nbind both variables ?A1 and ?B0 to 1. Then the same conditions (1) and (2) hold for enc(F1′ ) Union enc(F2′ ) exactly\nif F1 ∨ F2 is valid. Now consider the expression Q =\n((a, false, ?A1 ) Opt (enc(F1 ) Union enc(F2 )). This expression contains μ′ = {?A1 7→ 0} (when evaluated on the\ndatabase given in Lemma 8) if and only if F1′ ∨ F2′ is not\n\nWe then proceed as follows. We apply Lemma 9 repeatedly, folding the remaining And, Union, and Filter\nsubexpressions bottom up. The lemma guarantees that these\nfolding operations do not increase the complexity class, and\nit is easy to prove that Evaluation remains in ΣP\nn+2 for\n18\n\n\fAnd\n\nAnd\n\n...\n\nEvaluation in ΣP\nn+2\n\n•\n\nOpt\n...\n\n•\nt\n\nOpt\n...\n\n•\n\n...\n\n•\nEvaluation in ΣP\nn+2\n\nOpt\n...\n\n•\n•\n\nEvaluation in PTime\n\nEvaluation in ΣP\nn+2\n\n...\n\nFigure 4: (a) AND-expression with increased OPT-rank; (b) The OPT-expressions and leaf nodes\nhave been replaced by the complexity class of their EVALUATION problem.\nthe approach taken in the previous proof (of Theorem 5) and\neliminate the Select-clause. More precisely, we guess a\nmapping μ′′ ∼ μ and check if μ′′ ∪ μ ∈ JQ′ KD (we refer the\nreader to the proof of Theorem 5 before for more details).\nAgain, the size of the mapping to be guessed is bounded, and\nit is easy to see that the resulting algorithm is in NP.\n\nthe whole expression.\nCase 3: Checking if μ ∈ JA Union BK and Case 4:\nChecking if μ ∈ JA Filter RK. Similar to case 2.\nIt is worth mentioning that the structural induction is polynomially bounded by the size of the expression when the\nnesting depth of Opt-operators is fixed (which holds by assumption), i.e. comprises only polynomially many steps. In\nall cases except case 1 the recursive calls concern subexpressions of the original expression. In case 1, μ ∈ JA Opt BK\ngenerates two checks, namely μ ∈ JA And BK and μ ∈\nJAK \\ JBK. These two checks might trigger recursive checks\nagain. But since the nesting depth of Opt-expressions is\nrestricted, it is easy to see that there is a polynomial that\nbounds the number of recursive call. ✷\nA.4\n\nTo prove hardness we reduce 3Sat, a prototypical NPcomplete problem, to our problem. The proof was inspired\nby the reduction of 3Sat to the evaluation problem for conjunctive queries in [11]. The 3Sat problem is defined as\nfollows. Let ψ a boolean formula\nψ = C1 ∧ * * * ∧ Cn\nin CNF, where each clause Ci is of the form\nCi = li1 ∨ li2 ∨ li3 ,\n\nQueries: Fragments Including SELECT\n\ni.e. contains exactly three, possibly negated, literals: is ψ\nsatisfiable? For our encoding we use the fixed database\n\nProof of Theorem 5\nLet F be a fragment for which the Evaluation problem is\nC-complete, where C is a complexity class s.t. NP ⊆ C. We\nshow that, for a query Q ∈ F+ , document D, and mapping μ,\ntesting if μ ∈ JQKD is contained in C (C-hardness follows\ntrivially from C-hardness of fragment F ). By definition,\neach query in F+ is of the form Q = SelectS (Q′ ), where\nS ⊂ V is a finite set of variables and Q′ is an F -expression.\nBy definition of operator Select, μ ∈ JQKD holds if and\nonly if there exists a mapping μ′ ∈ JQ′ KD s.t. μ′ = μ ∪ μ′′ ,\nfor any mapping μ′′ ∼ μ. We observe that the domain of\ncandidate mappings μ′′ is bounded by the set of variables\nin Q′ , i.e. dom(μ′′ ) ⊆ vars(Q′ ). Hence, we can guess a\nmapping μ′′ (this is possible since we are at least in NP) and\nsubsequently check if μ′ = μ ∪ μ′′ ∈ JQ′ KD , which is also\npossible in C. The whole algorithm is in C.✷\n\nD := {(1, 1, 1), (1, 1, 0), (1, 0, 1), (1, 0, 0), (0, 1, 1),\n(0, 1, 0), (0, 0, 1), (0, 0, 0), (0, c, 1), (1, c, 0)},\nwhere we assume that 0, 1 ∈ I are any IRIs. Further let\nV = {x1 , . . . xm } denote the set of variables occurring in\nformula ψ. We set up the SPARQL core expression\nP ′ := (L∗11 , L∗12 , L∗13 ) And . . . And (L∗n1 , L∗n2 , L∗n3 )\nAnd (?X1 , c, ?X 1 ) And . . . And (?Xm , c, ?X m )\nAnd (0, c, ?A), where\nL∗ij :=?Xk if lij = xk , and L∗ij :=?X k if lij = ¬xk .\nFinally, set P :=Select?A (P ′ ). It is straightforward to\nverify that μ = {?A 7→ 1} ∈ JP KD iff ψ is satisfiable.✷\n\nProof of Theorem 6\nFirst, we show that Evaluation for A+ -queries is contained in NP. By definition, each query in A+ is of the form\nQ = SelectS (Q′ ), where S ⊂ V is a finite set of variables\nand Q′ is an And-only expression. Further let D a document and μ a mapping. To prove membership, we follow\n19\n\nB.\n\nAlgebraic Results\n\nB.1\n\nProofs of the Equivalences in Figure 1(I-IV)\n\n\fmapping in A3 . If μ ∈ A1 then the right side subexpression\nA1 \\ A3 generates μ, in the other case A2 \\ A3 generates\ndoes. ⇐: Consider a mapping μ in (A1 \\ A3 ) ∪ (A2 \\ A3 ).\nThen μ ∈ (A1 \\ A3 ) or μ ∈ (A2 ∪ A3 ). In the first case,\nμ is contained in A1 and there is no compatible mapping\nin A3 . Clearly, μ is then also contained in A1 ∪ A2 and\n(A1 ∪ A2 ) \\ A3 . The second case is symmetrical.✷\n\nI. Idempotence and Inverse\nThe two equivalences (UIdem) and (Inv) follow directly\nfrom the definition of operators ∪ and \\, respectively.\n(JIdem). Let A− be an A− -expression. We show that both\ndirections of the equivalence hold. ⇒: Consider a mapping\nμ ∈ A− ✶ A− . Then μ = μ1 ∪ μ2 where μ1 , μ2 ∈ A−\nand μ1 ∼ μ2 . Each pair of distinct mappings in A− is\nincompatible, so μ1 = μ2 and, consequently, μ1 ∪ μ2 =\nμ1 . By assumption, μ1 ∈ A− holds and we are done. ⇐:\nConsider a mapping μ ∈ A− . Choose μ for both the left and\nright expression in A− ✶ A− . By assumption, μ = μ ∪ μ is\ncontained in the left side expression of the equation.✷\n\n(LUDistR). The following rewriting proves the equivalence.\n\n1\n\n(A1 ∪ A2 )\nA3\n= ((A1 ∪ A2 ) ✶ A3 ) ∪ ((A1 ∪ A2 ) \\ A3 )\n(1)\n\n= ((A1 ✶ A3 ) ∪ (A2 ✶ A3 )) ∪ ((A1 \\ A3 ) ∪ (A2 \\ A3 ))\n\n(2)\n\nA−\n\n1 A = (A\n−\n\n1\n\n1\n\n= ((A1 ✶ A3 ) ∪ (A1 \\ A3 )) ∪ ((A2 ✶ A3 ) ∪ (A2 \\ A3 ))\n= (A1\nA3 ) ∪ (A2\nA3 )\n\n(LIdem). Let A− be an A− expression. Then\n−\n\n✶ A− ) ∪ (A− \\ A− ) [semantics]\n= (A ✶ A− ) ∪ ∅\n[(Inv)]\n= A− ✶ A−\n= A−\n[(JIdem)],\n\nStep (1) is an application of (JUDistR) and (MUDistR);\nin step (2) we applied (UAss) and (UComm).✷\n\n−\n\nB.2\n\nwhich proves the equivalence.✷\n\nProofs of the Equivalences in Figure 1(V-VI)\n\nIn the paper satisfaction was defined informally; to be\nself-contained, we repeat the formal definition from [26].\n\nII. Associativity\n\nDefinition 16. Given a mapping μ, filter conditions R,\nR1 , R2 , variables ?x, ?y, and constant c, we say that μ\nsatisfies R (denoted as μ |= R), if\n1. R is bnd (?x ) and ?x ∈ dom(μ),\n2. R is ?x = c, ?x ∈ dom(μ), and μ(?x) = c,\n3. R is ?x =?y, {?x, ?y} ⊆ dom(μ), and μ(?x)=μ(?y),\n4. R is ¬R1 and it is not the case that μ |= R1 ,\n5. R is R1 ∨ R2 and μ |= R1 or μ |= R2 ,\n6. R is R1 ∧ R2 and μ |= R1 and μ |= R2 .\n\n(UAss) and (JAss) are trivial (cf. [26]).\nIII. Commutativity\n(UComm) and (JComm) are trivial (cf. [26]).\nIV. Distributivity\n(JUDistR). We show that both directions of the equivalence\nhold. ⇒: First assume that μ ∈ (A1 ∪ A2 ) ✶ A3 . Then\n(according to the definition of ✶) μ is of the form μ12 ∪ μ3\nwhere μ12 ∈ A1 ∪ A2 , μ3 ∈ A3 , and μ12 ∼ μ3 . More\nprecisely, μ12 ∈ A1 ∪ A2 means μ12 in A1 or in A2 , so we\ndistinguish two cases. If (a) μ12 ∈ A1 then the subexpression\nA1 ✶ A3 on the right side generates μ = μ12 ∪ μ3 (choose\nμ12 from A1 and μ3 from A3 ); similarly, if (b) μ12 ∈ A2 ,\nthen the expression A2 ✶ A3 on the right side generates μ.\n⇐: Consider a mapping μ ∈ (A1 ✶ A3 ) ∪ (A2 ✶ A3 ).\nThen μ is of the form (a) μ = μ1 ∪ μ3 or of the form (b)\nμ = μ2 ∪ μ3 with μ1 ∈ A1 μ2 ∈ A2 , μ3 ∈ A3 (where\n(a) μ1 ∼ μ3 or (b) μ2 ∼ μ3 holds, respectively). Case (a):\nμ1 is contained in A1 , so it is also contained in A1 ∪ A2 .\nHence, on the left-hand side we choose μ1 from A1 ∪ A2\nand μ3 from A3 . By assumption they are compatible and\ngenerate μ = μ1 ∪ μ3 . Case (b) is symmetrical. ✷\n\nRecall that, given a set of mappings Ω and filter condition\nR, σR (Ω) is defined as the subset of mappings in Ω that\nsatisfy condition R, i.e. σR (Ω) = {μ ∈ Ω | μ |= R}.\nThe following proposition states that function safeVars(A)\nreturns only variables that are bound in each mapping when\nevaluating A on any document D. It will be required in some\nof the subsequent proofs.\nProposition 5. Let A be a SPARQL Algebra expression\nand let ΩA denote the mapping set obtained from evaluating A on any document. Then ?x ∈ safeVars(A) =⇒\n∀μ ∈ ΩA :?x ∈ dom(μ).\n✷\nProof. The proof is by induction on the structure of A and\napplication of Definition 5. We omit the details.✷\n\n(JUDistL). The equivalence follows from (JComm) and\n(JUDistR) (cf. [26]).✷\n\nProofs of Equivalences in Figure 1(V-VI)\n(SUPush). Follows directly from Proposition 1(5) in [26].✷\n\n(MUDistR). We show that both directions of the equation\nhold. ⇒: Consider a mapping μ ∈ (A1 ∪ A2 ) \\ A3 . Hence,\nμ is contained in A1 or in A2 and there is no compatible\n\n(SDecompI). Follows directly from Lemma 1(1) in [26].✷\n20\n\n\fJtK. By semantics, all mappings in A− bind exactly the\nsame set of variables, and consequently the values of each\ntwo distinct mappings must differ in at least one variable,\nwhich makes them incompatible.10 (Case 1) We assume\nthat the hypothesis holds and consider an expression A− =\n−\n−\nA−\nis of the form\n1 ✶ A2 . Then each mapping μ ∈ A\n−\n−\nμ = μ1 ∪ μ2 with μ1 ∈ A1 , μ2 ∈ A2 , and μ1 ∼ μ2 .\nWe fix μ and show that each mapping μ′ ∈ A− different\nfrom μ is incompatible. Any mapping in μ′ ∈ A− that is\ndifferent from μ is of the form μ′1 ∪ μ′2 with μ′1 ∈ A−\n1,\n′\n′\nμ′2 ∈ A−\nand\nμ\ndifferent\nfrom\nμ\nor\nμ\ndifferent\nfrom\n1\n1\n2\n2\nμ2 . Let us w.l.o.g. assume that μ′1 is different from μ1 .\nBy induction hypothesis, μ1 is incompatible with μ′1 . It is\neasy to verify that then μ = μ1 ∪ μ2 is incompatible with\nμ′ = μ′1 ∪ μ′2 , since μ1 and μ′1 disagree in the value of\n−\nat least one variable. (Case 2) Let A− = A−\n1 \\ A2 . By\n−\ninduction hypothesis, each two mappings in A1 are pairwise\nincompatible. By semantics, A− is a subset of A−\n1 , so the\nincompatibility property still holds for A− . (Case 3) Let\nA−\nA− = A−\n2 . We rewrite the left outer join according\n1\n−\n−\n−\nA−\nto its semantics: A− = A−\n2 = (A1 ✶ A2 ) ∪ (A1 \\\n1\n−\nA2 ). As argued in cases (1) and (2), the incompatibility\n−\nproperty holds for both subexpressions A✶ = A−\n1 ✶ A2\n−\n−\n\\\nand A = A1 \\ A2 , so it suffices to show that the mappings\nin A✶ are pairwise incompatible to those in A\\ . We observe\n✶\nthat A\\ is a subset of A−\n1 . Further, each mapping μ ∈ A\n−\n−\nis of the form μ = μ1 ∪ μ2 , where μ1 ∈ A1 , μ2 ∈ A2 , and\nμ1 ∼ μ2 . By assumption, each mapping in A−\n1 , and hence\neach mapping μ′1 ∈ A\\ is either identical to or incompatible\nwith μ1 . (a) If μ1 6= μ′1 , then μ′1 is incompatible with μ1 , and\nconsequently incompatible with μ1 ∪μ2 = μ, so we are done.\n(b) Let μ1 = μ′1 . We observe that, by assumption, there is\na compatible mapping (namely μ2 in A−\n2 ). This means that\n−\n′\ndoes\nnot\ngenerate\nμ\n,\nso\nwe\nhave\na contradiction\n\\\nA\nA−\n1\n2\n1\n(i.e., the assumption μ1 = μ′1 was invalid). (Case 4) Let\n−\n−\nA = σC (A−\n1 ). Analogously to case 2, A is a subset of A1 ,\nfor which the property holds by induction hypothesis. ✷\n\n(SDecompII). Follows directly from Lemma 1(2) in [26].✷\n(SReord). Follows from the application of (SDecompI) and\nthe commutativity of the boolean operator ∧.✷\n(BndI), (BndII), (BndIII), and (BndIV) are trivial.\n(BndV). Recall that by assumption ?x 6∈ vars(A1 ). The\nfollowing rewriting proves the equivalence.\n\n1A )\n\nσbnd (?x) (A1\n= σbnd (?x) (A1\n= σbnd (?x) (A1\n= σbnd (?x) (A1\n= A1 ✶ A2\n\n2\n\n✶ A2 ) ∪ (A1 \\ A2 ))\n[semantics]\n✶ A2 ) ∪ σbnd (?x) (A1 \\ A2 ) [(SUPush)]\n✶ A2 )\n[∗1 ]\n[∗2 ]\n\n∗1 follows immediately from assumption ?x 6∈ vars(A1 );\n∗2 follows from the observation that ?x ∈ safeVars(A2 ).✷\n\n1\n\n(SJPush). ⇒: Let μ ∈ σR (A1 ✶ A2 ). By semantics,\nμ |= R. Furthermore, μ is of the form μ1 ∪ μ2 , where\nμ1 ∈ A1 , μ2 ∈ A2 , and μ1 ∼ μ2 . Recall that by assumption vars(R) ⊆ safeVars(A1 ), so we always have that\ndom(μ1 ) ⊆ vars(R) (cf. Proposition 5), i.e. each variable\nthat occurs in R is bound in mapping μ1 . It is easy to verify\nthat R |= μ implies R |= μ1 , since both mappings coincide\nin the variables that are relevant for evaluating R. Consequently σR (A1 ) on the right side generates μ1 , and clearly\nσR (A1 ) ✶ A2 generates μ1 ∪ μ2 = μ. ⇐: Consider a mapping μ ∈ σR (A1 ) ✶ A2 . Then μ is of the form μ = μ1 ∪ μ2 ,\nμ1 ∈ A1 , μ2 ∈ A2 , μ1 ∼ μ2 , and μ1 |= R. It is easy to see\nthat then also μ1 ∪μ2 |= R, because dom(μ1 ) ⊆ vars(R) (as\nargued in case ⇒) and μ1 ∪ μ2 coincides with μ1 on all variables that are relevant for evaluating R. Hence, μ = μ1 ∪ μ2\nis generated by the left side of the equation.✷\n(SMPush). ⇒: Let μ ∈ σR (A1 \\ A2 ). By semantics,\nμ ∈ A1 and there is no μ2 ∈ A2 compatible with μ1 and\nμ |= R. From these preconditions it follows immediately\nthat μ ∈ σR (A1 ) \\ A2 . ⇐: Let μ ∈ σR (A1 ) \\ A2 . Then\nμ ∈ A1 , μ |= R, and there is no compatible mapping in A2 .\nClearly, then also μ ∈ A1 \\ A2 and μ ∈ σR (A1 \\ A2 ).✷\n\nProof of Lemma 1\nWe provide an exhaustive set of counterexamples.\n\n(SLPush). The following rewriting proves the equivalence.\n\n1\n\nσR (A1\nA2 )\n= σR ((A1 ✶ A2 ) ∪ (A1 \\ A2 ))\n= σR (A1 ✶ A2 ) ∪ σR (A1 \\ A2 )\n= (σR (A1 ) ✶ A2 ) ∪ (σR (A1 ) \\ A2 )\n= σR (A1 )\nA2\n\n1\n\nProof of Claim 1. In this part, we give counterexamples\nfor two fragments (a) A{✶,\\, 1 ,σ,∪} and (b) A{✶,\\, 1 ,σ,π} .\nThe result for the full algebra (i.e., A{✶,\\, 1 ,σ,∪,π} ) follows.\n\n[semantics]\n[(SUPush)]\n[*]\n[semantics]\n\n(1a) Fragment A{✶,\\, 1 ,σ,∪} . We use the fixed database\nD = {(0, c, 1)}. Consider the algebra expression A =\nJ(?x, c, 1)KD ∪ J(0, c, ?y)KD . It is easy to see that both\nA ✶ A = {{?x 7→ 0}, {?y 7→ 1}, {?x 7→ 0, ?y 7→ 1}}\nand A A = {{?x 7→ 0}, {?y 7→ 1}, {?x 7→ 0, ?y 7→ 1}}\ndiffer from A = {{?x 7→ 0}, {?y 7→ 1}}, which shows that\nneither (JIdem) nor (LIdem) holds for this fragment.\n\n1\n\n* denotes application of (SJPush) and (SMPush).✷\nB.3\n\n1\n\nProofs of the Remaining Technical Results\n\n(1b) Fragment A{✶,\\, 1 ,σ,π} . We use the fixed database\nD = {(0, f, 0), (1, t, 1), (a, tv, 0), (a, tv, 1)}. Consider the\nalgebra expression\n\nProof of Proposition 1\nProof. Let A− be an A− expression. The proof is by\ninduction on the structure of A− The basic case is A− =\n\n10\n\n21\n\nRecall that we assume set semantics.\n\n\fA = π{?x,?y} ((t1\n\n1 t ) 1 t ), where\n2\n\n1\n\ndef\n\nt1 := J(a, tv, ?z)KD ,\n\n1\n\ndef\n\nt2 := J(?z, f, ?x)KD , and\ndef\n\nt3 := J(?z, t, ?y)KD .\n\n1\n\nIt is easy to verify that A = {{?x 7→ 0}, {?y 7→ 1}}.\nA we then get exactly the same results\nFor A ✶ A and A\nas in part (1a), and we conclude that neither (JIdem) nor\n(LIdem) holds for the fragment under consideration.\n\nDistributivity over\n\n1\n\n1\n\nProof of Claims 3 + 4. We provide counterexamples for\neach possible operator constellations. All counterexamples\nare designed for the database D = {(0, c, 1)}.\n\n1\n\nDistributivity over ∪ (Claim 3 in Lemma 1):\n• A1 \\ (A2 ∪ A3 ) ≡ (A1 \\ A2 ) ∪ (A1 \\ A3 ) does not\nhold, e.g. A1 = J(0, c, ?a)KD , A2 = J(?a, c, 1)KD , and\nA3 = J(0, c, ?b)KD violates the equation.\n• A1\n(A2 ∪ A3 ) ≡ (A1\nA2 ) ∪ (A1\nA3 ) does\nnot hold, e.g. A1 = J(0, c, ?a)KD , A2 = J(?a, c, 1)KD ,\nand A3 = J(0, c, ?b)KD . violates the equation.\n\n1\n\n1\n\n1\n\n1\n\n1\n\n1\n\n1\n\n1\n\n1\n\n(Claim 4 in Lemma 1):\n\n1\n\n1\n\n1\n\n1\n\n1\n1\n\n1\n\nThe list of counterexamples is exhaustive.✷\n\n• A1 ∪ (A2 ✶ A3 ) ≡ (A1 ∪ A2 ) ✶ (A1 ∪ A3 ) does not\nhold, e.g. A1 = J(?a, c, 1)KD , A2 = J(?b, c, 1)KD , and\nA3 J(0, c, ?b)KD violates the equation.\n• (A1 ✶ A2 ) ∪ A3 ≡ (A1 ∪ A3 ) ✶ (A2 ∪ A3 ) does not\nhold (symmetrical to the previous one).\n• A1 \\ (A2 ✶ A3 ) ≡ (A1 \\ A2 ) ✶ (A1 \\ A3 ) does not\nhold, e.g. A1 = J(?a, c, 1)KD , A2 = J(?b, c, 1)KD , and\nA3 J(0, c, ?b)KD violates the equation.\n• (A1 ✶ A2 ) \\ A3 ≡ (A1 \\ A3 ) ✶ (A2 \\ A3 ) does not\nhold, e.g. A1 = J(0, c, ?a)KD , A2 = J(0, c, ?b)KD , and\nA3 J(?a, c, 1)KD violates the equation.\n• A1\n(A2 ✶ A3 ) ≡ (A1\nA2 ) ✶ (A1\nA3 ) does\nnot hold, e.g. A1 = J(?a, c, 1)KD , A2 = J(?b, c, 1)KD ,\nand A3 J(0, c, ?a)KD violates the equation.\n• (A1 ✶ A2 )\nA3 ≡ (A1\nA3 ) ✶ (A2\nA3 ) does\nnot hold, e.g. A1 = J(0, c, ?a)KD , A2 = J(0, c, ?b)KD ,\nand A3 J(?a, c, 1)KD violates the equation.\n\n1\n\n1\n\n1\n\nDistributivity over ✶ (Claim 4 in Lemma 1):\n\n1\n\n1\n\nA3 ) ≡ (A1 ∪A2 )\n(A1 ∪A3 ) does not\n• A1 ∪(A2\nhold, e.g. A1 = J(?a, c, 1)KD , A2 = J(c, c, c)KD , and\nA3 J(?b, c, 1)KD violates the equation.\n• (A1\nA2 )∪A3 ≡ (A1 ∪A3 )\n(A2 ∪A3 ) does not\nhold (symmetrical to the previous one).\n• A1 ✶ (A2\nA3 ) ≡ (A1 ✶ A2 ) (A1 ✶ A3 ) does\nnot hold, e.g. A1 = J(?a, c, 1)KD , A2 = J(?b, c, 1)KD ,\nand A3 J(0, c, ?a)KD violates the equation.\n• (A1\nA2 ) ✶ A3 ≡ (A1 ✶ A3 ) (A2 ✶ A3 ) does\nnot hold (symmetrical to the previous one).\nA3 ) ≡ (A1 \\ A2 )\n(A1 \\ A3 ) does not\n• A1 \\ (A2\nhold, e.g. A1 = J(?a, c, 1)KD , A2 = J(?b, c, 1)KD , and\nA3 J(0, c, ?a)KD violates the equation.\nA2 ) \\ A3 ≡ (A1 \\ A3 )\n(A2 \\ A3 ) does not\n• (A1\nhold, e.g. A1 = J(?a, c, 1)KD , A2 = J(?b, c, 1)KD , and\nA3 J(0, c, ?b)KD violates the equation.\n\nProof of Claim 2. Trivial.\n\n1\n\n1\n\n• A1\n(A2 \\A3 ) ≡ (A1\nA2 )\\(A1\nA3 ) does not\nhold, e.g. A1 = J(?a, c, 1)KD , A2 = J(?b, c, 1)KD , and\nA3 J(?b, c, 1)KD violates the equation.\n• (A1 \\A2 )\nA3 ≡ (A1\nA3 )\\(A2\nA3 ) does not\nhold, e.g. A1 = J(?a, c, 1)KD , A2 = J(?b, c, 1)KD , and\nA3 J(0, c, ?b)KD violates the equation.\n\n3\n\nProof of Proposition 2\n(MReord). We consider all possible mappings μ. Clearly,\nif μ is not contained in A1 , it will be neither contained in\nthe right side nor in the left side of the expressions (both are\nsubsets of A1 ). So we can restrict our discussion to mappings\nμ ∈ A1 . We distinguish three cases. Case (1): consider a\nmapping μ ∈ A1 and assume there is a compatible mapping\nin A2 . Then μ is not contained in A1 \\ A2 , and also not in\n(A1 \\ A2 ) \\ A3 , which by definition is a subset of the former.\nNow consider the right-hand side of the equation and let us\nassume that μ ∈ A1 \\ A3 (otherwise we are done). Then,\nas there is a compatible mapping to μ in A2 , the expression\nμ ∈ (A1 \\ A3 ) \\ A2 will not contain μ. Case (2): The case\nof μ ∈ A1 being compatible with any mapping from A3 is\nsymmetrical to (2). Case (3): Let μ ∈ A1 be a mapping that\nis not compatible with any mapping in A2 and A3 . Then\nboth (A1 \\ A2 ) \\ A3 on the left side and (A1 \\ A3 ) \\ A2 on\nthe right side contain μ. In all cases, μ is contained in the\nright side exactly if it is contained in the left side.✷\n\nDistributivity over \\ (Claim 4 in Lemma 1):\n• A1 ∪ (A2 \\ A3 ) ≡ (A1 ∪ A2 ) \\ (A1 ∪ A3 ) does not\nhold, e.g. A1 = J(?a, c, 1)KD , A2 = J(0, c, ?a)KD , and\nA3 J(?a, c, 1)KD violates the equation.\n• (A1 \\ A2 ) ∪ A3 ≡ (A1 ∪ A3 ) \\ (A2 ∪ A3 ) does not\nhold (symmetrical to the previous one).\n• A1 ✶ (A2 \\ A3 ) ≡ (A1 ✶ A2 ) \\ (A1 ✶ A3 ) does not\nhold, e.g. A1 = J(?a, c, 1)KD , A2 = J(?b, c, 1)KD , and\nA3 J(0, c, ?a)KD violates the equation.\n• (A1 \\ A2 ) ✶ A3 ≡ (A1 ✶ A3 ) \\ (A2 ✶ A3 ) does not\nhold (symmetrical to the previous one).\n\n(MMUCorr). We show both directions of the equivalence.\n⇒: Let μ ∈ (A1 \\A2 )\\A3 . Then μ ∈ A1 and there is neither\na compatible mapping μ2 ∈ A2 nor a compatible mapping\nμ3 ∈ A3 . Then both A2 and A3 contain only incompatible\nmappings, and clearly A2 ∪ A3 contains only incompatible\nmappings. Hence, the right side A1 \\ (A2 ∪ A3 ) produces\nμ. ⇐: Let μ ∈ A1 \\ (A2 ∪ A3 ). Then μ ∈ A1 and there is\nno compatible mapping in A2 ∪ A2 , which means that there\nis neither a compatible mapping in A2 nor in A3 . It follows\n22\n\n\fThen, it follows that C1 (Q′ ) ∈ cbΣ (C1 (Q)) and Q′ ∈\nC1−1 (cbΣ (C1 (Q))).\n\nthat A1 \\ A2 contains μ (as there is no compatible mapping\nin A2 and μ ∈ A1 ). From the fact that there is no compatible\nmapping in A3 , we deduce μ ∈ (A1 \\ A2 ) \\ A3 . ✷\n\n• Follows from the last point and bullet two in lemma 3.✷\n(MJ). See Lemma 3(2) in [26].\n−\n−\n(LJ). Let A−\n1 , A2 be A -expressions. The following sequence of rewriting steps proves the equivalence.\n\nA−\n1\n\n1\n\nProof of Lemma 5\n• We transform Q systematically.\ndatabase such that D |= Σ.\n\nA−\n2\n\n−\n−\n−\n= (A−\n1 ✶ A2 ) ∪ (A1 \\ A2 )\n−\n−\n−\n−\n−\n= (A1 ✶ (A1 ✶ A2 )) ∪ (A−\n1 \\ (A1 ✶ A2 ))\n−\n−\n−\n= (A1\n(A1 ✶ A2 ))\n\n1\n\n[sem.]\n[*]\n[sem.]\n\nJQKD\n= J(Q1 Opt Q2 )KD\n= J(Q1 And Q2 )KD ∪ (JQ1 KD \\ JQ2 KD )\n= J(Q1 And Q2 )KD ∪\n(πvars(Q1 ) J(Q1 And Q2 )KD \\ JQ2 KD )\n\n* denotes application of (JIdem), (JAss), and (MJ).✷\nProof of Lemma 2\nA−\n1,\n\nA−\n2\n\nIt is easy to verify that each mapping in JQ1 And Q2 KD\nis compatible with at least one mapping in Q2 , and the\nsame still holds for the projection πvars(Q1 ) J(Q1 And Q2 )KD .\nHence, the right side of the union can be dropped and the\nelimination simplifies to Q ≡Σ (Q1 And Q2 ).\n• Let D be an RDF database such that D |= Σ. Then we\nhave that\n\n−\n\nbe A -expressions, R a filter condition, and\nLet\n?x ∈ safeVars(A2 )\\vars(A1 ) a variable that is contained in\nthe set of safe variables of A2, but not in A1. We transform the\nleft side expression into the right side expression as follows.\n\n1\n\nσ¬bnd(?x ) (A−\nA−\n1\n2)\n−\n−\n−\n= σ¬bnd(?x ) ((A1 ✶ A−\n2 ) ∪ (A1 \\ A2 ))\n−\n−\n= σ¬bnd(?x ) (A1 ✶ A2 ) ∪\n−\nσ¬bnd(?x ) (A−\n1 \\ A2 )\n−\n−\n= σ¬bnd(?x ) (A1 \\ A2 )\n−\n= A−\n1 \\ A2\n\nJQKD = J(Q1 Opt (Q2 And Q3 ))KD\n= J(Q1 And Q2 And Q3 )KD ∪\n(JQ1 KD \\ JQ2 And Q3 KD )\n= J(Q1 And Q3 )KD ∪\n(JQ1 And Q2 KD \\ JQ2 And Q3 KD ).\n\n[semantics]\n[(SUPush)]\n[∗1 ]\n[∗2 ]\n\nWe now show that (JQ1 And Q2 KD \\JQ2 And Q3 KD ) =\n(JQ1 And Q2 KD \\ JQ3 KD ). Assume that there is some\nμ ∈ (JQ1 And Q2 KD \\ JQ2 And Q3 KD ). Then, for all\nμ′ ∈ JQ2 And Q3 KD it holds that μ′ is incompatible\nto μ. As μ is, by choice, compatible to some element in\nJQ2 KD , it must be in compatible to all elements in JQ3KD .\nThis implies μ ∈ (JQ1 And Q2 KD \\ JQ3 KD ). Assume\nwe have ν ∈ (JQ1 And Q2 KD \\ JQ3 KD ). Choose ν ′ ∈\nJQ2 And Q3 KD . It follows that the projection of ν ′ in\nthe variables in Q3 is not compatible to ν, therefore ν ′ is\nnot compatible to ν. This implies ν ∈ (JQ1 And Q2 KD \\\nJQ2 And Q3 KD ). Consequently\n\nWe first show that rewriting step ∗1 holds. Observe that\n?x ∈ safeVars(A−\n2 ), which implies that (following Proposition 5) variable ?x is bound in each mapping generated by A2.\nConsequently, ?x is also bound in each mapping generated\nby A1 ✶ A2 and the condition ¬bnd (?x ) is never satisfied\nfor the join part, so it can be eliminated. Concerning step\n∗2 we observe that ?x ∈ safeVars(A2 ) \\ vars(A1 ) implies\n?x 6∈ vars(A1 ). It follows immediately that ?x is unbound\n−\nin any mapping generated by A−\n1 \\ A2 , so the surrounding\nfilter condition always holds and can be dropped. ✷\n\nC.\n\nLet D be an RDF\n\nJQKD\n= πS (J(Q1 And Q3 )KD ∪ (JQ1 And Q2 KD \\ JQ3 KD ))\n= πS (J(Q1 And Q3 )KD ∪ (JQ1 KD \\ JQ3 KD ))\n= JQ1 Opt Q3 KD . ✷\n\nProofs of the SQO Results\n\nProof of Lemma 3\n• Let Q′ ∈ C1−1 (cbΣ (C1 (Q))) ∩ A+ . Then C1 (Q′ ) ∈\ncbΣ (C1 (Q)). This implies C1 (Q′ ) ≡Σ C1 (Q). It follows that Q′ ≡Σ Q.\n• Follows directly from the definition of the second translation scheme.\n• Follows from the last two points.✷\n\nProof of Lemma 6\n• Let μ ∈ JQ1 Opt Q2 KD . Then, μ(?x) is defined because of Q1 ≡Σ Selectvars(Q1 ) (Q1 And Q2 ). So,\nJFilter¬bnd(?x) (Q1 Opt Q2 )KD = ∅.\n• The proof of this claim is straightforward.\n• Assume that there is some μ ∈ JFilter¬?x=?y (Q2 )KD .\nSo, μ|S ∈ JSelectS (Q2 )KD . It holds that SelectS (Q2 )\n≡Σ SelectS (Q2 ?x\n?y ) ≡Σ SelectS (Filter?x=?y (Q2 )).\nIt follows that μ ∈ JSelectS (Filter?x=?y (Q2 ))KD ,\nwhich is a contradiction.✷\n\nProof of Lemma 4\n• Let Q′ ≡Σ Q. We have that C1−1 (U (C1 (Q′ ))),\nC1−1 (U (C1 (Q))) ∈ A+ , therefore C1 (Q′ ) ≡Σ C1 (Q).\n23\n\n\fD.\n\nProofs of the Chase Termination Results\n\nD.1\n\nAdditional Definitions\n\nIt is folklore that TGDs and EGDs together are expressive\nenough to express foreign key constraints, inclusion, functional, join, multivalued and embedded dependencies. Thus,\nwe can capture all important semantic constraints used in\ndatabases. Therefore, in the rest of the paper, all sets of\nconstraints are a union of TGDs and EGDs only.\n\nDatabases. We choose three pairwise disjoint infinite\nsets ∆, ∆null and V . We will refer to ∆ as the set of constants, to ∆null as the set of labelled nulls and to V as the\nset of variables. A database schema R is a finite set of relational symbols {R1 , ..., Rn }. To every Ri ∈ R we assign\na natural number ar(Ri ) ∈ N, which we call the arity of\nRi . The arity of R, denoted by ar(R), is defined as max{\nar(Ri ) | i ∈ [n] }. Throughout the rest of the paper, we\nassume the database schema, the set of constants and the set\nof labelled nulls to be fixed. This is why we will suppress\nthese sets in our notation.\n\nHomomorphisms. A homomorphism from a set of\natoms A1 to a set of atoms A2 is a mapping\nμ : ∆ ∪ ∆null ∪ V → ∆ ∪ ∆null ∪ V\nsuch that the following conditions hold: (a) if c ∈ ∆, then\nμ(c) = c, (b) if c ∈ ∆null , then μ(c) ∈ ∆ ∪ ∆null and (c) if\nR(c1 , ..., cn ) ∈ A1 , then R(μ(c1 ), ..., μ(cn )) ∈ A2 .\n\nA database instance I is an n-tuple (I1 , ..., In ), where\nIi ⊆ (∆ ∪ ∆null )ar(Ri ) for every i ∈ [n]. We will denote (c1 , ..., car(Ri ) ) ∈ Ii by the fact Ri (c1 , ..., car(Ri ) ) and\ntherefore represent the instance I as the set if its facts. Abusing notation, we write I = { Ri (t) | t ∈ Ii , i ∈ [n] }.\n\nChase. Let Σ be a set of TGDs and EGDs and I an\ninstance, represented as a set of atoms. We say that a TGD\n∀xφ ∈ Σ is applicable to I if there is a homomorphism μ\nfrom body(∀xφ) to I and μ cannot be extended to a homomorphism μ′ ⊇ μ from head(∀xφ) to I. In such a case the\n\nA position is a position in a predicate, e.g. a three-ary\npredicate R has three positions R1 , R2 , R3 . We say that a\nvariable, labelled null or constant c appears e.g. in a position\nR1 if there exists a fact R(c, ...).\n\nchase step I −→ J is defined as follows. We define a\nhomomorphism ν as follows: (a) ν agrees with μ on all universally quantified variables in φ, (b) for every existentially\nquantified variable y in ∀xφ we choose a \"fresh\" labelled\nnull ny ∈ ∆null and define ν(y) := ny . We set J to be\nI ∪ ν(head(∀xφ)). We say that an EGD ∀xφ ∈ Σ is applicable to I if there is a homomorphism μ from body(∀xφ) to\n\n∀xφ,μ(x)\n\nConstraints. Let x, y be tuples of variables. We consider two types of database constraints, i.e. tuple-generating\nand equality generating dependencies. A tuple-generating\ndependency (TGD) is a first-order sentence\n\n∀xφ,a\n\nI and μ(xi ) 6= μ(xj ). In such a case the chase step I −→ J\nis defined as follows. We set J to be\n• I except that all occurrences of μ(xj ) are substituted by\nμ(xi ) =: a, if μ(xj ) is a labelled null,\n• I except that all occurrences of μ(xi ) are substituted by\nμ(xj ) =: a, if μ(xi ) is a labelled null,\n• undefined, if both μ(xj ) and μ(xi ) are constants. In this\ncase we say that the chase fails.\n\nφ := ∀x(φ(x) → ∃yψ(x, y)),\nsuch that (a) both φ and ψ are conjunctions of atomic formulas (possibly with parameters from ∆), (b) ψ is not empty, (c)\nφ is possibly empty, (d) both φ and ψ do not contain equality\natoms and (e) all variables from x that occur in ψ must also\noccur in φ. We denote by body(φ) the set of atoms in φ and\nby head(φ) the set of atoms in ψ.\n\nA chase sequence is an exhaustive application of applicable\nconstraints\n\nAn equality generating dependency (EGD) is a first-order\nsentence\n\nφ0 ,a0\n\nφ1 ,a1\n\nI0 −→ I1 −→ . . .,\n\nφ := ∀x(φ(x) → xi = xj ),\n\nwhere we impose no strict order what constraint must be\napplied in case several constraints apply. If this sequence\nis finite, say Ir being its final element, the chase terminates\nand its result I0Σ is defined as Ir . The length of this chase\nsequence is r. Note that different orders of application of\napplicable constraints may lead to a different chase result.\nHowever, as proven in [28], two different chase orders lead\nto homomorphically equivalent results, if these exist. Therefore, we write I Σ for the result of the chase on an instance\nI under constraints Σ. It has been shown in [24, 3, 16] that\nI Σ |= Σ. In case that a chase step cannot be performed\n(e.g., because a homomorphism would have to equate two\nconstants) the chase result is undefined. In case of an infinite\nchase sequence, we also say that the result is undefined.\n\nwhere xi , xj occur in φ and φ is a non-empty conjunction of\nequality-free R-atoms (possibly with parameters from ∆).\nWe denote by body(φ) the set of atoms in φ and by head(φ)\nthe set {xi = xj }.\nFor brevity, we will often omit the ∀-quantifier and the\nrespective list of universally quantified variables.\nConstraint satisfaction. Let |= be the standard firstorder model relationship and Σ be a set of TGDs and EGDs.\nWe say that a database instance I = (I1 , ..., In ) satisfies Σ,\ndenoted by I |= Σ, if and only if (∆ ∪ ∆null , I1 , ..., In ) |= Σ\nin the sense of an R-structure.\n24\n\n\fTheorem 14. (see [8]) Let Σ be a fixed and stratified\nset of constraints. Then, there exists a polynomial Q ∈\nN[X] such that for any database instance I, the length\nof every chase sequence is bounded by Q(||I||), where\n||I|| is the number of distinct values in I. Thus, the\nchase terminates in polynomial time data complexity.\n✷\n\nProvisio. We will make a simplifying assumption. Let I\nbe a database instance and Σ some constraint set. Without\nloss of generality we can assume that whenever two labelled\nnulls, say y1 , y2 , are equated by the chase and y1 ∈ dom(I),\nthen all occurrences of y2 are mapped to y1 in the chase step.\nThis does not affect chase termination as substituting y1 with\ny2 would lead to an isomorphic instance.\nD.2\n\nPrevious Results\nD.3\n\nIn the following we are only interested in constraints for\nwhich any chase sequence is finite. In [28] weak acyclicity\nwas introduced, which is the starting point for our work.\nDefinition 17. (see [28]) Given a set of constraints Σ,\nits dependency graph dep(Σ) := (V, E) is the directed\ngraph defined as follows. V is the set of positions that\noccur in the TGDs in Σ. There are two kind of edges\nin E. Add them as follows: for every TGD\n∀x(φ(x) → ∃yψ(x, y)) ∈ Σ\nand for every x in x that occurs in ψ and every occurrence of x in φ in position π1\n• for every occurrence of x in ψ in position π2 , add an\nedge π1 → π2 (if it does not already exist).\n• for every existentially quantified variable y and for\nevery occurrence of y in a position π2 , add a special\n∗\nedge π1 → π2 (if it does not already exist).\nA set Σ of TGDs and EGDs is called weakly acyclic iff\ndep(Σ) has no cycles through a special edge.\n✷\n\nProof of Theorem 7\n• Follows directly from the definition of the propagation\ngraph. In the propagation graph stronger conditions have\nto be satisfied than in the dependency graph in order to\nadd special or non-special edges.\n• Let α := S(X2 , X3 ), R(X1 , X2 , X3 ) → ∃Y R(X2 , Y, X1 )\nand β := R(X1 , X2 , X3 ) → S(X1 , X3 ). It can be seen\nthat α ≺ β and β ≺ α. Together with the fact that\n{α, β} is not weakly acyclic it follows that {α, β} is not\nstratified. However, {α, β} is safe.\n• (see [8]) Let γ := T (X1 , X2 ), T (X2 , X1 ) → ∃ Y1 , Y2\nT (X1 , Y1 ), T (Y1 , Y2 ), T (Y2 , X1 ). It was argued in [8]\nthat {γ} is stratified. However, it is not safe because\nboth T 1 and T 2 are affected and therefore dep({γ}) =\nprop({γ}) and it was argued in [8] that it is not weakly\nacyclic.\n✷\n\nThen, in [8] stratification was set on top of the definition\nof weak acyclicity. The main idea is that we can test if a\nconstraint can cause another constraint to fire, which is the\nintuition of the following definition.\nDefinition 18. (see [8]) Given two TGDs or EGDs α =\n∀x1 φ, β = ∀x2 ψ, we define α ≺ β iff there exist database\ninstances I, J and a ∈ dom(I), b ∈ dom(J) such that\n\nProof of Theorem 8\nFirst we introduce some additional notation. We denote constraints in the form φ(x1 , x2 , u) → ∃yψ(x1 , x2 , y), where\nx1 , x2 , u are all the universally quantified variables and\n• u are those variables that do not occur in the head,\n• every element in x1 occurs in a non-affected position in\nthe body, and\n• every element in x2 occurs only in affected positions in\nthe body.\n\n• I 2 φ(b), possibly b is not in dom(I),\nα,a\n\n• I −→ J and\n• J 2 ψ(b).\n\nProofs of the Technical Results\n\n✷\nThe proof is inspired by the proof of Theorem 3.8 in [28],\nespecially the notation and some introductory definitions are\ntaken from there. In a first step we will give the proof for\nTGDs only, i.e. we do not consider EGDs. Later, we will see\nwhat changes when we add EGDs again.\n\nThe actual definition of stratification then relies on weak\nacyclicity.\nDefinition 19. (see [8]) The chase graph G(Σ) = (Σ, E)\nof a set of TGDs Σ contains a directed edge (α, β) between two constraints iff α ≺ β. We call Σ stratified iff\nthe set of constraints in every cycle of G(Σ) are weakly\nacyclic.\n✷\nTheorem 13. (see [8]) If a set of constraints of weakly\nacyclic, then it is also stratified. It can be decided by\na coNP-algorithm whether a set of constraints is stratified.\n✷\n\nNote that Σ is fixed. Let (V, E) be the propagation graph\nprop(Σ). For every position π ∈ V an incoming path is a,\npossibly infinite, path ending in π. We denote by rank(π) the\nmaximum number of special edges over all incoming paths.\nIt holds that rank(π) < ∞ because prop(Σ) contains no\ncycles through a special edge. Define r := max{ rank(π) |\nπ ∈ V } and p := |V |. It is easily verified that r ≤ p, thus\nr is bounded by a constant. This allows us to partition the\npositions into sets N0 , ..., Np such that Ni contains exactly\nthose positions π with rank(π) = i. Let n be the number of\nvalues in I. We define dom(Σ) as the set of constants in Σ.\n\nThe crucial property of stratification is that it guarantees\nthe termination of the chase in polynomially many chase\nsteps.\n25\n\n\fChoose some α := φ(x1 , x2 , u) → ∃yψ(x1 , x2 , y) ∈ Σ.\n\nProof of Theorems 9 and 10\n\nα,a1 a2 b\n\nLet I → . . . → G −→ G′ and let c be the newly created\nnull values in the step from G to G′ . Then\n\nTheorem 9 Follows from Theorem 12. Before we prove\nTheorem 10, we introduce some additional tool.\n\n1. newly introduced labelled nulls occur only in affected\npositions,\n2. a1 ⊆ dom(I) ∪ dom(Σ) and\n3. for every labelled null Y ∈ a2 that occurs in π in φ\nand every c ∈ c that occurs in ρ in ψ it holds that\nrank(π) < rank(ρ).\n\nIn general, a set of constraints may have several restriction\nsystems. A restriction system is minimal if it is obtained\nfrom ((Σ, ∅),{(α, ∅) | α ∈ Σ}) by a repeated application\nof the constraints from bullets one to three in Definition 13\n(until all constraints hold) s.t., in case of the first and second\nbullet, the image of f (β) is extended only by those positions\nthat are required to satisfy the condition. Thus, a minimal\nrestriction system can be computed by a fixedpoint iteration.\n\nThis intermediate claim is easily proved by induction on\nthe length of the chase sequence. Now we show by induction\non i that the number of values that can occur in any position\nin Ni in G′ is bounded by some polynomial Qi in n that\ndepends only on i (and, of course, Σ). As i ≤ r ≤ p, this\nimplies the theorem's statement because the maximal arity\nar(R) of a relation is fixed. We denote by body(Σ) the number of characters of the largest body of all constraints in Σ.\n\nLemma 10. Let Σ be a set of constraints, (G′ (Σ), f ) a\nrestriction system for Σ and (G′min (Σ), fmin ) its minimal one.\n• Let P be a set of positions and α, β constraints.\nThen, the mapping (P, α, β) 7→ α ≺P β? can be\ncomputed by an NP-algorithm.\n• The minimal restriction system for Σ is unique. It\ncan be computed from Σ in non-deterministic polynomial time.\n• It holds that Σ is safely restricted if and only if every\nstrongly connected component in G′min (Σ) is safe. ✷\n\nCase 1: i = 0. We claim that Q0 (n):=n+|Σ|*nar(R)*body(Σ)\nis sufficient for our needs. We consider a position π ∈ N0\nand an arbitrary TGD from Σ such that π occurs in the head of\nα. For simplicity we assume that it has the syntactic form of\nα. In case that there is a universally quantified variable in π,\nthere can occur at most n distinct elements in π. Therefore,\nwe assume that some existentially quantified variable occurs\nin π in ψ. Note that as i = 0 it must hold that |x2 | = 0. Every\nvalue in I can occur in π. But how many labelled nulls can\nbe newly created in π? For every choice of a1 ⊆ dom(G)\nsuch that G |= φ(a1 , λ, b) and G 2 ∃yψ(a1 , λ, y) at most\none labelled null can be added to π by α. Note that in this\ncase it holds that a1 ⊆ dom(I) due to (1). So, there are at\nmost nar(R)*body(Σ) such choices. Over all TGDs at most\n|Σ| * nar(R)*body(Σ) labelled nulls are created in π.\n\nProof. The proof of part one of the lemma proceeds like\nthe proof of Theorem 3 in [8]. It is enough to consider\ncandidate databases for A of size at most |α|+|β|, i.e. unions\nof homomorphic images of the premises of α and β s.t. null\nvalues occur only in positions from P . This concludes part\none.\n\nPi\nCase 2: i → i + 1. We claim that Qi+1 (n) := j=0 Qi (n)+\nPi\n|Σ| * ( j=0 Qi (n))ar(R)*body(Σ) is such a polynomial. Consider the fixed TGD α. Let π ∈ Ni+1 . Values in π may\nbe either copied from a position in N0 ∪ ... ∪ Ni or may\nbe a new labelled null. Therefore w.l.o.g. we assume\nthat some existentially quantified variable occurs in π in\nψ. In case a TGD, say α, is violated in G′ there must exist\na1 , a2 ⊆ domG′ (N0 , ..., Ni ) and b ⊆ dom(G′ ) such that\nG′ |= φ(a1 , a2 , b), but G′ 2 ∃yψ(a1 , a2 , y). If newly introduced labelled null occurs in a2 , say in some position ρ, then\nSi\nPi\nρ ∈ j=0 Nj . As there are at most ( j=0 Qi (n))ar(R)*body(Σ)\nPi\nmany such choices for a1, a2 , at most ( j=0 Qi (n))ar(R)*body(Σ)\nmany labelled nulls can be newly created in π.\n\nUniqueness holds by definition. It can be computed via\nsuccessive application of the constraints (note that f and E\nare changed in each step) in definition 13 by a Turing machine\nthat guesses answers to the question α ≺P β?. As the\nmapping (P, α, β) 7→ α ≺P β? can be computed by an NPalgorithm and the fixedpoint is reached after polynomially\nmany applications of the constraints from definition 13, this\nimplies the second claim.\nConcerning the second claim, observe that every strongly\nconnected component in G′min (Σ) is contained in a single\nstrongly connected component of any other restriction system. This implies the third claim.✷\nNow we turn towards the proof of Theorem 10. By the\nprevious lemma it suffices to check the conditions from definition 14 only for the minimal restriction system. To decide\nwhether Σ is not safely restricted, compute the minimal restriction system, guess a strongly connected component and\ncheck if it is not safe. Clearly, this can be done in nondeterministic polynomial time. ✷\nProof of Theorem 11 (Sketch)\n\nWhen we allow EGDs among our constraints, we have that\nthe number of values that can occur in any position in Ni in G′\ncan be bounded by the same polynomial Qi because equating\nlabelled nulls does not increase the number of labelled nulls\nand the fact that EGDs preserve valid existential conclusions\nof TGDs. ✷\n\nBefore proving this theorem, we need a technical lemma. It\nstates the most important property of restriction systems.\nLemma 11. Let α ∈ Σ and (G(Σ), f ) a restriction system for Σ and I be a database instance. If during the\n26\n\n\fα,a\n\nis not safe. Therefore, it is also not safely stratified.\nThe minimal restriction system is ((Σ, E), f ), where\nE = ∅ and f = { (γ, ∅) | γ ∈ Σ }. Obviously, every cycle in (Σ, E) is safe. Hence, Σ is safely restricted.\n✷\n\nchase it occurs that J1 → J2 , then the set of positions\nin which null values from a that are not in dom(I) occur\nin the body of α is contained in f (α).\n✷\nThe proof of this lemma is by induction on the length of\nthe chase sequence with which J1 was obtained from I and is\nstraightforward. Note that it uses the simplifying assumption\nthat we introduced at the end of appendix D.1.\n\nProof of Proposition 3\n\n′\n\nLet us now turn to the proof of Theorem 11. Let (G (Σ), f ) =\n((G, E), f ) be the minimal restriction system of Σ. Let\nC1 , ..., Cm be all the pairwise different strongly connected\ncomponents of the reflexive closure of G′ (Σ). The graph H\nis defined as the quotient graph with respect to { (α, β) ∈ E\n| ∃i ∈ [m] : α, β ∈ Ci }, i.e. H := G′ (Σ)/{ (α, β) ∈ E |\n∃i ∈ [m] : α, β ∈ Ci }. H is acyclic and depends only on\nΣ. We show the claim by induction on the number of nodes\nn in H.\n\nLet (G′ (Σ), f ) be a restriction system for Σ such that every\nstrongly connected component in G′ (Σ) is safely stratified.\nChoose some strongly connected component C and two constraints α, β ∈ C such that α ≺P β for some set of positions\nP . By Proposition 6, α ≺ β holds. As C is safely stratified,\nthis means that C must also be safe. So, every cycle in G′ (Σ)\nis also safe.\n✷\nProof of Proposition 4\n• Let Σ := {∀x1 , x2 (T (e, x1 , x2 ), T (x2 , d, d) → T (x1 , x2 , x1 ))},\nwhere d is a constant and xi are variables. Then, Σ′ = ∅.\n• An example for such a set of constraints C is constituted\nas follows.\nT (x1 , d, x2 ) → ∃yT (g, e, y), T (f, d, y)\nT (x1 , e, x2 ) → ∃yT (g, e, y), T (f, d, y)\nT (x1 , d, x2 ) → T (x2 , e, x1 )\nT (x1 , e, x2 ) → ∃yT (x2 , d, y)\nNote that d, e, f, g are constants.\n✷\n\nCase: n = 1: G′ (Σ) has a single strongly connected\ncomponent. This component is safe by prerequisite. It follows from Theorem 8 that the chase terminates in polynomial\ntime data complexity in this case.\nCase: n 7→ n + 1: Let h be a node in H that has no\nsuccessors and H− the union of constraints from all other\nnodes in H. The chase with H− terminates by induction\nhypothesis, say that the number of distinct value in this result\nis bounded by some polynomial Q− . Chasing the constraints\nin h alone terminates, too, say that the number of distinct\nvalue in this result is bounded by the polynomial q. The\nfiring of constraints from H− can cause some constraints\nfrom h to copy null values in their heads. Yet, the firing\nof constraints in h cannot enforce constraints from H− to\ncopy null values to their head (by construction of the minimal\nrestriction system). If I is the database instance to be chased,\nthen the number of distinct value in this result is bounded\nby Q− (||I||) + q(||I|| + Q− (||I||)). As Σ is fixed we can\nconclude that the chase terminates in polynomial time data\ncomplexity. ✷\nProof of Theorem 12\n• Let Σ be weakly acyclic. Every cycle in G(Σ) is safe,\nbecause Σ is safe and weak acyclicity implies safety. Let\nΣ be safe. Every cycle in G(Σ) is safe, because Σ is.\n• Follows from Example 5 and the following proposition.\nProposition 6. Let P ⊆ P ′ ⊆ pos(Σ). If α ≺P β,\nthen α ≺P ′ β. It holds that if α ≺P β, then α ≺ β.\n✷\nThe proof follows from the definition of ≺P and ≺.\n• Consider the following TGDs. Σ := {α, β, χ, δ}.\nα := R1 (x1 , x2 ) → ∃yS(x1 , x2 , y),\nβ := R1 (x1 , x2 ) → ∃yT (x1 , x2 , y),\nχ := S(x1 , x2 , x3 ), T (x4 , x5 , x6 ) → T (x5 , x1 , x4 ) and\nδ := S(x1 , x2 , x3 ), T (x4 , x5 , x3 ) → T (x1 , x3 , x3 ),\nR1 (x3 , x1 ), R2 (x3 , x1 ).\nIt can be seen that α ≺ χ, β ≺ χ, χ ≺ δ, δ ≺ α and\nδ ≺ β holds. Thus , there is a cycle in the chase graph that\ninvolves all constraints. Unfortunately, the constraint set\n27\n\n\f"}