{"id": "http://arxiv.org/abs/1107.2136v1", "guidislink": true, "updated": "2011-07-11T20:37:06Z", "updated_parsed": [2011, 7, 11, 20, 37, 6, 0, 192, 0], "published": "2011-07-11T20:37:06Z", "published_parsed": [2011, 7, 11, 20, 37, 6, 0, 192, 0], "title": "Quenching and Tomography from RHIC to LHC", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1107.3522%2C1107.2098%2C1107.3890%2C1107.0023%2C1107.1874%2C1107.5142%2C1107.4467%2C1107.3740%2C1107.3191%2C1107.1549%2C1107.2136%2C1107.3949%2C1107.2853%2C1107.3756%2C1107.1293%2C1107.1544%2C1107.5085%2C1107.2645%2C1107.1503%2C1107.5202%2C1107.4158%2C1107.3697%2C1107.1381%2C1107.4286%2C1107.5451%2C1107.0254%2C1107.3170%2C1107.5284%2C1107.4306%2C1107.2914%2C1107.0050%2C1107.0070%2C1107.0274%2C1107.0382%2C1107.4461%2C1107.1838%2C1107.3709%2C1107.1125%2C1107.0250%2C1107.1099%2C1107.5384%2C1107.5723%2C1107.1368%2C1107.4514%2C1107.5234%2C1107.1400%2C1107.3224%2C1107.2965%2C1107.1112%2C1107.3716%2C1107.2365%2C1107.3036%2C1107.2195%2C1107.3200%2C1107.5706%2C1107.2872%2C1107.2765%2C1107.2012%2C1107.5213%2C1107.5005%2C1107.2206%2C1107.0388%2C1107.1661%2C1107.6006%2C1107.0269%2C1107.5605%2C1107.3776%2C1107.3197%2C1107.0002%2C1107.4905%2C1107.1935%2C1107.4542%2C1107.0882%2C1107.3346%2C1107.5249%2C1107.4946%2C1107.2285%2C1107.3892%2C1107.0735%2C1107.2454%2C1107.0016%2C1107.3078%2C1107.1651%2C1107.1898%2C1107.5523%2C1107.2977%2C1107.4012%2C1107.5453%2C1107.3571%2C1107.2628%2C1107.5826%2C1107.2286%2C1107.0718%2C1107.2017%2C1107.1394%2C1107.3886%2C1107.4099%2C1107.3977%2C1107.4045%2C1107.4931%2C1107.3914&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quenching and Tomography from RHIC to LHC"}, "summary": "We compare fully perturbative and fully nonperturbative pictures of high-pT\nenergy loss calculations to the first results from LHC. While over-suppressed\ncompared to published ALICE data, parameter-free pQCD predictions based on the\nWHDG energy loss model constrained to RHIC data simultaneously describe well\nthe preliminary CMS hadron suppression, ATLAS charged hadron v2, and ALICE D\nmeson suppression; we also provide for future reference WHDG predictions for B\nmeson RAA. However, energy loss calculations based on AdS/CFT also\nqualitatively describe well the RHIC pion and non-photonic electron suppression\nand LHC charged hadron suppression. We propose the double ratio of charm to\nbottom quark RAA will qualitatively distinguish between these two energy loss\npictures.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1107.3522%2C1107.2098%2C1107.3890%2C1107.0023%2C1107.1874%2C1107.5142%2C1107.4467%2C1107.3740%2C1107.3191%2C1107.1549%2C1107.2136%2C1107.3949%2C1107.2853%2C1107.3756%2C1107.1293%2C1107.1544%2C1107.5085%2C1107.2645%2C1107.1503%2C1107.5202%2C1107.4158%2C1107.3697%2C1107.1381%2C1107.4286%2C1107.5451%2C1107.0254%2C1107.3170%2C1107.5284%2C1107.4306%2C1107.2914%2C1107.0050%2C1107.0070%2C1107.0274%2C1107.0382%2C1107.4461%2C1107.1838%2C1107.3709%2C1107.1125%2C1107.0250%2C1107.1099%2C1107.5384%2C1107.5723%2C1107.1368%2C1107.4514%2C1107.5234%2C1107.1400%2C1107.3224%2C1107.2965%2C1107.1112%2C1107.3716%2C1107.2365%2C1107.3036%2C1107.2195%2C1107.3200%2C1107.5706%2C1107.2872%2C1107.2765%2C1107.2012%2C1107.5213%2C1107.5005%2C1107.2206%2C1107.0388%2C1107.1661%2C1107.6006%2C1107.0269%2C1107.5605%2C1107.3776%2C1107.3197%2C1107.0002%2C1107.4905%2C1107.1935%2C1107.4542%2C1107.0882%2C1107.3346%2C1107.5249%2C1107.4946%2C1107.2285%2C1107.3892%2C1107.0735%2C1107.2454%2C1107.0016%2C1107.3078%2C1107.1651%2C1107.1898%2C1107.5523%2C1107.2977%2C1107.4012%2C1107.5453%2C1107.3571%2C1107.2628%2C1107.5826%2C1107.2286%2C1107.0718%2C1107.2017%2C1107.1394%2C1107.3886%2C1107.4099%2C1107.3977%2C1107.4045%2C1107.4931%2C1107.3914&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We compare fully perturbative and fully nonperturbative pictures of high-pT\nenergy loss calculations to the first results from LHC. While over-suppressed\ncompared to published ALICE data, parameter-free pQCD predictions based on the\nWHDG energy loss model constrained to RHIC data simultaneously describe well\nthe preliminary CMS hadron suppression, ATLAS charged hadron v2, and ALICE D\nmeson suppression; we also provide for future reference WHDG predictions for B\nmeson RAA. However, energy loss calculations based on AdS/CFT also\nqualitatively describe well the RHIC pion and non-photonic electron suppression\nand LHC charged hadron suppression. We propose the double ratio of charm to\nbottom quark RAA will qualitatively distinguish between these two energy loss\npictures."}, "authors": ["W. A. Horowitz", "Miklos Gyulassy"], "author_detail": {"name": "Miklos Gyulassy"}, "author": "Miklos Gyulassy", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0954-3899/38/12/124114", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1107.2136v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1107.2136v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 3 figures. Proceedings for Quark Matter 2011", "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1107.2136v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1107.2136v1", "journal_reference": null, "doi": "10.1088/0954-3899/38/12/124114", "fulltext": "Quenching and Tomography from RHIC to LHC\nW. A. Horowitz\n\narXiv:1107.2136v1 [hep-ph] 11 Jul 2011\n\nDepartment of Physics, University of Cape Town, Private Bag X3, Rondebosch\n7701, South Africa\nE-mail: wa.horowitz@uct.ac.za\n\nMiklos Gyulassy\nDepartment of Physics, Columbia University, 538 West 120th Street, New York,\nNY 10027, USA\nE-mail: gyulassy@phys.columbia.edu\nAbstract. We compare fully perturbative and fully nonperturbative pictures\nof high-pT energy loss calculations to the first results from LHC. While\noversuppressed compared to published ALICE data, parameter-free pQCD\npredictions based on the WHDG energy loss model constrained to RHIC data\nsimultaneously describe well the preliminary CMS hadron suppression, ATLAS\ncharged hadron v2 , and ALICE D meson suppression; we also provide for future\nreference WHDG predictions for B meson RAA . However, energy loss calculations\nbased on AdS/CFT also qualitatively describe well the RHIC pion and nonphotonic electron suppression and LHC charged hadron suppression. We propose\nthe double ratio of charm to bottom quark RAA will qualitatively distinguish\nbetween these two energy loss pictures.\n\nIntroduction The current and future challenge to theoretical calculations will be to\nsimultaneously describe the multiple high-pT observables measured at RHIC and LHC\n[1, 2, 3, 4, 5]. This will prove to be a daunting task as a simultaneous description of\nmultiple observables at RHIC is not even at hand [6]. Furthermore, generic arguments\nbased on RHIC results naturally lead one to predict a suppression greater than that\nin published LHC data, regardless of L, L2 , or L3 pathlength (i.e. specific energy loss\nmechanism) dependence [7]. Despite the difficulty of the task, the reward is potentially\nenormous: high-pT particles provide the most direct probe of the Q2 dependence of\nthe organization of the soft-soft and soft-hard degrees of freedom in the quark-gluon\nplasma (QGP) created in heavy ion collisions. In this work we will compare the fully\nweakly- and strongly-coupled pictures to the recent data from RHIC and LHC; we will\nfind that while neither provides a fully compelling picture of the experimental results,\nneither is ruled out by data.\nPerturbative Picture In a perturbative calculation of partonic energy loss in a\nQGP, the high-pT parent parton loses energy via both elastic and inelastic processes;\nthe size of this loss in calculable using standard Feynman diagram techniques. This\nin-medium energy loss is convolved with the production spectrum, also determined\nvia pQCD, and vacuum fragmentation functions. While many pQCD-based energy\nπ0\nloss calculations describe the suppression of neutral mesons at RHIC, RAA\n, none are\nable to simultaneously describe quantitatively both the normalization and angular\ndistribution of RAA of π 0 's nor the normalization of RAA for both π 0 's and heavy\n\n\fQuenching and Tomography from RHIC to LHC\n\n(a)\n\n2\n\n(b)\n√\nFigure\n1. (a) RAA (pT ) for π 0 at s = 62.4 and 200 AGeV at RHIC [8] and hch\n√\nat s =√2.76 ATeV at LHC [10]. A rigorous extraction of dNg /dy was performed\non the s = 200 AGeV RHIC data for the WHDG model [9]: the best-fit curve\nis given by the dashed green line and the one standard deviation uncertainty by\nthe green band; these results were extrapolated to LHC energies, with the best fit\ncurve given by the dashed blue line and the one standard deviation uncertainty\nby the blue band. In (b) this same blue band is compared to preliminary CMS\ndata [11].\n\nflavor electrons. We can quantify the generic statement about over-suppression given\nabove using the WHDG energy loss model [12], which includes both the collisional and\nradiative energy loss processes in a realistic, Bjorken-expanding medium: predictions\nfor the suppression of high-pT π 0 mesons assuming that the QGP density scales with\nthe observed charged particle multiplicity, dNch /dη, with the proportionality constant\nbetween the QGP density and dNch /dη found by a rigorous statistical analysis [9], are\ngiven in [7]; these predictions are compared to the published ALICE data [10] in Fig. 1\n(a) and preliminary CMS data [11] in Fig. 1 (b). One sees in Fig. 1 (a) that despite\nthe over factor of 2 increase in medium density, the observed increase in suppression\nin published ALICE data from top RHIC energy\n√ to LHC is small; there is even\n√ only a\nsmall increase in suppression from preliminary s = 62.4 AGeV data [8] to s = 200\nAGeV data at RHIC. Preliminary CMS data, with RAA out to pT ∼ 100 GeV/c, shows\na significant rise as a function of pT , which is in exact qualitative agreement with\npQCD expectations: perturbatively, the fractional energy loss of high-pT particles\ngoes as \u000f = (Ef − Ei )/Ei ∼ log(pT )/pT and RAA ∼ (1 − \u000f)n , where n + 1 ∼ 5 is\nthe power that best approximates the power law production spectrum for partons at\nLHC. Quantitatively, the parameter-free WHDG prediction at LHC energies rigorously\nconstrained by RHIC data is significantly more suppressed for 0-5% centrality collisions\nthan the central values of the published ALICE data. As the WHDG predictions are\nconsistent with the peripheral 70-80% collisions, the WHDG Rcp does not compare well\nwith the that which one extracts from the ALICE data, especially as the uncertainty in\nthe production spectra drops out of the experimental results. However, the comparison\nbetween the WHDG predictions and the preliminary CMS data in Fig. 1 (b) is quite\nreasonable with the given experimental and theoretical uncertainties. It seems, then,\nthat the quantitative question of whether the WHDG calculation, and pQCD-based\nenergy loss calculations in general, can describe the normalization of RAA at LHC\nwhen constrained by RHIC is still open. Hopefully the answer to this question will\nbecome clearer when the p+p baseline spectrum is analyzed out to pT ∼ 100 GeV/c.\n\n\fQuenching and Tomography from RHIC to LHC\n\n3\n\nHowever, there are two additional questions: 1) to what extent do initial state effects,\nsuch as those that turn off as a function of pT (due to, e.g., the suppression of smallx gluons as expected from saturation physics), account for the qualitative rise in\nRAA (pT ) at LHC? and 2) can WHDG, and pQCD-based energy loss calculations in\ngeneral, describe quantitatively describe multiple observables (e.g. v2 , the suppression\nof heavy flavors, IAA , etc.) out to very large, pT ∼ 100 GeV/c? We look forward to\nthe answer of the first question, which will come from the observation of pT & 5\nGeV/c direct photons and/or a measurement of suppression in p + A collisions. The\nsecond question has been preliminarily addressed at moderate momenta in Fig. 2: the\nparameter-free WHDG extrapolation to LHC provides an excellent description of (a)\nv2 (pT ) of charged hadrons measured by ATLAS [13] and (b) the suppression of D\nmesons as measured by ALICE [14]. Note that the suppression of D mesons begins\nto exceed that of pions at pT ∼ 20 GeV/c, due to the much more steeply falling\nproduction spectrum and the shortened formation time of the heavy quark. It will be\ninteresting to see if the agreement seen in Fig. 2 continues once the uncertainties and\nmomentum reach of the measurements improve. The preliminary results from CMS\non the distribution of the energy lost from a high-pT particle to very wide angles also\nhelps constrain the energy loss mechanism in QGP. pQCD intuition would suggest\nthat perturbative radiative energy loss would be concentrated at collinear angles of\n∼ μ/E, a more detailed examination of the differential single inclusive gluon radiation\ndistribution shows that pQCD predicts the emission of radiation at quite large angles\n[15].\n\n(a)\n\n(b)\nFigure 2. (a) Comparison of ATLAS charged hadron v2 (pT ) [13] to WHDG\npredictions at 40-50% centrality. (b) Comparison of ALICE D0 , D+ , and π ±\nmesons [14] to WHDG predictions at 0-20% centrality.\n\nNonperturbative Energy Loss and Comparison Fully nonperturbative treatments\nof heavy quark energy loss at RHIC show qualitative agreement with the measured\nsuppression of non-photonic electrons [16]. We show in Fig. 3 (a) that a simple\nBragg model of light quark and gluon energy loss, in which the probability of escape\nfor a parent parton is given by Pescape (L) = θ(Ltherm − L), where Ltherm ∼ E 1/3\n(with appropriate proportionality coefficients found in [17]) provides a qualitatively\nconsistent picture of the measured suppression of charged hadrons at LHC. It is\nimportant to note that the pQCD energy loss calculations appear to have a strong\ndependence on the initial thermalization time and pre-thermalization conditions [18].\nAdditionally, although there may be future means of directly measuring the initial\ngluon wavefunction at an electron-ion collider [19], model calculations of observables\nare also dependent on the medium geometry used. We therefore suggest that the\ndouble ratio of charm to bottom quark RAA (pT ) will provide valuable-perhaps even\n\n\fQuenching and Tomography from RHIC to LHC\n\n4\n\nunambiguous-evidence of the dominant energy loss mechanism at work in heavy\nion collisions, with qualitatively different behavior for fully weakly and fully strongly\ncoupled energy loss calculations. In particular, perturbative QCD predicts a rapid\nrise to 1 in the ratio as a function of pT as the pQCD calculation becomes insensitive\nto the mass of the parent parton; on the other hand, AdS/CFT drag results suggest\na nearly pT -independent ratio significantly suppressed from 1 at approximately the\nratio of the quark masses, mc /mb .\n\n(a)\n\n(b)\nFigure 3. (a) Comparison of the AdS/CFT Bragg model to ALICE charged\nhadron RAA (pT ) data. (b) Predictions of the double ratio of c to b quark RAA (pT )\nat 5.5 ATeV from fully 1) weakly-coupled and 2) strongly-coupled energy loss\nmodels.\n\nReferences\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n\nS. Bathe for the PHENIX Collaboration, Proceedings of Quark Matter 2011.\nH. Masui for the STAR Collaboration, arXiv:1106.6021 [nucl-ex].\nJ. Schukraft for the ALICE Collaboration, arXiv:1106.5620 [hep-ex].\nB. Wyslouch for the CMS Collaboration, Proceedings of Quark Matter 2011.\nP. Steinberg for the ATLAS Collaboration, Proceedings of Quark Matter 2011.\nJ. Jia, W. A. Horowitz and J. Liao, arXiv:1106.5620 [nucl-th].\nW. A. Horowitz and M. Gyulassy, arXiv:1104.4958 [hep-ph].\nM. Purschke for the PHENIX Collaboration, Proceedings of Quark Matter 2011.\nA. Adare et al. [PHENIX Collaboration], Phys. Rev. C 77, 064907 (2008) [arXiv:0801.1665\n[nucl-ex]].\nK. Aamodt et al. [ALICE Collaboration], Phys. Lett. B 696, 30 (2011) [arXiv:1012.1004 [nuclex]].\nY.-J. Lee for the CMS Collaboration, Proceedings of Quark Matter 2011 and CMS-PAS-HIN10-005.\nS. Wicks, W. Horowitz, M. Djordjevic and M. Gyulassy, Nucl. Phys. A 784, 426 (2007)\n[arXiv:nucl-th/0512076].\nJ. Jia for the ATLAS Collaboration, arXiv:1107.1468 [nucl-ex] and ATLAS-CONF-2011-074.\nA. Dainese for the ALICE Collaboration, arXiv:1106.4042 [nucl-ex].\nW. A. Horowitz and B. A. Cole, Phys. Rev. C 81, 024909 (2010) [arXiv:0910.1823 [hep-ph]].\nW. A. Horowitz, arXiv:1011.4316 [nucl-th].\nP. M. Chesler, K. Jensen, A. Karch and L. G. Yaffe, Phys. Rev. D 79, 125015 (2009)\n[arXiv:0810.1985 [hep-th]].\nA. Buzzatti and M. Gyulassy, arXiv:1106.3061 [hep-ph].\nW. A. Horowitz, arXiv:1102.5058 [hep-ph].\nW. A. Horowitz and M. Gyulassy, Phys. Lett. B 666, 320 (2008) [arXiv:0706.2336 [nucl-th]].\n\n\f"}