{"id": "http://arxiv.org/abs/1101.0191v1", "guidislink": true, "updated": "2010-12-31T02:50:07Z", "updated_parsed": [2010, 12, 31, 2, 50, 7, 4, 365, 0], "published": "2010-12-31T02:50:07Z", "published_parsed": [2010, 12, 31, 2, 50, 7, 4, 365, 0], "title": "Modified gravity models of dark energy", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.1563%2C1101.4230%2C1101.4501%2C1101.5328%2C1101.0835%2C1101.5205%2C1101.2238%2C1101.2012%2C1101.1976%2C1101.1256%2C1101.1851%2C1101.2416%2C1101.0988%2C1101.2263%2C1101.0680%2C1101.3533%2C1101.1445%2C1101.0371%2C1101.4606%2C1101.1346%2C1101.4588%2C1101.0655%2C1101.3978%2C1101.1571%2C1101.5463%2C1101.1447%2C1101.4960%2C1101.5759%2C1101.1542%2C1101.0477%2C1101.2929%2C1101.5665%2C1101.2718%2C1101.3783%2C1101.0191%2C1101.3027%2C1101.5907%2C1101.0177%2C1101.4298%2C1101.4205%2C1101.0980%2C1101.5610%2C1101.3246%2C1101.1376%2C1101.4625%2C1101.5512%2C1101.2533%2C1101.4624%2C1101.5043%2C1101.3858%2C1101.3457%2C1101.1238%2C1101.1083%2C1101.3560%2C1101.3085%2C1101.1707%2C1101.1299%2C1101.3569%2C1101.0050%2C1101.3223%2C1101.3979%2C1101.1193%2C1101.4240%2C1101.1422%2C1101.3525%2C1101.3602%2C1101.1364%2C1101.2024%2C1101.4112%2C1101.0262%2C1101.4710%2C1101.3496%2C1101.0100%2C1101.3302%2C1101.5764%2C1101.5654%2C1101.5983%2C1101.0550%2C1101.5202%2C1101.0205%2C1101.1782%2C1101.5293%2C1101.2530%2C1101.5343%2C1101.4583%2C1101.3139%2C1101.4384%2C1101.3902%2C1101.3660%2C1101.0986%2C1101.2271%2C1101.4164%2C1101.2207%2C1101.5480%2C1101.2123%2C1101.5832%2C1101.3534%2C1101.1221%2C1101.4372%2C1101.5153%2C1101.2763&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Modified gravity models of dark energy"}, "summary": "We review recent progress of modified gravity models of dark energy--based on\nf(R) gravity, scalar-tensor theories, braneworld gravity, Galileon gravity, and\nother theories. In f(R) gravity and Brans-Dicke theory it is possible to design\nviable models consistent with local gravity constraints under a chameleon\nmechanism, while satisfying conditions for the cosmological viability. The\nDvali-Gabadazde-Porrati braneworld model can be compatible with local gravity\nconstraints through a nonlinear field self-interaction arising from a\nbrane-bending mode, but the self-accelerating solution contains a ghost mode in\naddition to the tension with observational data about the cosmic expansion\nhistory. The extension of the field self-interaction to more general forms\nsatisfying a Galilean symmetry in the flat space-time allows a possibility to\navoid the appearance of ghosts and Laplacian instabilities, while the late-time\ncosmic acceleration can be realized by the field kinetic energy. We study the\nevolution of cosmological perturbations in those models to place constraints on\nmodel parameters from the observations of large-scale structure, cosmic\nmicrowave background, and weak lensing. We also briefly review other modified\ngravitational models of dark energy-- such as those based on Gauss-Bonnet\ngravity and Lorentz-violating theories.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1101.1563%2C1101.4230%2C1101.4501%2C1101.5328%2C1101.0835%2C1101.5205%2C1101.2238%2C1101.2012%2C1101.1976%2C1101.1256%2C1101.1851%2C1101.2416%2C1101.0988%2C1101.2263%2C1101.0680%2C1101.3533%2C1101.1445%2C1101.0371%2C1101.4606%2C1101.1346%2C1101.4588%2C1101.0655%2C1101.3978%2C1101.1571%2C1101.5463%2C1101.1447%2C1101.4960%2C1101.5759%2C1101.1542%2C1101.0477%2C1101.2929%2C1101.5665%2C1101.2718%2C1101.3783%2C1101.0191%2C1101.3027%2C1101.5907%2C1101.0177%2C1101.4298%2C1101.4205%2C1101.0980%2C1101.5610%2C1101.3246%2C1101.1376%2C1101.4625%2C1101.5512%2C1101.2533%2C1101.4624%2C1101.5043%2C1101.3858%2C1101.3457%2C1101.1238%2C1101.1083%2C1101.3560%2C1101.3085%2C1101.1707%2C1101.1299%2C1101.3569%2C1101.0050%2C1101.3223%2C1101.3979%2C1101.1193%2C1101.4240%2C1101.1422%2C1101.3525%2C1101.3602%2C1101.1364%2C1101.2024%2C1101.4112%2C1101.0262%2C1101.4710%2C1101.3496%2C1101.0100%2C1101.3302%2C1101.5764%2C1101.5654%2C1101.5983%2C1101.0550%2C1101.5202%2C1101.0205%2C1101.1782%2C1101.5293%2C1101.2530%2C1101.5343%2C1101.4583%2C1101.3139%2C1101.4384%2C1101.3902%2C1101.3660%2C1101.0986%2C1101.2271%2C1101.4164%2C1101.2207%2C1101.5480%2C1101.2123%2C1101.5832%2C1101.3534%2C1101.1221%2C1101.4372%2C1101.5153%2C1101.2763&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We review recent progress of modified gravity models of dark energy--based on\nf(R) gravity, scalar-tensor theories, braneworld gravity, Galileon gravity, and\nother theories. In f(R) gravity and Brans-Dicke theory it is possible to design\nviable models consistent with local gravity constraints under a chameleon\nmechanism, while satisfying conditions for the cosmological viability. The\nDvali-Gabadazde-Porrati braneworld model can be compatible with local gravity\nconstraints through a nonlinear field self-interaction arising from a\nbrane-bending mode, but the self-accelerating solution contains a ghost mode in\naddition to the tension with observational data about the cosmic expansion\nhistory. The extension of the field self-interaction to more general forms\nsatisfying a Galilean symmetry in the flat space-time allows a possibility to\navoid the appearance of ghosts and Laplacian instabilities, while the late-time\ncosmic acceleration can be realized by the field kinetic energy. We study the\nevolution of cosmological perturbations in those models to place constraints on\nmodel parameters from the observations of large-scale structure, cosmic\nmicrowave background, and weak lensing. We also briefly review other modified\ngravitational models of dark energy-- such as those based on Gauss-Bonnet\ngravity and Lorentz-violating theories."}, "authors": ["Shinji Tsujikawa"], "author_detail": {"name": "Shinji Tsujikawa"}, "author": "Shinji Tsujikawa", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1007/978-3-642-10598-2_3", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1101.0191v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1101.0191v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "52 pages, 8 figures, a lecture note in the book \"Lectures on\n  Cosmology: Accelerated Expansion of the Universe (Lecture Notes in Physics)\"\n  (published by Springer)", "arxiv_primary_category": {"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "gr-qc", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1101.0191v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1101.0191v1", "journal_reference": "Lect.Notes Phys.800:99-145,2010", "doi": "10.1007/978-3-642-10598-2_3", "fulltext": "Modified gravity models of dark energy\nShinji Tsujikawa1\n\narXiv:1101.0191v1 [gr-qc] 31 Dec 2010\n\n1\n\nDepartment of Physics, Faculty of Science, Tokyo University of Science,\n1-3, Kagurazaka, Shinjuku-ku, Tokyo 162-8601, Japan\n(Dated: January 4, 2011)\n\nWe review recent progress of modified gravity models of dark energy–based on f (R) gravity,\nscalar-tensor theories, braneworld gravity, Galileon gravity, and other theories. In f (R) gravity\nit is possible to design viable models consistent with local gravity constraints under a chameleon\nmechanism, while satisfying conditions for the cosmological viability. We also construct a class\nof scalar-tensor dark energy models based on Brans-Dicke theory in the presence of a scalar-field\npotential with a large coupling strength Q between the field and non-relativistic matter in the\nEinstein frame. We study the evolution of matter density perturbations in f (R) and Brans-Dicke\ntheories to place observational constraints on model parameters from the power spectra of galaxy\nclustering and Cosmic Microwave Background (CMB).\nThe Dvali-Gabadazde-Porrati braneworld model can be compatible with local gravity constraints\nthrough a nonlinear field self-interaction \u0003φ(∂μ φ∂ μ φ) arising from a brane-bending mode, but the\nself-accelerating solution contains a ghost mode in addition to the tension with the combined data\nanalysis of Supernovae Ia (SN Ia) and Baryon Acoustic Oscillations (BAO). The extension of the\nfield self-interaction to more general forms satisfying the Galilean symmetry ∂μ φ → ∂μ φ + bμ in\nthe flat space-time allows a possibility to avoid the appearance of ghosts and instabilities, while the\nlate-time cosmic acceleration can be realized by the field kinetic energy. We study observational\nconstraints on such Galileon models by using the data of SN Ia, BAO, and CMB shift parameters.\nWe also briefly review other modified gravitational models of dark energy–such as those based on\nGauss-Bonnet gravity and Lorentz-violating theories.\n\nContents\n\nI. Introduction\nII. f (R) gravity\nA. Cosmological dynamics in f (R) gravity\nB. Conditions for the avoidance of ghosts and tachyonic instabilities\nC. Local gravity constraints on f (R) gravity models\n\n2\n3\n4\n7\n9\n\nIII. Scalar-tensor gravity\nA. Scalar-tensor theories and the matter coupling in the Einstein frame\nB. Cosmological dynamics in Brans-Dicke theory\nC. Local gravity constraints on Brans-Dicke theory\n\n12\n12\n13\n16\n\nIV. DGP model\nA. Self-accelerating solution\nB. Observational constraints on the DGP model and other aspects of the model\n\n18\n18\n20\n\nV. Galileon gravity\nA. Cosmology of a covariant Galileon field\n1. Tracker solution (r1 = 1)\n2. Solutions in the regime r1 ≪ 1\n3. Conditions for the avoidance of ghosts and Laplacian instabilities\n4. Observational constraints on Galileon cosmology from the background cosmic expansion history\nB. Generalized Galileon gravity\nVI. Other modified gravity models of dark energy\nA. Gauss-Bonnet gravity with a scalar coupling\nB. R/2 + f (G) gravity\nC. Lorentz violating models\n\n22\n22\n24\n25\n26\n28\n28\n30\n30\n30\n31\n\n\f2\nVII. Observational signatures of modified gravity\nA. f (R) gravity\n1. Evolution of perturbations in the regime: M 2 ≫ k 2 /a2\n2. Evolution of perturbations in the regime: M 2 ≪ k 2 /a2\n3. Matter power spectra and the ISW effect\nB. Brans-Dicke theory\nC. DGP model\nD. Galileon gravity\n1. Covariant Galileon gravity\n2. Modified Galileon gravity\nE. Observables in weak lensing\n\n33\n33\n34\n35\n35\n37\n40\n42\n42\n44\n45\n46\n\nVIII. Conclusions\nAcknowledgments\n\n47\n\nReferences\n\n47\nI.\n\nINTRODUCTION\n\nThe cosmic acceleration today has been supported by independent observational data such as the Supernovae-type\nIa (SN Ia) [1, 2], the Cosmic Microwave Background (CMB) temperature anisotropies measured by WMAP [3, 4],\nand Baryon Acoustic Oscillations [5, 6]. The origin of dark energy responsible for this cosmic acceleration is one of\nthe most serious problems in modern cosmology [7–20]. The cosmological constant is one of the simplest candidates\nfor dark energy, but it is plagued by a severe energy scale problem if it originates from the vacuum energy appearing\nin particle physics [21].\nThe first step toward understanding the nature of dark energy is to clarify whether it is a simple cosmological\nconstant or it originates from other sources that dynamically change in time. The dynamical models can be distinguished from the cosmological constant by considering the evolution of the equation of state of dark energy (= wDE ).\nThe scalar field models of dark energy such as quintessence [22–26] and k-essence [27, 28] predict a wide variety of\nthe variation of wDE , but still the current observational data are not sufficient to distinguish those models from the\nΛ-Cold-Dark-Matter (ΛCDM) model. Moreover it is generally difficult to construct viable scalar-field models in the\nframework of particle physics because of a very tiny mass (mφ . 10−33 eV) required for the cosmic acceleration today\n[29, 30].\nThere exists another class of dynamical dark energy models based on the large-distance modification of gravity. The\nmodels that belong to this class are f (R) gravity [31–34] (f is function of the Ricci scalar R), scalar-tensor theories\n[35–40], braneworld models [41], Galileon gravity [42], Gauss-Bonnet gravity [43, 44], and so on. An attractive feature\nof these models is that the cosmic acceleration can be realized without recourse to a dark energy matter component.\nIf we modify gravity from General Relativity (GR), however, there are tight constraints coming from local gravity\ntests as well as a number of observational constraints. Hence the restriction on modified gravity models is in general\nstringent compared to modified matter models (such as quintessence and k-essence).\nFor example, an f (R) model of the form f (R) = R − μ2(n+1) /Rn (n > 0) was proposed to explain the late-time\ncosmic acceleration [32, 33] (see also Refs. [45–50] for early works). However this model suffers from a number of\nproblems such as the incompatibility with local gravity constraints [51–54], the instability of density perturbations\n[55–58], and the absence of a matter-dominated epoch [59, 60]. As we will see in this review there are a number of\nconditions required for the viability of f (R) dark energy models [55–58, 61–67], which stimulated to propose viable\nmodels [68–72].\nThe simplest version of scalar-tensor theories is so-called Brans-Dicke theory in which a scalar field φ couples to\nthe Ricci scalar R with the Lagrangian density L = φR/2 − (ωBD /2φ) (∇φ)2 , where ωBD is a so-called Brans-Dicke\nparameter [73]. GR can be recovered by taking the limit ωBD → ∞. If we allow the presence of the field potential\nU (φ) in Brans-Dicke theory, f (R) theory in the metric formalism is equivalent to this generalized Brans-Dicke theory\nwith the parameter ωBD = 0 [51, 74]. By transforming the action in generalized Brans-Dicke theory (\"Jordan frame\")\nto an \"Einstein frame\" action by a conformal transformation, the theory in the Einstein frame is equivalent to a\ncoupled quintessence scenario [75] with a constant coupling Q satisfying the relation 1/(2Q2)√\n= 3 + 2ωBD [76]. For\nexample, f (R) theory in the metric formalism corresponds to the constant coupling Q = −1/ 6, i.e. ωBD = 0. For\n|Q| of the order of unity it is generally difficult to satisfy local gravity constraints unless some mechanism can be at\nwork to suppress the propagation of the fifth force between the field and non-relativistic matter. It is possible for\n\n\f3\nsuch large-coupling models to be consistent with local gravity constraints [61, 64, 68, 77–80] through the so-called\nchameleon mechanism [81, 82], provided that a spherically symmetric body has a thin-shell around its surface.\nA braneworld model of dark energy was proposed by Dvali, Gabadadze, and Porrati (DGP) by embedding a 3brane in the 5-dimensional Minkowski bulk spacetime [41]. In this scenario the gravitational leakage to the extra\ndimension leads to a self-acceleration of the Universe on the 3-brane. Moreover a longitudinal graviton (i.e. a branebending mode φ) gives rise to a nonlinear self-interaction of the form (rc2 /mpl ) \u0003φ(∂ μ φ∂μ φ) through the mixing with a\ntransverse graviton, where rc is a cross-over scale (of the order of the Hubble radius H0−1 today) and mpl is the Planck\nmass [83, 84]. In the local region where the energy density ρ is much larger than rc−2 m2pl the nonlinear self-interaction\ncan lead to the decoupling of the field from matter through the so-called Vainshtein mechanism [85], which allows a\npossibility for the consistency with local gravity constraints. However the DGP model suffers from a ghost problem\n[86–88], in addition to the difficulty for satisfying the combined observational constraints of SN Ia and BAO [89–94].\nThe equations of motion following from the self-interacting Lagrangian \u0003φ(∂ μ φ∂μ φ) present in the DGP model are\ninvariant under the Galilean shift ∂μ φ → ∂μ φ + bμ in the Minkowski background. While the DGP model is plagued by\nthe ghost problem, the extension of the field self-interaction to more general forms satisfying the Galilean symmetry\nmay allow us to avoid the appearance of ghosts. Nicolis et al. [42] showed that there are only five field Lagrangians\nLi (i = 1, * * * , 5) that respect the Galilean symmetry in the Minkowski background. In Refs. [95, 96] these terms were\nextended to covariant forms in the curved space-time. In addition one can keep the equations of motion up to the\nsecond-order, while recovering the Galileon Lagrangian in the limit of the Minkowski space-time. This property is\nwelcome to avoid the appearance of an extra degree of freedom associated with ghosts. In fact, Refs. [97, 98] derived\nthe viable model parameter space in which the appearance of ghosts and instabilities associated with scalar and tensor\nperturbations can be avoided. Moreover the late-time cosmic acceleration is realized by the existence of a stable de\nSitter solution. We shall review the cosmological dynamics of Galileon gravity as well as conditions for the avoidance\nof ghosts and instabilities.\nIn order to distinguish between different models of dark energy based on modified gravitational theories, it is\nimportant to study the evolution of cosmological perturbations as well as the background expansion history of the\nUniverse. In particular, the modified growth of matter perturbations δm relative to the ΛCDM model changes the\nmatter power spectrum of large-scale structures (LSS) as well as the weak lensing spectrum [99]-[126]. Moreover the\nmodification of gravity manifests itself for the evolution of the effective gravitational potential ψ related with the\nIntegrated-Sachs-Wolfe (ISW) effect in CMB anisotropies. We shall review a number of observational signatures for\nthe modified gravitational models of dark energy.\nThis review is organized as follows. In Sec. II we construct viable dark energy models based on f (R) theories after\ndiscussing conditions for the cosmological viability as well as for the consistency with local gravity tests. In Sec. III we\nshow that, in Brans-Dicke theories with large matter couplings, it is possible to design the field potential consistent\nwith both cosmological and local gravity constraints. In Sec. IV we derive the field equations in the DGP model\nand confront the model with observations at the background level. In Sec. V we review the cosmological dynamics\nbased on Galileon gravity as well as conditions for the avoidance of ghosts and Laplacian instabilities. In Sec. VI we\nbriefly mention other modified gravity models of dark energy based on Gauss-Bonnet gravity and Lorentz-violating\ntheories. In Sec. VII we study observational signatures of dark energy models based on f (R) gravity, Brans-Dicke\ntheory, DGP model, and Galileon gravity, in order to confront them with the observations of LSS, CMB, and weak\nlensing. Sec. VIII is devoted to conclusions.\nThroughout the review we use the units such that c = ~ = kB = 1, where c is the speed of light, ~ is reduced\nPlanck's constant, and kB is Boltzmann's constant. We also adopt the metric signature (−, +, +, +).\nII.\n\nf (R) GRAVITY\n\nWe start with the action in f (R) gravity:\nZ\nZ\n1\n4 √\nS = 2 d x −gf (R) + d4 x LM (gμν , ΨM ) ,\n2κ\n\n(1)\n\nwhere κ2 = 8πG (G is a bare gravitational constant), g is a determinant of the metric gμν , f (R) is an arbitrary\nfunction in terms of the Ricci scalar R, and LM is a matter action with matter fields ΨM . Variation of the action (1)\nwith respect to gμν leads to the following field equation\n1\nF (R)Rμν (g) − f (R)gμν − ∇μ ∇ν F (R) + gμν \u0003F (R) = κ2 Tμν ,\n2\n\n(2)\n\n\f4\n√\nwhere F (R) ≡ f,R = ∂f /∂R, Rμν is a Ricci tensor, and Tμν = −(2/ −g)δLM /δg μν is an energy-momentum tensor\nof matter. The trace of Eq. (2) gives\n3 \u0003F (R) + F (R)R − 2f (R) = κ2 T ,\n\n(3)\n\nwhere T = g μν Tμν = −ρ + 3P . Here ρ and P are the energy density and the pressure of matter, respectively.\nRegarding the variation of the action (1), there is another approach called the Palatini formalism [127] in which gμν\n1\nand the affine connection Γα\nβγ are treated as independent variables. The resulting field equations are second-order\n[132–137] and the cosmological dynamics of dark energy models have been studied by a number of authors [138–145].\nHowever f (R) theory in the Palatini formalism gives rise to a large coupling between a scalar field degree of freedom\nand ordinary matter [135–137, 146–150], which implies difficulty for compatibility with standard models of particle\nphysics. This large coupling also leads to significant growth of matter density perturbations, unless the models are\nvery close to the ΛCDM model [151–155].\nIn the following we focus on the variational approach (so called the metric formalism) given above. The Einstein\ngravity without a cosmological constant corresponds to f (R) = R and F (R) = 1, so that the term \u0003F (R) in Eq. (3)\nvanishes. Since in this case R = −κ2 T = κ2 (ρ − 3P ), the Ricci scalar R is directly determined by matter. In f (R)\ngravity with a non-linear term in R, \u0003F (R) does not vanish in Eq. (3). Hence there is a propagating scalar degree of\nfreedom, ψ ≡ F (R), dubbed \"scalaron\" in Ref. [156]. The trace equation (3) allows the dynamics of the scalar field\nψ.\nThe de Sitter point corresponds to a vacuum solution with constant R. Since \u0003F (R) = 0 at this point, we obtain\nF (R)R − 2f (R) = 0 .\n\n(4)\n\nSince the quadratic model f (R) = αR2 satisfies this condition, it gives rise to an exact de Sitter solution. In the\ninflation model f (R) = R + αR2 proposed by Starobinsky [156], the accelerated cosmic expansion ends when the term\nαR2 becomes smaller than the linear term R. It is possible to construct such f (R) inflation models in the framework\nof supergravity [157, 158].\nA.\n\nCosmological dynamics in f (R) gravity\n\nWe first study cosmological dynamics for the models based on f (R) theories in the metric formalism. In order to\nderive conditions for the cosmological viability of f (R) models we shall carry out general analysis without specifying\nthe form of f (R). We consider a flat Friedmann-Lemaître-Robertson-Walker (FLRW) background with the line\nelement\nds2 = −dt2 + a(t)2 dx2 ,\n\n(5)\n\nwhere a(t) is a scale factor. For the matter Lagrangian LM in Eq. (1) we take into account non-relativistic matter and\nradiation, whose energy densities ρm and ρr satisfy the usual continuity equations ρ̇m + 3Hρm = 0 and ρ̇r + 4Hρr = 0\nrespectively. Here H ≡ ȧ/a is the Hubble parameter and a dot represents a derivative with respect to cosmic time t.\nFrom Eqs. (2) and (3) we obtain\n3F H 2 = κ2 (ρm + ρr ) + (F R − f )/2 − 3H Ḟ ,\n\n(6)\n\n2\n\n2F Ḣ = −κ [ρm + (4/3)ρr ] − F̈ + H Ḟ ,\n\n(7)\n\nR = 6(2H 2 + Ḣ) .\n\n(8)\n\nwhere the Ricci scalar is given by\n\nLet us introduce the following dimensionless variables:\nx1 ≡ −\n\n1\n\nḞ\n,\nHF\n\nx2 ≡ −\n\nf\n,\n6F H 2\n\nx3 ≡\n\nR\n,\n6H 2\n\nx4 ≡\n\nκ 2 ρr\n,\n3F H 2\n\n(9)\n\nWe also note that there is another approach for the variational principle–known as the metric-affine formalism–in which the matter\nLagrangian LM depends not only on the metric gμν but also on the connection Γα\nβγ [128–131].\n\n\f5\ntogether with the density parameters\nΩm ≡\n\nκ 2 ρm\n= 1 − x1 − x2 − x3 − x4 ,\n3F H 2\n\nΩr ≡ x4 ,\n\nΩDE ≡ x1 + x2 + x3 .\n\n(10)\n\nIt is straightforward to derive the following equations [62]:\ndx1\ndN\ndx2\ndN\ndx3\ndN\ndx4\ndN\n\n= −1 − x3 − 3x2 + x21 − x1 x3 + x4 ,\nx1 x3\n− x2 (2x3 − 4 − x1 ) ,\nm\nx1 x3\n= −\n− 2x3 (x3 − 2) ,\nm\n=\n\n= −2x3 x4 + x1 x4 ,\n\n(11)\n(12)\n(13)\n(14)\n\nwhere N = ln a and\nRf,RR\nd ln F\n,\n=\nd ln R\nf,R\nRf,R\nx3\nd ln f\n.\n=−\n=\nr ≡ −\nd ln R\nf\nx2\n\nm ≡\n\n(15)\n(16)\n\nFrom Eq. (16) one can express R as a function of x3 /x2 . Since m is a function of R, it follows that m is a function\nof r, i.e., m = m(r). The ΛCDM model, f (R) = R − 2Λ, corresponds to m = 0. Then the quantity m characterizes\nthe deviation from the ΛCDM model.\nThe effective equation of state of the system is given by\nweff ≡ −1 −\n\n1\n2Ḣ\n= − (2x3 − 1) .\n2\n3H\n3\n\n(17)\n\nIn the absence of radiation (x4 = 0) the fixed points for the dynamical system (11)-(14) are\nP1\nP2\nP3\nP4\n\n: (x1 , x2 , x3 ) = (0, −1, 2), Ωm = 0, weff = −1 ,\n: (x1 , x2 , x3 ) = (−1, 0, 0), Ωm = 2, weff = 1/3 ,\n: (x1 , x2 , x3 ) = (1, 0, 0), Ωm = 0, weff = 1/3 ,\n: (x1 , x2 , x3 ) = (−4, 5, 0), Ωm = 0, weff = 1/3 ,\n\u0013\n\u0012\nm(7 + 10m)\n1 + 4m\nm\n1 + 4m\n3m\n, Ωm = 1 −\nP5 : (x1 , x2 , x3 ) =\n,\n, weff = −\n,−\n,\n1 + m 2(1 + m)2 2(1 + m)\n2(1 + m)2\n1+m\n\u0012\n\u0013\n2(1 − m)\n2 − 5m − 6m2\n1 − 4m\n(1 − 4m)(1 + m)\nP6 : (x1 , x2 , x3 ) =\n, Ωm = 0, weff =\n,\n,−\n.\n1 + 2m m(1 + 2m)\nm(1 + 2m)\n3m(1 + 2m)\n\n(18)\n(19)\n(20)\n(21)\n(22)\n(23)\n\nThe points P5 and P6 are on the line m(r) = −r − 1 in the (r, m) plane.\nOnly the point P5 can be responsible for the matter-dominated epoch (Ωm ≃ 1 and weff ≃ 0). This is realized\nprovided m is close to 0. In the (r, m) plane the matter point P5 exists around (r, m) = (−1, 0). Either the point P1\nor P6 can lead to the late-time cosmic acceleration. The former corresponds to a de Sitter point (weff = −1) with\nr = −2, in which case the condition (4) is satisfied. Depending on the values of m, the point P6 can be responsible\nfor the cosmic acceleration [62]. In the following we shall focus on the case in which the matter point P5 is followed\nby the de Sitter point P1 .\nThe stability of the fixed points is known by considering small perturbations δxi (i = 1, 2, 3) around them [62]. For\nthe point P5 the eigenvalues for the 3 × 3 Jacobian matrix of perturbations are\np\n−3m5 ± m5 (256m35 + 160m25 − 31m5 − 16)\n′\n3(1 + m5 ),\n,\n(24)\n4m5 (m5 + 1)\nwhere m5 ≡ m(r5 ) and m′5 ≡ dm\ndr (r5 ) with r5 ≈ −1. In the limit |m5 | ≪ 1 the latter two eigenvalues reduce to\np\n−3/4 ± −1/m5. The f (R) models with m5 < 0 show a divergence of the eigenvalues as m5 → −0, in which case\nthe system cannot remain for a long time around the point P5 . For example the model f (R) = R − α/Rn with n > 0\n\n\f6\n1.2\n\n1.0\n\n.\n\nPB\n\n0.80\n\nm = - r -1\n\n(iv)\n\nm\n\n0.60\n\n. . .\n\nr=-2\nPA\n0.20\n\n0.0\n\n(iii)\n(ii)\n\n.\n\n0.40\n\nPM\n\n(i)\n-0.20\n-2.2\n\n-2\n\n-1.8\n\n-1.6\n\n-1.4\n\n-1.2\n\n-1\n\n-0.8\n\nr\nFigure 1: Four trajectories in the (r, m) plane. Each trajectory corresponds to the models: (i) ΛCDM, (ii) f (R) = (Rb − Λ)c ,\n(iii) f (R) = R − αRn with α > 0, 0 < n < 1, and (iv) m(r) = −C(r + 1)(r 2 + ar + b). Here PM , PA and PB are the matter\npoint P5 , the de Sitter point P1 , and the accelerated point P6 , respectively. From Ref. [64].\n\nand α > 0 falls into this category. On the other hand, if 0 < m5 < 0.327, the latter two eigenvalues in Eq. (24) are\ncomplex with negative real parts. Then, provided that m′5 > −1, the point P5 corresponds to a saddle point with\na damped oscillation. Hence the Universe can evolve toward the point P5 from the radiation era and leave for the\nlate-time acceleration. Then the condition for the existence of the saddle matter era is\nm(r) ≈ +0 ,\n\ndm\n> −1 ,\ndr\n\nat r = −1 .\n\nThe first condition implies that the f (R) models need to be close to the ΛCDM model during the matter era.\nThe eigenvalues for the Jacobian matrix of perturbations about the point P1 are\np\n25 − 16/m1\n3\n,\n− 3, − ±\n2\n2\n\n(25)\n\n(26)\n\nwhere m1 = m(r = −2). This shows that the condition for the stability of the de Sitter point P1 is [62, 159–161]\n0 < m(r = −2) ≤ 1 .\n\n(27)\n\nThe trajectories that start from the saddle matter point P5 with the condition (25) and then approach the stable de\nSitter point P1 with the condition (27) are cosmologically viable.\nLet us consider a couple of viable f (R) models in the (r, m) plane. The ΛCDM model, f (R) = R−2Λ, corresponds to\nm = 0, in which case the trajectory is a straight line from P5 : (r, m) = (−1, 0) to P1 : (r, m) = (−2, 0). The trajectory\n(ii) in Fig. 1 represents the model f (R) = (Rb −Λ)c [64], which corresponds to the straight line m(r) = [(1−c)/c]r+b−1\nin the (r, m) plane. The existence of a saddle matter epoch requires the condition c ≥ 1 and bc ≈ 1. The trajectory\n(iii) represents the model [62, 63]\nf (R) = R − αRn\n\n(α > 0, 0 < n < 1),\n\n(28)\n\n2\nwhich corresponds to the curve m = n(1 + r)/r. The trajectory (iv) in Fig. 1 shows\n√ the model m(r) = −C(r + 1)(r +\nar + b), in which case the late-time accelerated attractor is the point P6 with ( 3 − 1)/2 < m < 1.\nIn Ref. [62] it was shown that the variable m needs to be close to 0 during the radiation-dominated epoch as well.\nHence the viable f (R) models are close to the ΛCDM model, f (R) = R − 2Λ, in the region R ≫ R0 (where R0 is\nthe present cosmological Ricci scalar). The Ricci scalar R given in Eq. (8) remains positive from the radiation era to\nthe present epoch, as long as the it does not oscillate. As we will see in Sec. II B, we require the condition f,R > 0\n\n\f7\nto avoid ghosts. Then the condition m > 0 for the presence of the matter-dominated epoch translates to f,RR > 0.\nThe model f (R) = R − α/Rn (α > 0, n > 0) is not viable because the condition f,RR > 0 is violated. We also note\nthat the power-law models with f (R) = Rn do not give rise to a successful cosmological trajectory [59, 60] (unlike\nthe claims in Ref. [162]).\nIn order to derive the equation of state of dark energy to confront with SN Ia observations for the cosmologically\nviable models, we rewrite Eqs. (6) and (7) as follows2 :\n3AH 2 = κ2 (ρm + ρr + ρDE ) ,\n\n(29)\n\n2\n\n−2AḢ = κ [ρm + (4/3)ρr + ρDE + PDE ] ,\n\n(30)\n\nwhere A is some constant and\nκ2 ρDE ≡ (1/2)(F R − f ) − 3H Ḟ + 3H 2 (A − F ) ,\n2\n\n2\n\nκ PDE ≡ F̈ + 2H Ḟ − (1/2)(F R − f ) − (3H + 2Ḣ)(A − F ) .\n\n(31)\n(32)\n\nDefining ρDE and PDE in this way, one can show that these satisfy the usual continuity equation\nρ̇DE + 3H(ρDE + PDE ) = 0 .\n\n(33)\n\nThe dark energy equation of state related with SN Ia observations is given by wDE ≡ PDE /ρDE . From Eqs. (29)\nand (30) it follows that\nwDE = −\n\nweff\n2AḢ + 3AH 2 + κ2 ρr /3\n,\n≃\n2\n2\n3AH − κ (ρm + ρr )\n1 − (F/A)Ωm\n\n(34)\n\nwhere the last approximate equality in Eq. (34) is valid in the regime where the radiation density ρr is negligible\nrelative to the matter density. The viable f (R) models approach the ΛCDM model in the past, i.e. F → 1 as R → ∞.\nIn order to reproduce the standard matter era for the redshifts z ≫ 1, one can choose A = 1 in Eqs. (29) and (30).\nAnother possible choice is A = F0 , where F0 is the present value of F . This choice is suitable if the deviation of F0\nfrom 1 is small (as in the scalar-tensor theory with a massless scalar field [164–166]). In both cases the equation of\nstate wDE can be smaller than −1 before reaching the de Sitter attractor [64, 71, 167–169]. Thus f (R) gravity models\ngive rise to a phantom equation of state without violating stability conditions of the system.\nAs we see in Eq. (34), the presence of non-relativistic matter is important to lead to the apparent phantom behavior.\nWe wish to stress here that for viable f (R) models constructed to satisfy all required conditions [such as the models\n(45), (46), and (48) we will discuss later] the ghosts are not present even if wDE < −1. A number of authors proposed\nsome models to realize wDE < −1 without including non-relativistic matter [170, 171], which means that wDE = weff\nfrom Eq. (34). However, such f (R) models usually imply the presence of ghosts3 , because weff < −1 corresponds to\nḢ > 0.\nThe observational constraints on specific f (R) models have been carried out in Refs. [172–175] from the background\nexpansion history of the Universe (see also Refs. [176–180] for the reconstruction of f (R) models from observations).\nSince the deviation of wDE from that in the ΛCDM model (wDE = −1) is not so significant [68, 167], the viable models\nsuch as (45), (46), and (48) can be consistent with the data fairly easily. In other words we do not obtain very tight\nbounds on model parameters from the information of the background expansion history only. However, the models\ncan be more strongly constrained at the level of perturbations, as we will see in Sec. VII A.\nB.\n\nConditions for the avoidance of ghosts and tachyonic instabilities\n\nIn this subsection we shall derive conditions for the avoidance of ghosts and tachyonic instabilities in f (R) theories.\nIn doing so we expand the action (1) up to the second-order by considering the following perturbed metric about the\nFLRW background\nds2 = −(1 + 2α)dt2 − 2a(t)∂i βdtdxi + a2 (t) (δij + 2ψδij + 2∂i ∂j γ) dxi dxj ,\n\n2\n3\n\n(35)\n\nIf the field equations are written in this form, we can also show that the background cosmological dynamics has a correspondence with\nequilibrium thermodynamics on the apparent horizon [163].\nIf a late-time de Sitter solution is a stable spiral, it happens that wDE oscillates around −1 with a small amplitude, even for viable f (R)\nmodels. Here we are discussing the real ghosts out of this regime.\n\n\f8\nwhere α, β, ψ, γ are scalar metric perturbations [181].\nIntroducing the perturbation δF for the quantity F = ∂f /∂R, one can construct the gauge-invariant curvature\nperturbation\nR≡ψ−\n\nH\nδF .\nḞ\n\n(36)\n\nExpanding the action (1) without the matter source, we obtain the second-order action for the curvature perturbation\n[19, 182]\n\u0014\n\u0015\nZ\n1 2 1 1\n(2)\n3\n3\n2\nδS = dt d x a Qs\n(37)\nṘ −\n(∇R) ,\n2\n2 a2\nwhere\nQs ≡\n\n2κ2 F [H\n\n3Ḟ 2\n.\n+ Ḟ /(2F )]2\n\n(38)\n\nThe negative sign of Qs corresponds to a ghost field because of the negative kinetic energy. Hence the condition for\nthe avoidance of ghosts is given by\nF > 0.\n\n(39)\n\nFor the matter sector the ghost does not appear for ρM (1 + wM )/wM > 0 (where wM is the equation of state for the\nmatter fluid) [183], which is satisfied for radiation (wM = 1/3) and non-relativistic matter (wM ≃ +0).\nIf Qs is √\npositive, the action (37) can be written in the following form by introducing the new variables u = zs R\nand zs = a Qs :\n\u0014\n\u0015\nZ\n1 ′2 1\n1 zs′′ 2\n(2)\n3\n2\nδS = dη d x\n(40)\nu ,\nu − (∇u) +\n2\n2\n2 zs\nR\nwhere a prime represents a derivative with respect to the conformal time τ = a−1 dt. Equation (40) shows that the\nscalar degree of freedom has the effective mass\nMs2 ≡ −\n\n1 zs′′\nQ̇2s\nQ̈s\n3H Q̇s\n=\n−\n−\n2\n2\na zs\n4Qs\n2Qs\n2Qs\n72F 2 H 4\n1\n= −\n+ F\n2\n3\n(2F H + f,RR Ṙ)\n\n288H 3 − 12HR\n1\n+\nf\n2F H + f,RR Ṙ\n,RR\n\nwhere we have eliminated the term Ḣ by using the background equations.\nIn Fourier space the perturbation u satisfies the equation of motion\n\u0001\nu′′ + k 2 + Ms2 a2 u = 0 .\n\n!\n\n+\n\n2\nf,RR\nṘ2\n7\n− 24H 2 + R ,\n4F 2\n6\n\n(41)\n\n(42)\n\nFor k 2 /a2 ≫ Ms2 , the propagation speed cs of the field u is equivalent to the speed of light c. Hence, in f (R) gravity,\nthe gradient instability associated with negative c2s is absent. For small k satisfying k 2 /a2 ≪ Ms2 , we require that\nMs2 > 0 to avoid the tachyonic instability of perturbations. The viable dark energy models based on f (R) theories\nneed to satisfy the condition Rf,RR ≪ F (i.e. m = Rf,RR /f,R ≪ 1) at early cosmological epochs in order to have\nsuccessful cosmological evolution from radiation domination till matter domination. At these epochs the mass squared\nis approximately given by\nMs2 ≃\n\nF\n.\n3f,RR\n\n(43)\n\nUnder the no-ghost condition (39) the tachyonic instability is absent for\nf,RR > 0 .\n\n(44)\n\nThe viable f (R) dark energy models have been constructed to satisfy the conditions (39) and (44) in the regime\nR ≥ R1 , where R1 is the Ricci scalar at the late-time de Sitter point. Moreover we require that the models are\n\n\f9\nconsistent with the conditions (25) and (27). The model (28) can be consistent with all these conditions, but the\nlocal gravity constraints demand that the variable m is very much smaller than 1 in the regions of high density (i.e.\nR ≫ R0 , where R0 is the cosmological Ricci scalar today). In the model (28) one has m ≃ n(−r − 1) around r ≃ −1.\nFor the consistency with local gravity constraints we require that n . 10−10 [78], but in this case the deviation from\nthe ΛCDM model around the present epoch (R ≈ R0 ) is very small.\nIf the variable m behaves as m = C(−r − 1)p with p > 1 in the region R ≫ R0 , then it is possible to satisfy local\ngravity constraints (i.e. m ≪ 0.01 ∼ 0.1 for R ≫ R0 ) while at the same time showing deviations from the ΛCDM\n(m & 0.01 ∼ 0.1 for R ≃ R0 ). The models constructed in this vein are\n(R/Rc )2n\nwith μ > 0, n > 0 and Rc > 0 ,\n(R/Rc )2n + 1\nh\n\u0001−n i\n(B) f (R) = R − μRc 1 − 1 + R2 /Rc2\nwith μ > 0, n > 0 and Rc > 0 ,\n(A) f (R) = R − μRc\n\n(45)\n(46)\n\nwhich were proposed by Hu and Sawicki [68] and Starobinsky [69], respectively. Rc is roughly of the order of the\npresent cosmological Ricci scalar R0 for μ and n of the order of unity. The models (A) and (B) asymptotically behave\nas\nf (R) ≃ R − μRc [1 − (R2 /Rc2 )−n ]\n\nfor R ≫ Rc ,\n\n(47)\n\nwhich gives m(r) = C(−r − 1)2n+1 .\nAnother viable model that leads to the even rapid decrease of m toward the past is [71]\n(C) f (R) = R − μRc tanh (R/Rc )\n\nwith μ > 0, Rc > 0 .\n\n(48)\n\nOther similar models were proposed by Appleby and Battye [70] and Linder [72].\nIn what follows we shall discuss local gravity constraints on the above models.\nC.\n\nLocal gravity constraints on f (R) gravity models\n\nLet us proceed to discuss local gravity constraints on f (R) gravity models. In the region of high density like Earth\nor Sun, the Ricci scalar R is much larger than the background cosmological value R0 . In this case the linear expansion\nof R = R0 + δR cannot be justified. In such a non-linear regime the chameleon mechanism [81, 82] plays an important\nrole for the f (R) models to satisfy local gravity constraints [61, 64, 68, 77–80] (see also Refs. [184–190]).\nTo discuss the chameleon mechanism in f (R) gravity, it is convenient to transform the action (1) to the so-called\nEinstein frame action via the conformal transformation [191]:\ng̃μν = Ω2 gμν ,\n\nΩ2 = F .\n\n(49)\n\nThe action in the Einstein frame includespa linear term in R̃, where the tilde represents quantities in the Einstein\nframe. Introducing a new scalar field φ = 3/2κ2 ln F , we obtain the action in the Einstein frame, as [19, 191]\n\u0014\n\u0015 Z\nZ\np\n1\n1 μν\n4\nR̃ − g̃ ∂μ φ∂ν φ − V (φ) + d4 x LM (F −1 g̃μν , ΨM ) ,\n(50)\nSE = d x −g̃\n2κ2\n2\n\nwhere\n\nV (φ) =\n\nRF − f\n.\n2κ2 F 2\n\n(51)\n\nIn the Einstein frame the scalar field\n√φ directly couples with non-relativistic matter. The strength of this coupling\ndepends on the conformal factor Ω = F . We define the coupling Q as\nQ≡−\n\nF,φ\n1\nΩ,φ\n=−\n= −√ ,\nΩ\n2F\n6\n\n(52)\n\nwhich is of the order of unity in f (R) gravity. If the field potential V (φ) is absent, the field propagates freely with a\nlarge coupling Q. Since a potential (51) with a gravitational origin is present in f (R) gravity, it is possible for f (R)\ndark energy models to satisfy local gravity constraints through the chameleon mechanism [61, 68, 78, 80].\n\n\f10\nIn a spherically symmetric space-time under a weak gravitational background (i.e. neglecting the backreaction of\ngravitational potentials), variation of the action (50) with respect to the scalar field φ leads to\nd2 φ 2 dφ\ndVeff\n+\n=\n,\ndr̃2\nr̃ dr̃\ndφ\n\n(53)\n\nwhere r̃ is a distance from the center of symmetry, and Veff (φ) is an effective potential defined by\nVeff (φ) = V (φ) + eQφ ρ∗ .\n\n(54)\n\nHere ρ∗ is a conserved quantity in the Einstein frame, which is related to the density ρ̃ in the Jordan frame via the\nrelation ρ∗ = e3Qφ ρ̃. By the end of this section we use the unit κ2 = 1.\nWe assume that a spherically symmetric body has a constant density ρ∗ = ρA inside the body (r̃ < r̃c ) and that\nthe density outside the body (r̃ > r̃c ) is ρ∗ = ρB . The mass Mc of the body and the gravitational potential Φc at\nthe radius r̃c are given by Mc = (4π/3)r̃c3 ρA and Φc = Mc /8πr̃c , respectively. The effective potential Veff (φ) has two\n′\n′\nminima at the field values φA and φB satisfying Veff\n(φA ) = 0 and Veff\n(φB ) = 0, respectively (here a prime represents a\nderivative with respect to φ). The former corresponds to the region with a high density that gives rise to a large mass\n′′\n′′\nsquared m2A ≡ Veff\n(φA ), whereas the latter to the lower density region with a smaller mass squared m2B ≡ Veff\n(φB ).\nWhen the \"dynamics\" of the field φ with the field equation (53) is studied, we need to consider the effective potential\n(−Veff ) so that it has two maxima at φ = φA and φ = φB .\nWe impose the two boundary conditions (dφ/dr̃)(r̃ = 0) = 0 and φ(r̃ → ∞) = φB . The field φ is at rest at r̃ = 0\nand begins to roll down the potential when the matter-coupling term QρA eQφ becomes important at a radius r̃1 in\nEq. (53). As long as r̃1 is close to r̃c such that ∆r̃c ≡ r̃c − r̃1 ≪ r̃c , the body has a thin-shell inside the body. The field\nacquires a sufficient kinetic energy in the thin-shell regime (r̃1 < r̃ < r̃c ) and hence the field climbs up the potential\nhill outside the body (r̃ > r̃c ).\nThe field profile can be obtained by matching the solutions of Eq. (53) at the radius r̃ = r̃1 and r̃ = r̃c . Neglecting\nthe mass term mB , the thin-shell field profile outside the body is given by [192]\nφ(r̃) = φB − 2Qeff\n\nGMc\n,\nr̃\n\n(55)\n\nwhere\nQeff ≃ 3Qǫth ,\n\nǫth ≡\n\nφB − φA\n.\n6QΦc\n\n(56)\n\nHere ǫth is called a thin-shell parameter. Under the conditions ∆r̃c /r̃c ≪ 1 and 1/(mA r̃c ) ≪ 1, the thin-shell\nparameter is approximately given by [192]\nǫth ≃\n\n1\n∆r̃c\n+\n.\nr̃c\nmA r̃c\n\n(57)\n\nProvided that ǫth ≪ 1, the amplitude\nof the effective coupling Qeff can be much smaller than 1. It is then possible\n√\nfor the f (R) models (|Q| = 1/ 6) to be consistent with local gravity experiments. Originally the thin-shell solution\nwas derived by assuming that the field is frozen in the region 0 < r̃ < r̃1 [81, 82]. In this case the thin-shell parameter\nis given by ǫth ≃ ∆r̃c /r̃c , which is different from Eq. (57). However, this difference is not important because the\ncondition ∆r̃c /r̃c ≫ 1/(mA r̃c ) is satisfied for most of viable models [192].\nConsider the bound on the thin-shell parameter from the possible violation of equivalence principle (EP). The\ntightest bound comes from the solar system tests of weak EP using the free-fall acceleration of Moon (aMoon ) and\nEarth (a⊕ ) toward Sun [82]. The experimental bound on the difference of two accelerations is given by [193]\n|aMoon − a⊕ |\n< 10−13 .\n(aMoon + a⊕ )/2\n\n(58)\n\nProvided that Earth, Sun, and Moon have thin-shells, the field profiles outside the bodies are given by Eq. (55) with\nthe replacement of corresponding quantities. The acceleration induced by a fifth force with the field profile φ(r̃) and\nthe effective coupling Qeff is afifth = |Qeff ∇φ(r̃)|. Using the thin-shell parameter ǫth,⊕ for Earth, the accelerations a⊕\nand aMoon toward Sun (mass M⊙ ) are\n\u0014\n\u0014\n\u0015\n\u0015\nΦ2⊕\nGM⊙\nΦ⊕\nGM⊙\n2 2\n2 2\na⊕ ≃\n1 + 18Q ǫth,⊕\n1 + 18Q ǫth,⊕\n,\naMoon ≃\n,\n(59)\nr̃2\nΦ⊙\nr̃2\nΦ⊙ ΦMoon\n\n\f11\nwhere Φ⊙ ≃ 2.1 × 10−6 , Φ⊕ ≃ 7.0 × 10−10 , and ΦMoon ≃ 3.1 × 10−11 are the gravitational potentials of Sun, Earth\nand Moon, respectively. Then the condition (58) translates to\nǫth,⊕ < 8.8 × 10−7 /|Q| .\n\n(60)\n\nSince the condition |φB | ≫ |φA | is satisfied for viable f (R) models (as we will see below), we have ǫth,⊕ ≃ φB /(6QΦ⊕ )\nfrom Eq. (56). Hence the condition (60) corresponds to\n|φB,⊕ | < 3.7 × 10−15 .\n\n(61)\n\nLet us consider local gravity constraints on the f (R) models given in Eqs. (45) and (46). In the region of high\ndensity where local gravity experiments are carried out, it is sufficient to use the asymptotic form given in Eq. (47).\nIn order for these models to be responsible for the present cosmic acceleration, Rc is roughly the same order as the\ncosmological Ricci scalar R0 today for μ and n of the order of unity. For the functional form (47) we have the following\nrelations\nF = e2φ/\n\n√\n6\n\n= 1 − 2nμ(R/Rc )−(2n+1) ,\n\"\n\u00132n/(2n+1) #\n\u0012\n√\n√\n1\n−φ\n−4φ/ 6\n+ ρ∗ e−φ/ 6 .\nVeff (φ) ≃ μRc e\n1 − (2n + 1) √\n2\n6nμ\nInside and outside the body the effective potential (63) has minima at\n√\n√\nφA ≃ − 6nμ(Rc /ρA )2n+1 , φB ≃ − 6nμ(Rc /ρB )2n+1 .\n\n(62)\n(63)\n\n(64)\n\nIf ρA ≫ ρB , then one has |φB | ≫ |φA |.\nThe bound (61) translates into\nnμ\nx2n+1\n1\n\n\u0012\n\nR1\nρB\n\n\u00132n+1\n\n< 1.5 × 10−15 .\n\n(65)\n\nHere x1 is defined by x1 ≡ R1 /Rc , where R1 is the Ricci scalar at the late-time de Sitter fixed point P1 given in\nEq. (18). Let us consider the model described by the Lagrangian density (47) for R ≥ R1 . If we use the models (45)\nand (46), then there are some modifications for the estimation of R1 . However this change is not significant when we\nplace constraints on model parameters.\nThe de Sitter solution for the model (47) satisfies μ = x2n+1\n/[2(x2n\n1 − n − 1)]. Substituting this relation into\n1\nEq. (65), it follows that\nn\n2(x2n\n−\nn − 1)\n1\n\n\u0012\n\nR1\nρB\n\n\u00132n+1\n\n< 1.5 × 10−15 .\n\n(66)\n\n2\nFor the stability of the de Sitter point we require that m(R1 ) < 1, which translates into the condition x2n\n1 > 2n +3n+1.\n2n\nHence the term n/[2(x1 − n − 1)] in Eq. (66) is smaller than 0.25 for n > 0.\nLet us use the simple approximation that R1 and ρB are of the orders of the present cosmological density 10−29\ng/cm3 and the baryonic/dark matter density 10−24 g/cm3 in our galaxy, respectively. From Eq. (66) we obtain the\nconstraint [78]\n\nn > 0.9 .\n\n(67)\n\nThus n is not required to be much larger than unity. Under the condition (67), as R decreases to the order of Rc ,\none can cosmologically see an appreciable deviation from the ΛCDM model. The deviation from the ΛCDM model\nappears when R decreases to the order of Rc . The model (48) also shows similar behavior. If we consider the model\n(28), it was shown in Ref. [78] that the bound (61) gives the constraint n < 3 × 10−10 . Hence the deviation from the\nΛCDM model is very small. The models (45) and (46) are carefully constructed to satisfy local gravity constraints,\nwhile at the same time the deviation from the ΛCDM model appears even for n = O(1). Note that the model (48)\ncan easily satisfy local gravity constraints because of the rapid approach to the ΛCDM in the regime R ≫ Rc .\nIn the strong gravitational background (such as neutron stars), Kobayashi and Maeda [194, 195] pointed out that\nfor the model (46) it is difficult to obtain thin-shell solutions inside a spherically symmetric body with constant\ndensity. For chameleon models with general couplings Q, a thin-shell field profile was analytically derived in Ref. [196]\nby employing a linear expansion in terms of the gravitational potential Φc at the surface of a compact object with\n\n\f12\nconstant density. Using the boundary condition set by analytic solutions, Ref. [196] also numerically confirmed the\nexistence of thin-shell solutions for Φc . 0.3 in the case of inverse power-law potentials V (φ) = M 4+n φ−n . Ref. [197]\nalso showed that static relativistic stars with constant density exists for the model (46). The effect of the relativistic\npressure is important around the center of the body, so that the field tends to roll down the potential quickly unless\nthe boundary condition is carefully chosen. Realistic stars have densities ρA (r) that globally decrease as a function of\nr. The numerical simulation of Refs. [198, 199] showed that thin-shell solutions are present for the f (R) model (46)\nby considering a polytropic equation of state even in the strong gravitational background (see also Ref. [200]).\nIII.\n\nSCALAR-TENSOR GRAVITY\n\nThere is another class of modified gravity called scalar-tensor theories in which the Ricci scalar R is coupled to a\nscalar field φ. One of the simplest examples is the so-called Brans-Dicke theory with the action\n\u0015 Z\n\u0014\nZ\n√\nωBD\n1\nS = d4 x −g φR −\n(∇φ)2 − U (φ) + d4 x LM (gμν , ΨM ) ,\n(68)\n2\n2φ\nwhere ωBD is a constant (called the Brans-Dicke parameter), U (φ) is a field potential, and LM is a matter Lagrangian\nthat depends on the metric gμν and matter fields Ψm . The original Brans-Dicke theory [73] does not have the field\npotential. As we will see below, metric f (R) gravity discussed in Sec. II is equivalent to the Brans-Dicke theory with\nωBD = 0.\nA.\n\nScalar-tensor theories and the matter coupling in the Einstein frame\n\nThe general action for scalar-tensor theories can be\n\u0014\nZ\n1\n4 √\nS = d x −g f (φ, R) −\n2\n\nwritten as\n\u0015 Z\n1\n2\nζ(φ)(∇φ) + d4 x LM (gμν , ΨM ) ,\n2\n\n(69)\n\nwhere f depends on the scalar field φ and the Ricci scalar R, ζ is a function of φ. We choose the unit κ2 = 8πG = 1.\nThe action (69) covers a wide variety of theories such as f (R) gravity (f (φ, R) = f (R), ζ = 0), Brans-Dicke theory\n(f = φR and ζ = ωBD /φ), and dilaton gravity (f = e−φ R and ζ = −e−φ ).\nLet us consider theories of the type\nf (φ, R) = F (φ)R − 2U (φ) .\n\n(70)\n\nIn order to avoid the appearance\nof ghosts we require that F (φ) > 0. Under the conformal transformation (49) with\n√\nthe conformal factor Ω = F , the action (69) can be transformed to that in the Einstein frame:\n\u0014\n\u0015 Z\nZ\np\n1\n1  ̃ 2\n− V (φ) + d4 x LM (g̃μν F −1 (φ), ΨM ) ,\n(71)\nSE = d4 x −g̃ R̃ − (∇φ)\n2\n2\n\nwhere\n\nV = U/F 2 .\nWe have introduced a new scalar field φ in order to make the kinetic term canonical:\ns \u0012\n\u00132\nZ\nζ\n3 F,φ\n+ ,\nφ ≡ dφ\n2 F\nF\n\n(72)\n\n(73)\n\nWe define the coupling between dark energy and non-relativistic matter in the Einstein frame:\n\" \u0012\n#−1/2\n\u00132\nF,φ\nζ\nF,φ 3 F,φ\nQ≡−\n+\n.\n(74)\n=−\n2F\nF 2 F\nF\n√\nRecall that in metric f (R) gravity we have that Q = −1/ 6. If Q is a constant, the following relations hold from\nEqs. (73) and (74):\n\u0012 \u00132\ndφ\n−2Qφ\n2\nF =e\n,\nζ = (1 − 6Q )F\n.\n(75)\ndφ\n\n\f13\nThen the action (69) in the Jordan frame can be written as [76]\n\"\n# Z\nZ\n1\n1\n4 √\n2\n2\nS = d x −g F (φ)R − (1 − 6Q )F (φ)(∇φ) − U (φ) + d4 x LM (gμν , ΨM ) .\n2\n2\n\n(76)\n\nIn the limit that Q → 0, the action (76) reduces to the one for a minimally coupled scalar field φ with the potential\nU (φ). The transformation of the Jordan frame action (76) via a conformal transformation g̃μν = F (φ)gμν gives rise\nto the Einstein frame action (71) with a constant coupling Q. The action (71) is equivalent to the action (50) with\ng̃μν = e−2Qφ gμν .\nOne can compare (76) with the action (68) in Brans-Dicke theory. Setting φ = F = e−2Qφ , one finds that two\nactions are equivalent if the parameter ωBD is related to Q via the relation [76, 82]\n3 + 2ωBD =\n\n1\n.\n2Q2\n\n(77)\n\nUsing this relation, we find\n√ that the General Relativistic limit (ωBD → ∞) corresponds to the vanishing coupling\n(Q → 0). Since Q = −1/ 6 in metric f (R) gravity, this corresponds to the Brans-Dicke parameter ωBD = 0 [51, 74].\nThe experimental bound on ωBD for a massless scalar field is given by ωBD > 40000 [193, 201], which translates into\nthe condition\n|Q| < 2.5 × 10−3\n\n(for a massless field).\n\n(78)\n\nIn such cases it is difficult to find a large difference relative to the uncoupled quintessence model. In the presence of\nthe field potential, however, it is possible for large coupling models (|Q| ∼ 1) to satisfy local gravity constraints via\nthe chameleon mechanism [76].\nThe above Brans-Dicke theory is one of the examples in scalar-tensor theories. In general the coupling Q is fielddependent apart from Brans-Dicke theory. If we consider a nonminimally coupled scalar field with F (φ) = 1 − ξφ2\nand ζ(φ) = 1, then it follows that Q(φ) = ξφ/[1 − ξφ2 (1 − 6ξ)]1/2 . The cosmological dynamics in such a theory have\nbeen studied by a number of authors [35–40, 202–205, 207–211]. If the field is nearly massless during most of the\ncosmological epochs, the coupling Q needs to be suppressed to avoid the propagation of the fifth force.\nIn the following we shall study the cosmological dynamics and local gravity constraints on the constant coupling\nmodels based on the action (76) with F (φ) = e−2Qφ .\nB.\n\nCosmological dynamics in Brans-Dicke theory\n\nWe study the cosmological dynamics for the Jordan frame action (76) in the presence of a non-relativistic fluid with\nenergy density ρm and a radiation fluid with energy density ρr . We regard the Jordan frame as a physical frame due\nto the usual conservation of non-relativistic matter (ρm ∝ a−3 ). In the flat FLRW background variation of the action\n(76) with respect to gμν and φ gives the following equations of motion\n3F H 2 = (1 − 6Q2 )F φ̇2 /2 + U − 3H Ḟ + ρm + ρr ,\n2\n\n2\n\n2F Ḣ = −(1 − 6Q )F φ̇ − F̈ + H Ḟ − ρm − (4/3)ρr ,\n2\n\n(1 − 6Q )F [φ̈ + 3H φ̇ + Ḟ /(2F )φ̇] + U,φ + QF R = 0 .\n\n(79)\n(80)\n(81)\n\nLet us introduce the following variables\n\nφ̇\nx1 ≡ √\n,\n6H\nand\n\n1\nx2 ≡\nH\n\nr\n\nU\n,\n3F\n\n1\nx3 ≡\nH\n\nr\n\nρr\n,\n3F\n\n(82)\n\n√\nρm\n,\nΩrad ≡ x23 ,\nΩDE ≡ (1 − 6Q2 )x21 + x22 + 2 6Qx1 .\n(83)\n2\n3F H\nThese satisfy the relation Ωm + Ωrad + ΩDE = 1 from Eq. (79). Using Eqs. (79)-(81), we obtain the differential\nequations for x1 , x2 and x3 :\n√\n√\ni\n√\n√\nḢ\ndx1\n6\n6Q h\n2\n(5 − 6Q2 )x21 + 2 6Qx1 − 3x22 + x23 − 1 − x1 2 ,\n(84)\n=\n(λx2 − 6x1 ) +\ndN\n2\n2\nH\n√\ndx2\n6\nḢ\n(85)\n=\n(2Q − λ)x1 x2 − x2 2 ,\ndN\n2\nH\n√\nḢ\ndx3\n(86)\n= 6Qx1 x3 − 2x3 − x3 2 ,\ndN\nH\nΩm ≡\n\n\f14\nwhere N = ln a, λ = −U,φ /U , and\n\u0011\n√\nḢ\n1 − 6Q2 \u0010\n2\n2\n2\n2 2\n+ 3Q(λx22 − 4Q) .\n6Qx\n3\n+\n3x\n−\n3x\n+\nx\n−\n6Q\nx\n+\n2\n=\n−\n1\n1\n2\n3\n1\nH2\n2\n\n(87)\n\nThe effective equation of state of the system is given by by weff = −1 − 2Ḣ/(3H 2 ).\nIf λ is a constant, one can derive the fixed points of the system (84)-(86) in the absence of radiation (x3 = 0) [76]:\n• (a)\n(x1 , x2 ) =\n\n!\n√\n6Q\n,0 ,\n3(2Q2 − 1)\n\nΩm =\n\n3 − 2Q2\n,\n3(1 − 2Q2 )2\n\n• (b)\n(x1 , x2 ) =\n• (c)\n(x1 , x2 ) =\n\n\u0012\n\n1\n√\n,0\n6Q ± 1\n\n\u0013\n\n,\n\nΩm = 0 ,\n\n√\n\u00151/2 !\n\u0014\n6(4Q − λ)\n6 − λ2 + 8Qλ − 16Q2\n,\n,\n6(4Q2 − Qλ − 1)\n6(4Q2 − Qλ − 1)2\n\n• (d)\n(x1 , x2 ) =\n\n!\n√ r\n6\n3 + 2Qλ − 6Q2\n,\n,\n2λ\n2λ2\n\nΩm = 1 −\n\n(x1 , x2 ) = (0, 1) ,\n\nΩm = 0 ,\n\nweff\n\nweff =\n\n4Q2\n.\n3(1 − 2Q2 )\n\n(88)\n\n√\n3 ∓ 6Q\n√\n=\n.\n3(1 ± 6Q)\n\nΩm = 0 ,\n\nweff = −\n\n3 − 12Q2 + 7Qλ\n,\nλ2\n\n(89)\n\n20Q2 − 9Qλ − 3 + λ2\n.\n3(4Q2 − Qλ − 1)\n(90)\n\nweff = −\n\n2Q\n.\nλ\n\n(91)\n\n• (e)\nweff = −1 .\n\n(92)\n\nThe point (e) corresponds to the de Sitter point, which exists only for λ = 4Q [this can be confirmed by setting φ̇ = 0\nin Eqs. (79)-(81)].\nWe first study the case of non-zero values of Q with constant λ, i.e. for the exponential potential U (φ) = U0 e−λφ .\nWe do not consider the special case of λ = 4Q. The matter-dominated era can be realized either by the point (a) or\nby the point (d). If the point (a) is responsible for the matter era, the condition Q2 ≪ 1 is required. We then have\nΩm ≃ 1 + 10Q2/3 > 1 and weff ≃ 4Q2 /3. √When Q2 ≪ 1 √\nthe scalar-field dominated point (c) yields an accelerated\nexpansion of the Universe provided that − 2 + 4Q < λ < 2 + 4Q. Under these conditions the point (a) is followed\nby the late-time cosmic acceleration. The scaling solution (d) can give rise to the equation of state, weff ≃ 0 for\n|Q| ≪ |λ|. In this case, however, the condition weff < −1/3 for the point (c) gives λ2 < 2. Then the energy fraction of\nthe pressureless matter for the point (d) does not satisfy the condition Ωm ≃ 1. From the above discussion the viable\ncosmological trajectory for constant λ corresponds\nto the sequence\nfrom the point (a) to the scalar-field dominated\n√\n√\n2\npoint (c) under the conditions Q ≪ 1 and − 2 + 4Q < λ < 2 + 4Q.\nWe shall proceed to the case where λ varies with time. The fixed points derived above for constant λ can be\nregarded as the \"instantaneous\" fixed points, provided that the time scale of the variation of λ is smaller than that of\nthe cosmic expansion. The matter era can be realized by the point (d) with |Q| ≪ |λ|. The solutions finally approach\neither the de Sitter point (e) with λ = 4Q or the accelerated point (c).\nIn the following we focus on the case in which the matter era with the point (d) is followed by the accelerated\nepoch with the de Sitter solution (e). To study the stability of the point (e) we define a variable x4 ≡ F , satisfying\nthe following equation\n√\ndx4\n= −2 6Qx1 x4 .\ndN\n\n(93)\n\n\f15\nConsidering the 3 × 3 matrix for perturbations δx1 , δx2 and δx4 around the point (e), we obtain the eigenvalues\n\"\n#\nr\n8\ndλ\n3\n(F1 ) ,\n(94)\n− 3 , − 1 ± 1 − F1 Q\n2\n3\ndF\nwhere F1 ≡ F (φ1 ) is the value of F at the de Sitter point with the field value φ1 . Since F1 > 0, we find that the de\nSitter point is stable under the condition\nQ\n\ndλ\n(F1 ) ≥ 0 ,\ndF\n\ni.e.,\n\ndλ\n(φ1 ) ≤ 0 .\ndφ\n\n(95)\n\nLet us consider the f (R) model (47) in which the models (45) and (46) are recovered in the regime R ≫ Rc . Since\n= 1 − 2nμ(R/Rc )−(2n+1) , the potential U = (F R − f )/2 is given by\ne\n\u0015\n\u0014\n\u0010\n√ \u00112n/(2n+1)\n2n + 1\nμRc\n2φ/ 6\n,\n(96)\n1−\n1\n−\ne\nU (φ) =\n2\n(2nμ)2n/(2n+1)\n√\n2φ/ 6\n\nIn this case the slope of the potential, λ = −U,φ /U , is\n\n√\n\u0014\n\u0015\n\u0010\n√ \u0011 −2n/(2n+1) \u0010\n√ \u0011−1/(2n+1)\n4ne2φ/ 6\n2n + 1\n2φ/ 6\n2φ/ 6\nλ = −√\n.\n1−\n1\n−\ne\n1\n−\ne\n(2nμ)2n/(2n+1)\n6(2nμ)2n/(2n+1)\n\n(97)\n\nIn the deep matter-dominated epoch during which the condition R/Rc ≫ 1 is satisfied, the field φ is very close to\nzero. For n and μ of the order of unity, we have |λ| ≫ 1 at this stage. Hence the matter era can be realized by the\ninstantaneous fixed point\n(d). As R/Rc gets smaller, |λ| decreases to the order of unity. If the solutions reach the\n√\npoint λ = 4Q = −4/ 6 and satisfy the stability condition dλ/dF ≤ 0, then the final attractor corresponds to the de\nSitter fixed point (e).\nFor the theories with general couplings Q, it is possible to construct a scalar-field potential that is the generalization\nof (51). One example is [76]\n\u0003\n\u0002\nU (φ) = U0 1 − C(1 − e−2Qφ )p\n(U0 > 0, C > 0, 0 < p < 1) .\n(98)\n√\nThe f (R) model (47) corresponds to Q = −1/ 6 and p = 2n/(2n + 1). The slope of the potential is given by\nλ=\n\n2Cp Qe−2Qφ (1 − e−2Qφ )p−1\n.\n1 − C(1 − e−2Qφ )p\n\n(99)\n\nWe have U (φ) → U0 for φ → 0 and U (φ) → U0 (1 − C) in the limits φ → ∞ (for Q > 0) and φ → −∞ (for Q < 0).\nThe field is nearly frozen around the value φ = 0 during the deep radiation and matter epochs. In these epochs we\nhave R ≃ ρm /F from Eqs. (79)-(81) by noting that U0 is negligibly small compared to ρm or ρr . Using Eq. (81), it\nfollows that U,φ + Qρm ≃ 0. Hence, in the high-curvature region, the field φ evolves along the instantaneous minima\ngiven by\nφm ≃\n\n1\n2Q\n\n\u0012\n\n2U0 pC\nρm\n\n\u00131/(1−p)\n\n.\n\n(100)\n\nThe field value |φm | increases for decreasing ρm . As long as the condition ρm ≫ 2U0 pC is satisfied, we have |φm | ≪ 1\nfrom Eq. (100).\nFor field values around φ = 0 one has |λ| ≫ 1 from Eq. (99). Hence the instantaneous fixed point (d) can be\nresponsible for the matter-dominated epoch provided that |Q| ≪ |λ|. The variable F = e−2Qφ decreases in time\nirrespective of the sign of the coupling Q and hence 0 < F < 1. The de Sitter solution corresponds to λ = 4Q, that is\nC=\n\n2\n.\n(1 − F1 )p−1 [2 + (p − 2)F1 ]\n\n(101)\n\nThis solution is present as long as the solution of this equation exists in the region 0 < F1 < 1.\nFrom Eq. (99) the derivative of λ with respect to φ is\n4CpQ2 F (1 − F )p−2 [1 − pF − C(1 − F )p ]\ndλ\n.\n=−\ndφ\n[1 − C(1 − F )p ]2\n\n(102)\n\n\f16\n1.0\n\nWDE\n\nWm\n\n0.50\n\nWrad\n\n0.0\n\n-0.50\n\nw eff\n-1.0\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n\nN\nFigure 2: The evolution of ΩDE , Ωm , Ωrad and weff in Brans-Dicke theory with the potential (98). The model parameters are\nQ = 0.01, p = 0.2 and C = 0.7 with the initial conditions x1 = 0, x2 = 2.27 × 10−7 , x3 = 0.7, and x4 − 1 = −5.0 × 10−13 . From\nRef. [76].\n\nThe de Sitter point is stable under the condition 1 − pF1 > C(1 − F1 )p . Using Eq. (101) this translates into\nF1 > 1/(2 − p) .\n\n(103)\n\nWhen 0 < C < 1 one can show that dλ/dφ < 0 is always satisfied. Hence the solutions approach the de Sitter\nattractor after the end of the matter era. When C > 1, the de Sitter point is stable under the condition (103). If this\ncondition is violated, the solutions choose another stable fixed point [such as the point (c)] as an attractor.\nThe above discussion shows that, if 0 < C < 1, the matter point (d) can be followed by the stable de Sitter solution\n(e). In Fig. 2 we plot the evolution of ΩDE , Ωm , Ωrad , and weff for Q = 0.01, p = 0.2 and C = 0.7. This shows that\nthe viable cosmological trajectory can be realized for the potential (98). In order to confront with SN Ia observations,\nit is possible to rewrite Eqs. (79) and (80) in the forms of Eqs. (29) and (30) by defining the dark energy density\nρDE and the pressure PDE in the similar way. It was shown in Ref. [76] that the phantom equation of state as well\nas the cosmological constant boundary crossing can be realized for the field potentials U (φ) satisfying local gravity\nconstraints.\nC.\n\nLocal gravity constraints on Brans-Dicke theory\n\nWe study local gravity constraints on Brans-Dicke theory described by the action (76). In the absence of the\npotential U (φ) we already mentioned that the Brans-Dicke parameter ωBD is constrained to be ωBD > 4.0 × 104 from\nsolar-system experiments. This gives the upper bound (78) on the coupling Q between the field φ and non-relativistic\nmatter in the Einstein frame. This bound also applies to the case of a nearly massless field with the potential U (φ) in\nwhich the Yukawa correction e−Mr is close to unity (where M is the scalar field mass and r is an interaction length).\nIn the presence of the field-potential it is possible for large coupling models (|Q| ∼ 1) to satisfy local gravity\nconstraints provided that the mass M of the field φ is sufficiently large in the region of high density. In fact,\nthe potential (98) is designed to have a large mass in the high-density region, so that it can be compatible with\nexperimental tests of gravity through the chameleon mechanism. In the following we study the model (98) and derive\nthe conditions under which local gravity constraints can be satisfied. If we make a conformal transformation for the\naction (98), the action in the Einstein frame is given by (76) with F (φ) = e−2Qφ . We can use the results obtained in\nSec. II C, because thin-shell solutions have been derived for the general coupling Q.\n\n\f17\nAs in the case of f (R) gravity, we consider a configuration in which a spherically symmetric body has a constant\ndensity ρA inside the body and that the density outside the body is given by ρ = ρB (≪ ρA ). Under the condition\n|Qφ| ≪ 1, we have V,φ ≃ −2U0 QpC(2Qφ)p−1 for the potential V = U/F 2 in the Einstein frame. Then the field values\nat the potential minima inside and outside the body are\n1\nφA ≃\n2Q\n\n\u0012\n\n2U0 p C\nρA\n\n\u00131/(1−p)\n\n,\n\n1\nφB ≃\n2Q\n\n\u0012\n\n2U0 p C\nρB\n\n\u00131/(1−p)\n\n.\n\n(104)\n\nIn order to realize the accelerated expansion today, the energy scale U0 is required to be the same order as the square\nof the present Hubble parameter H0 , i.e. U0 ∼ H02 ∼ ρ0 , where ρ0 ≃ 10−29 g/cm3 is the cosmological density today.\nThe baryonic/dark matter density in our galaxy corresponds to ρB ≃ 10−24 g/cm3 . Hence the conditions |QφA | ≪ 1\nand |QφB | ≪ 1 are in fact satisfied unless C ≫ 1. The field mass squared m2A ≡ V,φφ at φ = φA is approximately\ngiven by\nm2A ≃\n\n1−p\nQ2\n(2p pC)1/(1−p)\n\n\u0012\n\nρA\nU0\n\n\u0013(2−p)/(1−p)\n\nU0 ,\n\n(105)\n\nwhich means that mA can be much larger than H0 because of the condition ρA ≫ U0 . This large mass allows the\nchameleon mechanism to work, because the condition 1/(mA r̃c ) ≪ 1 is satisfied.\nThe bound (61) coming from the violation of equivalence principle in the solar system translates into\n1/(1−p)\n\n(2U0 pC/ρB )\n\n< 7.4 × 10−15 |Q| .\n\n(106)\n\nLet us consider the case in which the solutions finally approach the de Sitter solution (e). At the point (e), one has\n3F1 H12 = U0 [1 − C(1 − F1 )p ] with C given in Eq. (101). Hence we get the following relation\nU0 = 3H12 [2 + (p − 2)F1 ] /p .\n\n(107)\n\nPlugging this into Eq. (106), it follows that\n1/(1−p)\n\n(R1 /ρB )\n\n(1 − F1 ) < 7.4 × 10−15 |Q| ,\n\n(108)\n\nwhere R1 = 12H12 is the Ricci scalar at the de Sitter point. Since the term (1 − F1 ) is smaller than 1/2 from the\ncondition (103), we obtain the inequality (R1 /ρB )1/(1−p) < 1.5 × 10−14 |Q|. Using the values R1 = 10−29 g/cm3 and\nρB = 10−24 g/cm3 , we obtain the following bound\np>1−\n\n5\n.\n13.8 − log10 |Q|\n\n(109)\n\nWhen |Q| = 10−1 and |Q| = 1 we have p > 0.66 and p > 0.64, respectively. Thus the model can be compatible with\nlocal gravity experiments even for |Q| = O(1).\nIn Ref. [79] it was shown that in order to satisfy both local gravity and cosmological constraints the chameleon\npotentials in the Einstein frame need to be of the form V (φ) = M 4 [1 + f (φ)], where the function f (φ) is smaller\nthan 1 today and M is a mass that corresponds to the dark energy scale (M ∼ 10−12 GeV). The potential V (φ) =\nM 4 exp[μ(M/φ)n ] [82, 212] is one of those viable candidates, but the allowed model parameter space is severely\nconstrained by the 2006 Eöt-Wash experiment [213]. Unless the parameter μ is unnaturally small (μ . 10−5 ), this\npotential is incompatible with local gravity constraints for {n, Q} = O(1).\nOn the other hand, the chameleon potential V (φ) = V0 [1 − μ(1 − e−φ )n ] (0 < n < 1) can satisfy both local gravity\nand cosmological constraints4. In Ref. [79] this potential is consistent with the constraint coming from 2006 EötWash experiments as well as the WMAP bound on the variation of the field-dependent mass [214] for natural model\nparameters.\n\n4\n\n\u0002\n\u0003\nIn the Einstein frame the potential (98) takes the form V (φ) = U/F 2 = U0 e4Qφ 1 − C(1 − e−2Qφ )p , so in the region |Qφ| ≪ 1 this\n−φ\nn\npotential is similar to V (φ) = V0 [1 − μ(1 − e ) ].\n\n\f18\nIV.\n\nDGP MODEL\n\nIn this section we review braneworld models of dark energy motivated by string theory. In braneworlds standard\nmodel particles are confined on a 3-dimensional (3D) brane embedded in 5-dimensional bulk with large extra dimensions [215, 216]. Dvali, Gabadadze, and Porrati (DGP) [41] proposed a braneworld model in which the 3-brane is\nembedded in a Minkowski bulk with infinitely large extra dimensions. One can recover Newton's law by adding a 4D\nEinstein-Hilbert action sourced by the brane curvature to the 5D action [217]. The presence of such a 4D term may\nbe induced by quantum corrections coming from the bulk gravity and its coupling with matter on the brane. In the\nDGP model the standard 4D gravity is recovered at small distances, whereas the effect from the 5D gravity manifests\nitself for large distances. Interestingly one can realize the self cosmic acceleration without introducing a dark energy\ncomponent [218, 219] (see also Ref. [220]).\nA.\n\nSelf-accelerating solution\n\nThe action of the DGP model is given by\nZ\nZ\nZ\np\np\n√\n1\n1\nS= 2\nd5 X −g̃ R̃ + 2\nd4 X −gR − d5 X −g̃ LM ,\n2κ(5)\n2κ(4)\n\n(110)\n\nwhere g̃AB is the metric in the 5D bulk and gμν = ∂μ X A ∂ν X B g̃AB is the induced metric on the brane with X A (xc )\nbeing the coordinates of an event on the brane labelled by xc . The 5D and 4D gravitational constants, κ2(5) and κ2(4) ,\nare related with the 5D and 4D Planck masses, M(5) and M(4) , via\n3\nκ2(5) = 1/M(5)\n,\n\n2\nκ2(4) = 1/M(4)\n.\n\n(111)\n\nThe first and second terms in Eq. (110) correspond to Einstein-Hilbert actions in the 5D bulk and on the brane,\nrespectively. There is no contribution to the Lagrangian LM from the bulk because we are considering\na Minkowski\nR\n√\nbulk. Then the matter action consists of a brane-localized matter whose action is given by d4 x −g (σ + Lbrane\n),\nM\nwhere σ is the 3-brane tension and Lbrane\nis\nthe\nLagrangian\ndensity\non\nthe\nbrane.\nSince\nthe\ntension\nis\nunrelated\nto\nM\nthe Ricci scalar R, it can be adjusted to be zero (as we do in the following).\nIn order to study the cosmological dynamics on the brane (located at y = 0), we take a metric of the form:\nds2 = −n2 (τ, y)dτ 2 + a2 (τ, y) γij dxi dxj + dy 2 ,\n\n(112)\n\nwhere γij represents a maximally symmetric space-time with a constant curvature K. The 5D Einstein equations are\n1\nG̃AB ≡ R̃AB − R̃ g̃AB = κ2(5) T̃AB ,\n2\n\n(113)\n(brane)\n\nwhere R̃AB is the 5D Ricci tensor, T̃AB is the sum of the energy momentum tensor TAB\ncontribution ŨAB coming from the scalar curvature of the brane:\n(brane)\n\nT̃AB = TAB\n\non the brane and the\n\n+ ŨAB .\n\nSince we are considering a homogeneous and isotropic Universe on the brane, one can write TBA\nTBA\n\n(brane)\n\n= δ(y) diag(−ρM , PM , PM , PM , 0) ,\n\n(114)\n(brane)\n\nin the form\n(115)\n\nwhere ρM and PM are functions of τ only. The non-vanishing components coming from the Ricci scalar R of the\nbrane are\n\u0012 2\n\u0013\nȧ\nn2\n3\n(116)\n+ K 2 δ(y) ,\nŨ00 = − 2\nκ(4) a2\na\n\u0013\n\u0015\n\u0014 2\u0012 2\nȧ\n1\nȧ ṅ\nä\na\n− K γij δ(y) ,\n(117)\n− 2 +2\nŨij = − 2\n−2\nκ(4) n2\na\nan\na\n\n\f19\nwhere a dot represents a derivative with respect to τ . The non-vanishing components of the 5D Einstein tensor G̃AB\nare [218, 221, 222]\n\u0012 ′′\n\u0013\n\u0015\n\u0014 2\nn2\na\na′2\nȧ\n(118)\n+ 2 +K 2 ,\nG̃00 = 3 2 − n2\na\na\na\na\n\u0014 \u0012 ′′\n\u0013\n\u0013\n\u0015\n\u0012\na\na2\nä a′2\na′ n′\nȧṅ\nn′′\na′2\nG̃ij = a2 2 +\n+ 2 −2 − 2 + 2\n− K γij ,\n(119)\n+ 2 +2\na\nn\na\nan\nn\na\na\nan\n\u0013\n\u0012 ′\nȧ′\nȧn\n,\n(120)\n−\nG̃05 = 3\nan\na\n\u0013\n\u0013\n\u0012 ′2\n\u0012\n3 ä ȧ2\nK\na\na′ n′\nȧṅ\n−\n−3 2 ,\nG̃55 = 3\n+\n−\n(121)\n+\na2\nan\nn2 a a2\nan\na\nwhere a prime represents a derivative with respect to y.\nAssuming no flow of matter along the 5-th dimensions, we have T̃05 = 0 and hence G̃05 = 0. Then Eqs. (118) and\n(121) can be written as\nG̃00 = −\n\n3n2 ′\nI ,\n2a3 a′\n\nG̃55 = −\n\n3  ̇\nI,\n2a3 ȧ\n\n(122)\n\nwhere\nI ≡ (a′ a)2 −\n\n(ȧa)2\n− Ka2 .\nn2\n\n(123)\n\nSince we are considering the Minkowski bulk, we have G̃00 = 0 and G̃55 = 0 locally in the bulk. This gives I ′ = 0 and\nI ̇ = 0. Integrations of these equations lead to\n(a′ a)2 −\n\n(ȧa)2\n− Ka2 + C = 0 ,\nn2\n\n(124)\n\nwhere C is a constant independent of τ and y.\nWe shall find solutions of the Einstein equations (113) in the vicinity of y = 0. The metric needs to be continuous\nacross the brane in order to have a well-defined geometry. However, its derivatives with respect to y can be discontinuous at y = 0. The Einstein tensor is made of the metric up to the second derivatives with respect to y, so the\nEinstein equations with a distributional source are written in the form [218, 221, 222]\ng ′′ = T δ(y) ,\n\n(125)\n\nwhere δ(y) is a Dirac's delta function. Integrating this equation across the brane gives\n[g ′ ] = T ,\n\nwhere\n\n[g ′ ] ≡ g ′ (0+ ) − g ′ (0− ) .\n\n(126)\n\nThe jump of the first derivative of the metric is equivalent to the energy-momentum tensor on the brane.\nEquations (118) and (119) include the derivatives a′′ and n′′ of the metric. Integrating the Einstein equations\nG̃00 = κ2(5) T̃00 and G̃ij = κ2(5) T̃ij across the brane, we obtain\nκ2(5)\nκ2(5)\n[a′ ]\n=−\nρM + 2 2\nab\n3\nκ(4) nb\nκ2(5)\n[n′ ]\n=\n(3PM\nnb\n3\n\n\u0013\nȧ2b\nn2b\n+K 2 ,\na2b\nab\n\u0012\n\u0013\nκ2(5)\nȧ2b\näb\nn2b\nȧb ṅb\n−2 +K 2 ,\n+ 2ρM ) − 2 2\n+2\nκ(4) nb a2b\nab nb\nab\nab\n\u0012\n\n(127)\n(128)\n\nwhere the subscript \"b\" represents the quantities on the brane.\nWe assume the symmetry y ↔ −y, in which case [a′ ] = 2a′ (0+ ) and [n′ ] = 2n′ (0+ ). Substituting Eq. (127) into\nEq. (124), we obtain the modified Friedmann equation on the brane:\ns\n\u0013\n\u0012\nκ2(5)\nκ2(5)\nK\nC\nK\n2\n2\nH + 2 −\nρM ,\n(129)\nǫ H + 2− 4 = 2\nab\nab\n2κ(4)\nab\n6\n\n\f20\nwhere H ≡ ȧb /(ab nb ) is the Hubble parameter and ǫ = ±1 is the sign of [a′ ]. The constant C can be interpreted as\nthe term coming from the 5D bulk Weyl tensor [218, 219, 223]. Since the Weyl tensor vanishes for the Minkowski\nbulk, we set C = 0 in the following discussion. We introduce a length scale\nrc ≡\n\nκ2(5)\n2κ2(4)\n\n=\n\n2\nM(4)\n3\n2M(5)\n\n.\n\n(130)\n\nThen Eq. (129) can be written as\nǫ\nrc\n\nr\n\nH2 +\n\nκ2(4)\nK\nK\n2\n=\nH\n+\n−\nρM ,\na2\na2\n3\n\n(131)\n\nwhere we have omitted the subscript \"b\" for the quantities at y = 0.\nPlugging the junction conditions (127) and (128) into the (05) component of the Einstein equations, G̃05 = 0, the\nfollowing matter conservation equation holds on the brane:\ndρM\n+ 3H(ρM + PM ) = 0 ,\ndt\n\n(132)\n\nwhere t is the cosmic time related to the time τ via the relation dt = nb dτ . If the equation of state, wM = PM /ρM ,\nis specified, the cosmological evolution is known by solving Eqs. (131) and (132).\nFor a flat geometry (K = 0), Eq. (131) reduces to\nκ2(4)\nǫ\nρM .\nH − H=\nrc\n3\n2\n\n(133)\n\nIf the crossover scale rc is much larger than the Hubble radius H −1 , the first term in Eq. (133) dominates over the\nsecond one. In this case the standard Friedmann equation, H 2 = κ2(4) ρM /3, is recovered. On the other hand, in the\nregime rc < H −1 , the presence of the second term in Eq. (133) leads to a modification to the standard Friedmann\nequation. In the Universe dominated by non-relativistic matter (ρM ∝ a−3 ), the Universe approaches a de Sitter\nsolution for the branch ǫ = +1:\nH → HdS = 1/rc .\n\n(134)\n\nWe can realize the cosmic acceleration today provided that rc is of the order of the present Hubble radius H0−1 .\nB.\n\nObservational constraints on the DGP model and other aspects of the model\n\nEquation (131) can be written as\n2\ns\n2\nκ\nK\n1\n1\n(4)\n .\nH2 + 2 = \nρM + 2 +\na\n3\n4rc\n2rc\n\n(135)\n\nFor the matter on the brane, we consider non-relativistic matter with the energy density ρm and the equation of state\n(0)\nwm = 0. We then have ρm = ρm (1 + z)3 from Eq. (132). Let us introduce the following density parameters\n(0)\n\nΩK = −\n\nK\n,\n2\na0 H02\n\nΩ(0)\nrc =\n\n1\n,\n2\n4rc H02\n\n(0)\n\nΩ(0)\nm =\n\nκ2(4) ρm\n3H02\n\n.\n\n(136)\n\nThen Eq. (135) reads\n2\n\nH (z) =\n\nH02\n\n\"\n\n(0)\nΩK (1\n\n\u001b2 #\n\u001aq\nq\n(0)\n(0)\n(0)\n.\n+ z) +\nΩm (1 + z)3 + Ωrc + Ωrc\n2\n\n(137)\n\nThe normalization condition at z = 0 is given by\nq\nq\n(0)\n(0)\n(0)\nΩ(0)\n+\nΩ\n+\n2\n1\n−\nΩ\nΩr c = 1 .\nm\nK\nK\n\n(138)\n\n\f21\n\n0.225\n0.2\n0.175\n0.15\nWrc\n0.125\n0.1\n0.075\n\n0.1\n\n0.2\n\n0.3\nWm\n\n0.4\n\n0.5\n\nFigure 3: Observational constraints on the DGP model from the SNLS data [225] (solid thin), the BAO [5] (dotted), and the\nCMB shift parameter from the WMAP 3-year data [226] (dot-dashed). The thick line represents the curve (139) for the flat\n(0)\n(0)\n(0)\nmodel (ΩK = 0). The figure labels Ωm and Ωrc correspond to Ωm and Ωrc , respectively. From Ref. [91].\n\nFor the flat universe (K = 0) this relation corresponds to\n(0) 2\nΩ(0)\nrc = (1 − Ωm ) /4 .\n\n(139)\n\nThe parametrization (137) of the Hubble parameter together with the normalization (138) can be used to place\nobservational constraints on the DGP model at the background level [89–93]. In Ref. [89] the authors found a\nsignificantly worse fit to Supernova Ia (SN Ia) data and the distance to the last-scattering surface [3] relative to the\nΛCDM model. In Refs. [90] and [92] the authors showed that the flat DGP model is disfavored from the combined\ndata analysis of SN Ia [224, 225] and BAO [5]. In Fig. 3 we show the joint observational constraints [91] from the\ndata of SNLS [225], BAO [5], and the CMB shift parameter [226]. While the flat DGP model can be consistent with\nthe SN Ia data, it is under strong observational pressure by adding the data of BAO and the CMB shift parameter.\nThe open DGP model gives a slightly better fit relative to the flat model [91, 93]. The joint analysis using the data of\nSN Ia, BAO, CMB, gamma ray bursts, and the linear growth factor of matter perturbations show that the flat DGP\nmodel is incompatible with current observations [94].\nIn the DGP model a brane-bending mode φ (i.e. longitudinal graviton) gives rise to a field self-interaction of the\nform \u0003φ(∂ μ φ∂μ φ) through a mixing with the transverse graviton [83, 84]. This can lead to the decoupling of the field\nφ from gravitational dynamics in the local region by the so-called Vainshtein mechanism [85]. The General Relativistic\nbehavior can be recovered within a radius r∗ = (rg rc2 )1/3 , where rg is the Schwarzschild radius of a source. Since\nr∗ is larger than the solar-system scales, the DGP model can evade local gravity constraints [83, 84, 228]. However\nthe DGP model is plagued by a strong coupling problem for typical distances smaller than 1000 km [229]. Some\nregularization methods have been proposed to avoid the strong coupling problem, such as smoothing out the delta\nprofile on the brane [230, 231] or re-using the delta function profile but in a higher-dimensional brane [232–234].\nAs we will see in VII C, the analysis of 5D cosmological perturbations on the scales larger than r∗ shows that the\nDGP model contains a ghost mode in the scalar sector of the gravitational field [86–88]. There are several ways of\nthe generalization of the DGP model to avoid the appearance of ghosts. One way is to consider the 6D braneworld\nset-up as in the Cascading gravity [235]. Another is to generalize the field self-interaction term \u0003φ(∂ μ φ∂μ φ) to more\ngeneral forms in the 4D gravity [42]. In Sec. V we shall discuss the latter approach (\"Galileon gravity\") in detail.\n\n\f22\nV.\n\nGALILEON GRAVITY\n\nIn the DGP model the field derivative self-coupling \u0003φ(∂μ φ∂ μ φ), arising from a brane-bending mode, allows the\ndecoupling of the field from matter within a Vainshtein radius. In the local regions where solar-system experiments\nare carried out, the field is nearly frozen through the non-linear self-interaction. This is different from the chameleon\nmechanism in which the presence of the field potential with a matter coupling gives rise to a minimum with a large\nmass in the regions of high density.\nUnder the Galilean shift ∂μ φ → ∂μ φ+bμ , the field equation following from the Lagrangian \u0003φ(∂ μ φ∂μ φ) is unchanged\nin the Minkowski space-time. The generalization of the nonlinear field Lagrangian to more general cases may be useful,\ne.g., to overcome the ghost problem associated with the DGP model. In fact Nicolis et al. [42] derived five Lagrangians\nthat lead to the field equations invariant under the Galilean shift ∂μ φ → ∂μ φ + bμ in the Minkowski space-time. The\nscalar field respecting the Galilean symmetry is dubbed \"Galileon\". Each of the five terms only leads to second-order\ndifferential equations, keeping the theory free from unstable spin-2 ghost degrees of freedom.\nIf we extend the analysis in Ref. [42] to that in the curved space-time, the Lagrangians should be promoted to\ncovariant forms. Deffayet et al. [95, 96] derived covariant Lagrangians Li (i = 1, * * * , 5) that keep the field equations\nup to second-order, while recovering the five Lagrangians derived by Nicolis et al. in the Minkowski space-time. This\ncan be achieved by introducing field-derivative couplings with the Ricci scalar R and the Einstein tensor Gνρ in the\nexpression of L4,5 . Since the existence of those terms affects the effective gravitational coupling, the Galileon gravity\nbased on the covariant Lagrangians Li (i = 1, * * * , 5) can be classified as one of modified gravitational theories.\nThe cosmological dynamics including the terms up to L4 and L5 have been studied by a number of authors [97, 236].\nIn particular Refs. [97, 98] have shown that, for the covariant Galileon theory having de Sitter attractors, cosmological\nsolutions with different initial conditions converge to a common trajectory– a tracker solution. Moreover there is a\nviable parameter space in which the conditions for the avoidance of ghosts and Laplacian instabilities of scalar and\ntensor perturbations are satisfied.\nThe generalization of Galileon gravity, which mostly corresponds to the modification of the term L3 = \u0003φ(∂ μ φ∂μ φ),\nhas been also extensively studied recently [237]-[258]. One application is to introduce the non-linear field selfinteraction of the form ξ(φ)\u0003φ(∂μ φ∂ μ φ) in the action of (generalized) Brans-Dicke theories [183, 238–240, 242],\nwhere ξ is a function of φ. For suitable choices of the function ξ(φ), there exist de Sitter (dS) solutions responsible\nfor dark energy even in the absence of the field potential. The cosmology based on a further general term G(φ, X)\u0003φ\nhas been discussed in the context of either dark energy and inflation [246, 247, 252, 253, 256–258].\nIn the following we review the cosmological dynamics in the Galileon dark energy model based on the covariant\nLagrangians Li (i = 1, * * * , 5) and study observational constraints on the model. We will also discuss the modified\nversion of Galileon gravity in which the term L3 = \u0003φ(∂ μ φ∂μ φ) is generalized.\nA.\n\nCosmology of a covariant Galileon field\n\nWe start with the covariant Galileon gravity described by the action [95, 96]\n\"\n# Z\nZ\n5\n2\nMpl\n1X\n4 √\nS = d x −g\nci Li + d4 x LM ,\nR+\n2\n2 i=1\n\n(140)\n\nwhere Mpl = (8πG)−1/2 is the reduced Planck mass, and ci 's are constants. The five Lagrangians Li (i = 1, * * * , 5)\nsatisfying the Galilean symmetry in the limit of the Minkowski space-time are given by\n\u0002\n\u0003\nL1 = M 3 φ , L2 = (∇φ)2 , L3 = (\u0003φ)(∇φ)2 /M 3 , L4 = (∇φ)2 2(\u0003φ)2 − 2φ;μν φ;μν − R(∇φ)2 /2 /M 6 ,\nL5 = (∇φ)2 [(\u0003φ)3 − 3(\u0003φ) φ;μν φ;μν + 2φ;μ ν φ;ν ρ φ;ρ μ − 6φ;μ φ;μν φ;ρ Gνρ ]/M 9 ,\n\n(141)\n\nwhere M is a constant having a dimension of mass, and Gνρ is the Einstein tensor. For the matter Lagrangian LM we\ntake into account perfect fluids of non-relativistic matter (energy density ρm , equation of state wm = 0) and radiation\n(energy density ρr , equation of state wr = 1/3).\nLet us consider the FLRW metric with the cosmic curvature K:\n\u0015\n\u0014\ndr2\n2\n2\n2\n2\n2\n2\n2\n+ r (dθ + sin θ dφ ) .\n(142)\nds = −dt + a (t)\n1 − Kr2\n\nVariation of the action (140) with respect to gμν leads to the following equations of motion\n2\n3Mpl\nH 2 = ρDE + ρm + ρr + ρK ,\n\n(143)\n\n2\n3Mpl\nH2\n\n(144)\n\n+\n\n2\n2Mpl\nḢ\n\n= −PDE − ρr /3 + ρK /3 ,\n\n\f23\n2\nwhere ρK ≡ −3KMpl\n/a2 , and\n\nρDE ≡ −c1 M 3 φ/2 − c2 φ̇2 /2 + 3c3 H φ̇3 /M 3 − 45c4 H 2 φ̇4 /(2M 6 ) + 21c5 H 3 φ̇5 /M 9 ,\n\nPDE ≡ c1 M 3 φ/2 − c2 φ̇2 /2 − c3 φ̇2 φ̈/M 3 + 3c4 φ̇3 [8H φ̈ + (3H 2 + 2Ḣ)φ̇]/(2M 6 )\n−3c5 H φ̇4 [5H φ̈ + 2(H 2 + Ḣ)φ̇]/M 9 .\n\n(145)\n(146)\n\nThe matter fluids satisfy the continuity equations ρ̇m + 3Hρm = 0 and ρ̇r + 4Hρr = 0. We define the dark energy\nequation of state wDE and the effective equation of state weff , as\nwDE ≡\n\nPDE\n,\nρDE\n\nweff ≡ −1 −\n\n2Ḣ\n.\n3H 2\n\n(147)\n\nUsing the continuity equation ρ̇DE + 3H(ρDE + PDE ) = 0, it follows that wDE = weff − Ω̇DE /(3HΩDE ).\nSince we are interested in the case where the late-time cosmic acceleration is realized by the field kinetic energy,\nwe set c1 = 0 in the following discussion5 . Then the de Sitter solution (H = HdS = constant) can be present for\n2\nφ̇ = φ̇dS = constant. We normalize the mass M to be M 3 = Mpl HdS\n, which gives M ≈ 10−40 Mpl for HdS ≈ 10−60 Mpl .\nDefining xdS ≡ φ̇dS /(HdS Mpl ), Eqs. (143) and (144) lead to the following relations at the de Sitter solution:\nc2 x2dS = 6 + 9α − 12β ,\n\nc3 x3dS = 2 + 9α − 9β ,\n\n(148)\n\nβ ≡ c5 x5dS .\n\n(149)\n\nwhere\nα ≡ c4 x4dS ,\n\nIt is convenient to use the variables α and β, because the coefficients of physical quantities and dynamical equations\ncan be expressed by α and β. The relations (148) do not change under the rescaling xdS → γxdS and ci → ci /γ i ,\nwhere γ is a real constant. Then the rescaled choice of ci can provide the same physics.\nIn order to study the cosmological dynamics, we introduce the following dimensionless variables:\nφ̇dS HdS\n,\nr1 ≡\nφ̇H\n\n1\nr2 ≡\nr1\n\nφ̇\nφ̇dS\n\n!4\n\n.\n\n(150)\n\nAt the de Sitter solution r1 = 1 and r2 = 1. We define the dark energy density parameter\nΩDE ≡\n\nρDE\n3\n2\n2 H 2 = −(2 + 3α − 4β)r1 r2 /2 + (2 + 9α − 9β)r1 r2 − 15αr1 r2 /2 + 7βr2 .\n3Mpl\n\n(151)\n\n2\n2\nThen Eq. (143) can be written as ΩDE + Ωm + Ωr + ΩK = 1, where Ωm ≡ ρm /(3Mpl\nH 2 ), Ωr ≡ ρr /(3Mpl\nH 2 ), and\n2\n2\n2\nΩK ≡ ρK /(3MplH ) = −K/(aH) .\nThe autonomous equations for the variables r1 , r2 , Ωr , and ΩK are given by [98, 259]:\n\n1\n(r1 − 1) r1 [r1 (r1 (−3α + 4β − 2) + 6α − 5β) − 5β]\n∆\u0002\n\u0001\u0003\n(152)\n× 2 (Ωr − ΩK + 9) + 3r2 r13 (−3α + 4β − 2) + 2r12 (9α − 9β + 2) − 15r1 α + 14β ,\n1\n= − [r2 (6r12 (r2 (45α2 − 4(9α + 2)β + 36β 2 ) − (Ωr − ΩK − 7)(9α − 9β + 2)) + r13 (−2(Ωr − ΩK + 33)\n∆\n×(3α − 4β + 2) − 3r2 (−2(201α + 89)β + 15α(9α + 2) + 356β 2 )) − 3r1 α(−28Ωr + 28ΩK + 123r2 β + 36)\n+10β(−11Ωr + 11ΩK + 21r2 β − 3) + 3r14 r2 (9α2 − 30α(4β + 1) + 2(2 − 9β)2 ) + 3r16 r2 (3α − 4β + 2)2\n+3r15 r2 (9α − 9β + 2)(3α − 4β + 2))] ,\n(153)\n′\n= Ωr (−4 − 2H /H) ,\n(154)\n= ΩK (−2 − 2H ′ /H) ,\n(155)\n\nr1′ =\n\nr2′\n\nΩ′r\nΩ′K\n\n5\n\nIn this case the only solution in the Minkowski background (H = 0) corresponds to φ̇ = 0 for c2 6= 0.\n\n\f24\nwhere a prime represents a derivative with respect to N = ln a, and\n∆ ≡ 2r14 r2 [72α2 + 30α(1 − 5β) + (2 − 9β)2 ] + 4r12 [9r2 (5α2 + 9αβ + (2 − 9β)β) + 2(9α − 9β + 2)]\n\u0001\n+4r13 [−3r2 −2(15α + 1)β + 3α(9α + 2) + 4β 2 − 3α + 4β − 2] − 24r1 α(16r2 β + 3) + 10β(21r2 β + 8) . (156)\n\nThe Hubble parameter follows from the equation H ′ /H = −5r1′ /(4r1 ) − r2′ /(4r2 ). The solutions to Eqs. (154) and\n(0)\n(0)\n(155) are given by Ωr (N ) = Ωr e−4N H02 /H 2 (N ) and ΩK (N ) = ΩK e−2N H02 /H 2 (N ) respectively, where the subscript\n\"(0)\" represents the values today (N = 0).\nFrom Eqs. (152) and (153) we find that there are three distinct fixed points: (A) (r1 , r2 ) = (0, 0), (B) (r1 , r2 ) = (1, 0),\nand (C) (r1 , r2 ) = (1, 1). As we have already mentioned, the point (C) corresponds to the de Sitter solution. By\nconsidering homogeneous perturbations about this point, we can show that the de Sitter solution (C) is always\nclassically stable [98]. The point (B) is a tracker solution found in Ref. [97], along which the field velocity evolves\nas φ̇ ∝ 1/H. During the radiation and matter eras the variable r2 is much smaller than 1. The fixed point (B) is\nfollowed by the stable de Sitter point (C) once r2 grows to the order of 1. If the initial conditions of both r1 and r2\nin the radiation era are much smaller than 1, then the solutions are close to the point (A) at the initial stage. At\nlate times the solutions approach the tracker at r1 = 1. Depending on the initial values of r1 , the epoch at which\nthe solutions reach the tracker is different. In the following we consider the background evolution in two regimes: (i)\nr1 = 1 and (ii) r1 ≪ 1 in more detail.\n1.\n\nTracker solution (r1 = 1)\n\nAlong the tracker (r1 = 1) the dark energy density parameter (151) is given by\nΩDE = r2 ,\n\n(157)\n\nwhich is much smaller than 1 during the radiation and matter eras. From Eqs. (154) and (155) we obtain r2′ /r2 =\n8 + 2Ω′r /Ωr . This is integrated to give\nr2 = d1 a8 Ω2r ,\n\n(158)\n\nwhere d1 is a constant. From Eqs. (153) and (154) we have Ω′K /ΩK − Ω′r /Ωr = 2, which is integrated to give\nΩK\n= d2 a2 ,\nΩr\n\n(0)\n\nwith\n\nd2 =\n\nΩK\n\n(0)\n\nΩr\n\n.\n\nSubstituting Eqs. (158) and (159) into Eq. (154), we obtain the cosmologically viable solution to Ωr , as\np\n−1 + d3 a − d2 a2 + 4d1 a8 + (−1 + d3 a − d2 a2 )2\nΩr =\n,\n2d1 a8\n\n(159)\n\n(160)\n\nwhere d3 is another constant. Since the density parameter (160) evolves as Ωr ≃ 1 + d3 a in the early time (a ≪ 1),\nthis demands the condition d3 < 0 (provided ΩDE > 0). Using the density parameters today, the constants d1 and\n(0)\n(0)\n(0)\n(0)\n(0)\n(0)\nd3 can be expressed as d1 = [1 − Ωm − Ωr − ΩK ]/(Ωr )2 and d3 = −Ωm /Ωr . Since Ωr ∝ ρr /H 2 ∝ 1/(a4 H 2 ),\n(0)\nwe have H 2 /H02 = (Ωr /Ωr )(1/a4 ). Using Eq. (160), the Hubble parameter can be expressed in terms of the redshift\nz = 1/a − 1:\n\u0012\n\nH(z)\nH0\n\n\u00132\n\n=\n\n1\n1 (0)\n1\nΩ (1 + z)2 + Ω(0)\n(1 + z)3 + Ω(0)\n(1 + z)4\n2 K\n2 m\n2 r\nr\ni2\n(1 + z)4 h (0)\n(0)\n(0)\n(0)\n(0)\n(0)\nΩK + Ωm (1 + z) + Ωr (1 + z)2 ,\n+ 1 − Ωm − Ωr − ΩK +\n4\n\n(161)\n\nwhich is useful to test the viability of the tracker solution from observations.\nOn the tracker, the equations of state defined in Eq. (147) are given by\nwDE = −\n\nΩr − ΩK + 6\n,\n3(r2 + 1)\n\nweff =\n\nΩr − ΩK − 6r2\n.\n3(r2 + 1)\n\n(162)\n\n\f25\n0.0\n\n(a)\n(b)\n(c)\n(d)\n(e)\n\nwDE\n\n-0.50\n\n-1.0\n\n-1.5\n\n-2.0\n\n-2.5\n0\n\n2\n\n4\n\n6\n\n8\n\nlog10 (1+z)\nFigure 4: Evolution of wDE versus z for α = 0.3 and β = 0.14 [cases (a)-(d)] in the flat FLRW Universe (K = 0). We\nchoose four different initial conditions: (a) r1 = 5.000 × 10−11 , r2 = 8.000 × 10−12 , and Ωr = 0.999995 at z = 5.89 × 108 , (b)\nr1 = 1.500 × 10−10 , r2 = 2.667 × 10−12 , and Ωr = 0.999992 at z = 3.63 × 108 , (c) r1 = 5.000 × 10−9 , r2 = 8.000 × 10−14 , and\nΩr = 0.99995 at z = 6.72 × 107 , (d) r1 = 5.000 × 10−6 , r2 = 8.000 × 10−17 , and Ωr = 0.9986 at z = 2.04 × 106 . The case (e)\ncorresponds to the tracker solution. From Ref. [98].\n\nDuring the cosmological sequence of radiation (Ωr ≃ 1, |ΩK | ≪ 1, r2 ≪ 1), matter (Ωr ≪ 1, |ΩK | ≪ 1, r2 ≪ 1), and\nde Sitter (Ωr ≪ 1, |ΩK | ≪ 1, r2 = 1) eras, the dark energy equation of state evolves as wDE = −7/3 → −2 → −1,\nwhereas the effective equation of state evolves as weff = 1/3 → 0 → −1. This peculiar evolution of wDE for the tracker\ncorresponds to the case (e) in Fig. 4. Although the effect of the cosmic curvature does not affect the dynamics of wDE\nsignificantly, it can change the diameter distance as well as the luminosity distance relative to the flat Universe.\nThe epoch at which the solutions reach the tracking regime r1 ≃ 1 depends on model parameters and initial\nconditions. The approach to this regime occurs later for smaller initial values of r1 , see Fig. 4. In Ref. [98] it was\nshown that the tracker is stable in the direction of r1 by considering a homogeneous perturbation δr1 . This means\nthat once the solutions reach the tracker the variable r1 does not repel away from 1. If r1 . 2 initially, numerical\nsimulations show that the solutions approach the tracker with the late-time cosmic acceleration. Meanwhile, for the\ninitial conditions with r1 & 2, the dominant contribution to ΩDE comes from the Lagrangian L2 , so that the field\nenergy density decreases rapidly as in the standard massless scalar field.\n2.\n\nSolutions in the regime r1 ≪ 1\n\nThere is another case in which the solutions start to evolve from the regime r1 ≪ 1 (where the term L5 gives the\ndominant contribution to the field dynamics). In this regime, the variables r1 and r2 satisfy the following approximate\nequations\nr1′ ≃\n\n9 + Ωr − ΩK + 21βr2\nr1 ,\n8 + 21βr2\n\nr2′ ≃\n\n3 + 11Ωr − 11ΩK − 21βr2\nr2 .\n8 + 21βr2\n\n(163)\n\nAs long as {βr2 , |ΩK |} ≪ 1, the evolution of r1 and r2 during the radiation (matter) era is given by r1 ∝ a5/4 and\nr2 ∝ a7/4 (r1 ∝ a9/8 and r2 ∝ a3/8 ). Then the field velocity grows as φ̇ ∝ t3/8 during the radiation era and φ̇ ∝ t1/4\nduring the matter era. The evolution of φ̇ is slower than that for the tracker (i.e. φ̇ ∝ t).\nIn the regime r1 ≪ 1 the equations of state are\nwDE ≃ −\n\n1 + Ωr − ΩK\n,\n8 + 21βr2\n\nweff ≃\n\n8Ωr − 8ΩK − 21βr2\n.\n3(8 + 21βr2 )\n\n(164)\n\n\f26\nProvided that {βr2 , |ΩK |} ≪ 1, one has wDE ≃ −1/4, weff ≃ 1/3 during the radiation era and wDE ≃ −1/8, weff ≃ 0\nduring the matter era. This evolution of wDE is quite different from that for the tracker solution.\nIn Fig. 4 the variation of wDE is plotted for a number of different initial conditions with r1 ≪ 1 [which correspond\nto the cases (a)-(d)]. As expected, the solutions start to evolve from the value wDE ≃ −1/4 in the radiation era. For\nlarger initial values of r1 they approach the tracker earlier. This tracking behavior also occurs in the presence of the\ncosmic curvature K [259].\n3.\n\nConditions for the avoidance of ghosts and Laplacian instabilities\n\nLet us find a model parameter space in which the appearance of ghosts and instabilities can be avoided in covariant\nGalileon gravity. In doing so, we need to study a linear perturbation theory on the FLRW background. For simplicity\nwe focus on the flat Universe with K = 0. Let us consider the perturbed metric\nds2 = −[1 + 2Ψ(t, x)] dt2 + ∂i χ(t, x) dt dxi + a2 (t)[1 + 2Φ(t, x)] dx2 ,\n\n(165)\n\nwhere Ψ, Φ, and χ are scalar metric perturbations. We have chosen the gauge δφ = 0 without a non-diagonal scalar\nperturbation in the spatial part of the metric, i.e. ∂ij γ = 0 [181]. Taking into account two perfect fluids with the\nequations of state wi = Pi /ρi (i = 1, 2), there are three propagating scalar degrees of freedom. The velocity potentials\n(i)\n(i)\nvi (i = 1, 2) of perfect fluids are related with the energy-momentum tensor Tj0 , as Tj0 = −(ρi + Pi )∂j vi (i = 1, 2).\n~ = (v1 , v2 , Φ) and expanding the action (140) up to the second-order, we obtain the\nIntroducing the vector Q\nsecond-order action for scalar perturbations [98] (see also Refs. [183, 260, 261]):\n\u0014\n\u0015\nZ\n1 ~t\n1\n ̇t ~\n(2)\nt\n3\n3 ~ ̇ t ~ ̇\n~\n~\n~\n~\n(166)\ndt d x a Q AQ − 2 ∇Q C ∇Q − Q B Q − Q D Q ,\nδSS =\n2\na\nwhere the fields Ψ and χ are integrated out. A, C and D are 3 × 3 symmetric matrices and B is an antisymmetric\nmatrix (for which we do not write explicit forms).\nIn order to avoid the appearance of ghosts we require that the matrix A is positive definite. This corresponds to\nthe conditions (1 + w1 )ρ1 /w1 > 0, (1 + w2 )ρ2 /w2 > 0, and\nQS\n6(1 + μ1 )(μ1 + μ2 + μ1 μ2 − 2μ3 − μ23 )\n> 0,\n≡\n−\n2\nMpl\n(1 + μ3 )2\n\n(167)\n\nwhere\nμ1 ≡ 3αr1 r2 /2 − 3βr2 ,\nμ2 ≡ (3α − 4β + 2)r13 r2 /2 − 2(9α − 9β + 2)r12 r2 + 45αr1 r2 /2 − 28βr2 ,\nμ3 ≡ −(9α − 9β + 2)r12 r2 /2 + 15αr1 r2 /2 − 21βr2 /2 .\n\n(168)\n(169)\n(170)\n\nThe propagation speeds cS of three scalar degrees of freedom are known by solving the equation\ndet(c2S A − C) = 0 .\n\n(171)\n\nFor the two perfect fluids we have c2S = w1 and c2S = w2 , which are are positive for both radiation and non-relativistic\nmatter. The third stability condition associated with another scalar degree of freedom is given by\nc2S ≡\n\n(1 + μ1 )2 [2μ′3 − (1 + μ3 )(5 + 3weff ) + 4Ωr + 3Ωm ] − 4μ′1 (1 + μ1 )(1 + μ2 ) + 2(1 + μ3 )2 (1 + μ4 )\n> 0,\n6(1 + μ1 )(μ1 + μ2 + μ1 μ2 − 2μ3 − μ23 )\n\n(172)\n\nμ4 ≡ −αr1 r2 /2 − 3βr2 (r1′ /r1 + r2′ /r2 )/4 .\n\n(173)\n\nwhere\n\nLet us consider tensor perturbations with δgij = a2 hij , where hij is traceless (hi i = 0) and divergence-free (hij ,j =\n⊗\n0). We expand the action (140) at second-order in terms of the two polarization modes, hij = h⊕ ǫ⊕\nij + h⊗ ǫij , where\n⊗\nǫ⊕\nij and ǫij are the polarization tensors. For the polarization mode h⊕ , the second-order action is given by\n\u0015\n\u0014\nZ\nc2T\n1\n(2)\n2\n2\n3\n3\n(174)\ndt d x a QT ḣ⊕ − 2 (∇h⊕ ) .\nδST =\n2\na\n\n\f27\n\n¢\n\nΑ\n\n1\n\n0\n\nΑ = 12 Β1\u00902 -9 Β - 2, cT 2 = 0 at IcT 2M = 0\n2\nΑ = 2 Β + , HQSLr1=1 = 0\n3\n\n-1\n\nΑ = 2 Β, IcS2MdS = 0\nΑ=\n\n-2\n-1.0\n\n12\n\n10\nΒ - , IcS2Mr =1,W =1 = 0\nr\n1\n13 13\n0.0\n\n-0.5\n\n0.5\n\nΒ\nFigure 5: The viable parameter region (blue colored region) along the tracker solution (r1 = 1) in the covariant Galileon model\n(where r2 > 0). If the solutions start from the regime r1 ≪ 1, we also require that β > 0. From Ref. [97].\n\nThe conditions for the avoidance of ghosts and Laplacian instabilities of tensor perturbations correspond, respectively,\nto\nQT\n1 3\n3\n(175)\n2 ≡ 2 + 4 αr1 r2 − 2 βr2 > 0 ,\nMpl\nc2T ≡\n\n2r1 (2 − αr1 r2 ) − 3β(r2 r1′ + r1 r2′ )\n> 0.\n2r1 (2 + 3αr1 r2 − 6βr2 )\n\n(176)\n\nThe same conditions also follow from h⊗ .\n2\nIn the regime r1 ≪ 1 and r2 ≪ 1 one has QS /Mpl\n≃ 60βr2 and QT ≃ 1/2. For the initial conditions with r2 > 0\nwe require that β > 0 to avoid the scalar ghost. Since c2S ≃ (1 + Ωr )/40 and c2T ≃ 1 + 3βr2 (5 − 3Ωr )/8 ≃ 1, there are\nno Laplacian instabilities of scalar and tensor perturbations in this regime.\nIn the tracking regime characterized by r1 = 1 (either r2 ≪ 1 or r2 = 1), the conditions (167), (172), (175), and\n(176) give the bounds on the parameters α and β. In the regime r2 ≪ 1 these conditions translate to\nQS ≃ 3(2 − 3α + 6β)r2 > 0 ,\n8 + 10α − 9β + Ωr (2 + 3α − 3β)\nc2S ≃\n> 0.\n3(2 − 3α + 6β)\n\n(177)\n(178)\n\nFor the branch r2 > 0 the first condition reduces to 2 − 3α + 6β > 0. Since c2T ≃ 1 − r2 (4α + 3β + 3βΩr )/2 ≃ 1 and\n2\nQT /Mpl\n= 1/2 + 3(α − 2β)r2 /4 > 0, the tensor modes do not provide additional constraints. At the de Sitter point\n(r2 = 1) we require that\n4 − 9(α − 2β)2\nQS\n> 0,\n=\n2\nMpl\n3(α − 2β)2\nc2S =\n\nQT\n1\n= (2 + 3α − 6β) > 0 ,\n2\nMpl\n4\n\n(α − 2β)(4 + 15α2 − 48αβ + 36β 2 )\n> 0,\n2[4 − 9(α − 2β)2 ]\n\nc2T =\n\n2−α\n> 0.\n2 + 3α − 6β\n\n(179)\n(180)\n\nIf β > 0, it can happen that c2T has a minimum during the transition from the regime r2 ≪ 1 to r2 ≃ 1 [97, 98].\nThis value tends to decrease as β approaches 1. Imposing that c2T > 0 at the minimum, we obtain the bound\np\n(181)\nα < 12 β − 9β − 2 .\n\nIn Fig. 5 we plot the parameter space in the (α, β) plane constrained by the conditions (177)-(181). Clearly there are\nviable model parameters satisfying all the theoretical constraints.\n\n\f28\n4.\n\nObservational constraints on Galileon cosmology from the background cosmic expansion history\n\nSince the evolution of the dark energy equation of state in covariant Galileon gravity is rather peculiar, the observational data related with the background cosmic expansion history may place tight constraints on the model.\nEspecially the analytic formula (161) for the tracker is useful for such a purpose. In Ref. [259] the authors confronted\nthe Galileon model by using the observational data of SN Ia (Constitution [262] and Union2 sets [263]), the CMB\n(WMAP7) shift parameters [4], and BAO (SDSS7) [6].\nIf either of the SN Ia data (Constitution or Union2) is used in the data analysis, the χ2 for the tracker is similar\nto that in the ΛCDM model. In the presence of the cosmic curvature K, the tracker solution is compatible with\nthe individual observational bound constrained from either CMB or BAO. However, the combined data analysis of\nConstitution+BAO+CMB shows that the difference of χ2 between the tracker and the ΛCDM is δχ2 ∼ 22 (or ∼ 4.3σ).\nThis means that the tracker is severely disfavored with respect to the ΛCDM. A similar conclusion was reached from\nthe combined data analysis of Union2+BAO+CMB. The reason for this incompatibility is that the SN Ia data favor\n(0)\n(0)\nthe large values of Ωm (& 0.32), whereas the CMB and BAO data constrain smaller values of Ωm (. 0.27).\nThe general solutions starting from the regime r1 ≪ 1 finally approach the tracker as r1 grows to 1. In Ref. [259]\nthe authors carried out the likelihood analysis for such general solutions and found that the solutions approaching the\ntracker at late times (such as the case (a) in Fig. 4) are favored from the combined data analysis. In the flat FLRW\nbackground the best-fit model parameters are α = 1.411 ± 0.056, β = 0.422 ± 0.022 (Constitution+CMB+BAO, 68 %\nCL), and α = 1.404 ± 0.057, β = 0.419 ± 0.023 (Union2+CMB+BAO, 68 % CL).\n(0)\nFor several fixed values of ΩK it was shown that the late-time tracking solutions can be consistent with the data,\n(0)\n(0)\napart from the models with largely negative ΩK such as ΩK . −0.01. For example, the general solutions with\n(0)\nΩK = 0.01 and the model parameters (α, β) = (1.862, 0.607) give the similar value of χ2 to that in the the ΛCDM.\nIn this case the Akaike-Information-Criteiron (AIC) statistics [264] also have the same support for the two models\n(see also Ref. [265])\nThe Bayesian-Information-Criterion (BIC) statistics [266] show that the general solutions, with all 4 parameters\n(0)\n(0)\n(α, β, Ωm , ΩK ) are varied, are not particularly favored over the ΛCDM model. This mainly comes from the statistical\nproperty that the numbers of model parameters are larger than those in the flat ΛCDM. In fact the late-time tracking\nsolutions with a non-zero cosmic curvature can be well consistent with the combined data analysis at the background\nlevel.\nB.\n\nGeneralized Galileon gravity\n\nIn Sec. III we showed that in Brans-Dicke theory with the coupling Q of the order of unity the presence of the field\npotential allows a possibility for the consistency with local gravity constraints through the chameleon mechanism.\nAnother way to recover the General Relativistic behavior in the regions of high density is to introduce the Galileon-like\nfield self-interaction. Silva and Koyama [238] studied Brans-Dicke theory in the presence of the term ξ(φ)\u0003φ(∂μ φ∂ μ φ)\n[which is the generalization of the term L3 = \u0003φ(∂μ φ∂ μ φ)]. The action of this theory is given by\n\u0014\n\u0015 Z\nZ\n1\nωBD\n4 √\n2\nμ\nS = d x −g φR −\n(∇φ) + ξ(φ)\u0003φ(∂μ φ∂ φ) + d4 x LM .\n(182)\n2\n2φ\nIf ξ(φ) ∝ φ−2 , there exists a de Sitter solution that can be responsible for the late-time acceleration. As in the Galileon\nmodel discussed in Sec. V A the field is nearly frozen during the radiation and matter eras through the cosmological\nVainshtein mechanism, but it finally approaches the de Sitter solution characterized by φ̇ = constant. Moreover, as in\nthe DGP model, the Vainshtein radius can be much larger than the solar system scale, so that the General Relativistic\nbehavior can be recovered in the local region [238].\nWe may consider more general theories described by the action [242]\n\u0015 Z\n\u0014\nZ\n√\n1\n(183)\nS = d4 x −g F (φ)R + B(φ)X + ξ(φ)\u0003φ(∂ μ φ∂μ φ) + d4 xLM ,\n2\nwhere X = −g μν ∂μ φ∂ν φ/2, and F (φ), B(φ), ξ(φ) are functions of φ. From the requirement of having de Sitter\nsolutions responsible for dark energy, it is possible to restrict the functional forms of F (φ), B(φ), and ξ(φ). In the\npresence of non-relativistic matter (energy density ρm ) and radiation (energy density ρr ), the field equations are given\n\n\f29\nby\n\u0012\n\u0013\nBφ2 2 φF,φ\nφξ,φ\nρr\n2ξφ3 2 3\nρm\n+\n,\n(184)\nx −\nx+\nH x 1−\nx +\n2\n6F\nF\nF\n6ξ\n3F H\n3F H 2\n! \u0014\n\u0013\n\u0012\n\u0012\n\u0013\u0015\nφξ,φ\nḢ\n2ξφ3 2 2\nẋ\nF,φφ φ2\nφF,φ\n6ξφ3 2 2\nφF,φ\nBφ2\nḢ\n2\n−\nH x\n+x 2 +x +\nx+\nx−\n+\nH x 1−\nx x\n−2 2 =\nH\nF\nF\nH\nH\nF\nF\nF\nF\n3ξ\n1=\n\n+\n\nρm\n4ρr\n+\n,\nF H2\n3F H 2\n\n(185)\n\nwhere x ≡ φ̇/(Hφ). Let us search for de Sitter solutions at which H and x are constants. If F (φ) and ξ(φ) are\npower-law functions of φ, the quantities such as φF,φ /F , F,φφ φ2 /F , and φξ,φ /ξ remain constants. Provided that\nB/F ∝ φ−2 and ξ/F ∝ φ−3 , we can solve Eqs. (184) and (185) for x and H at the de Sitter point. These conditions\nare satisfied for the following functions\n2\nF (φ) = Mpl\n(φ/Mpl )3−n ,\n\nB(φ) = ω(φ/Mpl )1−n ,\n\nξ(φ) = (λ/μ3 )(φ/Mpl )−n ,\n\n(186)\n\nwhere Mpl ≃ 1018 GeV is the reduced Planck mass, μ (> 0) is a constant having a dimension of mass, and ω and λ are\ndimensionless constants. One can show that the coupling λ must be positive for the consistency of theories [242]. The\nBrans-Dicke theory described by the action (182) corresponds to n = 2 with the Brans-Dicke parameter ωBD = ω.\nSince F (φ) is constant for n = 3, the theory with n = 3 corresponds to k-essence minimally coupled gravity.\nFrom Eqs. (184) and (185) we obtain the following algebraic equations at the de Sitter fixed point:\nω = −\nλ =\n\nn(n − 3)2 x3dS + (n − 3)(n − 12)x2dS − 6(n − 5)xdS + 18\n,\nx2dS (xdS + 3)\n\nμ3 [(n − 3)xdS − 2][(n − 3)xdS − 3]\n,\n2\nMpl HdS\n2x3dS (xdS + 3)\n\n(187)\n(188)\n\nwhere xdS and HdS are the values of x and H at the de Sitter point, respectively. We fix the mass scale μ to be\n2 1/3\nμ = (Mpl HdS\n) , where we have used HdS ≃ 10−60 Mpl . For given ω and n, the quantity xdS is determined by solving\nEq. (187). Then the dimensionless constant λ is known from Eq. (188).\nIn order to recover the General Relativistic behavior in the early cosmological epoch we require that the field initial\nvalue φi is close to Mpl from Eq. (186). The quantity x is much smaller than 1 in the early cosmological epoch, so that\nthe field is nearly frozen during the radiation and matter eras. The field starts to evolve at the late cosmological epoch\n2\nin which x grows to the order of unity. Introducing the dimensionless quantities y ≡ λx2 H 2 /HdS\nand Ωr ≡ ρr /(3F H 2 ),\none can show that the fixed point corresponding to the matter era corresponds to (x, y, Ωr ) = (0, (3 − n)/6, 0) [242].\nSince y is positive definite, it follows that n ≤ 3.\nThe conditions for the avoidance of ghosts and Laplacian instabilities are known by employing the method presented\nin Sec. V A 3. Provided F (φ) > 0, we require that x > 0 to avoid ghosts during the cosmological evolution from the\nradiation era to the epoch of cosmic acceleration [242]. The stability of the de Sitter point is automatically ensured\nfor n ≤ 3 and xdS > 0. From Eq. (187) the parameter ω is restricted in the range\nω < −n(n − 3)2 .\n\n(189)\n\nThe field propagation speed squared during the radiation and matter eras is given by c2S ≃ 6/5 and c2S ≃ 2/3,\nrespectively in which case no instabilities of linear perturbations are present. Meanwhile, at the de Sitter solution,\nwe have [242]\nc2s = −\n\n(n − 2)[(n − 3)(n − 4)x2dS − 8(n − 3)xdS + 6]xdS\n,\n(n − 3)(3n2 − 10n + 12)x3dS + 12(n − 5)x2dS + 18(n − 8)xdS − 108\n\n(190)\n\nwhich is positive for n ≥ 2. Hence the parameter n is restricted in the range\n2 ≤ n ≤ 3,\n\n(191)\n\nwhich includes Brans-Dicke theory with the action (182) as a specific case (n = 2).\nIn Ref. [239] the authors studied the evolution of matter density perturbations and showed that, for the model with\nn = 2, there is an anti-correlation between the cross-correlation of large scale structure and the integrated Sachs-Wolfe\neffect in CMB anisotropies. We shall discuss the main reason of this anti-correlation in Sec. VII D. This property will\nbe useful to distinguish the above model from the ΛCDM in future observations.\n\n\f30\nVI.\n\nOTHER MODIFIED GRAVITY MODELS OF DARK ENERGY\n\nIn this section we briefly discuss other classes of modified gravity models of dark energy. These include (i) GaussBonnet gravity with a scalar coupling f (φ)G, (ii) R/2 + f (G) gravity, and (iii) Lorentz-violating models.\nA.\n\nGauss-Bonnet gravity with a scalar coupling\n\nIn addition to the Ricci scalar R, we can construct other scalar quantities coming from the Ricci tensor Rμν and\nthe Riemann tensor Rμναβ , i.e. P ≡ Rμν Rμν and Q ≡ Rμναβ Rμναβ [267]. It is possible to avoid the appearance of\nspurious spin-2 ghosts by taking a Gauss-Bonnet (GB) combination [268, 269, 271], defined by\nG ≡ R2 − 4Rμν Rμν + Rμναβ Rμναβ .\nA simple model that can be responsible for the cosmic acceleration today is [43]\n\u0015 Z\n\u0014\nZ\n√\n1\n1\nS = d4 x −g R − (∇φ)2 − V (φ) − f (φ)G + d4 x LM ,\n2\n2\n\n(192)\n\n(193)\n\nwhere V (φ) and f (φ) are functions of a scalar field φ. The coupling of the field with the GB term appears in lowenergy effective string theory [270]. For the exponential potential V (φ) = V0 e−λφ and the coupling f (φ) = (f0 /μ)eμφ ,\nthe cosmological dynamics were studied in Refs. [43, 282–287]. In this model there exists a de Sitter solution due to\nthe presence of the GB term. In Refs. [282, 283] it was also found that the late-time de-Sitter solution is preceded by\na scaling matter era.\nKoivisto and Mota [282] placed observational constraints on the model (193) with the exponential potential V (φ) =\nV0 e−λφ , by using the Gold data set of SN Ia together with the CMB shift parameter data of WMAP. The parameter\nλ is constrained to be 3.5 < λ < 4.5 at the 95% confidence level. In Ref. [284], they also included the constraints\ncoming from the BAO, LSS, big bang nucleosynthesis, and solar system data. This joint analysis showed that the\nmodel is strongly disfavored by the data. In Ref. [283] it was also found that tensor perturbations are subject to\nnegative instabilities when the GB term dominates the dynamics (see also Refs. [288, 289] for related works).\nAmendola et al. [290] studied local gravity constraints on the above model and showed that the density parameter\nΩGB coming from the GB term is required to be strongly suppressed for the compatibility with solar-system experiments (which is typically of the order of ΩGB < 10−30 ). The above discussion indicates that the GB term with the\nscalar-field coupling f (φ)G can hardly be the source for dark energy.\nB.\n\nR/2 + f (G) gravity\n\nThe general Lagrangian including the scalar quantities constructed from the Ricci scalar R, the Ricci tensor Rμν\nand the Riemann tensor Rμναβ is given by L = f (R, P, Q). The dark energy models based on these theories have been\nstudied in Refs. [272–279]. In order to avoid spurious spin-2 ghosts we need to choose the GB combination (192), i.e.\nL = f (R, Q − 4P ) [280, 281].\nThe cosmological dynamics based on the action,\n\u0014\n\u0015 Z\nZ\n1\n4 √\n(194)\nS = d x −g R + f (G) + d4 x LM ,\n2\nhave been studied by a number of authors [44, 291–296]. In order to ensure the stability of radiation/matter solutions,\nwe need to satisfy the condition f,GG > 0 for all G. We also require the regularities of the functions f , f,G , and\nf,GG [293]. There exists a de Sitter solution responsible for dark energy, whose stability requires the condition\n0 < HdS f,GG (HdS ) < 1/384. Moreover f,GG must approach +0 in the limit |G| → ∞.\nIn Ref. [293] the authors proposed a number of f (G) models satisfying these conditions (see also Ref. [294]). One\nof such models is given by\n\u0012 \u0013\np\nG\nG\nf (G) = λ √ arctan\n− αλ G∗ ,\n(195)\nG∗\nG∗\n\nwhere α, λ and G∗ are constants. The numerical simulation of Ref. [293] shows that the model (195) is cosmologically\nviable at least at the background level. Moreover it can be consistent with solar-system constraints for a wide range\nof model parameters [297].\n\n\f31\nIn order to study the viability of the theories described by the action (194) further, let us consider the evolution of\nmatter density perturbations in the presence of a perfect fluid with the barotropic equation of state wM = PM /ρM .\nIn Ref. [298] it was shown that, for small scales (i.e. for large momenta k), there are two different scalar propagation\nspeeds. One of them corresponds to the mode for the fluid, i.e. c21 = wM , whereas another is given by\nc22 = 1 +\n\n2Ḣ\n1 + wM κ2 ρM\n+\n,\n2\nH\n1 + 4μ 3H 2\n\n(196)\n\nμ = H Ġf,GG .\n\n(197)\n\nwhere\n\nThe parameter μ characterizes the deviation from the ΛCDM model (note that the linear term f = c G does not give\nrise to any contribution to the field equation). For viable f (G) models we have |μ| ≪ 1 at high redshifts [293]. Since the\nbackground evolution during the radiation/matter domination is given by 3H 2 ≃ κ2 ρM and Ḣ/H 2 ≃ −(3/2)(1+wM ),\nit follows that\nc22 ≃ −1 − 2wM .\n\n(198)\n\nThe Laplacian instability at small scales is absent only for wM < −1/2. Since wM = 1/3 and wM = 0 during the\nradiation and matter eras, respectively, the perturbations with large momentum modes are unstable. This leads to\nviolent growth of matter density perturbations incompatible with the observations of large-scale structure [292, 298].\nBy considering the full perturbation equations, one can show that the onset of the negative instability corresponds\nto [298]\nμ ≈ (aH/k)2 .\n\n(199)\n\nEven when μ is much smaller than 1, we can always find a wave number k (≫ aH) satisfying the condition (199).\nFor the scales smaller than that determined by the wave number in Eq. (199), the linear perturbation theory breaks\ndown. Hence the background solutions cannot be trusted for those scales, which makes the theory unpredictable. The\nLaplacian instability can be avoided only for μ = 0, which corresponds to the ΛCDM model. The above property\npersists irrespective of the forms of f (G).\nFor more general theories described by the Lagrangian density f (R, G) it is possible to avoid such Laplacian\ninstabilities [299], depending on the models [300] (see also Refs. [301–304]). It may be of interest to construct some\nviable dark energy models in such theories.\nC.\n\nLorentz violating models\n\nThe modified gravity models such as f (R) gravity and Galileon gravity can give rise to the phantom dark energy\nequation of state wDE < −1 without violating the conditions for the appearance of ghosts and instabilities. In the\nmodels with a broken Lorentz invariance it is also possible to realize wDE < −1 without pathological behavior in the\nUltra-Violet (UV) region [305–307] (see also Ref. [308] for a review). In order to construct Lorentz violating models\nwithout pathological behavior of phantoms, one may start with a field theory consistent at energy scales from zero\nto the UV cutoff scale M and then deform the theory in the Infra-Red (IR) in such a way that its behavior at high\nenergies remains healthy. Although the weak energy condition is violated in the homogenous background, pathological\nstates are present below a certain low scale ǫ only. Provided that ǫ is close to the Hubble scale, a theory of this sort\nshould be acceptable.\nLet us consider a Lorentz violating model with two-derivative kinetic terms with healthy behavior below the scale\nM [309] plus one-derivative term suppressed by the small parameter ǫ [310]. The model has a vector field Bμ and a\nscalar field Φ with a potential V (B, Φ). The Lagrangian is given by [306, 307]\nL = L(2) + L(1) + L(0) + LM ,\n\n(200)\n\nL(2)\n\n(201)\n\nL(1)\n\n1\nBν Bλ\n1\n1\n= − α(Ξ)g νλ Dμ Bν Dμ Bλ + β(Ξ)Dμ Bν Dμ Bλ\n+ ∂μ Φ∂ μ Φ ,\n2\n2\n2\nM\n2\n= ǫ∂μ ΦB μ ,\nL(0) = −V (B, Φ) ,\n\n(202)\n\nwhere Ξ = Bμ B μ /M2 (M is the UV cut-off scale). The dimensionless parameters α and β are the functions of Ξ,\nand ǫ is a free positive parameter that characterizes an IR scale. The Lorentz invariance is broken for Ξ 6= 0.\n\n\f32\n1.5\n\nWm\n\nWr\n\n1.0\n\nWDE\n\nweff\n\n0.50\n\n0.0\n\n-0.50\n\nw\n\n-1.0\n\n-1.5\n0\n\n5\n\n10\n\n15\n\nln a\nFigure 6: Evolution of wDE (denoted as w in the figures) and weff = 1 − 2Ḣ/(3H 2 ) together with the density parameters\nof dark energy (ΩDE ), non-relativistic matter (Ωm ), and radiation (Ωr ) for the Lorentz-violating model (200) with V =\nm2 φ2 /2 − M 2 X 2 /2. The model parameters are chosen to be α = 1, γ = 1/2, ǫ/m√= 3 and M/m = 1 with the initial conditions\nX = Ẋ = φ̇ = 0, φ = 0.5φA , and Ωr = 0.99, Ωm = 0.01 [where φA = M mpl /( 4παm)]. The present epoch corresponds to\nΩm = 0.3 and ΩDE = 0.7, which is denoted by a vertical line. After the cosmological constant boundary crossing, wDE reaches\na minimum −1.19 and then it increases toward the de Sitter value −1 from the phantom side. From Ref. [307].\n\nIn spatially homogeneous background we have\nB0 = X ,\n\nBi = 0 ,\n\nΦ = φ,\n\n(203)\n\nwhere B0 and Bi are time and space components of Bμ . In the flat FLRW background with non-relativistic matter\nand radiation for the matter Lagrangian LM , we obtain the following equations of motion\n\u0015\n\u0014\n3α 2 2 1 2\n8πG 1\n2\n2\n(204)\nγ Ẋ −\nH X + φ̇ + W (φ) + U (X) + ρm + ρr ,\nH =\n3\n2\n2\n2\n\u0010\n\u0011 1\n3\n(205)\nγ Ẍ + 3H Ẋ + γ,X Ẋ 2 + α,X H 2 X 2 + 3αH 2 X − ǫφ̇ + V,X = 0 ,\n2\n2\nφ̈ + 3H φ̇ + ǫ(Ẋ + 3HX) + V,φ = 0 ,\n(206)\nwhere γ(X) = X 2 β(X)/M2 − α(X).\nFor the separable potential V = m2 φ2 /2−M 2 X 2 /2 with constant X the cosmological dynamics of the above system\nhave been\np studied in detail in Refs. [306, 307]. In what follows we assume that\n√ both α and γ are constants. Provided\nǫ/m > 2α/3 one can show that there is a de Sitter solution with H = M/ 3α, at which φ and X are frozen. In the\nearly cosmological epoch the field X is close to 0, whereas the field φ slowly rolls down its potential (with the energy\ndensity dominating over that of X).\nPrior to\n√ the epoch of de Sitter cosmic acceleration there is a transient phantom regime (wDE < −1) characterized by\nH < M/ 3α in which\nthe field φ rolls up its potential. The Hubble parameter slowly increases toward the de Sitter\n√\nvalue HdS = M/ 3α. In Fig. 6 we plot the evolution of the dark energy equation of state wDE = PDE /ρDE and the\neffective equation of state weff = 1 − 2Ḣ/(3H 2 ) together with the density parameters of dark energy, non-relativistic\nmatter, and radiation6 . Clearly the solution undergoes the period with wDE < −1 before reaching the de Sitter\nattractor.\n\n6\n\nHere the definition of ρDE and PDE is ρDE = γ Ẋ 2 /2 + φ̇2 /2 + V − 3αH 2 X 2 /2 and PDE = γ Ẋ 2 /2 + φ̇2 /2 − V + ǫφ̇X + αḢX 2 +\n2αHX Ẋ + 3αH 2 X 2 /2.\n\n\f33\nThe phantom equation of state can be realized without having ghosts, tachyons or superluminal modes in the\nUV region. In\npthe IR region characterized by p . ǫ, either tachyons or ghosts appear for the spatial momenta p\nsmaller than (ǫ2 − M 2 )/α − m2 [306, 307]. The presence of tachyons at IR scales leads to the amplification of\nlarge-scale field perturbations whose wavelengths are roughly comparable to the present Hubble radius. There are\ntwo tachyonic regions of spatial momenta in this model: (a) one is sub-horizon and its momenta are characterized by\nM 2 /γ < p2 < (ǫ2 − M 2 )/α − m2 ; (b) another is super-horizon with the momenta 0 < p2 < m2 M 2 /ǫ2 . In the region\n(a) there is a parameter space in which the perturbations always remain smaller than the homogenous fields. In the\nregion (b) the growth of the perturbations is suppressed by the factor m2 /ǫ2 .\nThere are other classes of Lorentz violating models such as ghost condensate [305] and Horava-Lifshitz gravity [311]\n(see also Refs. [312]-[317]). The application of such scenarios to dark energy has been studied by a number of authors,\nsee e.g., [318–320]. It remains to to see whether such Lorentz-violating models can be observationally distinguished\nfrom other dark energy models.\nVII.\n\nOBSERVATIONAL SIGNATURES OF MODIFIED GRAVITY\n\nIn order to confront modified gravity models with the observations of large-scale structure and CMB, we discuss\nthe evolution of density perturbations in four modified gravity models: (i) f (R) gravity, (ii) scalar-tensor gravity,\n(iii) DGP braneworld model, and (iv) Galileon gravity. We also discuss observables to confront with weak lensing\nobservations.\nA.\n\nf (R) gravity\n\nLet us first consider metric f (R) gravity in the presence of non-relativistic matter. We take the following perturbed\nmetric in a longitudinal gauge about the flat FLRW background with scalar metric perturbations Φ and Ψ [181]\nds2 = −(1 + 2Ψ)dt2 + a2 (1 + 2Φ)δij dxi dxj .\n\n(207)\n\nThe energy momentum tensors of a non-relativistic perfect fluid are decomposed into background and perturbed parts,\nas T00 = −(ρm + δρm ) and Tα0 = −ρm vm,α (vm is a velocity potential).\nThe equations for matter perturbations, in the Fourier space, are given by [321–323]\ni\nh\n(208)\nδ ρ̇m + 3Hδρm = −ρm 3Φ̇ + (k 2 /a)vm ,\nv̇m + Hvm = Ψ/a ,\n\n(209)\n\nwhere k is a comoving wave number. We define the gauge-invariant matter density perturbation δm , as\nδm ≡ δρm /ρm + 3Hv ,\n\nwhere\n\nv ≡ avm .\n\n(210)\n\nThen Eqs. (208) and (209) yield\nδ̇m = −(k 2 /a2 )v − 3(Φ − Hv)* ,\nv̇ = Ψ ,\n\n(211)\n(212)\n\nfrom which we obtain\nδ̈m + 2H δ̇m + (k 2 /a2 )Ψ = 3B̈ + 6H Ḃ ,\n\n(213)\n\nwhere B ≡ −Φ + Hv.\nIn f (R) gravity the quantity F (R) = ∂f /∂R has a perturbation δF . In the following we use the unit κ2 = 8πG = 1,\nbut we restore gravitational constant G when it is required. For the action given in Eq. (2), we obtain the linearized\nperturbation equations in Fourier space [324–326]\n\u0015\n\u0014\n\u0012\n\u0013\nk2\nk2\n1\n2\n ̇\n− 2 Φ + 3H(HΨ − Φ̇) =\n(214)\n3H δF − 3Ḣ + 3H − 2 δF − 3H Ḟ Ψ − 3Ḟ (HΨ − Φ̇) − δρm ,\na\n2F\na\n\u0012 2\n\u0013\n ̈ + 3H δF\n ̇ + k + M 2 δF = 1 δρm + Ḟ (3HΨ + Ψ̇ − 3Φ̇) + (2F̈ + 3H Ḟ )Ψ ,\nδF\n(215)\na2\n3\nΨ + Φ = −δF/F .\n(216)\n\n\f34\nIn Eq. (215) we have introduced the mass term\nM2 ≡\n\n1\n3\n\n\u0012\n\nF\nf,RR\n\n−R\n\n\u0013\n\n.\n\n(217)\n\nFor viable dark energy models the condition F/f,RR ≫ R is satisfied during most of the cosmological epoch, so that\nM 2 ≃ F/(3f,RR ) [69, 71]. This is equivalent to the mass squared Ms2 introduced in Eq. (43), which is required to be\npositive to avoid the tachyonic instability.\nFor the observations of large-scale structure and weak lensing we are interested in the modes deep inside the Hubble\nradius (k ≫ aH). In the following we employ the quasi-static approximation under which the dominant terms in\nEqs. (213)-(216) correspond to those including k 2 /a2 , δρm (or δm ) and M 2 [12, 155, 165, 327–329]. We then obtain\nthe following approximate relations from Eqs. (213)-(216) :\nδ̈m + 2H δ̇m + (k 2 /a2 )Ψ = 0 ,\n\u0012 2\n\u0012 2\n\u0013\n\u0013\n1\na\na\n1\nΦ=\nδρm − δF , Ψ = −\nδρm + δF ,\n2F k 2\n2F k 2\n\u0001\n ̈ + 3H δF\n ̇ + k 2 /a2 + M 2 δF = δρm /3 .\nδF\n\n(218)\n(219)\n(220)\n\nThe evolution of perturbations is different depending on whether M 2 is larger or smaller than k 2 /a2 . We shall discuss\ntwo cases: (A) M 2 ≫ k 2 /a2 and (B) M 2 ≪ k 2 /a2 , separately. For viable f (R) models the mass squared M 2 is large\nin the past and it gradually decreases with time. Hence the transition from the regime (A) to the regime (B) can\noccur in the past, depending on the wave numbers k.\n1.\n\nEvolution of perturbations in the regime: M 2 ≫ k2 /a2\n\nThe solutions to Eq. (220) are given by the sum of the oscillating solution δFosc obtained by setting δρm = 0 and\nthe special solution δFind of Eq. (220) induced by the presence of matter perturbations δρm . The oscillating part\nδFosc satisfies the equation (a3/2 δFosc )** +M 2 (a3/2 δFosc ) ≃ 0. Using the WKB approximation, we obtain the following\nsolution [69]\n!\nZ\n1\np\nδFosc ∝ a−3/2 f,RR 1/4 cos\ndt ,\n(221)\n3f,RR\n\nwhere we have used the approximation F ≃ 1.\nFor the analytic estimation of the oscillating mode we take the model (47), which corresponds to the asymptotic\nform of the models (45) and (46) in the region R ≫ Rc . During the matter era in which the background Ricci scalar\nevolves as R(0) = 4/(3t2 ), the quantity f,RR has a dependence f,RR ∝ R−2(n+1) ∝ t4(n+1) for the model (47). Then\nthe evolution of the perturbation, δRosc = δFosc /f,RR , is given by\nδRosc ≃ c t−(3n+4) cos(c0 t−2(n+1) ) ,\n\n(222)\n\nwhere c and c0 are constants. Unless the coefficient c is chosen to be very small, as we go back to the past, the\nperturbation δRosc dominates over the background value R(0) (∝ t−2 ). Since the Ricci scalar can be negative, this\nleads to the violation of the stability conditions (f,RR > 0 and F > 0).\nThe special solution δFind to Eq. (220) can be derived by neglecting the first and second terms relative to others,\ngiving\nδFind ≃ δρm /(3M 2 ) ,\n\nδRind ≃ δρm .\n\n(223)\n\nUnder the condition |δFosc | ≪ |δFind |, one has δF ≃ δρm /(3M 2 ) and hence Ψ = −Φ = −(a2 /k 2 )δρm /(2F ). Then the\nmatter perturbation equation (218) reduces to\nδ̈m + 2H δ̇m − 4πGρm δm /F = 0 ,\n\n(224)\n\nwhere we have reproduced the gravitational constant G. In Refs. [330, 331] the perturbation equations have been\nderived without neglecting the oscillating mode.\n\n\f35\nDuring the matter-dominated epoch (Ωm = ρm /(3F H 2 ) ≃ 1), Eq. (224) has the growing-mode solution\nδm ∝ t2/3 .\n\n(225)\n\nThis is the same evolution as that in standard General Relativity. From Eq. (223) the matter-induced mode evolves\nas δFind ∝ t4(n+2/3) and δRind ∝ t−4/3 . Compared to the oscillating mode (222), δRind decreases more slowly and\nhence it dominates over δRosc at late times. The evolution of the perturbation δR = δRosc + δRind relative to the\nbackground value R(0) is given by\nδR/R(0) ≃ c1 t−(3n+2) cos(c0 t−p ) + c2 t2/3 ,\n\n(226)\n\nwhere c1 and c2 are constants. In order to avoid the dominance of the oscillating mode at the early cosmological\nepoch, we require that the coefficient c1 is suppressed relative to c2 [69, 71, 332].\nThis\np fine-tuning of initial conditions is related with the singularity problem raised by Frolov [333]. The field\nφ = 3/2κ2 ln F in the Einstein frame has a weak singularity at φ = 0 (at which the curvature R and the mass\nM go to infinity with a finite potential V ). Unless the oscillating mode of the field perturbation δφ is strongly\nsuppressed relative to the background field φ(0) , the system can access the curvature singularity. This past singularity\ncan be cured by taking into account the R2 term [334]. Note that the f (R) models proposed in Ref. [335] [e.g.,\nf (R) = R − αRc ln(1 + R/Rc )] to cure the singularity problem satisfy neither the local gravity constraints [336] nor\nobservational constraints of large-scale structure [337]. There are some works for the construction of unified models\nof inflation and dark energy based on f (R) theories [34, 338, 339], but the smooth transition between two accelerated\nepochs without crossing the point f,RR = 0 is not easy unless the forms of f (R) are carefully chosen [334].\n2.\n\nEvolution of perturbations in the regime: M 2 ≪ k2 /a2\n\nSince the mass M decreases as M ∝ t−2(n+1) , the modes initially in the region M 2 ≫ k 2 /a2 can enter the regime\nM 2 ≪ k 2 /a2 during the matter-dominated epoch. It is sufficient to consider the matter-induced mode because the\noscillating mode is already suppressed during the evolution in the regime M 2 ≫ k 2 /a2 . The matter-induced special\nsolution of Eq. (220) in the regime M 2 ≪ k 2 /a2 is approximately given by\nδFind ≃\n\na2\nδρm .\n3k 2\n\n(227)\n\nFrom Eq. (219) the gravitational potentials satisfy\n4 1 a2\nΨ=− *\nδρm ,\n3 2F k 2\n\nΦ=\n\n2 1 a2\nδρm .\n*\n3 2F k 2\n\n(228)\n\nPlugging Eq. (228) into Eq. (218), the matter perturbation obeys the following equation\nδ̈m + 2H δ̇m −\n\n4\n* 4πGρm δm /F = 0 .\n3\n\n(229)\n\nDuring the matter-dominated epoch (Ωm ≃ 1 and a ∝ t2/3 ), we obtain the following evolution\nδ m ∝ t(\n\n√\n33−1)/6\n\n.\n\n(230)\n\nThe growth rate of δm gets larger compared to that in the regime M 2 ≫ k 2 /a2 .\n3.\n\nMatter power spectra and the ISW effect\n\nIf the transition from the regime M 2 ≫ k 2 /a2 to the regime M 2 ≪\nk 2 /a2 occurs during the matter era, the\n√\n2/3\n( 33−1)/6\n. We use the subscript \"k\" for the\nevolution of matter perturbations changes from δm ∝ t\nto δm ∝ t\nquantities at which k is equal to aM , whereas the subscript \"Λ\" is used at which the accelerated expansion starts\n(ä = 0). While the redshift zΛ is independent of k, zk depend on k and also on the mass M .\nFor the model (47) the variable m = Rf,RR /f,R can grow fast from the regime m ≪ (aH/k)2 (i.e., M 2 ≫ k 2 /a2 ) to\nthe regime m ≫ (aH/k)2 (i.e., M 2 ≪ k 2 /a2 ). In fact, m can grow to the order of 0.1 even if m is much smaller than\n10−6 in the deep matter era. For the sub-horizon modes relevant to the galaxy power spectrum, the transition at\n\n\f36\n(a) Q=0.7, p=0.6\n(b) Q=-(1/6)1/2, p=0.6\n(c) ΛCDM, linear\n(d) ΛCDM, nonlinear\n\n4\n\n10\n\nm\n\n-3\n3\nPδ [h Mpc ]\n\n105\n\n3\n\n10\n\n2\n\n10\n0.001\n\n0.01\n0.1\n-1\nk [h Mpc ]\n\n1\n\nFigure 7: The matter power spectra Pδm√(k) in Brans-Dicke theory with the potential (98). This analysis covers the f (R) model\n(47) with√the correspondence Q = −1/ 6 and p = 2n/(2n + 1). Each case corresponds to (a) Q = 0.7, p = 0.6, C = 0.9, (b)\nQ = −1/ 6, p = 0.6, C = 0.9, (c) the ΛCDM model, and (d) the ΛCDM model with a nonlinear halo-fitting (σ8 = 0.78 and\n(0)\n2\n= 3.2 × 10−10 .\nshape parameter Γ = 0.2). The model parameters are Ωm = 0.28, H0 = 3.34 × 10−4 h Mpc−1 , ns = 1 and δH\nFrom Ref. [340].\n\nM 2 = k 2 /a2 typically occurs at the redshift zk larger than 1 (provided that n = O(1)). For the mode k/(a0 H0 ) = 300\none has zk = 4.83 for n = 1 and zk = 2.49 for n = 2. As n gets larger, the period of non-standard evolution of δm\nbecomes shorter because zk tends to be smaller. Since the scalaron mass evolves as M ∝ t−2(n+1) for the model (47),\nthe time tk has a scale-dependence tk ∝ k −3/(6n+4) . This means that the smaller-scale modes cross the transition\npoint earlier. The matter power spectrum Pδm = |δm |2 at the time tΛ shows a difference compared to the case of the\nΛCDM model:\nPδm (tΛ )\n=\nPδm ΛCDM (tΛ )\n\n\u0012\n\ntΛ\ntk\n\n\u0010√\n\n\u00132\n\n33−1\n− 32\n6\n\n\u0011\n\n∝k\n\n√\n33−5\n6n+4\n\n.\n\n(231)\n\nFrom Fig. 7 we find that the matter power spectrum in the f (R) model (47) with n = 3/4 is in fact larger than that\nin the ΛCDM model on smaller scales.\nThe galaxy matter power spectrum is modified by this effect. Meanwhile the CMB spectrum is hardly affected\nexcept for very large scales (for the multipoles l = O(1)) at which the Integrated Sachs-Wolfe (ISW) effect becomes\nimportant. Hence there is a difference for the spectral indices of two power spectra, i.e.\n√\n33 − 5\n∆n(tΛ ) =\n.\n(232)\n6n + 4\nFor larger n the redshift zk can be as close as zΛ , which means that the estimation (232) is not necessarily valid in\nsuch cases. Moreover the estimation (232) does not take into account the evolution of δm after z = zΛ to the present\nepoch (z = 0). It was found in Ref. [71] that the estimation (232) agrees well with the numerically obtained ∆n(tΛ )\nfor n ≤ 2.\nIn order to discuss the growth rate of matter perturbations, it is customary to introduce the growth index [341]\nfδ ≡\n\nδ̇m\n= (Ω̃m )γ ,\nHδm\n\n(233)\n\nwhere Ω̃m = κ2 ρm /(3H 2 ). In the ΛCDM model γ is nearly constant for the redshifts 0 < z < 1, i.e. γ ≃ 0.55\n[342, 343]. In f (R) gravity, if the perturbations are in the GR regime (M 2 ≫ k 2 /a2 ) today, γ is close to 0.55. On\nthe other hand, if the transition to the scalar-tensor regime occurs at the redshift zk larger than 1, the growth index\ntends to be smaller than 0.55 [344, 345]. Since 0 < Ω̃m < 1, the smaller γ implies a larger growth rate.\n\n\f37\nFor the wave numbers relevant to the linear regime of the matter power spectra (0.01 h Mpc−1 . k . 0.2 h Mpc−1 ,\nwhere h ≈ 0.7) the viable f (R) models (45)-(48) can give rise to the growth index γ0 = 0.40 today. Depending on the\nwave numbers k, γ0 can be dispersed in the regime 0.40 . γ0 . 0.55, or γ0 can show the convergence in the regime\n0.40 . γ0 . 0.43 [344, 345]. Moreover, when γ0 is small, the growth index exhibits a large variation even for low\nredshifts (0 < z < 1). Although the present observational constraints on γ are quite weak, the unusual evolution of γ\ncan be useful to distinguish the f (R) models from the ΛCDM in future observations.\nAfter the system enters the epoch of cosmic acceleration, the wave number k can again become smaller than aM .\nHence the k-dependence is not necessarily negligible even for z < zΛ . However numerical simulations show that ∆n(t0 )\nis not much different from ∆n(tΛ ) derived by Eq. (232) [71]. Thus the analytic estimation (232) is certainly reliable\nto place constraints on model parameters except for n ≫ 1. Observationally we do not find any strong difference for\nthe slopes of the spectra of LSS and CMB. If we take the mild bound ∆n(tΛ ) < 0.05, we obtain the constraint n ≥ 2\n[69]. In this case the local gravity constraint (67) is also satisfied.\nFor the wave numbers k & 0.2 h Mpc−1 we need to take into account the non-linear effect of density perturbations.\nIn Refs. [346–349] the authors carried out N -body simulations for the f (R) model (46) (see also Refs. [350, 351]).\nHu and Sawicki (HS) [352] proposed a fitting formula to describe the non-linear power spectrum based on the halo\nmodel. Koyama et al. [353] studied the validity of the HS fitting formula by comparing it with the results of N -body\nsimulations and showed that the HS fitting formula can reproduce the power spectrum in N -body simulations for the\n3\n2 2\nscales k < 0.5h Mpc−1 . In the quasi non-linear regime a normalized skewness, S3 = hδm\ni/hδm\ni , has been evaluated\nin f (R) gravity and in Brans-Dicke theories [354]. The skewness in f (R) dark energy models differs only by a few\npercent relative to the value S3 = 34/7 in the ΛCDM model.\nThe modified growth of matter perturbations also affects the evolution of the gravitational potentials Ψ and Φ.\nThe effective potential ψ ≡ Φ − Ψ is important to discuss the ISW effect on the CMB as well as the weak lensing\nobservations [355]. For the modes deep inside the Hubble radius, Eq. (219) gives\nψ = 3Ωm δm\n\n\u0012\n\naH\nk\n\n\u00132\n\n.\n\n(234)\n\nNote that for the large-scale modes relevant to the ISW effect in CMB we need to solve the full perturbation equations\nwithout using the quasi-static approximation on sub-horizon scales. For viable f (R) models, however, numerical\nsimulations show that the result (234) can be trustable even for the wave numbers close to the Hubble radius today\n(i.e. k & a0 H0 ) [155]. In the ΛCDM model the potential ψ remains constant during the standard matter era, but\nit decays after the system enters the accelerated epoch, producing the ISW contribution for low multipoles on the\nCMB power spectrum. In f (R) gravity the additional growth of matter perturbations in the region z < zk changes\nthe evolution of ψ.\nFrom the observation of the CMB angular power spectrum, the constraint on the deviation parameter B ≡\n(ṘH/RḢ)m from the ΛCDM is weak. The value of B today is constrained to be B0 < 4.3 [356]. There is another observational constraint coming from the angular correlation between the CMB temperature field and the\ngalaxy number density field induced by the ISW effect. The avoidance of a large anti-correlation between the observational data of CMB and LSS places an upper bound of B0 . 1. Since this roughy corresponds to m(z = 0) . 1, the\nCMB observations do not provide tight constraints on f (R) models relative to the matter power spectrum of LSS. In\nweak lensing observations, the modified evolution of the lensing potential ψ directly leads to the change even for the\nsmall-scale shear power spectrum [340, 355, 357]. Hence this can be a powerful tool to constrain f (R) gravity models\nfrom future observations.\nB.\n\nBrans-Dicke theory\n\nLet us proceed to discuss the evolution of matter perturbations in Bran-Dicke theory described by the action (76)\nwith the potential U (φ) and the coupling F (φ) = e−2Qφ . We are mainly interested in large coupling models with |Q|\nof the order of unity [76, 81, 82], as this gives rise to significant deviation from the ΛCDM. We define the field mass\nsquared to be M 2 ≡ U,φφ . If the scalar field is light such that the condition M < H0 is always satisfied irrespective of\nhigh or low density regions, the coupling Q is constrained to be |Q| . 10−3 from local gravity constraints. Meanwhile,\nif the mass M in the region of high density is much larger than that on cosmological scales, the model can satisfy local\ngravity constraints under the chameleon mechanism even if |Q| is of the order of unity. Cosmologically the mass M\ncan decrease from the past to the present, which can allow the transition from the \"GR regime\" to the \"scalar-tensor\nregime\" as it happens in f (R) gravity. An example of the field potential showing this behavior is given by Eq. (98).\nAs in f (R) gravity, the matter perturbation δm obeys Eq. (213). The difference appears in the expression of the\n\n\f38\ngravitational potential Ψ. In Fourier space the scalar metric perturbations obey the following equations [76, 325, 326]\n\"\nk2\n1\n1\n− 2 Φ + 3H(HΨ − Φ̇) = −\nω φ̇δ φ̇ + (ω,φ φ̇2 − F,φ R + 2V,φ )δφ\na\n2F\n2\n#\n\u0013\n\u0012\n2\nk\n(235)\n+ 3Ḣ + 3H 2 − 2 δF − 3Hδ Ḟ + (3H Ḟ − ω φ̇2 )Ψ + 3Ḟ (HΨ − Φ̇) + δρm ,\na\n\"\n\u0013 #\n\u0012\n\u0010\nω,φ \u0011\nk 2 \u0010 ω,φ \u0011 φ̇2\n2U,φ − F,φ R\nδ φ̈ + 3H +\nδφ\nφ̇ δ φ̇ + 2 +\n+\nω\na\nω ,φ 2\n2ω\n,φ\n\u0010\nω,φ 2 \u0011\n1\n= φ̇Ψ̇ + 2φ̈ + 3H φ̇ +\nφ̇ Ψ + 3φ̇(HΨ − Φ̇) +\nF,φ δR ,\n(236)\nω\n2ω\nF,φ\nδF\n=−\nδφ ,\n(237)\nΨ+Φ=−\nF\nF\nwhere δφ is the perturbation of the field φ, ω = (1 − 6Q2 )F , and\nh\n\u0010\n\u0011\ni\nδR = 2 3(Φ̇ − HΨ)* − 12H(HΨ − Φ̇) + k 2 /a2 − 3Ḣ Ψ + 2(k 2 /a2 )Φ .\n\n(238)\n\nProvided that the field is sufficiently heavy to satisfy the conditions M 2 ≫ R, one can employ the approximation\n[(2U,φ − F,φ R)/2ω],φ ≃ M 2 /ω in Eq. (236). The solution to Eq. (236) consists of the sum of the matter-induced mode\nδφind sourced by the matter perturbation and the oscillating mode δφosc , i.e. δφ = δφind + δφosc (as in the case of\nf (R) gravity).\nIn order to know the evolution of the matter-induced mode we employ the quasi-static approximation on sub-horizon\nscales. Under this approximation, we have δRind ≃ 2(k 2 /a2 )[Φ − (F,φ /F )δφind ] from Eqs. (235) and (238), where the\nsubscript \"ind\" represents the matter-induced mode. Then from Eq. (236) we find\nδφind ≃ −\n\nk2\n2QF\nΦ.\n(k 2 /a2 )(1 − 2Q2 )F + M 2 a2\n\n(239)\n\nUsing Eqs. (235) and (237) we obtain\nk2\nδρm (k 2 /a2 )(1 + 2Q2 )F + M 2\nΨ\n≃\n−\n,\na2\n2F\n(k 2 /a2 )F + M 2\n\nk2\nδρm (k 2 /a2 )(1 − 2Q2 )F + M 2\nΦ\n≃\n.\na2\n2F\n(k 2 /a2 )F + M 2\n\n(240)\n\nIn the massive limit M 2 /F ≫ k 2 /a2 , we recover the standard result of General Relativity. In the massless limit\nM 2 /F ≪ k 2 /a2 , it follows that (k 2 /a2 )Ψ ≃ −(δρm /2F )(1 + 2Q2 ) and (k 2 /a2 )Φ ≃ (δρm /2F )(1 − 2Q2 ).\nPlugging Eq. (240) into Eq. (218), we obtain the equation for matter perturbations [76]\nδ̈m + 2H δ̇m − 4πGeff ρm δm = 0 ,\n\n(241)\n\nwhere the effective gravitational coupling is\nGeff =\n\nG (k 2 /a2 )(1 + 2Q2 )F + M 2\n.\nF\n(k 2 /a2 )F + M 2\n\n(242)\n\nWe have recovered the bare gravitational constant G. In the massless limit (M 2 ≪ k 2 /a2 ) this reduces to\nGeff ≃\n\nG\nG 4 + 2ωBD\n,\n(1 + 2Q2 ) =\nF\nF 3 + 2ωBD\n\n(243)\n\nwhere in the last line we have used the relation (77) between the coupling Q and the Brans-Dicke parameter ωBD . In\nf (R) gravity we have ωBD = 0 and hence Geff = 4G/(3F ).\nLet us consider the evolution of the oscillating mode of perturbations. Using Eqs. (235) and (236) for sub-horizon\nmodes (k 2 /a2 ≫ H 2 ), the gravitational potentials can be expressed by δφosc (note that δρm = 0 for the oscillating\nmode). From Eq. (238) the perturbation of R corresponding to the oscillating mode is given by\ni\nh\n(244)\nδRosc ≃ 6Q δ φ̈osc + 3Hδ φ̇osc + (k 2 /a2 )δφosc .\n\n\f39\nSubstituting Eq. (244) into Eq. (236), it follows that\n\u0001\nδ φ̈osc + 3Hδ φ̇osc + k 2 /a2 + M 2 /F δφosc ≃ 0 ,\n\n(245)\n\nwhich is valid in the regime M 2 ≫ R.\nWhen |Q| = O(1) the field potential U (φ) is required to be heavy in the region of high density for the consistency\nwith local gravity constraints. We take the potential (98) as an example of a viable model. During the matter era the\n1\np−1\nfield φ settles down at the instantaneous minima characterized by the condition (100). Then we have that φ ∝ ρm\n2−p\n\n1−p\nand M 2 ∝ ρm\nduring the matter-dominated epoch. The field φ can initially be heavy to satisfy the condition\nM 2 /F ≫ k 2 /a2 for the modes relevant to the galaxy power spectrum. Depending upon the model parameters and\nthe mode k, the mass squared M 2 can be smaller than k 2 /a2 during the matter era [76].\nIn the regime M 2 /F ≫ k 2 /a2 the matter perturbation equation (241) reduces to the standard one in Einstein gravity, which gives the evolution δm ∝ t2/3 . For the model (98) the matter-induced mode of the field perturbation\n\u0010 evolves\n\u0011\n2(4−p)\n\np\n\n1\n\nas δφind ∝ δρm /M 2 ∝ t 3(1−p) . Meanwhile, the WKB solution to Eq. (245) is given by δφosc ∝ t 2(1−p) cos ct− 1−p ,\n2\n\nwhere c is a constant. Since the background field φ during the matter era evolves as φ ∝ t 1−p , we find\n\u0011\n\u0010\n4−p\n1\nδφ/φ = (δφind + δφosc )/φ ≃ c1 t2/3 + c2 t− 2(1−p) cos ct− 1−p .\n\n(246)\n\nAs long as the oscillating mode is initially suppressed relative to the matter-induced mode, the latter remains the\ndominant contribution in the subsequent cosmic expansion history.\nIn the regime M 2 /F ≪ k 2 /a2 the effective gravitational coupling is given by Eq. (243). Solving Eq. (241) in this\ncase, we obtain the solution\n√\n2\nδm ∝ t( 25+48Q −1)/6 .\n(247)\n√\n√\nSetting Q = −1/ 6, this recovers the solution δm ∝ t( 33−1)/6 in metric f (R) gravity.\nThe potential (98) has a heavy mass M much larger than H in the deep matter-dominated epoch, but it gradually\ndecreases with time. Depending on the modes k, the system crosses the point M 2 /F = k 2 /a2 at t = tk during\n2−p\nthe matter-dominated epoch. Since the field mass evolves as M ∝ t− 1−p during the matter era, the time tk has a\n3(1−p)\nscale-dependence given by tk ∝ k − 4−p . Since 0 < p < 1 the smaller scale modes (i.e. larger k) cross the transition\npoint earlier. During the matter era the mass squared is approximately given by\n1−p\nQ2\nM ≃ p\n(2 p C)1/(1−p)\n2\n\n\u0012\n\nρm\nV0\n\n2−p\n\u0013 1−p\n\nU0 .\n\n(248)\n\n(0)\n\nUsing the relation ρm = 3F0 Ωm H02 (1 + z)3 , the critical redshift zk at time tk can be estimated as\nzk ≃\n\n\"\u0012\n\nk 1\na 0 H0 Q\n\n\u00132(1−p)\n\n1\nU0\n2p pC\n2−p H02\n(1 − p)1−p (3F0 Ω(0)\n)\nm\n\n1\n# 4−p\n\n−1,\n\n(249)\n\nwhere a0 is the scale factor today. The critical redshift increases for larger k/(a0 H0 ) and for smaller p. If k/(a0 H0 ) =\n600 and p = 0.7, Eq. (249) gives zk = 3.9.\nDefining the growth rate of matter perturbations as in Eq.\np(233), it follows that the asymptotic values of fδ in the\nregions t ≪ tk and t ≫ tk are given by fδ = 1 and fδ = ( 25 + 48Q2 − 1)/4, respectively. Numerical simulations\nshow that the growth rate reaches a maximum value around the end of the matter era and then it starts to decrease\nduring the epoch of cosmic acceleration [76]. The observational constraint on fδ reported by McDonald et al. [358]\nis fδ = 1.46 ± 0.49 around the redshift z = 3, whereas the data reported by Viel and Haehnelt [359] in the redshift\nrange 2 < z < 4 show that even the value p\nfδ = 2 can be allowed in some of the observations. If we use the criterion\nfδ < 2 with the analytic estimation fδ = ( 25 + 48Q2 − 1)/4, we obtain the bound Q < 1.08. Note that the growth\nindex today can be smaller than 0.4 for |Q| larger than 0.4, so this will be also useful to place tight bounds on Q in\nfuture observations.\nThe relative difference of the matter power spectrum Pδm at time t = tΛ (at which ä = 0) from that in the ΛCDM\nis given by\nPδm (tΛ )\n=\n(tΛ )\nPδΛCDM\nm\n\n\u0012\n\ntΛ\ntk\n\n\u0012√\n\n\u00132\n\n25+48Q2 −1\n− 23\n6\n\n\u0013\n\n∝k\n\n√\n\n(1−p)(\n\n25+48Q2 −5)\n4−p\n\n.\n\n(250)\n\n\f40\nIn Fig. 7 we plot the matter power spectrum for Q = 0.7 and p = 0.6, which deviates from that in the ΛCDM model\non small scales. The estimation (250) shows fairly good agreement with numerical results [340].\nFrom Eqs. (240) we find that the effective gravitational potential ψ = Φ − Ψ satisfies the same equation as (234).\nSince the ISW effect induced by the modified evolution of ψ is limited on large-scale CMB perturbations irrelevant\nto the galaxy power spectrum, there is a difference between the spectral indices of the matter power spectrum and of\nthe CMB spectrum on the scales, k > 0.01h Mpc−1 :\np\n(1 − p)( 25 + 48Q2 − 5)\n.\n(251)\n∆n(tΛ ) =\n4−p\n√\nThis reproduces the result (232) in f (R) gravity by setting Q = −1/ 6 and p = 2n + 1. If we use the criterion\n∆n(tΛ ) < 0.05, as in the case of the f (R) gravity, we obtain the bounds p > 0.957 for Q = 1 and p > 0.855 for\nQ = 0.5. As long as p is close to 1, it is possible to satisfy both cosmological and local gravity constraints for |Q| . 1.\nC.\n\nDGP model\n\nIn this section we study the evolution of linear matter perturbations in the DGP braneworld model. The discussion\nbelow is valid for the wavelengths larger than the Vainshtein radius r∗ . For the radius r smaller than r∗ the non-linear\neffect coming from the brane-bending mode becomes crucially important. The perturbed metric in the 5-dimensional\nlongitudinal gauge with four scalar metric perturbations Ψ, Φ, B, E is given by [87, 361]\nds2 = −(1 + 2Ψ)n(t, y)2 dt2 + (1 + 2Φ)A(t, y)2 δij dxi dxj + 2rc B,i dxi dy + (1 + 2E)dy 2 ,\n\n(252)\n\nwhere the brane is located at y = 0 in the 5-th dimension characterized by the coordinate y (we are considering a flat\nFLRW spacetime on the brane). Note that B can be identified as a brane bending mode describing a perturbation\nof the brane location and that rc is the crossover scale defined in Eq. (130). The background solution describing the\nself-accelerating Universe is [218]\nn(t, y) = 1 + H(1 + Ḣ/H 2 )y ,\n\nA(t, y) = a(t)(1 + Hy) .\n\n(253)\n\nThe Hubble parameter H = ȧ/a satisfies Eq. (133) with ǫ = +1.\nIn what follows we neglect the terms suppressed by the factor aH/k ≪ 1 because we are considering sub-horizon\nperturbations. We also ignore the terms such as (A′ /A)Φ′ , where a prime represents a derivative with respect to y.\nThis comes from the fact that Φ′ is of the order of (k/a)Φ, as we will show later. The time-derivative terms can be\nalso dropped under the quasi-static approximation on sub-horizon scales. Then the perturbed 5-dimensional Einstein\ntensors δ G̃A\nB obey the following equations locally in the bulk [361]:\n\u0012 \u0013\n∇2\nrc A′\n2 2\n′\n0\n′′\nδ G̃0 = 3Φ + 2 ∇ Φ + 2 (E − rc B ) − 2 2\n∇2 B = 0 ,\n(254)\nA\nA\nA\nA\n\u0013\n\u0012 ′\nrc\nn′\nA\n1\nB = 0 , (255)\n+\nδ G̃ij = − 2 (∇i ∇j − δji ∇2 )(Φ + Ψ + E − rc B ′ ) + δji (Ψ′′ + 2Φ′′ ) + 2 (∇i ∇j − δji ∇2 )\nA\nA\nA\nn\nδ G̃5i = −(Ψ′ + 2Φ′ ),i = 0 ,\n\u0013\n\u0012 ′\n1 2\nA\nrc\nn′\n5\nδ G̃5 = 2 ∇ (Ψ + 2Φ) − 2 2 +\n∇2 B = 0 .\nA\nA\nA\nn\n\nTaking the divergence of the traceless part of Eq. (255), we obtain\n\u0013\n\u0012\n∇2\nrc A′\nn′\n′\n∇2 B = 0 .\n(Φ\n+\nΨ\n+\nE\n−\nr\nB\n)\n−\n+\nc\nA2\nA2 A\nn\n\n(256)\n\n(257)\n\n(258)\n\nThe consistency between Eqs. (256) and (257) requires that\nB ′ = 0,\n\nΨ′ + 2Φ′ = 0 .\n\n(259)\n\nFrom Eqs. (257) and (258) we find\n1 ∇2\nrc n′ 2\n∇2\n′\n(E\n−\nr\nB\n)\n=\n−\nΨ\n+\n∇ B.\nc\nA2\n2 A2\n2A2 n\n\n(260)\n\n\f41\nSubstituting Eqs (257) and (260) into Eq. (254) together with the use of Eq. (259), we obtain\nΨ′′ +\n\nn′ rc 2\n∇2\nΨ−\n∇ B = 0.\n2\nA\nn A2\n\n(261)\n\nUnder the sub-horizon approximation (k/aH ≫ 1) the solution to Eq. (261), upon the Fourier transformation, is\ngiven by\nΨ−\n\ni\nh\nn′\nrc B = c1 (1 + Hy)−k/aH + c2 (1 + Hy)k/aH ,\nn\n\n(262)\n\nwhere c1 and c2 are integration constants. In order to avoid the divergence of the perturbation in the limit y → ∞\nwe choose c2 = 0.\nThe junction condition at the brane can be expressed in terms of an extrinsic curvature Kμν and an energymomentum tensor on the brane [362]:\nKμν − Kgμν = −κ2(5) Tμν /2 + rc Gμν ,\n\n(263)\n\nwhere K ≡ Kμμ . The extrinsic curvature is defined as Kμν = hλμ ∇λ nν , where nν is the unit vector normal to the\nbrane and hμν = gμν − nμ nν is the induced metric on the brane. The (0, 0) and spatial components of the junction\ncondition (263) give\n2 2\n1\n3\n∇ Φ = −κ2(4) δρm + 2 ∇2 B − Φ′ ,\na2\na\nrc\nΦ + Ψ = B,\nΨ′ + 2Φ′ = 0 ,\n\n(264)\n(265)\n(266)\n\nwhere δρm is the matter perturbation on the brane. Equation (266) is consistent with the latter of Eq. (259).\nFrom Eq. (262) it follows that Φ′ ∼ (k/a)Φ in Fourier space. For the perturbations whose wavelengths are much\nsmaller than the cross-over scale rc , i.e., rc k/a ≫ 1, the term (3/rc )Φ′ in Eq. (264) is much smaller than (k 2 /a2 )Φ.\nIn Fourier space Eq. (264) is approximately given by\nk2\n2k 2\n2\nδρ\n+\nΦ\n=\nκ\nB.\nm\n(4)\na2\na2\n\n(267)\n\nUsing the projection of Eq. (257) as well as Eqs. (265) and (267), we find that metric perturbations Ψ and Φ obey\nthe following equations\n2\n\nκ(4)\nk2\nΨ=−\n2\na\n2\n\nκ2(4)\nk2\nΦ\n=\na2\n2\n\n\u0012\n\u0013\n1\n1+\nδρm ,\n3β\n\n\u0012\n\u0013\n1\n1−\nδρm ,\n3β\n\n(268)\n\nwhere\n2rc\nβ(t) ≡ 1 −\n3\n\n\u0012\n\nA′\nn′\n2 +\nA\nn\n\n\u0013\n\n= 1 − 2Hrc\n\nḢ\n1+\n3H 2\n\n!\n\n.\n\n(269)\n\nThe matter perturbation δm satisfies the same form of equation as given in (218) for the modes deep inside the horizon\n[360]. Substituting the former of Eq. (268) into Eq. (218), we find that the matter perturbation obeys the following\nequation [87, 360]\nδ̈m + 2H δ̇m − 4πGeff ρm δm = 0 ,\n\n(270)\n\nwhere\nGeff\n\n\u0012\n\u0013\n1\n= 1+\nG.\n3β\n\n(271)\n\nFrom Eq. (268) the effective gravitational potential ψ = Φ − Ψ obeys the same equation as (234).\nIn the deep matter era one has Hrc ≫ 1 and hence β ≃ −Hrc , so that β is largely negative (|β| ≫ 1). In this regime\nthe evolution of the matter perturbation is similar to that in General Relativity (δm ∝ t2/3 ). The solutions finally\napproach the de Sitter attractor characterized by HdS = 1/rc . At the e Sitter solution one has β ≃ 1 − 2Hrc ≃ −1.\n\n\f42\nSince 1 + 1/(3β) ≃ 2/3, the growth rate in this regime is smaller than that in GR. The growth index is approximately\ngiven by γ ≈ 0.68 [343], which is different from the value γ ≃ 0.55 in the ΛCDM model. If the future imaging survey\nof galaxies can constrain γ within 20 %, it may be possible to distinguish the DGP model from the ΛCDM model\n[363].\nComparing Eq. (271) with the effective gravitational coupling (243) in Brans-Dicke theory with a massless limit (or\nthe absence of the field potential), we find that the Brans-Dicke parameter ωBD has the following relation with β:\nωBD =\n\n3\n(β − 1) .\n2\n\n(272)\n\nSince β < 0 for the self-accelerating DGP solution, this implies that ωBD < −3/2. Since in this case the kinetic energy\nof a scalar field degree of freedom is negative in the Einstein frame, the DGP model contains a ghost mode. The\nsolution in another branch of the DGP model is not plagued by this problem, because the minus sign of Eq. (269) is\nreplaced by the plus sign. The self accelerating solution in the original DGP model can be realized at the expense of\nan appearance of the ghost state.\nD.\n1.\n\nGalileon gravity\n\nCovariant Galileon gravity\n\nIn covariant Galileon gravity described by the action (140) the evolution of matter density perturbations was studied\nin Ref. [364]. In spite of the complexities of full perturbation equations, they are simplified under the quasi-static\napproximation on sub-horizon scales. Under this approximation the matter perturbation obeys the same equation as\n(270) with a different effective gravitational coupling Geff . In Ref. [364] it was found that Geff is independent of the\nwave number k, as in the DGP model. Geff is close to the gravitational constant G in the asymptotic past, but it\nstarts to deviate at the late cosmological epoch.\nWe define the effective gravitational potential ψ = Φ − Ψ as well as the anisotropic parameter η = −Φ/Ψ. Under\nthe quasi-static approximation on sub-horizon scales we obtain [364]\n\u0012\n\u00132\nGeff 1 + η\naH\nψ≃3\n,\n(273)\nΩm δ m\nG\n2\nk\nwhere Ωm and δm and the density parameter and the perturbation of non-relativistic matter, respectively. In f (R)\ngravity, Brans-Dicke theory, and the DGP model the effective gravitational potential obeys Eq. (234) for the modes\ndeep inside the Hubble radius. In Galileon gravity the combination (Geff /G)(1 + η)/2 is different from 1. This means\nthat the effective gravitational potential may acquire some additional growth compared to other models. In Galileon\ncosmology there are three different regimes characterized by (i) r1 ≪ 1, r2 ≪ 1, (ii) r1 = 1, r2 ≪ 1, and (iii) r1 = 1,\nr2 = 1, where r1 and r2 are defined in Eq. (150). In these regimes we can estimate Geff and η as follows [364]. We\nstress that these analytic results are valid for the modes deep inside the Hubble radius.\n• (i) r1 ≪ 1, r2 ≪ 1\nExpanding Geff and η about r1 = 0, r2 = 0, it follows that\n\u0013\n\u0012\n\u0013\n\u0012\n129\n211\n589\n255\nGeff\n2\nη =1+\n=1+\nβ+\nαr1 r2 + O(r2 ) ,\nβ+\nαr1 r2 + O(r22 ) ,\nG\n8\n16\n8\n16\n\n(274)\n\nwhere α and β are defined by Eq. (149). Since β > 0 to avoid ghosts (for the branch r2 > 0), we have Geff > G\nand η > 1 in this regime. This means that the growth rates of δm and ψ are larger than those in the ΛCDM\nmodel.\n• (ii) r1 = 1, r2 ≪ 1\nExpansion of Geff and η about r2 = 0 gives\nGeff\n291α2 + 702β 2 − 933αβ + 20α − 84β + 4\n= 1+\nr2 + O(r22 ) ,\nG\n2(10α − 9β + 8)\n3(126α2 + 306β 2 − 405αβ + 4α − 30β)\nr2 + O(r22 ) .\nη = 1−\n2(10α − 9β + 8)\n\n(275)\n(276)\n\nThe evolution of Geff and η depends on both α and β. If α = 1.4 and β = 0.4, for example, we have\nGeff /G ≃ 1 + 4.31r2 and η ≃ 1 − 5.11r2 , respectively. In this case Geff > G, but η is smaller than 1.\n\n\f43\n\nFigure 8: Evolution of the perturbations for α = 1.37 and β = 0.44 with the background initial conditions r1 = 0.03 and\nr2 = 0.003. (Left) δm /a versus z for the wave numbers (a) k = 300a0 H0 , (b) k = 30a0 H0 , and (c) k = 5a0 H0 . (Right) ψ versus\nz for the wave numbers (a) k = 300a0 H0 , (b) k = 10a0 H0 , and (c) k = 5a0 H0 . Note that δm /a and ψ are divided by their\ninitial amplitudes δm (ti )/a(ti ) and ψ(ti ), respectively, so that their initial values are normalized to be 1. The bold dotted lines\nshow the results obtained under the quasi-static approximation on sub-horizon scales. From Ref. [364].\n\n• (iii) r1 = 1, r2 = 1\n\nAt the dS point we have\n1\nGeff\n=\n,\nG\n3(α − 2β)\n\nη = 1,\n\n(277)\n\nwhich means that there is no anisotropic stress.\nRecall that the late-time tracking solutions are favored from observational constraints at the background level. In\nthis case the solutions start from the regime (i) and finally approach the de Sitter fixed point with a short period of\nthe regime (ii). In Fig. 8 we plot δm /a and ψ versus the redshift z for α = 1.37 and β = 0.44 with the background\ninitial conditions r1 = 0.03 and r2 = 0.003. In this case the solutions approach the tracker at late times. The initial\nconditions of perturbations are chosen to recover the GR behavior in the asymptotic past. Note that these results\nare obtained by numerical integration of the full perturbation equations without quasi-static approximations. For\nthe mode k = 300a0H0 the numerical result shows excellent agreement with that obtained under the quasi-static\napproximation on sub-horizon scales. The difference starts to appear for the modes k/(a0 H0 ) < O(10). From the left\npanel of Fig. 8 we find that, on larger scales, the growth of δm tends to be less significant. For the modes k ≫ a0 H0\nthe matter perturbation evolves faster than a during the matter era.\nFrom the right panel of Fig. 8 we find that, unlike the ΛCDM model, ψ changes in time even during the matter era\nfor the modes k ≫ aH. Before reaching the tracker we have Geff /G ≃ 1+255βr2/8 > 1 and η ≃ 1+129βr2/8 > 1 from\nEq. (274). Then the growth rates of ψ and δm get larger than those in GR. In particular the term (Geff /G)(1 + η)/2\nin Eq. (273) is larger than 1, which leads to the additional growth of ψ to that coming from δm . In Galileon gravity\nthe unusual behavior of the anisotropic parameter η leads to the non-trivial evolution of perturbations. For the model\nparameters α = 1.37 and β = 0.44, Eq. (277) gives Geff ≃ 0.68G at the de Sitter fixed point. Since in this case Geff\nis smaller than G, ψ begins to decrease at some point after the matter era.\nFor the large-scale modes relevant to the ISW effect in CMB anisotropies (k/(a0 H0 ) . 10), ψ is nearly constant in\nthe early matter-dominated epoch. However, as we see in Fig. 8, ψ exhibits temporal growth during the transition\nfrom the matter era to the epoch of cosmic acceleration. The characteristic variation of ψ in the Galileon model may\nleave interesting observational signatures on the large-scale CMB anisotropies.\nFor the model parameters constrained by SN Ia (Union2)+CMB+BAO data sets, i.e. α = 1.404 ± 0.057 and\nβ = 0.419 ± 0.023 [259], the effective gravitational coupling at the de Sitter solution is restricted in the range\n\n\f44\n0.5G < Geff < 0.72G. If the model parameters are close to the upper limit α = 2β + 2/3 of the allowed parameter\nspace at the background level (i.e. Geff is close to 0.5G at the de Sitter point), the parameter η tends to show a\ndivergence during the transition from the matter era to the epoch of cosmic acceleration. If Geff is larger than 0.66G,\nwe find that such divergent behavior is typically avoided. For the viable model parameters the evolution of δm and ψ\nexhibits more or less the similar property to that shown in Fig. 8.\n2.\n\nModified Galileon gravity\n\nFinally we study modified Galileon theories in which the term \u0003φ(∂μ φ∂ μ φ) is generalized to ξ(φ)\u0003φ(∂μ φ∂ μ φ). Let\nus consider general theories described by the action\n\u0015 Z\n\u0014\nZ\n√\n1\n(278)\nS = d4 x −g f (R, φ, X) + ξ(φ)\u0003φ(∂μ φ∂ μ φ) + d4 x LM ,\n2\nwhere\nf (R, φ, X) = f1 (R, φ) + f2 (φ, X) .\n\n(279)\n\nWe introduce two mass scales associates with the field φ and the scalar gravitational degree of freedom, respectively,\nas\nMφ2 ≡ −f,φφ /2 ,\n\nMR2 ≡ F/(3F,R ) ,\n\n(280)\n\nwhere F ≡ ∂f /∂R.\nThe full perturbation equations for the perturbed metric (207) are given in Ref. [183]. Under the quasi-static approximation on sub-horizon scales the matter perturbation satisfies Eq. (270) with the effective gravitational coupling\n[183]\n)\n(\n[F,φ + 2(1 + 4s1 )ξ φ̇2 ]2\n1 1 + 4s1\n,\n(281)\n1+\nGeff =\n8πF 1 + 3s1\n(1 + 4s1 )μF\nwhere\n2\nμ ≡ (1 + 3s1 )(f,X + 2s2 ) + 3F,φ\n/F + 2ξ[4(1 + 3s1 )(φ̈ + 2H φ̇) − 2F,φ φ̇2 /F − 2ξ φ̇4 (1 + 4s1 )/F ] ,\n2\n\ns1 ≡ k /(3a\n\n2\n\nMR2 ) ,\n\ns2 ≡ a\n\n2\n\nMφ2 /k 2\n\n.\n\n(282)\n(283)\n\nThe anisotropic parameter η = −Φ/Ψ is given by\nη=\n\n2\n(1 + 2s1 )(f,X + 2s2 ) + 2F,φ\n/F + 4ξ[2(1 + 2s1 )(φ̈ + 2H φ̇) − F,φ φ̇2 /F ]\n2 /F + 8ξ(1 + 4s )(φ̈ + 2H φ̇)\n(1 + 4s1 )(f,X + 2s2 ) + 4F,φ\n1\n\n.\n\n(284)\n\nThe effective gravitational potential ψ = Φ − Ψ obeys the equation of the form (273), whose explicit form is\nψ = 3Ωm δm\n\n\u0012\n\naH\nk\n\n\u00132\n\n2\n(1 + 3s1 )[f,X + 2s2 + 8ξ(φ̈ + 2H φ̇)] + 3F,φ\n/F − 2ξF,φ φ̇2 /F\n\n2 /F − 4ξ[F φ̇2 /F + ξ φ̇4 (1 + 4s )/F ]\n(1 + 3s1 )[f,X + 2s2 + 8ξ(φ̈ + 2H φ̇)] + 3F,φ\n1\n,φ\n\n,\n\n(285)\n\nwhere Ωm = ρm /(3F H 2 ).\nIn the massive limits Mφ2 → ∞ and MR2 → ∞, i.e. s1 → 0 and s2 → ∞ we recover the standard results in\n2\nGR: Geff ≃ 1/(8πF ), η ≃ 1, and ψ ≃ 3Ωm δm (aH/k) . The difference appears in the regimes characterized by the\nconditions s1 & 1 and s2 . 1, as it happens for the late-time evolution of perturbations in f (R) gravity and in\nBrans-Dicke theory.\n2\nFor the theories with ξ = 0, Eq. (285) gives the standard relation ψ = 3Ωm δm (aH/k) . If ξ 6= 0, then this relation\nno longer holds. In this case ψ is not directly related with δm due to the additional contribution from the ξ-dependent\nterm. This can be regarded as the main reason for the anti-correlation between the ISW effect in CMB and the\nlarge-scale structure found for the model (182) [239].\nIn Ref. [183] the authors derived conditions for avoiding the appearance of ghosts and Laplacian instabilities.\nProvided F > 0 the tensor ghosts do not appear. Since c2T = 1 for the theories (278), tensor perturbations have\n\n\f45\nno Laplacian instabilities. For the theories with f,RR 6= 0 the conditions for the avoidance of ghosts and Laplacian\ninstabilities of scalar perturbations are given, respectively, by\n2 2\nφ̇ /F,R > 0 ,\n24ξH φ̇ − 8ξ,φ φ̇2 + f,X + f,XX φ̇2 − F,X\n\n(286)\n\nf,X + 8(φ̈ + 2H φ̇)ξ − 16ξ φ̇ /(3F ) > 0 .\n\n(287)\n\n2 4\n\nSimilar conditions have been also derived for the theories with f,RR 6= 0. The dark energy models based on the action\n(278) need to be constructed to satisfy these conditions.\nE.\n\nObservables in weak lensing\n\nWe have shown that modified gravity models of dark energy generally lead to changes for the growth rate of matter\nperturbations compared to the ΛCDM model. Since there are two free functions that determine the first-order metrics\nΨ and Φ, dark energy models can be classified according to how the gravitational potentials are linked to δm . In order\nto quantify this, we introduce two quantities q(k, t) and ζ(k, t) defined by\n(k 2 /a2 )Φ = 4πGq δm ρm ,\n(Φ + Ψ)/Φ = ζ ,\n\n(288)\n(289)\n\nwhere G is the 4-dimensional bare gravitational constant. The ΛCDM model corresponds to q = 1 and ζ = 0 (note\nthat the cosmological constant does not cluster). Modified gravity models give rise to different values of q and ζ relative\nto those in the ΛCDM model. Therefore the functions q and ζ characterize gravitational theories for first-order scalar\nperturbations on small scales.\nIn Brans-Dicke theory discussed in Sec. VII B, the gravitational potentials are given by Eq. (240) on sub-horizon\nscales. In this case we have\nq=\n\n1 (k 2 /a2 )(1 − 2Q2 )F + M 2\n,\nF\n(k 2 /a2 )F + M 2\n\nζ=−\n\n4F (k 2 /a2 )Q2\n,\n− 2Q2 )F + M 2\n\n(k 2 /a2 )(1\n\n(290)\n\nwhere we have used the unit 8πG = 1. In the regime M 2 /F ≫ k 2 /a2 (and F ≃ 1) it follows that q ≃ 1 and ζ ≃ 0.\nIn the regime M 2 /F ≪ k 2 /a2 we have q ≃ (1 − 2Q2 )/F and ζ ≃ −4Q2 /(1 − 2Q2 ), so that the√deviation from the\nΛCDM model appears. The expression (290) covers the case of f (R) gravity by setting Q = −1/ 6.\nIn the DGP model the gravitational potentials obey Eq. (268) and hence\nq = 1 − 1/(3β) ,\n\nζ = 2/(1 − 3β) .\n\n(291)\n\nIn the deep matter era one has |β| ≫ 1, so that q ≃ 1 and ζ ≃ 0. The deviation from (q, ζ) = (1, 0) appears when |β|\ndecreases to the order of unity, i.e., when the Universe enters the epoch of cosmic acceleration.\nIn order to confront dark energy models with the observations of weak lensing, it may be convenient to introduce\nthe following quantity [355]\nΣ ≡ q(1 − ζ/2) .\n\n(292)\n\nFrom Eqs. (288) and (289) we find that the effective gravitational potential ψ = Φ − Ψ associated with weak lensing\nobservations can be expressed as\nψ = 8πG(a2 /k 2 )ρm δm Σ .\n\n(293)\n\nIn the DGP model and in Brans-Dicke theory we have Σ = 1 and Σ = 1/F , respectively. In (modified) Galileon\ntheories the term Σ is of more complicated forms, see e.g., Eq. (285).\nThe effect of modified gravity theories manifests itself in weak lensing observations in at least two ways. One is the\nmultiplication of the term Σ on the r.h.s. of Eq. (293). Another is the modification of the evolution of δm . The latter\ndepends on two parameters q and ζ, or equivalently, Σ and ζ. Thus two parameters (Σ, ζ) will be useful to detect\nsignatures of modified gravity theories from future surveys of weak lensing.\n\n\f46\nVIII.\n\nCONCLUSIONS\n\nWe have reviewed modified gravitational models of dark energy responsible for the cosmic acceleration today. In\naddition to cosmological constraints such as the presence of a matter era followed by a stable de Sitter solution, we\nrequire that the models satisfy local gravity constraints. There are two mechanisms for the recovery of GR behavior\nin the regions of high density. The first one is the chameleon mechanism in which the mass of a scalar-field degree\nof freedom depends on the matter density in the surrounding environment. The chameleon mechanism can be at\nwork in f (R) gravity and Brans-Dicke theory, as long as the field potential is designed to have a large mass in the\nregions of high density. The second one is the Vainshtein mechanism in which the nonlinear effect of scalar-field self\ninteractions leads to the recovery of GR at small distances. This can be applied to the DGP braneworld model and\nGalileon gravity.\nThe modified gravity models can give rise to the phantom equation of state of dark energy (wDE < −1) without\nhaving ghosts, tachyons, and Laplacian instabilities. The deviation of wDE from that in the ΛCDM model (wDE = −1)\nis not so significant in the models based on f (R) gravity and Brans-Dicke theory, so these models can be compatible\nwith the observational constraints at the background cosmology fairly easily. On the other hand, the tracker solution\nin covariant Galileon gravity, which has wDE = −2 during the matter era, is disfavored from the joint data analysis\nof SN Ia, BAO, and CMB shift parameters. However the late-time tracking without a significant deviation from\nwDE = −1 is allowed observationally.\nIn order to confront the modified gravity models with the observations of large-scale structure, CMB, and weak\nlensing, we have also discussed the evolution of matter density perturbations. In the models based on f (R) and\nBrans-Dicke theories there is a \"General Relativistic\" regime in which the field is heavy such that M 2 ≫ k 2 /a2 .\nAt late times this is followed by a \"scalar-tensor\" regime (M 2 ≪ k 2 /a2 ) in which the gravitational law is modified\nfrom that in General Relativity. In√Brans-Dicke theory the evolution of matter perturbations during the matter era\n2\nchanges from δm ∝ t2/3 to δm ∝ t( 25+48Q −1)/6 , where Q is related to the Brans-Dicke parameter via the relation\n3 + 2ωBD = 1/(2Q2 ). The effective gravitational couplings Geff in the DGP and Galileon models are independent\nof the wave numbers k. This reflects the fact that the field is massless in those models. In the DGP model the\ngrowth rate of δm is smaller than that in the ΛCDM, which is associated with the appearance of ghosts. In (modified)\nGalileon gravity, a non-trivial relation between the effective gravitational potential ψ and the matter perturbation δm\nleads to the extra growth of ψ.\nWe summarize the current status of each modified gravity model of dark energy.\n• (i) In f (R) gravity there are some viable dark energy models such as (45), (46), and (48), which can be consistent\nwith both cosmological and local gravity constraints. For the models (45) and (46) the local gravity constraints\ncan be satisfied for n > 0.9 under the chameleon mechanism. If we use the criterion that the difference between\nthe spectral indices between the matter power spectrum and the CMB spectrum is smaller than 0.05, then we\nobtain the bound n ≥ 2. In these models the initial conditions of perturbations need to be chosen such that\nthe oscillating mode does not dominate over the matter-induced mode in the early Universe. This is associated\nwith a weak singularity problem about the divergence of the mass squared M 2 ≃ F/(3f,RR ) for R → ∞, but it\ncan be circumvented by including higher-curvature terms such as R2 to the Lagrangian.\n• (ii) In Brans-Dicke theory, even if the coupling Q is of the order of unity, it is possible to design field potentials\nconsistent with both cosmological and local gravity constraints. One of the examples is the potential (98),\nwhich is motivated by the f (R) models\n√ (45) and (46). Depending on the couplings Q the growth of matter\nperturbations is different (Q = −1/ 6 in metric f (R) gravity). From the observational constraints on the\ngrowth rate of δm , |Q| is required to be smaller than the order of 1.\n• (iii) In the DGP model the self-acceleration is realized through the gravitational leakage to the extra dimension,\nbut the joint analysis using the data of SN Ia, BAO, and CMB shift parameters shows that the model is in\ntension with observations. Moreover the linear perturbation theory beyond the Vainshtein radius shows that\nthe model contains a ghost mode with the effective Brans-Dicke parameter ωBD smaller than −3/2. However,\nthe modification of the DGP model like Cascading gravity can alleviate this problem.\n• (iv) In covariant Galileon gravity there is a tracker that attracts solutions with different initial conditions to a\ncommon trajectory. The joint observational constraints at the background cosmology shows that the late-time\ntracking solutions are favored from the data. Cosmological perturbations in (modified) Galileon theories exhibit\npeculiar features because of non-trivial relations between the effective gravitational potential ψ and the matter\nperturbation δm .\n• (v) The dark energy models described by a Gauss-Bonnet term with a scalar coupling F (φ)G do not satisfy\nboth cosmological and local gravity constraints. The generalized Gauss-Bonnet model in which the Lagrangian\n\n\f47\ndensity is given by R/2 + f (G) is plagued by a serious problem of the Laplacian instability in the presence of\nmatter fluids. There are some viable Lorentz-violating models of dark energy in which the phantom equation\nof state can be realized without having ghosts, tachyons, and Laplacian instabilities.\nWe hope to find some signatures for the modification of gravity in future high-precision observations. This will shed\nnew light on the nature of dark energy.\nAcknowledgments\n\nThe author thanks the organizers of Second TRR33 Winter School held in Passo del Tonale (Italy) for inviting him\nto have a series of lectures about modified gravity models of dark energy. He is also grateful to Georg Wolschin for\nproviding him an opportunity to write a lecture note in a book published by Springer. This note is one of the five\nchapters in the book \"Lectures on Cosmology: Accelerated Expansion of the Universe (Lecture Notes in Physics)\".\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n[14]\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n[21]\n[22]\n[23]\n[24]\n[25]\n[26]\n[27]\n[28]\n[29]\n[30]\n[31]\n[32]\n[33]\n[34]\n[35]\n[36]\n[37]\n[38]\n[39]\n[40]\n[41]\n[42]\n[43]\n[44]\n\nA. G. Riess et al., Astron. J. 116, 1009 (1998); Astron. J. 117, 707 (1999).\nS. Perlmutter et al., Astrophys. J. 517, 565 (1999).\nD. N. Spergel et al., Astrophys. J. Suppl. 148, 175 (2003).\nE. Komatsu et al., arXiv:1001.4538 [astro-ph.CO].\nD. J. Eisenstein et al. [SDSS Collaboration], Astrophys. J. 633, 560 (2005).\nW. J. Percival et al., Mon. Not. Roy. Astron. Soc. 401, 2148 (2010).\nV. Sahni and A. A. Starobinsky, Int. J. Mod. Phys. D 9, 373 (2000).\nS. M. Carroll, Living Rev. Rel. 4, 1 (2001).\nT. Padmanabhan, Phys. Rept. 380, 235 (2003).\nP. J. E. Peebles and B. Ratra, Rev. Mod. Phys. 75, 559 (2003).\nV. Sahni, Lect. Notes Phys. 653, 141 (2004).\nE. J. Copeland, M. Sami and S. Tsujikawa, Int. J. Mod. Phys. D 15, 1753 (2006).\nS. Nojiri and S. D. Odintsov, eConf C0602061, 06 (2006) [Int. J. Geom. Meth. Mod. Phys. 4, 115 (2007)].\nR. P. Woodard, Lect. Notes Phys. 720, 403 (2007).\nR. Durrer and R. Maartens, Gen. Rel. Grav. 40, 301 (2008).\nF. S. N. Lobo, arXiv:0807.1640 [gr-qc].\nT. P. Sotiriou and V. Faraoni, Rev. Mod. Phys. 82, 451 (2010).\nP. Brax, arXiv:0912.3610 [astro-ph.CO].\nA. De Felice and S. Tsujikawa, Living Rev. Rel. 13, 3 (2010).\nS. Tsujikawa, arXiv:1004.1493 [astro-ph.CO] (Published in 'Dark Matter and Dark Energy: A Challenge for Modern\nCosmology' Series: Astrophysics and Space Science Library, Vol. 370, ISBN: 978-90-481-8684-6, 2011).\nS. Weinberg, Rev. Mod. Phys. 61, 1 (1989).\nY. Fujii, Phys. Rev. D 26, 2580 (1982).\nL. H. Ford, Phys. Rev. D 35, 2339 (1987).\nC. Wetterich, Nucl. Phys B. 302, 668 (1988).\nB. Ratra and J. Peebles, Phys. Rev D 37, 321 (1988).\nR. R. Caldwell, R. Dave and P. J. Steinhardt, Phys. Rev. Lett. 80, 1582 (1998).\nT. Chiba, T. Okabe and M. Yamaguchi, Phys. Rev. D 62, 023511 (2000).\nC. Armendariz-Picon, V. F. Mukhanov and P. J. Steinhardt, Phys. Rev. Lett. 85, 4438 (2000).\nS. M. Carroll, Phys. Rev. Lett. 81, 3067 (1998).\nC. F. Kolda and D. H. Lyth, Phys. Lett. B 458, 197 (1999).\nS. Capozziello, Int. J. Mod. Phys. D 11, 483, (2002).\nS. Capozziello, V. F. Cardone, S. Carloni and A. Troisi, Int. J. Mod. Phys. D, 12, 1969 (2003).\nS. M. Carroll, V. Duvvuri, M. Trodden and M. S. Turner, Phys. Rev. D 70, 043528 (2004).\nS. Nojiri and S. D. Odintsov, Phys. Rev. D 68, 123512 (2003).\nL. Amendola, Phys. Rev. D 60, 043501 (1999).\nJ. P. Uzan, Phys. Rev. D 59, 123510 (1999).\nT. Chiba, Phys. Rev. D 60, 083508 (1999).\nN. Bartolo and M. Pietroni, Phys. Rev. D 61 023518 (2000).\nF. Perrotta, C. Baccigalupi and S. Matarrese, Phys. Rev. D 61, 023507 (2000).\nA. Riazuelo and J. P. Uzan, Phys. Rev. D 66, 023525 (2002).\nG. R. Dvali, G. Gabadadze and M. Porrati, Phys. Lett. B 485, 208 (2000).\nA. Nicolis, R. Rattazzi and E. Trincherini, Phys. Rev. D 79, 064036 (2009).\nS. Nojiri, S. D. Odintsov and M. Sasaki, Phys. Rev. D 71, 123509 (2005).\nS. Nojiri and S. D. Odintsov, Phys. Lett. B 631, 1 (2005).\n\n\f48\n[45]\n[46]\n[47]\n[48]\n[49]\n[50]\n[51]\n[52]\n[53]\n[54]\n[55]\n[56]\n[57]\n[58]\n[59]\n[60]\n[61]\n[62]\n[63]\n[64]\n[65]\n[66]\n[67]\n[68]\n[69]\n[70]\n[71]\n[72]\n[73]\n[74]\n[75]\n[76]\n[77]\n[78]\n[79]\n[80]\n[81]\n[82]\n[83]\n[84]\n[85]\n[86]\n[87]\n[88]\n[89]\n[90]\n[91]\n[92]\n[93]\n[94]\n[95]\n[96]\n[97]\n[98]\n[99]\n[100]\n[101]\n[102]\n[103]\n[104]\n[105]\n[106]\n[107]\n[108]\n\nM. E. Soussa and R. P. Woodard, Gen. Rel. Grav. 36, 855 (2004).\nG. Allemandi, A. Borowiec and M. Francaviglia, Phys. Rev. D 70, 103503 (2004).\nD. A. Easson, Int. J. Mod. Phys. A 19, 5343 (2004).\nR. Dick, Gen. Rel. Grav. 36, 217 (2004).\nS. Carloni, P. K. S. Dunsby, S. Capozziello and A. Troisi, Class. Quant. Grav. 22, 4839 (2005).\nA. W. Brookfield, C. van de Bruck and L. M. H. Hall, Phys. Rev. D 74, 064028 (2006).\nT. Chiba, Phys. Lett. B 575, 1 (2003).\nA. D. Dolgov and M. Kawasaki, Phys. Lett. B 573, 1 (2003).\nG. J. Olmo, Phys. Rev. D 72, 083505 (2005).\nI. Navarro and K. Van Acoleyen, JCAP 0702, 022 (2007).\nS. M. Carroll, I. Sawicki, A. Silvestri and M. Trodden, New J. Phys. 8, 323 (2006).\nR. Bean, D. Bernat, L. Pogosian, A. Silvestri and M. Trodden, Phys. Rev. D 75, 064020 (2007).\nY. S. Song, W. Hu and I. Sawicki, Phys. Rev. D 75, 044004 (2007).\nI. Sawicki and W. Hu, Phys. Rev. D 75, 127502 (2007).\nL. Amendola, D. Polarski and S. Tsujikawa, Phys. Rev. Lett. 98, 131302 (2007).\nL. Amendola, D. Polarski and S. Tsujikawa, Int. J. Mod. Phys. D 16, 1555 (2007).\nT. Faulkner, M. Tegmark, E. F. Bunn and Y. Mao, Phys. Rev. D 76, 063505 (2007).\nL. Amendola, R. Gannouji, D. Polarski and S. Tsujikawa, Phys. Rev. D 75, 083504 (2007).\nB. Li and J. D. Barrow, Phys. Rev. D 75, 084010 (2007).\nL. Amendola and S. Tsujikawa, Phys. Lett. B 660, 125 (2008).\nS. Fay, S. Nesseris and L. Perivolaropoulos, Phys. Rev. D 76, 063504 (2007).\nL. Pogosian and A. Silvestri, Phys. Rev. D 77, 023503 (2008).\nN. Deruelle, M. Sasaki and Y. Sendouda, Phys. Rev. D 77, 124024 (2008).\nW. Hu and I. Sawicki, Phys. Rev. D 76, 064004 (2007).\nA. A. Starobinsky, JETP Lett. 86, 157 (2007).\nS. A. Appleby and R. A. Battye, Phys. Lett. B 654, 7 (2007).\nS. Tsujikawa, Phys. Rev. D 77, 023507 (2008).\nE. V. Linder, Phys. Rev. D 80, 123528 (2009).\nC. Brans and R. H. Dicke, Phys. Rev. 124, 925 (1961).\nJ. O'Hanlon, Phys. Rev. Lett. 29, 137 (1972).\nL. Amendola, Phys. Rev. D 62, 043511 (2000).\nS. Tsujikawa, K. Uddin, S. Mizuno, R. Tavakol and J. Yokoyama, Phys. Rev. D 77, 103009 (2008).\nJ. A. R. Cembranos, Phys. Rev. D 73, 064029 (2006).\nS. Capozziello and S. Tsujikawa, Phys. Rev. D 77, 107501 (2008).\nR. Gannouji, B. Moraes, D. F. Mota, D. Polarski, S. Tsujikawa and H. A. Winther, Phys. Rev. D 82, 124006 (2010).\nP. Brax, C. van de Bruck, A. C. Davis and D. J. Shaw, Phys. Rev. D 78, 104021 (2008).\nJ. Khoury and A. Weltman, Phys. Rev. Lett. 93, 171104 (2004).\nJ. Khoury and A. Weltman, Phys. Rev. D 69, 044026 (2004).\nC. Deffayet, G. R. Dvali, G. Gabadadze and A. I. Vainshtein, Phys. Rev. D 65, 044026 (2002).\nM. Porrati, Phys. Lett. B 534, 209 (2002).\nA. I. Vainshtein, Phys. Lett. B 39, 393 (1972).\nA. Nicolis and R. Rattazzi, JHEP 0406, 059 (2004).\nK. Koyama and R. Maartens, JCAP 0601, 016 (2006).\nD. Gorbunov, K. Koyama and S. Sibiryakov, Phys. Rev. D 73, 044016 (2006).\nI. Sawicki and S. M. Carroll, arXiv:astro-ph/0510364.\nM. Fairbairn and A. Goobar, Phys. Lett. B 642 , 432 (2006).\nR. Maartens and E. Majerotto, Phys. Rev. D 74, 023004 (2006).\nU. Alam and V. Sahni, Phys. Rev. D 73, 084024 (2006).\nY. S. Song, I. Sawicki and W. Hu, Phys. Rev. D 75, 064003 (2007).\nJ. Q. Xia, Phys. Rev. D 79, 103527 (2009).\nC. Deffayet, G. Esposito-Farese and A. Vikman, Phys. Rev. D 79, 084003 (2009).\nC. Deffayet, S. Deser and G. Esposito-Farese, Phys. Rev. D 80, 064015 (2009).\nA. De Felice and S. Tsujikawa, Phys. Rev. Lett. 105, 111301 (2010).\nA. De Felice and S. Tsujikawa, arXiv:1008.4236 [hep-th].\nC. Schimd, J. P. Uzan and A. Riazuelo, Phys. Rev. D 71, 083512 (2005).\nM. Ishak, A. Upadhye and D. N. Spergel, Phys. Rev. D 74, 043513 (2006).\nL. Knox, Y. S. Song and J. A. Tyson, Phys. Rev. D 74, 023512 (2006).\nD. Huterer and E. V. Linder, Phys. Rev. D 75, 023519 (2007).\nP. Zhang, M. Liguori, R. Bean and S. Dodelson, Phys. Rev. Lett. 99, 141302 (2007).\nS. Wang, L. Hui, M. May and Z. Haiman, Phys. Rev. D 76, 063503 (2007).\nB. Jain and P. Zhang, Phys. Rev. D 78, 063503 (2008).\nS. F. Daniel, R. R. Caldwell, A. Cooray and A. Melchiorri, Phys. Rev. D 77, 103513 (2008).\nE. Bertschinger and P. Zukin, Phys. Rev. D 78, 024015 (2008).\nS. Carloni, P. K. S. Dunsby and A. Troisi, Phys. Rev. D 77, 024024 (2008).\n\n\f49\n[109]\n[110]\n[111]\n[112]\n[113]\n[114]\n[115]\n[116]\n[117]\n[118]\n[119]\n[120]\n[121]\n[122]\n[123]\n[124]\n[125]\n[126]\n[127]\n[128]\n[129]\n[130]\n[131]\n[132]\n[133]\n[134]\n[135]\n[136]\n[137]\n[138]\n[139]\n[140]\n[141]\n[142]\n[143]\n[144]\n[145]\n[146]\n[147]\n[148]\n[149]\n[150]\n[151]\n[152]\n[153]\n[154]\n[155]\n[156]\n[157]\n[158]\n[159]\n[160]\n[161]\n[162]\n[163]\n[164]\n[165]\n[166]\n[167]\n[168]\n[169]\n[170]\n[171]\n[172]\n\nK. N. Ananda, S. Carloni and P. K. S. Dunsby, Class. Quant. Grav. 26, 235018 (2009).\nG. B. Zhao, L. Pogosian, A. Silvestri and J. Zylberberg, Phys. Rev. D 79, 083513 (2009).\nY. S. Song and K. Koyama, JCAP 0901, 048 (2009).\nY. S. Song and O. Dore, JCAP 0903, 025 (2009).\nS. A. Thomas, F. B. Abdalla and J. Weller, Mon. Not. Roy. Astron. Soc. 395, 197 (2009).\nA. Borisov and B. Jain, Phys. Rev. D 79, 103506 (2009).\nJ. Guzik, B. Jain and M. Takada, Phys. Rev. D 81, 023503 (2010).\nP. Brax, C. van de Bruck, A. C. Davis and D. Shaw, JCAP 1004, 032 (2010).\nR. Bean and M. Tangmatitham, Phys. Rev. D 81, 083534 (2010).\nR. Reyes, R. Mandelbaum, U. Seljak, T. Baldauf, J. E. Gunn, L. Lombriser and R. E. Smith, Nature 464, 256 (2010).\nG. B. Zhao et al., Phys. Rev. D 81, 103510 (2010).\nS. F. Daniel et al., Phys. Rev. D 81, 123508 (2010).\nS. F. Daniel and E. V. Linder, Phys. Rev. D 82, 103523 (2010).\nZ. Girones, A. Marchetti, O. Mena, C. Pena-Garay and N. Rius, JCAP 1011, 004 (2010).\nT. Narikawa and K. Yamamoto, Phys. Rev. D 81, 043528 (2010).\nK. Yamamoto, G. Nakamura, G. Hutsi, T. Narikawa and T. Sato, Phys. Rev. D 81, 103517 (2010).\nL. Lombriser, A. Slosar, U. Seljak and W. Hu, arXiv:1003.3009 [astro-ph.CO].\nY. S. Song, G. B. Zhao, D. Bacon, K. Koyama, R. C. Nichol and L. Pogosian, arXiv:1011.2106 [astro-ph.CO].\nA. Palatini, Rend. Circ. Mat. Palermo 43, 203 (1919).\nF. W. Hehl and G. D. Kerling, Gen. Rel. Grav. 9, 691 (1978).\nT. P. Sotiriou and S. Liberati, Annals Phys. 322, 935 (2007).\nT. P. Sotiriou and S. Liberati, J. Phys. Conf. Ser. 68, 012022 (2007).\nS. Capozziello, R. Cianci, C. Stornaiolo and S. Vignolo, Class. Quant. Grav. 24, 6417 (2007).\nM. Ferraris, M. Francaviglia and I. Volovich, Class. Quant. Grav. 11, 1505 (1994).\nD. N. Vollick, Phys. Rev. D 68, 063510 (2003).\nD. N. Vollick, Class. Quant. Grav. 21, 3813 (2004).\nE. E. Flanagan, Class. Quant. Grav. 21, 417 (2003).\nE. E. Flanagan, Phys. Rev. Lett. 92, 071101 (2004).\nE. E. Flanagan, Class. Quant. Grav. 21, 3817 (2004).\nX. Meng and P. Wang, Class. Quant. Grav. 20, 4949 (2003).\nX. Meng and P. Wang, Class. Quant. Grav. 21, 951 (2004).\nX. H. Meng and P. Wang, Phys. Lett. B 584, 1 (2004).\nS. Nojiri and S. D. Odintsov, Gen. Rel. Grav. 36, 1765 (2004).\nT. P. Sotiriou, Class. Quant. Grav. 23, 1253 (2006).\nT. P. Sotiriou, Phys. Rev. D 73, 063515 (2006).\nM. Amarzguioui, O. Elgaroy, D. F. Mota and T. Multamaki, Astron. Astrophys. 454, 707 (2006).\nS. Fay, R. Tavakol and S. Tsujikawa, Phys. Rev. D 75, 063509 (2007).\nA. Iglesias, N. Kaloper, A. Padilla and M. Park, Phys. Rev. D 76, 104001 (2007).\nG. J. Olmo, Phys. Rev. Lett. 98, 061101 (2007).\nG. J. Olmo, Phys. Rev. D 77, 084021 (2008).\nG. J. Olmo, arXiv:0910.3734 [gr-qc].\nE. Barausse, T. P. Sotiriou and J. C. Miller, Class. Quant. Grav. 25, 105008 (2008).\nT. Koivisto and H. Kurki-Suonio, Class. Quant. Grav. 23, 2355 (2006).\nT. Koivisto, Phys. Rev. D 73, 083517 (2006).\nB. Li and M. C. Chu, Phys. Rev. D 74, 104010 (2006).\nB. Li, K. C. Chan and M. C. Chu, Phys. Rev. D 76, 024002 (2007).\nS. Tsujikawa, K. Uddin and R. Tavakol, Phys. Rev. D 77, 043007 (2008).\nA. A. Starobinsky, Phys. Lett. B 91, 99 (1980).\nS. V. Ketov, Phys. Lett. B 692, 272 (2010).\nS. V. Ketov and A. A. Starobinsky, arXiv:1011.0240 [hep-th].\nV. Muller, H. J. Schmidt and A. A. Starobinsky, Phys. Lett. B 202, 198 (1988).\nV. Faraoni, Phys. Rev. D 72, 061501 (2005).\nV. Faraoni and S. Nadeau, Phys. Rev. D 72, 124005 (2005).\nS. Capozziello, S. Nojiri, S. D. Odintsov and A. Troisi, Phys. Lett. B 639, 135 (2006).\nK. Bamba, C. Q. Geng and S. Tsujikawa, Phys. Lett. B 688, 101 (2010).\nD. F. Torres, Phys. Rev. D 66, 043522 (2002).\nB. Boisseau, G. Esposito-Farese, D. Polarski and A. A. Starobinsky, Phys. Rev. Lett. 85, 2236 (2000).\nG. Esposito-Farese and D. Polarski, Phys. Rev. D 63, 063504 (2001).\nH. Motohashi, A. A. Starobinsky and J. Yokoyama, Prog. Theor. Phys. 123, 887 (2010).\nK. Bamba, C. Q. Geng and C. C. Lee, JCAP 1008, 021 (2010).\nK. Bamba, C. Q. Geng and C. C. Lee, JCAP 1011, 001 (2010).\nK. Bamba, C. Q. Geng, S. Nojiri and S. D. Odintsov, Phys. Rev. D 79, 083014 (2009).\nK. Bamba, Open Astron. J. 3, 13 (2010).\nA. Dev, D. Jain, S. Jhingan, S. Nojiri, M. Sami and I. Thongkool, Phys. Rev. D 78, 083515 (2008).\n\n\f50\n[173]\n[174]\n[175]\n[176]\n[177]\n[178]\n[179]\n[180]\n[181]\n[182]\n[183]\n[184]\n[185]\n[186]\n[187]\n[188]\n[189]\n[190]\n[191]\n[192]\n[193]\n[194]\n[195]\n[196]\n[197]\n[198]\n[199]\n[200]\n[201]\n[202]\n[203]\n[204]\n[205]\n[206]\n[207]\n[208]\n[209]\n[210]\n[211]\n[212]\n[213]\n[214]\n[215]\n[216]\n[217]\n[218]\n[219]\n[220]\n[221]\n[222]\n[223]\n[224]\n[225]\n[226]\n[227]\n[228]\n[229]\n[230]\n[231]\n[232]\n[233]\n[234]\n[235]\n[236]\n\nM. Martinelli, A. Melchiorri and L. Amendola, Phys. Rev. D 79, 123516 (2009).\nV. F. Cardone, A. Diaferio and S. Camera, arXiv:0907.4689 [astro-ph.CO].\nA. Ali, R. Gannouji, M. Sami and A. A. Sen, Phys. Rev. D 81, 104029 (2010).\nS. Capozziello, V. F. Cardone and A. Troisi, Phys. Rev. D 71, 043503 (2005).\nT. Multamaki and I. Vilja, Phys. Rev. D 73, 024018 (2006).\nA. de la Cruz-Dombriz and A. Dobado, Phys. Rev. D 74, 087501 (2006).\nX. Wu and Z. H. Zhu, Phys. Lett. B 660, 293 (2008).\nS. Carloni, R. Goswami and P. K. S. Dunsby, arXiv:1005.1840 [gr-qc].\nJ. M. Bardeen, Phys. Rev. D 22, 1882 (1980).\nJ. c. Hwang, Class. Quant. Grav. 14, 3327 (1997).\nA. De Felice, S. Mukohyama and S. Tsujikawa, Phys. Rev. D 82, 023524 (2010).\nG. J. Olmo, Phys. Rev. Lett. 95, 261102 (2005).\nG. J. Olmo, Phys. Rev. D 72, 083505 (2005).\nV. Faraoni, Phys. Rev. D 74, 023529 (2006).\nA. L. Erickcek, T. L. Smith and M. Kamionkowski, Phys. Rev. D 74, 121501 (2006).\nT. Chiba, T. L. Smith and A. L. Erickcek, Phys. Rev. D 75, 124014 (2007).\nK. Kainulainen, J. Piilonen, V. Reijonen and D. Sunhede, Phys. Rev. D 76, 024020 (2007).\nK. Kainulainen and D. Sunhede, Phys. Rev. D 78, 063511 (2008).\nK. i. Maeda, Phys. Rev. D 39, 3159 (1989).\nT. Tamaki and S. Tsujikawa, Phys. Rev. D 78, 084028 (2008).\nC. M. Will, Living Rev. Rel. 9, 3 (2005).\nT. Kobayashi and K. i. Maeda, Phys. Rev. D 78, 064019 (2008).\nT. Kobayashi and K. i. Maeda, Phys. Rev. D 79, 024009 (2009).\nS. Tsujikawa, T. Tamaki and R. Tavakol, JCAP 0905, 020 (2009).\nA. Upadhye and W. Hu, Phys. Rev. D 80, 064002 (2009).\nE. Babichev and D. Langlois, Phys. Rev. D 80, 121501 (2009).\nE. Babichev and D. Langlois, Phys. Rev. D 81, 124051 (2010).\nA. Cooney, S. DeDeo and D. Psaltis, Phys. Rev. D 82, 064033 (2010).\nB. Bertotti, L. Iess and P. Tortora, Nature 425, 374 (2003).\nL. Perivolaropoulos, JCAP 0510, 001 (2005).\nR. Gannouji, D. Polarski, A. Ranquet and A. A. Starobinsky, JCAP 0609, 016 (2006).\nS. Nesseris and L. Perivolaropoulos, JCAP 0701, 018 (2007).\nJ. Martin, C. Schimd and J. P. Uzan, Phys. Rev. Lett. 96, 061303 (2006).\nA. Billyard, A. Coley and J. Ibanez, Phys. Rev. D 59, 023507 (1999).\nE. Gunzig, V. Faraoni, A. Figueiredo, T. M. Rocha and L. Brenig, Class. Quant. Grav. 17, 1783 (2000).\nV. Acquaviva and L. Verde, JCAP 0712, 001 (2007).\nN. Agarwal and R. Bean, Class. Quant. Grav. 25, 165001 (2008).\nL. Jarv, P. Kuusk and M. Saal, Phys. Rev. D 78, 083530 (2008).\nS. Carloni, S. Capozziello, J. A. Leach and P. K. S. Dunsby, Class. Quant. Grav. 25, 035008 (2008).\nP. Brax, C. van de Bruck, A. C. Davis, J. Khoury and A. Weltman, Phys. Rev. D 70, 123518 (2004).\nD. J. Kapner et al., Phys. Rev. Lett. 98, 021101 (2007).\nR. Nagata, T. Chiba and N. Sugiyama, Phys. Rev. D 69, 083512 (2004).\nL. Randall and R. Sundrum, Phys. Rev. Lett. 83, 3370 (1999).\nL. Randall and R. Sundrum, Phys. Rev. Lett. 83, 4690 (1999).\nG. R. Dvali and G. Gabadadze, Phys. Rev. D 63 (2001), 065007.\nC. Deffayet, Phys. Lett. B 502 (2001), 199.\nC. Deffayet, G. R. Dvali and G. Gabadadze, Phys. Rev. D 65 (2002), 044023.\nV. Sahni and Y. Shtanov, JCAP 0311, 014 (2003).\nP. Binetruy, C. Deffayet and D. Langlois, Nucl. Phys. B 565, 269 (2000).\nP. Binetruy, C. Deffayet, U. Ellwanger and D. Langlois, Phys. Lett. B 477, 285 (2000).\nT. Shiromizu, K. i. Maeda and M. Sasaki, Phys. Rev. D 62, 024012 (2000).\nA. G. Riess et al. [Supernova Search Team Collaboration], Astrophys. J. 607, 665 (2004).\nP. Astier et al. [The SNLS Collaboration], Astron. Astrophys. 447, 31 (2006).\nD. N. Spergel et al. [WMAP Collaboration], Astrophys. J. Suppl. 170, 377 (2007).\nJ. Q. Xia, Phys. Rev. D 79, 103527 (2009).\nA. Gruzinov, New Astron. 10, 311 (2005).\nM. A. Luty, M. Porrati and R. Rattazzi, JHEP 0309, 029 (2003).\nM. Kolanovic, M. Porrati and J. W. Rombouts, Phys. Rev. D 68, 064018 (2003).\nM. Kolanovic, Phys. Rev. D 67, 106002 (2003).\nC. de Rham, G. Dvali, S. Hofmann, J. Khoury, O. Pujolas, M. Redi and A. J. Tolley, Phys. Rev. Lett. 100, 251603 (2008).\nC. de Rham, S. Hofmann, J. Khoury and A. J. Tolley, JCAP 0802, 011 (2008).\nN. Agarwal, R. Bean, J. Khoury and M. Trodden, Phys. Rev. D 81, 084020 (2010).\nC. de Rham, J. Khoury and A. J. Tolley, Phys. Rev. D 81, 124027 (2010).\nR. Gannouji and M. Sami, Phys. Rev. D 82, 024011 (2010).\n\n\f51\n[237]\n[238]\n[239]\n[240]\n[241]\n[242]\n[243]\n[244]\n[245]\n[246]\n[247]\n[248]\n[249]\n[250]\n[251]\n[252]\n[253]\n[254]\n[255]\n[256]\n[257]\n[258]\n[259]\n[260]\n[261]\n[262]\n[263]\n[264]\n[265]\n[266]\n[267]\n[268]\n[269]\n[270]\n[271]\n[272]\n[273]\n[274]\n[275]\n[276]\n[277]\n[278]\n[279]\n[280]\n[281]\n[282]\n[283]\n[284]\n[285]\n[286]\n[287]\n[288]\n[289]\n[290]\n[291]\n[292]\n[293]\n[294]\n[295]\n[296]\n[297]\n[298]\n[299]\n[300]\n\nN. Chow and J. Khoury, Phys. Rev. D 80, 024037 (2009).\nF. P. Silva and K. Koyama, Phys. Rev. D 80, 121301 (2009).\nT. Kobayashi, H. Tashiro and D. Suzuki, Phys. Rev. D 81, 063513 (2010).\nT. Kobayashi, Phys. Rev. D 81, 103533 (2010).\nC. de Rham and A. J. Tolley, JCAP 1005, 015 (2010).\nA. De Felice and S. Tsujikawa, JCAP 1007, 024 (2010).\nP. Creminelli, A. Nicolis and E. Trincherini, JCAP 1011, 021 (2010).\nA. Padilla, P. M. Saffin and S. Y. Zhou, JHEP 1012, 031 (2010); arXiv:1008.0745 [hep-th].\nC. Deffayet, S. Deser and G. Esposito-Farese, Phys. Rev. D 82, 061501 (2010).\nT. Kobayashi, M. Yamaguchi and J. Yokoyama, Phys. Rev. Lett. 105, 231302 (2010).\nC. Deffayet, O. Pujolas, I. Sawicki and A. Vikman, JCAP 1010, 026 (2010).\nK. Hinterbichler, M. Trodden and D. Wesley, arXiv:1008.1305 [hep-th].\nA. Ali, R. Gannouji and M. Sami, arXiv:1008.1588 [astro-ph.CO].\nM. Andrews, K. Hinterbichler, J. Khoury and M. Trodden, arXiv:1008.4128 [hep-th].\nG. L. Goon, K. Hinterbichler and M. Trodden, arXiv:1008.4580 [hep-th].\nS. Mizuno and K. Koyama, Phys. Rev. D 82, 103518 (2010).\nC. Burrage, C. de Rham, D. Seery and A. J. Tolley, arXiv:1009.2497 [hep-th].\nE. Babichev, arXiv:1009.2921 [hep-th].\nS. Y. Zhou, arXiv:1011.0863 [hep-th].\nR. Kimura and K. Yamamoto, arXiv:1011.2006 [astro-ph.CO].\nK. Kamada, T. Kobayashi, M. Yamaguchi and J. Yokoyama, arXiv:1012.4238 [astro-ph.CO].\nK. Hirano, arXiv: 1012.5451 [astro-ph.CO].\nS. Nesseris, A. De Felice and S. Tsujikawa, arXiv:1010.0407 [astro-ph.CO] (Physical Review D, to appear).\nL. D. Faddeev and R. Jackiw, Phys. Rev. Lett. 60, 1692 (1988).\nA. De Felice and T. Suyama, JCAP 0906, 034 (2009); Phys. Rev. D 80, 083523 (2009).\nM. Hicken et al., Astrophys. J. 700, 1097 (2009).\nR. Amanullah et al., Astrophys. J. 716, 712 (2010).\nH. Akaike, IEEE Trans. Auto. Control, 19, 716 (1974).\nA. R. Liddle, Mon. Not. Roy. Astron. Soc. 351, L49 (2004).\nG. Schwarz, Annals of Statistics, 5, 461 (1978).\nE. Kretschmann, Ann. Phys, 53, 575-614 (1917).\nK. S. Stelle, Gen. Rel. Grav. 9, 353 (1978).\nN. H. Barth and S. M. Christensen, Phys. Rev. D 28, 1876 (1983).\nM. Gasperini and G. Veneziano, Phys. Rept. 373, 1 (2003).\nA. Nunez and S. Solganik, Phys. Lett. B 608, 189 (2005).\nS. M. Carroll, A. De Felice, V. Duvvuri, D. A. Easson, M. Trodden and M. S. Turner, Phys. Rev. D 71, 063513 (2005).\nG. Calcagni, S. Tsujikawa and M. Sami, Class. Quant. Grav. 22, 3977 (2005).\nM. Sami, A. Toporensky, P. V. Tretjakov and S. Tsujikawa, Phys. Lett. B 619, 193 (2005).\nT. Chiba, JCAP 0503, 008 (2005).\nO. Mena, J. Santiago and J. Weller, Phys. Rev. Lett. 96, 041103 (2006).\nJ. D. Barrow and S. Hervik, Phys. Rev. D 74, 124017 (2006).\nG. Cognola, M. Gastaldi and S. Zerbini, Int. J. Theor. Phys. 47, 898 (2008).\nL. M. Sokolowski, Class. Quant. Grav. 24, 3391 (2007).\nA. De Felice, M. Hindmarsh and M. Trodden, JCAP 0608, 005 (2006).\nG. Calcagni, B. de Carlos and A. De Felice, Nucl. Phys. B 752, 404 (2006).\nT. Koivisto and D. F. Mota, Phys. Lett. B 644, 104 (2007).\nS. Tsujikawa and M. Sami, JCAP 0701, 006 (2007).\nT. Koivisto and D. F. Mota, Phys. Rev. D 75, 023518 (2007).\nI. P. Neupane, Class. Quant. Grav. 23, 7493 (2006).\nB. M. Leith and I. P. Neupane, JCAP 0705, 019 (2007).\nA. K. Sanyal, Phys. Lett. B 645, 1 (2007).\nS. Kawai, M. a. Sakagami and J. Soda, Phys. Lett. B 437, 284 (1998).\nZ. K. Guo, N. Ohta and S. Tsujikawa, Phys. Rev. D 75, 023520 (2007).\nL. Amendola, C. Charmousis and S. C. Davis, JCAP 0612, 020 (2006).\nG. Cognola, E. Elizalde, S. Nojiri, S. D. Odintsov and S. Zerbini, Phys. Rev. D 73, 084007 (2006).\nB. Li, J. D. Barrow and D. F. Mota, Phys. Rev. D 76, 044027 (2007).\nA. De Felice and S. Tsujikawa, Phys. Lett. B 675, 1 (2009).\nS. Y. Zhou, E. J. Copeland and P. M. Saffin, JCAP 0907, 009 (2009).\nM. Mohseni, Phys. Lett. B 682, 89 (2009).\nJ. Moldenhauer, M. Ishak, J. Thompson and D. A. Easson, Phys. Rev. D 81, 063514 (2010).\nA. De Felice and S. Tsujikawa, Phys. Rev. D 80, 063516 (2009).\nA. De Felice, D. F. Mota and S. Tsujikawa, Phys. Rev. D 81, 023532 (2010).\nA. De Felice, J. M. Gerard and T. Suyama, Phys. Rev. D 82, 063526 (2010).\nA. De Felice and T. Suyama, arXiv:1010.3886 [astro-ph.CO].\n\n\f52\n[301]\n[302]\n[303]\n[304]\n[305]\n[306]\n[307]\n[308]\n[309]\n[310]\n[311]\n[312]\n[313]\n[314]\n[315]\n[316]\n[317]\n[318]\n[319]\n[320]\n[321]\n[322]\n[323]\n[324]\n[325]\n[326]\n[327]\n[328]\n[329]\n[330]\n[331]\n[332]\n[333]\n[334]\n[335]\n[336]\n[337]\n[338]\n[339]\n[340]\n[341]\n[342]\n[343]\n[344]\n[345]\n[346]\n[347]\n[348]\n[349]\n[350]\n[351]\n[352]\n[353]\n[354]\n[355]\n[356]\n[357]\n[358]\n[359]\n[360]\n[361]\n[362]\n[363]\n[364]\n\nM. Alimohammadi and A. Ghalee, Phys. Rev. D 79, 063006 (2009).\nM. Alimohammadi and A. Ghalee, Phys. Rev. D 80, 043006 (2009).\nE. Elizalde, R. Myrzakulov, V. V. Obukhov and D. Saez-Gomez, Class. Quant. Grav. 27, 095007 (2010).\nA. De Felice and T. Tanaka, Prog. Theor. Phys. 124, 503 (2010).\nN. Arkani-Hamed, H. C. Cheng, M. A. Luty and S. Mukohyama, JHEP 0405, 074 (2004).\nV. A. Rubakov, Theor. Math. Phys. 149, 1651 (2006) [arXiv:hep-th/0604153].\nM. Libanov, V. Rubakov, E. Papantonopoulos, M. Sami and S. Tsujikawa, JCAP 0708, 010 (2007).\nV. A. Rubakov and P. G. Tinyakov, Phys. Usp. 51, 759 (2008).\nB. M. Gripaios, JHEP 0410, 069 (2004).\nM. V. Libanov and V. A. Rubakov, JHEP 0508, 001 (2005).\nP. Horava, Phys. Rev. D 79, 084008 (2009).\nS. M. Carroll and E. A. Lim, Phys. Rev. D 70, 123525 (2004).\nJ. M. Cline and L. Valcarcel, JHEP 0403, 032 (2004).\nN. Arkani-Hamed, H. C. Cheng, M. Luty and J. Thaler, JHEP 0507, 029 (2005).\nH. C. Cheng, M. A. Luty, S. Mukohyama and J. Thaler, JHEP 0605, 076 (2006).\nS. Kanno and J. Soda, Phys. Rev. D 74, 063505 (2006).\nP. G. Ferreira, B. M. Gripaios, R. Saffari and T. G. Zlosnik, Phys. Rev. D 75, 044014 (2007).\nF. Piazza and S. Tsujikawa, JCAP 0407, 004 (2004).\nE. N. Saridakis, Eur. Phys. J. C 67, 229 (2010).\nM. i. Park, JCAP 1001, 001 (2010).\nH. Kodama and M. Sasaki, Prog. Theor. Phys. Suppl. 78, 1 (1984).\nV. F. Mukhanov, H. A. Feldman and R. H. Brandenberger, Phys. Rept. 215, 203 (1992).\nB. A. Bassett, S. Tsujikawa and D. Wands, Rev. Mod. Phys. 78, 537 (2006).\nL. A. Kofman, V. F. Mukhanov and D. Y. Pogosian, Sov. Phys. JETP 66, 433 (1987).\nJ. c. Hwang and H. r. Noh, Phys. Rev. D 65, 023512 (2002).\nJ. C. Hwang and H. Noh, Phys. Rev. D 71, 063536 (2005).\nA. A. Starobinsky, JETP Lett. 68, 757 (1998) [Pisma Zh. Eksp. Teor. Fiz. 68, 721 (1998)].\nS. Tsujikawa, Phys. Rev. D 76, 023514 (2007).\nJ. c. Hwang, H. Noh and C. G. Park, arXiv:1012.0885 [astro-ph.CO].\nA. de la Cruz-Dombriz, A. Dobado and A. L. Maroto, Phys. Rev. D 77, 123515 (2008).\nH. Motohashi, A. A. Starobinsky and J. Yokoyama, Int. J. Mod. Phys. D 18, 1731 (2009).\nS. A. Appleby and R. A. Battye, JCAP 0805, 019 (2008).\nA. V. Frolov, Phys. Rev. Lett. 101, 061103 (2008).\nS. A. Appleby, R. A. Battye and A. A. Starobinsky, JCAP 1006, 005 (2010).\nV. Miranda, S. E. Joras, I. Waga and M. Quartin, Phys. Rev. Lett. 102, 221101 (2009).\nI. Thongkool, M. Sami, R. Gannouji and S. Jhingan, Phys. Rev. D 80, 043523 (2009).\nA. de la Cruz-Dombriz, A. Dobado and A. L. Maroto, Phys. Rev. Lett. 103, 179001 (2009).\nS. Nojiri and S. D. Odintsov, Phys. Lett. B 657, 238 (2007).\nS. Nojiri and S. D. Odintsov, Phys. Rev. D 77, 026007 (2008).\nS. Tsujikawa and T. Tatekawa, Phys. Lett. B 665, 325 (2008).\nP. J. E. Peebles, Large-Scale Structure of the Universe, Princeton University Press (1980).\nL. M. Wang and P. J. Steinhardt, Astrophys. J. 508, 483 (1998).\nE. V. Linder, Phys. Rev. D 72, 043529 (2005).\nR. Gannouji, B. Moraes and D. Polarski, JCAP 0902, 034 (2009).\nS. Tsujikawa, R. Gannouji, B. Moraes and D. Polarski, Phys. Rev. D 80, 084044 (2009).\nH. Oyaizu, Phys. Rev. D 78, 123523 (2008).\nH. Oyaizu, M. Lima and W. Hu, Phys. Rev. D 78, 123524 (2008).\nF. Schmidt, M. V. Lima, H. Oyaizu and W. Hu, Phys. Rev. D 79, 083518 (2009).\nG. B. Zhao, B. Li and K. Koyama, arXiv:1011.1257 [astro-ph.CO].\nH. F. Stabenau and B. Jain, Phys. Rev. D 74, 084007 (2006).\nI. Laszlo and R. Bean, Phys. Rev. D 77, 024048 (2008).\nW. Hu and I. Sawicki, Phys. Rev. D 76, 104043 (2007).\nK. Koyama, A. Taruya and T. Hiramatsu, Phys. Rev. D 79, 123512 (2009).\nT. Tatekawa and S. Tsujikawa, JCAP 0809, 009 (2008).\nL. Amendola, M. Kunz and D. Sapone, JCAP 0804, 013 (2008).\nY. S. Song, H. Peiris and W. Hu, Phys. Rev. D 76, 063517 (2007).\nF. Schmidt, Phys. Rev. D 78, 043002 (2008).\nP. McDonald et al., astro-ph/0407377.\nM. Viel and M. G. Haehnelt, Mon. Not. Roy. Astron. Soc. 365, 231 (2006).\nA. Lue, R. Scoccimarro and G. D. Starkman, Phys. Rev. D 69, 124015 (2004).\nK. Koyama and F. P. Silva, Phys. Rev. D 75, 084040 (2007).\nK. Hinterbichler, A. Nicolis and M. Porrati, JHEP 0909, 089 (2009).\nK. Yamamoto, D. Parkinson, T. Hamana, R. C. Nichol and Y. Suto, Phys. Rev. D 76, 023504 (2007).\nA. De Felice, R. Kase and S. Tsujikawa, arXiv:1011.6132 [astro-ph.CO].\n\n\f"}