{"id": "http://arxiv.org/abs/1102.1171v2", "guidislink": true, "updated": "2011-10-15T23:16:58Z", "updated_parsed": [2011, 10, 15, 23, 16, 58, 5, 288, 0], "published": "2011-02-06T17:08:46Z", "published_parsed": [2011, 2, 6, 17, 8, 46, 6, 37, 0], "title": "Constraints on heterotic M-theory from s-cobordism", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1102.0228%2C1102.5271%2C1102.5681%2C1102.2223%2C1102.5207%2C1102.4729%2C1102.5379%2C1102.4154%2C1102.1025%2C1102.1771%2C1102.3064%2C1102.0285%2C1102.0569%2C1102.5148%2C1102.5620%2C1102.1657%2C1102.0061%2C1102.5036%2C1102.5663%2C1102.0011%2C1102.3336%2C1102.3504%2C1102.5363%2C1102.4877%2C1102.4735%2C1102.4404%2C1102.3282%2C1102.2466%2C1102.3310%2C1102.3420%2C1102.2543%2C1102.5702%2C1102.1255%2C1102.2153%2C1102.5149%2C1102.3657%2C1102.4631%2C1102.3921%2C1102.2308%2C1102.5671%2C1102.1655%2C1102.4832%2C1102.2243%2C1102.5059%2C1102.3656%2C1102.2014%2C1102.3183%2C1102.3676%2C1102.1437%2C1102.3658%2C1102.1395%2C1102.2779%2C1102.2598%2C1102.5655%2C1102.5122%2C1102.2045%2C1102.0014%2C1102.3312%2C1102.5615%2C1102.4956%2C1102.0484%2C1102.5218%2C1102.1830%2C1102.0625%2C1102.2744%2C1102.4326%2C1102.4515%2C1102.3463%2C1102.1672%2C1102.3275%2C1102.0545%2C1102.0676%2C1102.3338%2C1102.3294%2C1102.0041%2C1102.4075%2C1102.5747%2C1102.3980%2C1102.4004%2C1102.1797%2C1102.3903%2C1102.1658%2C1102.4514%2C1102.2694%2C1102.3759%2C1102.1171%2C1102.3252%2C1102.1277%2C1102.3034%2C1102.1060%2C1102.5199%2C1102.2768%2C1102.2382%2C1102.2698%2C1102.4833%2C1102.2747%2C1102.2405%2C1102.2136%2C1102.2133%2C1102.3618%2C1102.4854&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Constraints on heterotic M-theory from s-cobordism"}, "summary": "We interpret heterotic M-theory in terms of h-cobordism, that is the\neleven-manifold is a product of the ten-manifold times an interval is\ntranslated into a statement that the former is a cobordism of the latter which\nis a homtopy equivalence. In the non-simply connected case, which is important\nfor model building, the interpretation is then in terms of s-cobordism, so that\nthe cobordism is a simple-homotopy equivalence. This gives constraints on the\npossible cobordisms depending on the fundamental groups and hence provides a\ncharacterization of possible compactification manifolds using the Whitehead\ngroup-- a quotient of algebraic K-theory of the integral group ring of the\nfundamental group-- and a distinguished element, the Whitehead torsion. We also\nconsider the effect on the dynamics via diffeomorphisms and general dimensional\nreduction, and comment on the effect on F-theory compactifications.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1102.0228%2C1102.5271%2C1102.5681%2C1102.2223%2C1102.5207%2C1102.4729%2C1102.5379%2C1102.4154%2C1102.1025%2C1102.1771%2C1102.3064%2C1102.0285%2C1102.0569%2C1102.5148%2C1102.5620%2C1102.1657%2C1102.0061%2C1102.5036%2C1102.5663%2C1102.0011%2C1102.3336%2C1102.3504%2C1102.5363%2C1102.4877%2C1102.4735%2C1102.4404%2C1102.3282%2C1102.2466%2C1102.3310%2C1102.3420%2C1102.2543%2C1102.5702%2C1102.1255%2C1102.2153%2C1102.5149%2C1102.3657%2C1102.4631%2C1102.3921%2C1102.2308%2C1102.5671%2C1102.1655%2C1102.4832%2C1102.2243%2C1102.5059%2C1102.3656%2C1102.2014%2C1102.3183%2C1102.3676%2C1102.1437%2C1102.3658%2C1102.1395%2C1102.2779%2C1102.2598%2C1102.5655%2C1102.5122%2C1102.2045%2C1102.0014%2C1102.3312%2C1102.5615%2C1102.4956%2C1102.0484%2C1102.5218%2C1102.1830%2C1102.0625%2C1102.2744%2C1102.4326%2C1102.4515%2C1102.3463%2C1102.1672%2C1102.3275%2C1102.0545%2C1102.0676%2C1102.3338%2C1102.3294%2C1102.0041%2C1102.4075%2C1102.5747%2C1102.3980%2C1102.4004%2C1102.1797%2C1102.3903%2C1102.1658%2C1102.4514%2C1102.2694%2C1102.3759%2C1102.1171%2C1102.3252%2C1102.1277%2C1102.3034%2C1102.1060%2C1102.5199%2C1102.2768%2C1102.2382%2C1102.2698%2C1102.4833%2C1102.2747%2C1102.2405%2C1102.2136%2C1102.2133%2C1102.3618%2C1102.4854&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We interpret heterotic M-theory in terms of h-cobordism, that is the\neleven-manifold is a product of the ten-manifold times an interval is\ntranslated into a statement that the former is a cobordism of the latter which\nis a homtopy equivalence. In the non-simply connected case, which is important\nfor model building, the interpretation is then in terms of s-cobordism, so that\nthe cobordism is a simple-homotopy equivalence. This gives constraints on the\npossible cobordisms depending on the fundamental groups and hence provides a\ncharacterization of possible compactification manifolds using the Whitehead\ngroup-- a quotient of algebraic K-theory of the integral group ring of the\nfundamental group-- and a distinguished element, the Whitehead torsion. We also\nconsider the effect on the dynamics via diffeomorphisms and general dimensional\nreduction, and comment on the effect on F-theory compactifications."}, "authors": ["Hisham Sati"], "author_detail": {"name": "Hisham Sati"}, "author": "Hisham Sati", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.nuclphysb.2011.08.006", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1102.1171v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1102.1171v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "19 pages, references added, expanded discussion on relating torsion\n  to phenomenology, published version", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.AG", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.GT", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1102.1171v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1102.1171v2", "journal_reference": "Nucl.Phys.B853:739-759,2011", "doi": "10.1016/j.nuclphysb.2011.08.006", "fulltext": "Constraints on heterotic M-theory from s-cobordism\nHisham Sati\n\n∗\n\narXiv:1102.1171v2 [hep-th] 15 Oct 2011\n\nDepartment of Mathematics\nUniversity of Maryland\nCollege Park, MD 20742\nAbstract\nWe interpret heterotic M-theory in terms of h-cobordism, that is the eleven-manifold is a product of\nthe ten-manifold times an interval is translated into a statement that the former is a cobordism of the\nlatter which is a homtopy equivalence. In the non-simply connected case, which is important for model\nbuilding, the interpretation is then in terms of s-cobordism, so that the cobordism is a simple-homotopy\nequivalence. This gives constraints on the possible cobordisms depending on the fundamental groups and\nhence provides a characterization of possible compactification manifolds using the Whitehead group– a\nquotient of algebraic K-theory of the integral group ring of the fundamental group– and a distinguished\nelement, the Whitehead torsion. We also consider the effect on the dynamics via diffeomorphisms and\ngeneral dimensional reduction, and comment on the effect on F-theory compactifications.\n\nContents\n1 Introduction\n\n1\n\n2 Heterotic M-theory as an h-cobordism and s-cobordism\n\n3\n\n3 The Whitehead group and Whitehead torsion\n3.1 The Whitehead group . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n3.2 Whitehead torsion . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n\n4\n4\n6\n\n4\n\n8\n\nFurther examples in heterotic M-theory\n\n5 Dynamical aspects\n11\n5.1 Automorphisms . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 11\n5.2 Compactification . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 13\n\n1\n\nIntroduction\n\nA major goal of string theory is to provide a unification of fundamental interactions. This includes constructing the standard model via string compactifications [31], most notably via heterotic M-theory [35]\n[36]. Eleven-dimensional spacetime is taken to be an interval I times a ten-manifold M 10 , and with the two\nboundaries each supporting an E8 gauge theory. One of the boundaries is called the hidden sector and the\nother is the visible sector, in which the structure group is broken down to a realistic symmetry group. The\nten-manifold M 10 is typically taken to be Minkowski space R1,3 times a Calabi-Yau threefold X 6 . In the\nvisible sector one usually works with SU(5) or SO(10) ⊂ E8 and breaks this group further (at least in principle) to the standard model group (ideally) SU(3)×SU(2)×U(1). Physical and mathematical constraints on\nthe (Calabi-Yau) manifold X 6 and bundles on X 6 are recently reviewed in [33].\n∗ e-mail: hsati@math.umd.edu\nCurrent address: Department of Mathematics, University of Pittsburgh, 139 University Place, Pittsburgh, PA 15260.\n\n1\n\n\fWilson lines are needed to break the gauge group from the grand unified (GUT) group to the standard model group [15] [66]. In order to introduce Wilson lines, the manifolds M 10 must have a nontrivial\nfundamental group. Starting with a simply connected Calabi-Yau manifold, one gets a smooth non-simply\nconnected Calabi-Yau manifold by dividing by a freely acting discrete symmetry X 6 7→ X 6 /Γ, where Γ is a\ndiscrete group of finite order |Γ|, and the resulting fundamental group is π1 (X 6 /Γ) = Γ. Important choices\nfor the finite group include Γ = Z2 , which breaks SU(5) down to SU(3)×SU(2)×U(1), and Γ = Z3 × Z3 or\nZ6 , which break SO(10) down to SU(3)×SU(2)×U(1)2 [31].\nA major area of research involves choosing Γ so that one gets the standard model, not just as far as\nthe symmetry groups are concerned but also accounting for example for correct generations and spectra of\nparticles. A sampler of fundamental groups of Calabi-Yau threefolds X 6 applied in the heterotic setting\ninclude: Z2 [8], Z2 × Z2 [24], Z3 × Z3 [14] [12], Z8 × Z8 constructed in [32] on which rank 5 bundles are\nconstructed in [3], abelian surface fibrations over CP 1 with (abelianization of) fundamental group Zn ×Zn are\nconsidered in [56] [23], complete intersection Calabi-Yau manifolds with fundamental groups which include\n[16] Z3 , Z3 × Z2 , Z3 × Z3 , Z5 , Z5 × Z2 , Z5 × Z5 , and the quaternion group Q8 , the latter being closely related\nto construction in [7] of Calabi-Yau threefolds with nonabelian fundamental groups, roughly speaking a\nsemidirect product of Z8 with a quaternion group. Torsion curves, important for instanton corrections to\nthe heterotic minimally supersymmetric standard model (MSSM), are studied in [13] for the quintic as well\nas for threefolds with fundamental groups Z3 × Z3 .\nAlmost all known Calabi-Yau threefolds are simply connected. For example, only 16 out of about 500\nmillion hypersurfaces in complex 4-dimensional toric varieties have nontrivial fundamental groups, and the\nonly groups which occur are Z2 , Z3 or Z5 [5]. All elliptically fibered Calabi-Yau threefolds are simply\nconnected, with the exception of fibrations over an Enriques base. In [25] elliptic fibrations without section,\ni.e. torus bundles, with nontrivial fundamental group are constructed. Another class of examples with\nno section is the Schoen family [55] which are fiber products of two rational elliptic surfaces. Free finite\ngroup actions on these are classified (under certain conditions) [9] giving fundamental groups π1 (X) ∈\n{Z2 , Z3 , Z4 , Z2 × Z2 , Z5 , Z6 , Z2 × Z4 , Z3 × Z3 }. † In another class of threefolds, the complete intersections in\nproducts of projective spaces, an exhaustive search [10] of the 7890 such threefolds leads to many interesting\nfundamental groups including Zi (for i = 2, 3, 4, 5, 6, 8, 10, 12), Z2 × Zj (for j = 2, 4, 8, 10), Z4 × Zk (for\nk = 4, 8), Z5 × Z5 , Z8 × Z8 , as well as semidirect products Z3 ⋊ Z4 , Z4 ⋊ Z4 , Z5 × Z10 and groups involving\nthe quaternion group Q8 , namely Z2 × Q8 , Z2 × Z2 × Q8 , Z4 ⋊ Q8 , Z8 ⋊ Q8 (for a complete list see [10]).\nIn this paper we seek constraints on the possible fundamental groups coming from global considerations,\nnamely from looking at the relation between the heterotic boundary and bounding M-theory. We first\ninterpret this relation as a cobordism which connects one boundary component to the other through the\neleven-dimensional bulk. We take one of the two boundary components and the bulk to be of the same\nhomotopy type. It is natural to ask when such cobordisms are trivial, that is when are they of product (or\n\"cylinder\") form, as is usually the case in heterotic M-theory. When the fundamental groups of both the\neleven-manifold Y 11 and the ten-manifold M 10 are trivial then we consider the cobordism as an h-cobordism\n(h is for homotopy). When the fundamental groups are equal but nontrivial then we view heterotic M-theory\nas an s-cobordism (s is for simple homotopy). Since the dimension of the nontrivial part of M 10 , namely\nthe Calabi-Yau threefold, is six then the h-cobordism [46] and the s-cobordism [38] [45] [61] theorems can be\napplied. In both cases we are assuming that inclusions of the boundaries in Y 11 are homotopy equivalences.\nThe case when π1 (Y 11 ) is nontrivial is discussed extensively in [52] in relation the partition functions and to\ntype IIA string theory.\nThe obstruction to finding a cobordism that is of the cylinder type is the Whitehead torsion of the\ninclusion τ (Y 11 , M 10 ), which is an element of the Whitehead group of the fundamental group Wh(π1 (M 10 )).\nThe Whitehead group is extensively studied and is well-known for finite groups (see [48]), which is the case\nwe mainly study as such groups seem to be the most interesting for model building. Given our identification\n†A\n\nfree quotient of the manifold corresponding to Z3 × Z3 by the quaternion group is given in [16].\n\n2\n\n\fof heterotic M-theory as an s-cobordism, we are able to identify fundamental groups that allow trivial\ncobordisms from the ones which do not. We view this as providing global consistency constraints on heterotic\ncompactifications in view for model building.\nWe summarize the main point of this article with\nTheorem 1 Consider heterotic M-theory with the E8 heterotic string theory on each of the two the boundary\ncomponents. Then\n(i). M-theory is an s-cobordism for one of the two connected components of the boundary.\n(ii). Consistency requires the Whitehead torsion, in the Whitehead group of the integral group ring of the\nfundamental group of the boundary component, to vanish.\nSince the use of h- and s-cobordism and the Whitehead torsion is novel in the context of heterotic Mtheory and is perhaps not widely known in theoretical physics in general, we choose to take an expository\nroute to arrive at our conclusions. We provide the description of heterotic M-theory in terms of h and\ns-cobordism in section 2. Then in section 3 we look at constraints on the fundamental group, coming\nfrom the Whitehead group in section 3.1 and from the Whitehead torsion in section 3.2. We provide many\nexamples along the way and then in section 4 we consider representative examples explicitly appearing in\nmodel building. We then consider the dynamical aspects in section 5, emphasizing the main points of this\narticle. We first consider automorphisms, including diffeomorphisms and issues of orientation, in section 5.1,\nand then we consider dynamical aspects of compactifications in section 5.2.\n\n2\n\nHeterotic M-theory as an h-cobordism and s-cobordism\n\nIn this section we set up heterotic M-theory as a cobordism, first as an h-cobordism and then as s-cobordism.\nViewed from M-theory the data involves an eleven-dimensional manifold Y 11 which is a product [0, 1] × M 10\ntogether with an E8 bundle on each of M 10 ×{0} and M 10 ×{1}. We will consider this from a ten-dimenional\npoint of view, where we will have a cobordism taking one boundary component to the other.\nH-cobordism. A compact connected eleven-manifold Y 11 whose boundary ∂Y 11 is the disjoint union of\ntwo closed manifolds M 10 and M ′10 , ∂Y 11 = M 10 ∪ M ′10 , is called an h-cobordism, provided the inclusions\nof M 10 into Y 11 and of M ′10 into Y 11 are both homotopy equivalences. The pair (Y 11 , M 10 ) is called a\nh-cobordism with base M 10 and top M ′10 . A smooth h-cobordism is one where Y 11 is a smooth manifold. A\ntrivial or product h-cobordism is of the form M 10 × [0, 1]. If Y 11 is simply-connected, then the h-cobordism\ntheorem can be applied (see [46]) to give that Y 11 is diffeomorphic to the product M 10 × [0, 1]. This is the\nconfiguration that is usually considered in heterotic M-theory [35] [36].\nWe can consider a more detailed description, which will be useful in section 3.2 and section 5. An\neleven-dimensional cobordism (Y 11 ; M010 , f0 , M110 , f1 ) consists of a compact oriented\nY 11 ,\n` eleven-manifold\n10\n10\n11\n11\n11\ntwo closed ten-manifolds M0 and M1 , a disjoint decomposition ∂Y = ∂0 Y\n∂1 Y of the boundary\n∂Y 11 of Y 11 and orientation-preserving diffeomorphisms f0 : M010 → ∂0 Y 11 and f1 : (M110 )− → ∂1 Y 11 .\nBy X − we mean the manifold X taken with the opposite orientation. On the boundary ∂Y 11 we use the\norientation with respect to the decomposition T Y 11 = T ∂Y 11 ⊕ R coming from an inward normal field to the\nboundary. If ∂0 Y 11 = M010 , ∂1 Y 11 = (M110 )− , and f0 and f1 are the identity maps, then the h-cobordism\ncan be referred to as (Y 11 ; ∂0 Y 11 , ∂1 Y 11 ). An h-cobordism over M010 is trivial if it is diffeomorphic relative\nM010 to the trivial h-cobordism (M010 × [0, 1]; M010 × {0}, (M010 × {1})− ).\nThe fundamental group. The h-cobordism theorem can be applied only when the fundamental group is\ntrivial. Next we consider the more interesting case when the fundamental group is not necessarily trivial. We\nwill assume that π1 (Y 11 ) ∼\n= π1 (M 10 ). The fundamental group functor takes products to products, that is, the\nfundamental group is multiplicative. For M 10 = R1,3 × X, we have π1 (M 10 ) ∼\n= π1 (R1,3 ) × π1 (X) ∼\n= π1 (X), so\n3\n\n\fthat the fundamental group of M 10 is determined by that of the Calabi-Yau threefold X. The generalization\nfrom Minkowski to other four-dimensional spacetimes gives an obvious modification, which depends on\nwhether or not the latter is simply connected. Next we consider the appropriate description of heterotic\nM-theory when π1 (M 10 ) 6= 0. By our assumption, this is equivalent to taking π1 (Y 11 ) 6= 0, considered in\n[52].\nS-cobordism. Let M 10 be a connected compact 10-manifold with fundamental group Γ, and consider the\nfamily F of all h-cobordisms built on M 10 . These are connected compact 11-manifolds Y 11 with exactly two\nboundary components, one of which is M 10 and the other of which is some other manifold M ′10 such that\nY 11 is homotopy equivalent to both M 10 and M ′10 . There is a map τ : F → Wh(Γ) called the Whitehead\ntorsion which induces a natural one-to-one correspondence from F / ∼ to Wh(Γ), where ∼ is the equivalence\nrelation induced by diffeomorphisms Y 11 → Y ′11 which are the identity on M 10 . If Y 11 is the \"trivial\"\nh-cobordism Y 11 = M 10 × [0, 1], then τ (Y 11 ) = 1. This is an application of the Barden-Mazur-Stallings\ntheorem [38] [45] [61] (see [51] for a review).\nIf the fundamental group Γ is such its Whitehead group Wh(Γ) is trivial, then certainly the Whitehead\ntorsion will vanish and we are back to the case of an h-cobordism. Consequently, Y 11 is diffeomorphic (relative\nM 10 ) to a product M 10 × [0, 1]. In particular, the other boundary component M ′10 is diffeomorphic to M 10 .\nThere is a bijection, given by the Whitehead torsion τ (Y 11 , M 10 ), between the set of diffeomorphism classes\nof h-cobordisms (Y 11 , M 10 ) with a given base M 10 and the set Wh(π1 (M 10 )). The cylinder corresponds to\n0 under this bijection. We will consider this in much more detail in the following sections.\nNote that there are several versions of the the s-cobordism (and h-cobordism) theorem depending on the\ncategory of spaces within which we are working; for example we could work with homeomorphisms rather\nthan diffeomorphisms (but here we are assuming all spaces to be smooth). However, if we start with a\nhomotopy equivalence then we might not be able to extend it to a diffeomorphism. Consider a large class\nof manifolds called aspherical, which are ones for which all homotopy groups vanish except the first one, i.e.\nthe fundamental group. Let Y and M be aspherical spaces and let α : π1 (M ) → π1 (Y ) be an isomorphism.\nThen, by the Theorem of Hurewicz, α is induced by a homotopy equivalence. It is an open conjecture of\nBorel from 1955 that this can be extended to a homeomorphism. The strengthening to smooth manifolds\nfails [20].\nNote that we can work in category of spaces other than that of smooth manifolds, since the h- and scobordism arguments work for piecewise linear (PL) and topological spaces. This implies, for example, that\norbifolds are also included in our discussion, for which we would choose the category of topological spaces.\n\n3\n\nThe Whitehead group and Whitehead torsion\n\nWe now consider the Whitehead group and Whitehead torsion in our setting of heterotic M-theory via\nalgebraic K-theory of the group ring of the fundamental group and give the main properties which are useful\nfor us.\n\n3.1\n\nThe Whitehead group\n\nAlgebraic K-theory roughly characterizes how, in passing from a field to an arbitrary ring, notions of linear\nalgebra related to the general linear group and vector spaces might extend. One measure of failure of such\ne 1 (R) be the cokernel of the\nan extension is K1 (R), the algebraic K-theory of an associative ring R. Let K\nmap K1 (Z) → K1 (R) induced by the canonical ring homomorphism Z → R. Since Z is a ring with Euclidean\ne 1 (R)\nalgorithm then the homomorphism det: K1 (Z) → {±}, given by [A] 7→ det(A), is a bijection. Hence K\nis the quotient of K1 (R) by a cyclic group of order two generated by the class of the 1 × 1-matrix (−1). We\nare interested in the case when R is a group algebra Z[Γ] of the fundamental group Γ = π1 (M 10 ), that is\nin integer linear combinations of elements of Γ. Define the Whitehead group Wh(Γ) of a group Γ to be the\n4\n\n\fcokernel of the map Γ × {±} → K1 (Z[Γ]) which sends (γ, ±1) to the class of the invertible 1 × 1-matrix (±γ).\nIn other words, Wh(Γ) is the quotient of K1 (Z[Γ]) by the image of {±γ : γ ∈ Γ}, that is\nWh(Γ) = K1 (Z[Γ])/{±γ : γ ∈ Γ} .\n\n(3.1)\n\nThe zero element 0 ∈ Wh(Γ) is represented by the identity matrix In for any positive integer n.\nNote that one can define the Whitehead group of the fundamental group by choosing a base point, as\nis usual in the fundamental group. However, the end result will be independent of the choice of the base\npoint. Therefore, one should think of π1 (M ) in Wh(π1 (M )) as the fundamental groupoid of M . Note also\nthat the Whitehead group can be viewed either additively or multiplicatively. In the first point of view,\nthis corresponds to adding two cobordisms by connecting one 'cylinder' to another over a ten-dimensional\nsection, while an instance of the second point of view is a 'flip'.\nExample 1. Trivial case. Consider the case when the fundamental group is trivial. Then the group\nalgebra Z[1] = Z is a ring with a Gaussian algorithm, so that the determinant induces an isomorphism\n∼\n=\nK1 (Z) → {±} and the Whitehead group Wh({1}) of the trivial group vanishes. Hence any h-cobordism over\na simply-connected closed M 10 is trivial. Thus, as expected in this case, s-cobordism reduces to h-cobordism.\nExample 2. Finite cyclic groups. Wh(Γ) is torsion-free for a finite cyclic group. For example, Wh(Zp ),\np odd prime, is the free abelian group of rank (p − 3)/2 and Wh(Z2 ) = 0.\nWe will consider many more examples in section 4.\nProperties of the Whitehead group. We are interested in the case when the fundamental group Γ is\na finite group. For such a group the following useful properties hold [47] [2] [48]\n1. Functoriality: Wh(Γ) is a covariant functor of Γ, that is, any homomorphism f : Γ1 → Γ2 induces a\nhomomorphism f∗ : Wh(Γ1 ) → Wh(Γ2 ).\n2. Trivial group: Let Γ = π1 (M ) be trivial. Then from K1 (Z) = Z2 one gets Wh(π1 (M )) = Wh(1) = 1.\nThis is example 1 above.\n3. Low rank: Whitehead showed that Wh(Γ) = 1 if |Γ| ≤ 4. This implies, for instance, that Z2 , Z3 , Z4\nand Z2 × Z2 have trivial Whitehead group and hence lead to (desirable) trivial h-cobordisms.\n4. Rank: By a result of Bass, Wh(Γ) is a finitely generated abelian group of rank r(Γ) − q(Γ), where r(Γ)\nis the number of irreducible real representations of Γ and q(Γ) is the number of irreducible rational\nrepresentations of Γ. Explicitly, q(Γ) is the number of conjugate classes of cyclic subgroups of Γ and\nr(Γ) is the number of conjugate classes of unordered pairs {γ, γ −1}.\n5. Free product: The Whitehead group of a free product is multiplicative, Wh(G∗ H) = Wh(G)⊕ Wh(H).\nUnfortunately, there is no corresponding formula for Cartesian products. For example, Wh(Z3 ) = 0\nand Wh(Z4 ) = 0 but Wh(Z3 × Z4 ) ∼\n= Z. More on this will be discussed in section 4.\nThe torsion subgroup. We have seen above that the Whitehead group of a cyclic group Zp of prime order\np is torsion-free. While these groups form an important class of fundamental groups we are considering, we\nshould consider other cases as well. In particular, there could be groups Γ for which Wh(Γ) is torsion. The\ntorsion in the algebraic K-group is Tor(K1 (Z[Γ])) = (±) × Γab × SK1 (Z[Γ]), where Γab is the abelianization\nof Γ (that is the first homology group H1 (M 10 )) and SK1 (Z[Γ]) = ker(K1 (Z[Γ]) → K1 (Q[Γ])). This kernel\nof the change of coefficients homomorphism is the full torsion subgroup of Wh(Z[Γ]).\n\n5\n\n\fProperties of the torsion subgroup. The torsion subgroup SK1 (Z[Γ]) of Wh(Γ) is highly nontrivial [2]\n[64] [48]. Some of the useful properties are\n1. The torsion subgroup of Wh(Γ) is isomorphic to SK1 (Z[Γ]).\n2. The torsion in Wh(Γ) comes from SL(2, Z[Γ]).\n3. SK1 (Z[Γ]) is non-vanishing for all groups of the form Γ ∼\n= (Zp )n , n ≥ 3 and p an odd prime.\n4. SK1 (Z[Γ]) = 1 if Γ ∼\n= (Z2 )n (any n), or if Γ is\n= Zpn or Zpn × Zp (for any prime p, and any n), if Γ ∼\nany dihedral, quaternion, or semidihedral 2-group.\n5. The classes of finite groups Γ for which Wh(Γ) = 1, or SK1 (Z[Γ]) = 1, are not closed under products.\nThis provides many nontrivial examples using products.\nFor a finitely generated fundamental group Γ the vanishing of the Whitehead group Wh(Γ) is equivalent to\nthe statement that each h-cobordism over a closed connected M 10 is trivial. Knowing that all h-cobordisms\nover a given manifold are trivial is useful, but strong. Alternatively, we could have Wh(Γ) nontrivial yet the\ndistinguished element, the Whitehead torsion τ is zero.\n\n3.2\n\nWhitehead torsion\n\nThe Whitehead torsion, which is essentially a linking matrix for handles in the handle decomposition of the\nmanifold, serves as an obstruction to the reduction of an h-cobordism to a product. We have encountered\nabove many situations where the Whitehead group is not trivial. In certain cases these elements, including\nthe distinguished element given by the Whitehead torsion, can be characterized. This characterization can\nbe geometric due to the realization theorem which says that every Whitehead torsion comes from a manifold\n(see [38]).\nFirst, note that a map f : Y 11 → M010 induces a homomorphism f∗ : Wh(π1 (Y 11 )) → Wh(π1 (M010 )) on\nthe corresponding Whitehead groups such that id∗ = id, (g ◦ f )∗ = g∗ ◦ f∗ , and f ≃ g implies that f∗ = g∗ .\nNext, the Whitehead torsion of our eleven-dimensional h-cobordism (Y 11 ; M010 , f0 , M110 , f1 ) over M010 ,\nτ (Y 11 , M010 ) ∈ Wh(π1 (M010 )) ,\nf0\n\n(3.2)\nι\n\n0\nis defined to be the preimage of the Whitehead torsion τ (M010 −→ ∂0 Y 11 −→\nY 11 ) ∈ Wh(π1 (Y 11 ) under the\n∼\n=\nisomorphism (ι0 ◦ f0 )∗ : Wh(π1 (M010 )) −→ Wh(π1 (Y 11 )), where ι0 : ∂0 Y 11 ֒→ Y 11 is the inclusion (see [39]).\nNext we will consider the simple situation when the diffeomorphisms are the identity.\n\nGeometric definition of Whitehead torsion. There is a description of Whitehead torsion at the level\nof chain complexes [47] [19]. Let W(M 10 ) be the collection of all pairs of finite complexes (Y 11 , M 10 )\nsuch that M 10 is a strong deformation retract of Y 11 . For any two objects (Y111 , M 10 ), (Y211 , M 10 ) ∈\nW define an equivalence (Y111 , M 10 ) ∼ (Y211 , M 10 ) if and only if Y111 and Y211 are simple homotopically\n10\nequivalent relative to the subcomplex M\nWh(M 10 ) = W/ ∼ and let [Y111 , M 10 ] and [Y211 , M 10 ]\nF . Define\n11\n11\n10\n11\nand Y211 identified along the\nbe two classes in Wh(M ). For Y1\nM 10 Y2 , the disjoint union of Y1\n10\ncommon subcomplex M , an abelian\ngroup structure can be defined on the Whitehead group Wh(M 10 ) by\nF\n11\n10\n11\n10\n11\n11\n10\n[Y , M ] ⊕ [Y2 , M ] = [Y1\nM 10 Y2 , M ].\n\nf10 ) of an element (Y 11 , M 10 ) in W can be equipped with the CW-complex\nThe universal cover (Ye 11 , M\nf10 ⊂ Ye 11 is a homotopy equivstructure lifted from the CW-structure of (Y 11 , M 10 ). The inclusion M\nf10 ) be the cellular chain complex of (Ye 11 , M\nf10 ). The covering action of π1 (Y 11 )\nalence. Let C∗ (Ye 11 , M\n11 f10\n11 f10\ne\ne\non (Y , M ) induces an action on C∗ (Y , M ) and makes it a finitely generated free acyclic chain\ncomplex of Z[π1 (Y 11 )]-modules. In addition to the boundary map ∂, there is a contraction map δ of\n6\n\n\ff10 ) such that ∂δ + δ∂ = id and δ 2 = 0. The module homomorphism ∂ + δ :\ndegree +1 on C∗ (Ye 11 , M\nL∞\nL∞\n11\n10\ne 11 , M\nf10 ) is an isomorphism of Z[π1 (Y 11 )]-modules. The image and\ne ,M\nf ) →\ni=0 C2i (Y\ni=0 C2i+1 (Y\nthe range of this homomorphism are finitely generated free modules with a basis we choose coming from\nf10 ). Consider the matrix of this homomorphism ∂ + δ which is an invertible\nthe CW-structure on (Ye 11 , M\nmatrix with entries in Z[π1 (Y 11 )] and hence lies in GL(n, Z[π1 (Y 11 )]) for some n. Now take the image of\nthis matrix in Wh(π1 (Y 11 )) via an isomorphism τ , sending (Y 11 , M 10 ) to Wh(π1 (Y 11 )).\n∂\n\n∂\n\n∂\n\n∂\n\nMore explicitly, let * * * −→ Ci+1 −→ Ci −→ * * * C0 −→ 0 be the complex which calculates the homology\nH∗ (Y 11 , M 10 ; Z[Γ]) of the inclusion M 10 ⊂ Y 11 . Each Ci is a finitely generated free Z[Γ]-module. Up to\norientation and translation by an element in Γ, each Ci has a preferred basis over Z[Γ] coming from the\ni-simplices added to get from M 10 to Y 11 in some triangulation of the universal covering spaces. The group\nZi of i-cycles is the kernel of ∂ : Ci → Ci−1 and the group Bi of i-boundaries is the image of ∂ : Ci+1 → Ci .\nSince M 10 ⊂ Y 11 is a deformation retract, homotopy invariance of homology gives that H∗ = 0, so that\nB∗ = Z∗ . Let Mi ∈ GL(Z[π1 (M 10 )]) be the matrices representing the isomorphism Bi ⊕ Bi−1 ∼\n= Ci coming\nfrom a choice of section 0 → Bi → Ci → Bi−1 → 0. Let [Mi ] ∈ Wh(π1 (M 10 )) be the corresponding\nequivalence classes. The Whitehead torsion is then\nX\nτ (Y 11 , M 10 ) =\n(−1)i [Mi ] ∈ Wh(π1 (M 10 )) .\n(3.3)\nNote that the Whitehead group is identified as a quotient of K1 (Z[Γ]) by the subgroup generated by the\nunits of the form ±γ for γ ∈ Γ = π1 (M010 ). In the present context, this ensures the independence of the\nchoice of Z[Γ]-basis within the cellular equivalence class of Z[Γ]-bases.\nProperties of Whitehead torsion. The Whitehead torsion has existence and uniqueness properties.\n1. Existence. Given α ∈ Wh(π1 (M 10 ), there exists an h-cobordism Y 11 with τ (Y 11 ) = α. This implies that\nif the Whitehead group is nontrivial then we can find a cobordism for every element in that group. In order\nto get a trivial h-cobordism, that is one of cylinder type, we have to make sure that the element Wh(Γ) we\nidentify for our spaces will be the zero element. This is of course not guaranteed to occur.\n2. Uniqueness. τ (Y 11 ) = τ (Y ′11 ) if and only if there exists a diffeomorphism f : Y 11 → Y ′11 such that\nf |M = idM . This tells us that we are allowed to \"deform\" Y 11 in a nice way and still be able to get the\nsame type of cobordism. In particular, for Y 11 with τ (Y 11 ) = 0 we can always find a diffeomorphic Y ′11 for\nwhich the property that the Whitehead torsion is zero is preserved.\nElements of finite order in the Whitehead group. We have seen that the Whitehead group of\nproducts of finite cyclic groups may contain torsion. Elements of finite order can be characterized as follows\n[47]. Consider an orthogonal representation Γ → O(n) of the finite group Γ. This representation gives rise\nto a ring homomorphism ρ : Z[Γ] → Mn (R), where Mn (R) is the algebra of n × n matrices over the real\ne 1 (Z[π]) → K\ne 1 (Mn (R)) ∼\ne 1 (R) ∼\nnumbers. This induces a group homomorphism ρ∗ : K\n= K\n= R+ . Since R+\nhas no elements of finite order then there is the corresponding homomorphism Wh(Γ) → R+ . Therefore, an\nelement ω ∈ Wh(Γ) has finite order if and only if ρ∗ (ω) = 1 for every orthogonal representation ρ of Γ.\nElements of Wh(Γ) as matrices and the representation dimension. Nontrivial elements of the\nWhitehead group can be represented by matrices, usually of small size. The representation dimension of a\ngroup Γ is said to be less than or equal to m, with notation r-dim Γ ≤ m, if every element of Wh(Γ) can\nbe realized as a matrix in GL(m, Z[Γ]). If Γ is finite then r-dim Γ ≤ 2. Furthermore, the representation\ndimension of the finite group Γ satisfies r-dim Γ ≤ 1 if and only if Γ admits no epimorphic mapping onto the\nfollowing (see [57])\n1. the generalized quaternion group,\n2. the binary tetrahedral, octahedral, or icosahedral groups,\n3. and the groups Zp2 × Zp2 , Zp × Zp × Zp , Zp × Z2 × Z2 × Z2 , Z4 × Z2 × Z2 , and Z4 × Z4 , for p a prime.\n7\n\n\fThus r-dim Γ ≤ 1 for all finite simple groups. However, if we take products then the size of the matrix can\ngrow (see expression (4.5) for an explicit matrix).\n\n4\n\nFurther examples in heterotic M-theory\n\nWe have already seen many classes of examples both for the Whitehead group in section 3.1 and for the\nWhitehead torsion in section 3.2. we now provide more examples and in particular ones which appear\nexplicitly in model building (cf. the introduction).\nTori and free abelian groups. The fundamental group of the circle is the free abelian group Z, so\nthat the corresponding Whitehead torsion is zero, Wh(Z) = 0. For the n-torus T n , the fundamental group\nπ1 (T n ) = Zn . This free abelian group of rank n has a trivial Whitehead torsion Wh(π1 (T n )) = 0, since\nWh(Z ⊕ * * * ⊕ Z) = 0 by the multiplicative property of Whitehead torsion under free product (section 3.1).\nIt follows from the theorem of Bass about the rank of the Whitehead group that Wh(Γ) of a free abelian\ngroup Γ is zero if and only if Γ has exponent 1, 2, 3, 4, or 6 [47].\nCyclic groups. Suppose Γ is a finite group. Then Wh(Γ) is finitely generated, and rank(Wh(Γ)) is\nthe difference between the number of irreducible representations of Γ over R and the number of irreducible\nrepresentations of Γ over Q. For Γ a cyclic group Zp of order p, an odd prime, the numbers of representations\nare q(Zp ) = 2 and r(Zp ) = 12 (p + 1), respectively. This implies that Wh(Zp ) is the free abelian group of\nrank (p − 3)/2 and that Wh(Z2 ) = 0. Alternatively, note that Zp has (p − 1)/2 inequivalent two-dimensional\nirreducible representations over R, but one (p − 1)-dimensional irreducible representation over Q (since\nQ[Zp ] ∼\n= Q × Q(ζ), ζ a primitive p-th root of unity, and [Q(ζ) : Q] = p − 1), so rank(Wh(Zp )) = p−1\n2 +1−2 =\n(p − 3)/2. Note that we have already seen that Wh(Zk ) = 0 for k = 2, 3, 4, 6.\nUnits in the group ring. Consider the integral group ring Z[Zp ] of the finite cyclic group Zp and let ζ\nbe a primitive pth root of unity with corresponding group ring Z[ζ]. The pullback square of rings\n/ Z[ζ] ,\n\nZ[Zp ]\n\n(4.1)\n\n\u000f\n/ Fp\n\n\u000f\nZ\n\nwhere Fp is the field with p elements, implies that the (p − 1)st power of any unit in Z[ζ] comes from a unit\nin Z[Zp ]. An example of a unit in Z[ζ] is (ζ + ζ −1 )r . This is invariant under complex conjugation in Z[ζ]\n(this corresponds to invariance under the orientation duality discussed in section 5.1).\nThe quintic and the cyclic group of order 5. The quintic threefold plays an important role as a\nprototype example of compactification on Calabi-Yau manifolds. Consider the one-parameter family of\nquintic threefolds Q := {z15 + z25 + z35 + z45 + z55 + ψ 5 z1 z2 z3 z4 z5 = 0} ⊂ CP 4 . The defining equation is\ninvariant under the Z5 × Z5 ⊂ PGL(5, C) group action\n[z1 : z2 : z3 : z4 : z5 ] 7→ [z2 : z3 : z4 : z5 : z1 ] ,\n\n[z1 : z2 : z3 : z4 : z5 ] 7→ [ζz1 : ζ 2 z2 : ζ 3 z3 : ζ 4 z4 : z5 ] , (4.2)\n\nwhere ζ = e2πi/5 . The fixed points lie on CP4 − Q, so that Q/Z5 and Q/Z5 × Z5 are smooth Calabi-Yau\nthreefolds. The six different Z5 subgroups in Z5 × Z5 can be used. The Whitehead group of Z5 = {t | t5 = 1}\nis Wh(Z5 ) = Z with generator the torsion τ (u) of the unit u = 1 − t + t2 ∈ Z[Z5 ] [47]. The identity\n(t + t−1 − 1)(t2 + t−2 − 1) = 1 indeed shows that u is a unit. The homomorphism α : Z[Z5 ] → C, sending t\nto ζ, also sends {±γ : γ ∈ Γ} to the roots of unity in C, and hence x 7→ |α(x)| defines a homomorphism from\nWh(Z5 ) into R∗+ , the nonzero positive real numbers. Then the map u 7→ 1 − ζ − ζ −1 = 1 − 2 cos(2π/5) can\nbe used to show that no power of u is equal to 1. Indeed, |α(u)| = |1 − 2 cos(2π/5)| ≈ 0.4, so that α defines\n8\n\n\fan element of infinite order in Wh(Z5 ). Note that the unit u is self-conjugate, and that the automorphism\nt 7→ t2 of Z5 carries u to u−1 . In fact, for Γ finite abelian, every element of Wh(Γ) is self-conjugate [47] (see\nthe last paragraph in section 3.2).\nWe see from the example of the quintic that, a priori, there are countably infinitely many elements in the\nWhitehead group of the fundamental group of the quintic. Unless the Whitehead torsion is the zero element,\nthere will be an obstruction to having a trivial h-cobordism and hence to a consistent relation to heterotic\nM-theory. Therefore, it is an interesting problem to compute the Whitehead torsion of the quintic.\nRecall from the end of section 3.1 that the full torsion subgroup of the Whitehead group is given by\nSK1 (Z[Γ]). Therefore, one way to tell that Wh(Γ) is nontrivial is to detect torsion via SK1 (Z[Γ]).\nProducts of abelian groups. We now consider products of abelian groups, in particular of cyclic groups.\n1. Products of groups of even order. For even order, we have already seen that the Whitehead group of the\nlowest rank non-simple group, Z2 × Z2 , is zero. Next we consider products of Z2 with Z4 and so on. We use\nthe\ntwo general\nformulae [48] for the torsion part of the Whitehead group SK1 (Z[(Z2 )k × Z2n ]) ∼\n=\ni\nh following\n\u0001\nk\nn−1\n2\nn\nk\n∼\n⊕r=1 r * (Z2r−1 ) ⊕ [⊕s=2 (Z2s )] and SK1 (Z[(Z2 ) × Z2n ]) = Z2 . For instance, the following cases can\nthen be deduced:\n1. SK1 (Z[Z4 × Z4 ]) ∼\n= Z2 .\n2. SK1 (Z[Z2 × Z2 × Z4 ]) ∼\n= Z2 .\n3. SK1 (Z[(Z2 )3 × Z4 ]) ∼\n= (Z2 )3 × Z4 . This last case is curious in that Wh(Γ) = Γ.\nWe can also use the general formula SK1 (Z[Z4 × Z2n ]) ∼\n= (Z2 )(n−1) to deduce other relevant groups. For\n2\n3\n4\n∼\n∼\nexample, SK1 (Z[Z4 × Z8 ]) ∼\n(Z\n)\n,\nSK\n(Z[Z\n×\nZ\n])\n(Z\n= 2\n1\n4\n16 =\n2 ) , SK1 (Z[Z4 × Z32 ]) = (Z2 ) , etc.\n2. Products of groups of odd order. Next we consider the case when the orders of the groups in the products\nare odd. We will look at groups of the form (Zp )k , Zp2 × Zpn and (Zp )2 × Zpn , as well as combinations\ninvolving three factors, using general results from reference [48].\n(i) The torsion subgroup SK1 (Z[Γ]) is trivial if Γ is cyclic or an elementary 2-group, or of type Zp ⊕ Zpn .\nHowever, SK1 (Z[Γ]) is nontrivial form most abelian groups [2]. If Γ = (Zp )k , p odd, then SK1 (Z[Γ]) is a\n\u0001\nZp -vector space of dimension (pk − 1)/(p − 1) − p+k+1\n. For example, for Γ = (Z3 )3 , the torsion subgroup\np\nis SK1 (Z[(Z3 )3 ]) ∼\n= (Z3 )3 .\n(ii) For p an odd prime, SK1 (Z[Zp2 × Zpn ]) ∼\n= (Z/p)(p−1)(n−1) .\n2\n(iii) For p an odd prime, SK1 (Z[(Zp ) × Zpn ]) ∼\n= (Zp )np(p−1)/2 .\nLet p be an odd prime and Γ an elementary abelian\n\u0001 p-group of rank k. Then [63] SK1 (Z[Γ]) is an elementary\nabelian p-group of rank (pk − 1)/(p − 1) − p+k−1\n. In particular SK1 (Z[Γ]) 6= 0 for k ≥ 3. For example, the\np\nfollowing table can be formed (see also [63])\nΓ\nSK1 (Z[Γ])\nZp2 × Zp2 (p = 3, 5, 7)\n(Zp )p−1\nZp2 × Zp × Zp (p = 3, 5, 7)\n(Zp )p(p−1)\nZ27 × Z9\n(Z3 )4\nZ27 × Z3 × Z3\n(Z3 )9\n15\nZ9 × Z9 × Z3\n(Z3 ) × (Z9 )2\n\n(4.3)\n\nNonabelian groups. We have already seen examples of nonabelian groups in section 3.1. In addition,\n1. Crystallographic groups. SK1 (Z[Γ]) = 0 for Γ a dihedral, the binary tetrahedral or icosahedral group [43]\n[63].\n\n9\n\n\f2. The quaternion group. The Whitehead group Wh(Z[Q8 ]) of the quaternion group Q8 of order 8 is\nisomorphic to ±V , where V = Z2 × Z2 is Klein's 4-group [37]. Note that V is the factor group Q8 /{±},\nwhere {±} is the commutator subgroup of Q8 .\n3. Products with abelian groups. If Γ is any (nonabelian) quaternion or semidihedral 2-group, then for all\nk\nk ≥ 0, the torsion subgroup is SK1 (Z[Γ × (Z2 )k ]) ∼\n= (Z2 )2 −k−1 .\n4. Nonabelian groups with specified abelianization. For instance, if for order |Γ| = 16 the torsion subgroup\nis given by\n\u001a\n1\nif Γab ∼\n= Z2 × Z2 or Z2 × Z2 × Z2\n∼\n(4.4)\nSK1 (Z[Γ]) =\nZ2 if Γab ∼\n= Z4 × Z2 .\nFinding Whitehead groups via transfer. Looking at inclusions tells us about the corresponding Whitehead groups. We will consider several situations.\n1. Consider the cyclic group Z2k+1 of order 2k + 1 as a subgroup of the cyclic group Z4k+2 of order 4k + 2.\nThen the transfer i∗ : Wh(Z4k+2 ) → Wh(Z2k+1 ), corresponding to i : Z2k+1 ֒→ Z4k+2 , is onto for all k [41].\n2. Now consider the inclusion i : Z2k ֒→ Z2k ⊕ Z2 . Then the transfer i∗ : Wh(Z2k ⊕ Z2 ) → Wh(Z2k ) is onto\nif and only if k = 1, 2 or 3 [42]. Since Wh(Z2k ) = 0 for k = 1, 2 and 3, then this means that Wh(Z2k ⊕ Z2 )\nis trivial for these values of k.\n3. Now let Γ be a finite abelian group of odd order. Then i∗ : Wh(Γ ⊕ Z2 ) → Wh(Γ) is onto [42]. This then\ncan tell us whether Γ ⊕ Z2 is trivial from whether or not the Whitehead group of Γ itself is trivial.\nIn general, if Γ → Γ′ is a surjection of finite abelian groups induces a surjection SK1 (Z[Γ]) → SK1 (Z[Γ′ ])\n[2].\nSemidirect products. For finite Γ, the torsion subgroup of the Whitehead group is trivial SK1 (R[Γ]) = 1\nfor all rings of integers in number fields if and only if Γ is a semidirect product of two cyclic groups of relatively\nprime orders [1]. In general, we can determine the ranks of the (torsion-free part) of these groups using Bass'\ntheorem.\nGiven the above rules and results, it is a straightforward exercise to find the Whitehead groups of the\nfundamental groups appearing in the literature of model building (reviewed partially in the introduction).\nThis includes, for instance, the groups appearing in [10].\nWhitehead torsion. The approach in this paper can also guide us to anticipate conditions on cobordisms\nwhen constructing Calabi-Yau threefolds with fundamental groups of certain types. Recall that just because\nthe Whitehead group is nontrivial does not mean that the particular element, the Whitehead torsion, is a\nnontrivial element. That is, one still has to compute the Whitehead torsion (geometrically), which we do\nnot do here. We consider examples where elements in the torsion subgroup of the Whitehead group can be\nexplicitly characterized (see [48]).\n(i) For Γ = Z4 × Z2 × Z2 = hgihh1 ihh2 i, the torsion subgroup is SK1 (Z[Γ]) ∼\n= Z/2, and the nontrivial element\nis represented by the matrix\n\n\n1 + 8(1 − g 2 )(1 + h1 )(1 + h2 )(1 − g)\n−(1 − g 2 )(1 + h1 )(1 + h2 )(3 + g)\n\n ∈ GL(2, Z[Γ]) .\n(4.5)\n2\n2\n−13(1 − g )(1 + h1 )(1 + h2 )(3 − g) 1 + 8(1 − g )(1 + h1 )(1 + h2 )(1 + g)\nIn this case, one would have to check for a given h-cobordism built out of Y 11 and M 10 whether the\ncorresponding Whitehead torsion is the zero element or the nontrivial element represented by matrix (4.5).\n(ii) For Γ = Z3 × Q8 = hgi × ha, bi, where Q8 is a quaternion group of order 8, the torsion subgroup is\nSK1 (Z[Γ]) ∼\n= Z/2, and the nontrivial element is represented by the unit\n\u0001\n1 + (2 − g − g 2 )(1 − a2 ) 3g + a + 4g 2 a + 4(g 2 − g)b + 8ab ∈ (Z[Γ])∗ .\n(4.6)\n10\n\n\fAgain, one would check the geometry to see which of the two elements one gets.\nIt would be very interesting to calculate the Whitehead torsion explicitly for interesting classes of nonsimply connected Calabi-Yau manifolds. As far as we know, no such calculations exist. One approach could\nbe to find an explicit Morse function (which seems not easy).\n\n5\n\nDynamical aspects\n\nIn this section we consider some dynamical aspects of heterotic M-theory as they arise in connection to the\nWhitehead group and Whitehead torsion. We consider the effect of diffeomorphisms as well as orientation\ncharacters in section 5.1 and then consider dynamical constraints on general compactifications in heterotic\nM-theory in section 5.2.\n\n5.1\n\nAutomorphisms\n\nDiffeomorphism. We study the effect of diffeomorphisms on our cobordisms, starting with a visible sector\nM010 . Two eleven-dimensional cobordisms (Y 11 ; M010 , f0 , M110 , f1 ) and (Y ′11 ; M010 , f0′ , M1′10 , f1′ ) over M010 are\ndiffeomorphic relative M010 if there is an orientation preserving diffeomorphism F : Y 11 → Y ′11 such that\nF ◦ f0 = f0′ . Indeed in [29] the quantum integrand in the M-theory effective action is shown to be invariant\nunder the group of Spin diffeomorphisms of Y 11 which act freely on the space of metrics. On the other hand,\nthe effective action of the heterotic string is invariant under diffeomorphisms φ : M 10 → M 10 which lift to\nthe Spin bundle and to the E8 vector bundles [67]. The global anomaly is absent for arbitrary choices of the\nSpin M 10 and the two E8 vector bundles.\nIn addition to the many examples that we have considered so far, one might be able to generate others\nusing diffeomorphism. In a sense, constructing manifolds with cobordisms for which the Whitehead torsion\nis nontrivial would be easier than calculating the Whitehead torsion for a given fixed cobordism. The idea is\nto take a cobordism and and glue it to another after a 'twist' via an automorphism, i.e. a diffeomorphism in\nour case. This may give rise to a nonzero Whitehead torsion. This requires the study of the mapping torus\nas is done with the global anomalies in the heterotic effective action, e.g. in [67].\nScale and intervals. In the discussion so far we have used unit intervals [0, 1] to characterize the cobordism. In the physical set-up of Horava-Witten [35] [36] we have a length scale imposed by the dynamics in\nthe theory. In the above formulation, we can introduce this length scale by simply replacing the unit interval\nby the interval [0, L] or [−L, L], with L the (dynamical) length in the eleventh direction.\nManifolds with non-positive sectional curvature. It is interesting to note that Wh(Γ) is trivial for\nΓ the fundamental group of closed manifolds with all the sectional curvatures ≤ 0 [28]. Therefore, although\nnot Calabi-Yau (see [34] Theorem 2.3), such spaces are admissible for s-cobordism (see [49]).\nThe Whitehead torsion relative to left vs. right boundary. We ask whether it makes a difference to\ntake the Whitehead torsion relative to the left boundary vs. taking it relative to the right boundary. There\nis a duality theorem which relates the Whitehead torsion relative to one boundary to that of the second\nboundary [47]. For any orientable h-cobordism (Y 11 , M 10 , M ′10 ) we have the relation between τ (Y 11 , M 10 )\nand τ (Y 11 , M 10 ) as\n(5.1)\nτ (Y 11 , M ′10 ) = τ (Y 11 , M 10 ) ,\nP\nas follows. If a =\nni γi is an element of Z[Γ], with ni ∈ Z, γi ∈ Γ,\nwhere τ is the conjugate of τ , defined P\nthen the conjugate of a is the element\nni γi−1 . This conjugation operation is an anti-automorphism of the\ngroup ring with corresponding automorphism on GL(Z[Γ]) given by sending each matrix to its conjugate\ntranspose. Passing to the abelianized group K1 (Z[Γ]) gives an automorphism and hence an automorphism\nalso of the quotient Wh(Γ). We see that 'reversing' the direction of the cobordism, that is taking M ′10 to\n11\n\n\fM 10 instead of going from M 10 to M ′10 , will result only in a mild modification in having to deal with the\nconjugate torsion. For large classes of examples in which we are interested, there is even a simplification.\nIf Γ is finite abelian then every element ω of Wh(Γ) is self-conjugate, ω = ω. This in particular holds for\nthe distinguished element, the Whitehead torsion. Therefore, for finite abelian fundamental groups working\nwith the Whitehead torsion relative to M 10 is equivalent to working with the Whitehead torsion relative to\nM ′10 .\nRemark on the E8 gauge bundles. General boundary conditions for M-theory on a manifold with\nboundary are considered in [22] [53]. The left and right boundaries in heterotic M-theory each carries an\nE8 bundle which, in the process of model building is desired to be broken down to a realistic group. Each\nof the two bundles is characterized with a degree four characteristic class, aL for left and aR for right.\nAs explained in [22], when aL = aR then the eleven-dimensional spacetime provides a homotopy of the\nleft and right connections so that the E8 bundles on the boundaries necessarily have aL = aR , which is\nthe case in the non-supersymmetric model in [27]. However, in (the supersymmetric) Horava-Witten theory,\naL +aR = 12 p1 (Y 11 ). In order to overcome this difficulty, the authors of [22] give a parity-invariant formulation\nof the C-field in M-theory by passing from Y 11 to Yd11 , the orientation double cover of Y 11 , and defining\nthe C-field to be a parity invariant E8 cocycle on Yd11 . This is done via a nontrivial deck transformation σ\non Yd11 , so that a parity-invariant E8 cocycle is one for which the differential character corresponding to the\nC-field satisfies σ ∗ ([Č]) = [Č]P , where the action of the parity P is [Č]P = [Č]∗ . While this solves the parity\nproblem it uses boundary conditions which lead to a Bianchi identity for the C-field which is different from\nthe one in [36]. We should keep these subtleties in mind when dealing with bundles, which are always there\n(but we do not directly deal with them in this paper). Nevertheless, next we provide an explanation of this\nin our current context.\nOrientation characters and twisted group algebras of the fundamental group. The orientation\ncharacter ω(M010 ) : π1 (M010 ) → Z2 = {±1} sends a loop γ : S 1 → M010 to ω(γ) = +1 (respectively, -1) if γ\nis orientation-preserving (respectively, orientation-reversing). Thus, in the oriented case ω(γ) = +1 for all\nγ ∈ Γ, that is ω is trivial if and only if M010 is orientable. This has the following effect on the integral group\nring of the fundamental group. The orientation character defines a twisted involution (an anti-automorphism)\non the group ring Z[Γ] given by a 7→ ω(a)a−1 , i.e. ±a according to whether a is orientation preserving or\nreversing. The resulting group ring is denoted Z[Γ]ω .\nLet us consider this in more detail. An involution on Z[Γ] is a function Z[Γ] → Z[Γ], taking an element\na to an element a satisfying: (a + b) = a + b, (ab) = b * a, (a) = a, and 1 = 1 ∈ Z[Γ]. This gives rise to the\nω-twisted involution on Z[Γ], defined as the map from Z[Γ] to Z[Γ] given by\nX\nX\nω(γ)nγ γ −1 , nγ ∈ Z.\n(5.2)\na=\nnγ γ 7−→ a =\nγ∈Γ\n\nγ∈Γ\n\nIn this case we have to use ω-twisted cohomology and fundamental class in evaluating expressions in the\nf10 ), the ω(M 10 )-twisted involution\ntheory. Starting from the cellular Z[π1 (M010 )]-module chain complex C(M\n0\n0\n10\non Z[π1 (M010 )] can be used\nto\ndefine\nthe\nleft\nZ[π\n(M\n)]-module\nstructure\non the dual cochain complex\n\u0010\n\u0011 1 0\nf10 , Z[π1 (M 10 )] . When M 10 is compact, ‡ the fundamental class is given by\nf10 ) = HomZ[π (M 10 )] C(M\nC(M\n0\n0\n0\n0\n1\n0\n\n[M010 ] ∈ H10 (M010 ; Zω(M) ) such that the cap product defines Z[π1 ]-module isomorphisms\n∼\n=\n\n∗\nf10 ) −→ H10−∗ (M\nf10 )\n(M\n[M010 ] ∩ − : Hω(M)\n0\n0\n\n(5.3)\n\nf010 the universal cover of M010 . Quantities, e.g. ones appearing the effective action and the correwith M\nsponding partition function, should be formulated using this fundamental class.\n‡ M 10\n0\n\ndoes not necessarily have to be a manifold, but just a Poincaré duality complex.\n\n12\n\n\fThere is a duality formula for the Whitehead torsion which takes into account the orientation character.\nLet Y 11 be an eleven-dimensional h-cobordism and let ω : Γ → {±1} be the orientation character. This gives\nrise to an anti-involution on the integral group ring ZΓ by sending a group element g to ωg −1 , as above, and\nhence leads to an involution ∗ on the Whitehead group Wh(Γ). Then Milnor's duality formula is cast as\nτ (Y 11 , M ′10 ) = τ (Y 11 , M 10 )∗ .\n\n(5.4)\n\nEffect on F-theory. Recently there has been a lot of research activity in model building using F-theory\n(see [21] and references therein). F-theory can be considered as a limit of M-theory on a 2-torus when\nthe volume of the two-torus becomes very small. This means that constraints on the possible fundamental\ngroups of Y 11 , assumed to have a 2-torus factor, will have an effect on the possible fundamental groups on\nthe space on which F-theory is considered. Nontrivial fundamental groups in this context are considered\nin [11]. Therefore, we expect that our discussion in the heterotic/M-theory setting will have, via duality,\nconsequences for fundamental groups in F-theory. This is strengthened by the fact that in a class of models\nwhich admit perturbative heterotic duals, the F-theory and heterotic computations match [26]. It would be\ninteresting to perform explicit checks of this in relevant examples.\n\n5.2\n\nCompactification\n\nWe have considered in general the relation between M-theory on a general eleven-manifold and heterotic\nstring theory on a general ten-manifold M010 . There are two aspects to this. First, for consistency the theory\nshould make sense on any admissible manifold and so studying this might give insight into understanding the\ntheory further. Second, there are certain favorable types of spaces for model building. We have in mind that\nM010 is a product (or a bundle) of a Calabi-Yau threefold X 6 with a four-dimensional spacetime. In general,\nthe latter can be taken to be a general four-manifold that solves the equations of motion and does/does\nnot break supersymmetry according to the goal one has in mind. It can be taken to be flat Minkowski or\nsomething close. We study such situations in this section and consider whether the choice of four-dimensional\nspacetime changes the discussion we have had so far.\nWe take M-theory on an eleven-manifold Y 11 = Z 7 × N 4 , where N 4 is spacetime and Z 7 is a sevendimensional cobordism of the Calabi-Yau threefold X 6 . This always exists because the Stiefel-Whitney\nnumbers of a Calabi-Yau threefold are zero: w1 = 0 because of orientation, w2 = 0 because of Spin, and\nw3 = 0 because both w1 and w2 are zero; then the Stiefel-Whitney numbers w1 w5 [X 6 ], w2 w4 [X 6 ], and\nw3 w3 [X 6 ] are all zero. The heterotic ten-manifold is of the form M010 = X 6 × N 4 .\nThe h-cobordism of a product. Let (Z 7 ; X06 , X16 ) be a seven-dimensional h-cobordism for the Calabi-Yau\nthreefold X06 , and let N 4 be a closed four-manifold. Then we can form an eleven-dimensional h-cobordism\n(Z 7 × N 4 ; X06 × N 4 , X16 × N 4 ). From the cut and paste properties of the Whitehead torsion (see [47] [65]\n[39]), we get that the torsion are related as follows\nτ (Z 7 × N 4 , X06 × N 4 ) = τ (Z 7 , X06 ) χ(N 4 ) ,\n\n(5.5)\n\nwhere χ(N 4 ) is the Euler characteristic of N 4 . Thus the value of this invariant will determine whether there\nwe can relate the discussion of torsion in eleven/ten dimensions to that in seven/six dimensions. The former\nis the global picture we have built so far, and the latter correspond to the actual situation studied in model\nbuilding, that is the fundamental groups appearing as examples are those of X 6 and not (necessarily) of\nM 10 .\nIf spacetime were compact and odd-dimensional then the Euler characteristic would vanish identically.\nIn that case, the torsion would vanish. For example, if we take spacetime to be the circle S 1 then Z 7 × S 1 ≈\nX06 × S × [0, 1] ≈ X16 × S 1 × [0, 1], i.e. the torsion vanishes. In particular, this gives X06 × S 1 ≈ X16 × S 1 .\n\n13\n\n\fProduct with a torus and Wall's finiteness obstruction. The circle S 1 has fundamental group\nπ1 (S 1 ) ∼\n= Z. If we consider the product S 1 × Y , then what is the corresponding Whitehead group in terms of\ne 0 (Z[Γ]) ⊕ N , for\nthat of the factors? There is in fact a direct sum decomposition [4] Wh(Z × Γ) ∼\n= Wh(Γ) ⊕ K\nsome Nil-group N . For the 2-torus with fundamental group Z2 , the process can be repeated. It might seem\nthat for this product we can have nonzero Whitehead group for the product manifold even though that group\ne 0 (Z[π1 (X)]), called Wall's finiteness obstruction,\nfor the factors might not be zero. However, elements in K\ndetects whether or not X 6 has the homotopy type of a CW-complex. If we are within the category of such\nspaces then this element within the class group vanishes.\nSpacetime with flat structure. A manifold admits a flat structure if the tangent bundle is isomorphic\nto a flat vector bundle, i.e. admits a flat connection. Even for such manifolds, one can have nonzero Eulercharacterstic. For example, if we take take the connected sum N 4 = (Σ3 × Σ3 ) #6i=1 (S 1 × S 3 ), where Σ3\nis a surface of genus 3. The product Σ3 × Σ3 is almost parallelizable and the product of spheres S 1 × S 3\nis parallelizable. Then the Euler characteristic is χ(N 4 ) = 4 (see [60]). In this example, the fundamental\ngroup is the free product π1 (N 4 ) = Γ1 ∗ Γ2 , where Γ1 is the direct product of two copies of a non-abelian\nsurface group and Γ2 is of rank 6. In fact, S 1 × S 3 can be replaced by any parallelizable four-manifold.\nCompact vs. noncompact spacetime. So far we have taken N 4 to be compact. For compact manifolds,\nthe existence of a smooth Lorentzian metric is equivalent to the manifold having a vanishing Euler characteristic (see [62]). However, the situation gets modified in the presence of singularities (see [44]). What if it\nis not compact? Noncompact spacetimes are more desirable for the purpose of equipping spacetime with a\nLorentzian structure; all noncompact manifolds admit a Lorentzian metric. On the other hand, every noncompact manifold admits vector fields with any specified set of isolated zeros. This suggests that noncompact\nmanifolds with nonzero (appropriate notion of) § Euler characteristic are\nR abundant. Note that for noncompact Riemann surfaces, the Cohn-Vossen theorem gives the inequality Σ KdA ≤ 2πχ(Σ) (see e.g. [40]). In\ngeneral one works with L2 -Euler characteristics. For example, the Euler characteristic of an Asymptotically\nLocally Euclidean (ALE) space corresponding to the Lie algebra of type An is n + 1. It is important to note\nthat it should be checked whether equation (5.5) extends to the noncompact case. Furthermore, strictly\nspeaking, in the noncompact case we have to use the noncompact version of the s-cobordism theorem, for\nwhich the Whitehead torsion lives a new group, which fits into an exact sequence involving the Whitehead\ngroup and algebraic K0 , as well as information about the ends [59]. Some aspects of behavior of ends in\nM-theory are discussed in [54].\nIn the following few paragraphs we describe a way for studying the Whitehead torsion via other invariants,\nnamely the Reidemeister torsion [47] and the Ray-Singer torsion [50]. This then provides a setting for making\nsome direct connections to phenomenology.\nRelation of the Whitehead torsion to Reidemeister torsion. The Whitehead torsion τ is closely\nrelated to Reidemeister torsion (or R-torsion) ∆; the former generalizes the latter but is a more delicate\ninvariant. Algebraically, the Whitehead torsion is more general than R-torsion in that it is also defined for\nnoncommutative rings (such as the group ring of the fundamental group Z[π1 (X)]) for which the determinant,\nneeded for the R-torsion, is not defined. The R-torsion is a topological invariant which distinguishes spaces\nwhich are homotopy equivalent but not homeomorphic, and is defined for spaces whose fundamental group\nπ is finite and for which the homology with coefficients in a certain π-representation vanishes. The R-torsion\nis defined in more general situations than Whitehead torsion, since any homotopy equivalence is a homology\nequivalence. Furthermore, R-torsion has two advantages over the Whitehead torsion:\n(i) It is more likely to be defined.\n(ii) Its value is an honest real number, instead of being an element of a somewhat esoteric group.\nOn the other hand, when defined, the Whitehead torsion is a sharper invariant. When they are both defined,\nthe R-torsion is a function of the Whitehead torsion. That is, for each unitary (orthogonal) representation\n§ Note\n\nthat there are various definitions and versions of the Euler characteristic in the noncompact setting.\n\n14\n\n\fρ of the fundamental group π, the R-torsion is the real part of the determinant of the complex (real) matrix\ninduced by ρ from any matrix representation of the Whitehead torsion. One can find a useful criterion for\nwhen the Whitehead torsion is zero by studying the R-torsion. For concreteness, let h : π1 (M 10 ) → O(n)\nbe an orthogonal representation of the fundamental group π = π1 (M 10 ). Then h extends to a unique\nhomomorphism from the group ring Z[π] to the ring Mn (R) of all real n × n matrices and determines a\nhomomorphism h∗ : Wh(π) → K 1 (R) ∼\n= R+ . Suppose that the Whitehead torsion τ (Y 11 ; M 10 ) ∈ Wh(π) is\ndefined and suppose that π is a finite group. Then it follows from the identity relating the two torsions [47]\n∆h (Y 11 ; M 10 ) = h∗ τ (Y 11 ; M 10 )\n\n(5.6)\n\nthat τ (Y 11 ; M 10 ) is an element of finite order in Wh(π) if and only if the R-torsion is ∆h (Y 11 ; M 10 ) = 1\nfor all possible orthogonal representations h of π. If π is finite abelian, then τ (Y 11 ; M 10 ) = 0 if and only\nif ∆h (Y 11 ; M 10 ) = 1 for all possible such representations h. Since the R-torsion is easier to calculate, this\ngives a concrete way of checking whether the Whitehead torsion vanishes without having to go through the\ndifficult task of calculating it explicitly.\nExamples of when R-torsion is defined and the Whitehead torsion is not. There are examples in\nwhich the Whitehead torsion cannot be defined but the R-torsion can (see [47]). For instance, the Whitehead\ntorsion τ (S 1 ) of the circle S 1 cannot be defined since the module H0 (Ŝ 1 ) for the universal cover Ŝ 1 is not\nzero, and is not a free Z[π]-module. On the other hand, the R-torsion is defined; if the homomorphism h\nfrom the fundamental group π1 (S 1 ) to the units F× in a field F maps a generator into the field element x 6= 1,\nthen the associated R-torsion ∆h (S 1 ) ∈ F× / ± h(π1 ) is well-defined and equal to 1 − h, up to multiplication\nby hm for some m ∈ Z× . Another example is a knot complement X in the 3-sphere with h : π1 (X) → F×\nmapping each loop with linking number +1 into the field element x 6= 1. Then the R-torsion is well-defined,\nand is equal to (1 − h)/A(h), where A(h) is the Alexander polynomial of the knot.\nEffect on phenomenology. The Ray-Singer torsion, which is an analytic analog of R-torsion and which\ncoincides with it for Riemannian manifolds, has direct physical applications. The Ray-Singer torsion can\nbe defined using determinants of Laplacians. In this form it has natural connection to one-loop amplitudes. For example, this torsion governs the threshold corrections for the heterotic string [6]. In M-theory\ncompactifications on manifolds with G2 holonomy, the GUT scale MGUT is essentially given by the Ray3\nSinger torsion ∆RS (Σ) via MGUT\n= ∆RS (Σ)/VΣ , where VΣ is the volume of the corresponding 3-cycle\nΣ [30]. For example, when Σ = S 3 /Zq is a lens space,\n\u0001 on which there is a Wilson line of eigenvalues\ne2πi(2m/q) , e2πi(2m/q) , e2πi(m/q) , e−2πi(3m/q) , e−2πi(3m/q) with m and q coprime integers, then the Ray-Singer\ntorsion for the lens space is ∆RS (Σ) = 4q sin2 (5πm/q). Now, the more delicate Whitehead torsion can be\npartially studied by considering the R-torsion (or Ray-Singer torsion) as above. It should be an obstruction\nto supersymmetry in heterotic M-theory. The breaking scale would be the intermediate 5-dimensional scale,\nand only gravitationally mediate to the visible sector. It would be interesting to see how this works explicitly.\nHigher-dimensional compactifications. If we take our eleven-manifold Y 11 to be a product of two\nmanifolds, where the internal manifold is of dimension lower than 6 then we can no longer apply the scobordism arguments we have been using. In particular, the s-cobordism theorem fails in dimensions five\nand it is an open problem in dimension four (see [17] [18]). For example, there exists an h-cobordism\n(W 5 , T 4 , T 4 ), where T 4 is the four-dimensional torus, for which there is no diffeomorphism from W 5 to\nT 4 × [0, 1]. Since Wh(π1 (T 4 )) = 0, the s-cobordism indeed fails in five dimensions. For topological spaces,\nthe theorem fails in both four and five dimensions [58]; one might say that we could apply the s-cobordism\nin this case to the spacetime part rather than the internal part, now that spacetime has grown to admissible\ndimensions. This certainly can be done and will give consistency conditions depending on fundamental\ngroups of spacetime (the arguments we have outlined will go through with the obvious changes). However,\nwe would then not be studying fundamental groups for purposes of particle physics but rather for purposes\nof cosmology.\n\n15\n\n\fAcknowledgement\nThe author would like to thank Jonathan Rosenberg for useful discussions on the Whitehead torsion and\nKenji Fukaya and the referee for useful comments. He also acknowledges the hospitality of the Department\nof Physics and the Department of Mathematics at the National University of Singapore where part of this\nwork was done.\n\nReferences\n[1] R. C. Alperin, R. K. Dennis, R. Oliver, and M. R. Stein, SK1 of finite abelian groups II, Invent. Math.\n87 (1987), no. 2, 253–302.\n[2] R. C. Alperin, R. K. Dennis and M. R. Stein, The nontriviality of SK1 (Zπ), in Orders, Group Rings\nand Related Topics, Lecture Notes in Math., vol. 353, Springer-Verlag, New York, 1973, 1–7.\n[3] A. Bak, V. Bouchard, and R. Donagi, Exploring a new peak in the heterotic landscape, J. High Energy\nPhys. 06 (2010) 108, 1–31, [arXiv:0811.1242] [hep-th].\n[4] H. Bass, A. Heller, and R. Swan, The Whitehead group of a polynomial extension, Publ. de I'lnst. des\nHautes Etudes Sci. 22 (1964) 61–79.\n[5] V. Batyrev and M. Kreuzer, Integral cohomology and mirror symmetry for Calabi-Yau 3-folds, Mirror symmetry V, 255–270, AMS/IP Stud. Adv. Math., 38, Amer. Math. Soc., Providence, RI, 2006,\n[math.AG/0505432].\n[6] M. Bershadsky, S. Cecotti, H. Ooguri, and C. Vafa, Kodaira-Spencer theory of gravity and exact results\nfor quantum string amplitudes, Commun. Math. Phys. 165 (1994) 311–428, [arXiv:hep-th/9309140].\n[7] L. Borisov and Z. Hua, On Calabi-Yau threefolds with large nonabelian fundamental groups, Proc. Amer.\nMath. Soc. 136 (2008), no. 5, 1549–1551, [arXiv:math/0609728] [math.AG].\n[8] V. Bouchard and R. Donagi, An SU(5) heterotic standard model, Phys. Lett. B633 (2006) 783–791,\n[arXiv:hep-th/0512149].\n[9] V. Bouchard and R. Donagi, On a class of non-simply connected Calabi-Yau threefolds, Comm. Numb.\nTheor. Phys. 2 (2008) 1–61, [arXiv:0704.3096] [math.AG].\n[10] V. Braun, On free quotients of complete intersection Calabi-Yau manifolds, [arXiv:1003.3235] [hep-th].\n[11] V. Braun, Discrete Wilson lines in F-theory , [arXiv:1010.2520] [hep-th].\n[12] V. Braun, Y.-H. He, B. A.Ovrut, and T. Pantev, The exact MSSM spectrum from string theory, J. High\nEnergy Phys. 0605 (2006) 043, [arXiv:hep-th/0512177].\n[13] V. Braun, M. Kreuzer, B. A. Ovrut, and E. Scheidegger, Worldsheet instantons and torsion curves, part\nA: Direct computation, J. High Energy Phys. 0710 (2007) 022, [arXiv:hep-th/0703182].\n[14] V. Braun, B. A.Ovrut, T. Pantev, and R. Reinbacher, Elliptic Calabi-Yau threefolds with Z3 ×Z3 Wilson\nlines, J. High Energy Phys. 0412 (2004) 062, [arXiv:hep-th/0410055].\n[15] J. D. Breit, B. A. Ovrut, and G. C. Segre, E6 symmetry breaking in the superstring theory, Phys. Lett.\nB158 (1985) 33–39.\n[16] P. Candelas and R. Davies, New Calabi-Yau manifolds with small Hodge numbers, [arXiv:0809.4681]\n[hep-th].\n[17] S. Cappell and J. Shaneson, On 4-dimensional s-cobordisms, J. Differential Geom. 22 (1985), no. 1,\n97–115.\n16\n\n\f[18] W. Chen, Smooth s-cobordisms of elliptic 3-manifolds, J. Differential Geom. 73 (2006), no. 3, 413–490.\n[19] M. M. Cohen, A Course in Simple-Homotopy Theory, GTM 10, Springer- Verlag, New York-Berlin,\n1973.\n[20] M. Davis and J.-C. Hausmann, Aspherical manifolds without smooth or PL structure, Lect. Notes in\nMath., Vol. 1370, Springer-Verlag, New York, 1989, pp. 135-142.\n[21] F. Denef, Les Houches lectures on constructing string vacua, [arXiv:0803.1194] [hep-th].\n[22] E. Diaconescu, D. S. Freed and G. Moore, The M-theory 3-form and E8 gauge theory, Elliptic cohomology, 44–88, Cambridge Univ. Press, Cambridge, 2007, [arXiv:hep-th/0312069].\n[23] R. Donagi, P. Gao, and M. B. Schulz, Abelian fibrations, string junctions, and flux/geometry duality,\n[arXiv:0810.5195] [hep-th].\n[24] R. Donagi, B. A.Ovrut, T. Pantev, and R. Reinbacher, SU(4) instantons on Calabi-Yau threefolds with\nZ2 × Z2 fundamental group, J. High Energy Phys. 0401 (2004) 022, [arXiv:hep-th/0307273].\n[25] R. Donagi, B. A.Ovrut, T. Pantev, and D. Waldram, Standard models from heterotic M-theory, Adv.\nTheor. Math. Phys. 5 (2002) 93–137, [arXiv:hep-th/9912208].\n[26] R. Donagi and M. Wijnholt, Model building with F-theory, [arXiv:0802.2969] [hep-th].\n[27] M. Fabinger and P. Horava, Casimir effect between world-branes in heterotic M-theory, Nucl. Phys.\nB580 (2000) 243–263, [arXiv:hep-th/0002073].\n[28] F.T. Farrell and L.E. Jones, Topological rigidity for compact nonpositively curved manifolds, Proc.\nSympos. Pure Math. 54, Part 3, American Mathematical Society, Providence, R.I. (1993), 229–274.\n[29] D. S. Freed and G. W. Moore, Setting the quantum integrand of M-theory, Commun. Math. Phys. 263\n(2006) 89–132, [arXiv:hep-th/0409135].\n[30] T. Friedmann and E. Witten, Unification scale, proton decay, and manifolds of G2 holonomy, Adv.\nTheor. Math. Phys. 7 (2003) 577–617, [arXiv:hep-th/0211269].\n[31] M. B. Green, J. H. Schwarz, and E. Witten, Superstring Theory, vol 2, Cambridge Univ. Press, Cambridge, 1988.\n[32] M. Gross and S. Popescu, Calabi-Yau threefolds and moduli of abelian surfaces I, Compositio Math.\n127 (2001), 169–228.\n[33] Y.-H. He, An algorithmic approach to heterotic string phenomenology, Mod. Phys. Lett. A 25 (2010)\n79–90, [arXiv:1001.2419] [hep-th].\n[34] G. Heier, S. S. Y. Lu, and B. Wong, On the canonical line bundle and negative holomorphic sectional\ncurvature, Math. Res. Lett. 17 (2010) 1101–1110.\n[35] P. Horava and E. Witten, Heterotic and type I string dynamics from eleven dimensions, Nucl. Phys.\nB460 (1996) 506–524, [arXiv:hep-th/9510209].\n[36] P. Horava and E. Witten, Eleven-dimensional supergravity on a manifold with boundary, Nucl. Phys.\nB475 (1996) 94–114, [arXiv:hep-th/9603142].\n[37] M. E. Keating, On the K-theory of the quaternion group, Mathematika 20 (1973) 59–62.\n[38] M. Kervaire, Le théorème de Barden-Mazur-Stallings, Comment. Math. Helv. 40 (1965) 31–42.\n[39] M. Kreck and W. Lück, The Novikov Conjecture: Geometry and Algebra, Birkhäuser, Basel, 2005.\n17\n\n\f[40] W. Kühnel, Differential Geometry: Curves– Surfaces– Manifolds, Amer. Math. Soc., Providence, RI,\n2006.\n[41] K. W. Kwun, Transfer homomorphisms of Whitehead groups of some cyclic groups, Amer. J. Math. 93\n(1971) 310–316.\n[42] K. W. Kwun, Transfer homomorphisms of Whitehead groups of some cyclic groups II, Lecture Notes in\nMath. 298, 437–440, Springer, Berlin, 1972.\n[43] B. Magurn, SK1 of dihedral groups, J. Algebra 51 (1978), no. 2, 399–415.\n[44] L. Markus, Line element fields and Lorentz structures on differentiable manifolds, Ann. of Math. (2) 62\n(1955), 411–417.\n[45] B. Mazur, Relative neighborhoods and the theorems of Smale, Ann. of Math. (2) 77 (1963) 232–249.\n[46] J. Milnor, Lectures on the h-cobordism theorem, Princeton Univ. Press, Princeton, NJ, 1965.\n[47] J. Milnor, Whitehead torsion, Bull. Amer. Math. Soc. 72 (1966) 358–426.\n[48] R. Oliver, Whitehead groups of finite groups, Cambridge Univ. Press, Cambridge, 1988.\n[49] R. Rares, On the topology and differential geometry of Kähler threefolds, PhD Dissertation, Stony Brook\nUniversity, 2005.\n[50] D. B. Ray and I. M. Singer, Analytic torsion for complex manifolds, Ann. Math. (2) 98 (1973) 154–177.\n[51] J. Rosenberg, Algebraic K-theory and its Applications, Springer-Verlag, New York, 1994.\n[52] H. Sati, Geometry of Spin and Spinc structures in the M-theory partition function [arXiv:1005.1700]\n[hep-th].\n[53] H. Sati, Duality and cohomology in M-theory with boundary, [arXiv:1012.4495] [hep-th].\n[54] H. Sati, Corners in M-theory, J. Phys. A44 (2011) 255402, [arXiv:1101.2793] [hep-th].\n[55] C. Schoen, On fiber products of rational elliptic surfaces with section, Math. Zeitschrift 197(2) (1988)\n177–199.\n[56] M. B. Schulz, Calabi-Yau duals of torus orientifolds, J. High Energy Phys. 0605 (2006) 023,\n[arXiv:hep-th/0412270].\n[57] V. V. Sharko, Functions on Manifolds: Algebraic and Geometric Aspects, American Mathematical\nSociety, Providence, RI, 1993.\n[58] L. C. Siebenmann, Disruption of low-dimensional handlebody theory by Rohlin's theorem, Topology of\nManifolds, 57–76, Markham, Chicago, Ill, 1970.\n[59] L. C. Siebenmann, Infinite simple homotopy types, Indag. Math. 32 (1970) 479–495.\n[60] J. Smillie, Flat manifolds with non-zero Euler characteristic, Comment. Math. Helv. 52 (1977), no. 3,\n453–455.\n[61] J. Stallings, On infinite processes leading to differentiability in the complement of a point, in Differential\nand Combinatorial Topology, 245–254, Princeton Univ. Press, Princeton, NJ, 1965.\n[62] N. Steenrod, The Topology of Fiber Bundles, Princeton Univ. Press, Princeton, NJ, 1951.\n[63] M. R, Stein, Whitehead groups of finite groups, Bull. Amer. Math. Soc. 84 (1978) 201–212.\n\n18\n\n\f[64] C. T. C. Wall, Norms of units in group rings, Proc. London Math. Soc. 29 (1974), 593–632.\n[65] S. Weinberger, The Topological Classification of Stratified Spaces, Univ. of Chicago Press,\nChicago, Ill 1994.\n[66] E. Witten, Symmetry breaking patterns in superstring models, Nucl. Phys. B258 (1985) 75–100.\n[67] E. Witten, Topological tools in 10-dimensional physics, Int. J. Mod. Phys. A 1 (1986) 39–64.\n\n19\n\n\f"}