{"id": "http://arxiv.org/abs/0805.3426v1", "guidislink": true, "updated": "2008-05-22T10:25:04Z", "updated_parsed": [2008, 5, 22, 10, 25, 4, 3, 143, 0], "published": "2008-05-22T10:25:04Z", "published_parsed": [2008, 5, 22, 10, 25, 4, 3, 143, 0], "title": "Fractal Fluctuations and Statistical Normal Distribution", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0805.3074%2C0805.4386%2C0805.4598%2C0805.4349%2C0805.1611%2C0805.3708%2C0805.4163%2C0805.0179%2C0805.2184%2C0805.2110%2C0805.3275%2C0805.0546%2C0805.3017%2C0805.2871%2C0805.4379%2C0805.0293%2C0805.1086%2C0805.3460%2C0805.1661%2C0805.3191%2C0805.3554%2C0805.2942%2C0805.3614%2C0805.3359%2C0805.3223%2C0805.3426%2C0805.1852%2C0805.0835%2C0805.1668%2C0805.0192%2C0805.2329%2C0805.0690%2C0805.2661%2C0805.1784%2C0805.3154%2C0805.3056%2C0805.3531%2C0805.3282%2C0805.3214%2C0805.1985%2C0805.4230%2C0805.0840%2C0805.0222%2C0805.0025%2C0805.0229%2C0805.0316%2C0805.3918%2C0805.4136%2C0805.1270%2C0805.1477%2C0805.0876%2C0805.2721%2C0805.0365%2C0805.1411%2C0805.3722%2C0805.2911%2C0805.1427%2C0805.1820%2C0805.2781%2C0805.0199%2C0805.1553%2C0805.1163%2C0805.4107%2C0805.4612%2C0805.2248%2C0805.2251%2C0805.1227%2C0805.2444%2C0805.1446%2C0805.1256%2C0805.0337%2C0805.2910%2C0805.0576%2C0805.4718%2C0805.2891%2C0805.1731%2C0805.1143%2C0805.2267%2C0805.1193%2C0805.3611%2C0805.1055%2C0805.0859%2C0805.1705%2C0805.4178%2C0805.1996%2C0805.0103%2C0805.0700%2C0805.4451%2C0805.3881%2C0805.3209%2C0805.1401%2C0805.0752%2C0805.3961%2C0805.4544%2C0805.3124%2C0805.3160%2C0805.0520%2C0805.4794%2C0805.2407%2C0805.1392%2C0805.2114&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Fractal Fluctuations and Statistical Normal Distribution"}, "summary": "Dynamical systems in nature exhibit selfsimilar fractal fluctuations and the\ncorresponding power spectra follow inverse power law form signifying long-range\nspace-time correlations identified as self-organized criticality. The physics\nof self-organized criticality is not yet identified. The Gaussian probability\ndistribution used widely for analysis and description of large data sets\nunderestimates the probabilities of occurrence of extreme events such as stock\nmarket crashes, earthquakes, heavy rainfall, etc. The assumptions underlying\nthe normal distribution such as fixed mean and standard deviation, independence\nof data, are not valid for real world fractal data sets exhibiting a scale-free\npower law distribution with fat tails. A general systems theory for fractals\nvisualizes the emergence of successively larger scale fluctuations to result\nfrom the space-time integration of enclosed smaller scale fluctuations. The\nmodel predicts a universal inverse power law incorporating the golden mean for\nfractal fluctuations and for the corresponding power spectra, i.e., the\nvariance spectrum represents the probabilities, a signature of quantum systems.\nFractal fluctuations therefore exhibit quantum-like chaos. The model predicted\ninverse power law is very close to the Gaussian distribution for small-scale\nfluctuations, but exhibits a fat long tail for large-scale fluctuations.\nExtensive data sets of Dow Jones index, Human DNA, Takifugu rubripes (Puffer\nfish) DNA are analysed to show that the space/time data sets are close to the\nmodel predicted power law distribution.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0805.3074%2C0805.4386%2C0805.4598%2C0805.4349%2C0805.1611%2C0805.3708%2C0805.4163%2C0805.0179%2C0805.2184%2C0805.2110%2C0805.3275%2C0805.0546%2C0805.3017%2C0805.2871%2C0805.4379%2C0805.0293%2C0805.1086%2C0805.3460%2C0805.1661%2C0805.3191%2C0805.3554%2C0805.2942%2C0805.3614%2C0805.3359%2C0805.3223%2C0805.3426%2C0805.1852%2C0805.0835%2C0805.1668%2C0805.0192%2C0805.2329%2C0805.0690%2C0805.2661%2C0805.1784%2C0805.3154%2C0805.3056%2C0805.3531%2C0805.3282%2C0805.3214%2C0805.1985%2C0805.4230%2C0805.0840%2C0805.0222%2C0805.0025%2C0805.0229%2C0805.0316%2C0805.3918%2C0805.4136%2C0805.1270%2C0805.1477%2C0805.0876%2C0805.2721%2C0805.0365%2C0805.1411%2C0805.3722%2C0805.2911%2C0805.1427%2C0805.1820%2C0805.2781%2C0805.0199%2C0805.1553%2C0805.1163%2C0805.4107%2C0805.4612%2C0805.2248%2C0805.2251%2C0805.1227%2C0805.2444%2C0805.1446%2C0805.1256%2C0805.0337%2C0805.2910%2C0805.0576%2C0805.4718%2C0805.2891%2C0805.1731%2C0805.1143%2C0805.2267%2C0805.1193%2C0805.3611%2C0805.1055%2C0805.0859%2C0805.1705%2C0805.4178%2C0805.1996%2C0805.0103%2C0805.0700%2C0805.4451%2C0805.3881%2C0805.3209%2C0805.1401%2C0805.0752%2C0805.3961%2C0805.4544%2C0805.3124%2C0805.3160%2C0805.0520%2C0805.4794%2C0805.2407%2C0805.1392%2C0805.2114&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Dynamical systems in nature exhibit selfsimilar fractal fluctuations and the\ncorresponding power spectra follow inverse power law form signifying long-range\nspace-time correlations identified as self-organized criticality. The physics\nof self-organized criticality is not yet identified. The Gaussian probability\ndistribution used widely for analysis and description of large data sets\nunderestimates the probabilities of occurrence of extreme events such as stock\nmarket crashes, earthquakes, heavy rainfall, etc. The assumptions underlying\nthe normal distribution such as fixed mean and standard deviation, independence\nof data, are not valid for real world fractal data sets exhibiting a scale-free\npower law distribution with fat tails. A general systems theory for fractals\nvisualizes the emergence of successively larger scale fluctuations to result\nfrom the space-time integration of enclosed smaller scale fluctuations. The\nmodel predicts a universal inverse power law incorporating the golden mean for\nfractal fluctuations and for the corresponding power spectra, i.e., the\nvariance spectrum represents the probabilities, a signature of quantum systems.\nFractal fluctuations therefore exhibit quantum-like chaos. The model predicted\ninverse power law is very close to the Gaussian distribution for small-scale\nfluctuations, but exhibits a fat long tail for large-scale fluctuations.\nExtensive data sets of Dow Jones index, Human DNA, Takifugu rubripes (Puffer\nfish) DNA are analysed to show that the space/time data sets are close to the\nmodel predicted power law distribution."}, "authors": ["A. M. Selvam"], "author_detail": {"name": "A. M. Selvam"}, "author": "A. M. Selvam", "arxiv_comment": "26 pages, 7 figures", "links": [{"href": "http://arxiv.org/abs/0805.3426v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0805.3426v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.gen-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.gen-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0805.3426v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0805.3426v1", "journal_reference": null, "doi": null, "fulltext": "Fractal Fluctuations and Statistical Normal\nDistribution\nA. M. Selvam\nDeputy Director (Retired)\nIndian Institute of Tropical Meteorology, Pune 411 008, India\nEmail: amselvam@gmail.com\nWeb sites: http://www.geocities.com/amselvam\nhttp://amselvam.tripod.com/index.html\nDynamical systems in nature exhibit selfsimilar fractal fluctuations and the\ncorresponding power spectra follow inverse power law form signifying long-range\nspace-time correlations identified as self-organized criticality. The physics of selforganized criticality is not yet identified. The Gaussian probability distribution used\nwidely for analysis and description of large data sets underestimates the probabilities\nof occurrence of extreme events such as stock market crashes, earthquakes, heavy\nrainfall, etc. The assumptions underlying the normal distribution such as fixed mean\nand standard deviation, independence of data, are not valid for real world fractal data\nsets exhibiting a scale-free power law distribution with fat tails. A general systems\ntheory for fractals visualizes the emergence of successively larger scale fluctuations\nto result from the space-time integration of enclosed smaller scale fluctuations. The\nmodel predicts a universal inverse power law incorporating the golden mean for\nfractal fluctuations and for the corresponding power spectra, i.e., the variance\nspectrum represents the probabilities, a signature of quantum systems. Fractal\nfluctuations therefore exhibit quantum-like chaos. The model predicted inverse\npower law is very close to the Gaussian distribution for small-scale fluctuations, but\nexhibits a fat long tail for large-scale fluctuations. Extensive data sets of Dow Jones\nindex, Human DNA, Takifugu rubripes (Puffer fish) DNA are analysed to show that\nthe space/time data sets are close to the model predicted power law distribution.\n\n1. Introduction\nDynamical systems in nature such as atmospheric flows, heartbeat patterns,\npopulation dynamics, stock market indices, DNA base A, C, G, T sequence pattern,\netc., exhibit irregular space-time fluctuations on all scales and exact quantification of\nthe fluctuation pattern for predictability purposes has not yet been achieved.\nTraditionally, the Gaussian probability distribution is used for a broad quantification\nof the data set variability in terms of the sample mean and variance. The fractal or\nselfsimilar nature of space-time fluctuations was identified by Mandelbrot (1975) in\nthe 1970s. Representative examples of fractal fluctuations of (i) Daily percentage\nchange of Dow Jones Index (ii) Human DNA base CG concentration/10bp (base\npairs) (iii) Takifugu rubripes (Puffer fish) DNA base CG concentration/10bp are\nshown in Fig. 1.\n\n\fFigure 1: Representative examples of fractal fluctuations of (i) Daily percentage change of Dow\nJones Index (ii) Human DNA base CG concentration/10bp (base pairs) (iii) Takifugu rubripes\n(Puffer fish) DNA base CG concentration/10bp\n\nFractal fluctuations (Fig. 1) show a zigzag selfsimilar pattern of successive\nincrease followed by decrease on all scales (space-time), for example in atmospheric\nflows, cycles of increase and decrease in meteorological parameters such as wind,\ntemperature, etc. occur from the turbulence scale of millimeters-seconds to climate\nscales of thousands of kilometers-years. The power spectra of fractal fluctuations\nexhibit inverse power law of the form f-α where f is the frequency and α is a constant.\n\n\fInverse power law for power spectra indicate long-range space-time correlations or\nscale invariance for the scale range for which α is a constant, i.e., the amplitudes of\nthe eddy fluctuations in this scale range are a function of the scale factor α alone. In\ngeneral the value of α is different for different scale ranges indicating multifractal\nstructure for the fluctuations. The long-range space-time correlations exhibited by\ndynamical systems are identified as self-organized criticality (Bak et al., 1988;\nSchroeder, 1990). The physics of self-organized criticality is not yet identified. The\nphysics of fractal fluctuations generic to dynamical systems in nature is not yet\nidentified and traditional statistical, mathematical theories do not provide adequate\ntools for identification and quantitative description of the observed universal\nproperties of fractal structures observed in all fields of science and other areas of\nhuman interest. A recently developed general systems theory for fractal space-time\nfluctuations (Selvam, 1990, 2005, 2007; Selvam and Fadnavis, 1998) shows that the\nlarger scale fluctuation can be visualized to emerge from the space-time averaging of\nenclosed small scale fluctuations, thereby generating a hierarchy of selfsimilar\nfluctuations manifested as the observed eddy continuum in power spectral analyses of\nfractal fluctuations. Such a concept results in inverse power law form incorporating\nthe golden mean τ for the space-time fluctuation pattern and also for the power spectra\nof the fluctuations (Sec. 3). The predicted distribution is close to the Gaussian\ndistribution for small-scale fluctuations, but exhibits fat long tail for large-scale\nfluctuations. Analysis of extensive data sets of (i) Daily percentage change of Dow\nJones Index (ii) Human DNA base CG concentration/10bp (base pairs) (iii) Takifugu\nrubripes (Puffer fish) DNA base CG concentration/10bp show that the data follow\nclosely, but not exactly the statistical normal distribution, particularly in the region of\nnormalized deviations t greater than 2, the t values being computed as equal to (xav)/sd where av and sd denote respectively the mean and standard deviation of the\nvariable x. The general systems theory, originally developed for turbulent fluid flows,\nprovides universal quantification of physics underlying fractal fluctuations and is\napplicable to all dynamical systems in nature independent of its physical, chemical,\nelectrical, or any other intrinsic characteristic. In the following, Sec. 2 gives a\nsummary of traditional statistical and mathematical theories/techniques used for\nanalysis and quantification of space-time fluctuation data sets. The general systems\ntheory for fractal space-time fluctuations is described in Sec. 3. Sec. 4 deals with data\nand analyses techniques. Discussion and conclusions of results are presented in Sec.\n5.\n\n2. Statistical methods for data analysis\nDynamical systems such as atmospheric flows, stock markets, heartbeat patterns,\npopulation growth, traffic flows, etc., exhibit irregular space-time fluctuation patterns.\nQuantification of the space-time fluctuation pattern will help predictability studies, in\nparticular for events which affect day-to-day human life such as extreme weather\nevents, stock market crashes, traffic jams, etc. The analysis of data sets and broad\nquantification in terms of probabilities belongs to the field of statistics. Early attempts\nresulted in identification of the following two quantitative (mathematical)\ndistributions which approximately fit data sets from a wide range of scientific and\nother disciplines of study. The first is the well known statistical normal distribution\nand the second is the power law distribution associated with the recently identified\n'fractals' or selfsimilar characteristic of data sets in general. In the following, a\nsummary is given of the history and merits of the two distributions.\n\n\f2.1 Statistical normal distribution\nHistorically, our present day methods of handling experimental data have their roots\nabout four hundred years ago. At that time scientists began to calculate the odds in\ngambling games. From those studies emerged the theory of probability and\nsubsequently the theory of statistics. These new statistical ideas suggested a different\nand more powerful experimental approach. The basic idea was that in some\nexperiments random errors would make the value measured a bit higher and in other\nexperiments random errors would make the value measured a bit lower. Combining\nthese values by computing the average of the different experimental results would\nmake the errors cancel and the average would be closer to the \"right\" value than the\nresult of any one experiment (Liebovitch and Scheurle, 2000).\nAbraham de Moivre, an 18th century statistician and consultant to gamblers made\nthe first recorded discovery of the normal curve of error (or the bell curve because of\nits shape) in 1733. The normal distribution is the limiting case of the binomial\ndistribution resulting from random operations such as flipping coins or rolling dice.\nSerious interest in the distribution of errors on the part of mathematicians such as\nLaplace and Gauss awaited the early nineteenth century when astronomers found the\nbell curve to be a useful tool to take into consideration the errors they made in their\nobservations of the orbits of the planets (Goertzel and Fashing, 1981, 1986). The\nimportance of the normal curve stems primarily from the fact that the distributions of\nmany natural phenomena are at least approximately normally distributed. This normal\ndistribution concept has molded how we analyze experimental data over the last two\nhundred years. We have come to think of data as having values most of which are\nnear an average value, with a few values that are smaller, and a few that are larger.\nThe probability density function, PDF(x), is the probability that any measurement has\na value between x and x + dx. We suppose that the PDF of the data has a normal\ndistribution. Most quantitative research involves the use of statistical methods\npresuming independence among data points and Gaussian 'normal' distributions\n(Andriani and McKelvey, 2007). The Gaussian distribution is reliably characterized\nby its stable mean and finite variance (Greene, 2002). Normal distributions place a\ntrivial amount of probability far from the mean and hence the mean is representative\nof most observations. Even the largest deviations, which are exceptionally rare, are\nstill only about a factor of two from the mean in either direction and are well\ncharacterized by quoting a simple standard deviation (Clauset, Shalizi, and Newman,\n2007). However, apparently rare real life catastrophic events such as major earth\nquakes, stock market crashes, heavy rainfall events, etc., occur more frequently than\nindicated by the normal curve, i.e., they exhibit a probability distribution with a fat\ntail. Fat tails indicate a power law pattern and interdependence. The \"tails\" of a\npower-law curve - the regions to either side that correspond to large fluctuations -\nfall off very slowly in comparison with those of the bell curve (Buchanan, 2004). The\nnormal distribution is therefore an inadequate model for extreme departures from the\nmean.\nThe following references are cited by Goertzel and Fashing (1981, 1986) to show\nthat the bell curve is an empirical model without supporting theoretical basis: (i)\nModern texts usually recognize that there is no theoretical justification for the use of\nthe normal curve, but justify using it as a convenience (Cronbach, 1970). (ii) The bell\ncurve came to be generally accepted, as M. Lippmnan remarked to Poincare (Bradley,\n1969), because \"...the experimenters fancy that it is a theorem in mathematics and the\nmathematicians that it is an experimental fact\". (iii) Karl Pearson (best known today\nfor the invention of the product-moment correlation coefficient) used his newly\n\n\fdeveloped Chi Square test to check how closely a number of empirical distributions of\nsupposedly random errors fitted the bell curve. He found that many of the\ndistributions that had been cited in the literature as fitting the normal curve were\nactually significantly different from it, and concluded that \"the normal curve of error\npossesses no special fitness for describing errors or deviations such as arise either in\nobserving practice or in nature\" (Pearson, 1900).\n2.2 Fractal fluctuations and statistical analysis\nFractals are the latest development in statistics. The space-time fluctuation pattern in\ndynamical systems was shown to have a selfsimilar or fractal structure in the 1970s\n(Mandelbrot, 1975). The larger scale fluctuation consists of smaller scale fluctuations\nidentical in shape to the larger scale. An appreciation of the properties of fractals is\nchanging the most basic ways we analyze and interpret data from experiments and is\nleading to new insights into understanding physical, chemical, biological,\npsychological, and social systems. Fractal systems extend over many scales and so\ncannot be characterized by a single characteristic average number (Liebovitch and\nScheurle, 2000). Further, the selfsimilar fluctuations imply long-range space-time\ncorrelations or interdependence. Therefore, the Gaussian distribution will not be\napplicable for description of fractal data sets. However, the bell curve still continues\nto be used for approximate quantitative characterization of data which are now\nidentified as fractal space-time fluctuations.\n2.2.1 Power laws and fat tails\nFractals conform to power laws. A power law is a relationship in which one quantity\nA is proportional to another B taken to some power n; that is, A~Bn (Buchanan, 2004).\nOne of the oldest scaling laws in geophysics is the Omori law (Omori, 1895). This\nlaw describes the temporal distribution of the number of after-shocks, which occur\nafter a larger earthquake (i.e. main-shock) by a scaling relationship. Richardson\n(1960) came close to the concept of fractals when he noted that the estimated length\nof an irregular coastline scales with the length of the measuring unit. Andriani and\nMcKelvey (2007) have given exhaustive references to earliest known work on power\nlaw relationships summarized as follows. Pareto (1897) first noticed power laws and\nfat tails in economics. Cities follow a power law when ranked by population\n(Auerbach, 1913). Dynamics of earthquakes follow power law (Gutenberg and\nRichter, 1944) and Zipf (1949) found that a power law applies to word frequencies\n(Estoup (1916), had earlier found a similar relationship). Mandelbrot (1963)\nrediscovered them in the 20th century, spurring a small wave of interest in finance\n(Fama, 1965; Montroll and Shlesinger, 1984). However, the rise of the 'standard'\nmodel (Gaussian) of efficient markets, sent power law models into obscurity. This\nlasted until the 1990s, when the occurrence of catastrophic events, such as the 1987\nand 1998 financial crashes, that were difficult to explain with the 'standard' models\n(Bouchaud et al., 1998), re-kindled the fractal model (Mandelbrot and Hudson, 2004).\nA power law world is dominated by extreme events ignored in a Gaussian-world.\nIn fact, the fat tails of power law distributions make large extreme events orders-ofmagnitude more likely. Theories explaining power laws are also scale-free. This is to\nsay, the same explanation (theory) applies at all levels of analysis (Andriani and\nMcKelvey, 2007).\n\n\f2.2.2 Scale-free theory for power laws with fat, long tails\nA scale-free theory for the observed fractal fluctuations in atmospheric flows shows\nthat the observed long-range spatiotemporal correlations are intrinsic to quantumlike\nchaos governing fluid flows. The model concepts are independent of the exact details\nsuch as the chemical, physical, physiological and other properties of the dynamical\nsystem and therefore provide a general systems theory applicable to all real world and\ncomputed dynamical systems in nature (Selvam, 1998, 1999, 2001a, b, 2002a, b,\n2004, 2005, 2007; Selvam et al., 2000). The model is based on the concept that the\nirregular fractal fluctuations may be visualized to result from the superimposition of\nan eddy continuum, i.e., a hierarchy of eddy circulations generated at each level by\nthe space-time integration of enclosed small-scale eddy fluctuations. Such a concept\nof space-time fluctuation averaged distributions should follow statistical normal\ndistribution according to Central Limit Theorem in traditional Statistical theory\n(Ruhla, 1992). Also, traditional statistical/mathematical theory predicts that the\nGaussian, its Fourier transform and therefore Fourier transform associated power\nspectrum are the same distributions. The Fourier transform of normal distribution is\nessentially a normal distribution. A power spectrum is based on the Fourier transform,\nwhich expresses the relationship between time (space) domain and frequency domain\ndescription of any physical process (Phillips, 2005; Riley, Hobson and Bence, 2006).\nHowever, the model (Sec. 3) visualises the eddy growth process in successive stages\nof unit length-step growth with ordered two-way energy feedback between the larger\nand smaller scale eddies and derives a power law probability distribution P which is\nclose to the Gaussian for small deviations and gives the observed fat, long tail for\nlarge fluctuations. Further, the model predicts the power spectrum of the eddy\ncontinuum also to follow the power law probability distribution P.\nIn summary, the model predicts the following: (i) The eddy continuum consists of\nan overall logarithmic spiral trajectory with the quasiperiodic Penrose tiling pattern\nfor the internal structure. (ii)The successively larger eddy space-time scales follow the\nFibonacci number series. (iii) The probability distribution P of fractal domains for the\nnth step of eddy growth is equal to τ-4n where τ is the golden mean equal to (1+√5)/2\n(≈1.618). The probability distribution P is close to the statistical normal distribution\nfor n values less than 2 and greater than normal distribution for n more than 2, thereby\ngiving a fat, long tail. (iv) The probability distribution P also represents the relative\neddy energy flux in the fractal domain. The square of the eddy amplitude (variance)\nrepresents the eddy energy and therefore the eddy probability density P. Such a result\nthat the additive amplitudes of eddies when squared represent probabilities, is\nexhibited by the sub-atomic dynamics of quantum systems such as the electron or\nproton (Maddox, 1988, 1993; Rae, 1988). Therefore fractal fluctuations are signatures\nof quantumlike chaos in dynamical systems. (v) The universal algorithm for selforganized criticality is expressed in terms of the universal Feigenbaum's constants\n(Feigenbaum, 1980) a and d as 2a 2 = πd where the fractional volume intermittency\nof occurrence πd contributes to the total variance 2a2 of fractal structures. (vi) The\nFeigenbaum's constants are expressed as functions of the golden mean. The\nprobability distribution P of fractal domains is also expressed in terms of the\nFeigenbaum's constants a and d. The details of the model are summarized in the\nfollowing section (Sec. 3)\n\n\f3. A general systems theory for fractal fluctuations\nThe fractal space-time fluctuations of dynamical systems may be visualized to result\nfrom the superimposition of an ensemble of eddies (sine waves), namely an eddy\ncontinuum. The relationship between large and small eddy circulation parameters are\nobtained on the basis of Townsend's (1956) concept that large eddies are envelopes\nenclosing turbulent eddy (small-scale) fluctuations (Fig. 2).\n\nFigure 2: Physical concept of eddy growth process by the self-sustaining\nprocess of ordered energy feedback between the larger and smaller scales, the\nsmaller scales forming the internal circulations of larger scales. The figure\nshows a uniform distribution of dominant turbulent scale eddies of length\nscale 2r. Larger-eddy circulations such as ABCD form as coherent structures\nsustained by the enclosed turbulent eddies.\n\nThe relationship between root mean square (r. m. s.) circulation speeds W and w*\nrespectively of large and turbulent eddies of respective radii R and r is then given as\nW2 =\n\n2 r 2\nw*\nπR\n\n(1)\n\nThe dynamical evolution of space-time fractal structures is quantified in terms of\nordered energy flow between fluctuations of all scales in Eq. (1), because the square\nof the eddy circulation speed represents the eddy energy (kinetic). A hierarchical\ncontinuum of eddies is generated by the integration of successively larger enclosed\nturbulent eddy circulations. Such a concept of space-time fluctuation averaged\ndistributions should follow statistical normal distribution according to Central Limit\nTheorem in traditional Statistical theory (Ruhla, 1992). Also, traditional\nstatistical/mathematical theory predicts that the Gaussian, its Fourier transform and\ntherefore Fourier transform associated power spectrum are the same distributions.\n\n\fHowever, the general systems theory (Selvam, 1998, 1999, 2001a, b, 2002a, b, 2004,\n2005, 2007; Selvam et al., 2000) visualises the eddy growth process in successive\nstages of unit length-step growth with ordered two-way energy feedback between the\nlarger and smaller scale eddies and derives a power law probability distribution P\nwhich is close to the Gaussian for small deviations and gives the observed fat, long\ntail for large fluctuations. Further, the model predicts the power spectrum of the eddy\ncontinuum also to follow the power law probability distribution P. Therefore the\nadditive amplitudes of the eddies when squared (variance), represent the probability\ndistribution similar to the subatomic dynamics of quantum systems such as the\nelectron or photon. Fractal fluctuations therefore exhibit quantumlike chaos.\nThe above-described analogy of quantumlike mechanics for dynamical systems is\nsimilar to the concept of a subquantum level of fluctuations whose space-time\norganization gives rise to the observed manifestation of subatomic phenomena, i.e.,\nquantum systems as order out of chaos phenomena (Grossing, 1989).\n\n3.1 Quasicrystalline structure of the eddy continuum\nThe turbulent eddy circulation speed and radius increase with the progressive growth\nof the large eddy (Selvam, 1990). The successively larger turbulent fluctuations,\nwhich form the internal structure of the growing large eddy, may be computed (Eq. 1)\nas\nw∗2 =\n\nπ R 2\nW\n2 dR\n\n(2)\n\nDuring each length step growth dR, the small-scale energizing perturbation Wn at\nthe nth instant generates the large-scale perturbation Wn+1 of radius R where\nn\n\nR = ∑ dR since successive length-scale doubling gives rise to R. Eq. 2 may be\n1\n\nwritten in terms of the successive turbulent circulation speeds Wn and Wn+1 as\nWn2+1 =\n\nπ R 2\nWn\n2 dR\n\n(3)\n\nThe angular turning dθ inherent to eddy circulation for each length step growth is\nequal to dR/R. The perturbation dR is generated by the small-scale acceleration Wn at\nany instant n and therefore dR=Wn. Starting with the unit value for dR the successive\nWn, Wn+1, R, and dθ values are computed from Eq. 3 and are given in Table 2.\nTable 2. The computed spatial growth of the strange-attractor design traced by the macro-scale\ndynamical system of atmospheric flows as shown in Fig. 3.\nR\n1.000\n2.000\n3.254\n5.239\n8.425\n13.546\n21.780\n35.019\n56.305\n90.530\n\nWn\n1.000\n1.254\n1.985\n3.186\n5.121\n8.234\n13.239\n21.286\n34.225\n55.029\n\ndR\n1.000\n1.254\n1.985\n3.186\n5.121\n8.234\n13.239\n21.286\n34.225\n55.029\n\ndθ\n1.000\n0.627\n0.610\n0.608\n0.608\n0.608\n0.608\n0.608\n0.608\n0.608\n\nWn+1\n1.254\n1.985\n3.186\n5.121\n8.234\n13.239\n21.286\n34.225\n55.029\n88.479\n\nθ\n1.000\n1.627\n2.237\n2.845\n3.453\n4.061\n4.669\n5.277\n5.885\n6.493\n\n\fIt is seen that the successive values of the circulation speed W and radius R of the\ngrowing turbulent eddy follow the Fibonacci mathematical number series such that\nRn+1=Rn+Rn-1 and Rn+1/Rn is equal to the golden mean τ, which is equal to [(1 + √5)/2]\n≅ (1.618). Further, the successive W and R values form the geometrical progression\nR0(1+τ+τ2+τ3+τ4+ ....) where R0 is the initial value of the turbulent eddy radius.\nTurbulent eddy growth from primary perturbation ORO starting from the origin O\n(Fig. 3) gives rise to compensating return circulations OR1R2 on either side of ORO,\nthereby generating the large eddy radius OR1 such that OR1/ORO=τ and\nROOR1=π/5=ROR1O. Therefore, short-range circulation balance requirements\ngenerate successively larger circulation patterns with precise geometry that is\ngoverned by the Fibonacci mathematical number series, which is identified as a\nsignature of the universal period doubling route to chaos in fluid flows, in particular\natmospheric flows. It is seen from Fig. 3 that five such successive length step growths\ngive successively increasing radii OR1, OR2, OR3, OR4 and OR5 tracing out one\ncomplete vortex-roll circulation such that the scale ratio OR5/ORO is equal to τ5=11.1.\nThe envelope R1R2R3R4R5 (Fig. 3) of a dominant large eddy (or vortex roll) is found\nto fit the logarithmic spiralR=R0ebθ where R0=ORO, b=tan δ with δ the crossing angle\nequal to π/5, and the angular turning θ for each length step growth is equal to π/5. The\nsuccessively larger eddy radii may be subdivided again in the golden mean ratio. The\ninternal structure of large-eddy circulations is therefore made up of balanced smallscale circulations tracing out the well-known quasi-periodic Penrose tiling pattern\nidentified as the quasi-crystalline structure in condensed matter physics. A complete\ndescription of the atmospheric flow field is given by the quasi-periodic cycles with\nFibonacci winding numbers.\n3.2 Model predictions\n\nThe model predictions (Selvam, 1990, 2005, 2007; Selvam and Fadnavis, 1998) are\n(a) Atmospheric flows trace an overall logarithmic spiral trajectory OROR1R2R3R4R5\nsimultaneously in clockwise and anti-clockwise directions with the quasi-periodic\nPenrose tiling pattern (Steinhardt, 1997) for the internal structure shown in Fig. 3.\n\nFigure 3. The quasiperiodic Penrose tiling\npattern\n\nThe spiral flow structure can be\nvisualized as an eddy continuum generated\nby successive length step growths ORO,\nOR1, OR2, OR3,....respectively equal to R1,\nR2,\nR3,....which\nfollow\nFibonacci\nmathematical series such that Rn+1=Rn+Rn-1\nand Rn+1/Rn=τ where τ is the golden mean\nequal to (1+√5)/2 (≈1.618). Considering a\nnormalized length step equal to 1 for the\nlast stage of eddy growth, the successively\ndecreasing radial length steps can be\nexpressed as 1, 1/τ, 1/τ2, 1/τ3, ......The\nnormalized eddy continuum comprises of\nfluctuation length scales 1, 1/τ, 1/τ2, ........\nThe probability of occurrence is equal to\n1/τ and 1/τ2 respectively for eddy length\nscale 1/τ in any one or both rotational\n(clockwise and anti-clockwise) directions.\n\n\fEddy fluctuation length of amplitude 1/τ has a probability of occurrence equal to 1/τ2\nin both rotational directions, i.e., the square of eddy amplitude represents the\nprobability of occurrence in the eddy continuum. Similar result is observed in the\nsubatomic dynamics of quantum systems which are visualized to consist of the\nsuperimposition of eddy fluctuations in wave trains (eddy continuum).\n(b) The overall logarithmic spiral flow structure is given by the relation\nW=\n\nw∗\nln z\nk\n\n(4)\n\nIn Eq. (4) the constant k is the steady state fractional volume dilution of large eddy by\ninherent turbulent eddy fluctuations and z is the length scale ratio R/r. The constant k\nis equal to 1/τ2 (≅ 0.382) and is identified as the universal constant for deterministic\nchaos in fluid flows. The steady state emergence of fractal structures is therefore\nequal to\n1\n≅ 2.62\nk\n\n(5)\n\nIn Eq. (4), W represents the standard deviation of eddy fluctuations, since W is\ncomputed as the instantaneous r. m. s. (root mean square) eddy perturbation amplitude\nwith reference to the earlier step of eddy growth. For two successive stages of eddy\ngrowth starting from primary perturbation w∗, the ratio of the standard deviations Wn+1\nand Wn is given from Eq. (4) as (n+1)/n. Denoting by σ the standard deviation of eddy\nfluctuations at the reference level (n=1) the standard deviations of eddy fluctuations\nfor successive stages of eddy growth are given as integer multiples of σ, i.e., σ, 2σ,\n3σ, etc. and correspond respectively to\nstatistical normalised s tan dard deviation t = 0, 1, 2, 3,....\n\n(6)\n\nThe conventional power spectrum plotted as the variance versus the frequency in\nlog-log scale will now represent the eddy probability density on logarithmic scale\nversus the standard deviation of the eddy fluctuations on linear scale since the\nlogarithm of the eddy wavelength represents the standard deviation, i.e., the r. m. s.\nvalue of eddy fluctuations (Eq. 4). The r. m. s. value of eddy fluctuations can be\nrepresented in terms of statistical normal distribution as follows. A normalized\nstandard deviation t=0 corresponds to cumulative percentage probability density\nequal to 50 for the mean value of the distribution. Since the logarithm of the\nwavelength represents the r. m. s. value of eddy fluctuations the normalized standard\ndeviation t is defined for the eddy energy as\nt=\n\nlog L\n−1\nlog T50\n\n(7)\n\nIn Eq. (7) L is the time period (or wavelength) and T50 is the period up to which the\ncumulative percentage contribution to total variance is equal to 50 and t = 0. LogT50\nalso represents the mean value for the r. m. s. eddy fluctuations and is consistent with\nthe concept of the mean level represented by r. m. s. eddy fluctuations. Spectra of\ntime series of meteorological parameters when plotted as cumulative percentage\n\n\fcontribution to total variance versus t have been shown to follow the model predicted\nuniversal spectrum (Selvam and Fadnavis, 1998) which is identified as a signature of\nquantumlike chaos.\n(c) Selvam (1993) has shown that Eq. (1) represents the universal algorithm for\ndeterministic chaos in dynamical systems and is expressed in terms of the\nuniversal Feigenbaum's (1980) constants a and d as follows. The successive\nlength step growths generating the eddy continuum OROR1R2R3R4R5 analogous to\nthe period doubling route to chaos (growth) is initiated and sustained by the\nturbulent (fine scale) eddy acceleration w∗, which then propagates by the inherent\nproperty of inertia of the medium of propagation. Therefore, the statistical\nparameters mean, variance, skewness and kurtosis of the perturbation field in the\nmedium of propagation are given by w∗, w∗2 , w∗3 and w∗4 respectively. The associated\ndynamics of the perturbation field can be described by the following parameters.\nThe perturbation speed w∗ (motion) per second (unit time) sustained by its inertia\nrepresents the mass, w∗2 the acceleration or force, w∗3 the angular momentum or\npotential energy, and w∗4 the spin angular momentum, since an eddy motion has\nan inherent curvature to its trajectory.\n\nIt is shown that Feigenbaum's constant a is equal to (Selvam, 1993)\na=\n\nW2 R2\nW1R1\n\n(8)\n\nIn Eq. (8) the subscripts 1 and 2 refer to two successive stages of eddy growth.\nFeigenbaum's constant a as defined above represents the steady state emergence of\nfractional Euclidean structures. Considering dynamical eddy growth processes,\nFeigenbaum's constant a also represents the steady state fractional outward mass\ndispersion rate and a2 represents the energy flux into the environment generated by\nthe persistent primary perturbation W1. Considering both clockwise and\ncounterclockwise rotations, the total energy flux into the environment is equal to 2a2.\nIn statistical terminology, 2a2 represents the variance of fractal structures for both\nclockwise and counterclockwise rotation directions.\nThe probability of occurrence Ptot of fractal domain W1R1 in the total larger eddy\ndomain WnRn in any (irrespective of positive or negative) direction is equal to\nPtot =\n\nW1R1\n= τ− 2 n\nWn Rn\n\nTherefore the probability P of occurrence of fractal domain W1R1 in the total larger\neddy domain WnRn in any one direction (either positive or negative) is equal to\n2\n\nWR \nP =  1 1  = τ− 4 n\n Wn Rn \n\nThe Feigenbaum's constant d is shown to be equal to (Selvam, 1993)\n\n(9)\n\n\fd=\n\nW24 R23\nW14 R13\n\n(10)\n\nEq. (10) represents the fractional volume intermittency of occurrence of fractal\nstructures for each length step growth. Feigenbaum's constant d also represents the\nrelative spin angular momentum of the growing large eddy structures as explained\nearlier.\nEq. (1) may now be written as\n2\n\n4\n\n2\n\n3\n\n2 W2 R 2 = π W4 R 3\nw∗ (dR )\nw∗ (dR )\n\n(11)\n\nIn Eq. (11) dR equal to r represents the incremental growth in radius for each\nlength step growth, i.e., r relates to the earlier stage of eddy growth.\nThe Feigenbaum's constant d represented by R/r is equal to\nd=\n\nW 4 R3\nw∗4 r 3\n\n(12)\n\nFor two successive stages of eddy growth\nd=\n\nW24 R23\nW14 R13\n\n(13)\n\nFrom Eq. (1)\nW12 =\n\n2 r 2\nw*\nπ R1\n\n2 r 2\nW =\nw*\nπ R2\n\n(14)\n\n2\n2\n\nTherefore\nW22 R1\n=\nW12 R2\n\n(15)\n\nSubstituting in Eq. (13)\nd=\n\nW24 R23 W22 W22 R23 R1 W22 R23 W22 R22\n=\n=\n=\nW14 R13 W12 W12 R13 R2 W12 R13 W12 R12\n\n(16)\n\nThe Feigenbaum's constant d represents the scale ratio R2/R1 and the inverse of the\nFeigenbaum's constant d equal to R1/R2 represents the probability (Prob)1 of\noccurrence of length scale R1 in the total fluctuation length domain R2 for the first\neddy growth step as given in the following\n\n\f(Prob )1 =\n\nR1 1 W12 R12\n= = 2 2 = τ− 4\nR2 d W2 R2\n\n(17)\n\nIn general for the nth eddy growth step, the probability (Prob)n of occurrence of\nlength scale R1 in the total fluctuation length domain Rn is given as\n\n(Prob )n =\n\nR1 W12 R12\n=\n= τ− 4 n\nRn Wn2 Rn2\n\n(18)\n\nThe above equation for probability (Prob)n also represents, for the nth eddy growth\nstep, the following statistical and dynamical quantities of the growing large eddy with\nrespect to the initial perturbation domain: (i) the statistical relative variance of fractal\nstructures, (ii) probability of occurrence of fractal domain in either positive or\nnegative direction, and (iii) the dynamical relative energy flux.\nSubstituting the Feigenbaum's constants a and d defined above (Eqs. 8 and 10),\nEq. (11) can be written as\n2a 2 = π d\n\n(19)\n\nIn Eq. (19) πd, the relative volume intermittency of occurrence contributes to the total\nvariance 2a2 of fractal structures.\nIn terms of eddy dynamics, the above equation states that during each length step\ngrowth, the energy flux into the environment equal to 2a2 contributes to generate\nrelative spin angular momentum equal to πd of the growing fractal structures.\nIt was shown at Eq. (5) above that the steady state emergence of fractal structures\nin fluid flows is equal to 1/k (=τ2) and therefore the Feigenbaum's constant a is equal\nto\n\na = τ2 =\n\n1\n= 2.62\nk\n\n(20)\n\n(d) The power spectra of fluctuations in fluid flows can now be quantified in terms of\nuniversal Feigenbaum's constant a as follows.\nThe normalized variance and therefore the statistical probability distribution is\nrepresented by (from Eq. 9)\nP = a −2 t\n\n(21)\n\nIn Eq. (21) P is the probability density corresponding to normalized standard\ndeviation t. The graph of P versus t will represent the power spectrum. The slope S of\nthe power spectrum is equal to\n\nS=\n\ndP\n≈ −P\ndt\n\n(22)\n\nThe power spectrum therefore follows inverse power law form, the slope\ndecreasing with increase in t. Increase in t corresponds to large eddies (low\nfrequencies) and is consistent with observed decrease in slope at low frequencies in\ndynamical systems.\n\n\fThe steady state emergence of fractal structures for each length step growth for any\none direction of rotation (either clockwise or anticlockwise) is equal to\n\na τ2\n=\n2 2\nsince the corresponding value for both direction is equal to a (Eqs. 5 and 20 ).\nThe emerging fractal space-time structures have moment coefficient of kurtosis\ngiven by the fourth moment equal to\n4\n\n8\n τ2 \n  = τ = 2.9356 ≈ 3\n 2  16\n \nThe moment coefficient of skewness for the fractal space-time structures is equal\nto zero for the symmetric eddy circulations. Moment coefficient of kurtosis equal to 3\nand moment coefficient of skewness equal to zero characterize the statistical normal\ndistribution. The model predicted power law distribution for fractal fluctuations is\nclose to the Gaussian distribution.\n\n(e) The relationship between Feigenbaum's constant a and power spectra is derived\nin the following.\nThe steady state emergence of fractal structures is equal to the Feigenbaum's constant\na (Eqs. 5 and 20). The relative variance of fractal structure which also represents the\nprobability P of occurrence of bidirectional fractal domain for each length step growth\n1\nis then equal to 1/a2. The normalized variance 2 n will now represent the statistical\na\nprobability density for the nth step growth according to model predicted quantumlike\nmechanics for fluid flows. Model predicted probability density values P are computed\nas\nP=\n\n1\n= τ− 4 n\na 2n\n\n(23)\n\nor\nP = τ−4 t\n\n(24)\n\nIn Eq. (24) t is the normalized standard deviation (Eq. 6). The model predicted P\nvalues corresponding to normalised deviation t values less than 2 are slightly less than\nthe corresponding statistical normal distribution values while the P values are\nnoticeably larger for normalised deviation t values greater than 2 (Table 1 and Fig. 4)\nand may explain the reported fat tail for probability distributions of various physical\nparameters (Buchanan, 2004). The model predicted P values plotted on a linear scale\n(Y-axis) shows close agreement with the corresponding statistical normal probability\nvalues as seen in Fig.4 (left side). The model predicted P values plotted on a\nlogarithmic scale (Y-axis) shows fat tail distribution for normalised deviation t values\ngreater than 2 as seen in Fig.4 (right side).\n\n\fTable 1: Model predicted and statistical normal probability density distributions\ngrowth step\nn\n1\n2\n3\n4\n5\n\nnormalized\ndeviation\nt\n1\n2\n3\n4\n5\n\ncumulative probability densities (%)\nmodel predicted\nP = τ-4t\n14.5898\n2.1286\n0.3106\n0.0453\n0.0066\n\nstatistical normal\ndistribution\n15.8655\n2.2750\n0.1350\n0.0032\n≈ 0.0\n\nFigure 4: Comparison of statistical normal distribution and computed (theoretical) probability\ndensity distribution. The same figure is plotted on the right side with logarithmic scale for the\nprobability axis (Y-axis) to show clearly that for normalized deviation t values greater than 2 the\ncomputed probability densities are greater than the corresponding statistical normal distribution\nvalues.\n\n4. Data and analysis\n4.1 Data sets used for the study\n\ni.\n\nSeven data sets of daily percentage changes in Dow Jones Index for successive\n10-year periods starting from the year 1930 to the year 2000. Dow Jones Index\nvalues were obtained from Dow Jones Industrial Average History File. Data\nfrom:\nDepartment\nof\nStatistics at Carnegie Mellon Univ.,\n(http://www.stat.cmu.edu/cmu-stats)\nat\nthe\ndata\nlink\nhttp://www.analyzeindices.com/dowhistory/djia-100.txt. The number of\ntrading days in the successive 10-year periods from 1930 to 2000 is shown in\nFig. 5a.\n\n\fii.\n\nThe Human chromosomes 1 to 22, x, y DNA base sequence was obtained\nfrom the entrez Databases, Homo sapiens Genome (build 36 Version 1) at\nhttp://www.ncbi.nlm.nih.gov/entrez. Contiguous data sets, each containing a\nminimum of 70 000 base pairs were chosen for the study for the chromosomes\n1 to 22, x, y. The total number of contiguous data sets, each containing a\nminimum of 70 000 base pairs, chosen for the study are given in Fig. 6a for\nthe chromosomes 1 to 22, x ,y. The number of times base C and also base G,\ni.e. (C+G), occur in successive blocks of 10 bases were determined in\nsuccessive length sections of 70000 base pairs giving a C+G frequency\ndistribution series of 7000 values for each data set.\n\niii.\n\nThe draft sequence of Takifugu rubripes (Puffer fish) genome assembly\nrelease 4 was obtained from \"The Fugu Informatics Network\"\n(ftp://fugu.biology.qmul.ac.uk/pub/fugu/scaffolds_4.zip)\nat\nSchool\nof\nBiological & Chemical Sciences, Queen Mary, University of London. The\nindividual contigs sizes range from 2-1100Kbp, nearly half the genome in just\n100 scaffolds, 80% of the genome in 300 scaffolds. Non-overlapping DNA\nsequence lengths without breaks (N values) were chosen and then grouped in\ntwo categories A and B; category A consists of DNA lengths greater than\n3Kbp (kilo base pairs) but less than 30Kbp and category B consists of DNA\nsequence lengths greater than 30Kbp. For convenience in averaging the\nresults, the Category A data lengths were grouped into 7 groups and category\nB data into 18 groups such that the total number of bases in each group is\nequal to about 12Mbp. The average, standard deviation, maximum, minimum\nand median DNA lengths (bp) for each group in the two data categories A and\nB are shown in Fig. 7a. It is seen that the mean is close to the median and\nalmost constant for the different data groups, particularly for category B (DNA\nlength > 30kbp). The number of times base C and also base G, i.e., (C+G),\noccur in successive blocks of 10 bases were determined in the DNA length\nsections giving a C+G frequency distribution series of 300 to 3000 values in\ncategory A and more than 3000 for category B.\n\n4.2\n\nAnalyses and results\n\nEach data set was represented as the frequency of occurrence f(i) in a suitable number\nn of class intervals x(i), i=1, n covering the range of values from minimum to the\nmaximum in the data set. The class interval x(i) represents dataset values in the range\nx(i) ± ∆x, where ∆x is a constant. The average av and standard deviation sd for the\ndata set is computed as\n\n∑ [x(i) × f (i)]\nn\n\nav =\n\n1\nn\n\n∑ f (i)\n1\nn\n\nsd =\n\n{\n\n}\n\n∑ [x(i ) − av ] × f (i)\n2\n\n1\nn\n\n∑ f (i)\n1\n\nThe average and standard deviation values are given in Figs. 5a, 6a and 7a\nrespectively for Dow Jones Index daily percentage changes, Human chromosomes 1\n\n\fto 22, x, y DNA base CG/10bp distribution and Takifugu rubripes (Puffer fish) DNA\nbase CG/10bp distribution.\nThe normalized deviation t values for class intervals t(i) were then computed as\nt (i ) =\n\nx(i) − av\nsd\n\nThe cumulative percentage probabilities of occurrence cmax(i) and cmin(i) were\nthen computed starting respectively from the maximum (i=n) and minimum (i=1)\nclass interval values as follows.\n∑ [x(i ) × f (i )]\ni\n\ncmax(i ) =\n\nn\nn\n\n∑ [x(i ) × f (i )]\n\n× 100.0\n\n1\n\n∑ [x (i ) × f (i )]\ni\n\ncmin(i ) =\n\n1\nn\n\n∑ [x (i ) × f (i )]\n\n× 100.0\n\n1\n\nThe cumulative percentage probability values cmax(i) and cmin(i) plotted with\nrespect to corresponding normalized deviation t(i) values with both linear and\nlogarithmic scale for the probability axis are shown in (i) Fig. 5b for Dow Jones Index\ndaily percentage changes, (ii) Fig. 6.1b for Human chromosomes 1 to 6 DNA base\nCG/10bp distributions, (iii) Fig. 6.2b for Human chromosomes 7 to 12 DNA base\nCG/10bp distributions, (iv) Fig. 6.3b for Human chromosomes 13 to x, y DNA base\nCG/10bp distributions, (v) Fig. 7b for Takifugu rubripes (Puffer fish) DNA base\nCG/10bp distributions. The figures also contain the statistical normal distribution for\ncomparison. The graphs with the probability axis on logarithmic scale includes the\ncomputed theoretical probabilities (Eq. 24) to show clearly the appreciable departure\nof observed probability densities from the statistical normal distribution at normalised\ndeviation t values more than 2.\n\n\fFigure 5a. Details of data sets for Dow Jones Index 10-year mean daily percentage changes for\nsuccessive 10-year periods from 1930 to 2000.\n\n\fFigure 5b. The cumulative percentage frequency distribution versus the normalized deviation t for Dow\nJones Index daily percentage changes for successive 10-year periods from 1930 to 2000, computed\nstarting from both maximum positive and maximum negative t values. The corresponding statistical\nnormal probability density distribution is shown in the figure. The same figure is plotted on the right\nside with logarithmic scale for probability (Y-axis) and includes computed (theoretical) probability\ndensities.\n\n\fFigure 6a: Details of Human chromosomes 1 to 22, X, Y data sets used in the study\n\n\fFigure 6.1b: The cumulative percentage frequency distribution versus the normalized deviation t\nfor DNA base CG/10bp in Human chromosomes 1 to 6 (Build 36.1) computed starting from both\nmaximum positive and maximum negative t values. The corresponding statistical normal\nprobability density distribution is shown in the figure. The same figure is plotted on the right side\nwith logarithmic scale for probability (Y-axis) and includes computed (theoretical) probability\ndensities.\n\nFigure 6.2b: The cumulative percentage frequency distribution versus the normalized deviation t\nfor DNA base CG/10bp in Human chromosomes 7 to 12 (Build 36.1) computed starting from both\nmaximum positive and maximum negative t values. The corresponding statistical normal\nprobability density distribution is shown in the figure. The same figure is plotted on the right side\nwith logarithmic scale for probability (Y-axis) and includes computed (theoretical) probability\ndensities.\n\n\fFigure 6.3b: The cumulative percentage frequency distribution versus the normalized deviation t\nfor DNA base CG/10bp in Human chromosomes 13 to 22, X, Y (Build 36.1) computed starting\nfrom both maximum positive and maximum negative t values. The corresponding statistical normal\nprobability density distribution is shown in the figure. The same figure is plotted on the right side\nwith logarithmic scale for probability (Y-axis) and includes computed (theoretical) probability\ndensities.\n\n\fFig. 7a. Takifugu rubripes (Puffer fish) DNA base CG/10bp concentration. Details of data sets and\naveraged results .\n\n\fFigure 7b: The cumulative percentage frequency distribution versus the normalized deviation t for\nDNA base CG/10bp in Takifugu rubripes (Puffer fish) computed starting from both maximum\npositive and negative t values. The corresponding statistical normal probability density distribution\nis also shown in the figure. The same figure is plotted on the right side with logarithmic scale for\nprobability (Y-axis) and includes computed (theoretical) probability densities.\n\n5. Discussion and conclusions\nDynamical systems in nature exhibit selfsimilar fractal fluctuations for all space-time\nscales and the corresponding power spectra follow inverse power law form signifying\nlong-range space-time correlations identified as self-organized criticality. The physics\nof self-organized criticality is not yet identified. The Gaussian probability distribution\nused widely for analysis and description of large data sets is found to significantly\nunderestimate the probabilities of occurrence of extreme events such as stock market\ncrashes, earthquakes, heavy rainfall, etc. Further, the assumptions underlying the\nnormal distribution such as fixed mean and standard deviation, independence of data,\nare not valid for real world fractal data sets exhibiting a scale-free power law\ndistribution with fat tails. It is important to identify and quantify the fractal\ndistribution characteristics of dynamical systems for predictability studies.\nA recently developed general systems theory for fractal space-time fluctuations\n(Selvam, 1990, 2005, 2007; Selvam and Fadnavis, 1998) shows that the larger scale\nfluctuation can be visualized to emerge from the space-time averaging of enclosed\nsmall scale fluctuations, thereby generating a hierarchy of selfsimilar fluctuations\nmanifested as the observed eddy continuum in power spectral analyses of fractal\nfluctuations. Such a concept results in inverse power law form τ-4t incorporating τ, the\ngolden mean and t, the normalized deviation, for the space-time fluctuation pattern\nand also for the power spectra of the fluctuations (Sec. 3). Since the power spectrum\n(square of eddy amplitude) also represents the probability densities as in the case of\nquantum systems such as the electron or photon, fractal fluctuations exhibit\nquantumlike chaos. The predicted distribution is close to the Gaussian distribution for\nsmall-scale fluctuations, but exhibits fat long tail for large-scale fluctuations. Analysis\nof extensive data sets of (i) Daily percentage change of Dow Jones Index (ii) Human\nDNA base CG concentration/10bp (base pairs) (iii) Takifugu rubripes (Puffer fish)\nDNA base CG concentration/10bp give the following results: (a) the data follow\n\n\fclosely, but not exactly the statistical normal distribution in the region of normalized\ndeviations t less than 2, the t values being computed as equal to (x-av)/sd where av\nand sd denote respectively the mean and standard deviation of the variable x (b) For\nnormalized deviations t greater than 2, the data exhibit significantly larger\nprobabilities as compared to the normal distribution and closer to the model predicted\nprobability distribution. The general systems theory, originally developed for\nturbulent fluid flows, provides universal quantification of physics underlying fractal\nfluctuations and is applicable to all dynamical systems in nature independent of its\nphysical, chemical, electrical, or any other intrinsic characteristic.\n\nAcknowledgement\nThe author is grateful to Dr. A. S. R. Murty for encouragement during the course of\nthis study.\n\nReferences\nAndriani, P. and McKelvey. B., 2007: Beyond Gaussian averages: Redirecting management research toward\nextreme events and power laws. Journal of International Business Studies 38, 1212–1230.\nAuerbach, F., 1913: Das Gesetz Der Bevolkerungskoncentration, Petermanns Geographische Mitteilungen 59, 74–\n76.\nBak, P. C., Tang, C. and Wiesenfeld, K., 1988: Self-organized criticality. Phys. Rev. A. 38, 364 - 374.\nBouchaud, J. P., Sornette, D., Walter, C. and Aguilar, J. P., 1998: Taming large events: Optimal portfolio theory\nfor strongly fluctuating assets. International Journal of Theoretical and Applied Finance 1(1), 25–41.\nBradley, J. V., 1968: Distribution-free Statistical Tests. Englewood Cliffs, Prentice-Hall, N.J.\nBuchanan, M., 2004: Power laws and the new science of complexity management. Strategy and Business Issue 34,\n70-79.\nClauset, A., Shalizi, C. R. and Newman, M. E. J., 2007: Power-law distributions in empirical data.\narXiv:0706.1062v1 [physics.data-an].\nCronbach, L., 1970: Essentials of Psychological Testing. Harper & Row, New York.\nEstoup, J. B., 1916: Gammes Stenographiques, Institut Stenographique de France, Paris.\nFama, E. F., 1965:The behavior of stock-market prices. Journal of Business 38, 34–105.\nFeigenbaum, M. J., 1980: Universal behavior in nonlinear systems. Los Alamos Sci. 1, 4-27.\nGoertzel, T. and Fashing, J., 1981: The myth of the normal curve: A theoretical critique and examination of its role\nin teaching and research. Humanity and Society 5, 14-31; reprinted in Readings in Humanist Sociology,\nGeneral Hall, 1986. http://crab.rutgers.edu/~goertzel/normalcurve.htm 4/29/2007\nGreene, W. H., 2002: Econometric Analysis (5th ed.). Prentice-Hall, Englewood Cliffs, NJ.\nGrossing, G., 1989: Quantum systems as order out of chaos phenomena. Il Nuovo Cimento 103B, 497-510.\nGutenberg, B. and Richter, R. F., 1944: Frequency of earthquakes in California. Bulletin of the Seismological\nSociety of America 34, 185–188.\nLiebovitch, L. S. and Scheurle, D., 2000: Two lessons from fractals and chaos. Complexity 5(4), 34–43.\nMaddox, J., 1988: Licence to slang Copenhagen? Nature 332, 581.\nMaddox, J., 1993: Can quantum theory be understood? Nature 361, 493.\nMandelbrot, B. B., 1963: The variation of certain speculative prices. Journal of Business 36, 394–419.\nMandelbrot, B. B., 1975: Les Objets Fractals: Forme, Hasard et Dimension. Flammarion, Paris.\nMandelbrot, B. B. and Hudson, R. L., 2004: The (Mis)Behavior of Markets: A Fractal View of Risk, Ruin and\nReward. Profile, London.\nMontroll, E. and Shlesinger, M., 1984: On the wonderful world of random walks, in J. L. Lebowitz and E. W.\nMontroll (eds.) Nonequilibrium Phenomena II, from Stochastic to Hydrodynamics. North Holland,\nAmsterdam, pp. 1–121.\nOmori, F., 1895: On the aftershocks of earthquakes. J. Coll. Sci. 7, 111.\nPareto, V., 1897: Cours d'Economie Politique. Rouge, Paris.\nPearson, K., 1900: The Grammar of Science (2nd ed.). Adam and Charles Black, London:\nPhillips, T., 2005: The Mathematical Uncertainty Principle. Monthly Essays on Mathematical Topics, November\n2005, American Mayhematical Society. http://www.ams.org/featurecolumn/archive/uncertainty.html\nRae, A., 1988: Quantum-Physics: Illusion or Reality? Cambridge University Press, New York.\n\n\fRichardson, L. F., 1960: The problem of contiguity: An appendix to statistics of deadly quarrels, In: Von\nBertalanffy, L., Rapoport, A., (eds.) General Systems - Year Book of The Society for General Systems\nResearch V, pp 139-187, Ann Arbor, MI.\nRiley, K. F., Hobson, M. P. and Bence, S. J., 2006: Mathematical Methods for Physics and Engineering (3rd ed.).\nCambridge University Press, USA.\nRuhla, C. 1992: The Physics of Chance. Oxford University Press, pp.217.\nSchroeder, M., 1990: Fractals, Chaos and Power-laws. W. H. Freeman and Co., N. Y.\nSelvam, A. M., 1990: Deterministic chaos, fractals and quantumlike mechanics in atmospheric flows. Can. J. Phys.\n68, 831-841. http://xxx.lanl.gov/html/physics/0010046\nSelvam, A. M., 1993: Universal quantification for deterministic chaos in dynamical systems. Applied Math.\nModelling 17, 642-649. http://xxx.lanl.gov/html/physics/0008010\nSelvam A. M., Fadnavis, S., 1998: Signatures of a universal spectrum for atmospheric inter-annual variability in\nsome disparate climatic regimes. Meteorology and Atmospheric Physics 66, 87-112.\nhttp://xxx.lanl.gov/abs/chao-dyn/9805028\nSelvam, A. M., and Fadnavis, S., 1999: Superstrings, cantorian-fractal spacetime and quantum-like chaos in\natmospheric flows. Chaos Solitons and Fractals 10, 1321-1334. http://xxx.lanl.gov/abs/chao-dyn/9806002\nSelvam, A. M., Sen, D. and Mody, S. M. S., 2000: Critical fluctuations in daily incidence of acute myocardial\ninfarction. Chaos, Solitons and Fractals 11, 1175-1182. http://xxx.lanl.gov/abs/chao-dyn/9810017\nSelvam, A. M. 2001a: Quantum-like chaos in prime number distribution and in turbulent fluid flows. Apeiron 8,\n29-64. http://redshift.vif.com/JournalFiles/V08NO3PDF/V08N3SEL.PDF\nhttp://xxx.lanl.gov/html/physics/0005067\nSelvam, A. M. 2001b: Signatures of quantum-like chaos in spacing intervals of non-trivial Riemann zeta zeros and\nin turbulent fluid flows. Apeiron 8, 10-40. http://redshift.vif.com/JournalFiles/V08NO4PDF/V08N4SEL.PDF\nhttp://xxx.lanl.gov/html/physics/0102028\nSelvam, A. M., 2002a: Cantorian fractal space-time fluctuations in turbulent fluid flows and the kinetic theory of\ngases. Apeiron 9,1-20. http://redshift.vif.com/JournalFiles/V09NO2PDF/V09N2sel.PDF\nhttp://xxx.lanl.gov/html/physics/9912035\nSelvam, A. M., 2002b: Quantumlike chaos in the frequency distributions of the bases A, C, G, T in Drosophila\nDNA. Apeiron 9, 103-148. http://redshift.vif.com/JournalFiles/V09NO4PDF/V09N4sel.pdf\nhttp://arxiv.org/html/physics/0210068\nSelvam, A. M., 2004: Quantumlike Chaos in the Frequency Distributions of the Bases A, C, G, T in human\nchromosome 1 DNA. Apeiron 11, 134-146.\nhttp://redshift.vif.com/JournalFiles/V11NO3PDF/V11N3SEL.PDF http://arxiv.org/html/physics/0211066\nSelvam, A. M., 2005: A general systems theory for chaos, quantum mechanics and gravity for dynamical systems\nof all space-time scales. ELECTROMAGNETIC PHENOMENA 5, No.2(15), 160-176.\nhttp://arxiv.org/pdf/physics/0503028\nSelvam, A. M., 2007: Chaotic Climate Dynamics. Luniver Press, UK.\nSteinhardt, P., 1997: Crazy crystals. New Scientist 25 Jan., 32-35.\nTownsend, A. A., 1956: The Structure of Turbulent Shear Flow (2nd ed.) Cambridge University Press, London,\nU.K., pp.115-130.\nZipf, G.K., 1949: Human Behavior and the Principle of Least Effort. Hafner, New York.\n\n\f"}