{"id": "http://arxiv.org/abs/0706.2500v2", "guidislink": true, "updated": "2007-09-12T05:19:14Z", "updated_parsed": [2007, 9, 12, 5, 19, 14, 2, 255, 0], "published": "2007-06-17T18:20:25Z", "published_parsed": [2007, 6, 17, 18, 20, 25, 6, 168, 0], "title": "Unusual temperature behavior of entropy of antiferromagnetic spin state\n  in nuclear matter with effective finite range interaction", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.3671%2C0706.0227%2C0706.2165%2C0706.0292%2C0706.1678%2C0706.0414%2C0706.2874%2C0706.0004%2C0706.2466%2C0706.2843%2C0706.2137%2C0706.4306%2C0706.2094%2C0706.3016%2C0706.2239%2C0706.3169%2C0706.4383%2C0706.1440%2C0706.3376%2C0706.1732%2C0706.0798%2C0706.1760%2C0706.1772%2C0706.3399%2C0706.3126%2C0706.3637%2C0706.0653%2C0706.0510%2C0706.3277%2C0706.2767%2C0706.4288%2C0706.1543%2C0706.1041%2C0706.3944%2C0706.0538%2C0706.3451%2C0706.2066%2C0706.0058%2C0706.1289%2C0706.0489%2C0706.3693%2C0706.2106%2C0706.1892%2C0706.1235%2C0706.3354%2C0706.2879%2C0706.2953%2C0706.3441%2C0706.4457%2C0706.3453%2C0706.1382%2C0706.4069%2C0706.3653%2C0706.0530%2C0706.2766%2C0706.0272%2C0706.2448%2C0706.0534%2C0706.4308%2C0706.1310%2C0706.3265%2C0706.2570%2C0706.3234%2C0706.1428%2C0706.2500%2C0706.0241%2C0706.0692%2C0706.4143%2C0706.0170%2C0706.0953%2C0706.0052%2C0706.0934%2C0706.2140%2C0706.0471%2C0706.1955%2C0706.1923%2C0706.0383%2C0706.1326%2C0706.0001%2C0706.4337%2C0706.1870%2C0706.2681%2C0706.4436%2C0706.3682%2C0706.2854%2C0706.1309%2C0706.1152%2C0706.1845%2C0706.2892%2C0706.3590%2C0706.3308%2C0706.0303%2C0706.3955%2C0706.1782%2C0706.1317%2C0706.2053%2C0706.4299%2C0706.1394%2C0706.3765%2C0706.0482%2C0706.2139&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Unusual temperature behavior of entropy of antiferromagnetic spin state\n  in nuclear matter with effective finite range interaction"}, "summary": "The unusual temperature behavior of the entropy of the antiferromagnetic\n(AFM) spin state in symmetric nuclear matter with the Gogny D1S interaction,\nbeing larger at low temperatures than the entropy of nonpolarized matter, is\nrelated to the dependence of the entropy on the effective masses of nucleons in\na spin polarized state. The corresponding conditions for comparing the\nentropies of the AFM and nonpolarized states in terms of the effective masses\nare formulated, including low and high temperature limits. It is shown that the\nunexpected temperature behavior of the entropy of the AFM spin state at low\ntemperatures is caused by the violation of the corresponding low temperature\ncriterium.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0706.3671%2C0706.0227%2C0706.2165%2C0706.0292%2C0706.1678%2C0706.0414%2C0706.2874%2C0706.0004%2C0706.2466%2C0706.2843%2C0706.2137%2C0706.4306%2C0706.2094%2C0706.3016%2C0706.2239%2C0706.3169%2C0706.4383%2C0706.1440%2C0706.3376%2C0706.1732%2C0706.0798%2C0706.1760%2C0706.1772%2C0706.3399%2C0706.3126%2C0706.3637%2C0706.0653%2C0706.0510%2C0706.3277%2C0706.2767%2C0706.4288%2C0706.1543%2C0706.1041%2C0706.3944%2C0706.0538%2C0706.3451%2C0706.2066%2C0706.0058%2C0706.1289%2C0706.0489%2C0706.3693%2C0706.2106%2C0706.1892%2C0706.1235%2C0706.3354%2C0706.2879%2C0706.2953%2C0706.3441%2C0706.4457%2C0706.3453%2C0706.1382%2C0706.4069%2C0706.3653%2C0706.0530%2C0706.2766%2C0706.0272%2C0706.2448%2C0706.0534%2C0706.4308%2C0706.1310%2C0706.3265%2C0706.2570%2C0706.3234%2C0706.1428%2C0706.2500%2C0706.0241%2C0706.0692%2C0706.4143%2C0706.0170%2C0706.0953%2C0706.0052%2C0706.0934%2C0706.2140%2C0706.0471%2C0706.1955%2C0706.1923%2C0706.0383%2C0706.1326%2C0706.0001%2C0706.4337%2C0706.1870%2C0706.2681%2C0706.4436%2C0706.3682%2C0706.2854%2C0706.1309%2C0706.1152%2C0706.1845%2C0706.2892%2C0706.3590%2C0706.3308%2C0706.0303%2C0706.3955%2C0706.1782%2C0706.1317%2C0706.2053%2C0706.4299%2C0706.1394%2C0706.3765%2C0706.0482%2C0706.2139&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The unusual temperature behavior of the entropy of the antiferromagnetic\n(AFM) spin state in symmetric nuclear matter with the Gogny D1S interaction,\nbeing larger at low temperatures than the entropy of nonpolarized matter, is\nrelated to the dependence of the entropy on the effective masses of nucleons in\na spin polarized state. The corresponding conditions for comparing the\nentropies of the AFM and nonpolarized states in terms of the effective masses\nare formulated, including low and high temperature limits. It is shown that the\nunexpected temperature behavior of the entropy of the AFM spin state at low\ntemperatures is caused by the violation of the corresponding low temperature\ncriterium."}, "authors": ["A. A. Isayev"], "author_detail": {"name": "A. A. Isayev"}, "author": "A. A. Isayev", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevC.76.047305", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0706.2500v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0706.2500v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "version accepted for publication in PRC", "arxiv_primary_category": {"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "nucl-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.other", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0706.2500v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0706.2500v2", "journal_reference": "Phys.Rev.C76:047305,2007", "doi": "10.1103/PhysRevC.76.047305", "fulltext": "Unusual temperature behavior of the entropy of\nthe antiferromagnetic spin state in nuclear matter\nwith an effective finite range interaction\nA. A. Isayev\n\narXiv:0706.2500v2 [nucl-th] 12 Sep 2007\n\nKharkov Institute of Physics and Technology, Academicheskaya Street 1, Kharkov, 61108, Ukraine\n(Dated: November 20, 2018)\nThe unusual temperature behavior of the entropy of the antiferromagnetic (AFM) spin state in\nsymmetric nuclear matter with the Gogny D1S interaction, being larger at low temperatures than the\nentropy of nonpolarized matter, is related to the dependence of the entropy on the effective masses\nof nucleons in a spin polarized state. The corresponding conditions for comparing the entropies of\nthe AFM and nonpolarized states in terms of the effective masses are formulated, including the low\nand high temperature limits. It is shown that the unexpected temperature behavior of the entropy\nof the AFM spin state at low temperatures is caused by the violation of the corresponding low\ntemperature criterion.\nPACS numbers: 21.65.+f; 75.25.+z; 71.10.Ay\n\nThe issue of spontaneous appearance of spin polarized\nstates in nuclear matter is a topic of a great current interest due to its relevance in astrophysics. In particular,\nthe scenarios of supernova explosion and cooling of neutron stars are essentially different, depending on whether\nnuclear matter is spin polarized or not. On the one hand,\nthe models with the effective Skyrme and Gogny nucleonnucleon (NN) interaction predict the occurrence of spin\ninstability in nuclear matter at densities in the range from\n̺0 to 6̺0 for different parametrizations of the NN potential [1]–[15] (̺0 = 0.16 fm−3 is the nuclear saturation\ndensity). On the other hand, for the models with the\nrealistic NN interaction, the ferromagnetic phase transition seems to be suppressed up to densities well above\n̺0 [16]–[22].\nHere we continue the research of spin polarizability of\nnuclear matter with the use of an effective NN interaction. As was shown in Ref. [13], in symmetric nuclear\nmatter with the Gogny D1S effective interaction the antiferromagnetic (AFM) spin ordering with the oppositely\ndirected neutron and proton spins sets in, beginning from\nsome critical density (at zero temperature, ̺c ≈ 3.8̺0 ).\nAt finite temperature, the entropy of the AFM spin state\ndemonstrates the unusual behavior being larger than the\nentropy of the nonpolarized state at low enough temperatures. The main goal of this work is to clarify this\nunexpected moment, utilizing the approximation of the\neffective mass in the single particle spectrum of nucleons. As will be shown later, this approximation is quite\nsuccessful in reproducing the entropy of a spin polarized\nstate for all relevant temperatures. The use of low and\nhigh temperature expressions for the entropy will allow\nus to get the corresponding conditions in terms of the\neffective masses for comparing the entropies of spin polarized and nonpolarized states.\nNow we stop on the basic equations of the theory [11, 12]. Given the possibility of phase transitions to\nthe states with parallel and antiparallel ordering of neutron and proton spins, the distribution function f can\nbe expanded in the Pauli matrices σi and τk in spin and\n\nisospin spaces\nf (p) = f00 (p)σ0 τ0 + f30 (p)σ3 τ0\n+ f03 (p)σ0 τ3 + f33 (p)σ3 τ3 .\n\n(1)\n\nExpressions for the distribution functions f00 , f30 , f03 , f33\nread [11, 12]\n1\n{n(ωn↑ ) + n(ωp↑ ) + n(ωn↓ ) + n(ωp↓ )},\n4\n1\n= {n(ωn↑ ) + n(ωp↑ ) − n(ωn↓ ) − n(ωp↓ )},\n4\n1\n= {n(ωn↑ ) − n(ωp↑ ) + n(ωn↓ ) − n(ωp↓ )},\n4\n1\n= {n(ωn↑ ) − n(ωp↑ ) − n(ωn↓ ) + n(ωp↓ )}.\n4\n\nf00 =\nf30\nf03\nf33\n\n(2)\n\nHere n(ω) = {exp(ω/T ) + 1}−1 and\nωn↑\nωp↑\nωn↓\nωp↓\n\n= ε0 + ε̃00 + ε̃30 + ε̃03 + ε̃33 − μn↑ ,\n= ε0 + ε̃00 + ε̃30 − ε̃03 − ε̃33 − μp↑ ,\n= ε0 + ε̃00 − ε̃30 + ε̃03 − ε̃33 − μn↓ ,\n= ε0 + ε̃00 − ε̃30 − ε̃03 + ε̃33 − μp↓ ,\n\n(3)\n\nare the branches of the quasiparticle spectrum corresponding to neutrons and protons with spin up and spin\ndown, and μτ σ are their respective chemical potentials\n(τ = n, p; σ =↑, ↓). Under derivation of Eqs. (2), (3), it\nis assumed that the populations of neutrons and protons with spin up and spin down are held fixed. In\nEq. (3), ε0 (p) is the free single particle spectrum, and\nε̃00 , ε̃30 , ε̃03 , ε̃33 are the Fermi liquid (FL) corrections to\nthe free single particle spectrum, related to the FL am-\n\n\f2\nplitudes U0 (k), ..., U3 (k) by formulas\np−q\n1 X\n,\nU0 (k)f00 (q), k =\n2V q\n2\n1 X\nε̃30 (p) =\nU1 (k)f30 (q),\n(4)\n2V q\n1 X\nU2 (k)f03 (q),\nε̃03 (p) =\n2V q\n1 X\nε̃33 (p) =\nU3 (k)f33 (q).\n2V q\nThe distribution functions f00 , f03 , f30 , f33 , in turn,\nshould satisfy the normalization conditions for the total density ̺n + ̺p = ̺, excess of neutrons over protons\n̺n − ̺p ≡ α̺, ferromagnetic (FM) ̺↑ − ̺↓ ≡ ∆̺↑↑ and\nantiferromagnetic (AFM) (̺n↑ +̺p↓ )−(̺n↓ +̺p↑ ) ≡ ∆̺↑↓\nspin order parameters, respectively (α being the isospin\nasymmetry parameter, ̺↑ = ̺n↑ + ̺p↑ and ̺↓ = ̺n↓ + ̺p↓\nwith ̺n↑ , ̺n↓ and ̺p↑ , ̺p↓ being the neutron and proton\nnumber densities with spin up and spin down, respectively). To check the thermodynamic stability of different solutions of the self-consistent equations (2)–(4), it\nis necessary to compare the corresponding free energies\nF = E − T S, where E is the energy functional and the\nentropy reads\nX X X\nS=−\n{n(ωτ σ ) ln n(ωτ σ )\n(5)\np τ =n, p σ=↑, ↓\n\n+ n̄(ωτ σ ) ln n̄(ωτ σ )}, n̄(ω) = 1 − n(ω).\nThe single particle energies (3) have the following general structure\nωτ σ (k) = ωτ0σ (k) + Uτ σ (k),\n\nωτ0σ (k) ≡\n\nh̄2 k2\n− μτ σ , (6)\n2m0\n\nwhere m0 is the bare nucleon mass, Uτ σ is the single particle potential. Its momentum dependence can be characterized by the effective mass mτ σ (k), defined as\nm0\nm0 dUτ σ (k)\n=1+ 2\n.\nmτ σ (k)\nh̄ k dk\n\n(7)\n\nIf to use the quadratic approximation for the single particle potential\n\u0013\n\u0012\n1 dUτ σ (k)\n* k2 ,\nUτ σ (k) ≈ Uτ σ (0) +\n2k dk\nk=kF\nτσ\n\nwhere kFτ σ is the Fermi momentum of nucleons in the\nstate (τ, σ), then the single particle energy can be represented in the form\nωτ σ (k) =\n\nh̄2 k2\n+ Uτ σ (0) − μτ σ , mτ σ ≡ mτ σ (kFτ σ ). (8)\n2mτ σ\n\nWithin this approximation, all thermodynamic quantities can be easily calculated, analogously to the case of\n\nAFM\n\n0.4\n\nε̃00 (p) =\n\nD1S\n= 0.64 fm\n\nS/A [1/nucl]\n\n0.2\n\n-3\n\n0.0\n\n-0.2\n\n= 0.3\n-0.4\n\n= 0.6\n= 1\n\n-0.6\n0\n\n20\n\n40\n\n60\n\n80\n\n100\n\n120\n\n140\n\n160\n\n180\n\nT [MeV]\n\nFIG. 1: The entropy per nucleon, measured from its value in\nthe nonpolarized state, for the AFM spin state as a function\nof temperature at different polarizations.\n\na free Fermi gas. Note that in order to get the effective mass mτ σ , it is necessary to find the explicit single\nparticle potential as a result of the solution of the selfconsistent equations (2)–(4).\nFurther we will consider symmetric nuclear matter\nwith the Gogny D1S interaction as a potential of NN interaction. It was shown in Ref. [13] that in this case the\nAFM spin ordering can be realized only among the states\nwith the collinear spin ordering. In the AFM spin state,\n̺n↑ = ̺p↓ , ̺n↓ = ̺p↑ , and, hence, μn↑ = μp↓ , μn↓ = μp↑ .\nBesides, we have only two different branches in the quasiparticle spectrum, ωn↑ = ωp↓ , and ωn↓ = ωp↑ , and,\nas a consequence, only two different effective masses,\n̺ −̺\nmn↑ = mp↓ , and mn↓ = mp↑ . The neutron Πn = n↑̺n n↓\n̺\n\n−̺\n\nand proton Πp = p↑̺p p↓ spin polarization parameters\nfor the AFM spin state are opposite in sign and equal to\nΠn = −Πp =\n\n∆̺↑↓\n≡ Π.\n̺\n\nIn Fig. 1, the difference between the entropies per nucleon of the AFM and nonpolarized states is shown as a\nfunction of temperature at different fixed polarizations.\nThe value Π = 1 corresponds to the totally AFM polarized nuclear matter. One can see that for low temperatures the entropy of the AFM state is larger than the\nentropy of the normal state. It looks like the AFM state\nat low finite temperatures is less ordered than the nonpolarized state. Under a further increase of temperature\nthe difference between the entropies changes the sign and\nbecomes negative, that corresponds to the intuitively expected behavior.\nFig. 2 shows the difference between the free energies\nper nucleon of the AFM and nonpolarized states as a\nfunction of temperature for the same polarizations as\n\n\f3\n2.5\n\n2.5\n\nAFM\n\n30\n\n-3\n\n-3\n\nD1S\n\n= 0.64 fm\n\n= 0.64 fm\n\n= 0.64 fm\n\n-3\n\n2.0\n\n2.0\n\n1.5\n\n1.5\n\n1.0\n\n1.0\n\n20\n\n-3\n\nS [fm ]\n\nF/A [MeV/nucl]\n\n= 1\n\n= 0.6\n\n10\n\n0\n\n= 0.3\n\n-10\n\n0.5\n\n0.5\n\n= 0.6\nexact sp spectrum\n\n= 1\n-20\n0\n\n20\n\n40\n\n60\n\n80\n\n100\n\n120\n\n140\n\n160\n\nexact sp spectrum\n\napprox. sp spectrum\n\n180\n\n0.0\n0\n\nT [MeV]\n\nFIG. 2: Same as in Fig. 1, but for the free energy per nucleon,\nmeasured from its value in the nonpolarized state.\n\nin Fig. 1. In contrast to the difference between the entropies, the difference between the free energies preserves\nits negative sign for all temperatures below the corresponding critical temperature, and, hence, the AFM spin\nstate is thermodynamically preferable as compared to the\nnonpolarized state for the whole corresponding temperature domain. Therefore, the unusual temperature behavior of the entropy of the AFM spin state doesn't lead to\nthe instability of the polarized state at low temperatures.\nNote that if to assume the quadratic approximation for\nthe dependence of the free energy per nucleon of the polarized state on the spin polarization parameter [20],\n\napprox. sp spectrum\n0.0\n\n45\n\n90\n\n135\n\n180\n\n0\n\nT [MeV]\n\n45\n\n90\n\n135\n\n180\n\nT [MeV]\n\nFIG. 3: (Color online) The density of entropy for the AFM\nspin state as a function of temperature, calculated with the\nexact (solid line) and approximated (dashed line) single particle energies at the spin polarization parameter Π = 0.6 (left)\nand Π = 1 (right).\n\nthe low temperature expansion for the entropy using the\napproximation of the effective mass in the single particle\nenergies, as described in detail, e.g., in Ref. [23]. Then,\nrequiring for the difference between the entropies per nucleon of the AFM and nonpolarized states to be negative,\none can get the condition\nD1 ≡\n\nmn↑\nmn↓\n1\n1\n(1 + Π) 3 + ∗ (1 − Π) 3 − 2 < 0.\n∗\nm\nm\n\n(9)\n\nF (̺, T, Π)\nF (̺, T, Π = 0)\n=\n+ γ(̺, T )Π2 ,\nA\nA\n\nHere m∗ is the effective mass of a nucleon in nonpolarized nuclear matter at the corresponding temperature\nand density. The low temperature condition (9) is valid\n\nthen the curve in Fig. 2, corresponding to Π = 1, in\nfact, shows the dependence of the spin-isospin symmetry\nparameter γ on temperature. Its negative value proves\nthe stability of the AFM spin state at temperatures below\nthe critical temperature, as clarified above.\nTo understand the unusual behavior of the entropy of\nthe AFM spin state at low temperatures, we utilize the\nquadratic approximation for the single particle spectrum\nof nucleons, Eq. (8). Note that, adopting this approximation, we self-consistently determine also the chemical\npotentials to guarantee the fulfillment of the normalization conditions for the distribution functions. The results\nof the numerical determination of the entropy density,\nbased on the exact and approximated forms of the single particle energies, are compared in Fig. 3. It is seen\nthat the approximation turns out to be quite satisfactory,\nespecially in the region of low temperatures, and the disagreement does not exceed 7% even for the less favorable\ncase of totally polarized matter in the entire temperature\ndomain under consideration. Therefore, we can provide\n\nnσ\nuntil T /εFnσ ≪ 1, εFnσ = 2mFnσ\nbeing the Fermi energy of neutrons with spin up (σ =↑) and spin down\n(σ =↓). The calculations show that at the given density (̺ = 0.64 fm−3 ) and polarizations, the corresponding temperature interval extends approximately up to\nT = 10 MeV. Besides, under derivation of the condition (9) it is assumed that the effective masses are temperature independent. Fig. 4 shows the dependence of\nthe effective masses mn↑ , mn↓ on temperature in the temperature domain, where the low temperature expansion\nholds true. It is seen that the effective masses for partially AFM polarized nuclear matter at the given polarizations are practically independent on temperature, and\nfor totally polarized matter the change in the effective\nmass is about 5% in this temperature domain. Therefore, the use of Ineq. (9) is quite justified for comparing\nthe entropies of the AFM and nonpolarized states at low\ntemperatures.\nFig. 5 shows the dependence of the l.h.s. D1 of Ineq. (9)\non temperature in the low temperature domain under\n\nh̄2 k2\n\n\f4\n3.0\n\n0.1\n\n2.5\n\n-3\n\n-3\n\n=0.64 fm\n\n=0.64 fm\n2.0\n\n2.5\n\ndown n\n\n= 0.64 fm\n\n0.0\n\n-3\n\n= 0.3\n1.5\n\n= 0.6\n\n-0.1\n\n= 0.3\n\n= 1\n\n= 0.6\n2\n\n1.0\n\n= 1\n\nD\n\n1\n\n1.5\n\n= 0.3\n\n= 0.6\n\n= 1\n\nD\n\n2.0\n\n-0.2\n\nm\n\nup\n\n0\n\n/m , m\n\ndown\n\n/m\n\n0\n\nup n\n\n0.5\n\n1.0\n\n-0.3\n0.0\n\n0.5\n\n0\n\n2\n\n4\n\n6\n\n8\n\n-0.5\n\n10\n\nT [MeV]\n\nconsideration at different polarizations. It is seen that\nthe quantity D1 is positive and increases with the spin\npolarization. This explains the unexpected behavior of\nthe entropy of the AFM spin state, being larger than that\nof the nonpolarized state at low temperatures.\nNote that at higher temperatures the entropy of the\nAFM spin state becomes smaller than the entropy of the\nnonpolarized state. To explain this, we can again use\nthe approximation of the effective mass in the single particle energies for getting the high temperature q\nexpres2\n\n2πh̄\nsion for the entropy. If ̺nσ λ3nσ ≪ 1 (λnσ =\nmnσ T\nis the thermal wavelength of neutrons with spin up and\nspin down), then the condition for the difference between\nthe entropies per nucleon of the AFM and nonpolarized\nstates to be negative is\n3\n\nD2 ≡\n\n2\nmn↑\n\n1+Π\n\n\u0012\n\u0013 1+Π\n2\n\n3\n2\nmn↓\n\n1−Π\n\n\u0013 1−Π\n2\n\n2\n\n4\n\n6\n\nT [MeV]\n\nFIG. 4: (Color online) The effective masses of spin up and spin\ndown neutrons in units of the bare nucleon mass as functions\nof temperature in the low temperature domain at different\npolarizations.\n\n\u0012\n\n-0.4\n0\n\n1\n3\n\nm∗ 2\n\n− 1 < 0.\n\n(10)\n\nFig. 5 shows the dependence of the quantity D2 on temperature in the high temperature region at the given\ndensity and polarizations. One can see that the condition (10) is fulfilled, and, hence, the entropy of the AFM\nspin state turns out to be smaller than that of the nonpolarized state. Note that from the derivation procedure of\nthe high temperature expression for the entropy it follows\nthat the effective masses in Ineq. (10) can be temperature\ndependent.\nThus, using the approximation of the effective mass,\nit is possible to explain both the low temperature and\nhigh temperature peculiarities of the entropy of spin polarized nuclear matter with the D1S Gogny interaction.\nIn Ref. [15], it was found that the entropy of spin po-\n\n8\n\n10\n\n170\n\n172\n\n174\n\n176\n\n178\n\n180\n\nT [MeV]\n\nFIG. 5: The differences D1 (left) and D2 (right) in Ineqs. (9)\nand (10) as functions of temperature at different polarizations.\n\nlarized neutron matter with the Skyrme effective interaction above some critical density ̺S is larger than that\nof nonpolarized matter. As a consequence, the critical\ndensity for the appearance of a spin polarized state decreases with temperature, contrary to the intuitive suggestion. However, there is an important difference between the cases with the finite range Gogny and zero\nrange Skyrme forces: While for the Skyrme interaction\nthe effective masses in Eq. (7) are momentum and temperature independent, for the Gogny interaction they do\ndepend on momentum and temperature. By this reason, the difference between the entropies of polarized\nand nonpolarized states is positive for all temperatures\nat densities above ̺S for the Skyrme interaction. For\nthe Gogny interaction, this difference changes the sign\nfrom the positive one at low temperatures to the negative\none at high temperatures. The critical density ̺S , above\nwhich the difference of the entropies becomes positive at\nlow temperatures, depends on polarization, for example,\n̺S (Π = 0.3) ≈ 0.07 fm−3 , ̺S (Π = 0.6) ≈ 0.08 fm−3 , and\n̺S (Π = 1) ≈ 0.17 fm−3 . For comparison, for totally polarized neutron matter with the SLy4 Skyrme interaction\n̺S ≈ 0.15 fm−3 [15]. Since the entropy of the AFM spin\nstate is smaller than that of nonpolarized matter at high\ntemperatures, the critical density for the appearance of\nthe AFM state increases with temperature [14], in agreement with the intuitive considerations and contrary to\nthe scenario with the Skyrme interaction [15].\nIn summary, it has been shown that the entropy of\nthe AFM spin state in symmetric nuclear matter with\nthe Gogny D1S interaction demonstrates the unusual behavior, being larger at low temperatures than the entropy of nonpolarized matter. By comparing the free\nenergies of polarized and nonpolarized states, it has been\nclarified that this unconventional temperature behavior\n\n\f5\ndoesn't lead to the instability of the AFM state. This entropy peculiarity has been related to the dependence of\nthe entropy on the effective masses of nucleons in a spin\npolarized state, which for the finite range D1S Gogny\ninteraction do depend on temperature. The corresponding conditions for comparing the entropies of the AFM\n\n[1]\n[2]\n[3]\n[4]\n[5]\n[6]\n[7]\n[8]\n[9]\n[10]\n[11]\n[12]\n[13]\n\nM.J. Rice, Phys. Lett. 29A, 637 (1969).\nS.D. Silverstein, Phys. Rev. Lett. 23, 139 (1969).\nE. Østgaard, Nucl. Phys. A154, 202 (1970).\nA. Viduarre, J. Navarro, and J. Bernabeu, Astron. Astrophys. 135, 361 (1984).\nS. Reddy, M. Prakash, J.M. Lattimer, and J.A. Pons,\nPhys. Rev. C 59, 2888 (1999).\nA.I. Akhiezer, N.V. Laskin, and S.V. Peletminsky, Phys.\nLett. 383B, 444 (1996); JETP 82, 1066 (1996).\nS. Marcos, R. Niembro, M.L. Quelle, and J. Navarro,\nPhys. Lett. 271B, 277 (1991).\nT. Maruyama and T. Tatsumi, Nucl. Phys. A693, 710\n(2001).\nA. Beraudo, A. De Pace, M. Martini, and A. Molinari,\nAnn. Phys. (NY) 311, 81 (2004); 317, 444 (2005).\nM. Kutschera, and W. Wojcik, Phys. Lett. 325B, 271\n(1994).\nA.A. Isayev, JETP Letters 77, 251 (2003).\nA.A. Isayev, and J. Yang, Phys. Rev. C 69, 025801\n(2004); A.A. Isayev, Phys. Rev. C 74, 057301 (2006).\nA.A. Isayev, and J. Yang, Phys. Rev. C 70, 064310\n\nand nonpolarized states in terms of the effective masses\nhave been formulated, including the low and high temperature limits. It has been shown that the unexpected\ntemperature behavior of the entropy at low temperatures\nis caused by the violation of the corresponding low temperature criterion.\n\n(2004).\n[14] A.A. Isayev, Phys. Rev. C 72, 014313 (2005).\n[15] A. Rios, A. Polls, and I. Vidaña, Phys. Rev. C 71, 055802\n(2005).\n[16] V.R. Pandharipande, V.K. Garde, and J.K. Srivastava,\nPhys. Lett. 38B, 485 (1972).\n[17] S.O. Bäckmann and C.G. Källman, Phys. Lett. 43B, 263\n(1973).\n[18] P. Haensel, Phys. Rev. C 11, 1822 (1975).\n[19] I. Vidaña, A. Polls, and A. Ramos, Phys. Rev. C 65,\n035804 (2002).\n[20] I. Vidaña, and I. Bombaci, Phys. Rev. C 66, 045801\n(2002).\n[21] S. Fantoni, A. Sarsa, and E. Schmidt, Phys. Rev. Lett.\n87, 181101 (2001).\n[22] F. Sammarruca and P. G. Krastev, Phys. Rev. C 75,\n034315 (2007).\n[23] L.D. Landau and E.M. Lifshiz, Statistical Physics, Part\n1, Pergamon, Oxford, 1980.\n\n\f"}