{"id": "http://arxiv.org/abs/0802.3059v1", "guidislink": true, "updated": "2008-02-21T13:22:28Z", "updated_parsed": [2008, 2, 21, 13, 22, 28, 3, 52, 0], "published": "2008-02-21T13:22:28Z", "published_parsed": [2008, 2, 21, 13, 22, 28, 3, 52, 0], "title": "Development of a Nanostructual Microwave Probe Based on GaAs", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.2667%2C0802.1482%2C0802.1821%2C0802.2416%2C0802.4033%2C0802.3465%2C0802.3728%2C0802.0940%2C0802.3818%2C0802.2791%2C0802.3165%2C0802.1984%2C0802.1652%2C0802.2867%2C0802.3503%2C0802.2270%2C0802.2830%2C0802.0033%2C0802.2087%2C0802.0347%2C0802.3120%2C0802.1898%2C0802.2607%2C0802.4324%2C0802.0282%2C0802.2232%2C0802.3224%2C0802.1271%2C0802.0531%2C0802.1371%2C0802.4441%2C0802.4382%2C0802.0214%2C0802.4242%2C0802.4296%2C0802.0200%2C0802.3912%2C0802.0006%2C0802.1219%2C0802.1170%2C0802.0500%2C0802.2568%2C0802.4329%2C0802.1569%2C0802.3293%2C0802.3807%2C0802.1666%2C0802.3178%2C0802.2033%2C0802.2458%2C0802.2611%2C0802.1471%2C0802.4300%2C0802.4301%2C0802.1182%2C0802.0802%2C0802.4065%2C0802.3305%2C0802.3468%2C0802.3059%2C0802.1742%2C0802.4195%2C0802.1738%2C0802.0476%2C0802.0047%2C0802.2964%2C0802.1704%2C0802.3755%2C0802.4239%2C0802.2256%2C0802.0798%2C0802.4437%2C0802.2318%2C0802.2566%2C0802.2744%2C0802.3351%2C0802.1796%2C0802.3097%2C0802.4342%2C0802.0373%2C0802.3685%2C0802.2968%2C0802.3991%2C0802.3937%2C0802.2389%2C0802.1966%2C0802.4273%2C0802.1241%2C0802.1274%2C0802.0468%2C0802.3511%2C0802.2962%2C0802.0076%2C0802.0868%2C0802.0913%2C0802.0773%2C0802.2958%2C0802.4080%2C0802.3687%2C0802.1248%2C0802.4237&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Development of a Nanostructual Microwave Probe Based on GaAs"}, "summary": "With the development of nanotechnology, the measurement of electrical\nproperties in local area of materials and devices has become a great need.\nAlthough a lot kind of scanning probe microscope have been developed for\nsatisfying the requirement of nanotechnology, a microscope technique which can\ndetermine electrical properties in local area of materials and devices is not\nyet developed. Recently, microwave microscope has been an interest to many\nresearchers, due to its potential in the evaluation of electrical properties of\nmaterials and devices. The advance of microwave is that the response of\nmaterials is directly relative to the electromagnetic properties of materials.\nHowever, because of the problem of the structure of probes, nanometer-scale\nresolution has not been successful. To achieve the goal, a new structure\nmicrowave probe is required. In this paper, we report a nanostructural\nmicrowave probe. To restrain the attenuation of microwave in the probe, GaAs\nwas used as the substrate of the probe. To obtain the desired structure, wet\netching was used to fabricate the probe. Different with the dry etching, a\nside-etching will occur under the etching mask. Utilizing this property, a\nmicro tip can be fabricated by etching a wafer, of which a small mask was\nintroduced on the surface in advance.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0802.2667%2C0802.1482%2C0802.1821%2C0802.2416%2C0802.4033%2C0802.3465%2C0802.3728%2C0802.0940%2C0802.3818%2C0802.2791%2C0802.3165%2C0802.1984%2C0802.1652%2C0802.2867%2C0802.3503%2C0802.2270%2C0802.2830%2C0802.0033%2C0802.2087%2C0802.0347%2C0802.3120%2C0802.1898%2C0802.2607%2C0802.4324%2C0802.0282%2C0802.2232%2C0802.3224%2C0802.1271%2C0802.0531%2C0802.1371%2C0802.4441%2C0802.4382%2C0802.0214%2C0802.4242%2C0802.4296%2C0802.0200%2C0802.3912%2C0802.0006%2C0802.1219%2C0802.1170%2C0802.0500%2C0802.2568%2C0802.4329%2C0802.1569%2C0802.3293%2C0802.3807%2C0802.1666%2C0802.3178%2C0802.2033%2C0802.2458%2C0802.2611%2C0802.1471%2C0802.4300%2C0802.4301%2C0802.1182%2C0802.0802%2C0802.4065%2C0802.3305%2C0802.3468%2C0802.3059%2C0802.1742%2C0802.4195%2C0802.1738%2C0802.0476%2C0802.0047%2C0802.2964%2C0802.1704%2C0802.3755%2C0802.4239%2C0802.2256%2C0802.0798%2C0802.4437%2C0802.2318%2C0802.2566%2C0802.2744%2C0802.3351%2C0802.1796%2C0802.3097%2C0802.4342%2C0802.0373%2C0802.3685%2C0802.2968%2C0802.3991%2C0802.3937%2C0802.2389%2C0802.1966%2C0802.4273%2C0802.1241%2C0802.1274%2C0802.0468%2C0802.3511%2C0802.2962%2C0802.0076%2C0802.0868%2C0802.0913%2C0802.0773%2C0802.2958%2C0802.4080%2C0802.3687%2C0802.1248%2C0802.4237&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "With the development of nanotechnology, the measurement of electrical\nproperties in local area of materials and devices has become a great need.\nAlthough a lot kind of scanning probe microscope have been developed for\nsatisfying the requirement of nanotechnology, a microscope technique which can\ndetermine electrical properties in local area of materials and devices is not\nyet developed. Recently, microwave microscope has been an interest to many\nresearchers, due to its potential in the evaluation of electrical properties of\nmaterials and devices. The advance of microwave is that the response of\nmaterials is directly relative to the electromagnetic properties of materials.\nHowever, because of the problem of the structure of probes, nanometer-scale\nresolution has not been successful. To achieve the goal, a new structure\nmicrowave probe is required. In this paper, we report a nanostructural\nmicrowave probe. To restrain the attenuation of microwave in the probe, GaAs\nwas used as the substrate of the probe. To obtain the desired structure, wet\netching was used to fabricate the probe. Different with the dry etching, a\nside-etching will occur under the etching mask. Utilizing this property, a\nmicro tip can be fabricated by etching a wafer, of which a small mask was\nintroduced on the surface in advance."}, "authors": ["Y. Ju", "T. Kobayashi", "H. Soyama"], "author_detail": {"name": "H. Soyama"}, "author": "H. Soyama", "arxiv_comment": "Submitted on behalf of EDA Publishing Association\n  (http://irevues.inist.fr/EDA-Publishing)", "links": [{"href": "http://arxiv.org/abs/0802.3059v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0802.3059v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cs.OH", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cs.OH", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0802.3059v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0802.3059v1", "journal_reference": "Dans Symposium on Design, Test, Integration and Packaging of\n  MEMS/MOEMS - DTIP 2007, Stresa, lago Maggiore : Italie (2007)", "doi": null, "fulltext": "Stresa, Italy, 25-27 April 2007\n\nDEVELOPMENT OF A NANOSTRUCTUAL MICROWAVE PROBE BASED ON GaAs\nYang Ju, Tetsuya Kobayashi, Hitoshi Soyama\nDepartment of Nanomechanics, Tohoku University\nABSTRACT\nIn order to develop a new structure microwave probe,\nthe fabrication of AFM probe on the GaAs wafer was\nstudied. A waveguide was introduced by evaporating Au\nfilm on the top and bottom surfaces of the GaAs AFM\nprobe. A tip having 7 μm high, 2.0 aspect ratio was\nformed. The dimensions of the cantilever are 250×30×15\nμm. The open structure of the waveguide at the tip of the\nprobe was obtained by using FIB fabrication. AFM image\nand profile analysis for a standard sample obtained by the\nfabricated GaAs microwave probe and commercial Si\nAFM probe indicate that the fabricated probe has the\nsimilar capability for the measurement of topography of\nmaterials.\n1. INTRODUCTION\nWith the development of nanotechnology, the\nmeasurement of electrical properties in local area of\nmaterials and devices has become a great need. Although\na lot kinds of scanning probe microscope have been\ndeveloped\nfor satisfying\nthe requirement of\nnanotechnology, a microscope technique which can\ndetermine electrical properties in local area is still not\ndeveloped yet. Recently, microwave microscope has been\nan interest to many researchers [1-4], due to its potential\nin the evaluation of electrical properties of materials and\ndevices. The advance of microwave is that the response of\nmaterials is directly relative to the electromagnetic\nproperties of materials.\nIn this paper, the development of a nanostructural\nmicrowave probe was demonstrated. To restrain the\nattenuation of microwave in the probe, GaAs was used as\nthe substrate of the probe. The new structural microwave\nprobe is expected to be used for the measurement of the\nelectrical properties as well as the topography of materials\nand devices.\n2. PROBE FABRICATION\nTo obtain the desired structure, wet etching was used\nto fabricate the probe. Different with the dry etching, a\nside-etching will occur under the etching mask. Utilizing\nthis property, a cone shaped micro tip can be obtained.\nEarly studies suggested that the square resist pattern having\n14 μm sides and one side to be 45° to the <011> direction\n\n©EDA Publishing/DTIP 2007\n\nwas found to be the most suitable etching mask for\netching the tip of the probe [5]. In the case of single\ncrystalline wafer, such as Si and GaAs, the chemical\nactivities are different for different crystalline planes,\nthereby, the etch rates are also different. Therefore, the\nside plane obtained at the side of the mask pattern is the\nmost inactive plane (that is the plane having the most low\netching speed) which is parallel to the side of the mask\npattern. Consequently, the result of etching is strong\naffected by the direction of mask pattern [6-8]. By\nconsidering the chemical activities at different crystalline\nplanes, the length direction of the etching mask for\nforming the beam of the cantilever was patterned along\nthe <011> direction. Consequently, the side-etching\noccurs under the resist mask, and mesa type planes appear\nat the both sides of the beam (45o inclined plane). On the\nother hand, inverse-mesa type plane is formed at the end\nof the beam (60-75o inclined plane). Under the same\nconditions as the beam fabrication process, holder was\nformed by back side etching. The etching mask was\npatterned on the bottom surface, and etching was carried\nout until the substrate was penetrated. The process to\nfabricate a GaAs AFM probe was described in details in\nRef. [9]. On the other hand, Au film was deposited on top\nand bottom surfaces of the probe to propagate a\nmicrowave signal in the probe. The thickness of the film\nis 50 nm. Both plane surfaces of the waveguide which\nwere evaporated Au film are connected at the end of the\nbeam. However, there is no Au film on the sides of the\nbeam, since the formed inclined planes at the beam sides\nare not face to the direction of the evaporation. By using\nfocused ion beam (FIB) fabrication, a slit at the tip of\nprobe was formed to open the connection of the Au film\non the two surfaces of the probe.\n3. PROBE EVALUATION\nFig 1 shows Scanning electron microscopy (SEM)\nphotography of the tip of the fabricated microwave probe\nbased on GaAs. The tip is observed located near the front\nedge of the cantilever. It is 7 μm high and having an\naspect ratio of 2.0.the width of the micro slit is about 200\nnm.\nIn order to confirm the resolution of the fabricated\nGaAs microwave probes, the AFM topography of two\ngrating samples having 2000 line/mm and 17.9 nm step\nheight were measured by the fabricated GaAs microwave\n\nISBN: 978-2-35500-000-3\n\n\fYang Ju, Tetsuya Kobayashi, Hitoshi Soyama\nDevelopment of a Nanostructural Microwave Probe Based on GaAs\n\nFig. 1 SEM photograph of the tip and the micro slit of the\nGaAs microwave probe\n\nprobes, and commercial Si AFM probe, respectively.\nJSPM-5400 was used for measurement of the sample in\nnon-contact mode. The properties of these AFM probes\nwere given in Table 1. The resonance frequency was\nswept and Q-value is defined by the following relation, Q\n= f0/(f+ - f-), where Q is the Q-value of the probe, f0 the\nscanned peak frequency (resonance frequency), f+ and fthe shifted frequency from f0 at the 70.7 % of peak\nintensity. Q- value indicates a resonance sharpness of\ncantilever, the higher of the Q-value, the better stabilizing\nof the oscillation. As shown in Table 1, fabricated GaAs\nmicrowave probe C and E have higher Q-value than the\ncommercial Si probe.\n3.1. Evaluation of topographies\nFig. 2-5 show the non-contact mode AFM\ntopographies of the grating sample having 2000 lines/mm\nobtained by the fabricated GaAs microwave probe A, C,\nD, E. The scan area was 3×3 μm. The white spots in these\nfigures are due to micro-dusts on the sample surface.\nHigher resolution topographies were obtained by probe C\nand E which have the high Q-value comparing to probe A\nand D. However, the probe B didn't take good scanning\nperformance because of the lower Q-value.\n\nFig. 2 Surface topography of the grating sample obtained\nby the fabricated GaAs microwave probe A\n\nFig. 3 Surface topography of the grating sample obtained\nby the fabricated GaAs microwave probe C\n\n3.2. Comparison with Si AFM probe\nFig. 3 shows the topography of the sample obtained\nby the fabricated GaAs microwave probe C, which\nindicates that the grating depth is 20-30 nm. Similar as\nTable 1 The properties of AFM probes in the atmosphere\nThe resonance\nProbe\nQ-value\nfrequency (kHz)\nMicrowave probe A\n454\n313\nMicrowave probe B\n99\n185\nMicrowave probe C\n118\n676\nMicrowave probe D\n141\n336\nMicrowave probe E\n503\n516\nCommercial probe (Si)\n258\n440\n\n©EDA Publishing/DTIP 2007\n\nFig. 4 Surface topography of the grating sample obtained\nby the fabricated GaAs microwave probe D\n\nISBN: 978-2-35500-000-3\n\n\fYang Ju, Tetsuya Kobayashi, Hitoshi Soyama\nDevelopment of a Nanostructural Microwave Probe Based on GaAs\n\nFig. 5 Surface topography of the grating sample obtained\nby the fabricated GaAs microwave probe E\nFig. 7 Profile analysis using by microwave AFM probe C\n\nFig. 6 Surface topography of the grating sample obtained\nby the commercial Si probe\n\nprobe C, the other GaAs microwave probes also can get\nAFM topography well. Fig. 6 shows the non-contact mode\nAFM topography obtained by using commercial Si\ncantilever, in which the grating depth is shown to be 3050 nm. Even through the Q-value is lower than that of\nprobe C and E, the commercial Si probe still can obtain a\nhigher resolution topography because of the higher aspect\nratio of the tip. These results illustrate that the tip of the\nGaAs microwave probe having the similar capability to\nsense the surface topography of materials as that of\ncommercial AFM probe.\n3.3. Evaluation of height accuracy\nIn order to evaluate height accuracy, the grating\nsample having 17.9 nm±1 nm step height was measured\n\n©EDA Publishing/DTIP 2007\n\nFig. 8 Profile analysis using by commercial Si AFM probe\n\nby using probe C and Si probe. As shown in Fig. 7, by\nanalyzing profile of the sample, microwave probe C\nresults the step height to be 18.60 nm. In contrast,\nmeasurement result by using commercial Si probe\nindicates the step height to be 18.62 nm, as shown in Fig.\n8. These results suggest that the fabricated microwave\nprobe has the similar height evaluation capability as that\nof commercial AFM probe.\n4. CONCLUSION\nGaAs microwave probes were fabricated on the GaAs\nwafer by using wet etching process. A waveguide was\n\nISBN: 978-2-35500-000-3\n\n\fYang Ju, Tetsuya Kobayashi, Hitoshi Soyama\nDevelopment of a Nanostructural Microwave Probe Based on GaAs\nintroducing on the probe by evaporating Au film on the both\nsurfaces of the probe. The open structure of the waveguide\nat the tip of the probe was obtained by using FIB\nfabrication. AFM measurements were performed by\ncomparing with the commercial Si AFM probe. It is\nindicated that GaAs microwave probe has a capability to\ncatch AFM topography of materials and having high\naccuracy for height evaluation, similar as the commercial\nAFM probe.\n\n[9] Ju, Y., Kobayashi, T., and Soyama, H., \"Fabrication\nof a GaAs microwave probe used for atomic force\nmicroscope\", Proceeding of interPACK2007 (CD-ROM),\n2007, IPACK2007-33613, in press.\n\n5. REFERENCES\n[1] Steinhauer, D. E., Vlahacos, C. P. Wellstood, F. C.,\nAnlage, S. M., Canedy, C., Ramesh, R., Stanishevsky, A.\nand Melngailis, J., \"Imaging of microwave permittivity,\ntenability, and damage recovery in (Ba, Sr) TiO3 thin\nfilms,\" Applied Physics Letters, Vol. 75, No. 20, 1999, pp.\n3180-3182.\n[2] Duewer, F., Gao, C., Takeuchi, I. and Xiang X.-D.,\n\"Tip-sample distance feedback control in a scanning\nevanescent microwave microscope,\" Applied Physics\nLetters, Vol. 74, No. 18, 1999, pp. 2696-2698.\n[3] Tabib-Azar, M., Akinwande, D., \"Real-time\nimaging of semiconductor space-charge regions using\nhigh-spatial\nresolution\nevanescent\nmicrowave\nmicroscope,\" Review of Scientific Instruments, Vol. 71,\nNo. 3, 2000, pp. 1460-1465.\n[4] Ju, Y., Saka, M. and Abé, H., \"NDI of delamination\nin IC packages using millimeter-waves,\" IEEE\nTransactions on Instrumentation and Measurement, Vol.\n50, No. 4, 2001, pp. 1019-1023.\n[5] Ju, Y., Sato, H., and Soyama, H., \"Fabrication of the\ntip of GaAs microwave probe by wet etching\",\nProceeding of interPACK2005 (CD-ROM), 2005,\nIPACK2005-73140.\n[6] Heisig, S., Danzebrink, H.-U., Leyk, A., Mertin, W.,\nMünster, S. and Oesterschulze, E., \"Monolithic gallium\narsenide cantilever for scanning near-field microscopy,\"\nUltramicroscopy, Vol. 71, No. 1-4, 1998, pp. 99-105.\n[7] Iwata, N. Wakayama, T. and Yamada, S.,\n\"Establishment of basic process to fabricate full GaAs\ncantilever for scanning probe microscope applications,\"\nSensors and Actuators A, Vol. 111, No. 1, 2004, pp. 2631.\n[8] MacFadyen, D. N., \"On the preferential etching of\nGaAs by H2SO4-H2O2-H2O,\" Journal of Electrochemical\nSociety, Vol. 130, No. 9, 1983, pp. 1934-1941.\n\n©EDA Publishing/DTIP 2007\n\nISBN: 978-2-35500-000-3\n\n\f"}