{"id": "http://arxiv.org/abs/1012.4227v1", "guidislink": true, "updated": "2010-12-20T01:34:10Z", "updated_parsed": [2010, 12, 20, 1, 34, 10, 0, 354, 0], "published": "2010-12-20T01:34:10Z", "published_parsed": [2010, 12, 20, 1, 34, 10, 0, 354, 0], "title": "Spatial gradient of dynamic nuclear spin polarization induced by\n  breakdown of quantum Hall effect", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.0003%2C1012.3153%2C1012.0767%2C1012.1729%2C1012.5896%2C1012.1992%2C1012.5270%2C1012.3647%2C1012.1878%2C1012.0104%2C1012.2164%2C1012.5803%2C1012.4796%2C1012.4611%2C1012.4190%2C1012.5350%2C1012.2228%2C1012.1073%2C1012.5866%2C1012.5745%2C1012.4737%2C1012.4219%2C1012.3229%2C1012.0778%2C1012.1187%2C1012.2518%2C1012.4006%2C1012.0590%2C1012.1128%2C1012.5601%2C1012.4075%2C1012.4154%2C1012.0046%2C1012.0949%2C1012.3999%2C1012.5179%2C1012.2935%2C1012.1932%2C1012.1120%2C1012.3017%2C1012.5090%2C1012.3704%2C1012.0279%2C1012.4718%2C1012.5369%2C1012.2759%2C1012.4428%2C1012.1908%2C1012.3970%2C1012.2583%2C1012.4704%2C1012.1986%2C1012.5833%2C1012.2275%2C1012.3940%2C1012.2812%2C1012.0551%2C1012.5731%2C1012.0819%2C1012.4993%2C1012.2902%2C1012.4227%2C1012.2611%2C1012.0747%2C1012.5343%2C1012.0357%2C1012.4478%2C1012.1087%2C1012.0171%2C1012.5826%2C1012.5487%2C1012.5888%2C1012.1715%2C1012.4095%2C1012.2494%2C1012.0997%2C1012.0398%2C1012.0132%2C1012.1093%2C1012.2348%2C1012.4294%2C1012.0649%2C1012.5561%2C1012.0766%2C1012.5012%2C1012.1449%2C1012.2667%2C1012.5405%2C1012.4238%2C1012.5545%2C1012.3557%2C1012.4223%2C1012.5341%2C1012.0854%2C1012.3642%2C1012.1797%2C1012.4776%2C1012.3867%2C1012.5307%2C1012.1589%2C1012.2638&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Spatial gradient of dynamic nuclear spin polarization induced by\n  breakdown of quantum Hall effect"}, "summary": "We studied spatial distribution of dynamic nuclear polarization (DNP) in a\nHall-bar device in a breakdown regime of the quantum Hall effect (QHE). We\ndetected nuclear magnetic resonance (NMR) signals from the polarized nuclear\nspins by measuring the Hall voltage $V_{xy}$ using three pairs of voltage\nprobes attached to the conducting channel of the Hall bar. We find that the\namplitude of the NMR signal depends on the position of the Hall voltage probes\nand that the largest NMR signal is obtained from the pair of probes farthest\nfrom the electron-injecting electrode. Combined with results on pump-and-probe\nmeasurements, we conclude that the DNP induced by QHE breakdown develops along\nthe electron-drift direction.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1012.0003%2C1012.3153%2C1012.0767%2C1012.1729%2C1012.5896%2C1012.1992%2C1012.5270%2C1012.3647%2C1012.1878%2C1012.0104%2C1012.2164%2C1012.5803%2C1012.4796%2C1012.4611%2C1012.4190%2C1012.5350%2C1012.2228%2C1012.1073%2C1012.5866%2C1012.5745%2C1012.4737%2C1012.4219%2C1012.3229%2C1012.0778%2C1012.1187%2C1012.2518%2C1012.4006%2C1012.0590%2C1012.1128%2C1012.5601%2C1012.4075%2C1012.4154%2C1012.0046%2C1012.0949%2C1012.3999%2C1012.5179%2C1012.2935%2C1012.1932%2C1012.1120%2C1012.3017%2C1012.5090%2C1012.3704%2C1012.0279%2C1012.4718%2C1012.5369%2C1012.2759%2C1012.4428%2C1012.1908%2C1012.3970%2C1012.2583%2C1012.4704%2C1012.1986%2C1012.5833%2C1012.2275%2C1012.3940%2C1012.2812%2C1012.0551%2C1012.5731%2C1012.0819%2C1012.4993%2C1012.2902%2C1012.4227%2C1012.2611%2C1012.0747%2C1012.5343%2C1012.0357%2C1012.4478%2C1012.1087%2C1012.0171%2C1012.5826%2C1012.5487%2C1012.5888%2C1012.1715%2C1012.4095%2C1012.2494%2C1012.0997%2C1012.0398%2C1012.0132%2C1012.1093%2C1012.2348%2C1012.4294%2C1012.0649%2C1012.5561%2C1012.0766%2C1012.5012%2C1012.1449%2C1012.2667%2C1012.5405%2C1012.4238%2C1012.5545%2C1012.3557%2C1012.4223%2C1012.5341%2C1012.0854%2C1012.3642%2C1012.1797%2C1012.4776%2C1012.3867%2C1012.5307%2C1012.1589%2C1012.2638&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We studied spatial distribution of dynamic nuclear polarization (DNP) in a\nHall-bar device in a breakdown regime of the quantum Hall effect (QHE). We\ndetected nuclear magnetic resonance (NMR) signals from the polarized nuclear\nspins by measuring the Hall voltage $V_{xy}$ using three pairs of voltage\nprobes attached to the conducting channel of the Hall bar. We find that the\namplitude of the NMR signal depends on the position of the Hall voltage probes\nand that the largest NMR signal is obtained from the pair of probes farthest\nfrom the electron-injecting electrode. Combined with results on pump-and-probe\nmeasurements, we conclude that the DNP induced by QHE breakdown develops along\nthe electron-drift direction."}, "authors": ["Minoru Kawamura", "Kimitoshi Kono", "Yoshiaki Hashimoto", "Shingo Katsumoto", "Tomoki Machida"], "author_detail": {"name": "Tomoki Machida"}, "author": "Tomoki Machida", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevB.83.041305", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1012.4227v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1012.4227v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4 pages, 4 figures, accepted for publication in PRB", "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1012.4227v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1012.4227v1", "journal_reference": "Phys. Rev. B 83, 041305(R) (2011)", "doi": "10.1103/PhysRevB.83.041305", "fulltext": "Spatial gradient of dynamic nuclear spin polarization\ninduced by breakdown of quantum Hall effect\nM. Kawamura,1, 2, ∗ K. Kono,1 Y. Hashimoto,3 S. Katsumoto,3, 4 and T. Machida4, 5, †\n1\n\nRIKEN Advanced Science Institute, Wako, Saitama 351-0198, Japan\nPRESTO, Japan Science and Technology Agency, Kawaguchi, Saitama 333-0012, Japan\n3\nInstitute for Solid State Physics, University of Tokyo, Kashiwa, Chiba 277-8581, Japan\n4\nInstitute for Nano Quantum Information Electronics, University of Tokyo,\nMeguro-ku, Tokyo 153-8505, Japan\n5\nInstitute of Industrial Science, University of Tokyo, Meguro-ku, Tokyo 153-8505, Japan\n(Dated: November 10, 2018)\n\narXiv:1012.4227v1 [cond-mat.mes-hall] 20 Dec 2010\n\n2\n\nWe studied spatial distribution of dynamic nuclear polarization (DNP) in a Hall-bar device in\na breakdown regime of the quantum Hall effect (QHE). We detected nuclear magnetic resonance\n(NMR) signals from the polarized nuclear spins by measuring the Hall voltage Vxy using three pairs\nof voltage probes attached to the conducting channel of the Hall bar. We find that the amplitude of\nthe NMR signal depends on the position of the Hall voltage probes and that the largest NMR signal\nis obtained from the pair of probes farthest from the electron-injecting electrode. Combined with\nresults on pump-and-probe measurements, we conclude that the DNP induced by QHE breakdown\ndevelops along the electron-drift direction.\n\nThe current-driven breakdown of the quantum Hall effect (QHE) is a phenomenon, characterized by an abrupt\nincrease of longitudinal resistance and a deviation of Hall\nresistance from the quantized resistance, when the electric current passing through a quantum Hall (QH) conductor exceeds a critical current Ic 1,2 . The QHE breakdown has gained renewed interest because of the recent\ndevelopment of the dynamic nuclear spin polarization\n(DNP) technique in QHE breakdown regimes3–6 . It was\ndemonstrated that nuclear spins in GaAs/AlGaAs heterostructures are dynamically polarized through the hyperfine interaction between electron spins and nuclear\nspins when the two-dimensional electron system (2DES)\nembedded in the heterostructure is driven to the breakdown regime of odd-integer QHE. Given its simplicity,\nthe DNP technique can be useful for the initialization\nprocedure of nuclear spin quantum bits7–9 . Moreover,\nthe back-action of the polarized nuclear spins on electrical transport coefficients of the 2DES makes it possible\nto perform extremely sensitive detection of nuclear magnetic resonance (NMR). Thus, the resistively detected\nNMR technique can be utilized to investigate the electron spin properties of QH systems10–13 .\nAlthough QHE breakdown has been studied1,2 both\ntheoretically and experimentally ever since the discovery\nof QHE, earlier experimental studies were mainly conducted at even-integer QHE where the spin degree of\nfreedom is unresolved. In the case of even-integer QHE,\nQHE breakdown does not occur homogeneously in the\nQH conductor but develops over a macroscopic distance\n(typically 100 μm) along the electron-drift direction14,15 .\nThe development of QHE breakdown over a macroscopic\ndistance was explained14–17 on the basis of avalanche\nmultiplication of excited electrons in the upper Landau\nsubband: the number of electrons in the upper Landau\nsubband increases along the electron-drift direction in the\nQH conductor. This means that electron temperature Te\nincreases along the conducting channel of a Hall-bar de-\n\nvice [Figs. 1(a) and (b)]. Such a spatial distribution of Te\nin QHE breakdown regimes was directly observed in resistance measurements in multi-terminal Hall bars14,15,18\nand cyclotron emission imaging experiments19 .\nIn the case of the breakdown of odd-integer QHE, the\nelectron excitation process is accompanied by electron\nspin flips. In our earlier work, we proposed that electron spin flips associated with the avalanche multiplication of excited electrons produce DNP through hyperfine\ninteraction4 . If our scenario is correct, the DNP induced\nby QHE breakdown should be spatially distributed over\na macroscopic distance because the avalanche multiplication process produces a spatial distribution not only\nof Te but also of electron spin flip events. However, in\nearlier studies4 on DNP, little attention was paid to its\nspatial distribution, and DNP signals were collected by\nlongitudinal voltage measurements in which the signals\nwere averaged over a macroscopic area between the voltage probes of the Hall bar. So far, no experimental result\nhas been reported concerning the spatial distribution of\nDNP. In order to reveal the spatial distribution of DNP,\nit is necessary to detect DNP signals locally in the Hall\nbar.\nIn this paper, we report that the DNP induced by QHE\nbreakdown is spatially distributed in a Hall-bar device.\nWe detected NMR signals from the polarized nuclear\nspins by measuring the Hall voltage Vxy using three pairs\nof voltage probes attached to the conducting channel of\nthe Hall bar. Since the Hall voltage Vxy reflects local\nelectronic properties at the intersection of a conducting\nchannel and a pair of voltage probes20 , the spatial distribution of DNP can be resolved by measurements of\nVxy . We find that the amplitude of the NMR signal depends on the position of the Hall voltage probes and that\nthe largest NMR signal is obtained from the pair of Hall\nvoltage probes farthest from the electron-injecting electrode. Combined with results on pump-and-probe measurements, we conclude that the DNP induced by QHE\n\n\f2\n(a)\n\n(a)\n\n(b)\n\nmV\n\n(c)\n\n20\n\ny\n\nxy\n\nx\n\n¢\n\n(b)\n\n¢\n\nA-A\n\nB-B\n\n¢\n\nC-C\n\nTe\n113.22\n\nx\n(c)\n\nxy\n\n(mV)\n\n0.8\n\nA\n\n(d)\n\n¢\n\nA-A\n0.4\n\n(f)\n\n¢\n\nB-B\n\n0.8\n\n113.28\n\nC\n\nFIG. 2: Responses of ∆Vxy to irradiation of a rf-magnetic\nfield obtained at B = 8.65 T (ν = 1.07) and I = +0.80 μA,\nusing the Hall voltage probes (a) A-A′ , (b) B-B′ , and (c) CC′ . The frequency of rf-magnetic field was scanned between\n113.20 MHz and 113.31 MHz. The value of ∆Vxy decreases\nat an NMR frequency of 71 Ga.\n\n¢\n\nC-C\n\n0.0\n\n0.0\n\n113.28 113.22\n\nf (MHz)\n\nB\n\n(e)\n\n113.28 113.22\n\n0.0\n\nm\n\n0.8\n\n0.0\n\n0.8\n\nI ( A)\n\nFIG. 1: (a) Schematic of avalanche multiplication of excited electrons in a breakdown regime of the quantum Hall\neffect14 . The circles indicate electrons in the upper Landau\nsubband and the arrows indicate the electron-drift direction.\n(b) Schematic of spatial gradient of Te expected in the QHE\nbreakdown regime when electrons are injected from the left\nend. (c) Micrograph of the Hall-bar device used in the present\nstudy. (d)-(f) ∆Vxy -I curves obtained by sweeping current in\npositive and negative directions at B = 8.65 T (ν = 1.07).\nHall voltage probe pairs (d) A-A′ , (e) B-B′ , and (f) C-C′\nwere used to obtain the data. The deviation ∆Vxy is defined\nby ∆Vxy = h/e2 I − Vxy . The arrows indicate the directions\nof the current sweep.\n\nbreakdown develops along the electron-drift direction.\nWe used a GaAs/Al0.3 Ga0.7 As single heterostructure\nwafer with a 2DES at the interface. The mobility and\nsheet carrier density of the 2DES at 4.2 K were μ =\n107 m2 V/s and n = 2.23 × 1015 m−2 , respectively. The\nwafer was processed into a 20-μm-wide Hall bar as shown\nin Fig. 1(c). Three pairs of Hall voltage probes were\nattached to the conducting channel of the Hall bar, each\nseparated by 155 μm. The Hall-bar device was cooled\ndown to a temperature of T = 1.5 K, and a magnetic field\nof B was applied perpendicular to the 2DES. A singleturn coil wound around the device was used to irradiate\na rf-magnetic field of Brf for NMR measurements.\nFigures 1(d)-(f) show the dependence of ∆Vxy , which\nis defined by ∆Vxy ≡ h/e2 I − Vxy , on the bias current I.\n\nWhen I is smaller than the critical current Ic , the Hall\nresistance RH = Vxy /I is quantized to h/e2 and ∆Vxy\nis zero. When I exceeds Ic , RH deviates from the quantized value to approach the classical Hall resistance B/ne\nand ∆Vxy is expected to increase. Thus, ∆Vxy is a good\nquantity to probe QHE breakdown in a local region at\nthe intersection of the conducting channel and the voltage probes. The data in Figs. 1(d)-(f) were obtained by\nsweeping I up and down at a rate of 13.2 nA/s using\nthe Hall voltage probes (d) A-A′ , (e) B-B′ , and (f) C-C′\nwith B = 8.65 T (ν = 1.07)21 . On the positive current\npolarity side where electrons are injected from the left\nelectrode in Fig. 1(c), the value of ∆Vxy at probe C-C′\nincreases sharply as I exceeds a critical current of about\nIc = 0.2 μA [Fig. 1(f)]. The value of ∆Vxy at probe B-B′\n[Fig. 1(e)] also increases above Ic , although the change\nin ∆Vxy is smaller than that at probe C-C′ . The change\nin ∆Vxy at probe A-A′ [Fig. 1(d)] is almost zero. On\nthe negative current polarity side, the above described\ntrends are spatially reversed with respect to the center of\nthe Hall bar: the change in ∆Vxy is largest at probe A-A′\nand almost zero at probe C-C′ when the current polarity\nis negative. These systematic differences in the ∆Vxy -I\ncurves show that QHE breakdown is more prominent in\nthe region farther from the electron-injecting electrode.\nThe origin of this dependence of the ∆Vxy -I curves on\nthe probe position can be attributed to the spatial gradient of Te in the QHE breakdown regime, similar to the\nearlier studies at even-integer filling factors14,15 . In addition, we observe hysteresis in the ∆Vxy -I curves, which\nis a signature of the DNP induced by QHE breakdown4.\nThe spatial distribution of DNP was investigated by\nmeasuring NMR signals using the Hall voltage probe\npairs A-A′ , B-B′ , and C-C′ . Since the Hall voltage ∆Vxy\nreflects local electronic properties at the intersection of\nthe conducting channel and the pair of voltage probes20 ,\nthe spatial distribution of DNP can be resolved by comparing the amplitudes of NMR signals obtained from each\n\n\f3\n(a)\n\n¢\n\nA-A\n\n¢\n\n¢\n\nB-B\n\nC-C\n\n(b)\n\n¢\n\nA-A\n\n¢\n\nC-C\n\nB-B\n\n¢\n\n50\n\nI\n\n= 1.0\n\nmA\n\nI\n\nmA\n\nI\n\nmA\n\n0\n50\n\nI\n\n= 0.9\n\nmA\n\n0\n50\n\nI\n\n= 0.7\n\nmA\n\nI\n\nmA\n\nI\n\n= 0.6\n\nmA\n\nI\n\nmA\n\nI\n\nmA\n\n0\n50\n\n0\n50\n\nA\n\nB\n\n¢\n\nB\n\nC\n\nA\n\nB\n\n¢\n\nB\n\nC\n\ne\n\nI\n\n= 0.5\n\ne\nA\n\nmA\n\n¢ C¢\n\nA\n\n¢ C¢\n\n0\n0\n\nx\n\nm\n\n( m)\n\n155\n\n0\n\nx\n\nm\n\n155\n\n( m)\n\nFIG. 3: Amplitudes of the NMR signals obtained at various\nvalues of I plotted against the distance x measured from the\ncenter of the Hall bar. The insets in the bottom panels of\n(a) and (b) indicate the electron-drift direction for I > 0 and\nI < 0, respectively. The dashed curves are visual guides.\n\npair of Hall voltage probes. The data shown in Figs. 2(a)(c) were obtained at B = 8.65 T according to the following procedure. First, nuclear spins were polarized by\napplying a current of I = +0.8 μA through hyperfine\ninteraction4 . Subsequently, Vxy was measured under irradiation of a continuous wave rf-magnetic field of Brf .\nAs the frequency of Brf was scanned, the value of Vxy decreased when the frequency matched the NMR frequency\nof 71 Ga (gyro-magnetic ratio γ = 81.58 rad*MHz/T)\nas shown in Figs. 2(b) and (c). The amplitude of the\nNMR signal is the largest at probe C-C′ , intermediate at\nprobe B-B′ , and zero at probe A-A′ . The dependences\nof the NMR spectrum amplitude for 69 Ga (γ = 64.21\nrad*MHz/T) and 75 As (γ = 45.82 rad*MHz/T) show a\ntrend similar to that of 71 Ga.\nFigure 3 shows the amplitudes of NMR signals VNMR\nplotted against the position x of the Hall voltage probes\nmeasured from the center of the Hall bar. Data obtained\nat various positive and negative values of I are plotted in\nFigs. 3(a) and (b), respectively. At I = 0.5 μA [bottom\npanel in Fig. 3(a)], a slight NMR signal is visible only at\nprobe C-C′ . With increasing I, the amplitude of VNMR\nincreases at probes B-B′ and C-C′ . The region where the\nNMR signal can be observed spreads toward the small x\nregion with increasing I, as shown in Fig. 3(a). Above I\n= 0.9 μA, the VNMR at probe B-B′ reaches a value close\nto that at probe C-C′ , and the VNMR -x curve saturates\nwith increasing x. When the polarity of I is reversed\n\n(I < 0), the amplitude of VNMR decreases with increasing x [Fig. 3(b)]. The VNMR -x characteristics for each\nvalue of |I| with opposite current polarities are almost\nsymmetric to each of their positive-polarity counterparts\nwith respect to the center of the Hall bar. When the polarity of the magnetic field was reversed, this pattern of\nVNMR -x characteristics did not change significantly (not\nshown).\nSince the spatial pattern was changed by reversing the\ncurrent polarity, inhomogeneity in the 2DES is excluded\nas the origin of the spatial dependence of VNMR . The\nedge channel transport also does not play a significant\nrole in the VNMR -x characteristics because the characteristics was not changed by reversing the magnetic field polarity. Therefore, the observed spatial gradient of VNMR\nis attributed to the spatially distributed nature of the\nDNP induced by QHE breakdown. The observed dependence on current polarity dependence indicates that the\namplitude of VNMR increases as the distance from the\nelectron-injecting electrode increases and that the saturation of the VNMR -x curve occurs in the region distant\nfrom the electron-injecting electrode. These features are\nsimilar to the spatial distribution of electron temperature\nTe discussed in earlier studies of QHE breakdown at eveninteger ν 14,15 : a gradual increase in Te over a macroscopic\ndistance along the electron-drift direction and saturation\nof Te in a region sufficiently distant from the electroninjecting electrode [Fig. 1(b)]. This similarity suggests\nthe relevance of the avalanche multiplication of excited\nelectrons to the spatial distribution of DNP, supporting\nour proposed scenario4. We think that avalanche multiplication produces the spatial distribution not only of Te\nbut also of electron spin flip events, which in turn leads\nto the spatial distribution of DNP through hyperfine interaction.\nFinally, in order to unambiguously confirm that the\nabsence of NMR signals at the voltage probe near the\nelectron-injecting electrode is not due to poor sensitivity of Vxy to the DNP, we performed pump-and-probetype measurements similar to those in earlier studies5 .\nDNP was induced by applying pumping current Ipump\nfor a pumping time of tpump . The value of Vxy was\nmeasured at a probe current of Iprobe = 1.0 μA using\nHall voltage probes A-A′ before and after the pumping procedure. The change in Vxy at Iprobe = 1.0 μA,\nδVxy (Ipump ) = Vxy (Ipump , tpump) − Vxy (Ipump , 0), is induced by the DNP pumping. As shown in the inset of\nFig. 4, δVxy increases gradually with increasing tpump\nwhen Ipump = −0.6 μA, whereas the change in δVxy is\nnegligibly small when Ipump = +0.6 μA. This result suggests that nuclear spins are not polarized in the region\nnear the electron-injecting electrode even for a pumping\ncurrent Ipump larger than the Ic of QHE breakdown. Figure 4 shows the dependence of δVxy on Ipump for tpump\n= 600 s. The value of δVxy increases only for Ipump <\n−0.5 μA where electrons are injected from the electrode\nfarther from the voltage probe. These results unambiguously show that the absence of VNMR at probe A-A′ un-\n\n\f4\n\n400\n\nmV)\n\n150\n\nmA\n\nIpump\n\nxy\n\ndV\n\n200\n\nxy\n\ndV\n\n300\n\n(\n\nmV)\n\n(\n\n100\n\n50\n\nIpump=\n\n0\n0\n\n200\n\n100\n\ntpump\n\n+0.6\n\n400\n\nmA\n600\n\n(s)\n\n0\n\n0.0\n\n0.5\n\n1.0\n\nIpump (mA)\n\nFIG. 4: Dependence of δVxy on Ipump , obtained by the pumpand-probe measurement described in the text. The pump\nduration tpump is fixed at 600 s. δVxy is defined as δVxy =\nVxy (Ipump , tpump )−Vxy (Ipump , 0). The inset shows the dependence of δVxy on tpump for the cases of Ipump = ±0.6 μA.\n\nder the condition of I > 0 is attributed to the absence of\nDNP pumping, even for I > Ic .\n\n∗\n†\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n11\n\n12\n\nElectronic address: minoru@riken.jp\nElectronic address: tmachida@iis.u-tokyo.ac.jp\nG. Ebert, K. von Klitzing, K. Ploog, and G. Weimann, J.\nPhys. C 16, 5441 (1983).\nM. E. Cage, R. F. Dziuba, B. F. Field, E. R. Williams, S.\nM. Girvin, A. C. Gossard, D. C. Tsui, and R. J. Wagner,\nPhys. Rev. Lett. 51, 1374 (1983).\nA. M. Song and P. Omling, Phys. Rev. Lett. 84, 3145\n(2000).\nM. Kawamura, H. Takahashi, K. Sugihara, S. Masubuchi,\nK. Hayama, and T. Machida, Appl. Phys. Lett. 90, 022102\n(2007).\nM. Kawamura, H. Takahashi, S. Masubuchi, Y.\nHashimoto, S. Katsumoto, K. Hamaya, and T. Machida,\nJ. Phys. Soc. Jpn. 77, 023710 (2008).\nC. R. Dean, B. A. Piot, G. Gervais, L. N. Pfeiffer, and K.\nW. West, Phys. Rev. B 80, 153301 (2009).\nT. Machida, T. Yamazaki, K. Ikushima, and S. Komiyama,\nAppl. Phys. Lett. 82, 409 (2003).\nG. Yusa, K. Muraki, K. Takashina, K. Hashimoto, and Y.\nHirayama, Nature (London) 434, 1001 (2005).\nH. Takahashi, M. Kawamura, S. Masubuchi, K. Hamaya,\nT. Machida, Y. Hashimoto, and S. Katsumoto, Appl. Phys.\nLett. 91, 092120 (2007).\nK. Hashimoto, K. Muraki, T. Saku, and Y. Hirayama,\nPhys. Rev. Lett. 88, 176601 (2002).\nJ. Smet, R. A. Deutschmann, F. Ertl, W. Wegscheider, G.\nAbstreiter, and K. von Klitzing, Nature 415, 281 (2002).\nO. Stern, N. Freytag, A. Fay, W. Dietsche, J. H. Smet, K.\nvon Klitzing, D. Schuh, and W. Wegscheider, Phys. Rev.\n\nTo summarize, we observe NMR signals in the breakdown regime of ν =1 QHE by measuring Hall voltages\nusing three different pairs of Hall voltage probes attached to the conducting channel of a Hall bar. We\nfind that the amplitude of the NMR signal becomes\nlarge as the distance from the electron-injecting electrode\nincreases. Combined with results on pump-and-probe\nmeasurements, we conclude that DNP induced by QHE\nbreakdown has a spatial gradient along the electron-drift\ndirection in the Hall-bar device. The similarity in the\nspatial distribution between NMR signals and Te supports the scenario that the electron excitation between\nthe spin-resolved Landau levels is relevant to the DNP.\nIn the case of the breakdown of odd-integer QHE, both\nhyperfine and spin-orbit interactions cause the flips of\nelectron spins to excite them into the upper Landau subband with opposite spin polarity. Given that only the\ncontribution of the hyperfine interaction is probed by\nthe NMR measurements, models of the QHE breakdown\ntaking both spin-orbit and hyperfine interactions into account are required for a quantitative understanding of the\nspatial profile of VNMR . We think that studies on the spatial distribution of DNP will give further insight into the\nmechanisms of DNPs reported under various conditions\nof integer fractional QH systems22–24 .\n\n13\n\n14\n\n15\n\n16\n\n17\n\n18\n\n19\n\n20\n\n21\n\n22\n\n23\n\n24\n\nB 70, 075318 (2004).\nN. Kumada, K. Muraki, and Y. Hirayama Phys. Rev. Lett.\n99, 076805 (2007).\nS. Komiyama, Y. Kawaguchi, T. Osada, and Y. Shiraki,\nPhys. Rev. Lett. 77, 558 (1996).\nI. I. Kaya, G. Nachtwei, K. von Klitzing, and K. Eberl,\nEurophys. Lett. 46, 62 (1999).\nS. Komiyama and Y. Kawaguchi, Phys. Rev. B 61, 2014\n(2000).\nK. Güven, R. R. Gerhardts, I. I. Kaya, B. E. Sağol, and\nG. Nachtwei, Phys. Rev. B 65, 155316 (2002).\nI. I. Kaya, G. Nachtwei, K. von Klitzing, and K. Eberl,\nPhys. Rev. B 58, 7536 (1998).\nY. Kawano and T. Okamoto, Phys. Rev. Lett. 95, 166801\n(2005).\nA. K. Geim, S. V. Dubonos, J. G. S. Lok, I. V. Grigorieva,\nJ. C. Maan, L. Theil Hansen, and P. E. Lindelof, Appl.\nPhys. Lett. 71, 2379 (1997).\nThe filling factor was intentionally detuned from ν = 1\nbecause, at ν = 1, the classical Hall coefficient RH =1/ne\n= h/e2 and ∆Vxy is expected to be zero even when I > Ic .\nS. Kronmüller, W. Dietsche, K. von Klitzing, G. Denninger, W. Wegscheider, and M. Bichler, Phys. Rev. Lett.\n82, 4070 (1999).\nM. Kawamura, M. Ono, Y. Hashimoto, S. Katsumoto, K.\nHamaya, and T. Machida, Phys. Rev. B 79, 193304 (2009).\nA. Kou, D. T. McClure, C. M. Marcus, L. N. Pheiffer, and\nK. W. West, Phys. Rev. Lett. 105, 056804 (2010).\n\n\f"}