{"id": "http://arxiv.org/abs/0909.1311v1", "guidislink": true, "updated": "2009-09-07T18:51:43Z", "updated_parsed": [2009, 9, 7, 18, 51, 43, 0, 250, 0], "published": "2009-09-07T18:51:43Z", "published_parsed": [2009, 9, 7, 18, 51, 43, 0, 250, 0], "title": "Development of neutrino initiated cascades at mid and high altitudes in\n  the atmosphere", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0909.4030%2C0909.0451%2C0909.5551%2C0909.1028%2C0909.4450%2C0909.0441%2C0909.5291%2C0909.1509%2C0909.4746%2C0909.2527%2C0909.5602%2C0909.2027%2C0909.3154%2C0909.3314%2C0909.3619%2C0909.1053%2C0909.3847%2C0909.4780%2C0909.5556%2C0909.3251%2C0909.3064%2C0909.3617%2C0909.5661%2C0909.2650%2C0909.1503%2C0909.5623%2C0909.2662%2C0909.3601%2C0909.2001%2C0909.1636%2C0909.3912%2C0909.3709%2C0909.1568%2C0909.2618%2C0909.3511%2C0909.5329%2C0909.0042%2C0909.2049%2C0909.4757%2C0909.1749%2C0909.4473%2C0909.2615%2C0909.5253%2C0909.1947%2C0909.1111%2C0909.1978%2C0909.5166%2C0909.1552%2C0909.4907%2C0909.3715%2C0909.0784%2C0909.4941%2C0909.0340%2C0909.2730%2C0909.5509%2C0909.0238%2C0909.5254%2C0909.4953%2C0909.2381%2C0909.0220%2C0909.5429%2C0909.3856%2C0909.4126%2C0909.3124%2C0909.1311%2C0909.0046%2C0909.4143%2C0909.1404%2C0909.5435%2C0909.2067%2C0909.0084%2C0909.1656%2C0909.3477%2C0909.3893%2C0909.3959%2C0909.2353%2C0909.5232%2C0909.1207%2C0909.4573%2C0909.1012%2C0909.0366%2C0909.0681%2C0909.4798%2C0909.0444%2C0909.1318%2C0909.4631%2C0909.3398%2C0909.4819%2C0909.2411%2C0909.5655%2C0909.4372%2C0909.2794%2C0909.4519%2C0909.0343%2C0909.4690%2C0909.1082%2C0909.0708%2C0909.1633%2C0909.0143%2C0909.0825%2C0909.5385&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Development of neutrino initiated cascades at mid and high altitudes in\n  the atmosphere"}, "summary": "Neutrinos are a very promising messenger at tens of EeV and above. They can\nbe produced by several channels, namely as by products of hadronic interactions\nat the sources, as the main products of the decay of super massive particles\nand, in a guaranteed way, as the result of the propagation of UHECR through the\nbath of microwave relic photons. A new era of very large exposure space\nobservatories, of which the JEM-EUSO mission is a prime example, is on the\nhorizon and, with it, it is even larger the possibility of astrophysical\nneutrino detection at the highest energies. In the present work we use a\ncombination of the PYTHIA interaction code with the CONEX shower simulation\npackage in order to produce fast one-dimensional simulations of neutrino\ninitiated showers in air. We make a detail study of the structure of the\ncorresponding longitudinal profiles, but focus our physical analysis mainly on\nthe development of showers at mid and high altitudes, where they can be an\ninteresting target for space fluorescence observatories.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0909.4030%2C0909.0451%2C0909.5551%2C0909.1028%2C0909.4450%2C0909.0441%2C0909.5291%2C0909.1509%2C0909.4746%2C0909.2527%2C0909.5602%2C0909.2027%2C0909.3154%2C0909.3314%2C0909.3619%2C0909.1053%2C0909.3847%2C0909.4780%2C0909.5556%2C0909.3251%2C0909.3064%2C0909.3617%2C0909.5661%2C0909.2650%2C0909.1503%2C0909.5623%2C0909.2662%2C0909.3601%2C0909.2001%2C0909.1636%2C0909.3912%2C0909.3709%2C0909.1568%2C0909.2618%2C0909.3511%2C0909.5329%2C0909.0042%2C0909.2049%2C0909.4757%2C0909.1749%2C0909.4473%2C0909.2615%2C0909.5253%2C0909.1947%2C0909.1111%2C0909.1978%2C0909.5166%2C0909.1552%2C0909.4907%2C0909.3715%2C0909.0784%2C0909.4941%2C0909.0340%2C0909.2730%2C0909.5509%2C0909.0238%2C0909.5254%2C0909.4953%2C0909.2381%2C0909.0220%2C0909.5429%2C0909.3856%2C0909.4126%2C0909.3124%2C0909.1311%2C0909.0046%2C0909.4143%2C0909.1404%2C0909.5435%2C0909.2067%2C0909.0084%2C0909.1656%2C0909.3477%2C0909.3893%2C0909.3959%2C0909.2353%2C0909.5232%2C0909.1207%2C0909.4573%2C0909.1012%2C0909.0366%2C0909.0681%2C0909.4798%2C0909.0444%2C0909.1318%2C0909.4631%2C0909.3398%2C0909.4819%2C0909.2411%2C0909.5655%2C0909.4372%2C0909.2794%2C0909.4519%2C0909.0343%2C0909.4690%2C0909.1082%2C0909.0708%2C0909.1633%2C0909.0143%2C0909.0825%2C0909.5385&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Neutrinos are a very promising messenger at tens of EeV and above. They can\nbe produced by several channels, namely as by products of hadronic interactions\nat the sources, as the main products of the decay of super massive particles\nand, in a guaranteed way, as the result of the propagation of UHECR through the\nbath of microwave relic photons. A new era of very large exposure space\nobservatories, of which the JEM-EUSO mission is a prime example, is on the\nhorizon and, with it, it is even larger the possibility of astrophysical\nneutrino detection at the highest energies. In the present work we use a\ncombination of the PYTHIA interaction code with the CONEX shower simulation\npackage in order to produce fast one-dimensional simulations of neutrino\ninitiated showers in air. We make a detail study of the structure of the\ncorresponding longitudinal profiles, but focus our physical analysis mainly on\nthe development of showers at mid and high altitudes, where they can be an\ninteresting target for space fluorescence observatories."}, "authors": ["A. D. Supanitsky", "G. Medina-Tanco", "K. Asano", "D. Cline", "T. Ebisuzaki", "S. Inoue", "P. Lipari", "A. Santangelo", "K. Shinozaki", "G. Sigl", "Y. Takahashi", "M. Teshima"], "author_detail": {"name": "M. Teshima"}, "author": "M. Teshima", "arxiv_comment": "Proceedings of the 31st ICRC, Lodz, Poland, July 2009", "links": [{"href": "http://arxiv.org/abs/0909.1311v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0909.1311v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.HE", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0909.1311v1", "affiliation": "for the JEM-EUSO Collaboration", "arxiv_url": "http://arxiv.org/abs/0909.1311v1", "journal_reference": null, "doi": null, "fulltext": "PROCEEDINGS OF THE 31st ICRC, ŁÓDŹ 2009\n\n1\n\nDevelopment of neutrino initiated cascades at mid and high\naltitudes in the atmosphere\nA.D. Supanitsky∗, G. Medina-Tanco∗, K. Asano†, D. Cline§ , T. Ebisuzaki¶ ,\nx\nS. Inouek, P. Lipari∗∗ , A. Santangelo†† , K. Shinozaki¶ , G. Sigl‡‡ , Y. Takahashi\nxi\nand M. Teshima for the JEM-EUSO Collaboration\n\narXiv:0909.1311v1 [astro-ph.HE] 7 Sep 2009\n\n∗\n\nDepartamento de Fı́sica de Altas Energı́as, Instituto de Ciencias Nucleares, Universidad Nacional Autónoma\nde México, A. P. 70-543, 04510, México, D. F., México.\n† Interactive Research Center of Science, Graduate School of Science, Tokyo Institute of Technology,\n2-12-1 Ookayama Meguro-ku Tokyo 152-8550, Japan.\n§ Department of Physics and Astronomy, University of California, Los Angles, USA.\n¶ RIKEN Advanced Science Institute, Japan.\nk Dept. of Physics, Kyoto University, Kyoto 606-8502, Japan.\n∗∗ INFN-Roma La Sapienza, I-00185 Roma, Italy.\n†† Institute fuer Astronomie und Astrophysik Kepler Center for Astro and Particle Physics\nEberhard Karls University Tuebingen Germany.\n‡‡ Institut theoretische Physik Universitaet Hamburg Luruper Chaussee 149 D-22761 Hamburg, Germany.\nx\nDept. of Physics, The University of Alabama in Huntsville, Huntsville, AL35899, USA.\nxi\nMax-Planck-Institut für Physik, Föhringer Ring 6, D-80805 München, Germany.\n\nAbstract. Neutrinos are a very promising messenger at tens of EeV and above. They can be\nproduced by several channels, namely as by products\nof hadronic interactions at the sources, as the main\nproducts of the decay of super massive particles and,\nin a guaranteed way, as the result of the propagation\nof UHECR through the bath of microwave relic\nphotons. A new era of very large exposure space\nobservatories, of which the JEM-EUSO mission is a\nprime example, is on the horizon and, with it, it is\neven larger the possibility of astrophysical neutrino\ndetection at the highest energies. In the present work\nwe use a combination of the PYTHIA interaction\ncode with the CONEX shower simulation package in\norder to produce fast one-dimensional simulations\nof neutrino initiated showers in air. We make a\ndetail study of the structure of the corresponding\nlongitudinal profiles, but focus our physical analysis\nmainly on the development of showers at mid and\nhigh altitudes, where they can be an interesting target\nfor space fluorescence observatories.\nKeywords: extreme-energy cosmic rays; neutrinos\nI. I NTRODUCTION\nThe neutrino flux carries very important astrophysical\ninformation. A high energy neutrino flux is expected as\na by-product of the interactions of cosmic ray hadrons\nat the sources [1]. They can also be produced during the\npropagation of cosmic rays in the intergalactic medium\n[2] and as the main product of the decay of superheavy\nrelic particles [3], [4].\nJEM-EUSO [5] with its 1012 tn of atmospheric target\nvolume has the real possibility of observing high energy\n\nneutrinos and make important contributions to the understanding of UHECR production and propagation [6], [7].\nSource distributions rapidly evolving with redshift would\nbe particularly favorable by increasing the cosmogenic\nneutrino flux at highest energies [2]. A thorough understanding of neutrino deep inelastic scattering, as well\nas the evolution of longitudinal profiles of atmospheric\nneutrino showers, are extremely important in order to\ntake advantage of the full potential of the experiment.\nConversely, besides the obvious astrophysical value, the\nproperties of just a few observed showers can also\ngive valuable information on the physics governing high\nenergy neutrino-nucleon interactions. The objective of\nthis work is to present the first part of an ongoing effort\nin that direction.\nII. N EUTRINO\n\nNUCLEON INTERACTION\n\nHigh energy neutrinos that propagate in the Earth\natmosphere can interact with protons and neutrons of\nthe air molecules. There are two possible channels for\nthis interaction, charge and neutral current. The major\nuncertainty on the differential cross section at the energies considered comes from the unknown behavior of\nthe parton distribution functions (PDFs) at very small\nvalues of the parton momentum fraction x.\nThe simulation of neutrino nucleon interaction is\nperformed by using the PYTHIA code [8]. The parton\ndistribution library LHAPDF [9] is linked with PYTHIA\nin order to be able to use different extrapolations of\nthe PDFs. In this work the CTEQ6 [10] and GJR08\n[11] PDF sets are considered. Fig. 1 shows the energy\nfraction carried by the leading particle as a function\nof the incident neutrino energy for the charge current\n\n\f2\n\nA. D. SUPANITSKY et al.NEUTRINO INITIATED CASCADES AT MID AND HIGH ALTITUDES\n\n1\n\n180\n\n×106\n\nSea Level\n\n160\n\ndE/dX [GeV g-1 cm2]\n\n< ELP/Eν >\n\n0.9\n\n0.8\n\n0.7\n\n0.6\n\n140\n120\n100\n80\n60\n40\n\n0.5\n20\n0.4\n\n12\n\n14\n\n16\n\n18\n\n0\n0\n\n20\n\n500\n\n1000\n\n1500\n\n2000\n\n2500\n\n3000\n\n3500\n\n4000\n\nlog(E/eV)\n\nX-X0 [g cm-2]\n\nFig. 1. Average energy fraction taken by the electron in a protonelectron neutrino charge current interaction obtained from PYTHIA\nwith CTEQ6 (black circles) and GJR08 (gray squares) sets of PDFs.\n\nFig. 3. Horizontal electron neutrino showers at sea level of Eν =\n1020 eV, injected at X0 = 36500 gcm−2 , in a point contained on\nthe vertical axis of the FOV.\n\n10\n\nEnergy Fraction\n\nEν = 1016 eV\nEν = 1020 eV\n\n1\n\nEν = 1020.75 eV\n10-1\n\n10-2\n\n10-3\n\nLP γ\n\nπ 0 π + π - ρ 0 K - ω Ks0 Kl 0 K + n\n\nn\n\np\n\np\n\nΛ\n\nΛ\n\nFig. 2. Average energy fraction for the most important particles\nrecognized by CONEX produced in a charge current interaction of an\nelectron neutrino with a proton for three different neutrino energies.\n\ninteraction of an electron neutrino with a proton for\nboth sets of PDFs considered. In both cases the energy\nfraction increases steadily with the incoming neutrino\nenergy. The difference between both PDFs increases up\nto a maximum of a few percent at the highest energies.\nBesides the leading particle, different types of secondaries are generated as a result of the interaction. In\nparticular, in this work we are interested in the ones\nrecognized by CONEX [12] code which is used to\nsimulate the neutrino showers. Fig. 2 shows the energy\nfraction taken by the most relevant particles recognized\nby CONEX for three different electron neutrino energies,\nobtained as a result of the charge current interaction\nwith a proton. It can be seen that the smaller the\nneutrino energy the larger the energy fraction taken by\nthe secondary particles.\nIII. N EUTRINO\n\nSHOWERS\n\nThe particles produced in a neutrino-nucleon interaction are injected in CONEX with QGSJET-II [13]\nproducing extensive air showers. Because the mean free\npath of neutrinos propagating in the atmosphere is very\nsmall, they can interact very deeply, after traversing a\nlarge amount of matter. Fig. 3 shows the energy deposit\n\nas a function of X − X0 , where X0 corresponds to the\ninjection point, for horizontal electron neutrino showers\nat sea level of Eν = 1020 eV, injected at X0 = 36500 g\ncm−2 (maximum slant depth for a completely horizontal\nshower). Note that the interaction point is situated on the\nvertical axis of the JEM-EUSO field of view (FOV). Fig.\n3 shows very broad profiles which may present several\npeaks and large fluctuations. This behavior is due to\nthe Landau Pomeranchuk Migdal (LPM) effect, which\nis very important inside dense regions of the atmosphere\nand for electromagnetic particles, electrons in this case,\nwhich take about 80% of the parent neutrino energy.\nAn orbital detector like JEM-EUSO can also detect\nhorizontal showers that do not hit the ground. In particular, horizontal neutrinos can interact at higher altitudes\nproducing a shower observable by the detector. Fig.\n4 shows the mean value and one sigma confidence\nlevel regions for the longitudinal profiles for horizontal\nelectron neutrino air showers of Eν = 1020 eV, injected\nat different altitudes in points contained on the vertical\naxis of the cone of the FOV. It can be seen that as\nthe altitude increases the fluctuations are reduced and,\non average, the profiles become thinner. This is due\nto the fact that the LPM effect become progressively\nless important with increasing altitude because of the\ndecrease in atmospheric density. Note that just showers\nup to 20 km of altitude are considered because, at higher\naltitudes, the grammage of the FOV is not enough to\ncontain the whole profiles.\nAs already mentioned, at smaller altitude the longitudinal profiles present a complicated structure (see Fig.\n3). In particular, the showers present multiple peaks.\nFig. 5 shows the distribution functions of the position\n1\nof each maximum. Xmax\ncorresponds to the position\nof the first maximum counted from the start of the\n2\nis the second one and so on. Note that the\nshower, Xmax\n1\ndistribution function of Xmax\nis bi-valued and its first\npeak is located at ∼ 800 g cm−2 , while the second one\nis at ∼ 1500 g cm−2 . The first peak corresponds to the\n\n\fPROCEEDINGS OF THE 31st ICRC, ŁÓDŹ 2009\n\n180\n\n×106\n\n20 km\n\n160\n\nSea level\nh0 = 5 km\nh0 = 10 km\nh0 = 20 km\n\n1\n\n140\n\n0.8\n\n5 km\n\n120\n\nProbability\n\ndE/dX [GeV g-1 cm2]\n\n3\n\n100\n80\n60\n\n0.6\n\n0.4\n\n40\n\n0\n0\n\n0.2\n\nSea level\n\n20\n500\n\n1000\n\n1500\n\n2000\n\n2500\n\nX-X0 [g cm-2]\n\n3000\n\n3500\n\n4000\n\n0\n\n1\n\n2\n\nNXi\n\n3\n\n4\n\nmax\n\nFig. 4. Mean value and one sigma regions of the longitudinal profile\ncorresponding to horizontal electron neutrino showers of Eν = 1020\neV for different altitudes. The interaction point is contained on the\nvertical axis of the JEM-EUSO telescope.\n\nX1max\nX2max\nX3max\n\n160\n140\n120\n100\n80\n60\n40\n20\n0\n0\n\n500\n\n1000\n\n1500\n2000\n2500\nX imax-X 0 [g cm-2]\n\n3000\n\n3500\n\n4000\n\nFig. 5. Distribution of the position of the maxima for electron neutrino\nshowers of Eν = 1020 eV at sea level.\n\ndevelopment of the hadronic component of the electron\nneutrino cascade, whereas the second one reflects the\nelectromagnetic portion of the shower.\nThis complicated structure simplifies as the altitude\nincreases. Fig. 6 shows the probability of finding a\ni\nprofile with a given number of peaks, NXmax\n. As the\naltitude increases the probability of finding a shower\nwith more than one peak goes to zero.\nThe first portion of the cascades is, in general, dominated by the hadronic component. Therefore, the way\nin which the primary neutrino energy is distributed can\nbe assessed by,\nR Xc\ndE\ndX dX\nFen = R X0 lim\n,\n(1)\ndE\ndX dX\nXc\n\nwhere dE/dX is the energy deposition, Xc = 1200\ngcm−2 is a characteristic depth that roughly separates the hadronic-dominated from the electromagneticdominated portions of the shower, and Xlim is the\nmaximum atmospheric depth reached by the shower. Fen\nis calculated only for those showers that present a first\n\nFig. 6. Probability of an electron neutrino shower to have NX i\nmax\nmaxima for Eν = 1020 eV for horizontal showers at different\naltitudes.\n\nmaximum at a depth smaller than Xc . Fig. 7 shows the\nFen distributions obtained for CTEQ6, GJR08 and for a\nmodification of the CTEQ6 results in which the leading\nparticle takes 70% of the neutrino energy, corresponding\nto horizontal 1020 eV electron neutrinos injected at sea\nlevel at the axis of the FOV. It can be seen that Fen is\ncorrelated with the energy taken by the leading particle.\nThe smallest value of the average of Fen corresponds to\nCTEQ6 because the leading particle takes about 82% of\nthe neutrino showers while, in the case of GJR08, it takes\n∼ 79%. The differences between the results obtained\nfor these models are very small. In the case in which\nthe energy taken by the leading particle is artificially\nreduced to 70% (hashed histogram), the mean value of\nFen increases. Note that, in the latter case, the energy\nextracted from the leading particle in order to reduce its\naverage energy, is redistributed among the other daughter\nparticles in such a way that the ratio between the energy\ntaken by a given particle and the total energy taken by all\nsecondaries, excluding the leading particle, is constant.\nThe sensitivity of Fen to the hadron component of\nthe showers depends on the altitude. Showers injected\nat sea level in regions of high density are dominated by\nthe LPM effect allowing a clearer separation between the\nhadronic and electromagnetic portions of the cascades.\nThe parameter Fen can be very useful to understand\nneutrino interactions with atmospheric nuclei and, in\nparticular, to estimate the energy fraction taken by the\nleading particle. Any practical application, however, will\ndepend on the actual event rate.\nIV. P ROTON\n\nAND NEUTRINO EVENTS\n\nThe interaction length for protons is λpr (1020 eV) ∼\n36 g cm−2 and for neutrinos is λν (1020 eV) ∼ 3.2 × 107\ng cm−2 . The survival probability of an horizontal proton\nthat reaches the Earth surface at the vertical axis of\nthe FOV is ∼ exp(−1000), whereas the corresponding\nprobability for a neutrino is ∼ exp(−0.001). Therefore,\ndespite the fact that horizontal neutrino and proton\n\n\f4\n\nA. D. SUPANITSKY et al.NEUTRINO INITIATED CASCADES AT MID AND HIGH ALTITUDES\n\n0.4\n\n180\n\nCTEQ6\n0.35\n\n160\n\nGJR08\n\n0.3\n\ndE/dX [GeV g-1 cm2]\n\nCTEQ6 Modified\n\n0.25\n0.2\n0.15\n0.1\n\n140\n\nProton\n\n120\n100\n80\n60\n40\n\n0.05\n0\n\n×106\n\nNeutrino\n\n20\n0\n\n2\n\n4\n\nFen\n\n6\n\n8\n\n10\n\nFig. 7. Distribution function of parameter Fen (see Eq. (1)) for\nCTEQ6, GJR08 models and also for an artificial modification of the\nCTEQ6 prediction such that the leading particle takes 70% of the\nneutrino energy. Horizontal showers of 1020 eV injected at sea level\nat the axis of the FOV are considered.\n\nshowers have very different observational characteristics,\nit is very unlikely to observe a proton interacting so deep\nin the atmosphere.\nNevertheless, for a given proton and a neutrino fluxes,\nthere exists a particular slant depth for which the proton\nand neutrino events have the same rate. For any particle type, the probability of interacting in the interval\n[X, X + ∆X] is given by,\nPint (E; X, ∆X) =\n\nexp(−X/λ(E)) ×\n[1 − exp(−∆X/λ(E))] , (2)\n\nwhere λ(E) is the interaction length at a\ngiven energy. Therefore, solving the equation\npr\nν\n(E; X0 , ∆X) = φν (E) Pint\n(E; X0 , ∆X),\nφpr (E) Pint\nwhere φpr (E) and φν (E) are the proton and neutrino\nfluxes, the slant depth at which protons and neutrinos\ncan be detected with the same rate is,\n\u0013\n\u0014 \u0012\nφν (E)\nλpr (E)λν (E)\n+\n× log\nX(E) =\nλpr (E) − λν (E)\nφpr (E)\n\u0012\n\u0013\u0015\n1 − exp(−∆X/λpr (E))\nlog\n.\n(3)\n1 − exp(−∆X/λν (E))\nThe function X(E) is obtained by using: ∆X =\nλpr (E), the proton-air cross section of Sibyll 2.1\nCC\n[14], the neutrino cross section σN\nν (E) = 6.04 ×\n−36\n0.358\n2\n10 (E/GeV)\ncm [15], the Waxman-Bachall upper limit for the neutrino flux [16] and a power law fit\nof the Auger spectrum [17]. Therefore, for E = 1020\neV the event rates for protons and neutrinos are of the\nsame order of magnitude for X ∼\n= 142 gcm−2 . The\nlatter means that, under the assumptions of the present\ncalculation, protons can act as a background for neutrino\nidentification in inclined events.\nFig. 8 shows the average profile and the 68% CL\nfor proton and electron neutrino induce air shower\nlongitudinal profiles of zenith angle θ = 45◦ and primary\nenergy 1020 eV injected at 142 gcm−2 . Although, the\n\n0\n\n200\n\n400\n\n600\n\n800\n\n1000\n\n1200\n\n1400\n\nX [g cm-2]\nFig. 8. Proton and electron neutrino air showers of 1020 eV, θ = 45◦\ninjected at 142 gcm−2 .\n\nevent rate of this kind of showers are similar for both\nprotons and neutrinos, the profiles, however, are quite\ndifferent making a good discrimination possible. More\nspecifically, it can be seen that the neutrino showers\ndevelop deeper in the atmosphere and present larger\nfluctuations, due to the LPM effect.\nV. C ONCLUSIONS\nNeutrino detection is of great importance for the\nunderstanding of several astrophysical process and, in\nparticular, the origin and propagation of the highest energy cosmic rays. JEM-EUSO is technically capable of\nobserving neutrino initiated cascades and to discriminate\nthese cascades from hadronic ones. Furthermore, the\nhigh degree of structuring of the longitudinal neutrino\nshower profiles opens a spectrum of experimental opportunities which JEM-EUSO will be able to explore, with\nlarger or lesser success, depending on the exact shape\nof the neutrino energy spectrum at the highest energies.\nR EFERENCES\n[1] M. Kachelriess, S. Ostapchenko, and R. Tomas,\narXiv:0805.2608.\n[2] V. Berezinsky and G. Zatsepin, Phys. Lett. 28B, 423 (1969).\n[3] R. Aloisio, V. Berezinsky, and M. Kachelriess, Phys. Rev. D69,\n094023 (2004).\n[4] P. Battacharjee and G. Sigl, Phys. Rept. 327, 109 (2000).\n[5] T. Ebisuzaki, 2009 this proc.. T. Ebisuzaki, Nucl. Phys. B 175176, 237-240 (2008).\n[6] G. Medina-Tanco et al., 2009 this proceedings.\n[7] S. Palomares-Ruiz, A. Irimia, and T. Weiler, Phys. Rev. D73,\n083003 (2006).\n[8] T. Sjostrand, S. Mrenna, and P. Skands, JHEP 0605, 026 (2006).\n[9] M.\nWhalley,\nD.\nBourilkov,\nand\nR.\nGroup,\nhttp://hepforge.cedar.ac.uk/lhapdf/.\n[10] P. Nadolsky et al., Phys. Rev. D78, 013004 (2008).\n[11] M. Gück, P. Jimenez-Delgado, and E. Reya, Eur. Phys. J. C53,\n355 (2008).\n[12] T. Bergmann et al., Astropart. Phys. 26, 420 (2007).\n[13] S. Ostapchenko, Nucl. Phys. Proc. Suppl. B151, 143 (2006).\n[14] R. Engel, T. Gaiser, P. Lipari, and T. Stanev, Proc. 26th ICRC\n1, 415 (2000).\n[15] L. Anchordoqui, A. Cooper-Sarkar, D. Hooper, and S. Sarkar,\nPhys. Rev. D74, 043008 (2006).\n[16] E. Waxman and J. Bahcall, Phys. Rev. D59, 023002 (1999).\n[17] J. Abraham et al., Phys. Rev. Lett. 101, 061101 (2008).\n\n\f"}