{"id": "http://arxiv.org/abs/1003.4978v2", "guidislink": true, "updated": "2010-11-26T19:57:28Z", "updated_parsed": [2010, 11, 26, 19, 57, 28, 4, 330, 0], "published": "2010-03-25T19:17:17Z", "published_parsed": [2010, 3, 25, 19, 17, 17, 3, 84, 0], "title": "Bouchaud walks with variable drift", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.4466%2C1003.5610%2C1003.2452%2C1003.0107%2C1003.4856%2C1003.2197%2C1003.5088%2C1003.5903%2C1003.5067%2C1003.5832%2C1003.4190%2C1003.2862%2C1003.1076%2C1003.0997%2C1003.5233%2C1003.6098%2C1003.2400%2C1003.1963%2C1003.3098%2C1003.2543%2C1003.1540%2C1003.5208%2C1003.1163%2C1003.5438%2C1003.5361%2C1003.4070%2C1003.1208%2C1003.1888%2C1003.2984%2C1003.0938%2C1003.4047%2C1003.0547%2C1003.5550%2C1003.5185%2C1003.0996%2C1003.3973%2C1003.0067%2C1003.4319%2C1003.5110%2C1003.5226%2C1003.3937%2C1003.4000%2C1003.1314%2C1003.4453%2C1003.4561%2C1003.0296%2C1003.1983%2C1003.2373%2C1003.1500%2C1003.2381%2C1003.0322%2C1003.4978%2C1003.4936%2C1003.4427%2C1003.0673%2C1003.2188%2C1003.2896%2C1003.2363%2C1003.4627%2C1003.4384%2C1003.5288%2C1003.0612%2C1003.3058%2C1003.5681%2C1003.5966%2C1003.3717%2C1003.1527%2C1003.0307%2C1003.0340%2C1003.3450%2C1003.3308%2C1003.0776%2C1003.3192%2C1003.2445%2C1003.5228%2C1003.0777%2C1003.3800%2C1003.0624%2C1003.3995%2C1003.0852%2C1003.3969%2C1003.2035%2C1003.5746%2C1003.3261%2C1003.2895%2C1003.5615%2C1003.4605%2C1003.3106%2C1003.3303%2C1003.2765%2C1003.2857%2C1003.4128%2C1003.0196%2C1003.4895%2C1003.2898%2C1003.0961%2C1003.1885%2C1003.3409%2C1003.6021%2C1003.0169%2C1003.3506&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Bouchaud walks with variable drift"}, "summary": "In this paper we study a sequence of Bouchaud trap models on $\\mathbb{Z}$\nwith drift. We analyze the possible scaling limits for a sequence of walks,\nwhere we make the drift decay to 0 as we rescale the walks. Depending on the\nspeed of the decay of the drift we obtain three different scaling limits. If\nthe drift decays slowly as we rescale the walks we obtain the inverse of an\n\\alpha$-stable subordinator as scaling limit. If the drift decays quickly as we\nrescale the walks, we obtain the F.I.N. diffusion as scaling limit. There is a\ncritical speed of decay separating these two main regimes, where a new process\nappears as scaling limit. This critical speed is related to the index $\\alpha$\nof the inhomogeneity of the environment.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.4466%2C1003.5610%2C1003.2452%2C1003.0107%2C1003.4856%2C1003.2197%2C1003.5088%2C1003.5903%2C1003.5067%2C1003.5832%2C1003.4190%2C1003.2862%2C1003.1076%2C1003.0997%2C1003.5233%2C1003.6098%2C1003.2400%2C1003.1963%2C1003.3098%2C1003.2543%2C1003.1540%2C1003.5208%2C1003.1163%2C1003.5438%2C1003.5361%2C1003.4070%2C1003.1208%2C1003.1888%2C1003.2984%2C1003.0938%2C1003.4047%2C1003.0547%2C1003.5550%2C1003.5185%2C1003.0996%2C1003.3973%2C1003.0067%2C1003.4319%2C1003.5110%2C1003.5226%2C1003.3937%2C1003.4000%2C1003.1314%2C1003.4453%2C1003.4561%2C1003.0296%2C1003.1983%2C1003.2373%2C1003.1500%2C1003.2381%2C1003.0322%2C1003.4978%2C1003.4936%2C1003.4427%2C1003.0673%2C1003.2188%2C1003.2896%2C1003.2363%2C1003.4627%2C1003.4384%2C1003.5288%2C1003.0612%2C1003.3058%2C1003.5681%2C1003.5966%2C1003.3717%2C1003.1527%2C1003.0307%2C1003.0340%2C1003.3450%2C1003.3308%2C1003.0776%2C1003.3192%2C1003.2445%2C1003.5228%2C1003.0777%2C1003.3800%2C1003.0624%2C1003.3995%2C1003.0852%2C1003.3969%2C1003.2035%2C1003.5746%2C1003.3261%2C1003.2895%2C1003.5615%2C1003.4605%2C1003.3106%2C1003.3303%2C1003.2765%2C1003.2857%2C1003.4128%2C1003.0196%2C1003.4895%2C1003.2898%2C1003.0961%2C1003.1885%2C1003.3409%2C1003.6021%2C1003.0169%2C1003.3506&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this paper we study a sequence of Bouchaud trap models on $\\mathbb{Z}$\nwith drift. We analyze the possible scaling limits for a sequence of walks,\nwhere we make the drift decay to 0 as we rescale the walks. Depending on the\nspeed of the decay of the drift we obtain three different scaling limits. If\nthe drift decays slowly as we rescale the walks we obtain the inverse of an\n\\alpha$-stable subordinator as scaling limit. If the drift decays quickly as we\nrescale the walks, we obtain the F.I.N. diffusion as scaling limit. There is a\ncritical speed of decay separating these two main regimes, where a new process\nappears as scaling limit. This critical speed is related to the index $\\alpha$\nof the inhomogeneity of the environment."}, "authors": ["Manuel Cabezas Parra"], "author_detail": {"name": "Manuel Cabezas Parra"}, "author": "Manuel Cabezas Parra", "links": [{"href": "http://arxiv.org/abs/1003.4978v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1003.4978v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.PR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.PR", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "60K37, 60G52, 60F17", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1003.4978v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1003.4978v2", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "arXiv:1003.4978v2 [math.PR] 26 Nov 2010\n\nBOUCHAUD WALKS WITH VARIABLE DRIFT\nMANUEL CABEZAS PARRA\nAbstract. We study the possible scaling limits of a sequence of Bouchaud trap models on Z\nwith a drift which decays to 0 as we rescale the walks: as the time parameter is rescaled by n,\nthe drift decays as n−a , for some fixed a ≥ 0. Depending on the speed of the decay of the drift\nwe obtain three different scaling limits. If the drift decays slowly as we rescale the walks (small\na), we obtain the inverse of an α-stable subordinator as scaling limit. If the drift decays quickly\nas we rescale the walks (big a), we obtain the F.I.N. diffusion as scaling limit. There is a critical\nspeed of decay separating these two main regimes, where a new process appears as scaling limit.\nThis new process is a drifted Brownian motion with a random, purely atomic speed measure.\nThe critical speed of decay ac of the drift is related to the index α of the inhomogeneity of the\nenvironment by the equation ac = α/(α + 1).\n\n2000 Mathematics Subject Classification. 60K37, 60G52, 60F17.\nKeywords. Bouchaud trap model, random walk, scaling limit, drift, phase transition.\n\n1. Introduction\nThe Bouchaud trap model (B.T.M.) is a continuous time random walk X on a graph G with\n\nrandom jump rates. To each vertex x of G we assign a positive number τx where (τx )x∈G is an\ni.i.d. sequence such that\nlim uα P[τx ≥ u] = 1\n\nu→∞\n\n(1)\n\nwith α ∈ (0, 1). This means that the distribution of τx has heavy tails. Each visit of X to x ∈ G\nlasts an exponentially distributed time with mean τx . Let S(k) be the time of the k-th jump of X.\n(S(k), k ∈ N) is called the clock process of X. Let Yk := X(S(k)) be the position of X after the\n\nk-th jump. (Yk : k ∈ N) is called the embedded discrete time random walk associated to X.\n\nThis model was introduced by J.-P. Bouchaud in [9] and has been studied by physicists as a\ntoy model for the analysis of the dynamics of some complex systems such as spin-glasses. More\nprecisely, each vertex x of G corresponds to a metastable state of the complex system, and X\n\nrepresents the trajectory of the system over its phase space. One of the phenomena that this\nmodel has helped to understand is that of aging, a characteristic feature of the slow dynamics of\nmany metastable systems. For an account of the physical literature on the B.T.M. we refer to [10].\nThe model has also been studied by mathematicians on different graphs, exhibiting a variety\nof behaviors. In [11], Fontes, Isopi and Newman analyze the one-dimensional case (G = Z)and\nDate: June 4, 2018.\n1\n\n\fBOUCHAUD WALKS WITH VARIABLE DRIFT\n\n2\n\nwhere the walk X is symmetric. They obtain a scaling limit for X which is called the FontesIsopi-Newman (F.I.N.) singular diffusion. This diffusion is a speed measure change of a Brownian\nmotion by a random, purely atomic measure ρ, where ρ is the Stieltjes measure associated to\nan α-stable subordinator. Different aging regimes for the one-dimensional case where found by\nBen-Arous and Cěrný in [4]. In higher dimensions (G = Zd , d ≥ 2), the symmetric model has a\nbehavior completely different to the one-dimensional case, as shown by Ben Arous and Cěrný in\n[6], and by Ben Arous, Cěrný and Mountford in [8]. In these papers, a scaling limit and aging\nresults where obtained for X. The scaling limit is called fractional kinetic process (F.K.P) which is\na time-change of a d-dimensional Brownian motion by the inverse of an α-stable subordinator. In\n[1] and [2] Ben Arous, Bovier and Gayrard obtained aging properties of the model on the complete\ngraph. A study of this walk for a wider class of graphs can be found on [7]. For a general account\non the mathematical study of the model, we refer to [5].\nThe difference between the one dimensional case and the model in higher dimensions can be\nPk−1\nunderstood as follows. We can express the clock process S(k) of X as S(k) = i=0 τYi ei , where\n\nthe ei are standard i.i.d. exponential random variables. Thus, the increments of S(k) are the\ndepths of the traps (τx )x∈G as sampled by Yk . In the model in dimensions higher than two, the\nembedded discrete time random walk Yk is transient (the case d = 2 is more delicate). Thus Yk\n\nwill sample each trap τx a finite number of times. That implies that S(k) does not have long range\ninteractions with its past and its scaling limit will be a Markovian process, which is an α-stable\nsubordinator. On the other hand, in the one-dimensional symmetric B.T.M., we have that the\nembedded discrete time random walk Yk is recurrent. Thus Yk will sample each trap τx an infinite\nnumber of times. In this case, S(k) has long range interactions with its past and its scaling limit\nwill be non-Markovian. Furthermore, the clock process S(k) will converge to the local time of a\nBrownian motion integrated against the random measure ρ. Here ρ plays the role of a scaling limit\nfor the environment (τx )x∈Z .\nIt is natural to ask if we can find intermediate behaviors between the transient case (d ≥ 1)\nand the recurrent case (d = 1): if we introduce a drift to the one-dimensional B.T.M., note that\nthe embedded discrete random walk becomes transient. Thus, intermediate behaviors between the\ntransient and the recurrent case might appear when one analyzes a sequence of one-dimensional\nB.T.M.'s with a drift that decreases to 0 as we rescale the walks. In this paper we study this\nquestion, showing that the speed of decay of the drift sets the long-term behavior of the model and\nexhibiting a sharp phase transition in terms of the type of limiting processes obtained. We next\ndescribe with more precision the way in which we define the B.T.M. with drift and the results that\nare obtained in this paper.\n\n\fBOUCHAUD WALKS WITH VARIABLE DRIFT\n\n3\n\nFor each ǫ > 0, denote by X ǫ the B.T.M. on Z where the transition probabilities of the embedded\ndiscrete time random walk are\n\n1+ǫ\n2\n\nto the right and\n\n1−ǫ\n2\n\nto the left. We will call this process\n\nthe B.T.M. with drift ǫ. For a ≥ 0, consider a rescaled sequence of B.T.M's with drift n−a ,\n−a\n\n(ha (n)X n\n\n(tn); t ≥ 0), indexed by n, where ha (n) is an appropriate space scaling depending on\n\na. We will see that as the drift decays slowly (small a), the sequence of walks converges to the\ninverse of an α-stable subordinator, whereas if the drift decays fast (large a) the limiting process\nis the F.I.N. diffusion. As these two posibilities are qualitatively different, we are led to think that\nthere is either, a gradual interpolation between these two behaviors as the speed of decay changes,\nor a sharp transition between them as the speed of decay changes. We establish that there is a\nsharp transition between the two scaling limits, that there is a critical speed of decay where a\nnew, previously, process appears and that the transition happens at a = α/(α + 1). As the main\ntheorem of this paper, we prove that, depending on the value of a, there are three different scaling\nlimits:\n• Supercritical case (a < α/(α + 1)). The sequence of walks converges to the inverse of\nan α-stable subordinator.\n\n• Critical case (a = α/(α + 1)). The sequence of walks converges to a process which is a\nspeed measure change of a Brownian motion with drift that we will call the drifted F.I.N.\ndiffusion.\n• Subcritical case (a > α/(α+1)). The sequence of walks converges to the F.I.N. diffusion.\nThe case a = 0 (contained in the supercritical case), which corresponds to a constant drift, was\nalready addressed by Zindy in [15].\nLet us now make a few remarks concerning the proof of our main theorem. The strategy of\nthe proof for the supercritical case is a generalization of the method used in [15] and relies on the\nanalysis of the sequence of processes of first hitting times (Hbn (x); x ∈ [0, nS]) (S is fixed, b > 0)\ndefined as\n\n−b\n\nHbn (x) := inf{t : X n (t) ≥ x}.\n\n(2)\n\nWe show that these processes (properly rescaled) converge to an α-stable subordinator. From that,\nit follows that the maximum of the walks converges to the inverse of an α-stable subordinator.\nThis part of the proof requires some care, because, as we are working with a sequence of walks\nwith variable drift, we cannot apply directly the methods used in [15]. It turns out that we have to\nchoose b properly to obtain a sequence of walks with the desired drift as we invert the hitting time\nprocesses. Then, it is easy to pass from the maximum of the walk to the walk itself. In [11] The\nproof corresponding to the critical case follows the arguments used by [11]. There they express\n\n\fBOUCHAUD WALKS WITH VARIABLE DRIFT\n\n4\n\nrescaled, symmetric one-dimensional B.T.M.'s as speed measure changes of a Brownian motion\ntrough a random speed measure. But here we are working with asymmetric walks, so we cannot\nwork with the expression used there. To treat the asymmetry of the walks, we use a Brownian\n−α/(α+1)\n\nmotion with drift instead of a Brownian motion. That is, we express each walk X n\n\nas a\n\nspeed measure change of a Brownian motion with drift, and then prove convergence of the sequence\nof speed measures to ρ. The latter is achieved by means of a coupling of the environments. In the\nsubcritical case, although we obtain the same scaling limit as in [11] (a F.I.N. diffusion), again,\nbecause of the asymmetry of the model, we cannot work with the expression used there. We deal\nwith this obstacle using, besides a random speed measure, a scaling function. That is, we express\nthe rescaled walks as time-scale changes of a Brownian motion. Then we prove that the scale\nchange can be neglected and show convergence of the sequence of speed measures to the random\nmeasure ρ.\nThe organization of the paper is as follows. In section 2 we give the definition of the model and\nstate our main results. There we also give simple heuristic arguments to understand the transition\nat a = α/(α + 1). In section 3 we obtain the behavior for the supercritical case, and in section 4\nwe obtain the scaling limit for the critical case. The behavior for the subcritical case is obtained\nin section 5.\nFinally, we would like to mention that while preparing the final version of this article we have\nlearned that Theorem (2.1) has been independently obtained by Gantert, Mörters and Wachtel\n[12]. There, they also obtain aging results for the B.T.M. with vanishing drift.\nAcknowledgements: The author was supported by a fellowship of the National Commission\non Science and Technology of Chile (Conicyt)#29100243. This paper contains material presented\nat the probability seminar at the P.U.C. of Chile in September 2009.\n\n2. Notations and Main Results\nA Bouchaud trap model on Z with drift ǫ, (X ǫ (t); t ∈ [0, ∞]) is a homogeneous Markov process\n\nwith jump rates:\n\nc(x, y) :=\n\n\u001a\n\n(1 + ǫ)τx−1 /2 if y = x + 1\n,\n(1 − ǫ)τx−1 /2 if y = x − 1\n\n(3)\n\nwhere τ = (τx )x∈Z are positive, i.i.d. under a measure P and satisfy\nlim uα P [τx ≥ u] = 1.\n\nu→∞\n\n(4)\n\n\fBOUCHAUD WALKS WITH VARIABLE DRIFT\n\n5\n\nFor any topological space E, B(E) will stand for the σ-algebra of Borelians of E. Pxτ and Exτ\nwill denote the probability and expectation conditioned on the environment τ = (τx )x∈Z and with\nX ǫ (0) = x. These probabilities are often referred as quenched probabilities. We define Px on\nR\nZ\nZ\nZN × R+ stating that for every A ∈ B(ZN ) and B ∈ B(R+ ), Px [A × B] := B Pxτ [Cτ ]P (dτ ), where\n\nCτ := {x ∈ ZN : (x, τ ) ∈ A × B}.\n\nPx is called the annealed probability. Note that X ǫ is Markovian w.r.t. Pxτ but non-Markovian\n\nw.r.t. Px . Ex is the expectation associated to Px . P0 and E0 will be simply denoted as P and E.\nAlso Pτ and Eτ will stand for P0τ and E0τ respectively. These notations will be used with the same\nmeaning for all the processes appearing in this paper.\nWe have to make some definitions in order to state our main result: let B(t) be a standard one\ndimensional Brownian motion starting at zero and l(t, x) be a bi-continuous version of his local\ntime. Given any locally finite measure μ on R, denote\nZ\nl(s, y)μ(dy),\nφμ (s) :=\nR\n\nand its right continuous generalized inverse by\n\nψμ (t) := inf {s > 0 : φμ (s) > t}.\nThe right continuous generalized inverse exists by definition, is increasing and, as its name\nindicates, it is a right continuous function. Then we define the speed measure change of B with\nspeed measure μ, X(μ)(t) as\nX(μ)(t) := B(ψμ (t)).\n\n(5)\n\nWe also need to define speed measure changes of a drifted Brownian motion. Let C(t) := B(t)+t.\nWe know that C(t) has a bi-continuous local time  ̃l(t, y). Given any locally finite measure μ in R\nwe define\nφ̃μ (s) :=\n\nZ\n\nl̃(s, y)μ(dy),\n\nR\n\nand its generalized right-continuous inverse by\n\nψ̃μ (t) := inf{s > 0 : φ̃μ (s) > t}.\nThen we define X̃(μ)(t) (the speed measure change of C with speed measure μ) by\nX̃(μ)(t) := C(ψ̃μ (t)).\n\n(6)\n\nBy changing the starting point of our underlying Brownian motion B, we can change the starting\npoint of X̃(μ) and X(μ).\nLet (xi , vi ) be an inhomogeneous Poisson point process on R × R+ , independent of B with\n\nintensity measure αv −1−α dxdv. We define the random measure ρ as\nX\nρ :=\nvi δxi .\n\n(7)\n\n\fBOUCHAUD WALKS WITH VARIABLE DRIFT\n\n6\n\nThe diffusion (Z(t); t ∈ [0, T ]) defined as Z(s) := B(ψρ (s)) is called the F.I.N diffusion. We\nalso define the drifted F.I.N. diffusion Z̃(t) as Z̃(t) := C(ψ̃ρ (t)).\nD[0, T ] will denote the space of cadlag functions from [0, T ] to R. (D[0, T ], M1 ), (D[0, T ], J1 )\nand (D[0, T ], U ) will stand for D[0, T ] equipped with the Skorohod-M1, Skorohod-J1, and uniform\ntopology respectively. We refer to [14] for an account on these topologies. We define (X (n,a) ; t ∈\n\n[0, T ]), a rescaling of a walk with drift n−a , by\n\nn−a\n(tn)\n\n X α(1−a)\nif a <\n\nn\n(n,a)\nX\n(t) :=\n\n−a\n\n X n (tn) if a ≥\nnα/(α+1)\n\nα\n1+α\n\n.\n\n(8)\n\nα\n1+α\n\nLet Vα be an α-stable subordinator started at zero. That is, Vα is the increasing Levy process\n\nwith Laplace transform E[exp(−λVα (t))] = exp(−tλα ). Now we are in conditions to state the main\nresult of this paper.\nTheorem 2.1. For all T > 0:\n(i) If a < α/(α+ 1) we have that (X (n,a) (t); t ∈ [0, T ]) converges in distribution to (Vα−1 (t); t ∈\n(0, T )) in (D[0, T ], U ) where Vα−1 is the right continuous generalized inverse of Vα .\n\n(ii) If a = α/(α + 1) we have that (X (n,a) (t); t ∈ [0, T ]) converges in distribution to the drifted\nF.I.N. diffusion (Z̃(t); t ∈ [0, T ]) on (D[0, T ], U ).\n\n(iii) If a > α/(α + 1) we have that (X (n,a) (t); t ∈ [0; T ]) converges in distribution to the F.I.N.\ndiffusion (Z(t); t ∈ [0, t]) on (D[0, T ], U ).\nWe present heuristic arguments to understand the transition at a =\n\nα\n1+α .\n\nFirst we analyze a\n\nǫ\n\nsequence of discrete time random walks. Let (S (i), i ∈ N) be a simple asymmetric random walk\nPi\nwith drift ǫ, S ǫ (i) := k=1 bǫk , where (bǫk )i∈N is an i.i.d. sequence of random variables with: P[bǫk =\n1] =\n\n1+ǫ\n2 ;\n\nP[bǫk = −1] =\n\n1−ǫ\n2 .\n\nWe want to find the possible scaling limits of (S ǫ(n) (in); i ∈ [0, T ]),\n\ndepending on the speed of decay of ǫ(n) to 0 as n → ∞.\n\nWe couple the sequence of walks S ǫ(n) in the following way: Let (Ui )i∈N be an i.i.d. sequence\n\nof uniformly distributed random variables taking values on [0, 1]. We require that S ǫ(n) takes\nǫ(n)\n\nhis i-th step to the right (bi\n\n= 1) if Ui >\n\n1−ǫ(n)\n2\n\nand to the left otherwise. For each walk,\n\nwe can decompose the steps into two groups: the first group is given by the steps i such that\n1−ǫ(n)\n2\n\n< Ui <\n\n1+ǫ(n)\n2\n\nand the second group consists of the remaining steps. We can think that\n\nthe first group of steps takes account of the drift effect and the second one takes account of the\nsymmetric fluctuations of the walk.\nIf the walk has given n steps, then the first group has about nǫ(n) steps, and the second group\n√\nhas fluctuations of order n. It is obvious that the drift effect will dominate the behavior if\n\n\fBOUCHAUD WALKS WITH VARIABLE DRIFT\n\n7\n\n√\nn = o(ǫ(n)). In this case we will have a ballistic (deterministic) process as a scaling limit. If\n√\nǫ(n) = o( n) the fluctuations will dominate and we will have a Brownian motion as scaling limit.\n√\nFinally the two behaviors will be of the same order if ǫ(n) ≈ n, and a Brownian motion with\ndrift will be the scaling limit.\n\nThe same reasoning can now be used to understand the change of behavior at a = α/(α + 1)\n−a\n\nfor the sequence of walks (X n\n\n(tn), t ∈ [0, T ])n∈N . In order to apply the precedent arguments we\n−a\n\nfirst have to estimate the number of steps that X n\n−a\n\ntake T = 1. First, suppose that X n\n\nhas given up to time T n. To simplify we\n\n(n) is of order nu , where u is to be found. We know that\n\nafter k steps, a walk with drift n−a is approximately on site kn−a , so, it takes about nu+a steps\n−a\n\nto be on site nu . Thus, we can also deduce that at time n, X n\n\nhas visited approximately na\nP u\ntimes each site. As the distribution of τi satisfies (4), then the sum ni=0 τi is of the same order\nthat max{0≤i≤nu } τi , and both are of order nu/α . We can estimate the time needed to arrive at nu\n\nas the depth of the deepest trap found (≈ nu/α ) multiplied by the number of visits to that trap\n−a\n\nu\n\n(≈ na ). This gives that n ≈ n α +a . But, we know, by definition, that X n\n\narrives at the site nn/u\n\napproximately at time n. It follows that 1 = (u/α) + a, which yields u = (1 − a)α. This means\n−a\n\nthat the number of steps that X n\n\nhas given up to time n is of order n(1−a)α+a .\n−a\n\nAgain, we can decompose the steps of X n\n\ninto two groups. The first group accounts for the\n\ndrift effect, and the second one accounts for the fluctuations. The first group will have approximately n−a+[(1−a)α+a] steps and the second group will give a contribution to the position of order\nn\n\n(1−a)α+a\n2\n\n. Now it is easy to see that the ballistic behavior and the fluctuations will be of the same\n\norder i.f.f. [(1 − a)α + a]/2 = (1 − a)α or a = α/(1 + α).\n3. The Supercritical Regime\nThe proof for the constant drift case (a = 0) in [15] is roughly as follows: first he prove that the\nsequence of rescaled first hitting times, (n−1/α inf{s ≥ 0 : X ǫ (ns) ≥ x} : x ≥ 0), converges to an αstable subordinator. Then, using that the right continuous generalized inverse of the process of first\nhitting times is the maximum of X ǫ (t), he can deduce that (max{n−1 X ǫ (n1/α s) : s ≤ t} : t ≥ 0)\nconverges to the inverse of an α-stable subordinator. Finally he shows that the walk and its\nmaximum are close.\nFor the proof of part (i) of theorem 2.1 we cannot follow the proof of [15] in a straightforward way: suppose we show that a properly rescaled sequence of first hitting time processes\n(pa (n)Han (nx) : x ∈ R+ ) (where pa (n) is an appropriate scaling) converges to an α-stable subor−a\n\ndinator. Then, by inverting the processes, we get that the sequence (max{n−1 X n\n\n(pa (n)−1 s) :\n\ns ≤ t} : t ∈ R+ ) converges to the inverse of an α-stable subordinator. But we are searching a\n\n\fBOUCHAUD WALKS WITH VARIABLE DRIFT\n−a\n\nlimit for (max{da (n)X n\n\n8\n\n(tn) : t ∈ R+ }) (where da (n) is appropriate space scaling). That is,\n\nwe want to obtain the limit of a sequence of rescaled walks where the drift decays as n−a when\nthe time is rescaled by n. But when we invert (pa (n)Han (nx) : x ∈ R+ ), we obtain the sequence\n−a\n\n(max{n−1 X n\n\n(pa (n)−1 s) : s ≤ t} : t ≥ 0), which is a sequence of maximums of rescaled walks in\n\nwhich the drift decays as n−a when the time is rescaled as pa (n)−1 .\n\nTo solve this, we will prove that the limit of (qa (n)Hbn∗ (nx) : x ∈ R+ ) is an α-stable subordinator,\n\nwhere qa (n) is an appropriate scaling and b∗ sets an appropriate drift decay and depends on a.\n−b∗\n\nInverting, we will obtain that (max{n−1 X n\n\n(qa (n)−1 s) : s ≤ t} : t ≥ 0) converges to an α-stable\n\nsubordinator. As we have said, we want the limit of a sequence of rescaled walks with a drift that\ndecays as n−a as the time parameter is rescaled by n. Hence, when the time parameter is rescaled\n∗\n\nas qa (n)−1 , the drift should rescale as qa (n)a . Thus we need to choose b∗ so that n−b = qa (n)a .\nBut we know that qa (n) is the appropriate scaling for (Hbn∗ (nx) : x ∈ R+ ). Hence, qa (n) must be\n−b∗\n\nthe order of magnitude of Hbn∗ (n). That is qa (n) is of the order of the time that the walk X n\nneeds to reach n.\n−b∗\n\nWe now give a heuristic argument to find qa (n) and b∗ . When X n\nit has an order kn\n\n−b∗\n\n. So it takes about n\n\nb∗ +1\n\n(t) has given k steps,\n\nsteps to be on site n. We can think that the\n∗\n\nnumber of visits to each site x is evenly distributed. Then each site is visited about nb times\n−b∗\n\nbefore X n\n\nhits n. The time that the walks needs to reach n is of the order of the time spent\n\nin the largest trap. Thus we can estimate the total time spent by the walk as the depth of the\ndeepest trap (which is of order n−1/α ) multiplied by the number of visits to that trap. This gives\n−b∗\n\n∗\n\na time of order n1/α+b . What the previous arguments show is that X n\nt≈n\n\n1/α+b∗\n\n(qa (n) ≈ n\n\n1/α+b∗\n\n(t) arrives at n at time\n∗\n\n). But at that time we want to analyze a walk of drift (n1/α+b )−a .\n\nThat is, we need that a(1/α + b∗ ) = b∗ . In this way we find that b∗ := a/[(1 − a)α].\n3.1. The embedded discrete time walk. For each natural n, the clock processes S n is defined\n−b∗\n\nas S n (0) := 0. Furthermore S n (k) is the time of the k-th jump of X n\n\n. S n is extended to\n\nb∗\n\nall R+ by setting S n (s) := S n (⌊s⌋). To each drifted walk X n (t) we associate its corresponding\n−b∗\n\nembedded discrete time random walk (Yin\nS n (i) ≤ t < S n (i + 1).\n−b∗\n\nObviously Yin\n\n−b∗\n\n: i ∈ N) defined as Yin\n\n−b∗\n\n:= X n\n\n(t) where t satisfies:\n\n∗\n\nis a discrete time random walk with drift n−b . We can write\nS(k) =\n\nk−1\nX\n\nτYi ei ,\n\ni=0\n\nwhere (ei )i≥0 is an i.i.d. sequence of exponentially distributed random variables with mean 1.\nDefine\n∗\n\nǫ = ǫ(n) := n−b\n\n\fBOUCHAUD WALKS WITH VARIABLE DRIFT\n\n9\n\np = p(n) := (1 + ǫ(n))/2\nq = q(n) := (1 − ǫ(n))/2 and\n∗\n\nν(n) := ⌊c log(n)nb ⌋ with c > 2.\n\nǫ(n)\n\nLet Ξ(x, k) = Ξ(x, k, n) be the probability that Yi\n\nhits x before k starting at x + 1. Then\n\nwe have that Ξ(x, k) = q + pΞ(x + 1, k)Ξ(x, k) and that Ξ(k − 2, k) = q. These observations give a\ndifference equation and an initial condition to compute Ξ(x, k). Then we get that\nΞ(x, k) = r\n\n1 − rk−x−1\n,\n1 − rk−x\n\n(9)\n\nwhere r = r(n) := q(n)/p(n). Using that formula we can see that the probability that the walk\nǫ(n)\n\nYi\n\never hits x − 1 starting at x is r. We now present a backtracking estimate.\nǫ(n)\n\nǫ(n)\n\n− Yi\n\nLemma 3.1. Let A(n) := {mini≤j≤ζn (n) (Yj\n\nǫ(n)\nYk\n\n) ≥ −ν(n)} where ζn (i) := min{k ≥ 0 :\n\n= i}, then limn→∞ P[A(n)] = 1.\n\nProof: We can write\nc\n\nA (n) =\nHence\n\nn−1\n[\u001a\nx=0\n\nc\n\nA (n) ⊆\n\nmin\n\nζn (x)≤i≤ζn (n)\n\nn−1\n[\u001a\nx=0\n\nǫ(n)\n(Yi\n\nǫ(n)\nmin (Yi\nζn (x)≤i\n\n−\n\n−\n\nǫ(n)\nYζn (x) )\n\nǫ(n)\nYζn (x) )\n\n\u001b\n< −ν(n) .\n\n\u001b\n< −ν(n) .\n\nBut, in order to arrive from x to x − ν(n), for each j = x − 1, . . . , x − ν(n), starting from\nǫ(n)\n\nj + 1 the random walk Yi\n\nneeds to hit j in a finite time. Hence, it takes ν(n) realizations\n\nof independent events (strong Markov property) of probability r(n). In other words P[Ac (n)] ≤\n2\n)ν(n) ,\n1+nb∗\nc log(n)\n\nnr(n)ν(n) = n(1 −\nb∗\n\nn((1 − n1b∗ )n\n\u0001nb∗\n1 − n1b∗\n\n)\n\n≤e\n\n− 12\n\nwhich can be bounded by n(1 −\n\n. We can see that (1 −\n\nb∗\n\n1 n\n)\nnb∗\n\n→e\n\n−1\n\n1 ν(n)\n)\n.\nnb∗\n\nReplacing ν(n) we obtain\n\nwhen n → ∞. Now, for n big enough\n\n. Then\n1\n\nP[Ac (n)] ≤ nn− 2 c .\n\nBut c > 2, so we get the result.\n\u0003\nNow we state the convergence result for the hitting time processes.\nLemma 3.2. Let\nHbn∗ (tn)\n.\n(10)\nn(1/α)+b∗\nπα\nThen (H (n) (t); t ∈ [0, T ]) converges weakly to (( sin(πα)\n)−1/α Vα (t); t ∈ [0, T ]) on (D[0, T ], M1 ),\nH (n) (t) :=\n\nwhere Vα (t) is an α-stable subordinator.\n\n\fBOUCHAUD WALKS WITH VARIABLE DRIFT\n\n10\n\nThe proof of this lemma will be given in subsection 3.5. We present the proof of part (i) of\nTheorem 2.1 using lemma 3.2 and devote the rest of the section to the proof of lemma 3.2.\n3.2. Proof of (i) of Theorem 2.1. Let us denote\n−b∗\n\nX̄ n (t) := n−1 max{X n\n\n∗\n\n(sn(1/α)+b ); s ∈ [0, t]}.\n\nFirst we will prove convergence in distribution of X̄ n to the (right continuous generalized)\nπα\ninverse of ( sin(πα)\n)−1/α Vα in the uniform topology. That is, we want to to prove convergence in\nπα\ndistribution of the inverse of (H (n) (t); t ∈ [0, T ]) to the inverse of (( sin(πα)\n)−1/α Vα (t); t ∈ [0, T ]) in\n\nthe uniform topology. Define\n∗\n\nC(T, S)n := {H (n) (S) ≥ T n(1/α)+b }.\nThen, we have that, on C(T, S)n , the right continuous generalized inverse of (H (n) (s); s ∈\n\n[0, S]) is (X̄ n (t); t ∈ [0, T ]). Let T > 0 be fixed, by Lemma 3.2, we know that we can choose S\n\nbig enough so that limn→∞ P[C(T, S)n ] is as close to 1 as we want. Let D↑ [0, T ] be the subset\n\nof D[0, T ] consisting of the increasing functions. By corollary 13.6.4 of [14], the inversion map\nfrom (D↑ [0, T ], M1 ) to (D↑ [0, T ], U ) is continuous at strictly increasing functions. Lemma (3.2)\nπα\n)−1/α Vα (t); t ∈ [0, S]) in the\ngives convergence in distribution of (H (n) (t); t ∈ [0, S]) to (( sin(πα)\n\nπα\nSkorohod M1 topology. We know that Vα is a. s. strictly increasing, that is (( sin(πα)\n)−1/α Vα (t); t ∈\n\n[0, S]) ∈ D↑ [0, T ] almost surely. So we can apply corollary 13.6.4 of [14] and deduce convergence\nπα\n)−1/α Vα in the uniform topology. As we have\nin distribution of X̄ n to the inverse of ( sin(πα)\n\nsaid previously, the inverse of (H (n) (s); s ∈ [0, S]) is (X̄ n (t); t ∈ [0, T ]) in C(T, S)n . This proves\nconvergence of the maximum of the walk. To deduce convergence of the walk itself it suffices to\nshow that the walk is close enough to its maximum in the uniform topology. That is, to prove the\ntheorem, it is enough to show that for all γ > 0:\n\u0014\n\u0015\n−b∗\n∗\nP sup |n−1 X n (tn(1/α)+b ) − X̄ n (t)| ≥ γ → 0.\n0≤t≤T\n\n∗\n\nAgain, by Lemma 3.2 we know that P[Hbn∗ (n log(n)) ≥ T n(1/α)+b ] → 1. Hence, we just have to\n\nprove that\n\nP\n\n\"\n\nsup\n\n0≤t≤Hbn∗ (n log(n))\n\n|n\n\n−1\n\n∗\n\nX\n\nn−b\n\n(t) − n\n\n−1\n\n#\n\n∗\n\nmax{X\n\nn−b\n\n(s); s ∈ [0, t]}| ≥ γ → 0.\n\nWhich is to say,\nP\n\n\"\n\nsup\n\n0≤k≤ζn (⌊n log(n)⌋)\n\nǫ(n)\n|Yk\n\n−\n\nǫ(n)\nȲk |\n\n#\n\n≥ nγ → 0.\n\nwhere Ȳ ǫ(n) is the maximum of Y ǫ(n) . But, we can apply Lemma 3.1 to see that this is the case.\n\n\fBOUCHAUD WALKS WITH VARIABLE DRIFT\n\n11\n\n3.3. The environment. Here we give estimates concerning the environment. For each n ∈ N\ndefine\ng(n) :=\n\nn1/α\n2\n\n(log(n)) 1−α\n\n.\n\nNow, for each site x ∈ N, we say that x is an n-deep trap if τx ≥ g(n). Otherwise we will say\n\nthat x is an n-shallow trap. We now order the set of n-deep traps according to their position from\nleft to right. Then call δ1 (n) the leftmost n-deep trap and in general call for j ≥ 1, δj (n) the j-th\nn-deep trap. The number of n-deep traps in [0, n] is denoted by θ(n). Let us now define\n\u001a\n\u0012\n\u0013\n\u0012\n\u0013\u001b\n1\n1\nE1 (n) := nφ(n) 1 −\n≤ θn ≤ nφ(n) 1 +\n,\nlog(n)\nlog(n)\nE2 (n) := {δ1 ∧ (\n\nmin\n\n(δj − δj−1 )) ≤ ρ(n)},\n\n1≤j≤θn −1\n\nE3 (n) := {\n\nmax\n\n−ν(n)≤x≤0\n\nτx < g(n)}, and\n\nE(n) := E1 (n) ∩ E2 (n) ∩ E3 (n)\nwhere ρ(n) := nκ\n\nκ < 1 and φ(n) := P[τx ≥ g(n)].\n\nLemma 3.3. We have that limn→∞ P[E(n)] = 1.\nProof: θ(n) is binomial with parameters (n, φ(n)). E1 is estimated using the Markov inequality.\nTo control E2 it is enough to see that in 0, .., n there are O(nρ(n)) pairs of points at a distance less\nthan ρ(n). The estimate on E3 is trivial.\n\u0003\n3.4. Time control. In this subsection we prove results about the time spent by the walk on the\ntraps.\n3.4.1. Shallow traps. Here we will show that the time that the walks spend in the shallow traps is\nnegligible.\nLemma 3.4. Let I(n) :=\n\n\u001a\n\nPζn (n)\ni=0\n\nτY ǫ(n) ei 1{τ\ni\n\nǫ(n) ≤\nY\ni\n\ng(n)}\n\n≤\n\nn1/[(1−a)α]\nlog(n)\n\n\u001b\n. Then\n\nP[I(n)] → 1 as n → ∞.\n\n(11)\n\nProof: We have that P[I(n)c ] = P[I(n)c ∩ E(n)] + o(1). Using the Markov inequality it suffices\nto show that\n\n\nζn (n)\n\nE\n\nX\ni=0\n\nτY ǫ(n) ei 1{τ\ni\n\nǫ(n) <g(n)}\nY\ni\n\n1{Y ǫ(n) ≥−ν(n)}\ni\n\n\n\n=o\n\n\u0012\n\nn1/[(1−a)α]\nlog(n)\n\n\u0013\n\n.\n\n\fBOUCHAUD WALKS WITH VARIABLE DRIFT\nǫ(n)\n\nThe number of visits of Yi\n\n12\n\nto x before time ζn (n) is 1 + G(x, n), where G(x, n) is a geometri-\n\ncally distributed random variable of parameter 1 − (q + pΞ(x, n)) (the parameter is the probability\nǫ(n)\n\n, starting at x, hits n before returning to x). Also\n\nζn (n)\nn\nX\nX\nτx (1 + Eτ [G(x, n)])1{τx <g(n)} .\nτY ǫ(n) ei 1{τ ǫ(n) <g(n)} 1{Y ǫ(n) ≥−ν(n)}  ≤\nEτ \n\nthat, Yi\n\n\ni=0\n\nY\ni\n\ni\n\ni\n\nUsing (9) we can deduce that (1 + E[G(x, n)]) ≤\nto the environment in (12) we get\n\nζn (n)\nX\nτ ǫ(n) ei 1{τ\nE\ni=0\n\nYi\n\n(12)\n\nx=−ν(n)\n\nǫ(n) <g(n)}\nY\ni\n\nAlso\n\n∗\n\n≤ cn−b . So, averaging with respect\n\n\n\n∗\n\n1{Y ǫ(n) ≥−ν(n)}  ≤ Cn1+b E[τ0 1{τ0 <g(n)} ].\n\n∞\nX\n\nE[τ0 1{τ0 <g(n)} ] ≤\n\n(1−r(n))\np\n\ni\n\n(1/2)j g(n)P[τ0 > (1/2)j+1 g(n)].\n\nj=0\n\nNow, using (1) there exists a constant C such that the righthand side of the above inequality is\nbounded above by\nCg(n)1−α\n\n∞\nX\n\n((1/2)1−α )j .\n\nj=0\n\nFurthermore, since 1 − α > 0 this expression is bounded above by Cg(n)1−α . This finishes the\nproof.\n\u0003\n3.4.2. Deep traps. Here we will estimate the time spent in deep traps. We define the occupation\ntime for x ∈ Z as\n\nζn (n)\n\nTx = Tx (n) :=\n\nX\n\nτY ǫ(n) ei 1{Y ǫ(n) =x} .\n\ni=0\n\ni\n\ni\n\nThe walk visits x, G(x, n)+1 times before ζn (n), and each visit lasts an exponentially distributed\ntime. This allows us to control the Laplace transform of Tx . For any pair of sequences of real\nnumbers (an )n∈N , (bn )n∈N , an ∼ bn will mean that limn→∞\nLemma 3.5. Let λ > 0. Define λn :=\n\nλ\n.\nn1/[(1−a)α]\n\nan\nbn\n\n= 1.\n\nThen we have that\n\nEx [1 − exp(−λn Tx )|τx ≥ g(n)] ∼\n\nP[τx ≥ g(n)]−1 απλ−α\n.\nn sin(απ)\n\nProof: We must perform an auxiliary computation about the asymptotic behavior of the\nparameter 1 − (q + pΞ(x, n)) of G(x, n):\n∗\n\n(1 − (q + pΞ(x, n)))nb = p\n\n1−r\n1 − rn−x\n\n\fBOUCHAUD WALKS WITH VARIABLE DRIFT\n\n13\n\n∗\n\n=\n\n2p(1 + n−b )n−x\n∗\n−b\n(1 + n )((1 + n−b∗ )n−x − (1 − n−b∗ )n−x )\n=\n\n2p\n(1 +\n\nn−b∗ )(1\n\n− (1 −\n\n2n−b∗ n−x\n)\n)\n1+n−b∗\n\nwhich converges to 1. Thus we have showed that\n∗\n\n(1 − (q + pΞ(x, n)))nb\n\nn→∞\n\n→ 1\n\n(13)\n\nWe have\n\n\n\n\n\n\nG(x,n)\n\nExτ [exp(−λn Tx )] = Exτ exp −λn\n\nX\ni=0\n\nτx ẽi \n\nwhere ẽi are i.i.d. end exponentially distributed with E(ẽi ) = 1. Let λ̃n :=\nExτ [exp(−λn Tx )] =\n\n1\nτx\n1 + λ̃n nb∗ (1−(q+pΞ(x,n)))\n\nλ\n.\nn1/α\n\nThen\n\n.\n\nUsing (13) we get that the above expression equals\n=\n\n1\n1 + λ̃n τx (1 + o(1))\n\n=\n\n1\n1 + λ̃n τx\n\n+ o(n−1/α ).\n\nAveraging with respect to the environment\nx\n\nE [1 − exp(−λn Tx )1{τx ≥g(n)} ] =\n\nZ\n\n∞\n\ng(n)\n\n1−\n\n1\nτ0 (dz) + o(n−1/α )\n1 + λ̃n z\n\nwhere the notation τ0 (dz) denotes integration with respect the distribution of τ0 . Integrating by\nR∞\nparts g(n) 1 − 1+1λ̃ z τ0 (dz) we get that the above display equals\nn\n\n\"\n\nλ̃n z\n−\nP[τ0 ≥ z]\n1 + λ ̃n\n\n#∞\n\n+\n\nZ\n\n∞\n\ng(n)\n\ng(n)\n\nλ̃n\n\n(1 + λ̃n z)2\n\nP[τ0 ≥ z]dz + o(n−1/α ).\n\nThe first term is smaller than C λ̃n g(n)1−α = o(n−1 ). To estimate the second term, note that\nfor all η > 0 we have\n(1 − η)z −α ≤ P[τ0 ≥ z] ≤ (1 + η)z −α\nfor z large enough. Then we must compute\nwe obtain\nλ̃n−α\n\nZ\n\nR∞\n\nλ̃n\nz −α dz.\ng(n) (1+λ̃n z)2\n\nChanging variables with y =\n\nλ̃n z\n1+λ̃n z\n\n1\nλ̃n g(n)\n1+λ̃n g(n)\n\ny −α (1 − y)α dy.\n\nBut we know that this integral converges to Γ(α + 1)Γ(α − 1) =\n\nπα\nsin(πα) .\n\n\u0003\n\n\fBOUCHAUD WALKS WITH VARIABLE DRIFT\n\n14\n\n3.5. Proof of Lemma 3.2. We will show the convergence of the finite dimensional Laplace transforms of the rescaled hitting times to the corresponding expression for an α-stable subordinator.\nThis will prove finite dimensional convergence.\nLet 0 = u0 < * * * < uK ≤ T and βi , i = 1..K be positive numbers. We know that\n#\n!\n\"\nK\nK\n−α\nX\nX\nαπβK\nπα\nπα\n−1/α\n−1/α\n−\n)\nVα (ui ) − (\n)\nVα (ui−1 )) = exp\n(uK − uK−1 ) .\n−βi ((\nE exp\nsin(πα)\nsin(πα)\nsin(απ)\ni=1\ni=1\nSo, it only suffices to show that\n#\n\"\n!\nK\nK\n−α\nX\nX\nαπβK\nn→∞\n(n)\n(n)\n−\n−βi (H (ui ) − H (ui−1 )) → exp\nE exp\n(uK − uK−1 )\nsin(απ)\ni=1\ni=1\nwhere H (n) is as in (10). We can decompose the trajectory of Y ǫ(n) up to ζn (⌊nuK ⌋) into three\nparts. The first one is the trajectory up to the time ζn (⌊nuK−1 − ν(T n)⌋), the second one is the\ntrajectory between times ζn (⌊nuK−1 − ν(T n)⌋) and ζn (⌊nuK−1 ⌋), finally, the third part is the\n\ntrajectory starting from time ζn (⌊nuK−1 ⌋) up to time ζn (⌊nuK ⌋). First we will show that the time\n\nspent in the second part of the trajectory is negligible. We have that P[maxy∈Bν(T n) (x) > g(T n)] =\no(1), which is to say that the probability of finding an n-deep trap in a ball of radius ν(T n) is\nsmall. Indeed Lemma 3.4 implies that there exists a constant C > 0 such that\n\n\nζ⌊uK n⌋\nX\n1\n\u001b < Cn (1−a)α (log(n))−1  → 1.\nτY ǫ(n) ei 1\u001a\nP\ni=0\n\ni\n\nτ\n\nǫ(n) ∈Bν(T n) (⌊uK−1 n⌋)\nY\ni\n\nHence, the time that the walk spends in Bν(T n) (⌊uK−1 n⌋) is negligible. But in A(T n) the\n\nwalk never backtracks a distance larger than ν(T n), so, the time spent in the second part of\nthe decomposition is negligible. The fact that in A(T n) the walk never backtracks a distance\nlarger than ν(T n) also implies that, conditional on A(T n), the first and the third parts of the\ndecomposition of the trajectory corresponds to independent walks in independent environments.\nPK\nSo E[exp( i=1 −βi (H (n) (ui ) − H (n) (ui−1 )))] can be expressed as\n#\n\"\nK−1\nh\ni\nX\n(n)\n(n)\n−βi (H (ui ) − H (ui−1 )) E⌊nuK−1 ⌋ exp −βK (H (n) (ui ) − H (n) (ui−1 )) + o(1)\nE exp\ni=1\n\nwhere o(1) is taking account of the time spent in the second part of the decomposition of the\ntrajectory and of A(T n)c .\n\nThe strong Markov property of Y ǫ(n) applied at the stopping time ζn (⌊nuK−1 ⌋) and translational\n\ninvariance of the environment give that Hbn∗ (nui ) − Hbn∗ (nui−1 ) is distributed as Hbn∗ (nsn (K))\nwhere sn (K) =\n\n⌊uK n⌋−⌈uK−1 n⌉\n.\nn\n\nIterating this procedure K − 2 times we reduce the problem to\n\nthe computation of one-dimensional Laplace transforms. Hence, we have to prove that, for each\n\n\fBOUCHAUD WALKS WITH VARIABLE DRIFT\n\nk≤K\n\n\u0012\nE[exp(−βk n−(1/α)−a Hbn∗ (nsn (k)))] → exp −\n\n15\n\n\u0013\nπα\nβkα (uk − uk−1 ) .\nsin(πα)\n\nWe have that P[E(T n) ∩ A(T n)] → 1, then we can write\nE[exp(−βk n−(1/α)−a Hbn∗ (nsn (k)))] = E[exp(−βk n−(1/α)−a Hbn∗ (nsn (k)))1{E(T n)∪A(T n)} ] + o(1).\nWe know that the time spent in the shallow traps is negligible, so we only have to take into account\nthe deep traps. We also know that on A(T n), the walk does not backtrack more than ν(T n), and\nthat, on E(T n), the deep traps on [0, T n] are well separated. Then we can write\n\n\nθ(nsn (k))\nY\nEδτi [exp (−βk n−(1/α)−a Tδi )] + o(1).\nE[exp(−βk n−(1/α)−a Hbn∗ (nsn (k)))] = E \nj=1\n\nAlso, in E(T n) we have upper and lower bounds for θ(T n). Using the upper bound we see that\n\nthe righthand side of the above equality is bounded above by\nns (k)φ(ns (k))(1−\n\n1\n)\nn\nn\nY log(nsn (k))\nE\nEδτi [exp (−βk n−(1/α)−a Tδi )] + o(1),\nj=1\n\nApplying again the translational invariance of the environment and the strong Markov property\n\nwe get that that the above display is equal to\n1\n\nE[Eδτi [exp (−βk n−(1/α)−a Tδi )]]nsn (k)φ(nsn (k))(1− log(nsn (k)) ) + o(1)\nwhich in turn can be expressed as\n1\n\nE[exp (−βk n−(1/α)−a T0 )|τ0 ≥ g(nsn (k))]nsn (k)φ(nsn (k))(1− log(nsn (k)) ) + o(1).\nn\n\nUsing lemma (3.5) and the fact that sn (k) → uk − uk−1 we obtain\n\u0012\n\u0013\nαπβk−α\n−(1/α)−a n\nlim sup E[exp(−βk n\nHb∗ (nsn (k)))] ≤ exp −\n(uk − uk−1 ) .\nsin(απ)\nThe lower bound can be obtained in an analogous fashion. For the tightness, the arguments are\nthe same as in Chapter 5 of [3]\n\n4. The Critical Case\nWe want to show that for a =\n\nα\nα+1\n\nthe sequence of walks (X (n,a) (t); t ∈ [0, ∞]) converges in\n\ndistribution to a drifted F.I.N. diffusion. We will mimic the arguments in [11]. But to treat the\nasymmetry of the model we will use a Brownian motion with drift instead of a Brownian motion.\nWe use the existence of a bi-continuous version of the local time for a Brownian motion with drift.\n\n\fBOUCHAUD WALKS WITH VARIABLE DRIFT\n\n16\n\n4.1. The construction of the walks. Recall the definition of X̃(μ) given in display (6). Let s\nbe a real number and define\nμ :=\n\nX\n\nvi δsi .\n\ni∈(Z)\n\nThen X̃(μ) is a homogeneus Markov process with sZ as its state space. The transition probabilities and jump rates of X̃(μ) can be computed from the positions and weights of the atoms\nusing the generator L of C(t)\n1 d2 f\ndf\n+\n.\n(14)\n2 dx2\ndx\nThe arguments we will give below are an adaptation of the reasoning used by Stone in [13]. For\nLf :=\n\neach i let ηsi be the time of the first jump of X̃(μ) started at si. By construction we will have that\nηsi = vi l̃(σs , 0), where σs is the hitting time of (−s, s) by C(t). Using the strong Markov property\nfor C(t) we can deduce that ηsi is exponentially distributed. It is easy to see that its mean is\nvi E[l̃(σs , 0)]. Denote by pt (x) the density at site x of the distribution of C(t) absorbed at {−s, s}.\nUsing that l̃(σs , 0) := ǫ−1 limǫ→0 m(t ∈ [0, σs ] : C(t) ∈ [−ǫ, ǫ]) and applying Fubini's Theorem we\nRσ\nfind that E[l̃(σs , 0)] = ǫ−1 limǫ→0 0 s P[C(t) ∈ [−ǫ, ǫ]]dt. Then we find that\nZ ∞\nE[l̃(σs , 0)] =\npt (0)dt.\n0\n\nWe also know that\n\nR∞\n0\n\npt (0)dt = f (0), where f is the Green function of (14) with Dirichlet\n\nconditions on {−s, s}. That is, f is the continuous function that satisfies\n1 d2 f\ndf\n+\n= −δ0 and f (s) = f (−s) = 0.\n2 dx2\ndx\n\nWe know that the general solution to\n\n2\n1d g\n2 dx2\n\n+\n\ndg\ndx\n\n= 0 is g = C1 exp(−2x) + C2 . This and the\n\nconstraints on f give that\nexp(−2s) + 1\n.\n(15)\n1 − exp(−2s)\nFor the computation of the respective transition probabilities we can use again the generator\nE[ηsi ] = vi−1\n\nL. Let g : [−s, s] → R be a continuous function such that\n\n2\n1d g\n2 dx2\n\n+\n\ndg\ndx\n\n= 0 and g(−s) = 0, g(s) = 1.\n\nUsing Itō's formula, we find that that g(C(t)) is a martingale. By the optional stopping theorem\nwith the stopping time σs we find that the probability that the walk takes his first step to the\nright is g(0). We can use the constraints on g to see that\nP[X̃(μ)(ηsi ) = s(i + 1)] =\n\nexp(2s)\n.\n1 + exp(2s)\n\n(16)\n\nThe proof of part (ii) of Theorem (2.1) will rely strongly on the following proposition.\nProposition 4.1. Let (νn )n∈N be a sequence of measures that converges vaguely to ν, a measure whose support is R. Then the corresponding processes (X̃(νn )(t), 0 ≤ t ≤ T ) converges to\n(X̃(ν)(t), 0 ≤ t ≤ T ) in distribution in (D[0, T ], U ).\n\n\fBOUCHAUD WALKS WITH VARIABLE DRIFT\n\n17\n\nFor the case where the underlying process is a Brownian motion, the proof of this fact can\n ̃ For each fixed t, l̃\nbe found in [13]. We will use the continuity properties for the local time l.\nis continuous and of compact support in x. Then, the vague convergence of νn to ν implies the\nalmost sure convergence of φ̃ν (t) to φ̃ν (t). As  ̃l is continuous in t, we obtain continuity of φ̃ν\nn\n\nn\n\nand of φ̃ν . That, plus the fact that the φ̃νn are non-decreasing implies that that φ̃νn converges\nuniformly to φ̃ν . The function φ̃ν is almost surely strictly increasing, because the support of ν is\nR. Now we can apply corollary 13.6.4 of [14] to obtain that ψ̃νn converges uniformly to ψ̃ν . That\nplus the continuity of the Brownian paths yields the lemma.\n4.2. The coupled walks. To prove part (ii) of Theorem 2.1, we will use Proposition 4.1. That\nis we want to show that each walk (X (n,a) (t); t ∈ [0, ∞]) can be expressed as a speed measure\n\nchange of C(t), and then use convergence of the measures to get convergence of the processes. The\n\nproblem is that we are dealing with a sequence of random measures, and the proposition deals only\nwith deterministic measures. To overcome this obstacle we can construct a coupled sequence of\nrandom measures (ρn )n∈N , such that (X̃(ρn )(t); t ∈ [0, ∞]) is distributed as (X (n,a) (t); t ∈ [0, ∞])\n\nand that (ρn )n∈N converges almost surely vaguely to ρ, where ρ is the random measure defined in\n(7) such that Z̃ = X̃[ρ]. This section is devoted to the construction of the coupled measures.\n\nWe recall that Vα is an α-stable subordinator. To make the construction clearer, we will first\nsuppose that τ0 is equidistributed with the positive α-stable distribution Vα (1). Let us consider\nthe strictly increasing process (Ṽρ (t); t ∈ R) given by Ṽρ (t) := ρ[0, t] if t ≥ 0 and Ṽρ (t) := −ρ[t, 0)\nif t < 0. It is a known fact from the theory of Levy processes that Ṽρ (t) is a two sided α-stable\nsubordinator. We now use this process to construct the coupled sequence of random measures\n(ρn )n∈N as\nρn :=\n\nX\n\nn−1/(1+α) τin δsn i ,\n\ni\n\nwhere sn :=\n\n1\n2\n\nlog\n\nn−a +1\n1−n−a\n\nand\n\nτin := n1/(1+α) (Ṽρ (n−α/(1+α) (i + 1)) − Ṽρ (n−α/(1+α) i)).\n\n(17)\n\nObserve that (τin )i∈Z is an i.i.d. sequence distributed like τ0 , so that using (16) and (15) we\nsee that X̃(ρn ) is a walk with drift n−1/α taking values in sn Z. The latter means that X̃(ρn ) is\nα\n\ndistributed like sn n 1+α X (n,a) . The key observation here is that the scaling factor sn satisfies\nsn nα/(1+α) → 1 as n → ∞.\n\n(18)\n\nSo, we just have to show that X̃(ρn ) converges to X̃(ρ), because (18) implies that if X̃(ρn )\nconverges to X̃(ρ), so sn nα/(1+α) X̃(ρn ) does. With (18) in mind it is easy to prove that the\nsequence of measures (ρn ) converges almost surely vaguely to ρ. Suppose that a < b are real\n\n\fBOUCHAUD WALKS WITH VARIABLE DRIFT\n\n18\n\nnumbers and that Vρ is continuous at a and b, then\nρn ((a, b]) = Vρ (n−α/(1+α) ⌊a/sn ⌋) − Vρ (n−α/(1+α) (⌊b/sn ⌋ + 1)).\nn→∞\n\nn→∞\n\nBut using (18) it is clear that n−α/(1+α) ⌊a/sn ⌋ → a and n−α/(1+α) ⌊b/sn ⌋ → b. Then the\ncontinuity of Vρ at a and b implies that ρn ((a, b])\n\nn→∞\n\n→\n\nρ(a, b], and we have proves the vague\n\nconvergence of ρn to ρ.\nSuppose now that τ0 is not a positive α-stable random variable. Then, we can follow Section\n(ǫ)\n\n3 of [11]. There they construct constants cǫ and functions gǫ such that τi\n\nis distributed like τ0 ,\n\nwhere\n(ǫ)\n\nτi\n\n:= c−1\nǫ gǫ (Ṽρ (ǫ(i + 1)) − Ṽρ (ǫi)).\n\n(19)\n\nLemma 3.1 of [11] says that\ngǫ (y) → y as ǫ → 0.\n\n(20)\n\nAs τ0 satisfies (4) and using the construction of cǫ in Section 3 of [11], we can deduce that\ncǫ ∼ ǫ1/α\n\n(21)\n\nDefine\n(n(−α/(1+α)) )\n\nτin := τi\n\n(22)\n\nand again\nρn :=\n\nX\n\nn−1/(1+α) τin δsn i .\n\ni\n\nThen, by definition (19), X̃(ρn ) is a walk with drift n−1/α taking values in sn Z. Using (20),\n(21) and (18) we can see that P-a.s. ρn → ρ vaguely.\n5. The Subcritical Regime\nWe will prove that if a > α/(1 + α), then (X (n,a) ; t ∈ [0, ∞]) converges to a F.I.N. diffusion.\nWe obtain the same scaling limit that was obtained in [11] for a symmetric B.T.M. Nevertheless,\nhere we have to deal with walks which are not symmetric, in contrast with the situation of [11].\nFor this purpose we express each rescaled walk as a time scale change of a Brownian motion. The\nscale change is necessary to treat the asymmetry of the walk. Then we show that the scale change\ncan be neglected. We now proceed to define a time scale change of a Brownian motion. Let μ be\na locally finite discrete measure\nμ(dx) :=\n\nX\n\nwi δyi (dx),\n\ni∈Z\n\nwhere (yi )i∈Z is an ordered sequence of real numbers so that yi < yj i.i.f. i < j.\n\n\fBOUCHAUD WALKS WITH VARIABLE DRIFT\n\n19\n\nLet S : R → R ∪ {∞, −∞} be a real valued, strictly increasing function, μ will be the speedmeasure and S the scaling function of the time scale change of Brownian motion. Define the scaled\nmeasure (S ◦ μ)(dx) as\n(S ◦ μ)(dx) :=\nLet\nφ(μ, S)(t) :=\n\nZ\n\nX\n\nR\n\nwi δS(yi ) (dx).\n\ni\n\nl(t, y)(S ◦ μ)(dy)\n\nand ψ(μ, S)(s) be the right continuous generalized inverse of ψ(μ, S). Then, as shown in [13]\nX(μ, S)(t) := S −1 (X(S ◦ μ)(t)))\nis a continuous time random walk with {yi } as its state space. The mean of the exponentially\ndistributed waiting time of X(S ◦ μ) on yi is\n2wi\n\n(S(yi+1 ) − S(yi ))(S(yi ) − S(yi−1 ))\nS(yi+1 ) − S(yi−1 )\n\n(23)\n\nand the transition probabilities to the right and to the left respectively are\nS(yi ) − S(yi−1 )\nS(yi+1 ) − S(yi )\nand\n.\nS(yi+1 ) − S(yi−1 )\nS(yi+1 ) − S(yi−1 )\n\n(24)\n\nAs in the previous section, we need to define a sequence of measures (νn )n∈Z converging almost\nsurely vaguely to ρ, and which can be used to express the sequence of rescaled walks X (n,a) .\nLet\nνn :=\n\nX rn + 1\ni∈Z\n\n2rni\n\nτin δinα/(α+1) ,\n\nwhere τin are defined in display (22), and rn := 1 −\n\n2n−a\n1+n−a .\n\nWe will also use a sequence of scaling\n\nn\n\nfunctions S (which will converge to the identity mapping) given by\nS n (inα/(α+1) ) :=\n\ni−1\nX\nj=0\n\nrj\nnα/(α+1)\n\n.\n\nWe extend the domain of definition of S n to R by linear interpolation. Then, by (23) and (24),\nwe have that X(νn , S n ) is distributed like X (n,a) . We will use the following theorem proved by\nStone in [13].\nProposition 5.1. Let (νn )n∈N be a sequence of measures that converges vaguely to ν. Then the\ncorresponding processes (X(νn )(t), 0 ≤ t ≤ T ) converges to (X(ν)(t), 0 ≤ t ≤ T ) in distribution in\n(D[0, T ], J1 )\nThe proof of part (iii) of theorem 2.1 will rely in the following lemma. Let id denote the identity\nmapping on R, then we have that\n\n\fBOUCHAUD WALKS WITH VARIABLE DRIFT\n\n20\n\nLemma 5.2. S n (n−α/(1+α) ⌊nα/(α+1) *⌋) converges uniformly on compacts to id and νn to converges\nalmost surely vaguely to ρ.\nProof. The convergence of the scaling functions is easily seen to be true under the assumption\na > α/(α + 1) because\n⌊nα/(1+α) x⌋\nn\n\nS (n\n\n−α/(1+α)\n\n⌊n\n\nα/(1+α)\n\nx⌋) =\n\nX\nj=0\n\nrnj\nnα/(α+1)\n\nand\n⌊nα/(1+α) x⌋\n\nrn\n\n⌊nα/(α+1) x⌋\n\nnα/(1+α)\n\n⌊nα/(1+α) x⌋\n\n≤\n\nX\nj=0\n\nrnj\nα/(α+1)\nn\n\n≤\n\n⌊nα/(α+1) x⌋\n.\nnα/(1+α)\n\nNow we use the fact that\nα/(1+α)\n\nrn⌊n\n\nx⌋\n\n=\n\n\u0012\n\u0013⌊nα/(1+α) x⌋\n2n−a\n1−\n1 + n−a\n\nconverges to 1, because a > α/(1 + α).\nIn a similar fashion it can be shown that the \"correcting factors\"\n\nrn +1\ni\n2rn\n\nin the definition of νn\n\nconverge uniformly to 1 in any bounded interval. Hence, we can show the convergence of νn to ρ\nas in the previous section.\n\u0003\nLemma 5.2 implies the vague convergence of (S n ◦ νn ) to ρ. Then, by proposition 5.1 we\n\ncan deduce that X(S n ◦ νn ) converges to X(ρ). Let T > 0, by lemma 5.2 we have that S −1\n\nalso converges uniformly to the identity. Thus, using the precedent observations, we get that\n(X(μ, S)(t) : 0 ≤ t ≤ T ) converges to (X(ρ)(t)0 ≥ t ≥ T ) in D[0, T ] with the Skorohod J − 1\ntopology. We have proved that (X (n,a) (t); t ∈ [0; T ]) converges in distribution to the F.I.N. diffusion\n\n(Z(t); t ∈ [0, t]) on (D[0, T ], J1 ).\nThus, it remains to prove that the convergence takes place also in the uniform topology. Using\nthe fact that the support of ρ is R, we can show that φ(ρ, id) is strictly increasing. The almost sure\nvague convergence of S ◦ νn to ρ implies that, for all t ≥ 0, φ(νn , S n )(t) converges to φ(ρ, id)(t).\n\nAs l is continuous in t, we obtain continuity of φ(νn , S n ) and of φ(ρ, id). That, plus the fact that\nthe φ(νn , id) are non-decreasing implies that that φ(νn , S n ) converges uniformly to φ(ρ, id). The\n\nfunction φ(ρ, id) is almost surely strictly increasing, because the support of ρ is R. Now we can\napply corollary 13.6.4 of [14] to obtain that ψ(νn , S n ) converges uniformly to ψ(ρ, id). That, plus\nthe continuity of the Brownian paths yields that X(S n ◦ νn ) converges uniformly to X(ρ, id). Using\nthat S n−1 converges to the identity, we finally get that X(νn , S n ) converges uniformly to X(ρ).\n\n\fBOUCHAUD WALKS WITH VARIABLE DRIFT\n\n21\n\nReferences\n1. G. Ben Arous, A. Bovier and V. Gayrard, Glauber dynamics of the random energy model. I. Metastable motion\non the extreme states, Comm. Math. Phys. 235 (2003), no. 3, 379–425.\n, Glauber dynamics of the random energy model. II. Aging below the critical temperature, Comm. Math.\n2.\nPhys. 236 (2003), no. 1, 1–54.\n3. G. Ben Arous, A. Bovier and J. Černý, Universality of the REM for dynamics of mean-field spin glasses, Comm.\nMath. Phys. 282 (2008), no. 3, 663–695.\n4. G. Ben Arous and J. Černý, Bouchaud's model exhibits two different aging regimes in dimension one, Ann.\nAppl. Probab. 15 (2005), no. 2, 1161–1192.\n5.\n, Dynamics of trap models, Mathematical statistical physics, Elsevier B. V., Amsterdam, 2006, pp. 331–\n394.\n, Scaling limit for trap models on Zd , Ann. Probab. 35 (2007), no. 6, 2356–2384.\n6.\n7.\n, The arcsine law as a universal aging scheme for trap models, Comm. Pure Appl. Math. 61 (2008),\nno. 3, 289–329.\n8. G. Ben Arous, J. Černý and T. Mountford, Aging in two-dimensional Bouchaud's model, Probab. Theory\nRelated Fields 134 (2006), no. 1, 1–43.\n9. J.-P. Bouchaud, Weak ergodicity breaking and aging in disordered systems, J. Phys.I (France) 2 (1992), 1705–\n1713.\n10. L. Cugliandolo, J. Kurchan, J.-P. Bouchaud and M. Mezard, Out of equilibrium dynamics in spin-glasses and\nother glassy systems, World Scientific, Singapore, (1998).\n11. L. R. G. Fontes, M. Isopi and C. M. Newman, Random walks with strongly inhomogeneous rates and singular\ndiffusions: convergence, localization and aging in one dimension, Ann. Probab. 30 (2002), no. 2, 579–604.\n12. P. Mörters, N. Gantert and V. Wachtel, Trap models with vanishing drift: Scaling limits and ageing regimes,\n(2010), arXiv 1003.1490v1.\n13. C. Stone, Limit theorems for random walks, birth and death processes, and diffusion processes, Illinois J. Math.\n7 (1963), 638–660.\n14. W. Witt, Stochastic-process limits, Springer series in operations research, Springer-Verlag New York, Inc.,\n(2002).\n15. O. Zindy, Scaling limit and aging for directed trap models, Markov Process. Related Fields 15 (2009), no. 1,\n31–50.\nE-mail address: mncabeza@mat.puc.cl\nFacultad de Matemáticas, Pontificia Universidad Católica de Chile, Casilla 306-Correo 22, Santiago\n6904411, Chile, Telephone: [56](2)354-1476, Telefax: [56](2)552-5916\n\n\f"}