{"id": "http://arxiv.org/abs/0807.5034v2", "guidislink": true, "updated": "2008-09-27T11:15:34Z", "updated_parsed": [2008, 9, 27, 11, 15, 34, 5, 271, 0], "published": "2008-07-31T11:21:58Z", "published_parsed": [2008, 7, 31, 11, 21, 58, 3, 213, 0], "title": "Competing jump cycles for vacancy diffusion in binary alloys", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.5132%2C0807.1846%2C0807.2572%2C0807.1304%2C0807.4935%2C0807.0701%2C0807.3870%2C0807.4337%2C0807.2585%2C0807.2894%2C0807.4348%2C0807.2335%2C0807.1242%2C0807.0778%2C0807.1228%2C0807.3979%2C0807.3910%2C0807.4931%2C0807.4105%2C0807.4909%2C0807.2249%2C0807.4978%2C0807.2377%2C0807.3058%2C0807.1850%2C0807.2766%2C0807.3182%2C0807.1964%2C0807.2414%2C0807.0541%2C0807.4643%2C0807.1106%2C0807.3912%2C0807.2643%2C0807.2316%2C0807.4469%2C0807.4956%2C0807.0796%2C0807.3085%2C0807.3621%2C0807.4384%2C0807.3702%2C0807.1052%2C0807.3961%2C0807.4662%2C0807.3822%2C0807.1437%2C0807.1780%2C0807.5034%2C0807.1535%2C0807.4155%2C0807.0172%2C0807.2444%2C0807.2183%2C0807.1250%2C0807.3093%2C0807.0647%2C0807.2042%2C0807.5110%2C0807.1032%2C0807.4294%2C0807.3080%2C0807.3665%2C0807.2714%2C0807.3689%2C0807.3609%2C0807.2161%2C0807.2701%2C0807.1459%2C0807.3596%2C0807.1670%2C0807.4258%2C0807.4524%2C0807.4650%2C0807.3358%2C0807.3942%2C0807.2933%2C0807.2916%2C0807.3118%2C0807.1104%2C0807.1760%2C0807.0824%2C0807.4342%2C0807.4140%2C0807.2575%2C0807.1177%2C0807.3601%2C0807.2546%2C0807.3967%2C0807.4660%2C0807.1287%2C0807.2729%2C0807.2213%2C0807.0610%2C0807.1586%2C0807.4837%2C0807.1639%2C0807.3851%2C0807.0192%2C0807.4587%2C0807.0630&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Competing jump cycles for vacancy diffusion in binary alloys"}, "summary": "The mean-first-passage-times (MFPTs) for a vacancy that diffuses (via one-\nand six-jump cycles) in a two dimensional ordered binary alloy are evaluated\nusing the properties of random walks on networks. We investigate the effect of\ntemperature and relative barrier height on the ratio between the MFPTs of the\ntwo cycles. We find that the six-jump cycle takes shorter time than the\none-jump cycle for the range of parameters considered.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0807.5132%2C0807.1846%2C0807.2572%2C0807.1304%2C0807.4935%2C0807.0701%2C0807.3870%2C0807.4337%2C0807.2585%2C0807.2894%2C0807.4348%2C0807.2335%2C0807.1242%2C0807.0778%2C0807.1228%2C0807.3979%2C0807.3910%2C0807.4931%2C0807.4105%2C0807.4909%2C0807.2249%2C0807.4978%2C0807.2377%2C0807.3058%2C0807.1850%2C0807.2766%2C0807.3182%2C0807.1964%2C0807.2414%2C0807.0541%2C0807.4643%2C0807.1106%2C0807.3912%2C0807.2643%2C0807.2316%2C0807.4469%2C0807.4956%2C0807.0796%2C0807.3085%2C0807.3621%2C0807.4384%2C0807.3702%2C0807.1052%2C0807.3961%2C0807.4662%2C0807.3822%2C0807.1437%2C0807.1780%2C0807.5034%2C0807.1535%2C0807.4155%2C0807.0172%2C0807.2444%2C0807.2183%2C0807.1250%2C0807.3093%2C0807.0647%2C0807.2042%2C0807.5110%2C0807.1032%2C0807.4294%2C0807.3080%2C0807.3665%2C0807.2714%2C0807.3689%2C0807.3609%2C0807.2161%2C0807.2701%2C0807.1459%2C0807.3596%2C0807.1670%2C0807.4258%2C0807.4524%2C0807.4650%2C0807.3358%2C0807.3942%2C0807.2933%2C0807.2916%2C0807.3118%2C0807.1104%2C0807.1760%2C0807.0824%2C0807.4342%2C0807.4140%2C0807.2575%2C0807.1177%2C0807.3601%2C0807.2546%2C0807.3967%2C0807.4660%2C0807.1287%2C0807.2729%2C0807.2213%2C0807.0610%2C0807.1586%2C0807.4837%2C0807.1639%2C0807.3851%2C0807.0192%2C0807.4587%2C0807.0630&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The mean-first-passage-times (MFPTs) for a vacancy that diffuses (via one-\nand six-jump cycles) in a two dimensional ordered binary alloy are evaluated\nusing the properties of random walks on networks. We investigate the effect of\ntemperature and relative barrier height on the ratio between the MFPTs of the\ntwo cycles. We find that the six-jump cycle takes shorter time than the\none-jump cycle for the range of parameters considered."}, "authors": ["Zerihun Getahun", "Mesfin Asfaw", "Mulugeta Bekele"], "author_detail": {"name": "Mulugeta Bekele"}, "author": "Mulugeta Bekele", "arxiv_comment": "6 figures, 12 pages", "links": [{"href": "http://arxiv.org/abs/0807.5034v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0807.5034v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0807.5034v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0807.5034v2", "journal_reference": null, "doi": null, "fulltext": "arXiv:0807.5034v2 [cond-mat.mtrl-sci] 27 Sep 2008\n\nCompeting jump cycles for vacancy diffusion\nin binary alloys\nZerihun Getahun1, Mesfin Asfaw2 and Mulugeta Bekele1\n1\nDepartment of Physics, Addis Ababa University P.O.Box 1176,\nAddis Ababa, Ethiopia\n2\nDepartment of Physics and Graduate Institute of\nBiophysics National Central University Jhongli, 32054 Taiwan\nOctober 31, 2018\nReceived: date / Revised version: date\nAbstract\nThe mean-first-passage-times (MFPTs) for a vacancy that diffuses\n(via one- and six-jump cycles) in a two dimensional ordered binary\nalloy are evaluated using the properties of random walks on networks.\nWe investigate the effect of temperature and relative barrier height\non the ratio between the MFPTs of the two cycles. At low temperature we find that the six-jump cycle takes shorter time while at high\ntemperature the one-jump cycle takes shorter time than that of the\nsix-jump cycle for the range of parameters considered.\n\n1\n\nIntroduction\n\nThe mechanism by which a single vacancy diffuses in mono-atomic\ncrystalline material is basically through site exchange with one of its\nnearest-neighbor atoms. The vacancy diffusion continues through the\nmaterial successively in a random way such that each new site occupied\nis usually energetically identical to any other earlier occupied site. As\nsuch, order is maintained throughout the vacancy diffusion.\n\n1\n\n\fA atom\n\nB atom\n\nVacancy\n\nFigure 1: A binary alloy on two-dimensional lattice with a single vacancy\noccupying a site on sublattice A.\nThe situation is not so simple if the crystalline material is, for\ninstance, composed of a binary alloy which consists of two interpenetrating simple cubic sublattices that are predominantly occupied by\ntwo different atoms, A and B. Figure 1 is an illustration of a binary\nalloy in two-dimensional lattice with a single vacancy. Whenever the\nvacancy on site A exchanges its site with one of its nearest-neighbor\natoms, the process leads to disorder in the crystalline structure. If the\nvacancy randomly moves successively via nearest-neighbor jumps, a\nstring of anti-structure atoms would lead to disorder in the material.\nTo avoid this problem of disordering, two alternative diffusion mechanisms are likely to take place: either jumps of the vacancy to further\ndistant sites on the same sublattice or a cycle of successive intermediate jumps to nearest-neighbor in which the atomic disorder appearing\nduring the earlier part of one cycle is followed by successive healing\nduring the later part of the cycle. The first alternative is usually called\none-jump cycle. The prominent cycle for the second alternative is the\nsix-jump cycle. It was first suggested by H. B. Huntington and later\ndiscussed by Elcock and McCombie [1]. Figures 2a and 2b illustrate\n\n2\n\n\fFigure 2: A possible path for (a) six-jump cycle and (b) one-jump cycle.\nthe possible paths for six- and one-jump cycles, respectively, for a\nbinary alloy in a two-dimensional lattice.\nA previous work dealt with calculating diffusion coefficient via sixjump cycles using rate equation method [2]. An even earlier work\n[3]used mean-first passage method to compare the diffusion coefficients\nof the A and B atoms. In our present work, we raise a specific question regarding the times required for a vacancy to diffuse via the two\ndominant cycles and compare them using appropriate parameters.\nWhich one of the two alternatives will the vacancy prefer to diffuse\nthrough the lattice? One way to answer this question is to compare\nthe times taken for the vacancy to go from one stable state to the next\nstable state via the two alternatives.\nThe problem of vacancy jump from one site to the next through\nsite exchange with an atom can be seen as a barrier crossing problem\nof an idealized Brownian particle representing the combined vacancyatom pair involved in the site exchange. The direction of vacancy\nmotion can be taken as the direction of movement of the Brownian\nparticle. Since each state to which the vacancy jumps is either stable\nor metastable, it is reasonable to consider the next jump process as\nindependent of its previous one. In other words, we will consider the\nBrownian particle to have enough time to get thermalized at each site\nbefore taking the next jump.\nThe problem of evaluating the times the vacancy takes from one\n\n3\n\n\fp\n\nq\n\nE1\n\np\n\n0\n\nFigure 3: Schematic diagram showing energy profile for (a) six-jump cycle\nand (b) one-jump cycle. Note local jump probabilities p (up) and q (down)\nin (a) and jump probability p0 in (b)).\nstable site to the next stable site via the one- and six-jump cycles depend on the corresponding potential energy profiles of the two alternative paths. These times are usually called mean- first-passage-times\n(MFPTs). In the case of the one-jump cycle, the vacancy has to make\na single jump over a high barrier to the nearest site on the same sublattice. In the case of the six-jump cycle, the vacancy has to undergo\nthrough six local jumps where the total barrier height is subdivided\nto ultimately arrive at a nearest site on the same sublattice through a\nlonger path than that of the one-jump cycle. Figs. 3a and 3b are the\nenergy profiles for the six and one-jump cycles, respectively, during\nthe course of each cycle. Given the specific potential profile for the\none-jump cycle, one can use the standard method of solving Brownian\ndiffusion in a potential field to evaluate the MFPT for the one-jump\ncycle. On the other hand, to evaluate the MFPT for the six-jump\ncycle we use a technique that has first been formulated by Goldhirsch\n\n4\n\n\fand Gefen [4, 5] and later applied by one of us in collaboration with\nothers [6]. This technique requires knowledge of local jump probabilities between successive sites as an input in order to evaluate its\nMFPT.\nIn this work we consider the vacancy diffusion on a two-dimensional\nlattice. In this case, there are four possible nearest stable sites on the\nsame sublattice to which the vacancy can jump by either performing\nthe one- or the six-jump cycle. In principle, the vacancy can attempt\nto diffuse via all these paths, select one of the paths and ultimately\nreach one of the four sites in one cycle.\nThe rest of the paper is organized as follows. In section 2, we consider the multiple paths scenario for the two alternative jump cycles\nthat describe vacancy diffusion on two-dimensional lattice and determine their corresponding closed form expressions for their MFPTs.\nSection 3 compares the values of MFPTs as a function of some of the\nparameters of interest and explores the different possibilities defining\nthem. In section 4, we present the summary and conclusion.\n\n2 MFPTs along the one- and six-jump\ncycles\nThe MFPT,τ1 , that the Brownian particle takes to complete the onejump cycle along a single path is worked out in the Appendix. We\nconsider a potential profile similar to Fig. 3b but for simplicity the\npotential profile is considered to be a piece-wise linear potential as in\nFig. 6 of the Appendix. The expression for the MFPT in the low\ntemperature regime turns out to be (see Eq. (A10) in the Appendix)\n\u0013\n\u0012\n1 kB T a 2 kE0T\n(1)\ne B\nτ1 =\nD\nE0\nwhere a is the distance between nearest neighbors, E0 is the barrier\nheight energy, D is the diffusion coefficient, kB is Boltzman's constant\nand T is the temperature of the crystal medium. One should note\nthat there are four possible stable lattice sites to which the vacancy\njumps on the same sublattice. If the vacancy chooses the one-jump\ncycle, the MFPT τ14 it takes to reach one of the four possible sites on\nthe same sublattice is simply\n\u0013\n\u0012\nτ1\n1\nkB T a 2 kE0T\n(2)\nτ14 =\ne B .\n=\n4\n4D\nE0\n\n5\n\n\fOn the other hand, if the vacancy chooses the six-jump cycle to ultimately arrive at one of the four stable lattice sites on the same\nsublattice there are two possible paths. Therefore, there are a total\nof eight possible paths which the vacancy can select to move by one\nsublattice distance. The evaluation of the MFPT, τ68 , the vacancy\ntakes to move by one sublattice distance via the six-jump cycle after\nchoosing one of the eight possible paths is done using the technique\nformulated by Goldhirch and Geffen [4, 5] and given by\n\u0013\n\u0012\n−q(p + q) 2p3 −7p2 − 9pq + q 2\n+\n,\n(3)\nτ68 =\n4p\nq5\nq 2 (p + q)2\nwhere p and q are the local jump probabilities (up and down) over the\nrugged potential corrseponding to the six-jump cycle (see p and q in\nFig. 3a) The closed form expressions for p and q are derived in the\nAppendix.\n\n3\n\nResult and Discussion\n\nThe expressions for the MFPTs are functions of a few physical quantities and include the barrier heights of the one- and six- jump cycle,\nE0 and E1 , the background thermal energy, kB T , of the binary alloy, the local barrier heights, ǫ1 and ǫ2 , for the six-jump cycle (see\nFig. 6 in Appendix), the diffusion coefficient D and the spacing, a,\nbetween the sublattices. In order to compare the MFPTs between the\ntwo alternatives we first identify two dimensionless quantities that are\nparameters controlling the MFPTs. One is the dimensionless quantity\nb = kBǫ1T that controls the local hopping rate for the six-jump cycle.\n0\nThe other dimensionless quantity is the ratio r = E\nE1 which compares\nthe total barrier corresponding to the one-jump cycle with that of the\ntotal barrier height for the six-jump cycle (see Figs. 3 (a) and (b)).\nLet us define a dimensionless quantity, fm , that compares the\nMFPT, τ14 , for the one-jump cycle to that of the MFPT, τ68 for the\nsix-jump cycle given by\nfm = | log(\n\nτ14\n)|.\nτ68\n\n(4)\n\nFig. 4 shows three plots of fm as a function of b (scaled local barrier height for the six-jump cycle) corresponding to three different r\nvalues that compare the total barrier heights of the two cycles:r =\n\n6\n\n\f1.5\n\n1.2\n\nfm\n\nr=\n\n1\n\nr=\n\n1.25\n1\n\n0.8\n=\nr\n\n0.75\n0.5\n0.25\n0\n1\n\n1.5\n\n2\n\n2.5\n\n3\n\nb\n\nFigure 4: Plot which shows fm versus b for fixed r = 0.8, r = 1 and r = 1.2.\n0.8, 1and1.2. Each plot has a region of negative slope as well as a\nregion of positive slope. Note that the region of negative slope corresponds to a situation where the MFPT, τ14 , via the one-jump cycle\nis smaller than that of the MFPT, τ68 , via the six-jump cycle. This\nimplies that in the high temperature regime the one-jump cycle takes\nshorter time than that taken by the six-jump cycle. This is because\nwhen the background thermal kick is high enough, the vacancy can\neasily cross the barrier height through one-jump cycle. On the other\nhand, the region of positive slope corresponds to a situation where\nτ68 is smaller than τ14 . This implies that at low temperature the\nsix-jump cycle takes shorter time than that of the one-jump cycle.\nThis is because, at low temperature, the background thermal kick is\nweak for the vacancy to cross the barrier via one-jump cycle. On the\nother hand, for the six-jump cycle there are six small barrier heights\nwhich can be crossed with relatively small thermal kicks. Thus at low\ntemperature the vacancy can cross the relatively small local barriers\nquickly compared to the large barrier of the one-jump cycle. At the\ninflection point of the plots, fm is zero and this corresponds to a situation where the MFPT via both cycles is the same. This clearly\nshows that at a certain temperature the MFPT for a vacancy diffusing through one-jump cycle is equal to that of vacancy diffusion via\nthe six-jump cycle. Comparing the three plots, when r = E0 /E1 gets\nlarge the MFPT via the six-jump cycle predominantly gets relatively\nshorter compared to that of the one-jump cycle. Fixing b = 2 and\n\n7\n\n\ff m 1.5\n2.5\n=\nb\n\n1.25\n1\n0.75\n\nb=\n\n0.5\n\n2\n\n0.25\n0\n0.4\n\n0.6\n\n1.2\n\n1\n\n0.8\n\nr\nFigure 5: Plot which demonstrates fm versus r for fixed b = 2.5 and b = 2.\nb = 2.5, we investigate how the fm behaves as a function of r as\nshown in Fig. 5. The figure clearly demonstrates that the MFPT\nfor one-jump cycle becomes shorter than the MFPT of six-jump cycle\nwhen the thermal background temperature is strong enough as long\nas the potential barrier for one-jump cycle, E0 , is smaller than E1 for\nsix-jump cycle.\n\n4\n\nSummary and conclusion\n\nWe studied the MFPT for a vacancy diffusing in two dimensional\nbinary alloys. We investigated how the MFPT behaves as a function of\nthe two model parameters. The central result we obtained shows that\nthe six-jump cycle takes invariably shorter time than that of the onejump cycle for the parameter ranges considered at low temperature\nregimes. When the back ground temperature is strong enough, the\none-jump cycle is dominant.\nAs a concluding remark, there are two issues we would like to point\nout for future consideration. The first one concerns the need to explore\nother ranges of parameters not considered in this work. The second\none is the need to relate our findings to experimental results.\n\n8\n\n\fAcknowledgement\nZ.G and M.B. would like to thank The Intentional Program in Physical\nSciences, Uppsala University, Uppsala, Sweden for the support they\nhave been providing for our research group. M.A. would like to thank\nHsuan-Yi Chen for stimulating discussions.\n\nAppendix\nIn this Appendix we derive the values for p, q and p0 in terms of the\nmodel parameters. For a Brownian particle that moves in a highly\nviscous medium under the influence of external potential V (x), the\nLangevin equation that governs the dynamics of such a particle is\ngiven by:\ns\nV ′ (x)\ndx\n2kB T\n=−\n+ ξ(t)\n(A1)\ndt\nγ\nγ\nwhere γ and T denote the constant friction coefficient and the temperature, respectively. V (x) is the external potential, kB is the Boltzman's constant and ξ(t) is the delta correlated noise term. The corresponding Fokker-Planck equation can be written as,\n∂t p(x, t) = ∂x [\n\nV ′ (x)\np(x, t)] + D∂x2 p(x, t).\nγ\n\n(A2)\n\nHere p(x, t) represents the probability of a particle to be found at\na position x at time t, and D = kB T /γ is the diffusion coefficient.\nStarting from Eq. A2, one can derive the expression for MFPT in a\nbistable potential whose inverse is the jump probability [7]. Taking a\npiecewise linear potential which is described by\n −3ǫ1 x\n,\nx ≤ 0;\n\n\n 3ǫ2a\n1x\n,\n0\n≤ x ≤ 2a\n2a\n3 ;\nV (x) = −3ǫ\n(A3)\n2a\n1x\n+ 2ǫ1 , 3 ≤ x ≤ a;\n\n\n 3ǫ2a\n1x\nx > a,\n2a − ǫ1 ,\nand noting that ǫ2 = ǫ1 /2, the MFPT τ (0 −→ a) to reach x = a,\nstarting from x = 0 is\n−ǫ1\n\n3ǫ1\nǫ1\nǫ1\nǫ1\n2a2 e 2kB T (kB T )2\nkB T\n2kB T\n2kB T\n+8e\n−e\n(\n)(4−4e\n+8)).\nτ (0 −→ a) = (\n2\nk\n9Dǫ1\nBT\n(A4)\n\n9\n\n\fq\np\nV(x)\n\nε2\nε1\n\nx= 0\n\nx = 2a/3 x = a\n\nx\n\nFigure 6: Asymmetric piecewise linear double well potential.\n\n10\n\n\fWhen ǫ1 is large compared to kB T , the above expression takes a simple\nform:\n\u0013\n\u0012\n4\nkB T a 2 kǫ1T\nτ (0 −→ a) =\ne B .\n(A5)\nD ǫ1 + ǫ2\nFor the case ǫ1 is large compared to kB T , probability p to jump from\nx = 0 to x = a is the inverse of τ (0 −→ a) so that\n\u0012\n\u0013\nD ǫ1 + ǫ2 2 k−ǫ1T\ne B .\np=\n(A6)\n4\nkB T a\nSimilarly for the reverse case, the MFPT τ (a −→ 0) for the vacancy\nto reach x = 0 from x = a is given by\n−2ǫ2\n\nǫ2\n3ǫ2\n2ǫ2\n2ǫ2\n2a2 e kB T (kB T )2\n− 8)).\n)(4 − 4e kB T + 8e kB T + e kB T (\nτ (a −→ 0) = (\n2\nkB T\n9Dǫ1\n(A7)\nFor low temprature regime the above equation takes a simple form:\n\u0013\n\u0012\nkB T a 2 kǫ2T\n4\ne B\n(A8)\nτ (a −→ 0) =\nD ǫ1 + ǫ2\n\nand the associated local jump probability q is given by\n\u0012\n\u0013\nD ǫ1 + ǫ2 2 k−ǫ2T\nq=\ne B .\n4\nkB T a\n\n(A9)\n\nIf the bistable potential is symmetric with large barrier height E0\n(compared to thermal energy) and width a, the MFPT taken to jump\nin both directions is the same and is given by\n1\nτ1 = t(0 −→ a) =\nD\n\n\u0012\n\nkB T a\nE0\n\n\u00132\n\nE0\n\ne kB T\n\n(A10)\n\nwhile the corresponding jump the probability, p0 = q = p takes the\nvalue\n\u00132 −E\n\u0012\n0\nE0\ne kB T .\n(A11)\np0 = D\nkB T a\n\nReferences\n[1] E. W. Elock and C. W. McCombie, Phys. Rev. 109, 605 (1958).\n[2] R. Drautz and M. Fahnle, Acta metall. 47, 2437 (1999).\n\n11\n\n\f[3] M. Arita, M. Koiwa and S. Ishioka, Acta metall. 37, 1363 (1989).\n[4] I. Goldhirsch and Y. Gefen, Phys. Rev. A 33, 2583 (1986).\n[5] I. Goldhirsch and Y. Gefen, Phys. Rev. A 35, 1317 (1987).\n[6] Mulugeta Bekele, G. Ananthakrishna and N. Kumar, Physica A\n270, 149 (1999).\n[7] C. W. Gardiner, Handbook of stochastic methods for physics,\nchemistry and the natural sciences (second edition, SpringerVerlag, 1990).\n\n12\n\n\f"}