{"id": "http://arxiv.org/abs/0801.3894v1", "guidislink": true, "updated": "2008-01-25T08:08:18Z", "updated_parsed": [2008, 1, 25, 8, 8, 18, 4, 25, 0], "published": "2008-01-25T08:08:18Z", "published_parsed": [2008, 1, 25, 8, 8, 18, 4, 25, 0], "title": "Exit problems related to the persistence of solitons for the Korteweg-de\n  Vries equation with small noise", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0801.0265%2C0801.0925%2C0801.1340%2C0801.2719%2C0801.2711%2C0801.0880%2C0801.3660%2C0801.3233%2C0801.0400%2C0801.1208%2C0801.2618%2C0801.0670%2C0801.2208%2C0801.0221%2C0801.3894%2C0801.2607%2C0801.2028%2C0801.3784%2C0801.1284%2C0801.3298%2C0801.0820%2C0801.2377%2C0801.2727%2C0801.0529%2C0801.2289%2C0801.1485%2C0801.1414%2C0801.4192%2C0801.3943%2C0801.2786%2C0801.3627%2C0801.3578%2C0801.1367%2C0801.1997%2C0801.3757%2C0801.3435%2C0801.3391%2C0801.0874%2C0801.1487%2C0801.2187%2C0801.3430%2C0801.4053%2C0801.0414%2C0801.2480%2C0801.2390%2C0801.1624%2C0801.1166%2C0801.4210%2C0801.3842%2C0801.1518%2C0801.1001%2C0801.0282%2C0801.2110%2C0801.2893%2C0801.2988%2C0801.1786%2C0801.0910%2C0801.4714%2C0801.2116%2C0801.4847%2C0801.3639%2C0801.4274%2C0801.0425%2C0801.1080%2C0801.4564%2C0801.3058%2C0801.1844%2C0801.0960%2C0801.2807%2C0801.2974%2C0801.1370%2C0801.2331%2C0801.3961%2C0801.1720%2C0801.4848%2C0801.3016%2C0801.1682%2C0801.0783%2C0801.1783%2C0801.1953%2C0801.2249%2C0801.3582%2C0801.4528%2C0801.2366%2C0801.3470%2C0801.0426%2C0801.2943%2C0801.4588%2C0801.0832%2C0801.2069%2C0801.3486%2C0801.0455%2C0801.1851%2C0801.4896%2C0801.0989%2C0801.1016%2C0801.2855%2C0801.1408%2C0801.2884%2C0801.1552%2C0801.2304&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Exit problems related to the persistence of solitons for the Korteweg-de\n  Vries equation with small noise"}, "summary": "We consider two exit problems for the Korteweg-de Vries equation perturbed by\nan additive white in time and colored in space noise of amplitude a. The\ninitial datum gives rise to a soliton when a=0. It has been proved recently\nthat the solution remains in a neighborhood of a randomly modulated soliton for\ntimes at least of the order of a^{-2}. We prove exponential upper and lower\nbounds for the small noise limit of the probability that the exit time from a\nneighborhood of this randomly modulated soliton is less than T, of the same\norder in a and T. We obtain that the time scale is exactly the right one. We\nalso study the similar probability for the exit from a neighborhood of the\ndeterministic soliton solution. We are able to quantify the gain of eliminating\nthe secular modes to better describe the persistence of the soliton.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0801.0265%2C0801.0925%2C0801.1340%2C0801.2719%2C0801.2711%2C0801.0880%2C0801.3660%2C0801.3233%2C0801.0400%2C0801.1208%2C0801.2618%2C0801.0670%2C0801.2208%2C0801.0221%2C0801.3894%2C0801.2607%2C0801.2028%2C0801.3784%2C0801.1284%2C0801.3298%2C0801.0820%2C0801.2377%2C0801.2727%2C0801.0529%2C0801.2289%2C0801.1485%2C0801.1414%2C0801.4192%2C0801.3943%2C0801.2786%2C0801.3627%2C0801.3578%2C0801.1367%2C0801.1997%2C0801.3757%2C0801.3435%2C0801.3391%2C0801.0874%2C0801.1487%2C0801.2187%2C0801.3430%2C0801.4053%2C0801.0414%2C0801.2480%2C0801.2390%2C0801.1624%2C0801.1166%2C0801.4210%2C0801.3842%2C0801.1518%2C0801.1001%2C0801.0282%2C0801.2110%2C0801.2893%2C0801.2988%2C0801.1786%2C0801.0910%2C0801.4714%2C0801.2116%2C0801.4847%2C0801.3639%2C0801.4274%2C0801.0425%2C0801.1080%2C0801.4564%2C0801.3058%2C0801.1844%2C0801.0960%2C0801.2807%2C0801.2974%2C0801.1370%2C0801.2331%2C0801.3961%2C0801.1720%2C0801.4848%2C0801.3016%2C0801.1682%2C0801.0783%2C0801.1783%2C0801.1953%2C0801.2249%2C0801.3582%2C0801.4528%2C0801.2366%2C0801.3470%2C0801.0426%2C0801.2943%2C0801.4588%2C0801.0832%2C0801.2069%2C0801.3486%2C0801.0455%2C0801.1851%2C0801.4896%2C0801.0989%2C0801.1016%2C0801.2855%2C0801.1408%2C0801.2884%2C0801.1552%2C0801.2304&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We consider two exit problems for the Korteweg-de Vries equation perturbed by\nan additive white in time and colored in space noise of amplitude a. The\ninitial datum gives rise to a soliton when a=0. It has been proved recently\nthat the solution remains in a neighborhood of a randomly modulated soliton for\ntimes at least of the order of a^{-2}. We prove exponential upper and lower\nbounds for the small noise limit of the probability that the exit time from a\nneighborhood of this randomly modulated soliton is less than T, of the same\norder in a and T. We obtain that the time scale is exactly the right one. We\nalso study the similar probability for the exit from a neighborhood of the\ndeterministic soliton solution. We are able to quantify the gain of eliminating\nthe secular modes to better describe the persistence of the soliton."}, "authors": ["Anne De Bouard", "Eric Gautier"], "author_detail": {"name": "Eric Gautier"}, "author": "Eric Gautier", "links": [{"title": "doi", "href": "http://dx.doi.org/10.3934/dcds.2010.26.857", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0801.3894v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0801.3894v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.PR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.PR", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "math.AP", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "35Q53, 60F10, 60H15, 76B25, 76B35", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0801.3894v1", "affiliation": "CREST", "arxiv_url": "http://arxiv.org/abs/0801.3894v1", "arxiv_comment": null, "journal_reference": "Discrete and Continuous Dynamical Systems - Series A 26, 3 (2010)\n  857 - 871", "doi": "10.3934/dcds.2010.26.857", "fulltext": "arXiv:0801.3894v1 [math.PR] 25 Jan 2008\n\nExit problems related to the persistence of\nsolitons for the Korteweg-de Vries equation with\nsmall noise\nBy Anne de Bouard1 and Eric Gautier2\nNovember 12, 2018\n1\n\n2\n\nCentre de Mathématiques Appliquées, UMR 7641 CNRS/Ecole\nPolytechnique, 91128 Palaiseau cedex, France;\ndebouard@cmapx.polytechnique.fr\n\nENSAE - CREST, 3 avenue Pierre Larousse, 92240 Malakoff, France;\ngautier@ensae.fr\nAbstract\nWe consider two exit problems for the Korteweg-de Vries equation\nperturbed by an additive white in time and colored in space noise of\namplitude ǫ. The initial datum gives rise to a soliton when ǫ = 0. It\nhas been proved recently that the solution remains in a neighborhood of\na randomly modulated soliton for times at least of the order of ǫ−2 . We\nprove exponential upper and lower bounds for the small noise limit of\nthe probability that the exit time from a neighborhood of this randomly\nmodulated soliton is less than T , of the same order in ǫ and T . We obtain\nthat the time scale is exactly the right one. We also study the similar\nprobability for the exit from a neighborhood of the deterministic soliton\nsolution. We are able to quantify the gain of eliminating the secular modes\nto better describe the persistence of the soliton.\n\nKey Words: Stochastic partial differential equations, Korteweg-de Vries equation, soliton, large deviations.\nAMS 2000 Subject Classification: 35Q53, 60F10, 60H15, 76B25, 76B35.\n\n1\n\nIntroduction\n\nThe Korteweg-de Vries (KdV) equation is a model for the evolution of weakly\nnonlinear, shallow water, unidirectional long waves. It is of the form\n∂t u + ∂x3 u + ∂x (u2 ) = 0\n\n1\n\n(1.1)\n\n\fwhere the space variable x is in R. The results of this paper could easily be\nextended to generalized subcritical KdV equations for which the nonlinearity\nis ∂x (up ) for p < 5, but we consider throughout this article the p = 2 case for\nsimplicity. The KdV equation is famous for its soliton solutions confirming the\nobservation of the solitary wave propagating on a channel by Russell in 1844.\nThese solitons are traveling waves of the form uc,x0 (t, x) = φc (x − ct + x0 ) where\nc is the constant velocity, x0 ∈ R is the initial phase and\nφc (x) =\n\n3c\n√\n2 cosh2 ( cx/2)\n\n(1.2)\n\nThese waves are localized, i.e. they decay exponentially to zero as x goes to\ninfinity. Their shape is stable against perturbations of the initial state. A first\nnotion of stability, for initial data close to φc , which takes into account the\nsymmetries of the evolution equation, is that of orbital stability. This notion\nof stability was first considered, for the solution φc (x − ct + x0 ) of the KdV\nequation, by Benjamin [1]. The set {φc (* − s), s ∈ R} is the orbit of φc . The\nfunctional Qc (u) = H(u)+ cM(u) is used as a Lyapunov functional in the proof.\nIt involves two important invariant quantities of the evolution equation (1.1):\nthe Hamiltonian, defined for u in H1 (R), the space of square integrable functions\nwith square integrable first order derivatives, by\nZ\nZ\n1\n1\n2\nH (u) =\n(∂x u(x)) dx −\nu3 (x)dx\n(1.3)\n2 R\n3 R\nand the mass defined by\nM (u) =\n\n1\n2\n\nZ\n\nu2 (x)dx.\n\n(1.4)\n\nR\n\nThe space H1 (R) is the energy space, and it is a natural space for the solutions of (1.1) : indeed, if u ∈ C([0, T ]; H1 (R)) is a solution of (1.1), then\nH(u(t)) = H(u0 ) and M(u(t)) = M(u0 ) for any t ∈ [0, T ], where u0 is the\ninitial datum in H1 . The shape of the soliton φc is a solution of the constrained\nvariational problem which consists in minimizing the Hamiltonian for a constant\nmass. Orbital stability means that when the initial datum is close to φc in H1\nthen the solution remains close to the orbit of φc . The second stronger notion\nof stability is that of asymptotic stability. It states that, for initial datum close\nin H1 to φc , the solution converges in some sense as time goes to infinity to\na soliton where the velocity and phase have been shifted. Convergence may\ncorrespond to weak convergence in H1 , see [15] or [16], or strong convergence\nin some weighted Sobolev space, see [17], for less general perturbations of the\ninitial datum, when the solution is written in the soliton reference frame. Note\nthat strong convergence in H1 is not expected due to the possibility of a dispersive tail moving away from the soliton as time goes to infinity.\nIt is often physically relevant to consider random perturbations of equation\n(1.1), see [19]. It is also interesting from a theoretical perspective to study the\n2\n\n\fstability of the soliton shape under these random perturbations. We consider as\nin [19] the case of an additive noise which could model a random pressure at the\nsurface of the water. The corresponding stochastic partial differential equation\n(SPDE for short) written in Itô form is the following\n\u0001\ndu + ∂x3 u + ∂x (u2 ) dt = ǫdW\n(1.5)\n\nwhere (W (t))t≥0 is a Wiener process and ǫ is the small noise amplitude. As we\nwork in infinite dimensions, and in the absence of global smoothing property of\nthe group S(t) on H1 associated to the unbounded operator −∂x3 , W needs to\nbe a proper Wiener process on H1 . Thus, the components of W (1) need to be\ncorrelated for the law of W (1) to be a bona-fide Gaussian measure. It can then\nalways be seen as the direct image via a Hilbert-Schmidt self-adjoint mapping\nΦ of a cylindrical measure and we assume that Φ is a mapping from L2 into\nH1 . Recall that Φ is Hilbert-Schmidt from L2 into H1 if it is a bounded\nlinear\nP\n2\noperator and for a complete orthonormal system (ei )i∈N of L2 , i∈N kΦei kH1\nis finite. The sum does not depend on the complete orthonormal system and,\nendowed with its square root as a norm, the space of Hilbert-Schmidt operators\nL2 (L2 , H1 ) = L0,1\nis a Hilbert space. As a consequence, the Wiener process\n2\ncould be written as\nX\nW (t, x) =\nβi (t)Φei (x), t ≥ 0, x ∈ R\n(1.6)\ni∈N\n\nwhere (βi )i∈N is a collection of independent standard real valued Brownian motions and (ei )i∈N a complete orthonormal system of L2 . Existence of path-wise\nmild solutions, almost surely continuous in time for all t positive with values\nin H1 , of the SPDE supplemented with the initial datum u(0) = u0 ∈ H1\nand uniqueness among\nthose having almost surely paths in some subspace\n\u0001\nXT ⊂ C [0, T ]; H1 has been obtained in [3]. In [6, 7] global well posedness\nis obtained for rougher noises and less regular solutions. It should be noticed\nthat in the physics literature the space-time white noise, corresponding to Φ = I\nis often considered, which we are not able to treat mathematically. For simplicity, we consider the sequence of operators\n\u0012\n\u0013−1/2\n1 2\nk\nΦn = I − ∆ + (x I − ∆)\n,\nn\n\n(1.7)\n\nwhich are Hilbert-Schmidt from L2 into H1 for k large enough, in order to prove\nlower bounds on exit times. As n goes to infinity the Hilbert-Schmidt assumption tends to be relaxed and the noise mimics a spatially homogeneous noise\nwith covariance (I − ∆)−1 , which is a white noise in the Hilbert space H1 . It\nshould also be noted that these operators are uniformly bounded in the space\nL0,1 of bounded operators from L2 into H1 ; indeed we have for every integer\nn, kΦn kL0,1 ≤ 1. It is possible to work with a more general approximating\nsequence, see for example the kind of assumptions made in [8].\n\n3\n\n\fThe linearized operator around the soliton is particularly interesting to study\nthe stability. It has a general null-space spanned by the two secular modes ∂x φc\nand ∂c φc . These modes are associated with infinitesimal changes in the velocity\nand location of the solitary wave. In Remark 2.3 in [5], the following heuristic\nargument then implies that the random solution should at most remain close\nto the deterministic solution up to times of the order ǫ−2/3 . It is based on an\nanalogy with the behavior of a linear system of SDEs such that 0 is a degenerate\nsimple eigenvalue corresponding to a Jordan block\n\u001a\ndX1 = X2 dt + ǫdW1 (t)\ndX2 = ǫdW2 (t)\nwith Brownian motions W1 and W2 . In such a case,\nZ T\nX1 (T ) = ǫ\nW2 (s)ds + ǫW1 (T )\n0\n\n2\n\n3\n\nhas variance of the order of ǫ T for large T . Thus, for a first approximation of\nthe solution uǫ,φc0 of (1.5) with initial datum φc0 , of the form\nuǫ,φc0 (t, x) = φc0 (x − c0 t) + ǫη̃ ǫ (t, x − c0 t),\n\n(1.8)\n\nand with an exit time defined for a neighborhood of the soliton in H1\n\b\nB (φc0 , α) = f ∈ H1 : kf − φc0 kH1 < α\n\nby\n\nc\n\nτ̃αǫ = inf {t ∈ [0, ∞) : uǫ,φc0 (t, * + c0 t) ∈ B (φc0 , α) } ,\n\nexit is expected to occur on a time scale of the order of ǫ−2/3 . However, it is\nbelieved that the soliton shape is preserved over a longer time scale. A general\napproach which works for the deterministic equation, see [15, 17], is to introduce\na description by a soliton ansatz where the parameters of the soliton fluctuate\nwith time. In the case of an additive noise physicists use an approximation of the\nsolution by a soliton ansatz of the form φcǫ (t) (x − xǫ (t)) where cǫ (t) and xǫ (t)\nare random scalar processes evolving according to a system of coupled SDEs.\nIn the case where the noise is the time derivative of a one dimensional standard\nBrownian motion, it is easily seen (see [20]) that the solution can be written as\na modulated soliton plus a Brownian motion. However, proving such a result\nis more involved when the noise is a function of space as well. A mathematical\njustification is given in [5] where the following result is proved.\nTheorem 1.1 For ǫ > 0 and c0 > 0, there exists α0 > 0 such that for every\nα ∈ (0, α0 ] there exists a stopping time ταǫ > 0 a.s. and semi-martingales cǫ (t)\nand xǫ (t) defined a.s. for t ≤ ταǫ with values in (0, ∞) and R respectively such\nthat if we set\nǫη ǫ (t) = uǫ,φc0 (t, * + xǫ (t)) − φcǫ (t)\n\nthen\n\nZ\n\nη ǫ (t, x)φc0 (x)dx = (η ǫ , φc0 ) = 0,\n\nR\n\n4\n\n∀t ≤ ταǫ\n\na.s.,\n\n(1.9)\n\n\fZ\n\n∀t ≤ ταǫ\n\nη ǫ (t, x)∂x φc0 (x)dx = (η ǫ , ∂x φc0 ) = 0,\n\nR\n\nand for all t ≤ ταǫ ,\n\na.s.\n\n(1.10)\n\nkǫη ǫ (t)kH1 ≤ α\n\n(1.11)\n\n|cǫ (t) − c0 | ≤ α.\n\n(1.12)\n\nand\nMoreover, there exists C > 0 such that for all T > 0 and α ≤ α0 there exists\nǫ0 > 0 such that for all ǫ < ǫ0 ,\nP (ταǫ ≤ T ) ≤\n\nCǫ2 T kΦkL0,1\n2\n\nα4\n\n.\n\n(1.13)\n\nThe proof uses the Lyapunov functional Qc as a central tool. The equations (1.9)\nand (1.10) are such that restricted to this subspace, the Lyapunov functional\nis coercive, i.e. the operator Q′′c0 is positive. It allows to keep |cǫ (t) − c0 | and\nkǫη ǫ (t)kH1 small on a longer time interval. Also, these two conditions together\nwith the implicit function theorem allow to obtain cǫ and xǫ . Other results in\n[5] give the asymptotic distribution of η ǫ as ǫ goes to zero as well as coupled\nequations for the evolution of the random scalar parameters. The parameters\nand remainder do not depend on α ≤ α0 . In the upper bound (1.13) the product ǫ2 T appears. The theorem says that the solution stays in a neighborhood\nof the randomly modulated soliton φcǫ (t) (x − xǫ (t)) with high probability at\nleast for times small compared to ǫ−2 . The time spent in a neighborhood of\na soliton-like wave, when the initial datum gives rise to a soliton for ǫ = 0, is\ncalled the persistence time, see [9] for numerical confirmations that the above\norder is the right order.\nIn this paper we first study the exit time τ̃αǫ and obtain that the time scale\non which the solution stays close to the deterministic soliton is indeed at most\nof the order of ǫ−2/3 . We then revisit the upper bound (1.13) and prove a\nsharper exponential bound. This bound is supplemented with an exponential\nlower bound of the same order in the parameters T and ǫ. We thus obtain the\nright order of the cumulative distribution function (CDF) of the exit time off\nneighborhoods of the randomly modulated soliton. This gives a confirmation\nthat the time scale on which the approximation of the solution by a randomly\nmodulated soliton is valid is of the order ǫ−2 . Our main tools are large deviations along with a study of the associated variational problems. Similarly,\nfactors T and T 3 have also been obtained in the study of the tails of the mass\nand arrival time for stochastic nonlinear Schrödinger equations (NLS) in [8, 13]\nwith the same techniques. These quantities are the main processes impairing\nsoliton transmission in optical fibers. In that setting, physicists again use the\napproximation by a randomly modulated soliton. An analogue of Theorem 1.1\nfor stochastic NLS equations would allow to tell up to what length of the fiber\nline the approximation is licit. Large deviations are also known to be a useful\n5\n\n\ftool to study the exit problem from an asymptotic equilibrium point or noised\ninduced transition between several equilibrium points in the small noise limit\n(see [12], and [14] for an exit problem for stochastic weakly damped nonlinear Schrödinger equation). Here we however study a simpler problem than the\nescape from the asymptotically stable central manifold for the KdV equation\nwhich we hope to study in future works.\n\n2\n\nLarge deviations and escape from a neighborhood of the soliton\n\nWe use sample path large deviations in this article in order to obtain lower\nbounds of the asymptotic as n goes to infinity and ǫ goes to zero of probabilities P (τ n,ǫ ≤ T ) where τ n,ǫ is the exit time of a neighborhood of either the\ndeterministic soliton or the randomly modulated soliton. The n recalls that we\nconsider a sequence of operators Φn , see (1.7). Large deviation techniques, see\nfor example [10, 11], allow to quantify convergence to zero of rare events. For\nexample, it is easy to check that on a finite time interval [0, T ], the paths of\nthe solution of 1.5 starting form φc0 converge in probability to the paths of the\ndeterministic soliton solution. The probability that exit from a neighborhood\nof the soliton occurs before T goes to zero as ǫ goes to zero. Large deviations\nquantify the convergence to zero of such probabilities. Following Varadhan's\nformalism, large deviations could be stated as a sequence of inequalities called a\nlarge deviation principle (LDP for short). The convergence to zero of the logarithm of the probabilities of rare events is characterized by a speed, here ǫ2 , and\na deterministic functional I n depending on the operator Φn considered, called\nrate function, to be minimized on the closure and interior of the set defining\nthe rare event in the state space. In the small noise asymptotics and for sample\npath large deviations, the rate function could be expressed in terms of the mild\nsolution of the control problem\n\u001a\n∂t u + ∂x3 u + ∂x (u2 ) = Φn h,\n\u0001\n(2.1)\nu(0) = φc0 and h ∈ L2 0, T ; L2 .\n\nWe denote the solution by Sn,φc0 (h). The mapping h → Sn,φc0 (h) is called the\ncontrol map and (2.1) the control equation. We recall that a rate function I on\nthe sample space (here the paths space C([0, T ]; H1 )) is lower semicontinuous\nand that a good rate function is such that I −1 ([0, R]) is compact for every R\npositive.\nn,ǫ,φc0 \u0001\nof the paths of the solutions of (1.5) for\nTheorem 2.1 The laws μu\nǫ>0\nthe operator Φ = Φn on C([0, T ]; H1 ) with initial datum φc0 satisfy a LDP of\nspeed ǫ2 and good rate function\nI n (w) =\n\n1\ninf\nkhk2L2 (0,T ;L2 ) .\n2 h∈L2 (0,T ;L2 ): w=Sn,φc0 (h)\n\n6\n\n\f\u0001\nIt means that for every Borel set B of C [0, T ]; H1 , we have the lower bound\n−\n\ninf\n\n◦\nw ∈ B\n\nI n (w) ≤ limǫ→0 ǫ2 log P (un,ǫ,φc0 ∈ B)\n\nand the upper bound\nlimǫ→0 ǫ2 log P (un,ǫ,φc0 ∈ B) ≤ − inf I n (w).\nw∈B\n\nThe proof\nuses the LDP for the laws of the stochastic convolution ǫZ where\nRt\nZ(t) = 0 S(t\n\u0001 − s)dW (s) on the Banach path space XT ; it is a subspace of\nC [0, T ]; H1 where the fixed point argument proving the local well-posedness\nis used, see [3]. The stochastic convolution appears when we write the equation\nsatisfied by the mild solution of (1.5). These laws are Gaussian measures and\nthe LDP is a consequence of the general result on LDP for centered Gaussian\nmeasures on real Banach spaces, see [11]. The second step is to prove the continuity of the mapping which, to\u0001 the perturbation Z in XT assigns the solution\nun,1,φc0 := G(Z) in C [0, T ]; H1 . It is obtained noting that G(Z) = v(Z) + Z\nwhere v(x) denotes the solution of\n\u0001\n\u001a\n∂t v + ∂x3 v + ∂x (v + Z)2 = 0\nv(0) = φc0 .\nThen the continuity of G is a consequence of the continuity of v with respect\nto the perturbation Z. It could be proved as in [4] where the stochastic NLS\nequation is considered. LDP for the paths of the mild solution of the SPDE is\nthen obtained by a direct application of the contraction principle which states\nthat we can push forward LDP for measures on a Hausdorff topological space to\na LDP for direct image measures on another Hausdorff topological space when\nthe mapping is continuous. More details on the proof of such LDP are given in\n[13] where the stochastic NLS equation with additive noise is considered. The\ncontrol map SH,φc0 (h) for the theoretical stochastic equation with spatially\nhomogeneous noise is defined as the mild solution of\n\u001a\n∂t u + ∂x3 u + ∂x (u2 ) = ΦH h,\n\u0001\n(2.2)\nu(0) = φc0 and h ∈ L2 0, T ; L2 ,\n\nwhere ΦH = (I − ∆)−1/2 . Note that though we cannot give a mathematical\nmeaning to the stochastic equation with such homogeneous noise, the corresponding control map is well defined.\n\nLet us now consider the exit times τ̃αn,ǫ . Note that we only consider here\na lower bound of the probability since it is enough to prove the heuristic of\nRemark 2.3 in [5]. Recall that we want to check that the time scale on which\nthe approximation by the deterministic soliton is licit is at most of the order\nof ǫ−2/3 . When studying the exit times ταn,ǫ , however, we give both upper and\nlower bounds of the tail probabilities of the same order in the parameters ǫ and\nT.\n7\n\n\fProposition 2.2 Take T , c0 positive; then for α0 small enough, for every α <\nα0 , there exists a constant C(α, c0 ) which depends on α and c0 but not on T\nsuch that\nC(α, c0 )\nlimn→∞ limǫ→0 ǫ2 log P (τ̃αn,ǫ ≤ T ) ≥ −\n.\nT3\nProof. For fixed n, using Theorem 2.1, limǫ→0 ǫ log P (τ̃αn,ǫ ≤ T ) is larger than\no\nn\n1\n− inf khk2L2 (0,T ;L2 ) , h : kSn,φc0 (h)(T ) − φc0 (* − c0 T )kH1 > α .\n2\nIn a first step, we consider the preceding variational problem in which the operator Φn is replaced by the operator ΦH = (I − ∆)−1/2 and α is replaced by 2α.\nWe give upper bounds on the infimum by minimizing on smaller and smaller\nsets of controls, until we are able to handle the variational problem. Note that\nup to now, the problem is a control problem for the KdV equation that we\ncannot handle. We will show that we can work on more restrictive classes of\ncontrols and still obtain a nice qualitative order. Using the Sobolev embedding\nof H1 into L∞ , with norm C∞ , the infimum is found to be less than\nn\no\ninf khk2L2 (0,T ;L2 ) , h : SH,φc0 (h)(T ) − φc0 (* − c0 T ) L∞ > 2C∞ α\nsince we then minimize on a smaller set. We consider controls h giving rise to\nmodulated solitons of the form\n\u0012\n\u0013\nZ t\nφc(t) x −\nc(s)\n0\n\nin the homogeneous case. They are such that c(0) = c0 and\n\u0012\n\u0013\nZ t\n′\nΦH h(t, x) = c (t) ∂c φc |c=c(t) x −\nc(s)ds ,\n0\n\nsince the soliton profile φc satisfies the equation\n\n−c∂x φc + ∂x3 φc + ∂x (φc )2 = 0.\nAgain, taking the infimum on a smaller set of controls, we obtain the lower\nbound\n(Z\n\u0013\u0015 2\n\u0014\n\u0012\nZ t\nT\n1\n−1\n′\n− inf\nc(s)ds\nc (t)ΦH ∂c φc |c=c(t) x −\ndt,\n2\n0\n0\nL2\n)\n!\nZ T\n3c0\n1\n> 2C∞ α ,\nc ∈ C ([0, T ]; (0, +∞)) : c(0) = c0 , φc(T )\n(c0 − c(s))ds −\n2\n0\nwhere we have bounded from below the L∞ norm of the function by its value\nat c0 T . This is in turn bigger than\n(Z\nT\n\u0010\n\u0011 2\n1\n− inf\n∂\nφ\n|\n(c′ (t))2 Φ−1\ndt,\nc\nc\nH\nc=c(t)\n2\nL2\n0\n!\n)\nZ T\n3c0\n1\n− φc(T )\n(c0 − c(s))ds > 2C∞ α ,\nc ∈ C ([0, T ]; (0, +∞)) : c(0) = c0 ,\n2\n0\n8\n\n\f3c0\ndue to the fact that ΦH commutes with spatial translations. Let us fix α0 < 4C\n∞\nso that c0 − 4C3∞ α > 0 for 0 < α < α0 . A sufficient condition for the constraint\non the terminal value to hold is\n\nc0 −\n\n4c(T )\n4C∞ α\n\u0010p\n\u0011.\n>\nRT\n3\nexp\nc(T ) 0 (c0 − c(s))ds\n\n\u0010\n\u0011\nRT\nNoticing that the function λ defined by λ(x) = 4x2 exp −x 0 (c0 − c(s))ds\nRT\nRT\nattains its maximum at x = 2/ 0 (c0 − c(s))ds for x ≥ 0, if 0 (c0 − c(s))ds ≥ 0,\nwe obtain that it is enough to have\nZ\n\nT\n\n0\n\n4\n:= δ(c0 , α).\n(c0 − c(s))ds > p\ne c0 − 4C∞ α/3\n\nAs in [8] for the tails of the arrival time of a pulse driven by a stochastic nonlinear Schrödinger equation where we obtained the order −CT −3 , the boundary\ncondition is in integrated form. The integral to be minimized is of the form\nZ\n\nT\n\n2\n\n(c′ (t)) g (c(t)) dt\n\n0\n\nwhere g(c) = k(I − ∆)1/2 ∂c φc k2L2 . Instead of solving the problem of the calculus\nof variations with a nonstandard boundary condition, we make a guess and\nlook for solutions of the form c(t) = c0 − 2γt/T 2 for some positive γ with\nc0 − 2γ/T > 0. Note that if γ = inf{ 32 δ(c0 , α), c40 }, then the boundary condition\nis satisfied for T ≥ 1. Also the term g(c(t)) in the integral is then such that\nthere exists a constant C(c0 ) with\nZ\n\n0\n\nT\n′\n\n2\n\n(c (t)) g (c(t)) dt ≤ C(c0 )\n\nZ\n\nT\n0\n\n2\n\n(c′ (t)) dt, for T ≥ 1,\n\nsince c0 /2 ≤ c(t) ≤ c0 for any T ∈ [0, T ]. Thus, for a new constant C(α, c0 ), we\nobtain\nZ T\nC(α, c0 )\n2\n, for T ≥ 1.\n(c′ (t)) g (c(t)) dt ≤\nT3\n0\n\nLet us now consider the case where the square root of the covariance operator of\nthe noise is Φn , and let us start from the path c(t) exhibited in the homogeneous\nnoise case; we denote the corresponding control by\n\u0013\u0013\n\u0012\n\u0012\nZ t\nc(s)ds\n.\nhc (t, x) = c′ (t) (I − ∆)1/2 ∂c φc |c=c(t) * −\n0\n\nThen, since for such hc\nSH,φc0 (hc )(T ) − φc0 (* − c0 T )\n9\n\nH1\n\n> 2α,\n\n\fwe deduce from the continuity of the mild-solution of the control map with\nrespect to the convolution of the semi-group with the control, used to prove the\nLDP, and the continuity of this last quantity with respect to the control, that\nfor sufficiently large n\nkSn,φc0 (hc )(T ) − φc0 (* − c0 T )kH1\n\u0012\n\u0013\n1\n= SH,φc0 (I − ∆)1/2 (I − ∆ + (x2 I − ∆)k )−1/2 hc (T ) − φc0 (* − c0 T )\nn\n\nH1\n\n> α.\n\nThis ends the proof.\n\n\u0003\n\nAs a consequence, the time scale on which an exit from a neighborhood of\nthe soliton occurs is at most ǫ−2/3 . In the next section we prove that the time\nscale on which the solution remains close to the randomly modulated soliton is\nexactly of the much longer order ǫ−2 . We provide upper and lower bounds for\nthis result.\n\n3\n\nEscape from a neighborhood of the randomly\nmodulated soliton\n\nIn the proof of Theorem 2.1 in [5] a local parametrization u 7→ (C(u), X (u))\nis used, in order to obtain parameters of the soliton wave form such that u =\nφC(u) (*−X (u))+R(u) with R satisfying some adequate orthogonality conditions.\nThis parametrization is obtained using the implicit function theorem, imposing\nthat the constraints (1.9) and (1.10) hold. Such a parametrization holds as long\nas u remains in a proper neighborhood of the spatial translates of φc0 ; thus,\nsetting cǫ (t) = C(uǫ,φc0 (t)) and xǫ (t) = X (uǫ,φc0 (t)), with uǫ,φc0 a solution of\n(1.5) with paths a.s. in C1 (R+ ; H1 ) and initial datum φc0 , the processes cǫ (t)\nand xǫ (t) are well defined adapted processes, up to a stopping time of the form\nτ ǫα = inf {t ≥ 0, |cǫ (t) − c0 | ≥ α or kuǫ,φc0 (t, * + xǫ (t)) − φc0 kH1 ≥ α} .\nWe can indeed always replace a function u by the function u(*+ X (u)) and come\nback to the case where xǫ (t) is close to 0, and it is not necessary to include a\ncondition of the form |xǫ (t)| ≥ α. It is also shown that this stopping time could\nbe bounded above and below by\n\b\nǫ\nτCα\n= inf t ≥ 0, |cǫ (t) − c0 | ≥ α or kuǫ,φc0 (t, * + xǫ (t)) − φcǫ (t) kH1 ≥ α\n\nfor some constants C depending solely on c0 and α0 , with 0 < α ≤ α0 . Hence,\nthe two stopping times are equivalent and the qualitative behavior of P(ταǫ ≤ T )\nwith respect to ǫ and T should be the same as the original P(τ ǫα ≤ T ). These\nnew stopping times ταǫ prove to be more convenient to work with. Note that\nthe implicit function theorem says that each function in H1 sufficiently close to\n10\n\n\fa translate of the soliton could be written as a translated soliton with slightly\ndifferent parameters plus a remainder in the subspace of H1 orthogonal in L2\nto φc0 and ∂x φc0 . Therefore the exit in terms of the H1 norm is the exit of a\nproper open subset.\nLet us first revisit the upper bound given in [5] and prove that the upper\nbound is indeed exponential. The proof relies on exponential tail estimates.\nWe denote by L−1,0 and L0,1 the spaces of bounded operators from H−1 to L2\n(respectively from L2 to H1 ).\nProposition 3.1 For T > 0 and 0 < α ≤ α0 fixed, there exists a constant\nC(α, c0 ), depending on α and c0 but not on T , and ǫ0 > 0 with ǫ20 T sufficiently\nsmall depending on kΦkL0,1 and α, such that for every positive ǫ < ǫ0 ,\n2\n\nP (ταǫ\n\n\u0012\n\u0013\nC(α, c0 )\n≤ T ) ≤ exp − 2\n.\nǫ T kΦk2L0,1\n\n(3.1)\n\nProof. Fix T positive. The estimate (1.13) relies on the two following inequalities. Let τ = ταǫ ∧T ; then for α0 sufficiently small there exists a positive constant\nC independent of T such that\n#\n\"\nZ\n2\n\nτ\n\n|cǫ (τ ) − c0 |2 ≤ C kǫη ǫ (τ )k4L2 + 4ǫ2\n\n(uǫ,φc0 (s), dW (s))L2\n\n0\n\n+ ǫ4 τ 2 kΦk4L0,1\n2\n\nand\nkǫη\n\nǫ\n\n(τ )k2H1\n\n\"\n\n≤C kǫη ǫ (τ )k4L2 + 4ǫ2\n+ǫ\n\nZ\n\nτ\n\n0\n\nZ\n\nτ\n\n2\n\n(uǫ,φc0 (s), dW (s))L2\n\n0\n\n(∂x uǫ,φc0 (s), ∂x dW (s))L2 − ǫ\nτ\n\n2\n\nZ\n\n0\n\nτ\n\n+ ǫ4 τ 2 kΦk4L0,1\n2\n\n\u0011\n\u0010\n2\n(uǫ,φc0 (s)) , dW (s)\n\nL2\n\nǫ\n(uǫ,φc0 (s), dW (s))L2 + τ kΦk2L0,1\n2\n2\n0\n\u0015\nZ τ\n2\nǫ\n2\n2\n2\nǫ,φc0\n+ǫ kΦkL0,1\n(s)kL2 ds + c0 τ kΦkL0,1 .\nku\n2\n2\n2\n0\n\n+ c0 ǫ\n\nZ\n\nThese are obtained from several manipulations of the Lyapunov functional and\nevolution equations for the mass and Hamiltonian evaluated on the solution\nof the stochastic KdV equation (see [5]). The evolution of these quantities is\nobtained using the Itô formula and a smoothing procedure. We do not reproduce\nthe proof here. We may also write\n\u0001\nP (ταǫ ≤ T ) ≤ P |cǫ (τ ) − c0 |2 ≥ α2 or kǫη ǫ (τ ) k2H1 ≥ α2\n\u0001\n\u0001\n≤ P |cǫ (τ ) − c0 |2 ≥ α2 + P kǫη ǫ (τ ) k2H1 ≥ α2 .\nNote that when |cǫ (τ ) − c0 |2 ≥ α2 we have |cǫ (τ ) − c0 |2 = α2 and kǫη ǫ (τ ) kL2 ≤\nα. Thus for ǫ0 sufficiently small, depending on kΦkL0,1 , T (so that ǫ20 T is small)\n2\n\n11\n\n\fand α, and for ǫ < ǫ0 ,\n\u0012 Z\n\u0001\nP |cǫ (τ ) − c0 |2 ≥ α2 ≤ P ǫ\n\nτ\n\n0\n\n(uǫ,φc0 (s), dW (s))L2 ≥\n\n≤ P ǫ sup\n\nt∈[0,T ]\n\nα\n4\n\n\u0013\n\nZ t\u0010\n\u0011\nǫ\nuǫ,φc0 ,τα (s), dW (s)\n0\n\nL2\n\nα\n≥\n4\n\n!\n\n.\n\n(3.2)\n\nǫ\n\nwhere uǫ,φc0 ,τα is the process stopped at time ταǫ . Similarly, using as well the\nfollowing property\n(P ) When |cǫ (τ ) − c0 | ≤ α ≤ α0 , then for some C depending only on c0 and\nα0 , kφcǫ (t) − φc0 kH1 ≤ Cα, for all t ≤ τ ,\nwe obtain that there exists ǫ0 sufficiently small, depending on kΦkL0,1 , T (with\n2\nǫ20 T small) and α, such that for all ǫ < ǫ0 ,\n\u0001\nP kǫη ǫ (τ ) k2H1 ≥ α2\nr !\nZ t\u0010\n\u0011\nǫ\n1 α2\nǫ,φc0 ,τα\n(s), dW (s) 2 ≥\nu\n≤P ǫ sup\n2 10\nL\nt∈[0,T ]\n0\n!\nZ t\u0010\n\u0011\nǫ\nα2\nǫ,φc0 τα\n(s), ∂x dW (s)\n∂x u\n+P ǫ sup\n≥\n10\nL2\nt∈[0,T ]\n0\n!\n\u0013\nZ t \u0012\u0010\n\u00112\nǫ\nα2\nǫ,φc0 τα\n(s) , dW (s)\nu\n+P ǫ sup\n≥\n10\nt∈[0,T ]\n0\nL2\n!\nZ t\u0010\n\u0011\n2\nǫ\nα\n+P ǫ sup\nuǫ,φc0 ,τα (s), dW (s) 2 ≥\n.\n(3.3)\n10c0\nL\nt∈[0,T ]\n0\nLet us denote by Zi (t) for i = {1, 2, 3} the stochastic integrals arising in the\nright hand sides of (3.2) and (3.3). We obtain exponential tail estimates for each\nof the above probabilities in the usual\n√ way, see for example [18], Theorem 2.1.\nWe introduce the function fl (x) = 1 + lx2 , where l is a positive parameter.\nWe then apply the Itô formula to fl (Zi (t)) and each process decomposes into\n1 + El,i (t) + Rl,i (t) where\nEl,i (t) =\n\nZ\n\nt\n0\n\nand\n1\nRl,i (t) =\n2\n\n1\np\ndZi (t) −\n2\n2\n1 + lZi (t)\nlZi (t)\n\nZ\n\n0\n\nt\n\nlZi (t)\np\n1 + lZi (t)2\n\n!2\n\nZ\n\n0\n\nt\n\nlZi (t)\np\n1 + lZi (t)2\n\nd < Zi > t +\n\n12\n\n1\n2\n\nZ\n\n0\n\nt\n\n!2\n\nd < Zi >t ,\n\nd < Zi >t\n3/2\n\n(1 + lZi (t)2 )\n\n.\n\n\fLet us for example consider Z2 . Given (ej )j∈N a complete orthonormal system\nof L2 ,\nZ tX\u0010\n\u00112\nǫ\n< Z2 >t =\n∂x uǫ,φc0 τα , ∂x Φej 2 (s)ds;\nL\n\n0 j∈N\n\nthus, using the Hölder inequality and the property (P ) we have, for some constant C(α, c0 ) = Cα2 + k∂x φc0 kH1 , and any t,\n< Z2 >t ≤ C(α, c0 )kΦ∗ k2L−1,0 t.\n\nThen\n|Rl,2 (t)| ≤ lC(α, c0 )kΦk2L0,1 T.\n\nThe same bound also holds for Z1 and Z3 . We may thus write for any i and\nconstants δi > 0,\n!\nδi\nP sup |Zi (t)| ≥\nǫ\nt∈[0,T ]\n\u0012 \u0012 \u0013\u0013!\nδi\n= P sup exp (fl (Zi (t))) ≥ exp fl\nǫ\nt∈[0,T ]\n\u0013!\n\u0012 \u0012 \u0013\nδi\n2\n.\n− 1 − lC(α, c0 )kΦkL0,1 T\n≤ P sup exp (El,i (t)) ≥ exp fl\nǫ\nt∈[0,T ]\nThe Novikov condition is also satisfied and El,i (t) is such that (exp (El,i (t)))t≥0\nis a uniformly integrable martingale. The Doob inequality then gives\n\u0012 \u0012 \u0013\n\u0013!\nδi\nP sup exp (El,i (t)) ≥ exp fl\n− 1 − lC(α, c0 )kΦk2L0,1 T\nǫ\nt∈[0,T ]\n\u0013\n\u0012\n\u0012 \u0013\nδi\n+ 1 + lC(α, c0 )kΦk2L0,1 T E [exp (El,i (T ))] .\n≤ exp −fl\nǫ\nSince exp (El,i (T )) is an exponential martingale E [exp (El,i (T ))] = E [exp (El,i (0))] =\n1. For ǫ0 small enough we have for ǫ < ǫ0\nδi2\n2ǫ2\nwhich implies that the l-derivative at 0 of the function in the exponential bound\nis negative. Then, optimizing on the parameter l, we obtain the minimum in l\nof the upper bound, which has the form\n\u0012\n\u0013\nC(α, c0 )\nexp 1 − 2\n,\nǫ T kΦk2L0,1\nC(α, c0 )kΦk2L0,1 T <\n\nwith possibly another constant C(α, c0 ). Using the largest of all constants in\nthe exponentials for each tail probabilities, and taking a constant slightly bigger\nand ǫ0 smaller if necessary, the multiplicative constant in front of the exponential decay disappears and the result follows.\n\u0003\n\n13\n\n\fRemark 3.2 As will appear elsewhere, Theorem 1.1 also holds for a noise of\nmultiplicative type, and an exponential upper bound holds as well.\nIf we now consider the sequence of operators Φn mimicking the spatially\nhomogeneous noise with covariance operator (I − ∆)−1 , denoting the exit times\nταn,ǫ , we obtain the following statement:\nCorollary 3.3 For T > 0, 0 < α < α0 and n fixed, there exists a constant\nC(α, c0 ), depending on α and c0 , and there exists ǫ0 > 0 with ǫ20 T sufficiently\nsmall with respect to kΦn kL0,1 and α, such that for every ǫ < ǫ0 ,\n2\n\u0012\n\u0013\nC(α, c0 )\nP (ταn,ǫ ≤ T ) ≤ exp −\n.\n(3.4)\nǫ2 T\nIn particular, we have the following double asymptotic result\nlimn→∞ limǫ→0 ǫ2 log P (ταn,ǫ ≤ T ) ≤ −\n\nC(α, c0 )\n.\nT\n\nLet us now prove that when considering the sequence of operators Φn as\nabove, one can obtain a lower bound of the same order in the parameters T and\nǫ as the upper bound in Corollary 3.3. We make use of the approximation via a\nmodulated soliton together with the LDP obtained in Theorem 2.1, and again\nminimize the rate function on a smaller set of controls giving rise to a set of\nparameterized exit paths.\nProposition 3.4 For every T and α positive, there exists a constant C(α, c0 )\nwhich depends on c0 and α but not on T , such that\nlimn→∞ limǫ→0 ǫ2 log P (ταn,ǫ ≤ T ) ≥ −\n\nC(α, c0 )\n.\nT\n\nProof. Let us denote by Uα0 the open set\n\b\nUα0 = φc (* − y) + g, g ∈ H1 : kgkH1 < α0 , y ∈ R, |c − c0 | < α0 .\n\nWe know from [5] that the velocity is obtained via a continuous mapping C from\nUα0 to R such that\ncǫ (t) = C (un,ǫ,φc0 (t)) .\n\nAlso for fixed n, we write that for 0 < 2α < α0 ,\n\nP (ταn,ǫ ≤ T ) ≥ P (un,ǫ,φc0 ∈ B)\nwhere\n\b\nB = u ∈ C([0, T ]; H1 ) : ∀t ∈ [0, T ], u(t) ∈ Uα0 , |C (u(T )) − c0 | > α .\n\nTheorem 2.1 then leads to the following lower bound for limǫ→0 ǫ log P (ταn,ǫ ≤ T ):\no\nn\n1\n− inf khk2L2 (0,T ;L2 ) , h : ∀t ∈ [0, T ], Sn,φc0 (h)(t) ∈ Uα0 , |C (Sn,φc0 (h)(T )) − c0 | > α .\n2\n(3.5)\n14\n\n\fLet us, as in the proof of Proposition 2.2, replace in a first step the above\nvariational problem by a variational problem for Φ = ΦH = (I − ∆)−1/2 and α\nby 2α. Minimizing on a smaller set, we obtain\no\nn\n\u0001\n1\n− inf khk2L2 (0,T ;L2 ) , h : ∀t ∈ [0, T ], SH,φc0 (h)(t) ∈ Uα0 , C SH,φc0 (h)(T ) − c0 = 3α .\n2\nWe minimize on an even smaller set, considering solutions of the controlled\nequation which are modulated solitons of the form\n\u0012\n\u0013\nZ t\nφc(t) x −\nc(s)\n0\n\nwhere the one dimensional paths c are assumed to belong to C1 ([0, T ]; (0, +∞)).\nThe boundary conditions are thus that c(0) = c0 and c(T ) = c0 + 2α. A control\nhc associated to such a solution is given by\n\u0001\u0001\nH,φc0\nhc (t, x) = Φ−1\n(hc ) + ∂x3 SH,φc0 (hc ) + ∂x SH,φc0 (hc )2 (t, x)\nH ∂t S\n\u0013\n\u0012\nZ t\nx\n−\nc(s)ds\n.\n= c′ (t) Φ−1\n∂\nφ\nH c c c=c(t)\n0\n\nNote that this control is the same as in Proposition 2.2, only the terminal\nboundary condition changes. We thus obtain the lower bound\n(Z\n\u0013 2\n\u0012\nZ t\nT\n1\n′\n1/2\nc(s)ds\nc (t)(I − ∆)\n∂c φc |c=c(t) x −\n− inf\ndt,\n2\n0\n0\nL2\nc ∈ C1 ([0, T ]; (0, +∞)) : c(0) = c0 , c(T ) = c0 + 2α .\n\n(3.6)\n\nWe now have to solve a problem of the calculus of variations. Our aim is to\nfind the optimal paths c among the set of constrained paths minimizing the\npath integral. The integral may be written, with the same function g as in\nProposition 2.2, as\nZ T\n2\n(c′ (t)) g (c(t)) dt.\n0\n\nUsing successively the change of variables t = T u and the change of unknown\nfunction v(u) = c(T u), we obtain an upper bound of the form\n1\nT\n\nZ\n\n1\n\n2\n\n(v ′ (u)) g(v(u))du\n\n0\n\nfor functions v which are C1 ([0, T ]; (0, +∞)) and satisfy the two boundary conditions v(0) = c0 and v(1) = c0 + 2α independent of T . We recall that\ng(c) = k(I − ∆)1/2 ∂c φc k2L2 so that s 7→ g(v(s)) is bounded on [0, 1] for any\nv ∈ C1 ([0, T ]; (0, +∞)). Hence we deduce that the infimum in (3.6) is bounded\n0)\nabove by C(α,c\n. Now, coming back to the case where Φn is the square root\nT\nof the covariance operator of the noise, we start from a path c obtained from v\n15\n\n\fwhich say minimizes the objective function in the above problem of the calculus\nof variations, though following the above argument it does not really matter.\nThen, the control hc is such that\n\u0001\nC SH,φc0 (hc )(T ) = c0 + 2α.\n\nFrom the continuity of the mild-solution of the control map with respect to the\nconvolution of the semi-group with the control, used to prove the LDP, and the\ncontinuity of this last quantity with respect to the control, and using also the\ncontinuity of C with respect to u ∈ Uα0 , we know that for sufficiently large n\nC (Sn,φc0 (hc )(T ))\n\u0012\n\u0012\n\u0013\n\u0013\n1\n= C SH,φc0 (I − ∆)1/2 (I − ∆ + (x2 I − ∆)k )−1/2 hc (T )\nn\n> α.\n\nWe deduce that the inf-limit as n goes to infinity of the infimum in (3.5) is again\n0)\nand this ends the proof of Proposition 3.4.\n\u0003\nbounded above by C(α,c\nT\nAs a consequence of our two bounds, the typical time scale on which the\nsolution remains in the neighborhood of the modulated soliton is indeed 1/ǫ2.\nAcknowledgments. The authors are grateful to the Centro di Ricerca Matematica Ennio De Giorgi in Pisa for allowing us to participate to the spring 2006\nresearch period when this research was initiated.\n\nReferences\n[1] T. B. Benjamin. The stability of solitary waves, Proc. Roy. Soc. London A\n328 (1972), 153–183. MR0338584\n[2] G. Da Prato and J. Zabczyk. Stochastic Equations in Infinite Dimensions;\nEncyclopedia of Mathematics and its Applications, Cambridge University\nPress: Cambridge, England (1992). MR1207136\n[3] A. de Bouard and A. Debussche. On the stochastic Korteweg-de Vries equation, Journ. Funct. Anal. 154 (1998), 215–251. MR1616536\n[4] A. de Bouard and A. Debussche. The stochastic nonlinear Schrödinger\nequation in H1 , Stochastic Anal. Appl. 21 (2003), 97–126. MR1954077\n[5] A. de Bouard and A. Debussche. Random modulation of solitons for the\nstochastic Korteweg-de Vries equation, Ann. Inst. H. Poincaré Anal. Non\nLinéaire 24 (2007), 251–278. MR2310695\n[6] A. de Bouard, A. Debussche and Y. Tsutsumi. White noise driven\nKorteweg-de Vries equation, J. Funct. Anal. 169 (1999), 532–558.\nMR1730557\n16\n\n\f[7] A. de Bouard, A. Debussche and Y. Tsutsumi. Periodic solutions of the\nKorteweg-de Vries equation driven by white noise, SIAM J. Math. Anal.\n36 (2004/2005), 815–855. MR2111917\n[8] A. Debussche and E. Gautier. Small noise asymptotic of the timing jitter\nin soliton transmission, Ann. Appl. Probab. 18 (2008), 178–208.\n[9] A. Debussche and J. Printems. Numerical simulation of the stochastic\nKorteweg-de Vries equation, Physica D 134 (1999), 200–226. MR1711301\n[10] A. Dembo and O. Zeitouni. Large deviation techniques and applications,\n2nd edition, Springer-Verlag: New York (1998). MR1619036\n[11] J.D. Deuschel and D.W. Stroock. Large Deviations; Pure and Appl. Math.,\nAcademic Press: New-York (1986). MR0997938\n[12] M.I. Freidlin and A.D. Wentzell. Random Perturbations of Dynamical Systems, 2nd edition, Springer, Berlin (1998). MR1652127\n[13] E. Gautier. Large deviations and support results for nonlinear Schrödinger\nequations with additive noise and applications, ESAIM: Probability and\nStatistics 9 (2005), 74–97. MR2148961\n[14] E. Gautier. Exit from a neighborhood of zero for weakly damped stochastic nonlinear Schrödinger equations, to appear in Ann. Probab., Archive:\nmath.NA/0602350 (2006).\n[15] Y. Martel and F. Merle. Asymptotic stability of solitons for subcritical\ngeneralized KdV equation, Arch. Ration. Mech. Anal. 157 (2001), 219–\n254. MR1826966\n[16] Y. Martel and F. Merle. Asymptotic stability of solitons for subcritical\ngKdV equations, revisited, Nonlinearity 18 (2005), 55–80. MR2109467\n[17] R. L. Pego and M. I. Weinstein. Asymptotic stability of solitary waves,\nComm. Math. Phys. 164 (1994), 305–349. MR1289328\n[18] S. Peszat. Exponential tail estimates for infinite-dimensional stochastic convolutions, Bull. Pol. Acad. Sci. 40 (1992), 323–333. MR1402320\n[19] M. Scalerandi, A. Romano and C.A. Condat. Korteweg-de Vries solitons\nunder additive stochastic perturbations, Phys. Rev. E 58 (1998), 4166–\n4173.\n[20] M. Wadati. Stochastic Korteweg-de Vries equations, J. Phys. Soc. Japan\n52 (1983), 2642–2648. MR0722214\n\n17\n\n\f"}