{"id": "http://arxiv.org/abs/0711.2491v1", "guidislink": true, "updated": "2007-11-15T19:25:51Z", "updated_parsed": [2007, 11, 15, 19, 25, 51, 3, 319, 0], "published": "2007-11-15T19:25:51Z", "published_parsed": [2007, 11, 15, 19, 25, 51, 3, 319, 0], "title": "Labyrinthine Island Growth during Pd/Ru(0001) Heteroepitaxy", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0711.3570%2C0711.2274%2C0711.1895%2C0711.1423%2C0711.3626%2C0711.1083%2C0711.0615%2C0711.3934%2C0711.3798%2C0711.2997%2C0711.2331%2C0711.0864%2C0711.2799%2C0711.1285%2C0711.2953%2C0711.0682%2C0711.4422%2C0711.4503%2C0711.1123%2C0711.4344%2C0711.3035%2C0711.3058%2C0711.2418%2C0711.2526%2C0711.3296%2C0711.4260%2C0711.4228%2C0711.1763%2C0711.2383%2C0711.0302%2C0711.1897%2C0711.2187%2C0711.2943%2C0711.2491%2C0711.4462%2C0711.2482%2C0711.3177%2C0711.3418%2C0711.3212%2C0711.0289%2C0711.0254%2C0711.0305%2C0711.4831%2C0711.3610%2C0711.4624%2C0711.4634%2C0711.3481%2C0711.1627%2C0711.1328%2C0711.2251%2C0711.1686%2C0711.1290%2C0711.0458%2C0711.1798%2C0711.0880%2C0711.3967%2C0711.0550%2C0711.0134%2C0711.3869%2C0711.3831%2C0711.0290%2C0711.4551%2C0711.1526%2C0711.0993%2C0711.0711%2C0711.0918%2C0711.2655%2C0711.0358%2C0711.1516%2C0711.1530%2C0711.2548%2C0711.4881%2C0711.2812%2C0711.1817%2C0711.4200%2C0711.3025%2C0711.2193%2C0711.4740%2C0711.0507%2C0711.1030%2C0711.4327%2C0711.0712%2C0711.0132%2C0711.2874%2C0711.1789%2C0711.0504%2C0711.2468%2C0711.0525%2C0711.0055%2C0711.4944%2C0711.0063%2C0711.4460%2C0711.2065%2C0711.2689%2C0711.4927%2C0711.4013%2C0711.4319%2C0711.2096%2C0711.0527%2C0711.2054%2C0711.1523&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Labyrinthine Island Growth during Pd/Ru(0001) Heteroepitaxy"}, "summary": "Using low energy electron microscopy we observe that Pd deposited on Ru only\nattaches to small sections of the atomic step edges surrounding Pd islands.\nThis causes a novel epitaxial growth mode in which islands advance in a\nsnakelike motion, giving rise to labyrinthine patterns. Based on density\nfunctional theory together with scanning tunneling microscopy and low energy\nelectron microscopy we propose that this growth mode is caused by a surface\nalloy forming around growing islands. This alloy gradually reduces step\nattachment rates, resulting in an instability that favors adatom attachment at\nfast advancing step sections.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0711.3570%2C0711.2274%2C0711.1895%2C0711.1423%2C0711.3626%2C0711.1083%2C0711.0615%2C0711.3934%2C0711.3798%2C0711.2997%2C0711.2331%2C0711.0864%2C0711.2799%2C0711.1285%2C0711.2953%2C0711.0682%2C0711.4422%2C0711.4503%2C0711.1123%2C0711.4344%2C0711.3035%2C0711.3058%2C0711.2418%2C0711.2526%2C0711.3296%2C0711.4260%2C0711.4228%2C0711.1763%2C0711.2383%2C0711.0302%2C0711.1897%2C0711.2187%2C0711.2943%2C0711.2491%2C0711.4462%2C0711.2482%2C0711.3177%2C0711.3418%2C0711.3212%2C0711.0289%2C0711.0254%2C0711.0305%2C0711.4831%2C0711.3610%2C0711.4624%2C0711.4634%2C0711.3481%2C0711.1627%2C0711.1328%2C0711.2251%2C0711.1686%2C0711.1290%2C0711.0458%2C0711.1798%2C0711.0880%2C0711.3967%2C0711.0550%2C0711.0134%2C0711.3869%2C0711.3831%2C0711.0290%2C0711.4551%2C0711.1526%2C0711.0993%2C0711.0711%2C0711.0918%2C0711.2655%2C0711.0358%2C0711.1516%2C0711.1530%2C0711.2548%2C0711.4881%2C0711.2812%2C0711.1817%2C0711.4200%2C0711.3025%2C0711.2193%2C0711.4740%2C0711.0507%2C0711.1030%2C0711.4327%2C0711.0712%2C0711.0132%2C0711.2874%2C0711.1789%2C0711.0504%2C0711.2468%2C0711.0525%2C0711.0055%2C0711.4944%2C0711.0063%2C0711.4460%2C0711.2065%2C0711.2689%2C0711.4927%2C0711.4013%2C0711.4319%2C0711.2096%2C0711.0527%2C0711.2054%2C0711.1523&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Using low energy electron microscopy we observe that Pd deposited on Ru only\nattaches to small sections of the atomic step edges surrounding Pd islands.\nThis causes a novel epitaxial growth mode in which islands advance in a\nsnakelike motion, giving rise to labyrinthine patterns. Based on density\nfunctional theory together with scanning tunneling microscopy and low energy\nelectron microscopy we propose that this growth mode is caused by a surface\nalloy forming around growing islands. This alloy gradually reduces step\nattachment rates, resulting in an instability that favors adatom attachment at\nfast advancing step sections."}, "authors": ["Nicolas Rougemaille", "Farid El Gabaly", "Roland Stumpf", "Andreas K. Schmid", "Konrad Thürmer", "Norman C. Bartelt", "Juan De La Figuera"], "author_detail": {"name": "Juan De La Figuera"}, "author": "Juan De La Figuera", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.99.106101", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0711.2491v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0711.2491v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mtrl-sci", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0711.2491v1", "affiliation": "NEEL", "arxiv_url": "http://arxiv.org/abs/0711.2491v1", "arxiv_comment": null, "journal_reference": "Physical Review Letters 99, 10 (2007) 106101", "doi": "10.1103/PhysRevLett.99.106101", "fulltext": "Labyrinthine Island Growth during Pd/Ru(0001) Heteroepitaxy\nN. Rougemaille,1,2,3 F. El Gabaly,1,4 R. Stumpf,2 A. K. Schmid,1 K. Thürmer,2 N. C. Bartelt,2 and\nJ. de la Figuera4,5\n1\n\nLawrence Berkeley National Laboratory, Berkeley, California 94720, USA\n2\n\n3\n\nSandia National Laboratories, Livermore, California 94550, USA\n\nInstitut Néel, CNRS and Université Joseph Fourier, BP 166, F-38042 Grenoble Cedex 9, France\n4\n5\n\nUniversidad Autónoma de Madrid, Madrid 28049, Spain\n\nInstituto de Química-Física \"Rocasolano\", CSIC, Madrid 28006 Spain\n\nAbstract\n\nUsing low energy electron microscopy we observe that Pd deposited on Ru only attaches\nto small sections of the atomic step edges surrounding Pd islands. This causes a novel epitaxial\ngrowth mode in which islands advance in a snakelike motion, giving rise to labyrinthine patterns.\nBased on density functional theory together with scanning tunneling microscopy and low energy\nelectron microscopy we propose that this growth mode is caused by a surface alloy forming\naround growing islands. This alloy gradually reduces step attachment rates, resulting in an\ninstability that favors adatom attachment at fast advancing step sections.\n\nPACS numbers: 68.55.Ac, 61.72.Bb, 61.72.Ff, 68.37.Nq\n\n1\n\n\fAt sufficiently high temperature, epitaxial growth is expected to occur by the flow of\natomic steps: atoms deposited on flat terraces on the surface of a crystal diffuse across the surface\nuntil they encounter steps and are incorporated at low energy kink sites, causing the steps to\nadvance. Since the utility of thin films grown in this way often depends on the surface step\nstructure, much work has been devoted to characterizing the morphology of steps. For example, if\ndiffusion along the step edges is fast step edges become smooth, whereas slow step diffusion\nproduces dendritic step edges [1]. In single component systems the basic atomic processes\ngoverning the morphology of moving steps are increasingly well understood [2]. However, in\nheteroepitaxy, new types of cooperative behavior can arise [3-5]. In this work we report the\ndiscovery of a novel way in which surface alloying and step motion couple, leading to a\ndistinctive labyrinthine island morphology during growth in which only fast moving step edges\nare good sinks for deposited atoms. By unraveling the cooperative atomic scale processes leading\nto these striking 100-nm-scale patterns we make an inroad into understanding the intricate\nconnections between surface morphology and alloying.\nWe use the complementary capabilities of real-time low energy electron microscopy\n(LEEM) and atomic resolution scanning tunneling microscopy (STM) to study the evolution and\nmicroscopic structure of Pd deposited on the Ru(0001) surface. Pd and Ru are somewhat soluble\nin each other (the maximum solubilities are a few percent at 900 K [6]) and thus at high enough\ntemperature alloying during growth might be expected. We grow submonolayers of Pd by\nphysical vapor deposition onto well cleaned Ru(0001) substrates at 840 K at base pressures below\n1×10-10 torr. Previous diffraction studies have shown that monolayer (ML) films of Pd on Ru are\npseudomorphic [7]. A sequence of LEEM images [8] of the growing surface during Pd deposition\nat a substrate temperature of 840 K is shown in Fig. 1. Initially Pd starts to decorate the Ru\nsubstrate steps, forming a uniform narrow band at step edges. However this uniform step flow\nquickly stops and instead growth continues only from a few widely separated locations leading to\na snakelike motion of islands, as shown in Fig. 1(a). These islands have an (approximately)\nconstant width but grow longer as more Pd is deposited [see Figs. 1(b)-1(d)]. The direction of\nadvance of the active end of an island occasionally changes, apparently randomly. The islands\navoid connecting with themselves, other islands, and substrate steps - when the advancing active\nregion comes close to an existing, inactive Pd layer, it turns away, and often splits in two [Figs.\n1(b)-1(d)]. This entire process leads to a labyrinthine structure of the submonolayer Pd.\n\n2\n\n\fFIG. 1. Sequence of LEEM images of the Pd growth process on Ru(0001) at 840 K. Field of view\nis 6 μm. The monoatomic Ru steps (the four parallel lines that cross the images) are separated by\napproximately 1.5 μm. The deposition rate is 1 ML in 421 s. After first uniformly decorating the\nstep edges in (a), the Pd grows only from several distinct locations. In (b) and (c) the self-avoiding\nnature of different growth fronts is evident: Colliding growth fronts turn aside or split rather than\ncoalesce.\n\nThe observed growth mode is puzzling at first. All step edges should be good sinks for\ndeposited Pd atoms, yet Pd is incorporated overwhelmingly at a few special regions of the step\nedge, causing them to advance. Also, growing islands should be easily able to coalesce. What\natomic properties cause this growth behavior? One hypothesis is that the narrow islands are an\nexample of a stress domain pattern; i.e., a narrow island width is chosen as a compromise\nbetween the energetic cost of creating step edges and the relaxation of surface stress at the island\nboundaries. For example, Pb overlayer islands grown on Cu(111) can exhibit a similar\nmorphology [9], which has been characterized quantitatively as a stress domain pattern in\nthermodynamic equilibrium. We will show, however, that an entirely different, kinetic,\nmechanism is at work here.\n\n3\n\n\fTo address the reasons for the snakelike growth we imaged the atomic structure of the\nsurface with STM. We grew the Pd islands under the same conditions as in the LEEM\nexperiments and then rapidly quenched the surface to room temperature before imaging it with\nSTM. As seen in Fig. 2(a), the same meandering island shape was observed. Atomic resolution\nimages with chemical contrast [10] show that there is a distinct difference between the atomic\nstructure of the Ru terraces adjacent to steps that have apparently moved fast and those that have\nnot: the terraces adjacent to the stationary step edges are heavily alloyed with Pd, with densities\nup to about 10%. On the other hand, very little alloying is observed adjacent to active, moving Pd\nstep edges. These data immediately suggest that alloyed Ru regions have slowed the attachment\nof Pd adatoms on the Ru terraces to the edges of the Pd islands.\n\nFIG. 2. STM images after deposition of 0.2 ML of Pd. (a) View of an entire Pd island. (b),(c)\nAtomic resolution images of particular regions of the islands shown in (a). Close to the step\nsection (b) the Pd island is alloyed with Ru atoms (circled) and the Ru terrace is alloyed with Pd\natoms (one is marked by a square). The degree of alloying is much lower at the active step section\n(c).\n\n4\n\n\fThis suggestion raises two questions: By what mechanism does the alloying impede Pd\nincorporation at steps, and why is the alloying restricted to the region adjacent to the stationary\nisland edge? To answer these questions we performed density functional theory (DFT)\ncalculations [11] within the Perdew-Burke-Ernzerhof [12] generalized gradient approximation of\nthe energetics of Pd on Ru(0001) using the VASP code [13].\nFirst, we explain why alloying is rare on terraces far away from Pd step edges. Consider\nthe energetics of the process labeled \"A\" in Fig. 3(a). The calculated energy difference between\ndispersed Pd substitutional atoms on the Ru terraces and Pd atoms in the overlayer is Ef = 0.24\neV. At the experimental temperature of 840 K this formation energy would give an equilibrium\nalloy density of approximately exp(-Ef / kT) = 0.04. However, the lowest energy barrier we could\nfind for a Pd adatom to exchange with a Ru atom in the top substrate layer [process \"C\" in Fig.\n3(a)] is 2.48 eV. The resulting substitutional Pd and Ru adatom is 1.01 eV higher in energy than\nthe Pd adatom initial state. Consequently, it is likely that the Ru adatom reexchanges with a\nsubstitutional Pd, because of the 1.01 eV energy gain and a barrier that is only 2.48 eV - 1.01 eV\n= 1.47 eV. The reexchange is avoided only if the Ru adatom is trapped at a step instead, where it\nultimately gains the Ru adatom formation energy of 1.38 eV [process \"B\" in Fig. 3(a)]. Thus the\nalloying of Pd into the Ru surface by the adatom process is much more likely near steps than far\naway [14]. Consistent with this picture is the observation by STM of Ru atoms embedded in the\nPd overlayer [Fig. 2(b)] with a density that parallels the density of alloyed Pd on the nearby Ru\nterrace. Furthermore, the density of Pd in the Ru terraces adjacent to the step edges is about 5%,\non the order of what one would expect on the basis of the DFT formation energy.\nWe identify two mechanisms by which the existence of a step edge alloy can hinder the\nattachment of Pd adatoms at Pd step edges. First, the alloy on the terraces might impede the\ndiffusion of Pd toward steps. Supporting this scenario, our calculations show a repulsion between\nPd adatoms and Pd atoms substituted into the Ru substrate: only three of the six threefold hollow\nsites adjacent to an embedded Pd are local minima with a binding energy that is reduced by 0.14\neV over clean Ru(0001). This repulsion impedes diffusion of Pd near Pd islands. The alloy\nconcentration ρ near the step edges observed in STM is, at most, 10%. Our calculations [15] for\nthis density give a decrease in the diffusion coefficient D by a factor of 2. If the alloying region is\nonly a few nm wide as observed in STM, this decrease in D is by itself not sufficient to\neffectively block the step edges.\n\n5\n\n\fFIG. 3. (a) Various processes involved in the PdRu alloy formation. (b) Schematic of the\ninstability of Pd step attachment caused by variations in alloy concentration in front of the step\nedges. The dotted lines represent lines of equal concentration of Pd alloyed into the Ru terraces.\nRegions with locally less alloy (left) become better sinks of Pd, leading to larger growth rates\n(right) and a further decrease in alloy concentration.\n\nA second alloying effect that slows the Pd step advancement is that covering alloyed Pd\natoms by the advancing Pd layer costs energy compared to advancing over the pure Ru substrate.\nThe energy penalty is 0.5 eV per embedded Pd, almost equal to the typical binding energy of Pd\nto the Pd step of 0.61 eV. Given the low Pd adatom diffusion barrier of 0.19 eV it is reasonable to\nexpect that local equilibrium along steps can be established: Pd adatoms that attach to a Pd island\nstep located over a heavily alloyed substrate region are more likely to detach because of their\nhigher energy; i.e., the Pd adatom density in equilibrium with a step edge section advancing over\nan alloyed terrace would be higher than over a clean Ru terrace. This would cause concentration\ngradients on the terraces leading to a Pd flux away from alloyed step edges and toward the edges\nthat are in clean regions. Thus growth of Pd over alloyed regions will be avoided. Notice that the\nhigher Pd adatom concentration produced by this mechanism would reinforce the mechanism\ndiscussed above by promoting the alloying of Pd atoms into the Ru substrate.\nIn any case, the degree of alloying near a stationary step edge, and hence the barrier to Pd\nattachment, depends on time. We checked experimentally the time dependence of the Pd\nattachment barrier by starting the growth of narrow Pd islands and then interrupting the Pd dosing\nfor different periods of time. Stopping the deposition causes the growth to cease immediately. If\n\n6\n\n\fwe restart deposition three or more minutes later, none of the existing active regions resume\ngrowing. Instead, new islands are nucleated and new active step edges emerge from them, much\nas during the early state of the experiments. With shorter interruptions the original active regions\nof the step edges resume growth. This suggests that the alloy concentration necessary to block\nstep edges takes some time to build up.\nCan this time dependent alloy concentration profile near step edges account for the\nobserved growth mode? When step edges are moving slowly, the alloy concentration should\nbehave similarly to stationary steps: the alloy concentration next to the step edges increases until\nit reaches a relatively large (close-to-equilibrium) value of about 5% and then gradually extends\nonto the adjoining terraces. As shown schematically in Fig. 3(b), this situation leads to an\ninstability in the growth front: the flux of Pd attaching at the step edge will be largest where the\nalloy concentration is (by random fluctuations, initially) the smallest. This increased attachment\nand higher step velocity causes the alloy concentration in front of the step to be even lower\n(because the time spent by the step in any one position is less) and Pd attachment to be even\nfaster. If the speed of the steps becomes sufficiently large, one can envision a steady-state\nsituation where the alloy concentration near the step edge remains at a constant low value below\nthe equilibrium density. We propose that these slow and fast regimes are separated by a distinct\ncritical speed. Below the critical speed, attachment at the Pd step edges becomes increasingly\nunfavorable with time as the alloy concentration builds up. Above the critical speed, the step edge\nmoves faster than the speed at which the increased alloy concentration spreads onto the terrace,\nso that concentration remains low and Pd attachment stays easy.\nThe existence of such a critical velocity has direct experimental support. In Fig. 1 for\nexample, no step propagates at a velocity less than 45 nm/s. Remarkably, the propagation speed is\nalways very close to this minimum velocity, despite strong variations in the environment and size\nof the moving front. To rationalize this result we note that moving more quickly than the critical\nspeed (given that the local flux remains constant) would result in a narrowing of the growth front\n(to conserve mass). This shrinking would be resisted by various effects. For example, a narrow\ngrowth front would require adatom concentration gradients perpendicular to the growth direction.\nThese gradients would be unstable and would broaden (and thus slow) the growth front. The\nincreased energy associated with large step curvatures would also oppose narrowing. Thus the\ngrowth front appears to propagate at the slowest possible sustainable speed [16].\n\n7\n\n\fIn this scenario, the critical velocity should only depend on the rate of alloying but not on\nthe overall deposition flux. This prediction is tested in LEEM experiments that use different Pd\ndeposition rates. We have measured the growth velocity of deposition rates of 1/650, 1/1400, and\n1/6300 ML/s. The measured active step velocities are 50, 44, and 30 nm/s, respectively. So, an\norder of magnitude change in flux leads only to a relatively small change in velocity, roughly\nconsistent with our proposed model. Given approximately the same number of active regions per\nunit area, mass conservation then requires that the higher the flux, the wider the active regions.\nThis effect is clearly observed in Fig. 4. Also the active regions tend to get narrower, but move at\nthe same speed, at the late stages of growth when there are more active regions and the flux per\nactive region is less. Notice that the flux dependence of the width rules out that the labyrinthine\npatterns can be explained in terms of equilibrium surface stress domains.\n\nFIG. 4. LEEM images of Pd deposited on Ru(0001) at deposition rates and times of (a) 1/650\nML/s and 42 s and (b) 1/6300 ML/s and 190 s. The deposition temperature is 840 Κ; the field of\nview is 6 μm. The averaged speed of the advancing active regions is 50 nm/s and 30 nm/s,\nrespectively.\n\nCorroboration that surface alloying is responsible for the novel growth process comes by\ncodepositing Ru with the Pd. According to the DFT calculations described above, one would\nexpect the blocking Pd atoms embedded in the Ru substrate to be displaced by deposited Ru\nadatoms [17]. Consistent with this we find that even small simultaneous codeposition of Ru [with\nrates of 1/650 ML/s (Pd) and 1/1500 ML/s (Ru)] causes Pd to be uniformly incorporated into all\nstep edges.\nIn summary, we have found strong evidence that surface alloying can impede step-flow\ngrowth during Pd/Ru epitaxy at around 840 K, leading to distinctive snakelike motion that gives\n8\n\n\frise to labyrinth patterns. The conclusion that an instability causes the observed growth mode\nmight be applicable to other heteroepitaxial systems with surface alloying, in particular if the\ndeposited species has weaker bonds and lower surface energy than the substrate species. In this\ngeneral case the higher adatom formation energy of the substrate species should kinetically limit\nalloying on substrate terraces to regions close to step edges with all its consequences. The kinetic\nmechanism for this pattern formation is very different from the explanation of similar patterns in\nterms of surface stress domains, as in, e.g., Pb/Cu(111). It is plausible that labyrinthine growth\nalso could occur in systems where impurity gas adsorption [18] creates step attachment barriers.\nThis research was partly supported by the Office of Basic Energy Sciences, Division of\nMaterials Sciences, U.S. Department of Energy under Contracts No. DE-AC04-94AL85000 and\nNo. DE-AC02-05CH11231, and by the Spanish Ministry of Science and Technology through\nProject No. MAT2006-13149-C02-02.\n\n[1] R. Q. Hwang et al., Phys. Rev. Lett. 67, 3279 (1991).\n[2] A. Pimpinelli and J. Villain, Physics of Crystal Growth (Cambridge University Press,\nCambridge, England, 1998).\n[3] R. Q. Hwang, Phys. Rev. Lett. 76, 4757 (1996).\n[4] A. K. Schmid, N. C. Bartelt, and R. Q. Hwang, Science 290, 1561 (2000).\n[5] J. B. Hannon et al., Phys. Rev. Lett. 96, 246103 (2006).\n[6] Binary Alloy Phase Diagrams, edited by T. B. Massalski (ASM International, Metals Park,\nOH, 1990), 2nd ed.\n[7] J. Kolaczkiewicz and E. Bauer, Surf. Sci. 423, 292 (1999).\n[8] See EPAPS Document No. E-PRLTAO-99-056734 for a video which shows the complete\nLEEM movie from which Fig. 1 images were extracted, taken during the growth of palladium on\nruthenium. The substrate temperature is 840 K and the field of view is 6 μm. The time elapsed is\nshown in the low right corner. For more information on EPAPS, see http://www.aip.org/pubservs/\nepaps.html.\n[9] See especially Fig. 4 in R. Plass, N. C. Bartelt, and G. L. Kellogg, J. Phys. Condens. Matter\n14, 4227 (2002).\n[10] P. Varga and M. Schmid, Appl. Surf. Sci. 141, 287 (1999).\n\n9\n\n\f[11] Computational unit cells contain 1×1 and 3×3 surface periodicities on six- and seven-layer\nRu slabs. We chose 9×9 and 18×18 k points for the 1×1 cell, and 3×3 and 6×6 k points for the\n3×3 cell. For technical error margins below 0.05 eV, we average results for different slab\nthicknesses and k-space sampling.\n[12] J. P. Perdew, K. Burke, and M. Ernzerhof, Phys. Rev. Lett. 77, 3865 (1996).\n[13] G. Kresse and D. Joubert, Phys. Rev. B 59, 1758 (1999).\n[14] Another process potentially leading to alloying is the filling in of surface vacancies with Pd\natoms. However, the thermal density of these vacancies is very low, given a formation energy of\n1.54 eV. A lower bound for the activation energy of creating Ru vacancies, i.e., at steps, and\nsubsequent migration onto the terrace is 3.29 eV, and thus too high for this process to contribute\nsignificantly.\n[15] The diffusion coefficient D of Pd adatoms was computed by creating a random arrangement\nof embedded Pd in a 500×500 array of Ru substrate atoms. A Pd atom placed on this surface\nhopped to adjacent threefold sites according to the Metropolis Monte Carlo algorithm with the\nenergy landscape from our DFT calculations [see M. L. Anderson et al., Surf. Sci. 600, 1901\n(2006)]. D is given by the displacement after 1000 Monte Carlo time steps.\n[16] Inspection of the growth front reveals small fluctuations in speed: When regions of the\ngrowth front drop below the critical speed, they stop and, as reported above, often deflect the rest\nof the growth front into a new direction, or, occasionally, cause the entire growth front to stop.\n[17] The process for a Ru adatom exchanging with a substitutional Pd atom has a barrier of only\n1.48 eV. This is because Ru adatoms are 0.77 eV higher in energy than Pd adatoms. Thus\nreexchange of the Ru adatom with a substitutional Pd is likely to happen if there is no step edge\nclose by or when Ru is deposited.\n[18] M. P. Engelhardt et al., Surf. Sci. 578, 124 (2005).\n\n10\n\n\f"}