{"id": "http://arxiv.org/abs/0705.1991v2", "guidislink": true, "updated": "2007-10-02T14:28:25Z", "updated_parsed": [2007, 10, 2, 14, 28, 25, 1, 275, 0], "published": "2007-05-14T17:33:03Z", "published_parsed": [2007, 5, 14, 17, 33, 3, 0, 134, 0], "title": "Recurrence and Pólya number of quantum walks", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0705.2666%2C0705.0798%2C0705.4665%2C0705.1238%2C0705.3583%2C0705.1016%2C0705.0873%2C0705.3616%2C0705.4170%2C0705.2472%2C0705.2860%2C0705.2989%2C0705.1453%2C0705.1761%2C0705.4312%2C0705.0670%2C0705.2767%2C0705.0129%2C0705.2833%2C0705.2885%2C0705.0925%2C0705.1677%2C0705.1156%2C0705.2115%2C0705.1484%2C0705.3987%2C0705.3613%2C0705.3831%2C0705.3598%2C0705.1008%2C0705.1506%2C0705.0784%2C0705.4358%2C0705.3776%2C0705.1637%2C0705.1879%2C0705.1979%2C0705.3877%2C0705.2712%2C0705.2042%2C0705.1968%2C0705.2280%2C0705.3400%2C0705.2492%2C0705.4298%2C0705.2340%2C0705.1102%2C0705.0029%2C0705.0870%2C0705.1878%2C0705.3662%2C0705.0263%2C0705.3425%2C0705.1991%2C0705.2181%2C0705.4567%2C0705.4220%2C0705.2987%2C0705.4473%2C0705.3353%2C0705.1519%2C0705.1109%2C0705.1584%2C0705.4054%2C0705.0409%2C0705.0010%2C0705.2099%2C0705.3528%2C0705.4428%2C0705.1105%2C0705.1110%2C0705.4485%2C0705.1054%2C0705.4397%2C0705.0952%2C0705.0101%2C0705.4437%2C0705.1667%2C0705.2970%2C0705.3585%2C0705.1561%2C0705.4603%2C0705.4450%2C0705.3214%2C0705.0797%2C0705.0309%2C0705.3994%2C0705.0761%2C0705.4071%2C0705.0661%2C0705.0411%2C0705.3553%2C0705.3724%2C0705.1483%2C0705.0131%2C0705.2616%2C0705.3155%2C0705.0158%2C0705.1284%2C0705.2160%2C0705.3602&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Recurrence and Pólya number of quantum walks"}, "summary": "We analyze the recurrence probability (P\\'olya number) for d-dimensional\nunbiased quantum walks. A sufficient condition for a quantum walk to be\nrecurrent is derived. As a by-product we find a simple criterion for\nlocalisation of quantum walks. In contrast to classical walks, where the\nP\\'olya number is characteristic for the given dimension, the recurrence\nprobability of a quantum walk depends in general on the topology of the walk,\nchoice of the coin and the initial state. This allows to change the character\nof the quantum walk from recurrent to transient by altering the initial state.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0705.2666%2C0705.0798%2C0705.4665%2C0705.1238%2C0705.3583%2C0705.1016%2C0705.0873%2C0705.3616%2C0705.4170%2C0705.2472%2C0705.2860%2C0705.2989%2C0705.1453%2C0705.1761%2C0705.4312%2C0705.0670%2C0705.2767%2C0705.0129%2C0705.2833%2C0705.2885%2C0705.0925%2C0705.1677%2C0705.1156%2C0705.2115%2C0705.1484%2C0705.3987%2C0705.3613%2C0705.3831%2C0705.3598%2C0705.1008%2C0705.1506%2C0705.0784%2C0705.4358%2C0705.3776%2C0705.1637%2C0705.1879%2C0705.1979%2C0705.3877%2C0705.2712%2C0705.2042%2C0705.1968%2C0705.2280%2C0705.3400%2C0705.2492%2C0705.4298%2C0705.2340%2C0705.1102%2C0705.0029%2C0705.0870%2C0705.1878%2C0705.3662%2C0705.0263%2C0705.3425%2C0705.1991%2C0705.2181%2C0705.4567%2C0705.4220%2C0705.2987%2C0705.4473%2C0705.3353%2C0705.1519%2C0705.1109%2C0705.1584%2C0705.4054%2C0705.0409%2C0705.0010%2C0705.2099%2C0705.3528%2C0705.4428%2C0705.1105%2C0705.1110%2C0705.4485%2C0705.1054%2C0705.4397%2C0705.0952%2C0705.0101%2C0705.4437%2C0705.1667%2C0705.2970%2C0705.3585%2C0705.1561%2C0705.4603%2C0705.4450%2C0705.3214%2C0705.0797%2C0705.0309%2C0705.3994%2C0705.0761%2C0705.4071%2C0705.0661%2C0705.0411%2C0705.3553%2C0705.3724%2C0705.1483%2C0705.0131%2C0705.2616%2C0705.3155%2C0705.0158%2C0705.1284%2C0705.2160%2C0705.3602&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We analyze the recurrence probability (P\\'olya number) for d-dimensional\nunbiased quantum walks. A sufficient condition for a quantum walk to be\nrecurrent is derived. As a by-product we find a simple criterion for\nlocalisation of quantum walks. In contrast to classical walks, where the\nP\\'olya number is characteristic for the given dimension, the recurrence\nprobability of a quantum walk depends in general on the topology of the walk,\nchoice of the coin and the initial state. This allows to change the character\nof the quantum walk from recurrent to transient by altering the initial state."}, "authors": ["M. Stefanak", "I. Jex", "T. Kiss"], "author_detail": {"name": "T. Kiss"}, "author": "T. Kiss", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.100.020501", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0705.1991v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0705.1991v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0705.1991v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0705.1991v2", "arxiv_comment": null, "journal_reference": "Phys. Rev. Lett. 100, 020501 (2008)", "doi": "10.1103/PhysRevLett.100.020501", "fulltext": "Recurrence and Pólya number of quantum walks\nM. Štefaňák,1, 2 I. Jex,1 and T. Kiss3\n1\n\narXiv:0705.1991v2 [quant-ph] 2 Oct 2007\n\nDepartment of Physics, FJFI ČVUT, Břehová 7, 115 19 Praha 1 - Staré Město, Czech Republic\n2\nInstitute for Quantum Physics, University of Ulm, D-89069 Ulm, Germany\n3\nDepartment of Nonlinear and Quantum Optics, Research Institute for Solid State Physics and Optics,\nHungarian Academy of Sciences, Konkoly-Thege u.29-33, H-1121 Budapest, Hungary\n(Dated: October 22, 2018)\nWe analyze the recurrence probability (Pólya number) for d-dimensional unbiased quantum walks.\nA sufficient condition for a quantum walk to be recurrent is derived. As a by-product we find a\nsimple criterion for localisation of quantum walks. In contrast to classical walks, where the Pólya\nnumber is characteristic for the given dimension, the recurrence probability of a quantum walk\ndepends in general on the topology of the walk, choice of the coin and the initial state. This allows\nto change the character of the quantum walk from recurrent to transient by altering the initial state.\nPACS numbers: 03.67.-a,05.40.Fb,02.30.Mv\n\nOver the years random walks (RW) proved to be a\nuseful tool in many areas in physics as well as in other\nbranches of science [1]. Quantum analogues of random\nwalks have been proposed by Aharonov [2]. The quantum\nwalk (QW) found a promising application in quantum\ninformation for the construction of fast search algorithms\n[3], which initiated considerable effort to understand all\naspects of QWs [4]. Recently, localisation has been found\nin 2-D [5, 6, 7] and in 1-D for a generalized QW [8].\nRecurrence in the dynamics of physical systems is an\nimportant phenomenon with many far reaching consequences [9]. In the strict sense it means the periodicity\nof the system and in a broader sense it is the recurrence\nof some particular property [10]. Recurrence phenomena\nhave been studied extensively for a variety of quantum\nsystems [11]. In accordance with the terminology for the\nclassical random walks we will consider the recurrence\nprobability that the walker returns to the origin in QWs.\nIn the present paper we extend the concept of Pólya\nnumber characterizing the recurrence of RW to the quantum domain. We point out the fundamental difference\nbetween the recurrence behaviour of classical and quantum random walks. In particular, the recurrence of QWs\nis not solely determined by the dimensionality of the\nwalk, but may depend on the topology of the walk, choice\nof the coin governing the time evolution and the initial\ncoin state. Moreover, due to the intimate connection between localisation and recurrence, we find a simple criterion for the former in QWs.\nLet us consider an unbiased random walk on an infinite d-dimensional lattice starting localized at the origin\n0. The probability that the walker returns to the origin\nduring the time evolution is called the Pólya number of\nthe walk. If the Pólya number equals one, then the walk\nis called recurrent, otherwise there is a non-zero probability that the walker never returns to its starting point.\nSuch walks are transient. Pólya [12] proved that one\nand two-dimensional walks are recurrent while for higher\ndimensions the RWs are transient and a unique Pólya\n\nnumber is associated to them in each dimension [13].\nThe Pólya number of a classical random walk can be\nexpressed with the probability po (t) that the walker returns to the origin in the t-th stepPand its behaviour\n∞\ndepends solely on the infinite sum t=0 po (t). A simple criterion exists for a RW to be transient: the series\nmust converge, otherwise the walk is recurrent [14]. The\nsequence po (t) consists of positive numbers, therefore its\ndecay determines the convergence of the series, if, e.g., it\ndecays faster than t−1 it is convergent.\nThe definition of the Pólya number can be consistently\nextended for QWs by the expression\nP =1−\n\n+∞\nY\nt=1\n\n(1 − po (t)).\n\n(1)\n\nfor an ensemble of identically prepared systems, in the\nfollowing sense. Take a system and measure the position of the walker after one time step at the origin, then\ndiscard the system. Take a second, identically prepared\nsystem and let it evolve for two time steps, measure at\nthe origin, then discard the system. Continue similarly\nfor arbitrarily long evolution time. The probability that\nthe walker is found at the origin in a single series of such\nmeasurement records is the Pólya number (1). The above\ndefinition ensures that the same\nP criterion applies as in the\nclassical case: if the series ∞\nt=0 po (t) is convergent, then\nthe walk is transient, otherwise it is recurrent [15]. Since\nany interaction with a quantum system and especially a\nmeasurement unavoidably disturbs it, it is important to\nfix how measurements are performed on quantum systems when comparing to classical results (cf. definitions\nfor hitting time in graph QWs [16, 17]). One can imagine various experimental situations where quantum walks\nare observed during propagation. The definition of recurrence should then be different to reflect properly the\nphysics behind.\nLet us briefly review unbiased QWs on Zd . The\nHilbert space of the QW is given by the tensor product H = HP ⊗ HC of the position space HP = l2 (Zd )\n\n\f2\nwith the basis formed by the states |mi where m ∈ Zd\nand of the c-dimensional coin space HC . Here c is determined by the topology of the walk, in particular by the\nnumber of neighbours to which the walker can jump in\na single step. For example, the walker can jump in positive or negative direction in a single spatial dimension\n[4], which leads to c = 2d. Alternatively, it can perform\nsuch jumps in all spatial dimension simultaneously [18],\nso the coin space has the dimension c = 2d . We denote\nall displacements possible in a single step of the walk by\nthe set of shift vectors {ei |i = 1, . . . , c} and define the\northonormal basis in HC formed by the states |ei i. We\nconsider unbiased walks where\nthe shift vectors are reP\nstricted by the condition\nei = 0. The time evolution\noperator which propagates a QW by a single step reads\n\ne (k) which is possible due to the fact that by\nthe matrix U\nconstruction this matrix is unitary. Hence it has eigenvalues of the form λj (k) = exp (iωj (k)). We denote the\ncorresponding eigenvectors as vj (k). With this notation\nwe can write the state of the walker in the Fourier picture\nat time t in the form\n\u0010\n\u0011\nX\n(8)\neiωj (k)t ψ̃(k, 0), vj (k) vj (k).\nψ̃(k, t) =\n\nU = S * (IP ⊗ C) ,\n\nMoreover, in analogy with the classical problem, we consider initial states which are localized at the origin, i.e.\nψ(m, 0) = 0 for all m 6= 0. From the definition (5)\nfollows that under such restrictions the Fourier transformation of the initial condition ψ̃(k, 0) entering (8) is\nconstant and equals ψ(0, 0). Hence we find the exact expression for the probability amplitude determining the\nrecurrence behaviour of the QW\nZ\nc\nX\ndk iωj (k)t\nIj (t), Ij (t) =\nψ(0, t) =\ne\n* fj (k),\n(2π)d\nj=1\n\n(2)\n\nwhere IP denotes the unit operator on the position space\nHP , C is the coin flip operator acting on the coin state\nand the conditional step operator S is defined by\nX\n|m + ei ihm| ⊗ |ei ihei |.\n(3)\nS=\ni\n\nThe state of the QW after t steps\nX\nψi (m, t)|mi ⊗ |ei i = U t |ψ(0)i\n|ψ(t)i ≡\n\n(4)\n\nm,i\n\nis given by successive application of the operator (2) on\nthe initial state |ψ(0)i. For the above defined walk to\nbe unbiased the coin flip C must be a unitary operator\nacting on HC with all matrix\n√ elements Cij ≡ hei |C|ej i of\nthe same absolute value 1/ c. Such matrices are related\nto the Hadamard matrices [19].\nDue to the translational invariance of the QWs in consideration, the time evolution (4) is greatly simplified\nwith the help of the Fourier transformation\nX\nψ̃(k, t) ≡\nψ(m, t)ei(m*k) .\n(5)\nm\n\nHere we have defined the c-component vectors\nT\n\nψ(m, t) ≡ (ψ1 (m, t), ψ2 (m, t), . . . , ψc (m, t)) .\n\n(6)\n\nThe Fourier transformation (5) defines an isometry between l2 (Zd ) and L2 (Kd ) where K = (−π, π] can be\nthought of as the phase of a unit circle in R2 and k ∈ Kd .\nThe time evolution in the Fourier picture simplifies into\ne (k)ψ̃(k, t − 1),\nψ̃(k, t) = U\n\ne (k) ≡ D(k) * C,\nU\n\n(7)\n\nwhere the time evolution operator in the Fourier picture\ne (k) is given by the coin C and the c-dimensional diU\nagonal matrix D(k) with jth diagonal element e−iej *k ,\ndetermined by the topology of the QW. The time evolution in the Fourier picture (7) is solved by diagonalising\n\nj\n\nPerforming the inverse Fourier transformation we can obtain the probability amplitudes ψ(m, t). As we are interested in the recurrence of the QWs we need the probability that the walker returns to the origin at time t\npo (t) ≡ p(0, t) = kψ(0, t)k2 .\n\n(9)\n\nKd\n\nfj (k) = (ψ(0, 0), vj (k)) * vj (k) .\n\n(10)\n\nThe recurrence behaviour of a classical random walk is\nuniquely determined by its dimensionality. In contrast,\nfor quantum walks, as seen from (10), one has more freedom: both the initial state ψ(0, 0) and the coin, represented by the phases ωj (k) and the eigenvectors vj (k),\ncan be varied. Moreover, both ωj (k) and vj (k) are affected by the topology of the QW through the matrix\nD(k). In the following we demonstrate that the recurrence of QWs can be in fact altered by exploiting the\nadditional freedom offered by quantum mechanics.\nThe recurrence of the QW is determined by the asymptotics of (10) which can be calculated e.g. by the method\nof stationary phase [20]. Accordingly, the asymptotic behaviour of Ij (t) is only affected by the points where all\nderivatives of ωj (k) vanish (saddle points). In particular,\nit is determined by the degeneracy of the saddle points,\ngiven by the rank of the Hessian matrix, and the cardinality of the set of saddle points. The classical result [20]\nshows that if the phase ωj (k) has no saddle points then\nIj (t) decays exponentially. If ωj (k) has finitely many\nsaddle points which are non-degenerate, i.e. the second\nderivative of ωj (k) is non-vanishing, then asymptotically\nIj (t) is given by Ij (t) ∼ t−d/2 . Here we assume that\nfj (k) is smooth and non-vanishing at the saddle points.\nHowever, if the initial state ψ(0, 0) is orthogonal to some\neigenvector vj (k) then fj (k) = 0 and the corresponding\nintegral is zero. If this is true only for k corresponding to\n\n\f3\none of the saddle points then this particular saddle point\nwill not contribute to the integral Ij (t). Hence the choice\nof the initial state might change the behaviour of the QW\nfrom recurrent to transient. Moreover, we can encounter\nsituations where the phase ωj (k) does not depend explicitly on some of the variables ki or has a continuum of\nsaddle points. In such a case we can expect a slow-down\nof the decay of Ij (t).\nLet us illustrate these features on several examples.\nWe consider QWs for which the shift vectors ei have all\nentries equal to ±1, i.e. the coin space has the dimension\nc = 2d . For this particular type of QWs we find that the\ndiagonal matrix D(k) can be written as a tensor product\nD(k) = D(k1 ) ⊗ . . . ⊗ D(kd )\n\n(11)\n\nof 2 × 2 diagonal matrices D(kj ) = diag(e−ikj , eikj ).\nFirst, we present examples where the phases ωj (k)\nhave finitely many non-degenerate saddle points. As follows from the above discussion the probability po (t) behaves asymptotically like t−d where d is the dimension of\nthe walk. We start with general unbiased 1-D QW\n\u0012 iα\n\u0013\n1\ne\ne−iβ\n.\n(12)\nC(α, β) = √\niβ\n−iα\n2 e −e\ne (α, β, k) ≡ D(k) * C(α, β) has eigenvalHere the matrix U\nues λj (α, k) = ±e±iω(α,k) with the phase\nsin ω(α, k) = −\n\nsin (k − α)\n√\n.\n2\n\n(13)\n0\n\nWe find that the phase ω(α, k) has saddle points k =\nα ± π/2 and hence po (t) behaves asymptotically like\nt−1 . Moreover, the asymptotic behaviour is independent of the initial state. Indeed, no non-zero initial state\nψ(0, 0) exists which is orthogonal to both eigenvectors\nfor k 0 = α ± π/2. Comparing the decay po (t) ∼ t−1 with\nthe recurrence criterion [14] we find that all unbiased\n1-D QWs are recurrent for all initial states in concord\nwith the classical result. However, none of the QWs from\nthe class (12) exhibits localisation, since for all of them\nthe probability po (t) converges to zero. One can achieve\nlocalisation in 1-D by considering generalized QWs for\nwhich the coin has more degrees of freedom [8, 21].\nLet us now turn to 2-D QWs for which the coin factorizes into a tensor product\nC(α, β) ≡ C(α1 , β1 ) ⊗ C(α2 , β2 ),\n\n(14)\n\ni.e. we have an independent coin for each spatial dimension. From the relation (11) we find that the matrix\ne (k1 , k2 ) also has the form of a tensor product\nU\ne (k1 , k2 ) = U\ne1 (k1 ) ⊗ U\ne2 (k2 ).\nU\n\n(15)\n\nTherefore the eigenvalues λj (k) of (15) factorize into the\ne1 and U\ne2 . Hence their phases ωj (k) have\neigenvalues of U\n\nnon-degenerate saddle points and we find that po (t) behaves asymptotically like t−2 . Similarly to the 1-D case\nthis scaling is identical for all initial coin states. Hence\nwe find that all unbiased 2-D QWs driven by independent coins for each spatial dimension (14) are transient\nfor all initial states. The Pólya number of this class of\nQWs is approximately 0.29143. We note that the concept of QWs with independent coins can be extended\nto arbitrary dimension d and their Pólya numbers are\nuniquely determined by d [21]. In contrast with the classical RWs they are recurrent only for d = 1. Nevertheless,\nthe transience of d-dimensional QWs with independent\ncoins for d > 1 is not surprising when we recall that the\nQWs spread quadratically faster compared to the classical RWs. However, the probability po (t), which determines the recurrence of the walk, does not need to decay\nfaster for the QW compared to the classical RW. In fact,\nthe constructive interference can be so strong that the\nQW will exhibit localisation [6, 7, 8].\nLet us now analyze the emergence of localisation, or\nmore generally the slow-down of the decay of Ij (t). Consider the situation where ωj (k) does not depend on some\nof the variables ki , say n of them. This opens up the\npossibility that Ij (t) in (10) factorizes into the product\nof time-independent and time-dependent integrals over n\nand d − n variables. If in the reduced space of d − n dimensions a finite number of non-degenerate saddle points\nare found, then one can proceed similarly to the previous\ncase and find the asymptotic behaviour\npo (t) ∼ t−(d−n) .\n\n(16)\n\nComparing this expression with the recurrence condition\n[14] of random walks we find a sufficient condition for the\nrecurrence of QWs: at least one eigenvalue of the matrix\nC(k) should be such that its phase ωj (k) depends explicitly at most on a single variable and has a finite number\nof saddle points in the reduced space. Moreover, if ωj (k)\nis independent of k the leading order term of the probability po (t) is a constant. In the latter case po (t) has a\nnon-vanishing limit value and therefore the QW exhibits\nlocalisation for initial states being non-orthogonal to the\ncorresponding eigenvector. However, as we have already\npointed out, a given initial state ψ(0, 0) might lead to\na faster decay than (16) if it is orthogonal to all eigenvectors corresponding to such eigenvalues. Orthogonality\nmust hold at least at all the related saddle points.\nThe above discussed situation is nicely illustrated on\nthe example of the 2-D Grover walk driven by the coin\nG with the matrix elements Gm,n = 1/2 − δmn . This\nQW has been extensively studied [6, 7, 18]. It was first\nidentified numerically [6] and later proven analytically [7]\nby considering the degeneracy of the eigenvalues of the\ntransfer matrix that the Grover walk exhibits localisation\nexcept for a particular initial state\nψ(0, 0) = ψG ≡\n\n1\n(1, −1, −1, 1)T .\n2\n\n(17)\n\n\f4\ne (k) has two conFor the 2-D Grover walk the matrix U\nstant eigenvalues λ1,2 = ±1 and two of the form\nλ3,4 (k) = e±iω(k) , cos(ω(k)) = − cos k1 cos k2 .\n\n(18)\n\nHence the 2-D Grover walk exhibits localisation unless\nthe initial state is orthogonal to the eigenvectors corresponding to λ1,2 at every point k = (k1 , k2 ). The analysis\ne (k) reveals that such a\nof the eigenvectors of the matrix U\nvector is unique and equals (17). Moreover, for the particular initial state (17) the probability po (t) decays like\nt−2 , since the asymptotic behaviour is determined by the\nremaining eigenvalues λ3,4 (k) for which the phase ω(k)\nhas only non-degenerate saddle points. Therefore the 2D Grover walk is recurrent for all initial states except the\none given in (17). The numerical value of Pólya number\nfor the particular initial state (17) equals to that of the\n2-D QWs with independent coins [21]. As a generalization of the Grover walk, one can construct for arbitrary\ndimensions a QW which is recurrent [21], except for a\nsubspace of initial coin states. Moreover, this QW exhibits localisation in even dimensions.\nFinally, we consider the situation where the phase\nωj (k) has a continuum of saddle points, e.g. they align\non some curve γ. The previously discussed case of ωj (k)\nwhich does not depend on n variables can be considered\nas a particular example of this more general situation,\nsince such ωj (k) obviously has a zero derivative with respect to those n variables. The case of 2-D integrals with\ncurves of stationary points are treated in [20] where it\nis shown that the continuum of stationary points slowsdown the decay of such integrals to t−1/2 . Similar results\ncan be expected for higher dimensional saddle domains,\nhowever, much less is known about the stationary phase\nmethod for that case.\nThe recurrence of the 2-D Fourier walk can be analyzed\nalong these lines. It is driven by the coin F with the\nmatrix elements\nFm,n =\n\n1\nexp [iπ(m − 1)(n − 1)/2].\n2\n\n(19)\n\nHere we find that all four phases ωj (k) of the time evoe (k) have saddle\nlution operator in the Fourier picture U\n0\n0\npoints at k1 = π/4, −3π/4 and k2 = ±π/2 and ω1,2 (k)\nhave two saddle lines γ1 = (k1 , 0) and γ2 = (k1 , π) [21].\nHence po (t) behaves asymptotically like t−1 and the 2-D\nFourier walk is recurrent, except for the subspace\nT\n\nψF (a, b) = (a, b, a, −b) ,\n\n2|a|2 + 2|b|2 = 1,\n\n(20)\n\nof the initial states which are orthogonal to the eigenvectors v1,2 (k) for k ∈ γ1,2 . For the initial states of the\nfamily (20) we find the asymptotic behaviour po (t) ∼ t−2\nimplying that the walk is transient. This corresponds to\nthe absence of the central spikes in the spatial distribution, as it was found numerically for a special case in [6].\nThe value of the Pólya number for the family (20) can be\n\nvaried by the complex parameters a and b of the initial\nstate [21].\nTo conclude, we have extended the concept of Pólya\nnumber to QWs in order to characterize their recurrence\nproperties. Our main result is that, unlike in the classical\ncase, recurrence for QWs can depend not only on the\ndimensionality of the lattice but also on the topology\nof the walk, choice of the coin operator and the initial\nstate. We have formulated sufficient conditions for the\nrecurrence and localisation of QWs. The present study of\nthe recurrence and Pólya number based on the properties\ne (k) can be extended to higher dimensional\nof the matrix U\nQWs where additional interesting effects can be expected\n[21]. The explicit dependence of the QW on the coin and\nthe initial coin state opens up the possibility to design\nthe value of the Pólya number.\nM. Š. thanks W. P. Schleich for stimulating discussions. The financial support by MSM 6840770039,\nMŠMT LC 06002, the Czech-Hungarian cooperation\nproject (KONTAKT,CZ-2/2005), by the Hungarian Scientific Research Fund (T049234) and EU project QUELE\nis gratefully acknowledged. Moreover, M. Š. is grateful\nfor financial support from the EU in the framework of\nCONQUEST.\n\n[1] see e.g. N. Guillotin-Plantard, R. Schott, Dynamic Random Walks: Theory and Application, Elsevier, Amsterdam (2006)\n[2] Y. Aharonov, et. al., Phys. Rev. A 48, 1687 (1993)\n[3] N. Shenvi, et. al., Phys. Rev. A 67, 052307 (2003)\n[4] G. Grimmett, et. al., Phys. Rev. E 69, 026119 (2004)\n[5] T. A. Brun, et. al., Phys. Rev. A 67, 052317 (2003)\n[6] B. Tregenna et al., New J. Phys. 5, 83.1-83.19 (2003)\n[7] N. Inui, et. al., Phys. Rev. A 69, 052323 (2004)\n[8] N. Inui, et. al., Phys. Rev. E 72, 056112 (2005)\n[9] S. Chandrasekhar, Rev. Mod. Phys. 15, 1 (1943)\n[10] A. Peres, Phys. Rev. Lett. 49, 1118 (1982)\n[11] R. W. Robinett, Phys. Rep. 392, 1 (2004)\n[12] G. Pólya, Mathematische Annalen 84, 149 (1921)\n[13] B. D. Hughes, Random walks and random environments,\nVol. 1: Random walks, Oxford University Press, Oxford\n(1995)\n[14] P. Révész, Random walk in random and non-random environments, World Scientific, Singapore (1990)\n[15] V. Jarnı́k, Diferenciálnı́ počet II, Academia, Prague\n(1976), p. 121\n[16] H. Krovi and T. A. Brun, Phys. Rev. A 75, 062332 (2007);\nPhys. Rev. A 73, 032341 (2006)\n[17] J. Kempe, Probability Theory and Related Fields, Vol.\n133 (2), p. 215-235 (2005)\n[18] T. D. Mackay et al., J. Phys. A 35, 2745 (2002)\n[19] see e.g. W. Tadej and K. Zyczkowski, Open Syst. Inf.\nDyn. 13, 133 (2006)\n[20] R. Wong, Asymptotic Approximations of Integrals,\nSIAM, Philadelphia (2001)\n[21] M. Štefaňák, T. Kiss and I. Jex, unpublished (2007)\n\n\f"}