{"id": "http://arxiv.org/abs/0907.0327v1", "guidislink": true, "updated": "2009-07-02T09:56:45Z", "updated_parsed": [2009, 7, 2, 9, 56, 45, 3, 183, 0], "published": "2009-07-02T09:56:45Z", "published_parsed": [2009, 7, 2, 9, 56, 45, 3, 183, 0], "title": "Towards an Asymptotic-Safety Scenario for Chiral Yukawa Systems", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.0181%2C0907.5541%2C0907.4850%2C0907.4109%2C0907.2113%2C0907.3053%2C0907.0200%2C0907.3811%2C0907.2329%2C0907.4560%2C0907.0107%2C0907.0882%2C0907.2312%2C0907.2157%2C0907.2271%2C0907.0161%2C0907.5411%2C0907.1216%2C0907.5276%2C0907.4873%2C0907.3037%2C0907.4374%2C0907.2007%2C0907.1002%2C0907.1693%2C0907.1289%2C0907.0731%2C0907.5561%2C0907.0917%2C0907.4487%2C0907.4641%2C0907.2644%2C0907.2427%2C0907.5337%2C0907.1025%2C0907.2636%2C0907.4067%2C0907.4057%2C0907.1011%2C0907.3560%2C0907.1600%2C0907.5136%2C0907.5444%2C0907.0975%2C0907.3235%2C0907.3083%2C0907.1077%2C0907.4021%2C0907.1480%2C0907.2438%2C0907.2435%2C0907.1221%2C0907.3419%2C0907.0576%2C0907.1822%2C0907.0719%2C0907.1071%2C0907.3478%2C0907.4482%2C0907.1251%2C0907.1360%2C0907.0002%2C0907.5549%2C0907.0196%2C0907.1390%2C0907.4355%2C0907.2550%2C0907.1316%2C0907.0949%2C0907.5016%2C0907.3431%2C0907.4142%2C0907.0711%2C0907.1646%2C0907.3575%2C0907.4265%2C0907.0110%2C0907.5349%2C0907.4588%2C0907.1554%2C0907.3554%2C0907.5590%2C0907.0437%2C0907.5551%2C0907.3542%2C0907.3424%2C0907.1297%2C0907.1909%2C0907.1141%2C0907.0327%2C0907.0725%2C0907.0858%2C0907.0232%2C0907.0916%2C0907.4448%2C0907.1306%2C0907.1576%2C0907.1979%2C0907.4524%2C0907.2590%2C0907.4698&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Towards an Asymptotic-Safety Scenario for Chiral Yukawa Systems"}, "summary": "We search for asymptotic safety in a Yukawa system with a chiral\n$U(N_L)_L\\otimes U(1)_R$ symmetry, serving as a toy model for the\nstandard-model Higgs sector. Using the functional RG as a nonperturbative tool,\nthe leading-order derivative expansion exhibits admissible non-Ga\\ssian\nfixed-points for $1 \\leq N_L \\leq 57$ which arise from a conformal threshold\nbehavior induced by self-balanced boson-fermion fluctuations. If present in the\nfull theory, the fixed-point would solve the triviality problem. Moreover, as\none fixed point has only one relevant direction even with a reduced hierarchy\nproblem, the Higgs mass as well as the top mass are a prediction of the theory\nin terms of the Higgs vacuum expectation value. In our toy model, the fixed\npoint is destabilized at higher order due to massless Goldstone and fermion\nfluctuations, which are particular to our model and have no analogue in the\nstandard model.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.0181%2C0907.5541%2C0907.4850%2C0907.4109%2C0907.2113%2C0907.3053%2C0907.0200%2C0907.3811%2C0907.2329%2C0907.4560%2C0907.0107%2C0907.0882%2C0907.2312%2C0907.2157%2C0907.2271%2C0907.0161%2C0907.5411%2C0907.1216%2C0907.5276%2C0907.4873%2C0907.3037%2C0907.4374%2C0907.2007%2C0907.1002%2C0907.1693%2C0907.1289%2C0907.0731%2C0907.5561%2C0907.0917%2C0907.4487%2C0907.4641%2C0907.2644%2C0907.2427%2C0907.5337%2C0907.1025%2C0907.2636%2C0907.4067%2C0907.4057%2C0907.1011%2C0907.3560%2C0907.1600%2C0907.5136%2C0907.5444%2C0907.0975%2C0907.3235%2C0907.3083%2C0907.1077%2C0907.4021%2C0907.1480%2C0907.2438%2C0907.2435%2C0907.1221%2C0907.3419%2C0907.0576%2C0907.1822%2C0907.0719%2C0907.1071%2C0907.3478%2C0907.4482%2C0907.1251%2C0907.1360%2C0907.0002%2C0907.5549%2C0907.0196%2C0907.1390%2C0907.4355%2C0907.2550%2C0907.1316%2C0907.0949%2C0907.5016%2C0907.3431%2C0907.4142%2C0907.0711%2C0907.1646%2C0907.3575%2C0907.4265%2C0907.0110%2C0907.5349%2C0907.4588%2C0907.1554%2C0907.3554%2C0907.5590%2C0907.0437%2C0907.5551%2C0907.3542%2C0907.3424%2C0907.1297%2C0907.1909%2C0907.1141%2C0907.0327%2C0907.0725%2C0907.0858%2C0907.0232%2C0907.0916%2C0907.4448%2C0907.1306%2C0907.1576%2C0907.1979%2C0907.4524%2C0907.2590%2C0907.4698&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We search for asymptotic safety in a Yukawa system with a chiral\n$U(N_L)_L\\otimes U(1)_R$ symmetry, serving as a toy model for the\nstandard-model Higgs sector. Using the functional RG as a nonperturbative tool,\nthe leading-order derivative expansion exhibits admissible non-Ga\\ssian\nfixed-points for $1 \\leq N_L \\leq 57$ which arise from a conformal threshold\nbehavior induced by self-balanced boson-fermion fluctuations. If present in the\nfull theory, the fixed-point would solve the triviality problem. Moreover, as\none fixed point has only one relevant direction even with a reduced hierarchy\nproblem, the Higgs mass as well as the top mass are a prediction of the theory\nin terms of the Higgs vacuum expectation value. In our toy model, the fixed\npoint is destabilized at higher order due to massless Goldstone and fermion\nfluctuations, which are particular to our model and have no analogue in the\nstandard model."}, "authors": ["Holger Gies", "Stefan Rechenberger", "Michael M. Scherer"], "author_detail": {"name": "Michael M. Scherer"}, "author": "Michael M. Scherer", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1140/epjc/s10052-010-1257-y", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0907.0327v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0907.0327v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "16 pages, 8 figures", "arxiv_primary_category": {"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-th", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0907.0327v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0907.0327v1", "journal_reference": "Eur.Phys.J.C66:403-418,2010", "doi": "10.1140/epjc/s10052-010-1257-y", "fulltext": "Towards an Asymptotic-Safety Scenario for Chiral Yukawa Systems\nHolger Gies, Stefan Rechenberger and Michael M. Scherer\n\narXiv:0907.0327v1 [hep-th] 2 Jul 2009\n\nTheoretisch-Physikalisches Institut, Friedrich-Schiller-Universität Jena, Max-Wien-Platz 1, D-07743 Jena, Germany\nE-mail: holger.gies@uni-jena.de, michael.scherer@uni-jena.de, stefan.rechenberger@uni-jena.de\nWe search for asymptotic safety in a Yukawa system with a chiral U(NL )L ⊗U(1)R symmetry,\nserving as a toy model for the standard-model Higgs sector. Using the functional RG as a nonperturbative tool, the leading-order derivative expansion exhibits admissible non-Gaussian fixed-points\nfor 1 ≤ NL ≤ 57 which arise from a conformal threshold behavior induced by self-balanced bosonfermion fluctuations. If present in the full theory, the fixed-point would solve the triviality problem.\nMoreover, as one fixed point has only one relevant direction even with a reduced hierarchy problem,\nthe Higgs mass as well as the top mass are a prediction of the theory in terms of the Higgs vacuum\nexpectation value. In our toy model, the fixed point is destabilized at higher order due to massless\nGoldstone and fermion fluctuations, which are particular to our model and have no analogue in the\nstandard model.\nI.\n\nINTRODUCTION\n\nThe Higgs sector is a crucial building block of the standard model of particle physics and parameterizes the\nmasses of matter fields and weak gauge bosons. This\nsuccessful parameterization goes along with two problems of the standard model which give rise to the belief\nthat the standard model should be embedded in a larger\nfundamental framework: the hierarchy problem and the\ntriviality problem. These problems have initiated many\nfurther developments.\nThe triviality problem renders the theory ill-defined\nfrom a fundamental point of view, since it inhibits an\nextension of the standard model to arbitrarily high momentum scales [1, 2, 3, 4, 5, 6]. The scale of the maximum ultra-violet (UV) extension ΛUV,max induced by\ntriviality is expected to be related to the Landau pole of\nperturbation theory. Of course, the Landau pole, i.e., the\ndivergence of a perturbative running coupling at a finite\nUV scale, in the first place signals the breakdown of perturbation theory. Near the Landau pole, nonperturbative\nphysics can set in and severely modify the picture. So,\na study of the triviality problem and the existence of a\nfinite ΛUV,max therefore requires a nonperturbative tool.\nThis has also inspired a number of lattice investigations\nof scalar and chiral Yukawa systems [7, 8, 9, 10].\nWhereas the triviality problem is a true conceptual\nproblem of the standard model, the hierarchy problem,\ni.e., the possible existence of a huge difference between\nthe electroweak scale and an underlying fundamental\nscale such as the GUT or the Planck scale, is only a\nproblem of unnaturally fine-tuned initial conditions (in\nthis case of the mass parameter in the Higgs potential at\nthe underlying scale).\nSolutions to these two problems are often sought by\nintroducing field theories with new degrees of freedom\nor higher symmetries or by going beyond quantum field\ntheory. The guiding principle of this work is more conservative, as we intend to identify (or rule out) possible solutions within quantum field theory essentially using the same or very similar degrees of freedom of the\nstandard model. Quantum field theory indeed offers\n\na framework for such solutions in terms of Weinberg's\nasymptotic safety scenario [11, 12, 13], which has already been investigated in a variety of models ranging\nfrom four-fermion models [14, 15, 16], simple Yukawa\nsystems [17], nonlinear sigma models in d > 2 [18], and\nextra-dimensional gauge theories [19] to gravity [20, 21].\nFor the asymptotic-safety scenario to apply, a fixed point\nof the renormalization group (RG) flow in the space of\ncouplings has to exist. If the system sits on an RG trajectory that hits the fixed point in the UV, the UV cutoff\ncan safely be taken to infinity, and the theory can remain\nvalid to arbitrarily short distance scales.\nIn fact, a suitable fixed point has recently been identified in a Z2 -symmetric Yukawa system [17], serving as\na simple toy model for the top-Higgs sector of the standard model. Moreover, a generic mechanism inducing\nsuch a fixed point has been proposed which relies on\na conformal behavior of the Higgs vacuum expectation\nvalue (vev). This conformal-vev mechanism is generated\nby a dynamical self-balancing of bosonic and fermionic\ndegrees of freedom in the UV. In the simple Z2 model,\nthis balancing actually occurs only for small fractional\nflavor number Nf . 0.3. This observation is a strong motivation to consider more realistic Yukawa systems and\nto explore the potential of the conformal-vev mechanism\nfor the UV problems of the standard model. Another\nscenario to circumvent the problem of triviality in such\na Z2 -symmetric Yukawa system in the same framework\noccurs by coupling the system to a gravitational background [22].\nThis work is devoted to an investigation of a chiral\nU (NL )L ⊗ U (1)R Yukawa model, serving as a more sophisticated toy-model for the Higgs sector of the standard model (or of a GUT-like theory). The model is\ndesigned to have a left-handed chiral sector as is typical\nfor the Higgs sector of the standard model. The number of left-handed fermions NL is left as a free parameter\nin order to study the dependence of a potential fixed\npoint on the varying numbers of degrees of freedom. As\nwill be demonstrated by our analysis, this chiral structure facilitates a more boson-dominated Higgs vacuum\nexpectation value which is a prerequisite for conformal-\n\n\f2\nvev mechanism to work. Using the functional RG as a\nnonperturbative approach, we systematically search for\nthe existence of non-Gaussian interacting fixed points of\nthe RG flow which could allow for an extension of the\nmodel to arbitrarily high momentum scales and render\nthe system asymptotically safe.\nA particularly attractive by-product of an asymptotically safe Higgs sector is given by the fact that the\nnumber of physical parameters is dictated by the number of RG-relevant directions at the fixed point and is\nthus an inherent property of the model. As this number can actually be smaller than the corresponding one\nat the Gaussian fixed point (defining the \"perturbative\"\nstandard model), asymptotic safety can lead to a reduction of physical parameters and hence have more predictive power. For instance, the interacting fixed point\nin the Z2 -invariant toy model has one relevant direction\nless than the perturbative fixed point. As an immediate consequence, the value of the Higgs mass becomes\na prediction once the Higgs vev and the top mass are\nfixed. For a fixed point of our chiral model discussed in\nthis work, even the top mass can become a prediction,\ndemonstrating the predictive and constraining power of\nthe asymptotic safety scenario.\nA crucial question for all nonperturbative techniques is\nthe systematic consistency and reliability of the results.\nIn this work, we compute the RG flow of the model in a\nsystematic derivative expansion of the effective action.\nThis expansion is controlled if the momentum dependence of full effective vertices takes only little influence\non the flow. A direct means for measuring this influence\nis the size of the anomalous dimensions η of the fields,\nsince next-to-leading order contributions couple to the\nleading-order derivative expansion only via terms ∼ η.\nMonitoring the size of η thus gives us a direct estimate\nof the reliability of our results. Whereas the anomalous\ndimensions at the fixed point of the Z2 model were indeed\nfound to be small, the anomalous dimensions at the fixed\npoint of the present model can become large. Hence, the\nresults within the present model have to be taken with\na grain of salt. The reason for the difference between\nthe two models lies in the existence of Goldstone bosons\nas well as massless fermions in the present model which\ncontribute dominantly to the anomalous dimensions. As\nthese massless modes are not present in the standard\nmodel, we expect that the leading-order derivative expansion (where η = 0) of the present system can serve as\na model for the Higgs-Yukawa sector of a more realistic\ngauged version. From this viewpoint, the essential idea\nto have a non-Gaussian fixed point works and provides us\nwith a highly predictive theory.\nThis paper is organized as follows: in Sect. II, we summarize the essence of the conformal-vev mechanism and\nintroduce the concept of asymptotic safety. Sect. III discusses the nonperturbative construction of the effective\naction in terms of the functional RG. The fact that the\nresulting flow equations do not support asymptotic safety\nin the symmetric regime is briefly elucidated in Sect. IV.\n\nIn Sect. V, the regime of spontaneous symmetry breaking\nis explored to leading order, revealing non-Gaussian fixed\npoints with physically appealing properties. The resulting predictive power of the asymptotic-safety scenario is\ndescribed in Sect. VI. Sect. VII summarizes the problems\nof the present toy-model occurring at next-to-leading order in the derivative expansion. Conclusions are drawn\nin Sect. VIII. Technical details on the derivation of the\nflow equations are given in the appendices.\nII.\n\nAN ASYMPTOTIC-SAFETY SCENARIO\nFOR YUKAWA SYSTEMS\nA.\n\nConformal vacuum expectation value\n\nThe model building of the present work is strongly\nmotivated by qualitative considerations about the loop\ncontributions to the running of the dimensionless version\nof the bosonic field expectation value v in the regime of\nspontaneous symmetry breaking (SSB) where v > 0. Our\ncentral idea is that the contributions with opposite sign\nfrom bosonic and fermionic fluctuations to the vev can\nbe balanced such that the vev exhibits a conformal behavior, v ≡ hφi ∼ k. Here, k is the scale at which we\nconsider the couplings of the system. The dimensionless\nsquared vev κ = 21 v 2 /k 2 has a flow equation of the form\n∂t κ ≡ ∂t\n\nv2\nd\n= −2κ + interaction terms, ∂t = k . (1)\n2\n2k\ndk\n\nIf the interaction terms are absent, the Gaussian fixed\npoint κ = 0 is the only conformal point, corresponding to a free massless theory. If the interaction terms\nare nonzero, e.g., if the couplings approach interacting\nfixed points by themselves, the sign of these terms decides about a possible conformal behavior. A positive\ncontribution from the interaction terms gives rise to a\nfixed point at κ > 0 which can control the conformal\nrunning over many scales. If they are negative, no physically acceptable conformal vev is possible. Since fermions\nand bosons contribute with opposite signs to the interaction terms, the existence of a fixed point κ∗ > 0 crucially depends on the relative strength between bosonic\nand fermionic fluctuations. More specifically, the bosons\nhave to win out over the fermions.\nIn Fig. 1 (taken from [17]), we sketch various options\nfor the flow of the dimensionless squared vev κ. The\nsolid line depicts the free massless theory with a trivial\nGaussian fixed point at κ = 0 . If the fermions dominate,\nthe interaction terms are negative and the fixed point is\nshifted to negative values (being irrelevant for physics),\ncf. dotted line. If the bosonic fluctuations dominate, the\nκ flow develops a non-Gaussian fixed point at positive\nvalues κ∗ > 0. This can support a conformal behavior\nover many orders of magnitude, cf. dashed line. This\nfixed point is UV attractive, implying that the vev is a\nrelevant operator near the fixed point. If the interaction\nterms are approximately κ independent, the slope of ∂t κ\n\n\f3\na\nψL\n\n∂t κ\n\nφb\nφa\nφa\n\nκ∗\nfermionic fluctuations\ndomintate\n\nκ\nbosonic fluctuations\ndomintate\n\nFIG. 1: Sketch of the flow of the dimensionless squared Higgs\nvacuum expectation value κ as described in the text below.\n\nnear the fixed point is still close to −2, corresponding\nto a critical exponent Θ ≃ 2 and a persistent hierarchy\nproblem. An improvement of \"naturalness\" could arise\nfrom a suitable κ dependence of the interaction terms\nthat results in a flattening of the κ flow near the fixed\npoint, cf. dot-dashed line. Whether or not this happens\nin a specific model is a prediction of the theory which\nneeds to be deduced from the theory by nonperturbative\nmethods.\nIn this work, we construct a model with standardmodel-like symmetries along this line of research. We\nintroduce NL left-handed fermion species ψLa (a ∈\n{1, ..., NL }) and one right-handed fermion ψR , as well\nas NL complex bosons φa . All fields live in the fundamental representation of the left-handed chiral symmetry group U(NL )L . The Yukawa coupling is then realized\nby a term h̄(ψ̄R φa† ψLa − ψ̄La φa ψR ). This chiral Yukawa\nsystem mimics the coupling between the standard-model\nHiggs scalar and the left- and right-handed components\nof the top quark, also involving Yukawa couplings to the\nleft-handed bottom (for NL = 2) and further bottomlike quarks (for NL > 2) in the same family. If the scalar\nfield develops a vev upon symmetry breaking, the top\nquark acquires a Dirac mass, whereas the bottom-type\nquarks remain massless (similar to neutrinos in the standard model). For NL = 2, we ignore the Yukawa coupling\n∼ ψ̄R ǫab φa† ψLb in our model, which provides for a mass\nterm for the bottom quark in the standard model, since\nit does not generalize to other NL .\nIn comparison to left-right symmetric models, this\nmodel has an interesting new feature concerning the relative weight of the boson interaction terms contributing to\nthe renormalization of the dimensionless vev κ (see figure 2): diagrammatically speaking, the inner structure\nof fermion/boson components in the fermion loop for a\nspecific choice of external boson legs is fully determined.\nOn the other hand, the boson loop obtains contributions\nfrom all NL components and so is linear in NL . In this\nway, NL serves as a control parameter for boson dominance and for the potential existence of a non-Gaussian\nfixed point. Already at this qualitative level of the discussion, it is worthwhile to stress that the standard model\nhas such a left-right asymmetric structure which can sup-\n\nλ2\n\nh\n\nφa\n\nh\n\nφa\n\nψR\n\nFIG. 2: Loop contributions to the renormalization flow of\nthe vev. The left loop involves only inner boson lines. The\nvertex λ2 allows for a coupling between all available boson\ncomponents. This implies a linear dependence on NL for the\nrenormalization of the boson contribution, see below. On the\nright panel, we depict the corresponding fermion loop contribution. The incoming boson φa fully determines the structure\nof the fermion loop and does not allow for other left-handed\ninner fermions than ψLa , inhibiting an NL dependence of the\nalgebraic weight of this loop.\n\nport the conformal-vev fixed point.\nB.\n\nFlow equation and asymptotic safety\n\nIn the asymptotic-safety scenario of a quantum field\ntheory, the microscopic action to be quantized is a priori\nunknown. A construction of a renormalizable theory is\npossible if a suitable fixed point exists in the space of\nall possible action functionals, i.e., in theory space. This\ntheory space is spanned by all possible operators which\ncan be constructed from the chosen degrees of freedom\nand which are compatible with the desired symmetries.\nIf such a fixed point exists the microscopic action to be\nquantized can be constructed from the properties of the\nfixed point and thus is a prediction itself.\nThe framework for a nonperturbative construction of\nrenormalizable field theories is provided by the functional\nRG which can be formulated in terms of a flow equation\nfor the effective average action Γk , the Wetterich equation [23]:\n∂t Γk [Φ] =\n\n1\n(2)\nSTr{[Γk [Φ] + Rk ]−1 (∂t Rk )}.\n2\n\n(2)\n\n(2)\n\nHere, Γk [Φ] is the second functional derivative with respect to the field Φ, the latter representing a collective\nfield variable for all bosonic or fermionic degrees of freedom, and Rk denotes a momentum-dependent regulator\nfunction that suppresses IR modes below a momentum\nscale k. The solution of the Wetterich equation provides\nan RG trajectory in theory space, interpolating between\nthe bare action SΛ to be quantized Γk→Λ → SΛ and the\nfull quantum effective action Γ = Γk→0 , being the generating functional of 1PI correlation functions; for reviews,\nsee [24].\nThe effective average action Γk can be parameterized\nby a possibly infinite set of generalized dimensionless couplings gi . Then, the Wetterich equation provides us with\nthe flow of these couplings ∂t gi = βgi (g1 , g2 , . . . ). A fixed\npoint gi∗ is defined by\nβi (g1∗ , g2∗ , ...) = 0 ∀ i .\n\n(3)\n\n\f4\nThe fixed point is non-Gaussian, if at least one fixed-point\ncoupling is nonzero gj∗ 6= 0. If the RG trajectory flows\ninto a fixed point in the UV, the UV cutoff can safely\nbe taken to infinity and the theory can be considered as\nfundamental.\nIn addition to being fundamental, we also want the\ntheory to be predictive. For this, let us consider the\nfixed-point regime, where the flow can be linearized,\n∂t gi = Bi j (gj∗ − gj ) + . . . ,\n\nBi j =\n\n∂βgi\n∂gj\n\ng=g∗\n\n.\n\n(4)\n\nThe critical exponents ΘI correspond to the negative of\nthe eigenvalues of the stability matrix Bi j . They allow\nfor a classification of physical parameters: Whereas all\neigendirections with ΘI < 0 die out towards the IR and\nthus are irrelevant, all relevant directions with ΘI > 0\nincrease towards the IR and thus determine the macroscopic physics (for the marginal directions ΘI = 0, it depends on the higher-order terms in the expansion about\nthe fixed point). Hence the number of relevant and\nmarginally-relevant directions determines the number of\nphysical parameters to be fixed. The theory is predictive\nif this number is finite. In the case of the Gaussian fixed\npoint gi∗ = 0, the present construction corresponds to\nthe standard perturbative power-counting analysis and\nthe critical exponents are equal to the power counting\ndimensions of the couplings.\nIf a critical exponent is much larger than zero, say of\nO(1), the RG trajectory rapidly leaves the fixed-point\nregime towards the IR. Therefore, separating a typical\nUV scale where the system is close to the fixed point from\nthe IR scales where, e.g., physical masses are generated\nrequires a significant fine-tuning of the initial conditions.\nFor the flow towards the IR, the linearized fixed-point\nflow Eq. (4) generally is insufficient and the full nonlinear β functions have to be taken into account. Even the\nparameterization of the effective action in terms of the\nsame degrees of freedom in the UV and IR might be inappropriate. Nevertheless, we use the same bosonic and\nfermionic degrees of freedom on all scales in the present\nwork, since we specifically want to address the question\nwhether standard-model IR degrees of freedom can have\nan interacting UV completion.\n\nleading order\nΓk =\n\nZ\n\nn\ndd x i(ZL,k ψ̄La ∂/ψLa + ZR,k ψ̄R ∂/ψR )\n\n+Zφ,k (∂μ φa† )(∂ μ φa ) + Uk (φa† φa )\no\n+h̄k ψ̄R φa† ψLa − h̄k ψ̄La φa ψR .\n\nThe fermion fields ψLa and ψR have standard kinetic terms\nbut can acquire different wave function renormalizations\nZL,k and ZR,k . The index a runs from 1 to NL . The projections on the left-/right-handed fermion contributions\nare carried out via the projection operators\nPL/R =\n\n1\n(1 ± γ5 ) .\n2\n\nRENORMALIZATION FLOW OF CHIRAL\nYUKAWA SYSTEMS\nA.\n\nDerivative expansion\n\nIn the present work, we investigate a Yukawa theory\nwith chiral fermions including one right-handed fermion\nand NL left-handed fermions. The fermions are coupled\nto NL complex bosons via a simple Yukawa interaction.\nWe span the theory space by a truncated action functional in a derivative expansion, which reads at next-to-\n\n(6)\n\nThe bosonic sector involves a standard kinetic term with\nwave function renormalization Zφ,k and an effective potential Uk (φa† φa ). Defining the invariant ρ := φa† φa , the\neffective potential Uk (ρ) can be expanded in powers of ρ.\nThe bosons can also be expressed in terms of a real field\nbasis by defining\n1\nφa = √ (φa1 + iφa2 ),\n2\n\nR\n\n1\nφa† = √ (φa1 − iφa2 ) ,\n2\n\n(7)\n\nwhere φa1 , φa2 ∈\n. The truncated effective action\n(5) including the Yukawa interaction is invariant under\nU(NL )L transformations of the left-handed fermion and\nthe boson as well as U(1)R transformations of the righthanded fermion and the boson.\nAll the parameters in the effective average action are\nunderstood to be scale dependent, which is indicated by\nthe index k.\nThe flow of the wave function renormalizations\nZφ,k , ZL,k and ZR,k can be expressed in terms of scaledependent anomalous dimensions\nηφ = −∂t lnZφ,k , ηL,R = −∂t lnZL,R,k .\n\n(8)\n\nSetting the anomalous dimensions to zero defines the\nleading-order derivative expansion. At next-to-leading\norder, it is important to distinguish between ZL,k and\nZR,k as they acquire different loop contributions, see below.\nIn order to fix the standard RG invariance of field\nrescalings, we define the renormalized fields as\n1/2\n\nIII.\n\n(5)\n\n1/2\n\nφ̃ = Zφ,k φ, ψ̃L,R = ZL,R ψL,R .\n\n(9)\n\nFor the fixed-point search, it is useful to introduce dimensionless renormalized quantities\nρ̃ = Zφ,k k 2−d ρ,\nh2k\n\n=\n\nuk (ρ̃) =\n\n−1 −1 −1 d−4 2\nh̄k ,\nZφ,k\nZL,k ZR,k k\n−d\nk Uk (ρ)|ρ=kd−2 ρ̃/Zφ,k .\n\n(10)\n(11)\n(12)\n\nDetailed information about the derivation of the flow\nequations for this truncation in arbitrary spacetime dimensions d is given in App. B. For our purposes, we use\n\n\f5\na linear regulator function Rk which is optimized for the\npresent truncation [25]. The flow of the effective potential in terms of threshold functions which are given in\nApp. A reads\n∂t uk = −duk + ρ̃u′k (d − 2 + ηφ )\n\b\n+ 2vd (2NL − 1)l0d (u′k ) + l0d (u′k + 2ρ̃u′′k )\n\nwhere the primes denote derivatives with respect to ρ̃,\nand vd = 1/(2d+1π d/2 Γ(d/2)). For the symmetric phase\n(SYM), we expand the effective potential around zero\nfield,\nNp\nX\nλn,k n\nλ2,k 2 λ3,k 3\nρ̃ = m2k ρ̃ +\nρ̃ +\nρ̃ + ....(14)\nn!\n2!\n3!\nn=1\n\nFor the SSB phase, where the minimum of the effective\npotential uk acquires a nonzero value κk := ρ̃min > 0,\nwe use the expansion\nuk\n\nNp\nX\nλn,k\n(ρ̃ − κk )n\n=\nn!\nn=2\n\n=\n\n0 = ∂t u′k (κk ) = ∂t u′k (ρ̃)|ρ̃=κk + (∂t κk )u′′k (κk )\n1\n∂t u′k (ρ̃)|ρ̃=κk .\n(16)\n⇒ ∂t κk = − ′′\nuk (κk )\n\n(13)\n\n\u0001\n(F)d\n(F)d\n(F)d\n− dγ (NL − 1)l0,L (0) + l0,L (ρ̃h2k ) + l0,R (ρ̃h2k ) ,\n\nuk =\n\nflow equation and a comparison of coefficients. For the\nflow of κk , we use the fact that the first derivative of uk\nvanishes at the minimum, u′k (κk ) = 0. This implies\n\n(15)\n\nλ2,k\nλ3,k\n(ρ̃ − κk )2 +\n(ρ̃ − κk )3 + ...\n2!\n3!\n\nGiven the flow of uk (13), the flows of m2k or λn,k in\nboth phases can be read off from an expansion of the\n\nThe explicit flow equations for the running parameters\nwill be given in the following sections for the SYM and\nthe SSB phase separately. Note that the expansion coefficients λn,k in Eqs. (14) and (15) are not identical.\nSince there is little risk that the notation of the different regimes interferes with each other, we refrain from\nintroducing different symbols.\nIn the SSB regime, the flow of the Yukawa coupling\nand the scalar anomalous dimension for the Goldstone\nmode can, in principle, be different from that of the radial\nmode. As the Goldstone modes as such are not present\nin the standard model, we compute the Yukawa coupling\nand the scalar anomalous dimension by projecting the\nflow onto the radial scalar operators in the SSB regime.\nNote that this strategy is different from that used for\ncritical phenomena in other Yukawa or bosonic systems,\nwhere the Goldstone modes can dominate criticality.\nAccordingly, the flow of the Yukawa coupling hk can\nbe derived (see App. C), and we end up with\n\nn\n(FB)d\n(FB)d\n(ρ̃h2k , u′k + 2ρ̃u′′k ) (17)\n∂t h2k = (d − 4 + ηφ + ηL + ηR )h2k + 4vd h4k (2ρ̃u′′k )l1,2 (ρ̃h2k , u′k ) − (6ρ̃u′′k + 4ρ̃2 u′′′\nk )l1,2\no\n(FB)d\n(FB)d\n(FB)d\n(FB)d\n−l1,1 (ρ̃h2k , u′k ) + l1,1 (ρ̃h2k , u′k + 2ρ̃u′′k ) + 2ρ̃h2k l2,1 (ρ̃h2k , u′k ) − 2ρ̃h2k l2,1 (ρ̃h2k , u′k + 2ρ̃u′′k ) .\n\nFinally, we list the expressions for the anomalous dimensions\n\n(2NL − 1)8vd ′′2 d ′\n8vd\n2 d\n′\n′′\nρ̃(3u′′k + 2ρ̃u′′′\nρ̃uk m22 (uk )\nk ) m22 (uk + 2ρ̃uk ) +\nd\nd\n8vd dγ 4 (F)4\n8vd dγ 2 (F)4\nhk m4 (ρ̃h2k ) +\nρ̃hk m2 (ρ̃h2k ),\n+\nd\nd\n8vd 2 (FB)d\n(FB)d\nh [m\n(ρ̃h2k , u′k + 2ρ̃u′′k ) + m12 (ρ̃h2k , u′k )],\n=\nd k 12\n8vd 2 (FB)d\n(FB)d\n(FB)d\n=\nh [m\n(ρ̃h2k , u′k + 2ρ̃u′′k ) + m12 (ρ̃h2k , u′k ) + 2(NL − 1)m12 (0, u′k )].\nd k 12\n\nηφ =\n\n(18)\n\nηL\n\n(19)\n\nηR\n\nThe arguments of the threshold functions have to be\nevaluated at the minimum of the effective potential. In\nthe following sections, we will concentrate on the case of\nd = 4 dimensions.\nLet us emphasize that the derivative expansion has already been tested in various Yukawa systems and has\nproved to yield qualitatively and quantitatively accurate\n\n(20)\n\nresults. RG flows for Yukawa systems have been successfully studied in QCD [26], critical phenomena [27],\nquantum phase transitions [28] and ultra-cold fermionic\natom gases [29].\n\n\f6\nB.\n\npotential read\n\nParameter constraints\n\nLet us finally discuss several constraints on the couplings as, e.g., dictated by physical requirements as well\nas by our truncation. As our truncation is based on\na derivative expansion, satisfactory convergence is expected if the higher derivative operators take little influence on the flow of the leading-order terms. In the\npresent case, the leading-order effective potential receives\nhigher-order contributions only through the anomalous\ndimensions. Therefore, convergence of the derivative expansion requires\nηL , ηR , ηφ . O(1).\n\n(21)\n\nThis condition will serve as an important quality criterion\nfor our truncation. The SYM regime is characterized by a\nminimum of uk at vanishing field. A simple consequence\nis that the mass term needs to be positive. Also, the\npotential should be bounded from below, which in the\npolynomial expansion translates into a positive highest\nnonvanishing coefficient,\nm2k , λnmax ,k > 0.\n\n(22)\n\nIn the SSB regime, the minimum must be positive, κk >\n0, the potential should be bounded, and in addition the\npotential at the minimum must have positive curvature,\nκk , λnmax ,k , λ2,k > 0.\n\n(23)\n\nFinally, Osterwalder-Schrader positivity requires\nh2k > 0.\n\n(24)\n\nBeyond that, there are no constraints on the size of the\ncouplings as in perturbation theory.\n\nIV.\n\nTHE SYMMETRIC REGIME (SYM)\n\nLet us first investigate the fixed-point structure of the\nsystem in the symmetric regime. We restrict ourselves to\nfour dimensions and expand the effective action using the\nansatz (14). Now and in the following we will suppress\nthe index k at the parameters of the truncation for notational convenience. The flow equations are evaluated\nat the minimum of the effective potential, which is at\nρ̃ = 0 in the symmetric regime, and we replace u′ = m2 ,\nu′′ = λ2 , u′′′ = λ3 , ... . In this case, the next-to-leading\norder flow equations up to second order in the effective\n\n1\nηφ λ2 (NL + 1)\n(1 − )\n(25)\n2\n16π\n6 (1 + m2 )2\nηL\nηR\nh2\nh2\n+ 2 (1 −\n) + 2 (1 −\n),\n8π\n5\n8π\n5\nηφ λ2 (NL + 4)\n1\n(26)\n= 2ηφ λ2 + 2 (1 − ) 2\n8π\n6 (1 + m2 )3\nηφ λ3 (NL + 2)\n1\n(1 − )\n−\n16π 2\n6 (1 + m2 )2\nh4\nηL\nηR\nh4\n− 2 (1 −\n) − 2 (1 −\n).\n4π\n5\n4π\n5\n\n∂t m2 = (ηφ − 2)m2 −\n\n∂t λ2\n\nWe observe that the flow equation of a coupling λn involves m2 , λ2 , ..., λn+1 . For the Yukawa coupling we obtain\n∂t h2 = (ηφ + ηL + ηR )h2 .\n\n(27)\n\nIn particular, all contributions from typical vertex triangle diagrams vanish in the SYM regime. At leading order in a derivative expansion where ηi = 0, the Yukawa\ncoupling does not flow in the SYM regime. At nextto-leading order, we also have to take into account the\nanomalous dimensions\n\u0013\n\u0012\n1 2\nηL + ηR\nηφ =\nh\n,\n(28)\n1\n−\n4π 2\n8\nηφ \u0011\n2\n1 2\u0010\n1\n−\nh\n,\n(29)\nηL =\n2\n16π\n5 (1 + m2 )2\nηφ \u0011 2NL\n1 2\u0010\n1\n−\nh\n.\n(30)\nηR =\n16π 2\n5 (1 + m2 )2\nFor an interacting fixed point with a non-vanishing h2 to\nexist, the prefactor (ηφ + ηL + ηR ) in the flow equation\nfor the Yukawa coupling would have to vanish at some\npoint in parameter space. This implies that the different\nanomalous dimensions need to have a relative minus sign.\nFrom Eq. (28), we read off that a relative sign change\nrequires either ηφ > 5 or ηL + ηR > 8. Both options\nwould clearly be in conflict with the validity bounds of\nthe derivative expansion, demanding at least for ηL,R,φ .\nO(1).\nTherefore, a nontrivial fixed point of the Yukawa coupling in the SYM regime based on the criterion ηφ + ηL +\nηR = 0 – even if it existed – would be beyond the reliability bounds of the derivative expansion. Within the\nvalidity regime of our truncation, we thus find only the\nGaussian fixed point for the Yukawa coupling h∗ = 0.\nSince the flow of the Yukawa coupling is proportional to\nitself, an initial zero value for h2 will leave the system\nnon-interacting at h2 = 0 for all scales. The remaining\ninteracting system is purely bosonic and does not show\nany nontrivial fixed point in agreement with triviality of\nφ4 theory. We conclude that the chiral Yukawa model\nin the SYM regime is not asymptotically safe within the\npart of theory space spanned by our truncation.\n\n\f7\nΚ*\n0.10\n\nΛ2 *\n50\n\n0.08\n\n40\n\n400\n\n0.06\n\n30\n\n300\n\n0.04\n\n20\n\n200\n\n0.02\n\n10\n\n100\n\n0.00\n0\n\n5\n\n10\n\n15\n\n20\n\n25\n\nNL 0\n0\n\nh* 2\n\n5\n\n10\n\n15\n\n20\n\n25\n\nNL\n\n0\n0\n\n5\n\n10\n\n15\n\n20\n\n25\n\nNL\n\nFIG. 3: Leading-order derivative expansion (local-potential approximation) as well as leading-order polynomial expansion:\nfixed-point values {κ∗ , λ∗2 , h∗2 } for the two physically admissible fixed points as a function of NL .\n\nV.\n\nTHE REGIME OF SPONTANEOUS\nSYMMETRY BREAKING (SSB)\n\nLet us continue our fixed-point search in the brokensymmetry regime. The flow equations have a richer structure here, since the coupling to the condensate can mediate further effective interactions. Most importantly, the\nbroken regime can support the fixed-point scenario with\na conformal vev.\nA.\n\nFixed-point search to leading order\n\nFor the fixed-point search, we use a polynomial expansion of the effective potential about its minimum, cf.\nEq. (15). As a check of the quality of this expansion, the\nconvergence properties of physical quantities have to be\ndetermined with respect to increasing orders in this ex-\n\npansion. In general, we expect that this expansion gives\na good approximation of the full effective potential only\nin the vicinity of the potential minimum. Nevertheless,\nthis can still lead to sufficient information for a quantitative estimate of a variety of physical quantities, as they\nare mostly related to properties of the potential near the\nminimum.\nFor a first glance, we use the simplest nontrivial approximation of the effective potential, u = λ22 (ρ̃ − κ)2 ,\nwhich facilitates a purely analytical treatment of the\nfixed-point equations. The flow of the effective potential\n(13), evaluated around the minimum, then boils down\nto flows for ρ̃min = κ and u′′ = λ2 , with all other couplings being zero, i.e., u′ = 0, and u(n) = 0 for n > 2.\nWe also confine ourselves to the leading-order approximation in the derivative expansion, where the anomalous\ndimensions vanish, ηL,R,φ = 0. The flow equations in this\napproximation read explicitely\n\n1\n1\nh2\n3\n1\n(2N\n−\n1)\n+\n−\n,\nL\n32π 2\n32π 2 (1 + 2κλ2 )2\n4π 2 λ2 (1 + κh2 )2\n9λ22\nh4\n1\n1\n1\n2\n(2N\n−\n1)λ\n+\n−\n,\n=\nL\n2\n16π 2\n16π 2 (1 + 2κλ2 )3\n2π 2 (1 + κh2 )3\n\n∂t κ = −2κ +\n∂t λ2\n\n(31)\n(32)\n\nand for the Yukawa coupling\n∂t h\n\n2\n\n(\n\u0012\n\u0012\n\u0013\n\u0013\nh4\n1\n6κλ2\n1\n2\n1\n2λ2 κ\n+2 −\n+\n=\n16π 2 (1 + κh2 )\n1 + κh2\n(1 + 2κλ2 )2 1 + κh2\n1 + 2κλ2\n\u0012\n\u0012\n\u0013\n\u0013\n1\n1\n1\n1\n−\n+1 +\n+\n1 + κh2\n(1 + 2κλ2 ) 1 + κh2\n1 + 2κλ2\n\u0012\n\u0012\n\u0013)\n\u0013\n2\n2\n2κh2\n1\n2κh2\n.\n+1 −\n+\n+\n(1 + κh2 ) 1 + κh2\n(1 + κh2 )(1 + 2κλ2 ) 1 + κh2\n1 + 2κλ2\n\nThe resulting set of fixed-point equations {∂t κ =\n0, ∂t λ2 = 0, ∂t h2 = 0} can be solved analytically. For\na given NL , we obtain a large number of fixed points\n\n(33)\n\nbut only up to two fixed points fulfill the physical constraints given in section III A. For NL < 4, we find\nonly one admissible non-Gaussian fixed point (NGFP).\n\n\f8\nQ1\n2.0\n\nQ2\n0\n\n1.5\n\n-2\n\n1.0\n\n-4\n\n5\n\n10\n\n15\n\n20\n\n25\n\n-6\n\n0.5\n\n-8\n0.0\n0\n\n5\n\n10\n\n15\n\n20\n\n25\n\nNL\n\n-10\n\nNL\n\nQ3\n0.2\n0.0\n-0.2\n-0.4\n-0.6\n-0.8\n-1.0\n\n5\n\n10\n\n15\n\n20\n\n25\n\nNL\n\nFIG. 4: Leading order truncation: Critical exponents as a function of NL . The fixed point corresponding to the open circles\nhas two relevant directions, whereas the fixed point corresponding to the filled circles has only one relevant direction.\n\nFor 4 ≤ NL ≤ 29, two admissible NGFPs occur. For\n30 ≤ NL ≤ 57, there is again only one NGFP, whereas\nlarger NL do not give rise to any physically admissible\nfixed points. The fixed-point values κ∗ , h∗2 , and λ∗2 as a\nfunction of NL can be read off from figure 3.\nThe universal critical exponents can be deduced from\nthe linearized flow around this fixed point, cf. Eq. (4),\n∂t gi = Bi j (gj∗ − gj ) + . . . ,\n\n(34)\n\nwhere gi = (κ, λ2 , h2 ) in the present simple truncation.\nThe expansion coefficients Bi j form the stability matrix,\nthe eigenvalues −Θi of which correspond to the critical\nexponents apart from a minus sign. The critical exponents as a function of NL are shown in Fig. 4 for this\nsimple truncation. It is remarkable that one NGFP has\ntwo relevant directions and the other even only one relevant direction with a positive critical exponent. This\nimplies that the corresponding model is fixed by only\ntwo or one physical parameter, respectively. This should\nbe compared to the Gaussian fixed point with perturbative critical exponents of the order Θκ ≃ 2, Θλ2 ≃ 0, and\nΘh ≃ 0, implying that 3 physical parameters need to\nbe fixed for Gaussian models. Moreover, both NGFPs\nexhibit a largest critical exponent being smaller than\nthe perturbative maximal value, Θmax < 2. As a consequence, these models defined at the NGFPs have an\nimproved hierarchy behavior.\n\nB.\n\nBenchmark fixed point for NL = 10\n\nFor further investigations and by way of example, we\nconcentrate on one particular fixed point. We use a\nfixed point with only one relevant direction, as it is phenomenologically most appealing due to the reduction of\nphysical parameters. We choose NL = 10 in the following, since the corresponding fixed point does not give rise\nto extreme coupling values, implying numerical stability.\nIn addition, this particular value of NL may also be of\nrelevance for certain unification scenarios.\nFurthermore, we extend the lowest-order polynomial\n\nexpansion studied above to higher operators, cf. Eq. (15),\nu =\n\nNp\nX\nλn\n(ρ̃ − κ)n ,\nn!\nn=2\n\n(35)\n\nwhere Np labels the higher orders. From a technical viewpoint, the fixed-point analysis becomes much more involved at higher orders. In particular, we have not found\nany analytical solutions to the higher-order fixed-point\nequations. Due to the intrinsic nonlinearity of the fixedpoint equations, also a numerical search is nontrivial: a\ncomplete identification of all possible fixed points appears\nout of reach.\nTherefore, we start with the assumption that the simple truncation involving only h2 , λ2 and κ gives already a\nsatisfactory fixed-point estimate. As a next step, we can\nsearch for a fixed-point of the subsequent higher-order\nsystem in the vicinity of the previous lower-order fixed\npoint. This procedure turns out to be self-consistent and\ncan be iterated to higher orders. The results for the associated fixed-point values up to Np = 6 are summarized\nin Tab. I. The resulting fixed-point values show a satNL = 10\nNp = 2\nNp = 4\nNp = 6\n\nh2∗\nκ∗\nλ∗2\nλ∗3\nλ∗4\nλ∗5\nλ∗6\n55.8 0.0174 12.11 56.0 0.0158 12.09 -115 1.30 * 104\n57.4 0.0152 12.13 -152 1.20 * 104 −8.76 * 105 1.44 * 108\n\nTABLE I: Fixed-point values at different orders in the polynomial expansion of the effective potential. The index Np\ndenotes the largest exponent of ρ occurring in the polynomial\nexpansion (15) or (35). We observe satisfactory convergence\nof the fixed point values.\n\nisfactory convergence behavior, indicating that the polynomial expansion is quantitatively reliable already at low\norders. This convergence property is also confirmed by\nthe form of the fixed-point potential in a finite environment of the expansion point κ, as is depicted in Fig. 5:\nThe fixed-point potential of Mexican-hat type remains\nquantitatively stable under the inclusion of higher orders\n– even away from the minimum κ.\nWhereas the fixed-point potential is scheme dependent, also the stability of the universal critical exponents can be checked under the inclusion of higher or-\n\n\f9\nu*@ΦD\n\nvev\n12 000\n10 000\n8000\n6000\n4000\n2000\n\n0.0030\n0.0025\n0.0020\n0.0015\n0.0010\n\n0\n\n-0.1\n\n10\n\n15\n\nt\n\nh2\n60\n\n0.0005\n-0.2\n\n5\n\n0.1\n\nΦ\n0.2\n\n50\n40\n\nFIG. 5: Convergence of the fixed-point potential u∗ upon\nthe inclusion of higher orders in the polynomial expansion\nof the effective potential. The dotted line shows the fixedpoint potential within the simple truncation of Subsect. V A,\nincluding only the couplings κ and λ2 . The dashed curve also\nincludes λ3 and λ4 , and the solid line extends up to λ6 .\n\nders in the polynomial expansion. The results for the\nassociated critical exponents up to Np = 6 are summarized in Tab. II. The leading exponents vary only on\nthe 10%-level upon the inclusion of higher-order terms.\nMost importantly, the number of relevant directions is\nnot changed at higher orders, and the maximal critical\nexponent tends to smaller values at higher orders which\nleads to an improved hierarchy behavior. We conclude\nthat the fixed point exists at leading-order in the derivative expansion. It possesses many desirable properties\nand can well be approximated by a polynomial expansion.\nNL = 10 Θ1\nΘ2\nΘ3 Θ4\nΘ5\nΘ6\nΘ7\nNp = 2 1.294 -0.143 -3.94 Np = 4 1.167 -0.170 -2.50 -5.53 -13.61\nNp = 6 1.056 -0.175 -2.35 -4.97 -8.49 -14.02 -25.54\n\nTABLE II: Critical exponents in the polynomial expansion\nof the effective potential. The index Np denotes the largest\nexponent of ρ occurring in the polynomial expansion (15) or\n(35). We observe a reasonable convergence of the universal\ncritical exponents.\n\n30\n20\n10\n0\nΛ2\n14\n12\n10\n8\n6\n4\n2\n\n5\n\n10\n\n15\n\n0\n\n5\n\n10\n\n15\n\nt\n\nt\n\nFIG. 6: Flow of the leading couplings within the lowest-order\ntruncation.\n\nthe UV cutoff m̄2 /Λ2 . 1\nThe bare parameters can be fixed in terms of renormalization conditions. The latter ultimately relates these parameters to the physical IR parameters: the Higgs vev v,\nthe Higgs mass mHiggs and the top mass mtop . These, in\nturn, are related to the renormalized couplings κ, h2 , λ2\nby\nv = lim\n\nk→0\n\n√\n2κ k,\n\nmtop =\n\n√\nh2 v,\n\nmHiggs =\n\np\nλ2 v.\n\n(36)\n(The bottom-type quarks remain massless in our model.)\nVI. PREDICTIVE POWER OF\nASYMPTOTICALLY-SAFE YUKAWA SYSTEMS\n\nWe illustrate the predictive power of an asymptotically\nsafe Higgs sector, using the flow of our system in the\nlocal-potential approximation as a model in its own right.\nPerturbatively, our model would be defined by three\nbare parameters if the microscopic theory is initiated near\nthe Gaussian fixed point. These three parameters can be\nspecified, e.g., in terms of the bare Yukawa coupling h̄,\nthe φ4 coupling λ̄2 , and the scalar mass term in units of\n\nThis counting of independent physical parameters\nchanges drastically if the system originates from the nonGaussian fixed point in the limit of an infinite UV cutoff.\nAs the non-Gaussian fixed point has only one relevant di-\n\n1\n\nOwing to triviality at the Gaussian fixed point, the cutoff cannot\nbe removed. Strictly speaking, this leads to a lack of universality, such that the couplings of higher-dimensional operators also\ncorrespond to physical parameters. Their influence on the IR\nphysics is, however, suppressed by corresponding inverse powers\nof the UV cutoff Λ.\n\n\f10\nrection, there is only one physical parameter which we\nrelate to the vev v = 246GeV. In fact, fixing v to its\nphysical value merely corresponds to fixing the absolute\nscale. Dimensionless couplings or mass ratios are even\nindependent of this fixing scale and thus are completely\nparameter-free predictions of the theory.\nIn practice, we have to start the flow at some finite\nvalue of the auxiliary UV cutoff Λ (in arbitrary units),\nsolve the flow, and then associate the resulting value of\nv with its correct value in physical units. This also fixes\nthe value of Λ in units of, say, GeV. In the model with\nNL = 10, we then end up with a top and a Higgs mass\nat the IR scale\nmtop = 5.78v,\n\nmHiggs = 0.97v,\n\n(37)\n\nwhere the proportionality factors are approached in the\nlimit v/Λ ≪ 1. In this limit, this result is robust as\nwe vary the UV cutoff, which demonstrates the cutoff\nindependence of our prediction. As a result, the top and\nthe Higgs mass are pure predictions of the theory itself.\nWhereas the Higgs mass is of the order of the vev as expected, mHiggs ≃ 239GeV for v = 246GeV, the top mass\nis significantly larger in our model: mtop ≃ 1422GeV.\nThis is an indirect consequence of the comparatively large\nvalue of the fixed point of the Yukawa coupling. In order to elucidate this relation, let us note that the flow\ncan be subdivided into three different regimes: first, the\nUV fixed-point regime where all couplings stay close to\ntheir fixed point values; second, a crossover region where\nall couplings run fast; and third, a freeze-out region in\nthe IR where the dimensionful vev builds up and induces\ndecoupling and a subsequent approach to the generically\nfrozen IR values.\nThe dynamics in the crossover region is an intrinsic\nparameter-free property of the model that occurs only in\na rather narrow window of momentum scales. Hence, the\ncouplings have only a finite \"RG time\" – similar to the\nnumber of e-foldings in inflationary cosmology – to run\nfrom their UV initial conditions to their IR-frozen values.\nAs the initial fixed-point Yukawa coupling in our model\nis large, a sizeable IR value remains and gives rise to a\nlarge top mass. The same mechanism has been identified\nin the Z2 -symmetric Yukawa system in [17] even for the\ncase with two relevant directions. There, the top mass\nis, in principle, a physical parameter to be fixed; still,\nthe finite number of crossover e-foldings leads to a lower\nbound on the Higgs mass.\nRealistic scenarios with a physical value of the top\nmass require either a smaller fixed-point Yukawa coupling, or a sufficiently large number of crossover efoldings that facilitates a long running of the Yukawa coupling to its physical value. As the number of e-foldings\nof the crossover window is mainly dictated by the RG\nspeed at which the physical vev builds up, large numbers\nof e-foldings can occur if the largest critical exponent\ndominating the κ flow is small. We conclude that a reduced hierarchy problem and a realistic value of the top\nmass can go hand in hand with each other.\n\nFinally, we have to address an artifact of our flow in\nthe IR. As can be read off from Fig. 6, the perturbatively\nmarginal couplings h2 and λ2 still exhibit a slow log-like\nrunning in the IR. In our present set of flow equations,\nthe source of this running can be traced back to the Goldstone modes which are a particularity of our model, but\nare not present in the standard model. However, even\nif we considered the Goldstone modes as physical, the\nlog-like running is still an artifact of our truncation in\nthe IR. This artifact arises from the Cartesian decomposition of the scalar field, φ = √12 (φ1 + iφ2 ) (we suppress\nflavor indices in the following argument) where the vev\nis associated with the φ1 direction and φ2 is populated\nwith Goldstone modes. This decomposition leads to loglike divergencies in the diagrams with internal φ2 loops\ncoupling to external φ1 legs. However, as becomes clear\nfrom a proper nonlinear decomposition of the scalar field\n√\nφ = ρeiθ , the true Goldstone modes encoded in the\nfield θ do not couple to the radial mode via the potential, as U (φ† φ) = U (ρ) is independent of θ. We conclude\nthat the log-like running would be absent in a proper\nnonlinear field basis in the broken regime [30].\nIn practice, we read off our estimates for the IR values\nof h2 and λ2 at a dynamically defined scale kIR . For\nthe identification of this scale, we note that higher-order\ncouplings λn>2 are not affected by the Cartesian basis\nand safely flow to zero due to the leading-order Gaussian\nflow,\n∂t λn = 2(n − 2)λn + ... .\n\n(38)\n\nas expected, see Fig. 7. We define the scale kIR by that\nscale at which the coupling λ3 approaches its zero IR\nfixed point from above within an accuracy of 0.1%. The\nIR predictions listed in Eq. (37) have been read off at\nthis scale. Of course, in the presence of this flow artifact, these predictions actually depend on the choice of\nkIR . Nevertheless, the generic mechanisms in the UV and\ncrossover regimes outlined above are not affected by the\nIR artifact.\nVII. PROPERTIES OF THE DERIVATIVE\nEXPANSION AT NEXT-TO-LEADING ORDER\n\nIn the preceeding section, we have analyzed the chiral\nYukawa model in a derivative expansion of the effective\naction. As a simple criterion for this expansion to be\nvalid, the anomalous dimensions measuring the influence\nof higher-derivative terms should be small, cf. Eq. (21).\nAs a first check of this criterion, we use our fixed-point\nresults from the lowest-order polynomial expansion in the\nlocal-potential approximation and insert them into the\nright-hand sides of the anomalous dimensions Eqs. (18)(20). For this estimate, we ignore the RG improvement\nin the form of the back-reactions of nonzero η's on the\nflow of the couplings. The results as a function of NL are\nshown in Fig. 8. Whereas the criterion (21) is satisfied\nfor ηφ and ηL for NL > 5, the anomalous dimension ηR\n\n\f11\nΛ3\n5\n\n10\n\n15\n\nt\n\nΗΦ\n2.5\n2.0\n\n-50\n\n1.5\n-100\n\n1.0\n\n-150\n\n0.5\n\n-200\n\n0.0\n0\nΗL\n\nΛ4\n14 000\n12 000\n10 000\n8000\n6000\n4000\n2000\n0\n\n5\n\n10\n\n15\n\nt\n\nFIG. 7: Flow of the higher-order couplings λ3 and λ4 of the\neffective potential. The flows of even higher order couplings\nλ5 and λ5 look similar.\n\nof the right-handed fermion violates the criterion for all\nNL . The violation is dramatic for the fixed point with\ntwo relevant directions and still substantial for the fixed\npoint with one relevant direction.\nOne reason for the size of ηR lies in the fact that\nthe massless Goldstone modes and massless bottom-type\nfermions contribute strongly. This is because they (i)\nare not damped by massive threshold effects induced by\ncouplings to the condensate, and (ii) contribute with a\nlarge multiplicity ∼ NL . We conclude that the leadingorder derivative expansion does not provide for selfconsistent estimates of the fixed-point structure of the\nchiral Yukawa model as such. Nevertheless, since the\nGoldstone as well as the massless fermion modes are not\npresent in the standard model but a particularity of our\nreduced toy model, we expect that the local-potential\napproximation of the present model provides for a better\npicture of a possible fixed-point structure of the standardmodel Higgs sector than the literal version of our model\nincluding its massless modes.\nIt is still an interesting question within the chiral\nYukawa model, whether the nonlinearities induced by\nthe anomalous dimension gives rise to admissible fixed\npoints if the full RG improvement is taken into account.\nFor this, we have first followed the evolution of our\nleading-order fixed points upon gradually switching on\nthe anomalous dimensions. Our numerical results are\ncompatible with a destabilization of this fixed point, potentially going along with an annihilation with other fixed\npoints. A numerical search of further admissible fixed\npoints upon the full inclusion of the anomalous dimension remained inconclusive. Owing to the high degree of\nnonlinearity of the coupled equations, a systematic search\nin this high-dimensional parameter space is computation-\n\n2.5\n2.0\n1.5\n1.0\n0.5\n0.0\n0\nΗR\n\n5\n\n10\n\n15\n\n20\n\n25\n\n5\n\n10\n\n15\n\n20\n\n25\n\n5\n\n10\n\n15\n\n20\n\n25\n\nNL\n\nNL\n\n100\n50\n20\n10\n5\nNL\n\nFIG. 8: Leading-order estimate of the anomalous dimensions.\n\nally expensive and beyond the scope of the present work.\n\nVIII.\n\nCONCLUSIONS\n\nWe have explored a new possible route to asymptotically safe Yukawa systems with a chiral U(NL )L ⊗U(1)R\nsymmetry, similar to the Higgs-top sector of the standard model. This work is motivated by the fact that an\nasymptotically safe Yukawa sector can solve the triviality\nproblem of the standard-model Higgs sector and potentially improve on the hierarchy problem, both of which\nrepresent genuine problems related to the UV stability\nand completion of standard-model particle physics. In\nour scenario proposed in [17], asymptotic safety is based\non a conformal Higgs expectation value that induces a\nnon-Gaussian UV fixed point for all essential couplings.\nThis conformal behavior can arise from the dynamics of the theory as a consequence of a balancing between fermionic and bosonic fluctuation contributions\nto the running of the vev. More specifically, since\nbosonic fluctuations need to dominate, the existence of\nthis conformal-vev behavior depends on the algebraic\nstructure of the theory. It is a central result of our work\nthat chiral models with an asymmetry between left- and\nright-handed fermions in fact support this boson dominance.\n\n\f12\nOur quantitative investigations are based on the functional RG, using the derivative expansion as a nonperturbative approximation scheme for a systematic calculation of the quantum effective action. To leading-order\n(local-potential approximation), our left-right asymmetric model exhibits the desired non-Gaussian fixed points\nfor 1 ≤ NL ≤ 57. Whereas a physically admissible\nnon-Gaussian fixed point establishes the existence of the\nYukawa model as a fundamental UV complete quantum\nfield theory, the physical properties of such a UV completion are quantified by the non-negative critical exponents of this fixed point. Their number corresponds to\nthe number of physical parameters, and their value is a\nmeasure of the naturalness of a large hierarchy (between,\nsay, the Planck and the electroweak scale).\nMost importantly, one of the admissible fixed points\nhas only one positive critical exponent. This implies that\nonly one physical parameter has to be fixed, e.g., the vev\nv = 246GeV, whereas all other IR quantities such as the\nHiggs or the top mass are a pure prediction of the theory. Moreover, this critical exponent is also smaller than\nthe corresponding value in the perturbative domain, such\nthat the hierarchy behavior is substantially improved.\nUnfortunately, the fixed point in our toy model is\ndestabilized at higher order in the derivative expansion\ndue to massless Goldstone and fermion fluctuations. As\nthe latter are a particularity of our model and are not\npresent in the standard model, we expect the results from\nthe local-potential approximation to be of high relevance\nfor a more realistic model of the standard-model Higgs\nsector. On the other hand, our results have proved robust under an extension of the approximation scheme in\nthe boson effective potential.\nAs a main result of the present study, a number of\nconclusions about the requirements for a more realistic model can be drawn. (1.) The appearance of the\nconformal-vev mechanism depends crucially on the algebraic structure of the theory. Boson dominance is required and can be induced by a chiral left-right asymmetry. (2.) If the conformal vev breaks a continuous global\nsymmetry, Goldstone bosons are generated. As they are\nnot controlled by threshold effects, they may have the\ntendency to destabilize the UV fixed point. A model with\nspontaneous breaking of gauged symmetries will not be\naffected by this problem. (3.) Even though the threshold effects of the conformal vev are nonperturbative, our\nmechanism does technically not require strong coupling.\nComparatively small UV fixed-point couplings would also\nbe allowed if not phenomenologically preferred. (4.) The\npresent model predicts a very large top mass. For a realistic top mass, either the Yukawa UV fixed-point value\nshould not be too large or the crossover from the UV\nregime to the IR freeze-out should extend over many \"efoldings\", i.e., a larger range of RG time.\nThese requirements together with the remarkable predictive power of our scenario are a strong motivation to\nextend the present set of ideas to gauged chiral Yukawa\nmodels, thereby making another step towards a realistic\n\nstandard-model Higgs sector.\n\nAcknowledgments\n\nThe authors are grateful to J. M. Pawlowski for interesting discussions and helpful comments. This work was\nsupported by the DFG under contract No. Gi 328/5-1\n(Heisenberg program) and FOR 723.\n\nAPPENDIX A: THRESHOLD FUNCTIONS\n\nThe boson cutoff we use is given by:\nyrB (y) = (1 − y)θ(1 − y),\n\n(A1)\n\nwhere y = q 2 /k 2 , and the fermion regulator rF (y) is chosen such that y(1+rB ) = y(1+rF )2 . Using this regulator\nin the Wetterich equation, we can perform all momentum integrations analytically. The result can be given in\nterms of threshold functions which read\n2(δn,0 + n) \u0010\nηφ \u0011\n1\n1−\n,\nd\nd + 2 (1 + ω)n+1\nηL/R \u0011\n1\n2(δn,0 + n) \u0010\n(F)d\n1−\nln,L/R (ω) =\n,\nd\nd + 1 (1 + ω)n+1\n1\n2\n(ω1 , ω2 ) =\nln(FB)d\n1 ,n2\nn\n1\nd (1 + ω1 ) (1 + ω2 )n2\n\u0010\n\u0011\n\u0011\n \u0010\nηφ\nηψ\n\n n1 1 − d+1\nn2 1 − d+2\n+\n,\n×\n\n\n1 + ω1\n1 + ω2\nlnd (ω) =\n\nmdn1 ,n2 (ω1 , ω2 ) =\n\n1\n\n,\n(A2)\n+ ω)n2\n(1 +\n1\n(F)d\n,\nm2 (ω) =\n(1 + ω)4\n1\n1\n1 − ηψ\n(F)d\nm4 (ω) =\n+\n(1 + ω)4\nd − 2 (1 + ω)3\n\u0013\n\u0012\n1\n1 − ηψ\n1\n−\n,\n+\n2d − 4 4 (1 + ω)2\n\u0013\n\u0012\n1\nηφ\n,\n(ω\n,\nω\n)\n=\n1\n−\nm(FB)d\n1\n2\nn1 ,n2\nd + 1 (1 + ω1 )n1 (1 + ω2 )n2\nω)n1 (1\n\nwhere we have defined ηψ := 21 (ηR + ηL ).\nAPPENDIX B: DERIVATION OF THE\nEFFECTIVE POTENTIAL FLOW\n\nFor the flow of the effective potential, we project the\nWetterich equation onto constant bosonic fields and vanishing fermionic fields,\n∂t Uk =\n\n1\n(2)\nSTr{(Γk +Rk )−1 (∂t Rk )}|φ=const.,ψ=0 , (B1)\n2Ω\n\n\f13\nwhere Ω is the spacetime volume. We have to evaluate\n(2)\nthe r.h.s of Eq. (B1), for which we need the Γk matrix. Taking care of the partly Grassmann-valued field\n(2)\ncomponents and the Fourier conventions, Γk is derived\nby\n →\n ←\nT\n\n−\n−\nδ\n\n(2)\n\nΓk\n\nδ\n\n(−p) \n1 (q) \n δφ1→\n δφ←\n −δ\n −\n\n\nδ\n δφ2 (−p) \n δφ2 (q) \n−\n←\n−\n →\n\n\n\n δ\n δ\n\n\n δψL→\n\n(−p) \nδψL (q) \n−\n=  −δ\n Γk  ←\n,\n T\n Tδ\n\n\nδ ψ̄L (−q) \n δψ̄→\n\nL (p) \n−\n −δ\n ←\n\n\n δψ (−p) \n δψ δ (q) \nR\n R→\n\n\n\n−\n←\n−\nδ\nT (p)\nδ ψ̄R\n\nwith\n\nφT\ni =\nψ̄L =\n\nδ\nT (−q)\nδ ψ̄R\n\n\u0001\nNL T\n,\nφ1T\ni , . . . , φi\n\u0001\nNL\n1\nψ̄L , . . . , ψ̄L .\n\nThe transposition refers to flavor as well as Dirac indices.\nFor a proper IR regularization, a regulator which is diagonal in field space is sufficient and convenient,\n\u0012\n\u0013\nRkB 0\nRk (q, p) = δ(p − q)\n,\n0 RkF\nwith a 2NL × 2NL matrix for the bosonic sector\n\u0012\n\u0013\nZφ,k δ ab p2 rB\n0\nRkB =\n,\n0\nZφ,k δ ab p2 rB\ncf. App. A and an (2NL + 2) × (2NL + 2) matrix for the\nfermionic sector\n\n\n0\nZL,k δ ab p/T\n0\n0\nZL,k δ ab p/\n0\n0\n0 \nr .\nRkF = − \n\n0\n0\n0\nZR,k p/T  F\n0\n0\nZR,k p/\n0\n(2)\n\nThe matrix Γk + Rk has the same block form as the\nregulator. Therefore, we can evaluate the bosonic and\nfermionic parts separately. We start with the bosonic\npart. Inverting the matrix, multiplying with the derivative of the regulator, and taking the supertrace yields\nZ\nh\n2NL − 1\ndd p\n1\n∂\nR\n∂t UkB =\nt\nk\nd\n2\n(2π)\nZφ,k PB (p) + Uk′\ni\n1\n+\n,\n′\n′′\nZφ,k PB (p) + Uk + 2Uk ρ\nwhere PB (p) = p2 (1+rB (p)). Introducing PF (p) = p2 (1+\nrF (p))2 and dγ as the dimension of the representation of\nthe Dirac algebra, the fermionic contribution reads\nZ\ndd p n ∂t [ZL,k rF (p)]\n∂t UkF = −dγ\n(2π)d ZL,k (1 + rF (p))\ni\nh\nZL,k ZR,k PF (p)\n× (NL − 1) + 2\nh̄k ρ + ZL,k ZR,k PF (p)\no\nZL,k ZR,k PF (p)\n∂t [ZR,k rF (p)]\n.\n+\nZR,k (1 + rF (p)) h̄2k ρ + ZL,k ZR,k PF (p)\n\nAdding both parts and using the optimized regulator introduced in App. A, we get\n\u0010 U′ \u0011\nh\n\u0010 ′\n′′ \u0011i\nd Uk + 2Uk ρ\nk\n∂t Uk = 2vd k d (2NL − 1)l0d\n+\nl\n0\nZφ,k k 2\nZφ,k k 2\nh\n(F)d\n−dγ vd k d 2 (NL − 1)l0,L (0)\n\u0010\n\u0011\n\u0011i\n\u0010\nh̄2k ρ\nh̄2k ρ\n(F)d\n(F)d\n+ l0,R\n,\n+l0,L\n2\n2\nk ZL,k ZR,k\nk ZL,k ZR,k\nwhere the threshold functions are defined in Eqs.(A2).\nIn terms of dimensionless quantities defined in Eq. (10),\nthe potential flow turns into Eq. (13) in the main text.\n\nAPPENDIX C: DERIVATION OF THE YUKAWA\nCOUPLING FLOW\n\nFor the derivation of the flow of the Yukawa coupling,\nwe first separate the bosonic field into a vacuum expectation value (vev) v and a purely radial deviation from\nthe vev, since we are mainly interested in the Yukawa\ncoupling between the fermions and the radial mode.\n\n\nφ11 (p) + iφ12 (p)\nφ21 (p) + iφ22 (p)\n..\n.\n\n\n\n\n1 \n\n\nφ(p) = √ \n\n\n\n2\nNL\nNL\nφ1 (p) + iφ2 (p)\n\n \n\n∆φ11 (p)\nv\n2\n\n\n1 \n1 \n0 \n ∆φ1 (p) \n= √  .  δ(p) + √ \n,\n.\n..\n\n2  .. \n2\nNL\n0\n∆φ1 (p)\nsetting all ∆φ2 Goldstone components to zero. The projection of the Wetterich equation onto the flow of the\nYukawa coupling reads\n√ −\n→\n−\n←\n−\n→\n−1 δ\nδ\n2δ\n∂t h̄k =\n∂\nΓ\n.\nt k\n2 δ ψ̄L1 (p) δ∆φ11 (p′ )\nδψR (q)\n\n(C1)\n\nThe vertical line indicates that the equation is evaluated\na\nat ψR\n= ψLa = ∆φ = 0, p′ = p = q = 0. Next, we\n(2)\ncan decompose the matrix (Γk + Rk ) into two parts.\n(2)\nOne part, which we call (Γk,0 + Rk ), contains only v and\nis independent of the fluctuations. The remaining part,\n(2)\n∆Γk , contains all fluctuating fields. Inserting this into\nequation (C1) and expanding the logarithm\n\n\f14\n\n\"\n\u0010\n\u0011\n(2)\n(2)\nSTr ln(Γk + Rk ) = STr ln (Γk,0 + Rk ) 1 +\n\n(2)\n\n∆Γk\n(2)\n\nΓk,0 + Rk\n\n!#!\n\n(C2)\n\n(2)\n\u0010\n\u0011\n∆Γ\n1\n(2)\n− STr\n= STr ln(Γk,0 + Rk ) + STr (2) k\n2\nΓk,0 + Rk\n\n(2)\n\n∆Γk\n(2)\n\nΓk,0 + Rk\n\n!2\n\n1\n+ STr\n3\n\n(2)\n\n∆Γk\n(2)\n\nΓk,0 + Rk\n\n!3\n\n− ...,\n\n(2)\n\nonly the term to third power in ∆Γk survives the projection onto ∆φ11 ψ̄L1 ψR . Performing the matrix calculations\nand taking the supertrace, we get\n\"\n\u0012\n\u0013\nZ\nh̄3k\nUk′′ v\nv\ndd p  ̃\n3Uk′′ v + Uk′′′ v 3\n∂t h̄k = −\n∂\n−\nt\n′ 2\nh̄2\n2\n(2π)d\n(Zφ,k PB (p) + Uk′ + Uk′′ v 2 )2\nZL,k ZR,k PF (p) + 2k v 2 (Zφ,k PB (p) + Uk )\n\u0013\n\u0012\n1\n1\nh̄2k v 2\n−\n+\n′\nh̄2\nZφ,k PB (p) + Uk′ + Uk′′ v 2\n(ZL,k ZR,k PF (p) + 2k v 2 )2 Zφ,k PB (p) + Uk\n\u0012\n\u0013#\n1\n1\n1\n−\n,\n′ − Z\n′\n′′ 2\nh̄2\nφ,k PB (p) + Uk + Uk v\nZL,k ZR,k PF (p) + k v 2 Zφ,k PB (p) + Uk\n2\n\nwhere the potential on the right hand side is evaluated at the minimum 12 v 2 . Using the optimized regulator and\nthe threshold functions as defined in App. A and switching over to dimensionless quantities, we end up with the\nrepresentation (17) given in the main text.\nAgain, we have decomposed the matrix into two parts,\none part containing the vev and the other part containing all fluctuating fields. As done in App. C, we have\nexpanded the logarithm as in Eq. (C3), but this time\nonly the second order contributes. Calculating the r.h.s\nof Eq. (D1), results in\n\nAPPENDIX D: DERIVATION OF THE\nANOMALOUS DIMENSIONS\n\nFor the derivation of the flow of Zφ,k , we decompose\nthe bosonic field as in App. C. The projection of the\nWetterich equation onto the boson kinetic term leads us\nto\nδ\nδ\n∂\n1\n′2\n′\n∂(p ) δ∆φ1 (p ) δ∆φ11 (q ′ )\n\n!2 \n(2)\n∆Γ\n1\nk\n\n× STr ∂ ̃t\n(2)\n4\nΓ + Rk\n\n(D1)\n\n∂t Zφ,k = −\n\nk\n\n∂t Zφ,k\n\n1\n=\nd\n\nZ\n\n.\na =ψ =0,p′ =q ′ =0\n∆φ=ψL\nR\n\ndd p  ̃ h\n2\n∂t (3Uk′′ v + Uk′′′ v 3 )2 p2 Zφ,k\n(2π)d\n\n+(2NL −\n\n2\n1)(Uk′′ v)2 p2 Zφ,k\n\n+2h2k dγ p4 ZL,k ZR,k\n\n∂\n∂p2 PB (p)\n(Zφ,k PB (p) + Uk′ +\n\n∂\n∂p2 PB (p)\n\n(Zφ,k PB (p) + Uk′ )2\n\n(1 + rF (p))\n∂\n2\n∂p ZL,k ZR,k PF (p) +\n\nh2k\n2\n\nUk′′ v 2 )2\n\n!2\n\n!2\n\nv2\n\n!2\n\n−\n\nh4k dγ v 2 p2\n\n∂\n1\n2\n∂p ZL,k ZR,k PF (p) +\n\nh2k\n2\n\nv2\n\n!2\n\ni\n,\n\nwhere the potential is evaluated at the minimum. Using the optimized regulator together with the threshold functions\nas defined in App. A and again introducing dimensionless quantities, we end up with\nηφ =\n\n(2NL − 1)8vd ′′2 d ′\n8vd\n2 d\n′\n′′\nρ̃(3u′′k + 2ρ̃u′′′\nρ̃uk m22 (uk )\nk ) m22 (uk + 2ρ̃uk ) +\nd\nd\n8vd dγ 2 (F)4\n8vd dγ 4 (F)4\n+\nhk m4 (ρ̃h2k ) −\nρ̃hk m2 (ρ̃h2k ),\nd\nd\n\n\f15\n∂ Z\n\nφ,k\nwhere we have used ηφ = − Zt φ,k\n, and the right hand side has to be evaluated on the vev.\nFor the fermionic anomalous dimensions, the procedure is the same. We start with\n\n!2 \n→\n−\n←\n−\n(2)\n∆Γ\n∂\nδ\nδ\n1\nμ\nk\n\n\ntrγ\nSTr\n∂t ZL/R,k =\n1\n1\n′\n(2)\n4vd dγ\n∂p′μ δ ψ̄L/R\nδψ\n(p′ )\nΓ + Rk\nL/R (q )\n\nk,0\n\n∆φ=ψL =ψR\n\n,\n\n(D2)\n\n=0,p′ =q′ =0\n\nand get\n∂t ZL,k =\n\n2h̄2k\nd\n+\n\nZ\n\n\u0010\nZL,k (1 + rF (p))\ndd p 2  ̃ h\n1\n∂\np ∂t\nP\n(p)\nZ\nB\nφ,k\n2\nd\n2\nh̄k 2\n(2π)\n∂p\n(Z\nP\n(p)\n+\nUk′ + Uk′′ v 2 )2\nφ,k B\nZL,k ZR,k PF (p) + 2 v\n\u0011i\n1\n\n(Zφ,k PB (p) + Uk′ )2\n\nand\n∂t ZR,k\n\n\u0013\n\u0012\nZR,k (1 + rF (p))\ndd p 2  ̃ h\n1\n∂\np ∂t\nZφ,k 2 PB (p)\nh̄2\n(2π)d\n∂p\n(Zφ,k PB (p) + Uk′ + Uk′′ v 2 )2\nZL,k ZR,k PF (p) + 2k v 2\ni\n1\n2(NL − 1)ZR,k (1 + rF (p))\n∂\n1\n+\n,\n+\nP\n(p)\nZ\nB\nφ,k\n′\n′\n(Zφ,k PB (p) + Uk )2\nZL,k ZR,k PF (p)\n∂p2\n(Zφ,k PB (p) + Uk )2\n\n2h̄2k\n=\nd\n\nZ\n\nrespectively. Using the optimized regulator the result read in terms of dimensionless quantities\n8vd 2 (FB)d\n(FB)d\nh [m\n(ρ̃h2k , u′k + 2ρ̃u′′k ) + m12 (ρ̃h2k , u′k )],\nd k 12\n\n(D3)\n\n8vd 2 (FB)d\n(FB)d\n(FB)d\nh [m\n(ρ̃h2k , u′k + 2ρ̃u′′k ) + m12 (ρ̃h2k , u′k ) + 2(NL − 1)m12 (0, u′k )].\nd k 12\n\n(D4)\n\nηL =\nand\nηR =\n\n[1] K. G. Wilson and J. B. Kogut, Phys. Rept. 12, 75 (1974).\n[2] M. Luscher and P. Weisz, Nucl. Phys. B 295, 65 (1988);\nNucl. Phys. B 318, 705 (1989).\n[3] A. Hasenfratz, K. Jansen, C. B. Lang, T. Neuhaus and\nH. Yoneyama, Phys. Lett. B 199, 531 (1987).\n[4] U. M. Heller, H. Neuberger and P. M. Vranas, Nucl. Phys.\nB 399, 271 (1993) [arXiv:hep-lat/9207024].\n[5] D. J. E. Callaway, Phys. Rept. 167, 241 (1988).\n[6] O. J. Rosten, arXiv:0808.0082 [hep-th].\n[7] J. Smit, Nucl. Phys. Proc. Suppl. 17, 3 (1990);\nJ. Shigemitsu, Nucl. Phys. Proc. Suppl. 20, 515\n(1991); K. Jansen, Phys. Rept. 273, 1 (1996)\n[arXiv:hep-lat/9410018].\n[8] I. H. Lee, J. Shigemitsu and R. E. Shrock, Nucl. Phys.\nB 334, 265 (1990); Nucl. Phys. B 330, 225 (1990);\nR. E. Shrock, \"Lattice Yukawa Models\", in M. Creutz,\ned. Quantum Fields on the Computer, pp. 150 - 210\n(World Scientific, Singapore, 1992).\n[9] J. Kuti, L. Lin and Y. Shen, Phys. Rev. Lett. 61,\n678 (1988); Z. Fodor, K. Holland, J. Kuti, D. Nogradi and C. Schroeder, PoS LAT2007, 056 (2007)\n[arXiv:0710.3151 [hep-lat]]. P. Gerhold, K. Jansen and\nJ. Kallarackal, arXiv:0810.4447 [hep-lat]; P. Gerhold and\nK. Jansen, JHEP 0710, 001 (2007) [arXiv:0707.3849\n\n[10]\n\n[11]\n[12]\n[13]\n[14]\n\n[15]\n[16]\n[17]\n[18]\n[19]\n[20]\n\n[hep-lat]]; JHEP 0709, 041 (2007) [arXiv:0705.2539 [heplat]].\nK. Jansen, J. Kuti and C. Liu, Phys. Lett. B 309, 119\n(1993) [arXiv:hep-lat/9305003]; Phys. Lett. B 309, 127\n(1993) [arXiv:hep-lat/9305004].\nS. Weinberg, in C76-07-23.1 HUTP-76/160, Erice Subnucl. Phys., 1, (1976).\nR. Percacci, arXiv:0709.3851 [hep-th].\nS. Weinberg, arXiv:0903.0568 [hep-th]\nB. Rosenstein, B. J. Warr and S. H. Park, Phys. Rev.\nLett. 62, 1433 (1989); K. Gawedzki and A. Kupiainen,\nPhys. Rev. Lett. 55, 363 (1985); C. de Calan, P. A. Faria\nda Veiga, J. Magnen and R. Seneor, Phys. Rev. Lett. 66,\n3233 (1991).\nH. Gies, J. Jaeckel and C. Wetterich, Phys. Rev. D 69,\n105008 (2004) [arXiv:hep-ph/0312034].\nJ. M. Schwindt and C. Wetterich, arXiv:0812.4223 [hepth].\nH. Gies and M. M. Scherer, arXiv:0901.2459 [hep-th].\nA. Codello and R. Percacci, arXiv:0810.0715 [hep-th].\nH. Gies, Phys. Rev. D 68, 085015 (2003)\n[arXiv:hep-th/0305208].\nM. Reuter,\nPhys. Rev. D 57,\n971 (1998)\n[arXiv:hep-th/9605030];\nO.\nLauscher\nand\n\n\f16\n\n[21]\n[22]\n[23]\n[24]\n\n[25]\n\nM. Reuter, Phys. Rev. D 65, 025013 (2002)\n[arXiv:hep-th/0108040];\nClass. Quant. Grav. 19,\n483 (2002) [arXiv:hep-th/0110021]; W. Souma, Prog.\nTheor. Phys. 102, 181 (1999) [arXiv:hep-th/9907027];\nP. Forgacs and M. Niedermaier, arXiv:hep-th/0207028;\nR. Percacci and D. Perini, Phys. Rev. D 67, 081503\n(2003) [arXiv:hep-th/0207033]; A. Codello, R. Percacci and C. Rahmede, Int. J. Mod. Phys. A 23,\n143 (2008) [arXiv:0705.1769 [hep-th]]. D. Benedetti,\nP. F. Machado, F. Saueressig, arXiv:0901.2984 [hep-th]\nand arXiv:0902.4630 [hep-th]\nR. Percacci and D. Perini, Phys. Rev. D 68, 044018\n(2003) [arXiv:hep-th/0304222].\nO. Zanusso, L. Zambelli, G. P. Vacca, R. Percacci,\narXiv:0904.0938 [hep-th]\nC. Wetterich, Phys. Lett. B 301, 90 (1993).\nK. Aoki, Int. J. Mod. Phys. B 14, 1249 (2000); J. Berges,\nN. Tetradis and C. Wetterich, Phys. Rept. 363, 223\n(2002); D. F. Litim and J. M. Pawlowski, in The Exact Renormalization Group, Eds. Krasnitz et al, World\nSci 168 (1999); J. Polonyi, Central Eur. J. Phys. 1, 1\n(2004); J. M. Pawlowski, Annals Phys. 322, 2831 (2007)\n[arXiv:hep-th/0512261]; H. Gies, arXiv:hep-ph/0611146;\nB. Delamotte, arXiv:cond-mat/0702365.\nD. F. Litim, Phys. Lett. B 486, 92 (2000)\n[hep-th/0005245]; Phys. Rev. D 64, 105007 (2001)\n\n[hep-th/0103195].\n[26] D. U. Jungnickel and C. Wetterich, Phys. Rev. D\n53, 5142 (1996) [arXiv:hep-ph/9505267]; B. J. Schaefer and H. J. Pirner, Nucl. Phys. A 660, 439 (1999)\n[arXiv:nucl-th/9903003]; H. Gies and C. Wetterich,\nPhys. Rev. D 65, 065001 (2002) [arXiv:hep-th/0107221];\nPhys. Rev. D 69, 025001 (2004) [arXiv:hep-th/0209183];\nJ. Braun, arXiv:0810.1727 [hep-ph].\n[27] L. Rosa, P. Vitale and C. Wetterich, Phys. Rev. Lett. 86,\n958 (2001) [arXiv:hep-th/0007093]; F. Hofling, C. Nowak\nand C. Wetterich, Phys. Rev. B 66, 205111 (2002)\n[arXiv:cond-mat/0203588].\n[28] P. Strack, R. Gersch, W. Metzner, Phys. Rev. B\n87:014522 (2008) [arXiv:0804.3994]; P. Strack, S. Takei,\nW. Metzner, arXiv:0905.3894\n[29] M. C. Birse, B. Krippa, J. A. McGovern and\nN. R. Walet, Phys. Lett. B 605, 287 (2005)\n[arXiv:hep-ph/0406249];\nS.\nDiehl,\nH.\nGies,\nJ. M. Pawlowski and C. Wetterich, Phys. Rev.\nA 76, 053627 (2007) [arXiv:cond-mat/0703366];\nPhys. Rev. A 76 , 21602(Rap. Comm.) (2007)\n[arXiv:cond-mat/0701198]; S. Floerchinger, M. Scherer,\nS. Diehl and C. Wetterich, arXiv:0808.0150 [condmat.supr-con].\n[30] F. Lamprecht, F. Marhauser, J. M. Pawlowski, in preparation.\n\n\f"}