{"id": "http://arxiv.org/abs/1106.2034v1", "guidislink": true, "updated": "2011-06-10T12:24:29Z", "updated_parsed": [2011, 6, 10, 12, 24, 29, 4, 161, 0], "published": "2011-06-10T12:24:29Z", "published_parsed": [2011, 6, 10, 12, 24, 29, 4, 161, 0], "title": "Mesophase formation in a system of top-shaped hard molecules: Density\n  functional theory and Monte Carlo simulation", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.1821%2C1106.1906%2C1106.1546%2C1106.1115%2C1106.3570%2C1106.1152%2C1106.2224%2C1106.6042%2C1106.0248%2C1106.2442%2C1106.5644%2C1106.6261%2C1106.2110%2C1106.1997%2C1106.5728%2C1106.4247%2C1106.4482%2C1106.1671%2C1106.0666%2C1106.1624%2C1106.3490%2C1106.0281%2C1106.1344%2C1106.1869%2C1106.0123%2C1106.2833%2C1106.1134%2C1106.1479%2C1106.0327%2C1106.5600%2C1106.3972%2C1106.4689%2C1106.3689%2C1106.1966%2C1106.5102%2C1106.2215%2C1106.0844%2C1106.3422%2C1106.3723%2C1106.2559%2C1106.6150%2C1106.2473%2C1106.4192%2C1106.2070%2C1106.2797%2C1106.4322%2C1106.0388%2C1106.4194%2C1106.6103%2C1106.2905%2C1106.1085%2C1106.0951%2C1106.4874%2C1106.2186%2C1106.3889%2C1106.4744%2C1106.3336%2C1106.1930%2C1106.1886%2C1106.4364%2C1106.2086%2C1106.2478%2C1106.1670%2C1106.4450%2C1106.2034%2C1106.1192%2C1106.0404%2C1106.0130%2C1106.2828%2C1106.2524%2C1106.6226%2C1106.3915%2C1106.1092%2C1106.2427%2C1106.3351%2C1106.2941%2C1106.2436%2C1106.4392%2C1106.2029%2C1106.1462%2C1106.4263%2C1106.3984%2C1106.6052%2C1106.4449%2C1106.0553%2C1106.4779%2C1106.6109%2C1106.5709%2C1106.1023%2C1106.4817%2C1106.3949%2C1106.4031%2C1106.2245%2C1106.1577%2C1106.3296%2C1106.3443%2C1106.5489%2C1106.3241%2C1106.5475%2C1106.0829%2C1106.0287&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Mesophase formation in a system of top-shaped hard molecules: Density\n  functional theory and Monte Carlo simulation"}, "summary": "We present the phase diagram of a system of mesogenic top-shaped molecules\nbased on the Parsons- Lee density functional theory and Monte Carlo simulation.\nThe molecules are modeled as a hard spherocylinder with a hard sphere embedded\nin its center. The stability of five different phases is studied, namely,\nisotropic, nematic, smectic A, smectic C, and columnar phases. The positionally\nordered phases are investigated only for the case of parallel alignment. It is\nfound that the central spherical unit destabilizes the nematic with respect to\nthe isotropic phase, while increasing the length of the cylinder has the\nopposite effect. Also, the central hard sphere has a strong destabilizing\neffect on the smectic A phase, due the inefficient packing of the molecules\ninto layers. For large hard sphere units the smectic A phase is completely\nreplaced by a smectic C structure. The columnar phase is first stabilized with\nincreasing diameter of the central unit, but for very large hard sphere units\nit becomes less stable again. The density functional results are in good\nagreement with the simulations.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.1821%2C1106.1906%2C1106.1546%2C1106.1115%2C1106.3570%2C1106.1152%2C1106.2224%2C1106.6042%2C1106.0248%2C1106.2442%2C1106.5644%2C1106.6261%2C1106.2110%2C1106.1997%2C1106.5728%2C1106.4247%2C1106.4482%2C1106.1671%2C1106.0666%2C1106.1624%2C1106.3490%2C1106.0281%2C1106.1344%2C1106.1869%2C1106.0123%2C1106.2833%2C1106.1134%2C1106.1479%2C1106.0327%2C1106.5600%2C1106.3972%2C1106.4689%2C1106.3689%2C1106.1966%2C1106.5102%2C1106.2215%2C1106.0844%2C1106.3422%2C1106.3723%2C1106.2559%2C1106.6150%2C1106.2473%2C1106.4192%2C1106.2070%2C1106.2797%2C1106.4322%2C1106.0388%2C1106.4194%2C1106.6103%2C1106.2905%2C1106.1085%2C1106.0951%2C1106.4874%2C1106.2186%2C1106.3889%2C1106.4744%2C1106.3336%2C1106.1930%2C1106.1886%2C1106.4364%2C1106.2086%2C1106.2478%2C1106.1670%2C1106.4450%2C1106.2034%2C1106.1192%2C1106.0404%2C1106.0130%2C1106.2828%2C1106.2524%2C1106.6226%2C1106.3915%2C1106.1092%2C1106.2427%2C1106.3351%2C1106.2941%2C1106.2436%2C1106.4392%2C1106.2029%2C1106.1462%2C1106.4263%2C1106.3984%2C1106.6052%2C1106.4449%2C1106.0553%2C1106.4779%2C1106.6109%2C1106.5709%2C1106.1023%2C1106.4817%2C1106.3949%2C1106.4031%2C1106.2245%2C1106.1577%2C1106.3296%2C1106.3443%2C1106.5489%2C1106.3241%2C1106.5475%2C1106.0829%2C1106.0287&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present the phase diagram of a system of mesogenic top-shaped molecules\nbased on the Parsons- Lee density functional theory and Monte Carlo simulation.\nThe molecules are modeled as a hard spherocylinder with a hard sphere embedded\nin its center. The stability of five different phases is studied, namely,\nisotropic, nematic, smectic A, smectic C, and columnar phases. The positionally\nordered phases are investigated only for the case of parallel alignment. It is\nfound that the central spherical unit destabilizes the nematic with respect to\nthe isotropic phase, while increasing the length of the cylinder has the\nopposite effect. Also, the central hard sphere has a strong destabilizing\neffect on the smectic A phase, due the inefficient packing of the molecules\ninto layers. For large hard sphere units the smectic A phase is completely\nreplaced by a smectic C structure. The columnar phase is first stabilized with\nincreasing diameter of the central unit, but for very large hard sphere units\nit becomes less stable again. The density functional results are in good\nagreement with the simulations."}, "authors": ["D. de las Heras", "S. Varga", "F. J. Vesely"], "author_detail": {"name": "F. J. Vesely"}, "author": "F. J. Vesely", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1063/1.3596749", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1106.2034v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1106.2034v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "30 pages, 9 figures, 2 tables", "arxiv_primary_category": {"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.soft", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1106.2034v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1106.2034v1", "journal_reference": "Journal of Chemical Physics, 134, 214902 (2011)", "doi": "10.1063/1.3596749", "fulltext": "Mesophase formation in a system of top-shaped hard molecules:\nDensity functional theory and Monte Carlo simulation\n\nDaniel de las Herasa), Szabolcs Vargab) and Franz J. Veselyc)\n\na)\n\nCentro de Física Teórica e Computacional da Universidade de Lisboa, Av. Profesor Gama Pinto 2,\nP-1749-016, Lisbon, Portugal\n\nb)\n\nDepartment of Physics and Mechatronics, University of Pannonia, H-8200 Veszprém, PO Box 158,\nHungary\nc)\n\nComputational Physics Group, Faculty of Physics, University of Vienna, Boltzmanngasse 5, A1090 Wien, Austria\n\nNumber of pages: 30 (including figure captions, 9 figures and 2 tables)\na)\n\ne-mail: delasheras.daniel@gmail.com\n\nb)\n\ne-mail: vargasz@almos.vein.hu\n\nc)\n\ne-mail: franz.vesely@univie.ac.at\n\n1\n\n\fAbstract\nWe present the phase diagram of a system of mesogenic top-shaped molecules based on the\nParsons-Lee density functional theory and Monte Carlo simulation. The molecules are modeled as a\nhard spherocylinder with a hard sphere embedded in its center. It is found that the central spherical\nunit destabilizes the nematic with respect to the isotropic phase, while increasing the length of the\ncylinder has the opposite effect. Also, the central hard sphere has a strong destabilizing effect on the\nsmectic A phase, due the inefficient packing of the molecules into layers. For large hard sphere units\nthe smectic A phase is completely replaced by a smectic C structure. The columnar phase is first\nstabilized with increasing diameter of the central unit, but for very large hard sphere units it becomes\nless stable again. The density functional results are in good agreement with the simulations.\n\n2\n\n\f1.\n\nIntroduction\n\nUnderstanding the relation between molecular structure and macroscopic properties is a very\nimportant issue, because many practical applications require precise tailoring of the phase behavior.\nNowadays very complex mesogenic molecules are available to study the link between the observed\nmesophases and the molecular structure1. For example, mesogenic (rod, plate) and non-mesogenic\n(sphere, flexible polymer) building blocks can be attached together to study the role of different\nparameters such as the shape anisotropy, the polarizability and the flexibility in the stabilization of\nliquid crystalline phases. The only problem with these complex molecular formations (for example:\nrod-coil, coil-rod-coil molecules) is the presence of very complex interactions between the different\nbuilding blocks, which do not allow us to identify the separate roles of different molecular\ninteractions in the stabilization of the mesophases. One way to overcome this problem is to construct\nmodel systems that can be studied by theory and simulation.\nRod-shaped molecules such as hard spherocylinders have been shown to self-assemble into a\nrich variety of different liquid crystalline structures through the anisotropic repulsive interactions.\nThe mesophases include nematic, smectic A and solid phases2. The shape of many mesogenic\nparticles such as some metallomesogenic molecules3 and fullerene containing calamitic liquid4\ncrystals are closer to top-shaped bodies. The use of hard body models for these molecules helps us to\nunderstand the role played by the steric repulsive forces in the stability of different mesophases.\nThe first theoretical work on top-shaped molecules, which was devoted to studying the effect\nof varying the central sphere diameter on the nematic and smectic A phases, was done by Cinacchi5.\nIn this study the central core is modeled as a soft sphere and the Parsons-Lee6 extension of the\nOnsager theory7 is applied. Interestingly, it is found that making the central core bulkier can enhance\nthe stability of the nematic and smectic A phases. Luckhurst8 studied a thermotropic system of\nspherocylinders with an embedded sphere using Monte Carlo simulation. Instead of stabilization of\nthe smectic A phase, the system stays in the nematic phase, and a strong tendency for forming a tilted\nsmectic phase is observed. In the study of Kim et al.9 the phase behavior of 11-site Lennard-Jones\n3\n\n\f(LJ) linear molecules is examined using molecular dynamic simulation. Instead of one central LJ\nsphere, three LJ sites are chosen in the centre of the rod-like molecule to make it more bulky. It is\nfound that interdigitated smectic order replaces the conventional smectic A phase. Very recently\nfullerene containing triblock mesogens (a central fullerene with two mesogenic groups) has been\nexamined by Orlandi et al10, where the stabilization of the smectic order is detected in a layered\nstructure such that the fullerene spheres and mesogenic rods are microsegregated. In several\ntheoretical studies an attractive square-well site is placed in the centre of the mesogenic unit to see\nthe effect of the square-well radius on the stability of the isotropic-nematic and nematic-smectic\nphase transitions. Nematic-nematic phase transition11, stabilization of the smectic ordering12 and\nnematic reentrant behavior13 are observed. The model has been applied successfully for pazoxianisol14. What the above studies have in common is that the systems are thermotropic, which\ndoes not allow us to extract the effect of purely steric forces. True hard body models that resemble\ntop-shaped bodies are quite rare in the literature. Casey and Harrower15 studied the stability of the\nsmectic A and C phases in the system of coil-rod-coil triblock particles on a lattice using Monte\nCarlo simulation. They found that the smectic order can be stabilized by flexible terminal chains\nattached to the end of the mesogenic hard body. In a recent study, Varga and Fraden16 studied the\nphase behavior of the triblock hard mesogens where the particle consists of three hard cylinder\nsegments of different diameters. The main result of this work is that smectic C phase formation can\nbe induced by increasing the diameter of the central mesogenic unit.\nThe goal of the present work is to study the effect of a central non-mesogenic unit in the\nformation of mesophases in a system of hard spherocylinders with an embedded hard sphere. As the\nspherical shape does not favor the liquid crystalline order, the central hard sphere will have a major\ninfluence on the phase behavior of the system. Our top-shaped hard body model makes it possible to\ndetermine explicitly the role played by the mesogenic (spherocylinder) part and the non-mesogenic\nunit (sphere) in the stability of different mesophases.\nThe paper is organized as follows. The molecular model is presented in Section 2; Section 3\nis devoted to the Parsons-Lee theory of inhomogeneous hard body fluids. We show how to\n4\n\n\fimplement the free energy calculations for the nematic, smectic and columnar phases in three\nsubsections of Sec. 3. Technical details of the Monte Carlo simulation are given in Sec. 4. The phase\ndiagram of the system of top-shaped molecules and the bulk properties of smectic and columnar\nphases are presented in Sec. 5. Finally, some conclusions are drawn in Sec. 6.\n\n2.\n\nMolecular model\n\nWe model the top-shaped molecule as a hard spherocylinder with an embedded hard sphere as\nshown in Fig. 1. The hard spherocylinder, which is a mesogenic unit, consists of a cylindrical core\n(length L and diameter D) and two hemispheres with diameter D enclosing the ends of the cylinder.\nThe hard sphere with diameter (σ), which is a nonmesogenic unit, is placed at the center of the\ncylinder, which makes the top-shaped molecule symmetric. The diameter of the central unit is higher\nthan the diameter of the cylinder (σ >D). With this particle shape we assume that only hard body\ninteractions act between the particles. This means that all types of pairwise overlaps such as the rodsphere, rod-rod and sphere-sphere are forbidden. In the description of the isotropic-nematic phase\ntransition the top-shaped molecules are freely rotating, while for the treatment of the nematicsmectic, nematic-columnar and smectic A-smectic C phase transitions the molecules are assumed to\nbe perfectly aligned in the direction of the nematic director. The examined mesophases are shown\nschematically in Fig. 2.\n\n3.\n\nDensity functional theory\n\nAccording to the Parsons-Lee extension of the second virial density functional theory (DFT),\nthe free energy of an inhomogeneous hard body system can be written as a sum of ideal and excess\ncontributions β F = β Fid + β Fex , where\n\nβFid = ∫ d (1)ρ (1)[ln ρ (1) − 1] ,\n\n(1)\n\nβFex = χ ∫ d (1)ρ (1)\n\n(2)\n\n∫ d (2) ρ (2 ) .\n\nr12 ∈OR\n\n5\n\n\fIn these equations β =\n\n1\n( k B being the Boltzmann constant and T the temperature), ρ (1) is the\nk BT\n\nr r\nlocal number density, (i ) = (ri , ω i ) is an abbreviation for the position and orientation of the particle i\n\nand χ =\n\n4 − 3η\n\n8(1 − η )\n\nis the Carnahan-Starling prefactor. The packing fraction of the system is defined\n\n2\n\nas η = ρv0 , where ρ = 9 / V is the number density and v0 is the volume of the particle. In Eq. (2)\n\nr12 ∈ OR means that the distance between two particles (r12) must be in the overlap region as the\nparticles are modeled as hard bodies. Using the symmetry properties of the examined mesophases,\nthe free energy can be simplified substantially. In the following parts we present the suitable form of\nthe excess free energy for nematic, smectic and columnar phases only, while the reformulation of the\nideal free energy term for different mesophases is not discussed here as it is a simple problem.\n\na) Isotropic and nematic phases\nThe main feature of the nematic phase is that the local density is position independent, i.e.\n\nρ (1) = ρ (ω ) and the spatial integrals of Eq. (2) can be performed in advance. As a result, the excess\nr\n\nfree energy density becomes\n\nβFex / V = χ ∫ dω1 ρ (ω1 )∫ dω 2 ρ (ω 2 )Vexc (ω1ω 2 ) ,\nr\n\nr\n\nr\n\nr\n\nr r\n\n(3)\n\nr\nr\nwhere the excluded volume between two particles with orientation ω1 and ω 2 is defined as\nr r\nVexc (ω1ω 2 ) =\n\nr\n\n∫ dr\n\n12\n\n. In the isotropic phase the above equation is even simpler as the local density is\n\nr12 ∈OR\n\nconstant ρ (1) = ρ / 4π . As we are only interested in the determination of the stability limit of the\nisotropic with respect to the nematic phase, we simply perturb the isotropic density with the most\ndominant nematic function, which is the well-known second Legendre polynomial (P2). Therefore\nthe perturbed local density takes the form ρ (1) = ρ / 4π (1 + εP2 (cos θ )) , where ε is an infinitesimally\nsmall number and θ is a polar angle measured from the nematic director. Substitution of the\nperturbed local density into Eqs. (1) and (3) and expansion of the total free energy up to the first nonvanishing term in ε gives the so-called bifurcation equation for the isotropic-nematic phase\n\n6\n\n\ftransition17. Without going into the details we present the final equation for the packing fraction of\nthe isotropic-nematic bifurcation, which is given by\n\nη I9 =\n\n2+ x−\n\n(2 + x )2 − x(3 + x )\n3+ x\n\n,\n\n(4)\n\nπ /2\n\nwhere x = −20 v 0 / Vexc , 2 and Vexc , 2 = 5 ∫ dγ sin γ Vexc (γ )P2 (cos γ ) . Note that Eq. (4) is valid for any\n0\n\nhard body shapes, since the only input is the volume of the particle (v0) and the excluded volume\n(Vexc). In some special cases, such the spherocylinder shape, the excluded volume is an analytical\nfunction of the angle between two particles (γ). However, for the top-shaped body we have been\nforced to determine it numerically due to the complicated form of the sphere-sphere, sphere-rod and\nrod-rod overlap regions.\n\nb) Smectic A and C phases\nA common feature of the untilted (A) and tilted (C) smectic phases is that the long ranged\norientational order is accompanied by a one-dimensional positional order, i.e. the molecules are\narranged in layers. The main difference between the tilted and untilted phases can be measured by\nthe tilt angle (Ψ), which is the angle between the layer normal and the nematic director. For the\nsmectic A phase the tilt angle is zero, while it is in the interval 0<Ψ<90° for the smectic C phase. In\nour study we use the perfect orientational order approximation for the description of positionally\nordered phases. This means that the particles' long axes are always parallel and they all point in that\nspecial direction which forms an angle Ψ with the z-axis of the Cartesian coordinate system. With\nthis condition, the positional ordering takes place always in the direction of the z-axis, while the fluid\nstructure survives in the x-y plane for both smectic structures. The mathematical form of this\n\nr r\napproximation for the local number density can be written as ρ (r , ω ) = ρ ( z )δ (θ − Ψ ) . Exploiting the\nperiodic property of the local density, i.e. ρ ( z ) = ρ ( z + d 0 ) where d0 is the smectic period (or\nwavelength), the excess free energy density becomes\n\n7\n\n\fβFex / V =\nwhere Aexc ( z , Ψ ) =\n\nχ\nd0\n\nd0\n\n∫ dz ρ (z ) ∫ dz ρ (z )A (z\n1\n\n0\n\n1\n\n2\n\n2\n\nexc\n\n12\n\n, Ψ)\n\n(5)\n\nz12 ∈OR\n\nr\nd\nR\n∫ 12 is the excluded area of the overlap region at a given z separation. Note\n\nR12 ∈OR\n\nthat the excluded area also depends on the tilt angle (Ψ), because the area of the slices cut out from\nthe excluded volume is orientation dependent. However, the integral of the excluded area along the\n||\nz-axis must be independent of the tilt angle as Vexc =\n\n∫ dzA (z, Ψ )\nexc\n\nis the excluded volume between\n\nz∈OR\n\ntwo parallel molecules. To decide between the positionally disordered nematic phase and the smectic\nphases, one has to minimize the free energy with respect to the local number density and the tilt\nangle. To do this, we parameterize the density distribution with the following simple function18\n\nρ ( z ) = ρd 0\n\nexp[λ cos(2π z / d 0 )]\nd0\n\n∫ dz' exp[λ cos(2π z ' / d )]\n\n.\n\n(6)\n\n0\n\n0\n\nwhere λ measures the sharpness of the density peak. With this density ansatz the total free energy,\nwhich is now the sum of Eqs. (1) and (5), is a function of λ, d0 and Ψ. Therefore the problem reduces\nto the minimization of the free energy with respect to these three parameters. Note that the ideal free\nenergy term (Eq. (1)) favors the uniform density distribution, while the excess free energy (Eq. (5))\ncan reach very low values by proper packing of the particles along the z-axis. As a result, a subtle\ncompetition between the ideal and the excess free energies determines the stability of the smectic\nphases with respect to the nematic structure. The input of the minimization procedure is the excluded\narea, which is determined numerically at any tilt angle.\n\nc) Columnar phase\nIn the columnar phase the molecules are orientationally ordered and form a two dimensional\nlattice. The most efficient two dimensional packing can be achieved by a hexagonal structure, since\nthe cross section of the molecule is a circle. Again we use the parallel approximation for the\norientations of the particles' long axes, but we assume a hexagonal solid structure in the x-y plane,\n\n()\n\nr\nr\nr r\ni.e. ρ (r , ω ) = ρ R δ (θ ) , where R is a position vector in the x-y plane. Note that the particles are not\n8\n\n\ftilted in this phase. Using the fact that the system is uniform along the z-axis, it is easy to show that\nthe excess free energy density is\n\nβFex / V =\n\ndR ρ (R ) ∫ dR ρ (R )d (R ) ,\nA∫\n\nχ\n\nr\n\nr\n\n1\n\nr\n\n2\n\n2\n\nexc\n\n(7)\n\n12\n\nR12 ∈OR\n\nA\n\nwhere d exc (R ) =\n\nr\n\n1\n\n∫ dz is the excluded distance between two particles and\n\nA = 3d 0 / 2 is the area of\n2\n\nz∈OR\n\nthe hexagonal unit cell. The relationship between the excluded distance and the parallel excluded\n||\nvolume is Vexc =\n\nr\nd\nR\n∫ d exc (R ) , which shows that Eq. (7) gives the same nematic free energy in the\n\nR∈OR\n\n()\n\nr\nuniform limit ( ρ R = ρ ) as the smectic free energy does in the same limit (Eq. (5)). The excluded\n\ndistance is an analytic function, but it has three different intervals due to the rod-rod, rod-sphere and\nsphere-sphere exclusions. It is easy to show that\n 2L + 2 D 2 − R 2 ,\n\n2\nd exc (R ) =  L + 2 (σ + D ) / 4 − R 2 ,\n 2 σ 2 − R2 ,\n\n\n0≤ R ≤ D\n\nD < R ≤ (D + σ ) / 2\n\n(8)\n\n(D + σ ) / 2 < R ≤ σ .\n\nFor the columnar order we resort to a two dimensional Fourier expansion of the density distribution\nand we minimize the free energy with respect to the Fourier coefficients and the wave number (or\n\n(ρ (R )= ρ (− R )),\nr\n\nd0). Considering the inversion symmetry of the columnar phase\n\nr\n\nthe density\n\ndistribution is represented by\n\n[r r ]\n\n()\nr\n\nρ R = ρ∑\nf kr cos k R ,\nr\n\n(9)\n\nk\n\nr\nwhere f kr is the Fourier coefficient, and k is the wave vector. The details of the minimization\nprocedure can be found in our previous paper19. As in the case of smectic ordering, the competition\nbetween the ideal gas contribution (Eq. (1)) and the excess free energy term (Eq. (7)) determines the\nstability of the columnar phase with respect to the nematic structure. Furthermore, the stability of the\ncolumnar phase with respect to smectic A and C phases can be determined from the comparison of\nthe free energy values at a given packing fraction, since the free energies of smectic and columnar\nphases reduce to the nematic values in the uniform limit of the local density.\n9\n\n\f4.\n\nMonte Carlo simulations\n\nTo test the theoretical predictions regarding the nematic-smectic transition we perform a series\nof constant pressure Monte Carlo (MC) simulations20. Model systems of 9=256 parallel (i.e.\n\"nematic\") top-shaped particles are studied. The spherocylinder width is kept at D = 1 and the\ncylinder length is L = 9, so that the total particle length is L+D = 10 in all cases, while the central\nunit diameter is varied. The side ratio cz/cx of the square prism (cx=cy) simulation cell is kept\nconstant, with the z extension such that it will accommodate just four layers at the expected smectic\ndensity. The pressure is slowly incremented such that the packing fraction is increased from 0.1 to a\nvalue well beyond the respective phase transition density, i.e. η≈ 0.7 for the small diameter systems\nand η≈0.5 for σ=1.8-1.9 D. At each pressure 106 MC cycles are performed, where each such cycle\nconsists of 9 trial particle moves and one attempted volume change.\nThe expected structural phase transitions are diagnosed by means of the dominant Fourier\n\n(r)\n\nmodes of the local particle density. Let ρ k =\ncomponent\n\nof\n\nthe\n\none\n\nparticle\n\n[\n\n]\n\nrr\n1 9\nexp\n−\ni\nk\nr j with V = c x2 c z denote the Fourier\n∑\nV j =1\n\ndensity\n\ncorresponding\n\nto\n\na\n\nFourier\n\nvector\n\nr\nk = 2π (k x / c x , k y / c x , k z / c z ) where kx, ky and kz are integers. The periodic boundary conditions\n\nallow for certain discrete Fourier modes of the density. The zero vector is excluded, and for\nsymmetry reasons one of the components, say kz, may be restricted to positive values. For the same\nreason, if kz=0, then we choose ky≥0, and if kz=ky=0, then we let kx>0. Considering these selection\n\n(\n\n)\n\nrules the total number of relevant Fourier vectors is K = (2k 0 + 1) − 1 / 2 , where k0 is an arbitrary\n3\n\nupper limit for the absolute value of kx, ky, and kz. We have chosen k0=5, which yields a number\nK=665 of Fourier modes that are monitored at all times. Any inhomogeneity in the system will be\n\nindicated by enhanced values of structure factors pertaining to certain wave vectors. Writing\n\n(r )\n\n(r )\n\n()\n\n(r )\n\nr\n\n()\nr\n\nρ k = ρ ' k − iρ ' ' k , the normalized structure factor S k =  ρ ' k\n\n\n10\n\n2\n\n()\n\nr2\n+ ρ ' ' k  / ρ 2 may vary\n\n\n\f()\n\nr\nr\nbetween 0 and 1. If S k is small, the structure is more or less homogeneous along the respective k .\n\n()\n\nr\nr\nSmectic layering announces itself by a high value of some S k , where k is now the wave vector\nr\nalong the layer normal. If k points along the z axis we have a smectic A, otherwise smectic C phase.\n\n5.\n\nResults\n\nFirst we present the results of the free energy minimizations and the phase coexistence\ncalculations. In the case of the isotropic-nematic phase transition Eq. (4) yields the spinodal\ninstability curve between the two phases. The free energies of the smectic and columnar ordering are\nobtained by minimization with respect to the variational parameters such as the period (d0), tilt angle\n(Ψ) and Fourier amplitudes (λ0, fk). In the case of first order phase transitions, the coexisting\ndensities of phases α1 and α2 are determined from the phase boundary conditions for the pressure\n(P = −\n\n∂F\n∂F\n) and chemical potential ( μ =\n), which are P(α1)=P(α2) and μ(α1)=μ(α2). On the\n∂V\n∂9\n\nother hand the transition density of second order phase transitions such as nematic-smectic A is given\nby the lowest density at which the smectic amplitudes vanish first, i.e. the inhomogeneous fluid\nbecomes homogeneous. The results of the phase boundary calculations are collected in Fig. 3. Two\nmolecular parameters govern the stability of the mesophases, one is the central sphere diameter (σ),\nwhile the other is the aspect ratio (L/D) of the mesogenic unit. As Figure 3 shows, σ is responsible\nfor the formation of columnar and tilted structures, while a sufficiently large shape anisotropy or\naspect ratio (L/D) is very crucial in the stabilization of all mesophases. First of all we investigate the\nrole of the aspect ratio in the phase diagrams. Comparison of the four panels of Fig. 3 demonstrates\nthat the aspect ratio has to exceed five in order to stabilize the smectic and columnar phases. For\nexample for L/D=9 and σ/D=1, which is the hard spherocylinder shape, the phase sequence is the\nusual isotropic, nematic, smectic and columnar. This is almost the same phase sequence as for freely\nrotating spherocylinders, since only the columnar phase is replaced by the solid phase due to the\norientational fluctuations which are neglected in our calculations. Regardless of the value of the\n11\n\n\fcentral sphere diameter, increasing the aspect ratio stabilizes the nematic phase with respect to the\nisotropic one, as the particle becomes more anisotropic. In the limit of L/D→∞ the coexisting\npacking fractions of the isotropic-nematic phase transition go to zero7, which creates very wide\ndensity regions for the mesophases. Interestingly the aspect ratio has a small effect on the stability\nregions of the observed smectic A, smectic C and columnar phases. It moves the regions of smectic\nA and smectic C phases in opposite directions by enhancing the stability region of the columnar\nordering. The effect is more pronounced on the smectic C side, where the smectic C - columnar\nbinodal moves in the direction of lower packing fractions. In the context of the above arguments we\nmust mention that the isotropic-nematic phase transition is weakly first order, so the coexisting\nisotropic and nematic densities almost coincide with the presented spinodal curves.\nNow we turn to the effect of the central sphere unit on the stability of mesophases. One can\nsee that increasing σ/D has a strong effect on all transitions irrespectively of the value of the aspect\nratio. The nematic phase is destabilized with respect to the isotropic one with σ/D, because the\nmolecule becomes more spherical and the packing entropy gain by orientational ordering is smaller.\nThe same effect can be observed in the case of the smectic A phase. With increasing σ there is less\nroom for the particles in the layers to form a two-dimensional fluid and the packing of the mesogenic\nunits is less efficient. This is due to the fact that the rod-sphere pairs do not match in the layer and\nthe spheres give rise to extra unoccupied regions in the layers. As a result, the formation of the\nsmectic A phase is shifted in the direction of higher density, and its stability range shrinks due to the\nformation of a columnar structure. The stabilization of the columnar order is also plausible, because\nthe tendency of decreasing in-plane fluidity favors the formation of a two-dimensional solid structure\nin the layers. In addition, with increasing sphere diameter there is more room between the adjacent\nmesogenic units, which favors the fluidization of the system in the direction perpendicular to the\nsolid layers. With increasing diameter the stabilization of the columnar phase is so strong that the\nsmectic A phase completely disappears and a direct nematic-columnar phase transition takes place\nfor σ/D>1.2. However, further increase of σ is not favorable for the columnar phase, because the\n\n12\n\n\fdistance between the neighboring columns is of the order of σ, which also gives rise to large\nunoccupied regions in the space, i.e. the system cannot pack efficiently in the columnar phase with\nlarge central spheres. Therefore the system tends to be a new structure where it can preserve its\nfluidity to some degree and pack more efficiently. This structure is the smectic C phase, where the\nmesogenic units are tilted such that they almost lie inside the layer. With this arrangement the system\nbecomes more packed as the mesogenic units get closer to each other and, in addition, the sytem\nbecomes a two-dimensional fluid again. It can be seen in Fig. 3 that with further increase of σ/D the\ntilted smectic structure becomes stable, while the region of the columnar phase moves to higher\npacking fractions. From these results we can conclude that the hard body shape has a very strong\ninfluence on the stability of different mesophases.\nThe stability of smectic ordering was also checked by NpT Monte Carlo simulation. By\nsearching for the highest value of the structure factor Smax and the corresponding wave vector it is\npossible to distinguish the nematic and smectic phases. In the simulation some criterion is needed to\ndefine the boundary of the smectic phases. We consider the phase as smectic A if the dominant\ndensity mode is along the z axis, and the respective structure factor Smax exceeds a value of 0.1. The\nlatter condition may seem arbitrary, but experience shows that (a) the dominant wave vector, which\nis changing randomly at lower values of Smax, becomes robust and parallel to the z axis as soon as\nSmax >0.1; and (b) the rise of Smax is so steep that the exact threshold value is of no importance. In\ncontrast to smectic-A, the onset of the smectic-C phase was accompanied by a noticeable density\njump at a given pressure. This is surprising, since the transition is also expected to be of second\norder. A possible explanation is the discrete distribution of allowed Fourier modes in the finite,\nperiodic simulation cell. It appears that within a few compression steps the tilted layers are \"locking\nin\" with one of these modes, resulting in a simultaneous rise of the packing fraction and the structure\nfactor. We use the values of η immediately before the steep rise to define the nematic-smectic C\ntransition density. Fig. 4 shows the density dependence of the structure factor for σ/D=1.0, 1.02, 1.04\nand 1.06 (a) and for σ/D=1.80, 1.85 and 1.90 (b) (in all cases we set L/D=9). In panel (a) we can see\n\n13\n\n\fr\nthat the smectic phase has lower and upper bounds in all cases. The wave vector ( k ) points along the\nz axis, and therefore the lower bound is due to the second order nematic-smectic A phase transition\nas Smax increases smoothly from zero, while the upper bound is a first order phase transition between\nthe smectic A and the columnar phases. Note that Smax jumps suddenly and there is also a jump in the\nequation of state at the upper bound. This is an indication of the first order character of the smecticcolumnar phase transition. It can be seen in Fig. 4 (a) that the density range of Smax>0.1 shrinks with\nincreasing diameter of the central core, i.e. the smectic A phase becomes less stable as σ gets larger.\nThe results of the Monte Carlo simulations for small diameters of the central unit are collected\ntogether with the corresponding DFT results in Table 1, where we can see that the smectic phase can\nbe destabilized with respect to nematic and columnar phases by increasing the diameter of the central\ncore. Comparison of the simulation and theoretical results shows good agreement. In addition, the\nfailure of our mean field density functional theory can also be seen in Table 1, as the upper and lower\nborders of the smectic A phase are underestimated and the smectic period is too large. This is due to\nthe misrepresentation of the density correlations in our theory. The recent study of Capitán et al.21\nshows that the inclusion of the density correlations into the theory does help to get a better equation\nof state and smectic period, but it does not improve the phase diagram. This was demonstrated in the\nsystem of parallel hard cylinders, which is very close to our systems with σ/D=1. As mentioned\nbefore, we have also performed Monte Carlo simulations in a system of particles with L/D=9 and\n\nσ/D≥1.8 to check the prediction of our DFT study for the stability region of the smectic C phase.\nPanel (b) of Fig. 4. shows that Smax increases steeply as the density is increased beyond the transition\npoint and then levels off. The wave vector is now pointing along directions different from the z axis\n(see Table 2), as corresponds to the formation of a tilted smectic phase instead of an untilted one.\nThe nematic-smectic C transition properties of the MC simulations and DFT calculations are\ncompared in Table 2. The agreement is surprisingly good for the packing fractions and tilt angles,\nwhich may be due to the fact that the dominant interaction in the tilted layers is the hard sphere-hard\nsphere exclusion, which is accurately represented by the Carnahan-Starling prefactor in the theory.\n\n14\n\n\fHowever, the lack of proper inclusion of the density correlations is still present, because the smectic\nperiod is again overestimated. Another important difference is that we have not found an upper limit\nfor the stability of the smectic C phase using MC simulations, i.e. no smectic C-columnar phase\ntransition is observed by increasing the density. If present, the columnar phase appears at higher\ndensities than those tested in our simulation. It is also plausible that the columnar phase is not stable\nfor these values of σ. The phase diagrams depicted in Fig. 3 show that at a given aspect ratio there is\nprobably a maximum σ for which a columnar phase can be found (a possible vertical asymptote).\nNow we turn to the discussion of the structural properties of the smectic and columnar phases\nalong the transition curves, and we also examine the density dependence of these properties. The\nsmectic (columnar) period is an important parameter because it reflects the average distance between\nthe neighboring layers (columns). The values of d0 at the nematic-smectic and nematic-columnar\nphase transitions are shown in Fig. 5 for a system of particles with L/D=9 and various σ. It can be\nseen that the smectic A phase has the usual layered structure with a period that is proportional to the\nlength of the mesogenic unit (L). The effect of the increasing diameter (σ) is to decrease the smectic\nperiod, i.e. the neighboring layers get closer to each other. This is quite reasonable because the\naverage distance between the mesogenic units inside the layers increases with σ, i.e. the system can\npack more efficiently if the particles of the neighboring layers are closer to each other. Interestingly\nwe have not observed strong interdigitations between the layers. In the case of 11-site Lennard-Jones\n(LJ) top-shaped rigid particles, Kim et al.9 have observed, for σ/D>1.7, smectic periods of half the\nmesogenic length. The reason why they could observe such strong interdigitation of the layers may\nbe attributed to the fact that 3 large LJ sites in the middle of the linear array strongly favor a side-byside parallel arrangement instead of the slipped parallel one, i.e. the model of Kim et al. prefers the\nsmectic A phase to smectic C even for very large σ.\nThe next phase along the phase coexistence curve is the columnar structure (Fig. 5). We can\nsee that the columnar period is now in the order of σ, which is not surprising as the interactions\nbetween the columns are dominated by the hard body exclusions between the central spherical units.\n\n15\n\n\fThis argument is supported by the fact that the columnar period is a more or less linearly increasing\nfunction of σ. At higher σ the columnar phase is replaced by a tilted smectic ordering. In this phase\nthe smectic period is very low, but it is always higher than the columnar period. Interestingly it\ndepends only weakly on the diameter of the central unit but strongly on the length of the mesogenic\nunit. This effect can be understood by examining the aspect ratio dependence of the tilt angle along\nthe nematic-smectic C phase transition (See Fig. 6). In all studied cases the tilt angle increases first\nwith σ and then starts to decrease. It can be seen also that the aspect ratio has a strong influence on\nthe tilt angle and consequently on the smectic period. With increasing the length of the mesogenic\nunit the particles are more tilted with respect to the layer normal. This effect may be induced by the\nhard bodies staying in the interstitial regions as the interstitial particles exclude a smaller volume in\nthe neighboring layers if the particles are more tilted. This is especially true for longer mesogenic\nunits. Therefore the molecular parameter dependence of the tilted smectic structure (tilt angle and\nsmectic period) is a complicated interplay between the in-layer packing and the interlayer packing\ntendencies. The packing fraction dependence of the smectic and columnar periods is more\nunderstandable (see Fig. 7-8). The period of both smectic A and columnar phases decreases with\nincreasing density. This is simply a consequence of the fact that the only way to pack more particles\ninto very dense layers (columns) is to decrease the distance between the neighboring layers\n(columns). In the case of a tilted smectic phase, not only the compression of the layer thickness helps\nto increase the packing fraction, because the increasing tilt angle can also give rise to extra free room\nfor the particles to accommodate in. Therefore, the smectic period is a decreasing function of the\npacking fraction, while the tilt angle increases with it (Fig. 8). Finally, in Fig. 9 we show the density\nprofiles of the positionally ordered phases at the same packing fractions and aspect ratio of the\nmesogenic unit (L/D=9), but at different sphere diameters. Comparison of the smectic A and C\ndensity profiles shows not only the differing smectic periods, but also the difference in the sharpness\nof the peaks. While the smectic A ordering is very peaked, the tilted smectic structure is\naccompanied by a smooth density distribution with nonzero interstitial density. This also proves that\n\n16\n\n\fthe structure of the smectic C phase (tilt angle and the smectic period) is strongly affected by the\ninterstitial particle-mediated interactions between neighboring layers. In addition, it can be seen that\nthe structure of the columnar phase is hexagonal; the density profile is very peaked and very few\nparticles stay between the columns.\n\n6.\n\nConclusions\n\nIn this paper we have studied the effect of varying the central hard sphere diameter on the\nmesophase forming ability of uniaxial hard rod-fluids. Our theoretical calculations and simulation\nstudy show that the non-mesogenic central unit destabilizes both the nematic and smectic A phases.\nWith increasing sphere diameter the top-shaped particle becomes more spherical, and the packing\nentropy gain arising from orientational and positional ordering becomes less with respect to the loss\nof orientational entropy, i.e. the nematic and the smectic ordering takes place at higher packing\nfractions. However, the spherical central core gives rise to the formation of columnar and smectic C\nordering. The columnar phase is very stable in the interval of 1.2<σ/D<1.7 with a first order phase\ntransition from the nematic phase, while the smectic C phase becomes stable for σ/D>1.7 for most of\nthe studied aspect ratios. The shape and size incompatibility between the spherical and rodlike units\nis the source of the detected phase behavior. The rodlike units attempt to form layers, but the spheres\nmake the layers too spacious. Consequently the columnar phase becomes more packed and stable\nthan smectic A. However, the packing efficiency of columnar ordering depends very sensitively on\nthe diameter of the central unit, i.e. the columnar order becomes less packed for larger diameters, and\nthe system undergoes a phase transition from nematic to smectic C. We expect these mesophases to\nbe absolutely stable, although we should bear in mind that solid phases may appear in the system at\nhigh enough densities, and could partially modify the phase diagrams reported in this paper.\nOur results show that hard body models of mesogenic systems are able to account for the\neffect of increasing central core on liquid crystalline order. In agreement with our findings, the\nreplacement of hydrogen atoms in the central core of mesogenic molecules with bulkier groups (e.g.\n\n17\n\n\fmethyl, ethyl, NO2) generally results in destabilization of nematic and smectic A phases22. In\naddition, it is shown in the recent experimental study of Tian et al.23 that the stability of mesophases\ndepends very sensitively on the central core. The phase behavior of three-segment coil-rod-coil\nmolecules shows dramatic changes when lateral methyl or ethyl groups are added to the centre of the\nmesogenic molecule. In the case of methyl groups hexagonally perforated layers are formed, while\nthe ethyl group gives rise to columnar order23. In some cases tilted layered structures are also found.\nEven though our molecular model is simple, it produces quite reasonable explanations for the\nobserved phase behavior of bulky mesogens.\n\n18\n\n\fAcknowledgements\nWe are grateful to Giorgio Cinacchi for useful discussions and for bringing to our attention\nthe work of Geoffrey R. Luckhurst. We would like to thank E. Velasco and L. Mederos for their\npractical help and advice to this paper. SV and FV would like to thank the financial support of the\nAustrian-Hungarian Action Foundation (grant number: 77öu11). DH acknowledges the support of\nthe Spanish Ministry of Education through contract No. EX2009-0121.\n\n19\n\n\fReferences\n1\n\n2\n\nS. C. Glotzer and M. J. Solomon, Nature Materials 6, 577 (2007).\nP. Bolhuis and D. Frenkel, Journal of Chemical Physics 106, 666 (1997); S. C. McGrother, D. C.\n\nWilliamson, and G. Jackson, Journal of Chemical Physics 104, 6755 (1996).\n3\n\nB. Donnio and D. W. Bruce, J. Chem. Soc., Dalton Trans., 2745 (1997); R. Deschenaux, F. Monnet, E.\n\nSerrano, F. Turpin and AM Levelut, Helvetica Chimica Acta 81, 2072 (1998).\n4\n\nT. Chuard and R. Desceneaux, J. Mater. Chem. 12, 1944 (2002); S. D. Peroukidis, A. G. Vanakaras and D.\n\nJ. Photinos, Journal of Chemical Physics 123, 164904 (2005).\n5\n\nG. Cinacchi, Chemical Physics Letters 395, 335 (2004).\n\n6\n\nJ. D. Parsons, Phys. Rev. A, 19, 1225 (1979); S. D. Lee, J. Chem. Phys., 97, 4972 (1987).\n\n7\n\nL. Onsager, Ann. NY Acad. Sci. 51, 627 (1949).\n\n8\n\nG.R. Luckhurst, Liquid Crystals 32, 1335 (2005).\n\n9\n\nH. Kim, D. Bedrov, G. D. Smith and J. J. Magda, Journal of Chemical Physics 124, 124912 (2006).\n\n10\n\nS. Orlandi, L. Muccioli, M. Ricci and Claudio Zannoni, Soft Matter 5, 4484 (2009).\n\n11\n\nS. Varga, D.C. Williamson and I. Szalai, Molecular Physics 96, 1695 (1999).\n\n12\n\nE. Martin del Rio and E. de Miguel, Phys. Rev. E 71, 051710 (2005).\n\n13\n\nE. de Miguel and E. Martin del Rio, Phys. Rev. Lett. 95, 217802 (2005).\n\n14\n\nA. E. Gonzalez-Cabrera, E. Garcia-Sanchez and L. H. Mendoza-Huizar, J. Molec. Liq. 149, 22 (2009).\n\n15\n\nA. Casey and P. Harrowell, Journal of Chemical Physics 110, 12183 (1999).\n\n16\n\nS. Varga and S. Fraden, Journal of Chemical Physics 127, 154902 (2007).\n\n17\n\nG. J. Vroege and H. N. W. Lekkerkerker, Reports on Progress in Physics 55, 1241 (1992).\n\n18\n\nE. Velasco; L. Mederos and D. E. Sullivan, Physical Review E 62, 3708 (2000).\n\n19\n\nS. Varga, E. Velasco, L. Mederos and F. J. Vesely, Molecular Physics 107, 2481 (2009).\n\n20\n\nM. P. Allen and D. J. Tildesley, Computer Simulation of Liquids (Clarendon Press, Oxford, 1987).\n\n21\n\nJ. A. Capitán, Y. Martínez-Ratón and J. A. Cuesta, Journal of Chemical Physics 128, 194901 (2008).\n\n22\n\nG. W. Gray and G. R. Luckhurst (Editors), The Molecular Physics of Liquid Crystals (Academic Press,\nLondon, 1980); P. J. Collings and M. Hird, Introduction to Liquid Crystals (Taylor & Francis, Bristol,\n1997).\n\n23\n\nL. Tian, K.L. Zhong, Y. Liu, Z. Huang, L. Yi.Jin and L. S. Hirst, Soft Matter 6, 5993 (2010).\n\n20\n\n\fFigures\nFigure 1)\nHard body representation of a symmetric top-shaped molecule, consisting of a hard\nspherocylinder of cylinder length L and diameter D and an embedded hard sphere of diameter σ\nplaced in the center of the mesogenic unit.\nFigure 2)\nSchematic representation of isotropic (a), nematic (b), smectic A (c), smectic C (d) and\ncolumnar (front view: e, top view: f) phases.\nFigure 3)\nEffect of varying the hard sphere diameter (σ) on the phase transition of top-shaped\nmolecules in the η-σ/D plane for aspect ratios (L/D) of 5 (a), 9 (b), 13 (c) and 17 (d). The dashed\ncurve represents the continuous nematic-smectic phase transitions, the dot-dashed curve is the border\nbetween the isotropic and nematic phases as computed by bifurcation analysis, and the solid curves\nshow the binodals between nematic, smectic and columnar phases. The shaded areas are the twophase regions. The squares indicate the position of the critical end points. The isotropic, nematic,\nsmectic A, smectic C and columnar phases are denoted as I, 9, SmA, SmC and C, respectively.\nFigure 4)\nThe largest Fourier mode of the density correlation (Smax) as a function of packing fraction for\n\nσ/D=1, 1.02, 1.04, and 1.06 (a) and σ/D=1.80, 1.85 and 1.90 (b). The curves are the results of NpT\nMonte Carlo simulation. The aspect ratio (L/D) is 9.\nFigure 5)\nSmectic or columnar period (d0/D) vs. the diameter of the central hard-sphere (σ/D) along the\ntransition curve between nematic and positionally ordered phases in the system with L/D = 9\nFigure 6)\nTilt angle of the smectic C phase (Ψ) vs. diameter of the central hard-sphere (σ/D) along the\nnematic-smectic C phase transition curve for different aspect ratios (L/D).\n\n21\n\n\fFigure 7)\nPacking fraction dependence of smectic A and columnar periods (d0/D) in the system with\nL/D = 9 and σ/D = 1.1. Note the broken scale on the vertical axis.\nFigure 8)\nPacking fraction dependence of the period (d0/D) and the tilt angle (Ψ) in the system with L/D = 9\nand σ/D = 1.9 are shown in (a) and (b), respectively.\nFigure 9)\nLocal packing fraction of the smectic A (a), columnar (b) and smectic C (c) phases for the aspect\nratio L/D=9 and packing fraction η=0.45. The diameter of the central hard sphere (σ/D) is 1.1 in\npanel (a), 1.5 in panel (b) and 1.9 in panel (c).\nTable 1)\nDiameter (σ/D) dependence of the stability range of the smectic A phase. The data are the\nresults of NpT Monte Carlo simulation (MC) and those of density functional theory (DFT). η is the\npacking fraction (we include the range where smectic ordering may be observed) and d0/D is the\nsmectic period. The aspect ratio is L/D=9.\nTable 2)\nSummary of the Monte Carlo simulations and the density functional calculations of a system\nof top-shaped particles with L/D=9. The diameter of the central unit (σ/D), the packing fraction at the\nnematic-smectic C phase transition (η), the integer components of the wave vector (kx,ky,kz), the tilt\nangle (Ψ) and the smectic period at the nematic-smectic C phase transition (d0/D).\n\n22\n\n\fFigure 1.\n\nFigure 2.\n\n23\n\n\fFigure 3.\n\n24\n\n\fFigure 4.\n\n25\n\n\fFigure 5.\n\n26\n\n\fFigure 6.\n\n27\n\n\fFigure 7.\n\n28\n\n\fFigure 8.\n\n29\n\n\fFigure 9.\n\n30\n\n\fMC\n\nσ/D\n\nη\n\n1.00\n1.02\n1.04\n1.06\n\n0.44 – 0.66\n0.45 – 0.60\n0.46 – 0.57\n0.47 – 0.53\n\nDFT\nd0 /D\n11.5 – 9.9\n11.2 – 10.2\n11.0 – 10.3\n10.9 – 10.5\n\nη\n0.34-0.56\n0.34-0.54\n0.35-0.51\n0.35-0.50\n\nd0 /D\n13.52-12.13\n13.50-12.24\n13.47-12.33\n13.44-12.42\n\nTable 1.\n\nMC\n\nσ/D\n\nη\n\n1.80\n1.85\n1.90\n\n0.44\n0.43\n0.43\n\nkx/ky/kz\n-5/2/4\n-3/5/4\n-5/2/4\n\nDFT\nΨ(deg)\n80.6\n81.3\n80.6\n\nd0 /D\n1.9\n1.8\n1.9\n\nTable 2.\n\n31\n\nη\n0.43\n0.42\n0.42\n\nΨ(deg)\n80.14\n80.12\n80.09\n\nd0 /D\n2.51\n2.53\n2.55\n\n\f"}