{"id": "http://arxiv.org/abs/1010.3242v1", "guidislink": true, "updated": "2010-10-15T18:42:39Z", "updated_parsed": [2010, 10, 15, 18, 42, 39, 4, 288, 0], "published": "2010-10-15T18:42:39Z", "published_parsed": [2010, 10, 15, 18, 42, 39, 4, 288, 0], "title": "5-qubit quantum error correction in a charge qubit quantum computer", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1010.3571%2C1010.6080%2C1010.3929%2C1010.4538%2C1010.4887%2C1010.0100%2C1010.1344%2C1010.4599%2C1010.2680%2C1010.4994%2C1010.2811%2C1010.3259%2C1010.4044%2C1010.4844%2C1010.5800%2C1010.5898%2C1010.6272%2C1010.1684%2C1010.0487%2C1010.1187%2C1010.1762%2C1010.4780%2C1010.2630%2C1010.1103%2C1010.1757%2C1010.4155%2C1010.1930%2C1010.1582%2C1010.0483%2C1010.2727%2C1010.3408%2C1010.3179%2C1010.0362%2C1010.4997%2C1010.0204%2C1010.3562%2C1010.2713%2C1010.2314%2C1010.3925%2C1010.2868%2C1010.3165%2C1010.3524%2C1010.2238%2C1010.2095%2C1010.3237%2C1010.5672%2C1010.2510%2C1010.1657%2C1010.1088%2C1010.5290%2C1010.0396%2C1010.1621%2C1010.0846%2C1010.4463%2C1010.1601%2C1010.0966%2C1010.5058%2C1010.6029%2C1010.5113%2C1010.5040%2C1010.3738%2C1010.1143%2C1010.1318%2C1010.4893%2C1010.5896%2C1010.5956%2C1010.4178%2C1010.5159%2C1010.2253%2C1010.3321%2C1010.0931%2C1010.1413%2C1010.3756%2C1010.1553%2C1010.0192%2C1010.4389%2C1010.1106%2C1010.2254%2C1010.1765%2C1010.2428%2C1010.6039%2C1010.1924%2C1010.2132%2C1010.1710%2C1010.2439%2C1010.4568%2C1010.2603%2C1010.0499%2C1010.4565%2C1010.3242%2C1010.5511%2C1010.2615%2C1010.5990%2C1010.5737%2C1010.5062%2C1010.2433%2C1010.1139%2C1010.0763%2C1010.5066%2C1010.0390%2C1010.6104&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "5-qubit quantum error correction in a charge qubit quantum computer"}, "summary": "We implement the DiVincenzo-Shor 5 qubit quantum error correcting code into a\nsolid-state quantum register. The quantum register is a multi charge-qubit\nsystem in a semiconductor environment, where the main sources of noise are\nphase decoherence and relaxation. We evaluate the decay of the density matrix\nfor this multi-qubit system and perform regular quantum error corrections. The\nperformance of the error correction in this realistic system is found to yield\nan improvement of the fidelity. The fidelity can be maintained arbitrarily\nclose to one by sufficiently increasing the frequency of error correction. This\nopens the door for arbitrarily long quantum computations.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1010.3571%2C1010.6080%2C1010.3929%2C1010.4538%2C1010.4887%2C1010.0100%2C1010.1344%2C1010.4599%2C1010.2680%2C1010.4994%2C1010.2811%2C1010.3259%2C1010.4044%2C1010.4844%2C1010.5800%2C1010.5898%2C1010.6272%2C1010.1684%2C1010.0487%2C1010.1187%2C1010.1762%2C1010.4780%2C1010.2630%2C1010.1103%2C1010.1757%2C1010.4155%2C1010.1930%2C1010.1582%2C1010.0483%2C1010.2727%2C1010.3408%2C1010.3179%2C1010.0362%2C1010.4997%2C1010.0204%2C1010.3562%2C1010.2713%2C1010.2314%2C1010.3925%2C1010.2868%2C1010.3165%2C1010.3524%2C1010.2238%2C1010.2095%2C1010.3237%2C1010.5672%2C1010.2510%2C1010.1657%2C1010.1088%2C1010.5290%2C1010.0396%2C1010.1621%2C1010.0846%2C1010.4463%2C1010.1601%2C1010.0966%2C1010.5058%2C1010.6029%2C1010.5113%2C1010.5040%2C1010.3738%2C1010.1143%2C1010.1318%2C1010.4893%2C1010.5896%2C1010.5956%2C1010.4178%2C1010.5159%2C1010.2253%2C1010.3321%2C1010.0931%2C1010.1413%2C1010.3756%2C1010.1553%2C1010.0192%2C1010.4389%2C1010.1106%2C1010.2254%2C1010.1765%2C1010.2428%2C1010.6039%2C1010.1924%2C1010.2132%2C1010.1710%2C1010.2439%2C1010.4568%2C1010.2603%2C1010.0499%2C1010.4565%2C1010.3242%2C1010.5511%2C1010.2615%2C1010.5990%2C1010.5737%2C1010.5062%2C1010.2433%2C1010.1139%2C1010.0763%2C1010.5066%2C1010.0390%2C1010.6104&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We implement the DiVincenzo-Shor 5 qubit quantum error correcting code into a\nsolid-state quantum register. The quantum register is a multi charge-qubit\nsystem in a semiconductor environment, where the main sources of noise are\nphase decoherence and relaxation. We evaluate the decay of the density matrix\nfor this multi-qubit system and perform regular quantum error corrections. The\nperformance of the error correction in this realistic system is found to yield\nan improvement of the fidelity. The fidelity can be maintained arbitrarily\nclose to one by sufficiently increasing the frequency of error correction. This\nopens the door for arbitrarily long quantum computations."}, "authors": ["Dave Touchette", "Haleemur Ali", "Michael Hilke"], "author_detail": {"name": "Michael Hilke"}, "author": "Michael Hilke", "arxiv_comment": "7 pages, 6 figures, 1 table, submitted to Physical Review A", "links": [{"href": "http://arxiv.org/abs/1010.3242v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1010.3242v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "quant-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1010.3242v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1010.3242v1", "journal_reference": null, "doi": null, "fulltext": "5-qubit Quantum error correction in a charge qubit quantum computer\nDave Touchette, Haleemur Ali and Michael Hilke\nDepartment of Physics, McGill University, Montreal, Québec, H3A 2T8, Canada\n(Dated: October 18, 2010)\n\narXiv:1010.3242v1 [quant-ph] 15 Oct 2010\n\nWe implement the DiVincenzo-Shor 5 qubit quantum error correcting code into a solid-state quantum register. The quantum register is a multi charge-qubit system in a semiconductor environment,\nwhere the main sources of noise are phase decoherence and relaxation. We evaluate the decay of\nthe density matrix for this multi-qubit system and perform regular quantum error corrections. The\nperformance of the error correction in this realistic system is found to yield an improvement of\nthe fidelity. The fidelity can be maintained arbitrarily close to one by sufficiently increasing the\nfrequency of error correction. This opens the door for arbitrarily long quantum computations.\nPACS numbers: 03.67.Pp, 03.67.Lx, 85.35.Be\nKeywords: quantum error correction, 5-qubit code, solid-state quantum register, multi charge-qubit system,\nphase decoherence, relaxation\n\nI.\n\nINTRODUCTION\n\nThe task of building a quantum computer, allowing\nfor massive quantum parallelism [1], long-lived quantum\nstate superposition and entanglement, is one of the big\nchallenge of twenty-first century physics. It requires precise maintenance and manipulation of quantum systems\nat a level far from anything that has ever been done before. Many criteria, nicely summarized by the DiVincenzo criteria [2], need to be satisfied in order to be\nable to harness the power of quantum physics to extract powerful information processing, and while most\nof these criteria have been satisfied to a reasonable level\nby some prospect for the implementation of a quantum\ninformation processing device [3], no such prospect has\nyet been able to fulfill to a sufficient level all of these criteria at once. In particular, one criterion that not many\nprospects seem to be able to fulfill is that of scalability,\nthe ability of the model to remain coherent for quantum\nsystems with a large number of qubits.\nSolid-state quantum registers seem to emerge as a\nmedium that would allow for such scalability, while still\nbeing able to satisfy the other criteria [3]. However, as\nfor any physical implementation of quantum computing,\nit suffers from noise, dissipation processes mainly in the\nform of decoherence and relaxation [4]. To be able to\nuse the power of quantum computation, we must be able\nto eliminate this noise and maintain quantum information throughout the processing. A general framework for\ndoing so is quantum error correction (QEC) [5, 6]. It\nis known that by encoding a single logical qubit on sufficiently many physical qubits, we can correct arbitrary\nerrors on a single physical qubit [5]. But what happens\nwith more realistic multi-qubit errors?\nIn order to perform a quantum error correction, additional qubits are needed. However, these additional\nqubits can lead to a much higher rate of decoherence\n(even superdecoherence) [7, 8]. The implementation of\nthe three-qubit repetition code has already been simulated for a cavity-QED setup [9], showing a significant\nbut limited improvement for the preservation of quantum\n\ninformation. Here, we consider a realistic noise model for\nN charge qubit quantum registers [8], and simulate this\nnoise model on encoded qubits to evaluate the efficiency\nof a QEC scheme. The quantum error correcting code\n(QECC) used is the 5 qubit DiVincenzo-Shor code [10].\nWe structure this work as follows: we first describe the\nrepresentation for quantum systems we will be using, as\nwell as that for the noise model. We then further analyze\nthe physical model we study, and review the QECC we\nimplement within this model. Section VI then contains\nthe core of this work, that is, a description of the algorithm used for the simulation, followed by a discussion of\nthe results obtained.\nII.\n\nREPRESENTATION OF QUANTUM\nSYSTEMS\n\nWe will be considering the basic unit of quantum information: the qubit. A qubit can be implemented by any\ntwo level quantum system, and so can be represented by a\nunit length vector in a two-dimensional complex Hilbert\nspace, up to an equivalence relation for global phase. If\nwe consider some prefered orthonormal basis states |0i\nand |1i, a single qubit can be parametrized by 2 parameters θ ∈ [0, π] and φ ∈ [0, 2π):\n\u0012 \u0013\n\u0012 \u0013\nθ\nθ\n|ψi = cos\n|0i +eiφ sin\n|1i .\n(II.1)\n2\n2\nThis is the Bloch sphere representation, for pure qubit\nsystems.\nWhen considering multiple interacting qubit systems,\nthe overall system is described by the tensor product of\nthe component Hilbert spaces. In general, once two systems have interacted, a complete description of the whole\nsystem cannot be obtained by a description of each subsystem: this is entanglement. Much of the power of quantum information processing comes from entanglement, it\nis a uniquely quantum resource. Note that this is also\nrelated to the difficulty of simulating a multi qubit quantum system: as a N qubit quantum system cannot be\n\n\f2\ncompletely described by each of the N two dimensional\nsubsystems, it must be described by a 2N dimensional\nsystem, so that the memory required to store the information about a N qubit quantum system scales exponentially with N , and so do the time required to simulate\noperations on this system.\nThis also raises the question of the description of subsystems of entangled systems. It turns out that the density operator formalism [11] can solve this issue. In this\nformalism, a state ψ is represented by a density matrix\nρψ = |ψihψ| instead of by a state vector |ψi. Then, if\nwe are only interested in subsequent evolution of a particular subsystem of the state ψ, we can do a partial\ntrace [11] over the other irrelevant subsytems and only\nevolve the reduced density matrix of the subsystem of\ninterest. In this way, we obtain the right outcome statistic on this subsystem while not having to evolve a highdimensionality state as required to describe the whole\nsystem completely. This density operator formalism also\ncomes in handy for the description of statistical ensembles {pi , |ψi i}, where the system is prepared in the state\n|ψi i with probability\npi . The corresponding density opP\nerator is ρ = i pi |ψi ihψi |, and here also the evolution of\nthis state leads to the right measurement statistics.\nA closely related subject is that of quantum noise. As\na quantum system cannot ever be completely isolated\nfrom its environment, they interact and then become entangled. So, even though the global system-environment\npair undergoes unitary evolution, the main system does\nnot, and this generates quantum noise. This is well described by the quantum operation formalism [11]. Two\ntypes of noise in which we will be mostly interested will\nbe decoherence and relaxation, and we will see that these\nare closely related to generalized dephasing channels [12]\nand amplitude damping channels respectively [11, 13].\nSince the quantum system of interest will be subject\nto noise, we want a way to quantitatively describe how\nclose it will remain to the initial quantum information\nwe wished to preserve. A good measure of this is the\nfidelity [11, 14], and for a pure input state |ψi evolving\nto a mixed state ρ, the fidelity is given by\nF (|ψi, ρ) =\n\nIII.\n\np\nhψ | ρ |ψi.\n\n(II.2)\n\nQUANTUM NOISE\n\nThe two main types of noise in which we will be interested are decoherence, which correspond to a loss of\nquantum coherence without loss of energy, and relaxation, which correspond to a loss of energy. We will\nsee that these types of noise are closely related to wellstudied channels: generalized dephasing channels [12, 15]\nand amplitude damping channels [11, 13]\n\nA.\n\nGeneralized dephasing channels\n\nGeneralized dephasing channels correspond to physical processes in which there is loss of quantum coherence\nwithout loss of energy. That is, there exist a preferred\nbasis, called the dephasing basis, such that pure states\nin that basis are transmitted without error, but pure superposition get mixed, and quantum information is lost\nto the environment.\nIf we let A be the input system with orthonormal basis\nA\n{|ii }, B be the output system with orthonormal basis\nB\n{|ii }, and E be the environment with normalized, not\nE\nnecessarily orthogonal states {|ξi i }, then an isometric\nmap from the input system to the output-environment\nsystem is given by\nX B\nE\nA\nU A→BE =\n|ii |ξi i hi | .\n(III.1)\ni\n\nThen, starting with an input state ρA , we get the output\nstate σ B by first applying the isometry U A→BE , then\ntracing over E:\nX\nσ B = TrE (U ρA U † ) =\nhi | ρA |ji |iihj|B hξj |ξi i. (III.2)\ni,j\n\nAs we can see, in this representation, the output corresponds to the Hadamard product between the (hi | ρA |ji)\ninput matrix and the (hξi |ξj i† ) decoherence matrix. Also,\nsince the |ξi i are normalized, hξi |ξi i = 1, the diagonal\nterms are left unchanged:\nhi | σ B |ii = hi | ρA |ii .\n\n(III.3)\n\nThese diagonal terms correspond to the probability of\nmeasuring the quantum state in the corresponding dephasing basis state, while the off-diagonal terms are coherence (phase) terms. For these off-diagonal terms, the\nCauchy-Schwarz inequality (|hξi |ξj i|2 ≤ hξi |ξi ihξj |ξj i =\n1) tells us that the output terms must be smaller than\nor equal to the input terms: | hi | σ B |ji | ≤ | hi | ρA |ji |.\nE\nIn the special case where the {|ξi i } are also orthogonal,\nwe obtain a completely dephasing channel, which kills\nall off-diagonal terms, hi | σ B |ji = 0 if i 6= j. For a subsequent measurement in the dephasing basis, this yields\na classical statistical\noutput with no quantum coherence\nP\nterms: σ B = i hi | ρA |ii |iihi|B .\nB.\n\nAmplitude damping channels\n\nAmplitude damping channels correspond to physical\nprocesses in which there is a loss of energy from the\nquantum system of interest to the environment. That is,\nthere is a probability that a quantum state passes from a\nhigher energy excited state to a lower energy state. For\nthe two-dimensional quantum systems in which we are\nmostly interested, this corresponds to a probability of\n\n\f3\npassing from the excited state to the ground state, while\nthe ground state is left unaffected. In the quantum operation formalism, this channel has operation elements\n{E0 , E1 }:\n\u0013\n\u0012 √ \u0013\n\u0012\n1 √ 0\n0 γ\n, E1 =\n,\n(III.4)\nE0 =\n0 0\n0 1−γ\nwhere the matrix representation is given in the energy\neigenbasis, and the parameter γ corresponds to the probability of decay. Then, for some input state ρA , we get\nan output state σ B :\nX\nσB =\nEi ρA Ei† .\n(III.5)\ni=0,1\n\nIf we represent the action of the channel as E, i.e.\nE(ρA ) = σ B , we can extend this definition to multi-qubit\nsystems. Making the assumption that energy lost for\neach two-dimensional subsystem is independent, a tensor product of this channel, E ⊗n , corresponds to a loss of\nenergy in each subsystem independently.\nIV.\n\nFIG. 1: Physical model for the 5-qubit quantum register. The\nqubit geometry is inspired from recent experiments on coherent level mixing in vertical quantum dots [22].\n\nThis leads to the decay of the off-diagonal elements of\nthe N-qubit density matrix. The structure of this decay\nis non-trivial and is shown in FIG. 2. In general, this\nleads to an error, which cannot be reduced to a single\nqubit error.\n\nDECOHERENCE AND RELAXATION IN\nCHARGE QUBIT REGISTERS\n\nSolid state quantum systems represent an interesting prospect for the physical implementation of scalable\nquantum devices [3]. A lot of research goes into implementation of superconducting qubits [16, 17]. Another\nimportant avenue of research are quantum dots, in which\ntwo level quantum systems can be implemented in either\nthe spin or position degree of freedom of the electron\ntrapped in the dots. While spin quantum dots have a\nlonger decoherence time [18, 19], spins are also more difficult to manipulate. In charge quantum dots, where the\nbasis states correspond to the position of the electron\nin either of two adjacent quantum dots, the coupling is\nstrong and hence fast manipulation is possible, but this\nalso leads to shorter decoherence times. We will consider\nsuch a system, which offers an interesting playground for\ncurrent technology research [20, 21]. Moreover, the decoherence for N qubit quantum registers, which can be\nseen in FIG. 1, has already been computed by Ischii et al.\n[8], and it is this model which is used in this simulation.\nIt is found that for these charge quantum dots, the decoherence of the quantum system can be represented as\na generalized dephasing channel in the canonical basis of\nthe charge qubits, corresponding to the position eigenstates. Indeed, pure states in that basis are perfectly\ntransmitted, while pure superpositions become noisy. It\nis then possible to compute the evolution of the quantum\nregister by taking the Hadamard product of the input\ndensity matrix with a decoherence matrix computed in\n[8], thus getting the decohered output state. We chose\nas physical timescale unit ω0 , which corresponds to the\nupper cut-off frequency. In charge qubits in GaAs we\ntypically have\nω0 = 0.2 × 10−10 s.\n\n(IV.1)\n\n log(  )\n\nT=10mK; t=0.1ωc\n\n log(  )\n\nT=1K; t=1ωc\n\n0.45\n0.02\n\n30\n\n30\n0.4\n\n0.018\n25\n\n0.016\n\n25\n\n0.35\n\n0.014\n20\n\n0.3\n20\n\n0.012\n0.01\n\n15\n\n0.25\n15\n\n0.2\n\n0.008\n0.15\n10\n\n0.006\n\n10\n0.1\n\n0.004\n5\n\n0.002\n5\n\n10\n\n15\n\n20\n\n25\n\n30\n\n5\n\n0.05\n\n5\n\n10\n\n15\n\n20\n\n25\n\n30\n\n log( 1,32 )\n\n log( 1,1 )\n\n00000 | 00000\n\n11111 | 00000\n\nFIG. 2: (Color online) Matrix elements of the decay function\ndensity matrix due to decoherence.\n\nIn addition, this decoherence model does not take into\naccount any relaxation the system might be subject to.\nWe assume that the relaxation is independent of decoherence, and also that energy loss for each qubit is independent. For each two dimensional quantum subsystem,\nif |0i and |1i correspond to the two position eigenstates,\nthen the two energy eigenstates are |+i = √12 (|0i + |1i)\nfor the ground state, and |−i = √12 (|0i − |1i) for the\nexcited state. We can then compute the effect of relaxation by operating a tensor product of amplitude damping channels to each qubit in the register, where the operation elements (III.4) are in the {|+i, |−i} basis. The\ndecay parameter γ is time (t) and temperature (T ) dependent,\nγ = 1 − exp(−t * T ),\nsetting kB = ~ = 1.\n\n(IV.2)\n\n\f4\nV.\n\nQUANTUM ERROR CORRECTION WITH A\nPERFECT 5 QUBIT CODE\n\nM 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15\nEM I Z2 X0 Z3 X3 X1 Z4 Y3 Z1 X4 X2 Y2 Z0 Y1 Y0 Y4\n\nSince our quantum register is subject to noise, we want\nto encode an input quantum state in such a way that\nwe can preserve the quantum information even when the\nphysical system undergoes noise. A general framework\nfor doing this is quantum error correction (QEC) [5, 6],\nwhich encode a logical qubit containing the quantum information on multiple physical qubits, and then usually\nby performing syndrome measurements on these physical qubits, we can determine a certain set of errors, and\napply the corresponding correction [11]. Many quantum\nerror correcting codes (QECC) have been found that can\ncorrect an arbitrary error on a single physical qubit, and\nit is known that the smallest such codes require 5 physical\nqubits [23].\nOne of these 5 qubit codes is the DiVincenzo-Shor\nQECC [10]. The code words for the logical states\n{|0iL , |1iL } are [3]:\n\nTABLE I: Table of the different possible single qubit errors\nEM , with their associated syndrome measurement output M ,\nwhich has binary expension M3 M2 M1 M0 .\n\n|0iL =\n+\n−\n−\n|1iL =\n+\n−\n−\n\n1\n|00000i + |11000i + |01100i + |00110i\n4\n|00011i + |10001i − |10100i − |01010i\n|00101i − |10010i − |01001i − |11110i\n\u0001\n|01111i − |10111i − |11011i − |11101i\n1\n|11111i + |00111i + |10011i + |11001i\n4\n|11100i + |01110i − |01011i − |10101i\n|11010i − |01101i − |10110i − |00001i\n\u0001\n|10000i − |01000i − |00100i − |00010i\n\nwith stabilizers [24]:\nM0 = I ⊗ Z ⊗ X ⊗ X ⊗ Z\nM1 = Z ⊗ I ⊗ Z ⊗ X ⊗ X\nM2 = X ⊗ Z ⊗ I ⊗ Z ⊗ X\nM3 = X ⊗ X ⊗ Z ⊗ I ⊗ Z,\n\n(V.1)\n\nwhich leave the code invariant. The X and Z operators are respectively the X and Z Pauli operators. The\nencoding circuit can be seen in [3]. This is a perfect\nnon-degenerate code, meaning that all single qubit errors map to a different syndrome, as can be seen in TABLE I. To obtain a measurement of the error syndrome,\nwe measure observables in the eigenbasis of each of the\nfour stabilizers in (V.1), and depending on the outcome\nof these four measurements we apply the corresponding\ncorrection from TABLE I.\nAn alternative to these multi-qubit measurements [11]\nis to use ancillary qubits to conditionnally apply each\nof the four stabilizers on a |+i state, thus recording the\nphase (M0-M3 have eigenvalues ±1). Measuring these\nfour ancilla qubits in the {|+i, |−i} basis then gives the\nsame result as above without having to perform multiqubit measurements. This syndrome measurement circuit is given in [3].\n\nThis code is guaranteed to correct any single qubit\nerror, but it is not designed to correct multi-qubit errors,\nwhich our noise model will introduce. It will then be\ninteresting to see how well this code will perform for an\napproximate correction of multi-qubit errors.\n\nVI. QUANTUM ERROR CORRECTION IN A\nCHARGE QUBIT QUANTUM COMPUTER\n\nThe qubit model for physical implementation we consider in this simulation is a charge quantum dot. The two\nprincipal sources of noise with this model are decoherence\nand relaxation.\nThe effect of decoherence on a N -qubit register had\nbeen computed in [8], where decoherence is caracteristic\nof a generalized dephasing channel [12], leaving computational basis states unaffected.\nThe effect of relaxation correspond to a probabilistic\nloss of energy, where the excited state correspond to the\n|−i state, and the ground state correspond to the |+i\nstate. We make the assumption that this relaxation for\neach qubit is independant, so that we implement this\nnoise has a tensor product of an amplitude damping\nchannel in the {|+i, |−i} basis, on each qubit.\nTo counter the effect of noise, we encode a logical qubit\ninto 5 qubits, using the DiVincenzo-Shor QECC, which\ncan perfectly correct errors on a single qubit. However,\nthe noise model used creates errors on multiple qubits,\nand so it is not obvious that QEC with the DiVincenzoShor code can extend the lifetime of our logical qubit.\nHere, we verify the effect of such a quantum error correction scheme, for different input states and different\nfrequencies of correction. The algorithm used for the\nsimulation is presented first, and the results of the simulation are presented next.\n\nA.\n\nImplementation of QEC algorithm\n\nAn overview of the algorithm can be seen in FIG. 3.\nFirst, the logical qubit is encoded into 5 physical qubits\nusing the DiVincenzo-Shor QECC. This encoding is assumed to be perfect. We only consider pure input qubits,\nwhich are completely caracterized by two real parameters corresponding to their position on the Bloch sphere:\nθ ∈ [0, π], φ ∈ [0, 2π).\nAfter encoding, the quantum register is subjected to\nnoise for a given period of time t, depending on the frequency of error correction. In our simulation, the de-\n\n\f5\n\n  0   1\n\n\n\nenc\n\n 0 L   1\n\nRecord Fidelity and Re-loop\n\n\n\n15\nY\n\n0\n\n0\n\nerror, then the QEC circuit is\n\nL\n\nEncoding\n\n\u0001\n†\nEM\n⊗ |M ihM | + I5 ⊗ (I4 − |M ihM |) ,\n\n(VI.1)\n\nM =0\n\nNoise\n\n0\n0\n0\n\nQuantum\nError\nCorrection\n\nAncillary 0\n0\n0\n\nFIG. 3: Overview of the algorithm for the simulation of quantum error correction of a solid-state quantum register.\n\nwhere the order in the operator product is irrelevant since\nthe terms commute.\nFollowing the quantum error correction step, a record\nof the fidelity of this output state compared to the input\nstate is taken. We then reloop over the noise, quantum\nerror correction and fidelity recording steps, until the sum\nof all the noise time steps add up to the desired total time\nof the simulation.\n\nB.\n\nQEC performance\n1.\n\ncoherence noise and the relaxation noise are applied successively, and we checked numerically that the order does\nnot affect the result. The intensity of the noise depends\non the temperature T of simulation, and the probability\nof relaxation is adjusted such that without error correction, after a time ω0 the fidelity of the noisy state with\nrespect to the pure input state is the same as that of\ndecoherence.\nQuantum error correction is then performed. Here we\nassume perfect operation of each component of the QEC\nalgorithm. However, instead of performing the measurement of the syndrome and then applying the corresponding correction (see TABLE I), we defer the measurement\nto the end of the circuit and perform conditional quantum correction [3, 11]. To do so, four ancillary qubits are\nused to record the syndrome measurements. It is possible to avoid multi-qubit measurements by using these\nancillary qubits, but the drawback is that we pass from\na 5 qubit quantum system to a 9 qubit quantum system.\nThis increases the difficulty of physical implementation\nbecause of the additionnal qubits, and also because every\nround of QEC requires four fresh ancilla qubits. This also\nslows the simulation a lot, since we pass from a 25 = 32\ndimensional complex vector space to a 29 = 512 one, and\nthe matrix operations are accordingly scaled.\nAfter performing the conditional QEC, these ancilla\nqubits are traced over, which corresponds to a measurement without a record of the outcome. This gives an\noutput state which is a statistical ensemble corresponding to the different possible corrected states.\nTo perform the conditional quantum error correction,\nwe implement a quantum circuit which would correct for\nthe different errors in TABLE I, corresponding to the\nvalue of the ancilla qubits. If we let |M i correspond to\nthe ancilla state with binary expansion M3 M2 M1 M0 , for\nM running from 0 to 15, and if EM is the corresponding\n\nDecoherence\n\nWe can see on FIG. 4 the results of the simulation\nwhen our quantum register is subject only to decoherence. With a small frequency of error correction of\nω0−1 , the fidelity is already improved over the uncorrected\nqubit. For a basis qubit, either |0i or |1i, we do not have\ndecoherence, but the encoded state does suffer from decoherence. The encoded basis states however do exhibit\nan interesting behavior when they are decohered, but not\nerror corrected. In fact, even though the noise takes the\n5 qubit state out of the code, when decoded we still get\nback the original basis state. For these basis states, we\ncould understand this behavior by noting that the code\nwords for the logical |0i and |1i contain different 5 qubit\nbasis states, as we can see in (V.1). But for pure superposition of these basis states, if we do not error correct\nthe encoded states, it also decoheres in a way such that\nonce decoded, the same state as the unencoded decohered\nstate is obtained, which is even more surprising.\n\n2.\n\nRelaxation\n\nWe can see in FIG. 5 the results of the simulation when\nwe only consider relaxation affecting our quantum register. This type of noise has a stronger temperature dependency and is stronger than decoherence for temperatures\nabove 5 mK, at which point we obtain on average a similar drop in fidelity at 1 ω0 . It is also harder to correct\nthan decoherence. We thus need a much higher frequency\nof quantum error correction to keep the fidelity close to\n1 until we have reached a saturation in relaxation, that\nis we have reached the lowest energy state for the unencoded qubit. This low energy state is the only state\ninvariant under action of the channel.\n\n\f6\n\nFIG. 4: Simulation of quantum error correction with only\ndecoherence. The time between two successive QECs is\n∆t = ω0 . For a total of 1000ω0 , the top curve shows the\nresult of the QEC and the non-corrected 1qubit decoherence is shown\ncurve. The input qubit is\n\u0001 in the bottom\n\u0001\n|ψi = cos 21 |0i +ei sin 12 |1i and the temperature is assumed to be 5 mK.\n\nFIG. 5: Simulation of quantum error correction with only\nrelaxation: In the left graph the fidelity as a function of time\nis shown for the same ∆t = ω0 as in FIG. 4. By reducing the\ntime interval between two QECs the fidelity remains close to\none as seen in the right graph. For both graphs, the input\nqubit is the same as in FIG. 4.\n\n3.\n\nSimultaneous decoherence and relaxation\n\nWhen combining the effect of decoherence and relaxation, the frequency of error correction is on the order of\nwhat is needed for relaxation, since relaxation is much\nharder to correct than decoherence. Here too, when taking into account decoherence and relaxation, we are still\nable to maintain the fidelity arbitrarily close to one (see\nFIG. 6). This tells us that even though it may require a\nhigh frequency of quantum error correction, the 5 qubit\ncode is able to correct a realistic multi-qubit error system.\n\nC.\n\nDiscussion\n\nWe have only considered noise in the N-qubit system.\nThat is, an important assumption made for our simulation is that of a perfect operation of the QEC algorithm.\n\nFIG. 6: 1 minus fidelity is shown as a function of time for a\nvery short ∆t = 0.001ω0 . The high-frequency QEC for joint\ndecoherence and relaxation enables the quantum information\nto be preserved almost perfectly. The input qubit is the same\nas in FIG. 4.\n\nHowever, in a realistic fault-tolerant quantum computation (FTQC) [25] , errors will also occur within the\noperation of the gates and measurements, and this also\nduring the QEC steps. Similar concerns led some physicists to wonder if the error model adopted to get to the\nthreshold theorem [26, 27] for FTQC is physical enough\nso that FTQC is possible at all [28]. Hence, such a simulation, with a realistic model for operations, would be an\nimportant step toward determining if physical implementations of quantum computers are possible. It is possible\nthat these types of errors can be corrected in a similar\nmanner, but this is beyond the scope of this work.\nThe model considered introduces multi-qubit errors,\nwhich are much smaller than full single-qubit ones when\nthe time evolution is very short. At the lowest order,\nwe showed that these small multi-qubit errors can be\ncorrected by single-qubit QEC codes. However, this increases the required QEC frequency, but it is certainly\npossible to find other error correcting schemes optimized\nfor multi-qubit errors, which would require a lower QEC\nfrequency.\nAlso, since the decoherence time for charge qubits is\nshort, the frequency of QEC required to maintain good\nfidelity for extended periods is too high to be feasible\nexperimentally with current techniques. However, this is\na proof of principle and it is reasonable to expect that\nfor other implementations of qubits like spin qubits or\nsuperconducting qubits, where decoherence times can be\nmuch longer, similar performances would require a QEC\nfrequency that is attainable experimentally.\n\nVII.\n\nCONCLUSION\n\nWe have simulated the implementation of the 5 qubit\nDiVincenzo-Shor QECC for a charge qubit quantum register. The register was subjected to a realistic noise\n\n\f7\nmodel, consisting of decoherence and relaxation. Even\nthough the QECC is designed to perfectly correct only\nsingle qubit errors, an application of the QEC routine\nwith a high enough frequency was able to limit the effect\nof multi-qubit errors introduced by our noise model. In\nfact, by adjusting the frequency of error correction, we\ncan get the fidelity as close to one as possible, and for\nextended periods of time. When considering both types\nof noise separately, relaxation showed to be harder to error correct than decoherence, requiring higher frequency\n\nof QEC for the same results.\n\n[1] D. Deutsch, Quantum theory, the Church-Turing principle and the universal quantum computer, Proc. R. Soc.\nLond. A, 400:97 (1985).\n[2] D. P. DiVincenzo, The Physical Implementation of\nQuantum Computation, Fortschr. Phys. 48, 771 (2000).\narXiv:quant-ph/0002077v3\n[3] M. Nakahara and T. Ohmi, Quantum Computing: From\nLinear Algebra to Physical Realizations, (CRC Press,\n2008).\n[4] U. Weiss, Quantum dissipative systems, (World Scientific\npublishing co., third ed., 2008).\n[5] P. W. Shor, Scheme for reducing decoherence in quantum\ncomputer memory, Phys. Rev. A 52, 2493 (1995).\n[6] A. Steane, Simple Quantum Error Correcting Codes,\nPhys. Rev. A 54, 4741 (1996). arXiv:quant-ph/9605021v1\n[7] G. M. Palma, K. A. Suominen and A. K. Ekert, Quantum\ncomputers and dissipation, Proc. Roy. Soc. Lond. A 452,\n567 (1996). arXiv:quant-ph/9702001v1\n[8] B. Ischi, M. Hilke and M. Dube, Decoherence in a N-qubit\nsolid-state quantum register, Phys. Rev. B 71, 195325\n(2005). arXiv:quant-ph/0411086v2\n[9] C. Ottaviani amd D. Vitali, Implementation of a threequbit quantum error-correction code in a cavity-QED\nsetup, Phys. Rev. A 82, 012319 (2010). arXiv:quantph/1005.3072v2\n[10] D. P. DiVincenzo and P. W. Shor, Fault-Tolerant Error Correction with Efficient Quantum Codes, Phys. Rev.\nLett. 77, 3260 (1996). arXiv:quant-ph/9605031v2\n[11] M. A. Nielsen and I. L. Chuang, Quantum Computation and Quantum Information, (Cambridge Univ. Press,\n2000).\n[12] I. Devetak and P. W. Shor, The capacity of a quantum\nchannel for simultaneous transmission of classical and\nquantum information, Commun. Math. Phys. 256, 287\n(2005) [ISI]. arXiv:quant-ph/0311131\n[13] V. Giovannetti and R. Fazio, Information-capacity description of spin-chain correlations, Phys. Rev. A 71,\n032314 (2005). arXiv:quant-ph/0405110v3\n[14] B. W. Schumacher, Sending entanglement through noisy\nquantum channels, Phys. Rev. A 54, 2614 (1996).\narXiv:quant-ph/9604023v1\n[15] Kamil Bradler, Patrick Hayden, Dave Touchette, and\nMark M. Wilde, Trade-off capacities of the quantum\nHadamard channels, Phys. Rev. A 81, 062312 (2010).\narXiv:quant-ph/1001.1732v2\n[16] Y. Makhlin, G. Schon and A. Shnirman, Quantum-state\nengineering with Josephson-junction devices, Rev. Mod.\n\nPhys. 73, 357 (2001). arXiv:cond-mat/0011269v1\n[17] G. Wendin and V. S. Shumeiko, Superconducting Quantum Circuits, Qubits and Computing, Prepared for Handbook of Theoretical and Computational Nanotechnology\n(2005). arXiv:cond-mat/0508729v1\n[18] J. M. Elzerman, R. Hanson, L. H. Willems van Beveren,\nB. Witkamp, L. M. K. Vandersypen and L. P. Kouwenhoven, Single-shot read-out of an individual electron spin\nin a quantum dot, Nature 430, 431 (2004). arXiv:condmat/0411232v2\n[19] J.R. Petta, A.C. Johnson, J.M. Taylor, E.A. Laird, A.\nYacoby, M.D. Lukin, C.M. Marcus, M.P. Hanson and\nA.C. Gossar, Preparing, manipulating, and measuring\nquantum states on a chip, Physica E 35, 251 (2006).\n[20] G. Shinkai, T. Hayashi, Y. Hirayama and T. Fujisawa, Controlled resonant tunneling in a coupled doublequantum-dot system, Appl. Phys. Lett. 90 103116 (2007).\n[21] T. Hayashi, T. Fujisawa, H. D. Cheong, Y. H. Jeong, and\nY. Hirayama Coherent Manipulation of Electronic States\nin a Double Quantum Dot, Phys. Rev. Lett. 91, 226804\n(2003). arXiv:cond-mat/0308362v1\n[22] C. Payette, S. Amaha, G. Yu, J. A. Gupta, D. G. Austing, S. V. Nair, B. Partoens, and S. Tarucha, Coherent\nlevel mixing in dot energy spectra measured by magnetoresonant tunneling spectroscopy of vertical quantum dot\nmolecules, Phys. Rev. B 81, 245310 (2010).\n[23] R. Laflamme, C. Miquel, J. P. Paz and W. H. Zurek,\nPerfect quantum error correction code, Phys. Rev. Lett.\n77, 198 (1996). arXiv:quant-ph/9602019v1\n[24] D. Gottesman, A Class of Quantum Error-Correcting\nCodes Saturating the Quantum Hamming Bound, Phys.\nRev. A 54, 1862 (1996). arXiv:quant-ph/9604038v2\n[25] P. W. Shor, Fault-tolerant quantum computation, 37th\nSymposium on Foundations of Computing, IEEE Computer Society Press, 1996, pp. 56-65. arXiv:quantph/9605011v2\n[26] E. Knill, R. Laflamme, Concatenated Quantum Codes,\narXiv:quant-ph/9608012v1.\n[27] D. Aharonov, M. Ben-Or, Fault Tolerant Quantum Computation with Constant Error, Proceedings of the 29th\nAnnual ACM Symposium on Theory of Computing,\n1997, pp. 176-188. arXiv:quant-ph/9611025v2\n[28] M. I. Dyakonov, Is Fault-Tolerant Quantum Computation\nReally Possible?, Future Trends in Microelectronics. Up\nthe Nano Creek, Wiley (2007), pp. 4-18. arXiv:quantph/0610117v1\n\nAcknowledgement\n\nM.H. acknowledges financial support from INTRIQ.\nD.T. acknowledges financial support from a NSERC\nUSRA for the duration of this work.\n\n\f"}