{"id": "http://arxiv.org/abs/1005.2253v1", "guidislink": true, "updated": "2010-05-13T03:03:06Z", "updated_parsed": [2010, 5, 13, 3, 3, 6, 3, 133, 0], "published": "2010-05-13T03:03:06Z", "published_parsed": [2010, 5, 13, 3, 3, 6, 3, 133, 0], "title": "The Environmental Dependence of Galaxy Properties at z=2", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.5154%2C1005.3516%2C1005.1442%2C1005.0389%2C1005.3539%2C1005.3527%2C1005.0552%2C1005.3115%2C1005.4536%2C1005.3367%2C1005.3303%2C1005.1112%2C1005.0671%2C1005.0403%2C1005.3011%2C1005.0083%2C1005.3812%2C1005.3358%2C1005.4236%2C1005.4539%2C1005.5386%2C1005.5539%2C1005.5380%2C1005.3803%2C1005.4163%2C1005.3941%2C1005.4813%2C1005.3733%2C1005.3162%2C1005.5056%2C1005.2360%2C1005.4348%2C1005.2710%2C1005.4831%2C1005.3683%2C1005.0686%2C1005.3033%2C1005.0461%2C1005.4005%2C1005.2040%2C1005.4025%2C1005.1815%2C1005.5379%2C1005.5522%2C1005.3774%2C1005.3831%2C1005.3918%2C1005.1146%2C1005.0278%2C1005.4611%2C1005.0154%2C1005.4225%2C1005.0346%2C1005.3495%2C1005.3052%2C1005.3550%2C1005.0539%2C1005.5111%2C1005.2022%2C1005.2011%2C1005.4670%2C1005.2636%2C1005.3232%2C1005.1817%2C1005.3097%2C1005.1605%2C1005.3782%2C1005.4353%2C1005.4815%2C1005.5511%2C1005.2253%2C1005.4891%2C1005.2748%2C1005.1686%2C1005.2524%2C1005.5675%2C1005.0216%2C1005.1587%2C1005.0260%2C1005.1744%2C1005.1729%2C1005.3126%2C1005.3549%2C1005.0733%2C1005.2291%2C1005.5063%2C1005.2440%2C1005.2398%2C1005.0889%2C1005.3726%2C1005.4849%2C1005.4954%2C1005.3084%2C1005.5465%2C1005.0075%2C1005.2289%2C1005.0835%2C1005.5025%2C1005.0973%2C1005.0414%2C1005.4947&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "The Environmental Dependence of Galaxy Properties at z=2"}, "summary": "We report on the environmental dependence of galaxy properties at z=2.15. We\nconstruct multi-band photometric data sets in the (proto-)cluster PKS1138-26\nfield and in the GOODS field. We then fit spectral energy distributions of the\ngalaxies with model templates generated with the latest stellar population\nsynthesis code and derive physical properties of galaxies from the fits. To\nquantify the environmental dependence of galaxy properties, a special care is\ntaken of systematic errors -- we use data sets that have almost the same\nwavelength samplings, use the same code to fit SEDs with the same set of\ntemplates, and compare relative differences between the two samples. We find\nthat the PKS1138 galaxies have similar ages, shorter star formation time\nscales, lower star formation rates, and weaker dust extinction compared to the\nGOODS galaxies at z~2. This trend is similar to that observed locally,\nsuggesting that the environmental dependence of galaxy properties is already\npartly in place as early as z=2.15. We show that the PKS1138 galaxies assemble\nthe bulk of their masses ~1 Gyr earlier than field galaxies, i.e., the galaxy\nformation depends on environment. Galaxy mergers should frequently occur during\nthe first collapse of clusters and they might play an important role in driving\nthe observed environmental dependence of galaxy properties at z=2.15.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1005.5154%2C1005.3516%2C1005.1442%2C1005.0389%2C1005.3539%2C1005.3527%2C1005.0552%2C1005.3115%2C1005.4536%2C1005.3367%2C1005.3303%2C1005.1112%2C1005.0671%2C1005.0403%2C1005.3011%2C1005.0083%2C1005.3812%2C1005.3358%2C1005.4236%2C1005.4539%2C1005.5386%2C1005.5539%2C1005.5380%2C1005.3803%2C1005.4163%2C1005.3941%2C1005.4813%2C1005.3733%2C1005.3162%2C1005.5056%2C1005.2360%2C1005.4348%2C1005.2710%2C1005.4831%2C1005.3683%2C1005.0686%2C1005.3033%2C1005.0461%2C1005.4005%2C1005.2040%2C1005.4025%2C1005.1815%2C1005.5379%2C1005.5522%2C1005.3774%2C1005.3831%2C1005.3918%2C1005.1146%2C1005.0278%2C1005.4611%2C1005.0154%2C1005.4225%2C1005.0346%2C1005.3495%2C1005.3052%2C1005.3550%2C1005.0539%2C1005.5111%2C1005.2022%2C1005.2011%2C1005.4670%2C1005.2636%2C1005.3232%2C1005.1817%2C1005.3097%2C1005.1605%2C1005.3782%2C1005.4353%2C1005.4815%2C1005.5511%2C1005.2253%2C1005.4891%2C1005.2748%2C1005.1686%2C1005.2524%2C1005.5675%2C1005.0216%2C1005.1587%2C1005.0260%2C1005.1744%2C1005.1729%2C1005.3126%2C1005.3549%2C1005.0733%2C1005.2291%2C1005.5063%2C1005.2440%2C1005.2398%2C1005.0889%2C1005.3726%2C1005.4849%2C1005.4954%2C1005.3084%2C1005.5465%2C1005.0075%2C1005.2289%2C1005.0835%2C1005.5025%2C1005.0973%2C1005.0414%2C1005.4947&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We report on the environmental dependence of galaxy properties at z=2.15. We\nconstruct multi-band photometric data sets in the (proto-)cluster PKS1138-26\nfield and in the GOODS field. We then fit spectral energy distributions of the\ngalaxies with model templates generated with the latest stellar population\nsynthesis code and derive physical properties of galaxies from the fits. To\nquantify the environmental dependence of galaxy properties, a special care is\ntaken of systematic errors -- we use data sets that have almost the same\nwavelength samplings, use the same code to fit SEDs with the same set of\ntemplates, and compare relative differences between the two samples. We find\nthat the PKS1138 galaxies have similar ages, shorter star formation time\nscales, lower star formation rates, and weaker dust extinction compared to the\nGOODS galaxies at z~2. This trend is similar to that observed locally,\nsuggesting that the environmental dependence of galaxy properties is already\npartly in place as early as z=2.15. We show that the PKS1138 galaxies assemble\nthe bulk of their masses ~1 Gyr earlier than field galaxies, i.e., the galaxy\nformation depends on environment. Galaxy mergers should frequently occur during\nthe first collapse of clusters and they might play an important role in driving\nthe observed environmental dependence of galaxy properties at z=2.15."}, "authors": ["Masayuki Tanaka", "Carlos De Breuck", "Bram Venemans", "Jaron Kurk"], "author_detail": {"name": "Jaron Kurk"}, "author": "Jaron Kurk", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361/200913939", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1005.2253v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1005.2253v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "15 pages, 15 figures, accepted for publication in A&A.", "arxiv_primary_category": {"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.CO", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1005.2253v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1005.2253v1", "journal_reference": null, "doi": "10.1051/0004-6361/200913939", "fulltext": "c ESO 2018\n\nAstronomy & Astrophysics manuscript no. 1138 ̇sedfit\nOctober 30, 2018\n\nThe Environmental Dependence of Galaxy Properties at z = 2\nM. Tanaka1,2 , C. De Breuck1 , B. Venemans1 , and J. Kurk3\n1\n2\n\narXiv:1005.2253v1 [astro-ph.CO] 13 May 2010\n\n3\n\nEuropean Southern Observatory, Karl-Schwarzschild-Str. 2 D-85748 Garching bei München, Germany e-mail: mtanaka@eso.org\nInstitute for the Physics and Mathematics of the Universe, The University of Tokyo, 5-1-5 Kashiwanoha, Kashiwa-shi, Chiba 2778583, Japan\nMax-Planck-Institut für extraterrestrische Physik, Giessenbachstrasse, D-85748 Garching bei München, Germany\n\nReceived; accepted\nABSTRACT\n\nWe report on the environmental dependence of galaxy properties at z = 2.15. We construct multi-band photometric data sets in\nthe (proto-)cluster PKS1138-26 field and in the GOODS field. We then fit spectral energy distributions of the galaxies with model\ntemplates generated with the latest stellar population synthesis code and derive physical properties of galaxies from the fits. To quantify\nthe environmental dependence of galaxy properties, a special care is taken of systematic errors – we use data sets that have almost the\nsame wavelength samplings, use the same code to fit SEDs with the same set of templates, and compare relative differences between\nthe two samples. We find that the PKS1138 galaxies have similar ages, shorter star formation time scales, lower star formation rates,\nand weaker dust extinction compared to the GOODS galaxies at z ∼ 2. This trend is similar to that observed locally, suggesting that\nthe environmental dependence of galaxy properties is already partly in place as early as z = 2.15. We show that the PKS1138 galaxies\nassemble the bulk of their masses ∼ 1 Gyr earlier than field galaxies, i.e., the galaxy formation depends on environment. Galaxy\nmergers should frequently occur during the first collapse of clusters and they might play an important role in driving the observed\nenvironmental dependence of galaxy properties at z = 2.15.\nKey words. Galaxies : clusters : individual : PKS1138-26, Galaxies : formation, Galaxies : fundamental parameters\n\n1. Introduction\nThe formation and evolution of galaxies in the Universe are\ndependent on environment in which galaxies live. In the local\nUniverse, red early-type galaxies are the dominant population in\nrich galaxy clusters, while blue late-type galaxies are the dominant population in the low-density field. Not only galaxy properties, but the formation epoch of galaxies also depends on environment in the sense that cluster galaxies form earlier than\nfield galaxies (e.g., Kuntschner et al. 2002; Gebhardt et al. 2003;\nThomas et al. 2005). Earlier studies concentrated on nearby\ngalaxies, but with the recent advent of large telescopes, environment studies at z ∼ 1 became possible. Interestingly, the environmental dependence of galaxy properties observed at z ∼ 1 is\nalready strong; clusters at z ∼ 1 are dominated by red earlytype galaxies (e.g., Blakeslee et al. 2003; Nakata et al. 2005;\nPostman et al. 2005; Lidman et al. 2008; Mei et al. 2009, but see\nalso Cucciati et al. 2006). Also, the formation epoch of cluster galaxies measured at z ∼ 1 is consistent with that observed locally (Gobat et al. 2008) . Although there is a clear\nsign of galaxy evolution between z = 1 and 0 (e.g., Elbaz et al.\n2007; Cooper et al. 2008), one has to observe galaxies at even\nhigher redshifts to fully quantify the environmental dependence\nof galaxy formation and evolution.\nBecause of observational difficulties, only a few high redshift clusters are known so far, the highest redshift cluster being at z = 1.45 (Stanford et al. 2006). Higher redshift galaxies\nappear fainter and their rest-frame optical light migrates to the\nnear-IR, where the sky background is brighter and it is challenging to observe faint galaxies. Furthermore, high redshift clusters are poor clusters as they are still fast growing according to\nSend offprint requests to: M. Tanaka\n\nthe dark matter halo growth models (Press & Schechter 1974;\nSpringel et al. 2005). Such poor clusters are difficult to locate\ndue to their weak density contrasts to the general field. There are\na number of ways to find high redshift clusters, but one of the\nproven techniques is to look around high redshift radio galaxies (Miley & De Breuck 2008). While not all the radio galaxies are in over-density regions, many of them host clear overdensities of galaxies around them (Venemans et al. 2007) and\nthey are called proto-clusters. Although over-densities of red\nmassive galaxies are not necessarily confirmed around them,\nthey likely virialize and evolve to clusters at lower redshifts.\nAmong the several proto-clusters reported so far, PKS1138-26 at\nz = 2.15 is one of the most promising proto-clusters for its clear\nover-density of spectroscopically confirmed galaxies by previous studies (Miley & De Breuck 2008).\nEarly studies of the the PKS1138-26 radio galaxy at z = 2.15\nwere performed by Pentericci et al. (1997, 1998), who reported\na clumpy morphology of the radio galaxy. Followed by these initial observations, Kurk et al. (2000) first reported an over-density\nof star forming galaxies around the radio galaxy. This region\nwas then followed up by several authors. Pentericci et al. (2000)\nperformed spectroscopic follow-up observations of Lyman α\nemitters reported in Kurk et al. (2000) and confirmed 14 galaxies close to the radio galaxy redshift. Kurk et al. (2004b,a) carried out further imaging and spectroscopic observations of the\nfield targeting Hα emitters and confirmed another 10 galaxies\nat the cluster redshift. An X-ray observation has also been performed (Pentericci et al. 2002) and follow-up spectroscopy confirmed at least 5 X-ray sources at the cluster redshift (Croft et al.\n2005). By now, there are more than 20 objects confirmed at\nthe cluster redshift. Detailed analyses of the radio galaxy and\nthe surrounding region with the superb resolution imaging with\n1\n\n\fTanaka et al.: The Environmental Dependence of Galaxy Properties at z = 2\n\nHST have also been performed (Miley et al. 2006; Zirm et al.\n2008; Hatch et al. 2008, 2009), which added further lines of\nevidence for the forming (proto-)cluster. In fact, Zirm et al.\n(2008) reported on the forming cluster red sequence. Recently,\nDoherty et al. (2009) carried out a near-IR spectroscopic followup observation and confirmed two massive red galaxies at the\ncluster redshift.\nGiven the the convincing over-density of galaxies and\nwealth of imaging and spectroscopic data available in the field,\nPKS1138 is an ideal sample to study the environmental dependence of galaxy properties at this high redshift. In this paper, we\nperform an extensive analysis of galaxies around PKS1138 to\nquantify the environmental dependence of galaxy evolution and\nformation at z = 2.15.\nThe layout of the paper is as follows. We summarize our\ndata in Section 2. We then describe details of our method of fitting spectral energy distributions of galaxies in Section 3. Before\npresenting our results, we perform extensive sanity checks in\nSection 4. Section 5 presents physical parameters of galaxies\nobtained from the fits as a function of environment at z ∼ 2\nand Section 6 discusses implications of our results for galaxy\nformation. Finally, we summarize the paper in Section 7.\nUnless otherwise stated, we adopt H0 = 70km s−1 Mpc−1 ,\nΩM = 0.3, and ΩΛ = 0.7. Magnitudes are on the AB system. We\nuse the following abbreviations: IMF for initial mass function,\nSED for spectral energy distribution and SFR for star formation\nrate.\n\n2. Data\nWe use two data sets for the purpose of this paper. One is from\nthe (proto-)cluster field PKS1138 to examine galaxies in an overdensity region at z = 2.15. The other one is from GOODS for a\nfield counterpart for comparison. We summarize the two sets of\ndata in this section.\n2.1. PKS1138\n\nThe field has been imaged by several instruments - U-band\nwith LRIS on Keck (Zirm et al. 2008), R band with FORS on\nVLT (Kurk et al. 2000, 2004b), J, K s bands with MOIRCS on\nSubaru (Kodama et al. 2007), 3.6 − 8.0μm with IRAC and 24μm\nwith MIPS on Spitzer (Seymour et al. 2007). In addition to these\npublished data, we used z-band data taken with FORS2 on VLT\nand H-band data with SOFI on NTT, which were obtained as a\nfiller target of other programs and have not been published elsewhere. The z and H-band data were reduced in a standard manner. We further supplemented the data set with superb resolution imaging by the ACS on-board the HST (Miley et al. 2006).\nWe retrieved the pipeline reduced g and I band images from the\nHubble Legacy Archive. Table 1 summarizes the data.\nThe photometric zero points for the ground-based opticalnearIR images were obtained from the standard star observations. As pointed out by Doherty et al. (2009), the J and K s band\nphotometric zero-points used in Kodama et al. (2007) were off\nby ∼0.3 mag. We re-measured the zero points from the standard stars observed in the same nights and adopted those revised zero points. For the ACS images, we used the zero points\nfrom Sirianni et al. (2005). We have checked all the zero points\nagainst stars from Gunn & Stryker (1983). We convolved the\nSEDs of stars from Gunn & Stryker (1983) with filter responses\nand atmosphere and derive synthesized magnitudes of stars. We\nthen compared the observed sequence of stars with the synthe2\n\nsized sequence on color-color diagrams with various color combinations. We found small zero point offsets with respect to the\nGunn & Stryker (1983) stars and corrected for them to better\nmatch with Gunn & Stryker (1983). The applied offsets were\ntypically . 0.05 mag and the largest was 0.20 mag to the Uband.\nObjects were detected using sextractor (Bertin & Arnouts\n1996) in the individual optical and near-IR bands because the\nseeing sizes vary from band to band and we did not smooth them\nto a common seeing. We used MAG AUTO with aperture corrections assuming point sources for the optical and near-infrared\nphotometry. For the IRAC images, we performed aperture photometry using the K s -band image for object detections. We then\napplied aperture corrections to obtain the total fluxes.\nThe aperture corrections were estimated as follows. We first\nconstructed an average PSF image using bright, unsaturated stars\nin each band. Then we randomly distributed PSF objects in the\nimages and repeated the object detection and photometry. The\ndifferences between the input magnitudes and measured magnitudes were used for the aperture corrections. We also estimated\ndetection limits for point sources and they are summarized in\nTable 1. The last column in the table shows the 50% detection\nlimits. For images taken with ground-based facilities, apparent\nsizes of faint sources are small and magnitude limits for point\nsources are a reasonable proxy for extended sources. For the\nACS data, the magnitude limits for point sources are extremely\ndeep due to the superb resolution. We measured typical magnitudes of the detected extended sources where their errors become\n0.3 magnitude (i.e., ∼ 3σ limits) and adopted them as magnitude\nlimits for extended sources.\nAll the photometric errors were estimated from the sky noise\nin the same aperture sizes as used for objects. The photometric\ncatalogs were cross-correlated with the K s -band catalog within\nthe seeing FWHM of each band, and a K s -band selected catalog\nwas produced. The final catalog contains UgRIzJHK s and IRAC\n3.5, 4.5, 5.8μm photometry and the Galactic extinction was corrected for in each band using the dust map from Schlegel et al.\n(1998). Stars are removed from the catalog based on their compactness and colors (we use a catalog in which stars are not removed only in Section 4.1).\nNote that we have an IRAC 8.0μm image, but we do not use\nit as strong dust emission (e.g., PAH emission at 7.6μm) from\nlow redshift galaxies fall in this band. Our models described\nbelow do not include dust emission. We could in principle run\nphoto-z without the 8μm photometry, select z ∼ 2 galaxies, and\nthen run the full SED fits to the selected galaxies including the\n8um photometry, which does not probe PAH at z ∼ 2. But, that\ncomplicates the error analysis as it is not very straightforward to\nquantify how the errors propagate if we use two different sets of\ntemplates.\nWe also have a MIPS image of the PKS1138 field, but we\nonly use it for a sanity check in Section 4. We apply a magnitude\ncut of K s < 22.5 (∼ 10σ) to the catalog to avoid any significant\nincompleteness effects. Also, we use only galaxies detected in\nmore than 5 bands to ensure reliable SED fitting.\n2.2. GOODS\n\nWe use data from the GOODS-MUSIC sample (Grazian et al.\n2006; Santini et al. 2009) for a field counterpart of the PKS1138\ndata. There is a wealth of data in the GOODS field, but we restrict ourselves to U35 BVIzJHK s and IRAC 3.6, 4.5, 5.8μm data\nfor this work so that we have almost the same wavelength sampling as the PKS1138 data. This is a crucial point of this work\n\n\fTanaka et al.: The Environmental Dependence of Galaxy Properties at z = 2\n\nTable 1. Photometric data for PKS1138.\nBand\nU\ng\nR\nI\nz\nJ\nH\nKs\n3.6μm\n4.5μm\n5.8μm\n8.0μm\n\nInstrument\nLRIS\nACS\nFORS2\nACS\nFORS2\nMOIRCS\nSOFI\nMOIRCS\nIRAC\nIRAC\nIRAC\nIRAC\n\nPSF size\n1.2′′\n0.1′′\n1.0′′\n0.1′′\n0.9′′\n0.7′′\n0.8′′\n0.7′′\n∼ 2.0′′\n∼ 2.0′′\n∼ 2.3′′\n∼ 2.4′′\n\n– age, which is the time since the onset of star formation to the\nobserved epoch.\n50% limit\n26.9\n26.9\n25.3\n26.7\n24.1\n24.9\n22.3\n23.3\n23.1\n22.5\n20.9\n20.6\n\n– if we used more data in the GOODS field, then we would not\nbe able to compare PKS1138 and GOODS due to the different\nlevels of systematic biases in the analyses. Note that we will use\nthe MIPS photometry just for a sanity check in Section 4. The\ndata covers a 78 arcmin2 field, which is limited by the H-band\nfield coverage. We apply the magnitude cut of K s < 22.5 to the\nGOODS catalog and use galaxies with detections in more than 5\nbands as done for PKS1138.\nTo make sure that GOODS is not a peculiar field, we derive galaxy density in the Subaru XMM-Newton Deep Field\n(SXDF) using the photometric data described in Finoguenov et\nal. (2009), which covered approximately 2, 000 arcmin2 . The\ndensity at z ∼ 2 turns out to be similar to the GOODS density; 0.57 ± 0.02 arcmin−2 in SXDF and 0.64 ± 0.09 arcmin−2 in\nGOODS. This suggests that GOODS samples a typical Universe\nat z ∼ 2.\n\n3. The SED Fitting Method\nThe idea of the work is to use the data from the two fields with\nalmost the same wavelength coverage and sampling, feed the\ndata to the same SED fitting code, fit them with the same set of\ntemplates, and discuss relative differences between the two samples. We presented our data sets in the last section. We here describe details of our SED fitting code. The SED fitting procedure\nfollows the conventional χ2 minimizing statistics. We prepare\nmodel templates and compare those templates with the observed\ndata. We then analyze the fits and derive physical parameters out\nof the fits such as SFR and dust extinction. We start with preparing templates and then describe details of the fitting procedure.\n3.1. Model Templates\n\nThe model templates are generated using an updated version of\nthe Bruzual & Charlot (2003) population synthesis code, which\ntakes into account the effects of thermally pulsating AGB stars.\nWe adopt the Salpeter initial mass function1 (Salpeter 1955) to\nkeep consistency with our previous study (Doherty et al. 2009)\nand solar and sub-solar metallicities (Z = 0.02 and 0.008). The\nphysical parameters that go into the templates are\n– star formation time scale (τ) assuming the exponentially declining SFR (i.e., S FR(t) ∝ exp(−t/τ))\n– optical depth of dust extinction in the V-band (τV )\n1\n\nThe Chabrier initial mass function (Chabrier 2003) gives smaller\nSFRs and stellar masses by a factor of ∼ 2 compared to the Salpeter\nIMF. Other than that, it gives the same results as those presented below.\n\nWe allow τ to vary between 0 (single burst) and ∞ (constant\nSFR), and τV between 0 and 10. For the single burst model\n(τ = 0), we assume no dust to mimic the passive evolution. For\nthe other models, we do not assume any correlation between τ\nand τV . We adopt the two component dust extinction model of\nCharlot & Fall (2000). The actual amount of dust applied in the\ntemplates is not simply τV but is dependent on star formation\nhistories. We measure a V-band magnitude of a template and\ncompare it with the V-band magnitude of dust-free template of\nthe same age, τ, and metallicity. The difference between the two\nis AV . Note that we make fine model grids where z ∼ 2 galaxies populate. We implement effects of the intergalactic extinction following Furusawa et al. (2000), who used the recipe by\nMadau (1995) and relaxed the allowed range of extinctions, as\nwe explore the z > 2 Universe. Also, we use SWIRE AGN templates from Polletta et al. (2007) as we might expect an increased\nfraction of AGNs in the PKS1138 region (Pentericci et al. 2002;\nGalametz et al. 2009).\nWe convolve the template spectra redshifted to various\nredshifts with response functions of the detectors and filters\nwith/without atmosphere (we do not convolve atmosphere for\ndata from the space) and generate synthesized fluxes. We use a\nlogical constraint on redshift that the age of a template spectrum\nmust be younger than the age of the Universe at that redshift. We\nhave confirmed that we obtain essentially the same results if we\ndo not use the constraint as we discuss below. The library of the\nsynthesized fluxes for all the template is used to fit the observed\nSEDs of galaxies as detailed below. We use 2 million templates\nin total for both PKS1138 and GOODS.\n3.2. Fitting procedure\n\nWe use the conventional χ2 minimizing statistics to fit the models to the observed data. The fit itself is performed in fluxes, not\nin magnitudes. Non-detections are treated as zero flux with flux\nerrors from the magnitude limits (here we take the 50% detection limits). In this way, we avoid using upper limits in the fits\nand keep the χ2 statistics simple. We impose a prior constraint\nthat all galaxies have stellar masses lower than 6 × 1011 M⊙ . This\nis a reasonable constraint – the most massive galaxies at z ∼ 2\nhave ∼ 5 × 1011 M⊙ (Kriek et al. 2008).\nThe best fitting template gives photometric redshift and\nphysical parameters of galaxies. To be specific, we measure z phot ,\nτ, AV , age, SFR, and stellar mass from the fits. If the best fitting template is an AGN template, then we can not extract these\nparameters except for z phot because there is an non-negligible\ncontribution of AGN to the overall SED. We only use their photometric redshifts.\nAn uncertainty on each parameter is estimated by marginalizing over the parameter of interest and taking an interval of\n∆χ2 = 1. However, all the parameters are correlated and this\nis just a rough error estimate. It is not easy to handle all the covariances correctly, but fortunately, accurate random error estimates are not crucial for our purpose. It is because we discuss\nrelative, systematic differences between the two data sets. We\nshould have the same level of co-variances between the parameters as we use the same code, templates and have almost the\nsame wavelength sampling of SEDs. We therefore take this simple error estimate, but we should bear in mind that our errors are\nnot accurate. Fig. 1 shows an example of our SED fits.\n3\n\n\fTanaka et al.: The Environmental Dependence of Galaxy Properties at z = 2\n\nFig. 1. Sample SED fit. The points are the observed photometry and the spectrum is the best-fitting template spectrum. For\n+0.28\nthis object, we obtain z phot = 2.00+0.16\n−0.49 , age= 0.32−0.24 Gyr,\ninf\n+31\n−1\nτ = 1.0+−0.9\n, AV = 0.81+0.51\n−0.27 mag., SFR= 78−63 M⊙ yr , and\n0.5\n10\nstellar mass of 2.4−1.2 × 10 M⊙ from the fit.\n\nFig. 2. z − K s plotted against u − z for objects brighter than K s =\n22.5. The open squares and dots show objects in PKS1138 and\nGOODS, respectively. Note the sequence of stars in the lower\npart of the plot.\n\n4. Sanity Checks\nBefore we present our results, we perform a few sanity checks to\nmake sure that our results are robust. Here we discuss (1) photometric zero points, (2) accuracy of our photometric redshifts,\n(3) accuracy of the SFR estimates from the SED fits, and (4)\nsecondary burst models.\n4.1. Photometric Zero Points\n\nWe cannot avoid random errors in the photometric zero points,\nbut it is important to make sure that we do not have any systematic zero point offsets as a function of wavelength, which can\ncause color stretches in the color space. For example, if the zero\npoints are systematically fainter in the blue bands, we might get\nhigher extinction and/or older ages from the SED fits.\nThe easiest way to check the color stretch is to look at the\nsequence of stars in color-color diagrams. Fig. 2 is one such plot.\nThe plot shows z − K s vs. u − z of the detected objects brighter\nthan K s = 22.5 in the two samples. One can easily identify the\nstellar sequence in the lower part of the plot. There is no strong\nsystematic offset between the sequence of stars in the PKS1138\nfield and that in the GOODS field. We have also checked various\ncolor combinations and found that the offsets are < 0.1 mags.\nTo accommodate with any possible zero point errors, we add 0.1\nmag in the quadrature to all the magnitude uncertainties in both\nPKS1138 and GOODS catalogs before performing the SED fits\ndescribed in the last section2 .\n4.2. Photometric Redshifts\n\nAnother good check will be to look at the accuracy of photometric redshifts. We want to make sure that we can cull the majority\nof the galaxies at z ∼ 2 with a reasonably small amount of fore/background contamination.\n2\n\nThe addition of random errors is not an ideal way to remedy the\nsystematic errors. But, we apply the additional errors to make sure that\nthe systematic errors do not dominate the overall error budget. The price\nwe have to pay is that the additional errors slightly degrade the accuracy\nof photometric redshifts.\n4\n\nFig. 3. z phot plotted against z spec . The dotted line shows the\nz spec = z phot relation. The squares and circles are K s < 22.5\ngalaxies in PKS1138 and GOODS, respectively. The crosses\nshow objects with χ2ν > 3 both for PKS1138 and GOODS.\n\nFig. 3 compares our photometric redshifts (z phot ) with\nspectroscopic redshifts (z spec ). The spectroscopic redshifts in\nPKS1138 are from Pentericci et al. (2000), Kurk et al. (2004b),\nCroft et al. (2005), and Doherty et al. (2009) and those in\nGOODS are from the GOODS-MUSIC catalog (Grazian et al.\n2006 and references therein). The correlation is reasonably good,\nalthough there are a number of galaxies with wrong photo-z. We\nfind that galaxies with poor fits (the reduced χ2 larger than 3) often have wrong photometric redshifts. We remove those galaxies\nfrom the main analysis. Our results remain unchanged if we do\nnot apply this χ2ν cut as we quantify later.\nA fraction of photo-z outliers (|z spec − z phot |/(1 + z spec) > 0.2)\nis 5% in GOODS over the entire redshift range. Our spectroscopic sample for PKS1138 is strongly skewed at particular redshifts, and we do not quote the numbers for comparison here.\n\n\fTanaka et al.: The Environmental Dependence of Galaxy Properties at z = 2\n\nThe photo-z selection criterion for the main analysis is a trade\noff between the completeness and contamination. The selection\nadopted for the main analysis, z phot = 2.15 within 2σ, is primarily motivated by the rate of recovering the spectroscopically\nconfirmed PKS1138 members (it recovers 6 out of 7 confirmed\nPKS1138 members brighter than K s = 22.5). We have confirmed that our results presented below do not change if we\nchange the selection criterion within a reasonable range (e.g.,\n|z phot − 2.15| < 0.2). The contamination of fore-/background\ngalaxies in our sample used in the main analysis is 36% in\nGOODS, which is estimated from the spectroscopically confirmed galaxies at |z spec − 2.15| > 0.3 with photometric redshift\nconsistent with z phot = 2.15 within 2σ. Note that the numbers\nquoted here should be considered rough estimates because the\nspectroscopic redshifts are collected from various surveys and\nthe sample is quite heterogeneous. As we will show later, contamination due to wrong photometric redshifts (e.g., foreground\ngalaxies at z spec ∼ 1 but with z phot ∼ 2) do not strongly affect\nour conclusions. We note in passing that 6 out of 50 galaxies in\nPKS1138 and 8 out of 50 galaxies in GOODS that are used in\nthe main analysis are spectroscopic members.\nIt is also important to verify that the parameters derived from\nthe SED fits are not strongly affected by the uncertainties in the\nphotometric redshifts. We take into account the random errors\nwhen we discuss differences between PKS1138 and GOODS in\nthe main analysis, but one may worry that photometric redshifts\nmay introduce systematics in the SED fits and in the derived\nparameters.\nTo quantify this, we fit SEDs at redshifts fixed at z spec for\nthe spectroscopic objects. Fig. 4 compares the parameters derived at z spec and those with redshifts as a free parameter. We\nobserve a good correlation between them. In particular, there is\nno strong systematic offsets as shown in the top panel of Table 2,\nwhere we show the median differences between the physical parameters derived at z phot and those at z spec for the spectroscopic\nmembers at z spec ∼ 2.15. The values in the brackets show the\nrate at which the two parameters agree within 1σ. Spectroscopic\nredshifts have narrow errors on all the parameters, but photometric redshifts do not introduce any systematics. We will focus on\nsystematic differences between the two samples in the next section and all the differences we observe are larger than the offsets\nlisted in Table 2. Therefore, the uncertainties in the photometric\nredshifts do not affect our results.\nWe will not use parameters derived at z spec in the main analysis because we would like to show what parameters the contaminant galaxies (i.e., objects with wrong photometric redshifts)\ntypically have and to show that they do not affect our conclusions. Also, the spectroscopic samples are strongly biased towards particular types of galaxies and we do not want to put\na weight on them. For example, many of the spectroscopically\nobserved galaxies in PKS1138 are either emission line objects\nor X-ray sources (Pentericci et al. 2000; Kurk et al. 2004b) and\nthey are not necessarily typical galaxies. We use photometric\nredshift as a free parameter for all the objects so as not to introduce any biases. We have confirmed that our results do not\nchange if we use the parameters derived at z spec where available,\nas expected from Fig. 4.\nFinally, we show that the logical age constraint - the age of\na model template must be younger than the universe at a given\nredshift - does not change our results. The middle panel of Table\n2 quantifies the effect of the age constraint on the derived parameters. We observe no systematic differences and the derived\nparameters of most galaxies agree within 1σ. We can therefore\nsafely apply the constraint in the main analysis. The reason why\n\nTable 2. Differences in the physical parameters derived with\nother models or constraints than the fiducial ones.\nParameter\nage [Gyr]\nSF time scale [Gyr]\nSFR [M⊙ yr−1 ]\nAV [mag]\nage [Gyr]\nSF time scale [Gyr]\nSFR [M⊙ yr−1 ]\nAV [mag]\nage [Gyr]\nSF time scale [Gyr]\nSFR [M⊙ yr−1 ]\nAV [mag]\n\nPKS1138\n+0.13 (75%)\n0 (100%)\n−0.08 (88%)\n0 (100%)\n0 (92%)\n0 (90%)\n0 (76%)\n0 (80%)\n0 (70%)\n0 (72%)\n−0.05 (56%)\n−0.50 (58%)\n\nGOODS\n0 (81%)\n0 (70%)\n−0.6 (81%)\n0 (88%)\n0 (96%)\n0 (100%)\n0 (92%)\n0 (97%)\n0 (79%)\n0 (80%)\n0 (73%)\n−0.75 (37%)\n\nNotes. The top panel shows the median differences between the parameters derived at z phot and those at zspec . The numbers in the parenthesis\nshows the fraction at which the two parameters agree within 1σ. The\nmiddle panel shows the differences we obtain if we do not use the logical age constraint. The numbers in the bottom panel mean the median\ndifferences between parameters from the secondary burst models and\nthose from the fiducial τ models.\n\nFig. 5. SFR from the SED fits plotted against SFR from the\nMIPS data in GOODS (circles), MIPS in PKS1138 (squares) for\ngalaxies around the radio galaxy redshift (z = 2.15). The double\ncircles and squares show the spectroscopically confirmed members in GOODS and PKS1138, respectively, and the crosses are\nconfirmed outliers. Here we plot only galaxies used in the main\nanalysis. The dashed line shows SFRSED = SFRMIPS and the dotted lines show 1 dex offsets.\n\nthe observed offset is zero is because the model grids are discrete\nand many galaxies remain in the same grid. SFRs do not have\ngrids as they are normalized by the observed fluxes of galaxies,\nbut most galaxies have the same best-fitting templates and the\nmedian SFRs remain the same.\n5\n\n\fTanaka et al.: The Environmental Dependence of Galaxy Properties at z = 2\n\nFig. 4. Comparisons between the parameters derived at z spec and z phot . The parameters plotted in the x-axis are derived by fixing\nredshifts at z spec , and those in the y-axis are derived using redshift as a free parameter. The panels show (a) age, (b) star formation\ntime scale τ, (c) SFR, and (4) dust extinction in AV . The squares and circles are objects in PKS1138 and GOODS, respectively. The\nthick symbols show the spectroscopic members (i.e., galaxies at z ∼ 2.15) and pale symbols show non-members. For clarity, we plot\nthe error bars for every 5 objects for non-members. The points are randomly shifted by a small amount to avoid overlapping.\n4.3. SFR from SED Fits\n\nNext, we check the accuracy of the SFRs from the SED fits.\nThere are many ways to derive SFRs of galaxies, but here we\ntake those from the warm dust emission probed by the MIPS\nobservations. We take the conversion from the MIPS flux to\nthe total IR flux by Reddy et al. (2006) and derive SFRs using the formula given by Kennicutt (1998). We have a deep\nMIPS 24μm image in both PKS1138 (Seymour et al. 2007) and\nGOODS (Santini et al. 2009), reaching down to ∼ 40M⊙ yr−1\nand ∼ 15M⊙ yr−1 , respectively, at z = 2.15. It should be possible to measure SFRs from various spectroscopic observations\ncarried out in the GOODS field, but the spectra are not always\npublic.\nWe plot in Fig. 5 SFRs from the SED fits against SFRs from\nMIPS. Note that we plot only galaxies that are detected in MIPS\nand are at z phot = 2.15 within 2σ used in the main analyses\npresented in the following sections. For the GOODS sample,\nthe agreement between SFRSED and SFRMIPS is relatively good,\n6\n\nalthough there are some outliers. Roughly 70% of the galaxies\nhave consistent SFRs from the SED fits and MIPS photometry\nwithin 1 dex at 1σ. Note that SFRMIPS itself must have a significant error given the large scatter in mid-far IR SEDs of galaxies\n(Elbaz et al. 2002).\nThe PKS1138 sample has a similar rate of catastrophic failures to the GOODS sample – 6 out of 24 galaxies (∼ 25%) plotted fall below MIPS SFRs by more than 1 dex, although only\none of them is inconsistent at 1σ. SFRs for the PKS1138 galaxies have larger errors compared to the GOODS SFRs. This is\nbecause some of our optical images in the PKS1138 are shallow compared to the GOODS images. The optical images probe\nrest-frame UV at z ∼ 2 and they are crucial to pin down accurate\nSFRs.\nWe have visually inspected the galaxies with S FRS ED +\nσ(S FR) < 10M⊙ yr−1 (i.e., the upper error is lower than\n10M⊙ yr−1 ) used in the main analysis on the MIPS images. 75%\n(9 out of 12) of galaxies with low SFRs in GOODS are detected\nin MIPS and have S FR MIPS & 40 M⊙ yr−1 . The other three are\n\n\fTanaka et al.: The Environmental Dependence of Galaxy Properties at z = 2\n\nalso detected but have < 20 M⊙ yr−1 . This high fraction of the\nMIPS detection illustrates the fundamental difficulty in distinguishing dusty starbursts from passive galaxies. But, this can be\ndue to wrong photometric redshifts, AGN contamination, or object blending/confusion in the MIPS image due to the large PSF.\nWe have looked at X-ray point sources in the field (Lehmer et al.\n2005) and found that none of the low SFR galaxies are detected.\nWe note in passing that 3 out of 50 GOODS galaxies used in the\nmain analysis are detected in X-rays, but they do not affect our\nresults.\nIn contrast to GOODS, the PKS1138 galaxies used in the\nmain analysis show a difference between low and high SFR\ngalaxies – only ∼ 20% of galaxies (4 galaxies out of 21) with\nS FRS ED + σ(S FR) < 10M⊙ are detected in the MIPS image.\nOur MIPS image reaches S FR MIPS ∼ 40M⊙ at z = 2.15 and if\nall the low SFR galaxies in PKS1138 are forming stars at similar\nrates to the GOODS galaxies, they should have been detected.\nWe will show that PKS1138 galaxies have lower SFRs than\nGOODS galaxies in the next section and the observed lower frequency of the MIPS detections in PKS1138 gives a strong support to this result. We note that Galametz et al. (2009) suggested\nan increased fraction of AGNs in proto-clusters and some of the\nPKS1138 galaxies with low SFRs may host an AGN, boosting\nthe mid-IR flux. In fact, one of the low SFR galaxies that is used\nin the main analysis is detected in X-rays (Pentericci et al. 2002).\nThis is the only object detected in X-rays and used in the main\nanalysis and this object does not affect our result in any way.\nWe admit that the correlation between S FRS ED and those\nmeasured from other methods is not particularly good, and we\ndo not attempt to discuss precise SFRs of individual galaxies.\nInstead, we classify galaxies into two coarse classes by their\nSFRs. We define high SFRs as S FRS ED > 10M⊙ yr−1 , and low\nSFRs are lower than that. We do not try to further subdivide the\nSFRs. However, we will later introduce another class - starbursts\n- as S FRS ED > 100M⊙ yr−1 just to illustrate starbursting populations at the time of cluster formation at very high redshifts.\n4.4. Secondary burst models\n\nAs we discuss later, cluster galaxies may have experienced many\nmergers in the past and the τ models may not reproduce their\nstar formation histories very well. We have implemented a secondary burst on top of the τ models and checked how the results\nchange. We assume an instantaneous burst and add a secondary\nburst either at 0.2, 0.5, 1, 2, and 5 Gyr after the onset of star formation and the burst adds either 10% or 50% of stellar mass of\nthe galaxy.\nThe bottom line of this exercise is that our conclusions remain unchanged. The bottom panel of Table 2 quantifies the difference between the secondary burst models and the τ models.\nWe observe no strong differences in age and τ. The agreement of\nSFRs between the two models is not particularly good, but our\nresults remain unchanged because the systematic differences are\nvery small. The dust extinction shows a poor agreement and a\nsystematic offset in AV . But, the amount of the offset is similar\nin PKS1138 and GOODS, and our conclusion will therefore remain the same as we discuss only relative differences between\nthe two samples.\nThe secondary burst models are probably more realistic than\nthe simple τ models. However, the addition of the secondary\nburst raises the number of free parameters in our SED fitting\nfrom 5 to 7 (or 8 if we allow the star formation time scale of\nthe secondary burst to vary), while we only have 11 broad band\nphotometry points. As this introduces too many degeneracies be-\n\ntween the parameters and the secondary burst complicates the\ninterpretation of the results, we will consider only the τ models\nfor our main analysis in the following sections.\n\n5. Results\nWe now move on to present the results from the SED fits. We\nstress again that we use the two samples with almost the same\nwavelength samplings, feed them to the same code with the same\ntemplates, and discuss the relative differences between the two\nsamples.\nIn what follows, we study galaxies with K s < 22.5, detected\nin more than 5 bands, and being consistent with z phot = 2.15\nwithin 2σ (note the PKS1138 radio galaxy is at z = 2.15). We exclude galaxies with poor fits (χ2ν > 3) as they likely have wrong\nphotometric redshifts as discussed in the last section. We take\nthe same sample definition in both PKS1138 and GOODS, so\nthat we can make a fair comparison. The physical parameters\nwe focus on in this section are age, star formation time scale\n(τ), dust extinction, and SFR. We first present evidence that the\nPKS1138 is indeed an over-density region as suggested by the\nearlier studies. We then move on to discuss physical properties\nof galaxies from the SED fits as a function of environment.\n5.1. Over-density of galaxies in PKS1138\n\nFig. 6 compares the distributions of galaxies around the radio\ngalaxy redshift in the PKS1138 and GOODS fields. We could\nnot obtain a good enough photometric redshift for the PKS1138\nradio galaxy, z phot = 2.38+0.08\n−0.10 (i.e., it is 2.3 σ away from the\nspectroscopic redshift) and it goes out of our main sample. But,\nthe radio galaxy is a powerful AGN and our photometric redshift\nis relatively good for such an extreme object. We show the radio\ngalaxy in Fig. 6 just to illustrate the location of the radio galaxy.\nThe galaxies around PKS1138 are arrayed in a filamentary\nstructure in the east-west direction, and the radio galaxy is located at the center. There is an over-density of galaxies around\nthe central radio galaxy. Interestingly, many of the galaxies\naround the radio galaxy show relatively low SFRs. On the other\nhand, the galaxy distribution in the GOODS field is quite sparse\nand there is no concentration of low SFR galaxies. The surface\ndensities of galaxies (K s < 22.5) are 3.12 ± 0.44 arcmin−2 and\n0.64±0.09 arcmin−2 in PKS1138 and GOODS, respectively, suggesting an over-density of a factor of ∼ 5 in PKS1138, which\nis in rough agreement with Kurk et al. (2004b) who found a\nfactor of ∼ 4 over-density of Hα galaxies. The over-density is\nmore pronounced for bright galaxies ; 0.75 ± 0.22 arcmin−2 and\n0.08 ± 0.03 arcmin−2 for K s < 21.5 (i.e., a factor of 9). All\nthe above numbers for PKS1138 are averaged over the entire\nprobed field and the over-density can be further pronounced if\nwe take only the central part of the PKS1138 field – the density of PKS1138 galaxies within 1′ from the radio galaxy is\n10.2 ± 1.8 arcmin−2 for K s < 22.5 (i.e., a factor of 16) and\n1.59 ± 0.71 arcmin−2 for K s < 21.5 (i.e., a factor of 20).\nOne may wonder that nearby fore-/background structure\nmay be contaminating the structure we observe in PKS1138.\nBut, the contamination should be small because the observed\ngalaxy distribution is similar to the distribution of Hα emitters at\nthe radio galaxy redshift (Kurk et al. 2004b) – weak concentrations of galaxies on the West and South-East of the radio galaxy\nare both seen in the distributions of photo-z selected and Hα selected galaxies. Also, structures at different redshifts are unlikely\nto make a coherent structure around the radio galaxies with a\n7\n\n\fTanaka et al.: The Environmental Dependence of Galaxy Properties at z = 2\n\nFig. 6. Distributions of galaxies with K s < 22.5 at z phot = 2.15 within 2σ in the PKS1138 field (left) and GOODS field (right). The\nfilled circles show galaxies with low SFRs. To be conservative about red galaxies, we define low SFR galaxies as SFR + σ(SFR) <\n10 M⊙ yr−1 (i.e., the upper error is lower than 10 M⊙ yr−1 ). The open circles are galaxies with high SFR. The stars show galaxies\nfit with AGN templates. The double circles and crosses mean spectroscopically confirmed members and outliers, respectively. The\nsizes of the symbols correlate with the K s band luminosity. The top and right axes show comoving scales at z = 2.15.\nconcentration of low SFR galaxies. Zirm et al. (2008) found a\nconcentration of red galaxies selected in J − H colors around\nthe very vicinity of the radio galaxy (. 10′′ ), we do not observe\nsuch a strong concentration of red galaxies, but it might be a concentration of faint galaxies (we use K s < 22.5, while they used\nH < 24.5, roughly corresponding to K s . 24).\nFig. 7 plots color magnitude diagrams of galaxies in the\ntwo fields. We model the location of the red sequence using the\nupdated Bruzual & Charlot (2003) population synthesis models\nfollowing the procedure described in Lidman et al. (2008). The\nmost striking trend is that there is a hint of the red sequence,\nwhich is a ubiquitous feature of galaxy clusters at lower redshifts, at K s . 21 in PKS1138. The bright red galaxies are\naround the model red sequence formed at z f ∼ 4. This suggests that these red galaxies formed the bulk of their stars around\nthat redshift. The possible red sequence in PKS1138 is populated half by galaxies with low SFRs (< 10 M⊙ yr−1 ) and half\nby galaxies with high SFRs, suggesting that the red sequence is\nbeing formed. We note that spectroscopically confirmed contaminant galaxies tend to be blue, and thus the possible red sequence\nin PKS1138 is not due to contamination from fore-/background\ngalaxies. In contrast to PKS1138, there is no clear sign of a red\nsequence in the GOODS field, and there are very few galaxies\nbrighter than K s = 21.\nTo further illustrate the over-density of PKS1138, we plot\nstellar mass functions in Fig. 8. We do not derive volume densities of galaxies as we are probably looking at a coherent structure in redshift in PKS1138, whose size we do not yet know\nprecisely. We simply derive a surface density. The over-density\nof PKS1138 is evident – PKS1138 hosts galaxies more densely\nthan GOODS. We will focus on galaxies more massive than\n8\n\n1011 M⊙ in the next section, for which our samples are nearly\ncomplete in both PKS1138 and GOODS.\nTo sum up, we observe the significant over-density of galaxies and the forming red sequence in the PKS1138. This suggests\nthat there is a proto-cluster (or perhaps a real cluster) around the\nradio galaxy. But, we have to wait for intensive spectroscopic\nfollow-up observations to confirm it. In contrast to PKS1138, we\ndo not observe any possible (proto-)clusters nor red sequence in\nthe GOODS field and the galaxy density is lower. Therefore, the\ntwo samples probe different environments at z ∼ 2 and they provide us with a unique opportunity to quantify the dependence of\ngalaxy properties on density at this high redshift.\n5.2. Physical parameters from the SED fits\n\nWe are now going to look into differences in galaxy properties\nbetween the two environments. We quantify four fundamental\nproperties of galaxies – age (which is time since the onset of star\nformation), star formation time scale, SFR, and dust extinction\nas summarized in Fig. 9. We are aware of the extremely uncertain nature of various parameters gone into the SED fits. For example, initial mass function (IMF) is one of the most uncertain\nassumptions. A number of IMFs are suggested in the literature,\neach of which produce systematically different results, and to\nmake matters worse, IMFs may depend on mode of star formation, e.g., IMFs could become top-heavy during starbursts. Also,\nthe τ models we adopt may not be a good approximation of star\nformation histories of real galaxies, we assume all the stars have\nthe same metallicities, and etc. Again, all the uncertainties are\ninherent in the both samples and we discuss only the relative\n\n\fTanaka et al.: The Environmental Dependence of Galaxy Properties at z = 2\n\nFig. 7. J − K s plotted against K s . The dots are all the detected\ngalaxies in each field and large symbols are galaxies around the\ncluster redshift (z phot = 2.15 within 2σ). The meanings of the\nsymbols are the same as in Fig. 6. Namely, the filled circles and\nopen circles are galaxies with low and high SFRs, and the stars\nare AGNs. The red bright galaxy with K s = 18 in the left panel\nis the PKS1138 radio galaxy. The vertical dashed lines show\nK s = 22.5. and the slanted lines show the 3σ limiting colors.\nThe dotted lines show the location of the model red sequence\nformed at z = 3, 4 and 5 from bottom to top.\n\nFig. 8. Stellar mass functions of galaxies in PKS1138 (open\nsquare) and GOODS (open circle). The vertical dashed line\nshows our stellar mass limit of 1011 M⊙ . The error bars show the\nPoisson errors.\ndifferences between the two samples, which must be the most\nrobust results from the SED fits.\nWe discuss the four parameters derived from the SED fits.\nSince all the parameters are correlated with stellar masses of\ngalaxies and we plot them as a function of stellar mass. Note\nthat we miss a fraction of galaxies with masses lower than\n1011 M⊙ in PKS1138, and we focus on galaxies more massive\nthan 1011 M⊙ . This is a conservative mass cut and our results\nbelow do not suffer from any strong incompleteness effects. But,\nwe keep lower mass galaxies in the plots below to illustrate the\nmass dependency of the four parameters.\nAGE (Fig. 10a) : The age distributions are not significantly different. We find that the fractions of galaxies older than 2 Gyr\nare 0.52 ± 0.19 and 0.42 ± 0.16, respectively3. Recall that the\n3\n\nAs discussed in Section 4.2, we do not use galaxies with poor fits\n(χ2ν > 3). The fractions do not change if we use them; 0.59 ± 0.18\nand 0.42 ± 0.15 for PKS1138 and GOODS, respectively. The fractions\n\nFig. 9. The parameters in the models. We obtain star formation\ntime scale (τ), age, SFR and dust extinction (which is not plotted) from the fits. We then derive the initial SFR (SFR0 ) and the\nepoch when galaxies form 80% of their stars (t0.8 ) and discuss\nthem in Section 6.\nage is the time since the onset of star formation to the observed\nepoch. These face values should be taken with caution because\nwe did not take into account the random errors on the age estimates. We take a Monte-Carlo approach to quantify the difference. We let each data point fluctuate by its error and perform\nthe Mann-Whitney test for each realization. We repeat the simulation for 100,000 times and find that the median probability for\nthe two distribution being drawn from the same parent population is 30%. We obtained < 5% probabilities only in 3% of the\nrealizations. There is no strong evidence for age differences.\nWe note that Steidel et al. (2005) studied a spectroscopically\nconfirmed redshift spike at z = 2.3 and found that galaxies in\nthe spike are older than those outside the spike. Their result may\nappear inconsistent with ours. But, their sample is a collection\nof star forming galaxies, while we probe the entire galaxy\npopulation. A fair comparison cannot be made.\nSTAR FORMATION TIME SCALE, τ (Fig. 10b) : PKS1138\ngalaxies tend to have shorter formation time scales. The fractions of galaxies with τ < 0.5 Gyr are 0.70 ±0.23 and 0.43 ±0.16\nin PKS1138 and GOODS, respectively. The Mann-Whitney\ntest suggests that the τ distributions are likely different (median\nprobability of ∼ 4%). We obtained < 5% probabilities in 52%\nof the Monte-Carlo realizations. As seen in the GOODS data,\nthe fore-/background contaminants do not favor any particular\nτ, and the observed difference is not due to the contamination in\nPKS1138. Combining with the age distribution, most galaxies\nin both fields have age > τ, suggesting that they already formed\nthe bulk of their stars by the time of the observation. The shorter\nformation time scale of PKS1138 is one of the most important\nresults in this paper, and we will further discuss it in the next\nsection.\nSFR (Fig. 10c) : PKS1138 galaxies tend to show weaker star\nformation and lower specific SFRs. The fractions of galaxies\nthat have SFR < 10 M⊙ yr−1 are 0.74 ± 0.24 and 0.33 ± 0.14\nin PKS1138 and GOODS, respectively. The Mann-Whitney\ntest suggests that they are not from the same parent distribution\n(0.7%). The fore-/background contamination tends to have high\nquoted below for the other parameters also remain essentially the same:\n0.72 ± 0.21 and 0.46 ± 0.16 for τ <0.5 Gyr, 0.79 ± 0.22 and 0.38 ± 0.14\nfor SFR < 10 M⊙ yr−1 , and 0.66 ± 0.19 and 0.23 ± 0.10 for AV < 1mag.\n9\n\n\fTanaka et al.: The Environmental Dependence of Galaxy Properties at z = 2\n\nFig. 10. Physical parameters from SED fits plotted against stellar mass for PKS1138 and GOODS in the left and right panels in\neach plot, respectively. The vertical dashed lines show the stellar mass limit, below which we are incomplete. The double-circles and\ncrosses are spectroscopically confirmed members and fore-/background galaxies, respectively. For objects going outside the plotted\nrange, we use the double arrows and open arrows for confirmed members and outliers. (a) top-left: Age plotted against stellar\nmass. (b) top-right: Star formation time scale (τ) plotted against stellar mass. (c) bottom-left: SFR plotted against stellar mass. The\nslanted dashed lines show the specific star formation rates defined by SFR / stellar mass. (d) bottom-right: Dust extinction plotted\nagainst stellar mass. We plot the extinction in units of AV .\nstar formation. They unlikely to contribute to the observed\ndifference. We recall that we obtained a lower frequency of\nMIPS detections in PKS1138 than in GOODS, which gives a\nfurther support to the lower SFRs in PKS1138.\nDUST EXTINCTION (Fig. 10d) : PKS1138 galaxies tend to\nhave less dust, as expected from their low SFRs. The fraction\nof PKS1138 galaxies with AV < 1 is 0.61 ± 0.21 (AV = 1 is a\ntypical amount of dust in local star forming galaxies). Most of\ngalaxies in GOODS are very dusty, and there seems a correlation between stellar mass and dust extinction (e.g., Reddy et al.\n2006). The fraction of AV < 1 galaxies is 0.17±0.09. The MannWhitney test shows that the AV distributions are different (0.1%).\nTo sum up, we find that galaxies in PKS1138 and GOODS\nhave different properties. Interestingly, the trend we observe in\nz < 1 clusters still qualitatively persists even at this high redshift\n10\n\n- we observe galaxies with lower SFR and less dust in higher\ndensity regions, where we see clearer red sequence. The environmental dependence of galaxy properties is already in place at\nz = 2, at least partly. We will further extend the discussion and\nquantify the environmental dependence of galaxy formation in\nthe next section.\n\n6. Discussion\nFrom the extensive SED fits of galaxies in PKS1138 and\nGOODS, we have found that massive galaxies in PKS1138 tend\nto have\n1.\n2.\n3.\n4.\n\nsimilar ages\nshorter star formation time scales\nlower star formation rates\nlower amounts of dust\n\n\fTanaka et al.: The Environmental Dependence of Galaxy Properties at z = 2\n\ncompared to those in GOODS. The combination of first and second points is interesting. Galaxies in PKS1138 and GOODS\nstart forming stars at a similar epoch in a statistical sense, but\nPKS1138 galaxies form more rapidly. We recall that our definition of age is the time since the onset of star formation. The\nthird and fourth points are basically by-products of the first and\nsecond points. At z = 2, PKS1138 galaxies have already undergone intense star formation and their SFRs are rapidly declining, while GOODS galaxies are still actively forming stars\ndue to their longer star formation time scales. This results in\nthe lower SFRs in PKS1138 (third point). The fourth point can\nthen be easily understood given the correlation between between\nSFR and dust amount (lower SFR galaxies have less dust, e.g.,\nHopkins et al. 2003).\nCluster galaxies have a shorter star formation time scale –\nthis is the same trend as observed in z . 1 clusters. For example,\nGobat et al. (2008) showed the same trend in a z = 1.2 cluster based on a photo-spectroscopic analysis. It is striking that\nthe trend holds even at z = 2.15. The difference in the star formation time scale suggests that cluster and field galaxies may\nform in different ways. Let us discuss the formation and evolution of cluster and field galaxies in detail. We first introduce two\nparameters to further quantify the galaxy formation. We then extend the discussion and address the origin of the environmental dependence of galaxy properties observed at lower redshifts.\nWe note a caveat here that our results are based on one (proto)cluster only and the trends we observe may not represent global\ntrends at z = 2. A larger sample of z = 2 clusters should be\ninvestigated to draw a global picture.\n\nFig. 11. S FR0 is plotted against stellar mass. The meanings of\nthe symbols are the same as in Fig. 10.\n\n6.1. The environmental dependence of galaxy formation\n\nWe have age, star formation time scale, and SFR for each galaxy.\nAssuming the exponentially decaying star formation histories,\nwe can estimate the SFR at the onset of star formation, which\nwe call initial SFR (SFR0 ; see Fig. 9). Fig. 11 plots SFR0 as a\nfunction of stellar mass. The cluster galaxies tend to have higher\nSFR0 – the fractions of SFR0 > 1000M⊙ yr−1 are 0.61±0.21, and\n0.39 ± 0.15 in PKS1138 and GOODS, respectively. The MannWhitney test supports this difference (the median probability is\n2% and we obtain < 5% probability in 74% of the realizations).\nPKS1138 galaxies have experienced more intense formation histories. Of course, all this is based on the assumption of the exponentially declining SFRs, and we have ignored effects of galaxygalaxy mergers, which we will discuss later.\nIf galaxies continue to form stars following the exponential\ndecay, we can derive the time when the galaxies form bulk of\ntheir stars. We plot in Fig. 12 the epoch when galaxies form\n80% of the stars that they would have at z = 0 (t0.8 ; see Fig.\n9). PKS1138 galaxies typically formed around z ∼ 3 or higher,\nwhile GOODS galaxies typically formed below z ∼ 3. We recall\nthat we obtained z f ∼ 4 from the location of the red sequence\nin PKS1138 in Section 5.1, which is in agreement with what we\nfind here. We find that 0.61 ± 0.21 of galaxies in PKS1138 form\nthe bulk of their stars at z > 3, while the fraction is 0.17 ± 0.09\nin GOODS. The Mann-Whitney test suggests that they are likely\ndifferent – the median probability is ∼ 8% and we obtained < 5%\nprobabilities in 38% of the realization. Interestingly, the ages of\nthe cluster and field galaxies are not very different (Fig. 10a).\nThe difference in t0.8 is therefore due to their shorter formation\ntime scales. The formation of cluster galaxies is a more intense\nevent, they form in a shorter time scale, and they assemble the\nbulk of their stars earlier by ∼ 1 − 2 Gyr than the field galaxies.\n\nFig. 12. t0.8 is plotted against stellar mass. The meanings of the\nsymbols are the same as in Fig. 10.\n\nFig. 13. The median star formation histories of the PKS1138 and\nGOODS galaxies. The shaded area shows 68 percentile intervals.\n\nTo summarize, we measure the median τ and SFR for >\n1011 M⊙ galaxies and illustrate the differences in star formation histories of galaxies in PKS1138 and GOODS in Fig. 13.\nThis will the summary plot of the paper. As discussed above,\nPKS1138 galaxies have higher SFR0 and shorter τ. PKS1138\n11\n\n\fTanaka et al.: The Environmental Dependence of Galaxy Properties at z = 2\n\nexperience much more intense galaxy formation at early times\nthan GOODS galaxies. The galaxy assemblies are completed in\na short time, and by the time we observe them (∼ 2 Gyr after the\nonset of star formation as shown in Fig. 10a) their SFRs become\nlow. The plot summarizes the points listed at the beginning of\nthis section (except for the fourth one, which is a result of SFRdust correlation).\nThe plot indicates that PKS1138 galaxies and GOODS\ngalaxies did not form in the same way. The formation of cluster\ngalaxies is a more intense event. But, how can massive galaxies\nform on such a short time scale? In general, star formation activities have negative feedback to themselves. Hot, young stars\nionize surrounding gas, which prevents further star formation.\nAlso, supernova explosions of massive stars give negative feedback. If galaxies undergo an AGN phase, it might also give negative feedback. The formation of massive galaxies on a very short\ntime scale may be difficult to understand in this respect, and that\nmakes us speculate that these massive galaxies might have taken\nanother route – mergers.\nGalaxy formation takes place in high peaks of density fluctuations in the Universe. Clusters that we observe today were\nregions of large-scale over-densities, where many density peaks\nwere embedded. On the other hand, field galaxies form in more\nisolated peaks. The current galaxy formation theories predict\nthat small galaxies form first and they form progressively massive galaxies via mergers. In the early Universe, cluster galaxies\nmust have had a lot better chances to merge with other galaxies than field galaxies simply because there are more galaxies\naround them. This accelerated frequency of mergers might be\nthe cause of the rapid formation of cluster galaxies.\nA simple scenario of an equal mass merger can be helpful\nhere to show that mergers tend to make SFR0 higher and push\nt0.8 to higher redshifts. Assuming that two equal mass galaxies\nmerge into a single galaxy, the merger event will double the stellar mass of the galaxy. If the galaxy experiences starburts triggered by the merger, its stellar mass will be more than double\nand its SFR gets lower after the burst. We then observe this massive galaxy with low SFR, and depending on the time elapsed\nafter the burst, we would fit a short τ to this galaxy in order to\nreproduce its low SFR and large stellar mass. In fact, we find that\nthe secondary burst discussed in Section 4.4 reduces the median\nS FR0 of the PKS1138 galaxis by ∼ 30%, although it is still high,\nS FR0 = 1600M⊙ yr−1 , which might indicate that galaxies experienced more than one merger. On the other hand, the S FR0 of\nthe GOODS galaxies remain the same within 10%.\nWe are not yet sure if PKS1138 is a collapsed cluster or currently collapsing proto-cluster. But, even if it is a cluster, it must\nbe a young system, and it is unlikely that galaxies had enough\ntime to be affected by 'nurture' effects such as ram-pressure\nstripping. We may suggest that mergers in the early times of the\ncluster formation may be one of the key processes to establish\nthe environmental dependence of galaxy properties observed at\nlower redshifts. We will further pursue this point in the following\nsection.\n\nFig. 12 shows that only ∼ 1 Gyr has passed since the\nPKS1138 galaxies formed bulk of their stars to the observed\nepoch. Assuming that PKS1138 is a virialized system, we apply a 2σ-clipped gapper method (Beers et al. 1990) and obtain a\nvelocity dispersion of 400 km s−1 using spectroscopic redshifts\nwithin 2 arcmin, corresponding to a physical scale of 1 Mpc,\nfrom the literature (Pentericci et al. 2000; Kurk et al. 2004b;\nCroft et al. 2005). The virial radius (r200 ) of the cluster is 0.32\nMpc, giving a crossing time scale of ∼ 1 Gyr. Therefore, the\ntime elapsed since the bulk formation of the PKS1138 galaxies\nis comparable to the crossing time scale of this cluster. This suggests that nurture effects may not have had enough time to fully\nwork. They may have affected a fraction of galaxies, but they\nprobably could not change the average properties of galaxies.\nWe may be witnessing the nature effects in shaping the environmental dependence in PKS1138.\nWe admit that it is not very straightforward to classify nature\nand nurture effects at this high redshift. Now, let us introduce two\nkinds of mergers; early-epoch mergers and late-epoch mergers.\nWe refer to mergers occur during the first collapse of clusters as\nearly-epoch mergers, and those occur afterwards as late-epoch\nmergers. This is to sort out the two effects, early-epoch mergers being nature effects (initial conditions) and late-epoch mergers being nurture effects (environmental effects). Of course, nurture effects also include ram-pressure stripping, harassment, etc.\nOn the other hand, nature effects do not include these processes\ndriven by the deep potential well or intracluster medium.\nIn this classification, the environmental dependence of\nPKS1138 is likely due to early-epoch mergers because ∼ 1 Gyr\ntime is probably not enough for nurture effects to fully work.\nGalaxy clusters at z ∼ 1 do not give useful information about\nnature effects because nurture effects have had enough time to\nfully operate (∼ 4 Gyr since the formation epoch) and it is not\nstraightforward to disentangle the two effects. Our results suggest that nature effects are strong and they form the basis of the\nenvironmental dependence of galaxy properties. A way to probe\nthe significance of the nature effects is to quantify morphology\nof the PKS1138 galaxies. If early-epoch mergers are an important effect, then we expect to observe more signs of recent interactions in PKS1138 than in GOODS (see below). Also, we\nexpect to observe post-starburst galaxies if galaxies undergone\ninteraction triggered starbursts. A near-IR spectroscopic followup campaign of PKS1138 is currently underway. We will be able\nto study spectral properties of the PKS1138 galaxies, which allow us to look deeper into star formation histories.\nTo sum up, the strong nature effects may shape the environmental dependence of galaxy properties. An ultimate goal of environment studies will be to quantify the relative contribution of\nnature and nurture effects. But, that will require statistical work\non z ∼ 2 (proto-)clusters. Although the possible significance\nof nature effects we suggest here is based only on one (proto)cluster PKS1138, let us further discuss it. It has an interesting\nimplication for the build-up of the cluster red sequence.\n6.3. The massive end of the cluster red sequence\n\n6.2. The Nature effects in the environmental dependence of\ngalaxy properties\n\nGalaxy properties such as colors and morphology are known to\ndepend on environment in which galaxies reside. This environmental dependence is shaped by two effects – nature and nurture\neffects. That is, both how galaxies form and how they evolve are\nimportant.\n12\n\nThe sequence of red early-type galaxies is a ubiquitous feature of galaxy clusters. Over the last few years, there is an accumulating amount of evidence in the literature that the cluster red sequence grows from the massive end to the lowmass end (e.g., Tanaka et al. 2005, 2007; Koyama et al. 2007;\nTanaka et al. 2008; Gilbank et al. 2008). The massive end of the\nred sequence cannot be formed via a simple fading of blue, star\nforming galaxies because such massive blue galaxies do not ex-\n\n\fTanaka et al.: The Environmental Dependence of Galaxy Properties at z = 2\n\nist even at z ∼ 2 (see Fig. 7 and discussions in Faber et al. 2007).\nWe need mergers to form it.\nAn interesting point here is that we observe the brightest\ntip of the red sequence in PKS1138, which was also noted by\nZirm et al. (2008). The massive end of the red sequence in a\nyoung system – this might be due to early-epoch mergers. Earlyepoch mergers might have formed very massive galaxies during\nthe first gravitational collapse of clusters. Early-epoch mergers\nshould occur more frequently in cluster environments than in the\nfield, and that helps explain why we do not observe red sequence\nin GOODS. As suggested by Zirm et al. (2008), the red sequence\nin PKS1138 may be being formed or just formed at the time of\nobservation. This view is further supported by our observation\nthat roughly half of the red sequence galaxies have high SFRs\n(Fig. 10). This formation redshift of z ∼ 2 is in line with predictions from the build-up of the red sequence observed in lower\nredshift clusters (Tanaka et al. 2007).\nWe present in Fig. 14 ACS I-band images of the bright red\ngalaxies in PKS1138 (K s < 21 and J − K s > 1). Here we only\nbriefly discuss their morphologies and a detailed study will be\npresented elsewhere (Zirm et al. in prep). Interestingly, a half\nof the galaxies show disturbed morphology and/or have nearby\ncompanions, lending a support to the picture of the accelerated\nmergers in clusters. Two out of three apparently disturbed galaxies are detected in MIPS. Early-epoch mergers during the first\ncollapse of clusters may form the brightest end of the red sequence, and at the same time, form the basis of the environmental dependence of galaxy properties.\nThe low-mass end of the red sequence is built up at later\ntimes. Nurture effects may come in there. Once clusters form, intracluster gas and deep potential field, in addition to late-epoch\nmergers, can affect galaxies and terminate their star formation\nactivities. In this way, moderate-low mass galaxies could become red and form the low-mass end of the red sequence. The\ncombination of nature and nurture effects may have conspired\nto produce the down-sizing behavior of the observed build-up of\nthe red sequence (e.g., Tanaka et al. 2005).\n6.4. Proto-clusters at higher redshifts\n\nFinally, we finish the discussion with a forecast for future (proto)cluster studies. We can go back in time and see how the\nPKS1138 field looked like at higher redshifts as we have star formation histories of individual galaxies. A caveat of course is that\nwe ignore all the early-epoch mergers occurred before the time\nof the observation (the only way to recover that information is to\nresolve the galaxies into individual stars). Another caveat is that\nwe cannot track spatial positions of galaxies back in time. But,\nPKS1138 is likely a collapsing/collapsed system and it may well\nhave been an over-density region already at z = 4.\nFig. 15 shows distribution of galaxies and their star formation rates evolved back to z = 4. Compared to Fig. 6, galaxies are\nmore actively forming stars on average. Interestingly, galaxies\nin PKS1138 are more actively forming stars and there are more\nstarbursting galaxies with SFR > 100 M⊙ yr−1 than in GOODS.\nThis is in stark contrast to Fig. 6, where we saw that PKS1138\ngalaxies have lower SFRs than those in GOODS. We still observe a hint of a galaxy over density in PKS1138 at z = 4. The\nplots suggest that, as we approach the formation epoch of clusters (i.e., early phase of the gravitational collapse to a massive\ncluster halo), we expect to observe an over density of starbursting galaxies. Along with starbursting galaxies, low SFR galaxies\nalready appear in PKS1138, while such galaxies are extremely\n\nrare in GOODS. At this redshift, low SFR galaxies and starbursting galaxies may co-exist in a forming cluster.\nIt is not easy to show how early-epoch mergers change\nthe picture we see here. But, we still expect to observe starbursting galaxies triggered by early-epoch mergers in collapsing\nclusters with a higher over-densities of lower-mass, pre-merger\ngalaxies. We deem that observations with existing/future submillimeter arrays would be able to discover many forming clusters at high redshifts. In fact, some submm observations of distant radio galaxies have found possible over-densities of dusty\nstarburst populations around them (e.g., De Breuck et al. 2004;\nGreve et al. 2007). Full wavelength observations will be essential for future proto-cluster studies at very high redshifts.\n\n7. Summary\nWe have studied the environmental dependence of galaxy properties at z ∼ 2 based on the multi-band data available in the\n(proto-)cluster field PKS1138 and in GOODS. We have performed the extensive SED fits with a special care for systematic\nbiases between the two samples. The results from the careful\nSED fits suggest that the environmental dependence is at least\npartly in place at this high redshift.\nWe have first shown that PKS1138 is indeed an over-density\nregion with an excess of red galaxies, forming the brightest tip of\nthe red sequence, compared to GOODS. The red galaxies tend to\ncluster around the radio galaxy. These results support the claim\nthat PKS1138 is a (proto-)cluster at z = 2.15. Interestingly, the\nred sequence is populated both by low SFR galaxies and high\nSFR galaxies, suggesting that the red sequence is being formed.\nWe then have looked into detailed properties of galaxies derived from the SED fits. PKS1138 galaxies have similar age (we\ndefine age as time since the onset of star formation), shorter\nstar formation time scale, lower SFR, and less dust compared\nto those in GOODS at similar redshifts. The averaged star formation history of the PKS1138 suggests that the cluster galaxies form on a shorter time scale and they form the bulk of their\nstars ∼ 1 Gyr earlier than the field galaxies, which is consistent with lower redshift observations (e.g., Thomas et al. 2005;\nGobat et al. 2008).\nThe environmental dependence of galaxy properties should\nbe shaped both by nature and nurture effects. The observed environmental dependence at z = 2.15 suggests that nature effects\nmay be a strong effect as the PKS1138 (proto-)cluster is likely\na young system. Possibly an accelerated rate of mergers in collapsing clusters may have played a role there and they may also\nbe the primary cause of the short formation time scale of cluster\ngalaxies. However, further studies on z > 2 (proto-)clusters will\nbe needed to confirm this picture. We expect that star bursting\ngalaxies populate in very high redshift proto-clusters and submillimeter observations may be useful to confirm very high-z\nsystems.\nAcknowledgements. We thank Nick Seymour, Tadayuki Kodama and Andrew\nZirm for providing us with their data on PKS1138, Chris Lidman for reducing the SOFI data obtained at the European Southern Observatory using the\nVery Large Telescope on Cerro Paranal through ESO program 66.A-0597 and\n167.A-0409, and also using the New Technology Telescope on Cerro La Silla\nthrough ESO program 076.A-0670. We thank Ricardo Demarco for helping with\nthe NTT observation, and Stephane Charlot and Gustavo Bruzual for providing us with their latest stellar population synthesis code. We are grateful to the\nanonymous referee for useful comments, which helped improve the paper. This\nwork was supported by World Premier International Research Center Initiative\n(WPI Initiative), MEXT, Japan. JK thanks the DFG for support via GermanIsraeli Project Cooperation grant STE1869/1-1.GE625/15-1. This study is also\nbased on observations made with the NASA/ESA Hubble Space Telescope, and\n\n13\n\n\fTanaka et al.: The Environmental Dependence of Galaxy Properties at z = 2\n\nFig. 14. ACS I-band images of the bright red galaxies.\n\nFig. 15. Same as Fig. 6, but galaxies are evolved back in time to z = 4 assuming the star formation histories obtained from the SED\nfits. The sizes of the symbols correlate with stellar mass. The top and right axes show comoving scales at z = 4.\nobtained from the Hubble Legacy Archive, which is a collaboration between\nthe Space Telescope Science Institute (STScI/NASA), the Space Telescope\nEuropean Coordinating Facility (ST-ECF/ESA) and the Canadian Astronomy\nData Centre (CADC/NRC/CSA).\n\nReferences\nBeers, T. C., Flynn, K., & Gebhardt, K. 1990, AJ, 100, 32\n\n14\n\nBertin, E. & Arnouts, S. 1996, A&AS, 117, 393\nBlakeslee, J. P., Franx, M., Postman, M., et al. 2003, ApJ, 596, L143\nBruzual, G. & Charlot, S. 2003, MNRAS, 344, 1000\nChabrier, G. 2003, PASP, 115, 763\nCharlot, S. & Fall, S. M. 2000, ApJ, 539, 718\nCooper, M. C., Newman, J. A., Weiner, B. J., et al. 2008, MNRAS, 383, 1058\nCroft, S., Kurk, J., van Breugel, W., et al. 2005, AJ, 130, 867\nCucciati, O., Iovino, A., Marinoni, C., et al. 2006, A&A, 458, 39\nDe Breuck, C., Bertoldi, F., Carilli, C., et al. 2004, A&A, 424, 1\n\n\fTanaka et al.: The Environmental Dependence of Galaxy Properties at z = 2\nDoherty et al. 2009, A&A, submitted\nElbaz, D., Cesarsky, C. J., Chanial, P., et al. 2002, A&A, 384, 848\nElbaz, D., Daddi, E., Le Borgne, D., et al. 2007, A&A, 468, 33\nFaber, S. M., Willmer, C. N. A., Wolf, C., et al. 2007, ApJ, 665, 265\nFurusawa, H., Shimasaku, K., Doi, M., & Okamura, S. 2000, ApJ, 534, 624\nGalametz, A., Stern, D., Eisenhardt, P. R. M., et al. 2009, ApJ, 694, 1309\nGebhardt, K., Faber, S. M., Koo, D. C., et al. 2003, ApJ, 597, 239\nGilbank, D. G., Yee, H. K. C., Ellingson, E., et al. 2008, ApJ, 673, 742\nGobat, R., Rosati, P., Strazzullo, V., et al. 2008, A&A, 488, 853\nGrazian, A., Fontana, A., de Santis, C., et al. 2006, A&A, 449, 951\nGreve, T. R., Stern, D., Ivison, R. J., et al. 2007, MNRAS, 382, 48\nGunn, J. E. & Stryker, L. L. 1983, ApJS, 52, 121\nHatch, N. A., Overzier, R. A., Kurk, J. D., et al. 2009, MNRAS, 395, 114\nHatch, N. A., Overzier, R. A., Röttgering, H. J. A., Kurk, J. D., & Miley, G. K.\n2008, MNRAS, 383, 931\nHopkins, A. M., Miller, C. J., Nichol, R. C., et al. 2003, ApJ, 599, 971\nKennicutt, Jr., R. C. 1998, ARA&A, 36, 189\nKodama, T., Tanaka, I., Kajisawa, M., et al. 2007, MNRAS, 377, 1717\nKoyama, Y., Kodama, T., Tanaka, M., Shimasaku, K., & Okamura, S. 2007,\nMNRAS, 382, 1719\nKriek, M., van Dokkum, P. G., Franx, M., et al. 2008, ApJ, 677, 219\nKuntschner, H., Smith, R. J., Colless, M., et al. 2002, MNRAS, 337, 172\nKurk, J. D., Pentericci, L., Overzier, R. A., Röttgering, H. J. A., & Miley, G. K.\n2004a, A&A, 428, 817\nKurk, J. D., Pentericci, L., Röttgering, H. J. A., & Miley, G. K. 2004b, A&A,\n428, 793\nKurk, J. D., Röttgering, H. J. A., Pentericci, L., et al. 2000, A&A, 358, L1\nLehmer, B. D., Brandt, W. N., Alexander, D. M., et al. 2005, ApJS, 161, 21\nLidman, C., Rosati, P., Tanaka, M., et al. 2008, A&A, 489, 981\nMadau, P. 1995, ApJ, 441, 18\nMei, S., Holden, B. P., Blakeslee, J. P., et al. 2009, ApJ, 690, 42\nMiley, G. & De Breuck, C. 2008, A&A Rev., 15, 67\nMiley, G. K., Overzier, R. A., Zirm, A. W., et al. 2006, ApJ, 650, L29\nNakata, F., Kodama, T., Shimasaku, K., et al. 2005, MNRAS, 357, 1357\nPentericci, L., Fan, X., Rix, H., et al. 2002, AJ, 123, 2151\nPentericci, L., Kurk, J. D., Röttgering, H. J. A., et al. 2000, A&A, 361, L25\nPentericci, L., Roettgering, H. J. A., Miley, G. K., Carilli, C. L., & McCarthy, P.\n1997, A&A, 326, 580\nPentericci, L., Roettgering, H. J. A., Miley, G. K., et al. 1998, ApJ, 504, 139\nPolletta, M., Tajer, M., Maraschi, L., et al. 2007, ApJ, 663, 81\nPostman, M., Franx, M., Cross, N. J. G., et al. 2005, ApJ, 623, 721\nPress, W. H. & Schechter, P. 1974, ApJ, 187, 425\nReddy, N. A., Steidel, C. C., Fadda, D., et al. 2006, ApJ, 644, 792\nSalpeter, E. E. 1955, ApJ, 121, 161\nSantini, P., Fontana, A., Grazian, A., et al. 2009, ArXiv e-prints\nSchlegel, D. J., Finkbeiner, D. P., & Davis, M. 1998, ApJ, 500, 525\nSeymour, N., Stern, D., De Breuck, C., et al. 2007, ApJS, 171, 353\nSirianni, M., Jee, M. J., Benı́tez, N., et al. 2005, PASP, 117, 1049\nSpringel, V., White, S. D. M., Jenkins, A., et al. 2005, Nature, 435, 629\nStanford, S. A., Romer, A. K., Sabirli, K., et al. 2006, ApJ, 646, L13\nSteidel, C. C., Adelberger, K. L., Shapley, A. E., et al. 2005, ApJ, 626, 44\nTanaka, M., Finoguenov, A., Kodama, T., et al. 2008, A&A, 489, 571\nTanaka, M., Kodama, T., Arimoto, N., et al. 2005, MNRAS, 362, 268\nTanaka, M., Kodama, T., Kajisawa, M., et al. 2007, MNRAS, 377, 1206\nThomas, D., Maraston, C., Bender, R., & Mendes de Oliveira, C. 2005, ApJ,\n621, 673\nVenemans, B. P., Röttgering, H. J. A., Miley, G. K., et al. 2007, A&A, 461, 823\nZirm, A. W., Stanford, S. A., Postman, M., et al. 2008, ApJ, 680, 224\n\n15\n\n\f"}