{"id": "http://arxiv.org/abs/1112.5326v1", "guidislink": true, "updated": "2011-12-22T14:32:18Z", "updated_parsed": [2011, 12, 22, 14, 32, 18, 3, 356, 0], "published": "2011-12-22T14:32:18Z", "published_parsed": [2011, 12, 22, 14, 32, 18, 3, 356, 0], "title": "Thermal expansion and Grüneisen parameters of Ba(Fe1-xCox)2As2 - a\n  thermodynamic quest for quantum criticality", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1112.3491%2C1112.1090%2C1112.2660%2C1112.5339%2C1112.3237%2C1112.6143%2C1112.3451%2C1112.3014%2C1112.5186%2C1112.3496%2C1112.6228%2C1112.6379%2C1112.4237%2C1112.3806%2C1112.1911%2C1112.5097%2C1112.5953%2C1112.1476%2C1112.0204%2C1112.5423%2C1112.0749%2C1112.5351%2C1112.4781%2C1112.3282%2C1112.5163%2C1112.5920%2C1112.1281%2C1112.4919%2C1112.5029%2C1112.2675%2C1112.6194%2C1112.5326%2C1112.3708%2C1112.1630%2C1112.0225%2C1112.2392%2C1112.0771%2C1112.0273%2C1112.0469%2C1112.5857%2C1112.2513%2C1112.5347%2C1112.1998%2C1112.2416%2C1112.4622%2C1112.2435%2C1112.6219%2C1112.5963%2C1112.2417%2C1112.2250%2C1112.0365%2C1112.2682%2C1112.6353%2C1112.6134%2C1112.0860%2C1112.0037%2C1112.4862%2C1112.5271%2C1112.3762%2C1112.3979%2C1112.1371%2C1112.2142%2C1112.2155%2C1112.0770%2C1112.6246%2C1112.3416%2C1112.0286%2C1112.3713%2C1112.1485%2C1112.0375%2C1112.1555%2C1112.3027%2C1112.6095%2C1112.0449%2C1112.3492%2C1112.5187%2C1112.6291%2C1112.0461%2C1112.0123%2C1112.0780%2C1112.0966%2C1112.1921%2C1112.2463%2C1112.5634%2C1112.1108%2C1112.4495%2C1112.4921%2C1112.1161%2C1112.6403%2C1112.3851%2C1112.3074%2C1112.5763%2C1112.5462%2C1112.1121%2C1112.2725%2C1112.4911%2C1112.2631%2C1112.1773%2C1112.6085%2C1112.5630%2C1112.5053&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Thermal expansion and Grüneisen parameters of Ba(Fe1-xCox)2As2 - a\n  thermodynamic quest for quantum criticality"}, "summary": "Thermal expansion data are used to study the uniaxial pressure dependence of\nthe electronic/magnetic entropy of Ba(Fe1-xCox)2As2. Uniaxial pressure is found\nto be proportional to doping and, thus, also an appropriate tuning parameter in\nthis system. Many of the features predicted to occur for a pressure-tuned\nquantum critical system, in which superconductivity is an emergent phase hiding\nthe critical point, are observed. The electronic/magnetic Gr\\\"uneisen\nparameters associated with the spin-density wave and superconducting\ntransitions further demonstrate an intimate connection between both ordering\nphenomena.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1112.3491%2C1112.1090%2C1112.2660%2C1112.5339%2C1112.3237%2C1112.6143%2C1112.3451%2C1112.3014%2C1112.5186%2C1112.3496%2C1112.6228%2C1112.6379%2C1112.4237%2C1112.3806%2C1112.1911%2C1112.5097%2C1112.5953%2C1112.1476%2C1112.0204%2C1112.5423%2C1112.0749%2C1112.5351%2C1112.4781%2C1112.3282%2C1112.5163%2C1112.5920%2C1112.1281%2C1112.4919%2C1112.5029%2C1112.2675%2C1112.6194%2C1112.5326%2C1112.3708%2C1112.1630%2C1112.0225%2C1112.2392%2C1112.0771%2C1112.0273%2C1112.0469%2C1112.5857%2C1112.2513%2C1112.5347%2C1112.1998%2C1112.2416%2C1112.4622%2C1112.2435%2C1112.6219%2C1112.5963%2C1112.2417%2C1112.2250%2C1112.0365%2C1112.2682%2C1112.6353%2C1112.6134%2C1112.0860%2C1112.0037%2C1112.4862%2C1112.5271%2C1112.3762%2C1112.3979%2C1112.1371%2C1112.2142%2C1112.2155%2C1112.0770%2C1112.6246%2C1112.3416%2C1112.0286%2C1112.3713%2C1112.1485%2C1112.0375%2C1112.1555%2C1112.3027%2C1112.6095%2C1112.0449%2C1112.3492%2C1112.5187%2C1112.6291%2C1112.0461%2C1112.0123%2C1112.0780%2C1112.0966%2C1112.1921%2C1112.2463%2C1112.5634%2C1112.1108%2C1112.4495%2C1112.4921%2C1112.1161%2C1112.6403%2C1112.3851%2C1112.3074%2C1112.5763%2C1112.5462%2C1112.1121%2C1112.2725%2C1112.4911%2C1112.2631%2C1112.1773%2C1112.6085%2C1112.5630%2C1112.5053&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Thermal expansion data are used to study the uniaxial pressure dependence of\nthe electronic/magnetic entropy of Ba(Fe1-xCox)2As2. Uniaxial pressure is found\nto be proportional to doping and, thus, also an appropriate tuning parameter in\nthis system. Many of the features predicted to occur for a pressure-tuned\nquantum critical system, in which superconductivity is an emergent phase hiding\nthe critical point, are observed. The electronic/magnetic Gr\\\"uneisen\nparameters associated with the spin-density wave and superconducting\ntransitions further demonstrate an intimate connection between both ordering\nphenomena."}, "authors": ["Christoph Meingast", "Frédéric Hardy", "Rolf Heid", "Peter Adelmann", "Anna Böhmer", "Philipp Burger", "Doris Ernst", "Rainer Fromknecht", "Peter Schweiss", "Thomas Wolf"], "author_detail": {"name": "Thomas Wolf"}, "author": "Thomas Wolf", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.108.177004", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1112.5326v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1112.5326v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "13 pages, 4 figures", "arxiv_primary_category": {"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.supr-con", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.str-el", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1112.5326v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1112.5326v1", "journal_reference": null, "doi": "10.1103/PhysRevLett.108.177004", "fulltext": "Thermal expansion and Grüneisen parameters of Ba(Fe1-xCox)2As2\n– a thermodynamic quest for quantum criticality\nChristoph Meingast,1* Frédéric Hardy,1 Rolf Heid,1 Peter Adelmann,1 Anna Böhmer,1,2\nPhilipp Burger,1,2 Doris Ernst,1 Rainer Fromknecht,1 Peter Schweiss,1 Thomas Wolf1\n1\n\nInstitut für Festkörperphysik, Karlsruhe Institute of Technology, 76021 Karlsruhe, Germany.\n\n2\n\nFakultät für Physik, Karlsruhe Institute of Technology, 76128 Karlsruhe, Germany.\n\nThermal expansion data are used to study the uniaxial pressure dependence of the\nelectronic/magnetic entropy of Ba(Fe1-xCox)2As2. Uniaxial pressure is found to be\nproportional to doping and, thus, also an appropriate tuning parameter in this system.\nMany of the features predicted to occur for a pressure-tuned quantum critical system, in\nwhich superconductivity is an emergent phase hiding the critical point, are observed. The\nelectronic/magnetic Grüneisen parameters associated with the spin-density wave and\nsuperconducting transitions further demonstrate an intimate connection between both\nordering phenomena.\n\nPACS: 74.70.Xa, 74.40.Kb, 74.25.Bt, 74.62.Fj\n\nUnconventional superconductivity often occurs in the vicinity of a magnetic quantum\ncritical point (QCP), i.e. a magnetic instability at which a classical magnetic phase transition\nis suppressed to zero temperature by a tuning parameter such as doping, pressure or magnetic\nfield. Examples can be found in heavy fermion [1], organic [2], and cuprate [3] materials. In\nthese materials superconductivity usually emerges out of a non-Fermi-liquid (NFL) normal\nstate, which has attracted considerable attention on its own [4]. The NFL state is thought to\nbe a direct consequence of the magnetic fluctuations around the QCP, which have also been\nlinked to the superconducting pairing glue in all these different materials [5] and specifically\nfor the Fe-based materials [6,7].\n\nThere now exists mounting evidence also for NFL behavior\n\nin the recently discovered iron-based superconductors from resistivity [8,9], NMR [10] and de\nHaas – van Alphen [11] measurements. Direct thermodynamic evidence of the non-Fermi\nliquid (NFL) behavior expected near such a quantum critical point in these materials, however,\nis lacking.\n\n1\n\n\fRecently Zhu et al. [12] have shown that the thermal expansion coefficients and the\nassociated Grüneisen parameters offer an ideal thermodynamic probe for locating and\nclassifying a QCP for pressure-tuned systems, since these quantities necessarily diverge at\nsuch a point. Further, Garst et al. [13] have shown that, besides the divergence at the QCP,\none also expects a sign change of both the thermal expansion coefficients and Grüneisen\nparameters as one crosses the classical ordering transition away from the critical point.\n\nIn this Letter we address the question of possible quantum criticality in the pnictide\nsuperconductors through a detailed study of the electronic part of the thermal expansion of\nCo-doped BaFe2As2 single-crystals. First, we show that pressure - especially uniaxial pressure\n- is an appropriate tuning parameter for this system and that there exists a clear accumulation\nof entropy at optimal doping. Second, we find that the electronic thermal expansivity and\nderived electronic Grüneisen parameters change sign both at the spin-density wave (SDW)\nand the SC transitions.\n\nThis is the expected behavior in a scenario, in which the\n\nsuperconducting dome hides the true critical point.\n\nFinally, we observe a remarkable\n\nsimilarity of the electronic Grüneisen parameters associated with the SDW and SC transitions\nin slightly underdoped and slightly overdoped crystals, respectively, suggesting an intimate\nconnection between both ordering phenomena.\n\nSingle crystals of Ba(Fe1-xCox)2As2 were grown from self-flux using pre-reacted FeAs\nand CoAs powders mixed with Ba. Details of the crystal synthesis are described elsewhere\n[14-16]. The precise composition of all samples was determined by energy dispersive x-ray\nspectroscopy and complemented by 4-circle x-ray profile refinement. Dimensions of the\ncrystals were roughly 3 – 9 mm along the a-axis and 0.1 – 0.5 mm along the c-axis. The\nthermal expansion was measured using a home-built capacitance dilatometer with a typical\nrelative resolution of ∆L/L ~ 10-8 - 10-10 [17]. All in-plane measurements were made along the\n[100] direction of the high-temperature tetragonal unit cell; this ensures that the crystals are\nnot detwinned by the small force applied by the dilatometer, and that, therefore, the measured\nthermal expansion is a simple average of the a- and b- orthorhombic axes. Performing\nreproducible c-axis measurements proved to be quite difficult due to the large aspect ratios of\nthe crystals, and we therefore present here only the reasonable data.\n\nThermal expansion on\n\ndetwinned crystals, as well as a detailed analysis of the problems associated with c-axis\nmeasurements will be reported elsewhere [18].\n\n2\n\n\fFig. 1 shows the thermal expansion coefficients divided by temperature, α/T, for\nseveral Co concentrations x between 0 % and 33 % measured along the a- and c-axis,\nrespectively.\n\nProminent anomalies in α/T are seen at both the SDW/structural and SC\n\ntransitions, with a clear splitting of the SDW and structural transitions for x > 0 as has been\npreviously reported [8,19,20]. We note that the anomalies along the c-axis are always larger\nin magnitude and of opposite sign than those along the a-axis, implying larger pressure effects\nalong the c-axis. The a-axis data are however of much higher quality due to the morphology\nof the crystals, and we will concentrate more on this set of data, since we are interested in the\ndetailed temperature and doping dependences of the thermal expansion. In Fig. 1 we have\nplotted α/T versus T, because we will focus on the electronic/magnetic contributions. For a\nFermi liquid one expects a constant electronic α/T term (αelec./T), which via a Maxwell\nrelation can be shown to simply equal the pressure dependence of Celec./T, i.e. the normal-state\n\nSommerfeld coefficient γN:\n\nα ielec.\nT\n\n∂\n=−\n\nS elec.\nT\ndγ\n= − N (i = a, c ) . αelec./T can be obtained by\n∂pi\ndpi\n\nextrapolating the normal-state data down to T = 0 K, and an inspection of Fig.1a reveal\nnegative intercepts for the x = 11.9 % and 15 % data and a near zero intercept for the x =33 %\nsample. This is made more quantitative in Fig. 2b, in which the normal-state values of α/T at\n8 K are plotted versus x in order to probe the doping dependence of αelec./T and\n\ndγ N\n(see\ndpi\n\nright-hand scale of Fig. 2b). We choose 8 K, because phonon contributions to the thermal\nexpansion are small and α/T can be reliably determined [21]. In order to interpret these data,\nwe show in Fig. 2a our experimental [16, 22] values of γN, which first increase with doping\n(due to the suppression of the SDW) up to optimal doping, then decrease and pass through a\nminimum around 20 – 30 % Co, and finally increase again up to a quite large value of 43\nmJ/mole K-2 for pure BaCo2As2. The sharp maximum in γN at optimal doping is equivalent to\na peak in, or an accumulation of, normal-state entropy available for superconducting pairing.\nγN values were also calculated using density-functional theory (DFT) using the virtual-crystal\napproximation (see Fig. 2a) [23] and are found to exhibit a very similar doping dependence as\nthe experimental one; the absolute values are however roughly a factor of two smaller.\nSimilar factors have been reported in both angle-resolved photoemission data [24] and\ndynamical-mean-field calculations [25] and have been attributed to moderate correlations. In\nour calculations, the decrease of γN in the range x = 5 – 20 % results from a shifting of the\n3\n\n\fhole bands below the Fermi energy. Of significance here is that the doping dependences of\nαelec./T or dγN/dpi shown in Fig. 2b is very reminiscent of the derivative of γN with respect to\ndoping, i.e. dγN/dx. This clearly demonstrates that for each Co concentration the effect of\nuniaxial pressure is directly proportional to additional doping, i.e. doping and pressure are\ndirectly related over the whole phase diagram. The opposite signs of dγN/dpi for the a- and caxes shown in Fig. 2b moreover demonstrate that the crucial parameter is the c/a ratio of the\nlattice parameters [14, 26] and not simply the volume [27, 28]. Equating pressure and doping\nin the superconducting region of the phase diagram, we find that an increase in doping level\nby 1 % is roughly equivalent to – 1.4 GPa (+ 0.6 GPa) of uniaxial pressure applied along the\na- axis (c-axis). A more detailed discussion of the uniaxial pressure effects will be presented\nin a separate paper [18].\n\nHaving established that uniaxial pressure is a good tuning parameter in the Co-doped\nBa122 system, we proceed by studying the temperature and doping dependences of\nelectronic/magnetic contribution to the thermal expansion, αelec./T. To do this, we first need\nto subtract the phonon contribution. Fortuitously, the electronic contribution vanishes near x\n= 0.33 for both axes (see Fig. 2b), and these data can therefore be used as a background. We\nnote that the phonon background depends only very weakly on the Co-concentration [16].\nThe resulting αelec./T versus T curves are shown in Fig. 3. The first thing to note are the\nnegative (positive) contributions above TSDW or Tc, which are practically independent of\ndoping and imply constant positive (negative) values of dγN/dpa (dγN/dpc). Again equating\ndoping with uniaxial pressure implies a linearly decreasing electronic entropy with doping (or\npressure) for T > TSDW for x\n\n15 %. An expanded view of this contribution (see Fig. 3c)\n\nshows that it is however not constant as a function of temperature; it grows in magnitude with\ndecreasing temperatures, suggesting NFL behavior extending to at least 300 K. This is seen\nmost prominently for the close to optimally doped sample with x = 6.5 %. For the overdoped\nsamples, nearly constant values of αelec./T are found below a characteristic temperature T*,\nconsistent with a crossover to a FL-like behavior below T*. It is not clear if this apparent\nNFL behavior is due to magnetic fluctuations or the consequence of a small Fermi\ntemperature in a semi-metal [29]. The second thing to note from Fig. 3 are the sign changes\nof αelec./T near TSDW and Tc. For example, αelec./T for the a-axis changes from negative to\npositive values slightly above the SDW/structural transitions for underdoped crystals (black\nand blue curves) and at Tc for overdoped superconducting crystals (red curves).\n\nFor\n\nunderdoped superconducting samples (blue curves) there exists a second sign change of\n4\n\n\fαelec./T below Tc, which implies that the SDW/structural order parameters are reduced in the\nsuperconducting state as has been previously observed [30,31]. No anomalies are found in\nthe non-superconducting 15 % Co overdoped sample (green curve). Again, the c-axis data\n(Fig.3b) show similar effects, which are however larger in magnitude and have opposite signs.\nThe sign changes and crossover temperatures for the a-axis are summarized in the phase\ndiagram shown in the upper inset of Fig.4. The depicted behavior, especially the multiple\nsign changes in the underdoped region, is fully consistent with the expected behaviour at a\npressure-tuned critical point, in which superconductivity is an emergent phenomena and\ncovers up the critical behavior. An analogous thermal expansion derived phase diagram is\nobserved in the weakly coupled 1D chains system (C5H12N)2CuBr4 [32].\nelec .\nFinally, we discuss the electronic/magnetic Grüneisen parameter ΓGrüneisen\n, which\n\nprovides a measure of the volume/pressure dependences of the energy scales relevant for\nelec .\nmagnetism and superconductivity. Following [12,13] we simply define ΓGrüneisen\nas the ratio\n\nof αelec./Celec., where Celect. is the electronic specific heat taken from Ref. [16,22]. Fig. 4\nelec .\nshows ΓGrüneisen\nfor the a-axis as a function of temperature. Overall the behavior is similar to\n\nαelec./T shown in Fig. 3a. The anomalies at the SDW/structural transitions are, however,\nelec .\nmuch less pronounced in ΓGrüneisen\nthan in αelec./T, especially for the x = 0 % data, due to\n\nappropriately large heat capacity peaks, which normalize the peaks in αelec./T. This highlights\nthe importance of the anomalous high-temperature contribution relative to the actual ordering\nelec .\nelec .\ntransitions for the overall behavior of ΓGrüneisen\n. There is also little difference between ΓGrüneisen\n\nat the SDW and structural transitions, implying that both transitions are governed by the same\nelec .\nenergy scales (i.e. have the same uniaxial pressure dependences). Interestingly, ΓGrüneisen\nin\n\nthe undoped state (x = 0 %) is practically zero below the SDW transition, suggesting a\nquenching of the relevant degrees of freedom associated with the anomalous high-temperature\nelec .\nNFL state. With increased Co-doping we find increasing positive ΓGrüneisen\nvalues below TSDW.\nelec .\nFor example, for x = 2 % ΓGrüneisen\nstarts to develop a positive signal at low temperatures\n\n(below 50 K), which becomes larger and larger for the 4.5 % and 5.5 % samples, almost\nmasking the anomaly at TS for the 5.5 % sample.\n\nThe following picture evolves from our\n\ndata. The excitations associated with the NFL state above TSDW, which are fully quenched\nbelow TSDW in the undoped state, recover with increased Co doping, and the expected sign\nelec .\nchanges of ΓGrüneisen\n[13] are clearly observed for the x = 5.5 and 6.5 % samples. The largest\n\n5\n\n\felec .\nvalues of ΓGrüneisen\noccur for the extremely underdoped (overdoped) samples, for which\nelec .\nΓGrüneisen\nfalls (rises) sharply below Tc down to the lowest measured temperatures of 5 K. This\n\nshows that superconductivity at these points is extremely sensitive to (uniaxial) pressure,\nwhich must be closely related to a strong variation of the residual ungapped density of states\nobserved with doping found in heat capacity data [16]. Finally, we point out the remarkably\nelec .\nelec .\n(x = 5.5 %) below the SDW transition and ΓGrüneisen\n(x = 6.5 %)\nsimilar behavior of ΓGrüneisen\n\nbelow Tc (see lower inset of Fig. 4). Both data sets exhibit a sign change (near TSDW or Tc)\nand then increase down to lower temperatures. This strong similarity in the magnitude and\nelec .\nshape of ΓGrüneisen\nfor both SDW and superconductivity clearly demonstrates that both ordering\n\nphenomena are intimately related and most likely originate from the same underlying physics.\n\nIn summary, we have presented a detailed study of the electronic/magnetic part of the\nthermal expansion of Co-doped Ba122 single-crystals from which several conclusions can be\ndrawn. First, our results show that pressure - especially uniaxial pressure - is an appropriate\ntuning parameter in this system and that pressure can be directly linked to doping. Second,\nthe electronic/magnetic thermal expansivity and calculated electronic/magnetic Grüneisen\nparameters show many of the features predicted to occur for a pressure-tuned quantum critical\nsystem in which the true critical point is covered by the SC dome – namely, sign changes of\nthese quantities at both the SDW and SC transitions, NFL behavior above the\nsuperconducting dome and a cross-over to FL behavior for higher doping. On the other hand,\nalthough the heat capacity data also show a clear accumulation of entropy at optimal doping,\nthis appears to be not primarily the result of an increase in low-energy magnetic fluctuations,\nsince the DFT calculations, which do not include fluctuations, exhibit a similar doping\ndependence. Most likely, the maximum in γN results simply from the gradual suppression of\nthe SDW gap with doping at x = 6 % coupled with the disappearance of the hole bands for\nhigher doping levels, which raises the question of the origin of the NFL behavior seen in the\nthermal expansion. Finally, we observe a remarkable similarity of the electronic/magnetic\nGrüneisen parameters associated with the SDW and SC transitions in slightly underdoped and\nslightly overdoped crystals, respectively. Although one expects roughly the same energy\nscale for both orders at optimal doping due to similar ordering temperatures, the fact that the\nvolume dependences, as implied by the Grüneisen parameters, are also similar suggests an\nintimate connection between both ordering phenomena.\n\n6\n\n\fThe authors thank J. Schmalian for helpful discussion. This work has been supported\nby the Deutsche Forschungsgemeinschaft through SPP1458.\n\nReferences\n*christoph.meingast@kit.edu\n[1] N. D. Mathur, et al. Nature 394, 39 (1998); J. Flouquet, Prog. Low Temp. Phys. 15, 139\n(2005); C. Pfleiderer, Rev. Mod. Phys. 81, 1551 (2009).\n[2] M. Lang and J. Müller, Organic Superconductors, in Superconductivity. Vol.2: Novel\nsuperconductors / ed. by K.H.Bennemann, J.B.Ketterson. - Berlin; Heidelberg: Springer, 2008.\n[3] N. Plakida, High-Temperature Cuprate Superconductors Experiment, Theory, and\nApplications, Springer Series in Solid-State Sciences, Vol. 166, Plakida, Nikolay, 2010.\n\n[4] G. R. Stewart, Rev. Mod. Phys. 73, 797 (2001); H. v. Löhneysen et al., Rev. Mod. Phys.\n79, 1015 (2007).\n[5] D.J. Scalapino, Physica C 470, S1-S3 (2010).\n[6] I.I. Mazin and J. Schmalian, Physica C 469, 614 (2009).\n[7] S. Graser, et al., Phys. Rev. B81, 214503 (2010).\n[8] J.H. Chu, et al., Phys. Rev. B 79, 014506 (2009).\n[9] S. Kasahara, et al., Phys. Rev. B 81, 184519 (2010).\n[10] F. L. Ning et al., Phys. Rev. Lett. 104, 037001 (2010).\n[11] H. Shishido et al., Phys. Rev. Lett. 104, 057008 (2010).\n[12] L. Zhu, et al., Phys. Rev. Lett. 91, 066404 (2003).\n[13] M. Garst and A. Rosch, Phys. Rev. B 72, 205129 (2005).\n[14] F. Hardy et al. Phys. Rev. Lett. 102, 187004 (2009).\n[15] F. Hardy et al. Phys. Rev. B 81, 060501 (2010).\n[16] F. Hardy et al. EPL 91 47008 (2010).\n[17] C. Meingast et al., Phys. Rev. B 41, 11299 (1990).\n[18] C. Meingast et al. unpublished.\n[19] N. Ni et al., Phys. Rev. B 78, 214515 (2008).\n[20] C. R. Rotundu and R. J. Birgenau, arXiv:1106.5761.\n[21] The value of α/T for superconducting samples was extrapolated down to 8 K.\n[22] F. Hardy et al., unpublished.\n[23] DFT-GGA calculations have been performed using experimental structural parameters.\nMagnetic calculations using the observed AF structure were only made for x = 0.\n[24] D.H.Lu et al., Nature 455, 81 (2008).\n7\n\n\f[25] M. Aichhorn et al. PRB, 80, 085101 (2009).\n[26] M. Tomic et al., arXiv:1106.5623.\n[27] S. A. J. Kimber et al., Nature Materials 8, 471 - 475 (2009).\n[28] S. Drotziger et al., J. Phys. Soc. Jpn. 79, 124705 (2010).\n[29] B.C. Sales et al., Physica C 470, 304 (2010).\n[30] S. Nandi, et al., PRL 104, 057006 (2010).\n[31] R. M. Fernandes, et al., Phys. Rev. B 81, 140501 (2010).\n[32] T. Lorenz, et al., Phys. Rev. Lett. 100, 067208 (2008).\n\n8\n\n\fa-axis\n0%\n\n2%\n\n3%\n4.5 %\n\n11.9 %\n5.5 %\n\n-6\n\n-2\n\nαa/T (10 K )\n\n0.2\n\n0.1\n\n33 %\n15%\n\n0.0\n\n6.5 %, 8.1 %\n\na)\n-0.1\n0.4\n\nc-axis\n7.5 %, 11 %\n\n0.2\n0.1\n33 %\n\n0.0\n\n2%\n\n-0.2\n\n0%\n\n-0.1\n5.5 %\n\n-6\n\n-2\n\nαc/T (10 K )\n\n0.3\n\nb)\n\n-0.3\n0\n\n50\n\n100\n\n150\n\n200\n\nT (K)\nFig. 1 (color online). Thermal-expansion coefficients divided by temperature, α/T, versus T\nof Ba(Fe1-xCox)2As2 along a) the tetragonal a-axis and b) c-axis for 0 < x < 33 %. The colors\nrepresent the doping levels (black – underdoped, non-superconducting; blue – underdoped,\nsuperconducting; red- overdoped, superconducting; green – overdoped, non-superconducting).\n\n9\n\n\fa)\n\nexperimental\n\n2\n\nγN (mJ/mole K )\n\n40\n30\n20\n10\n\n-6\n\nb)\na-axis\n\n-3\n\n-1\n\n0.05\n\n-2\n\n0\n0.10\n\ndγN/dpi (mJ mole K /GPa)\n\nN\n\n-6\n\n-2\n\nαi /T|T=8K (10 K )\n\nDFT\n\n0.00\n\n0\n\n-0.05\n\n3\n\nc-axis\n\n-0.10\n\n6\n\n-0.15\n0\n\n20\n\n40\n\n60\n\n80\n\n9\n100\n\nCo content (%)\nFig. 2 (color online). a) Normal-state electronic Sommerfeld coefficient , γΝ(x), versus Co\ncontent derived from experiment [16,22] and theory. b) Normal-state α/T values at 8 K and\nassociated uniaxial pressure derivatives of γΝ(x),\n\n∂γ N\nα elec.\n= − i (i = a, c ) .\n∂pi\nT\n\n∂γ N\n∂γ N\nand\n∂pi\n∂x\n\nderived from a) exhibit similar x-dependences, implying a close relationship between pressure\nand doping.\n\n10\n\n\f0%\n\n3%\n\n4.5 %\n\n15 %\n\n8.1 %\n\n0.05\n\n-6\n\nelectronic\n\n6.5 %\n5.5 %\n\n11.9 %\n\n-2\n\n/T (10 K )\n\n0.10\n\n0.00\n\nαa\n\n-0.05\n\na)\n\n0\n\n50\n\n100\n\n150\n\n200\n\n5.5 %\n\n-0.2\n0\n\nb)\n\n0\n\n5\n\n10\ntent\n15 o con\nC\n\nc-axis\n\n0.0\n\n0%\n\n3%\n\n4.5 %\n\n5.5 %\n\nc)\n\n15 %\n\n-6\n\n8.1 %\n6.5 %\n\n11.9 %\n\n/T (10 K )\n\n-2\n\n-0.02\n\na-axis\n140 K\n\nαa\n\nelectronic\n\n0\n5\n)\n10 tent (%\n15 o con\nC\n\n50\n100\nT (K) 150 200\n\n0.00\n\n-0.01\n\n2%\n\n7.5 %\n\n0%\n\n11 %\n\nelectronic\n\n-6\n\n-2\n\n/T (10 K )\n\n0.2\n\nαc\n\nT (K)\n\na-axis\n\n-0.03\n0\n\n95 K 55 K\n\n200\n\nT (K )\n\n400\n\n600\n\n15\n\n5\n\n0\n\nnt (%\nonte\nCo c\n10\n\n)\n\nFig. 3 (color online). Electronic/magnetic contribution of α/T, αelec./T, along a) the tetragonal\na-axis and b) the c-axis for 0 < x < 15 % Co. The electronic/magnetic contribution was\nderived by subtracting the data for x = 33 % Co, which consist mostly of a phonon\ncontribution and a nearly zero electronic term (see Fig. 2b).\n\nc) Expanded view of\n\nα aelec. / T showing clear evidence for non-Fermi liquid behavior above TSDW/ Tc. The arrows\nmark a crossover temperature, T*, below which Fermi-liquid behavior is observed.\n\n11\n\n\f-\n\nTα\n\nelec.\n\n=0\n\n(K)\n\n11.9 %\n\n50\n\n+\n\n-+\n\n-\n\nFL\n\n0\n0 2 4 6 8 101214\n\n2%\n\nCo content (%)\n0%\n\n4.5 %\n\n5.5 %\n\n6.5 %\n\n3\n\nT*\n\nNFL\n\n100\n\n0\n\nΓGrüneisen\n\n3\n\n-3\n\nelec.\n\nelec.\n\n-9\n\n-1\n\nΓGrüneisen(10 mole mJ K)\n\n6\n\nTS\n5.5 %\n\n0\n\n6.5 %\n\n-3\n\n-6\n0\n\n50\n\nTC\n0\n50\n\n100 150\n\n150\n\n200\n\n100\n\nT (K)\nelec .\nFig. 4 (color online). Electronic uniaxial Grüneisen parameters, ΓGrüneisen\n, for the tetragonal a-\n\naxis, derived by subtracting α aelec. / T data from Fig. 3a by the electronic heat capacity,\n\nC pelec. / T , data from Ref. [16,22]. The upper inset shows a phase diagram in which the\ntemperature at which of α aelec. / T changes sign, as well as the Fermi liquid to non-Fermi\nliquid crossover temperature T*, are plotted versus x. The lower inset provides a comparison\nelec .\nof ΓGrüneisen\nfor x = 5.5 and 6 %.\n\n12\n\n\f"}