{"id": "http://arxiv.org/abs/1106.1420v1", "guidislink": true, "updated": "2011-06-07T19:32:24Z", "updated_parsed": [2011, 6, 7, 19, 32, 24, 1, 158, 0], "published": "2011-06-07T19:32:24Z", "published_parsed": [2011, 6, 7, 19, 32, 24, 1, 158, 0], "title": "Introduction to QCD - a bound state perspective", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.4161%2C1106.2987%2C1106.3129%2C1106.3294%2C1106.4191%2C1106.1851%2C1106.6014%2C1106.4721%2C1106.0808%2C1106.5191%2C1106.1107%2C1106.5837%2C1106.1263%2C1106.1747%2C1106.2843%2C1106.2871%2C1106.5693%2C1106.4396%2C1106.3630%2C1106.0779%2C1106.3679%2C1106.3003%2C1106.3046%2C1106.4662%2C1106.1504%2C1106.4458%2C1106.1784%2C1106.3719%2C1106.2164%2C1106.2613%2C1106.0128%2C1106.0446%2C1106.4054%2C1106.6180%2C1106.2539%2C1106.1682%2C1106.5302%2C1106.1709%2C1106.2917%2C1106.2764%2C1106.4381%2C1106.2605%2C1106.4030%2C1106.2171%2C1106.5579%2C1106.5848%2C1106.2195%2C1106.5906%2C1106.2779%2C1106.0701%2C1106.0625%2C1106.2212%2C1106.4929%2C1106.5812%2C1106.3812%2C1106.0941%2C1106.0715%2C1106.3684%2C1106.1571%2C1106.3962%2C1106.1028%2C1106.1737%2C1106.3088%2C1106.1894%2C1106.4736%2C1106.5503%2C1106.2369%2C1106.6104%2C1106.0530%2C1106.0321%2C1106.5596%2C1106.3538%2C1106.0885%2C1106.3207%2C1106.5225%2C1106.1470%2C1106.3666%2C1106.5946%2C1106.2076%2C1106.6197%2C1106.1795%2C1106.0565%2C1106.0714%2C1106.4341%2C1106.1420%2C1106.3755%2C1106.1380%2C1106.5542%2C1106.1318%2C1106.0452%2C1106.5972%2C1106.1878%2C1106.2997%2C1106.0467%2C1106.0362%2C1106.0925%2C1106.1251%2C1106.4679%2C1106.0278%2C1106.1244%2C1106.2489&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Introduction to QCD - a bound state perspective"}, "summary": "These lecture notes focus on the bound state sector of QCD. Motivated by data\nwhich suggests that the strong coupling \\alpha_s(Q) freezes at low Q, and by\nsimilarities between the spectra of hadrons and atoms, I discuss if and how QCD\nbound states may be treated perturbatively. I recall the basic principles of\nperturbative gauge theory bound states at lowest order in the \\hbar expansion.\nBorn level amplitudes are insensitive to the i\\epsilon prescription of\npropagators, which allows to eliminate the Z-diagrams of relativistic,\ntime-ordered Coulomb interactions. The Dirac wave function thus describes a\nsingle electron which propagates forward in time only, even though the bound\nstate has any number of pair constituents when Feynman propagators are used. In\nthe absence of an external potential, states that are bound by the Coulomb\nattraction of their constituents can be analogously described using only their\nvalence degrees of freedom. The instantaneous A^0 field is determined by Gauss'\nlaw for each wave function component, i.e., for each position of the valence\nconstituents. Solutions for A^0 obtained with a boundary condition that imposes\nan asymptotically constant energy density give rise to a linear potential for\ncolor singlet q\\bar q and qqq states. The strength of the linear potential is\ndetermined by the boundary condition and is of lower order in \\alpha_s than the\ngluon exchange interaction, which may then be treated as a higher order\nperturbative correction. Bound states evaluated to a given order in \\alpha_s\nand \\hbar must have the full symmetry of the exact theory, including the\ndynamic boost invariance of states quantized at equal time. The wave functions\nare indeed found to have such a hidden invariance, which ensures the correct\ndependence of the energy eigenvalues on the center of mass momentum. Thus\nrelativistic bound states can be studied using perturbative methods.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1106.4161%2C1106.2987%2C1106.3129%2C1106.3294%2C1106.4191%2C1106.1851%2C1106.6014%2C1106.4721%2C1106.0808%2C1106.5191%2C1106.1107%2C1106.5837%2C1106.1263%2C1106.1747%2C1106.2843%2C1106.2871%2C1106.5693%2C1106.4396%2C1106.3630%2C1106.0779%2C1106.3679%2C1106.3003%2C1106.3046%2C1106.4662%2C1106.1504%2C1106.4458%2C1106.1784%2C1106.3719%2C1106.2164%2C1106.2613%2C1106.0128%2C1106.0446%2C1106.4054%2C1106.6180%2C1106.2539%2C1106.1682%2C1106.5302%2C1106.1709%2C1106.2917%2C1106.2764%2C1106.4381%2C1106.2605%2C1106.4030%2C1106.2171%2C1106.5579%2C1106.5848%2C1106.2195%2C1106.5906%2C1106.2779%2C1106.0701%2C1106.0625%2C1106.2212%2C1106.4929%2C1106.5812%2C1106.3812%2C1106.0941%2C1106.0715%2C1106.3684%2C1106.1571%2C1106.3962%2C1106.1028%2C1106.1737%2C1106.3088%2C1106.1894%2C1106.4736%2C1106.5503%2C1106.2369%2C1106.6104%2C1106.0530%2C1106.0321%2C1106.5596%2C1106.3538%2C1106.0885%2C1106.3207%2C1106.5225%2C1106.1470%2C1106.3666%2C1106.5946%2C1106.2076%2C1106.6197%2C1106.1795%2C1106.0565%2C1106.0714%2C1106.4341%2C1106.1420%2C1106.3755%2C1106.1380%2C1106.5542%2C1106.1318%2C1106.0452%2C1106.5972%2C1106.1878%2C1106.2997%2C1106.0467%2C1106.0362%2C1106.0925%2C1106.1251%2C1106.4679%2C1106.0278%2C1106.1244%2C1106.2489&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "These lecture notes focus on the bound state sector of QCD. Motivated by data\nwhich suggests that the strong coupling \\alpha_s(Q) freezes at low Q, and by\nsimilarities between the spectra of hadrons and atoms, I discuss if and how QCD\nbound states may be treated perturbatively. I recall the basic principles of\nperturbative gauge theory bound states at lowest order in the \\hbar expansion.\nBorn level amplitudes are insensitive to the i\\epsilon prescription of\npropagators, which allows to eliminate the Z-diagrams of relativistic,\ntime-ordered Coulomb interactions. The Dirac wave function thus describes a\nsingle electron which propagates forward in time only, even though the bound\nstate has any number of pair constituents when Feynman propagators are used. In\nthe absence of an external potential, states that are bound by the Coulomb\nattraction of their constituents can be analogously described using only their\nvalence degrees of freedom. The instantaneous A^0 field is determined by Gauss'\nlaw for each wave function component, i.e., for each position of the valence\nconstituents. Solutions for A^0 obtained with a boundary condition that imposes\nan asymptotically constant energy density give rise to a linear potential for\ncolor singlet q\\bar q and qqq states. The strength of the linear potential is\ndetermined by the boundary condition and is of lower order in \\alpha_s than the\ngluon exchange interaction, which may then be treated as a higher order\nperturbative correction. Bound states evaluated to a given order in \\alpha_s\nand \\hbar must have the full symmetry of the exact theory, including the\ndynamic boost invariance of states quantized at equal time. The wave functions\nare indeed found to have such a hidden invariance, which ensures the correct\ndependence of the energy eigenvalues on the center of mass momentum. Thus\nrelativistic bound states can be studied using perturbative methods."}, "authors": ["Paul Hoyer"], "author_detail": {"name": "Paul Hoyer"}, "author": "Paul Hoyer", "arxiv_comment": "Based on lectures at the International Summer School and Conference\n  on High Energy Physics: Standard Model and Beyond (ISSCSMB '10), at Mugla,\n  Akyaka in Turkey on 27 August -- 4 September 2010. 24 pages, 4 figures", "links": [{"href": "http://arxiv.org/abs/1106.1420v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1106.1420v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "hep-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1106.1420v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1106.1420v1", "journal_reference": null, "doi": null, "fulltext": "Preprint typeset in JHEP style - HYPER VERSION\n\nIntroduction to QCD∗\n– a bound state perspective\n\narXiv:1106.1420v1 [hep-ph] 7 Jun 2011\n\nPaul Hoyer\nDepartment of Physics and Helsinki Institute of Physics\nPOB 64, FIN-00014 University of Helsinki, Finland\n\nAbstract: These lecture notes focus on the bound state sector of QCD. Motivated by\ndata which suggests that the strong coupling αs (Q) freezes at low Q, and by similarities\nbetween the spectra of hadrons and atoms, I discuss if and how QCD bound states may\nbe treated perturbatively. I recall the basic principles of perturbative gauge theory bound\nstates at lowest order in the ~ expansion. Born level amplitudes are insensitive to the iε\nprescription of propagators, which allows to eliminate the Z-diagrams of relativistic, timeordered Coulomb interactions. The Dirac wave function thus describes a single electron\nwhich propagates forward in time only, even though the bound state has any number\nof pair constituents when Feynman propagators are used. In the absence of an external\npotential, states that are bound by the Coulomb attraction of their constituents can be\nanalogously described using only their valence degrees of freedom. The instantaneous\nA0 field is determined by Gauss' law for each wave function component, i.e., for each\nposition of the valence constituents. Solutions for A0 obtained with a boundary condition\nthat imposes an asymptotically constant energy density give rise to a linear potential for\ncolor singlet qq̄ and qqq states. The strength of the linear potential is determined by the\nboundary condition and is of lower order in αs than the gluon exchange interaction, which\nmay then be treated as a higher order perturbative correction. Bound states evaluated\nto a given order in αs and ~ must have the full symmetry of the exact theory, including\nthe dynamic boost invariance of states quantized at equal time. The wave functions are\nindeed found to have such a hidden invariance, which ensures the correct dependence of\nthe energy eigenvalues on the center of mass momentum. Thus relativistic bound states\ncan be studied using perturbative methods.\n\n∗\n\nBased on lectures at the International Summer School and Conference on High Energy Physics: Standard Model and Beyond (ISSCSMB '10), at Mugla, Akyaka in Turkey on 27 August – 4 September 2010.\n\n\fContents\n1. The strong interactions\n\n1\n\n2. The freezing of αs (Q)\n\n3\n\n3. Bound states in perturbation theory\n\n4\n\n4. Retarded vs. Feynman propagation\n\n6\n\n5. The Dirac wave function\n\n7\n\n6. Dynamical boost invariance\n\n9\n\n7. The ~ expansion\n\n10\n\n8. A0 from Gauss' law\n\n12\n\n9. A confining boundary condition on A0\n\n14\n\n10. qq̄ states in QCD\n\n16\n\n11. qqq states in QCD\n\n18\n\n12. Discussion\n\n20\n\n1. The strong interactions\nThere is a broad consensus that Quantum Chromodynamics is the theory underlying the\nstrong interactions. This conviction first arose from general features of QCD which agree\nwith observations. The realization that the QCD coupling αs decreases with momentum\ntransfer (asymptotic freedom) was decisive for establishing QCD as a serious candidate\ntheory in 1973. QCD was also seen to have approximate isospin and chiral symmetry for\nsmall quark masses. The theory later has had an impressive success in describing a large\nvariety of data on short-distance processes. These involve small αs and thus directly probe\nthe QCD lagrangian via the perturbative expansion. Numerical methods based on discrete\nlattice approximations of space-time have demonstrated that the properties of QCD at\nlong distances, in particular its bound states (the hadrons), are at least qualitatively in\nagreement with observations.\nWhat I summarize above in a few sentences would provide material for many lecture\ncourses. The vast amount of information has fortunately inspired a \"Resource Letter\"\n\n–1–\n\n\f[1], which at 39 pages is no letter but a comprehensive collection of references to the QCD\nliterature. It covers all aspects of QCD and guides to material organized by scope and depth\nvia brief remarks. Many excellent introductory lectures on QCD have been published as\nwell, see for example [2, 3, 4]. I shall not try to rival these here. Instead, I have chosen to\nfocus on a less well covered but fascinating aspect: the bound states.\nColor confinement and the spontaneous breaking of chiral symmetry are novel features\nof QCD, whose origin is still poorly understood. Both are closely connected to the physics\nof hadrons as bound states of QCD. Color confinement implies that only color neutral\nstates (hadrons and nuclei) propagate macroscopic distances and thus reach experimental\ndetectors. The spontaneous breaking of chiral symmetry explains the absence of parity\ndoubling in the hadron spectrum and gives a reason for the small mass of the pion. Hadrons\nalso have other puzzling properties: Hard scattering shows that they have a large (infinite)\nnumber of highly relativistic quark and gluon constituents, whereas the hadron spectrum\nreflects just the valence quark (qq̄ or qqq) degrees of freedom [5]. This property makes\nhadrons quite different from more familiar bound states, such as atoms and molecules,\nwhose spectra reflect the relative motion (vibrations, rotations,...) of all their constituents.\nThe u, d valence quark masses contribute . 2% to the nucleon mass. Hadrons are in\nfact the only truly relativistic bound states found in Nature. In QED atoms the relativistic\neffects are of O (α) and can be calculated perturbatively with exquisite precision [6]. A\nrelativistic description of hadrons would seem to require αs & 1 and thus methods beyond\nperturbation theory. Together with the increase of the running coupling αs (Q) at low\nmomentum scales Q (\"infrared slavery\") this has led to the general view that QCD is\nstrongly coupled at distances ∼ 1 fm.\nBut data suggests otherwise. I review in Sec. 2 the indications that αs (Q) freezes at\na modest value α0 ∼ 0.5 as Q → 0 and that QCD remains perturbative at long distance.\nThere is little freedom in a perturbative approach since the lagrangian determines the\nexpansion nearly uniquely, and qualitatively correct results should be obtained already\nat lowest order in αs . Hence the relevance of perturbation theory for soft QCD physics\nis an assertion that can be addressed – and potentially excluded. Nevertheless, aspects\nof relativistic bound states that definitely can be addressed perturbatively receive little\nattention:\n- Does the Hydrogen atom wave function Lorentz contract? [7]\n- How does the Dirac wave function describe higher (e+ e− pair) Fock states? [8]\n- Is there a Born term for bound states, as there is for scattering amplitudes? [9]\nModern courses in field theory devote surprisingly little attention to bound states. The\nperturbative description of bound states differs qualitatively from that of scattering amplitudes, since bound state poles arise through the divergence of the perturbative expansion.\nIt thus seems worthwhile to devote these lectures to bound state issues. I shall not attempt an objective overview, but rather focus on issues which seem relevant for a possible\ndescription of QCD bound states.\n\n–2–\n\n\f!0 from e+e– event shapes\n0.8\n0.7\n\n_0\n\n0.6\n0.5\n0.4\n0.3\n0.1\n\naverage\n\u001a1-T\u001c\n\u001aMH2\u001c\n\u001aBT\u001c\n\u001aBW\u001c\n\u001aC\u001c\n\n0.11\n\n0.12\n\n0.13\n\n_S(MZ)\nFigure 1: Left: The dependence of the QCD coupling αs on the momentum scale Q [10]. Right:\nThe average coupling α0 defined by (2.1) as determined from data in the range 0 < Q < 2 GeV\n[13].\n\nI discuss the evidence that QCD remains perturbative at long distances in Sec. 2.\nSec. 3 introduces general issues related to the perturbative description of bound states. The\npossibility of using retarded propagators at Born level and how this affects wave functions\nis discussed in Sec. 4, and then applied to Dirac bound states in Sec. 5. Sec. 6 addresses\nthe dynamical (as opposed to manifest) boost invariance of states defined at equal time of\ntheir constituents. Each order in an ~ expansion must be Lorentz invariant, as discussed\nin Sec. 7. In gauge theories the A0 potential is at each instant of time determined by\nthe charges through Gauss' law. In Sec. 8 I note that the Coulomb field of the Hydrogen\natom therefore is different for each wave function component (position of the charges).\nThis allows me in Sec. 9 to consider solving Gauss' law with a boundary condition where\nA0 does not vanish at spatial infinity. This generates a linear confining potential without\nbreaking the symmetries of the theory. In Secs. 10 and 11 I use this boundary condition to\nderive the QCD bound state equations at lowest order in ~ and αs for qq̄ and qqq states.\nFinal comments are given in Sec. 12.\n\n2. The freezing of αs (Q)\nStrong interaction phenomena are characterized by the scale ΛQCD ' 200 MeV ' 1 fm−1 .\nThis fundamental constant also determines the value of αs in the perturbative regime:\nαs (MZ ) = 0.1184 ± 0.0007 [10]. The running of αs (Q) shown in Fig. 1 (left panel) agrees\nwell with data down to the scale of the τ lepton mass, where αs (1.8 GeV) ' 0.33.\nIt is often claimed that αs (Q) grows large as Q → ΛQCD , and that confinement is\na consequence of strongly coupled QCD. Actually, several analyses indicate that αs (Q)\n\n–3–\n\n\f\"freezes\", i.e., becomes independent of Q at low scales [11]. A dispersive approach [12]\nwhich uses moments of event shapes to extract an average coupling α0 at low scales,\nZ μI\n1\nα0 (μI ) ≡\ndQ αs (Q)\n(2.1)\nμI 0\ngave [13] α0 ' 0.5 (for μI = 2 GeV) as shown in the right panel of Fig. 1. A recent\nanalysis of event shapes in e+ e− annihilations which combined the dispersive method with\nperturbative calculations at NNLO accuracy resulted in [14]\nαs (MZ ) = 0.1153 ± 0.0017 (exp) ± 0.0023 (th)\nα0 = 0.5132 ± 0.0115 (exp) ± 0.0381 (th)\n\n(2.2)\n\nA moderate coupling at long distances would help explain why perturbative results are\nfound to qualitatively describe data at low Q2 . Examples include Bloom-Gilman duality\n[15], precocious dimensional scaling [16] and the inclusive distribution of hadrons in and\nbetween jets [17]. Hadrons are, like atoms, classified according to the spin and orbital\nangular momentum of their valence constituents. The success of the quark model in describing hadron masses, magnetic moments and other properties suggests a perturbative\nstructure. In the words of a well-known expert [18]:\nQCD is about to undergo a faith transition.\nQCD practitioners prepare themselves – slowly but steadily – to start using,\nin earnest, the language of quarks and gluons down into the region of small\ncharacteristic momenta – \"large distances\".\nThis is a perplexing statement since we know that QCD is not perturbative in the same\nsense as QED is – there are no free quarks or gluons. Applied to the phenomenological\nquark model potential\n4 αs\nV (r) = kr −\n(2.3)\n3 r\nit suggests that the coefficient k of the linear term is of lower order in αs than the gluon\nexchange contribution − 43 αs /r. In Sec. 9 I show that a linear term arises in the perturbative expansion if a non-vanishing energy density ∝ Λ4QCD is imposed on the solution of\n√\nGauss' law. Then k ∝ αs Λ2QCD is indeed of lower order than the O (αs ) gluon exchange\ncontribution, which may be treated as a higher order perturbative correction.\n\n3. Bound states in perturbation theory\nBound states appear as poles in scattering amplitudes. In a perturbative expansion the\npoles are generated by the divergence of the sum – no finite order Feynman diagram has\na bound state singularity. This is intuitively understandable, since the constituents must\ncontinuously interact in order to stay bound. It may nevertheless seem surprising that\nthe QED perturbative series diverges even for atoms, however small is α (I return to\nthis in Sec. 7). Having to sum an infinite set of diagrams raises the question of which\n\n–4–\n\n\fdiagrams to include in the sum: Unlike in ordinary perturbation theory one cannot simply\norder the calculation according to the power of the coupling α. Summing different sets\nof diagrams leads to different approximations for the bound states, which a priori appear\nequally justified [19].\nThe perturbative expansion of scattering amplitudes can be viewed not only as a\npower series in α, but also as a loop expansion. Loops are associated with powers of the\nPlanck constant ~ [20]. Born terms may have different powers of α depending on the\nprocess, but are always of lowest order in ~ in the sense that they have no loops. The very\nsuccessful QED calculations of non-relativistic atoms are also based on a loop expansion.\nThe loops are counted in the interaction kernel, which is then iterated as a geometric series\nto generate the bound states. Does this mean that the Schrödinger equation, which follows\nfrom iterating single photon exchange with no loop correction, is the Born approximation\nfor non-relativistic bound states? And if so, can this concept of a Born term be extended\nto relativistic bound states, defining a specific lowest order approximation (bound state\nequation)? The ~ expansion has received rather little attention in a field theory context,\nbut it appears that the answer is positive to both questions. I discuss the ~ expansion\nfurther in Sec. 7.\nHaving identified the Born term one may ask under what circumstances this approximation to a bound state is reliable. Unsurprisingly, it turns out that this requires the\ncoupling α to be small enough for a perturbative (loop) expansion of the kernel to be well\nmotivated. At first this appears to make the Born term concept useless for relativistic\nstates. In QED atoms the constituents move with speeds v/c ' α. Hence relativistic\nmotion requires a large coupling α & 1, which invalidates the loop expansion. The Dirac\nequation with a −α/r Coulomb potential in fact gives complex bound state energies for\nα > 1 [20].\nA systematic study of bound states using perturbation theory requires expanding both\nin ~ (which at lowest order defines the Born term) and in the coupling α (or αs in QCD).\nThe general understanding (which I review in Sec. 7) is that these two expansions are\ncoupled: Each loop adds a power of ~ and a power of α. At small α we then have\nnon-relativistic states described by the Schrödinger equation – unless there is a confining\npotential at lowest order in α. In Sec. 9 I argue that the perturbative expansion does allow\na linear potential, through a non-vanishing boundary condition in Gauss' law.\nIn gauge theories the A0 field does not propagate (there is no ∂0 A0 term in the lagrangian, unless it is introduced via the gauge condition). Therefore A0 is determined by\nthe positions of the charges, separately for each component of the wave function and at\neach instant of time. Imposing a non-vanishing boundary condition at spatial infinity when\nsolving for A0 gives rise to the linear term in the potential (2.3), with k determined by the\nasymptotic field strength. Thus the QCD scale ΛQCD may appear in the solution of the\nequations of motion even though the equations themselves have no such parameter.\nThe possibility of studying the properties of relativistic bound states within the very\nconstrained framework of perturbation theory is interesting in its own right. Bound states\nof lowest order in α and ~ retain the Lorentz and gauge invariance of the theory. The\ndynamical boost invariance of the equal-time bound states found using this method is non-\n\n–5–\n\n\fp0\n\np0, ki\n\nk1\n\np0\nk2\n\nE t1\n=\n\nt2\n\nk1\n\nE\nk2\n\n+\n\nt2\n\nE\nt1\n\nE\nk2\n\nk1\n\nFigure 2: The tree diagram in 4-momentum (p0 , p) space on the left splits into two time-ordered\ndiagrams in (t, p) space (right hand side) when using the Feynman propagator (4.2). With the\nretarded propagator (4.3) both the positive and negative energy contributions are given by the first\ndiagram on the right, and the Z-diagram is absent.\n\ntrivial and (to my knowledge) unique. In considering the physical relevance of such an\napproach it is worth recalling that we rarely reflect on the reason (in fact we do not know)\nwhy QED does not confine electric charge. This ignorance has not kept us from doing\nperturbative calculations, implicitly assuming A0 to vanish at large distances. The validity\nof this expansion for QED is certified by its precise agreement with data.\n\n4. Retarded vs. Feynman propagation\nTree (or Born) diagrams usually give a good first approximation to scattering amplitudes.\nThey are special in the sense that all internal propagators are off-shell and hence insensitive\nto the iε prescription of the propagators. Specifically, Feynman and retarded fermion\npropagators\np\n/ + me\nSF/R (p0 , p) = i 0\n(4.1)\n(p − Ep + iε)(p0 + Ep ∓ iε)\n\ngive the same result for Born terms, whereas Feynman propagators are required in loop\nintegrals. The choice of propagator nevertheless makes a difference even at Born level when\nthe interactions are time-ordered (p0 → t). The E < 0 components propagate backward in\ntime when using the Feynman prescription,\nSF (t, p) =\n\n\u0003\n1 \u0002\nθ(t)(Ep γ 0 − p * γ + me )e−iEp t − θ(−t)(Ep γ 0 + p * γ − me )eiEp t\n2Ep\n\n(4.2)\n\nwhich gives rise to Z-diagrams as shown in Fig. 2. With the retarded prescription there is\nonly forward propagation,\nSR (t, p) =\n\n\u0003\nθ(t) \u0002\n(Ep γ 0 − p * γ + me )e−iEp t + (Ep γ 0 + p * γ − me )eiEp t\n2Ep\n\n(4.3)\n\nThe first diagram on the rhs. of Fig. 2 thus gives the entire time-ordered contribution when\nthe retarded prescription is used, and the Z-contribution vanishes. For either prescription\nthe sum of all time-ordered diagrams (integrated over the interaction times) gives the same\nBorn amplitude.\nThere is usually no need to time-order the interactions of scattering amplitudes, hence\nalso the issue of iε prescription is irrelevant at Born level. Time-ordering is, however,\n\n–6–\n\n\fp0,0 p0, p\nG(p0,p) =\n\nS\n\n+\n\np\n\nS K S K S\nk\n+ k1\nk2\n\n+ ...\n\nFigure 3: Electron scattering from a static external potential. The p0 component of the electron\nmomentum does not change during the scattering. The initial and final electron momenta are\ndenoted (p0 , 0) and (p0 , p), respectively.\n\nrequired to describe bound states using wave functions that give the spatial distribution of\nthe constituents at an instant of time. When using Feynman propagators the infinite set of\ndiagrams that generates a bound state pole has contributions with an unlimited number of\nnested Z-diagrams. This means that the wave function has components with any number\nof constituents.\nAs an illustration consider an electron in a static Coulomb field (Fig. 3). The energy\ncomponent p0 of the electron's 4-momentum is unchanged by the interactions, which only\ntransfer 3-momentum. In the absence of loop corrections the electron's Green function is\ngiven by the sum\nG(p0 , p) = S + SKS + SKSKS + . . . = S + SKG =\n\nR(ER , p)\n+ ...\np0 − ER\n\n(4.4)\n\nwhere S is the free propagator and K the Coulomb interaction kernel −ieγ 0 A0 (k) (the\nproduct involves a convolution over k). The last equality in (4.4) displays a bound state\npole contribution. It is easy to verify that the residue R(ER , p) satisfies the Dirac equation\nin momentum space, i.e., we have Dirac bound states.\nFor p0 > 0 the electron propagators S in each diagram of Fig. 3 are insensitive to\nthe iε prescription at the negative energy pole since p0 6= −Ep in (4.1). Consequently the\npositions p0 = ER of the bound state poles in G(p0 , p) are exactly the same whether we use\nSF or SR propagators. Yet if we time-order the interaction vertices these two propagators\nwill generate very different diagrams. Each Feynman propagator gives a Z-contribution\nas in Fig. 2, while with the retarded propagator only the single electron (of positive or\nnegative energy) is present at any intermediate time. The equal-time wave functions of the\nbound state are thus quite different in the two cases. The wave function we usually solve\nusing the Dirac equation has only the single electron degree of freedom and corresponds\nto the use of a retarded electron propagator. The wave function of Dirac bound states\ncorresponding to the Feynman propagator has an unlimited number of Fock components\nand is seldom (ever?) given explicitly.\n\n5. The Dirac wave function\nThe bound states |φi of non-relativistic quantum mechanics are usually determined as\neigenstates of the hamiltonian,\nH|φi = E|φi\n(5.1)\n\n–7–\n\n\fThe same condition holds in relativistic field theory, but is impractical even for the simple\ncase of an electron bound by a Coulomb potential just discussed. Since the hamiltonian can\ncreate an e+ e− pair from the Coulomb field the state |φi must necessarily contain an infinite\nnumber of pairs – the same conclusion that we reached previously. Hence in relativistic\ntheory one usually determines bound states as poles of Green functions in 4-momentum\nspace rather than using a hamiltonian formulation.\nAccording to our discussion above the standard (single particle) Dirac wave function\nfollows from using retarded propagators in a perturbative evaluation of Green functions\nas in (4.4). We may then ask whether we can set the boundary conditions in the operator equation (5.1) correspondingly, such that it defines a single particle bound state |φi\nwith a Dirac wave function. For this we need a \"retarded vacuum\" in which the electron\npropagator\nSR (x − y) = R h0| T [ψ(x)ψ̄(y)] |0iR\n(5.2)\nagrees with the retarded one in (4.3). The definition\nY †\n|0iR = N −1\ndp,λ |0i\n\n(5.3)\n\np,λ\n\nwhere all the positron states are filled1 and N is an (infinite) normalization constant works\nsince\nψ(x)|0iR = 0\n(5.4)\nimplies no contribution for x0 < y 0 in (5.2). A single-electron state with both positive and\nnegative energy components can then be parametrized by a Dirac (c-number spinor) wave\nfunction φ(x) as\nZ\n|φ, ti =\n\nd3 x ψα† (t, x)φα (x)|0iR\n\n(5.5)\n\nwhere a sum over the Dirac index α is implied. With the QED hamiltonian in the Interaction Picture\nZ\n\u0002\n\u0003\nH(t) = d3 x ψ̄(t, x) − i∇ * γ + m + eγ 0 A0 (x) ψ(t, x)\n(5.6)\n\b\nthe state (5.5) in (5.1) gives, using ψα (t, x), ψβ† (t, x0 ) = δ 3 (x − x0 ) δαβ and (5.4), the\nDirac equation for the wave function φ(x) of a bound state of energy E in the external\nCoulomb potential A0 (x),\n(−i∇ * γ + eγ 0 A0 (x) + m)φ(x) = Eγ 0 φ(x)\n\n(5.7)\n\nIn Sec. 4 we saw that the energy E is independent of the boundary condition (Feynman\nor retarded) when the potential is static and there are no loop corrections. The possibility\nto describe the same state |φi using different wave functions is not so surprising when we\nrecall that the time-ordering of events which are separated by a space-like distance depends\n1\n\nEquivalently, in the retarded vacuum all the negative energy states are empty, which is why pair\nproduction is suppressed.\n\n–8–\n\n\fon the observer. Thus the relative magnitude of the two time-ordered diagrams in Fig. 2\ndepends on the frame, only their sum is Lorentz-invariant2 . In the infinite momentum\nframe the Z-diagram vanishes altogether and one arrives at a limiting picture where the\nhamiltonian does not create particles from the perturbative vacuum. Here I propose to\neliminate the Z-diagrams in a different way, by using retarded fermion propagators at Born\nlevel. The bound states are found to be Lorentz-covariant and can thus be boosted to an\narbitrary frame. To this lowest order contribution perturbative corrections may then be\nsystematically applied.\n\n6. Dynamical boost invariance\nMany approaches to relativistic bound states strive to retain manifest Lorentz covariance.\nA two-particle Fock state wave function for a bound state |φ, P i with CM momentum P\nis covariantly defined by\n\b\nΦPαβ (x − y) ≡ h0|T ψα (x)ψ̄β (y)}|φ, P i\n(6.1)\nThis Bethe-Salpeter wave function has a 'kinematical' frame dependence,\n0\n\nΦP (x0 − y 0 ) = S(Λ)ΦP (x − y)S −1 (Λ)\n\n(6.2)\n\nwhere S(Λ) is the usual Dirac matrix representation of the Lorentz transformation Λ,\nP 0 = ΛP and x0 − y 0 = Λ(x − y). Eq. (6.2) relates a Bethe-Salpeter wave function defined\nat equal time (x0 = y 0 ) to wave functions which generally are at unequal time (x0 0 6= y 0 0 ).\nEqual-time wave functions are related to each other in a non-trivial way since the notion\nof equal time is frame-dependent.\nQuantum field theory is generally not manifestly covariant since one quantizes on a\nspace-like surface, usually the one of equal time [21]. Poincaré invariance is ensured by\nrequiring the transformation generators to satisfy the corresponding Lie algebra. Generators which preserve the quantization plane (such as space translations and rotations for\nequal-time surfaces) define 'kinematic' transformations for which the symmetry is manifest. Generators which transform the quantization plane (such as time translation and\nboosts for equal-time surfaces) involve interactions and correspond to 'dynamical', hidden\nsymmetries.\nA distinguishing feature of bound states is that they have a stationary time dependence, i.e., they are eigenstates of the hamiltonian as in (5.1). Their wave functions define\nthe spatial distribution of the constituents at an instant of time. Boosting equal-time states\nis a dynamical transformation which is generally as difficult as diagonalizing the hamiltonian. This and the problem of unlimited particle production discussed above challenge\nhamiltonian approaches to relativistic bound states.\nClassical relativity would suggest that equal-time wave functions Lorentz contract like\na rigid rod, which is indeed often claimed without further discussion. This issue was only\n2\n\nProvided that also the external potential is Lorentz-transformed. Lorentz covariance is more properly a\nfeature of states that are bound by the mutual interactions of their constituents and experience no external\nforce. I consider this case in the next Section.\n\n–9–\n\n\faddressed recently in the basic case of the Hydrogen atom [7]. It turned out that the\nwave function of the moving atom receives a contribution from both the e− p and the e− pγ\nFock states. In the atomic rest frame the instantaneous Coulomb field A0 dominates and\nonly the electron and proton constituents are present. When these charged constituents\nmove relativistically with the CM they generate a propagating vector field A implying\nintermediate states containing (longitudinal) photons. The e− pγ component of the atomic\nwave function is required for the energy eigenvalue\nof the Hydrogen atom to have the\np\ncorrect dependence on its CM momentum, E = P 2 + M 2 , but does not Lorentz contract\naccording to classical relativity.\nIn the previous section we saw how a relativistic electron bound by a static Coulomb\npotential is described by the single particle Dirac wave function when one uses retarded\npropagators. The bound state energies are insensitive to the choice of propagator when\nonly tree diagrams are retained, which we referred to as the Born approximation. Provided\nthis approximation indeed defines the lowest order in an ~ expansion it must share all the\nsymmetries, and in particular dynamical boost invariance, with the exact result. Hence we\nturn now to a discussion of the ~ expansion in field theory.\n\n7. The ~ expansion\nIt is generally accepted that each loop in a Feynman diagram brings a factor of ~ [20, 22],\nand that physics in the limit of ~ → 0 is classical. However, the first statement has been\nchallenged [23], and the second statement also needs to be stated more precisely. Classical\nquantities such as mass and charge appear, for dimensional reasons, multiplied by powers\nof ~ in the lagrangian. In order to properly define an ~ → 0 limit one must therefore specify\nthe behaviour of all parameters in the theory [9].\nIt is instructive to consider the ~ → 0 limit of the harmonic oscillator in quantum\nmechanics. The propagation of a particle from (ti , xi ) to (tf , xf ) is given by the path\nintegral\n\u0014\n\u0015\nZ\nZ\nim tf\n2\n2 2\nA(xi , xf ; tf − ti ) = [Dx(t)] exp\ndt(ẋ − ω x )\n2~ ti\n\u0015\n\u0014\nZ\nZ\nim tf\n2\n2 2\n ̇\n= [Dξ(t)] exp\ndt(ξ − ω ξ )\n(7.1)\n2 ti\nIn the second expression all explicit dependence on ~ was removed by a mere redefinition of\n√\nthe variables, ξ ≡ x/ ~. Hence it is clear that the full quantum structure of the harmonic\noscillator, including its bound states, remains in the ~ → 0 limit. The usual argument for\nan approach to classical physics is that the rapid variation of the phase factor exp(iS/~)\nselects the classical path for which the action S is stationary. This constraint is evaded for\n√\npaths whose length scales as x ∝ ~ since then S ∝ ~. The bound state wave functions are\nin this category since their extent scales with ξ. Classical physics dominates in the ~ → 0\nlimit only for paths whose length is independent of ~.\nIn field theory one usually sets ~ = 1 at the outset, causing the dimensions of length\nL and energy E to be inversely related. For the present discussion [9] we wish to keep the\n\n– 10 –\n\n\f√\np1 ẽ !\n\np1+k\n\nq = (0,q)\n\nk\n\n√\np2 ẽ !\n\nq–k\np2–k\n\n(a)\n\n(b)\n\nFigure 4: The first two ladder diagrams contributing to non-relativistic atoms in the limit of small\ncoupling α.\n\nfactors of ~ explicit, with dimension [~] = E * L. We keep c = 1, so the units of space and\ntime are both L. The QED action\n\u0014 \u0010\n\u0015\nZ\ne\nm\u0011\n1\n4\nμν\n/−\nSQED = d x ψ̄ i∂/ − A\n(7.2)\nψ − Fμν F\n~\n~\n4\nshould have the same dimension as ~, hence [ψ] = E 1/2 L−1 and [A] = E 1/2 L−1/2 . From\nthe fact that the fine structure constant α = e2 /(4π~) is dimensionless we conclude that\nthe dimension of the classical charge is [e] = E 1/2 L1/2 . This is why the charge in the QED\naction (7.2) enters in the form e/~. Similarly the classical mass appears as m/~.\nIn considering the classical limit of quantum field theory it seems natural to keep the\nclassical quantities e and m fixed as ~ → 0 [23]. For a connection between the power of ~\nand the number of loops we need instead to keep ẽ ≡ e/~ and m̃ ≡ m/~ fixed [20]. After\n√\n√\na rescaling of the fields, ψ̃ ≡ ψ/ ~ and Ã ≡ A/ ~ we get\nZ\nh \u0010\n\u0011 i\n√\n1\n/̃ − m̃ ψ̃\nSQED = d4 x ψ̄ ̃ i∂/ − ẽ ~A\n(7.3)\n~\n√\nwhere ~ appears exclusively in the combination ẽ ~. Adding a loop to any given Feynman\n√\ndiagram gives a factor (ẽ ~)2 and thus a factor of ~. This establishes the equivalence\nbetween the ~ and loop expansions3 . The conclusion is the same for QCD.\nHow about the ~ expansion for bound states? In the weak coupling limit (α → 0)\nQED atoms are given by a sum of ladder diagrams, the first two of which are shown in\nFig. 4. Each ladder increases the number of loops by one, so atoms would seem to be of\nno definite order in ~. On the other hand, the binding energies En = − 12 α2 me /n2 are of\ndefinite power of α = ẽ2 ~/4π. The loop and ~ expansions appear not to be equivalent in\nthis case.\nBound states are indeed a special case because the momenta in the ladders depend\non α. For the ladder sum to maintain an overlap with the bound state wave function the\nmomentum transfer in Fig. 4 must be of the order of the Bohr momentum, |q| = O (αme ),\n\u0001\nwhile the energy transfer should be commensurate with the binding energy, q 0 = O α2 me .\nA Green function also has a factor ~1/2 for each of its external legs, due to the conversions ψ → ψ̃ and\nA → Ã of the corresponding operators. Thus the free electron and photon propagators are of O (~).\n3\n\n– 11 –\n\n\fHence the propagators can contribute negative powers of α. For diagram (a) in Fig. 4 we\nhave A(a) ∼ α/q 2 ∝ 1/α. In diagram (b) the four vertices and the dk 0 d3 k of the loop\nintegral measure give α2 * α2 * α3 = α7 in the numerator. The fermion propagators are each\noff-shell by the binding energy and hence ∝ α−2 , while each photon propagator ∝ α−2 as\nin A(a). Thus the four propagators in (b) contribute ∝ α−8 , implying that A(b) ∝ α−1 is\nof the same order in α and ~ as A(a). This also explains why the ladder sum can diverge at\nthe bound state energies, however small is α. The ladder diagrams are enhanced (∝ 1/α)\nin the weak coupling limit, and thus give the leading contribution to the bound state poles.\nIn diagrams with loop corrections to vertices or propagators the loop momentum does not\ndecrease with α, hence such diagrams give true higher order corrections in α and ~.\nAs α → 0 the sum of ladder diagrams in Fig. 4 describes non-relativistic scattering from\na static Coulomb potential as shown in Fig. 3. Hence the Schrödinger equation gives the\nBorn contribution, of lowest order in ~, to atomic bound states. The Dirac equation with\na Coulomb potential A0 = −α/r can also be obtained from the sum of ladder diagrams\n(with crossed ladders included) in the limit where one of the fermion masses in Fig. 4\ngrows large [24]. The relativistic features which distinguish the Dirac from the Schrödinger\nbound states are of the same O (α) as loop contributions. Thus the Dirac equation for\nthe Hydrogen atom contains only a subset of the relativistic corrections to the Schrödinger\nequation [20].\n\n8. A0 from Gauss' law\nHaving seen that the Schrödinger equation defines a Born term for non-relativistic atoms\nI now return to the hamiltonian field theory formulation (5.1) of bound states. Previously\nI assumed a fixed external potential, now we shall recall how the Coulomb potential arises\nfrom the equations of motion. I take the constituents to have distinct flavor, an electron\ne− and a muon μ+ for definiteness4 .\nIn Coulomb gauge ∇ * A = 0 the QED lagrangian\nX\n1\n/ − m)ψf\nL = − Fμν F μν +\nψ̄f (i∂/ − eA\n4\n\n(8.1)\n\nf =e,μ\n\ndefines the operator constraint\n−∇2 A0 (t, x) = e\n\nX\n\nψf† (t, x)ψf (t, x)\n\n(8.2)\n\nf =e,μ\n\nSince there is no time derivative ∂0 A0 we may express A0 in terms of the fermion operators\nat each instant of time,\nZ\nX †\ne\n0\nψf (t, y)ψf (t, y)\n(8.3)\nA (t, x) = d3 y\n4π|x − y|\nf =e,μ\n\nThe annihilation contributions of an e+ e− bound state are in any case of higher order in α than I shall\nbe concerned with here.\n4\n\n– 12 –\n\n\fThis allows A0 to be eliminated from the action. From −Fμν F μν /4 we get\nZ\nZ\nZ\nX †\n1\n1\n1\n3\n0 2\n3\n0\n2 0\nd x(∇A ) =\nd xA (−∇ A ) =\nd3 x\nψf eA0 ψf\n2\n2\n2\n\n(8.4)\n\nf\n\nwhich cancels half the Coulomb interaction of the fermions. The lagrangian becomes\nX\n\u0001\n1\n1\nL = (∂0 A)2 − Fij F ij +\nψ̄f i∂/ − 21 eγ 0 A0 + eγ * A − mf ψf\n2\n4\n\n(8.5)\n\nf =e,μ\n\nwith A0 given by (8.3). So far we made no approximations.\nThe e− μ+ bound state may be expressed in analogy to the single particle state (5.5)\nas\nZ\n|E, ti = d3 y 1 d3 y 2 ψe† (t, y 1 )χ(y 1 − y 2 )ψμ (t, y 2 )|0i\n(8.6)\nwhere the rest frame wave function χ depends only on the difference of the fermion coordinates. For small α = e2 /4π the state is non-relativistic and the 4 × 4 matrix χ is dominated\nby its large (\"upper\") components. Consequently the couplings of the vector components\nA of the photon field to the fermions are suppressed, and we may at lowest order in α\nneglect them in the hamiltonian,\nZ\nX\n\u0002\n\u0003\nH(t) = d3 x\nψ̄f (t, x) − i∇ * γ + m + 21 eγ 0 A0 (x) ψf (t, x)\n(8.7)\nf =e,μ\n\nThe non-local four-fermion interaction term which arises with the expression (8.3) for A0\nlooks forbidding, but is harmless in the non-relativistic case where particle production is\nneglected. The only contribution to the eigenvalue equation (5.1) then arises from ψe in the\n\b\nhamiltonian annihilating ψe† in the state (8.6) through ψα (t, x), ψβ† (t, y) = δ 3 (x − y) δαβ ,\nand similarly for the muon fields. Keeping only the two-particle contribution the eigenvalue\ncondition becomes\n\u0014\nZ\n→\n−\n3\n3\n†\nH(t)|E, ti =\nd y 1 d y 2 ψe (t, y 1 ) γ 0 (−i∇1 * γ + me )χ(y 1 − y 2 )\n\u0015\n−\nα\n0 ←\n− χ(y 1 − y 2 )γ (i∇2 + mμ ) −\nψμ (t, y 2 )|0i\n(8.8)\n|y 1 − y 2 |\nRequiring the coefficient of ψe† (t, y 1 )ψμ (t, y 2 ) to agree with that of E|E, ti implies\n→\n−\n←\n−\nγ 0 (−i∇ * γ + me )χ(y) − χ(y)γ 0 (−i∇ * γ + mμ ) = [E − V (|y|)]χ(y)\nwhere\nV (|y|) = −\n\nα\n|y|\n\n(8.9)\n\n(8.10)\n\nis the standard Coulomb potential. In the weak coupling limit the bound state equation\n(8.9) reduces [8] to the Schrödinger equation\n\u0012\n\u0013\n∇2\n∇2\n−\n+ V χ = (E − me − mμ )χ\n−\n(8.11)\n2me 2mμ\n\n– 13 –\n\n\fIn this section I recalled that the A0 potential can be expressed in terms of the charged\nfields as in (8.3). I next discuss how this expression may be modified by a homogeneous\nsolution of the field equations, corresponding to a different boundary condition. This gives\na linear potential and thus relativistic bound states even at lowest order in α.\n\n9. A confining boundary condition on A0\nThe strong interactions are characterized by a scale ΛQCD ∼ 200 MeV which is not present\nin the classical QCD lagrangian. The scale is introduced when loop corrections are renormalized, resulting in a \"dimensional transmutation\" where the fixed dimensionless coupling\nis replaced by the running αs (Q). ΛQCD also determines the confinement scale through\nvacuum expectation values such as h0|αs Fμν F μν |0i ∝ Λ4QCD . It is worth recalling that even\nthe QED vacuum is very complicated since the hamiltonian creates and destroys particles,\nimplying an infinite number of balancing fluctuations. Nevertheless, in QED one successfully expands around the empty, perturbative vacuum and includes vacuum fluctuations\nonly perturbatively.\nThe QCD scale is introduced phenomenologically in the quark model, by postulating\na linear potential with scale k in (2.3). Can there be an approach within perturbative\nQCD that allows to arrive at a quark model picture of hadrons? As I discussed in Sec. 7\nthe Schrödinger equation represents a Born level approximation, i.e., it does not include\nloop effects. How could the scale ΛQCD appear at Born level in QCD? One possibility\n(and apparently the only one) is via a boundary condition on the color field strength.\nGauss' law (8.2) (or rather its QCD equivalent) is particularly relevant since it concerns\nthe instantaneous field A0 . Interactions transmitted by the propagating gluon fields A\nnecessarily imply that hadrons have gluons in their Fock states, rather than being (at Born\nlevel) qq̄ and qqq states as in the quark model. The fact that the spectrum of heavy\nquarkonia is qualitatively similar to the atomic spectrum furthermore suggests that they\nbind similarly, through the Coulomb potential A0 .\nConsider adding a homogeneous solution of Gauss' constraint (8.2) to the standard\nexpression (8.3) (still using QED as illustration),\nZ\nX †\ne\nA0 (t, x) = d3 y\nψf (t, y)ψf (t, y) + Λ2 ˆ` * x\n(9.1)\n4π|x − y|\nf =e,μ\n\nwhere Λ and the unit vector ˆ` are independent of x. This contribution implies a constant energy density 21 (∇A0 )2 = 12 Λ2 at asymptotic x. The possibility to add this term\nmeans that it preserves the stationarity of the action under local variations of A0 , but\nnot necessarily stationarity under the global variation of ˆ`. Keeping only the two-particle\n|y 1 , y 2 i ≡ ψe† (t, y 1 )ψμ (t, y 2 )|0i Fock state contribution,\n\u0014 \u0012\n\u0013\n\u0015\ne\n1\n1\n0\n2ˆ\nA (t, x)|y 1 , y 2 i =\n−\n+ Λ ` * x |y 1 , y 2 i\n(9.2)\n4π |x − y 1 | |x − y 2 |\nThe electron and muon generate an electric dipole field, which results in the standard 1/r\npotential in (8.9) (when the infinite, y 1 , y 2 -independent contributions are discarded). The\n\n– 14 –\n\n\finstantaneous A0 -field is thus specific for each position of the fermions. The stationarity of\nthe action under the global variation of ˆ` should similarly be ensured separately for each\nFock state. The field strength contribution may be evaluated as in (8.4) through partial\nintegration (except for the Λ4 term). This gives to O (e),\nZ\nZ\ni\nh\ni\nX †\n1\n1h 4\n3\n4\n2ˆ\nd3 x − eΛ2 ˆ` * (y 1 − y 2 ) |y 1 , y 2 i\nd x Λ −e\nψf (x)Λ ` * x ψf (x) |y 1 , y 2 i = Λ\n2\n2\nf\n\n(9.3)\nThe first term on the rhs. is proportional to the volume of space and is due to the constant\nenergy density 12 (∇A0 )2 . In bound state calculations this infinite term can be discarded\nprovided Λ is independent of y 1 and y 2 . Stationarity of the second term wrt. variations of\nˆ` imposes (up to a sign)\nˆ` = y 1 − y 2\n(9.4)\n|y 1 − y 2 |\nwhich gives a linear potential contribution to the interaction energy in (8.7),\nV (y 1 , y 2 ) = 12 eΛ2 |y 1 − y 2 |\n\n(9.5)\n\nAssuming a non-vanishing energy density (Λ 6= 0) thus leads to a linear potential. It\nis interesting to note that this is consistent with translation invariance only for neutral\nstates. For an electron with charge e1 and a muon with charge e2 we would have obtained\na potential V ∝ |e1 y 1 − e2 y 2 |, which is not invariant under a translation y i → y i + c. The\nrestriction to neutral bound states is consistent with color confinement in QCD.\n\u0001\nThe linear potential (9.5) is of O (e) and thus leading wrt. the O e2 photon exchange\ncontribution (8.10). This allows to study bound states self-consistently using only the\nlinear potential, and introducing photon exchange perturbatively. For relativistic states\n\u0001\nalso the propagating components A of the photon field would contribute at O e2 . As I\nmentioned in Sec. 6 the longitudinal components of the photon field must be taken into\naccount even for the Hydrogen atom when it is in relativistic CM motion.\nIn the previous discussion I considered only two-particle Fock states, as appropriate for\nnon-relativistic e− μ+ bound states. This restriction can be removed using the observation\nin Sec. 5 that pair production for Dirac states is \"hidden\" when using retarded boundary\nconditions at asymptotic times. At the Born level, i.e., at lowest order in ~, there are no\nloops and the energy eigenvalues are unaffected by the iε prescription of the propagators. It\nshould be recalled that despite the apparent simplicity of the ensuing, Dirac-type \"valence\"\nwave functions the relativistic bound states actually contain an infinite number of pairs\nwhen Feynman boundary conditions are imposed at t = ±∞.\nThe generalization of the \"retarded vacuum\" (5.3) to the case of two fermions e− and\nμ+ is straightforward,\nY\n|0iR = N −1\nd†e (p, λ) b†μ (p, λ)|0i\n(9.6)\np,λ\n\nimplying\nψe (x)|0iR = ψμ† (x)|0iR = 0\n\n(9.7)\n\nWhen the |E, ti bound state in (8.6) is defined using the retarded |0iR rather than the\nperturbative vacuum |0i the property (9.7) ensures that only two-particle states contribute.\n\n– 15 –\n\n\f10. qq̄ states in QCD\nI used QED in the above discussion to illustrate the essential features of the approach. The\nmethod of deriving bound states at Born level in ~ and at lowest order in the coupling can\nalso be applied to QCD, with\nX\na\n/ a TaAB − mf )ψfB\nLQCD = − 14 Faμν Fμν\n+\nψ̄fA (i∂/ − g A\nf =u,d\n\nFaμν\n\n=∂\n\nμ\n\nAνa\n\n−∂\n\nν\n\nAμa\n\n− gfabc Aμb Aνc\n\n(10.1)\n\nThe retarded vacuum now includes a product over color to make it gauge invariant,\nY\nA†\n|0iR = N −1\ndA†\n(10.2)\nu (p, λ) bd (p, λ)|0i\np,λ,A\n\nand the ud ̄ meson state is\nXZ\n|E, ti =\nd3 y 1 d3 y 2 ψuA† (t, y 1 )χAB (y 1 , y 2 )ψdB (t, y 2 )|0iR\n\n(10.3)\n\nA,B\n\nThis state is invariant under (time-independent) gauge transformations ψ(t, x) → U (x)ψ(t, x)\nprovided that the wave function is transformed as\nχ(y 1 , y 2 ) → U (y 1 )χ(y 1 , y 2 )U † (y 2 )\n\n(10.4)\n\nWe may then look for stationary states of the form (10.3) in a Coulomb gauge where the\nwave function has the standard \"color singlet\" form,\nχAB (y 1 , y 2 ) = δ AB χ(y 1 , y 2 )\n\n(10.5)\n\nThe equation of motion for the gluon field\nX\n\u0001 b\nδ\nμ\nμ\nψ̄fA γρ TaAB ψfB = 0\nρ LQCD = ∂ δab + gfabc Ac Fμρ − g\nδAa\n\n(10.6)\n\nf\n\nhas the perturbative solution\nA0a (t, x) = Λ2a ˆ`a * x +\n\nZ\n\nd3 y\n\nX †\n\u0001\ng\nψfA (t, y)TaAB ψfB (t, y) + O g 2\n4π|x − y|\nf\n\nAa (t, x) = O (g)\n\n(10.7)\n\nprovided Λa = 0 for a 6= 3, 8. Introducing a homogeneous solution only for the color\ndiagonal generators T3 and T8 is necessary to ensure the color structure (10.5) of the wave\n\u0001\nfunction and implies that the non-abelian terms in (10.6) are of O g 2 .\nR\nFor the solution (10.7) the interaction part of the Lagrange function LI (t) = d3 x LI,QCD\nis\nZ\nXh\nX †\n\u0001i\n1\nLI (t) =\nd3 x\nΛ4a − gΛ2a ˆ`a * x\nψfA (t, x)TaAB ψfB (t, x) + O g 2\n(10.8)\n2\na\nf\n\n– 16 –\n\n\fThe (infinite) energy proportional to the volume of space must be the same for all Fock\ncomponents of the bound state (10.3), which requires that the field strength\nX\nΛ4 ≡\nΛ4a\n(10.9)\na=3,8\n\nis a universal constant. I do not show this term in the following. The remaining part of LI (t)\n†\nin (10.8) should be stationary on each Fock component |y 1 , y 2 ; Ci ≡ ψuC (y 1 )ψdC (y 2 )|0iR ,\n\u0001\ng X 2 CC ˆ\nLI (t)|y 1 , y 2 ; Ci = −\nΛa Ta `a * (y 1 − y 2 )|y 1 , y 2 ; Ci + O g 2\n(10.10)\n2 a\nThe variation wrt. the direction of ˆ`a imposes (up to a sign),\nCC\nˆ`a = Ta (y 1 − y 2 )\n|TaCC (y 1 − y 2 )|\n\n(10.11)\n\nThe Lagrange function (10.10) must be stationary also wrt. variations of the ratio Λ23 /Λ28 ,\nunder the constraint that Λ in (10.9) is fixed. Together with (10.11) this gives\nq\n\u0001\n\u0001\ngΛ2 P\nCC 2 y − y |y , y ; Ci + O g 2\n(10.12)\nLI (t)|y 1 , y 2 ; Ci = −\n1\n2\n1\n2\na Ta\n2\nThe SU(3) generator identity\nP\n\nAB CD\na Ta Ta\n\n=\n\n1\n2\n\nδAD δBC − 13 δAB δCD\n\n\u0001\n\n(10.13)\n\n\u00012\nP\ngives a TaCC = 13 , ensuring that the eigenvalue in (10.12) is independent of the color\n\u0001\nC of the quarks. For the interaction hamiltonian HI (t) = −LI (t) + O g 2 we have\n\u0001\ngΛ2\nHI (t)|y 1 , y 2 ; Ci = √ y 1 − y 2 |y 1 , y 2 ; Ci + O g 2\n2 3\n\n(10.14)\n\nThe fact that the linear potential has the same strength for all color components of the\nwave function is consistent with the diagonal ansatz (10.5).\nThe eigenvalue condition for the bound states defined by (10.3) and (10.5) is then, up\n\u0001\nto terms of O g 2 ,\nZ\nH(t)|E, ti =\n\nd3 xd3 y 1 d3 y 2\n\ni\nh\ngΛ2\nψ̄fA (t, x) − i∇x * γ + mf + √ (y 1 − y 2 ) γ 0 ψfA (t, x)\n2 3\nf,A,B\nX\n\n× ψuB† (t, y 1 )χ(y 1 , y 2 )ψdB (t, y 2 )|0iR = E |E, ti\nUsing\n\b A\nψf,α (t, x), ψfB†\n= δ 3 (x − y) δαβ δf f 0 δAB\n0 ,β (t, y)\n\n(10.15)\n\n†\n\nψuA (x)|0iR = ψdA (x)|0iR = 0\n(10.16)\nwe get the condition for the wave function χ(y 1 , y 2 ) of (10.5),\nand\n\n→\n−\n←\n−\nγ 0 (−i∇1 *γ +mu )χ(y 1 , y 2 )−χ(y 1 , y 2 )γ 0 (i∇2 +md ) = [E −V (|y 1 −y 2 |)] χ(y 1 , y 2 ) (10.17)\n\n– 17 –\n\n\fwith the linear potential5\n\n\u0001\ngΛ2\nV (|y|) = √ y + O g 2\n2 3\n\n(10.18)\n\nThis bound state condition for the wave function is valid in any frame. For a state\n(10.3) with CM momentum k the wave function has the form\nχ(y 1 , y 2 ) = eik*(y1 +y2 )/2 χk (y 1 − y 2 )\n\n(10.19)\n\nSubstituting this in (10.17) gives\n\u0002\n\u0003\n−i∇*[α, χk (y)]+ 21 k*{α, χk (y)}+mu γ 0 χk (y)−χk (y)γ 0 md = Ek −V (|y|) χk (y) (10.20)\nwhere α = γ 0 γ. As I discussed in Sec. 6, equal-time wave functions transform dynamically\nunder boosts. Thus (10.20) is not manifestly Lorentz covariant. Nevertheless, since we\narrived at this equation through an expansion in the fundamental parameters ~ and αs ,\nthe energy eigenvalues should have the correct dependence on the CM momentum: Ek =\np\nk2 + M 2 . Remarkably, this relation is found to hold [25]. The wave function transforms\ndynamically under boosts, Lorentz contracting at a rate ∝ 1/(E − V ) which depends on\nthe potential, and hence on the separation |y| between the quarks.\nThe bound state equation (10.20) is (to my knowledge) the only case where a correct\nk-dependence of the energy has been obtained. This occurs only in the case of an exactly\n\u0001\nlinear potential, as expected since the O g 2 gluon exchange corrections were neglected in\nthe derivation.\n\n11. qqq states in QCD\nThe derivation of uds bound states (baryons) is similar to the above qq̄ case (mesons), but\ncontains some new elements. The state is defined as\nX Z\nB†\nA†\nC†\n1 α2 α3\n|E, ti =\n(t, y 2 )ψsα\n(y 1 , y 2 , y 3 )|0iR\nd3 y 1 d3 y 2 d3 y 3 ψuα\n(t, y 1 )ψdα\n(t, y 3 )χαABC\n1\n3\n2\nA,B,C\n\n(11.1)\nwhere now\n|0iR = N −1\n\nY\n\nA†\nA†\ndA†\nu (p, λ) dd (p, λ) ds (p, λ)|0i\n\n(11.2)\n\np,λ,A\n\nThe baryon state (11.1) is invariant under time independent gauge transformations ψ A (t, x) →\n0\n0\nU AA (x)ψ A (t, x) provided the wave function is transformed as\n0\n\n0\n\n0\n\nχABC (x1 , x2 , x3 ) → U AA (x1 )U BB (x2 )U CC (x3 )χA0 B 0 C 0 (x1 , x2 , x3 )\n\n(11.3)\n\nI assume that there is a gauge where\n1 α2 α3\nχαABC\n(y 1 , y 2 , y 3 ) = \u000fABC χα1 α2 α3 (y 1 , y 2 , y 3 )\n5\n\n(11.4)\n\nThe coefficient differs from that of Eq. (5.25) in [8] due to a different regularization of the infinite\ncontribution ∝ the volume of space in (10.8).\n\n– 18 –\n\n\fThe solution (10.7) of the QCD equations of motion gives the Lagrange function (10.8)\nwith the same divergent contribution as before which requires that Λ in (10.9) is universal\n(independent of the state). Applying the Lagrange function (minus the divergent term) to\na specific Fock component of the bound state (11.1) where, according to (11.4) A, B, C is\nsome permutation of 1, 2, 3, gives\nL(t)|y 1 , y 2 , y 3 ; ABCi ≡ L(t)ψuA† (y 1 )ψdB† (y 2 )ψsC† (y 3 )|0iR\n(11.5)\n\u0001\ng X 2ˆ\n=−\nΛa `a * TaAA y 1 + TaBB y 2 + TaCC y 3 |y 1 , y 2 , y 3 ; ABCi\n2 a\nThe condition of stationarity aligns ˆ`a with the vector it multiplies in (11.5), hence\ng X 2 AA\nL(t)|y 1 , y 2 , y 3 ; ABCi = −\nΛ T y 1 + TaBB y 2 + TaCC y 3 |y 1 , y 2 , y 3 ; ABCi (11.6)\n2 a a a\nUnder translations y i → y i + c the vector Y a = TaAA y 1 + TaBB y 2 + TaCC y 3 shifts by\n(Tr Ta ) c = 0. Hence the color structure (11.4) ensures translation invariance.\nThe expression (11.6) is extremal for Λ23 /Λ28 = |Y 3 |/|Y 8 |, which depends on the quark\npositions y i . The interaction hamiltonian, i.e., the potential, is then\nq\ngΛ2\nV (y 1 , y 2 , y 3 ) =\nY 23 + Y 28\n(11.7)\n2\nIn order to be consistent with the color structure (11.4) this potential should be independent\nof the specific color permutation A, B, C of the quarks at position y 1 , y 2 , y 3 . This may be\nseen as follows:\nX\nXh\n\u0001 i2\nTaAA y 1 + TaBB y 2 − TaAA + TaBB y 3\n(11.8)\nY 2a =\na\n\na\n\n=\n\nXh\na\n\ni\n\u00012\n\u00012\nTaAA (y 1 − y 3 )2 + TaBB (y 2 − y 3 )2 + 2TaAA TaBB (y 1 − y 3 ) * (y 2 − y 3 )\n\n\u00012\nP\nP\nwhere according to (10.13) a TaAA = 13 and a 2TaAA TaBB = − 31 (for A 6= B). Hence\nthe baryon potential is independent of the color permutation A, B, C and equals\ngΛ2 p\nV (y 1 , y 2 , y 3 ) = √\n(y 1 − y 2 )2 + (y 2 − y 3 )2 + (y 3 − y 1 )2\n2 6\n\n(11.9)\n\nIn the limit where two quarks are in the same position, e.g., y 2 = y 3 , this potential\ncoincides with the meson potential (10.18). An analogous potential cannot be constructed\nfor more than three quarks, as there are then more independent quark separations than\ndiagonal SU(3) generators.\nProceeding as in the qq̄ case results in the bound state condition on the wave function\n(11.4) [8],\n3\nX\n\u0002\nj=1\n\n\u0003\nγ 0 (−i∇j * γ j + mj ) χ(y 1 , y 2 , y 3 ) = (E − V )χ(y 1 , y 2 , y 3 )\n\nwith V given by (11.9).\n\n– 19 –\n\n(11.10)\n\n\f12. Discussion\nThe above presentation covered much ground. Some of the topics were of a very basic and\nestablished nature, while other parts may be classified as recent research proposals. To\nmake it easier to digest the arguments I recapitulate and comment on the main steps.\nI discussed a perturbative approach to bound states in field theory. For QED atoms we\nknow that this is the right method, since it gives accurate agreement with data. Applying\nperturbation theory to bound states requires somewhat different methods than used for\nscattering amplitude calculations. In order to generate a bound state pole one needs to\nsum an infinite set of Feynman diagrams. In the α → 0 limit ladder diagrams of the type\nshown in Fig. 4 give the leading contribution when the external momenta are scaled with\nα so as to be compatible with the bound state wave function. The residue of the pole\nsatisfies the Schrödinger equation, which defines the Born term in a systematic evaluation\nof higher order corrections [19, 26].\nPerturbation theory can give us insights into the properties of relativistic bound states\nfrom \"first principles\", and its relevance for QCD bound states merits careful consideration.\nThere are indications that the QCD coupling has a moderate value α0 ' 0.5 even at\ndistances of O (1 fm). Many issues involving relativistic states have received less attention\nthan they deserve, such as the boost dependence of the Hydrogen atom wave function in\nQED [7]. As I noted in Sec. 6, this offers an example of how the Lorentz contraction of a\nclassical stick is realized, and differs, in quantum mechanics.\nIn perturbation theory already the lowest order contribution is expected to provide a\ngood qualitative description of the exact result. Hence I focussed on the physical principles\nof bound states at Born level. The Hydrogen atom may be thought of as bound by the\ninstantaneous Coulomb field A0 (x; x1 , x2 ) which is determined by Gauss' law (8.2) separately and differently for each position x1 , x2 of the electron and proton. Both the electron\nand the proton interact with this Coulomb field – double counting is prevented because the\nfield energy (8.4) cancels half of the interaction energy. The Coulomb field A0 measured\nby an external observer far from the bound state is then given by the coherent sum over all\nR\nconfigurations of the atom, A0 (x) = dx1 dx2 φ(x1 , x2 )A0 (x; x1 , x2 ) where φ is the wave\nfunction.\nIn courses on relativistic quantum mechanics the Dirac equation is often introduced\nthrough its historical context, with a wave function φ(x) that is a c-number. In a field\ntheory context the Dirac equation later reappears as an exact operator-valued equation\nderived from the QED action. The similar notation obscures the fact that the c-numbered\nDirac equation is only an approximate relation which can be derived from summing a\nsubset of Feynman diagrams in a certain limit [24]. The negative energy components of\nthe Dirac wave function φ(x) are often vaguely explained as related to antiparticle effects.\nIn Secs. 4 and 5 we saw that φ(x) is the wave function obtained using retarded propagators\nand describes a state which, with Feynman propagators, has contributions from an infinite\nnumber of particle-antiparticle pairs. The two descriptions give exactly the same bound\nstate energy in the absence of loop corrections. This possibility to describe a state with\ninfinitely many pairs using a single-particle wave function might shed light on the puzzle\n\n– 20 –\n\n\fof why hadron quantum numbers reflect their valence quark degrees of freedom only, with\nno reference to the sea quarks and gluons.\nThe use of retarded propagators is only possible in the absence of loops, which in turn is\ngenerally understood to imply Born level, or lowest order in ~. The concept of a Born term\nfor bound states appears not to have been discussed before [8, 9]. The Schrödinger equation\nis the Born term for non-relativistic states (Sec. 7). The ~ expansion is equally applicable\nto relativistic bound states, for which it provides a well-defined first approximation. Since\n~ is a fundamental parameter each order in the expansion must have all the symmetries of\nthe exact result. As I discussed in Sec. 6, the full Poincaré invariance of quantum theory is\nnot manifest due to the choice of a quantization surface (e.g., equal time or equal light-front\ntime) [21]. Hence the Born term of equal-time bound states has a hidden, dynamical boost\ninvariance. This can hardly be obtained without a precise theoretical framework such as\nperturbation theory [27].\nStudents should be aware that my proposal in Sec. 9 to consider a homogeneous solution to Gauss' law (Eq. (9.1)) is an \"educated speculation\". There is not sufficient\nexperience yet to tell whether such a solution gives fully self-consistent and meaningful\nresults. It fulfills the essential requirement of giving a stationary action, thus maintaining\nthe symmetries of the theory. The bound state equation has manifest rotational symmetry\nin the CM and dynamic boost invariance for the purely linear potential of the Born term.\nThe application to qq̄ and qqq bound states in QCD is straightforward and maintains\ncolor covariance. Further work is needed to study the properties of such solutions. The\npresent hamiltonian formulation should allow to study many physical observables such as\nform factors, parton distributions and scattering phenomena. The relevance of imposing\nthe boundary condition (10.7) on A0 (x) which gives a finite energy density as |x| → ∞\nwill depend on the outcome of those applications.\nI should emphasize that the present approach does not explain why there is confinement\nin QCD but not in QED. The vacuum energy density Λ4 in (10.9) is a free parameter, which\nmust be set to zero \"by hand\" for QED. This is only a proposal for how confinement can\nbe described in a field theory context.\nI did not discuss the important issue of chiral symmetry. In the spirit of the present\napproach a possibility to describe spontaneous symmetry breaking may be to impose chirally non-symmetric states as a boundary condition, in analogy to the non-vanishing of the\nenergy density, Λ 6= 0 in (10.9).\n\nAcknowledgments\nI wish to thank the organizers of the International Summer School and Conference on High\nEnergy Physics: Standard Model and Beyond (ISSCSMB '10) for their kind invitation and\nsupport. I am also grateful for comments on the present manuscript by Matti Järvinen\nand for travel support from the Magnus Ehrnrooth Foundation.\n\nReferences\n[1] A. S. Kronfeld and C. Quigg, Am. J. Phys. 78 (2010) 1081-1116. [arXiv:1002.5032 [hep-ph]].\n\n– 21 –\n\n\f[2] W. Hollik, arXiv:1012.3883 [hep-ph].\n[3] A. Pich, arXiv:0705.4264 [hep-ph].\n[4] M. H. Seymour, arXiv:hep-ph/0505192.\n[5] K. Nakamura et al. [Particle Data Group], J. Phys. G 37 (2010) 075021.\n[6] U. D. Jentschura, Svetlana Kotochigova, Eric-Olivier Le Bigot, Peter J Mohr, Barry N\nTaylor, Phys. Rev. Lett. 95 (2005) 163003.\n[7] M. Järvinen, Phys. Rev. D 71 (2005) 085006 [arXiv:hep-ph/0411208].\n[8] P. Hoyer, arXiv:0909.3045 [hep-ph];\nP. Hoyer, Acta Phys. Polon. B41, 2701 (2010) [arXiv:1010.5431 [hep-ph]].\n[9] S. J. Brodsky, P. Hoyer, Phys. Rev. D83 (2011) 045026. [arXiv:1009.2313 [hep-ph]].\n[10] S. Bethke, Eur. Phys. J. C64, 689-703 (2009). [arXiv:0908.1135 [hep-ph]].\n[11] S. J. Brodsky, S. Menke, C. Merino and J. Rathsman, Phys. Rev. D 67 (2003) 055008\n[arXiv:hep-ph/0212078];\nG. Grunberg, Phys. Rev. D 73 (2006) 091901 [arXiv:hep-ph/0603135];\nC. S. Fischer, J. Phys. G 32 (2006) R253 [arXiv:hep-ph/0605173];\nA. Deur, V. Burkert, J. P. Chen and W. Korsch, Phys. Lett. B 665 (2008) 349\n[arXiv:0803.4119 [hep-ph]].\n[12] Y. L. Dokshitzer, G. Marchesini and B. R. Webber, Nucl. Phys. B 469 (1996) 93\n[arXiv:hep-ph/9512336];\nY. L. Dokshitzer and B. R. Webber, Phys. Lett. B 404 (1997) 321 [arXiv:hep-ph/9704298];\nY. L. Dokshitzer, A. Lucenti, G. Marchesini and G. P. Salam, JHEP 9805 (1998) 003\n[arXiv:hep-ph/9802381];\nY. L. Dokshitzer, G. Marchesini and G. P. Salam, Eur. Phys. J. direct C 1 (1999) 3\n[arXiv:hep-ph/9812487].\n[13] P. A. Movilla Fernandez, S. Bethke, O. Biebel, S. Kluth, Eur. Phys. J. C22 (2001) 1-15.\n[hep-ex/0105059].\n[14] T. Gehrmann, M. Jaquier, G. Luisoni, Eur. Phys. J. C67 (2010) 57-72. [arXiv:0911.2422\n[hep-ph]].\n[15] S. P. Malace, Y. Kahn, W. Melnitchouk and C. E. Keppel, Phys. Rev. Lett. 104 (2010)\n102001 [arXiv:0910.4920 [hep-ph]].\n[16] R. L. Anderson et al., Phys. Rev. D 14, 679 (1976);\nM. E. McCracken et al. [CLAS Collaboration], Phys. Rev. C 81, 025201 (2010)\n[arXiv:0912.4274 [nucl-ex]];\nR. A. Schumacher and M. M. Sargsian, arXiv:1012.2126 [hep-ph];\nC. Bochna et al. [E89-012 Collaboration], Phys. Rev. Lett. 81, 4576 (1998)\n[arXiv:nucl-ex/9808001];\nI. Pomerantz et al. [JLab Hall A Collaboration], Phys. Lett. B 684, 106 (2010)\n[arXiv:0908.2968 [nucl-ex]].\n[17] C. P. Fong, B. R. Webber, Nucl. Phys. B355 (1991) 54-81;\nP. Abreu et al. [ DELPHI Collaboration ], Phys. Lett. B459 (1999) 397-411;\nG. Abbiendi et al. [ OPAL Collaboration ], Eur. Phys. J. C27 (2003) 467-481.\n[hep-ex/0209048].\n\n– 22 –\n\n\f[18] Y. L. Dokshitzer, \"Perturbative QCD theory (includes our knowledge of αs )\", Talk at the\n29th International Conference On High-Energy Physics (ICHEP 98, Vancouver, July 1998),\nhep-ph/9812252;\nY. L. Dokshitzer, \"QCD phenomenology\", Lectures at the CERN-Dubna School (Pylos,\nAugust 2002), hep-ph/0306287;\nY. L. Dokshitzer, Acta Phys. Polon. B 36 (2005) 361 [arXiv:hep-ph/0411227];\nY. L. Dokshitzer, \"On the other side of asymptotic freedom\" Talk at the Workshop on\nPrecision Measurements of αs (Munich, February 2011),\nhttp://indico.mppmu.mpg.de/indico/conferenceDisplay.py?confId=973.\n[19] G. P. Lepage, PhD thesis, SLAC Report SLAC-R-212 (1978).\n[20] C. Itzykson, J. B. Zuber, Quantum Field Theory, New York, Usa: Mcgraw-hill (1980) 705\nP.(International Series In Pure and Applied Physics).\n[21] P. A. M. Dirac, Rev. Mod. Phys. 21 (1949) 392-399.\n[22] J. Iliopoulos, C. Itzykson, A. Martin, Rev. Mod. Phys. 47 (1975) 165.\n[23] B. R. Holstein and J. F. Donoghue, Phys. Rev. Lett. 93, 201602 (2004) [hep-th/0405239].\n[24] D. R. Yennie, Brandeis Summer Institute Lectures on Strong and Electromagnetic\nInteractions (Brandeis University, Waltham, Mass., 1963), Vol. I.;\nS. J. Brodsky, In *Brandeis Univ 1969, Proceedings, Atomic Physics and Astrophysics,\nVol.1*, New York 1971, 91-169 ; and SLAC-PUB-1010 (1971);\nA. R. Neghabian and W. Glöckle, Can. J. Phys. 61 (1983) 85.\n[25] P. Hoyer, preprint HU-TFT-85-49 (http://www-lib.kek.jp/cgi-bin/img index?8601069 ) and\nPhys. Lett. B 172 (1986) 101.\n[26] T. Kinoshita, [hep-ph/9808351].\n[27] X. Artru, Phys. Rev. D29 (1984) 1279.\n\n– 23 –\n\n\f"}