{"id": "http://arxiv.org/abs/1003.2071v2", "guidislink": true, "updated": "2010-08-05T17:27:26Z", "updated_parsed": [2010, 8, 5, 17, 27, 26, 3, 217, 0], "published": "2010-03-10T10:29:47Z", "published_parsed": [2010, 3, 10, 10, 29, 47, 2, 69, 0], "title": "Dynamical Phase Transitions and Instabilities in Open Atomic Many-Body\n  Systems", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.3118%2C1003.5109%2C1003.2571%2C1003.5956%2C1003.0412%2C1003.3023%2C1003.6014%2C1003.5101%2C1003.0693%2C1003.0941%2C1003.1767%2C1003.1966%2C1003.5723%2C1003.2374%2C1003.1771%2C1003.1821%2C1003.4645%2C1003.3269%2C1003.2375%2C1003.4870%2C1003.3114%2C1003.1060%2C1003.5802%2C1003.4774%2C1003.0760%2C1003.0733%2C1003.2728%2C1003.3719%2C1003.1458%2C1003.5276%2C1003.0687%2C1003.1333%2C1003.0293%2C1003.5286%2C1003.1964%2C1003.5200%2C1003.4046%2C1003.5029%2C1003.3417%2C1003.5264%2C1003.3203%2C1003.4513%2C1003.3416%2C1003.4053%2C1003.3471%2C1003.0965%2C1003.3066%2C1003.0043%2C1003.4455%2C1003.0976%2C1003.4062%2C1003.2704%2C1003.0243%2C1003.5250%2C1003.1521%2C1003.6053%2C1003.0762%2C1003.4480%2C1003.5362%2C1003.4688%2C1003.2875%2C1003.3040%2C1003.3477%2C1003.2414%2C1003.3331%2C1003.3344%2C1003.4349%2C1003.1229%2C1003.1064%2C1003.3493%2C1003.4999%2C1003.1148%2C1003.4737%2C1003.3683%2C1003.2832%2C1003.2884%2C1003.0746%2C1003.2601%2C1003.3464%2C1003.2641%2C1003.3722%2C1003.4013%2C1003.3487%2C1003.1892%2C1003.3387%2C1003.0129%2C1003.2101%2C1003.4952%2C1003.1580%2C1003.4574%2C1003.2986%2C1003.5745%2C1003.4224%2C1003.1363%2C1003.0245%2C1003.2071%2C1003.5431%2C1003.4724%2C1003.5729%2C1003.4966%2C1003.2879&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Dynamical Phase Transitions and Instabilities in Open Atomic Many-Body\n  Systems"}, "summary": "We discuss an open driven-dissipative many-body system, in which the\ncompetition of unitary Hamiltonian and dissipative Liouvillian dynamics leads\nto a nonequilibrium phase transition. It shares features of a quantum phase\ntransition in that it is interaction driven, and of a classical phase\ntransition, in that the ordered phase is continuously connected to a thermal\nstate. Within a generalized Gutzwiller approach which includes the description\nof mixed state density matrices, we characterize the complete phase diagram and\nthe critical behavior at the phase transition approached as a function of time.\nWe find a novel fluctuation induced dynamical instability, which occurs at long\nwavelength as a consequence of a subtle dissipative renormalization effect on\nthe speed of sound.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1003.3118%2C1003.5109%2C1003.2571%2C1003.5956%2C1003.0412%2C1003.3023%2C1003.6014%2C1003.5101%2C1003.0693%2C1003.0941%2C1003.1767%2C1003.1966%2C1003.5723%2C1003.2374%2C1003.1771%2C1003.1821%2C1003.4645%2C1003.3269%2C1003.2375%2C1003.4870%2C1003.3114%2C1003.1060%2C1003.5802%2C1003.4774%2C1003.0760%2C1003.0733%2C1003.2728%2C1003.3719%2C1003.1458%2C1003.5276%2C1003.0687%2C1003.1333%2C1003.0293%2C1003.5286%2C1003.1964%2C1003.5200%2C1003.4046%2C1003.5029%2C1003.3417%2C1003.5264%2C1003.3203%2C1003.4513%2C1003.3416%2C1003.4053%2C1003.3471%2C1003.0965%2C1003.3066%2C1003.0043%2C1003.4455%2C1003.0976%2C1003.4062%2C1003.2704%2C1003.0243%2C1003.5250%2C1003.1521%2C1003.6053%2C1003.0762%2C1003.4480%2C1003.5362%2C1003.4688%2C1003.2875%2C1003.3040%2C1003.3477%2C1003.2414%2C1003.3331%2C1003.3344%2C1003.4349%2C1003.1229%2C1003.1064%2C1003.3493%2C1003.4999%2C1003.1148%2C1003.4737%2C1003.3683%2C1003.2832%2C1003.2884%2C1003.0746%2C1003.2601%2C1003.3464%2C1003.2641%2C1003.3722%2C1003.4013%2C1003.3487%2C1003.1892%2C1003.3387%2C1003.0129%2C1003.2101%2C1003.4952%2C1003.1580%2C1003.4574%2C1003.2986%2C1003.5745%2C1003.4224%2C1003.1363%2C1003.0245%2C1003.2071%2C1003.5431%2C1003.4724%2C1003.5729%2C1003.4966%2C1003.2879&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We discuss an open driven-dissipative many-body system, in which the\ncompetition of unitary Hamiltonian and dissipative Liouvillian dynamics leads\nto a nonequilibrium phase transition. It shares features of a quantum phase\ntransition in that it is interaction driven, and of a classical phase\ntransition, in that the ordered phase is continuously connected to a thermal\nstate. Within a generalized Gutzwiller approach which includes the description\nof mixed state density matrices, we characterize the complete phase diagram and\nthe critical behavior at the phase transition approached as a function of time.\nWe find a novel fluctuation induced dynamical instability, which occurs at long\nwavelength as a consequence of a subtle dissipative renormalization effect on\nthe speed of sound."}, "authors": ["Sebastian Diehl", "Andrea Tomadin", "Andrea Micheli", "Rosario Fazio", "Peter Zoller"], "author_detail": {"name": "Peter Zoller"}, "author": "Peter Zoller", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1103/PhysRevLett.105.015702", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1003.2071v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1003.2071v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "4+ pages, 3 figures", "arxiv_primary_category": {"term": "cond-mat.quant-gas", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.quant-gas", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1003.2071v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1003.2071v2", "journal_reference": "Phys. Rev. Lett. 105, 015702 (2010)", "doi": "10.1103/PhysRevLett.105.015702", "fulltext": "Dynamical Phase Transitions and Instabilities in Open Atomic Many-Body Systems\nSebastian Diehl,1, 2 Andrea Tomadin,2, 3 Andrea Micheli,1, 2 Rosario Fazio,3 and Peter Zoller1, 2\n\narXiv:1003.2071v2 [cond-mat.quant-gas] 5 Aug 2010\n\n2\n\n1\nInstitute for Theoretical Physics, University of Innsbruck, Technikerstr. 25, A-6020 Innsbruck, Austria\nInstitute for Quantum Optics and Quantum Information of the Austrian Academy of Sciences, A-6020 Innsbruck, Austria\n3\nNEST, Scuola Normale Superiore and Istituto Nanoscienze - CNR, Pisa, Italy\n\nWe discuss an open driven-dissipative many-body system, in which the competition of unitary\nHamiltonian and dissipative Liouvillian dynamics leads to a nonequilibrium phase transition. It\nshares features of a quantum phase transition in that it is interaction driven, and of a classical\nphase transition, in that the ordered phase is continuously connected to a thermal state. Within a\ngeneralized Gutzwiller approach which includes the description of mixed state density matrices, we\ncharacterize the complete phase diagram and the critical behavior at the phase transition approached\nas a function of time. We find a novel fluctuation induced dynamical instability, which occurs at long\nwavelength as a consequence of a subtle dissipative renormalization effect on the speed of sound.\nPACS numbers: 64.70.Tg,03.75.Kk,67.85.Hj\n\nExperiments with cold atoms provide a unique setting\nto study nonequilibrium phenomena and dynamics, both\nin closed systems but also for (driven) open quantum\ndynamics. This relies on the ability to control the manybody dynamics and to prepare initial states far from the\nground state. For closed systems we have seen a plethora\nof studies of quench dynamics [1, 2], thermalization [3, 4],\nand transport [5], and also dynamical studies of crossing\nin a finite time quantum critical points in the spirit of the\nKibble-Zurek mechanism [6, 7]. On the other hand, systems of cold atoms can be driven by external (light) fields\nand coupled to dissipative baths, thus realizing driven\nopen quantum systems. As familiar e.g. from the quantum optics of the laser, the steady state of such a system\n(if it exists) is characterized by a dynamical equilibrium\nbetween pumping and dissipation, and can exhibit various nonequilibrium phases and phase transitions [8, 9] as\nfunction of external control parameters. In the present\nwork we will study such scenarios for quantum degenerate gases. Our emphasis is on understanding quantum\nphases and dynamical phase transitions of cold atoms as\nan interacting many-body condensed matter system far\nfrom equilibrium.\nFor a many-body system in thermodynamic equilibrium the competition of two noncommuting parts of a\nmicroscopic Hamiltonian H = H1 + gH2 manifests itself as a quantum phase transition (QPT), if the ground\nstates for g \u001c gc and g \u001d gc have different symmetries [10]. For temperature T = 0 the critical value gc\nthen separates two distinct quantum phases, while for finite temperature this defines a quantum critical region\naround gc in a T vs. g phase diagram. A seminal example in the context of cold atoms in optical lattices\nis the superfluid–Mott insulator transition in the BoseHubbard (BH) model, with Hamiltonian\nX †\nX\nX\nH = −J\nb` b`0 − μ\nn̂` + 12 U\nn̂` (n̂` − 1) , (1)\nh`,`0 i\n\n`\n\n`\n\nwith b` bosonic operators annihilating a particle on site\n\n`, n̂` = b†` b` number operators, J the hopping amplitude,\nand U the onsite interaction strength. For a given chemical potential μ, chosen to fix a mean particle density n,\nthe critical coupling strength gc = (U/Jz)c separates a\nsuperfluid Jz \u001d U from a Mott insulator regime Jz \u001c U\n(z the lattice coordination number).\nIn contrast, we consider a nonequilibrium situation in\nwhich the competition of microscopic quantum mechanical operators results from an interplay of unitary (Hamiltonian) and dissipative (Liouvillian) dynamics. We study\na cold atom evolution described by a master equation for\nthe many-body density operator\n∂t ρ = −i[H, ρ] + L[ρ] ,\n(2)\n\u0011\n1 X\u0010\n†\n†\n†\nL[ρ] = κ\n2c``0 ρc``0 − c``0 c``0 ρ − ρc``0 c``0 ,\n2\n0\nh`,` i\n\nwhere c``0 = (b†` + b†`0 )(b` − b`0 ) are Lindblad \"jump\noperators\" acting on adjacent sites h`, `0 i. The energy\nscale κ is the dissipative rate. As shown in [11], such\ndissipative reservoir couplings are obtained in a setup\nwhere laser driven atoms are coupled to a phonon bath\nprovided by a second condensate. For no interaction\nU = 0 this dissipation drives the system to a dynamical equilibrium independent of the initial state [11] given\nby the pure many body state ρss = |BECihBEC| representing a Bose Einstein condensate. From an atomic\nphysics point of view this is remarkable, as typical decoherence mechanisms, such as spontaneous emission acting locally on lattice sites, will destroy long range order, whereas here the bath coupling is engineered to suppress phase fluctuations. This can be easily understood\nin momentum\nspace, where the annihilation part of c``0\nP\nreads λ (1 − exp(iqλ a))bq , with λ the reciprocal lattice\ndirections and a the lattice constant. c``0 thus feature\na (unique) dissipative zero mode at q = 0 – a manyN\nbody \"dark state\" |BECi ∼ b†q=0\n|vaci decoupled from\nthe bath, into which the system is consequently driven\nfor long wait times. The dynamics behind Eq. (3) can\n\n\f2\nthus be understood as a \"dark state laser cooling\" [12]\ninto a condensate, although in a many-body context.\n|BECi is also an eigenstate of kinetic energy. In\ncontrast, turning on an interaction measured by u =\nU/(4κz) provides a Hamiltonian term in (3) which is\nincompatible with kinetic energy and dissipation. This\ncompetition leads to novel dynamical equilibria which\ncannot be understood as thermodynamic equilibrium\nstates found from minimizing a free energy. They are\nsummarized in the steady state phase diagram in Fig.\n1. Most prominently, it features a strong coupling phase\ntransition as a function of u. A first hallmark of the\nnonequilibrium nature of the system is this: The transition shares features of a QPT in that it is interaction\ndriven, and of a classical phase transition in that the ordered phase terminates in a mixed state. This contrasts\ne.g. the well-known dissipation induced phase transition\nto a superconductor in Josephson junction arrays [13],\nin which detailed balance guarantees that the system's\nstate remains pure despite the suppression of phase fluctuations via the coupling to a zero temperature bath.\nFurthermore, we show the existence of a novel dynamical instability that covers an extensive domain of the\nphase diagram. Again, this is a nonequilibrium effect,\nsince in equilibrium, finite momentum excitations carry\npositive kinetic energy ruling out dynamical instabilities.\nIt persists at arbitrarily weak interaction parameters U n\ndue to its fluctuation induced nature elucidated below.\nThis is in marked contrast to the \"classical\" dynamical\ninstabilities of condensates in boosted lattices [14, 15] or\nin exciton-polariton systems [16], which are induced by\nexternal tuning of parameters beyond finite critical values.\nNonlinear mean field master equation.-To solve the\nmaster equation we developed a generalized Gutzwiller\napproach, expected to hold in sufficiently high spatial\ndimension, which allows to include density matrices corresponding to mixed\nNstates. This is implemented by a\nproduct ansatz ρ = ` ρ` , with the reduced local density\noperators ρ` = Tr6=` ρ. The equation of motion (EoM)\nreads\n∂t ρ` = −i[h` , ρ` ] + L` [ρ` ] ,\n(3)\nP\nwith the local Hamiltonian h` = −J h`0 |`i (hb`0 ib†` +\nhb†`0 ib` ) − μn̂` + 12 U n̂` (n̂` − 1) reproducing the standard form of the Gutzwiller mean field approximation and a Liouvillian of the form L` [ρ` ] =\nP\nP4\ns†\ns† r\ns† r\nr\nκ h`0 |`i r,s=1 Γrs\n`0 [2A` ρ` A` −A` A` ρ` −ρ` A` A` ]. The\nLiouvillian is constructed with the vector of operators\nA` = (1, b†` , b` , n̂` ) and the matrix of correlation functions\n(5−s)† (5−r)\nΓr,s\n= σ r σ s Tr` A`\nA`\nρ` , for σ = (−1, −1, 1, 1).\n`\nThe ρ-dependent correlation matrix makes the master\nequation nonlinear in ρ` .\nDynamical quantum phase transition.-At U = 0 a\nsteady state solution of Eq. (3) is given by the pure\n\nFIG. 1: (color online) Nonequilibrium phase diagram for the\nmodel in Eq. (3). The solid lines indicate the border of the\ndynamical quantum phase transition from a condensed to a\nhomogeneous thermal steady state. The dashed lines delimit\nthe region where the condensed state is stable with respect to\nspatial fluctuations. The black (blue) lines are the numerical\nresults corresponding to average density n = 1.0 (n = 0.1).\nThe red line corresponds to the analytical results for n = 0.1.\n\n(c)\n\nstate ρ` = |ΨihΨ| for any ` together with the choice\nμ = −Jz, where |Ψi is a coherent state of parameter\nneiθ for any phase θ [17]. In order to understand the\neffect of a finite interaction U , we apply the rotatingframe transformation V̂ (U ) = exp[iU n̂` (n̂` − 1)t] to\nEq. (3). This removes the interaction term from the\nunitary evolution,\nbut the annihilation operators become\nP\nV̂ b` V̂ −1 = m exp(imU t)|mi` hm|b` . The effect of a finite U is thus to rotate the phase of each Fock state\ndifferently, leading to dephasing of the coherent state\n(c)\nρ` . Hence, for strong enough U , off-diagonal order is\nsuppressed completely and the density matrix becomes\ndiagonal. In this case Eq. (3) reduces precisely to the\nmaster equation for a system of bosons coupled to a thermal reservoir with occupation n [17], whose solution is\na mixed diagonal thermal state ρ(t) . Interestingly, this\nstate is thermal-like; however the role of the thermal bath\nis played by the system itself, being provided by the mean\noccupation of neighbouring sites.\nWe substantiate the discussion above with the numerical integration of the EoM (3) for a homogeneous system\n(we drop the index `). The system is initially in the coherent state and the condensate fraction |ψ|2 /n, where\nψ = hbi, decreases in time depending on the value of the\ninteraction strength U . The result is a continuous transition from the coherent state ρ(c) to the thermal state\nρ(t) , shown in Fig. 2 for some typical parameters. The\nboundary between the thermal and the condensed phase\nwith varying J, n is shown in Fig. 1 with solid lines.\nThe transition is a smooth crossover for any finite time,\nbut for t → ∞ a sharp nonanalytic point indicating a\nsecond order phase transition develops. In the universal\nvicinity of the critical point, 1/κt may be viewed as an\nirrelevant coupling in the sense of the renormalization\n\n\f3\n\nFIG. 2: Stroboscopic plot of the time evolution of the condensate fraction as a function of the interaction strength U , for\nJ = 1.5 κ and n = 1. For large times it converges to the lower\nthick solid line. The critical point is Uc ' 4.5 κz. Inset: Near\ncritical evolution reflected by the logarithmic derivative of the\norder parameter ψ(t), for J = 0, n = 1, and U . Uc . The\nearly exponential decay (×) is followed by a scaling regime\n(◦) with exponent α ' 0.5. The final exponential runaway\n(+) is due to a small deviation from the critical point.\n\ngroup. We may use this attractive irrelevant direction to\nextract the critical exponent α for the order parameter\nfrom the scaling solution |ψ(t)| ∝ (κt)−α . In the inset\nof Fig. 2 we plot α(t) = d log(ψ)/d log(1/t) and read\noff the critical exponent α = 0.5 in the scaling regime,\nwhich is an expected result given the mean field nature\nof the Gutzwiller ansatz. We emphasize that following\nthe relaxation dynamics of the condensate fraction for\ncritical system parameters gives an experimental handle\nfor the measurement of α.\nLow-density limit.-In the low density limit n \u001c 1\nwe obtain an analytical understanding of the time evolution based on the observation that the six correlation\nfunctions ψ, hb2` i, hb†` b2` i, and complex conjugates, form a\nclosed (nonlinear) subset which decouples from the a priori infinite hierarchy of normal ordered correlation funcm\ntions hb†n\n` b` i. We first use this result to obtain analytically the critical exponent α discussed above. For a\nhomogeneous system with J = 0 the EoMs read\n∂t ψ = iμψ + (−iU + 4κ)hb† b2 i − 4κψ ∗ hb2 i ,\n∂t hb† b2 i = 8nκψ + (−iU + iμ − 8κ)hb† b2 i ,\n∂t hb2 i = (−iU + 2iμ − 8κ)hb2 i + 8κψ 2 .\n\n(4)\n\nThe structure of the equations suggest that hb2 i decays\nmuch faster than the other correlations for U = Uc , so\nthat we may take ∂t hb2 i = 0 and hence hb2 i ∝ ψ 2 . At the\ncritical point the two linear contributions to ∂t ψ vanish\ndue to the zero mass eigenvalue at\n√ criticality and ∂t ψ ∝\nκψ 2 ψ ∗ . It follows that |ψ| ' 1/(4 κt) in agreement with\nthe numerical result in Fig. 2.\nTo study the interaction induced depletion of the condensate fraction, it is convenient to use \"connected\" cor-\n\nrelation functions, built with the fluctuation operator\nδb = b − ψ0 . Here ψ0 is the constant value of the order parameter in the steady state, and hδbi = 0. From\n(4) we obtain a closed linear system of EoMs, if ψ0 is\nconsidered as a parameter, determined self-consistently\nfrom the identity n = hδb† δbi + |ψ0 |2 . The value of the\nchemical potential is fixed to remove the driving terms\nin the equations for hδbi, leading to μ = nU . This is an\nequilibrium condition similar to the vanishing of the mass\nof the Goldstone mode in a thermodynamic equilibrium\nsystem with spontaneous symmetry breaking. The solution of the equations in steady state yields the condensate\nfraction\n\u0001\n2u2 1 + (j + u)2\n|ψ0 |2\n= 1−\n,\nn\n1 + u2 + j(8u + 6j (1 + 2u2 ) + 24j 2 u + 8j 3 )\n(5)\nwith dimensionless variable j = J/(4κ). Eq. (5) reduces to the simple quadratic expression 1 − 2u2 in the\nlimit of zero\n√ hopping, with the critical point Uc (J =\n0) = 4κz/ 2. The phase boundary, obtained\np by setting ψ0 = 0 in Eq. (5), reads uc = j + 1/2 + 2j 2 .\nFig. 1 shows that these compact analytical results (solid\nred line) match the full numerics for small densities (solid\nblue line), and also explain the qualitative features of the\nphase boundary for large densities. We note the absence\nof distinct commensurability effects for e.g. n = 1, tied to\nthe fact that the interaction also plays the role of heating.\nDynamical instability.-Numerically integrating the\nfull EoM (3) with site-dependence (in one dimension for\nsimplicity), we observe a dynamical instability, manifesting itself at late times in a long wavelength density\nwave with growing amplitude. Numerical linearization of\nEq. (3) around the homogeneous steady state allows to\ndraw a phase border for the unstable phase (see Fig. 1).\nThe instability is cured by the increase of hopping J,\nwhich is associated to an operator compatible with dissipation κ. Furthermore, we note that the thermal state is\nalways dynamically stable against long wavelength perturbations.\nThe origin of this instability is intriguing and we\ndiscuss it analytically within the low-density limit\nintroduced above.\nWe linearize in time the EoM\n(3), writing the generic connected correlation function as hÔ` i(t) = hÔ` i0 + δhÔ` i(t), where hÔ` i0\nis evaluated on the homogeneous steady state of\nthe system. The EoM for the time and space dependent fluctuations is then Fourier transformed,\nresulting in a 7 × 7 matrix evolution equation\n∂t δΦq = M δΦq for the correlation functions Φq =\n(hδbiq ,hδb† iq , hδb† δbiq ,hδb2 iq ,hδb†2 iq , hδb† δb2 iq ,hδb†2 δbiq ).\nWe note that the fluctuation δhδbiq (δhδb† iq ) coincides\n∗\nwith the fluctuation of the order parameter δψq (δψ−q\n).\nThe full matrix M can be easily diagonalized numerically\nrevealing the spectrum in Fig. 3 (we display only the\nrelevant real part γ corresponding to damping). The\n\n\f4\n\nFIG. 3: Real (dissipative) part of the spectrum γq from the\nanalytical low density limit for J = 0, n = 0.1, and U = 1.0 κ.\nThe inset magnifies the parameter region with unstable modes\n(red solid line). The black solid line is the bare dissipative\nspectrum κq .\n\nlowest-lying branch gives γq < 0 in a small interval\naround the origin q = 0. This means that the correlation\nfunctions grow exponentially ∝ eγt in a range of low\nmomenta, resulting e.g. in a long wavelength density\nwave.\nDue to the scale separation for q → 0 in the matrix\nM apparent from Fig. 3, we can apply second order perturbation theory twice in a row to integrate out the fast\nmodes γ ∝ κ and ∝ κn. We then obtain an effective low\nenergy EoM for the fluctuations of the order parameter\n∗\n(δψq , δψ−q\n), governed by a 2 × 2 matrix\n\u0012\n\u0013\nU n + \u000fq − iκq U n + 9unκq\nMeff =\n,\n(6)\n−U n − 9unκq −U n − \u000fq − iκq\nwhere \u000fq = Jq2 represents the kinetic contribution and\nκq = 2(2n + 1)κq2 is the bare dissipative spectrum. The\nform of the EoM reflects the structure of the spatial fluctuations which are included in our approach, that may be\nunderstood as scattering off the mean fields in opposite\ndirections. We note that a naive a priori restriction to\nthe 2×2 set corresponding to the subset (δψ` , δψ`∗ ) would\nbe inconsistent, for example destroying the dark state\nproperty present in the correct solution Meff . On the\nother hand, factorizing the correlation functions in the\nLiouvillian L` yields a dissipative Gross-Pitaevski equation but its linearization in time produces a matrix Meff\nwithout the fluctuation induced term ∼ u and fails to\ndescribe the dynamical instability. Thus, in order to correctly capture the physics of the instability at long wavelength q → 0, the onsite quantum correlations renormalizing Meff have to be properly taken into account.\nWe can make the nature of the instability even more\ntransparent from calculating the lowest eigenvalue of\n\nM\npeff , γq ' ic|q| + κq , with speed of sound c =\n2U n[J − 9U n/(2z)]. If the hopping amplitude is\nsmaller than the critical value Jc = 9U n/(2z) the speed\nof sound turns imaginary and contributes to the dissipative real part of γq . The nonanalytic renormalization\ncontribution ∼ |q| always dominates the bare quadratic\npiece for low momenta, explaining the shape in the inset\nof Fig. 3 and rendering the system unstable. The linear\nslope of the stability border for small J and U is clearly\nvisible from the numerical results in Fig. 1. In summary,\nthe origin of the instability is traced back to a subtle\nrenormalization effect of the speed of sound at low energies, which in turn is due to an interplay of short time\nquantum and long wavelength classical fluctuations.\nConclusion.-We have discussed the steady state phase\ndiagram resulting from a competition of unitary BoseHubbard and dissipative dynamics with dark state. The\nfeatures found in the present model are expected to be\ngeneric and representative for a whole class of nonequilibrium models discussed recently in the context of reservoir engineering and dissipative preparation of given long\nrange ordered entangled states of qubits or spins on a\nlattice [18, 19] and paired fermions [11, 20]. In particular, we emphasize the importance of a compatible energy\nterm for the achievement of stability of driven-dissipative\nmany-body systems in future experiments.\nWe thank M. Hayn, A. Pelster, S. Kehrein, M. Möckel,\nand J. V. Porto for interesting discussions. This work was\nsupported by the Austrian Science Foundation through\nSFB FOQUS, SCALA and by EU Networks.\n\n[1] P. Calabrese and J. Cardy, Phys. Rev. Lett. 96, 136801\n(2006); C. Kollath, A. M. Läuchli, and E. Altman, ibid.\n98, 180601 (2007); A. Silva, ibid. 101, 120603 (2008); M.\nMöckel and S. Kehrein, ibid. 100, 175702 (2008).\n[2] M. Greiner, O. Mandel, T.W. Hänsch, and I. Bloch, Nature 419, 51 (2002); B. Paredes et al., ibid. 429, 277\n(2004); L.E. Sadler et al., ibid. 443, 312 (2006).\n[3] M. Cramer, C.M. Dawson, J. Eisert, and T.J. Osborne,\nPhys. Rev. Lett. 100, 030602 (2008); M. Rigol, V. Dunjko, and M. Olshanii, Nature 452, 854 (2008); G. Roux,\nPhys. Rev. A 79, 021608(R) (2009); L.C. Venuti and P.\nZanardi, arXiv:0912.3357.\n[4] T. Kinoshita, T. Wenger, and D.S. Weiss, Nature 440,\n900 (2006); S. Hofferberth et al., Nature Phys. 4, 489\n(2008).\n[5] S. Montangero, R. Fazio, P. Zoller, and G. Pupillo, Phys.\nRev. A 79, 041602(R) (2009); J. Schachenmayer, G.\nPupillo, and A.J. Daley, New J. Phys. 12, 025014 (2010).\n[6] K. Sengupta, S. Powell, and S. Sachdev, Phys. Rev. A\n69, 053616 (2004); W.H. Zurek, U. Dorner, and P. Zoller,\nPhys. Rev. Lett. 95, 105701 (2005); T. Prosen and I. Pizorn, ibid. 101, 105701 (2008); C. De Grandi, V. Gritsev\nand A. Polkovnikov, arXiv:0909.5181; R.A. Barankov,\narXiv:0910.0255.\n[7] C.N. Weiler et al., Nature 455, 948 (2008).\n\n\f5\n[8] S.A. Moskalenko and D.W. Snoke, Bose-Einstein Condensation of Excitons and Biexcitons, Cambridge Univ.\nPress, Cambridge (2000); J. Keeling, F.M. Marchetti,\nM.H. Szymanska, and P.B. Littlewood, Semicond. Sci.\nTechnol. 22, R1 (2007).\n[9] E.G. Dalla Torre, E. Demler, T. Giamarchi, and E. Altman, arXiv:0908.0868.\n[10] S. Sachdev, Quantum Phase Transitions, Cambridge\nUniv. Press, Cambridge (1999).\n[11] S. Diehl et al., Nature Phys. 4, 1073 (2008); B. Kraus et\nal., Phys. Rev. A 78, 042307 (2008).\n[12] A. Aspect et al., Phys. Rev. Lett. 61, 826 (1988); M.\nKasevich and S. Chu, ibid. 69, 1741 (1992).\n[13] A. Schmid, Phys. Rev. Lett. 51, 1506 (1983); S.\nChakravarty, G.-L. Ingold, S. Kivelson, and A. Luther,\nibid. 56, 2303 (1986); A. Kampf and G. Schön, Phys. Rev.\nB 36, 3651 (1987); S. Chakravarty, S. Kivelson, G.T. Zimanyi, and B.I. Halperin, ibid. 35, 7256 (1987); R. Fazio\nand H. van der Zant, Phys. Rep. 355, 235 (2001).\n\n[14] B. Wu and Q. Niu, Phys. Rev. A 64, 061603(R) (2001);\nA. Smerzi, A. Trombettoni, P.G. Kevrekidis, and A.R.\nBishop, Phys. Rev. Lett. 89, 170402 (2002); E. Altman\net al., ibid. 95, 020402 (2005); A. Polkovnikov et al.,\nPhys. Rev. A 71, 063613 (2005).\n[15] S. Burger et al., Phys. Rev. Lett. 86, 4447 (2001); M.\nCristiani et al., Optics Express 12, 4 (2004); J. Mun et\nal., Phys. Rev. Lett. 99, 150604 (2007).\n[16] J. Kasprzak et al., Nature 443, 409 (2006); M. Wouters\nand I. Carusotto, arXiv:1001.0660.\n[17] C.W. Gardiner and P. Zoller, Quantum Noise , SpringerVerlag, Berlin (1999).\n[18] F. Verstraete, M.M. Wolf, and J.I. Cirac, Nature Phys.\n5, 633 (2009).\n[19] H. Weimer et al., Nature Phys., doi:10.1038/nphys1614\n(2010).\n[20] S. Diehl, W. Yi, A. J. Daley, P. Zoller, arXiv:1007.3420\n(2010).\n\n\f"}