{"id": "http://arxiv.org/abs/1205.1059v1", "guidislink": true, "updated": "2012-05-04T20:00:00Z", "updated_parsed": [2012, 5, 4, 20, 0, 0, 4, 125, 0], "published": "2012-05-04T20:00:00Z", "published_parsed": [2012, 5, 4, 20, 0, 0, 4, 125, 0], "title": "Chaotic exchange of solid material between planetary systems:\n  implications for lithopanspermia", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1205.4168%2C1205.3449%2C1205.0369%2C1205.0921%2C1205.1823%2C1205.2450%2C1205.4035%2C1205.2378%2C1205.0380%2C1205.1767%2C1205.2658%2C1205.0875%2C1205.2147%2C1205.4040%2C1205.1985%2C1205.0975%2C1205.4163%2C1205.3682%2C1205.1580%2C1205.0405%2C1205.2029%2C1205.3304%2C1205.1536%2C1205.3659%2C1205.1686%2C1205.4427%2C1205.0893%2C1205.0208%2C1205.1059%2C1205.2784%2C1205.3686%2C1205.2447%2C1205.2269%2C1205.3822%2C1205.2528%2C1205.1980%2C1205.2704%2C1205.4133%2C1205.1594%2C1205.4420%2C1205.0839%2C1205.3353%2C1205.1114%2C1205.1106%2C1205.0699%2C1205.0018%2C1205.1694%2C1205.3524%2C1205.3645%2C1205.0942%2C1205.0010%2C1205.0720%2C1205.0785%2C1205.3072%2C1205.3445%2C1205.1527%2C1205.1953%2C1205.0571%2C1205.3172%2C1205.0607%2C1205.0331%2C1205.3239%2C1205.3578%2C1205.0112%2C1205.4333%2C1205.0370%2C1205.1501%2C1205.0291%2C1205.0583%2C1205.1993%2C1205.1966%2C1205.3373%2C1205.2480%2C1205.2189%2C1205.4324%2C1205.1560%2C1205.4403%2C1205.0745%2C1205.3936%2C1205.0318%2C1205.4127%2C1205.1739%2C1205.2653%2C1205.3858%2C1205.3918%2C1205.0164%2C1205.1323%2C1205.3040%2C1205.1084%2C1205.4195%2C1205.2374%2C1205.1826%2C1205.2020%2C1205.0308%2C1205.2611%2C1205.3799%2C1205.2917%2C1205.2769%2C1205.3947%2C1205.3455%2C1205.2703&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Chaotic exchange of solid material between planetary systems:\n  implications for lithopanspermia"}, "summary": "We examine a low energy mechanism for the transfer of meteoroids between two\nplanetary systems embedded in a star cluster using quasi-parabolic orbits of\nminimal energy. Using Monte Carlo simulations, we find that the exchange of\nmeteoroids could have been significantly more efficient than previously\nestimated. Our study is relevant to astrobiology as it addresses whether life\non Earth could have been transferred to other planetary systems in the solar\nsystem's birth cluster and whether life on Earth could have been transferred\nhere from beyond the solar system. In the solar system, the timescale over\nwhich solid material was delivered to the region from where it could be\ntransferred via this mechanism likely extended to several hundred million years\n(as indicated by the 3.8-4.0 Ga epoch of the Late Heavy Bombardment). This\ntimescale could have overlapped with the lifetime of the Solar birth cluster\n(~100-500 Myr). Therefore, we conclude that lithopanspermia is an open\npossibility if life had an early start. Adopting parameters from the minimum\nmass solar nebula, considering a range of planetesimal size distributions\nderived from observations of asteroids and Kuiper Belt Objects and theoretical\ncoagulation models, and taking into account Oort Cloud formation models, the\nexpected number of bodies with mass > 10 kg that could have been transferred\nbetween the Sun and its nearest cluster neighbor could be of the order of\n1E14-3E16, with transfer timescales of 10s Myr. We estimate that of the order\nof 3E8 x l(km) could potentially be life-bearing, where l(km) is the depth of\nthe Earth crust in km that was ejected as the result of the early bombardment.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1205.4168%2C1205.3449%2C1205.0369%2C1205.0921%2C1205.1823%2C1205.2450%2C1205.4035%2C1205.2378%2C1205.0380%2C1205.1767%2C1205.2658%2C1205.0875%2C1205.2147%2C1205.4040%2C1205.1985%2C1205.0975%2C1205.4163%2C1205.3682%2C1205.1580%2C1205.0405%2C1205.2029%2C1205.3304%2C1205.1536%2C1205.3659%2C1205.1686%2C1205.4427%2C1205.0893%2C1205.0208%2C1205.1059%2C1205.2784%2C1205.3686%2C1205.2447%2C1205.2269%2C1205.3822%2C1205.2528%2C1205.1980%2C1205.2704%2C1205.4133%2C1205.1594%2C1205.4420%2C1205.0839%2C1205.3353%2C1205.1114%2C1205.1106%2C1205.0699%2C1205.0018%2C1205.1694%2C1205.3524%2C1205.3645%2C1205.0942%2C1205.0010%2C1205.0720%2C1205.0785%2C1205.3072%2C1205.3445%2C1205.1527%2C1205.1953%2C1205.0571%2C1205.3172%2C1205.0607%2C1205.0331%2C1205.3239%2C1205.3578%2C1205.0112%2C1205.4333%2C1205.0370%2C1205.1501%2C1205.0291%2C1205.0583%2C1205.1993%2C1205.1966%2C1205.3373%2C1205.2480%2C1205.2189%2C1205.4324%2C1205.1560%2C1205.4403%2C1205.0745%2C1205.3936%2C1205.0318%2C1205.4127%2C1205.1739%2C1205.2653%2C1205.3858%2C1205.3918%2C1205.0164%2C1205.1323%2C1205.3040%2C1205.1084%2C1205.4195%2C1205.2374%2C1205.1826%2C1205.2020%2C1205.0308%2C1205.2611%2C1205.3799%2C1205.2917%2C1205.2769%2C1205.3947%2C1205.3455%2C1205.2703&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We examine a low energy mechanism for the transfer of meteoroids between two\nplanetary systems embedded in a star cluster using quasi-parabolic orbits of\nminimal energy. Using Monte Carlo simulations, we find that the exchange of\nmeteoroids could have been significantly more efficient than previously\nestimated. Our study is relevant to astrobiology as it addresses whether life\non Earth could have been transferred to other planetary systems in the solar\nsystem's birth cluster and whether life on Earth could have been transferred\nhere from beyond the solar system. In the solar system, the timescale over\nwhich solid material was delivered to the region from where it could be\ntransferred via this mechanism likely extended to several hundred million years\n(as indicated by the 3.8-4.0 Ga epoch of the Late Heavy Bombardment). This\ntimescale could have overlapped with the lifetime of the Solar birth cluster\n(~100-500 Myr). Therefore, we conclude that lithopanspermia is an open\npossibility if life had an early start. Adopting parameters from the minimum\nmass solar nebula, considering a range of planetesimal size distributions\nderived from observations of asteroids and Kuiper Belt Objects and theoretical\ncoagulation models, and taking into account Oort Cloud formation models, the\nexpected number of bodies with mass > 10 kg that could have been transferred\nbetween the Sun and its nearest cluster neighbor could be of the order of\n1E14-3E16, with transfer timescales of 10s Myr. We estimate that of the order\nof 3E8 x l(km) could potentially be life-bearing, where l(km) is the depth of\nthe Earth crust in km that was ejected as the result of the early bombardment."}, "authors": ["Edward Belbruno", "Amaya Moro-Martin", "Renu Malhotra", "Dmitry Savransky"], "author_detail": {"name": "Dmitry Savransky"}, "author": "Dmitry Savransky", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1089/ast.2012.0825", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1205.1059v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1205.1059v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Accepted by Astrobiology. Submitted: Sep. 21, 2011. Accepted: May 2,\n  2012. 39 pages. 21 figures. arXiv admin note: substantial text overlap with\n  arXiv:0808.3268", "arxiv_primary_category": {"term": "astro-ph.EP", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.EP", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1205.1059v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1205.1059v1", "journal_reference": null, "doi": "10.1089/ast.2012.0825", "fulltext": "Chaotic exchange of solid material between planetary systems:\nimplications for lithopanspermia\nEdward Belbrunoa,b , Amaya Moro-Martı́nc,b , Renu Malhotrad , Dmitry Savranskye,f\n\narXiv:1205.1059v1 [astro-ph.EP] 4 May 2012\n\nABSTRACT\nWe examine a low energy mechanism for the transfer of meteoroids between\ntwo planetary systems embedded in a star cluster using quasi-parabolic orbits of\nminimal energy. Using Monte Carlo simulations, we find that the exchange of\nmeteoroids could have been significantly more efficient than previously estimated.\nOur study is relevant to astrobiology as it addresses whether life on Earth could\nhave been transferred to other planetary systems in the solar system's birth\ncluster and whether life on Earth could have been transferred here from beyond\nthe solar system. In the solar system, the timescale over which solid material\nwas delivered to the region from where it could be transferred via this mechanism\nlikely extended to several hundred million years (as indicated by the 3.8-4.0 Ga\nepoch of the Late Heavy Bombardment). This timescale could have overlapped\nwith the lifetime of the Solar birth cluster (∼ 100–500 Myr). Therefore, we\nconclude that lithopanspermia is an open possibility if life had an early start.\nAdopting parameters from the minimum mass solar nebula, considering a range of\nplanetesimal size distributions derived from observations of asteroids and Kuiper\nBelt Objects and theoretical coagulation models, and taking into account Oort\nCloud formation models, the expected number of bodies with mass > 10 kg that\ncould have been transferred between the Sun and its nearest cluster neighbor\ncould be of the order of 1014 –3*1016 , with transfer timescales of 10s Myr. We\nestimate that of the order of 3 * 108 * l(km) could potentially be life-bearing,\nwhere l is the depth of the Earth crust in km that was ejected as the result of\nthe early bombardment.\na\n\nCourant Institute of Mathematical Sciences, New York University.\n\nb\n\nDepartment of Astrophysical Sciences, Princeton University.\n\nc\n\nCentro de Astrobiologı́a, INTA-CSIC, Spain.\n\nd\n\nDepartment of Planetary Sciences, University of Arizona.\n\ne\n\nMechanical and Aerospace Engineering, Princeton University.\n\nf\n\nLawrence Livermore National Laboratory.\n\n\f–2–\nSubject headings: Extrasolar Planets - Interplanetary Dust - Interstellar Meteorites - Lithopanspermia.\n\nAccepted by Astrobiology. Submitted: Sep. 21, 2011. Accepted: May 2, 2012.\nCorresponding author: Amaya Moro-Martı́n, Centro de Astrobiologı́a, INTA, Carretera a Ajalvir km.\n4, 28850 Torrejón de Ardoz, Madrid, Spain. Tel. +34 91 520 6420; fax: +34 91 520 1621; email:\namaya@cab.inta-csic.es.\n\n1.\n\nIntroduction\n\nFrom the collection of thousands of meteorites found on Earth, approximately one hundred have been\nidentified as having a Martian origin, and more than 46 kg of rocks have a lunar origin. The study of\nthe dynamical evolution of these meteorites agrees well with the cosmic ray exposure time and with their\nfrequency of landing on Earth. A handful of meteorites has also been identified on the Moon and Mars\n(e.g. McSween 1976; Schröder et al. 2008). These findings, together with dynamical simulations (Gladman,\n1997; Dones et al. 1999), indicate that meteorites are exchanged among the terrestrial planets of our solar\nsystem at a measurable level. Sufficiently large rocks may protect dormant microorganisms from ionizing\nradiation and from the hazards of the impact at landing. Laboratory experiments have confirmed that\nseveral microorganisms embedded in martian-like rocks could survive under shock pressures similar to those\nsuffered by martian meteorites upon impact ejection (Stöffler et al. 2007; Horneck et al. 2008). Other\nstudies have also shown that microorganisms in a liquid, bacteria and yeast spores can survive impacts with\nshock pressures of the order of GPas (Burchell et al. 2004; Willis et al. 2006; Hazell et al., 2010; Meyer et al.\n2011). Therefore, it is of interest to consider that the exchange of microorganisms living inside rocks could\ntake place among the solar system planets, a phenomenon known as lithopanspermia. Under this scenario,\nlife on Earth could potentially spread to other moons and planets within our solar system; conversely life on\nEarth could have an origin elsewhere in our solar system.\nMelosh (2003) investigated quantitatively the probability of transfer taking place between the stars\nin the solar local neighborhood. He found that even though numerical simulations show that up to onethird of all the meteorites originating from the terrestrial planets are ejected out of the solar system by\ngravitational encounters with Jupiter and Saturn, the probability of landing on a terrestrial planet of a\nneighboring planetary system is extremely low because of the high relative velocities of the stars and the low\nstellar densities: after the heavy bombardment, he estimates that only one or two rocks originating from the\nsurface of one of the terrestrial planets may have been temporarily captured into another planetary system,\nwith a 10−4 probability of landing in a terrestrial planet. Therefore, he concluded that lithopanspermia\namong the current solar neighbors is \"overwhelmingly unlikely\".\nIn a subsequent paper, Adams & Spergel (2005) pointed out that the majority of stars, including the\nSun, are born in stellar clusters where the probability of transfer would be higher due the larger stellar\ndensities and smaller relative velocities compared to those for field stars (including the current solar neighborhood). The dispersal time of the clusters and timescale for planet formation are comparable: the former\nis approximately T = 2.3(Mcluster /M )0.6 Myr = (135–535) Myr (for a cluster of 1000–10000 members -\n\n\f–3–\nAdams 2010), while the latter is of order 100 Myr for terrestrial planets. Therefore, it could be possible that\nrocky material be transferred before the cluster disperses. Adam & Spergel (2005) estimated the probability\nof transfer of meteoroids between planetary systems within a cluster by using Monte Carlo simulations.\nTo increase the capture cross-section they assumed that the stars are in binary systems. They found that\nclusters of 30–1000 members could experience O(109 )–O(1012 ) capture events among their binary members.\nAdopting typical ejection speeds of ∼5 km/s, and the number of rocky ejecta (of mass > 10 kg) per system\nof NR ∼ 1016 , they found that the expected number of successful lithopanspermia events per cluster is ∼\n10−3 ; for lower ejection speeds, ∼ 2 km/s, this number is 1–2. These latter estimates are relevant to the\nexchange of biologically active material. Valtonen et al. (2009) have also studied the exchange of solids\nbetween stars in the solar birth cluster and its enhanced capture probability compared to the exchange of\nsolids between field stars. They concluded that approximately 102±2 bodies with sizes larger than ∼ 20 cm\nmay have been exchanged between the cluster stars (compared to 10−8 between field stars).\nBecause there is a significant increase in the number of possible transfer events with decreased ejection\nvelocity, it is of interest to study a very low energy mechanism with velocities significantly smaller than\nthose considered in Adams & Spergel (2005). This mechanism was described by Belbruno (2004) in the\nmathematical context of a class of nearly parabolic trajectories in the restricted three-body problem. The\nescape velocities of these parabolic-type trajectories are very low (∼ 0.1 km/s), substantially smaller than\nthe mean relative velocity of stars in the cluster, and the meteoroid escapes the planetary system by slowly\nmeandering away. This process of \"weak escape\" is chaotic in nature. Weak escape is a transitional motion\nbetween capture and escape. For it to occur, the trajectory of the meteoroid must pass near the largest\nplanet in the system. \"Weak capture\" is the reverse process, when a meteoroid can get captured with low\nvelocity by another planetary system. The fact that the escape velocities of the meteoroids we consider\nhere are small significantly enhances the probability that a meteoroid can be weakly captured by another\nplanetary system, due to the lower approach velocity to the neighboring stars.\nThis paper studies the slow chaotic transfer of solid meteoroids between planetary systems within a star\ncluster, focussing on the transfer probabilities which are a critical factor in the assessment of the possibility of\nlithopanspermia. We consider the observed size distributions of asteroids and Kuiper belt objects as well as\nvelocity distributions of solar system ejecta from dynamical simulations, to estimate the number of very low\nvelocity ejecta, and thereby estimate the number of weak transfer events in the solar birth cluster. Section\n2 describes the model for minimal energy transfer of meteoroids between two stars in the cluster, where\nthe transfer takes places between two \"chaotic layers\" around each star; these chaotic layers are created by\nthe gravitational perturbations from the most massive planet in the planetary system and from the rest of\nthe cluster stars. We refer to this transfer mechanism as \"weak transfer\". Section 3 describes the location\nof these chaotic layers and uses geometrical considerations to obtain an order-of-magnitude estimate of the\nprobability that meteoroids that have weakly escaped a star are weakly captured by its nearest neighbor in\nthe cluster. The latter calculation is refined in Section 4 using Monte Carlo simulations. Section 5 calculates\nthe number of weak transfer events between the young solar system and the nearest star in the cluster;\nwe explore two cases, where the target star is a solar-type and a low-mass star. Finally, in Section 6 we\nsummarize our results and discuss the implications for lithopanspermia.\n\n\f–4–\n2.\n\nMinimal energy transfer of solid material within a star cluster\n\nIn this section, we first introduce the concepts of weak capture and weak escape (see Belbruno 2004,\n2007, 2010 for a detailed discussion) and then describe a model of how to construct a minimal energy transfer\nof solid material within a star cluster via weak transfer.\n\n2.1.\n\nGeneral planetary system model\n\nConsider a general planetary system (S) consisting of a central star (P1 ) and a system of N planets\n(Pi , i = 2, ..., N , with N ≥ 3) on co-planar orbits that are approximately circular, where the labeling is not\nreflective of the relative distances from P1 . Assume that the mass of the star (m1 ) is much larger than the\nmasses of any of the planets (mi , i.e. m1 \u001d mi , for i = 2, ..., N ) and that the mass of one of the planets\n(P2 ) is much larger than the masses of all the other planets (i.e. m2 \u001d mi , for i = 3, ..., N – this condition\nis fulfilled in the case of our solar system where P2 is Jupiter). A meteoroid (P0 ) is considered to have a\nnegligible mass (m0 = 0) with respect to the mass of any of the planets and therefore does not gravitationally\nperturb the circular orbit of P2 . Without loss of generality, we view S to consist of P1 and the planet P2 ,\nmoving around P1 in a circular orbit of radius ∆ < 500 AU. The motion of P0 within this system is the\nclassical three-dimensional restricted three-body problem, hereafter RP 3D. If P0 is constrained to move\nin the plane of motion of P2 and P1 , we have the planar circular restricted three-body problem, hereafter\nRP 2D. The differential equations for RP 3D are well known (see Belbruno 2004).\nBecause we are interested in the possibility of lithopanspermia to and from the solar system, in this\npaper we have assumed that P2 is a Jupiter-mass planet. However, recent observational results by the Kepler\nmission indicate that planetary systems with several Neptune-mass planets maybe more common (Batalha\net al., in prep.). The weak transfer mechanism described in this paper could also be applied in this latter\ncase and in some regards enhanced. We leave the study of these cases for future work.\n\n2.2.\n\nWeak capture and weak escape\n\nA convenient way to define the capture of P0 with respect to P1 or P2 in RP 3D is by using the concept\nof \"ballistic capture\". The two-body Kepler energy (Ek ) of P0 with respect to one of the bodies Pk (k = 1, 2)\nis\n\nEk =\n\n1 2 mk\nv −\n,\n2 k\nrk\n\n(1)\n\nwhere vk is the velocity magnitude of P0 relative to Pk and rk is the distance of P0 from Pk . The Kepler\nenergy is a function of the trajectory, Ek (φ(t)), where φ(t) = (r(t), v(t)) is the solution of RP 3D for the\ntrajectory of P0 in inertial coordinates, t is time, r = (r1 , r2 , r3 ) is the position vector from the center of the\ninertial coordinate system to P0 and v = (v1 , v2 , v3 ) is the velocity vector of P0 . Ballistic capture takes place\nwhen Ek < 0, while ballistic escape occurs at the transition from Ek = 0 and Ek > 0. We are interested when\nP0 changes from hyperbolic motion with respect to P2 to ballistic capture. These trajectories are referred to\nas \"weak capture\" and Belbruno (2004, 2010) showed they are generally unstable and chaotic. The region\n\n\f–5–\naround P2 where weak capture occurs in position-velocity space is called a weak stability boundary (WSBg ).\nThis region around P2 (W SB(P2 )) results from the gravitational perturbation of P1 . It can be viewed as a\nlocation where a particle is tenuously and temporarily captured by P2 : the particle will first move around P2\nfor a short time with negative Kepler energy that approaches zero and then increasing above zero yielding to\nhyperbolic escape. Ballistic escape from P2 is referred to as \"weak escape\" because it occurs near W SB(P2 ).\nAs is evident by numerical integration of P0 around P2 , weak capture generally occurs for relatively\n2\nshort time spans. For example, in the case of the Earth-Moon system (where μ = m1m+m\n= 0.012), weak\n2\ncapture around the Moon occurs for time spans of days or weeks; in the case of the Sun-Jupiter system, the\ntimescale would be months to a few years (Belbruno & Marsden, 1997; Belbruno, 2007).\nIn our solar system, the existence of the weak stability boundary and the viability of weak capture was\ndemonstrated by the Japanese spacecraft Hiten: using a trajectory designed by Belbruno (1993, 2007), Hiten\nwas captured into an orbit around the Moon in 1991 without the use of rockets to slow down. Weak capture\nat the Moon was also achieved in 2004 by the ESA spacecraft SMART1 (Racca, 2003; Belbruno, 2007). In\nanother application, weak escape from the Earth's L4 (or L5 ) Lagrange point was invoked to suggest a low\nenergy transfer to the Earth for the hypothetical Mars-sized impactor that is thought to have triggered the\n\"giant impact\" origin of the Moon (Belbruno & Gott, 2005).\n\n2.3.\n\nParabolic motion and low velocity escape from S\n\nIn the absence of P2 in the RP 2D, a parabolic orbit Q(t) for P0 around P1 is a planar two-body Keplerian parabolic trajectory. When P2 is considered, there is a \"chaotic layer\" in Q-space near the parabolic\ntrajectory that consists of infinitely many parabolic and near-parabolic trajectories (Xia, 1992; Belbruno,\n2004). This layer has a positive measure and a two-dimensional transversal slice in four-dimensional position\nand velocity space yields a fractal structure. This layer is obtained when a parabolic trajectory is approximately at its periapsis with respect to P1 , and where it also has an approximate periapsis passage with\nrespect to P2 , slightly beyond P2 (i.e. at a radial distance from P1 slightly larger than ∆). The periapsis\npassage near P2 is done in such a way so that P0 is slightly hyperbolic with respect to P2 (approximately\nin W SB(P2 )). This imparts a small gravity assist to P0 . In this case, there are infinitely many possible\ntrajectories near the original parabolic trajectory, some which do not move out infinitely far from P1 and\neventually fall back towards P1 for another possible flyby of P2 . Other near-parabolic trajectories will escape\nP1 on hyperbolic trajectories with respect to P1 with a positive escape velocity, σ. Because these hyperbolic trajectories lie near parabolic trajectories, σ will be small. We refer to these as \"low velocity escape\ntrajectories\" or \"minimal energy escape trajectories\". Within the chaotic layer mentioned above exist infinitely many parabolic trajectories that hyperbolically escape P1 with small escape velocity σ. The q\ndistance\n\n1\nR = Resc (m1 ) from P1 at which P0 achieves this escape velocity can be obtained by the formula σ = 2Gm\nR ,\nwhere G is the gravitational constant. The fact that these escape trajectories are nearly parabolic and have\nvery small escape velocities implies that their Kepler energy with respect to P1 is nearly zero, for sufficiently\n\ng\n\nA detailed mathematical explanation of the WSB can be found in Belbruno et al (2010) and Garcı́a &\nGómez (2007). They showed that the weak capture boundary is a complicated region that has a fractional\ndimension and that is equivalent to a Cantor set. The WSB region can be viewed as a limit set of the stable\nmanifolds to the Lyapunov orbits associated to the collinear Lagrange points L1 , L2 of P2 .\n\n\f–6–\nlarge R.\nIn summary, in the circular restricted three-body problem (P0 , P1 , P2 ), there is a chaotic layer that\nreplaces the regular parabolic trajectories of the two-body problem (P0 , P1 ); weak transfer can take place in\nthis chaotic layer because this set of trajectories have low escape velocities.\n\n2.4.\n\nModel for the minimal energy transfer of solid material within a cluster\n\nTo achieve a minimal energy transfer of the meteoroid P0 from S to another system S ∗ , consider that\nthe system S is embedded in a star cluster; this will introduce additional gravitational perturbations on P0\nwhich will interact with the gravitational field of P1 and form a weak stability boundary around P1 where the\nmotion of P0 will be chaotic. Because the transfer mechanism requires low relative velocities, we consider an\nopen star cluster with a low velocity dispersion, with relative stellar velocities U ≈ 1 km/s (for comparison,\nolder globular clusters have stellar velocity dispersions of several tens of km/s - Binney & Tremaine 1988,\nMeylan & Heggie 1997). After the cluster disperses, the relative distances and relative velocities between\na star and its closet neighbors increase significantly. For example, the Sun's current closest neighbor αCentauri (not necessarily a cluster sibling) is now 2.6 * 105 AU away (4.28 pc) moving with a relative velocity\nof 6 km/s. The latter is significantly higher than the ∼ 1 km/s required for the weak transfer mechanism.\nIn this paper we consider the transfer of solid material between stars in a cluster before the cluster starts to\ndisperse.\nImagine that P0 makes a minimal energy escape from P1 in the P1 , P2 orbital plane by making a slightly\nhyperbolic flyby of P2 at W SB(P2 ) (where the latter is the weak stability boundary around P2 created by\nthe gravitational perturbation of P1 ); P0 moves away from P1 with a escape velocity σ near zero. P0 then\ngets to W SB(P1 ), the weak stability boundary of P1 caused by the gravitational perturbation of the other\nN − 1 stars in the cluster (where CSN−1 represents this set of N-1 stars, {P2 , P3 , ..., PN }); this boundary is\nlocated at a distance Resc (m1 ) from P1 , at which the combined gravitational force of the stars in the cluster\nis comparable to the gravitational force of P1 . As described previously, the motion in this region is chaotic\nand lies in the transition between capture and escape from P1 h . Although W SB(P1 ) is a complicated fractal\nset, non-spherical in shape, the sphere of radius Resc (m1 ) around the central star lies approximately in the\npart of W SB(P1 ) where the motion is least stable and the trajectories are slightly hyperbolic with respect to\nP1 (Belbruno et al. 2010; Garcı́a & Gómez, 2007) . We refer to trajectories that escape P1 from W SB(P1 )\nas \"weak escape\" trajectories (note that low-velocity escape does not imply weak escape unless it occurs at\na weak stability boundary). The structure of the set of near-parabolic trajectories that escape P1 by flyby\n\nh\n\nThe sensitivity of the motion of P0 at the distance R can be deduced from an analogous four-body\nproblem described in Belbruno (2004) and Marsden & Ross (2006) for a transfer to the Moon used by the\nspacecraft Hiten. In this case, the four bodies are the Earth (P1 ), Moon (P2 ), spacecraft (P0 ), and the\nSun, analogous to CSN−1 . The spacecraft leaves the Earth, flys by the Moon, where the flyby is weakly\nhyperbolic, and then travels out to roughly 1.5*106 km where the gravitational force of the Sun acting on\nthe spacecraft approximately balances that of the Earth. At this location, the motion of the spacecraft is\nhighly sensitive to small differences in velocity and lies between capture and escape from the Earth, i.e. lies\nat the weak stability boundary between the Earth and Sun. The motion of P0 in this region is chaotic and\nthe path of P0 can be altered using a very small amount of fuel.\n\n\f–7–\nof P2 yield infinitely many such trajectories. In particular, this implies that for any point p on the circle of\nradius Resc (m1 ) around P1 , there is a nearly parabolic trajectory that will pass by p with velocity σ, weakly\nescaping P1 . This is illustrated in Figure 1 (see also Figure 1 in Moro-Martı́n & Malhotra, 2005).\nWe now compute the trajectory of P0 from the distance W SB(P1 ) until it encounters another planetary\nsystem S ∗ centered on star P1∗ of mass m∗1 . This is done by using a different set of differential equations;\nduring this motion the trajectory of P0 is relatively undisturbed. The meteoroid is then weakly captured\nat W SB(P1∗ ) at the distance R∗ = Rcap (m∗1 ) from P1∗ . Figure 1 gives a schematic representation of this\nprocess. After P0 is weakly captured at the distance Rcap (m∗1 ) from P1∗ , say at time t = T , it moves towards\nP1∗ for t > T . Analogous to system S, we assume that system S ∗ has a dominant planet P2∗ orbiting P1∗ in a\ncircular orbit at a radial distance ∆∗ . As t increases from T , P0 will move to a periapsis distance rp∗ from P1∗ ,\nwhere rp∗ can range from 0 (collision with P1∗ ) to Rcap (m∗1 ). However, unlike the escape of P0 from P1 , where\nP0 had a periapsis near the location of P2 and in the same orbital plane of P2 , the approach of P0 into the\nS ∗ system is three-dimensional and need not be restricted to lie in the P2∗ orbital plane, nor have a periapsis\nof P1∗ near P2∗ . The resulting motion of P0 for t > T will, in general, be complicated and a priori not known.\nThere is no way to predict if P0 will pass near or collide with P2∗ without doing numerical simulations that\nare outside the scope of this paper. For this reason, we conclude our search at t = T , when P0 is weakly\ncaptured at P1∗ , and calculate the probability of this weak capture to take place. An order-of-magnitude\nestimate of the weak capture probability is derived in Section 3 based on geometrical considerations, while\nin Section 4 we calculate the probability numerically using Monte Carlo simulations.\n\n3.\n\nOrder of magnitude estimate of the weak capture probability\n3.1.\n\nApproximate location of the weak stability boundary\n\nWe calculate Resc (m1 ) and Rcap (m∗1 ) as a function of the stellar mass. For weak escape to take place,\nthe velocity σ of the meteoroid at the distance Resc (m1 ) from the star P1 must be sufficiently small. Because\nwe are considering slow transfer within an open cluster with a characteristic dispersion velocity U ≈ 1 km/s,\nwe require that σ is significantly smaller than U , i.e. of the order of 0.1 km/s. This is much smaller than the\nnominal values of several km/s used by the Monte Carlo methods in Melosh (2003) and Adams & Spergel\n(2005).\nTo place the above choice for σ in context, we study the velocity distribution of weakly escaping test\nparticles from the solar system using a three-body problem between the Sun (P1 ), Jupiter (P2 ) and a massless\nparticle (P0 ). To be consistent with our framework, we model this using RP 2D, where the test particle moves\nin the same plane of motion as Jupiter, assumed to be in a circular orbit at 5 AU. The trajectory of the test\nparticle is numerically integrated by a standard Runge-Kutta scheme of order six and numerical accuracy of\n10−8 in the scaled coordinates. The initial conditions of the test particle is an elliptic trajectory very close to\nparabolic with periapsis distance rp =5 AU and apoapsis distance ra =40,000 AU. (Note that such orbits are\nnot dissimilar to those of known long period comets in the solar system.) For each numerical integration, we\nassume that Jupiter is at a random point in its orbit when the test particle starts from apoapsis at 40,000\nAU and falls towards P1 . We record the velocity of the test particle at the time it escapes with respect to the\nSun (i.e. when the Kepler energy with respect to the Sun is positive) after performing a sufficient number of\nJupiter fly-bys. Figure 2 shows the distribution of v∞ : out of 670 cases, 58% have v∞ ≤ 0.1 km/s and 79%\nhave v∞ ≤ 0.3 km/s. Based on these results, we will assume the velocity σ of the meteoroid at the distance\n\n\f–8–\nResc (m1 ) from the star to be in the range 0.1–0.3 km/s.\nFor a given σ, the location of the part of the weak stability boundary that gives the most unstable\nmotion is approximately given by the sphere of radius Resc (m1 ) = 2Gm1 /σ 2 , where m1 is the mass of the\nstar and σ is in the range 0.1–0.3 km/s (see Figure 3). Beyond this boundary, when P0 weakly escapes P1 ,\nwe assume that the meteoroid will move at a nearly constant velocity σ with respect to the star.\nSlow transfer to a neighboring planetary system enables the meteoroid to arrive at the distance Rcap (m∗1 )\n∗\nwith a relative velocity with respect\nq to the target star (P1 ) that is similar or smaller than its parabolic escape\n2Gm∗\n\nvelocity at that distance, σ ∗ = Rcap (m1∗ ) , where m∗1 is the mass of the target star; if its velocity is higher\n1\nthan σ ∗ , it will not be captured and will fly by. Since the relative velocity between stars in the cluster is\nU ≈ 1 km/s, the meteoroid that weakly escaped from star P1 moves toward the target star P1∗ with velocity\nU ± σ (see Figure 1). Because σ is small relative to U and can be neglected, the relative velocity of the\nmeteoroid with respect to the target star is ≈ U . Therefore, weak capture can occur at the distance at\n2Gm∗\nwhich σ ∗ ≈ U ≈ 1 km/s, i.e. Rcap (m∗1 ) = U 2 1 . Figure 3 shows Resc (m1 ) and Rcap (m∗1 ) as a function\nof the stellar mass. The horizontal lines indicate the range of cluster sizes (dashed-dotted lines) and mean\ninterstellar distances (dotted lines) for clusters consisting of N = 100, 1000 and 4300 members respectively;\nclusters with this range of sizes are the birthplaces of a large fraction of stars in the Galaxy (Ladap\n& Lada\n2003). The radius of the cluster depends on the number of stars and is given by Rcluster = 1pc N/300\n(Adams 2010). For N=100, 1000 and 4300, we get that Rcluster is approximately 2.1 * 105 AU, 6.5 * 105 AU\nand 1.3 * 106 AU respectively. We can estimate the average interstellar distance within a cluster, D = n−1/3 ,\nwhere n = 4πR3N\nis the average number density of stars in the cluster. D is approximately 7*104 AU, 105\n3\ncluster\n\nAU and 1.2*105 AU, for a cluster with N=100, 1000 and 4300 members respectively. The choice of N =4300\nis explained in Section 4.2.\nIt is of interest to compare the results in Figure 3 to those in Melosh (2003). The latter considers the\nexchange of meteoroids between field stars using hyperbolic trajectories; it estimates a cross-section of 0.025\nAU2 for meteoroid capture by a planetary system with a Jupiter-mass planet located at 5 AU. Under the\nscenario considered in the present work, the order-of-magnitude estimate for the weak capture cross-section\n2\n; for a solar-mass star, Rcap ∼ 2*103 AU (Figure 3) so that the weak capture cross-section\nwould be π * Rcap\n7\n2\nis ∼ 10 AU (i.e. many order of magnitudes larger than Melosh 2003 estimate). This indicates that weak\nescape and capture within an open cluster can enhance drastically the probability of transfer. A recent\nstudy in which enhanced capture probability within a stellar cluster has been invoked is that of Levison\net al. (2010). They modeled the exchange of comets within a stellar cluster assuming that each star is\nsurrounded by a large disk of comets with q = 30 AU and a = 1000–5000 AU, and with a population similar\nto that of the Sun; they conclude that up to 90% of comets in the Oort Cloud may be have an extrasolar\norigin.\n\n3.2.\n\nConstraints on Stellar Masses for Weak Transfer\n\nFrom Figure 3, we can set constraints on the stellar mass m1 that could allow weak escape from P1 to\ntake place. The idea is simple: if for a given σ (within the range 0.1–0.3 km/s, see Section 3.1), we have that\nResc (m1 ) < D, i.e. the weak escape boundary is located within the distance of the next neighboring star\nP1∗ , then weak transfer is possible because at the time the meteoroid passes near the star P1∗ , its velocity is\nsimilar to the mean stellar velocity dispersion (U ∼ 1 km/s) and there is a significant probability of capture\n\n\f–9–\n(which we quantify in Section 3.3). Conversely, weak transfer by the process schematically represented in\nFigure 1 is much less likely to take place if Resc (m1 ) > D because at the time the meteoroid passes near\na neighboring star, its velocity is too high and, as a consequence, it will likely fly by. Figure 3 shows that\nfor σ = 0.1 km/s, the condition Resc (m1 ) < D for weak escape is satisfied for m1 < 0.4M , m1 < 0.57M\nand m1 < 0.68M , for clusters with N = 100, 1000 and 4300 members respectively. If we consider the\nhigher but still acceptable value σ = 0.3 km/s, Figure 3 shows that the stellar mass limits for weak escape\nare m1 < 3.5M , m1 < 5.1M and m1 < 6.1M , for clusters with N =100, 1000 and 4300 members\nrespectively. A meteoroid escaping nearly parabolically from any star with a mass larger than these limits\nwill achieve a velocity of σ < 0.1–0.3 km/s only at a distance larger than the mean interstellar distance in\nthe cluster; weak transfer is not likely to take place under such conditions.\nOf particular interest is the case of the solar system as the source of the meteoroids. It has been\nestimated that the Sun's birth cluster consisted of N=4300±2800 members (Adams 2010). For a 1M star\n5\nin such a cluster,\np we find that the parabolic escape velocity at the mean interstellar distance of D = 1.2*10\nAU is σ = 2Gm1 /D = 0.12 km/s. Because this values of σ lies within the range of values of interest\nfor weak escape, we conclude that the meteoroids originating in the early solar system could have met the\nconditions for weak escape in the Sun's birth cluster.\nWe have established the range of stellar masses that could in principle allow weak escape to take place.\nWe now estimate the probability of weak capture by a neighboring planetary system. Whether or not the\ntransfer of meteoroids from one star to any star of a given mass m∗1 takes place will depend on the relative\ncapture cross-section of the target star and on the number of potential targets. We discuss these factors\nbelow.\n\n3.3.\n\nRelative capture cross-section of the target star\n\nIn the case of weak transfer, assuming that the meteoroids escape isotropically from P1 , the relative\ncapture cross-section of the target star would be given by CS = Gf (Rcap (m∗1 )/D)2 , where D is the distance\nbetween the two stars, Rcap is the weak capture boundary (illustrated in Figure 1 and estimated in Figure\n3) and the factor Gf accounts for gravitational focussing. The assumption of isotropy is not justified in the\nframework of the restricted three-body problem, but it is expected in the presence of the cluster stars and of\nthe galactic potential that can isotropize the escaping meteoroids' orbits, in analogy with the isotropization\nof the Oort Cloud of comets (Dones et al. 2004).\nThe gravitational focussing factor is given by\n\nGf = 1 + (\n\nvesc 2\n) ,\nv∞\n\n(2)\n\nwhere v∞ is the velocity at infinity and vesc is the escape velocity at the distance Rcap (m∗1 ) from P1∗ . In\nthe case of weak capture, the term Gf increases the cross-section due to enhanced gravitational focussing.\nFor example, as we saw previously in the case of the Sun and Jupiter, v∞ ≈ 0.1 − 0.3 km/s, while at the\ndistance Rcap = 40000 AU we have that vesc ≈ 0.2 km/s. In this case we get that Gf ≈ 2, doubling the\ncapture cross-section. This situation occurs in our capture methodology. In the formulation for determining\nRcap (m∗1 ), the meteoroid has an approximate relative approach velocity to the target star P1∗ of roughly\nU = 1 km/s, which represents v∞ . However, Rcap is determined so that this same value of velocity is taken\n\n\f– 10 –\nfor vesc from the target star. That is, we are assuming v∞ ≈ vesc ≈ 1 km/s. This implies also that Gf = 2.\nThis is a conservative estimate and does not make use of the nature of weak capture dynamics. In fact, the\nvalue of Gf can be substantially increased, as we demonstrate below, if at a given value of Rcap (m∗1 ), v∞\nis smaller than the approximate value of U = 1 km/s, while vesc ≈ U ; in this case, v∞ → 0 which implies\nGf → ∞.\n\n3.4.\n\nNumber of potential targets\n\nWe denote PIMF (m∗1 ) as the probability of finding a star of mass m∗1 in the star cluster. This probability\nis referred to as the initial mass function (IMF) and it can be inferred from observations of stellar clusters. It\nis found that a wide range of clusters, varying from large clusters like the Trapezium to smaller clusters like\nTaurus, as well as older field stars, show very similar distributions of stellar masses down to the hydrogen\nburning limit at ∼ 0.1 M (Lada & Lada 2003 and references therein). The IMF can be characterized\nby the broken power-law, ξ(M) = ξ 1 M−2.2 for 0.6–100 M , and ξ(M) = ξ 2 M−1.1 for 0.1–0.6 M , where\nξ(M)dM is the number of stars with mass (M, M+dM). There is a steep decline into the substellar brown\ndwarf regime and a possible second peak but we will ignore objects below the hydrogen burning limit. The\nresulting average stellar mass is ∼0.88 M . To calculate PIMF (m∗1 ) (square symbols in Figure 4), we use a\nlogarithmic binning of masses with d(logM)=0.1 and normalize the distribution to unity, which gives ξ 1 =0.19\nand ξ 2 =0.34.\nAn upper limit to the probability that a meteoroid escaping from a star of mass m1 (within the range\ndescribed in Section 3.2) will get captured by a neighboring star of mass m∗1 is approximately given by the\nrelative capture cross-section of its weak stability boundary, Gf (Rcap (m∗1 )/Dm∗1 −m1 )2 , where Rcap is the\nradius of the weak stability boundary for capture of the target star and Dm∗1 −m1 is the average distance\nbetween two stars of masses m∗1 and m1 respectively. If we assume that this distance is the average interstellar\ndistance D estimated in Section 3.1, we get that for a solar-type star, an upper limit to the weak capture\nprobability is approximately 1.3*10−3 , 6.5*10−4 and 4.5*10−4 , for a cluster of N = 100, 1000 and 4300\nmembers respectively (see dashed line of Figure 4). However, the distance to a star of a given stellar mass\nwill not be D necessarily, but it will depend on the distribution of stellar masses in the cluster (the IMF).\nThe simplest case is when both stars have equal masses m∗1 = m1 . In this case, the average interstellar\ndistance would be Dm1 ∼ (1/nm1 )1/3 , where nm1 is the average number density of stars with mass m1 ,\n3N\nnm1 = 4πR3m1 , and Nm1 is the total number of stars in the cluster with mass m1 , Nm1 = N * PIMF (m1 ).\ncluster\n\nBecause nm1 = n * PIMF (m1 ), we get that Dm1 ∼ D * (PIMF (m∗1 ))−1/3 . This means that the transfer\nprobability between two stars of equal mass is given by Gf (Rcap (m∗1 )/D)2 * (PIMF (m∗1 ))2/3 , where D is the\naverage distance between any two stars in the cluster (regardless of their mass). As we have discussed above,\nthe value of the focussing factor Gf can be very large. A conservative estimate of the capture probability can\nbe done by assuming Gf = 2. Figure 4 shows that the capture probability between two planetary systems\nwith solar-type central stars (m∗1 = m1 = 1 M ) are 1.9*10−4 , 8.1*10−5 and 5.6*10−5 , for a cluster of N =\n100, 1000 and 4300 members respectively.\n\n\f– 11 –\n4.\n\nNumerical estimate of the weak capture probability based on Monte Carlo\nsimulations\n\nThe order-of-magnitude estimate of the weak transfer probability discussed in Section 3 has two important caveats: (a) it assumes that the capture takes place in the orbital plane of P2∗ (the primary planet in the\ncapturing system), i.e. it does not consider the 3-D problem; and (b) the adoption of a focussing factor Gf\n= 2 is conservative because it does not make use of the nature of nonlinear weak capture dynamics, where\nthe gravitational forces of P1 , P1∗ , and the stars of the cluster are all acting on P0 . Gf can increase very\nsignificantly if at a given value of Rcap (m∗1 ), v∞ is much smaller than the approximate value of U = 1 km/s,\nand can become 0, while vesc ≈ U (for an example, see Appendix A). In this section, we refine the estimate\nof the weak transfer probability using Monte Carlo simulations that address the caveats mentioned above\nby considering the more general and realistic model that calculates the motion of P0 , P1 , P1∗ by a general\nthree-dimensional Newtonian three-body problem plus the effective gravitational perturbation of the cluster\nstars. We sample millions of trajectories for the meteoroid P0 weakly escaping P1 testing whether they are\nweakly captured near P1∗ .\n\n4.1.\n\nModeling procedure\n\nTo model the motion of P0 from the distance Resc (m1 ) from P1 to S ∗ and with initial velocity σ, we\nconsider a general Newtonian three-dimensional three-body problem that is perturbed by the gravitational\nforce of the stellar cluster. This model gives the motion of P0 , P1 , P1∗ in an inertial coordinate system\n(r1 , r2 , r3 ). We assume the gravitational perturbing force of the cluster is obtained from a spherically\nsymmetric Hernquist potential\n\nUC (r) =\n\nGM\n,\nr+a\n\n(3)\n\n(Hernquist 1990), where M is the total cluster mass, r2 = r12 + r22 + r32 , and a is the cluster scale length,\nwhich is approximately the radius of the cluster, Rcluster . The center of mass of the cluster is at the origin,\nr = (0, 0, 0).\nThe system of differential equations modeling the motion of P0 , P1 , P1∗ , of mass m0 , m1 , m∗1 respectively,\nis given by\nv̇k = m−1\nk\n\nṙk = vk ,\n\n∂V\n,\n∂rk\n\n(4)\n\nwhere rk = (rk1 , rk2 , rk3 ) and vk = (vk1 , vk2 , vk3 ) = (ṙk1 , ṙk2 , ṙk3 ) are the position and velocity vectors,\nrespectively, of the kth particle, Pk (with k = 0, 1, 2; P2 represents P1∗ and m2 represents m∗1 ). The\ngravitational potential is V = U + mk UC (rk ), where rk is the distance of Pk to the origin, rk = |rk |, and\n\nU=\n\n2\nX\nGmj mk\nj=0\nj6=k\n\nrj/k\n\n.\n\nU = U (r1 , r2 , r3 ) is a function of 9 variables rkj , j = 1, 2, 3, and\n\n(5)\n\n\f– 12 –\n\n∂V\n≡\n∂rk\n\n\u0012\n\n∂V ∂V ∂V\n,\n,\n∂rk1 ∂rk2 ∂rk3\n\n\u0013\n,\n\n(6)\n\nwhere rj/k is the distance between Pj and Pk , rj/k = |rj − rk |.\nm0 is approximately 0 relative to m1 , m∗1 .\nIn the Monte Carlo model, the trajectory of motion for P0 is determined from (4) by providing its\ninitial position at the distance R = Resc (m1 ) from P1 at t = 0. The initial velocity of P0 with respect to\nP1 at the distance R is chosen from a distribution of weak escape velocities (see Figure 2). P0 then weakly\nescapes P1 . The initial positions and velocities of P1 and P1∗ are also given at t = 0. Their initial separation\ndistance depends on the cluster properties and is a function of the number of stars in the cluster N. After\nthe initial positions and velocities of P0 , P1 , P1∗ are given, the trajectory of P0 is propagated for t > 0. We\nsearch for the condition of the first weak capture of P0 with respect to P1∗ , given by a negative value of\nthe Kepler energy of P0 with respect to P1∗ , E1∗ < 0. This implies that for P0 , v∞ → 0 , and therefore\nGf → ∞. This occurs at the weak stability boundary of P1∗ , W SB(P1∗ ), at a distance R∗ = Rcap (m∗1 )\nfrom P1∗ . This stability boundary is formed around P1∗ due to the resultant gravitational perturbation of\nthe N − 1 remaining stars of the cluster. We are interested in cases where the time of propagation T is\nsmaller than the cluster dispersal timescale, which is a function of the number of stars in the cluster, N.\nUnder the conditions described above and using a Monte Carlo approach, we sample millions of trajectories\nof P0 weakly escaping P1 using Runge-Kutta-Nyström 12th/10th order, variable step, symplectic integrator\n(Dormand et al. 1987). The Monte Carlo method calculates the number of these particles to be weakly\ncaptured by P1∗ , i.e. the probability of weak transfer.\n\n4.2.\n\nCluster properties\n\nWe adopt those cluster properties thought to be representative of the Sun's birth cluster. These properties are inferred from a wide range of physical considerations, including the effect of supernova explosions\non the enrichment of short-lived radioactive isotopes in the solar nebula, protoplanetary disk truncation\ndue to photoevaporation from nearby hot stars, and the dynamical disruption of planetary orbits due to\nclose encounters with cluster stars. The observed solar system properties that depend on the Solar birth\nenvironment (such as the evidence of short-lived radio-nuclides in meteorites and the dynamical properties\nof the outer solar system planets and Kuiper belt) led Adams (2010) to conclude that the Sun was born in a\nmoderately large cluster with N = 1000–10000 and hN i = 4300 ± 2800 members, similar to the Trapezium\ncluster in Orion. For reference, Adams (2010) notes that approximately 50% of stars are born in systems\nwith N & 1000, but for ∼ 80% of these stars the clusters dissolve quickly after 10 Myr; only ∼ 10% of the\ntotal number of stars would be born in open clusters with lifetimes of the order of 100–500 Myr.\nUsing the initial mass function in Section 3.4, we estimate that the total cluster mass is Mcluster =\n(3784 ± 2500)M . Following Adams (2010), the properties of such a cluster\np would be as follows. The scale\nlength of the cluster is approximately its size, given by a = Rcluster = 1pc N/300 = 3.78 ± 1.5 pc. With the\n3\nstellar number density, n = 3N/(4πRcluster\n) = 19 pc−3 , the average interstellar distance is D = n−1/3 = 0.375\npc. The typical expected distance of the Sun to the center of mass of the cluster would be dcm = 2Rcluster /3\n= 2.52±1 pc (using a radial profile for stellar density consistent with a Hernquist potential). The cluster\nlifetime is approximately T = 2.3(Mcluster /M )0.6 Myr = (135–535) Myr, for N = 1000–10000.\n\n\f– 13 –\n4.3.\n\nModeling assumptions\n\nFor the Monte Carlo simulations we adopt the average values of the solar system birth cluster: N =\n4300, D = 0.375 pc, a = 3.78 pc, dcm = 2.52 pc, and a cluster lifetime T = 322.5 Myr. We also make the\nfollowing assumptions:\n• For the duration of the simulation, the cluster size and therefore the average distance between the\nstars, D, are kept constant (i.e. we making the simplifying assumption that the cluster disperses\ninstantly at the end of the simulation, at time equal to the average cluster age).\n• At t = 0, the initial separation of P1 , P1? is D (coinciding with the average separation of the cluster\nstars); the center of mass of P1 , P1? , placed on the Q1 , Q2 plane for convenience, is assumed to be a\ndistance dcm from the inertial frame origin, Q = 0 ≡ (0, 0, 0).\n• Let v1 and v1∗ be the initial velocity vectors of P1 and P1∗ respectively (relative to Q = 0). At t = 0,\nthese two vectors lie on the plane σv0 and we assume |v1 − v1∗ | = 1 km/s, |v1 | ≤ 2 km/s and |v1∗ | ≤\n2 km/s, with the initial angle θ between v1 , v1∗ varying over [0, 2π] on σv0 .\n• At t = 0, P0 escapes from P1 in three-dimensions with the tangential velocity vector v0/1 (relative\nto P1 ); the magnitude of v0/1 is chosen from the weak escape v∞ distribution (Dv∞ ) in Figure 2;\nnote that this figure assumed P1 has a mass m1 = 1M and a Jupiter size planet orbiting at 5 AU,\nbut we also assume this distribution for the case m1 = 0.5M considered below. At t = 0, when P0\nescapes P1 , the distance between the two is r0/1 = |r0/1 | ∈ [0.02, 0.2] pc. Let φ0 , θ0 be the spherical\nangles that specify the position of the vector r0/1 of P0 with respect P1 (note that θ0 is distinct from\nθ and should not be confused with it). We assume φ0 ∈ [0, 2π] and θ0 ∈ [0, π], where φ0 is uniformly\ndistributed in [0, 2π], and θ0 is sinusoidally distributed over [0, π]. For t > 0, as P0 escapes P1 in\nthree-dimensions, it can approach P1∗ from any direction.\n• We search for weak capture with respect to P1∗ in the time interval t ∈ [0, Tmax ]Myr, where Tmax is\nthe estimated age of the cluster Tmax = T = 322.5 Myr. The condition for capture is a negative value\nof the two-body Kepler energy of P0 with respect to P1∗ , E1∗ < 0. This can occur at any distance from\nP1∗ , or even at the initial time t = 0 when P0 escapes P1 (the latter can occur because P0 escapes P1\nbetween 0.02 pc and 0.2 pc, but P1∗ is only initially at a distance D from P1 ). When weak capture\noccurs, we have obtained a weak transfer of P0 from P1 to P1∗ .\nIn summary, the Monte Carlo simulation is done by randomly choosing values of the paramaters\nv0/1 , r0/1 , θ0 , φ0 , θ, |v1 | and |v1∗ | at t = 0 that satisfy: v0/1 ∈ Dv∞ , r0/1 ∈ [0.02, 0.2] pc, φ0 ∈ [0, 2π],\nθ0 ∈ [0, π], θ ∈ [0, 2π], |v1 | ≤ 2 km/s, |v1∗ | ≤ 2 km/s and |v1 − v1? | = 1 km/s respectively. The Monte Carlo\nalgorithm searches for the condition E1∗ < 0 for t ∈ [0, Tmax ] Myr.\n\n4.4.\n\nResults from the Monte Carlo simulations\n\nThe Monte Carlo simulations study the capture probability within the cluster described in Section 4.2 for\nthe following three different combinations of stellar masses: m1 = 1 M , m∗1 = 1 M (Case 1); m1 = 1\nM , m∗1 = 0.5 M (Case 2); and m1 = 0.5 M , m∗1 = 1 M (Case 3). These simulations explore the weak\ntransfer of material between two solar-type stars and between a solar-type star and a star half its mass, the\ninterest of the latter being that low-mass stars are the most abundant in the galaxy, with ∼ 64% and 72%\n\n\f– 14 –\nhaving mass < 0.4 M and 0.6 M respectively. For each case, the Monte Carlo simulation ran 5 million\ntrajectories, a sufficient number so that the randomization of the initial values produces distributions of the\nparameters that span their respective ranges. The resulting distributions are discussed in the Appendix B.\nFor Case 1 (weak transfer of meteoroids between two solar-type stars), the Monte Carlo simulations\ngive a revised estimate of the weak capture probability of 1.5*10−3 (see Table 1). Note that the Monte\nCarlo simulations assume that P1∗ with m∗1 = 1 M is at the average interstellar distance D = n−1/3 (i.e.\nwithout regard to the distribution of stellar masses in the cluster). The Monte Carlo derived weak capture\nprobability is approximately a factor of 3 larger than the order-of magnitude-estimate in Section 3.4, which\nwas approximated by the relative capture cross-section of weak stability boundary of the target star, given\nby Gf (Rcap (m∗1 )/D)2 = 4.5*10−4 , for m∗1 = 1, N = 4300 and using a conservative gravitational focussing\nfactor of Gf = 2. This increase in the weak capture probability estimated by the Monte Carlo simulations\nis likely due to the larger focussing factors that result from the nature of weak capture. Note that both\nestimates assume that the meteoroids are initially on weakly escaping trajectories from P1 . For Cases 2 and\n3, the Monte Carlo simulations give a weak capture probability of 0.5*10−3 and 1.2*10−3 respectively (see\nTable 1).\n\n5.\n\nEstimate of the number of weak transfer events for the young solar system\n\nWith the improved estimate of the probability of weak capture obtained from the Monte Carlo simulations, we now calculate the total number of meteoroids that could get transferred between two neighboring\nsolar-type stars harboring planetary systems by multiplying the capture probability in Table 1 (for Case 1)\nwith the estimated number of meteoroids (NR ) that a planetary system may eject before the cluster disperses. Because the scenario considered here assumes that the escaping meteoroids are on weakly escaping\ntrajectories, NR is not the total number of escaping meteoroids but only the subset on weakly escaping\ntrajectories. The main uncertainties in assessing whether weak transfer is a viable method for meteoroid\ntransfer lie in estimating this number. While this number is highly uncertain, we proceed with estimating\nNR for our solar system, as it is the only planetary system for which observations and dynamical models\nenable us to make an educated estimate.\nWe estimate NR from Oort cloud formation models because Oort cloud comets are weakly bound to the\nsolar system and are therefore representative of a population of meteoroids that may have been delivered on\nits weak stability boundary, subject to weak escape. We use the model by Brasser et al. (2011) in which ∼ 1%\nof the planetesimals in the Jupiter–Saturn region (4–12 AU) became part of the primordial Oort Cloud in the\nearly history of the solar system. Under this scenario, the forming giant planets scattered the planetesimals\nin this region out to large distances where they were subject to the slowly changing gravitational potential of\nthe cluster; the latter caused the perihelion distances of the scattered planetesimals to be lifted to distances\n\u001d 10 AU, where the planetesimals were no longer subject to further scattering events but were also safe\nfrom complete ejection, and thus remained weakly bound to the solar system. To calculate how many\nplanetesimals formed in the 4-12 AU region, we adopt the minimum mass solar nebula (MMSN), with a dust\nsurface density Σ = Σ0 (a/40AU )−3/2 , where Σ0 = Σ0d = 0.1 g/cm2 (Weidenschilling 1977; Hayashi 1981).\nIntegrating between 4 and 12 AU, we find a total mass in solids of 1029 g. With the above estimate for the\ntotal mass in solids, we calculate the number of planetesimals by adopting a planetesimal size distribution\nfunction representative of the early solar system. This size distribution is uncertain, but can be constrained\nroughly from observations and coagulation models. Based on these studies, we adopt three power-law size\n\n\f– 15 –\ndistribution functions for our calculation of NR , with dN/dD ∝ D−q1 for D > D0 and dN/dD ∝ D−q2 if\nD<D0 , of different power-law indices at the small and large sizes:\n• Case A: q1 = 4.3, q2 = 3.5, D0 = 100 km, Dmax = 2000 km (∼ Pluto's size), Dmin = 1 μm (∼ dust\nblow-out size). This size distribution has the power law index of a collisional cascade at the small\nsize end, and that of the hot Kuiper Belt at the large size end (from Bernstein et al. 2004), with a\nbreak diameter consistent with that of the present-day Kuiper belt. The approximate scenario of this\ncase is as follows: in the Jupiter-Saturn zone, the accretion of large planetesimals proceeded to make\nthe large-size bodies similar to those observed in the present-day Kuiper belt, whereas at the small\nsize end, the dynamical stirring by the large bodies produced a classical collisional cascade. For the\nlatter, the reason why we do not adopt the observed present-day power law index of the hot Kuiper\nbelt at sizes . 50 km (q2 = 2.8, Bernstein et al. 2004) is because these smaller bodies are the result\nof an advanced erosional process that changed their size distribution on gigayear timescales (Pan &\nSari 2005).\n• Case B: q1 = 3.3, q2 = 3.5, D0 = 2 km, Dmax = 2000 km (∼ Pluto's size), Dmin = 1 μm (∼ dust\nblow-out size). This size distribution is derived from theoretical coagulation models (see review in\nKenyon et al. 2008).\n• Case C: q1 = 2.7, q2 = 3.5, D0 = 2 km, Dmax = 2000 km (∼ Pluto's size), Dmin = 1 μm (∼ dust\nblow-out size). This size distribution is also based on theoretical coagulation models (see review in\nKenyon et al. 2008).\n• Case D: q1 = 4.3, q2 = 1.1, D0 = 100 km, Dmax = 2000 km (∼ Pluto's size), Dmin = 1 μm (∼\ndust blow-out size). This size distribution represents perhaps the \"worst case\" scenario in which the\ndepletion of the small bodies took place very early on, before the objects were transferred into the\nOort Cloud. The parameters here are within the range that Bernstein et al. (2004) find for the Kuiper\nbelt. This size distribution is also similar to that discussed in models for the primordial asteroid belt\n(q1 = 4.5, q2 = 1.2, D0 ∼ 100 km, Bottke et al. 2005).\nOf particular interest are the meteoroids >10 kg, that may be large enough to shield potential biological\nmaterial from the hazards of radiation in deep space and from the impact on the surface of a terrestrial planet\n(Horneck 1993; Nicholson et al. 2000; Benardini et al. 2003; Melosh 2003).\nGiven a total mass of 1029 g of solids in the 4–12 AU zone in the solar system at the time of Jupiter\nand Saturn formation, and adopting the above size distributions of the solid bodies, we can calculate the\nnumber of planetesimals with masses > 10 kg (diameter D > 26 cm if ρ = 1 g/cm−3 ). Then, assuming that\n1% of these planetesimals were delivered to the weak stability boundary of the solar system, we obtain an\nestimate for NR . Table 2 shows these results for the four size distributions considered. We find that NR is\nin the range 8 * 1016 –2 * 1019 for Cases A, B and C, but is only 5 * 106 for Case D.\nFinally, multiplying NR by the weak capture probability determined in Section 4 (1.5*10−3 for the\ntransfer between two solar-type stars), we estimate the number of weak transfer events, NWTE , that could\nhave occurred between the early solar system and a neighboring star in the cluster, assuming it is also a\nsolar-type star and harbors a planetary system. The results are listed in Table 2; for Cases A, B and C they\nare of the order of 1014 –3 * 1016 , and for Case D it is of the order of 104 . If the target system is a low-mass\nstar of m∗1 = 0.5 M , the number of weak transfer events is approximately three times smaller in each case\n(because the weak capture probability in this case is 5*10−4 instead of 1.5*10−3 – see Table 1).\n\n\f– 16 –\nNote that the results in Table 2 refer to the weak transfer of solid material between neighboring\nplanetary systems, but it does not account for the probability of landing on a terrestrial planet in the target\nsystem. Melosh (2003) and Adams & Spergel (2005) estimate that the latter probability is ∼ 10−4 .\n\n6.\n6.1.\n\nSummary and Discussion\n\nSummary of the weak transfer mechanism\n\nWe have explored a mechanism that allows the transfer of solid material between two planetary systems\nembedded in a cluster. This mechanism is based on the chaotic dynamics of the restricted three-body model\nof the meteoroid, the star and the most massive planet in the planetary system (P0 , P1 , P2 ), in which a\nchaotic layer replaces the regular parabolic trajectories of the two body problem of (P0 , P1 ). Similarly,\nthere is a chaotic layer around the target star (assumed to harbor a planetary system). Weak transfer\ntakes place within these chaotic layers because the trajectories have low escape velocities and therefore the\ncapture probability in enhanced. We have applied this mechanism to the problem of planetesimal transfer\nbetween planetary systems in an open star cluster, where the relative stellar velocities are sufficiently low (∼\n1 km/s) to allow weak escape and capture. We found that weak escape and capture within an open cluster\ncan enhance drastically the probability of transfer compared to the scenario described in Melosh (2003) and\ncorresponding to the exchange of meteoroids between field stars using hyperbolic trajectories: while Melosh\n(2003) estimated a cross-section of 0.025 AU2 (for capture by a planetary system with a Jupiter-mass planet\n2\n∼ 107 AU 2 (i.e.\nat 5 AU), and order-of-magnitude estimate for weak capture cross-section would be π * Rcap\nmany order of magnitudes larger).\nTo obtain quantitative estimates, we adopt the average cluster properties inferred for the Solar birth\ncluster (Adams 2010), with N = 4300 members, a total mass of Mcluster = 3784 M (using an average\np stellar\nmass of 0.88 M resulting from the initial mass function) and a cluster scale length of a = 1pc N/300 =\n3.78 pc. Such a cluster is expected to have a lifetime of 2.3 (Mcluster /M )0.6 Myr = 322.5 Myr (ranging\nfrom 135–535 Myr, for N = 1000–10000).\nWith the aid of Monte Carlo simulations, we estimate the probability of weak capture for meteoroids\nthat have weakly escaped their original planetary system and are weakly captured at a neighboring system.\nWe consider three cases where the source P1 and the target star P1∗ have masses of m1 = 1, m∗1 = 1 (Case\n1), m1 = 1, m∗1 = 0.5 (Case 2) and m1 = 0.5, m∗1 = 1 (Case 3). The resulting weak capture probabilities are\n0.15%, 0.05% and 0.12% respectively. This capture probability is much larger than the capture probabilities\nobtained in previous studies; for example, Adams & Spergel (2005) found capture probabilities of ∼ 10−6\nfor mean ejection speeds of ∼ 5 km/s, typical of hyperbolic ejecta of the solar system.\nAdopting parameters from the minimum mass solar nebula (Weidenschilling 1977; Hayashi 1981),\nconsidering a range of planetesimal size distributions derived from observations of asteroids and KBOs and\ntheoretical coagulation models (Bernstein et al. 2004; Bottke et al. 2005; Kenyon et al. 2008), and taking into\naccount the results from Oort Cloud formation models (Brasser et al. 2011) for the fraction of planetesimals\nthat are subject to weak escape from the early solar system, we estimated the number of meteoroids that\nmay have been delivered to the weak stability boundary of the solar system over the lifetime of the Sun's\nbirth cluster. Using this number and the probability of the weak capture of meteoroids on weakly escaping\norbits, we calculated the number of weak transfer events from the early solar system to the nearest star in\n\n\f– 17 –\nthe cluster, assuming it is a solar-type and harbors a planetary system. This number depends strongly on\nthe adopted planetesimal size distribution. We find that, for the cases where the power law size distribution\nat the small sizes (dN/dD ∝ D−q2 for D < D0 ) has index q2 = 3.5, the expected number of weak transfer\nevents between two solar type stars is of the order of 1014 –3 * 1016 ; for a shallow size distribution (q2 = 1.1)\nthe number is of the order of 104 .\nWe conclude that solid material could have been transferred in significant quantity from the solar\nsystem to other solar-type stars in its birth cluster via the weak transfer mechanism described here.\n\n6.2.\n\nImplications for lithopanspermia\n\nSection 6.1 indicates that the transfer of planetesimals via the weak transfer mechanism described in\nthis paper is likely to be the dominant process for the exchange of solid material amongst planetary systems\nin a star cluster. This is of interest for lithopanspermia because if life arose in any of these systems before the\ncluster dispersed, this mechanism may have allowed the exchange of life-bearing rocks amongst the planetary\nsystems in the cluster. Within the context of the solar system's formation and dynamical history, in this\nsection we discuss how much material originating from the Earth's crust may have been available for weak\ntransfer (Section 6.2.1), and, given the time constraints imposed by the weak transfer mechanism, whether\nor not there was a \"window of opportunity\" for lithopanspermia to take place (Section 6.2.2).\n\n6.2.1.\n\nEarth crustal material available for weak transfer\n\nWe first obtain an order-of-magnitude estimate of how much material may have been ejected from\nthe Earth's crust as a consequence of the heavy bombardment that took place before the cluster dispersed.\nFollowing Adams\u0010 and Spergel\n(2005), we assume that l km of the Earth surface was ejected, with a total\n\u0011\nmass of MB ∼ 3\n\nl(km)\nR⊕\n\nM⊕ ∼ 5 * 10−4 * l(km)M⊕ ∼ 3 * 1024 * l(km) g. Adopting a power-law distribution,\n\n−α\n\ndN/dm ∝ m , with α = 5/3, m1 = 10 kg and m2 = 10−9 M⊕ (corresponding to objects 10 km in size),\nMB\n∼ 2 * 1015 * l(km) bodies. A significant fraction\nthis total mass would be distributed in NB ∼ 2−α\nα−1 m1α−1 m2−α\n2\nof these fragments would have been ejected on hyperbolic orbits, i.e. beyond the domain of weak escape. To\nestimate how many of these bodies may have populated the weak stability boundary, we use the Oort Cloud\nformation efficiency of ∼ 1% (Brasser et al. 2011): of the order of 2 * 1013 * l(km) bodies with a terrestrial\norigin that may have been subject to weak escape.\nAn additional factor to consider is that a significant fraction of the Earth ejecta resulting from the\nbombardment would have been heated by shocks to pressures and temperatures high enough to sterilize\nthe fragments (up to 50 GPa and several 100 ◦ C respectively). However, a few percent of the material that\noriginated from the spall region of the impacts –located a few projectile diameters away from the impact point\nin an area where the shocks cancel out– would have remained weakly shocked, achieving a peak temperature\n< 100 ◦ C that would allow microorganisms to survive (Artemieva & Ivanov 2004; Fritz et al. 2005, Pierazzo\n& Chyba 1999, 2006). In fact, laboratory experiments have confirmed that several microorganisms embedded\nin martian-like rocks have survived under shock pressures similar to those suffered by martian meteorites\nupon impact ejection (Stöffler et al. 2007; Horneck et al. 2008). Other laboratory experiments confirm that\nbacteria and yeast spores and microorganisms in a liquid can survive impacts with shock pressures of the\n\n\f– 18 –\norder of GPas (Burchell et al. 2004; Willis et al. 2006; Hazell et al., 2010; Meyer et al. 2011). Assuming\nonly 1% of the ejected Earth material remained weakly shocked, and factoring this into our estimate above,\nwe get that ∼ 2 * 1011 * l(km) life-bearing rocks with an Earth origin may have been subject to weak escape.\nUsing the weak capture probability, 1.5*10−3 , derived in Section 4.4, we estimate that the total number\nof lithopanspermia events between the Earth and the nearest solar-type star in the cluster may have been\nof the order of 3 * 108 * l(km), where l is the depth of the Earth's crust in km that was ejected during the\n\"window of opportunity\".\n\n6.2.2.\n\nTime constraints\n\nNow it is necessary to discuss the time constrains. We focus on two key aspects: (a) whether there is\nevidence that life may have arisen on Earth before the cluster dispersed, and (b) the survival of life to the\nhazards of outer space during the timescales relevant to weak transfer.\n\nIs it possible that life arose on Earth before the cluster dispersed?\nThe age of the solar system can be established from the dating of its oldest solids, the CAI inclusions in\nC-chondrites, that formed 4.570 ± 0.002 Ga when the refractory elements in the solar nebula first started to\ncondense at temperatures of approximately 2000 K (Lugmair & Shukolyukov 2001). Let us assume that the\nstellar cluster was also born at that time. From Hf-W chronometry, it is estimated that the crystallization of\nthe lunar magma oceans took place 4.527±0.010 Ga (Kleine et al. 2005), setting the time of the giant collision\nof a Mars-sized proto-planet with Earth that stripped part of its mantle and formed the Moon (Canup 2004).\nThe detrital zircons found in Jack Hills in Western Australia show evidence that the Earth may have cooled\ndown from this Moon-forming collision when the solar system was ∼ 70 Myr old; this evidence comes from\nthe heterogeneity of the zircons Hf isotope ratio, 176 Hf/177 Hf, a tracer of the crust/mantle differentiation\n(Harrison et al. 2005). Furthermore, the high oxygen isotope ratio, 18 O/16 O, of 3.91–4.28 Gyr old Jack\nHills detrital zircons suggests that the original rocks formed from magma containing recycled continental\ncrust that had interacted with water near the surface. This indicates that liquid water was circulating in\nthe upper crust of the Earth when the solar system was only 288 Myr old (Mojzsis et al 2001). Another\nstudy showed high oxygen isotope ratios in 4.404 Gyr old zircons, suggesting liquid water may have been\npresent at an even earlier time, when the solar system was 164 Myr old (Wilde et al. 2001). The temperate\nconditions and possible presence of a hydrosphere indicate habitable conditions that may have allowed life\nto emerge during this period.\nThe carbon isotopic ratio of tiny inclusions of graphite in 3.85 Gyr old sedimentary rocks in Greenland\nshow an increased 12 CO/13 CO ratio that is indicative of biological activity, implying that life may have\nemerged before the solar system was 718 Myr old (Mojzsis et al 1996). If this age estimate (based on\nuranium-lead dating of zircons) is correct, this means that life may have been extant very shortly after\nthe end of the Late Heavy Bombardment (LHB). Rather than abiogenesis taking place during such a short\nperiod, this favors the hypothesis that life emerged during the Hadean time and survived the LHB. In fact,\nin a study of the degree of thermal metamorphism suffered by the Earth's crust during the LHB, Abramov &\nMojzsis (2009) concluded that that it is unlikely that the entire crust was fully sterilized and that a microbial\nbiosphere, if it existed, likely survived the LHB.\n\n\f– 19 –\nIn this section on the implications of weak transfer on the possibility of lithopanspermia, we will work\nwith the hypothesis that life emerged during the Hadean time. This is motivated by the possible presence of\noceans under temperate conditions and by the timescales for abiogenesis. Note, however, that evidence for\nlife as early as 3.85 Ga as mentioned above is controversial (Moorbath 2005 and references therein). There is\nless controversial evidence of a sulfur-based bacterial ecosystem in Western Australian rocks with an age of\napproximately 3.4 Gyr, i.e. when the solar system was approximately 1170 Myr old (Wacey et al. 2011; see\nalso Schopf et al. 1993). But this timeframe would be too late for lithopanspermia via weak transfer to take\nplace because at this time the solar maternal cluster would have dispersed. The timescales for abiogenesis\nvary from 0.1–1 Myr for hydrothermal conditions at the deep sea, to 0.3–3 Myr for warm puddle conditions\nin shallow water, to 1–10 Myr for subaeric conditions in the soil, at least an order of magnitude less than\nthe lifetime of the stellar cluster.\nIf life arose on Earth shortly after there is evidence of liquid water on its crust, the \"window of\nopportunity\" for life-bearing rocks to be transferred to another planetary system in the cluster opens by\nthe time liquid water was available, at 164–288 Myr, and ends by the cluster dispersal time, Tcluster ∼\n135–535 Myr (Adams 2010). Within this timeframe, there was a mechanism that allowed large quantities of\nrocks to be ejected from the Earth: the ejection of material resulting from the impacts at Earth during the\nheavy bombardment of the inner solar system. This bombardment period lasted from the end of the planet\naccretion phase until the end of the LHB 3.8 Ga, i.e. it finished when the solar system was approximately 770\nMyr old (Tera et al. 1974; Mojzsis et al. 2001; Strom et al. 2005). It represents evidence that planetesimals\nwere being cleared from the solar system several hundred million years after planet formation (Strom et\nal. 2005; Tsiganis et al. 2005; Chapman et al. 2007). This period of massive bombardment and planetesimal\nclearing encompassed completely the \"window of opportunity\" for the transfer of life-bearing rocks discussed\nabove and therefore provides a viable ejection mechanism that may have led to weak transfer.\n\nSurvival of life to the hazards of outer space during the timescales relevant to weak transfer\nA final consideration for lithopanspermia is the survival of microorganisms to the hazards of radiation during\ntheir long journey in outer space. Valtonen et al. (2009) used a computer model to account for the effects\nof Galactic cosmic rays from all elements up to nickel Z = 28, and for the effects of natural radioactivity\nin meteorites characteristic of Earth and Mars. They found the following maximum total survival times\nin interstellar space (that depend on the size of the parent body): 12–15 Myr (for sizes of 0.00–0.03 m),\n15–40 Myr (0.03–0.67 m), 40–70 Myr (0.67–1.00 m), 70–200 Myr (1.00–1.67 m), 200–300 Myr (1.67–2.00\nm), 300–400 Myr (2.00–2.33 m) and 400–500 Myr (2.33–2.67 m). To put these lifetimes into context, note\nthat under the best case scenario in which life emerged at the time liquid water was available in the upper\ncrust (164 Myr or 270 Myr depending on the authors), lithopanspermia would have had a time window of\nup to 260–370 Myr (assuming the age of the cluster was in the upper end of ∼ 535 Myr). But the survival\ntimescales above need to be compared, not to this time window, but to the transfer timescales associated\nwith the weak transfer mechanism described in this paper. The latter are as follows: (a) Timescale for\nejection: the numerical simulations carried by Melosh (2003) indicate that the minimum time between the\nejection of meteorites from the Earth and exit from the solar system is 4 Myr, with a median time of 50\nMyr. Under our scenario, the time for a meteoroid to exit the solar system can be is estimated using\nBarker's equation, that gives the time of flight along a parabolic trajectory from periapsis with respect\nto the central star to the distance Resc (m1 ). For a periapsis of 5 AU (at the location of the perturbing\nplanet) and Resc = 1.8*105 AU (corresponding to a solar-mass central star), we get that the exit timescale\n\n\f– 20 –\nis ∼ 6 Myr. (2) Timescale for interstellar transfer: a meteoroid moving at the low velocity of 0.1 km/s\n(typical of the weak transfer mechanism) will take about 3–5 Myr to reach a neighboring star (located at a\ndistance D ≈ 105 AU). (3) Timescale to land on a terrestrial planet: Assuming that the neighboring star\nalso harbors a planetary system, the weak capture mechanism would be active; a captured meteoroid would\ntypically need to make multiple periapsis passages, i.e., some tens of millions of years, before collision with\na planet. We see therefore that the timescales for weak transfer compared to the microorganism survival\ntimescales estimated by Valtonen et al. (2009) indicate that the survival of microorganisms could be viable\nvia meteorites exceeding ∼ 1 m in size.\nIt is also of interest to study the exchange of prebiotic molecules between planetary systems, as they\nare more robust to the hazards of outer space. Simple amino acids like glycine have been found in several\ncarbonaceous meteorites and in Stardust samples returned from comet Wild-2 (Elsila et al. 2009). IglesiasGroth et al. (2011) argue that amino acids like glycine likely formed in the ISM and in chiral excess, and are\ntherefore omnipresenti . This indicates that they may be available throughout the solar system, increasing\nthe volume of material that may be subject to weak transfer. Moreover, there is no reason to assume that the\nfundamental hydrocarbon chemistry from which life developed was not present in other planetary systems at\nthe time of their formation. Even though glycine has yet to be detected in the interstellar medium, Lattelais\net al. (2011) points out that its non-detection (in spite of extensive radio surveys) is probably explained\nbecause neutral glycine is not the most stable isomer and therefore is not dominant.\nThe discussion above assesses the possibility that life on Earth could have been transferred to other\nplanetary systems when the Sun was still embedded in its stellar birth cluster. But could life on Earth have\noriginated beyond the boundaries of our solar system? Our results indicate that, from the point of view of\ndynamical transport efficiency, life-bearing extra-solar planetesimals could have been delivered to the solar\nsystem via the weak transfer mechanism if life had a sufficiently early start in other planetary systems, before\nthe solar maternal cluster dispersed. An early microbial biosphere, if it existed, likely survived the LHB.\nThus, both possibilities remain open: that life was \"seeded\" on Earth by extra-solar planetesimals or that\nterrestrial life was transported to other star systems, via dynamical transport of meteorites.\nAPPENDIX A: Earth-to-Moon weak transfer: study case for a large focussing factor\nAs noted in Sections 3.4 and 4, adopting for the focussing factor, Gf = 1 + ( vvesc\n)2 , a value of Gf = 2\n∞\n∗\nis a conservative estimate. This factor can be substantially larger if at a given Rcap (m1 ), v∞ is smaller than\nthe approximate value of U = 1 km/s, while the value of vesc remains the same as U . Dynamically, the\nway to decrease v∞ with respect to P1∗ , as the meteoroid P0 approaches P1∗ , is for P0 to decrease its relative\nvelocity. This process has been shown to exist, for example, by the operational spacecraft Hiten, that was\ntransferred from the Earth to the Moon on a trajectory that goes to ballistic capture at a given distance from\nthe Moon. Figure 5 shows a trajectory of the spacecraft leaving the Earth at a periapsis distance of 200 km\n\ni\n\nIglesias-Groth et al. (2011) study is based on the radiolysis and radioracemization rate constants derived\nfrom laboratory experiments in which glycine was exposed to doses similar to those delivered by the decay\nof natural radionuclides in comets and asteroids during 1 Gyr. The authors extrapolate to the solar system\nage and estimate the original concentration of amino acids at the time of solar system formation, concluding\nthat \"amino acids were formed in the interstellar medium and in chiral excess and then were incorporated\nin comets and asteroids at the epoch of the Solar System formation.\"\n\n\f– 21 –\nand going to a periapsis distance of 500 km from the Moon after 80 days, where the osculating eccentricity\nwith respect to the Moon was 0.945. When it arrived at lunar periapsis, its velocity was approximately vesc ,\nwhile its v∞ went from a value of 1 km/s to 0 km/s (Belbruno 2004), implying Gf = ∞. Figure 6 shows\nthe Kepler energy Ek of the spacecraft with respect to the Moon along this transfer. At a sufficiently far\n√\ndistance from the Moon, where v∞ ≈ 2Ek , we see that Ek → 0 implying v∞ → 0.\nAPPENDIX B: Detailed results from the Monte-Carlo simulations\nFor each case, the Monte Carlo simulation ran 5 million trajectories, a sufficient number so that the\nrandomization of the initial values produces distributions of the parameters that span their respective ranges.\nThe resulting distributions are shown in the histograms of Figures 7–21. Figures 7–11 correspond to Case 1,\nFigures 12–16 to Case 2 and Figures 17–21 to Case 3. The histograms are normalized by the total number\nof cases, so that they represent the probability density function of the parameter being measured (i.e. the\nintegral under the curve is 1). Histograms labeled as \"all cases\" include all trajectories, regardless of whether\nor not capture is achieved, while histograms labeled as \"capture conditions\" include only those cases that\nend in weak capture near P1∗ . We now describe some of the features of the histograms corresponding to Case\n1. The other two cases are similar.\nFigure 7 shows that weak capture is inhibited for large initial separations between P0 and P1 (i.e. large\n|r0/1 |). This is because if escape happens at a larger |r0/1 |, it implies a larger v∞ and larger relative velocity\nwith respect to P1∗ , decreasing the odds of capture. Note that the input distribution for |r0/1 | is non-uniform,\nas we are forcing the kinetic energy with respect to P1 to be positive at t = 0 (which favors higher values of\n|r0/1 |, explaining the shape of the \"all cases\" histogram); if we were to adopt a uniform initial distribution\nfor |r0/1 |, we would get a decaying exponential or half-Gaussian distribution for the |r0/1 | of the capture\ncases.\nFigure 8 shows the initial velocity of P0 with respect to P1 , corresponding to the velocity distribution\nin Figure 2. [Note that the latter figure shows v∞ ; to compare the two, the escape velocity (∼ 0.2 km/s)\nneeds to be subtracted from the abscissa of Figure 8]. The peak in the \"capture conditions\" histogram\naround 1 km/s is due to the input distributions: the relative velocities of the two primaries were set to be\nless than 1 km/s, while the inertial velocities were forced to be less than 2 km/s. Figure 9 shows that these\nvarious restrictions cause a peak in the distribution of initial inertial velocities of the primaries at ∼ 1 km/s.\nTherefore, the most likely velocity that would allow the particle to approach P∗1 would be ∼1 km/s. The\ndistribution of v∞ in Figure 2 extends out to 5 km/s; these larger velocities correspond to the small peak\nin the \"all cases\" histogram at 2 km/s (in Figure 8); however, capture conditions become more unlikely for\nthese higher velocities and therefore this peak is not present in the \"capture conditions\" histogram.\nAcknowledgments\nE. B. acknowledges support from NASA Grant NNX09AK61G in the AISR Program of SMD. A. M.-M.\nacknowledges funding from the Spanish MICINN (Ramón y Cajal Program RYC-2007-00612, and grants\nAYA2009-07304 and Consolider Ingenio 2010CSD2009-00038). R.M. acknowledges support from NSF grant\nno. AST-0806828. Portions of this work by D.S. were performed under the auspices of the U.S. Department\nof Energy by Lawrence Livermore National Laboratory under Contract DE-AC52-07NA27344. At Princeton\nUniversity we would like to thank Robert Vanderbei for the use of his solar system simulation software, and\nDavid Spergel and Chris Chyba for helpful discussion.\n\n\f– 22 –\nREFERENCES\n\nAbramov, O. and Mojzsis, S. J. (2009) Microbial Habitability of the Hadean Earth During the Late Heavy\nBombardment. Nature 459: 419–422.\nAdams, F. C., and Laughlin, G. (2001) Constraints on the Birth Aggregate of the solar system. Icarus 150:\n151–162.\nArtemieva, N., & Ivanov, B. (2004) Launch of martian meteorites in oblique impacts. Icarus 171: 84–101.\nAdams, F. C., and Spergel, D. N. (2005) Lithopanspermia in Star Forming Clusters. Astrobiology 5: 497–514.\nAdams, F. C. (2010) The Birth Environment of the solar system. Annual Reviews of Astronomy and\nAstrophysics 48: 47–85.\nBelbruno, E. A. and Miller, J. (1993) Sun-Perturbed Earth-to-Moon Transfers with Ballistic Capture.\nJ. Guid., Control and Dynamics 16: 770–775.\nBelbruno, E. A. and Marsden, B. (1997) Resonance Hopping in Comets. Astronomical Journal 113: 1433–\n1444.\nBelbruno, E. A. (2004) Capture Dynamics and Chaotic Motions in Celestial Mechanics. Princeton University\nPress, Princeton.\nBelbruno, E. A. and Gott III, J. R. (2005) Where Did the Moon Come From? Astronomical Journal 129:\n1724–1745.\nBelbruno, E. A. (2007) Fly Me to the Moon: An Insider's Guide to the New Science of Space Travel.\nPrinceton University Press, Princeton.\nBelbruno, E. A., Gidea, M., and Topputo, F. (2010) Weak Stability Boundary and Invariant Manifolds.\nSIAM J. Applied Dynamical Systems 9: 1061–1089.\nBernstein, G. M., Trilling, D. E., Allen, R. L., Brown, M. E., Holman, M. and Malhotra, R. (2004) The Size\nDistribution of Trans-Neptunian Bodies. Astronomical Journal 128: 1364–1390.\nBinney, J., and Tremaine, S. (1988) Galactic Dynamics, Princeton University Press, Princeton, US.\nBooth, M., Wyatt, M. C., Morbidelli, A., Moro-Martı́n, A. and Levison, H. F. (2009) The history of the solar\nsystem's debris disc: observable properties of the Kuiper belt. Monthly Notices of the Royal Astronomical\nSociety 399: 385–398.\nBottke, W. R., Durda, D. D., Nesvorny, D., Jedicke, R., Morbidelli, A., Vokrouhlicky D. and Levison, H. F.\n(2005) The Fossilized Size Distribution of the Main Asteroid Belt. Icarus: 175, 111–140.\nBrasser, R., Duncan, M. J., Levison, H. F., Schwamb, M. E., & Brown, M. E. (2011) Reassessing the\nformation of the inner Oort cloud in an embedded star cluster. Icarus, in press (arXiv:1110.5114).\nBurchell, M. J., Mann, J. R., & Bunch, A. W. (2004) Survival of bacteria and spores under extreme shock\npressures. Monthly Notices of the Royal Astronomical Society 352: 1273-1278.\nCanup, R. M. (2004) Simulations of a late lunar-forming impact. Icarus 168: 433–456.\n\n\f– 23 –\nChapman, C. R., Cohen, B. A. and Grinspoon, D. H. (2007) What are the real constraints on the existence\nand magnitude of the late heavy bombardment? Icarus 189: 233–245\nDones, L., Gladman, B., Melosh, H. J., Tonks, W. B., Levison, H. F. and Duncan, M. (1999) Dynamical\nLifetimes and Final Fates of Small Bodies: Orbit Integration vs Opik Calculations. Icarus 142: 509–524.\nDones, L., Weissman, P. R., Levison, H. F. and Duncan, M. J. (2004) Oort cloud formation and dynamics.\nIn Comets II, edited by M. C. Festou, H. U. Keller and H. A. Weaver, University of Arizona Press, Tucson,\npp. 153–174.\nDormand, J.R., El-Mikkawy, A. and Prince, P.J. (1987) High-Order Embedded Runge-Kutta-Nystrom Formulae. Journal of Numerical Analysis 7: 423–430.\nElsila, J. E., Glavin, D. P., & Dworkin, J. P. (2009) Cometary glycine detected in samples returned by\nStardust. Meteoritics and Planetary Science 44: 1323–1330.\nFritz, J., Artemieva, N., & Greshake, A. (2005) Ejection of Martian meteorites. Meteoritics and Planetary\nScience, 40, 1393–1411.\nGarcia, R. and Gomez, G. (2007) A Note on the Weak Stability Boundary. Celestial Mechanics and Dynamical Astronomy 97: 87–100.\nGladman, B. J. (1997) Destination: Earth. Martian Meteorite Transfer. Icarus 130: 228–246.\nGuckenheimer, J. and Holmes, P. (1983) Nonlinear Oscillations, Dynamical Systems, and Bifucations of\nVector Fields, Springer Verlag.\nHarrison, T. M., Blichert-Toft, J., Müller, W., et al. (2005) Heterogeneous Hadean Hafnium: Evidence of\nContinental Crust at 4.4 to 4.5 Ga. Science 310: 1947–1950.\nHayashi, C. (1981) Structure of the Solar Nebula, Growth and Decay of Magnetic Fields and Effects of\nMagnetic and Turbulent Viscosities on the Nebula. Progress of Theoretical Physics Supplement 70: 35–53.\nHazell PJ, Beveridge C, Groves K, Appleby-Thomas G. (2010) The shock compression of microorganismloaded broths and emulsions: Experiments and simulations. International Journal of Impact Engineering\n37: 433440.\nHernquist, L. (1990) An Analytical Model for Spherical Galaxies and Bulges. Astrophysical Journal 356:\n359–364.\nHorneck, G. (1993) Responses of Bacillus Subtilis Spores to Space Environment: Results from Experiments\nin Space. Origins of Life and Evolution of the Biosphere 23: 37-52.\nHorneck, G., Stöffler, D., Ott, S., Hornemann, U., Cockell, C. S. et al. (2008) Microbial Rock Inhabitants\nSurvive Hypervelocity Impacts on Mars-Like Host Planets: First Phase of Lithopanspermia Experimentally\nTested. Astrobiology 8: 17–44.\nIglesias-Groth, S., Cataldo, F., Ursini, O., & Manchado, A. (2011) Amino acids in comets and meteorites:\nstability under gamma radiation and preservation of the enantiomeric excess. Monthly Notices of the Royal\nAstronomical Society 410: 1447–1453.\nKeyon, S. J., Bomley, B. C., O'Brien, D. P. and Davis, D. R. (2008) Formation and Collisional Evolution\n\n\f– 24 –\nof Kuiper Belt Objects. In The Solar System Beyond Neptune, edited by A. Barucci, H. Boehnhardt, D.\nCruikshank and A. Morbidelli, University of Arizona Press, Tucson, pp. 293–313.\nKleine, T., Palme, H., Mezger, K., & Halliday, A. N. (2005) Hf-W Chronometry of Lunar Metals and the\nAge and Early Differentiation of the Moon. Science, 310, 1671–1674.\nLada, C. J., & Lada, E. A. (2003) Embedded Clusters in Molecular Clouds. Annual Review of Astronomy\n& Astrophysics 41: pp.57–115.\nLattelais, M., Pauzat, F., Pilmé, J., Ellinger, Y., & Ceccarelli, C. (2011) About the detectability of glycine\nin the interstellar medium. Astronomy & Astrophysics 532: A39\nLevison, H. F., Duncan, M. J., Brasser, R., & Kaufmann, D. E. (2010) Capture of the Sun's Oort Cloud\nfrom Stars in Its Birth Cluster. Science 329: 187.\nLugmair, G. W., & Shukolyukov, A. (2001) Early solar system events and timescales. Meteoritics and\nPlanetary Science 36: 1017–1026.\nMarsden, J. and Ross, S. (2006) New Methods in Celestial Mechanics and Mission Design. Bull. Amer.\nMath. Soc. 43: 43.\nMcSween, H. Y., Jr. (1976) A new type of chondritic meteorite found in lunar soil. Earth and Planetary\nScience Letters 31: 193-199.\nMelosh, H. J. (2003) Exchange of Meteorites (and Life?) Between Solar Systems. Astrobiology 3: 207–215.\nMeylan, G., & Heggie, D. C. (1997) Internal dynamics of globular clusters. The Astronomy and Astrophysics\nReview, 8: 1–143.\nMeyer, C., Fritz, J., Misgaiski, M., et al. (2011) Shock experiments in support of the Lithopanspermia theory:\nThe influence of host rock composition, temperature, and shock pressure on the survival rate of endolithic\nand epilithic microorganisms. Meteoritics and Planetary Science, 46, 701–718.\nMojzsis, S. J., Arrhenius, G., McKeegan, K. D., et al. (1996) Evidence for life on Earth before 3,800 million\nyears ago. Nature 384: 55–59.\nMojzsis, S. J., Harrison, T. M. and Pidgeon, R. T. (2001) Oxygen-isotope evidence from ancient zircons for\nliquid water at the Earth's surface 4,300Myr ago. Nature 409: 178–181.\nMoro-Martı́n, A. and Malhotra, R. (2005) Dust Outflows and Inner Gaps Generated by Massive Planets in\nDebris Discs. Astrophysical Journal 633: 1150–1167.\nPierazzo, E., & Chyba, C. F. (1999) Amino acid survival in large cometary impacts. Meteoritics and\nPlanetary Science 34: 909–918.\nPierazzo, E., & Chyba, C. F. (2006) Impact Delivery of Prebiotic Organic Matter to Planetary Surfaces.\nComets and the Origin and Evolution of Life, Advances in Astrobiology and Biogeophysics, Springer, 137.\nRacca, G. D. (2003) New Challenges to Trajectory Design by the Use of Electric Propulsion and Other\nMeans of Wandering in the solar system. Celestial Mechanics and Dynamical Astronomy 85: 1–24.\nSchopf, J. W. (1993) Microfossils of the Early Archean Apex Chert: New Evidence of the Antiquity of Life.\nScience 260: 640–646.\n\n\f– 25 –\nSchröder, C., Rodionov, D. S., McCoy, T. J., et al. (2008) Meteorites on Mars observed with the Mars\nExploration Rovers Journal of Geophysical Research (Planets) 113: 6.\nSmale, S. (1967) Differential Dynamical Systems. Bull. AMS 73: 747-817.\nStöffler, D., Horneck, G., Ott, S., Hornemann, U., Cockell, C. S. et al. (2007) Experimental Evidence for the\nPotential Impact Ejection of Viable Microorganisms from Mars and Mars-Like Planets. Icarus 186: 585–588.\nStrom, R. G., Malhotra, R., Ito, T., Yoshida, F., & Kring, D. A. (2005) The Origin of Planetary Impactors\nin the Inner Solar System. Science 309: 1847 1850.\nTera, F., Papanastassiou, D. A. and Wasserburg, G. J. (1974) Isotopic evidence for a terminal lunar cataclysm. Earth and Planetary Science Letters 22: 1.\nTsiganis, K., Gomes, R., Morbidelli, A., & Levison, H. F. (2005) Origin of the orbital architecture of the\ngiant planets of the Solar System. Nature 435: 459–461.\nValtonen, M., Nurmi, P., Zheng, J.-Q., et al. (2009) Natural Transfer of Viable Microbes in Space from\nPlanets in Extra-Solar Systems to a Planet in our Solar System and Vice Versa. Astrophysical Journal 690:\n210–215.\nWacey, D., Kilburn, M. R., Saunders, M., Cliff, J. and Brasier, M. D. (2011) Microfossils of sulphurmetabolizing cells in 3.4-billion-year-old rocks of Western Australia. Nature Geosciences, DOI: 10.1038/NGEO1238.\nWeidenschilling, S. J. (1977) The Distribution of Mass in the Planetary System and Solar Nebula. Astrophys.\nSpace Sci. 51: 153–158.\nWilde, S. A., Valley, J. W., Peck, W. H., & Graham, C. M. (2001) Evidence from detrital zircons for the\nexistence of continental crust and oceans on the Earth 4.4Gyr ago. Nature 409: 175–178\nWillis, M. J., Ahrens, T. J., Bertani, L. E., & Nash, C. Z. (2006) Bugbustersurvivability of living bacteria\nupon shock compression. Earth and Planetary Science Letters 247: 185–196.\nXia, Z. (1992) Melnikov Method and Transversal homoclinic Points in the Restricted Three-Body problem.\nJDE 96: 170.\n\n\f– 26 –\n\nTable 1. Weak capture probability from Monte Carlo simulationsa\nCase\n\nMass of source\nstar m1 (M )\n\nMass of target\nstar m∗1 (M )\n\nNumber of\ntrajectories\n\nWeak Capture\nProbability\n\n1\n2\n3\n\n1\n1\n0.5\n\n1\n0.5\n1\n\n5*106\n5*106\n5*106\n\n0.15%\n0.05%\n0.12%\n\na\n\nAll cases assume a cluster with N = 4300 members and cluster properties\ndescribed in Section 4.2.\n\n\f– 27 –\n\nTable 2. Estimated number of weak transfer events between the Sun and its closest\ncluster neighbora\nCase\n\nq1\n\nq2\n\nA\nB\nC\nD\n\n4.3 3.5\n3.3 3.5\n2.7 3.5\n4.3 1.1\n\nD0\n(km)\n\nND>26cm b\n\nNR c\n\nNWTE (m∗1 = 1)d\n(N=4300)\n\n100\n2\n2\n100\n\n1.8*1021\n2.7*1020\n8.1*1018\n5.5*108\n\n1.8*1019\n2.7*1018\n8.1*1016\n5.5*106\n\n2.7*1016\n4.0*1015\n1.2*1014\n8.2*103\n\na\n\nConsidering four different cases (A, B, C, D) for the planetesimal size distribution. The size distribution is a broken power-law\ngiven by dN/dD ∝ D−q1 for D > D0 and dN/dD ∝ D−q2 if D<D0 ,\nwith Dmax = 2000 km (∼ Pluto's size) and Dmin = 1 μm (∼ dust\nblow-out size).\nb\n\nND>26cm is the total number of planetesimals with a diameter\nD > 26 cm , equivalent to masses > 10 kg (assuming ρ = 1\ng/cm−3 ).\nc\n\nNR is the expected number of planetesimals with a diameter\nD > 26 cm that populated the primordial Oort Cloud, estimated\nto be ∼1% of ND>26cm .\nNWTE (m∗1 = 1) is the number of weak transfer events between\nthe Sun and a neighboring solar-type cluster star with m∗1 = 1\nM and assuming the cluster has N = 4300 members; this is calculated multiplying NR by the weak capture probability in Table\n1 corresponding to m∗1 = 1 M , i.e. NR ×1.5*10−3 .\nd\n\n\f– 28 –\nFIGURE CAPTIONS\n\nrp* Δ* *\nP2\nP1*\nRcap(m1* )\nWeak Stability Boundary\nfor capture (σ *= 1 km/s)\nP0\n\nP2\n\nΔ\nP1\n\nResc(m1)\nWeak Stability Boundary\nfor escape (σ = 0.1 km/s)\n\nFig. 1. Schematic representation of the weak transfer process. It consists on a meteoroid weakly\nescaping from a planetary system, and its subsequent weak capture by a neighboring planetary system in\nSunday, September 4, 2011\nthe stellar cluster. The meteoroid P0 flybys planet P2 and weakly escapes the central star P1 at a distance\nResc (m1 ). Resc (m1 ) is approximately where the the weak stability boundary of P1 is located, caused by the\ngravitational perturbation of the other N − 1 stars in the cluster. The motion in this region is chaotic and\nlies in the transition between capture and escape from P1 . The meteoroid P0 is then weakly captured by\nthe neighboring cluster star P1∗ at a distance Rcap (m∗1 ), moving to periapsis rp∗ with respect to P1∗ (motion\nprojected onto a plane). The numerical computation pieces together trajectories from flyby of P2 to the\ndistance Resc (m1 ) from P1 using RP 3D and from Resc (m1 ) to the distance Rcap (m∗1 ) from P1∗ . It has been\ndemonstrated that the piecing together of solutions of two different three-body problems at W SB(P1 ) and\nW SB(P1∗ ) can be done in a well defined and smooth manner (see Belbruno, 2004; Marsden & Ross, 2006).\n\n\f– 29 –\n\nFig. 2. Velocity distribution of 670 low-velocity test particles escaping from the solar system. The\nnumerical model is the planar circular restricted three-body problem of the Sun, Jupiter and a massless\nparticle.\n\n107\n\n⎫cluster\n⎬ radius\nN=100 ⎭\nN=4300⎫mean\nN=1000\n⎬interstellar\nN=100\n⎭distance\n\nN=4300\nN=1000\n\nSpatial Scale (AU)\n\n106\n105\n104\n\nResc (σ\n\n= 0.1\n\nkm/s)\n\n.3 km\n\n103\n102\n101\n\n=0\nResc (σ\nRcap (σ\n\n0.1\n\n/s)\n\n/s)\n\n= 1 km\n\n1\nStellar Mass (MSun)\n\n10\n\nFig. 3. The diagonal solid lines plot the spatial scale of the weak stability boundary for escape,\nResc (m1 ) = 2Gm1 /σ 2 , as a function of stellar mass, m1 , for two values of the escape velocity, σ = 0.1 and\n0.3 km/s. The diagonal dashed line plots the weak stability boundary for capture, Rcap (m∗1 ) = 2Gm∗1 /U 2 , for\nthe average relative velocity of stars in the cluster, U = 1 km/s. The horizontal dashed-dotted lines indicate\n\nSunday, September 4, 2011\n\n\f– 30 –\nthe spatial scale of star clusters, Rcluster , while the horizontal dotted lines indicate the mean interstellar\ndistance, D, for clusters consisting of N=100, N=1000 and N = 4300 members.\n\n100\nPIMF(m1*)\n\n10-1\n\n⎫Gf(Rcap/D)2\n⎬\n⎭\n\nProbability\n\n10-2\n10-3\n\n100\nN= 1000\nN= 4300\nN=\n100\nN= 1000\nN= 4300\nN=\n\n10-4\n10-5\n\n⎫Gf(Rcap/D)2 ×\n⎬PIMF(m1* )2/3\n⎭\n\n10-6\n0.1\n\n1\nm1*(MSun)\n\n10\n\nFig. 4. The diagonal dashed lines plot the probability for weak capture of meteoroids, Gf (Rcap /D)2 ,\nas a function of the target stellar mass (m∗1 ), for three values of the number of stars in a star cluster. For\nGf , we take the conservative value of 2. The solid lines plot the probability for weak capture of meteoroids\nby a neighbor star of stellar mass equal to that of the source star (m1 = m∗1 ). The symbols indicate the\nstellar mass distribution.\nTuesday, September 6, 2011\n\n\fy (4⋅105 km)\n\n– 31 –\n\n•\n\n☾\n\n•\n\n⊕\n\nx (4⋅105 km)\n\nFig. 5. Weak transfer of the spacecraft Hiten from the Earth (located at (0,0)) to the Moon (located\nat (-1,0)) via the lunar weak stability boundary. This is an Earth-Moon fixed rotating coordinate system,\nSunday, December\n2011Earth-Moon plane. The time of travel is 80 days, 14 hours. The x-axis and y-axis are in\nprojected\nonto 4,the\n5\nunits of 4×10 km.\n\n\fKepler Energy (km2 s−2)\n\n– 32 –\n\nTime (days)\nFig. 6. Kepler energy of the spacecraft Hiten with respect to the Moon (in units of km2 s−2 ) as a\nfunction of time (in units of days) along the trajectory shown in Fig. 5.\nSunday, December 4, 2011\n\n0.06\nC apt ur e C ondit ions\n\nN or maliz e d Fr e q ue nc y\n\n0.05\n\nA ll C as e s\n\n0.04\n\n0.03\n\n0.02\n\n0.01\n\n0\n0.02\n\n0.04\n\n0.06\n\n0.08\n\n0.1\n0.12\nr 0 / 1 ( pc )\n\n0.14\n\n0.16\n\n0.18\n\n0.2\n\nFig. 7. Results from Monte Carlo simulations of 5 million trajectories between a star P1 of mass\n\n\f– 33 –\nm1 = 1 M and star P1∗ of mass m∗1 = 1 M (Case 1). The Figure shows the probability density function\n(normalized to 1) of the initial separation between P0 and P1 (r0/1 = |r0/1 | at t = 0).\n0.25\nC apt ur e C ondit ions\nA ll C as e s\nN or maliz e d Fr e q ue nc y\n\n0.2\n\n0.15\n\n0.1\n\n0.05\n\n0\n\n0\n\n0.5\n\n1\nv0 / 1 ( k m/s )\n\n1.5\n\n2\n\nFig. 8. Results from Monte Carlo simulations of 5 million trajectories between a star P1 of mass\nm1 = 1 M and star P1∗ of mass m∗1 = 1 M (Case 1). The Figure shows the probability density function\n(normalized to 1) of the initial velocity of P0 with respect to P1 (v0/1 = |v0/1 | at t = 0).\n\nN or m aliz e d\nFr e q ue nc y\n\n0.06\n0.04\n0.02\n\n0\n\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n1.2\nv 1 ( k m/s )\n\n1.4\n\n1.6\n\n1.8\n\n2\n\nCapt ur e C ondit ions\n\n0.08\nNor maliz e d\nFr e q ue nc y\n\nAll C as e s\n0.06\n0.04\n0.02\n0\n\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n1.2\nv 1! ( k m/s )\n\n1.4\n\n1.6\n\n1.8\n\n2\n\nFig. 9. Results from Monte Carlo simulations of 5 million trajectories between a star P1 of mass\nm1 = 1 M and star P1∗ of mass m∗1 = 1 M (Case 1). The Figure shows the probability density function\n\n\f– 34 –\n(normalized to 1) of the initial inertial velocities of P1 and P1∗ with respect to the cluster center (v1 = |v1 |\nand v1∗ = |v1∗ | at t = 0).\n\nN or maliz e d\nFr e q ue nc y\n\n0.04\n0.03\n0.02\n0.01\n0\n\nï150\n\nï100\n\nï50\n\n0\nφ 0 ( de g)\n\n50\n\n100\n\n150\n\nCapt ur e C ondit ions\n\n0.2\nNor maliz e d\nFr e q ue nc y\n\nAll C as e s\n0.15\n0.1\n0.05\n0\n\n0\n\n20\n\n40\n\n60\n\n80\n100\nθ 0 ( de g)\n\n120\n\n140\n\n160\n\n180\n\nFig. 10. Case 1: Probability density function of the initial orientation of P0 about P1 (φ0 and θ0 are\nthe spherical angles). The integral under the curve is 1.\n0.16\nC apt ur e C ondit ions\n\nN or maliz e d Fr e q ue nc y\n\n0.14\n\nA ll C as e s\n\n0.12\n0.1\n0.08\n0.06\n0.04\n0.02\n0\n\n0\n\n20\n\n40\n\n60\n\n80\n100\nθ ( de g)\n\n120\n\n140\n\n160\n\n180\n\nFig. 11. Case 1: Probability density function of the angular separation between initial velocities of\nP1 , P1∗ . The integral under the curve is 1.\n\n\f– 35 –\n0.06\nC apt ur e C ondit ions\n\nN or maliz e d Fr e q ue nc y\n\n0.05\n\nA ll C as e s\n\n0.04\n\n0.03\n\n0.02\n\n0.01\n\n0\n0.02\n\n0.04\n\n0.06\n\n0.08\n\n0.1\n0.12\nr 0 / 1 ( pc )\n\n0.14\n\nFig. 12. Same as Figure 7 but for Case 2, with m1 = 1 M\n\n0.16\n\n0.18\n\n0.2\n\nand m∗1 = 0.5 M .\n\n0.25\nC apt ur e C ondit ions\nA ll C as e s\nN or maliz e d Fr e q ue nc y\n\n0.2\n\n0.15\n\n0.1\n\n0.05\n\n0\n\n0\n\n0.5\n\n1\nv0 / 1 ( k m/s )\n\nFig. 13. Same as Figure 8 but for Case 2, with m1 = 1 M\n\n1.5\n\n2\n\nand m∗1 = 0.5 M .\n\n\f– 36 –\n\nN or m aliz e d\nFr e q ue nc y\n\n0.06\n0.04\n0.02\n\n0\n\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n1.2\nv 1 ( k m/s )\n\n1.4\n\n1.6\n\n1.8\n\n2\n\nCapt ur e C ondit ions\n\n0.08\nNor maliz e d\nFr e q ue nc y\n\nAll C as e s\n0.06\n0.04\n0.02\n0\n\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n1.2\nv 1! ( k m/s )\n\n1.4\n\nFig. 14. Same as Figure 9 but for Case 2, with m1 = 1 M\n\n1.6\n\n1.8\n\n2\n\nand m∗1 = 0.5 M .\n\nN or maliz e d\nFr e q ue nc y\n\n0.04\n0.03\n0.02\n0.01\n0\n\nï150\n\nï100\n\nï50\n\n0\nφ 0 ( de g)\n\n50\n\n100\n\n150\n\nCapt ur e C ondit ions\n\n0.2\nNor maliz e d\nFr e q ue nc y\n\nAll C as e s\n0.15\n0.1\n0.05\n0\n\n0\n\n20\n\n40\n\n60\n\n80\n100\nθ 0 ( de g)\n\n120\n\nFig. 15. Same as Figure 10 but for Case 2, with m1 = 1 M\n\n140\n\n160\n\n180\n\nand m∗1 = 0.5 M .\n\n\f– 37 –\n0.16\nC apt ur e C ondit ions\n\nN or maliz e d Fr e q ue nc y\n\n0.14\n\nA ll C as e s\n\n0.12\n0.1\n0.08\n0.06\n0.04\n0.02\n0\n\n0\n\n20\n\n40\n\n60\n\n80\n100\nθ ( de g)\n\n120\n\nFig. 16. Same as Figure 11 but for Case 2, with m1 = 1 M\n\n140\n\n160\n\n180\n\nand m∗1 = 0.5 M .\n\n0.35\nC apt ur e C ondit ions\n\nN or m aliz e d Fr e q ue nc y\n\n0.3\n\nA ll C as e s\n\n0.25\n\n0.2\n\n0.15\n\n0.1\n\n0.05\n\n0\n\n0\n\n0.5\n\n1\nv0 / 1 ( k m/s )\n\nFig. 17. Same as Figure 7 but for Case 3, with m1 = 0.5 M\n\n1.5\n\n2\n\nand m∗1 = 1 M .\n\n\f– 38 –\n0.06\nC apt ur e C ondit ions\nA ll C as e s\n\nN or maliz e d Fr e q ue nc y\n\n0.05\n\n0.04\n\n0.03\n\n0.02\n\n0.01\n\n0\n0.02\n\n0.04\n\n0.06\n\n0.08\n\n0.1\n0.12\nr 0 / 1 ( pc )\n\n0.14\n\nFig. 18. Same as Figure 8 but for Case 3, with m1 = 0.5 M\n\n0.16\n\n0.18\n\n0.2\n\nand m∗1 = 1 M .\n\nN or m aliz e d\nFr e q ue nc y\n\n0.08\n0.06\n0.04\n0.02\n0\n\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n1.2\nv 1 ( k m/s )\n\n1.4\n\n1.6\n\n1.8\n\n2\n\nCapt ur e C ondit ions\n\n0.06\nNor maliz e d\nFr e q ue nc y\n\nAll C as e s\n0.04\n\n0.02\n0\n\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n1.2\nv 1! ( k m/s )\n\n1.4\n\nFig. 19. Same as Figure 9 but for Case 3, with m1 = 0.5 M\n\n1.6\n\n1.8\n\n2\n\nand m∗1 = 1 M .\n\n\f– 39 –\n\nN or maliz e d\nFr e q ue nc y\n\n0.04\n0.03\n0.02\n0.01\n0\n\nï150\n\nï100\n\nï50\n\n0\nφ 0 ( de g)\n\n50\n\n100\n\n150\n\nCapt ur e C ondit ions\n\n0.2\nNor maliz e d\nFr e q ue nc y\n\nAll C as e s\n0.15\n0.1\n0.05\n0\n\n0\n\n20\n\n40\n\n60\n\n80\n100\nθ 0 ( de g)\n\n120\n\nFig. 20. Same as Figure 10 but for Case 3, with m1 = 0.5 M\n\n140\n\n160\n\n180\n\nand m∗1 = 1 M .\n\n0.16\nC apt ur e C ondit ions\n\nN or maliz e d Fr e q ue nc y\n\n0.14\n\nA ll C as e s\n\n0.12\n0.1\n0.08\n0.06\n0.04\n0.02\n0\n\n0\n\n20\n\n40\n\n60\n\n80\n100\nθ ( de g)\n\n120\n\nFig. 21. Same as Figure 11 but for Case 3, with m1 = 0.5 M\n\n140\n\n160\n\n180\n\nand m∗1 = 1 M .\n\n\f"}