{"id": "http://arxiv.org/abs/1107.4759v1", "guidislink": true, "updated": "2011-07-24T15:10:26Z", "updated_parsed": [2011, 7, 24, 15, 10, 26, 6, 205, 0], "published": "2011-07-24T15:10:26Z", "published_parsed": [2011, 7, 24, 15, 10, 26, 6, 205, 0], "title": "Electrons surfing on a sound wave as a platform for quantum optics with\n  flying electrons", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1107.4657%2C1107.2655%2C1107.2391%2C1107.2366%2C1107.5175%2C1107.3357%2C1107.3337%2C1107.0122%2C1107.3555%2C1107.4259%2C1107.3335%2C1107.2193%2C1107.3538%2C1107.1893%2C1107.0669%2C1107.0402%2C1107.3913%2C1107.1904%2C1107.4978%2C1107.0502%2C1107.2894%2C1107.1860%2C1107.2859%2C1107.3718%2C1107.3734%2C1107.2707%2C1107.1890%2C1107.3417%2C1107.2827%2C1107.1221%2C1107.3062%2C1107.0029%2C1107.3297%2C1107.1434%2C1107.5097%2C1107.4759%2C1107.3311%2C1107.5765%2C1107.2509%2C1107.2264%2C1107.5958%2C1107.4834%2C1107.3488%2C1107.3383%2C1107.2434%2C1107.3421%2C1107.0614%2C1107.0841%2C1107.1527%2C1107.2800%2C1107.2402%2C1107.1218%2C1107.1243%2C1107.1341%2C1107.1074%2C1107.2075%2C1107.0400%2C1107.4277%2C1107.3340%2C1107.4867%2C1107.3643%2C1107.2830%2C1107.4562%2C1107.5347%2C1107.1917%2C1107.1939%2C1107.3101%2C1107.1097%2C1107.4677%2C1107.2306%2C1107.5414%2C1107.3984%2C1107.2755%2C1107.3839%2C1107.5416%2C1107.3747%2C1107.1774%2C1107.5641%2C1107.5433%2C1107.2426%2C1107.2014%2C1107.0941%2C1107.0411%2C1107.2172%2C1107.3259%2C1107.2617%2C1107.1039%2C1107.0627%2C1107.5553%2C1107.2470%2C1107.5904%2C1107.0273%2C1107.3174%2C1107.4024%2C1107.3631%2C1107.3126%2C1107.0323%2C1107.0543%2C1107.3382%2C1107.4090%2C1107.4136&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Electrons surfing on a sound wave as a platform for quantum optics with\n  flying electrons"}, "summary": "Electrons in a metal are indistinguishable particles that strongly interact\nwith other electrons and their environment. Isolating and detecting a single\nflying electron after propagation to perform quantum optics like experiments at\nthe single electron level is therefore a challenging task. Up to date, only few\nexperiments have been performed in a high mobility two-dimensional electron gas\nwhere the electron propagates almost ballistically. Flying electrons were\ndetected via the current generated by an ensemble of electrons and electron\ncorrelations were encrypted in the current noise. Here we demonstrate the\nexperimental realisation of high efficiency single electron source and single\nelectron detector for a quantum medium where a single electron is propagating\nisolated from the other electrons through a one-dimensional channel. The moving\npotential is excited by a surface acoustic wave, which carries the single\nelectron along the 1D-channel at a speed of 3\\mum/ns. When such a quantum\nchannel is placed between two quantum dots, a single electron can be\ntransported from one quantum dot to the other, which is several micrometres\napart, with a quantum efficiency of emission and detection of 96% and 92%,\nrespectively. Furthermore, the transfer of the electron can be triggered on a\ntimescale shorter than the coherence time T2* of GaAs spin qubits6. Our work\nopens new avenues to study the teleportation of a single electron spin and the\ndistant interaction between spatially separated qubits in a condensed matter\nsystem.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1107.4657%2C1107.2655%2C1107.2391%2C1107.2366%2C1107.5175%2C1107.3357%2C1107.3337%2C1107.0122%2C1107.3555%2C1107.4259%2C1107.3335%2C1107.2193%2C1107.3538%2C1107.1893%2C1107.0669%2C1107.0402%2C1107.3913%2C1107.1904%2C1107.4978%2C1107.0502%2C1107.2894%2C1107.1860%2C1107.2859%2C1107.3718%2C1107.3734%2C1107.2707%2C1107.1890%2C1107.3417%2C1107.2827%2C1107.1221%2C1107.3062%2C1107.0029%2C1107.3297%2C1107.1434%2C1107.5097%2C1107.4759%2C1107.3311%2C1107.5765%2C1107.2509%2C1107.2264%2C1107.5958%2C1107.4834%2C1107.3488%2C1107.3383%2C1107.2434%2C1107.3421%2C1107.0614%2C1107.0841%2C1107.1527%2C1107.2800%2C1107.2402%2C1107.1218%2C1107.1243%2C1107.1341%2C1107.1074%2C1107.2075%2C1107.0400%2C1107.4277%2C1107.3340%2C1107.4867%2C1107.3643%2C1107.2830%2C1107.4562%2C1107.5347%2C1107.1917%2C1107.1939%2C1107.3101%2C1107.1097%2C1107.4677%2C1107.2306%2C1107.5414%2C1107.3984%2C1107.2755%2C1107.3839%2C1107.5416%2C1107.3747%2C1107.1774%2C1107.5641%2C1107.5433%2C1107.2426%2C1107.2014%2C1107.0941%2C1107.0411%2C1107.2172%2C1107.3259%2C1107.2617%2C1107.1039%2C1107.0627%2C1107.5553%2C1107.2470%2C1107.5904%2C1107.0273%2C1107.3174%2C1107.4024%2C1107.3631%2C1107.3126%2C1107.0323%2C1107.0543%2C1107.3382%2C1107.4090%2C1107.4136&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Electrons in a metal are indistinguishable particles that strongly interact\nwith other electrons and their environment. Isolating and detecting a single\nflying electron after propagation to perform quantum optics like experiments at\nthe single electron level is therefore a challenging task. Up to date, only few\nexperiments have been performed in a high mobility two-dimensional electron gas\nwhere the electron propagates almost ballistically. Flying electrons were\ndetected via the current generated by an ensemble of electrons and electron\ncorrelations were encrypted in the current noise. Here we demonstrate the\nexperimental realisation of high efficiency single electron source and single\nelectron detector for a quantum medium where a single electron is propagating\nisolated from the other electrons through a one-dimensional channel. The moving\npotential is excited by a surface acoustic wave, which carries the single\nelectron along the 1D-channel at a speed of 3\\mum/ns. When such a quantum\nchannel is placed between two quantum dots, a single electron can be\ntransported from one quantum dot to the other, which is several micrometres\napart, with a quantum efficiency of emission and detection of 96% and 92%,\nrespectively. Furthermore, the transfer of the electron can be triggered on a\ntimescale shorter than the coherence time T2* of GaAs spin qubits6. Our work\nopens new avenues to study the teleportation of a single electron spin and the\ndistant interaction between spatially separated qubits in a condensed matter\nsystem."}, "authors": ["Sylvain Hermelin", "Shintaro Takada", "Michihisa Yamamoto", "Seigo Tarucha", "Andreas D. Wieck", "Laurent Saminadayar", "Christopher Bäuerle", "Tristan Meunier"], "author_detail": {"name": "Tristan Meunier"}, "author": "Tristan Meunier", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1038/nature10416", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1107.4759v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1107.4759v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "Total 25 pages. 12 pages main text, 4 figures, 5 pages supplementary\n  material", "arxiv_primary_category": {"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.mes-hall", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1107.4759v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1107.4759v1", "journal_reference": null, "doi": "10.1038/nature10416", "fulltext": "1\n\nElectrons surfing on a sound wave as a platform for\nquantum optics with flying electrons\nSylvain Hermelin1, Shintaro Takada2, Michihisa Yamamoto2,3, Seigo Tarucha2,4,\nAndreas D. Wieck5, Laurent Saminadayar1,6, Christopher Bäuerle1 and Tristan Meunier1\n1\n\nInstitut Néel, CNRS and Université Joseph Fourier, 38042 Grenoble,\n\nFrance 2Department of Applied Physics, The University of Tokyo, Tokyo, 113-8656,\nJapan,\n3\n\nERATO-JST, Kawaguchi-shi, Saitama 331-0012, Japan,\n\n4\n\nICORP (International Cooperative Research Project) Quantum Spin Information\n\nProject, Atsugi-shi, Kanagawa, 243-0198, Japan,\n5\n\nLehrstuhl für Angewandte Festkörperphysik, Ruhr-Universität Bochum,\n\nUniversitätsstraβe 150, 44780 Bochum, Germany\n6\n\nInstitut Universitaire de France, 103 boulevard Saint-Michel, 75005 Paris, France\n\nElectrons in a metal are indistinguishable particles that strongly interact with other\nelectrons and their environment. Isolating and detecting a single flying electron\nafter propagation to perform quantum optics like experiments at the single electron\nlevel is therefore a challenging task. Up to date, only few experiments have been\nperformed in a high mobility two-dimensional electron gas where the electron\npropagates almost ballistically 3, 4, 5. Flying electrons were detected via the current\ngenerated by an ensemble of electrons and electron correlations were encrypted in\nthe current noise. Here we demonstrate the experimental realisation of high\nefficiency single electron source and single electron detector for a quantum medium\nwhere a single electron is propagating isolated from the other electrons through a\none-dimensional (1D) channel. The moving potential is excited by a surface acoustic\nwave (SAW), which carries the single electron along the 1D-channel at a speed of\n\n\f2\n\n3μm/ns. When such a quantum channel is placed between two quantum dots, a\nsingle electron can be transported from one quantum dot to the other, which is\nseveral micrometres apart, with a quantum efficiency of emission and detection of\n96 % and 92 %, respectively. Furthermore, the transfer of the electron can be\ntriggered on a timescale shorter than the coherence time T 2 * of GaAs spin qubits6.\nOur work opens new avenues to study the teleportation of a single electron spin and\nthe distant interaction between spatially separated qubits in a condensed matter\nsystem.\nQuantum electron-optics is a field aiming at the realisation of photon experiments with\nflying electrons in nanostructures at the single electron level. Important tools to infer\ncomplex photon correlations inaccessible from ensemble measurements are single\nphoton sources and single photon detectors. In opposition with photons, electrons are\nstrongly interacting particles and they usually propagate in a Fermi sea filled with other\nelectrons. Therefore each electron inevitably mixes with the others of the Fermi sea\nwhich implies that the quantum information stored within the charge or the spin of the\nsingle electron will be lost over short lengths. To perform quantum electron-optics\nexperiments at the single electron level, one therefore needs a single electron source, a\ncontrolled propagating medium and a single electron detector. For charge degree of\nfreedom, it has been proposed that edge states in the quantum Hall effect can serve as a\n1D propagating channel. Due to Coulomb blockade, quantum dots have been\ndemonstrated to be a good single electron source\n\n7, 8\n\nand can also serve as a single\n\nelectron detector. Indeed, once an electron is stored in a quantum dot, its presence can\nbe inferred routinely using charge detection 9. Nevertheless, retrapping the electron in\nanother quantum dot after propagation in an edge state turns out to be extremely\ndifficult and presently all the information extracted from such experiments are coming\nfrom ensemble measurements 10, 11. Here, we demonstrate that a single flying electron –\nan electron surfing on a sound wave - can be sent on demand from a quantum dot via a\n\n\f3\n\n1D quantum channel and retrapped in a second quantum dot after propagation. The 1D\nquantum channel consists of a several micrometre long depleted region in a\ntwo-dimensional electron gas (2DEG). The electron is dragged along by exciting a\nsurface acoustic wave (SAW) and propagates fully isolated from the other electrons\ninside the 1D-channel12. Loading and unloading of the flying electron from the quantum\nchannel into a quantum dot turn out to be highly efficient processes. Moreover, we\ndemonstrate that the transfer of the electron can be triggered with a timescale smaller\nthan the coherence time T 2 * of GaAs spin qubits6. Since both electron spin directions\nare treated on the same foot in the SAW quantum channel, one expects that the spin\ncoherence during the transport is conserved. Naturally, new possibilities will emerge to\naddress the question of scalability in spin qubit systems 6, 14, 15.\n\nTo transport a single electron from one quantum dot to the other separated by a\n3μm 1D-channel (see Fig. 1 and methods section), the following procedure is applied.\nFirst, the region between the two electrodes, which define the 1D channel is fully\ndepleted. As a consequence, direct linear electron transport from one end of the channel\nto the other is blocked since the Fermi energy lies below the potential induced by the\ngates. Second, by applying a microwave excitation to the interdigitated transducer\n(IDT), SAW induced moving quantum dots are generated12 due to the piezo-electric\nproperties of GaAs (see also supplementary materials). Adding a quantum dot to each\nside of the 1D channel and tuning both quantum dots into the single electron regime, it\nis then possible to transport a single electron from one quantum dot across the\n1D-channel and catch it inside the second quantum dot. Stability diagrams for both\nquantum dots as a function of the applied voltage on the two gates controlling the two\nbarriers of the quantum dot are presented in Fig. 2a and Fig. 2b. They demonstrate that\nthe system can be tuned into the few-electrons regime16. As expected, the charge\ndegeneracy lines disappear when the barrier height between each dot and the reservoir is\nincreased (corresponding to voltages on the gate Vb and Vb' more and more negative).\n\n\f4\n\nThis also changes the position of the quantum dot minimum and brings the electron\ncloser to the 1D-channel, to a position where a better transfer to SAW quantum dots is\nexpected.\n\nThe protocol of the single electron source for a SAW quantum channel is a\nsequence made of three dot gate voltage steps (see Fig. 2a). At the working point A on\nFig. 2a, the left quantum dot (the single electron source) is loaded with one electron on a\ntimescale close to microseconds and unresolved with the set-up detection bandwidth. It\nis then brought rapidly to the working point B where the chemical potential of the single\nelectron state lies above the Fermi energy and the coupling to the 1D-channel is\nexpected to be large. The actual position of B is not very crucial as long as the electron\nis sufficiently protected from tunnelling out of the dot and the dot potential high enough\nto facilitate the charging of the electron into the moving SAW dot (see inset of Fig. 2a).\nFor each sequence, the QPC conductance time-trace is recorded to observe single shot\nloading and unloading of the dot. This sequence is repeated one thousand times to\nobtain measurement statistics and the resulting averaged time-traces are presented in\nFig. 2c. An exponential decay of the presence of the electron in the dot as a function of\nthe time spent at working point B is observed in the experimental data corresponding to\na tunnelling time close to 1 second as indicated by the green line. This gate pulsing\nsequence is then repeated by adding a burst of microwave (MW) to the IDT with a pulse\nlength of several tenths of nanoseconds and which is applied one hundred milliseconds\nafter the system is brought into position B. The MW burst creates a moving quantum\ndot, which lifts the electron, initially trapped in the left quantum dot, above the tunnel\nbarrier and drags it out of the quantum dot. This results in a jump in the QPC current as\nshown by the red line.\nIn order to demonstrate that the electron has been loaded into a moving quantum\ndot and not expelled into the reservoir, it is essential to detect the coincidence between\nevents when the electron leaves the single electron source (left dot) and when it is\n\n\f5\n\ntrapped in the single electron detector (right dot). This is realized by a second voltage\npulse sequence on the right dot: when the single electron source is brought in position\nB, the detector dot is armed by pulsing its gates to working point B' where the steady\nstate is the zero electron state and the coupling to the channel is large. At this working\npoint both QPC traces are recorded simultaneously. No charge variation is observed\nduring the first 50 ms where the system is kept in position B. A MW pulse is sent on a\ntime-lag of 50 ms. After the recording, the detector is reinitialized to zero electron at\nworking point A' where the captured electron can tunnel efficiently into the reservoir.\nTypical single shot read out curves are presented in Fig. 3a-d. Coincidences are\nobserved between events when an electron leaves the source quantum dot and an\nelectron is detected in the receiver quantum dot within the same timeslot (Fig. 3a).\nThese events correspond to the scenario where one electron has been loaded in the\nelectron source (left dot), is then transferred in the quantum channel (the moving\nquantum dots) and is received in the detector (right dot). It is worth noting that in\ncomparison to photon detectors here the electron still exists after detection. A set of\nexperiments described in Fig. 3 allows to fully characterize the high quantum efficiency\nof both the single electron source and the single electron detector observed in the\nexperiment: 96 % for the single electron source and 92 % for the single electron\ndetector (see Fig. 3e).\nIn quantum dots, it is possible to load not only one but two electrons. By waiting\nlong enough17, the two electrons will be in a singlet state at zero magnetic field and are\nhence entangled in the spin degree of freedom. The ability to separate the two electrons\nand to bring only one of them to the second quantum dot is of potential interest in order\nto transfer quantum information and is at the essence of the quantum teleportation\nprotocol2, 18, 19, 20. In analogy with photons, this is the equivalence of a two-photon\nentangled source21. Moreover, in contrast to a photon detector, the electron detector can\ndiscriminate easily whether one, two or more electrons left the single electron source\n\n\f6\n\nand are captured in the single electron detector (see Fig. 2a). The protocol consists in\nloading the left dot with exactly two electrons by moving the gates Vb and Vc into the\ntwo-electron regime of the stability diagram. The quantum dot is then tuned towards the\nworking point where loading of the moving quantum dots is possible (point B).\nDifferent possibilities for the emission of electrons into the quantum channel are\nobserved. Indeed, when starting with exactly two electrons in the source dot, one can\nachieve that either exactly one or both electrons are emitted from the source and\nreceived in the detector dot, as shown by the single shot traces for QPC detection of the\ntwo dots (see Fig. 4a-d). The probability of each event varies with the working voltage\npoint B. For very negative gate voltage Vc, about half of the time the two electrons are\nseparated, meaning that only one electron is transferred, and the other half of the time\nthe two electrons are transported (see Fig. 4e). For the events where the two electrons\nleave the dot, the electrons are most probably loaded into two different moving quantum\ndots. More interestingly, when pulsing the gate Vc more positively, a regime can be\nrealized where only one of the two electrons of the left dot is efficiently emitted and\nconsequently captured by the right dot (see Fig. 4e). In this case, the probability of\nsending the two electrons is dramatically reduced to below 3 % and the probability to\neffectively separate the two electrons approaches 90 %.\nIn order to use single electron transfer in quantum operations using spin qubits,\none has to demonstrate that the coherence of the electron spin after the electron transfer\nis preserved. Measurement and coherent manipulations of electron spins can be\nstraightforwardly implemented in our set-up and the spin coherence time T 2 * of an\nensemble of electrons stored in SAW assisted moving quantum dots has been shown to\nbe as long as 25 ns13. A necessary condition to investigate coherent transport of a single\nelectron spin is to be able to trigger the electron transfer within a timescale, which is\nshort compared with T 2 *. Indeed, a microwave pulse of a length of 250 ns corresponds\nto about 700 moving quantum dots and the above described experiments demonstrate\n\n\f7\n\nthe ability to load the electron into one of the moving quantum dots produced by each\nSAW microwave burst. In this last section, we demonstrate that the number of minima\nof the microwave burst in which the electron is loaded can be narrowed down to two.\nFor this purpose, the single electron source voltage sequence is slightly modified. After\nthe charging of the quantum dot, the system is brought to position B (see Fig. 2a)\nslightly on the more negative side with respect to Vc and the duration of the microwave\npulse is shortened to a minimum value of 65 ns. At this voltage position, the barrier\nheight to the quantum channel is increased and the transfer probability of an electron\ninto the quantum channel is as low as 5% when excited with the SAW microwave burst.\nTo trigger the single electron transfer, a 1ns-pulse on gate Vc with a positive value\n(voltage position C in Fig. 2a) is added to this sequence. In Fig. 4f, the evolution of the\nnumber of events where one electron leaves the single electron source and one electron\nis detected in the single electron detector (N 1001 ) is plotted as a function of the delay\nbetween the 1 ns-gate pulse and the 65 ns microwave burst. High transfer probabilities\nreaching 90 % are only observed for time delays around 765 ns, corresponding to the\npropagation time of the surface acoustic wave from the IDT to the dot region. Taking\ninto account the pulse length of the gate and the distance between two minima of the\nSAW, only two moving quantum dots can then be the hosts of the transported electron\nduring the gate pulse as schematically indicated in Fig. 4g. This demonstrates the ability\nto load on demand and in a very reproducible manner one of the two minima of the train\nof moving quantum dots with a single electron during the 1ns-gate pulse. Using a faster\narbitrary waveform generator should allow loading the electron on demand into the\nsame moving quantum dot.\nThe above experiments represent the first milestone towards a new\nexperimental platform to realize quantum optics with flying electrons implemented in\ngated 2DEG heterostructures and transported by surface acoustic waves. High quantum\nefficiency of both the single electron detector and the single electron source are\n\n\f8\n\ndemonstrated and potentially enable to measure all moments of the electron\ncorrelations22. In comparison with other implementations in similar systems, the\npropagating electron is physically isolated from the other conduction electrons of the\nheterostructure. In bringing together two propagating quantum buses separated by a\ntunnel barrier, a beam splitter for flying electrons can be implemented23,24 and Hanbury\nBrown and Twiss type experiments where stronger Coulomb interactions between\nelectrons could be realized. Future experiments should allow coherent spin transfer and\ngive new insight on the feasibility of quantum teleportation protocols and on the\npotential scalability of spin qubits.\n\nMETHODS\n\nThe device is defined by Schottky gates in an n-AlGaAs/GaAs 2DEG based\nheterostructure (2DEG:\n\n, ns ≅ 1.4 × 1011 cm-2 , depth = 90 nm) using\n\nstandard split-gate techniques. The charge configuration of both dots are measured via\nthe conductance of both QPC by biasing it with a DC voltage of 300μV and the current\nis measured with an IV-converter with a bandwidth of 1.4 kHz. The voltage on each\ngate can be varied on a timescale down to μs. In addition, the gate Vc controlling the\ncoupling between the left dot and the 1D channel is connected to a homemade bias-tee\nto allow nanosecond manipulation of the dot potential by means of an arbitrary function\ngenerator (Tektronix AWG 5014). The IDT, which is placed at a distance of\napproximately 2 mm to the left of the sample, is made of 70 pairs of lines, 70 μm in\nlength and 250 nm in width with a repetition of 1 μm. The IDT is oriented perpendicular\nto the direction of the 1D-channel defined along the crystal axis [110] of the GaAs\nwafer and has a frequency bandwidth of approximately 20 MHz. By applying a\nradio-frequency burst to the IDT, a surface acoustic wave is generated which travels\n\n\f9\n\nwith a speed of approximately 3000 m/s across the GaAs crystal. Due to the\npiezo-electric properties of GaAs, the generated moving electrostatic potential can drag\nelectrons along the propagation direction of the SAW13 (see supplementary material).\n\n1. Aspect A., Grangier P., Roger G., \"Experimental Tests of Realistic Local Theories\nvia Bell's Theorem\", Phys. Rev. Lett., 47, 460 (1981)\n2. D. Bouwmeester, J. W. Pan, K. Mattle, M. Eibl, H. Weinfurter and A. Zeilinger,\n\"Experimental quantum teleportation\", Nature 390 (6660), 575-579 (1997)\n3. I. Neder, N. Ofek, Y. Chung, M. Heiblum, D. Mahalu, V. Umansky, \"Interference\nbetween two indistinguishable electrons from independent sources\", Nature 448, 333\n(2007)\n4. M. Henny, S. Oberholzer, C. Strunk, T. Heinzel, K. Ensslin, M. Holland and C.\nSchönenberger, \"The Fermionic Hanbury-Brown & Twiss Experiment\", Science,\n284, 296, (1999)\n5. R. C. Liu, B. Odom, Y. Yamamoto, S. Tarucha, \"Quantum interference in electron\ncollision\", Nature, 391, 263 (1998)\n6. J. R. Petta, A. C. Johnson, J. M. Taylor, E. A. Laird, A. Yacoby, M. D. Lukin, C. M.\nMarcus, M. P. Hanson, A. C. Gossard, \"Coherent manipulation of coupled electron\nspins in semiconductor quantum dots\", Science 309, 2180 (2005).\n7. J. Splettstoesser, S. Ol'khovskaya, M. Moskalets and M. Büttiker \"Electron counting\nwith a two-particle emitter\", Phys. Rev. B. 78, 205110 (2008)\n8. G. Fève, A. Mahé, J.-M. Berroir, T. Kontos, B. Plaçais, D. C. Glattli, A. Cavanna, B.\nEtienne, Y. Jin, \" An On-Demand Coherent Single-Electron Source\", Science 316,\n1169 (2007)\n\n\f10\n\n9. M. Field, C. G. Smith, M. Pepper, D. A. Ritchie, J. E. F. Frost, G. A. C. Jones and D.\nG. Hasko, \"Measurements of Coulomb blockade with a noninvasive voltage probe\",\nPhys. Rev. Lett. 70, 1311 (1993)\n10. Y. Ji, Y.Chung, D. Sprinzak, M. Heiblum, D. Mahalu, H. Shtrikman, \"An electronic\nMach-Zehnder interferometer\", Nature 422, 415 (2003)\n11. P. Roulleau, F. Portier, P. Roche, A. Cavanna, U. Gennser, G. Faini, D. Mailly,\n\" Direct Measurement of the Coherence Length of Edge States in the Integer\nQuantum Hall Regime\", Phys. Rev. Lett. 100, 126802 (2008)\n12. V. I. Talyanskii, J. M. Shilton, M. Pepper, C. G. Smith, C. J. B. Ford, E. H. Linfield,\nD. A. Ritchie, and G. A. C. Jones, \"Single-electron transport in a one-dimensional\nchannel by high-frequency surface acoustic waves\", Phys. Rev. B 56, 15180 (1997)\n13. J. A. H. Stotz, R. Hey, P. V. Santos & K. H. Ploog, \"Coherent spin transport through\ndynamic quantum dots\", Nature Materials 4, 585 (2005)\n14. F.H.L. Koppens, C. Buizert, K.J. Tielrooij, I.T. Vink, K.C. Nowack, T. Meunier,\nL.P. Kouwenhoven and L.M.K. Vandersypen, \"Driven coherent oscillations of a\nsingle electron spin in a quantum dot\", Nature 442, 766-771 (2006)\n15. Hendrik Bluhm, Sandra Foletti, Izahr Neder, Mark Rudner, Diana Mahalu, Vladimir\nUmansky and Amir Yacoby, \"Dephasing time of GaAs electron-spin qubits coupled\nto a nuclear bath exceeding 200 μs\", Nature Physics 7, 109–11, (2011)\n16. E. Buks, R. Schuster, M. Heiblum, D. Mahalu, V. Umansky, \"Dephasing in electron\ninterference by a 'which-path' detector\", Nature 391, 871 (1998)\n17. T. Meunier, I. T. Vink, L. H. Willems van Beveren, K-J. Tielrooij, R. Hanson, F. H.\nL. Koppens, H. P. Tranitz, W. Wegscheider, L. P. Kouwenhoven, L. M. K.\nVandersypen, \"Experimental Signature of Phonon-Mediated Spin Relaxation in a\nTwo-Electron Quantum Dot\", Physical Review Letters 98, 126601 (2007)\n\n\f11\n\n18. M. D. Barrett, J. Chiaverini, T. Schaetz, J. Britton, W.M. Itano, J.D. Jost, E. Knill,\nC. Langer, D. Leibfried, R. Ozeri, and D.J. Wineland, \"Deterministic quantum\nteleportation of atomic qubits\", Nature 429, 737 (2004).\n19. M. Riebe, H. Häffner, C. F. Roos, W. Hänsel, J. Benhelm, G. P. T. Lancaster, T. W.\nKörber, C. Becher, F. Schmidt-Kaler, D. F. V. James and R. Blatt, \"Deterministic\nquantum teleportation with atoms\", Nature 429, 734 (2004).\n20. Nielsen, M. A., and I. L. Chuang, Quantum Computation and Quantum Information,\nCambridge University Press, 2000\n21. R. M. Stevenson, R. J. Young, P. Atkinson, K. Cooper, D. A. Ritchie and A. J.\nShields, \"A semiconductor source of triggered entangled photon pairs\", Nature 439,\n179-182 (2006)\n22. S. Gustavsson, R. Leturcq, B. Simovic, R. Schleser, T. Ihn, P. Studerus, K. Ensslin,\nD. C. Driscoll and A. C. Gossard, \"Counting statistics of single-electron transport in a\nquantum dot\", Phys. Rev. Lett. 96, 076605 (2006)\n23. J. del Alamo and C.C. Eugster, \"Quantum field-effect directional coupler\", APL 56,\n78 (1990).\n24. Tsukada, N., Wieck, A. D. & Ploog, K., Proposal of novel electron wave coupled\ndevices, Appl. Phys. Lett. 56, 2527-2527 (1990).\nAcknowledgements\n\nWe acknowledge technical support from the \"Poles Electroniques\" of the \"Department Nano et MCBT\"\nfrom the Institut Néel as well as Yannick Launay and Pierre Perrier for technical support. M.Y.\nacknowledges financial support by Grant-in-Aid for Young Scientists A (no. 20684011) and ERATO-JST\n(080300000477). S.T. acknowledges financial support from Special Coordination Funds for Promoting\nScience and Technology (NanoQuine), JST Strategic International Cooperative Program, MEXT\nKAKENHI \"Quantum Cybernetics\" and IARPA project \"Multi-Qubit Coherent Operations\" through\nHarvard University.A.D.W. acknowledges expert help from PD Dr. Dirk Reuter and support of the DFG\n\n\f12\n\nSPP1285 and the BMBF QuaHLRep 01BQ1035. C.B. acknowledges financial support from CNRS (DREI)\n- JSPS (no. PRC 424 and L08519). T.M. acknowledges financial support from Marie-Curie ERG 224786.\nWe are grateful to the Nanoscience Foundation of Grenoble, for partial financial support of this work.\n\n\f13\n\nFigure 1 Experimental device and measurement set-up SEM image of the\nsingle electron transfer device and schematic of the experimental setup. Two\nquantum dots, which can be brought into the single electron regime, are\nseparated by a 3μm long 1D-channel as shown in Fig. 1. Each quantum dot is\ncapacitively coupled to a close by quantum point contact (QPC) that is used as\nan electrometer 9. By applying a 65 ns long microwave burst on the interdigitated\ntransducer (IDT, see methods for details), a train of about 150 moving quantum\ndots are created in the 1D channel. Vc is connected to a homemade bias-tee to\nallow nanosecond manipulation of the dot potential.\n\n\f14\n\nFigure 2 Stability diagrams of the two quantum dots and charge detection\na,b, Stability diagram of the left (a) and the right dot (b) obtained via charge\ndetection by varying the gate Vb(b') (gate controlling the coupling to the\nreservoir) and Vc(c') (gate controlling the coupling to the channel). Sweeps in\nVb(b') are fast and are carried out within 1s from +0.15 V to -0.15 V (3ms per\npoint). When the barrier height is made higher (Vb more negative), metastable\ncharge states with timescales longer compared to the Vb(b') sweep time are\nobserved. In the very negative Vb part of the diagram for the right dot, the\nelectrons will finally tunnel out. When the sweep direction of the Vb is reversed\nthese charge detection steps are absent. Inset a, Schematic description of the\ndots+channel electrostatic potential applied by the gates to the electron at\ndifferent points in the stability diagram (see text). c, Average QPC time trace\nalong the voltage sequence of the single electron source. Without the MW burst\napplied on the IDT, we observe a lifetime for the metastable 1 electron charge\nstate of 700ms. Applying a MW burst, the electron in the metastable state is\nforced to quit the quantum dot with very high probability.\n\n\f15\n\nFigure 3 Coincidence between emission and detection of a single electron\nCoincidence between the two single shot QPC time-traces at voltage working\npoint B and B' corresponding to the different events: a, N1001 b N1000 c, N1100\nd, N0000. The position in time of the RF burst is indicated by the black arrow. At\nthis specific time, the small peak (dip) observed on time traces are the result of\nthe SAW induced enhancement (reduction) of the QPC current. Notation Nαβγδ\ncorresponds to the number of events with α (β) electrons in the source dot\nbefore (after) the MW burst and to γ (δ) electrons in the receiver dot before (after)\nthe MW burst. When one index is replaced by x, the corresponding output result\nis disregarded. Event N1000 corresponds to the situation where the electron has\nbeen transferred from the source to the detector and is immediately kicked out of\nthe detector dot by the same RF burst and hence not detected. Events where\nβ+δ > α+γ, are called a \"bad\" event. e, Summary table of the different events over\n10001 traces for different experimental situations: (1) an electron is loaded in the\nsource and a RF burst is applied, (2) an electron is loaded in the source dot and\nno RF burst is applied, (3) no electron is loaded in the source dot and a RF burst\nis applied, (4) an electron is loaded in the source dot close to the degeneracy\npoint (DP) with a probability of tunnelling into the dot equal to 1/2 and a RF burst\nis applied, (5) an electron is loaded in the source dot close to the DP with a\nprobability of tunnelling into the dot equal to 1/6 and a RF burst is applied. The\npresented set of data allows to conclude that the transfer of a single electron is\nachieved and to determine the quantum efficiency of the source (detector) equal\nto 96% (92%).\n\n\f16\n\nFigure 4 Coincidence between emission and detection of two electrons a,\nCoincidence between the two single shot QPC time-traces at voltage working\npoint B and B' corresponding to the different events: a, N2100 b N2101 c, N2001\nd, N2002. e, Summary table of the different events over 1005 traces for different\nexperimental situations: (1) two electrons are loaded in the source dot and a RF\nburst is applied with Vc=-0.388 V. (2) two electrons are loaded in the source dot\nand a RF burst is applied with Vc=-0.322 V. The presented set of data allows to\nconclude that the two electrons from a singlet state in a single dot can be\nseparated into the two distant dots with an efficiency close to 90%. f, Triggered\nnanosecond electron transfer. f, Evolution of the number of the N1001 and\nN10xx events as a function of the delay between the 1ns-gate pulse and the\n65ns-microwave burst when a single electron is loaded into the single electron\nsource. g, Schematic description of the timing sequence between 1ns-gate\npulse and MW busrt applied on the IDT.\n\n\f17\n\nFig1\n\n\f18\n\nFig2\n\n\f19\n\nFig3\n\n\f20\n\nFig4\n\n\f1\n\nSupplementary online material to\nElectrons surfing on a sound wave as a platform for\nquantum optics with flying electrons\nSylvain Hermelin1, Shintaro Takada2, Michihisa Yamamoto2,3, Seigo Tarucha2,4,\nAndreas D. Wieck5, Laurent Saminadayar1,6, Christopher Bäuerle1, and Tristan\nMeunier1\n1\n\nInstitut Néel, CNRS and Université Joseph Fourier, 38042 Grenoble,\n\nFrance 2Department of Applied Physics, The University of Tokyo, Tokyo, 113-8656,\nJapan,\n3\n\nERATO-JST, Kawaguchi-shi, Saitama 331-0012, Japan,\n\n4\n\nICORP (International Cooperative Research Project) Quantum Spin Information\n\nProject, Atsugi-shi, Kanagawa, 243-0198, Japan,\n5\n\nLehrstuhl für Angewandte Festkörperphysik, Ruhr-Universität Bochum,\n\nUniversitätsstraβe 150, 44780 Bochum, Germany\n6\n\nInstitut Universitaire de France, 103 boulevard Saint-Michel, 75005 Paris, France\n\nCalibration of the SAW excitation\nThe SAW transducer is placed approximately 2mm away from the center of the sample\nand were realized by electron beam lithography and standard lift-off technique using a\ntitanium-gold metallic layer. The distance between adjacent fingers is 500 nm (half\nwave length). RF characterization at room temperature showed a resonance frequency\naround 2.6 GHz. Characterization at 100 mK was realized in two steps. First the\nconductance of the left quantum dot was measured using a low frequency lock-in\ntechnique in voltage bias regime. Fig. S1 shows the measured current when the RF\n\n\f2\n\nsignal is applied to the IDT with a duty cycle 1:50 at 1 dBm, while scanning the RF\nfrequency and the plunger gate of the dot. A clear resonance can be seen at 2.6326 GHz.\n\nFig. S1 IDT characterization Lock-in current through a quantum dot under SAW\nirradiation (1ms:50ms duty cycle) while scanning through a Coulomb peak. The SAW\nonly acts when the IDT is at its resonance frequency of 2.6326 GHz.\n\nThe working frequency was then fixed at this value. Fig. S2 shows the influence of the\nRF power versus the plunger gate voltage at duty cycle 1:1, which allows to calibrate\nthe SAW amplitude against the RF power at the source and yields an amplitude A[eV] =\n2/25*10^(P[dBm]-23)/20.\nFor the single and two-electron transfer, the RF power applied on the IDT was 14 dBm.\n\n\f3\n\nFig. S2 IDT calibration Current amplitude through a quantum dot under continuous\nSAW irradiation. The SAW amplitude splits the Coulomb peak by increasing the\namplitude of the SAW electrical potential1.\n\n\f4\n\nQuantized SAW current\nIn our set-up, the region between the two electrodes, which define the 1D channel is\nfully depleted. As a consequence, direct linear electron transport from one end of the\nchannel to the other is blocked since the Fermi energy lies below the potential induced\nby the gates. By applying a microwave excitation to the IDT, a SAW induced acoustic\ncurrent can be generated. This has been demonstrated in pioneering experiments by the\nCavendish group2. Indeed, when SAWs are excited at the surface of the heterostructure,\na moving electrostatic potential landscape is generated within the 2DEG. When\nconfined to a one-dimensional channel, moving quantum dots can hence be realized.\nElectrons are trapped in a minimum of the SAW potential and are dragged along the\nminimum of the electric field potential generated by the moving quantum dots.\nTherefore, electron transport from one end of the channel to the other is restored and\nquantized conductance corresponding exactly to an integer number of electrons per\nmoving quantum dots has been observed2.\nThe quantized SAW current corresponding to the transfer of an integer number of\nelectrons per potential minimum in the moving dots has also been observed in our SAW\nset-up. This current quantization, however, requires a potential profile, in which exactly\nan integer number of electrons are captured by each moving potential minimum at the\nentrance of the 1D channel. In our device used for the demonstration of the single\nelectron transfer between the two quantum dots, the 1D channel was made very narrow\n(0.3 μm) and the SAW potential could not catch exactly a single electron at the entrance\nof the 1D channel. Quantized conductance was instead observed by employing a wider\none-dimensional channel. Fig. S3 shows such quantized current through a 0.7 μm wide\nchannel observed at Helium temperature (~4K).\n\n\f5\n\nFig. S3 Quantized SAW current Current through a 0.7 μm wide and 0.8 μm long\nquantum wire under continuous SAW irradiation as a function of the gate voltage Vg of\nthe quantum wire for different RF power at 4 K. Current is plotted in units of ef 0 , with f 0\n= 2.696 GHz.\n\n1. R. J. Schneble, M. Kataoka, C. J. B. Ford, C. H. W. Barnes, D. Anderson, G. A. C.\nJones, I. Farrer, D. A. Ritchie, and M. Pepper , \"Quantum-dot thermometry of\nelectron heating by surface acoustic waves\", Applied Physics Letter 89, 122104\n(2006)\n2. V. I. Talyanskii, J. M. Shilton, M. Pepper, C. G. Smith, C. J. B. Ford, E. H. Linfield,\nD. A. Ritchie, and G. A. C. Jones, \"Single-electron transport in a one-dimensional\nchannel by high-frequency surface acoustic waves\", Phys. Rev. B 56, 15180 (1997)\n\n\f"}