{"id": "http://arxiv.org/abs/1109.2459v1", "guidislink": true, "updated": "2011-09-12T13:29:50Z", "updated_parsed": [2011, 9, 12, 13, 29, 50, 0, 255, 0], "published": "2011-09-12T13:29:50Z", "published_parsed": [2011, 9, 12, 13, 29, 50, 0, 255, 0], "title": "Minimal seeds for shear flow turbulence: using nonlinear transient\n  growth to touch the edge of chaos", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1109.6935%2C1109.5036%2C1109.2136%2C1109.1912%2C1109.4088%2C1109.2743%2C1109.0089%2C1109.6479%2C1109.0990%2C1109.6565%2C1109.4141%2C1109.2787%2C1109.2834%2C1109.0660%2C1109.5255%2C1109.1533%2C1109.1077%2C1109.0955%2C1109.2257%2C1109.5919%2C1109.2025%2C1109.1756%2C1109.6118%2C1109.3273%2C1109.4437%2C1109.3996%2C1109.6841%2C1109.3747%2C1109.5933%2C1109.4728%2C1109.4073%2C1109.2459%2C1109.1441%2C1109.2636%2C1109.3322%2C1109.3980%2C1109.6846%2C1109.2271%2C1109.4932%2C1109.4221%2C1109.2190%2C1109.5407%2C1109.1899%2C1109.6356%2C1109.4074%2C1109.1317%2C1109.0150%2C1109.3603%2C1109.3503%2C1109.1997%2C1109.2962%2C1109.3398%2C1109.6583%2C1109.3396%2C1109.0441%2C1109.1254%2C1109.0732%2C1109.1026%2C1109.0113%2C1109.3817%2C1109.5406%2C1109.3532%2C1109.3250%2C1109.4685%2C1109.5547%2C1109.3853%2C1109.4697%2C1109.2032%2C1109.1885%2C1109.3497%2C1109.2707%2C1109.1953%2C1109.1870%2C1109.1637%2C1109.0964%2C1109.1715%2C1109.3457%2C1109.0484%2C1109.3999%2C1109.6547%2C1109.2736%2C1109.6908%2C1109.2432%2C1109.2612%2C1109.5631%2C1109.2526%2C1109.6592%2C1109.5506%2C1109.3059%2C1109.6474%2C1109.4064%2C1109.2091%2C1109.0125%2C1109.0885%2C1109.0531%2C1109.0717%2C1109.5257%2C1109.4127%2C1109.3084%2C1109.6544%2C1109.3314&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Minimal seeds for shear flow turbulence: using nonlinear transient\n  growth to touch the edge of chaos"}, "summary": "We propose a general strategy for determining the minimal finite amplitude\nisturbance to trigger transition to turbulence in shear flows. This involves\nconstructing a variational problem that searches over all disturbances of fixed\ninitial amplitude, which respect the boundary conditions, incompressibility and\nthe Navier--Stokes equations, to maximise a chosen functional over an\nasymptotically long time period. The functional must be selected such that it\nidentifies turbulent velocity fields by taking significantly enhanced values\ncompared to those for laminar fields. We illustrate this approach using the\nratio of the final to initial perturbation kinetic energies (energy growth) as\nthe functional and the energy norm to measure amplitudes in the context of pipe\nflow. Our results indicate that the variational problem yields a smooth\nconverged solution providing the amplitude is below the threshold amplitude for\ntransition. This optimal is the nonlinear analogue of the well-studied (linear)\ntransient growth optimal. At and above this threshold, the optimising search\nnaturally seeks out disturbances that trigger turbulence by the end of the\nperiod, and convergence is then practically impossible. The first disturbance\nfound to trigger turbulence as the amplitude is increased identifies the\n`minimal seed' for the given geometry and forcing (Reynolds number). We\nconjecture that it may be possible to select a functional such that the\nconverged optimal below threshold smoothly converges to the minimal seed at\nthreshold. This seems at least approximately true for our choice of energy\ngrowth functional and the pipe flow geometry chosen here.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1109.6935%2C1109.5036%2C1109.2136%2C1109.1912%2C1109.4088%2C1109.2743%2C1109.0089%2C1109.6479%2C1109.0990%2C1109.6565%2C1109.4141%2C1109.2787%2C1109.2834%2C1109.0660%2C1109.5255%2C1109.1533%2C1109.1077%2C1109.0955%2C1109.2257%2C1109.5919%2C1109.2025%2C1109.1756%2C1109.6118%2C1109.3273%2C1109.4437%2C1109.3996%2C1109.6841%2C1109.3747%2C1109.5933%2C1109.4728%2C1109.4073%2C1109.2459%2C1109.1441%2C1109.2636%2C1109.3322%2C1109.3980%2C1109.6846%2C1109.2271%2C1109.4932%2C1109.4221%2C1109.2190%2C1109.5407%2C1109.1899%2C1109.6356%2C1109.4074%2C1109.1317%2C1109.0150%2C1109.3603%2C1109.3503%2C1109.1997%2C1109.2962%2C1109.3398%2C1109.6583%2C1109.3396%2C1109.0441%2C1109.1254%2C1109.0732%2C1109.1026%2C1109.0113%2C1109.3817%2C1109.5406%2C1109.3532%2C1109.3250%2C1109.4685%2C1109.5547%2C1109.3853%2C1109.4697%2C1109.2032%2C1109.1885%2C1109.3497%2C1109.2707%2C1109.1953%2C1109.1870%2C1109.1637%2C1109.0964%2C1109.1715%2C1109.3457%2C1109.0484%2C1109.3999%2C1109.6547%2C1109.2736%2C1109.6908%2C1109.2432%2C1109.2612%2C1109.5631%2C1109.2526%2C1109.6592%2C1109.5506%2C1109.3059%2C1109.6474%2C1109.4064%2C1109.2091%2C1109.0125%2C1109.0885%2C1109.0531%2C1109.0717%2C1109.5257%2C1109.4127%2C1109.3084%2C1109.6544%2C1109.3314&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We propose a general strategy for determining the minimal finite amplitude\nisturbance to trigger transition to turbulence in shear flows. This involves\nconstructing a variational problem that searches over all disturbances of fixed\ninitial amplitude, which respect the boundary conditions, incompressibility and\nthe Navier--Stokes equations, to maximise a chosen functional over an\nasymptotically long time period. The functional must be selected such that it\nidentifies turbulent velocity fields by taking significantly enhanced values\ncompared to those for laminar fields. We illustrate this approach using the\nratio of the final to initial perturbation kinetic energies (energy growth) as\nthe functional and the energy norm to measure amplitudes in the context of pipe\nflow. Our results indicate that the variational problem yields a smooth\nconverged solution providing the amplitude is below the threshold amplitude for\ntransition. This optimal is the nonlinear analogue of the well-studied (linear)\ntransient growth optimal. At and above this threshold, the optimising search\nnaturally seeks out disturbances that trigger turbulence by the end of the\nperiod, and convergence is then practically impossible. The first disturbance\nfound to trigger turbulence as the amplitude is increased identifies the\n`minimal seed' for the given geometry and forcing (Reynolds number). We\nconjecture that it may be possible to select a functional such that the\nconverged optimal below threshold smoothly converges to the minimal seed at\nthreshold. This seems at least approximately true for our choice of energy\ngrowth functional and the pipe flow geometry chosen here."}, "authors": ["Chris C. T. Pringle", "Ashley P. Willis", "Rich R. Kerswell"], "author_detail": {"name": "Rich R. Kerswell"}, "author": "Rich R. Kerswell", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1017/jfm.2012.192", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1109.2459v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1109.2459v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "27 pages, 19 figures, submitted to JFM", "arxiv_primary_category": {"term": "physics.flu-dyn", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.flu-dyn", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1109.2459v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1109.2459v1", "journal_reference": null, "doi": "10.1017/jfm.2012.192", "fulltext": "arXiv:1109.2459v1 [physics.flu-dyn] 12 Sep 2011\n\nUnder consideration for publication in J. Fluid Mech.\n\n1\n\nMinimal seeds for shear flow turbulence:\nusing nonlinear transient growth to touch\nthe edge of chaos\nC H R I S C. T. P R I N G L E1 , A S H L E Y P. W I L L I S2\nAND\n\nR I C H R. K E R S W E L L3\n2\n\n1\nDepartment of Earth Sciences, University of Bristol, Bristol, BS8 1RJ\nSchool of Mathematics and Statistics, University of Sheffield, Sheffield, S3 7RH\n3\nDepartment of Mathematics, University of Bristol, Bristol, BS8 1TW.\n\n(Received 27 August 2018)\n\nWe propose a general strategy for determining the minimal finite amplitude disturbance\nto trigger transition to turbulence in shear flows. This involves constructing a variational\nproblem that searches over all disturbances of fixed initial amplitude, which respect the\nboundary conditions, incompressibility and the Navier–Stokes equations, to maximise\na chosen functional over an asymptotically long time period. The functional must be\nselected such that it identifies turbulent velocity fields by taking significantly enhanced\nvalues compared to those for laminar fields. We illustrate this approach using the ratio\nof the final to initial perturbation kinetic energies (energy growth) as the functional and\nthe energy norm to measure amplitudes in the context of pipe flow. Our results indicate\nthat the variational problem yields a smooth converged solution providing the amplitude\nis below the threshold amplitude for transition. This optimal is the nonlinear analogue\nof the well-studied (linear) transient growth optimal. At and above this threshold, the\noptimising search naturally seeks out disturbances that trigger turbulence by the end of\nthe period, and convergence is then practically impossible. The first disturbance found\nto trigger turbulence as the amplitude is increased identifies the 'minimal seed' for the\ngiven geometry and forcing (Reynolds number). We conjecture that it may be possible to\nselect a functional such that the converged optimal below threshold smoothly converges\nto the minimal seed at threshold. This seems at least approximately true for our choice\nof energy growth functional and the pipe flow geometry chosen here.\n\n1. Introduction\nShear flows are ubiquitous in our everyday lives yet predicting their behaviour still remains an outstanding and important issue both scientifically and economically. Typically\nsuch flows become turbulent even though there may be an alternative linearly stable 'basic state', which is the simplest solution consistent with the driving forces and boundary\nconditions. This bistability means that the problem of transition comes down to understanding the laminar-turbulent boundary in phase space that divides initial conditions\nwhich lead to the turbulent state from those which relax back to the basic state. This\nboundary has more generally been labelled the 'edge of chaos', allowing for transient turbulence (Skufca et al. 2006). There have been notable recent successes in tracking parts\nof this boundary which, because it is a hypersurface in phase space, can be approached\nby a simple bisection technique (Itano & Toh 2001, Skufca, Yorke & Eckhardt 2006,\n\n\f2\n\nC.C.T. Pringle, A.P. Willis and R.R. Kerswell\n\nSchneider, Eckhardt & Yorke 2007, Duguet, Willis & Kerswell 2008). As this technique\nis based upon integrating the governing Navier-Stokes equations forward in time, only\nthe parts of the edge near (relative) attractors embedded in the edge are revealed by this\ntracking approach.\nInterestingly, these attracting regions invariably seem to be on perturbation energy levels well above those known to be sufficient to trigger transition. Viswanath & Cvitanovic\n(2009) provide a good illustration of this in a short pipe of length π diameters, which\nthey numerically simulate with 85, 715 degrees of freedom. By only mixing three fixed\nflow fields, they identify initial conditions which experience an O(104 ) magnification of\nthe (perturbation) energy in approaching a travelling wave thought to be embedded in\nthe edge relative attractor (Schneider, Eckhardt & Yorke 2007, Pringle & Kerswell 2007):\nsee their Table 4 for Reynolds number Re = 2000. Duguet, Brandt and Larsson (2010)\ntackle the same question in plane Couette flow, finding evidence for energy growth on\nthe edge of over 102 at Re = 400 for a pair of oblique waves (see their Figure 9 where\nthe plateau edge energy is O(5 × 10−3 )). Initial conditions with low energies on the edge\nrepresent energy-efficient targets to trigger transition, as an infinitesimal perturbation of\nthese states will lead to transition. The most efficient of all perturbations will be the flow\nfield having the lowest energy Ec on the edge, hereafter called the minimal seed for transition, which represents the closest (in perturbation energy norm) point of approach of the\nedge to the basic state in phase space. This represents the most dangerous disturbance\nto the basic state and as a result is of fundamental interest either from the viewpoint of\ntriggering transition efficiently or, oppositely, in designing flow control strategies.\nCurrently, there are no accepted strategies for identifying minimal seeds beyond the\nimpractical 'brute force' approach of surveying all initial conditions. The purpose of this\npaper is to continue to develop a new strategy initiated in Pringle & Kerswell (2010),\nhereafter referred to as PK10, based upon identifying finite-amplitude disturbance fields\nwhich, as they evolve via the full Navier-Stokes equations, maximise a key functional\nover a period of time. This key functional is taken here to be the energy growth of the\ndisturbance over the time period as suggested in PK10 and Cherubini et al. (2010) in the\nboundary layer context. The rationale behind this is the observation that the minimal\nseed must experience considerable energy growth as it evolves in time up to the attracting\nplateau on the edge. In the special case of a unique steady relative attractor on the edge†\nthe minimal seed will be the optimal solution u∗0 (x) to the following variational problem:\nwhich initial condition on the edge (label this set Σ) will experience, for asymptotically\nlong times T , the largest energy growth defined as\nR\nu(x, T )2 dV\n(1.1)\nG(T ) := max R\nu0 ∈Σ u(x, 0)2 dV\nwhere u(x, t) is the flow at time t evolved via the Navier-Stokes equations from the\ninitial condition u(x, 0) = u0 (x) (incompressibility is tacitly assumed throughout) and\nu = (u, v, w) is the perturbation velocity field obtained by subtracting the laminar state\nfrom the total velocity field (invariably used hereafter). The problem with pursuing this\ncriterion is not the fact that the relative edge attractor may have a fluctuating energy\nas these fluctuations are typically small compared to the total growth, but confining\ncompetitor fields to the hard-to-define edge set Σ. A more practical approach can be\nmanufactured by turning the problem around to consider the largest energy growth G\n\n† For instance, in a pipe ≈ 2.5 diameters long at Re = 2400 and within the symmetric\nsubspace R2 ∩ Ω2 ∩ S (see §3.6, Duguet, Willis & Kerswell 2008), the unique edge relative\nattractor is C3 1.25 (later renamed as N2 in Pringle, Duguet & Kerswell 2009).\n\n\f3\nover all initial (incompressible) conditions of a given perturbation energy E0 , that is\nR\nu(x, T )2 dV\nR\n.\n(1.2)\nG(T ; E0 ) :=\nR max\nu0 : u20 dV =2E0 u(x, 0)2 dV\n\nAt precisely E0 = Ec where the edge touches the energy hypersurface at one velocity\nstate, this optimisation problem considers the growth of this state (the minimal seed)\nagainst the energy growth of all the other initial conditions below the edge. Given that\nthese latter initial conditions lead to flows that grow initially but ultimately relax back to\nthe basic state, it is reasonable to hypothesize that the minimal seed remains the optimal\ninitial condition for the revised variational problem. A priori, the minimal seed energy\nEc (Re; geometry) is unknown but a very interesting quantity in its own right, as its behaviour indicates how the basin of attraction of the basic state shrinks with increasing\nRe. Hence, the variational problem (1.2) must be solved as an increasing function of E0\nuntil Ec is reached. Knowing when this has occurred motivates the following hypothesis.\nHypothesis: For asymptotically large T , the minimal seed will be given by the flow\nfield of initial energy E0 which experiences the largest energy growth such that for any\ninitial energies exceeding this E0 = Ec , the energy growth problem (1.2) fails to have a\nsmooth solution.\nThis is actually a very strong statement which really contains two separate but related\nconjectures, the first being a necessary condition for the second.\nConjecture 1: For T sufficiently large, the initial energy value Ef ail at which the energy\ngrowth problem (1.2) first fails (as E0 is increased) to have a smooth optimal solution\nwill correspond exactly to Ec .\nConjecture 2: For T sufficiently large, the optimal initial condition for maximal energy growth at E0 = Ec − ǫ2 converges to the minimal seed at Ec as ǫ → 0.\nThe idea behind the first conjecture is that the optimisation algorithm (1.2), in exploring the E0 -hypersurface for the optimal solution, will detect any state on the energy\nhypersurface that leads to turbulence, given that this leads to the highest values of G.\nOnce the algorithm is dealing with a turbulent endstate at time T , the extreme sensitivity of the final state energy at T to changes in the initial condition, due to exponential\ndivergence of adjacent states, will effectively mean non-smoothness and prevent convergence. Crucially, if true, this means that the failure of the algorithm solving (1.2) should\nidentify Ec regardless of whether the minimal seed is the optimal solution of (1.2) for\nE0 = Ec or not. The key feature for Conjecture 1 to hold is not the precise form of\nthe functional being maximised, but the fact that the functional attains higher values for\ninitial conditions that go turbulent than those in the basin of attraction of the basic state\n(other plausible choices include the final dissipation rate, the total dissipation which has\nrecently been explored with success by Monokrousos et al (2011) in the context of plane\nCouette flow, or more general Sobolev norms which emphasize strain rates). The second,\nstronger conjecture, however, proposes that the optimal initial condition converged at\nE0 < Ec values, approaches the minimal seed as E → Ec . This implies that the energy\ngrowth functional is then a special choice which picks out the minimal seed. We present\nevidence in this paper to support both these conjectures.\nThe variational problem (1.2) in the limit of infinitesimally small energy E0 reduces\n\n\f4\n\nC.C.T. Pringle, A.P. Willis and R.R. Kerswell\n\nto the well-known (linear) transient growth problem (Gustavsson 1991, Butler & Farrell\n1992, Reddy & Henningson 1993, Trefethen et al. 1993, Schmid & Henningson 1994). In\nthis case, the evolution of the initial condition u0 is determined by the linearised NavierStokes equations and there are various ways to proceed: e.g. for a matrix-based approach\nsee Reddy & Henningson (1993) and for a time-stepping approach see, for example,\nLuchini (2000). The optimal that emerges typically shows energy growth factors G that\nscale with Re2 (when optimisation is also carried out over T ) due to the nonnormality of\nthe linearised evolution operator. It has been common practice to assume that this linear\noptimal (LOP) (for vanishing E0 ) is a good approximation to the minimal seed, as the\nenergy of the minimal seed is 'small' compared to that of the basic flow or target turbulent\nflow. It was shown in PK10, however, that the presence of nonlinearity in the variational\nproblem is crucial in revealing new nonlinear optimals (NLOPs) that emerge 'in between'\ni.e. for 0 < E0 < Ec . The calculations of PK10 were directed more at demonstrating\nthe feasibility of including nonlinearity in the transient growth calculation and showing\nthe dramatic manner in which this alters the established linear result than identifying\nthe minimal seed. In particular, T = Tlin was taken where Tlin is the optimal growth\ntime for the linear optimal (LOP) and is not asymptotically large. Numerical limitations\nof the simulation code used in PK10 (written from scratch as part of the first author's\nthesis) also meant that getting close to the edge proved difficult. In this paper, we revisit\nthose calculations using a well-tested parallel code (described in Willis & Kerswell 2009)\nto probe the 'gap' between Ef ail and Ec noticed there.\nThe plan of the paper is as follows. Section 2 formulates the variational problem (1.2)\nand describes briefly the iterative scheme used to solve it. Section 3 analyses for the\nfirst time the mechanism by which the nonlinear optimal (NLOP) which emerged in\nPK10 attains more growth than the linear optimal (LOP). The results of PK10 are then\nextended to higher energies in section 4 to re-examine the reported gap between Ef ail\nand Ec . In section 5, a larger domain is studied using a longer optimisation time to\nprovide a first test of the conjectures discussed above. Our results are summarised and\ndiscussed in section 6 with a glossary of terms following at the end.\n\n2. Formulation\nThe context for our exploration is the problem of constant mass-flux fluid flow through\na cylindrical pipe. With length scales nondimensionalised by half the pipe diameter 12 D\nand velocities by the mean axial velocity U , the laminar flow is given by\nulam = U(s)ẑ = 2(1 − s2 )ẑ\n\n(2.1)\n\nusing cylindrical coordinates (s, φ, z) aligned with the pipe axis. In keeping with the\nmajority of published work, results are reported in time units of D/U . Energies are\nnondimensionalised by the energy of the laminar flow in the same domain. We then\nconsider a perturbation to this laminar profile such that the full velocity field is given by\nU(s)ẑ + u(s, φ, z, t),\nwhere u = (u, v, w) and for convenience define the volume integral\nZ L Z 2π Z 1\nh. . .i =\n. . . sds dφ dz.\n0\n\n0\n\n(2.2)\n\n(2.3)\n\n0\n\nIn order to calculate the initial condition that produces the most energy growth, we use\na variational approach pioneered for the linearised problem (Luchini & Bottaro 1998,\nAndersson, Berggren & Henningson 1999, Luchini 2000, Corbett & Bottaro 2000) but\n\n\f5\nnow recently extended to incorporate the full Navier-Stokes equations (PK10, Cherubini\net al. 2010, Monokrousos et al. 2011: also see Zuccher et al. 2006 for earlier work using\nthe boundary layer equations). The functional we choose is defined as\n\u0015\n\u0014\n2\n2\n1\n1\nL := h 2 u(x, T ) i − λ h 2 u(x, 0) i − E0\nT\n\n\u0014\n\n\u0015\n∂u\n∂u\n1 2\n+U\n+ U ′ uẑ − u × ∇ × u + ∇p −\n∇ u idt\n∂t\n∂z\nRe\n0\nZ T\nZ T\n−\nhΠ∇ * uidt −\nΓ(t)hu * ẑidt.\n(2.4)\n−\n\nZ\n\n0\n\nhν *\n\n0\n\nThis functional will be maximised by the same flow field as problem 1.2. It is equivalent to\nfinding the flow field with greatest energy at time t = T , subject to four conditions applied\nthrough Lagrange multipliers - namely that the initial condition, u(x, 0) has kinetic\nenergy E0 and that it evolves subject to the incompressible Navier-Stokes equations with\nfixed mass flux along the pipe. The last constraint introduces a slight subtlety in that the\npressure field must be subdivided into a time-dependent constant pressure gradient part\nΛ(t)z which adjusts to maintain constant mass flux and a strictly (spatially-) periodic\npart p̂ so that\np := Λ(t)z + p̂(s, φ, z, t).\n\n(2.5)\n\nThe Lagrange multipliers ν = (νs , νφ , νz ), Π and Γ are known as the adjoint variables.\nThe function L will be maximised when all of its variational derivatives are equal to\nzero. Taking variational derivatives leads us to\nδL =\n\nh δu(x, T ) * [u(x, T ) − ν(x, T )] i + h δu(x, 0) * [−λu(x, 0) + ν(x, 0)] i\n\u0015\n\u0014\nZ T\n∂u\n1 2\n∂u\n+U\n+ U ′ uẑ − u × ∇ × u + ∇p −\n∇ u idt\n−\nhδν *\n∂t\n∂z\nRe\n0\n\u0014\nZ T\n∂ν\n∂ν\n+\nhδu *\n+U\n− U ′ νz ŝ + ∇ × (ν × u) − ν × ∇ × u + ∇Π\n∂t\n∂z\n0\n\u0015\n1\n+ ∇2 ν − Γ(t)ẑ idt\nRe\nZ T\nZ T\nZ T\nZ T\n−\nhδΠ∇ * uidt −\nδΓhu * ẑidt +\nhδ p̂∇ * νidt −\nδΛ(t)hν * ẑidt\n0\n0\n0\n0\n\u0015\n\u0014\n(2.6)\n− δλ h 12 u(x, 0)2 i − E0 .\n\nThe nine terms making up the variational derivative can physically be interpreted as\nmeaning that to maximise L : (i) u(x, T ) and ν(x, T ) must satisfy a compatibility condition; (ii) u(x, 0) and ν(x, 0) must satisfy an optimality condition; (iii) u must evolve\naccording to the Navier-Stokes equations; (iv) ν must evolve according to the adjoint\nNavier-Stokes equations; (v) u is incompressible; (vi) u has constant mass flux; (vii) ν is\nincompressible; (viii) ν has constant mass flux; and (ix) the initial kinetic energy is E0\n(respectively as the terms appear in (2.6) ).\nIn order to find a maximum to this problem, an iterative algorithm is employed, seeded\nby an initial flow field u0 := u(x, 0) of appropriate kinetic energy (similar shorthand is\nused henceforth, e.g. ν 0 := ν(x, 0)). By integrating this field forward in time in accordance with the Navier-Stokes equations we can ensure that conditions (iii) and (v) are\nmet. The compatibility condition (ii) is satisfied by fixing ν T = uT , which supplies a fi-\n\n\f6\n\nC.C.T. Pringle, A.P. Willis and R.R. Kerswell\n\nnal condition for the adjoint-Navier-Stokes equations to be integrated backwards in time.\nThis procedure generates ν 0 and ensures conditions (iv) and (vi) are fulfilled. After this\n'forth-and-back' time integration, the only outstanding Euler-Lagrange condition is that\nthe variational (Fréchet) derivative\nδL\n= −λu0 + ν 0\nδu0\n\n(2.7)\n\nshould vanish. As this does not happen automatically, u0 is moved in the ascent direction to increase L and hopefully approach a maximum where it will vanish. An initial\ncondition for the next iteration is given by\nun+1\n= un0 +\n0\n\nǫ δL\n,\nλ δun0\n\n(2.8)\n\nwhere h(δL /δu0 )2 i/λ2 ∼ hu20 i is a convenient rescaling. The one remaining Lagrange\nmultiplier λ is determined by arranging for the new initial condition to satisfy the initial\n)2 i = E0 . It is found that λ ∼ hu2T i/hu20 i, and for the choice\nenergy constraint h 12 (un+1\n0\nǫ = 1 this strategy is equivalent to the power method in the linear case (e.g. Luchini\n2000). In practice for the nonlinear case, the choice ǫ = 1 is usually too large. The\nfollowing simple strategy for the adaptive selection of ǫ was found to be effective:\n• Select an initial value for ǫ, e.g. 0.5.\n• Let\n\u00132 \u001d\u001c\u0012\n\u001c\n\u001d\u001es\u001c\u0012\n\u00132 \u001d\nδL\nδL\nδL\nδL\n*\nd :=\n;\n(2.9)\nδun0 δun+1\nδun0\nδun+1\n0\n0\n• if d > 0.95 so successive adjustments in u0 are essentially aligned then ǫ is doubled,\notherwise, if d < −0.5 (anti-alignment) or\n\u001c\u0012\n\u00132 \u001d\n\u00132 \u001d\n\u001c\u0012\nδL\nδL\n,\n(2.10)\n>4\nδun0\nδun+1\n0\nwhereby the derivative has becomes large, then ǫ is halved.\nClose to apparent convergence, when h(δL /δun0 )2 i is very small, a constant ǫ has sometimes been employed to prevent multiple looping with tiny updates each time.\nThe numerical code used here is based on the well-tested code described in Willis &\nKerswell (2009). A Fourier decomposition is employed in the periodic directions and a\nfinite difference approximation in the radial direction so that a typical dependent variable\nis expanded as follows\nA(sn , φ, z, t) =\n\nMM\nX\n\nLL\nX\n\nAnml (t) exp(imφ + iαlz)\n\nfor\n\nn = 1, 2, . . . , N N\n\nm=−MM l=−LL\n\n(2.11)\nwhere A is real so only half the coefficients (m > 0) need to be stored, α = 2π/L is the\nlongest wavelength allowed by the periodic axial boundary conditions, and sn are the\nroots of a Chebyshev polynomial with finer resolution towards the wall. Typical resolutions used were (M M, N N, LL) = (23, 64, 11) for a 21 π D (PK10) pipe and (23, 64, 37)\nfor a 5 D pipe. Using finite differences in the radius is apt for parallelisation, which\nhas been implemented using MPI. Time integration is performed using a second order\npredictor-corrector method.\nA fast (parallel) numerical code for handling the Navier-Stokes equations and its adjoint is absolutely essential for successfully implementing this iterative approach to optimisation. Each iteration requires integrating the Navier-Stokes equations forward from\n\n\f7\nt = 0 to Topt and the adjoint equations backwards from t = Topt to 0, with typically\nO(103 ) iterations required to be assured of convergence. There are also storage issues to\ncircumvent, as the adjoint Navier-Stokes equations, although linear in ν, depend on u.\nThis either needs to be stored in totality (over the whole volume and time period), which\nis only practical for low resolution short integrations, or must be recalculated piecemeal\nduring the backward integration stage. This latter 'check-pointing' approach requires\nthat u is stored at regular intermediate points, e.g. t = Ti := iTopt /n for i = 1, . . . , n − 1,\nduring the forward integration stage. Then to integrate the adjoint equation backward\nover the time interval [Ti , Ti+1 ], u is regenerated starting from the stored value at t = Ti\nby integrating the Navier-Stokes equations forward to Ti+1 again. The extent of the check\npointing is chosen such that the storage requirement for each subinterval is manageable.\nThe extra overhead of this technique is to redo the forward integration for every backward integration, so approximately a 50% increase in cpu time, assuming forward and\nbackward integrations take the same time. As memory restrictions may make full storage\nimpossible, this is a small price to pay.\n\n3. The Nonlinear Energy Growth Mechanism\nThe basic ingredient for the strategy being explored here is the solution of the variational problem (1.2) at a given initial perturbation energy E0 . PK10 demonstrated the\nfeasibility of this and discovered that the nonlinearly-adjusted linear optimal (LOP: see\nSchmid & Henningson 1994) is quickly outgrown by a completely new type of optimal\n(the NLOP) as E0 increases from 0 (e.g. see figures 1 and 5 in PK10). This NLOP\nexhibits both radial and azimuthal localisation in a short 12 πD-long pipe and would undoubtedly also localise in the axial direction if the geometry allowed. Localisation allows\nthe perturbation to still retain velocities of sufficient amplitude in an adequate volume\nthat nonlinearity is important while permitting the global energy to be reduced. Without\nnonlinearity in the variational problem, any localised state could be decomposed into\nglobal linear optimals (e.g. by Fourier analysis), which would then evolve independently\nand, all except the LOP, sub-optimally. PK10 remarked that the NLOP had a two-phase\nevolution (e.g. see their figure 1) in which the initially-3D optimal firstly delocalises (slices\na and b in their figure 2) followed by a second growth phase in which the flow becomes\nincreasingly 2D (streamwise-independent). We now examine this evolution in more detail\nin order to understand how the NLOP is able to achieve more growth than the LOP.\nA first inspection of the 3D structure of the evolving NLOP actually reveals 3 distinct\nphases of development. Figure 1 shows how the axial structure of the NLOP evolves in\ntime by plotting isocontours of streamwise perturbation velocity along the pipe (isocontours of streamwise vorticity show the same qualitative behaviour). Initially the streaks\nare tightly layered and backward facing i.e. inclined into the shear. By t = 0.4, these\nlayers have been tilted into the mean shear direction (i.e. away from the wall) by the\nshear and unpacked or separated slightly. This is the inviscid Orr mechanism (Orr 1907)\nand gives an initial spurt of energy growth. By t = 1 the flow is then dominated by helical\nwaves growing - the 'oblique' phase - before the flow becomes essentially although not\ncompletely 2D by t = 10 during the 'lift-up' phase. This evolution consisting of the Orr,\noblique and lift-up phases in sequence is also apparently seen for the critical disturbance\nfound by Monokrousos et al (2011) (D.S. Henningson, private communication).\nTo clarify the oblique and lift-up phases, we reduce the considerable degrees of freedom\nof the fully-resolved NLOP evolution down to those that really matter. As the FourierFourier basis functions exp(imφ + iαlz) in the velocity representation naturally partition\nthe linearized problem, we considered the optimal growth calculation at Re = 1750,\n\n\f8\n\nC.C.T. Pringle, A.P. Willis and R.R. Kerswell\n\nFigure 1. The NLOP at Re = 1750 and E0 = 1.8 × 10−5 calculated using resolution\n(MM,NN,LL)=(23, 64, 11) at t = 0 (upper left), t = 0.4 (upper middle), t = 1 (upper right),\nt = 2.5 (lower left), t = 5 (lower middle) and t = 10 D/U (lower right). Isocontours are shown of\nthe streamwise perturbation velocity: yellow (light) 50% of the maximum and red (dark) 50%\nof the minimum. Mean flow in each pipe section is from bottom to top.\n\nTopt = Tlin ≈ 0.0122Re = 21.3 D/U in a pipe length of 21 πD (so PK10 settings) at\nE0 = 1.8 × 10−5 using the full resolution (MM,LL)=(23, 11) and reduced resolutions\n(7, 1), (2, 1) and (1, 1) (full NN=64 radial resolution was used for all). Figure 2 shows\nhow the growth evolves as a function of time for each optimal initial condition. All the\ncalculations bar that for (1, 1) show the distinctive 'shoulder' in the growth centred at\nt ≈ 3 D/U (the time units D/U will be suppressed hereafter), which signifies the end of\nthe (what PK10 called the 'first') delocalisation phase and the start of the next phase.\nThe (1, 1) calculation fails to capture the NLOP at all so that the optimal that emerges\nis just the nonlinear version of the LOP. It is also striking that the (7, 1) optimal is\nquantitatively so similar to the full (23, 11)-optimal indicating that axial wavenumbers\nbeyond the lowest are not important for this short pipe calculation. Drastically reducing\nthe azimuthal resolution to just (2, 1) has a noticeable quantitative effect but still manages\nto preserve the qualitative features of the NLOP. In particular the (2, 1)-optimal (right\nlower, figure 2) captures the essential structure of the (7, 1)-optimal (right upper, figure\n2) which is itself almost identical to the (23, 11)-optimal (upper left of figure 4) (although\nno attempt has been made to match phases of the solutions along the pipe).\nThe temporal evolutions of the modal kinetic energies Eml (t) (defined as the kinetic\nenergy associated with the Fourier-Fourier wavenumbers m, l) for the (7, 1) calculation\nare shown in figure 3 (the equivalent plot for the (2, 1) calculation is qualitatively similar\nbut not shown). The modal energy for streamwise-independent velocities, Em0 , is further\nw\nsplit into that associated with the streamwise velocity, Em0\n, and that with the cross-plane\n\n\f9\n400\n\n350\n\n300\n\nE(t)/E(0)\n\n250\n\n200\n\n150\n\n100\n\n50\n\n1\n\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n12\nt (in D/U)\n\n14\n\n16\n\n18\n\n20\n\nFigure 2. Left: energy growth E(t)/E(0) against time t for the NLOP of PK10 at Re=1750 and\nE0 = 1.8 × 10−5 using full resolution (MM,NN,LL)=(23, 64, 11) (black solid line) and reduced\nresolutions (7, 64, 1) (red dot-dash line) and (2, 64, 1) (blue dashed line). Removing the helical\nmode effect by using resolution (1, 64, 1) (green dotted line) destroys the NLOP to leave the\nLOP (notice the absence of a 'shoulder' in the curve at T ≈ 3 D/U ). Right: NLOPs for (7, 64, 1)\n(upper) and (2, 64, 1) (lower). Contours indicate streamwise velocity perturbation (total velocity\nwith the laminar state of equivalent mass flux subtracted off) using the same levels in both plots.\nArrows indicate cross-sectional velocities (same scale used for both). Note that the slices are\ntaken at the same point in the pipe but there may be a phase difference between the solutions\nas they are calculated using two different calculations. Also compare the slice for (7, 64, 1) with\nthat for (23, 64, 11) given in the upper left of figure 4.\n\nuv\nvelocities u and v, Em0\n. Each modal energy can change because of three effects: input from\nthe underlying basic state due to the non-normality of the linearised operator, loss due to\nviscous dissipation and either loss or gain through nonlinear mixing with the other modes.\nGenerally, it is difficult to distinguish between these effects without explicitly monitoring\nthe various terms in the Navier–Stokes equations. However, for streamwise-independent\nuv\nmodes, the cross-plane energy Em0\ncannot grow by non-normal effects so any energy gain\nmust be the result of nonlinear input alone. This observation is crucial for interpreting\nfigure 3, which shows that after the Orr mechanism has played out, the NLOP evolution\nis dominated by the non-normal energy growth of helical modes (m, l 6= 0) in the second\nphase (0.4 . t . 2.5). As these modes grow quickly, they feed energy via their nonlinear\nuv\ninteractions into the streamwise-independent modes as evidenced in the increase in Em0\nover the interval 2 . t . 4. When the nonnormal energy growth of the helical modes\nruns out of steam (at ≈ 2.5) they decline quickly through the combined effect of this\nnonlinear energy drain and viscous dissipation. Thereafter, the evolution is dominated by\neach streamwise-independent mode experiencing slow but sustained non-normal growth\nas the secularly-decaying streamwise rolls advect the mean shear to produce streaks -\nthe well-known lift-up process. The uniform decay rates of the streamwise rolls indicates\nthat there is minimal nonlinear energy mixing at this point at least in the cross-plane\nvelocities. This is because they are insensitive to axial advection (e.g. w ∂u/∂z = 0)\nand the cross-plane velocities are so small. Figure 2 shows these two non-normal growth\n\n\f10\n\nC.C.T. Pringle, A.P. Willis and R.R. Kerswell\n−2\n\n10\n\nE\nEw\n\n20\n\nw\n\nE10\n\n−3\n\n10\n\nEw\n\n30\n\n−4\n\nEnergy\n\n10\n\n−5\n\nuv\n\nE20\n\n10\n\nuv\n\nE10\n\n−6\n\n10\n\nEuv\n\nE01\n\n30\n\n−7\n\nE\n\nE\n\n10\n\nE\n\n21\n\n−8\n\n10\n\n11\n\n31\n\n0\n\n2\n\n4\n\n6\n\n8\n\n10\n12\nt (in D/U)\n\n14\n\n16\n\n18\n\n20\n\n22\n\nFigure 3. Modal energies for the NLOP run with resolution (7,64,1). E is the total perturbation\nw\nenergy; Eml\nindicates the energy in the w (streamwise) velocity component with azimuthal\nuv\nand axial wavenumbers m and l respectively, and Eml\nthe energy in the u & v (cross-stream)\nw\nvelocity components with azimuthal and axial wavenumbers m and l respectively. So Em0\nis\nuv\nthe (streamwise) streak energy, Em0 is the (streamwise) roll energy and Em1 is a helical mode\nenergy.\n\nprocesses together with the Orr mechanism cooperate nonlinearly to produce a larger\noverall growth at Topt than separately. After the initial rotation and unpacking by the\nOrr mechanism, the helical modes grow but quickly run out of steam. They then dump\ntheir energy into the third streamwise-rolls-driving-streaks process, which is subsequently\nboosted to reach higher growth factors than otherwise.\nThe fact that helical (or more generically 'oblique') waves grow best over short times\nand streamwise-independent flows grow larger but over longer times is well known (e.g.\nfigure 8 of Farrell & Ioannou 1993, figure 4 of Schmid & Henningson 1994 and figure\n5 of Meseguer & Trethen 2003). Furthermore, the scenario of oblique waves growing\ntransiently, feeding their energy into streamwise rolls that then drive streamwise streaks\n(which then become unstable) has also been proposed before as an efficient bypass mechanism in Reddy et al. (1998) (called the 'oblique wave scenario'). This general picture,\nor at least the first stages of it, appear to be confirmed here in the nonlinear growth\nproblem. However, the initial localisation of the perturbation and how it 'unwraps' to\ngive a final, large, predominantly streamwise-independent flow is a new feature born out\nof a need to cheat the starting (global) energy constraint. Figures 4 and 5 show how the\nstructure of the NLOP across one (fixed) slice of the pipe evolves in time. The initial slice\nshown (upper left and again upper middle but rescaled) has a peak cross-plane speed\n\n\f11\n\nFigure 4. The NLOP at Re = 1750 and E0 = 1.8 × 10−5 calculated using resolution\n(MM,NN,LL)=(23, 64, 11) at t = 0 (top left and top middle so same velocity field shown but\nwith different contour levels), t = 0.2 (top right), t = 0.6 (bottom left), t = 0.8 (bottom middle) and t = 1 D/U (bottom right). Contours indicate the streamwise velocity perturbation\n(total velocity with the laminar state of equivalent mass flux subtracted off) and the arrows\nindicate the cross-stream velocity at a fixed slice in the pipe. All plots except the top left have\n10 contour levels between the extremes of the streamwise velocity perturbation at t = 1 and\ncross-stream velocities similarly scaled. The top left plot uses 10 contours between the extremes\nof the streamwise velocity perturbation at t = 0 with arrows automatically scaled.\n\nof ≈ 0.02U concentrated in a tight vortex pair near the pipe wall and peak axial speed\nof ≈ 0.012U . The delocalisation or 'unwrapping' is effectively completed by t ≈ 1 when\nthe peak cross-plane speed is essentially unchanged whereas the peak axial speed has\ngrown to 0.06U . Figure 5 (the upper left slice is a rescaled version of the lower right\nof figure 4) shows that both the cross-plane and axial speeds grow considerably in the\ninterval 1 . t . 2.5 (peak cross-plane speed increases from 0.02U to 0.08U and peak\naxial speed from 0.06U to 0.13U ). In fact, by t = 2.5 the initial energy has experienced\nmost of its growth (a factor of ≈ 50) and only a further magnification by ≈ 7 follows\nin the next ≈ 20 D/U . In this latter period the cross-plane velocities manoeuvre the\nstreak structure into place and then die away so that even by t = 10, the predominantly\nstreamwise-independent and axial flow has been established (peak cross-plane speed is\n0.012U and peak axial speed 0.34U now). It is worth stressing that even at this point, the\n′\nflow does not match the LOP (see plot c in figure 2 of PK10), which depends solely on\nthe Fourier-Fourier basis function exp(iφ) and is strictly 2D, being streamwise-invariant.\n\n\f12\n\nC.C.T. Pringle, A.P. Willis and R.R. Kerswell\n\nFigure 5. The NLOP at Re = 1750 and E0 = 1.8 × 10−5 calculated using resolution\n(MM,NN,LL)=(23, 64, 11) at t = 1 (upper left), t = 2.5 (upper right), t = 4 (lower left) and\nt = 10, D/U (lower right) and representation is as in figure 4. All plots have 10 contour levels\nbetween the extremes of the streamwise velocity perturbation at t = 10 and cross-stream velocities similarly scaled and set by those at t = 2.5. Note that the upper left plot indicates exactly\nthe same velocity field as the lower right plot in figure 4 but using revised contour and arrow\nlevels.\n\n4. Tracking the NLOP in PK10\nAs discussed in section 1, PK10 demonstrated how nonlinearity can qualitatively\nchange the form of the optimal disturbance of a given initial energy which achieves\nthe most energy growth over a fixed period. The new NLOP could not, however, be followed up to the initial energy level at which turbulence was triggered. We now revisit this\nsituation armed with a more efficient and parallel code which allows higher resolution\nand more carefully refined steps in u0 to be used.\nIn PK10, a short 21 πD periodic pipe was adopted to minimise the axial resolution\nneeded and the relatively short time period was taken equal to Tlin , the time for maximum energy growth in the linearised Navier-Stokes equations, to highlight the effect of\nnonlinearity. Working at Re = 1750, PK10 report failing to converge for E0 > 2 × 10−5 .\nTheir best estimate for Ec was Ec = 6 × 10−5 , the energy required to trigger turbulence\nwhen using a perturbation of the form Au3d (x; E0 = 2 × 10−5, Re = 1750). With the new\ncode using a resolution (M M, LL) = (23, 11) and N N = 64 finite difference radial points\nas opposed to PK10's (M M, LL) = (14, 5) and a 25 Chebyshev polynomial expansion\nradially, we were able to confirm PK10's results for E0 6 2×10−5 as well as continuing to\nconverge up to E0 = 2.52 × 10−5 . Above this point, the amount of growth grows sharply\ncompared with the amount of growth produced by rescaling arguments (figure 6).\nExamining how the residual h(δL /δu0 )2 i decreases as the algorithm proceeds indicates\n\n\f13\n1000\nPK10\nPWK11\n2D result\nAu3D\n800\n\n600\n\n400\n\n200\n\n0\n-5\n1x10\n\n-5\n\n2x10\n\n-5\n\n3x10\n\n-5\n\n4x10\n\n-5\n\n5x10\n\n-5\n\n6x10\n\nFigure 6. Reproduction of figure 5 from Pringle & Kerswell (2010) showing growth as a function\nof initial energy. The red crosses correspond to the nonlinear optimal perturbations previously\ncalculated in PK10, while the (uppermost) green line represents the optimals calculated with\nthe new code presented in this paper. The (middle) magenta line shows the amount of growth\nproduced by simply rescaling the nonlinear optimal for E0 = 2 × 10−5 and therefore lower\nbounds the true (green) optimal growth curve. The (lowest) flat blue line is the growth provided\nby the nonlinearly modified 2D optimal (LOP).\n\nthat the code has converged at E0 = 2.52 × 10−5: see figure 7 (outer). The time evolution\nof the optimal solution is relatively smooth, relaminarising after the initial transient\ngrowth. Surprisingly, however, one of the velocity fields it iterates through (marked with\na black dot in figure 7, outer) does lead to a turbulent episode. A comparison of the two\nevolutions confirms the the optimisation procedure has worked properly: the optimal\nproduces more growth than the other initial condition despite the fact it doesn't lead\nto turbulence (figure 7, inner). This observation seems to go against our assertion that\nthe optimisation algorithm will latch onto a turbulence-triggering state and then fail\nto converge. There are two important lessons to be learnt from this apparent pathology.\nThe first, most obvious one is that the turbulence-triggering initial condition has not had\nenough time to reach the turbulent state by the end of the (short) period Tlin , so (1)\nTopt needs to be large enough. Secondly, figure 7 shows that the energy level reached\nby the optimal a little after Tlin is actually higher than that typically associated with\nthe turbulent state at this (low) Re in this (tight) pipe geometry. This situation is fatal\nfor the approach being advocated here, which relies on the turbulent state producing\nthe highest values of the energy growth (or whatever functional is being considered) in\ncomparison to non-turbulent states. Fortunately, such a situation only seems to occur in\ntightly-constrained (small geometry) flows close to (in Re) the first appearance of the\nturbulent state. Therefore, the second lesson is that (2) the optimisation strategy can\nonly be used sufficiently far from the first appearance of turbulence and/or\nfor flows in large domains.\nIn hindsight then, the geometry and Re value chosen in PK10 is not suited for deter-\n\n\f14\n\nC.C.T. Pringle, A.P. Willis and R.R. Kerswell\n-5\n\n2200\n\n10\n\n2000\n1800\n\n0.15\n1600\n\n-6\n\n10\n\nresidual\n\n0.10\n\nenergy\n\ngrowth\n\n1400\n1200\n\n0.05\n\n1000\n\n-7\n\n10\n800\n\n0\n0\n\n50\n\n600\n\n100\n\n150\n\n200\n\ntime\n\n400\n-8\n\n200\n0\n\n50\n\n100\n\n150\n\n200\n\n10\n250\n\niterations\n\nFigure 7. Convergence of procedure at E0 = 2.52 × 10−5 . The algorithm smoothly converges\nto a growth of 2030 (upper right line), while the residual decays to O(10−8 ) (lower right line).\nThe algorithm was continued for over 800 iterations in total to ensure that there was no further\nchange. Inset: The time evolutions of two disturbances found by this sequence of iteration. The\ngreen (lower right) line is the converged optimal which smoothly relaminarises, while the (upper\nright) red line is the disturbance corresponding to the black dot leading to a turbulent episode.\nThe vertical dashed line shows the target time Topt = Tlin ≈ 21.3 D/U from the optimisation\nprocedure.\n\nmining Ec there using this optimisation approach. We therefore switch to a longer 5D\nperiodic pipe (theoretically popular since the work of Eggels et al. 1994) and a higher\nRe = 2400 where the edge shows typical behaviour (Duguet, Willis & Kerswell 2008) and\nthe turbulent state is clearly energetically separated from the edge state (e.g. Schneider\n& Eckhardt 2009, figure 7).\n\n5. Long Time and a 5 D Pipe\nIn order to assess the twin conjectures discussed in section 1, a practical decision needs\nto be made as to what constitutes a 'asymptotically long' optimisation time. Figure 7\nshows that an initial condition is capable of growing through several orders of magnitude\ninto a turbulent epsiode within ∼ 50 D/U . We therefore chose Topt = 75 D/U , which\nshould be large enough to capture this behaviour especially in a larger 5D domain although Re = 2400 is higher (so Topt > 2.5Tlin at this Re). It is worth remarking, though,\nthat this finite choice will limit the accuracy to which we can determine the energy\nthreshold. The algorithm senses initial conditions which have reached the turbulent state\nby the end of the observational window. This sets a lower limit on how close they can be\nto the edge, as the time for a turbulence-triggering initial condition to reach turbulence\nbecomes arbitrarily large as it is taken closer to the edge. This said, our choice of Topt\ngives acceptable accuracy yet the way to improve this is clear through integrating for\nlonger.\n\n\f15\n10\n\n5\n\n10\n\n4\n\n10\n\n3\n\n10\n\n2\n\n-6\n\ngrowth\n\nE0=7.058x10-6\nE0=7.077x10-6\nE0=7.124x10\n\n0\n\n200\n\n400\n\n600\n\n800\n\n1000\n\n1200\n\n1400\n\n1600\n\niterations\n\nFigure 8. The amount of growth produced by successive choices for u0 in the interative scheme.\nFor E0 = 7.058 × 10−6 the growth plateaus out at 483 (red lower line). For E0 = 7.124 × 10−6 ,\nthe growth briefly plateaus at ∼ 520 before rapidly rising to excess of 1, 000 (upper blue line).\nThe circle plotted shows a growth of 14, 480 and has reached the turbulent attractor before\nthe algorithm steps momentarily back to a region below the edge. The turbulent seed and the\noptimal for E0 = 7.058 × 10−6 are both plotted in figure 18. Before this has been reached,\nhowever, the growth being produced is already nonsmooth between steps due to the lack of\nsmoothness in the hypersurface L , as predicted by conjecture 1. We also include the choice\nof E0 = 7.077 × 10−6 for illustrative purposes (middle green line). This iterative run has not\nbeen fully converged and it is not clear whether it will converge to an optimal or depart to the\nturbulent state.\n\nThe results of the energy growth optimisation in a 5 D pipe at Re = 2400 as a function\nof E0 † exactly mimicks the situation uncovered in PK10. For E0 small enough, the\nlinear (streamwise-independent) optimal (LOP) is selected albeit with slight nonlinear\nmodification, which suppresses the growth of the 2D optimal as E0 increases. Then\nthere is a finite value (PK10 refer to this as E3d ) when a new 3D optimal (NLOP) is\npreferentially selected, which shows localisation in the azimuthal and radial directions.\nThere is also some localisation in the streamwise direction, however the domain is by\nno means long enough for us to observe truly localised optimals as opposed to periodic\ndisturbances.\nAs E0 is increased further, there comes a point at which the algorithm struggles to\nconverge properly. Successive bisection indicates that this value, Ef ail , is bracketed by\nthe initial energy values of E0 = 7.058 × 10−6 which converges smoothly to the NLOP\nand 7.124 × 10−6 which clearly fails due to the occurrence of a turbulence-triggering\ninitial condition: see figures 8, 9 and 10.\nAn attempt to improve this bracketing by taking E0 = 7.077 × 10−6 appears to show\nconvergence yet there still remains some doubt even after running the algorithm for nearly\n1600 iterations and 50,000 CPU hours (≈ 6 years). Figure 8 indicates convergence yet at a\nmuch higher level compared to that reached by the 'nearby' initial energy of E0 = 7.058×\n† Note that the nondimensionalisation of energy is dependent on the size of the flow domain\nbeing considered, and so equivalent absolute energies will appear smaller after nondimensionalising in this longer pipe.\n\n\f16\n\nresidual\n\nC.C.T. Pringle, A.P. Willis and R.R. Kerswell\n10\n\n-2\n\n10\n\n-3\n\n10\n\n-4\n\n10\n\n-5\n\n10\n\n-6\n\n10\n\n-7\n\n10\n\n-8\n\n-6\n\nE0=7.058x10-6\nE0=7.077x10-6\nE0=7.124x10\n\n0\n\n200\n\n400\n\n600\n\n800\n\n1000\n\n1200\n\n1400\n\n1600\n\niterations\n\nFigure 9. The residuals corresponding to the three iterative runs described in figure 8 (flat red\nline 7.058 × 10−6 , green line with spike at 1100 7.077 × 10−6 and upper blue 7.124 × 10−6 ). The\nsudden adjustment centred on 1100 iterations is a warning that deciding upon convergence can\nbe a subtle affair.\n\n10−6 . Moreover the fact that there is a jump up to this higher level after ≈ 1000 iterations\nis mildly disconcerting. This adjustment is reflected in the evolution of the residual (see\nfigure 9), which after 200 interations, appears to show convergence for the next 500\niterations before being followed by a rapid transition that ends after 1150 iterations. It is\nnot clear whether the algorithm now has finally converged or whether it will subsquently\nencounter a turbulence-inducing initial condition. This example demonstrates that it is\nclearly very important to take care when deciding whether the procedure has converged\nor not (e.g. stopping the algorithm after 600 iterations would indicate clear convergence).\nIt is probable that the algorithm is struggling to discern between turbulence-inducing\ninitial conditions and the NLOP because the time to reach turbulence is comparable to,\nor exceeds, Topt . Consequently, the estimate that 7.058 × 10−6 < Ef ail < 7.124 × 10−6 is\nthe best we can hope for working with Topt = 75 D/U and the fate of E0 = 7.077 × 10−6\ncould be decided by taking a longer Topt (not pursued here).\nThe physical evolution of the two disturbances is shown in figure 11. Initially the disturbances look streamwise-localised because of the contouring but they do in fact occupy\nthe full length of the domain. Both subsequently develop into coherent domain-length\nstreaks. In the E0 = 7.058 × 10−6 case, these streaks continue to evolve yet remain\nstable, becoming almost totally streamwise-invariant before ultimately decaying. In the\nE0 = 7.124 × 10−6 case, the streaks have higher amplitude and a streak instability clearly\noccurs leading to turbulence. The nature of this instability is shown in figure 12 which\nplots the streamwise dependent and independent components of the energy of the axial\nvelocity field with (lead) azimuthal wave number m = 1. For the relaminarising disturbance, the 3D part of the energy decays monotonically from around 15 D/U onwards.\nFor the more energetic disturbance the decay is abated after 20 D/U at which point, an\ninstability of the streaks occurs eventually leading to turbulence. It is worth remarking\nthat the final plot for E0 = 7.058 × 10−6 in figure 11 resembles more the two streaks\nproduced by the linear optimal, rather than the three-streak field generated in PK10 (cf\n\n\f17\n0.12\n\n-6\n\nE0=7.058x10\n-6\nE0=7.077x10\n-6\nE0=7.124x10\n0.1\n\nenergy\n\n0.08\n\n0.06\n\n0.04\n\n0.02\n\n0\n0\n\n50\n\n100\n\n150\n\n200\n\ntime\n\nFigure 10. Evolution of the final states produced by the iterative scheme for E0 = 7.058 × 10−6\n(red lowest line) and 7.124×10−6 (blue uppermost line). One clearly leads to a turbulent episode\nwhile the other simply relaminarises after the intial transient growth. Also shown is the evolution\nof the initial condition arrived at after 1600 iterations for E0 = 7.077 × 10−6 (middle green line)\nwhich again relaminarises. The vertical line marks the optimisation time.\n\nfigure 5, bottom right in this paper). Whether this is due to the increased target time or\nthe lengthened flow domain is unclear.\nConjecture 1 claims Ec = Ef ail . As there is no evidence of turbulence-triggering initial\nconditions at E0 = 7.058 × 10−6 but there is at 7.124 × 10−6 , we have 7.058 × 10−6 <\nEc < 7.124 × 10−6 . To this level of accuracy we have found that Ec = Ef ail . That the\noptimisation scheme will fail if turbulent seeds exist within the E0 -hypersurface seems\nclear provided the iterative scheme can find them. Establishing this is very difficult if not\nimpossible, but a weaker practical alternative is to demonstrate that the procedure is not\ndependent on the initial starting guess u0 . To do this we have compared six very different\nchoices for the initial seed for both E0 < Ef ail and E0 > Ef ail and plotted their evolution\non a 2D projection of energy in the axisymmetric part of the perturbation against energy\nin the streamwise-independent part (figures 13 and 14). The scatter of the initial crosses\nillustrates the variety of initial conditions used which range from turbulent velocity fields\nto known travelling wave solutions. In both cases, irrespective of where the scheme begins,\nthe eventual (iterative) evolution brings it to the same trajectory in this 'phase space'.\nThis provides some evidence that the algorithm does sample the E0 -hypersurface well\nand that Conjecture 1 indeed holds true.\nIn order to assess Conjecture 2, we now consider the behaviour of the optimal solution\nclose to the edge. Figures 13 and 14 already provide some evidence that the NLOP at\n7.058 × 10−6 and the turbulent seed found at 7.124 × 10−6 are similar at least in terms of\ntheir axisymmetric and streamwise-independent energy fractions. In order to probe the\naccuracy of Conjecture 2 further, we look at the one initial condition that in section 5 our\nalgorithm identified for E0 = 7.124 × 10−6 that was a turbulent seed, us (indicated by\nthe circle in figure 8) . The fact that only the one condition was found above the edge of\nchaos suggests that in this region there is only a very small set of turbulence-triggering\ninitial conditions. We attempt to quantify this by considering the evolution of initial\n\n\f18\n\nC.C.T. Pringle, A.P. Willis and R.R. Kerswell\n\nFigure 11. Snap shots showing isocontours of streamwise perturbation velocity during the\nevolution of the final states produced by the iterative scheme for E0 = 7.058 × 10−6 (left) and\n7.124 × 10−6 (right). The isocontours in each plot correspond to 50% of the maximum (light\nyellow) and 50% of the minimum (dark red) of the streamwise perturbation velocity in the pipe\nat that time. The snapshots correspond to times t = 0, 0.5, 5, 10, 20, 40 and 75 D/U . In both\ncases the energy is initially localised in the streamwise direction and the disturbance quickly\nspreads. By t = 10 both disturbances have created streamwise streaks but only for the lower\nenergy do they become streamwise independent. The larger amplitude of the higher energy\nstreaks are subject to a turbulence-triggering instability.\n\nconditions of the form\nuic (A, d) := A[(1 + d)ul=0 + (1 − d)ul6=0 ]\n\n(5.1)\n\nwhere ul=0 and ul6=0 are the streamwise independent and dependent parts of us and\nA is adjusted to give the required value of E0 . The amount of growth after 75D/U is\nshown as a function of E0 and d in figure 15. The jump in growth from O(103 ) to O(104 )\nclearly demarcates where the edge of chaos is crossed. The narrowness of the peak for\nE0 = 7.124 × 10−6 and the observation that a mere ∼ 0.3% reduction in amplitude\n\n\f19\n-1\n\n10\n\n-2\n\n10\n\nEw\nm=1,l=0\n-3\n\n10\n\nenergy\n\n-4\n\n10\n\nEw\nm=1,l6=0\n\n-5\n\n10\n\n-6\n\n10\n\n-7\n\n10\n\n-8\n\n10\n\n0\n\n25\n\n50\n\n75\n\ntime\n\nFigure 12. The energy associated with the m = 1 axial component of the disturbances calculated for E0 = 7.058 × 10−6 (solid) and E0 = 7.124 × 10−6 (dashed). Each energy is split into\nstreamwise-independent (dark red uppermost lines at t = 25D/U ) and streamwise-dependent\n(light green lowermost lines at t = 25D/U ) parts. The former measures the streaks created by\nthe disturbance while the latter shows the instability of these streaks.\n100\n\n10-1\n\nEm=0/E0\n\n10-2\n\n10-3\n\n10-4\n\n10-5\n\nInitial conditions\nOptimal\n0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n0.5\n0.6\nEk=0/E0\n\n0.7\n\n0.8\n\n0.9\n\n1\n\n1.1\n\nFigure 13. Convergence of six different initial conditions (crosses) towards the same optimal\n(circle) for E0 = 7.058 × 10−6 : axes are normalised perturbation energies associated with the\nstreamwise-independent part (abscissa) and the axisymetric part (ordinate). The initial conditions chosen correspond to the various combinations of turbulent flow fields, travelling wave\nsolutions and the nonlinear optimal from section 4. The red line corresponds to this final choice\nand is the iterative scheme shown in figures 8 and 9.\n\n\f20\n\nC.C.T. Pringle, A.P. Willis and R.R. Kerswell\n0\n\n10\n\n10-1\n\nEm=0/E0\n\n10-2\n\n10-3\n\n10-4\n\n10-5\n\n0\n\n0.1\n\n0.2\n\n0.3\n\n0.4\n\n0.5\n0.6\nEk=0/E0\n\n0.7\n\n0.8\n\n0.9\n\n1\n\n1.1\n\nFigure 14. The result of using the same six initial conditions (crosses) for E0 = 7.124 × 10−6 .\nThe red line corresponds to the iterative progression shown in figures 8 and 9. Clearly, the\nprocedure is independent of the starting guess. Note also how similar the progression is here to\nthat for E0 = 7.058 × 10−6 .\n\nis enough to dip beneath the edge, indicates that us is very close to a local minimum\nof the edge. The precise energy at which uic (A, d = 0) crosses the edge is plotted in\nfigure 16. Here two bracketing cases are shown: E0 = 7.121011 × 10−6 , which ultimately\nrelaminarises, and E0 = 7.121019 × 10−6 , which leads to turbulence. The closeness of\nthese energies means that both evolutions track the edge to T ≈ Topt before going their\nseparate ways. This emphasizes that to improve the estimate of Ec discussed above, Topt\nhas to be increased.\nCoincidentally, while following the relaminarising case, the flow was found to transiently resemble the asymmetric travelling wave believed to be embedded in the edge\nstate (Pringle & Kerswell 2007, later named S1 in Pringle et al. 2009) at t ≈ 100 D/U .\nThis was verified by calculating the two correlation functions, Itot and 12 (Itot + Iuv ),\nintroduced in Kerswell & Tutty (2007, definitions (2.3) and (2.5)). Figure 17 shows that\nboth these correlations simultaneously exceed 0.75 at t ≈ 100 D/U clearly indicating a\nvery close 'visit' (0.6 was deemed good enough to indicate a 'close' visit by Kerswell &\nTutty 2007). The fact that this visit takes place is not a surprise but more a check of\nconsistency: the edge state is believed unique and therefore a global attractor on the edge\nat this Re and pipe length (Schneider, Eckhardt & Yorke 2007). It is worthy of note,\nhowever, that it takes a comparatively long time of ≈ 100 D/U for a flow trajectory\nstarting at the lowest energy point on the edge to reach the S1 state.\nExamining the NLOP for E0 = 7.058 × 10−6 and us , it seems reasonable to conclude\nthat the minimal seed of turbulence is 'sandwiched' in between. The form of the two\nsolutions are shown in figure 18 (along with the last iterate calculated at 7.077 × 10−6 )\nand it is clear that they don't alter much as the edge is crossed. This supports Conjecture\n2.\n\n\f21\n16000\n8.55e-5\n7.60e-5\n7.31e-5\n7.22e-5\n7.12e-5\n7.10e-5\n7.03e-5\n\n14000\n\n12000\n\nG\n\n10000\n\n8000\n\n6000\n\n4000\n\n2000\n\n0\n-1\n\n-0.8\n\n-0.6\n\n-0.4\n\n-0.2\n\n0\nd\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nFigure 15. Growth factors in the neighbourhood of the seed state ut that triggers turbulence at E0 = 7.124 × 10−6 . The neighbourhood is defined by d where\nuic (x; d) := A[ (1 + d)ul=0 + (1 − d)ul6=0 ], ul=0 is the streamwise-independent part of us and\nul6=0 := us − ul=0 . The amplitude A is used to rescale the initial state to ensure the correct\nstarting energy E0 . The figure shows that us only just triggers transition at 7.124 × 10−6 but\nfor higher energies, an ever-increasing neighbourhood of initial conditions surrounding us exists\nwhich trigger transition (indicated by the jump in G).\n\n6. Discussion\nWe first summarise what has been done in this paper. An exploratory nonlinear energy growth calculation in PK10 showed that the form of the optimal initial disturbance\nchanges suddenly at a small (pre-threshold) but finite initial energy level E3d from a\nglobal linear optimal (weakly modified by nonlinearity) to a localised strongly nonlinear optimal. This has been confirmed at higher spatial and temporal resolution. The\nphysical processes responsible for the enhanced energy growth of the new nonlinear optimal (NLOP) have been identified as three known linear growth mechanisms - the Orr\nmechanism, oblique wave transient growth and the lift-up effect - acting sequentially\nand coupled together via the nonlinearity of the Navier-Stokes equations. These mechanisms operate on differing timescales yet appear able to pass on their growth to the next\n(slower) process so that the total growth outweighs any of their individual contributions.\nThe NLOP is also localised, which is an inherently nonlinear feature designed to cheat the\nglobal initial energy constraint. The calculations here have also managed to converge this\nnonlinear optimal state beyond the threshold energy level at which turbulence could be\ntriggered. This highlighted two issues for the optimisation strategy to identify this energy\nthreshold: 1) the optimisation time needs to be large enough that turbulence-triggering\ninitial conditions have time to reach the turbulent state; and 2) the energy levels of\nthe turbulent state need to be above those for laminar flows so that the optimisation\n\n\f22\n\nC.C.T. Pringle, A.P. Willis and R.R. Kerswell\n\n7.121019e-6\n7.121011e-6\n\nE3D(t)\n\n0.01\n\n0.001\n\n0.0001\n0\n\n20\n\n40\n\n60\n\n80\n\n100\n\n120\n\n140\n\nt (D/U)\nFigure 16. Trajectories close to the laminar-turbulent boundary, or 'edge'. Nearby initial conditions are uic = Aus , with A selected to give the indicated energies. The case\nE0 = 7.121011 × 10−6 relaminarises but not before passing close by the edge attractor\n(marked by the dot which is the energy of the S1 travelling wave embedded in it). The\ncase E0 = 7.121019 × 10−6 tracks the edge before leading to turbulence, The vertical line is\nT = Topt = 75D/U .\n1\n\nItot\n(Itot+Iuv)/2\n\n0.8\n\n0.6\n\n0.4\n\n0.2\n\n0\n0\n\n20\n\n40\n\n60\n\n80\n\n100\n\n120\n\n140\n\nt (D/U)\n\nFigure 17. Correlation function data which measures how close the instantaneous velocity field\nis to the asymmetric travelling wave S1 for the trajectory which relaminarises in figure 16 with\nE0 = 7.121011 × 10−6 . The fact that Itot and 12 (Itot + Iuv ) exceed 0.75 at t = 100 D/U indicates\na very close visit (Kerswell & Tutty 2007). The importance of this visit is that S1 is believed\nembedded in the chaotic edge state for the pipe length and Re.\n\n\f23\n\nFigure 18. The nonlinear optimal calculated in section 5 for E0 = 7.058 × 10−6 (left) and the\nturbulent seed us (right). The close similarity between the two solutions is striking with the\nturbulent seed having stronger streaks but an otherwise comparable structure. For comparison\nwe have also included the final state found for E0 = 7.077 × 10−6 (middle). This state appears\nto be an intermediary between the two other states.\n\nalgorithm will naturally seek them out. This indicates that the optimisation strategy\ndiscussed here is better suited to larger flow domains and more supercritical (higher Re)\nregimes. Ironically, it is now clear that doing exploratory (cheap) calculations in a small\ndomain at low Re was a natural but bad choice in PK10.\nCalculations in a longer pipe 5D at higher Re (=2400) over a larger time period found\nthe same general situation as in the 21 πD pipe of PK10. At low initial energies, the\noptimal is the (global) linear optimal weakly modified by nonlinearity. At a certain small\nbut finite initial energy E3d , a new localised 3D optimal (NLOP) is preferred, which stays\nthe optimal until the algorithm fails to converge at Ef ail . The only significant difference\nis that in the longer 5D pipe, the NLOP is starting to streamwise-localise in contrast to\nthe 12 πD NLOP, where the shortness of the domain prevents this. Above Ef ail , initial\nconditions that trigger turbulence are found to exist on the energy hypersurface and to\nthe accuracy available, Ef ail = Ec . This supports Conjecture 1, which presupposes that\nthe optimisation algorithm will find any turbulent-triggering states if they exist on the\nenergy hypersurface and then fail to converge as a result. As way of confirming this,\nthe algorithm was tested with a variety of very different starting conditions with the\nsame optimal emerging, indicating that the optimisation algorithm is able to explore the\nenergy hypersurface.\nIntriguingly, good evidence was also found that NLOP → minimal seed as E0 → Ec− in\nsupport of the stronger Conjecture 2 at least for this flow, geometry and Re. Pictorially,\nthis means that the NLOP for Ec and the minimal seed actually coincide in figure 19\nrather than the more general situation shown where the two differ (for clarity). It was\nalso argued that, with enough computational power, the threshold energy Ec and the\nminimal seed could be calculated to arbitrary accuracy by increasing the spatial and\ntemporal resolution as well as Topt , which improves the algorithm's ability to discern\nbetween trajectories that become turbulent and those that relaminarise.\nThe strategy advocated here for determining the minimal finite amplitude disturbance\nto trigger transition to turbulence in shear flows involves constructing and iteratively\nsolving a variational problem. The objective functional must be selected such that it\nidentifies turbulent velocity fields by taking enhanced values compared to those for laminar fields. This is then maximised via searching over all incompressible disturbances of\nfixed amplitude that respect the boundary conditions over an asymptotically long time\nperiod constrained by the full Navier-Stokes equations. All of the results discussed here\nhave been obtained using the perturbation energy growth over a given period as the key\n\n\f24\n\nC.C.T. Pringle, A.P. Willis and R.R. Kerswell\nq\nEl6m=0\n=0\nce\nen\nl\nu\nrb\nu\nT\nEdge\nMinimal\nSeed\n\nNLOP\n\nq\n=0\nEl6m6\n=0\n\nLOP\nE3d\n\nEc\n\n√\nEl=0\nFigure 19. Cartoon to illustrate Conjectures 1 and 2. Conjecture 1 asserts that the optimisation\napproach will yield a well-defined nonlinear optimal (NLOP) up until E0 = Ec whereupon\nturbulence can be triggered by the minimal seed. Conjecture 2 asserts that the NLOP converges\nas E0 → Ec− to the minimal seed (the converse situation where the limiting NLOP state and\nthe minimal seed are different is shown for clarity). Note the LOP is streamwise-independent in\npipe flow and hence traces the El=0 axis.\n\nfunctional. This certainly takes enhanced values for turbulent velocity fields in the 5D\npipe at Re = 2400 and Conjecture 1 seems to hold true. However, other choices should\nalso work equally well, e.g. the total dissipation (Monokrousos et al. 2011), provided they\nshare this crucial property. If Conjecture 1 is indeed true, then the optimisation strategy\ndiscussed here will identify the threshold energy level Ec . However, more is available too,\nalbeit indirectly, as the minimal seed should be the unique initial condition that triggers\nturbulence as E0 → Ec+ . Given this, the status of Conjecture 2, although conceptually\nfascinating, seems less important practically. Whether or not Conjecture 2 holds for energy growth (and, admittedly, we only have one supportive data analysis here), it can\nof course be restated for any functional. Then the question really is: is there a universal\nfunctional that when optimised always identifies the minimal seed as E → Ec− for a\nclass of flows (e.g. wall-bounded shear flows)? This seems unlikely to be exactly true but\nnevertheless may be approximately true for some subset of functionals. Then any of these\ncould give acceptable predictions depending on how the results are to be subsequently\nused (e.g. designing disturbances in the laboratory). Certainly this would seem to be the\ncase using the energy growth functional given the comparison in figure 18.\nThe variational approach espoused here is, of course, incredibly flexible. Changing the\nkey functional is straightforward as is the initial (norm) constraint on the competitor\ninitial fields. Although the discussion above has concentrated on the initial perturbation\nenergy E0 , it should be clear other norm choices can be made. Providing the functional\n\n\f25\nunder consideration jumps to large values for turbulent flows, the optimisation algorithm\nshould converge up until the first point (as the norm hypersurface 'expands' away from\nthe laminar state) at which the edge penetrates the hypersurface (as per Conjecture 1).\nFurthermore, the turbulent state does not have to be the only target of the approach.\nIdentifying the peak instantaneous pressure in a transitional flow is a key concern for\npipeline structural integrity. One could easily imagine formulating an optimisation problem to maximise the pressure after time Topt over all disturbances of initial energy E0\nwhere Topt is also part of the optimisation procedure.\nThe long term objective of this theoretical work is to design better (lower energy) ways\nto trigger turbulence with a view to informing control techniques. Further calculations\nclearly need to be carried out in more realistic geometries to see, for example, if universal\nlocalised minimal seeds emerge. Even now though, this work is in a position to stimulate\nnew experiments. The NLOP identified here indicates that structures that initially point\ninto the shear will outgrow the equivalent structure directed across the shear (the Orr\nmechanism). This suggests a modification of the recent experiments of Peixinho & Mullin\n(2007) which were designed to generate oblique rolls by blowing and sucking directly\nacross the shear. The calculations performed here indicate that their threshold scaling\nexponent (a non-trivial flux ∼ Re−1.5 ) for transition may possibly be further reduced if\nthe blowing and sucking is inclined upstream to take advantage of the Orr mechanism.\n\n7. Glossary\nE0\nET\nE3d\nEf ail\n\ninitial energy of a perturbation\nfinal energy of a perturbation after time T\ninitial energy at which the NLOP first emerges as the new optimal\nthe minimum energy for which the optimisation routine fails to\nconverge\nEc\nthe critical energy corresponding the minimum energy of the edge\nEc (u)\nthe minimum energy of a perturbation of the form Au required\nto trigger turbulence\nTopt\nthe target time in an optimisation procedure\nTlin\nthe time for which transient growth is maaximised in the linear\nproblem\nTturb\ntypical time period required for the onset of turbulence\nu2D (x; Re, E, L, T ) the two dimensional optimal for the Reynolds number, energy,\ndomain length and optimisation time T specified\nu3D (x; Re, E, L, T ) the three dimensional optimal for the Reynolds number, energy,\ndomain length and optimisation time T specified\n\nThe authors acknowledge insightful conversations with Brian Farrell, Petros Ioannou\nand Dan Henningson. The calculations in this paper were carried out at the Advanced\nComputing Research Centre, University of Bristol.\n\nREFERENCES\n\n\f26\n\nC.C.T. Pringle, A.P. Willis and R.R. Kerswell\n\nAndersson, P., Berggren, M. & Henningson, D. S. 1999 Optimal disturbances and bypass\ntransition in boundary layers Phys. Fluids 11, 134–150.\nButler, K. M. & Farrell, B. F. 1992 3-Dimensional optimal perturbations in viscous shearflow Phys. Fluids 4, 1637–1650.\nCherubini, S., De Palma, P., Robinet, J.-Ch. & Bottaro, A. 2010 Rapid path to transition\nvia nonlinear localized optimal perturbations in a boundary-layer flow. Phys. Rev. E 82,\n066302.\nCorbett, P. & Bottaro, A. 2000 Optimal perturbations for boundary layers subject to\nstreamwise pressure gradient. Phys. Fluids 12, 120–130.\nDuguet, Y., Willis, A.P. & Kerswell, R.R. 2008 Transition in pipe flow: the saddle structure on the boundary of turbulence. J. Fluid Mech. 613, 255-274.\nDuguet, Y., Brandt, L. & Larsson, B.R.J. 2010 Towards minimal perturbations in transitional plane Couette flow. Phys. Rev. E 82, 026316.\nEggels, J.G.M., Unger, F., Weiss, M.H., Westerweel, J., Adrian, R.J., Friedrich, R.\n& Nieuwstadt, F.T.M. 1994 Fully-developed turbulence pipeflow - a comparison between\ndirect numerical simulation and experiment J. Fluid Mech. 268, 175–209.\nFarrell, B.F. & Ioannou, P.J. 1993 Optimal excitation of three-dimensional perturbations\nin viscous constant shear flow Phys. Fluids 5, 1390–1400.\nGustavsson, L. H. 1991 Energy growth of 3-dimensional disturbances in plane Poiseuille flow\nJ. Fluid Mech. 224, 241–260.\nItano, T. & Toh, S. 2001 The dynamics of bursting process in wall turbulence J. Phys. Soc.\nJapan. 70, 703–716.\nKerswell, R.R. & Tutty, O.R. 2007 Recurence of travelling waves in transitional pipe flow\nJ. Fluid Mech. 584, 69–102.\nLuchini, P. & Bottaro, A. 1998 Görtler vortices: a backward-in-time approach to the receptivity problem J. Fluid Mech. 363, 1–23.\nLuchini, P. 2000 Reynolds-number-independent instability of the boundary layer over a flat\nsurface: optimal perturbations J. Fluid Mech. 404, 289–309.\nMeseguer, A. & Trefethen, L.N. 2003 Linearized pipe flow to Reynolds number 107 J.\nComp. Physics 186, 178–197.\nMonokrousos, A., Bottaro, A., Brandt, L., Di Vita, A. & Henningson, D.S. 2011\nNonequilibrium thermodynamics and the optimal path to turbulence in shear flows Phys.\nRev. Lett. 106, 134502.\nOrr, W.M.F. 1907 The stability or instability of the steady motions of a perfect liquid and of\na viscous liquid. Part I: A perfect liquid. Part II: A viscous liquid. Proc. R. Irish Acad. A\n27, 9–138.\nPeixinho, J. & Mullin, T. 2007 Finite-amplitude thresholds for transition in pipe flow J.\nFluid Mech. 582, 169-178.\nPringle, C.C.T. & Kerswell, R.R. 2007 Asymmetric, helical and mirror-symmetric travelling\nwaves in pipe flow Phys. Rev. Lett. 99, 074502 (referred to as PK07 in the text).\nPringle, C.C.T., Duguet, Y. & Kerswell, R.R. 2009 Highly symmetric travelling waves in\npipe flow Phil. Trans. Roy. Soc. A. 367, 457-472.\nPringle, C.C.T. & Kerswell, R.R. 2010 Using nonlinear transient growth to construct the\nminimal seed for shear flow turbulence. Phys. Rev. Lett. 105, 154502 (referred to as PK10\nin the text).\nReddy, S.C., Schmid, P.J., Baggett, J.S. & Henningson, D.S. 1998 On the stability of\nstreamwise streaks and transition thresholds in plane channel flows. J. Fluid Mech. 365,\n269–303.\nReddy, S.C. & Henningson, D.S. 1993 Energy growth in visocus channel flows J. Fluid Mech.\n252, 209–238.\nSchmid, P.J. & Henningson, D.S. 1994 Optimal energy growth in Hagen-Poiseuille flow J.\nFluid Mech. 277, 197.\nSchneider, T.M., Eckhardt, B. & Yorke, J.A. 2007 Turbulence transition and the edge of\nchaos in pipe flow Phys. Rev. Lett. 99, 034502.\nSchneider, T.M. & Eckhardt, B. 2009 Edge states intermediate between laminar and turbulent dynamics in pipe flow Phil. Trans. R. Soc. A 367, 577-587.\n\n\f27\nSkufca, J.D., Yorke, J.A. & Eckhardt, B. 2006 Edge of Chaos in a Parallel Shear Flow.\nPhys. Rev. Lett. 96, 174101.\nTrefethen, L. N., Trefethen, A. E. & Reddy, S. C. 1993 Hydrodynamic stability without\neigenvalues Science 261, 578–584.\nViswanath, D.. & Cvitanovic, P. 2009 Stable manifolds and the transition to turbulence in\npipe flow J. Fluid Mech. 617, 215-233.\nWillis, A.P. & Kerswell, R.R. 2009 Turbulent dynamics of pipe flow captured in a reduced\nmodel: puff relaminarisation and localised 'edge' states. J. Fluid Mech. 619, 213-233.\nZuccher, S., Luchini, P. & Bottaro, A. 2004 Algebraic growth in a Blasius boundary layer:\noptimal and robust control by mean suction in the nonlinear regime. J. Fluid Mech. 513,\n135–17.\n\n\f"}