{"id": "http://arxiv.org/abs/1202.4981v1", "guidislink": true, "updated": "2012-02-22T17:30:59Z", "updated_parsed": [2012, 2, 22, 17, 30, 59, 2, 53, 0], "published": "2012-02-22T17:30:59Z", "published_parsed": [2012, 2, 22, 17, 30, 59, 2, 53, 0], "title": "Break up of returning plasma after the 7 June 2011 filament eruption by\n  Rayleigh-Taylor instabilities", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1202.0364%2C1202.5682%2C1202.0456%2C1202.0546%2C1202.0837%2C1202.6578%2C1202.5557%2C1202.1726%2C1202.3831%2C1202.4707%2C1202.1317%2C1202.2805%2C1202.4985%2C1202.3019%2C1202.1732%2C1202.1770%2C1202.2464%2C1202.3326%2C1202.2281%2C1202.4305%2C1202.6277%2C1202.0513%2C1202.0312%2C1202.2466%2C1202.4743%2C1202.6563%2C1202.2223%2C1202.4038%2C1202.0109%2C1202.3595%2C1202.2652%2C1202.2087%2C1202.5080%2C1202.4807%2C1202.2188%2C1202.0644%2C1202.4143%2C1202.3104%2C1202.2419%2C1202.0732%2C1202.4606%2C1202.4064%2C1202.3187%2C1202.1782%2C1202.0219%2C1202.1172%2C1202.4981%2C1202.6057%2C1202.5071%2C1202.3793%2C1202.3505%2C1202.0813%2C1202.4750%2C1202.5738%2C1202.2638%2C1202.0009%2C1202.4419%2C1202.4942%2C1202.3383%2C1202.4381%2C1202.5857%2C1202.4116%2C1202.5832%2C1202.2835%2C1202.0555%2C1202.1086%2C1202.4837%2C1202.3059%2C1202.4412%2C1202.1962%2C1202.2278%2C1202.2687%2C1202.4259%2C1202.3811%2C1202.5171%2C1202.2345%2C1202.5229%2C1202.5509%2C1202.5151%2C1202.1464%2C1202.0430%2C1202.3118%2C1202.1436%2C1202.3572%2C1202.2073%2C1202.3172%2C1202.6157%2C1202.3659%2C1202.0270%2C1202.1663%2C1202.2258%2C1202.3614%2C1202.1700%2C1202.0512%2C1202.3447%2C1202.4080%2C1202.3530%2C1202.4790%2C1202.2426%2C1202.5784%2C1202.1980&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Break up of returning plasma after the 7 June 2011 filament eruption by\n  Rayleigh-Taylor instabilities"}, "summary": "A prominence eruption on 7 June 2011 produced spectacular curtains of plasma\nfalling through the lower corona. At the solar surface they created an\nincredible display of extreme ultraviolet brightenings. The aim is to identify\nand analyze some of the local instabilities which produce structure in the\nfalling plasma. The structures were investigated using SDO/AIA 171A and 193A\nimages in which the falling plasma appeared dark against the bright coronal\nemission. Several instances of the Rayleigh-Taylor instability were\ninvestigated. In two cases the Alfven velocity associated with the dense plasma\ncould be estimated from the separation of the Rayleigh-Taylor fingers. A second\ntype of feature, which has the appearance of self-similar branching horns, is\nalso discussed.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1202.0364%2C1202.5682%2C1202.0456%2C1202.0546%2C1202.0837%2C1202.6578%2C1202.5557%2C1202.1726%2C1202.3831%2C1202.4707%2C1202.1317%2C1202.2805%2C1202.4985%2C1202.3019%2C1202.1732%2C1202.1770%2C1202.2464%2C1202.3326%2C1202.2281%2C1202.4305%2C1202.6277%2C1202.0513%2C1202.0312%2C1202.2466%2C1202.4743%2C1202.6563%2C1202.2223%2C1202.4038%2C1202.0109%2C1202.3595%2C1202.2652%2C1202.2087%2C1202.5080%2C1202.4807%2C1202.2188%2C1202.0644%2C1202.4143%2C1202.3104%2C1202.2419%2C1202.0732%2C1202.4606%2C1202.4064%2C1202.3187%2C1202.1782%2C1202.0219%2C1202.1172%2C1202.4981%2C1202.6057%2C1202.5071%2C1202.3793%2C1202.3505%2C1202.0813%2C1202.4750%2C1202.5738%2C1202.2638%2C1202.0009%2C1202.4419%2C1202.4942%2C1202.3383%2C1202.4381%2C1202.5857%2C1202.4116%2C1202.5832%2C1202.2835%2C1202.0555%2C1202.1086%2C1202.4837%2C1202.3059%2C1202.4412%2C1202.1962%2C1202.2278%2C1202.2687%2C1202.4259%2C1202.3811%2C1202.5171%2C1202.2345%2C1202.5229%2C1202.5509%2C1202.5151%2C1202.1464%2C1202.0430%2C1202.3118%2C1202.1436%2C1202.3572%2C1202.2073%2C1202.3172%2C1202.6157%2C1202.3659%2C1202.0270%2C1202.1663%2C1202.2258%2C1202.3614%2C1202.1700%2C1202.0512%2C1202.3447%2C1202.4080%2C1202.3530%2C1202.4790%2C1202.2426%2C1202.5784%2C1202.1980&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A prominence eruption on 7 June 2011 produced spectacular curtains of plasma\nfalling through the lower corona. At the solar surface they created an\nincredible display of extreme ultraviolet brightenings. The aim is to identify\nand analyze some of the local instabilities which produce structure in the\nfalling plasma. The structures were investigated using SDO/AIA 171A and 193A\nimages in which the falling plasma appeared dark against the bright coronal\nemission. Several instances of the Rayleigh-Taylor instability were\ninvestigated. In two cases the Alfven velocity associated with the dense plasma\ncould be estimated from the separation of the Rayleigh-Taylor fingers. A second\ntype of feature, which has the appearance of self-similar branching horns, is\nalso discussed."}, "authors": ["D. E. Innes", "R. H. Cameron", "L. Fletcher", "B. Inhester", "S. K. Solanki"], "author_detail": {"name": "S. K. Solanki"}, "author": "S. K. Solanki", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1051/0004-6361/201118530", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/1202.4981v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1202.4981v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "6 pages, 7 figures, submitted A&A. Movies are at\n  http://www.mps.mpg.de/data/outgoing/innes/arcs_movie.avi and\n  http://www.mps.mpg.de/data/outgoing/innes/horns_movie.avi", "arxiv_primary_category": {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1202.4981v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1202.4981v1", "journal_reference": null, "doi": "10.1051/0004-6361/201118530", "fulltext": "c ESO 2018\n\nAstronomy & Astrophysics manuscript no. RT ̇archive2\nOctober 26, 2018\n\nBreak up of returning plasma after the 7 June 2011 filament\neruption by Rayleigh-Taylor instabilities\nD. E. Innes1 , R. H. Cameron1 , L. Fletcher2 , B. Inhester1 , and S. K. Solanki1,3\n1\n2\n3\n\nMax-Planck Institut für Sonnensystemforschung, 37191 Katlenburg-Lindau, Germany\nSchool of Physics and Astronomy, SUPA, University of Glasgow, Glasgow, G12 8QQ, UK\nSchool of Space Research, Kyung Hee University, Yongin, Gyeonggi, 446-701, Korea\n\narXiv:1202.4981v1 [astro-ph.SR] 22 Feb 2012\n\nReceived ...; accepted ...\nABSTRACT\nContext. A prominence eruption on 7 June 2011 produced spectacular curtains of plasma falling through the lower corona. At the\n\nsolar surface they created an incredible display of extreme ultraviolet brightenings.\nAims. To identify and analyze some of the local instabilities which produce structure in the falling plasma.\nMethods. The structures were investigated using SDO/AIA 171Å and 193Å images in which the falling plasma appeared dark against\nthe bright coronal emission.\nResults. Several instances of the Rayleigh-Taylor instability were investigated. In two cases the Alfvén velocity associated with\nthe dense plasma could be estimated from the separation of the Rayleigh-Taylor fingers. A second type of feature, which has the\nappearance of self-similar branching horns was discussed.\nKey words. Sun: activity Sun:coronal mass ejection - Instabilities\n\n1. Introduction\nOne of the most spectacular solar events seen so far with the\nAtmospheric Imaging Assembly (AIA) on the Solar Dynamics\nObservatory (SD0) occurred when a filament erupted on 7 June\n20111 . The eruption that was associated with a fast coronal mass\nejection (CME), an M2 flare and dome-shaped extreme ultraviolet (EUV) front (Cheng et al. 2012), slung material across almost\na quarter of the solar surface. The 'S' shaped filament erupted\nfrom the southern active region AR11226 as it was nearing the\nwestern limb. The eruption started at 6:00 UT, and reached its\npeak GOES soft X-ray brightness at 6:35 UT. Non-escaping material was seen in SOHO/LASCO C2 and STEREO/COR1 images falling back from heights up to 4 solar radii. The first returning material was seen at the solar surface at around 7:00 UT\nin SDO/AIA and STEREO/EUVI-A images.\nHere we concentrate on the structure of the falling plasma.\nAn hour and a half after the eruption it looked like a huge upsidedown crown extending over at least 60000 (Fig. 1). The leading\nedge had broken-up into semi-regular arcs and spikes, similar to\nthe rim of a splash (e.g. Edgerton 1987). Such long fingers and\narcs are also seen in the Crab supernova remnant (Hester 2008).\nIn the Crab, the main fingers are thought to be the result of the\nmagnetic Rayleigh-Taylor (RT) instability (Hester et al. 1996).\nRT has also been invoked to explain filamentary structure (Isobe\net al. 2005) and prominence bubbles (Berger et al. 2011) on the\nSun.\nIn this letter we highlight features that lead us to conclude\nthat the magnetic RT is also responsible for the structures seen in\nthis event. Further we investigate properties of the magnetic RT\ninstability to obtain diagnostics of the local plasma conditions.\nSend offprint requests to: D.E. Innes e-mail: innes@mps.mpg.de\n1\nhttp://www.thesuntoday.org/current-observations/a-spectacularevent-a-filamentprominence-eruption-to-blow-your-socks-off/\n\n2. Observations\nSDO/AIA takes images of the full solar disk with a resolution of\nabout 0.600 pixel−1 through 10 filters, selected to single out specific strong lines in the corona and continuum emission from\nthe lower chromosphere. We investigate the structure of cold\nfilament plasma which was seen as dark structures in the 171,\n131, 193, 211, 304, and 335Å images due to absorption of background EUV emission by neutral hydrogen, helium and singly\nionized helium. Since we will be discussing the structure of the\nplasma as it appears against the coronal background, we only\nshow 171Å and 193Å data because these have the best contrast.\nThe data are presented as either intensity or ratio images. The\nratio images are the log of the ratio of the image at the time\ngiven and the image taken 12 s earlier except where times are\ngiven specifically. In the ratio images the absorbing plasma has\nmoved from the bright to the dark regions. Flow velocities have\nbeen computed with the optical flow code of Gissot & Hochedez\n(2007) and are represented by white arrows in the ratio images.\n2.1. Onset\n\nThe overall development of the filament eruption is shown in\nFig. 2. Fig. 2a gives the impression of a hot core with a cool\ncone-like shell expanding upwards above it. There is also a cloud\nof hot ejecta coming from the center (red arrow). Focusing on\nthe northern edge of the dark cone, we see that initially this edge\nwas essentially straight. Then, as the erupting material expanded,\nparts broke away (red box in Fig. 2b) and the upper edge started\nto corrugate. These corrugations later developed into the finger\nand arc structure in Fig. 1. Unfortunately they were too far off\nlimb to clearly observe their evolution in the SDO/AIA images\ndue to low contrast with the background.\n1\n\n\fInnes, Cameron, Fletcher, Inhester, Solanki: Break up of returning filament plasma\n\nFig. 1. Falling (dark) plasma after the 2011 June 7 filament eruption looks like the fingers on the rim of a splash: a) 193Å intensity;\nb) 193Å ratio of images at the times given (see Sect. 2 for details). The white arrows in (b) represent plane-of-sky velocities and the\nred bar the typical spacing between fingers.\n2.2. Spikes\n\nThe part that broke away shows small regularly spaced spikes\npointing outward along its edge (Fig. 2d, red arrow). They look\nsimilar to the spikes observed by SDO/AIA in the 131Å filter on\nthe edge of a coronal eruption and interpreted by Foullon et al.\n(2011) as Kelvin-Helmholtz roll-ups. The ones here appear to be\ndifferent because, as implied by the ratio image of this filament\n(Fig. 3) and shown in the online appendix (Fig. A.1), they grew\nupwards and did not turn over. It is interesting to note that the\ngrowth which was along the flow direction was perpendicular to\nthe solar radial direction, hence not governed by gravity.\nThe spikes in Fig. 3 had a separation of 500 , length of 600 ,\nand growth rate 12 km s−1 . About 1 min later they faded and\nwere overtaken by plasma from behind. Similar spikes were seen\nalong the edge of filamentary structures throughout the evolution\nand they were all pointing in the direction of motion and disappeared without turning over.\n2.3. Fingers and Arcs\n\nThe falling filament plasma closest to the active region presented\na sequence of well-exposed images showing arcs and some\nsmall-scale fingers. A series of processes occurred. Structure in\nthe ejected plasma was initially stretched out by its large-scale\nexpansion, creating small cavities that then expanded by pressure gradients probably associated with outflow from the eruption site. As the cavity expanded, new smaller-scale fingers and\narcs formed on the inside. The movie, arcs movie shows the\ncomplete evolution of the cavities and small-scale fingers and\narcs on the inside. A snapshot of the movie is shown in Fig. 4a.\n2\n\nFig. 2. Erupting filament plasma seen in 171Å intensity images.\nThe red arrow in (a) points to hot ejecta. Details of the red box\nin (b) are shown in (d). The red box in (c) outlines the regions\ndisplayed in Figs. 4 and 6. In (d) the arrow points to the spikes\nshown in detail in Fig. 3. The FOV is 50000 x 55000 except in (d)\nwhere it is 9600 x 11000 .\n\n\fInnes, Cameron, Fletcher, Inhester, Solanki: Break up of returning filament plasma\n\n2.4. Horns\n\nFig. 3. Growth of spikes along filament indicated by the red arrow in Fig. 2d: 171Å intensity ratio image. The red bar indicates\nthe spikes' separation. The FOV is 9600 x 6600 .\n\nFig. 4. Expanding arc with small-scale fingers and arcs inside:\n(a) 193Å intensity (b) 193Å ratio image. The red bar in (a) spans\nan arc between two small-scale fingers. The white arrows represent plane-of-sky velocity and the red line shows the position of\nthe time slice in Fig. 5. The FOV is 18000 x 18500 . The evolution\ncan be seen in the movie arcs movie\n\nFig. 5. Upwards expansion of arc: space-time slice of 193Å running ratio images along the red line in Fig. 4b. The best fit d ∝ t2\n(Eq. 3) relationship is shown as a red dashed line. A white line\nis drawn at the time of the image in Fig. 4\nThe red bar bridges one of these small-scale arcs. The outline of\nan expanding cavity is clearly visible in the ratio image (Fig. 4b).\nTo study the acceleration of the arcs, we show the space-time\nrunning ratio image in Fig. 5. It was taken along the red arrow\ndrawn through the apex of the arc in Fig. 4b. The expanding\nedge of the arc is over-plotted with the red line d ∝ t2 which is\nthe relationship expected for constant acceleration of the interface. Space-time images along different directions through the\narc give similar results but the edge is not as sharp. This is the\nbackground on which the small-scale RT fingers we are interested in develop.\n\nAnother set of features we would like to point out are the horns.\nThe formation of three of these is illustrated in Fig. 6 where they\nare labelled H1, H2, and H3, and in the accompanying movie,\nhorns movie. These horns sometimes formed out of sheets that\ndistorted (H1 and H2) and sometimes when a thread tore away\nfrom the main stem (H3). At the time the central frame was\ntaken, H1 was compressing as it moved northward as though\nbeing pushed from the south. Most the other structures are also\nmoving north although the tips of the the denser/darker fingers\n(e.g. H2, H3) have a significant sunward component. These ones\nlater developed arc-like horns. In Fig. 6f, a small spike has developed inside H2 (red arrow), repeating in a self-similar way\nthe finger and arc structure.\nThe movie shows there were several background effects that\ncould have been influencing the evolution and growth of the\nhorns because (i) nearly all the structures are moving northward,\n(ii) there are hot outflows from the eruption site, and (iii) at the\nend of the movie there is a bright ridge off-limb along which dark\nplasma seems to be falling. The ridge and sideways motion can\nbe attributed to the coronal magnetic field configuration which\nat the height of the falling plasma consisted of closed loops connecting the active regions north and south of the equator (Fig. 1).\nThere are no obvious signs of a direct influence of the outflows\non the evolution of the falling plasma, but the flows would probably have been directed along field lines connecting the active\nregions and could therefore have added momentum to the filament motion. The horns might thus be associated with the global\nfield configuration rather than being a purely local phenomenon.\n\n3. Discussion\nSince both the time and spatial scales are large, the evolution\nof the instabilities studied here can be treated as MHD phenomena. The examples discussed in Sect. 1, 2.1, 2.3 are all cases\nof cool dense material sitting on top of lighter hotter plasma. In\nthe features discussed in 2.2 and 2.3, a large-scale pressure gradient appears to be accelerating the structure (see Fig. 5 where\nconstant acceleration of the interface can be readily inferred).\nThe RT instability occurs whenever a denser fluid is accelerated\nagainst a less dense fluid by, for example, gravity or pressure\ngradients. So if we ignore the effects of the magnetic field, each\nof these cases is RT unstable. Indeed the large-scale structure of\nthe falling filament plasma looks like the rim of a large splash,\nin which long fingers are connected by shadowy arcs (Fig. 1).\nAlthough the micro-physics is different it is probable that here,\nlike in the splash (Allen 1975), RT instabilities were responsible\nfor the break-up.\nTo proceed further we need to consider the structure of the\nmagnetic field in each particular case. Although the dense, cool\nfilament plasma is partially neutral there will be strong collisional coupling between the neutrals and the ionized component.\nIt is also reasonable to assume that the hot and cold plasma lie on\ndifferent field lines because thermal conduction is efficient along\nfield lines. In this case the magnetic field must be parallel to the\ninterface between the two plasmas. Magnetic tension then tends\nto inhibit transverse motions which vary along any field line,\nwith shorter wavelength fluctuations being more strongly inhibited. For the case where the magnetic field in both fluids is oriented in the same direction, the instability only occurs for waves\nwhich have kk < kc where kk is the component of the wave vec3\n\n\fInnes, Cameron, Fletcher, Inhester, Solanki: Break up of returning filament plasma\n\ntor aligned with the magnetic field (Chandrasekhar 1961). The\nwavelength associated with kc is\nλc =\n\nB2\ng(ρh − ρl )\n\n(1)\n\nwhere ρh /ρl > 1 is the ratio of the densities on the two sides of\nthe interface, B is the strength of the uniform magnetic field, and\ng is the net acceleration due to gravity and additional acceleration, a, caused by pressure gradients across the interface.\nModes with kk = 0 are unaffected by the field, with the consequence that the instability acts to form sheets aligned with the\nfield (Isobe et al. 2005). Here, however, the magnetic field orientation in the cold plasma and in the warm plasma will not, in\ngeneral, be aligned. In this case the magnetic tension acts against\nthe instability for all k.\nSimulations of the magnetic RT instability with different\nmagnetic field orientations on the two sides of the density jump\nhave been performed by Stone & Gardiner (2007). If the fields\non either side of the interface are oriented parallel to the interface but at an angle to each other (the case we are concerned\nwith), bubbles separated by long fingers on the scale of the critical wavelength grow preferentially. Their simulation produced\nlong fingers separated by smooth arcs, morphologically similar\nto those in Fig. 1. The spacing of the RT bubbles corresponds\nto λc as described above. Hence by measuring the separation of\nthe fingers we can use Eq. 1 to place constraints on the plasma\nproperties.\nFor all our examples the heavy plasma is much denser than\nthe light plasma, so we take ρh \u001d ρl , and using B2 = 4πρh VA2 ,\nwhere VA is the Alfvén speed of the falling filament material\nwhere the instability starts, we obtain\np\nVA = λc g/(4π).\n(2)\nThus the observed 100 Mm separation of the fingers seen in\nFig. 1 gives an Alfvén speed of approximately 47 km s−1 for\nthe falling material. We note that since we can measure the spacing between the fingers only in the plane perpendicular to the\nline-of-sight, this is a lower limit to the Alfvén velocity.\nA slightly more complicated example is that corresponding\nto Figs. 4 and 5. Here acceleration due to a large-scale pressure\ngradient is important. The acceleration of the interface can be\nmeasured by fitting\nd=\n\na 2\nt\n2\n\n(3)\n\nto the location of the interface shown in Fig. 5, where d is the\ndistance moved by the interface, t is time, and a is the constant\nacceleration, which we measure to be 140 m s−2 . It is directed\naway from the Sun, so increases the effective g which appears in\nEq. 2. Based on the observed spacing between the main fingers,\n10 Mm, in the plane perpendicular to the line-of-sight, the lower\nlimit for the Alfvén velocity in the dense plasma is 18 km s−1 .\nThroughout many smaller fingers appear but these are quickly\ndamped, presumably because the spacing is less than the critical\nwavelength.\nThe spikes of Sect 2.2 seem to be also produced by the RT\ninstability based on their apparent evolution. We suspect that\nthey are a consequence of the blast, seen 10 min earlier as a\ndome-like EUV wave (Cheng et al. 2012), that overtook the filament plasma. The observed short wavelengths are consistent\nwith rapid acceleration. After the acceleration the RT instability\nwill cease and magnetic tension will act to remove the fingers.\n4\n\nFig. 6. Formation of horns: (left) 171Å intensity; (right) 171Å\nratio. White arrows represent plane-of-sky velocity. FOV is\n13000 x12000 . The structures are labelled H1, H2, H3. The red arrow in (f) points to a secondary spike. The evolution of these\nstructures is shown in the movie, horns movie.\n\nLastly we note that there are certainly other instabilities besides the RT which could be analyzed. The above examples\nwere chosen because they were relatively clean, simple examples where the entire evolution could be followed. The horns\ndiscussed in section 2.4 are presumably the result of some instability which we have not been able to properly identify. We see\nno examples of Kelvin-Helmholtz even along the edges of the\nfingers where they could be expected in the non-linear phase of\nthe RT instability.\n\n4. Conclusion\nIn this letter we have analyzed spatially and temporally localized instabilities associated with the event on June 7 2011.\nConcentrating on examples of the RT instability, we have shown\nthat reasonable values for the Alfvén velocity in the falling\nplasma can be derived.\nAcknowledgements. The authors are indebted to the SDO/AIA teams and the\nGerman Data Center at MPS for providing the data. This work has been\nsupported by WCU grant No. R31-10016 funded by the Korean Ministry of\nEducation, Science and Technology and by grant ST/1001808/1 from UKs\nScience and Technology Facilities Council, and Leverhulme Foundation Grant\nF00-179A.\n\n\fInnes, Cameron, Fletcher, Inhester, Solanki: Break up of returning filament plasma\n\nReferences\nAllen, R. F. 1975, J. Colloid Surface Sci., 51, 350\nBerger, T., Testa, P., Hillier, A., et al. 2011, Nat, 472, 197\nChandrasekhar, S. 1961, Hydrodynamic and hydromagnetic stability (Oxford:\nOxford Univ. Press)\nCheng, X., Zhang, J., Olmedo, O., et al. 2012, ApJ Lett., 745, L5\nEdgerton, H. E. 1987, Stopping time: the photographs of Harold Edgerton\n(Abrams, New York)\nFoullon, C., Verwichte, E., Nakariakov, V. M., Nykyri, K., & Farrugia, C. J.\n2011, ApJ, 729, L8\nGissot, S. F. & Hochedez, J.-F. 2007, A&A, 464, 1107\nHester, J. J. 2008, ARA&A, 46, 127\nHester, J. J., Stone, J. M., Scowen, P. A., et al. 1996, ApJ, 456, 225\nIsobe, H., Miyagoshi, T., Shibata, K., & Yokoyama, T. 2005, Nat, 434, 478\nStone, J. M. & Gardiner, T. 2007, ApJ, 671, 1726\n\nAppendix A: Spikes' evolution\n\n5\n\n\fInnes, Cameron, Fletcher, Inhester, Solanki: Break up of returning filament plasma\n\nFig. A.1. Series of 171Å snapshots showing the evolution of the spikes described in section 2.2 and Fig 3. Small cavities develop\nbetween the spikes (see images at 06:24:48 and 06:26:00) while they continue to grow without rolling over. After only a few minutes\nthe spikes fade and are overtaken denser plasma at their base.\n\n6\n\n\f"}