{"id": "http://arxiv.org/abs/0910.2087v1", "guidislink": true, "updated": "2009-10-12T05:43:11Z", "updated_parsed": [2009, 10, 12, 5, 43, 11, 0, 285, 0], "published": "2009-10-12T05:43:11Z", "published_parsed": [2009, 10, 12, 5, 43, 11, 0, 285, 0], "title": "Integral approach to sensitive singular perturbations", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0910.5401%2C0910.2338%2C0910.4528%2C0910.1436%2C0910.4833%2C0910.0090%2C0910.2062%2C0910.1061%2C0910.0164%2C0910.3396%2C0910.3379%2C0910.2175%2C0910.0236%2C0910.4885%2C0910.3789%2C0910.1902%2C0910.5062%2C0910.2677%2C0910.2018%2C0910.1255%2C0910.5253%2C0910.0163%2C0910.5509%2C0910.5772%2C0910.5928%2C0910.1376%2C0910.3086%2C0910.0651%2C0910.0339%2C0910.4496%2C0910.1275%2C0910.5888%2C0910.5489%2C0910.3903%2C0910.0508%2C0910.1891%2C0910.1202%2C0910.5217%2C0910.1936%2C0910.1178%2C0910.5286%2C0910.3175%2C0910.5135%2C0910.4158%2C0910.4401%2C0910.4749%2C0910.2589%2C0910.5423%2C0910.0457%2C0910.2567%2C0910.3246%2C0910.3499%2C0910.1096%2C0910.5008%2C0910.1893%2C0910.0395%2C0910.3912%2C0910.1428%2C0910.3065%2C0910.4623%2C0910.3592%2C0910.5651%2C0910.5696%2C0910.0015%2C0910.3770%2C0910.4416%2C0910.4650%2C0910.3555%2C0910.4600%2C0910.5112%2C0910.4106%2C0910.4273%2C0910.4962%2C0910.4498%2C0910.2837%2C0910.0522%2C0910.3306%2C0910.3310%2C0910.1060%2C0910.4100%2C0910.3500%2C0910.0184%2C0910.1267%2C0910.1331%2C0910.2692%2C0910.5951%2C0910.2342%2C0910.1389%2C0910.5634%2C0910.1403%2C0910.3659%2C0910.4269%2C0910.3448%2C0910.2606%2C0910.3542%2C0910.3926%2C0910.0980%2C0910.4266%2C0910.2087%2C0910.4419%2C0910.4313&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Integral approach to sensitive singular perturbations"}, "summary": "We consider singular perturbation elliptic problems depending on a parameter\n? such that, for ? = 0 the boundary conditions are not adapted to the equation\n(they do not satisfy the Shapiro - Lopatinskii condition). The limit only holds\nin very abstract spaces out of distribution theory involving complexi?cation\nand non-local phenomena. We give a very elementary model problem showing the\nmain features of the limit process, as well as a heuristic integral procedure\nfor obtain- ing a description of the solutions for small ?. Such kind of\nproblems appear in thin shell theory when the middle surface is elliptic and\nthe shell is fixed by a part of the boundary and free by the rest.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0910.5401%2C0910.2338%2C0910.4528%2C0910.1436%2C0910.4833%2C0910.0090%2C0910.2062%2C0910.1061%2C0910.0164%2C0910.3396%2C0910.3379%2C0910.2175%2C0910.0236%2C0910.4885%2C0910.3789%2C0910.1902%2C0910.5062%2C0910.2677%2C0910.2018%2C0910.1255%2C0910.5253%2C0910.0163%2C0910.5509%2C0910.5772%2C0910.5928%2C0910.1376%2C0910.3086%2C0910.0651%2C0910.0339%2C0910.4496%2C0910.1275%2C0910.5888%2C0910.5489%2C0910.3903%2C0910.0508%2C0910.1891%2C0910.1202%2C0910.5217%2C0910.1936%2C0910.1178%2C0910.5286%2C0910.3175%2C0910.5135%2C0910.4158%2C0910.4401%2C0910.4749%2C0910.2589%2C0910.5423%2C0910.0457%2C0910.2567%2C0910.3246%2C0910.3499%2C0910.1096%2C0910.5008%2C0910.1893%2C0910.0395%2C0910.3912%2C0910.1428%2C0910.3065%2C0910.4623%2C0910.3592%2C0910.5651%2C0910.5696%2C0910.0015%2C0910.3770%2C0910.4416%2C0910.4650%2C0910.3555%2C0910.4600%2C0910.5112%2C0910.4106%2C0910.4273%2C0910.4962%2C0910.4498%2C0910.2837%2C0910.0522%2C0910.3306%2C0910.3310%2C0910.1060%2C0910.4100%2C0910.3500%2C0910.0184%2C0910.1267%2C0910.1331%2C0910.2692%2C0910.5951%2C0910.2342%2C0910.1389%2C0910.5634%2C0910.1403%2C0910.3659%2C0910.4269%2C0910.3448%2C0910.2606%2C0910.3542%2C0910.3926%2C0910.0980%2C0910.4266%2C0910.2087%2C0910.4419%2C0910.4313&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We consider singular perturbation elliptic problems depending on a parameter\n? such that, for ? = 0 the boundary conditions are not adapted to the equation\n(they do not satisfy the Shapiro - Lopatinskii condition). The limit only holds\nin very abstract spaces out of distribution theory involving complexi?cation\nand non-local phenomena. We give a very elementary model problem showing the\nmain features of the limit process, as well as a heuristic integral procedure\nfor obtain- ing a description of the solutions for small ?. Such kind of\nproblems appear in thin shell theory when the middle surface is elliptic and\nthe shell is fixed by a part of the boundary and free by the rest."}, "authors": ["Nicolas Meunier", "Evariste Sanchez-Palencia"], "author_detail": {"name": "Evariste Sanchez-Palencia"}, "author": "Evariste Sanchez-Palencia", "links": [{"href": "http://arxiv.org/abs/0910.2087v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0910.2087v1", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "math.AP", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "math.AP", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0910.2087v1", "affiliation": "LMM", "arxiv_url": "http://arxiv.org/abs/0910.2087v1", "arxiv_comment": null, "journal_reference": null, "doi": null, "fulltext": "Integral approach to sensitive singular perturbations\n\narXiv:0910.2087v1 [math.AP] 12 Oct 2009\n\nNicolas Meunier∗ and E. Sanchez-Palencia†\n\nAbstract\nWe consider singular perturbation elliptic problems depending on a parameter ε such that, for\nε = 0 the boundary conditions are not adapted to the equation (they do not satisfy the Shapiro\n- Lopatinskii condition). The limit only holds in very abstract spaces out of distribution theory\ninvolving complexification and non-local phenomena. We give a very elementary model problem\nshowing the main features of the limit process, as well as a heuristic integral procedure for obtaining a description of the solutions for small ε. Such kind of problems appear in thin shell theory\nwhen the middle surface is elliptic and the shell is fixed by a part of the boundary and free by the\nrest.\n\n1 Introduction\nThe main purpose of this paper is to give general ideas on a kind of singular perturbations arising\nin thin shell theory when the middle surface is elliptic and the shell is fixed by a part of the boundary\nand free by the rest as well as an integral heuristic procedure reducing them to simpler problems. The\nsystem depends drastically on the parameter ε equal to the relative thickness of the shell. It appears\nthat the \"limit problem\" for ε = 0 is highly ill-posed. Indeed, the boundary conditions on the free\nboundary are not \"adapted\" to the system of equations; they do not satisfy the Shapiro - Lopatinskii\n(SL hereafter) condition. Roughly speaking, this amounts to some kind of \"transparency\" of the\nboundary conditions, which allow some kind of locally indeterminate oscillations along the boundary,\nexponentially decreasing inside the domain. This pathological behavior is only concerned with ε = 0.\nIn fact, for ε > 0 the problem is \"classical\". When ε is positive but small, the \"determinacy\" of the\noscillations only holds with the help of boundary conditions on other boundaries, as well as the small\nterms coming from ε > 0.\nIn such kind of situations, the limit problem has no solution within classical theory of partial\ndifferential equations, which is uses distribution theory. It is sometimes possible to prove the convergence of the solutions uε towards some limit u0 , but this \"limit solution\" and the topology of the\nconvergence are concerned with abstract spaces not included in the distribution space.\nAfter recalling the SL condition (section 2), we give in section 3 a very simple example of such\na perturbation problem. The geometry of the domain (an infinite strip) allows explicit treatment by\nFourier transform in the longitudinal direction. The inverse Fourier transform within distribution theory is only possible for ε > 0, whereas for ε = 0 it is only possible in the framework of analytic\nfunctionals (higly singular and not enjoying localization properties). This example shows the prominent role of components with high frequency; for small ε, the \"smooth parts\" (i. e. with small |ξ|) of\n∗\n\nUniversité Paris Descartes, MAP5, 45-47 Rue des Saints Pères 75006 Paris, France, Nicolas.Meunier@math-info.univparis5.fr\n†\nUniversity of Pierre et Marie Curie and CNRS, Institut Jean Le Rond D'Alembert, 4, place Jussieu, 75252 Paris, France,\nsanchez@lmm.jussieu.fr\n\n1\n\n\fthe solutions may be neglected with respect to \"singular ones\" (i. e. with large |ξ|). We also recall\nan example of elliptic Cauchy problem (in fact Hadamard's counter-example) which exhibits some\nrelation with the limit problem.\nIn section 4, we report the heuristic procedure of [EgMeSa07]. In this latter article, we addressed a\nmore complicated problem including a variational structure, somewhat analogous to the shell problem,\nbut simpler, as concerning an equation instead of a system. It is shown that the limit problem contains\nin particular an elliptic Cauchy problem. This problem was handled in both a rigorous (very abstract)\nframework and using a heuristic procedure for exhibiting the structure of the solutions with very small\nε. The reasons why the solution goes out of the distibution space as ε goes to 0 are then evident. In\nsection 4 we present a simplified version of the heuristic procedure involving only the essential facts\nof the approximation, which are very much analogous to the method of construction of a parametrix\nin elliptic problems [Ta81], [EgSc97]:\n-Only principal (with higher differentiation order) terms are taken into account.\n-Locally, the coefficients are considered to be constant, their values being frozen at the corresponding points.\n-After Fourier transform (x → ξ), terms with small ξ are neglected with respect to those with\nlarger ξ (which amounts to taking into account singular parts of the solutions while neglecting smoother\nones). We note that this approximation, aside with the two previous ones, lead to some kind of \"local\nFourier transform\" which we shall use freely in the sequel.\nAnother important ingredient of the heuristics is a previous drastic restriction of the space where\nthe variational problem is handled. In order to search for the minimum of energy, we only take\ninto account functions such that the energy of the limit problem is very small. This is done using\na boundary layer method within the previous approximations, i. e. for large |ξ|. This leads to an\napproximate simpler formulation of the problem for small ε, where it is apparent that the limit problem\ninvolves a smoothing operator and cannot have a solution within distribution theory.\nIt should prove useful to give an example of a sequence of functions converging to an analytical\nfunctional (but going out of the distribution space, then leading to a \"complexification\" phenomenon).\nIt is known ([Sc50], [GeCh64]) that (direct and inverse) Fourier transform within distribution theory\nis only possible for temperate distributions, not allowing functions with exponential growth at infinity.\nThe space of (direct or inverse) Fourier transform of general distributions is noted Z ′ . It is a space\nof analytical functionals: the corresponding test functions are analytical rapidly decreasing functions,\nforming the space Z.\nLet us consider the (non temperate) distribution (or function) û(ξ) = cosh(ξ). The sequence\n(\ncosh(ξ) if |ξ| < λ,\nλ\nû (ξ) =\n0 otherwise\nconverges to û in the distribution sense as λ goes to infinity. The inverse Fourier transforms uλ (x)\nconverge in Z ′ to the analytical functionnal u(x). The functions ûλ (ξ) are tempered and their inverse\nFourier transforms are easily computed by hand. It appears that for large λ\nuλ (x) ≈\n\neλ 1\n(cos(λx) + x sin(λx)).\n2π 1 + x2\n\nIt is then apparent that uλ (x) consists of a \"nearly periodic\" function with period tending to zero\n1\neλ\nalong with 1/λ, multiplied by an \"envelop\" defined by 1+x\n2 and by the factor 2π . Moreover, it should\nbe noted that the amplitude is exponentially large with respect to the inverse of the period. It is\n2\n\n\f0.01\n\n0.01\n\n0.005\nu3\n\n0\n\n0.005\n0\n\n-0.005\n\n-0.005\n\n-0.01\n\n-0.01\n\n1\n\n-1\n\n0.5\n\n-0.5\n\n0\n\n0\n\n0.5\n\n-0.5\ny1\n\n-0.5\n\n0.5\n\n1\n\n-1\n\n1 -1\n\n0\n\n0\n\n-0.5\n\n0.5\n1 -1\n\nFigure 1.1: Normal displacement for ε = 10−3 on the left and for ε = 10−5 on the right\nthen apparent that the limit is an \"extremely singular\" function as the \"graph\" fills the entire plane.\nMoreover, it is clear (and may be rigorously proved [EgMeSa07] that the sequence uλ goes out of the\ndistribution space everywhere, not only in the vicinity of x = 0 as is suggested by the formal inverse\nξ 2n\nFourier transform of cosh(ξ) = Σ+∞\nn=0 (2n)! , which is\nu(x) = Σ+∞\nn=0\n\n−i 2n\nδ (x),\n(2n)!\n\napparently a singularity \"of order infinity\" at the origin. This fact constitutes an example of the property that elements of Z ′ can only be tested with analytical test functions, then not enjoying localization\nproperties.\nThe motivation for studying that kind of problems comes from shell theory, see [SaHuSa97],\n[BeMiSa08]. It appears that when the middle surface is elliptic (both principal curvatures have same\nsign) and is fixed by a part Γ0 of the boundary and free by the rest Γ1 , the \"limit problem\" as the\nthickness ε tends to zero is elliptic, with boundary conditions satisfying SL on Γ0 , and boundary not\nsatisfying SL on Γ1 . Without going into details, which may be found in [MeSa06], [MeSaHuSa07],\n[EgMeSa07] and [EgMeSa09], we show numerical computations taken from [BeMiSa08] of the normal displacement for ε = 10−3 and ε = 10−5 (figures 1.1 on the left and on the right respectively)\nwhen the shell is acted upon by a normal density of forces on a rectangular region of the plane of\nparameters. The most important feature is constituted by large oscillations nearby the free boundary\nΓ1 . It is apparent that, when passing from ε = 10−3 to ε = 10−5 , the amplitude of the oscillations\ngrows from 0.001 to 0.01. The singularities produced by the jump of the applied forces inside the\ndomain is still apparent for ε = 10−3 , not for ε = 10−5 , where only oscillations along the boundary\nare visible. Moreover, the number of such oscillations pass from nearly 3 for ε = 10−3 to nearly 5 for\nε = 10−5 and is then nearly proportional to log(1/ε). We shall see that all these features agree with\nour theory.\n\n2\n\nThe Shapiro - Lopatinskii condition for boundary conditions of elliptic equations\n\nIn this section, we recall some properties of elliptic PDE, see [AgDoNi59] and [EgSc97] for more\ndetails.\n\n3\n\ny2\n\n\fWe consider a PDE of the form\nP (x, ∂α )u = f (x)\n\n(2.1)\n\nWhere x = (x1 , x2 ) and ∂α = ∂/∂xα , α = 1, 2, and P is a polynomial of degree 2m in ∂α . Let P0\nbe the \"principal part\", i. e., the terms of higher order. The equation is said to be elliptic at x if the\nhomogeneous polynomial of degree 2m in ξα :\nP0 (x, −iξα ) = 0\n\n(2.2)\n\nhas no solution ξ = (ξ1 , ξ2 ) 6= (0, 0) with real ξα . When the coefficients are real (this is the only case\nthat we shall consider) this implies that the degree is even (this is the reason why we denoted it by\n2m). The left hand side of (2.2) is said to be the \"principal symbol\"; the \"symbol\" is obtained in an\nanalogous way taking the whole P instead of the principal part P0 . We note that replacing ∂/∂xα by\n−iξα in P0 amounts to taking formally the Fourier transform x → ξ for the homogeneous equation\nwith constant coefficients obtained by discarding the lower order terms and freezing the coefficients\nat x. Obviously, ellipticity on a domain Ω is defined as elliptic at any x ∈ Ω.\nIt is worthwhile mentioning that ellipticity amounts to non - existence of \"travelling waves\" of the\nform\ne−iξx\n(2.3)\nfor the equation obtained after discarding lower order terms and freezing coefficients. Here \"travelling\" amounts to \"with real ξ\"; note that solutions as (2.3) with non real ξ are necessarily exponentially\ngrowing or decaying (in modulus) in some direction. Moreover, when a solution of the form (2.3) exists (with ξ either real or not), it also exists for cξ with any c. In a heuristic framework,we may suppose\nthat |ξ| is very large; this justify to discard lower order terms (= of lower degree in |ξ|). In the same\n(heuristic) order of ideas, freezing the coefficients allows to consider \"local solutions\". This amounts\nto multiply the solutions by a \"cutoff\" function θ(x) or equivalently taking the convolution of the\nFourier transform with θ̂(ξ), which do not modify the behavior for large ξ. Microlocal analysis gives\na rigorous sense to that heuristics. It then appears that local singularities of a solution u (associated\nwith behavior of the Fourier transform for large |ξ|) cannot occur in elliptic equations unless they are\ncontrolled by the (Fourier transform of the) right hand side f . This gives a \"heuristic proof\" of the\nclassical property that local solutions of elliptic equations are rigorously associated with singularities\nof f .\nWhat happens with solutions near the boundary? Local Fourier transform is no longer possible,\nbut, after rectification of the boundary in the neighborhood of a point, we may perform a tangential\nFourier transform. If, for instance, the considered part of the boundary is on the axis x1 and the domain\nis on the side x2 > 0, taking only higher order terms and frozen coefficients, we have solutions of the\nform (2.3) with real ξ1 (as coming from the Fourier transform) and non - real ξ2 . The dependence in\nx2 is immediately obtained by solving an ODE with constant coefficients. Obviously, the solutions\nare exponentially growing or decreasing for x2 > 0. As the coefficients are real, there are precisely\nm (linearly independent) growing and m decreasing (in the case of multiple roots, dependence in x2\nof the form x2 eλ)x2 and analogous also occur). Roughly speaking, there are solutions of the form:\nX\nCk e−iξ1 x1 eλk x2\n(2.4)\nk\n\nwith real ξ1 and Re(λ) 6= 0 (here k is running from 1 to 2m) . Boundary conditions on x2 = 0\nshould control solutions with Re(λ) < 0, i. e., exponentially decreasing inside the domain, whereas\nexponentially growing ones should be controlled \"by the equation in the rest of the domain and the\n4\n\n\fboundary conditions on the other parts of the boundary\". In other words, \"good boundary conditions\"\nshould determine, (within our approximation of the half plane and frozen coefficients) the solutions of\nthe equation of the form (2.4) with Re(λ) < 0. Obviously, the number of such boundary conditions\nis m. A set of m boundary conditions enjoying the above property is said to satisfy the Shapiro Lopatinskii condition. There are several equivalent specific definitions of it. We shall mainly use the\nfollowing one:\nDefinition 2.1. Let P be elliptic at a point O of the boundary. A set of m boundary conditions\nBj (x, ∂α ) = gj (x), j = 1, ...m is said to satisfy the SL condition at O when, after a local change to\nnew coordinates with origin at O and axis x1 tangent to the boundary, taking only the higher order\nterms and coefficients frozen at O in the equation and the boundary conditions, the solutions of the\nform (2.4) with Re(λ) < 0 obtained by formal tangential Fourier transform are well defined by the\nboundary conditions.\nRemark 2.1. The above definition should be understood in the sense of formal solution for any given\n(real and non-zero) ξ1 . The SL condition is not concerned with solutions in certain spaces. It is purely\nalgebraic, and concerns m conditions imposed to the m (decreasing with x2 ) linearly independent\nsolutions of the ODE obtained from P0 by formal tangential Fourier transform. This also amounts to\nsaying that imposing the boundary conditions equal to zero, the considered solutions must vanish. In\nfact, the SL condition amounts to non-vanishing of a certain determinant, and as so it is generically\nsatisfied: conditions not satisfying it are rarely encountered. In particular, in \"well-behaved problems\", when coerciveness on appropriate spaces is proved, the SL condition is not usually checked.\nIt should also be noted that the SL condition is independent of a change of variables, and, in most\ncases, the change is trivial. On the other hand, there are also definitions of the SL condition without\nchange of variables. Last, it should also be noted that the SL condition has nothing to do with lower\norder terms and the right hand side of the boundary conditions (as ellipticity is only concerned with\nthe principal symbol); it is merely a condition of adequation of the principal part of the boundary\noperators to the principal part of the equation.\nLet us consider, as an exercise, examples for the laplacian.\nP = −∂12 − ∂22\n\n(2.5)\n\nThe principal symbol is ξ12 + ξ22 so that the equation is elliptic of order 2, then m = 1. \"Good\nboundary conditions\" are in number of 1.\nLet us try the boundary condition (Dirichlet):\nu = 0.\n\n(2.6)\n\nTaking any point of the boundary and (x1 , x2 ) with origin at that point, tangent and normal to the\nboundary respectively, the equation is the same as in the initial variables, and formal tangential Fourier\ntransform gives\n(ξ12 − ∂22 )û(ξ1 , x2 ) = 0\n(2.7)\nand the solutions are\nû(ξ1 , x2 ) = C1 (ξ1 )e|ξ1 |x2 + C2 (ξ1 )e|ξ1 |x2 .\n\n(2.8)\n\nTaking only the exponentially decreasing for x2 > 0 we only have\nû(ξ1 , x2 ) = C1 (ξ1 )e−|ξ1 |x2 .\n5\n\n(2.9)\n\n\fNow, imposing the \"tangential Fourier transform\" of (2.6):\nû(ξ1 , 0) = 0,\n\n(2.10)\n\nwe see that it vanish identically. Then, the Dirichlet boundary condition satisfies the SL condition for\nthe laplacian.\nThe case of the Neumann boundary condition for the laplacian\n∂u\n= 0.\n(2.11)\n∂n\n∂u\nis analogous. (Note also that the Fourier condition ( ∂n\n) + au = g is the same, as only the higher\norder terms are taken in consideration). Proceeding as before, we have, instead of (2.10):\n∂2 û(ξ1 , 0) = −|ξ1 |C1 (ξ1 ) = 0,\n\n(2.12)\n\nwhich also gives C1 (ξ1 ) = 0 and then û = 0. Thus, (2.10) satisfies SL for (2.5).\nOppositely, the boundary condition:\n(∂s − i∂n )u = 0,\n\n(2.13)\n\nwhere s and n denote the arc of the boundary and the normal, does not satisfy the SL condition for the\nlaplacian. Indeed, taking the new local axes, s and n become x1 and x2 , and after tangential Fourier\ntransform:\nˆ 1 , 0) = 0,\n(−iξ1 − i∂2 )u)(ξ\n(2.14)\nwhich, applied to (2.9) becomes:\n(−iξ1 + i|ξ1 |)C1 (ξ1 ) = 0.\n\n(2.15)\n\nwe then see that C1 (ξ1 ) vanishes for negative ξ1 , but is arbitrary for positive ξ1 . In fact , the boundary\ncondition (2.13) is \"transparent\" for solutions of the form (2.9) with positive ξ1 .\nRemark 2.2. As it is apparent in the last example, when the SL condition is not satisfied, there is\nsome kind of \"local non-uniqueness\", where \"local\" recalls that only higher order terms are taken in\nconsideration, and the coefficients are frozen at the considered point of the boundary.\nThe SL condition appears as some previous condition for solving elliptic problems. It is apparent\nthat some pathology is involved at points of the boundary where it is not satisfied.\nLet us mention, before closing this section, that the boundary conditions may be different on\ndifferent parts of the boundary specially on different connected components of it (when there are\npoints of junction of the various regions, usually singularities appear at that points).\n\n3 An explicit perturbation problem where the SL condition is not satisfied on a part of the boundary of the limit problem\nLet Ω be the strip (−∞, +∞) × (0, 1) of the (x, y) plan. We denote by Γ0 and Γ1 the boundaries\ny = 0 and y = 1 respectively. We then consider the boundary value problem depending on the\nparameter ε:\n\n △uε = 0 on Ω\nuε = 0 on Γ0\n(3.16)\n\n2\n∂x u + (i + ε )∂y u = φ on Γ1\n6\n\n\fwhere φ is the data of the problem. It is a given function of x, that we shall suppose sufficiently\nsmooth, tending to 0 at infinity. We shall solve it by x → ξ Fourier transform; it is easily seen that we\nalso have automatically u → 0 for x → ∞, which may be added to the boundary conditions.\nThe boundary condition on Γ0 is the Dirichlet one, which satisfies SL for the laplacian. Oppositely,\nthe boundary condition on Γ1 satisfies it for ε > 0 (this is easily checked), not at the limit ε = 0 (see\nthe end of the previous section). The problem is to solve for ε > 0 and to study the behavior for ε\ngoing to zero.\nDenoting byˆthe x → ξ Fourier transform, ûε is defined on the same Ω domain, but of the (ξ, y)\nplane. The solutions of the (transform of) equation and the boundary condition on Γ0 are of the form\nûε (ξ, y) = α(ξ) sinh(ξy)\n\n(3.17)\n\nwhere α denotes an unknown function to be determined with the boundary condition on Γ1 . It will\nprove useful to write the solution under the form\nûε (ξ, y) = β̂ ε (ξ)\n\nsinh(ξy)\nsinh(ξ)\n\n(3.18)\n\nfor the new unknown β̂ ε (ξ), which is the transform of the trace uε (x, 0). Imposing the Fourier transform of the boundary condition on Γ1 we have:\n− iξ β̂ ε (ξ) + (i + ε2 )\nSo that:\nβ̂ ε (ξ) =\n\ncosh(ξ) ε\nβ̂ (ξ)ξ = φ̂(ξ).\nsinh(ξ)\n\nφ̂(ξ)\n\u0011\n.\n−iξ 1 − coth(ξ) + ε2 ξ coth(ξ)\n\u0010\n\n(3.19)\n\n(3.20)\n\nIn order to study this function, we should keep in mind that the expression (1 − coth(ξ)) decays for\nξ → +∞ as 2e−2ξ . Then, at the limit ε = 0 we have\nβ̂ 0 (ξ) =\n\nφ̂(ξ)\n.\n−iξ(1 − coth(ξ))\n\n(3.21)\n\nφ̂(ξ) 2ξ\ne .\n−iξ\n\n(3.22)\n\nFor ξ → +∞ this function behaves as\nβ̂ 0 (ξ) ≈ 2\n\nThis shows (unless in the case of very special data φ with very fast decaying Fourier transform) that\nβ̂ 0 (ξ) is not a tempered distribution, and the inverse Fourier transform is an analytical function in Z ′ .\nNevertheless, for ε > 0, β̂ ε (ξ) is \"well-behaved\" for ξ → +∞ as\nβ̂ ε (ξ) ≈\nThis specific behavior depends on that of\n\nφ̂\nξ,\n\nφ̂(ξ)\n.\nξε2\n\n(3.23)\n\nso that in most cases will be decreasing, but multiplied\n\nε−2 .\n\nby the factor\nWhen ε > 0 (small but not 0) is fixed, β̂ ε (ξ) is approximatively given by (3.21)\nfor \"finite\" ξ and by (3.23) for ξ going to +∞. It is easily seen that the sup in modulus of |β̂ ε (ξ)| is\n\n7\n\n\flocated in the region where both terms in the denominator of the right hand side of (3.20) are of the\nsame order (so that no one of them may ble neglected). This gives\nξ = O(log(1/ε)).\n\n(3.24)\n\nIt appears that β̂ ε (ξ) consists mainly of Fourier components which tend to infinity algebraically\nas ε goes to zero with ξ tending to infinite \"slowly\" as in (3.24). this is somewhat analogous to the\nexample, given in the introduction, of a sequence of functions converging to an analytical functional.\nComing back to (3.18), the main properties of the behavior of uε (x, 1) may be thrown:\n- The trace uε (x, 1) = β ε (x) on the boundary Γ1 which bears the \"pathological boundary condition\" mainly consists of large oscillations with wave length 1/ log(1/ε) (which tends to 0 very slowly\nas ε → 0). The amplitude of that oscillations grows nearly as ε−2 . The limit ε → 0 does not exist in\ndistribution theory; it constitutes a complexification process.\n- Out of the trace on Γ1 , (i. e. for 0 < y < 1), the behavior is analogous, but of lower amplitude,\nwhich is exponentially decreasing going away of Γ1 . We recover properties of the non-uniqueness\nassociated with the failed SL condition.\nBefore concluding this section, we would like to show some analogy between the previous limit\nproblem and the Cauchy elliptic problem, which is a classical example of ill-posed problem, without\nsolution in general.\nWe consider the same domain Ω as before, but we now impose two boundary conditions on Γ0\nand no condition on Γ1 . Namely\n\n △v = 0 on Ω\nv = ψ on Γ0\n(3.25)\n\n∂y v = 0 on Γ0\nTaking as above the x → ξ Fourier transform, it follows immediately that\nv̂(ξ, y) = ψ̂(ξ) cosh(ξy).\n\n(3.26)\n\nWhere it is apparent that the behavior for ξ → ∞ is exponentially growing (unless in the case when\nψ̂(ξ) decays faster than e−|ξ| ) so that it is not tempered and the inverse Fourier transform does not\nexist within distribution theory.\n\n4\n\nA model variational sensitive singular perturbation, [EgMeSa07]\n\n4.1 Setting of the problem\nLet Ω be a two dimensional compact manifold with smooth (of C ∞ class) boundary ∂Ω = Γ0 ∪Γ1\nof the variable x = (x1 , x2 ), where Γ0 and Γ1 are disjoint; they are one - dimensional compact smooth\nmanifolds without boundary, then diffeomorphic to the unit circle. Let a and b be the bilinear forms\ngiven by:\nZ\n△u △v dx,\n(4.27)\na(u, v) =\nΩ\n\nb(u, v) =\n\nZ\n\n2\nX\n\nΩ α,β=1\n\n8\n\n∂αβ u ∂αβ v dx.\n\n(4.28)\n\n\fWe consider the following variational problem (which has possibly only a formal sense)\n\u001a\nFind uε ∈ V such that, ∀v ∈ V\na(uε , v) + ε2 b(uε , v) = hf, vi,\n\n(4.29)\n\nwhere the space V is the \"energy space\" with the essential boundary conditions on Γ0\nV = {v ∈ H 2 (Ω); v|Γ0 =\n\n∂v\n= 0},\n∂n |Γ0\n\n(4.30)\n\nwhere n, t denotes the normal and tangent unit vectors to the boundary Γ with the convention that the\nnormal vector n is inwards Ω. It is easily checked that the bilinear form b is coercive on V . Moreover,\nwe immediately obtain the following result. For all ε > 0 and for all f in V ′ , the variational problem\n(4.29) is of Lax-Milgram type and it is a self-adjoint problem which has a coerciveness constant larger\nthan cε2 , with c > 0.\nThe equation on Ω associated with problem (4.29) is:\n(1 + ε2 )△2 uε = f on Ω,\n\n(4.31)\n\nas both forms a and b give the laplacian. As for the boundary conditions on Γ0 , they are \"principal\"\ni. e. they are included in the definition of V , (5.4). As for conditions on Γ1 , they are \"natural\",\nclassically obtained from the integrated terms by parts. Those coming from the form b are somewhat\ncomplicated; we shall not write them, as the problem with ε > 0 is classical. For ε = 0 these\nconditions (coming from form a) are: △u = ∂△u\n∂n = 0, on Γ1 .\nAs a matter of fact, the full limit boundary boundary value problem is:\n 2 0\n△ u = f on Ω\n\n\n0\n\nu = ∂u\n∂n = 0, on Γ0\n(4.32)\n\n△u0 = 0 on Γ1\n\n\n∂\n△u0 = 0 on Γ1 .\n− ∂n\n\nLet us check that the boundary conditions on Γ1 (i. e; the two last lines of (5.6)) do not satisfy\nthe SL condition for the elliptic operator △2 . Indeed, proceeding as in sect. 2, by formal tangential\nFourier transform\n(−ξ12 + ∂22 )2 û = 0.\n\n(4.33)\n\nv̂ = (Ae−|ξ1 |x2 + Cx2 e−|ξ1 |x2 )\n\n(4.34)\n\nwhich yields that\n(as well as analogous terms with +|ξ| instead of −|ξ|, which are not taken into account as exponentially growing inwards the domain). Here, according to SL theory, x2 is the coordinate normal to the\nboundary, after taking locally tangent and normal axes, (which do not modify the equation △2 ). The\n(tangential Fourier transform of the) boundary conditions on Γ1 are:\n(−ξ12 + ∂22 )û = 0\n\n(4.35)\n\n∂2 (−ξ12 + ∂22 )û = 0.\n\n(4.36)\n\nand\n\n9\n\n\fIt is immediately seen that the previous solutions (4.34) with C = 0 and any A 6= 0 satisfy both\nconditions (note that its laplacian vanishes everywhere, then it vanishes as well as its normal derivative\non the boundary). So, the SL condition is not satisfied on Γ1 .\nBefore going on with our study, we note that the limit problem (4.32) implies an elliptic Cauchy\nproblem for the auxiliary unknown\nv 0 = △u0 .\n(4.37)\nIndeed, system (4.32) gives in particular:\n\n0\n △v = f on Ω\nv 0 = 0 on Γ1\n ∂v0\n− ∂n = 0 on Γ1 .\n\n(4.38)\n\nwhich is precisely the Cauchy problem for the laplacian.\nAs mentioned in section 3, this is a classical ill - posed problem, and the solution does not exist\nin general. Oppositely, uniqueness of the solution holds true (uniqueness theorem of Holmgren and\nanalogous, see for instance [CoHi62]).\n\n4.2 The heuristic integral approach\nThe aim of this section is the construction, in a heuristic way, of an approximate description of the\nsolutions uε of the model problem in the previous section for small values of ε.\nFrom the general theory of singular perturbations of the form (4.29), we know that our assumption\na(v, v)1/2 defines a norm on V,\n\n(4.39)\n\nis crucial. Indeed, when it is not satisfied, the problem is said to be \"non inhibited\". In such a case, it\nhas a kernel which contains non vanishing terms and then, it is easy to establish that the asymptotic\nbehaviour of the solution uε of (4.29) is described by a variational problem in this kernel. The previous\nfact is not surprising as soon as we consider the following minimization problem, which is equivalent\nto (4.29),\n\u001a\nMinimize in V,\n(4.40)\na(uε , uε ) + ε2 b(uε , uε ) − 2hf, uε i.\nIndeed, when ε goes to zero, the natural trend consists in avoiding the a-energy which occurs with the\nfactor 1 and leaving the b-energy which has a factor ε2 .\nClearly, this is not possible when (4.39) is satisfied since the kernel reduces to the zero function.\n∂v\nvanish\nNevertheless, in our case, a(v, v) = 0 implies △v = 0 and, as v ∈ V , the traces of v and ∂n\non Γ0 , so that (4.39) follows from the uniqueness theorem for the Cauchy problem. This uniqueness\nis classical, but the solution u is unstable in the sense that there can be \"large u\" in the V norm (or\nin other spaces) for \"small f \" in the V ′ norm (or in other spaces). It then appears that the same\nreasoning shows that for small values of ε, the solution uε will be precisely among elements with\nsmall a(uε , uε ), that is to say with small △uε in L2 .\n\n4.3 The Γ0 layer\nLet us now build such functions uε ∈ V with very smallk△uε kL2 . The main idea is to consider\nfunctions in a larger space than the space of functions v of V such that △v = 0 (which only contains\nthe function v = 0). The functions of this bigger space will not satisfy the two boundary conditions\n10\n\n\fon Γ0 that are satisfied by any function of V . Then we shall modify it in a narrow boundary layer\nalong Γ0 in order to satisfy the two boundary conditions with small value of a-energy.\nMore precisely, let us consider the vector space:\nG0 = {v ∈ C ∞ (Ω), △v = 0 on Ω, v = 0 on Γ0 }.\n\n(4.41)\n\nRemark 4.1. We observe that every function of G0 satisfies one of the boundary conditions on Γ0\nwhich are satisfied by any element of V . For simplicity, we have chosen v = 0 on Γ0 , but we could\n∂v\n= 0 on Γ0 as well. On the other hand, the regularity assumption C ∞ is\nchoose the other one ∂n\nslightly arbitrary. Since, we will consider the completion of G0 with respect to some norm, this point\nis irrelevant.\nObviously, as the Dirichlet problem for the laplacian on Ω is well posed in C ∞ , the space G0 is\nisomorphic with the space of traces on Γ1 :\n{w ∈ C ∞ (Γ1 )}\nthe isomorphism is obtained by solving the Dirichlet problem:\n\n △w̃ = 0 on Ω,\nw̃ = 0 on Γ0 ,\n\nw̃ = w on Γ1 .\n\n(4.42)\n\n(4.43)\n\nIn the sequel, we shall consider indifferently the functions w̃ on Ω or their traces w on Γ1 .\nIn fact, the exact function uε is a solution of (4.31), which we are searching to describe approximatively in order to define a space as small as possible (incorporating the main features of the solution)\nto solve the minimization problem. More precisely, according to our previous comments, we are interested in the \"most singular parts\" of uε in the sense of the part corresponding to the high frequency\nFourier components. As we shall see in the sequel, it turns out that these singular parts may be obtained by modification of the functions w̃ on a boundary layer close to Γ0 ; this layer is narrower when\nthe considered Fourier components are of higher frequency; in fact, the layer only exists because we\nonly consider high frequencies. This allows to make an approximation which consists in using locally\ncurvilinear coordinates defined by the arc of Γ0 and the normal, and handling them as cartesian coordinates. Clearly, this approximation is exact only on the very Γ0 , but more and more precise as we\napproach of Γ0 , i. e. as the considered frequencies grow.\nOnce the layer is constructed, we compute the a-energy of it, as well as the ε2 b-energy of the\n(modified) w̃ function, in order to consider the variational problem (4.29) in the restricted space.\nLet us first exhibit the local structure of the Fourier transform of w̃ close to Γ0 . According to\nour general considerations on the heuristic procedure, ŵ may be considered (after multiplying by an\nappropriate cutoff function) of \"small support\" near a point P0 of Γ0 . Taking local tangent and normal\ncartesian coordinates y1 , y2 , we have, within our approximation,\n\u0010 ∂2\n∂2 \u0011\n+\nw̃ = 0 on R × (0, t),\n∂y12 ∂y22\n\n(4.44)\n\nF(w̃j )(ξ1 , y2 ) = λe|ξ1 |y2 + μe−|ξ1 |y2 .\n\n(4.45)\n\nfor some t > 0. Taking the tangential Fourier transform, we obtain:\n\nIt is worthwhile defining the local structure of ŵ in the vicinity of Γ0 using the \"Cauchy\" data w̃ and\n∂2 w̃ on Γ0 (note that the solution of the Cauchy problem is unique, so that the Cauchy data determine\n11\n\n\fthe solution). As ŵ vanishes on Γ0 , the local structure is then determined by ∂2 w̃ on Γ0 . Taking the\ntangential Fourier transform this gives:\n\u0010 ∂ w̃\n\u0010 \u0011\n\u0011 sinh(|ξ |y )\nj\n1 2\nF w̃j (ξ1 , y2 ) = F\n.\n∂y2 |y2 =0\n|ξ1 |\n\n(4.46)\n\nWe now proceed to the modification of w̃ into w̃a in a narrow boundary layer of Γ0 in order\nto satisfy (always within our approximation) the equation coming from (4.31) for small ε. Using\nconsiderations similar to those leading to (4.44), this amounts to\n\u0010 ∂2\n∂ 2 \u0011(2) a\n+\nw̃ = 0 on R × (0, t).\n∂y12 ∂y22\n\n(4.47)\n\nhence the tangential Fourier transform reads\n\u0010\n\n− |ξ1 |2 +\n\n∂ 2 \u0011(2)\nF(w̃a ) = 0.\n∂y22\n\n(4.48)\n\nConsequently, F(w̃a ) should take the form\nF(w̃a )(ξ1 , y2 ) = (α + γy2 )e|ξ1 |y2 + (β + δy2 )e−|ξ1 |y2 .\n\n(4.49)\n\nThe four unknown constants should be determined by imposing that w̃a and ∂2 w̃a vanish for\ny2 = 0 and the \"matching condition\" of the layer, i.e., out of the layer, we want w̃ja to match with the\ngiven function w̃j . Since |ξ1 | >> 1, then |ξ1 |y2 >> 1 means that y2 >> |ξ11 | (but we still impose\nthat y2 is small in order to be in a narrow layer of Γ0 ); this is perfectly consistent, as we will only\nuse the functions for large |ξ1 |, hence the terms with\nβ and δ are \"boundary layer terms\"\n\u0011\n\u0010 coefficients\n1\ngoing to zero out of the layer (i.e. for |y2 | >> O |ξ1 | ), see perhaps [Ec79] or [Il91] for generalities\non boundary layers and matching. This gives\n\u0010 ∂ w̃\n\u0010 \u0011\n\u0011 sinh(|ξ |y )\nj\n1 2\nF w̃j (ξ1 , y2 ) = F\n(\n− y2 e−|ξ1 |y2 ).\n∂y2 |y2 =0\n|ξ1 |\n\n(4.50)\n\nThis amounts to saying that the modification of the function w̃j consists in adding to it the inverse\nFourier transform of\n\u0010 ∂ w̃\n\u0011\n\u0011\u0010\nj\nF\n(4.51)\n− y2 e−|ξ1 |y2 .\n∂y2 |y2 =0\n\nDefining on Γ0 the family (with parameter y2 ) of pseudo-differential smoothing operators δσ(ε, D1 , y2 )\nwith symbol:\nδσ(ε, ξ1 , y2 ) = −y2 e−|ξ1 |y2 h(ε, ξ, y2 ),\n(4.52)\nwhere h is an irrelevant cutoff function avoiding low frequencies; it is equal to 1 for high frequencies\n(see [EgMeSa07] for details), we see that the modification of the function w̃:\nδw̃ = w̃a − w̃\nis precisely the action of δσ(ε, D1 , y2 ) on\n\n(4.53)\n\n∂ w̃j\n∂y2 (y1 , 0):\n\nδw̃ = δσ(ε, D1 , y2 )\n12\n\n∂ w̃j\n(y1 , 0).\n∂y2\n\n(4.54)\n\n\fLet us now compute the leading terms of the a-energy of the modified function w̃a .\nLet ṽ and w̃ be two elements in G0 and ṽ a , w̃a the corresponding elements modified in the boundary layer. As the given ṽ and w̃ are harmonic in Ω, the a-form is only concerned with the modification\nterms δṽ and δw̃. Then, within our approximation, we have:\nZ\nZ +∞\na\na\ndy1\na(ṽ , w̃ ) =\n△(δṽ)△(δw̃) dy2 .\n(4.55)\nΓ0\n\n0\n\nTo compute this expression, we first write ṽ and w̃ as sum of terms with \"small support\" (by\nmultiplying by a partition of unity): ṽ = Σj ṽj and w̃ = Σj w̃j . Then, within our approximation,\nthe integral is on the halfplane R × (0, +∞) of the variables y1 , y2 . Taking the tangential Fourier\ntransform and using the Parceval-Plancherel theorem, we have\nZ +∞\nZ +∞ \u0010 2\n\u0011\n\u0001\n∂ṽj\nd\na\na\n2\ndξ1\n×\na(ṽ , w̃ ) = Σj,k\n−\nξ\n1 δσ(ε, ξ, y2 )F\n2\n∂y2 |y2 =0\ndy2\n−∞\n0\n\u0010 d2\n\u0011\n\u0001\n2 δσ(ε, ξ, y )F ∂ w̃k\ndy2 .\n−\nξ\n2\n1\n∂y2 |y2 =0\ndy22\nHence, on account of (4.52) and integrating in y2 , this yields\nZ +∞\n∂ w̃2,k\n∂ w̃1,j\na\na\n2|ξ1 |\na(ṽ , w̃ ) = Σj,k\nh2 (ε, ξ, y2 ) dξ1 .\n∂y2 |y2 =0 ∂y2 |y2 =0\n−∞\n\n(4.56)\n\n∂ ṽ\n\nThis expression (4.56) only depends on the traces ∂y2j\n(y1 ) and ∂∂yw̃2k\n(y1 ), which are func|y2 =0\n|y2 =0\ntions defined on Γ0 .\nWe now simplify this last expression using a sesquilinear form involving pseudo-differential operators.\nIndeed, denoting by P ( ∂y∂ 1 ) the pseudo-differential operator with symbol\nP (ξ1 ) = (2|ξ1 |)1/2 h(ε, ξ, y2 ),\nand summing over j and k, we obtain that\nZ\n∂ ∂ṽ\n∂ ∂ w̃\na\na\nP( )\nds.\na(ṽ , w̃ ) =\nP( )\n∂s ∂n |Γ0 ∂s ∂n |Γ0\nΓ0\n\n(4.57)\n\n(4.58)\n\n4.4 Taking account of the perturbation term ε2 b.\nWe now consider the minimization problem (4.40) on G0 instead of on V . Obviously, the a-energy\nshould be computed using formula (4.58). This modified problem should involve the a-energy and\nthe ε2 b-energy. A natural space for handling it should be the completion G of G0 with the norm:\nZ\n2\n∂ ∂v\nP( )\nkvk2G =\nds + b(v, v).\n(4.59)\n∂s ∂n |Γ0\nΓ0\nIt is easily seen that G is the space of the harmonic functions of H 2 (Ω) vanishing on Γ0 ; according\nto (4.43) it may be identified with the space of traces H 3/2 (Γ1 ).\nIt will prove useful to write another (asymptotically equivalent for large |ξ1 |) definition of this\nproblem. Indeed, the elements w̃ of G0 (and then of G) may be identified (by solving the problem\n13\n\n\f(4.43)) with their traces w on Γ1 . Moreover, as the functions w̃ are harmonic, we may exhibit their\nlocal behavior in the vicinity of any point x0 ∈ Γ1 . Proceeding as in (4.44), (4.45) and taking only the\ndecreasing exponential towards the domain (this is the classical approximation for the construction of\na parametrix) we have:\nF(w̃)(ξ1 , y2 ) = F(w)(ξ1 )e−|ξ1 |y2 ,\n(4.60)\nwhere y1 , y2 are the tangent and the normal (inwards the domain) vectors. Then, it is apparent that\nthe b-energy is concentrated in a layer close to Γ1 and we may compute it in an analogous way to the\ncalculus that was done for the a-energy (4.58). Indeed, using Parseval-Plancherel Theorem and within\nour approximation, we have\nZ +∞ X\nZ +∞\ndy1\n|∂αβ w̃|2 dy2\n(4.61)\nb(w̃, w̃) =\n0\n\n−∞\n\n=\n\nZ\n\n+∞\n\ndξ1\n−∞\n\nZ\n\n0\n\nα,β\n+∞ \u0010\nξ14 |F(w̃)|2\n\n+ 2ξ12 |F(\n\n∂ w̃ 2\n∂ 2 w̃ \u0011\n)| + |F( 2 )|2 dy2 ,\n∂y2\n∂y2\n\nhence, recalling (4.60) and integrating over y2 , we get:\nZ +∞\nb(w̃, w̃) = 2\n|ξ1 |3 |F(w)|2 dξ1 .\n\n(4.62)\n\n−∞\n\n∂\nThen, defining the pseudo-differential operator Q( ∂s\n) of order 3/2 with principal symbol\n\n√\nor equivalently as previously:\n\n√\n\n2|ξ1 |3/2 ,\n\n(4.63)\n\n2(1 + |ξ1 |2 )3/4 ,\n\n(4.64)\n\nwe have (always within our approximation):\nb(ṽ, w̃) =\n\nZ\n\nΓ1\n\nQ(\n\n∂\n∂\n)v Q( )w ds.\n∂s\n∂s\n\n(4.65)\n\nWe observe that the operator Q is only concerned with the trace on Γ1 , so that we may either write\nṽ, w̃ or v, w in (4.65).\nThe formal asymptotic problem becomes:\n(\nFind ṽ ε ∈ G such that ∀w̃ ∈ G\nR\nR\n(4.66)\n∂ w̃\n∂ ṽε\n2\nε\nΓ0 P ( ∂n )P ( ∂n ) ds + ε Γ1 Q(ṽ ) Q(w̃) ds = hf, wi.\n\n4.5 The formal asymptotics and its sensitive behaviour\n\nIn order to exhibit more clearly the unusual character of the problem, we shall now write (4.66)\nunder another equivalent form involving only the traces on Γ1 . Coming back to (4.43), let us define\nw̃\nR0 as follows. For a given w ∈ C ∞ (Γ1 ) we solve (4.43) and we take the trace of ∂∂n\non Γ0 , then\n∂ w̃\n= R0 w.\n∂n |Γ0\n\n14\n\n(4.67)\n\n\fUsing the regularity properties of the solution of (4.43), it follows that R0 w is in C ∞ (Γ0 ). In fact,\nR0 is a smoothing operator, sending any distribution into a C ∞ function. Then, (4.66) may be written\nas a problem for the traces on Γ1 :\n(\nFind v ε ∈ H 3/2 (Γ1 ) such that ∀w ∈ H 3/2 (Γ1 )\nR\nR\nR\n(4.68)\n∂\n∂\nε P ( ∂ )R w ds + ε2\nε Q( ∂ )w ds =\nP\n(\n)R\nv\nQ(\n)v\n0\n0\n∂s\n∂s\n∂s\n∂s\nΓ0\nΓ1\nΩ F w̃ dx,\nwhere the configuration space is obviously H 3/2 (Γ1 ). The left hand side with ε > 0 is continuous\nand coercive. We then define the new operators\nA = R∗0 P ∗ P R0 ∈ L(H s (Γ1 ), H r (Γ0 )), ∀s, r ∈ R,\n∗\n\nB = Q Q ∈ L(H\n\n3/2\n\n(Γ1 ), H\n\n−3/2\n\n(Γ1 )\n\nwhere R∗0 is the adjoint of R0 (which is also smoothing)), (4.68) becomes\n\u0011\n\u0010\nA + ε2 B v ε = F, in H −3/2 (Γ1 ).\n\n(4.69)\n(4.70)\n\n(4.71)\n\nObviously, B is an elliptic pseudo-differential operator of order 3, whereas A is a smoothing (non\nlocal) operator.\nThis problem is somewhat simpler than the initial one (as on a manifold of dimension 1), showing the interest of the formal asymptotics. It enters in a class of sensitive problems addressed in\n[EgMeSa07] section 2. It is apparent that the limit problem (for ε = 0) has no solution in the distribution space for any F not contained in C ∞ . Indeed, on the compact manifold Γ0 , any distribution is\nin some H −m (Γ0 ) space, which is send into C ∞ by the smoothing operator A.\nRemark 4.2. The drastically non local character of the smoothing operator A follows from the fact\nthat it involves R0 and R∗0 (see(4.67)). This is the reason why the problem may be reduced to another\none on the traces on Γ1 . The possibility of that reduction is a consequence of our approximation,\nwhere the configuration space is formed by harmonic functions.\n\nReferences\n[AgDoNi59] S. Agmon, A. Douglis and L. Nirenberg, Estimates near the boundary for solutions of\nelliptic partial differential equations satisfying general boundary conditions, Commun.\nPure. Applied Math., vol. 12, p. 623-727, 1959.\n[BeMiSa08] F . Bechet, O. Millet and E. Sanchez-Palencia, Singular perturbations generating complexification phenomena for elliptic shells, Comput. Mechanics, to appear.\n[CoHi62]\n\nR. Courant and D. Hilbert Methods of Mathematical Physics, vol. II New York, Interscience, 1962.\n\n[Ec79]\n\nW. Eckhaus, Asymptotic Analysis of Singular perturbatuions North Holland, Amsterdam,\n1979.\n\n[EgMeSa07] Y. V. Egorov, N. Meunier and E. Sanchez-Palencia, Rigorous and heuristic treatment of\ncertain sensitive singular perturbations, J. Math. Pures. Appl. 88, 123–147, 2007.\n\n15\n\n\f[EgMeSa09] Y. V. Egorov, N. Meunier and E. Sanchez-Palencia, Rigorous and heuristic treatment of\nsensitive singular perturbations in shell theory, Approximation Theory and PDEs. Topics\naround the Research of Vladimir Maz'ya, to appear.\n[EgSc97]\n\nY. V. Egorov and B. W. Schulze, Pseudo-differential operators, singularities and applications, Birkhauser, Berlin 1997.\n\n[GeCh64] I. M. G ELFAND and G. S HILOV, Generalized functions, Acad. Press, New York - London,\n1964.\n[Il91]\n\nA. M. Il'in, Matching of Asymptotic Expansions of Solutions of Boundarey Value Problems Amer. Math. Soc. 1991.\n\n[MeSa06] N. M EUNIER and E. S ANCHEZ -PALENCIA, Sensitive versus classical perturbation problem via Fourier transform, Math. Models Methods Appl. Sci. 16, 1783–1816, 2006.\n[MeSaHuSa07] N. M EUNIER, J. S ANCHEZ H UBERT and E. S ANCHEZ PALENCIA, Various kinds of\nsensitive singular perturbations, Ann. Blaise Pascal, 14, no. 2, 199–242.\n[SaHuSa97] J. Sanchez Hubert and E. Sanchez Palencia Coques élastiques minces. Propriétés asymptotiques, Masson, Paris 1997.\n[Sc50]\n\nL. Schwartz, Théorie des Distributions, Hermann, Paris, 1950.\n\n[Ta81]\n\nM. E. Taylor, Pseudodifferential Operators, Princeton University press, Princeton, 1981.\n\n16\n\n\f"}