{"id": "http://arxiv.org/abs/0803.0664v2", "guidislink": true, "updated": "2008-06-05T15:39:49Z", "updated_parsed": [2008, 6, 5, 15, 39, 49, 3, 157, 0], "published": "2008-03-05T13:58:25Z", "published_parsed": [2008, 3, 5, 13, 58, 25, 2, 65, 0], "title": "Scaling and super-universality in the coarsening dynamics of the 3d\n  random field Ising model", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0803.3963%2C0803.4361%2C0803.1028%2C0803.0308%2C0803.0729%2C0803.3925%2C0803.2944%2C0803.0784%2C0803.1984%2C0803.2873%2C0803.0277%2C0803.1841%2C0803.0096%2C0803.2270%2C0803.2557%2C0803.2089%2C0803.2366%2C0803.2886%2C0803.3746%2C0803.2387%2C0803.0303%2C0803.0327%2C0803.1232%2C0803.2210%2C0803.4006%2C0803.4484%2C0803.3351%2C0803.4021%2C0803.0732%2C0803.0664%2C0803.1987%2C0803.1811%2C0803.1950%2C0803.2674%2C0803.3678%2C0803.2395%2C0803.0457%2C0803.3105%2C0803.0681%2C0803.0881%2C0803.3550%2C0803.3821%2C0803.0094%2C0803.3062%2C0803.3869%2C0803.1653%2C0803.2719%2C0803.1331%2C0803.0927%2C0803.0343%2C0803.3712%2C0803.2044%2C0803.2283%2C0803.4234%2C0803.1528%2C0803.3968%2C0803.1397%2C0803.3220%2C0803.2244%2C0803.0081%2C0803.1892%2C0803.1634%2C0803.0668%2C0803.4000%2C0803.4078%2C0803.3423%2C0803.2346%2C0803.1379%2C0803.2707%2C0803.0165%2C0803.1244%2C0803.2532%2C0803.3629%2C0803.1404%2C0803.0221%2C0803.0225%2C0803.2103%2C0803.1250%2C0803.3848%2C0803.0477%2C0803.1830%2C0803.3251%2C0803.0065%2C0803.2685%2C0803.1309%2C0803.4473%2C0803.1718%2C0803.0082%2C0803.3688%2C0803.3663%2C0803.3268%2C0803.0360%2C0803.2203%2C0803.1608%2C0803.0895%2C0803.2718%2C0803.4496%2C0803.1616%2C0803.1513%2C0803.1951%2C0803.0631&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Scaling and super-universality in the coarsening dynamics of the 3d\n  random field Ising model"}, "summary": "We study the coarsening dynamics of the three-dimensional random field Ising\nmodel using Monte Carlo numerical simulations. We test the dynamic scaling and\nsuper-scaling properties of global and local two-time observables. We treat in\nparallel the three-dimensional Edward-Anderson spin-glass and we recall results\non Lennard-Jones mixtures and colloidal suspensions to highlight the common and\ndifferent out of equilibrium properties of these glassy systems.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0803.3963%2C0803.4361%2C0803.1028%2C0803.0308%2C0803.0729%2C0803.3925%2C0803.2944%2C0803.0784%2C0803.1984%2C0803.2873%2C0803.0277%2C0803.1841%2C0803.0096%2C0803.2270%2C0803.2557%2C0803.2089%2C0803.2366%2C0803.2886%2C0803.3746%2C0803.2387%2C0803.0303%2C0803.0327%2C0803.1232%2C0803.2210%2C0803.4006%2C0803.4484%2C0803.3351%2C0803.4021%2C0803.0732%2C0803.0664%2C0803.1987%2C0803.1811%2C0803.1950%2C0803.2674%2C0803.3678%2C0803.2395%2C0803.0457%2C0803.3105%2C0803.0681%2C0803.0881%2C0803.3550%2C0803.3821%2C0803.0094%2C0803.3062%2C0803.3869%2C0803.1653%2C0803.2719%2C0803.1331%2C0803.0927%2C0803.0343%2C0803.3712%2C0803.2044%2C0803.2283%2C0803.4234%2C0803.1528%2C0803.3968%2C0803.1397%2C0803.3220%2C0803.2244%2C0803.0081%2C0803.1892%2C0803.1634%2C0803.0668%2C0803.4000%2C0803.4078%2C0803.3423%2C0803.2346%2C0803.1379%2C0803.2707%2C0803.0165%2C0803.1244%2C0803.2532%2C0803.3629%2C0803.1404%2C0803.0221%2C0803.0225%2C0803.2103%2C0803.1250%2C0803.3848%2C0803.0477%2C0803.1830%2C0803.3251%2C0803.0065%2C0803.2685%2C0803.1309%2C0803.4473%2C0803.1718%2C0803.0082%2C0803.3688%2C0803.3663%2C0803.3268%2C0803.0360%2C0803.2203%2C0803.1608%2C0803.0895%2C0803.2718%2C0803.4496%2C0803.1616%2C0803.1513%2C0803.1951%2C0803.0631&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We study the coarsening dynamics of the three-dimensional random field Ising\nmodel using Monte Carlo numerical simulations. We test the dynamic scaling and\nsuper-scaling properties of global and local two-time observables. We treat in\nparallel the three-dimensional Edward-Anderson spin-glass and we recall results\non Lennard-Jones mixtures and colloidal suspensions to highlight the common and\ndifferent out of equilibrium properties of these glassy systems."}, "authors": ["Camille Aron", "Claudio Chamon", "Leticia F. Cugliandolo", "Marco Picco"], "author_detail": {"name": "Marco Picco"}, "author": "Marco Picco", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/1742-5468/2008/05/P05016", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0803.0664v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0803.0664v2", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "18 pages, 21 figures", "arxiv_primary_category": {"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "cond-mat.dis-nn", "scheme": "http://arxiv.org/schemas/atom", "label": null}, {"term": "cond-mat.stat-mech", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0803.0664v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0803.0664v2", "journal_reference": "J. Stat. Mech. (2008) P05016", "doi": "10.1088/1742-5468/2008/05/P05016", "fulltext": "arXiv:0803.0664v2 [cond-mat.dis-nn] 5 Jun 2008\n\nScaling and super-universality in the coarsening\ndynamics of the 3d random field Ising model\nCamille Aron\nUniversité Pierre et Marie Curie - Paris VI, Laboratoire de Physique Théorique et\nHautes Énergies, 4 Place Jussieu, 75252 Paris Cedex 05 France\n\nClaudio Chamon\nPhysics Department, Boston University, Boston, MA 02215, USA\n\nLeticia F. Cugliandolo and Marco Picco\nUniversité Pierre et Marie Curie - Paris VI, Laboratoire de Physique Théorique et\nHautes Énergies, 4 Place Jussieu, 75252 Paris Cedex 05 France\n\nAbstract. We study the coarsening dynamics of the three-dimensional random field\nIsing model using Monte Carlo numerical simulations. We test the dynamic scaling and\nsuper-scaling properties of global and local two-time observables. We treat in parallel\nthe three-dimensional Edward-Anderson spin-glass and we recall results on LennardJones mixtures and colloidal suspensions to highlight the common and different out of\nequilibrium properties of these glassy systems.\n\n1. Introduction\nThe physics of domain growth is well understood [1, 2]. Just after the initial thermal\nquench into the ordered phase, the spins in a ferromagnetic system tend to order\nand form domains of the equilibrium states. In clean systems the ordering dynamics\nis governed by the symmetry and conservation properties of the order parameter.\nWhen impurities are present the dynamics are naturally slowed down by domain-wall\npinning [3]. The dynamic scaling hypothesis states that the time-dependence in any\nmacroscopic observable enters only through a growing length scale, R(t), either the\ninstantaneous averaged or typical domain radius. However, a complete description of the\nphenomenon is lacking. In the pure cases the scaling functions are not known analytically\nand no fully satisfactory approximation scheme to estimate them is known [1]. In\npresence of disorder the limitations are more severe in the sense that the growth laws\nare derived by assuming that the relaxation is driven by activation over free-energy\nbarriers and the properties of the latter are estimated with energy balancing arguments\napplied to single interfaces that are hard to put to the test. Even in the relatively simple\n\n\fCoarsening in the 3d RFIM\n\n2\n\nrandom bond Ising model (RBIM) the time dependence of the growth law remains a\nsubject of controversy [4].\nQuenched randomness may be weak or strong in the sense that the first type does\nnot change the nature of the low-temperature phase, as in the random bond or random\nfield Ising (RFIM) models, or it can change it as in spin-glasses. Fisher and Huse\nconjectured that in the first class of systems, once the scaling hypothesis is used to\ndescribe the long times dynamics, so that times and lengths are measured in units of\nR(t), no out of equilibrium observable depends on the quenched randomness [5] and\ntheir scaling functions are thus identical to the ones of the pure limit. This is the socalled 'super-universality' hypothesis in coarsening phenomena. Tests of this hypothesis\nas applied to the equal-times two-point function of the 3d RFIM and the 2d RBIM\nappeared in [6] and [7], respectively, and the distribution of domain areas in the 2d\nRBIM in [8].\nThe dynamics of generic glassy systems is less well understood but presents some\nsimilar aspects to those mentioned above. The droplet model of finite-dimensional spinglasses is based on the assumption that in the low-temperature phase these systems\nalso undergo domain growth of two competing equilibrium states [5]. In the mean-field\nlimit spin-glasses have, though, a very different kind of dynamics [9, 10] that cannot\nbe associated to a simple growth of two types of domains. Numerical studies of the 3d\nEdwards-Anderson (EA) model [11, 12, 13, 14, 15] have not been conclusive in deciding\nfor one or the other type of evolution and, in a sense, show aspects of both. A onetime dependent 'coherence'-length, R(t), has been extracted from the distance and time\ndependence of the equal-time overlap between two replicas evolving independently with\nthe same quenched disordered interactions [12, 13, 15]. A power-law R(t) ∼ t1/z(T )\nwith the dynamic exponent z(t) = z(Tc )Tc /T fits the available data for the 3d EA\nand z(Tc ) = 6.86(16) with Gaussian [15] and z(Tc ) = 6.54(20) with bimodal [12, 13]\ncouplings. Still, it was claimed in [15] that the overlap decays to zero as a power law at\nlong distances and long times such that r/R(t) is fixed, implying that there are more\nthan two types of growing domains in the low temperature phase.\nA two-time dependent length, ξ(t, tw ), can be extracted from the analysis of the\nspatial decay of the correlation between two spins in the same system at distance r\nand different times t and tw after preparation [16]. The latter method is somehow\nmore powerful than the former one in the sense that it can be easily applied to glassy\nproblems without quenched disorder. If there is only one characteristic length-scale in\nthe dynamics R(t) should be recovered as a limit of ξ(t, tw ) but this fact has not been\ndemonstrated.\nThe mechanism leading to the slow relaxation of structural glasses is also not\nunderstood. Still, molecular dynamic studies of Lennard-Jones mixtures [17] and the\nanalysis of confocal microscopy data in colloidal suspensions [18] show that two-time\nobservables have similar time dependence as in the 3d EA model. Two-time correlations\nscale using ratios of one-time growing functions that, however, cannot be associated to\na domain radius yet. A two-time correlation length ξ with characteristics similar to the\n\n\fCoarsening in the 3d RFIM\n\n3\n\none in the 3d EA can also be defined and measured.\nThe understanding of dynamic fluctuations in out of equilibrium relaxing systems\nappears as a clear challenge [19]. In systems with quenched randomness different sample\nregions feel a different environment and one expects to see their effect manifest in\ndifferent ways working at fixed randomness. The effect of quenched randomness is\nat the root of Griffiths singularities in the statics of disordered systems, for instance. In\nstructural or polymer glasses there are no quenched interactions instead, but still one\nexpects to see important fluctuations in their dynamic behaviour both in metastable\nequilibrium and in the glassy low temperature regime. The question of whether the\nfluctuations in generic glassy systems resemble those in coarsening systems has only\nbeen studied in a few solvable cases such as the model of ferromagnetic coarsening in\nthe large N limit [20] and the Ising chain [21].\nIn this paper we study ferromagnetic ordering in the 3d RFIM following a quench\nfrom infinite temperature and we compare it to the dynamics of the 3d EA spinglass and particle glassy systems. Our aim is to signal which aspects of their out\nof equilibrium evolution differ and which are similar by focusing on freely relaxing\nobservables – no external perturbation is applied to measure linear responses. We\ntest the scaling and super-universality hypothesis in the RFIM and we explicitly show\nthat the latter does not apply to the EA model. We analyse the spatio-temporal\nfluctuations in the coarsening problem and we compare them to the ones found in\nspin-glasses [14, 16], the O(N) ferromagnetic coarsening in the large N limit [20], and\nother glassy systems [18, 22, 23].\nThe organisation of the paper is the following. In Sect. 2 we define the models and\nwe describe the numerical procedure. Section 3 is devoted to the study of the growing\nlength scale, R, the scaling and super-universality hypothesis, and the two-time growing\nlength, ξ. In Sect. 4 we focus on the local fluctuations of two time observables. We study\ntwo-time coarse-grained correlations and we analyse their statistical properties as time\nevolves. Finally, in Sect. 5 we present our conclusions.\n2. The models\nTwo varieties of quenched disorder are encountered in spin models: randomness in the\nstrength of an externally applied magnetic field and randomness in the strength of the\nbonds. The RFIM and the EA spin-glass are two archetypal examples of these. In this\nSection we present their definitions and we recall some of their main properties.\n2.1. The Random Field Ising Model\nThe 3d Random Field Ising model (RFIM) is defined by the Hamiltonian [24]\nX\nX\nH = −J\nsi sj −\nH i si .\nhi,ji\n\ni\n\n(1)\n\n\fCoarsening in the 3d RFIM\n\n4\n\nThe first term encodes short range ferromagnetic (J > 0) interactions between nearest\nneighbour Ising spins, si = ±1, placed on the nodes of a cubic lattice with linear size L.\nHi represents a local random magnetic field on site i. We adopt a bimodal distribution\nfor these independent identically distributed random variables (Hi = ±H with equal\nprobability). H quantifies the strength of the quenched disorder. Hereafter we set J = 1\nand we use units in which kB = 1.\nThe RFIM is relevant to a large class of materials due to the presence of defects\nthat cause random fields. Dilute anisotropic antiferromagnets in a uniform field are the\nmost studied systems expected to be described by the RFIM. Several review articles\ndescribe its static and dynamic behaviour [3] and the experimental measurements in\nrandom field samples have been summarized in [25]. Dipolar glasses also show aspects\nof random field systems [26].\nIn the case H = 0, the RFIM reduces to the well known clean Ising model with a\nphase transition from a paramagnetic to a ferromagnetic state occurring at Tc ≃ 4.515.\nIt is well established that in d = 3 (not in d = 2) there is a phase separating line on the\n(T, H) plane joining (Tc , H = 0) and (T = 0, Hc ). At T = 0 and small magnetic field,\nit has been rigorously proven that the state is ferromagnetic [27, 28]. The nature of the\ntransition close to zero temperature has been the subject of some debate. Claims of it\nbeing first order [29] have now been falsified and a second order phase transition has\nbeen proven [30, 31]. It was also argued but not established that there might be a spinglass phase close to (T = 0, Hc ) [32]. Recent numerical simulations yield Hc ≃ 2.215(35)\nat T = 0 [33, 34].\n2.2. The Edwards-Anderson spin-glass\nThe 3d Edwards-Anderson (EA) spin glass is defined by\nX\nH=−\nJij si sj .\n\n(2)\n\nhi,ji\n\nThe interaction strengths Jij act on nearest neighbours on a cubic three-dimensional\nlattice and are independent identically distributed random variables. We adopt a\nbimodal distribution, Jij = ±1 with equal probability. This model undergoes a static\nphase transition from a paramagnetic to a spin-glass phase at Tg ≃ 1.14(1) [35].\nThe nature of the low temperature static phase is not clear yet and, as for the out\nof equilibrium relaxation, two pictures developed around a situation with only two\nequilibrium states as proposed in the droplet model and a much more complicated\nvision emerging from the solution of the Sherrington-Kirkpatrick model, its mean-field\nextension [36].\n2.3. Numerical methods\nWe focus here on the out of equilibrium relaxation in the ordered phase. We simulate\nthe dynamics following an instantaneous quench from infinite temperature at the initial\n\n\fCoarsening in the 3d RFIM\n\n5\n\ntime, t = 0, by choosing a random initial condition: si (t = 0) = ±1 with probability one\nhalf. The order parameter is not conserved during the evolution. We use the continuous\ntime Monte Carlo (MC) procedure [37, 38, 39]. This algorithm, which is nothing else\nthan a re-organisation of the standard Monte Carlo rule, is rejection free. This makes it\nspectacularly faster than standard MC which would have a rejection rate close to 1 in\nthe ferromagnetic phase of the RFIM. Times are expressed in usual Monte Carlo steps\n(MCs): 1 MCs corresponds to N = Ld spin updates with the standard MC algorithm.\nThe way to translate from the continuous time MC to standard MC units, in which we\npresent our results, is explained in [37, 38, 39].\nWe study the relaxation dynamics with non-conserved order parameter in the\n(d = 3) ferromagnetic phase of the RFIM at relatively low temperature and small\napplied field. Interesting times are not too short – to avoid a short transient regime –\nand not too long – to avoid reaching equilibration (in ferromagnetic coarsening a nonzero magnetization density indicates that the coarsening regime is finished and other\nmore refined methods are used in the spin-glass case [40]). We delay equilibration by\ntaking large systems since the equilibration time rapidly grows with the size of the lattice.\nA reasonable numerical time-window is [103 , 107 ] MCs. We show results obtained using\nlattices with L = 250 (N = 1.5 × 107 spins) in the RFIM and L = 100 (N = 106 spins)\nin the spin-glass. We checked that finite size effects are not important in any of these\ncases for averaged quantities.\n3. The typical growing length\nIn this Section we study the typical growing length (a geometric object) in the RFIM\nand the EA model. We establish scaling and super-universality relations for three types\nof correlations functions (statistical objects). Two of them involve either two space\npoints and one time, or one space point and two times, and are the usual observables\nstudied in coarsening phenomena. The third one is commonly used in the study of glassy\nsystems where two-point correlations are not sufficient to characterize the dynamics of\nthe systems [14, 16, 17, 18] and allows for the definition of a two-time dependent length\nthat we can compare to the one obtained in the 3d EA model and glassy particle systems.\n3.1. The RFIM\nDuring the ferromagnetic coarsening regime, there are as many positive as negative spins\nin such a way that the magnetization density stays zero in the thermodynamic limit and\nweakly fluctuates around zero for finite size systems. Everywhere in the sample, there\nis a local competition between growing domains. Eventually, after an equilibration time\nτeq (that diverges with the system size), one of the two phases conquers the whole system\nscale.\nIn the coarsening regime (times shorter than τeq ) dynamic scaling [1] applies and the\ngrowth of order is characterized by a typical domain radius, R(t; T, H), that increases\n\n\fCoarsening in the 3d RFIM\n\n6\n\nin time and depends on the control parameters, T and H, and the dimension of space,\nd [41]. While in the absence of impurities it is clearly established that, for non-conserved\norder parameter dynamics, the domain length R grows as R ∼ t1/2 independently of\nd [1] with a prefactor that monotonically decreases upon increasing temperature [42],\nthe functional form of R is less clear in random cases. Scaling arguments based on the\nenergetics of single interfaces [3, 43, 44, 45] predict a crossover from the pure case result\nat short time-scales when it is easy to inflate, to a logarithmic growth,\nT\n(3)\nR(t; H, T ) = 2 ln (t/τ (T, H)) .\nH\nThe fact that the prefactor grows with T (as opposed to what happens for pure curvature\ndriven dynamics [42]) is due to the activated character of the dynamics. Several\n2\nproposals for the characteristic time τ exist: τ ∼ (T /H 2)2 [43, 2] and τ ∼ τ0 eA(T )/H\nwith A(T ) a weakly temperature dependent function [6]. To ease the notation in what\nfollows we do not write explicitly the T and H dependence of R.\nFrom the point of view of the renormalization group, all points within the\nferromagnetic region of the (T, H) phase diagram flow to the stable, zero-temperature,\nzero-disorder sink. Hence, randomness and temperature should be irrelevant in\nequilibrium at T < Tc . The super-universality hypothesis states that for non equilibrium\nordering dynamics, once lengths are scaled with the typical length R, quenched random\nfields are irrelevant and all scaling functions are the ones of the pure 3d Ising system at\nT = 0 with non-conserved order parameter.\n3.1.1. The equal-time spatial correlation. A careful analysis of the field and time\ndependence of the growing length scale together with tests of the scaling hypothesis\napplied to the equal-time correlation\nC2 (r; t) ≡ hsi (t)sj (t)i|~ri−~rj |=r ,\n\n(4)\n\nwhere the average runs over all spins in the sample, appeared in [6, 48]. In the coarsening\nregime, at distances a ≪ r ≪ L with a the lattice spacing and r/R(t) finite, C2 (r; t) is\nexpected to depend on r and time t only through the ratio r/R,\nC2 (r; t) ≃ m2eq f2 (r/R(t)) ,\n\n(5)\n\nwith meq the equilibrium magnetization density (that decreases with increasing T and/or\nH), limx→0 f2 (x) = 1 and limx→∞ f2 (x) = 0. Since the spatial decay is approximately\nexponential, C2 (r; t) ∝ e−r/R(t) for not too long r, we use this functional form to extract\nR from the data fit at each set of parameters (T, H, t). Figure 1 (a) shows that the\ngrowing length R has two regimes: shortly after the quench R grows as t1/2 like in the\npure case and it later crosses over to a logarithmic growth. This is consistent with\nprevious numerical studies in 2d [7, 47] and 3d systems [6, 48]. In Fig. 1 (b) we test the\n2\ndependence on T and H by plotting HT R versus t/τ for T = 1, 2 and H = 0.5, 1, 1.5.\nWe found the best collapse using τ ∼ H −3 but the precision of our data is not high\nenough to distinguish between this and the τ s proposed in [43] and [6]. Our numerical\nresults tend to confirm the T /H 2 dependence of R even in the early stages of the growth.\n\n\fCoarsening in the 3d RFIM\n\n7\n\n50\n\n25\nH = 0.5 T = 1\nH = 1.0 T = 1\nT=2\nH = 1.5 T = 1\n\n1/2\n\nt\n10\n\n20\nH2/T R(t)\n\n40\n\nR\n\n30\n\n20\n\n1\n1\n10\n\n2\n\n3\n\n10\n\n10\n\n15\n10\n5\n\n(a)\n\n10\n\n0\n1\n10\n\n2\n\n3\n\n10\n\n4\n\n10\n\n5\n\n10\n\n0\n100\n\n6\n\n10\n\n(b)\n\n10\n\n101\n\n102\n\n103\n\n104\n\n105\n\nt H3\n\nt\n\nFigure 1. (a) With line-points (red),\nthe growing length R(t) at T = 1 and H = 1.\n√\nThe green curve is the power law t that describes well the data at short times, right\nafter the temperature quench. The blue line is a logarithmic law apt to describe the\nbehaviour at longer time-scales.\nIn the inset: the same data in a log-log scale to\n√\nhighlight the quality of the t behaviour at short times. (b) Study of the dependence\nof R on the parameters T and H for two values of T and three random field strengths\nH given in the key.\n\nH = 0.0 T = 1.0\nH = 1.0 T = 0.5\nT = 1.0\nT = 2.0\nH = 1.5 T = 1.0\n\n1\n\n1\n\n0.6\n\nf2\n\nf2\n\n0.8\n\nt = 2 102\nt = 1034\nt = 10\nt = 1035\nt = 10\n\n0.4\n(a)\n\n0.2\n\n(b)\n\n0\n\n0.1\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\n1.2\n\n1.4\n\n0\n\n0.2\n\n0.4\n\n0.6\n\nr/R(t)\n\n0.8\n\n1\n\n1.2\n\n1.4\n\nr/R(t)\n\nFigure 2. (a) The scaling function f2 (r/R) for T = 0.5, 1, 2 and H = 1, 1.5. (b) The\nsame data in a linear-log scale showing that f2 is close to an exponential at short r/R.\n\nSince the work of [6], it is now clear that f2 in Eq. (5) is independent of H, and very\nsimilar to the one of the pure system. In Fig. 2 we also find that the scaling functions\nf2 at different T fall on top of one another. Thus f2 is independent of H and T .\n3.1.2. The two-time self-correlation. It is commonly defined as\nN\n1 X\nhsi (t)si (tw )i ,\nC(t, tw ) ≡\nN i=1\n\n(6)\n\nand quantifies how two spin configurations of the same system, one taken at tw (waiting\ntime) and the other one at t ≥ tw , are close to each other. The angular brackets here\nindicate an average over different realizations of the thermal noise. In the large N limit,\nthis quantity is self-averaging with respect to noise and disorder induced fluctuations.\nThis two-time function has been used as a clock for the out of equilibrium dynamics of\n\n\fCoarsening in the 3d RFIM\n\n8\n\nglassy systems [9, 10] and we shall use this property again, in the study of the two-time\ngrowing length and fluctuations.\nThe behaviour of C is well understood for coarsening systems. As long as the\ndomain walls have not significantly moved between tw and t(> tw ) (that defines what\nwe shall call later short time delay), the self-correlation is given by the fluctuations of\nspins that are in thermal equilibrium inside the domains. As any other equilibrium twotime function, the self-correlation depends then only on t − tw . Later, for longer time\ndelays, the displacement of domain walls cannot be neglected any more and C looses its\ntime-translational invariance. The self-correlation can be written as a sum of two terms\nrepresenting the thermal and aging regimes:\nC(t, tw ) = Cth (t − tw ) + Cag (t, tw )\n\n(7)\n\nwith the limit conditions\nCth (0) = 1 − qEA ,\nlimt−tw →∞ Cth (t − tw ) = 0 ,\n\nlimtw →t− Cag (t, tw ) = qEA ,\nlimt≫tw Cag (t, tw ) = 0 .\n\nqEA is a measure of the order parameter and in a ferromagnetic phase it simply equals\nm2eq , the magnetization squared.\nIn Fig. 3 (a) we show the decay of the two-time correlation C as a function of the\ntime delay t − tw for tw = 103 , 104 , 105 at T = 1 and H = 1. On each of these curves,\none can distinguish the two dynamic regimes. The longer the waiting time the later the\naging regime appears. In Fig. 3 (b) we show the decay of the two-time correlation as a\nfunction of time-delay for tw = 103 and five pairs of parameters (T, H) given in the key.\nIt is clear that the full relaxation depends strongly on the external parameters: raising\nthe temperature or reducing the random field strength speeds up the decay. For these\nvalues of T and H, qEA does not change much but the decay in the aging regime does.\nDynamic scaling implies that in the aging regime\n\u0013\n\u0012\nR(t)\n,\n(8)\nCag (t, tw ) = qEA f\nR(tw )\nwith R the typical length extracted from C2 , f (1) = 1 and f (∞) = 0. For our choice of\nparameters (T, H), qEA is close to unity so we can easily compute f from the measured\nC by using f = Cag /qEA ≃ C/qEA . Super-universality states that f does not depend\non T and H. In Fig. 4 we show that both hypotheses apply to this quantity. In panel\n(a) we use a linear-linear scale while in panel (b) we present the same data in a double\nlogarithmic scale. Although the scaling function f looks like a power law it is not. One\nexpects that its tail [R(t) ≫ R(tw )] becomes a power-law with an exponent λ. The\nactual function f is not known. Most of the analytic efforts in domain growth studies\nare devoted to develop approximation schemes to derive f , f2 and other scaling functions\nbut none of them is fully successful [1].\n3.1.3. The four point-correlation function. In order to successfully identify a growing\ncorrelation length in glassy systems including the 3d EA spin-glass, one defines the\n\n\fCoarsening in the 3d RFIM\n\n9\n\n1\n\n1\n\n0.4\n\n0.7\n0.6\n0.5\n\n0.2\n\n(a)\n\n0\n100\n\n101\n\n(b)\n\n0.8\n\n0.6\n\nC(t, tw)\n\nC(t,tw)\n\n0.9\n\ntw = 103\ntw = 1045\ntw = 10\n\n0.8\n\n0.4\n102\n\n103\n104\nt - tw\n\n105\n\nT = 0.5 H = 1.0\nT = 1.0 H = 0.5\nH = 1.0\nH = 1.5\nT = 2.0 H = 1.0\n\n0.3\n100\n\n106\n\n101\n\n102\n\n103\n104\nt - tw\n\n105\n\n106\n\nFigure 3. The global correlation C vs t − tw . (a) T = 1 and H = 1 and different tw\ngiven in the key. (b) tw = 103 at various pairs of (T, H) given in the key.\n\n1\n\n0.8\n\nf\n\n0.6\n\nf\n\nT = 0.5 H = 1.0 tw = 103\nT = 1.0 H = 0.0 tw = 20\nH = 1.0 tw = 1043\ntw = 105\ntw = 10\nH = 1.5 tw = 103\ntw = 1045\ntw = 10\nT = 2.0 H = 1.0 tw = 103\n\n1\n\n0.4\n(a)\n\n0.2\n\n(b)\n\n0\n\n0.1\n1\n\n2\n\n3\n\n4\n\n5\n\n6\n\n7\n\n8\n\n9\n\n10\n\n1\n\nR(t)/R(tw)\n\n10\n\nR(t)/R(tw)\n\nFigure 4. Test of the scaling and super-universality hypothesis. (a) f = Cag /qEA vs.\nR(t)/R(tw ) at various pairs of (T, H) and tw given in the key. (b) The same data in\nlog-log scale.\n\ntwo-time two-site correlation function [14, 16, 17, 18, 49]\nC4 (r; t, tw ) ≡ hsi (t)si (tw )sj (t)sj (tw )i|~ri −~rj |=r .\n\n(9)\n\nWe extract ξ from its approximate spatial exponential decay: C4 (r; t, tw ) − C 2 (t, tw ) ∝\ne−r/ξ(t,tw ) at relatively short r/ξ. (Other methods, like defining the connected four spincorrelation and extracting ξ from its volume integral yield similar qualitative results\nthough slightly different quantitatively.) Results of this analysis are shown in Fig. 5 (a)\nwhere we plot ξ(t, tw ) as a function of t for different tw at T = 1 and H = 1. We\nidentify a short t − tw regime that is independent of tw (thermal regime), whereas for\nlong t − tw , time-translational invariance is broken (aging regime). In Fig. 5 (b) we plot\nξ(t, tw ) versus 1 − C(t, tw ) for the three same values of tw , using t as a parameter. The\ndependence on 1 − C and tw is monotonic and very similar to the one obtained in the\n3d EA model [14] (see Fig. 7). The thermal regime is almost invisible here since it is\ncontained between C = 1 and C = qEA , with qEA ≃ 1 for this set of parameters. We\nthen propose\nξ(t, tw ) = R(tw ) g(C) .\n\n(10)\n\n\fCoarsening in the 3d RFIM\n\nξ(t,tw)\n\n12\n\n16\n\ntw = 103\ntw = 104\ntw = 105\n\ntw = 103\ntw = 104\ntw = 105\n\n12\nξ(t,tw)\n\n16\n\n10\n\n8\n\n4\n\n8\n\n4\n(b)\n\n(a)\n0\n102\n\n103\n\n104\nt - tw\n\n105\n\n0\n\n106\n\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\n1-C\n\n1\n(c)\n\nξ(t,tw) / R(tw)\n\n0.8\n\n0.6\n3\n\nT = 0.5 H = 1.0 tw = 10\n4\n= 10\n5\n= 10\nT = 1.0 H = 0.0 tw = 20\n3\nH = 1.0 tw = 10\n4\n= 105\n= 103\nH = 1.5 tw = 10\n4\n= 10\n5\n= 10\n\n0.4\n\n0.2\n\n0\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\n1-C\n\nFigure 5. The two-time correlation length, ξ, in the RFIM. (a) ξ as a function of\ntime-delay, t−tw for several values of tw given in the key at T = 1 and H = 1. (b) ξ as a\nfunction of the global correlation in a parametric plot at T = 1 and H = 1. (c) Scaling\nξ(t, tw ) = R(tw ) g(C) at two temperatures and two values of the random field using\nthree waiting-times tw for each set of parameters. The pure case H = 0, T = 1 is also\nincluded with a very short tw to avoid equilibration.\n\nThe limit g(C = 1) = 0 is found by taking t = tw , that corresponds to C = 1 [extending\nthe scaling form (10) to include the thermal regime]. In this case C4 (r; t, t) = 1. If\none uses C4 (r; t, t) = C̃4 (r/ξ, C(t, t) = 1), see Sect. 3.1.4, then ξ(t, t) must vanish\nto obtain C4 independent from r, and this imposes g(1) = 0. In the other extreme,\nwhen t ≫ tw and C = 0 one expects g(0) = 1. The reason is the following.\nlimt≫tw C4 (r; t, tw ) = C2 (r, t)C2 (r, tw ), for the temporal decoupling of C4 can be done in\nthe t ≫ tw limit. Recalling that C2 (r, t) ∝ f2 (r/R(t)) with limx→0 f2 (x) = 1, the only\nspatial contribution to limt≫tw C4 (r; t, tw ) comes from the term C2 (r, tw ) ∝ f2 (r/R(tw )).\nUsing limt≫tw ξ(t, tw ) = R(tw )g(0) and further assuming that the functional forms of\nC4 (x) and f2 (x) are, to a first approximation, the same we deduce g(0) = 1.\nFigure 5 (c), where we plot ξ(t, tw )/R(tw ) versus 1 − C(t, tw ) for different tw ,\nillustrates the validity of the scaling hypothesis (10). We see that, as expected,\ng(C = 1) = 0 and it seems plausible that limC7→0 g(C) = 1. The scaling function g\nis found to satisfy super-universality, i.e. it is independent of H and T .\n3.1.4. C4 and super-universality. Using the monotonicity properties of C as a function\nof t − tw and tw , and of ξ as a function of tw and 1 − C we can safely exchange the\n\n\fCoarsening in the 3d RFIM\n1\n\n11\n1\n\nT = 0.5 H = 1.0 tw = 103\nT = 1.0 H = 0.0 tw = 20\nH = 1.0 tw = 1043\ntw = 10\nH = 1.5 tw = 103\n\n0.9\n\n~\nC4 - C2\n\n0.8\n\n0.5\n\n~\nC4\n\n0.7\n0.6\n\n0.1\n\n0.5\n(a)\n\n(b)\n\n0.4\n0.3\n\n0.01\n0\n\n0.5\n\n1\n\n1.5\nr/ξ(t,tw)\n\n2\n\n2.5\n\n3\n\n0\n\n0.5\n\n1\n\n1.5\nr/ξ(t,tw)\n\n2\n\n2.5\n\n3\n\nFigure 6. (a) Test of scaling, C̃4 (r/ξ, C), and the super-universality of C̃4 for the\nparameters T and H given in the key. Times t and tw are chosen in such a way that\nC(t, tw ) = 0.57 in all cases. (b) The same data in linear-log scale showing that C̃4 − C 2\nis very close to an exponential at short r/ξ.\n\ndependence of C4 on the two times by a dependence on ξ and C. In other words,\nC4 (r, ξ, C) where, again for simplicity, we did not write explicitly the dependence on T\nand H. Now, a reasonable scaling assumption is that one can measure r in units of ξ\nsuch that\nC4 (r, t, tw ) = C̃4 (r/ξ(t, tw ), C(t, tw )) .\n\n(11)\n\nIn Fig. 6 we put this scaling form to the test and we examine the possible superuniversality of C̃4 . We use different values of the parameters t, tw , T , H such that\nC = 0.57 in all cases. Both scaling and super-universality relations are well satisfied.\nNote that the scaling relation in Eq. (11) can also be transformed into\nC4 (r; t, tw ) = C4 (r/R(tw ), R(t)/R(tw ))\n\n(12)\n\nby using Eq. (8). This last scaling form was also found for the O(N) ferromagnetic model\nin the large N limit although the scaling function does not have a simple exponential\nrelaxation [20].\n3.2. 3d EA\nA detailed analysis of the relaxation properties of similar correlations in the 3d EA model\nappeared in [14]. The spatial one-time correlation, C2 (r, t), vanishes identically in this\nmodel due to the quenched random interactions. The two-time self-correlation satisfies\nscaling with R ∼ t1/z(T ) cannot be simply associated to a typical radius of equilibrated\ndomains. The question as to whether the scaling function f is super-universal is not\nwell posed since the T -dependent power 1/z(T ) can be absorbed in f . The four-point\ncorrelation allows for the definition of a two-time growing length scale ξ that behaves\nqualitatively as in Eq. (10). In Fig. 7 we present ξ(t, tw ) for the 3d EA. Its behaviour is\nvery similar to the one of the RFIM exposed previously, but we would like to stress the\nfact that this quantity reaches much lower values in the 3d EA case (around 2a) than\nin the RFIM (around 15a). Figure 7 (c) demonstrates that the superscaling property\n\n\fCoarsening in the 3d RFIM\n1.6\n\n12\n\ntw = 104\ntw = 1056\ntw = 10\n\n1.6\n\n1.2\nξ(t,tw)\n\nξ(t,tw)\n\n1.2\n\n0.8\n\n0.4\n\n0\n101\n\n103\n\n104\n105\nt - tw\n\nξ(t,tw) / tw0.03\n\n1.2\n\n106\n\n107\n\n0.8\n\n0.4\n\n(a)\n102\n\ntw = 104\ntw = 105\ntw = 106\n\n(b)\n\n0\n\n108\n\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\n1-C\n\nT/Tg = 0.6\n\n(c)\n\nT/Tg = 0.3\n\n0.8\n\nT/Tg = 0.3 tw = 104\ntw = 1056\ntw = 10\nT/Tg = 0.6 tw = 1054\ntw = 10\ntw = 106\n\n0.4\n\n0\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\n1-C\n\nFigure 7. Study of the two-time correlation length in the 3d EA model. (a) ξ\nas a function of time-delay t − tw for several tw 's given in the key at T /Tg = 0.6.\n(b) Evolution of ξ with the global correlation in a parametric plot at T /Tg = 0.6.\n(c) Test of the scaling hypothesis ξ(t, tw ) = R(tw ) g(C) with R(t) ∝ t0.03 at T /Tg = 0.3\nand T /Tg = 0.6.\n\ndoes not hold in the 3d EA model. We used R(t) ∝ t0.03 for both temperatures and\nthe resulting g(C) curves are significantly different. It is important to remark that no\nT -dependent power-law in R would make the two curves collapse. Turning back to the\nscaling of the two-time correlation and fixing the power law, C ∝ f [(t/tw )0.03 ] one finds\nf (x) ∼ x−4.5 (at T /Tg ∼ 0.6) a much faster decaying power than in the RFIM. Note that\nprevious estimates of the dynamic exponent using the one-time replica overlap [12, 13]\nyield 1/z(T = 0.3Tg ) ≈ 0.045 a slightly larger value; the reason for the discrepancy\ncould be traced to the lack of accuracy in the determination of ξ and then R.\n3.3. Colloidal glasses\nThe structure factor of colloidal suspensions and Lennard-Jones mixtures are obviously\nvery different from the one of a sample undergoing ferromagnetic ordering. Still, twotime self-correlations satisfy scaling with R(t) ∝ t1/z although a clear interpretation of\nR is not available.\nCastillo and Parsaeian studied ξ in a Lennard-Jones mixture of particles undergoing\na glassy arrest. One notices that, at short time delays (t − tw ∼ 10 molecular dynamic\nunits), ξ is monotonic with respect to t − tw and tw in this system, while one needs to\n\n\fCoarsening in the 3d RFIM\n\n13\n\nreach much longer time delays (and indeed go beyond the simulation window) in the 3d\nEA and RFIM cases [cfr. Figs. 5 (a) and 7 (a) to the first panel in Fig. 2 in [17]]. A\nform like (10) describes ξ in this case too with R(t) ∼ t1/z and 1/z ∼ 0.1.\nThe two-time correlation length of colloidal suspensions was analysed in [18] using\na mapping to a spin problem. The data for ξ remains, though, quite noisy and although\na similar trend in time emerges the precise functional form is hard to extract.\n3.4. Summary\nIn short, the macroscopic correlations in all these systems admit the same dynamic\nscaling analysis although there is no clear interpretation of R as a domain size in the\ncase of the 3d EA and colloidal suspensions.\n4. Fluctuations\nAn approach apt to describe problems with and without quenched randomness focuses\non thermally induced fluctuations [19]. The local dynamics can then be examined by\nstudying two-time spin-spin functions which, instead of being spatially averaged over\nthe whole bulk, are only averaged over a coarse-graining cell with volume Vr = (2l)3\ncentered at some site r [16]:\n1 X\nsi (t)si (tw ) .\n(13)\nCr (t, tw ) ≡\nVr −\n→\nri ∈Vr\nOne can then characterize the fluctuations by studying their probability distribution\nfunction (pdf) ρ(Cr ; t, tw , l, L, T, H) with mean value C(t, tw ).\nIn general, the variation of ρ(Cr ) with the size of the coarse-graining boxes is as\nfollows. For l < R the pdf is peaked around qEA and has a fat tail towards small values\nof Cr including negative ones. Indeed, well in the coarsening regime, most of the small\ncoarse-grained cells fall inside domains and one then expects to find mostly a thermal\nequilibrium distribution – apart from the tail. For larger values of l such as l ≃ R, a\nsecond peak close to C appears and the one at qEA progressively diminishes in height.\nFor still larger values of l, the peak at qEA disappears and a single peak centered at C\n(the mean value of the distribution) takes all the pdf weight.\nAt fixed temperature and field, the pdf ρ(Cr ; t, tw , l, L) in the RFIM depends on\nfour parameters, two times t and tw and two lengths l and L. In the aging regime the\ndependence on t and tw can be replaced by a dependence on C(t, tw ) and ξ(t, tw ), the\nformer being the global correlation and the latter the two-time dependent correlation\nlength. Indeed, C(t, tw ) is a monotonic function on the two times [cfr. Fig. 3 (a)] and ξ\nis a growing function of t (cfr. Fig. 1), thus allowing for the inversion (t, tw ) → (C, ξ).\nNote that we do not need to enter the aging, coarsening regime to propose this form.\nOne can now make the natural scaling assumption that the pdfs depend on ξ, the coarsegraining length l, and the system linear size L through the ratios l/ξ and l/L. In the\n\n\fCoarsening in the 3d RFIM\n\n14\n\n3\n2.5\n\n3\n\ntw = 103\ntw = 104\n\n(a)\n\n2.5\n2\nρ(Cr)\n\nρ(Cr)\n\n2\n\ntw = 103 2l = 9\ntw = 104 2l = 18\n\n(b)\n\n1.5\n\n1.5\n\n1\n\n1\n\n0.5\n\n0.5\n\n0\n\n0\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n0\n\n1\n\n0.2\n\n0.4\n\nCr\n\n0.6\n\n0.8\n\n1\n\nCr\n\nFigure 8. Pdf of local two-time functions Cr in the RFIM at T = 1 and H = 1. The\nwaiting-times are given in the key and time t is chosen such that C(t, tw ) = 0.6. (a) Cr\nis coarse-grained on boxes of linear size l = 9. (b) Cr is coarse-grained on boxes with\nvariable length l so as to keep l/ξ(t, tw ) ≃ 0.7 constant. The collapse is much improved\nwith respect to panel (a).\n\n3\n\nT = 0.5 H = 1.0 tw = 1043\ntw = 10\nT = 1.0 H = 1.0 tw = 1043\ntw = 10\nH = 1.5 tw = 103\n\n2.5\n\n2l = 36\n2l = 72\n\n3\n\n(b)\n\n2.5\nρ(Cr)\n\nρ(Cr)\n\n2\n\n3.5\n2l = 10\n2l = 16\n2l = 18\n2l = 35\n2l = 14\n\n1.5\n1\n\n2\n1.5\n1\n\n0.5\n\n0.5\n\n(a)\n\n0\n\n0\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\nCr\n\n1\n\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nCr\n\nFigure 9. Test of the scaling and super-scaling hypothesis. The two pairs of t and tw\nare the same as in Fig. 8 and C = 0.6 as well. (a) l/ξ ≃ 1.4. (b) l/ξ ≃ 2.9.\n\nend, the pdfs characterizing the heterogeneous aging of the system read\nρ(Cr ; C(t, tw ), l/ξ(t, tw ), l/L) .\n\n(14)\n\nWe numerically test this proposal by assuming that the thermodynamic limit applies\nand the last scaling ratio vanishes identically. Figure 8 (a) shows the pdfs at two pairs\nof times t and tw such that the global correlation C(t, tw ) is the same, and l = 9. It is\nclear that the two distributions are different. In panel (b) we further choose l so that\nl/ξ ≃ 0.7 is also fixed. The two distributions now collapse as expected from the scaling\nhypothesis Eq. (14). Note that another peak at C = −1 exists, though with a lower\nweight. Figure 9 (a) and (b) show the scaling for l/ξ ≃ 1.4 and l/ξ ≃ 2.9, respectively.\nWhile the collapse is still good in the case of panel (a), it is not satisfactory in panel (b).\nIndeed, this plot suffers from the fact that the thermodynamic limit is far from being\nreached (l/L ∼ 0.15 is not so small).\n\n\fCoarsening in the 3d RFIM\n\n15\n3.5\n\nRFIM H = 1 T = 1 tw = 103\n3dEA T/Tg = 0.3 tw = 103\ntw = 104\nT/Tg = 0.6 tw = 1043\ntw = 10\n\n3\n\nρ(Cr)\n\n2.5\n\n2l = 36\n2l = 6\n2l = 6\n2l = 6\n2l = 7\n\n2\n1.5\n1\n0.5\n0\n0\n\n0.2\n\n0.4\n\n0.6\n\n0.8\n\n1\n\nCr\n\nFigure 10. Pdf of local correlations in the 3d EA model at T /Tg = 0.3 and T /Tg = 0.6,\nfor two waiting-times tw such that C = 0.6 and l/ξ = 2.9. The solid line (red) displays\nthe super-universal pdf in the RFIM.\n\nIn Fig. 9 (a) we used several values of T and H and we found that all pdfs collapse\non the same master curve. We conclude that as long as coarse-graining lengths are not\ntoo close to the system size, the pdf of local correlation satisfy the scaling (14) with a\nscaling function that is super-universal.\nLet us now compare the forms of the pdfs in the RFIM and 3d EA model. In the\nRFIM the peak at qEA is visible until l/ξ ≃ 2. Given that in this model ξ is quickly\nrather large (ξ reaches 15a in the simulation time-window) one has a relatively large\ninterval of l for which the peak at qEA can be easily seen. Instead, in the 3d EA the\ntwo-time correlation length grows very slowly and reaches only ξ ∼ 2a in similar times,\nmeaning that the peak at qEA is hardly visible as soon as one coarse-grains the two-time\nobservables [14].\nFigure 10 demonstrates that the pdf of local correlations is not super-universal with\nrespect to T in the 3d EA model, and compares the functional form at two temperatures,\nT /Tg = 0.3 and T /Tg = 0.6, with the one in the RFIM. The global correlation, C,\nand the ratio of coarse-graining to correlation lengths, l/ξ, are the same in all curves.\nAlthough qualitatively similar, the pdf in the RFIM and 3d EA models are different,\nwith the RFIM one being more centered around the global value.\nThe study of Lennard-Jones mixtures in [23] used a constant coarse-graining length\nand the pdfs of local correlations at constant C showed a slow drift that should be cured\nby taking into account the variation of ξ. In colloidal suspensions the scaling form (14)\nis well satisfied [18]. In the context of coarsening phenomena these pdfs are to be\ncompared to the ones calculated for the O(N) model in its large N limit [20].\n5. Conclusion\nWe performed an extensive analysis of the dynamics of the RFIM in its coarsening\nregime. We showed that the equal-time correlation functions, global two-time correlation\nfunctions, and the four point correlation functions obey scaling and super-universality\nrelations in the aging regime. The scaling relations, by means of the typical growing\n\n\fCoarsening in the 3d RFIM\n\n16\n\nlength, R ∝ ln t/τ , reveal a non-trivial time-invariance for these statistical objects.\nSuper-universality encodes the irrelevance of quenched randomness and temperature on\nthe scaling functions and it is demonstrated by the fact that they are the same as for\nthe pure Ising case.\nIn the 3d EA, similar scaling forms were found for global two-time correlations\nand four-point correlations [14]. The function R(t) could be associated to a domain\nradius though a clearcut confirmation of this is lacking. On the contrary, the results of\nrecent large scale simulations have been interpreted as evidence for an SK-like dynamic\nscenario [15]. The one-time function playing the role of the domain radius is a very\nweak power law, t0.03 at T /Tg ∼ 0.3 − 0.6, and, in consequence, the two-time correlation\nlength reaches much shorter values than in the RFIM in equivalent simulation times.\nSuper-universality (with respect to temperature) does not apply in this case.\nA similar scenario applies to the Lennard-Jones mixtures [23] and colloidal\nsuspensions [18]. The two-time correlation length remains also very short in accessible\nnumerical and experimental times.\nIn all these systems the analysis of local fluctuations of two-time functions leads to\nscaling of their probability distribution functions. In the RFIM these also verify superscaling with respect to T and H. In the 3d EA they do not. The intriguing possibility\nof a kind of super-scaling in colloidal suspensions (with respect to concentration) has\nbeen signaled in [18] and deserves a more careful study.\nWe conclude that all these systems, with a priori very different microscopic\ndynamic processes admit a similar dynamic scaling descriprion of their macroscopic\nand mesoscopic out of equilibrium evolution.\nAcknowledgments\nWe thank L. D. C. Jaubert and A. Sicilia for very useful discussions and T. Malakis and\nV. Martı́n-Mayor for helpful correspondence. LFC is a member of Institut Universitaire\nde France.\n\n[1] A. J. Bray, Adv. Phys. 43, 357 (1994).\n[2] S. Puri, Phase Transitions 77, 407 (2004).\n[3] T. Nattermann and J. Villain, Phase Transitions 11, 5 (1988). T. Nattermann and P.\nRujan, Int. J. Mod. Phys. 3, 1597 (1989). T. Nattermann, cond-mat/9705295 in Spin\nglasses and random fields, A. P. Young ed. (World Scientific, Singapore, 1997).\n[4] R. Paul, G. Schehr, and H. Rieger, Phys. Rev. E 75, 030104(R) (2007). R. Paul,\nS. Puri, and H. Rieger Phys. Rev. E 71, 061109 (2005) F. Baumann, M. Henkel,\nand M. Pleimling Phase-ordering kinetics of two-dimensional disordered Ising models,\narXiv:0709.3228. H. Hinrichsen, Dynamical response function of the disordered kinetic\nIsing model arXiv:0711.2421.\n[5] D. S. Fisher and D. A. Huse, Phys. Rev. B 38, 373 (1988).\n[6] M. Rao and A. Chakrabarti, Phys. Rev. Lett. 71, 3501 (1993).\n\n\fCoarsening in the 3d RFIM\n\n17\n\n[7] S. Puri and N. Parekh, J. Phys. A 26, 2777 (1993). A. J. Bray and K. Humayun, J.\nPhys. A 24, L1185 (1991).\n[8] A. Sicilia, J. J. Arenzon, A. J. Bray and L. F. Cugliandolo, EPL 82, 10001 (2008).\n[9] L. F. Cugliandolo and J. Kurchan, J. Phys. A 27 5749 (1994).\n[10] A. Baldassarri, L. F. Cugliandolo, J. Kurchan and G. Parisi, J. Phys. A 28 1831 (1995).\n[11] H. Rieger, J. Phys. A 26, L615 (1993). T. Komori, H. Takayama, and H. Yoshino, J.\nPhys. Soc. Jpn. 68, 3387 (1999), ibid 69, 1192 (1999), 69 Suppl. A 228 (2000). M.\nPicco, F. Ricci-Tersenghi and F. Ritort, Eur. Phys. J. B 21, 211 (2001).\n[12] J. Kisker, L. Santen, M. Schreckenberg, and H. Rieger, Phys. Rev. B 53 6418 (1996).\n[13] E. Marinari, G. Parisi, F. Ricci-Tersenghi, and J. J. Ruiz-Lorenzo, J. Phys. A 33, 2373\n(2000).\n[14] L. D. C. Jaubert, C. Chamon, L. F. Cugliandolo and M. Picco J. Stat. Mech., P05001\n(2007).\n[15] F. Belletti, M. Cotallo, A. Cruz, L.A. Fernandez, A. Gordillo-Guerrero, M. Guidetti,\nA. Maiorano, F. Mantovani, E. Marinari, V. Martin-Mayor, A. Munoz Sudupe, D.\nNavarro, G. Parisi, S. Perez-Gaviro, J.J. Ruiz-Lorenzo, S.F. Schifano, D. Sciretti,\nA. Tarancon, R. Tripiccione, J.L. Velasco, D. Yllanes (the Janus collaboration),\nSimulating an Ising spin-glass for 0.1 seconds with Janus, arXiv:0804.1471.\n[16] H. E. Castillo, C. Chamon, L. F. Cugliandolo, M. P. Kennett, Phys. Rev. Lett. 88, 237201\n(2002). H. E. Castillo, C. Chamon, L. F. Cugliandolo, J. L. Iguain, M. P. Kennett,\nPhys. Rev. B 68, 134442 (2003).\n[17] A. Parsaeian and H. E. Castillo, Growth of spatial correlations in the aging of a simple\nstructural glass, arXiv:cond-mat/0610789.\n[18] C. Chamon, L. F. Cugliandolo, G. Fabricius, J. L. Iguain and E. R. Weeks,\narXiv:0802.3297\n[19] C. Chamon and L. F. Cugliandolo, J. Stat. Mech. (2007) P07022.\n[20] C. Chamon, L. F. Cugliandolo and H. Yoshino, J. Stat. Mech (2006) P01006.\n[21] P. Mayer, H. Bissig, L. Berthier, L. Cipelletti, J. P. Garrahan, P. Sollich and V. Trappe,\nPhys. Rev. Lett. 93, 115701 (2004); P. Mayer, P. Sollich, L. Berthier and J. P.\nGarrahan, J. Stat. Mech. (2005) P05002.\n[22] C. Chamon, P. Charbonneau, L. F. Cugliandolo, D. R. Reichman and M. Sellitto, Journal\nof Chemical Physics 121, 10120 (2004).\n[23] A. Parsaeian and H. E. Castillo, Nature Phys. 3, 26 (2007).\n[24] Y. Imry and S. K. Ma, Phys. Rev. Lett. 35, 1399 (1975).\n[25] D. P. Belanger, Phase Transitions 11, 53 (1988). D. P. Belanger in Spin glasses and\nrandom fields, A. P. Young ed. (World Scientific, Singapore, 1997).\n[26] F. Alberici-Kious, J-P Bouchaud, L. F. Cugliandolo, P. Doussineau and A. Levelut, Phys.\nRev. Lett. 81, 4987 (1998); Phys. Rev. B 62, 14766 (2000).\n[27] J. Z. Imbrie, Phys. Rev. Lett. 53, 1747 (1984).\n[28] J. Bricmont and A. Kupiainen, Phys. Rev. Lett. 59, 1829 (1987).\n[29] A. P. Young and M. Nauenberg, Phys. Rev. Lett. 54, 2429 (1985).\n[30] H. Rieger, Phys. Rev. B 52, 6659 (1995).\n[31] A. A. Middleton and D. S. Fisher, Phys. Rev. B 65, 134411 (2002).\n[32] M. Mézard and A. P. Young, Europhys. Lett. 18, 653 (1992). M. Mézard and R.\nMonasson, Phys. Rev. B 50, 7199 (1994).\n[33] M. R. Swift, A. J. Bray, A. Maritan, M. Cieplak and J. R. Banavar, Europhys. Lett. 38,\n273 (1997).\n[34] A. Malakis and N. G. Fytas, Eur. Phys. J. B 51, 257 (2006). A. Malakis and N. G. Fytas,\nEur. Phys. J. B 61, 111 (2008). N. G. Fytas, A. Malakis, and K. Eftaxias, J. Stat.\nMech. (2008) P03015.\n[35] H. G. Ballesteros, A. Cruz, L. A. Fernandez, V. Martı́n-Mayor, J. Pech, J. J. Ruiz-\n\n\fCoarsening in the 3d RFIM\n[36]\n[37]\n[38]\n[39]\n[40]\n\n[41]\n\n[42]\n[43]\n[44]\n[45]\n[46]\n[47]\n[48]\n[49]\n\n18\n\nLorenzo, A. Tarancon, P. Tellez, C. L. Ullod, C. Ungil, Phys. Rev. B 62 14237 (2000).\nK. H. Fischer and J. A. Hertz Spin glasses, (Cambridge Univ. Press. 1991).\nA. B. Bortz, M. H. Kalos and J. L. Lebowitz, J. Comp. Phys. 17, 10 (1975).\nJ. Dall and P. Sibani, Comp. Phys. Comm. 141, 260 (2001).\nM. A. Novotny, Ann. Rev. Comp. Phys. IX, editor D. Stauffer (World Scientific,\nSingapore, 2001), p.153.\nA way to check whether a spin-glass model gets close to equilibration is to follow the\nevolution of spin replicas with the same quenched randomness and testing when the\noverlap distribution develops a non-trivial structure. Some papers explaining and using\nthis technique are [10], N. D. Mackenzie and A. P. Young, Phys. Rev. Lett. 49, 301\n(1982); K. Binder and A. P. Young, Rev. Mod. Phys. 58, 801 (1986).\nNote that some coarsening problems have a distribution of domain radii with long-tails,\nsee J. J. Arenzon, A. J. Bray, L. F. Cugliandolo and A. Sicilia, Phys. Rev. Lett. 98,\n145701 (2007) and [42].\nA. Sicilia, J. J. Arenzon, A. J. Bray and L. F. Cugliandolo, Phys. Rev. E 76, 061116\n(2007).\nJ. Villain, Phys. Rev. Lett. 52, 1543 (1984). J. Villain, J. Physique Lett. (France) 43,\nL551 (1982).\nG. Grinstein and S. K. Ma, Phys. Rev. Lett. 49, 685 (1982).\nG. Grinstein and J. F. Fernandez, Phys. Rev. Lett. 29, 6387 (1984). J. F. Fernández,\nEurophys. Lett. 5, 129 (1988).\nR. Bruinsma and G. Aeppli, Phys. Rev. Lett. 52, 1547 (1984).\nS. R. Anderson, Phys. Rev. B 36, 8435 (1987).\nE. Oguz, J. Phys. A 27, 2985 (1994).\nN. Lacevic, F. W. Starr, T. B. Schroder, V. N. Novikov and S. C. Glotzer, Phys. Rev. E\n66, 030101 (R) (2002).\n\n\f"}