{"id": "http://arxiv.org/abs/0907.4402v1", "guidislink": true, "updated": "2009-07-25T03:32:05Z", "updated_parsed": [2009, 7, 25, 3, 32, 5, 5, 206, 0], "published": "2009-07-25T03:32:05Z", "published_parsed": [2009, 7, 25, 3, 32, 5, 5, 206, 0], "title": "V1647 Orionis: Optical Photometric and Spectroscopic Monitoring Through\n  the 2003-2006 Outburst", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.2489%2C0907.2222%2C0907.0207%2C0907.3085%2C0907.4833%2C0907.4651%2C0907.4381%2C0907.5170%2C0907.1064%2C0907.3054%2C0907.5352%2C0907.0011%2C0907.1774%2C0907.0876%2C0907.3051%2C0907.5204%2C0907.4329%2C0907.0499%2C0907.2224%2C0907.3099%2C0907.0675%2C0907.4023%2C0907.5158%2C0907.0128%2C0907.2424%2C0907.0919%2C0907.1428%2C0907.3747%2C0907.3118%2C0907.4350%2C0907.2967%2C0907.3934%2C0907.3887%2C0907.2817%2C0907.1851%2C0907.3443%2C0907.5179%2C0907.2310%2C0907.0962%2C0907.3167%2C0907.4895%2C0907.0449%2C0907.2724%2C0907.4602%2C0907.1771%2C0907.2602%2C0907.2055%2C0907.0170%2C0907.4488%2C0907.4116%2C0907.3557%2C0907.0364%2C0907.2637%2C0907.1231%2C0907.3139%2C0907.2770%2C0907.3121%2C0907.4690%2C0907.0760%2C0907.0127%2C0907.4402%2C0907.2147%2C0907.1921%2C0907.2049%2C0907.1129%2C0907.1873%2C0907.4542%2C0907.4416%2C0907.0308%2C0907.3888%2C0907.2320%2C0907.2367%2C0907.5461%2C0907.3338%2C0907.2923%2C0907.4797%2C0907.4564%2C0907.1833%2C0907.4380%2C0907.3283%2C0907.3706%2C0907.2632%2C0907.1114%2C0907.4020%2C0907.4455%2C0907.5032%2C0907.0126%2C0907.2721%2C0907.4115%2C0907.3958%2C0907.4749%2C0907.0681%2C0907.3249%2C0907.5453%2C0907.3484%2C0907.4605%2C0907.4648%2C0907.3651%2C0907.4824%2C0907.4353%2C0907.0976&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "V1647 Orionis: Optical Photometric and Spectroscopic Monitoring Through\n  the 2003-2006 Outburst"}, "summary": "We present results from an optical imaging and spectroscopic monitoring\ncampaign on the young, low-mass eruptive variable star V1647 Orionis. The star\nand associated nebulosity (McNeil's Nebula) were observed over the period\nFebruary 2004 to February 2006 with observations commencing a few months after\nthe original outburst event occurred. Using the Gemini North telescope, we\nobtained multi-band optical imaging photometry and medium-resolution long-slit\nspectroscopy of V1647 Ori on an approximately monthly interval. During this\nperiod, V1647 Ori remained at, or close to, peak brightness and then faded by 5\nmagnitudes to close to its pre-outburst brightness. This implies an outburst\ntimescale of around 27 months. Spectral features seen in both emission and\nabsorption varied considerably during the monitoring period. For example, the\nHalpha line changed significantly in both intensity and profile. We present and\ndiscuss the observed photometric and spectroscopic changes and consider how\nthis eruptive event relates to the early formative stages of low-mass stars.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0907.2489%2C0907.2222%2C0907.0207%2C0907.3085%2C0907.4833%2C0907.4651%2C0907.4381%2C0907.5170%2C0907.1064%2C0907.3054%2C0907.5352%2C0907.0011%2C0907.1774%2C0907.0876%2C0907.3051%2C0907.5204%2C0907.4329%2C0907.0499%2C0907.2224%2C0907.3099%2C0907.0675%2C0907.4023%2C0907.5158%2C0907.0128%2C0907.2424%2C0907.0919%2C0907.1428%2C0907.3747%2C0907.3118%2C0907.4350%2C0907.2967%2C0907.3934%2C0907.3887%2C0907.2817%2C0907.1851%2C0907.3443%2C0907.5179%2C0907.2310%2C0907.0962%2C0907.3167%2C0907.4895%2C0907.0449%2C0907.2724%2C0907.4602%2C0907.1771%2C0907.2602%2C0907.2055%2C0907.0170%2C0907.4488%2C0907.4116%2C0907.3557%2C0907.0364%2C0907.2637%2C0907.1231%2C0907.3139%2C0907.2770%2C0907.3121%2C0907.4690%2C0907.0760%2C0907.0127%2C0907.4402%2C0907.2147%2C0907.1921%2C0907.2049%2C0907.1129%2C0907.1873%2C0907.4542%2C0907.4416%2C0907.0308%2C0907.3888%2C0907.2320%2C0907.2367%2C0907.5461%2C0907.3338%2C0907.2923%2C0907.4797%2C0907.4564%2C0907.1833%2C0907.4380%2C0907.3283%2C0907.3706%2C0907.2632%2C0907.1114%2C0907.4020%2C0907.4455%2C0907.5032%2C0907.0126%2C0907.2721%2C0907.4115%2C0907.3958%2C0907.4749%2C0907.0681%2C0907.3249%2C0907.5453%2C0907.3484%2C0907.4605%2C0907.4648%2C0907.3651%2C0907.4824%2C0907.4353%2C0907.0976&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "We present results from an optical imaging and spectroscopic monitoring\ncampaign on the young, low-mass eruptive variable star V1647 Orionis. The star\nand associated nebulosity (McNeil's Nebula) were observed over the period\nFebruary 2004 to February 2006 with observations commencing a few months after\nthe original outburst event occurred. Using the Gemini North telescope, we\nobtained multi-band optical imaging photometry and medium-resolution long-slit\nspectroscopy of V1647 Ori on an approximately monthly interval. During this\nperiod, V1647 Ori remained at, or close to, peak brightness and then faded by 5\nmagnitudes to close to its pre-outburst brightness. This implies an outburst\ntimescale of around 27 months. Spectral features seen in both emission and\nabsorption varied considerably during the monitoring period. For example, the\nHalpha line changed significantly in both intensity and profile. We present and\ndiscuss the observed photometric and spectroscopic changes and consider how\nthis eruptive event relates to the early formative stages of low-mass stars."}, "authors": ["Colin Aspin", "Bo Reipurth"], "author_detail": {"name": "Bo Reipurth"}, "author": "Bo Reipurth", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1088/0004-6256/138/4/1137", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0907.4402v1", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0907.4402v1", "rel": "related", "type": "application/pdf"}], "arxiv_comment": "59 pages, 22 figures", "arxiv_primary_category": {"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "astro-ph.SR", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0907.4402v1", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/0907.4402v1", "journal_reference": null, "doi": "10.1088/0004-6256/138/4/1137", "fulltext": "arXiv:0907.4402v1 [astro-ph.SR] 25 Jul 2009\n\nVersion: June 10, 2018\n\nV1647 ORIONIS: OPTICAL PHOTOMETRIC AND\nSPECTROSCOPIC MONITORING THROUGH THE 2003–2006\nOUTBURST\nColin Aspin & Bo Reipurth\nInstitute for Astronomy, University of Hawaii,\n640 N. A'ohoku Place, Hilo, HI 96720\ncaa@ifa.hawaii.edu, reipurth@ifa.hawaii.edu\nABSTRACT\nWe present results from an optical imaging and spectroscopic monitoring\ncampaign on the young, low-mass eruptive variable star V1647 Orionis. The\nstar and associated nebulosity (McNeil's Nebula) were observed over the period\nFebruary 2004 to February 2006 with observations commencing a few months\nafter the original outburst event occurred. Using the Gemini North telescope, we\nobtained multi-band optical imaging photometry and medium-resolution longslit spectroscopy of V1647 Ori on an approximately monthly interval. During\nthis period, V1647 Ori remained at, or close to, peak brightness and then faded\nby 5 magnitudes to close to its pre-outburst brightness. This implies an outburst\ntimescale of around 27 months. Spectral features seen in both emission and\nabsorption varied considerably during the monitoring period. For example, the\nHα line changed significantly in both intensity and profile. We present and\ndiscuss the observed photometric and spectroscopic changes and consider how\nthis eruptive event relates to the early formative stages of low-mass stars.\nSubject headings: stars: individual(V1647 Orionis) – Reflection nebulae – Accretion, Accretion disks\n\n1.\n\nINTRODUCTION\n\nWhen the amateur astronomer Jay McNeil discovered a new nebula in the L1630 molecular cloud in Orion in January 2004 (McNeil 2004), little did he know that it would spark\n\n\f–2–\nsignificant and extensive worldwide follow-up investigations. The nebula he discovered has\nsubsequently been designated \"McNeil's Nebula\" and its illuminating/exciting star named\nV1647 Orionis (Samus 2004). To date, around 30 publications have resulted from these\nstudies spanning the electromagnetic spectrum from X-ray to radio wavelengths. In these\nresearch papers, considerable speculation has been put forth as to the nature of this eruptive event, yet it is generally agreed that it is the result of a rapid and massive increase\nin accretion onto the surface of the young star. The reader is referred to the papers by\nÀbrahàm et al. (2004a,b, 2006), Acosta-Pulido et al. (2007), Andrews, Rothberg, & Simon\n(2004), Aspin et al. (2006), Aspin, Beck, & Reipurth (2008, herein ABR08), Aspin, Greene,\n& Reipurth (2009), Aspin et al. (2009), Briceño et al. (2004), Brittain et al. (2007), Fedele\net al. (2007a,b), Gibb et al. (2006), Grosso et al. (2005), Kastner et al. (2004, 2006), Kóspál\net al. (2005), Kun (2008), McGehee et al. (2004), Mosoni et al. (2005), Muzerolle et al.\n(2005), Ojha et al. (2004, 2006), Reipurth & Aspin (2004), Rettig et al. (2005), Semkov\n(2004, 2006), Tsukagoshi et al. (2005), Vacca, Cushing, & Simon (2004), Vig et al. (2006),\nand Walter et al. (2004) for further discussions.\nSuch eruptive events have been observed in a number of young stars dating back to the\nobservations and discussions by Herbig (1966). In this and subsequent papers, Herbig (1966,\n1977, 1989) suggested that these eruptions can be classed as either short-term EXors events\n(after the progenitor EX Lupi) lasting between a few weeks to a few years, or long-term\nFUors events (after the progenitor FU Ori) lasting decades to possibly even a century. Much\nemphasis has been placed on determining what type of outburst has occurred in the case\nof V1647 Ori, yet more compelling perhaps is understanding whether the FUor and EXor\nclasses are fundamentally similar in their origins or whether they are the result of distinct\nphenomena occurring on different timescales.\nIf the outburst of V1647 Ori is a FUor type eruption, then it is the first in almost 40\nyears since that of V1057 Cyg (Welin 1971). A large-scale effort to monitor V1647 Ori was\ntherefore undertaken involving use of both Gemini Observatory 8–meter telescopes (North\nand South) and the NASA IRTF 3–meter telescope over three observing semesters and\nutilizing six different facility instruments. This campaign resulted in approximately monthly\noptical imaging and spectroscopic and near-IR spectroscopic observations of V1647 Ori. In\nthis paper, the first in a series describing these data, we present optical observations spanning\nthe outburst phase, from the first follow-up observations taken soon after its discovery (taken\nin 2004 February and published in Reipurth & Aspin 2004) to the time when the source had\nfaded to its pre-outburst brightness (in February 2006). Clearly, the approximately two year\nlifetime of this event suggests that, at least superficially, the eruption of V1647 Ori is more\nsimilar to EXor event than those occurring in FUors.\n\n\f–3–\nIn this paper we present optical imaging and spectroscopic observations of V1647 Ori\ntaken between February 2004 and February 2006 and discuss the variations present in these\ndata. The observations and data reduction are described in §2. In §3 we present details\nof the temporal changes observed, and in §4 we consider what these observations imply\nregarding two physical components of the outburst, i.e. the fast wind and the accretion\nprocess. Finally, in §5 we piece together a time-line for the event and detail the evolution of\nthe eruption as implied by the data from our monitoring campaign.\n\n2.\n\nOBSERVATIONS & DATA REDUCTION\n\nAll but one dataset presented below were acquired using the \"Frederick C. Gillett\"\nGemini North telescope located on Mauna Kea, Hawaii using the facility optical imager and\nspectrograph, GMOS-N (Davies et al. 1997; Hook et al. 2004). The imaging observations\nused standard GMOS-N g', r', i', and z' filters which were designed to be as close as possible\nin characteristics to the Sloan Digital Sky Survey (SDSS) filters (Fukugita et al. 1996).\nFor the spectroscopic observations, all but one used the blue 600 lines/mm grating and 0.′′ 5\nwide long-slit. The one exception, the first observation taken, used the red 831 lines/mm\ngrating, again with a 0.′′ 5 wide long-slit. The spectral resolution of data taken were therefore\n∼4400 and ∼1700, corresponding to 0.34 and 0.45 Å pixel−1 respectively. The complete\nobservation log is presented in Table 1. In total, we acquired photometry at 16 different\nepochs and spectroscopy at 15 different epochs over the eruption period.\nThe additional spectrum of V1647 Ori was acquired using the W.M. Keck II telescope\nlocated on Mauna Kea, Hawaii, using the facility high-resolution echelle spectrograph HIRES\n(Vogt et al. 1994). The observations were made on UT 2004 September 24 when the star\nhad an optical V magnitude of about 17. The spectra covered the wavelength range 5800 to\n7150 Å and 7320 to 8700 Å at a nominal spectral resolution of R∼46,000 using a 0.′′ 86 wide\nslit. The on-source exposure time used was 60 minutes.\n\n2.1.\n\nImaging data reduction and calibration\n\nAll datasets were reduced using the Gemini IRAF data reduction package v1.8. Specifically, we used the routines gireduce for basic instrument signature removal (trim the images,\nsubtract the master bias image, and divide by the normalized master twilight flat field), and\ngmosaic for combining the data from the three GMOS-N CCDs into one image. In addition,\nmultiple exposures of the region were coadded using the IRAF routine imcombine. Aperture\n\n\f–4–\nphotometry of V1647 Ori was performed using the Starlink program gaia (Draper et al.\n2008). An aperture diameter of 2′′ was used for the photometric calculation and, due to\nthe bright nebulosity immediately surrounding the star, the sky signal was estimated from\nnumerous apertures located in blank sky regions throughout the image. The full width half\nmaximum (FHWM) seeing values in the acquired images are also given in Table 1.\nSince some of the data were acquired during non-photometric conditions, a photometric calibration was achieved relative to a dataset taken on a photometric night, UT 2004\nFebruary 14. A series of six field stars were used to provide a calibration sequence; their\nposition and magnitudes are listed in Table 2. Since the region containing V1647 Ori is one\nwith active star formation and young stars are well-known to be variable, using six field\nstars as calibrators was considered an acceptable way of minimizing errors introduced by\nintrinsic variability of the calibrator stars themselves. These stars, together with V1647 Ori,\nare identified in Fig. 1. Using instrumental magnitudes derived from calibrators, we additionally studied the variability of individual calibrators themselves and concluded that\nuncertainties resulting from source variability were small and within the quoted uncertainties on the V1647 Ori photometry. In addition to this, and to provide a consistency check, we\nhave used the SDSS photometry of V1647 Ori from UT Nov 11, 1998. These data were part\nof the early \"Orion\" release (Finkbeiner et al. 2004) downloaded from Princeton University1 ,\nand quoted in McGehee et al. (2004). Photometry of the same calibration sequence stars\nwas extracted from the SDSS data and found to be consistent with the photometry from our\nGMOS images within the associated errors (shown in Table 2).\n\n2.2.\n\nSpectroscopic data reduction\n\nAgain, all the Gemini/GMOS data were reduced using the Gemini IRAF data reduction package v1.8. Specifically, we used the routines gsreduce, gstransform, gsskysub,\ngscrrej, and gsextract for basic instrument signature removal (trim the images, subtract\nthe master bias image, and divide by the normalized flat field), wavelength calibration, sky\nline subtraction, cosmic ray removal, and point-source spectrum extraction, respectively.\nThe resultant spectra were not flux calibrated nor were atmospheric features removed\nsince we were primarily interested in the spectral features present and their intrinsic variability. In addition, Hα has been shown to be a relatively insensitive diagnostic for accretion rate\ndue to it, and other Balmer lines, becoming optically thick at high accretion rates (Muzerolle\net al. 1998), thus negating any requirement for flux determinations. Fig. 8 of Muzerolle et\n1\n\nsee URL http://photo.astro.princeton.edu/oriondatarelease\n\n\f–5–\nal. (1998) show model predictions for Hα flux vs. accretion rate and it is clear that the\nrelationship saturates at around 10−8 M⊙ yr−1 . Such rather low accretion rates are typically\nfound in 'weak-line' T Tauri stars (WTTS) and low activity 'classical' T Tauri stars (CTTS)\nlike DN and DQ Tau and not eruptive variables such as V1647 Ori.\nFor our HIRES data, a standard reduction was performed, including bias correction,\nflat-fielding, scattered-light correction, order extraction, and wavelength calibrations using\nstandard routines in the IRAF echelle package.\n\n3.\n3.1.\n\nRESULTS\n\nOptical photometry\n\nIn Fig. 2 we show our optical photometry of V1647 Ori from 2004 February to 2006\nFebruary for all four passbands, namely g', r', i', and z'. The horizontal dashed and dotted\nlines represent the pre-outburst SDSS brightness of the star (labeled filterP O ). The solid\nlines simply join the discrete observation points as a guide to the eye. The two long 'gaps' in\nthe observation sampling are the 2004 and 2005 summer months when Orion was not visible\nduring the nighttime period.\nOver the summer of 2004, the source appeared to remain at approximately the same\nbrightness, however, it is likely that some small-scale variability occurred. Our data from the\n2004–2005 winter months suggests that variability at the ∼0.5 magnitude level was present.\nSuch fluctuations were also reported by McGehee et al. (2004), Semkov (2004), Walter et\nal. (2004), Ojha et al. (2006), Acosta-Pulido et al. (2007), and Fedele et al. (2007) during\nseveral different observing periods.\nOver the summer of 2005, V1647 Ori exhibited a small yet significant decline in brightness, approximately the same in all filters, and amounting to ≤1 magnitude. Immediately\nafter this period, in 2005 September, a major decline phase began. From 2005 September\nonwards, the trend was for monotonic dimming, with possibly some slowing occurring in\nlate 2005. By the time of our last g' band photometric observation (in early 2006 January),\nV1647 Ori had already faded by about 4.4 magnitudes from its maximum brightness. At r',\nwe obtained one further observation (in 2006 mid-February) which shows a total fading of\nover 5 magnitudes. At this time V1647 Ori was already close to its pre-outburst SDSS r'\nmagnitude of 23.04.\nIn late 2006 December we took a short R-band exposure of V1647 Ori at the University\nof Hawaii 2.2m telescope on Mauna Kea, Hawaii which showed that the source had remained\n\n\f–6–\nvery faint and close to the above pre-outburst SDSS brightness. In addition, ABR08 presented photometry from 2007 February which showed V1647 Ori still close to its pre-outburst\nbrightness (r'=23.26±0.15).\n\n3.1.1. The GMOS and SDSS photometric systems\nBelow, we make use of SDSS photometry and therefore we briefly consider the significance of any differences in photometric systems involved to give confidence to the analysis\nthat follows. As we noted above, the GMOS g',r',i',z' filters were designed to be close\nto identical to those used by the SDSS survey (Smith et al. 2002). We therefore expect\nthe photometric results from GMOS to be quite similar to those from SDSS. However, to\nquantify this we have studied the GMOS and SDSS photometry of the calibration sequence\nused to boot-strap the photometry of V1647 Ori over the monitoring period. In Fig. 3 we\nshow the photometry of one representative field star labeled S4 in Fig. 1. These photometric values were derived using standard GMOS zeropoints for the observing period (i.e.\nZP(g')=27.93, ZP(r')=28.18, ZP(i')=27.90, ZP(z')=26.77, Jorgensen 2009) determined using observations of Landolt (1992) standard stars observed close in time to the UT 2004\nFebruary 14, V1647 Ori observations. The magnitudes of the Landolt standards (in the\nJohnson-Kron-Cousins photometric system) were transformed to the SDSS photometric system using the relationships derived by Smith et al. (2002). The horizontal lines through the\nobservations are the mean magnitudes of S4 in each GMOS filter (dot-dashed lines) and the\nSDSS magnitude of S4 from November 1998 SDSS observations (dashed lines). We note that\nthe slight shift between these lines suggest small differences in stellar magnitudes, however,\nthe shifts are in all cases smaller than the associated 1σ error on the data. We conclude,\ntherefore, that the differences between the GMOS and SDSS photometric systems are not\nsignificant for the analysis presented below.\n\n3.1.2. Optical colors\nDuring the whole outburst period, when the source was at or close to its maximum\nbrightness, the optical colors remained approximately constant. In Fig. 4 we show the trend\nin these colors over the monitoring period. The available SDSS pre-outburst colors (r'-i' and\ni'-z') are also shown as horizontal lines at the right edge of the plot. We note that during the\noutburst, i) the optical color indices are larger at shorter wavelengths, ii) both the r'-i' and\ni'-z' colors are bluer during outburst (by 0.4 and 0.5 magnitudes, respectively), and iii) there\nis a clear trend for these colors returning to their pre-outburst values as the decline phase\n\n\f–7–\nprogresses. In Fig. 5 we show the optical r'-i' and i'-z' colors plotted in a two color diagram.\nThe colors of V1647 Ori after outburst, but before the decline had started, are the cluster of\npoints near r'-i'∼1.8 and i'-z'∼1.5. The point labeled SDSS 1135 is from Modified Julian Date\n(MJD 2450000+) 1135 which is UT 1998 November 17 (the pre-outburst SDSS source color).\nThe three points labeled 3702, 3729, and 3740 are the source colors at those MJDs and are\nfrom the decline phase. These points are significantly closer to the pre-outburst color than\nthose during the outburst. In this plot, we also show the locus of main sequence dwarf colors\n(solid line) adapted from Fig. 1 of Finlator et al. (2000) and reddening vectors (dashed lines)\nfor a ratio of total to selective absorption R=AV /E(B-V)=3.1 extending from the extremities\nof the dwarf locus. These vectors represent a visual extinction AV =5 magnitudes. We have\nused the tabular data of D. Finkbeiner (private communication)2 to calculate the effective\nchange in r'-i' and i'-z' colors over the AV range plotted. All the colors of V1647 Ori lie\nbetween the two reddening vectors. Dereddening the SDSS 1135 color into the dwarf locus\nsuggests a spectral type of late-K to early M dwarf. During the outburst phase and through\nthe decline phase, the colors of V1647 Ori first become more blue and then more red. This\ncan be explained by either one, or a combination, of effects. Either a change in intrinsic\nsource color or a color and extinction change has occurred. We explore this effect in a plot\nof reddening invariant colors vs. time shown in Fig. 6. Reddening invariant colors are, as\nthe name suggests, colors that do not change as extinction along the line-of-sight changes.\nThese have been used by McGehee et al. (2004) in their study of V1647 Ori using SDSS\nphotometry and McGehee et al. (2004) in a study of accretion in low-mass young stars.\nFollowing Table 4 of McGehee et al. (2004), the reddening invariant color we use, Qriz is\ndefined as\nQriz = (r ′ − i′ ) − 0.987(i′ − z ′ ) f or RV = 3.1\n\n(1)\n\nHere we chose the standard interstellar value of RV =3.1, however, we note that the\nchange in Qriz for somewhat larger grains, e.g. RV =5.5, is relatively small (∼10%) when\ncompared to the associated uncertainties on the measurements. In Fig. 6 we perhaps see\na slight trend in Qriz suggesting a larger value as the eruption proceeds into the decline\nphase. However, the change in value is a small effect with respect to the associated errors.\nIf this difference is real, it would suggest that the intrinsic colors of the source are different\nout of outburst than in outburst. Such a color change is anticipated due to the added\noptical continuum luminosity from the enhanced accretion during the outburst (McGehee\net al. 2004). Fig. 2 of McGehee et al. (2005) plotted numerical model predictions for the\n2\n\nhttp://www.astro.princeton.edu/∼dfink/sdssfilters/\n\n\f–8–\nQriz of low-mass young stars vs. effective temperature, Tef f , and as a function of surface\ngravity, log(g). McGehee (private communication) has subsequently produced a version of\nthis plot for us showing the variation in Qriz up to Tef f =10000 K. We do not wish to\nover-interpret the current dataset due to the associated errors, however, comparing the Qriz\nvalue with the aforementioned plot, suggests that in its eruptive state the Tef f of the optical\nemission from V1647 Ori determined from its observed Qriz value (∼0.35±0.15) is in the\nrange 3000–4000 K. Distinguishing between different surface gravities in this plot would be\nimpossible since the range of Qriz values for log(g) of 3.5 and 5.5 at this Tef f is 0.25 to 0.35,\nrespectively. Unfortunately, we note that the SDSS pre-eruption value of Qriz from McGehee\net al. (2004)3 is of relatively poor quality (Qriz =0.25±0.23) due to the faintness of V1647 Ori\nin r' in November 1998 (MJD 1135, r'∼23.04±0.22) and is therefore not considered further.\n\n3.1.3. The pre-outburst to post-outburst light curve\nIn order to produce as complete a light curve of the 2003–2006 outburst of V1647 Ori\nas possible, we have combined our photometry with selected published results. In Fig. 7 we\nshow our SDSS i' band GMOS photometry from Table 3 together with the IC photometry\nof Briceño et al. (2004). We have used the polynomial transformation equation of Ivezić et\nal. (2007) to estimate SDSS photometric i' values from the Kron-Cousins (Landolt 1983) IC\nphotometry of Briceño et al. (2004). The transformation equations used was\ni′ = IC + 0.0307(r ′ − i′ )3 − 0.1163(r ′ − i′ )2 + 0.3341(r ′ − i′ ) + 0.3584\n\n(2)\n\nSince this (and any) transformation is source color dependent, we assume an intrinsic\ncolor for V1647 Ori of r'-i'=1.9, the mean of the pre-outburst and outburst colors. This\nresults in a transformation correction of 0.79 magnitudes. Additionally, since the software\naperture used by Briceño et al. is considerably larger than ours (aperture radii of 4.′′ 1 and\n1.′′ 0, respectively), we have estimated from our UT 2004 February 14 image an aperture\ncorrection for the transformed Briceño et al. data. Since the nebulosity local to V1647 Ori\nwas reasonably bright in Briceño et al. images from 2004 December 15 onwards, we apply\nthe aperture correction to only their data points subsequent to this date. The correction\nused was 0.62 magnitudes. The result of the transformation and aperture correction is to\ngive a reasonably good match (∆m=0.1m ) between our photometry (from MJD 3049) and\n3\n\nTable 5 from McGehee et al. (2004) quotes an eruptive value for Qriz for V1647 Ori of 0.81. This used\npreliminary photometry from Reipurth & Aspin (2004). After a more thorough study of the photometry\npresented in that paper, the true eruptive phase value for Qriz is 0.35.\n\n\f–9–\nthe closest value from Briceño et al. (from MJD 3036). Also shown in this figure is the IC\nphotometry from Acosta-Pulido et al. (2007). We have used the same transformation to\nSDSS photometry given by Ivezić et al. (2007) and shown in Eqn. 2 above. In Fig. 7 our\ndata are shown as open circles, the Briceño et al. data as filled dots, and the Acosta-Pulido\net al. data as filled stars. We additionally note that the pre-outburst (MJD 1135) SDSS\ni' photometry from McGehee et al. (2004) (indicated by the black dotted line in Fig. 7) is\nconsistent with our last data point (MJD 3782) suggesting that V1647 Ori had more or less\nreturned to its pre-outburst brightness in 2006 February.\nAnother dataset that has good temporal coverage using only one telescope/instrument\ncombination is the R band photometry of Ojha et al. (2006). They present 13 data points\ncovering the period from peak brightness to approximately half way down the steep decline\nphase. These data are shown in relation to our r' band photometry in Fig. 8. Due to the\nextensive overlap of data, we have made no attempt to match the two photometric systems\nand have merely shifted the Ojha et al. data (filled dots) by +1 magnitude (fainter) to match\nour data (open circles) as well as possible. We again note that our final r' photometric point\n(MJD 3782) is very close in value to the pre-outburst (MJD 1135) SDSS value of 23.04±0.22\nfrom McGehee et al. (2004).\nWe have additionally compiled all published near-IR K-band (2 μm) photometry and\nplotted it together with the above r' light curve in Fig. 9. This comparison shows that in the\nnear-IR the change in brightness of V1647 Ori was less than in the optical and amounted to\n∼2.8 magnitudes from the October 1998 2MASS photometry (horizontal dashed line). The\ndata were taken from Acosta-Pulido et al. (2007) and Ojha et al. (2006) although some of\nthe data points in Ojha et al. (2006) were taken from other sources (specifically Reipurth\n& Aspin 2004, McGehee et al. 2004, and Ojha et al. 2005). Unfortunately, there is no\nK-band photometry from the spring and early fall of 2006 and therefore we cannot, with\ncertainty, say whether the two light-curves are in phase or if there is a relative delay between\nthem. The few points in late 2006 and early 2007 suggest that the major decline phase of\nV1647 Ori was somewhat shallower at K than in the optical although this relies on so few\npoints that it is by no means certain. Nonetheless, the main fact arising from this plot is\nthat the amplitude of the K-band outburst was considerably less (by 2.2 magnitudes) than\nin the optical.\nFrom Figs. 7, 8 and 9, and previously published data, we can conclude that:\n• The total duration of the eruptive event was between 847 and 932 days (∼28 and 31\nmonths or 2.3 to 2.6 years). This value assumes the outburst began between MJD 2850\nand 2935 and ended around MJD 3782.\n\n\f– 10 –\n• The pre-outburst (SDSS, MJD 1135) and post-outburst (Gemini, MJD 3782) brightness of V1647 Ori are very similar.\n• The rise from the pre-outburst brightness to peak brightness took between 145 and\n230 days (due to the uncertainty in the date of the start of the eruption, see above).\n• The decline from peak brightness to pre-outburst brightness had two well-defined regions, a shallower phase from the late summer of 2004 to the fall of 2005 (∼410 days)\nwhen V1647 Ori faded by ∼1 magnitude, and a steeper phase from the fall of 2005 to\nits pre-outburst brightness in early 2006 (∼130 days) when it faded by an additional\n∼3.5 magnitudes.\n• Short-term variability was present during the shallow decline phase. This variability\namounted to a peak-to-peak amplitude of ∼0.7 magnitudes.\n• The 2003 eruptive event may have started from a somewhat elevated state. In November 1998 (MJD 1135) the SDSS (r' and i') photometry lies between 1 and 2 magnitude\nfainter than the brightness when the major eruption phase commenced in late 2003.\nIn addition, our last r' observation from February 2006 indicates that the star had\nreturned to this fainter level after the outburst had ceased. This behavior is shown\ngraphically in Fig. 10 where all of the above optical i' and IC data are plotted together\nwith an interpolated i' magnitude from 2006 February.4 We note also that the two\nIC observations of Briceño et al. (2004) from 1999 suggest that the source possessed\nsignificant variability when faint with photometry from January 1999 (IC =18.44±0.11\ntransforms to i'=19.31) and December 1999 (IC =20.08±0.4 transforms to i'=20.95)\nexhibiting a statistically significant difference of ∼1.6 magnitudes. This may suggest\nthat V1647 Ori underwent a period of significant instability prior to the main eruption\nphase.\n• The optical (r') and near-IR (K) light-curves differ significantly in their amplitude with\nthe optical being around 2.2 magnitudes larger.\n• Some 12 months after the decline to pre-outburst brightness, V1647 Ori remained\noptically very faint and close to its pre-outburst brightness.\n4\n\nusing the 2006 February r' magnitude and the r'-i' color from our 2006 January observation.\n\n\f– 11 –\n3.2.\n\nOptical Spectroscopic Features and their Evolution\n\nIn this section, we discuss our optical spectroscopic observations over the monitoring\nperiod but defer discussion of the strongest feature in the spectra, the Hα line, to §3.3.\nHowever, we do consider the Hα line when describing the HIRES echelle spectra below as an\nintroduction to the line properties. We note that all radial velocities quoted below have been\ncorrected to be heliocentric and that to convert to velocities in the stars frame of reference\nthe reader should use the rest velocity of the L1630 molecular cloud measured directly on\nV1647 Ori by Andrews, Rothberg, & Simon (2004) to be +10 km s−1 (see their Fig. 3).\nWe show a GMOS spectrum of V1647 Ori in Fig. 11 selected as representative of the\n15 GMOS spectra we obtained between February 2004 and February 2006. These are the\ndata from 2004 October 6 since it has good signal to noise and shows most of the spectral features present. The source shows a rising red continuum with strong Hα emission\nexhibiting a P Cygni profile. There are numerous weak features in the spectrum including\nthe Na D absorption at 5890 and 5896 Å. Table 4 lists the lines found in the spectra and\ntheir variability over the monitoring period. We have not measured equivalent widths for\nthe lines since, as we shall discuss below, such a value is affected significantly by the highly\nvariable optical continuum flux observed. Instead, we have merely specified whether the\nlines are in absorption or emission, or not present. As well as permitted emission lines of Fe,\nO, and Mg, numerous forbidden emission features, i.e. [Fe II], [O I], [S II], and [Ca II], are\nobserved. In Figs. 12, 13, 14, 16, and 17, we show extracted wavelength ranges around the\nNa D absorption lines, and the [S II], [O I] (6300 Å), Fe (6400–6550 Å), and the Ca emission\nlines (7200–7400 Å), respectively.\n\n3.2.1. Na D absorption lines\nThe Na D neutral absorption line profiles are shown in Fig. 12. The first observation\nof the monitoring period, taken on 2004 February 14, only showed weak Na D absorption.\nThis was blue-shifted by –200 km s−1 with respect to the rest wavelengths of the lines.\nBetween 2004 February 14 and March 10, the Na line profiles change significantly, they\nbecame stronger and considerably broader. On 2004 March 10, they were blue-shifted by –\n280 km s−1 with respect to the line rest wavelengths. Also at this time two emission features,\npresumably Na D lines, are present at 5895.3 Å (+270 km s−1 with respect to the bluer Na D\nline rest wavelength of 5889.9 Å) and 5899.7 Å (+190 km s−1 with respect to the redder\nNa D line rest wavelength of 5895.9 Å). These appear to be real features since emission is\n\n\f– 12 –\nalso seen in the lower resolution 2004 February 18 spectrum from Briceño et al. (2004)5 .\nAn absorption feature is seen at 5877 Å and its depth appears correlated to the strength\nof the Na D lines. This absorption feature is similar in width (∼160 km s−1 ) to the main\nNa I lines and could possibly be a highly blue-shifted component of Na absorption appearing\nat –640 km s−1 with respect to the shorter wavelength Na I line at 5890 Å. An alternative\nexplanation for the presence of this line is that it is the He I line at 5876 Å in absorption.\nPerhaps this is the more reasonable interpretation and is supported by the fact that we also\nobserve He I lines at 6678 and 7766 Å in absorption.\nAfter the summer months of 2004, the first spectrum taken was on 2004 September 9\nand showed the Na D lines even stronger than on March 10. Between September 9 and 2005\nJanuary 8 (the last observation before the 2005 summer break), the Na lines vary in intensity,\nbecoming weaker and stronger in successive months. The Na lines appear strongest on 2005\nJanuary 8 and are blue-shifted with respect to the rest wavelength by ∼–150 km s−1 . Large\nchanges occur between 2005 January 8 and the next observation on 2005 August 30 where\nthe Na lines have weakened significantly and appear less blue-shifted (∼–100 km s−1 ). In\nthe UT 2005 September 25 spectrum, the Na lines possibly appear weakly in emission and\nvery close to their rest wavelengths (–40 km s−1 ). From 2005 October 13 to the end of the\nmonitoring period, the Na lines have more or less disappeared.\nHighly structured Na I 5890 and 5895 Å lines are not uncommon amongst eruptive\nvariables, specifically FUors. Examples include FU Ori itself (Bastian & Mundt 1985; Hartmann & Calvet 1995), BBW 76 (Reipurth et al. 2003), V1057 Cyg (Bastian & Mundt 1985;\nHerbig, Petrov, & Duemmler 2003), and V1515 Cyg (Bastian & Mundt 1985). It was noted\nby Bastian & Mundt (1985) that all Na D profiles appear very similar to each other. This\nalso is the case if we compare these three FUors to the profile of BBW 76 from Reipurth et al.\n(2003). The time-series of BBW 76 by Reipurth et al. (2003) is particularly interesting since\nthey observed multiple minima in both Na lines which were predominantly blue-shifted by\nup to –300 km s−1 . In addition, between 1985 and 1994 the lines varied significantly in both\nwidth and blue-shifted velocity. We note here that the generally accepted interpretation of\nsuch Na I line structure is that an intense stellar wind, resulting from enhanced accretion,\nforms shell-like expanding/outflow structures which are accelerated close to the star/disk\nand slow with increasing distance (Bastian & Mundt 1985; Reipurth et al. 2003). Since our\ndata do not have the spectral resolution of the BBW 76 data (R∼2,000 as opposed to 20,000\nfor BBW 76) we cannot resolve individual shell components. However, the large line width\nand the blue-shifted nature of the absorption implies in itself that we are seeing considerable\n5\n\nKindly made available to us by C. Briceño.\n\n\f– 13 –\noutflowing material with a significant velocity gradient. If the absorption feature at 5877 Å\nis indeed a high-velocity blue-shifted Na component, then within one month (2004 February\n14 to March 10) the wind dramatically increases in density (line depth) and velocity (line\nwidth/range) with a maximum of over –600 km s−1 . For a spherically symmetric wind, the\nfact that we do not observe a symmetric profile, one with both blue-shifted and red-shifted\nabsorption, suggests that we only have an unobscured line-of-sight towards the absorbing\nmaterial that is expanding towards us. This is likely the result of obscuration by the circumstellar/accretion disk and implies that the material lies close to the star and is accelerated,\nin this location, to high velocities (see the discussion of Bastian & Mundt 1985 for more\ndetails). This is consistent with the inferred inclination of the axis of the nebula (McNeil's\nNebula) to the line-of-sight of ∼60◦ (Acosta-Pulido et al. 2007; ABR08), since we are looking\nonto the star/disk through the nebula.\n\n3.2.2. [S II] emission lines\nFedele et al. (2007) and ABR08 found [S II] emission at 6717 and 6731 Å in the\nspectrum of V1647 Ori in 2006 January and 2007 February, respectively. In Fig. 13, we\ntrace the evolution of this emission from 2004 February to 2007 February. We see that there\nare weak [S II] lines present as early as 2004 March 10 and they are seen in all our spectra\nup until the end of the monitoring period. The lines fall at their rest wavelength with the\nresolution we have, and vary in both intensity and ratio with time. The ratio 6717/6731 is\ngreater than unity from 2004 March 10 to 2006 January 5, and then, in our last two spectra,\ndrops to less than unity. From 2005 October 13 onwards, the lines appear to be doublepeaked with a separation of the peaks being ∼40 km s−1 . However, our spectral resolution is\ninsufficient to really study this structure in any detail or even to be certain of its existence.\nIf it is present then perhaps we are detecting red- and blue-shifted shocks from the star.\nWe have not derived electron densities, ne , from the ratio of the two sulfur lines\n(6717/6731, the ratio is only weakly dependent on temperature) from all our spectra since\nthe signal to noise of the line detection is, in many cases, insufficient. However, for five observations, 2005 October 13, 2005 November 27, 2005 December 25, 2006 January 05, and 2007\nFebruary 21, we consider the lines well enough detected. The derived ratios for 6717/6731\nare 1.3±0.1, 1.4±0.1, 1.4±0.1, 1.4±0.1, and 0.8±0.1 which give values of ne , derived using\nthe IRAF nebular.temden program for a temperature of 104 K, of 26–240, <121, <121,\n<121, and 910–2230 cm−3 , respectively. The ranges come from the uncertainties quoted on\nthe line ratios and the upper limit comes from a failure if temden to calculate densities for\na ratio >1.4. It seems, therefore, that the forbidden sulfur lines are formed in a rarefied gas\n\n\f– 14 –\nwhich becomes denser towards the end of our monitoring period although, even then, it is\nfar from the [S II] critical density of 20,000 cm−3 .\n\n3.2.3. [O I] 6300Å line\nThe [O I] emission line at 6300 Å varied significantly in intensity over the monitoring\nperiod. The changes are shown in Fig. 14. We note that the wavelength of this line is\ncoincident with a strong night-sky emission line although we consider sky subtraction to be\ngenerally very good. At the start of the observing period the line was absent and appeared\nsome time between 2004 February 14 and 2004 September 9 (unfortunately the spectrum\nfrom 2004 March 10 had a series of bad pixels at this wavelength and it was not possible to\ndetermine the presence of the line). From 2004 September 9 onwards, the [O I] line appeared\nto have an extended blue wing which persisted until the line faded. The blue wing extended\nto ∼–270 km s−1 from the line rest wavelength and Fig. 15 shows its profile from the spectrum\ntaken on UT 2004 November 13. The line continued to increase in intensity to 2005 January\n8 where it was at a maximum. Subsequently, the line faded but was still perhaps detectable\nin the low-resolution spectrum taken on 2007 February 21. We note that the spectrum from\n2006 February 16 had bad pixels at 6300 Å which were removed by interpolation. However,\nthe wings of the [O I] line are still detected.\nThe presence of forbidden emission lines in the optical spectra of young CTTSs has\nbeen studied by several authors (e.g. Edwards et al. 1987; Hartigan, Edwards, & Ghandour\n1995) and is generally associated with low-density outflowing gas. Typically, only blueshifted\nemission wings are observed which has led to the model that the circumstellar disk occults\nredshifted emission from a latitude-dependent wind with the highest gas velocities at the\npolar region of the star. From the models of Edwards et al. (1987), the only way to obtain\n[O I] profiles like those seen in V1647 Ori, i.e. single-peaked with an extended blueshifted\nwing, is to view the wind from a low inclination angle, specifically,i<45◦ for a wind opening\nangle θ of <30◦ (see Fig. 10 in Edwards et al. 1987). This upper limit to the inclination\nangle is somewhat at odds with that derived by Acosta-Pulido et al. (2004) and mentioned\nabove.\nAlso, in Fig. 14, longward of the 6300 Å [O I] line, we observe an absorption feature\nthat deepens and broadens. Its wavelength is 6347Å and we identify it as Si II. A weaker\nSi II line is also seen at 6371 Å. The 6347 Å line appears first weakly in the spectrum from\n2004 March 10 and becomes stronger until 2005 January 8. After this, it is possibly present\nuntil 2005 September 25 and then is absent.\n\n\f– 15 –\n3.2.4. Fe emission lines\nIn the wavelength range 6400 to 6540 Å, there are four Fe emission lines from permitted\n(three) and forbidden (one) transitions. These are [Fe II] at 6432 Å, Fe II at 6457 Å, Fe I\nat 6495 Å, and Fe II at 6517 Å. The evolution of these lines is shown in Fig. 16. The\n[Fe II] 6432 Å line is seen from the start of the monitoring period, 2004 February 14, to\n2005 November 27 with peak emission occurring on 2005 January 8. The Fe II 6457 Å line is\nrelatively weak in all spectra from 2004 September 9 to 2005 November 27 and peak emission\nalso occurs on 2005 January 8. The Fe I 6495 Å line is seen from 2004 March 10 to 2005\nOctober 13 and again, the emission peaks on 2005 January 8. Finally, the Fe II 6517 Å line\nis visible from 2004 February 14 to 2005 November 19 and it is strongest on 2005 January\n8. The Fe I 6495 Å line is consistently broader than either the Fe II or [Fe II] lines and\nit has a full-width half maximum (FWHM) of 250 km s−1 compared to 150 km s−1 for the\npermitted and forbidden ionized Fe lines. For comparison, the [Ca II] line at 7292 Å has a\nFWHM of 150 km s−1 while a CuAr arc lamp line located near the [Ca II] line has a FWHM\nof 130 km s−1 .\nIn Fig. 17 we also identify an additional [Fe II] emission line at 7388 Å. Its behavior\nis similar to that of the [Fe II] 6517 Å line although it disappears slightly earlier (2005\nSeptember 25 as opposed to 2005 November 27). It also peaks in intensity on 2005 January\n8.\nThe behavior of the [Fe II] line at 6432 Å seems consistent with that of the [S II] lines\ndescribed above and suggests a common excitation mechanism such as shock-excitation. The\npermitted Fe lines are generally considered as indicators of chromospheric activity in T Tauri\nstars (Beristain, Edwards, & Kwan 1998) and therefore should show similar behavior to the\n[Ca II] lines described below.\n\n3.2.5. [Ca II] emission lines\nWe have identified two [Ca II] emission lines at 7292 and 7324 Å. The variations in\nthese lines with time are plotted in Fig. 17. Our 2004 February 14 and March 10 spectra\ndid not include these lines, however, they are present in the spectra from 2004 September\n9 to 2007 February 21. The [Ca II] lines are well detected from 2004 September 9 to 2005\nAugust 30 and are weakly detected in the 2005 September 25 to 2005 October 13 spectra.\nThey are absent in the spectra taken after the latter date. The [Ca II] lines are unresolved\nwith respect to the line width defined by the CuAr arc lamp lines (see above).\n\n\f– 16 –\n3.2.6. The Keck II HIRES spectrum\nThe HIRES echelle spectra of V1647 Ori shows a number of both absorption and emission features with high-resolution providing information on their structure. Below, we consider each spectral feature and discuss their appearance.\nThe Hα line at high-spectral resolution is particularly interesting. It has been previously\nobserved at low-resolution to exhibit a P Cygni profile with a strong blue-shifted absorption\nand very broad emission (e.g. Reipurth & Aspin 2004; Walter et al. 2004). Our HIRES\nspectra are the highest spectral resolution data (R∼46,000) obtained on the source to date.\nFig. 18 shows the profile of Hα from 2004 September 24, some 10 months after the eruption\noccurred. At this time the source had a magnitude of r'∼18. The emission feature is asymmetric with an extended red wing reaching around +360 km s−1 . The blue-shifted absorption\nseems to begin close to the line rest wavelength and continues out to ∼–360 km s−1 , the\nslight peak at this velocity appears to be where the blue wing of the emission line reaches\nthe continuum level. This would make the emission symmetric about the line rest wavelength with a full-width zero intensity (FWZI) of around 720 km s−1 . The emission red\nwing appears to exponentially decay to the continuum. It is difficult to say where the line\nemission peak flux is located due to the overlying absorption. The absorption component\nappears to start close to the line rest wavelength and creates the very asymmetric profile\nseen in the blue wing. This is probably formed by a combination of two absorption features.\nThe blue-shifted absorption goes below the local continuum level and is flat-bottomed from\nabout –100 to –330 km s−1 . In Fig. 18 we show the Hα profile together with a best-fit profile\n(top) fitting the red wing of the emission only. Also shown (bottom) is the residual profile\nshowing the difference between the observed and best-fit profile. The profile of the fitted\nfeature is Lorentzian (neither a Gaussian or Voigt profile fit the red wing well). We note that\nthe profile of an unresolved arc line (ThAr) is best-fit with a Gaussian of FWHM∼6 km s−1 .\nThe residual profile shown in Fig. 18 exhibits extensive absorption superimposed on the Hα\nemission and clearly shows two distinct components, one at the Hα rest wavelength (the\ndot-dashed line) with a FWHM of ∼50 km s−1 , and the other extending from the continuum\nat –70 km s−1 out to –350 km s−1 . The more highly blue-shifted component has a more\ncomplex profile with the absorption being deepest at around –100 km s−1 then decreasing in\nan asymptotic manner to –290 km s−1 where the decrease becomes linear to the level of the\ncontinuum.\nWe detect the K I 7665 and 7699 Å lines which also possesses P Cygni profiles. The\nshorter wavelength line is located in the middle of the atmospheric O2 absorption band,\nhowever, the P Cygni structure is still evident and consistent with the longer wavelength\nline. The P Cygni absorption component has a velocity offset from the rest wavelength of\n\n\f– 17 –\n–160 km s−1 . The 2004 October low-resolution GMOS spectrum shows these K I lines which\nalso display P Cygni profiles.\nThe Na D lines are present in absorption only and are broad, relatively symmetric, and\nblue-shifted by about –145 km s−1 . These are consistent with our low-resolution GMOS\nspectrum from our nearest date, UT 2004 October 6. The signal to noise in the HIRES\nspectrum at the wavelength of the Na D lines in insufficient (S/N pixel−1 ∼5.5) to say if a\nnarrow interstellar Na D absorption component is present.\nThe 6347 and 6371 Å Si II lines are seen in absorption and both are shallow and broad\n(FWHM∼–130 km s−1 ). These lines are also seen in our low-resolution GMOS spectra from\n2004 October 6.\nThe Ca II line at 8498 and 8662 Å lines are strongly in emission (their equivalent width\nare 10 and 8 Å, respectively). The middle of the Ca II triple lines, at 8542 Å, is unfortunately\nnot within our observed spectral range. The longer wavelength line has a pronounced bluewing absorption feature extending to about –200 km s−1 from the line center. The profile of\nthis line is shown in Fig. 19. The line is triangular in profile as is the 8498 Å line.\nStrong line absorption at 7773 Å corresponds to the O I triplet lines. This line is\nat the end of an echelle order and so no further information is obtainable. In our lowresolution GMOS spectra, the O I triplet is highly blended but is seen in absorption from\n2004 September 3 to 2005 October 13. After this the lines are either not present or hidden\nin the noise.\nWe detect two very weak Mg II absorption lines at 7877 and 7897 Å. In our low-resolution\nspectrum from 2005 October 6, these lines are seen weakly in absorption confirming their\ndetection in the HIRES data.\nIt seems that the 6300 and 6363 Å [O I] lines are very weakly in emission. This is\nalso seen in our 2005 October 6 low-resolution spectrum confirming their identification in\nthe HIRES data. The signal to noise of the HIRES detection is low but the lines appear\nreal. Also they are relatively narrow with respect to other emission lines with a FWHM of\n∼40 km s−1 .\nA number of broad, weak emission lines of Fe I (6 lines) and Ti I (2 lines) are present.\nThe FWHM of both the Fe I and Ti I line is ∼100 km s−1 . There is a hint that the lines are\ndouble-peaked but, with the signal to noise present, it is difficult to say if this is correct or\nif they are broadened single lines or possibly overlapping pairs.\nFrom the above detailed description of the HIRES spectra, we can conclude that the\nfeatures present agree well with those seen in the 2004 October 6 low-resolution GMOS\n\n\f– 18 –\nspectrum. The HIRES spectrum also confirms that some of the weaker lines seen in the\nGMOS spectrum (with low signal to noise) are real.\n\n3.3.\n\nThe variability of the Hα line\n\nIn Fig. 20, we present the Hα profile of V1647 Ori over the period February 2004 to\nFebruary 2007. These 15 observations show considerable variation in both emission and\nabsorption characteristics as the eruption proceeded and during the decline phase. The\nbottom right tile of the plot shows the instrumental profile (CuAr arc lamp lines) close to\nthe wavelength of Hα. Fig. 21 shows an expanded view of the Hα profiles with an x-axis of\nvelocity offset in km s−1 from the rest wavelength of Hα (6562.8 Å).\nQualitatively, the Hα profile varies significantly even between consecutive observations.\nHα typically exhibits P Cygni type structure with an emission component and a blue-shifted\nabsorption feature. Throughout the outburst period, the emission component is extremely\nbroad with a maximum FWZI of close to 1500 km s−1 , however, it decreases in width as the\neruption progresses. The width of the blue-shifted absorption is over 600 km s−1 at the start\nof the monitoring period and also becomes smaller with time. Additionally, the absorption\nshifts towards the rest wavelength of Hα as well as decreasing in strength. Throughout\nthe first 18 months of the monitoring period, the absorption component absorbs below the\ncontinuum (see panels 2004FEB14 to 2005AUG30 in Figs. 20 and 21). After 2005AUG30,\nthe wind absorption appears to be not strong enough to absorb below the continuum level\nand merely eats into the Hα emission. Finally, we note that the Hα emission and absorption components are not of sufficient signal-to-noise in our last three datasets (2005DEC25,\n2006JAN05, and 2006FEB16) to reliably determine the extent of the absorption on the\nemission component.\nWe quantify the Hα profile structure and variations in both Table 5 and Fig. 22. In the\nlatter, we show several measures of Hα profile structure, specifically the equivalent width\nof the emission component (Wλ , top-right), the full-width zero intensity (Imax , FWZI) and\nthe full-width at Imax /40 (2.5%) intensity (FW2.5%, middle-left), the velocity width of the\nblue-shifted absorption feature (∆V, middle-right), the velocity offset of the wavelength\nof deepest or 'characteristic' absorption (Vchar , bottom-left), and the wavelength of peak\n(i.e. Imax ) Hα emission (λpeak bottom-right). We show the FWZI and FW2.5% variations\nsince it is interesting to both compare the behavior of these measures of profile width and\ndirectly relate the latter to values seen in other stars, specifically from Reipurth, Pedrosa, &\nLago (1996, henceforth RPL96). RPL96 pointed out that the FW2.5% is considerably less\nsensitive to noise than FWZI.\n\n\f– 19 –\nFrom Fig. 22 we see that as the eruption proceeded from early 2004 to early 2006\n(detailed in the r' band brightness variations shown in the top-left panel), the behavior of\nthe Hα profile measures was rather complex. Clearly, detailed numerical modeling of the\nprofile changes is required to characterize and quantify the physical and geometric properties\nof the accretion and outflow during the eruption (see for example Kurosawa, Harries &\nSymmington 2006). However, we consider that the above five empirically defined quantities\nmay give us some useful insight into the nature of the variability observed.\n\n3.3.1. Hα equivalent width in the 'High Plateau' phase\nOur measurements of the variation of the Hα emission WHα vs. time are shown as\nthe filled circles in the top-right panel of Fig. 22. This demonstrates that from soon after\nthe outburst began (2004 February) through to the start of the major decline phase (2005\nSeptember), WHα was approximately constant, with perhaps a slight decline, and had a\nmean value around –30 Å. This time period was referred to as the 'high plateau' phase of\nthe outburst decline by Acosta-Pulido et al. (2007) and we herein adopt this descriptive\ndesignation. Over the high plateau period, the brightness of V1647 Ori showed a decline of\nabout ∼1.2 magnitudes (see the top-left panel in Fig. 22). This would result in an increase\nin Wλ for constant Hα emission flux. Our average value of WHα ∼–30 Å is consistent with\nthe values presented in both Walter et al. (2004) and Ojha et al. (2006) whose data are also\nshown in Fig. 22 (as open squares and open circles, respectively). There are clearly shortterm fluctuations in WHα in all three datasets. These variations were considered possibly\nperiodic in nature by Walter et al. (2004) and Ojha et al. (2006). Acosta-Pulido et al. (2007)\ndetected short-term optical photometric variability in their light curves and, from a Fourier\nperiodicity search, derived a 56 day period. They commented that one possible interpretation\nof such a periodicity would be variable obscuration by circumstellar disk material orbiting\nthe young star.\n\n3.3.2. Timescales of Hα variability\nIf such a periodicity is present in broad-band optical photometry or WHα , or both, then\nit is clearly an important phenomenon for investigating the physics occurring during the\nV1647 Ori outburst. In our spectroscopic data, we perhaps see some temporal structure\nthat could be interpreted as periodic in nature. For example, in the period September 2004\nto January 2005, the variations appear reasonably well phased with the data of Walter et\nal. (open squares). However, with so few observations (five) and their temporal spacing,\n\n\f– 20 –\nwe cannot confirm that such periodic variability exists. What we can do is characterize the\nshortest timescale upon which variability is found. To do this, we consider the minimum\nseparation between consecutive observations (combining all data points) which show statistically significant variability and we adopt a >10% change in WHα as indicating statistical\nsignificance. There exists in the data only one date (MJD 3378) when observations were\ntaken less than 1 day of each other (i.e. on the same night). Upon this date, the Wλ values\nare consistent to better than 10%. Next, there are three occurrences of consecutive observations separated by 1 day (i.e. taken on consecutive nights) and in all three cases variability\nwas not detected at the >10% level. The shortest time interval over which a >10% change\nin WHα is detected is 3 days. Specifically, between MJD 3066 and 3069, WHα changed by\n+6 Å (from ∼–40 Å), a change of ∼15%. We conclude that, from the limited data available,\nvariability in WHα is present in V1647 Ori on timescales as short as 3 days.\n\n3.3.3. Hα equivalent width in the decline phase\nAfter the period of relatively constant WHα (February 2004 to September 2005), WHα\nbegins to change dramatically as the major photometric decline phase starts. By the time the\nsource has faded to close to its pre-outburst brightness (February 2006), WHα has increased\nto about –100 Å. The most obvious cause for such a dramatic change is the decrease in\ncontinuum emission as the source faded. From September 2005 to February 2006 the observed\nr' band magnitude decreased by ∼4 magnitudes or a factor 40. If the Hα flux remained\nconstant during this period then we would expect WHα to have increased by a factor 40\nfrom ∼–30 Å to –1200 Å. Since the increase in WHα was measured to be only a factor\n∼3.3, we can conclude that the Hα emission flux must have significantly decreased from\nSeptember 2005 to February 2006. We estimate this decline to be about a factor ∼12. If the\nHα emission is proportional to the mass accretion rate then this decline would correspond\nto an order of magnitude decrease in accretion from September 2005 to February 2006.\nUsing the relationship between near-IR H I emission line flux and accretion rate defined by\nMuzerolle et al. (1998a), Acosta-Pulido et al. (2007) estimated that the mass accretion rate\ndeclined from ∼5×10−6 M⊙ yr−1 in March 2004 to ∼5×10−7 M⊙ yr−1 in May 2006. This\nfactor 10 reduction in accretion rate is consistent with the 12× reduction in Hα emission\nflux we observe between similar dates.\n\n\f– 21 –\n3.3.4. Full Width Zero and 2.5% Intensity\nThe FWZI of Hα emission can be considered a measure of twice the maximum velocity\nHα emitting gas attains in the process of line creation. However, we note that this quantity\nis not just affected by bulk gas motion, since line broadening can occur. Muzerolle, Calvet,\n& Hartmann (1998) suggested that Stark broadening could be an important mechanism in\nproducing very large line widths. Muzerolle et al. (2001) presented model Hα line profiles\nunder the influence of Stark broadening by considering a realistic range of physical parameters related to the accretion process, magnetosphere size, inclination angle, and stellar mass\nand temperature. A comparison of Hα line profiles both with and without Stark broadening\n(and continuum opacity) showed that this effect can be a significant contributory factor with\nan increase of up to 2.5× in FWZI. Their consideration of such broadening resulted in line\nprofiles that better matched those observed in T Tauri stars. Stark broadening requires\noptically thick conditions and very high densities (nH <1012 cm−3 ), both of which are found\nin post-shock regions of hot accretion shocks (Hartigan et al. 1991; Valenti, Basri, & Johns\n1993).\nAs mentioned above, one problem with studying FWZI is signal to noise (henceforth\nS:N). Poor S:N can mask the true wavelength at which line emission fades to the continuum\nlevel. In the case of V1647 Ori, this is particularly important in the later spectra when\nthe source had faded below r'=20. Table 5 shows the S:N at both Imax and in the adjacent\ncontinuum for all spectra. FWZI is likely a good measure of velocity width from February\n2004 to the summer of 2005 where the S:N in the continuum is always >20. However, after\nthis time the continuum S:N drops to <5. Alternatively, FW2.5% of Hα emission has been\nconsidered (by RPL96) to be a measure of line width less sensitive to S:N since it does not\nrequire a precise definition of continuum level. This is due to FW2.5% being of a larger signal\nlevel and hence insensitive to continuum S:N issues. RPL96 observed a significant number\n(63) of young low- and intermediate-mass stars at high spectral resolution (R∼50000) and\npresented Hα line profiles for each. The profiles were divided into four classes (Type I–IV)\ndepending on the asymmetry of the line profile, and the location and depth of any associated\nabsorption. The reader is referred to RPL96 for the detailed definitions of the classes.\nThe changes occurring in FWZI and FW2.5% with time (middle-left panel of Fig. 22)\nmirror each other reasonable well from February 2004 to the middle of 2005. This suggests\nthat our measurement of FWZI is most likely accurate. In the above time period, FW2.5%\nis ∼1.4× smaller than FWZI. Subsequently, however, the FWZI and FW2.5% values become\nmuch more similar suggesting that our values of FWZI are likely underestimates due to poor\nS:N and that the trend seen in FWZI is not purely intrinsic to the star. If we measure the\nFWZI and FW2.5% of a pure gaussian profile we find that FW2.5% is a factor 1.515 smaller\n\n\f– 22 –\nthan FWZI. Hence, the red wing of Hα in V1647 Ori between February 2004 and mid-2005\nhave FWZI and FW2.5% values of close to the gaussian ratio value. We have therefore\nmultiplied the FW2.5% values from August 2005 onwards by a factor 1.515 and these are\ndisplayed in Fig. 22 (middle-left panel) as the FWZI values.\nFW2.5% decreases during 2004 from a maximum close to 1000 km s−1 (FWZI∼1400 km s−1 )\nto ∼750 km s−1 (FWZI∼1100 km s−1 ). After this time, the decrease in FW2.5% ceases and\nfrom 2005 onwards it remains at ∼750 km s−1 (scaled FWZI∼1150 km s−1 ). Hence, through\nthe major decline phase of V1647 Ori until it reaches its pre-outburst brightness, FW2.5% remains approximately constant. We note that the values encountered in V1647 Ori throughout\nthe eruption are considerably larger (by a factor ∼3×) than those found in CTTSs suggesting\nthat accretion activity has not declined completely to a quiescent level.\nThe range of values of FW2.5% seen in V1647 Ori is 750–1500 km s−1 . Fig. 9 of\nRPL96 shows that of their 63 sources, the peak in the distribution of (red wing) FW2.5%\nvalues lies at ∼600 km s−1 with only three stars showing values greater than 1000 km s−1 .\nHence, even when V1647 Ori had faded to its pre-outburst brightness, its FW2.5% value\nremained larger than the RPL96 distribution peak. The three sources that RPL96 found to\nhave FW2.5%>1000 km s−1 were R Mon, FW Cha, and AS 353A. These sources were all\nclassified as III-B6 in the RPL96 scheme possessing blue-shifted absorption. In total, 15 of\ntheir 63 sources showed type III-B profiles. The Hα profiles of V1647 Ori suggests that its\nRPL96 classification evolved with time from i) IV-B7 in February/March 2004, to ii) III-B in\nSeptember/October 2004, to iii) IV-B in November/December 2004, to iv) III-B in January\n2005 through to at least October 2005 and possibly beyond to February 2007 (although the\nS:N of the spectra are too poor to be definite).\n\n3.3.5. Absorption width and velocity offset\nThe width of the blue-shifted absorption feature (herein termed ∆V) and the velocity\nof the center of the blue-shifted absorption (herein termed vchar ) gives us information on the\nvelocity field of the outflowing absorbing gas. Specifically, we consider that we can associate\n∆V with the velocity dispersion in the ejected material, and vchar with its 'characteristic'\nvelocity.\n6\n\nDouble-peaked Hα emission with the peaks being of unequal height and the secondary peak being <50%\nof the primary peak\n7\n\nP Cygni profile with absorption at sufficiently high velocity absorption to absorb continuum flux beyond\nthe wing of the Hα emission.\n\n\f– 23 –\nThe temporal variability of ∆V (middle-right panel of Fig. 22) is considerably different\nfrom that of the Hα emission component. A very rapid decline in absorption width is seen\nbetween our first two observations taken in February 2004 (∆V∼600 km s−1 ) and March\n2004 (∆V∼300 km s−1 ). After this time, ∆V is approximately constant to the end of our\nwinter 2004–2005 monitoring season. At the start of the fall 2005 observing period, ∆V has\ndecreased to ∼100 km s−1 and there is some suggestion that this decrease was related to the\nmain photometric decline. During the fall/winter months of 2005, ∆V remains approximately\nconstant although the S:N of the spectra is poor. The final observation point, February 2007,\nalso had very low S:N but the indication is that the value of ∆V had changed little.\nThe velocity offset of the deepest absorption, vchar (bottom-left panel, dashed line), mirrors ∆V showing a similar large change between the first two observations (from ∼500 km s−1\nto ∼300 km s−1 ). This is followed by a slower decline (to ∼200 km s−1 ) between the spring\nand fall of 2004. In the fall of 2005 vchar had again decreased, this time by a factor ∼2 (to\n≤100 km s−1 ). By early 2006, when V1647 Ori had returned to its pre-outburst brightness,\nthe S:N of the spectra and the weakness of the absorption made a determination of vchar\ndifficult and all we can say is that it was ≤100 km s−1 .\n\n3.3.6. Peak emission wavelength\nThe wavelength of peak Hα emission is a rather complex quantity since it is dependent\nnot only on the motion of the emitting material, but also on the characteristics of any\nassociated absorption. For example, if a blue-shifted wind absorbs the blue wing of the\nemission line then the wavelength of peak emission can shift to the red. Alternatively, if the\nblue-shifted absorption is weak and we measure a wavelength shift in peak emission, then\nwe could interpret this as evidence for bulk motion of the emitting gas. Multiple absorption\ncomponents, as we saw in Fig. 18, also complicates the interpretation. In light of the above\ndiscussion, we refrain from any ad hoc interpretation of the changes in λpeak and merely\nrelate the variations observed.\nThe final panel of Fig. 22 shows the wavelength of peak Hα emission (λpeak , bottomright panel) over the monitoring period. Here we see a peak-to-peak variability of ∼3 Å\n(∼140 km s−1 ) from February 2004 to February 2007. Soon after outburst ( February/March\n2004), the peak in emission was measured to be slightly to the red of our assumed Hα rest\nwavelength (6562.8 Å). By the fall of 2004, λpeak had shifted to the blue by about 1 Å\n(∼45 km s−1 ). During the fall/winter of 2004, the peak had shifted back to its original\nwavelength (of February/March 2004). When our monitoring commenced again in the fall\nof 2005, λpeak was at about the same wavelength as in spring 2005 but soon after it shifted\n\n\f– 24 –\nbriefly to the blue and then rapidly to the red and by the spring of 2006 it was located\nredward of the rest wavelength by ∼1.7 Å (∼80 km s−1 ). This trend continued until our last\nobservation, in February 2007, when λpeak was at +2.5 Å (∼120 km s−1 ).\n\n3.4.\n\nHα Profile Modeling\n\nIt is generally agreed that the presence of complex Hα emission structure with blueshifted absorption in the spectrum of a young star is the result of the combination of emission\nfrom magnetospheric accretion and absorption from strong, dense stellar winds. The recent\npapers by Muzerolle, Calvet & Hartmann (1998), Alencar et al. (2005), Kurosawa, Harries,\n& Symington (2006), and Bouvier et al. (2007) discuss models involving such processes and\ntheir fit to observations of low-mass stars. It is clearly important to consider such numerical\nsimulations to available datasets to allow the derivation of physical parameters such as\noutflow and accretion rates, and test the validity of the specific models. However, due to the\ncomplexity of such analyses in regions of high accretion (Kurosawa, private communication),\nwhat follows will concentrate on a qualitative understanding of the changes observed.\n\n4.\n\nPhysical Components of the Outburst\n\nThe eruptive event that commenced between 2003 October 23 and 2003 November 15\n(Briceño et al. 2004) resulted in the dramatic brightening of V1647 Ori and the appearance\nof what is now known as McNeil's Nebula. The event was apparently extremely violent\nsince about three months after the outburst occurred (when our first observations were\ntaken) the star had optically brightened by a factor ∼100 and produced a P Cygni Hα\nprofile exhibiting both a very high velocity (∼600 km s−1 ), blue-shifted, absorption trough\n(indicative of the presence of a dense wind) and strong emission with an enormous velocity\nwidth (i.e. FWZI∼1500 km s−1 - indicative of magnetospheric accretion and perhaps Stark\nbroadening). How these Hα spectral features evolved over the first three months of the\neruption is unknown, however, they are likely to be at least similar in nature to those\nobserved at three months old if not even more extreme. Below, we summarize what we can\ndeduce from our results regarding the properties and evolution of the wind and accretion\nphenomena.\n\n\f– 25 –\n4.1.\n\nThe Fast Wind\n\nAt the three month mark of the eruption, a strong wind existed producing two minima\nin the blue-shifted absorption (see Fig. 21). Such a double-trough absorption profile was\nevident at times, for example, in the spectra of V1057 Cyg, a classical FUor (see Bastian\n& Mundt 1985). However, the two components of the wind disappeared between our first\nand second observations on UT 2004 February 14 and UT 2004 March 10, respectively.\nThe optical spectrum of Ojha et al. (2005) from UT 2004 February 22 did not show such\nfeatures either. The two minima in the Hα absorption on UT 2004 February 14, were at\nvelocities of v= –270, and –530 km s−1 with respect to the rest wavelength of Hα (6562.8 μm).\nOn UT 2004 March 10, the single absorption minimum was at v= –350 km s−1 . A doublepeaked absorption could be associated with multiple shell-like wind components ejected with\ndifferent velocities or with the geometry and motion of the emission region. A continuing\nslowing of the wind is indicated by the vchar values plotted in Fig. 22 where the velocity of the\nabsorption minimum declined from a maximum of –530 km s−1 to a minimum of –150 km s−1 .\nThe width of the absorption component, ∆V, also declined over this period (from 560 to\n100 km s−1 ) indicating a reduction in velocity dispersion in the wind and suggesting that the\nwind decelerated as it expanded away from V1647 Ori. Such behavior is perhaps consistent\nwith the stochastic wind models of Grinin & Mitskevich (1992) and Mitskevich, Natta, &\nGrinin (1993). In these models the wind is non-isotropic and clumpy and decelerates at large\ndistances from the young star.\n\n4.2.\n\nThe Emission Region\n\nDuring the period of rapid decline of vchar , i.e. between 2004 February 14 and March\n10, the FWZI of the Hα emission remained relatively constant at ∼1500 km s−1 . As we saw\nabove, such a value is somewhat larger than typically found in accreting classical T Tauri\nstars (from the work of RPL96). Additional examples of this are RW Aur, which exhibited a\nFWZI of ∼1000 km s−1 in the spectra of Alencar et al. (2005), and some sources studied by\nMuzerolle, Hartmann, & Calvet (1998) and Alencar & Basri (2000) where a typical FWZI\nwas found to be in the range 600 to 1000 km s−1 . The FWZI did not show significant\ndecline until sometime between our observation in March 2004 and our next observation\nin September 2004. Over this period the FWZI had reduced by around 500 km s−1 (to\n∼1000 km s−1 ). During the period of the major photometric decline, from August 2005 to\nFebruary 2006, the FWZI remained in the range 1000–1400 km s−1 , i.e. the dramatic change\nin optical brightness of V1647 Ori did not appear to be strongly correlated with the FWZI\nof the Hα emission. This argues that the optical fading and the Hα emission are not the\n\n\f– 26 –\nresult of the same physical processes.\nAs we related above, contributions to the FWZI of the Hα emission probably arise in\nboth bulk gas motion and Stark broadening. The region of Hα emission therefore much be\nextremely dense and suggests that it is the post-shock region of the accretion shock. The\nchange in optical colors as the major photometric decline phase began (they became redder)\nsuggests that there was a reduction in blue continuum from the accretion shock region.\nBriceño et al. (2004) observed the spectrum of V1647 Ori using reflected light from McNeil's\nNebula and found it to correspond to that from an early B-type source i.e. the hot accretion\nshock. Correspondingly, the reduction in blue continuum likely resulted from of a decline in\npost-shock temperature and density, probably due to a slowing of the accretion rate. The\ndecline in accretion rate was estimated, using near-IR H lines, to be an order of magnitude\nbetween March 2004 and May 2006 (Acosta-Pulido et al. (2007).\n\n5.\n\nOutburst Timeline\n\nWe now attempt to piece together the timeline of events over the outburst period and\nrelate the photometric and spectroscopic variations discussed above.\n1. Prior to the outburst, V1647 Ori appeared to be in an unstable state with variations in\noptical brightness of up to ∼2 magnitudes. It appeared that the main outburst event\nwas initiated from an photometrically elevated state existing for at least 5 years prior\nto the main eruption i.e. from the first Briceño et al. (2004) and McGehee et al. (2004,\nSDSS) observations.\n2. The outburst began between late-July and late-October 2003. Unfortunately, there are\nonly a handful of photometric measurements for the first three+ months of the event.\nThese were obtained serendipitously during an Orion OB1 photometric monitoring\nprogram (Briceño et al. 2001). The rise time to peak brightness was short, 120 days,\nwith a change in optical (I-band) brightness of 3.6 magnitudes.8\n3. At the time of our first observations, the first taken on the source after its discovery by\nMcNeil (2004), the star had brightened from its pre-outburst level by over 5 magnitudes\nin the optical and over 2 magnitudes at 2 μm. It had optical spectral features indicative\nof a massive accretion burst producing a fast, dense stellar wind creating high-velocity\n8\n\nV1647 Ori had already brightened by ∼1 magnitude prior to this but it is unknown when this occurred\ndue to lack of observations during this period (Briceño et al. 2004).\n\n\f– 27 –\nblue-shifted P Cygni-type absorption on strong Hα emission. In the NIR, V1647 Ori\npossessed strong emission in Brγ, Na I, and the v = 2 − 0 CO overtone bandheads, all\nindications were that the emission region was hot, extremely dense, and in an excited\nkinematic state. The optical brightening is attributed to a combination of the star\nbeing revealed after dust in the immediate circumstellar environment of the object was\nsublimated (Aspin et al. 2009) together with a luminosity increase due to the addition\nof significant hot accretion flux. The brightening in the NIR is perhaps more likely the\neffect of irradiation and subsequent heating of the inner regions of the circumstellar\ndisk, beyond the sublimation radius, by UV flux from the accretion flow. However, it\nis clear that the heating did not propagate through to outer regions of the disk since\nthe sub-mm/mm flux remained unchanged.\n4. Over the next 10 months, V1647 Ori remained within half a magnitude of its outburst\noptical/NIR brightness although there was seemingly stochastic variability at the level\nof around 1 magnitude peak-to-peak. Statistically significant brightness fluctuations\nwere seen on periods as short as a few days. During this so-called \"high-plateau\" phase,\nthe optical spectrum of V1647 Ori showed strong P Cygni Hα emission on a relatively\nstable continuum. This suggests that the accretion process continued unabated over\nthis period with only minor variations occurring. This is supported by the reasonably\nconstant FWZI of Hα (∼1500 km s−1 ), indicating that the emission was taking place\nin very dense gas, and the derived accretion rate from NIR line emission. During\nthis same period, the wind quickly slowed (from vchar ∼600 km s−1 to 200 km s−1 ).\nAlso, the velocity dispersion in the wind mirrored vchar in that it quickly declined (from\n∆V∼600 km s−1 to 200 km s−1 ). During the rapid decline in wind velocity and velocity\ndispersion, weak shock-excited emission lines of [S II] appeared in the optical spectrum.\nThese remained approximately constant to the end of the monitoring period. During\nthe summer months of 2004, an [O I] emission line appeared and strengthened for\nabout a year. This may be the result of the formation of a partly obscured bipolarlike outflow and its formation approximately corresponded to the period of the highplateau. Subsequently, the [O I] line declined in intensity which corresponded to the\nrapid decline in brightness of V1647 Ori.\n5. At the start of the rapid decline phase of the optical flux (in the fall of 2005, some\n6 months after our last plateau-phase observation), V1647 Ori had already shown a\nsignificant reduction in Hα FWZI (∼1500 km s−1 to ∼800 km s−1 ), wind velocity\n(vchar ∼300 km s−1 to ∼200 km s−1 ), wind velocity dispersion (∆V∼250 km s−1 to\n∼150 km s−1 ), and accretion rate (a factor 10). This suggests that the density of the\nregion of Hα emission declined and the wind slowed. Two of the three aforementioned\nparameters (FWZI and ∆V) remained approximately constant to the end of our mon-\n\n\f– 28 –\nitoring period (in 2006 February) when the source had faded by ∼4 magnitudes and\nreturned to its pre-outburst optical brightness. The only significant change was in\nwind velocity which continued to decline (δv∼250 km s−1 to ∼100 km s−1 ) into early\n2006 implying that the wind was still decelerating.\n6. In the period after February 2006, beyond the time period investigated here, we obtained one further set of observations that proved rather interesting. These were published in Aspin, Beck, & Reipurth (2008) and were obtained approximately one year\nafter the last observation presented above. In February 2007, the optical brightness of\nV1647 Ori remained close to its February 2006 value with r'=23.3. Little evidence was\nseen for blueshifted Hα absorption suggesting that the wind had continued to weaken\nover the intervening year. The FWZI of Hα remained at ∼800 km s−1 implying that\nthe accretion process had perhaps settled into a quasi-steady state. The Hα line profile calculations by Muzerolle, Calvet, & Hartmann (2001) discussed above, gave values\nof FWZI of this order (see their Figs. 8, 11, and 12) and produced a good match to\nobservations of some CTTSs (e.g. BP Tau with FWZI∼800 km s−1 ). In addition, the\nFebruary 2007 data showed that shock-excited [S II] emission was still present, as was\nweak [O I] emission with a weak blueshifted component.\n\nAcknowledgments\nWe are grateful to G.H. Herbig for providing the HIRES spectrum of V1647 Ori presented above. We also thank C. Briceño for access to his 2004 February 18 spectrum of\nV1647 Ori. We additionally thank D. Finkbeiner and P. McGehee for assistance with accessing SDSS data, and the latter for providing numerical model information. This work is\nbased on observations obtained at the Gemini Observatory (under program identifications\nGN-2004A-DD-3, GN-2004B-Q-28, GN-2005B-Q-1), which is operated by the Association of\nUniversities for Research in Astronomy, Inc., under a cooperative agreement with the NSF\non behalf of the Gemini partnership: the National Science Foundation (United States), the\nParticle Physics and Astronomy Research Council (United Kingdom), the National Research\nCouncil (Canada), CONICYT (Chile), the Australian Research Council (Australia), CNPq\n(Brazil) and CONICET (Argentina). Funding for the SDSS and SDSS-II has been provided\nby the Alfred P. Sloan Foundation, the Participating Institutions, the National Science Foundation, the U.S. Department of Energy, the National Aeronautics and Space Administration,\nthe Japanese Monbukagakusho, the Max Planck Society, and the Higher Education Funding\nCouncil for England. The SDSS Web Site is http://www.sdss.org/. The SDSS is managed\nby the Astrophysical Research Consortium for the Participating Institutions. The Participating Institutions are the American Museum of Natural History, Astrophysical Institute\n\n\f– 29 –\nPotsdam, University of Basel, Cambridge University, Case Western Reserve University, University of Chicago, Drexel University, Fermilab, the Institute for Advanced Study, the Japan\nParticipation Group, Johns Hopkins University, the Joint Institute for Nuclear Astrophysics,\nthe Kavli Institute for Particle Astrophysics and Cosmology, the Korean Scientist Group,\nthe Chinese Academy of Sciences (LAMOST), Los Alamos National Laboratory, the MaxPlanck-Institute for Astronomy (MPIA), the Max-Planck-Institute for Astrophysics (MPA),\nNew Mexico State University, Ohio State University, University of Pittsburgh, University\nof Portsmouth, Princeton University, the United States Naval Observatory, and the University of Washington. This research has made use of NASA's Astrophysics Data System\nBibliographic Services. This research has made use of the SIMBAD database, operated at\nCDS, Strasbourg, France. We are most fortunate to have the opportunity to conduct astronomical observations from the sacred mountain Mauna Kea. During this research, CA was\nsupported in part by NASA through the American Astronomical Society's Small Research\nGrant Program. BR acknowledges partial support from the NASA Astrobiology Institute\nunder Cooperative Agreement No. NNA04CC08A.\n\nREFERENCES\nÀbrahàm, P., Kóspal, A., Csizmadia, S., Moór, A., Kun, M., & Stringfellow, G. 2004, A&A,\n419, L39\nAlencar, S. H. P., Basri, G., Hartmann, L., & Calvet, N. 2005, A&A, 440, 595\nAndrews, S.M., Rothberg, B., & Simon, T. 2004, ApJ, 610, L45\nAspin, C., & Reipurth, B. 2005, IAU Circ. 8600\nAspin, C., & Sandell, G. 1994, A&A, 288, 803\nAspin, C., Barbieri, C., Boschi, F., Di Mille, F., Rampazzi, F., Reipurth, B., & Tsvetkov,\nM. 2006, AJ, 132, 1298\nAspin, C., Beck, T. L., & Reipurth, B. 2008, AJ, 135, 423\nAspin, C., Greene, T. P., & Reipurth, B. 2009, AJ, 137, 2968\nBeristain, G., Edwards, S., & Kwan, J. 1998, ApJ, 499, 828\nAspin, C., et al. 2009, ApJ, 692, L67\nBouvier, J., et al. 2007, A&A, 463, 1017\n\n\f– 30 –\nBriceño, C., Vivas, A.K., Hernández, J., Calvet, N., Hartmann, L., Megeath, T., Berlind,\nP., Calkins, M., & Hoyer, S. 2004, ApJ, 606, L123\nBriceño, C., et al. 2001, Science, 291, 93\nDraper, P.W., Gray, N., Berry, D.S., Taylor, M. (2008) Starlink Users Note 214.\nEislöffel, J., & Mundt, R. 1997, AJ, 114, 280\nGrinin, V. P., & Mitskevich, A. S. 1992, Cool Stars, Stellar Systems, and the Sun, 26, 394\nGrosso, N., Kastner, J.H., Ozawa, H., Richmond, M., Simon, T., Weintraub, D.A., Hamaguchi, K., & Frank, A. 2005, A&A, 438, 159\nHartmann, L., Calvet, N., Gullbring, E., & D'Alessio, P. 1998, ApJ, 495, 385\nHartmann, L., & Kenyon, S.J. 1996, ARA&A, 34, 207\nHerbig, G.H. 1966, Vistas in Astronomy, 8, 109\nHerbig, G.H. 1977, ApJ, 217, 693\nHerbig, G.H. 1989, in ESO Workshop on Low Mass Star Formation and Pre-Main Sequence\nObjects, ed. B. Reipurth, p. 233\nHerbig, G.H., Aspin, C., Gilmore, A.C., Imhoff, C.L., & Jones, A.F. 2001, PASP, 113, 1547\nHerbig, G.H., Petrov, P.P., & Duemmler, R. 2003, ApJ, 595, 384\nIvezić, Z., Smith, J.A., Miknaitis, G., Lin, H., Tucker, D., + 19 (2007) in \"The Future of\nPhotometric, Spectrophotometric, and Polarimetric Standardization\", Ed. C. Sterken,\nASP Conference Series, v364, 165\nJorgensen, I. 2009, PASA, preprint\nKastner, J.H., Richmond, M., Grosso, N., Weintraub, D.A., Simon, T., Frank, A., Hamaguchi, K., Ozawa, H., & Henden, A. 2004, Nature, 430, 429\nKospal, A., Abraham, P. A.-P. J., Csizmadia, S., Eredics, M., Kun, M., & Racz, M. 2005,\nInformation Bulletin on Variable Stars, 5661, 1\nKun, M. 2008, Information Bulletin on Variable Stars, 5850, 1\nKurosawa, R., Harries, T. J., & Symington, N. H. 2006, MNRAS, 370, 580\n\n\f– 31 –\nLandolt, A. U. 1983, AJ, 88, 439\nLehmann, T., Reipurth, B., & Brandner, W. 1995, A&A, 300, L9\nMallas, J.H., & Kreimer, E. 1970, The Messier Album (Cambridge: Sky Publ. Corp.)\nMcGehee, P.M., Smith, J.A., Henden, A.A., Richmond, M.W., Knapp, G.R., Finkbeiner,\nD.P., Ivezic, Z., & Brinkmann, J. 2004, ApJ, 616, 1058\nMcNeil, J.W., 2003, IAU Circ. 8284\nMitskevich, A. S., Natta, A., & Grinin, V. P. 1993, ApJ, 404, 751\nMuzerolle, J., Megeath, S.T., Flaherty, K.M., Gordon, K.D., Rieke, G.H., Young, E.T., &\nLada, C.J. 2005, ApJ, 620, L107\nMuzerolle, J., Calvet, N., & Hartmann, L. 1998, ApJ, 492, 743\nOjha, D.K., Ghosh, S.K., Tej, A., Verma, R.P., Vig, S., Anupama, G.C., Bhatt, B.C.,\nParihar, P., Prabhu, T.P., Kamath, U.S., & Anandarao, B.G., 2005, Bull. Astron.\nSoc. India, 33, 370\nReipurth, B., & Aspin, C. 1997, AJ, 114, 2700\nReipurth, B., & Aspin, C. 2004, ApJ, 606, L119\nReipurth, B., Pedrosa, A., & Lago, M. T. V. T. 1996, A&AS, 120, 229\nRettig, T.W., Brittain, S.D., Gibb, E.L., Simon, T., & Kulesa, C. 2005, ApJ, 626, 245\nRosino, L. 1969, Proceedings of the Symposium held at University of Virginia, 1968. Ed.\nShiv S. Kumar. New York: Gordon and Breach, Science Publishers, 1969, p.181\nTsukagoshi, T., Kitamura, Y., Kawabe, R., Saito, M., Yokogawa, S., & Kurono, Y. 2005,\nPASJ, 57, L21.\nVacca, W.D., Cushing, M.C., & Simon, T. 2004, ApJ, 609, L29\nVogt, S.S. et al., 1994, Proc. SPIE, 2198, 362\nWalter, F.M., Stringfellow, G.S., Sherry, W.H., & Field-Pollatou, A. 2004, AJ, 128, 1872\nWelin, G. 1971, A&A, 12, 312\n\nThis preprint was prepared with the AAS LATEX macros v5.2.\n\n\f– 32 –\n\nTable 1. V1647 Ori Gemini GMOS-N Observing Log\nUT Date\nyymmdd\n\nMJDa\n\nFilters and/or\nGrism Used\n\nExposure Times\n(seconds)\n\n981116\n040214\n040310\n040903\n040909\n040924\n041006\n041113\n041212\n050108\n050830\n050921\n050925\n051013\n051119\n051127\n051128\n051225\n060105\n060216\n061222f\n070221\n070222\n\n1134\n3049\n3074\n3251\n3257\n3272\n3284\n3322\n3351\n3378\n3612\n3634\n3638\n3656\n3692\n3701\n3702\n3729\n3740\n3782\n4090\n4152\n4153\n\ng,r,i,zb\ng',r',i',z'c ,R831d\nr',B600e\ng',r',i',z'\nB600\nHIRES\ng',r',i',z',B600\ng',r',i',z',B600\ng',r',i',z',B600\ng',r',i',z',B600\ng',r',i',z',B600\ng',r',i',z'\nB600\ng',r',i',z',B600\nr',B600\nB600\ng',r',i',z'\ng',r',i',z',B600\ng',r',i',z',B600\nr',B600\nR\nR400\ng',r',i',z'\n\n–\n60,60,60,60\n10,1200\n30,30,30,30\n900\n3600\n30,30,30,30,900\n30,30,30,30,1200\n30,30,30,30,1200\n30,30,30,30,1200\n30,30,30,30,900\n30,30,30,30\n900\n30,30,30,30,900\n30,900\n30,1200\n60,60,60,60\n60,60,60,60,1200\n60,60,60,60,1200\n120,3600\n30\n3.5 hours\n600\n\na Modified\n\nSeeing\n(r'-band)\n0.′′ 9\n0.′′ 54\n0.′′ 96\n0.′′ 53\n0.′′ 62\n?\n0.′′ 48\n0.′′ 49\n0.′′ 58\n0.′′ 78\n0.′′ 63\n0.′′ 48\n0.′′ 65\n0.′′ 68\n0.′′ 60\n0.′′ 61\n0.′′ 59\n0.′′ 59\n0.′′ 49\n0.′′ 42\n0.′′ 90\n0.′′ 76\n0.′′ 60\n\nJulian Date. 2450000+\n\nb SDSS\n\nobservations taken from the galactic plane Orion release data\n(Finkbeiner et al. 2004).\nc GMOS\n\n\"Sloan\" filters.\n\nd GMOS\n\nRed 831 lines/mm grating, blaze wavelength 757nm, R∼4396\nwith 0.′′ 5 slit, simultaneous wavelength coverage 207nm, 0.034 nm/pixel.\ne GMOS Blue 600 lines/mm grating, blaze wavelength 461nm, R∼1688\nwith 0.′′ 5 slit, simultaneous wavelength coverage 276nm, 0.045 nm/pixel.\nf Taken\n\non University of Hawaii 2.2m telescope.\n\n\fTable 2. V1647 Ori and comparison star coordinates and photometrya\nSource\n\na\n\n05\n05\n05\n05\n05\n05\n05\n\n46\n46\n46\n46\n46\n46\n46\n\n13.1\n13.0\n12.3\n11.4\n16.3\n11.6\n09.6\n\nDecl.\n(J2000)\n-00\n-00\n-00\n-00\n-00\n-00\n-00\n\n06\n08\n08\n07\n06\n06\n03\n\n05\n15\n08\n55\n52\n28\n31\n\ng'\n(Mags)\n\nr'\n(Mags)\n\ni'\n(Mags)\n\nz'\n(Mags)\n\n24.74±0.76\n23.09±0.15\n23.29±0.18\n23.26±0.17\n21.93±0.06\n23.74±0.27\n23.26±0.18\n\n23.04±0.22\n21.14±0.04\n21.19±0.05\n21.39±0.05\n20.30±0.02\n21.00±0.04\n20.35±0.02\n\n20.81±0.05\n19.47±0.02\n18.74±0.02\n20.71±0.05\n18.58±0.02\n18.96±0.03\n18.33±0.02\n\n18.80±0.04\n18.37±0.03\n16.93±0.02\n19.65±0.07\n17.54±0.02\n17.22±0.02\n16.85±0.02\n\nSDSS photometry taken from the galactic plane \"Orion\" release data (Finkbeiner et al.\n2004) dataset 'calibImage-259-r3-0534' from 1998 Nov 17 (MJD 51134). Errors are from\nquoted inverse variance measurements on the PSF fluxes.\n\n– 33 –\n\nV1647 Ori\nS1\nS2\nS3\nS4\nS5\nS6\n\nR.A.\n(J2000)\n\n\fTable 3. V1647 Ori Optical Photometry\ng'±err(dg')\n(mags)\n\n1135c\n3049\n3074\n3251\n3284\n3322\n3351\n3378\n3612\n3634\n3656\n3692\n3702\n3729\n3740\n3782\n4090\n\n–\n20.05±0.15(0.00)\n––\n20.06±0.15(0.01)\n20.27±0.15(0.21)\n20.28±0.15(0.23)\n20.75±0.15(0.70)\n20.19±0.15(0.14)\n21.06±0.15(1.01)\n21.27±0.15(1.22)\n21.58±0.15(1.53)\n––\n23.60±0.15(3.55)\n24.00±0.15(3.95)\n24.44±0.15(4.39)\n––\n––\n\na Modified\n\n23.04±0.22(6.34)\n17.70±0.09(0.00)\n17.91±0.09(0.21)\n17.81±0.09(0.11)\n18.03±0.09(0.33)\n18.02±0.09(0.32)\n18.38±0.09(0.68)\n17.89±0.09(0.19)\n18.69±0.09(0.99)\n18.87±0.09(1.17)\n19.26±0.09(1.56)\n21.01±0.09(3.31)\n21.10±0.09(3.40)\n21.58±0.09(3.88)\n21.94±0.09(4.24)\n22.89±0.09(5.19)\n22.78±0.25(5.08)e\n\ni'±err(di')\n(mags)\n\n20.81±0.05(5.91)\n15.90±0.08(0.00)\n––\n15.93±0.08(0.03)\n16.20±0.08(0.30)\n16.19±0.08(0.29)\n16.52±0.08(0.62)\n16.10±0.08(0.20)\n16.86±0.08(0.96)\n17.00±0.08(1.10)\n17.37±0.08(1.47)\n––\n19.07±0.08(3.17)\n19.49±0.08(3.59)\n19.74±0.08(3.84)\n20.69±0.08(4.79)d\n––\n\nz'±err(zg')\n(mags)\n\ng'-r'\n(mags)\n\nr'-i'\n(mags)\n\ni'-z'\n(mags)\n\nQriz b\n(mags)\n\n18.80±0.04(4.41)\n14.39±0.06(0.00)\n––\n14.39±0.06(0.00)\n14.66±0.06(0.27)\n14.65±0.06(0.26)\n15.06±0.06(0.67)\n14.60±0.06(0.21)\n15.37±0.06(0.98)\n15.54±0.06(1.15)\n15.90±0.06(1.51)\n––\n17.42±0.06(3.03)\n17.79±0.06(3.40)\n18.07±0.06(4.58)\n––\n––\n\n1.70\n2.35\n–\n2.25\n2.24\n2.26\n2.37\n2.30\n2.37\n2.40\n2.32\n–\n2.50\n2.42\n2.50\n–\n–\n\n2.23\n1.80\n–\n1.88\n1.83\n1.83\n1.86\n1.79\n1.83\n1.87\n1.89\n–\n2.03\n2.09\n2.20\n–\n–\n\n2.01\n1.51\n–\n1.54\n1.54\n1.54\n1.46\n1.50\n1.49\n1.46\n1.47\n–\n1.65\n1.70\n1.67\n–\n–\n\n0.25±0.23\n0.31±0.20\n\nJulian Date. 2450000+\n\nb Reddening\nc SDSS\n\nr'±err(dr')\n(mags)\n\ninvariant colors as defined by McGehee et al. (2004).\n\nphotometry taken from the galactic plane Orion release data (Finkbeiner et al. 2004) from MJD51134\n\nd i'\n\nphotometry derived from r' and r'-i' color from MJD 3740.\n\neR\n\nphotometry from image taken at University of Hawaii 2.2m telescope.\n\n0.36±0.20\n0.31±0.20\n0.31±0.20\n0.42±0.20\n0.31±0.20\n0.36±0.20\n0.43±0.20\n0.44±0.20\n0.40±0.20\n0.41±0.20\n0.55±0.20\n\n– 34 –\n\nMJDa\n\n\fTable 4. Identification of Spectral Featuresa\nMJD\nLine (Å)\nYY\nMM\nDD\n\n3053\n\n3074\n\n3251\n\n3257\n\n3284\n\n3322\n\n3378\n\n3612\n\n3634\n\n3656\n\n3692\n\n3701\n\n3702\n\n3740\n\n3782\n\n4152\n\n04\n02\n14\n\n04\n02\n18\n\n04\n03\n10\n\n04\n09\n03\n\n04\n10\n06\n\n04\n11\n13\n\n04\n12\n12\n\n05\n01\n08\n\n05\n08\n30\n\n05\n09\n25\n\n05\n10\n13\n\n05\n11\n19\n\n05\n11\n27\n\n06\n12\n25\n\n06\n01\n05\n\n06\n02\n16\n\n07\n02\n21\n\n–\n–\nA\nE\n–\nWA\n–\nWA\nE\n–\nE\nP\n–\nA\nO\nO\nO\nO\nO\nO\nO\nO\nO\nO\nO\nO\nO\n\n–\n–\nAE\n–\nE\nA\n–\nA\n–\n–\n–\nP\n–\n–\n–\n–\n–\n–\n–\n–\n–\nO\nO\nO\nO\nO\nO\n\n–\nA\nAE\nWE\nWE\nA\nE\nA\nE\nE\nE\nP\nE\nA\nA\nE\nO\nO\nO\nO\nO\nO\nO\nO\nO\nO\nO\n\nE\nA\nAE\nE\nE\nA\nE\nA\nE\nE\nE\nP\nE\nA\nWA\nE\n?\nE\nE\nE\nE\nE\nP\nA\nWA\nA\nA\n\nWE\nWA\nA\nE\nE\nA\nE\nA\nE\nE\nE\nP\nE\n–\n?\nE\nE\nE\nE\nE\nE\nE\nP\nA\nWA\nA\nA\n\nWE\nA\nA\nE\nE\nA\nWE\nA\nE\nE\nE\nP\nE\nWE\nA\nE\nE\nE\nE\nE\nE\nE\nP\nA\nWA\nA\nA\n\nE\nWA\nA\nE\nE\nA\nE\nA\nE\nE\nE\nP\nE\nE\nA\nE\nWE\nE\nE\nE\nE\nE\nP\nA\nWA\nA\nA\n\nWE\nA\nA\nE\nE\nA\nE\nA\nE\nE\nE\nP\nE\nE\nWA\nE\nX\nX\nE\nE\nE\nE\nP\nA\nWA\nWA\nWA\n\n–\nWA\nA\nE\nE\nA\nWE\nA\nE\nE\nE\nP\nE\n–\nWA\nE\nWE\nE\nE\nWE\nE\nE\nP\nA\nWE\nWE\n–\n\n–\n–\nAE\nE\nE\nA\n–\nA\nWE\nE\nE\nP\nE\nE\nWE\nE\n–\nE\nE\nWE\nWE\nE\nP\nA\n–\n–\nWA\n\n–\n–\nWA\nWE\nE\n–\nE\nWA\nE\nE\nE\nP\nE\nWE\nE\nE\n–\nE\nWE\nWE\nX\nX\nP\nA\n–\n–\n–\n\n–\n–\n–\n–\nE\n–\nE\nWA\nWE\nWE\n–\nP\nE\n–\nWE\nE\n–\nE\n–\nE\nWE\n–\nWP\n?\n–\n–\n–\n\n–\n–\n?\n–\nE\n–\nE\n–\n–\nE\n–\nP\nE\n–\n–\nE\n–\n–\n–\n–\n–\nE\n–\n–\n–\n–\n–\n\n–\n–\n–\n–\nE\n–\nE\n–\n–\n–\nE\nP\nE\n–\n–\nE\n–\n–\n–\n–\n–\nE\nE\n?\n–\n–\n–\n\n–\n–\n–\n–\nE\n–\nE\n–\n–\n–\n–\nP\nE\n–\n–\nE\n–\n–\n–\n–\n–\nE\nE\n?\n?\n?\n–\n\n–\n–\n?\n–\nE\n–\nE\n–\n–\n–\n–\nP\nE\n–\n–\nE\n–\n–\n–\n–\n–\n–\n–\n?\n–\n–\n–\n\n–\n–\n–\n–\nE\n–\n–\n–\n–\n–\n–\nP\nE\n–\n–\n–\n–\n–\n–\n–\n–\n–\nA\nWE\n?\n–\n–\n\n– 35 –\n\n[Fe II] 5226\nHe I 5876\nNa D 5890+5896\nFe I 6192\n[O I] 6300\nSi II 6347\n[O I] 6363\nSi II 6371\n[Fe II] 6432\nFe I 6495\nFe II 6517\nHα 6563\n[S II] 6713+6731\nHe I 6678\nHe I 7066\n[Fe II] 7155\n[Ca II] 7261\n[Ca II] 7291\n[Ca II] 7324\n[Fe II] 7388\nFe II 7462\nFe II 7711\nK I 7699\nO I 7773\nMg II 7877\nHe I 7878\nMg II 7896\n\n3049\n\n\fa E=emission,\n\nA=absorption, WE=weak, P=P Cygni profile, X=bad pixels at location of line, ?=inconclusive, –=no line evident, O=outside observed spectral range.\n\n– 36 –\n\n\f– 37 –\n\nTable 5. V1647 Ori Hα Line Profiles\nMJDa\n\n3049\n3074\n3257\n3273\n3284\n3322\n3351\n3378\n3612\n3638\n3656\n3692\n3701\n3729\n3740\n3782\n4152m\n\nS:Nb\n\nWλ c\n(Å)\n\nλpeak d\n(Å)\n\nδλpeak (δvpeak )e\n(Å(km s−1 ))\n\nFWZIf\n(km s−1 )\n\nFW2.5%g\n(km s−1 )\n\nFW10%h\n(km s−1 )\n\n∆vi\n(km s−1 )\n\nvchar j\n(km s−1 )\n\n252(34)\n400(39)\n282(42)\n352(10)\n278(36)\n261(41)\n212(29)\n361(49)\n160(23)\n108(13)\n141(17)\n38(4)\n29(2)\n40(3)\n39(3)\n29(1)\n15(1)\n\n–31.4±2.0\n–50.9±2.0\n–24.1±2.0\n–18.0±1.0\n–29.5±2.0\n–22.1±2.0\n–29.2±2.0\n–27.1±2.0\n–21.2±2.0\n–29.2±2.0\n–30.2±2.0\n–37.2±2.0\n–64.2±2.0\n–64.9±2.0\n–66.6±2.0\n–98.7±2.0\n–136.2±2.0\n\n6563.2±0.1\n6563.0±0.1\n6562.3±0.1\n6563.3±0.1\n6562.5±0.1\n6562.7±0.1\n6562.8±0.1\n6563.2±0.1\n6563.0±0.1\n6562.5±0.1\n6563.4±0.1\n6563.6±0.1\n6563.4±0.1\n6563.7±0.1\n6563.9±0.1\n6564.4±0.1\n6565.4±0.1\n\n+0.4(18)\n+0.2(9)\n+0.5(23)\n+0.5(24)\n–0.3(–14)\n–0.1(–5)\n0.0(0)\n+0.4(18)\n+0.2(9)\n–0.3(–14)\n+0.6(27)\n+0.8(37)\n+0.6(27)\n+0.9(41)\n+1.1(50)\n+1.6(73)\n+2.6(119)\n\n1392±30\n1384±30\n958±30\n960±10\n1208±30\n1002±30\n1056±30\n1180±40\n840±40\n930±50\n1190±50\n970±80\n688±80\n876±100\n868±100\n770±100\n822±100\n\n968±30\n1030±30\n664±30\n592±30\n822±30\n660±30\n778±30\n856±30\n740±30\n714±30\n864±30\n858±30\n604±30\n704±30\n686±30\n730±30\n762±30\n\n534±30\n562±30\n460±30\n440±10\n564±30\n450±30\n526±30\n556±40\n476±40\n464±50\n512±50\n518±80\n458±80\n536±100\n598±100\n632±100\n756±100\n\n552±30\n270±30\n308±30\n255±20\n273±30\n332±30\n248±30\n238±30\n158±30\n112±30\n95±30\n109±60\n98±60\n<100\n<100\n<100\n<100\n\n516±20\n294±20\n230±20\n210±10k\n220±20\n208±20\n213±20\n167±20\n150±20\n144±20\n142±20\n127±50\n108±50\n–l\n–\n–\n–\n\na Modified\nb Signal\n\nJulian Date. 2450000+\n\nto noise on the Hα emission peak and, in parentheses, in the adjacent continuum.\n\nc Equivalent\n\nwidth of emission component calculated from the continuum levels on the blue and red edges of the main Hα emission\npeak. The uncertainties are estimated from the spread of repeat measurements.\nd The\n\nwavelength of peak Hα emission, λpeak\n\ne Offset\n\nof peak Hα emission from 6562.8 Å in Å and, in parentheses, km s−1 .\n\nf The Full-Width Zero Intensity of the Hα emission in km s−1 . The velocity offset to the continuum on the red side of 6562.8 Å\nwas measured then doubled to obtain the FWZI value. The uncertainties are estimated from the spread of repeat measurements.\ng The Full-Width Intensity of the Hα emission in km s−1 measured to a signal of I\nmax /40 (2.5%), where Imax is the peak line\nintensity. The width is measured on the red side of 6562.8 Å and was doubled to obtain the FW2.5% value. The uncertainties are\nestimated from the spread of repeat measurements.\nh The Full-Width Intensity of the Hα emission in km s−1 measured to a signal of 10% of the peak intensity, I\nmax . The width is\nmeasured on the red side of 6562.8 Å and was doubled to obtain the FW10% value. The uncertainties are estimated from the spread\nof repeat measurements.\ni The\n\nwidth of the Hα absorption feature in km s−1 . The uncertainties are estimated from the spread of repeat measurements.\n\nj The velocity offset (in km s−1 ) of the deepest absorption from 6562.8 Å, the rest wavelength of Hα. The uncertainties are estimated\nfrom the spread of repeat measurements.\nk Keck/HIRES\nl Emission\nm Data\n\nspectrum. Profile not shown in Figs. 20 and 21\n\nand absorption to weak to accurately measure at signal to noise present.\n\nfrom Aspin et al. (2009).\n\n\f– 38 –\n\n03:30\n04:00\n30\n\nDeclination (J2000)\n\n05:00\n30\n\n-0:06:00\n30\n07:00\n30\n08:00\n30\n18 16 14 12 5:46:10\nRight Ascension (J2000)\n\nFig. 1.- The region of L1630 including V1647 Ori and McNeil's Nebula. This r' band image\nwas taken on Gemini North using GMOS on UT 2004 February 14. V1647 Ori and the six\ncalibration sequence stars, labeled S1 to S6, are identified. North is at the top, East to the\nleft. The scale of the image is 0.′′ 144/pixel and the exposure time was 40 seconds in seeing\nof FWHM 0.′′ 52.\n\n\f– 39 –\n\nFig. 2.- Optical photometry of V1647 Ori spanning the period 2004 February to 2006\nFebruary. The data were obtained using the Gemini facility imager/spectrograph GMOSN in SDSS filters g', r', i', and z'. The horizontal lines are the pre-outburst brightness of\nV1647 Ori from the SDSS Orion survey data and additionally presented in McGehee et al.\n(2004).\n\n\f– 40 –\n\nFig. 3.- Optical photometry at g', r', i', and z' of the field star labeled S4 in Fig. 1.\nThe observations are shown as open circles with associated error bars. These values were\nderived using the SDSS photometry of all six calibration stars (see Fig. 1) as photometric\nreference. For each passband, the associated 1σ variation on the mean of all observations\nis shown assuming that the star S4 is not intrinsically variable. The dot-dashed lines show\nthe mean value of the aforementioned data points, while the dashed lines show the magnitude of S4 derived using the GMOS zeropoints (ZP(g')=27.93, ZP(r')=28.18, ZP(i')=27.90,\nZP(z')=26.77 from Jorgensen 2009) from early 2004. We note that the difference between\nthe two lines is, in all cases, smaller than the associated photometric errors.\n\n\f– 41 –\n\nFig. 4.- Optical colors of V1647 Ori spanning the period 2004 February to 2006 February.\nThe data were obtained using the Gemini facility imager/spectrograph GMOS-N in SDSS\nfilters g', r', i', and z'. The dashed, dot-dashed, and dotted lines joining the observations\nare the g'-r', r'-i', and i'-z' colors, respectively. The short dashed, dot-dashed, and dotted\nhorizontal lines from MJD (50000+) 3800–3900 are the pre-outburst colors of V1647 Ori\nfrom the SDSS Orion survey data and additionally presented in McGehee et al. (2004).\n\n\f– 42 –\n\nFig. 5.- A color-color plot of the r'-i' and i'-z' colors of V1647 Ori shown in Fig. 4. The\nsolid line is the locus of stellar main sequence dwarfs taken from Finlator et al. (2000).\nRepresentative spectral types are shown. The dashed lines extending from the ends of this\nlocus are reddening vectors for R=3.1. These are calculated using the tabular data provided\nby D. Finkbeiner (http://www.astro.princeton.edu/∼dfink/sdssfilters/). The three points\nlabeled (MJD 50000+) 3702, 3729, and 3740 represent data taken close to the end of the\noutburst. Their location is consistent with either increased reddening with respect to the\noutburst colors, or a change in effective temperature. The pre-outburst colors of V1647 Ori\nare labeled SDSS 1135.\n\n\f– 43 –\n\nFig. 6.- A plot of the reddening invariant color, Qriz , vs. MJD. Within the associated\nerrors, the only possible trend in Qriz is a slight increase in value after MJD 3600. See\nSection 3.1.2 for the definition of Qriz .\n\n\f– 44 –\n\nFig. 7.- Optical i' band photometry of V1647 Ori using GMOS (open circles) from 2004\nFebruary to 2006 February together with the Ic photometry from Briceño et al. 2004 (filled\ncircles) from 2003 November to 2004 February, and the Acosta-Pulido et al. (2007) Ic photometry (filled stars) from 2004 February to 2006 February. The Briceño et al. photometry\nhas been transformed from IC to SDSS i' magnitudes using the transformation equations\npresented in Ivezić et al. (2007). Additionally, the Briceño et al. data points from MJD\n2989 onwards have had an aperture correction applied (+0.62 magnitudes) since the software\naperture used by Briceño et al. had a radius of 4.′′ 1 while our aperture radius was 1′′ . The\nhorizontal black dotted line shows the November 1998 SDSS i' photometric magnitude of the\nsource (i'=20.81). Prior to the time period displayed, Briceño et al. reported the Ic magnitude of V1647 Ori to be 18.44±0.11 (i'=19.31) in January 1999, and 20.08±0.3 (i'=20.95)\nin December 1999.\n\n\f– 45 –\n\nFig. 8.- Optical r' band photometry of V1647 Ori using GMOS (open circles) from 2004\nFebruary to 2006 February together with the R photometry from Ojha et al. 2006 (filled\nstars) from 2004 February to 2005 November. We have shifted the Ojha et al. data vertically\nby 1 magnitude to obtain good correspondence between the Gemini and Ojha et al. values\nthroughout the overlap region. The horizontal dotted line is the November 1998 SDSS r'\nphotometry (r'=23.04).\n\n\f– 46 –\n\nFig. 9.- The optical r' band light-curve from Fig. 8 together with the near-IR K-band lightcurve compiled from the literature. The r' band photometry is shown as open circles (this\npaper) and filled stars (Ojha et al. 2006). The K-band photometry is shown as open squares\n(from Acosta-Pulido et al. (2007) and Ojha et al. 2006). We have shifted the optical data\nvertically by 8 magnitude so that both light-curves can easily been compared. The horizontal\ndot-dashed line is the November 1998 SDSS r' photometry (r'=23.04). The horizontal dashed\nline is the October 1998 2MASS K-band photometry (K=10.27). The vertical dotted line is\nat MJD 3750 and is merely there as an aid in relating the two light-curves.\n\n\f– 47 –\n\nFig. 10.- Optical photometry of V1647 Ori using a) GMOS i' band data (open circles)\nfrom 2004 February to 2006 February, b) the Briceño et al. (2004) Ic band data transformed\nto i' magnitudes (filled dots) from 1999 January to 2004 February, c) the i' band SDSS data\nfrom McGehee et al. (2004) (open squares) from 1998 November to 2002 February, and\nd) the Acosta-Pulido et al. (2007) Ic band data transformed to i' magnitudes (filled stars)\nfrom 2004 February to 2006 February. The last point of the GMOS data has been estimated\nfrom the r' band observation on that MJD using the r'-i' colors of the previous observation\n(r'-i'=2.2).\n\n\f– 48 –\n\nFig. 11.- Optical GMOS spectrum of V1647 Ori from 2004 October 6. This is a representative spectrum of the 15 acquired between February 2004 and February 2006. In 2004\nOctober, V1647 Ori had a magnitude of r'=18.03 and was in its shallow decline phase. All\nidentifiable absorption and emission lines are marked including the telluric O2 and O2-A\nbands. Note the prevalence of weak permitted and forbidden Fe emission lines. The major\nintrinsic feature is the strong Hα emission line with a blue-shifted absorption component\nforming a P Cygni type profile. Table 4 shows the variation in spectral features over the\nmonitoring period.\n\n\f– 49 –\n\nFig. 12.- Variation in Na D 5890 and 5896 Å absorption profiles over the monitoring period.\nThe continuum has been subtracted in these spectra and they have not been smoothed so\nas to preserve the intrinsic noise structure for comparative purposes. The vertical dashed\nlines show the Na lines rest wavelengths. In 2004 February, the Na lines were barely visible\nbut soon became very pronounced and blue-shifted with respect to the rest wavelength. The\nlines are highly variable in depth and shape until 2005 August (at the beginning of the\nsteep decline phase) when they had faded considerably. For the remainder of the monitoring\nperiod (2005 September to 2007 February) the lines were barely present.\n\n\f– 50 –\n\nFig. 13.- Variation in the shock-excited [S II] 6717 and 6731 Å emission line intensity\nand ratios over the monitoring period. The vertical dashed lines show the [S II] lines rest\nwavelengths. In 2004 February, the [S II] lines were not present. In the spectrum taken on\n2004 March 10 however, they are seen faintly. The intensity and ratio of the lines varies\nfrom then to the end of the monitoring period. Again, the spectra have been continuum\nsubtracted and not smoothed.\n\n\f– 51 –\n\nFig. 14.- Variation in the [O I] 6300Å emission line intensity over the monitoring period.\nThe vertical dashed line shows the [O I] line rest wavelength. The line is not present on 2004\nFebruary 14 but is strong in the spectrum taken on UT 2004 September 9. The spectrum\nfrom 2004 March 10 had considerable noise spikes at the wavelength of [O I] which have been\nremoved by interpolation. The line intensity mostly increases from UT 2004 September 9\nto UT 2005 January 8 when it begins to decline. The spectrum from 2006 January 5 had\nsome noise spikes (which have been removed) but the wings of the [O I] line can still be seen.\nThe line is perhaps just detected in the UT 2007 February spectrum. Again, the spectra\nhave been continuum subtracted and not smoothed. The [O I] emission line is asymmetric in\nshape with an extended blueshifted wing. We note the presence of an unidentified absorption\nfeature at ∼6350 Å.\n\n\f– 52 –\n\nFig. 15.- The [O I] 6300Å emission line profile from the UT 2004 November 13 spectrum.\nThe vertical dot-dashed line shows the [O I] line rest wavelength. The vertical dotted lines\nfrom the bottom axis show the extent of the emission profile which corresponds to –270 to\n+100 km s−1 . The sloping dashed line is the continuum level across the emission feature.\nThe dotted line under [O I] shows an arc spectrum lamp line close in wavelength to [O I].\n\n\f– 53 –\n\nFig. 16.- The Fe lines in the 6400 to 6540 Å region of the spectra. These lines are [Fe II]\nat 6432 Å, Fe II at 6457Å, Fe I at 6495 Å, and Fe II at 6517 Å. The vertical dot-dashed\nlines are at the line rest wavelengths. The lines vary in intensity together, getting stronger\nfrom UT 2004 February 14 (when they are very weak) to UT 2005 January 8. After this,\nthey decline in intensity until UT 2005 November 27 when they are not detected. Again,\nthe spectra have been continuum subtracted and not smoothed.\n\n\f– 54 –\n\nFig. 17.- The [Ca II] lines in the 7200 to 7400 Å region of the spectra. Specifically, at\n7261, 7292, and 7324 Å. The vertical dot-dashed lines are at the line rest wavelengths. At\nthe long-wavelength edge of the plot is an [Fe II] at 7388 Å. Our UT 2004 February 14 and\nUT 2004 March 10 spectra did not cover this region of the spectra, however, from UT 2004\nSeptember 9 to UT 2005 October 13, the [Ca II] lines are visible. After this they are not\npresent. Again, the spectra have been continuum subtracted and not smoothed.\n\n\f– 55 –\n\nFig. 18.- The Hα line profile from the HIRES spectrum of V1647 Ori. At the top is the\nobserved spectrum overlaid with a model Gaussian profile that fits the red wing of the line.\nNote the wings of the profile extend to ±360 km s−1 from the nominal wavelength of Hα\n(dot-dashed line). For comparison, an arc lamp line lying close to the wavelength of Hα has\na full-width half-maximum gaussian profile of 12 km s−1 . Below is the difference between the\nobserved and model profile. There appears to be significant Hα absorption at zero velocity\ntogether with blueshifted absorption extending from –80 to –360 km s−1 . The minimum in\nthe Hα absorption lies at 120 km s−1 .\n\n\f– 56 –\n\nFig. 19.- The HIRES spectrum of V1647 Ori containing the Ca II line at 8662Å. Note\nthe trianglular profile of the line. Also present are two faint Fe I lines which seem to show\na double-peaked nature.\n\n\f– 57 –\n\nFig. 20.- Hα emission line profiles extracted from the optical spectra of V1647 Ori. The\nmonitoring period is 2004 February to 2006 February and the date of observations is shown\nin the top-left corner. To better show the profile structure, the spectra have been scaled to\na minimum and maximum flux of zero and unity, respectively. The Hα equivalent widths,\nand related information are given in Table 4. Of particular note is the prominent P Cygni\nprofile in the earlier spectra. The bottom-right plot is of CuAr arc lines for comparison of\nHα line widths and instrumental profile.\n\n\f– 58 –\n\nFig. 21.- An expanded view of the Hα P Cygni profiles shown in Fig. 20. Here, the x-axis\nis velocity offset in km s−1 from 6562.8 Å. Note the change in emission width, absorption\nwidth and the trend for lower-velocity blue-shifted absorption with increasing time.\n\n\f– 59 –\n\nFig. 22.- A plot of the changes in Hα profile structure vs. time. The units of the x-axes\nof all six panels are modified Julian Date (MJD). The top-left panel shows the V1647 Ori\nr' band photometric light curve. The horizontal dot-dashed line labeled r'P O is the preoutburst SDSS r' brightness. The top-right panel shows the Hα emission equivalent width\n(Wλ ) in Angstroms. The middle-left panel shows the Full Width Zero Intensity (FWZI),\nthe Full Width 2.5% Intensity (FW2.5%), and the scaled (see text for details) FW2.5%\nIntensity of the emission component in km s−1 . The middle-right panel shows the width of\nthe blue-shifted absorption component (∆V) in km s−1 . The bottom-left panel shows the\nvelocity offset (in km s−1 from 6562.8 Å) of the deepest or 'characteristics' absorption (vchar ).\nThe bottom-right panel shows the wavelength of peak emission, termed λpeak , in Angstroms.\nVelocity offsets (in km s−1 from 6562.8 Å) are given inside the y-axis.\n\n\f"}