{"id": "http://arxiv.org/abs/0811.0605v2", "guidislink": true, "updated": "2009-03-16T13:00:13Z", "updated_parsed": [2009, 3, 16, 13, 0, 13, 0, 75, 0], "published": "2008-11-04T20:47:39Z", "published_parsed": [2008, 11, 4, 20, 47, 39, 1, 309, 0], "title": "Evaluation of a permeability-porosity relationship in a low permeability\n  creeping material using a single transient test", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0811.3559%2C0811.4221%2C0811.2592%2C0811.2535%2C0811.1290%2C0811.2516%2C0811.2011%2C0811.0235%2C0811.2379%2C0811.2707%2C0811.0652%2C0811.4614%2C0811.4211%2C0811.0064%2C0811.0272%2C0811.1989%2C0811.1146%2C0811.0303%2C0811.0807%2C0811.1614%2C0811.4724%2C0811.4124%2C0811.3252%2C0811.1609%2C0811.1113%2C0811.2105%2C0811.3805%2C0811.4571%2C0811.1328%2C0811.2180%2C0811.4014%2C0811.1584%2C0811.0605%2C0811.0778%2C0811.3652%2C0811.0621%2C0811.3843%2C0811.4755%2C0811.3413%2C0811.0885%2C0811.4373%2C0811.1815%2C0811.0086%2C0811.4615%2C0811.0463%2C0811.2318%2C0811.1114%2C0811.2647%2C0811.3628%2C0811.4107%2C0811.2836%2C0811.2949%2C0811.1383%2C0811.0814%2C0811.0217%2C0811.2730%2C0811.1315%2C0811.0262%2C0811.1670%2C0811.1720%2C0811.3910%2C0811.1995%2C0811.0897%2C0811.1539%2C0811.1310%2C0811.2644%2C0811.3144%2C0811.0390%2C0811.0211%2C0811.0492%2C0811.2858%2C0811.4385%2C0811.3758%2C0811.3648%2C0811.4303%2C0811.3903%2C0811.2047%2C0811.0155%2C0811.1575%2C0811.1928%2C0811.3811%2C0811.1997%2C0811.3406%2C0811.3739%2C0811.3395%2C0811.4448%2C0811.1515%2C0811.0193%2C0811.2689%2C0811.0169%2C0811.2521%2C0811.1592%2C0811.0324%2C0811.3523%2C0811.4765%2C0811.0347%2C0811.3741%2C0811.1831%2C0811.1853%2C0811.0497%2C0811.1014&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Evaluation of a permeability-porosity relationship in a low permeability\n  creeping material using a single transient test"}, "summary": "A method is presented for the evaluation of the permeability-porosity\nrelationship in a low-permeability porous material using the results of a\nsingle transient test. This method accounts for both elastic and non-elastic\ndeformations of the sample during the test and is applied to a hardened class G\noil well cement paste. An initial hydrostatic undrained loading is applied to\nthe sample. The generated excess pore pressure is then released at one end of\nthe sample while monitoring the pore pressure at the other end and the radial\nstrain in the middle of the sample during the dissipation of the pore pressure.\nThese measurements are back analysed to evaluate the permeability and its\nevolution with porosity change. The effect of creep of the sample during the\ntest on the measured pore pressure and volume change is taken into account in\nthe analysis. This approach permits to calibrate a power law\npermeability-porosity relationship for the tested hardened cement paste. The\nporosity sensitivity exponent of the power-law is evaluated equal to 11 and is\nshown to be mostly independent of the stress level and of the creep strains.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=0811.3559%2C0811.4221%2C0811.2592%2C0811.2535%2C0811.1290%2C0811.2516%2C0811.2011%2C0811.0235%2C0811.2379%2C0811.2707%2C0811.0652%2C0811.4614%2C0811.4211%2C0811.0064%2C0811.0272%2C0811.1989%2C0811.1146%2C0811.0303%2C0811.0807%2C0811.1614%2C0811.4724%2C0811.4124%2C0811.3252%2C0811.1609%2C0811.1113%2C0811.2105%2C0811.3805%2C0811.4571%2C0811.1328%2C0811.2180%2C0811.4014%2C0811.1584%2C0811.0605%2C0811.0778%2C0811.3652%2C0811.0621%2C0811.3843%2C0811.4755%2C0811.3413%2C0811.0885%2C0811.4373%2C0811.1815%2C0811.0086%2C0811.4615%2C0811.0463%2C0811.2318%2C0811.1114%2C0811.2647%2C0811.3628%2C0811.4107%2C0811.2836%2C0811.2949%2C0811.1383%2C0811.0814%2C0811.0217%2C0811.2730%2C0811.1315%2C0811.0262%2C0811.1670%2C0811.1720%2C0811.3910%2C0811.1995%2C0811.0897%2C0811.1539%2C0811.1310%2C0811.2644%2C0811.3144%2C0811.0390%2C0811.0211%2C0811.0492%2C0811.2858%2C0811.4385%2C0811.3758%2C0811.3648%2C0811.4303%2C0811.3903%2C0811.2047%2C0811.0155%2C0811.1575%2C0811.1928%2C0811.3811%2C0811.1997%2C0811.3406%2C0811.3739%2C0811.3395%2C0811.4448%2C0811.1515%2C0811.0193%2C0811.2689%2C0811.0169%2C0811.2521%2C0811.1592%2C0811.0324%2C0811.3523%2C0811.4765%2C0811.0347%2C0811.3741%2C0811.1831%2C0811.1853%2C0811.0497%2C0811.1014&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "A method is presented for the evaluation of the permeability-porosity\nrelationship in a low-permeability porous material using the results of a\nsingle transient test. This method accounts for both elastic and non-elastic\ndeformations of the sample during the test and is applied to a hardened class G\noil well cement paste. An initial hydrostatic undrained loading is applied to\nthe sample. The generated excess pore pressure is then released at one end of\nthe sample while monitoring the pore pressure at the other end and the radial\nstrain in the middle of the sample during the dissipation of the pore pressure.\nThese measurements are back analysed to evaluate the permeability and its\nevolution with porosity change. The effect of creep of the sample during the\ntest on the measured pore pressure and volume change is taken into account in\nthe analysis. This approach permits to calibrate a power law\npermeability-porosity relationship for the tested hardened cement paste. The\nporosity sensitivity exponent of the power-law is evaluated equal to 11 and is\nshown to be mostly independent of the stress level and of the creep strains."}, "authors": ["Siavash Ghabezloo", "Jean Sulem", "Jérémie Saint-Marc"], "author_detail": {"name": "Jérémie Saint-Marc"}, "author": "Jérémie Saint-Marc", "links": [{"title": "doi", "href": "http://dx.doi.org/10.1016/j.ijrmms.2008.10.003", "rel": "related", "type": "text/html"}, {"href": "http://arxiv.org/abs/0811.0605v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/0811.0605v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "physics.geo-ph", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "physics.geo-ph", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/0811.0605v2", "affiliation": "CSTJF", "arxiv_url": "http://arxiv.org/abs/0811.0605v2", "arxiv_comment": null, "journal_reference": "International Journal of Rock Mechanics and Mining Sciences 46, 4\n  (2009) 761-768", "doi": "10.1016/j.ijrmms.2008.10.003", "fulltext": "Ghabezloo et al. (2009) Evaluation of a permeability-porosity relationship ..., Int J Rock Mech Min Sci 46(4), 761-768\n\nEvaluation of a permeability-porosity relationship in a low\npermeability creeping material using a single transient test\n\nSiavash Ghabezloo*(1), Jean Sulem(1), Jérémie Saint-Marc(2)\n(1) Université Paris-Est, UR Navier, CERMES, Ecole Nationale des Ponts et Chaussées, Marne la Vallée,\nFrance\n(2) TOTAL, Management of Residual Gases Project, Pau, France\n\nAbstract\nA method is presented for the evaluation of the permeability-porosity relationship in a lowpermeability porous material using the results of a single transient test. This method accounts for both\nelastic and non-elastic deformations of the sample during the test and is applied to a hardened class G oil\nwell cement paste. An initial hydrostatic undrained loading is applied to the sample. The generated\nexcess pore pressure is then released at one end of the sample while monitoring the pore pressure at the\nother end and the radial strain in the middle of the sample during the dissipation of the pore pressure.\nThese measurements are back analysed to evaluate the permeability and its evolution with porosity\nchange. The effect of creep of the sample during the test on the measured pore pressure and volume\nchange is taken into account in the analysis. This approach permits to calibrate a power law\npermeability-porosity relationship for the tested hardened cement paste. The porosity sensitivity\nexponent of the power-law is evaluated equal to 11 and is shown to be mostly independent of the stress\nlevel and of the creep strains.\nKeywords: permeability, porosity, transient method, creep, hardened cement paste\n\nPlease cite this paper as: Ghabezloo S, Sulem J, Saint-Marc J. (2009) Evaluation of a permeabilityporosity relationship in a low permeability creeping material using a single transient test, International\nJournal of Rock Mechanics and Mining Sciences, 46(4), 761-768.\n\n*\n\nCorresponding Author: Siavash Ghabezloo, CERMES, Ecole Nationale des Ponts et Chaussées, 6-8 avenue Blaise\nPascal, Cité Descartes, 77455 Champs-sur-Marne, Marne la Vallée cedex 2, France,\nEmail: ghabezlo@cermes.enpc.fr\n\n1\n\n\fGhabezloo et al. (2009) Evaluation of a permeability-porosity relationship ..., Int J Rock Mech Min Sci 46(4), 761-768\n\n1 Introduction\nThe evaluation of the permeability in the laboratory is basically an inverse problem. The two most\nwidely used methods for evaluation of the permeability of geomaterials are the steady state method and\nthe transient pulse method. The steady state method consists in applying a constant pressure gradient to\nthe sample and measuring the resulted flow rate. The permeability of the sample is then calculated using\nDarcy's law. This method is particularly appropriate for high permeability materials. The transient pulse\nmethod is based on the evaluation of the decay of a small step change of pressure imposed in one end of\na sample. This method, which was pioneered by Brace et al. [1], is appropriate for low permeability\nmaterials and is used extensively to evaluate the permeability of different geomaterials (e.g. Bernabé\n[2][3] on granite, Escoffier et al. [4] on mudstone). In the original setting of Brace et al. [1], a\ncylindrical sample is connected to two fluid reservoirs with equal pressures. A sudden increase of the\nfluid pressure in the upstream reservoir unbalances the system and causes a fluid flow from this\nreservoir, through the sample to the downstream reservoir in order to equilibrate the pressures in the\nsample and in the reservoirs. The permeability of the sample is then back analysed from the kinetics of\nthe decay of the pressure in the upstream reservoir. Some alternative methods to evaluate the\npermeability of low permeability materials have been recently developed by monitoring the response of\na saturated body to mechanical and thermal strains. Among them, the beam bending method [5][6][7] is\nbased on the fact that bending of a saturated porous beam creates a pressure gradient in the pores, as the\ntop half is in compression and the half bottom is in tension. This pressure gradient causes the fluid flow\nto equilibrate the pressure and consequently the force required to sustain a fixed deflection decreases.\nThe permeability and also the elastic modulus of the body are evaluated by analysing the kinetics of\nforce relaxation. Thermopermeametry is another method that is based on the analysis of thermal\nexpansion kinetics [6][7][8]. The thermal expansion of water is higher than the one of solids, so a rapid\ntemperature increase and then isothermal hold of a saturated porous body causes an initial dilation and\npore fluid pressurization due to the greater expansion of the pore fluid. This initial dilation is then\nfollowed by a contraction of the body caused by the dissipation of the excess pore pressure and the fluid\noutflow. Analysis of the kinetics of thermal dilation yields the permeability of the body. Beam bending\nand thermopermeametry methods were originally developed for gels and later extended to more rigid\nmaterials like cement paste and mortar. Dynamic pressurization [9][10] is another permeability\nevaluation method which is performed on a sample that is enclosed in a vessel full of fluid under a\nconstant pressure. In the initial state, the pressure in the vessel and the sample pore pressure are in\nequilibrium. A sudden increase of the pressure in the vessel causes an initial contraction of the sample.\nThis contraction, when the pressure is kept constant, is followed by a time dependent dilation due to the\nprogressive increase of the sample pore pressure to reach equilibrium with the pressure inside the vessel.\nThe permeability is then evaluated by analysing the kinetics of the dilation of the sample.\nOne can see that these methods used for evaluation of transport properties of low permeability\nmaterials are based on the analysis of the kinetics of diffusion of pore pressure or the strains induced by\npore pressure diffusion. The same principle is used in this work for the evaluation of the permeability of\na hardened cement paste. The test method used here is similar to the one presented by Hart and Wang\n[11] as a single test method for evaluation of poroelastic constants and flow parameters of low\npermeability rocks. These authors used the excess pore pressure generated in a sample due to an\nundrained loading for the evaluation of the permeability. The pressure at one side of the sample is\n\n2\n\n\fGhabezloo et al. (2009) Evaluation of a permeability-porosity relationship ..., Int J Rock Mech Min Sci 46(4), 761-768\n\nconnected to a reservoir with a constant volume and the kinetics of the pore pressure variations at the\nother end of the sample and in the reservoir is analysed for evaluation of the permeability.\nOur experimental study for the evaluation of the permeability of a hardened cement paste is a part of\na larger study on the thermo-poro-mechanical behaviour of this material for petroleum applications.\nIndeed, in oil wells, a cement sheath is placed between the rock and the casing for support and sealing\npurpose. The cement lining is submitted to various thermal and mechanical loadings during the life of\nthe well from the drilling phase to the production phase and finally in the abandonment phase when the\nwell must seal the subsurface from the surface, as for instance for storage and sequestration of\ngreenhouse gas. In due course of these actions, the cement can be damaged and the mechanical and\ntransport properties can be degraded, this degradation being detrimental to its functions. Moreover, the\ndetermination of the permeability of this cement over time is essential for the prediction of the sealing\nperformance of the well when CO2 storage and sequestration is planned. The results of our previous\nexperimental study including drained and undrained hydrostatic compression tests, unjacketed tests and\ndrained and undrained heating tests have been presented in Ghabezloo et al. [12][13].\nBy applying an undrained hydrostatic loading, an excess pore pressure is generated inside the sample,\nrelated to the applied hydrostatic stress by the Skempton coefficient of the material. At the end of the\nhydrostatic loading phase, a constant pore pressure much lower than the existing pore pressure inside the\nsample is applied at one end of the sample. Under this pressure boundary condition, the pore fluid flows\nout of the sample and the pore pressure decreases. The pore pressure change at the other end of the\nsample and the radial strain in the middle of the sample are both measured as functions of time and back\nanalysed to evaluate the permeability. During the test, the pore pressure in the sample varies greatly\nfrom one end to another. This variable pore pressure keeping the confining pressure constant, induces a\nvariable effective stress in the sample and results in a heterogeneous strain field. The stress-dependent\ncharacter of the poroelastic parameters of the hardened cement paste (Ghabezloo et al. [12]) and also the\ncreep of the material during the test add some particular aspects to the back-analysis, which makes this\nproblem different from the classical solutions of transient permeability evaluation tests. The porosity\nchanges due to the increase of the effective stress and also the presence of additional creep deformations\ninduce a decrease of the permeability during the test. The coupled measurement of pore pressure and\ndeformations during the test is back analysed to evaluate the permeability-porosity relationship using the\nresults of a single transient test.\nIt is well-known that there is no unique permeability-porosity relationship that can be applied to all\nporous materials. As mentioned by Bernabé et al. [14], one reason is that the porosity is a scale invariant\nmaterial property; if the material and its pore space could be uniformly expanded or contracted\neverywhere, there would be no change in the porosity, but the permeability would change in this case.\nMoreover, different pores in a given material have different contributions to the permeability of the\nmaterial according to their size and shape. The porosity takes into account only the relative volume of\nthe pores to the total volume, and not the shape and the distribution of the size of the pores. Thus two\nporous materials with the same porosity, but different pore shape and pore-size distributions, must have\ndifferent permeabilities. For a given evolution process that changes both permeability and porosity of a\nporous material, for example elastic or plastic compaction, microcracking or chemical alteration, it is\nusually assumed that there is a power-law relationship k ∝ φ α between these parameters (Bernabé et al.\n[14]). The exponent of this relation may be integer or non-integer, constant or variable, according to the\nproperties of the material and of the evolution process. Based on the experimental data of Bernabé et al\n[15], Walder and Nur [16] postulated a slightly different power-law in which the permeability vanishes\n\n3\n\n\fGhabezloo et al. (2009) Evaluation of a permeability-porosity relationship ..., Int J Rock Mech Min Sci 46(4), 761-768\n\nat a critical non-zero porosity. David et al. [17] presented a compilation of published data on the\npermeability-porosity relationships for different geomaterials. One can see that the reported values of\nexponent α vary between 1.1 and 25.4 for different materials and the higher values correspond in\ngeneral to rocks with a high porosity. However, no clear correlation between α and the petrophysical\nproperties could be found. Experimental study of Zhu and Wong [18] on Berea and Boise sandstones\nresulted in a variable α which increases when pressure increases. Meziani [19] performed an\nexperimental study on the gas permeability of mortar under hydrostatic loading and found a strongly\nnon-linear permeability-porosity relationship. The exponent α is found to be a decreasing function of\nthe loading level, decreasing from 36 to 26 when the confining pressure is increased up to 57 MPa.\nBased on an idea presented by Bernabé et al. [14], the total porosity of the rock can be separated into\ntwo categories of effective and non-effective porosity according to the contribution of the pores in the\nfluid transport. These two quantities are not purely geometrical and depend on the fluid velocity field.\nThese authors propose that the exponent α is related to the ratio of the effective to non-effective\nporosity and its variation during an evolution process so that α is dependent upon the particular\nphysical process of porosity evolution and the pore geometry of the material. Consequently as\nemphasized by Bernabé et al. [14], searching a permeability-porosity relationship is meaningful either\nfor a given rock sample during a porosity evolution process, for example elastic compaction, or for\ndifferent rock samples only if these samples correspond to different stages of the same evolution\nprocess.\n\n2 Poromechanical background\nWe present here the framework used to describe the response of the sample during the performed\ntest. The equations are written for a porous material which is not necessarily homogeneous and isotropic\nat the micro-scale. The theoretical basis of the formulation has been presented in many earlier studies.\nAmong them, one can refer to the milestone papers and textbooks of Biot and Willis [22], Brown and\nKorringa [23], Rice and Cleary [24], Zimmerman [25], Detournay and Cheng [26], Vardoulakis and\nSulem [27], Wang [28], Coussy [29]. This framework is recalled here in a comprehensive manner in\norder to clarify the mathematical and physical significance of the different parameters used in the\nanalysis and also to take into account the effect of non-elastic strains in the evaluation of the\npermeability.\n\n2.1 Poroelastic formulation\nThe porosity φ of a porous material is defined as the ratio of the volume of the porous space Vφ to\ntotal volume V in the actual (deformed) state:\n\nφ=\n\nVφ\nV\n\n(1)\n\nWe consider a saturated sample under an isotropic state of stress σ (positive in compression) and we\ndefine the differential pressure σ d (i.e. Terzaghi effective stress) as the difference between the\nconfining pressure σ and the pore pressure p f .\n\nσd = σ − pf\n\n(2)\n\n4\n\n\fGhabezloo et al. (2009) Evaluation of a permeability-porosity relationship ..., Int J Rock Mech Min Sci 46(4), 761-768\n\nThe variations of the total volume V and of the pore volume Vφ are given in the following\nexpressions as a function of variations of two independent variables, σ d and p f :\n\ndp f\ndV\ndσ\n=− d −\nV\nKd\nKs\n\n(3)\n\ndp f\ndVφ\ndσ\n=− d −\nVφ\nKp\nKφ\nWhere K d , K s , K p and Kφ are four elastic moduli defined below:\n\n1\n1 ⎛ ∂V ⎞\n=− ⎜\n⎟\nKd\nV ⎝ ∂σ d ⎠ p f\n\n,\n\n1\n1 ⎛ ∂Vφ ⎞\n=− ⎜\n⎟\nKp\nVφ ⎝ ∂σ d ⎠ p f\n\n1\n1 ⎛ ∂V\n= − ⎜⎜\nKs\nV ⎝ ∂p f\n\n,\n\n1\n1\n=−\nKφ\nVφ\n\n⎞\n⎟⎟\n⎠σ d\n\n⎛ ∂Vφ\n⎜⎜\n⎝ ∂p f\n\n⎞\n⎟⎟\n⎠σ d\n\n(4)\n\n(5)\n\nEquation (4) corresponds to an isotropic drained compression test in which the pore pressure is kept\nconstant inside the sample. The variations of the total volume of the sample V and of the volume of the\npore space Vφ with the applied confining pressure give respectively the drained bulk modulus K d and\nthe modulus K p . Equation (5) corresponds to the unjacketed compression test, in which equal\nincrements of confining pressure and pore pressure are simultaneously applied to the sample. The\ndifferential pressure σ d in this condition remains constant. The variation of the volume of the sample\nwith respect to the applied pressure gives the unjacketed modulus K s . The variation of the pore volume\nof the sample in this test could in principle be used to evaluate the modulus Kφ . However experimental\nevaluation of this parameter is very difficult as the volume of the fluid exchanged between the sample\nand the pore pressure generator has to be corrected for the effect of fluid compressibility, and also for\nthe effect of the deformations of the pore pressure generator and of the drainage system in order to\naccess to the true variation of the pore volume of the sample. In the case of a porous material which is\nhomogeneous and isotropic at the micro-scale K s = Kφ = K m , where K m is the bulk modulus of the\nsingle solid constituent of the porous material. In the case of a porous material which is composed of\ntwo or more solids and therefore is heterogeneous at the micro-scale, the unjacketed modulus K s is\nsome weighted average of the bulk moduli of solid constituents [30]. The modulus Kφ for such a\nmaterial has a complicated dependence on the material properties. Generally it is not bounded by the\nelastic moduli of the solid components and can even have a negative sign if the bulk moduli of the\nindividual solid components are greatly different one from another [31][32]. From Betti's reciprocal\ntheorem, the following relation holds between the elastic moduli [23][33]:\n1\n1⎛ 1\n1 ⎞\n= ⎜\n−\n⎟\nK p φ ⎝ Kd Ks ⎠\n\n(6)\n\nUsing equation (6), the number of the required parameters to characterize the volumetric poro-elastic\nbehaviour of a porous material is reduced to three, and among them, the experimental evaluation of the\nmodulus Kφ is very difficult. Using the definition of the porosity presented in equation (1), the\nfollowing equation is obtained for the variation of the porosity:\n\ndφ\n\nφ\n\n=\n\ndVφ dV\n−\nVφ\nV\n\n(7)\n\n5\n\n\fGhabezloo et al. (2009) Evaluation of a permeability-porosity relationship ..., Int J Rock Mech Min Sci 46(4), 761-768\n\nReplacing equation (3) and then equation (6) in equation (7), the expression of the variation of\nporosity is found:\n\n⎛ 1\n1 ⎛1−φ 1 ⎞\n1 ⎞\n=− ⎜\n−\n−\n⎟⎟ dp f\n⎟ dσ d + ⎜⎜\nφ\nφ ⎝ Kd Ks ⎠\n⎝ K s Kφ ⎠\n\ndφ\n\n(8)\n\nAs shown by Hart and Wang [34], for the case of the axisymmetric triaxial test, the transient pore\npressure can be approximated by the solution obtained for the one-dimensional diffusive flow except at\nearly times for which the fully coupled poroelastic response includes also radial flow. Thus, for the\nanalysis of the test results, the one-dimensional solution is used in the following.\nConsider now an elementary volume with the z axis parallel to flow direction, q the fluid mass flux\nper surface area S (orthogonal to z ) and M f the total fluid mass inside the volume. Fluid mass\nconservation implies that:\n1 dM f ∂q\n+ =0\n∂z\nV dt\n\n(9)\n\nLet's define m f as the fluid mass per unit volume of the porous material, m f = M f V = ρ f φ . The\nvariations of m f is written as:\n\ndm f 1 dM f M f dV V\n=\n−\ndt\nV dt\nV\ndt\n\n(10)\n\nReplacing equation (10) in equation (9) we obtain:\n\ndm f\ndV V ∂q\n+ mf\n+ =0\n∂z\ndt\ndt\n\n(11)\n\nKnowing that m f = ρ f φ we can write dm f = φ d ρ f + ρ f dφ . Replacing d ρ f = ρ f dp f K f\n\nand\n\nequation (7) in this relation we obtain:\n\ndm f = φρ f\n\ndp f\n+ φρ f\nKf\n\n⎛ dVφ dV ⎞\n−\n⎜⎜\n⎟\nV ⎟⎠\n⎝ Vφ\n\n(12)\n\nInserting equation (12) and m f = ρ f φ in equation (11) the following expression is obtained:\n\n⎛ 1 dp f dVφ Vφ\n+\ndt\n⎝ K f dt\n\nφρ f ⎜⎜\n\n⎞ ∂q\n⎟⎟ + = 0\n⎠ ∂z\n\n(13)\n\nReplacing equation (3) and then equation (6) in equation (13) the following relation is found for the\ncase of dσ = 0 :\n\n⎡ ⎛ 1\n\n1 ⎞ ⎛ 1\n\n1 ⎞ ⎤ dp\n\n∂q\n\nf\nρ f ⎢φ ⎜⎜\n−\n−\n+ =0\n⎟⎟ + ⎜\n⎟⎥\n∂z\n⎢⎣ ⎝ K f Kφ ⎠ ⎝ K d K s ⎠ ⎥⎦ dt\n\n(14)\n\nThe fluid mass flux q in equation (14) is given by Darcy's law:\n\nq = −k\n\nρ f ∂p f\nμ f ∂z\n\n(15)\n\nwhere k is the permeability and μ f is the fluid viscosity. Replacing equation (15) in equation (14)\nthe following expression is obtained:\n\n6\n\n\fGhabezloo et al. (2009) Evaluation of a permeability-porosity relationship ..., Int J Rock Mech Min Sci 46(4), 761-768\n\ndp f β u ∂ ⎛ ρ f ∂p f ⎞\n=\n⎜k\n⎟\ndt\nρ f ∂z ⎜⎝ μ f ∂z ⎟⎠\n\n(16)\n\nwhere:\n\nβu =\n\n1\nφ (1 K f − 1 Kφ ) + (1 K d − 1 K s )\n\n(17)\n\n2.2 Effect of non-elastic strains\nThe above framework can be extended to account for the effect of non-elastic strains which can be\nproduced during the test. These strains can be plastic, viscoelastic or viscoplastic and induce non-elastic\nporosity changes. The non-elastic changes of the total volume, pore volume and solid volume are\ndefined by:\ndV ne = dV − dV e ; dVφne = dVφ − dVφe ; dVsne = dVs − dVse\n\n(18)\n\nThe non-elastic increment of pore volume dVφne can be calculated from the definition of the porosity\n(equation (1)) and knowing that Vφ = V − Vs .\ndVφne = dVφ − dVφe = V ⎡⎣ − d ε ne + (1 − φ )d ε sne ⎤⎦\n\n(19)\n\ndVφne −1\n= ⎡⎣ d ε ne − (1 − φ )d ε sne ⎤⎦\nVφ\nφ\n\n(20)\n\nFrom (19) we obtain:\n\nUsing equation (20), equation (3) is re-written with the additional contribution of the non-elastic\nvolume changes:\n−\n\ndV dσ d dp f\n=\n+\n+ d ε ne\nV\nKd\nKs\n\n(21)\n\ndVφ dσ d dp f d ε ne 1 − φ ne\ndε s\n−\n=\n+\n+\n−\nVφ\nKp\nKφ\nφ\nφ\n\nUsing equations (7) and (21) the following relation is obtained for the variations of the porosity:\n⎛ 1\n1 ⎛1−φ 1 ⎞\n1 ⎞\n1−φ\nd ε ne − d ε sne )\n=− ⎜\n−\n−\n(\n⎟⎟ dp f −\n⎟ dσ d + ⎜⎜\nφ\nφ ⎝ Kd Ks ⎠\nφ\n⎝ K s Kφ ⎠\n\ndφ\n\n(22)\n\nReplacing equation (21) and then equation (6) in equation (13) the following relation is found for the\ncase of dσ = 0 :\n\nρf\n\nd ε ne − (1 − φ ) d ε sne ∂q\ndp f ⎡ ⎛ 1\n1 ⎞ ⎛ 1\n1 ⎞⎤\nρ\n−\n−\n−\n+ =0\n⎢φ ⎜⎜\n⎥\n⎟⎟ + ⎜\nf\n⎟\ndt ⎣⎢ ⎝ K f Kφ ⎠ ⎝ K d K s ⎠ ⎦⎥\ndt\n∂z\n\n(23)\n\nReplacing equations (15) and (17) in equation (23) the following expression is found:\nd ε ne − (1 − φ ) d ε sne β u ∂ ⎛ ρ f ∂p f\ndp f\n− βu\n=\n⎜k\ndt\ndt\nρ f ∂z ⎜⎝ μ f ∂z\n\n⎞\n⎟⎟\n⎠\n\n(24)\n\n7\n\n\fGhabezloo et al. (2009) Evaluation of a permeability-porosity relationship ..., Int J Rock Mech Min Sci 46(4), 761-768\n\nIf the non-elastic strains of the solid phase are neglected with respect to the total non-elastic strains,\nwhich is a common assumption for most geomaterials, equation (24) can be simplified in the following\nform:\ndp f\nd ε ne β u ∂ ⎛ ρ f ∂p f ⎞\n− βu\n=\n⎜k\n⎟\ndt\ndt\nρ f ∂z ⎜⎝ μ f ∂z ⎟⎠\n\n(25)\n\n3 Experimental program\nA class G oil well cement is used to prepare the cement paste with a water to cement ratio\nw c = 0.44 . The fresh paste is conserved in 14cm cubic moulds for four days in lime saturated water at\n\n90°C temperature. This temperature is chosen in order to reproduce the curing conditions of a cement\nlining installed in a deep oil well. After four days the temperature is gradually reduced in order to\nprevent any cracking of the blocs due to a sudden temperature change. Then, the blocs are cored and cut\nto obtain cylindrical samples with 38 mm diameter and 76 mm length. The two ends of the cylindrical\nsamples are rectified to obtain planar surfaces perpendicular to the axis. After the sample preparation\nphase, the samples are cured for at least three months in a bath containing a chemically neutral solution\ntowards the cement paste under a controlled temperature of 90°C. Before performing a test, the\ntemperature of the sample is reduced slowly to prevent any thermal cracking. The porosity of the studied\ncement paste was evaluated by mercury intrusion porosimetry to be equal to φ = 0.26 . More details\nabout the preparation of the samples can be found in Ghabezloo et al. [12].\nThe triaxial cell used in this study can sustain a confining pressure up to 60 MPa. It contains a system\nof hydraulic self-compensated piston. The loading piston is then equilibrated during the confining\npressure build up and directly applies the deviatoric stress. The axial and radial strains are measured\ndirectly on the sample inside the cell with two axial transducers and four radial ones of LVDT type. The\nconfining pressure is applied by a servo controlled high pressure generator. Hydraulic oil is used as\nconfining fluid. The pore pressure is applied by another servo-controlled pressure generator with\npossible control of pore volume or pore pressure. More details on this triaxial equipment are found in\nSulem and Ouffroukh [20] and in Ghabezloo and Sulem [21].\nAfter the curing period the samples which are stored in a fluid at 90°C can be considered as\ncompletely saturated. The process of installing the sample inside triaxial cell may cause a partial desaturation of the sample. For this reason a seven days re-saturation phase is performed inside the triaxial\ncell. During this period, the sample is maintained under a confining pressure equal to 1.2MPa and a back\nfluid pressure equal to 1.0MPa is applied to the sample while the volume of the fluid injected in the\nsample is monitored.\nAs explained earlier, the present permeability test is performed after an undrained hydrostatic\ncompression test and uses the induced excess pore pressure inside the sample for the evaluation of the\npermeability. One can see several advantages in this method. First it gives access to the permeability of\nthe sample under different states of stress (including high levels of stress and pore pressure) with a\nsingle test and gives thus an estimate of the porosity permeability relationship. Moreover, in creeping\nmaterials with low permeability, the standard tests cannot give accurate information on the short-term\nbehaviour but only allows an estimation of the long-term permeability. An other marginal advantage is\nthat one high capacity pressure generator for the application of the confining pressure and a low capacity\none for the saturation process and the application of the pore pressure at one end of the sample are\nneeded, while, in a conventional permeability test two additional high capacity pressure generators are\n\n8\n\n\fGhabezloo et al. (2009) Evaluation of a permeability-porosity relationship ..., Int J Rock Mech Min Sci 46(4), 761-768\n\nneeded for application and control of the pore pressure at the ends of the sample. The undrained loading\nis performed using a loading rate equal to 0.1MPa/min. This loading rate is slow enough to ensure the\nhomogeneity of the generated pore pressure inside the sample. After the undrained loading phase, the\npore pressure at one end of the sample is reduced instantaneously to a low value (1.0MPa) which causes\na fluid flow out of the sample. The other end the drainage system is closed and the pore pressure is\nmonitored using a pore pressure transducer. The volume of the drainage and pressure measurement\nsystem at the closed side of the sample influences the measurement of the pore pressure. In our triaxial\ncell the total volume of the drainage system for an undrained loading is equal to 2300mm3 which is a\nrelatively small volume. 400mm3 of this volume is connected to the lower side of the sample and the\nremaining 1900mm3 is connected to the upper side. In order to minimize the effect of the dead volume\nof the drainage system, the fluid flow is established at the upper side which has a greater dead volume\nand the pressure measurement is performed at the lower side which has a smaller dead volume.\nComparing this small dead volume (400mm3) to the volume of the pore space of the sample\n(22410mm3), one can see that the correction of the pore pressure measurement as derived in Ghabezloo\nand Sulem [21] can be neglected.\nThe instantaneous reduction of the pore pressure at the upper end of the sample causes a high\npressure gradient and a flow of the pore fluid out of the sample. The gradual decrease of the pore\npressure inside the sample, while the confining pressure is kept constant, increases the effective stress in\na non-uniform manner along the height of the sample which results in non-uniform deformations.\nDepending on the nature of the tested material and on the magnitude of effective stress change, these\ndeformations may include a non-elastic part. Non-elastic strains have a significant effect on the response\nof the sample and should be taken into account in the analysis of the test results. During the test, the\nradial deformations are measured using four LVDT transducers in the middle of the sample. These\nmeasured deformations along with the pore pressure measurements are used in the back analysis of the\npermeability as shown in the next section.\nThree permeability tests (A, B and C) were performed. The test results are presented on Figure (1)\nwhere the pore pressure measured at the lower end of the sample and the radial strain measured in the\nmiddle of the sample are plotted as functions of time. The three tests correspond to different confining\npressures and different initial pore pressure inside the sample. Tests B and C have been performed on\nthe same sample. At the end of the test B the sample is unloaded in drained condition and then reloaded\nin undrained condition up to 50MPa, then test C is performed. One can see in Figure (1) that for all the\ntests the rate of pore pressure decrease reduces significantly after about 7 hours. One can also observe\nthat despite the small change of effective stress after 7 hours, the measured strains continue to increase\nsignificantly. This phenomenon may be attributed to the creep of the hardened cement paste under the\napplied effective stress.\n\n4 Analysis of the results\nThe results obtained in the performed test are back analysed to evaluate the permeability of the\nsample and its changes during the test. The analysis is performed using equation (25) which takes into\naccount the effect of non-elastic strains produced during the test. As one can see in this equation, the\nporoelastic properties of the tested material must be known to evaluate the βu parameter (equation (17)\n). The results of a previous experimental study on the poromechanical behaviour of the considered\nhardened cement paste are presented in Ghabezloo et al. [12]. The unjacketed modulus K s was\nevaluated equal to 21GPa. Several drained hydrostatic compression tests revealed the stress dependency\n\n9\n\n\fGhabezloo et al. (2009) Evaluation of a permeability-porosity relationship ..., Int J Rock Mech Min Sci 46(4), 761-768\n\nof the drained bulk modulus K d of the hardened cement paste. The test results showed the degradation\nof the elastic bulk modulus with the effective stress increase:\nK d = 8.69 − 0.087σ d\n\n( K d : GPa ,σ d : MPa )\n\n(26)\n\nThe microscopic observation of the samples after the drained tests showed that this damage\nphenomenon is caused by the micro-cracking of the hardened cement paste, even under hydrostatic\nloading, which can be attributed to the heterogeneity of the microstructure of this material. The\nparameter Kφ , as explained above, is very difficult to evaluate and is commonly taken equal to the\nunjacketed modulus K s . It can be shown that the deviation of this parameter from the unjacketed\nmodulus K s does not have a great influence on the poromechanical formulations (Zimmerman et al.,\n[33]). The physical parameters of pore fluid, ρ f , μ f and K f are taken equal to the ones of pure water\nand their variations with pore pressure are taken into account (Spang [35]).\n\nFigure 1- Results of the permeability tests: Evolution of the pore pressure measured at the lower end of\nthe sample and of the radial strain measured at the middle of the sample during the test.\n\nThe elastic strains due to the variations of the pore pressure can be calculated easily using equation\n(3). The LVDTs measurements give the radial deformations in the middle of the sample. The measured\nradial strains are decomposed into an elastic and a non-elastic part. Due to the non-uniformity of the\npore pressure, different points of the sample undergo different deformation. In order to estimate these\nstrains in all points of the sample a constitutive law must be assumed for the non-elastic part of the\nstrains. The parameters of this model are calibrated from the strains measured in the middle of the\nsample. Here we assume that the non-elastic part of the strains is of viscoelastic type and we choose a\nsimple model, composed of a system of parallel spring and dashpot. We also assume that the creep rate\nis controlled by Terzaghi effective stress (i.e. differential pressure σ d ).\nd ε ne\n= a ( bσ d − ε ne )\ndt\n\nIn equation (27), a and b are two model parameters;\n\n(27)\n\n( ab )\n\n−1\n\nis the viscosity and b is the\n\ncompressibility of the underlying dashpot and spring model. It should be noted at this point that, as the\ntested samples have experienced different loading paths before the permeability tests, their creep\nbehaviour may be different so that a and b should be calibrated for each test.\n\n10\n\n\fGhabezloo et al. (2009) Evaluation of a permeability-porosity relationship ..., Int J Rock Mech Min Sci 46(4), 761-768\n\nThe variations of the stress state and also the deformations of the sample during the test can modify\nits permeability. In order to evaluate and take into account the variation of the permeability during the\ntest, we can assume that the permeability varies either with the stress state or with the porosity changes.\nAssuming that the permeability is controlled by the stress state is appropriate if the deformation process\nis elastic. In that case, an appropriate effective stress law for the variation of the permeability has to be\nestablished, as explained in Ghabezloo et al. [36]. On the other hand, for a material which exhibits timedependent deformation, such an assumption is not appropriate as for example, the permeability changes\nduring a creep test due to the deformation process whereas the stress state remains constant. Thus, for\ncomplex deformation process, empirical permeability-porosity laws are commonly used. We choose\nα\nhere a power law k k0 = (φ φ0 ) , so that we can write:\n\ndk\ndφ\n=α\nφ\nk\n\n(28)\n\nAs mentioned before, the coefficient α may be constant or variable, integer or non-integer,\naccording to the properties of the material and of the evolution process. For the sake of simplicity, in the\nback analysis of the results a constant integer coefficient is assumed. The exponent α and the initial\npermeability k0 are evaluated in the back analysis of the experimental results. Before the beginning of\nthe permeability evaluation test, the permeability of the sample is first modified by the applied\nundrained loading. The undrained test performed on this sample with three unloading-reloading cycles at\ndifferent levels of confining pressure, as presented in Ghabezloo et al. [12], does not show any\nirreversible strains in unloading. Consequently the variations of the sample porosity caused by the\napplied undrained loading can be easily evaluated using equation (8) by knowing the final values of\nconfining pressure and pore pressure. The initial porosity is equal to φ0 = 0.26 and the drained bulk\nmodulus K d is calculated using equation (26) for the average effective stress during the undrained\nloading. Using these parameters, the porosity change and the resulting permeability change caused by\nthe initial undrained loading can be evaluated (equation (28)).\nThe back analysis of the test results using equation (25) is performed using a finite difference\nnumerical scheme. The first analysis is performed on test A. The parameters a and b , the exponent α\nand the initial permeability k0 are evaluated using the least square method. The error between the\ncomputed results and the measured data is calculated as the sum of errors corresponding to the pore\npressure and the radial strain. For each iteration, the parameters are changed manually and the sum of\nsquare of the difference between the measured and the calculated values is calculated on a set of points.\nThe best fitting parameters are then evaluated by minimizing the calculated error. For the test A the\nfollowing parameters are found: a = 2 × 10−5 s -1 , b = 3.2 × 10−4 MPa -1 , α = 11 and k0 = 1.07 × 10−19 m 2 .\nThe results of the numerical simulation together with the experimental data are presented in Figure (2).\nOne can see that the measured radial strains are well reproduced in the simulation using the assumed\nviscoelastic model and the calibrated parameters. The measured pore pressure at the lower end of the\nsample is also well reproduced by the model.\nThe variation of calculated permeability at the centre of the sample during the test is presented in\nFigure (3). One can see an initial permeability reduction from 1.07 × 10−19 m 2 to 1.03 × 10−19 m 2 under the\neffect of the initial undrained loading followed by a progressive reduction to 6.34 × 10−20 m 2 at the end\nof the test. We observe that the undrained loading phase does not modify much the permeability of the\nsample. By doing this analysis we obtain a permeability porosity relationship for the tested sample using\nthe results of a single transient test under the following form:\n\n11\n\n\fGhabezloo et al. (2009) Evaluation of a permeability-porosity relationship ..., Int J Rock Mech Min Sci 46(4), 761-768\n11\n\n⎛ φ ⎞\nk = 1.07 × 10−19 ⎜\n⎟\n⎝ 0.26 ⎠\n\n(29)\n\nFigure 2- Test A: Test results and numerical simulation.\n\nFigure 3- Test A: Evolution of the calculated permeability at the centre of the sample.\n\nThe above computation takes into account both the effect of non-elastic deformation and the effect of\npermeability change with porosity. In order to investigate separately these two effects, two additional\nsimulations are performed. In the first one, the analysis is performed by neglecting the effect of nonelastic strains during the test and by considering a constant permeability (case 1). In the second one, the\neffect of non-elastic strains is taken into account, keeping a constant permeability (case 2). For each case\nthe required parameters are evaluated using the least square algorithm. The results are presented on the\nFigure (4) and compared with the results of the complete model (case 3). For case 1, significant\ndifferences between the experimental results and the computed ones are observed. Especially the\nimportant difference between the measured and the calculated radial strain shows that it is essential to\ntake into account the effect of non-elastic strains in the analysis of the test results. The results of case 2\nshow that an acceptable response can be obtained by considering the effect of non-elastic strains even\nwith a constant permeability. Case 3 is identical to the analysis presented on Figure (2) and results in an\neven better compatibility with the experimental results in particular for the permeability curve in the last\npart of the test. For case 2, a constant permeability is evaluated equal to 8.30 × 10−20 m 2 and can be seen\n\n12\n\n\fGhabezloo et al. (2009) Evaluation of a permeability-porosity relationship ..., Int J Rock Mech Min Sci 46(4), 761-768\n\nas an average permeability of the deforming sample during the test. The relatively small difference\nbetween the results of case 2 and case 3 is due to the small reduction of the porosity and consequently of\nthe permeability of the sample during the test (Figure (3)).\nTwo main physical mechanisms occur in the course of the loading process, micro-cracking as\nmentioned above and compaction. The reduction of the permeability during the test shows that the\ncompaction process is dominant and that the net result of these two mechanisms is a reduction of the\npermeability. Moreover, one can infer that the induced micro-cracks remain closed under stress and do\nnot influence the permeability significantly.\n\nFigure 4- Test A: Effect of non-elastic strains and porosity dependent permeability: Case 1: Elastic\nsolution, constant permeability; Case 2: Non-elastic solution, constant permeability; Case 3: Non-elastic\nsolution, porosity dependent permeability.\n\nFor the analysis of the results of the tests B and C we assume that the coefficient α is only a function\nof the compaction process and consequently is the same for all tests, equal to 11. For each of the tests B\nand C, the coefficients a and b of equation (27) and the initial permeability k0 are evaluated to find the\nbest accordance between the simulation and the test results. For test B the following parameters are\nfound: a = 4.1 × 10−5 s -1 , b = 1.3 × 10−4 MPa -1 and k0 = 1.20 × 10−19 m 2 . For this sample we thus obtain the\nfollowing permeability law:\n11\n\n⎛ φ ⎞\nk = 1.20 × 10−19 ⎜\n⎟\n⎝ 0.26 ⎠\n\n(30)\n\nAt the end of this test, the permeability of the node at the centre of the sample is 1.02 × 10−19 m 2 . As\nmentioned above, this sample is then unloaded in drained condition and test C is performed on the same\nspecimen. For test C the evaluated parameters are: a = 2.4 × 10−5 s -1 , b = 1.8 × 10−4 MPa -1 and\nk0 = 9.40 × 10−20 m 2 . As expected, the initial permeability of the sample calculated for test C is very close\n\nto the final permeability of the sample in test B which gives confidence in the approach. The results are\npresented in Figures (5) and (6) where a good compatibility between the simulation and the test results\ncan be observed. In Figure (6) a small pore pressure increase can be observed in the beginning of the test\nC in the results of the numerical simulation. Due to the high value of the initial effective stress in this\ntest (32.4MPa) and also the low permeability of the sample, in the beginning of the test the effect of the\ncreep deformations is more important than the effect of the pore pressure diffusion. This explains the\nsmall initial pore pressure increase obtained in the simulation.\n\n13\n\n\fGhabezloo et al. (2009) Evaluation of a permeability-porosity relationship ..., Int J Rock Mech Min Sci 46(4), 761-768\n\nFigure 5- Test B: Test results and numerical simulation.\n\nThe evaluated value of the porosity sensitivity exponent α , equal to 11, is a relatively high value\ncomparing with the range of variations of α for other geomaterials. Such a high value of α is usually\nattributed to a pore structure containing relatively large, pressure-insensitive nodal pores connected to\neach other by narrow pressure-sensitive throats (Bernabé et al. [14]) or to a pore structure in which\npocket-like pores contribute much to the porosity and little to the permeability (David et al. [17]). This\nlatter description seems to be mostly appropriate for the case of a permeability-porosity relationship\nwhich is established for different samples of a porous material with different porosities. Based on the\nidea of Bernabé et al. [14], a high value of α means that as a result of the compaction process, the\nreduction of the effective porosity is more important than the reduction of the non-effective porosity, or\nthat some part of the effective porosity is transformed into non-effective porosity. We have shown that\nfor two samples of a given material, the permeability evolves with the porosity with the same value of\nα , mostly independently of the level of effective stress or creep deformations in the three performed\ntests. This shows that in the absence of a difference between the pore shape and geometry of the\nsamples, the permeability variation is controlled by the process of porosity evolution, which is the same\nin the different tests. This result is in accordance with the idea of Bernabé et al. [14], as explained here\nabove.\nThe obtained permeability-porosity relationship with an exponent α equal to 11 should not be seen\nas a general permeability-porosity law for cement paste but specific to the cement used in this study and\nto the specific hydrostatic compaction process. This relation could in principle be combined with other\nempirical relationships found in the literature which describe the evolution of the permeability of the\ncement paste with other parameters such as w c (water to cement ratio), the pore size distribution etc...\nFor example Breysse and Gérard [37] performed a statistical analysis on the values of permeability of\ndifferent cement pastes prepared with different w c ratios as reported in the literature and found a\npower law for the relationship between the permeability and w c . Higher values of w c result in a\ncement paste with a higher initial porosity and thus a higher initial permeability. Breysse and Gerard\nrelationship can be used to evaluate the initial permeability to be put in our permeability evolution law.\nOn the other hand empirical relationships can be found in the literature to estimate the initial porosity as\na function of w c (Taylor [38]).\n\n14\n\n\fGhabezloo et al. (2009) Evaluation of a permeability-porosity relationship ..., Int J Rock Mech Min Sci 46(4), 761-768\n\nFigure 6- Test C: Test results and numerical simulation.\n\n5 Conclusions\nThe permeability-porosity relationship for a hardened class G oil well cement paste is evaluated\nexperimentally using a single transient test. The excess pore pressure generated in the sample after an\nundrained hydrostatic compression test is used for the evaluation of the permeability. This pressure is\nreleased at one end of the sample and the variations of the pore pressure at the other end and also the\nradial deformations in the middle of the sample are measured during the dissipation of the pore pressure.\nThe major advantage of the proposed method as compared to the classical steady state or transient\npermeability measurement methods, which are performed at a given level of stress, is that one can\ndirectly access to the permeability-porosity relationship in a single test. The test results are back\nanalysed to evaluate a power-law permeability-porosity relationship. The creep of the sample during the\ntest and its effect on the measured pore pressure and deformations are introduced in the formulation and\nare taken into account in the back analysis of the results. For a non creeping material, the same type of\nanalysis can be used to assess a permeability-effective stress relationship. The exponent of the powerlaw is evaluated equal to 11 in one of the tests and is shown to be the same for the other tests with\ndifferent initial stress and pore pressure levels. Consequently we can conclude that this coefficient is\nmostly dependent upon the compaction process which modifies the porosity of the material in\naccordance with the idea presented by Bernabé et al. [14].\nIt should be emphasized that the obtained power-law relationship describes the variations of the\npermeability of a given hardened cement paste with a given initial porosity submitted to a hydrostatic\nloading. In order to extrapolate this law to other cement pastes, prepared with different w / c ratio, one\ncan use empirical relationships existing in the literature which relate the initial permeability and the\ninitial porosity to this parameter.\n\n6 Acknowledgments\nThe authors gratefully acknowledge TOTAL for supporting this research. They wish also to thank\nYves Bernabé and Ahmad Pouya for fruitful comments and discussions and François Martineau for his\nassistance in the experimental work.\n\n15\n\n\fGhabezloo et al. (2009) Evaluation of a permeability-porosity relationship ..., Int J Rock Mech Min Sci 46(4), 761-768\n\n7 References\n[1]\n[2]\n[3]\n\n[4]\n[5]\n[6]\n[7]\n[8]\n\n[9]\n[10]\n\n[11]\n\n[12]\n\n[13]\n[14]\n[15]\n[16]\n[17]\n\n[18]\n[19]\n\n[20]\n[21]\n\nBrace W, Walsh J, Frangos W. Permeability of Granite under High Pressure. Journal of\nGeophysical Research 1968;73(6):2225-2236.\nBernabé Y. The effective pressure law for permeability in Chelmsford granite and Barre\ngranite. Int J Rock Mech Min Sci & Geomech Abstr 1986;23(3):267-275.\nBernabé Y. The effective pressure law for permeability during pore pressure and confining\npressure cycling of several crystalline rocks, Journal of Geophysical Research\n1987;92(B1):649-657.\nEscoffier S, Homand F, Giraud A, Hoteit N, Kun Su. Under stress permeability determination\nof the Meuse/Haute-Marne mudstone. Engineering Geology 2005;81(3):329-340.\nScherer, GW. Bending of gel beams: method of characterizing mechanical properties and\npermeability, J. Non-Cryst. Solids 1992;142(1-2):18-35.\nScherer GW. Characterization of saturated porous bodies. Concr Sci Eng 2004;37(265):2130.\nScherer GW, Valenza II JJ, Simmons G, New methods to measure liquid permeability in\nporous materials. Cement and concrete research 2006;37:386-397.\nAi H, Young JF, Scherer GW. Thermal expansion kinetics: method to measure permeability\nof cementitious materials: II, application to hardened cement paste. J Am Ceram Soc\n2004;84(2):385–391, Erratum, J. Am. Ceram. Soc. 87(8):1611.\nScherer GW. Dynamic pressurization method for measuring permeability and modulus: I.\nTheory. Materials & Structures 2006;39:1041-1057.\nGrasley ZC, Valenza II JJ, Scherer GW, Lange DA, Dynamic pressurization method for\nmeasuring permeability and modulus: II. cementitious materials. Materials & Structures\n2007;40:711-721.\nHart DJ, Wang HF. A single test method for determination of poroelastic constants and flow\nparameters in rocks with low hydraulic conductivities, Int J Rock Mech Min Sci\n2001;38:577-583.\nGhabezloo S, Sulem J, Guedon S, Martineau F, Saint-Marc J. Poromechanical behaviour of\nhardened cement paste under isotropic loading. Cement and Concrete Research 2008;38(12):\n1424-1437.\nGhabezloo S, Sulem J, Saint-Marc J. The effect of undrained heating on a hardened cement\npaste. Cement and Concrete Research 2009;39(1):54-64.\nBernabé Y, Mok U, Evans B. Permeability-porosity Relationships in Rocks Subjected to\nVarious Evolution Processes. Pure and Applied Geophysics 2003;160:937-960.\nBernabé Y, Brace WF, Evans B. Permeability, porosity and pore geometry of hot-pressed\ncalcite. Mechanics of Materials 1982;1:173-183.\nWalder J, Nur A. Porosity reduction and crustal pore pressure development. Journal of\nGeophysical Research 1984;89:11539-11548.\nDavid C, Wong T-F, Zhu W, Zhang J. Laboratory measurement of compaction-induced\npermeability change in porous rocks: Implications for the generation and maintenance of pore\npressure excess in the crust. Pure and Applied Geophysics 1994;143(1-3):425-456.\nZhu W, Wong T-f. The transition from brittle faulting to cataclastic flow: Permeability\nevolution, Journal of Geophysical Research 1997;102(B2): 3027-3041.\nMeziani H. Gas permeability measurements of cement-based materials under hydrostatic test\nconditions using a low-transient method. Magazine of Concrete Research 2006;58(8):489503.\nSulem J, Ouffroukh H. Hydromechanical Behaviour of Fontainebleau Sandstone. Rock\nMechanics and Rock Engineering 2006;39(3):185-213.\nGhabezloo S, Sulem J. Stress dependent thermal pressurization of a fluid-saturated rock.\nRock Mechanics and Rock Engineering 2009;42(1):1-24.\n\n16\n\n\fGhabezloo et al. (2009) Evaluation of a permeability-porosity relationship ..., Int J Rock Mech Min Sci 46(4), 761-768\n\n[22] Biot MA, Willis DG. The elastic coefficients of the theory of consolidation. Journal of\nApplied Mechanics 1957;24:594-601.\n[23] Brown RJS, Korringa J. On the dependence of the elastic properties of a porous rock on the\ncompressibility of the pore fluid. Geophysics 1975;40:608-616.\n[24] Rice JR, Cleary MP. Some basic stress diffusion solutions for fluid-saturated elastic porous\nmedia with compressible constituents. Review of geophysics and space physics\n1976;14(2):227-240.\n[25] Zimmerman RW. Compressibility of sandstones. Amsterdam: Elsevier, 1991.\n[26] Detournay E, Cheng AH-D. Fundamentals of Poroelasticity, In: Comprehensive Rock\nEngineering: Principles, Practice and Projects, Vol. II, Analysis and Design Method, C.\nFairhurst ed.: Pergamon, 1993, pp 113-171.\n[27] Vardoulakis I, Sulem J. Bifurcation Analysis in Geomechanics. Blackie Academic and\nProfessional, 1995.\n[28] Wang HF. Theory of Linear Poroelasticity with Applications to Geomechanics and\nHydrogeology, Princeton University Press, 2000.\n[29] Coussy O. Poromechanics. John Wiley and Sons, 2004.\n[30] J.G. Berryman, Effective stress for transport properties of inhomogeneous porous rock,\nJournal of Geophysical Research 1992;97:17409-17424.\n[31] P.A. Berge, J. G. Berryman, Realizability of Negative Pore Compressibility in Poroelastic\nComposites, Journal of Applied Mechanics 1995;62(4):1053-1062.\n[32] P.A. Berge, Pore Compressiblity in Rocks, Biot Conference on Poromechanics, Louvain-laNeuve, Belgium, September 14-16, 1998.\n[33] Zimmerman RW, Somerton WH, King MS. Compressibility of porous rocks. Journal of\nGeophysical Research 1986;91(B12):12765-12777.\n[34] Hart DJ, Wang HF. Poroelastic effects during a laboratory transient pore pressure test, In:\nPoromechanics, Thimus JF, Abousleiman Y, Cheng AHD, Coussy O, and Detournay E. ed.:,\nBalkema, Rotterdam, 1998, pp 579-582.\n[35] Spang B. Excel Add-In for Properties of Water and Steam in SI-Units.\nhttp://www.cheresources.com/iapwsif97.shtml, 2002.\n[36] Ghabezloo S, Sulem J, Guedon S, Martineau F. Effective stress law for the permeability of a\nlimestone. Int J Rock Mech Min Sci 2009;46(2):297-306.\n[37] Breysse D, Gérard B. Modelling of permeability in cement-based materials: Part 1Uncracked medium. Cement and Concrete Research 1997;27(5):761-775.\n[38] Taylor HFW. Cement chemistry, London: Thomas Telford, 1997\n\n17\n\n\f"}