{"id": "http://arxiv.org/abs/1202.3217v2", "guidislink": true, "updated": "2012-05-03T00:50:51Z", "updated_parsed": [2012, 5, 3, 0, 50, 51, 3, 124, 0], "published": "2012-02-15T06:45:53Z", "published_parsed": [2012, 2, 15, 6, 45, 53, 2, 46, 0], "title": "Quasi-Monte Carlo methods for the Heston model", "title_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1202.3056%2C1202.4907%2C1202.1008%2C1202.5079%2C1202.2534%2C1202.5389%2C1202.1950%2C1202.1200%2C1202.2538%2C1202.0025%2C1202.0543%2C1202.5439%2C1202.3987%2C1202.5275%2C1202.6678%2C1202.5371%2C1202.3796%2C1202.1825%2C1202.6104%2C1202.3459%2C1202.5976%2C1202.1697%2C1202.1325%2C1202.0180%2C1202.1808%2C1202.2590%2C1202.1459%2C1202.6287%2C1202.2142%2C1202.0079%2C1202.6083%2C1202.3963%2C1202.5512%2C1202.4093%2C1202.2680%2C1202.0998%2C1202.0940%2C1202.3787%2C1202.4355%2C1202.5603%2C1202.5929%2C1202.1928%2C1202.6063%2C1202.1333%2C1202.5216%2C1202.5752%2C1202.3744%2C1202.3099%2C1202.1508%2C1202.5306%2C1202.2952%2C1202.4600%2C1202.3609%2C1202.4746%2C1202.4329%2C1202.5592%2C1202.2078%2C1202.0808%2C1202.6662%2C1202.1045%2C1202.3622%2C1202.0152%2C1202.4057%2C1202.0216%2C1202.0162%2C1202.0006%2C1202.1499%2C1202.0554%2C1202.0506%2C1202.6235%2C1202.1469%2C1202.2852%2C1202.5953%2C1202.4930%2C1202.0576%2C1202.4666%2C1202.5277%2C1202.5482%2C1202.2929%2C1202.4018%2C1202.4171%2C1202.6107%2C1202.3707%2C1202.0831%2C1202.4144%2C1202.0024%2C1202.6677%2C1202.2211%2C1202.3780%2C1202.0684%2C1202.3217%2C1202.2265%2C1202.4726%2C1202.4800%2C1202.2781%2C1202.6236%2C1202.1942%2C1202.5177%2C1202.4603%2C1202.4526%2C1202.0574&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "Quasi-Monte Carlo methods for the Heston model"}, "summary": "In this paper, we discuss the application of quasi-Monte Carlo methods to the\nHeston model. We base our algorithms on the Broadie-Kaya algorithm, an exact\nsimulation scheme for the Heston model. As the joint transition densities are\nnot available in closed-form, the Linear Transformation method due to Imai and\nTan, a popular and widely applicable method to improve the effectiveness of\nquasi-Monte Carlo methods, cannot be employed in the context of path-dependent\noptions when the underlying price process follows the Heston model.\nConsequently, we tailor quasi-Monte Carlo methods directly to the Heston model.\nThe contributions of the paper are threefold: We firstly show how to apply\nquasi-Monte Carlo methods in the context of the Heston model and the SVJ model,\nsecondly that quasi-Monte Carlo methods improve on Monte Carlo methods, and\nthirdly how to improve the effectiveness of quasi-Monte Carlo methods by using\nbridge constructions tailored to the Heston and SVJ models. Finally, we provide\nsome extensions for computing greeks, barrier options, multidimensional and\nmulti-asset pricing, and the 3/2 model.", "summary_detail": {"type": "text/plain", "language": null, "base": "http://export.arxiv.org/api/query?search_query=&id_list=1202.3056%2C1202.4907%2C1202.1008%2C1202.5079%2C1202.2534%2C1202.5389%2C1202.1950%2C1202.1200%2C1202.2538%2C1202.0025%2C1202.0543%2C1202.5439%2C1202.3987%2C1202.5275%2C1202.6678%2C1202.5371%2C1202.3796%2C1202.1825%2C1202.6104%2C1202.3459%2C1202.5976%2C1202.1697%2C1202.1325%2C1202.0180%2C1202.1808%2C1202.2590%2C1202.1459%2C1202.6287%2C1202.2142%2C1202.0079%2C1202.6083%2C1202.3963%2C1202.5512%2C1202.4093%2C1202.2680%2C1202.0998%2C1202.0940%2C1202.3787%2C1202.4355%2C1202.5603%2C1202.5929%2C1202.1928%2C1202.6063%2C1202.1333%2C1202.5216%2C1202.5752%2C1202.3744%2C1202.3099%2C1202.1508%2C1202.5306%2C1202.2952%2C1202.4600%2C1202.3609%2C1202.4746%2C1202.4329%2C1202.5592%2C1202.2078%2C1202.0808%2C1202.6662%2C1202.1045%2C1202.3622%2C1202.0152%2C1202.4057%2C1202.0216%2C1202.0162%2C1202.0006%2C1202.1499%2C1202.0554%2C1202.0506%2C1202.6235%2C1202.1469%2C1202.2852%2C1202.5953%2C1202.4930%2C1202.0576%2C1202.4666%2C1202.5277%2C1202.5482%2C1202.2929%2C1202.4018%2C1202.4171%2C1202.6107%2C1202.3707%2C1202.0831%2C1202.4144%2C1202.0024%2C1202.6677%2C1202.2211%2C1202.3780%2C1202.0684%2C1202.3217%2C1202.2265%2C1202.4726%2C1202.4800%2C1202.2781%2C1202.6236%2C1202.1942%2C1202.5177%2C1202.4603%2C1202.4526%2C1202.0574&start=0&max_results=1000&sortBy=relevance&sortOrder=descending", "value": "In this paper, we discuss the application of quasi-Monte Carlo methods to the\nHeston model. We base our algorithms on the Broadie-Kaya algorithm, an exact\nsimulation scheme for the Heston model. As the joint transition densities are\nnot available in closed-form, the Linear Transformation method due to Imai and\nTan, a popular and widely applicable method to improve the effectiveness of\nquasi-Monte Carlo methods, cannot be employed in the context of path-dependent\noptions when the underlying price process follows the Heston model.\nConsequently, we tailor quasi-Monte Carlo methods directly to the Heston model.\nThe contributions of the paper are threefold: We firstly show how to apply\nquasi-Monte Carlo methods in the context of the Heston model and the SVJ model,\nsecondly that quasi-Monte Carlo methods improve on Monte Carlo methods, and\nthirdly how to improve the effectiveness of quasi-Monte Carlo methods by using\nbridge constructions tailored to the Heston and SVJ models. Finally, we provide\nsome extensions for computing greeks, barrier options, multidimensional and\nmulti-asset pricing, and the 3/2 model."}, "authors": ["Jan Baldeaux", "Dale Roberts"], "author_detail": {"name": "Dale Roberts"}, "author": "Dale Roberts", "arxiv_comment": "20 pages. Submitted", "links": [{"href": "http://arxiv.org/abs/1202.3217v2", "rel": "alternate", "type": "text/html"}, {"title": "pdf", "href": "http://arxiv.org/pdf/1202.3217v2", "rel": "related", "type": "application/pdf"}], "arxiv_primary_category": {"term": "q-fin.CP", "scheme": "http://arxiv.org/schemas/atom"}, "tags": [{"term": "q-fin.CP", "scheme": "http://arxiv.org/schemas/atom", "label": null}], "pdf_url": "http://arxiv.org/pdf/1202.3217v2", "affiliation": "None", "arxiv_url": "http://arxiv.org/abs/1202.3217v2", "journal_reference": null, "doi": null, "fulltext": "QUASI-MONTE CARLO METHODS FOR THE HESTON MODEL\n\narXiv:1202.3217v2 [q-fin.CP] 3 May 2012\n\nJAN BALDEAUX AND DALE ROBERTS\nA BSTRACT. In this paper, we discuss the application of quasi-Monte Carlo methods to\nthe Heston model. We base our algorithms on the Broadie-Kaya algorithm, an exact simulation scheme for the Heston model. As the joint transition densities are not available in\nclosed-form, the Linear Transformation method due to Imai and Tan, a popular and widely\napplicable method to improve the effectiveness of quasi-Monte Carlo methods, cannot be\nemployed in the context of path-dependent options when the underlying price process follows the Heston model. Consequently, we tailor quasi-Monte Carlo methods directly to the\nHeston model. The contributions of the paper are threefold: We firstly show how to apply\nquasi-Monte Carlo methods in the context of the Heston model and the SVJ model, secondly that quasi-Monte Carlo methods improve on Monte Carlo methods, and thirdly how\nto improve the effectiveness of quasi-Monte Carlo methods by using bridge constructions\ntailored to the Heston and SVJ models. Finally, we provide some extensions for computing\ngreeks, barrier options, multidimensional and multi-asset pricing, and the 3/2 model.\n\n1. I NTRODUCTION\nIn this paper, we show how to apply quasi-Monte Carlo (QMC) methods to price\npath-dependent contingent claims where the underlying asset price is given by the Heston model [28] and the SVJ model [8]. We recall that, on a filtered probability space\n(Ω, F , (Ft )t≥0 , P) under the assumption that P is (already) the risk-neutral pricing measure, the Heston model is given by the system of stochastic differential equations\n√\ndSt = rSt dt + Vt St dWt1 ,\n(1)\n√\ndVt = κ (θ − Vt )dt + σ Vt dWt2 ,\n\nwhere (Wt1 )t≥0 and (Wt2 )t≥0 are Brownian motions under P with dhW 1 ,W 2 i = ρ dt. The\nprocess S := (St )t≥0 models the asset price dynamics and V := (Vt )t≥0 the (stochastic)\nvariance of S. Here, r is the risk-free rate of interest, θ is the long-term average variance,\nκ is the mean-reversion speed of V , and σ is the volatility of V . The SVJ model adds\njumps in the dynamics of the underlying S and provides a model that calibrates better\nto the observed market prices of short-dated European options exhibiting steep skew, see\nSection 6. An important feature of our approach is that we can work in regimes where\nthe Feller condition 2κθ ≥ σ 2 is violated, which is useful for market practitioners, see e.g.\n[19].\nThe Heston model assumes diffusion dynamics for both the spot price and the volatility,\nbut even though the spot price and volatility are jointly Markovian, we do not deal with\na stationary, independent increment process. Therefore our situation is different to the\nmajority of papers that apply QMC methods to finance problems [1, 2, 5, 4, 9, 14, 27,\n31, 32, 38, 46, 49] and, in particular, the Linear Transform (LT) method of Imai and Tan\n2010 Mathematics Subject Classification. 65C05, 65D30, 91G20, 91G60.\nKey words and phrases. quasi-Monte Carlo methods, computational finance, stochastic volatility, pathdependent derivatives, bridge sampling, exact simulation.\n1\n\n\f2\n\nJAN BALDEAUX AND DALE ROBERTS\n\n[31, 32] (see also Leobacher [38]) does not seem applicable in our case of path-dependent\noptions when the underlying follows either the Heston model or the SVJ model.\nWe recall that the LT method relies on the observation that multiplying a vector of standard normal random variates by an orthogonal matrix produces another vector of standard\nnormal random variates. Consequently, evaluating the normal cumulative distribution function elementwise at the vector resulting from the multiplication of an orthogonal matrix by\na vector of standard normal random variates, produces a vector of random variates uniformly distributed on [0, 1]. One consequently uses these uniform random variates in the\nQMC procedure relevant to the problem. The key step of the LT method is a judicious\nchoice of the orthogonal matrix. In fact, an optimization procedure is used to obtain this\nmatrix, see [31], [32]. Unfortunately, in [32] the method is only presented for independent\nincrement processes (see Proposition 4.1 in [32]) and requires knowledge of the transition\ndensity of the underlying stochastic processes. Though the density of the spot price, conditional on the initial values of spot and volatility, in the Heston model has been studied\n[7], the joint transition density of spot and volatility, which is needed for the valuation of\npath-dependent options, does not seem to be available. Consequently, the LT method is not\napplicable in our situation, instead we directly construct bridges for the stock price process\nunder consideration.\nWe recall that QMC is a class of numerical methods for high-dimensional integrals that\ncan broadly be divided into two categories: nets [21, 42] and lattice rules [42, 48]. However,\nin practice, once the problem is properly formulated both approaches may be applied. This\nis the first of three contributions of the paper: we first show how to formulate the finance\nproblem as an integration problem based on the exact simulation scheme of Broadie and\nKaya [12] then, similar to the results from the references cited above, we demonstrate that\nQMC methods outperform Monte Carlo (MC) methods when using Sobol point sets with\nOwen's scrambling method. We also improve our QMC results slightly by conditioning in\nthe case of European call options.\nSecondly, we extend the results for the Heston and SVJ model to the case of pathdependent options and demonstrate that by allocating more of the variance to the early\ndimensions of the QMC point set, the performance of QMC methods can be significantly\nimproved. This is also in line with the results presented in the cited references. We achieve\nthis by employing a bridge construction for the variance process based on [40, 51] and\nthe well-known bridge construction for a Brownian motion with drift and time-dependent\nvolatility [24] and the bridge construction for jump processes [5]. These constructions\nare in the spirit of [2, 5, 46], where bridge constructions were derived for the stochastic\nprocesses under consideration. We demonstrate our bridge algorithm by considering Asian\ncall options in the case of the Heston and SVJ model.\nThirdly, we provide a number of additional results of interest in finance. We show\nhow to compute greeks in our framework, we consider Barrier options using the ideas of\nGlasserman and Staum [26], multi-asset stochastic volatility models, and the extension to\nthe 3/2 model.\nThe remainder of the paper is structured as follows. In Section 2, we discuss the BroadieKaya algorithm, which forms the basis of the algorithms introduced in this paper, and\nshow how to combine it with the QMC methods. In Section 3, we recall QMC methods\nand Section 4 shows how to effectively combine the Broadie-Kaya algorithm with QMC\nmethods in the context of path-independent European options. Section 5 introduces bridge\nsampling for the square-root process and the spot price process. The extension to the SVJ\n\n\fQUASI-MONTE CARLO METHODS FOR THE HESTON MODEL\n\n3\n\nmodel is discussed in Section 6. Further extensions of the algorithms presented in this\npaper are discussed in Section 7.\n2. Q UANTILE FUNCTION\n\nFOR THE\n\nH ESTON MODEL\n\nTo price any contingent claim using a MC or QMC method, one must be able to sample\nfrom the law of the asset price process in a fast and accurate way. Our approach is to apply the inverse transform method which requires us to obtain the quantile function of the\nlaw of the Heston process (St )t≥0 . We recall that given a random variable X with distribution function F(x) := P(X ≤ x), the quantile function (or inverse cumulative distribution\nfunction) returns the value below which random samples from the given distribution would\noccur p amount of the time: the quantile function Q : [0, 1] → R for the distribution of X is\ndefined as QX (p) := inf{x ∈ R : p ≤ F(x)}.\nFor t > u, the distribution of St and Vt solving (1) with initial conditions Su ∈ R+ and\nVu ∈ R+ can easily be shown to be given by\n\u0013\n\u0012\nZ t\nZ t\nZ\nq\n√\n√\n1 t\n2\n1\n2\nVs dWs + 1 − ρ\nVs dWs ,\nVs ds + ρ\nSt = Su exp r(t − u) −\n2 u\nu\nu\nZ t\nZ t√\nVt = Vu + κθ (t − s) − κ Vu du + σ\nVu dWu2 .\n(2)\ns\n\ns\n\nOur approach to obtain the quantile function for the distribution of the random variable St\nis based on the exact simulation method obtained by Broadie and Kaya [12].\n\n2.1. The Broadie-Kaya approach. We recall that the exact simulation approach for (1)\ngiven by Broadie and Kaya [12] is as follows:\n(1) Simulate Vt given Vu = x,\nR\n(2) Generate a sample from the distribution of ut Vs ds given Vu = x and Vt = y,\nRt √\nR\n(3) Recover u Vs dWs2 from (2) given Vt = y, Vu = x, and ut Vs ds = z as\nZ t\n√\n1\nVu dWu2 = (y − x + κθ (t − u) − z),\nσ\ns\nR √\nR\n(4) Generate a sample from the distribution of St given ut Vs dWs2 and ut Vs ds.\nWhen simulating a random variable X using QMC methods it is sometimes more convenient to rephrase such algorithm in terms of quantiles, allowing one to substitute either\nrandom uniforms (for a MC method) or QMC point sets in the quantile function QX to\ndraw a sample of X.\n2.2. Obtaining quantile functions. The Broadie-Kaya approach can be reformulated in\nterms of quantiles. To simplify notation, we shall henceforth use the following convention:\nwe write X ∼ L to denote that X has a law L and X|Y = y ∼ L to denote that the random\nvariable X conditioned on the event Y = y has law L. We sometimes write X|y instead of\nX|Y = y when the context is clear.\nThe quantile function for Vt |Vu = x, which is needed for step 1 in the Broadie Kaya\napproach, is easily found. It is well known that for t > u the distribution of Vt |Vu follows a\nnoncentral chi-squared distribution:\n\u0012\n\u0013\nσ 2 (1 − exp(−κ (t − u))) 2\n4κ exp(−κ (t − u))\n4θ κ\nχd\nx , d := 2 ,\nVt |Vu = x ∼\n2\n4κ\nσ (1 − exp(−κ (t − u)))\nσ\n\nwhere χν2 (λ ) denotes the noncentral chi-squared random variable with ν degrees of freedom and noncentrality parameter λ . Therefore, the quantile function for Vt |Vu = x can\n\n\f4\n\nJAN BALDEAUX AND DALE ROBERTS\n\nbe obtained from the quantile function for a noncentral chi-squared distribution with the\nν and λ .\nappropriate choice of parameters\nR\nThe quantile function of ut Vs ds|Vu = x,Vt = y is the most expensive step. Broadie and\nKaya obtained its distribution function by computing the conditional Laplace transform\nand performing a numerical inversion of the characteristic function. An alternative approach to determining the distribution function was given by Glasserman and Kim using a\nseries expansion of the random variable [25]. We follow\n\u0001 by Broadie and\nR the approach given\nKaya whereby the conditional distribution F(x) := P ut Vs ds ≤ x|Vu ,Vt is obtained by nu\u0001\u0003\n\u0002\nR\nmerically inverting the (conditional) characteristic function Φ(a) := E exp ia ut Vs ds Vu ,Vt .\nWe recall that Φ was given explicitly as\n\nγ (a)e− 2 (γ (a)−κ )(t−u) (1 − e−κ (t−u))) A(a)\nexp(C(a))\nΦ(a) =\nB\nκ (1 − e−γ (a)(t−u))\n1\n\nwhere the terms A, B, C, and γ (a) are\nA(a) := Id/2−1\nB := Id/2−1\n\n!\n1\n√\n4γ (a)e 2 γ (a)(t−u)\n,\nVuVt 2\nσ (1 − e−γ (a)(t−u))\n!\n1\n√\n4κ e 2 κ (t−u)\nVuVt 2\n,\nσ (1 − e−κ (t−u))\n\nVu + Vt κ (1 + eκ (t−u)) γ (a)(1 + e−γ (a)(t−u))\n−\nC(a) :=\nσ2\n1 − e−κ (t−u)\n1 − eγ (a)(t−u)\np\nγ (a) := κ 2 − 2σ 2 ia,\n\n!\n\n,\n\nand Iν (x) denotes the modified Bessel function of the first kind. The inversion of Φ (which\ngives F(x)), can be calculated by applying a trapezoidal rule to approximate the integral\n2 ∞ sin(zx)\nRΦ(z) dz,\nπ 0\nz\nwhere R(x + iy) := x for x, y ∈ R. We note that the term B does not depend on a so only\nneeds to be computed once per inversion of Φ. Given a mesh size of h, the integral is\napproximated as\nhx 2 N sin(h jx)\n+ ∑\nRΦ(h j) − εh − εN\nF(x) =\nπ\nπ j=1\nj\nF(x) =\n\nZ\n\nwhere εh is the discretization error associated with the choice of mesh size h and εN is\nthe truncation error caused by taking N < ∞. Following\nq Broadie and Kaya, to approximate\nF(x) with good accuracy we set h = 2π /(x+ |m1|+ q| m2 − m21 |) where m1 and m2 are the\n\nfirst and second moments of ut Vs ds|Vu ,Vt and q ∈ N is chosen sufficiently large (e.g., q =\n5). Explicit (but long) expressions for m1 and m2 can be found using a computer algebra\nsystem (CAS) using the well-known technique of differentiating Φ and setting a = 0. The\nupper bound of the summation is chosen to satisfy |Φ(hN)|/N < πε /2 where ε is the\ndesired truncation error. Thus, given our numerical approximation F h,N of the distribution\nfunction F we can apply a root finding procedure to identify the quantile function\nof F h,N .\nRt\nFinally, we consider the quantile function of St conditioned on the event\n= y, the\nu VsRds\np\nRt √\nt√\n2\n2\nevent u Vs dWs = z, and the initial condition Su . First, observe that 1 − ρ u Vs dWs1\nR\nis normally distributed with mean zero and variance ut Vs ds. Therefore, log(St )|y, z, Su\nR\nis normally distributed with mean r(t − u) − 21 y + ρ z and variance (1 − ρ 2 ) ut Vs ds =\nR\n\n\fQUASI-MONTE CARLO METHODS FOR THE HESTON MODEL\n\n5\n\n(1 − ρ 2)y. Further, if we have the quantile function QZ for Z ∼ N(0, 1) then if X ∼ N(μ , σ 2 )\nthen QX (p) = μ + σ QZ (p) and Qexp(X) (p) = exp(μ + σ QZ (p)) as ex is an increasing function of x. Hence, we have the quantile function for St |y, z, Su .\n3. QMC METHODS\nRegarding QMC point sets, we will make use of digital nets [21, 42]. Given a (base\nb) digital net (ui )ni=1 , where ui ∈ [0, 1]d for some dimension d ∈ Z+ , we will always randomize the point set using Owen's scrambling algorithm to compute standard errors [43].\nGiven a generic point x ∈ [0, 1)d , where x = (x1 , . . . , xs ), we recall that Owen's algorithm\nexpands each x j as\nξ j,1 ξ j,2\nxj =\n+ 2 + ... ,\nb\nb\nand generates a scrambled point y ∈ [0, 1)d , where y = (y1 , . . . , yd ), as\nη j,1 η j,2\n+ 2 + ... .\nyj =\nb\nb\nThe permutation π j applied to ξ j,l , j = 1, . . . , d depends on ξ j,k , for 1 ≤ l. In particular,\nη j,1 = π j (ξ j,1 ), η j,2 = π j,ξ j,1 (ξ j,2 ), η j,3 = π j,ξ j,1 ,ξ j,2 (ξ j,3 ) and in general\n\nη j,k = π j,ξ j,1 ,...,ξ j,k−1 (ξ j,k ) , k ≥ 2 ,\n\nwhere π j and π j,ξ j,1 ,...,ξ j,k−1 , k ≥ 2, are random permutations of {0, 1, . . . , b − 1}. We assume\nthat permutations with different indices are mutually independent. We recall that if the\nscrambling algorithm is applied to x to obtain y, then y is uniformly distributed in [0, 1)d\nby Proposition 2 in [43]. We find it convenient to introduce the following notation\ny = π (x) ,\nso π (*) represents the scrambling algorithm applied to x to obtain y.\nWe recall that by our reformulation of the Broadie Kaya approach for the Heston model\nin Section 2 in terms of quantiles, the discounted payoff e−rT g(ST ) for some T > 0 can\nbe rewritten as a function f : [0, 1]3 → R and, in the case of a path-dependent payoff,\ne−rT g(St1 , St2 , . . . , Stn ) for times 0 < t1 ,t2 , . . . ,tn = T can be transformed to the function\nf : [0, 1]3×n → R. Henceforth, we simply assume that all discounted payoffs are mapped\nto the d-dimensional (for some appropriate d) unit cube in this manner.\nGiven q independent permutations π r , r = 1, . . . , q, and the discounted payoff of the\nfinancial derivative f : [0, 1]d → R, we estimate the price of the derivative using\nIQMC =\n\n1 q\n1 q 1 n\nI\n=\n∑ r q ∑ n ∑ f (π r (ui )),\nq r=1\nr=1 i=1\n\nand compute standard errors via\n\nσQMC =\n\ns\n\nq\n\n∑r=1 (Ir − IQMC)2\n.\nq(q − 1)\n\nWe point out that for digital nets, scrambling is the preferred randomization method, as it\nachieves the optimal convergence rate [6, 21, 45]. For an implementation of the scrambling\nalgorithm, we refer the reader to [30].\nFor purposes of comparison, we will also look at MC estimators. In this case, we will\nq×n\nchoose q × n points, (ξi )i=1 , independent and identically distributed in [0, 1]d , and estimate\n\n\f6\n\nJAN BALDEAUX AND DALE ROBERTS\n\nderivative prices using\nIMC =\nand compute standard errors using\n\nσMC =\n\ns\n\n1 q×n\n∑ f (ξi )\nq × n i=1\n\n∑i=1 ( f (ξi ) − IMC)2\n.\nq × n(q × n − 1)\nq×n\n\nWe conclude the section by commenting on the variances of IMC and IQMC . For squareintegrable functions f , it is well-known that\nVar( f (ξi ))\n.\nq×n\nRegarding IQMC , it is known that for a square-integrable function f the Monte Carlo convergence rate is matched [44, 21]. However, scrambled digital nets can exploit the smoothness\nof the integrand: if the integrand satisfies a Hölder condition of order α with 0 < α ≤ 1,\nthen the variance decays at a rate of order O(n−(1+2α )+ε ) for some ε > 0, and the leading\nconstant is allowed to depend on the dimension of the point set [6, 21]. In practise, it is difficult to confirm the smoothness of the integrand under consideration, hence it is important\nto investigate the standard errors of QMC methods numerically.\nVar(IMC ) =\n\n4. E UROPEAN C ALL\n\nOPTIONS\n\nIn this section, we follow [50] and apply conditional Monte Carlo method to improve\nthe efficiency of the Broadie-Kaya algorithm. We use European call options to demonstrate\nthe method. The approach relies on the observation that given\nZ T√\nZ T\nVs ds ,\nVs dWs2\n0\n\n0\n\nthe price of a European call option is given by the Black-Scholes price, with modified\ninitial share price\n\u0013\n\u0012\nZ\nZ T√\nρ2 T\n2\nVs dWs\nVs ds + ρ\nS̃0 = S0 exp −\n2 0\n0\nq R\np\nand adjusted volatility σ̃ 1 − ρ 2, where σ̃ := T1 0T Vs ds. Using BS(S0, K, r, τ , σ ) to\ndenote the Black-Scholes price of a European call with initial stock price S0 , strike K,\ninterest rate r, time to maturity τ and volatility σ , we have\n\u0001\n\u0001\u0001\nE e−rT (ST − K)+ = E BS S̃0 , K, r, τ , σ̃ ,\nR\nR √\nthat is, we firstly simulate 0T Vs ds and 0T Vs dWs2 using the Broadie-Kaya algorithm, and\nthen compute the Black-Scholes price, for the particular values of S̃0 and σ̃ corresponding\nR √\nR\nto 0T Vs ds and 0T Vs dWs2 . In Table 1, we show price and standard error estimates for\na European call option. Columns 1 and 2 show that combining QMC methods with the\nBroadie-Kaya algorithm already improves on the Monte Carlo method. However, using\nthe conditioning argument, the QMC method significantly improves on a naive application\nof QMC methods to the Broadie-Kaya algorithm. There are two reasons for the variance reduction: we do not estimate the Black-Scholes price using Monte Carlo simulation, which\nis done in Step 4 of the Broadie-Kaya algorithm, but compute the value exactly. Furthermore, it can be expected that when combining the conditional expectations with QMC\nmethods, the approach is even more efficient [50]. This is due to the fact that taking the\n\n\fQUASI-MONTE CARLO METHODS FOR THE HESTON MODEL\n\n7\n\nTABLE 1. Estimated prices (with standard errors given in parentheses)\nof European options where the asset price process is given by a Heston\nmodel. These values are based on 30 independent batches.\nTrials\n128\n256\n512\n1024\n2048\n4096\n8192\n16384\n\nMC\n6.847642 (0.121792)\n6.785936 (0.085627)\n6.794658 (0.059212)\n6.818196 (0.042269)\n6.820823 (0.030005)\n6.815857 (0.021199)\n6.789039 (0.014945)\n6.800179 (0.010576)\n\nQMC\n6.792353 (0.074884)\n6.815575 (0.037468)\n6.807123 (0.023326)\n6.805009 (0.010747)\n6.805464 (0.004077)\n6.806346 (0.002346)\n6.806315 (0.001721)\n6.806484 (0.000730)\n\nCond QMC\n6.807731 (0.011452)\n6.807578 (0.007037)\n6.806918 (0.001924)\n6.807080 (0.001928)\n6.806219 (0.001182)\n6.806326 (0.000480)\n6.806558 (0.000520)\n6.806438 (0.000249)\n\nOption parameters: S = 100, K = 100, V0 = 0.010201, κ = 6.21, θ = 0.019, σ = 0.61, ρ = −0.70,\nr = 3.19%, T = 1.0 year, true option price is 6.80611.\n\nconditional expectation has a smoothing effect, which can be expected to improve the performance of quasi-Monte Carlo methods, see [37, Subsection 10.1].\n5. B RIDGE\n\nSAMPLING FOR PATH - DEPENDENT OPTIONS\n\nIn this section, we study the pricing of options whose payoff is a function of\nSt1 , . . . , Sth ,\nwhere we choose h = 2m for simplicity. A naive approach to simulating this path is given\nin Algorithm 1. The algorithms for the simulation of the random variables required in steps\n1, 2, and 3 of Algorithm 1 (using either MC or QMC) follows from the algorithm given in\nSection 2.\nAlgorithm 1 Naive version of the Broadie-Kaya exact simulation algorithm\n1:\n\nSimulate (Vti )Ni=1 in the following order\n\n2:\n\nSimulate\n\n3:\n\nSimulate\n\n\u0010R\n\n\u0011\n\nVt1 , Vt2 , * * * , VtN .\n\nti\nti−1 Vs ds|Vti−1 ,Vti for i = 1, . . . , N.\n(Sti )Ni=1 in the following order\n\nSt1 , St2 , St3 , * * * , StN .\nIt is well-known that QMC methods are particularly efficient if the effective dimension of the problem under consideration is low [14]. In our case, the effective dimension\ndepends on the variance of the discounted pay-off of the financial derivative under consideration. To reduce the effective dimension, following [2, 5, 14], we now allocate the early\ndimensions to variates with high variances. We achieve this by proposing a bridge algorithm, given by Algorithm 2, to generate the paths of (St )t≥0 at the time points t1 , . . . ,tN .\nThe simulation of the random variables required in our bridge algorithm requires the construction of a bridge sampling algorithm for the square-root process (Vt )t≥0 and a bridge\nsampling algorithm for the stock price process (St )t≥0 . In the coming sections, we propose\nalgorithms to construct these bridges.\n\n\f8\n\nJAN BALDEAUX AND DALE ROBERTS\n\nAlgorithm 2 Bridge version of the exact simulation algorithm\n1:\n\n2:\n3:\n\nSimulate (Vti )Ni=1 in the following order\nVtN , Vt N , Vt N , Vt 3N , * * *\n2\n4\n4\n\u0011\n\u0010R\nti\nSimulate ti−1 Vs ds|Vti−1 ,Vti for i = 1, . . . , N.\nSimulate (Sti )Ni=1 in the following order\n\nStN , St N , St N , St 3N , . . .\n2\n\n4\n\n4\n\n5.1. Bridge sampling for square-root processes. We now recall how to perform bridge\nsampling for square-root processes by relying on the bridge sampling algorithm for squared\nBessel processes studied by Yuan and Kalbfleisch [51] and Makarov and Glew [40]. The\nfollowing well-known result linking square-root processes and squared Bessel processes is\nemployed, see Proposition 6.3.1.1 in [34].\nProposition 1. The square-root process V = {Vt , t ≥ 0} is a squared Bessel process transformed by the following space-time change:\nVt = e−κ t Xc(t) ,\nwhere c(t) =\n4κθ\n.\nσ2\n\nσ 2 κt\n4κ (e\n\n− 1), X = {Xt , t ≥ 0} is a squared Bessel process of dimension δ =\n\nAs we assume that κ , θ , σ > 0, we have that for δ ≥ 2, the boundary 0 is polar and for\n0 < δ < 2 it is reflecting, see Figure 6.1 in [34]. This allows us to propose Algorithm 3,\nadapted from the algorithm in [40], to sample a square-root process at times t1 , . . . ,th where\nh = 2m with m ≥ 1.\n5.2. Bridge sampling for the stock price. We now propose a bridge sampling algorithm\nfor step 3 of Algorithm 2, that is, an algorithm to simulate (Sti )hi=1 where h = 2m in the\norder Sth , Sth/2 , Sth/4 , St3h/4 , . . . with effect of allocating the early dimensions to variates with\nhigh variances. The following lemma allows us to set up a sampling scheme for the stock\nprice process.\nLemma 1. Given times u < t1 < t2 < t3 , the joint distribution of log(St1 ), log(St2 ), log(St3 )\nconditional on the initial condition Su , the variances V := (Vt1 ,Vt2 ,Vt3 ), and the integrated\nR\nR\nR\nvariances IV := ( ut1 Vs ds, ut2 Vs ds, ut3 Vs ds) is given by\n  2\n\n\n\n\nσ1 σ12 σ12\nμ1\nlog(St1 )\n log(St2 )  V, IV, Su ∼ N  μ2  ,  σ12 σ22 σ22  ,\nμ3\nlog(St3 )\nσ12 σ22 σ32\n\nwhere for i = 1, 2, 3 we have defined σi2 := (1 − ρ 2)\n\nμi := log(St0 ) + rti −\n\nZ\n1 ti\n\n2\n\nu\n\nR ti\nu\n\nVs ds and\n\nVs ds + ρ\n\nFurther, we have log(St2 )|St1 , St3 ,V, IV ∼ N(M, Σ) where\nM := log(St1 ) + μ2 − μ1 +\n\nZ ti\n√\nu\n\nVs dWs1 .\n\n\u0001\nσ 2 (t2 ) − σ 2 (t1 )\nlog(St3 ) − log(St1 ) + μ1 − μ3 ,\nσ 2 (t3 ) − σ 2 (t1 )\n\n\fQUASI-MONTE CARLO METHODS FOR THE HESTON MODEL\n\n9\n\nAlgorithm 3 Bridge sampling for the square-root process\nRequire: Time indices (t1 , . . . ,t2m )\n1: h ← 2m , jmax ← 1, x0 ← V0 , δ ←\n2:\n3:\n4:\n5:\n6:\n7:\n8:\n9:\n10:\n11:\n12:\n13:\n14:\n15:\n16:\n17:\n\nfor i = 1, . . . , h do si ←\n\nχ 2 (δ , x\n\nσ2\n\n4κθ\nσ2\n\n4κ (exp(κ ti ) − 1)\n\nGenerate Z ∼\n0 /sN )\nxh ← sh Z\nt0 ← 0\nfor k = 1, . . . , m do\nimin ← h/2, i ← imin\nl ← 0, r ← h\nfor j = 1, . . . , jmax\n\u0011\n\u0010 do\n−ti\nl\nxl + ttri −t\nλ ← 2(tr1−t ) ttri −t\n−ti xr\nl\n\nl\n\nGenerate P ∼ Poisson(λ ) √\nxx\nGenerate Z ∼ Bessel( δ2 − 1, tr −tl r )\nl\n\nl\nGenerate G ∼ Gamma(P + 2Z + δ2 , 2(t −ttr −t\n)\ni l )(tr −ti )\nxi ← G\ni ← i + h, l ← l + h, r ← r + h\njmax ← 2 jmax , h ← imin\nfor i = 1, . . . , h do vi ← exp(−κ ti )xi\nreturn sampled path (v1 , . . . , vh ) from distribution of (Vt1 , . . . ,Vt2m )\n\nand\nΣ := σ 2 (t2 ) − σ 2 (t1 ) −\n\n(σ 2 (t2 ) − σ 2(t1 ))2\n.\nσ 2 (t3 ) − σ 2 (t1 )\n\nProof. The first part of the lemma is straightforward, the second follows immediately from\nthe conditioning formula (2.25) in [24].\n\u0003\nBy applying Lemma 1, we propose Algorithm 4 to sample the path of the share price process (St )t≥0 at the time points (St1 , . . . , Sth ). This algorithm requires the drifts (μ1 , . . . , μ2m )\nand volatilities (σ12 , . . . , σ22m ) determined in Lemma 1.\n5.3. Numerical results. To demonstrate our bridging technique, we estimate the price of\nan Asian call option where the asset price process is given by a Heston model. We recall\nthat the payoff of an Asian call option, for strike price K and expiry T , is given by\n!+\n1 d\n∑ Sti − K ,\nd i=1\nwhere t1 , . . . ,td are d monitoring dates. We compare the prices obtained with standard\nMonte Carlo, QMC using Sobol points and Owen's scrambling algorithm, and the bridge\nconstruction using Sobol points and Owen's scrambling. These results are presented in\nTable 2. We find that QMC methods already improve on Monte Carlo methods, however,\nusing bridge constructions, the effectiveness of QMC methods can be enhanced.\n6. E XTENSION\n\nTO THE\n\nSVJ\n\nMODEL\n\nIt is well known that Heston stochastic volatility model cannot fit short-term smiles well\nif they exhibit skew [23]. This motivates the introduction of jumps into the dynamics of\n\n\f10\n\nJAN BALDEAUX AND DALE ROBERTS\n\nAlgorithm 4 Bridge sampling for the share price process\nRequire: Time indices (t1 , . . . ,t2m ), drifts (μ1 , . . . , μ2m ), volatilities (σ12 , . . . , σ22m ), and S0\n1: h ← 2m , jmax ← 1\n2: Generate (Z1 , . . . , Zh ) ∼ N(0, I)\n3: sh ← exp(μh + σh Zh )\n4: s0 ← S0\n5: for k = 1, . . . , m do\n6:\nimin ← h/2, i ← imin\n7:\nl ← 0, r ← h\n8:\nfor j = 1, . . . , jmax do\nσ 2 −σ 2\n\na ← μi − μl + log(sl ) + σi2 −σl2 (log(sr ) − log(sl ) + μl − μr )\n\n9:\n\nb ← σi2 − σl2 −\n\n10:\n11:\n12:\n13:\n\n(σi2 −σl2 )2\nσr2 −σl2\n\nr\n\nl\n\nsi ← exp(a + bZi)\ni ← i + h, l ← l + h, r ← r + h\njmax ← 2 jmax , h ← imin\nreturn sampled path (s1 , . . . , s2m ) from distribution of (St1 , . . . , St2m )\n\nTABLE 2. Standard errors of Asian option price where the asset price\nprocess is given by a Heston model using Monte Carlo (M), Quasi-Monte\nCarlo (Q), and the Bridge Quasi-Monte Carlo (B) algorithms. These\nvalues are based on 30 independent batches and m trials.\nn\n4\n\n8\n\n16\n\n32\n\n64\n\n128\n\nm:\nM\nQ\nB\nM\nQ\nB\nM\nQ\nB\nM\nQ\nB\nM\nQ\nB\nM\nQ\nB\n\n26\n0.0959\n0.0303\n0.0299\n0.1054\n0.0413\n0.0379\n0.0973\n0.0462\n0.0409\n0.0804\n0.0523\n0.0339\n0.0913\n0.0575\n0.0537\n0.0920\n0.0705\n0.0641\n\n27\n0.0740\n0.0231\n0.0172\n0.0713\n0.0285\n0.0280\n0.0646\n0.0241\n0.0298\n0.0608\n0.0377\n0.0269\n0.0656\n0.0400\n0.0205\n0.0612\n0.0331\n0.0672\n\n28\n0.0639\n0.0147\n0.0133\n0.0399\n0.0160\n0.0149\n0.0435\n0.0189\n0.0182\n0.0432\n0.0181\n0.0283\n0.0362\n0.0251\n0.0118\n0.0318\n0.0319\n0.0587\n\n29\n0.0365\n0.0079\n0.0070\n0.0338\n0.0080\n0.0151\n0.0351\n0.0102\n0.0130\n0.0364\n0.0185\n0.0114\n0.0349\n0.0219\n0.0069\n0.0314\n0.0208\n0.0110\n\n210\n0.0302\n0.0039\n0.0053\n0.0253\n0.0056\n0.0063\n0.0244\n0.0073\n0.0061\n0.0269\n0.0123\n0.0101\n0.0246\n0.0182\n0.0076\n0.0253\n0.0201\n0.0075\n\n211\n0.0204\n0.0033\n0.0036\n0.0166\n0.0043\n0.0032\n0.0227\n0.0052\n0.0042\n0.0163\n0.0095\n0.0047\n0.0158\n0.0113\n0.0061\n0.0142\n0.0123\n0.0066\n\n212\n0.0128\n0.0020\n0.0028\n0.0126\n0.0023\n0.0026\n0.0127\n0.0027\n0.0029\n0.0106\n0.0035\n0.0030\n0.0127\n0.0064\n0.0046\n0.0113\n0.0054\n0.0047\n\n213\n0.0086\n0.0009\n0.0025\n0.0075\n0.0021\n0.0021\n0.0074\n0.0019\n0.0018\n0.0078\n0.0022\n0.0026\n0.0080\n0.0034\n0.0033\n0.0099\n0.0038\n0.0037\n\n214\n0.0052\n0.0008\n0.0010\n0.0052\n0.0009\n0.0011\n0.0069\n0.0010\n0.0013\n0.0055\n0.0018\n0.0009\n0.0064\n0.0020\n0.0039\n0.0064\n0.0027\n0.0034\n\nOption parameters: S = 100, K = 100, V0 = 0.010201, κ = 6.21, θ = 0.019, σ = 0.61, ρ = −0.70,\nr = 3.19%, with n time monitors over the time period [0, 1].\n\nthe underlying share price process. The following model, often called the SVJ model, was\n\n\fQUASI-MONTE CARLO METHODS FOR THE HESTON MODEL\n\nfirst proposed in [8]:\n\u0012\n\u0013\n\u0013\n\u0012\nq\n1\n2\n2\ndSt = St− (r − λ μ̄ )dt + Vt ρ dWt + 1 − ρ dWt + (Yt − 1)dNt ,\n√\ndVt = κ (θ − Vt )dt + σ Vt dWt1 ,\n\n11\n\n(3)\n\nwhere Nt is a Poisson process with constant intensity λ , (Wt1 )t≥0 and (Wt2 )t≥0 are independent Brownian motions both independent from the Poisson process (Nt )t≥0 , and the jump\nvariables Yt are a family of independent random variables all having the same lognormal\ndistribution with mean μS and variance σS2 . Furthermore, E (Yt − 1) = μ̄ so it follows that\n1\nμS = log(1 + μ̄ ) − σS2 .\n2\nSolving the SDE for the stock price process (3), we obtain\nNt\n\nSt = S̃t ∏ Ỹ j ,\n\n(4)\n\nj=1\n\nwhere\n\u0012\n\u0013\nZ t√\nZ t√\nZ\nq\n1 t\nS̃t = S0 exp (r − λ μ̄ )t −\nVs ds + ρ\nVs dWs1 + 1 − ρ 2\nVs dWs2 .\n2 0\n0\n0\n6.1. Exact simulation for the SVJ model. As discussed in [12, 35], equation (4) motivates the simulation algorithm for the SVJ model: First simulate the diffusion part as in\nt\nSection 2 and then take care of the jump part using ∏Nj=1\nỸ j . This results in Algorithm 5\nwhich is the analogue of the Broadie Kaya algorithm presented in Section 2 for the SVJ\nmodel. We recall that this algorithm also appeared in [12] and in similar form as Algorithm\n7.1 in [35]. Further, since Ỹi follow the lognormal distribution with mean μS and variance\nσS2 , it is clear that\nNt\n\u0001\n∑ log(Ỹ j )|Nt ∼ N Nt μs , Nt σS2 .\nj=1\n\nAlgorithm 5 Exact simulation algorithm for the SVJ model\n1:\n2:\n3:\n4:\n5:\n6:\n\nSimulate Vt given V0\nR\nGenerate a sample from the distribution of 0t Vs ds given Vt and V0\nR √\nR\nRecover 0t Vs dWs1 from (2) given Vt , V0 and 0t Vs ds\nGenerate S̃t\nGenerate Nt\nt\nỸ j , given Nt\nGenerate ∏Nj=1\n\nt\nThere are alternative approaches to simulating ∏Nj=1\nỸ j as required in Algorithm 5. As\nin Section 3.5 of [24], one can simulate Nt by simulating the jump times of the Poisson\nprocess. Furthermore, as discussed in [12], given Nt , one can simulate the jump sizes Ỹi , i =\n1, . . . , Nt individually. However, Algorithm 5 results in a problem that is of fixed dimension,\nin particular, the dimension of the problem in Algorithm 5 is five, i.e. five random uniforms\n(or a QMC point from [0, 1]5 ) are used to obtain a realization of ST . Having a problem of\nfixed dimensionality is important when applying QMC methods, which is the ultimate goal\nof this paper, hence we choose the formulation presented in Algorithm 5.\n\n\f12\n\nJAN BALDEAUX AND DALE ROBERTS\n\n6.2. Path-dependent options in the SVJ model. As in Section 5, we now turn to the\nproblem of studying the pricing of options whose payoff is a function of\nSt1 , . . . , Sth ,\nwhere we choose h = 2m for simplicity. A naive approach, analogous to Algorithm 1, is\ngiven by Algorithm 6.\nAlgorithm 6 Naive version of the exact simulation algorithm for the SVJ model\n1:\n\nSimulate (Vti )hi=1 in the following order\n\u0010R\n\n\u0011\n\nVt1 ,Vt2 , * * * ,Vth .\n\n2:\n\nSimulate\n\n3:\n\nSimulate\n\nti\nti−1 Vs ds|Vti−1 ,Vti , i = 1, . . . , h.\n(Sti )Ni=1 in the following order\n\nSimulate\n\n(Nti )hi=1\n\n4:\n\n5:\n\n\u0010 N\nti\nSimulate ∏ j=N\nt\n\nSt1 , St2 , St3 , * * * , Sth .\nin the following order\n\ni−1\n\nNt1 , Nt2 , . . . , Nth .\n\u0011\n,\nN\nỸ\n|N\nt\nj\nt\ni , i = 1, . . . , h, in the following order\ni−1\n+1\nNt1\n\nNt2\n\nj=1\n\nj=Nt1 +1\n\n∏ Ỹ j , ∏\n\nNth\n\nỸ j , . . . ,\n\n∏\n\nỸ j .\n\nj=Nth−1 +1\n\n6.3. Bridge sampling for path-dependent options in the SVJ model. Now, similar to\nthe case of the Heston model presented in Section 5, we now propose an algorithm that\nallocates the early dimensions to variates with high variances. As such, we propose a\nbridge sampling algorithm for the SVJ model. We use the approach from Section 5 to deal\nwith the diffusion component (S̃ti )Ni=1 and the approach proposed by Baldeaux in [5] to\ndeal with the jump part. This results in Algorithm 7.\nThe next lemma, also presented as Lemma 3.1 in [5], allows us to perform Step 4 of\nAlgorithm 7 efficiently.\nLemma 2. Let s < u < t and k1 < k2 . Then conditional on Ns = k1 and Nt = k2 the\nincrement Nu − Ns has the binomial distribution with parameters k2 − k1 and (u − s)/(t − s).\nFinally, the next lemma provides the tool required to complete the final step of Algorithm 7.\nLemma 3. Given times t1 < t2 < t3 , the joint distribution of\nNt1\n\nNt2\n\nNt3\n\nj=1\n\nj=1\n\nj=1\n\n!\n\n∑ log(Ỹ j ), ∑ log(Ỹ j ), ∑ log(Ỹ j )\n\n\u0001\nconditional on Nt1 , Nt2 , Nt3 , is given by\n N\n\nt1\n  2\n\nlog(Ỹ j )\n∑ j=1\nσ1\nμ1\n Nt\n\n ∑ 2 log(Ỹ j )  Nt , Nt , Nt ∼ N  μ2  ,  σ 2\n1\n3\n2\n1\n j=1\n\n2\nNt3\nμ\nσ\n3\n1\n∑ j=1 log(Ỹ j )\n\nσ12\nσ22\nσ22\n\n\nσ12\nσs2  ,\nσ32\n\n\fQUASI-MONTE CARLO METHODS FOR THE HESTON MODEL\n\n13\n\nwhere μi = Nti μS and σi2 = Nti σS2 . Further, we have that\nNt2\n\nNt1\n\nNt3\n\nj=1\n\nj=1\n\nj=1\n\n∑ log(Ỹ j )\n\n∑ log(Ỹ j ) ∼ N(M, Σ)\n\n∑ log(Ỹ j ) ,\n\nwhere\n\nσ22 − σ12\n(x3 − x1 + m1 − m3 ) ,\nσ32 − σ12\n\nM := x1 + m2 − m1 +\nand\n\nΣ := σ22 − σ12 −\n\n(σ22 − σ12 )2\n.\nσ32 − σ12\n\nAlgorithm 7 Bridge version of the exact simulation algorithm for the SVJ model\n1:\n\nSimulate (Vti )Ni=1 in the following order\nVtN , Vt N , Vt N , Vt 3N , * * *\n2\n4\n4\n\u0011\nti\nti−1 Vs ds|Vti−1 ,Vti , i = 1, . . . , N.\n\n\u0010R\n\n2:\n\nSimulate\n\n3:\n\nSimulate (S̃ti )Ni=1 in the following order\n\nS̃tN , S̃t N , S̃t N , S̃t 3N , . . .\n2\n\n4:\n\n4\n\n4\n\nSimulate (Nti )Ni=1 in the following order\nNtN , Nt N , Nt N , Nt 3N , . . .\n2\n\n5:\n\nSimulate\n\nNti\n(∏ j=1\nỸ j )Ni=1\n\nconditional on\nNtN\n\nNt N\n2\n\n4\n\n4\n\n(Nti )Ni=1\nNt N\n4\n\nin the following order\nNt 3N\n4\n\n∏ Ỹ j , ∏ Ỹ j ∏ Ỹ j , ∏ Ỹ j\nj=1\n\nj=1\n\nj=1\n\nj=1\n\n6.4. Numerical results. To demonstrate our bridging technique, we estimate the price of\nan Asian call option where the asset price process is given by a SVJ model. We compare the prices obtained with standard Monte Carlo, QMC using Sobol points and Owen's\nscrambling algorithm, and the bridge construction using Sobol points and Owen's scrambling. These results are presented in Table 3 and agree with the ones presented in Table\n2: QMC methods improve on Monte Carlo methods, but the effectiveness of Monte Carlo\nmethods can again be enhanced via bridge constructions.\n7. F URTHER E XTENSIONS\nWe now propose a number of extensions to the results of the previous sections, in particular, the algorithms discussed in Section 5 and Section 6 can be modified to solve some\nfurther problems of interest to practitioners in finance. First, we discuss how to compute\n\"greeks\". Second, we show how our algorithm can be enhanced for barrier options. Third,\nwe provide an extension to the multidimensional and multi-asset setting. Fourth, we show\nhow to price path-dependent options when the asset price process follows the 3/2 model.\n\n\f14\n\nJAN BALDEAUX AND DALE ROBERTS\n\nTABLE 3. Standard errors of Asian option price where the asset price\nprocess is given by a SVJ model using Monte Carlo (M), Quasi-Monte\nCarlo (Q), and the Bridge Quasi-Monte Carlo (B) algorithms. These\nvalues are based on 30 independent batches and m trials.\nn\n4\n\n8\n\n16\n\n32\n\nm:\nM\nQ\nB\nM\nQ\nB\nM\nQ\nB\nM\nQ\nB\n\n26\n0.1354\n0.0549\n0.0595\n0.1313\n0.0488\n0.0455\n0.0786\n0.0618\n0.0520\n0.1218\n0.0615\n0.0359\n\n27\n0.0904\n0.0401\n0.0403\n0.0873\n0.0308\n0.0235\n0.0708\n0.0415\n0.0349\n0.0622\n0.0318\n0.0327\n\n28\n0.0717\n0.0293\n0.0217\n0.0442\n0.0304\n0.0224\n0.0447\n0.0312\n0.0196\n0.0508\n0.0353\n0.0193\n\n29\n0.0525\n0.0116\n0.0214\n0.0421\n0.0198\n0.0151\n0.0427\n0.0185\n0.0173\n0.0346\n0.0213\n0.0140\n\n210\n0.0254\n0.0064\n0.0171\n0.0284\n0.0188\n0.0088\n0.0278\n0.0109\n0.0100\n0.0265\n0.0146\n0.0105\n\n211\n0.0199\n0.0055\n0.0041\n0.0200\n0.0089\n0.0087\n0.0199\n0.0088\n0.0069\n0.0172\n0.0084\n0.0052\n\n212\n0.0152\n0.0042\n0.0032\n0.0089\n0.0031\n0.0044\n0.0127\n0.0062\n0.0058\n0.0116\n0.0046\n0.0031\n\n213\n0.0105\n0.0026\n0.0029\n0.0078\n0.0027\n0.0036\n0.0107\n0.0035\n0.0023\n0.0082\n0.0037\n0.0019\n\n214\n0.0065\n0.0018\n0.0015\n0.0060\n0.0016\n0.0027\n0.0060\n0.0021\n0.0015\n0.0060\n0.0020\n0.0012\n\nOption parameters: S = 100, K = 100, V0 = 0.010201, κ = 6.21, θ = 0.019, σ = 0.61, ρ = −0.70,\nr = 3.19%, λ = 0.11, μs = −0.1391, and σs = 0.15, with n time monitors over the time period [0, 1].\n\n7.1. Computation of greeks. In a subsequent paper by Broadie and Kaya [13], it was\nshown how to modify their exact simulation algorithm to compute greeks. We now summarize their methodology and show how to adapt their method to our bridge algorithms\nfor path-dependent options. To simplify the exposition, we focus on the Heston case, but\nwe can also handle the SVJ case. We discuss the pathwise (PW) and the Likelihood Ratio\n(LR) method [11, 24]. Using the notation from [13], we assume that the option price is\ngiven by\nα (θ ) = E [ f (θ )] ,\nwhere f denotes the discounted payoff function and θ the parameter of interest, i.e., we\nare interested in computing α ′ (θ ). Regarding the PW method, we have\n\u0002\n\u0003\nd\nα ′ (θ ) =\nE [ f (θ )] = E f ′ (θ ) ,\ndθ\nassuming the interchange of differentiation and integration is permitted. For the LR method,\nwe consider θ as a parameter of the transition density of the random variable under consideration, say X. Denoting this density by gθ (x), we have\n\nα ′ (θ ) =\n\nd\nE [ f (X)] =\ndθ\n\nNow, we rewrite this as\n\nα (θ ) =\n′\n\ng′ (x)\n\nZ\n\nRd\n\nZ\n\nRd\n\nf (x)\n\nd\ngθ (x)dx .\ndθ\n\n\u0015\n\u0014\ng′θ (X)\ngθ′ (x)\n.\ndx = E f (X)\nf (x)\ngθ (x)\ngθ (X)\n\nThe quantity gθ (x) is also known as the score function, and is of course independent of the\nθ\nparticular payoff under consideration. Clearly, both approaches rely on the interchangeability of differentiation and expectation, and we refer the reader to [11, 24] for details.\nTo be able to apply the LR method, we need to have access to the density, denoted by\ngθ (x) above. To achieve this, we apply a conditioning argument, from the law of iterated\nexpectations,\n\n\fQUASI-MONTE CARLO METHODS FOR THE HESTON MODEL\n\nE [ f (X)] = E [E [ f (X)|Y ]] ,\n\n15\n\n(5)\n\nwhere Y is a vector valued random variable. For the Heston model, X will correspond\nto values of the stock price at discrete time intervals along a path, and Y will be a set of\nstate variables recording information about the variance path. To derive the LR and the\nPW estimator, Broadie and Kaya differentiate inside the expectation operator in (5). If the\ninterchange of differentiation and integration is justified for the left hand side of (5), it is\nalso justified for the right hand side. Though the PW approach can be applied to the left\nhand side of (5), in [13] it is applied to the right hand side, to ensure the computational\ntimes are comparable.\nTo show how to apply the approach, we fix a partition of the time interval, 0 = t0 <\nt1 < * * * < td = T . As in the previous sections of the paper, we are interested in pricing\na path-dependent option whose payoff is a function of the stock price vector (St0 , . . . , Std ).\nAssuming that we have simulated a path of the variance process using the first two steps\nof the algorithms in Sections 5 and 6 and consider two consecutive times ti < t j . From\nRt √\nRt\nSections 5 and 6, we obtain values of ti j VS ds and ti j Vs dWs1 . Define\n\nσ̄ 2j :=\n\nRt\n\n(1 − ρ 2) ti j Vs ds\n,\nt j − ti\n\nand\n\n\u0013\n\u0012\nZ tj √\nZ\nρ2 tj\nξ j := exp −\nVs dWs1 .\nVs ds + ρ\n2 ti\nti\nThen given Sti , and the variance path, the value of St j can be expressed as\n!\nσ̄ 2j\np\nSt j = Sti ξ j exp (r −\n)(t j − ti ) + σ̄ j t j − ti Z ,\n2\n\nwhere Z is a standard normal random variable. Hence we take Y in (5) to be the variance\npath, and hence reduce the distribution in the inner expectation to a sequence of lognormal\nrandom variables, which is crucial to the LR method, as we need to be able to compute the\nscore function. Again, as an example of a payoff, we consider again an Asian option with\n\u0001+\nstrike K, expiry T and payoff d1 ∑di=1 Sti − K . Once the pathwise and likelihood ratio\nestimates are given, the way to employ the algorithm from Section 5 becomes obvious. As\nsuch, to simplify notation, we set S̄ = d1 ∑di=1 Sti , define the time increment as ∆ti := ti −ti−1 ,\nand pose\n\u0001\nlog(Sti /(Sti−1 ξi )) − (r − 12 σ̄i2 )∆ti\n√\n,\ndi =\nσ̄i ∆ti\n\nwhere σ̄i2 is the variance between ti−1 and ti . Then the pathwise and likelihood ratio estimates are as follows.\n7.1.1. Pathwise (PW) estimators.\nDelta\nRho\n\n: e−rT 1S̄≥K\n: e\n\n−rT\n\n1S̄≥K\n\nS̄\n,\nSt0\n!\n1 d\n∑ Sti ti − T (S̄ − K) .\nd i=1\n\n\f16\n\nJAN BALDEAUX AND DALE ROBERTS\n\n7.1.2. Likelihood ratio estimators.\nDelta\n\n: e−rT (S̄ − K)+\n\nGamma\n\n: e−rT (S̄ − K)+\n\nRho\n\n: e−rT (S̄ − K)+\n\n\u0012\n\n\u0013\nd1\n√\n,\nSt0 σ̄1 ∆t1\n!\n√\nd12 − d1σ̄1 ∆t1 − 1 2\nσ̄1 ∆t1 ,\nSt20\n√ !\nd\ndi ∆ti\n−T + ∑\n.\nσ̄i\ni=1\n\n7.2. Barrier options. Consider a barrier option with monitoring dates (t1 , t2 , . . . , th ),\nwhere we choose h := 2m for simplicity. If the option is not knocked out at maturity\nT = th , it pays off f (ST ). Following the approach of Glasserman and Staum [26], because\nof the knock-out feature, (St )t≥0 takes a value in R+ ∪ ∆, where ∆ is an absorbing state. If\nS crosses the barrier at time ti , the option is knocked out, and for all j ≥ i, S j = ∆. Define Ai to be the indicator function 1(Sti 6= ∆), so Ai = 1 means that the option is alive\nat time ti . Assume the barrier is a price level H < S0 , so Ai = 1 if the stock price has not\ncrossed below the barrier H by step i. A down-and-out call in this model has the discounted\npay-off Am e−rT (ST − K)+ , where K is the strike price, r the constant interest rate, T = th\ndenotes maturity. This allows us to propose a naive approach to pricing a barrier option in\nAlgorithm 8.\nSampling conditionally on one-step survival uses Algorithm 8 but in step 3 we use (6)\nwhere U = (1 − p(Sti )) + V p(Sti ), with V uniformly distributed on (0, 1), and\n\u0011\n\u0010\nRt\np(Sti ) = P Sti+1 ≥ H Sti ,Vti+1 ,Vti , tii+1 Vs ds\n\u0010 \u0011\n\n\nSt\nlog Hi + m(ti ,ti+1 )\n.\n= Φ\nσ (ti ,ti+1 )\n\nWe refer the reader to Section 2.2 in [26] and in particular equations (11), (12), and (13).\nAlgorithm 8 Bridge version of the Broadie-Kaya exact simulation algorithm\n1:\n\n1 or Algorithm 2\nSimulate \u0010\n(Vti )hi=1 as in Algorithm\n\u0011\nR ti\n\nti−1 Vs ds|Vti−1 ,Vti\n(Sti )hi=1 as follows:\n\nfor i = 1, . . . , h.\n\n2:\n\nSimulate\n\n3:\n\nVs ds, set\n\u0001\n(6)\nSti+1 ← Sti exp m(ti ,ti+1 ) + σ (ti ,ti+1 )Φ (U) ,\nR\n√\nR\nR\nt\nt\nt\nwhere m(u,t) := r(t − u) − 21 u Vs ds + ρ u Vs dWs1 and σ 2 (u,t) := (1 − ρ 2 ) u Vs ds,\nwhere U is uniformly distributed on (0, 1) and Φ denotes the standard normal cdf.\nSimulate\n\nGiven Sti , Vti , Vti+1 , and\n\nR ti+1\nti\n\n−1\n\n7.3. Multi-asset stochastic volatility models. In this subsection, we show that the approach discussed in this paper can also be extended to a multi-asset stochastic volatility\nsetting. When studying multidimensional stochastic volatility models, it is convenient to\nspecify the model in such a way that the resulting multidimensional stochastic volatility\nprocess is an affine process [20, 22]. For affine stochastic volatility models, characteristic\nfunctions are known to satisfy a particular set of Ricatti equations, resulting in a tractable\nmodel in which path-independent European options can be efficiently priced using Fourier\n\n\fQUASI-MONTE CARLO METHODS FOR THE HESTON MODEL\n\n17\n\ntransforms [16]. As we now demonstrate, the methodology developed in this paper is particularly amenable to the affine structure of the model: To be precise, we introduce two\nstock price processes, S1 and S2 , and three variance processes, V 1 , V 2 , and V 3 . We model\nthe covariation between the stock prices via the variance processes as\n\u0012\n\u0013\nq\nq\ndSt1 = St1 rdt + Vt1 dZt1 + Vt3 dZt3 ,\n\u0013\n\u0012\nq\nq\ndSt2 = St2 rdt + Vt2 dZt2 + Vt3 dZt3 ,\nwhere for i = 1, 2, 3 we have\nq\n\u0001\ndVti = κi θi − Vti dt + σi Vti dWti ,\n\nZti = ρiWti +\n\nq\n1 − ρi2Bti ,\n\nwhere (W 1 ,W 2 ,W 3 , B1 , B2 , B3 ) is a standard six-dimensional Brownian motion. We point\nout that each stock price process corresponds to a Bi-Heston model, as introduced by\nChristoffersen, Heston, and\nin [17]. The stochastic covariation between S1 and\nR t Jacobs\n2\n1\n2\n1\n2\n3\nS is given by hS , S it = 0 Ss Ss Vs ds. Using the terminology of [20], this model is an\nA3 (5). As in Section 2, we use the following representation for stock prices:\n\u0013\n\u0012\nZ\nZ\n1 t 3\n1 t i\ni\ni\nV ds −\nV ds\nSt = S0 exp rt −\n2 0 s\n2 0 s\n\u0013 q\n\u0012 \u0012\n\u0013\nZt\nZ tq\nρi\ni\ni\ni\ni\n2\ni\nV − V0 + κiVs ds − κiθi t + 1 − ρi\n× exp\nVs dBs\nσi t\n0\n0\n\u0013\n\u0013\n\u0012 \u0012\nZt\nZ tq\nq\nρ3\n3\n3\n3\n3\n2\n3\nVt − V0 + κ3Vs ds − κ3θ3t + 1 − ρ3\nVs dBs ,\n× exp\nσ3\n0\n0\nwhere i = 1, 2. From this representation, it is now clear how to produce an algorithm which\nallows us to handle multiasset stochastic volatility models. We propose this as Algorithm 9.\nAlgorithm 9 Exact Simulation Algorithm for the Multiasset model\n1:\n2:\n3:\n\n4:\n\n1 ,V 2 ,V 3 using the noncentral χ 2 -distribution\nSimulate V\nR tt 1t t 1 R t 2\nR\nSimulate 0 Vs ds|Vt , 0 Vs ds|Vt2 , 0t Vs3 ds|Vt3\nFor i = 1, 2, 3; Compute\nZt\nZ tq\n1\nVti dWsi = (Vti − V0i + κiVsi ds − κi θit)\nσi\n0\n0\n\nSimulate log(St1 ) ∼ N(μ1 (t), σ̃12 (t)), where\nZ\nZ\nZ tq\nZ tq\n1 t 3\n1 t 1\nVs ds −\nVs ds + ρ1\nμ1 (t) = log(S01 ) + rt −\nVs1 dWs1 + ρ3\nVt3 dWs3\n2 0\n2 0\n0\n0\n\nσ̃12 (t) = (1 − ρ12)\n\nZ t\n0\n\nVs1 ds + (1 − ρ32)\n\nZ t\n0\n\nVs3 ds\n\nand log(St2 ) ∼ N(μ2 (t), σ̃22 (t)), where\n\nμ2 (t) = log(S02 ) + rt −\nσ̃22 (t) = (1 − ρ22)\n\nZ t\n0\n\n1\n2\n\nZ t\n0\n\nVs2 ds −\n\n1\n2\n\nVs2 ds + (1 − ρ32)\n\nZ\n\nZ t\n0\nt\n\n0\n\nVs3 ds + ρ2\n\nVs3 ds.\n\nZ tq\n0\n\nVs2 dWs2 + ρ3\n\nZ tq\n0\n\nVs3 dWs3\n\n\f18\n\nJAN BALDEAUX AND DALE ROBERTS\n\nWe point out that Algorithm 9 samples the joint distribution (St1 , St2 ). However, from\nAlgorithm 5, it is clear how to modify Algorithm 9 to allow for path-dependent payoffs,\ni.e., how to sample the joint distribution\n(St11 , . . . , St1d , St21 , . . . , St2d ).\n7.4. 3/2 Model. The 3/2 model was introduced by Heston in [29], see also [15, 33, 39].\nUnder the 3/2 model, the stock price is given by\n√\n√ q\ndSt\n= rdt + Vt ρ dWt1 + Vt 1 − ρ 2dWt2 ,\nSt\ndVt = κ Vt (θ − Vt ) dt + ε Vt\n\n3/2\n\ndWt1 .\n\nRecently, Baldeaux [3] showed how to modify the Broadie and Kaya approach from Section 2 to handle the 3/2 model: First, we introduce the process Xt = Vt−1 , t ≥ 0, whose\ndynamics are given by\n\u0001\n√\ndXt = κ + ε 2 − κθ Xt dt − ε Xt dWt1 .\n(7)\nIt is now easily verified that the stock price Su is given by\n\u0012\nZ u √ \u0001\nZ\nZ u\nq\n−1\nXs\nSt exp r(u − t) − 21\n(Xs )−1 ds + ρ\ndWs1 + 1 − ρ 2\nt\n\nt\n\nt\n\nu\n\n√ \u0001−1\nXs\ndWs2\n\n\u0013\n\n.\n\nEquation (7) shows that X = {Xt , t ≥ 0} is a square-root process. We recall the algorithm\npresented in [3] for the exact simulation of the 3/2 model in Algorithm 10. As for the\nAlgorithm 10 Exact Simulation Algorithm for the 3/2 model\nSimulate Xu |Xt using the noncentral χ 2 -distribution\nR u ds\n2: Simulate t X\n|Xt , Xu\ns\n\u0001−1\nRu √\n3: Recover t\ndWs1 from\nXs\n\u0013Z u\n\u0012 \u0012 \u0013 \u0012\n\u0013\nZ u √ \u0001\nds\nXt\nε2\n1\n−1\n+ κ+\n− κθ (u − t) .\nlog\nXs\ndWs1 =\nε\nXu\n2\nt Xs\nt\nR\nR u √ \u0001−1\n−1\nu\ndWs1 and t (Xs ) ds via\n4: Simulate Su given St , t\nXs\n\u0013\n\u0012\nZ u\nZ\n√ \u0001−1\n1 u\nXs\ndWs1 , σ 2 (t, u) ,\nlog(Su ) ∼ N log(St ) + r(u − t) −\n(Xs )−1 ds + ρ\n2 t\nt\nwhere\n\u0001 Z u −1\nXs ds .\nσ 2 (t, u) = 1 − ρ 2\n\n1:\n\nt\n\nHeston model, Step 2 is the difficult step and, as in Section 2, one proceeds by computing\nthe relevant Laplace transform [3]. We can use the bridge constructions for the squareroot process and the Brownian bridge from Section 5 for steps 1 and 3 of Algorithm 10\nrespectively, and handle Step 2 as in [3]. Consequently, we can use the techniques from\nSection 5 to also handle the 3/2 model for path-dependent options.\nR EFERENCES\n[1] Albrecher, H. and Predota, M., On Asian option pricing for NIG Lévy processes, Journal of Computational\nand Applied Mathematics, 172, 153–168, 2004.\n[2] Avramidis, A. N. and L'Ecuyer, P., Efficient Monte Carlo and quasi-Monte Carlo option pricing under the\nvariance-gamma model, Management Sci., 52, 1930–1944, 2006.\n\n\fQUASI-MONTE CARLO METHODS FOR THE HESTON MODEL\n\n19\n\n[3] Baldeaux, J., Exact Simulation of the 3/2 Model, International Journal of Theoretical and Applied Finance,\nto appear, 2012.\n[4] Baldeaux, J., Quasi-Monte Carlo for finance beyond Black-Scholes, ANZIAM J., 50, C884–C897, 2008.\n[5] Baldeaux, J., Quasi-Monte Carlo methods for the Kou model, Monte Carlo Methods and Applications, 14,\n281–302, 2008.\n[6] Baldeaux, J., and Dick, J., A construction of polynomial lattice rules with small gain coefficients, submitted,\n2010.\n[7] del Baño Rollin, S., Ferreiro-Castilla, A., and Utzet, F., On the density of log-spot in the Heston volatility\nmodel, Stochastic Processes and Their Applications, 120, 2037–2063, 2010.\n[8] Bates, D., Jumps and Stochastic Volatility: exchange Rate Processes Implicit in Deutsche Mark Options,\nReview of Financial Studies, 9, 69–107, 1996.\n[9] Benth, F., Groth, M., and Kettler, P., A quasi-Monte Carlo algorithm for the normal inverse Gaussian distribution and valuation of financial derivatives, International Journal of Theoretical and Applied Finance, 9,\n843 – 867, 2006.\n[10] Black, F., and Scholes, M., The pricing of options and corporate liabilities, Journal of Political Economy,\n81, 637–654, 1973.\n[11] Broadie, M., and Glasserman, P., Estimating Security Price Derivatives Using Simulation, Management\nScience 42, 269-285, 1996.\n[12] Broadie, M., and Kaya, O., Exact simulation of stochastic volatility and other affine jump diffusion processes, Oper. Res., 54, 217–231, 2006.\n[13] Broadie, M., and Kaya, O., Exact Simulation of Option Greeks under Stochastic Volatility and Jump Diffusion Models, Proceedings of the 2004 Winter Simulation Conference, eds. R. G. Ingalls, M. D. Rossetti, J.\nS. Smith, B. A. Peters, 2004.\n[14] Caflish, R. E., Morokoff, W., and Owen, A., Valuation of mortgage-backed securities using Brownian bridge\nto reduce effective dimension, Journal of Computational Finance, 1, 27–46, 1997.\n[15] Carr, P., and Sun, J., A new approach for option pricing under stochastic volatility, Rev. Derivatives. Res.,\n10, 87–150, 2007.\n[16] Carr, P., and Madan, D.B., Option valuation using the fast Fourier transform, Journal of Computational\nFinance, 2, 61–73, 1999.\n[17] Christoffersen, P. F., Heston, S. L., and Jacobs, K., The Shape and Term Structure of the Index Option Smirk:\nWhy Multifactor Stochastic Volatility Models Work so Well, Management Science, 55,1914–1932,2009.\n[18] Cont, R., and Tankov, P., Financial modelling with jump processes, Chapman & Hall, London, 2004.\n[19] Da Fonseca, J., and Grasselli, M., Riding on the Smiles, Working paper.\n[20] Dai, Q., and Singleton, K., Specification analysis of affine term structure models, The Journal of Finance,\n55, 1943–1978, 2000.\n[21] Dick, J., and Pillichshammer, F., Digital nets and sequences, Cambridge University Press, Cambridge, to\nappear, 2010.\n[22] Duffie, D., Pan, J., and Singleton, K., Transform analysis and asset pricing for affine jump-diffusions, Econometrica, 68, 1343–1376, 2000.\n[23] Gatheral, J. , The Volatility Surface: A Practitioner's Guide, Wiley Finance, 2006.\n[24] Glasserman, P., Monte Carlo Methods in Financial Engineering, Springer Verlag, 2004.\n[25] Glasserman, P., and Kim, K.-K., Gamma expansion of the Heston stochastic volatility model, Finance\nStoch., 15, 267–296, 2011.\n[26] Glasserman, P., and Staum, J., Conditioning on One-Step Survival for Barrier Option Simulations, Oper.\nRes., 49, 923–937, 2001.\n[27] Hartinger, J., and Predota, M., Simulation methods for valuing Asian option prices in a hyperbolic asset\nprice model, IMA J. Manag. Math., 14, 65–81, 2003.\n[28] Heston, S. L., A Closed-Form Solution for Options with Stochastic Volatility with Applications to Bond\nand Currency Options, Review of Financial Studies, 6, 327–343, 1993.\n[29] Heston, S. L., A simple new formula for options with stochastic volatility, Washington University of St.\nLouis (working paper).\n[30] Hong, H., and Hickernell, F., Algorithm 823: Implementing scrambled digital sequences, ACM Transactions on Mathematical Software, 29, 95–109, 2003.\n[31] Imai, J., and Tan, K. S., A general dimension reduction technique for derivative pricing, Journal of Computational Finance, 10, 129–155, 2007.\n[32] Imai, J., and Tan, K. S., An Accelerating quasi-Monte Carlo method for option pricing under the generalized\nhyperbolic Lévy process, SIAM Journal of Scientific Computing, 31, 2282–2302, 2009.\n\n\f20\n\nJAN BALDEAUX AND DALE ROBERTS\n\n[33] Itkin, A., and Carr, P., Pricing swaps and options on quadratic variation under stochastic time change models\n- discrete observations case, Rev. Derivatives Res., 13, 141–176, 2010.\n[34] Jeanblanc, M., Yor, M., and Chesney, M., Mathematical Methods for Financial Markets, Springer Finance,\n2009.\n[35] Korn, R., Korn, E., and Kroisandt, G., Monte Carlo Methods and Models in Finance and Insurance, Chapman & Hall, 2010.\n[36] Kyprianou, A. E., and Schoutens, W., and Wilmott, P., Exotic Option pricing and advanced L'evy models,\nWiley, 2005.\n[37] L'Ecuyer, P., and Lemieux, C., Variance Reduction via Lattice Rules, Management Science, 46, 1214–1235,\n2000.\n[38] Leobacher, D., Stratified sampling and quasi-Monte Carlo simulation of Lévy processes, Monte Carlo Methods and Applications, 12, 231–238, 2006.\n[39] Lewis, A., L., Option Valuation Under Stochastic Volatility, Finance Press, Newport Beach, 2000.\n[40] Makarov, R., and Glew, D., Exact simulation of Bessel diffusions, Monte Carlo Methods and Appl., 16,\n283–306, 2010.\n[41] Merton, R., Theory of rational option pricing, Bell Journal of Economic Management Science, 4, 141–183,\n1974.\n[42] Niederreiter, H., Random number generation and quasi-Monte Carlo methods, CBMS-NSF Series in Applied Mathematics, 63, SIAM, Philadelphia, 1992.\n[43] Owen, A. B., Randomly permuted (t,m,s)-nets and (t,s)-sequences, In: H. Niederreiter, and P. J.-S. Shiue\n(eds.), Monte Carlo and quasi-Monte Carlo methods in scientific computing, 299–317, Springer, New York,\n1995.\n[44] Owen, A. B., Monte Carlo variance of scrambled net quadrature, SIAM J. Numer. Anal., 34, 1884–1910,\n1997.\n[45] A. B. Owen, Scrambled net variance for integrals of smooth functions, Ann. Statist., 25, 1541–1562, 1997.\n[46] Ribeiro, C., and Webber, N., Valuing path-dependent options in the variance-gamma model by Monte Carlo\nwith a gamma bridge, J. Comput. Finance, 7, 81–100, 2004.\n[47] Schoutens, W., Lévy processes in Finance: Pricing and Financial Derivatives, Wiley, 2003.\n[48] Sloan, I. H., and Joe, S., Lattice methods for multiple integration, Oxford Science Publications, New York,\n1994.\n[49] Wang, X., and Sloan, I. H., Quasi-Monte Carlo Methods in Financial Engineering: An Equivalence Principle\nand Dimension Reduction, Operations Research, 59, 80–95, 2011.\n[50] Willard, G. A., Calculating prices and sensitivities for path-independent derivative securities in multi-factor\nmodels, J. Derivatives, 5, 45–61, 1997.\n[51] Yuan, L., and Kalbfleisch, J. D., On the Bessel distribution and related problems, Annals of the Institure of\nStatistical Mathematics, 52, 438–447, 2000.\nF INANCE D ISCIPLINE G ROUP , U NIVERSITY\nNSW 2007, AUSTRALIA\n\nOF\n\nT ECHNOLOGY, S YDNEY, PO B OX 123, B ROADWAY,\n\nM ATHEMATICAL S CIENCES I NSTITUTE AND R ESEARCH S CHOOL OF F INANCE , A CTUARIAL S TUDIES ,\nA PPLIED S TATISTICS , AUSTRALIAN N ATIONAL U NIVERSITY , ACT 0200, AUSTRALIA\n\nAND\n\n\f"}